{"text": "Oi Leute es ganz schön kalt Kurz aufs Thermometer Vision Ich würd mal sagen wir haben vielleicht sogar schon unter 10 Grad Warte mal kurz gucken. Irgendwelchen Gründen geht mein Homo System nicht auf. Oh jetzt geht er. Wir haben, okay 10,89 Grad Außentemperatur und innen drinnen ist es 19 Grad und bei mir ist es, wie viel ist hier? Zeig mal her. Mal kurz gucken. 19. Es ist ganz schön kalt, irgendwie mein 19 Grad ist normalerweise jetzt nichts, was dich irgendwie großartig schockt, aber nachdem man irgendwie 35 geworden ist noch, ging jetzt ganz schön schnell. Ich glaube ich mache die Heizung an. Wo habe ich denn meine Fertbedienung? Da. Warte mal kurz ein bisschen. Wobei, oder ich mache nicht warm, ich meine ich habe die Tür zu und ich habe zwei Rechner an. Das wird wahrscheinlich auch automatisch warm werden gleich, aber es ist ganz schön kühl. Zumal wenn ich die Heizung anmache, dann kostet es, weil ich habe eine Gasheizung. Hätte ich das mal gewusst vor ein paar Jahren, dass Gasheizung nicht so sinnvoll ist, aber das war zum damaligen Zeitpunkt das beste was man sich einbauen konnte, aber das wusstest du halt nicht. Kannst du das schlecht. Danach bist du immer schlauer. Hätte ich 1995 Apple Aktien gekauft, kannst du ja so nicht sehen. Du musst ja immer mit dem aktuellen Wissenstand davon ausgehen, dann kannst du nicht, fünf Jahre im Voraus sieht es dann alles immer rückwirkend total easy aus, hättest du es mal gewusst. Konntest du ja denn wissen. Ne, also das wird bestimmt teuer dieses Jahr mit Heizen und allem. Auf der anderen Seite, ich kann immer noch, also sollte es wirklich Probleme geben, so mit Gasversorgung und sonst was, ich kann ja immer noch mit meiner Klimaanlage heizen, ich glaube das mache ich jetzt auch. Aber ich mach die jetzt mal kurz an, passt mal auf, ich mach die jetzt mal an. Ich habe die glaube ich noch nie zum Heizen verwendet, wie geht das überhaupt. Das ist Kühlen, das ist Heizen glaube ich. Ok, Heizen auf 25, na 25 ist ein bisschen viel, das ist gut, aber hier machen wir mal Heizen auf 22 Grad mit der Klimaanlage, gucken wir mal ob das funktioniert, ich habe legit noch nie geheizt mit dem Ding, also wenn da gleich Rauch rauskommt oder so, dann mache ich es wieder aus. Ist das jetzt wieder ausgegangen oder? Ach ne, das ist total bescheuert eingestellt. Mal Up-Down, das macht gerade gar nichts meine Klimaanlage, ah ich glaube die muss kurz anlaufen, bis die anfängt zu heizen, ich glaube so lang sieht das so aus, als wäre die aus. Schauen wir mal, ich bin gespannt ob das Ding jetzt gleich anfängt zu heizen. Also ich habe es zumindest auf Heizen eingestellt, es sollte jetzt 3 Grad Wärmer hier drinnen machen gleich. Schauen wir mal, ich werde es sehen. Ja moi Leute, alle am Start hier schon sehe ich, guck mal hier richtig voll, der Rackman ist am Start, Key Game HD, Silvacross, hat den passenden Kicks dazu, Dan2Dev, Xynex, Nütt, der ist öfters da, ich weiß nicht wie ich ihn ausspreche, Tribool und auch wieder am Start, Xetor, der Monkpusher, Gamble 0, Doc, der entfiehlt der Tribool, der war hier oben schon da, Major Pain, der Drachenflieger ist auch am Start, Zaitara, Möb, Battle Sheep, Trapped, Toxin und User32DLL, das ist ganz wichtig, sonst kackt unser Windows ab. Ah jetzt geht die Klimaanlage los, Leute moin ich muss mal kurz drunter stellen, gucken ob es da jetzt warm rauskommt, da kommt es warm raus, primärisch, ich habe wirklich zum ersten Mal hier gerade gehalten, die knackst so komisch, warum knackst die Klimaanlage so komisch, ja das muss wahrscheinlich so sein, ich heiz gerade wirklich zum ersten Mal mit der Klimaanlage, mal gucken, aber es kommt warm raus, das ist schonmal ein gutes Zeichen für das es wohl funktioniert, tja, so und sonst Leute habt ihr euch ausgeruht, habt ihr ordentlich gepennt, also ich habe nicht sonderlich gut geschlafen, die Katze war dreimal an der Tür und die hat mich genervt, ich habe irgendein YouTube Video angemacht, als ich pennen gegangen bin, allerdings war ich so blöd, ja vielleicht kennt jemand was, was man dagegen machen kann, ich war so blöd und habe die YouTube, also ich habe in meiner YouTube Playlist was zum später anschauen, habe ich aufgemacht, habe das erste YouTube Video angemacht, bin dann mal eingepennt, das Problem ist, dass diese Playlist, egal ob du diese Playlist Funktion ein oder ausschaltest, immer weiterplayt und ich hatte dann irgendwelche ganz komischen Videos laufen, die man sich nicht angucken will, während man pennt und da konnte ich nicht richtig schlafen bei, weil es immer irgendwelche komischen Geräusche gemacht hat aus YouTube Videos, das habe ich aber nicht gecheckt, weil ich so halb gepennt habe, aber nicht richtig, genau, ne Autoplay aus bringt dir nichts, du kannst Autoplay nicht ausmachen in dieser, ja, ja das ist das einzige was hilft, Video in eine leere Playlist, genau, das ist das einzige was hilft, Autoplay kannst du nicht ausmachen für diese intern Playlist, weiß nicht, keine Ahnung, ich glaube du kannst es bestimmt irgendwie mit irgendeinem Timer auf deinem Handy machen, so nachdem du jetzt alles Audio aus oder so, irgendwelche Shortcuts oder so, das geht bestimmt, aber ich glaube das ist wirklich das einzige was man machen kann, das Video in eine leere Playlist packen, wahrscheinlich, ja, halt schon Usability pur, aber YouTube möchte halt einfach auch nicht, dass man aufhört zu gucken, YouTube will, dass man am besten den ganzen Tag durchgängig YouTube guckt, oder wie es mein Kumpel aus Dresden sagen würde, YouTube, der war ja früher der Meinung, das heißt YouTube, nicht YouTube, YouTube wie, ja bei vielen Sachen kannst du auch pennen, schlimm ist nur wenn du bei irgendwelchen hyperaktiven Let's Playern oder so funny Gameplay Leuten rauskommst, die schreien die ganze Zeit, weil wir wissen ja alles, wir wissen ja alle, es ist so, laut und schreien gleich funny, das hat man ja auf YouTube gelernt, wo ist das hier alles, ich habe nämlich wieder meinen Twitch Server umgestellt, ich benutze jetzt nicht mehr Amsterdam, ich benutze jetzt wieder Auto, also wahrscheinlich Frankfurt oder so, aber scheint zu funktionieren, keine Dropped Frames, über welches Betriebsleben guckt, wenn iOS ist, kannst du über die Uhr lernen, ja, wie gesagt, man kann es bestimmt nur über Shortcuts steuern, könnte ich mir vorstellen, also, zum, also es gibt ein paar Sachen, die gucke ich, die gucke ich gerne, die gucke ich gerne zum Pennen auf YouTube, und zwar eine der Sachen ist jetzt keine ASMR Videos oder so, aber so Restoration Videos, das ist total entspannend, wenn man sich sowas hier anguckt, so irgendwelche Leute, die altes Zeug wieder glänzen machen, wobei ich wette mit euch, dass vieles von diesen Restorations Videos auch fake ist, wisst ihr, ich hab letztens was gesehen, da ging es darum, wir haben ein Gameboy Color, nee nicht, nicht Gameboy Color, was für ein Ding ist gerade so wieder bisschen im Mini-Hype, Gameboy Advanced, ja, wir haben ein Gameboy Advanced zufälligerweise im Dreck gefunden, und machen den jetzt wieder fit, und das war halt auch so klar fake, haben wir das nicht sogar zusammen geguckt, Cleaning Videos, wird mir auch öfters empfohlen, in letzter Zeit so Teppich-Sauber-Mach-Videos, was es nicht alles gibt, das ist genauso, kennt ihr diese Low-Technology-Videos, also der Originaltyp ist ja eindeutig das hier, das ist auch der beste, er hier, das ist der originale, aber es gibt ganz viele Drittbrett-Fahrer-Channels, die sowas hier machen, und das ist halt komplett fake bei ganz vielen, da gibt es ja sogar Videos drüber, die zeigen dieses Gebiet, wo die irgendwelche komischen Unterwasser-Pools gebaut haben, und es sind dann drei Sachen direkt nebeneinander, und du siehst es in den Videos auch schon, dass es fake ist, manchmal steht ein Bagger im Hintergrund, manchmal steht ein Bagger im Hintergrund, oder ein Betonsack liegt irgendwo nebendran, und auf einmal ist eine Wanda, die vorher nicht da war, oder irgendein Arm ist im Bild, und es ist halt alles fake, ja, aber gut, ich mein, die haben halt rausgekriegt, dass man damit Geld machen kann, und wenn du irgendwo, was weiß ich, im armen Teil von Indonesien oder so wohnst und feststellst, du kannst tausende Euro verdienen mit YouTube-Fake-Primitive-Technology-Videos, dann machst du das. Generell, YouTube hat so viele, so vielen Fake-Content, das ist eigentlich ziemlich heftig. Oh ja, das ist, das ist, okay, das ist tatsächlich schon so, da ist die Grenze auch für mich überschritten, wo ich sag, hey, das sollte, also das sollte es nicht geben auf der Plattform, bei diesen anderen Fake-Videos denke ich mir halt, gut, letztendlich schadet es ja keinem, außer dass der Zuschauer verarscht wird, aber wenn du dann so Sachen hast, wie Leute, die irgendeine Katze nehmen, ins Rohr stecken, nur um sie danach zu retten oder sowas, ne, das sollte es auf der Plattform nicht geben. Es ist natürlich für YouTube schwierig zu unterscheiden, was ist Fake, was ist nicht Fake, und YouTube hat, wenn die Videos, das muss man ja auch immer klar sagen, YouTube hat ja, wenn die Videos gut ankommen und gut geguckt werden, nicht wirklich eigenes Interesse daran, dass es die Videos rausfiltert, die gut laufen. Die Reverse, da spielen sie die Videos rückwärts ab, wo die da nicht gerettet werden, was wahrscheinlich eher der Realität entspricht bei vielen dieser Videos. Also was ich tatsächlich manchmal ganz gerne gucke, das ist, ich weiß nicht mal wie der Channel heißt, das wird mir immer nur empfohlen, das ist so ein japanischer Channel, wo die auch dann zeigen, irgendeine Katze, die ausgesetzt wurde, oder irgendwie was beim Tierarzt und so, aber nachdem das was Japanisches ist, und das alles nicht so Fake wird, traue ich der Sache eher, zumal sie auch danach zeigen, wie sie die zum Tierarzt bringen, und dann irgendwie später, vielleicht sogar noch zwei, zweieinhalb Jahre später oder so, was dann ist, diese Aufwand macht halt kein Fake Channel. Scambaiter, ja Kid Boga ist eh das beste auf Twitch, ohne Scheiß, ich kann das nicht jeden Tag gucken, weil es ist schon, sag mal so die ganzen Scams, der Inder ist jetzt ja auch nichts irgendwie super Neues, aber ab und zu kann ich durchaus mal so zwei, drei Stunden am Stück Kid Boga gucken, also ohne Scheiß, das ist einer der wenigen Channels, wo ich es komplett nachvollziehen kann, dass der so viele Views hat und das dem auch komplett, wie soll ich sagen, so komplett dahintersteht, so komplett gönne, wo ich sage, jawoll, der Typ ist wirklich richtig gut da drin, der ist mega spontan, also das kann auch nicht jeder, aber es ist vor allem Content, der mir gefällt, andere Channels, die erfolgreich sind auf Twitch, die mir nicht gefallen, das geht mir halt sonst wo vorbei, okay, soll er halt erfolgreich sein, juckt mich jetzt nicht weiter, bei manchen Channels denke ich mir, mit so einem Scheiß kannst du erfolgreich sein, aber bei dem ist wirklich 100%, also das ist einfach der Beste in der Richtung, oder was heißt der Beste, einer der Besten, gibt ja noch genug andere gute, aber auf Twitch auf jeden Fall der Beste, und der hat es vollkommen verdient und vollkommen zurecht, so viele Zuschauer, der hat ja auch relativ klein angefangen, das ist ja erst seit so ungefähr, sagen wir mal so, zwei Jahren vielleicht, so richtig big, mit acht, neuntausend Zuschauern, aber dass die den Voice Changer nicht wiedererkennen, ich glaube, das liegt daran, die ganzen Scam-Innen, die haben so einen hohen Durchsatz an Leuten in ihren Call-Centern, die haben gar keine Chance, das zu lernen, warum genau macht er mit dem Akkuschrauber in dem Reichenraum, wahrscheinlich, weil es cool für Thumbnail aussieht, oder, tieferen Sinn hat, das lehr ich mir gerade, der macht nicht einmal was mit dem Akkuschrauber da drinnen, nö, ja gut, ich kann es aber verstehen, es ist ein gutes Thumbnail, es ist ein gutes Thumbnail, und es ist ja nicht von der Realität, die bauen ja wahrscheinlich einen neuen Rechner, nur halt nicht mit dem Akkuschrauber. Modern Warfare 2 Beta angespielt, stimmt, die läuft ja gerade auf der Playstation, hat jemand von euch schon gespielt, und was sagt ihr dazu, was sagt ihr zu MW2 Beta, also das einzige, was ich bisher gesehen habe von der MW2 Beta, wenn ihr ein gutes Video habt, können wir uns ja heute auch was angucken, aber das einzige, was ich bisher gesehen habe von der Modern Warfare 2 Beta, ist, dass die Time to Kill mega, mega schnell sein muss, so nach dem Motto, dein Haar weht um die Ecke, tot, ja, da brauchst du eine zweite, ist es schon eine fünfer oder noch eine vierer, weil dann, weil dann kannst du die vierer dort lassen und dir eine fünfer kaufen, ah, okay, ist schon eine fünfer, na dann, nee, dann nicht, schon die GTA 6 Leaks gecheckt, nee, GTA juckt mich auch ehrlich gesagt nicht großartig, ich, muss ich halt, die haben ja auch nicht so wirklich Interesse dran, GTA 6 rauszubringen, solange GTA online und das Zeug drum herum so wahnsinnig viel Geld einbringt, das ist eine Sache, wo ich mich wirklich frage, ob sie es noch irgendwann auf die Reihe bekommen ist Elder Scrolls 6, ob das mal irgendwann was wird, das bin ich mir nicht ganz sicher, gut, mein von Half Life 3 muss ich nicht anfangen, das ist ja schon over memed im Endeffekt, Elder Scrolls 6 ist ja wirklich ein Game, wo sie auch sagen, sie sind da dran, ich fürchte halt, wenn die sagen, sie sind da dran, das ist ungefähr so, wie wenn euer Chef zu euch kommt und sagt, wie sieht es denn hier mit den drei neuen Linux Servern aus und ihr stellt in dem Moment fest, fuck, ich hab's komplett vergessen und dann sagt ihr eurem Chef, ja, da bin ich gerade dran, ungefähr so stelle ich mir die Entwicklung von Elder Scrolls 6 vor, wann kommt eigentlich Overwatch 2 raus, ich bin immer noch nicht, ich bin immer noch unschüssig, ob ich mir das ach, das kann nicht mehr so lange hin, nächsten Monat, ich bin, wie gesagt, ich bin immer noch unschüssig, ob ich es mir überhaupt geben soll, ich meine, ok, es ist zum größten Teil, glaub, free to play, ich weiß nicht, wie es mit dem Singleplayer Content aussieht, geschweige denn, ob es den überhaupt noch geben wird, das war ja so eines der ersten Dinge, die sie erzählt haben, so wie sie gesagt haben, es gibt ja so eine Art Kampagne, ja interessiert mich wirklich, ob sie das hinbekommen haben, hast du eine Twitch, ja, hab ich, seit Release und ich hab irgendwie 3 Spiele für und seit 2 Jahren nicht angemacht, ne, hab ich nicht, ich hab aktuell noch meinen eigenen ESP, der das ausliest, ja, geht mir ähnlich, ich wills überhaupt nicht mehr haben, ich wills noch nicht mal installiert hab ichs mehr und irgendwie Bock Overwatch zu starten, hatte ich auch schon seit Ewigkeiten nicht mehr, also Blizzard, die haben so ein geiles Game rausgebracht und es dann einfach komplett über den letzten Jahr hinweg verkackt, ich mein, dass du Games lang supporten kannst und lang interessant halten kannst, hat man ja oft genug gesehen, ich mein, guckt euch mal an, Fortnite ist jetzt vielleicht nicht mehr das wahnsinnig krasse Überhype-Ding wie vor ein paar Jahren, aber immer noch saumäßig gut und macht saumäßig Geld, Apex auch, aber eigentlich wollt ich grad 2 komplett andere Beispiele sagen, genau, guckt euch mal Dota und LoL an, guckt euch Dota 2 und LoL an, die gibt's ewig, ich mein, die gibt's seit 2014 oder so und LoL gibt's glaub ich noch ein Ticken länger, guckt euch Dota 2 und LoL an, das sind Spiele, die haben irgendwie über ne Million tägliche Spieler, ne über ne halbe Million glaub, halbe Million oder wie, machts jetzt auch net fett, tägliche Spieler und das ist einfach immer wieder spielbar für die Leute, ja, also man sieht's an vielen Stellen, dass das geht, aber Blizzard hat's irgendwie nicht drauf gehabt bei Overwatch. Ja, das Riot MMO, da bin ich auch mal wirklich gespannt drauf, denen trau ich tatsächlich zu, dass da was Gescheites rauskommt. Ich mein, die haben's mit Valorant auch geschafft, einen relativ eigenständigen CS-Verschnitt zu machen, der doch weit genug davon weg ist, um als eigenständiges Spiel durchzugehen, wobei man halt sagen muss, Valorant ist alive, aber jetzt, also ich red jetzt mal nur von der E-Sport-Seite, weil selbst spiel ich das ja nicht, keine Ahnung wie das Ingame ist und wie viel Spieler das eigentlich hat, die E-Sport-Sache, die ist auch alive, aber das ist jetzt natürlich kein absolut riesen Game im E-Sport. Also, Valorant ist jetzt nix kleines, aber das ist auch kein, es ist kein Dota und kein LoL, es ist halt, da hat seine Zuschauer vielleicht ein bisschen mehr als StarCraft 2 Niveau, also E-Sport technisch, das ist da, da gibt's auch Teams und so, aber das ist jetzt nicht wirklich Mainstream E-Sport Valorant, aber immerhin, also ich meine, du musst erst mal ein neues Game rausbringen und das ist insofern ja auch ganz erfolgreich, ich denke mal, dass ich denen noch am ehesten zutraue, ein ordentliches MMO rauszubringen für die nächsten Jahre, da bin ich echt mal gespannt drauf, was da kommt, ist das MMO im LoL-Universum, ich hoffe ja nicht, so geil finde ich das nämlich nicht, aber wahrscheinlich, die werden ja auch blöd werden nicht. Wir müssen uns die New-World-Spieler-Zahlen angucken, ok, ich hab's hier noch auf, Sekunde, ich refresh mal schnell. Oh guck mal, die sind hochgegangen Leute, guck mal hier, Massive, is free weekend oder wie? Was da los, haben die den DLC released oder, warum, was ist da los, warum sind die letzten zwei Monate wieder hochgegangen? Davor ist es einfach nur runtergegangen, oh hier, woop, oh da geht's wieder hoch, den Hype um New-World, den Hype gab es vielleicht zwei Wochen lang, oder bei den Leuten, die nur deutschen Let's-Player folgen, vielleicht auch einen Monat lang, aber dann war's vorbei. Warum das überhaupt jemals einen Hype hatte, ja das ist eine berechtigte Frage, ich hab's in der Beta schon gesagt, dass das Spiel einfach lieblos zusammengewurschteltes Möchtegern-MMO ist, von Leuten, die anscheinend nicht wissen, wie man MMOs macht, aber ok, die ganzen gerade deutschsprachigen Let's-Player sind natürlich drauf eingestiegen, ist ja auch klar, gab ja auch Kohle, kenne ich ja nix Verwerfliches, aber natürlich sind die ganzen blöden Casual-Noobs da drauf gesprungen, so nach dem Motto, oh hier mein Lieblings-Let's-Player spielt das bestes Game ever, lululul, und tja, ja das stimmt nicht so ganz, also es gab News-Meldungen, dass New-World Grafikkarten killt, das war aber, das lag aber an den Grafikkarten nicht so sehr an New-World, New-World hat halt im Hauptmenü anscheinend keinerlei Sleep drinne gehabt und die haben quasi 100% das Hauptmenü mit 800 FPS gerendert oder so, das heißt die Grafikkarte war, wenn du im Hauptmenü warst, immer auf Anschlag und die Leute waren halt viel im Hauptmenü, weil das Spiel am Anfang massig Warteschlangen hatte und wenn die Grafikkarte dann halt so ein paar kleinere Probleme hatte, die sind dann halt, haben halt viele erst bemerkt dadurch, dass wenn du mehrere Stunden deine Grafikkarte auf 100% laufen lassen hattest. Also New-World ist, das habe ich am Anfang auch nicht verstanden, dass da Leute überhaupt drauf angesprungen sind, mir war es von Anfang an klar, dass das nur noch eine Hülle ist im Prinzip von Leuten, die versucht haben den MMO zu bauen, aber eigentlich nicht wissen was sie machen und das siehst du an New-World, ich mein, da muss ich mal überlegen, New-World hatte am Anfang als MMO so eine Art, ich weiß, dass es nicht genau das gleiche ist, so eine Art Client-Side-Hit-Detection in einem MMO, Alter, in einem MMO, könnt ihr euch das vorstellen? Leute, die, guck mal, du konntest am Anfang New-World im Fenstermodus rumschieben und du konntest nicht getroffen werden. Es gab übrigens genug andere MMOs, da war das auch so, in Dark war das auch teilweise so. Fenster-Dragon. Mario, danke schön für den Zapp. Echt, ist das noch in Entwicklung? Da habe ich seit drei Jahren nichts mehr von gehört. Ok, YouTube möchte unbedingt, dass wir das Video gucken, aber ich will das jetzt nicht gucken. Jetzt ist sie weg, YouTube! Alter! So, jetzt ist sie weg. W-w-wie ist es wieder?! Normalerweise reicht es bei YouTube, wenn man die Videos einmal anklickt und danach sind sie weg. Aber nein, YouTube, bis zur Meinung, ich will das da! Das will ich jetzt unbedingt gucken. Die YouTube AI hat nicht schnell genug gelernt. Sekunde ich muss mal kurz mein Headset entwirren. Ja Leute, gibt es sonst irgendwas spannendes Neues? Habe ich irgendwas die Woche verpasst? Gab es irgendwelche spannende News? Irgendetwas in der IT Welt passiert oder außer der Uber Hack? Das mit EVGA, dass die keinen Bock mehr auf NVIDIA haben, ja das habe ich mitgekriegt. Sonst noch irgendwas spannendes. NVIDIA wurde auch gehackt? Wirklich? Das habe ich noch gar nicht mitgekriegt. Zeig mal hier, News. Ne, sehe ich nix. Mitgehen jetzt zu 8 auf Bites, exellent. In China ist gerade ein Zerkreisung gefallen, hey immerhin besser als ein Schiff, da gibt es so viele Schiffe und mittlerweile, ok Schiffe fallen nicht um, Schiffe bleiben ja eigentlich nur noch stecken aktuell. Das habe ich, ja stimmt, das habe ich auch gelesen, ja genau, muss jetzt überall Zeiterfassung machen, was mich nicht weiter juckt, weil ich mache eh schon Zeiterfassung. Ich gucke mal kurz was die Woche, äh, kurz mal kurz was die Woche GitHub Trends war, das gucke ich einmal sonntags eigentlich immer ganz gern, StableDiffusion, ja das wundert mich nicht, weil AI und so, Charts, gut juckt mich nicht, Jason, Crack oder wie meinte der Jason Erfinder, eigentlich müsste es, eigentlich müsste es Jawsaw heißen oder so, PocketBase, ist das doppelt drin, guck mal das ist lustig, High Performance Programming in Python und was ist das C++, gut es sind halt irgendwelche C-Module für Python, aber trotzdem, so, nix spannendes würde ich sagen, Jellyfin mal wieder am Start, ja nö nix spannendes, mal so eine Frage, wie selten ist es, Moment was, dass man dem Unternehmen als Entwickler Linux nutzen darf, weil ich bin gerade irgendwie der Einzige in meinem Unternehmen, das kann ich schlecht sagen, also dort wo ich bisher gearbeitet habe, konntest du Linux verwenden, allerdings muss ich dazu sagen, dass es auch bei uns immer mehr Probleme gibt, da das nicht mehr zu erlauben, allerdings anscheinend ist es in letzter Zeit wieder ein bisschen lockerer geworden, weil ich darf wieder Linux auf mein Notebook draufhauen, auf der anderen Seite geht es auch bei uns eher in Richtung Bring Your Own Device, da bin ich mal gespannt wie sie das machen wollen mit den anderen Geschichten zusammen, aber was auch immer und nachdem ich eh zum größten Teil Homeoffice arbeite, Remote mit einem Jump Host, hab ich meine lokale VM und alles ist gut, ansonsten glaube ich, ich rate jetzt einfach mal, ich glaube, dass ganz viele Unternehmen eben in diesem Microsoft Active Directory Shit und alles muss super restriktiv sein und gemanagt sein und selbst Administratoren dürfen keine Adminsachen mehr auf ihren Rechnern machen, dass sie da ziemlich hängen geblieben sind und dass es bei vielen nicht erlaubt ist, was anderes zu verwenden als Windows, was für die meisten Anwender ja durchaus okay ist, aber in manchen Bereichen ist es halt doof, also sag mal so, wenn du Software entwickelst, gerade für Linux-Systeme oder selbst wenn du nicht für Linux-Systeme Software entwickelst, solange mich gerade Windows Desktop Software entwickelt, selbst wenn es Web-Anwendungen sind oder so, das hat durchaus seinen Charme, die Sache unter Linux zu entwickeln, gerade, ich meine, du kannst alles irgendwie unter Windows mit VSL machen, aber gerade die Kombination aus einem ordentlichen Package Manager, das aus native Docker Support, aus einem ordentlichen Terminal, die ganze Kombination ist einfach angenehmer oder aber, was auch viele machen mittlerweile ist halt, dass man Entwickler mit Macs ausstattet, habe ich jetzt auch schon ein paar Mal gehört, und ein Mac ist halt so, also der, noch der beste Kompromiss, wenn es nicht anders geht, aus irgend so einem Linux Unix-artigem Unterbau, ist eigentlich ein BSD, und bisschen Bling Bling, ja es gibt, es gibt, geht unter Windows, gibt es auch öfters Probleme, wir hatten beispielsweise mal eine Datei, die sich Con.pp nannte, das war eine Puppet Server-Config-Datei, Con.pp, und wie ihr wisst, unter Windows dürfen keine Dateien Con heißen, guck mal, kann ich, falls ihr mir das nicht glaubt, ich hoffe, das ist mittlerweile immer noch so, Con, ha, geht nicht, egal wie ihr die Datei nennt, ihr dürft eine Datei nicht Con nennen, also auch Con.hackle geht nicht, das sind reservierte Sachen, noch irgendwelche von alten DOS, von irgendwelchen alten DOS Device Names und sowas, und da hatten wir das Problem, wenn jemand unser Repo ausgecheckt hat, unter Windows, dann hat Git immer angezeigt, ihm fehlt eine Datei, weil Git die Datei nicht anlegen konnte, na die Hardware sollte doch eigentlich unter Mac gerade das Gute sein, oder? Weil die, also rein von der ED und so, wie uns das Apple immer verkauft, weil das halt genau zum OS passt, ist das so? Ich weiß nicht, ich verwende nicht regelmäßig macOS, das stimmt, das stimmt, durch WSL ist es tatsächlich erträglich geworden Windows zu verwenden, das ist tatsächlich so, ich hab lange Zeit unter Windows Alternativen verwendet, früher als es WSL noch nicht gegeben hat, ja, kennt auch jemand Sikwine, wie auch immer man das ausspricht, oder, äh, gegessen wir das andere hieß, Endlinux gab es noch und gab ein paar Versuche, aber WSL ist tatsächlich das beste, ich mein ich hab ja auch so ein bisschen sowas hier noch laufen, das verarscht aber wirklich bloß die BWL Leute auf den ersten Blick, da kann ich nichts zu sagen, von so Client Management hab ich keine Ahnung, ich denke für Client, für so Arbeitsbusiness Umgebung ist Active Directory tatsächlich eines der besten Sachen die es gibt, vor allem findest du Leute da, die sich damit halbwegs auskennen, Sikwas, Sikwin, Sikwin, hier, das da, das war mal sowas wie WSL, nur nicht WSL, sieht sehr alt aus, das sieht so alt aus, weil es das alte Windows Terminal ist, aber ja, aber jemand hat WSL gesperrt, ja, das ist wirklich Clown Fiesta, ja, das ist richtig dämlich, oder, könntest du ja mal was ordentliches machen mit deinem Windows Rechner, das geht aber nicht, das müssen wir sperren, weg damit, das ist gut, das spricht für deine Arbeit, ich habe keine Ahnung, aber solange die Beta nicht für den PC kommt, ich werde garantiert nicht meine Playstation, meine Release Playstation 4 dafür anwerfen, darauf läuft es wahrscheinlich mit 15 FPS oder so, und ich kann mit dem Controller absolut nicht umgehen, ich weiß, man kann mit dem Mausdastaturspiel, aber es ist auch eklig, wir dürfen nichts in der Cloud machen, bei uns ist das Gegenteil, bei uns wollen sie, dass du alles in der Cloud machst mittlerweile, wir hatten beispielsweise mal einen internen Fileserver für Backups und den wollen sie jetzt abschalten oder haben sie letzte Woche abgeschaltet und haben gesagt, ja, leg die Sachen doch in OneDrive und da habe ich mir auch so gedacht, soll ich jetzt meine kompletten Gigabyte Backups oder so mal nach OneDrive machen, was auch immer, mache ich halt keinen Backup mehr, hast du schon mal was zu SurrealDB angeschaut, ja, aber können wir heute im Stream auch machen, gibt es ja ein Fireship Video zu, ich kenne das Ding, ich habe mich auch schon ein bisschen beschäftigt diese Woche, weil ich es vom Ansatz her wirklich spannend finde, also das ist ja, ich zeige es mal kurz auf GitHub, das ist ja der Versuch, die ultimative Datenbank zu bauen, also quasi eine Datenbank, die alles kann, von SQL Style, NoSQL Style, Key-Value mäßig, Event Store, Time Series, alles, Craft-Based, alles, ja, Database, also alles, IoT, Backend, Cloud Database, Realtime, alles, ganz ehrlich, ich meine mal davon abgesehen, das ist ja irgendwie, das hat irgendwie zwei Leute als Core-Entwickler, ich bin gespannt, ob es den initialen Hype überhaupt gerecht werden kann oder überhaupt längere Zeit überlebt bzw. relevant werden wird, weil ich mal nur weil ein Projekt Hype hat und viele GitHub-Store heißen nicht zwangsläufig, dass es relevant wird. Warum es nicht MinusRS heißt, ganz ehrlich, da haben die bei mir riesen Pluspunkte gesammelt, dass sie nicht MinusRS heißen und hier nicht steht Written in Rust und Blazingly Fast, ich weiß gar nicht, ob Rust überhaupt hier drin vorkommt, auf der Webseite, irgendwo hier unten, ja, gar nicht kommt das vor, so muss es nämlich auch sein, weil ganz ehrlich, wenn ich eine Datenbank verwende und ich rede jetzt nicht von irgendeiner Embedded Datenbank, wo ich wirklich an die, an die, an das Interface, an die API dran muss, sondern eine normale Datenbank verwende, dann sollte es mir absolut wurscht sein, in was diese Datenbank programmiert ist, ich meine, wenn es mich interessiert und ich nachgucken will, okay, aber das sollte nicht meine Entscheidungsgrundlage sein, benutze ich diese Datenbank oder nicht, deswegen finde ich es gut, dass sie hier nicht so Blazingly Fast, Written in Rust, Rakete, Rust, Rust-Tashian-Style machen, die haben sicherlich noch mehr Issues und ganz viele schon geschlossen, also da bin ich wirklich mal gespannt, ob da am Ende was rauskommt, weil das ist sehr ambitioniert für zwei Leute und es ist halt die Frage, werden die in einzelnen Disziplinen so gut, dass es sich lohnt, weil es ist halt einfach mal so, in der Regel brauchst du halt keine Datenbank, die fünf verschiedene Sachen kann, sondern eine, die eines gut kann, also sprich, wenn ich eine normale Datenbank brauche, dann nehme ich halt Postgres und Postgres kann nicht nur, kann ja mittlerweile deutlich mehr als nur normales, relationales SQL-Gedöns, Postgres kann relativ gut Time-Series mittlerweile, kann relativ gut Volltext-Suche und kann sogar Volltext-Suche mit Sub-String-Matching, hat eingebauten JSON-Support und sonst was alles, also Postgres ist, was so klassische SQL-Datenbank angeht, eigentlich das beste, was du verwenden kannst, manch einer würde jetzt sagen Oracle, aber dazu kann ich nichts sagen und auf der anderen Seite habe ich keine zwei Millionen für Lizenzen übrig, aber Postgres ist das beste, was du verwenden kannst und in der anderen Welt hast du ja auch spezielle Produkte, ich muss ehrlich sagen, ich habe noch nie ein größeres Projekt mit MongoDB gemacht, also zu neuen SQLs kann ich insgesamt relativ wenig sagen, wo ich schon was mit gemacht habe ist, soll ich vergessen wie es heißt, InfluxDB, jetzt habe ich Time-Series, InfluxDB, aber ansonsten ganz ehrlich, in der Regel reicht das, was Postgres kann, dicker als das, und es ist selten, dass man sagt, ja ich brauche klassische SQL-Style-Datenbank, dazu aber auch noch Schemaless NoSQL plus Events plus Time-Series plus sonst was, keine Ahnung, vielleicht ist das aber auch so gut integriert, dass du dann tatsächlich wirklich das beste davon benutzen kannst für deinen jeweiligen Anwendungszweck und es dann doch Sinn macht, mehrere Ansätze in der gleichen Art, ich weiß es nicht, ich bin mal gespannt, ich bin wirklich gespannt was da rauskommt, es ist auf jeden Fall ein äußerst ambitioniertes Projekt und mal gucken wie das in zwei Jahren aussieht. Ihr habt von Oracle nach Postgres migriert, ja würde ich auch so machen, nein schon wegen den Lizenzkosten, wisst ihr eigentlich, ich habe das glaube ich schon ein paar mal erzählt, man kann es nicht oft genug erzählen, wisst ihr eigentlich, wenn ihr eine Oracle-Datenbank auf eine VM haut, was ja in der heutigen Zeit eigentlich was ganz normales sein soll, dass man eine Datenbank in der VM betreibt oder vielleicht sogar in irgendeiner Cloud-Umgebung oder wo auch immer oder sagen wir mal in der VM, wisst ihr eigentlich, dass ihr dann die Datenbank lizenzieren müsst, nicht für CPUs in der VM, sondern für CPUs im Host, also sprich ihr habt eine 24 kernigen ESX Cluster-Node und darauf habt ihr eine Oracle-Datenbank laufen mit 4 CPUs in der VM, dann müsst ihr 24 CPUs lizenzieren und nicht 4, weil Oracle sich gedacht hat easy money, du müsstest tatsächlich, wenn du deine Oracle-Datenbank auf einer Kiste laufen lässt auf eurem 128 CPU Hyper-V Cluster, da musst du 128 CPU Kerle lizenzieren, jaja so ist das bei Oracle, du kannst das ganze umgehen mit wer hätte das gedacht, Oracle-Virtualisierung verwenden, wenn du die Oracle-Virtualisierungslösung verwendest, die keine Sau verwendet außer für Oracle-Datenbanken, weil sie einfach unsinnig ist und eigentlich keine Daseinsberechtigung hat, also die ist absolut unsinnig, aber man kann damit Lizenzkosten sparen und dort musst du dann nur deine VM-CPU-Cores lizenzieren, ich weiß noch nicht mal wie diese Oracle-Virtualisierungslösung überhaupt heißt, weil die so unbedeutend ist, ist so, zumindest mit im Grund, das kenne ich nicht, war das ein Messenger, doch das habe ich mir tatsächlich schon angeguckt, nicht Virtualbox, die haben wir in irgendeiner Enterprise, Oracle-Virtualisierungslösung, das heißt einfach Oracle-Virtualisierungslösung, ok, also KVM, jetzt mal seriously Oracle, jetzt mal KVM, wirklich irgendwie hier versus VM-RV-Sphere, das ist ja wirklich, also nicht nur Äpfel und Birnen verglichen, das ist Hochhäuser mit Tiefgaragen verglichen, also das ist ja wirklich zwei komplett unterschiedliche Paar Schuhe, das ganze VM-Ware Ökosystem drumherum ist viel viel ausgereifter und besser als KVM, KVM ist ein Super-Virtualisierungsgrundlage, aber das kann man doch nicht mit dem gesamten VM-Ding vergleichen, nö, keine Ahnung, VM-V-Sphere ist eine komplette Virtualisierungslösung mit Management-Interface, Clusterverwaltung, Hochverfügbarkeit und alles und KVM ist erstmal das, eine Funktionalität im Kernel, mit der man KVMs starten und stoppen kann, was man sieht nichts mehr, ich hab die ganze Zeit was gesehen, ich hab hier den Vorschaubildschirm bei mir auf der Seite, ja schon so früh heute, es ist ja normal, ich schwätze ja eh immer meistens eine Stunde bevor wir anfangen Videos zu gucken, das Ding habe ich schon gesehen, aber nicht ausprobiert, vom Ansatz her eine coole Sache, gerade wenn man seine Fotos nicht irgendwie iCloud-Backup oder so machen will, wir lassen uns jetzt erstmal LevelCapture Baiten würde ich sagen, LevelCapture Bait und dann gucken wir uns SerialDB in 100 Seconds an, 100, 100 Seconds, NextLord, ja NextLord bin ich kein großartiger Fan von, ich mag NextLord nicht, nein noch nicht, das müssten wir eigentlich wirklich mal machen, ich weiß nicht ob ich das schon mal aufgeschrieben hab und es dann auch nie passiert ist, ach guck mal steht sogar schon drinnen, ich pack es mal oben hin, ja das müssen wir tatsächlich mal machen, nicht weil ich scharf auf Java bin, sondern ich bin mal gespannt ob die eine gescheite Sprache hingekriegt haben, was ich anbieten würde, irgendwas was ich in anderen Sprachen schon mal gemacht habe und ich nicht viel überlegen muss, muss ich mir mal irgendwas überlegen, weiß nicht, was macht denn eine gescheite Programmiersprache aus, tja, also ich würde sagen das wichtigste ist erstmal, dass sie in irgendeiner Weise eine gewisse interne Nachvollziehbarkeit und Logik hat, ich will jetzt wie gesagt, ich sag das absichtlich so abstrakt und nicht so nach dem Motto sie muss einfach zu lesen sein und sie postet das und das und wie, ja alles, aber das wichtigste ist, dass eine Programmiersprache eine gewisse Logik interne, also eine gewisse Konsistenz aufweisen muss, ja also sprich, wenn ich, was weiß ich, wenn ich eine Sache darin gemacht habe und weiß wie die funktioniert, dass ich dann ungefähr schon einen Plan habe wie andere Sachen funktionieren müssen bzw. dass es halt nicht entgegen, also keine Ahnung, nur mal ein Beispiel, mal angenommen, um eine Schleife zu machen, wir mixen jetzt einfach mal zwei Sprachen, ja, also mal angenommen, es gäbe eine Programmiersprache, die sowas hier macht und für einen if wäre es dann sowas, das fände ich bescheuert, ja, das sind so Sachen, wo ich meine, es braucht irgendwie so eine gewisse interne Konsistenz bei einer Programmiersprache, dass sie überhaupt für mich die Chance hat gut zu sein oder sich für mich zu eignen, noch bescheuerder wäre es natürlich, wenn man es hier mit Einrückung macht anstatt, also sowas finde ich zum Beispiel hart bescheuert, also wenn man da Klammern macht, dann gar nicht oder immer, weil ansonsten ist es einfach, warum kann eigentlich Notepad immer nur noch einen Andus Schritt, wo sind wir hier eigentlich, 1985 oder solche Sachen, das muss konsistent sein und das geht dann natürlich weiter, nicht nur mit der Sprache und den Schlüsselwörtern, ja die Schlüsselwörter sollten auch irgendwie halbwegs schlüssig sein, also was ich beispielsweise auch doof finde, ich weiß, dass es das manchmal gibt, also die Leute haben sich einfach an so Sachen wie while und for und for each und so gewöhnt, es gibt Sprachen, die sind der Meinung, sie müssen es jetzt komplett anders machen und nennen es dann repeat oder so oder einfach nur loop, ich glaube go macht das oder, macht go nicht einfach nur loop, kannst du in go nicht sowas hier machen oder war das eine andere Sprache, also das finde ich auch nicht gut, so gewisse Sachen haben sich etabliert, so und was ich auch persönlich relativ wichtig finde, dass die Sprache alles wichtige mit liefert, was man halt standardmäßig so braucht, im Gegensatz zu C++, C++ liefert zwar sehr viel Zeugs mit, sehr viel doppeltes Zeugs mit und unklares Zeugs, aber so in den Kerndisziplinen versagt die C++ Standard Library eigentlich komplett, du kannst in der C++ Standard Library keinen Webrequest machen zum Beispiel und ich finde im Jahr 2022 sollte es diese Option in einer Standard Library geben, dass ich ein HTTP GET Request mache oder dass beispielsweise die Standard String Klasse sowas wie to Upper und to Lower enthält, was sie mittlerweile macht, aber viele andere Sachen nicht oder sowas wie Trim oder Partition oder Replace, also im Prinzip alles was irgendwie die C++ Standard String Klasse nicht hat oder dass eine Sprache ordentlich Unicode Support hat, was C++ auch nicht wirklich hat, weil der String immer noch ein ahnungsloses Byte Array unter der Haube ist, was auch immer, zumindest das finde ich bei der Programmiersprache wichtig und dass eben die Sachen die mitgeliefert werden auch sinnvoll zu verwenden sind, ich meine ich zeige euch jetzt mal ein schönes Beispiel, ein unschönes Beispiel, hoffe da ist gleich ein ekliges Beispiel drinne, ne natürlich nicht, aber es wird schon eklig ja, ich meine das geht noch, das geht noch, hier fängt es schon an ja, also wenn du dir sowas hier anguckst, ja ich meine sie haben sich Mühe gegeben dass es irgendwie nur halbwegs lesbar hier ist, also C++ ist wirklich Beispiel für wie es unschön ist, also das wäre so das was mir spontan einfällt und ansonsten ob etwas eher in die funktionale Richtung geht, weil es gerade jemand geschrieben hat oder ob das klassisch objektorientiert ist oder was gibt es, was gibt es da sonst noch alles prozedural und sonst wobei das sind es ja alle in irgendeiner gewissen Art und Weise, ist doch eigentlich erstmal zweitrangig, das muss dir halt irgendwie zusagen und für den jeweiligen Anwendungszweck passen, daran kannst du jetzt nicht sagen ob es eine gute oder eine schlechte Sprache ist, das würde ich sagen das fällt schon eher in Richtung Geschmackssache und ob es eben für das Problem passt, aber so Sachen wie das der Sprache nicht inkonsistent sein soll ja, also beispielsweise bei Schleifen, Leerzeichen und bei Ifs Klammern verwenden soll, ich glaube da können sich alle drauf einigen. Was sagst du zu Xen, das ist auch nicht übel, hat die letzten Jahre über ein bisschen an Handheit eingebüßt, allerdings das ganze Shitrix Zeugs basiert ja immer noch auf Xen, keine Ahnung, ja das ist auch schon richtig cringe, aber es gibt ja mittlerweile was besseres, es gibt ja auch eine ordentliche Format API mittlerweile in C++, alles problemlos, das hat glaube ich noch kein Compiler implementiert, das ist auch ein richtig kompletter Müll bei C++, dass es keine richtige offizielle Referenzimplementierung gibt, ich verstehe schon warum, den Scheiß will keiner implementieren den die sich ausdenken, aber Leute ich wette mit euch gebe es eine offizielle Referenzimplementierung von C++, das Gremium würde nicht so ein Bullshit sich ausdenken wie sie sich jetzt ausdenken, weil sie den Kram selbst implementieren müssen, aktuell denken die sich irgendwas absolut unpraktikables aus und sagen dann ja ja Compiler Hersteller bau das mal irgendwie ein, zumal wenn der sagen muss in diesem Gremium sitzen ja die ganzen großen Compiler Leute mit dabei, aber C++ bräuchte wirklich mal eine offizielle Referenzimplementierung um auch an vielen Stellen solche Sachen aus dem Weg zu schaffen wie das irgendwas undefined ist oder so, dann ist es halt vielleicht im Standard undefined, aber alle orientieren sich dran wie sich die Referenzimplementierung verhält, ja aber so was gibt es nicht und aus diesem und ähnlichen Gründen wie das C++ immer noch gerne mit Header um sich schmeißt, weil immer noch keiner Module verwendet bzw. gar Modul Support implementiert hat, wird es auch nie so was geben wie den ordentlichen Package Manager für C++, es wird einfach auf alle Zeit kacke sein. Wie gut beherrschst du C-Sharp von 1 bis 10? Na ich will mich da jetzt nicht übertrieben loben, ich würd mal sagen 7, ich würd mal sagen 7, also ich kann alles in C-Sharp machen was ich machen will bzw. ich kann alles umsetzen was du in der Sprache halt so umsetzen kannst und was nahezu alles ist, aber natürlich hast du immer noch nach oben, also hast du immer noch Luft nach oben, also ich würde schon sagen, dass ich es an sich sehr gut kann, aber es gibt gerade, die haben mir die letzten paar Jahre über viel neues eingeführt, da fällt es mir manchmal immer noch schwer Anwendungszwecke zu finden, zum Beispiel wusste dir, dass man in C-Sharp mittlerweile schreiben kann, keine Ahnung, war, äh was mach ich denn, ja war, blub, irgendwie so oder ne, sag mal anders, sag mal anders, wusste dir, dass man mittlerweile so was hier schreiben kann in C-Sharp, if, wusste dir, dass das geht mittlerweile, das ist so ein Ding, das konntest du früher gar nicht machen und mittlerweile, ich glaube es hat zwei Sprachversionen oder geht das und ich merke immer noch, dass ich das, dass ich null checke und if checke, dass ich das viel zu umständlich mache, ich schreibe instinktiv sowas hier noch, wenn, wenn, also die oldschool, die oldschool Variante war, so zu checken, äh oder end, was weiß ich, oder, äh was weiß ich, irgendwie sowas, ja, irgendwie sowas hättest du früher, wobei das eigentlich keinen Sinn ergibt, so, ähm was du dann nachmachen konntest, ist, du konntest quasi sagen, äh is int zahl, wir machen das jetzt mal auf Deutsch, ne, das konntest du auch machen in der Zwischenzeit, aber sich an sowas zu gewöhnen, ähm, mach ich manchmal noch nicht so, wie man es vielleicht machen sollte, ist aber Gewöhnungssache, ja, deswegen würde ich jetzt allerdings, würde ich sagen sieben, zehn sind für mich die Leute, die an der Sprache selbst mitarbeiten, oder die dort Performanceoptimierung intern machen, da wirst du außer Microsoft Leute oder vielleicht John Skeet himself, ja, keinen finden und acht und neun sind halt wirklich die Experten, deswegen würde ich halt sagen sieben, aber wahrscheinlich ist es sogar zu niedrig, weil heutzutage ist ja der Trend hin, dass sich da jeder, ist aber übergebührend lobt, weil es sich einfach gut anhört und gut macht, heute hast du ja auch Leute, die mal Ubuntu in der VM installiert haben, haben jahrelange Linuxerfahrung, dann müsste ich sagen neuneinhalb oder so, weil zehn ist dann doch zu viel das Selbstgelobe, aber ich würde sagen, wenn man es mal ein bisschen bescheiden sieht, würde ich mal sagen eher sieben, aber auf dem Stand kann man alles umsetzen, was man umsetzen will, AWS nutzt auch KVM oder Xen, ja was denn jetzt, Xen, ja aber die benutzen glaube auch KVM, und wisst ihr was, ich hab letztens ne Linux VM in Azure installiert und hab festgestellt, das ist wohl anscheinend wirklich Hyper-V unten drunter, also Microsoft meins Ernst, was sagst du zu Tools wie WinPE, ist WinPE nicht dieses Minimal, dieses Minimal Boot Windows und Windows zu reparieren, ja genau, wer sehr gay Drissleck ist, weiß ich nicht, wahrscheinlich der WinPE Erfinder, hast du mal Lust was mit Kubernetes zu machen, ja hab ich, aber da bin ich nicht so der Pro, das heißt da müssen wir uns ein bisschen durchwurschteln hier, Module in C++, ja gibt's ja mittlerweile, keiner verwendet's, keiner unterstützt so richtig, und bis dieses ganze Hedder-File-Gewirr vorbei ist, da vergehen noch Jahrzehnte, ich predicte ja das wird nie so sein, ja, also der beste Experte, da muss ich tatsächlich mal ein Video zu machen, der beste Typ war immer noch der Mathe Profi der sich bei uns mal beworben hat und erzählt hat über was für mathematisch hochkomplexe Systeme er seine Abschlussarbeit, seine Doktorarbeit oder was auch immer geschrieben hat, ne nicht seine Doktorarbeit, seine Masterarbeit oder was auch immer, irgendwie so super komplexe mathematischen Sachen und da wurde er von einem der Leute bei uns gefragt um was es da genau ging und er konnte halt überhaupt nicht drauf antworten, also er hat irgendeinen Bullshit erzählt, da gibt's ganz viele Chebader und viele Chebader kommen im Prinzip auch damit durch, weil die Leute keinen Plan haben und sich einfach Chebaten lassen, K8S ist easy, das ist wahrscheinlich easy bis zu dem Zeitpunkt wo was nicht funktioniert und du rausfinden musst warum was nicht funktioniert oder die 3000 Zusatzprodukte die du verwenden musst bzw. verwendest mit der Zeit von Load Balancer bis Proxys bis Secrets Management bis Certificates Management bis Dashboarding bis sonst was, dann hast du da noch mal 3000 Container laufen um deine 5 produktiven Container zum laufen zu bringen, so 150 Euro nass, da bin ich ja mal gespannt, das habe ich mich ja vor ein paar Jahren auch mal dran versucht ein Low Budget 10 Gigabit nass zu bauen, mal gucken ob das mittlerweile besser geworden ist, das gucken wir uns jetzt gleich an, ich skippe da ein bisschen, weil das meiste ist nicht so, nicht so, das hat gestern jemand erzählt, das gucken wir jetzt mal, ich skippe da ein bisschen, weil 17 Minuten sind mitzuladen, ich finde das immer geil wie alle noch nass irgendwie aussprechen müssen, so nach dem Motto, als wüsste mittlerweile keiner was nass, als wüsste mittlerweile niemand mehr was nass heißt, hat doch jeder schon 50 mal gehört, also heute kannst du auch keinem hinter dem Ofen mit davor loggen, dass du krasse Experte bist wenn du weißt was nass ausgeschrieben ist, ich meine jetzt nicht ihn persönlich, was nass ausgeschrieben ist, das ist genauso wie die Leute die dir heute erzählen, wusstet ihr eigentlich, dass Super Mario 2 gar nicht Super Mario 2 war, dann denke ich mir auch immer, ja das weiß ich seit 15 Jahren oder so, damals konntest du noch Leute damit überraschen wenn du das denen erzählt hast, heute weiß das eigentlich jeder außer Leute die das letztens irgendwie als Letzte erfahren haben und jetzt denken ich muss es der Welt mitteilen, so gucken wir uns mal an, was gibt es hier, ok da schlaf ich schon mal ein, weil das muss ich mal vorspulen, also Components, ok geht schon mal los, geht schon mal los, normales Tower Gehäuse und wahrscheinlich keine Möglichkeit die Festplatten ordentlich rein und raus zu ziehen, außer das Gehäuse komplett auszuschalten, aufzumachen und die Platte rauszusuchen, das ist das was ich bei einem Nass als eines der allerwichtigsten Sachen erachte, dass du Festplatten einfach ohne großartiges schrauben und bauen und tun wechseln kannst. Ja gut, es ist halt ein altes Desktop Gehäuse, warum sollte das auch Compact sein, wass letzte Preis, ok weiter, weiter, jaja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, nicht sådan, das verbreitete aber ich habe das gefühl das sind das liegt an verschiedenen ländern und an verschiedenen regionen gibt es da irgendwie so eine so eine faustregel dass du sagen kannst keine ahnung die was weiß ich die die schotten sagen alle motherboards und die die california sagen alle mainboard oder so gibt es ein ich benutze beide ich sag nur mainboard in russland ist es garantiert mutterbord ja garantiert oder das ist das entsprechende auf russisch hat was mit dem alter zu tun also der typ ist nicht sonderlich alt gehe ich mal von aus ich glaube nicht dass die jüngeren motherboard sagen die werden die werden auch mainboard sagen egal was mal schauen was dann auch einer drin ist oh guck mal ganze zwei sata anschlüsse für eine nass nicht schlecht aber gut ich meine der kann der kann er hier noch was rein machen der kann er dann irgendwann pizzi express pizzi express die rein machen ja sagt mal leute ist das da unten ist das ein pizzi anschluss ja das ist ein pizzi anschluss pizzi express hat hier oben den kleinen hier alter monka es pizzi was hat er da ausgebuddelt in 2022 wo findest du denn heute noch ein mainboard was in irgendeiner art und weise auch nur ansatzweise so was drauf hat wie pizzi aber moment der hat schon blaue usb anschlüsse aber noch ein pizzi und vga schockt mich jetzt nicht aber was für eine mainboard generation ist das denn was ist das was für eine cpu 9 cpu was this motherboard originally came from an hp 200 g1 desktop and features a 4 core intel j29 cpu das ist gar nicht mal schlecht das ist ein low power intel board das ist die das ist die gleiche die gleiche generation die ich vorher bei mir in dem selbstgebauten selbstgebauten kiste hatte eine generation vorher glaub eine generation vorher ist das aber so schlecht ist das gar nicht warum hat das mainboard noch pci was ist denn da los ok ich rate mal ich rate jetzt einfach mal kann das sein weil das ja von irgend so einem enterprise business ding war dass hier drinnen ein management controller war den hp einfach seit 30 jahren immer den gleichen einbaut dass es gar nicht zur normalen verwendung gedacht ist also ganz ehrlich sachen über ebay klein anzeigen kaufen da kannst du es natürlich schon 150 euro nass nennen aber das ist ja nicht reproduzierbar du musst halt glück haben dass es bei ebay klein anzeigen was gibt also realistischer wäre es glaube ich eher in 250 euro nass zu bauen und dann zu sagen ja aber man kauft den kram neu oder sagt man so zumindest reproduzierbar ja reicht aber das ist nun ein pci express also das ist nur ein einfacher pci express und das mainboard ist so alt das ist wahrscheinlich noch pci express gen 2 ist das heißt darüber kriegst du auch gar nicht großartig was übertragen aber ganz im ernst für performance ist das ähnlich gebaut und wahrscheinlich kommt da auch nicht mehr als eine 1 gigabit netzwerkarte rein also ich doch generation 2 pci express also im prinzip gut er geht ja auf das ein was ich gesagt habe denn du kannst da auch ohne probleme 5 dran attachen das ist gar kein ding ich meine wenn du eh nur gigabyte rausholst am ende übers netzwerk dann ist ja auch egal dass das geht auf jeden fall das kriegst du auf jeden fall dicht das ist eine gute wahl 2,5 g finde ich gut das problem ist nur dass kaum einer 2,5 g fähige netzwerkhardware daheim hat ich glaube oder was heißt ich habe keine ahnung wie es bei euch daheim aussieht aber meine einschätzung nach haben die meisten leute entweder gigabit oder wenn die so so technologieenthusiasten sind wie ich dann haben die 10 gigabit allerdings auch nicht im ganzen haus sondern nur dort wo es sinn macht und so ist es bei mir halt auch ich habe meinen desktop mein server das war es reicht ja auch bei 10 gigabit angebunden an einem viel zu teuren 10 gigabit port switch ich meine ich habe ja einen 12 port sfp plus 4 4 port 10g kupferswitch aber ok weil es geht und der rest ist gigabit 2,5 g bringt dir wirklich was erst wenn du 8 port 2,5 g switcher bekommst für 50 euro auf amazon dann ist es was wir schauen mal kurz das interessiert mich jetzt tatsächlich ob es da schon was halbwegs was halbwegs erschwingliches gibt nicht nicht von ubiquity will ich gar nicht gucken ja so switches 2,5 5g gibt es kaum das was wie ab und dann gibt es 10g das ist doch kein switch es ist ein poe injector doch was ganz was anderes hier ein edi max edi max hatte jemals einer schon ein edi max switch ich kenne den hersteller überhaupt nicht edi max aber ok ganz ehrlich hier bewegen wir uns in einem erschwinglichen rahmen ja das ist ok das ist in ordnung tp link das ist ok kann man sich kaufen ganz im ernst ich glaube wir nähern uns dem punkt dass 2,5 g mainstream wird also wenn das noch ein bisschen im preis fällt und man vielleicht acht port switcher bekommt für so was hier dann gehe ich mal von aus dann wird sich das über kurz oder lang auch durchsetzen ja das finde ich das finde ich in ordnung hier das ist nicht nicht verkehrt ok weiter ja ja bei den mainboards ist schon klar aber das bringt ja nichts wenn du es auf mainboard hast du musst ja irgendwie in der in der netzwerk kommen und 99 prozent der leute haben daheim ein gigabit switch stehen oder aber wenn sie so verrückt sind wie ich schon seit ein paar jahren 10 gigabit die übrigens auch 2,5 können ist korrekt die haben schrotz stehen ja deswegen sage ich ja das muss noch billiger werden also ich denke mal wenn du für 50 euro schon 5 bis 8 port switch bekommst dann also ich denke wir sind noch nicht weit davon entfernt die nächsten paar jahre wird es denke ich was 2,5 angeht langsam aber sicher dann Richtung mainstream gehen es wird natürlich noch eine ganze weile dauern bis die großteil der leute daheim 2,5 g haben aber insgesamt finde ich auch mal gut also das würde ich nicht machen eine zweite netzwerkverbindung das würde ich nicht machen dann würde ich lieber in den sauren apfel beißen und mir jetzt für 150 euro in acht port in acht port 2,5 g switch kaufen bevor ich mit zwei netzwerkkarten rum hantiere was man sich überlegen könnte was ich eigentlich von der idee ganz gut finde ist dass man das gigabit interface als ich netzbar management interface verwendet und das hier als dateninterface das hat jetzt nicht wirklich so wie soll ich sagen keine handfesten vorteile weil es kann das eine oder das andere kaputt gehen und das 2,5 g kann das auch aber es hat den vorteil wenn du irgendwelche firewall regel machst oder irgendwelche konfigurationsänderungen machst und sonst wie dann ist die chance dass du dich vom management interface aussperrst bei diesem ding geringer und wenn man eh zwei netzwerkkarten hat denke ich kann man sich das überlegen es ist natürlich kein management interface wie on board wo du dann theoretisch auch ins bios kannst aber wenn man zwei netzwerkkarten hat kann man sich das überlegen gerade wenn man anfängt mit virtualisierung auf dieser kiste ist es tatsächlich gar nicht so doof zu sagen ich nehme jetzt eine netzwerkkarte und reicht die mal komplett in die vm durch wenn man zum beispiel darauf noch seine heimautomatisierung laufen lassen möchte wie das ist waste warum ist das waste der hat die interfaces doch eh warum soll er sie nicht benutzen ich würde kein zweites interface einbauen dafür aber wenn er sie eh hat kann er sie auch dafür benutzen wenn er zum beispiel noch seine heimautomatisierung laufen lassen will da drauf als vm dann wäre es vielleicht gar keine schlechte idee die gigabit netzwerkkarte in die vm durch zu reichen und die exklusiv dafür zu verwenden da kannst du das mehr als eigen eigenständige kiste sehen auf sehe ich geschmackssache mit 150 euro kommt er nicht mit storage dahin hat es so stor also stor irgendwas mit asus zu tun oder oder haben die das nur im im namen tatsächlich die haben was mit asus zu tun moment erstellt ein fertiges nass vor in dem video wo er selbst nass baut gut wenn die damit einverstanden sind ich finde ganz ehrlich also stor sollte mir auch mal die neuen acht terabyte oder 14 terabyte platten von ihnen schicken da mache ich auch ein video darüber wir gucken uns im stream sogar ihr neues nass an bei der gelegenheit sekunde ich muss gerade noch mal wieder in meine angebote gucken sekunde was habe ich denn wieder für für anfragen bekommen die woche hat mir irgendeine mail dabei so was haben wir denn hier zu bieten world class vpn vpn was world class vpn client youtube sponsorship wer ist es denn diesmal nord vpn steht gar nicht dabei ist ja auch geil steht überhaupt nicht dabei da steht einfach nur youtube sponsorship world class vpn client oder steht nicht dabei welcher ja super da weißt du weißt du bescheid was haben wir denn sonst noch attention youtube sponsor opportunity hello world was was leute ich check die anfragen doch nicht mal was wollt ihr überhaupt von mir china chinesen zeug ist es aus singapur ok ich habe keine ahnung was die leute ich habe legit kein platzen schimmer was die von mir wollen ok das natürliche anfragen ist komplett unsinnig meine güte ist wieder so viel schrott dabei also das mache ich alles nicht ok weiter vielleicht heißen die world class vpn ganz im ernst nachdem das irgendein china chinesen zeug ist könnte ich mir sogar vorstellen dass die world class vpn heißen ne ne heißen sie nicht findet man zumindest nix so thanks to our newborn child but i got things mixed up while also working on my previous unraid video with unraid was hat sein kind mit dem lass jetzt zu tun das habe ich jetzt nicht gecheckt 100 prozent recommended to use a single usb stick as the boot drive which is what i filmed when making this video ja gut es schreibt unraid unraid schreibt das mit dem usb boot drive doch eigentlich nur damit sie die id locken können und und geld verdienen das aus unraid sicht verstehe ich das however true nas which is the os will be using ansonsten würde ich mein system nicht von einem usb stick booten sondern einfach von der ssd usb stick booten geht nur so lange gut wie das system ansonsten komplett aus dem rammen läuft ansonsten ist usb stick booten doof usb rate eins leute ich gebe zu sowas habe ich auch schon mal gemacht ich würde ich würde es wahrscheinlich nicht wieder machen wisst ihr wisst ihr was ich auch schon immer mal machen wollte einfach weil es geht ein micro sd karten rate 6 einfach nur mal einrichten ist nicht es wird funktionieren es wird überhaupt es wird überhaupt nichts besonderes sein aber einfach nur weil es geht ich will es nicht benutzen ich will es einfach nur mal einrichten es ist easy einzurichten es wird funktionieren was hatte ich da geritten mit dem usb stick rate einfach dass ich mehr sata anschlüsse frei habe kann ich nicht machen weil ich nicht genug usb kartenleser habe dafür für den rate 6 brauchst du ja mindestens vier festplatten am besten aber 5 wenn es sinnvoll sein soll vier oder fünf da bräuchte ich quasi noch noch ein paar kartenleser dafür ich meine das ist dann auch abgedreht guckt mal usb auf mikro sd und dann da riefer 5 rate 6 okay das ist jetzt langweilig da baut es zusammen who cares leute eine sache die mir auch aufgefallen ist in letzter zeit weil ich ein paar mal jetzt staubsachen gereinigt habe man denkt ein staubsauger müsste doch eigentlich besser sein zum staub entfernen weil dann ist das staub gleich weg aber ganz im ernst du kriegst staub in der regel viel besser weg mit pusten anstatt mit saugen mit mit mit pusten kriegst du einfach viel mehr druck da drauf einfach einfach das ist auch so ein ding ich hab mir so eine druckluft so so so eine druckluftflasche gekauft so was hier in der richtung was das alles keck tornado ich habe mir so eine flasche gekauft compressed air schon vor einer weile die verwende ich ab und zu mal lohnt es sich lohnt es sich ein kompressor zu kaufen gibt es da was gibt es da gibt es da was billiges und und das so dinge sehe ich jetzt hier zum ersten mal diese dinger sehe ich jetzt hier zum ersten mal taugt das was so was hier das das sieht aus wie so eine dröte aber das ist doch die idee luft zu kaufen du kaufst keine luft du kaufst komprimierte luft das was du bezahlst ist quasi der dink der kompressionsvorgang und das verpacken was taugt denn da so als als von diesen geräten ich habe wirklich keinen plan davon nach was muss ich ihn da suchen blower gachi bass was xx power x power x power multi electric computer dusting clothes dryer air pump air sprayer blower blower vacuum cleat ok das widerspricht sich ein blower kann kein vacuum cleaner sein das ergibt absolut keinen sinn entweder puste der luft raus oder zieht luft rein in kombination ist das nicht möglich das kann ich beides gleichzeitig sein x power das ist quasi das ist quasi ein fön ein fön mit einem dünnen aufsatz oder wie aber mit akku x power und wie und wie stark puste das so dann gibt es in blau in schwarz in grün schwarz ist aber am billigsten aber der aufsatz bleibt weiter in schwarze nein habe ich nicht mitbekommen das habe ich nicht mitbekommen der uber hacker hat er noch mehr noch mehr gehackermant wo gibt es das zu sehen uber hacker rockstar news gucken wir mal hier was tons of 90 videos aus wie gta 5 weiß man halt nicht weiß man halt nicht weil die entwicklungsstand das ist interessant ja hier habe ich nicht mitbekommen 500 watt die schreiben da einfach mal irgendwas random dran oder ist das mit akku oder mit kabel leute das ist mit kabel nicht nicht mit akku mit akku wäre natürlich auch nicht schlecht muss ich mal überlegen ich finde es vom ansatz her eigentlich ganz cool sowas soll wir gucken jetzt mal das video fertig ja guck mal leute wir sind zwei eineinhalb stunden dabei und ich habe jetzt fünf minuten video geguckt eine halbe stunde keck weiter er kompressor er baut zusammen das ist guckt das ist eines der gründe warum ich ein nass in einem normalen gehäuse für blödsinn ich halte du hast festplatten die sind sogar festgeschraubt wenn der glück hast kannst es so rausziehen du musst jedes mal wenn in der festplatte verreckt das ding komplett vom strom machen rausziehen aufschrauben rausschrauben erst mal erkennen welche platte kaputt ist das heißt du musst dir auf jeden fall die seriennummer hin mit dem editing drauf schreiben die letzten paar stellen das deswegen das ist das ist in der handhabung eklig wie oft passiert das naja je nachdem wie viel platten du hast paar vier platten kann dir das schon mal passieren und selbst wenn es nur einmal alle was weiß ich einmal in drei jahren vorkommt oder so glaube ich das geht dir schon auf den sack genug wenn du dann das ding rausbauen musst wo es steht aufmachen muss aufschrauben muss ausmachen muss weil was bringt den rate wenn du die platte nicht wechseln kannst im laufenden betrieb du musst ja doch ausschalten wir sind auch schon neue platten verreckt wir reden hier nicht von irgendwelchen enterprise ringern wenn man nichts anderes hat als das gehäuse ja dann kann man das natürlich machen aber wenn man eh 150 euro ausgibt beziehungsweise geld ausgibt dann kann man sich auch irgendwas kaufen was besser für diese anwendung zweck geeignet ist das sind das sind nee das sind gar keine billigplatten das sind ganz brauchbare platten ja aber man müsste mal gucken was die für eine fehlerrate haben also bei vier platten wird jetzt nicht so häufig was kaputt gehen aber ich kann euch aus eigener erfahrung sagen ich hatte ja vor jahren mal ein selbst gebautes rate sechs mit damals glaube acht platten also doppelt so viel das waren damals noch zwei terabyte platten das ist schon eine ganze weile her und da ging öfters mal was kaputt also öfters da reden wir so in was weiß ich so ja ab und zu war es auch mal öfters ich würde sagen so im durchschnitt war da irgendwie so alle drei viertel ja oder so so alle alle zehn monate oder so war da mal irgendwas und sei es nur dass irgendeiner aus dem rate rausgeflogen ist weil sie der meinung war er hatte hatten fehler was meistens ja schon als anzeichen dafür sind dass sie bald den geist aufgibt also das war nicht nicht schön vielleicht ist es mit den platten ja anders aber trotzdem allein schon wenn man das aufschrauben muss abmachen muss ausschalten muss zum wechseln ist schon ist schon nicht schön weil man eh geld ausgibt kann man sich kann man sich auch was ordentliches kaufen so weiter ist ja schon das installation muss man sich angucken audio naja wie soll es performen gigabit kriegst du voll ohne frage gigabit zu saturaten ist wirklich keine kunst project files to our s&b share we were getting right speeds of about 150 megabytes pro second du kannst keine 150 megabyte bekommen weil 125 megabyte per gigabit voll ist du bekommst maximal 125 megabyte die sekunde so and over 200 megabytes per second at times while reading those files back this isn't crazy or anything but we're at least das ist einfach schwachsinn was wenn aus da anzeigt achso er hat 2,5 hat er nicht gesagt er verwendet den ein gigabit anschluss nee er hat gesagt er hat zwischen seinem pc und dem server die 2,5 gigabit karte ok dann habe ich nichts gesagt dann habe ich nichts gesagt dann war zu viel zu viel aluhelm nee nee dann ist ok dann ist in ordnung dann ist dann ist das alles alles ok ist taking advantage of the extra bandwidth we get with our two and a half gigabit connection ok as we set up ice guzzi das ist das mark actually sees our ice guzzi drive as any other local drive so i decided to compare that to a 7200 rpm 2 terabyte mechanical drive in my system and our diy nas definitely performed quite a bit better with solid improvements to sequential reads and writes das dürfte wahrscheinlich zum größten teil daran liegen weil das ding einen cache hat der größer ist weil irgendwo was gecasht wird also ach moment es ist sequential das ist nicht zugriffszeit ja gut das kann schon sein das deckt sich ja ungefähr mit dem was er auch bei seiner samba übertragung hatte and massive improvements to random reads and writes our ice guzzi drive looks a little less impressive when compared to a simple seda ssd but with ice guzzi and true nas we have the benefit of capacity as well as redundancy so there's a really good chance i'm going to actually try out editing off of this ice guzzi drive that way if there's well over a week now now i know some people are probably already tight stromverbrauch ist wahrscheinlich auch ordentlich being comments about what is or could go wrong with the system and that's probably fair because this isn't perfect by any means i know someone is going to mention reliability but if you're trying to run some sort of critical or intense workload off of a 150 dollar da hat er recht da würde ich eh nichts wichtiges drauflaufen lassen das stimmt schon das ist halt die frage das ist dann halt die frage warum baut man sich überhaupt wenn man der sache nicht vertrauen kann so überhaupt nicht wie er sagt also dann ist halt die frage warum hat man es überhaupt da kann ich mir einfach eine 8 terabyte platte in meinen desktop rechner reinschmeißen und gut ist er dabei lernt sie wahrscheinlich auch nicht sonderlich viel oder was ist halt mit so schiener chinesen bastel konstruktion ist halt so ein ding ja das ist tatsächlich das schöne wenn du da linux md rate oder irgendwas macht oder zfs rate oder sonst was du kannst an den nächsten beliebigen computer hängen und wieder starten ganz im gegensatz zu irgendwelchen hardware rate controller down time isn't great but it's not a massive ordeal for what i do if that's not the case for you well then maybe look into something higher in to suit your fine for my to 2.0 courts gut 150 euro was willst du großartig erwarten ist schon in ordnung kann man rechnerplatten eigentlich auch im rate betreiben was sind dann rechnerplatten du meinst du ganz normale nur noch 15 festplatten natürlich kannst du im rate betreiben das was er da eingebaut hat war auch nichts anderes als ganz normale nur noch 15 platten kannst alle platten im rate betreiben du kannst sogar mikro sd karten im rate betreiben nö ich habe sehr wenig berührungspunkte bisher mit proxmox gehabt außer ein paar sachen wo beim streamer gebastelt haben keine ahnung ich vermute aber mal wenn man vom enterprise sektor spricht und damit auch wirklich enterprise vermeint also was wo wirklich auch kohle drin ist und nicht irgendwie so small business werbeagentur oder sowas sondern welche mit millionen alti bg dann wird es auf jeden fall auf vm rauslaufen nicht auf proxmox kann man noch hatten im rate betreiben mich würde nicht wundern wenn 1900 was weiß ich war das 65 leute sich über so was gedanken gemacht hätten nee ich glaube ich müsste mich da auch mal melden und fragen wie es jetzt aussieht vielleicht haben die ja schon jemand gefunden in der zwischenzeit die meinten zwar sie sagen bescheid aber das kann ja sein dass dann irgendwie dass ich das erledigt hat oder so du hast ein asus store für hw angefangen weil es jetzt nach dem video da hast du gedacht die sind bestimmt spendabel was das angeht der asus store ich wüsste gar nicht was ich damit machen soll also ich meine ja klar sachen drauf speichern aber ich will nicht noch eine weitere kiste bei mir stehen dann braucht ja alles strom nee da muss ich nicht absagen da arbeite ich ja gerade also was haben wir als nächstes was kann kommen wir lassen uns die runde level cap gb oder feier schipp ein feier schipp geht bloß zwei minuten 46 wir gucken uns feier schipp an wir gucken uns feier schipp an danach gucken wir uns den level cap gb dann das ist zu cool um irgendwie was traditionelles zu sein deswegen ist es new sql ich bin ich finde es übrigens gut ich finde es übrigens gut dass sql sagt das finde ich gut ich mag sequel nicht die aussprache deswegen finde ich sql oder sql immer noch sympathisch wenn das einer sagt sql ist mir zu sus wenn das das mag ich nicht database that delivers every feature you ever dreamed of acid scalable full text search real-time graph relational multitenant temporal schema list serverless embedded are all words that can describe surreal db a multimodell blazing fast written in rust binds elements of relational graph and document paradigms into a simple package that can be queried with an sql like language development was started by jamie and toby morgan hitchcock in 2015 and it was open-sourced in july 2022 the engine is written in rust multiple persistence layers like tyke av to scale horizontally in the cloud wie sagst du jason web talk ich habe das erstaunlich selten ausgesprochen bisher ich würde es wahrscheinlich jwt sagen jott jott jwt jwt habe ich mir noch keine geraken zugemacht offiziell ist es jott was was wie moment jott wie kommt man von jwt auf jott dann hätten sie es doch jott guck mal wenn sie wollen dass es jott ausspricht dann hätte man es einfach jott nennen sollen why is it pronounced jott genau jwt das ist ja halbe weltgeschichte warum es jott heißt judd jott meine güte also ich würde spontan eigentlich jbt sagen auf deutsch oder ich würde es wahrscheinlich gar nicht abkürzen sondern wahrscheinlich einfach sagen jason web talken oder oder einfach nur web talken oder sowas jason talken oder oder jwt meinetwegen w is e der dümmste buchstabe den sie sich ausgedacht also nicht w an sich sondern dass es w ausgesprochen wird richtig true 0w chat hat es erkannt warum sollte man das überhaupt abkürzen einfach javascript object notation web talken sagen da bin ich auch dafür das sollten wir immer so wir sollten prinzipiell eigentlich keine anglizismen mehr verwenden und alles korrekt aussprechen ohne abkürzung leute ich glaube wie viele sätze könnte ich sagen wenn ich keine anglizismen mehr verwende einen zwei viele sind es auf jeden fall nicht eine halbe wahrscheinlich ja viel ist es nicht data oder data data sprich mal hsts ist das diese http streaming ne das ist hls aber was ist hsts nochmal http strick transport security also was ist das so wir gucken dass das video mal fertig den nur zwei minuten ich hab es nach 30 sekunden geschafft wieder fünf minuten zu labern in the cloud or as a single node both in memory or on disk most importantly though it can handle complex relationships like traditional relational databases but does so without joins instead it uses techniques like record links and graph connections that not only handle complex data models but also result in concise developer friendly code and by default its schema list which means you can implicitly create unstructured data in any table however you can opt in to skew as you can see there is no colour Also gibt es dafür schon irgendwelche net driver is needed gibt es dafür schon irgendwas weil dann probieren wir das einfach mal aus. Now net driver is needed ach gibt es gibt es schon oh ok es gibt im Prinzip für aktuell kaum was es gibt für Go, für Node und Rust und Go ok also allein schon so kann es keine Mainstream wirklich richtige Business Enterprise Mainstream Verbreitung kriegen. Du brauchst zumindest mal Java noch du brauchst zumindest mal Java noch also ich mein das ist also Node und Golang ist schon mal ein guter Start Node ist ziemlich verbreitet und Go ist auch nicht unbedeutend für Business Enterprise Backend Anwendungen eher weniger aber gerade wenn man sich mal die ganzen Cloud Tools und Sachen drumherum anguckt da auf jeden Fall. So also Node und Go ist auf jeden Fall schon mal ein ordentlicher Anteil Rust eher halt da weil es selbst in Rust programmiert ist aber zumindest Java, Python und.NET das muss noch sein dass das wirklich große Verbreitung kriegen kann PHP wäre auch auf jeden Fall äußerst sinnvoll viele Web Anwendungen und gerade Sachen bei Billig Hostern sind immer noch gerne in PHP und Low Level Sachen selbstverständlich auch es sollte also ganz ehrlich ein C Interface anzubieten wenn es ein Rust Interface schon gibt muss er irgendwie rappen Erlang juckt mich jetzt nicht Ruby ganz ehrlich leider ein bisschen an Bedeutung verloren wäre natürlich cool ja also es muss also.NET ja eine REST API alleine ist ja schön und gut aber du willst ja dann auch später mal Entity, EF Core Integration und sowas vielleicht haben da ist dann die machen das nicht in Reihenfolge ne die machen das wahrscheinlich aber wenn Server-Site, Ach so ja Abfrage machen kann.NET hat eigentlich ein Logo mittlerweile.NET hat diesen komischen Roboter oder ist das das die Sharp Logo ne die haben doch die haben noch diesen Roboter als Logo hier ich finde kein schönes Logo aber die haben eins mal gucken mal gucken wie sich das wie gesagt ich bin eh gespannt wie sich das die nächsten paar Jahre entwickelt ob das auch irgendwie von dem Hype was was retten kann ob das dann wirklich jemand verwendet auch .NET All of which can be locked down with permissions out of the box. To get started, install it on your machine, then run it locally with the CLI, then execute code using its REST API or a cli- Okay, ja, aber... ist halt, ist halt ein bisschen... Ja, da musste, musste deine Datenbankqueries über, über HTTP machen. Ich mein, okay, vielleicht ist es gar nicht so schlecht. Da kannst du nämlich das Datenbank Standalone laufen lassen und vom Client direkt drauf zugreifen, und deine Backend-Logik greift quasi dann auch da drüber drauf zu, wenn du es mal brauchst. Vielleicht ist das gar nicht so verkehrt. Ja, von CraftQL hab ich da noch nix, noch nix gehört bis jetzt. Ähm, mit Craft, in den letzten paar Sätzen meint er eher was anderes, da meint er, wie die Daten in der Datenbank intern miteinander zusammenhängen. Ob das den CraftQL unterstützt, weiß ich nicht. Weiß ich, wo weiß ich nicht. Guck mal mal. Coming soon, CraftQL. Die wollen, die wollen's aber wissen, die wollen wirklich alles machen. Die haben auch wirklich da viel eingebaut. Was bedeutet serverless, dass der Server nicht bei dir steht? Ist so. Server gibt's trotzdem. Oh, Five-Hat-Time, was das als fertig ist. Oh, C++-Vibes, Leute, mit dem Pfeil. Oh, C++-Vibes, Leute, mit dem Pfeil. Oh, C++-Vibes, Leute, mit dem Pfeil. Oh, C++-Vibes, Leute, mit dem Pfeil. Oh, C++-Vibes, Leute, mit dem Pfeil. Oh, C++-Vibes, Leute, mit dem Pfeil. oh, C++-Vibes, Leute, mit dem Pfeil, oh, C++-Vibes, Leute, mit dem Pfeil, oh, C++-Vibes, Leute, oh, C++-Vibes, Leute, mit dem Pfeil, oh, C++-Vibes, Leute, mit dem Pfeil. Ja gut gute ich brauche immer mehr nintendo musik playlists Ja das ist der low budget nascar Ne habe ich nicht ich habe ach so wirst du ja sobald sie auf dem pc gibt werde ich mir das an werde ich mir das geben korrekt und Wahrscheinlich ausrasten ab dem zwei ab der zweiten runde wegen skill-based matchmaking Ich mache stark von aus So ok sieben areas wir über wir skippen das video jetzt einfach pass mal auf wir machen jetzt den absolut high IQ six head move Wir gucken uns an was was hier steht also sponsor das video geht erstmal da los software management ok da geht da geht da Erzähl wahrscheinlich was von den standard repos der verschiedenen distributionen ok ja monetary cost ja gut es ist zum größten teile umsonst open source und free software ok performance Na da kann man sich jetzt drüber streiten performance in welchem sektor Da kann man sich drüber streiten ok wir müssen doch mal kurz reingucken also Ok wir müssen doch mal kurz reingucken also Also die probleme die ich mit win get hatte waren wir haben das ja ausprobiert das letzte mal erstens viel zu wenig parkete drinne Zweitens irgendwie installer die nicht richtig laufen aninstaller die nicht richtig laufen Suche die komplett verkacktes ganz also es war irgendwie fail ist doch gar nicht so lang her das heißt Das ist doch erst ein paar monate her wo wir uns das angeguckt haben Aber All your apps and packages are available in one single software store You can install anything in one click and update the system and the ok überspringen Second area is monetary cost linux in 99 percent of cases is free of charge You don't have to spend a dime to install a linux distro das stimmt aber ich finde das wird oftmals ein bisschen zu sehr hervorgehoben Weil mal ganz im ernst ich gehe jetzt mal von mir aus und ich übertrage das jetzt mal auf die meisten anderen Leute Ich glaube viele Leute haben prinzipiell gar kein problem damit dass Sachen die gut funktionieren und gut gemacht sind auch was kosten dürfen Also ich glaube für viele ist der reine kosten faktor nicht wirklich der entscheidende punkt linux zu verwenden Außerdem muss man sagen wenn aus lizenzen jetzt so teuer auch nicht Also vielen leuten ist es bestimmt lieber sie bezahlen ein bisschen was also wenn du die leute fragen würdest okay Soll es muss es immer kostenlos sein oder darf es auch was kosten und dafür gibt es support und updates garantiert und insgesamt bessere qualität Da würden wahrscheinlich 99 prozent der leute sagen ja es darf auch ein bisschen was kosten wenn es dann im prinzip einfach mehr weniger weniger probleme macht Also ja es ist ein vorteil aber ich glaube das ist nicht der ausschlaggebende punkt für viele linux verwender benutzer Linux verwender also ich habe ich habe andere gründe warum ich linux verwende nicht weil es kostenlos ist But you can always get these for free linux enjoy but I got windows for free I didn't have to pay it it was right there on my computer 2,50 euro bei amazon oder bei bei irgendeinem ex-liebigen anderen shop Das ist richtig aber ganz im er ja ja das ist mir doch egal ob die also ganz ehrlich das kann doch keiner von mir verlangen Dass ich das nachprüfe wie ist denn jetzt also wenn ich in den shop gehe gerade bei einem shop bei einem bei einem shop wie amazon Du siehst dort ein du siehst dort windows lizenz für 25 euro und kaufst die ganz im ernst es kann auch keiner von mir verlangen dass ich da irgendwie nachvollziehe welche lieferketten dieser key mal hatte Aber sie funktionieren immer noch und ja und eine piraten kopie von windows wird immer noch funktionieren das bedeutet noch nicht Okay, eine andere große gewinne für linux ist ihre open source und freie Software nature warum soll es dir egal sein Naja Naja da habe ich andere ansichten zu Wie lange hat es gedauert bis gpu die coding in browsers unter linux richtig funktioniert hat Wie lange hat es gedauert vier jahre fünf jahre also ich rede jetzt von dem zeitpunkt wo sowas unter linux und mac schon funktioniert hat Sagen wir mal unter linux schon funktioniert vier oder fünf jahre hat es gedauert unter linux bis das funktioniert hat also Und es funktioniert jetzt noch nicht richtig genau es funktioniert nur in der richtigen kombination von richtigen treibern richtig an mehreren stellen Richtige grafikkarte richtige grafikkarten treiber richtige mesa treiber richtige browser version richtige browser flex richtige video formate richtige browser plugins alles mögliche also so einfach ist es nicht Da kann man sich jetzt drüber stellen ja ja das ist du hast schon recht also die die frage woran das liegt ist tatsächlich in dem fall gar nicht mal so einfach zu beantworten Ja es mag wahrscheinlich wirklich daran liegen dass gpu hersteller irgendwie verkacken mit ihren drei mag alles sein aber man hat sich aber linux typisch in diesem fall wieder sehr lange den ball zugeschoben Ja die browser hersteller sagen das ist nicht mein ding soll sollen die desktop oder sollen irgendwie die windows system leute machen die windows system leute sagen ja das sind Irgendwelche treiber extensions sagen ja das ist dann der treiber vom geräte hersteller der hersteller sagt ja nee das muss man doch wieder die browser hersteller machen und alles sagen sie an mir liegt es ja nicht Bei mir ist ja nichts kaputt und das hat ewig ewig gedauert also ganz so einfach mit es ist open source deswegen geht dann da alles nach fünf minuten so ist es nicht Die meisten leute wissen mit ach und krach wie man auf github kommt als fixed ernsthaft irgendjemand was in kde plasma in den internals aus einer handvoll leute Das kann mir keiner erzählen es ist genauso wie die leute sagen ja linux ist open source ja ja ist schön und gut aber können kontributors gibt es nicht viele können auch nicht viele erstens da brauchst ja mehrere sachen Du musst da erst einmal durchblicken überhaupt dass du überhaupt was machen kannst dann musst du nicht nur durchblicken dann musst du auch noch soweit den gesamtüberblick haben dass du verstehst was das was du machst was das für auswirkungen hat Dazu kommt dass die sicherlich nicht irgendwelche random dudes dort ungesehen sachen kontributen lassen also die geht wahrscheinlich linux und die anderen leute bei einem bei einem first contributor ich habe keine ahnung Übrigens ob das wirklich so ist aber ich vermute es einfach mal bei jemanden der zuerst kontributen will so sehr auf den sack in dem sie deinen wahrscheinlich dein merch request erst mal so zerreißen dass du wahrscheinlich keinen bock mehr hast einen zweiten zu stellen aber auch zu recht muss man ja sagen also das muss ich das muss man linux wirklich lassen Die meisten sachen wo er flamet und die finden sind ja bekannt dafür dass die richtig richtig nice flamen können das hat oftmals zumindest einen grund und der ist nachvollziehbar wenn man ihn vielleicht auch nicht immer teilt aber da hat also der flamt meistens nicht komplett unsinnig Er hat es eine zeit lang wirklich übertrieben wie er da abgegangen ist aber er hatte zumindest immer einen gewissen hintergedanken der ich wie nachvollziehbar war ja aber die meisten leute sind gar nicht in der lage dazu open source ist eine super super geschichte gerade zum lernen ist open source ganz besonders toll also wenn du beispielsweise wissen willst ey wie macht man denn so was oder wie haben die das denn da gebaut dass es funktioniert dann ist es super wenn du abgucken kannst ganz ganz im ernst guck mal ich hab doch hier letztens auf github eine home assistant add-on veröffentlicht wo man seine wo man aus seinem guck mal ich hab schon zehn sterne pock wo man sein sein fiat beziehungsweise die die fiat uconnect services wo man die sachen importieren kann in home assistant wie reifendruck und batterieladung und sowas dass man so was machen kann ich hätte das nicht hinbekommen es kann nicht hinbekommen es gab ein issue ja es gab ein issue das habe ich auch schon geschlossen was wollte ich jetzt sagen außer monka steer sollte man vielleicht jetzt nochmal achja genau das hätte ich überhaupt nicht so schnell hinbekommen hätte ich nicht ein anderes projekt gefunden hätte ich nicht ein anderes projekt gefunden wo ich das hätte abgucken können wie die das gemacht haben sonst hätte ich das nie so schnell hinbekommen ich konnte ich konnte hier abgucken und ich konnte hier abgucken wie die requests an die fiat api aussehen müssen dass es funktioniert also insofern dass dafür ist das ist das super ja ich habe es auch unter die gleiche lizenz gestellt wie der andere du das heißt es kann jeder im endeffekt damit machen was lustig ist findet ihr nicht auch dass ich mir viel mühe bei der rhythm gegeben habe sogar mit screenshots und allem ja aber ich mag projekte nicht wo keine screenshots drin sind gerade wenn sie eben ja irgendwas mit web zu tun haben bilder beste genau weiter mehr doko als auf der arbeit das ist wohl bei uns auch so ja ja gut der daubi ist ja da auch so ein ganz ganz spezieller fall ja das ist natürlich cool das ist natürlich wieder ein paradebeispiel für wo es gut funktioniert richtig giga chat move hier echt so viel mittlerweile k schreckliche grafische User-Interface mit super alten Computern, ohne sie unnötig zu machen. Also, ja, ja, ist schon was dran. Wobei die Mainstream-Distros auf alten Laptops jetzt auch nicht besser laufen als das entsprechende Windows. Also, vielleicht würde sie wirklich so altes, altes, altes Zeug, wo du dann mit so super Lightweight-Sachen anfängst. Die Sache ist nur die. Wenn du damit dann was machen willst, zum Beispiel einen Browser öffnen, dann ist es genauso langsam. Weil es braucht halt einfach gewisse Leistung. Leute, ich hab den Move schlechthin, ist mir gerade eingefallen, wisst ihr was Microsoft machen müsste, damit Windows wieder hip und angesagt ist? Microsoft müsste Windows in Rust neu programmieren. Windows RS. Blazingly fast written in Rust. Was meint ihr, was da los wäre? Leute, Windows in Rust, Alter. Surrealdb hat Surrealdb an Schatzer-Registry, genau. Ja, wenn du, wenn du, naja, das funktioniert schon mal nicht. Wenn du Gento auf einer schwachbrüstigen Hardware verwenden möchtest, mag das am Ende vielleicht 0,5% schneller sein, wenn du es mit passenden Flex kompilierst. Aber das Kompilieren dauert halt eine Woche. Das stimmt, das kann ich komplett unterschreiben. Also customizable und customization gibt es nichts besseres als Linux. Also ich rede jetzt nicht von hier Gnome Desktop oder so. Da bin ich jetzt ehrlich gesagt gar nicht so schafft drauf. Aber sowas wie ich meinen i3-WM eingerichtet habe und customise, das ist unter Windows undenkbar. Du endest mit etwas, das irgendwie für alle funktioniert, aber es ist perfekt für niemanden. Bei Linux kannst du von einem enormen... Dachtest du mal den Mac-Usern? Da gibt es einen Style für alle und die werden abgefeiert. ... Distributions- und Desktop-Embodigungen und Tools, um sicher zu sein, dass deine Erfahrung das beste für dich funktioniert. Und klar, das kreiert auch Probleme, besonders für Beginner, die nicht wissen, welche Linux-Distribution zu bekommen. Aber das ist nur, weil sie nicht verwendet sind für Linux. Es beeinflusst die Optionen, die du hast, die du customisieren kannst. Linux ist auch ein privater System. Wenn du Windows installierst, musst du über... Ja, da muss ich auch immer kecken, wenn ich das unter Windows sehe. ... 10 Schrauben der Konfiguration. Die meisten fragen dich, ob du deine Daten haben möchtest. Und die meisten sind Schauspieler. Und bevor du sagst, sind das Schauspieler. Und das ist, weshalb du auf deinem System lebst. Die letzte Stelle, wo Linux einfach besser ist, ist der Terminal. Ach, aber meilenweit, umlängen. Ich meine, WSL, was im Endeffekt ja quasi Linux auf Windows bringt, und das neue Windows-Terminal, das ist zum ersten Mal in Kombination nutzbar. Das davor unter Windows war ja der absolute Witz. Das ist nicht etwas, das du benutzen musst, um einen... Warum ich ein iPhone habe statt dem Android? Ich habe beides. Ich habe iPhones, iPads und Android-Tablets. Aber ich bekomme das iPhone von dort, wo ich arbeite, kriege ich alle eins bis zwei Jahre ein iPhone gestellt. Und seitdem habe ich kein eigenes Smartphone mehr. Und einen Surface. Ja, ich habe einen Surface-Hub. Äh, kein Surface-Hub, null. Einen Surface-Book, das muss ich jetzt auch noch einrichten da nächste Woche. Welche Linux-Distribution für Anfänger? Ähm, Linux Mint? Kann ich dir empfehlen? Für Anfänger Ubuntu nicht zwangsläufig? Nimm Linux Mint. Da hast du einen Debian-Ubuntu-Unterbau. Hör nicht auf den Chat. Hör nicht auf den Chat. Nimm Linux Mint. Das ist für Einsteiger zum Kennenlernen ganz gut. appear Shitdown. Ah nee, Shutdown. Ja. Ja gut, das ist so. Das, äh, das, äh, das ist so. Das war auch früher absolut ätzend unter Windows, dass du keine ordentliche Shell hattest und keine ordentliches CLI-Environment. Das war richtig abartig. Also, WSL ist tatsächlich, was das angeht, zum ersten, also WSL in Kombination mit dem neuen Windows-Terminal ist tatsächlich zum ersten Mal was, wo ich sage, hey, das kann man benutzen. PowerShell ist auch gut, allerdings PowerShell ist für mich keine interaktive Shell, die ich jeden Tag verwenden will, sondern PowerShell ist für mich was, wo man Windows-Sachen automatisiert. Für Automatisierung ist PowerShell richtig gut, aber als interaktive Shell, ich weiß nicht. Nee, eher nicht. Hier ist er ganz toll. Sag mal, hat er doppelt Sponsor? Sponsor? Sponsor? Boah, der wills aber wissen, ey. Kek. Das ist ja ein Drittel von dem, was ich jetzt verstanden habe, das ist ja ein Drittel von dem, was ich jetzt verstanden habe. Ich will jetzt mal sehen, was das ist. Und ich will jetzt mal sehen, was das ist. Und jetzt bin ich schon wieder da. Und jetzt bin ich schon wieder da. Und jetzt bin ich schon wieder da. Keck! Das ja ein Drittel von dem Video ist ja Sponsor und Intro und Outro! Wahnsinn! Stonks! Ja so muss es sein! Was ist das eigentlich? Alright Sony! Nintendo Direct vs. Sony Direct 5 Minuten! Hat eine gute Bewertung! Also ich wurde vorher empfohlen. Schauen wir mal. Monkeys? What the hell? What the hell? What the fuck? Hey! Nintendo, Nintendo, you better have something good. Ja gut, hey, das ist schon ziemlich starker Kontrast, aber du kannst doch auch nicht diesen Gramm vergleichen. Okay. Oh my god, oh my god. Nintendo, hey, Nintendo, you better have something big to go against that. Okay, das im Vergleich wirkt natürlich schon ein bisschen affisch. Noch mal, noch mal Farben! Alter, was bei Nintendo los? Lass mich raten! Farbing Simulation? Okay, das ist echt gut gemacht! Farbing Simulation! Please take a look at this lawn mowing game. You need a Mario Odyssey 2 moment now to redeem this. Come on now. Mario Odyssey 2, let's see this. Hey, das erste war gar nicht so schlecht! I'm gonna say this. Didn't look like there was any farming in it. Farbing Simulation! War Bayonetta nicht mal Switch Nintendo exklusiv oder so der zweite Teil? Okay, okay Nintendo, that's an actual fucking video game. Let's keep the ball rolling. Come on. Farbing Simulation! War Bayonetta nicht mal Switch Nintendo exklusiv oder so der zweite Teil? Mario's Daylife! Farbing Simulation! Ich muss ehrlich sagen, ich konnte persönlich die Faszination an Pikmin noch nicht so ganz nachvollziehen, also mein Game war es noch nie. Ernsthaft! Ernsthaft! Oh, please! Okay, okay, okay, okay. Alright, they're still making games, okay. I was worried for a bit there, they're still doing games. We won't be showing any gameplay today. Natürlich, was sonst, was sonst? I also made a new t-shirt. Can you survive the season of death? Farbing Simulation! My question is can my channel survive the death of the video game industry? Nein, please! Die Farbing Simulation wieder! After this presentation, a demo containing the opening days of your farm's first season will be available on Nintendo eShop. Das ist aber mega gut geschnitten von dem Typ auch noch. Farbing Simulation! Kill! Aber da freue ich mich tatsächlich schon drauf. Das Problem ist, wahrscheinlich muss ich eine PS5 kaufen, nur für God of War. Oh, verdammt! Oh verdammt! Die Kugeln! Wir werden unser eigenes Destinieren machen. Verdammt! Nintendo, du musst einen großen Farbing-Game zeigen. Ja, okay. Hey, den Trailer habe ich tatsächlich gesehen, da war nichts zu sehen. Ja, es war nichts zu sehen. Du hast gesehen, wie du auf irgendeinem Ding runterfliegst und das war's. Du hast nichts gesehen. Das war weniger Gameplay als Pikmin. Immerhin Ende 2023. Mal gucken, ob das dann auch so ist. Das Video war wirklich gut geschnitten. Ich habe weder die Nintendo Direct noch die Sony-Geschichte gesehen, aber das hat wirklich gut zusammengeschnitten. Und wahrscheinlich hat Nintendo zum größten Teil Farbing-Live-Simulation gezeigt. Das ist Mai? Moment, Moment. War das Kokona-Datum oder EU-Datum? Moment. Moment. Das war weniger Gameplay als Pikmin. Ah, Moment, Moment, Moment. Freedom Units. Es ist Kokona-Datum. Es ist der 12.5., nicht der 5.12. Ach so. Ja, seht ihr mal, wie bescheuert das ist, dass es Leute gibt, die Datumsangaben so unterschiedlich schreiben. Jetzt verstehe ich das. Es ist aber auch wirklich schwer zu erkennen. Ich meine, wenn du dir den Trailer auf Deutsch anguckst, steht dann da 12.5. da. Pains-Champ. Ja, Monatag. Hey, das ist insofern zumindest ganz gut. Das kann man am besten sortieren. Ja, also für Sachen, die sortierbar sind, ist es am besten. Und ganz ehrlich, das beste ist einfach EU-Unix-Timestamp. Scheiß drauf. Und von da alles ausrechnen. Einfach Zeit seit 1970. Was haben wir denn heute? Aha. Also das ist doch wirklich sehr griffig hier, oder? Findet ihr nicht auch? 1, 6, 6, 3, 4, 9, 2, 1, 6, 8. Sekunden seit 1.1.1970. Es ist so die Frage, ob Sekunden oder Millisekunden. Ja, das ist mittlerweile so lang, dass es auf den ersten Blick drei Stellen mehr oder weniger nicht direkt ersichtlich ist. Warum eigentlich 1970? Ich glaube, das wurde relativ willkürlich festgelegt. Man musste sich halt auf irgendwas einigen. Ja, gut. Ich meine, die Menschheit ist ja, wenn du nach Kreationisten bei den Amis gehst, ist die Menschheit ja glaube ich nur irgendwie 2000 Jahre alt oder 5000 Jahre oder so. Oder, ne, ne, ne, die Welt. Die Welt ist 5000 Jahre und die Menschheit ist 2000 Jahre. Irgendwie so ganz, ganz weird champste Theorien, die es da gibt. Vor 1970 gab es keine Zeit, richtig? Oder 12.000 Jahre, ja. Die haben, ich weiß nicht, wen sie den zehn geschissen haben. Hast du schon mal das Video gesehen von der Aua? Ne, wir haben lange vom Bauer nichts mehr geguckt, fällt mir da ein. Wo zerschneiden sie irgendwelche CPUs? Dicker Heatspreader. Mitte zweite Reihe. Das da? Okay, wir spulen jetzt mal kurz vor, wo sie es zerschneiden. Wo wird zerschnitten? Ich will sehen, wo zerschnitten wird. Was wir hier aber auch sehr schön wieder sehen können, sind die Pads am Rand, die wir gerade unter dem USB Mikroskop schon gesehen haben, für die Kontaktierung nach außen. Zwei Ebenen von Leiterbahnen. Haben die jetzt schon zerschnitten? Oder nicht? Wo wird zerschnitten? War drauf hier. Ich glaube, man sieht da gar nicht, wo großartig was zerschnitten wird, oder? Man guckt sich einfach vorher und nachher an. Was sieht man da? Das ist das, was mich interessiert hätte. Abgeschaltet. Der größte Skandal der COD-Geschichte. Das ist vielleicht etwas zu übertrieben, aber warum man bei so einem neuen Game die Server abschaltet, verstehe ich auch nicht. Das sieht aus, das sieht aus wie MW1, oder? Das sieht aus wie ein Map Pack zu MW1. Kein Unterschied. Ernsthaft. Kein Unterschied. Sieht das irgendwie nennenswert an? Nee, oder? Das sieht exakt genauso aus. Haben die wieder dieses komische Geslide drin? Also klar, das Overlay ist exakt das gleiche. Also das ist wirklich... Okay, es ist wieder der gleiche Shit. Du siehst die Gegner nicht. Du siehst wieder die Gegner nicht. Woher weiß der, dass da was ist? Okay, immerhin. Immerhin, sowas funktioniert. Ah, Sliding gibt es nicht mehr, okay. Aber die Maps sind auch wieder so, dass jeder in irgendeiner Ecke campt und um die... und ein Head klitscht um die Ecke. Das hat mir persönlich im MW2-Multiplayer nicht so wirklich gefallen. Der Head klitscht sich einen ab. Oh, naja gut. Es sieht aus wie MW1. Also das, 2019 MW1. Time to kill ist sehr kurz, das habe ich auch schon gesehen. In einem anderen Video, da wird's quasi... da streckt dein Kopf um die Ecke, Insta... Insta... Deine Hand um die Ecke, Insta-dead. Leute, ich muss aufs Klo. Ich glaub, wir hören jetzt schon auf zu streamen. Ich muss aufs Klo. Und danach muss ich Mittagessen machen. Ich hab Hunger. Das ist die wichtigste Kombination. Erst aufs Klo und danach gleich noch wieder was rein. Ja, wir haben ein bisschen früher angefangen. Wisst ihr, was mir einfällt? Eigentlich müssten wir wirklich mal Battlefield 2042 Season 2 ausprobieren, aber ich hab keinen Bock. Ich hab keinen Bock. Lieber nicht. Ja, hast recht. Ja, ich hab einen Surface Book jetzt bekommen. Da will ich mir Linux draufhauen. Mal gucken, wie gut das funktioniert. Okay Leute, wisst ihr was? Ich geh jetzt aufs Klo. Wir sehen uns vielleicht später. Oder eher nicht, weil ich hab schon ein paar Mal jetzt sonntags gesagt, wir sehen uns später und ich glaub, wir haben uns die letzten drei Male später nicht gesehen. Das muss ich ausprobieren. Das muss ich ausprobieren. Ich werde sehen, wahrscheinlich geht das. Vielleicht gehen manche Geräte nicht, aber gut. SurfaceDB Ja Leute, wir sehen uns bis dann. See you.", "segments": [{"id": 1, "start": 30.0, "end": 42.2, "text": "Oi Leute es ganz schön kalt"}, {"id": 2, "start": 42.2, "end": 49.04, "text": "Kurz aufs Thermometer Vision"}, {"id": 3, "start": 49.04, "end": 59.62, "text": "Ich würd mal sagen wir haben vielleicht sogar schon unter 10 Grad"}, {"id": 4, "start": 59.62, "end": 60.62, "text": "Warte mal kurz gucken."}, {"id": 5, "start": 60.62, "end": 71.1, "text": "Irgendwelchen Gründen geht mein Homo System nicht auf."}, {"id": 6, "start": 71.1, "end": 74.38, "text": "Oh jetzt geht er."}, {"id": 7, "start": 74.38, "end": 85.94, "text": "Wir haben, okay 10,89 Grad Außentemperatur und innen drinnen ist es 19 Grad und bei"}, {"id": 8, "start": 85.94, "end": 87.78, "text": "mir ist es, wie viel ist hier?"}, {"id": 9, "start": 87.78, "end": 88.78, "text": "Zeig mal her."}, {"id": 10, "start": 88.78, "end": 89.78, "text": "Mal kurz gucken."}, {"id": 11, "start": 89.78, "end": 90.78, "text": "19."}, {"id": 12, "start": 90.78, "end": 96.98, "text": "Es ist ganz schön kalt, irgendwie mein 19 Grad ist normalerweise jetzt nichts, was dich"}, {"id": 13, "start": 96.98, "end": 104.94, "text": "irgendwie großartig schockt, aber nachdem man irgendwie 35 geworden ist noch, ging jetzt"}, {"id": 14, "start": 104.94, "end": 105.94, "text": "ganz schön schnell."}, {"id": 15, "start": 105.94, "end": 106.94, "text": "Ich glaube ich mache die Heizung an."}, {"id": 16, "start": 106.94, "end": 109.34, "text": "Wo habe ich denn meine Fertbedienung?"}, {"id": 17, "start": 109.34, "end": 110.34, "text": "Da."}, {"id": 18, "start": 110.34, "end": 111.98, "text": "Warte mal kurz ein bisschen."}, {"id": 19, "start": 111.98, "end": 115.54, "text": "Wobei, oder ich mache nicht warm, ich meine ich habe die Tür zu und ich habe zwei Rechner"}, {"id": 20, "start": 115.54, "end": 116.54, "text": "an."}, {"id": 21, "start": 116.54, "end": 119.94, "text": "Das wird wahrscheinlich auch automatisch warm werden gleich, aber es ist ganz schön"}, {"id": 22, "start": 119.94, "end": 120.94, "text": "kühl."}, {"id": 23, "start": 120.94, "end": 126.9, "text": "Zumal wenn ich die Heizung anmache, dann kostet es, weil ich habe eine Gasheizung."}, {"id": 24, "start": 126.9, "end": 132.9, "text": "Hätte ich das mal gewusst vor ein paar Jahren, dass Gasheizung nicht so sinnvoll ist, aber"}, {"id": 25, "start": 132.9, "end": 136.66, "text": "das war zum damaligen Zeitpunkt das beste was man sich einbauen konnte, aber das wusstest"}, {"id": 26, "start": 136.66, "end": 137.66, "text": "du halt nicht."}, {"id": 27, "start": 137.66, "end": 138.66, "text": "Kannst du das schlecht."}, {"id": 28, "start": 138.66, "end": 140.94, "text": "Danach bist du immer schlauer."}, {"id": 29, "start": 140.94, "end": 145.42, "text": "Hätte ich 1995 Apple Aktien gekauft, kannst du ja so nicht sehen."}, {"id": 30, "start": 145.42, "end": 151.22, "text": "Du musst ja immer mit dem aktuellen Wissenstand davon ausgehen, dann kannst du nicht, fünf"}, {"id": 31, "start": 151.22, "end": 155.66, "text": "Jahre im Voraus sieht es dann alles immer rückwirkend total easy aus, hättest du es"}, {"id": 32, "start": 155.66, "end": 156.66, "text": "mal gewusst."}, {"id": 33, "start": 156.66, "end": 158.3, "text": "Konntest du ja denn wissen."}, {"id": 34, "start": 158.3, "end": 171.18, "text": "Ne, also das wird bestimmt teuer dieses Jahr mit Heizen und allem."}, {"id": 35, "start": 171.18, "end": 177.62, "text": "Auf der anderen Seite, ich kann immer noch, also sollte es wirklich Probleme geben, so"}, {"id": 36, "start": 177.62, "end": 182.06, "text": "mit Gasversorgung und sonst was, ich kann ja immer noch mit meiner Klimaanlage heizen,"}, {"id": 37, "start": 182.06, "end": 184.06, "text": "ich glaube das mache ich jetzt auch."}, {"id": 38, "start": 184.06, "end": 189.1, "text": "Aber ich mach die jetzt mal kurz an, passt mal auf, ich mach die jetzt mal an."}, {"id": 39, "start": 189.1, "end": 192.86, "text": "Ich habe die glaube ich noch nie zum Heizen verwendet, wie geht das überhaupt."}, {"id": 40, "start": 192.86, "end": 196.86, "text": "Das ist Kühlen, das ist Heizen glaube ich."}, {"id": 41, "start": 196.86, "end": 202.38, "text": "Ok, Heizen auf 25, na 25 ist ein bisschen viel, das ist gut, aber hier machen wir mal"}, {"id": 42, "start": 202.38, "end": 207.02, "text": "Heizen auf 22 Grad mit der Klimaanlage, gucken wir mal ob das funktioniert, ich habe legit"}, {"id": 43, "start": 207.02, "end": 211.7, "text": "noch nie geheizt mit dem Ding, also wenn da gleich Rauch rauskommt oder so, dann mache"}, {"id": 44, "start": 211.7, "end": 212.7, "text": "ich es wieder aus."}, {"id": 45, "start": 212.7, "end": 214.94, "text": "Ist das jetzt wieder ausgegangen oder?"}, {"id": 46, "start": 214.94, "end": 221.78, "text": "Ach ne, das ist total bescheuert eingestellt."}, {"id": 47, "start": 221.78, "end": 239.46, "text": "Mal Up-Down, das macht gerade gar nichts meine Klimaanlage, ah ich glaube die muss kurz"}, {"id": 48, "start": 239.46, "end": 244.94, "text": "anlaufen, bis die anfängt zu heizen, ich glaube so lang sieht das so aus, als wäre"}, {"id": 49, "start": 244.94, "end": 245.94, "text": "die aus."}, {"id": 50, "start": 245.94, "end": 252.1, "text": "Schauen wir mal, ich bin gespannt ob das Ding jetzt gleich anfängt zu heizen."}, {"id": 51, "start": 252.1, "end": 258.42, "text": "Also ich habe es zumindest auf Heizen eingestellt, es sollte jetzt 3 Grad Wärmer hier drinnen"}, {"id": 52, "start": 258.42, "end": 259.42, "text": "machen gleich."}, {"id": 53, "start": 259.42, "end": 263.18, "text": "Schauen wir mal, ich werde es sehen."}, {"id": 54, "start": 263.18, "end": 269.98, "text": "Ja moi Leute, alle am Start hier schon sehe ich, guck mal hier richtig voll, der Rackman"}, {"id": 55, "start": 269.98, "end": 279.86, "text": "ist am Start, Key Game HD, Silvacross, hat den passenden Kicks dazu, Dan2Dev, Xynex, Nütt,"}, {"id": 56, "start": 279.86, "end": 283.26, "text": "der ist öfters da, ich weiß nicht wie ich ihn ausspreche, Tribool und auch wieder am"}, {"id": 57, "start": 283.26, "end": 288.7, "text": "Start, Xetor, der Monkpusher, Gamble 0, Doc, der entfiehlt der Tribool, der war hier oben"}, {"id": 58, "start": 288.7, "end": 296.1, "text": "schon da, Major Pain, der Drachenflieger ist auch am Start, Zaitara, Möb, Battle Sheep,"}, {"id": 59, "start": 296.1, "end": 300.74, "text": "Trapped, Toxin und User32DLL, das ist ganz wichtig, sonst kackt unser Windows ab."}, {"id": 60, "start": 300.74, "end": 304.34, "text": "Ah jetzt geht die Klimaanlage los, Leute moin ich muss mal kurz drunter stellen, gucken"}, {"id": 61, "start": 304.34, "end": 333.86, "text": "ob es da jetzt warm rauskommt, da kommt es warm raus, primärisch, ich habe wirklich"}, {"id": 62, "start": 333.86, "end": 337.62, "text": "zum ersten Mal hier gerade gehalten, die knackst so komisch, warum knackst die Klimaanlage"}, {"id": 63, "start": 337.62, "end": 342.46, "text": "so komisch, ja das muss wahrscheinlich so sein, ich heiz gerade wirklich zum ersten"}, {"id": 64, "start": 342.46, "end": 348.1, "text": "Mal mit der Klimaanlage, mal gucken, aber es kommt warm raus, das ist schonmal ein gutes"}, {"id": 65, "start": 348.1, "end": 358.46, "text": "Zeichen für das es wohl funktioniert, tja, so und sonst Leute habt ihr euch ausgeruht,"}, {"id": 66, "start": 358.46, "end": 368.1, "text": "habt ihr ordentlich gepennt, also ich habe nicht sonderlich gut geschlafen, die Katze"}, {"id": 67, "start": 368.1, "end": 376.7, "text": "war dreimal an der Tür und die hat mich genervt, ich habe irgendein YouTube Video angemacht,"}, {"id": 68, "start": 376.7, "end": 382.18, "text": "als ich pennen gegangen bin, allerdings war ich so blöd, ja vielleicht kennt jemand was,"}, {"id": 69, "start": 382.18, "end": 386.54, "text": "was man dagegen machen kann, ich war so blöd und habe die YouTube, also ich habe in meiner"}, {"id": 70, "start": 386.54, "end": 391.82, "text": "YouTube Playlist was zum später anschauen, habe ich aufgemacht, habe das erste YouTube"}, {"id": 71, "start": 391.82, "end": 394.86, "text": "Video angemacht, bin dann mal eingepennt, das Problem ist, dass diese Playlist, egal"}, {"id": 72, "start": 394.86, "end": 400.14, "text": "ob du diese Playlist Funktion ein oder ausschaltest, immer weiterplayt und ich hatte dann irgendwelche"}, {"id": 73, "start": 400.14, "end": 405.94, "text": "ganz komischen Videos laufen, die man sich nicht angucken will, während man pennt und"}, {"id": 74, "start": 405.94, "end": 408.82, "text": "da konnte ich nicht richtig schlafen bei, weil es immer irgendwelche komischen Geräusche"}, {"id": 75, "start": 408.82, "end": 412.46, "text": "gemacht hat aus YouTube Videos, das habe ich aber nicht gecheckt, weil ich so halb gepennt"}, {"id": 76, "start": 412.46, "end": 419.54, "text": "habe, aber nicht richtig, genau, ne Autoplay aus bringt dir nichts, du kannst Autoplay nicht"}, {"id": 77, "start": 419.54, "end": 429.06, "text": "ausmachen in dieser, ja, ja das ist das einzige was hilft, Video in eine leere Playlist, genau,"}, {"id": 78, "start": 429.06, "end": 435.46, "text": "das ist das einzige was hilft, Autoplay kannst du nicht ausmachen für diese intern Playlist,"}, {"id": 79, "start": 435.46, "end": 445.06, "text": "weiß nicht, keine Ahnung, ich glaube du kannst es bestimmt irgendwie mit irgendeinem Timer"}, {"id": 80, "start": 445.06, "end": 450.18, "text": "auf deinem Handy machen, so nachdem du jetzt alles Audio aus oder so, irgendwelche Shortcuts"}, {"id": 81, "start": 450.18, "end": 454.42, "text": "oder so, das geht bestimmt, aber ich glaube das ist wirklich das einzige was man machen"}, {"id": 82, "start": 454.42, "end": 461.78, "text": "kann, das Video in eine leere Playlist packen, wahrscheinlich, ja, halt schon Usability pur,"}, {"id": 83, "start": 461.78, "end": 466.38, "text": "aber YouTube möchte halt einfach auch nicht, dass man aufhört zu gucken, YouTube will,"}, {"id": 84, "start": 466.38, "end": 475.58, "text": "dass man am besten den ganzen Tag durchgängig YouTube guckt, oder wie es mein Kumpel aus"}, {"id": 85, "start": 475.58, "end": 483.78, "text": "Dresden sagen würde, YouTube, der war ja früher der Meinung, das heißt YouTube, nicht YouTube,"}, {"id": 86, "start": 483.78, "end": 498.5, "text": "YouTube wie, ja bei vielen Sachen kannst du auch pennen, schlimm ist nur wenn du bei"}, {"id": 87, "start": 498.5, "end": 505.42, "text": "irgendwelchen hyperaktiven Let's Playern oder so funny Gameplay Leuten rauskommst,"}, {"id": 88, "start": 505.42, "end": 511.38, "text": "die schreien die ganze Zeit, weil wir wissen ja alles, wir wissen ja alle, es ist so, laut"}, {"id": 89, "start": 511.38, "end": 522.78, "text": "und schreien gleich funny, das hat man ja auf YouTube gelernt, wo ist das hier alles,"}, {"id": 90, "start": 522.78, "end": 526.94, "text": "ich habe nämlich wieder meinen Twitch Server umgestellt, ich benutze jetzt nicht mehr Amsterdam,"}, {"id": 91, "start": 526.94, "end": 536.02, "text": "ich benutze jetzt wieder Auto, also wahrscheinlich Frankfurt oder so, aber scheint zu funktionieren,"}, {"id": 92, "start": 536.02, "end": 542.3, "text": "keine Dropped Frames, über welches Betriebsleben guckt, wenn iOS ist, kannst du über die Uhr"}, {"id": 93, "start": 542.3, "end": 546.94, "text": "lernen, ja, wie gesagt, man kann es bestimmt nur über Shortcuts steuern, könnte ich mir"}, {"id": 94, "start": 546.94, "end": 557.1, "text": "vorstellen, also, zum, also es gibt ein paar Sachen, die gucke ich, die gucke ich gerne,"}, {"id": 95, "start": 557.1, "end": 564.3, "text": "die gucke ich gerne zum Pennen auf YouTube, und zwar eine der Sachen ist jetzt keine ASMR"}, {"id": 96, "start": 564.3, "end": 574.22, "text": "Videos oder so, aber so Restoration Videos, das ist total entspannend, wenn man sich sowas"}, {"id": 97, "start": 574.22, "end": 582.74, "text": "hier anguckt, so irgendwelche Leute, die altes Zeug wieder glänzen machen, wobei ich wette"}, {"id": 98, "start": 582.74, "end": 589.78, "text": "mit euch, dass vieles von diesen Restorations Videos auch fake ist, wisst ihr, ich hab letztens"}, {"id": 99, "start": 589.78, "end": 595.86, "text": "was gesehen, da ging es darum, wir haben ein Gameboy Color, nee nicht, nicht Gameboy Color,"}, {"id": 100, "start": 595.86, "end": 601.54, "text": "was für ein Ding ist gerade so wieder bisschen im Mini-Hype, Gameboy Advanced, ja, wir haben"}, {"id": 101, "start": 601.54, "end": 607.66, "text": "ein Gameboy Advanced zufälligerweise im Dreck gefunden, und machen den jetzt wieder fit,"}, {"id": 102, "start": 607.66, "end": 619.3, "text": "und das war halt auch so klar fake, haben wir das nicht sogar zusammen geguckt, Cleaning"}, {"id": 103, "start": 619.3, "end": 626.42, "text": "Videos, wird mir auch öfters empfohlen, in letzter Zeit so Teppich-Sauber-Mach-Videos,"}, {"id": 104, "start": 626.42, "end": 635.58, "text": "was es nicht alles gibt, das ist genauso, kennt ihr diese Low-Technology-Videos, also"}, {"id": 105, "start": 635.58, "end": 643.94, "text": "der Originaltyp ist ja eindeutig das hier, das ist auch der beste, er hier, das ist der"}, {"id": 106, "start": 643.94, "end": 651.34, "text": "originale, aber es gibt ganz viele Drittbrett-Fahrer-Channels, die sowas hier machen, und das ist halt komplett"}, {"id": 107, "start": 651.34, "end": 657.54, "text": "fake bei ganz vielen, da gibt es ja sogar Videos drüber, die zeigen dieses Gebiet,"}, {"id": 108, "start": 657.54, "end": 661.66, "text": "wo die irgendwelche komischen Unterwasser-Pools gebaut haben, und es sind dann drei Sachen"}, {"id": 109, "start": 661.66, "end": 668.26, "text": "direkt nebeneinander, und du siehst es in den Videos auch schon, dass es fake ist, manchmal"}, {"id": 110, "start": 668.26, "end": 675.02, "text": "steht ein Bagger im Hintergrund, manchmal steht ein Bagger im Hintergrund, oder ein Betonsack"}, {"id": 111, "start": 675.02, "end": 678.78, "text": "liegt irgendwo nebendran, und auf einmal ist eine Wanda, die vorher nicht da war, oder"}, {"id": 112, "start": 678.78, "end": 684.26, "text": "irgendein Arm ist im Bild, und es ist halt alles fake, ja, aber gut, ich mein, die haben"}, {"id": 113, "start": 684.26, "end": 688.02, "text": "halt rausgekriegt, dass man damit Geld machen kann, und wenn du irgendwo, was weiß ich,"}, {"id": 114, "start": 688.02, "end": 693.14, "text": "im armen Teil von Indonesien oder so wohnst und feststellst, du kannst tausende Euro"}, {"id": 115, "start": 693.14, "end": 699.82, "text": "verdienen mit YouTube-Fake-Primitive-Technology-Videos, dann machst du das."}, {"id": 116, "start": 699.82, "end": 704.7, "text": "Generell, YouTube hat so viele, so vielen Fake-Content, das ist eigentlich ziemlich"}, {"id": 117, "start": 704.7, "end": 705.7, "text": "heftig."}, {"id": 118, "start": 705.7, "end": 710.9, "text": "Oh ja, das ist, das ist, okay, das ist tatsächlich schon so, da ist die Grenze auch für mich"}, {"id": 119, "start": 710.9, "end": 717.06, "text": "überschritten, wo ich sag, hey, das sollte, also das sollte es nicht geben auf der Plattform,"}, {"id": 120, "start": 717.06, "end": 720.86, "text": "bei diesen anderen Fake-Videos denke ich mir halt, gut, letztendlich schadet es ja keinem,"}, {"id": 121, "start": 720.86, "end": 725.26, "text": "außer dass der Zuschauer verarscht wird, aber wenn du dann so Sachen hast, wie Leute, die"}, {"id": 122, "start": 725.26, "end": 731.7, "text": "irgendeine Katze nehmen, ins Rohr stecken, nur um sie danach zu retten oder sowas, ne,"}, {"id": 123, "start": 731.7, "end": 733.42, "text": "das sollte es auf der Plattform nicht geben."}, {"id": 124, "start": 733.42, "end": 737.02, "text": "Es ist natürlich für YouTube schwierig zu unterscheiden, was ist Fake, was ist nicht"}, {"id": 125, "start": 737.02, "end": 741.3, "text": "Fake, und YouTube hat, wenn die Videos, das muss man ja auch immer klar sagen, YouTube"}, {"id": 126, "start": 741.3, "end": 747.26, "text": "hat ja, wenn die Videos gut ankommen und gut geguckt werden, nicht wirklich eigenes Interesse"}, {"id": 127, "start": 747.26, "end": 765.66, "text": "daran, dass es die Videos rausfiltert, die gut laufen."}, {"id": 128, "start": 765.66, "end": 790.7, "text": "Die Reverse, da spielen sie die Videos rückwärts ab, wo die da nicht gerettet werden, was wahrscheinlich"}, {"id": 129, "start": 790.7, "end": 793.3, "text": "eher der Realität entspricht bei vielen dieser Videos."}, {"id": 130, "start": 793.3, "end": 799.62, "text": "Also was ich tatsächlich manchmal ganz gerne gucke, das ist, ich weiß nicht mal wie der"}, {"id": 131, "start": 799.62, "end": 803.94, "text": "Channel heißt, das wird mir immer nur empfohlen, das ist so ein japanischer Channel, wo die"}, {"id": 132, "start": 803.94, "end": 813.74, "text": "auch dann zeigen, irgendeine Katze, die ausgesetzt wurde, oder irgendwie was beim Tierarzt und"}, {"id": 133, "start": 813.74, "end": 821.66, "text": "so, aber nachdem das was Japanisches ist, und das alles nicht so Fake wird, traue ich"}, {"id": 134, "start": 821.66, "end": 827.38, "text": "der Sache eher, zumal sie auch danach zeigen, wie sie die zum Tierarzt bringen, und dann"}, {"id": 135, "start": 827.38, "end": 831.5, "text": "irgendwie später, vielleicht sogar noch zwei, zweieinhalb Jahre später oder so, was dann"}, {"id": 136, "start": 831.5, "end": 836.02, "text": "ist, diese Aufwand macht halt kein Fake Channel."}, {"id": 137, "start": 836.02, "end": 845.54, "text": "Scambaiter, ja Kid Boga ist eh das beste auf Twitch, ohne Scheiß, ich kann das nicht"}, {"id": 138, "start": 845.54, "end": 850.22, "text": "jeden Tag gucken, weil es ist schon, sag mal so die ganzen Scams, der Inder ist jetzt"}, {"id": 139, "start": 850.22, "end": 853.94, "text": "ja auch nichts irgendwie super Neues, aber ab und zu kann ich durchaus mal so zwei, drei"}, {"id": 140, "start": 853.94, "end": 858.38, "text": "Stunden am Stück Kid Boga gucken, also ohne Scheiß, das ist einer der wenigen Channels,"}, {"id": 141, "start": 858.38, "end": 866.1, "text": "wo ich es komplett nachvollziehen kann, dass der so viele Views hat und das dem auch komplett,"}, {"id": 142, "start": 866.1, "end": 870.78, "text": "wie soll ich sagen, so komplett dahintersteht, so komplett gönne, wo ich sage, jawoll, der"}, {"id": 143, "start": 870.78, "end": 877.02, "text": "Typ ist wirklich richtig gut da drin, der ist mega spontan, also das kann auch nicht jeder,"}, {"id": 144, "start": 877.02, "end": 881.7, "text": "aber es ist vor allem Content, der mir gefällt, andere Channels, die erfolgreich sind auf"}, {"id": 145, "start": 881.7, "end": 885.5, "text": "Twitch, die mir nicht gefallen, das geht mir halt sonst wo vorbei, okay, soll er halt erfolgreich"}, {"id": 146, "start": 885.5, "end": 889.1, "text": "sein, juckt mich jetzt nicht weiter, bei manchen Channels denke ich mir, mit so einem Scheiß"}, {"id": 147, "start": 889.1, "end": 896.02, "text": "kannst du erfolgreich sein, aber bei dem ist wirklich 100%, also das ist einfach der"}, {"id": 148, "start": 896.02, "end": 901.42, "text": "Beste in der Richtung, oder was heißt der Beste, einer der Besten, gibt ja noch genug"}, {"id": 149, "start": 901.42, "end": 905.86, "text": "andere gute, aber auf Twitch auf jeden Fall der Beste, und der hat es vollkommen verdient"}, {"id": 150, "start": 905.86, "end": 910.5, "text": "und vollkommen zurecht, so viele Zuschauer, der hat ja auch relativ klein angefangen,"}, {"id": 151, "start": 910.5, "end": 915.5, "text": "das ist ja erst seit so ungefähr, sagen wir mal so, zwei Jahren vielleicht, so richtig"}, {"id": 152, "start": 915.5, "end": 924.42, "text": "big, mit acht, neuntausend Zuschauern, aber dass die den Voice Changer nicht wiedererkennen,"}, {"id": 153, "start": 924.42, "end": 928.7, "text": "ich glaube, das liegt daran, die ganzen Scam-Innen, die haben so einen hohen Durchsatz an Leuten"}, {"id": 154, "start": 928.7, "end": 942.22, "text": "in ihren Call-Centern, die haben gar keine Chance, das zu lernen, warum genau macht er"}, {"id": 155, "start": 942.22, "end": 949.06, "text": "mit dem Akkuschrauber in dem Reichenraum, wahrscheinlich, weil es cool für Thumbnail"}, {"id": 156, "start": 949.06, "end": 953.74, "text": "aussieht, oder, tieferen Sinn hat, das lehr ich mir gerade, der macht nicht einmal was"}, {"id": 157, "start": 953.74, "end": 963.74, "text": "mit dem Akkuschrauber da drinnen, nö, ja gut, ich kann es aber verstehen, es ist ein"}, {"id": 158, "start": 963.74, "end": 974.46, "text": "gutes Thumbnail, es ist ein gutes Thumbnail, und es ist ja nicht von der Realität, die"}, {"id": 159, "start": 974.46, "end": 984.7, "text": "bauen ja wahrscheinlich einen neuen Rechner, nur halt nicht mit dem Akkuschrauber."}, {"id": 160, "start": 984.7, "end": 991.94, "text": "Modern Warfare 2 Beta angespielt, stimmt, die läuft ja gerade auf der Playstation, hat"}, {"id": 161, "start": 991.94, "end": 1003.66, "text": "jemand von euch schon gespielt, und was sagt ihr dazu, was sagt ihr zu MW2 Beta, also das"}, {"id": 162, "start": 1003.66, "end": 1007.62, "text": "einzige, was ich bisher gesehen habe von der MW2 Beta, wenn ihr ein gutes Video habt, können"}, {"id": 163, "start": 1007.62, "end": 1011.58, "text": "wir uns ja heute auch was angucken, aber das einzige, was ich bisher gesehen habe von der"}, {"id": 164, "start": 1011.58, "end": 1017.86, "text": "Modern Warfare 2 Beta, ist, dass die Time to Kill mega, mega schnell sein muss, so nach"}, {"id": 165, "start": 1017.86, "end": 1030.7, "text": "dem Motto, dein Haar weht um die Ecke, tot, ja, da brauchst du eine zweite, ist es schon"}, {"id": 166, "start": 1030.7, "end": 1037.14, "text": "eine fünfer oder noch eine vierer, weil dann, weil dann kannst du die vierer dort lassen"}, {"id": 167, "start": 1037.14, "end": 1044.7, "text": "und dir eine fünfer kaufen, ah, okay, ist schon eine fünfer, na dann, nee, dann nicht,"}, {"id": 168, "start": 1044.7, "end": 1050.06, "text": "schon die GTA 6 Leaks gecheckt, nee, GTA juckt mich auch ehrlich gesagt nicht großartig,"}, {"id": 169, "start": 1050.06, "end": 1055.54, "text": "ich, muss ich halt, die haben ja auch nicht so wirklich Interesse dran, GTA 6 rauszubringen,"}, {"id": 170, "start": 1055.54, "end": 1067.66, "text": "solange GTA online und das Zeug drum herum so wahnsinnig viel Geld einbringt, das ist"}, {"id": 171, "start": 1067.66, "end": 1072.02, "text": "eine Sache, wo ich mich wirklich frage, ob sie es noch irgendwann auf die Reihe bekommen"}, {"id": 172, "start": 1072.02, "end": 1079.1, "text": "ist Elder Scrolls 6, ob das mal irgendwann was wird, das bin ich mir nicht ganz sicher,"}, {"id": 173, "start": 1079.1, "end": 1084.02, "text": "gut, mein von Half Life 3 muss ich nicht anfangen, das ist ja schon over memed im Endeffekt,"}, {"id": 174, "start": 1084.02, "end": 1091.3, "text": "Elder Scrolls 6 ist ja wirklich ein Game, wo sie auch sagen, sie sind da dran, ich fürchte"}, {"id": 175, "start": 1091.3, "end": 1095.1, "text": "halt, wenn die sagen, sie sind da dran, das ist ungefähr so, wie wenn euer Chef zu euch"}, {"id": 176, "start": 1095.1, "end": 1100.02, "text": "kommt und sagt, wie sieht es denn hier mit den drei neuen Linux Servern aus und ihr stellt"}, {"id": 177, "start": 1100.02, "end": 1103.62, "text": "in dem Moment fest, fuck, ich hab's komplett vergessen und dann sagt ihr eurem Chef, ja,"}, {"id": 178, "start": 1103.62, "end": 1107.78, "text": "da bin ich gerade dran, ungefähr so stelle ich mir die Entwicklung von Elder Scrolls"}, {"id": 179, "start": 1107.78, "end": 1126.06, "text": "6 vor, wann kommt eigentlich Overwatch 2 raus, ich bin immer noch nicht, ich bin immer noch"}, {"id": 180, "start": 1126.06, "end": 1134.02, "text": "unschüssig, ob ich mir das ach, das kann nicht mehr so lange hin, nächsten Monat, ich"}, {"id": 181, "start": 1134.02, "end": 1139.46, "text": "bin, wie gesagt, ich bin immer noch unschüssig, ob ich es mir überhaupt geben soll, ich meine,"}, {"id": 182, "start": 1139.46, "end": 1143.38, "text": "ok, es ist zum größten Teil, glaub, free to play, ich weiß nicht, wie es mit dem Singleplayer"}, {"id": 183, "start": 1143.38, "end": 1147.54, "text": "Content aussieht, geschweige denn, ob es den überhaupt noch geben wird, das war ja so"}, {"id": 184, "start": 1147.54, "end": 1150.78, "text": "eines der ersten Dinge, die sie erzählt haben, so wie sie gesagt haben, es gibt ja so eine"}, {"id": 185, "start": 1150.78, "end": 1158.3, "text": "Art Kampagne, ja interessiert mich wirklich, ob sie das hinbekommen haben, hast du eine"}, {"id": 186, "start": 1158.3, "end": 1164.1, "text": "Twitch, ja, hab ich, seit Release und ich hab irgendwie 3 Spiele für und seit 2 Jahren"}, {"id": 187, "start": 1164.1, "end": 1174.42, "text": "nicht angemacht, ne, hab ich nicht, ich hab aktuell noch meinen eigenen ESP, der das"}, {"id": 188, "start": 1174.42, "end": 1189.86, "text": "ausliest, ja, geht mir ähnlich, ich wills überhaupt nicht mehr haben, ich wills noch"}, {"id": 189, "start": 1189.86, "end": 1194.3, "text": "nicht mal installiert hab ichs mehr und irgendwie Bock Overwatch zu starten, hatte ich auch"}, {"id": 190, "start": 1194.3, "end": 1199.66, "text": "schon seit Ewigkeiten nicht mehr, also Blizzard, die haben so ein geiles Game rausgebracht"}, {"id": 191, "start": 1199.66, "end": 1210.9, "text": "und es dann einfach komplett über den letzten Jahr hinweg verkackt, ich mein, dass du Games"}, {"id": 192, "start": 1210.9, "end": 1216.62, "text": "lang supporten kannst und lang interessant halten kannst, hat man ja oft genug gesehen,"}, {"id": 193, "start": 1216.62, "end": 1219.9, "text": "ich mein, guckt euch mal an, Fortnite ist jetzt vielleicht nicht mehr das wahnsinnig"}, {"id": 194, "start": 1219.9, "end": 1224.34, "text": "krasse Überhype-Ding wie vor ein paar Jahren, aber immer noch saumäßig gut und macht saumäßig"}, {"id": 195, "start": 1224.34, "end": 1232.62, "text": "Geld, Apex auch, aber eigentlich wollt ich grad 2 komplett andere Beispiele sagen, genau,"}, {"id": 196, "start": 1232.62, "end": 1237.38, "text": "guckt euch mal Dota und LoL an, guckt euch Dota 2 und LoL an, die gibt's ewig, ich mein,"}, {"id": 197, "start": 1237.38, "end": 1243.26, "text": "die gibt's seit 2014 oder so und LoL gibt's glaub ich noch ein Ticken länger, guckt euch"}, {"id": 198, "start": 1243.26, "end": 1247.82, "text": "Dota 2 und LoL an, das sind Spiele, die haben irgendwie über ne Million tägliche Spieler,"}, {"id": 199, "start": 1247.82, "end": 1252.82, "text": "ne über ne halbe Million glaub, halbe Million oder wie, machts jetzt auch net fett, tägliche"}, {"id": 200, "start": 1252.82, "end": 1262.26, "text": "Spieler und das ist einfach immer wieder spielbar für die Leute, ja, also man sieht's an vielen"}, {"id": 201, "start": 1262.26, "end": 1265.86, "text": "Stellen, dass das geht, aber Blizzard hat's irgendwie nicht drauf gehabt bei Overwatch."}, {"id": 202, "start": 1265.86, "end": 1270.78, "text": "Ja, das Riot MMO, da bin ich auch mal wirklich gespannt drauf, denen trau ich tatsächlich"}, {"id": 203, "start": 1270.78, "end": 1272.54, "text": "zu, dass da was Gescheites rauskommt."}, {"id": 204, "start": 1272.54, "end": 1280.38, "text": "Ich mein, die haben's mit Valorant auch geschafft, einen relativ eigenständigen CS-Verschnitt"}, {"id": 205, "start": 1280.38, "end": 1286.34, "text": "zu machen, der doch weit genug davon weg ist, um als eigenständiges Spiel durchzugehen,"}, {"id": 206, "start": 1286.34, "end": 1295.7, "text": "wobei man halt sagen muss, Valorant ist alive, aber jetzt, also ich red jetzt mal nur von"}, {"id": 207, "start": 1295.7, "end": 1298.94, "text": "der E-Sport-Seite, weil selbst spiel ich das ja nicht, keine Ahnung wie das Ingame ist"}, {"id": 208, "start": 1298.94, "end": 1302.94, "text": "und wie viel Spieler das eigentlich hat, die E-Sport-Sache, die ist auch alive, aber das"}, {"id": 209, "start": 1302.94, "end": 1308.18, "text": "ist jetzt natürlich kein absolut riesen Game im E-Sport."}, {"id": 210, "start": 1308.18, "end": 1319.18, "text": "Also, Valorant ist jetzt nix kleines, aber das ist auch kein, es ist kein Dota und kein"}, {"id": 211, "start": 1319.18, "end": 1333.18, "text": "LoL, es ist halt, da hat seine Zuschauer vielleicht ein bisschen mehr als StarCraft 2 Niveau,"}, {"id": 212, "start": 1333.18, "end": 1337.54, "text": "also E-Sport technisch, das ist da, da gibt's auch Teams und so, aber das ist jetzt nicht"}, {"id": 213, "start": 1337.54, "end": 1344.7, "text": "wirklich Mainstream E-Sport Valorant, aber immerhin, also ich meine, du musst erst mal"}, {"id": 214, "start": 1344.7, "end": 1349.82, "text": "ein neues Game rausbringen und das ist insofern ja auch ganz erfolgreich, ich denke mal, dass"}, {"id": 215, "start": 1349.82, "end": 1357.98, "text": "ich denen noch am ehesten zutraue, ein ordentliches MMO rauszubringen für die nächsten Jahre,"}, {"id": 216, "start": 1357.98, "end": 1364.62, "text": "da bin ich echt mal gespannt drauf, was da kommt, ist das MMO im LoL-Universum, ich hoffe"}, {"id": 217, "start": 1364.62, "end": 1369.34, "text": "ja nicht, so geil finde ich das nämlich nicht, aber wahrscheinlich, die werden ja auch blöd"}, {"id": 218, "start": 1369.34, "end": 1370.34, "text": "werden nicht."}, {"id": 219, "start": 1370.34, "end": 1375.26, "text": "Wir müssen uns die New-World-Spieler-Zahlen angucken, ok, ich hab's hier noch auf, Sekunde,"}, {"id": 220, "start": 1375.26, "end": 1376.26, "text": "ich refresh mal schnell."}, {"id": 221, "start": 1376.26, "end": 1385.98, "text": "Oh guck mal, die sind hochgegangen Leute, guck mal hier, Massive, is free weekend oder wie?"}, {"id": 222, "start": 1385.98, "end": 1399.1, "text": "Was da los, haben die den DLC released oder, warum, was ist da los, warum sind die letzten"}, {"id": 223, "start": 1399.1, "end": 1400.1, "text": "zwei Monate wieder hochgegangen?"}, {"id": 224, "start": 1400.1, "end": 1415.22, "text": "Davor ist es einfach nur runtergegangen, oh hier, woop, oh da geht's wieder hoch, den"}, {"id": 225, "start": 1415.22, "end": 1419.86, "text": "Hype um New-World, den Hype gab es vielleicht zwei Wochen lang, oder bei den Leuten, die"}, {"id": 226, "start": 1419.86, "end": 1423.54, "text": "nur deutschen Let's-Player folgen, vielleicht auch einen Monat lang, aber dann war's vorbei."}, {"id": 227, "start": 1423.54, "end": 1428.98, "text": "Warum das überhaupt jemals einen Hype hatte, ja das ist eine berechtigte Frage, ich hab's"}, {"id": 228, "start": 1428.98, "end": 1433.98, "text": "in der Beta schon gesagt, dass das Spiel einfach lieblos zusammengewurschteltes Möchtegern-MMO"}, {"id": 229, "start": 1433.98, "end": 1442.26, "text": "ist, von Leuten, die anscheinend nicht wissen, wie man MMOs macht, aber ok, die ganzen gerade"}, {"id": 230, "start": 1442.26, "end": 1445.34, "text": "deutschsprachigen Let's-Player sind natürlich drauf eingestiegen, ist ja auch klar, gab"}, {"id": 231, "start": 1445.34, "end": 1451.34, "text": "ja auch Kohle, kenne ich ja nix Verwerfliches, aber natürlich sind die ganzen blöden Casual-Noobs"}, {"id": 232, "start": 1451.34, "end": 1455.26, "text": "da drauf gesprungen, so nach dem Motto, oh hier mein Lieblings-Let's-Player spielt das"}, {"id": 233, "start": 1455.26, "end": 1466.14, "text": "bestes Game ever, lululul, und tja, ja das stimmt nicht so ganz, also es gab News-Meldungen,"}, {"id": 234, "start": 1466.14, "end": 1470.94, "text": "dass New-World Grafikkarten killt, das war aber, das lag aber an den Grafikkarten nicht"}, {"id": 235, "start": 1470.94, "end": 1476.62, "text": "so sehr an New-World, New-World hat halt im Hauptmenü anscheinend keinerlei Sleep drinne"}, {"id": 236, "start": 1476.62, "end": 1482.38, "text": "gehabt und die haben quasi 100% das Hauptmenü mit 800 FPS gerendert oder so, das heißt"}, {"id": 237, "start": 1482.38, "end": 1487.22, "text": "die Grafikkarte war, wenn du im Hauptmenü warst, immer auf Anschlag und die Leute waren"}, {"id": 238, "start": 1487.22, "end": 1491.5, "text": "halt viel im Hauptmenü, weil das Spiel am Anfang massig Warteschlangen hatte und wenn"}, {"id": 239, "start": 1491.5, "end": 1497.34, "text": "die Grafikkarte dann halt so ein paar kleinere Probleme hatte, die sind dann halt, haben halt"}, {"id": 240, "start": 1497.34, "end": 1501.9, "text": "viele erst bemerkt dadurch, dass wenn du mehrere Stunden deine Grafikkarte auf 100% laufen"}, {"id": 241, "start": 1501.9, "end": 1502.9, "text": "lassen hattest."}, {"id": 242, "start": 1502.9, "end": 1510.58, "text": "Also New-World ist, das habe ich am Anfang auch nicht verstanden, dass da Leute überhaupt"}, {"id": 243, "start": 1510.58, "end": 1516.74, "text": "drauf angesprungen sind, mir war es von Anfang an klar, dass das nur noch eine Hülle ist"}, {"id": 244, "start": 1516.74, "end": 1521.38, "text": "im Prinzip von Leuten, die versucht haben den MMO zu bauen, aber eigentlich nicht wissen"}, {"id": 245, "start": 1521.38, "end": 1526.3, "text": "was sie machen und das siehst du an New-World, ich mein, da muss ich mal überlegen, New-World"}, {"id": 246, "start": 1526.3, "end": 1531.54, "text": "hatte am Anfang als MMO so eine Art, ich weiß, dass es nicht genau das gleiche ist, so eine"}, {"id": 247, "start": 1531.54, "end": 1541.02, "text": "Art Client-Side-Hit-Detection in einem MMO, Alter, in einem MMO, könnt ihr euch das vorstellen?"}, {"id": 248, "start": 1541.02, "end": 1547.86, "text": "Leute, die, guck mal, du konntest am Anfang New-World im Fenstermodus rumschieben und"}, {"id": 249, "start": 1547.86, "end": 1548.86, "text": "du konntest nicht getroffen werden."}, {"id": 250, "start": 1548.86, "end": 1556.46, "text": "Es gab übrigens genug andere MMOs, da war das auch so, in Dark war das auch teilweise"}, {"id": 251, "start": 1556.46, "end": 1557.46, "text": "so."}, {"id": 252, "start": 1557.46, "end": 1558.46, "text": "Fenster-Dragon."}, {"id": 253, "start": 1558.46, "end": 1560.22, "text": "Mario, danke schön für den Zapp."}, {"id": 254, "start": 1560.22, "end": 1566.38, "text": "Echt, ist das noch in Entwicklung?"}, {"id": 255, "start": 1566.38, "end": 1570.7, "text": "Da habe ich seit drei Jahren nichts mehr von gehört."}, {"id": 256, "start": 1570.7, "end": 1577.14, "text": "Ok, YouTube möchte unbedingt, dass wir das Video gucken, aber ich will das jetzt nicht"}, {"id": 257, "start": 1577.14, "end": 1578.14, "text": "gucken."}, {"id": 258, "start": 1578.14, "end": 1580.54, "text": "Jetzt ist sie weg, YouTube!"}, {"id": 259, "start": 1580.54, "end": 1581.54, "text": "Alter!"}, {"id": 260, "start": 1581.54, "end": 1587.7, "text": "So, jetzt ist sie weg."}, {"id": 261, "start": 1587.7, "end": 1594.22, "text": "W-w-wie ist es wieder?!"}, {"id": 262, "start": 1594.22, "end": 1598.22, "text": "Normalerweise reicht es bei YouTube, wenn man die Videos einmal anklickt und danach sind"}, {"id": 263, "start": 1598.22, "end": 1599.22, "text": "sie weg."}, {"id": 264, "start": 1599.22, "end": 1602.22, "text": "Aber nein, YouTube, bis zur Meinung, ich will das da!"}, {"id": 265, "start": 1602.22, "end": 1603.7, "text": "Das will ich jetzt unbedingt gucken."}, {"id": 266, "start": 1603.7, "end": 1618.66, "text": "Die YouTube AI hat nicht schnell genug gelernt."}, {"id": 267, "start": 1618.66, "end": 1622.22, "text": "Sekunde ich muss mal kurz mein Headset entwirren."}, {"id": 268, "start": 1622.22, "end": 1639.22, "text": "Ja Leute, gibt es sonst irgendwas spannendes Neues?"}, {"id": 269, "start": 1639.22, "end": 1640.9, "text": "Habe ich irgendwas die Woche verpasst?"}, {"id": 270, "start": 1640.9, "end": 1643.34, "text": "Gab es irgendwelche spannende News?"}, {"id": 271, "start": 1643.34, "end": 1652.9, "text": "Irgendetwas in der IT Welt passiert oder außer der Uber Hack?"}, {"id": 272, "start": 1652.9, "end": 1656.1, "text": "Das mit EVGA, dass die keinen Bock mehr auf NVIDIA haben, ja das habe ich mitgekriegt."}, {"id": 273, "start": 1656.1, "end": 1658.58, "text": "Sonst noch irgendwas spannendes."}, {"id": 274, "start": 1658.58, "end": 1667.02, "text": "NVIDIA wurde auch gehackt?"}, {"id": 275, "start": 1667.02, "end": 1668.02, "text": "Wirklich?"}, {"id": 276, "start": 1668.02, "end": 1669.22, "text": "Das habe ich noch gar nicht mitgekriegt."}, {"id": 277, "start": 1669.22, "end": 1672.46, "text": "Zeig mal hier, News."}, {"id": 278, "start": 1672.46, "end": 1674.54, "text": "Ne, sehe ich nix."}, {"id": 279, "start": 1674.54, "end": 1680.62, "text": "Mitgehen jetzt zu 8 auf Bites, exellent."}, {"id": 280, "start": 1680.62, "end": 1692.1, "text": "In China ist gerade ein Zerkreisung gefallen, hey immerhin besser als ein Schiff, da gibt"}, {"id": 281, "start": 1692.1, "end": 1695.98, "text": "es so viele Schiffe und mittlerweile, ok Schiffe fallen nicht um, Schiffe bleiben ja eigentlich"}, {"id": 282, "start": 1695.98, "end": 1697.14, "text": "nur noch stecken aktuell."}, {"id": 283, "start": 1697.14, "end": 1705.5, "text": "Das habe ich, ja stimmt, das habe ich auch gelesen, ja genau, muss jetzt überall Zeiterfassung"}, {"id": 284, "start": 1705.5, "end": 1708.58, "text": "machen, was mich nicht weiter juckt, weil ich mache eh schon Zeiterfassung."}, {"id": 285, "start": 1708.58, "end": 1728.3, "text": "Ich gucke mal kurz was die Woche, äh, kurz mal kurz was die Woche GitHub Trends war,"}, {"id": 286, "start": 1728.3, "end": 1732.66, "text": "das gucke ich einmal sonntags eigentlich immer ganz gern, StableDiffusion, ja das wundert"}, {"id": 287, "start": 1732.66, "end": 1743.38, "text": "mich nicht, weil AI und so, Charts, gut juckt mich nicht, Jason, Crack oder wie meinte der"}, {"id": 288, "start": 1743.38, "end": 1753.42, "text": "Jason Erfinder, eigentlich müsste es, eigentlich müsste es Jawsaw heißen oder so, PocketBase,"}, {"id": 289, "start": 1753.42, "end": 1771.26, "text": "ist das doppelt drin, guck mal das ist lustig, High Performance Programming in Python und"}, {"id": 290, "start": 1771.26, "end": 1790.1, "text": "was ist das C++, gut es sind halt irgendwelche C-Module für Python, aber trotzdem, so, nix"}, {"id": 291, "start": 1790.1, "end": 1802.3, "text": "spannendes würde ich sagen, Jellyfin mal wieder am Start, ja nö nix spannendes, mal"}, {"id": 292, "start": 1802.3, "end": 1807.66, "text": "so eine Frage, wie selten ist es, Moment was, dass man dem Unternehmen als Entwickler Linux"}, {"id": 293, "start": 1807.66, "end": 1811.3, "text": "nutzen darf, weil ich bin gerade irgendwie der Einzige in meinem Unternehmen, das kann"}, {"id": 294, "start": 1811.3, "end": 1817.9, "text": "ich schlecht sagen, also dort wo ich bisher gearbeitet habe, konntest du Linux verwenden,"}, {"id": 295, "start": 1817.9, "end": 1826.74, "text": "allerdings muss ich dazu sagen, dass es auch bei uns immer mehr Probleme gibt, da das nicht"}, {"id": 296, "start": 1826.74, "end": 1830.94, "text": "mehr zu erlauben, allerdings anscheinend ist es in letzter Zeit wieder ein bisschen lockerer"}, {"id": 297, "start": 1830.94, "end": 1836.18, "text": "geworden, weil ich darf wieder Linux auf mein Notebook draufhauen, auf der anderen Seite"}, {"id": 298, "start": 1836.18, "end": 1839.54, "text": "geht es auch bei uns eher in Richtung Bring Your Own Device, da bin ich mal gespannt wie"}, {"id": 299, "start": 1839.54, "end": 1843.98, "text": "sie das machen wollen mit den anderen Geschichten zusammen, aber was auch immer und nachdem"}, {"id": 300, "start": 1843.98, "end": 1848.18, "text": "ich eh zum größten Teil Homeoffice arbeite, Remote mit einem Jump Host, hab ich meine lokale"}, {"id": 301, "start": 1848.18, "end": 1856.82, "text": "VM und alles ist gut, ansonsten glaube ich, ich rate jetzt einfach mal, ich glaube, dass"}, {"id": 302, "start": 1856.82, "end": 1864.02, "text": "ganz viele Unternehmen eben in diesem Microsoft Active Directory Shit und alles muss super"}, {"id": 303, "start": 1864.02, "end": 1869.06, "text": "restriktiv sein und gemanagt sein und selbst Administratoren dürfen keine Adminsachen"}, {"id": 304, "start": 1869.06, "end": 1875.9, "text": "mehr auf ihren Rechnern machen, dass sie da ziemlich hängen geblieben sind und dass"}, {"id": 305, "start": 1875.9, "end": 1884.86, "text": "es bei vielen nicht erlaubt ist, was anderes zu verwenden als Windows, was für die meisten"}, {"id": 306, "start": 1884.86, "end": 1890.94, "text": "Anwender ja durchaus okay ist, aber in manchen Bereichen ist es halt doof, also sag mal so,"}, {"id": 307, "start": 1890.94, "end": 1894.46, "text": "wenn du Software entwickelst, gerade für Linux-Systeme oder selbst wenn du nicht für"}, {"id": 308, "start": 1894.46, "end": 1899.02, "text": "Linux-Systeme Software entwickelst, solange mich gerade Windows Desktop Software entwickelt,"}, {"id": 309, "start": 1899.02, "end": 1903.1, "text": "selbst wenn es Web-Anwendungen sind oder so, das hat durchaus seinen Charme, die Sache"}, {"id": 310, "start": 1903.1, "end": 1910.06, "text": "unter Linux zu entwickeln, gerade, ich meine, du kannst alles irgendwie unter Windows mit"}, {"id": 311, "start": 1910.06, "end": 1914.9, "text": "VSL machen, aber gerade die Kombination aus einem ordentlichen Package Manager, das aus"}, {"id": 312, "start": 1914.9, "end": 1921.5, "text": "native Docker Support, aus einem ordentlichen Terminal, die ganze Kombination ist einfach"}, {"id": 313, "start": 1921.5, "end": 1926.46, "text": "angenehmer oder aber, was auch viele machen mittlerweile ist halt, dass man Entwickler"}, {"id": 314, "start": 1926.46, "end": 1931.78, "text": "mit Macs ausstattet, habe ich jetzt auch schon ein paar Mal gehört, und ein Mac ist halt"}, {"id": 315, "start": 1931.78, "end": 1938.94, "text": "so, also der, noch der beste Kompromiss, wenn es nicht anders geht, aus irgend so einem"}, {"id": 316, "start": 1938.94, "end": 1952.1, "text": "Linux Unix-artigem Unterbau, ist eigentlich ein BSD, und bisschen Bling Bling, ja es"}, {"id": 317, "start": 1952.1, "end": 1956.86, "text": "gibt, es gibt, geht unter Windows, gibt es auch öfters Probleme, wir hatten beispielsweise"}, {"id": 318, "start": 1956.86, "end": 1963.66, "text": "mal eine Datei, die sich Con.pp nannte, das war eine Puppet Server-Config-Datei, Con.pp,"}, {"id": 319, "start": 1963.66, "end": 1968.14, "text": "und wie ihr wisst, unter Windows dürfen keine Dateien Con heißen, guck mal, kann ich, falls"}, {"id": 320, "start": 1968.14, "end": 1977.62, "text": "ihr mir das nicht glaubt, ich hoffe, das ist mittlerweile immer noch so, Con, ha, geht"}, {"id": 321, "start": 1977.62, "end": 1985.98, "text": "nicht, egal wie ihr die Datei nennt, ihr dürft eine Datei nicht Con nennen, also auch Con.hackle"}, {"id": 322, "start": 1985.98, "end": 1991.5, "text": "geht nicht, das sind reservierte Sachen, noch irgendwelche von alten DOS, von irgendwelchen"}, {"id": 323, "start": 1991.5, "end": 1996.66, "text": "alten DOS Device Names und sowas, und da hatten wir das Problem, wenn jemand unser Repo ausgecheckt"}, {"id": 324, "start": 1996.66, "end": 2005.26, "text": "hat, unter Windows, dann hat Git immer angezeigt, ihm fehlt eine Datei, weil Git die Datei nicht"}, {"id": 325, "start": 2005.26, "end": 2020.02, "text": "anlegen konnte, na die Hardware sollte doch eigentlich unter Mac gerade das Gute sein,"}, {"id": 326, "start": 2020.02, "end": 2021.02, "text": "oder?"}, {"id": 327, "start": 2021.02, "end": 2025.7, "text": "Weil die, also rein von der ED und so, wie uns das Apple immer verkauft, weil das halt"}, {"id": 328, "start": 2025.7, "end": 2029.18, "text": "genau zum OS passt, ist das so?"}, {"id": 329, "start": 2029.18, "end": 2037.9, "text": "Ich weiß nicht, ich verwende nicht regelmäßig macOS, das stimmt, das stimmt, durch WSL ist"}, {"id": 330, "start": 2037.9, "end": 2042.06, "text": "es tatsächlich erträglich geworden Windows zu verwenden, das ist tatsächlich so, ich"}, {"id": 331, "start": 2042.06, "end": 2046.38, "text": "hab lange Zeit unter Windows Alternativen verwendet, früher als es WSL noch nicht gegeben"}, {"id": 332, "start": 2046.38, "end": 2060.34, "text": "hat, ja, kennt auch jemand Sikwine, wie auch immer man das ausspricht, oder, äh, gegessen"}, {"id": 333, "start": 2060.34, "end": 2066.5, "text": "wir das andere hieß, Endlinux gab es noch und gab ein paar Versuche, aber WSL ist tatsächlich"}, {"id": 334, "start": 2066.5, "end": 2077.18, "text": "das beste, ich mein ich hab ja auch so ein bisschen sowas hier noch laufen, das verarscht"}, {"id": 335, "start": 2077.18, "end": 2086.5, "text": "aber wirklich bloß die BWL Leute auf den ersten Blick, da kann ich nichts zu sagen,"}, {"id": 336, "start": 2086.5, "end": 2093.18, "text": "von so Client Management hab ich keine Ahnung, ich denke für Client, für so Arbeitsbusiness"}, {"id": 337, "start": 2093.18, "end": 2098.02, "text": "Umgebung ist Active Directory tatsächlich eines der besten Sachen die es gibt, vor allem"}, {"id": 338, "start": 2098.02, "end": 2103.94, "text": "findest du Leute da, die sich damit halbwegs auskennen, Sikwas, Sikwin, Sikwin, hier,"}, {"id": 339, "start": 2103.94, "end": 2119.26, "text": "das da, das war mal sowas wie WSL, nur nicht WSL, sieht sehr alt aus, das sieht so alt"}, {"id": 340, "start": 2119.26, "end": 2124.22, "text": "aus, weil es das alte Windows Terminal ist, aber ja, aber jemand hat WSL gesperrt, ja,"}, {"id": 341, "start": 2124.22, "end": 2131.14, "text": "das ist wirklich Clown Fiesta, ja, das ist richtig dämlich, oder, könntest du ja mal"}, {"id": 342, "start": 2131.14, "end": 2134.7, "text": "was ordentliches machen mit deinem Windows Rechner, das geht aber nicht, das müssen"}, {"id": 343, "start": 2134.7, "end": 2162.06, "text": "wir sperren, weg damit, das ist gut, das spricht für deine Arbeit, ich habe keine Ahnung,"}, {"id": 344, "start": 2162.06, "end": 2166.14, "text": "aber solange die Beta nicht für den PC kommt, ich werde garantiert nicht meine Playstation,"}, {"id": 345, "start": 2166.14, "end": 2171.58, "text": "meine Release Playstation 4 dafür anwerfen, darauf läuft es wahrscheinlich mit 15 FPS"}, {"id": 346, "start": 2171.58, "end": 2179.78, "text": "oder so, und ich kann mit dem Controller absolut nicht umgehen, ich weiß, man kann mit dem"}, {"id": 347, "start": 2179.78, "end": 2190.62, "text": "Mausdastaturspiel, aber es ist auch eklig, wir dürfen nichts in der Cloud machen, bei"}, {"id": 348, "start": 2190.62, "end": 2195.38, "text": "uns ist das Gegenteil, bei uns wollen sie, dass du alles in der Cloud machst mittlerweile,"}, {"id": 349, "start": 2195.38, "end": 2201.98, "text": "wir hatten beispielsweise mal einen internen Fileserver für Backups und den wollen sie"}, {"id": 350, "start": 2201.98, "end": 2206.3, "text": "jetzt abschalten oder haben sie letzte Woche abgeschaltet und haben gesagt, ja, leg die"}, {"id": 351, "start": 2206.3, "end": 2217.82, "text": "Sachen doch in OneDrive und da habe ich mir auch so gedacht, soll ich jetzt meine kompletten"}, {"id": 352, "start": 2217.82, "end": 2223.02, "text": "Gigabyte Backups oder so mal nach OneDrive machen, was auch immer, mache ich halt keinen"}, {"id": 353, "start": 2223.02, "end": 2241.1, "text": "Backup mehr, hast du schon mal was zu SurrealDB angeschaut, ja, aber können wir heute im"}, {"id": 354, "start": 2241.1, "end": 2247.06, "text": "Stream auch machen, gibt es ja ein Fireship Video zu, ich kenne das Ding, ich habe mich"}, {"id": 355, "start": 2247.06, "end": 2250.58, "text": "auch schon ein bisschen beschäftigt diese Woche, weil ich es vom Ansatz her wirklich"}, {"id": 356, "start": 2250.58, "end": 2256.38, "text": "spannend finde, also das ist ja, ich zeige es mal kurz auf GitHub, das ist ja der Versuch,"}, {"id": 357, "start": 2256.38, "end": 2264.94, "text": "die ultimative Datenbank zu bauen, also quasi eine Datenbank, die alles kann, von SQL Style,"}, {"id": 358, "start": 2264.94, "end": 2277.82, "text": "NoSQL Style, Key-Value mäßig, Event Store, Time Series, alles, Craft-Based, alles, ja,"}, {"id": 359, "start": 2277.82, "end": 2284.78, "text": "Database, also alles, IoT, Backend, Cloud Database, Realtime, alles, ganz ehrlich, ich"}, {"id": 360, "start": 2284.78, "end": 2293.1, "text": "meine mal davon abgesehen, das ist ja irgendwie, das hat irgendwie zwei Leute als Core-Entwickler,"}, {"id": 361, "start": 2293.1, "end": 2300.54, "text": "ich bin gespannt, ob es den initialen Hype überhaupt gerecht werden kann oder überhaupt"}, {"id": 362, "start": 2300.54, "end": 2306.5, "text": "längere Zeit überlebt bzw. relevant werden wird, weil ich mal nur weil ein Projekt Hype"}, {"id": 363, "start": 2306.5, "end": 2309.66, "text": "hat und viele GitHub-Store heißen nicht zwangsläufig, dass es relevant wird."}, {"id": 364, "start": 2309.66, "end": 2320.7, "text": "Warum es nicht MinusRS heißt, ganz ehrlich, da haben die bei mir riesen Pluspunkte gesammelt,"}, {"id": 365, "start": 2320.7, "end": 2326.06, "text": "dass sie nicht MinusRS heißen und hier nicht steht Written in Rust und Blazingly Fast,"}, {"id": 366, "start": 2326.06, "end": 2330.38, "text": "ich weiß gar nicht, ob Rust überhaupt hier drin vorkommt, auf der Webseite, irgendwo"}, {"id": 367, "start": 2330.38, "end": 2336.3, "text": "hier unten, ja, gar nicht kommt das vor, so muss es nämlich auch sein, weil ganz ehrlich,"}, {"id": 368, "start": 2336.3, "end": 2340.54, "text": "wenn ich eine Datenbank verwende und ich rede jetzt nicht von irgendeiner Embedded Datenbank,"}, {"id": 369, "start": 2340.54, "end": 2345.58, "text": "wo ich wirklich an die, an die, an das Interface, an die API dran muss, sondern eine normale"}, {"id": 370, "start": 2345.58, "end": 2353.14, "text": "Datenbank verwende, dann sollte es mir absolut wurscht sein, in was diese Datenbank programmiert"}, {"id": 371, "start": 2353.14, "end": 2357.18, "text": "ist, ich meine, wenn es mich interessiert und ich nachgucken will, okay, aber das sollte"}, {"id": 372, "start": 2357.18, "end": 2363.54, "text": "nicht meine Entscheidungsgrundlage sein, benutze ich diese Datenbank oder nicht, deswegen finde"}, {"id": 373, "start": 2363.54, "end": 2371.06, "text": "ich es gut, dass sie hier nicht so Blazingly Fast, Written in Rust, Rakete, Rust, Rust-Tashian-Style"}, {"id": 374, "start": 2371.06, "end": 2377.22, "text": "machen, die haben sicherlich noch mehr Issues und ganz viele schon geschlossen, also da"}, {"id": 375, "start": 2377.22, "end": 2380.74, "text": "bin ich wirklich mal gespannt, ob da am Ende was rauskommt, weil das ist sehr ambitioniert"}, {"id": 376, "start": 2380.74, "end": 2386.46, "text": "für zwei Leute und es ist halt die Frage, werden die in einzelnen Disziplinen so gut,"}, {"id": 377, "start": 2386.46, "end": 2392.06, "text": "dass es sich lohnt, weil es ist halt einfach mal so, in der Regel brauchst du halt keine"}, {"id": 378, "start": 2392.06, "end": 2402.66, "text": "Datenbank, die fünf verschiedene Sachen kann, sondern eine, die eines gut kann, also sprich,"}, {"id": 379, "start": 2402.66, "end": 2406.34, "text": "wenn ich eine normale Datenbank brauche, dann nehme ich halt Postgres und Postgres kann"}, {"id": 380, "start": 2406.34, "end": 2412.06, "text": "nicht nur, kann ja mittlerweile deutlich mehr als nur normales, relationales SQL-Gedöns,"}, {"id": 381, "start": 2412.06, "end": 2417.66, "text": "Postgres kann relativ gut Time-Series mittlerweile, kann relativ gut Volltext-Suche und kann"}, {"id": 382, "start": 2417.66, "end": 2422.42, "text": "sogar Volltext-Suche mit Sub-String-Matching, hat eingebauten JSON-Support und sonst was"}, {"id": 383, "start": 2422.42, "end": 2427.54, "text": "alles, also Postgres ist, was so klassische SQL-Datenbank angeht, eigentlich das beste,"}, {"id": 384, "start": 2427.54, "end": 2431.42, "text": "was du verwenden kannst, manch einer würde jetzt sagen Oracle, aber dazu kann ich nichts"}, {"id": 385, "start": 2431.42, "end": 2435.62, "text": "sagen und auf der anderen Seite habe ich keine zwei Millionen für Lizenzen übrig, aber"}, {"id": 386, "start": 2435.62, "end": 2440.46, "text": "Postgres ist das beste, was du verwenden kannst und in der anderen Welt hast du ja auch spezielle"}, {"id": 387, "start": 2440.46, "end": 2443.98, "text": "Produkte, ich muss ehrlich sagen, ich habe noch nie ein größeres Projekt mit MongoDB"}, {"id": 388, "start": 2443.98, "end": 2449.66, "text": "gemacht, also zu neuen SQLs kann ich insgesamt relativ wenig sagen, wo ich schon was mit"}, {"id": 389, "start": 2449.66, "end": 2462.06, "text": "gemacht habe ist, soll ich vergessen wie es heißt, InfluxDB, jetzt habe ich Time-Series,"}, {"id": 390, "start": 2462.06, "end": 2469.78, "text": "InfluxDB, aber ansonsten ganz ehrlich, in der Regel reicht das, was Postgres kann, dicker"}, {"id": 391, "start": 2469.78, "end": 2478.98, "text": "als das, und es ist selten, dass man sagt, ja ich brauche klassische SQL-Style-Datenbank,"}, {"id": 392, "start": 2478.98, "end": 2486.26, "text": "dazu aber auch noch Schemaless NoSQL plus Events plus Time-Series plus sonst was, keine"}, {"id": 393, "start": 2486.26, "end": 2490.94, "text": "Ahnung, vielleicht ist das aber auch so gut integriert, dass du dann tatsächlich wirklich"}, {"id": 394, "start": 2490.94, "end": 2495.94, "text": "das beste davon benutzen kannst für deinen jeweiligen Anwendungszweck und es dann doch"}, {"id": 395, "start": 2495.94, "end": 2502.54, "text": "Sinn macht, mehrere Ansätze in der gleichen Art, ich weiß es nicht, ich bin mal gespannt,"}, {"id": 396, "start": 2502.54, "end": 2507.26, "text": "ich bin wirklich gespannt was da rauskommt, es ist auf jeden Fall ein äußerst ambitioniertes"}, {"id": 397, "start": 2507.26, "end": 2511.38, "text": "Projekt und mal gucken wie das in zwei Jahren aussieht."}, {"id": 398, "start": 2511.38, "end": 2518.3, "text": "Ihr habt von Oracle nach Postgres migriert, ja würde ich auch so machen, nein schon wegen"}, {"id": 399, "start": 2518.3, "end": 2521.62, "text": "den Lizenzkosten, wisst ihr eigentlich, ich habe das glaube ich schon ein paar mal erzählt,"}, {"id": 400, "start": 2521.62, "end": 2528.94, "text": "man kann es nicht oft genug erzählen, wisst ihr eigentlich, wenn ihr eine Oracle-Datenbank"}, {"id": 401, "start": 2528.94, "end": 2533.38, "text": "auf eine VM haut, was ja in der heutigen Zeit eigentlich was ganz normales sein soll, dass"}, {"id": 402, "start": 2533.38, "end": 2536.74, "text": "man eine Datenbank in der VM betreibt oder vielleicht sogar in irgendeiner Cloud-Umgebung"}, {"id": 403, "start": 2536.74, "end": 2540.82, "text": "oder wo auch immer oder sagen wir mal in der VM, wisst ihr eigentlich, dass ihr dann die"}, {"id": 404, "start": 2540.82, "end": 2545.54, "text": "Datenbank lizenzieren müsst, nicht für CPUs in der VM, sondern für CPUs im Host, also"}, {"id": 405, "start": 2545.54, "end": 2555.46, "text": "sprich ihr habt eine 24 kernigen ESX Cluster-Node und darauf habt ihr eine Oracle-Datenbank laufen"}, {"id": 406, "start": 2555.46, "end": 2561.78, "text": "mit 4 CPUs in der VM, dann müsst ihr 24 CPUs lizenzieren und nicht 4, weil Oracle sich"}, {"id": 407, "start": 2561.78, "end": 2574.3, "text": "gedacht hat easy money, du müsstest tatsächlich, wenn du deine Oracle-Datenbank auf einer Kiste"}, {"id": 408, "start": 2574.3, "end": 2580.66, "text": "laufen lässt auf eurem 128 CPU Hyper-V Cluster, da musst du 128 CPU Kerle lizenzieren, jaja"}, {"id": 409, "start": 2580.66, "end": 2588.34, "text": "so ist das bei Oracle, du kannst das ganze umgehen mit wer hätte das gedacht, Oracle-Virtualisierung"}, {"id": 410, "start": 2588.34, "end": 2594.34, "text": "verwenden, wenn du die Oracle-Virtualisierungslösung verwendest, die keine Sau verwendet außer"}, {"id": 411, "start": 2594.34, "end": 2599.34, "text": "für Oracle-Datenbanken, weil sie einfach unsinnig ist und eigentlich keine Daseinsberechtigung"}, {"id": 412, "start": 2599.34, "end": 2609.06, "text": "hat, also die ist absolut unsinnig, aber man kann damit Lizenzkosten sparen und dort musst"}, {"id": 413, "start": 2609.06, "end": 2616.18, "text": "du dann nur deine VM-CPU-Cores lizenzieren, ich weiß noch nicht mal wie diese Oracle-Virtualisierungslösung"}, {"id": 414, "start": 2616.18, "end": 2627.58, "text": "überhaupt heißt, weil die so unbedeutend ist, ist so, zumindest mit im Grund, das kenne"}, {"id": 415, "start": 2627.58, "end": 2635.34, "text": "ich nicht, war das ein Messenger, doch das habe ich mir tatsächlich schon angeguckt,"}, {"id": 416, "start": 2635.34, "end": 2650.98, "text": "nicht Virtualbox, die haben wir in irgendeiner Enterprise, Oracle-Virtualisierungslösung,"}, {"id": 417, "start": 2650.98, "end": 2669.22, "text": "das heißt einfach Oracle-Virtualisierungslösung, ok, also KVM, jetzt mal seriously Oracle,"}, {"id": 418, "start": 2669.22, "end": 2678.18, "text": "jetzt mal KVM, wirklich irgendwie hier versus VM-RV-Sphere, das ist ja wirklich, also nicht"}, {"id": 419, "start": 2678.18, "end": 2685.98, "text": "nur Äpfel und Birnen verglichen, das ist Hochhäuser mit Tiefgaragen verglichen, also"}, {"id": 420, "start": 2685.98, "end": 2690.74, "text": "das ist ja wirklich zwei komplett unterschiedliche Paar Schuhe, das ganze VM-Ware Ökosystem"}, {"id": 421, "start": 2690.74, "end": 2700.26, "text": "drumherum ist viel viel ausgereifter und besser als KVM, KVM ist ein Super-Virtualisierungsgrundlage,"}, {"id": 422, "start": 2700.26, "end": 2712.5, "text": "aber das kann man doch nicht mit dem gesamten VM-Ding vergleichen, nö, keine Ahnung, VM-V-Sphere"}, {"id": 423, "start": 2712.5, "end": 2717.18, "text": "ist eine komplette Virtualisierungslösung mit Management-Interface, Clusterverwaltung,"}, {"id": 424, "start": 2717.18, "end": 2723.26, "text": "Hochverfügbarkeit und alles und KVM ist erstmal das, eine Funktionalität im Kernel, mit der"}, {"id": 425, "start": 2723.26, "end": 2732.78, "text": "man KVMs starten und stoppen kann, was man sieht nichts mehr, ich hab die ganze Zeit"}, {"id": 426, "start": 2732.78, "end": 2744.14, "text": "was gesehen, ich hab hier den Vorschaubildschirm bei mir auf der Seite, ja schon so früh heute,"}, {"id": 427, "start": 2744.14, "end": 2748.1, "text": "es ist ja normal, ich schwätze ja eh immer meistens eine Stunde bevor wir anfangen Videos"}, {"id": 428, "start": 2748.1, "end": 2753.94, "text": "zu gucken, das Ding habe ich schon gesehen, aber nicht ausprobiert, vom Ansatz her eine"}, {"id": 429, "start": 2753.94, "end": 2762.66, "text": "coole Sache, gerade wenn man seine Fotos nicht irgendwie iCloud-Backup oder so machen will,"}, {"id": 430, "start": 2762.66, "end": 2768.62, "text": "wir lassen uns jetzt erstmal LevelCapture Baiten würde ich sagen, LevelCapture Bait"}, {"id": 431, "start": 2768.62, "end": 2780.42, "text": "und dann gucken wir uns SerialDB in 100 Seconds an, 100, 100 Seconds, NextLord, ja NextLord"}, {"id": 432, "start": 2780.42, "end": 2792.46, "text": "bin ich kein großartiger Fan von, ich mag NextLord nicht, nein noch nicht, das müssten"}, {"id": 433, "start": 2792.46, "end": 2795.38, "text": "wir eigentlich wirklich mal machen, ich weiß nicht ob ich das schon mal aufgeschrieben"}, {"id": 434, "start": 2795.38, "end": 2803.42, "text": "hab und es dann auch nie passiert ist, ach guck mal steht sogar schon drinnen, ich pack"}, {"id": 435, "start": 2803.42, "end": 2816.7, "text": "es mal oben hin, ja das müssen wir tatsächlich mal machen, nicht weil ich scharf auf Java"}, {"id": 436, "start": 2816.7, "end": 2823.98, "text": "bin, sondern ich bin mal gespannt ob die eine gescheite Sprache hingekriegt haben, was ich"}, {"id": 437, "start": 2823.98, "end": 2827.66, "text": "anbieten würde, irgendwas was ich in anderen Sprachen schon mal gemacht habe und ich nicht"}, {"id": 438, "start": 2827.66, "end": 2846.66, "text": "viel überlegen muss, muss ich mir mal irgendwas überlegen, weiß nicht, was macht denn eine"}, {"id": 439, "start": 2846.66, "end": 2857.26, "text": "gescheite Programmiersprache aus, tja, also ich würde sagen das wichtigste ist erstmal,"}, {"id": 440, "start": 2857.26, "end": 2866.02, "text": "dass sie in irgendeiner Weise eine gewisse interne Nachvollziehbarkeit und Logik hat,"}, {"id": 441, "start": 2866.02, "end": 2870.06, "text": "ich will jetzt wie gesagt, ich sag das absichtlich so abstrakt und nicht so nach dem Motto sie"}, {"id": 442, "start": 2870.06, "end": 2874.54, "text": "muss einfach zu lesen sein und sie postet das und das und wie, ja alles, aber das wichtigste"}, {"id": 443, "start": 2874.54, "end": 2881.62, "text": "ist, dass eine Programmiersprache eine gewisse Logik interne, also eine gewisse Konsistenz"}, {"id": 444, "start": 2881.62, "end": 2887.38, "text": "aufweisen muss, ja also sprich, wenn ich, was weiß ich, wenn ich eine Sache darin gemacht"}, {"id": 445, "start": 2887.38, "end": 2891.06, "text": "habe und weiß wie die funktioniert, dass ich dann ungefähr schon einen Plan habe wie"}, {"id": 446, "start": 2891.06, "end": 2898.9, "text": "andere Sachen funktionieren müssen bzw. dass es halt nicht entgegen, also keine Ahnung,"}, {"id": 447, "start": 2898.9, "end": 2905.58, "text": "nur mal ein Beispiel, mal angenommen, um eine Schleife zu machen, wir mixen jetzt einfach"}, {"id": 448, "start": 2905.58, "end": 2910.22, "text": "mal zwei Sprachen, ja, also mal angenommen, es gäbe eine Programmiersprache, die sowas"}, {"id": 449, "start": 2910.22, "end": 2924.18, "text": "hier macht und für einen if wäre es dann sowas, das fände ich bescheuert, ja, das"}, {"id": 450, "start": 2924.18, "end": 2929.3, "text": "sind so Sachen, wo ich meine, es braucht irgendwie so eine gewisse interne Konsistenz bei einer"}, {"id": 451, "start": 2929.3, "end": 2933.42, "text": "Programmiersprache, dass sie überhaupt für mich die Chance hat gut zu sein oder sich"}, {"id": 452, "start": 2933.42, "end": 2938.3, "text": "für mich zu eignen, noch bescheuerder wäre es natürlich, wenn man es hier mit Einrückung"}, {"id": 453, "start": 2938.3, "end": 2943.5, "text": "macht anstatt, also sowas finde ich zum Beispiel hart bescheuert, also wenn man da Klammern"}, {"id": 454, "start": 2943.5, "end": 2948.06, "text": "macht, dann gar nicht oder immer, weil ansonsten ist es einfach, warum kann eigentlich Notepad"}, {"id": 455, "start": 2948.06, "end": 2954.98, "text": "immer nur noch einen Andus Schritt, wo sind wir hier eigentlich, 1985 oder solche Sachen,"}, {"id": 456, "start": 2954.98, "end": 2960.02, "text": "das muss konsistent sein und das geht dann natürlich weiter, nicht nur mit der Sprache"}, {"id": 457, "start": 2960.02, "end": 2965.1, "text": "und den Schlüsselwörtern, ja die Schlüsselwörter sollten auch irgendwie halbwegs schlüssig"}, {"id": 458, "start": 2965.1, "end": 2972.3, "text": "sein, also was ich beispielsweise auch doof finde, ich weiß, dass es das manchmal gibt,"}, {"id": 459, "start": 2972.3, "end": 2977.02, "text": "also die Leute haben sich einfach an so Sachen wie while und for und for each und so gewöhnt,"}, {"id": 460, "start": 2977.02, "end": 2982.66, "text": "es gibt Sprachen, die sind der Meinung, sie müssen es jetzt komplett anders machen und"}, {"id": 461, "start": 2982.66, "end": 2988.98, "text": "nennen es dann repeat oder so oder einfach nur loop, ich glaube go macht das oder, macht"}, {"id": 462, "start": 2988.98, "end": 2994.74, "text": "go nicht einfach nur loop, kannst du in go nicht sowas hier machen oder war das eine"}, {"id": 463, "start": 2994.74, "end": 3001.18, "text": "andere Sprache, also das finde ich auch nicht gut, so gewisse Sachen haben sich etabliert,"}, {"id": 464, "start": 3001.18, "end": 3012.3, "text": "so und was ich auch persönlich relativ wichtig finde, dass die Sprache alles wichtige mit"}, {"id": 465, "start": 3012.3, "end": 3017.82, "text": "liefert, was man halt standardmäßig so braucht, im Gegensatz zu C++, C++ liefert zwar sehr"}, {"id": 466, "start": 3017.82, "end": 3025.54, "text": "viel Zeugs mit, sehr viel doppeltes Zeugs mit und unklares Zeugs, aber so in den Kerndisziplinen"}, {"id": 467, "start": 3025.54, "end": 3032.1, "text": "versagt die C++ Standard Library eigentlich komplett, du kannst in der C++ Standard Library"}, {"id": 468, "start": 3032.1, "end": 3040.18, "text": "keinen Webrequest machen zum Beispiel und ich finde im Jahr 2022 sollte es diese Option"}, {"id": 469, "start": 3040.18, "end": 3052.14, "text": "in einer Standard Library geben, dass ich ein HTTP GET Request mache oder dass beispielsweise"}, {"id": 470, "start": 3052.14, "end": 3057.74, "text": "die Standard String Klasse sowas wie to Upper und to Lower enthält, was sie mittlerweile"}, {"id": 471, "start": 3057.74, "end": 3064.62, "text": "macht, aber viele andere Sachen nicht oder sowas wie Trim oder Partition oder Replace,"}, {"id": 472, "start": 3064.62, "end": 3072.22, "text": "also im Prinzip alles was irgendwie die C++ Standard String Klasse nicht hat oder dass"}, {"id": 473, "start": 3072.22, "end": 3079.3, "text": "eine Sprache ordentlich Unicode Support hat, was C++ auch nicht wirklich hat, weil der"}, {"id": 474, "start": 3079.3, "end": 3084.5, "text": "String immer noch ein ahnungsloses Byte Array unter der Haube ist, was auch immer, zumindest"}, {"id": 475, "start": 3084.5, "end": 3091.86, "text": "das finde ich bei der Programmiersprache wichtig und dass eben die Sachen die mitgeliefert"}, {"id": 476, "start": 3091.86, "end": 3096.5, "text": "werden auch sinnvoll zu verwenden sind, ich meine ich zeige euch jetzt mal ein schönes"}, {"id": 477, "start": 3096.5, "end": 3111.62, "text": "Beispiel, ein unschönes Beispiel, hoffe da ist gleich ein ekliges Beispiel drinne, ne"}, {"id": 478, "start": 3111.62, "end": 3120.66, "text": "natürlich nicht, aber es wird schon eklig ja, ich meine das geht noch, das geht noch,"}, {"id": 479, "start": 3120.66, "end": 3147.62, "text": "hier fängt es schon an ja, also wenn du dir sowas hier anguckst, ja ich meine sie haben"}, {"id": 480, "start": 3147.62, "end": 3157.7, "text": "sich Mühe gegeben dass es irgendwie nur halbwegs lesbar hier ist, also C++ ist wirklich Beispiel"}, {"id": 481, "start": 3157.7, "end": 3172.18, "text": "für wie es unschön ist, also das wäre so das was mir spontan einfällt und ansonsten"}, {"id": 482, "start": 3172.18, "end": 3178.18, "text": "ob etwas eher in die funktionale Richtung geht, weil es gerade jemand geschrieben hat"}, {"id": 483, "start": 3178.18, "end": 3183.94, "text": "oder ob das klassisch objektorientiert ist oder was gibt es, was gibt es da sonst noch"}, {"id": 484, "start": 3183.94, "end": 3187.3, "text": "alles prozedural und sonst wobei das sind es ja alle in irgendeiner gewissen Art und"}, {"id": 485, "start": 3187.3, "end": 3193.54, "text": "Weise, ist doch eigentlich erstmal zweitrangig, das muss dir halt irgendwie zusagen und für"}, {"id": 486, "start": 3193.54, "end": 3197.46, "text": "den jeweiligen Anwendungszweck passen, daran kannst du jetzt nicht sagen ob es eine gute"}, {"id": 487, "start": 3197.46, "end": 3205.78, "text": "oder eine schlechte Sprache ist, das würde ich sagen das fällt schon eher in Richtung"}, {"id": 488, "start": 3205.78, "end": 3211.78, "text": "Geschmackssache und ob es eben für das Problem passt, aber so Sachen wie das der Sprache"}, {"id": 489, "start": 3211.78, "end": 3217.62, "text": "nicht inkonsistent sein soll ja, also beispielsweise bei Schleifen, Leerzeichen und bei Ifs Klammern"}, {"id": 490, "start": 3217.62, "end": 3219.94, "text": "verwenden soll, ich glaube da können sich alle drauf einigen."}, {"id": 491, "start": 3219.94, "end": 3233.54, "text": "Was sagst du zu Xen, das ist auch nicht übel, hat die letzten Jahre über ein bisschen an"}, {"id": 492, "start": 3233.54, "end": 3252.42, "text": "Handheit eingebüßt, allerdings das ganze Shitrix Zeugs basiert ja immer noch auf Xen,"}, {"id": 493, "start": 3252.42, "end": 3267.46, "text": "keine Ahnung, ja das ist auch schon richtig cringe, aber es gibt ja mittlerweile was besseres,"}, {"id": 494, "start": 3267.46, "end": 3272.38, "text": "es gibt ja auch eine ordentliche Format API mittlerweile in C++, alles problemlos, das"}, {"id": 495, "start": 3272.38, "end": 3278.0, "text": "hat glaube ich noch kein Compiler implementiert, das ist auch ein richtig kompletter Müll"}, {"id": 496, "start": 3278.0, "end": 3285.02, "text": "bei C++, dass es keine richtige offizielle Referenzimplementierung gibt, ich verstehe"}, {"id": 497, "start": 3285.02, "end": 3290.06, "text": "schon warum, den Scheiß will keiner implementieren den die sich ausdenken, aber Leute ich wette"}, {"id": 498, "start": 3290.06, "end": 3296.1, "text": "mit euch gebe es eine offizielle Referenzimplementierung von C++, das Gremium würde nicht so ein Bullshit"}, {"id": 499, "start": 3296.1, "end": 3303.06, "text": "sich ausdenken wie sie sich jetzt ausdenken, weil sie den Kram selbst implementieren müssen,"}, {"id": 500, "start": 3303.06, "end": 3307.5, "text": "aktuell denken die sich irgendwas absolut unpraktikables aus und sagen dann ja ja Compiler"}, {"id": 501, "start": 3307.5, "end": 3311.42, "text": "Hersteller bau das mal irgendwie ein, zumal wenn der sagen muss in diesem Gremium sitzen"}, {"id": 502, "start": 3311.42, "end": 3319.26, "text": "ja die ganzen großen Compiler Leute mit dabei, aber C++ bräuchte wirklich mal eine offizielle"}, {"id": 503, "start": 3319.26, "end": 3324.18, "text": "Referenzimplementierung um auch an vielen Stellen solche Sachen aus dem Weg zu schaffen"}, {"id": 504, "start": 3324.18, "end": 3328.62, "text": "wie das irgendwas undefined ist oder so, dann ist es halt vielleicht im Standard undefined,"}, {"id": 505, "start": 3328.62, "end": 3337.34, "text": "aber alle orientieren sich dran wie sich die Referenzimplementierung verhält, ja aber so"}, {"id": 506, "start": 3337.34, "end": 3342.4, "text": "was gibt es nicht und aus diesem und ähnlichen Gründen wie das C++ immer noch gerne mit"}, {"id": 507, "start": 3342.4, "end": 3348.1, "text": "Header um sich schmeißt, weil immer noch keiner Module verwendet bzw. gar Modul Support implementiert"}, {"id": 508, "start": 3348.1, "end": 3353.26, "text": "hat, wird es auch nie so was geben wie den ordentlichen Package Manager für C++, es wird"}, {"id": 509, "start": 3353.26, "end": 3356.14, "text": "einfach auf alle Zeit kacke sein."}, {"id": 510, "start": 3356.14, "end": 3361.46, "text": "Wie gut beherrschst du C-Sharp von 1 bis 10?"}, {"id": 511, "start": 3361.46, "end": 3371.58, "text": "Na ich will mich da jetzt nicht übertrieben loben, ich würd mal sagen 7, ich würd mal"}, {"id": 512, "start": 3371.58, "end": 3378.34, "text": "sagen 7, also ich kann alles in C-Sharp machen was ich machen will bzw. ich kann alles umsetzen"}, {"id": 513, "start": 3378.34, "end": 3385.42, "text": "was du in der Sprache halt so umsetzen kannst und was nahezu alles ist, aber natürlich"}, {"id": 514, "start": 3385.42, "end": 3395.94, "text": "hast du immer noch nach oben, also hast du immer noch Luft nach oben, also ich würde"}, {"id": 515, "start": 3395.94, "end": 3400.02, "text": "schon sagen, dass ich es an sich sehr gut kann, aber es gibt gerade, die haben mir die"}, {"id": 516, "start": 3400.02, "end": 3405.82, "text": "letzten paar Jahre über viel neues eingeführt, da fällt es mir manchmal immer noch schwer"}, {"id": 517, "start": 3405.82, "end": 3410.06, "text": "Anwendungszwecke zu finden, zum Beispiel wusste dir, dass man in C-Sharp mittlerweile"}, {"id": 518, "start": 3410.06, "end": 3419.14, "text": "schreiben kann, keine Ahnung, war, äh was mach ich denn, ja war, blub, irgendwie so oder"}, {"id": 519, "start": 3419.14, "end": 3427.18, "text": "ne, sag mal anders, sag mal anders, wusste dir, dass man mittlerweile so was hier schreiben"}, {"id": 520, "start": 3427.18, "end": 3437.46, "text": "kann in C-Sharp, if, wusste dir, dass das geht mittlerweile, das ist so ein Ding, das"}, {"id": 521, "start": 3437.46, "end": 3440.78, "text": "konntest du früher gar nicht machen und mittlerweile, ich glaube es hat zwei Sprachversionen oder"}, {"id": 522, "start": 3440.78, "end": 3445.54, "text": "geht das und ich merke immer noch, dass ich das, dass ich null checke und if checke, dass"}, {"id": 523, "start": 3445.54, "end": 3453.18, "text": "ich das viel zu umständlich mache, ich schreibe instinktiv sowas hier noch, wenn, wenn, also"}, {"id": 524, "start": 3453.18, "end": 3466.22, "text": "die oldschool, die oldschool Variante war, so zu checken, äh oder end, was weiß ich,"}, {"id": 525, "start": 3466.22, "end": 3474.54, "text": "oder, äh was weiß ich, irgendwie sowas, ja, irgendwie sowas hättest du früher, wobei"}, {"id": 526, "start": 3474.54, "end": 3487.14, "text": "das eigentlich keinen Sinn ergibt, so, ähm was du dann nachmachen konntest, ist, du konntest"}, {"id": 527, "start": 3487.14, "end": 3494.58, "text": "quasi sagen, äh is int zahl, wir machen das jetzt mal auf Deutsch, ne, das konntest du"}, {"id": 528, "start": 3494.58, "end": 3500.3, "text": "auch machen in der Zwischenzeit, aber sich an sowas zu gewöhnen, ähm, mach ich manchmal"}, {"id": 529, "start": 3500.3, "end": 3505.94, "text": "noch nicht so, wie man es vielleicht machen sollte, ist aber Gewöhnungssache, ja, deswegen"}, {"id": 530, "start": 3505.94, "end": 3511.7, "text": "würde ich jetzt allerdings, würde ich sagen sieben, zehn sind für mich die Leute, die"}, {"id": 531, "start": 3511.7, "end": 3516.34, "text": "an der Sprache selbst mitarbeiten, oder die dort Performanceoptimierung intern machen,"}, {"id": 532, "start": 3516.34, "end": 3522.3, "text": "da wirst du außer Microsoft Leute oder vielleicht John Skeet himself, ja, keinen finden und"}, {"id": 533, "start": 3522.3, "end": 3531.9, "text": "acht und neun sind halt wirklich die Experten, deswegen würde ich halt sagen sieben, aber"}, {"id": 534, "start": 3531.9, "end": 3535.62, "text": "wahrscheinlich ist es sogar zu niedrig, weil heutzutage ist ja der Trend hin, dass sich"}, {"id": 535, "start": 3535.62, "end": 3540.98, "text": "da jeder, ist aber übergebührend lobt, weil es sich einfach gut anhört und gut macht,"}, {"id": 536, "start": 3540.98, "end": 3545.3, "text": "heute hast du ja auch Leute, die mal Ubuntu in der VM installiert haben, haben jahrelange"}, {"id": 537, "start": 3545.3, "end": 3552.86, "text": "Linuxerfahrung, dann müsste ich sagen neuneinhalb oder so, weil zehn ist dann doch zu viel das"}, {"id": 538, "start": 3552.86, "end": 3556.34, "text": "Selbstgelobe, aber ich würde sagen, wenn man es mal ein bisschen bescheiden sieht, würde"}, {"id": 539, "start": 3556.34, "end": 3561.78, "text": "ich mal sagen eher sieben, aber auf dem Stand kann man alles umsetzen, was man umsetzen"}, {"id": 540, "start": 3561.78, "end": 3579.74, "text": "will, AWS nutzt auch KVM oder Xen, ja was denn jetzt, Xen, ja aber die benutzen glaube"}, {"id": 541, "start": 3579.74, "end": 3590.02, "text": "auch KVM, und wisst ihr was, ich hab letztens ne Linux VM in Azure installiert und hab festgestellt,"}, {"id": 542, "start": 3590.02, "end": 3602.94, "text": "das ist wohl anscheinend wirklich Hyper-V unten drunter, also Microsoft meins Ernst,"}, {"id": 543, "start": 3602.94, "end": 3614.46, "text": "was sagst du zu Tools wie WinPE, ist WinPE nicht dieses Minimal, dieses Minimal Boot"}, {"id": 544, "start": 3614.46, "end": 3626.9, "text": "Windows und Windows zu reparieren, ja genau, wer sehr gay Drissleck ist, weiß ich nicht,"}, {"id": 545, "start": 3626.9, "end": 3634.54, "text": "wahrscheinlich der WinPE Erfinder, hast du mal Lust was mit Kubernetes zu machen, ja"}, {"id": 546, "start": 3634.54, "end": 3638.46, "text": "hab ich, aber da bin ich nicht so der Pro, das heißt da müssen wir uns ein bisschen"}, {"id": 547, "start": 3638.46, "end": 3643.18, "text": "durchwurschteln hier, Module in C++, ja gibt's ja mittlerweile, keiner verwendet's, keiner"}, {"id": 548, "start": 3643.18, "end": 3647.74, "text": "unterstützt so richtig, und bis dieses ganze Hedder-File-Gewirr vorbei ist, da vergehen"}, {"id": 549, "start": 3647.74, "end": 3662.1, "text": "noch Jahrzehnte, ich predicte ja das wird nie so sein, ja, also der beste Experte, da"}, {"id": 550, "start": 3662.1, "end": 3673.14, "text": "muss ich tatsächlich mal ein Video zu machen, der beste Typ war immer noch der Mathe Profi"}, {"id": 551, "start": 3673.14, "end": 3678.74, "text": "der sich bei uns mal beworben hat und erzählt hat über was für mathematisch hochkomplexe"}, {"id": 552, "start": 3678.74, "end": 3683.74, "text": "Systeme er seine Abschlussarbeit, seine Doktorarbeit oder was auch immer geschrieben hat, ne nicht"}, {"id": 553, "start": 3683.74, "end": 3687.34, "text": "seine Doktorarbeit, seine Masterarbeit oder was auch immer, irgendwie so super komplexe"}, {"id": 554, "start": 3687.34, "end": 3692.5, "text": "mathematischen Sachen und da wurde er von einem der Leute bei uns gefragt um was es da genau"}, {"id": 555, "start": 3692.5, "end": 3695.34, "text": "ging und er konnte halt überhaupt nicht drauf antworten, also er hat irgendeinen Bullshit"}, {"id": 556, "start": 3695.34, "end": 3703.26, "text": "erzählt, da gibt's ganz viele Chebader und viele Chebader kommen im Prinzip auch damit"}, {"id": 557, "start": 3703.26, "end": 3715.14, "text": "durch, weil die Leute keinen Plan haben und sich einfach Chebaten lassen, K8S ist easy,"}, {"id": 558, "start": 3715.14, "end": 3718.94, "text": "das ist wahrscheinlich easy bis zu dem Zeitpunkt wo was nicht funktioniert und du rausfinden"}, {"id": 559, "start": 3718.94, "end": 3724.98, "text": "musst warum was nicht funktioniert oder die 3000 Zusatzprodukte die du verwenden musst"}, {"id": 560, "start": 3724.98, "end": 3733.82, "text": "bzw. verwendest mit der Zeit von Load Balancer bis Proxys bis Secrets Management bis Certificates"}, {"id": 561, "start": 3733.82, "end": 3738.54, "text": "Management bis Dashboarding bis sonst was, dann hast du da noch mal 3000 Container laufen"}, {"id": 562, "start": 3738.54, "end": 3752.98, "text": "um deine 5 produktiven Container zum laufen zu bringen, so 150 Euro nass, da bin ich ja"}, {"id": 563, "start": 3752.98, "end": 3758.94, "text": "mal gespannt, das habe ich mich ja vor ein paar Jahren auch mal dran versucht ein Low"}, {"id": 564, "start": 3758.94, "end": 3763.86, "text": "Budget 10 Gigabit nass zu bauen, mal gucken ob das mittlerweile besser geworden ist, das"}, {"id": 565, "start": 3763.86, "end": 3767.86, "text": "gucken wir uns jetzt gleich an, ich skippe da ein bisschen, weil das meiste ist nicht"}, {"id": 566, "start": 3767.86, "end": 3775.74, "text": "so, nicht so, das hat gestern jemand erzählt, das gucken wir jetzt mal, ich skippe da ein"}, {"id": 567, "start": 3775.74, "end": 3781.98, "text": "bisschen, weil 17 Minuten sind mitzuladen, ich finde das immer geil wie alle noch nass"}, {"id": 568, "start": 3781.98, "end": 3785.5, "text": "irgendwie aussprechen müssen, so nach dem Motto, als wüsste mittlerweile keiner was"}, {"id": 569, "start": 3785.5, "end": 3794.94, "text": "nass, als wüsste mittlerweile niemand mehr was nass heißt, hat doch jeder schon 50 mal"}, {"id": 570, "start": 3794.94, "end": 3801.1, "text": "gehört, also heute kannst du auch keinem hinter dem Ofen mit davor loggen, dass du"}, {"id": 571, "start": 3801.1, "end": 3805.02, "text": "krasse Experte bist wenn du weißt was nass ausgeschrieben ist, ich meine jetzt nicht"}, {"id": 572, "start": 3805.02, "end": 3809.54, "text": "ihn persönlich, was nass ausgeschrieben ist, das ist genauso wie die Leute die dir heute"}, {"id": 573, "start": 3809.54, "end": 3816.98, "text": "erzählen, wusstet ihr eigentlich, dass Super Mario 2 gar nicht Super Mario 2 war, dann"}, {"id": 574, "start": 3816.98, "end": 3822.74, "text": "denke ich mir auch immer, ja das weiß ich seit 15 Jahren oder so, damals konntest du"}, {"id": 575, "start": 3822.74, "end": 3827.78, "text": "noch Leute damit überraschen wenn du das denen erzählt hast, heute weiß das eigentlich"}, {"id": 576, "start": 3827.78, "end": 3833.62, "text": "jeder außer Leute die das letztens irgendwie als Letzte erfahren haben und jetzt denken"}, {"id": 577, "start": 3833.62, "end": 3844.58, "text": "ich muss es der Welt mitteilen, so gucken wir uns mal an, was gibt es hier, ok da schlaf"}, {"id": 578, "start": 3844.58, "end": 3851.3, "text": "ich schon mal ein, weil das muss ich mal vorspulen, also Components, ok geht schon mal los, geht"}, {"id": 579, "start": 3851.3, "end": 3855.78, "text": "schon mal los, normales Tower Gehäuse und wahrscheinlich keine Möglichkeit die Festplatten"}, {"id": 580, "start": 3855.78, "end": 3861.66, "text": "ordentlich rein und raus zu ziehen, außer das Gehäuse komplett auszuschalten, aufzumachen"}, {"id": 581, "start": 3861.66, "end": 3866.06, "text": "und die Platte rauszusuchen, das ist das was ich bei einem Nass als eines der allerwichtigsten"}, {"id": 582, "start": 3866.06, "end": 3871.66, "text": "Sachen erachte, dass du Festplatten einfach ohne großartiges schrauben und bauen und tun"}, {"id": 583, "start": 3871.66, "end": 3872.66, "text": "wechseln kannst."}, {"id": 584, "start": 3872.66, "end": 3894.66, "text": "Ja gut, es ist halt ein altes Desktop Gehäuse, warum sollte das auch Compact sein, wass"}, {"id": 585, "start": 3894.66, "end": 3900.66, "text": "letzte Preis, ok weiter, weiter, jaja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja,"}, {"id": 586, "start": 3900.66, "end": 3926.58, "text": "ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, nicht sådan,"}, {"id": 587, "start": 3926.58, "end": 3934.54, "text": "das verbreitete aber ich habe das gefühl das sind das liegt an verschiedenen ländern und an"}, {"id": 588, "start": 3934.54, "end": 3941.94, "text": "verschiedenen regionen gibt es da irgendwie so eine so eine faustregel dass du sagen kannst keine"}, {"id": 589, "start": 3941.94, "end": 3949.86, "text": "ahnung die was weiß ich die die schotten sagen alle motherboards und die die california sagen"}, {"id": 590, "start": 3949.86, "end": 3960.18, "text": "alle mainboard oder so gibt es ein ich benutze beide ich sag nur mainboard in russland ist es"}, {"id": 591, "start": 3960.18, "end": 3965.1, "text": "garantiert mutterbord ja garantiert oder das ist das entsprechende auf russisch"}, {"id": 592, "start": 3968.26, "end": 3973.14, "text": "hat was mit dem alter zu tun also der typ ist nicht sonderlich alt gehe ich mal von aus"}, {"id": 593, "start": 3973.14, "end": 3980.34, "text": "ich glaube nicht dass die jüngeren motherboard sagen die werden die werden auch mainboard sagen"}, {"id": 594, "start": 3983.94, "end": 3990.54, "text": "egal was mal schauen was dann auch einer drin ist oh guck mal ganze zwei sata anschlüsse für"}, {"id": 595, "start": 3990.54, "end": 4002.3, "text": "eine nass nicht schlecht aber gut ich meine der kann der kann er hier noch was rein machen"}, {"id": 596, "start": 4002.3, "end": 4008.34, "text": "der kann er dann irgendwann pizzi express pizzi express die rein machen ja"}, {"id": 597, "start": 4011.14, "end": 4014.7, "text": "sagt mal leute ist das da unten"}, {"id": 598, "start": 4014.7, "end": 4027.94, "text": "ist das ein pizzi anschluss ja das ist ein pizzi anschluss pizzi express hat hier oben den kleinen"}, {"id": 599, "start": 4027.94, "end": 4042.26, "text": "hier alter monka es pizzi was hat er da ausgebuddelt in 2022 wo findest du denn heute noch ein"}, {"id": 600, "start": 4042.26, "end": 4050.42, "text": "mainboard was in irgendeiner art und weise auch nur ansatzweise so was drauf hat wie pizzi"}, {"id": 601, "start": 4050.42, "end": 4069.1, "text": "aber moment der hat schon blaue usb anschlüsse aber noch ein pizzi und vga schockt mich jetzt"}, {"id": 602, "start": 4069.1, "end": 4073.66, "text": "nicht aber was für eine mainboard generation ist das denn"}, {"id": 603, "start": 4073.66, "end": 4090.5, "text": "was ist das was für eine cpu 9 cpu was this motherboard originally came from an"}, {"id": 604, "start": 4090.5, "end": 4101.18, "text": "hp 200 g1 desktop and features a 4 core intel j29 cpu das ist gar nicht mal schlecht das ist ein low power intel board das ist die das ist die"}, {"id": 605, "start": 4101.18, "end": 4108.74, "text": "gleiche die gleiche generation die ich vorher bei mir in dem selbstgebauten selbstgebauten kiste hatte"}, {"id": 606, "start": 4108.74, "end": 4116.98, "text": "eine generation vorher glaub eine generation vorher ist das aber so schlecht ist das gar nicht warum"}, {"id": 607, "start": 4116.98, "end": 4131.74, "text": "hat das mainboard noch pci was ist denn da los ok ich rate mal ich rate jetzt einfach mal kann das sein weil"}, {"id": 608, "start": 4131.74, "end": 4138.78, "text": "das ja von irgend so einem enterprise business ding war dass hier drinnen ein management controller"}, {"id": 609, "start": 4138.78, "end": 4151.38, "text": "war den hp einfach seit 30 jahren immer den gleichen einbaut dass es gar nicht zur normalen"}, {"id": 610, "start": 4151.38, "end": 4181.34, "text": "verwendung gedacht ist also ganz ehrlich sachen über ebay klein anzeigen"}, {"id": 611, "start": 4181.34, "end": 4188.9, "text": "kaufen da kannst du es natürlich schon 150 euro nass nennen aber das ist ja nicht reproduzierbar"}, {"id": 612, "start": 4188.9, "end": 4194.5, "text": "du musst halt glück haben dass es bei ebay klein anzeigen was gibt also realistischer"}, {"id": 613, "start": 4194.5, "end": 4200.04, "text": "wäre es glaube ich eher in 250 euro nass zu bauen und dann zu sagen ja aber man kauft den"}, {"id": 614, "start": 4200.04, "end": 4224.98, "text": "kram neu oder sagt man so zumindest reproduzierbar ja reicht aber das ist nun ein pci express also"}, {"id": 615, "start": 4224.98, "end": 4231.94, "text": "das ist nur ein einfacher pci express und das mainboard ist so alt das ist wahrscheinlich noch"}, {"id": 616, "start": 4231.94, "end": 4241.58, "text": "pci express gen 2 ist das heißt darüber kriegst du auch gar nicht großartig was übertragen aber"}, {"id": 617, "start": 4241.58, "end": 4247.3, "text": "ganz im ernst für performance ist das ähnlich gebaut und wahrscheinlich kommt da auch nicht mehr"}, {"id": 618, "start": 4247.3, "end": 4264.3, "text": "als eine 1 gigabit netzwerkarte rein also ich doch generation 2 pci express also im prinzip gut"}, {"id": 619, "start": 4264.3, "end": 4272.02, "text": "er geht ja auf das ein was ich gesagt habe denn du kannst da auch ohne probleme 5 dran"}, {"id": 620, "start": 4272.02, "end": 4277.82, "text": "attachen das ist gar kein ding ich meine wenn du eh nur gigabyte rausholst am ende übers netzwerk"}, {"id": 621, "start": 4277.82, "end": 4282.86, "text": "dann ist ja auch egal dass das geht auf jeden fall das kriegst du auf jeden fall dicht"}, {"id": 622, "start": 4282.86, "end": 4299.7, "text": "das ist eine gute wahl 2,5 g finde ich gut das problem ist nur dass kaum einer 2,5 g fähige"}, {"id": 623, "start": 4299.7, "end": 4305.62, "text": "netzwerkhardware daheim hat ich glaube oder was heißt ich habe keine ahnung wie es bei euch daheim"}, {"id": 624, "start": 4305.62, "end": 4313.22, "text": "aussieht aber meine einschätzung nach haben die meisten leute entweder gigabit oder wenn die"}, {"id": 625, "start": 4313.22, "end": 4319.62, "text": "so so technologieenthusiasten sind wie ich dann haben die 10 gigabit allerdings auch nicht im"}, {"id": 626, "start": 4319.62, "end": 4326.54, "text": "ganzen haus sondern nur dort wo es sinn macht und so ist es bei mir halt auch ich habe meinen"}, {"id": 627, "start": 4326.54, "end": 4340.54, "text": "desktop mein server das war es reicht ja auch bei 10 gigabit angebunden an einem viel zu teuren"}, {"id": 628, "start": 4340.54, "end": 4349.78, "text": "10 gigabit port switch ich meine ich habe ja einen 12 port sfp plus 4 4 port 10g kupferswitch aber"}, {"id": 629, "start": 4349.78, "end": 4362.42, "text": "ok weil es geht und der rest ist gigabit 2,5 g bringt dir wirklich was erst wenn du 8 port"}, {"id": 630, "start": 4362.42, "end": 4370.66, "text": "2,5 g switcher bekommst für 50 euro auf amazon dann ist es was wir schauen mal kurz das interessiert"}, {"id": 631, "start": 4370.66, "end": 4380.06, "text": "mich jetzt tatsächlich ob es da schon was halbwegs was halbwegs erschwingliches gibt nicht nicht von"}, {"id": 632, "start": 4380.06, "end": 4404.42, "text": "ubiquity will ich gar nicht gucken ja so switches 2,5 5g gibt es kaum das was wie ab und dann gibt es 10g"}, {"id": 633, "start": 4404.42, "end": 4420.26, "text": "das ist doch kein switch es ist ein poe injector doch was ganz was anderes hier ein edi max"}, {"id": 634, "start": 4420.26, "end": 4437.46, "text": "edi max hatte jemals einer schon ein edi max switch ich kenne den hersteller überhaupt nicht edi max aber"}, {"id": 635, "start": 4437.46, "end": 4449.48, "text": "ok ganz ehrlich hier bewegen wir uns in einem erschwinglichen rahmen ja das ist ok das ist in"}, {"id": 636, "start": 4449.48, "end": 4457.78, "text": "ordnung tp link das ist ok kann man sich kaufen ganz im ernst ich glaube wir nähern uns dem punkt"}, {"id": 637, "start": 4457.78, "end": 4467.3, "text": "dass 2,5 g mainstream wird also wenn das noch ein bisschen im preis fällt und man vielleicht"}, {"id": 638, "start": 4467.3, "end": 4472.62, "text": "acht port switcher bekommt für so was hier dann gehe ich mal von aus dann wird sich das über"}, {"id": 639, "start": 4472.62, "end": 4483.5, "text": "kurz oder lang auch durchsetzen ja das finde ich das finde ich in ordnung hier das ist nicht nicht"}, {"id": 640, "start": 4483.5, "end": 4496.62, "text": "verkehrt ok weiter ja ja bei den mainboards ist schon klar aber das bringt ja nichts wenn"}, {"id": 641, "start": 4496.62, "end": 4500.82, "text": "du es auf mainboard hast du musst ja irgendwie in der in der netzwerk kommen und 99 prozent der"}, {"id": 642, "start": 4500.82, "end": 4505.38, "text": "leute haben daheim ein gigabit switch stehen oder aber wenn sie so verrückt sind wie ich schon"}, {"id": 643, "start": 4505.38, "end": 4518.7, "text": "seit ein paar jahren 10 gigabit die übrigens auch 2,5 können ist korrekt die haben schrotz"}, {"id": 644, "start": 4518.7, "end": 4524.46, "text": "stehen ja deswegen sage ich ja das muss noch billiger werden also ich denke mal wenn du für"}, {"id": 645, "start": 4524.46, "end": 4530.42, "text": "50 euro schon 5 bis 8 port switch bekommst dann also ich denke wir sind noch nicht weit davon"}, {"id": 646, "start": 4530.42, "end": 4536.5, "text": "entfernt die nächsten paar jahre wird es denke ich was 2,5 angeht langsam aber sicher dann Richtung"}, {"id": 647, "start": 4536.5, "end": 4541.3, "text": "mainstream gehen es wird natürlich noch eine ganze weile dauern bis die großteil der leute"}, {"id": 648, "start": 4541.3, "end": 4557.3, "text": "daheim 2,5 g haben aber insgesamt finde ich auch mal gut also das würde ich nicht machen"}, {"id": 649, "start": 4557.3, "end": 4562.18, "text": "eine zweite netzwerkverbindung das würde ich nicht machen dann würde ich lieber in den"}, {"id": 650, "start": 4562.18, "end": 4569.74, "text": "sauren apfel beißen und mir jetzt für 150 euro in acht port in acht port 2,5 g switch"}, {"id": 651, "start": 4569.74, "end": 4576.98, "text": "kaufen bevor ich mit zwei netzwerkkarten rum hantiere was man sich überlegen könnte was"}, {"id": 652, "start": 4576.98, "end": 4581.82, "text": "ich eigentlich von der idee ganz gut finde ist dass man das gigabit interface als ich"}, {"id": 653, "start": 4581.82, "end": 4590.58, "text": "netzbar management interface verwendet und das hier als dateninterface das hat jetzt"}, {"id": 654, "start": 4590.58, "end": 4597.5, "text": "nicht wirklich so wie soll ich sagen keine handfesten vorteile weil es kann das eine"}, {"id": 655, "start": 4597.5, "end": 4602.86, "text": "oder das andere kaputt gehen und das 2,5 g kann das auch aber es hat den vorteil wenn"}, {"id": 656, "start": 4602.86, "end": 4609.06, "text": "du irgendwelche firewall regel machst oder irgendwelche konfigurationsänderungen machst"}, {"id": 657, "start": 4609.06, "end": 4613.5, "text": "und sonst wie dann ist die chance dass du dich vom management interface aussperrst bei"}, {"id": 658, "start": 4613.5, "end": 4618.66, "text": "diesem ding geringer und wenn man eh zwei netzwerkkarten hat denke ich kann man sich"}, {"id": 659, "start": 4618.66, "end": 4626.18, "text": "das überlegen es ist natürlich kein management interface wie on board wo du dann theoretisch"}, {"id": 660, "start": 4626.18, "end": 4633.18, "text": "auch ins bios kannst aber wenn man zwei netzwerkkarten hat kann man sich das überlegen gerade wenn"}, {"id": 661, "start": 4633.18, "end": 4638.5, "text": "man anfängt mit virtualisierung auf dieser kiste ist es tatsächlich gar nicht so doof"}, {"id": 662, "start": 4638.5, "end": 4643.1, "text": "zu sagen ich nehme jetzt eine netzwerkkarte und reicht die mal komplett in die vm durch"}, {"id": 663, "start": 4643.1, "end": 4650.62, "text": "wenn man zum beispiel darauf noch seine heimautomatisierung laufen lassen möchte wie das ist waste warum"}, {"id": 664, "start": 4650.62, "end": 4655.9, "text": "ist das waste der hat die interfaces doch eh warum soll er sie nicht benutzen ich würde"}, {"id": 665, "start": 4655.9, "end": 4659.94, "text": "kein zweites interface einbauen dafür aber wenn er sie eh hat kann er sie auch dafür"}, {"id": 666, "start": 4659.94, "end": 4665.86, "text": "benutzen wenn er zum beispiel noch seine heimautomatisierung laufen lassen will da drauf als vm dann wäre"}, {"id": 667, "start": 4665.86, "end": 4671.1, "text": "es vielleicht gar keine schlechte idee die gigabit netzwerkkarte in die vm durch zu reichen"}, {"id": 668, "start": 4671.1, "end": 4675.46, "text": "und die exklusiv dafür zu verwenden da kannst du das mehr als eigen eigenständige kiste"}, {"id": 669, "start": 4675.46, "end": 4686.54, "text": "sehen auf sehe ich geschmackssache mit 150 euro kommt er nicht mit storage dahin"}, {"id": 670, "start": 4686.54, "end": 4705.5, "text": "hat es so stor also stor irgendwas mit asus zu tun oder oder haben die das nur im im namen"}, {"id": 671, "start": 4705.5, "end": 4722.9, "text": "tatsächlich die haben was mit asus zu tun"}, {"id": 672, "start": 4722.9, "end": 4728.06, "text": "moment erstellt ein fertiges nass vor in dem video wo er selbst nass baut gut wenn"}, {"id": 673, "start": 4728.06, "end": 4735.7, "text": "die damit einverstanden sind ich finde ganz ehrlich also stor sollte mir auch mal die"}, {"id": 674, "start": 4735.7, "end": 4739.7, "text": "neuen acht terabyte oder 14 terabyte platten von ihnen schicken da mache ich auch ein video"}, {"id": 675, "start": 4739.7, "end": 4751.06, "text": "darüber wir gucken uns im stream sogar ihr neues nass an"}, {"id": 676, "start": 4751.06, "end": 4760.02, "text": "bei der gelegenheit sekunde ich muss gerade noch mal wieder in meine angebote gucken sekunde"}, {"id": 677, "start": 4760.02, "end": 4784.26, "text": "was habe ich denn wieder für für anfragen bekommen die woche hat mir irgendeine mail"}, {"id": 678, "start": 4784.26, "end": 4794.5, "text": "dabei so was haben wir denn hier zu bieten world class vpn vpn was world class vpn client"}, {"id": 679, "start": 4794.5, "end": 4803.5, "text": "youtube sponsorship wer ist es denn diesmal nord vpn steht gar nicht dabei ist ja auch"}, {"id": 680, "start": 4803.5, "end": 4811.22, "text": "geil steht überhaupt nicht dabei da steht einfach nur youtube sponsorship world class"}, {"id": 681, "start": 4811.22, "end": 4818.82, "text": "vpn client oder steht nicht dabei welcher ja super da weißt du weißt du bescheid was"}, {"id": 682, "start": 4818.82, "end": 4836.58, "text": "haben wir denn sonst noch attention youtube sponsor opportunity hello world was was leute"}, {"id": 683, "start": 4836.58, "end": 4842.42, "text": "ich check die anfragen doch nicht mal was wollt ihr überhaupt von mir china chinesen"}, {"id": 684, "start": 4842.42, "end": 4848.22, "text": "zeug ist es aus singapur ok ich habe keine ahnung was die leute ich habe legit kein"}, {"id": 685, "start": 4848.22, "end": 4871.58, "text": "platzen schimmer was die von mir wollen ok das natürliche anfragen ist komplett unsinnig"}, {"id": 686, "start": 4871.58, "end": 4878.46, "text": "meine güte ist wieder so viel schrott dabei also das mache ich alles nicht ok weiter"}, {"id": 687, "start": 4878.46, "end": 4885.18, "text": "vielleicht heißen die world class vpn ganz im ernst nachdem das irgendein china chinesen"}, {"id": 688, "start": 4885.18, "end": 4894.86, "text": "zeug ist könnte ich mir sogar vorstellen dass die world class vpn heißen ne ne heißen sie"}, {"id": 689, "start": 4894.86, "end": 4906.5, "text": "nicht findet man zumindest nix so"}, {"id": 690, "start": 4906.5, "end": 4911.18, "text": "thanks to our newborn child but i got things mixed up while also working on my previous"}, {"id": 691, "start": 4911.18, "end": 4918.7, "text": "unraid video with unraid was hat sein kind mit dem lass jetzt zu tun das habe ich jetzt"}, {"id": 692, "start": 4918.7, "end": 4923.1, "text": "nicht gecheckt 100 prozent recommended to use a single usb stick as the boot drive which"}, {"id": 693, "start": 4923.1, "end": 4926.82, "text": "is what i filmed when making this video ja gut es schreibt unraid unraid schreibt das"}, {"id": 694, "start": 4926.82, "end": 4932.5, "text": "mit dem usb boot drive doch eigentlich nur damit sie die id locken können und und geld"}, {"id": 695, "start": 4932.5, "end": 4936.82, "text": "verdienen das aus unraid sicht verstehe ich das however true nas which is the os will"}, {"id": 696, "start": 4936.82, "end": 4940.86, "text": "be using ansonsten würde ich mein system nicht von einem usb stick booten sondern einfach"}, {"id": 697, "start": 4940.86, "end": 4948.14, "text": "von der ssd usb stick booten geht nur so lange gut wie das system ansonsten komplett aus"}, {"id": 698, "start": 4948.14, "end": 4969.14, "text": "dem rammen läuft ansonsten ist usb stick booten doof"}, {"id": 699, "start": 4969.14, "end": 4978.66, "text": "usb rate eins leute ich gebe zu sowas habe ich auch schon mal gemacht ich würde ich"}, {"id": 700, "start": 4978.66, "end": 4986.78, "text": "würde es wahrscheinlich nicht wieder machen"}, {"id": 701, "start": 4986.78, "end": 4991.22, "text": "wisst ihr wisst ihr was ich auch schon immer mal machen wollte einfach weil es geht ein"}, {"id": 702, "start": 4991.22, "end": 5002.14, "text": "micro sd karten rate 6 einfach nur mal einrichten ist nicht es wird funktionieren es wird überhaupt"}, {"id": 703, "start": 5002.14, "end": 5006.98, "text": "es wird überhaupt nichts besonderes sein aber einfach nur weil es geht ich will es nicht"}, {"id": 704, "start": 5006.98, "end": 5012.58, "text": "benutzen ich will es einfach nur mal einrichten es ist easy einzurichten es wird funktionieren"}, {"id": 705, "start": 5012.58, "end": 5015.86, "text": "was hatte ich da geritten mit dem usb stick rate einfach dass ich mehr sata anschlüsse"}, {"id": 706, "start": 5015.86, "end": 5027.02, "text": "frei habe kann ich nicht machen weil ich nicht genug usb kartenleser habe dafür für"}, {"id": 707, "start": 5027.02, "end": 5034.34, "text": "den rate 6 brauchst du ja mindestens vier festplatten am besten aber 5 wenn es sinnvoll"}, {"id": 708, "start": 5034.34, "end": 5043.42, "text": "sein soll vier oder fünf da bräuchte ich quasi noch noch ein paar kartenleser dafür"}, {"id": 709, "start": 5043.42, "end": 5049.62, "text": "ich meine das ist dann auch abgedreht guckt mal usb auf mikro sd und dann da riefer 5"}, {"id": 710, "start": 5049.62, "end": 5061.5, "text": "rate 6 okay das ist jetzt langweilig da baut es zusammen who cares leute eine sache die"}, {"id": 711, "start": 5061.5, "end": 5066.66, "text": "mir auch aufgefallen ist in letzter zeit weil ich ein paar mal jetzt staubsachen gereinigt"}, {"id": 712, "start": 5066.66, "end": 5074.14, "text": "habe man denkt ein staubsauger müsste doch eigentlich besser sein zum staub entfernen"}, {"id": 713, "start": 5074.14, "end": 5078.62, "text": "weil dann ist das staub gleich weg aber ganz im ernst du kriegst staub in der regel viel"}, {"id": 714, "start": 5078.62, "end": 5087.38, "text": "besser weg mit pusten anstatt mit saugen mit mit mit pusten kriegst du einfach viel mehr"}, {"id": 715, "start": 5087.38, "end": 5106.3, "text": "druck da drauf einfach einfach das ist auch so ein ding ich hab mir so eine druckluft"}, {"id": 716, "start": 5106.3, "end": 5111.46, "text": "so so so eine druckluftflasche gekauft so was hier in der richtung was das alles keck"}, {"id": 717, "start": 5111.46, "end": 5125.38, "text": "tornado ich habe mir so eine flasche gekauft compressed air schon vor einer weile die verwende"}, {"id": 718, "start": 5125.38, "end": 5134.9, "text": "ich ab und zu mal lohnt es sich lohnt es sich ein kompressor zu kaufen gibt es da was gibt"}, {"id": 719, "start": 5134.9, "end": 5143.58, "text": "es da gibt es da was billiges und und das so dinge sehe ich jetzt hier zum ersten mal"}, {"id": 720, "start": 5143.58, "end": 5150.66, "text": "diese dinger sehe ich jetzt hier zum ersten mal taugt das was so was hier das das sieht"}, {"id": 721, "start": 5150.66, "end": 5167.62, "text": "aus wie so eine dröte aber das ist doch die idee luft zu kaufen du kaufst keine luft du"}, {"id": 722, "start": 5167.62, "end": 5173.06, "text": "kaufst komprimierte luft das was du bezahlst ist quasi der dink der kompressionsvorgang"}, {"id": 723, "start": 5173.06, "end": 5185.5, "text": "und das verpacken was taugt denn da so als als von diesen geräten ich habe wirklich"}, {"id": 724, "start": 5185.5, "end": 5206.62, "text": "keinen plan davon nach was muss ich ihn da suchen blower gachi bass was xx power x power"}, {"id": 725, "start": 5206.62, "end": 5229.58, "text": "x power multi electric computer dusting clothes dryer air pump air sprayer blower blower vacuum"}, {"id": 726, "start": 5229.58, "end": 5240.18, "text": "cleat ok das widerspricht sich ein blower kann kein vacuum cleaner sein das ergibt absolut"}, {"id": 727, "start": 5240.18, "end": 5246.74, "text": "keinen sinn entweder puste der luft raus oder zieht luft rein in kombination ist das nicht"}, {"id": 728, "start": 5246.74, "end": 5259.38, "text": "möglich das kann ich beides gleichzeitig sein x power das ist quasi das ist quasi"}, {"id": 729, "start": 5259.38, "end": 5281.82, "text": "ein fön ein fön mit einem dünnen aufsatz oder wie aber mit akku x power und wie und"}, {"id": 730, "start": 5281.82, "end": 5294.38, "text": "wie stark puste das so dann gibt es in blau in schwarz in grün schwarz ist aber am billigsten"}, {"id": 731, "start": 5294.38, "end": 5305.74, "text": "aber der aufsatz bleibt weiter in schwarze nein habe ich nicht mitbekommen das habe ich"}, {"id": 732, "start": 5305.74, "end": 5312.5, "text": "nicht mitbekommen der uber hacker hat er noch mehr noch mehr gehackermant wo gibt es das"}, {"id": 733, "start": 5312.5, "end": 5341.78, "text": "zu sehen uber hacker rockstar news gucken wir mal hier was tons of"}, {"id": 734, "start": 5341.78, "end": 5358.62, "text": "90 videos"}, {"id": 735, "start": 5358.62, "end": 5371.78, "text": "aus wie gta 5 weiß man halt nicht weiß man halt nicht weil die entwicklungsstand das"}, {"id": 736, "start": 5371.78, "end": 5382.5, "text": "ist interessant ja hier habe ich nicht mitbekommen 500 watt die schreiben da einfach mal irgendwas"}, {"id": 737, "start": 5382.5, "end": 5388.98, "text": "random dran oder ist das mit akku oder mit kabel leute das ist mit kabel nicht nicht"}, {"id": 738, "start": 5388.98, "end": 5394.46, "text": "mit akku mit akku wäre natürlich auch nicht schlecht muss ich mal überlegen ich finde"}, {"id": 739, "start": 5394.46, "end": 5400.7, "text": "es vom ansatz her eigentlich ganz cool sowas soll wir gucken jetzt mal das video fertig"}, {"id": 740, "start": 5400.7, "end": 5406.06, "text": "ja guck mal leute wir sind zwei eineinhalb stunden dabei und ich habe jetzt fünf minuten"}, {"id": 741, "start": 5406.06, "end": 5416.34, "text": "video geguckt eine halbe stunde keck weiter er kompressor er baut zusammen das ist guckt"}, {"id": 742, "start": 5416.34, "end": 5420.46, "text": "das ist eines der gründe warum ich ein nass in einem normalen gehäuse für blödsinn"}, {"id": 743, "start": 5420.46, "end": 5424.66, "text": "ich halte du hast festplatten die sind sogar festgeschraubt wenn der glück hast kannst"}, {"id": 744, "start": 5424.66, "end": 5431.38, "text": "es so rausziehen du musst jedes mal wenn in der festplatte verreckt das ding komplett"}, {"id": 745, "start": 5431.38, "end": 5437.3, "text": "vom strom machen rausziehen aufschrauben rausschrauben erst mal erkennen welche platte kaputt ist"}, {"id": 746, "start": 5437.3, "end": 5440.94, "text": "das heißt du musst dir auf jeden fall die seriennummer hin mit dem editing drauf schreiben"}, {"id": 747, "start": 5440.94, "end": 5447.1, "text": "die letzten paar stellen das deswegen das ist das ist in der handhabung eklig wie oft"}, {"id": 748, "start": 5447.1, "end": 5451.66, "text": "passiert das naja je nachdem wie viel platten du hast paar vier platten kann dir das schon"}, {"id": 749, "start": 5451.66, "end": 5459.58, "text": "mal passieren und selbst wenn es nur einmal alle was weiß ich einmal in drei jahren vorkommt"}, {"id": 750, "start": 5459.58, "end": 5464.14, "text": "oder so glaube ich das geht dir schon auf den sack genug wenn du dann das ding rausbauen"}, {"id": 751, "start": 5464.14, "end": 5473.78, "text": "musst wo es steht aufmachen muss aufschrauben muss ausmachen muss weil was bringt den rate"}, {"id": 752, "start": 5473.78, "end": 5479.18, "text": "wenn du die platte nicht wechseln kannst im laufenden betrieb du musst ja doch ausschalten"}, {"id": 753, "start": 5479.18, "end": 5487.54, "text": "wir sind auch schon neue platten verreckt wir reden hier nicht von irgendwelchen enterprise"}, {"id": 754, "start": 5487.54, "end": 5494.26, "text": "ringern wenn man nichts anderes hat als das gehäuse ja dann kann man das natürlich machen"}, {"id": 755, "start": 5494.26, "end": 5498.54, "text": "aber wenn man eh 150 euro ausgibt beziehungsweise geld ausgibt dann kann man sich auch irgendwas"}, {"id": 756, "start": 5498.54, "end": 5504.3, "text": "kaufen was besser für diese anwendung zweck geeignet ist das sind das sind nee das sind"}, {"id": 757, "start": 5504.3, "end": 5512.34, "text": "gar keine billigplatten das sind ganz brauchbare platten ja aber man müsste mal gucken was"}, {"id": 758, "start": 5512.34, "end": 5517.14, "text": "die für eine fehlerrate haben also bei vier platten wird jetzt nicht so häufig was kaputt"}, {"id": 759, "start": 5517.14, "end": 5521.62, "text": "gehen aber ich kann euch aus eigener erfahrung sagen ich hatte ja vor jahren mal ein selbst"}, {"id": 760, "start": 5521.62, "end": 5531.98, "text": "gebautes rate sechs mit damals glaube acht platten also doppelt so viel das waren damals"}, {"id": 761, "start": 5531.98, "end": 5541.74, "text": "noch zwei terabyte platten das ist schon eine ganze weile her und da ging öfters mal was"}, {"id": 762, "start": 5541.74, "end": 5551.3, "text": "kaputt also öfters da reden wir so in was weiß ich so ja ab und zu war es auch mal öfters"}, {"id": 763, "start": 5551.3, "end": 5558.46, "text": "ich würde sagen so im durchschnitt war da irgendwie so alle drei viertel ja oder so"}, {"id": 764, "start": 5558.46, "end": 5563.1, "text": "so alle alle zehn monate oder so war da mal irgendwas und sei es nur dass irgendeiner"}, {"id": 765, "start": 5563.1, "end": 5567.22, "text": "aus dem rate rausgeflogen ist weil sie der meinung war er hatte hatten fehler was meistens"}, {"id": 766, "start": 5567.22, "end": 5576.06, "text": "ja schon als anzeichen dafür sind dass sie bald den geist aufgibt also das war nicht"}, {"id": 767, "start": 5576.06, "end": 5581.38, "text": "nicht schön vielleicht ist es mit den platten ja anders aber trotzdem allein schon wenn"}, {"id": 768, "start": 5581.38, "end": 5585.06, "text": "man das aufschrauben muss abmachen muss ausschalten muss zum wechseln ist schon ist schon nicht"}, {"id": 769, "start": 5585.06, "end": 5590.06, "text": "schön weil man eh geld ausgibt kann man sich kann man sich auch was ordentliches kaufen"}, {"id": 770, "start": 5590.06, "end": 5597.78, "text": "so weiter ist ja schon das installation muss man sich angucken audio naja wie soll es performen"}, {"id": 771, "start": 5597.78, "end": 5605.14, "text": "gigabit kriegst du voll ohne frage gigabit zu saturaten ist wirklich keine kunst project"}, {"id": 772, "start": 5605.14, "end": 5610.3, "text": "files to our s&b share we were getting right speeds of about 150 megabytes pro second du"}, {"id": 773, "start": 5610.3, "end": 5615.98, "text": "kannst keine 150 megabyte bekommen weil 125 megabyte per gigabit voll ist du bekommst"}, {"id": 774, "start": 5615.98, "end": 5624.26, "text": "maximal 125 megabyte die sekunde so and over 200 megabytes per second at times while reading"}, {"id": 775, "start": 5624.26, "end": 5630.42, "text": "those files back this isn't crazy or anything but we're at least das ist einfach schwachsinn"}, {"id": 776, "start": 5630.42, "end": 5640.3, "text": "was wenn aus da anzeigt achso er hat 2,5 hat er nicht gesagt er verwendet den ein gigabit"}, {"id": 777, "start": 5640.3, "end": 5647.62, "text": "anschluss nee er hat gesagt er hat zwischen seinem pc und dem server die 2,5 gigabit karte"}, {"id": 778, "start": 5647.62, "end": 5652.18, "text": "ok dann habe ich nichts gesagt dann habe ich nichts gesagt dann war zu viel zu viel aluhelm"}, {"id": 779, "start": 5652.18, "end": 5655.94, "text": "nee nee dann ist ok dann ist in ordnung dann ist dann ist das alles alles ok"}, {"id": 780, "start": 5655.94, "end": 5660.14, "text": "ist taking advantage of the extra bandwidth we get with our two and a half gigabit connection"}, {"id": 781, "start": 5660.14, "end": 5666.26, "text": "ok as we set up ice guzzi das ist das mark actually sees our ice guzzi drive as any other"}, {"id": 782, "start": 5666.26, "end": 5672.46, "text": "local drive so i decided to compare that to a 7200 rpm 2 terabyte mechanical drive in"}, {"id": 783, "start": 5672.46, "end": 5678.26, "text": "my system and our diy nas definitely performed quite a bit better with solid improvements"}, {"id": 784, "start": 5678.26, "end": 5679.66, "text": "to sequential reads and writes"}, {"id": 785, "start": 5679.66, "end": 5686.02, "text": "das dürfte wahrscheinlich zum größten teil daran liegen weil das ding einen cache hat"}, {"id": 786, "start": 5686.02, "end": 5693.46, "text": "der größer ist weil irgendwo was gecasht wird also ach moment es ist sequential das"}, {"id": 787, "start": 5693.46, "end": 5698.74, "text": "ist nicht zugriffszeit ja gut das kann schon sein das deckt sich ja ungefähr mit dem"}, {"id": 788, "start": 5698.74, "end": 5701.06, "text": "was er auch bei seiner samba übertragung hatte"}, {"id": 789, "start": 5701.06, "end": 5709.06, "text": "and massive improvements to random reads and writes our ice guzzi drive looks a little"}, {"id": 790, "start": 5709.06, "end": 5714.78, "text": "less impressive when compared to a simple seda ssd but with ice guzzi and true nas we"}, {"id": 791, "start": 5714.78, "end": 5720.14, "text": "have the benefit of capacity as well as redundancy so there's a really good chance i'm going"}, {"id": 792, "start": 5720.14, "end": 5724.9, "text": "to actually try out editing off of this ice guzzi drive that way if there's well over"}, {"id": 793, "start": 5724.9, "end": 5731.18, "text": "a week now now i know some people are probably already tight stromverbrauch ist wahrscheinlich"}, {"id": 794, "start": 5731.18, "end": 5737.38, "text": "auch ordentlich being comments about what is or could go wrong with the system and that's"}, {"id": 795, "start": 5737.38, "end": 5742.38, "text": "probably fair because this isn't perfect by any means i know someone is going to mention"}, {"id": 796, "start": 5742.38, "end": 5747.1, "text": "reliability but if you're trying to run some sort of critical or intense workload off of"}, {"id": 797, "start": 5747.1, "end": 5751.94, "text": "a 150 dollar da hat er recht da würde ich eh nichts wichtiges drauflaufen lassen das"}, {"id": 798, "start": 5751.94, "end": 5758.46, "text": "stimmt schon das ist halt die frage das ist dann halt die frage warum baut man sich überhaupt"}, {"id": 799, "start": 5758.46, "end": 5763.66, "text": "wenn man der sache nicht vertrauen kann so überhaupt nicht wie er sagt also dann ist"}, {"id": 800, "start": 5763.66, "end": 5767.42, "text": "halt die frage warum hat man es überhaupt da kann ich mir einfach eine 8 terabyte platte"}, {"id": 801, "start": 5767.42, "end": 5769.5, "text": "in meinen desktop rechner reinschmeißen und gut ist"}, {"id": 802, "start": 5769.5, "end": 5791.62, "text": "er dabei lernt sie wahrscheinlich auch nicht sonderlich viel oder was"}, {"id": 803, "start": 5791.62, "end": 5808.1, "text": "ist halt mit so schiener chinesen bastel konstruktion ist halt so ein ding"}, {"id": 804, "start": 5808.1, "end": 5821.14, "text": "ja das ist tatsächlich das schöne wenn du da linux md rate oder irgendwas macht oder zfs"}, {"id": 805, "start": 5821.14, "end": 5825.74, "text": "rate oder sonst was du kannst an den nächsten beliebigen computer hängen und wieder starten"}, {"id": 806, "start": 5825.74, "end": 5833.46, "text": "ganz im gegensatz zu irgendwelchen hardware rate controller down time isn't great but"}, {"id": 807, "start": 5833.46, "end": 5838.74, "text": "it's not a massive ordeal for what i do if that's not the case for you well then maybe"}, {"id": 808, "start": 5838.74, "end": 5844.78, "text": "look into something higher in to suit your fine for my to 2.0 courts gut 150 euro was"}, {"id": 809, "start": 5844.78, "end": 5852.54, "text": "willst du großartig erwarten ist schon in ordnung kann man rechnerplatten eigentlich"}, {"id": 810, "start": 5852.54, "end": 5856.78, "text": "auch im rate betreiben was sind dann rechnerplatten du meinst du ganz normale nur noch 15 festplatten"}, {"id": 811, "start": 5856.78, "end": 5861.02, "text": "natürlich kannst du im rate betreiben das was er da eingebaut hat war auch nichts anderes"}, {"id": 812, "start": 5861.02, "end": 5872.54, "text": "als ganz normale nur noch 15 platten kannst alle platten im rate betreiben du kannst"}, {"id": 813, "start": 5872.54, "end": 5881.9, "text": "sogar mikro sd karten im rate betreiben nö ich habe sehr wenig berührungspunkte bisher"}, {"id": 814, "start": 5881.9, "end": 5891.06, "text": "mit proxmox gehabt außer ein paar sachen wo beim streamer gebastelt haben keine ahnung"}, {"id": 815, "start": 5891.06, "end": 5895.26, "text": "ich vermute aber mal wenn man vom enterprise sektor spricht und damit auch wirklich enterprise"}, {"id": 816, "start": 5895.26, "end": 5903.5, "text": "vermeint also was wo wirklich auch kohle drin ist und nicht irgendwie so small business"}, {"id": 817, "start": 5903.5, "end": 5908.86, "text": "werbeagentur oder sowas sondern welche mit millionen alti bg dann wird es auf jeden fall"}, {"id": 818, "start": 5908.86, "end": 5923.06, "text": "auf vm rauslaufen nicht auf proxmox kann man noch hatten im rate betreiben mich würde"}, {"id": 819, "start": 5923.06, "end": 5929.72, "text": "nicht wundern wenn 1900 was weiß ich war das 65 leute sich über so was gedanken gemacht"}, {"id": 820, "start": 5929.72, "end": 5930.72, "text": "hätten"}, {"id": 821, "start": 5930.72, "end": 5947.18, "text": "nee ich glaube ich müsste mich da auch mal melden und fragen wie es jetzt aussieht"}, {"id": 822, "start": 5947.18, "end": 5953.14, "text": "vielleicht haben die ja schon jemand gefunden in der zwischenzeit die meinten zwar sie"}, {"id": 823, "start": 5953.14, "end": 5957.58, "text": "sagen bescheid aber das kann ja sein dass dann irgendwie dass ich das erledigt hat oder"}, {"id": 824, "start": 5957.58, "end": 5969.38, "text": "so du hast ein asus store für hw angefangen weil es jetzt nach dem video da hast du gedacht"}, {"id": 825, "start": 5969.38, "end": 5977.98, "text": "die sind bestimmt spendabel was das angeht der asus store ich wüsste gar nicht was"}, {"id": 826, "start": 5977.98, "end": 5981.94, "text": "ich damit machen soll also ich meine ja klar sachen drauf speichern aber ich will nicht"}, {"id": 827, "start": 5981.94, "end": 5984.54, "text": "noch eine weitere kiste bei mir stehen dann braucht ja alles strom"}, {"id": 828, "start": 5984.54, "end": 6006.74, "text": "nee da muss ich nicht absagen da arbeite ich ja gerade"}, {"id": 829, "start": 6006.74, "end": 6021.3, "text": "also was haben wir als nächstes was kann kommen wir lassen uns die runde level cap"}, {"id": 830, "start": 6021.3, "end": 6038.1, "text": "gb oder feier schipp ein feier schipp geht bloß zwei minuten 46 wir gucken uns feier"}, {"id": 831, "start": 6038.1, "end": 6050.54, "text": "schipp an wir gucken uns feier schipp an danach gucken wir uns den level cap gb dann"}, {"id": 832, "start": 6050.54, "end": 6058.82, "text": "das ist zu cool um irgendwie was traditionelles zu sein deswegen ist es new sql ich bin ich"}, {"id": 833, "start": 6058.82, "end": 6068.74, "text": "finde es übrigens gut ich finde es übrigens gut dass sql sagt das finde ich gut ich mag"}, {"id": 834, "start": 6068.74, "end": 6075.82, "text": "sequel nicht die aussprache deswegen finde ich sql oder sql immer noch sympathisch wenn"}, {"id": 835, "start": 6075.82, "end": 6083.14, "text": "das einer sagt sql ist mir zu sus wenn das das mag ich nicht database that delivers every"}, {"id": 836, "start": 6083.14, "end": 6088.36, "text": "feature you ever dreamed of acid scalable full text search real-time graph relational"}, {"id": 837, "start": 6088.36, "end": 6094.22, "text": "multitenant temporal schema list serverless embedded are all words that can describe surreal"}, {"id": 838, "start": 6094.22, "end": 6100.5, "text": "db a multimodell blazing fast written in rust binds elements of relational graph and document"}, {"id": 839, "start": 6100.5, "end": 6105.3, "text": "paradigms into a simple package that can be queried with an sql like language development"}, {"id": 840, "start": 6105.3, "end": 6111.22, "text": "was started by jamie and toby morgan hitchcock in 2015 and it was open-sourced in july 2022"}, {"id": 841, "start": 6111.22, "end": 6116.58, "text": "the engine is written in rust multiple persistence layers like tyke av to scale horizontally"}, {"id": 842, "start": 6116.58, "end": 6125.3, "text": "in the cloud wie sagst du jason web talk ich habe das erstaunlich selten ausgesprochen"}, {"id": 843, "start": 6125.3, "end": 6153.62, "text": "bisher ich würde es wahrscheinlich jwt sagen jott jott jwt jwt habe ich mir noch keine"}, {"id": 844, "start": 6153.62, "end": 6179.58, "text": "geraken zugemacht offiziell ist es jott was was wie moment jott wie kommt man von jwt"}, {"id": 845, "start": 6179.58, "end": 6192.26, "text": "auf jott dann hätten sie es doch jott guck mal wenn sie wollen dass es jott ausspricht"}, {"id": 846, "start": 6192.26, "end": 6215.94, "text": "dann hätte man es einfach jott nennen sollen why is it pronounced jott genau jwt das ist"}, {"id": 847, "start": 6215.94, "end": 6239.14, "text": "ja halbe weltgeschichte warum es jott heißt judd jott meine güte also ich würde spontan"}, {"id": 848, "start": 6239.14, "end": 6243.98, "text": "eigentlich jbt sagen auf deutsch oder ich würde es wahrscheinlich gar nicht abkürzen"}, {"id": 849, "start": 6243.98, "end": 6248.34, "text": "sondern wahrscheinlich einfach sagen jason web talken oder oder einfach nur web talken"}, {"id": 850, "start": 6248.34, "end": 6266.14, "text": "oder sowas jason talken oder oder jwt meinetwegen w is e der dümmste buchstabe den sie sich"}, {"id": 851, "start": 6266.14, "end": 6279.46, "text": "ausgedacht also nicht w an sich sondern dass es w ausgesprochen wird"}, {"id": 852, "start": 6279.46, "end": 6285.34, "text": "richtig true 0w chat hat es erkannt warum sollte man das überhaupt abkürzen einfach"}, {"id": 853, "start": 6285.34, "end": 6292.86, "text": "javascript object notation web talken sagen da bin ich auch dafür das sollten wir immer"}, {"id": 854, "start": 6292.86, "end": 6298.78, "text": "so wir sollten prinzipiell eigentlich keine anglizismen mehr verwenden und alles korrekt"}, {"id": 855, "start": 6298.78, "end": 6304.66, "text": "aussprechen ohne abkürzung leute ich glaube wie viele sätze könnte ich sagen wenn ich"}, {"id": 856, "start": 6304.66, "end": 6314.7, "text": "keine anglizismen mehr verwende einen zwei viele sind es auf jeden fall nicht eine halbe"}, {"id": 857, "start": 6314.7, "end": 6332.5, "text": "wahrscheinlich ja viel ist es nicht data oder data data sprich mal hsts ist das diese"}, {"id": 858, "start": 6332.5, "end": 6346.02, "text": "http streaming ne das ist hls aber was ist hsts nochmal http strick transport security"}, {"id": 859, "start": 6346.02, "end": 6348.66, "text": "also was ist das so wir gucken dass das video mal fertig den nur zwei minuten ich hab es"}, {"id": 860, "start": 6348.66, "end": 6353.14, "text": "nach 30 sekunden geschafft wieder fünf minuten zu labern in the cloud or as a single node"}, {"id": 861, "start": 6353.14, "end": 6357.78, "text": "both in memory or on disk most importantly though it can handle complex relationships"}, {"id": 862, "start": 6357.78, "end": 6362.7, "text": "like traditional relational databases but does so without joins instead it uses techniques"}, {"id": 863, "start": 6362.7, "end": 6367.86, "text": "like record links and graph connections that not only handle complex data models but also"}, {"id": 864, "start": 6367.86, "end": 6372.54, "text": "result in concise developer friendly code and by default its schema list which means"}, {"id": 865, "start": 6372.54, "end": 6377.18, "text": "you can implicitly create unstructured data in any table however you can opt in to skew"}, {"id": 866, "start": 6377.18, "end": 6390.22, "text": "as you can see there is no colour"}, {"id": 867, "start": 6390.22, "end": 6402.98, "text": "Also gibt es dafür schon irgendwelche net driver is needed gibt es dafür schon irgendwas"}, {"id": 868, "start": 6402.98, "end": 6411.14, "text": "weil dann probieren wir das einfach mal aus."}, {"id": 869, "start": 6411.14, "end": 6438.22, "text": "Now net driver is needed ach gibt es gibt es schon oh ok es gibt im"}, {"id": 870, "start": 6438.22, "end": 6446.02, "text": "Prinzip für aktuell kaum was es gibt für Go, für Node und Rust und Go ok also allein"}, {"id": 871, "start": 6446.02, "end": 6451.66, "text": "schon so kann es keine Mainstream wirklich richtige Business Enterprise Mainstream Verbreitung"}, {"id": 872, "start": 6451.66, "end": 6452.66, "text": "kriegen."}, {"id": 873, "start": 6452.66, "end": 6459.62, "text": "Du brauchst zumindest mal Java noch du brauchst zumindest mal Java noch also ich mein das"}, {"id": 874, "start": 6459.62, "end": 6465.3, "text": "ist also Node und Golang ist schon mal ein guter Start Node ist ziemlich verbreitet und"}, {"id": 875, "start": 6465.3, "end": 6473.16, "text": "Go ist auch nicht unbedeutend für Business Enterprise Backend Anwendungen eher weniger"}, {"id": 876, "start": 6473.16, "end": 6476.7, "text": "aber gerade wenn man sich mal die ganzen Cloud Tools und Sachen drumherum anguckt da auf"}, {"id": 877, "start": 6476.7, "end": 6477.7, "text": "jeden Fall."}, {"id": 878, "start": 6477.7, "end": 6485.86, "text": "So also Node und Go ist auf jeden Fall schon mal ein ordentlicher Anteil Rust eher halt"}, {"id": 879, "start": 6485.86, "end": 6492.42, "text": "da weil es selbst in Rust programmiert ist aber zumindest Java, Python und.NET das muss"}, {"id": 880, "start": 6492.42, "end": 6499.06, "text": "noch sein dass das wirklich große Verbreitung kriegen kann PHP wäre auch auf jeden Fall"}, {"id": 881, "start": 6499.06, "end": 6503.74, "text": "äußerst sinnvoll viele Web Anwendungen und gerade Sachen bei Billig Hostern sind immer"}, {"id": 882, "start": 6503.74, "end": 6510.46, "text": "noch gerne in PHP und Low Level Sachen selbstverständlich auch es sollte also ganz ehrlich ein C Interface"}, {"id": 883, "start": 6510.46, "end": 6517.58, "text": "anzubieten wenn es ein Rust Interface schon gibt muss er irgendwie rappen Erlang juckt"}, {"id": 884, "start": 6517.58, "end": 6521.7, "text": "mich jetzt nicht Ruby ganz ehrlich leider ein bisschen an Bedeutung verloren wäre natürlich"}, {"id": 885, "start": 6521.7, "end": 6532.1, "text": "cool ja also es muss also.NET ja eine REST API alleine ist ja schön und gut aber du willst"}, {"id": 886, "start": 6532.1, "end": 6539.98, "text": "ja dann auch später mal Entity, EF Core Integration und sowas vielleicht haben da ist dann die"}, {"id": 887, "start": 6539.98, "end": 6544.14, "text": "machen das nicht in Reihenfolge ne die machen das wahrscheinlich aber wenn Server-Site,"}, {"id": 888, "start": 6544.14, "end": 6554.86, "text": "Ach so ja Abfrage machen kann.NET hat eigentlich ein Logo mittlerweile.NET hat diesen komischen"}, {"id": 889, "start": 6554.86, "end": 6568.22, "text": "Roboter oder ist das das die Sharp Logo ne die haben doch die haben noch diesen Roboter"}, {"id": 890, "start": 6568.22, "end": 6576.86, "text": "als Logo hier ich finde kein schönes Logo aber die haben eins"}, {"id": 891, "start": 6576.86, "end": 6583.58, "text": "mal gucken mal gucken wie sich das wie gesagt ich bin eh gespannt wie sich das die nächsten"}, {"id": 892, "start": 6583.58, "end": 6588.58, "text": "paar Jahre entwickelt ob das auch irgendwie von dem Hype was was retten kann ob das dann"}, {"id": 893, "start": 6588.58, "end": 6590.3, "text": "wirklich jemand verwendet auch"}, {"id": 894, "start": 6590.3, "end": 6619.9, "text": ".NET"}, {"id": 895, "start": 6619.9, "end": 6622.68, "text": "All of which can be locked down with permissions out of the box."}, {"id": 896, "start": 6622.68, "end": 6627.02, "text": "To get started, install it on your machine, then run it locally with the CLI, then execute"}, {"id": 897, "start": 6627.02, "end": 6629.06, "text": "code using its REST API or a cli-"}, {"id": 898, "start": 6629.06, "end": 6633.18, "text": "Okay, ja, aber... ist halt, ist halt ein bisschen..."}, {"id": 899, "start": 6633.18, "end": 6642.3, "text": "Ja, da musste, musste deine Datenbankqueries über, über HTTP machen."}, {"id": 900, "start": 6642.3, "end": 6646.82, "text": "Ich mein, okay, vielleicht ist es gar nicht so schlecht."}, {"id": 901, "start": 6646.82, "end": 6653.06, "text": "Da kannst du nämlich das Datenbank Standalone laufen lassen und vom Client direkt drauf"}, {"id": 902, "start": 6653.06, "end": 6657.18, "text": "zugreifen, und deine Backend-Logik greift quasi dann auch da drüber drauf zu, wenn"}, {"id": 903, "start": 6657.18, "end": 6658.18, "text": "du es mal brauchst."}, {"id": 904, "start": 6658.18, "end": 6662.06, "text": "Vielleicht ist das gar nicht so verkehrt."}, {"id": 905, "start": 6662.06, "end": 6671.54, "text": "Ja, von CraftQL hab ich da noch nix, noch nix gehört bis jetzt."}, {"id": 906, "start": 6671.54, "end": 6676.74, "text": "Ähm, mit Craft, in den letzten paar Sätzen meint er eher was anderes, da meint er, wie"}, {"id": 907, "start": 6676.74, "end": 6679.38, "text": "die Daten in der Datenbank intern miteinander zusammenhängen."}, {"id": 908, "start": 6679.38, "end": 6683.38, "text": "Ob das den CraftQL unterstützt, weiß ich nicht."}, {"id": 909, "start": 6683.38, "end": 6686.18, "text": "Weiß ich, wo weiß ich nicht."}, {"id": 910, "start": 6686.18, "end": 6691.18, "text": "Guck mal mal."}, {"id": 911, "start": 6691.18, "end": 6696.66, "text": "Coming soon, CraftQL."}, {"id": 912, "start": 6696.66, "end": 6700.58, "text": "Die wollen, die wollen's aber wissen, die wollen wirklich alles machen."}, {"id": 913, "start": 6700.58, "end": 6707.94, "text": "Die haben auch wirklich da viel eingebaut."}, {"id": 914, "start": 6707.94, "end": 6726.1, "text": "Was bedeutet serverless, dass der Server nicht bei dir steht?"}, {"id": 915, "start": 6726.1, "end": 6728.1, "text": "Ist so."}, {"id": 916, "start": 6728.1, "end": 6731.74, "text": "Server gibt's trotzdem."}, {"id": 917, "start": 6731.74, "end": 6751.06, "text": "Oh, Five-Hat-Time, was das als fertig ist."}, {"id": 918, "start": 6751.06, "end": 6776.26, "text": "Oh, C++-Vibes, Leute, mit dem Pfeil."}, {"id": 919, "start": 6776.26, "end": 6793.34, "text": "Oh, C++-Vibes, Leute, mit dem Pfeil."}, {"id": 920, "start": 6806.26, "end": 6826.66, "text": "Oh, C++-Vibes, Leute, mit dem Pfeil."}, {"id": 921, "start": 6826.66, "end": 6837.02, "text": "Oh, C++-Vibes, Leute, mit dem Pfeil."}, {"id": 922, "start": 6837.02, "end": 6852.94, "text": "Oh, C++-Vibes, Leute, mit dem Pfeil."}, {"id": 923, "start": 6852.94, "end": 6874.54, "text": "Oh, C++-Vibes, Leute, mit dem Pfeil."}, {"id": 924, "start": 5875.88, "end": 6908.74, "text": "oh, C++-Vibes, Leute, mit dem Pfeil, oh, C++-Vibes, Leute, mit dem Pfeil, oh, C++-Vibes,"}, {"id": 925, "start": 6908.74, "end": 6931.14, "text": "Leute, oh, C++-Vibes, Leute, mit dem Pfeil, oh, C++-Vibes, Leute, mit dem Pfeil."}, {"id": 926, "start": 6931.14, "end": 6937.14, "text": "Ja gut gute ich brauche immer mehr nintendo musik playlists"}, {"id": 927, "start": 6941.14, "end": 6944.14, "text": "Ja das ist der low budget nascar"}, {"id": 928, "start": 6945.14, "end": 6952.14, "text": "Ne habe ich nicht ich habe ach so wirst du ja sobald sie auf dem pc gibt werde ich mir das an werde ich mir das geben korrekt und"}, {"id": 929, "start": 6952.14, "end": 6965.14, "text": "Wahrscheinlich ausrasten ab dem zwei ab der zweiten runde wegen skill-based matchmaking"}, {"id": 930, "start": 6965.14, "end": 6967.14, "text": "Ich mache stark von aus"}, {"id": 931, "start": 6967.14, "end": 6977.14, "text": "So ok sieben areas wir über wir skippen das video jetzt einfach pass mal auf wir machen jetzt den absolut high IQ six head move"}, {"id": 932, "start": 6977.14, "end": 6987.14, "text": "Wir gucken uns an was was hier steht also sponsor das video geht erstmal da los software management ok da geht da geht da"}, {"id": 933, "start": 6987.14, "end": 6993.14, "text": "Erzähl wahrscheinlich was von den standard repos der verschiedenen distributionen ok ja"}, {"id": 934, "start": 6993.14, "end": 6999.14, "text": "monetary cost ja gut es ist zum größten teile umsonst open source und free software ok performance"}, {"id": 935, "start": 6999.14, "end": 7003.14, "text": "Na da kann man sich jetzt drüber streiten performance in welchem sektor"}, {"id": 936, "start": 7007.14, "end": 7013.14, "text": "Da kann man sich drüber streiten ok wir müssen doch mal kurz reingucken also"}, {"id": 937, "start": 7013.14, "end": 7023.14, "text": "Ok wir müssen doch mal kurz reingucken also"}, {"id": 938, "start": 7033.14, "end": 7039.14, "text": "Also die probleme die ich mit win get hatte waren wir haben das ja ausprobiert das letzte mal erstens viel zu wenig parkete drinne"}, {"id": 939, "start": 7039.14, "end": 7044.14, "text": "Zweitens irgendwie installer die nicht richtig laufen aninstaller die nicht richtig laufen"}, {"id": 940, "start": 7044.14, "end": 7053.14, "text": "Suche die komplett verkacktes ganz also es war irgendwie fail ist doch gar nicht so lang her das heißt"}, {"id": 941, "start": 7053.14, "end": 7055.14, "text": "Das ist doch erst ein paar monate her wo wir uns das angeguckt haben"}, {"id": 942, "start": 7055.14, "end": 7057.14, "text": "Aber"}, {"id": 943, "start": 7058.14, "end": 7063.14, "text": "All your apps and packages are available in one single software store"}, {"id": 944, "start": 7063.14, "end": 7069.14, "text": "You can install anything in one click and update the system and the ok überspringen"}, {"id": 945, "start": 7069.14, "end": 7077.14, "text": "Second area is monetary cost linux in 99 percent of cases is free of charge"}, {"id": 946, "start": 7077.14, "end": 7086.14, "text": "You don't have to spend a dime to install a linux distro das stimmt aber ich finde das wird oftmals ein bisschen zu sehr hervorgehoben"}, {"id": 947, "start": 7086.14, "end": 7094.14, "text": "Weil mal ganz im ernst ich gehe jetzt mal von mir aus und ich übertrage das jetzt mal auf die meisten anderen Leute"}, {"id": 948, "start": 7094.14, "end": 7104.14, "text": "Ich glaube viele Leute haben prinzipiell gar kein problem damit dass Sachen die gut funktionieren und gut gemacht sind auch was kosten dürfen"}, {"id": 949, "start": 7104.14, "end": 7114.14, "text": "Also ich glaube für viele ist der reine kosten faktor nicht wirklich der entscheidende punkt linux zu verwenden"}, {"id": 950, "start": 7114.14, "end": 7118.14, "text": "Außerdem muss man sagen wenn aus lizenzen jetzt so teuer auch nicht"}, {"id": 951, "start": 7121.14, "end": 7128.14, "text": "Also vielen leuten ist es bestimmt lieber sie bezahlen ein bisschen was also wenn du die leute fragen würdest okay"}, {"id": 952, "start": 7128.14, "end": 7139.14, "text": "Soll es muss es immer kostenlos sein oder darf es auch was kosten und dafür gibt es support und updates garantiert und insgesamt bessere qualität"}, {"id": 953, "start": 7139.14, "end": 7147.14, "text": "Da würden wahrscheinlich 99 prozent der leute sagen ja es darf auch ein bisschen was kosten wenn es dann im prinzip einfach mehr weniger weniger probleme macht"}, {"id": 954, "start": 7147.14, "end": 7155.14, "text": "Also ja es ist ein vorteil aber ich glaube das ist nicht der ausschlaggebende punkt für viele linux verwender benutzer"}, {"id": 955, "start": 7155.14, "end": 7163.14, "text": "Linux verwender also ich habe ich habe andere gründe warum ich linux verwende nicht weil es kostenlos ist"}, {"id": 956, "start": 7163.14, "end": 7175.14, "text": "But you can always get these for free linux enjoy but I got windows for free I didn't have to pay it it was right there on my computer"}, {"id": 957, "start": 7175.14, "end": 7194.14, "text": "2,50 euro bei amazon oder bei bei irgendeinem ex-liebigen anderen shop"}, {"id": 958, "start": 7194.14, "end": 7216.14, "text": "Das ist richtig aber ganz im er ja ja das ist mir doch egal ob die also ganz ehrlich das kann doch keiner von mir verlangen"}, {"id": 959, "start": 7216.14, "end": 7224.14, "text": "Dass ich das nachprüfe wie ist denn jetzt also wenn ich in den shop gehe gerade bei einem shop bei einem bei einem shop wie amazon"}, {"id": 960, "start": 7224.14, "end": 7250.14, "text": "Du siehst dort ein du siehst dort windows lizenz für 25 euro und kaufst die ganz im ernst es kann auch keiner von mir verlangen dass ich da irgendwie nachvollziehe welche lieferketten dieser key mal hatte"}, {"id": 961, "start": 7250.14, "end": 7257.14, "text": "Aber sie funktionieren immer noch und ja und eine piraten kopie von windows wird immer noch funktionieren das bedeutet noch nicht"}, {"id": 962, "start": 7257.14, "end": 7265.14, "text": "Okay, eine andere große gewinne für linux ist ihre open source und freie Software nature warum soll es dir egal sein"}, {"id": 963, "start": 7265.14, "end": 7291.14, "text": "Naja Naja da habe ich andere ansichten zu"}, {"id": 964, "start": 7291.14, "end": 7299.14, "text": "Wie lange hat es gedauert bis gpu die coding in browsers unter linux richtig funktioniert hat"}, {"id": 965, "start": 7299.14, "end": 7308.14, "text": "Wie lange hat es gedauert vier jahre fünf jahre also ich rede jetzt von dem zeitpunkt wo sowas unter linux und mac schon funktioniert hat"}, {"id": 966, "start": 7308.14, "end": 7316.14, "text": "Sagen wir mal unter linux schon funktioniert vier oder fünf jahre hat es gedauert unter linux bis das funktioniert hat also"}, {"id": 967, "start": 7316.14, "end": 7324.14, "text": "Und es funktioniert jetzt noch nicht richtig genau es funktioniert nur in der richtigen kombination von richtigen treibern richtig an mehreren stellen"}, {"id": 968, "start": 7324.14, "end": 7336.14, "text": "Richtige grafikkarte richtige grafikkarten treiber richtige mesa treiber richtige browser version richtige browser flex richtige video formate richtige browser plugins alles mögliche also so einfach ist es nicht"}, {"id": 969, "start": 7336.14, "end": 7347.14, "text": "Da kann man sich jetzt drüber stellen ja ja das ist du hast schon recht also die die frage woran das liegt ist tatsächlich in dem fall gar nicht mal so einfach zu beantworten"}, {"id": 970, "start": 7347.14, "end": 7360.14, "text": "Ja es mag wahrscheinlich wirklich daran liegen dass gpu hersteller irgendwie verkacken mit ihren drei mag alles sein aber man hat sich aber linux typisch in diesem fall wieder sehr lange den ball zugeschoben"}, {"id": 971, "start": 7360.14, "end": 7370.14, "text": "Ja die browser hersteller sagen das ist nicht mein ding soll sollen die desktop oder sollen irgendwie die windows system leute machen die windows system leute sagen ja das sind"}, {"id": 972, "start": 7370.14, "end": 7380.14, "text": "Irgendwelche treiber extensions sagen ja das ist dann der treiber vom geräte hersteller der hersteller sagt ja nee das muss man doch wieder die browser hersteller machen und alles sagen sie an mir liegt es ja nicht"}, {"id": 973, "start": 7380.14, "end": 7394.14, "text": "Bei mir ist ja nichts kaputt und das hat ewig ewig gedauert also ganz so einfach mit es ist open source deswegen geht dann da alles nach fünf minuten so ist es nicht"}, {"id": 974, "start": 7394.14, "end": 7412.14, "text": "Die meisten leute wissen mit ach und krach wie man auf github kommt als fixed ernsthaft irgendjemand was in kde plasma in den internals aus einer handvoll leute"}, {"id": 975, "start": 7412.14, "end": 7425.14, "text": "Das kann mir keiner erzählen es ist genauso wie die leute sagen ja linux ist open source ja ja ist schön und gut aber können kontributors gibt es nicht viele können auch nicht viele erstens da brauchst ja mehrere sachen"}, {"id": 976, "start": 7425.14, "end": 7438.14, "text": "Du musst da erst einmal durchblicken überhaupt dass du überhaupt was machen kannst dann musst du nicht nur durchblicken dann musst du auch noch soweit den gesamtüberblick haben dass du verstehst was das was du machst was das für auswirkungen hat"}, {"id": 977, "start": 7438.14, "end": 7458.14, "text": "Dazu kommt dass die sicherlich nicht irgendwelche random dudes dort ungesehen sachen kontributen lassen also die geht wahrscheinlich linux und die anderen leute bei einem bei einem first contributor ich habe keine ahnung"}, {"id": 978, "start": 7458.14, "end": 7477.14, "text": "Übrigens ob das wirklich so ist aber ich vermute es einfach mal bei jemanden der zuerst kontributen will so sehr auf den sack in dem sie deinen wahrscheinlich dein merch request erst mal so zerreißen dass du wahrscheinlich keinen bock mehr hast einen zweiten zu stellen aber auch zu recht muss man ja sagen also das muss ich das muss man linux wirklich lassen"}, {"id": 979, "start": 7477.14, "end": 7500.14, "text": "Die meisten sachen wo er flamet und die finden sind ja bekannt dafür dass die richtig richtig nice flamen können das hat oftmals zumindest einen grund und der ist nachvollziehbar wenn man ihn vielleicht auch nicht immer teilt aber da hat also der flamt meistens nicht komplett unsinnig"}, {"id": 980, "start": 7500.14, "end": 7529.14, "text": "Er hat es eine zeit lang wirklich übertrieben wie er da abgegangen ist aber er hatte zumindest immer einen gewissen hintergedanken der ich wie nachvollziehbar war ja aber die meisten leute sind gar nicht in der lage dazu open source ist eine super super geschichte gerade zum lernen ist open source ganz besonders toll also wenn du beispielsweise wissen willst ey wie macht man denn so was oder wie haben die das denn da gebaut dass es funktioniert"}, {"id": 981, "start": 7529.14, "end": 7558.14, "text": "dann ist es super wenn du abgucken kannst ganz ganz im ernst guck mal ich hab doch hier letztens auf github eine home assistant add-on veröffentlicht wo man seine wo man aus seinem guck mal ich hab schon zehn sterne pock wo man sein sein fiat beziehungsweise die die fiat uconnect services wo man die sachen importieren kann in home assistant wie reifendruck und batterieladung und sowas dass man so was machen kann ich hätte das nicht hinbekommen es kann"}, {"id": 982, "start": 7558.14, "end": 7569.14, "text": "nicht hinbekommen es gab ein issue ja es gab ein issue das habe ich auch schon geschlossen"}, {"id": 983, "start": 7569.14, "end": 7583.14, "text": "was wollte ich jetzt sagen außer monka steer sollte man vielleicht jetzt nochmal achja genau das hätte ich überhaupt nicht so schnell hinbekommen hätte ich nicht ein anderes projekt gefunden"}, {"id": 984, "start": 7583.14, "end": 7603.14, "text": "hätte ich nicht ein anderes projekt gefunden wo ich das hätte abgucken können wie die das gemacht haben sonst hätte ich das nie so schnell hinbekommen"}, {"id": 985, "start": 7603.14, "end": 7615.14, "text": "ich konnte ich konnte hier abgucken und ich konnte hier abgucken wie die requests an die fiat api aussehen müssen dass es funktioniert"}, {"id": 986, "start": 7615.14, "end": 7633.14, "text": "also insofern dass dafür ist das ist das super ja ich habe es auch unter die gleiche lizenz gestellt wie der andere du das heißt es kann jeder im endeffekt damit machen was lustig ist"}, {"id": 987, "start": 7633.14, "end": 7649.14, "text": "findet ihr nicht auch dass ich mir viel mühe bei der rhythm gegeben habe sogar mit screenshots und allem ja aber ich mag projekte nicht wo keine screenshots drin sind gerade wenn sie eben"}, {"id": 988, "start": 7649.14, "end": 7664.14, "text": "ja irgendwas mit web zu tun haben bilder beste genau weiter mehr doko als auf der arbeit das ist wohl bei uns auch so ja"}, {"id": 989, "start": 7664.14, "end": 7679.14, "text": "ja gut der daubi ist ja da auch so ein ganz ganz spezieller fall"}, {"id": 990, "start": 7679.14, "end": 7695.14, "text": "ja das ist natürlich cool"}, {"id": 991, "start": 7695.14, "end": 7716.14, "text": "das ist natürlich wieder ein paradebeispiel für wo es gut funktioniert richtig giga chat move hier echt so viel mittlerweile"}, {"id": 992, "start": 7716.14, "end": 7735.72, "text": "k"}, {"id": 993, "start": 7735.72, "end": 7738.16, "text": "schreckliche grafische User-Interface"}, {"id": 994, "start": 7738.16, "end": 7739.72, "text": "mit super alten Computern,"}, {"id": 995, "start": 7739.72, "end": 7741.72, "text": "ohne sie unnötig zu machen."}, {"id": 996, "start": 7741.72, "end": 7770.72, "text": "Also, ja, ja, ist schon was dran. Wobei die Mainstream-Distros auf alten Laptops jetzt auch nicht besser laufen als das entsprechende Windows. Also, vielleicht würde sie wirklich so altes, altes, altes Zeug, wo du dann mit so super Lightweight-Sachen anfängst. Die Sache ist nur die. Wenn du damit dann was machen willst, zum Beispiel einen Browser öffnen, dann ist es genauso langsam."}, {"id": 997, "start": 7770.72, "end": 7772.72, "text": "Weil es braucht halt einfach gewisse Leistung."}, {"id": 998, "start": 7772.72, "end": 7784.72, "text": "Leute, ich hab den Move schlechthin, ist mir gerade eingefallen, wisst ihr was Microsoft machen müsste, damit Windows wieder hip und angesagt ist?"}, {"id": 999, "start": 7784.72, "end": 7788.72, "text": "Microsoft müsste Windows in Rust neu programmieren."}, {"id": 1000, "start": 7788.72, "end": 7790.72, "text": "Windows RS."}, {"id": 1001, "start": 7790.72, "end": 7792.72, "text": "Blazingly fast written in Rust."}, {"id": 1002, "start": 7792.72, "end": 7795.72, "text": "Was meint ihr, was da los wäre?"}, {"id": 1003, "start": 7795.72, "end": 7798.72, "text": "Leute, Windows in Rust, Alter."}, {"id": 1004, "start": 7798.72, "end": 7808.72, "text": "Surrealdb hat Surrealdb an Schatzer-Registry, genau."}, {"id": 1005, "start": 7808.72, "end": 7836.72, "text": "Ja, wenn du, wenn du, naja, das funktioniert schon mal nicht."}, {"id": 1006, "start": 7836.72, "end": 7849.72, "text": "Wenn du Gento auf einer schwachbrüstigen Hardware verwenden möchtest, mag das am Ende vielleicht 0,5% schneller sein, wenn du es mit passenden Flex kompilierst."}, {"id": 1007, "start": 7849.72, "end": 7852.72, "text": "Aber das Kompilieren dauert halt eine Woche."}, {"id": 1008, "start": 7852.72, "end": 7859.72, "text": "Das stimmt, das kann ich komplett unterschreiben."}, {"id": 1009, "start": 7859.72, "end": 7869.72, "text": "Also customizable und customization gibt es nichts besseres als Linux."}, {"id": 1010, "start": 7869.72, "end": 7872.72, "text": "Also ich rede jetzt nicht von hier Gnome Desktop oder so."}, {"id": 1011, "start": 7872.72, "end": 7874.72, "text": "Da bin ich jetzt ehrlich gesagt gar nicht so schafft drauf."}, {"id": 1012, "start": 7874.72, "end": 7888.72, "text": "Aber sowas wie ich meinen i3-WM eingerichtet habe und customise, das ist unter Windows undenkbar."}, {"id": 1013, "start": 7888.72, "end": 7893.72, "text": "Du endest mit etwas, das irgendwie für alle funktioniert, aber es ist perfekt für niemanden."}, {"id": 1014, "start": 7893.72, "end": 7895.72, "text": "Bei Linux kannst du von einem enormen..."}, {"id": 1015, "start": 7895.72, "end": 7898.72, "text": "Dachtest du mal den Mac-Usern?"}, {"id": 1016, "start": 7898.72, "end": 7902.72, "text": "Da gibt es einen Style für alle und die werden abgefeiert."}, {"id": 1017, "start": 7902.72, "end": 7909.72, "text": "... Distributions- und Desktop-Embodigungen und Tools, um sicher zu sein, dass deine Erfahrung das beste für dich funktioniert."}, {"id": 1018, "start": 7909.72, "end": 7915.72, "text": "Und klar, das kreiert auch Probleme, besonders für Beginner, die nicht wissen, welche Linux-Distribution zu bekommen."}, {"id": 1019, "start": 7915.72, "end": 7920.72, "text": "Aber das ist nur, weil sie nicht verwendet sind für Linux."}, {"id": 1020, "start": 7920.72, "end": 7925.72, "text": "Es beeinflusst die Optionen, die du hast, die du customisieren kannst."}, {"id": 1021, "start": 7925.72, "end": 7928.72, "text": "Linux ist auch ein privater System."}, {"id": 1022, "start": 7928.72, "end": 7931.72, "text": "Wenn du Windows installierst, musst du über..."}, {"id": 1023, "start": 7931.72, "end": 7935.72, "text": "Ja, da muss ich auch immer kecken, wenn ich das unter Windows sehe."}, {"id": 1024, "start": 7935.72, "end": 7937.72, "text": "... 10 Schrauben der Konfiguration."}, {"id": 1025, "start": 7937.72, "end": 7941.72, "text": "Die meisten fragen dich, ob du deine Daten haben möchtest."}, {"id": 1026, "start": 7941.72, "end": 7943.72, "text": "Und die meisten sind Schauspieler."}, {"id": 1027, "start": 7943.72, "end": 7945.72, "text": "Und bevor du sagst, sind das Schauspieler."}, {"id": 1028, "start": 7945.72, "end": 7948.72, "text": "Und das ist, weshalb du auf deinem System lebst."}, {"id": 1029, "start": 7948.72, "end": 7952.72, "text": "Die letzte Stelle, wo Linux einfach besser ist, ist der Terminal."}, {"id": 1030, "start": 7952.72, "end": 7959.72, "text": "Ach, aber meilenweit, umlängen. Ich meine, WSL, was im Endeffekt ja quasi Linux auf Windows bringt,"}, {"id": 1031, "start": 7959.72, "end": 7965.72, "text": "und das neue Windows-Terminal, das ist zum ersten Mal in Kombination nutzbar."}, {"id": 1032, "start": 7965.72, "end": 7968.72, "text": "Das davor unter Windows war ja der absolute Witz."}, {"id": 1033, "start": 7968.72, "end": 7971.72, "text": "Das ist nicht etwas, das du benutzen musst, um einen..."}, {"id": 1034, "start": 7971.72, "end": 7975.72, "text": "Warum ich ein iPhone habe statt dem Android? Ich habe beides."}, {"id": 1035, "start": 7975.72, "end": 7978.72, "text": "Ich habe iPhones, iPads und Android-Tablets."}, {"id": 1036, "start": 7978.72, "end": 7983.72, "text": "Aber ich bekomme das iPhone von dort, wo ich arbeite,"}, {"id": 1037, "start": 7983.72, "end": 7988.72, "text": "kriege ich alle eins bis zwei Jahre ein iPhone gestellt."}, {"id": 1038, "start": 7988.72, "end": 7992.72, "text": "Und seitdem habe ich kein eigenes Smartphone mehr."}, {"id": 1039, "start": 7998.72, "end": 8000.72, "text": "Und einen Surface. Ja, ich habe einen Surface-Hub."}, {"id": 1040, "start": 8000.72, "end": 8002.72, "text": "Äh, kein Surface-Hub, null."}, {"id": 1041, "start": 8002.72, "end": 8010.72, "text": "Einen Surface-Book, das muss ich jetzt auch noch einrichten da nächste Woche."}, {"id": 1042, "start": 8010.72, "end": 8016.72, "text": "Welche Linux-Distribution für Anfänger?"}, {"id": 1043, "start": 8016.72, "end": 8022.72, "text": "Ähm, Linux Mint? Kann ich dir empfehlen?"}, {"id": 1044, "start": 8022.72, "end": 8027.72, "text": "Für Anfänger Ubuntu nicht zwangsläufig?"}, {"id": 1045, "start": 8027.72, "end": 8033.72, "text": "Nimm Linux Mint. Da hast du einen Debian-Ubuntu-Unterbau."}, {"id": 1046, "start": 8033.72, "end": 8036.72, "text": "Hör nicht auf den Chat."}, {"id": 1047, "start": 8036.72, "end": 8039.72, "text": "Hör nicht auf den Chat. Nimm Linux Mint."}, {"id": 1048, "start": 8039.72, "end": 8043.72, "text": "Das ist für Einsteiger zum Kennenlernen ganz gut."}, {"id": 1049, "start": 8043.72, "end": 8053.72, "text": "appear"}, {"id": 1050, "start": 8053.72, "end": 8056.72, "text": "Shitdown. Ah nee, Shutdown."}, {"id": 1051, "start": 8073.72, "end": 8076.72, "text": "Ja. Ja gut, das ist so."}, {"id": 1052, "start": 8076.72, "end": 8079.72, "text": "Das, äh, das, äh, das ist so."}, {"id": 1053, "start": 8079.72, "end": 8082.72, "text": "Das war auch früher absolut ätzend unter Windows,"}, {"id": 1054, "start": 8082.72, "end": 8086.72, "text": "dass du keine ordentliche Shell hattest und keine ordentliches CLI-Environment."}, {"id": 1055, "start": 8086.72, "end": 8087.72, "text": "Das war richtig abartig."}, {"id": 1056, "start": 8087.72, "end": 8090.72, "text": "Also, WSL ist tatsächlich, was das angeht, zum ersten,"}, {"id": 1057, "start": 8090.72, "end": 8093.72, "text": "also WSL in Kombination mit dem neuen Windows-Terminal"}, {"id": 1058, "start": 8093.72, "end": 8097.72, "text": "ist tatsächlich zum ersten Mal was, wo ich sage, hey, das kann man benutzen."}, {"id": 1059, "start": 8097.72, "end": 8101.72, "text": "PowerShell ist auch gut, allerdings PowerShell ist für mich"}, {"id": 1060, "start": 8101.72, "end": 8104.72, "text": "keine interaktive Shell, die ich jeden Tag verwenden will,"}, {"id": 1061, "start": 8104.72, "end": 8109.72, "text": "sondern PowerShell ist für mich was, wo man Windows-Sachen automatisiert."}, {"id": 1062, "start": 8109.72, "end": 8112.72, "text": "Für Automatisierung ist PowerShell richtig gut,"}, {"id": 1063, "start": 8112.72, "end": 8117.72, "text": "aber als interaktive Shell, ich weiß nicht."}, {"id": 1064, "start": 8117.72, "end": 8119.72, "text": "Nee, eher nicht."}, {"id": 1065, "start": 8119.72, "end": 8121.72, "text": "Hier ist er ganz toll."}, {"id": 1066, "start": 8121.72, "end": 8126.72, "text": "Sag mal, hat er doppelt Sponsor? Sponsor? Sponsor?"}, {"id": 1067, "start": 8126.72, "end": 8128.72, "text": "Boah, der wills aber wissen, ey."}, {"id": 1068, "start": 8128.72, "end": 8130.72, "text": "Kek."}, {"id": 1069, "start": 8130.72, "end": 8133.72, "text": "Das ist ja ein Drittel von dem, was ich jetzt verstanden habe,"}, {"id": 1070, "start": 8133.72, "end": 8136.72, "text": "das ist ja ein Drittel von dem, was ich jetzt verstanden habe."}, {"id": 1071, "start": 8136.72, "end": 8138.72, "text": "Ich will jetzt mal sehen, was das ist."}, {"id": 1072, "start": 8138.72, "end": 8140.72, "text": "Und ich will jetzt mal sehen, was das ist."}, {"id": 1073, "start": 8140.72, "end": 8142.72, "text": "Und jetzt bin ich schon wieder da."}, {"id": 1074, "start": 8142.72, "end": 8144.72, "text": "Und jetzt bin ich schon wieder da."}, {"id": 1075, "start": 8144.72, "end": 8146.72, "text": "Und jetzt bin ich schon wieder da."}, {"id": 1076, "start": 8146.72, "end": 8152.72, "text": "Keck! Das ja ein Drittel von dem Video ist ja Sponsor und Intro und Outro! Wahnsinn!"}, {"id": 1077, "start": 8155.72, "end": 8157.72, "text": "Stonks! Ja so muss es sein!"}, {"id": 1078, "start": 8165.72, "end": 8166.72, "text": "Was ist das eigentlich?"}, {"id": 1079, "start": 8169.72, "end": 8170.72, "text": "Alright Sony!"}, {"id": 1080, "start": 8171.72, "end": 8173.72, "text": "Nintendo Direct vs. Sony Direct"}, {"id": 1081, "start": 8173.72, "end": 8177.72, "text": "5 Minuten! Hat eine gute Bewertung!"}, {"id": 1082, "start": 8180.72, "end": 8182.72, "text": "Also ich wurde vorher empfohlen. Schauen wir mal."}, {"id": 1083, "start": 8185.72, "end": 8187.72, "text": "Monkeys? What the hell?"}, {"id": 1084, "start": 8187.72, "end": 8194.72, "text": "What the hell?"}, {"id": 1085, "start": 8196.72, "end": 8197.72, "text": "What the fuck?"}, {"id": 1086, "start": 8197.72, "end": 8206.72, "text": "Hey! Nintendo, Nintendo, you better have something good."}, {"id": 1087, "start": 8206.72, "end": 8226.72, "text": "Ja gut, hey, das ist schon ziemlich starker Kontrast, aber du kannst doch auch nicht diesen Gramm vergleichen. Okay."}, {"id": 1088, "start": 8236.72, "end": 8243.72, "text": "Oh my god, oh my god. Nintendo, hey, Nintendo, you better have something big to go against that."}, {"id": 1089, "start": 8243.72, "end": 8265.72, "text": "Okay, das im Vergleich wirkt natürlich schon ein bisschen affisch."}, {"id": 1090, "start": 8273.72, "end": 8276.72, "text": "Noch mal, noch mal Farben! Alter, was bei Nintendo los?"}, {"id": 1091, "start": 8304.72, "end": 8306.72, "text": "Lass mich raten! Farbing Simulation?"}, {"id": 1092, "start": 8325.72, "end": 8327.72, "text": "Okay, das ist echt gut gemacht!"}, {"id": 1093, "start": 8327.72, "end": 8331.72, "text": "Farbing Simulation!"}, {"id": 1094, "start": 8331.72, "end": 8347.72, "text": "Please take a look at this lawn mowing game."}, {"id": 1095, "start": 8347.72, "end": 8361.72, "text": "You need a Mario Odyssey 2 moment now to redeem this. Come on now. Mario Odyssey 2, let's see this."}, {"id": 1096, "start": 8363.72, "end": 8365.72, "text": "Hey, das erste war gar nicht so schlecht!"}, {"id": 1097, "start": 8368.72, "end": 8372.72, "text": "I'm gonna say this. Didn't look like there was any farming in it."}, {"id": 1098, "start": 8372.72, "end": 8377.72, "text": "Farbing Simulation!"}, {"id": 1099, "start": 8377.72, "end": 8394.72, "text": "War Bayonetta nicht mal Switch Nintendo exklusiv oder so der zweite Teil?"}, {"id": 1100, "start": 8394.72, "end": 8399.72, "text": "Okay, okay Nintendo, that's an actual fucking video game. Let's keep the ball rolling. Come on."}, {"id": 1101, "start": 8399.72, "end": 8406.72, "text": "Farbing Simulation!"}, {"id": 1102, "start": 8406.72, "end": 8420.72, "text": "War Bayonetta nicht mal Switch Nintendo exklusiv oder so der zweite Teil?"}, {"id": 1103, "start": 8420.72, "end": 8437.72, "text": "Mario's Daylife!"}, {"id": 1104, "start": 8437.72, "end": 8452.72, "text": "Farbing Simulation!"}, {"id": 1105, "start": 8452.72, "end": 8471.72, "text": "Ich muss ehrlich sagen, ich konnte persönlich die Faszination an Pikmin noch nicht so ganz nachvollziehen, also mein Game war es noch nie."}, {"id": 1106, "start": 8471.72, "end": 8482.72, "text": "Ernsthaft! Ernsthaft! Oh, please!"}, {"id": 1107, "start": 8482.72, "end": 8497.72, "text": "Okay, okay, okay, okay."}, {"id": 1108, "start": 8497.72, "end": 8502.72, "text": "Alright, they're still making games, okay. I was worried for a bit there, they're still doing games."}, {"id": 1109, "start": 8502.72, "end": 8504.72, "text": "We won't be showing any gameplay today."}, {"id": 1110, "start": 8504.72, "end": 8506.72, "text": "Natürlich, was sonst, was sonst?"}, {"id": 1111, "start": 8506.72, "end": 8509.72, "text": "I also made a new t-shirt."}, {"id": 1112, "start": 8509.72, "end": 8512.72, "text": "Can you survive the season of death?"}, {"id": 1113, "start": 8512.72, "end": 8513.72, "text": "Farbing Simulation!"}, {"id": 1114, "start": 8513.72, "end": 8530.72, "text": "My question is can my channel survive the death of the video game industry?"}, {"id": 1115, "start": 8530.72, "end": 8538.72, "text": "Nein, please! Die Farbing Simulation wieder!"}, {"id": 1116, "start": 8538.72, "end": 8548.72, "text": "After this presentation, a demo containing the opening days of your farm's first season will be available on Nintendo eShop."}, {"id": 1117, "start": 8548.72, "end": 8552.72, "text": "Das ist aber mega gut geschnitten von dem Typ auch noch."}, {"id": 1118, "start": 8552.72, "end": 8554.72, "text": "Farbing Simulation!"}, {"id": 1119, "start": 8554.72, "end": 8555.72, "text": "Kill!"}, {"id": 1120, "start": 8559.72, "end": 8566.72, "text": "Aber da freue ich mich tatsächlich schon drauf. Das Problem ist, wahrscheinlich muss ich eine PS5 kaufen, nur für God of War."}, {"id": 1121, "start": 8566.72, "end": 8572.72, "text": "Oh, verdammt! Oh verdammt!"}, {"id": 1122, "start": 8572.72, "end": 8579.72, "text": "Die Kugeln!"}, {"id": 1123, "start": 8579.72, "end": 8585.72, "text": "Wir werden unser eigenes Destinieren machen."}, {"id": 1124, "start": 8585.72, "end": 8587.72, "text": "Verdammt!"}, {"id": 1125, "start": 8587.72, "end": 8596.72, "text": "Nintendo, du musst einen großen Farbing-Game zeigen."}, {"id": 1126, "start": 8596.72, "end": 8602.72, "text": "Ja, okay. Hey, den Trailer habe ich tatsächlich gesehen, da war nichts zu sehen."}, {"id": 1127, "start": 8602.72, "end": 8609.72, "text": "Ja, es war nichts zu sehen. Du hast gesehen, wie du auf irgendeinem Ding runterfliegst und das war's. Du hast nichts gesehen."}, {"id": 1128, "start": 8609.72, "end": 8612.72, "text": "Das war weniger Gameplay als Pikmin."}, {"id": 1129, "start": 8612.72, "end": 8623.72, "text": "Immerhin Ende 2023. Mal gucken, ob das dann auch so ist. Das Video war wirklich gut geschnitten. Ich habe weder die Nintendo Direct noch die Sony-Geschichte gesehen, aber das hat wirklich gut zusammengeschnitten."}, {"id": 1130, "start": 8623.72, "end": 8633.72, "text": "Und wahrscheinlich hat Nintendo zum größten Teil Farbing-Live-Simulation gezeigt."}, {"id": 1131, "start": 8633.72, "end": 8641.72, "text": "Das ist Mai? Moment, Moment. War das Kokona-Datum oder EU-Datum? Moment."}, {"id": 1132, "start": 8641.72, "end": 8646.72, "text": "Moment."}, {"id": 1133, "start": 8646.72, "end": 8649.72, "text": "Das war weniger Gameplay als Pikmin."}, {"id": 1134, "start": 8649.72, "end": 8656.72, "text": "Ah, Moment, Moment, Moment. Freedom Units. Es ist Kokona-Datum."}, {"id": 1135, "start": 8656.72, "end": 8663.72, "text": "Es ist der 12.5., nicht der 5.12. Ach so."}, {"id": 1136, "start": 8663.72, "end": 8673.72, "text": "Ja, seht ihr mal, wie bescheuert das ist, dass es Leute gibt, die Datumsangaben so unterschiedlich schreiben."}, {"id": 1137, "start": 8673.72, "end": 8677.72, "text": "Jetzt verstehe ich das."}, {"id": 1138, "start": 8677.72, "end": 8691.72, "text": "Es ist aber auch wirklich schwer zu erkennen. Ich meine, wenn du dir den Trailer auf Deutsch anguckst, steht dann da 12.5. da."}, {"id": 1139, "start": 8691.72, "end": 8704.72, "text": "Pains-Champ."}, {"id": 1140, "start": 8704.72, "end": 8709.72, "text": "Ja, Monatag. Hey, das ist insofern zumindest ganz gut. Das kann man am besten sortieren."}, {"id": 1141, "start": 8709.72, "end": 8721.72, "text": "Ja, also für Sachen, die sortierbar sind, ist es am besten. Und ganz ehrlich, das beste ist einfach EU-Unix-Timestamp. Scheiß drauf. Und von da alles ausrechnen."}, {"id": 1142, "start": 8721.72, "end": 8729.72, "text": "Einfach Zeit seit 1970."}, {"id": 1143, "start": 8729.72, "end": 8735.72, "text": "Was haben wir denn heute? Aha."}, {"id": 1144, "start": 8735.72, "end": 8740.72, "text": "Also das ist doch wirklich sehr griffig hier, oder? Findet ihr nicht auch?"}, {"id": 1145, "start": 8740.72, "end": 8752.72, "text": "1, 6, 6, 3, 4, 9, 2, 1, 6, 8. Sekunden seit 1.1.1970."}, {"id": 1146, "start": 8752.72, "end": 8761.72, "text": "Es ist so die Frage, ob Sekunden oder Millisekunden. Ja, das ist mittlerweile so lang, dass es auf den ersten Blick drei Stellen mehr oder weniger nicht direkt ersichtlich ist."}, {"id": 1147, "start": 8761.72, "end": 8781.72, "text": "Warum eigentlich 1970? Ich glaube, das wurde relativ willkürlich festgelegt. Man musste sich halt auf irgendwas einigen."}, {"id": 1148, "start": 8781.72, "end": 8794.72, "text": "Ja, gut. Ich meine, die Menschheit ist ja, wenn du nach Kreationisten bei den Amis gehst, ist die Menschheit ja glaube ich nur irgendwie 2000 Jahre alt oder 5000 Jahre oder so."}, {"id": 1149, "start": 8794.72, "end": 8803.72, "text": "Oder, ne, ne, ne, die Welt. Die Welt ist 5000 Jahre und die Menschheit ist 2000 Jahre. Irgendwie so ganz, ganz weird champste Theorien, die es da gibt."}, {"id": 1150, "start": 8803.72, "end": 8817.72, "text": "Vor 1970 gab es keine Zeit, richtig? Oder 12.000 Jahre, ja. Die haben, ich weiß nicht, wen sie den zehn geschissen haben."}, {"id": 1151, "start": 8833.72, "end": 8847.72, "text": "Hast du schon mal das Video gesehen von der Aua? Ne, wir haben lange vom Bauer nichts mehr geguckt, fällt mir da ein."}, {"id": 1152, "start": 8847.72, "end": 8871.72, "text": "Wo zerschneiden sie irgendwelche CPUs? Dicker Heatspreader. Mitte zweite Reihe."}, {"id": 1153, "start": 8871.72, "end": 8881.72, "text": "Das da? Okay, wir spulen jetzt mal kurz vor, wo sie es zerschneiden."}, {"id": 1154, "start": 8881.72, "end": 8907.72, "text": "Wo wird zerschnitten? Ich will sehen, wo zerschnitten wird."}, {"id": 1155, "start": 8907.72, "end": 8926.72, "text": "Was wir hier aber auch sehr schön wieder sehen können, sind die Pads am Rand, die wir gerade unter dem USB Mikroskop schon gesehen haben, für die Kontaktierung nach außen."}, {"id": 1156, "start": 8926.72, "end": 8942.72, "text": "Zwei Ebenen von Leiterbahnen. Haben die jetzt schon zerschnitten? Oder nicht? Wo wird zerschnitten?"}, {"id": 1157, "start": 8942.72, "end": 8956.72, "text": "War drauf hier. Ich glaube, man sieht da gar nicht, wo großartig was zerschnitten wird, oder? Man guckt sich einfach vorher und nachher an."}, {"id": 1158, "start": 8956.72, "end": 8983.72, "text": "Was sieht man da? Das ist das, was mich interessiert hätte. Abgeschaltet. Der größte Skandal der COD-Geschichte. Das ist vielleicht etwas zu übertrieben, aber warum man bei so einem neuen Game die Server abschaltet, verstehe ich auch nicht."}, {"id": 1159, "start": 8983.72, "end": 8999.72, "text": "Das sieht aus, das sieht aus wie MW1, oder? Das sieht aus wie ein Map Pack zu MW1. Kein Unterschied. Ernsthaft. Kein Unterschied. Sieht das irgendwie nennenswert an? Nee, oder?"}, {"id": 1160, "start": 8999.72, "end": 9019.72, "text": "Das sieht exakt genauso aus. Haben die wieder dieses komische Geslide drin? Also klar, das Overlay ist exakt das gleiche. Also das ist wirklich..."}, {"id": 1161, "start": 9019.72, "end": 9044.72, "text": "Okay, es ist wieder der gleiche Shit. Du siehst die Gegner nicht. Du siehst wieder die Gegner nicht."}, {"id": 1162, "start": 9044.72, "end": 9053.72, "text": "Woher weiß der, dass da was ist?"}, {"id": 1163, "start": 9053.72, "end": 9080.72, "text": "Okay, immerhin. Immerhin, sowas funktioniert. Ah, Sliding gibt es nicht mehr, okay. Aber die Maps sind auch wieder so, dass jeder in irgendeiner Ecke campt und um die... und ein Head klitscht um die Ecke. Das hat mir persönlich im MW2-Multiplayer nicht so wirklich gefallen."}, {"id": 1164, "start": 9080.72, "end": 9085.72, "text": "Der Head klitscht sich einen ab."}, {"id": 1165, "start": 9085.72, "end": 9114.72, "text": "Oh, naja gut. Es sieht aus wie MW1. Also das, 2019 MW1. Time to kill ist sehr kurz, das habe ich auch schon gesehen. In einem anderen Video, da wird's quasi... da streckt dein Kopf um die Ecke, Insta... Insta... Deine Hand um die Ecke, Insta-dead."}, {"id": 1166, "start": 9114.72, "end": 9143.72, "text": "Leute, ich muss aufs Klo."}, {"id": 1167, "start": 9143.72, "end": 9158.72, "text": "Ich glaub, wir hören jetzt schon auf zu streamen. Ich muss aufs Klo. Und danach muss ich Mittagessen machen. Ich hab Hunger. Das ist die wichtigste Kombination. Erst aufs Klo und danach gleich noch wieder was rein."}, {"id": 1168, "start": 9158.72, "end": 9186.72, "text": "Ja, wir haben ein bisschen früher angefangen. Wisst ihr, was mir einfällt? Eigentlich müssten wir wirklich mal Battlefield 2042 Season 2 ausprobieren, aber ich hab keinen Bock. Ich hab keinen Bock."}, {"id": 1169, "start": 9186.72, "end": 9196.72, "text": "Lieber nicht. Ja, hast recht."}, {"id": 1170, "start": 9196.72, "end": 9215.72, "text": "Ja, ich hab einen Surface Book jetzt bekommen. Da will ich mir Linux draufhauen. Mal gucken, wie gut das funktioniert."}, {"id": 1171, "start": 9215.72, "end": 9225.72, "text": "Okay Leute, wisst ihr was? Ich geh jetzt aufs Klo. Wir sehen uns vielleicht später. Oder eher nicht, weil ich hab schon ein paar Mal jetzt sonntags gesagt, wir sehen uns später und ich glaub, wir haben uns die letzten drei Male später nicht gesehen."}, {"id": 1172, "start": 9225.72, "end": 9229.72, "text": "Das muss ich ausprobieren. Das muss ich ausprobieren."}, {"id": 1173, "start": 9229.72, "end": 9240.72, "text": "Ich werde sehen, wahrscheinlich geht das. Vielleicht gehen manche Geräte nicht, aber gut."}, {"id": 1174, "start": 9240.72, "end": 9243.72, "text": "SurfaceDB"}, {"id": 1175, "start": 9243.72, "end": 9246.72, "text": "Ja Leute, wir sehen uns bis dann. See you."}]}