{"text": "Oh, ich muss das Herz halt entknoten. So, entknoten das Headset am Start. Und wie läuft's? Warum lernst du? Willst du immer spezielles machen? Interessiert es dich einfach? Oder musst du? Muss du? Aus irgendwelchen Gründen? Du musst. Das ist problematisch. Berufsschule, äh ja gut, Berufsschule. Für die Berufsschule musst du nix großartig lernen. Berufsschule macht man auf einer Arschbacke. Da kommt du über drei Hello World Print-Zeilen nicht raus in den drei Jahren. So und was gibt's Neues Leute? Du kannst jetzt einen Raspberry Pi 4 für 180 Euro kaufen. Wo wir gerade dabei sind, also richtig unsinnig. Also wer aktuell keinen Raspberry Pi hat, dem kann ich echt nicht empfehlen, sich einen Raspberry Pi zu holen. Ich meine 180 Euro für einen Raspberry Pi, die sind wirklich, die sind wirklich nicht mehr ganz bei Sinn. Guckt euch das mal an. Guckt euch das mal an. Okay, den 4er gibt's für 123 Euro und das ist tatsächlich noch relativ günstig. Normalerweise kostet die 4GB Variante glaube ich 45 Dollar oder sogar nur 35 Dollar. Zero 2W habe ich tatsächlich welche hier, weiß ich nicht, was die aktuell kosten. Ah okay, kostet das doppelte, kostet das doppelte von, ist nicht verfügbar. Ja Zero 2W habe ich hier zwei Stück hier liegen, habe ich mir direkt zur Release gekauft, als es die gab. Weil ich mir dachte, das kannst du bestimmt nochmal gebrauchen. Ich glaube ich mache jetzt doch mal ein paar Tabs zu, es wird mir ein bisschen viel. Ja ja, ich habe mein eigenes Video an, Cringe, ich weiß auch nicht warum. So, erkennt man jetzt schon ein bisschen was, nee okay, aber hier mal zu. Machen wir mal das. So, mal den ganzen Crap hier schließen, ich brauche aber eh nicht mehr alles zu machen hier. Bäm. So, jetzt erkennt man jetzt ein bisschen was oben wieder. Ja, habe ich, ist nicht meins, habe ich auch schon im Vorfeld gesagt, so Reality Sachen, das ist, das kannst du prinzipiell ja eigentlich gescheit nur im Team spielen, das wäre noch nicht so wild, aber es ist halt, sagen wir mal so äußerst langsam und gestellse alles, das ist nichts für mich. Ich mag das, dass ich erkenne wo die Gegner sind, die mich beschießen. Dankeschön für den Sub, ich mache mal schnell ein paar Updates, wobei ich kann nicht, mein Terminal ist blockiert. So, kurz eine Runde Updates, ich glaube das haben wir gestern schon gemacht, aber ich glaube wir haben gestern versucht vergessen zu restarten, kann das sein, irgendwie fühlt sich die VM ein wenig laggy an und ich weiß nicht genau warum, Firefox laggt rum ein bisschen, es ist der Twitch Chat, der rum laggt, äh ich reboote mal, schade ja nichts, moin hast du für deinen Cuddy Server die DNS Challenge für Let's Encrypt, da kann es doch keiner was darunter vorstellen, dass ich das noch nicht gehört habe, höchstwahrscheinlich verwendest du das mit Let's Encrypt oder hast du was eigenes, ja weißt du wie man das ganze testet, ja mit Let's Encrypt kannst du die Staging Server nehmen von denen, Let's Encrypt hat Staging Server, damit ist das deutlich großzügiger was du für Zertifikate machen darfst am Tag, guck 30.000 pro Woche das sollte ausreichen zum testen würde ich sagen, weil ich glaube ansonsten sind es 300 oder so pro Woche bei den echten Let's Encrypt Dingern, du du du, ja teste es mit den Staging Servern, teste es mit den Let's Encrypt Staging Servern und dann, wenn alles funktioniert, dann stell um auf die Live Server und du kannst ja auch ein paar mal testen, dann blocken die dich nicht, die blocken ja generell keinen, die haben halt Rate Limits und du wirst ja nicht wirklich geblockt, du kriegst halt für ja quasi 8 Tage kein Zertifikat, das ist dann halt das blöde da dran, oh, du du du du, Restore, so ich hoffe den Twitch Chat brauche ich hier eigentlich nicht, wobei, warum eigentlich, lass mal den Twitch Chat hier auch mal auf, so, ich kann den Twitch Chat hier nicht aufmachen, ich hab hier nicht mal FFZ, Moment, ich hab Better Twitch TV, ok, soll mir auch recht sein, hab ich Better Twitch TV, nice, weiß nicht so genau warum, aber anscheinend ich hab Better Twitch TV drauf, gut, es ist wahrscheinlich so essential schon, ich hab wahrscheinlich schon in der Default Installation, in meinem OS Image ist wahrscheinlich schon FFZ drinne, so, machen wir den Krempel von gestern mal auf, zack, ich hab mich jetzt auch angemeldet, mein Go Land ist jetzt, guck, ich kanns euch zeigen, hab mich vorhin mal eingeloggt, mein Go Land ist jetzt registriert bis 19. Juli, was, Subscription expired, ich hab mich eben eingeloggt, ich hab mich eben eingeloggt mit im Jetbrains Toolbox, also backt das noch rum oder was, keine Ahnung, kein Schimmer, nice, so muss das sein, ich hoff du hast im Vorstellungsgespräch auch gesagt, du hast Wupplo aus Prime subscribt, das gibt extra Punkte, muss ja nicht stimmen, ja, aber, dann sagen die, jaja, klar, Pfeifert, den wollen wir haben, doch, doch, das, achso, Moment, jaja, gut, wenn du es testest, erneuerst du ja nicht, richtig erneuern kannst ja bloß alle 30 Tage, dann musst du, musst du, ne, das stimmt, aber wenn du es testest, dann schmeißt du die Zertifikate ja weg und lässt sie dir für die gleiche Domain neu ausstellen, immer wieder, bis es geht, also ich hab WSL, sowohl auf der Arbeit als auch hier, aber ich benutze WSL eigentlich nicht, ich benutze so meine Linux VM, WSL, WSL ist so das so halbherziges Zeug, weiß nicht, WSL ist so besser als nichts, aber auch nicht so das ganze, so, weiß nicht, mir ist ein vollständiges Linux in der VM tatsächlich immer noch lieber, Alter, ich hab Anfälle gekriegt mit Rust, ich hab mir das jetzt ja Offstream nochmal angeguckt und ich hab versucht Webrequest zu machen, Alter, wie kompliziert kann man es machen, einfach Webrequest, ich, okay, ich war dumm, ich wollte Async, Webrequest machen, die Synchronen gehen ja noch halbwegs, aber ganz im Ernst, Alter, was das, was das ist, guckt euch das mal an, eQuests oder so, komisch heißt dieses Package, Await, ganz, ganz abartig, ja genau das meine ich, guckt euch das mal an, ganz im Ernst, die haben sie nicht mehr alle, ja, das sieht erstmal easy aus, ja, bis du dann feststellst, das Beispiel funktioniert so ohne weiteres gar nicht, weil du Tokyo nicht installiert hast und Async darf nicht Main sein, stellt man dann fest und dann stellt man fest, was zum Teufel ist Box, dünn, Standard, Error, Error und dann wird man feststellen, ach fuck, es geht ja nur, wenn das Fragezeichen hinten am Await dran ist, dass er das anpackt in den Error, das heißt, wenn du was anderes als Return Word irgendwo hast außer Box, dünn, Standard, Error, Error, dann funktioniert es nicht, also ganz ehrlich, das ist wirklich, das ist echt Way to Dank, ja, warum haben wir das eigentlich mal als E-Mode, ich hatte das doch mal als E-Mode, jetzt haben wir es wieder, jetzt haben wir es wieder, ja, wir müssten das, wir müssten das eigentlich haben, haben wir aber nicht, ich hab's jetzt, Leute Refreshed mal und probiert noch mal aus, ich hab's jetzt aktiviert, Way to Dank, jawoll, ne Moment, die Animation fehlt, eigentlich sollte es eine Animation haben, oder, ach, ich hab das falsche, Leute, ich hab das falsche geedit, ich hab das falsche geedit, ich hab das ohne, ich brauch die Animation, haben die das irgendwie entfernt, ok, ich hab's wieder geedit, jetzt mit Animation, testen wir noch mal, oh, jetzt hat's noch gar nicht gecheckt, noch nicht, aber ich hab's geedit, jetzt hab ich am Better Twitch TV geedit und Better Twitch TV checkt's noch nicht, alter, was ist hier los, ohne ordentlichen E-Mode Support geht hier nix, eh, ja, anscheinend, ich hab's jetzt aber aktiviert, das hatten wir auch schon mal aktiviert, ich glaub, das haben die entfernt oder das, was ich hinzugefügt hab, hatten die entfernt, keine Ahnung, so, jetzt machen wir hier mal n bisschen zu, guck mal hier, was hier schon wieder, ich hab hier 30 Milliarden Tabs auf, gut, so, oh man, muss erst mal in Broggers Stimmung kommen, Leute, Gachibas, gibt's Neuigkeiten zum Job, seitdem die Homeoffice Pflicht wieder eingeführt wurde, die wurde doch gar nicht wieder eingeführt, es wird doch wieder nur empfohlen, das zu machen, oder, Moment, Homeoffice, das ist doch wieder so komplettes Wischiwaschi gewesen, ach so, die Office Pflicht, ja, gut, ne, gibt's nix Neues, wie gesagt, also, außer, dass ich garantiert nie wieder, komplette Woche irgendwie nach Frankfurt gehe, aktuell, eins, zwei Tage die Woche, Office, und wenn das in irgendeiner Art und Weise weiter forciert wird, bin ich weg, also, dass noch mehr, noch mehr gemacht werden soll, Cookie, Dankeschön für den Sub, gibt es irgendwie Spezialeinstellungen um ihn vor allem, ja, musst du, du musst, folgendes musst du machen, also, erstens solltest du kein Gnome verwenden und auch kein KDE, vor allem nicht mit Effekten an, das funktioniert, funktioniert auch ganz brauchbar, aber macht's unnötig langsam, am besten du verwendest irgendwas mit Low Performance Impact, sowas wie XFCE oder so, oder wie ich, irgendwas mit i3, und das wichtigste ist, du musst das hier einschalten, das erste Mal, du gibst dem Ding immer ordentlich CPUs, so, und du gibst dem Ding auch immer ordentlich RAM, also, ich hab vier CPU, kein 16GB RAM, das ist schon mal gut, und das musst du hier machen, Accelerate 3D Graphics, und dann kannst du sowas wie Peacom oder so starten, in deiner Linux Kiste, dann hast du auch ein bisschen Transparenz und das Ganze ist schneller, aber das musst du auf jeden Fall, das Häkchen hier musst du auf jeden Fall setzen, glaub das war's, mehr war's nicht, QEMU ist fucking langsam, was ganz gut ist, ist KVM, was, ich sag mal so, Teile von QEMU verwendet, aber QEMU selbst ist wirklich das Langsamste, was es gibt, aber ernsthaft, Desktop-Virtualisierung ist, also man darf von abgesehen, dass es kein KVM unter Windows gibt, aber Desktop-Virtualisierung ist Forever Workstation und Virtual Box immer noch besser, ja dann gibt der vm8 oder so, das reicht ja, hat schon mal jemand von euch versucht mit QEMU ein Raspberry Pi zu emulieren, also quasi eine Armkiste auf x86, ich sag euch, das ist an Langsamheit kaum zu überbieten, oh Leute irgendwie bin ich müde, ich weiß nicht warum, als ich angefangen hab zu streamen, weil ich es noch nicht, ich muss jetzt erstmal irgendwie, wir müssen jetzt irgendwie mich aufwecken, weil sonst ist Badge, Alter, bevor wir anfangen, weil wenn ich müde bin, kann ich nicht gescheit nachdenken, wenn ich nicht gescheit nachdenken kann, dann kann ich nicht keinen Brokker-Stalls machen, bist du um 18 Uhr aufgestanden? Nee, ich nicht, ich bin ganz normal aufgestanden, halb 8, fertig, so wie immer, da selbstfalls kein Aufwachstream gab, ja gut heute ist Samstag, morgen gibt es den Aufwachstream, ich trinke keinen Kaffee, ich bin glaube ich der einzige Informatik-Kurs, der keinen Kaffee trinkt, ja genau, ist Informatik Studierend Pflicht um einen Job zu finden? Nee, ist es nicht, wer sagt denn sowas, das ist Schwachsinn, also falls das irgendjemand erzählt hat, ist Blödsinn, muss keine Informatik studiert haben, da bist du mit Low Power x86 Kisten billiger dran, aktuell als mit Raspberry Pis, Low Power x86 Kiste, x86 Board mit drauf gelöteter CPU, 60 Euro, Raspberry Pi 140, richtig sinnlos, warum geht Way to Dank immer noch nicht, ich hab's geadded, es ist einfach Way to Dank, ist einfach zu langsam, wie das geadded wird, ja 2GB ist, naja gerade mal so, ich sag mal so die 2GB Variante, ist normalerweise kostet die Hälfte oder so, für den Preis gibt es normalerweise die 4GB Variante, aber gut, gibt es den überhaupt bei Berry Base aktuell, das letzte Mal wo ich geguckt hab, war eigentlich so gut wie gar nichts lieferbar, was ist mit der Seite los, ich hatte ja mal gescheit suche hier, naja, gibt's doch gar nicht. Gibt's doch überhaupt nicht, alles nicht verfügbar, also ich weiß nicht wie du drauf kommst, dass es das gerade gibt, also das sieht für mich nicht so aus, als gibt es das gerade, man muss sich in Berry Base Club anmelden, da sieht man Sachen die man nicht auf ihrer Homepage sieht, das ist aber auch ziemlich bescheuert, die Leute wollen sich da nicht im Club anmelden um was zu kaufen, dann kaufe ich da halt nichts, doch, doch sind Mods da, was ist da die heutige Aufgabe, da hab ich ein Video zugemacht, guck mal, weiß der Titel nicht, hier das da, kannst du dir angucken, das ist so, ich hab bestimmt die Hälfte vergessen, aber das passt schon, achso, weil Modcheck, ne, sind kein Raspberry Pi Stars, der Berry Base Club, was nicht alles gibt, ok Moment, Berry Base Club, wir melden uns jetzt mit beim Berry Base Club an, wo geht das, Berry Base Club, das da, alter was ist das für ne Zeit, jaja ich will Club Mitglied werden unbedingt, alles klar, Sekunde, 10 Minute Mails, also ich bin Privatkunde, Anrede, Divers, Titel, Omega, Omega, Keg, W, in die Zwischenablage kopieren, zack, ihr Passwort, ok ich geb mal random irgendwas ein, oh mein Gott, überprüfen die das mit dem Telefon, ich hoffe nicht, Moment, ist das hier Passwort, ne E-Mail Adresse, achso, ihre Adresse, ok, jaja, der Maker Club, alles klar, Straße, Cackle Street 1, 60329 Frankfurt, Hessen, Deutschland, Frankfurt, Geburtsdatum 18.10.1953, jaja schickt mir alles, weiter, vielen Dank für eure Anmeldung, ok, noch ist nichts da, so und jetzt seh ich was oder wie, ah haben sie gut überprüft, jaja gut, alles klar, so Maker Club, ok, ich überprüfen es tatsächlich, ja da wird das wohl eher nix, ja gut, dann, ok, dann, ok, dann nicht, na gut, also, dann wollen wir mal, habt ihr, achja, Chet, ich bin ja da immer nicht so auf dem Laufenden, ich hab nur wieder heute Morgen den Fehler gemacht und hab auf Twitter Deutschland geguckt und da war Lindner Gate am Trenden, was hat er denn angestellt, hat er noch mal geheiratet oder was ist jetzt schon wieder los, eine Frage zu VMWare, worin unterscheidet sich Number of Processors und Number of Corporate Processor, das ist rein für die Optik, was die VM sieht, was du hier weiter gibst, ist die Anzahl der CPUs, die deine VM sieht und das hier, wie viele Cores pro CPU, also wenn du zum Beispiel zwei Prozessoren einstellst mit zwei Cores, dann siehst du in deiner VM, na gut, zwei CPUs mit jeweils zwei Cores, also insgesamt vier, wenn du eine CPU einstellst und vier Cores, dann siehst du auch vier Cores, allerdings nur von einer CPU, das macht nicht wirklich einen großen Unterschied, ich stelle in der Regel immer CPU Cores ein, weil Boards und mit Multi-CPUs so gut wie kaum im Einsatz sind und falls irgendwie deine Software trotzdem nachguckt, ist es immer besser eine CPU mehrere Cores zuzunehmen, wegen E-Fuels, ja E-Fuels sind nicht so beliebt, Tainser, danke schön, danke für den Sub, warum eigentlich, also Leute, ihr wisst, ich fahre so gut wie kein Auto, mich interessiert auch das ganze Autothema nicht wirklich großartig, was ist an E-Fuels so schlimm, ja vielleicht hat es auch irgendwelche Vorteile, keine Ahnung, der Wirkungsgrad sackt extrem, also wenn ich das richtig im Kopf habe, E-Fuels ist doch die Geschichte, die man quasi in normale Autos tanken kann, was aber jetzt nicht klassische Benzinsachen sind, sondern halt hergestellt aus Strom und Zeug, also quasi, sagt wenn ich Scheiße erzähle, kann sein, ich habe keine Ahnung von dem Thema, also sprich, so klassischer Treibstoff für Boomer-Auto, Autos auf neue Art und Weise hergestellt, aber guckt mal, warum ist das schlimm sich in dem Bereich irgendwie Gedanken zu machen, also ich finde es jetzt erstmal nicht so verwerflich, also ich meine vielleicht fällt hier irgendeinem voll das krasse Rezept für E-Fuel ein, dass das, keine Ahnung und vor allem wenn die Energie aus erneuerbaren Energiequellen hergestellt wird, ist das doch wahrscheinlich auch gar nicht mehr so schlecht oder, weil ich meine bis alle Autos durch Elektroautos ersetzt sind, das wird doch auf jeden Fall noch ziemlich lange dauern, ist für Laster und Flugzeuge gedacht, ja gerade die wirst du wahrscheinlich nie, gerade Flugzeuge wirst du nie durch Elektroflugzeuge ersetzen gescheit, also Elektroflugzeuge funktioniert nicht gescheit, also weiß nicht, ja gut ich weiß jetzt auch nicht was da war, aber das klingt jetzt erstmal gar nicht so bescheuert sich damit zu beschäftigen, ja ja ich meine es gibt doch tausende, wir wollen ins Weltall fliegen, Startups und außer SpaceX hat da glaube ich doch keiner gescheit was hingekriegt oder wir bohren Tunneln und machen Überschall Füge rein und sowas, ja ich wie gesagt ich kenne mich da mit null aus, aber was ist denn wenn jetzt irgendeiner super krasse neue Verfahren findet das herzustellen, vielleicht ist das besser, also was ich meine ist ich weiß ja nicht was die vorhaben ja, aber vielleicht ist es sinnvoll in dem Gebiet trotzdem weiter zu gucken, ja gut das ist leider überall so, finde ich auch kacke, an so vielen Stellen guckt euch das an mit irgendwelchen Corona medizinischen Maskenherstellern was da gelaufen ist mit ja wir vergeben den Auftrag zufällig an einen den wir kennen aber auch nur weil es der beste ist, ja ganz bestimmt, weil ich glaube halt das noch ganz schön lange selbst wenn jetzt der Elektroauto Hype Train angelaufen ist und viele neue Elektroautos sind aber also ich glaube nicht das jetzt so kurz oder lange alles Elektroautos sein werden, ich meine die Leute die ein gut funktionierendes Auto haben mit klassischem Motor die werden sich jetzt ja kein Elektroauto kaufen, zumal das wahrscheinlich ja jetzt wie gesagt erzählt mir wenn ich das erzähle aber wahrscheinlich ist die umweltschonendste Variante immer noch das alte Auto weiter zu fahren ich meine das Ding ist schon produziert das Ding hat schon verbraucht an Ressourcen also sich ein neues Auto kaufen kann wahrscheinlich gar nicht umweltfreundlicher sein als das alte weiter zu benutzen bis es auseinanderfällt, ja gut dann kauft sich das ja auch wirklich kein Mensch, naja aber wenn e-fuels dann umwelt irgendwann mal vielleicht umweltfreundlicher werden als klassische Benzin und Diesel und Super und alles, ja das kannst du vergessen da kommst du ja nie an, ich hab da meine Erfahrung kannst du ja knicken, ich weiß ich hab aber es ist halt mega für den Arsch und das ist eigentlich das was mich bei dieser ganzen Diskussion immer am meisten auf den Sack geht, dass immer nur gesagt wird so nach dem Motto ja da müssen wir halt gucken dass der öffentliche Nahverkehr verbessert wird es verbessert keiner was das wird seit Jahren immer beschissener, die Leute das labern fahren selbst überhaupt nicht mit dem Zug, ja das ist natürlich beschissen das 9 Euro Ticket sollte unbedingt da bleiben, vielleicht nicht als 9 Euro Ticket, vielleicht als keine Ahnung 90 Euro Ticket, 90 Euro für deutschlandweit wäre immer noch viel billiger als was die meisten Leute an Monatskarten kaufen, 90 Euro deutschlandweit wäre richtig Pog, ja sowas ist gut, das ist dann das scheitert aber ich finde es muss deutschlandweit sein weil das scheitert sonst oder 69 Euro Ticket das wäre gut, weil sonst scheitert das wieder bei Leuten die bei mir ja um die Ecke in Bayern wohnen und zwei Stationen durch Bayern fahren müssen und den Rest nach Hessen zu Frankfurt und so, das ist wieder unglaublich Bürokratie und behaftet, deswegen 90 Euro deutschlandweit scheiß drauf fertig, dann benutzen das die Leute auch mal und vielleicht merkt dann auch mal ein Großteil der Bevölkerung was für absolut bodenlose Frecher und was für bodensatz die Bahn ist und dann tut sich vielleicht mal irgendwann was, ich glaube ohne mehr Druck aus der Bevölkerung tut sich da nichts, meint ihr, jetzt mal blöd, meint ihr, meint ihr, die Bahn, das Bahnmanagement, sagen wir mal so mittleres, oberes Bahnmanagement, Vorstand, Führungskräfte und so, meint ihr die fahren mit der Bahn zur Arbeit, die die können, ernsthaft jetzt, weil ich kann es mir nicht vorstellen ehrlich gesagt, also da wo ich fahre geht nichts mit der Bahn, kannst du knicken, das ist das falsche Projekt, das ist pepo fetter, wir wollen nicht pepo fetter aufmachen, wir wollen den postchamp aufmachen, der muss postchampen, postchamping, kannst du ja auch nicht machen, du fährst ja auf den Gleisen von der deutschen Bahn, das ist ja das Problem, es gibt ja Sachen wie Flixtrain oder bei uns die hessische Landesbahn oder so Trittanbieter, die aber die Gleise benutzen und das ist das eigentliche Problem, spukige Musik, viel zu spukig, privat Gleise, das hat noch keiner gemacht bisher, das wird auch die nächsten 40 Jahre dann wahrscheinlich nix, ich sehe das übrigens genau, sehe ich übrigens auch so, es muss deutlich mehr persönliches Interesse her, der Bahnmanagements die Sache ordentlich zu managen, das muss ganz klar persönliche Interessen daran hängen und sei es nur, dass man seinen Job behält, ja guck mal in die Schweiz, da funktioniert das auch besser, das funktioniert eigentlich in allen Ländern mit Geld besser als bei uns und es ist ja nicht als hätten wir zu wenig Geld, wie gesagt ich kann es nicht oft genug sagen, wir sind zumindest was Wirtschaft angeht das viertreichste Land der Welt, aber im Moment Leute wir müssen uns ja aktuell Gedanken drüber machen, dass wir nicht frieren müssen im Winter, ich kann es vergessen, als viertreichstes Land der Welt kann es schon mal passieren, dass man frieren muss im Winter, das ist tatsächlich, das habe ich auch gelesen und die Telekom verdient angeblich richtig fett Geld in den USA mit, weiß ich, ist es Mobilfunk, keine Ahnung, mit Zeug, die sollen alle mal ihren Scheiß zusammen kriegen und hierfür ordentliche Infrastruktur sorgen, das geht mir mega auf den Sack, dass du dir hier teilweise vorkommst, wie irgendwie in einem dritten Weltland was Infrastruktur angeht, Müsli, danke schön für den Zap, so aber jetzt mal zu etwas erfreulicheren Themen, wir basteln jetzt, wir basteln jetzt ein bisschen Go weiter und ich habe festgestellt, als ich mir mal so Gedanken gemacht habe gestern über Go, es ist ja schön und gut, wenn man hier irgendwie so Skriptartig, warum ist denn da hinten so ein, aber ich das minimiert habe, es ist ja schön und gut, wenn man solche Skriptartigen Dinger basteln kann, aber wie würde man denn jetzt zum Beispiel eine Klasse mit unterschiedlichen Methoden machen in Go, ich glaube das müssen wir uns mal angucken, also in Go scheint das ja nicht zu funktionieren, ja Structs und dann Zeug, das müssen wir mal ausbringen, ich habe wirklich keine Ahnung wie das geht und wenn man sagt Go Lang OOP, da findet man zum größten Teil sehr merkwürdige Beispiele, so irgendwas was ich sehr komisch liest und ich bin nicht so sicher, ob das so funktioniert, ich habe mir gedacht wir könnten ja mal versuchen diese API hier zu rappen, die wir hier verwenden, also sowas hier zum Beispiel, Type, Alert Manager, API, Struct und jetzt hört es schon auf, jetzt weiß ich nicht mehr wie es weiter geht, ok Name, String, ok da kann man dann sowas reinschreiben wie, 100 Milliarden Bits, Dankeschön Schattenwellen für den Sub, äh nicht für den Sub, für die Bits, Pong, oh guck mal hier gibt es ein Tutorial, excellent, excellent, der Chat weiß Bescheid, also what, Moment ich versuche das mal kurz zu übersetzen, also Alert Manager, warum sind manche, guck mal Leute das verstehe ich nicht, Sachen wie FMT, die sind klein geschrieben, aber jetzt hier werden Typen groß geschrieben, was ist denn Convention so, also schreibt man das groß, schreibt man das klein, wobei wartet mal da war doch was, da war doch was, das war doch irgendwie ein Unterschied, wenn ich das richtig in Go habe, genau, groß ist exported, stimmt, stimmt, ja ja ich erinnere mich, also machen wir hier Alert Manager, API, Struct, Ull, so und jetzt kann ich, wie mache ich denn einen Constructor in, also hier guck mal sowas zum Beispiel, die Errors, New, so wie kriege ich so eine Art Constructor hin, also was ich vor habe ist, ich will dann sowas hier machen können, guck mal, ich will dann sowas machen können wie API, Get, Silences, so und vorher will ich machen API, Doppelpunkt, Alert Manager, so was hier, New, Alert Manager, API, aber das gibt es nicht, das gibt es nicht, also ich weiß, dass man, dass man dann irgendwie sowas hier machen muss, aber gemacht habe ich das noch nicht, also so, Alert Manager, der Chat weiß Bescheid, ich copy paste jetzt einfach aus dem Chat, easy, Chat copy pasting, beste, aber das war weg, As Manager, achso, das ist hier die Variable, wie das intern heißt, so, dann wahrscheinlich so, also dann sage ich sowas wie String, so, ne oder, return, ne, so funktioniert das schon mal nicht oder, muss ich das, muss ich das return, muss ich das irgendwie so, ok und jetzt, und jetzt kann ich machen was, Alert Manager, API, ne, ne, ach, ahja, ahja, ok, verstehe, String, Kackel, fertig, ne, doch, ne, was, hä, wie nicht genug Argumente, aber nur eins, hä, wait a minute, ich muss Alert Manager übergeben, um einen Alert Manager zu bekommen, muss ich, muss ich irgendwie, muss ich irgendwie, what the fuck, das change nicht new, so, so, ne oder, das kann doch nicht in den Ernst sein, ne, ne oder, das, ne, Moment, das muss ich jetzt, go lang constructor, was ich prokramiere ist ein Tool, wo du, ähm, muss ich dir, muss ich dir zeigen, ach, muss ich erst mal starten, Leute, ich glaube, ich, das wird heute nichts, ich bin heute nicht irgendwie geistig so zurechnungsfähig, dass ich sinnvoll was machen kann, ne, ne, ich glaube, das wird heute nichts, aber ich kann dir erklären, was ich mache, also, bei uns auf der Arbeit ist öfters das Problem, also stell dir vor, du machst Wartungsarbeiten auf einem System und es ist ja so, dass wenn du Systeme hast im Enterprise Business Umfeld, diese Systeme werden ja überwacht, meistens automatisch von irgendeiner Monitoring Software, das heißt, wenn das System kaputt geht, bekommt man das mit und nicht erst, wenn dich irgendeiner auf der Hotline anruft und sagt, Alter, warum geht dein Service nicht mehr, was bei uns jetzt oftmals das Problem ist, dass die Leute, wenn sie Wartungsarbeiten an dem System machen, vergessen das Monitoring auszuschalten oder Silence reinzustellen, dass es nicht anschlägt für das System, auf dem sie Wartungsarbeiten machen, Python Version anfangen, oh ne Leute, ich weiß nicht, was wir heute machen, ich kann irgendwie nicht denken gerade, man müsste das in ein neues Package auslagern, das erinnert einen dran, naja, es erinnert einen nicht wirklich dran, es macht es einfach, von der Kiste selbst sowas zu setzen, da musst du nicht erst anrufen oder in Webinterface oder so, wir haben ja auch schon was, was funktioniert, ja, ich habe eine.NET Variante davon, die funktioniert ohne Probleme, oh ne, ich glaube, ich kann noch nichts machen, ich kriege heute nichts auf die Reihe, ich merke, dass es gibt so Tage, da habe ich nichts, kann ich mich nicht konzentrieren, habe irgendwie nichts im Kopf, um sinnvoll was zu machen, ich weiß nicht, gibt es irgendwas auf YouTube, was man gucken könnte, GpnEasy VPN, WireGuard wahrscheinlich, PowerShell Syntax, ja PowerShell Syntax ist für Automatisierung ganz nice, aber für interaktive Shell gefällt mir PowerShell überhaupt nicht, ne Leute, wir machen morgen früh aufwachen Stream, ich mache jetzt, ich streame jetzt nicht weiter, ich kann mich heute nicht konzentrieren auf irgendwas, funktioniert nicht, ich bin auch nicht motiviert, das ist komisch, ich habe den Stream angeschmissen, habe mir gedacht, auf geht's, aber jetzt habe ich irgendwie keinen Bock, ich weiß nicht, eh, ein Battlefield, soll man ein Battlefield spielen 2042 oder was, ganz bestimmt nicht 2042, zu wenig Eisen, ja vielleicht, Amazon hat es heute wieder richtig verkackt, was Serien und so angeht, guckt mal, ich wollte heute morgen eine neue Folge gucken, Serie, hier, also die aktuelle Folge dieser Serie läuft bei den Amis, immer Donnerstars glaube ich, 21 da war das, ja also am 21. lief das bei den Amis, normalerweise schaltet Amazon neue Folgen, Freitag, Vormittags frei zu, die haben es jetzt tatsächlich geschafft, dass ich die Season gekauft habe, aber Amazon sagt, der Season Pass geht dafür irgendwie nicht, was auch immer, das für eine bescheuerte Logik ist, so und dann habe ich mich beschwert, dann hat Amazon geantwortet, Amazon hatte tatsächlich da drauf geantwortet, ach du dumm, den Typ habe ich gemutet, den Typ habe ich gemutet, deswegen lese ich den Scheiß nicht, denn er schreibt, so, genau, sie haben gesagt hier, sie geben das weiter, die Serie ist übrigens immer noch nicht da, und dann kam mir noch der Hit, ich habe dann, weil Folge 7 habe ich noch nicht geguckt, ich habe dann Folge 7 angemacht und habe festgestellt, Folge 7 ist eigentlich Folge 8, das heißt, es fehlen Folge 7, was im Endeffekt bedeutet, die Leute haben 7 Tage jetzt oder quasi 14 Tage auf eine neue Folge gewartet, weil letzte Woche Folge 7 nicht kam, also Amazon ist wirklich unfähig, was diese Videosachen angeht, demnächst doch wieder Pirate Bay Gaggle, nee, ich habe schon lange nichts mehr gelernt über Tochen und sonst was, ich habe es eigentlich auch nicht vor, aber manchmal, manchmal lassen sie einem echt keine andere Wahl, ja, ist echt so, ich will ja gar nicht, aber was soll ich machen, er weiß, dass die richtige Folge ist ja, ja es gibt neues Level Cap, das gucken wir uns morgen an, ich stelle mal kurz den Titel um, solange ich jetzt Just Chatting, bleibe ich noch ein paar Minuten an, mal gucken, Titel geändert, Leute, wenn ihr um irgendwas schwätzen wollt, sagt Bescheid, ich bin halt so unmotiviert, irgendwas mit Gehirnanstrengungen zu machen, eigentlich müsste ich jetzt mal irgendwie kurz hier ums Haus rennen oder so, dass ich wieder wach bin, aber das habe ich jetzt auch keinen Bock drauf, welches Video, hier guck das da, achso, oh nein, die Adresse wurde gelöscht, bin ich freigeschaltet für den Maker Club, fuck, ey, haben die mich gekickt, Moment, wait a minute, ne, Willkommen Keck, passt doch, ey, ey, ich glaube die haben meinen Account disabled, weil Fake E-Mail Adresse, die waren aber schnell, ne, doch nicht, schon mal eine Fallstudio für eine Bewerbung gemacht, ey, was genau, was soll, ich muss ein bisschen genauer erklären, der Maker Club, ach ne, ich bekomme noch nicht funktioniert, ja, Debian ist zu alt als Desktop Betriebssystem, achso, ne, das muss ich ja nicht machen, was sind das denn so für Aufgaben, sag mal, was musstest du machen so ganz grob, ich mein, die sollen da einfach ganz verdammt sind, einen Wörten, ja der Klassiker. Erklären Sie Active Directory in 15 Minuten, proprietärer Microsoft Shit den Microsoft und Business Enterprise Leute gut finden. Neues Feature wurde ausgerollt und neuer Kunde will mehr aber keine. Das ist doch ganz einfach, dann soll er mehr bezahlen, dann gibt es auch Kapazität. Und wenn er nicht bezahlen will, dann macht man was anderes. Easy, genau, einfach Geld, ja muss man ja auch nicht, man muss keine Leute einstellen. Der muss einfach mehr bezahlen als die anderen, dann arbeitet man an seinem Problem weiter. Kann jemand das mit dem Binary Tree erklären? Ja das ist so eine 0815, mittlerweile ist das schon das richtige Meme geworden, was in Vorstellungsgesprächen dran kommt und eines dieser typischen Probleme, was auch immer gememt wird, ist eben Binary Tree Inverten. Zu deutsch, ein Binärbaum wahrscheinlich, vermute ich mal, ja ein Binärbaum geht es darum, das ist eine Datenstruktur mit mehreren Knoten, wo jeder Knoten maximal 2 unter Knoten haben kann, Kinder tatsächlich, Kindernote, Childnote haben kann. Ich glaube die richtige Lösung ist, dass man das eskalieren lassen soll bei seinem eigenen Chef, ja klar, man selbst kann es ja eh nicht entscheiden. Was für ein Job war das denn, wo sowas gefragt wird? Ich finde das immer bescheuert, wenn das so aus der Luft gegriffene Dinge sind, das sind wie dann so Fragen, wo sehen sie sich in 10 Jahren und so ein Blödsinn, Software Ingenieur. Wisst ihr was, ich hätte gesagt, das soll jemand anderes entscheiden, das ist nicht mal ein Bier, genau, das ist wie gesagt, deswegen wird das ja auch immer als Beispiel gebracht, die Beine die 3 inverten, oh Mann Leute, ich bin echt im Arsch, ich weiß nicht warum, also wer denkt, heute kommt die richtig FyFat-Content, kommt nicht, ich bin jetzt noch viertel Stunde an oder so und dann gucke ich irgendwie Serie oder Spiel, Steam, irgendwas oder keine Ahnung, ich finde das richtig nice, ich meine das Spielkonzept an sich ist jetzt wirklich nicht das innovativste, du läufst rum und suchst irgendwie NPC A, sucht Item B und NPC C hat Item B, möchte aber was von NPC A und ja das ist jetzt, das ist eher so ein Entspannungsgame, das kann ich jetzt nicht spielen, wenn ich das jetzt spiele, schlafe ich nämlich ein dabei. Ja das habe ich auch schon öfters gesehen, dass es gerade größere Unternehmen in Deutschland gibt oder aber auch kleine Klitschen, die meinen sie wären das nächste Google, suchen eigentlich überhaupt nicht Leute wie Google, können auch nichts bieten wie Google, aber machen auf Google, weder noch aktuell so gut wie gar nichts, ne es gibt nichts, es gibt ja nichts, oh schlimm heute, ganz schlimm, ich würde gerne mal einen sinnvollen Vergleich sehen zwischen US-Deaf-Gehältern, ich meine das muss nicht Google und Netflix sein, ja so mal so 0815 US-Deaf-Gehälter versus 0815 Deutschland-Deaf-Gehälter, allerdings richtig gerechnet mit Krankenversicherung und sowas, da könnte ich mir vorstellen, dass sie dort auch gar nicht so viel mehr verdienen. Also wenn man den Kram abzieht dort, den wir hier auch abgezogen bekommen, vielleicht nicht in dem ganzen Umfang, ja würde ich auch so schätzen, ich würde auch sagen es ist immer noch mehr, aber es ist jetzt nicht so krass wie das teilweise aussieht, wenn du dann irgendwie hörst Amazon-Senior-Ding 250.000 Euro oder so, du hast sowas zu tun ja, man kann es ja sogar in München von wohnen, wobei das wahrscheinlich auch drauf ankommt wo das ist, ja, weiß nicht ob es dort auch den Trend gibt bisschen mehr aufs Land zu gehen, bei uns gibt es das ja seit ein paar Jahren, so seit, eigentlich seit Corona so richtig, es gibt so ein kleines CAF, da laufe ich beim Wandern öfters durch, das besteht zu 50% aus neuen Häusern, also dieses CAF besteht wirklich aus einer Straße, ich kann es euch zeigen, Google Maps, Klein Hemsbach, das hört sich auch so an, so, da wandere ich öfters mal hier in der Region ja und da laufe ich öfters durch und dieses Dorf, also meist läuft man dann so hier so durch oder nach da oben oder hier außen, zumindest dieses CAF das besteht zu 50% aus neuen Häusern, weiß gar nicht ob man das überhaupt erkennt, das hat nur eine Straße ja, das ist die einzige Straße hier und man erkennt das, wartet mal Leute, wie ging das nochmal, wie konnte man, ne ich brauche, ich brauche Google Earth 3D brauche ich, Moment das muss ich aber in Google Chrome machen, Earth 3D, ok, Membris, so und ich hoffe man kann da kippen, also hier sieht man, also man sieht, was konnte man noch irgendwie so kippen das ganze, also man sieht das liegt hier schon ein bisschen in den Bergen ja, sieht man ja hier und davon sind, ohne Mist, man erkennt es glaube ich hier so ein bisschen an den Baustellen, davon sind 50% der Häuser, das ist übrigens das falsche, das hier so richtig so klein Hemsbach, so hier laufe ich dann durch so manchmal von hier unten so hoch und 50% der Häuser, man sieht das hier auch teilweise an den Dächern und so, das ist alles neu und da sind die ganzen Leute von der Umgebung glaube ich hier hergezogen, ich gehe davon aus, wäre ich hier vor 5 Jahren durchgelaufen, wären wahrscheinlich einfach so gut wie keine Häuser da gewesen und jetzt ist die ganze Straße voll, aber 50% neue Häuser, also es ziehen viele Leute jetzt weg seit Homeoffice möglich ist, in so unter anderem so kleine Dinger, ey da gibt es ordentliches Internet wenigstens ja, ist aber nice, es ist richtig am Arsch der Welt, es ist richtig am Arsch der Welt, Supermarkt gibt es da auch kein, also ich laufe meistens so, ich parke irgendwo hier unten, laufe dann hier lang, laufe dann hier so den Berg hoch, Wanderstrecke liegt Leute, laufe dann hier so den Berg hoch, laufe dann hier so den Berg hoch, ok das ist verbackt, Berg hoch und dann hier hinten durch den Wald zurück so, ja gut so siehts aus, aber mit Aldi und Lidl, ne der ist bald bisschen weiter weg, bin seit Corona auch im Homeoffice und wohne jetzt auf dem Land, ja kenne ich auch ein paar die das gemacht haben, also ich glaube das Kaff durch das ich durchlaufe das hat glaube ich irgendwie 80 Einwohner oder so, also nix, dafür kann man da schön wandern und ich stelle es mir für Homeoffice wirklich cool vor, du wohnst ein bisschen draußen, es ist kein Krach, es gehen hier keine Leute auf den Sack, du kannst draußen rumlaufen, sieht schön aus und rein kannst du ins Haus, machst du Homeoffice und verdienst Geld, das ist Pog, haben alle was von, ja dies ist immer noch die gleiche ich habe da seit Jahren nix dran gemacht, ne also das stelle ich mir schon nice vor, ich meine ich kann mich jetzt hier auch nicht beschweren, bei mir ist es halt so, ich wohne jetzt halt nicht wirklich auf dem Land, ich wohne aber jetzt auch nicht in der Großstadt, ich wohne so am Rand ein bisschen, dafür ist bei mir halt der Bahnhof in der Nähe, das ist natürlich auch super. Gunray, Dankeschön für den Sub, Leute wie gesagt also wer Big Brain Content heute erwartet wird hier nix finden, ja könnte man so sagen, ne es ist nicht wirklich die Vorstadt, es ist ein anderer Stadtteil, bisschen weiter, bisschen außerhalb, aber es ist praktisch, du bist relativ schnell in Frankfurt und du hast aber ein bisschen mehr deine Ruhe als in Frankfurt, meinst du man kann sich irgendwie auf die Ausbildung vorbereiten, naja das einfachste ist, hast du schon eine Ausbildungsstelle, wahrscheinlich ne, das einfachste ist dir mal anzugucken was die in dem Betrieb machen, wo du hingehst und dich dann dort ein bisschen vorbereiten, also was weiß ich, wenn die sagen, hey wir machen total viele, wir haben total viele Linux Server, dass du dich da ein bisschen Linux Thematik einliest, so rein im Vakuum ohne, kann man da wenig sagen, also raus bekommen was die so machen, wer nicht verkehrt und du kannst dir tatsächlich den Plan von der Berufsschule angucken, wobei naja Berufsschule halt, ja, Berufsschule kannst du eh vergessen, mit Mac, was ist das für ein Laden, welcher IT Ladender arbeitet hauptsächlich mit Mac, Hipster Web Designer vielleicht, auf der anderen Seite ganz im Ernst, warum nicht, eigentlich ist es gar nicht blöd mit Macs zu arbeiten, wenn du nämlich keinen Bock auf Windows Shit hast und dich nicht mit Linux auf dem Desktop rumschlagen willst, was ich verstehen kann, bleibt ja eigentlich nur Mac, wenn man was haben will, was irgendwie halbwegs modern ausschaut und alle nötigen Command Line Tools und Sachen hat, da bleibt ja eigentlich nur Mac, deswegen, ja, ich glaube nicht, dass du Server-Site Rendering meinst, was machst du denn, es ist blöd, dass alle abkürzt und mittlerweile schon 5-fach belegt sind, ne Server-Sites Rendering ist SSR, das habe ich jetzt durcheinander gebracht, ja, kann ich verstehen, ich schlage mich gerade damit rum, wie wir unsere ganzen, wie es heute so modern heißt, Infrastructure as Code, Repos umgezogen bekommen auf GitHub, das Problem ist, wir haben da wirklich zehntausende Sachen drinnen über die letzten Jahre angesammelt, ich weiß, wir haben immer noch 3000 Linux-Server plus den ganzen Cloud-Krempel und das Problem ist, da steht an jeder Ecke, steht ein Passwort, steht ein Zertifikat, steht irgendein Secret, ich weiß überhaupt nicht, wie ich das auf GitHub umgezogen bekommen soll jemals, es geht einzig und allein erstmal darum, nur das Repo überhaupt erstmal zu pushen zu GitHub, ich meine, das ist nicht Public, ja, noch wär ja noch schöner, das ist nicht Public, aber sie haben sich überlegt, dass sie in GitHub keine Rechte verwalten wollen, also die gesamte Firma mit GitHub Accounts kann alle Repos sehen, nee, nee, nee, so einfach ist das nicht, das Repo um das es geht, da stehen Secrets drinnen überall und keiner weiß genau wo, das ist ein riesen Repo mit Ansible und Puppet Code, was sich seit 10 Jahren angesammelt hat für alle unsere Systeme, Leute, an jeder Ecke stehen Secrets, die keiner mehr erkennt, jaja, du musst den Kram erstmal finden, das ist das Problem, du kannst ja nicht einfach nach Passwort suchen, also ich hab jetzt schon mehrere probiert, ich hab zwei Repo-Analyse-Tools laufen lassen, die dir dann so Sachen ausgeben wie, ja, das ist ein String, der sieht random aus, das könnte ein Passwort sein und Leute, ich glaube ich hab noch 800, über 800 Stellen gefunden, wo Zertifikate, Secrets und Geschiss drin steht, das krieg ich da im Leben nicht raus, von unserer Git-History gar nicht mal zu reden, die kann ich, die muss ich eh wegschmeißen, da steht zu viel drin, das kann sogar sein, dass ich das benutzt hab, ne, ne, das ist was anderes, ne, ne, ich hab, aufbei, ich bin mir nicht sicher, ich hab zwei Analyse-Tools laufen lassen, eins hatte auch so in dem Drehsterne, es könnte das sogar gewesen sein und das hat massig Zeug gefunden, ja, das muss da irgendwie alles raus, also es ist weniger nicht, es ist nicht das Problem, wenn man die gefunden hat, die auszulagern, das Problem ist die zu finden und irgendeinen zu finden, der für das Auslagern zuständig ist, weil ich kann das ja nicht von Hand machen, ja oder neuer Job, ne, ich kann das nicht von Hand machen, weil da hängt ja teilweise die Maintenance von Systemen dran, das muss dann schon derjenige machen, der für die Systeme zuständig ist, was reingeschrieben wurde und boah, ich werd das auch so machen, ne, ich werd, ich werd die History nicht squashen, ich werd einfach den Git-Ordner löschen und ein initiales neues Commit machen und dann pushen nach GitHub ohne History, weil in der History stehen viel zu viele Passwörter drinnen über die letzten zehn Jahre und sicherlich Passwörter, die auch noch in Verwendung sind, das ist eh so ein Ding, so ist es halt in Business Enterprise, Stonks Umfeld, Legacy, soweit das Auge reicht, Site Reliable Engineering, achja, irgendwie hab ich mit Server-Site Rendering durcheinander gebracht, achja, ey das Repo ist so alt, da existiert das Wort DevOps noch nicht mal, immer ganz davon abgesehen, da hindert dich auch keiner dran, irgendein Zertifikat in dein Repo zu legen und zu committen, gibt halt Leute, die machen das und das war ja an sich, solange das alles intern war gar nicht so problematisch, ich mein, wenn du irgendeinen Ansible-Script hast, weil der Webserver ein Zertifikat braucht, ja gut, irgendwo muss es herkommen und solange das alles intern ist, ist es ja prinzipiell gar nicht so schlimm, dass es geht, Repo zu committen, problematisch ist nur, wenn du es halt jetzt nach GitHub pushen sollst, also vielleicht ist es, ich kenn eure Entwickler nicht, aber ich hatte letztens eine Begegnung mit einem Entwickler von uns, da denk ich mir, es ist besser, dass der kein Ops macht, Riesenstreiterei, ich glaub ich hab's schon mal im Stream erzählt, Riesenstreiterei, weil irgendeine App nicht mehr ging und es hat sich dann rausgestellt, die App ging nicht mehr, weil die checken nicht nur, ob das Zertifikat gültig ist, die haben das Zertifikat gepinnt, also die gucken auch, ob der Herausgeber der richtige ist, ja kann man machen, okay, ist aber nur dumm, wenn es schon seit eigentlich zwei Jahren oder so die Ansage gibt, dass man von dieser CA nix mehr holen soll und so weit wie möglich alles über Let's Encrypt macht, also was haben unsere Leute gemacht, Eingangs Zertifikate umgestellt auf Let's Encrypt und auf einmal ging die App nicht mehr und alle so, hä, warum geht die App nicht mehr, bis denn irgendeiner drauf gekommen ist und hat sich das mal angeguckt und dann festgestellt, naja klar, der Herausgeber des Zertifikats ist jetzt ein anderer, so und darauf hin wurde Emergency gemietet mit dem Appteam und da war ein Entwickler drin, der hat dann wirklich gesagt, also ich gebe zu, ich hab mich vielleicht ein bisschen genervt angehört auf die Meeting, aber trotzdem, der hat gemeint, so sinngemäß, ich krieg's, lass mal kurz überlegen, wie hat er das gesagt, jaja, Moment, ich krieg das gar nicht mehr richtig zusammen, also wir haben ihm erzählt, das alte Zertifikat ist abgelaufen, ja, und wir müssen das tauschen, weil ansonsten ist in zwei Wochen der gesamte Eingang halt nicht mehr verfügbar und darauf hin meinte der dann so, ja wie abgelaufen, abgelaufen, das Zertifikat ist bis 2035 gültig, da hab ich dann gemeint, nein, das Zertifikat ist, ich glaub ich hab mich mehr oder weniger in so genau diesem Tonfall angehört, ich glaub das hat ihn auch geärgert, hat er ja auch recht, ja trotzdem, das ging mir, ich war schon echt genervt, ich hab dann halt gemeint, nein, das ist nicht bis 2035 gültig, das ist abgelaufen, das läuft 14 Tagen ab, deswegen haben wir's getauscht, das ist nicht bis 2035 gültig, doch, das ist bis 2035 gültig, er hat's doch grade vor sich, nein, das ist nicht bis 2035 gültig, bis 2035, bis 2035 gültig ist das Zertifikat von der CA, die uns das ausgestellt haben, aber nicht das Zertifikat selber, und der hat bis zum Schluss dieser Besprechung darauf beharrt, dass das Zertifikat nicht abläuft und bis 2035 gültig ist, ich weiß nicht was mit den Leuten los ist, also da ist es besser, da ist es tatsächlich lieber, ich kann mir aber nicht vorstellen, weißt du, was ich mich frage ist, Leute die damit schon Probleme haben, das können doch auch keine guten Entwickler sein, gute Entwickler sind Leute mit technischem Knowhow, ich mein, die brauchen keine 20 Jahre Linux Erfahrung, aber so ein bisschen drumherum, ist doch eigentlich allein schon, weil man sich dafür interessiert, müsste doch so ein bisschen Verständnis dafür da sein, ohne ein bisschen Interesse dafür da sein, was da noch so drumherum passiert, also ich denke, das gibt es nicht, ich weiß nicht, man kann es mir zumindest nicht vorstellen, dass man ein guter Entwickler sein kann, aber sich für links und rechts neben seinen Sachen für nichts aus der Technik interessiert, ja das kann ich mir vorstellen, du meinst, weil ich so viel Cobol Erfahrung habe, na gut, man muss ja mal sagen, Leute, ungelogen, ich hab bestimmt mehr Cobol Erfahrung als 99% aller, ok ich sag noch nicht mal aller Menschen auf der Welt, ich hab mehr Cobol Erfahrung als 99% aller Leute, die in der IT arbeiten, das meine ich ernst, ich mein ich hab immerhin schon mal mit Cobol was gemacht, 99% der Leute mit Sicherheit nicht, aber Cobol Programmierer möchte ich definitiv nie werden, ja es ist teilweise schon schlimm, aber es ist umgedreht auch so, ich sehe da auch genug Leute, die eigentlich für Infrastruktur und so verantwortlich sind, die da auch keinen Plan von dem haben, auf was es ankommt, dass eben die Anwendungen da drauf ordentlich laufen, es ist merkwürdig, zum Beispiel wir haben relativ viele Java Anwendungen, und es gibt Leute, die checken es heute immer noch nicht, wenn irgendein Entwickler sagt, ob man mal die Startparameter ändern könnte, weil das Ding braucht irgendwie mehr, oh ich hab vergessen wie es bei Java heißt, XMSS, ne wie heißt der Krempel bei Java, das braucht mehr Speicher beim Start schon allocated, weiß nicht wie das genau bei Java heißt, und die checken das bis heute nicht, denen musst du das immer wieder neu erklären, also es gibt, es ist halt wie überall, 90% der Leute sind unfähig, ja und auch nur weil sie den Beruf ausüben, heißt das noch lange nicht, dass sie fähig sind, was ist an Chromium besser, es ist nicht, es ist Chrome ohne ein paar Google Teile, ja eigentlich ist es schlechter als Chrome, weil es hat mancher Hardware Beschleunigungs Sachen nicht, ich hab das nur genommen, weil ich kein Chromecast eingebaut haben wollte, ja und kein Sync und kein Google Software Reporting Tool und so ein Shit, ja kann sein wie gesagt, das sieht gut aus ja, hat kein Text zu Speech, gut hab ich keinen Anwendungszweck für, Firefox hab ich auch, also ich benutze Chromium, Chrome und Firefox und Edge hab ich genotgetrunken installiert, aber ich verwende kein Edge, ich mein, wer verwendet schon Edge, ich weiß jetzt sagen Leute im Chat wieder, ja ich, ich verwende Edge, es gibt tatsächlich Leute die Edge verwenden, ich weiß und jetzt werd ich gleich wieder versuchen zu bekehren so nach dem Motto, der neue Edge ist gar nicht so schlecht, übrigens wenn ihr mal getriggerte Linux Fans sehen wollt, seht ihr mal ein bisschen die Kommentare unter meinem letzten Video für euch angucken, ok ich geb zu vielleicht etwas provokanter Titel, aber der Titel ist ja im Prinzip das worüber ich rede im Video und zumindest wenn ihr paar getriggerte Linux Fans sehen wollt, dann müsst ihr hier nochmal durchgucken, die meisten Leute sind ja normal, aber hier auch getriggerte Linux Fan, ist das das wo ich am rumschreien bin? Ja gut, da konnte man sich schon mal ein bisschen aufregen. Ja Rust bringt einen zur Verzweiflung, wählst du dein Chromium unter Windows aktuell, das hat nen Updater dabei, der startet und dir sagt wenn es eine neue Version gibt, dann musst du auf Download klicken, wenn die neue Version da ist. Oh man, ey Rust lass ich erst mal bleiben, da dreh ich auf komplett durch bei Omega Keg, oh ich wollt grad Licht einschalten über mein Home Automation System und stell fest die Batterie von meinem Fritz Thermostat ist leer, obwohl es eindeutig nicht leer ist, weil ich guck gerade drauf, was sagen, da hat irgendwie die Synchronisation nicht so funktioniert wie sie sollte, ja Rust ist echt so ein Sache für sich, ja die Deckdinger, ich hab einiges ausprobiert, ich hab ZigBee Thermostate ausprobiert und ich hab auch einen Siebel Thermostat ausprobiert und die Fritz Deckdinger, die funktionieren tatsächlich am besten, leider sind sie nicht so ganz billig. Ich gehör auch zu den Open Source Leuten und ich find Rust eigentlich vom Ansatz her auch mega geil, also Rust ist für den Einsatzzweck, wo es ursprünglich gedacht wurde, glaub ich das beste was es gibt, man muss sich ja überlegen, das Ding wurde von Mozilla erfunden, also von den Firefox Leuten und im Hinblick auf das, dass sie quasi Browser Sicherheitslücken vermeiden wollen und trotzdem was schnelles haben wollen, für solche Anwendungsgebiete ist Rust gut, also was was sicherer sein soll, allerdings auch schnell und das in Kombination ist wirklich cool, mir fällt keine andere Sprache ein die das so gut hinkriegt wie Rust, leider ist Rust was Syntax angeht und Komplexität auch schon total am ausufern, allerdings auf andere Art und Weise wie C++, Rust ist in gewisser Weise nachvollziehbar, du verstehst meistens warum es meckert, dir fällt aber jetzt so spontan dann manchmal nichts ein wie du es machen könntest, dass es nicht total ausufert an Komplexität, bei C++ ist es einfach so, dass es nur noch wir ist und du überhaupt nicht weißt was die sich dabei gedacht haben, Network Chuck guck ich nicht gerne, so Hipster Zeug, der Rust Compiler ist deutlich netter als der C++ Compiler, der C++ Compiler wirft dir nämlich 40 Zeilen Fehlermeldungen aus und du weißt nicht woran es liegt, im Rust Compiler weißt du es meistens, Tado, ja Tado habe ich zum Glück damals geschickt um Shift, nee kein C++ Rant heute, ja das nervt mich, also ich habe nicht viel mit Rust gemacht aber das nervt mich auch, also du brauchst ja wirklich für jeden Furz externe Packages, also wo es bei mir wirklich aufgehört hat ist, dass du mit Rust noch nicht mal eine Timespan parsen konntest, also Rust hat nichts eingebautest um eine Duration zu parsen from String, du musst das selbst programmieren oder einen Package verwenden, einen Crate verwenden, ich meine ist es zu viel verlangt dass es Duration Punkt Pars gibt, anscheinend, bloatet, braucht man nicht, ich glaube sogar C++ hat sowas, schauen wir mal, ja aber passt mal auf es ist hässlich, all diese Chrono APN C++ ist glaube ich eines der menschenverachtendsten Sachen die ich je gesehen habe, Moment Example, der Stelle gehts noch, passt mal auf ich zeige euch jetzt mal was, ich zeige euch jetzt mal was, ich zeige euch jetzt mal was, das geht noch viel schlimmer, das geht noch viel schlimmer, mein Go-Projekt, ich habe heute nichts gemacht, ich wollte heute eigentlich weitermachen, ich gucke da hin, Alter wenn ich sowas hier schon sehe, aber C++ ist eh Standard 0W, Keckel, Rom, Iteration, Start, End, Uint, 69, Rom, so das ist ungefähr ziemlich, ziemlich, ziemlich valid C++, ungefähr so sieht das aus, du brauchst noch ein paar Operator, Overloaded, plus gleich, Void, Void, Int, Int, Call, Make, Shared und davon dann die Adresse, also Leute ohne Scheiß wahrscheinlich ist das valid C++ Code und wer jetzt sagt ist nicht so, ich könnte fast wetten, dass es lauffähig machbar ist in C++, also das könnte durchaus valid, okay mit dem Pointer, mit der Adresse hier vorne funktionieren, das könnte wahrscheinlich wirklich fast valid C++ sein, das ist halt echt abartig. Könnt ihr gut mit Entwurfsmustern, ich kenne niemand, ich kenne niemand der Entwurfsmuster sagt, aber die meisten davon brauchst du nicht, viele sind in aktmodernen Sprachen schon integriert, sowas wie Observer zum Beispiel und wenn du in Java unterwegs bist, dann brauchst du natürlich das Abstract Factory Repository Manager Builder Pattern, sonst gehts nicht, ich glaube zwei davon sind gar keine offiziellen Entwurfsmuster aus diesem Buch, wie heißt dieses Gang of Five, ne wie heißt dieses Oldschool Entwurfsmuster Buch, Gang of Four, aber vieles davon ist in modernen Sprachen schon eingebaut, also ganz ehrlich das wichtigste Pattern ist meiner Meinung nach Observer und Factory, wobei Factory je nach Sprache auch schon einen gewissen Weg hat wie man es macht, okay warte mal, ne nicht Design Pattern, nach was muss ich suchen, Gang of Four Design Patterns, also in.NET voll angesagt, braucht man relativ oft, braucht man auch relativ oft, in vielen Sprachen auch schon eingebaut, semi oft, jede moderne Sprache hat sowas, auch mit Interfaces meistens, als Libraries, Observer auch oft schon eingebaut in modernen Sprachen, ja, alles bloated, Yandere Dankeschön für den Besuch, ich wünsche euch einen schönen Abend, bis zum nächsten Mal, tschüss, tschüss, tschüss, tschüss, tschüss, tschüss, tschüss, tschüss, tschüss, tschüss, tschüss, tschüss, Javascript ist weird, weird champ, okay zeig mal her, also wir wissen, dass Javascript weird ist. Also in Javascript ist not a number auch nicht not a number, das ist ja klar ne, also hier none, gleich, gleich, was kommt da raus chat, was kommt da raus, wenn ich jetzt n eingebe? Da kommt false raus, sieht man ja, not a number equals not a number ist logischerweise false, obviously und jetzt kommt der Trick, was kommt hier raus, Mist node schreibt immer unten drunter was, da weiß man es ja schon und was kommt hier raus, das gibt es nicht, okay. Ja, das ist ja Batman, Batman, was, ne, ah ich hab's nicht in der Historie, das gibt es ja auch, da gibt es ja auch die Batman Variante. Moment, 21, ich guck mir jetzt noch nicht 21 Minuten an, warum Javascript weird champ ist, das wissen wir doch auch so. Also das glaube ich dem sofort, das glaube ich dem sofort, ich mein das Klammern funktionieren an der Stelle, versteh ich, das ist einfach quasi Statement kopiert, geschweifte Klammer auf ist ein Objekt, eckige Klammer auf ist ein Array, aber warum dieser Shit da innen drinne funktioniert ist mir nicht ganz klar, geteilt durch größer plus not kleiner gleich, ich habe keine Ahnung warum das funktioniert. Also das ist genau das, was wir hier machen werden, also das ist einfach, Javascript only has a few basic types, like strings, numbers, booleans, arrays and objects, ja und wenn ich es richtig in Erinnerung hab, sind Numbers in Javascript 47 bit, ich glaube Numbers in Javascript sind 47 bit, oder 42 bit, warum, weil die schlau sein wollten, die verwenden 47 bit für die eigentliche Zahl und, was ist denn da noch übrig, 17, 17 Stellen für den Exponent, Pfeifedder Time, es könnten auch 52 bit sein, ich bin mir nicht ganz sicher, aber das habe ich auch mal, hier, Javascript numbers also 0 bis genau 52 bits ist der value, genau und der Rest ist für den Exponent, das ist, ja in Javascript gibt es das ja nicht, in Javascript gibt es nur Numbers, das wird mich nicht wundern, dass Javascript irgendwelche Standards ignoriert, achja Chat, mal Frage, was kommt hier raus, wer weiß es, was kommt hier raus in Javascript, wenn man das, wenn ich das so checken lasse in Javascript, und was kommt hier raus, node, true, gleich, gleich, jetzt kommts, jetzt kommts, true, logischerweise false, das ist auch false, ist insofern ja auch logisch, weil es ist ja auch kein String, ja. Ah, obviously, natürlich, was sonst Javascript, also 2, 2 plus true, also 2 plus true, also das heißt im Endeffekt, ich kann, true plus true Rechner kommt 2 raus, na klar, was sonst, pass mal auf, pass mal auf, 5 hat, 5 hat time, node, true plus false, gleich true, so was geht aber auch echt nur in Javascript oder, aber das ist false, das ist false, ja, bitte schön, gibt es inzwischen type safety, naja es gibt jetzt glaube ich seit dem neuesten Standard type annotations, gleich, gleich, gleich ist, dass er nicht, dass er überprüft, ob der Typ stimmt auch oder so, frag mich nicht genau, Javascript Details aus dem Kopf. Aber selbst wenn wir supplies versionieren, so welches wir hier in den D plus A and then plus and then a space plus and then A plus A and then we do a two lowercase on that we should see this come out with the string banana. Warum muss man to lowercase machen? What we're trying to do here, the root of it, is that we're trying to take the character A and convert it into a number with a unary plus, which of course is going to result in not a number because A is not a number and cannot be sensibly transformed into a number. And if you two lowercase that, you'll get the middle part of the string. And if we look at what it was before, you'll see that this is really this. So what we're actually doing is saying B plus A plus not a number plus A lowercase. It's actually fairly simple. This is the set of basic things that we're gonna use in order to do something way cooler. So first of all, let's figure out how we can get numbers. Ja, würde ich auch jedem empfehlen, lernt JavaScript ein bisschen, bevor ihr euch noch TypeScript obendrauf packt. Ich verwende ja bis heute kaum TypeScript. TypeScript hat auch so seine Abfachseiten. Ich habe letztens gesehen irgendeiner, der rein im TypeScript-Typesystem irgendeinen Encoder programmiert hat. Nur mit dem TypeScript-Typesystem. Ich glaube, ein Base64-Encoder rein im TypeScript-Typesystem oder irgendwas habe ich letztens auf Twitter gesehen, habe ich auch schon gedacht. Jetzt fängt es schon an wie ein C++. Was wir eigentlich tun müssen, ist es irgendwie von unserem Haupttypen zu bekommen. Welche Sprache ist nicht Trash? Ganz ehrlich, ich würde sagen JavaScript ist nicht Trash, unabhängig davon. JavaScript ist mittlerweile echt ganz gut, brauchbar. C Sharp ist definitiv auch nicht Trash. Für so normale Daily-Anwendungen eigentlich nicht wirklich geeignet. Großer Go-Fan werde ich nicht werden, aber ich würde nicht so weit gehen und sagen, dass es Trash ist. Ruby ist auch auf jeden Fall kein Trash. Python ist auch kein Trash. Bash ist auch kein Trash. Bash ist einfach nur alt. Kotlin ist auch kein Trash. Cobol ist Trash, ja, da gebe ich dir recht. C++ ist auch Trash. C ist kein Trash. Bash ist aber keine Sprache. Na ja, kann man es jetzt drüber schreiben? Ich meine, du kannst da auch das meiste drin machen. Du hast Ifs, du hast Schleifen, du hast Funktionsaufrufe, also im Prinzip... Also, für mich geht das als Programmiersprache durch. Aber ich bin da eh nicht so pingelig. Wer ist... Ja, da kommt... Das ist Test, ist das. Die eckige Klammer. Lua ist Trashwing ArrayIndex1. Ja, das stimmt. Es ist auf jeden Fall ein wenig Sass, wie man so schön sagt. Welche Sprachen sind so richtig Trash, aber nicht, weil sie so alt wie Cobol sind? C++? Denn die neuesten C++-Standards haben es nicht wirklich viel weniger trashig gemacht. Ähm... Tja. Ja, Brainfuck ist ja dafür gemacht, fuck zu sein, ja. Portran ist auch alt. Tja, welche Sprache ist neu und trash? Also, so wirklich trash, so. Das ist doch nicht mal... Ganz ehrlich, ob Carbon was taugt, bin ich mir wirklich sehr unschlüssig. Ob das irgendwie eine Daseinsberechtigung hat. Was ich von Dart gesehen hab, bisher war wirklich nicht so geil. Aber kommst ja mit Flutter nicht drumherum. TempleOS ist keine Programmiersprache. TempleOS ist in Holy C programmiert. PAP ist auch kein Trash. Moderne PAP-Versionen sind echt ganz okay. Okay. Emacs Lisp ist Trash. Das ist nicht so alt wie Cobol und ist trotzdem Trash. Scala kann ich auch nicht ab. Also alle Sprachen, die zu 90% aus Klammern bestehen, im Prinzip so was wie Emacs Lisp oder Scala, ist Pains Jam. Erlang ist auch so ein Ding. Egal, wir gucken jetzt weiter. Obviosly. Scala mit Acker. Ist Acker nicht so ein Clustering verteiltes Zeug-Framework? Ich hab da irgendwas im Hinterkopf in die Richtung, bin ich mir aber nicht ganz sicher. Er ist Trash? Weiß ich nicht, Chat. Hab ich noch nichts mitgemacht? Prolog? Da kenn ich nur irgendwelche Hallo-Welt-Beispiele. ABAP, naja. Ist ABAP das SAP-Ding? Das Video, da schlaf ich ein bei, Leute. Da passiert ja nichts. Außer, dass er uns zeigt, dass du mit JavaScript-Webchamp Zeug machen kannst. ABAP ist SAP, ja. Was verdient ein Berufsjäger? Das gucken wir uns mal hier früh an. Der Jägersmann. Pre-Pre-Pre-Alpha-Battlefield-Gameplay. Was für ein Battlefield könnte das sein? Ist das Bad Company? Ist das die Bad Company Alpha? Das ist Bad Company, oder? Jaja, das ist Bad Company. Also ich vermute mal, das wird Bad Company. Jaja, das wird garantiert Bad Company. Mods, einmal Bunn, please. Jaja, das hörst du auch an der Hintergrundmusik. Das ist Bad Company 2. Bad Company 1, nicht Bad Company 2, Bad Company 1. Was ist das? I tried 10 code editors. Wer braucht code editors? See it only. Die Auswahl ist aber auch reichlich willkürlich, oder? Was ist denn das alles? Ist eins davon NeoWim? Keine Ahnung. Das da oben sagt mir gar nichts. Was ist das da unten? Was ist das unten rechts? Ach, das ist Fleet, genau. Nee, ich glaube nicht, dass es Dreamweaver ist, oder? Dreamweaver, das habe ich früher verwendet. 1999 für Webseiten. Seht, seht only. Nee, ich habe damals kein Frontpage verwendet. Ich habe tatsächlich schon HTML selbst gemacht. Also Dreamweaver konnte ja HTML Editor und, ähm, ja, Visivic Editor. Aber das Autokomplete von Dreamweaver war wirklich seinerzeit voraus. Also das konnte mehr oder weniger alles Autokompleten schon. Wobei es ja eigentlich Wim ist im Kompatibilitätsmodus. Ja, Wim Beste. Ich benutze Wim täglich halt für kleine Editiersachen, SSH, Commandline, sonst wie. Deswegen habe ich meine ganze Wim-Config auch wieder eingekürzt von dem riesen Ding, was ich früher hatte. Einfach weil es überall funktioniert. Wim ist das Beste. Nee, du brauchst kein Studium für Wim. Du musst es einfach nur ein paar Wochen mal verwenden regelmäßig für kleine Terminal-Editiersachen, dann gewöhnst du dich dran. Wim hat, die Wim-Sprache hat eine gewisse Logik. Ja, das habe ich ja schon öfters gesagt. Also zum Beispiel, wenn du jetzt hier irgendwie sowas stehen hast, oder sagen wir mal was anderes. Sagen wir mal, du hast jetzt hier irgendwie sowas hier stehen. Lul, W, bla bla bla. Und du willst jetzt alles in den, alles in den Anführungszeichen löschen. Dann sagst du einfach C, I, Anführungszeichen. Hä, seit wann muss man da drin sein? Ach nee, man muss davor sein. Jaja, man muss davor sein. Du sagst, du sagst C, I, Anführungszeichen, dann springt er da rein und löscht das. Das kann man sich merken. C für Change, I für Inner und dann das Zeichen von wo bis wo. Also das hat, also die Wim-Sprache hat schon seinen Sinn. Also das hat eine gewisse Konsistenz, was die einzelnen Kürzel machen. Ja, das macht aber keiner. Please allow me to interject for a moment. Weiß nicht, ob wir das Zeug ready haben im Chat. Genau das. Ja, das Problem ist, dass es Emacs Lisp hat zum Konfigurieren und Emacs Lisp ist wirklich auch ziemlich belastend. Ich kenne niemand, der in Emacs die Menüs verwendet. Ja, es interessiert aber keinen mehr. Ganz ehrlich, Emacs hat seit Whistle Studio Code und der Erweiterbarkeit dort mit Plugins schon noch weiter an Bedeutung verloren. Das war ja halt das Coole an Emacs, dass du so viele Plugins hattest und quasi eine eingebaute Sprache zum Plugins entwickeln, aber ganz ehrlich, ich glaube Emacs, die Bedeutung ist mittlerweile nicht mehr groß vorhanden. Aber auch nur weil Emacs verwendet. Ich kenne keinen mehr, der Emacs benutzt. Ich kenne welche, die haben Emacs, aber ich kenne keinen, der wirklich noch Emacs dauerhaft benutzt. Es ist cool, dass es so viele Wim-Plugins gibt, aber ganz im Ernst, ich bin da weg von, ich hatte ja mein Wim früher aufgebohrt, ich hatte irgendwie, was weiß ich, 2000 Zeilen WimRC oder sonst was. Ich konnte das Ding nicht mehr abdecken, ohne dass es kaputt gegangen ist und du hast es halt auf Remote Server nicht. Es gibt da ein paar Tricks, das mitzunehmen, aber da kopierst du erst mal. Ich hatte sogar ein Sync-Programm, was mir per SSH meine Wim-Config mit kopiert hat, wo es dann das Problem war, da musste ich erst mal 40 MB sinken oder was komplett useless war, das kannst du vergessen, kannst du nicht verwenden. Deswegen bin ich mittlerweile wieder auf Vanilla Wim ohne Plugins. Ich glaube das einzige Plugin, was ich habe, ist eine ordentliche Statusleiste. Ja, das ist eh overrated. Das ist total overrated in der heutigen Zeit. Du verbringst eh die meiste Zeit beim Programmieren mit nachdenken, mit googeln und mit Sachen lesen und den Browser benutzen. Das ist egal. Du brauchst die zweite Hand eh öfters für die Maus. Insofern, das ist nur ein theoretischer Vorteil. Also man erkennt Leute, die noch nie was entwickelt haben und nie was programmiert haben, daran, dass sie denken, Programmierer machen den ganzen Tag das hier. Ist es halt nicht. Das Problem ist, dass Wim-Skript... Oh, ja. Deswegen haben sie jetzt Lua in Neo Wim eingebaut. Genau, wie er sagt. Nein, Tastaturlayouts habe ich mich noch nicht dazu irgendwie durchgerungen. Ich sehe auch ganz ehrlich den Vorteil nicht, sich da jetzt monatelang rumzuquälen und umzugewöhnen. Also den Boost in der Produktivität sehe ich da nicht. Nanomagisch nicht. Nanomagisch nicht. Nano ist quasi Notepad nur im Terminal und das funktioniert nicht. Ja gut, Notepad ist im Prinzip ja heute noch mehr oder weniger das gleiche wie das da. Da hat sich ja so gut wie nix dran getan. Kennt noch jemand? Kennt noch jemand? Kennt noch jemand? Kennt noch jemand Edit? Nee, wie ist das Ding? Ultra Edit? Kennt noch jemand Ultra Edit? Das war so 2000 rum. Der Shit für Windows an Editor. Verwendet heute kein Mensch mehr, aber das war damals voll Bleeding Edge. Moment, man kann sich den Kram heute noch kaufen oder was? High Performance Winner. Gut, da haben sie sich mal wieder selbst irgendwelche... The Bugatti of Text Editors. Alter, was ein Blödsinn, Mann. Moment, mit Subscription? Die haben doch einen Dachschaden. Subscription für einen Text Editor. Oh, Dreamweaver. Dreamweaver kenn ich nur, das war ein grünes... Moment, hat das nicht eben gezeigt? Das grüne Logo kenn ich noch. Ja, da ist Dreamweaver. Dreamweaver 7. Das da, oder war das schon 8? Ja. Das hab ich damals verwendet, um Webseiten zu machen. Das gibt es noch? Das gibt es wirklich noch? Auch mit Dark Theme und so? Was ist die Daseinsberechtigung 2022? JQuery UI. Ja. Rackets wird auch glaub ich noch mal weiterentwickelt. Ja. Das ist das Ding, kechthin aktuell. Zumindest für Frontend Sachen. Ja. Was der Grund ist, warum auch Emacs nicht mehr so angesagt ist. Diese Sache mit Erweiterung und Plugins war ja das riesen Ding von Emacs früher. Mittlerweile hast du halt dann auch mal ne gescheite Sprache. Keiner mag und kann E-Lisp wirklich. JavaScript können die meisten. Ja, musst du ja auch. Musst du ja auch. Du brauchst ja nen Mac, um Mac Anwendungen beziehungsweise iOS Anwendungen machen zu können. Weil du brauchst ja diesen komischen Code Signing Schritt von Apple, was nur mit Mac OS geht. Oder einfach Rider verwenden, was besser ist und kostet Plattform. Rider hat keine gratis Version. Nee, du hast nur ne Trial Version. Ist doch wurscht. Ganz ehrlich, wenn man damit sein Geld verdient sind 69 Euro im Jahr kein Ding. Ich hab das All Desktop Package, das kostet mich 160 Euro pro Jahr. Ich mag aber das Standard Farbschema nicht. Nee, IntelliJ ist nicht das einzige gratis Ding. PyCharm ist auch gratis. Sonst noch was gratis? Nee, Golan ist glaub ich auch nur mit Sub. Da bin ich mal gespannt. Die Zukunft sieht interessant aus, aber der wichtigste Take-Away von diesem Video ist... ...dass es keine Drogen gibt. Danke fürs Zuschauen und wir sehen uns in der nächsten! Ja, jetzt ist der Stream doch länger gegangen, für das, dass ich nach 15 Minuten eigentlich schon aufgehen wollte. Ja, ich bin da auch kein großer Fan von irgendwelche Cloud-IDEs zu verwenden. Ich mein, vielleicht für Leute, die irgendwie total viel unterwegs sind und dann vom Notebook aus irgendwo was machen wollen und so. Vielleicht, aber ansonsten... Tja... Okay, Leute, es reicht! Lange genug halb eingepennt vorm Rechner. Ich mach jetzt den Stream aus, guck noch ein paar Videos und dann geh ich irgendwann in so eineinhalb Stunden pennen oder so. Alles klar, wir sehen uns, macht's gut, see you!", "segments": [{"id": 1, "start": 90.0, "end": 99.08, "text": "Oh, ich muss das Herz halt entknoten."}, {"id": 2, "start": 120.0, "end": 123.0, "text": "So, entknoten das Headset am Start."}, {"id": 3, "start": 123.0, "end": 129.8, "text": "Und wie läuft's?"}, {"id": 4, "start": 129.8, "end": 131.04, "text": "Warum lernst du?"}, {"id": 5, "start": 131.04, "end": 132.48, "text": "Willst du immer spezielles machen?"}, {"id": 6, "start": 132.48, "end": 133.6, "text": "Interessiert es dich einfach?"}, {"id": 7, "start": 133.6, "end": 134.12, "text": "Oder musst du?"}, {"id": 8, "start": 134.12, "end": 134.52, "text": "Muss du?"}, {"id": 9, "start": 134.52, "end": 136.44, "text": "Aus irgendwelchen Gründen?"}, {"id": 10, "start": 136.44, "end": 143.72, "text": "Du musst."}, {"id": 11, "start": 143.72, "end": 149.6, "text": "Das ist problematisch."}, {"id": 12, "start": 149.6, "end": 167.88, "text": "Berufsschule, äh ja gut, Berufsschule."}, {"id": 13, "start": 167.88, "end": 170.4, "text": "Für die Berufsschule musst du nix großartig lernen."}, {"id": 14, "start": 170.4, "end": 172.68, "text": "Berufsschule macht man auf einer Arschbacke."}, {"id": 15, "start": 172.68, "end": 178.88, "text": "Da kommt du über drei Hello World Print-Zeilen nicht raus in den drei Jahren."}, {"id": 16, "start": 178.88, "end": 207.96, "text": "So und was gibt's Neues Leute?"}, {"id": 17, "start": 207.96, "end": 224.12, "text": "Du kannst jetzt einen Raspberry Pi 4 für 180 Euro kaufen."}, {"id": 18, "start": 224.12, "end": 231.48, "text": "Wo wir gerade dabei sind, also richtig unsinnig."}, {"id": 19, "start": 231.48, "end": 234.76, "text": "Also wer aktuell keinen Raspberry Pi hat, dem kann ich echt nicht empfehlen, sich einen"}, {"id": 20, "start": 234.76, "end": 235.76, "text": "Raspberry Pi zu holen."}, {"id": 21, "start": 235.76, "end": 240.76, "text": "Ich meine 180 Euro für einen Raspberry Pi, die sind wirklich, die sind wirklich nicht"}, {"id": 22, "start": 240.76, "end": 242.12, "text": "mehr ganz bei Sinn."}, {"id": 23, "start": 242.12, "end": 242.88, "text": "Guckt euch das mal an."}, {"id": 24, "start": 242.88, "end": 247.4, "text": "Guckt euch das mal an."}, {"id": 25, "start": 247.4, "end": 256.0, "text": "Okay, den 4er gibt's für 123 Euro und das ist tatsächlich noch relativ günstig."}, {"id": 26, "start": 256.0, "end": 264.64, "text": "Normalerweise kostet die 4GB Variante glaube ich 45 Dollar oder sogar nur 35 Dollar."}, {"id": 27, "start": 264.64, "end": 274.48, "text": "Zero 2W habe ich tatsächlich welche hier, weiß ich nicht, was die aktuell kosten."}, {"id": 28, "start": 274.48, "end": 280.4, "text": "Ah okay, kostet das doppelte, kostet das doppelte von, ist nicht verfügbar."}, {"id": 29, "start": 280.4, "end": 289.12, "text": "Ja Zero 2W habe ich hier zwei Stück hier liegen, habe ich mir direkt zur Release gekauft, als"}, {"id": 30, "start": 289.12, "end": 290.12, "text": "es die gab."}, {"id": 31, "start": 290.12, "end": 292.96, "text": "Weil ich mir dachte, das kannst du bestimmt nochmal gebrauchen."}, {"id": 32, "start": 292.96, "end": 298.04, "text": "Ich glaube ich mache jetzt doch mal ein paar Tabs zu, es wird mir ein bisschen viel."}, {"id": 33, "start": 298.04, "end": 315.28, "text": "Ja ja, ich habe mein eigenes Video an, Cringe, ich weiß auch nicht warum."}, {"id": 34, "start": 315.28, "end": 321.08, "text": "So, erkennt man jetzt schon ein bisschen was, nee okay, aber hier mal zu."}, {"id": 35, "start": 321.08, "end": 328.08, "text": "Machen wir mal das."}, {"id": 36, "start": 328.08, "end": 342.08, "text": "So, mal den ganzen Crap hier schließen, ich brauche aber eh nicht mehr alles zu machen"}, {"id": 37, "start": 342.08, "end": 343.08, "text": "hier."}, {"id": 38, "start": 343.08, "end": 344.08, "text": "Bäm."}, {"id": 39, "start": 344.08, "end": 347.24, "text": "So, jetzt erkennt man jetzt ein bisschen was oben wieder."}, {"id": 40, "start": 347.24, "end": 354.6, "text": "Ja, habe ich, ist nicht meins, habe ich auch schon im Vorfeld gesagt, so Reality Sachen,"}, {"id": 41, "start": 354.6, "end": 359.4, "text": "das ist, das kannst du prinzipiell ja eigentlich gescheit nur im Team spielen, das wäre noch"}, {"id": 42, "start": 359.4, "end": 369.32, "text": "nicht so wild, aber es ist halt, sagen wir mal so äußerst langsam und gestellse alles,"}, {"id": 43, "start": 369.32, "end": 370.32, "text": "das ist nichts für mich."}, {"id": 44, "start": 370.32, "end": 389.6, "text": "Ich mag das, dass ich erkenne wo die Gegner sind, die mich beschießen."}, {"id": 45, "start": 389.6, "end": 407.84, "text": "Dankeschön für den Sub, ich mache mal schnell ein paar Updates, wobei ich kann nicht, mein"}, {"id": 46, "start": 407.84, "end": 409.16, "text": "Terminal ist blockiert."}, {"id": 47, "start": 409.16, "end": 432.72, "text": "So, kurz eine Runde Updates, ich glaube das haben wir gestern schon gemacht, aber ich glaube"}, {"id": 48, "start": 432.72, "end": 438.48, "text": "wir haben gestern versucht vergessen zu restarten, kann das sein, irgendwie fühlt sich die VM"}, {"id": 49, "start": 438.48, "end": 449.08, "text": "ein wenig laggy an und ich weiß nicht genau warum, Firefox laggt rum ein bisschen, es"}, {"id": 50, "start": 449.08, "end": 461.28, "text": "ist der Twitch Chat, der rum laggt, äh ich reboote mal, schade ja nichts, moin hast du"}, {"id": 51, "start": 461.28, "end": 469.04, "text": "für deinen Cuddy Server die DNS Challenge für Let's Encrypt, da kann es doch keiner"}, {"id": 52, "start": 469.04, "end": 474.28, "text": "was darunter vorstellen, dass ich das noch nicht gehört habe, höchstwahrscheinlich"}, {"id": 53, "start": 474.28, "end": 480.6, "text": "verwendest du das mit Let's Encrypt oder hast du was eigenes, ja weißt du wie man das ganze"}, {"id": 54, "start": 480.6, "end": 492.2, "text": "testet, ja mit Let's Encrypt kannst du die Staging Server nehmen von denen, Let's Encrypt"}, {"id": 55, "start": 492.2, "end": 500.2, "text": "hat Staging Server, damit ist das deutlich großzügiger was du für Zertifikate machen"}, {"id": 56, "start": 500.2, "end": 510.96, "text": "darfst am Tag, guck 30.000 pro Woche das sollte ausreichen zum testen würde ich sagen, weil"}, {"id": 57, "start": 510.96, "end": 519.08, "text": "ich glaube ansonsten sind es 300 oder so pro Woche bei den echten Let's Encrypt Dingern,"}, {"id": 58, "start": 519.08, "end": 534.52, "text": "du du du, ja teste es mit den Staging Servern, teste es mit den Let's Encrypt Staging Servern"}, {"id": 59, "start": 534.52, "end": 541.4, "text": "und dann, wenn alles funktioniert, dann stell um auf die Live Server und du kannst ja auch"}, {"id": 60, "start": 541.4, "end": 546.92, "text": "ein paar mal testen, dann blocken die dich nicht, die blocken ja generell keinen, die"}, {"id": 61, "start": 546.92, "end": 553.28, "text": "haben halt Rate Limits und du wirst ja nicht wirklich geblockt, du kriegst halt für ja"}, {"id": 62, "start": 553.28, "end": 563.16, "text": "quasi 8 Tage kein Zertifikat, das ist dann halt das blöde da dran, oh, du du du du,"}, {"id": 63, "start": 563.16, "end": 568.64, "text": "Restore, so ich hoffe den Twitch Chat brauche ich hier eigentlich nicht, wobei, warum eigentlich,"}, {"id": 64, "start": 568.64, "end": 577.24, "text": "lass mal den Twitch Chat hier auch mal auf, so, ich kann den Twitch Chat hier nicht aufmachen,"}, {"id": 65, "start": 577.24, "end": 582.96, "text": "ich hab hier nicht mal FFZ, Moment, ich hab Better Twitch TV, ok, soll mir auch recht"}, {"id": 66, "start": 582.96, "end": 588.24, "text": "sein, hab ich Better Twitch TV, nice, weiß nicht so genau warum, aber anscheinend ich"}, {"id": 67, "start": 588.24, "end": 594.48, "text": "hab Better Twitch TV drauf, gut, es ist wahrscheinlich so essential schon, ich hab wahrscheinlich"}, {"id": 68, "start": 594.48, "end": 599.8, "text": "schon in der Default Installation, in meinem OS Image ist wahrscheinlich schon FFZ drinne,"}, {"id": 69, "start": 599.8, "end": 606.36, "text": "so, machen wir den Krempel von gestern mal auf, zack, ich hab mich jetzt auch angemeldet,"}, {"id": 70, "start": 606.36, "end": 615.36, "text": "mein Go Land ist jetzt, guck, ich kanns euch zeigen, hab mich vorhin mal eingeloggt, mein"}, {"id": 71, "start": 615.36, "end": 632.0, "text": "Go Land ist jetzt registriert bis 19. Juli, was, Subscription expired, ich hab mich eben"}, {"id": 72, "start": 632.0, "end": 650.88, "text": "eingeloggt, ich hab mich eben eingeloggt mit im Jetbrains Toolbox, also backt das noch"}, {"id": 73, "start": 650.88, "end": 666.92, "text": "rum oder was, keine Ahnung, kein Schimmer, nice, so muss das sein, ich hoff du hast im"}, {"id": 74, "start": 666.92, "end": 671.04, "text": "Vorstellungsgespräch auch gesagt, du hast Wupplo aus Prime subscribt, das gibt extra"}, {"id": 75, "start": 671.04, "end": 680.88, "text": "Punkte, muss ja nicht stimmen, ja, aber, dann sagen die, jaja, klar, Pfeifert, den wollen"}, {"id": 76, "start": 680.88, "end": 693.6, "text": "wir haben, doch, doch, das, achso, Moment, jaja, gut, wenn du es testest, erneuerst du"}, {"id": 77, "start": 693.6, "end": 698.32, "text": "ja nicht, richtig erneuern kannst ja bloß alle 30 Tage, dann musst du, musst du, ne,"}, {"id": 78, "start": 698.32, "end": 702.04, "text": "das stimmt, aber wenn du es testest, dann schmeißt du die Zertifikate ja weg und lässt"}, {"id": 79, "start": 702.04, "end": 718.68, "text": "sie dir für die gleiche Domain neu ausstellen, immer wieder, bis es geht, also ich hab WSL,"}, {"id": 80, "start": 718.68, "end": 722.08, "text": "sowohl auf der Arbeit als auch hier, aber ich benutze WSL eigentlich nicht, ich benutze"}, {"id": 81, "start": 722.08, "end": 731.2, "text": "so meine Linux VM, WSL, WSL ist so das so halbherziges Zeug, weiß nicht, WSL ist so besser als nichts,"}, {"id": 82, "start": 731.2, "end": 741.92, "text": "aber auch nicht so das ganze, so, weiß nicht, mir ist ein vollständiges Linux in der VM"}, {"id": 83, "start": 741.92, "end": 745.6, "text": "tatsächlich immer noch lieber, Alter, ich hab Anfälle gekriegt mit Rust, ich hab mir"}, {"id": 84, "start": 745.6, "end": 750.56, "text": "das jetzt ja Offstream nochmal angeguckt und ich hab versucht Webrequest zu machen, Alter,"}, {"id": 85, "start": 750.56, "end": 758.24, "text": "wie kompliziert kann man es machen, einfach Webrequest, ich, okay, ich war dumm, ich wollte"}, {"id": 86, "start": 758.24, "end": 765.08, "text": "Async, Webrequest machen, die Synchronen gehen ja noch halbwegs, aber ganz im Ernst, Alter,"}, {"id": 87, "start": 765.08, "end": 776.96, "text": "was das, was das ist, guckt euch das mal an, eQuests oder so, komisch heißt dieses Package,"}, {"id": 88, "start": 776.96, "end": 799.32, "text": "Await, ganz, ganz abartig, ja genau das meine ich, guckt euch das mal an, ganz im Ernst,"}, {"id": 89, "start": 799.32, "end": 810.12, "text": "die haben sie nicht mehr alle, ja, das sieht erstmal easy aus, ja, bis du dann feststellst,"}, {"id": 90, "start": 810.12, "end": 814.44, "text": "das Beispiel funktioniert so ohne weiteres gar nicht, weil du Tokyo nicht installiert"}, {"id": 91, "start": 814.44, "end": 819.56, "text": "hast und Async darf nicht Main sein, stellt man dann fest und dann stellt man fest, was"}, {"id": 92, "start": 819.56, "end": 824.64, "text": "zum Teufel ist Box, dünn, Standard, Error, Error und dann wird man feststellen, ach fuck,"}, {"id": 93, "start": 824.64, "end": 829.92, "text": "es geht ja nur, wenn das Fragezeichen hinten am Await dran ist, dass er das anpackt in"}, {"id": 94, "start": 829.92, "end": 834.44, "text": "den Error, das heißt, wenn du was anderes als Return Word irgendwo hast außer Box, dünn,"}, {"id": 95, "start": 834.44, "end": 839.32, "text": "Standard, Error, Error, dann funktioniert es nicht, also ganz ehrlich, das ist wirklich,"}, {"id": 96, "start": 839.32, "end": 848.24, "text": "das ist echt Way to Dank, ja, warum haben wir das eigentlich mal als E-Mode, ich hatte"}, {"id": 97, "start": 848.24, "end": 863.28, "text": "das doch mal als E-Mode, jetzt haben wir es wieder, jetzt haben wir es wieder, ja, wir"}, {"id": 98, "start": 863.28, "end": 866.8, "text": "müssten das, wir müssten das eigentlich haben, haben wir aber nicht, ich hab's jetzt,"}, {"id": 99, "start": 866.8, "end": 877.0, "text": "Leute Refreshed mal und probiert noch mal aus, ich hab's jetzt aktiviert, Way to Dank,"}, {"id": 100, "start": 877.0, "end": 885.16, "text": "jawoll, ne Moment, die Animation fehlt, eigentlich sollte es eine Animation haben, oder, ach,"}, {"id": 101, "start": 885.16, "end": 890.04, "text": "ich hab das falsche, Leute, ich hab das falsche geedit, ich hab das falsche geedit, ich hab"}, {"id": 102, "start": 890.04, "end": 901.84, "text": "das ohne, ich brauch die Animation, haben die das irgendwie entfernt, ok, ich hab's"}, {"id": 103, "start": 901.84, "end": 919.36, "text": "wieder geedit, jetzt mit Animation, testen wir noch mal, oh, jetzt hat's noch gar nicht"}, {"id": 104, "start": 919.36, "end": 928.68, "text": "gecheckt, noch nicht, aber ich hab's geedit, jetzt hab ich am Better Twitch TV geedit"}, {"id": 105, "start": 928.68, "end": 936.48, "text": "und Better Twitch TV checkt's noch nicht, alter, was ist hier los, ohne ordentlichen"}, {"id": 106, "start": 936.48, "end": 951.12, "text": "E-Mode Support geht hier nix, eh, ja, anscheinend, ich hab's jetzt aber aktiviert, das hatten"}, {"id": 107, "start": 951.12, "end": 954.76, "text": "wir auch schon mal aktiviert, ich glaub, das haben die entfernt oder das, was ich hinzugefügt"}, {"id": 108, "start": 954.76, "end": 963.36, "text": "hab, hatten die entfernt, keine Ahnung, so, jetzt machen wir hier mal n bisschen zu, guck"}, {"id": 109, "start": 963.36, "end": 983.12, "text": "mal hier, was hier schon wieder, ich hab hier 30 Milliarden Tabs auf, gut, so, oh man, muss"}, {"id": 110, "start": 983.12, "end": 991.16, "text": "erst mal in Broggers Stimmung kommen, Leute, Gachibas, gibt's Neuigkeiten zum Job, seitdem"}, {"id": 111, "start": 991.16, "end": 994.68, "text": "die Homeoffice Pflicht wieder eingeführt wurde, die wurde doch gar nicht wieder eingeführt,"}, {"id": 112, "start": 994.68, "end": 1000.92, "text": "es wird doch wieder nur empfohlen, das zu machen, oder, Moment, Homeoffice, das ist doch wieder"}, {"id": 113, "start": 1000.92, "end": 1023.76, "text": "so komplettes Wischiwaschi gewesen, ach so, die Office Pflicht, ja, gut, ne, gibt's nix"}, {"id": 114, "start": 1023.76, "end": 1035.92, "text": "Neues, wie gesagt, also, außer, dass ich garantiert nie wieder, komplette Woche irgendwie"}, {"id": 115, "start": 1035.92, "end": 1048.08, "text": "nach Frankfurt gehe, aktuell, eins, zwei Tage die Woche, Office, und wenn das in irgendeiner"}, {"id": 116, "start": 1048.08, "end": 1056.2, "text": "Art und Weise weiter forciert wird, bin ich weg, also, dass noch mehr, noch mehr gemacht"}, {"id": 117, "start": 1056.2, "end": 1061.92, "text": "werden soll, Cookie, Dankeschön für den Sub, gibt es irgendwie Spezialeinstellungen"}, {"id": 118, "start": 1061.92, "end": 1067.38, "text": "um ihn vor allem, ja, musst du, du musst, folgendes musst du machen, also, erstens solltest"}, {"id": 119, "start": 1067.38, "end": 1075.92, "text": "du kein Gnome verwenden und auch kein KDE, vor allem nicht mit Effekten an, das funktioniert,"}, {"id": 120, "start": 1075.92, "end": 1080.72, "text": "funktioniert auch ganz brauchbar, aber macht's unnötig langsam, am besten du verwendest"}, {"id": 121, "start": 1080.72, "end": 1085.68, "text": "irgendwas mit Low Performance Impact, sowas wie XFCE oder so, oder wie ich, irgendwas"}, {"id": 122, "start": 1085.68, "end": 1091.52, "text": "mit i3, und das wichtigste ist, du musst das hier einschalten, das erste Mal, du gibst"}, {"id": 123, "start": 1091.52, "end": 1096.24, "text": "dem Ding immer ordentlich CPUs, so, und du gibst dem Ding auch immer ordentlich RAM,"}, {"id": 124, "start": 1096.24, "end": 1101.96, "text": "also, ich hab vier CPU, kein 16GB RAM, das ist schon mal gut, und das musst du hier machen,"}, {"id": 125, "start": 1101.96, "end": 1107.72, "text": "Accelerate 3D Graphics, und dann kannst du sowas wie Peacom oder so starten, in deiner"}, {"id": 126, "start": 1107.72, "end": 1113.32, "text": "Linux Kiste, dann hast du auch ein bisschen Transparenz und das Ganze ist schneller, aber"}, {"id": 127, "start": 1113.32, "end": 1117.28, "text": "das musst du auf jeden Fall, das Häkchen hier musst du auf jeden Fall setzen, glaub"}, {"id": 128, "start": 1117.28, "end": 1142.76, "text": "das war's, mehr war's nicht, QEMU ist fucking langsam, was ganz gut ist, ist KVM, was,"}, {"id": 129, "start": 1142.76, "end": 1148.8, "text": "ich sag mal so, Teile von QEMU verwendet, aber QEMU selbst ist wirklich das Langsamste,"}, {"id": 130, "start": 1148.8, "end": 1158.6, "text": "was es gibt, aber ernsthaft, Desktop-Virtualisierung ist, also man darf von abgesehen, dass es"}, {"id": 131, "start": 1158.6, "end": 1165.04, "text": "kein KVM unter Windows gibt, aber Desktop-Virtualisierung ist Forever Workstation und Virtual Box immer"}, {"id": 132, "start": 1165.04, "end": 1181.88, "text": "noch besser, ja dann gibt der vm8 oder so, das reicht ja, hat schon mal jemand von euch"}, {"id": 133, "start": 1181.88, "end": 1190.36, "text": "versucht mit QEMU ein Raspberry Pi zu emulieren, also quasi eine Armkiste auf x86, ich sag"}, {"id": 134, "start": 1190.36, "end": 1205.68, "text": "euch, das ist an Langsamheit kaum zu überbieten, oh Leute irgendwie bin ich müde, ich weiß"}, {"id": 135, "start": 1205.68, "end": 1210.68, "text": "nicht warum, als ich angefangen hab zu streamen, weil ich es noch nicht, ich muss jetzt erstmal"}, {"id": 136, "start": 1210.68, "end": 1219.68, "text": "irgendwie, wir müssen jetzt irgendwie mich aufwecken, weil sonst ist Badge, Alter, bevor"}, {"id": 137, "start": 1219.68, "end": 1222.96, "text": "wir anfangen, weil wenn ich müde bin, kann ich nicht gescheit nachdenken, wenn ich nicht"}, {"id": 138, "start": 1222.96, "end": 1227.4, "text": "gescheit nachdenken kann, dann kann ich nicht keinen Brokker-Stalls machen, bist du um 18"}, {"id": 139, "start": 1227.4, "end": 1228.4, "text": "Uhr aufgestanden?"}, {"id": 140, "start": 1228.4, "end": 1234.88, "text": "Nee, ich nicht, ich bin ganz normal aufgestanden, halb 8, fertig, so wie immer, da selbstfalls"}, {"id": 141, "start": 1234.88, "end": 1241.56, "text": "kein Aufwachstream gab, ja gut heute ist Samstag, morgen gibt es den Aufwachstream, ich trinke"}, {"id": 142, "start": 1241.56, "end": 1255.08, "text": "keinen Kaffee, ich bin glaube ich der einzige Informatik-Kurs, der keinen Kaffee trinkt,"}, {"id": 143, "start": 1255.08, "end": 1272.72, "text": "ja genau, ist Informatik Studierend Pflicht um einen Job zu finden?"}, {"id": 144, "start": 1272.72, "end": 1281.64, "text": "Nee, ist es nicht, wer sagt denn sowas, das ist Schwachsinn, also falls das irgendjemand"}, {"id": 145, "start": 1281.64, "end": 1297.0, "text": "erzählt hat, ist Blödsinn, muss keine Informatik studiert haben, da bist du mit Low Power x86"}, {"id": 146, "start": 1297.0, "end": 1306.64, "text": "Kisten billiger dran, aktuell als mit Raspberry Pis, Low Power x86 Kiste, x86 Board mit drauf"}, {"id": 147, "start": 1306.64, "end": 1316.44, "text": "gelöteter CPU, 60 Euro, Raspberry Pi 140, richtig sinnlos, warum geht Way to Dank immer"}, {"id": 148, "start": 1316.44, "end": 1336.44, "text": "noch nicht, ich hab's geadded, es ist einfach Way to Dank, ist einfach zu"}, {"id": 149, "start": 1336.44, "end": 1350.96, "text": "langsam, wie das geadded wird, ja 2GB ist, naja gerade mal so, ich sag mal so die 2GB"}, {"id": 150, "start": 1350.96, "end": 1355.52, "text": "Variante, ist normalerweise kostet die Hälfte oder so, für den Preis gibt es normalerweise"}, {"id": 151, "start": 1355.52, "end": 1362.12, "text": "die 4GB Variante, aber gut, gibt es den überhaupt bei Berry Base aktuell, das letzte Mal wo"}, {"id": 152, "start": 1362.12, "end": 1376.92, "text": "ich geguckt hab, war eigentlich so gut wie gar nichts lieferbar, was ist mit der Seite"}, {"id": 153, "start": 1376.92, "end": 1400.76, "text": "los, ich hatte ja mal gescheit suche hier, naja, gibt's doch gar nicht."}, {"id": 154, "start": 1407.92, "end": 1423.28, "text": "Gibt's doch überhaupt nicht, alles nicht verfügbar, also ich weiß nicht wie du drauf"}, {"id": 155, "start": 1423.28, "end": 1427.04, "text": "kommst, dass es das gerade gibt, also das sieht für mich nicht so aus, als gibt es"}, {"id": 156, "start": 1427.04, "end": 1436.88, "text": "das gerade, man muss sich in Berry Base Club anmelden, da sieht man Sachen die man nicht"}, {"id": 157, "start": 1436.88, "end": 1440.2, "text": "auf ihrer Homepage sieht, das ist aber auch ziemlich bescheuert, die Leute wollen sich"}, {"id": 158, "start": 1440.2, "end": 1444.84, "text": "da nicht im Club anmelden um was zu kaufen, dann kaufe ich da halt nichts, doch, doch"}, {"id": 159, "start": 1444.84, "end": 1461.84, "text": "sind Mods da, was ist da die heutige Aufgabe, da hab ich ein Video zugemacht, guck mal,"}, {"id": 160, "start": 1461.84, "end": 1469.72, "text": "weiß der Titel nicht, hier das da, kannst du dir angucken, das ist so, ich hab bestimmt"}, {"id": 161, "start": 1469.72, "end": 1482.84, "text": "die Hälfte vergessen, aber das passt schon, achso, weil Modcheck, ne, sind kein Raspberry"}, {"id": 162, "start": 1482.84, "end": 1493.84, "text": "Pi Stars, der Berry Base Club, was nicht alles gibt, ok Moment, Berry Base Club, wir melden"}, {"id": 163, "start": 1493.84, "end": 1505.96, "text": "uns jetzt mit beim Berry Base Club an, wo geht das, Berry Base Club, das da, alter was"}, {"id": 164, "start": 1505.96, "end": 1511.72, "text": "ist das für ne Zeit, jaja ich will Club Mitglied werden unbedingt, alles klar, Sekunde, 10"}, {"id": 165, "start": 1511.72, "end": 1532.36, "text": "Minute Mails, also ich bin Privatkunde, Anrede, Divers, Titel, Omega, Omega, Keg, W, in die"}, {"id": 166, "start": 1532.36, "end": 1541.68, "text": "Zwischenablage kopieren, zack, ihr Passwort, ok ich geb mal random irgendwas ein, oh mein"}, {"id": 167, "start": 1541.68, "end": 1548.76, "text": "Gott, überprüfen die das mit dem Telefon, ich hoffe nicht, Moment, ist das hier Passwort,"}, {"id": 168, "start": 1548.76, "end": 1558.12, "text": "ne E-Mail Adresse, achso, ihre Adresse, ok, jaja, der Maker Club, alles klar, Straße,"}, {"id": 169, "start": 1558.12, "end": 1576.32, "text": "Cackle Street 1, 60329 Frankfurt, Hessen, Deutschland, Frankfurt, Geburtsdatum 18.10.1953, jaja schickt"}, {"id": 170, "start": 1576.32, "end": 1597.44, "text": "mir alles, weiter, vielen Dank für eure Anmeldung, ok, noch ist nichts da, so und jetzt seh ich"}, {"id": 171, "start": 1597.44, "end": 1627.04, "text": "was oder wie, ah haben sie gut überprüft, jaja gut, alles klar, so Maker Club, ok, ich"}, {"id": 172, "start": 1627.04, "end": 1656.8, "text": "überprüfen es tatsächlich, ja da wird das wohl eher nix, ja gut, dann, ok, dann, ok,"}, {"id": 173, "start": 1656.8, "end": 1669.88, "text": "dann nicht, na gut, also, dann wollen wir mal, habt ihr, achja, Chet, ich bin ja da immer"}, {"id": 174, "start": 1669.88, "end": 1676.04, "text": "nicht so auf dem Laufenden, ich hab nur wieder heute Morgen den Fehler gemacht und hab auf"}, {"id": 175, "start": 1676.04, "end": 1681.68, "text": "Twitter Deutschland geguckt und da war Lindner Gate am Trenden, was hat er denn angestellt,"}, {"id": 176, "start": 1681.68, "end": 1688.92, "text": "hat er noch mal geheiratet oder was ist jetzt schon wieder los, eine Frage zu VMWare, worin"}, {"id": 177, "start": 1688.92, "end": 1694.2, "text": "unterscheidet sich Number of Processors und Number of Corporate Processor, das ist rein"}, {"id": 178, "start": 1694.2, "end": 1701.64, "text": "für die Optik, was die VM sieht, was du hier weiter gibst, ist die Anzahl der CPUs, die"}, {"id": 179, "start": 1701.64, "end": 1709.12, "text": "deine VM sieht und das hier, wie viele Cores pro CPU, also wenn du zum Beispiel zwei Prozessoren"}, {"id": 180, "start": 1709.12, "end": 1714.8, "text": "einstellst mit zwei Cores, dann siehst du in deiner VM, na gut, zwei CPUs mit jeweils"}, {"id": 181, "start": 1714.8, "end": 1720.24, "text": "zwei Cores, also insgesamt vier, wenn du eine CPU einstellst und vier Cores, dann siehst"}, {"id": 182, "start": 1720.24, "end": 1727.04, "text": "du auch vier Cores, allerdings nur von einer CPU, das macht nicht wirklich einen großen"}, {"id": 183, "start": 1727.04, "end": 1737.52, "text": "Unterschied, ich stelle in der Regel immer CPU Cores ein, weil Boards und mit Multi-CPUs"}, {"id": 184, "start": 1737.52, "end": 1741.8, "text": "so gut wie kaum im Einsatz sind und falls irgendwie deine Software trotzdem nachguckt,"}, {"id": 185, "start": 1741.8, "end": 1750.92, "text": "ist es immer besser eine CPU mehrere Cores zuzunehmen, wegen E-Fuels, ja E-Fuels sind"}, {"id": 186, "start": 1750.92, "end": 1755.16, "text": "nicht so beliebt, Tainser, danke schön, danke für den Sub, warum eigentlich, also Leute,"}, {"id": 187, "start": 1755.16, "end": 1761.0, "text": "ihr wisst, ich fahre so gut wie kein Auto, mich interessiert auch das ganze Autothema"}, {"id": 188, "start": 1761.0, "end": 1775.12, "text": "nicht wirklich großartig, was ist an E-Fuels so schlimm, ja vielleicht hat es auch irgendwelche"}, {"id": 189, "start": 1775.12, "end": 1784.24, "text": "Vorteile, keine Ahnung, der Wirkungsgrad sackt extrem, also wenn ich das richtig im Kopf"}, {"id": 190, "start": 1784.24, "end": 1792.0, "text": "habe, E-Fuels ist doch die Geschichte, die man quasi in normale Autos tanken kann, was"}, {"id": 191, "start": 1792.0, "end": 1805.16, "text": "aber jetzt nicht klassische Benzinsachen sind, sondern halt hergestellt aus Strom und Zeug,"}, {"id": 192, "start": 1805.16, "end": 1810.28, "text": "also quasi, sagt wenn ich Scheiße erzähle, kann sein, ich habe keine Ahnung von dem Thema,"}, {"id": 193, "start": 1810.28, "end": 1819.32, "text": "also sprich, so klassischer Treibstoff für Boomer-Auto, Autos auf neue Art und Weise"}, {"id": 194, "start": 1819.32, "end": 1829.12, "text": "hergestellt, aber guckt mal, warum ist das schlimm sich in dem Bereich irgendwie Gedanken"}, {"id": 195, "start": 1829.12, "end": 1835.52, "text": "zu machen, also ich finde es jetzt erstmal nicht so verwerflich, also ich meine vielleicht"}, {"id": 196, "start": 1835.52, "end": 1843.04, "text": "fällt hier irgendeinem voll das krasse Rezept für E-Fuel ein, dass das, keine Ahnung und"}, {"id": 197, "start": 1843.04, "end": 1846.92, "text": "vor allem wenn die Energie aus erneuerbaren Energiequellen hergestellt wird, ist das doch"}, {"id": 198, "start": 1846.92, "end": 1854.64, "text": "wahrscheinlich auch gar nicht mehr so schlecht oder, weil ich meine bis alle Autos durch"}, {"id": 199, "start": 1854.64, "end": 1864.32, "text": "Elektroautos ersetzt sind, das wird doch auf jeden Fall noch ziemlich lange dauern, ist"}, {"id": 200, "start": 1864.32, "end": 1870.36, "text": "für Laster und Flugzeuge gedacht, ja gerade die wirst du wahrscheinlich nie, gerade Flugzeuge"}, {"id": 201, "start": 1870.36, "end": 1876.8, "text": "wirst du nie durch Elektroflugzeuge ersetzen gescheit, also Elektroflugzeuge funktioniert"}, {"id": 202, "start": 1876.8, "end": 1888.2, "text": "nicht gescheit, also weiß nicht, ja gut ich weiß jetzt auch nicht was da war, aber das"}, {"id": 203, "start": 1888.2, "end": 1899.6, "text": "klingt jetzt erstmal gar nicht so bescheuert sich damit zu beschäftigen, ja ja ich meine"}, {"id": 204, "start": 1899.6, "end": 1903.96, "text": "es gibt doch tausende, wir wollen ins Weltall fliegen, Startups und außer SpaceX hat da"}, {"id": 205, "start": 1903.96, "end": 1912.48, "text": "glaube ich doch keiner gescheit was hingekriegt oder wir bohren Tunneln und machen Überschall"}, {"id": 206, "start": 1912.48, "end": 1933.12, "text": "Füge rein und sowas, ja ich wie gesagt ich kenne mich da mit null aus, aber was ist denn"}, {"id": 207, "start": 1933.12, "end": 1941.04, "text": "wenn jetzt irgendeiner super krasse neue Verfahren findet das herzustellen, vielleicht ist das"}, {"id": 208, "start": 1941.04, "end": 1950.4, "text": "besser, also was ich meine ist ich weiß ja nicht was die vorhaben ja, aber vielleicht"}, {"id": 209, "start": 1950.4, "end": 1959.52, "text": "ist es sinnvoll in dem Gebiet trotzdem weiter zu gucken, ja gut das ist leider überall"}, {"id": 210, "start": 1959.52, "end": 1966.88, "text": "so, finde ich auch kacke, an so vielen Stellen guckt euch das an mit irgendwelchen Corona"}, {"id": 211, "start": 1966.88, "end": 1972.68, "text": "medizinischen Maskenherstellern was da gelaufen ist mit ja wir vergeben den Auftrag zufällig"}, {"id": 212, "start": 1972.68, "end": 1980.96, "text": "an einen den wir kennen aber auch nur weil es der beste ist, ja ganz bestimmt, weil ich"}, {"id": 213, "start": 1980.96, "end": 1990.08, "text": "glaube halt das noch ganz schön lange selbst wenn jetzt der Elektroauto Hype Train angelaufen"}, {"id": 214, "start": 1990.08, "end": 1997.0, "text": "ist und viele neue Elektroautos sind aber also ich glaube nicht das jetzt so kurz oder lange"}, {"id": 215, "start": 1997.0, "end": 2003.96, "text": "alles Elektroautos sein werden, ich meine die Leute die ein gut funktionierendes Auto"}, {"id": 216, "start": 2003.96, "end": 2007.84, "text": "haben mit klassischem Motor die werden sich jetzt ja kein Elektroauto kaufen, zumal das"}, {"id": 217, "start": 2007.84, "end": 2013.52, "text": "wahrscheinlich ja jetzt wie gesagt erzählt mir wenn ich das erzähle aber wahrscheinlich"}, {"id": 218, "start": 2013.52, "end": 2019.24, "text": "ist die umweltschonendste Variante immer noch das alte Auto weiter zu fahren ich meine"}, {"id": 219, "start": 2019.24, "end": 2026.56, "text": "das Ding ist schon produziert das Ding hat schon verbraucht an Ressourcen also sich ein"}, {"id": 220, "start": 2026.56, "end": 2031.4, "text": "neues Auto kaufen kann wahrscheinlich gar nicht umweltfreundlicher sein als das alte"}, {"id": 221, "start": 2031.4, "end": 2038.32, "text": "weiter zu benutzen bis es auseinanderfällt, ja gut dann kauft sich das ja auch wirklich"}, {"id": 222, "start": 2038.32, "end": 2054.84, "text": "kein Mensch, naja aber wenn e-fuels dann umwelt irgendwann mal vielleicht umweltfreundlicher"}, {"id": 223, "start": 2054.84, "end": 2060.24, "text": "werden als klassische Benzin und Diesel und Super und alles, ja das kannst du vergessen"}, {"id": 224, "start": 2060.24, "end": 2067.2, "text": "da kommst du ja nie an, ich hab da meine Erfahrung kannst du ja knicken, ich weiß"}, {"id": 225, "start": 2067.2, "end": 2070.84, "text": "ich hab aber es ist halt mega für den Arsch und das ist eigentlich das was mich bei dieser"}, {"id": 226, "start": 2070.84, "end": 2075.92, "text": "ganzen Diskussion immer am meisten auf den Sack geht, dass immer nur gesagt wird so nach"}, {"id": 227, "start": 2075.92, "end": 2081.04, "text": "dem Motto ja da müssen wir halt gucken dass der öffentliche Nahverkehr verbessert wird"}, {"id": 228, "start": 2081.04, "end": 2088.08, "text": "es verbessert keiner was das wird seit Jahren immer beschissener, die Leute das labern"}, {"id": 229, "start": 2088.08, "end": 2095.52, "text": "fahren selbst überhaupt nicht mit dem Zug, ja das ist natürlich beschissen das 9 Euro"}, {"id": 230, "start": 2095.52, "end": 2100.72, "text": "Ticket sollte unbedingt da bleiben, vielleicht nicht als 9 Euro Ticket, vielleicht als keine"}, {"id": 231, "start": 2100.72, "end": 2106.8, "text": "Ahnung 90 Euro Ticket, 90 Euro für deutschlandweit wäre immer noch viel billiger als was die"}, {"id": 232, "start": 2106.8, "end": 2122.28, "text": "meisten Leute an Monatskarten kaufen, 90 Euro deutschlandweit wäre richtig Pog, ja sowas"}, {"id": 233, "start": 2122.28, "end": 2127.12, "text": "ist gut, das ist dann das scheitert aber ich finde es muss deutschlandweit sein weil das"}, {"id": 234, "start": 2127.12, "end": 2132.48, "text": "scheitert sonst oder 69 Euro Ticket das wäre gut, weil sonst scheitert das wieder bei Leuten"}, {"id": 235, "start": 2132.48, "end": 2136.72, "text": "die bei mir ja um die Ecke in Bayern wohnen und zwei Stationen durch Bayern fahren müssen"}, {"id": 236, "start": 2136.72, "end": 2140.88, "text": "und den Rest nach Hessen zu Frankfurt und so, das ist wieder unglaublich Bürokratie"}, {"id": 237, "start": 2140.88, "end": 2147.96, "text": "und behaftet, deswegen 90 Euro deutschlandweit scheiß drauf fertig, dann benutzen das die"}, {"id": 238, "start": 2147.96, "end": 2153.52, "text": "Leute auch mal und vielleicht merkt dann auch mal ein Großteil der Bevölkerung was für"}, {"id": 239, "start": 2153.52, "end": 2164.28, "text": "absolut bodenlose Frecher und was für bodensatz die Bahn ist und dann tut sich vielleicht"}, {"id": 240, "start": 2164.28, "end": 2174.32, "text": "mal irgendwann was, ich glaube ohne mehr Druck aus der Bevölkerung tut sich da nichts, meint"}, {"id": 241, "start": 2174.32, "end": 2181.84, "text": "ihr, jetzt mal blöd, meint ihr, meint ihr, die Bahn, das Bahnmanagement, sagen wir mal"}, {"id": 242, "start": 2181.84, "end": 2189.44, "text": "so mittleres, oberes Bahnmanagement, Vorstand, Führungskräfte und so, meint ihr die fahren"}, {"id": 243, "start": 2189.44, "end": 2197.36, "text": "mit der Bahn zur Arbeit, die die können, ernsthaft jetzt, weil ich kann es mir nicht vorstellen"}, {"id": 244, "start": 2197.36, "end": 2212.72, "text": "ehrlich gesagt, also da wo ich fahre geht nichts mit der Bahn, kannst du knicken, das"}, {"id": 245, "start": 2212.72, "end": 2216.72, "text": "ist das falsche Projekt, das ist pepo fetter, wir wollen nicht pepo fetter aufmachen, wir"}, {"id": 246, "start": 2216.72, "end": 2227.04, "text": "wollen den postchamp aufmachen, der muss postchampen, postchamping, kannst du ja auch nicht machen,"}, {"id": 247, "start": 2227.04, "end": 2232.08, "text": "du fährst ja auf den Gleisen von der deutschen Bahn, das ist ja das Problem, es gibt ja Sachen"}, {"id": 248, "start": 2232.08, "end": 2242.12, "text": "wie Flixtrain oder bei uns die hessische Landesbahn oder so Trittanbieter, die aber die Gleise"}, {"id": 249, "start": 2242.12, "end": 2271.24, "text": "benutzen und das ist das eigentliche Problem, spukige Musik, viel zu spukig, privat Gleise,"}, {"id": 250, "start": 2271.24, "end": 2279.92, "text": "das hat noch keiner gemacht bisher, das wird auch die nächsten 40 Jahre dann wahrscheinlich"}, {"id": 251, "start": 2279.92, "end": 2295.16, "text": "nix, ich sehe das übrigens genau, sehe ich übrigens auch so, es muss deutlich mehr persönliches"}, {"id": 252, "start": 2295.16, "end": 2310.64, "text": "Interesse her, der Bahnmanagements die Sache ordentlich zu managen, das muss ganz klar"}, {"id": 253, "start": 2310.64, "end": 2321.32, "text": "persönliche Interessen daran hängen und sei es nur, dass man seinen Job behält, ja guck"}, {"id": 254, "start": 2321.32, "end": 2326.68, "text": "mal in die Schweiz, da funktioniert das auch besser, das funktioniert eigentlich in allen"}, {"id": 255, "start": 2326.68, "end": 2333.6, "text": "Ländern mit Geld besser als bei uns und es ist ja nicht als hätten wir zu wenig Geld,"}, {"id": 256, "start": 2333.6, "end": 2337.64, "text": "wie gesagt ich kann es nicht oft genug sagen, wir sind zumindest was Wirtschaft angeht das"}, {"id": 257, "start": 2337.64, "end": 2341.84, "text": "viertreichste Land der Welt, aber im Moment Leute wir müssen uns ja aktuell Gedanken"}, {"id": 258, "start": 2341.84, "end": 2346.36, "text": "drüber machen, dass wir nicht frieren müssen im Winter, ich kann es vergessen, als viertreichstes"}, {"id": 259, "start": 2346.36, "end": 2356.64, "text": "Land der Welt kann es schon mal passieren, dass man frieren muss im Winter, das ist tatsächlich,"}, {"id": 260, "start": 2356.64, "end": 2361.64, "text": "das habe ich auch gelesen und die Telekom verdient angeblich richtig fett Geld in den"}, {"id": 261, "start": 2361.64, "end": 2369.76, "text": "USA mit, weiß ich, ist es Mobilfunk, keine Ahnung, mit Zeug, die sollen alle mal ihren"}, {"id": 262, "start": 2369.76, "end": 2373.68, "text": "Scheiß zusammen kriegen und hierfür ordentliche Infrastruktur sorgen, das geht mir mega auf"}, {"id": 263, "start": 2373.68, "end": 2379.68, "text": "den Sack, dass du dir hier teilweise vorkommst, wie irgendwie in einem dritten Weltland was"}, {"id": 264, "start": 2379.68, "end": 2389.44, "text": "Infrastruktur angeht, Müsli, danke schön für den Zap, so aber jetzt mal zu etwas erfreulicheren"}, {"id": 265, "start": 2389.44, "end": 2396.04, "text": "Themen, wir basteln jetzt, wir basteln jetzt ein bisschen Go weiter und ich habe festgestellt,"}, {"id": 266, "start": 2396.04, "end": 2402.04, "text": "als ich mir mal so Gedanken gemacht habe gestern über Go, es ist ja schön und gut, wenn man"}, {"id": 267, "start": 2402.04, "end": 2411.0, "text": "hier irgendwie so Skriptartig, warum ist denn da hinten so ein, aber ich das minimiert habe,"}, {"id": 268, "start": 2411.0, "end": 2415.44, "text": "es ist ja schön und gut, wenn man solche Skriptartigen Dinger basteln kann, aber wie"}, {"id": 269, "start": 2415.44, "end": 2421.92, "text": "würde man denn jetzt zum Beispiel eine Klasse mit unterschiedlichen Methoden machen in Go,"}, {"id": 270, "start": 2421.92, "end": 2425.96, "text": "ich glaube das müssen wir uns mal angucken, also in Go scheint das ja nicht zu funktionieren,"}, {"id": 271, "start": 2425.96, "end": 2434.04, "text": "ja Structs und dann Zeug, das müssen wir mal ausbringen, ich habe wirklich keine Ahnung"}, {"id": 272, "start": 2434.04, "end": 2446.08, "text": "wie das geht und wenn man sagt Go Lang OOP, da findet man zum größten Teil sehr merkwürdige"}, {"id": 273, "start": 2446.08, "end": 2453.36, "text": "Beispiele, so irgendwas was ich sehr komisch liest und ich bin nicht so sicher, ob das"}, {"id": 274, "start": 2453.36, "end": 2462.56, "text": "so funktioniert, ich habe mir gedacht wir könnten ja mal versuchen diese API hier zu"}, {"id": 275, "start": 2462.56, "end": 2476.84, "text": "rappen, die wir hier verwenden, also sowas hier zum Beispiel, Type, Alert Manager, API,"}, {"id": 276, "start": 2476.84, "end": 2480.92, "text": "Struct und jetzt hört es schon auf, jetzt weiß ich nicht mehr wie es weiter geht, ok"}, {"id": 277, "start": 2480.92, "end": 2489.88, "text": "Name, String, ok da kann man dann sowas reinschreiben wie, 100 Milliarden Bits, Dankeschön"}, {"id": 278, "start": 2489.88, "end": 2502.56, "text": "Schattenwellen für den Sub, äh nicht für den Sub, für die Bits, Pong, oh guck mal"}, {"id": 279, "start": 2502.56, "end": 2518.04, "text": "hier gibt es ein Tutorial, excellent, excellent, der Chat weiß Bescheid, also what, Moment"}, {"id": 280, "start": 2518.04, "end": 2524.92, "text": "ich versuche das mal kurz zu übersetzen, also Alert Manager, warum sind manche, guck mal"}, {"id": 281, "start": 2524.92, "end": 2532.96, "text": "Leute das verstehe ich nicht, Sachen wie FMT, die sind klein geschrieben, aber jetzt hier"}, {"id": 282, "start": 2532.96, "end": 2545.56, "text": "werden Typen groß geschrieben, was ist denn Convention so, also schreibt man das groß,"}, {"id": 283, "start": 2545.56, "end": 2551.6, "text": "schreibt man das klein, wobei wartet mal da war doch was, da war doch was, das war doch"}, {"id": 284, "start": 2551.6, "end": 2559.56, "text": "irgendwie ein Unterschied, wenn ich das richtig in Go habe, genau, groß ist exported, stimmt,"}, {"id": 285, "start": 2559.56, "end": 2566.52, "text": "stimmt, ja ja ich erinnere mich, also machen wir hier Alert Manager, API, Struct, Ull,"}, {"id": 286, "start": 2566.52, "end": 2573.8, "text": "so und jetzt kann ich, wie mache ich denn einen Constructor in, also hier guck mal sowas"}, {"id": 287, "start": 2573.8, "end": 2588.04, "text": "zum Beispiel, die Errors, New, so wie kriege ich so eine Art Constructor hin, also was"}, {"id": 288, "start": 2588.04, "end": 2592.72, "text": "ich vor habe ist, ich will dann sowas hier machen können, guck mal, ich will dann sowas"}, {"id": 289, "start": 2592.72, "end": 2601.76, "text": "machen können wie API, Get, Silences, so und vorher will ich machen API, Doppelpunkt, Alert"}, {"id": 290, "start": 2601.76, "end": 2608.56, "text": "Manager, so was hier, New, Alert Manager, API, aber das gibt es nicht, das gibt es nicht,"}, {"id": 291, "start": 2608.56, "end": 2617.32, "text": "also ich weiß, dass man, dass man dann irgendwie sowas hier machen muss, aber gemacht habe"}, {"id": 292, "start": 2617.32, "end": 2624.28, "text": "ich das noch nicht, also so, Alert Manager, der Chat weiß Bescheid, ich copy paste jetzt"}, {"id": 293, "start": 2624.28, "end": 2638.36, "text": "einfach aus dem Chat, easy, Chat copy pasting, beste, aber das war weg, As Manager, achso,"}, {"id": 294, "start": 2638.36, "end": 2656.08, "text": "das ist hier die Variable, wie das intern heißt, so, dann wahrscheinlich so, also dann sage"}, {"id": 295, "start": 2656.08, "end": 2678.24, "text": "ich sowas wie String, so, ne oder, return, ne, so funktioniert das schon mal nicht oder,"}, {"id": 296, "start": 2678.24, "end": 2685.56, "text": "muss ich das, muss ich das return, muss ich das irgendwie so, ok und jetzt, und jetzt kann"}, {"id": 297, "start": 2685.56, "end": 2699.32, "text": "ich machen was, Alert Manager, API, ne, ne, ach, ahja, ahja, ok, verstehe, String, Kackel,"}, {"id": 298, "start": 2699.32, "end": 2724.16, "text": "fertig, ne, doch, ne, was, hä, wie nicht genug Argumente, aber nur eins, hä, wait a minute,"}, {"id": 299, "start": 2724.16, "end": 2730.56, "text": "ich muss Alert Manager übergeben, um einen Alert Manager zu bekommen, muss ich, muss"}, {"id": 300, "start": 2730.56, "end": 2739.28, "text": "ich irgendwie, muss ich irgendwie, what the fuck, das change nicht new, so, so, ne oder,"}, {"id": 301, "start": 2739.28, "end": 2748.44, "text": "das kann doch nicht in den Ernst sein, ne, ne oder, das, ne, Moment, das muss ich jetzt,"}, {"id": 302, "start": 2748.44, "end": 2759.2, "text": "go lang constructor, was ich prokramiere ist ein Tool, wo du, ähm, muss ich dir, muss"}, {"id": 303, "start": 2759.2, "end": 2772.2, "text": "ich dir zeigen, ach, muss ich erst mal starten, Leute, ich glaube, ich, das wird heute nichts,"}, {"id": 304, "start": 2772.2, "end": 2777.88, "text": "ich bin heute nicht irgendwie geistig so zurechnungsfähig, dass ich sinnvoll was machen kann, ne, ne,"}, {"id": 305, "start": 2777.88, "end": 2787.44, "text": "ich glaube, das wird heute nichts, aber ich kann dir erklären, was ich mache, also, bei"}, {"id": 306, "start": 2787.44, "end": 2795.4, "text": "uns auf der Arbeit ist öfters das Problem, also stell dir vor, du machst Wartungsarbeiten"}, {"id": 307, "start": 2795.4, "end": 2803.28, "text": "auf einem System und es ist ja so, dass wenn du Systeme hast im Enterprise Business Umfeld,"}, {"id": 308, "start": 2803.28, "end": 2808.88, "text": "diese Systeme werden ja überwacht, meistens automatisch von irgendeiner Monitoring Software,"}, {"id": 309, "start": 2808.88, "end": 2812.8, "text": "das heißt, wenn das System kaputt geht, bekommt man das mit und nicht erst, wenn dich irgendeiner"}, {"id": 310, "start": 2812.8, "end": 2816.84, "text": "auf der Hotline anruft und sagt, Alter, warum geht dein Service nicht mehr, was bei uns"}, {"id": 311, "start": 2816.84, "end": 2821.36, "text": "jetzt oftmals das Problem ist, dass die Leute, wenn sie Wartungsarbeiten an dem System machen,"}, {"id": 312, "start": 2821.36, "end": 2827.48, "text": "vergessen das Monitoring auszuschalten oder Silence reinzustellen, dass es nicht anschlägt"}, {"id": 313, "start": 2827.48, "end": 2834.36, "text": "für das System, auf dem sie Wartungsarbeiten machen, Python Version anfangen, oh ne Leute,"}, {"id": 314, "start": 2834.36, "end": 2842.44, "text": "ich weiß nicht, was wir heute machen, ich kann irgendwie nicht denken gerade, man müsste"}, {"id": 315, "start": 2842.44, "end": 2852.64, "text": "das in ein neues Package auslagern, das erinnert einen dran, naja, es erinnert einen nicht"}, {"id": 316, "start": 2852.64, "end": 2859.36, "text": "wirklich dran, es macht es einfach, von der Kiste selbst sowas zu setzen, da musst du"}, {"id": 317, "start": 2859.36, "end": 2864.56, "text": "nicht erst anrufen oder in Webinterface oder so, wir haben ja auch schon was, was funktioniert,"}, {"id": 318, "start": 2864.56, "end": 2869.68, "text": "ja, ich habe eine.NET Variante davon, die funktioniert ohne Probleme, oh ne, ich glaube,"}, {"id": 319, "start": 2869.68, "end": 2877.16, "text": "ich kann noch nichts machen, ich kriege heute nichts auf die Reihe, ich merke, dass es gibt"}, {"id": 320, "start": 2877.16, "end": 2881.52, "text": "so Tage, da habe ich nichts, kann ich mich nicht konzentrieren, habe irgendwie nichts"}, {"id": 321, "start": 2881.52, "end": 2886.32, "text": "im Kopf, um sinnvoll was zu machen, ich weiß nicht, gibt es irgendwas auf YouTube, was man"}, {"id": 322, "start": 2886.32, "end": 2900.8, "text": "gucken könnte, GpnEasy VPN, WireGuard wahrscheinlich, PowerShell Syntax, ja PowerShell Syntax ist"}, {"id": 323, "start": 2900.8, "end": 2908.0, "text": "für Automatisierung ganz nice, aber für interaktive Shell gefällt mir PowerShell überhaupt nicht,"}, {"id": 324, "start": 2908.0, "end": 2918.84, "text": "ne Leute, wir machen morgen früh aufwachen Stream, ich mache jetzt, ich streame jetzt"}, {"id": 325, "start": 2918.84, "end": 2924.92, "text": "nicht weiter, ich kann mich heute nicht konzentrieren auf irgendwas, funktioniert nicht, ich bin"}, {"id": 326, "start": 2924.92, "end": 2930.4, "text": "auch nicht motiviert, das ist komisch, ich habe den Stream angeschmissen, habe mir gedacht,"}, {"id": 327, "start": 2930.4, "end": 2936.8, "text": "auf geht's, aber jetzt habe ich irgendwie keinen Bock, ich weiß nicht, eh, ein Battlefield,"}, {"id": 328, "start": 2936.8, "end": 2950.68, "text": "soll man ein Battlefield spielen 2042 oder was, ganz bestimmt nicht 2042, zu wenig Eisen,"}, {"id": 329, "start": 2950.68, "end": 2962.88, "text": "ja vielleicht, Amazon hat es heute wieder richtig verkackt, was Serien und so angeht,"}, {"id": 330, "start": 2962.88, "end": 2971.36, "text": "guckt mal, ich wollte heute morgen eine neue Folge gucken, Serie, hier, also die aktuelle"}, {"id": 331, "start": 2971.36, "end": 2979.56, "text": "Folge dieser Serie läuft bei den Amis, immer Donnerstars glaube ich, 21 da war das, ja"}, {"id": 332, "start": 2979.56, "end": 2980.56, "text": "also am 21."}, {"id": 333, "start": 2980.56, "end": 2987.32, "text": "lief das bei den Amis, normalerweise schaltet Amazon neue Folgen, Freitag, Vormittags frei"}, {"id": 334, "start": 2987.32, "end": 2995.52, "text": "zu, die haben es jetzt tatsächlich geschafft, dass ich die Season gekauft habe, aber Amazon"}, {"id": 335, "start": 2995.52, "end": 3002.64, "text": "sagt, der Season Pass geht dafür irgendwie nicht, was auch immer, das für eine bescheuerte"}, {"id": 336, "start": 3002.64, "end": 3010.56, "text": "Logik ist, so und dann habe ich mich beschwert, dann hat Amazon geantwortet, Amazon hatte tatsächlich"}, {"id": 337, "start": 3010.56, "end": 3023.2, "text": "da drauf geantwortet, ach du dumm, den Typ habe ich gemutet, den Typ habe ich gemutet,"}, {"id": 338, "start": 3023.2, "end": 3038.2, "text": "deswegen lese ich den Scheiß nicht, denn er schreibt, so, genau, sie haben gesagt hier,"}, {"id": 339, "start": 3038.2, "end": 3042.6, "text": "sie geben das weiter, die Serie ist übrigens immer noch nicht da, und dann kam mir noch"}, {"id": 340, "start": 3042.6, "end": 3046.92, "text": "der Hit, ich habe dann, weil Folge 7 habe ich noch nicht geguckt, ich habe dann Folge"}, {"id": 341, "start": 3046.92, "end": 3054.6, "text": "7 angemacht und habe festgestellt, Folge 7 ist eigentlich Folge 8, das heißt, es fehlen"}, {"id": 342, "start": 3054.6, "end": 3061.16, "text": "Folge 7, was im Endeffekt bedeutet, die Leute haben 7 Tage jetzt oder quasi 14 Tage auf"}, {"id": 343, "start": 3061.16, "end": 3067.4, "text": "eine neue Folge gewartet, weil letzte Woche Folge 7 nicht kam, also Amazon ist wirklich"}, {"id": 344, "start": 3067.4, "end": 3074.0, "text": "unfähig, was diese Videosachen angeht, demnächst doch wieder Pirate Bay Gaggle, nee, ich habe"}, {"id": 345, "start": 3074.0, "end": 3076.84, "text": "schon lange nichts mehr gelernt über Tochen und sonst was, ich habe es eigentlich auch"}, {"id": 346, "start": 3076.84, "end": 3090.04, "text": "nicht vor, aber manchmal, manchmal lassen sie einem echt keine andere Wahl, ja, ist"}, {"id": 347, "start": 3090.04, "end": 3104.8, "text": "echt so, ich will ja gar nicht, aber was soll ich machen, er weiß, dass die richtige Folge"}, {"id": 348, "start": 3104.8, "end": 3110.8, "text": "ist ja, ja es gibt neues Level Cap, das gucken wir uns morgen an, ich stelle mal kurz den"}, {"id": 349, "start": 3110.8, "end": 3133.24, "text": "Titel um, solange ich jetzt Just Chatting, bleibe ich noch ein paar Minuten an, mal gucken,"}, {"id": 350, "start": 3133.24, "end": 3137.44, "text": "Titel geändert, Leute, wenn ihr um irgendwas schwätzen wollt, sagt Bescheid, ich bin"}, {"id": 351, "start": 3137.44, "end": 3145.48, "text": "halt so unmotiviert, irgendwas mit Gehirnanstrengungen zu machen, eigentlich müsste ich jetzt mal"}, {"id": 352, "start": 3145.48, "end": 3148.76, "text": "irgendwie kurz hier ums Haus rennen oder so, dass ich wieder wach bin, aber das habe ich"}, {"id": 353, "start": 3148.76, "end": 3159.88, "text": "jetzt auch keinen Bock drauf, welches Video, hier guck das da, achso, oh nein, die Adresse"}, {"id": 354, "start": 3159.88, "end": 3166.84, "text": "wurde gelöscht, bin ich freigeschaltet für den Maker Club, fuck, ey, haben die mich"}, {"id": 355, "start": 3166.84, "end": 3180.68, "text": "gekickt, Moment, wait a minute, ne, Willkommen Keck, passt doch, ey, ey, ich glaube die haben"}, {"id": 356, "start": 3180.68, "end": 3194.68, "text": "meinen Account disabled, weil Fake E-Mail Adresse, die waren aber schnell, ne, doch nicht, schon"}, {"id": 357, "start": 3194.68, "end": 3206.48, "text": "mal eine Fallstudio für eine Bewerbung gemacht, ey, was genau, was soll, ich muss ein bisschen"}, {"id": 358, "start": 3206.48, "end": 3229.84, "text": "genauer erklären, der Maker Club, ach ne, ich bekomme noch nicht funktioniert, ja, Debian"}, {"id": 359, "start": 3229.84, "end": 3247.24, "text": "ist zu alt als Desktop Betriebssystem, achso, ne, das muss ich ja nicht machen, was sind"}, {"id": 360, "start": 3247.24, "end": 3258.48, "text": "das denn so für Aufgaben, sag mal, was musstest du machen so ganz grob, ich mein, die sollen"}, {"id": 361, "start": 3258.48, "end": 3268.78, "text": "da einfach ganz verdammt sind, einen"}, {"id": 362, "start": 3268.78, "end": 3276.78, "text": "Wörten, ja der Klassiker."}, {"id": 363, "start": 3276.78, "end": 3281.58, "text": "Erklären Sie Active Directory in 15 Minuten, proprietärer Microsoft Shit den Microsoft"}, {"id": 364, "start": 3281.58, "end": 3283.54, "text": "und Business Enterprise Leute gut finden."}, {"id": 365, "start": 3283.54, "end": 3291.62, "text": "Neues Feature wurde ausgerollt und neuer Kunde will mehr aber keine."}, {"id": 366, "start": 3291.62, "end": 3316.22, "text": "Das ist doch ganz einfach, dann soll er mehr bezahlen, dann gibt es auch Kapazität."}, {"id": 367, "start": 3316.22, "end": 3329.22, "text": "Und wenn er nicht bezahlen will, dann macht man was anderes."}, {"id": 368, "start": 3329.22, "end": 3337.86, "text": "Easy, genau, einfach Geld, ja muss man ja auch nicht, man muss keine Leute einstellen."}, {"id": 369, "start": 3337.86, "end": 3351.7, "text": "Der muss einfach mehr bezahlen als die anderen, dann arbeitet man an seinem Problem weiter."}, {"id": 370, "start": 3351.7, "end": 3353.7, "text": "Kann jemand das mit dem Binary Tree erklären?"}, {"id": 371, "start": 3353.7, "end": 3364.42, "text": "Ja das ist so eine 0815, mittlerweile ist das schon das richtige Meme geworden, was in Vorstellungsgesprächen"}, {"id": 372, "start": 3364.42, "end": 3371.78, "text": "dran kommt und eines dieser typischen Probleme, was auch immer gememt wird, ist eben Binary"}, {"id": 373, "start": 3371.78, "end": 3372.78, "text": "Tree Inverten."}, {"id": 374, "start": 3372.78, "end": 3382.46, "text": "Zu deutsch, ein Binärbaum wahrscheinlich, vermute ich mal, ja ein Binärbaum geht es"}, {"id": 375, "start": 3382.46, "end": 3392.46, "text": "darum, das ist eine Datenstruktur mit mehreren Knoten, wo jeder Knoten maximal 2 unter Knoten"}, {"id": 376, "start": 3392.46, "end": 3403.82, "text": "haben kann, Kinder tatsächlich, Kindernote, Childnote haben kann."}, {"id": 377, "start": 3403.82, "end": 3422.3, "text": "Ich glaube die richtige Lösung ist, dass man das eskalieren lassen soll bei seinem"}, {"id": 378, "start": 3422.3, "end": 3428.62, "text": "eigenen Chef, ja klar, man selbst kann es ja eh nicht entscheiden."}, {"id": 379, "start": 3428.62, "end": 3435.46, "text": "Was für ein Job war das denn, wo sowas gefragt wird?"}, {"id": 380, "start": 3435.46, "end": 3445.46, "text": "Ich finde das immer bescheuert, wenn das so aus der Luft gegriffene Dinge sind, das sind"}, {"id": 381, "start": 3445.46, "end": 3453.54, "text": "wie dann so Fragen, wo sehen sie sich in 10 Jahren und so ein Blödsinn, Software Ingenieur."}, {"id": 382, "start": 3453.54, "end": 3459.9, "text": "Wisst ihr was, ich hätte gesagt, das soll jemand anderes entscheiden, das ist nicht"}, {"id": 383, "start": 3459.9, "end": 3470.86, "text": "mal ein Bier, genau, das ist wie gesagt, deswegen wird das ja auch immer als Beispiel gebracht,"}, {"id": 384, "start": 3470.86, "end": 3486.74, "text": "die Beine die 3 inverten, oh Mann Leute, ich bin echt im Arsch, ich weiß nicht warum,"}, {"id": 385, "start": 3486.74, "end": 3492.38, "text": "also wer denkt, heute kommt die richtig FyFat-Content, kommt nicht, ich bin jetzt noch viertel Stunde"}, {"id": 386, "start": 3492.38, "end": 3502.42, "text": "an oder so und dann gucke ich irgendwie Serie oder Spiel, Steam, irgendwas oder keine Ahnung,"}, {"id": 387, "start": 3502.42, "end": 3508.3, "text": "ich finde das richtig nice, ich meine das Spielkonzept an sich ist jetzt wirklich nicht"}, {"id": 388, "start": 3508.3, "end": 3518.54, "text": "das innovativste, du läufst rum und suchst irgendwie NPC A, sucht Item B und NPC C hat"}, {"id": 389, "start": 3518.54, "end": 3527.1, "text": "Item B, möchte aber was von NPC A und ja das ist jetzt, das ist eher so ein Entspannungsgame,"}, {"id": 390, "start": 3527.1, "end": 3529.9, "text": "das kann ich jetzt nicht spielen, wenn ich das jetzt spiele, schlafe ich nämlich ein"}, {"id": 391, "start": 3529.9, "end": 3530.9, "text": "dabei."}, {"id": 392, "start": 3530.9, "end": 3538.1, "text": "Ja das habe ich auch schon öfters gesehen, dass es gerade größere Unternehmen in Deutschland"}, {"id": 393, "start": 3538.1, "end": 3542.62, "text": "gibt oder aber auch kleine Klitschen, die meinen sie wären das nächste Google, suchen"}, {"id": 394, "start": 3542.62, "end": 3547.14, "text": "eigentlich überhaupt nicht Leute wie Google, können auch nichts bieten wie Google, aber"}, {"id": 395, "start": 3547.14, "end": 3570.66, "text": "machen auf Google, weder noch aktuell so gut wie gar nichts, ne es gibt nichts, es gibt"}, {"id": 396, "start": 3570.66, "end": 3597.94, "text": "ja nichts, oh schlimm heute, ganz schlimm, ich würde gerne mal einen sinnvollen Vergleich"}, {"id": 397, "start": 3597.94, "end": 3606.46, "text": "sehen zwischen US-Deaf-Gehältern, ich meine das muss nicht Google und Netflix sein, ja"}, {"id": 398, "start": 3606.46, "end": 3616.34, "text": "so mal so 0815 US-Deaf-Gehälter versus 0815 Deutschland-Deaf-Gehälter, allerdings richtig"}, {"id": 399, "start": 3616.34, "end": 3621.08, "text": "gerechnet mit Krankenversicherung und sowas, da könnte ich mir vorstellen, dass sie dort"}, {"id": 400, "start": 3621.08, "end": 3622.58, "text": "auch gar nicht so viel mehr verdienen."}, {"id": 401, "start": 3622.58, "end": 3633.18, "text": "Also wenn man den Kram abzieht dort, den wir hier auch abgezogen bekommen, vielleicht"}, {"id": 402, "start": 3633.18, "end": 3643.54, "text": "nicht in dem ganzen Umfang, ja würde ich auch so schätzen, ich würde auch sagen es ist"}, {"id": 403, "start": 3643.54, "end": 3649.02, "text": "immer noch mehr, aber es ist jetzt nicht so krass wie das teilweise aussieht, wenn du"}, {"id": 404, "start": 3649.02, "end": 3669.26, "text": "dann irgendwie hörst Amazon-Senior-Ding 250.000 Euro oder so, du hast sowas zu tun ja, man"}, {"id": 405, "start": 3669.26, "end": 3679.26, "text": "kann es ja sogar in München von wohnen, wobei das wahrscheinlich auch drauf ankommt wo"}, {"id": 406, "start": 3679.26, "end": 3689.54, "text": "das ist, ja, weiß nicht ob es dort auch den Trend gibt bisschen mehr aufs Land zu gehen,"}, {"id": 407, "start": 3689.54, "end": 3696.02, "text": "bei uns gibt es das ja seit ein paar Jahren, so seit, eigentlich seit Corona so richtig,"}, {"id": 408, "start": 3696.02, "end": 3702.86, "text": "es gibt so ein kleines CAF, da laufe ich beim Wandern öfters durch, das besteht zu 50%"}, {"id": 409, "start": 3702.86, "end": 3709.82, "text": "aus neuen Häusern, also dieses CAF besteht wirklich aus einer Straße, ich kann es euch"}, {"id": 410, "start": 3709.82, "end": 3722.38, "text": "zeigen, Google Maps, Klein Hemsbach, das hört sich auch so an, so, da wandere ich öfters"}, {"id": 411, "start": 3722.38, "end": 3728.54, "text": "mal hier in der Region ja und da laufe ich öfters durch und dieses Dorf, also meist"}, {"id": 412, "start": 3728.54, "end": 3733.82, "text": "läuft man dann so hier so durch oder nach da oben oder hier außen, zumindest dieses"}, {"id": 413, "start": 3733.82, "end": 3740.62, "text": "CAF das besteht zu 50% aus neuen Häusern, weiß gar nicht ob man das überhaupt erkennt,"}, {"id": 414, "start": 3740.62, "end": 3748.82, "text": "das hat nur eine Straße ja, das ist die einzige Straße hier und man erkennt das, wartet mal"}, {"id": 415, "start": 3748.82, "end": 3754.02, "text": "Leute, wie ging das nochmal, wie konnte man, ne ich brauche, ich brauche Google Earth 3D"}, {"id": 416, "start": 3754.02, "end": 3775.18, "text": "brauche ich, Moment das muss ich aber in Google Chrome machen, Earth 3D, ok, Membris, so und"}, {"id": 417, "start": 3775.18, "end": 3792.18, "text": "ich hoffe man kann da kippen, also hier sieht man, also man sieht, was konnte man noch irgendwie"}, {"id": 418, "start": 3792.18, "end": 3798.38, "text": "so kippen das ganze, also man sieht das liegt hier schon ein bisschen in den Bergen ja,"}, {"id": 419, "start": 3798.38, "end": 3806.7, "text": "sieht man ja hier und davon sind, ohne Mist, man erkennt es glaube ich hier so ein bisschen"}, {"id": 420, "start": 3806.7, "end": 3813.46, "text": "an den Baustellen, davon sind 50% der Häuser, das ist übrigens das falsche, das hier so"}, {"id": 421, "start": 3813.46, "end": 3820.82, "text": "richtig so klein Hemsbach, so hier laufe ich dann durch so manchmal von hier unten so hoch"}, {"id": 422, "start": 3820.82, "end": 3827.14, "text": "und 50% der Häuser, man sieht das hier auch teilweise an den Dächern und so, das ist"}, {"id": 423, "start": 3827.14, "end": 3832.06, "text": "alles neu und da sind die ganzen Leute von der Umgebung glaube ich hier hergezogen, ich"}, {"id": 424, "start": 3832.06, "end": 3836.94, "text": "gehe davon aus, wäre ich hier vor 5 Jahren durchgelaufen, wären wahrscheinlich einfach"}, {"id": 425, "start": 3836.94, "end": 3842.34, "text": "so gut wie keine Häuser da gewesen und jetzt ist die ganze Straße voll, aber 50% neue"}, {"id": 426, "start": 3842.34, "end": 3849.42, "text": "Häuser, also es ziehen viele Leute jetzt weg seit Homeoffice möglich ist, in so unter"}, {"id": 427, "start": 3849.42, "end": 3871.78, "text": "anderem so kleine Dinger, ey da gibt es ordentliches Internet wenigstens ja, ist aber nice, es ist"}, {"id": 428, "start": 3871.78, "end": 3879.58, "text": "richtig am Arsch der Welt, es ist richtig am Arsch der Welt, Supermarkt gibt es da auch"}, {"id": 429, "start": 3879.58, "end": 3890.58, "text": "kein, also ich laufe meistens so, ich parke irgendwo hier unten, laufe dann hier lang,"}, {"id": 430, "start": 3890.58, "end": 3898.06, "text": "laufe dann hier so den Berg hoch, Wanderstrecke liegt Leute, laufe dann hier so den Berg"}, {"id": 431, "start": 3898.06, "end": 3910.46, "text": "hoch, laufe dann hier so den Berg hoch, ok das ist verbackt, Berg hoch und dann hier"}, {"id": 432, "start": 3910.46, "end": 3924.7, "text": "hinten durch den Wald zurück so, ja gut so siehts aus, aber mit Aldi und Lidl, ne der"}, {"id": 433, "start": 3924.7, "end": 3932.46, "text": "ist bald bisschen weiter weg, bin seit Corona auch im Homeoffice und wohne jetzt auf dem"}, {"id": 434, "start": 3932.46, "end": 3939.54, "text": "Land, ja kenne ich auch ein paar die das gemacht haben, also ich glaube das Kaff durch das"}, {"id": 435, "start": 3939.54, "end": 3949.74, "text": "ich durchlaufe das hat glaube ich irgendwie 80 Einwohner oder so, also nix, dafür kann"}, {"id": 436, "start": 3949.74, "end": 3954.38, "text": "man da schön wandern und ich stelle es mir für Homeoffice wirklich cool vor, du wohnst"}, {"id": 437, "start": 3954.38, "end": 3963.42, "text": "ein bisschen draußen, es ist kein Krach, es gehen hier keine Leute auf den Sack, du kannst"}, {"id": 438, "start": 3963.42, "end": 3968.58, "text": "draußen rumlaufen, sieht schön aus und rein kannst du ins Haus, machst du Homeoffice und"}, {"id": 439, "start": 3968.58, "end": 3983.18, "text": "verdienst Geld, das ist Pog, haben alle was von, ja dies ist immer noch die gleiche ich"}, {"id": 440, "start": 3983.18, "end": 4001.9, "text": "habe da seit Jahren nix dran gemacht, ne also das stelle ich mir schon nice vor, ich meine"}, {"id": 441, "start": 4001.9, "end": 4005.34, "text": "ich kann mich jetzt hier auch nicht beschweren, bei mir ist es halt so, ich wohne jetzt halt"}, {"id": 442, "start": 4005.34, "end": 4010.66, "text": "nicht wirklich auf dem Land, ich wohne aber jetzt auch nicht in der Großstadt, ich wohne"}, {"id": 443, "start": 4010.66, "end": 4015.78, "text": "so am Rand ein bisschen, dafür ist bei mir halt der Bahnhof in der Nähe, das ist natürlich"}, {"id": 444, "start": 4015.78, "end": 4016.78, "text": "auch super."}, {"id": 445, "start": 4016.78, "end": 4025.74, "text": "Gunray, Dankeschön für den Sub, Leute wie gesagt also wer Big Brain Content heute erwartet"}, {"id": 446, "start": 4025.74, "end": 4033.78, "text": "wird hier nix finden, ja könnte man so sagen, ne es ist nicht wirklich die Vorstadt, es"}, {"id": 447, "start": 4033.78, "end": 4046.22, "text": "ist ein anderer Stadtteil, bisschen weiter, bisschen außerhalb, aber es ist praktisch,"}, {"id": 448, "start": 4046.22, "end": 4052.54, "text": "du bist relativ schnell in Frankfurt und du hast aber ein bisschen mehr deine Ruhe als"}, {"id": 449, "start": 4052.54, "end": 4065.22, "text": "in Frankfurt, meinst du man kann sich irgendwie auf die Ausbildung vorbereiten, naja das einfachste"}, {"id": 450, "start": 4065.22, "end": 4073.66, "text": "ist, hast du schon eine Ausbildungsstelle, wahrscheinlich ne, das einfachste ist dir"}, {"id": 451, "start": 4073.66, "end": 4079.62, "text": "mal anzugucken was die in dem Betrieb machen, wo du hingehst und dich dann dort ein bisschen"}, {"id": 452, "start": 4079.62, "end": 4086.7, "text": "vorbereiten, also was weiß ich, wenn die sagen, hey wir machen total viele, wir haben total"}, {"id": 453, "start": 4086.7, "end": 4093.3, "text": "viele Linux Server, dass du dich da ein bisschen Linux Thematik einliest, so rein im Vakuum"}, {"id": 454, "start": 4093.3, "end": 4102.9, "text": "ohne, kann man da wenig sagen, also raus bekommen was die so machen, wer nicht verkehrt und"}, {"id": 455, "start": 4102.9, "end": 4108.74, "text": "du kannst dir tatsächlich den Plan von der Berufsschule angucken, wobei naja Berufsschule"}, {"id": 456, "start": 4108.74, "end": 4120.66, "text": "halt, ja, Berufsschule kannst du eh vergessen, mit Mac, was ist das für ein Laden, welcher"}, {"id": 457, "start": 4120.66, "end": 4132.34, "text": "IT Ladender arbeitet hauptsächlich mit Mac, Hipster Web Designer vielleicht, auf der anderen"}, {"id": 458, "start": 4132.34, "end": 4138.02, "text": "Seite ganz im Ernst, warum nicht, eigentlich ist es gar nicht blöd mit Macs zu arbeiten,"}, {"id": 459, "start": 4138.02, "end": 4142.5, "text": "wenn du nämlich keinen Bock auf Windows Shit hast und dich nicht mit Linux auf dem Desktop"}, {"id": 460, "start": 4142.5, "end": 4147.1, "text": "rumschlagen willst, was ich verstehen kann, bleibt ja eigentlich nur Mac, wenn man was"}, {"id": 461, "start": 4147.1, "end": 4154.18, "text": "haben will, was irgendwie halbwegs modern ausschaut und alle nötigen Command Line Tools"}, {"id": 462, "start": 4154.18, "end": 4179.22, "text": "und Sachen hat, da bleibt ja eigentlich nur Mac, deswegen, ja, ich glaube nicht, dass"}, {"id": 463, "start": 4179.22, "end": 4187.18, "text": "du Server-Site Rendering meinst, was machst du denn, es ist blöd, dass alle abkürzt und"}, {"id": 464, "start": 4187.18, "end": 4197.5, "text": "mittlerweile schon 5-fach belegt sind, ne Server-Sites Rendering ist SSR, das habe ich jetzt durcheinander"}, {"id": 465, "start": 4197.5, "end": 4223.7, "text": "gebracht, ja, kann ich verstehen, ich schlage mich gerade damit rum, wie wir unsere ganzen,"}, {"id": 466, "start": 4223.7, "end": 4234.26, "text": "wie es heute so modern heißt, Infrastructure as Code, Repos umgezogen bekommen auf GitHub,"}, {"id": 467, "start": 4234.26, "end": 4241.86, "text": "das Problem ist, wir haben da wirklich zehntausende Sachen drinnen über die letzten Jahre angesammelt,"}, {"id": 468, "start": 4241.86, "end": 4251.58, "text": "ich weiß, wir haben immer noch 3000 Linux-Server plus den ganzen Cloud-Krempel und das Problem"}, {"id": 469, "start": 4251.58, "end": 4256.9, "text": "ist, da steht an jeder Ecke, steht ein Passwort, steht ein Zertifikat, steht irgendein Secret,"}, {"id": 470, "start": 4256.9, "end": 4263.74, "text": "ich weiß überhaupt nicht, wie ich das auf GitHub umgezogen bekommen soll jemals, es"}, {"id": 471, "start": 4263.74, "end": 4268.9, "text": "geht einzig und allein erstmal darum, nur das Repo überhaupt erstmal zu pushen zu GitHub,"}, {"id": 472, "start": 4268.9, "end": 4275.42, "text": "ich meine, das ist nicht Public, ja, noch wär ja noch schöner, das ist nicht Public,"}, {"id": 473, "start": 4275.42, "end": 4279.26, "text": "aber sie haben sich überlegt, dass sie in GitHub keine Rechte verwalten wollen, also"}, {"id": 474, "start": 4279.26, "end": 4287.9, "text": "die gesamte Firma mit GitHub Accounts kann alle Repos sehen, nee, nee, nee, so einfach"}, {"id": 475, "start": 4287.9, "end": 4295.3, "text": "ist das nicht, das Repo um das es geht, da stehen Secrets drinnen überall und keiner"}, {"id": 476, "start": 4295.3, "end": 4306.22, "text": "weiß genau wo, das ist ein riesen Repo mit Ansible und Puppet Code, was sich seit 10"}, {"id": 477, "start": 4306.22, "end": 4311.62, "text": "Jahren angesammelt hat für alle unsere Systeme, Leute, an jeder Ecke stehen Secrets, die keiner"}, {"id": 478, "start": 4311.62, "end": 4317.06, "text": "mehr erkennt, jaja, du musst den Kram erstmal finden, das ist das Problem, du kannst ja"}, {"id": 479, "start": 4317.06, "end": 4321.9, "text": "nicht einfach nach Passwort suchen, also ich hab jetzt schon mehrere probiert, ich hab"}, {"id": 480, "start": 4321.9, "end": 4327.7, "text": "zwei Repo-Analyse-Tools laufen lassen, die dir dann so Sachen ausgeben wie, ja, das ist"}, {"id": 481, "start": 4327.7, "end": 4331.38, "text": "ein String, der sieht random aus, das könnte ein Passwort sein und Leute, ich glaube ich"}, {"id": 482, "start": 4331.38, "end": 4339.58, "text": "hab noch 800, über 800 Stellen gefunden, wo Zertifikate, Secrets und Geschiss drin steht,"}, {"id": 483, "start": 4339.58, "end": 4344.82, "text": "das krieg ich da im Leben nicht raus, von unserer Git-History gar nicht mal zu reden,"}, {"id": 484, "start": 4344.82, "end": 4353.06, "text": "die kann ich, die muss ich eh wegschmeißen, da steht zu viel drin, das kann sogar sein,"}, {"id": 485, "start": 4353.06, "end": 4362.5, "text": "dass ich das benutzt hab, ne, ne, das ist was anderes, ne, ne, ich hab, aufbei, ich bin"}, {"id": 486, "start": 4362.5, "end": 4368.78, "text": "mir nicht sicher, ich hab zwei Analyse-Tools laufen lassen, eins hatte auch so in dem Drehsterne,"}, {"id": 487, "start": 4368.78, "end": 4379.94, "text": "es könnte das sogar gewesen sein und das hat massig Zeug gefunden, ja, das muss da irgendwie"}, {"id": 488, "start": 4379.94, "end": 4385.98, "text": "alles raus, also es ist weniger nicht, es ist nicht das Problem, wenn man die gefunden"}, {"id": 489, "start": 4385.98, "end": 4390.94, "text": "hat, die auszulagern, das Problem ist die zu finden und irgendeinen zu finden, der"}, {"id": 490, "start": 4390.94, "end": 4396.5, "text": "für das Auslagern zuständig ist, weil ich kann das ja nicht von Hand machen, ja oder"}, {"id": 491, "start": 4396.5, "end": 4404.9, "text": "neuer Job, ne, ich kann das nicht von Hand machen, weil da hängt ja teilweise die Maintenance"}, {"id": 492, "start": 4404.9, "end": 4409.66, "text": "von Systemen dran, das muss dann schon derjenige machen, der für die Systeme zuständig ist,"}, {"id": 493, "start": 4409.66, "end": 4421.5, "text": "was reingeschrieben wurde und boah, ich werd das auch so machen, ne, ich werd, ich werd"}, {"id": 494, "start": 4421.5, "end": 4427.9, "text": "die History nicht squashen, ich werd einfach den Git-Ordner löschen und ein initiales"}, {"id": 495, "start": 4427.9, "end": 4434.86, "text": "neues Commit machen und dann pushen nach GitHub ohne History, weil in der History stehen"}, {"id": 496, "start": 4434.86, "end": 4438.98, "text": "viel zu viele Passwörter drinnen über die letzten zehn Jahre und sicherlich Passwörter,"}, {"id": 497, "start": 4438.98, "end": 4445.58, "text": "die auch noch in Verwendung sind, das ist eh so ein Ding, so ist es halt in Business"}, {"id": 498, "start": 4445.58, "end": 4457.78, "text": "Enterprise, Stonks Umfeld, Legacy, soweit das Auge reicht, Site Reliable Engineering,"}, {"id": 499, "start": 4457.78, "end": 4474.66, "text": "achja, irgendwie hab ich mit Server-Site Rendering durcheinander gebracht, achja, ey das Repo"}, {"id": 500, "start": 4474.66, "end": 4483.06, "text": "ist so alt, da existiert das Wort DevOps noch nicht mal, immer ganz davon abgesehen,"}, {"id": 501, "start": 4483.06, "end": 4488.82, "text": "da hindert dich auch keiner dran, irgendein Zertifikat in dein Repo zu legen und zu committen,"}, {"id": 502, "start": 4488.82, "end": 4493.94, "text": "gibt halt Leute, die machen das und das war ja an sich, solange das alles intern war gar"}, {"id": 503, "start": 4493.94, "end": 4498.5, "text": "nicht so problematisch, ich mein, wenn du irgendeinen Ansible-Script hast, weil der"}, {"id": 504, "start": 4498.5, "end": 4504.98, "text": "Webserver ein Zertifikat braucht, ja gut, irgendwo muss es herkommen und solange das"}, {"id": 505, "start": 4504.98, "end": 4509.3, "text": "alles intern ist, ist es ja prinzipiell gar nicht so schlimm, dass es geht, Repo zu committen,"}, {"id": 506, "start": 4509.3, "end": 4520.7, "text": "problematisch ist nur, wenn du es halt jetzt nach GitHub pushen sollst, also vielleicht"}, {"id": 507, "start": 4520.7, "end": 4527.54, "text": "ist es, ich kenn eure Entwickler nicht, aber ich hatte letztens eine Begegnung mit einem"}, {"id": 508, "start": 4527.54, "end": 4533.38, "text": "Entwickler von uns, da denk ich mir, es ist besser, dass der kein Ops macht, Riesenstreiterei,"}, {"id": 509, "start": 4533.38, "end": 4539.74, "text": "ich glaub ich hab's schon mal im Stream erzählt, Riesenstreiterei, weil irgendeine App nicht"}, {"id": 510, "start": 4539.74, "end": 4546.22, "text": "mehr ging und es hat sich dann rausgestellt, die App ging nicht mehr, weil die checken nicht"}, {"id": 511, "start": 4546.22, "end": 4551.1, "text": "nur, ob das Zertifikat gültig ist, die haben das Zertifikat gepinnt, also die gucken auch,"}, {"id": 512, "start": 4551.1, "end": 4557.66, "text": "ob der Herausgeber der richtige ist, ja kann man machen, okay, ist aber nur dumm, wenn"}, {"id": 513, "start": 4557.66, "end": 4562.38, "text": "es schon seit eigentlich zwei Jahren oder so die Ansage gibt, dass man von dieser CA"}, {"id": 514, "start": 4562.38, "end": 4566.58, "text": "nix mehr holen soll und so weit wie möglich alles über Let's Encrypt macht, also was"}, {"id": 515, "start": 4566.58, "end": 4571.66, "text": "haben unsere Leute gemacht, Eingangs Zertifikate umgestellt auf Let's Encrypt und auf einmal"}, {"id": 516, "start": 4571.66, "end": 4576.58, "text": "ging die App nicht mehr und alle so, hä, warum geht die App nicht mehr, bis denn irgendeiner"}, {"id": 517, "start": 4576.58, "end": 4580.66, "text": "drauf gekommen ist und hat sich das mal angeguckt und dann festgestellt, naja klar, der Herausgeber"}, {"id": 518, "start": 4580.66, "end": 4589.82, "text": "des Zertifikats ist jetzt ein anderer, so und darauf hin wurde Emergency gemietet mit"}, {"id": 519, "start": 4589.82, "end": 4595.46, "text": "dem Appteam und da war ein Entwickler drin, der hat dann wirklich gesagt, also ich gebe"}, {"id": 520, "start": 4595.46, "end": 4599.54, "text": "zu, ich hab mich vielleicht ein bisschen genervt angehört auf die Meeting, aber trotzdem,"}, {"id": 521, "start": 4599.54, "end": 4605.86, "text": "der hat gemeint, so sinngemäß, ich krieg's, lass mal kurz überlegen, wie hat er das gesagt,"}, {"id": 522, "start": 4605.86, "end": 4617.1, "text": "jaja, Moment, ich krieg das gar nicht mehr richtig zusammen, also wir haben ihm erzählt,"}, {"id": 523, "start": 4617.1, "end": 4622.06, "text": "das alte Zertifikat ist abgelaufen, ja, und wir müssen das tauschen, weil ansonsten ist"}, {"id": 524, "start": 4622.06, "end": 4627.1, "text": "in zwei Wochen der gesamte Eingang halt nicht mehr verfügbar und darauf hin meinte der"}, {"id": 525, "start": 4627.1, "end": 4634.18, "text": "dann so, ja wie abgelaufen, abgelaufen, das Zertifikat ist bis 2035 gültig, da hab ich"}, {"id": 526, "start": 4634.18, "end": 4638.02, "text": "dann gemeint, nein, das Zertifikat ist, ich glaub ich hab mich mehr oder weniger in so"}, {"id": 527, "start": 4638.02, "end": 4641.54, "text": "genau diesem Tonfall angehört, ich glaub das hat ihn auch geärgert, hat er ja auch"}, {"id": 528, "start": 4641.54, "end": 4645.38, "text": "recht, ja trotzdem, das ging mir, ich war schon echt genervt, ich hab dann halt gemeint,"}, {"id": 529, "start": 4645.38, "end": 4653.18, "text": "nein, das ist nicht bis 2035 gültig, das ist abgelaufen, das läuft 14 Tagen ab, deswegen"}, {"id": 530, "start": 4653.18, "end": 4658.3, "text": "haben wir's getauscht, das ist nicht bis 2035 gültig, doch, das ist bis 2035 gültig, er"}, {"id": 531, "start": 4658.3, "end": 4667.06, "text": "hat's doch grade vor sich, nein, das ist nicht bis 2035 gültig, bis 2035, bis 2035 gültig"}, {"id": 532, "start": 4667.06, "end": 4671.66, "text": "ist das Zertifikat von der CA, die uns das ausgestellt haben, aber nicht das Zertifikat"}, {"id": 533, "start": 4671.66, "end": 4679.58, "text": "selber, und der hat bis zum Schluss dieser Besprechung darauf beharrt, dass das Zertifikat"}, {"id": 534, "start": 4679.58, "end": 4687.22, "text": "nicht abläuft und bis 2035 gültig ist, ich weiß nicht was mit den Leuten los ist, also"}, {"id": 535, "start": 4687.22, "end": 4691.94, "text": "da ist es besser, da ist es tatsächlich lieber, ich kann mir aber nicht vorstellen, weißt"}, {"id": 536, "start": 4691.94, "end": 4697.18, "text": "du, was ich mich frage ist, Leute die damit schon Probleme haben, das können doch auch"}, {"id": 537, "start": 4697.18, "end": 4704.98, "text": "keine guten Entwickler sein, gute Entwickler sind Leute mit technischem Knowhow, ich mein,"}, {"id": 538, "start": 4704.98, "end": 4712.9, "text": "die brauchen keine 20 Jahre Linux Erfahrung, aber so ein bisschen drumherum, ist doch eigentlich"}, {"id": 539, "start": 4712.9, "end": 4717.3, "text": "allein schon, weil man sich dafür interessiert, müsste doch so ein bisschen Verständnis dafür"}, {"id": 540, "start": 4717.3, "end": 4721.34, "text": "da sein, ohne ein bisschen Interesse dafür da sein, was da noch so drumherum passiert,"}, {"id": 541, "start": 4721.34, "end": 4731.94, "text": "also ich denke, das gibt es nicht, ich weiß nicht, man kann es mir zumindest nicht vorstellen,"}, {"id": 542, "start": 4731.94, "end": 4738.06, "text": "dass man ein guter Entwickler sein kann, aber sich für links und rechts neben seinen Sachen"}, {"id": 543, "start": 4738.06, "end": 4748.74, "text": "für nichts aus der Technik interessiert, ja das kann ich mir vorstellen, du meinst,"}, {"id": 544, "start": 4748.74, "end": 4755.42, "text": "weil ich so viel Cobol Erfahrung habe, na gut, man muss ja mal sagen, Leute, ungelogen,"}, {"id": 545, "start": 4755.42, "end": 4762.78, "text": "ich hab bestimmt mehr Cobol Erfahrung als 99% aller, ok ich sag noch nicht mal aller Menschen"}, {"id": 546, "start": 4762.78, "end": 4770.62, "text": "auf der Welt, ich hab mehr Cobol Erfahrung als 99% aller Leute, die in der IT arbeiten,"}, {"id": 547, "start": 4770.62, "end": 4776.38, "text": "das meine ich ernst, ich mein ich hab immerhin schon mal mit Cobol was gemacht, 99% der Leute"}, {"id": 548, "start": 4776.38, "end": 4794.98, "text": "mit Sicherheit nicht, aber Cobol Programmierer möchte ich definitiv nie werden, ja es ist"}, {"id": 549, "start": 4794.98, "end": 4804.18, "text": "teilweise schon schlimm, aber es ist umgedreht auch so, ich sehe da auch genug Leute, die"}, {"id": 550, "start": 4804.18, "end": 4813.74, "text": "eigentlich für Infrastruktur und so verantwortlich sind, die da auch keinen Plan von dem haben,"}, {"id": 551, "start": 4813.74, "end": 4823.58, "text": "auf was es ankommt, dass eben die Anwendungen da drauf ordentlich laufen, es ist merkwürdig,"}, {"id": 552, "start": 4823.58, "end": 4831.02, "text": "zum Beispiel wir haben relativ viele Java Anwendungen, und es gibt Leute, die checken es heute immer"}, {"id": 553, "start": 4831.02, "end": 4835.38, "text": "noch nicht, wenn irgendein Entwickler sagt, ob man mal die Startparameter ändern könnte,"}, {"id": 554, "start": 4835.38, "end": 4840.18, "text": "weil das Ding braucht irgendwie mehr, oh ich hab vergessen wie es bei Java heißt, XMSS,"}, {"id": 555, "start": 4840.18, "end": 4846.58, "text": "ne wie heißt der Krempel bei Java, das braucht mehr Speicher beim Start schon allocated,"}, {"id": 556, "start": 4846.58, "end": 4853.26, "text": "weiß nicht wie das genau bei Java heißt, und die checken das bis heute nicht, denen"}, {"id": 557, "start": 4853.26, "end": 4860.62, "text": "musst du das immer wieder neu erklären, also es gibt, es ist halt wie überall, 90% der"}, {"id": 558, "start": 4860.62, "end": 4865.1, "text": "Leute sind unfähig, ja und auch nur weil sie den Beruf ausüben, heißt das noch lange"}, {"id": 559, "start": 4865.1, "end": 4873.38, "text": "nicht, dass sie fähig sind, was ist an Chromium besser, es ist nicht, es ist Chrome ohne ein"}, {"id": 560, "start": 4873.38, "end": 4880.1, "text": "paar Google Teile, ja eigentlich ist es schlechter als Chrome, weil es hat mancher Hardware Beschleunigungs"}, {"id": 561, "start": 4880.1, "end": 4889.78, "text": "Sachen nicht, ich hab das nur genommen, weil ich kein Chromecast eingebaut haben wollte,"}, {"id": 562, "start": 4889.78, "end": 4899.46, "text": "ja und kein Sync und kein Google Software Reporting Tool und so ein Shit, ja kann sein"}, {"id": 563, "start": 4899.46, "end": 4907.7, "text": "wie gesagt, das sieht gut aus ja, hat kein Text zu Speech, gut hab ich keinen Anwendungszweck"}, {"id": 564, "start": 4907.7, "end": 4916.02, "text": "für, Firefox hab ich auch, also ich benutze Chromium, Chrome und Firefox und Edge hab"}, {"id": 565, "start": 4916.02, "end": 4922.9, "text": "ich genotgetrunken installiert, aber ich verwende kein Edge, ich mein, wer verwendet schon Edge,"}, {"id": 566, "start": 4922.9, "end": 4926.58, "text": "ich weiß jetzt sagen Leute im Chat wieder, ja ich, ich verwende Edge, es gibt tatsächlich"}, {"id": 567, "start": 4926.58, "end": 4930.86, "text": "Leute die Edge verwenden, ich weiß und jetzt werd ich gleich wieder versuchen zu bekehren"}, {"id": 568, "start": 4930.86, "end": 4939.02, "text": "so nach dem Motto, der neue Edge ist gar nicht so schlecht, übrigens wenn ihr mal getriggerte"}, {"id": 569, "start": 4939.02, "end": 4944.54, "text": "Linux Fans sehen wollt, seht ihr mal ein bisschen die Kommentare unter meinem letzten Video"}, {"id": 570, "start": 4944.54, "end": 4952.3, "text": "für euch angucken, ok ich geb zu vielleicht etwas provokanter Titel, aber der Titel ist"}, {"id": 571, "start": 4952.3, "end": 4957.9, "text": "ja im Prinzip das worüber ich rede im Video und zumindest wenn ihr paar getriggerte Linux"}, {"id": 572, "start": 4957.9, "end": 4970.94, "text": "Fans sehen wollt, dann müsst ihr hier nochmal durchgucken, die meisten Leute sind ja normal,"}, {"id": 573, "start": 4970.94, "end": 4979.62, "text": "aber hier auch getriggerte Linux Fan, ist das das wo ich am rumschreien bin?"}, {"id": 574, "start": 4979.62, "end": 5008.06, "text": "Ja gut, da konnte man sich schon mal ein bisschen aufregen."}, {"id": 575, "start": 5008.06, "end": 5019.02, "text": "Ja Rust bringt einen zur Verzweiflung, wählst du dein Chromium unter Windows aktuell, das"}, {"id": 576, "start": 5019.02, "end": 5023.34, "text": "hat nen Updater dabei, der startet und dir sagt wenn es eine neue Version gibt, dann"}, {"id": 577, "start": 5023.34, "end": 5025.74, "text": "musst du auf Download klicken, wenn die neue Version da ist."}, {"id": 578, "start": 5025.74, "end": 5053.7, "text": "Oh man, ey Rust lass ich erst mal bleiben, da dreh ich auf komplett durch bei Omega"}, {"id": 579, "start": 5053.7, "end": 5064.58, "text": "Keg, oh ich wollt grad Licht einschalten über mein Home Automation System und stell fest"}, {"id": 580, "start": 5064.58, "end": 5069.82, "text": "die Batterie von meinem Fritz Thermostat ist leer, obwohl es eindeutig nicht leer ist,"}, {"id": 581, "start": 5069.82, "end": 5078.1, "text": "weil ich guck gerade drauf, was sagen, da hat irgendwie die Synchronisation nicht so"}, {"id": 582, "start": 5078.1, "end": 5100.86, "text": "funktioniert wie sie sollte, ja Rust ist echt so ein Sache für sich, ja die Deckdinger,"}, {"id": 583, "start": 5100.86, "end": 5106.42, "text": "ich hab einiges ausprobiert, ich hab ZigBee Thermostate ausprobiert und ich hab auch einen"}, {"id": 584, "start": 5106.42, "end": 5113.9, "text": "Siebel Thermostat ausprobiert und die Fritz Deckdinger, die funktionieren tatsächlich"}, {"id": 585, "start": 5113.9, "end": 5115.86, "text": "am besten, leider sind sie nicht so ganz billig."}, {"id": 586, "start": 5115.86, "end": 5126.14, "text": "Ich gehör auch zu den Open Source Leuten und ich find Rust eigentlich vom Ansatz her"}, {"id": 587, "start": 5126.14, "end": 5132.54, "text": "auch mega geil, also Rust ist für den Einsatzzweck, wo es ursprünglich gedacht wurde, glaub ich"}, {"id": 588, "start": 5132.54, "end": 5137.78, "text": "das beste was es gibt, man muss sich ja überlegen, das Ding wurde von Mozilla erfunden, also"}, {"id": 589, "start": 5137.78, "end": 5146.9, "text": "von den Firefox Leuten und im Hinblick auf das, dass sie quasi Browser Sicherheitslücken"}, {"id": 590, "start": 5146.9, "end": 5153.18, "text": "vermeiden wollen und trotzdem was schnelles haben wollen, für solche Anwendungsgebiete"}, {"id": 591, "start": 5153.18, "end": 5162.86, "text": "ist Rust gut, also was was sicherer sein soll, allerdings auch schnell und das in Kombination"}, {"id": 592, "start": 5162.86, "end": 5166.94, "text": "ist wirklich cool, mir fällt keine andere Sprache ein die das so gut hinkriegt wie Rust,"}, {"id": 593, "start": 5166.94, "end": 5176.26, "text": "leider ist Rust was Syntax angeht und Komplexität auch schon total am ausufern, allerdings auf"}, {"id": 594, "start": 5176.26, "end": 5182.26, "text": "andere Art und Weise wie C++, Rust ist in gewisser Weise nachvollziehbar, du verstehst"}, {"id": 595, "start": 5182.26, "end": 5188.26, "text": "meistens warum es meckert, dir fällt aber jetzt so spontan dann manchmal nichts ein"}, {"id": 596, "start": 5188.26, "end": 5193.98, "text": "wie du es machen könntest, dass es nicht total ausufert an Komplexität, bei C++ ist"}, {"id": 597, "start": 5193.98, "end": 5201.06, "text": "es einfach so, dass es nur noch wir ist und du überhaupt nicht weißt was die sich dabei"}, {"id": 598, "start": 5201.06, "end": 5228.66, "text": "gedacht haben, Network Chuck guck ich nicht gerne, so Hipster Zeug, der Rust Compiler ist"}, {"id": 599, "start": 5228.66, "end": 5235.94, "text": "deutlich netter als der C++ Compiler, der C++ Compiler wirft dir nämlich 40 Zeilen Fehlermeldungen"}, {"id": 600, "start": 5235.94, "end": 5241.7, "text": "aus und du weißt nicht woran es liegt, im Rust Compiler weißt du es meistens, Tado,"}, {"id": 601, "start": 5241.7, "end": 5248.98, "text": "ja Tado habe ich zum Glück damals geschickt um Shift, nee kein C++ Rant heute, ja das"}, {"id": 602, "start": 5248.98, "end": 5254.78, "text": "nervt mich, also ich habe nicht viel mit Rust gemacht aber das nervt mich auch, also du"}, {"id": 603, "start": 5254.78, "end": 5260.6, "text": "brauchst ja wirklich für jeden Furz externe Packages, also wo es bei mir wirklich aufgehört"}, {"id": 604, "start": 5260.6, "end": 5267.3, "text": "hat ist, dass du mit Rust noch nicht mal eine Timespan parsen konntest, also Rust hat nichts"}, {"id": 605, "start": 5267.3, "end": 5273.46, "text": "eingebautest um eine Duration zu parsen from String, du musst das selbst programmieren"}, {"id": 606, "start": 5273.46, "end": 5280.22, "text": "oder einen Package verwenden, einen Crate verwenden, ich meine ist es zu viel verlangt"}, {"id": 607, "start": 5280.22, "end": 5292.74, "text": "dass es Duration Punkt Pars gibt, anscheinend, bloatet, braucht man nicht, ich glaube sogar"}, {"id": 608, "start": 5292.74, "end": 5302.9, "text": "C++ hat sowas, schauen wir mal, ja aber passt mal auf es ist hässlich, all diese Chrono"}, {"id": 609, "start": 5302.9, "end": 5314.82, "text": "APN C++ ist glaube ich eines der menschenverachtendsten Sachen die ich je gesehen habe, Moment Example,"}, {"id": 610, "start": 5314.82, "end": 5321.22, "text": "der Stelle gehts noch, passt mal auf ich zeige euch jetzt mal was, ich zeige euch jetzt mal"}, {"id": 611, "start": 5321.22, "end": 5343.78, "text": "was, ich zeige euch jetzt mal was, das geht noch viel schlimmer, das geht noch viel schlimmer,"}, {"id": 612, "start": 5343.78, "end": 5355.34, "text": "mein Go-Projekt, ich habe heute nichts gemacht, ich wollte heute eigentlich weitermachen,"}, {"id": 613, "start": 5355.34, "end": 5379.22, "text": "ich gucke da hin, Alter wenn ich sowas hier schon sehe, aber C++ ist eh Standard 0W, Keckel,"}, {"id": 614, "start": 5379.22, "end": 5396.18, "text": "Rom, Iteration, Start, End, Uint, 69, Rom, so das ist ungefähr ziemlich, ziemlich, ziemlich"}, {"id": 615, "start": 5396.18, "end": 5410.22, "text": "valid C++, ungefähr so sieht das aus, du brauchst noch ein paar Operator, Overloaded, plus gleich,"}, {"id": 616, "start": 5410.22, "end": 5430.94, "text": "Void, Void, Int, Int, Call, Make, Shared und davon dann die Adresse, also Leute ohne Scheiß"}, {"id": 617, "start": 5430.94, "end": 5438.82, "text": "wahrscheinlich ist das valid C++ Code und wer jetzt sagt ist nicht so, ich könnte fast"}, {"id": 618, "start": 5438.82, "end": 5448.82, "text": "wetten, dass es lauffähig machbar ist in C++, also das könnte durchaus valid, okay mit"}, {"id": 619, "start": 5448.82, "end": 5453.42, "text": "dem Pointer, mit der Adresse hier vorne funktionieren, das könnte wahrscheinlich wirklich fast valid"}, {"id": 620, "start": 5453.42, "end": 5457.62, "text": "C++ sein, das ist halt echt abartig."}, {"id": 621, "start": 5457.62, "end": 5473.54, "text": "Könnt ihr gut mit Entwurfsmustern, ich kenne niemand, ich kenne niemand der Entwurfsmuster"}, {"id": 622, "start": 5473.54, "end": 5484.22, "text": "sagt, aber die meisten davon brauchst du nicht, viele sind in aktmodernen Sprachen"}, {"id": 623, "start": 5484.22, "end": 5493.7, "text": "schon integriert, sowas wie Observer zum Beispiel und wenn du in Java unterwegs bist, dann brauchst"}, {"id": 624, "start": 5493.7, "end": 5505.62, "text": "du natürlich das Abstract Factory Repository Manager Builder Pattern, sonst gehts nicht,"}, {"id": 625, "start": 5505.62, "end": 5512.3, "text": "ich glaube zwei davon sind gar keine offiziellen Entwurfsmuster aus diesem Buch, wie heißt"}, {"id": 626, "start": 5512.3, "end": 5536.06, "text": "dieses Gang of Five, ne wie heißt dieses Oldschool Entwurfsmuster Buch, Gang of Four, aber vieles"}, {"id": 627, "start": 5536.06, "end": 5543.7, "text": "davon ist in modernen Sprachen schon eingebaut, also ganz ehrlich das wichtigste Pattern ist"}, {"id": 628, "start": 5543.7, "end": 5551.38, "text": "meiner Meinung nach Observer und Factory, wobei Factory je nach Sprache auch schon einen"}, {"id": 629, "start": 5551.38, "end": 5560.46, "text": "gewissen Weg hat wie man es macht, okay warte mal, ne nicht Design Pattern, nach was muss"}, {"id": 630, "start": 5560.46, "end": 5575.38, "text": "ich suchen, Gang of Four Design Patterns, also in.NET voll angesagt, braucht man relativ"}, {"id": 631, "start": 5575.38, "end": 5589.18, "text": "oft, braucht man auch relativ oft, in vielen Sprachen auch schon eingebaut, semi oft, jede"}, {"id": 632, "start": 5589.18, "end": 5598.3, "text": "moderne Sprache hat sowas, auch mit Interfaces meistens, als Libraries, Observer auch oft"}, {"id": 633, "start": 5598.3, "end": 5611.66, "text": "schon eingebaut in modernen Sprachen, ja, alles bloated, Yandere Dankeschön für den"}, {"id": 634, "start": 5611.66, "end": 5625.3, "text": "Besuch, ich wünsche euch einen schönen Abend, bis zum nächsten Mal, tschüss, tschüss,"}, {"id": 635, "start": 5625.3, "end": 5650.2, "text": "tschüss, tschüss, tschüss, tschüss, tschüss, tschüss, tschüss, tschüss, tschüss, tschüss,"}, {"id": 636, "start": 5650.2, "end": 5661.04, "text": "Javascript ist weird, weird champ, okay zeig mal her, also wir wissen, dass Javascript weird"}, {"id": 637, "start": 5661.04, "end": 5662.04, "text": "ist."}, {"id": 638, "start": 5662.04, "end": 5669.96, "text": "Also in Javascript ist not a number auch nicht not a number, das ist ja klar ne, also hier"}, {"id": 639, "start": 5669.96, "end": 5677.08, "text": "none, gleich, gleich, was kommt da raus chat, was kommt da raus, wenn ich jetzt n eingebe?"}, {"id": 640, "start": 5677.08, "end": 5687.24, "text": "Da kommt false raus, sieht man ja, not a number equals not a number ist logischerweise false,"}, {"id": 641, "start": 5687.24, "end": 5694.56, "text": "obviously und jetzt kommt der Trick, was kommt hier raus, Mist node schreibt immer unten"}, {"id": 642, "start": 5694.56, "end": 5705.56, "text": "drunter was, da weiß man es ja schon und was kommt hier raus, das gibt es nicht, okay."}, {"id": 643, "start": 5705.56, "end": 5725.8, "text": "Ja, das ist ja Batman, Batman, was, ne, ah ich hab's nicht in der Historie, das gibt"}, {"id": 644, "start": 5725.8, "end": 5730.76, "text": "es ja auch, da gibt es ja auch die Batman Variante."}, {"id": 645, "start": 5730.76, "end": 5742.2, "text": "Moment, 21, ich guck mir jetzt noch nicht 21 Minuten an, warum Javascript weird champ"}, {"id": 646, "start": 5742.2, "end": 5747.2, "text": "ist, das wissen wir doch auch so."}, {"id": 647, "start": 5747.2, "end": 5776.68, "text": "Also das glaube ich dem sofort, das glaube ich dem sofort, ich mein das Klammern funktionieren"}, {"id": 648, "start": 5776.68, "end": 5784.4, "text": "an der Stelle, versteh ich, das ist einfach quasi Statement kopiert, geschweifte Klammer"}, {"id": 649, "start": 5784.4, "end": 5792.96, "text": "auf ist ein Objekt, eckige Klammer auf ist ein Array, aber warum dieser Shit da innen"}, {"id": 650, "start": 5792.96, "end": 5803.68, "text": "drinne funktioniert ist mir nicht ganz klar, geteilt durch größer plus not kleiner gleich,"}, {"id": 651, "start": 5803.68, "end": 5807.44, "text": "ich habe keine Ahnung warum das funktioniert."}, {"id": 652, "start": 5807.44, "end": 5835.24, "text": "Also das ist genau das, was wir hier machen werden, also das ist einfach, Javascript"}, {"id": 653, "start": 5835.24, "end": 5840.32, "text": "only has a few basic types, like strings, numbers, booleans, arrays and objects, ja und"}, {"id": 654, "start": 5840.32, "end": 5848.76, "text": "wenn ich es richtig in Erinnerung hab, sind Numbers in Javascript 47 bit, ich glaube Numbers"}, {"id": 655, "start": 5848.76, "end": 5874.84, "text": "in Javascript sind 47 bit, oder 42 bit, warum, weil die schlau sein wollten, die verwenden"}, {"id": 656, "start": 5874.84, "end": 5886.68, "text": "47 bit für die eigentliche Zahl und, was ist denn da noch übrig, 17, 17 Stellen für"}, {"id": 657, "start": 5886.68, "end": 5902.12, "text": "den Exponent, Pfeifedder Time, es könnten auch 52 bit sein, ich bin mir nicht ganz sicher,"}, {"id": 658, "start": 5902.12, "end": 5918.2, "text": "aber das habe ich auch mal, hier, Javascript numbers also 0 bis genau 52 bits ist der value,"}, {"id": 659, "start": 5918.2, "end": 5925.48, "text": "genau und der Rest ist für den Exponent, das ist, ja in Javascript gibt es das ja nicht,"}, {"id": 660, "start": 5925.48, "end": 5941.28, "text": "in Javascript gibt es nur Numbers, das wird mich nicht wundern, dass Javascript irgendwelche"}, {"id": 661, "start": 5941.28, "end": 5960.08, "text": "Standards ignoriert, achja Chat, mal Frage, was kommt hier raus, wer weiß es, was kommt"}, {"id": 662, "start": 5960.08, "end": 5969.08, "text": "hier raus in Javascript, wenn man das, wenn ich das so checken lasse in Javascript, und"}, {"id": 663, "start": 5969.08, "end": 5978.8, "text": "was kommt hier raus, node, true, gleich, gleich, jetzt kommts, jetzt kommts, true, logischerweise"}, {"id": 664, "start": 5978.8, "end": 5986.36, "text": "false, das ist auch false, ist insofern ja auch logisch, weil es ist ja auch kein String,"}, {"id": 665, "start": 5986.36, "end": 5987.36, "text": "ja."}, {"id": 666, "start": 5987.36, "end": 6015.36, "text": "Ah, obviously, natürlich, was sonst Javascript, also 2, 2 plus true, also 2 plus true, also"}, {"id": 667, "start": 6015.36, "end": 6040.16, "text": "das heißt im Endeffekt, ich kann, true plus true Rechner kommt 2 raus, na klar, was sonst,"}, {"id": 668, "start": 6040.16, "end": 6054.8, "text": "pass mal auf, pass mal auf, 5 hat, 5 hat time, node, true plus false, gleich true, so was"}, {"id": 669, "start": 6054.8, "end": 6065.84, "text": "geht aber auch echt nur in Javascript oder, aber das ist false, das ist false, ja, bitte"}, {"id": 670, "start": 6065.84, "end": 6076.44, "text": "schön, gibt es inzwischen type safety, naja es gibt jetzt glaube ich seit dem neuesten"}, {"id": 671, "start": 6076.44, "end": 6082.28, "text": "Standard type annotations, gleich, gleich, gleich ist, dass er nicht, dass er überprüft,"}, {"id": 672, "start": 6082.28, "end": 6087.44, "text": "ob der Typ stimmt auch oder so, frag mich nicht genau, Javascript Details aus dem Kopf."}, {"id": 673, "start": 6087.44, "end": 6108.6, "text": "Aber selbst wenn wir supplies versionieren, so welches wir hier in den"}, {"id": 674, "start": 6108.6, "end": 6120.6, "text": "D plus A and then plus and then a space plus and then A plus A and then we do a two lowercase on that we should see this come out with the string banana."}, {"id": 675, "start": 6120.6, "end": 6122.6, "text": "Warum muss man to lowercase machen?"}, {"id": 676, "start": 6122.6, "end": 6136.6, "text": "What we're trying to do here, the root of it, is that we're trying to take the character A and convert it into a number with a unary plus, which of course is going to result in not a number because A is not a number and cannot be sensibly transformed into a number."}, {"id": 677, "start": 6136.6, "end": 6138.6, "text": "And if you two lowercase that, you'll get the middle part of the string."}, {"id": 678, "start": 6138.6, "end": 6143.6, "text": "And if we look at what it was before, you'll see that this is really this."}, {"id": 679, "start": 6143.6, "end": 6150.6, "text": "So what we're actually doing is saying B plus A plus not a number plus A lowercase."}, {"id": 680, "start": 6150.6, "end": 6152.6, "text": "It's actually fairly simple."}, {"id": 681, "start": 6152.6, "end": 6160.6, "text": "This is the set of basic things that we're gonna use in order to do something way cooler."}, {"id": 682, "start": 6160.6, "end": 6164.6, "text": "So first of all, let's figure out how we can get numbers."}, {"id": 683, "start": 6164.6, "end": 6178.6, "text": "Ja, würde ich auch jedem empfehlen, lernt JavaScript ein bisschen, bevor ihr euch noch TypeScript obendrauf packt."}, {"id": 684, "start": 6178.6, "end": 6186.6, "text": "Ich verwende ja bis heute kaum TypeScript."}, {"id": 685, "start": 6186.6, "end": 6198.6, "text": "TypeScript hat auch so seine Abfachseiten. Ich habe letztens gesehen irgendeiner, der rein im TypeScript-Typesystem irgendeinen Encoder programmiert hat."}, {"id": 686, "start": 6198.6, "end": 6200.6, "text": "Nur mit dem TypeScript-Typesystem."}, {"id": 687, "start": 6200.6, "end": 6208.6, "text": "Ich glaube, ein Base64-Encoder rein im TypeScript-Typesystem oder irgendwas habe ich letztens auf Twitter gesehen, habe ich auch schon gedacht."}, {"id": 688, "start": 6208.6, "end": 6211.6, "text": "Jetzt fängt es schon an wie ein C++."}, {"id": 689, "start": 6211.6, "end": 6217.6, "text": "Was wir eigentlich tun müssen, ist es irgendwie von unserem Haupttypen zu bekommen."}, {"id": 690, "start": 6217.6, "end": 6245.6, "text": "Welche Sprache ist nicht Trash? Ganz ehrlich, ich würde sagen JavaScript ist nicht Trash, unabhängig davon. JavaScript ist mittlerweile echt ganz gut, brauchbar. C Sharp ist definitiv auch nicht Trash."}, {"id": 691, "start": 6245.6, "end": 6252.6, "text": "Für so normale Daily-Anwendungen eigentlich nicht wirklich geeignet."}, {"id": 692, "start": 6252.6, "end": 6260.6, "text": "Großer Go-Fan werde ich nicht werden, aber ich würde nicht so weit gehen und sagen, dass es Trash ist. Ruby ist auch auf jeden Fall kein Trash."}, {"id": 693, "start": 6260.6, "end": 6265.6, "text": "Python ist auch kein Trash."}, {"id": 694, "start": 6265.6, "end": 6269.6, "text": "Bash ist auch kein Trash. Bash ist einfach nur alt."}, {"id": 695, "start": 6269.6, "end": 6272.6, "text": "Kotlin ist auch kein Trash."}, {"id": 696, "start": 6272.6, "end": 6279.6, "text": "Cobol ist Trash, ja, da gebe ich dir recht. C++ ist auch Trash."}, {"id": 697, "start": 6279.6, "end": 6285.6, "text": "C ist kein Trash."}, {"id": 698, "start": 6285.6, "end": 6287.6, "text": "Bash ist aber keine Sprache."}, {"id": 699, "start": 6287.6, "end": 6298.6, "text": "Na ja, kann man es jetzt drüber schreiben? Ich meine, du kannst da auch das meiste drin machen. Du hast Ifs, du hast Schleifen, du hast Funktionsaufrufe, also im Prinzip..."}, {"id": 700, "start": 6298.6, "end": 6303.6, "text": "Also, für mich geht das als Programmiersprache durch."}, {"id": 701, "start": 6303.6, "end": 6306.6, "text": "Aber ich bin da eh nicht so pingelig."}, {"id": 702, "start": 6306.6, "end": 6312.6, "text": "Wer ist... Ja, da kommt... Das ist Test, ist das."}, {"id": 703, "start": 6312.6, "end": 6316.6, "text": "Die eckige Klammer."}, {"id": 704, "start": 6316.6, "end": 6327.6, "text": "Lua ist Trashwing ArrayIndex1. Ja, das stimmt. Es ist auf jeden Fall ein wenig Sass, wie man so schön sagt."}, {"id": 705, "start": 6327.6, "end": 6334.6, "text": "Welche Sprachen sind so richtig Trash, aber nicht, weil sie so alt wie Cobol sind?"}, {"id": 706, "start": 6334.6, "end": 6337.6, "text": "C++?"}, {"id": 707, "start": 6337.6, "end": 6343.6, "text": "Denn die neuesten C++-Standards haben es nicht wirklich viel weniger trashig gemacht."}, {"id": 708, "start": 6343.6, "end": 6353.6, "text": "Ähm..."}, {"id": 709, "start": 6353.6, "end": 6356.6, "text": "Tja."}, {"id": 710, "start": 6356.6, "end": 6361.6, "text": "Ja, Brainfuck ist ja dafür gemacht, fuck zu sein, ja."}, {"id": 711, "start": 6361.6, "end": 6366.6, "text": "Portran ist auch alt. Tja, welche Sprache ist neu und trash?"}, {"id": 712, "start": 6366.6, "end": 6370.6, "text": "Also, so wirklich trash, so. Das ist doch nicht mal..."}, {"id": 713, "start": 6370.6, "end": 6376.6, "text": "Ganz ehrlich, ob Carbon was taugt, bin ich mir wirklich sehr unschlüssig."}, {"id": 714, "start": 6376.6, "end": 6382.6, "text": "Ob das irgendwie eine Daseinsberechtigung hat."}, {"id": 715, "start": 6382.6, "end": 6386.6, "text": "Was ich von Dart gesehen hab, bisher war wirklich nicht so geil."}, {"id": 716, "start": 6386.6, "end": 6390.6, "text": "Aber kommst ja mit Flutter nicht drumherum."}, {"id": 717, "start": 6390.6, "end": 6394.6, "text": "TempleOS ist keine Programmiersprache."}, {"id": 718, "start": 6394.6, "end": 6400.6, "text": "TempleOS ist in Holy C programmiert."}, {"id": 719, "start": 6400.6, "end": 6403.6, "text": "PAP ist auch kein Trash."}, {"id": 720, "start": 6403.6, "end": 6412.6, "text": "Moderne PAP-Versionen sind echt ganz okay."}, {"id": 721, "start": 6412.6, "end": 6415.6, "text": "Okay."}, {"id": 722, "start": 6415.6, "end": 6418.6, "text": "Emacs Lisp ist Trash."}, {"id": 723, "start": 6418.6, "end": 6424.6, "text": "Das ist nicht so alt wie Cobol und ist trotzdem Trash."}, {"id": 724, "start": 6424.6, "end": 6426.6, "text": "Scala kann ich auch nicht ab."}, {"id": 725, "start": 6426.6, "end": 6433.6, "text": "Also alle Sprachen, die zu 90% aus Klammern bestehen, im Prinzip so was wie Emacs Lisp oder Scala,"}, {"id": 726, "start": 6433.6, "end": 6438.6, "text": "ist Pains Jam. Erlang ist auch so ein Ding."}, {"id": 727, "start": 6438.6, "end": 6450.6, "text": "Egal, wir gucken jetzt weiter."}, {"id": 728, "start": 6450.6, "end": 6469.6, "text": "Obviosly."}, {"id": 729, "start": 6469.6, "end": 6471.6, "text": "Scala mit Acker."}, {"id": 730, "start": 6471.6, "end": 6481.6, "text": "Ist Acker nicht so ein Clustering verteiltes Zeug-Framework?"}, {"id": 731, "start": 6481.6, "end": 6487.6, "text": "Ich hab da irgendwas im Hinterkopf in die Richtung, bin ich mir aber nicht ganz sicher."}, {"id": 732, "start": 6487.6, "end": 6493.6, "text": "Er ist Trash? Weiß ich nicht, Chat. Hab ich noch nichts mitgemacht?"}, {"id": 733, "start": 6493.6, "end": 6499.6, "text": "Prolog? Da kenn ich nur irgendwelche Hallo-Welt-Beispiele."}, {"id": 734, "start": 6499.6, "end": 6513.6, "text": "ABAP, naja. Ist ABAP das SAP-Ding?"}, {"id": 735, "start": 6513.6, "end": 6519.6, "text": "Das Video, da schlaf ich ein bei, Leute. Da passiert ja nichts."}, {"id": 736, "start": 6519.6, "end": 6527.6, "text": "Außer, dass er uns zeigt, dass du mit JavaScript-Webchamp Zeug machen kannst."}, {"id": 737, "start": 6527.6, "end": 6529.6, "text": "ABAP ist SAP, ja."}, {"id": 738, "start": 6529.6, "end": 6533.6, "text": "Was verdient ein Berufsjäger?"}, {"id": 739, "start": 6533.6, "end": 6536.6, "text": "Das gucken wir uns mal hier früh an."}, {"id": 740, "start": 6536.6, "end": 6542.6, "text": "Der Jägersmann."}, {"id": 741, "start": 6542.6, "end": 6547.6, "text": "Pre-Pre-Pre-Alpha-Battlefield-Gameplay."}, {"id": 742, "start": 6547.6, "end": 6552.6, "text": "Was für ein Battlefield könnte das sein?"}, {"id": 743, "start": 6552.6, "end": 6558.6, "text": "Ist das Bad Company?"}, {"id": 744, "start": 6558.6, "end": 6569.6, "text": "Ist das die Bad Company Alpha?"}, {"id": 745, "start": 6569.6, "end": 6575.6, "text": "Das ist Bad Company, oder?"}, {"id": 746, "start": 6575.6, "end": 6583.6, "text": "Jaja, das ist Bad Company."}, {"id": 747, "start": 6583.6, "end": 6589.6, "text": "Also ich vermute mal, das wird Bad Company."}, {"id": 748, "start": 6589.6, "end": 6596.6, "text": "Jaja, das wird garantiert Bad Company."}, {"id": 749, "start": 6596.6, "end": 6605.6, "text": "Mods, einmal Bunn, please."}, {"id": 750, "start": 6605.6, "end": 6613.6, "text": "Jaja, das hörst du auch an der Hintergrundmusik. Das ist Bad Company 2."}, {"id": 751, "start": 6613.6, "end": 6618.6, "text": "Bad Company 1, nicht Bad Company 2, Bad Company 1."}, {"id": 752, "start": 6618.6, "end": 6622.6, "text": "Was ist das?"}, {"id": 753, "start": 6622.6, "end": 6650.6, "text": "I tried 10 code editors. Wer braucht code editors? See it only."}, {"id": 754, "start": 6650.6, "end": 6654.6, "text": "Die Auswahl ist aber auch reichlich willkürlich, oder?"}, {"id": 755, "start": 6654.6, "end": 6662.6, "text": "Was ist denn das alles?"}, {"id": 756, "start": 6662.6, "end": 6666.6, "text": "Ist eins davon NeoWim? Keine Ahnung."}, {"id": 757, "start": 6666.6, "end": 6670.6, "text": "Das da oben sagt mir gar nichts."}, {"id": 758, "start": 6670.6, "end": 6677.6, "text": "Was ist das da unten? Was ist das unten rechts?"}, {"id": 759, "start": 6677.6, "end": 6685.6, "text": "Ach, das ist Fleet, genau."}, {"id": 760, "start": 6685.6, "end": 6692.6, "text": "Nee, ich glaube nicht, dass es Dreamweaver ist, oder?"}, {"id": 761, "start": 6692.6, "end": 6700.6, "text": "Dreamweaver, das habe ich früher verwendet. 1999 für Webseiten."}, {"id": 762, "start": 6700.6, "end": 6714.6, "text": "Seht, seht only."}, {"id": 763, "start": 6714.6, "end": 6718.6, "text": "Nee, ich habe damals kein Frontpage verwendet. Ich habe tatsächlich schon HTML selbst gemacht."}, {"id": 764, "start": 6718.6, "end": 6725.6, "text": "Also Dreamweaver konnte ja HTML Editor und, ähm, ja, Visivic Editor."}, {"id": 765, "start": 6725.6, "end": 6733.6, "text": "Aber das Autokomplete von Dreamweaver war wirklich seinerzeit voraus. Also das konnte mehr oder weniger alles Autokompleten schon."}, {"id": 766, "start": 6755.6, "end": 6775.6, "text": "Wobei es ja eigentlich Wim ist im Kompatibilitätsmodus."}, {"id": 767, "start": 6775.6, "end": 6802.6, "text": "Ja, Wim Beste."}, {"id": 768, "start": 6802.6, "end": 6809.6, "text": "Ich benutze Wim täglich halt für kleine Editiersachen, SSH, Commandline, sonst wie."}, {"id": 769, "start": 6809.6, "end": 6816.6, "text": "Deswegen habe ich meine ganze Wim-Config auch wieder eingekürzt von dem riesen Ding, was ich früher hatte."}, {"id": 770, "start": 6816.6, "end": 6822.6, "text": "Einfach weil es überall funktioniert. Wim ist das Beste."}, {"id": 771, "start": 6822.6, "end": 6832.6, "text": "Nee, du brauchst kein Studium für Wim. Du musst es einfach nur ein paar Wochen mal verwenden regelmäßig für kleine Terminal-Editiersachen, dann gewöhnst du dich dran."}, {"id": 772, "start": 6832.6, "end": 6837.6, "text": "Wim hat, die Wim-Sprache hat eine gewisse Logik."}, {"id": 773, "start": 6837.6, "end": 6853.6, "text": "Ja, das habe ich ja schon öfters gesagt. Also zum Beispiel, wenn du jetzt hier irgendwie sowas stehen hast, oder sagen wir mal was anderes. Sagen wir mal, du hast jetzt hier irgendwie sowas hier stehen. Lul, W, bla bla bla."}, {"id": 774, "start": 6853.6, "end": 6870.6, "text": "Und du willst jetzt alles in den, alles in den Anführungszeichen löschen. Dann sagst du einfach C, I, Anführungszeichen."}, {"id": 775, "start": 6870.6, "end": 6888.6, "text": "Hä, seit wann muss man da drin sein? Ach nee, man muss davor sein. Jaja, man muss davor sein. Du sagst, du sagst C, I, Anführungszeichen, dann springt er da rein und löscht das. Das kann man sich merken. C für Change, I für Inner und dann das Zeichen von wo bis wo."}, {"id": 776, "start": 6888.6, "end": 6900.6, "text": "Also das hat, also die Wim-Sprache hat schon seinen Sinn. Also das hat eine gewisse Konsistenz, was die einzelnen Kürzel machen."}, {"id": 777, "start": 6900.6, "end": 6922.6, "text": "Ja, das macht aber keiner."}, {"id": 778, "start": 6931.6, "end": 6947.6, "text": "Please allow me to interject for a moment. Weiß nicht, ob wir das Zeug ready haben im Chat."}, {"id": 779, "start": 6947.6, "end": 6958.6, "text": "Genau das."}, {"id": 780, "start": 6958.6, "end": 6973.6, "text": "Ja, das Problem ist, dass es Emacs Lisp hat zum Konfigurieren und Emacs Lisp ist wirklich auch ziemlich belastend."}, {"id": 781, "start": 6973.6, "end": 6988.6, "text": "Ich kenne niemand, der in Emacs die Menüs verwendet."}, {"id": 782, "start": 7003.6, "end": 7018.6, "text": "Ja, es interessiert aber keinen mehr. Ganz ehrlich, Emacs hat seit Whistle Studio Code und der Erweiterbarkeit dort mit Plugins schon noch weiter an Bedeutung verloren."}, {"id": 783, "start": 7018.6, "end": 7031.6, "text": "Das war ja halt das Coole an Emacs, dass du so viele Plugins hattest und quasi eine eingebaute Sprache zum Plugins entwickeln, aber ganz ehrlich, ich glaube Emacs, die Bedeutung ist mittlerweile nicht mehr groß vorhanden."}, {"id": 784, "start": 7031.6, "end": 7047.6, "text": "Aber auch nur weil Emacs verwendet."}, {"id": 785, "start": 7047.6, "end": 7073.6, "text": "Ich kenne keinen mehr, der Emacs benutzt. Ich kenne welche, die haben Emacs, aber ich kenne keinen, der wirklich noch Emacs dauerhaft benutzt."}, {"id": 786, "start": 7073.6, "end": 7085.6, "text": "Es ist cool, dass es so viele Wim-Plugins gibt, aber ganz im Ernst, ich bin da weg von, ich hatte ja mein Wim früher aufgebohrt, ich hatte irgendwie, was weiß ich, 2000 Zeilen WimRC oder sonst was."}, {"id": 787, "start": 7085.6, "end": 7094.6, "text": "Ich konnte das Ding nicht mehr abdecken, ohne dass es kaputt gegangen ist und du hast es halt auf Remote Server nicht. Es gibt da ein paar Tricks, das mitzunehmen, aber da kopierst du erst mal."}, {"id": 788, "start": 7094.6, "end": 7104.6, "text": "Ich hatte sogar ein Sync-Programm, was mir per SSH meine Wim-Config mit kopiert hat, wo es dann das Problem war, da musste ich erst mal 40 MB sinken oder was komplett useless war, das kannst du vergessen, kannst du nicht verwenden."}, {"id": 789, "start": 7104.6, "end": 7127.6, "text": "Deswegen bin ich mittlerweile wieder auf Vanilla Wim ohne Plugins. Ich glaube das einzige Plugin, was ich habe, ist eine ordentliche Statusleiste."}, {"id": 790, "start": 7127.6, "end": 7141.6, "text": "Ja, das ist eh overrated. Das ist total overrated in der heutigen Zeit. Du verbringst eh die meiste Zeit beim Programmieren mit nachdenken, mit googeln und mit Sachen lesen und den Browser benutzen."}, {"id": 791, "start": 7141.6, "end": 7161.6, "text": "Das ist egal. Du brauchst die zweite Hand eh öfters für die Maus. Insofern, das ist nur ein theoretischer Vorteil."}, {"id": 792, "start": 7161.6, "end": 7176.6, "text": "Also man erkennt Leute, die noch nie was entwickelt haben und nie was programmiert haben, daran, dass sie denken, Programmierer machen den ganzen Tag das hier. Ist es halt nicht."}, {"id": 793, "start": 7176.6, "end": 7205.6, "text": "Das Problem ist, dass Wim-Skript..."}, {"id": 794, "start": 7205.6, "end": 7220.6, "text": "Oh, ja. Deswegen haben sie jetzt Lua in Neo Wim eingebaut. Genau, wie er sagt."}, {"id": 795, "start": 7220.6, "end": 7239.6, "text": "Nein, Tastaturlayouts habe ich mich noch nicht dazu irgendwie durchgerungen. Ich sehe auch ganz ehrlich den Vorteil nicht, sich da jetzt monatelang rumzuquälen und umzugewöhnen."}, {"id": 796, "start": 7239.6, "end": 7251.6, "text": "Also den Boost in der Produktivität sehe ich da nicht."}, {"id": 797, "start": 7251.6, "end": 7271.6, "text": "Nanomagisch nicht. Nanomagisch nicht. Nano ist quasi Notepad nur im Terminal und das funktioniert nicht."}, {"id": 798, "start": 7281.6, "end": 7309.6, "text": "Ja gut, Notepad ist im Prinzip ja heute noch mehr oder weniger das gleiche wie das da. Da hat sich ja so gut wie nix dran getan."}, {"id": 799, "start": 7309.6, "end": 7336.6, "text": "Kennt noch jemand? Kennt noch jemand?"}, {"id": 800, "start": 7336.6, "end": 7345.6, "text": "Kennt noch jemand? Kennt noch jemand Edit? Nee, wie ist das Ding? Ultra Edit? Kennt noch jemand Ultra Edit?"}, {"id": 801, "start": 7345.6, "end": 7367.6, "text": "Das war so 2000 rum. Der Shit für Windows an Editor. Verwendet heute kein Mensch mehr, aber das war damals voll Bleeding Edge."}, {"id": 802, "start": 7367.6, "end": 7379.6, "text": "Moment, man kann sich den Kram heute noch kaufen oder was? High Performance Winner. Gut, da haben sie sich mal wieder selbst irgendwelche..."}, {"id": 803, "start": 7379.6, "end": 7393.6, "text": "The Bugatti of Text Editors. Alter, was ein Blödsinn, Mann. Moment, mit Subscription? Die haben doch einen Dachschaden."}, {"id": 804, "start": 7393.6, "end": 7407.6, "text": "Subscription für einen Text Editor. Oh, Dreamweaver. Dreamweaver kenn ich nur, das war ein grünes... Moment, hat das nicht eben gezeigt?"}, {"id": 805, "start": 7407.6, "end": 7430.6, "text": "Das grüne Logo kenn ich noch. Ja, da ist Dreamweaver. Dreamweaver 7. Das da, oder war das schon 8? Ja. Das hab ich damals verwendet, um Webseiten zu machen."}, {"id": 806, "start": 7437.6, "end": 7464.6, "text": "Das gibt es noch? Das gibt es wirklich noch? Auch mit Dark Theme und so? Was ist die Daseinsberechtigung 2022?"}, {"id": 807, "start": 7464.6, "end": 7484.6, "text": "JQuery UI. Ja."}, {"id": 808, "start": 7484.6, "end": 7513.6, "text": "Rackets wird auch glaub ich noch mal weiterentwickelt. Ja. Das ist das Ding, kechthin aktuell. Zumindest für Frontend Sachen."}, {"id": 809, "start": 7513.6, "end": 7530.6, "text": "Ja. Was der Grund ist, warum auch Emacs nicht mehr so angesagt ist. Diese Sache mit Erweiterung und Plugins war ja das riesen Ding von Emacs früher."}, {"id": 810, "start": 7530.6, "end": 7557.6, "text": "Mittlerweile hast du halt dann auch mal ne gescheite Sprache. Keiner mag und kann E-Lisp wirklich. JavaScript können die meisten."}, {"id": 811, "start": 7557.6, "end": 7581.6, "text": "Ja, musst du ja auch. Musst du ja auch. Du brauchst ja nen Mac, um Mac Anwendungen beziehungsweise iOS Anwendungen machen zu können."}, {"id": 812, "start": 7581.6, "end": 7601.6, "text": "Weil du brauchst ja diesen komischen Code Signing Schritt von Apple, was nur mit Mac OS geht."}, {"id": 813, "start": 7601.6, "end": 7629.6, "text": "Oder einfach Rider verwenden, was besser ist und kostet Plattform."}, {"id": 814, "start": 7629.6, "end": 7656.6, "text": "Rider hat keine gratis Version. Nee, du hast nur ne Trial Version."}, {"id": 815, "start": 7656.6, "end": 7675.6, "text": "Ist doch wurscht. Ganz ehrlich, wenn man damit sein Geld verdient sind 69 Euro im Jahr kein Ding. Ich hab das All Desktop Package, das kostet mich 160 Euro pro Jahr."}, {"id": 816, "start": 7675.6, "end": 7702.6, "text": "Ich mag aber das Standard Farbschema nicht. Nee, IntelliJ ist nicht das einzige gratis Ding. PyCharm ist auch gratis. Sonst noch was gratis?"}, {"id": 817, "start": 7702.6, "end": 7726.6, "text": "Nee, Golan ist glaub ich auch nur mit Sub."}, {"id": 818, "start": 7726.6, "end": 7736.6, "text": "Da bin ich mal gespannt."}, {"id": 819, "start": 7756.6, "end": 7760.6, "text": "Die Zukunft sieht interessant aus, aber der wichtigste Take-Away von diesem Video ist..."}, {"id": 820, "start": 7760.6, "end": 7761.6, "text": "...dass es keine Drogen gibt."}, {"id": 821, "start": 7761.6, "end": 7764.6, "text": "Danke fürs Zuschauen und wir sehen uns in der nächsten!"}, {"id": 822, "start": 7791.6, "end": 7796.6, "text": "Ja, jetzt ist der Stream doch länger gegangen, für das, dass ich nach 15 Minuten eigentlich schon aufgehen wollte."}, {"id": 823, "start": 7798.6, "end": 7803.6, "text": "Ja, ich bin da auch kein großer Fan von irgendwelche Cloud-IDEs zu verwenden."}, {"id": 824, "start": 7803.6, "end": 7812.6, "text": "Ich mein, vielleicht für Leute, die irgendwie total viel unterwegs sind und dann vom Notebook aus irgendwo was machen wollen und so."}, {"id": 825, "start": 7812.6, "end": 7815.6, "text": "Vielleicht, aber ansonsten..."}, {"id": 826, "start": 7815.6, "end": 7823.6, "text": "Tja..."}, {"id": 827, "start": 7823.6, "end": 7827.6, "text": "Okay, Leute, es reicht!"}, {"id": 828, "start": 7827.6, "end": 7830.6, "text": "Lange genug halb eingepennt vorm Rechner."}, {"id": 829, "start": 7830.6, "end": 7840.6, "text": "Ich mach jetzt den Stream aus, guck noch ein paar Videos und dann geh ich irgendwann in so eineinhalb Stunden pennen oder so."}, {"id": 830, "start": 7840.6, "end": 7845.6, "text": "Alles klar, wir sehen uns, macht's gut, see you!"}]}