{"text": "G & P Faust! Alle Zutaten inklusive Mengenangaben sind in der Infobox aufgelistet. So Leute, ich bin wieder da. War ja nicht lang, ne? Wann sind wir gestern aufgegangen? Zeig mal her. Achja, ich flame jetzt nicht über das neue Twitch-Layout, wo keiner durchblickt. Vor 15 Stunden? Also, vor 12 Stunden sind wir aufgegangen, sind wir schon wieder da. Schau mal, die Musik ist ein bisschen leiser. Quinn hat subscribt. Excellent. Für zwei Monate. Huge. Wie war das PS3-Event? Na ja. Also, ja. So der Riesenknaller hat mir gefehlt. Die PS3, äh, die PS4, äh, die PS, ich habe das bald, die Benamung. Excellent Naming. Ähm, die PS5 sieht ein bisschen aus wie eine Fritzbox in schwarz-weiß. Aber ansonsten, es hielt sich in Grenzen. Chet, Chet ist ein paar Mal ausgeflippt bei, was war es denn? Dem neuen Hitman-Game. Horizon Zero Dawn 2. Ich fand ja Sackboy Adventures am besten. Äh, Demon's Souls Remake. Ich glaube, das war's, oder? So im Großen und Ganzen. Oh, jetzt, jetzt die Frage der Fragen, habe ich noch genug Festplattenblatt heute? Ja, habe ich. Da falle ich nicht mehr drauf rein, Chet. Da falle ich nicht mehr drauf rein. Wir müssen jetzt erstmal abwarten, bis der Download fertig ist, aber zwei Minuten. Wisst ihr, was witzig ist? Dass es ein Open Source Projekt schafft, besseren Download anzubieten als Blizzard. Okay, da vergleiche ich es ein bisschen unfair. Die lassen es auch auf GitHub posten und sie werden garantiert nicht so oft runtergeladen wie Warzone. Aber gestern haben sie es ja echt wieder geschafft, ne? Gestern haben sie es ja echt wieder geschafft. Das war, wenn du Warzone in Europa runtergeladen hast nach acht Uhr, ganze 66 Bites pro Sekunde. Heute frei, ja? Ja, heute ist frei. Vielleicht ist heute ja auch Homeoffice und ich bin trotzdem on. Ne, heute ist frei. Heute habe ich Urlaub. Ich wurde aber heute morgen um acht Uhr schon angerufen. Weil irgendjemand vergessen hat, dass ich Urlaub habe. Und danach kam raus, er wollte gar nicht mich anrufen, sondern hat irgendeinen Gruppenanruf gemacht. Er wollte noch nicht mal zu mir. Ja, dann machst du nichts, ne? Oh, Download fertig. Exzellent. Er hat die Musik, ist Big Brain Musik. Brauchen wir heute. Kann sich mit der Lautstärke nicht erscheinen. Den PS5 Stream können wir glaube ich ausmachen, oder ihr wollt ihn noch mal gucken. So, also, auf die Idee bin ich nicht gekommen. Das hat der Patrick ausgebuddelt. Wusste ich gar nicht, dass es existiert. Und zwar ist das ein vorkonfigurierter i3 plus GNOME Desktop. Also quasi, es ist GNOME mit i3 als Oberfläche, die gestartet wird als erstes. Auf einem Ubuntu 20.04. Ich erzähle kein NVIDIA 3, ich erzähle es eher vor allem. Und das ist eine der wenigen Distributionen, die tatsächlich mit einem vorkonfigurierten i3 ankommt. Dies aber wohl auch anscheinend ernst meinen, so dass man sogar einen Guide hat, was Keybindings angeht und sowas. Da bin ich wirklich mal gespannt. Geheimtipp den selbst die Entwickler nicht kennen. Ja, das ist so wie Microsoft irgendwelche Registry Hacks nicht kennt. Ja, und so schaut's aus. Müssen wir mal angucken. Ich meine, ich glaube nicht, dass es ein Manjaro mit i3 rankommt. Beste. Zumal Manjaro auch noch andere Vorteile hat auf dem Desktop gegenüber Ubuntu. Einfach, wenn man aktuelle Software haben will, ist es natürlich viel besser. Muss ich mal das Pepega-Bot neu starten. Was denn? Okay, also im Prinzip ist davon nichts eingetreten, ein bisschen. Außer das da, wie in einem Sportspiel. Der Rest cringe hat man auch ein bisschen, aber ansonsten war gestern nicht so viel. Mein Frontend ist ein bisschen verbackt. Das schreibt so Sachen hier irgendwie doppelten. Aber Refreshen. Oh, das ist schlecht. Das ist schlecht, wenn die Festplatte nicht mehr gemountet wird. Ja, mache ich. So, erstmal aufräumen hier. Also, tja, warum hat Windows jetzt das Browser Fenster resized? Kann mir das irgendjemand erklären? Bei Windows Logik wahrscheinlich. Ist die Musik zu laut oder passt das so? Geht eh nur noch 5 Minuten. So, wir legen mal eine VM an. Oder wie die coolen Leute sagen, eine VM. Die coolen Leute sagen ja auch nicht VM, sondern VM wäre. VM wäre. Man kann alles besonders geil aussprechen. Aber nichts geht über nichts. Welches Video war das? Corona App. Ich weiß nicht, es gab doch mal irgendwo diesen Beitrag, wo es Jithub ausgesprochen haben. Ja, Patrick oder Ansible Playbook. Ansible Playbook geht auch. War das von der Welt? Ist gar nicht mehr in der Historie drin. Exzellent. Okay, also im Moment hatten wir genug Festplattenspeicher. Auf E, ja. 66G reicht. Neue VM. Custom. Ja, das passt alles, passt alles. Next. Linux. Jubuntu. 64. Früher haben sich Leute über die Ausschraube von Multiplayer gestritten. Multiplayer hatten wir immer. Multiplayer. Multiplayer oder Multiplayer? Multiplayer. Was glaube ich sogar richtig ist. Aber beste Aussprache ist immer noch. So, Next. Wir legen es auf E. Auf E wollen wir es anlegen. E. VMs. Neuer Ordner. Unto Tests. Wunderbar. Next. Wie viel CPU Kerne? Vier. Bencher braucht das Ding richtig. Power RAM. 4096. Bäm. Nut ist okay. Das ist auch okay. Das ist auch okay. New Disk. 40G. Single File. Next. Next. So und das einzige, was ich dann immer mache, ist den Printer raus. Den Printer brauchen wir nämlich beim besten Willen nicht. Ja, E3 geht eigentlich ohne 8G. Nichts. Bin echt mal gespannt, wie das ausschaut. Linux. Viel Spaß. Ich frage mich, ob da Michael 50 Billiarden heute irgendwann noch mal vorbeikommt und uns sagt, wie sein Vorstellungsgespräch gelaufen ist. Choose by Name sagt, ich hätte mal eine Frage zu VM mit GPU-Paththrough. Oh, jetzt kommt gleich die Big Brain-Themen gleich am Anfang hier. Richtig. Massive Big Brain. Sind solche VMs dann weiterhin ein einfaches Fenster auf dem Host, oder muss man dann den Video-Output der GPU anzapfen? Ja, muss man. Wenn du GPU-Paththrough hast, kannst du nicht so einfach die Grafikausgabe auf dem Host anzeigen lassen. Es gibt das hier. Ist das nicht Glas? Nee, wie ist das? GitHub. Das da gibt's. Damit kannst du quasi aus der Grafikkarte, aus dem Grafikrahmen mehr oder weniger die einzelnen Frames rüber kopieren. Das ist eigentlich ziemlich Big Brain. Dafür ist das ziemlich gut. Aber wenn man eine Windows VM mit GPU-Paththrough hat, wenn man spielen will, dann würde ich das auch nicht verwenden, sondern würde den eigenen Bildschirm oder den Bildschirm umschalten, je nachdem. Weil wenn man was zum Spielen verwendet, dann macht man das ja gerade, weil man wirklich auf jegliches Input-Lag oder jegliche Sachen... Wenn GIF gleich GIF, dann ist auch GIT gleich JIT. Das mag sein, aber es spricht ja auch keiner, der noch bei Verstand ist. Außer der GIF-Erfinder teilweise selbst. GIF aus. GIF. Zero Moment, ich hoffe mal nicht. PSU-Paththrough. Oh, das wäre mal was. Ein Netzteil durchreichen. Je nach Game fällt das nicht ins Gewicht, wäre mir egal. Wenn ich eine VM installiere zum Spiele-Spielen, dann will ich das allerkleinste Input-Lag, was irgendwie geht und da kommt nichts dazwischen. Zumal du mit sicherlich auch Probleme hast, wenn dein Desktop, sagen wir jetzt mal, mit 60 FPS läuft auf einem lechteren Monitor und die Grafikkarte 240 FPS oder 240 Hz in der VM. Da gibt es bestimmt die ein oder anderen Fallstrecke noch. An sich ist es ganz gut zu gebrauchen, auf jeden Fall hier die Geschichte. Aber wer wirklich das allerniedrigste Input-Lag und die beste Kompatibilität haben will, der spielt am besten gar nicht mit einer VM, sondern einfach mit einer Windows-Gamingkiste. Ich bin ja mittlerweile darauf angekommen, Windows als Host und Linux als VM. Das ist für mich die beste Kombination, aber ich mache auch nichts auf Linux, was irgendwelche Hardware Acceleration bräuchte. Und wie ist das da mit anderer Peripherie? Ja, mit der Maus ist es genauso. Du brauchst dann auch eine zweite Maus. Du brauchst dann auch eine zweite Maus und eine zweite Tastatur. Und natürlich noch eine zweite GPU für den Host, wenn du dann auch was sehen willst. Niedliche Input-Lag, genau. Windows auf Hardware, wer geht solche Sicherheitsrisiken ein? So schlimm ist das auch nicht, wie da immer alle tun. Zumal, wenn man spielen will und auch Multiplayer-Spiele mit Anti-Cheat, kommst du ja an Windows nicht vorbei. Da gibt es ja wirklich keine Alternative zu gerade. Ja, was willst du anstelle machen? Gerade für Multiplayer-Spiele mit Anti-Cheat gibt es keinerlei Alternative gerade. Neradon, 11 Monate, Poggers hier. Huge Subscription. Und dann haben wir noch Dattyp auch für 11 Monate. Jaja, jetzt geht es aber ab. Wie viele Monitore hast du jetzt und merkst du die 240 Hertz? Ich habe nach wie vor zwei. Ich habe den 144 Hertz durch den 240 Hertz-Monitor ausgetauscht, anschaue ich ja schon gezeigt durch das Teil. Merkst du den Unterschied zwischen 144 und 240 Hertz? Den reinen Unterschied glaube ich nicht, dass ich den großartig merke. Was ich merke sind so ein paar Zusatzfeatures, die der Monitor hat. Zum Beispiel dieses, dass der seine Hintergrundbeleuchtung an- und ausschaltet und solche Sachen. Das ist schon spürbar. Auch dieser Schwarzausgleich, der ist bei weitem nicht so geil wie in dem einen Werbevideo, aber es ist nicht verkehrt. Die Features merkt man schon, die der mehr hat als der andere. Farben und so ist fast genau exakt das gleiche wie das alte, da war der alte schon kacke. Gehen jetzt ab. Ah. Dachte erst, das ist Splatoon Musik, aber dafür war es nicht zu Squid genug. So, also wir machen die V-M an. Wo haben wir den Download? Ja. Ah ja ja Musik, ja. Ähm, ja also den Unterschied ist jetzt nicht so groß zu spüren. Stadia, ja. Wie geht's eigentlich Stadia so? Was macht Stadia so gerade? Kann Stadia auf jedem Android-Spiel, ui, huge. Stadia juckt nach wie vor keinen, oder? Wenn ich das richtig sehe. Gucken wir mal Stadia-Reddit an. Thank you Stadia. Danke, dass ich Geld ausgeben durfte. Excellent. Ha, das ist doch, das ist doch einer von Google, oder? Das ist doch Google, die selbst Werbung machen. I'm on Stadia.com. Sign up for free, man. I'm playing support. Is this real? Instantly, seriously. Ja, ja, ja. Alles klar. Alles klar. Ok, Champ. Schauen wir mal, wie aktiv das ganze Subreddit ist. 26 Minuten. Also, für den, für den neuen heißen Shit ist es jetzt nicht so aktiv, wenn da alle Stunde, alle halbe Stunde mal an Post kommt. Aber Stadia juckt halt auch letztendlich wenig, ne? Stadia hat ihre freie Freimonat verlängert. Die müssen ja auch irgendwas machen. Nein, jetzt nicht. Die müssen ja auch irgendwas machen. Es hat sich auch kein Mensch für Stadia interessiert. Die Musik heute. Ok, weiter geht's. Ähm, machen wir, schmeißen wir das mal an. CD ist drinne. I finished installing. Ja, natürlich haben wir gefinished, alles klar. Auf Englisch. Ja, das einzige, was wir umstellen, ist die Keymap. Hallo, F3. F3. Ah ja, das ist es gleich. Ok, Language. Englisch. Keymap. Nicht USA. German. Try without installing. Nein, install. Englisch drauf. Äh, Patrick, das kenn ich nicht, aber ich kenn was anderes in der Richtung. Ähm, oh. Hat das jetzt doch funktioniert? Ah, anscheinend. Ok, zwei von uns sinnloser Fehler, der doch funktioniert hat. Alles klar. Ähm, das hab ich mit Fabian mal ausprobiert. Das war richtig gut für Remote-Spielen. Also sprich, zum Beispiel von einem PC, der kalt schlechter hat, wer hat, auf einem guten PC spielen. Das war richtig gut. Ähm, und das Ganze ist auch kostenlos, wenn man nicht über den Ereserver spielen will. Damals haben wir es so gemacht, als wir BDO gespielt haben, hatten wir es so gemacht, dass, ähm, ich weiß gar nicht, warum wir das gemacht haben, ehrlich gesagt. Ach ja, ich weiß, warum wir das gemacht haben. Wir haben, mit Fabian haben wir doch so Enchanting-Stream gemacht, der mein Account quasi upgraded hat. Und dass wir es gleichzeitig sehen, hat er sein Game geshared mit Parsec, sodass ich es direkt gesehen hab. Das war richtig huge. Hat der quasi mein Game gespielt bei mir. Und so haben wir noch nicht mal Account-Sharen müssen, was gegen Toss gewesen wäre. Wir haben einfach mit Low Latency mein Game geshared zu ihm. So konnten wir nämlich im Stream sagen, wir verstoßen nicht gegen Toss trotzdem, dass jemand anderes auf meinem Account enchantet. Das ist mal Big Brain, oder? Ich mein, das ist ja kein Account-Sharing, wenn ich die Benutzerdaten nicht rausrücke. Wenn ich mein Computer share und jemand anderes auf meinem Computer das Spiel spielt, ohne dass ich ihm die Account-Daten gegeben hab, ist es ja kein Account-Sharing. Ihr könnt mir hoffentlich folgen. Und, dann hat's schon auch keiner beschwert. Aber das ist dem Hersteller eh vollkommen egal. Rainway, ich schreib mir das mal auf, das können wir tatsächlich mal ausprobieren. Ihr Stream-Ideen. Rainway Remote Gaming, irgendwie sowas. Kommt mal wieder Warzone, ja vielleicht sogar noch heute Mittag, mal gucken. Was ist denn mit dem Mauszeiger los? Der Mauszeiger ist shab. Guck mal an, der Mauszeiger ist falsch rum. Warum ist der Mauszeiger von links nach rechts? Das verwirrt mich. Die Musik ist ein bisschen laut jetzt, ne? Ja, besser. Der Installer ist kacke, richtig kacke. Das ist noch nicht mal der Standard Ubuntu Installer, das ist sowas Selbstgestricktes oder so, oder irgendwas aus dem Standard Ubuntu Installer abgewandeltes. Oje. German Keyboard Layout. No dead key. Alter, next. Download. Doch, das ist der normale Ubuntu Installer. Äh, brauchen wir alles nicht. Ah, excellent Musik hier, ha? Exquisite. Erase disk, na klar, was sonst? Jaja, mach mal. Hier, wir stretchen das mal mit Aspect Ratio. Das sieht besser aus. In Berlin, wir sind in Frankfurt, nicht in Berlin. Aber das gibt's nicht auf der Map. Eigentlich müsste es anstatt Berlin Frankfurt geben. Test. 123456. Fair Passwort. Das ist aber auch das einzige System, was ich kenne, das 123456 als ganz gutes Passwort einschätzt. Wieso kein Arch, by the way installiert? By the way, wir haben Arch installiert, hier. Excellent. Aber nur by the way. Passwort liegt. Next. Also ich verspreche mir da zumindest von, also umgekehrt, die versprechen ja, dass es gibt ein vorkonfiguriertes Gnome mit einem i3 als Oberfläche. Ich verspreche mir davon, dass das eventuell eines der wenigen sinnvollen Distributionen ist mit vorenstehendem i3, die man gut verwenden kann. Gibt's ja nicht so viele. Das Manjaro i3-Spin-Off gefällt mir überhaupt nicht. Das ist so konfiguriert, wie ich es überhaupt nicht mag. Oh, der Michael 50 Billion ist am Start. Und wie war dein Vorstellungsgespräch? Erzähl. Schieß los, da bin ich jetzt gespannt. Hab's auf Dienstag verschoben? Ach so, warum das denn? Oder die haben es verschoben? Du hast es verschoben. Okay. Weiß nicht, ob das so einen guten Eindruck macht. Hast du das Archiv-Frontend schon gesehen? Nö. Ich wusste nicht, dass es ein neues Archiv-Frontend gibt. Soll ich mal gucken? Sebaro, darf ich schon gucken oder ist noch nicht fertig? Soll ich gucken oder soll ich warten? Ist das Sebaro überhaupt da? Qt-Mod? Archiv? Ach im Discord? Nee, das hab ich noch nicht gesehen. Das hab ich noch nicht gesehen, nee. Können wir uns mal angucken? Discord. Muss aber nur aufpassen, dass ich nicht im falschen Channel bin. MonkaS? Wer weiß? Nee, okay anscheinend bin ich im... Okay, ich bin... Da muss man nämlich aufpassen hier, es gibt hier gefährliche, gefährliche Channels. Also... Wo ist denn das Bild? Proggers? Wo ist das Bild? Oh jetzt kommt der Sebaro, Channelscripting BigBrain. Du kannst einfach, du kannst einfach glaube ich Dollar-Add verwenden an der Stelle. Dollar-Add sind glaube ich die Parameter, die übergeben werden aus dem Kopf. Archiv? Ach so, da ist es. Oh hier gehts aber richtig high IQ-mäßig zur Sache. Ich seh das schon, ich seh das schon, ja. Und das gucken wir uns jetzt mal in groß an, ja ja alles gut. Exzellent, ja. Komm mal sogar mit Darksteam, seht ihr das Leute? Richtig high IQ-Proggers, was hier am Start ist. Was, und was kann man damit jetzt machen? Kann es, kann man das, nach was kann man alles suchen? Nur nach Titel oder auch nach Kategorie und auch nach sonst was? Aber das ist schon mal Massive. Oh hier was, was, was die Leute alles auf Dreier kriegen. Achso das ist gar nicht von meinem Browser. Ja das ist, ähm der Chat sagt schon, ihm gefällt der Grauto nicht. Ich gehe mal auch nicht davon aus, dass das Final ist, sondern einfach mal was gemacht, womit man gerade am Basteln ist. Aber das ist, das ist sehr nice. Exzellent. Und eine Runde Big Brain. So, so ist das gut. Das sieht schon mal echt gut aus. So, also hat es jetzt installiert. Installation complete. PS5 Livestream gesehen. Nee, wann war der? Gestern um 10. Doch, klar, haben wir geguckt, haben wir sogar live im Stream geguckt, habe ich gesehen. Das Design sieht aus wie eine Fritzbox. Mit weißen Hälften. Fritzbox Sandwich. Please remove the media. Ja, machen wir auch, so ist schon removed. Vm. Input. Stretch. Okay, stretch aus. Mal gucken, ob Vmr-Tools vorinstalliert sind. Ja, also wie gesagt habe ich gesehen. Es waren zwei, drei Spiele dabei, die waren ganz cool. Insgesamt war das Event eher, eher, eher so. Eher so als so. Es war eigentlich ums, eigentlich war es so. So, das trifft das Event ganz gut. Das war nicht komplett zum Einschlafen, das war jetzt auch nicht übertrieben. Eher, nicht übertrieben. Poggers, das war eher so. Okay, Champ war das. Du T-Mac, du bist nicht der Einzige, davon habe ich schon einige Bilder gesehen. Was macht das eigentlich gerade? Außer, außer laden. Macht das noch was? Hm. Hardcoded Ladebildschirm. Ja, ob es noch was macht, ich weiß es nicht. Es lädt auf jeden Fall. Ladebildschirm. Das habe ich in irgendeinem Video noch mal erzählt. Ladebildschirm. Ich weiß gar nicht mehr, wo das war. Eines der Ersten. Ladebild, Ladebild-GIF. Patrick, wie lange dauert das normalerweise? Nicht so lange, oder? Zumal es auch so aussieht, das macht es nichts. Die VM eidet vor sich hin. Na, Chico, was ist los? Die Katz schleicht durch den Flur, so als hat sie den Flur noch nie gesehen. Da liegt nämlich meine Hose rum und die muss jetzt begutachtet werden. Chico, das ist meine Hose, das ist nichts Gefährliches. Ok, anscheinend funktioniert es nicht. Yep. Chico. Scheint kaputt zu sein. Restart. Ok, restart funktioniert. Wir können mal gucken, ob wir in Grub kommen und irgendwie Verbau einschalten können. Ey, das juckt nicht. Aber wenn wir schnell sind, kriegen wir es wahrscheinlich hin. Ey, ein Hard Drive. Hä? Was? Warum ging das jetzt? Ich habe einfach nur Escape gehämmert. Hat da irgendjemand eine logische Erklärung für? Neog, das kapiere ich nicht. Du hast auf dem Kopfhörer den Stream. Ach ne, du hast telefoniert, jetzt habe ich kapiert. Ah, ok. Was ist das denn? Ok, warum das jetzt aber funktioniert an einem Neustart, verstehe ich nicht. Geht das immer? Was haben wir hier? Launch. Ah, guck mal, wir haben, wir haben ne, ok, dann, das erste, was wir jetzt machen, ist ein Browser aufmachen. Ok, Steuerung D ist Settings, das ist für mich schon mal ungewohnt. Also wie startet man was? Launch, Terminal, Windows-Enter. Browser-Shift-Enter, Application-Shift-Windows-Space, das ist ein Rohfi bestimmt. Neo, ja, das war bestimmt etwas, etwas Wirechamp, Weirdchamp. Ok, was haben wir hier? Firefox, Browser. Das, das gefällt mir hier neben, das hat was. Dass man sich merken kann, dass es immer angezeigt wird, ist auch doof. Also wir machen das jetzt. Linux, ne, wie heißt der Kram nochmal? Name, den man sich nicht merken kann. Dann schauen wir uns jetzt nämlich mal an, was die auf ihrer Webseite bewerben. Learn More. Super Fragezeichen, Overlay. Super Fragezeichen haben wir doch hier schon. This Dialog, Shift. Ok, es ist Shift? Ah, da kann man das ein ausblenden, das gefällt mir schon mal, das hat was. Wir müssen übrigens noch was gucken, ob die 3D-Beschleunigung eingeschaltet ist oder nicht. Ja, IFK 9 Monate, Excellent Subscription, Huge, Big Prane Sub. Massive. Subscription. So, also was haben wir denn hier für standardmäßige Keybindings? Terminal, Istdings, Enter. Das finde ich schon mal gut. Sachen auf den zweiten Desktop verschieben funktioniert genauso wie ich das gewöhnt bin. Neue Distro, ne, nicht so wirklich, es ist ein Ubuntu mit vorkonfiguriertem GNOME und i3. Also quasi, es ist ein GNOME Desktop, wo dann i3 quasi in der GNOME Session läuft. Das ist ziemlich Big Brain, weil die tun gar nicht so als wäre es ein neues Distro im eigentlichen Sinne, sondern die sagen ganz klar, es ist ein Ubuntu mit vorkonfiguriertem i3. Das finde ich gut, weil es gibt wenig gute i3-Distributionen. Also mit i3 ordentlich vorkonfiguriert. Ok, was haben wir denn, Application Space ist der Launcher, ok, ist ähnlich wie bei mir. Farbschema finde ich schon mal recht passend, finde ich eigentlich ganz nett, was da eingestellt ist aktuell. Man kann es auch zurückstellen, ok. Was hat er denn für eine Schriftart standardmäßig? JetBrains Mono, ok. Hipster, Hipster Schriftart. JetBrains Mono. Ist denn meine Lieblingsschriftart wenigstens vollenzählen, jetzt zeig mal her. Heck, ne, ist nicht vollenzählen, muss auch nicht vollenzählen sein. Gibt es einen T-Max drauf? Auch nicht, ok, das ist in Ordnung, man muss ja nicht alles vollenzählen haben. Das erste, was wir machen, ist erstmal einen T-Max installieren, yes. Ok, gefällt mir eigentlich ganz gut bis jetzt. Schriftart, naja, nicht mein Fall, es ist eine gute Default Choice, ist ok. Update has been issued, ja, install now. Exellent. Es sieht auch, finde ich, gut gestylt aus, es passt alles zusammen. Ohne sie standardmäßig darksteamed, das finde ich nice. Das gefällt mir. Und daran sieht man, dass es halt ein Gnome mit i3 ist, weil das ist, dass diese Updater ist halt, ne Gtk Anwendung, die läuft bei mir beispielsweise gar nicht im Hintergrund. Also ich hab, auf meinem Manjaro i3 kann diese Anwendung eh nicht laufen, aber ich hab da auch kein grafisches Update Zeug am Start. Schonmal Kitty ausprobiert. Ich hab einige grafikbeschleunigende Terminals schon ausprobiert. Bisher muss ich sagen, alles in allem, vom Font her, von der Handhabung her gefällt mir nach wie vor Gnome Terminal immer noch am besten. Auch wenn das irgendwie oldschool ist und jetzt nicht das schnellste Terminal überhaupt, aber wozu muss ein Terminal wahnsinnig schnell sein. Ein Terminal muss ich gut bedienen lassen und nicht so ein Kack wie das CMD Fenster und da bin ich aus. Was ihr hätten machen können ist, dass die Fenster Schriftart, die Fenster Hintergrundfarbe nicht exakt die gleiche Hintergrundfarbe ist vom Terminal, weil, naja, da siehst halt kaum was. Und das Fenster laggt übrigens beim Verschieben wie Sau. Restart. Restart now. Mal gucken, ob er jetzt Restart ohne, ja UrXVT hatte ich jahrelang, aber ich hab's jetzt durch Gnome Terminal abgelöst. Ok, man muss anscheinend Escape hemmern, dass es funktioniert. Ist das ein Bug in diesem Ladebildschirm, dass es nicht funktioniert? Das ist ja low. Vielleicht ist es auch der Noobfilter. Guck, wenn er Escape hemmert, dann geht's. Das ist nur in der VM. Vielleicht versucht er auch was zu starten, was ich mit der Scale abbreche, aber normalerweise sollte, ich weiß es nicht, was der für Schmerzen hat. Ok, Enter is Terminal, das finde ich gut, das habe ich nämlich standardmäßig bei mir auch so. Sie haben auf jeden Fall ein bisschen 3D Zeug im Hintergrund, das sieht man nämlich daher, wenn man jetzt hier, ich mach mal kurz, ah Moment, Moment, was war die Veranwendung starten? Space, Space, da muss ich mich erst dran gewöhnen. Man sieht es nämlich, wenn ihr rüber switcht, seht ihr wie das faded? Das kann X und I3 standardmäßig nicht, da muss irgendein Composite Manager im Hintergrund sein hier, wird das überfaden. Was ist das? Notifications. Keg. Was ist das hier, Kalender? Oder, sehe ich das richtig, Kalender? Ah, ok, das ist die Gnome 3 Integration, die mich jetzt persönlich nicht so sehr juckt, aber es hat schon seine Vorteile. Es hat schon seine Vorteile, ich meine, die Gnome ist sau viel eingebaut. Es ist nicht umsonst so, dass die meisten Sachen mittlerweile auf Gnome Basis sind. Date und Time. Ach nee, man kann hier nur das Format umstellen. Na gut, ob man das standardmäßig bei einem Klick öffnen muss, weiß ich nicht. Ja, CPU. Oh, was ist das? Task Manager, irgendeine Art Task Manager. Wie poppe ich das Fenster aus? Das ist nicht der Standard, nicht der Standard. Layout. Task Manager. Ok, wenn man den Task Manager als GUI Programm braucht, warum nicht? Ja, warum nicht? Das glaube ich dem Firefox nicht, der Firefox braucht mehr RAM. So, das heißt, was war Hilfe? Shift Windows? Session. Restart, Power Down, bla bla bla. Terminate App. Ach so, App beenden, ok. Was ist in Fenstermodus? Resize Window. Ok, probieren wir das mal aus. Ok, Resize. Ach, Enter Resize Mode. Ja gut, das kenne ich, das ist Standard E3, das ist Standard E3. Navigate. Scratchpad, was ist das? Probieren wir mal aus. Windows, Control A. Windows, Control. Windows, Control A. Ok. Windows, Control A. Nö, hat keinen Effekt. Windows, Control A. Macht nix. Klappt richtig gut. Previous Workspace, das brauchen wir alles nicht. Modify. Machen wir es hier mal kurz zu. Windows Position, ok, das ist das übliche. Windows Shift, ja, das ist glaube ich sogar die Fault. Windows Flowtoggle, das habe ich gesucht. Windows Shift F, ok. Windows Shift F, ah ja, genau, das habe ich gesucht. Dass man Windows, dass man quasi auch normale Fenster draus machen kann, ok. Es ist eine Mischung aus die Fault E3 und ein bisschen abgewandelt, was relativ logisch ist. Ich habe auch normalerweise eine Scratchpad laufen, das ist bei mir ein Overlay Terminal, aber anscheinend geht es standardmäßig nicht. Files Search. Windows, Windows Altspace, ok, das lässt sich merkwürdig drücken. Returns Matches for all local files, ok. Wim, Etsy, oder was? Bash. Hey, oh, das ist praktisch, dass das drinnen ist. Das finde ich cool. Kann man die auch öffnen? Ach ja. Das ist doch nett. Das ist doch nett. Ist das ein, ist das ein, ist das ein GWIM oder was ist das hier? Ah nee, G-Edit ist das. Kein, kein GWIM. Ok, das Farbschema finde ich ein bisschen unglücklich, aber das ist doch nice, wie sie das eingebaut haben. Das gefällt mir ganz gut. Also man sagt, man sagt jetzt Files Search, ich habe schon wieder vergessen, was Files Search ist. Altspace, dann sucht man eine Datei, Bash und sagt, keine Ahnung, öffnen, muss einfach nur Enter drücken und es geht im Editor auf. Das haben sie schön gemacht. Ich würde das natürlich eh über das Terminal machen, ja, aber standardmäßig eingebaut kann das nicht schaden. Das finde ich, finde ich ganz nett. Oh Leute, ich muss Essen bestellen nehmen bei. Muss Döner Teller bestellen. Richtig. Döner Teller. Döner Teller. Auf halb zwei oder so. Döner Teller. Döner Teller mit scharfer Soße und Pommes frites. Exzellent. Nicht von, du bist am, was du bist am Fasten. Warum machst du denn sowas den Baro? Ja, nicht den Baro, Patrick. Darf nicht fetter werden. Okay, das ist ein Argument. Das ist, das klingt logisch, ja. Das soll ich vielleicht auch machen, wenn es darum geht. Ich meine, bestellen, das bestellender Bestellvorgang ist broken. Ich kann nicht bestellen, was ist denn hier los? Oh, derzeit geschlossen. Warum? Ach, die machen erst um zwölf auf. Ja, das ist ja gut. Es ist jetzt ja zwölf. Wir können sie jetzt aufmachen. Kann ich jetzt bestellen. Optimales Timing. Aber Patrick, da sind wir ja fast ähnlich dick. Du bist ein Ticken dünner Ticken, nicht viel. So, also kann ich jetzt bestellen? Es ist zwölf. Nee, es ist 11 und 59. Die Uhrzeit auf dem Server geht neun Minuten nach. Das ist schlecht, je nach Server, weil da kannst du dich teilweise per SSH nicht mehr einloggen. Ah, jetzt hat's offen. Okay, also Döner Teller. Das ist exzellente Döner Teller. Döner Gerichte. Döner Teller. Also, wir wollen scharfe Soße haben. Scharfe Soße und einmal Pommes frites bestätigen. Bestellen. Max, Nachname ist Top Secret. Ähm, zusätzliche Nachricht. Lieferzeit 13.15 machen wir mal. Zur Kasse. Paypal. Bestellen. Okay. Ja, weil ich hab übels Cold Amp. Ich muss jetzt unbedingt was zu Futter bestellen. Paypal. Hallo. Okay. Okay. Okay. Okay. Okay. Oh, ich kack noob. Ich hab ja mein, mein Paypal Passwort geändert. Äh, muss ich anderes. Das weiß ich aus dem Kopf nicht, mein Paypal Passwort. Da muss ich anderen Account nehmen, wo ich aus dem Kopf weiß. Ah, exzellent, jetzt passt's. Big Brain. Checkout 8 Euro. Paypal gut haben. Alles klar, passt. Essens Stream, nee. Weiß ich nicht. Wieso gibt's kein P pro Fett? Oh, das brauchen wir unbedingt. Ähm, Hardcore Crystal Mask. Name wieder, ähm, Bridge Prime. Dankeschön. Exzellent. Hype Subscription. Ihr wisst doch, meine Passwörter sind überall. 1, 2, Test und 1, 2, 3, 4, 5, 6. P pro Fett. P pro Fett. Oh, das brauchen wir als Emote. Ganz wichtig. P pro Fett. Ich mach's gleich rein, Leute. Das ist gut. Oder gibt's da noch eine bessere Variante von? Gibt's noch ein besseres P pro Fett? Nee, ist alles Mörder wenigstens gleich. Ich mach's rein, Leute. Add to my channel. Ist drinne. P pro Fett. Wer FFZ hat, kann den Stream refreschen und P pro Fett funktioniert. P pro Fett. Ich refresch auch mal den Stream und probier's aus. P pro Fett. Okay, anscheinend ist doch noch nicht da. P pro Fett sollte jetzt eigentlich funktionieren. Dann braucht, dann braucht man FFZ eine Weile, bis es geladen hat. Ozebaro, das klingt schlecht. Warum sagt mir die Seite, ihre Bestellung wird in 30 Minuten geliefert? Ich hab gesagt 13.15 Uhr. Mango United Gaming, zwei Monate. Dankeschön. Exzellent Subscription. Huge. So, was können wir sonst auch schön ausprobieren? Wir haben ja gerade erst installiert. Also Standard-Sachen, Navigation und so haben wir ausprobiert. Was haben wir hier sonst noch? Browser haben wir schon, haben wir off. Command, was ist Command? Windows, Windows Shift Space. Ach so, irgendeine Command-Run Hardtop. Ja, es ist nur Run Hardtop im Hintergrund. Das bringt es jetzt nicht so wirklich. File Search, File Browser. Okay, was haben sie da installiert? Okay, das sieht aus wie ein ganz normaler, ganz normaler Nautilus. Ist das der Nautilus? Ohne dass Nautilus dran steht oder ist das was anderes? So, das finde ich schonmal. Das gefällt mir vor, konfiguriert. Das hat irgendwie was. Ich finde auch dieses Overlay hier schick, dass man nachgucken kann, welcher Shortcut was ist. Das braucht man so die ersten ein, zwei Tage. Danach hat man sich's gemerkt. Okay, was gibt es denn sonst noch für Sachen, was die sagen, was gut ist? Super Enter Terminal Application Launcher hatten wir auch schon. Super Space. Der ist auch, das ist garantiert ein Rohfi und der ist aber auch schon ganz gut vorkonfiguriert. Das finde ich, finde ich schick, gefällt mir. Live Patch. Huge Terminal. Es ist auch wenig drauf, das finde ich gut. Guck mal, es ist kaum was drauf. Das ist gut, Hardtop, das ist gut vorinstalliert. So, was haben wir sonst noch? App Launcher. Need more Terminals. Was? Super, Super und Backspace? Was? Super, Super Backspace. Hä? Super Backspace und dann Super Enter. Super Backspace, Super Enter. Hä? Super Backspace, Enter. Super Backspace, Enter. Super Backspace, Enter. Ach, guck mal, der macht hier, der macht jetzt, der splitte das, das ist eigentlich eine ganz coole Funktion. Das ist eigentlich eine ganz coole Funktion. Normalerweise gehen die Programme ja so aufeinander und jetzt kann man, wenn man mehrere Terminal braucht, kann man das so schneckenmäßig machen. Das finde ich eigentlich ganz cool. Backspace, Enter. Backspace, Enter. Ah. Okay, es wird ein bisschen übertrieben. Das ist aber eine gute Idee, das gefällt mir. Ich verwende das normalerweise nie, weil meistens mache ich so, meistens mache ich so, ich mache zwei Sachen auf und dann so. Das ist mein Standard, das oder so ist eigentlich mein Standard Terminal Layout, wenn ich was machen muss, wo ich mehrere Terminals brauche. Meistens habe ich so, wenn ich mehrere Fenster auf habe, meistens habe ich ja eh noch meinen T-Max auf und mache alles da drüber. Eine halbwegs sinnige T-Max Config hätten sie vielleicht noch vorkonfiguriert dabei haben können, das wäre nicht schlecht. Sebaro sagt, würdest du sagen, dass es besser ist als der normale Ubuntu Desktop? Na besser kann man eh nicht sagen, besser für was? Na besser für Noob Einsteiger garantiert nicht? Für Leute, die ordentlich vorkonfiguriertes i3 suchen, ist es die einzige Alternative, die mir so einfällt. Was hältst du von T-Muxinator? Hab ich glaube ich noch nie ausprobiert. Ist das Terminator mit T-Mux? Ach nee, das ist die Geschichte, wo du T-Max Sessions speichern kannst und sowas. Das ist sicherlich ganz cool, aber ich habe noch keinen Anwendungszweck für gefunden, wo ich sagen würde, oh ja das wird mir richtig was bringen. Weil meine T-Max Sessions sehen in der Regel so aus. Ich habe T-Max auf, habe einige Tabs mit jeweils nur einem Programm oder eine SSH Sessions oder sonst was und ein paar, wo vielleicht mal was gesplittet ist, aber ansonsten sind meine T-Max Sessions eigentlich zu normal, dass ich sowas bräuchte. Der Patrick findet es toll, ja das ist doch schon mal schön, da haben wir einen User, der es benutzt und es gut findet. Choggle Float Mode Windows F, ja das finde ich gut. Standardmäßig habe ich es auf Shift-Windows-Lehrzeichen. Mount hier USB-Drives, das juckt mich jetzt nicht so. Muss meine USB-Drives nicht mounten. Navigate Workspace hatten wir schon, das haben wir auch schon. Dass die auf den Screenshots immer so extrem kleine Schriftgröße haben. Ich habe ja mittlerweile meine Schriftgröße alles so in dieser Größe, einfach weil es für die Augen viel angenehmer ist. Die Leiste finde ich eigentlich auch ganz gut vorkonfiguriert. Irgendjemand hat gesagt, die würde total hässlich aussehen, ich finde die eigentlich ganz gut. Ich meine meine normale Leiste sieht ungefähr so aus, wie ich habe. Das ist so meine normale Leiste. Ich meine gut die sieht ein bisschen fancierer aus als die Leiste, aber die passt vom Style her, finde ich eigentlich ganz gut. T-MAX ist sowas wie Screen, ja bloß dass es noch viel mehr kann. Screen war ja im Prinzip nur dafür da, dass seine Session nicht abgekackt ist. T-MAX kannst du Sachen splitten und vergrößern und reinzoomen und so. Nicht vergrößern, reinzoomen, also Fenster größer machen, dich detachen auch und auch ein bisschen verskripten wenn man es will. T-MAX ist ganz nützlich. Ich mache es oft mal so, wenn ich auf den Server gehe und weiß, dass ich schon eine Weile drauf machen muss, mache ich erstmal eine T-MAX Session auf und das beste an T-MAX ist, dass man die Session sharen kann. Also sprich, wenn zwei Leute auf dem gleichen System sind, kann man die T-MAX Session sharen. Also zum Beispiel, wir tun jetzt mal so, als wäre das hier ein zweiter Rechner wo ich drauf wäre oder das hier eine Remote Verbindung, dann würde ich einfach Sachen T-MAX minus A und seht ihr schon bin ich in der ersten Session drin. Und das machen wir auf der Arbeit relativ oft, dass wenn irgendwas nicht geht und irgendwie einer was guckt, ein anderer mitgucken soll, dann sagen wir hier T-MAX Session als Route ist auf, dann lockt er sich per SSH ein, macht T-MAX A und ist attached. Das ist dann praktisch, wenn man zu zweit gucken will. Mir gefällt die E3 Bar unten nicht, ich hätte die E3 Bar lieber oben. Aber ich kann mir ja alles ändern. So was haben sie sonst noch so hier? Components, hatten sie irgendwas? Ubuntu App Store, ah Moment, Windows Shift App, sehr gut, Store, sehr gut, es relied on Ubuntu App Store, aber, ach Snap ist das. Snap. Also das haben sie standardmäßig drauf, XOR, klar was anderes gibt es ja auch nicht. E3 Gaps ist standardmäßig da, wie man hier sieht, zwischen den Fenstern sind 5 Pixel oder so Platz. Das geht nur mit E3 Gaps. So ein Feature verstehe ich gar nicht, warum sie das nicht in den Standard Desktop mal aufnehmen. Ich finde es einfach schöner, weil die Fenster optisch besser voneinander getrennt sind. In Windows habe ich sie unten, in E3 habe ich sie gerne oben. Ok, Look. Ach guck mal, man kann, ach schau mal, man kann verschiedene Themes anwenden. Ok, das probieren wir jetzt noch mal aus. Ubuntu Look, Ubuntu Style, Solarize Style, Look, was, As, was, La Keile, Las Keile, Las, wie spricht man das denn aus? Das ist bestimmt französisch. Kahuela, Mirage, Dark Look, Ahu, AAU. Ok, wir installieren mal den Ubuntu Look und switchen das mal. Mal gucken, wie einfach das funktioniert. Und dann switcht man das wie? Ah ja, Set, Ubuntu und dann Refresh. Das sieht ja eklig aus. Das gefällt mir ja gar nicht. Was, Nord? Das sieht eklig aus, der Ubuntu Look, der gefällt mir aber überhaupt nicht. Set, Moment, wie ging das jetzt noch mal? Refresh. Hä? Es war auch kein Unterschied dazwischen. List, was ist denn alles installiert? Set, ok, das ist der Standard Look. Refresh. Äh, irgendwie ist das kaputt, das lässt sich nicht mehr umschalten. Monkeys, Broken, Reboot und Escape-Hämmern, weil Escape muss man drüber hämmern, sonst startet er nicht. Es hat einen Fehler gegeben, echt, habe ich nicht gesehen. Guck mal, jetzt haben die Desktops auch Farben. Ist eigentlich ganz nett. Aber das sieht eklig aus, warum sieht das jetzt so eklig aus? Ich will den normalen Look wieder haben. Set, das war doch die Fall Look. Ah, Already Existing. Ja, aber das ist doof. Das heißt, warum überschreibt der das denn nicht? Das ist doch doof. Gibt es da Minus F oder sowas? Minus F? Ne, soll ich das jetzt löschen? Das ist aber doof. Set, ok, probieren jetzt mal das andere aus. Refresh. Wo ist mein Terminal hin? Refresh. Ah ja, da kommen wir der Sache doch schon näher. Oh, was ist das? Das kommt raus, wenn ich mit Paint Sachen male. Ok, aber das Farbschema gefällt mir schon mal besser. Das andere. Aber warum kann man das nicht überschreiben? Das ist doch total bescheuert. Ich muss immer das Pfeil löschen dazu. Ok, das ist jetzt Standard, der Standard Look wieder. Und jetzt haben wir auf einmal hier Icons und so, die wir vorher nicht hatten. Also ich muss sagen, Nord hat mir am besten gefallen bisher. Ja, oder? Nord sieht das gefällt mir am besten. Das sieht wieder am besten aus bisher. Oh, da werden zig Sachen umgemappt. Das können wir erstmal so lassen. So, was haben sie denn sonst noch hier? Was preisen sie denn sonst noch an? Nix. Das ist aber auch nicht schlecht, weil es funktioniert einfach. Also ich kann mich nicht beschweren. Ich finde das eigentlich ganz nett. Gibt auch Nordseam für Wim. Ok, das ist doch wirklich ganz nett. Guck mal, die ändern sogar die Default-Config. Jetbrains. Nehmen wir das andere. Das ist doch echt ganz nett. Das ist ein stinknormales Ubuntu LTS mit recht gut vorkonfiguriertem i3. Man hat das Gnome-Zeug, wo man es braucht. Ich wüsste jetzt nicht genau, wo man es braucht, aber man hat es, wenn man es braucht. Man kann zum Beispiel Gnome-Settings und sowas verwenden, was unter einem normalen i3 ohne Gnome nicht funktioniert. Wenn man irgendwelche High-DPI Geschichten hat, kann man auch das Font-Scaling und Gedöns hoch machen, was wir jetzt bei mir nicht machen. Auflösung ändern muss ich jetzt natürlich nicht. Dann die ganzen Gnome-Settings dabei. Das finde ich echt ganz hübsch. Es ist ein stinknormales Ubuntu 2004 LTS, also sprich, an Software wird sich da nichts großartig unterscheiden. War VmTools vorinstalliert? Ja, VmTools war auch vorinstalliert. Kuchenis kommt drauf an, was du machen willst. Also wenn du nichts brauchst, was nur unter Windows gut läuft, dann probier es aus. Wenn das Notebook ein bisschen älter ist, spricht auch meistens nichts dagegen, weil die Chance, wenn das Notebook ein bisschen älter ist, dass Linux gut drauf läuft, ist eigentlich recht hoch. Ich würde vorher mal gucken nach dem Modell in Kombination mit Linux, mal bei Google gucken, ob es da irgendwelche großen bekannten Probleme gibt. Wenn nicht, kannst du mal ausprobieren. Alternativ kannst du auch einfach Linux mal in der Vm Installation gucken. Aber nicht unbedingt auf dem Notebook da, ja. Das wäre auch ein nice Server-OS mit GUI, sagt das Ebaro. Mag sein, die Frage ist bloß, wozu brauche ich einen Server-OS mit GUI. Server-OS mit GUI brauchen bloß irgendwelche Windows-Leute, die denken, man bräuchte einen GUI, um Server zu administrieren. Ich habe noch nie, als ernsthaft noch nie, irgendwo das Bedürfnis gehabt, wenn ich mich auf einen Server connectet habe zu sagen, oh ja, jetzt hätte ich mal gerne einen Desktop auf dem Server. Weil die ganze Sache unter Linux ist da drauf ausgelegt, dass du es mit der Konsole bedienen kannst. Du brauchst keine GUI. Das einzige, wo es sinnvoll ist, manchmal ist sich per X-Forwarding einen Browser zu holen, um zu gucken, ob der Server irgendwo hin kann und ob alles funktioniert. Also per X-Forwarding einen Browser ist teilweise mal ganz nützlich. Aber irgendwo muss man auch hin mit der ganzen Performance. Die können auch einfach rum eilen, das stört die Kisten ja nicht. Also es gibt jetzt hier wirklich wenig zu gucken. X-Forwarding ist das Beste, wenn man einfach nur kurz was testen muss. Dafür muss man nämlich nichts installieren. Wenn man einfach nur kurz gucken will, ob irgendwas funktioniert, ist X-Forwarding das Beste. Es ist nicht schnell, aber um mal kurz einen Browser zu starten und Google aufzumachen, reicht es. Ich will ja nicht erstmal irgendwie einen RDP konfigurieren müssen oder sonst was. Da ist X-Forwarding schon nicht übel. Und am besten ist man macht bei X-Forwarding gleich die SSH-Compression an, dann ist es auch noch ein bisschen schneller. TrueMorphoise, ich auch, aber ich glaube, das wird in nächster Zeit nix. Voll verkackt. Ja, mehr gibt es da wirklich gar nicht bei der Linux-Distribution gar nicht großartig auszuprobieren. Es funktioniert, was sie versprechen funktioniert, das ist ja auch schon mal was. Es ist ein Ubuntu-LTS mit Gnome, und i3 drinne läuft. Ordentlich vorkonfiguriert und gut ist. Ist doch echt nicht schlecht. Achja, wofür SSH-Forwarding manchmal auch noch gut ist, sind, weil es gerade im Chat steht, sind manchmal irgendwelche Installer, die es gerne grafisch haben. Midnight-Commander, das ist ja Konsolen-GUI, das passt schon. Aber selbst das mache ich nicht. Ich bin da nie warm mitgeworden mit irgendwelchen Kommandozeilen, Filemanagern, ich mach das ganz normal. CDRMLS reicht. Ja, jetzt gucken wir mal, ob ich irgendwelche Fragen übersehen habe. Was wäre in dein Traumauto? Gar keins. Mein Traum wäre, dass ich kein Auto brauche. Aber alternativ könnte man auch die VM per Capture-Card im Host einspeisen. Ja, das würde funktionieren. Das könntest du machen, ja. Aber da hast du auf jeden Fall mehr Input-Lack, wie mit Looking Glass. Am besten e-Monitor dran und gut ist. Das Schwierigste mit GPU-Pass-Through und VM-Werbespielen ist eh, dass du eine zweite Maus und Tastatur brauchst zum Durchreichen. Zwei Festplatten, wo du hin und her schiebst. Was spricht gegen R-Sync und CP? R-Sync ist doch das beste für hin und her schieben. Kraft-VM-Switch kann man auch machen. Aber die meisten sind unnötig teuer. Also schön ist es nicht. So, das hatten wir. Hatten wir. Hast du schon einen EVE-Monitor gesehen? Nee, was ist das? EVE-Monitor? Spectrum New EVE. Crowdsourcing-Monitor, ob das was wird. EPS-Panel, das ist schon mal rein für Farbe und Blickwinkel ein Gewinn, wenn es aber auch mit Nachteilen daherkommt. Display HDR 400, das kommt mit hoch, wenn EPS. 240 Hz. WQHD bei 240 Hz, ok, das ist ganz nice. Was wird's kosten am Ende? Kostet was? 599 Euro, das ist echt günstig. Das ist für einen 4K. Wo steht's hier oben? Für einen 4K mit 144 Hz ist das echt sehr günstig. Und auch für den WQHD 240 ist das echt günstig. Wenn der Rest taugt, zumal es auch ein EPS-Panel ist, muss man mal vergleichen, muss man mal schauen, was das taugt, wenn's rauskommt. Wo gibt's denn das Crowd-Founding, das Kickstarter? Ja, da bin ich mal gespannt, was da rauskommt. Ach, man konnte in der... Ach so, ok, es ist kein Crowd-Founding, es ist quasi mit Community einbeziehungsweise... Ach, das meinen die mit Crowd. Du konntest quasi an der Entwicklung dich beteiligen, wenn du sinnvolle Sachen gepostet hast. Ok, das ist ganz sinnig. Das sollten mehr machen. Allerdings, man kann ja nicht alles machen, was irgendein Typ im Forum schreibt. Deswegen ist es trotzdem wichtig, dass du noch Leute hast, die da eine Übersicht haben. Aber ich finde, manche Sachen werden echt komplett an der Community vorbei entwickelt. Guckt euch Battlefield 5 an. Battlefield 5 war komplett an dem vorbei, was die Leute wollen. Von Anfang an, vom ersten Reveal-Trailer bis zum Einstellen des Spiels war Battlefield 5 komplett vorbei. Der einzige Lichtblick zwischendurch war mal das Pacific-Update, wo die Leute gesagt haben, ah ja, ist doch ganz nett. Aber ansonsten war Battlefield 5 komplett an den Leuten vorbei. Mein Handy sagt, ich habe jetzt Teambesprechung. Das glaube ich nicht, dass ich heute Teambesprechung habe. Ja, Battlefield 3 Remake Incoming habe ich schon gesehen. Battlefield 3 Remake ist, glaube ich, nur ein Schachzug von EA, den Battlefield 5 Fail zu kaschieren, bis Battlefield 6 rauskommt. Battlefield 3 mal ehrlich gesagt braucht kein Remake. Battlefield 3 sieht immer noch gut aus. Battlefield 3 spielt immer noch gut. Spielt sich auch gut. Das Einzige, was ein Battlefield 3 Remake bringen würde, ist, dass es das für die neue Konsolengeneration krippt, was schon mal huge Playerbase mehr hat. Und dass es ein bisschen neuer ist und wieder in den Köpfen der Leute ankommt und mehr Leute spielen. Dazu wäre ein Remake eigentlich nicht nötig, aber dadurch, dass wieder ein bisschen mehr Fokus der Leute drauf fällt, wird es auch wieder mehr Spieler haben. Also, ich gehe mal stark von aus, wenn das rauskommt, werde ich spielen. Auf Battlefield 3 hätte ich echt Bock mal wieder. Das kommt dann wahrscheinlich Ende des Jahres oder wann, die Musik hier. Excellent. Was geht da ab? Okay. Ja, das war in 2013. Wen juckt's? Alter, die Musik. Klar kannst du es jetzt ausspielen. Aber die meisten Leute kaufen lieber was Neues für die neue Konsolengeneration, was dann auch ein bisschen besser aussieht als ein Spiel für eine 2 Jahre alt oder für ein Jahr alte, nein nicht ein Jahr, für eine Generation hinten dran, um es dann auf der neuen zu spielen. Ja, ich bin, na, war ich gespannt, also. Sie müssen es eigentlich dieses Jahr rausbringen. Eigentlich müssen sie es dieses Jahr rausbringen bzw. Anfang nächsten Jahres, weil Battlefield 5 ist vorbei und irgendwas müssen sie ja machen, bis Battlefield 6 rauskommt. Es bleibt ja gar nichts an der Seite übrig. Irgendwas müssen sie ja treiben. Irgendwas muss ja passieren. Wollen wir wetten abschließen, dass EA völlig verkackt? Die Chancen sind hoch. Wenn es zusammen mit dem neuen Battlefield kommt, dann ist es irgendwie wäre sehr merkwürdig. Weil warum sollten sie das machen? Warum sollten sie sich selbst Konkurrenz machen bei einem neuen Battlefield Release? Ich habe kein Auto login aktiviert. Ich habe vor ein paar Sachen auf einem V-Server zu hausten, möchte das aber nur über einen VPN erreichbar machen, nicht über das Internet direkt. Quasi so eine Art Intranet. Hast du da eine Ahnung, wie ich das am besten mache? Ja, OpenVPN oder WireGuard. Allerdings, übers Internet erreichbar muss ja zumindest mal der VPN-Port sein. Sonst funktioniert es ja logischerweise nicht. Du musst ja über das Internet irgendwie hinkommen. Ich meine, du kannst alles dicht machen und nur den VPN-Port auflassen. Das geht. Das ist eigentlich kein Problem. Portnok? Ja, das geht auch. Aber dann brauchst du einen Kleinen, der das unterstützt. Ich weiß nicht, wie das mit den Mobile-Geschichten aussieht. Wird der einfach mit der Musik der Winterkund eigentlich ab? Exzellent. Also ich würde alles dicht machen. Vielleicht den VPN-Port auf einen anderen Port noch umlegen oder irgendwas 25.123 oder irgendwas nehmen. Am besten WireGuard, weil es einfacher zu handeln ist, vor allem im Setup wie OpenVPN. Und dann ist gut. Aber wenn du einfach nur Authentifizierung davor haben willst, was spricht dagegen, alle Ports zuzumachen und den Reverse-Proxy davor zu setzen, der irgendeine Art von Authentifizierung vorher macht, dann brauchst du den ganzen VPN-Kram nicht. Machst du Caddy oder Traffic oder Nginx oder irgendwas davor, im Zweifelsfall auch erstmal nur mit Basic-Auth und schon hast du die Sache erstmal so weit abgesichert, dass keiner einfach drauf zugreifen kann und du brauchst dich nicht auseinandersetzen mit irgendwelchen VPN-Getunneln. Aber mag ja sein, dass es da Anwendungszwecke für gibt. Hast du ein Wireless-Keyboard? Ne. Ich hab nur eine Wireless-Maus, kein Wireless-Keyboard. Tastatur ist per Kabel angeschlossen. Maus ist Wireless. Mit einem Charging-Maus-Pad. Port 1337. Ja, aber der wird garantiert immer mit gescannt, auch wenn er über 1024 ist, weil die coole Leute Port 1337 verwenden. Was ist eigentlich Port 1337 standardmäßig? Port 1337. DNS. Power-Folder. Und Waste. Was ist denn Waste? P2P-File-Sharing-Programm. Ah ja. Alles klar. Und warum verwendet ein DNS bitte schön Port 1337? Was ist das für ein bescheuerter DNS? Hab ich noch nie was von gehört. Was ist das? Professional IP-Address-Management. Okay, das ist so professional, dass es Port 1337 verwendet. Alles klar. Weißt du zufällig ob GPU-Pastru auch auf Windows-Hosts funktioniert? Auf Windows-Hosts? Nein, Windows-Hosts funktioniert es nicht. Also Windows-Server-Hosts geht es wohl mit Hyper-V halbwegs, aber nicht auf einem normalen Windows-Host. Also ich könnte jetzt nicht, ich könnte jetzt nicht hier auf meinem Windows 10 irgendwie GPU-Pastru machen. Ich will nicht ausschließen, dass es da irgendwelche experimentellen Hacks gibt, dass es vielleicht doch irgendwie geht, aber standardmäßig geht es nicht. Was sagst du zu NordVPN? Eigentlich komplett überflüssig. Einzige Sache ist halt, wenn man zum Beispiel langsam ein Download hat, jetzt Battle.net, irgendein neues Update und mal kurz so tun möchte, als kommt man aus Südkorea und lädt vom Asia-Server, dann bringt es vielleicht was, aber ansonsten ist NordVPN bzw. die ganzen VPN-Services komplett useless und überflüssig. Wie gesagt, geht nicht. Bist du ab und zu noch auf Kickstarter unterwegs? Ja, trotz dem Hosenscam. 120 Euro oder so, aber das ist ja klar, wenn man Kickstarter backt, muss einem klar sein, dass man ab und zu mal gescampt wird. Wirst du die neue Playstation holen? Irgendwann wahrscheinlich, aber diesmal eher nicht zu Release. Ich habe mir die letzten Konsolengeneration direkt zu Release geholt und nicht benutzt. Also insofern lohnt sich nicht. Kelmore sagt, 3D-Drucker gebackt auf Kickstarter, dann kam es nie an. Ja, feels Batman. Haben die einen Preis? Nein, die haben keinen Preis verraten bei der Playstation. Ja, das hatten wir jetzt auch schon. Ja, nice. Exzellent. Guck mal, wir sind erst eineinhalb Stunden on, was ist da los? Und ich habe noch 20 Minuten Zeit, bis mein Essen kommt. War man da? Die PS5 soll wohl angeblich 4,99 kosten. Ja, mal gucken, was da rauskommt, mir egal. Juckt mich nicht, ich kaufe es mir zum Release nicht. Ich warte, bis das sich lohnt, was es an Spielen gibt. Es gibt überhaupt keinen Grund mehr. Mittlerweile ja sogar so, wenn du so blöd bist und kaufst dir das ganze zu Release und es kommen erst 2-3 Jahre später die richtig guten Spiele, die du spielen willst, dann sagt Sony, haha, es gibt jetzt wieder eine Pro. Du hast umsonst Geld ausgegeben zu Release. Ich glaube diesmal zwar nicht, dass sie wieder den gleichen Fehler machen, eine Pro rauszubringen. Schon hast 10 Jahre YouTube-Video von Inscope gesehen. Ne, bin ich dabei? Wahrscheinlich nicht, aber der Boom ist dabei, habe ich gehört. Also ich glaube nicht, dass sie nochmal das rausbringen werden mit einer Pro-Variante, die ist ja leistungsfähig genug, wenn es neu ist, von der Hardware her, diesmal im Vergleich zur PS4. Aber ich traue Sony nicht und es hat keinen Sinn. Wenn es einen Sommergartenstädts geben, gab es sogar schon vor ein paar Jahren. Dass das wieder ein Big Brain-Thema gibt, ist das perfekte Bierglas. Es gibt kaum was, was mir mehr egal sein könnte. Ja, Big Brain-Thema wieder. Sehr möglich. Ja, kann sein, aber es wäre ziemlich bescheuert, das wieder mit der Pro zu machen. Ich finde, das hat der aktuellen Konsolengeneration mehr geschadet, als das, was es gebracht hat. Leider war halt die aktuelle Konsolengeneration komplett für den Arsch von der Hardware, als sie rausgekommen ist. Die neue ist da jetzt eine ganze Ecke besser aufgestellt. Leberkäs selber machen ohne Equipment. Oh, das trägt ja die ganzen Veganer wieder. Das können wir uns jetzt nicht angucken. 500 Megahertz, 5000 Megahertz Ramtakt, war komplizierter als gedacht. Ja und wahrscheinlich bringt es auch weniger als gedacht. Was genau passiert hier? Ah, ich dachte, die Katze spielt Klavier. Half-Life in 2041, da haben wir schon jede Menge Runs jetzt geguckt. Da kennen wir uns jetzt aus. Was tun Hacker eigentlich? Das haben wir auch schon geguckt, glaube ich. Das haben wir, glaube ich, schon geguckt. Wie heißt nochmal der Channel, den ich immer gucke? Hier, das da, Barbecue Pit Boys, die gucke ich immer. Oh yeah, das ist immer die gleichen Sounds. Was Dick? Nee, Dickens. Crispy Pork Belly. Kennst du das Interview mit dem BND Hacker? Nee. BND Hacker Interview, nee, das kenne ich nicht. Was? Hacker beim Geheimdienst im Interview. Das, das, ich glaube, das tut weh. Ach nee, oder? Genug ge-Cringe heute schon. Warum gibt es da eigentlich mehrere, mehrere Videos? Der Schlaumacher, geniale Fakten, Tipps und Lifehacks. Was ein scheiß Channelname, Alter. Eigentlich ist das der exakt der heutigen Zeit angemessene Big Brain Channelname, ja. Aber ich finde das übelst fail, der Schlaumacher. Eigentlich warte ich ja nur auf mein Essen, ne? Eigentlich warte ich nur bis mein Essen kommt. Ich dachte eigentlich, wir brauchen länger hierfür. Sonst hätte ich nämlich schon auf 13 Uhr bestellt, anstatt 13.15. Jetzt gucken wir uns am Sonntag an. Der Leberkiss Typ ist Wiener. Die Videos sind schon allein, deswegen, er macht ein Burger für 1 Euro. Kann ein Burger für 1 Euro machen, der was taugt? Was hältst du vom Pinephone? Hatten wir uns irgendwann mal angeguckt, hat mich jetzt nicht so wahnsinnig geschockt. Falls das das war, was wir uns mal angeschaut haben. Ja, nö, nö, hat mich überhaupt nicht geschockt. Da kommt auch nichts Gescheites bei rum, ganz ehrlich. Da kommt nichts Gescheites bei rum. Der Zug bei Smartphones ist erstmal abgefahren mit IOS und Android. Wenn da jetzt nicht irgendwie einer auf die wahnsinnige Massive Brain Idee kommt, wo vorher noch keiner gekommen ist, wird sich da nichts anderes in nächster Zeit etablieren. Guck mal, ich meine sogar Windows Phone ist abgeschissen und es ist nicht so, als hätte Microsoft zu wenig Geld. Übrigens, dem ganzen Windows Phone Gedöns haben wir mit zu verdanken, dass es diesen ganzen UWP Crap überhaupt gibt. Wo ich gerade deinen PP-Gabot sehe, bis zu Fitment Next lauten, könntest du mir bei folgendem Problem helfen. Was, könntest du mir bei folgendem Problem lesen? Ich will auf 18.06 updaten, aber es kommt nur Step 3. Nee, keine Ahnung. Ich müsste mein Next Cloud auch mal upgraden. Nee, keine Ahnung. Next Cloud buggt aber ganz gerne mal rum, deswegen finde ich es mittlerweile ganz gut, das im Container laufen zu lassen. Da kann man nämlich recht einfach downgraden, wenn man sich das Verzeichnis vorher kopiert, also ohne die Daten drin. Tjo. Leute, ich kann nix mehr, was ich großartig machen kann im Stream. Warum ist RTL eigentlich so schlecht? Ist mir egal, ich guck's einfach nicht, das ist das Schlimmste, was man für sie machen kann. Das beschissenste für generell alle, die irgendwie relevant sein wollen, ist, sich nicht darüber zu wundern, warum sie so schlecht sind, sondern einfach nicht mehr zu gucken. Das ist das Schlimmste, was denen passieren kann. Wenn dir einfach keiner mehr guckt, ist vorbei. Smashed Burger. Okay, das gucken wir uns jetzt noch an. Natürlich kann ich an drei... Natürlich, ja. Da hörst du gleich, dass es Wiener ist. Natürlich kann ich einen dreifingerdicken, medium gebratenen Pappstyle Burger Patty mit handgepflückten San Marzano Flaschentomaten am Roggen, Sauerteig Burger Bun, Trüffeleioli und Käse von serbischen Bergeiseln machen. Exzellent. Moment, das ist gar nicht so schlecht, das schreib ich mir auf. Bergeiseln. Der Burger ist viel zu klein. Wenn man das mal mit den BBQ Pit Boys Burger vergleicht, der muss mindestens fünfmal so groß sein. Der darf gerade so in die Pfanne passen, dann ist es die richtige Größe. Und auch nicht so dünn sein, sondern der muss schon so 15 cm hoch sein. Also, richtiger Kokona Burger sieht anders aus. Aber wahrscheinlich schmeckt der hier besser. Die fülle andere fantastische und vor allem charakterstärke Gerichte. Charakterstarke Burger, das ist mal ein Wort. Ich hab Hunger, wo bleibt mein Essen? Epic Mealtime, klar, die kenn ich noch. Ich weiß, dass es da wieder jetzt Videos gibt, aber das ist nicht mehr das, wie es mal, also früher hat mir das besser gefallen. Epic Mealtime, das waren die Bacon Strips Leute. Bacon Strips, Bacon Strips, Bacon Strips. Ja, die machen wieder was, aber das ist nicht mal so doller. Bacon Strips, Bacon Strips. Das war auch mit Muscle Classes, der Typ, der mit der Sonnenbrille und den Muckis. Bacon Strips, Bacon Strips. Das war so in der Zeit relevant, wo man auch Quickscope Montages geguckt hat. Damit ihr jetzt nicht nur seht, wie Fleisch in einer Pfanne zerdrückt, gibt es zusätzlich noch das Rezept für die Potato Buns. Also für die Kartoffelbrötchen, die ein wichtiger Teil im Smash Burger, aber fast in keinem Rezept zu finden sind. Derzeit verschwende ich gerade kostbaren Strom und meine eigene Zeit dafür Kartoffeln zu kochen, was ziemlich dumm ist. Normalerweise verwendet man dafür übergebliebenes Kartoffelpüree oder gekochte Kartoffeln vom Vortag. Ja, dafür kann ich ein Video von machen. Da man ja schon mittlerweile weiß, dass mein Erzfeind die Waage ist, gibt es da eine Variante, wie man es ohne machen kann. Leicht zu merken, auf einen Teil Kartoffel kommt ein Teil Mehl. Also ich brauch die Angaben ehrlich gesagt in ounces. Ich brauch NA Einheiten, sonst kann ich keine Burger machen. In ounces und feet und sowas brauche ich das. Fuss. Burger nur echt mit Kokonaeinheit. So kriegt es ja ohne Messen einen super schönen Kartoffelteig zusammen. Ich nehme da jetzt noch einen Esslöffel Salz und zwei Esslöffel Zucker. Ounces, ounces, bitteschön. Was ist eigentlich das Ami-Äquivalent zu Teelöffel? Das ist ja schon eine ziemlich bescheuerte Einheit. Haben die auch sowas? Tablespoon sagen die, oder? Nee, Tablespoon ist Esslöffel. Was ist denn Teelöffel? Teaspoon? Sagen die Teaspoon? Echt? Habe ich noch nie gehört. Wahrscheinlich weil ich nur Ami-Kochvideos gucke, die irgendwie alles unter 5 Kilo Fleisch nichts machen. Klar. Nach circa 7 Minuten ist der Teig dann so weit, dass ich zum letzten Schritt kommen kann. Und zwar zwei Esslöffel zimmerwarmer Butter. Die mixen wir dann noch ganz langsam in den Teig hinein und dann ist er auch schon fertig. Stellt ihn abgedeckt an einem warmen Ort, bis er doppelt so groß ist. Die Gehzeit variiert stark. Bei mir hat es eineinhalb Stunden gedauert. Lasst ihr ihm die Luft aus und bringt ihn zu einem Backblech mit einem Backpapier drauf. Nehmt euch die Zeit und formt jetzt so viele Teigkügelchen, wie sie aus der Menge Teig, die ihr gemacht habt, ausgehen. Ja Rico, habe ich auch schon mal geguckt. Was schauen wir da? Smashed Burger. Shake Shack Style. Alles klar. Und eigentlich warte ich nur drauf, bis mein Döner Teller kommt. Wir brauchen jetzt noch ein verquältes Ei, das wir dann auf unsere Burgerbrötchen draufpinseln. Und dann geht es bei 150°C für 30 Minuten in den Ofen. Anschluss noch für Geschmack und Glanz mit Butter bestreichen. Das könnte man auch so essen, oder? Das sieht auch so nicht schlecht aus. Weißt du, warum es sich auszahlt, Burgerbrot selber zu machen? Und jetzt kommt das beste Equipment für Smashed Burger, eine Maurerkelle. Ehrlich, für 8€ der beste Fahnenländer, den man sich holen kann. Wir müssen aber auch noch kurz über das Fleisch reden. Ich würde jetzt keine großen Diskussionen entfachen, aber mir ist es auch wichtig, dass wir gutes Fleisch für unsere Burger verwenden. Weil ich glaube ich muss niemandem erklären, dass in einem Burger der Burger echt wichtig ist. Was viele nicht wissen, ist das bei uns in den Supermärkten unter dem Namen Koch und Siedelfleisch viele verschiedene Teile verkauft werden. Unter anderem gehört da die Rinderbrust dazu. Ich hab noch nie was gesehen im Supermarkt, Koch und Siedelfleisch. Aber ich bin ja auch zu Koch-Noob dafür wahrscheinlich. Also das Brisket, wie man in Amerika sagt, die ausgelöste Zwerchrippe oder auch Boneless Short Rib und auch hin und wieder als Gulaschmeischen. Die ausgelöste Zwerchrippe, meine Güte, es gibt aber hier die wirklich Big Brain Bezeichnung. Für mich ist das Hackfleisch, für mich ist das Hackfleisch. Der zum amerikanischen Chuck Cut dazugehört und der wird von den meisten Burger Restaurants für Smash Burger verwendet. Also geht es zum Fleischer oder zum Supermarkt eures Vertrauens mit Fleischtheke. Fragt ob es gerade Rinderholz da haben, wenn ja, sie sollen den euch bitte verschieben. So, aber jetzt zahlen wir mal unsere Fleischkügelchen. Wir brauchen nur mal an Seiten gesalzen und spart es nicht mit dem Salz. Warnlich Salz. Das ist jetzt der richtige Zeitpunkt dafür. Wir brauchen eine Pfanne, die wirklich hohe Hitze aushält. Das da links unten ist nämlich kein Fünfer, das ist ein Neiner. Das heißt wir sind auf der höchsten Stufe, die Maillardplatten hergibt. Ich bevorzuge Guseisen, aber wenn ihr eine entsprechende andere Pfanne aus Edelstahl oder vielleicht sogar emellierte oder beschichtete habt, ist natürlich kein Problem die zu verwenden. Um den Strom den ich vorher verbraucht habe, wieder einer zum holen, nutze ich die Wärme, die die Pfanne zeigt während dem Hochheizen zum toasten meiner Burger Buns. Legt euer Fleischkügelchen in die brennhause Pfanne mit der schon gewürzten Seite nach unten und druckt es mit aller Kraft flach. Zur Erleichterung und damit es schön gleichmäßig ist, habe ich mir zur Höfe ein Messergriff genommen. Maurer Keller. Anschließend dürft ihr die andere Seite würzen und nach ca. eineinhalb Minuten Bratzeit ist es dann soweit. Wir nehmen die Kelle her und kratzen den Burger vom Boden runter. Man glaubt, dass der Burger durch smashen an Flüssigkeit verliert, das stimmt aber nicht. Er gewinnt was und zwar unglaublich gleichmäßige und geile Kruste. Die andere Seite presst man dann auch noch leicht an und noch weiteren ca. 1-2 Minuten ist er fertig. Gleich drauf können wir das zweite Fleischlauwe machen. Einfach wieder mit Fulstergewürz draufdrucken. Das Fleisch was? Das Fleischlauwe? Okay das ist jetzt irgendwie österreichische Bezeichnung, keine Ahnung was das ist. Und dann auf der anderen Seite würzen. Nach eineinhalb Minuten umdrehen. Und was ich vorher nicht gesagt habe ist, jetzt ist es soweit, man kann da den Käse drauf tun. Bevorzugt wird fürs mash Burger, amerikanischer Schabletten Käse, aber das bringe ich als Ehrenkoch leider nicht übers Herz, deswegen benutze ich da normalen Cheddar. Und meine sehr verehrten Damen und Herren, alle Notwendigkeiten für einen perfekten smash Burger sind vorhanden. Jetzt brauche ich nur mehr den Burger so zusammenstellen, wie es mir gefällt. Wer jetzt wegen den Zwivren schimpft, ich habe mich an Shake Shack gehalten und das Ganze mal ohne Zwirrguck. Sieht doch gut aus. Aber man könnte es einfach auch sein lassen mit dem Brötchen selbst machen und fertige Brötchen nehmen, weil dann ist das einzige was man machen muss, das Hackfleisch braten. Kann man machen. Okay. Sieht aber echt gut aus. Ja, exzellent. Ja, also wenn es Barbecue Pit Boys wären, da muss da deutlich mehr Bacon und Beef hin und mehr Butter. Unbedingt mehr Butter, das war viel zu wenig Butter. Also unter der unter der Packung Butter pro Gericht geht bei denen ja nichts. Okay, wir gucken jetzt eine Runde noch, bis mein Essen da ist. Bis mein Döner Teller am Start ist, gucken wir jetzt noch eine Runde hier. Was haben die denn Neues? Jetzt gucken wir das Kontrast Programm. Bacon, Baked Potato Dogs. Pork Belly. Alles laten Sie hier in Str갑. Und das ist die Ecke, die Joo Zapf, das leakage Cocktail. Ich fange auf zu sagen, ja, das kann jetzt nicht funktionieren. Eine riesige Brötchen sost Kickstarter-M silicone, die very well zabaut hat. Catch it! Okay. Die können ihre videos echt mit so einem voiceboard eigentlich komplett vertonen Wo ist die machete Da fehlt die machete die müssen alles mit der machete schneiden. Wo ist die machete hin And of course you're gonna need your favorite seasoning or wrong All right, let's show you how this is done. Now the You want to score the skin we're doing this because we want to get it real crispy and this is a necessary part of getting this skin nice and crispy, right, right Right, see that you're going pretty much through the entire skin Also, man könnte da auch noch durch schießen oder so dann wird es wird wird bestimmt auch gut funktionieren Ja gut, der verteilt der verteilt Okay, this helps dry out that porkbelly skin and allows it to get crispy Just the way she likes it now here's the magic get your favorite hard apple cider Get yourself a dentist syringe or needle. All right. Oh, was ist auch rei wieder? Und inject ane geht geht geht geht doch nicht doch nicht sah mir aus Und du it several times or until You can't take the pain any longer Now by doing this you're gonna add plenty of moisture into the meat so when you do the cook It stays nice und Der saut immer dabei Just do it again All right Injected Now grab your favorite rub Kiri, wir benutzen unsere originelle Barbecue-Rübe. Nimm dein Lieblingsgerät, wie ich gesagt habe. Und drücke es tief rein. Wieder. Nur so, wie sie mag. Das riecht ein bisschen wie ein Geschmack. Jetzt, wenn du noch nie einen harten Apelsider-Porkbelly gehabt hast, musst du es definitiv aussehen. Jetzt, wir werden ein bisschen mehr Öl dazu geben. Ah, noch ein bisschen mehr Öl. So, ist das richtig. Ich glaube schon, dass das Bier ist. Oder sowas in der Richtung. Das wird wahrscheinlich sowas wie Bier sein. Ich habe keine Ahnung, was Dickens Cider ist. Ah, Gemüse. Was ist da los? Ach, das ist Apfelwein. Okay, sowas haben die auch. Ich dachte, das haben wir nur in Hessen. Moment, was ist mit denen los? So viel Grünzeug. Das geht aber nicht. Ah, okay. Jetzt vielleicht. Ach, der legt das da jetzt rein. Muss der die andere Seite nicht auch noch würzen? Oder das Zeug drauf machen? In Hessen ist es Apfelwein, ja. Oh, das sieht gut aus. Das sieht, oh, das sieht gut aus. Das sieht gut aus. Oh, das sieht gut aus. Das sieht, oh, das sieht richtig gut aus. Also, die Kruste sieht wirklich gut aus. So, und wo sind die Karotten? Genau. Angator, nee, das muss nicht sein. Zu fettig, nein, da darf man sich bei denen echt nicht beschweren. Für die, für die war das noch wenig, noch wenig fett. So Leute, mein Essen müsste jetzt jede Minute kommen. Ich habe auf 13.15 bestellt. Es ist jetzt 13.05. Hat der einen Patreon? Vor allem nicht, ob der einen Patreon hat. Aber der hat mit Sicherheit genug Aufrufe. Dass der keinen Patreon braucht. Auch tatsächlich, die haben einen Patreon. Nee, Moment. Nee, haben sie nicht. Brauchen sie auch nicht. Wozu? Ja, massig Aufrufe. So baut man einen PC. Okay, PC-Welle, das gibt es. Wobei, das ist kein Cringe-Video. Die wissen wahrscheinlich wirklich, wie es geht. Das Verge-Video, kann sich da noch einer dran erinnern? Kennt das noch einer? Kennt das noch einer? Den Anfang, wir müssen den Anfang nochmal gucken. Der Anfang ist zu geil. Also meine Lieblingsstelle, meine Lieblingsstelle ist das mit dem Anti-Static-Band. Das Anti-Static-Band ist das beste. Jetzt. Das Anti-Static-Band, einfach nur ein Gummi um das Handgelenk gemacht. Also normalerweise gibt es Anti-Static-Armbänder. Aber die musst du irgendwo erden, die musst du irgendwo anschließen. Das Einzige, was der gemacht hat, ist ein Gummi-Band um den Arm. Das kann sich jetzt irgendwas bringen. Der kann sich genauso gut Aluhut aufsetzen. Das bringt genauso wenig. Wahrscheinlich bringt der Aluhut noch mehr. Das ist das beste hier. Ich könnte mich da immer wegschmeißen. Ach ja und übrigens, die CPU baut man auch als letztes ein. Kennst du das Electro-Boom-Video zu kabellosen Anti-Static-Armbändern? Nö. Hat der ein neues? Das Video war so geil. So ein Fail-Video habe ich lange nicht mal gesehen. Was sind bei deine zwei Sens zur PS5 gestern? Ja, um es zusammenzufassen, so. War ein paar gute Sachen dabei. Der größte Teil war jetzt eher zum Einschlafen. Kein Stresskochen-Leberkäs. Ich habe Hunger. Ich mache mal kurz die Kamera auf dem zweiten Bildschirm auf, dass ich sehe, wenn da einer vor dem Haus anrückt. Keiner zu sehen. Keiner zu sehen vor dem Haus bemessen. Aber wie gesagt, ich habe auch auf 1315 bestellt. Also die müssten jetzt demnächst mal hier anrücken. Adresse liegt. Das ist alles immer liegt. Hast du eigentlich Achtung Video-Überwachung im Hauseingang? Natürlich, natürlich. Datum korrekt. Ein Anlager kann Datum einstellen. Ich habe Hunger. Ich muss was essen Leute. Burger für einen Euro, das gucken wir jetzt noch schnell. Wenn das Essen in der Zwischenzeit kommt, dann mache ich aus. Etwas, was mir schon länger am Herzen liegt. Und zwar hat sich ein sehr weißer Mann namens Pommesman die Frage gestellt, ob man einen Euro-Burger selber besser machen kann. Natürlich kann man ihn besser machen, ja, also klar. Aber die Frage ist, ob man diesen Burger besser machen kann, wenn man als Budget auch nur einen Euro hat. Und da wird es jetzt für mich sehr interessant. Die einen Euro-Burger von McDonalds, gerade der Cheeseburger, das ist voll abartig. Ich kann es überhaupt nicht mehr essen. Keine Sorge, ich möchte mich nicht mit dem Meister messen. Aber was wäre, wenn man wirklich alles selber machen würde und zusätzlich frisches Faschiertes verwendet, würde man dann auch unter einem Euro bleiben? Und genau das werde ich heute probieren. Für die Rezension des Konkurrenzprodukts. Cheeseburger kostet jetzt 1,20, keine Ahnung. Aber früher hat er 1 Euro gekostet und es war eklig. Was? Oh Gott! Wie viele Abos hat der hier? 31, der hätte schon, der verdient schon mehr. Der macht doch gute Videos. Sogar Megaman Musik am Start. Heute brauchen wir Strom nur in der Küche. Wir wollen ja mit der Stromrechnung unter einem Euro bleiben. Ach, die Stromrechnung zählt auch noch dazu. Okay, jetzt übertreibt er es aber. Mit einem halben Packerl Mehl, einen Esslöffel Salz, zwei Esslöffel Zucker, einen Packerl Hefe, 250 Milliliter Glas Wasser, weil Milch können wir uns nicht leisten, zwei Esslöffel Butter und einem Ei, lässt sich ein sehr schneller Burger-Dag herstellen. Knetet es den Sohler, bis er sich von den Seiten löst und nicht mehr klebt. Und seht, dafür braucht man keine Küchenmaschine. Mann, das hat sie jetzt gehört. Geh mal raus, du weißt ja, dass du mein absoluter Liebling bist. Nein, nein, nein, die habe ich viel lieber. Auf jeden Fall muss der Teig jetzt gehen, bis er doppelt so groß ist. Wenn das passiert ist, können wir die Luft aus ihm raus lassen und daraus klare Kugeln für die Burger Buns formen. Wichtig ist, damit es mit der Rechnung ausgeht, dass die Kugeln ein Gewicht von genau 80 Gramm haben. Druckt das dann zu flachen Scheiben, lasst das dann so lange rosten, bis sie noch ein Stückchen aufgehen, so ca. dreiviertel Stunde. Wenn sie so ausschauen, passt es. Trennt ihr das Eigelb vom Eiweiß, wir werden beides noch brauchen. Kann man überhaupt einzelne Eier kaufen? Und damit bestreichen wir unsere Burger Buns. Und die stellen wir nachher bei 180°C für ca. 15 Minuten in den Ofen. Fertig gebacken, kann man noch ein bisschen Butter drauf tun für den Glanz. Dann lasst das abkühlen. Und jetzt kommt die erste von vielen sehr anstrengenden Kalkulationen. Also Mehl und Ei machen insgesamt 50 Cent aus. 35 Gramm von der Butter, wobei 5 Gramm von den 35 für das Bestreichen am Schluss sind, sind 17 Cent. 1 Esslöffel Salz sind ca. 0,6 Cent und 2 Esslöffel Zucker 1,4 Cent. Macht insgesamt 2 Cent. Ich glaube es ist kein Auto vor dem Haus gehalten. Ich muss mal kurz rausgucken Leute. Das heißt 8 Cent für einen Burger. Ne, nichts zu sehen. Was auf einen Burger nicht fehlen darf, sind Essiggurken. Und die lassen sich super leicht selber machen. 150 Gramm Gurken, Größe egal, mit einem halben Esslöffel Salz und einem Esslöffel Zucker. Am besten in und nicht neben ein Glas geben. Dann noch mal ein bisschen durchschütteln und wenn alles gut verteilt ist, noch 5-6 Esslöffel von eurem Lieblingsessig dazu geben. Ich nehme da jetzt einen neutralen Essig, weil ich den fürs Einlegen am liebsten habe. Während der nächsten Schritten, schüttelt ihr euer Glas immer wieder mal, damit die Flüssigkeit aus den Gurken rauskommt. Bringt 150 Milliliter Wasser leicht zum Köcheln. Schütteln nicht vergessen. Lieblingsessig. Ich bin froh, wenn ich Essig habe. Ich habe keinen Lieblingsessig. Die Flüssigkeit könnt ihr würzen wie ihr wollt. Ich nehme dazu Senfsaat, Oreandersamen und ein bisschen an schwarzem Pfeffer. Ah ja, schütteln nicht vergessen. Wenn das 5-10 Minuten drinnen zirgen hat können, braucht ihr das Ganze nur nicht zu euren Gurken dazuschieben und geschlossen im Kühlschrank nachzirgen lassen. Am besten schmeckt es, wenn man es mal über die Nacht stehen lässt. Ist aber nicht notwendig. So schaut es übrigens aus, wenn man normale Gurken dafür verwendet und ein bisschen roten Zwiebel dazu reintun. Aha. Die Rechnerei wird nicht lustiger. So, da haben wir dann 1 Euro für die Gurken. 4 Cent für 60 Gramm. So, genau jetzt müssen wir an Essen kommen. 30 Zuckers sind 0,01 Cent. Für die Einlegerwürze haben wir 30 Cent. Macht für ein bisschen über 250 Gramm. 1,36 Euro. Nachts ausschütteln, na klar, immer, immer, immer. 3 Gurken brauchen, die kosten ca. 1 bis 1,5 Cent. Und die runden wir auf auf 2 Cent pro Burger. 2 Cent. Wir Sporfüchse haben ja noch ein Eigelb über vom Burgerbrot Rezept. Und das werden wir jetzt zu einer frischen Mayonnaise aufschlagen. Am besten geht es mit einem Schneebesen. Bevor man die ersten Tropfen Öl reingibt, sollte das Eigelb schaumig sein. Unter ständigem Rühren kommt dann das Öl ganz, ganz langsam dazu. Die ersten 50 Milliliter sind da der kritischste Teil. Sobald die Emulsion, also die Verbindung zwischen dem Öl und dem Eigelb steht, kann ich dann schon mit größerem Schluck Öl weitermachen. Schmeckt das Ganze dann mit einem Schuss Essig oder Zitronensaft und ein bisschen am Salz ab und die Sache ist erledigt. Selbst machte Mayonnaise ist schon geil. Aber selbst macht das Ketchup übertrifft es noch. Für super schnelles selbstgemachtes Ketchup. Okay, man kann es auch übertreiben. Man muss doch nicht alles selber machen. Ketchup gibt 4 Esslöffel Tomatenmark in einen Topf. Mit 6 Esslöffel von eurem Lieblingsessig, 6 Esslöffel Wasser, 2 Esslöffel Zucker. Chat, was ist denn euer Lieblingsessig so? Ich finde das geil, das wird so gesagt, als wüsste jeder so, ja klar, mein Lieblingsessig, alles klar. Und am guten halben bis an ganzen Esslöffel Salz. Und das absolut wichtigste ist auch Gewürznelke. Bis zu 400 Gramm Tomatenmark ist es immer auch Gewürznelke. Es variiert nur immer die Zeit. Man könnte sich die Tomaten im Garten auch erst selbst wachsen lassen. Dann gehen wir es nach 2 Minuten mit kochen wieder raus. Wenn ihr die Konsistenz noch on point haben wollt, dann mischt es einen halben Esslöffel Wasser und einen halben Esslöffel Stärke zusammen und gebt es dann zum Ganzen dazu. Damit dickt sich das Ganze ein bisschen ein. Extra Fleißpunkte gibt es dann noch, wenn ihr das Ganze durch ein feines Sieb durchpassiert. Das ist nicht notwendig, aber wenn du wie ich das Bedürfnis hast, unnötige Bilder von Ketchup auf Instagram zu stellen, dann solltest du das machen. Natürlich darf es Salat, Tomate und Zwiebel auch nicht fehlen. Oh es ist kaputt Leute, es ist kaputt, es ist kaputt. Schneide die Tomaten und die Zwiebel in ganz feine Scheiben. Ah ja genau, irgendwer muss ja das Ganze jetzt zusammenrechnen auch noch. Warum tue ich mir das an? Also beginnen wir mit der Mayonnaise. Ein Ei, 250 Milliliter Öl plus einen Spritzer Essig und eine Prise Salz. Dem Tomatenmark fürs Ketchup. Salz und Zucker, was so um die 2 Cent ausmacht. Apfelessig für aufgerundete 5 Cent. Und das ganze Zubehör wie Tomate, Zwiebel und Salat. Macht insgesamt 1,27 Euro, das heißt aufgerundet 13 Cent pro Burger. Bei mir im Supermarkt war Gulaschfleisch im Angebot. Das Gulaschfleisch ist entweder aus dem Hals oder aus der Wade. Rinderhals ist perfekt für Burger Patties. Ah, ich bin wieder da. Aber ich gehe jetzt weg. Das gucken wir noch schnell fertig. Ich will gucken wie der Burger aussieht. What? Ich will wissen wie der Burger aussieht. Oh, Big Brain Tool. Hat er den Preis von diesem Ding auch einberechnet? Das ist exzellent Produkt placement. Den Link zu dem Ding findet ihr natürlich in der Beschreibung. Anomaler Hamburger wiegt so um die 90 Gramm und unser Patty wiegt ja schon 100. Schauen wir mal was unser Gerät so auf die Waag bringt. Das kann sich sehen lassen. So und jetzt noch das letzte Mal rechnen. Also nochmal alles zusammen. 79 Cent für die Burger Brötchen, 6,99 Euro für die Patties. Das Zubehör, also der ganze Belag, belauft sich auf 1,50 Euro. 27 Cent für den Strom, über mal aufgerundet, macht insgesamt 9,48 Euro. 10 Portionen. Knapp 95 Cent pro Burger. Mit den letzten 5 Cent macht es was Witz, weil ich habe fix was vergessen. Ja, nicht schlecht. Sieht gut aus. Poggers Burger. Leute, ich gehe jetzt meinen Döner Teller essen. Wir sehen uns. Bis dann, macht's gut. See you.", "segments": [{"id": 1, "start": 30.0, "end": 55.0, "text": "G & P"}, {"id": 2, "start": 55.0, "end": 56.54, "text": "Faust!"}, {"id": 3, "start": 85.0, "end": 90.0, "text": "Alle Zutaten inklusive Mengenangaben sind in der Infobox aufgelistet."}, {"id": 4, "start": 145.0, "end": 155.72, "text": "So Leute, ich bin wieder da. War ja nicht lang, ne? Wann sind wir gestern aufgegangen?"}, {"id": 5, "start": 155.72, "end": 164.08, "text": "Zeig mal her. Achja, ich flame jetzt nicht über das neue Twitch-Layout, wo keiner durchblickt."}, {"id": 6, "start": 164.08, "end": 178.48, "text": "Vor 15 Stunden? Also, vor 12 Stunden sind wir aufgegangen, sind wir schon wieder da."}, {"id": 7, "start": 178.48, "end": 180.08, "text": "Schau mal, die Musik ist ein bisschen leiser."}, {"id": 8, "start": 180.08, "end": 205.8, "text": "Quinn hat subscribt. Excellent. Für zwei Monate. Huge. Wie war das PS3-Event? Na ja. Also, ja."}, {"id": 9, "start": 205.8, "end": 212.52, "text": "So der Riesenknaller hat mir gefehlt. Die PS3, äh, die PS4, äh, die PS, ich habe das bald,"}, {"id": 10, "start": 212.52, "end": 219.08, "text": "die Benamung. Excellent Naming. Ähm, die PS5 sieht ein bisschen aus wie eine Fritzbox in schwarz-weiß."}, {"id": 11, "start": 219.08, "end": 231.84, "text": "Aber ansonsten, es hielt sich in Grenzen. Chet, Chet ist ein paar Mal ausgeflippt bei,"}, {"id": 12, "start": 231.84, "end": 240.16, "text": "was war es denn? Dem neuen Hitman-Game. Horizon Zero Dawn 2. Ich fand ja Sackboy Adventures am"}, {"id": 13, "start": 240.16, "end": 248.24, "text": "besten. Äh, Demon's Souls Remake. Ich glaube, das war's, oder? So im Großen und Ganzen."}, {"id": 14, "start": 248.24, "end": 257.48, "text": "Oh, jetzt, jetzt die Frage der Fragen, habe ich noch genug Festplattenblatt heute? Ja, habe ich."}, {"id": 15, "start": 257.48, "end": 265.4, "text": "Da falle ich nicht mehr drauf rein, Chet. Da falle ich nicht mehr drauf rein."}, {"id": 16, "start": 278.0, "end": 280.6, "text": "Wir müssen jetzt erstmal abwarten, bis der Download fertig ist, aber zwei Minuten."}, {"id": 17, "start": 280.6, "end": 288.8, "text": "Wisst ihr, was witzig ist? Dass es ein Open Source Projekt schafft, besseren Download anzubieten als"}, {"id": 18, "start": 288.8, "end": 293.04, "text": "Blizzard. Okay, da vergleiche ich es ein bisschen unfair. Die lassen es auch auf GitHub posten und"}, {"id": 19, "start": 293.04, "end": 298.6, "text": "sie werden garantiert nicht so oft runtergeladen wie Warzone. Aber gestern haben sie es ja echt"}, {"id": 20, "start": 298.6, "end": 305.76, "text": "wieder geschafft, ne? Gestern haben sie es ja echt wieder geschafft. Das war, wenn du Warzone in"}, {"id": 21, "start": 305.76, "end": 312.64, "text": "Europa runtergeladen hast nach acht Uhr, ganze 66 Bites pro Sekunde. Heute frei, ja? Ja, heute ist"}, {"id": 22, "start": 312.64, "end": 321.24, "text": "frei. Vielleicht ist heute ja auch Homeoffice und ich bin trotzdem on. Ne, heute ist frei. Heute habe"}, {"id": 23, "start": 321.24, "end": 330.0, "text": "ich Urlaub. Ich wurde aber heute morgen um acht Uhr schon angerufen. Weil irgendjemand vergessen hat,"}, {"id": 24, "start": 330.0, "end": 346.04, "text": "dass ich Urlaub habe. Und danach kam raus, er wollte gar nicht mich anrufen, sondern hat"}, {"id": 25, "start": 346.04, "end": 361.84, "text": "irgendeinen Gruppenanruf gemacht. Er wollte noch nicht mal zu mir. Ja, dann machst du nichts, ne?"}, {"id": 26, "start": 377.04, "end": 384.44, "text": "Oh, Download fertig. Exzellent. Er hat die Musik, ist Big Brain Musik. Brauchen wir heute."}, {"id": 27, "start": 384.44, "end": 410.76, "text": "Kann sich mit der Lautstärke nicht erscheinen. Den PS5 Stream können wir glaube ich ausmachen,"}, {"id": 28, "start": 410.76, "end": 423.16, "text": "oder ihr wollt ihn noch mal gucken. So, also, auf die Idee bin ich nicht gekommen. Das hat"}, {"id": 29, "start": 423.16, "end": 430.64, "text": "der Patrick ausgebuddelt. Wusste ich gar nicht, dass es existiert. Und zwar ist das ein vorkonfigurierter"}, {"id": 30, "start": 430.64, "end": 437.56, "text": "i3 plus GNOME Desktop. Also quasi, es ist GNOME mit i3 als Oberfläche, die gestartet wird als"}, {"id": 31, "start": 437.56, "end": 449.08, "text": "erstes. Auf einem Ubuntu 20.04. Ich erzähle kein NVIDIA 3, ich erzähle es eher vor allem. Und das"}, {"id": 32, "start": 449.08, "end": 454.68, "text": "ist eine der wenigen Distributionen, die tatsächlich mit einem vorkonfigurierten i3 ankommt. Dies"}, {"id": 33, "start": 454.68, "end": 459.44, "text": "aber wohl auch anscheinend ernst meinen, so dass man sogar einen Guide hat, was Keybindings angeht"}, {"id": 34, "start": 459.44, "end": 464.6, "text": "und sowas. Da bin ich wirklich mal gespannt. Geheimtipp den selbst die Entwickler nicht kennen. Ja,"}, {"id": 35, "start": 464.6, "end": 474.32, "text": "das ist so wie Microsoft irgendwelche Registry Hacks nicht kennt. Ja, und so schaut's aus. Müssen"}, {"id": 36, "start": 474.32, "end": 487.32, "text": "wir mal angucken. Ich meine, ich glaube nicht, dass es ein Manjaro mit i3 rankommt. Beste. Zumal"}, {"id": 37, "start": 487.32, "end": 492.16, "text": "Manjaro auch noch andere Vorteile hat auf dem Desktop gegenüber Ubuntu. Einfach, wenn man"}, {"id": 38, "start": 492.16, "end": 499.44, "text": "aktuelle Software haben will, ist es natürlich viel besser. Muss ich mal das Pepega-Bot neu starten."}, {"id": 39, "start": 499.44, "end": 524.16, "text": "Was denn? Okay, also im Prinzip ist davon nichts eingetreten, ein bisschen. Außer das da,"}, {"id": 40, "start": 524.16, "end": 535.08, "text": "wie in einem Sportspiel. Der Rest cringe hat man auch ein bisschen, aber ansonsten war gestern nicht"}, {"id": 41, "start": 535.08, "end": 553.56, "text": "so viel. Mein Frontend ist ein bisschen verbackt. Das schreibt so Sachen hier irgendwie doppelten."}, {"id": 42, "start": 553.56, "end": 571.0, "text": "Aber Refreshen. Oh, das ist schlecht. Das ist schlecht, wenn die Festplatte nicht mehr gemountet"}, {"id": 43, "start": 571.0, "end": 600.76, "text": "wird. Ja, mache ich. So, erstmal aufräumen hier. Also, tja, warum hat Windows jetzt das"}, {"id": 44, "start": 600.76, "end": 611.92, "text": "Browser Fenster resized? Kann mir das irgendjemand erklären? Bei Windows Logik wahrscheinlich."}, {"id": 45, "start": 611.92, "end": 624.4, "text": "Ist die Musik zu laut oder passt das so? Geht eh nur noch 5 Minuten. So, wir legen mal eine"}, {"id": 46, "start": 624.4, "end": 631.24, "text": "VM an. Oder wie die coolen Leute sagen, eine VM. Die coolen Leute sagen ja auch nicht VM,"}, {"id": 47, "start": 631.24, "end": 639.56, "text": "sondern VM wäre. VM wäre. Man kann alles besonders geil aussprechen. Aber nichts geht über"}, {"id": 48, "start": 639.56, "end": 665.2, "text": "nichts. Welches Video war das? Corona App. Ich weiß nicht, es gab doch mal irgendwo diesen"}, {"id": 49, "start": 665.2, "end": 674.88, "text": "Beitrag, wo es Jithub ausgesprochen haben. Ja, Patrick oder Ansible Playbook. Ansible"}, {"id": 50, "start": 674.88, "end": 689.28, "text": "Playbook geht auch. War das von der Welt? Ist gar nicht mehr in der Historie drin. Exzellent."}, {"id": 51, "start": 689.28, "end": 702.0, "text": "Okay, also im Moment hatten wir genug Festplattenspeicher. Auf E, ja. 66G reicht. Neue VM. Custom. Ja, das"}, {"id": 52, "start": 702.0, "end": 718.04, "text": "passt alles, passt alles. Next. Linux. Jubuntu. 64. Früher haben sich Leute über die Ausschraube"}, {"id": 53, "start": 718.04, "end": 725.88, "text": "von Multiplayer gestritten. Multiplayer hatten wir immer. Multiplayer. Multiplayer oder Multiplayer?"}, {"id": 54, "start": 725.88, "end": 746.08, "text": "Multiplayer. Was glaube ich sogar richtig ist. Aber beste Aussprache ist immer noch. So,"}, {"id": 55, "start": 746.08, "end": 758.56, "text": "Next. Wir legen es auf E. Auf E wollen wir es anlegen. E. VMs. Neuer Ordner. Unto Tests."}, {"id": 56, "start": 758.56, "end": 769.52, "text": "Wunderbar. Next. Wie viel CPU Kerne? Vier. Bencher braucht das Ding richtig. Power RAM. 4096."}, {"id": 57, "start": 769.52, "end": 781.76, "text": "Bäm. Nut ist okay. Das ist auch okay. Das ist auch okay. New Disk. 40G. Single File. Next. Next. So und das"}, {"id": 58, "start": 781.76, "end": 785.72, "text": "einzige, was ich dann immer mache, ist den Printer raus. Den Printer brauchen wir nämlich beim besten Willen"}, {"id": 59, "start": 785.72, "end": 801.92, "text": "nicht. Ja, E3 geht eigentlich ohne 8G. Nichts. Bin echt mal gespannt, wie das ausschaut. Linux."}, {"id": 60, "start": 801.92, "end": 807.28, "text": "Viel Spaß. Ich frage mich, ob da Michael 50 Billiarden heute irgendwann noch mal vorbeikommt"}, {"id": 61, "start": 807.28, "end": 817.84, "text": "und uns sagt, wie sein Vorstellungsgespräch gelaufen ist. Choose by Name sagt, ich hätte mal eine"}, {"id": 62, "start": 817.84, "end": 824.16, "text": "Frage zu VM mit GPU-Paththrough. Oh, jetzt kommt gleich die Big Brain-Themen gleich am Anfang hier."}, {"id": 63, "start": 824.16, "end": 839.64, "text": "Richtig. Massive Big Brain. Sind solche VMs dann weiterhin ein einfaches Fenster auf dem Host,"}, {"id": 64, "start": 839.64, "end": 846.44, "text": "oder muss man dann den Video-Output der GPU anzapfen? Ja, muss man. Wenn du GPU-Paththrough hast,"}, {"id": 65, "start": 846.44, "end": 852.08, "text": "kannst du nicht so einfach die Grafikausgabe auf dem Host anzeigen lassen. Es gibt das hier."}, {"id": 66, "start": 852.08, "end": 864.76, "text": "Ist das nicht Glas? Nee, wie ist das? GitHub. Das da gibt's. Damit kannst du quasi aus der"}, {"id": 67, "start": 864.76, "end": 869.36, "text": "Grafikkarte, aus dem Grafikrahmen mehr oder weniger die einzelnen Frames rüber kopieren."}, {"id": 68, "start": 869.36, "end": 881.88, "text": "Das ist eigentlich ziemlich Big Brain. Dafür ist das ziemlich gut. Aber wenn man eine Windows"}, {"id": 69, "start": 881.88, "end": 885.84, "text": "VM mit GPU-Paththrough hat, wenn man spielen will, dann würde ich das auch nicht verwenden,"}, {"id": 70, "start": 885.84, "end": 891.0, "text": "sondern würde den eigenen Bildschirm oder den Bildschirm umschalten, je nachdem. Weil"}, {"id": 71, "start": 891.0, "end": 896.32, "text": "wenn man was zum Spielen verwendet, dann macht man das ja gerade, weil man wirklich auf jegliches"}, {"id": 72, "start": 896.32, "end": 923.4, "text": "Input-Lag oder jegliche Sachen... Wenn GIF gleich GIF, dann ist auch GIT gleich JIT. Das mag sein,"}, {"id": 73, "start": 923.4, "end": 929.56, "text": "aber es spricht ja auch keiner, der noch bei Verstand ist. Außer der GIF-Erfinder teilweise"}, {"id": 74, "start": 929.56, "end": 945.68, "text": "selbst. GIF aus. GIF. Zero Moment, ich hoffe mal nicht. PSU-Paththrough. Oh, das wäre mal was."}, {"id": 75, "start": 945.68, "end": 959.84, "text": "Ein Netzteil durchreichen. Je nach Game fällt das nicht ins Gewicht, wäre mir egal. Wenn"}, {"id": 76, "start": 959.84, "end": 964.48, "text": "ich eine VM installiere zum Spiele-Spielen, dann will ich das allerkleinste Input-Lag,"}, {"id": 77, "start": 964.48, "end": 969.36, "text": "was irgendwie geht und da kommt nichts dazwischen. Zumal du mit sicherlich auch Probleme hast,"}, {"id": 78, "start": 969.36, "end": 979.52, "text": "wenn dein Desktop, sagen wir jetzt mal, mit 60 FPS läuft auf einem lechteren Monitor und die"}, {"id": 79, "start": 979.52, "end": 985.36, "text": "Grafikkarte 240 FPS oder 240 Hz in der VM. Da gibt es bestimmt die ein oder anderen Fallstrecke"}, {"id": 80, "start": 985.36, "end": 992.32, "text": "noch. An sich ist es ganz gut zu gebrauchen, auf jeden Fall hier die Geschichte. Aber wer"}, {"id": 81, "start": 992.32, "end": 996.92, "text": "wirklich das allerniedrigste Input-Lag und die beste Kompatibilität haben will,"}, {"id": 82, "start": 996.92, "end": 1005.2, "text": "der spielt am besten gar nicht mit einer VM, sondern einfach mit einer Windows-Gamingkiste."}, {"id": 83, "start": 1005.2, "end": 1012.84, "text": "Ich bin ja mittlerweile darauf angekommen, Windows als Host und Linux als VM. Das ist"}, {"id": 84, "start": 1012.84, "end": 1016.84, "text": "für mich die beste Kombination, aber ich mache auch nichts auf Linux, was irgendwelche"}, {"id": 85, "start": 1016.84, "end": 1024.6, "text": "Hardware Acceleration bräuchte. Und wie ist das da mit anderer Peripherie? Ja, mit der Maus ist"}, {"id": 86, "start": 1024.6, "end": 1030.6, "text": "es genauso. Du brauchst dann auch eine zweite Maus. Du brauchst dann auch eine zweite Maus"}, {"id": 87, "start": 1030.6, "end": 1037.92, "text": "und eine zweite Tastatur. Und natürlich noch eine zweite GPU für den Host, wenn du dann"}, {"id": 88, "start": 1037.92, "end": 1061.04, "text": "auch was sehen willst. Niedliche Input-Lag, genau. Windows auf Hardware, wer geht solche"}, {"id": 89, "start": 1061.04, "end": 1068.2, "text": "Sicherheitsrisiken ein? So schlimm ist das auch nicht, wie da immer alle tun. Zumal,"}, {"id": 90, "start": 1068.2, "end": 1073.12, "text": "wenn man spielen will und auch Multiplayer-Spiele mit Anti-Cheat, kommst du ja an Windows nicht"}, {"id": 91, "start": 1073.12, "end": 1089.24, "text": "vorbei. Da gibt es ja wirklich keine Alternative zu gerade. Ja, was willst du anstelle machen?"}, {"id": 92, "start": 1089.24, "end": 1094.96, "text": "Gerade für Multiplayer-Spiele mit Anti-Cheat gibt es keinerlei Alternative gerade. Neradon,"}, {"id": 93, "start": 1094.96, "end": 1101.92, "text": "11 Monate, Poggers hier. Huge Subscription. Und dann haben wir noch Dattyp auch für 11"}, {"id": 94, "start": 1101.92, "end": 1108.08, "text": "Monate. Jaja, jetzt geht es aber ab. Wie viele Monitore hast du jetzt und merkst du die 240"}, {"id": 95, "start": 1108.08, "end": 1112.8, "text": "Hertz? Ich habe nach wie vor zwei. Ich habe den 144 Hertz durch den 240 Hertz-Monitor"}, {"id": 96, "start": 1112.8, "end": 1117.88, "text": "ausgetauscht, anschaue ich ja schon gezeigt durch das Teil. Merkst du den Unterschied"}, {"id": 97, "start": 1117.88, "end": 1124.6, "text": "zwischen 144 und 240 Hertz? Den reinen Unterschied glaube ich nicht, dass ich den großartig merke."}, {"id": 98, "start": 1124.6, "end": 1129.8, "text": "Was ich merke sind so ein paar Zusatzfeatures, die der Monitor hat. Zum Beispiel dieses,"}, {"id": 99, "start": 1129.8, "end": 1135.96, "text": "dass der seine Hintergrundbeleuchtung an- und ausschaltet und solche Sachen. Das ist schon"}, {"id": 100, "start": 1135.96, "end": 1144.12, "text": "spürbar. Auch dieser Schwarzausgleich, der ist bei weitem nicht so geil wie in dem einen"}, {"id": 101, "start": 1144.12, "end": 1148.32, "text": "Werbevideo, aber es ist nicht verkehrt. Die Features merkt man schon, die der mehr hat"}, {"id": 102, "start": 1148.32, "end": 1153.96, "text": "als der andere. Farben und so ist fast genau exakt das gleiche wie das alte, da war der"}, {"id": 103, "start": 1153.96, "end": 1170.72, "text": "alte schon kacke. Gehen jetzt ab. Ah. Dachte erst, das ist Splatoon Musik, aber dafür"}, {"id": 104, "start": 1170.72, "end": 1189.52, "text": "war es nicht zu Squid genug. So, also wir machen die V-M an. Wo haben wir den Download?"}, {"id": 105, "start": 1189.52, "end": 1212.48, "text": "Ja. Ah ja ja Musik, ja. Ähm, ja also den Unterschied ist jetzt nicht so groß zu spüren."}, {"id": 106, "start": 1212.48, "end": 1226.32, "text": "Stadia, ja. Wie geht's eigentlich Stadia so? Was macht Stadia so gerade? Kann Stadia auf"}, {"id": 107, "start": 1226.32, "end": 1242.84, "text": "jedem Android-Spiel, ui, huge. Stadia juckt nach wie vor keinen, oder? Wenn ich das richtig"}, {"id": 108, "start": 1242.84, "end": 1259.92, "text": "sehe. Gucken wir mal Stadia-Reddit an. Thank you Stadia. Danke, dass ich Geld ausgeben"}, {"id": 109, "start": 1259.92, "end": 1268.92, "text": "durfte. Excellent. Ha, das ist doch, das ist doch einer von Google, oder? Das ist doch"}, {"id": 110, "start": 1268.92, "end": 1274.04, "text": "Google, die selbst Werbung machen. I'm on Stadia.com. Sign up for free, man. I'm playing"}, {"id": 111, "start": 1274.04, "end": 1285.04, "text": "support. Is this real? Instantly, seriously. Ja, ja, ja. Alles klar. Alles klar. Ok, Champ."}, {"id": 112, "start": 1285.04, "end": 1298.32, "text": "Schauen wir mal, wie aktiv das ganze Subreddit ist. 26 Minuten. Also, für den, für den"}, {"id": 113, "start": 1298.32, "end": 1303.56, "text": "neuen heißen Shit ist es jetzt nicht so aktiv, wenn da alle Stunde, alle halbe Stunde mal"}, {"id": 114, "start": 1303.56, "end": 1318.32, "text": "an Post kommt. Aber Stadia juckt halt auch letztendlich wenig, ne? Stadia hat ihre freie"}, {"id": 115, "start": 1318.32, "end": 1322.92, "text": "Freimonat verlängert. Die müssen ja auch irgendwas machen. Nein, jetzt nicht. Die müssen"}, {"id": 116, "start": 1322.92, "end": 1325.48, "text": "ja auch irgendwas machen. Es hat sich auch kein Mensch für Stadia interessiert."}, {"id": 117, "start": 1325.48, "end": 1339.8, "text": "Die Musik heute. Ok, weiter geht's. Ähm, machen wir, schmeißen wir das mal an. CD ist"}, {"id": 118, "start": 1339.8, "end": 1345.88, "text": "drinne. I finished installing. Ja, natürlich haben wir gefinished, alles klar. Auf Englisch."}, {"id": 119, "start": 1345.88, "end": 1358.76, "text": "Ja, das einzige, was wir umstellen, ist die Keymap. Hallo, F3. F3. Ah ja, das ist es gleich."}, {"id": 120, "start": 1358.76, "end": 1370.2, "text": "Ok, Language. Englisch. Keymap. Nicht USA. German. Try without installing. Nein, install."}, {"id": 121, "start": 1370.2, "end": 1383.64, "text": "Englisch drauf. Äh, Patrick, das kenn ich nicht, aber ich kenn was anderes in der Richtung."}, {"id": 122, "start": 1383.64, "end": 1394.16, "text": "Ähm, oh. Hat das jetzt doch funktioniert? Ah, anscheinend. Ok, zwei von uns sinnloser"}, {"id": 123, "start": 1394.16, "end": 1401.52, "text": "Fehler, der doch funktioniert hat. Alles klar. Ähm, das hab ich mit Fabian mal ausprobiert."}, {"id": 124, "start": 1401.52, "end": 1411.08, "text": "Das war richtig gut für Remote-Spielen. Also sprich, zum Beispiel von einem PC, der kalt"}, {"id": 125, "start": 1411.08, "end": 1417.08, "text": "schlechter hat, wer hat, auf einem guten PC spielen. Das war richtig gut. Ähm, und das"}, {"id": 126, "start": 1417.08, "end": 1421.44, "text": "Ganze ist auch kostenlos, wenn man nicht über den Ereserver spielen will. Damals haben wir"}, {"id": 127, "start": 1421.44, "end": 1427.88, "text": "es so gemacht, als wir BDO gespielt haben, hatten wir es so gemacht, dass, ähm, ich"}, {"id": 128, "start": 1427.88, "end": 1435.0, "text": "weiß gar nicht, warum wir das gemacht haben, ehrlich gesagt. Ach ja, ich weiß, warum wir"}, {"id": 129, "start": 1435.0, "end": 1440.04, "text": "das gemacht haben. Wir haben, mit Fabian haben wir doch so Enchanting-Stream gemacht, der"}, {"id": 130, "start": 1440.04, "end": 1444.92, "text": "mein Account quasi upgraded hat. Und dass wir es gleichzeitig sehen, hat er sein Game"}, {"id": 131, "start": 1444.92, "end": 1449.96, "text": "geshared mit Parsec, sodass ich es direkt gesehen hab. Das war richtig huge. Hat der"}, {"id": 132, "start": 1449.96, "end": 1454.64, "text": "quasi mein Game gespielt bei mir. Und so haben wir noch nicht mal Account-Sharen müssen,"}, {"id": 133, "start": 1454.64, "end": 1460.64, "text": "was gegen Toss gewesen wäre. Wir haben einfach mit Low Latency mein Game geshared zu ihm."}, {"id": 134, "start": 1460.64, "end": 1466.44, "text": "So konnten wir nämlich im Stream sagen, wir verstoßen nicht gegen Toss trotzdem, dass"}, {"id": 135, "start": 1466.44, "end": 1471.68, "text": "jemand anderes auf meinem Account enchantet. Das ist mal Big Brain, oder? Ich mein, das"}, {"id": 136, "start": 1471.68, "end": 1477.16, "text": "ist ja kein Account-Sharing, wenn ich die Benutzerdaten nicht rausrücke. Wenn ich"}, {"id": 137, "start": 1477.16, "end": 1481.8, "text": "mein Computer share und jemand anderes auf meinem Computer das Spiel spielt, ohne dass"}, {"id": 138, "start": 1481.8, "end": 1486.84, "text": "ich ihm die Account-Daten gegeben hab, ist es ja kein Account-Sharing. Ihr könnt mir"}, {"id": 139, "start": 1486.84, "end": 1497.72, "text": "hoffentlich folgen. Und, dann hat's schon auch keiner beschwert. Aber das ist dem Hersteller"}, {"id": 140, "start": 1497.72, "end": 1503.64, "text": "eh vollkommen egal. Rainway, ich schreib mir das mal auf, das können wir tatsächlich"}, {"id": 141, "start": 1503.64, "end": 1515.76, "text": "mal ausprobieren. Ihr Stream-Ideen. Rainway Remote Gaming, irgendwie sowas. Kommt mal"}, {"id": 142, "start": 1515.76, "end": 1519.76, "text": "wieder Warzone, ja vielleicht sogar noch heute Mittag, mal gucken. Was ist denn mit dem Mauszeiger"}, {"id": 143, "start": 1519.76, "end": 1527.0, "text": "los? Der Mauszeiger ist shab. Guck mal an, der Mauszeiger ist falsch rum. Warum ist der"}, {"id": 144, "start": 1527.0, "end": 1536.16, "text": "Mauszeiger von links nach rechts? Das verwirrt mich. Die Musik ist ein bisschen laut jetzt,"}, {"id": 145, "start": 1536.16, "end": 1545.8, "text": "ne? Ja, besser. Der Installer ist kacke, richtig kacke. Das ist noch nicht mal der Standard"}, {"id": 146, "start": 1545.8, "end": 1550.72, "text": "Ubuntu Installer, das ist sowas Selbstgestricktes oder so, oder irgendwas aus dem Standard"}, {"id": 147, "start": 1550.72, "end": 1567.48, "text": "Ubuntu Installer abgewandeltes. Oje. German Keyboard Layout. No dead key. Alter, next."}, {"id": 148, "start": 1567.48, "end": 1581.68, "text": "Download. Doch, das ist der normale Ubuntu Installer. Äh, brauchen wir alles nicht. Ah,"}, {"id": 149, "start": 1581.68, "end": 1594.72, "text": "excellent Musik hier, ha? Exquisite. Erase disk, na klar, was sonst? Jaja, mach mal. Hier,"}, {"id": 150, "start": 1594.72, "end": 1600.92, "text": "wir stretchen das mal mit Aspect Ratio. Das sieht besser aus. In Berlin, wir sind in Frankfurt,"}, {"id": 151, "start": 1600.92, "end": 1606.24, "text": "nicht in Berlin. Aber das gibt's nicht auf der Map. Eigentlich müsste es anstatt Berlin"}, {"id": 152, "start": 1606.24, "end": 1618.52, "text": "Frankfurt geben. Test. 123456. Fair Passwort. Das ist aber auch das einzige System, was"}, {"id": 153, "start": 1618.52, "end": 1627.4, "text": "ich kenne, das 123456 als ganz gutes Passwort einschätzt. Wieso kein Arch, by the way installiert?"}, {"id": 154, "start": 1627.4, "end": 1637.6, "text": "By the way, wir haben Arch installiert, hier. Excellent. Aber nur by the way. Passwort liegt."}, {"id": 155, "start": 1637.6, "end": 1644.56, "text": "Next. Also ich verspreche mir da zumindest von, also umgekehrt, die versprechen ja, dass"}, {"id": 156, "start": 1644.56, "end": 1650.52, "text": "es gibt ein vorkonfiguriertes Gnome mit einem i3 als Oberfläche. Ich verspreche mir davon,"}, {"id": 157, "start": 1650.52, "end": 1656.92, "text": "dass das eventuell eines der wenigen sinnvollen Distributionen ist mit vorenstehendem i3,"}, {"id": 158, "start": 1656.92, "end": 1665.04, "text": "die man gut verwenden kann. Gibt's ja nicht so viele. Das Manjaro i3-Spin-Off gefällt"}, {"id": 159, "start": 1665.04, "end": 1669.36, "text": "mir überhaupt nicht. Das ist so konfiguriert, wie ich es überhaupt nicht mag. Oh, der Michael"}, {"id": 160, "start": 1669.36, "end": 1684.48, "text": "50 Billion ist am Start. Und wie war dein Vorstellungsgespräch? Erzähl. Schieß los,"}, {"id": 161, "start": 1684.48, "end": 1695.76, "text": "da bin ich jetzt gespannt. Hab's auf Dienstag verschoben? Ach so, warum das denn? Oder"}, {"id": 162, "start": 1695.76, "end": 1709.28, "text": "die haben es verschoben? Du hast es verschoben. Okay. Weiß nicht, ob das so einen guten Eindruck"}, {"id": 163, "start": 1709.28, "end": 1715.04, "text": "macht. Hast du das Archiv-Frontend schon gesehen? Nö. Ich wusste nicht, dass es ein neues"}, {"id": 164, "start": 1715.04, "end": 1721.6, "text": "Archiv-Frontend gibt. Soll ich mal gucken? Sebaro, darf ich schon gucken oder ist noch"}, {"id": 165, "start": 1721.6, "end": 1733.12, "text": "nicht fertig? Soll ich gucken oder soll ich warten? Ist das Sebaro überhaupt da? Qt-Mod?"}, {"id": 166, "start": 1733.12, "end": 1746.16, "text": "Archiv? Ach im Discord? Nee, das hab ich noch nicht gesehen. Das hab ich noch nicht"}, {"id": 167, "start": 1746.16, "end": 1754.4, "text": "gesehen, nee. Können wir uns mal angucken? Discord. Muss aber nur aufpassen, dass ich"}, {"id": 168, "start": 1754.4, "end": 1762.24, "text": "nicht im falschen Channel bin. MonkaS? Wer weiß? Nee, okay anscheinend bin ich im..."}, {"id": 169, "start": 1762.24, "end": 1766.88, "text": "Okay, ich bin... Da muss man nämlich aufpassen hier, es gibt hier gefährliche, gefährliche"}, {"id": 170, "start": 1766.88, "end": 1788.08, "text": "Channels. Also... Wo ist denn das Bild? Proggers? Wo ist das Bild? Oh jetzt kommt der Sebaro,"}, {"id": 171, "start": 1788.08, "end": 1803.88, "text": "Channelscripting BigBrain. Du kannst einfach, du kannst einfach glaube ich Dollar-Add verwenden"}, {"id": 172, "start": 1803.88, "end": 1809.12, "text": "an der Stelle. Dollar-Add sind glaube ich die Parameter, die übergeben werden aus dem"}, {"id": 173, "start": 1809.12, "end": 1835.76, "text": "Kopf. Archiv? Ach so, da ist es. Oh hier gehts aber richtig high IQ-mäßig zur Sache."}, {"id": 174, "start": 1835.76, "end": 1844.28, "text": "Ich seh das schon, ich seh das schon, ja. Und das gucken wir uns jetzt mal in groß an,"}, {"id": 175, "start": 1844.28, "end": 1854.2, "text": "ja ja alles gut. Exzellent, ja. Komm mal sogar mit Darksteam, seht ihr das Leute? Richtig"}, {"id": 176, "start": 1854.2, "end": 1858.88, "text": "high IQ-Proggers, was hier am Start ist. Was, und was kann man damit jetzt machen? Kann"}, {"id": 177, "start": 1858.88, "end": 1864.52, "text": "es, kann man das, nach was kann man alles suchen? Nur nach Titel oder auch nach Kategorie und"}, {"id": 178, "start": 1864.52, "end": 1876.0, "text": "auch nach sonst was? Aber das ist schon mal Massive. Oh hier was, was, was die Leute alles"}, {"id": 179, "start": 1876.0, "end": 1888.44, "text": "auf Dreier kriegen. Achso das ist gar nicht von meinem Browser. Ja das ist, ähm der Chat"}, {"id": 180, "start": 1888.44, "end": 1891.96, "text": "sagt schon, ihm gefällt der Grauto nicht. Ich gehe mal auch nicht davon aus, dass das"}, {"id": 181, "start": 1891.96, "end": 1895.76, "text": "Final ist, sondern einfach mal was gemacht, womit man gerade am Basteln ist. Aber das"}, {"id": 182, "start": 1895.76, "end": 1916.68, "text": "ist, das ist sehr nice. Exzellent. Und eine Runde Big Brain. So, so ist das gut. Das sieht"}, {"id": 183, "start": 1916.68, "end": 1926.0, "text": "schon mal echt gut aus. So, also hat es jetzt installiert. Installation complete. PS5 Livestream"}, {"id": 184, "start": 1926.0, "end": 1944.08, "text": "gesehen. Nee, wann war der? Gestern um 10. Doch, klar, haben wir geguckt, haben wir sogar"}, {"id": 185, "start": 1944.08, "end": 1950.12, "text": "live im Stream geguckt, habe ich gesehen. Das Design sieht aus wie eine Fritzbox. Mit"}, {"id": 186, "start": 1950.12, "end": 1959.12, "text": "weißen Hälften. Fritzbox Sandwich. Please remove the media. Ja, machen wir auch, so"}, {"id": 187, "start": 1959.12, "end": 1971.2, "text": "ist schon removed. Vm. Input. Stretch. Okay, stretch aus. Mal gucken, ob Vmr-Tools vorinstalliert"}, {"id": 188, "start": 1971.2, "end": 1977.2, "text": "sind. Ja, also wie gesagt habe ich gesehen. Es waren zwei, drei Spiele dabei, die waren"}, {"id": 189, "start": 1977.2, "end": 1985.16, "text": "ganz cool. Insgesamt war das Event eher, eher, eher so. Eher so als so. Es war eigentlich"}, {"id": 190, "start": 1985.16, "end": 1989.6, "text": "ums, eigentlich war es so. So, das trifft das Event ganz gut. Das war nicht komplett"}, {"id": 191, "start": 1989.6, "end": 1995.4, "text": "zum Einschlafen, das war jetzt auch nicht übertrieben. Eher, nicht übertrieben. Poggers,"}, {"id": 192, "start": 1995.4, "end": 2004.56, "text": "das war eher so. Okay, Champ war das. Du T-Mac, du bist nicht der Einzige, davon habe ich"}, {"id": 193, "start": 2004.56, "end": 2022.04, "text": "schon einige Bilder gesehen. Was macht das eigentlich gerade? Außer, außer laden. Macht"}, {"id": 194, "start": 2022.04, "end": 2042.32, "text": "das noch was? Hm. Hardcoded Ladebildschirm. Ja, ob es noch was macht, ich weiß es nicht."}, {"id": 195, "start": 2042.32, "end": 2047.4, "text": "Es lädt auf jeden Fall. Ladebildschirm. Das habe ich in irgendeinem Video noch mal erzählt."}, {"id": 196, "start": 2047.4, "end": 2056.04, "text": "Ladebildschirm. Ich weiß gar nicht mehr, wo das war. Eines der Ersten. Ladebild, Ladebild-GIF."}, {"id": 197, "start": 2056.04, "end": 2069.8, "text": "Patrick, wie lange dauert das normalerweise? Nicht so lange, oder? Zumal es auch so aussieht,"}, {"id": 198, "start": 2069.8, "end": 2086.52, "text": "das macht es nichts. Die VM eidet vor sich hin. Na, Chico, was ist los? Die Katz schleicht"}, {"id": 199, "start": 2086.52, "end": 2089.88, "text": "durch den Flur, so als hat sie den Flur noch nie gesehen. Da liegt nämlich meine Hose rum"}, {"id": 200, "start": 2089.88, "end": 2096.36, "text": "und die muss jetzt begutachtet werden. Chico, das ist meine Hose, das ist nichts Gefährliches."}, {"id": 201, "start": 2096.36, "end": 2122.76, "text": "Ok, anscheinend funktioniert es nicht. Yep. Chico. Scheint kaputt zu sein. Restart. Ok,"}, {"id": 202, "start": 2122.76, "end": 2131.4, "text": "restart funktioniert. Wir können mal gucken, ob wir in Grub kommen und irgendwie Verbau einschalten"}, {"id": 203, "start": 2131.4, "end": 2143.0, "text": "können. Ey, das juckt nicht. Aber wenn wir schnell sind, kriegen wir es wahrscheinlich"}, {"id": 204, "start": 2143.0, "end": 2165.08, "text": "hin. Ey, ein Hard Drive. Hä? Was? Warum ging das jetzt? Ich habe einfach nur Escape gehämmert."}, {"id": 205, "start": 2165.08, "end": 2193.72, "text": "Hat da irgendjemand eine logische Erklärung für? Neog, das kapiere ich nicht. Du hast"}, {"id": 206, "start": 2193.72, "end": 2215.52, "text": "auf dem Kopfhörer den Stream. Ach ne, du hast telefoniert, jetzt habe ich kapiert. Ah,"}, {"id": 207, "start": 2215.52, "end": 2227.2, "text": "ok. Was ist das denn? Ok, warum das jetzt aber funktioniert an einem Neustart, verstehe"}, {"id": 208, "start": 2227.2, "end": 2230.2, "text": "ich nicht. Geht das immer? Was haben wir hier? Launch. Ah, guck mal, wir haben, wir haben"}, {"id": 209, "start": 2230.2, "end": 2234.8, "text": "ne, ok, dann, das erste, was wir jetzt machen, ist ein Browser aufmachen. Ok, Steuerung D"}, {"id": 210, "start": 2234.8, "end": 2240.72, "text": "ist Settings, das ist für mich schon mal ungewohnt. Also wie startet man was? Launch, Terminal,"}, {"id": 211, "start": 2240.72, "end": 2260.72, "text": "Windows-Enter. Browser-Shift-Enter, Application-Shift-Windows-Space, das ist ein Rohfi bestimmt. Neo, ja, das war bestimmt"}, {"id": 212, "start": 2260.72, "end": 2279.16, "text": "etwas, etwas Wirechamp, Weirdchamp. Ok, was haben wir hier? Firefox, Browser. Das, das"}, {"id": 213, "start": 2279.16, "end": 2284.16, "text": "gefällt mir hier neben, das hat was. Dass man sich merken kann, dass es immer angezeigt"}, {"id": 214, "start": 2284.16, "end": 2295.8, "text": "wird, ist auch doof. Also wir machen das jetzt. Linux, ne, wie heißt der Kram nochmal? Name,"}, {"id": 215, "start": 2295.8, "end": 2299.04, "text": "den man sich nicht merken kann. Dann schauen wir uns jetzt nämlich mal an, was die auf"}, {"id": 216, "start": 2299.04, "end": 2308.44, "text": "ihrer Webseite bewerben. Learn More. Super Fragezeichen, Overlay. Super Fragezeichen"}, {"id": 217, "start": 2308.44, "end": 2320.72, "text": "haben wir doch hier schon. This Dialog, Shift. Ok, es ist Shift? Ah, da kann man das ein ausblenden,"}, {"id": 218, "start": 2320.72, "end": 2324.88, "text": "das gefällt mir schon mal, das hat was. Wir müssen übrigens noch was gucken, ob die 3D-Beschleunigung"}, {"id": 219, "start": 2324.88, "end": 2339.88, "text": "eingeschaltet ist oder nicht. Ja, IFK 9 Monate, Excellent Subscription, Huge, Big Prane Sub."}, {"id": 220, "start": 2339.88, "end": 2351.64, "text": "Massive. Subscription. So, also was haben wir denn hier für standardmäßige Keybindings?"}, {"id": 221, "start": 2351.64, "end": 2357.56, "text": "Terminal, Istdings, Enter. Das finde ich schon mal gut. Sachen auf den zweiten Desktop verschieben"}, {"id": 222, "start": 2357.56, "end": 2361.92, "text": "funktioniert genauso wie ich das gewöhnt bin. Neue Distro, ne, nicht so wirklich, es ist"}, {"id": 223, "start": 2361.92, "end": 2368.32, "text": "ein Ubuntu mit vorkonfiguriertem GNOME und i3. Also quasi, es ist ein GNOME Desktop,"}, {"id": 224, "start": 2368.32, "end": 2375.08, "text": "wo dann i3 quasi in der GNOME Session läuft. Das ist ziemlich Big Brain, weil die tun gar"}, {"id": 225, "start": 2375.08, "end": 2377.64, "text": "nicht so als wäre es ein neues Distro im eigentlichen Sinne, sondern die sagen ganz"}, {"id": 226, "start": 2377.64, "end": 2382.96, "text": "klar, es ist ein Ubuntu mit vorkonfiguriertem i3. Das finde ich gut, weil es gibt wenig"}, {"id": 227, "start": 2382.96, "end": 2389.88, "text": "gute i3-Distributionen. Also mit i3 ordentlich vorkonfiguriert. Ok, was haben wir denn, Application"}, {"id": 228, "start": 2389.88, "end": 2395.68, "text": "Space ist der Launcher, ok, ist ähnlich wie bei mir. Farbschema finde ich schon mal recht"}, {"id": 229, "start": 2395.68, "end": 2406.48, "text": "passend, finde ich eigentlich ganz nett, was da eingestellt ist aktuell. Man kann es auch"}, {"id": 230, "start": 2406.48, "end": 2418.4, "text": "zurückstellen, ok. Was hat er denn für eine Schriftart standardmäßig? JetBrains Mono,"}, {"id": 231, "start": 2418.4, "end": 2428.16, "text": "ok. Hipster, Hipster Schriftart. JetBrains Mono. Ist denn meine Lieblingsschriftart wenigstens"}, {"id": 232, "start": 2428.16, "end": 2432.12, "text": "vollenzählen, jetzt zeig mal her. Heck, ne, ist nicht vollenzählen, muss auch nicht"}, {"id": 233, "start": 2432.12, "end": 2437.88, "text": "vollenzählen sein. Gibt es einen T-Max drauf? Auch nicht, ok, das ist in Ordnung, man muss"}, {"id": 234, "start": 2437.88, "end": 2441.68, "text": "ja nicht alles vollenzählen haben. Das erste, was wir machen, ist erstmal einen T-Max installieren,"}, {"id": 235, "start": 2441.68, "end": 2460.36, "text": "yes. Ok, gefällt mir eigentlich ganz gut bis jetzt. Schriftart, naja, nicht mein Fall,"}, {"id": 236, "start": 2460.36, "end": 2470.4, "text": "es ist eine gute Default Choice, ist ok. Update has been issued, ja, install now. Exellent."}, {"id": 237, "start": 2470.4, "end": 2474.96, "text": "Es sieht auch, finde ich, gut gestylt aus, es passt alles zusammen. Ohne sie standardmäßig"}, {"id": 238, "start": 2474.96, "end": 2485.2, "text": "darksteamed, das finde ich nice. Das gefällt mir. Und daran sieht man, dass es halt ein"}, {"id": 239, "start": 2485.2, "end": 2492.82, "text": "Gnome mit i3 ist, weil das ist, dass diese Updater ist halt, ne Gtk Anwendung, die läuft"}, {"id": 240, "start": 2492.82, "end": 2497.72, "text": "bei mir beispielsweise gar nicht im Hintergrund. Also ich hab, auf meinem Manjaro i3 kann diese"}, {"id": 241, "start": 2497.72, "end": 2502.56, "text": "Anwendung eh nicht laufen, aber ich hab da auch kein grafisches Update Zeug am Start."}, {"id": 242, "start": 2502.56, "end": 2508.36, "text": "Schonmal Kitty ausprobiert. Ich hab einige grafikbeschleunigende Terminals schon ausprobiert."}, {"id": 243, "start": 2508.36, "end": 2513.04, "text": "Bisher muss ich sagen, alles in allem, vom Font her, von der Handhabung her gefällt"}, {"id": 244, "start": 2513.04, "end": 2516.88, "text": "mir nach wie vor Gnome Terminal immer noch am besten. Auch wenn das irgendwie oldschool"}, {"id": 245, "start": 2516.88, "end": 2520.96, "text": "ist und jetzt nicht das schnellste Terminal überhaupt, aber wozu muss ein Terminal wahnsinnig"}, {"id": 246, "start": 2520.96, "end": 2530.24, "text": "schnell sein. Ein Terminal muss ich gut bedienen lassen und nicht so ein Kack wie das CMD Fenster"}, {"id": 247, "start": 2530.24, "end": 2539.92, "text": "und da bin ich aus. Was ihr hätten machen können ist, dass die Fenster Schriftart,"}, {"id": 248, "start": 2539.92, "end": 2545.64, "text": "die Fenster Hintergrundfarbe nicht exakt die gleiche Hintergrundfarbe ist vom Terminal,"}, {"id": 249, "start": 2545.64, "end": 2550.6, "text": "weil, naja, da siehst halt kaum was. Und das Fenster laggt übrigens beim Verschieben"}, {"id": 250, "start": 2550.6, "end": 2557.4, "text": "wie Sau. Restart. Restart now. Mal gucken, ob er jetzt Restart ohne, ja UrXVT hatte ich"}, {"id": 251, "start": 2557.4, "end": 2562.16, "text": "jahrelang, aber ich hab's jetzt durch Gnome Terminal abgelöst. Ok, man muss anscheinend"}, {"id": 252, "start": 2562.16, "end": 2568.0, "text": "Escape hemmern, dass es funktioniert. Ist das ein Bug in diesem Ladebildschirm, dass"}, {"id": 253, "start": 2568.0, "end": 2589.96, "text": "es nicht funktioniert? Das ist ja low. Vielleicht ist es auch der Noobfilter. Guck, wenn er"}, {"id": 254, "start": 2589.96, "end": 2594.52, "text": "Escape hemmert, dann geht's. Das ist nur in der VM. Vielleicht versucht er auch was"}, {"id": 255, "start": 2594.52, "end": 2600.24, "text": "zu starten, was ich mit der Scale abbreche, aber normalerweise sollte, ich weiß es nicht,"}, {"id": 256, "start": 2600.24, "end": 2604.6, "text": "was der für Schmerzen hat. Ok, Enter is Terminal, das finde ich gut, das habe ich nämlich standardmäßig"}, {"id": 257, "start": 2604.6, "end": 2613.0, "text": "bei mir auch so. Sie haben auf jeden Fall ein bisschen 3D Zeug im Hintergrund, das sieht"}, {"id": 258, "start": 2613.0, "end": 2617.24, "text": "man nämlich daher, wenn man jetzt hier, ich mach mal kurz, ah Moment, Moment, was war"}, {"id": 259, "start": 2617.24, "end": 2626.08, "text": "die Veranwendung starten? Space, Space, da muss ich mich erst dran gewöhnen. Man sieht"}, {"id": 260, "start": 2626.08, "end": 2631.76, "text": "es nämlich, wenn ihr rüber switcht, seht ihr wie das faded? Das kann X und I3 standardmäßig"}, {"id": 261, "start": 2631.76, "end": 2636.56, "text": "nicht, da muss irgendein Composite Manager im Hintergrund sein hier, wird das überfaden."}, {"id": 262, "start": 2636.56, "end": 2656.8, "text": "Was ist das? Notifications. Keg. Was ist das hier, Kalender? Oder, sehe ich das richtig,"}, {"id": 263, "start": 2656.8, "end": 2666.12, "text": "Kalender? Ah, ok, das ist die Gnome 3 Integration, die mich jetzt persönlich nicht so sehr juckt,"}, {"id": 264, "start": 2666.12, "end": 2670.76, "text": "aber es hat schon seine Vorteile. Es hat schon seine Vorteile, ich meine, die Gnome ist sau"}, {"id": 265, "start": 2670.76, "end": 2677.0, "text": "viel eingebaut. Es ist nicht umsonst so, dass die meisten Sachen mittlerweile auf Gnome"}, {"id": 266, "start": 2677.0, "end": 2686.48, "text": "Basis sind. Date und Time. Ach nee, man kann hier nur das Format umstellen. Na gut, ob"}, {"id": 267, "start": 2686.48, "end": 2695.56, "text": "man das standardmäßig bei einem Klick öffnen muss, weiß ich nicht. Ja, CPU. Oh, was ist"}, {"id": 268, "start": 2695.56, "end": 2703.32, "text": "das? Task Manager, irgendeine Art Task Manager. Wie poppe ich das Fenster aus? Das ist nicht"}, {"id": 269, "start": 2703.32, "end": 2710.84, "text": "der Standard, nicht der Standard. Layout. Task Manager. Ok, wenn man den Task Manager"}, {"id": 270, "start": 2710.84, "end": 2719.56, "text": "als GUI Programm braucht, warum nicht? Ja, warum nicht? Das glaube ich dem Firefox nicht,"}, {"id": 271, "start": 2719.56, "end": 2734.56, "text": "der Firefox braucht mehr RAM. So, das heißt, was war Hilfe? Shift Windows? Session. Restart,"}, {"id": 272, "start": 2734.56, "end": 2749.56, "text": "Power Down, bla bla bla. Terminate App. Ach so, App beenden, ok. Was ist in Fenstermodus?"}, {"id": 273, "start": 2749.56, "end": 2757.44, "text": "Resize Window. Ok, probieren wir das mal aus. Ok, Resize. Ach, Enter Resize Mode. Ja gut,"}, {"id": 274, "start": 2757.44, "end": 2764.92, "text": "das kenne ich, das ist Standard E3, das ist Standard E3. Navigate. Scratchpad, was ist"}, {"id": 275, "start": 2764.92, "end": 2792.16, "text": "das? Probieren wir mal aus. Windows, Control A. Windows, Control. Windows, Control A. Ok."}, {"id": 276, "start": 2792.16, "end": 2800.48, "text": "Windows, Control A. Nö, hat keinen Effekt. Windows, Control A. Macht nix. Klappt richtig"}, {"id": 277, "start": 2800.48, "end": 2810.56, "text": "gut. Previous Workspace, das brauchen wir alles nicht. Modify. Machen wir es hier mal"}, {"id": 278, "start": 2810.56, "end": 2825.04, "text": "kurz zu. Windows Position, ok, das ist das übliche. Windows Shift, ja, das ist glaube"}, {"id": 279, "start": 2825.04, "end": 2832.92, "text": "ich sogar die Fault. Windows Flowtoggle, das habe ich gesucht. Windows Shift F, ok."}, {"id": 280, "start": 2832.92, "end": 2841.92, "text": "Windows Shift F, ah ja, genau, das habe ich gesucht. Dass man Windows, dass man quasi"}, {"id": 281, "start": 2841.92, "end": 2848.68, "text": "auch normale Fenster draus machen kann, ok. Es ist eine Mischung aus die Fault E3 und"}, {"id": 282, "start": 2848.68, "end": 2863.72, "text": "ein bisschen abgewandelt, was relativ logisch ist. Ich habe auch normalerweise eine Scratchpad"}, {"id": 283, "start": 2863.72, "end": 2870.48, "text": "laufen, das ist bei mir ein Overlay Terminal, aber anscheinend geht es standardmäßig nicht."}, {"id": 284, "start": 2870.48, "end": 2879.16, "text": "Files Search. Windows, Windows Altspace, ok, das lässt sich merkwürdig drücken. Returns"}, {"id": 285, "start": 2879.16, "end": 2887.36, "text": "Matches for all local files, ok. Wim, Etsy, oder was? Bash. Hey, oh, das ist praktisch,"}, {"id": 286, "start": 2887.36, "end": 2894.96, "text": "dass das drinnen ist. Das finde ich cool. Kann man die auch öffnen? Ach ja. Das ist"}, {"id": 287, "start": 2894.96, "end": 2902.0, "text": "doch nett. Das ist doch nett. Ist das ein, ist das ein, ist das ein GWIM oder was ist"}, {"id": 288, "start": 2902.0, "end": 2915.84, "text": "das hier? Ah nee, G-Edit ist das. Kein, kein GWIM. Ok, das Farbschema finde ich ein bisschen"}, {"id": 289, "start": 2915.84, "end": 2919.52, "text": "unglücklich, aber das ist doch nice, wie sie das eingebaut haben. Das gefällt mir"}, {"id": 290, "start": 2919.52, "end": 2925.24, "text": "ganz gut. Also man sagt, man sagt jetzt Files Search, ich habe schon wieder vergessen, was"}, {"id": 291, "start": 2925.24, "end": 2931.8, "text": "Files Search ist. Altspace, dann sucht man eine Datei, Bash und sagt, keine Ahnung, öffnen,"}, {"id": 292, "start": 2931.8, "end": 2934.88, "text": "muss einfach nur Enter drücken und es geht im Editor auf. Das haben sie schön gemacht."}, {"id": 293, "start": 2934.88, "end": 2944.48, "text": "Ich würde das natürlich eh über das Terminal machen, ja, aber standardmäßig eingebaut"}, {"id": 294, "start": 2944.48, "end": 2949.2, "text": "kann das nicht schaden. Das finde ich, finde ich ganz nett. Oh Leute, ich muss Essen bestellen"}, {"id": 295, "start": 2949.2, "end": 2968.4, "text": "nehmen bei. Muss Döner Teller bestellen. Richtig. Döner Teller. Döner Teller. Auf halb"}, {"id": 296, "start": 2968.4, "end": 2986.84, "text": "zwei oder so. Döner Teller. Döner Teller mit scharfer Soße und Pommes frites. Exzellent."}, {"id": 297, "start": 2986.84, "end": 2997.28, "text": "Nicht von, du bist am, was du bist am Fasten. Warum machst du denn sowas den Baro? Ja, nicht"}, {"id": 298, "start": 2997.28, "end": 3006.64, "text": "den Baro, Patrick. Darf nicht fetter werden. Okay, das ist ein Argument. Das ist, das klingt"}, {"id": 299, "start": 3006.64, "end": 3017.68, "text": "logisch, ja. Das soll ich vielleicht auch machen, wenn es darum geht. Ich meine, bestellen,"}, {"id": 300, "start": 3017.68, "end": 3021.76, "text": "das bestellender Bestellvorgang ist broken. Ich kann nicht bestellen, was ist denn hier"}, {"id": 301, "start": 3021.76, "end": 3030.24, "text": "los? Oh, derzeit geschlossen. Warum? Ach, die machen erst um zwölf auf. Ja, das ist"}, {"id": 302, "start": 3030.24, "end": 3035.28, "text": "ja gut. Es ist jetzt ja zwölf. Wir können sie jetzt aufmachen. Kann ich jetzt bestellen."}, {"id": 303, "start": 3035.28, "end": 3048.6, "text": "Optimales Timing. Aber Patrick, da sind wir ja fast ähnlich dick. Du bist ein Ticken"}, {"id": 304, "start": 3048.6, "end": 3061.56, "text": "dünner Ticken, nicht viel. So, also kann ich jetzt bestellen? Es ist zwölf. Nee, es ist"}, {"id": 305, "start": 3061.56, "end": 3074.2, "text": "11 und 59. Die Uhrzeit auf dem Server geht neun Minuten nach. Das ist schlecht, je nach"}, {"id": 306, "start": 3074.2, "end": 3079.04, "text": "Server, weil da kannst du dich teilweise per SSH nicht mehr einloggen. Ah, jetzt hat's"}, {"id": 307, "start": 3079.04, "end": 3089.92, "text": "offen. Okay, also Döner Teller. Das ist exzellente Döner Teller. Döner Gerichte. Döner Teller."}, {"id": 308, "start": 3089.92, "end": 3100.84, "text": "Also, wir wollen scharfe Soße haben. Scharfe Soße und einmal Pommes frites bestätigen."}, {"id": 309, "start": 3100.84, "end": 3124.12, "text": "Bestellen. Max, Nachname ist Top Secret. Ähm, zusätzliche Nachricht. Lieferzeit 13.15"}, {"id": 310, "start": 3124.12, "end": 3138.64, "text": "machen wir mal. Zur Kasse. Paypal. Bestellen. Okay. Ja, weil ich hab übels Cold Amp. Ich"}, {"id": 311, "start": 3138.64, "end": 3166.44, "text": "muss jetzt unbedingt was zu Futter bestellen. Paypal. Hallo. Okay. Okay. Okay. Okay. Okay."}, {"id": 312, "start": 3166.44, "end": 3176.0, "text": "Oh, ich kack noob. Ich hab ja mein, mein Paypal Passwort geändert. Äh, muss ich anderes."}, {"id": 313, "start": 3176.0, "end": 3184.24, "text": "Das weiß ich aus dem Kopf nicht, mein Paypal Passwort. Da muss ich anderen Account nehmen,"}, {"id": 314, "start": 3184.24, "end": 3203.96, "text": "wo ich aus dem Kopf weiß. Ah, exzellent, jetzt passt's. Big Brain. Checkout 8 Euro. Paypal"}, {"id": 315, "start": 3203.96, "end": 3216.76, "text": "gut haben. Alles klar, passt. Essens Stream, nee. Weiß ich nicht. Wieso gibt's kein P"}, {"id": 316, "start": 3216.76, "end": 3224.6, "text": "pro Fett? Oh, das brauchen wir unbedingt. Ähm, Hardcore Crystal Mask. Name wieder, ähm,"}, {"id": 317, "start": 3224.6, "end": 3235.52, "text": "Bridge Prime. Dankeschön. Exzellent. Hype Subscription. Ihr wisst doch, meine Passwörter"}, {"id": 318, "start": 3235.52, "end": 3244.68, "text": "sind überall. 1, 2, Test und 1, 2, 3, 4, 5, 6. P pro Fett. P pro Fett. Oh, das brauchen"}, {"id": 319, "start": 3244.68, "end": 3251.0, "text": "wir als Emote. Ganz wichtig. P pro Fett. Ich mach's gleich rein, Leute. Das ist gut."}, {"id": 320, "start": 3251.0, "end": 3265.84, "text": "Oder gibt's da noch eine bessere Variante von? Gibt's noch ein besseres P pro Fett? Nee,"}, {"id": 321, "start": 3265.84, "end": 3273.56, "text": "ist alles Mörder wenigstens gleich. Ich mach's rein, Leute. Add to my channel. Ist drinne."}, {"id": 322, "start": 3273.56, "end": 3280.44, "text": "P pro Fett. Wer FFZ hat, kann den Stream refreschen und P pro Fett funktioniert. P pro Fett."}, {"id": 323, "start": 3280.44, "end": 3294.6, "text": "Ich refresch auch mal den Stream und probier's aus. P pro Fett. Okay, anscheinend ist doch"}, {"id": 324, "start": 3294.6, "end": 3305.44, "text": "noch nicht da. P pro Fett sollte jetzt eigentlich funktionieren. Dann braucht, dann braucht"}, {"id": 325, "start": 3305.44, "end": 3317.88, "text": "man FFZ eine Weile, bis es geladen hat. Ozebaro, das klingt schlecht. Warum sagt mir die Seite,"}, {"id": 326, "start": 3317.88, "end": 3327.04, "text": "ihre Bestellung wird in 30 Minuten geliefert? Ich hab gesagt 13.15 Uhr. Mango United Gaming,"}, {"id": 327, "start": 3327.04, "end": 3333.08, "text": "zwei Monate. Dankeschön. Exzellent Subscription. Huge. So, was können wir sonst auch schön"}, {"id": 328, "start": 3333.08, "end": 3337.76, "text": "ausprobieren? Wir haben ja gerade erst installiert. Also Standard-Sachen, Navigation und so haben"}, {"id": 329, "start": 3337.76, "end": 3343.04, "text": "wir ausprobiert. Was haben wir hier sonst noch? Browser haben wir schon, haben wir off. Command,"}, {"id": 330, "start": 3343.04, "end": 3352.48, "text": "was ist Command? Windows, Windows Shift Space. Ach so, irgendeine Command-Run Hardtop. Ja,"}, {"id": 331, "start": 3352.48, "end": 3363.4, "text": "es ist nur Run Hardtop im Hintergrund. Das bringt es jetzt nicht so wirklich. File Search,"}, {"id": 332, "start": 3363.4, "end": 3369.44, "text": "File Browser. Okay, was haben sie da installiert? Okay, das sieht aus wie ein ganz normaler,"}, {"id": 333, "start": 3369.44, "end": 3381.92, "text": "ganz normaler Nautilus. Ist das der Nautilus? Ohne dass Nautilus dran steht oder ist das"}, {"id": 334, "start": 3381.92, "end": 3392.56, "text": "was anderes? So, das finde ich schonmal. Das gefällt mir vor, konfiguriert. Das hat irgendwie"}, {"id": 335, "start": 3392.56, "end": 3397.24, "text": "was. Ich finde auch dieses Overlay hier schick, dass man nachgucken kann, welcher Shortcut"}, {"id": 336, "start": 3397.24, "end": 3400.92, "text": "was ist. Das braucht man so die ersten ein, zwei Tage. Danach hat man sich's gemerkt."}, {"id": 337, "start": 3400.92, "end": 3408.36, "text": "Okay, was gibt es denn sonst noch für Sachen, was die sagen, was gut ist? Super Enter Terminal"}, {"id": 338, "start": 3408.36, "end": 3413.64, "text": "Application Launcher hatten wir auch schon. Super Space. Der ist auch, das ist garantiert"}, {"id": 339, "start": 3413.64, "end": 3417.88, "text": "ein Rohfi und der ist aber auch schon ganz gut vorkonfiguriert. Das finde ich, finde"}, {"id": 340, "start": 3417.88, "end": 3427.52, "text": "ich schick, gefällt mir. Live Patch. Huge Terminal. Es ist auch wenig drauf, das finde"}, {"id": 341, "start": 3427.52, "end": 3433.64, "text": "ich gut. Guck mal, es ist kaum was drauf. Das ist gut, Hardtop, das ist gut vorinstalliert."}, {"id": 342, "start": 3433.64, "end": 3446.64, "text": "So, was haben wir sonst noch? App Launcher. Need more Terminals. Was? Super, Super und"}, {"id": 343, "start": 3446.64, "end": 3460.24, "text": "Backspace? Was? Super, Super Backspace. Hä? Super Backspace und dann Super Enter. Super"}, {"id": 344, "start": 3460.24, "end": 3471.04, "text": "Backspace, Super Enter. Hä? Super Backspace, Enter. Super Backspace, Enter. Super Backspace,"}, {"id": 345, "start": 3471.04, "end": 3476.0, "text": "Enter. Ach, guck mal, der macht hier, der macht jetzt, der splitte das, das ist eigentlich"}, {"id": 346, "start": 3476.0, "end": 3480.68, "text": "eine ganz coole Funktion. Das ist eigentlich eine ganz coole Funktion. Normalerweise gehen"}, {"id": 347, "start": 3480.68, "end": 3485.88, "text": "die Programme ja so aufeinander und jetzt kann man, wenn man mehrere Terminal braucht,"}, {"id": 348, "start": 3485.88, "end": 3493.64, "text": "kann man das so schneckenmäßig machen. Das finde ich eigentlich ganz cool. Backspace,"}, {"id": 349, "start": 3493.64, "end": 3503.16, "text": "Enter. Backspace, Enter. Ah. Okay, es wird ein bisschen übertrieben. Das ist aber eine"}, {"id": 350, "start": 3503.16, "end": 3520.08, "text": "gute Idee, das gefällt mir. Ich verwende das normalerweise nie, weil meistens mache"}, {"id": 351, "start": 3520.08, "end": 3525.92, "text": "ich so, meistens mache ich so, ich mache zwei Sachen auf und dann so. Das ist mein Standard,"}, {"id": 352, "start": 3525.92, "end": 3532.52, "text": "das oder so ist eigentlich mein Standard Terminal Layout, wenn ich was machen muss, wo ich mehrere"}, {"id": 353, "start": 3532.52, "end": 3537.88, "text": "Terminals brauche. Meistens habe ich so, wenn ich mehrere Fenster auf habe, meistens habe"}, {"id": 354, "start": 3537.88, "end": 3545.8, "text": "ich ja eh noch meinen T-Max auf und mache alles da drüber. Eine halbwegs sinnige T-Max"}, {"id": 355, "start": 3545.8, "end": 3549.8, "text": "Config hätten sie vielleicht noch vorkonfiguriert dabei haben können, das wäre nicht schlecht."}, {"id": 356, "start": 3549.8, "end": 3558.16, "text": "Sebaro sagt, würdest du sagen, dass es besser ist als der normale Ubuntu Desktop? Na besser"}, {"id": 357, "start": 3558.16, "end": 3561.8, "text": "kann man eh nicht sagen, besser für was? Na besser für Noob Einsteiger garantiert"}, {"id": 358, "start": 3561.8, "end": 3567.2, "text": "nicht? Für Leute, die ordentlich vorkonfiguriertes i3 suchen, ist es die einzige Alternative,"}, {"id": 359, "start": 3567.2, "end": 3576.56, "text": "die mir so einfällt. Was hältst du von T-Muxinator? Hab ich glaube ich noch nie ausprobiert."}, {"id": 360, "start": 3576.56, "end": 3587.92, "text": "Ist das Terminator mit T-Mux? Ach nee, das ist die Geschichte, wo du T-Max Sessions"}, {"id": 361, "start": 3587.92, "end": 3593.72, "text": "speichern kannst und sowas. Das ist sicherlich ganz cool, aber ich habe noch keinen Anwendungszweck"}, {"id": 362, "start": 3593.72, "end": 3598.36, "text": "für gefunden, wo ich sagen würde, oh ja das wird mir richtig was bringen. Weil meine"}, {"id": 363, "start": 3598.36, "end": 3604.04, "text": "T-Max Sessions sehen in der Regel so aus. Ich habe T-Max auf, habe einige Tabs mit jeweils"}, {"id": 364, "start": 3604.04, "end": 3610.56, "text": "nur einem Programm oder eine SSH Sessions oder sonst was und ein paar, wo vielleicht"}, {"id": 365, "start": 3610.56, "end": 3617.96, "text": "mal was gesplittet ist, aber ansonsten sind meine T-Max Sessions eigentlich zu normal,"}, {"id": 366, "start": 3617.96, "end": 3627.4, "text": "dass ich sowas bräuchte. Der Patrick findet es toll, ja das ist doch schon mal schön,"}, {"id": 367, "start": 3627.4, "end": 3635.4, "text": "da haben wir einen User, der es benutzt und es gut findet. Choggle Float Mode Windows"}, {"id": 368, "start": 3635.4, "end": 3647.2, "text": "F, ja das finde ich gut. Standardmäßig habe ich es auf Shift-Windows-Lehrzeichen. Mount"}, {"id": 369, "start": 3647.2, "end": 3659.0, "text": "hier USB-Drives, das juckt mich jetzt nicht so. Muss meine USB-Drives nicht mounten. Navigate"}, {"id": 370, "start": 3659.0, "end": 3663.92, "text": "Workspace hatten wir schon, das haben wir auch schon. Dass die auf den Screenshots"}, {"id": 371, "start": 3663.92, "end": 3671.8, "text": "immer so extrem kleine Schriftgröße haben. Ich habe ja mittlerweile meine Schriftgröße"}, {"id": 372, "start": 3671.8, "end": 3676.84, "text": "alles so in dieser Größe, einfach weil es für die Augen viel angenehmer ist. Die Leiste"}, {"id": 373, "start": 3676.84, "end": 3680.8, "text": "finde ich eigentlich auch ganz gut vorkonfiguriert. Irgendjemand hat gesagt, die würde total"}, {"id": 374, "start": 3680.8, "end": 3684.24, "text": "hässlich aussehen, ich finde die eigentlich ganz gut. Ich meine meine normale Leiste sieht"}, {"id": 375, "start": 3684.24, "end": 3691.36, "text": "ungefähr so aus, wie ich habe. Das ist so meine normale Leiste. Ich meine gut die sieht"}, {"id": 376, "start": 3691.36, "end": 3696.88, "text": "ein bisschen fancierer aus als die Leiste, aber die passt vom Style her, finde ich eigentlich"}, {"id": 377, "start": 3696.88, "end": 3704.84, "text": "ganz gut. T-MAX ist sowas wie Screen, ja bloß dass es noch viel mehr kann. Screen war ja"}, {"id": 378, "start": 3704.84, "end": 3709.24, "text": "im Prinzip nur dafür da, dass seine Session nicht abgekackt ist. T-MAX kannst du Sachen"}, {"id": 379, "start": 3709.24, "end": 3714.56, "text": "splitten und vergrößern und reinzoomen und so. Nicht vergrößern, reinzoomen, also Fenster"}, {"id": 380, "start": 3714.56, "end": 3719.8, "text": "größer machen, dich detachen auch und auch ein bisschen verskripten wenn man es will."}, {"id": 381, "start": 3719.8, "end": 3724.64, "text": "T-MAX ist ganz nützlich. Ich mache es oft mal so, wenn ich auf den Server gehe und weiß,"}, {"id": 382, "start": 3724.64, "end": 3727.76, "text": "dass ich schon eine Weile drauf machen muss, mache ich erstmal eine T-MAX Session auf und"}, {"id": 383, "start": 3727.76, "end": 3732.52, "text": "das beste an T-MAX ist, dass man die Session sharen kann. Also sprich, wenn zwei Leute"}, {"id": 384, "start": 3732.52, "end": 3739.12, "text": "auf dem gleichen System sind, kann man die T-MAX Session sharen. Also zum Beispiel, wir"}, {"id": 385, "start": 3739.12, "end": 3743.12, "text": "tun jetzt mal so, als wäre das hier ein zweiter Rechner wo ich drauf wäre oder das hier eine"}, {"id": 386, "start": 3743.12, "end": 3747.12, "text": "Remote Verbindung, dann würde ich einfach Sachen T-MAX minus A und seht ihr schon bin"}, {"id": 387, "start": 3747.12, "end": 3752.24, "text": "ich in der ersten Session drin. Und das machen wir auf der Arbeit relativ oft, dass wenn"}, {"id": 388, "start": 3752.24, "end": 3756.84, "text": "irgendwas nicht geht und irgendwie einer was guckt, ein anderer mitgucken soll, dann sagen"}, {"id": 389, "start": 3756.84, "end": 3761.8, "text": "wir hier T-MAX Session als Route ist auf, dann lockt er sich per SSH ein, macht T-MAX"}, {"id": 390, "start": 3761.8, "end": 3767.96, "text": "A und ist attached. Das ist dann praktisch, wenn man zu zweit gucken will. Mir gefällt"}, {"id": 391, "start": 3767.96, "end": 3774.0, "text": "die E3 Bar unten nicht, ich hätte die E3 Bar lieber oben. Aber ich kann mir ja alles"}, {"id": 392, "start": 3774.0, "end": 3787.48, "text": "ändern. So was haben sie sonst noch so hier? Components, hatten sie irgendwas? Ubuntu App"}, {"id": 393, "start": 3787.48, "end": 3798.6, "text": "Store, ah Moment, Windows Shift App, sehr gut, Store, sehr gut, es relied on Ubuntu"}, {"id": 394, "start": 3798.6, "end": 3822.64, "text": "App Store, aber, ach Snap ist das. Snap. Also das haben sie standardmäßig drauf, XOR,"}, {"id": 395, "start": 3822.64, "end": 3827.24, "text": "klar was anderes gibt es ja auch nicht. E3 Gaps ist standardmäßig da, wie man hier sieht,"}, {"id": 396, "start": 3827.24, "end": 3838.32, "text": "zwischen den Fenstern sind 5 Pixel oder so Platz. Das geht nur mit E3 Gaps. So ein Feature"}, {"id": 397, "start": 3838.32, "end": 3844.88, "text": "verstehe ich gar nicht, warum sie das nicht in den Standard Desktop mal aufnehmen. Ich"}, {"id": 398, "start": 3844.88, "end": 3849.12, "text": "finde es einfach schöner, weil die Fenster optisch besser voneinander getrennt sind."}, {"id": 399, "start": 3849.12, "end": 3874.24, "text": "In Windows habe ich sie unten, in E3 habe ich sie gerne oben. Ok, Look. Ach guck mal,"}, {"id": 400, "start": 3874.24, "end": 3881.6, "text": "man kann, ach schau mal, man kann verschiedene Themes anwenden. Ok, das probieren wir jetzt"}, {"id": 401, "start": 3881.6, "end": 3900.16, "text": "noch mal aus. Ubuntu Look, Ubuntu Style, Solarize Style, Look, was, As, was, La Keile, Las Keile,"}, {"id": 402, "start": 3900.16, "end": 3913.92, "text": "Las, wie spricht man das denn aus? Das ist bestimmt französisch. Kahuela, Mirage, Dark"}, {"id": 403, "start": 3913.92, "end": 3924.76, "text": "Look, Ahu, AAU. Ok, wir installieren mal den Ubuntu Look und switchen das mal. Mal gucken,"}, {"id": 404, "start": 3924.76, "end": 3942.0, "text": "wie einfach das funktioniert. Und dann switcht man das wie? Ah ja, Set, Ubuntu und dann Refresh."}, {"id": 405, "start": 3942.0, "end": 3966.28, "text": "Das sieht ja eklig aus. Das gefällt mir ja gar nicht. Was, Nord? Das sieht eklig aus,"}, {"id": 406, "start": 3966.28, "end": 3976.2, "text": "der Ubuntu Look, der gefällt mir aber überhaupt nicht. Set, Moment, wie ging das jetzt noch"}, {"id": 407, "start": 3976.2, "end": 3997.32, "text": "mal? Refresh. Hä? Es war auch kein Unterschied dazwischen. List, was ist denn alles installiert?"}, {"id": 408, "start": 3997.32, "end": 4008.52, "text": "Set, ok, das ist der Standard Look. Refresh. Äh, irgendwie ist das kaputt, das lässt sich"}, {"id": 409, "start": 4008.52, "end": 4020.4, "text": "nicht mehr umschalten. Monkeys, Broken, Reboot und Escape-Hämmern, weil Escape muss man"}, {"id": 410, "start": 4020.4, "end": 4028.08, "text": "drüber hämmern, sonst startet er nicht. Es hat einen Fehler gegeben, echt, habe ich"}, {"id": 411, "start": 4028.08, "end": 4049.28, "text": "nicht gesehen. Guck mal, jetzt haben die Desktops auch Farben. Ist eigentlich ganz nett. Aber"}, {"id": 412, "start": 4049.28, "end": 4066.0, "text": "das sieht eklig aus, warum sieht das jetzt so eklig aus? Ich will den normalen Look wieder"}, {"id": 413, "start": 4066.0, "end": 4083.12, "text": "haben. Set, das war doch die Fall Look. Ah, Already Existing. Ja, aber das ist doof."}, {"id": 414, "start": 4083.12, "end": 4088.0, "text": "Das heißt, warum überschreibt der das denn nicht? Das ist doch doof. Gibt es da Minus"}, {"id": 415, "start": 4088.0, "end": 4110.56, "text": "F oder sowas? Minus F? Ne, soll ich das jetzt löschen? Das ist aber doof. Set, ok, probieren"}, {"id": 416, "start": 4110.56, "end": 4127.16, "text": "jetzt mal das andere aus. Refresh. Wo ist mein Terminal hin? Refresh. Ah ja, da kommen"}, {"id": 417, "start": 4127.16, "end": 4140.92, "text": "wir der Sache doch schon näher. Oh, was ist das? Das kommt raus, wenn ich mit Paint Sachen"}, {"id": 418, "start": 4140.92, "end": 4148.6, "text": "male. Ok, aber das Farbschema gefällt mir schon mal besser. Das andere. Aber warum kann"}, {"id": 419, "start": 4148.6, "end": 4157.36, "text": "man das nicht überschreiben? Das ist doch total bescheuert. Ich muss immer das Pfeil"}, {"id": 420, "start": 4157.36, "end": 4182.88, "text": "löschen dazu. Ok, das ist jetzt Standard, der Standard Look wieder. Und jetzt haben"}, {"id": 421, "start": 4182.88, "end": 4190.16, "text": "wir auf einmal hier Icons und so, die wir vorher nicht hatten. Also ich muss sagen, Nord hat"}, {"id": 422, "start": 4190.16, "end": 4202.04, "text": "mir am besten gefallen bisher. Ja, oder? Nord sieht das gefällt mir am besten. Das sieht"}, {"id": 423, "start": 4202.04, "end": 4216.28, "text": "wieder am besten aus bisher. Oh, da werden zig Sachen umgemappt. Das können wir erstmal"}, {"id": 424, "start": 4216.28, "end": 4220.84, "text": "so lassen. So, was haben sie denn sonst noch hier? Was preisen sie denn sonst noch an?"}, {"id": 425, "start": 4220.84, "end": 4229.88, "text": "Nix. Das ist aber auch nicht schlecht, weil es funktioniert einfach. Also ich kann mich"}, {"id": 426, "start": 4229.88, "end": 4239.84, "text": "nicht beschweren. Ich finde das eigentlich ganz nett. Gibt auch Nordseam für Wim. Ok,"}, {"id": 427, "start": 4239.84, "end": 4249.48, "text": "das ist doch wirklich ganz nett. Guck mal, die ändern sogar die Default-Config. Jetbrains."}, {"id": 428, "start": 4249.48, "end": 4258.36, "text": "Nehmen wir das andere. Das ist doch echt ganz nett. Das ist ein stinknormales Ubuntu LTS"}, {"id": 429, "start": 4258.36, "end": 4265.4, "text": "mit recht gut vorkonfiguriertem i3. Man hat das Gnome-Zeug, wo man es braucht. Ich wüsste"}, {"id": 430, "start": 4265.4, "end": 4268.6, "text": "jetzt nicht genau, wo man es braucht, aber man hat es, wenn man es braucht. Man kann"}, {"id": 431, "start": 4268.6, "end": 4272.64, "text": "zum Beispiel Gnome-Settings und sowas verwenden, was unter einem normalen i3 ohne Gnome nicht"}, {"id": 432, "start": 4272.64, "end": 4280.8, "text": "funktioniert. Wenn man irgendwelche High-DPI Geschichten hat, kann man auch das Font-Scaling"}, {"id": 433, "start": 4280.8, "end": 4290.36, "text": "und Gedöns hoch machen, was wir jetzt bei mir nicht machen. Auflösung ändern muss"}, {"id": 434, "start": 4290.36, "end": 4299.04, "text": "ich jetzt natürlich nicht. Dann die ganzen Gnome-Settings dabei. Das finde ich echt"}, {"id": 435, "start": 4299.04, "end": 4305.8, "text": "ganz hübsch. Es ist ein stinknormales Ubuntu 2004 LTS, also sprich, an Software wird sich"}, {"id": 436, "start": 4305.8, "end": 4315.8, "text": "da nichts großartig unterscheiden. War VmTools vorinstalliert? Ja, VmTools war auch vorinstalliert."}, {"id": 437, "start": 4315.8, "end": 4329.72, "text": "Kuchenis kommt drauf an, was du machen willst. Also wenn du nichts brauchst, was nur unter"}, {"id": 438, "start": 4329.72, "end": 4338.24, "text": "Windows gut läuft, dann probier es aus. Wenn das Notebook ein bisschen älter ist, spricht"}, {"id": 439, "start": 4338.24, "end": 4344.88, "text": "auch meistens nichts dagegen, weil die Chance, wenn das Notebook ein bisschen älter ist,"}, {"id": 440, "start": 4344.88, "end": 4350.68, "text": "dass Linux gut drauf läuft, ist eigentlich recht hoch. Ich würde vorher mal gucken nach"}, {"id": 441, "start": 4350.68, "end": 4355.16, "text": "dem Modell in Kombination mit Linux, mal bei Google gucken, ob es da irgendwelche großen"}, {"id": 442, "start": 4355.16, "end": 4363.48, "text": "bekannten Probleme gibt. Wenn nicht, kannst du mal ausprobieren. Alternativ kannst du"}, {"id": 443, "start": 4363.48, "end": 4370.88, "text": "auch einfach Linux mal in der Vm Installation gucken. Aber nicht unbedingt auf dem Notebook"}, {"id": 444, "start": 4370.88, "end": 4379.52, "text": "da, ja. Das wäre auch ein nice Server-OS mit GUI, sagt das Ebaro. Mag sein, die Frage"}, {"id": 445, "start": 4379.52, "end": 4386.88, "text": "ist bloß, wozu brauche ich einen Server-OS mit GUI. Server-OS mit GUI brauchen bloß"}, {"id": 446, "start": 4386.88, "end": 4391.12, "text": "irgendwelche Windows-Leute, die denken, man bräuchte einen GUI, um Server zu administrieren."}, {"id": 447, "start": 4391.12, "end": 4399.32, "text": "Ich habe noch nie, als ernsthaft noch nie, irgendwo das Bedürfnis gehabt, wenn ich mich"}, {"id": 448, "start": 4399.32, "end": 4403.24, "text": "auf einen Server connectet habe zu sagen, oh ja, jetzt hätte ich mal gerne einen Desktop"}, {"id": 449, "start": 4403.24, "end": 4408.4, "text": "auf dem Server. Weil die ganze Sache unter Linux ist da drauf ausgelegt, dass du es mit"}, {"id": 450, "start": 4408.4, "end": 4416.88, "text": "der Konsole bedienen kannst. Du brauchst keine GUI. Das einzige, wo es sinnvoll ist, manchmal"}, {"id": 451, "start": 4416.88, "end": 4425.72, "text": "ist sich per X-Forwarding einen Browser zu holen, um zu gucken, ob der Server irgendwo"}, {"id": 452, "start": 4425.72, "end": 4429.8, "text": "hin kann und ob alles funktioniert. Also per X-Forwarding einen Browser ist teilweise"}, {"id": 453, "start": 4429.8, "end": 4443.36, "text": "mal ganz nützlich. Aber irgendwo muss man auch hin mit der ganzen Performance. Die können"}, {"id": 454, "start": 4443.36, "end": 4452.64, "text": "auch einfach rum eilen, das stört die Kisten ja nicht. Also es gibt jetzt hier wirklich"}, {"id": 455, "start": 4452.64, "end": 4458.2, "text": "wenig zu gucken. X-Forwarding ist das Beste, wenn man einfach nur kurz was testen muss."}, {"id": 456, "start": 4458.2, "end": 4463.52, "text": "Dafür muss man nämlich nichts installieren. Wenn man einfach nur kurz gucken will, ob"}, {"id": 457, "start": 4463.52, "end": 4467.36, "text": "irgendwas funktioniert, ist X-Forwarding das Beste. Es ist nicht schnell, aber um mal"}, {"id": 458, "start": 4467.36, "end": 4472.28, "text": "kurz einen Browser zu starten und Google aufzumachen, reicht es. Ich will ja nicht"}, {"id": 459, "start": 4472.28, "end": 4475.88, "text": "erstmal irgendwie einen RDP konfigurieren müssen oder sonst was. Da ist X-Forwarding"}, {"id": 460, "start": 4475.88, "end": 4480.2, "text": "schon nicht übel. Und am besten ist man macht bei X-Forwarding gleich die SSH-Compression"}, {"id": 461, "start": 4480.2, "end": 4487.04, "text": "an, dann ist es auch noch ein bisschen schneller. TrueMorphoise, ich auch, aber ich glaube,"}, {"id": 462, "start": 4487.04, "end": 4493.72, "text": "das wird in nächster Zeit nix. Voll verkackt. Ja, mehr gibt es da wirklich gar nicht bei"}, {"id": 463, "start": 4493.72, "end": 4498.12, "text": "der Linux-Distribution gar nicht großartig auszuprobieren. Es funktioniert, was sie"}, {"id": 464, "start": 4498.12, "end": 4505.0, "text": "versprechen funktioniert, das ist ja auch schon mal was. Es ist ein Ubuntu-LTS mit Gnome,"}, {"id": 465, "start": 4505.0, "end": 4518.04, "text": "und i3 drinne läuft. Ordentlich vorkonfiguriert und gut ist. Ist doch echt nicht schlecht."}, {"id": 466, "start": 4518.04, "end": 4524.44, "text": "Achja, wofür SSH-Forwarding manchmal auch noch gut ist, sind, weil es gerade im Chat"}, {"id": 467, "start": 4524.44, "end": 4534.84, "text": "steht, sind manchmal irgendwelche Installer, die es gerne grafisch haben. Midnight-Commander,"}, {"id": 468, "start": 4534.84, "end": 4543.72, "text": "das ist ja Konsolen-GUI, das passt schon. Aber selbst das mache ich nicht. Ich bin da"}, {"id": 469, "start": 4543.72, "end": 4550.28, "text": "nie warm mitgeworden mit irgendwelchen Kommandozeilen, Filemanagern, ich mach das ganz normal. CDRMLS"}, {"id": 470, "start": 4550.28, "end": 4563.8, "text": "reicht. Ja, jetzt gucken wir mal, ob ich irgendwelche Fragen übersehen habe. Was wäre in dein"}, {"id": 471, "start": 4563.8, "end": 4575.48, "text": "Traumauto? Gar keins. Mein Traum wäre, dass ich kein Auto brauche. Aber alternativ könnte"}, {"id": 472, "start": 4575.48, "end": 4585.12, "text": "man auch die VM per Capture-Card im Host einspeisen. Ja, das würde funktionieren. Das könntest"}, {"id": 473, "start": 4585.12, "end": 4594.52, "text": "du machen, ja. Aber da hast du auf jeden Fall mehr Input-Lack, wie mit Looking Glass. Am"}, {"id": 474, "start": 4594.52, "end": 4603.24, "text": "besten e-Monitor dran und gut ist. Das Schwierigste mit GPU-Pass-Through und VM-Werbespielen ist"}, {"id": 475, "start": 4603.24, "end": 4617.64, "text": "eh, dass du eine zweite Maus und Tastatur brauchst zum Durchreichen. Zwei Festplatten,"}, {"id": 476, "start": 4617.64, "end": 4624.4, "text": "wo du hin und her schiebst. Was spricht gegen R-Sync und CP? R-Sync ist doch das beste für"}, {"id": 477, "start": 4624.4, "end": 4638.4, "text": "hin und her schieben. Kraft-VM-Switch kann man auch machen. Aber die meisten sind unnötig"}, {"id": 478, "start": 4638.4, "end": 4664.8, "text": "teuer. Also schön ist es nicht. So, das hatten wir. Hatten wir. Hast du schon einen EVE-Monitor"}, {"id": 479, "start": 4664.8, "end": 4677.68, "text": "gesehen? Nee, was ist das? EVE-Monitor? Spectrum New EVE. Crowdsourcing-Monitor, ob das was"}, {"id": 480, "start": 4677.68, "end": 4699.36, "text": "wird. EPS-Panel, das ist schon mal rein für Farbe und Blickwinkel ein Gewinn, wenn es"}, {"id": 481, "start": 4699.36, "end": 4709.88, "text": "aber auch mit Nachteilen daherkommt. Display HDR 400, das kommt mit hoch, wenn EPS. 240"}, {"id": 482, "start": 4709.88, "end": 4737.28, "text": "Hz. WQHD bei 240 Hz, ok, das ist ganz nice. Was wird's kosten am Ende? Kostet was? 599"}, {"id": 483, "start": 4737.28, "end": 4749.24, "text": "Euro, das ist echt günstig. Das ist für einen 4K. Wo steht's hier oben? Für einen"}, {"id": 484, "start": 4749.24, "end": 4756.16, "text": "4K mit 144 Hz ist das echt sehr günstig. Und auch für den WQHD 240 ist das echt günstig."}, {"id": 485, "start": 4756.16, "end": 4762.08, "text": "Wenn der Rest taugt, zumal es auch ein EPS-Panel ist, muss man mal vergleichen, muss man mal"}, {"id": 486, "start": 4762.08, "end": 4777.52, "text": "schauen, was das taugt, wenn's rauskommt. Wo gibt's denn das Crowd-Founding, das Kickstarter?"}, {"id": 487, "start": 4777.52, "end": 4804.72, "text": "Ja, da bin ich mal gespannt, was da rauskommt."}, {"id": 488, "start": 4804.72, "end": 4819.12, "text": "Ach, man konnte in der... Ach so, ok, es ist kein Crowd-Founding, es ist quasi mit Community"}, {"id": 489, "start": 4819.12, "end": 4828.04, "text": "einbeziehungsweise... Ach, das meinen die mit Crowd. Du konntest quasi an der Entwicklung"}, {"id": 490, "start": 4828.04, "end": 4834.24, "text": "dich beteiligen, wenn du sinnvolle Sachen gepostet hast. Ok, das ist ganz sinnig. Das"}, {"id": 491, "start": 4834.24, "end": 4839.52, "text": "sollten mehr machen. Allerdings, man kann ja nicht alles machen, was irgendein Typ im"}, {"id": 492, "start": 4839.52, "end": 4844.4, "text": "Forum schreibt. Deswegen ist es trotzdem wichtig, dass du noch Leute hast, die da eine Übersicht"}, {"id": 493, "start": 4844.4, "end": 4849.92, "text": "haben. Aber ich finde, manche Sachen werden echt komplett an der Community vorbei entwickelt."}, {"id": 494, "start": 4849.92, "end": 4855.04, "text": "Guckt euch Battlefield 5 an. Battlefield 5 war komplett an dem vorbei, was die Leute"}, {"id": 495, "start": 4855.04, "end": 4860.48, "text": "wollen. Von Anfang an, vom ersten Reveal-Trailer bis zum Einstellen des Spiels war Battlefield"}, {"id": 496, "start": 4860.48, "end": 4865.44, "text": "5 komplett vorbei. Der einzige Lichtblick zwischendurch war mal das Pacific-Update,"}, {"id": 497, "start": 4865.44, "end": 4869.4, "text": "wo die Leute gesagt haben, ah ja, ist doch ganz nett. Aber ansonsten war Battlefield"}, {"id": 498, "start": 4869.4, "end": 4877.36, "text": "5 komplett an den Leuten vorbei. Mein Handy sagt, ich habe jetzt Teambesprechung. Das"}, {"id": 499, "start": 4877.36, "end": 4882.12, "text": "glaube ich nicht, dass ich heute Teambesprechung habe. Ja, Battlefield 3 Remake Incoming habe"}, {"id": 500, "start": 4882.12, "end": 4888.56, "text": "ich schon gesehen. Battlefield 3 Remake ist, glaube ich, nur ein Schachzug von EA, den"}, {"id": 501, "start": 4888.56, "end": 4894.48, "text": "Battlefield 5 Fail zu kaschieren, bis Battlefield 6 rauskommt. Battlefield 3 mal ehrlich gesagt"}, {"id": 502, "start": 4894.48, "end": 4902.08, "text": "braucht kein Remake. Battlefield 3 sieht immer noch gut aus. Battlefield 3 spielt immer noch"}, {"id": 503, "start": 4902.08, "end": 4908.44, "text": "gut. Spielt sich auch gut. Das Einzige, was ein Battlefield 3 Remake bringen würde, ist,"}, {"id": 504, "start": 4908.44, "end": 4914.04, "text": "dass es das für die neue Konsolengeneration krippt, was schon mal huge Playerbase mehr"}, {"id": 505, "start": 4914.04, "end": 4919.88, "text": "hat. Und dass es ein bisschen neuer ist und wieder in den Köpfen der Leute ankommt und"}, {"id": 506, "start": 4919.88, "end": 4925.12, "text": "mehr Leute spielen. Dazu wäre ein Remake eigentlich nicht nötig, aber dadurch, dass"}, {"id": 507, "start": 4925.12, "end": 4931.64, "text": "wieder ein bisschen mehr Fokus der Leute drauf fällt, wird es auch wieder mehr Spieler haben."}, {"id": 508, "start": 4931.64, "end": 4936.04, "text": "Also, ich gehe mal stark von aus, wenn das rauskommt, werde ich spielen. Auf Battlefield"}, {"id": 509, "start": 4936.04, "end": 4945.68, "text": "3 hätte ich echt Bock mal wieder. Das kommt dann wahrscheinlich Ende des Jahres oder wann,"}, {"id": 510, "start": 4945.68, "end": 4973.6, "text": "die Musik hier. Excellent. Was geht da ab? Okay. Ja, das war in 2013. Wen juckt's?"}, {"id": 511, "start": 4973.6, "end": 4992.8, "text": "Alter, die Musik. Klar kannst du es jetzt ausspielen. Aber die meisten Leute kaufen"}, {"id": 512, "start": 4992.8, "end": 4996.96, "text": "lieber was Neues für die neue Konsolengeneration, was dann auch ein bisschen besser aussieht"}, {"id": 513, "start": 4996.96, "end": 5001.32, "text": "als ein Spiel für eine 2 Jahre alt oder für ein Jahr alte, nein nicht ein Jahr, für"}, {"id": 514, "start": 5001.32, "end": 5013.6, "text": "eine Generation hinten dran, um es dann auf der neuen zu spielen. Ja, ich bin, na, war"}, {"id": 515, "start": 5013.6, "end": 5022.12, "text": "ich gespannt, also. Sie müssen es eigentlich dieses Jahr rausbringen. Eigentlich müssen"}, {"id": 516, "start": 5022.12, "end": 5027.48, "text": "sie es dieses Jahr rausbringen bzw. Anfang nächsten Jahres, weil Battlefield 5 ist vorbei"}, {"id": 517, "start": 5027.48, "end": 5031.28, "text": "und irgendwas müssen sie ja machen, bis Battlefield 6 rauskommt. Es bleibt ja gar nichts an der"}, {"id": 518, "start": 5031.28, "end": 5045.88, "text": "Seite übrig. Irgendwas müssen sie ja treiben. Irgendwas muss ja passieren. Wollen wir wetten"}, {"id": 519, "start": 5045.88, "end": 5054.04, "text": "abschließen, dass EA völlig verkackt? Die Chancen sind hoch. Wenn es zusammen mit dem"}, {"id": 520, "start": 5054.04, "end": 5060.4, "text": "neuen Battlefield kommt, dann ist es irgendwie wäre sehr merkwürdig. Weil warum sollten"}, {"id": 521, "start": 5060.4, "end": 5064.68, "text": "sie das machen? Warum sollten sie sich selbst Konkurrenz machen bei einem neuen Battlefield"}, {"id": 522, "start": 5064.68, "end": 5090.32, "text": "Release? Ich habe kein Auto login aktiviert. Ich habe vor ein paar Sachen auf einem V-Server"}, {"id": 523, "start": 5090.32, "end": 5094.28, "text": "zu hausten, möchte das aber nur über einen VPN erreichbar machen, nicht über das Internet"}, {"id": 524, "start": 5094.28, "end": 5098.2, "text": "direkt. Quasi so eine Art Intranet. Hast du da eine Ahnung, wie ich das am besten mache?"}, {"id": 525, "start": 5098.2, "end": 5103.16, "text": "Ja, OpenVPN oder WireGuard. Allerdings, übers Internet erreichbar muss ja zumindest"}, {"id": 526, "start": 5103.16, "end": 5107.24, "text": "mal der VPN-Port sein. Sonst funktioniert es ja logischerweise nicht. Du musst ja über"}, {"id": 527, "start": 5107.24, "end": 5114.28, "text": "das Internet irgendwie hinkommen. Ich meine, du kannst alles dicht machen und nur den VPN-Port"}, {"id": 528, "start": 5114.28, "end": 5128.52, "text": "auflassen. Das geht. Das ist eigentlich kein Problem. Portnok? Ja, das geht auch. Aber"}, {"id": 529, "start": 5128.52, "end": 5133.04, "text": "dann brauchst du einen Kleinen, der das unterstützt. Ich weiß nicht, wie das mit den Mobile-Geschichten"}, {"id": 530, "start": 5133.04, "end": 5157.36, "text": "aussieht. Wird der einfach mit der Musik der Winterkund eigentlich ab? Exzellent. Also"}, {"id": 531, "start": 5157.36, "end": 5166.36, "text": "ich würde alles dicht machen. Vielleicht den VPN-Port auf einen anderen Port noch umlegen"}, {"id": 532, "start": 5166.36, "end": 5174.96, "text": "oder irgendwas 25.123 oder irgendwas nehmen. Am besten WireGuard, weil es einfacher zu"}, {"id": 533, "start": 5174.96, "end": 5201.64, "text": "handeln ist, vor allem im Setup wie OpenVPN. Und dann ist gut. Aber wenn du einfach nur"}, {"id": 534, "start": 5201.64, "end": 5209.36, "text": "Authentifizierung davor haben willst, was spricht dagegen, alle Ports zuzumachen und"}, {"id": 535, "start": 5209.36, "end": 5215.04, "text": "den Reverse-Proxy davor zu setzen, der irgendeine Art von Authentifizierung vorher macht, dann"}, {"id": 536, "start": 5215.04, "end": 5221.24, "text": "brauchst du den ganzen VPN-Kram nicht. Machst du Caddy oder Traffic oder Nginx oder irgendwas"}, {"id": 537, "start": 5221.24, "end": 5228.08, "text": "davor, im Zweifelsfall auch erstmal nur mit Basic-Auth und schon hast du die Sache erstmal"}, {"id": 538, "start": 5228.08, "end": 5232.48, "text": "so weit abgesichert, dass keiner einfach drauf zugreifen kann und du brauchst dich nicht"}, {"id": 539, "start": 5232.48, "end": 5242.52, "text": "auseinandersetzen mit irgendwelchen VPN-Getunneln. Aber mag ja sein, dass es da Anwendungszwecke"}, {"id": 540, "start": 5242.52, "end": 5252.44, "text": "für gibt. Hast du ein Wireless-Keyboard? Ne. Ich hab nur eine Wireless-Maus, kein Wireless-Keyboard."}, {"id": 541, "start": 5252.44, "end": 5261.2, "text": "Tastatur ist per Kabel angeschlossen. Maus ist Wireless. Mit einem Charging-Maus-Pad."}, {"id": 542, "start": 5261.2, "end": 5271.52, "text": "Port 1337. Ja, aber der wird garantiert immer mit gescannt, auch wenn er über 1024 ist,"}, {"id": 543, "start": 5271.52, "end": 5276.84, "text": "weil die coole Leute Port 1337 verwenden. Was ist eigentlich Port 1337 standardmäßig?"}, {"id": 544, "start": 5276.84, "end": 5298.28, "text": "Port 1337. DNS. Power-Folder. Und Waste. Was ist denn Waste? P2P-File-Sharing-Programm."}, {"id": 545, "start": 5298.28, "end": 5308.64, "text": "Ah ja. Alles klar. Und warum verwendet ein DNS bitte schön Port 1337? Was ist das für"}, {"id": 546, "start": 5308.64, "end": 5319.52, "text": "ein bescheuerter DNS? Hab ich noch nie was von gehört. Was ist das? Professional IP-Address-Management."}, {"id": 547, "start": 5319.52, "end": 5334.44, "text": "Okay, das ist so professional, dass es Port 1337 verwendet. Alles klar. Weißt du zufällig"}, {"id": 548, "start": 5334.44, "end": 5340.88, "text": "ob GPU-Pastru auch auf Windows-Hosts funktioniert? Auf Windows-Hosts? Nein, Windows-Hosts funktioniert"}, {"id": 549, "start": 5340.88, "end": 5347.84, "text": "es nicht. Also Windows-Server-Hosts geht es wohl mit Hyper-V halbwegs, aber nicht auf"}, {"id": 550, "start": 5347.84, "end": 5353.84, "text": "einem normalen Windows-Host. Also ich könnte jetzt nicht, ich könnte jetzt nicht hier auf"}, {"id": 551, "start": 5353.84, "end": 5363.24, "text": "meinem Windows 10 irgendwie GPU-Pastru machen. Ich will nicht ausschließen, dass es da irgendwelche"}, {"id": 552, "start": 5363.24, "end": 5368.12, "text": "experimentellen Hacks gibt, dass es vielleicht doch irgendwie geht, aber standardmäßig"}, {"id": 553, "start": 5368.12, "end": 5377.24, "text": "geht es nicht. Was sagst du zu NordVPN? Eigentlich komplett überflüssig. Einzige Sache ist"}, {"id": 554, "start": 5377.24, "end": 5383.56, "text": "halt, wenn man zum Beispiel langsam ein Download hat, jetzt Battle.net, irgendein neues Update"}, {"id": 555, "start": 5383.56, "end": 5388.68, "text": "und mal kurz so tun möchte, als kommt man aus Südkorea und lädt vom Asia-Server, dann"}, {"id": 556, "start": 5388.68, "end": 5395.6, "text": "bringt es vielleicht was, aber ansonsten ist NordVPN bzw. die ganzen VPN-Services komplett"}, {"id": 557, "start": 5395.6, "end": 5414.52, "text": "useless und überflüssig. Wie gesagt, geht nicht. Bist du ab und zu noch auf Kickstarter"}, {"id": 558, "start": 5414.52, "end": 5423.44, "text": "unterwegs? Ja, trotz dem Hosenscam. 120 Euro oder so, aber das ist ja klar, wenn man Kickstarter"}, {"id": 559, "start": 5423.44, "end": 5430.8, "text": "backt, muss einem klar sein, dass man ab und zu mal gescampt wird. Wirst du die neue Playstation"}, {"id": 560, "start": 5430.8, "end": 5435.64, "text": "holen? Irgendwann wahrscheinlich, aber diesmal eher nicht zu Release. Ich habe mir die letzten"}, {"id": 561, "start": 5435.64, "end": 5444.2, "text": "Konsolengeneration direkt zu Release geholt und nicht benutzt. Also insofern lohnt sich"}, {"id": 562, "start": 5444.2, "end": 5457.16, "text": "nicht. Kelmore sagt, 3D-Drucker gebackt auf Kickstarter, dann kam es nie an. Ja, feels"}, {"id": 563, "start": 5457.16, "end": 5474.92, "text": "Batman. Haben die einen Preis? Nein, die haben keinen Preis verraten bei der Playstation."}, {"id": 564, "start": 5474.92, "end": 5481.12, "text": "Ja, das hatten wir jetzt auch schon. Ja, nice. Exzellent. Guck mal, wir sind erst eineinhalb"}, {"id": 565, "start": 5481.12, "end": 5486.16, "text": "Stunden on, was ist da los? Und ich habe noch 20 Minuten Zeit, bis mein Essen kommt. War"}, {"id": 566, "start": 5486.16, "end": 5498.6, "text": "man da? Die PS5 soll wohl angeblich 4,99 kosten. Ja, mal gucken, was da rauskommt, mir egal."}, {"id": 567, "start": 5498.6, "end": 5507.88, "text": "Juckt mich nicht, ich kaufe es mir zum Release nicht. Ich warte, bis das sich lohnt, was"}, {"id": 568, "start": 5507.88, "end": 5512.16, "text": "es an Spielen gibt. Es gibt überhaupt keinen Grund mehr. Mittlerweile ja sogar so, wenn"}, {"id": 569, "start": 5512.16, "end": 5518.08, "text": "du so blöd bist und kaufst dir das ganze zu Release und es kommen erst 2-3 Jahre später"}, {"id": 570, "start": 5518.08, "end": 5521.68, "text": "die richtig guten Spiele, die du spielen willst, dann sagt Sony, haha, es gibt jetzt wieder"}, {"id": 571, "start": 5521.68, "end": 5529.44, "text": "eine Pro. Du hast umsonst Geld ausgegeben zu Release. Ich glaube diesmal zwar nicht,"}, {"id": 572, "start": 5529.44, "end": 5535.4, "text": "dass sie wieder den gleichen Fehler machen, eine Pro rauszubringen. Schon hast 10 Jahre"}, {"id": 573, "start": 5535.4, "end": 5539.72, "text": "YouTube-Video von Inscope gesehen. Ne, bin ich dabei? Wahrscheinlich nicht, aber der"}, {"id": 574, "start": 5539.72, "end": 5548.0, "text": "Boom ist dabei, habe ich gehört. Also ich glaube nicht, dass sie nochmal das rausbringen"}, {"id": 575, "start": 5548.0, "end": 5554.36, "text": "werden mit einer Pro-Variante, die ist ja leistungsfähig genug, wenn es neu ist, von"}, {"id": 576, "start": 5554.36, "end": 5564.08, "text": "der Hardware her, diesmal im Vergleich zur PS4. Aber ich traue Sony nicht und es hat"}, {"id": 577, "start": 5564.08, "end": 5576.92, "text": "keinen Sinn. Wenn es einen Sommergartenstädts geben, gab es sogar schon vor ein paar Jahren."}, {"id": 578, "start": 5576.92, "end": 5588.96, "text": "Dass das wieder ein Big Brain-Thema gibt, ist das perfekte Bierglas. Es gibt kaum was,"}, {"id": 579, "start": 5588.96, "end": 5605.28, "text": "was mir mehr egal sein könnte. Ja, Big Brain-Thema wieder. Sehr möglich. Ja, kann sein, aber"}, {"id": 580, "start": 5605.28, "end": 5611.6, "text": "es wäre ziemlich bescheuert, das wieder mit der Pro zu machen. Ich finde, das hat der"}, {"id": 581, "start": 5611.6, "end": 5617.72, "text": "aktuellen Konsolengeneration mehr geschadet, als das, was es gebracht hat. Leider war halt"}, {"id": 582, "start": 5617.72, "end": 5622.88, "text": "die aktuelle Konsolengeneration komplett für den Arsch von der Hardware, als sie rausgekommen"}, {"id": 583, "start": 5622.88, "end": 5628.72, "text": "ist. Die neue ist da jetzt eine ganze Ecke besser aufgestellt. Leberkäs selber machen"}, {"id": 584, "start": 5628.72, "end": 5634.04, "text": "ohne Equipment. Oh, das trägt ja die ganzen Veganer wieder. Das können wir uns jetzt"}, {"id": 585, "start": 5634.04, "end": 5647.0, "text": "nicht angucken. 500 Megahertz, 5000 Megahertz Ramtakt, war komplizierter als gedacht. Ja"}, {"id": 586, "start": 5647.0, "end": 5657.64, "text": "und wahrscheinlich bringt es auch weniger als gedacht. Was genau passiert hier? Ah,"}, {"id": 587, "start": 5657.64, "end": 5664.96, "text": "ich dachte, die Katze spielt Klavier. Half-Life in 2041, da haben wir schon jede Menge Runs"}, {"id": 588, "start": 5664.96, "end": 5671.68, "text": "jetzt geguckt. Da kennen wir uns jetzt aus. Was tun Hacker eigentlich? Das haben wir auch"}, {"id": 589, "start": 5671.68, "end": 5687.0, "text": "schon geguckt, glaube ich. Das haben wir, glaube ich, schon geguckt. Wie heißt nochmal"}, {"id": 590, "start": 5687.0, "end": 5692.08, "text": "der Channel, den ich immer gucke? Hier, das da, Barbecue Pit Boys, die gucke ich immer."}, {"id": 591, "start": 5692.08, "end": 5712.96, "text": "Oh yeah, das ist immer die gleichen Sounds. Was Dick? Nee, Dickens. Crispy Pork Belly."}, {"id": 592, "start": 5712.96, "end": 5718.36, "text": "Kennst du das Interview mit dem BND Hacker? Nee. BND Hacker Interview, nee, das kenne"}, {"id": 593, "start": 5718.36, "end": 5735.12, "text": "ich nicht. Was? Hacker beim Geheimdienst im Interview. Das, das, ich glaube, das tut"}, {"id": 594, "start": 5735.12, "end": 5758.0, "text": "weh. Ach nee, oder? Genug ge-Cringe heute schon. Warum gibt es da eigentlich mehrere,"}, {"id": 595, "start": 5758.0, "end": 5765.56, "text": "mehrere Videos? Der Schlaumacher, geniale Fakten, Tipps und Lifehacks. Was ein scheiß"}, {"id": 596, "start": 5765.56, "end": 5773.84, "text": "Channelname, Alter. Eigentlich ist das der exakt der heutigen Zeit angemessene Big Brain"}, {"id": 597, "start": 5773.84, "end": 5798.36, "text": "Channelname, ja. Aber ich finde das übelst fail, der Schlaumacher. Eigentlich warte ich"}, {"id": 598, "start": 5798.36, "end": 5805.0, "text": "ja nur auf mein Essen, ne? Eigentlich warte ich nur bis mein Essen kommt. Ich dachte eigentlich,"}, {"id": 599, "start": 5805.0, "end": 5809.28, "text": "wir brauchen länger hierfür. Sonst hätte ich nämlich schon auf 13 Uhr bestellt, anstatt"}, {"id": 600, "start": 5809.28, "end": 5828.36, "text": "13.15. Jetzt gucken wir uns am Sonntag an. Der Leberkiss Typ ist Wiener. Die Videos sind"}, {"id": 601, "start": 5828.36, "end": 5836.44, "text": "schon allein, deswegen, er macht ein Burger für 1 Euro. Kann ein Burger für 1 Euro machen,"}, {"id": 602, "start": 5836.44, "end": 5853.92, "text": "der was taugt? Was hältst du vom Pinephone? Hatten wir uns irgendwann mal angeguckt, hat"}, {"id": 603, "start": 5853.92, "end": 5859.32, "text": "mich jetzt nicht so wahnsinnig geschockt. Falls das das war, was wir uns mal angeschaut"}, {"id": 604, "start": 5859.32, "end": 5863.44, "text": "haben. Ja, nö, nö, hat mich überhaupt nicht geschockt. Da kommt auch nichts Gescheites"}, {"id": 605, "start": 5863.44, "end": 5871.4, "text": "bei rum, ganz ehrlich. Da kommt nichts Gescheites bei rum. Der Zug bei Smartphones ist erstmal"}, {"id": 606, "start": 5871.4, "end": 5881.36, "text": "abgefahren mit IOS und Android. Wenn da jetzt nicht irgendwie einer auf die wahnsinnige"}, {"id": 607, "start": 5881.36, "end": 5885.84, "text": "Massive Brain Idee kommt, wo vorher noch keiner gekommen ist, wird sich da nichts anderes"}, {"id": 608, "start": 5885.84, "end": 5890.92, "text": "in nächster Zeit etablieren. Guck mal, ich meine sogar Windows Phone ist abgeschissen"}, {"id": 609, "start": 5890.92, "end": 5896.68, "text": "und es ist nicht so, als hätte Microsoft zu wenig Geld. Übrigens, dem ganzen Windows"}, {"id": 610, "start": 5896.68, "end": 5901.4, "text": "Phone Gedöns haben wir mit zu verdanken, dass es diesen ganzen UWP Crap überhaupt gibt."}, {"id": 611, "start": 5901.4, "end": 5908.2, "text": "Wo ich gerade deinen PP-Gabot sehe, bis zu Fitment Next lauten, könntest du mir bei"}, {"id": 612, "start": 5908.2, "end": 5915.04, "text": "folgendem Problem helfen. Was, könntest du mir bei folgendem Problem lesen? Ich will"}, {"id": 613, "start": 5915.04, "end": 5921.16, "text": "auf 18.06 updaten, aber es kommt nur Step 3. Nee, keine Ahnung. Ich müsste mein Next"}, {"id": 614, "start": 5921.16, "end": 5931.4, "text": "Cloud auch mal upgraden. Nee, keine Ahnung. Next Cloud buggt aber ganz gerne mal rum,"}, {"id": 615, "start": 5931.4, "end": 5936.08, "text": "deswegen finde ich es mittlerweile ganz gut, das im Container laufen zu lassen. Da kann"}, {"id": 616, "start": 5936.08, "end": 5941.48, "text": "man nämlich recht einfach downgraden, wenn man sich das Verzeichnis vorher kopiert,"}, {"id": 617, "start": 5941.48, "end": 5958.64, "text": "also ohne die Daten drin. Tjo. Leute, ich kann nix mehr, was ich großartig machen kann"}, {"id": 618, "start": 5958.64, "end": 5968.36, "text": "im Stream. Warum ist RTL eigentlich so schlecht? Ist mir egal, ich guck's einfach nicht, das"}, {"id": 619, "start": 5968.36, "end": 5973.4, "text": "ist das Schlimmste, was man für sie machen kann. Das beschissenste für generell alle,"}, {"id": 620, "start": 5973.4, "end": 5978.32, "text": "die irgendwie relevant sein wollen, ist, sich nicht darüber zu wundern, warum sie so schlecht"}, {"id": 621, "start": 5978.32, "end": 5981.44, "text": "sind, sondern einfach nicht mehr zu gucken. Das ist das Schlimmste, was denen passieren"}, {"id": 622, "start": 5981.44, "end": 5994.64, "text": "kann. Wenn dir einfach keiner mehr guckt, ist vorbei. Smashed Burger. Okay, das gucken"}, {"id": 623, "start": 5994.64, "end": 6001.4, "text": "wir uns jetzt noch an. Natürlich kann ich an drei... Natürlich, ja. Da hörst du gleich,"}, {"id": 624, "start": 6001.4, "end": 6007.52, "text": "dass es Wiener ist. Natürlich kann ich einen dreifingerdicken, medium gebratenen Pappstyle"}, {"id": 625, "start": 6007.52, "end": 6013.76, "text": "Burger Patty mit handgepflückten San Marzano Flaschentomaten am Roggen, Sauerteig Burger"}, {"id": 626, "start": 6013.76, "end": 6018.96, "text": "Bun, Trüffeleioli und Käse von serbischen Bergeiseln machen. Exzellent. Moment, das"}, {"id": 627, "start": 6018.96, "end": 6029.04, "text": "ist gar nicht so schlecht, das schreib ich mir auf. Bergeiseln. Der Burger ist viel zu"}, {"id": 628, "start": 6029.04, "end": 6036.84, "text": "klein. Wenn man das mal mit den BBQ Pit Boys Burger vergleicht, der muss mindestens fünfmal"}, {"id": 629, "start": 6036.84, "end": 6040.92, "text": "so groß sein. Der darf gerade so in die Pfanne passen, dann ist es die richtige Größe."}, {"id": 630, "start": 6040.92, "end": 6051.64, "text": "Und auch nicht so dünn sein, sondern der muss schon so 15 cm hoch sein. Also, richtiger"}, {"id": 631, "start": 6051.64, "end": 6059.48, "text": "Kokona Burger sieht anders aus. Aber wahrscheinlich schmeckt der hier besser. Die fülle andere"}, {"id": 632, "start": 6059.48, "end": 6065.68, "text": "fantastische und vor allem charakterstärke Gerichte. Charakterstarke Burger, das ist"}, {"id": 633, "start": 6065.68, "end": 6079.0, "text": "mal ein Wort. Ich hab Hunger, wo bleibt mein Essen? Epic Mealtime, klar, die kenn ich noch."}, {"id": 634, "start": 6079.0, "end": 6083.28, "text": "Ich weiß, dass es da wieder jetzt Videos gibt, aber das ist nicht mehr das, wie es mal, also"}, {"id": 635, "start": 6083.28, "end": 6087.08, "text": "früher hat mir das besser gefallen. Epic Mealtime, das waren die Bacon Strips Leute."}, {"id": 636, "start": 6087.08, "end": 6090.84, "text": "Bacon Strips, Bacon Strips, Bacon Strips. Ja, die machen wieder was, aber das ist nicht"}, {"id": 637, "start": 6090.84, "end": 6098.12, "text": "mal so doller. Bacon Strips, Bacon Strips. Das war auch mit Muscle Classes, der Typ, der"}, {"id": 638, "start": 6098.12, "end": 6104.4, "text": "mit der Sonnenbrille und den Muckis. Bacon Strips, Bacon Strips. Das war so in der Zeit"}, {"id": 639, "start": 6104.4, "end": 6107.04, "text": "relevant, wo man auch Quickscope Montages geguckt hat."}, {"id": 640, "start": 6107.04, "end": 6115.24, "text": "Damit ihr jetzt nicht nur seht, wie Fleisch in einer Pfanne zerdrückt, gibt es zusätzlich"}, {"id": 641, "start": 6115.24, "end": 6120.16, "text": "noch das Rezept für die Potato Buns. Also für die Kartoffelbrötchen, die ein wichtiger"}, {"id": 642, "start": 6120.16, "end": 6124.68, "text": "Teil im Smash Burger, aber fast in keinem Rezept zu finden sind. Derzeit verschwende"}, {"id": 643, "start": 6124.68, "end": 6130.4, "text": "ich gerade kostbaren Strom und meine eigene Zeit dafür Kartoffeln zu kochen, was ziemlich"}, {"id": 644, "start": 6130.4, "end": 6135.36, "text": "dumm ist. Normalerweise verwendet man dafür übergebliebenes Kartoffelpüree oder gekochte"}, {"id": 645, "start": 6135.36, "end": 6139.68, "text": "Kartoffeln vom Vortag. Ja, dafür kann ich ein Video von machen. Da man ja schon mittlerweile"}, {"id": 646, "start": 6139.68, "end": 6144.84, "text": "weiß, dass mein Erzfeind die Waage ist, gibt es da eine Variante, wie man es ohne machen"}, {"id": 647, "start": 6144.84, "end": 6153.92, "text": "kann. Leicht zu merken, auf einen Teil Kartoffel kommt ein Teil Mehl. Also ich brauch die Angaben"}, {"id": 648, "start": 6153.92, "end": 6163.68, "text": "ehrlich gesagt in ounces. Ich brauch NA Einheiten, sonst kann ich keine Burger machen. In ounces"}, {"id": 649, "start": 6163.68, "end": 6176.0, "text": "und feet und sowas brauche ich das. Fuss. Burger nur echt mit Kokonaeinheit."}, {"id": 650, "start": 6176.0, "end": 6190.12, "text": "So kriegt es ja ohne Messen einen super schönen Kartoffelteig zusammen. Ich nehme da jetzt"}, {"id": 651, "start": 6190.12, "end": 6198.84, "text": "noch einen Esslöffel Salz und zwei Esslöffel Zucker. Ounces, ounces, bitteschön. Was ist"}, {"id": 652, "start": 6198.84, "end": 6204.88, "text": "eigentlich das Ami-Äquivalent zu Teelöffel? Das ist ja schon eine ziemlich bescheuerte"}, {"id": 653, "start": 6204.88, "end": 6212.68, "text": "Einheit. Haben die auch sowas? Tablespoon sagen die, oder? Nee, Tablespoon ist Esslöffel."}, {"id": 654, "start": 6212.68, "end": 6226.6, "text": "Was ist denn Teelöffel? Teaspoon? Sagen die Teaspoon? Echt? Habe ich noch nie gehört."}, {"id": 655, "start": 6226.6, "end": 6231.64, "text": "Wahrscheinlich weil ich nur Ami-Kochvideos gucke, die irgendwie alles unter 5 Kilo Fleisch"}, {"id": 656, "start": 6231.64, "end": 6237.44, "text": "nichts machen. Klar. Nach circa 7 Minuten ist der Teig dann so weit, dass ich zum letzten"}, {"id": 657, "start": 6237.44, "end": 6243.24, "text": "Schritt kommen kann. Und zwar zwei Esslöffel zimmerwarmer Butter. Die mixen wir dann noch"}, {"id": 658, "start": 6243.24, "end": 6248.0, "text": "ganz langsam in den Teig hinein und dann ist er auch schon fertig. Stellt ihn abgedeckt"}, {"id": 659, "start": 6248.0, "end": 6252.68, "text": "an einem warmen Ort, bis er doppelt so groß ist. Die Gehzeit variiert stark. Bei mir hat es"}, {"id": 660, "start": 6252.68, "end": 6257.72, "text": "eineinhalb Stunden gedauert. Lasst ihr ihm die Luft aus und bringt ihn zu einem Backblech"}, {"id": 661, "start": 6257.72, "end": 6263.16, "text": "mit einem Backpapier drauf. Nehmt euch die Zeit und formt jetzt so viele Teigkügelchen,"}, {"id": 662, "start": 6263.16, "end": 6268.54, "text": "wie sie aus der Menge Teig, die ihr gemacht habt, ausgehen. Ja Rico, habe ich auch schon"}, {"id": 663, "start": 6268.54, "end": 6280.68, "text": "mal geguckt. Was schauen wir da? Smashed Burger. Shake Shack Style. Alles klar. Und eigentlich"}, {"id": 664, "start": 6280.68, "end": 6289.32, "text": "warte ich nur drauf, bis mein Döner Teller kommt. Wir brauchen jetzt noch ein verquältes"}, {"id": 665, "start": 6289.32, "end": 6295.68, "text": "Ei, das wir dann auf unsere Burgerbrötchen draufpinseln. Und dann geht es bei 150°C"}, {"id": 666, "start": 6295.68, "end": 6300.88, "text": "für 30 Minuten in den Ofen. Anschluss noch für Geschmack und Glanz mit Butter bestreichen."}, {"id": 667, "start": 6300.88, "end": 6305.2, "text": "Das könnte man auch so essen, oder? Das sieht auch so nicht schlecht aus."}, {"id": 668, "start": 6305.2, "end": 6310.6, "text": "Weißt du, warum es sich auszahlt, Burgerbrot selber zu machen? Und jetzt kommt das beste"}, {"id": 669, "start": 6310.6, "end": 6316.96, "text": "Equipment für Smashed Burger, eine Maurerkelle. Ehrlich, für 8€ der beste Fahnenländer,"}, {"id": 670, "start": 6316.96, "end": 6320.96, "text": "den man sich holen kann. Wir müssen aber auch noch kurz über das Fleisch reden. Ich würde"}, {"id": 671, "start": 6320.96, "end": 6325.8, "text": "jetzt keine großen Diskussionen entfachen, aber mir ist es auch wichtig, dass wir gutes"}, {"id": 672, "start": 6325.8, "end": 6329.84, "text": "Fleisch für unsere Burger verwenden. Weil ich glaube ich muss niemandem erklären, dass"}, {"id": 673, "start": 6329.84, "end": 6335.32, "text": "in einem Burger der Burger echt wichtig ist. Was viele nicht wissen, ist das bei uns in"}, {"id": 674, "start": 6335.32, "end": 6340.72, "text": "den Supermärkten unter dem Namen Koch und Siedelfleisch viele verschiedene Teile verkauft"}, {"id": 675, "start": 6340.72, "end": 6348.88, "text": "werden. Unter anderem gehört da die Rinderbrust dazu. Ich hab noch nie was gesehen im Supermarkt,"}, {"id": 676, "start": 6348.88, "end": 6353.96, "text": "Koch und Siedelfleisch. Aber ich bin ja auch zu Koch-Noob dafür wahrscheinlich. Also"}, {"id": 677, "start": 6353.96, "end": 6360.56, "text": "das Brisket, wie man in Amerika sagt, die ausgelöste Zwerchrippe oder auch Boneless"}, {"id": 678, "start": 6360.56, "end": 6365.84, "text": "Short Rib und auch hin und wieder als Gulaschmeischen. Die ausgelöste Zwerchrippe, meine Güte,"}, {"id": 679, "start": 6365.84, "end": 6371.88, "text": "es gibt aber hier die wirklich Big Brain Bezeichnung. Für mich ist das Hackfleisch, für mich ist"}, {"id": 680, "start": 6371.88, "end": 6378.92, "text": "das Hackfleisch. Der zum amerikanischen Chuck Cut dazugehört und der wird von den meisten"}, {"id": 681, "start": 6378.92, "end": 6384.24, "text": "Burger Restaurants für Smash Burger verwendet. Also geht es zum Fleischer oder zum Supermarkt"}, {"id": 682, "start": 6384.24, "end": 6389.52, "text": "eures Vertrauens mit Fleischtheke. Fragt ob es gerade Rinderholz da haben, wenn ja,"}, {"id": 683, "start": 6389.52, "end": 6394.72, "text": "sie sollen den euch bitte verschieben. So, aber jetzt zahlen wir mal unsere Fleischkügelchen."}, {"id": 684, "start": 6394.72, "end": 6398.24, "text": "Wir brauchen nur mal an Seiten gesalzen und spart es nicht mit dem Salz."}, {"id": 685, "start": 6398.24, "end": 6404.0, "text": "Warnlich Salz. Das ist jetzt der richtige Zeitpunkt dafür. Wir brauchen eine Pfanne, die"}, {"id": 686, "start": 6404.0, "end": 6408.8, "text": "wirklich hohe Hitze aushält. Das da links unten ist nämlich kein Fünfer, das ist ein Neiner. Das"}, {"id": 687, "start": 6408.8, "end": 6413.52, "text": "heißt wir sind auf der höchsten Stufe, die Maillardplatten hergibt. Ich bevorzuge"}, {"id": 688, "start": 6413.52, "end": 6418.0, "text": "Guseisen, aber wenn ihr eine entsprechende andere Pfanne aus Edelstahl oder vielleicht sogar"}, {"id": 689, "start": 6418.0, "end": 6422.88, "text": "emellierte oder beschichtete habt, ist natürlich kein Problem die zu verwenden. Um den Strom den"}, {"id": 690, "start": 6422.88, "end": 6427.84, "text": "ich vorher verbraucht habe, wieder einer zum holen, nutze ich die Wärme, die die Pfanne zeigt während"}, {"id": 691, "start": 6427.84, "end": 6434.64, "text": "dem Hochheizen zum toasten meiner Burger Buns. Legt euer Fleischkügelchen in die brennhause Pfanne"}, {"id": 692, "start": 6434.64, "end": 6439.64, "text": "mit der schon gewürzten Seite nach unten und druckt es mit aller Kraft flach."}, {"id": 693, "start": 6439.64, "end": 6444.92, "text": "Zur Erleichterung und damit es schön gleichmäßig ist, habe ich mir zur Höfe ein Messergriff genommen."}, {"id": 694, "start": 6444.92, "end": 6449.52, "text": "Maurer Keller. Anschließend dürft ihr die andere Seite würzen und nach ca. eineinhalb Minuten"}, {"id": 695, "start": 6449.52, "end": 6456.12, "text": "Bratzeit ist es dann soweit. Wir nehmen die Kelle her und kratzen den Burger vom Boden runter."}, {"id": 696, "start": 6456.12, "end": 6461.12, "text": "Man glaubt, dass der Burger durch smashen an Flüssigkeit verliert, das stimmt aber nicht."}, {"id": 697, "start": 6461.12, "end": 6466.32, "text": "Er gewinnt was und zwar unglaublich gleichmäßige und geile Kruste."}, {"id": 698, "start": 6466.32, "end": 6472.44, "text": "Die andere Seite presst man dann auch noch leicht an und noch weiteren ca. 1-2 Minuten ist er fertig."}, {"id": 699, "start": 6472.44, "end": 6475.4, "text": "Gleich drauf können wir das zweite Fleischlauwe machen."}, {"id": 700, "start": 6475.4, "end": 6481.68, "text": "Einfach wieder mit Fulstergewürz draufdrucken. Das Fleisch was? Das Fleischlauwe?"}, {"id": 701, "start": 6481.68, "end": 6486.72, "text": "Okay das ist jetzt irgendwie österreichische Bezeichnung, keine Ahnung was das ist."}, {"id": 702, "start": 6486.72, "end": 6491.32, "text": "Und dann auf der anderen Seite würzen. Nach eineinhalb Minuten umdrehen."}, {"id": 703, "start": 6491.32, "end": 6497.16, "text": "Und was ich vorher nicht gesagt habe ist, jetzt ist es soweit, man kann da den Käse drauf tun."}, {"id": 704, "start": 6497.16, "end": 6503.52, "text": "Bevorzugt wird fürs mash Burger, amerikanischer Schabletten Käse, aber das bringe ich als Ehrenkoch"}, {"id": 705, "start": 6503.52, "end": 6508.56, "text": "leider nicht übers Herz, deswegen benutze ich da normalen Cheddar."}, {"id": 706, "start": 6508.56, "end": 6513.52, "text": "Und meine sehr verehrten Damen und Herren, alle Notwendigkeiten für einen perfekten smash Burger"}, {"id": 707, "start": 6513.52, "end": 6518.32, "text": "sind vorhanden. Jetzt brauche ich nur mehr den Burger so zusammenstellen, wie es mir gefällt."}, {"id": 708, "start": 6518.32, "end": 6523.04, "text": "Wer jetzt wegen den Zwivren schimpft, ich habe mich an Shake Shack gehalten und das Ganze mal ohne Zwirrguck."}, {"id": 709, "start": 6523.04, "end": 6528.72, "text": "Sieht doch gut aus. Aber man könnte es einfach auch sein lassen mit dem Brötchen selbst machen"}, {"id": 710, "start": 6528.72, "end": 6533.32, "text": "und fertige Brötchen nehmen, weil dann ist das einzige was man machen muss, das Hackfleisch braten."}, {"id": 711, "start": 6533.32, "end": 6535.32, "text": "Kann man machen."}, {"id": 712, "start": 6539.16, "end": 6541.16, "text": "Okay."}, {"id": 713, "start": 6542.6, "end": 6545.88, "text": "Sieht aber echt gut aus. Ja, exzellent."}, {"id": 714, "start": 6549.72, "end": 6555.72, "text": "Ja, also wenn es Barbecue Pit Boys wären, da muss da deutlich mehr Bacon und Beef hin und mehr Butter."}, {"id": 715, "start": 6557.12, "end": 6559.12, "text": "Unbedingt mehr Butter, das war viel zu wenig Butter."}, {"id": 716, "start": 6559.12, "end": 6565.12, "text": "Also unter der unter der Packung Butter pro Gericht geht bei denen ja nichts."}, {"id": 717, "start": 6565.12, "end": 6569.12, "text": "Okay, wir gucken jetzt eine Runde noch, bis mein Essen da ist."}, {"id": 718, "start": 6569.12, "end": 6575.12, "text": "Bis mein Döner Teller am Start ist, gucken wir jetzt noch eine Runde hier. Was haben die denn Neues?"}, {"id": 719, "start": 6575.12, "end": 6579.12, "text": "Jetzt gucken wir das Kontrast Programm."}, {"id": 720, "start": 6579.12, "end": 6583.12, "text": "Bacon, Baked Potato Dogs."}, {"id": 721, "start": 6583.12, "end": 6587.12, "text": "Pork Belly."}, {"id": 722, "start": 6587.12, "end": 6593.12, "text": "Alles laten Sie hier in Str갑."}, {"id": 723, "start": 6593.12, "end": 6599.12, "text": "Und das ist die Ecke, die Joo Zapf, das leakage Cocktail."}, {"id": 724, "start": 6599.12, "end": 6605.12, "text": "Ich fange auf zu sagen, ja, das kann jetzt nicht funktionieren."}, {"id": 725, "start": 6605.12, "end": 6611.12, "text": "Eine riesige Brötchen sost Kickstarter-M silicone, die very well zabaut hat."}, {"id": 726, "start": 6611.12, "end": 6612.62, "text": "Catch it!"}, {"id": 727, "start": 6612.62, "end": 6614.12, "text": "Okay."}, {"id": 728, "start": 6614.12, "end": 6620.98, "text": "Die können ihre videos echt mit so einem voiceboard eigentlich komplett vertonen"}, {"id": 729, "start": 6627.56, "end": 6629.56, "text": "Wo ist die machete"}, {"id": 730, "start": 6630.8, "end": 6635.18, "text": "Da fehlt die machete die müssen alles mit der machete schneiden. Wo ist die machete hin"}, {"id": 731, "start": 6635.18, "end": 6638.58, "text": "And of course you're gonna need your favorite seasoning or wrong"}, {"id": 732, "start": 6639.1, "end": 6641.7, "text": "All right, let's show you how this is done. Now the"}, {"id": 733, "start": 6645.7, "end": 6647.7, "text": "You want to score the skin"}, {"id": 734, "start": 6648.26, "end": 6651.82, "text": "we're doing this because we want to get it real crispy and this is a"}, {"id": 735, "start": 6652.46, "end": 6656.9, "text": "necessary part of getting this skin nice and crispy, right, right"}, {"id": 736, "start": 6657.5, "end": 6661.82, "text": "Right, see that you're going pretty much through the entire skin"}, {"id": 737, "start": 6661.82, "end": 6666.28, "text": "Also, man könnte da auch noch durch schießen oder so dann wird es wird wird bestimmt auch gut funktionieren"}, {"id": 738, "start": 6677.02, "end": 6679.02, "text": "Ja gut, der verteilt der verteilt"}, {"id": 739, "start": 6679.02, "end": 6685.28, "text": "Okay, this helps dry out that porkbelly skin and allows it to get crispy"}, {"id": 740, "start": 6688.46, "end": 6695.86, "text": "Just the way she likes it now here's the magic get your favorite hard apple cider"}, {"id": 741, "start": 6697.14, "end": 6702.34, "text": "Get yourself a dentist syringe or needle. All right. Oh, was ist auch rei wieder?"}, {"id": 742, "start": 6702.34, "end": 6707.74, "text": "Und inject ane geht geht geht geht doch nicht doch nicht sah mir aus"}, {"id": 743, "start": 6709.3, "end": 6711.78, "text": "Und du it several times or until"}, {"id": 744, "start": 6712.54, "end": 6714.54, "text": "You can't take the pain any longer"}, {"id": 745, "start": 6716.62, "end": 6722.8, "text": "Now by doing this you're gonna add plenty of moisture into the meat so when you do the cook"}, {"id": 746, "start": 6723.06, "end": 6725.06, "text": "It stays nice"}, {"id": 747, "start": 6725.06, "end": 6732.54, "text": "und"}, {"id": 748, "start": 6734.82, "end": 6736.82, "text": "Der saut immer dabei"}, {"id": 749, "start": 6737.62, "end": 6739.62, "text": "Just do it again"}, {"id": 750, "start": 6741.18, "end": 6743.18, "text": "All right"}, {"id": 751, "start": 6743.9, "end": 6745.9, "text": "Injected"}, {"id": 752, "start": 6746.78, "end": 6748.46, "text": "Now"}, {"id": 753, "start": 6748.46, "end": 6750.46, "text": "grab your favorite rub"}, {"id": 754, "start": 6750.46, "end": 6754.46, "text": "Kiri, wir benutzen unsere originelle Barbecue-Rübe."}, {"id": 755, "start": 6754.46, "end": 6756.46, "text": "Nimm dein Lieblingsgerät, wie ich gesagt habe."}, {"id": 756, "start": 6756.46, "end": 6758.46, "text": "Und drücke es tief rein."}, {"id": 757, "start": 6758.46, "end": 6759.46, "text": "Wieder."}, {"id": 758, "start": 6759.46, "end": 6761.46, "text": "Nur so, wie sie mag."}, {"id": 759, "start": 6762.46, "end": 6764.46, "text": "Das riecht ein bisschen wie ein Geschmack."}, {"id": 760, "start": 6770.46, "end": 6774.46, "text": "Jetzt, wenn du noch nie einen harten Apelsider-Porkbelly gehabt hast,"}, {"id": 761, "start": 6774.46, "end": 6776.46, "text": "musst du es definitiv aussehen."}, {"id": 762, "start": 6776.46, "end": 6779.46, "text": "Jetzt, wir werden ein bisschen mehr Öl dazu geben."}, {"id": 763, "start": 6779.46, "end": 6781.46, "text": "Ah, noch ein bisschen mehr Öl."}, {"id": 764, "start": 6781.46, "end": 6783.46, "text": "So, ist das richtig."}, {"id": 765, "start": 6788.46, "end": 6790.46, "text": "Ich glaube schon, dass das Bier ist."}, {"id": 766, "start": 6790.46, "end": 6792.46, "text": "Oder sowas in der Richtung."}, {"id": 767, "start": 6792.46, "end": 6794.46, "text": "Das wird wahrscheinlich sowas wie Bier sein."}, {"id": 768, "start": 6794.46, "end": 6798.46, "text": "Ich habe keine Ahnung, was Dickens Cider ist."}, {"id": 769, "start": 6802.46, "end": 6804.46, "text": "Ah, Gemüse."}, {"id": 770, "start": 6804.46, "end": 6809.46, "text": "Was ist da los?"}, {"id": 771, "start": 6818.46, "end": 6820.46, "text": "Ach, das ist Apfelwein."}, {"id": 772, "start": 6820.46, "end": 6822.46, "text": "Okay, sowas haben die auch."}, {"id": 773, "start": 6822.46, "end": 6826.46, "text": "Ich dachte, das haben wir nur in Hessen."}, {"id": 774, "start": 6830.46, "end": 6833.46, "text": "Moment, was ist mit denen los?"}, {"id": 775, "start": 6833.46, "end": 6835.46, "text": "So viel Grünzeug."}, {"id": 776, "start": 6839.46, "end": 6841.46, "text": "Das geht aber nicht."}, {"id": 777, "start": 6841.46, "end": 6843.46, "text": "Ah, okay."}, {"id": 778, "start": 6843.46, "end": 6865.46, "text": "Jetzt vielleicht."}, {"id": 779, "start": 6865.46, "end": 6868.46, "text": "Ach, der legt das da jetzt rein."}, {"id": 780, "start": 6868.46, "end": 6872.46, "text": "Muss der die andere Seite nicht auch noch würzen?"}, {"id": 781, "start": 6872.46, "end": 6875.46, "text": "Oder das Zeug drauf machen?"}, {"id": 782, "start": 6875.46, "end": 6879.46, "text": "In Hessen ist es Apfelwein, ja."}, {"id": 783, "start": 6882.46, "end": 6885.46, "text": "Oh, das sieht gut aus."}, {"id": 784, "start": 6885.46, "end": 6888.46, "text": "Das sieht, oh, das sieht gut aus."}, {"id": 785, "start": 6888.46, "end": 6890.46, "text": "Das sieht gut aus."}, {"id": 786, "start": 6890.46, "end": 6898.46, "text": "Oh, das sieht gut aus."}, {"id": 787, "start": 6898.46, "end": 6901.46, "text": "Das sieht, oh, das sieht richtig gut aus."}, {"id": 788, "start": 6901.46, "end": 6909.46, "text": "Also, die Kruste sieht wirklich gut aus."}, {"id": 789, "start": 6909.46, "end": 6911.46, "text": "So, und wo sind die Karotten?"}, {"id": 790, "start": 6911.46, "end": 6913.46, "text": "Genau."}, {"id": 791, "start": 6913.46, "end": 6933.46, "text": "Angator, nee, das muss nicht sein."}, {"id": 792, "start": 6944.46, "end": 6948.46, "text": "Zu fettig, nein, da darf man sich bei denen echt nicht beschweren."}, {"id": 793, "start": 6948.46, "end": 6953.46, "text": "Für die, für die war das noch wenig, noch wenig fett."}, {"id": 794, "start": 6958.46, "end": 6960.46, "text": "So Leute, mein Essen müsste jetzt jede Minute kommen."}, {"id": 795, "start": 6960.46, "end": 6962.46, "text": "Ich habe auf 13.15 bestellt."}, {"id": 796, "start": 6962.46, "end": 6964.46, "text": "Es ist jetzt 13.05."}, {"id": 797, "start": 6964.46, "end": 6966.46, "text": "Hat der einen Patreon?"}, {"id": 798, "start": 6966.46, "end": 6968.46, "text": "Vor allem nicht, ob der einen Patreon hat."}, {"id": 799, "start": 6968.46, "end": 6972.46, "text": "Aber der hat mit Sicherheit genug Aufrufe."}, {"id": 800, "start": 6972.46, "end": 6975.46, "text": "Dass der keinen Patreon braucht."}, {"id": 801, "start": 6975.46, "end": 6979.46, "text": "Auch tatsächlich, die haben einen Patreon."}, {"id": 802, "start": 6979.46, "end": 6981.46, "text": "Nee, Moment."}, {"id": 803, "start": 6981.46, "end": 6984.46, "text": "Nee, haben sie nicht."}, {"id": 804, "start": 6984.46, "end": 6986.46, "text": "Brauchen sie auch nicht."}, {"id": 805, "start": 6986.46, "end": 6987.46, "text": "Wozu?"}, {"id": 806, "start": 6987.46, "end": 6990.46, "text": "Ja, massig Aufrufe."}, {"id": 807, "start": 6990.46, "end": 6995.46, "text": "So baut man einen PC."}, {"id": 808, "start": 6995.46, "end": 6998.46, "text": "Okay, PC-Welle, das gibt es."}, {"id": 809, "start": 6998.46, "end": 7003.46, "text": "Wobei, das ist kein Cringe-Video."}, {"id": 810, "start": 7003.46, "end": 7005.46, "text": "Die wissen wahrscheinlich wirklich, wie es geht."}, {"id": 811, "start": 7005.46, "end": 7009.46, "text": "Das Verge-Video, kann sich da noch einer dran erinnern?"}, {"id": 812, "start": 7009.46, "end": 7018.46, "text": "Kennt das noch einer?"}, {"id": 813, "start": 7018.46, "end": 7024.46, "text": "Kennt das noch einer?"}, {"id": 814, "start": 7024.46, "end": 7028.46, "text": "Den Anfang, wir müssen den Anfang nochmal gucken."}, {"id": 815, "start": 7028.46, "end": 7030.46, "text": "Der Anfang ist zu geil."}, {"id": 816, "start": 7030.46, "end": 7044.46, "text": "Also meine Lieblingsstelle, meine Lieblingsstelle ist das mit dem Anti-Static-Band."}, {"id": 817, "start": 7044.46, "end": 7051.46, "text": "Das Anti-Static-Band ist das beste."}, {"id": 818, "start": 7051.46, "end": 7057.46, "text": "Jetzt."}, {"id": 819, "start": 7057.46, "end": 7067.46, "text": "Das Anti-Static-Band, einfach nur ein Gummi um das Handgelenk gemacht."}, {"id": 820, "start": 7067.46, "end": 7071.46, "text": "Also normalerweise gibt es Anti-Static-Armbänder."}, {"id": 821, "start": 7071.46, "end": 7075.46, "text": "Aber die musst du irgendwo erden, die musst du irgendwo anschließen."}, {"id": 822, "start": 7075.46, "end": 7080.46, "text": "Das Einzige, was der gemacht hat, ist ein Gummi-Band um den Arm."}, {"id": 823, "start": 7080.46, "end": 7082.46, "text": "Das kann sich jetzt irgendwas bringen."}, {"id": 824, "start": 7082.46, "end": 7084.46, "text": "Der kann sich genauso gut Aluhut aufsetzen."}, {"id": 825, "start": 7084.46, "end": 7085.46, "text": "Das bringt genauso wenig."}, {"id": 826, "start": 7085.46, "end": 7102.46, "text": "Wahrscheinlich bringt der Aluhut noch mehr."}, {"id": 827, "start": 7102.46, "end": 7108.46, "text": "Das ist das beste hier."}, {"id": 828, "start": 7108.46, "end": 7111.46, "text": "Ich könnte mich da immer wegschmeißen."}, {"id": 829, "start": 7111.46, "end": 7117.46, "text": "Ach ja und übrigens, die CPU baut man auch als letztes ein."}, {"id": 830, "start": 7117.46, "end": 7121.46, "text": "Kennst du das Electro-Boom-Video zu kabellosen Anti-Static-Armbändern?"}, {"id": 831, "start": 7121.46, "end": 7123.46, "text": "Nö."}, {"id": 832, "start": 7123.46, "end": 7128.46, "text": "Hat der ein neues?"}, {"id": 833, "start": 7128.46, "end": 7130.46, "text": "Das Video war so geil."}, {"id": 834, "start": 7130.46, "end": 7136.46, "text": "So ein Fail-Video habe ich lange nicht mal gesehen."}, {"id": 835, "start": 7136.46, "end": 7140.46, "text": "Was sind bei deine zwei Sens zur PS5 gestern?"}, {"id": 836, "start": 7140.46, "end": 7142.46, "text": "Ja, um es zusammenzufassen, so."}, {"id": 837, "start": 7142.46, "end": 7144.46, "text": "War ein paar gute Sachen dabei."}, {"id": 838, "start": 7144.46, "end": 7155.46, "text": "Der größte Teil war jetzt eher zum Einschlafen."}, {"id": 839, "start": 7155.46, "end": 7159.46, "text": "Kein Stresskochen-Leberkäs."}, {"id": 840, "start": 7159.46, "end": 7160.46, "text": "Ich habe Hunger."}, {"id": 841, "start": 7160.46, "end": 7162.46, "text": "Ich mache mal kurz die Kamera auf dem zweiten Bildschirm auf,"}, {"id": 842, "start": 7162.46, "end": 7169.46, "text": "dass ich sehe, wenn da einer vor dem Haus anrückt."}, {"id": 843, "start": 7169.46, "end": 7183.46, "text": "Keiner zu sehen."}, {"id": 844, "start": 7183.46, "end": 7186.46, "text": "Keiner zu sehen vor dem Haus bemessen."}, {"id": 845, "start": 7186.46, "end": 7188.46, "text": "Aber wie gesagt, ich habe auch auf 1315 bestellt."}, {"id": 846, "start": 7188.46, "end": 7198.46, "text": "Also die müssten jetzt demnächst mal hier anrücken."}, {"id": 847, "start": 7198.46, "end": 7199.46, "text": "Adresse liegt."}, {"id": 848, "start": 7199.46, "end": 7204.46, "text": "Das ist alles immer liegt."}, {"id": 849, "start": 7204.46, "end": 7207.46, "text": "Hast du eigentlich Achtung Video-Überwachung im Hauseingang?"}, {"id": 850, "start": 7207.46, "end": 7214.46, "text": "Natürlich, natürlich."}, {"id": 851, "start": 7214.46, "end": 7215.46, "text": "Datum korrekt."}, {"id": 852, "start": 7215.46, "end": 7225.46, "text": "Ein Anlager kann Datum einstellen."}, {"id": 853, "start": 7225.46, "end": 7249.46, "text": "Ich habe Hunger."}, {"id": 854, "start": 7249.46, "end": 7250.46, "text": "Ich muss was essen Leute."}, {"id": 855, "start": 7250.46, "end": 7259.46, "text": "Burger für einen Euro, das gucken wir jetzt noch schnell."}, {"id": 856, "start": 7259.46, "end": 7264.46, "text": "Wenn das Essen in der Zwischenzeit kommt, dann mache ich aus."}, {"id": 857, "start": 7264.46, "end": 7266.46, "text": "Etwas, was mir schon länger am Herzen liegt."}, {"id": 858, "start": 7266.46, "end": 7270.46, "text": "Und zwar hat sich ein sehr weißer Mann namens Pommesman die Frage gestellt,"}, {"id": 859, "start": 7270.46, "end": 7273.46, "text": "ob man einen Euro-Burger selber besser machen kann."}, {"id": 860, "start": 7273.46, "end": 7276.46, "text": "Natürlich kann man ihn besser machen, ja, also klar."}, {"id": 861, "start": 7276.46, "end": 7279.46, "text": "Aber die Frage ist, ob man diesen Burger besser machen kann,"}, {"id": 862, "start": 7279.46, "end": 7282.46, "text": "wenn man als Budget auch nur einen Euro hat."}, {"id": 863, "start": 7282.46, "end": 7284.46, "text": "Und da wird es jetzt für mich sehr interessant."}, {"id": 864, "start": 7284.46, "end": 7288.46, "text": "Die einen Euro-Burger von McDonalds, gerade der Cheeseburger, das ist voll abartig."}, {"id": 865, "start": 7288.46, "end": 7290.46, "text": "Ich kann es überhaupt nicht mehr essen."}, {"id": 866, "start": 7290.46, "end": 7292.46, "text": "Keine Sorge, ich möchte mich nicht mit dem Meister messen."}, {"id": 867, "start": 7292.46, "end": 7296.46, "text": "Aber was wäre, wenn man wirklich alles selber machen würde"}, {"id": 868, "start": 7296.46, "end": 7299.46, "text": "und zusätzlich frisches Faschiertes verwendet,"}, {"id": 869, "start": 7299.46, "end": 7301.46, "text": "würde man dann auch unter einem Euro bleiben?"}, {"id": 870, "start": 7301.46, "end": 7304.46, "text": "Und genau das werde ich heute probieren."}, {"id": 871, "start": 7304.46, "end": 7306.46, "text": "Für die Rezension des Konkurrenzprodukts."}, {"id": 872, "start": 7306.46, "end": 7309.46, "text": "Cheeseburger kostet jetzt 1,20, keine Ahnung."}, {"id": 873, "start": 7309.46, "end": 7313.46, "text": "Aber früher hat er 1 Euro gekostet und es war eklig."}, {"id": 874, "start": 7321.46, "end": 7322.46, "text": "Was?"}, {"id": 875, "start": 7322.46, "end": 7324.46, "text": "Oh Gott!"}, {"id": 876, "start": 7334.46, "end": 7336.46, "text": "Wie viele Abos hat der hier?"}, {"id": 877, "start": 7336.46, "end": 7340.46, "text": "31, der hätte schon, der verdient schon mehr."}, {"id": 878, "start": 7340.46, "end": 7356.46, "text": "Der macht doch gute Videos."}, {"id": 879, "start": 7356.46, "end": 7360.46, "text": "Sogar Megaman Musik am Start."}, {"id": 880, "start": 7367.46, "end": 7369.46, "text": "Heute brauchen wir Strom nur in der Küche."}, {"id": 881, "start": 7369.46, "end": 7372.46, "text": "Wir wollen ja mit der Stromrechnung unter einem Euro bleiben."}, {"id": 882, "start": 7372.46, "end": 7375.46, "text": "Ach, die Stromrechnung zählt auch noch dazu."}, {"id": 883, "start": 7375.46, "end": 7378.46, "text": "Okay, jetzt übertreibt er es aber."}, {"id": 884, "start": 7378.46, "end": 7382.46, "text": "Mit einem halben Packerl Mehl, einen Esslöffel Salz, zwei Esslöffel Zucker,"}, {"id": 885, "start": 7382.46, "end": 7386.46, "text": "einen Packerl Hefe, 250 Milliliter Glas Wasser,"}, {"id": 886, "start": 7386.46, "end": 7388.46, "text": "weil Milch können wir uns nicht leisten,"}, {"id": 887, "start": 7388.46, "end": 7390.46, "text": "zwei Esslöffel Butter und einem Ei,"}, {"id": 888, "start": 7390.46, "end": 7393.46, "text": "lässt sich ein sehr schneller Burger-Dag herstellen."}, {"id": 889, "start": 7393.46, "end": 7398.46, "text": "Knetet es den Sohler, bis er sich von den Seiten löst und nicht mehr klebt."}, {"id": 890, "start": 7398.46, "end": 7401.46, "text": "Und seht, dafür braucht man keine Küchenmaschine."}, {"id": 891, "start": 7401.46, "end": 7403.46, "text": "Mann, das hat sie jetzt gehört."}, {"id": 892, "start": 7403.46, "end": 7408.46, "text": "Geh mal raus, du weißt ja, dass du mein absoluter Liebling bist."}, {"id": 893, "start": 7410.46, "end": 7413.46, "text": "Nein, nein, nein, die habe ich viel lieber."}, {"id": 894, "start": 7415.46, "end": 7419.46, "text": "Auf jeden Fall muss der Teig jetzt gehen, bis er doppelt so groß ist."}, {"id": 895, "start": 7419.46, "end": 7422.46, "text": "Wenn das passiert ist, können wir die Luft aus ihm raus lassen"}, {"id": 896, "start": 7422.46, "end": 7426.46, "text": "und daraus klare Kugeln für die Burger Buns formen."}, {"id": 897, "start": 7426.46, "end": 7431.46, "text": "Wichtig ist, damit es mit der Rechnung ausgeht, dass die Kugeln ein Gewicht von genau 80 Gramm haben."}, {"id": 898, "start": 7431.46, "end": 7435.46, "text": "Druckt das dann zu flachen Scheiben, lasst das dann so lange rosten,"}, {"id": 899, "start": 7435.46, "end": 7438.46, "text": "bis sie noch ein Stückchen aufgehen, so ca. dreiviertel Stunde."}, {"id": 900, "start": 7438.46, "end": 7440.46, "text": "Wenn sie so ausschauen, passt es."}, {"id": 901, "start": 7440.46, "end": 7443.46, "text": "Trennt ihr das Eigelb vom Eiweiß, wir werden beides noch brauchen."}, {"id": 902, "start": 7443.46, "end": 7447.46, "text": "Kann man überhaupt einzelne Eier kaufen?"}, {"id": 903, "start": 7447.46, "end": 7450.46, "text": "Und damit bestreichen wir unsere Burger Buns."}, {"id": 904, "start": 7450.46, "end": 7454.46, "text": "Und die stellen wir nachher bei 180°C für ca. 15 Minuten in den Ofen."}, {"id": 905, "start": 7454.46, "end": 7458.46, "text": "Fertig gebacken, kann man noch ein bisschen Butter drauf tun für den Glanz."}, {"id": 906, "start": 7458.46, "end": 7460.46, "text": "Dann lasst das abkühlen."}, {"id": 907, "start": 7460.46, "end": 7465.46, "text": "Und jetzt kommt die erste von vielen sehr anstrengenden Kalkulationen."}, {"id": 908, "start": 7466.46, "end": 7469.46, "text": "Also Mehl und Ei machen insgesamt 50 Cent aus."}, {"id": 909, "start": 7469.46, "end": 7476.46, "text": "35 Gramm von der Butter, wobei 5 Gramm von den 35 für das Bestreichen am Schluss sind, sind 17 Cent."}, {"id": 910, "start": 7476.46, "end": 7481.46, "text": "1 Esslöffel Salz sind ca. 0,6 Cent und 2 Esslöffel Zucker 1,4 Cent."}, {"id": 911, "start": 7481.46, "end": 7483.46, "text": "Macht insgesamt 2 Cent."}, {"id": 912, "start": 7483.46, "end": 7485.46, "text": "Ich glaube es ist kein Auto vor dem Haus gehalten."}, {"id": 913, "start": 7485.46, "end": 7487.46, "text": "Ich muss mal kurz rausgucken Leute."}, {"id": 914, "start": 7487.46, "end": 7490.46, "text": "Das heißt 8 Cent für einen Burger."}, {"id": 915, "start": 7490.46, "end": 7492.46, "text": "Ne, nichts zu sehen."}, {"id": 916, "start": 7498.46, "end": 7501.46, "text": "Was auf einen Burger nicht fehlen darf, sind Essiggurken."}, {"id": 917, "start": 7501.46, "end": 7503.46, "text": "Und die lassen sich super leicht selber machen."}, {"id": 918, "start": 7503.46, "end": 7509.46, "text": "150 Gramm Gurken, Größe egal, mit einem halben Esslöffel Salz und einem Esslöffel Zucker."}, {"id": 919, "start": 7509.46, "end": 7511.46, "text": "Am besten in und nicht neben ein Glas geben."}, {"id": 920, "start": 7511.46, "end": 7515.46, "text": "Dann noch mal ein bisschen durchschütteln und wenn alles gut verteilt ist,"}, {"id": 921, "start": 7515.46, "end": 7519.46, "text": "noch 5-6 Esslöffel von eurem Lieblingsessig dazu geben."}, {"id": 922, "start": 7519.46, "end": 7522.46, "text": "Ich nehme da jetzt einen neutralen Essig, weil ich den fürs Einlegen am liebsten habe."}, {"id": 923, "start": 7522.46, "end": 7525.46, "text": "Während der nächsten Schritten, schüttelt ihr euer Glas immer wieder mal,"}, {"id": 924, "start": 7525.46, "end": 7528.46, "text": "damit die Flüssigkeit aus den Gurken rauskommt."}, {"id": 925, "start": 7529.46, "end": 7532.46, "text": "Bringt 150 Milliliter Wasser leicht zum Köcheln."}, {"id": 926, "start": 7532.46, "end": 7534.46, "text": "Schütteln nicht vergessen."}, {"id": 927, "start": 7534.46, "end": 7536.46, "text": "Lieblingsessig."}, {"id": 928, "start": 7536.46, "end": 7541.46, "text": "Ich bin froh, wenn ich Essig habe. Ich habe keinen Lieblingsessig."}, {"id": 929, "start": 7541.46, "end": 7543.46, "text": "Die Flüssigkeit könnt ihr würzen wie ihr wollt."}, {"id": 930, "start": 7543.46, "end": 7548.46, "text": "Ich nehme dazu Senfsaat, Oreandersamen und ein bisschen an schwarzem Pfeffer."}, {"id": 931, "start": 7548.46, "end": 7550.46, "text": "Ah ja, schütteln nicht vergessen."}, {"id": 932, "start": 7550.46, "end": 7553.46, "text": "Wenn das 5-10 Minuten drinnen zirgen hat können,"}, {"id": 933, "start": 7553.46, "end": 7556.46, "text": "braucht ihr das Ganze nur nicht zu euren Gurken dazuschieben"}, {"id": 934, "start": 7556.46, "end": 7560.46, "text": "und geschlossen im Kühlschrank nachzirgen lassen."}, {"id": 935, "start": 7560.46, "end": 7564.46, "text": "Am besten schmeckt es, wenn man es mal über die Nacht stehen lässt. Ist aber nicht notwendig."}, {"id": 936, "start": 7564.46, "end": 7567.46, "text": "So schaut es übrigens aus, wenn man normale Gurken dafür verwendet"}, {"id": 937, "start": 7567.46, "end": 7570.46, "text": "und ein bisschen roten Zwiebel dazu reintun."}, {"id": 938, "start": 7570.46, "end": 7571.46, "text": "Aha."}, {"id": 939, "start": 7571.46, "end": 7573.46, "text": "Die Rechnerei wird nicht lustiger."}, {"id": 940, "start": 7573.46, "end": 7576.46, "text": "So, da haben wir dann 1 Euro für die Gurken."}, {"id": 941, "start": 7576.46, "end": 7578.46, "text": "4 Cent für 60 Gramm."}, {"id": 942, "start": 7578.46, "end": 7579.46, "text": "So, genau jetzt müssen wir an Essen kommen."}, {"id": 943, "start": 7579.46, "end": 7581.46, "text": "30 Zuckers sind 0,01 Cent."}, {"id": 944, "start": 7581.46, "end": 7583.46, "text": "Für die Einlegerwürze haben wir 30 Cent."}, {"id": 945, "start": 7583.46, "end": 7586.46, "text": "Macht für ein bisschen über 250 Gramm."}, {"id": 946, "start": 7586.46, "end": 7587.46, "text": "1,36 Euro."}, {"id": 947, "start": 7587.46, "end": 7589.46, "text": "Nachts ausschütteln, na klar, immer, immer, immer."}, {"id": 948, "start": 7589.46, "end": 7593.46, "text": "3 Gurken brauchen, die kosten ca. 1 bis 1,5 Cent."}, {"id": 949, "start": 7593.46, "end": 7596.46, "text": "Und die runden wir auf auf 2 Cent pro Burger."}, {"id": 950, "start": 7596.46, "end": 7597.46, "text": "2 Cent."}, {"id": 951, "start": 7597.46, "end": 7601.46, "text": "Wir Sporfüchse haben ja noch ein Eigelb über vom Burgerbrot Rezept."}, {"id": 952, "start": 7601.46, "end": 7604.46, "text": "Und das werden wir jetzt zu einer frischen Mayonnaise aufschlagen."}, {"id": 953, "start": 7604.46, "end": 7607.46, "text": "Am besten geht es mit einem Schneebesen."}, {"id": 954, "start": 7607.46, "end": 7610.46, "text": "Bevor man die ersten Tropfen Öl reingibt, sollte das Eigelb schaumig sein."}, {"id": 955, "start": 7610.46, "end": 7614.46, "text": "Unter ständigem Rühren kommt dann das Öl ganz, ganz langsam dazu."}, {"id": 956, "start": 7614.46, "end": 7617.46, "text": "Die ersten 50 Milliliter sind da der kritischste Teil."}, {"id": 957, "start": 7617.46, "end": 7621.46, "text": "Sobald die Emulsion, also die Verbindung zwischen dem Öl und dem Eigelb steht,"}, {"id": 958, "start": 7621.46, "end": 7624.46, "text": "kann ich dann schon mit größerem Schluck Öl weitermachen."}, {"id": 959, "start": 7624.46, "end": 7628.46, "text": "Schmeckt das Ganze dann mit einem Schuss Essig oder Zitronensaft"}, {"id": 960, "start": 7628.46, "end": 7631.46, "text": "und ein bisschen am Salz ab und die Sache ist erledigt."}, {"id": 961, "start": 7631.46, "end": 7634.46, "text": "Selbst machte Mayonnaise ist schon geil."}, {"id": 962, "start": 7634.46, "end": 7637.46, "text": "Aber selbst macht das Ketchup übertrifft es noch."}, {"id": 963, "start": 7637.46, "end": 7639.46, "text": "Für super schnelles selbstgemachtes Ketchup."}, {"id": 964, "start": 7639.46, "end": 7641.46, "text": "Okay, man kann es auch übertreiben."}, {"id": 965, "start": 7641.46, "end": 7643.46, "text": "Man muss doch nicht alles selber machen."}, {"id": 966, "start": 7643.46, "end": 7647.46, "text": "Ketchup gibt 4 Esslöffel Tomatenmark in einen Topf."}, {"id": 967, "start": 7647.46, "end": 7652.46, "text": "Mit 6 Esslöffel von eurem Lieblingsessig, 6 Esslöffel Wasser, 2 Esslöffel Zucker."}, {"id": 968, "start": 7652.46, "end": 7655.46, "text": "Chat, was ist denn euer Lieblingsessig so?"}, {"id": 969, "start": 7656.46, "end": 7659.46, "text": "Ich finde das geil, das wird so gesagt, als wüsste jeder so,"}, {"id": 970, "start": 7659.46, "end": 7662.46, "text": "ja klar, mein Lieblingsessig, alles klar."}, {"id": 971, "start": 7662.46, "end": 7665.46, "text": "Und am guten halben bis an ganzen Esslöffel Salz."}, {"id": 972, "start": 7665.46, "end": 7668.46, "text": "Und das absolut wichtigste ist auch Gewürznelke."}, {"id": 973, "start": 7668.46, "end": 7672.46, "text": "Bis zu 400 Gramm Tomatenmark ist es immer auch Gewürznelke."}, {"id": 974, "start": 7672.46, "end": 7674.46, "text": "Es variiert nur immer die Zeit."}, {"id": 975, "start": 7674.46, "end": 7678.46, "text": "Man könnte sich die Tomaten im Garten auch erst selbst wachsen lassen."}, {"id": 976, "start": 7678.46, "end": 7681.46, "text": "Dann gehen wir es nach 2 Minuten mit kochen wieder raus."}, {"id": 977, "start": 7681.46, "end": 7686.46, "text": "Wenn ihr die Konsistenz noch on point haben wollt, dann mischt es einen halben Esslöffel Wasser"}, {"id": 978, "start": 7686.46, "end": 7690.46, "text": "und einen halben Esslöffel Stärke zusammen und gebt es dann zum Ganzen dazu."}, {"id": 979, "start": 7690.46, "end": 7692.46, "text": "Damit dickt sich das Ganze ein bisschen ein."}, {"id": 980, "start": 7692.46, "end": 7697.46, "text": "Extra Fleißpunkte gibt es dann noch, wenn ihr das Ganze durch ein feines Sieb durchpassiert."}, {"id": 981, "start": 7697.46, "end": 7701.46, "text": "Das ist nicht notwendig, aber wenn du wie ich das Bedürfnis hast,"}, {"id": 982, "start": 7701.46, "end": 7706.46, "text": "unnötige Bilder von Ketchup auf Instagram zu stellen, dann solltest du das machen."}, {"id": 983, "start": 7706.46, "end": 7709.46, "text": "Natürlich darf es Salat, Tomate und Zwiebel auch nicht fehlen."}, {"id": 984, "start": 7709.46, "end": 7712.46, "text": "Oh es ist kaputt Leute, es ist kaputt, es ist kaputt."}, {"id": 985, "start": 7712.46, "end": 7716.46, "text": "Schneide die Tomaten und die Zwiebel in ganz feine Scheiben."}, {"id": 986, "start": 7716.46, "end": 7720.46, "text": "Ah ja genau, irgendwer muss ja das Ganze jetzt zusammenrechnen auch noch."}, {"id": 987, "start": 7720.46, "end": 7722.46, "text": "Warum tue ich mir das an?"}, {"id": 988, "start": 7722.46, "end": 7724.46, "text": "Also beginnen wir mit der Mayonnaise."}, {"id": 989, "start": 7724.46, "end": 7729.46, "text": "Ein Ei, 250 Milliliter Öl plus einen Spritzer Essig und eine Prise Salz."}, {"id": 990, "start": 7729.46, "end": 7731.46, "text": "Dem Tomatenmark fürs Ketchup."}, {"id": 991, "start": 7731.46, "end": 7734.46, "text": "Salz und Zucker, was so um die 2 Cent ausmacht."}, {"id": 992, "start": 7734.46, "end": 7737.46, "text": "Apfelessig für aufgerundete 5 Cent."}, {"id": 993, "start": 7737.46, "end": 7741.46, "text": "Und das ganze Zubehör wie Tomate, Zwiebel und Salat."}, {"id": 994, "start": 7741.46, "end": 7761.46, "text": "Macht insgesamt 1,27 Euro, das heißt aufgerundet 13 Cent pro Burger."}, {"id": 995, "start": 7761.46, "end": 7764.46, "text": "Bei mir im Supermarkt war Gulaschfleisch im Angebot."}, {"id": 996, "start": 7764.46, "end": 7767.46, "text": "Das Gulaschfleisch ist entweder aus dem Hals oder aus der Wade."}, {"id": 997, "start": 7767.46, "end": 7770.46, "text": "Rinderhals ist perfekt für Burger Patties."}, {"id": 998, "start": 7770.46, "end": 7772.46, "text": "Ah, ich bin wieder da."}, {"id": 999, "start": 7772.46, "end": 7775.46, "text": "Aber ich gehe jetzt weg."}, {"id": 1000, "start": 7775.46, "end": 7777.46, "text": "Das gucken wir noch schnell fertig."}, {"id": 1001, "start": 7777.46, "end": 7784.46, "text": "Ich will gucken wie der Burger aussieht."}, {"id": 1002, "start": 7784.46, "end": 7788.46, "text": "What?"}, {"id": 1003, "start": 7788.46, "end": 7793.46, "text": "Ich will wissen wie der Burger aussieht."}, {"id": 1004, "start": 7793.46, "end": 7800.46, "text": "Oh, Big Brain Tool."}, {"id": 1005, "start": 7800.46, "end": 7814.46, "text": "Hat er den Preis von diesem Ding auch einberechnet?"}, {"id": 1006, "start": 7814.46, "end": 7837.46, "text": "Das ist exzellent Produkt placement."}, {"id": 1007, "start": 7837.46, "end": 7858.46, "text": "Den Link zu dem Ding findet ihr natürlich in der Beschreibung."}, {"id": 1008, "start": 7858.46, "end": 7867.46, "text": "Anomaler Hamburger wiegt so um die 90 Gramm und unser Patty wiegt ja schon 100."}, {"id": 1009, "start": 7867.46, "end": 7870.46, "text": "Schauen wir mal was unser Gerät so auf die Waag bringt."}, {"id": 1010, "start": 7870.46, "end": 7872.46, "text": "Das kann sich sehen lassen."}, {"id": 1011, "start": 7872.46, "end": 7875.46, "text": "So und jetzt noch das letzte Mal rechnen."}, {"id": 1012, "start": 7875.46, "end": 7877.46, "text": "Also nochmal alles zusammen."}, {"id": 1013, "start": 7877.46, "end": 7882.46, "text": "79 Cent für die Burger Brötchen, 6,99 Euro für die Patties."}, {"id": 1014, "start": 7882.46, "end": 7885.46, "text": "Das Zubehör, also der ganze Belag, belauft sich auf 1,50 Euro."}, {"id": 1015, "start": 7885.46, "end": 7890.46, "text": "27 Cent für den Strom, über mal aufgerundet, macht insgesamt 9,48 Euro."}, {"id": 1016, "start": 7890.46, "end": 7891.46, "text": "10 Portionen."}, {"id": 1017, "start": 7891.46, "end": 7893.46, "text": "Knapp 95 Cent pro Burger."}, {"id": 1018, "start": 7893.46, "end": 7900.46, "text": "Mit den letzten 5 Cent macht es was Witz, weil ich habe fix was vergessen."}, {"id": 1019, "start": 7900.46, "end": 7902.46, "text": "Ja, nicht schlecht."}, {"id": 1020, "start": 7902.46, "end": 7905.46, "text": "Sieht gut aus."}, {"id": 1021, "start": 7905.46, "end": 7906.46, "text": "Poggers Burger."}, {"id": 1022, "start": 7906.46, "end": 7908.46, "text": "Leute, ich gehe jetzt meinen Döner Teller essen."}, {"id": 1023, "start": 7908.46, "end": 7909.46, "text": "Wir sehen uns."}, {"id": 1024, "start": 7909.46, "end": 7910.46, "text": "Bis dann, macht's gut."}, {"id": 1025, "start": 7910.46, "end": 7915.46, "text": "See you."}]}