{"text": "Kuckuckоки Oh oh Lawconnect Non non NONONONONONONONONONONONON So, exquisite, auf geht's! Ah, irgendwas stimmt mit meinem Headset nicht, was ist hier los? But why? Ah, okay, excellent. Wieso, wieso nur noch zwei Wochen arbeiten an Vollzeit YouTube? Ja klar, was sonst? Instant, gleich Vollzeit YouTube. Nee, nee, nee, hat nix mit Vollzeit YouTube zu tun. Ich hab Dezember Urlaub komplett eingetragen und ich hab gesehen, dass ich noch vier Tage Resturlaub hab. Die müssen irgendwo hin. Wenn ich vier Tage Resturlaub noch eintrage, dann hab ich ja quasi dann noch eine Woche Länge Urlaub. Das heißt, ich muss noch zwei Wochen arbeiten, dann bin ich für das restliche Jahr daheim. Oder besser gesagt, daheim bin, weiß ich nicht, aber definitely nicht auf der Arbeit. Dotnet 6 Stream, wir haben letztens schon gemacht. Wir haben uns letztens schon die neuen Features angeguckt. Ich überleg grad, wann soll denn das released werden? Morgen oder übermorgen oder Freitag oder so? Es ist nicht mal lang hin. Das ist heute rausgekommen, ach ja. Ach ja, zeigt mal her, das müssen wir uns dann gleich mal angucken. Aber ganz davon abgehen, wir haben uns ja letztens in einem Stream schon die neuen Features angeguckt. Also das hat ja keinen großartigen Sinn. Das ist jetzt da, aber was soll ich da streamen? Äh, was? Also ich habe keine Ahnung, auf was sich das jetzt bezieht. Nein, ich habe kein Neato Saugroboter. Bisschen leiser machen, da, fuck. Du bist erkältet, na gut, dann sei froh, dass kein Corona ist. Noch ganz einfach. So, mir geht es gut, es ist relativ spät, ich bin schon irgendwie nicht mehr so ganz fit, aber es ist noch lange kein Bett gear angesagt. Selfmade Ice, Dankeschön für 15 Monate Subscriptions. Du müsstest jetzt mit 15 Monaten, du müsstest quasi auch schon den Goldkeks haben, oder? Gibt es nicht nach einem Jahr? Ja, to the moon. Also ich müsste mal, ach, ich mache dann, ich mache dann vollen Sellout, ich mache dann jedes Video mit Sponsor, Channel Memberships auf YouTube, dann geht es ab. Oh, guck mal, ein Kronk-Subscriber. Ich habe nie großartig Kronk geguckt, muss ich dazu sagen, aber irgendwie ist er mir von allen deutschen Let's Playern noch, vielleicht weil ich nicht so viel geguckt habe oder so, scheint er mir noch irgendwie dem am nächsten zu kommen, was ich gucken würde, aber ich gucke quasi keine deutschen Let's Plays, aber alle anderen Let's Plays gehen mir zum größten Teil mega auf den Sack, vor allem die, die so rumschreien und pausenlos, also wirklich pausenlos reden, ich meine mit pausenlos reden, nicht pausenlos reden, sondern wirklich so komplett ohne Pause, ohne Luft zu holen und die ganze Zeit durchzureden, damit sie nicht sagen, oh, also das halte ich dann aus, Triggert, not net 6 any percent, können gleich mal gucken, wir schauen uns auch gleich noch ein paar, ich habe, wir wurden auf YouTube heute zwei Videos vorgeschlagen, hier, Server Rack Touren, da bin ich ja immer dabei, dass ich mich ein bisschen darüber auslassen kann, was andere, was ich im Rack habe, meine Rack Tour ist ja schon durch, das ist ganz einfach, du musst einfach ein eigenes Unternehmen gründen und dann big brain time, massig Kohle mitmachen, dass du dann genug Leute bezahlen kannst, die deine Arbeit erledigen, das ist natürlich nicht so einfach und die meisten, die das machen, die wollen ja dann auch gar nicht weg, die wollen ja dann weitermachen da, sag mal was zu den neuen Macs, die jetzt vorgestellt, keine Ahnung, habe ich nicht gesehen, die Sache ist auch die, mich interessieren Macs überhaupt nicht, das einzige, was mich von Apple interessiert ist, sind die Tablets und die Smartphones, habt ihr das mit dem Tuch gesehen für 25 Euro, Apple Tuch, Apple Poliertuch und guckt euch mal die Lieferzeit an, guckt euch den Preis, guckt euch den Preis und guckt euch die Lieferzeiten an, das ist so typischer mit Appleshit, Leute danke für die Subs, wer hat es, wer hat es, wer hat alles gesagt, der Captain Zika ist 18 Monate wieder am Start, nice, Blofus ist am Start, wenn ich irgendwas übersehen habe, hoffe nicht, das Problem ist, ich würde auch normalerweise mehr Applesachen streamen, aber ich sehe es nicht ein, jemals wieder was für Apple zu machen, nachdem die mich gestrikt haben, unsinnigerweise wohlgemerkt, ja, Heise hat eine Review gemacht, hat gesagt, das Apple Tuch reinigt auch nicht besser als andere Tücher, aber das war ja von vorne rein klar, ist mir nichts dazu bekannt, ja, mach das, dann gucken wir uns hier im Stream an, wenn du deine Rektor machst, jetzt zum Thema Weltraumpasser, da fällt mir ein also noch, also wo ich noch ein bisschen kleiner war und mir so einen Scheiß habe einreden lassen, ja, da war ich mal in so einem kleinen Hardware Laden, damals gab es noch viele dieser kleinen mini Hardware Klitschen mit irgendwie 1-2 Leuten drin, das gibt es ja in der Form nicht mehr oder selten und da haben die, da haben wir Netzwerkkarten, wollten wir uns zwei Netzwerkkarten kaufen, ich glaube das war, ich glaube das war Netzwerkkarten mit ALU45 Stecker, also Buchsen und noch BNC dran und der hat uns damals ernsthaft erzählt, dass das Netzwerkkarten aus der Weltraumforschung sind und so, ich habe das damals geglaubt und habe mich voll gefreut, dass ich jetzt die geilste Netzwerkkarte auf der Welt habe, weil es aus dem Weltraum oder aus der Weltraumforschung kommt, richtig dumm, dabei war die auch noch, die war mega kacke, die hat nicht richtig funktioniert, die neuen Macs haben sogar HDMI und USB-C glaube ich auch, darf man Link schicken, ja, kannst du machen, oh boy, danke für den Sub, hast du das mit Datev gelesen, äh vielleicht, bin mir jetzt nicht ganz sicher, ne, das habe ich nicht gelesen, dann war das was anderes, ja ich habe Urlaub in zwei Wochen für das komplette Jahr, ja das kann ja Apple eh gut, also wenn das einer perfektioniert hat, dann Apple. Der Vorteil von Mac vs Linux ist halt einfach, wenn man Mac Software entwickelt, ne, kannst dir eh nicht, kannst dir eh nicht unter irgendwas anderes machen, was für ein Ding, ja gut, wer ist dein Born-IT und Windows-Block, Alter, wo bin ich denn da rausgekommen, der ist noch ein Boomer als ich, ich habe keine Ahnung, was, ok, was ist daran jetzt so spannend, es kommt zu massiven Einschränkungen, wir sind gerade auf der Suche nach Möglichkeiten für weitere Kommunikationen, versuche eine gewisse, ja gut, sie haben halt lange gebraucht, ne, komm dir überall mal vor, kannst du dich nicht komplett gegenschütten, ja, das war damals so ein Teil, ja, Kugelschreiber aus der Weltraum, Netzwerkkarte aus der Weltraumforschung, aber Kugelschreiber aus der Weltraumforschung ist bestimmt auch, das ist eine gute Frage, die kann man aber leider relativ kurz beantworten, da kann ich mich jetzt gar nicht großartig drüber auflassen, nein, hat keinen Einfluss, solange er funktioniert, hat er keinen Einfluss, ja, man könnte sich jetzt da irgendwelche wie so schön heißt Edge Cases überlegen, wo es doch einen Einfluss hat, aber in der Regel macht es keinen Unterschied, also wenn du ein DNS eingetragen hast, gehen wir mal davon aus, du hast ein DNS eingetragen, der in China steht, 350 Millisekunden zum DNS, dann ist das zwar lahm beim Surfen, wenn du auf eine neue Webseite gehst und bis dann alles einmal abgerufen ist, aber danach auch nicht mehr, wenn du die Seite refreshst, geht es dann halbwegs schnell und beim Spielen ist es auch nicht das Problem, falls dort überhaupt Namen verwendet werden, dann werden die einmalig aufgelöst und danach ist es eh gecashed, also insofern, nicht wirklich, solange er geht, der Scamtrain ist durch Leute, also solange er geht, wenn er gar nicht geht, hast du Probleme, aber wenn er nur lahm ist, dann ist es beim Spielen egal, Bash by Default, ne, ne, MacOS hat glaube ich Bash standardmäßig, aber irgendeine uralte Version von Bash, also die mitgelieferten Pakete bei Mac sind auch nicht so wahnsinnig aktuell, ja leider, leider, wir haben es ja probiert im Stream, wir haben ja den Mac mal in der VM laufen lassen, ich glaube das war so ein fertiges Virtual Box Aufbauscript im Hintergrund und das lief nicht wirklich gut, ne echt, aber bestimmt auch keine ordentlich aktuelle ZSH, also die ganzen Linux Tools, kann ich mich zumindest noch dran erinnern, waren früher ziemlich alt unter, also diese ganzen Open Source Commando Zeilen Tools, die waren unter Mac immer ziemlich alt, die hatten beispielsweise auch irgendeine AWK Version, die irgendwie 10 Versionen zurück war, die manche Parameter nicht konnte, warum ist Mac OS so schwer zum Laufen zu bringen, warte mal, sag ich dir gleich, mal kurz gucken, dass ich nichts übersehen habe, ja also DNS ist tatsächlich oft an Sachen schuld, dass es nicht funktioniert, aber wenn es funktioniert, dann ist es beim Spielen egal, ja, hab ich, der wollte mir das Video aber eigentlich bis gestern liefern, also falls du noch willst, sag Bescheid, ich brauch bestimmt in Zukunft noch mehr, wenn du sowas professionell ambitioniert machst, so, also, ja, das ist ne gute Frage, das ist aber auch relativ schnell beantwortet, weil Apple keinerlei Interesse hat in der VM zum Laufen gebracht zu werden, was unter anderem dann dazu führt, dass beispielsweise alle möglichen Grafikkartentreiber, die es gibt, also die Grafikkarten, die beispielsweise VMWare gut emulieren kann, dass es dafür nichts gescheites an Treibern für Mac OS gibt zum Beispiel, und dazu kommt, dass glaube ich sogar Apple sagt, man darf Mac OS nicht emulieren unter, äh nicht virtualisieren, unter einem anderen Betriebssystem, das sieht man nämlich unter anderem daran, dass in der normalen, vor allem der Workstation Version, äh, ja, das an Mac zur Auswahl ist, das ist aber nur Kosmetik, also man kann mit nem ganz einfachen Patch das aktivieren, dann steht dann hier auch Mac zur Auswahl, weil VMWare auf Mac kann das ja, Apple hat da einfach überhaupt kein Interesse dran, es ist tatsächlich dumm, weil so ein Mac in einer VM wäre eine schöne Sache, was ein bisschen schwierig ist, also das hab ich auch schon gemerkt, als ich das mal selbst virtualisiert hab, du hast halt das Problem mit der komischen Control-Taste, dass du dich da erst ein bisschen umgewöhnen musst. Hast du dich mal mit Data Science und Machine Learning beschäftigt, na das ist ja so ein großes Thema, ich hab sicherlich schon Gebiete aus beiden Bereichen gestreift, ich mein wir haben ja sogar im Stream mal Personenerkennung in Videofeeds gemacht, das ist doch gar nicht so lange her, ich glaub das war sogar dieses Jahr irgendwann, oder Ende letzten Jahres. Ja, das stimmt, ja aber das ist auch, Apple machts ja absichtlich so, dass man das nicht richtig virtualisieren kann. Äh, was hältst du jetzt, sind das die mit Terraform, muss ich mal kurz gucken, kann sein, dass die, ja das sind die mit Terraform, Vault, Terraform, Konsult, achja die sind das gut, ja das Zeug ist nicht schlecht, das haben wir auch im Einsatz, sowohl Konsult als auch Terraform, Konsult ist ja im Prinzip so eine Art Key Value Store, Terraform ist quasi Jammel, Serveraufbau für die Cloud, das ist schon ok, das hab ich noch glaub ich nicht verwendet, aber die zwei Sachen, also gerade das find ich nicht schlecht, an das ich jetzt nicht sagen will, oh das sind meine absoluten Lieblingstools, aber das kann man schon benutzen. Ich muss mal überlegen, was sind so meine, wirklich, was sind so die Programme die ich echt gerne verwende, also wo ich sag, hey, das ist richtig, richtig nice, macht richtig Spaß damit zu arbeiten, ja ok, JetBrains Rider auf jeden Fall, muss ich sagen, Visual Studio Code ist auch nicht so schlecht, auch wenn's mich manchmal nervt, aber an sich ist es durchaus in Ordnung, gut konfigurierte ZSH ist auch nice, SSH, so basic das klingt, ich glaube, ich glaube ohne Scheiß, ich glaube, eines meiner absoluten Lieblingsprogramme ist SSH, nicht unbedingt weil man sich Remote auf Server verbinden kann, das ist jetzt nicht so, du kannst mit SSH so unglaublich viel machen, was Portweiterleitung angeht, du kannst ganze Netze, du kannst ein Socksproxy machen, also SSH ist so das Universal-Tunnel-Tool schlechthin, was ich schon mit SSH für Dinger gemacht hab, was anderweitig ein riesen Aufwand gewesen wäre, also gerade mit Portsweiterleiten und Tunnel über Tunnel in Tunnel, also SSH ist wirklich sehr poggers, was man damit machen kann. T-MAX ist auch nice, hier siehst du die ZSH, kannst du das aufmachen, SSH, ach, ich glaube, das ist sogar relativ aktuell oder, nicht USH, SSH, guck mal, mittlerweile sind die auch auf Shithub, ne, anscheinend nicht, anscheinend nicht, warum sind die auf Sourceforge, ja, das ist aktuell, warum sind die, Alter, guckt euch die Webseite an, PainsChamp, was ist das für ne Webseite wieder, the fuck, da hat wahrscheinlich die letzten 15 Jahre keiner mehr was dran gemacht, ja, 5.8. ist relativ aktuell, aber die hast du bestimmt nachinstalliert, das ist nicht die, die standardmäßig drauf ist, oder, dass man als Entwickler gezwungen wird, ein Mac, ja, das ist kacke, es gibt, es gibt ein paar, also es gibt eine Ausnahme, die ich kenne mittlerweile, was das angeht, man kann, also was jetzt da schon länger geht ist, man kann den Grad entwickeln, aber letztendlich zum Signen und Uploaden für Apps und sowas brauchst du irgendwie einmalig Xcode, ich kenne jetzt aber, ich weiß leider den Namen nicht, aber ich hab da letztens in Webcast drüber gesehen, es gibt jetzt einen Cloud-Anbieter, der das für dich machen kann, du brauchst natürlich immer noch Code Signing Zertifikat und einen Developer Account und sonst was, aber die packagen deine App komplett für dich, für den App Store, sodass du theoretisch keinen Mac mehr brauchst, aber ich weiß nicht, wie verbreitet das ganze ist, ja, ich werde nach Möglichkeit, angeblich war irgendwann die Tage jetzt wieder ein Event, aber mich hat EA nicht eingeladen, warum wohl, ich könnte, ich könnte mir vorstellen, dass das unter anderem an, dass das unter anderem an, vielleicht diesem Video liegt, ich weiß nicht so genau, ne, glaube ich nicht, wahrscheinlich haben die nur irgendwie einen ausgewählten Kreis gehabt, also ist mir auch egal, juckt mich ehrlich gesagt überhaupt nicht, ich werde dann einfach Freitag was aufnehmen, das passt, Freitag habe ich eh Homeoffice, da kann ich einfach ein bisschen früher aufhören und dann kann ich Battlefield was aufnehmen und so, erster Eindruck raufladen für abends, ich werde aber vorher noch ein anderes Video machen, ich mach entweder, also ich mach Mittwoch oder Donnerstag, wahrscheinlich, wahrscheinlich Mittwoch, da es noch ein bisschen mehr Zeit ist, so zur Einstimmung noch ein Zusammenschnitt der Highlights aus den drei Beta Streams, ja ich weiß es hat ein bisschen gedauert, aber ich kann nichts dafür, wenn alle Cutter so langsam sind, richtig witziges Video, nice, wenn es dir gefallen hat, ich hab es zu einer etwas ungünstigen Zeit hochgeladen, das sehe ich an den Views, aber ich denke mal, das wird sich die nächsten Tage noch erholen, heu ich hab es heute um 12 hochgeladen, Montag 12 Uhr ist selten, eine gute Idee, ach haben sie das jetzt komplett ausgeschaltet, dass du unsight installieren kannst, feels Batman, was hältst du von Wirtschaftsinformatik, eher so nichts halbes und nichts ganzes oder doch ganzes, was ist sinnvoll Windows oder Mac beziehungsweise IT, also das sind ja komplett unterschiedliche Sachen, was hältst du von Wirtschaftsinformatik, das kommt ganz so an, was man machen will, ich glaube nicht, dass man nichts sagen kann, nichts halbes und nichts ganzes, es gibt ja mittlerweile einige Positionen in der IT, wo ein bisschen Wirtschaftskram nicht verkehrt ist und auch in der Wirtschaft, weil Teebra von irgendwelchen Projektmanagern bis irgendwelchen, ach keine Ahnung, es ist nicht meine Welt, aber ich glaube nicht, dass es verkehrt ist, es ist zumindest bei weitem nicht so hart wie beispielsweise ein reines Informatikstudium, ich denke, das ist nichts schlechtes, das zu machen, so und jetzt kommen wir zu der eigentlichen Frage und was ist sinnvoller Windows oder Mac beziehungsweise IT Anwendung, also das kann man so pauschal nicht beantworten, besser in was, besser für Spiele, das ist natürlich Windows, besser für Audio, Video, würde ich sagen nimmt sich mittlerweile gar nicht mehr so viel, vielleicht von der Grundlage immer noch Mac, aber im Serverbereich eindeutig keines von beiden, so in der Linux, das kann man so pauschal nicht beantworten, ey ich habe einen Staubsauger Roboter von Xiaomi, von den China-Chinesen also hier, glaubt ihr heißt V1, ne die Dinger heißen immer Roborock oder sonst wie was, also da musst du bei das Cloud gucken, ob das geht, das Cloud, das Cloud, ich kann richtig schreiben, da musst du hier gucken, ob deiner flashbar ist oder hier, gucken ob deiner flashbar ist, V1 fällt mir halt nix ein was das sein könnte, so, CSS ist blau, CSS ist vor allem eins, nämlich PaintsChamp, nutzt du, was ist MC, Midnight Commander, Minecraft wirds nicht sein, ne mach ich nicht, pur Shell Beste, aha, wusst ich gar nicht, dass die mittlerweile so aktuell sind, dich lacht keiner aus dafür, dass du Wirtschaftsinformatik studiert hast, warum sollten sie, nö, du arbeitest bald bei der Bahn, Poggers oder auch nicht, je nachdem, Usus was ist das, kann man das öffnen, ahja, das ist auch ne Möglichkeit, man kann sich bei Hetzer einen Mac mieten, da kann man auch seine Sachen zeigen, das ist ne gute Idee, wenn man sonst nicht bescheid, wenn man sonst keinen Bock hat, sich einen Mac zu kaufen, ja, eigentlich ist ne gute Idee, das war Mac, Mac as a Service, wo wir grad dabei sind, ihr könnt natürlich mal Ausrufezeichen Hetzer im Chat eingeben, dann kriegt ihr einen 20€ Startgutschein für die Hetzer Cloud, ich bin hyped auf Battlefield 20 240, bist du hyped auf Battlefield 20 240, ich freu mich wirklich auf den Release, ja, super mega gehyped bin ich erst, wenn das nicht so schlimm eintritt wie ich es aus dem Beta Video gesagt habe, ich bin mal gespannt, ich hoffe das Rush dabei ist, in halbwegs präsenter Art und Weise, angeblich ist es ja dabei, aber wie genau, müssen wir mal sehen, das ist so ein Punkt, der bei mir noch offen ist, und halt die ganzen Probleme aus der Beta und halt am Ende gucken, ob es einen Serverbrowser gibt und sowas, kennst du günstiges Mac, nein, da kenn ich gar keine, meine Lampen hab ich auch nicht geflasht, ich hab ja als Lampen eigentlich so gut, also als RGB, oder als dimmbare, als WLAN Lampen hab ich ja eigentlich nur die hier, von denen, die hab ich nicht geflasht, ich glaub die kann man gar nicht flaschen, mit 47 zu alt für Fernstehendem Informatik, bin ich jetzt, das kann ich schlecht einschätzen, ich mein ich bin jetzt 37, das ist quasi bis nochmal 10 Jahre älter, also ich denke nicht, dass man dafür zu alt ist, wenn man da Bock drauf hat, ich hätte da, ich kann es nur aus mir sagen, ich hätte da keinen Bock drauf, ich würde da knarrenlos failen, weil ich dann mega faul wäre und nichts machen würde. Ja wenn du bald bei der Bahn arbeitest, kannst du ja dafür sorgen, dass jetzt alles besser wird, ne da hat ja natürlich ein Einzeler keinen Einfluss drauf, das ist ja auch klar, ich glaube sogar, dass die meisten Leute, die bei der Bahn arbeiten, sich wirklich Mühe geben, aber da ist halt einfach, die Bahn ist einfach shit bei Design, und ich glaube auch nicht, dass wir das in nächster Zeit jemals hinkriegen, genauso, also ich glaube wir kriegen genauso wenig hin, dass es mit der Bahn richtig funktioniert, wie IPv6, das sind beides so Sachen, die klappen einfach nie. Ja das ist die.net 6 Ankündigung, die wollten wir uns gleich noch angucken. Was sagst du zu Mediamark Transomware Angriff, also diesen Saturn Mediamark Schichten, ich habe es nur ganz kurz vorher glaube ich auf GoLam oder Heise gesehen, ich habe keine Ahnung, was da gewesen ist. Am Wochenende haben kriminell die Saber der Mediamark Saturn Holding mit einem Verschlüsselungstrojaner angegriffen. Tja, es geht, wie man in Hessen so schön sagt, es geht um Menschen wie Deloitte, also warum soll das bei denen nicht auch passieren, das ist sowas, das ist schon ganz anderen passiert. Uns ist ja auch sowas ähnliches mal passiert, also insofern. Was in der Nacht von Samstag auf Montag führte eine Gruppe eines Cyber Attacken durch, Eier. Und weiter, es seien mehrere Windows Server, ja was sonst, was, was sonst, übrigens bei uns, wo wir uns auch so Verschlüsselungskram eingefangen haben, das war natürlich auch nur Windows Server, klar ne, es seien mehrere Windows Server mit einem Kryptovirus infiziert worden. 3100 Server, boah, das ist aber ordentlich. Ah gut, da sind VMs auch garantiert mit drin, der logische Server ist damit gemeint, aber das ist trotzdem, das ist so stattlich, ja. Das Problem dabei ist eigentlich, warum haben die so viele Windows Server, warum um alles in der Welt, was braucht man alles, was Windows Only ist? Jetzt laufen die ganzen Laden-IT-Geschichten nur unter Windows, von Kasse bis Anzeigewende und sonst was, vielleicht ist das Windows Only und dann ist es kein Wunder, dass das so viele Windows Server sind. Die Kassen vom Netz zu nehmen, den Computer nicht zu benutzen, ah ok, ja ja, dann ist das sowas in der Richtung. Danke für 100 Millionen Bits, Pog, online nicht betroffen, ja das ist wahrscheinlich auch Linux-Kisten. Die Online-Shops sind bestimmt Lienungskisten. Wir arbeiten derzeit, das ist so eine typische Bullshit-Meldung, ja, weil die irgendwas sagen müssen. Wir arbeiten derzeit intensiv mit internen und externen Experten sowie den zuständigen Behörden, um den Schaden schnellstmöglich zu identifizieren, also die Behörden werden ihnen da erstmal unmittelbar gar nichts, in irgendeiner Art und Weise helfen können, was sollen die machen? Ja, was sollen Behörden da machen? Windows Server neu installieren für Mediamarkt oder was, nee, das ist vielleicht um eventuell irgendwann mal in der Zukunft jemand zu finden, der dafür verantwortlich ist, also unmittelbar bringt das jetzt erstmal nichts, zumal was sollen sie machen, wenn sie den Typ erwischen? Müsste den immer noch irgendwie Master-Passwort geben, falls es eins gibt, also das ist das, das das Geblödsinn bringt nichts. Externe Experten bringen ja auch erstmal unmittelbar nichts, weil die von der Infrastruktur meistens keine Ahnung haben. Man holt sich da nur externe Experten hinzu, weil es gut klingt, oder zum Beruhigen, also gut, ich meine Ausnahmen bestätigen die Regel, ich kann natürlich jetzt nicht von uns, von mir da auf alle schließen, aber in der Regel, wenn bei uns externe Experten geholt wurden in der Vergangenheit, dann haben die selten irgendwas akut dazu beigetragen, dass Probleme behoben wurden, sie waren eher zum Beruhigen da, dass dann der Vorstand sagen konnte, dass man dann dem Vorstand sagen konnte, guckt hier, da wurde was gemacht und sowas, generell ist es unglaublich, wie viel in der IT politische Entscheidungen sind, also zum Beispiel diese ganze Idee dahinter, wir outsourcen Sachen oder wir kaufen das ein von irgendeinem externen Dienstleister und sowas, das ist oftmals gar nicht aus dem Grund, weil man wirklich denkt, dass die das besser können, sondern weil man dann einen Zettel hat, wo drauf steht, wir garantieren 99,998 oder irgendwie sowas, Verfügbarkeit, und wenn das nicht so ist, da kannst du sagen, ja gut, an uns liegt das ja nicht, der Dienstleister hat sein SLA verletzt, was am Ende unerm Strich keinen Unterschied macht, aber es ist so, es ist so wie bei Monopoly, diese irgendwie, geh aus dem Gefängniskarte, normalerweise kriegst du dann als Oberer Manager voll auf den Sack, wenn was kaputt geht und da kannst du sagen, ah guck mal hier, ich hab SLAs gemacht, das ist, ja der Anbieter ist kacke, wir suchen uns einen neuen Anbieter, ich kann ja nichts dafür und anscheinend funktioniert das auch, anders kann ich mir das nicht erklären. Man kann das einfach besser verkaufen, wenn externe das verkackt haben, als wenn es interne waren, auch wenn es vielleicht unerm Strich besser gelaufen wäre, ist schwer zu sagen, also das glaube ich an der Stelle bringt das auch gar nichts. Bei SLAs hast du zum Beispiel Anprobe, das stimmt, das hast du, das hast du, das interessiert dich aber unmittelbar jetzt ja auch nicht, also es ist jetzt vielleicht so, dass du sagen, das ist jetzt nicht so, dass du sagen kannst, hier die SLA wird nicht eingehalten, jetzt, also die Surfer sind natürlich auch nicht schneller wieder da, das haben wir uns gerade angeguckt, also aber so deine Kunden werden nicht zufriedener dadurch, dass du SLAs hast, du könntest im Endeffekt dann sagen, hey durch den Ausfall ist mir so und so viel entstanden, wobei ich da ehrlich sagen muss, kann sein, dass ich es einfach nur nicht mitbekommen habe, aber ich glaube, also bei uns haben auch schon einige Dienstleiste ihre SLAs nicht auf die Kette bekommen, dass es am Endeffekt nicht das war was vereinbart war, ich glaube in Form von irgendwelchen Zahlungen ist da nie was passiert. Was in den vergangenen Monaten haben auf große Unternehmen wiederholt, ja gut, das liegt wahrscheinlich aber auch daran jetzt mal ganz im Ernst, wenn ich hier schon lese, dass das 3100 Windows Systeme sind, wo steht es denn, die 3100 Windows Server sind betroffen, ich gehe mal davon aus, die werden das sicherheitstechnisch auch nicht allzu ernst nehmen, das sind dann wahrscheinlich keine Ahnung 1-2 Leute oder irgendwie so ein Verkäufer macht dann IT Zeug pro Filiale mit oder sowas, das wird wahrscheinlich abenteuerlich sein. So, gehen wir hier rüber. Ja warte mal ab, bis es dann rauskommt, als was du da wirklich machen musst, wenn man zum Beispiel Algorithmenlaufzeiten und sowas abschätzen muss und sowas, wobei da gibt es noch viel lustigere Sachen, habe ich aber keine Ahnung von, ich habe keine Ahnung wie die das machen, PSN wurde, ja das habe ich auch gelesen. Hat man in der Informatik gute Chancen auf einen Ausbildungsplatz, selbst wenn man nicht den besten Lebenslauf hat oder ist es sehr elitär, nein ist es nicht, was, du musst jetzt aber nur mal eine Sache genauer erklären, was meinst du mit nicht den besten Lebenslauf, also wenn du im Gefängnis warst ist das in der Regel immer schlecht, also von wie nicht der beste Lebenslauf reden wir hier, also einfach nur irgendwie mal eine Jahrlücke oder irgendwie keinen guten Abschluss oder was auch immer oder hast du wirklich irgendwas angestellt mal in der Vergangenheit, aber insgesamt kann man sagen, ja du hast gute Chancen und es ist auch nicht sonderlich elitär, warum soll es das sein, die suchen ja händeringend Leute, die haben gar keine Möglichkeit, um halt großartig wählerisch zu sein, ein abgebrochenes Fachabitur, nein ist überhaupt kein Problem, das ist nicht schlimm, was hast du sonst für den Abschluss, wahrscheinlich sind es beim Media Markt auch noch Windows 2003 oder sowas, Windows Server 2003 oder so, was ist denn der letzte, was ist denn der älteste Windows Server, der noch Supported ist, 2008 wahrscheinlich oder 2012, Windows Server Support Cycle, schauen wir mal, Windows Server 2000 ist abgelaufen 2010, 2008 ist vor einem Jahr abgelaufen, nee vor einem vor fast zwei Jahren abgelaufen und jetzt ist es nur noch 2012, aber auch nur mit Extended Support, der 2016er ist eigentlich nur der aktuelle, ha es wird ja witzig, wir fallen auf Anhieb noch Windows 2012 Server bei uns ein, mit denen habe ich zum Glück nichts zu tun, aber ich weiß, dass sie 2012 sind, vielleicht haben wir Extended Support, keine Ahnung, bin ich froh, dass ich das nicht wissen muss, ja danke für die Bits, ja ist eigentlich, muss man ja auch mal sagen, ist das ja gar nicht so wild, wenn du Sachen hast, die noch auf Windows XP laufen, die Leute tun immer so, als ist sie sowas wie, oh nein, da ist Windows XP drauf, so nach dem Motto, als ist die pure Existenz von Windows XP dafür verantwortlich, dass es jetzt alle Viren der Welt installiert hat, das ist ja schwachsinnig, wenn du Systeme hast, die getrennt vom Internet laufen oder ohne Netzwerk, ist das eigentlich kein Problem, problematisch wird es dann halt nur, wenn es beispielsweise Geldautomaten sind mit offener USB Schnittstelle und sowas, gab es ja alle schon, aber Windows XP allein ist ja nicht schlimm, problematisch ist es nur, wenn man in irgendeiner Art und Weise da dran kommt, am schlimmsten natürlich aus dem Internet, wobei das auch schon öfters vorkommt, es gibt ja Suchmaschinen, wo man beispielsweise Kameras und ungesicherte Systeme suchen kann und was da alles dranhängt, da haben ja Leute schon vom Kraftwerk bis zu irgendwelchen Fahrstuhlsteuerungen alles gefunden, Public im Internet, also das ist teilweise abenteuerlich, ist das ein Seagull Emote, weil Seagull hat auch so Dinger, soll es schon Festnahmen gegeben haben, ok, ja dann waren die aber ganz schön blöd, eine andere Firma wurde letztens direkt bei meiner Schwester, weil sie noch Windows 8 und 9 benutzt haben oder so, ja wie gesagt, wenn man das am Netzwerk hängen lässt, ist man, oder sagen wir mal so, zweistufig, wenn man es im Internet hängen lässt, ist es schon mal komplett grob fahrlässig, wenn man es im Netzwerk hat ungesichert, natürlich auch, aber nicht ganz so schlimm. Ja, ich würde es auch einfach probieren, gerade wenn du irgendwie spezielle Firmen mit einer Aussicht hast, die dich auch persönlich interessiert, würde ich halt sagen, schreib auch ein sinnvolles Anschreiben, warum du die so nice findest, ja das habe ich auch gelesen, das war aber auch schon ein paar Tage her oder, ah ne 17.03, ne das habe ich nicht gelesen, was anderes, ja das kommt laufend vor aktuell, das kommt laufend vor, also es vergeht eigentlich kaum ein Tag, dass die nicht irgendwie, irgendeiner verschlüsselt wird oder Kundendaten verliert oder sonst was, ja ist bestimmt auch so, ja also ich kann euch sagen, bei uns, wir hatten ja auch so einen Verschlüsselungstrojaner Angriff, das ist kein Angriff in dem Sinn, also irgendeiner konnte sich mal wieder nicht zusammenreißen, beim, die E-Mail klicken wahrscheinlich, ja und bei uns war das auch so, wir hatten einen ungesicherten, jetzt was haltet euch mal fest, lacht euch kaputt, ein ungesicherten Windows FTP Server, also die beiden, die Kombinationen sind schon hart ja, Windows und FTP und es war glaube ich auch Windows 2012 System oder irgendwie sowas und der lief, der lief auch mit irgendeinem Admin Account, das war fail, richtig verkackt, zum Glück konnte ich da nichts für, weil ich hab mit Windows nix am Hut, eh der Flash Jam ist heute nicht am Start, in deiner Berufsschulklasse war mal einer, der im Knast war, ja soll vorkommen, ich mein, es ist sicherlich nicht förderlich für den Lebenslauf, ich glaube das macht einem sein restliches Leben lang Probleme, sowas, irgendwann kann man es vielleicht mal weglassen, aber wenn das halt noch zu kurz in der Vergangenheit ist, fragen die sich auch, ja aber ok, was haben sie denn jetzt die letzten, letztes Jahr gemacht, aber ich denke schon, dass sich Leute, also gerade wenn das was ist, wo irgendwie einer, wo er noch wirklich relativ jung war, Scheiße gebaut hat und jetzt ein paar Jahre älter ist, also ich kann es mir schon vorstellen, dass Leute sich auch, dass Leute auch noch die Kurve kriegen können, was ist, was ist Vorku, Vorqualifikation vielleicht, Fachoberschulreife mit Qualifikation, aha, schon mal von SQL Injection an Kassen durch eigene Barcodes gehört, nein hab ich doch nicht gehört, aber kann ich mir gut vorstellen, je nachdem was da läuft und das einliest und dann in die Datenbank schreibt oder irgendwas macht, kann ich mir das gut vorstellen, dass das funktioniert, würd mich nicht wundern, Punkt die Fall, danke für den Sub, wir haben eine Winner aus sieben Maschinen als Testunggeber ungesichert, das ist eine schlechte Idee, ja gut, ich mein, solange da keine Ports auf sind, kann da ja eigentlich nicht viel passieren, na die Frage mit was im Netz gemeint ist, also per RDP Zugriff drauf ist schonmal doof, RDP ist möglich, ja dann hätte ich echt Bedenken, würde ich einfach das Kabel rausziehen, oder zumindest die Security sollte einfach das Kabel rausziehen, ja glaube ich auch, also ich gehe davon aus, dass sich da teilweise die Leute, die das richtig drauf haben und vielleicht irgendwie in China, Russland und sonst wo sitzen, dass sie richtig dick Kohle verdienen, also nicht unbedingt die Leute, die es dann letztendlich machen, sondern die, die da halt das sagen haben, ja, das hab ich mir auch gefragt, FDP Server, da mag regeln das, das kann, ey, das mag zwar alles ein bisschen überzogen sein, aber ich kann mir das schon vorstellen, dumme Frage, wodurch unterscheidet sich das normale Desktop Windows von Windows Server, na gut, ich bin jetzt kein großartiger Windows Experte, aber das ist, ich würd mal sagen, im Prinzip ähnlich, wie jetzt ein Desktop Ubuntu oder ein Server Ubuntu, das unterscheidet sich gar nicht so großartig, das unterscheidet sich durch Features, die halt eventuell nur lauffähig sind oder nur nutzbar sind auf dem Server, weil Microsoft sich gedacht hat, ey, das ist eine Sache, das ist Server exklusiv, du kannst ein paar Sachen halt, so was weiß ich, wie Active Directory oder sonstige Sachen, gibt's halt nur für Windows Server, der Colonel von Windows, würde ich mal sagen, ist mehr oder weniger der gleiche, ich mein, Windows Server sieht ja nicht umsonst aus wie ein Desktop Windows, bloß dass du ein paar Assistenten hast, die sich wild angesammelt haben über die letzten 20 Jahre und jeder anders aussieht, um irgendwelche Serverdienste zu konfigurieren, also, so ein großer Unterschied ist es nicht. Ich mein, man muss sich mal überlegen, wenn du ein Windows Server installierst, du hast ja da immer noch einen kompletten Windows Desktop dabei, so großen Unterschied kann's da gar nicht geben. Ich weiß, man kann jetzt Windows Server mit Konsole installieren, wisst ihr aber, was der Witz ist, wenn du Windows Server mit Konsole installierst, dann installierst du eigentlich trotzdem Windows Server mit Desktop, nur dass dann nichts startet, außer, dass du so einen hässlichen Command Prompt beim Login kriegst, im Fenster wohlgemerkt, also Windows Server ohne GUI ist im Prinzip gar nicht ohne GUI, das ist so ein typischer Microsoft Rotz, was auch immer man sich da ausgedacht hat. Tja, das ist schlecht. Sowas gibt's dieses Jahr als Weihnachtsthema, Kobalt, ja, Kobalt, wenn du keine Lust auf Mathe hast, dann musst du eine Ausbildung machen, wenn du Ausbildung machst, ist es mit Mathe nicht so wild, wenn du Informatik studierst und keinen Bock auf Mathe hast, kannst du es gleich vergessen. Wenn du das 11-mal WinGit installierst, Windows Server nicht, das sind unterschiedliche Packages, kann schon sein, ja, du kannst theoretisch ja auch alles mit PowerShell machen. Wahrscheinlich, nicht, dass ich das jemals machen würde. Was, der Battlefield 3 Streamsniper, hä, ach so, jetzt weiß ich, was du meinst, weil ich gestern den Losten im Stream gekillt hab, hab ich ja nix für, ich hab nicht Streamsnipe-ed. Ich hab einfach normal gespielt. Du fängst bei Hashi, Hashi, wie spricht man überhaupt aus, Hashi-Korb an, neis, Remote von hier oder ziehst du da hin? Ich weiß gar nicht, wo die sind, wo haben die ihren Sitz? Kokona, ja, Kokona, Remote, ja, ja, dann sieht man, also eins hat, also eins hat, also eins hat ja, eins hat ja diese ganze Corona-Geschichte jetzt wirklich zum Vorteil gehabt. Dadurch, dass jetzt viele Unternehmen sich gezwungen sahen von, wir müssen von jetzt auf gleich Homeoffice anbieten oder uns gibt es bald nicht mehr, hat sich da viel geändert. Das ist Vor- und Nachteil zugleich, wenn man ein bisschen was kann, ist es für einen gut, dann sind prinzipiell ja jetzt weltweit Unternehmen offen dafür, umgedreht ist es aber halt auch so, dass Unternehmen jetzt auch vermehrt weltweit suchen können, außer wir, wir kriegen das ja gar nicht gebacken. Ihr könnt euch nicht vorstellen, wie oldschool und quasi festgefahren bei uns so die, sagen sie so, die Management-Meinung und sowas ist, was das angeht, das ist echt so letztes Jahrtausend, ja gut Behörden ist noch schlimmer, Behörden ist noch schlimmer, ich glaube Behörden, also Behörden und Bank sind zwar ähnlich, aber Behörden sind noch schlimmer. Ja, also das ist wirklich krass, also die sind so hinten dran, was das angeht und anstatt sich irgendwelche sinnvolle Sachen zu überlegen, machen sie immer nur den ganzen Tag irgendwelche Sprüche so, letztens hat sogar irgendeiner einen Blogpost veröffentlicht, wo er erzählt hat, dass sie jetzt die super Lösung gegen Corona gefunden haben, sie schlagen uns allen vor, eine Lüftungs-App zu installieren und die Lüftungs-App, da kann man dann eingeben, wie groß das Büro ist und wie viele Leute drin sitzen, dann klingelt die Lüftungs-App alle 15 Minuten, wenn man lüften muss, was bescheuertes, das einfachste wäre, die Leute müssten einfach gar nicht hin, da könnten die sich auch nichts einfangen, was passiert denn in zwei Wochen, in zwei Wochen habe ich Urlaub für das westliche Jahr, so Dinger, also das hat uns wirklich, tatsächlich Corona was ganz Gutes gebracht, dass Homeoffice jetzt akzeptiert ist oder davor es nicht akzeptiert ist, jetzt halt richtige Nachteile haben und das früher oder später wahrscheinlich auch akzeptieren werden, ja für das restliche Jahr, ich habe jetzt quasi Urlaub, dann ab hier, ab hier, es sind noch nicht mal ganz zwei Wochen, also doch, es sind zwei Arbeitswochen, ab hier habe ich Urlaub, also ich habe dann 1, 2, 3, Windows, wird das noch irgendjemand, das nach oben zurück geht, ich weiß nicht, Microsoft dabei gedacht hat, ja aber da hat es wirklich, also da hat es tatsächlich Corona mal was Gutes gebracht mit der ganzen Homeoffice-Geschichte, übrigens Leute, ich muss euch mal was sagen, ich muss einmal noch mal ganz kurz was zu Corona sagen, ich habe meine Meinung nämlich geändert, was Impfung und Impfpflicht angeht, ich habe mir die ganze Zeit gesagt, ihr wisst ja, ich bin ja schon lange bestimmt jetzt zwei Monate oder so, bin ich ja doppelt geimpft, hat lange noch gedauert bis es auf die Reihe gekriegt haben, ich habe mir die ganze Zeit gesagt, ich bin grundsätzlich gegen eine Impfpflicht und ich muss sagen so, ja bin ich prinzipiell auch immer noch, also ich will das eigentlich auf gar keinen Fall, aber ich habe mittlerweile so das blöde Gefühl, wir kriegen das anerweitig nicht mehr in Griff, leider werden wir wahrscheinlich auch die Leute, die das jetzt nicht wollen, nie dazu bekommen, Pflicht hin oder her, vielleicht noch ein paar, aber ich glaube, das ist einfach viel zu festgefahren schon, es wurde auch ziemlich viel verkackt, ich denke mal in diese ganze Astra-Geschichte hin und her, erst Junge, dann ältere, dann ältere gar nicht, dann wieder Junge, dann wieder nur ältere, dann diese Geschichte mit den Zettels fürs Restaurant, solltest du ausfüllen, sollte nur dafür verwendet werden, danach kam raus, ja die Polizei kriegt es auch, also man hat ziemlich viel verkackt, ja man hatte Regeln, die heute gelten, dann morgen wieder was anderes, irgendwelche willkürlich festgelegten Grenzen, wann wie, ab welchen Quadratmeteranzahlen oder sonst was in der Richtung, da hat man schon viel verkackt und ich glaube auch viel Vertrauen verspielt in der Vergangenheit und ich habe ja schon oft gesagt, dass du so keinen überzeugst und das Problem ist halt einfach, dass es mittlerweile so festgefahren ist bei vielen Leuten, dass ich glaube, dass auch eine Pflicht in der Art und Weise, wie man sie jetzt andenkt, nichts bringt, weil die Leute sich, die sind so festgefahren, die lassen sich nicht impfen und es gibt ja mehrere Stufen, aber die extremste Stufe ist, du lässt dich nicht impfen, die Polizei holt dich daheim ab, das kann natürlich keiner wollen und das wäre auch rechtlich ja glaube ich nicht denkbar und so, aber ich habe echt so meine Bedenken, dass das halt nichts wird, das ist echt eine schwierige Sache, ich bin da grundsätzlich komplett gegen Pflichten, was sowas angeht. Gut, wenn du die unter 12 Meter beinimmst oder rausrechnen, sind wir schon glaube ich deutlich weiter. Ja, ja das hast du ja auch hier geschrieben, naja aber ich habe da meine Meinung zu ein bisschen geändert, aber ich finde es immer noch nicht gut. Na egal, so, muss ich jetzt mal sagen. Ich habe ja kein Bock jetzt noch mehr zu dem Thema zu sagen, weil das kriegt man schon überall genug. Was ich übrigens auch sehr merkwürdig finde ist, es gibt ja auf YouTube, wenn du auf YouTube gehst, du kriegst jetzt hier mittlerweile diese Corona-Leiste, die immer am Start ist, hier diese News-Corona-Seite und meistens, wahrscheinlich ist es jetzt nicht so, wenn ich draufklicke, das meiste, wenn du das anklickst, hat Kommentare deaktiviert, na guck die hier jetzt natürlich nicht, aber ganz viele Sachen, wenn du hier draufklicke, haben Kommentare deaktiviert. Ich weiß nicht warum, will man sich Moderation sparen oder was ist da los? Denn nicht nur die Welt, Tagesschau auch und sowas. Largest Yu-Gi-Oh! Deck of all time, na dann, guck die Likes, Dislikes, ja, ich glaube, das kann man so pauschal wie vieles nicht sagen, ich glaube, da nehmen sich alle Seiten nicht sonderlich viel, hey, das wäre cool, den würde ich, also ich hoffe ja, der macht wieder demnächst mal Vorträge, weil die fand ich alle gut, vom Xerox bis zum Spiegel bis zur Bahn, die waren eigentlich immer super. In den Kommentaren tummelt sich alles, was sich gegenseitig aufschauen und haten will, aber die Vorträge waren wirklich alle top, wie gesagt, ich glaube gar nicht, dass sich das da so viel nimmt. Ja, das wäre cool, wenn da mal wieder ein Vortrag über irgendwas hält, halt da braucht natürlich auch erstmal irgendwas, das ist, es ist alles, es ist wirklich, du hast mittlerweile fast nur noch Extreme überall, Leute, die sich mal 5 Minuten Gedanken machen, gibts quasi so gut wie nicht mehr, ist genauso, ist genauso, wie wenn es irgendwie um gendern oder sonst was geht, ich persönlich halte ja die Diskussion um dieses Thema vollkommen übertrieben und vollkommen unsinnig, es soll jeder machen, wie er will, die Diskussion darüber ist einfach nur komplette, komplette heiße Luft, weil es ein Thema ist, was simpel ist, weil es für jeden in irgendeiner Art und Weise greifbar ist und weil es, weil jeder irgendwie da eine Meinung zu hat, aber ich glaube die Diskussion darüber ist einfach komplett verschwendet, komplett verschwendete Lebenszeit, das ist, das ist so Scheindebatte irgendwie, niemand gehts irgendwie dadurch besser, wenn da die ganze Welt darüber diskutiert. Ich, ich halte das ganze, also ich halte die, ich halte das gendern doch relativ, also ich benutze das nicht regelmäßig, aber ich halte das im Ansatz sehr relativ pragmatisch, ich verwende das, wenn es sinnvoll ist, zum Beispiel, wenn auf Twitter das Zeichenlimit erreicht ist, wenn das Zeichenlimit erreicht ist, dann schreibe ich dann auch mal, was weiß ich, ManagerInnen oder sowas, was soll am Ende rauskommen, wie immer, egal was gemacht wird, eigentlich kommt nix dabei raus, das ist ja die Sache, es gibt sehr viele sinnlose Diskussionen um total unwichtige Sachen und ich finde das gendern ist eine ziemlich unwichtige Sache. Ja, das wird darauf rauslaufen, ja, also man könnte mit deutliche wichtigere Sachen diskutieren, soll jeder machen wie er will, solange mich keiner oder irgendjemand anfängt die anderen Leute bekehren zu wollen. Hä, ja, aber Leute, wie gesagt, ich betrachte die Diskussion darüber schon komplett eigentlich als verlorene Zeit irgendwie, komplett überflüssig. Ja, man könnte sich zum Beispiel mal überlegen, wie man das klimatechnisch hinkriegen will, aber das wäre mal was, was, und zwar nicht nur hier, sondern allgemein, wäre eine schöne Geschichte. Ja, es wäre eine schöne Geschichte, dass es nicht mehr so viel Mord und Tod in der Welt gibt. Es gibt viele Themen, die ich tatsächlich für sehr wichtig halte, aber gendern ist keine davon. Wie war das auf? Was? Tja, immerhin. Wie gesagt, was man jetzt im Chat, was man jetzt schon schön daran sieht, jeder hat eine Meinung dazu, und jeder ist dabei, es ist richtig, und jeder ist ganz scharf darauf, über dieses Thema zu diskutieren. Das ist so, das ist ein Thema, da wird so viel heiße Luft daran verschwenden und sich dran hochgezogen, aber im Endeffekt kommt da nichts bei raus. Wenn das was Sinnvolles ist, wird sich das mit der Zeit durchsetzen, und wenn nicht, dann nicht. Das sind wir, vielleicht in fünf oder zehn Jahren sind wir schlauer. So, wir gucken uns jetzt mal ein paar Server-Racks an von Leuten, wo ich ein bisschen zu ablösen kann, warum die so viel Zeug haben, was so viel Strom verbraucht, nichts bringt. Ach so, wir wollten noch die C-Sharp-Geschichte gucken. Äh, ups, was habe ich jetzt hier angeklickt, das wollte ich hier anklicken. Habe ich da angeklickt. Microsoft Teams seems to have enough, ja gut, was da abgeht ist, also ich meine das nicht bei Microsoft generell, sie übertreiben es an allen Fronten, ich sage nur, VLC und der Christmas Head, also VLC hat ja an Weihnachten immer ein Hütchen, ein Weihnachtsmannhütchen auf. Und Visual Studio Code hatte das auch und sowas, meine Güte. Wow, okay, was, was, was, Alter, was hat Microsoft, was hat Microsoft gesagt, dass man ke... Ist das jetzt richtig? Ich glaube, das ist procken. Ah, jetzt, okay, okay, was, was, was haben sie denn gesagt, wo musstest du denn kecken bei? Ja, ganz bestimmt, ganz bestimmt, das Jahr des Linux-Desktops, ja natürlich. Ja, das stimmt tatsächlich, das Jahr des Linux-Desktops, könnte man jetzt so echt, man könnte es wirklich sagen, das Jahr des Linux-Desktops ist jetzt, wo es ein ordentliches WSL und WSLG heißt das, glaube ich, gibt, also für die grafischen Sachen tatsächlich, tatsächlich könnte der gute Linux-Support unter Windows wirklich dafür sorgen, dass es so eine Art Jahr des Linux-Desktops wird, ja, da hat er nicht unrecht. Was, sie haben eine neue Policy, was, ey, das können die machen, wie sie wollen, auch wenn es teilweise ziemlich merkwürdige Ausmaße annimmt. Was, seg, das habe ich übrigens, das haben wir doch letztens schon in einer Präsentation gesehen, das machen die, das machen die aus zwei, das machen die aus zwei Gründen, das ist nicht so sehr gendern, das ist, die beschreiben, wie sie aussehen, falls Leute Sehbehinderung haben. Das finde ich gar nicht schlecht, gut, ich meine, ob es jetzt die ganze Welt wissen muss, ob es jetzt ein She oder ein Her oder ein sonst wie ist, kann man sicherlich darüber diskutieren, aber das Erwähnen, wie Leute aussehen, für blinde finde ich schon mal nicht verkehrt. Ein Caucasian Man, naja, gut, warum nicht, ah, das ist ja so, die haben einen, die haben ein Kultur da mittlerweile. Man könnte schon sagen, jetzt ist es ein bisschen übertrieben, aber die Beschreibung für Leute mit Sehbehinderung finde ich ganz gut. Greta, danke für den Sub, nice Video zu den Sahnexperten, mein Kollege erzählen auch immer von einem, der von seinem Urlaub noch schnell was, ja, ja, solche Dinge hatten wir auch schon öfters. Ja, die Kontroverse, klar, habe ich die mitbekommen, mittlerweile wurde die Sache wieder reingepatcht. Ich muss jetzt mal noch mal so ganz allgemein was sagen, weil die Fronten zwischen dafür und dagegen sind bei nahezu jedem Thema, egal was es ist, ja, von Gendern bis irgendwie Flüchtlingsthema, es ist egal, welches Thema du nimmst, ja, die Fronten sind mittlerweile, meinem Eindruck nach, bei allen diesen Themen quasi verhärteter als sie das jemals waren, also sprich, du hast ganz wenige Leute noch, die möglich fünf Minuten in sich gehen und sich darüber Gedanken machen, was eigentlich Sache ist, du hast entweder Leute, die strikt gegen irgendwas sind, du hast auch viele Leute, die strikt für, ohne, dass weiter zu dem Thema, für irgendwas sind, es ist nun mal so, dass fast nichts schwarz oder weiß ist oder fast nichts null oder 100% ist, ja, überlegt euch mal, wenn ihr aus dem Flugzeug springt, ohne Fallschirm, die Chance, dass ihr sterbt, ist nicht 100%, die ist wahrscheinlich ziemlich in der Nähe von 100%, aber die ist nicht 100%, also es gibt, also auch die Chance, dass die Erde eine Scheibe ist, würde ich sagen, oder umgedreht, dass die Erde keine Scheibe ist, die ist auch ziemlich hoch, aber, also es gibt kaum was, was 100% ist oder 0% und aus diesem Gesichtspunkt würde ich sagen, man sollte mal versuchen, auch wenn es einem schwer fällt, sich ab und zu mal zumindest ein paar Stimmen von der Gegenseite anzuhören, ob da nicht vielleicht auch was Sinnvolles dabei ist, weil wie gesagt, es ist eigentlich fast nie alles 100% falsch oder irgendwie, ich war unhinterfragt, alles immer, was einer sagt, 100% nicht richtig und selbst das ist nicht 100% sicher, das ist ziemlich sicher, gut C++ ist zu 100% Müll, ja das stimmt, das ist einer der wenigen Sachen, die zu 100% 100% sind, das ist, ja, aber das wäre tatsächlich nicht schlecht, wenn die Leute ein bisschen mehr miteinander reden würden, anstatt sich abzuhaten, weil die ganzen Hater und ich spiele jetzt auf niemanden speziellen an, ich muss das vielleicht anders ausdrücken, weil die Leute leben eigentlich bloß noch davon, das siehst du ganz besonders auf Twitter, also ein Großteil ihres Lebensinhalts bei so extremen Leuten ist der Hass eben auf die anderen Leute, die suchen den ganzen Tag nur danach, nach Sachen, die sie hassen können und es egal, welche Seite du nimmst, da nimmt sich kaum einer was, dabei muss man auch mal sehen, dass die, ich will sie jetzt nicht Hater nennen, weil das Wort ist zu vorbelastet, sagen wir so die Extremisten auf beiden Seiten, denn ist glaube ich gar nicht klar, dass sie sich in vielen Bereichen tatsächlich ähnlicher sind, als sie eigentlich wahr haben wollen, ja vielleicht in ihrem Kernthema nicht, aber die Bereitschaft ihre Überzeugung mit Gewalt durchzusetzen ist bei allen Seiten da und was ihr auch bei allen Leuten, bei allen Extremisten sehen werdet ist, es gibt einen gemeinsamen Feind, den können die überhaupt nicht ab und das ist die Polizei, es ist egal, ob du jetzt irgendwelche Nazis nimmst oder ob du irgendwelche, was hast du da im Gegenzug, irgendwelche Klimagipfel sonst wie Demonstranten nimmst, es ist vollkommen egal und die Randale machen und Autos anzünden, es ist vollkommen egal, beide mögen nicht die Polizei, warum mögen die nicht die Polizei, weil die Polizei bei Extremen die einzige quasi, ich würde sagen so Kraft ist, die zwischen ihnen und ihrer Zerstörungswut steht, deswegen mögen die alle nicht die Polizei, ja und die sind sich in vielen Bereichen ähnlicher als ihnen das glaube ich klar ist, too late, wieso ist es 21 Uhr, ja das haben wir ja letztens, das ist übrigens das geilste E-Vote aller Zeile, gibt es zwar eine DB Lampe noch, ja die Lampe gibt es doch, aber die verwende ich nicht mehr, so, ja das ist das gleiche wie bei irgendwelchen Flacherdleuten, ach Gott das ist ja auch, hey und selbst da höre ich es mir teilweise an einfach aus Belustigung, die Amis sind da aber lustigerweise eh sehr aufgeschlossen dafür, ich weiß gar nicht woran das liegt, vielleicht weil es da auch so viele Kreationisten gibt oder so, wer ist denn der dritte Weg, sind das irgendwelche Rechte, sagt mir nichts, aber dann fliegen die Fetzen wenn die beide aufmarschieren, keine Ahnung, ich kenne mich mit solchen Organisationen nicht wirklich gut aus, was, ah ok, sagt mir nichts, aber ihr könnt euch sicher sein, einem sind die sich einig, alle beide, die Polizei mögen sie nicht, ich könnte mir sogar vorstellen dass tatsächlich sowohl Linksextreme als auch Rechtsextreme die könnten super abends zusammen sich besaufen gehen, solange es hier nicht um ihr Kernthema geht, wären die sich in vielen Bereichen glaube ich direkt einig, so nach dem Motto wir trinken jetzt da drauf hier so alle Bullen, ihr wisst ja was da immer so kommt, da wären die sich einig, die würden sich super verstehen, es darf halt bloß nicht um ihr Kernthema gehen, da würden sie sich wahrscheinlich nicht verstehen, das hört mich alles nicht wundern, ja Verschwörungstheorien, das ist ja normal, dass Verschwörungstheorien gerade bei etwas geistig eingeschränkten sollten nicht, also recht hoch im Kurs stehen, ja, na gut, so wir gucken uns jetzt, wir gucken uns jetzt die.NET Release Notes an, aus genug mit aktueller Thematik beschäftigt, zeig mal her, gibt es da irgendwas spannendes, was wir noch nicht gesehen haben, Massive Gains in Performance gibt es, zeig mal her, Massive Performance Improvements, zeig her, guck mal, der JIT ist am Start, nicht Shit Git, nein, der Just in Time Compiler, die sind aber wirklich, das muss man Microsoft tatsächlich, das muss man denen wirklich mal lassen, also die haben die letzten Jahre über wirklich viel gemacht, was Optimierung und Performance angeht, also .NET, also ich will jetzt nicht sagen, dass das auf einem Niveau ist wie mit C Rust und vielleicht, naja, ich muss es leider sagen, C++, das nicht, aber in den, wenn man sich nicht so in Randbereichen bewegt, wenn man jetzt nicht quasi pro Schleifendurchlauf 50.000 Objekte anlegt, dass der Garbage Collector Probleme macht oder sonst was, ist die Performance da gar nicht mehr so großartig unterschiedlich, also C Sharp Sachen und Java muss man auch sagen, ja, also es ist ja nicht nur C Sharp, das ist gar nicht mehr wirklich bedeutend langsamer als C oder C++, wie gesagt, wenn man jetzt hier nicht von den Extremfällen ausgeht, du wirst natürlich immer Performance-kritische Sachen finden, die du in so unmanaged Sprachen wie C deutlich performanter und schneller hinkriegst, genauso umgedreht wirst du auch immer was finden, was du mit Hand Optimated Sampler immer noch schneller als C hinkriegst, ja, sowas gibt es immer, aber wenn man mal von dem Großteil der Fälle ausgeht, dann ist es mit C Sharp und Java performanstechnisch ziemlich nah dran und was man nicht vergessen darf, wisst ihr was performanstechnisch auch gar nicht so weit weg ist, Javascript, natürlich in der ganze Ecke langsamer immer noch, aber ihr Kobold, aber Javascript, Javascript ist auch mittlerweile unglaublich optimiert, glaubt man gar nicht, aber mit V8 hat es angefangen und mittlerweile ist V8 so optimiert, dass es wirklich schnell ist, ok, also zeig mal, haben wir irgendwelche Benchmarks oder so, Benchmark, übrigens richtig coole Library, welche ich noch nicht verwendet habe, richtig poggers, habe ich sogar mal auf der Arbeit verwendet, für was komplett unrelated ist, also weder irgendwie.NET wirklich Performance messen, wir wollten gucken, wie schnell man Dateien lesen und schreiben kann über NFS auf Azure Files und da habe ich ein.NET Programm gebastelt, was das machen, habe ich mir gedacht, hey, warum schreibst du nicht einfach Benchmark an die Methode obendrauf und kriegst dann ziemlich gute Messung, das hat echt gut funktioniert, ich finde das ist eine poggers Library, richtig nice, so also, Performance, Performance, Performance, ja ist ja gut hier, jetzt übertreibst man nicht, Performance, ich brauche irgendwelche Crafts, ich bin jetzt, ich mach jetzt mal wie irgendwelche Vorstandsmanager, ich brauche ein Tortendiagramm oder sowas, ok, was ist schneller, running this.NET vs..NET 6, changed, ah, utf8 formatter, try format, value buffer, ok, das ist irgendeine low level Geschichte, was macht das, standard format D2, ich weiß nicht mal, was das überhaupt macht, formatiert das, formatiert das irgendwie Binary als String oder so, was macht das überhaupt, keine Ahnung, zumindest ist es jetzt schneller in.NET 6 und sogar ziemlich, ziemlich gut hier, 20% schneller, ah, exzellent, jetzt können wir uns auch die Optimierung in Assembler angucken, alles klar, das brauche ich jetzt, ähm, find, find ist jetzt auch schneller, mit.NET 6, huge optimized, alles klar, tuppelstells compare ist viel, viel schneller, ja ex obvious, obvious, obvious, here's what's going on in.NET 5, alles klar, cringe, wer es nicht versteht, ich meine zwar, ich meine zwar offensichtlich, dass das langsamer ist oder, ja chat, sehe ich auch so offensichtlich, dass das langsamer ist, also das sehe ich sofort, ok, kommt da noch irgendwas, wo ich jetzt auch ein bisschen was mit anfangen kann, echt so, ja echt so, ah, enums, boah der will es aber echt wissen, der Dude hier, wie lange ist denn das, alter, ist ja mal gut, ich brauche Grafen, ich brauche Grafen, das ist ein Graf, nee, hashing, ja ok, ok, wir gucken uns das mal weiter an, das gucken wir uns jetzt nicht alles an, was hat denn der Sarix für eine Frage, hat er doch gar nicht, oder, einfach nur, jubadet wieder, jubadet vom Chat, warum ist das langsamer, ich sage cringe, wer es nicht weiß, das ist so obvious, das werde ich hier bestimmt nicht erzählen, also das ist wirklich ein Deep Dive gewesen, die wollten es wissen, ok, was haben wir sonst noch schöne Sachen,.NET Monitor, OpenTelemetry, WebAssembly, HTTP 3, JSON Processing, Mathematics,.NET 6 Highlights, Production Stress Tested, ja Bing läuft glaube ich schon unter.NET 6, ich weiß gar nicht, ob das hier drinsteht, also Bing läuft glaube ich mit.NET, ich weiß jetzt nicht, ob das so ein großes Aushängelschild ist, aber Bing, ja, das ist halt Bing, ja, so, 3 Jahre Supported Unified Platform, ja außer Linux, außer Linux, also falls Sie auf Maui raus wollen, Performance, Greatly Improved, das hatten wir doch gerade schon, C-Shop 10 Language Features haben wir uns angeguckt, Visual Basic, dazu fällt mir bloß ein, ja, Visual Basic, ach guck mal, Hot Reload, das was ich erst rauskicken wollte, das was ich erst rauskicken wollte steht jetzt da drin, JSON APs, das haben wir auch ausprobiert, das ist wirklich besser, Peile aus, Single File Apps, Extraction Free, ah, das ist gut, das ist gut, ja, das wäre cool, wenn das noch weiter verbessert wird, dass die ausführbaren Dateien die rauskommen kleiner sind, ich mein wenn man mal so eine Go Anwendung vergleicht mit einer.NET Anwendung, das ist halt schon ein riesen Unterschied, wenn du eine Go Anwendung anguckst, die ist dann am Ende irgendwie 3 oder 4 MB, was schon immer verdammt viel ist versus irgendwie, ich glaub dann Hallo Welt, Go ist irgendwie 2,5 MB oder so, Static, aber zumindest ist es halt im Vergleich zu irgendeinem C Programm, was irgendwie 50 Byte groß ist oder so, immer noch der Witz, aber.NET ist halt glaube ich 35 MB groß, weil da ist halt die komplette Runtime fast ohne irgendwelche, also ohne irgendwas wegzunehmen mit dabei, so vielleicht kriegen sie das hier gebacken, Unified Platform, ja, Unified wie gesagt solang es nicht Linux ist, weil mit GUI auf dem Desktop, das stimmt nämlich überhaupt nicht, also Linux GUI geht damit nicht, dynamic, was für ein Ding, pgo, ken, was auch immer, Benchmark hatten wir gerade schon, filo improvements, oh huge, also wenn man ganz viele 100 MB Dateien schreibt, flutscht es jetzt richtig, wusste ich gar nicht, warum ist das vorher so langsam gewesen, ganz schön langsame SSD oder, ich mein 100 MB 1,3 Sekunden, ne ordentliche SSD macht 5-600 MB die Sekunde und das ist dann auch nicht mal an die schnellsten die es gibt, wieso noch Windows 10, weil ich keinen Grund bisher hab für Windows 11, eher Gründe dagegen beispielsweise, dass die Taskleiste sich die Gruppierung, die Gruppierung nicht mehr ausschalten lässt, faster interface checking, alles klar, C Sharp 10, das haben wir uns schon angeguckt, das haben wir uns letztens im Stream angeguckt, haben wir uns auch angeguckt, F Sharp 6, das ist nur für Big Brains, das ist die funktionale Programmiersprache, quasi so die Nummer eins für das.NET Framework, also wenn man besonders hohen EQ hat, kann man F Sharp programmieren, ich finde schon das Example nicht sonderlich, F Sharp for Fun and Profit, ja das geht jetzt noch, aber ich finde F Sharp ist wirklich, das ist, funktionale Programmiersprachen brauchen einfach komplett anderes Hirnlayout, wie normale, so Making F Sharp Faster, bla bla bla, Hot Reload, Hot Reload ist ja eher was für GUI und Blazer glaube ich, das könnten wir tatsächlich mal ausprobieren beim nächsten Streams, für mich ist die normale Sprache die Funktionale, gut hat jeder so sein, Security viel besser jetzt, alles klar, Arm 64, ahja das ist gut, Windows benutzt das wirklich jemand, benutzt Windows für Arm wirklich irgendjemand, hat das, macht das jemand, Mac OS Arm 64, das ist wichtig, Arm 64 Performance, BÄN, bald ist übrigens auch wieder die jährliche, diese komische.NET Konferenz, die einfach nur.NET Konferenz heißt, Microsoft und Benahmung, dann kriegen wir wahrscheinlich ein paar Sachen erzählt zu dem, was hier drin steht, aber ein bisschen hübscher aufbereitet, Windows Container, Paintschamp, könnte sein, dass das morgen losgeht, ja, Debian 11 Support, nice,.NET Monitor habe ich noch nie verwendet, das ist irgendwie um Statistiken voll seine Apps rauszubekommen, eigentlich ganz nice, Structured Jason Logs, alles klar, Support für Open Telemetry Matrix, brauche ich nicht, Windows Forms, ich mein, ich finde das so geil, Windows Forms im Jahr 2021, Improvements für Windows Forms, was zum Teufel, ich mein ich finde es ja gut, nachdem Microsoft es immer noch nicht geschafft hat, nach 30 Jahren mal ein gescheites UI Framework rauszubringen und zu aktualisieren, oder was, bleibt ja außer Windows Forms nichts übrig, das ist ja, Microsoft hat ja mit ihrer komischen GUI Framework Politik mit dazu beigetragen, dass Elektron sich überhaupt durchgesetzt hat für Desktop Anwendungen, WPF ist auch der Sack, WPF ist einfach nur die komplizierte Variante, nein das stimmt nicht, WPF hat schon einige coole Sachen und hat auch viele Sachen wie Two Way Data Binding als eines der ersten GUI Framework gemacht, aber WPF ist auch hoffnungslos outdated und ich finde, also ich persönlich bin nie mit WPF großartig warm geworden, ich fand WPF immer unglaublich bloated und wenn du WPF programmieren wolltest, so dass es nicht ultra bloated wird für kleine Anwendungen, zum Beispiel wenn man einfach Code Behind verwendet hat, anstatt irgendwelche MVVM, was hast du nicht gesehen, zig Frameworks mit Locator dahin und hier rum und Message Cues, wenn du das nicht gemacht hast, wurdest du von den WPF Leuten schäpp angeguckt, so nach dem Motto, das ist aber nicht best practice, so geht das aber nicht und ne, also ich bin mit WPF nie warm geworden. OpenTelemetry ist Prometheus, ah das ist nice, das heißt ich muss mein Prometheus Exporter nicht mehr selbst programmieren, das finde ich gut. Minimal Applications, ja das ist tatsächlich cool, sowohl die Minimal Apis als auch diese Geschichten hier, das ist ja absolute Augenweite die Anwendung hier, Single File Apps, das finde ich tatsächlich interessant, das ist auch so ein Thema, wo es Microsoft ein bisschen verschlafen hat, die Leute haben seit Jahren gesagt, sie wollen Single File Apps, also dass du es kompilierst und es fällt ein einfacher Executable raus und sonst nix, das hat, da haben die lange für gebraucht, mittlerweile ist es ganz gut, sie könnten aber, hätten aber schon besser dastehen können. Microsoft hat die ganze Zeit gesagt, wieso ist doch kein Problem, mach Self-Contained Ordner und lass dann von einem anderen Installer, lass von einem anderen Installer draus bauen, ich wollte keinen Installer für Linux bauen lassen oder so ein Scheiß, ich wollte einfach ordentliche Single File Apps haben, dass du es auch für Sachen verwenden kannst, wo Go beispielsweise beliebt ist, Go ist ja, also eines der wirklich vorzeige Dinger von Go ist halt einfach, dass es Self-Contained Single Executables sind, die lauffähig sind auf jedem Linux seit Colonel 2.6.32 oder so, kannst du mal im Stream einen Prometheus Exporter schreiben, haben wir gemacht, ist immer schief, ich frag mich aber bitte nicht, wie der heißt, aber wir können, ich kann es immer aufschreiben, das können wir in nächster Zeit mal wieder machen für irgendwas spannendes, äh Stream Ideen, aber ich kann dir sagen, es ist nicht ordentlich schwierig gewesen, das wusste ich nicht, aber ich könnte mir vorstellen, wenn du die passende, oh wie heißt das, Go Enf, heißt das nicht Go Enf bei denen, wenn du da das passende angibst, dann läuft es auch wirklich überall. Also ich kann zum Beispiel Go Sachen kompilieren für, also auf meinem Linux für einen Raspberry Pi, das funktioniert. Also dann quasi x86 zu arm, oder was heißt zu, dass jetzt Arm Executable rausfällt, ich hab da eine Nachricht geskippt, echt, wo denn, was denn, poste einfach nochmal, ach hier, ich, ach so ja gut, was soll ich denn dazu sagen, du musst TPM aktivieren, ja gut, ich hab's auch nicht aktiviert, da musst du nochmal posten, hab ich nicht gesehen, das hab ich wirklich übersehen, der Chat ist aber auch mit dran schuld, weil die hätten sagen können, MC O'Righty hat eine Frage Streamer, hab ich extra ein Makro dafür jetzt, und ich weiß, der Chat spammt das auch mal ganz gerne, nice video today, freu mich auf die nächste Hot Story aus der Welt, how not to be an angel big brain IT expert, der war ja nicht big brain der IT expert, der war eher low brain, zum thema funktionale Programmierung, ja 40 Minuten, alles klar, alles klar, soll ich denn hier noch durchskippen, you can use the setting, ja meine Güte, macht halt noch bitte schön längere Optionen haben, include native libraries for self extract, obvious, komplett obvious, was der Microsoft überlegt hat, ist Taiwan ein unabhängiges Land, das ist die Frage, ob ich meine social credit score pushen will oder nicht mit der Antwort, also für unsere chinesischen Zuschauer, sowohl Hongkong als auch Taiwan, gehören natürlich zu China, und für die Zuschauer der restlichen Welt natürlich ist es ein unabhängiges Land, so, direkt Aliexpress, 20% da teurer wahrscheinlich, ja, das ist gut, das ist gut, dass das geht, jetzt kannst du nicht nur trimmen, du kannst nicht nur Single File machen, du kannst jetzt auch komprimieren, das finde ich nice, ja, das ist cool, vielleicht, ich meine vielleicht schaffen wir es ja wirklich mal auf, irgendwann, vielleicht schaffen wir es ja irgendwann mal, dass wir unter 10 MB kommen, für ein Hallo Welt mit.net, self contained, trimmed und compressed, wie den Big Mac, alles klar ich spreche dich wie den Big Mac aus, kein Problem, was für ein Ding, ok, quick muffs, die muffs AP wurden improved,.net 6 introduced new helpers working with power of 2, aha, also kann man jetzt besser hoch 2, bit operations, äh, ach der guckt, ob das ein Vielfaches von 2 ist, ok, das ist tatsächlich ganz nützlich, kann man bestimmt mal gut gebrauchen, kannst du mir nochmal erzählen, wie du auf deinen Twitch Username gekommen bist, äh, das weiß ich nicht, wie ich darauf gekommen bin, ich weiß nur, dass ich den schon eine ganze Weile habe, bevor ich selbst anfangen wollte zu streamen, das sind alles ewig lange Videos, so jetzt gucken wir uns mal ein bisschen Racks von anderen Leuten an, für uns sind die Bluetooth Thermometer ja, bei mir melden, aha, vielleicht hast du eine noch neuere Version, also die gehen bei mir, wir haben es ja letztens im Stream geflasht, das hat danach funktioniert und ich habe jetzt unten im Bad noch eins hängen, also ich habe oben im Bad und unten im Bad eins, oben im Bad ja schon länger, unten im Bad geht auch ohne Probleme, Performance Oriented APs, Sincos, das kann ich nicht aussprechen, was Reciprocal Square Root Estimate, meine Fresse, boah du Scheiße, das kann ich nicht, das ne, das werde ich nicht verwenden, das kann ich nicht aussprechen, was war zuerst da Wupplos oder Monster FPS, ich weiß es gar nicht, ich weiß es gar nicht, also der Account war auf jeden Fall später da, aber so sinnlose Random Namen, für MMO Charaktere, die einfach nur Items halten sollen und sowas, es könnte sogar sein, dass es Wupplos früher gegeben hat, Big Int Performance, oh, Bam, chat, ich hab mich ja vor einigen Jahren richtig gefreut, als sie Big Int aufgenommen haben und ich muss euch ehrlich sagen, ich hab Big Int seitdem nie verwendet, noch nie, in keinem wirklichen Projekt bisher, habt ihr schonmal Big Int gebraucht, also im Studium, ja gut, theoretisch aber, theoretisch braucht man es ja auch, also Big Int ist halt für alles, was du nicht CPU-häppchen gerecht in abbilden kannst, bis quasi, bis zu nem Int 108, also was ist ein Int 128, ein Dezimal, also alles, was größer ist und es macht intern, macht es halt quasi String Magic für Zahlen, Complex, Apis, Bit Converter, Better Parsi, ok, ich glaube, das müssen wir uns jetzt nicht alles durchgucken, excellent, excellent, ok, gut, alles, Server-Rack, das gibt, das gibt mir, ok, Leute, ich würde sagen, wir fangen mit dem RGB, mit dem RGB-Rack an, weil wir wissen ja, das wichtigste im Server-Raum ist RGB-Beleuchtung, einfach der Performance zuliebe im Endeffekt auch. Das Flutsch durch die RGB ist nochmal extra, was bin ich da sehend überhaupt, das ist die RGB-Beleuchtung, was ist das, Philips, Philips, was, Tube bestimmt, er hat das sehr ordentlich, muss ich sagen, sieht bei mir fast ein bisschen aus, wie das, was ich von dem Werkzeug-Wand verwende, ok, Raspberry Pi mit Lüfter, ich mein, der Raum ist ganz schön leer, oder, warte mal, wenn er jetzt rauszoomt, oder zoomt jetzt gleich raus, da ist nicht viel drin, da steht ein Rack und hier neben steht noch ein Nass oder sowas wahrscheinlich, aber wobei, bisschen Platz, ok, der Raum ist schonmal größer wie meiner, Kokona Haus, Alter, das ist typisches Kokona Haus, einfach, einfach mal in die Wand ein Loch gesägt, easy, easy, aha, es, aus wie ein Briefeinwurf, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, okπο свое, knee Чей��actic, Nasty tatsächlich. Nest käme nie ins Haus, ganz ehrlich habe ich immer einen riesen Bogen drum gemacht und letztens, also jetzt gab es ja, ich habe es ja immer nur, immer nur beobachtet, weil ich habe es ja nicht. Erstens, wo wir, wo sie mir zum erstenmal negativ aufgefallen sind, wo sie ihre komische API abgeschaltet haben, wo Google dann einfach gesagt hat, nö, machen wir nicht. Und das nächste, wo es beim Netzwerkausfall nicht mehr richtig funktioniert hat. Also Nest kommt mir nicht ins Haus. Kühlung, kein Airconditioner, doch, das ist Kekona Haus, die haben bestimmt, die Amis haben überall eine Klimaanlage. Ja, das habe ich bei mir auch so. Das ist typisch Kekona, richtiger Kekona Schalter, wieder ein weiteres Loch in der Wand. Das habe ich bei mir im Serverraum mittlerweile auch so gemacht. Das ist so ein Bewegungssensor und wenn man da reingeht, dann erkennt es das automatisch und macht Licht an der Decke an. Ja, es funktioniert ähnlich. Oh, guck mal, da ist eine Cloud, das ist bestimmt sein Kabelmodem oder sowas in der Richtung. Warum? Alter, der hat ja nur in seinem Serverraum mehr RGB als ich im ganzen Haus. Warum? Ich meine, es sieht cool aus, okay, das lasse ich mir gefallen, aber es hat absolut keinen Sinn. Wunderbar, das brauche ich im Serverraum auch alles unbedingt. Aber ehrlich, ich meine, ich habe in meinem Serverraum auch RGB-Lampe hängen, das hat man ja gesehen bei mir in dem Video, wo ich es gezeigt habe, aber ich hatte halt einfach noch eine übrig und die ist auf normal helles weißes Licht gestellt. Ich stelle da nie was dran rum, außer zu Demonstrationszwecken, komplett übertrieben. Aber es sieht cool aus, das muss man ihm lassen. Guck mal, der hat einen LED-Strip da drin, im Rack, auf die Idee wäre ich ja gar nicht gekommen, einen LED-Streifen ins Rack zu pappen. Ja, das hat mein Motion Sensor auch, der hat auch einen Thermometer, ich weiß jetzt, wie warm es im Serverraum ist. Und wisst ihr, was ich mit dieser Information mache? Nichts. Ich weiß es einfach, wenn ich es wissen müsste, aber ich gucke da nie drauf. Ich meine, man könnte natürlich dann abgedrehte Sachen machen, man könnte quasi die RGB, das Licht quasi passend zur Serverraum mit Temperatur einschalten, also nicht einschalten, was laber ich denn, die passende Lichtfarbe zur Temperatur machen oder sowas, aber das ist mir die Mühe für den Raum, wo ich einmal in der Woche reingehe und nicht fährt. Wobei ich ja mittlerweile schon öfters in meinen Serverraum reingehe, weil ich habe ja die Werkzeugwand auch da. Jedes Mal, wenn ich Werkzeug brauche, gehe ich ja da an die Wand und hole dann irgendwie alles Mögliche, was ich da halt brauche, von Heißkleber bis Schraubendreher bis alles Mögliche, was halt da hängt. Und dann mache ich einfach das Licht an und wenn ich rausgehe, timeoutet das und das Licht geht wieder aus nach ein paar Minuten. Also ich bin der Meinung, dieses Philips Hue Zeug ist absolut overpriced, der Kram. Wenn man es wirklich darauf anlegt, ist das, also wenn man komplett gar nichts machen will, einfach sich braindead was kaufen will, meinetwegen, aber mit den meisten anderen Sachen kommst du günstiger hin und wahrscheinlich sogar besser integriert. Hä, was bin ich da sehend? Hä, was seh ich da überhaupt, was ist das, das ist eine LED Matrix und was seh ich da, ich seh einen Raspberry Pi, was ist das, sind die je nach Farbe, sind das einfach die LEDs anders oder wie? Wie sind die von AVM, du meinst die Lampen, weiß ich nicht, hab ich nicht. Ich hab von AVM plus Thermostat für die Heizung, weil alle andere nicht ausprobiert haben, kacke waren. Die haben auch so seine Probleme, aber funktionieren ganz okay. Ach jetzt, Serverraum Temperature ist viel zu, das ist viel zu lang, wenn du die Serverraum Temperatur wissen willst und im Zweifelsfall, also du willst die wissen und guckst drauf und du musst erstmal 15 Sekunden Scroll Schrift sehen, das ist ja fail, ist, nee das, guck mal, das war die eigentliche Information und der Rest waren 15 Sekunden bloated Schrift, würde ich nicht so machen. SRV Temp, in die erste Zeile, unten drunter als zweite, fertig, genau. Okay, das können wir jetzt ein bisschen vorskippen, weil ich mein, so viel ist da nicht, das ist ein Patch Panel, irgendein Kabel Modem, Philips Hue Bridge, wahrscheinlich hier unten irgendwie ein USB Hub, was denn das, Capture Card, das sieht ein bisschen aus wie eine billige Capture Card, aber was könnte denn das sein, PoE Injector, nee was ist denn das, keine Ahnung, ich würde sagen, das da unten könnte fast noch ein Raspberry Pi sein, in einem anderen Case, aber ganz schön groß. USB Netzwerkade A, Ach Hackboard heißt das offiziell, okay, das weiß ich auch, wie ich das nennen muss. Ach Packboard. Ah, Peg, nicht Heck, Wingnuts, also quasi Flügelnüsse, weiß nicht, ob das auf Deutsch so heißt, okay, Cricona Style, geht bei mir schonmal nicht, okay, wir gehen jetzt mal ein bisschen weiter, das ist ja alles das gleiche, ach, das ist Nuke da unten, okay, das da ist 0, sieht aus wie neunziger Kanalrohr, das ist ne Decke, ja, okay, auf, erzähl, okay, USB, USB, ja, weiter, ja, Power Strips, siehste, hätte er sich mal die Kogi Steckdosenleiste gekauft und mit das Motor geflasht, da wäre er deutlich billiger hingekommen. Das mit Mediamarktensaturn haben wir uns schon angeguckt, Kameras, alles klar, er hat ziemlich viele Festplatten am Start, dieses Gehäuse hatten wohl alle früher oder später mal, mein alter Surfer war auch in dem Gehäuse, also den, wo ich selbst zusammen geschraubt hab. Super Mikrokrisse um drüber, das sieht aus wie Unify Gendurance, das da unten drunter ist wahrscheinlich irgendein relativ alter Cisco Switch, weil neue Cisco Sachen sind einfach unglaublich teuer, was machen die eigentlich alle immer mit dieser riesen Anzahl an Festplatten, haben die alle nur 2TB Platten und brauchen deswegen so viele oder haben sie irgendwie Petabyte Zeug da liegen. Was bringt so ein Flash, du meinst von der Steckdosenleiste, naja, du kannst viel besser in deine Heimautomatisierung einbinden, du hast im Zweifelsfall auch ein Webinterface zum Steuern, du brauchst keine China-Chinesen App und keine China Cloud ums zu steuern, das ist eigentlich alles besser geflasht, alles für die Linux-ISOs, ja genau, für die Linux-ISOs und zum Torrent-Sharing für allgemein nützige Projekte, ja klar, natürlich, 2,5h, das muss aber verdammt fett sein, mal ganz davon abgesehen, eigentlich reicht es ja, wenn das sag mal mal 5 Minuten überbrückt und dann die Kisten sich in der Zeit ordentlich runterfahren können und ich bin mittlerweile im Heimbereich wirklich kein Fan mehr von USVs muss ich sagen, ich hab schlechte Erfahrungen mit USVs gemacht, klar natürlich liegt das auch am Preis und was man sich da kauft, aber das einzige Mal wo mein komplettes Wreck ausgefallen ist, war als die USV verreckt ist, nicht etwa umgedreht, nein es ist nie was passiert und einmal wo die USV abgekackt ist, ist was passiert und nie ist komplett verreckt die USV, komplettes Wreck aus, obwohl der Strom noch ging wohlgemerkt, ähm wenn du das Fire HD gekauft hast, kann es gut sein, dass du das nicht mehr flashen und routen kannst, Amazon ist da immer relativ weit hinterher, ich weiß nicht ob es für das aktuelle Fire HD 10 überhaupt eine Flash und Route gibt, was du machen musst ist, du musst das einfach deep-loaden, deep-loaden holst du diese Amazon Amazon Fire Toolbox und deep-loadest, dann kannst du das auch gut machen, Deep Packet Inspection macht ganz im Ernst, als würde irgendeiner hier im Heim irgendwas davon haben, dass das Ding Deep Packet Inspection macht, zumal das meiste eh TLS ist mittlerweile und ja ich weiß, dass man manche Sachen rausbekommen kann über den Inhalt von verschlüsselnden Verbindungen, aber das hat im Heimbereich trotzdem unsinnig, also man kann ja zum Beispiel für SSH Verbindungen oder für HTTPS Verbindungen, man kann ja da schon so Analysen machen, so mit so statistische Geschichten mit, was wird der eventuell darüber verwenden, du kannst dir gucken, wie oft schickt er was, welche Bandbreite, hat er Börs drin oder so, da gibt es schon fertige quasi, ich will das nicht sagen trainierte AI, weil das stimmt nicht, aber es gibt schon fertige Verhaltensmuster, die dann anhand des Traffics dir ungefähr sagen können, was der macht, ob er es wirklich macht, weißt du nicht, weil das ist ja verschlüsselt und du kannst damit auch nicht reingucken, also ja, eigentlich bringt es dir das gar nicht und im Heimbereich schon erst recht nicht. Das sagt, das würde ich ausschalten, das ist eines der ersten Sachen, die ich ausgeschaltet habe, dass meine Access Points sich automatisch Channels und so wechseln, das wichtigste was man machen kann ist, erstens man muss in seine Unify Controller gehen und diesen automatischen Modus ausschalten, der automatische Modus, ich weiß es jetzt leider nicht genau aus dem Kopf, der macht einige richtig dumme Sachen, die man nicht haben will, ich bin mir gar nicht mal sicher, was das alles gewesen ist, aber es waren ein paar Sachen, die richtig dumm waren, die man auf gar keinen Fall haben will, ich weiß es nicht, da müsste ich mir jetzt erstmal Gedanken darüber machen, den automatischen Modus muss man auf jeden Fall ausschalten und dann würde ich einfach die Access Points so einstellen, dass es passt, ich würde die, wenn man es kann, dass man die im Haus quasi so platziert, dass sie sich möglichst wenig überlappen und trotzdem das jeweilige Stockwerk abdecken, ist am besten, man stellt die Access Points so ein, dass die Sendeleistung gerade so ausreicht, umso weniger sich die Access Points ins Gehege kommen und überschneiden umso besser, das bei der Fritzbox auch so mit den Auto-Channels, ich hab keine Ahnung, achja jetzt weiß ich wieder was es war, genau, was diese Automatik von Unify unter anderem macht ist, wenn du 2,4GHz und 5GHz hast, das zwingt Geräte, die 5GHz können sich mit 5GHz zu connecten, was Müll ist, weil es ist einfach so, dass 2,4GHz WLAN oftmals einfache Durchwende geht, das heißt 2,4GHz hat in der Regel eine etwas höhere Reichweite als 5GHz, deswegen ist es total bescheuert, die Geräte dazu zu zwingen, sich mit 5GHz zu verbinden, dann hast du beispielsweise auf der Terrasse keinen Empfang mehr, obwohl du eigentlich hättest, also das bin ich überhaupt kein Fan von, was bringt ein Serverraum zu Hause, naja das bringt, wo du es hinstellst ist eigentlich egal, aber wenn die Dinger ein bisschen krach machen, ist es schon mal ganz praktisch, wenn du es irgendwo hast mit einer Tür davor, ob du es jetzt Serverraum oder Abstellkammer nennst, ist ja egal, du hast mich vor ein paar Tagen auf YouTube excellent und sogar den Weg hier in den Stream gefunden, das ist ja absolut, Moment, jetzt finde ich das nicht, hier 360 Quickscope, ja schön, dass du da bist, jetzt wo bin ich stehen geblieben, die, ah keine Ahnung, wir gucken jetzt einfach weiter, achja 5GHz, 2,4GHz wieder, ja also das würde ich nicht machen, das würde ich immer ausschalten, diese automatische Optimierung, ich mag, das ist Windows Only, allein schon deswegen wollte ich es nicht verwenden. Kennt ihr auch die Leute, die Cisco Cisco aussprechen, so richtig schön auf Deutsch, der Cisco, der Cisco Switch, Shadow sagt, habe auch Bock auf ein Home Lab, aber keine Ahnung, was ich darauf installieren soll, dann lass es bleiben, wenn du keine Anwendungszwecke hast und nicht irgendwie üben willst zu Just For Fun, dann lass es bleiben, also ich würde es immer so rum machen, ich habe eine Idee, ich habe was Sinnvolles, was ich lohnen würde, dann würde ich mir was dazu holen, auf gut Glück da irgendwie jetzt eine Kiste hinstellen und die üblichen Verdächtigen drauf installieren und dann nicht benutzen ist ja sinnlos. Wenn man auf Reddit guckt, beispielsweise Subreddit Self Hosted, da siehst du so viele Leute, die fangen an, die stellen sich eine Kiste daheim hin und sagen dann jawoll krasse Self Hosting Geschichte und was machen sie dann am Ende, sie haben zwei Festplatten drin, haben einen Fileserver drauf und irgendwie acht sinnlose Docker Container, die keiner braucht ja und die Hälfte davon sind zur Managen der Infrastruktur, wo es nichts zur Managen gibt, dann haben sie einen Prometheus drauf laufen, dann haben sie einen Portainer drauf laufen, dann haben sie einen Dashboard Generator drauf laufen, dann haben sie einen Wiki drauf laufen, nichts davon benutzen sie, also Hardware einfach um Hardware zu haben ist sinnlos, weil man keinen Anwendungszweck hat, muss man das auch nicht machen, es sei denn man hat Spaß dran und will was lernen, das ist wieder was anderes. Die Dinger, wenn es ein Alter ist, was ist ein SG280, ich habe keine Ahnung, ich kenne mich mit Cisco-Produkten nicht aus, die Cisco-Dinger brauchen Strom und sind laut, also ich weiß nicht, ob sich das lohnt, wie es bei dem hier ist, keine Ahnung. Du hast auch nur einen Raspberry Pi mit Bitwad, Raspberry Pi ist ja nur ganz anderes Kaliber, da bietet sich das ja auch an, wenn man sich denkt, ich hätte gerne meinen eigenen Passwort save webbasiert, dann einen Raspberry Pi hinstellen, warum nicht, das ist doch sinnvoll, dann hast du einen Anwendungszweck und hast einen Raspberry Pi dafür geholt oder du hattest vielleicht noch einen, das ist ja sinnvoll. Wenn du jetzt allerdings sagen würdest, ich stelle mir jetzt irgendwie so eine Kiste hierhin mit 8 Festplatten, nur um danach festzustellen, eigentlich hast du nichts, was du drauf laufen lassen willst, ja dann halte ich das für rausgeschmissenes Geld. Was ist denn Monika, personal CRM, ah, das ist für irgendwie Business-Stells, das ist quasi ein Kontaktbuch mit Infos dazu, ok, wenn man sowas braucht, ich habe eh keine Freunde, insofern brauche ich das nicht, ich habe keine Freunde, keine Bekannte, das brauche ich alles nicht, ja das war jetzt ein bisschen übertrieben, aber für die paar Leute, mit denen ich mich gut verstehe und die ich kenne, brauche ich sowas nicht. Und jetzt schlecht, 512G RAM und was macht er damit? Achso, Combined, ok, was hat er alles für VMs laufen, was macht er da drauf? Der hat bestimmt auch seinen eigenen Kubernetes-Cluster, wo dann am Endeffekt ein Doku-Wiki drauf läuft oder irgendwie sowas und bei Doku-Wiki lässt sich erstaunlich schlecht Kubernetes-ieren, weil File Storage und MySQL Datenbank, da gibt es dankbare Dinger, hat er tatsächlich ja, das wundert mich nicht, aber wahrscheinlich hat er darauf gar nichts sinnvolles laufen. Was? conversion server mein was it still has the laser beam light you don't want to look directly in that because it'll blind you but i converted this pc a long time ago using a chin bro server case so this server used to run proxmox along with a few vms and had my gpus in it but since then i've repurposed it to a plain old ubuntu server with a large zfs pool so this does local backups of almost everything on my network and keeps a local copy of it here just in case i need to restore it everything from the cloud i scheduled to boot up at night and then shut down about 30 minutes later i use syncthing to sync most of my data to it der soll mal die auslastung von der kiste zeigen ja wird mich auch interessieren wahrscheinlich 2 prozent oder so but i might have something coming in the future to replace it so i haven't done that yet but really this is just a second copy of my data that's on prem that i can restore if i need to so below this is my disk shelf so this is the same disk shelf i bought on ebay about a year ago i was lucky enough to snag one before chia farming became a thing because after that sellers were charging 5x when i paid for it i still have six eight terabyte iron wolf drives in here in the raid d2 and i have one ssd in here for cash although i don't think i have it configured properly but it's there now this is connected to an hba controller over an odd sas mini cable that ah das ist doch das ist quasi doch so art sas extension hier okay das dachte ich mir dass das so verboten ist ja so not much is changed there i am quickly running out of space virtualisiert des trunas das wird dem das wird dem dem dem forum aber bestimmt nicht gefallen also es gibt zwei forren wo ganz viele idioten unterwegs sind die sich super für super elite und die besten auf der welt halten das ist einmal das microcontroller forum und das ist das frinas forum oder das frinas reddit ist es glaube ich eher das ist so ein wie sagt man so schön bald amis circle jerk in diesem forum meine güte also ich hatte ja auch mal meine anfälle in dieser richtung ja mit zfs pool und raid geschichten mit zig großen festplatten wisst ihr wo ich jetzt angekommen bin ich bin jetzt angekommen bei einer laub laub power intel x86 kiste habe ich in altes also in den billiges 2 he case gesteckt mit einer 12 terabyte platte dran und einem usb auf sata wo nachts einmal erst und läuft also ich bin von 100 prozent übertrieben zu 0815 gegangen weil es einfach vom handling her und von der verwaltung her viel einfacher ist 12 terabyte reichen mir wozu mehr ja wenn man sich mal gedanken macht was man in backups braucht dann ist das meistens gar nicht so viel weil man sich wirklich wichtigen dinger nimmt und dann machst du einmal nachts in ersynch und gut ist das ist die nuke variante ich weiß aber die ist am einfachsten zu handeln ja bei den amis ist das strom ja auch billiger dafür muss es reicht ja auch für die usb und nur 110 volt statt 230 gut das macht ja jetzt kein unterschied 430 watt sind 430 watt egal aus was sich das zusammensetzt okay mich würde ja echt interessieren was er da wirklich so high ausfallssicheres business stellster macht okay was hat er hier das kippen wir jetzt auch noch schnell durch was haben die da immer für riesen dinger alle ich habe mein sech mein was hat mein ich glaube 12 15 he hat meins glaube ich 15 he und es reicht nicht dicke aber es reicht okay zeig ja ist das eine telefonanlage sehe ich das richtig ist das wirklich eine hat er eine telefonanlage warum hat man seine eigene telefonanlage was stehen die alle also dieses ding spricht mich überhaupt nicht an er hat aber einen guten switch unten drunter endlich man of culture der weiß bescheid übrigens die benahmung ist tatsächlich richtig gut bei mikrotik also crs weiß man es ist ein router switch ich glaube das c steht für cloud es ist ein router switch das erkennt man an rs 317 sind ist glaube ich einfach die die produkt bezeichnung was auch immer da hast du einen 1 gigabit port und 16 sfp plus 10 gigabit ports also das ist tatsächlich mal eine produktbeschreibung also diese benahmung und nummern bei mikrotik die irgendwie sinn ergeben jetzt erklärt dass er noch mal der gigabit port ist der hier muss 10 g kann man nicht genug haben ich habe jetzt sechs wochen frei weil ich den gesamten december urlaub habe wie immer ich habe dieses jahr nicht viel urlaub gehabt dazu kommt bei mir ich muss ja auch nur vier tage die woche verarbeiten deswegen brauche ich auch nicht so viel urlaub oder frazier ist gerade angekommen brauche ich auch nicht so viel urlaub also ich bekomme nicht so viel oder braucht aber auch nicht so viel urlaub also sowohl zu nehmen für den ganzen december dass ich december voll kriege als auch insgesamt weil ich ja immer drei tage am stück dann frei habe mich nicht das finde ich gut das finde ich tatsächlich mal sinnvoll besser besser als die rgb anzeige von dem anderen ja das ist ja auch kein router von der von der cpu da drinnen aber was macht er denn für super super krasses routing basis daheim dass er das mit der mit dem mit der kiste nicht machen kann der hat auch kvm da drin nicht schlecht also der macht es richtig das sieht aus wie hp von den von den farben her ich verwechsel manchmal hp und dell von den farben also früher hattest du im prinzip ibm und hp die konnte super auseinander halten die ein waren eher so blau schwarz und die hier waren schwarz rot und dell ist eher so silber aber manchmal habe ich das gefühl bei dell ist auch ein bisschen rot dran was ist es eigentlich für eine big brain aktivitätsanzeige hier vorne dran was für festplatten hat er da drinnen für 20 dollar terabyte oder so mehr kann es ja nicht sein das ist ganz wichtig dass es auf dem netzberg storage liegt dies die library weil man seine steam library auch sicherlich auf mindestens 20 rechnern im ganzen haus braucht dazu kommt das ist jetzt ihr nicht mal schert ist das heißt es ist dann trotzdem nur noch an ein rechner gebunden ok weil es geht weil es geht wahrscheinlich einfach wie groß ist der channel eigentlich würde ich auch nehmen also super micro wenn ihr wollt dass ich eure systeme mal im stream vorstelle dann schickt mir auch ein rüber das gleiche gilt für mikrotik auch ja also wenn ihr mir switch schicken wollt ich im stream vorstelle einfach immer her damit ja nehme ich alles ist das ist das die ami aussprache von zeus sus sus die kritik hier pm als adresse klar das geht so einfach mal über den chat ja ja ja das das stimmt das stimmt schienen sind sie nicht ok und was soll das jetzt ja das ist ja schön und gut aber nur was ist ja die frage ich lasse mir das durchaus gefallen dass das ein guter deal für den preis aber für was also was willst du damit machen und wie sieht es letztendlich im stromverbrauch aus für home lab halt ja home lab ist ja nicht sagen was willst du da laufen lassen ich frage mich was die alle machen mit diesem zeug ich meine ich bilde mir schon ein dass ich relativ sag mal so eher so im enthousiasten segment unterwegs bin was ich hier an technik daheim habe aber ich wüsste bei bestem will nicht was ich daheim in so einem rack machen sollte ich meine man es einfach nur hat zum ausprobieren zum basteln ist ja schon cool ja sage ich ja gar nichts dagegen ja die hat er bestimmt auf ebay gekriegt ja nee also es ist cool so was zu haben aber es ist jetzt nicht so als als bräuchtest du das wirklich daheim das ist schon cool wenn du sowas drin hast dann brauchst du aber auch die passende verkabelung natürlich so dass es an den servanten dran ist dass du es einfach nur mit switch auswählen musst aber ansonsten du kannst dich daheim auch einfach ganz normal per tastatur anstöpseln einfach monitor obendruf stellen und per tastatur anstöpseln das ist ja kein richtiges recht oder man kauft sich für 100 euro so eine so remote kvm den stöpseln man an und geht per browser drauf oder aber nachdem es ja fast alles eh ordentliche kisten sind haben die auch ein management interface ja das stimmt schon aber also das wäre das letzte was ich mir fürs rack kaufen würde ehrlich gesagt dann müsste ich schon alles andere haben also bei den amis muss strom wirklich billig sein dass du das machen kannst deutschland freuten sich die meisten leute freuen über 50 mbit upload plex ist für die sammler dienst weht was wollen die dann darauf spielen die zeichnen wie kommt das bild von dort zum klein so dass man damit ordentlich spielen kann das geht nicht das läuft nicht unter so stimmt hat nicht gesagt dass es dass es linux ist muss ja linux muss ja windows drauf sein weil gaming und so ja stimmt nur aber trotzdem ja logisch leute es muss windows sein sagt klar wenn es spiele sind parsec läuft der server läuft aber nicht unter linux du kannst dich von linux aus glaube ich nur connecten zumindest war es das letzte mal so wo ich es ausprobiert habe ok das ding brauchst erst mal zwei leute ums hoch zu heben so schlimm ist es nicht aber aber ich denke mal so 25 kilo oder so 25 30 kilo hat die hat die ups usw bestimmt das brauche ich habe sie was wie macht er das überhaupt wie macht er das überhaupt warum läuft das überhaupt ohne rgb strip dachte das ist essentiell also da könnte noch ein bisschen performance rausholen ist das ist das die sehr konditioner hier oder hier die klimaanlage kann ich mir vorstellen die klimaanlage braucht aber auch noch fucking viel strom also dort wo der wohnt muss der strom echt billig sein was ist ein 80 degrees fahrenheit in celsius gibt es das gibt es das vielleicht in nicht springt im units 26 grad ok es ist trotzdem relativ warm kann man aber machen ist in ordnung das auch immer ok warum nicht kann man machen lass mal kurz gucken was der friseur spielt bestimmt komische mobile web games strom wieder hier der friseur ich werde jetzt den friseur horsten und ins bett gehen könnt ihr ihn kurz voll spammen und wer sich web games angucken will kann da bleiben und wer nicht kann er wieder aufgehen aber ich gehe jetzt ins bett geleute wir sehen uns machts gut bis dann see you", "segments": [{"id": 1, "start": 30.0, "end": 35.0, "text": "Kuckuckоки"}, {"id": 2, "start": 41.3, "end": 43.3, "text": "Oh oh"}, {"id": 3, "start": 44.02, "end": 50.04, "text": "Lawconnect"}, {"id": 4, "start": 51.72, "end": 57.12, "text": "Non non NONONONONONONONONONONONON"}, {"id": 5, "start": 57.12, "end": 84.92, "text": "So, exquisite, auf geht's!"}, {"id": 6, "start": 84.92, "end": 88.48, "text": "Ah, irgendwas stimmt mit meinem Headset nicht, was ist hier los?"}, {"id": 7, "start": 88.48, "end": 90.92, "text": "But why?"}, {"id": 8, "start": 90.92, "end": 94.64, "text": "Ah, okay, excellent."}, {"id": 9, "start": 94.64, "end": 99.24, "text": "Wieso, wieso nur noch zwei Wochen arbeiten an Vollzeit YouTube?"}, {"id": 10, "start": 99.24, "end": 102.04, "text": "Ja klar, was sonst?"}, {"id": 11, "start": 102.04, "end": 105.4, "text": "Instant, gleich Vollzeit YouTube."}, {"id": 12, "start": 105.4, "end": 110.4, "text": "Nee, nee, nee, hat nix mit Vollzeit YouTube zu tun."}, {"id": 13, "start": 110.4, "end": 114.28, "text": "Ich hab Dezember Urlaub komplett eingetragen und ich hab gesehen,"}, {"id": 14, "start": 114.28, "end": 116.0, "text": "dass ich noch vier Tage Resturlaub hab."}, {"id": 15, "start": 116.0, "end": 118.24, "text": "Die müssen irgendwo hin."}, {"id": 16, "start": 118.24, "end": 121.0, "text": "Wenn ich vier Tage Resturlaub noch eintrage,"}, {"id": 17, "start": 121.0, "end": 124.36, "text": "dann hab ich ja quasi dann noch eine Woche Länge Urlaub."}, {"id": 18, "start": 124.36, "end": 126.28, "text": "Das heißt, ich muss noch zwei Wochen arbeiten,"}, {"id": 19, "start": 126.28, "end": 130.0, "text": "dann bin ich für das restliche Jahr daheim."}, {"id": 20, "start": 130.0, "end": 132.28, "text": "Oder besser gesagt, daheim bin, weiß ich nicht, aber"}, {"id": 21, "start": 132.28, "end": 135.36, "text": "definitely nicht auf der Arbeit."}, {"id": 22, "start": 135.36, "end": 141.84, "text": "Dotnet 6 Stream, wir haben letztens schon gemacht."}, {"id": 23, "start": 141.84, "end": 147.2, "text": "Wir haben uns letztens schon die neuen Features angeguckt."}, {"id": 24, "start": 147.2, "end": 150.12, "text": "Ich überleg grad, wann soll denn das released werden?"}, {"id": 25, "start": 150.12, "end": 153.24, "text": "Morgen oder übermorgen oder Freitag oder so?"}, {"id": 26, "start": 153.24, "end": 158.16, "text": "Es ist nicht mal lang hin."}, {"id": 27, "start": 158.16, "end": 162.88, "text": "Das ist heute rausgekommen, ach ja."}, {"id": 28, "start": 162.88, "end": 166.44, "text": "Ach ja, zeigt mal her, das müssen wir uns dann gleich mal angucken."}, {"id": 29, "start": 166.44, "end": 168.8, "text": "Aber ganz davon abgehen, wir haben uns ja letztens in einem Stream"}, {"id": 30, "start": 168.8, "end": 170.28, "text": "schon die neuen Features angeguckt."}, {"id": 31, "start": 170.28, "end": 172.6, "text": "Also das hat ja keinen großartigen Sinn."}, {"id": 32, "start": 172.6, "end": 174.72, "text": "Das ist jetzt da, aber was soll ich da streamen?"}, {"id": 33, "start": 184.12, "end": 187.12, "text": "Äh, was?"}, {"id": 34, "start": 187.12, "end": 190.12, "text": "Also ich habe keine Ahnung, auf was sich das jetzt bezieht."}, {"id": 35, "start": 190.12, "end": 196.28, "text": "Nein, ich habe kein Neato Saugroboter."}, {"id": 36, "start": 196.28, "end": 200.48, "text": "Bisschen leiser machen, da, fuck."}, {"id": 37, "start": 200.48, "end": 206.68, "text": "Du bist erkältet, na gut, dann sei froh, dass kein Corona ist."}, {"id": 38, "start": 206.68, "end": 207.68, "text": "Noch ganz einfach."}, {"id": 39, "start": 207.68, "end": 224.12, "text": "So, mir geht es gut, es ist relativ spät, ich bin schon irgendwie nicht mehr so ganz"}, {"id": 40, "start": 224.12, "end": 228.04, "text": "fit, aber es ist noch lange kein Bett gear angesagt."}, {"id": 41, "start": 228.04, "end": 234.6, "text": "Selfmade Ice, Dankeschön für 15 Monate Subscriptions."}, {"id": 42, "start": 234.6, "end": 239.12, "text": "Du müsstest jetzt mit 15 Monaten, du müsstest quasi auch schon den Goldkeks haben, oder?"}, {"id": 43, "start": 239.12, "end": 240.52, "text": "Gibt es nicht nach einem Jahr?"}, {"id": 44, "start": 240.52, "end": 250.88, "text": "Ja, to the moon."}, {"id": 45, "start": 250.88, "end": 254.92, "text": "Also ich müsste mal, ach, ich mache dann, ich mache dann vollen Sellout, ich mache dann"}, {"id": 46, "start": 254.92, "end": 261.08, "text": "jedes Video mit Sponsor, Channel Memberships auf YouTube, dann geht es ab."}, {"id": 47, "start": 261.08, "end": 267.56, "text": "Oh, guck mal, ein Kronk-Subscriber."}, {"id": 48, "start": 267.56, "end": 282.76, "text": "Ich habe nie großartig Kronk geguckt, muss ich dazu sagen, aber irgendwie ist er mir"}, {"id": 49, "start": 282.76, "end": 288.96, "text": "von allen deutschen Let's Playern noch, vielleicht weil ich nicht so viel geguckt habe oder so,"}, {"id": 50, "start": 288.96, "end": 294.56, "text": "scheint er mir noch irgendwie dem am nächsten zu kommen, was ich gucken würde, aber ich"}, {"id": 51, "start": 294.56, "end": 300.64, "text": "gucke quasi keine deutschen Let's Plays, aber alle anderen Let's Plays gehen mir zum"}, {"id": 52, "start": 300.64, "end": 304.76, "text": "größten Teil mega auf den Sack, vor allem die, die so rumschreien und pausenlos, also"}, {"id": 53, "start": 304.76, "end": 308.92, "text": "wirklich pausenlos reden, ich meine mit pausenlos reden, nicht pausenlos reden, sondern wirklich"}, {"id": 54, "start": 308.92, "end": 312.28, "text": "so komplett ohne Pause, ohne Luft zu holen und die ganze Zeit durchzureden, damit sie"}, {"id": 55, "start": 312.28, "end": 328.92, "text": "nicht sagen, oh, also das halte ich dann aus, Triggert, not net 6 any percent, können gleich"}, {"id": 56, "start": 328.92, "end": 332.6, "text": "mal gucken, wir schauen uns auch gleich noch ein paar, ich habe, wir wurden auf YouTube"}, {"id": 57, "start": 332.6, "end": 340.48, "text": "heute zwei Videos vorgeschlagen, hier, Server Rack Touren, da bin ich ja immer dabei, dass"}, {"id": 58, "start": 340.48, "end": 346.28, "text": "ich mich ein bisschen darüber auslassen kann, was andere, was ich im Rack habe, meine Rack"}, {"id": 59, "start": 346.28, "end": 358.92, "text": "Tour ist ja schon durch, das ist ganz einfach, du musst einfach ein eigenes Unternehmen gründen"}, {"id": 60, "start": 358.92, "end": 364.48, "text": "und dann big brain time, massig Kohle mitmachen, dass du dann genug Leute bezahlen kannst,"}, {"id": 61, "start": 364.48, "end": 374.88, "text": "die deine Arbeit erledigen, das ist natürlich nicht so einfach und die meisten, die das"}, {"id": 62, "start": 374.88, "end": 382.92, "text": "machen, die wollen ja dann auch gar nicht weg, die wollen ja dann weitermachen da, sag"}, {"id": 63, "start": 382.92, "end": 388.64, "text": "mal was zu den neuen Macs, die jetzt vorgestellt, keine Ahnung, habe ich nicht gesehen, die"}, {"id": 64, "start": 388.64, "end": 392.04, "text": "Sache ist auch die, mich interessieren Macs überhaupt nicht, das einzige, was mich von"}, {"id": 65, "start": 392.04, "end": 398.6, "text": "Apple interessiert ist, sind die Tablets und die Smartphones, habt ihr das mit dem Tuch"}, {"id": 66, "start": 398.6, "end": 411.64, "text": "gesehen für 25 Euro, Apple Tuch, Apple Poliertuch und guckt euch mal die Lieferzeit an, guckt"}, {"id": 67, "start": 411.64, "end": 420.92, "text": "euch den Preis, guckt euch den Preis und guckt euch die Lieferzeiten an, das ist so typischer"}, {"id": 68, "start": 420.92, "end": 431.64, "text": "mit Appleshit, Leute danke für die Subs, wer hat es, wer hat es, wer hat alles gesagt,"}, {"id": 69, "start": 431.64, "end": 438.72, "text": "der Captain Zika ist 18 Monate wieder am Start, nice, Blofus ist am Start, wenn ich irgendwas"}, {"id": 70, "start": 438.72, "end": 450.0, "text": "übersehen habe, hoffe nicht, das Problem ist, ich würde auch normalerweise mehr Applesachen"}, {"id": 71, "start": 450.0, "end": 454.64, "text": "streamen, aber ich sehe es nicht ein, jemals wieder was für Apple zu machen, nachdem die"}, {"id": 72, "start": 454.64, "end": 461.44, "text": "mich gestrikt haben, unsinnigerweise wohlgemerkt, ja, Heise hat eine Review gemacht, hat gesagt,"}, {"id": 73, "start": 461.44, "end": 465.12, "text": "das Apple Tuch reinigt auch nicht besser als andere Tücher, aber das war ja von vorne"}, {"id": 74, "start": 465.12, "end": 481.2, "text": "rein klar, ist mir nichts dazu bekannt, ja, mach das, dann gucken wir uns hier im Stream"}, {"id": 75, "start": 481.2, "end": 487.52, "text": "an, wenn du deine Rektor machst, jetzt zum Thema Weltraumpasser, da fällt mir ein also"}, {"id": 76, "start": 487.52, "end": 491.2, "text": "noch, also wo ich noch ein bisschen kleiner war und mir so einen Scheiß habe einreden"}, {"id": 77, "start": 491.2, "end": 497.64, "text": "lassen, ja, da war ich mal in so einem kleinen Hardware Laden, damals gab es noch viele dieser"}, {"id": 78, "start": 497.64, "end": 504.12, "text": "kleinen mini Hardware Klitschen mit irgendwie 1-2 Leuten drin, das gibt es ja in der Form"}, {"id": 79, "start": 504.12, "end": 509.92, "text": "nicht mehr oder selten und da haben die, da haben wir Netzwerkkarten, wollten wir uns"}, {"id": 80, "start": 509.92, "end": 515.96, "text": "zwei Netzwerkkarten kaufen, ich glaube das war, ich glaube das war Netzwerkkarten mit"}, {"id": 81, "start": 515.96, "end": 526.16, "text": "ALU45 Stecker, also Buchsen und noch BNC dran und der hat uns damals ernsthaft erzählt,"}, {"id": 82, "start": 526.16, "end": 532.84, "text": "dass das Netzwerkkarten aus der Weltraumforschung sind und so, ich habe das damals geglaubt"}, {"id": 83, "start": 532.84, "end": 536.92, "text": "und habe mich voll gefreut, dass ich jetzt die geilste Netzwerkkarte auf der Welt habe,"}, {"id": 84, "start": 536.92, "end": 543.76, "text": "weil es aus dem Weltraum oder aus der Weltraumforschung kommt, richtig dumm, dabei war die auch noch,"}, {"id": 85, "start": 543.76, "end": 552.28, "text": "die war mega kacke, die hat nicht richtig funktioniert, die neuen Macs haben sogar HDMI"}, {"id": 86, "start": 552.28, "end": 560.64, "text": "und USB-C glaube ich auch, darf man Link schicken, ja, kannst du machen, oh boy, danke für den"}, {"id": 87, "start": 560.64, "end": 570.96, "text": "Sub, hast du das mit Datev gelesen, äh vielleicht, bin mir jetzt nicht ganz sicher, ne, das habe"}, {"id": 88, "start": 570.96, "end": 583.52, "text": "ich nicht gelesen, dann war das was anderes, ja ich habe Urlaub in zwei Wochen für das"}, {"id": 89, "start": 583.52, "end": 592.28, "text": "komplette Jahr, ja das kann ja Apple eh gut, also wenn das einer perfektioniert hat, dann"}, {"id": 90, "start": 592.28, "end": 602.96, "text": "Apple."}, {"id": 91, "start": 602.96, "end": 607.68, "text": "Der Vorteil von Mac vs Linux ist halt einfach, wenn man Mac Software entwickelt, ne, kannst"}, {"id": 92, "start": 607.68, "end": 628.56, "text": "dir eh nicht, kannst dir eh nicht unter irgendwas anderes machen, was für ein Ding, ja gut,"}, {"id": 93, "start": 628.56, "end": 636.56, "text": "wer ist dein Born-IT und Windows-Block, Alter, wo bin ich denn da rausgekommen, der ist noch"}, {"id": 94, "start": 636.56, "end": 646.64, "text": "ein Boomer als ich, ich habe keine Ahnung, was, ok, was ist daran jetzt so spannend,"}, {"id": 95, "start": 646.64, "end": 654.32, "text": "es kommt zu massiven Einschränkungen, wir sind gerade auf der Suche nach Möglichkeiten"}, {"id": 96, "start": 654.32, "end": 667.4, "text": "für weitere Kommunikationen, versuche eine gewisse, ja gut, sie haben halt lange gebraucht,"}, {"id": 97, "start": 667.4, "end": 679.6, "text": "ne, komm dir überall mal vor, kannst du dich nicht komplett gegenschütten, ja, das war"}, {"id": 98, "start": 679.6, "end": 690.44, "text": "damals so ein Teil, ja, Kugelschreiber aus der Weltraum, Netzwerkkarte aus der Weltraumforschung,"}, {"id": 99, "start": 690.44, "end": 697.84, "text": "aber Kugelschreiber aus der Weltraumforschung ist bestimmt auch, das ist eine gute Frage,"}, {"id": 100, "start": 697.84, "end": 701.72, "text": "die kann man aber leider relativ kurz beantworten, da kann ich mich jetzt gar nicht großartig"}, {"id": 101, "start": 701.72, "end": 707.68, "text": "drüber auflassen, nein, hat keinen Einfluss, solange er funktioniert, hat er keinen Einfluss,"}, {"id": 102, "start": 707.68, "end": 712.08, "text": "ja, man könnte sich jetzt da irgendwelche wie so schön heißt Edge Cases überlegen,"}, {"id": 103, "start": 712.08, "end": 716.52, "text": "wo es doch einen Einfluss hat, aber in der Regel macht es keinen Unterschied, also wenn"}, {"id": 104, "start": 716.52, "end": 720.24, "text": "du ein DNS eingetragen hast, gehen wir mal davon aus, du hast ein DNS eingetragen, der"}, {"id": 105, "start": 720.24, "end": 727.88, "text": "in China steht, 350 Millisekunden zum DNS, dann ist das zwar lahm beim Surfen, wenn du"}, {"id": 106, "start": 727.88, "end": 734.16, "text": "auf eine neue Webseite gehst und bis dann alles einmal abgerufen ist, aber danach auch nicht"}, {"id": 107, "start": 734.16, "end": 737.8, "text": "mehr, wenn du die Seite refreshst, geht es dann halbwegs schnell und beim Spielen ist"}, {"id": 108, "start": 737.8, "end": 742.96, "text": "es auch nicht das Problem, falls dort überhaupt Namen verwendet werden, dann werden die einmalig"}, {"id": 109, "start": 742.96, "end": 758.92, "text": "aufgelöst und danach ist es eh gecashed, also insofern, nicht wirklich, solange er geht,"}, {"id": 110, "start": 758.92, "end": 763.84, "text": "der Scamtrain ist durch Leute, also solange er geht, wenn er gar nicht geht, hast du Probleme,"}, {"id": 111, "start": 763.84, "end": 779.52, "text": "aber wenn er nur lahm ist, dann ist es beim Spielen egal, Bash by Default, ne, ne, MacOS"}, {"id": 112, "start": 779.52, "end": 786.44, "text": "hat glaube ich Bash standardmäßig, aber irgendeine uralte Version von Bash, also die"}, {"id": 113, "start": 786.44, "end": 795.04, "text": "mitgelieferten Pakete bei Mac sind auch nicht so wahnsinnig aktuell, ja leider, leider,"}, {"id": 114, "start": 795.04, "end": 798.68, "text": "wir haben es ja probiert im Stream, wir haben ja den Mac mal in der VM laufen lassen, ich"}, {"id": 115, "start": 798.68, "end": 806.72, "text": "glaube das war so ein fertiges Virtual Box Aufbauscript im Hintergrund und das lief"}, {"id": 116, "start": 806.72, "end": 819.04, "text": "nicht wirklich gut, ne echt, aber bestimmt auch keine ordentlich aktuelle ZSH, also"}, {"id": 117, "start": 819.04, "end": 821.82, "text": "die ganzen Linux Tools, kann ich mich zumindest noch dran erinnern, waren früher ziemlich"}, {"id": 118, "start": 821.82, "end": 828.24, "text": "alt unter, also diese ganzen Open Source Commando Zeilen Tools, die waren unter Mac immer ziemlich"}, {"id": 119, "start": 828.24, "end": 832.92, "text": "alt, die hatten beispielsweise auch irgendeine AWK Version, die irgendwie 10 Versionen zurück"}, {"id": 120, "start": 832.92, "end": 839.08, "text": "war, die manche Parameter nicht konnte, warum ist Mac OS so schwer zum Laufen zu bringen,"}, {"id": 121, "start": 839.08, "end": 847.32, "text": "warte mal, sag ich dir gleich, mal kurz gucken, dass ich nichts übersehen habe, ja also DNS"}, {"id": 122, "start": 847.32, "end": 852.08, "text": "ist tatsächlich oft an Sachen schuld, dass es nicht funktioniert, aber wenn es funktioniert,"}, {"id": 123, "start": 852.08, "end": 858.6, "text": "dann ist es beim Spielen egal, ja, hab ich, der wollte mir das Video aber eigentlich bis"}, {"id": 124, "start": 858.6, "end": 864.56, "text": "gestern liefern, also falls du noch willst, sag Bescheid, ich brauch bestimmt in Zukunft"}, {"id": 125, "start": 864.56, "end": 878.56, "text": "noch mehr, wenn du sowas professionell ambitioniert machst, so, also, ja, das ist ne gute Frage,"}, {"id": 126, "start": 878.56, "end": 885.44, "text": "das ist aber auch relativ schnell beantwortet, weil Apple keinerlei Interesse hat in der"}, {"id": 127, "start": 885.44, "end": 889.84, "text": "VM zum Laufen gebracht zu werden, was unter anderem dann dazu führt, dass beispielsweise"}, {"id": 128, "start": 889.84, "end": 897.36, "text": "alle möglichen Grafikkartentreiber, die es gibt, also die Grafikkarten, die beispielsweise"}, {"id": 129, "start": 897.36, "end": 906.52, "text": "VMWare gut emulieren kann, dass es dafür nichts gescheites an Treibern für Mac OS gibt zum"}, {"id": 130, "start": 906.52, "end": 916.68, "text": "Beispiel, und dazu kommt, dass glaube ich sogar Apple sagt, man darf Mac OS nicht emulieren"}, {"id": 131, "start": 916.68, "end": 923.68, "text": "unter, äh nicht virtualisieren, unter einem anderen Betriebssystem, das sieht man nämlich"}, {"id": 132, "start": 923.68, "end": 933.56, "text": "unter anderem daran, dass in der normalen, vor allem der Workstation Version, äh, ja,"}, {"id": 133, "start": 933.56, "end": 940.28, "text": "das an Mac zur Auswahl ist, das ist aber nur Kosmetik, also man kann mit nem ganz einfachen"}, {"id": 134, "start": 940.28, "end": 947.96, "text": "Patch das aktivieren, dann steht dann hier auch Mac zur Auswahl, weil VMWare auf Mac"}, {"id": 135, "start": 947.96, "end": 956.12, "text": "kann das ja, Apple hat da einfach überhaupt kein Interesse dran, es ist tatsächlich dumm,"}, {"id": 136, "start": 956.12, "end": 963.32, "text": "weil so ein Mac in einer VM wäre eine schöne Sache, was ein bisschen schwierig ist, also"}, {"id": 137, "start": 963.32, "end": 967.32, "text": "das hab ich auch schon gemerkt, als ich das mal selbst virtualisiert hab, du hast halt"}, {"id": 138, "start": 967.32, "end": 972.16, "text": "das Problem mit der komischen Control-Taste, dass du dich da erst ein bisschen umgewöhnen"}, {"id": 139, "start": 972.16, "end": 973.16, "text": "musst."}, {"id": 140, "start": 973.16, "end": 979.16, "text": "Hast du dich mal mit Data Science und Machine Learning beschäftigt, na das ist ja so ein"}, {"id": 141, "start": 979.16, "end": 985.44, "text": "großes Thema, ich hab sicherlich schon Gebiete aus beiden Bereichen gestreift, ich mein wir"}, {"id": 142, "start": 985.44, "end": 992.08, "text": "haben ja sogar im Stream mal Personenerkennung in Videofeeds gemacht, das ist doch gar nicht"}, {"id": 143, "start": 992.08, "end": 997.36, "text": "so lange her, ich glaub das war sogar dieses Jahr irgendwann, oder Ende letzten Jahres."}, {"id": 144, "start": 997.36, "end": 1004.52, "text": "Ja, das stimmt, ja aber das ist auch, Apple machts ja absichtlich so, dass man das nicht"}, {"id": 145, "start": 1004.52, "end": 1005.68, "text": "richtig virtualisieren kann."}, {"id": 146, "start": 1005.68, "end": 1012.76, "text": "Äh, was hältst du jetzt, sind das die mit Terraform, muss ich mal kurz gucken, kann"}, {"id": 147, "start": 1012.76, "end": 1017.52, "text": "sein, dass die, ja das sind die mit Terraform, Vault, Terraform, Konsult, achja die sind"}, {"id": 148, "start": 1017.52, "end": 1025.52, "text": "das gut, ja das Zeug ist nicht schlecht, das haben wir auch im Einsatz, sowohl Konsult"}, {"id": 149, "start": 1025.52, "end": 1030.28, "text": "als auch Terraform, Konsult ist ja im Prinzip so eine Art Key Value Store, Terraform ist"}, {"id": 150, "start": 1030.28, "end": 1037.68, "text": "quasi Jammel, Serveraufbau für die Cloud, das ist schon ok, das hab ich noch glaub ich"}, {"id": 151, "start": 1037.68, "end": 1045.24, "text": "nicht verwendet, aber die zwei Sachen, also gerade das find ich nicht schlecht, an das"}, {"id": 152, "start": 1045.24, "end": 1050.24, "text": "ich jetzt nicht sagen will, oh das sind meine absoluten Lieblingstools, aber das kann man"}, {"id": 153, "start": 1050.24, "end": 1051.24, "text": "schon benutzen."}, {"id": 154, "start": 1051.24, "end": 1057.6, "text": "Ich muss mal überlegen, was sind so meine, wirklich, was sind so die Programme die ich"}, {"id": 155, "start": 1057.6, "end": 1067.04, "text": "echt gerne verwende, also wo ich sag, hey, das ist richtig, richtig nice, macht richtig"}, {"id": 156, "start": 1067.04, "end": 1073.32, "text": "Spaß damit zu arbeiten, ja ok, JetBrains Rider auf jeden Fall, muss ich sagen, Visual Studio"}, {"id": 157, "start": 1073.32, "end": 1078.2, "text": "Code ist auch nicht so schlecht, auch wenn's mich manchmal nervt, aber an sich ist es durchaus"}, {"id": 158, "start": 1078.2, "end": 1091.48, "text": "in Ordnung, gut konfigurierte ZSH ist auch nice, SSH, so basic das klingt, ich glaube,"}, {"id": 159, "start": 1091.48, "end": 1096.76, "text": "ich glaube ohne Scheiß, ich glaube, eines meiner absoluten Lieblingsprogramme ist SSH,"}, {"id": 160, "start": 1096.76, "end": 1099.76, "text": "nicht unbedingt weil man sich Remote auf Server verbinden kann, das ist jetzt nicht"}, {"id": 161, "start": 1099.76, "end": 1107.64, "text": "so, du kannst mit SSH so unglaublich viel machen, was Portweiterleitung angeht, du kannst ganze"}, {"id": 162, "start": 1107.64, "end": 1113.52, "text": "Netze, du kannst ein Socksproxy machen, also SSH ist so das Universal-Tunnel-Tool schlechthin,"}, {"id": 163, "start": 1113.52, "end": 1117.28, "text": "was ich schon mit SSH für Dinger gemacht hab, was anderweitig ein riesen Aufwand gewesen"}, {"id": 164, "start": 1117.28, "end": 1123.8, "text": "wäre, also gerade mit Portsweiterleiten und Tunnel über Tunnel in Tunnel, also SSH ist"}, {"id": 165, "start": 1123.8, "end": 1125.68, "text": "wirklich sehr poggers, was man damit machen kann."}, {"id": 166, "start": 1125.68, "end": 1140.36, "text": "T-MAX ist auch nice, hier siehst du die ZSH, kannst du das aufmachen, SSH, ach, ich glaube,"}, {"id": 167, "start": 1140.36, "end": 1149.44, "text": "das ist sogar relativ aktuell oder, nicht USH, SSH, guck mal, mittlerweile sind die auch"}, {"id": 168, "start": 1149.44, "end": 1158.72, "text": "auf Shithub, ne, anscheinend nicht, anscheinend nicht, warum sind die auf Sourceforge, ja,"}, {"id": 169, "start": 1158.72, "end": 1166.92, "text": "das ist aktuell, warum sind die, Alter, guckt euch die Webseite an, PainsChamp, was ist"}, {"id": 170, "start": 1166.92, "end": 1177.08, "text": "das für ne Webseite wieder, the fuck, da hat wahrscheinlich die letzten 15 Jahre keiner"}, {"id": 171, "start": 1177.08, "end": 1186.72, "text": "mehr was dran gemacht, ja, 5.8. ist relativ aktuell, aber die hast du bestimmt nachinstalliert,"}, {"id": 172, "start": 1186.72, "end": 1194.84, "text": "das ist nicht die, die standardmäßig drauf ist, oder, dass man als Entwickler gezwungen"}, {"id": 173, "start": 1194.84, "end": 1200.52, "text": "wird, ein Mac, ja, das ist kacke, es gibt, es gibt ein paar, also es gibt eine Ausnahme,"}, {"id": 174, "start": 1200.52, "end": 1208.4, "text": "die ich kenne mittlerweile, was das angeht, man kann, also was jetzt da schon länger geht"}, {"id": 175, "start": 1208.4, "end": 1213.44, "text": "ist, man kann den Grad entwickeln, aber letztendlich zum Signen und Uploaden für Apps und sowas"}, {"id": 176, "start": 1213.44, "end": 1218.56, "text": "brauchst du irgendwie einmalig Xcode, ich kenne jetzt aber, ich weiß leider den Namen"}, {"id": 177, "start": 1218.56, "end": 1223.48, "text": "nicht, aber ich hab da letztens in Webcast drüber gesehen, es gibt jetzt einen Cloud-Anbieter,"}, {"id": 178, "start": 1223.48, "end": 1226.96, "text": "der das für dich machen kann, du brauchst natürlich immer noch Code Signing Zertifikat"}, {"id": 179, "start": 1226.96, "end": 1231.12, "text": "und einen Developer Account und sonst was, aber die packagen deine App komplett für"}, {"id": 180, "start": 1231.12, "end": 1238.68, "text": "dich, für den App Store, sodass du theoretisch keinen Mac mehr brauchst, aber ich weiß nicht,"}, {"id": 181, "start": 1238.68, "end": 1248.44, "text": "wie verbreitet das ganze ist, ja, ich werde nach Möglichkeit, angeblich war irgendwann"}, {"id": 182, "start": 1248.44, "end": 1253.32, "text": "die Tage jetzt wieder ein Event, aber mich hat EA nicht eingeladen, warum wohl, ich könnte,"}, {"id": 183, "start": 1253.32, "end": 1263.0, "text": "ich könnte mir vorstellen, dass das unter anderem an, dass das unter anderem an, vielleicht"}, {"id": 184, "start": 1263.0, "end": 1266.68, "text": "diesem Video liegt, ich weiß nicht so genau, ne, glaube ich nicht, wahrscheinlich haben"}, {"id": 185, "start": 1266.68, "end": 1270.12, "text": "die nur irgendwie einen ausgewählten Kreis gehabt, also ist mir auch egal, juckt mich"}, {"id": 186, "start": 1270.12, "end": 1278.44, "text": "ehrlich gesagt überhaupt nicht, ich werde dann einfach Freitag was aufnehmen, das passt,"}, {"id": 187, "start": 1278.44, "end": 1281.4, "text": "Freitag habe ich eh Homeoffice, da kann ich einfach ein bisschen früher aufhören und"}, {"id": 188, "start": 1281.4, "end": 1288.04, "text": "dann kann ich Battlefield was aufnehmen und so, erster Eindruck raufladen für abends,"}, {"id": 189, "start": 1288.04, "end": 1293.0, "text": "ich werde aber vorher noch ein anderes Video machen, ich mach entweder, also ich mach Mittwoch"}, {"id": 190, "start": 1293.0, "end": 1298.92, "text": "oder Donnerstag, wahrscheinlich, wahrscheinlich Mittwoch, da es noch ein bisschen mehr Zeit"}, {"id": 191, "start": 1298.92, "end": 1306.6, "text": "ist, so zur Einstimmung noch ein Zusammenschnitt der Highlights aus den drei Beta Streams,"}, {"id": 192, "start": 1306.6, "end": 1310.28, "text": "ja ich weiß es hat ein bisschen gedauert, aber ich kann nichts dafür, wenn alle Cutter"}, {"id": 193, "start": 1310.28, "end": 1317.4, "text": "so langsam sind, richtig witziges Video, nice, wenn es dir gefallen hat, ich hab es zu einer"}, {"id": 194, "start": 1317.4, "end": 1321.56, "text": "etwas ungünstigen Zeit hochgeladen, das sehe ich an den Views, aber ich denke mal, das"}, {"id": 195, "start": 1321.56, "end": 1325.2, "text": "wird sich die nächsten Tage noch erholen, heu ich hab es heute um 12 hochgeladen, Montag"}, {"id": 196, "start": 1325.2, "end": 1334.24, "text": "12 Uhr ist selten, eine gute Idee, ach haben sie das jetzt komplett ausgeschaltet, dass"}, {"id": 197, "start": 1334.24, "end": 1355.2, "text": "du unsight installieren kannst, feels Batman, was hältst du von Wirtschaftsinformatik, eher"}, {"id": 198, "start": 1355.2, "end": 1358.8, "text": "so nichts halbes und nichts ganzes oder doch ganzes, was ist sinnvoll Windows oder Mac"}, {"id": 199, "start": 1358.8, "end": 1367.12, "text": "beziehungsweise IT, also das sind ja komplett unterschiedliche Sachen, was hältst du von"}, {"id": 200, "start": 1367.12, "end": 1371.04, "text": "Wirtschaftsinformatik, das kommt ganz so an, was man machen will, ich glaube nicht, dass"}, {"id": 201, "start": 1371.04, "end": 1377.12, "text": "man nichts sagen kann, nichts halbes und nichts ganzes, es gibt ja mittlerweile einige Positionen"}, {"id": 202, "start": 1377.12, "end": 1381.68, "text": "in der IT, wo ein bisschen Wirtschaftskram nicht verkehrt ist und auch in der Wirtschaft,"}, {"id": 203, "start": 1381.68, "end": 1386.56, "text": "weil Teebra von irgendwelchen Projektmanagern bis irgendwelchen, ach keine Ahnung, es ist"}, {"id": 204, "start": 1386.56, "end": 1390.0, "text": "nicht meine Welt, aber ich glaube nicht, dass es verkehrt ist, es ist zumindest bei weitem"}, {"id": 205, "start": 1390.0, "end": 1396.96, "text": "nicht so hart wie beispielsweise ein reines Informatikstudium, ich denke, das ist nichts"}, {"id": 206, "start": 1396.96, "end": 1405.6, "text": "schlechtes, das zu machen, so und jetzt kommen wir zu der eigentlichen Frage und was ist"}, {"id": 207, "start": 1405.6, "end": 1411.98, "text": "sinnvoller Windows oder Mac beziehungsweise IT Anwendung, also das kann man so pauschal"}, {"id": 208, "start": 1411.98, "end": 1420.36, "text": "nicht beantworten, besser in was, besser für Spiele, das ist natürlich Windows, besser"}, {"id": 209, "start": 1420.36, "end": 1425.44, "text": "für Audio, Video, würde ich sagen nimmt sich mittlerweile gar nicht mehr so viel, vielleicht"}, {"id": 210, "start": 1425.44, "end": 1432.64, "text": "von der Grundlage immer noch Mac, aber im Serverbereich eindeutig keines von beiden,"}, {"id": 211, "start": 1432.64, "end": 1444.4, "text": "so in der Linux, das kann man so pauschal nicht beantworten, ey ich habe einen Staubsauger"}, {"id": 212, "start": 1444.4, "end": 1453.76, "text": "Roboter von Xiaomi, von den China-Chinesen also hier, glaubt ihr heißt V1, ne die Dinger"}, {"id": 213, "start": 1453.76, "end": 1462.64, "text": "heißen immer Roborock oder sonst wie was, also da musst du bei das Cloud gucken, ob"}, {"id": 214, "start": 1462.64, "end": 1475.2, "text": "das geht, das Cloud, das Cloud, ich kann richtig schreiben, da musst du hier gucken, ob deiner"}, {"id": 215, "start": 1475.2, "end": 1491.6, "text": "flashbar ist oder hier, gucken ob deiner flashbar ist, V1 fällt mir halt nix ein was das sein"}, {"id": 216, "start": 1491.6, "end": 1505.6, "text": "könnte, so, CSS ist blau, CSS ist vor allem eins, nämlich PaintsChamp, nutzt du, was ist"}, {"id": 217, "start": 1505.6, "end": 1512.16, "text": "MC, Midnight Commander, Minecraft wirds nicht sein, ne mach ich nicht, pur Shell Beste,"}, {"id": 218, "start": 1512.16, "end": 1528.88, "text": "aha, wusst ich gar nicht, dass die mittlerweile so aktuell sind, dich lacht keiner aus dafür,"}, {"id": 219, "start": 1528.88, "end": 1535.92, "text": "dass du Wirtschaftsinformatik studiert hast, warum sollten sie, nö, du arbeitest bald"}, {"id": 220, "start": 1535.92, "end": 1544.56, "text": "bei der Bahn, Poggers oder auch nicht, je nachdem, Usus was ist das, kann man das öffnen,"}, {"id": 221, "start": 1544.56, "end": 1553.56, "text": "ahja, das ist auch ne Möglichkeit, man kann sich bei Hetzer einen Mac mieten, da kann"}, {"id": 222, "start": 1553.56, "end": 1560.24, "text": "man auch seine Sachen zeigen, das ist ne gute Idee, wenn man sonst nicht bescheid, wenn"}, {"id": 223, "start": 1560.24, "end": 1567.16, "text": "man sonst keinen Bock hat, sich einen Mac zu kaufen, ja, eigentlich ist ne gute Idee,"}, {"id": 224, "start": 1567.16, "end": 1578.8, "text": "das war Mac, Mac as a Service, wo wir grad dabei sind, ihr könnt natürlich mal Ausrufezeichen"}, {"id": 225, "start": 1578.8, "end": 1589.92, "text": "Hetzer im Chat eingeben, dann kriegt ihr einen 20€ Startgutschein für die Hetzer Cloud,"}, {"id": 226, "start": 1589.92, "end": 1594.28, "text": "ich bin hyped auf Battlefield 20 240, bist du hyped auf Battlefield 20 240, ich freu mich"}, {"id": 227, "start": 1594.28, "end": 1603.76, "text": "wirklich auf den Release, ja, super mega gehyped bin ich erst, wenn das nicht so schlimm eintritt"}, {"id": 228, "start": 1603.76, "end": 1610.16, "text": "wie ich es aus dem Beta Video gesagt habe, ich bin mal gespannt, ich hoffe das Rush dabei"}, {"id": 229, "start": 1610.16, "end": 1615.84, "text": "ist, in halbwegs präsenter Art und Weise, angeblich ist es ja dabei, aber wie genau,"}, {"id": 230, "start": 1615.84, "end": 1620.76, "text": "müssen wir mal sehen, das ist so ein Punkt, der bei mir noch offen ist, und halt die ganzen"}, {"id": 231, "start": 1620.76, "end": 1629.68, "text": "Probleme aus der Beta und halt am Ende gucken, ob es einen Serverbrowser gibt und sowas,"}, {"id": 232, "start": 1629.68, "end": 1637.68, "text": "kennst du günstiges Mac, nein, da kenn ich gar keine, meine Lampen hab ich auch nicht"}, {"id": 233, "start": 1637.68, "end": 1643.92, "text": "geflasht, ich hab ja als Lampen eigentlich so gut, also als RGB, oder als dimmbare, als"}, {"id": 234, "start": 1643.92, "end": 1650.64, "text": "WLAN Lampen hab ich ja eigentlich nur die hier, von denen, die hab ich nicht geflasht,"}, {"id": 235, "start": 1650.64, "end": 1655.92, "text": "ich glaub die kann man gar nicht flaschen, mit 47 zu alt für Fernstehendem Informatik,"}, {"id": 236, "start": 1655.92, "end": 1662.12, "text": "bin ich jetzt, das kann ich schlecht einschätzen, ich mein ich bin jetzt 37, das ist quasi"}, {"id": 237, "start": 1662.12, "end": 1667.88, "text": "bis nochmal 10 Jahre älter, also ich denke nicht, dass man dafür zu alt ist, wenn man"}, {"id": 238, "start": 1667.88, "end": 1671.52, "text": "da Bock drauf hat, ich hätte da, ich kann es nur aus mir sagen, ich hätte da keinen"}, {"id": 239, "start": 1671.52, "end": 1677.96, "text": "Bock drauf, ich würde da knarrenlos failen, weil ich dann mega faul wäre und nichts machen"}, {"id": 240, "start": 1677.96, "end": 1678.96, "text": "würde."}, {"id": 241, "start": 1678.96, "end": 1693.92, "text": "Ja wenn du bald bei der Bahn arbeitest, kannst du ja dafür sorgen, dass jetzt alles besser"}, {"id": 242, "start": 1693.92, "end": 1698.96, "text": "wird, ne da hat ja natürlich ein Einzeler keinen Einfluss drauf, das ist ja auch klar,"}, {"id": 243, "start": 1698.96, "end": 1702.52, "text": "ich glaube sogar, dass die meisten Leute, die bei der Bahn arbeiten, sich wirklich Mühe"}, {"id": 244, "start": 1702.52, "end": 1710.44, "text": "geben, aber da ist halt einfach, die Bahn ist einfach shit bei Design, und ich glaube"}, {"id": 245, "start": 1710.44, "end": 1716.08, "text": "auch nicht, dass wir das in nächster Zeit jemals hinkriegen, genauso, also ich glaube"}, {"id": 246, "start": 1716.08, "end": 1722.68, "text": "wir kriegen genauso wenig hin, dass es mit der Bahn richtig funktioniert, wie IPv6, das"}, {"id": 247, "start": 1722.68, "end": 1729.44, "text": "sind beides so Sachen, die klappen einfach nie."}, {"id": 248, "start": 1729.44, "end": 1732.52, "text": "Ja das ist die.net 6 Ankündigung, die wollten wir uns gleich noch angucken."}, {"id": 249, "start": 1732.52, "end": 1740.0, "text": "Was sagst du zu Mediamark Transomware Angriff, also diesen Saturn Mediamark Schichten, ich"}, {"id": 250, "start": 1740.0, "end": 1743.48, "text": "habe es nur ganz kurz vorher glaube ich auf GoLam oder Heise gesehen, ich habe keine Ahnung,"}, {"id": 251, "start": 1743.48, "end": 1744.48, "text": "was da gewesen ist."}, {"id": 252, "start": 1744.48, "end": 1754.84, "text": "Am Wochenende haben kriminell die Saber der Mediamark Saturn Holding mit einem Verschlüsselungstrojaner"}, {"id": 253, "start": 1754.84, "end": 1755.84, "text": "angegriffen."}, {"id": 254, "start": 1755.84, "end": 1761.88, "text": "Tja, es geht, wie man in Hessen so schön sagt, es geht um Menschen wie Deloitte, also warum"}, {"id": 255, "start": 1761.88, "end": 1765.92, "text": "soll das bei denen nicht auch passieren, das ist sowas, das ist schon ganz anderen passiert."}, {"id": 256, "start": 1765.92, "end": 1785.72, "text": "Uns ist ja auch sowas ähnliches mal passiert, also insofern."}, {"id": 257, "start": 1785.72, "end": 1791.76, "text": "Was in der Nacht von Samstag auf Montag führte eine Gruppe eines Cyber Attacken durch, Eier."}, {"id": 258, "start": 1791.76, "end": 1800.72, "text": "Und weiter, es seien mehrere Windows Server, ja was sonst, was, was sonst, übrigens bei"}, {"id": 259, "start": 1800.72, "end": 1805.04, "text": "uns, wo wir uns auch so Verschlüsselungskram eingefangen haben, das war natürlich auch"}, {"id": 260, "start": 1805.04, "end": 1814.64, "text": "nur Windows Server, klar ne, es seien mehrere Windows Server mit einem Kryptovirus infiziert"}, {"id": 261, "start": 1814.64, "end": 1815.64, "text": "worden."}, {"id": 262, "start": 1815.64, "end": 1823.52, "text": "3100 Server, boah, das ist aber ordentlich."}, {"id": 263, "start": 1823.52, "end": 1830.32, "text": "Ah gut, da sind VMs auch garantiert mit drin, der logische Server ist damit gemeint, aber"}, {"id": 264, "start": 1830.32, "end": 1834.56, "text": "das ist trotzdem, das ist so stattlich, ja."}, {"id": 265, "start": 1834.56, "end": 1839.76, "text": "Das Problem dabei ist eigentlich, warum haben die so viele Windows Server, warum um alles"}, {"id": 266, "start": 1839.76, "end": 1845.24, "text": "in der Welt, was braucht man alles, was Windows Only ist?"}, {"id": 267, "start": 1845.24, "end": 1850.76, "text": "Jetzt laufen die ganzen Laden-IT-Geschichten nur unter Windows, von Kasse bis Anzeigewende"}, {"id": 268, "start": 1850.76, "end": 1856.92, "text": "und sonst was, vielleicht ist das Windows Only und dann ist es kein Wunder, dass das"}, {"id": 269, "start": 1856.92, "end": 1858.28, "text": "so viele Windows Server sind."}, {"id": 270, "start": 1858.28, "end": 1865.32, "text": "Die Kassen vom Netz zu nehmen, den Computer nicht zu benutzen, ah ok, ja ja, dann ist"}, {"id": 271, "start": 1865.32, "end": 1866.32, "text": "das sowas in der Richtung."}, {"id": 272, "start": 1866.32, "end": 1872.64, "text": "Danke für 100 Millionen Bits, Pog, online nicht betroffen, ja das ist wahrscheinlich"}, {"id": 273, "start": 1872.64, "end": 1873.64, "text": "auch Linux-Kisten."}, {"id": 274, "start": 1873.64, "end": 1875.48, "text": "Die Online-Shops sind bestimmt Lienungskisten."}, {"id": 275, "start": 1875.48, "end": 1884.68, "text": "Wir arbeiten derzeit, das ist so eine typische Bullshit-Meldung, ja, weil die irgendwas sagen"}, {"id": 276, "start": 1884.68, "end": 1885.68, "text": "müssen."}, {"id": 277, "start": 1885.68, "end": 1889.4, "text": "Wir arbeiten derzeit intensiv mit internen und externen Experten sowie den zuständigen"}, {"id": 278, "start": 1889.4, "end": 1893.64, "text": "Behörden, um den Schaden schnellstmöglich zu identifizieren, also die Behörden werden"}, {"id": 279, "start": 1893.64, "end": 1898.4, "text": "ihnen da erstmal unmittelbar gar nichts, in irgendeiner Art und Weise helfen können,"}, {"id": 280, "start": 1898.4, "end": 1899.4, "text": "was sollen die machen?"}, {"id": 281, "start": 1899.4, "end": 1902.4, "text": "Ja, was sollen Behörden da machen?"}, {"id": 282, "start": 1902.4, "end": 1909.04, "text": "Windows Server neu installieren für Mediamarkt oder was, nee, das ist vielleicht um eventuell"}, {"id": 283, "start": 1909.04, "end": 1912.28, "text": "irgendwann mal in der Zukunft jemand zu finden, der dafür verantwortlich ist, also unmittelbar"}, {"id": 284, "start": 1912.28, "end": 1918.56, "text": "bringt das jetzt erstmal nichts, zumal was sollen sie machen, wenn sie den Typ erwischen?"}, {"id": 285, "start": 1918.56, "end": 1923.72, "text": "Müsste den immer noch irgendwie Master-Passwort geben, falls es eins gibt, also das ist das,"}, {"id": 286, "start": 1923.72, "end": 1925.44, "text": "das das Geblödsinn bringt nichts."}, {"id": 287, "start": 1925.44, "end": 1929.88, "text": "Externe Experten bringen ja auch erstmal unmittelbar nichts, weil die von der Infrastruktur meistens"}, {"id": 288, "start": 1929.88, "end": 1930.88, "text": "keine Ahnung haben."}, {"id": 289, "start": 1930.88, "end": 1937.12, "text": "Man holt sich da nur externe Experten hinzu, weil es gut klingt, oder zum Beruhigen, also"}, {"id": 290, "start": 1937.12, "end": 1944.72, "text": "gut, ich meine Ausnahmen bestätigen die Regel, ich kann natürlich jetzt nicht von uns, von"}, {"id": 291, "start": 1944.72, "end": 1949.8, "text": "mir da auf alle schließen, aber in der Regel, wenn bei uns externe Experten geholt wurden"}, {"id": 292, "start": 1949.8, "end": 1954.72, "text": "in der Vergangenheit, dann haben die selten irgendwas akut dazu beigetragen, dass Probleme"}, {"id": 293, "start": 1954.72, "end": 1960.16, "text": "behoben wurden, sie waren eher zum Beruhigen da, dass dann der Vorstand sagen konnte, dass"}, {"id": 294, "start": 1960.16, "end": 1963.76, "text": "man dann dem Vorstand sagen konnte, guckt hier, da wurde was gemacht und sowas, generell"}, {"id": 295, "start": 1963.76, "end": 1973.4, "text": "ist es unglaublich, wie viel in der IT politische Entscheidungen sind, also zum Beispiel diese"}, {"id": 296, "start": 1973.4, "end": 1980.76, "text": "ganze Idee dahinter, wir outsourcen Sachen oder wir kaufen das ein von irgendeinem externen"}, {"id": 297, "start": 1980.76, "end": 1986.12, "text": "Dienstleister und sowas, das ist oftmals gar nicht aus dem Grund, weil man wirklich denkt,"}, {"id": 298, "start": 1986.12, "end": 1993.04, "text": "dass die das besser können, sondern weil man dann einen Zettel hat, wo drauf steht,"}, {"id": 299, "start": 1993.04, "end": 1998.68, "text": "wir garantieren 99,998 oder irgendwie sowas, Verfügbarkeit, und wenn das nicht so ist,"}, {"id": 300, "start": 1998.68, "end": 2002.64, "text": "da kannst du sagen, ja gut, an uns liegt das ja nicht, der Dienstleister hat sein SLA verletzt,"}, {"id": 301, "start": 2002.64, "end": 2007.48, "text": "was am Ende unerm Strich keinen Unterschied macht, aber es ist so, es ist so wie bei Monopoly,"}, {"id": 302, "start": 2007.48, "end": 2014.0, "text": "diese irgendwie, geh aus dem Gefängniskarte, normalerweise kriegst du dann als Oberer Manager"}, {"id": 303, "start": 2014.0, "end": 2016.8, "text": "voll auf den Sack, wenn was kaputt geht und da kannst du sagen, ah guck mal hier, ich"}, {"id": 304, "start": 2016.8, "end": 2021.08, "text": "hab SLAs gemacht, das ist, ja der Anbieter ist kacke, wir suchen uns einen neuen Anbieter,"}, {"id": 305, "start": 2021.08, "end": 2027.16, "text": "ich kann ja nichts dafür und anscheinend funktioniert das auch, anders kann ich mir das nicht erklären."}, {"id": 306, "start": 2027.16, "end": 2037.8, "text": "Man kann das einfach besser verkaufen, wenn externe das verkackt haben, als wenn es interne"}, {"id": 307, "start": 2037.8, "end": 2043.24, "text": "waren, auch wenn es vielleicht unerm Strich besser gelaufen wäre, ist schwer zu sagen,"}, {"id": 308, "start": 2043.24, "end": 2045.64, "text": "also das glaube ich an der Stelle bringt das auch gar nichts."}, {"id": 309, "start": 2045.64, "end": 2054.12, "text": "Bei SLAs hast du zum Beispiel Anprobe, das stimmt, das hast du, das hast du, das interessiert"}, {"id": 310, "start": 2054.12, "end": 2057.28, "text": "dich aber unmittelbar jetzt ja auch nicht, also es ist jetzt vielleicht so, dass du sagen,"}, {"id": 311, "start": 2057.28, "end": 2063.48, "text": "das ist jetzt nicht so, dass du sagen kannst, hier die SLA wird nicht eingehalten, jetzt,"}, {"id": 312, "start": 2063.48, "end": 2067.48, "text": "also die Surfer sind natürlich auch nicht schneller wieder da, das haben wir uns gerade"}, {"id": 313, "start": 2067.48, "end": 2072.96, "text": "angeguckt, also aber so deine Kunden werden nicht zufriedener dadurch, dass du SLAs hast,"}, {"id": 314, "start": 2072.96, "end": 2077.56, "text": "du könntest im Endeffekt dann sagen, hey durch den Ausfall ist mir so und so viel entstanden,"}, {"id": 315, "start": 2077.56, "end": 2080.76, "text": "wobei ich da ehrlich sagen muss, kann sein, dass ich es einfach nur nicht mitbekommen"}, {"id": 316, "start": 2080.76, "end": 2085.36, "text": "habe, aber ich glaube, also bei uns haben auch schon einige Dienstleiste ihre SLAs nicht"}, {"id": 317, "start": 2085.36, "end": 2090.56, "text": "auf die Kette bekommen, dass es am Endeffekt nicht das war was vereinbart war, ich glaube"}, {"id": 318, "start": 2090.56, "end": 2095.0, "text": "in Form von irgendwelchen Zahlungen ist da nie was passiert."}, {"id": 319, "start": 2095.0, "end": 2107.56, "text": "Was in den vergangenen Monaten haben auf große Unternehmen wiederholt, ja gut, das liegt wahrscheinlich"}, {"id": 320, "start": 2107.56, "end": 2112.76, "text": "aber auch daran jetzt mal ganz im Ernst, wenn ich hier schon lese, dass das 3100 Windows"}, {"id": 321, "start": 2112.76, "end": 2117.0, "text": "Systeme sind, wo steht es denn, die 3100 Windows Server sind betroffen, ich gehe mal davon"}, {"id": 322, "start": 2117.0, "end": 2123.36, "text": "aus, die werden das sicherheitstechnisch auch nicht allzu ernst nehmen, das sind dann wahrscheinlich"}, {"id": 323, "start": 2123.36, "end": 2129.76, "text": "keine Ahnung 1-2 Leute oder irgendwie so ein Verkäufer macht dann IT Zeug pro Filiale mit"}, {"id": 324, "start": 2129.76, "end": 2133.84, "text": "oder sowas, das wird wahrscheinlich abenteuerlich sein."}, {"id": 325, "start": 2133.84, "end": 2143.44, "text": "So, gehen wir hier rüber."}, {"id": 326, "start": 2143.44, "end": 2156.72, "text": "Ja warte mal ab, bis es dann rauskommt, als was du da wirklich machen musst, wenn man zum"}, {"id": 327, "start": 2156.72, "end": 2161.88, "text": "Beispiel Algorithmenlaufzeiten und sowas abschätzen muss und sowas, wobei da gibt es noch viel"}, {"id": 328, "start": 2161.88, "end": 2181.24, "text": "lustigere Sachen, habe ich aber keine Ahnung von, ich habe keine Ahnung wie die das machen,"}, {"id": 329, "start": 2181.24, "end": 2192.88, "text": "PSN wurde, ja das habe ich auch gelesen."}, {"id": 330, "start": 2192.88, "end": 2196.72, "text": "Hat man in der Informatik gute Chancen auf einen Ausbildungsplatz, selbst wenn man nicht"}, {"id": 331, "start": 2196.72, "end": 2200.84, "text": "den besten Lebenslauf hat oder ist es sehr elitär, nein ist es nicht, was, du musst"}, {"id": 332, "start": 2200.84, "end": 2205.56, "text": "jetzt aber nur mal eine Sache genauer erklären, was meinst du mit nicht den besten Lebenslauf,"}, {"id": 333, "start": 2205.56, "end": 2213.24, "text": "also wenn du im Gefängnis warst ist das in der Regel immer schlecht, also von wie nicht"}, {"id": 334, "start": 2213.24, "end": 2220.2, "text": "der beste Lebenslauf reden wir hier, also einfach nur irgendwie mal eine Jahrlücke"}, {"id": 335, "start": 2220.2, "end": 2224.48, "text": "oder irgendwie keinen guten Abschluss oder was auch immer oder hast du wirklich irgendwas"}, {"id": 336, "start": 2224.48, "end": 2236.6, "text": "angestellt mal in der Vergangenheit, aber insgesamt kann man sagen, ja du hast gute"}, {"id": 337, "start": 2236.6, "end": 2242.24, "text": "Chancen und es ist auch nicht sonderlich elitär, warum soll es das sein, die suchen ja händeringend"}, {"id": 338, "start": 2242.24, "end": 2249.72, "text": "Leute, die haben gar keine Möglichkeit, um halt großartig wählerisch zu sein, ein abgebrochenes"}, {"id": 339, "start": 2249.72, "end": 2259.04, "text": "Fachabitur, nein ist überhaupt kein Problem, das ist nicht schlimm, was hast du sonst für"}, {"id": 340, "start": 2259.04, "end": 2270.04, "text": "den Abschluss, wahrscheinlich sind es beim Media Markt auch noch Windows 2003 oder sowas,"}, {"id": 341, "start": 2270.04, "end": 2275.68, "text": "Windows Server 2003 oder so, was ist denn der letzte, was ist denn der älteste Windows"}, {"id": 342, "start": 2275.68, "end": 2289.72, "text": "Server, der noch Supported ist, 2008 wahrscheinlich oder 2012, Windows Server Support Cycle, schauen"}, {"id": 343, "start": 2289.72, "end": 2304.32, "text": "wir mal, Windows Server 2000 ist abgelaufen 2010, 2008 ist vor einem Jahr abgelaufen,"}, {"id": 344, "start": 2304.32, "end": 2311.48, "text": "nee vor einem vor fast zwei Jahren abgelaufen und jetzt ist es nur noch 2012, aber auch"}, {"id": 345, "start": 2311.48, "end": 2323.84, "text": "nur mit Extended Support, der 2016er ist eigentlich nur der aktuelle, ha es wird ja"}, {"id": 346, "start": 2323.84, "end": 2329.44, "text": "witzig, wir fallen auf Anhieb noch Windows 2012 Server bei uns ein, mit denen habe ich"}, {"id": 347, "start": 2329.44, "end": 2336.36, "text": "zum Glück nichts zu tun, aber ich weiß, dass sie 2012 sind, vielleicht haben wir Extended"}, {"id": 348, "start": 2336.36, "end": 2344.64, "text": "Support, keine Ahnung, bin ich froh, dass ich das nicht wissen muss, ja danke für die"}, {"id": 349, "start": 2344.64, "end": 2351.68, "text": "Bits, ja ist eigentlich, muss man ja auch mal sagen, ist das ja gar nicht so wild, wenn"}, {"id": 350, "start": 2351.68, "end": 2355.2, "text": "du Sachen hast, die noch auf Windows XP laufen, die Leute tun immer so, als ist sie sowas"}, {"id": 351, "start": 2355.2, "end": 2359.72, "text": "wie, oh nein, da ist Windows XP drauf, so nach dem Motto, als ist die pure Existenz"}, {"id": 352, "start": 2359.72, "end": 2366.72, "text": "von Windows XP dafür verantwortlich, dass es jetzt alle Viren der Welt installiert hat,"}, {"id": 353, "start": 2366.72, "end": 2370.88, "text": "das ist ja schwachsinnig, wenn du Systeme hast, die getrennt vom Internet laufen oder"}, {"id": 354, "start": 2370.88, "end": 2376.28, "text": "ohne Netzwerk, ist das eigentlich kein Problem, problematisch wird es dann halt nur, wenn es"}, {"id": 355, "start": 2376.28, "end": 2380.68, "text": "beispielsweise Geldautomaten sind mit offener USB Schnittstelle und sowas, gab es ja alle"}, {"id": 356, "start": 2380.68, "end": 2386.28, "text": "schon, aber Windows XP allein ist ja nicht schlimm, problematisch ist es nur, wenn man"}, {"id": 357, "start": 2386.28, "end": 2391.04, "text": "in irgendeiner Art und Weise da dran kommt, am schlimmsten natürlich aus dem Internet,"}, {"id": 358, "start": 2391.04, "end": 2395.64, "text": "wobei das auch schon öfters vorkommt, es gibt ja Suchmaschinen, wo man beispielsweise"}, {"id": 359, "start": 2395.64, "end": 2401.38, "text": "Kameras und ungesicherte Systeme suchen kann und was da alles dranhängt, da haben ja Leute"}, {"id": 360, "start": 2401.38, "end": 2412.68, "text": "schon vom Kraftwerk bis zu irgendwelchen Fahrstuhlsteuerungen alles gefunden, Public im Internet, also das"}, {"id": 361, "start": 2412.68, "end": 2422.04, "text": "ist teilweise abenteuerlich, ist das ein Seagull Emote, weil Seagull hat auch so Dinger, soll"}, {"id": 362, "start": 2422.04, "end": 2430.2, "text": "es schon Festnahmen gegeben haben, ok, ja dann waren die aber ganz schön blöd, eine andere"}, {"id": 363, "start": 2430.2, "end": 2433.48, "text": "Firma wurde letztens direkt bei meiner Schwester, weil sie noch Windows 8 und 9 benutzt haben"}, {"id": 364, "start": 2433.48, "end": 2438.92, "text": "oder so, ja wie gesagt, wenn man das am Netzwerk hängen lässt, ist man, oder sagen wir mal"}, {"id": 365, "start": 2438.92, "end": 2443.84, "text": "so, zweistufig, wenn man es im Internet hängen lässt, ist es schon mal komplett grob fahrlässig,"}, {"id": 366, "start": 2443.84, "end": 2448.24, "text": "wenn man es im Netzwerk hat ungesichert, natürlich auch, aber nicht ganz so schlimm."}, {"id": 367, "start": 2448.24, "end": 2459.16, "text": "Ja, ich würde es auch einfach probieren, gerade wenn du irgendwie spezielle Firmen"}, {"id": 368, "start": 2459.16, "end": 2462.72, "text": "mit einer Aussicht hast, die dich auch persönlich interessiert, würde ich halt sagen, schreib"}, {"id": 369, "start": 2462.72, "end": 2486.2, "text": "auch ein sinnvolles Anschreiben, warum du die so nice findest, ja das habe ich auch gelesen,"}, {"id": 370, "start": 2486.2, "end": 2495.88, "text": "das war aber auch schon ein paar Tage her oder, ah ne 17.03, ne das habe ich nicht gelesen,"}, {"id": 371, "start": 2495.88, "end": 2504.68, "text": "was anderes, ja das kommt laufend vor aktuell, das kommt laufend vor, also es vergeht eigentlich"}, {"id": 372, "start": 2504.68, "end": 2512.68, "text": "kaum ein Tag, dass die nicht irgendwie, irgendeiner verschlüsselt wird oder Kundendaten verliert"}, {"id": 373, "start": 2512.68, "end": 2529.56, "text": "oder sonst was, ja ist bestimmt auch so, ja also ich kann euch sagen, bei uns, wir hatten"}, {"id": 374, "start": 2529.56, "end": 2534.0, "text": "ja auch so einen Verschlüsselungstrojaner Angriff, das ist kein Angriff in dem Sinn,"}, {"id": 375, "start": 2534.0, "end": 2540.96, "text": "also irgendeiner konnte sich mal wieder nicht zusammenreißen, beim, die E-Mail klicken"}, {"id": 376, "start": 2540.96, "end": 2545.84, "text": "wahrscheinlich, ja und bei uns war das auch so, wir hatten einen ungesicherten, jetzt"}, {"id": 377, "start": 2545.84, "end": 2557.16, "text": "was haltet euch mal fest, lacht euch kaputt, ein ungesicherten Windows FTP Server, also"}, {"id": 378, "start": 2557.16, "end": 2564.24, "text": "die beiden, die Kombinationen sind schon hart ja, Windows und FTP und es war glaube ich"}, {"id": 379, "start": 2564.24, "end": 2580.4, "text": "auch Windows 2012 System oder irgendwie sowas und der lief, der lief auch mit irgendeinem"}, {"id": 380, "start": 2580.4, "end": 2588.8, "text": "Admin Account, das war fail, richtig verkackt, zum Glück konnte ich da nichts für, weil"}, {"id": 381, "start": 2588.8, "end": 2614.48, "text": "ich hab mit Windows nix am Hut, eh der Flash Jam ist heute nicht am Start, in deiner Berufsschulklasse"}, {"id": 382, "start": 2614.48, "end": 2621.84, "text": "war mal einer, der im Knast war, ja soll vorkommen, ich mein, es ist sicherlich nicht förderlich"}, {"id": 383, "start": 2621.84, "end": 2625.6, "text": "für den Lebenslauf, ich glaube das macht einem sein restliches Leben lang Probleme,"}, {"id": 384, "start": 2625.6, "end": 2630.36, "text": "sowas, irgendwann kann man es vielleicht mal weglassen, aber wenn das halt noch zu kurz"}, {"id": 385, "start": 2630.36, "end": 2632.84, "text": "in der Vergangenheit ist, fragen die sich auch, ja aber ok, was haben sie denn jetzt"}, {"id": 386, "start": 2632.84, "end": 2638.36, "text": "die letzten, letztes Jahr gemacht, aber ich denke schon, dass sich Leute, also gerade wenn"}, {"id": 387, "start": 2638.36, "end": 2642.08, "text": "das was ist, wo irgendwie einer, wo er noch wirklich relativ jung war, Scheiße gebaut"}, {"id": 388, "start": 2642.08, "end": 2646.16, "text": "hat und jetzt ein paar Jahre älter ist, also ich kann es mir schon vorstellen, dass Leute"}, {"id": 389, "start": 2646.16, "end": 2661.92, "text": "sich auch, dass Leute auch noch die Kurve kriegen können, was ist, was ist Vorku, Vorqualifikation"}, {"id": 390, "start": 2661.92, "end": 2677.44, "text": "vielleicht, Fachoberschulreife mit Qualifikation, aha, schon mal von SQL Injection an Kassen"}, {"id": 391, "start": 2677.44, "end": 2681.0, "text": "durch eigene Barcodes gehört, nein hab ich doch nicht gehört, aber kann ich mir gut"}, {"id": 392, "start": 2681.0, "end": 2685.64, "text": "vorstellen, je nachdem was da läuft und das einliest und dann in die Datenbank schreibt"}, {"id": 393, "start": 2685.64, "end": 2692.04, "text": "oder irgendwas macht, kann ich mir das gut vorstellen, dass das funktioniert, würd mich"}, {"id": 394, "start": 2692.04, "end": 2704.64, "text": "nicht wundern, Punkt die Fall, danke für den Sub, wir haben eine Winner aus sieben"}, {"id": 395, "start": 2704.64, "end": 2711.32, "text": "Maschinen als Testunggeber ungesichert, das ist eine schlechte Idee, ja gut, ich mein,"}, {"id": 396, "start": 2711.32, "end": 2718.4, "text": "solange da keine Ports auf sind, kann da ja eigentlich nicht viel passieren, na die Frage"}, {"id": 397, "start": 2718.4, "end": 2736.0, "text": "mit was im Netz gemeint ist, also per RDP Zugriff drauf ist schonmal doof, RDP ist möglich,"}, {"id": 398, "start": 2736.0, "end": 2743.4, "text": "ja dann hätte ich echt Bedenken, würde ich einfach das Kabel rausziehen, oder zumindest"}, {"id": 399, "start": 2743.4, "end": 2750.36, "text": "die Security sollte einfach das Kabel rausziehen, ja glaube ich auch, also ich gehe davon aus,"}, {"id": 400, "start": 2750.36, "end": 2755.64, "text": "dass sich da teilweise die Leute, die das richtig drauf haben und vielleicht irgendwie"}, {"id": 401, "start": 2755.64, "end": 2763.12, "text": "in China, Russland und sonst wo sitzen, dass sie richtig dick Kohle verdienen, also nicht"}, {"id": 402, "start": 2763.12, "end": 2766.28, "text": "unbedingt die Leute, die es dann letztendlich machen, sondern die, die da halt das sagen"}, {"id": 403, "start": 2766.28, "end": 2781.84, "text": "haben, ja, das hab ich mir auch gefragt, FDP Server, da mag regeln das, das kann, ey,"}, {"id": 404, "start": 2781.84, "end": 2789.96, "text": "das mag zwar alles ein bisschen überzogen sein, aber ich kann mir das schon vorstellen,"}, {"id": 405, "start": 2789.96, "end": 2794.52, "text": "dumme Frage, wodurch unterscheidet sich das normale Desktop Windows von Windows Server,"}, {"id": 406, "start": 2794.52, "end": 2800.08, "text": "na gut, ich bin jetzt kein großartiger Windows Experte, aber das ist, ich würd mal sagen,"}, {"id": 407, "start": 2800.08, "end": 2805.52, "text": "im Prinzip ähnlich, wie jetzt ein Desktop Ubuntu oder ein Server Ubuntu, das unterscheidet"}, {"id": 408, "start": 2805.52, "end": 2811.24, "text": "sich gar nicht so großartig, das unterscheidet sich durch Features, die halt eventuell nur"}, {"id": 409, "start": 2811.24, "end": 2815.48, "text": "lauffähig sind oder nur nutzbar sind auf dem Server, weil Microsoft sich gedacht hat,"}, {"id": 410, "start": 2815.48, "end": 2821.64, "text": "ey, das ist eine Sache, das ist Server exklusiv, du kannst ein paar Sachen halt, so was weiß"}, {"id": 411, "start": 2821.64, "end": 2828.0, "text": "ich, wie Active Directory oder sonstige Sachen, gibt's halt nur für Windows Server, der Colonel"}, {"id": 412, "start": 2828.0, "end": 2832.44, "text": "von Windows, würde ich mal sagen, ist mehr oder weniger der gleiche, ich mein, Windows"}, {"id": 413, "start": 2832.44, "end": 2835.28, "text": "Server sieht ja nicht umsonst aus wie ein Desktop Windows, bloß dass du ein paar Assistenten"}, {"id": 414, "start": 2835.28, "end": 2839.88, "text": "hast, die sich wild angesammelt haben über die letzten 20 Jahre und jeder anders aussieht,"}, {"id": 415, "start": 2839.88, "end": 2845.96, "text": "um irgendwelche Serverdienste zu konfigurieren, also, so ein großer Unterschied ist es nicht."}, {"id": 416, "start": 2845.96, "end": 2855.76, "text": "Ich mein, man muss sich mal überlegen, wenn du ein Windows Server installierst, du hast"}, {"id": 417, "start": 2855.76, "end": 2859.48, "text": "ja da immer noch einen kompletten Windows Desktop dabei, so großen Unterschied kann's"}, {"id": 418, "start": 2859.48, "end": 2860.48, "text": "da gar nicht geben."}, {"id": 419, "start": 2860.48, "end": 2867.08, "text": "Ich weiß, man kann jetzt Windows Server mit Konsole installieren, wisst ihr aber, was"}, {"id": 420, "start": 2867.08, "end": 2871.48, "text": "der Witz ist, wenn du Windows Server mit Konsole installierst, dann installierst du eigentlich"}, {"id": 421, "start": 2871.48, "end": 2877.16, "text": "trotzdem Windows Server mit Desktop, nur dass dann nichts startet, außer, dass du so einen"}, {"id": 422, "start": 2877.16, "end": 2882.92, "text": "hässlichen Command Prompt beim Login kriegst, im Fenster wohlgemerkt, also Windows Server"}, {"id": 423, "start": 2882.92, "end": 2889.36, "text": "ohne GUI ist im Prinzip gar nicht ohne GUI, das ist so ein typischer Microsoft Rotz, was"}, {"id": 424, "start": 2889.36, "end": 2890.76, "text": "auch immer man sich da ausgedacht hat."}, {"id": 425, "start": 2890.76, "end": 2897.96, "text": "Tja, das ist schlecht."}, {"id": 426, "start": 2897.96, "end": 2916.04, "text": "Sowas gibt's dieses Jahr als Weihnachtsthema, Kobalt, ja, Kobalt, wenn du keine Lust auf"}, {"id": 427, "start": 2916.04, "end": 2923.36, "text": "Mathe hast, dann musst du eine Ausbildung machen, wenn du Ausbildung machst, ist es"}, {"id": 428, "start": 2923.36, "end": 2927.44, "text": "mit Mathe nicht so wild, wenn du Informatik studierst und keinen Bock auf Mathe hast,"}, {"id": 429, "start": 2927.44, "end": 2928.44, "text": "kannst du es gleich vergessen."}, {"id": 430, "start": 2928.44, "end": 2939.44, "text": "Wenn du das 11-mal WinGit installierst, Windows Server nicht, das sind unterschiedliche Packages,"}, {"id": 431, "start": 2939.44, "end": 2945.64, "text": "kann schon sein, ja, du kannst theoretisch ja auch alles mit PowerShell machen."}, {"id": 432, "start": 2945.64, "end": 2950.0, "text": "Wahrscheinlich, nicht, dass ich das jemals machen würde."}, {"id": 433, "start": 2950.0, "end": 2968.36, "text": "Was, der Battlefield 3 Streamsniper, hä, ach so, jetzt weiß ich, was du meinst, weil"}, {"id": 434, "start": 2968.36, "end": 2975.0, "text": "ich gestern den Losten im Stream gekillt hab, hab ich ja nix für, ich hab nicht Streamsnipe-ed."}, {"id": 435, "start": 2975.0, "end": 2978.12, "text": "Ich hab einfach normal gespielt."}, {"id": 436, "start": 2978.12, "end": 2988.16, "text": "Du fängst bei Hashi, Hashi, wie spricht man überhaupt aus, Hashi-Korb an, neis, Remote"}, {"id": 437, "start": 2988.16, "end": 2990.08, "text": "von hier oder ziehst du da hin?"}, {"id": 438, "start": 2990.08, "end": 2993.24, "text": "Ich weiß gar nicht, wo die sind, wo haben die ihren Sitz?"}, {"id": 439, "start": 2993.24, "end": 3004.76, "text": "Kokona, ja, Kokona, Remote, ja, ja, dann sieht man, also eins hat, also eins hat, also eins"}, {"id": 440, "start": 3004.76, "end": 3010.48, "text": "hat ja, eins hat ja diese ganze Corona-Geschichte jetzt wirklich zum Vorteil gehabt."}, {"id": 441, "start": 3010.48, "end": 3016.72, "text": "Dadurch, dass jetzt viele Unternehmen sich gezwungen sahen von, wir müssen von jetzt"}, {"id": 442, "start": 3016.72, "end": 3022.32, "text": "auf gleich Homeoffice anbieten oder uns gibt es bald nicht mehr, hat sich da viel geändert."}, {"id": 443, "start": 3022.32, "end": 3027.84, "text": "Das ist Vor- und Nachteil zugleich, wenn man ein bisschen was kann, ist es für einen gut,"}, {"id": 444, "start": 3027.84, "end": 3034.64, "text": "dann sind prinzipiell ja jetzt weltweit Unternehmen offen dafür, umgedreht ist es aber halt"}, {"id": 445, "start": 3034.64, "end": 3041.72, "text": "auch so, dass Unternehmen jetzt auch vermehrt weltweit suchen können, außer wir, wir kriegen"}, {"id": 446, "start": 3041.72, "end": 3042.72, "text": "das ja gar nicht gebacken."}, {"id": 447, "start": 3042.72, "end": 3055.12, "text": "Ihr könnt euch nicht vorstellen, wie oldschool und quasi festgefahren bei uns so die, sagen"}, {"id": 448, "start": 3055.12, "end": 3063.36, "text": "sie so, die Management-Meinung und sowas ist, was das angeht, das ist echt so letztes"}, {"id": 449, "start": 3063.36, "end": 3069.4, "text": "Jahrtausend, ja gut Behörden ist noch schlimmer, Behörden ist noch schlimmer, ich glaube Behörden,"}, {"id": 450, "start": 3069.4, "end": 3074.16, "text": "also Behörden und Bank sind zwar ähnlich, aber Behörden sind noch schlimmer."}, {"id": 451, "start": 3074.16, "end": 3089.24, "text": "Ja, also das ist wirklich krass, also die sind so hinten dran, was das angeht und anstatt"}, {"id": 452, "start": 3089.24, "end": 3092.4, "text": "sich irgendwelche sinnvolle Sachen zu überlegen, machen sie immer nur den ganzen Tag irgendwelche"}, {"id": 453, "start": 3092.4, "end": 3099.4, "text": "Sprüche so, letztens hat sogar irgendeiner einen Blogpost veröffentlicht, wo er erzählt"}, {"id": 454, "start": 3099.4, "end": 3106.68, "text": "hat, dass sie jetzt die super Lösung gegen Corona gefunden haben, sie schlagen uns allen"}, {"id": 455, "start": 3106.68, "end": 3111.64, "text": "vor, eine Lüftungs-App zu installieren und die Lüftungs-App, da kann man dann eingeben,"}, {"id": 456, "start": 3111.64, "end": 3115.92, "text": "wie groß das Büro ist und wie viele Leute drin sitzen, dann klingelt die Lüftungs-App"}, {"id": 457, "start": 3115.92, "end": 3121.4, "text": "alle 15 Minuten, wenn man lüften muss, was bescheuertes, das einfachste wäre, die Leute"}, {"id": 458, "start": 3121.4, "end": 3129.0, "text": "müssten einfach gar nicht hin, da könnten die sich auch nichts einfangen, was passiert"}, {"id": 459, "start": 3129.0, "end": 3137.6, "text": "denn in zwei Wochen, in zwei Wochen habe ich Urlaub für das westliche Jahr, so Dinger,"}, {"id": 460, "start": 3137.6, "end": 3144.4, "text": "also das hat uns wirklich, tatsächlich Corona was ganz Gutes gebracht, dass Homeoffice"}, {"id": 461, "start": 3144.4, "end": 3150.84, "text": "jetzt akzeptiert ist oder davor es nicht akzeptiert ist, jetzt halt richtige Nachteile haben und"}, {"id": 462, "start": 3150.84, "end": 3155.08, "text": "das früher oder später wahrscheinlich auch akzeptieren werden, ja für das restliche"}, {"id": 463, "start": 3155.08, "end": 3168.04, "text": "Jahr, ich habe jetzt quasi Urlaub, dann ab hier, ab hier, es sind noch nicht mal ganz"}, {"id": 464, "start": 3168.04, "end": 3175.76, "text": "zwei Wochen, also doch, es sind zwei Arbeitswochen, ab hier habe ich Urlaub, also ich habe dann"}, {"id": 465, "start": 3175.76, "end": 3186.12, "text": "1, 2, 3, Windows, wird das noch irgendjemand, das nach oben zurück geht, ich weiß nicht,"}, {"id": 466, "start": 3186.12, "end": 3190.72, "text": "Microsoft dabei gedacht hat, ja aber da hat es wirklich, also da hat es tatsächlich Corona"}, {"id": 467, "start": 3190.72, "end": 3194.52, "text": "mal was Gutes gebracht mit der ganzen Homeoffice-Geschichte, übrigens Leute, ich muss euch mal was sagen,"}, {"id": 468, "start": 3194.52, "end": 3198.64, "text": "ich muss einmal noch mal ganz kurz was zu Corona sagen, ich habe meine Meinung nämlich geändert,"}, {"id": 469, "start": 3198.64, "end": 3205.28, "text": "was Impfung und Impfpflicht angeht, ich habe mir die ganze Zeit gesagt, ihr wisst ja, ich"}, {"id": 470, "start": 3205.28, "end": 3209.64, "text": "bin ja schon lange bestimmt jetzt zwei Monate oder so, bin ich ja doppelt geimpft, hat lange"}, {"id": 471, "start": 3209.64, "end": 3213.68, "text": "noch gedauert bis es auf die Reihe gekriegt haben, ich habe mir die ganze Zeit gesagt,"}, {"id": 472, "start": 3213.68, "end": 3222.0, "text": "ich bin grundsätzlich gegen eine Impfpflicht und ich muss sagen so, ja bin ich prinzipiell"}, {"id": 473, "start": 3222.0, "end": 3227.36, "text": "auch immer noch, also ich will das eigentlich auf gar keinen Fall, aber ich habe mittlerweile"}, {"id": 474, "start": 3227.36, "end": 3236.56, "text": "so das blöde Gefühl, wir kriegen das anerweitig nicht mehr in Griff, leider werden wir wahrscheinlich"}, {"id": 475, "start": 3236.56, "end": 3243.88, "text": "auch die Leute, die das jetzt nicht wollen, nie dazu bekommen, Pflicht hin oder her, vielleicht"}, {"id": 476, "start": 3243.88, "end": 3248.92, "text": "noch ein paar, aber ich glaube, das ist einfach viel zu festgefahren schon, es wurde auch"}, {"id": 477, "start": 3248.92, "end": 3255.88, "text": "ziemlich viel verkackt, ich denke mal in diese ganze Astra-Geschichte hin und her, erst Junge,"}, {"id": 478, "start": 3255.88, "end": 3260.28, "text": "dann ältere, dann ältere gar nicht, dann wieder Junge, dann wieder nur ältere, dann diese"}, {"id": 479, "start": 3260.28, "end": 3264.88, "text": "Geschichte mit den Zettels fürs Restaurant, solltest du ausfüllen, sollte nur dafür verwendet"}, {"id": 480, "start": 3264.88, "end": 3270.28, "text": "werden, danach kam raus, ja die Polizei kriegt es auch, also man hat ziemlich viel verkackt,"}, {"id": 481, "start": 3270.28, "end": 3274.8, "text": "ja man hatte Regeln, die heute gelten, dann morgen wieder was anderes, irgendwelche willkürlich"}, {"id": 482, "start": 3274.8, "end": 3279.76, "text": "festgelegten Grenzen, wann wie, ab welchen Quadratmeteranzahlen oder sonst was in der"}, {"id": 483, "start": 3279.76, "end": 3285.6, "text": "Richtung, da hat man schon viel verkackt und ich glaube auch viel Vertrauen verspielt in"}, {"id": 484, "start": 3285.6, "end": 3294.2, "text": "der Vergangenheit und ich habe ja schon oft gesagt, dass du so keinen überzeugst und das"}, {"id": 485, "start": 3294.2, "end": 3300.44, "text": "Problem ist halt einfach, dass es mittlerweile so festgefahren ist bei vielen Leuten, dass"}, {"id": 486, "start": 3300.44, "end": 3305.12, "text": "ich glaube, dass auch eine Pflicht in der Art und Weise, wie man sie jetzt andenkt,"}, {"id": 487, "start": 3305.12, "end": 3312.52, "text": "nichts bringt, weil die Leute sich, die sind so festgefahren, die lassen sich nicht impfen"}, {"id": 488, "start": 3312.52, "end": 3319.44, "text": "und es gibt ja mehrere Stufen, aber die extremste Stufe ist, du lässt dich nicht impfen, die"}, {"id": 489, "start": 3319.44, "end": 3325.04, "text": "Polizei holt dich daheim ab, das kann natürlich keiner wollen und das wäre auch rechtlich"}, {"id": 490, "start": 3325.04, "end": 3332.36, "text": "ja glaube ich nicht denkbar und so, aber ich habe echt so meine Bedenken, dass das halt"}, {"id": 491, "start": 3332.36, "end": 3342.36, "text": "nichts wird, das ist echt eine schwierige Sache, ich bin da grundsätzlich komplett"}, {"id": 492, "start": 3342.36, "end": 3344.04, "text": "gegen Pflichten, was sowas angeht."}, {"id": 493, "start": 3344.04, "end": 3351.2, "text": "Gut, wenn du die unter 12 Meter beinimmst oder rausrechnen, sind wir schon glaube ich"}, {"id": 494, "start": 3351.2, "end": 3352.2, "text": "deutlich weiter."}, {"id": 495, "start": 3352.2, "end": 3359.6, "text": "Ja, ja das hast du ja auch hier geschrieben, naja aber ich habe da meine Meinung zu ein"}, {"id": 496, "start": 3359.6, "end": 3361.52, "text": "bisschen geändert, aber ich finde es immer noch nicht gut."}, {"id": 497, "start": 3361.52, "end": 3366.44, "text": "Na egal, so, muss ich jetzt mal sagen."}, {"id": 498, "start": 3366.44, "end": 3371.56, "text": "Ich habe ja kein Bock jetzt noch mehr zu dem Thema zu sagen, weil das kriegt man schon"}, {"id": 499, "start": 3371.56, "end": 3372.56, "text": "überall genug."}, {"id": 500, "start": 3372.56, "end": 3379.44, "text": "Was ich übrigens auch sehr merkwürdig finde ist, es gibt ja auf YouTube, wenn du auf YouTube"}, {"id": 501, "start": 3379.44, "end": 3385.4, "text": "gehst, du kriegst jetzt hier mittlerweile diese Corona-Leiste, die immer am Start ist,"}, {"id": 502, "start": 3385.4, "end": 3391.56, "text": "hier diese News-Corona-Seite und meistens, wahrscheinlich ist es jetzt nicht so, wenn"}, {"id": 503, "start": 3391.56, "end": 3397.72, "text": "ich draufklicke, das meiste, wenn du das anklickst, hat Kommentare deaktiviert, na guck"}, {"id": 504, "start": 3397.72, "end": 3402.48, "text": "die hier jetzt natürlich nicht, aber ganz viele Sachen, wenn du hier draufklicke, haben"}, {"id": 505, "start": 3402.48, "end": 3403.72, "text": "Kommentare deaktiviert."}, {"id": 506, "start": 3403.72, "end": 3409.6, "text": "Ich weiß nicht warum, will man sich Moderation sparen oder was ist da los?"}, {"id": 507, "start": 3409.6, "end": 3414.96, "text": "Denn nicht nur die Welt, Tagesschau auch und sowas."}, {"id": 508, "start": 3414.96, "end": 3436.64, "text": "Largest Yu-Gi-Oh! Deck of all time, na dann, guck die Likes, Dislikes, ja, ich glaube,"}, {"id": 509, "start": 3436.64, "end": 3442.6, "text": "das kann man so pauschal wie vieles nicht sagen, ich glaube, da nehmen sich alle Seiten nicht"}, {"id": 510, "start": 3442.6, "end": 3449.68, "text": "sonderlich viel, hey, das wäre cool, den würde ich, also ich hoffe ja, der macht wieder"}, {"id": 511, "start": 3449.68, "end": 3454.04, "text": "demnächst mal Vorträge, weil die fand ich alle gut, vom Xerox bis zum Spiegel bis zur"}, {"id": 512, "start": 3454.04, "end": 3455.44, "text": "Bahn, die waren eigentlich immer super."}, {"id": 513, "start": 3455.44, "end": 3470.2, "text": "In den Kommentaren tummelt sich alles, was sich gegenseitig aufschauen und haten will,"}, {"id": 514, "start": 3470.2, "end": 3475.96, "text": "aber die Vorträge waren wirklich alle top, wie gesagt, ich glaube gar nicht, dass sich"}, {"id": 515, "start": 3475.96, "end": 3476.96, "text": "das da so viel nimmt."}, {"id": 516, "start": 3476.96, "end": 3486.68, "text": "Ja, das wäre cool, wenn da mal wieder ein Vortrag über irgendwas hält, halt da braucht"}, {"id": 517, "start": 3486.68, "end": 3491.96, "text": "natürlich auch erstmal irgendwas, das ist, es ist alles, es ist wirklich, du hast mittlerweile"}, {"id": 518, "start": 3491.96, "end": 3498.56, "text": "fast nur noch Extreme überall, Leute, die sich mal 5 Minuten Gedanken machen, gibts"}, {"id": 519, "start": 3498.56, "end": 3505.16, "text": "quasi so gut wie nicht mehr, ist genauso, ist genauso, wie wenn es irgendwie um gendern"}, {"id": 520, "start": 3505.16, "end": 3510.64, "text": "oder sonst was geht, ich persönlich halte ja die Diskussion um dieses Thema vollkommen"}, {"id": 521, "start": 3510.64, "end": 3516.96, "text": "übertrieben und vollkommen unsinnig, es soll jeder machen, wie er will, die Diskussion"}, {"id": 522, "start": 3516.96, "end": 3523.48, "text": "darüber ist einfach nur komplette, komplette heiße Luft, weil es ein Thema ist, was simpel"}, {"id": 523, "start": 3523.48, "end": 3529.92, "text": "ist, weil es für jeden in irgendeiner Art und Weise greifbar ist und weil es, weil jeder"}, {"id": 524, "start": 3529.92, "end": 3536.2, "text": "irgendwie da eine Meinung zu hat, aber ich glaube die Diskussion darüber ist einfach"}, {"id": 525, "start": 3536.2, "end": 3544.36, "text": "komplett verschwendet, komplett verschwendete Lebenszeit, das ist, das ist so Scheindebatte"}, {"id": 526, "start": 3544.36, "end": 3549.2, "text": "irgendwie, niemand gehts irgendwie dadurch besser, wenn da die ganze Welt darüber diskutiert."}, {"id": 527, "start": 3549.2, "end": 3557.56, "text": "Ich, ich halte das ganze, also ich halte die, ich halte das gendern doch relativ, also ich"}, {"id": 528, "start": 3557.56, "end": 3562.08, "text": "benutze das nicht regelmäßig, aber ich halte das im Ansatz sehr relativ pragmatisch, ich"}, {"id": 529, "start": 3562.08, "end": 3567.64, "text": "verwende das, wenn es sinnvoll ist, zum Beispiel, wenn auf Twitter das Zeichenlimit erreicht"}, {"id": 530, "start": 3567.64, "end": 3573.48, "text": "ist, wenn das Zeichenlimit erreicht ist, dann schreibe ich dann auch mal, was weiß ich,"}, {"id": 531, "start": 3573.48, "end": 3584.52, "text": "ManagerInnen oder sowas, was soll am Ende rauskommen, wie immer, egal was gemacht wird,"}, {"id": 532, "start": 3584.52, "end": 3590.24, "text": "eigentlich kommt nix dabei raus, das ist ja die Sache, es gibt sehr viele sinnlose Diskussionen"}, {"id": 533, "start": 3590.24, "end": 3594.28, "text": "um total unwichtige Sachen und ich finde das gendern ist eine ziemlich unwichtige Sache."}, {"id": 534, "start": 3594.28, "end": 3606.6, "text": "Ja, das wird darauf rauslaufen, ja, also man könnte mit deutliche wichtigere Sachen diskutieren,"}, {"id": 535, "start": 3606.6, "end": 3610.28, "text": "soll jeder machen wie er will, solange mich keiner oder irgendjemand anfängt die anderen"}, {"id": 536, "start": 3610.28, "end": 3611.52, "text": "Leute bekehren zu wollen."}, {"id": 537, "start": 3611.52, "end": 3626.08, "text": "Hä, ja, aber Leute, wie gesagt, ich betrachte die Diskussion darüber schon komplett eigentlich"}, {"id": 538, "start": 3626.08, "end": 3630.24, "text": "als verlorene Zeit irgendwie, komplett überflüssig."}, {"id": 539, "start": 3630.24, "end": 3636.52, "text": "Ja, man könnte sich zum Beispiel mal überlegen, wie man das klimatechnisch hinkriegen will,"}, {"id": 540, "start": 3636.52, "end": 3641.96, "text": "aber das wäre mal was, was, und zwar nicht nur hier, sondern allgemein, wäre eine schöne"}, {"id": 541, "start": 3641.96, "end": 3642.96, "text": "Geschichte."}, {"id": 542, "start": 3642.96, "end": 3647.4, "text": "Ja, es wäre eine schöne Geschichte, dass es nicht mehr so viel Mord und Tod in der Welt"}, {"id": 543, "start": 3647.4, "end": 3648.4, "text": "gibt."}, {"id": 544, "start": 3648.4, "end": 3652.88, "text": "Es gibt viele Themen, die ich tatsächlich für sehr wichtig halte, aber gendern ist"}, {"id": 545, "start": 3652.88, "end": 3669.04, "text": "keine davon."}, {"id": 546, "start": 3669.04, "end": 3670.04, "text": "Wie war das auf?"}, {"id": 547, "start": 3670.04, "end": 3671.04, "text": "Was?"}, {"id": 548, "start": 3671.04, "end": 3672.04, "text": "Tja, immerhin."}, {"id": 549, "start": 3672.04, "end": 3679.04, "text": "Wie gesagt, was man jetzt im Chat, was man jetzt schon schön daran sieht, jeder hat"}, {"id": 550, "start": 3679.04, "end": 3684.88, "text": "eine Meinung dazu, und jeder ist dabei, es ist richtig, und jeder ist ganz scharf darauf,"}, {"id": 551, "start": 3684.88, "end": 3686.56, "text": "über dieses Thema zu diskutieren."}, {"id": 552, "start": 3686.56, "end": 3690.68, "text": "Das ist so, das ist ein Thema, da wird so viel heiße Luft daran verschwenden und sich dran"}, {"id": 553, "start": 3690.68, "end": 3693.72, "text": "hochgezogen, aber im Endeffekt kommt da nichts bei raus."}, {"id": 554, "start": 3693.72, "end": 3698.92, "text": "Wenn das was Sinnvolles ist, wird sich das mit der Zeit durchsetzen, und wenn nicht,"}, {"id": 555, "start": 3698.92, "end": 3699.92, "text": "dann nicht."}, {"id": 556, "start": 3699.92, "end": 3703.8, "text": "Das sind wir, vielleicht in fünf oder zehn Jahren sind wir schlauer."}, {"id": 557, "start": 3703.8, "end": 3711.68, "text": "So, wir gucken uns jetzt mal ein paar Server-Racks an von Leuten, wo ich ein bisschen zu ablösen"}, {"id": 558, "start": 3711.68, "end": 3715.08, "text": "kann, warum die so viel Zeug haben, was so viel Strom verbraucht, nichts bringt."}, {"id": 559, "start": 3715.08, "end": 3720.64, "text": "Ach so, wir wollten noch die C-Sharp-Geschichte gucken."}, {"id": 560, "start": 3720.64, "end": 3729.44, "text": "Äh, ups, was habe ich jetzt hier angeklickt, das wollte ich hier anklicken."}, {"id": 561, "start": 3729.44, "end": 3735.68, "text": "Habe ich da angeklickt."}, {"id": 562, "start": 3735.68, "end": 3756.44, "text": "Microsoft Teams seems to have enough, ja gut, was da abgeht ist, also ich meine das nicht"}, {"id": 563, "start": 3756.44, "end": 3764.04, "text": "bei Microsoft generell, sie übertreiben es an allen Fronten, ich sage nur, VLC und der"}, {"id": 564, "start": 3764.04, "end": 3774.28, "text": "Christmas Head, also VLC hat ja an Weihnachten immer ein Hütchen, ein Weihnachtsmannhütchen"}, {"id": 565, "start": 3774.28, "end": 3775.28, "text": "auf."}, {"id": 566, "start": 3775.28, "end": 3778.92, "text": "Und Visual Studio Code hatte das auch und sowas, meine Güte."}, {"id": 567, "start": 3778.92, "end": 3798.6, "text": "Wow, okay, was, was, was, Alter, was hat Microsoft, was hat Microsoft gesagt, dass man ke..."}, {"id": 568, "start": 3798.6, "end": 3799.6, "text": "Ist das jetzt richtig?"}, {"id": 569, "start": 3799.6, "end": 3804.52, "text": "Ich glaube, das ist procken."}, {"id": 570, "start": 3804.52, "end": 3812.0, "text": "Ah, jetzt, okay, okay, was, was, was haben sie denn gesagt, wo musstest du denn kecken"}, {"id": 571, "start": 3812.0, "end": 3813.0, "text": "bei?"}, {"id": 572, "start": 3813.0, "end": 3829.6, "text": "Ja, ganz bestimmt, ganz bestimmt, das Jahr des Linux-Desktops, ja natürlich."}, {"id": 573, "start": 3829.6, "end": 3844.68, "text": "Ja, das stimmt tatsächlich, das Jahr des Linux-Desktops, könnte man jetzt so echt,"}, {"id": 574, "start": 3844.68, "end": 3851.76, "text": "man könnte es wirklich sagen, das Jahr des Linux-Desktops ist jetzt, wo es ein ordentliches"}, {"id": 575, "start": 3851.76, "end": 3859.84, "text": "WSL und WSLG heißt das, glaube ich, gibt, also für die grafischen Sachen tatsächlich,"}, {"id": 576, "start": 3859.84, "end": 3863.44, "text": "tatsächlich könnte der gute Linux-Support unter Windows wirklich dafür sorgen, dass"}, {"id": 577, "start": 3863.44, "end": 3867.2, "text": "es so eine Art Jahr des Linux-Desktops wird, ja, da hat er nicht unrecht."}, {"id": 578, "start": 3867.2, "end": 3879.16, "text": "Was, sie haben eine neue Policy, was, ey, das können die machen, wie sie wollen, auch"}, {"id": 579, "start": 3879.16, "end": 3884.52, "text": "wenn es teilweise ziemlich merkwürdige Ausmaße annimmt."}, {"id": 580, "start": 3884.52, "end": 3898.52, "text": "Was, seg, das habe ich übrigens, das haben wir doch letztens schon in einer Präsentation"}, {"id": 581, "start": 3898.52, "end": 3904.92, "text": "gesehen, das machen die, das machen die aus zwei, das machen die aus zwei Gründen, das"}, {"id": 582, "start": 3904.92, "end": 3911.28, "text": "ist nicht so sehr gendern, das ist, die beschreiben, wie sie aussehen, falls Leute Sehbehinderung"}, {"id": 583, "start": 3911.28, "end": 3912.28, "text": "haben."}, {"id": 584, "start": 3912.28, "end": 3921.36, "text": "Das finde ich gar nicht schlecht, gut, ich meine, ob es jetzt die ganze Welt wissen muss,"}, {"id": 585, "start": 3921.36, "end": 3926.8, "text": "ob es jetzt ein She oder ein Her oder ein sonst wie ist, kann man sicherlich darüber"}, {"id": 586, "start": 3926.8, "end": 3931.92, "text": "diskutieren, aber das Erwähnen, wie Leute aussehen, für blinde finde ich schon mal"}, {"id": 587, "start": 3931.92, "end": 3932.92, "text": "nicht verkehrt."}, {"id": 588, "start": 3932.92, "end": 3962.64, "text": "Ein Caucasian Man, naja, gut, warum nicht, ah, das ist ja so, die haben einen, die haben"}, {"id": 589, "start": 3962.64, "end": 3964.48, "text": "ein Kultur da mittlerweile."}, {"id": 590, "start": 3964.48, "end": 3972.68, "text": "Man könnte schon sagen, jetzt ist es ein bisschen übertrieben, aber die Beschreibung für Leute"}, {"id": 591, "start": 3972.68, "end": 3974.84, "text": "mit Sehbehinderung finde ich ganz gut."}, {"id": 592, "start": 3974.84, "end": 3984.56, "text": "Greta, danke für den Sub, nice Video zu den Sahnexperten, mein Kollege erzählen auch"}, {"id": 593, "start": 3984.56, "end": 3990.16, "text": "immer von einem, der von seinem Urlaub noch schnell was, ja, ja, solche Dinge hatten wir"}, {"id": 594, "start": 3990.16, "end": 3991.16, "text": "auch schon öfters."}, {"id": 595, "start": 3991.16, "end": 4009.52, "text": "Ja, die Kontroverse, klar, habe ich die mitbekommen, mittlerweile wurde die Sache wieder reingepatcht."}, {"id": 596, "start": 4009.52, "end": 4019.64, "text": "Ich muss jetzt mal noch mal so ganz allgemein was sagen, weil die Fronten zwischen dafür"}, {"id": 597, "start": 4019.64, "end": 4026.28, "text": "und dagegen sind bei nahezu jedem Thema, egal was es ist, ja, von Gendern bis irgendwie"}, {"id": 598, "start": 4026.28, "end": 4032.96, "text": "Flüchtlingsthema, es ist egal, welches Thema du nimmst, ja, die Fronten sind mittlerweile,"}, {"id": 599, "start": 4032.96, "end": 4037.96, "text": "meinem Eindruck nach, bei allen diesen Themen quasi verhärteter als sie das jemals waren,"}, {"id": 600, "start": 4037.96, "end": 4042.08, "text": "also sprich, du hast ganz wenige Leute noch, die möglich fünf Minuten in sich gehen und"}, {"id": 601, "start": 4042.08, "end": 4046.04, "text": "sich darüber Gedanken machen, was eigentlich Sache ist, du hast entweder Leute, die strikt"}, {"id": 602, "start": 4046.04, "end": 4050.84, "text": "gegen irgendwas sind, du hast auch viele Leute, die strikt für, ohne, dass weiter zu dem"}, {"id": 603, "start": 4050.84, "end": 4059.72, "text": "Thema, für irgendwas sind, es ist nun mal so, dass fast nichts schwarz oder weiß ist"}, {"id": 604, "start": 4059.72, "end": 4067.48, "text": "oder fast nichts null oder 100% ist, ja, überlegt euch mal, wenn ihr aus dem Flugzeug springt,"}, {"id": 605, "start": 4067.48, "end": 4074.88, "text": "ohne Fallschirm, die Chance, dass ihr sterbt, ist nicht 100%, die ist wahrscheinlich ziemlich"}, {"id": 606, "start": 4074.88, "end": 4081.76, "text": "in der Nähe von 100%, aber die ist nicht 100%, also es gibt, also auch die Chance, dass"}, {"id": 607, "start": 4081.76, "end": 4087.24, "text": "die Erde eine Scheibe ist, würde ich sagen, oder umgedreht, dass die Erde keine Scheibe"}, {"id": 608, "start": 4087.24, "end": 4098.0, "text": "ist, die ist auch ziemlich hoch, aber, also es gibt kaum was, was 100% ist oder 0% und"}, {"id": 609, "start": 4098.0, "end": 4104.08, "text": "aus diesem Gesichtspunkt würde ich sagen, man sollte mal versuchen, auch wenn es einem"}, {"id": 610, "start": 4104.08, "end": 4114.64, "text": "schwer fällt, sich ab und zu mal zumindest ein paar Stimmen von der Gegenseite anzuhören,"}, {"id": 611, "start": 4114.64, "end": 4119.8, "text": "ob da nicht vielleicht auch was Sinnvolles dabei ist, weil wie gesagt, es ist eigentlich"}, {"id": 612, "start": 4119.8, "end": 4127.28, "text": "fast nie alles 100% falsch oder irgendwie, ich war unhinterfragt, alles immer, was einer"}, {"id": 613, "start": 4127.28, "end": 4136.64, "text": "sagt, 100% nicht richtig und selbst das ist nicht 100% sicher, das ist ziemlich sicher,"}, {"id": 614, "start": 4136.64, "end": 4141.36, "text": "gut C++ ist zu 100% Müll, ja das stimmt, das ist einer der wenigen Sachen, die zu 100%"}, {"id": 615, "start": 4141.36, "end": 4152.96, "text": "100% sind, das ist, ja, aber das wäre tatsächlich nicht schlecht, wenn die Leute ein bisschen"}, {"id": 616, "start": 4152.96, "end": 4160.24, "text": "mehr miteinander reden würden, anstatt sich abzuhaten, weil die ganzen Hater und ich spiele"}, {"id": 617, "start": 4160.24, "end": 4167.68, "text": "jetzt auf niemanden speziellen an, ich muss das vielleicht anders ausdrücken, weil die"}, {"id": 618, "start": 4167.68, "end": 4171.56, "text": "Leute leben eigentlich bloß noch davon, das siehst du ganz besonders auf Twitter, also"}, {"id": 619, "start": 4171.56, "end": 4176.24, "text": "ein Großteil ihres Lebensinhalts bei so extremen Leuten ist der Hass eben auf die anderen"}, {"id": 620, "start": 4176.24, "end": 4182.24, "text": "Leute, die suchen den ganzen Tag nur danach, nach Sachen, die sie hassen können und es"}, {"id": 621, "start": 4182.24, "end": 4191.0, "text": "egal, welche Seite du nimmst, da nimmt sich kaum einer was, dabei muss man auch mal sehen,"}, {"id": 622, "start": 4191.0, "end": 4196.96, "text": "dass die, ich will sie jetzt nicht Hater nennen, weil das Wort ist zu vorbelastet, sagen wir"}, {"id": 623, "start": 4196.96, "end": 4202.32, "text": "so die Extremisten auf beiden Seiten, denn ist glaube ich gar nicht klar, dass sie sich"}, {"id": 624, "start": 4202.32, "end": 4209.6, "text": "in vielen Bereichen tatsächlich ähnlicher sind, als sie eigentlich wahr haben wollen,"}, {"id": 625, "start": 4209.6, "end": 4216.92, "text": "ja vielleicht in ihrem Kernthema nicht, aber die Bereitschaft ihre Überzeugung mit Gewalt"}, {"id": 626, "start": 4216.92, "end": 4223.04, "text": "durchzusetzen ist bei allen Seiten da und was ihr auch bei allen Leuten, bei allen Extremisten"}, {"id": 627, "start": 4223.04, "end": 4227.36, "text": "sehen werdet ist, es gibt einen gemeinsamen Feind, den können die überhaupt nicht ab"}, {"id": 628, "start": 4227.36, "end": 4235.32, "text": "und das ist die Polizei, es ist egal, ob du jetzt irgendwelche Nazis nimmst oder ob du"}, {"id": 629, "start": 4235.32, "end": 4243.24, "text": "irgendwelche, was hast du da im Gegenzug, irgendwelche Klimagipfel sonst wie Demonstranten"}, {"id": 630, "start": 4243.24, "end": 4247.72, "text": "nimmst, es ist vollkommen egal und die Randale machen und Autos anzünden, es ist vollkommen"}, {"id": 631, "start": 4247.72, "end": 4253.36, "text": "egal, beide mögen nicht die Polizei, warum mögen die nicht die Polizei, weil die Polizei"}, {"id": 632, "start": 4253.36, "end": 4259.28, "text": "bei Extremen die einzige quasi, ich würde sagen so Kraft ist, die zwischen ihnen und"}, {"id": 633, "start": 4259.28, "end": 4268.36, "text": "ihrer Zerstörungswut steht, deswegen mögen die alle nicht die Polizei, ja und die sind"}, {"id": 634, "start": 4268.36, "end": 4276.4, "text": "sich in vielen Bereichen ähnlicher als ihnen das glaube ich klar ist, too late, wieso ist"}, {"id": 635, "start": 4276.4, "end": 4292.76, "text": "es 21 Uhr, ja das haben wir ja letztens, das ist übrigens das geilste E-Vote aller Zeile,"}, {"id": 636, "start": 4292.76, "end": 4296.08, "text": "gibt es zwar eine DB Lampe noch, ja die Lampe gibt es doch, aber die verwende ich nicht"}, {"id": 637, "start": 4296.08, "end": 4312.4, "text": "mehr, so, ja das ist das gleiche wie bei irgendwelchen Flacherdleuten, ach Gott das ist ja auch, hey"}, {"id": 638, "start": 4312.4, "end": 4319.68, "text": "und selbst da höre ich es mir teilweise an einfach aus Belustigung, die Amis sind da"}, {"id": 639, "start": 4319.68, "end": 4327.64, "text": "aber lustigerweise eh sehr aufgeschlossen dafür, ich weiß gar nicht woran das liegt,"}, {"id": 640, "start": 4327.64, "end": 4339.88, "text": "vielleicht weil es da auch so viele Kreationisten gibt oder so, wer ist denn der dritte Weg,"}, {"id": 641, "start": 4339.88, "end": 4345.4, "text": "sind das irgendwelche Rechte, sagt mir nichts, aber dann fliegen die Fetzen wenn die beide"}, {"id": 642, "start": 4345.4, "end": 4350.88, "text": "aufmarschieren, keine Ahnung, ich kenne mich mit solchen Organisationen nicht wirklich"}, {"id": 643, "start": 4350.88, "end": 4359.56, "text": "gut aus, was, ah ok, sagt mir nichts, aber ihr könnt euch sicher sein, einem sind die"}, {"id": 644, "start": 4359.56, "end": 4367.0, "text": "sich einig, alle beide, die Polizei mögen sie nicht, ich könnte mir sogar vorstellen"}, {"id": 645, "start": 4367.0, "end": 4372.24, "text": "dass tatsächlich sowohl Linksextreme als auch Rechtsextreme die könnten super abends"}, {"id": 646, "start": 4372.24, "end": 4376.4, "text": "zusammen sich besaufen gehen, solange es hier nicht um ihr Kernthema geht, wären die sich"}, {"id": 647, "start": 4376.4, "end": 4381.48, "text": "in vielen Bereichen glaube ich direkt einig, so nach dem Motto wir trinken jetzt da drauf"}, {"id": 648, "start": 4381.48, "end": 4385.88, "text": "hier so alle Bullen, ihr wisst ja was da immer so kommt, da wären die sich einig, die würden"}, {"id": 649, "start": 4385.88, "end": 4390.4, "text": "sich super verstehen, es darf halt bloß nicht um ihr Kernthema gehen, da würden sie sich"}, {"id": 650, "start": 4390.4, "end": 4416.0, "text": "wahrscheinlich nicht verstehen, das hört mich alles nicht wundern, ja Verschwörungstheorien,"}, {"id": 651, "start": 4416.0, "end": 4423.52, "text": "das ist ja normal, dass Verschwörungstheorien gerade bei etwas geistig eingeschränkten"}, {"id": 652, "start": 4423.52, "end": 4449.36, "text": "sollten nicht, also recht hoch im Kurs stehen, ja, na gut, so wir gucken uns jetzt, wir gucken"}, {"id": 653, "start": 4449.36, "end": 4454.4, "text": "uns jetzt die.NET Release Notes an, aus genug mit aktueller Thematik beschäftigt, zeig mal"}, {"id": 654, "start": 4454.4, "end": 4458.12, "text": "her, gibt es da irgendwas spannendes, was wir noch nicht gesehen haben, Massive Gains"}, {"id": 655, "start": 4458.12, "end": 4471.76, "text": "in Performance gibt es, zeig mal her, Massive Performance Improvements, zeig her, guck mal,"}, {"id": 656, "start": 4471.76, "end": 4480.28, "text": "der JIT ist am Start, nicht Shit Git, nein, der Just in Time Compiler, die sind aber wirklich,"}, {"id": 657, "start": 4480.28, "end": 4484.68, "text": "das muss man Microsoft tatsächlich, das muss man denen wirklich mal lassen, also die haben"}, {"id": 658, "start": 4484.68, "end": 4490.76, "text": "die letzten Jahre über wirklich viel gemacht, was Optimierung und Performance angeht, also"}, {"id": 659, "start": 4490.76, "end": 4495.08, "text": ".NET, also ich will jetzt nicht sagen, dass das auf einem Niveau ist wie mit C Rust und"}, {"id": 660, "start": 4495.08, "end": 4504.04, "text": "vielleicht, naja, ich muss es leider sagen, C++, das nicht, aber in den, wenn man sich"}, {"id": 661, "start": 4504.04, "end": 4511.0, "text": "nicht so in Randbereichen bewegt, wenn man jetzt nicht quasi pro Schleifendurchlauf 50.000"}, {"id": 662, "start": 4511.0, "end": 4516.64, "text": "Objekte anlegt, dass der Garbage Collector Probleme macht oder sonst was, ist die Performance"}, {"id": 663, "start": 4516.64, "end": 4523.2, "text": "da gar nicht mehr so großartig unterschiedlich, also C Sharp Sachen und Java muss man auch"}, {"id": 664, "start": 4523.2, "end": 4529.16, "text": "sagen, ja, also es ist ja nicht nur C Sharp, das ist gar nicht mehr wirklich bedeutend"}, {"id": 665, "start": 4529.16, "end": 4533.4, "text": "langsamer als C oder C++, wie gesagt, wenn man jetzt hier nicht von den Extremfällen"}, {"id": 666, "start": 4533.4, "end": 4540.2, "text": "ausgeht, du wirst natürlich immer Performance-kritische Sachen finden, die du in so unmanaged Sprachen"}, {"id": 667, "start": 4540.2, "end": 4544.6, "text": "wie C deutlich performanter und schneller hinkriegst, genauso umgedreht wirst du auch"}, {"id": 668, "start": 4544.6, "end": 4549.48, "text": "immer was finden, was du mit Hand Optimated Sampler immer noch schneller als C hinkriegst,"}, {"id": 669, "start": 4549.48, "end": 4556.12, "text": "ja, sowas gibt es immer, aber wenn man mal von dem Großteil der Fälle ausgeht, dann"}, {"id": 670, "start": 4556.12, "end": 4563.32, "text": "ist es mit C Sharp und Java performanstechnisch ziemlich nah dran und was man nicht vergessen"}, {"id": 671, "start": 4563.32, "end": 4570.16, "text": "darf, wisst ihr was performanstechnisch auch gar nicht so weit weg ist, Javascript, natürlich"}, {"id": 672, "start": 4570.16, "end": 4577.4, "text": "in der ganze Ecke langsamer immer noch, aber ihr Kobold, aber Javascript, Javascript ist"}, {"id": 673, "start": 4577.4, "end": 4589.6, "text": "auch mittlerweile unglaublich optimiert, glaubt man gar nicht, aber mit V8 hat es angefangen"}, {"id": 674, "start": 4589.6, "end": 4595.2, "text": "und mittlerweile ist V8 so optimiert, dass es wirklich schnell ist, ok, also zeig mal,"}, {"id": 675, "start": 4595.2, "end": 4601.52, "text": "haben wir irgendwelche Benchmarks oder so, Benchmark, übrigens richtig coole Library,"}, {"id": 676, "start": 4601.52, "end": 4605.4, "text": "welche ich noch nicht verwendet habe, richtig poggers, habe ich sogar mal auf der Arbeit"}, {"id": 677, "start": 4605.4, "end": 4612.28, "text": "verwendet, für was komplett unrelated ist, also weder irgendwie.NET wirklich Performance"}, {"id": 678, "start": 4612.28, "end": 4618.56, "text": "messen, wir wollten gucken, wie schnell man Dateien lesen und schreiben kann über NFS"}, {"id": 679, "start": 4618.56, "end": 4623.88, "text": "auf Azure Files und da habe ich ein.NET Programm gebastelt, was das machen, habe ich mir gedacht,"}, {"id": 680, "start": 4623.88, "end": 4626.92, "text": "hey, warum schreibst du nicht einfach Benchmark an die Methode obendrauf und kriegst dann"}, {"id": 681, "start": 4626.92, "end": 4635.76, "text": "ziemlich gute Messung, das hat echt gut funktioniert, ich finde das ist eine poggers Library, richtig"}, {"id": 682, "start": 4635.76, "end": 4641.0, "text": "nice, so also, Performance, Performance, Performance, ja ist ja gut hier, jetzt übertreibst"}, {"id": 683, "start": 4641.0, "end": 4646.12, "text": "man nicht, Performance, ich brauche irgendwelche Crafts, ich bin jetzt, ich mach jetzt mal wie"}, {"id": 684, "start": 4646.12, "end": 4653.36, "text": "irgendwelche Vorstandsmanager, ich brauche ein Tortendiagramm oder sowas, ok, was ist"}, {"id": 685, "start": 4653.36, "end": 4662.8, "text": "schneller, running this.NET vs..NET 6, changed, ah, utf8 formatter, try format, value buffer,"}, {"id": 686, "start": 4662.8, "end": 4670.64, "text": "ok, das ist irgendeine low level Geschichte, was macht das, standard format D2, ich weiß"}, {"id": 687, "start": 4670.64, "end": 4679.72, "text": "nicht mal, was das überhaupt macht, formatiert das, formatiert das irgendwie Binary als String"}, {"id": 688, "start": 4679.72, "end": 4692.64, "text": "oder so, was macht das überhaupt, keine Ahnung, zumindest ist es jetzt schneller in.NET 6"}, {"id": 689, "start": 4692.64, "end": 4699.8, "text": "und sogar ziemlich, ziemlich gut hier, 20% schneller, ah, exzellent, jetzt können wir"}, {"id": 690, "start": 4699.8, "end": 4709.56, "text": "uns auch die Optimierung in Assembler angucken, alles klar, das brauche ich jetzt, ähm, find,"}, {"id": 691, "start": 4709.56, "end": 4721.4, "text": "find ist jetzt auch schneller, mit.NET 6, huge optimized, alles klar, tuppelstells compare"}, {"id": 692, "start": 4721.4, "end": 4735.56, "text": "ist viel, viel schneller, ja ex obvious, obvious, obvious, here's what's going on in.NET 5,"}, {"id": 693, "start": 4735.56, "end": 4751.52, "text": "alles klar, cringe, wer es nicht versteht, ich meine zwar, ich meine zwar offensichtlich,"}, {"id": 694, "start": 4751.52, "end": 4755.96, "text": "dass das langsamer ist oder, ja chat, sehe ich auch so offensichtlich, dass das langsamer"}, {"id": 695, "start": 4755.96, "end": 4766.88, "text": "ist, also das sehe ich sofort, ok, kommt da noch irgendwas, wo ich jetzt auch ein bisschen"}, {"id": 696, "start": 4766.88, "end": 4775.48, "text": "was mit anfangen kann, echt so, ja echt so, ah, enums, boah der will es aber echt wissen,"}, {"id": 697, "start": 4775.48, "end": 4782.24, "text": "der Dude hier, wie lange ist denn das, alter, ist ja mal gut, ich brauche Grafen, ich brauche"}, {"id": 698, "start": 4782.24, "end": 4789.24, "text": "Grafen, das ist ein Graf, nee, hashing, ja ok, ok, wir gucken uns das mal weiter an,"}, {"id": 699, "start": 4789.24, "end": 4795.84, "text": "das gucken wir uns jetzt nicht alles an, was hat denn der Sarix für eine Frage, hat er"}, {"id": 700, "start": 4795.84, "end": 4808.68, "text": "doch gar nicht, oder, einfach nur, jubadet wieder, jubadet vom Chat, warum ist das langsamer,"}, {"id": 701, "start": 4808.68, "end": 4812.44, "text": "ich sage cringe, wer es nicht weiß, das ist so obvious, das werde ich hier bestimmt nicht"}, {"id": 702, "start": 4812.44, "end": 4819.04, "text": "erzählen, also das ist wirklich ein Deep Dive gewesen, die wollten es wissen, ok, was haben"}, {"id": 703, "start": 4819.04, "end": 4827.0, "text": "wir sonst noch schöne Sachen,.NET Monitor, OpenTelemetry, WebAssembly, HTTP 3, JSON Processing,"}, {"id": 704, "start": 4827.0, "end": 4844.72, "text": "Mathematics,.NET 6 Highlights, Production Stress Tested, ja Bing läuft glaube ich schon"}, {"id": 705, "start": 4844.72, "end": 4857.56, "text": "unter.NET 6, ich weiß gar nicht, ob das hier drinsteht, also Bing läuft glaube ich mit.NET,"}, {"id": 706, "start": 4857.56, "end": 4861.24, "text": "ich weiß jetzt nicht, ob das so ein großes Aushängelschild ist, aber Bing, ja, das ist"}, {"id": 707, "start": 4861.24, "end": 4868.84, "text": "halt Bing, ja, so, 3 Jahre Supported Unified Platform, ja außer Linux, außer Linux, also"}, {"id": 708, "start": 4868.84, "end": 4875.12, "text": "falls Sie auf Maui raus wollen, Performance, Greatly Improved, das hatten wir doch gerade"}, {"id": 709, "start": 4875.12, "end": 4888.52, "text": "schon, C-Shop 10 Language Features haben wir uns angeguckt, Visual Basic, dazu fällt mir"}, {"id": 710, "start": 4888.52, "end": 4900.04, "text": "bloß ein, ja, Visual Basic, ach guck mal, Hot Reload, das was ich erst rauskicken wollte,"}, {"id": 711, "start": 4900.04, "end": 4906.76, "text": "das was ich erst rauskicken wollte steht jetzt da drin, JSON APs, das haben wir auch ausprobiert,"}, {"id": 712, "start": 4906.76, "end": 4919.96, "text": "das ist wirklich besser, Peile aus, Single File Apps, Extraction Free, ah, das ist gut,"}, {"id": 713, "start": 4919.96, "end": 4929.48, "text": "das ist gut, ja, das wäre cool, wenn das noch weiter verbessert wird, dass die ausführbaren"}, {"id": 714, "start": 4929.48, "end": 4934.0, "text": "Dateien die rauskommen kleiner sind, ich mein wenn man mal so eine Go Anwendung vergleicht"}, {"id": 715, "start": 4934.0, "end": 4938.56, "text": "mit einer.NET Anwendung, das ist halt schon ein riesen Unterschied, wenn du eine Go Anwendung"}, {"id": 716, "start": 4938.56, "end": 4944.4, "text": "anguckst, die ist dann am Ende irgendwie 3 oder 4 MB, was schon immer verdammt viel ist"}, {"id": 717, "start": 4944.4, "end": 4953.12, "text": "versus irgendwie, ich glaub dann Hallo Welt, Go ist irgendwie 2,5 MB oder so, Static, aber"}, {"id": 718, "start": 4953.12, "end": 4959.76, "text": "zumindest ist es halt im Vergleich zu irgendeinem C Programm, was irgendwie 50 Byte groß ist"}, {"id": 719, "start": 4959.76, "end": 4968.8, "text": "oder so, immer noch der Witz, aber.NET ist halt glaube ich 35 MB groß, weil da ist halt"}, {"id": 720, "start": 4968.8, "end": 4976.16, "text": "die komplette Runtime fast ohne irgendwelche, also ohne irgendwas wegzunehmen mit dabei,"}, {"id": 721, "start": 4976.16, "end": 4986.92, "text": "so vielleicht kriegen sie das hier gebacken, Unified Platform, ja, Unified wie gesagt"}, {"id": 722, "start": 4986.92, "end": 4991.96, "text": "solang es nicht Linux ist, weil mit GUI auf dem Desktop, das stimmt nämlich überhaupt"}, {"id": 723, "start": 4991.96, "end": 5012.76, "text": "nicht, also Linux GUI geht damit nicht, dynamic, was für ein Ding, pgo, ken, was auch immer,"}, {"id": 724, "start": 5012.76, "end": 5022.2, "text": "Benchmark hatten wir gerade schon, filo improvements, oh huge, also wenn man ganz viele 100 MB Dateien"}, {"id": 725, "start": 5022.2, "end": 5026.08, "text": "schreibt, flutscht es jetzt richtig, wusste ich gar nicht, warum ist das vorher so langsam"}, {"id": 726, "start": 5026.08, "end": 5043.8, "text": "gewesen, ganz schön langsame SSD oder, ich mein 100 MB 1,3 Sekunden, ne ordentliche SSD"}, {"id": 727, "start": 5043.8, "end": 5051.04, "text": "macht 5-600 MB die Sekunde und das ist dann auch nicht mal an die schnellsten die es gibt,"}, {"id": 728, "start": 5051.04, "end": 5056.04, "text": "wieso noch Windows 10, weil ich keinen Grund bisher hab für Windows 11, eher Gründe dagegen"}, {"id": 729, "start": 5056.04, "end": 5062.56, "text": "beispielsweise, dass die Taskleiste sich die Gruppierung, die Gruppierung nicht mehr ausschalten"}, {"id": 730, "start": 5062.56, "end": 5070.48, "text": "lässt, faster interface checking, alles klar, C Sharp 10, das haben wir uns schon angeguckt,"}, {"id": 731, "start": 5070.48, "end": 5079.36, "text": "das haben wir uns letztens im Stream angeguckt, haben wir uns auch angeguckt, F Sharp 6, das"}, {"id": 732, "start": 5079.36, "end": 5085.24, "text": "ist nur für Big Brains, das ist die funktionale Programmiersprache, quasi so die Nummer eins"}, {"id": 733, "start": 5085.24, "end": 5095.88, "text": "für das.NET Framework, also wenn man besonders hohen EQ hat, kann man F Sharp programmieren,"}, {"id": 734, "start": 5095.88, "end": 5108.0, "text": "ich finde schon das Example nicht sonderlich, F Sharp for Fun and Profit, ja das geht jetzt"}, {"id": 735, "start": 5108.0, "end": 5113.92, "text": "noch, aber ich finde F Sharp ist wirklich, das ist, funktionale Programmiersprachen brauchen"}, {"id": 736, "start": 5113.92, "end": 5127.04, "text": "einfach komplett anderes Hirnlayout, wie normale, so Making F Sharp Faster, bla bla bla, Hot Reload,"}, {"id": 737, "start": 5127.04, "end": 5143.12, "text": "Hot Reload ist ja eher was für GUI und Blazer glaube ich, das könnten wir tatsächlich"}, {"id": 738, "start": 5143.12, "end": 5148.32, "text": "mal ausprobieren beim nächsten Streams, für mich ist die normale Sprache die Funktionale,"}, {"id": 739, "start": 5148.32, "end": 5166.68, "text": "gut hat jeder so sein, Security viel besser jetzt, alles klar, Arm 64, ahja das ist gut,"}, {"id": 740, "start": 5166.68, "end": 5184.64, "text": "Windows benutzt das wirklich jemand, benutzt Windows für Arm wirklich irgendjemand, hat"}, {"id": 741, "start": 5184.64, "end": 5204.6, "text": "das, macht das jemand, Mac OS Arm 64, das ist wichtig, Arm 64 Performance, BÄN, bald"}, {"id": 742, "start": 5204.6, "end": 5208.6, "text": "ist übrigens auch wieder die jährliche, diese komische.NET Konferenz, die einfach"}, {"id": 743, "start": 5208.6, "end": 5213.84, "text": "nur.NET Konferenz heißt, Microsoft und Benahmung, dann kriegen wir wahrscheinlich ein paar Sachen"}, {"id": 744, "start": 5213.84, "end": 5219.56, "text": "erzählt zu dem, was hier drin steht, aber ein bisschen hübscher aufbereitet, Windows"}, {"id": 745, "start": 5219.56, "end": 5232.72, "text": "Container, Paintschamp, könnte sein, dass das morgen losgeht, ja, Debian 11 Support,"}, {"id": 746, "start": 5232.72, "end": 5240.2, "text": "nice,.NET Monitor habe ich noch nie verwendet, das ist irgendwie um Statistiken voll seine"}, {"id": 747, "start": 5240.2, "end": 5249.44, "text": "Apps rauszubekommen, eigentlich ganz nice, Structured Jason Logs, alles klar, Support"}, {"id": 748, "start": 5249.44, "end": 5256.12, "text": "für Open Telemetry Matrix, brauche ich nicht, Windows Forms, ich mein, ich finde das so"}, {"id": 749, "start": 5256.12, "end": 5267.72, "text": "geil, Windows Forms im Jahr 2021, Improvements für Windows Forms, was zum Teufel, ich mein"}, {"id": 750, "start": 5267.72, "end": 5273.72, "text": "ich finde es ja gut, nachdem Microsoft es immer noch nicht geschafft hat, nach 30 Jahren"}, {"id": 751, "start": 5273.72, "end": 5279.16, "text": "mal ein gescheites UI Framework rauszubringen und zu aktualisieren, oder was, bleibt ja"}, {"id": 752, "start": 5279.16, "end": 5286.12, "text": "außer Windows Forms nichts übrig, das ist ja, Microsoft hat ja mit ihrer komischen GUI"}, {"id": 753, "start": 5286.12, "end": 5289.6, "text": "Framework Politik mit dazu beigetragen, dass Elektron sich überhaupt durchgesetzt hat"}, {"id": 754, "start": 5289.6, "end": 5297.76, "text": "für Desktop Anwendungen, WPF ist auch der Sack, WPF ist einfach nur die komplizierte"}, {"id": 755, "start": 5297.76, "end": 5303.24, "text": "Variante, nein das stimmt nicht, WPF hat schon einige coole Sachen und hat auch viele Sachen"}, {"id": 756, "start": 5303.24, "end": 5311.48, "text": "wie Two Way Data Binding als eines der ersten GUI Framework gemacht, aber WPF ist auch hoffnungslos"}, {"id": 757, "start": 5311.48, "end": 5320.08, "text": "outdated und ich finde, also ich persönlich bin nie mit WPF großartig warm geworden,"}, {"id": 758, "start": 5320.08, "end": 5327.92, "text": "ich fand WPF immer unglaublich bloated und wenn du WPF programmieren wolltest, so dass"}, {"id": 759, "start": 5327.92, "end": 5333.4, "text": "es nicht ultra bloated wird für kleine Anwendungen, zum Beispiel wenn man einfach Code Behind"}, {"id": 760, "start": 5333.4, "end": 5339.08, "text": "verwendet hat, anstatt irgendwelche MVVM, was hast du nicht gesehen, zig Frameworks"}, {"id": 761, "start": 5339.08, "end": 5344.24, "text": "mit Locator dahin und hier rum und Message Cues, wenn du das nicht gemacht hast, wurdest"}, {"id": 762, "start": 5344.24, "end": 5348.32, "text": "du von den WPF Leuten schäpp angeguckt, so nach dem Motto, das ist aber nicht best practice,"}, {"id": 763, "start": 5348.32, "end": 5353.84, "text": "so geht das aber nicht und ne, also ich bin mit WPF nie warm geworden."}, {"id": 764, "start": 5353.84, "end": 5366.08, "text": "OpenTelemetry ist Prometheus, ah das ist nice, das heißt ich muss mein Prometheus"}, {"id": 765, "start": 5366.08, "end": 5370.76, "text": "Exporter nicht mehr selbst programmieren, das finde ich gut."}, {"id": 766, "start": 5370.76, "end": 5381.72, "text": "Minimal Applications, ja das ist tatsächlich cool, sowohl die Minimal Apis als auch diese"}, {"id": 767, "start": 5381.72, "end": 5401.12, "text": "Geschichten hier, das ist ja absolute Augenweite die Anwendung hier, Single File Apps, das"}, {"id": 768, "start": 5401.12, "end": 5405.92, "text": "finde ich tatsächlich interessant, das ist auch so ein Thema, wo es Microsoft ein bisschen"}, {"id": 769, "start": 5405.92, "end": 5410.04, "text": "verschlafen hat, die Leute haben seit Jahren gesagt, sie wollen Single File Apps, also"}, {"id": 770, "start": 5410.04, "end": 5414.96, "text": "dass du es kompilierst und es fällt ein einfacher Executable raus und sonst nix, das hat, da"}, {"id": 771, "start": 5414.96, "end": 5418.4, "text": "haben die lange für gebraucht, mittlerweile ist es ganz gut, sie könnten aber, hätten"}, {"id": 772, "start": 5418.4, "end": 5419.56, "text": "aber schon besser dastehen können."}, {"id": 773, "start": 5419.56, "end": 5425.08, "text": "Microsoft hat die ganze Zeit gesagt, wieso ist doch kein Problem, mach Self-Contained"}, {"id": 774, "start": 5425.08, "end": 5429.76, "text": "Ordner und lass dann von einem anderen Installer, lass von einem anderen Installer draus bauen,"}, {"id": 775, "start": 5429.76, "end": 5434.08, "text": "ich wollte keinen Installer für Linux bauen lassen oder so ein Scheiß, ich wollte einfach"}, {"id": 776, "start": 5434.08, "end": 5438.28, "text": "ordentliche Single File Apps haben, dass du es auch für Sachen verwenden kannst, wo"}, {"id": 777, "start": 5438.28, "end": 5443.52, "text": "Go beispielsweise beliebt ist, Go ist ja, also eines der wirklich vorzeige Dinger von Go"}, {"id": 778, "start": 5443.52, "end": 5449.68, "text": "ist halt einfach, dass es Self-Contained Single Executables sind, die lauffähig sind auf"}, {"id": 779, "start": 5449.68, "end": 5457.32, "text": "jedem Linux seit Colonel 2.6.32 oder so, kannst du mal im Stream einen Prometheus Exporter"}, {"id": 780, "start": 5457.32, "end": 5461.72, "text": "schreiben, haben wir gemacht, ist immer schief, ich frag mich aber bitte nicht, wie der heißt,"}, {"id": 781, "start": 5461.72, "end": 5465.16, "text": "aber wir können, ich kann es immer aufschreiben, das können wir in nächster Zeit mal wieder"}, {"id": 782, "start": 5465.16, "end": 5481.68, "text": "machen für irgendwas spannendes, äh Stream Ideen, aber ich kann dir sagen, es ist nicht"}, {"id": 783, "start": 5481.68, "end": 5496.24, "text": "ordentlich schwierig gewesen, das wusste ich nicht, aber ich könnte mir vorstellen, wenn"}, {"id": 784, "start": 5496.24, "end": 5502.2, "text": "du die passende, oh wie heißt das, Go Enf, heißt das nicht Go Enf bei denen, wenn du"}, {"id": 785, "start": 5502.2, "end": 5505.12, "text": "da das passende angibst, dann läuft es auch wirklich überall."}, {"id": 786, "start": 5505.12, "end": 5523.04, "text": "Also ich kann zum Beispiel Go Sachen kompilieren für, also auf meinem Linux für einen Raspberry"}, {"id": 787, "start": 5523.04, "end": 5524.04, "text": "Pi, das funktioniert."}, {"id": 788, "start": 5524.04, "end": 5542.64, "text": "Also dann quasi x86 zu arm, oder was heißt zu, dass jetzt Arm Executable rausfällt, ich"}, {"id": 789, "start": 5542.64, "end": 5548.64, "text": "hab da eine Nachricht geskippt, echt, wo denn, was denn, poste einfach nochmal, ach hier,"}, {"id": 790, "start": 5548.64, "end": 5558.6, "text": "ich, ach so ja gut, was soll ich denn dazu sagen, du musst TPM aktivieren, ja gut, ich"}, {"id": 791, "start": 5558.6, "end": 5574.44, "text": "hab's auch nicht aktiviert, da musst du nochmal posten, hab ich nicht gesehen, das hab ich"}, {"id": 792, "start": 5574.44, "end": 5582.52, "text": "wirklich übersehen, der Chat ist aber auch mit dran schuld, weil die hätten sagen können,"}, {"id": 793, "start": 5582.52, "end": 5589.96, "text": "MC O'Righty hat eine Frage Streamer, hab ich extra ein Makro dafür jetzt, und ich weiß,"}, {"id": 794, "start": 5589.96, "end": 5601.0, "text": "der Chat spammt das auch mal ganz gerne, nice video today, freu mich auf die nächste Hot"}, {"id": 795, "start": 5601.0, "end": 5608.36, "text": "Story aus der Welt, how not to be an angel big brain IT expert, der war ja nicht big brain"}, {"id": 796, "start": 5608.36, "end": 5615.32, "text": "der IT expert, der war eher low brain, zum thema funktionale Programmierung, ja 40 Minuten,"}, {"id": 797, "start": 5615.32, "end": 5623.16, "text": "alles klar, alles klar, soll ich denn hier noch durchskippen, you can use the setting,"}, {"id": 798, "start": 5623.16, "end": 5629.36, "text": "ja meine Güte, macht halt noch bitte schön längere Optionen haben, include native libraries"}, {"id": 799, "start": 5629.36, "end": 5639.88, "text": "for self extract, obvious, komplett obvious, was der Microsoft überlegt hat, ist Taiwan"}, {"id": 800, "start": 5639.88, "end": 5645.92, "text": "ein unabhängiges Land, das ist die Frage, ob ich meine social credit score pushen will"}, {"id": 801, "start": 5645.92, "end": 5652.48, "text": "oder nicht mit der Antwort, also für unsere chinesischen Zuschauer, sowohl Hongkong als"}, {"id": 802, "start": 5652.48, "end": 5656.64, "text": "auch Taiwan, gehören natürlich zu China, und für die Zuschauer der restlichen Welt"}, {"id": 803, "start": 5656.64, "end": 5678.24, "text": "natürlich ist es ein unabhängiges Land, so, direkt Aliexpress, 20% da teurer wahrscheinlich,"}, {"id": 804, "start": 5678.24, "end": 5704.6, "text": "ja, das ist gut, das ist gut, dass das geht, jetzt kannst du nicht nur trimmen, du kannst"}, {"id": 805, "start": 5704.6, "end": 5715.48, "text": "nicht nur Single File machen, du kannst jetzt auch komprimieren, das finde ich nice, ja,"}, {"id": 806, "start": 5715.48, "end": 5721.8, "text": "das ist cool, vielleicht, ich meine vielleicht schaffen wir es ja wirklich mal auf, irgendwann,"}, {"id": 807, "start": 5721.8, "end": 5726.6, "text": "vielleicht schaffen wir es ja irgendwann mal, dass wir unter 10 MB kommen, für ein Hallo"}, {"id": 808, "start": 5726.6, "end": 5743.2, "text": "Welt mit.net, self contained, trimmed und compressed, wie den Big Mac, alles klar ich"}, {"id": 809, "start": 5743.2, "end": 5768.36, "text": "spreche dich wie den Big Mac aus, kein Problem, was für ein Ding, ok, quick muffs, die muffs"}, {"id": 810, "start": 5768.36, "end": 5777.56, "text": "AP wurden improved,.net 6 introduced new helpers working with power of 2, aha, also"}, {"id": 811, "start": 5777.56, "end": 5796.32, "text": "kann man jetzt besser hoch 2, bit operations, äh, ach der guckt, ob das ein Vielfaches"}, {"id": 812, "start": 5796.32, "end": 5806.84, "text": "von 2 ist, ok, das ist tatsächlich ganz nützlich, kann man bestimmt mal gut gebrauchen, kannst"}, {"id": 813, "start": 5806.84, "end": 5810.86, "text": "du mir nochmal erzählen, wie du auf deinen Twitch Username gekommen bist, äh, das weiß"}, {"id": 814, "start": 5810.86, "end": 5814.24, "text": "ich nicht, wie ich darauf gekommen bin, ich weiß nur, dass ich den schon eine ganze Weile"}, {"id": 815, "start": 5814.24, "end": 5823.2, "text": "habe, bevor ich selbst anfangen wollte zu streamen, das sind alles ewig lange Videos,"}, {"id": 816, "start": 5823.2, "end": 5827.88, "text": "so jetzt gucken wir uns mal ein bisschen Racks von anderen Leuten an, für uns sind die"}, {"id": 817, "start": 5827.88, "end": 5837.44, "text": "Bluetooth Thermometer ja, bei mir melden, aha, vielleicht hast du eine noch neuere Version,"}, {"id": 818, "start": 5837.44, "end": 5842.28, "text": "also die gehen bei mir, wir haben es ja letztens im Stream geflasht, das hat danach funktioniert"}, {"id": 819, "start": 5842.28, "end": 5845.04, "text": "und ich habe jetzt unten im Bad noch eins hängen, also ich habe oben im Bad und unten"}, {"id": 820, "start": 5845.04, "end": 5861.36, "text": "im Bad eins, oben im Bad ja schon länger, unten im Bad geht auch ohne Probleme, Performance"}, {"id": 821, "start": 5861.36, "end": 5874.36, "text": "Oriented APs, Sincos, das kann ich nicht aussprechen, was Reciprocal Square Root Estimate, meine"}, {"id": 822, "start": 5874.36, "end": 5879.84, "text": "Fresse, boah du Scheiße, das kann ich nicht, das ne, das werde ich nicht verwenden, das"}, {"id": 823, "start": 5879.84, "end": 5887.52, "text": "kann ich nicht aussprechen, was war zuerst da Wupplos oder Monster FPS, ich weiß es"}, {"id": 824, "start": 5887.52, "end": 5892.2, "text": "gar nicht, ich weiß es gar nicht, also der Account war auf jeden Fall später da, aber"}, {"id": 825, "start": 5892.2, "end": 5898.0, "text": "so sinnlose Random Namen, für MMO Charaktere, die einfach nur Items halten sollen und sowas,"}, {"id": 826, "start": 5898.0, "end": 5913.92, "text": "es könnte sogar sein, dass es Wupplos früher gegeben hat, Big Int Performance, oh, Bam,"}, {"id": 827, "start": 5913.92, "end": 5920.76, "text": "chat, ich hab mich ja vor einigen Jahren richtig gefreut, als sie Big Int aufgenommen haben"}, {"id": 828, "start": 5920.76, "end": 5926.44, "text": "und ich muss euch ehrlich sagen, ich hab Big Int seitdem nie verwendet, noch nie, in keinem"}, {"id": 829, "start": 5926.44, "end": 5942.48, "text": "wirklichen Projekt bisher, habt ihr schonmal Big Int gebraucht, also im Studium, ja gut,"}, {"id": 830, "start": 5942.48, "end": 5946.72, "text": "theoretisch aber, theoretisch braucht man es ja auch, also Big Int ist halt für alles,"}, {"id": 831, "start": 5946.72, "end": 5955.04, "text": "was du nicht CPU-häppchen gerecht in abbilden kannst, bis quasi, bis zu nem Int 108, also"}, {"id": 832, "start": 5955.04, "end": 5962.64, "text": "was ist ein Int 128, ein Dezimal, also alles, was größer ist und es macht intern, macht"}, {"id": 833, "start": 5962.64, "end": 5978.4, "text": "es halt quasi String Magic für Zahlen, Complex, Apis, Bit Converter, Better Parsi, ok, ich"}, {"id": 834, "start": 5978.4, "end": 5983.92, "text": "glaube, das müssen wir uns jetzt nicht alles durchgucken, excellent, excellent, ok, gut,"}, {"id": 835, "start": 5983.92, "end": 5989.76, "text": "alles, Server-Rack, das gibt, das gibt mir, ok, Leute, ich würde sagen, wir fangen mit"}, {"id": 836, "start": 5989.76, "end": 5999.24, "text": "dem RGB, mit dem RGB-Rack an, weil wir wissen ja, das wichtigste im Server-Raum ist RGB-Beleuchtung,"}, {"id": 837, "start": 5999.24, "end": 6017.44, "text": "einfach der Performance zuliebe im Endeffekt auch."}, {"id": 838, "start": 6017.44, "end": 6046.44, "text": "Das Flutsch durch die RGB ist nochmal extra, was bin ich da sehend überhaupt, das ist"}, {"id": 839, "start": 6046.44, "end": 6065.52, "text": "die RGB-Beleuchtung, was ist das, Philips, Philips, was, Tube bestimmt, er hat das sehr"}, {"id": 840, "start": 6065.52, "end": 6072.32, "text": "ordentlich, muss ich sagen, sieht bei mir fast ein bisschen aus, wie das, was ich von"}, {"id": 841, "start": 6072.32, "end": 6089.12, "text": "dem Werkzeug-Wand verwende, ok, Raspberry Pi mit Lüfter, ich mein, der Raum ist ganz"}, {"id": 842, "start": 6089.12, "end": 6100.12, "text": "schön leer, oder, warte mal, wenn er jetzt rauszoomt, oder zoomt jetzt gleich raus, da"}, {"id": 843, "start": 6100.12, "end": 6104.4, "text": "ist nicht viel drin, da steht ein Rack und hier neben steht noch ein Nass oder sowas"}, {"id": 844, "start": 6104.4, "end": 6117.88, "text": "wahrscheinlich, aber wobei, bisschen Platz, ok, der Raum ist schonmal größer wie meiner,"}, {"id": 845, "start": 6117.88, "end": 6135.88, "text": "Kokona Haus, Alter, das ist typisches Kokona Haus, einfach, einfach mal in die Wand ein"}, {"id": 846, "start": 6135.88, "end": 6161.52, "text": "Loch gesägt, easy, easy, aha, es, aus wie ein Briefeinwurf, ok, ok, ok, ok, ok, ok,"}, {"id": 847, "start": 6161.52, "end": 6175.16, "text": "ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, okπο свое, knee Чей��actic, Nasty tatsächlich."}, {"id": 848, "start": 6175.16, "end": 6179.88, "text": "Nest käme nie ins Haus, ganz ehrlich habe ich immer einen riesen Bogen drum gemacht"}, {"id": 849, "start": 6179.88, "end": 6184.02, "text": "und letztens, also jetzt gab es ja, ich habe es ja immer nur, immer nur beobachtet, weil"}, {"id": 850, "start": 6184.02, "end": 6188.92, "text": "ich habe es ja nicht. Erstens, wo wir, wo sie mir zum erstenmal negativ aufgefallen sind,"}, {"id": 851, "start": 6188.92, "end": 6192.82, "text": "wo sie ihre komische API abgeschaltet haben, wo Google dann einfach gesagt hat, nö, machen"}, {"id": 852, "start": 6192.82, "end": 6193.82, "text": "wir nicht."}, {"id": 853, "start": 6193.82, "end": 6198.32, "text": "Und das nächste, wo es beim Netzwerkausfall nicht mehr richtig funktioniert hat."}, {"id": 854, "start": 6198.32, "end": 6203.16, "text": "Also Nest kommt mir nicht ins Haus."}, {"id": 855, "start": 6203.16, "end": 6207.56, "text": "Kühlung, kein Airconditioner, doch, das ist Kekona Haus, die haben bestimmt, die Amis"}, {"id": 856, "start": 6207.56, "end": 6208.56, "text": "haben überall eine Klimaanlage."}, {"id": 857, "start": 6208.56, "end": 6229.52, "text": "Ja, das habe ich bei mir auch so."}, {"id": 858, "start": 6229.52, "end": 6234.88, "text": "Das ist typisch Kekona, richtiger Kekona Schalter, wieder ein weiteres Loch in der Wand."}, {"id": 859, "start": 6234.88, "end": 6237.32, "text": "Das habe ich bei mir im Serverraum mittlerweile auch so gemacht."}, {"id": 860, "start": 6237.32, "end": 6243.08, "text": "Das ist so ein Bewegungssensor und wenn man da reingeht, dann erkennt es das automatisch"}, {"id": 861, "start": 6243.08, "end": 6244.52, "text": "und macht Licht an der Decke an."}, {"id": 862, "start": 6244.52, "end": 6248.68, "text": "Ja, es funktioniert ähnlich."}, {"id": 863, "start": 6248.68, "end": 6266.6, "text": "Oh, guck mal, da ist eine Cloud, das ist bestimmt sein Kabelmodem oder sowas in der"}, {"id": 864, "start": 6266.6, "end": 6267.6, "text": "Richtung."}, {"id": 865, "start": 6267.6, "end": 6268.6, "text": "Warum?"}, {"id": 866, "start": 6268.6, "end": 6296.36, "text": "Alter, der hat ja nur in seinem Serverraum mehr RGB als ich im ganzen Haus."}, {"id": 867, "start": 6296.36, "end": 6297.36, "text": "Warum?"}, {"id": 868, "start": 6297.36, "end": 6306.88, "text": "Ich meine, es sieht cool aus, okay, das lasse ich mir gefallen, aber es hat absolut keinen"}, {"id": 869, "start": 6306.88, "end": 6307.88, "text": "Sinn."}, {"id": 870, "start": 6307.88, "end": 6331.76, "text": "Wunderbar, das brauche ich im Serverraum auch alles unbedingt."}, {"id": 871, "start": 6331.76, "end": 6337.92, "text": "Aber ehrlich, ich meine, ich habe in meinem Serverraum auch RGB-Lampe hängen, das hat"}, {"id": 872, "start": 6337.92, "end": 6343.76, "text": "man ja gesehen bei mir in dem Video, wo ich es gezeigt habe, aber ich hatte halt einfach"}, {"id": 873, "start": 6343.76, "end": 6348.28, "text": "noch eine übrig und die ist auf normal helles weißes Licht gestellt."}, {"id": 874, "start": 6348.28, "end": 6353.52, "text": "Ich stelle da nie was dran rum, außer zu Demonstrationszwecken, komplett übertrieben."}, {"id": 875, "start": 6353.52, "end": 6361.12, "text": "Aber es sieht cool aus, das muss man ihm lassen."}, {"id": 876, "start": 6361.12, "end": 6367.6, "text": "Guck mal, der hat einen LED-Strip da drin, im Rack, auf die Idee wäre ich ja gar nicht"}, {"id": 877, "start": 6367.6, "end": 6370.08, "text": "gekommen, einen LED-Streifen ins Rack zu pappen."}, {"id": 878, "start": 6370.08, "end": 6395.72, "text": "Ja, das hat mein Motion Sensor auch, der hat auch einen Thermometer, ich weiß jetzt, wie"}, {"id": 879, "start": 6395.72, "end": 6397.44, "text": "warm es im Serverraum ist."}, {"id": 880, "start": 6397.44, "end": 6400.48, "text": "Und wisst ihr, was ich mit dieser Information mache?"}, {"id": 881, "start": 6400.48, "end": 6401.48, "text": "Nichts."}, {"id": 882, "start": 6401.48, "end": 6405.92, "text": "Ich weiß es einfach, wenn ich es wissen müsste, aber ich gucke da nie drauf."}, {"id": 883, "start": 6405.92, "end": 6420.64, "text": "Ich meine, man könnte natürlich dann abgedrehte Sachen machen, man könnte quasi die RGB,"}, {"id": 884, "start": 6420.64, "end": 6426.2, "text": "das Licht quasi passend zur Serverraum mit Temperatur einschalten, also nicht einschalten,"}, {"id": 885, "start": 6426.2, "end": 6432.24, "text": "was laber ich denn, die passende Lichtfarbe zur Temperatur machen oder sowas, aber das"}, {"id": 886, "start": 6432.24, "end": 6437.12, "text": "ist mir die Mühe für den Raum, wo ich einmal in der Woche reingehe und nicht fährt."}, {"id": 887, "start": 6437.12, "end": 6440.44, "text": "Wobei ich ja mittlerweile schon öfters in meinen Serverraum reingehe, weil ich habe"}, {"id": 888, "start": 6440.44, "end": 6444.0, "text": "ja die Werkzeugwand auch da."}, {"id": 889, "start": 6444.0, "end": 6447.2, "text": "Jedes Mal, wenn ich Werkzeug brauche, gehe ich ja da an die Wand und hole dann irgendwie"}, {"id": 890, "start": 6447.2, "end": 6453.2, "text": "alles Mögliche, was ich da halt brauche, von Heißkleber bis Schraubendreher bis alles"}, {"id": 891, "start": 6453.2, "end": 6454.2, "text": "Mögliche, was halt da hängt."}, {"id": 892, "start": 6454.2, "end": 6463.72, "text": "Und dann mache ich einfach das Licht an und wenn ich rausgehe, timeoutet das und das Licht"}, {"id": 893, "start": 6463.72, "end": 6465.12, "text": "geht wieder aus nach ein paar Minuten."}, {"id": 894, "start": 6465.12, "end": 6475.48, "text": "Also ich bin der Meinung, dieses Philips Hue Zeug ist absolut overpriced, der Kram."}, {"id": 895, "start": 6475.48, "end": 6485.4, "text": "Wenn man es wirklich darauf anlegt, ist das, also wenn man komplett gar nichts machen will,"}, {"id": 896, "start": 6485.4, "end": 6490.84, "text": "einfach sich braindead was kaufen will, meinetwegen, aber mit den meisten anderen Sachen kommst"}, {"id": 897, "start": 6490.84, "end": 6494.12, "text": "du günstiger hin und wahrscheinlich sogar besser integriert."}, {"id": 898, "start": 6494.12, "end": 6517.52, "text": "Hä, was bin ich da sehend?"}, {"id": 899, "start": 6517.52, "end": 6540.16, "text": "Hä, was seh ich da überhaupt, was ist das, das ist eine LED Matrix und was seh ich da,"}, {"id": 900, "start": 6540.16, "end": 6547.44, "text": "ich seh einen Raspberry Pi, was ist das, sind die je nach Farbe, sind das einfach die LEDs"}, {"id": 901, "start": 6547.44, "end": 6548.44, "text": "anders oder wie?"}, {"id": 902, "start": 6548.44, "end": 6554.0, "text": "Wie sind die von AVM, du meinst die Lampen, weiß ich nicht, hab ich nicht."}, {"id": 903, "start": 6554.0, "end": 6558.32, "text": "Ich hab von AVM plus Thermostat für die Heizung, weil alle andere nicht ausprobiert haben,"}, {"id": 904, "start": 6558.32, "end": 6559.32, "text": "kacke waren."}, {"id": 905, "start": 6559.32, "end": 6562.4, "text": "Die haben auch so seine Probleme, aber funktionieren ganz okay."}, {"id": 906, "start": 6562.4, "end": 6572.24, "text": "Ach jetzt, Serverraum Temperature ist viel zu, das ist viel zu lang, wenn du die Serverraum"}, {"id": 907, "start": 6572.24, "end": 6577.16, "text": "Temperatur wissen willst und im Zweifelsfall, also du willst die wissen und guckst drauf"}, {"id": 908, "start": 6577.16, "end": 6585.96, "text": "und du musst erstmal 15 Sekunden Scroll Schrift sehen, das ist ja fail, ist, nee das, guck mal,"}, {"id": 909, "start": 6585.96, "end": 6592.28, "text": "das war die eigentliche Information und der Rest waren 15 Sekunden bloated Schrift, würde"}, {"id": 910, "start": 6592.28, "end": 6593.28, "text": "ich nicht so machen."}, {"id": 911, "start": 6593.28, "end": 6605.72, "text": "SRV Temp, in die erste Zeile, unten drunter als zweite, fertig, genau."}, {"id": 912, "start": 6605.72, "end": 6611.52, "text": "Okay, das können wir jetzt ein bisschen vorskippen, weil ich mein, so viel ist da nicht, das ist"}, {"id": 913, "start": 6611.52, "end": 6615.84, "text": "ein Patch Panel, irgendein Kabel Modem, Philips Hue Bridge, wahrscheinlich hier unten irgendwie"}, {"id": 914, "start": 6615.84, "end": 6624.12, "text": "ein USB Hub, was denn das, Capture Card, das sieht ein bisschen aus wie eine billige Capture"}, {"id": 915, "start": 6624.12, "end": 6633.84, "text": "Card, aber was könnte denn das sein, PoE Injector, nee was ist denn das, keine Ahnung, ich würde"}, {"id": 916, "start": 6633.84, "end": 6639.16, "text": "sagen, das da unten könnte fast noch ein Raspberry Pi sein, in einem anderen Case, aber ganz"}, {"id": 917, "start": 6639.16, "end": 6640.16, "text": "schön groß."}, {"id": 918, "start": 6640.16, "end": 6652.04, "text": "USB Netzwerkade A, Ach Hackboard heißt das offiziell, okay, das weiß ich auch, wie ich"}, {"id": 919, "start": 6652.04, "end": 6653.04, "text": "das nennen muss."}, {"id": 920, "start": 6653.04, "end": 6654.04, "text": "Ach Packboard."}, {"id": 921, "start": 6654.04, "end": 6676.0, "text": "Ah, Peg, nicht Heck, Wingnuts, also quasi Flügelnüsse, weiß nicht, ob das auf Deutsch"}, {"id": 922, "start": 6676.0, "end": 6687.96, "text": "so heißt, okay, Cricona Style, geht bei mir schonmal nicht, okay, wir gehen jetzt mal ein"}, {"id": 923, "start": 6687.96, "end": 6699.92, "text": "bisschen weiter, das ist ja alles das gleiche, ach, das ist Nuke da unten, okay, das da ist"}, {"id": 924, "start": 6699.92, "end": 6712.56, "text": "0, sieht aus wie neunziger Kanalrohr, das ist ne Decke, ja, okay, auf, erzähl, okay,"}, {"id": 925, "start": 6712.56, "end": 6733.16, "text": "USB, USB, ja, weiter, ja, Power Strips, siehste, hätte er sich mal die Kogi Steckdosenleiste"}, {"id": 926, "start": 6733.16, "end": 6736.96, "text": "gekauft und mit das Motor geflasht, da wäre er deutlich billiger hingekommen."}, {"id": 927, "start": 6736.96, "end": 6761.12, "text": "Das mit Mediamarktensaturn haben wir uns schon angeguckt, Kameras, alles klar, er hat ziemlich"}, {"id": 928, "start": 6761.12, "end": 6768.96, "text": "viele Festplatten am Start, dieses Gehäuse hatten wohl alle früher oder später mal,"}, {"id": 929, "start": 6768.96, "end": 6772.36, "text": "mein alter Surfer war auch in dem Gehäuse, also den, wo ich selbst zusammen geschraubt"}, {"id": 930, "start": 6772.36, "end": 6773.36, "text": "hab."}, {"id": 931, "start": 6773.36, "end": 6784.76, "text": "Super Mikrokrisse um drüber, das sieht aus wie Unify Gendurance, das da unten drunter"}, {"id": 932, "start": 6784.76, "end": 6789.36, "text": "ist wahrscheinlich irgendein relativ alter Cisco Switch, weil neue Cisco Sachen sind"}, {"id": 933, "start": 6789.36, "end": 6805.0, "text": "einfach unglaublich teuer, was machen die eigentlich alle immer mit dieser riesen Anzahl"}, {"id": 934, "start": 6805.0, "end": 6812.6, "text": "an Festplatten, haben die alle nur 2TB Platten und brauchen deswegen so viele oder haben"}, {"id": 935, "start": 6812.6, "end": 6821.72, "text": "sie irgendwie Petabyte Zeug da liegen."}, {"id": 936, "start": 6821.72, "end": 6826.2, "text": "Was bringt so ein Flash, du meinst von der Steckdosenleiste, naja, du kannst viel besser"}, {"id": 937, "start": 6826.2, "end": 6830.84, "text": "in deine Heimautomatisierung einbinden, du hast im Zweifelsfall auch ein Webinterface"}, {"id": 938, "start": 6830.84, "end": 6836.24, "text": "zum Steuern, du brauchst keine China-Chinesen App und keine China Cloud ums zu steuern,"}, {"id": 939, "start": 6836.24, "end": 6844.32, "text": "das ist eigentlich alles besser geflasht, alles für die Linux-ISOs, ja genau, für"}, {"id": 940, "start": 6844.32, "end": 6855.32, "text": "die Linux-ISOs und zum Torrent-Sharing für allgemein nützige Projekte, ja klar, natürlich,"}, {"id": 941, "start": 6855.32, "end": 6872.2, "text": "2,5h, das muss aber verdammt fett sein, mal ganz davon abgesehen, eigentlich reicht"}, {"id": 942, "start": 6872.2, "end": 6877.28, "text": "es ja, wenn das sag mal mal 5 Minuten überbrückt und dann die Kisten sich in der Zeit ordentlich"}, {"id": 943, "start": 6877.28, "end": 6882.64, "text": "runterfahren können und ich bin mittlerweile im Heimbereich wirklich kein Fan mehr von"}, {"id": 944, "start": 6882.64, "end": 6888.8, "text": "USVs muss ich sagen, ich hab schlechte Erfahrungen mit USVs gemacht, klar natürlich liegt das"}, {"id": 945, "start": 6888.8, "end": 6895.8, "text": "auch am Preis und was man sich da kauft, aber das einzige Mal wo mein komplettes Wreck ausgefallen"}, {"id": 946, "start": 6895.8, "end": 6904.48, "text": "ist, war als die USV verreckt ist, nicht etwa umgedreht, nein es ist nie was passiert und"}, {"id": 947, "start": 6904.48, "end": 6910.48, "text": "einmal wo die USV abgekackt ist, ist was passiert und nie ist komplett verreckt die USV, komplettes"}, {"id": 948, "start": 6910.48, "end": 6923.12, "text": "Wreck aus, obwohl der Strom noch ging wohlgemerkt, ähm wenn du das Fire HD gekauft hast, kann"}, {"id": 949, "start": 6923.12, "end": 6928.2, "text": "es gut sein, dass du das nicht mehr flashen und routen kannst, Amazon ist da immer relativ"}, {"id": 950, "start": 6928.2, "end": 6931.56, "text": "weit hinterher, ich weiß nicht ob es für das aktuelle Fire HD 10 überhaupt eine Flash"}, {"id": 951, "start": 6931.56, "end": 6936.52, "text": "und Route gibt, was du machen musst ist, du musst das einfach deep-loaden, deep-loaden"}, {"id": 952, "start": 6936.52, "end": 6942.24, "text": "holst du diese Amazon Amazon Fire Toolbox und deep-loadest, dann kannst du das auch gut"}, {"id": 953, "start": 6966.52, "end": 6978.22, "text": "machen, Deep Packet Inspection macht ganz im Ernst, als würde irgendeiner hier im Heim"}, {"id": 954, "start": 6978.22, "end": 6984.08, "text": "irgendwas davon haben, dass das Ding Deep Packet Inspection macht, zumal das meiste"}, {"id": 955, "start": 6984.08, "end": 6994.08, "text": "eh TLS ist mittlerweile und ja ich weiß, dass man manche Sachen rausbekommen kann über"}, {"id": 956, "start": 6994.08, "end": 7000.28, "text": "den Inhalt von verschlüsselnden Verbindungen, aber das hat im Heimbereich trotzdem unsinnig,"}, {"id": 957, "start": 7000.28, "end": 7006.92, "text": "also man kann ja zum Beispiel für SSH Verbindungen oder für HTTPS Verbindungen, man kann ja"}, {"id": 958, "start": 7006.92, "end": 7013.28, "text": "da schon so Analysen machen, so mit so statistische Geschichten mit, was wird der eventuell darüber"}, {"id": 959, "start": 7013.28, "end": 7019.72, "text": "verwenden, du kannst dir gucken, wie oft schickt er was, welche Bandbreite, hat er"}, {"id": 960, "start": 7019.72, "end": 7025.4, "text": "Börs drin oder so, da gibt es schon fertige quasi, ich will das nicht sagen trainierte"}, {"id": 961, "start": 7025.4, "end": 7032.6, "text": "AI, weil das stimmt nicht, aber es gibt schon fertige Verhaltensmuster, die dann anhand"}, {"id": 962, "start": 7032.6, "end": 7036.84, "text": "des Traffics dir ungefähr sagen können, was der macht, ob er es wirklich macht, weißt"}, {"id": 963, "start": 7036.84, "end": 7041.56, "text": "du nicht, weil das ist ja verschlüsselt und du kannst damit auch nicht reingucken, also"}, {"id": 964, "start": 7041.56, "end": 7048.88, "text": "ja, eigentlich bringt es dir das gar nicht und im Heimbereich schon erst recht nicht."}, {"id": 965, "start": 7048.88, "end": 7064.4, "text": "Das sagt, das würde ich ausschalten, das ist eines der ersten Sachen, die ich ausgeschaltet"}, {"id": 966, "start": 7064.4, "end": 7070.44, "text": "habe, dass meine Access Points sich automatisch Channels und so wechseln, das wichtigste was"}, {"id": 967, "start": 7070.44, "end": 7079.04, "text": "man machen kann ist, erstens man muss in seine Unify Controller gehen und diesen automatischen"}, {"id": 968, "start": 7079.04, "end": 7084.16, "text": "Modus ausschalten, der automatische Modus, ich weiß es jetzt leider nicht genau aus dem"}, {"id": 969, "start": 7084.16, "end": 7089.16, "text": "Kopf, der macht einige richtig dumme Sachen, die man nicht haben will, ich bin mir gar"}, {"id": 970, "start": 7089.16, "end": 7092.02, "text": "nicht mal sicher, was das alles gewesen ist, aber es waren ein paar Sachen, die richtig"}, {"id": 971, "start": 7092.02, "end": 7095.6, "text": "dumm waren, die man auf gar keinen Fall haben will, ich weiß es nicht, da müsste ich mir"}, {"id": 972, "start": 7095.6, "end": 7098.44, "text": "jetzt erstmal Gedanken darüber machen, den automatischen Modus muss man auf jeden Fall"}, {"id": 973, "start": 7098.44, "end": 7104.32, "text": "ausschalten und dann würde ich einfach die Access Points so einstellen, dass es passt,"}, {"id": 974, "start": 7104.32, "end": 7111.84, "text": "ich würde die, wenn man es kann, dass man die im Haus quasi so platziert, dass sie sich"}, {"id": 975, "start": 7111.84, "end": 7117.48, "text": "möglichst wenig überlappen und trotzdem das jeweilige Stockwerk abdecken, ist am besten,"}, {"id": 976, "start": 7117.48, "end": 7124.62, "text": "man stellt die Access Points so ein, dass die Sendeleistung gerade so ausreicht, umso"}, {"id": 977, "start": 7124.62, "end": 7129.92, "text": "weniger sich die Access Points ins Gehege kommen und überschneiden umso besser, das"}, {"id": 978, "start": 7129.92, "end": 7138.4, "text": "bei der Fritzbox auch so mit den Auto-Channels, ich hab keine Ahnung, achja jetzt weiß ich"}, {"id": 979, "start": 7138.4, "end": 7148.04, "text": "wieder was es war, genau, was diese Automatik von Unify unter anderem macht ist, wenn du"}, {"id": 980, "start": 7148.04, "end": 7154.6, "text": "2,4GHz und 5GHz hast, das zwingt Geräte, die 5GHz können sich mit 5GHz zu connecten,"}, {"id": 981, "start": 7154.6, "end": 7161.88, "text": "was Müll ist, weil es ist einfach so, dass 2,4GHz WLAN oftmals einfache Durchwende geht,"}, {"id": 982, "start": 7161.88, "end": 7167.64, "text": "das heißt 2,4GHz hat in der Regel eine etwas höhere Reichweite als 5GHz, deswegen ist"}, {"id": 983, "start": 7167.64, "end": 7173.36, "text": "es total bescheuert, die Geräte dazu zu zwingen, sich mit 5GHz zu verbinden, dann hast du beispielsweise"}, {"id": 984, "start": 7173.36, "end": 7184.0, "text": "auf der Terrasse keinen Empfang mehr, obwohl du eigentlich hättest, also das bin ich überhaupt"}, {"id": 985, "start": 7184.0, "end": 7195.56, "text": "kein Fan von, was bringt ein Serverraum zu Hause, naja das bringt, wo du es hinstellst"}, {"id": 986, "start": 7195.56, "end": 7199.72, "text": "ist eigentlich egal, aber wenn die Dinger ein bisschen krach machen, ist es schon mal"}, {"id": 987, "start": 7199.72, "end": 7204.72, "text": "ganz praktisch, wenn du es irgendwo hast mit einer Tür davor, ob du es jetzt Serverraum"}, {"id": 988, "start": 7204.72, "end": 7210.6, "text": "oder Abstellkammer nennst, ist ja egal, du hast mich vor ein paar Tagen auf YouTube"}, {"id": 989, "start": 7210.6, "end": 7217.8, "text": "excellent und sogar den Weg hier in den Stream gefunden, das ist ja absolut, Moment, jetzt"}, {"id": 990, "start": 7217.8, "end": 7227.08, "text": "finde ich das nicht, hier 360 Quickscope, ja schön, dass du da bist, jetzt wo bin ich"}, {"id": 991, "start": 7227.08, "end": 7238.6, "text": "stehen geblieben, die, ah keine Ahnung, wir gucken jetzt einfach weiter, achja 5GHz, 2,4GHz"}, {"id": 992, "start": 7238.6, "end": 7242.92, "text": "wieder, ja also das würde ich nicht machen, das würde ich immer ausschalten, diese automatische"}, {"id": 993, "start": 7242.92, "end": 7261.12, "text": "Optimierung, ich mag, das ist Windows Only, allein schon deswegen wollte ich es nicht"}, {"id": 994, "start": 7261.12, "end": 7262.12, "text": "verwenden."}, {"id": 995, "start": 7262.12, "end": 7282.08, "text": "Kennt ihr auch die Leute, die Cisco Cisco aussprechen, so richtig schön auf Deutsch,"}, {"id": 996, "start": 7282.08, "end": 7290.88, "text": "der Cisco, der Cisco Switch, Shadow sagt, habe auch Bock auf ein Home Lab, aber keine"}, {"id": 997, "start": 7290.88, "end": 7294.84, "text": "Ahnung, was ich darauf installieren soll, dann lass es bleiben, wenn du keine Anwendungszwecke"}, {"id": 998, "start": 7294.84, "end": 7299.2, "text": "hast und nicht irgendwie üben willst zu Just For Fun, dann lass es bleiben, also ich würde"}, {"id": 999, "start": 7299.2, "end": 7304.56, "text": "es immer so rum machen, ich habe eine Idee, ich habe was Sinnvolles, was ich lohnen würde,"}, {"id": 1000, "start": 7304.56, "end": 7310.12, "text": "dann würde ich mir was dazu holen, auf gut Glück da irgendwie jetzt eine Kiste hinstellen"}, {"id": 1001, "start": 7310.12, "end": 7314.6, "text": "und die üblichen Verdächtigen drauf installieren und dann nicht benutzen ist ja sinnlos."}, {"id": 1002, "start": 7314.6, "end": 7321.52, "text": "Wenn man auf Reddit guckt, beispielsweise Subreddit Self Hosted, da siehst du so viele"}, {"id": 1003, "start": 7321.52, "end": 7326.32, "text": "Leute, die fangen an, die stellen sich eine Kiste daheim hin und sagen dann jawoll krasse"}, {"id": 1004, "start": 7326.32, "end": 7330.4, "text": "Self Hosting Geschichte und was machen sie dann am Ende, sie haben zwei Festplatten drin,"}, {"id": 1005, "start": 7330.4, "end": 7334.16, "text": "haben einen Fileserver drauf und irgendwie acht sinnlose Docker Container, die keiner"}, {"id": 1006, "start": 7334.16, "end": 7339.16, "text": "braucht ja und die Hälfte davon sind zur Managen der Infrastruktur, wo es nichts zur"}, {"id": 1007, "start": 7339.16, "end": 7343.48, "text": "Managen gibt, dann haben sie einen Prometheus drauf laufen, dann haben sie einen Portainer"}, {"id": 1008, "start": 7343.48, "end": 7348.32, "text": "drauf laufen, dann haben sie einen Dashboard Generator drauf laufen, dann haben sie einen"}, {"id": 1009, "start": 7348.32, "end": 7354.24, "text": "Wiki drauf laufen, nichts davon benutzen sie, also Hardware einfach um Hardware zu haben"}, {"id": 1010, "start": 7354.24, "end": 7358.24, "text": "ist sinnlos, weil man keinen Anwendungszweck hat, muss man das auch nicht machen, es sei"}, {"id": 1011, "start": 7358.24, "end": 7360.72, "text": "denn man hat Spaß dran und will was lernen, das ist wieder was anderes."}, {"id": 1012, "start": 7360.72, "end": 7377.56, "text": "Die Dinger, wenn es ein Alter ist, was ist ein SG280, ich habe keine Ahnung, ich kenne"}, {"id": 1013, "start": 7377.56, "end": 7387.6, "text": "mich mit Cisco-Produkten nicht aus, die Cisco-Dinger brauchen Strom und sind laut, also ich weiß"}, {"id": 1014, "start": 7387.6, "end": 7391.52, "text": "nicht, ob sich das lohnt, wie es bei dem hier ist, keine Ahnung."}, {"id": 1015, "start": 7391.52, "end": 7397.04, "text": "Du hast auch nur einen Raspberry Pi mit Bitwad, Raspberry Pi ist ja nur ganz anderes Kaliber,"}, {"id": 1016, "start": 7397.04, "end": 7402.04, "text": "da bietet sich das ja auch an, wenn man sich denkt, ich hätte gerne meinen eigenen Passwort"}, {"id": 1017, "start": 7402.04, "end": 7406.52, "text": "save webbasiert, dann einen Raspberry Pi hinstellen, warum nicht, das ist doch sinnvoll, dann hast"}, {"id": 1018, "start": 7406.52, "end": 7410.16, "text": "du einen Anwendungszweck und hast einen Raspberry Pi dafür geholt oder du hattest vielleicht"}, {"id": 1019, "start": 7410.16, "end": 7411.4, "text": "noch einen, das ist ja sinnvoll."}, {"id": 1020, "start": 7411.4, "end": 7415.28, "text": "Wenn du jetzt allerdings sagen würdest, ich stelle mir jetzt irgendwie so eine Kiste hierhin"}, {"id": 1021, "start": 7415.28, "end": 7420.48, "text": "mit 8 Festplatten, nur um danach festzustellen, eigentlich hast du nichts, was du drauf laufen"}, {"id": 1022, "start": 7420.48, "end": 7425.32, "text": "lassen willst, ja dann halte ich das für rausgeschmissenes Geld."}, {"id": 1023, "start": 7425.32, "end": 7443.52, "text": "Was ist denn Monika, personal CRM, ah, das ist für irgendwie Business-Stells, das ist"}, {"id": 1024, "start": 7443.52, "end": 7457.08, "text": "quasi ein Kontaktbuch mit Infos dazu, ok, wenn man sowas braucht, ich habe eh keine"}, {"id": 1025, "start": 7457.08, "end": 7468.08, "text": "Freunde, insofern brauche ich das nicht, ich habe keine Freunde, keine Bekannte, das brauche"}, {"id": 1026, "start": 7468.08, "end": 7479.04, "text": "ich alles nicht, ja das war jetzt ein bisschen übertrieben, aber für die paar Leute, mit"}, {"id": 1027, "start": 7479.04, "end": 7481.4, "text": "denen ich mich gut verstehe und die ich kenne, brauche ich sowas nicht."}, {"id": 1028, "start": 7481.4, "end": 7508.08, "text": "Und jetzt schlecht, 512G RAM und was macht er damit?"}, {"id": 1029, "start": 7508.08, "end": 7524.12, "text": "Achso, Combined, ok, was hat er alles für VMs laufen, was macht er da drauf?"}, {"id": 1030, "start": 7524.12, "end": 7532.6, "text": "Der hat bestimmt auch seinen eigenen Kubernetes-Cluster, wo dann am Endeffekt ein Doku-Wiki drauf läuft"}, {"id": 1031, "start": 7532.6, "end": 7538.76, "text": "oder irgendwie sowas und bei Doku-Wiki lässt sich erstaunlich schlecht Kubernetes-ieren,"}, {"id": 1032, "start": 7538.76, "end": 7549.68, "text": "weil File Storage und MySQL Datenbank, da gibt es dankbare Dinger, hat er tatsächlich"}, {"id": 1033, "start": 7549.68, "end": 7552.84, "text": "ja, das wundert mich nicht, aber wahrscheinlich hat er darauf gar nichts sinnvolles laufen."}, {"id": 1034, "start": 7552.84, "end": 7566.6, "text": "Was?"}, {"id": 1035, "start": 7566.6, "end": 7575.56, "text": "conversion server mein was it still has the laser beam light you don't want to look directly in"}, {"id": 1036, "start": 7575.56, "end": 7581.48, "text": "that because it'll blind you but i converted this pc a long time ago using a chin bro server case"}, {"id": 1037, "start": 7581.48, "end": 7587.32, "text": "so this server used to run proxmox along with a few vms and had my gpus in it but since then i've"}, {"id": 1038, "start": 7587.32, "end": 7599.48, "text": "repurposed it to a plain old ubuntu server with a large zfs pool so this does local backups of almost"}, {"id": 1039, "start": 7599.48, "end": 7604.44, "text": "everything on my network and keeps a local copy of it here just in case i need to restore it"}, {"id": 1040, "start": 7610.44, "end": 7615.56, "text": "everything from the cloud i scheduled to boot up at night and then shut down about 30 minutes later"}, {"id": 1041, "start": 7615.56, "end": 7618.68, "text": "i use syncthing to sync most of my data to it"}, {"id": 1042, "start": 7618.68, "end": 7622.76, "text": "der soll mal die auslastung von der kiste zeigen ja wird mich auch interessieren wahrscheinlich"}, {"id": 1043, "start": 7622.76, "end": 7624.28, "text": "2 prozent oder so"}, {"id": 1044, "start": 7624.28, "end": 7629.64, "text": "but i might have something coming in the future to replace it so i haven't done that yet but really"}, {"id": 1045, "start": 7629.64, "end": 7636.28, "text": "this is just a second copy of my data that's on prem that i can restore if i need to so below"}, {"id": 1046, "start": 7636.28, "end": 7643.24, "text": "this is my disk shelf so this is the same disk shelf i bought on ebay about a year ago i was lucky"}, {"id": 1047, "start": 7643.24, "end": 7648.04, "text": "enough to snag one before chia farming became a thing because after that sellers were charging 5x"}, {"id": 1048, "start": 7648.04, "end": 7653.16, "text": "when i paid for it i still have six eight terabyte iron wolf drives in here in the raid d2"}, {"id": 1049, "start": 7653.72, "end": 7658.92, "text": "and i have one ssd in here for cash although i don't think i have it configured properly"}, {"id": 1050, "start": 7658.92, "end": 7664.36, "text": "but it's there now this is connected to an hba controller over an odd sas mini cable that"}, {"id": 1051, "start": 7664.36, "end": 7673.56, "text": "ah das ist doch das ist quasi doch so art sas extension hier okay das dachte ich mir dass"}, {"id": 1052, "start": 7673.56, "end": 7682.6, "text": "das so verboten ist ja so not much is changed there i am quickly running out of space virtualisiert"}, {"id": 1053, "start": 7682.6, "end": 7689.08, "text": "des trunas das wird dem das wird dem dem dem forum aber bestimmt nicht gefallen also es gibt"}, {"id": 1054, "start": 7689.08, "end": 7695.56, "text": "zwei forren wo ganz viele idioten unterwegs sind die sich super für super elite und die besten auf"}, {"id": 1055, "start": 7695.56, "end": 7702.6, "text": "der welt halten das ist einmal das microcontroller forum und das ist das frinas forum oder das frinas"}, {"id": 1056, "start": 7702.6, "end": 7709.8, "text": "reddit ist es glaube ich eher das ist so ein wie sagt man so schön bald amis circle jerk in diesem"}, {"id": 1057, "start": 7709.8, "end": 7729.56, "text": "forum meine güte also ich hatte ja auch mal meine anfälle in dieser richtung ja mit zfs pool und"}, {"id": 1058, "start": 7730.2, "end": 7734.6, "text": "raid geschichten mit zig großen festplatten wisst ihr wo ich jetzt angekommen bin ich bin"}, {"id": 1059, "start": 7734.6, "end": 7741.48, "text": "jetzt angekommen bei einer laub laub power intel x86 kiste habe ich in altes also in"}, {"id": 1060, "start": 7741.48, "end": 7754.76, "text": "den billiges 2 he case gesteckt mit einer 12 terabyte platte dran und einem usb auf sata wo"}, {"id": 1061, "start": 7754.76, "end": 7764.68, "text": "nachts einmal erst und läuft also ich bin von 100 prozent übertrieben zu 0815 gegangen weil es einfach"}, {"id": 1062, "start": 7764.68, "end": 7772.2, "text": "vom handling her und von der verwaltung her viel einfacher ist 12 terabyte reichen mir wozu mehr"}, {"id": 1063, "start": 7772.2, "end": 7777.64, "text": "ja wenn man sich mal gedanken macht was man in backups braucht dann ist das meistens gar nicht"}, {"id": 1064, "start": 7777.64, "end": 7785.0, "text": "so viel weil man sich wirklich wichtigen dinger nimmt und dann machst du einmal nachts in ersynch"}, {"id": 1065, "start": 7785.0, "end": 7791.88, "text": "und gut ist das ist die nuke variante ich weiß aber die ist am einfachsten zu handeln"}, {"id": 1066, "start": 7791.88, "end": 7805.28, "text": "ja bei den amis ist das strom ja auch billiger"}, {"id": 1067, "start": 7805.28, "end": 7822.28, "text": "dafür muss es reicht ja auch für die usb"}, {"id": 1068, "start": 7835.28, "end": 7845.44, "text": "und nur 110 volt statt 230 gut das macht ja jetzt kein unterschied 430 watt sind 430 watt"}, {"id": 1069, "start": 7845.44, "end": 7847.6, "text": "egal aus was sich das zusammensetzt"}, {"id": 1070, "start": 7847.6, "end": 7868.4, "text": "okay mich würde ja echt interessieren was er da wirklich so high ausfallssicheres business"}, {"id": 1071, "start": 7868.4, "end": 7883.44, "text": "stellster macht okay was hat er hier das kippen wir jetzt auch noch schnell durch was haben die"}, {"id": 1072, "start": 7883.44, "end": 7891.92, "text": "da immer für riesen dinger alle ich habe mein sech mein was hat mein ich glaube 12 15 he hat"}, {"id": 1073, "start": 7891.92, "end": 7898.68, "text": "meins glaube ich 15 he und es reicht nicht dicke aber es reicht"}, {"id": 1074, "start": 7898.68, "end": 7918.68, "text": "okay zeig ja ist das eine telefonanlage sehe ich das richtig ist das wirklich eine hat er"}, {"id": 1075, "start": 7918.68, "end": 7922.52, "text": "eine telefonanlage"}, {"id": 1076, "start": 7922.52, "end": 7951.8, "text": "warum hat man seine eigene telefonanlage"}, {"id": 1077, "start": 7951.8, "end": 7955.68, "text": "was stehen die alle also dieses ding spricht mich überhaupt nicht an"}, {"id": 1078, "start": 7955.68, "end": 7981.48, "text": "er hat aber einen guten switch unten drunter"}, {"id": 1079, "start": 7985.68, "end": 7993.04, "text": "endlich man of culture der weiß bescheid"}, {"id": 1080, "start": 7993.04, "end": 8008.0, "text": "übrigens die benahmung ist tatsächlich richtig gut bei mikrotik also crs weiß man es ist ein"}, {"id": 1081, "start": 8008.0, "end": 8015.92, "text": "router switch ich glaube das c steht für cloud es ist ein router switch das erkennt man an rs 317"}, {"id": 1082, "start": 8015.92, "end": 8020.88, "text": "sind ist glaube ich einfach die die produkt bezeichnung was auch immer da hast du einen"}, {"id": 1083, "start": 8020.88, "end": 8027.0, "text": "1 gigabit port und 16 sfp plus 10 gigabit ports also das ist tatsächlich mal eine"}, {"id": 1084, "start": 8027.0, "end": 8043.44, "text": "produktbeschreibung also diese benahmung und nummern bei mikrotik die irgendwie sinn ergeben"}, {"id": 1085, "start": 8043.44, "end": 8060.48, "text": "jetzt erklärt dass er noch mal der gigabit port ist der hier muss 10 g kann man nicht"}, {"id": 1086, "start": 8060.48, "end": 8076.44, "text": "genug haben"}, {"id": 1087, "start": 8076.44, "end": 8081.6, "text": "ich habe jetzt sechs wochen frei weil ich den gesamten december urlaub habe wie immer ich habe"}, {"id": 1088, "start": 8081.6, "end": 8085.68, "text": "dieses jahr nicht viel urlaub gehabt dazu kommt bei mir ich muss ja auch nur vier tage die woche"}, {"id": 1089, "start": 8085.68, "end": 8090.96, "text": "verarbeiten deswegen brauche ich auch nicht so viel urlaub oder frazier ist gerade angekommen"}, {"id": 1090, "start": 8090.96, "end": 8095.28, "text": "brauche ich auch nicht so viel urlaub also ich bekomme nicht so viel oder braucht aber auch nicht"}, {"id": 1091, "start": 8095.28, "end": 8100.2, "text": "so viel urlaub also sowohl zu nehmen für den ganzen december dass ich december voll kriege als auch"}, {"id": 1092, "start": 8100.2, "end": 8108.08, "text": "insgesamt weil ich ja immer drei tage am stück dann frei habe mich nicht"}, {"id": 1093, "start": 8108.08, "end": 8130.88, "text": "das finde ich gut das finde ich tatsächlich mal sinnvoll besser besser als die rgb anzeige von dem"}, {"id": 1094, "start": 8130.88, "end": 8149.24, "text": "anderen ja das ist ja auch kein router von der von der cpu da drinnen aber was macht er denn"}, {"id": 1095, "start": 8149.24, "end": 8153.64, "text": "für super super krasses routing basis daheim dass er das mit der mit dem mit der kiste nicht"}, {"id": 1096, "start": 8153.64, "end": 8174.4, "text": "machen kann der hat auch kvm da drin nicht schlecht also der macht es richtig"}, {"id": 1097, "start": 8184.64, "end": 8195.32, "text": "das sieht aus wie hp von den von den farben her ich verwechsel manchmal hp und dell von"}, {"id": 1098, "start": 8195.32, "end": 8202.92, "text": "den farben also früher hattest du im prinzip ibm und hp die konnte super auseinander halten die"}, {"id": 1099, "start": 8202.92, "end": 8208.72, "text": "ein waren eher so blau schwarz und die hier waren schwarz rot und dell ist eher so silber aber"}, {"id": 1100, "start": 8208.72, "end": 8213.6, "text": "manchmal habe ich das gefühl bei dell ist auch ein bisschen rot dran"}, {"id": 1101, "start": 8213.6, "end": 8240.64, "text": "was ist es eigentlich für eine big brain aktivitätsanzeige hier vorne dran"}, {"id": 1102, "start": 8243.6, "end": 8263.28, "text": "was für festplatten hat er da drinnen für 20 dollar terabyte oder so mehr kann es ja nicht"}, {"id": 1103, "start": 8263.28, "end": 8287.12, "text": "sein das ist ganz wichtig dass es auf dem netzberg storage liegt dies die library weil man seine"}, {"id": 1104, "start": 8287.12, "end": 8292.84, "text": "steam library auch sicherlich auf mindestens 20 rechnern im ganzen haus braucht dazu kommt"}, {"id": 1105, "start": 8292.84, "end": 8298.04, "text": "das ist jetzt ihr nicht mal schert ist das heißt es ist dann trotzdem nur noch an ein rechner gebunden"}, {"id": 1106, "start": 8298.04, "end": 8323.2, "text": "ok weil es geht weil es geht wahrscheinlich einfach wie groß ist der channel eigentlich"}, {"id": 1107, "start": 8328.04, "end": 8338.8, "text": "würde ich auch nehmen also super micro wenn ihr wollt dass ich eure systeme mal im stream"}, {"id": 1108, "start": 8338.8, "end": 8365.36, "text": "vorstelle dann schickt mir auch ein rüber"}, {"id": 1109, "start": 8365.36, "end": 8371.12, "text": "das gleiche gilt für mikrotik auch ja also wenn ihr mir switch schicken wollt ich im stream"}, {"id": 1110, "start": 8371.12, "end": 8395.0, "text": "vorstelle einfach immer her damit ja nehme ich alles ist das ist das die ami aussprache von"}, {"id": 1111, "start": 8395.0, "end": 8405.92, "text": "zeus sus sus die kritik hier pm als adresse klar das geht so einfach mal über den chat"}, {"id": 1112, "start": 8405.92, "end": 8430.24, "text": "ja ja ja das das stimmt das stimmt schienen sind sie nicht ok und was soll das jetzt"}, {"id": 1113, "start": 8435.92, "end": 8455.88, "text": "ja das ist ja schön und gut aber nur was ist ja die frage ich lasse mir das durchaus"}, {"id": 1114, "start": 8455.88, "end": 8461.52, "text": "gefallen dass das ein guter deal für den preis aber für was also was willst du damit"}, {"id": 1115, "start": 8461.52, "end": 8470.24, "text": "machen und wie sieht es letztendlich im stromverbrauch aus für home lab halt ja home lab ist ja nicht"}, {"id": 1116, "start": 8470.24, "end": 8478.52, "text": "sagen was willst du da laufen lassen ich frage mich was die alle machen mit diesem zeug ich"}, {"id": 1117, "start": 8478.52, "end": 8486.12, "text": "meine ich bilde mir schon ein dass ich relativ sag mal so eher so im enthousiasten segment"}, {"id": 1118, "start": 8486.12, "end": 8490.64, "text": "unterwegs bin was ich hier an technik daheim habe aber ich wüsste bei bestem will nicht"}, {"id": 1119, "start": 8490.64, "end": 8502.76, "text": "was ich daheim in so einem rack machen sollte ich meine man es einfach nur hat zum ausprobieren"}, {"id": 1120, "start": 8502.76, "end": 8517.2, "text": "zum basteln ist ja schon cool ja sage ich ja gar nichts dagegen"}, {"id": 1121, "start": 8517.2, "end": 8541.88, "text": "ja die hat er bestimmt auf ebay gekriegt ja nee also es ist cool so was zu haben aber"}, {"id": 1122, "start": 8541.88, "end": 8547.68, "text": "es ist jetzt nicht so als als bräuchtest du das wirklich daheim das ist schon cool wenn"}, {"id": 1123, "start": 8547.68, "end": 8551.64, "text": "du sowas drin hast dann brauchst du aber auch die passende verkabelung natürlich so dass"}, {"id": 1124, "start": 8551.64, "end": 8560.0, "text": "es an den servanten dran ist dass du es einfach nur mit switch auswählen musst aber ansonsten"}, {"id": 1125, "start": 8560.0, "end": 8568.24, "text": "du kannst dich daheim auch einfach ganz normal per tastatur anstöpseln einfach monitor obendruf"}, {"id": 1126, "start": 8568.24, "end": 8573.56, "text": "stellen und per tastatur anstöpseln das ist ja kein richtiges recht oder man kauft sich"}, {"id": 1127, "start": 8573.56, "end": 8584.32, "text": "für 100 euro so eine so remote kvm den stöpseln man an und geht per browser drauf oder aber"}, {"id": 1128, "start": 8584.32, "end": 8588.68, "text": "nachdem es ja fast alles eh ordentliche kisten sind haben die auch ein management interface"}, {"id": 1129, "start": 8588.68, "end": 8606.64, "text": "ja das stimmt schon aber also das wäre das letzte was ich mir fürs rack kaufen würde"}, {"id": 1130, "start": 8606.64, "end": 8609.24, "text": "ehrlich gesagt dann müsste ich schon alles andere haben"}, {"id": 1131, "start": 8609.24, "end": 8629.72, "text": "also bei den amis muss strom wirklich billig sein dass du das machen kannst"}, {"id": 1132, "start": 7637.84, "end": 8661.44, "text": "deutschland freuten sich die meisten leute freuen über 50 mbit upload"}, {"id": 1133, "start": 8661.44, "end": 8681.4, "text": "plex ist für die sammler"}, {"id": 1134, "start": 8681.4, "end": 8689.64, "text": "dienst weht was wollen die dann darauf spielen"}, {"id": 1135, "start": 8689.64, "end": 8714.48, "text": "die zeichnen"}, {"id": 1136, "start": 8714.48, "end": 8723.28, "text": "wie kommt das bild von dort zum klein so dass man damit ordentlich spielen kann"}, {"id": 1137, "start": 8723.28, "end": 8744.88, "text": "das geht nicht das läuft nicht unter so stimmt hat nicht gesagt dass es dass es linux ist"}, {"id": 1138, "start": 8744.88, "end": 8749.56, "text": "muss ja linux muss ja windows drauf sein weil gaming und so ja stimmt nur aber trotzdem"}, {"id": 1139, "start": 8749.56, "end": 8765.08, "text": "ja logisch leute es muss windows sein sagt klar wenn es spiele sind"}, {"id": 1140, "start": 8765.08, "end": 8769.76, "text": "parsec läuft der server läuft aber nicht unter linux du kannst dich von linux aus glaube"}, {"id": 1141, "start": 8769.76, "end": 8772.88, "text": "ich nur connecten zumindest war es das letzte mal so wo ich es ausprobiert habe"}, {"id": 1142, "start": 8772.88, "end": 8782.08, "text": "ok das ding brauchst erst mal zwei leute ums hoch zu heben"}, {"id": 1143, "start": 8782.08, "end": 8791.28, "text": "so schlimm ist es nicht aber aber ich denke mal so 25 kilo oder so 25 30 kilo hat die"}, {"id": 1144, "start": 8791.28, "end": 8820.0, "text": "hat die ups usw bestimmt"}, {"id": 1145, "start": 8820.0, "end": 8849.12, "text": "das brauche ich habe sie was"}, {"id": 1146, "start": 8849.12, "end": 8854.92, "text": "wie macht er das überhaupt wie macht er das überhaupt warum läuft das überhaupt ohne"}, {"id": 1147, "start": 8854.92, "end": 8859.12, "text": "rgb strip dachte das ist essentiell"}, {"id": 1148, "start": 8859.12, "end": 8865.84, "text": "also da könnte noch ein bisschen performance rausholen"}, {"id": 1149, "start": 8865.84, "end": 8886.24, "text": "ist das ist das die sehr konditioner hier oder hier die klimaanlage"}, {"id": 1150, "start": 8886.24, "end": 8887.24, "text": "kann ich mir vorstellen"}, {"id": 1151, "start": 8887.24, "end": 8895.96, "text": "die klimaanlage braucht aber auch noch fucking viel strom also dort wo der wohnt muss der"}, {"id": 1152, "start": 8895.96, "end": 8896.96, "text": "strom echt billig sein"}, {"id": 1153, "start": 8896.96, "end": 8916.52, "text": "was ist ein 80 degrees fahrenheit in celsius gibt es das gibt es das vielleicht in nicht"}, {"id": 1154, "start": 8916.52, "end": 8917.52, "text": "springt im units"}, {"id": 1155, "start": 8917.52, "end": 8925.84, "text": "26 grad ok es ist trotzdem relativ warm"}, {"id": 1156, "start": 8925.84, "end": 8953.16, "text": "kann man aber machen ist in ordnung"}, {"id": 1157, "start": 8953.16, "end": 8958.52, "text": "das auch immer"}, {"id": 1158, "start": 8958.52, "end": 8961.52, "text": "ok warum nicht kann man machen"}, {"id": 1159, "start": 8961.52, "end": 8965.32, "text": "lass mal kurz gucken was der friseur spielt bestimmt komische mobile web games"}, {"id": 1160, "start": 8965.32, "end": 8985.6, "text": "strom wieder hier der friseur ich werde jetzt den friseur horsten und ins bett gehen"}, {"id": 1161, "start": 8985.6, "end": 8989.6, "text": "könnt ihr ihn kurz voll spammen und wer sich web games angucken will kann da bleiben und"}, {"id": 1162, "start": 8989.6, "end": 8996.04, "text": "wer nicht kann er wieder aufgehen aber ich gehe jetzt ins bett geleute wir sehen uns"}, {"id": 1163, "start": 8996.04, "end": 9023.48, "text": "machts gut bis dann see you"}]}