{"text": "So, da bin ich ja mal gespannt. Gucken, ob Teams wieder irgendwas umgestellt hat. Weiß ja nie. Passt alles, exellent. Gut, äh gut, den YouTube-Chat müssen wir uns hier angucken. Wir können, 23 Minuten geht das ganze los. Ich muss mir ja gerade mal noch ein bisschen was entspannenderes suchen. Hallo, YouTube? YouTube hat keinen Bock. Grip. Irgendwas. Wupp, wupp, wupp. Genau. So. 23 Minuten. Ähm, gibt es denn schon, da müssen wir mal gucken, gibt es irgendwelche Predictions schon? Lass wir mal gucken, was davon stimmt. Predictions. Gucken wir mal. Was da die Leute prediktet haben. Allerdings, äh, wobei, weißte was, wir gucken auf Reddit, auf Reddit sind die bei sowas immer eher auf Zack. Oh, ein bisschen kleiner machen wir noch, schieben es ein bisschen in die Ecke. So. 5000er-Series, ja, davon geht man, geht man ja wirklich überall schon aus. Okay, das ist kein Livestream, auch wenn die so tun, aha, ist das so? Na gut, steht überall live, letztendlich ist es wurscht, wir sehen es ja alle zeitgleich. Also egal, ob das ein Livestream ist, ob da irgendwie einer, eine ist es ja, bei AMD auf der Bühne steht und erzählt wie Super Amazing noch nie da gewesen und Katiosi reCPU sind, oder ob das recorded ist, ist mir ehrlich gesagt ziemlich wurscht. Gibt es da irgendwelche Predictions? Weil der gelingen hat, muss ich mir gerade nochmal die aktuellen AMD Desktop CPUs angucken, weil ihr wisst ja, ich bin jetzt nicht der Wahnsinns-CPU-Guru, was das angeht, also ich kann euch nicht, äh, anhand des, der Pin-Belegung von hinten sagen, was das für eine CPU ist oder sowas, wobei die Pins sehen eigentlich überall gleich aus. Na, ihr wisst, was ich mein. Ich weiß, was ich missen muss und ich kenne mich immer nur aus, wenn ich mir einen neuen PC kaufe und aktuell kann ich mir keinen neuen PC kaufen, weil ich bekomme erstens keine neue Grafikkarte und zweitens gibt es keine CPU, die mir was bringt. Also, zeig mal hier, äh, nee, Threadripper, das brauchen wir nicht, Ryzen, Brauma, so, das sind die aktuellen, 7, 7, 9, 5, die 3 sind jetzt nicht so, nicht so spannend, genau, was hatten sie? Also, ich muss ehrlich sagen, die Intel-Seite finde ich deutlich übersichtlicher, was CPU-Vergleiche angeht. Jetzt bei AMD ist es ein bisschen, ähm, bisschen, ja, nicht so schön übersichtbar, bei Intel suchst du zum Beispiel nach einem 8700K, so, dann kommst du auf diese Seite hier und hast alles da. Sowas, ich meine, die AMD-Seite sieht schicker aus, ja, aber das, äh, so finde ich das schon angenehmer. Wahrscheinlich haben die auch sowas. Hitopipo, oh, wobei, das, das müssen wir gerade mal probieren, ob mein Text-to-Speech das hinbekommt. Hitopipo zu sagen, mein Text-to-Speech kackt ja, kackt ja manchmal ganz gerne ab. Also, äh, Text-to-Speech, Hitpipo, Hyper-Subscriber-Big-Brain, Hitpipo, okay, oh, ich hab's gecrasht, Leute, RIP, ja, das ist ein bisschen verbuggt seit, seit, äh, ja, Jahren quasi schon, aber, äh, ich hab, war besser zu faul, das zu fixen, Hitpipo, jetzt, pass auf, das funktioniert, Hitpipo, Hitdo, Hyper-Subscriber-Big-Brain, Hitpipo, ohje, ne, das ist nix, aber Hit ist schon mal richtig, Hit ist schon mal, okay, äh, mh, das hört sich aber nicht gut an, h'haha, okay, wir kommen in die Nähe, fast, fast, das ist okay, es geht, es geht, na ja, ok, also, die, die, das ist ja auch, das ist ja auch kein japanisch Text-to-Speech-Service, Text-to-Speech-Service, das ist ja auch ein koreanischer Text-to-Speech-Service, glaube ich, ne? Keine Ahnung, dass die das nicht kann. Vielleicht soll man das so machen, Pippo. Pippo. Pippo. Pippo. Pippo. Funktioniert nicht so wirklich gut, wie ich mir das vorgestellt hab. Pippo. Pippo. Hito Pippo. Ja, ja, das ist gar nicht so, gar nicht so, gar nicht so, so schlecht. Hito Pippo. Ja, das ist okay, das ist nicht schlecht. Hört sich jetzt zwar eher an, wie Hito Pippo. Das ist um 18 Uhr geht es los. Hier, guckt, da, Moment, ich hab sie auf. 18 Minuten. YouTube Chat versucht, sein bestes Twitch Chat zu sein, aber YouTube Chat ist einfach unterlegen. Das wissen wir ja. Hito Pippo. Hito Pippo. Hito Pippo. Hito Pippo. Nee, das hört sich alles dumm an. Hito Pippo. Mein Chat-Overlay ist aus. Ja gut, das kann ich anmachen, aber wenn die Übertragung anfängt, müssen wir das Ganze wieder, müssen wir das eh ausmachen. Hito Pippo. Hito Pippo. Das ist so dumm, Alter. Hito Pippo. Piss dich also. Hito Pippo. Ich muss mal, Moment, ich muss die Emotes mal ein bisschen kleiner machen. Bisschen wegschieben. Excellent. So ist gut. So, jetzt haben wir die AMD-CPUs hier mal. Kurz reingucken, dass ich so ungefähr... Hier ist es kaputt. Geht wieder. Dass ich so ungefähr einen Plan habe von dem, was die gleich erzählen. Bist du wirklich 36? Tja, wir werden es nie rausfinden. Nutella mit oder ohne Butter? Ohne mit Butter ist Pepega-Style, das ist eklig. So, Chat, also, wen haben wir denn hier am Start? Marc Yoyo wieder da, Captain Peng, Muscle Plays, der Titan Toaster. Übrigens, wo bleibt eigentlich mein Toaster? Ich hab den Toaster bestellt und angeblich sollte der heute ankommen. Was sagt denn Amazon dazu? Moment, Moment, muss ich mal kurz nebenbei gucken. Ankunft heute bis 20 Uhr. Hermes! Hermes, muss das sein? Also, Hermes ist ja... Nee. Nee, nee, Hermes ist ja die schlimmste Versandoption, die es irgendwie gibt. So, ähm, der Knäber ist auch am Start, Tribulon haben wir auch, der Flow 690 ist da. Herz 93, El Mustafa ist da, wenn den Herr... Nee, hatten wir schon, der Phipps ist da. Cheat 95, Max Rolls, King Wall. Ja, viele der üblichen Verdächtigen wieder am Start. Ich bin echt gespannt, was AMD vorstellt, weil ihr wisst ja, dass ich mir eigentlich seit letztem Jahr schon einen neuen PC kaufen will. Und es sich einfach nicht lohnt aktuell. Und ich ja drauf spekuliere, dass es sich vielleicht mit einer neuen Grafikkarte, also mit einer neuen Nvidia-Grafikkarte, ich glaube nicht, dass AMD irgendwie da was raushaut, was da Konkurrenz macht bei Nvidia, dass ich dann mit einem 5950X plus 13090 mal endlich einen sinnvollen Upgradeweg habe, der sich auch lohnt. Weil bisher, ich habe eine 1080 CI und 8700K und den habe ich übertaktet ein bisschen. Aktuell gibt es schlicht und ergreifend nichts, was nennenswert schneller wäre. Du findest zwar was mit massig viel Kern, was im Benchmark schneller ist und sowas, aber in praktischer Anwendung macht das alles keinen Unterschied. Max, du bist einfach immer noch der geilste, weil du damals meine Rollstuhl-Hater-Jokes instant ver- Ach du bist der Rollstuhl-Hater, nice. Bester Rollstuhl-Hater. Na gut, es gibt auf YouTube viele Leute, die verstehen absolut nicht, wenn einer irgendwie einen Witz macht, ohne direkt zu sagen, dass es ein Witz ist. Also YouTube-Homor geht so, nur Leute ist das lustig. Und ansonsten kapieren die Leute das nicht, wenn du das auf YouTube machst. Genshin Impact getestet, ne. Ich habe mir einen Account, oder besser gesagt, ich wollte mir einen Account machen. Aber ich habe mir keinen Account gemacht. Der Fabian spielt das ja gerade rauf und runter. So, also ich musste mal gucken, was aktuell einen 3.150X hat. Eine Sache, die ich auch merkwürdig finde, warum haben die 4.000 übersprungen? 4.000 waren Notebook-CPUs, das wollten sie wohl nicht verwenden. Und außerdem haben sie sich gedacht, dass sie das nicht verwenden wollen. Und die können auch auf 50 Versionen überspringen, da können wir einfach auch mal 1.000 überspringen. Das ist gar kein Problem. Was? Valorant ist tot, warum das denn? Das kann ich mir gar nicht vorstellen. Das letzte Mal, wo ich Valorant auf Twitch geguckt habe, war das noch ziemlich alive. Zeig mal, Browse. Ja, also, ich würde es jetzt nicht unbedingt als tot bezeichnen, wenn es in Regionen wie Apex, Minecraft und Noter II schwebt. Mein Gut mag kein League of Legends sein und es mag jetzt kein Fortnite sein, von der Beliebtheit her. Und auch kein CS und Warzone, aber tot ist es nicht. Aber es ist nicht tot, es ist nicht tot, es ist nicht tot. Und es ist nicht tot, es ist nicht tot, es ist nicht tot. Wie kommst du zu der Annahme, was will Twitch eigentlich von mir? Ich bin überhaupt nicht eingeloggt, Twitch. Jaja, ist alles klar. Na natürlich. Prime Gaming. Also ich hab seit 2000, drei oder so, Prime, Ewig. Ich hab Prime seit es Prime gibt. Noch nicht komm, aber warum sollte, warum sollte es noch nicht kommen von Twitch? Ich hab Prime, seit es Prime gibt noch nicht Kombi, aber warum sollte Valorant in deiner Meinung nach tot sein? Es gibt ab und zu mal Turniere, nicht mal so viel wie in der Beta, muss ich sagen, ich verfolge das auch noch am Rande aktuell. Es gibt immer mal wieder neue Teams, es gibt sogar so eine Art Profi-Spieler, die damit zumindest Geld verdienen, also so tot sieht das nicht aus. Wenn du ein totes Spiel sehen willst, dann musst du die Overwatch angucken, weil Overwatch ist ja nun wirklich, nein, Overwatch ist genauso wenig tot, aber im Vergleich zum Potential, was das Game eigentlich ist, Overwatch irgendwie RIP. Prime, Massive Subscription hier, ganz schön Sneaky, reingestellt die Subscription, Dankeschön. Die warten halt auf Teil 2, Blizzard hat es mit Overwatch total verkackt, die haben richtig gut gestartet und dann ihre Blizzard-Taktik gemacht. Die Blizzard-Taktik ist, wir wissen es besser als alle anderen, scheißen auf das was die Leute sagen und bringen Patches raus, die jenseits von Gut und Böse Sachen machen. Die Blizzard-Taktik ist, bleiben wir mal bei einem einfachen Beispiel, es gibt ein Spiel mit drei Klassen, egal welche Klassen, eine Klasse davon ist total OP. Die Blizzard-Taktik ist, die anderen beiden ein bisschen zu buffen und dann drei von fünf Fähigkeiten der OP-Klasse komplett uses zu machen, sodass die Klasse nach dem Patch von der besten Klasse zu der mit Abstand schlechtesten Klasse wird. Das ist die Blizzard-Taktik. Das haben die schon gerne, das haben die anderen Games auch schon gerne gemacht. So und dieses Holzhammer-Balancing mit teilweise monatelangem Schweigen haben sie halt in Overwatch am Anfang lange gemacht, mittlerweile ist das besser, aber das haben die halt angefangen als Overwatch schon irgendwie auf dem Absteigen nass war, dazu kommt, dass die viel zu wenig das ganze, ich meine, es klingt jetzt blöd wenn ich sage, aber ich bin der Mann, die haben es zu wenig ausgeschlachtet. Overwatch hatte so einen krassen Hype als rausgekommen ist, das war ja auch das erste Spiel so dieser Art, es gab danach noch ein bisschen mehr Hero Shooters und sowas, aber die hätten das so krass ausschlagen müssen, die haben ab und zu mal einen Kurzfilm rausgebracht, ab und zu mal einen Comic rausgebracht, die hätten da übelst abgemissen, die hätten eine Web-Series machen müssen, eine Live-Action-Serie machen müssen, Comic-Bücher releasen, laufen irgendwie Geschiss machen, es müssen laufen Maps, Helden, Patches, alles möglich kommen, du musst das Gefühl haben, dass sich der Overwatch-Content wenn du schlafen gehst umhaut, wenn du wieder aufstehst. So ein bisschen wie die das seit Jahren in LoL machen, vielleicht auch nicht, naja, da... chat, das müsste, ich glaube, das würden wir nicht von Blizzard sehen, offiziell LoL von Warchenta als Eparo, aber die anderen Sachen, die hätten da übelst mehr, die hätten viel mehr machen müssen und nicht teilweise, wir machen nen Patch, buffen irgendwas übertrieben Und und und machen was total kaputt und dann halten wir sechs monat die klappe und äußern uns gar nicht mehr dazu Also irgendwie haben sie es voll verschissen, aber es ist besser geworden allerdings ist jetzt die ist dazu glaube ich abgefahren dazu kommt dazu kommt dass die Overwatch League Also meiner meiner mann nach ich fand das Konzept von der Overwatch League von Anfang an kacke In gewissen erfolg hat das ganze also man kann jetzt nicht sagen ich kann jetzt nicht sagen max ich hab's von Anfang an gesagt das stimmt nicht ich hab ich hab eher das ganze schlechter voraus gesagt als es gelaufen ist mit der Overwatch League Alter was ist denn mit dem Chat Schluss? Youtube Chat beruhigt euch mal Genau ich wollte mal kurz die CPU angucken die also das ist ja die wo ich geliebäubig hab mir die zu kauf aber es dann sein lassen hab weil es kein richtiges Upgrade war für die Anwendungszwecke die ich hab So Genau ich wollte noch ein lass mich doch mal einen Satz zum thema Overwatch und Overwatch League sagen Wie gesagt die Overwatch League das ist ein bisschen besser gelaufen als ich mir das ausgemalt habe am Anfang aber insgesamt ist die Overwatch League trotzdem eSport mäßig Also generell eSport mäßig ist Overwatch kompletter fail die haben eine so so so eine franchise league gemacht wo sie alles unter unter Kontrolle haben Aber schon so sehr unter Kontrolle haben dass es finde ich einfach extrem langweilig ist So dazu kommt dass der ganze kram jetzt auf Youtube ist und dass sie es ewig gebraucht haben bis sie das Spiel mit eSport Content verbunden haben die haben ewig gebraucht bis die bis die die Overwatch League beworben haben überhaupt richtig Ewig gebraucht bis die in Game Skins und Geschiss rausgebracht haben das hat das hat teilweise ewig gedauert Du hättest im Hintergrund auf dem Startbildschirm direkt auch schon früher Matches promoten müssen und das größte Problem an Overwatch eSport ist wo man sieht dass das eigentlich nur mit viel viel Geld aufgeblasen ohne was dahinter ist sieht man daran dass es Keinerlei Tier 2 und Tier 3 gibt Und es gibt Tier 2 und Tier 3 Teams aber keine nennenswerte Competition keine nennenswerte Turniere kein nennenswertes irgendwas so und Ich meine was sagt uns das es gibt eine offizielle league wo es theoretisch auch ein bisschen Kohle zu holen gibt Aber es gibt nichts an Tier 2 und Tier 3 das sagt mir dass das künstlich aufgeblasener kram ist Guckt euch mal CS an CS ist voll CS hast du nicht nur die die es Teams du hast du hast Tier 2 Tier 3 Tier 4 es gibt ja teilweise sogar wenn du CS anguckst deutsche Leaks und sonst was ich habe keine ahnung das ist wahrscheinlich eher Richtung Tier 3 4 Das gucken auch 2-3.000 Leute natürlich gucken dass keine 150.000 Leute 500.000 Leute wie irgendwelche Majors aber das ist vorhanden das ist alive Das interessiert und das gibt es halt einfach bei Overwatch nicht oder bei LOL oder sonst wo so 5 Minuten noch also ich wollte mir mal schnell hier angucken Was ich mir hätte kaufen wollen aber dann nicht gemacht habe als kein richtiges Upgrade ist für meine Anwendungszwecke also Mal gucken ob es da was Vergleichbares gibt also die CPU die mich interessiert hat hatte wie viel 16 kerne und einen Base Takt von Ich sag Fuck Ach da 3,5 Das ist die wichtigste Info hätte man nicht weiter rechts in der Ecke platzieren könne so und turbo Max boost 4,7 die das ding aber wahrscheinlich kaum erreicht Hat der bauer nicht mal ein testvideo gemacht dass die dass der turbo quasi irgendwie bei maximal 4,3 oder so ist So 4,3 4,2 4,3 4,4 oder so derauer genau ich fange ich ja auch schon an das richtig auszusprechen Es ist ja derauer stimmt ja und das Ja da bin ich mal gespannt So und mal gucken was Intel demnächst zu bieten hat man Intel ist ja aktuell Seit Jahren mal wieder in der Situation dass dies auch ein bisschen über den preis machen müssen das ist ja das musste Intel nie Intel konnte uns die Letzten zehn Jahre eigentlich den allerletzten Mini Upgrade kram verkaufen der knerbe ist gut richtig ab Den allerletzten Mini Upgrade Mist verkaufen von Jahr zu Jahr für übels viel Kohle Ohne dass ich was getan hat ich meine wir haben es letztendlich amd zu verdanken der chat drehe ja durch Wir haben es letztendlich amd zu versorgen Wir haben es letztlich amd zu verdanken dass Es halbwegs zu einem halbwegs normalen preisen desktop cpus mit 16 kerne gibt das jetzt bei Intel so nicht gegeben Bei Intel werden wir jetzt vielleicht die waren ja die waren ja bei bei sechs kerne waren ja schon dann angekommen vielleicht hätten wir übelst high end desktop segment mittlerweile acht kerne vielleicht wenn wir glück hätten zehn Aber dass wir da jetzt irgendwie bei zwölf plus in in wirklich auch sehr erschwinglichen dimensionen schweben das haben wir Ne quadri waren sechs core mein meiner ist schon sechs core 8700 k das war high end also wirklich oberstes oberstes ding als das rausgekommen ist Also oder natürlich konnte man sich auch irgendwelche workstation xeons bauen oder so aber so normal desktop cpus war es obere geschichte Ist Intel überhaupt schon zehn nanometer ich verfolge diese die cpu geschichte nicht so richtig angeblich also die aktuelle cpus wohl noch nicht Aber ich glaube die die jetzt kommen soll sind wohl angeblich auch zehn nanometer Das habe ich das habe ich auf irgendwelche news seiten in den letzten wochen aufgeschnappt keine ahnung Ob das stimmt oder ob ich falls verstanden habe keine ahnung Die erste whitebird die erste ryzen generation die war die war noch nicht so mega erfolgreich Da hat zwar amd richtig was verkauft und die haben auch gezeigt alter intel jetzt ist langsam mal gut Aber die erste ryzen generation das ging so ein bisschen parallel zu intel vor allem gamer haben sich haben sich zum größten teil noch intel gekauft Und das ist jetzt teilweise immer noch so aber bei weitem nicht mehr so wie es bei der ersten generation war so und jetzt leute Wenn die das jetzt hinkriegen die müssen ja gar nicht so viel hinkriegen Ich habe mir das im vorfeld ein bisschen anguckt wenn die einfach nur 15 prozent leistungssteigerung haben Jetzt vielleicht jetzt nicht noch mehr kerne oder sowas das brauche also ich brauche es zumindest wenn die 15 prozent leistungssteigerung haben Dann sieht intel wirklich ganz schlecht aus und das ist denke ich mal durchaus durchaus im rahmen Weil der vorsprung von intel ist auch im gaming bereich schon nicht nicht substanziell mehr also Ja du hast schon wenn du den direkten vergleich machst Und auch spiele benchmarks mast dann dann ist die sagen sind die schon noch einen ticken schneller Aber nicht in so einem bereich dass du sagen würdest da kommt einem die innert hin Deswegen so leute geht los Bin ich aber gespannt was da jetzt rauskommt ich mache gleich fullscreen ich mache schon mal den chat aus Chat aus exquisite So und wenn deine geile cpu dabei ich hoffe ja die stellen auch schon zumindest so ein bisschen specks vor in die richtung was ich Mir dann kaufen will an cpu weil das letzte mal haben die den 3950 xx auch spät geht das schon los oder spackt Geht noch nicht los Ja Pog post jam Guck mal seht ihr unten links der post jam minimiert nicht richtig Der post schämt sich so in die taskleiste Okay 18 uhr Auf Let's go Wir refreshen jetzt einfach wir machen das so wie beim bei bei dem mmo oder bei diablo release wir refreshen einfach Weil wir wissen ja alle dass es dazu bei Das ist hat geholfen Das ist es wir sind die ersten die allerersten world reveal Wir sind vier sekunden vor den anderen ich sag es euch Wir probieren mal der bei der gelegenheit gerade noch mal schnell aus das ding mit dem vlc zu starten Weil manchmal ist mit dem vlc noch einen ticken schneller Was das für eine krasse Nein vlc ist halbe minuten zwanzig sekunden hintendran nope Okay, es ist wirklich kein live stream ist es was aufgezeichnet ist Ich mache gleich lauter und fullscreen sobald es losgeht Ich mache gleich lauter und fullscreen sobald es losgeht Wie ich habe noch eine idee was kann kann ff play das mittlerweile Nein Weil ff play kann man die buffers als einstellen das ist teilweise dann nahezu ohne ohne latency Deswegen habe ich auch meine webcam übersicht mit ffmpeg im back end gemacht Mpv habe ich nicht installiert also nicht unter windows und in der vm hat es dann eh 1-2 sekunden lag bei sowas Man kann die geschwindigkeit auf 2 setzen Wait a minute WTF WTF Auf geht's Sie haben da quasi geschrieben man soll sie nicht so sehr Ja Was ist das für ein quali So geht's Ich bin sehr glücklich, euch den Namen unserer neuen CQ für das erste Mal zu zeigen. Gebt uns den Biffle! Jetzt ist es Zeit, Ryzen in Aktion zu sehen. Wir wollten das Historie-Event verbreiten. Wir wollten das Twitch-AMD-Event verbreiten. Wo gibt es das auf Twitch, Leute? In High-Performance-PCs ging es darum, mehr Performance zu verbreiten an jedem Preispunkt. Wir sind so stolz darauf, zurückzulauen und zu sagen, dass das ein Teil davon war. Unsere Mission mit CQ hat immer noch klar gemacht. Es geht darum, die richtige Beteiligung zu machen. Wir haben die gleiche PC und brauchen die Skalabilität und die Performance, um das zu machen. Und das ist das, was die Threadripper-Chip wirklich aufregend ist. Es ist unser Verschleiß an unsere Kunden, dass wir den Roadmap verbreiten. Und momentan sind wir auf unserer Seite. Die Anticipation um den 3. Gen Ryzen ist wirklich beeindruckend. Gebt uns den ersten 16-Core-Gaming-Prozessor. Jetzt, im Jahr 2019, der 3. Gen Ryzen Z. Was wir in Xen gemacht haben, war, viel mehr zu machen, als wir dachten. Es macht mich so stolz darauf, zurückzulauen und zu sagen, dass ich ein Teil davon war. Unsere Mission mit Ryzen hat immer noch klar gemacht. Es geht darum, die richtige Beteiligung zu machen. 3-5 Jahre voran. Und dafür zu sorgen, dass sie... Das CPU ist so fett! Unser Ziel ist es, euch das Beste zu geben. Willkommen alle! Ein großer Willkommen an alle von euch. Und danke, dass ihr heute dabei seid. Ich freue mich auf diesen Moment jedes Jahr. Und ich kenne viele von euch auch. Es war ein schwieriger Jahr für alle. Als wir die Covid-19-Pandemie durchgeführt haben... Aber eine Sache, die wir gelernt haben, ist, wie wichtig die hohen Leistungskomputing-Technologien wirklich sind. Von Arbeit, zu Schule, zu Gaming, zu Unterhaltung... Die PC ist jetzt die Komputing-Plattform der Wahl im Jahr 2020. Und ich freue mich, euch heute zu zeigen, was wir für die nächsten gen PC-Plattformen arbeiten. Und insbesondere für alle. Jetzt, es ist bereits ein unglaublicher Jahr für die Spieler. Es gibt so viel Freude um die nächsten gen PC-Plattformen. Wir sind so stolz auf die neue Sony PlayStation 5. Mit einer hohen Leistungskomputing-Tasche... Die AMD Ryzen-CPU und die AMD Radeon-GPU-Technologie. Und wir sind auch stolz auf die neue Microsoft Xbox Series X und Series S-Konsole. Da hat sie aber geübt, dass sie das Microsoft-Zeug richtig ausgesprochen hat. Diese Konsolen bringen nur unglaubliche Technologien für die Spieler überall im Welt. Und sind wirklich ein Ergebnis von tiefen, englischen Partnerschaften über viele, viele Jahre mit Sony und Microsoft. Gaming ist im Herzen so vieles, was wir bei AMD tun. Ob du über PCs oder Konsolen oder Cloud-Gaming und Mobile sprichst. AMD liebt Gaming und wir sagen immer, dass Gaming mit AMD beginnt. Heute werden wir insbesondere über die nächste gen PC-Gaming-Plattform reden. Also reden wir ein bisschen über Ryzen. Ihr wisst, dass wir die erste Generation von Ryzen 2017 in den Markt gebracht haben. Und wir hatten eigentlich ein Ziel. Es war, den besten PC-Desktop-Prozessor zu bauen. Wir wussten, dass wir nicht in einem Schritt kommen würden. Aber mit jeder Generation von Ryzen ist es besser geworden. Und wir fokussierten an, wie wir mehr Leistung erwerben. Wie wir die besten Features erwerben. Und wie wir allen PC-Enthusiasten mehr Fähigkeiten geben. So dass ihr mehr machen könnt, als ihr gedacht habt. Mit eurem Desktop oder in eurem Notebook. Und wir haben einen großen, großen Prozess gemacht. Wir haben mit Ryzen und desktops angefangen. Und dann haben wir Ryzen Threadripper in High-End-Desktops eingeführt. Jetzt ist Ryzen in vielen tolle Notebook-Systemen. Mit unserer Ryzen 4000-Serie. Ich denke, es ist sicher zu sagen, dass AMD den PC liebt. Und ich denke auch, es ist sicher zu sagen, dass PC-User Ryzen lieben. Also, wir freuen uns auf das. Jetzt schauen wir uns an den Desktop ein paar Minuten. Der Prozess, den wir in den letzten Jahren gemacht haben, ist wirklich tolle. Wenn man sich den Markt vor Ryzen anschaut, dann sieht man, dass das Desktop-PC eine inkrementale Leistung hat. Das stimmt, da hat sie recht. In den letzten drei Jahren haben wir die Tragödie deutlich verändert. Das liegt aber auch daran, dass ihr 15 Jahre Intel habt machen lassen, was sie wollen. Wir haben von 1. Gen Ryzen bis 2. Gen Ryzen, jetzt bis 3. Gen Ryzen. Wir waren die ersten, die einen 7-nanometer-Desktop-Prozessor starten wollten. Und heute führt 3. Gen Ryzen in so vielen Bereichen. Wir sind die höchsten in der Multithreading-Performance. Wir sind die Besten in Bezug auf die volle Leistung. Und 3. Gen Ryzen ist ein absoluter großartiger Gaming-Prozessor. Aber wie ihr wisst, sind wir wirklich ambitios. Also, unsere Arbeit mit Ryzen ist nie fertig. Unsere Ingenieure sind auf diesem maniösen Fokus, auf was wir mehr tun können. Was wir besser tun können. Also heute sind wir hier, um zu sprechen, auf Zen 3. Und mit Zen 3 haben wir uns wieder um das Beste auf den PC-Markt konzentriert. Ich bin so stolz auf das, was wir erreicht haben. Zen 3 erhöht unsere Leistung in der overallen Performance. Es erhöht unsere Leistung in der Power-Effizienz. Und jetzt gibt es die beste Single-Threaded-Performance und Gaming-Performance. Wir haben große Veränderungen in der Core-Architektur. Und ich bin mir sicher, dass alle wissen wollen, was in Zen 3 ist. Also lasst mich das Mikroskop herausholen. Mark? Mark? Also wenn das stimmt mit Single-Threaded Performance, dann bin ich echt skeptisch. Ich kann mir ein bisschen mehr über Zen 3 und unsere Progression erzählen. Es war eine Reise. Wir haben vor fünf Jahren einen Kurs geplant, um eine Familie von hochwertigen X86-CPUs zu erzeugen. Unser Ziel ist sehr einfach. Wir haben das Team erzeugt, damit die Entwicklung von mehreren Prozessor-Generationen in parallel mit dem Design von einer Generation zum anderen gemacht werden kann. Das hat mit so laut ein, oder? Ich bin das nicht. Ich könnte nicht mehr stolz sein, als zu helfen, unsere dritte Generation von Zen Core zu erzeugen, die im Fall des Ryzen Desktops debutiert wird. Es ist ein Beste in der Performance. Und es wird in dem X86-Markt absoluten Leadership erzeugen. Zen hat uns zurückgebracht und eine hohe Performance mit einem 52% Prozessor-Generation. Okay, was? Heuer Boost? Okay, mehr Boost ist schon mal gut. Zu dem Rest kann man jetzt noch nicht allzu viel sagen. Letztes Jahr hat Zen 2 einen Doppel-Digit-Prozess-Einkauf in der Prozessor-Generation und debutierte 7nm in Chiplet-Technologie. Ob das wirklich viertes Quartal chippt? Mal gucken, vielleicht 5 Stück. Also das wäre wirklich nicht schlecht, weil aktuell haben wir ja Zahlen draufstehen, die ber RPMren置 und Alexia Chloe scolden. Okay. Dazu kenn ich mich zu wenig aus. was zu sagen, der 19 Instructions, oder welche Instructions, oder ich glaube ich bin dazu Low Brain für. Weider, weider ist gut. Ich weiß zwar nicht, was ist weider als, egal. Was steht da gerade? Zero Bubble? Was, was, was steht hier unten? Branch Prediction, gut, das nächste. Was, 4G? Oh, das geht so schnell? Excellent Core and Cache Communication for Gaming. Du weißt doch immer, dass das jetzt genau heißt. Okay, die haben jetzt, die haben jetzt anstatt 2x 16 MB Cache, haben die den fetten 32 MB Cache, wo alle Kerne drauf zugreifen können. Das habe ich jetzt kapiert. Was, heißt, heißt das? Moment, wenn der Cache für alle CPU Cores gilt, heißt es doch auch, wenn ich irgendwelche Threads wechsle, dann muss ich kein Zeugs mehr umschreiben, oder? Ach so, nur L3, stimmt, ja. Das ist gut. Also Energieeffizienz ist wirklich ein Ding. Gerade, gerade im Low, im unteren Segment, da war Intel wirklich schon eine ganze Ecke besser. Mal gucken, wie das jetzt wird. Intel, Alter. Intel beißt sich jetzt den Arsch gerade. Thank you, and let me welcome back Lisa to now show off our Zen 3 and new Ryzen processors. Thank you, Mark. That was great. I'm so proud of what the team has accomplished with Zen 3. We really focused on what is most important for gamers and enthusiasts, and at 19% IPC increase, it's our largest increase, generation over generation since we launched the Zen family. So now let's see Zen 3 in action. I'm so proud to show you for the very first time the AMD Ryzen 5000 series for high performance PCs. The world's first Zen 3 powered CPU. This is the AMD Ryzen 9 5900X. 12 cores, 24 threads and a boost up to 4.800. It's a very special product, the ultimate enthusiast processor. Compared to the 3900XT, the 5900X has 19% higher IPC, higher clock speeds and all of the Zen 3 core improvements that Mark talked about. 12 Kerne, 12 Kerne, 4,8 boost. This makes Ryzen 5900X a big upgrade from 3rd gen Ryzen all around, but especially in gaming. The question is whether it can handle 4,8. Thanks Lisa. Hey everyone, let me give you a sense of just how much faster the 5900X is compared to our current best, the 3900XT. To do that we're going to use Shadow of the Tomb Raider, a game I personally love and a game reviewers often look at to judge CPU performance. We're going to run the built-in benchmark here at 1080p using the high image quality preset on two otherwise identical systems. You can see a whopping 28% increase just by moving from the 39XT to the 5900X in Shadow of the Tomb Raider. And as you will soon see, the performance from the 5900X is faster than the competing processors as well. Now as any enthusiast knows, 28% from a processor change is a massive upgrade. But that's what AMD customers like me can look forward to. This truly demonstrates the gaming strength of Zen 3 when you combine the historic IPC uplift, unified cores and unified cache pools. Now as we zoom out to look at a wider set of games, you can see that the 28% uplift in Shadow of the Tomb Raider is joined by many titles with significant double-digit performance improvements. The gains are even bigger in titles like CSGO and League of Legends. The highest possible frame rate is practically the number one priority to be competitive. Overall, gamers upgrading from the Ryzen 5000 series to the Ryzen 5000 series can expect an average performance improvement of 26%. Again, this is just a monumental performance jump for an in-socket upgrade in the same motherboard and a true testament for how good Zen 3 is in gaming. Now as many know, strong gaming performance relies on strong single core performance. That's exactly what Zen 3 has. And I want to show you two Cinebench R20 single thread. There are many ways to assess single thread performance, but Cinebench is a fast and easy tool that you can run at home. And it's one of the 25 workloads that we used to calculate the 19% improvement for Zen 3's instructions per cycle. As you can see, the 5900X is the first desktop processor to ever break a 600 score. We don't break it by a little, we break it by a lot with a score of 631. BDMD heard you loud and clear as you challenged us to continue investing in single core performance and the results speak for themselves. The combination of IPC, frequency, cores and cache give AMD the fastest cores in the desktop market and give you the best possible gaming performance. So let's take that landmark for performance into a head-to-head battle. Across the same set of games you just saw, the AMD Ryzen 9 5900X is a clear winner at 1080p. As I promised you, AMD wins in Shadow of the Tomb Raider by plus six and is joined by many other games popular with viewers and users like you. League of Legends and CSGO are once again standout victories for the Ryzen 9 5900X. That was a lot of data very quickly. Let's take a step back, let's recap. You saw an average uplift of 26% for Ryzen customers upgrading from the 3000 series to the 5000 series. You just watched AMD deliver the highest single core performance in the entire desktop PC market. And you just saw AMD clearly offer the best performance of any gaming processor on the market. I will put it plainly, we know that you're going to wait for benchmarks, but customers who buy processors purely for their gaming performance will absolutely want a Ryzen 9 5900X for the best possible PC gaming experience. Let's bring Lisa back up to give you more details on these awesome gaming processors. Thanks Trevor, that was fantastic. I hope you're all now convinced that the Ryzen 9 5900X is the best gaming processor in the world. Now let's look at the stack. In the 5000 series we have a great choice for every gamer or PC enthusiast. In addition to the 5900X we have the 5800X, an 8 core 16 thread processor with boost frequencies up to 4.7 GHz at 105 watts. And we also have the 5600X, a 6 core 12 thread CPU with boost frequencies up to 4.6 GHz at 65 watts. Now let's talk about price availability. The 6 core 5600X is $299, the 8 core 5800X is $449, and the amazing 5900X, combining the leadership performance and power of the 16 thread CPU in a 12 core 7nm design is priced at $549. And all of these will be available globally on November 5th. We're really proud of the 5000 series, but you know we're not done. We love our enthusiasts and there's one more processor in our stack, which is the ultimate processor for gaming and content creation. For those of you who want the very best processor in a desktop PC, we have the 16 core Ryzen 9 5950X. The 5950X is simply an amazing CPU. 16 cores, 32 threads, and our fastest processor with boost frequencies up to 4.9 GHz. The 5950X breaks the Cinebench R20 single threaded record that Robert set just a few minutes ago with a score of 640. It is truly the best in class in every dimension. Best gaming performance meets best processor for content creation, and all of this still at 105 watts. Now let's take a look at some of the performance. If we look at the generational uplift from the 3950X to the 5950X, we see up to 27% more performance in CAD workloads and 12% more performance in rendering workloads. More aggressively, we see up to 29% more gaming performance. And this is really how we bring the best of both worlds together. Sollte das auch nur ansatzweise stimmen, wäre das mega geil, aber wie gesagt, ich bin da ein bisschen skeptisch. We see that the 5950X provides up to 59% more creative performance in rendering workloads. Double digit wins in video editing and software compiling. And we also win in lightly threaded CAD workloads as well. We're really proud of the fact that we also win in gaming. There's nothing like the 5950X in the world. One processor that delivers the best power efficiency, our highest clock speeds, the highest single core performance in the industry, and the highest multi-core performance of any gaming processor. And it's priced at 799 dollars and will also be available globally on November 5th. I hope you're now as excited about AMD Ryzen 5000 series as I am. Das ist meine CPU, Leute. Habt ihr gesehen? Habt ihr meine zukünftige CPU gesehen? And I know that you're not just excited about Ryzen 5000 series, but there's a tremendous amount of enthusiasm and curiosity about our Ryzen 5000 series as well. The next few weeks are just an amazing time for us. In addition to introducing our Ryzen 5000 series, we're also going to introduce our next-gen Radeon GPU. And I want to give you a small preview of that today. This is the AMD Radeon RX 6000 series, which we now affectionately call Big Navi, thanks to many of you who nicknamed it for us. It is absolutely gorgeous, and by far the most powerful gaming GPU we have ever built. We got a lot of requests from our fans on social, and I heard a whole conversation on the Full Nerd last week about wanting to see Zen 3 and Big Navi in action. So today I'm going to show you a preview of what you can expect from AMD Ryzen 5900X and our Radeon 6000 series. We've been doing a tremendous amount of work on the Ryzen gameplay with Ryzen 5000 and Radeon 6000 series. So let me show you today Borderlands 3, which is a very popular AAA title running at 4K resolution on the Ryzen 5900X and our Radeon 6000 series. Just take a look at that performance. Over 60 frames per second at 4K with beautiful and bold. We are super excited with what we've accomplished with Big Navi. In addition to Borderlands 3, here's a bit more of a performance preview on Call of Duty Modern Warfare and Gears of War 5 at ultra settings in 4K. And again, what you can expect is 4K performance across the board. We still have a few weeks until launch and the team is really hard on finding games. But I hope you're as excited as we are about what Ryzen 5000 series and Radeon 6000 series can do together for your next generation PC. So that brings us to the end. I hope you enjoyed today. It's been so much fun spending time with you. We have a lot more to show you later this month. So join us again on October 28th where we'll give you the full story of our AMD Radeon RX 6000 series and make sure you mark your calendar for November 5th to find Ryzen 5000 series on shelf worldwide. Take care and see you soon. Zweifel so, zweifel, so, so... Ja klar, na klar will ich das. Ich mein, es muss sich doch irgendwie lohnen, dass ich mir einen neuen Rechner kauf. Wenn ich upgrade vor einem 8700K mit einer 1080 Ti, dann muss ich upgraden auf das beste, was es gibt. Und das ist ein 5950X mit einer 3090 RTX, fertig. Bekommst du mal, bekommst den alten Rechner, nee Sebaro, den alten Rechner, der wird zum Streaming Vorschau Rechner und wir probieren auf dem alten Rechner dann mal aus, wie es mit Linux Gaming so aussieht, weil das soll ich ja schon mal eine Weile machen, laut Stream, hatten wir ja schon öfters mal das Thema, ich bin ja da immer ein bisschen am Flamen, dass das geschönt dargestellt wird, wie gut das angeblich funktioniert, das gucken wir uns dann mal zusammen an. Und der aktuelle Streaming Vorschau Rechner, der wird zu nichts, der kommt auf den Dachboden oder so. So, also, was hat der gekostet, 850, 800 klat, 5950, 799, ok 800, alles klar, das geht doch, es gibt schlimmeres, was kosten aktuellen 3950x, gut, das geht doch, das ist doch alles kein Ding, kann man es schon mal gönnen, alle dreieinhalb Jahre, gut, also ich werde aber auf jeden Fall mal auf normale Benchmarks warten, was mich interessieren würde, ob es vielleicht schon ein paar Seiten gibt, die geleakte Sachen haben, aber wenn die das heute anstellen, dann eher nicht, ja das sagt, also ich bin der Letzte, der was dagegen hat, wenn AMD in allen Bereichen die schnellste CPU hat, weil wie gesagt, mein nächster Rechner wird AMD und wenn die dann in Spielen, in was weiß ich, Zeug kompilieren, Video rendern und irgendwie, die schnellsten in jedem Bereich sind, sollen mir recht sein, aber, also, das war, man kann den Sachen immer nur so zur Hälfte trauen, was auf diesen Präsentationen gezeigt wird, da werden sich die optimalen Spiele in den optimalen Szenen und mit den optimalen Settings ausgesucht, weil ich meine im Ernst, das könnte genauso gut bedeuten, wenn die sagen, was weiß ich, 39% Performance Boost in CSGO oder 39% Performance Boost in Call of Duty, was auch immer, die können durchaus auf unterschiedlichen Maps das ausprobiert haben, was auch immer, also ich traue den bei sowas nicht über den Weg, also weder AMD noch Intel, noch Nvidia, noch irgendjemand, dass da wirklich realitätsnahe Sachen gezeigt werden, immerhin haben sie gezeigt, dass Battlefield schlechter läuft, mittlerweile, früher hätte ich mir gedacht, das spricht dafür, dass das näher an der Realität ist, allerdings mittlerweile, ja, Intel, müsste Intel nicht auch demnächst was zeigen oder haben die schon, mittlerweile glaube ich, dass man sowas einbaut, dass es glaubhafter wirkt, also die sind quasi schon Next Level, die Musik ist bei mir, ja, die sind quasi schon Next Level und bauen Sachen ein, die erstmal schlechter aussehen, damit man das für glaubwürdig erhält, also ich glaube denen nichts, ich glaube denen nichts, bis man wirklich unabhängige Benchmarks gesehen hat, aber wenn das auch nur halbwegs in diese Richtung kommt, ist das für AMD ziemlich gut, ich weiß nicht, ob Intel, macht Intel dieses Jahr noch was oder haben die schon, oder haben die schon, ich habe keine Ahnung, was ich höre, ich habe irgendeinen Mix an, ich weiß gar nicht, was das ist, ich habe einfach irgendwas angemacht, sagt mir auch nichts jetzt, Intel bringt erst nächstes Jahr was raus, ok, welches Case werde ich mir holen, das da, das da, ja, das da, ja, ja wieviel RAM weiß ich nicht, ich würde ja gern 64G RAM haben, weil ich möchte bei sowas immer ein Upgrade zu dem, was ich schon hab, so und aktuell sieht es halt so aus, 32G RAM, 8700K, 1080Ti und nachdem ich alles gerne immer upgrade, würde das ja eigentlich bedeuten 64G RAM und zumal RAM, genau PC lustig, zumal RAM auch sehr billig ist aktuell, doch das Gehäuse ist mega geil, also jetzt mal ernsthaft, findet wirklich jemand, dass das Gehäuse nicht gut aussieht, ich finde das sieht huge aus, also das gibt es auch mit Fenster, das gibt es auch mit Fenster, das gibt es auch mit Fenster, weiß nicht, ob die hier das mit Fenster zeigen, also ich hab das mit Fenster, dass man ein bisschen RGB sieht, so dezentes RGB mag ich ja auch, also hier, alter, what, wie wärs einfach mit nem Bild, hier, hier kann man reingucken, mein Gott, mach ich das kompliziert, ja, aber das werd ich mir holen, weil ich hab die letzten, die letzten Rechnergenerationen, die ich hatte, die hatten auch schon alle dieses Gehäuse beziehungsweise Vorgänger davon und ich bin damit so zufrieden, dass ich mir jetzt schon zum dritten Mark quasi infolge diese, diese, diesen Refresh vom Gehäuse hol. Teilst du deine ganzen Specks dann mit, wenn der PC da ist, ja klar, wir werden den PC auch zusammen im Stream, vielleicht nicht bestellen direkt, aber die Teile in, in den Warenkorb zusammen legen und dann bestellen, wenn der Stream aus ist, weil ich mein Paypal und so nicht on Stream eingeben will, also wie gesagt, ich find das Gehäuse ultra nice und das werd ich auch so wieder, wiederholen. Kennst du das von Be Quiet, nee, wie gesagt, meine letzten Rechnergenerationen hatten nur diese Sachen hier, alter, was ist mit der Seite los, die ist übelst lahm as fuck, komm mal kurz, guck mal, die Seite hängt auch, bin ich so zufrieden, ich hab mir keine anderen Gehäuse angeguckt, aber das ist wirklich top, gerade mit der, mit der, mit der Scheibe hier nebendran, dass man noch ein bisschen RGB-Gedöns sieht, also wenn ich jetzt bei mir so neben dem Rechner gucke, seh ich, nee, ich seh noch nicht mal was durch die Scheibe, fällt mir grad auf, ich hab den anderen Rechner direkt daneben gestellt, ich hab zwar jetzt einen mit Scheibe, dass ich meinen geilen RGB-RAM und RGB-Grafikkarte und, und Gedöns angucken kann, aber jetzt hab ich den zweiten Rechner daneben gestellt, der steht vor der Scheibe, jetzt kann ich nicht mehr reingucken, hat sich ja richtig gelohnt, vor allem ich hab mir sogar damals noch für die Noctua-Lüfter extra farbige Plänten geholt, weil stylischer aussieht, jetzt guck ich nicht mehr rein, das ist mir total hängen geblieben ey, mal gucken, ob die schon aktualisiert haben auf ihrer Homepage, watch now, das haben wir schon gewatched, Fußnoten, nee so schnell sind die nicht bei IMD, Stonks, Young Snorlax, Dankeschön für den Sub, Huge Subscription, echt, haben die den schon drinnen stehen, ah yes, Anni Sign Up, und wie siehts mit 9050x aus, ooooh, Specifications, ah, da können wir doch mal gucken, das ist ja nice, da müssen wir gar nicht raten, da müssen wir gar nicht raten, was da drin ist, also, 4,9 Boost, also mit 5 Boost ist nix, was manche Leute gesagt haben, AMDs Aktienkurs direkt 2% getroppt, auf die Stonks würde ich da jetzt erstmal nix geben, wie, was macht eigentlich Intel Aktie, Intel Aktie, das gucken wir uns jetzt mal an, AMD Aktie, was ist da eben passiert, so, AMD Aktie ist erstmal direkt runter, und Intel Aktie ist, juckt nicht, ich fand das nicht schlecht, was AMD gezeigt hat, das war eigentlich so die logische Konsequenz aus dem, was man das letzte Mal gesehen hat, warum, kein Schimmer, ich würd mal morgen abwarten, ich mein natürlich, es hätte nochmal eine Nummer härter sein können, aber, wenn das so kommt, und wenn Intel bei diesen Dingern jetzt erstmal bleibt, was da grad aktuell ist, dann ist AMD jetzt, zumindest mal, selbst wenn wir bezweifeln, dass das stimmt, was die da an Verbesserungen erzählt haben, wird teilweise 50% und so, das ist Marketing, Stonks Gelaber, Diana, 2 Monate, Dankeschön, Exquisite Subscription, oh, sorry, falsches Emote, Alter, Dankeschön für den Sub, falsches Emote, manchmal ist schlecht, wenn Subscription über Piss dich, Alter, oben steht, ja, danke für den Sub, Massive Subscription, huge, was wollte ich jetzt sagen, selbst wenn wir mal bezweifeln, dass das stimmt, was AMD da erzählt hat mit ihren Gamevergleichen, aber sie sollten mal zumindest gleichgezogen sein, was Gaming Performance angeht mit Intel, und allein schon das wird ein riesen Verkaufspunkt für viele sein, die sich jetzt immer noch krampfhaft Intel gekauft haben, weil Intel ja ein paar FPS in manchen Games mehr hatte, es ist einfach unglaubliches Prestige, wenn man sagen kann, man hat die schnellste CPU in allen Bereichen, das bringt schon was, PC Lustig hat sich AMD Aktien gekauft, Exzellent, warum hast du die nicht gekauft, ist anscheinend besser als gerade AMD, AMD hat gerade gesagt, übrigens der Chat ist gerade abgestürzt, bei euch auch, ist bei euch auch der Chat abgekackt, das letzte, was ich im Chat gesehen habe, ist von PC Lustig, hat mir extra noch AMD Aktien gekauft, danach habe ich nichts mehr gesehen, na jetzt seh ich euch ja wieder, keine Reprise, Chat wieder einblenden. Ja, aber irgendjemand im Stream hat ja geschrieben, er geht safe davon aus, dass es 5GHz Boost sein wird, das hat nicht funktioniert, es sind nur 4,9, allerdings ist es für mich gar nicht so von Bedeutung muss ich ehrlich sagen, ob das jetzt 4,9, 5, 4,8 Boost hat, das wichtige ist ja, dass der Boost auch irgendwie mal erreicht wird, bei den letzten AMD CPUs haben wir bei den Videos vom Bauer auch schon oft gesehen, dass eben das einfach nur eine Zahl war, die drauf stand und nichts mit der Realität zu tun hatte, da stand da Boost 4,7 oder so drauf und es hat Boost gemacht 4,4, war ein bisschen Post-Camp. So, was haben wir hier, also Up to 4,9GHz, 16 Kerne, noch einmal mehr Cache, sag mal, sehe ich das richtig, dass die immer noch den gleichen Sockel verwenden? Da kommt, ich mein, wenn man sich überlegt, Intel hat bei wirklich jeder Furzänderung einen neuen Sockel rausgebracht, die haben, keine Ahnung, 2MB mehr Cache draufgesteckt, neuer Sockel, Video Encoder Upgraded, neuer Sockel, 2 PC Express Lanes mehr, neuer Sockel, also Intel hat ja wirklich zu jeder CPU einen neuen Sockel gebracht, unsinnigerweise ehrlich gesagt, hieß es nicht das letzte Mal schon, dass es die letzte AM4 Generation wird? Ist auf jeden Fall nice, auf der anderen Seite dann vielleicht auch wieder nicht so nice für die Leute, die sagen, sie kaufen sich jetzt zum ersten Mal ein AMD System hier mit, weil dann kannst du sicher sein, das Upgrade ist ja nicht mehr, aber ich kauf mir ehrlich gesagt eh nicht die, ich kauf mir eh nicht die Rechner im Hinblick auf Upgrade-Fähigkeit. Das, wenn man ehrlich ist, das einzige, was man überhaupt, wenn überhaupt mal Upgraded in so einem System ist die Grafikkarte. Jetzt mal, mal Hand aufs Herz, Leute, wie oft habt ihr schon bei einem bestehenden System nach sagen wir 2 Jahren die CPU mal gewechselt? Also ich überleg grad, ob ich das überhaupt schon mal gemacht hab, doch hab ich, hab ich, hab ich, hab ich und zwar, das ist aber schon ewig schwer, da hab ich glaube ich von einem Atlon 64 oder so auf einen Atlon 64 X2 oder wie das Ding, was war denn das hier, AMD, wie ist das, Toledo oder so, CPU war das damals, genau, auf so einen hab ich mal gewechselt, Sockel 939 kann sein, ja, das hab ich mal gemacht, von einem Atlon 64 Sockel 939 auf so einen, aber das war auch das einzige Mal, wo ich das gemacht hab, ansonsten nie und wie gesagt, also ich bin jetzt 36, ich bastel bestimmt schon seit, frag mich nicht, 1999, 2000 so ein bisschen an dem Kram rum, ich hab einmal meine CPU geupgraded, RAM, RAM upgraden man vielleicht auch manchmal, ja, das stimmt, aber ehrlich gesagt, bei mir ist es, ist es, es ist zu 90% Grafikkarte, wenn überhaupt was geupgraded wird, bei dem Rechner hier hab ich nichts geupgraded, das Ding hab ich gekauft vor 3 Jahren, 8700K, das war einer der ersten 8700K, die es in Deutschland gegeben hat, 8700K, 1080Ti, die hatte ich schon sogar noch ein Jahr vorher und jetzt 3 Jahre am Stück, doch, doch, ich hab 16G RAM noch dazu gesteckt, das stimmt, stimmt, das ist aber alles gewesen, also da hat sich nichts getan, ne, aber so CPU Upgraden im laufenden Betrieb, zumal ich bei meinem aktuellen Rechner garantiert keine CPU Upgrade, weil ich hab den, ich hab den 8700K, den hab ich geköpft, Flüssigmetall dazwischen geschmiert und den Heat-Spreader nicht wieder festgemacht, der Heat-Spreader hängt einzig und allein gerade fest, weil ich den Lüfter fest angezogen hab, wenn ich den Lüfter jetzt abmach, dann fällt erstmal der Heat-Spreader ab wahrscheinlich, ich muss neue Wärmeleitpaste und neue Flüssigmetall drauf machen und sowas, ne, wieso, das ist an sich kein Problem, kann man machen, ansonsten hätt ich dann eben ein bisschen Silikon drum schmieren müssen, naja, ich hab eh nicht vor das ganze zu Upgraden, macht es eigentlich Sinn preisleistungsfähig immer die neuesten CPU zu holen oder lieber die alte GAN, das kann durchaus Sinn machen sich die alte GAN zu holen, gerade bei AMD, bei der aktuellen AMD-Generation war es teilweise sinnvoll sich noch einen von letzter Generation zu holen. Also es haben viele, die Budgetgeschichten gebaut haben, die haben noch 1700 oder sowas verbaut anstatt 2700 und solche Dinger, ne Moment, 1700 statt 3700, oder was 2700 statt 3700, was auch immer, die Generation vor der aktuellen, ich glaub 2700 und 3700 war das noch, ne, oder, AMD-Benahmung, aber die blick ich immer noch mehr durch als Intel-Benahmung, zumindest haben das viele, die aktuell in dieser Generation irgendwie Anfang des Jahres sich so einen Budgetrechner zusammengebaut haben mit Ryzen, die haben oftmals noch einen von der letzten Generation genommen, ja, das kann sich manchmal lohnen, ich machs nicht, das liegt hauptsächlich daran, weil wenn ich mir einen Rechner kaufe und ich hab mir halt die letzten Jahre wirklich immer ordentliche Systeme mit Wumms gekauft zum aktuellen Zeitpunkt und für mich machts keinen Sinn, weil ich finde ja jetzt schon kaum was an Hardware, was sich lohnt zum Upgraden, das heißt ich muss eigentlich sowas hier in der Richtung kaufen oder mindestens 5000 oder nix, dass es sich überhaupt lohnt zu Upgraden und das ist wenigstens mein ordentliches Upgrade, ich mein es wird jetzt nicht die Welt verändern von einem 8700k was Spiele angeht, Spiele, natürlich Video rendern ist hier, das ist ne ganz andere Sache, also ob du jetzt mit nem 6-Core Video renderst oder mit nem 16-Core Video renderst ist natürlich was ganz anderes, die Sache ist bloß dazu müsste ich erstmal Videos machen, dass ich das lohnen würde, aber natürlich, das ist ein riesen Unterschied. So ist der Sound einfach aus, WTF, warum ist der Sound einfach weg, ah keine Ahnung, ja aber das ist ein riesen Unterschied und ich denke auch, dass es im Gaming Bereich ein bisschen nen Unterschied macht, ich mein mein 8700k der geht bis zu 5,1 GHz wenn ich den wieder hoch takte, AMD, wenn wir mal von ausgehen wie es das letzte mal gewesen ist, dann erreichen die auch keine 4,9, dann machen die vielleicht 4,5, 4,6 oder sowas, sie haben zwar großartig erzählt mehr Boost noch noch besser und so, aber AMD hat das letzte mal schon gezeigt, dass die Boostzahlen mit dem echten Boost nicht all zu viel zu tun haben, ja und deswegen glaube ich gerade in Games, dass das jetzt nicht zwei unterschiedliche Welten sind von den übertakteten 8700k zu 5,950x, aber es ist vielleicht, es ist zumindest nicht schlechter, das ist ja schonmal das was mir am allerwichtigsten ist, dass ich jetzt irgendwie nicht downgrade in manchen Bereichen, vielleicht ist es ein bisschen besser, aber das wird mir ja schon reichen, ja und dafür hast du eine CPUkerne, ich mein ich lass jetzt schon viele VMs laufen, jetzt kann ich, weil im Stream hat es keinen Sinn, aber ansonsten hab ich auch schon immer recht viele VMs an, es kann durchaus sein, dass ich mal 2,3 VMs oder manchmal auch 3,4 VMs nehm bei Laufen ab, da ist es sicherlich nicht verkehrt, wenn man die ein oder anderen CPUkurs auch mehr hat, aber ne VM im Eidl braucht jetzt auch nix, so, ja also ich fand die Vorstellung nicht schlecht, warum der AMD Stock, Stonks Kurs jetzt getroppt ist, keine Ahnung, aber die Stonks Leute versteh ich eh nicht, ich bin auf jeden Fall mal auf echte Benchmarks gespannt, ob bei der Sache rauskommt, wir vergleichen jetzt noch mal den 9500x, weil der ja nur die Hälfte kostet und deutlich erschwingbarer sein dürfte, was es gibt nen Intel 5960x, warum das denn, bei den Intel heißen die Dinger doch 109700k oder so was, ach du scheiße, aber das war bei den Mainboards auch mal so, als ich mein CPU gekauft hab, da hieß die Plattform glaube von AMD X370 und Intel war Z370, das war auch so richtig so richtig pepega, aber ich glaube für die meisten dürfte das hier eher die CPU sein, anstatt der 5950x, weil im Prinzip bezahlst du hier für 4 Kerne mehr, 100MHz mehr Boost, RAM ist auch kein Unterschied, also im Prinzip ist der einzige Unterschied, der andere hat 4 Kerne mehr und 100MHz mehr Boost und kostet das doppelte fast, also das lohnt sich nicht, das lohnt sich wahrscheinlich aber zumindest ein bisschen mehr, wie ne 3090 RTX anstatt ne 3080 RTX, weil das macht ja gerade im Gaming Bereich eigentlich überhaupt keinen Unterschied, wenn man sich die Benchmarks anguckt, also mehr Preis bei den Grafiken lohnt sich ehrlich gesagt überhaupt nicht, aber trotzdem muss das sein, so stehen die anderen auch schon drinne, weil die meisten aktuell haben ja eher sowas, ne da gibts, ah Moment da heißt ja auch Ryzen 7 dann ne, ne haben die den nicht auch, ach Moment X, ohje, MonkaS, AMD ist überlastet, egal ist das eigentlich Mode ja, ok AMD ist Grip, was 7 5800X, aha, Elite Gaming CPU, jetzt haben sie ja oft genug betont, dass sie Gaming und PC lieben und Elite und sowieso sind, ja das ist wahrscheinlich, aber hatten die nicht nen 7 oder hab ich das durcheinander gebracht, ne wahrscheinlich bring ich das durcheinander, was der 8er, das ist wahrscheinlich eher die CPU, die sich die meisten Leute holen werden, ne auf meinen hab ich nicht gesehen, will ja auch nicht sein, 5600, ok, aber beim 5600 auch ein X dahinter oder, also die Benamung macht immer noch nicht so wirklich komplett Klick bei mir im Kopf, aber wenn das jetzt Ryzen 5, ne 5000X, ahja, ok das ist der mit 6 Kern, denk mal das wird auch ne Option für viele Leute sein, eine Sache kapier ich nicht so genau, müssten nicht theoretisch die CPUs mit weniger Kern potentiell höhere Boost erreichen, weil einfach weniger drauf ist, muss das nicht eigentlich so sein, also rein so thermalmäßig, was viele sind mit dem Preis, dass Ryzen 5 nicht glücklich ist, ist auch 100 US Dollar teurer geworden, ja AMD ist mittlerweile so in der Position, wo man sich anscheinend leisten kann, ne, also ich find's noch verdrehtbar, besser als das teilweise bei Intel gewesen ist noch vor ein paar Jahren, wo nur eine 2% schnellere Enthusiasten High-End CPU gekriegt hat, die das doppelte oder dreifache oder so gekostet hat, weißte ich, normale CPU, sinnvoll Preis-Leistung, keine Ahnung, 400 Euro, High-End sonst was CPU, 1300 Euro, bam, the fuck, also ich fand die, ich fand die Geschichte nicht übel, man kann damit leben, mal gucken, was Twitter sagt, wir geben uns jetzt mal, übrigens, also meine Mediatweets sagen immer alles, meine Tweets bestehen aus der Hälfte irgendwelchen bescheuerten Meme-Bildchen, Essen, Katzenfotos und mal ein bisschen Programmier-Screenshots, fertig, okay, was sagt denn Twitter, Ausnahmezustand, ohje, was ist das, achso, ich dachte wegen AMD, was für ein Ding, was in Berliner, Szene, Viertel, Viertel herrscht Ausnahmezustand, 30 Jahre Besetzung, what the fuck, warum dürfen da Leute 30 Jahre irgendwas besetzen, ey, was ist das für eine Logik, okay, ich hab keine Ahnung von dem Fall jetzt, ich sag jetzt mal was übel Stammtisch-mäßiges, ja, wenn ich bei mir im Garten einen Baum fälle, ich hab einen Baum gefällt bei mir im Garten und ich war dazu verpflichtet einen neuen Baum zu pflanzen und dann kam einer, der hat kontrolliert, dass ich den richtigen Baum an der richtigen Stelle die richtige Sorte gepflanzt hab, also sprich ich darf auf meinem eigenen Grundstück keinen Baum fällen und in Berlin dürfen Leute 30 Jahre raus besetzen ohne dass was passiert mit dem, aber wie gesagt ich kenne den aktuellen Fall nicht, ich hab keine Ahnung davon, ich weiß nicht was da ist, ja, das sind dann bloß so Dinge, die klingen so voll, was gibt's, ach nee, bin ich der einzige der Moria irgendwie mit Herr der Ringe in Verbindung bringt und nicht mit Flüchtlingslager, ich denk da immer an Herr der Ringe, zumal ich mir dann, weil Amazon macht ja auch ne neue Herr der Ringe Serie und ich denk bei solchen Sachen, K-Pop trending, Alter hör mal auf, ich denk bei solchen Sachen immer, vielleicht gibt's neue Infos zu der Amazon Serie und dann erinnert's mich immer wieder dran, ach Quatsch, das ist ja Flüchtlingslager, das hat ja mit Herr der Ringe gar nichts zu tun, aber K-Pop ist trending, so, also interessiert Twitter irgendwie was AMD-mäßiges, ist das irgendwie relevant für Twitter, was AMD gemacht hat, Rassistin, aber Deutschland geht mir so auf den Sack, ich kann's mir nicht mehr antun, äh, deswegen hab ich meinen Twitter auch auf Andorra gestellt, ok, suchen wir mal nach AMD, da muss doch irgendwas hier, muss doch irgendwas geben, Big Navi, weiß nicht, irgendwie Big Navi hört sich, hört sich halt Big Navi an, gut, das haben wir gerade gesehen, also AMD, ajajaja, was auch immer, äh, tja, ok, keine Ahnung was Twitter macht, gibt's da nicht, Twitch, Twitch trendet, ok, Twitch ist jetzt auch, ist jetzt auch Sexist und Rassist, ok, aber warum trendet Twitch, ok, wegen irgendwie Dingern, wegen aktuellen Dingern, Intel trendet in Deutschland, warum, warum trendet ausgerechnet Intel, soll es sich umgedreht sein, wisst ihr, dass bei den deutschen Trends traust du dich da gar nicht mehr drauf zu, drauf zu drücken, Currywurst könnte es wirklich um ne Wurst gehen, oder um diesen einen Typ, ich weiß gar nicht wie der Channel heißt, es gab noch diesen einen Typ, ähm, wo, der auch so ein bisschen, äh, was war denn das, irgendein Skandal gab's da doch, hat da nicht auch irgendwelche jungen Mädels was geschrieben auf Discord, ich hab, ich verfolge das alles nur am Rande und, ähm, ist der Typ nicht so, der Typ ist so, ne, wie gesagt, ich verfolge YouTube Deutschland nur am Rande, da traust du dich ja gar nicht mehr durch drauf zu klicken, ok, warum, warum trendet Intel, das muss ich jetzt, muss ich jetzt, warum, warum trendet Intel, was, Moment, das hat mit Intel aber nichts zu tun, hä, das sind irgendwelche Freedom, Freedom Tweets, Alter, was juckt mich das denn, ok, hier, hier, ne, was zum, was zum, aaah, ok, Twitter, vergesst, Twitter, vergesst, Twitter sackt einfach nur gerade wieder richtig rein, Kokona-Politics, genau, Kokona und Russland-Kommentare hab ich auch auf Twitter gerade gesehen, das Video anschauen bezüglich AMD, oh, weiß ich nicht, zeig mal, ich mein, wenn es so ne Zusammenfassung ist, ne, das müssen wir uns nicht angehen, wir haben es gerade zusammengeguckt, wir müssen uns kein Recap angucken, oder meinte da ist irgendwas interessantes drin, ne, das haben wir uns gerade angeguckt, wie sieht es eigentlich in Frankfurt wegen Corona aus, schlecht, Frankfurt und Offenbach haben jetzt als erste zwei Städte in Hessen wieder verschärfte Maßnahmen, weil sie über irgendeiner komischen Fallzahl pro 100.000 Einwohner drin sind, ich mein, Frankfurt und Offenbach, passt ja wieder, was Performance Claims, ok, ok, gucken wir mal, was er dazu sagt, meint, muss ich mal hier Musik ausmachen, ja, ok, ne, der zeigt einfach nur, was AMD gezeigt hat, ich mein, wie gesagt, ich bin da auch skeptisch, ne, was ich halt auch geil finde, Battlefield, nicht nur auf dem Abstand, auf dem absteigenden Ast, was Gaming angeht, aber auf dem absteigenden Ast, was CPU angeht, aber ich sag's euch, ich sag's euch, wie es ist, ich habe in solche Stonks-Grafiken von offizieller Seite kein Vertrauen, weil ich trau denen durchaus zu, dass sie sowas hier eingebaut haben, einzig und allein dadurch, dass diese Zahlen glaubhafter sind, wobei, moment, hä, das, ach, moment, das ist jetzt der Vergleich mit dem, mit dem, ok, der Vergleich mit über 50% war mit dem direkten Vorgänger, so, und da müssen wir echt mal normale Benchbugs abwarten, ne, das mit, wo so 50% Verbesserungen drinstehen hatten in der Präsentation vorher war zwischen 5900 X und 3900 XT? Warum gibt es eigentlich ein 3900 X, ein 3900 XT und ein 5900 X? Für was ist denn das T? Und warum gibt es kein 5900 XT? Oder gar eine 9000, 5900 XT? XT war der Refresh, ah, Chat. Chat kennt sich aus. Da steht nicht mal, was diese Balken bedeuten, ja, Image Quality, ne, ne, sie wollen, dass es so aussieht wie Performance, wahrscheinlich meinen sie auch Performance, aber welche, was, was sie genau meinen, man weiß es nicht. Wie gesagt, deswegen bin ich da immer sehr skeptisch, was solche Grafiken angeht. Wenn das bei CSGO stimmt, warum, ist doch egal, man, CSGO läuft überall schon am Limit. Ob du CSGO jetzt mit 900 FPS oder mit 950 FPS theoretisch laufen lassen kannst, das ist eine große Unterschied, oder? Okay, vielleicht übertrieben, das sind halt vielleicht da neutraler 50 FPS. Doch, macht's. Gut, wenn ihr das sagt, Chat. Ja, also wie gesagt, auf die Frage, was Corona macht, war in Hessen, wie gesagt, Frankfurt und Offenbach müssen jetzt wieder verschärfte, auf Verbotszonen in Frankfurt. Oh, da muss ich mir mal angucken, wo ich denn hin darf. Verbot, Alkohol und Maskenpflicht in großen Teilen Frankfurts. Okay, die Stadt ankündigt Alkoholverbot zu wieder Tragen einer Mund-Nase, das ist, das ist auch so geil. Die Mund-Nasen, Maske, Maske geht nicht, weil irgendjemand Copyright auf Maske hat, deswegen muss das eine Mund-Nasen-Bedeckung sein. Und es scheißen genug Leute drauf, die haben das Ding dann irgendwie so unterm Kinn bammeln oder sowas. Und die richtig coolen Leute kürzen das hier ab, MNS oder sowas. So, also von wo nach wo, wo ist in Frankfurt, wo ist das in Frankfurt, was? Von Freitag an bis, bis Ende kommender Woche ist der Konsum alkoholischer Getränke demnach in folgende Be- Was hat denn Alkoholsaufen mit Corona zu tun? Das verstehe ich nicht. Man kann bestimmt argumentieren so nach dem Motto, da sitzen die Leute länger zusammen und besaufen sich, aber so prinzipiell hat jetzt der Alkoholkonsum und Corona erst einmal nichts direkt miteinander zu tun. Wenn Menschen Alkohol gesoffen haben, verhalten sie sich noch dümmer. Ne, ich glaube die Dummheit tritt nur mehr zutage, die sind ansonsten genauso dumm. Okay, hier gilt zwischen 8 und 21 Uhr eine Maskenpflicht im Freien. Goethe-Straße, Goethe-Straße, Louis Vuitton-Store, zahl die Kollektion barfick auf Sponsor. Haftbefehl wusste ich mal wieder. Goethe-Straße, zahl, Goethe-Straße, da müsste ich, da müsste ich theoretisch ne Maske, ne Maske hier auf der Straße. Schweizerstraße, Schweizer Platz, da laufe ich morgens vorbei. Ähm, ich weiß nicht wo das ist, Kaiserstraße, jawoll. Also da laufe ich lang, da laufe ich lang und da laufe ich öfters lang. Und Opernplatz bis auf... Seit wann gibt es Maskenpflicht im Freien? Ja anscheinend in Frankfurt jetzt, seitdem Frankfurt über irgendwelche Grenzwerte wieder gekommen ist. Solange du vor 8 und nach 22 Uhr lang läufst, kein Problem. Naja, also vor 8 und, das ist so, also zwischen 8 und 22 Uhr ist so die Hauptzeit, ja. Natürlich laufe ich da zwischen 8 und 22 Uhr lang. Also ich laufe, wenn ich Glück habe und ganz früh auf die Arbeit fahre, dann bin ich vor 8 da, aber ich, wie gesagt, ich habe eh grad dauer Homeoffice, aber nur mal so, wenn ich theoretisch dahin fahren würde, dann könnte ich das vor 8 packen, aber das, ich muss auf jeden Fall vor 22 Uhr zum Bahnhof, was soll da sonst, sonst klappt das ja überhaupt gar nicht. Tja, gut wie es in Offenbach aussieht, juckt mich ehrlich gesagt nicht, weil in Offenbach bin ich nie und nach Offenbach gehe ich auch freiwillig nicht. Offenbach, Null, ja, nee, nee. Aber gut, in Hanau, wie sieht es in Hanau aus? Ihr wisst ja, ich wohne in Hanau, was ist in Hanau los? Schule bleibt weiter dicht, Neuinfektionen bei Hanau, okay. Wie viele? Leute, soll ich euch mal was sagen, mir geht ehrlich gesagt mittlerweile die ganze Corona-Geschichte voll am Arsch vorbei, ich hoffe nur, also ich meine so newsmäßig und so, ich kann mir das nicht jeden Tag wieder neu geben, ich hoffe nur, dass es nicht dazu führt, dass die Leute jetzt alle ultra leichtsinnig werden. Na, also wie gesagt, wenn ich wirklich mal in Zug steige, dann natürlich ziehe ich meine Maske an und alles, aber es ist ja mittlerweile jetzt nichts ultra, es ist ja nichts neues mehr, also es ist jetzt nicht so, dass ich mir jeden Tag jegliche News da angucken muss. Aber man weiß jetzt, was Sache ist, man weiß, dass da sich das auch noch eine Weile hinziehen wird und ich, aktuell sieht es für mich so aus, in meinem täglichen Leben spielt Corona eigentlich keine Rolle. Corona würde in meinem täglichen Leben nur eine Rolle spielen, wenn ich es hätte. Das wäre schlecht, wenn ich es hätte, aber nachdem ich gerade eh Dauer Homeoffice hab und ich eh nicht der Allersozialste bin, ihr kennt mich ja mittlerweile, der permanent sich da irgendwie in Gruppen besaufen muss, dann ist, also ich hab nicht die großartigen Einschränkungen. Also mich betrifft es nicht so, mich wird es nur richtig betreffen, wenn ich halt Corona bekomme, das wäre natürlich kacke. So, ja gut, zur AMD kann ich jetzt nicht mehr wirklich großartig was sagen, müssen wir mal eine richtige Benchmarks abwarten. Ich hoffe, dass, wann war Release? Vierter, fünfter Dezember? Fünfter, Fünfter, ne? Kann man schon vorbestellen? Kann man schon vorbestellen? Oder kann man schon, muss ich mal gucken. Nein, man kann doch nicht vorbestellen. Wäre hier, bei Ebay, auf Ebay kannst du schon immer alles bestellen, auch bevor es das gibt. Ah, eine 5059X Scheibe verzinkt, exellent. Ja, das ist schon doof, dass Intel eine ältere CPU hat, die genauso heißt. Gibt es bei Ebay Kleinanzeigen schon einen? War das letzte Preis? Oh, ne. Kann man denn bei, äh, wir haben es bei Alternate geguckt, das schreibe ich bei Amazon. Übrigens habe ich alles bestellt, was wir gestern eingekauft haben, Bestellung ist raus. Bei Wish, ne, bei Wish kann ich nicht gucken, weil ich den Account nicht mehr habe, für Wish. AliExpress, nein, Quatsch, plötze, die haben alle noch nichts. So sieht der also aus, die neue AMD CPU. Ich dachte mir schon, dass das fake ist, was die auf der Präsentation hochgehalten haben. Das ist der richtig echte neue 5950X. Der sieht auch schon so aus. Ich mein, guckt mal, es muss doch einen Vorteil haben, wenn AMD die Sachen demnächst in 5nm produzieren lässt. Die können einfach kleiner bauen. Intel hat noch so große Dinge, AMD macht jetzt sowas. Please kontaktieren Sie uns zuerst vor Platz ein Auftrag. Ah, yes. Exquisite. Wir können Ihnen einen Rabatt, wenn Sie mehr Quantität bedrücken. Auch wir können akzeptieren, eine Liste anfangen. Alles klar, natürlich. Kaufen wir uns gleich ein paar 5950X auf AliExpress beim AGBG, beim AGBG Store. Gleich fünf Stück ordern. Exzellent. Was schreiben wir bei Computer Base dazu? Der gucke ich eigentlich auch immer gerne. Warum? Ja, weil die Notebook CPUs so heiß. Kommt bei Anfangs nur auf 500er Mainboards. Okay. Ersteller Benchmarks. Zen3 stellt Intel komplett in den Stand, sagt AMD. Also wie gesagt, mir würde es ja schon fast reichen, und das ist eigentlich auch das Mindeste, das mit dem ich mir so einen kaufe, dass sie zumindest gaming-performance-mäßig gleich ziehen mit Intel. Der Rest ist dann, der Rest ist Bonus. Ich will aber keinen Downgrade von meiner CPU haben. Ananas auf Pizza, nein oder neiner? Also ich, ich esse keinen Ananas auf der Pizza, aber kann man, ja warum nicht, wenn es einem schmeckt. Ich mein, ich kenne das Ananas-Pizza-Meme. Mir klar. Wobei das stimmt nicht. Ich hab sogar schon mal Ananas-Pizza gegessen und zwar mit Hähnchen. Hähnchen-Ananas. War eigentlich ganz gut. Aber meine Lieblingspizza ist eh, und jetzt, jetzt, jetzt postchamp der Chat wieder. Meine Lieblingspizza ist eh, Pepperoni-Wurst-Spargel-Sauce Hollandaise. Oder mit Hähnchen. Anstatt, anstatt, Hähnchen ist auch gut. Hähnchen anstatt Pepperoni-Wurst ist auch gut. Oh hat er, Moment, hängt, hängt, hängt der Chat? Hängt das Stream? Ne. Ne, die Vorschau ist einfach kaputt gegangen. Lul. Aber so ist Hollandaise auf Pizza, Leute. Ich sag's euch, beste. Was auch, ey, was auch mega gut schmeckt. Ich bin, ich bin ja kein Pizza-Hut-Fan. Und ja, ich sag Pizza-Hut und nicht Pizza-Hut. Aber, ähm, ich bin ja kein großer Pizza-Hut-Fan. Aber es gibt eine Sache, die echt geil schmeckt bei Pizza-Hut. Und zwar, keine Ahnung. Äh, kann man sich das nicht einfach angucken? Okay, Start. Ich zeil eins suchen. Was? Wohnung. Dafack. Natürlich gibt's die Zeil. Was soll denn das sonst sein? Elf. Ey, ich will auch die Zeil geliefert bekommen. Okay, Goethe-Straße. What the fuck? Was ist mit Pizza-Hut los? Band. Wie Goethe-Straße eins ist nicht drinne. Ach so. Postal-Zeil erkennt er, der ist aber schlecht gemacht. Äh ja. Ich will euch einfach nur mal zeigen. Also, eine Sache schmeckt, oder wir gehen einfach Lieferando-Pizza-Hut. Ist auch vollkommen egal. Nur eine Sache will ich... Ja, Hauptbahnhof. Perfekt. Eine Sache ist richtig gut beim Pizza-Hut. Und zwar, die Barbecue... Meine Vorschauers übelst am Abkacken vom Stream. Barbecue-Lovers. Genau. Wo ist das denn? Barbecue-Lovers. Hier, die da. Die schmeckt übertrieben gut. Poggers-Pizza hier. Huge. Ich mag ansonsten Pizza-Hut nicht, aber die ist wirklich geil. Die ist wirklich geil. Hier ein schönes Bild von. Die ist wirklich geil. Bacon, Pepperoni-Wurst und Barbecue-Sauce. Die ist wirklich geil. Bestellen und Refueling. Ich hab die erst vor ein paar Tagen bestellt. Aber das nächste Mal lasse ich euch daran teilhaben, Chat. Übelst nice. Weil ich hab jetzt ja auch eine Kamera, da kann ich das reinhalten. Die Kamera ist zwar eigentlich für Mikro-Controller und Mainboards zum Einplanten, wenn wir was basteln gedacht haben, aber ich kann auch Pizza-Cam machen, kein Problem. Also, das ist wirklich sehr, sehr nice. Ist die von den Pit Boys erstellt? Nee, wahrscheinlich eher nicht. Aber es wäre geil, wenn es eine Pizza-Hut-Barbecue-Pit-Boys-Kollaboration gäbe. Ich bin übrigens doof. Ich hab den Chat nicht aufgemacht. Das kann ich gar nicht nachgucken, ob es irgendwelche offenen Punkte gab. Hast du eigentlich dein Licht automatisiert bezüglich Smart Home? Ja, also nicht viel. Ich hab eine RGB-Lampe, die anzeigt, ob der Zug Verspätung hat. Dass ich gleich morgens beim Aufstehen sehe, ob das Ding schon Verspätung hat oder nicht. Ups. Ich hab mal einen Weihnachtsbaum im Smart Home drin mit RGB-Lüchterkette, aber ansonsten hab ich keinerlei Licht großartig mit Beleuchtungsszenen und sonst was. Ich hab ein paar Relays zum Lichtan- und Ausschalten. Ja, aber das war's. Serious Max, es gab mal eine Zeit, da war das fast jeden Morgen rot, die RGB für die Bahn. Wie gesagt, ich hab ein paar Relays für Lichter zum Ein- und Ausschalten. Das ist aber alles, was ich großartig an Lichter-Automatisierung hab. Falls du ein paar Relays zum Ein- und Ausschalten für Lichter empfohlen haben willst, da kann ich dir was Gutes empfehlen. Aber RGB-Lichter, keine Ahnung. So, ich muss mal kurz den Chat durchgehen, weil ich hab in der letzten Zeit gar nicht mitgelesen. Gyros-Pizza, oh nee, das ist was, da hätt ich keinen Bock drauf. Ich glaub, das wird mir nicht schmecken. Aber jedem was ihm schmeckt, ne. Wenn euch Gyros Pizza schmeckt oder wenn euch sogar Ananas Pizza schmeckt, esst was ihr wollt. Solange ich meine Spargel-Sauce-Hollandes-Pizza essen darf. Nee, Chat war nix. Also Chat, wenn ihr irgendwelche Fragen übersehen habt, gönnt ihr Linus Tech-Tipps letzte Tweet. Wenn ihr irgendwas übersehen habt im Chat, dann sagt ich, ich hab Bescheid. Letzte Tweet, New Video, nee. Ja, wie gesagt, ich seh das sehr skeptisch, diese Verbesserung da. Also ich bin da ganz verhalten begeistert davon. Genau, die Shelly-Sachen sind super. Die wollte ich ihm grad auch empfehlen, falls er sowas braucht. Nee, ich hab im Chat anscheinend nix übersehen, okay. Also wie gesagt, wenn ihr was übersehen habt, schreibt einfach nochmal rein. So, exellent. Es ging doch um die Hot Wheels, nee, oder? Das ist einfach nur ein neues Video. Nee, er meint schon den Tweet hier. Wie gesagt, ich bin da verhalten optimistisch, ja. Also ich denke, es wird nicht komplett ausgedacht sein, aber als sehr optimiert und genau die passenden Sachen rausgesucht. Passende Settings, passende Auflösungen, passende Vergleichsmöglichkeiten. Also die Sachen sind immer mit Vorsicht zu genießen. Noch ein paar Stellen anzeigen. Ich glaub, das passt jetzt grad nicht rein. Hast du da ein Video mit der Deutschen Bahn und RGB? Nein, hab ich nicht. Gab es einen Preis für den 5.900? Nee. Das höchste, was die gezeigt haben, war der 950X. Ach nee, Moment. Das war das größte, was sie gezeigt haben. Zu den anderen Sachen haben sie nichts gesagt. Ich glaube, der wird hier auch noch gar nicht drinne stehen. Nee. Was? Also zu 5.990X hab ich nix mitgekriegt. Was? Quatsch, nein. Chat. 5.990X, da haben die noch nix zugesagt. Die haben zum 5.900X was gesagt, aber nicht zum 5.990X. Choose my name oder der echte Proxy? Nee, das geht über das eingebaute Bahnmodul von Home Assistant. Wobei das in letzter Zeit ganz schön rumgespackt hat, muss ich sagen. Das geht direkt hier drüber. Da gibst du an, von welcher Station du fährst, zu welcher Station du fährst und dann musst du nur noch sagen hier Only Direct Connections, dass er dir auch den richtigen Zug raussucht und dann zeigt er dir direkt den Webinterface an, ob dein Zug Verspätung hat oder nicht und wenn du die Info hast, kannst du danach dann auch ein Template machen und eine RGB Lampe steuern mit den Infos. Genau, also das hier ist das Höchste, was wir heute gezeigt haben. Mit 5.990X haben sie nix zugezeigt. Gibt's ja gar nicht oder keine Ahnung, bei AMD Benahmung ist da alles möglich. Achso, den haben sie gezeigt. Der hat irgendwas um 500 Euro gekostet. Dollar, aber im Prinzip ist ja der Kram. Du kannst den Kram ja fast mehr oder weniger 1 zu 1 in Euro umrechnen. Sorry, bin gerade erst rein. Sind die neuen Prozesse krass oder wie erwartet? Also ich würde sagen, wie erwartet? Nicht übertrieben krass, aber ziemlich gut. Kennst du dich mit Smartphones aus? Nee, nicht großartig. Aber ich finde das ziemlich gut, was AMD gezeigt hat. Es ist die konsequente Weiterentwicklung von dem, was sie schon vorher gemacht haben. Also was anderes habe ich jetzt nicht erwartet. Also ich habe nicht gedacht, dass AMD jetzt um die Ecke kommt irgendwie und sagt Bam 32 Kerne Desktop CPU, Bam 5,5 GHz, 6 GHz Boost oder da habe ich ehrlich gesagt nicht mit gerechnet. Wäre auch ziemlich unrealistisch gewesen. Ich meine, es wäre natürlich Porgas gewesen, aber da kommt man eigentlich nicht mit rechnen. Das ist eigentlich eher so die logische konsequente Weiterentwicklung und das ist auch okay. Chuck 690, 14 Monate schon, guck mal hier. Massive Brain Subscripts, danke schön. 10900, wie spricht man die Intel CPUs eigentlich richtig aus? 10900K, 10900K, 10900K, zumindest man kann nicht schlecht sagen, ob sie den platt gemacht haben. In der Präsentation haben sie gesagt, sie haben den platt gemacht, aber es ist halt die Frage, wie sehr man diesen Sachen trauen kann, was sie in der offiziellen Präsentation zeigen. Ich gehe davon aus, dass es nicht komplett erlogen ist, aber ich gehe davon aus, dass sie halt wirklich sehr optimale Settings in den besten Stellen in einem Spiel, wo man das eben zeigen kann, genommen haben. Und da waren sie eine ganze Ecke schneller, guck mal hier, hier zeigt das doch gerade im Video, wie viel schneller die waren. Das ist wohl der Vergleich von AMD aber wohlgemerkt, von AMD der Vergleich zum 10900K. Also, es ist ein bisschen schneller. Und gerade in CS GO und League of Legends, ok. Aber wie gesagt, es ist schwierig zu sagen, also ich warte erstmal, bis es unabhängige Benchmarks gibt. Genau und außerdem ist es 1080p, wie gesagt, die haben schon absichtlich genau das rausgesucht, was halt gut passt. Zumindest wenn man jetzt den 10900K hat, der ist ja über Nacht nicht schlecht, wie gesagt, ich habe ja auch noch ein 8700K drinne und bei mir war das Problem die ganze Zeit, ich habe keinen Grund gefunden zum Upgraden. Aber PClustig, ich wollte es gerade sagen, ich kann schon verstehen, warum es mit 1080p gemacht hat. Weil in 1080p kannst du deutlich besser zeigen, je nach Szene, je nach Game, kannst du deutlich besser zeigen, was die CPU so kann, deswegen wäre vielleicht sogar fast Low Image Quality noch besser gewesen, was die CPU so kann, als bei 4K, wo es hauptsächlich an der Grafikkarte hängt. Ja, Mad Vibe, das haben wir vorher auch schon besprochen, das war ja gerade zu lächerlich, was Intel getrieben hat mit den neuen Sockel in den letzten Jahren. Wie gesagt, äh, keine Ahnung, CPU hat jetzt 2MB mehr Cache, bam, neuer Sockel. CPU hat jetzt irgendwie, was weiß ich, den Heatspreader andersrum drauf gemacht, neuer Sockel, Intel hat für jeden Scheiß neuer Sockel gemacht. Ja, gut, was soll ich noch großartig sagen zu dem Tohler Geschichte, wir müssen uns mal abwarten, ich bin halt, also wo ich wirklich am meisten gespannt drauf bin, ist, ob es am 5. November wirklich welche lieferbar gibt, oder zumindest, dass man, wenn man früh dran ist, eine halbwegs realistische Chance hat einzubekommen. Hast du Stonks von AMD? Nein, ich hab keine AMD Stonks, wobei AMD Stonks auch gerade nicht so gut sind, was ich nicht verstehe, weil die AMD Aktie ist jetzt erstmal runtergefallen, bei der Präsentation hier, guck, bam, warum auch immer, die Ankündigungen waren eigentlich vollkommen in Ordnung, Stonks erstmal hier, hopp, hat sich ausgestonkt, was Nvidia auch, echt, da würd ich jetzt nicht allzu viel drauf geben, aber morgen abwarten. Kommt in absehbarer Zukunft nochmal ein Laberstelz? Ja, ich hab einfach am Sonntag was aufgenommen, aber es hat mir nicht gefallen, das nehm ich immer neu auf, aber hat nichts mit AMD zu tun und nichts mit Gaming zu tun, hab ich ja letztens im Stream, im letzten Stream glaub ich schon ein bisschen erzählt. Also nein, ist für nichts, komm, ja, wenn's nach meinem Upload-Output geht, dann wahrscheinlich nicht, ne, oder eher nicht. Mein letztes, wie lang ist mein letztes Video schon her jetzt? Ups. Ah, halbes Jahr. Halbes Jahr ist es schon wieder her. Da machst du nix. Okay Leute, ist der Friseur am Start. Machst du Hito? Hab ich schon. Hab ich schon drin. Der Friseur streamt, bam, Leute. Ich hoste jetzt den Friseur. Oh, geh auf, weil ich hab für heute nichts geplant. Wir raiden den jetzt. Was geplant am 21? Ich glaub da ist Apple, ne? Der Friseur spielt wieder irgendwelche Weep-Games. Also, dann spamme mal beim Friseur kurz ein bisschen rum, der freut sich bestimmt. Und am 13. ist Apple-Event, kann auch sein, ich weiß nicht, ich werde es nach Möglichkeit streamen und mein Self zugeben. Also, wir sehen uns im nächsten Stream, machts gut, bis dann, see you.", "segments": [{"id": 1, "start": 0.0, "end": 28.16, "text": "So, da bin ich ja mal gespannt."}, {"id": 2, "start": 28.16, "end": 31.96, "text": "Gucken, ob Teams wieder irgendwas umgestellt hat."}, {"id": 3, "start": 31.96, "end": 40.24, "text": "Weiß ja nie."}, {"id": 4, "start": 40.24, "end": 43.16, "text": "Passt alles, exellent."}, {"id": 5, "start": 43.16, "end": 49.4, "text": "Gut, äh gut, den YouTube-Chat müssen wir uns hier angucken."}, {"id": 6, "start": 49.4, "end": 53.4, "text": "Wir können, 23 Minuten geht das ganze los."}, {"id": 7, "start": 53.4, "end": 56.96, "text": "Ich muss mir ja gerade mal noch ein bisschen was entspannenderes suchen."}, {"id": 8, "start": 56.96, "end": 59.96, "text": "Hallo, YouTube?"}, {"id": 9, "start": 59.96, "end": 62.76, "text": "YouTube hat keinen Bock."}, {"id": 10, "start": 62.76, "end": 63.76, "text": "Grip."}, {"id": 11, "start": 63.76, "end": 64.76, "text": "Irgendwas."}, {"id": 12, "start": 64.76, "end": 67.76, "text": "Wupp, wupp, wupp."}, {"id": 13, "start": 67.76, "end": 68.76, "text": "Genau."}, {"id": 14, "start": 68.76, "end": 69.76, "text": "So."}, {"id": 15, "start": 69.76, "end": 70.76, "text": "23 Minuten."}, {"id": 16, "start": 70.76, "end": 75.52, "text": "Ähm, gibt es denn schon, da müssen wir mal gucken, gibt es irgendwelche Predictions"}, {"id": 17, "start": 75.52, "end": 76.52, "text": "schon?"}, {"id": 18, "start": 76.52, "end": 78.12, "text": "Lass wir mal gucken, was davon stimmt."}, {"id": 19, "start": 78.12, "end": 79.12, "text": "Predictions."}, {"id": 20, "start": 79.12, "end": 80.12, "text": "Gucken wir mal."}, {"id": 21, "start": 80.12, "end": 87.6, "text": "Was da die Leute prediktet haben."}, {"id": 22, "start": 87.6, "end": 98.32, "text": "Allerdings, äh, wobei, weißte was, wir gucken auf Reddit, auf Reddit sind die bei sowas"}, {"id": 23, "start": 98.32, "end": 99.52, "text": "immer eher auf Zack."}, {"id": 24, "start": 99.52, "end": 112.64, "text": "Oh, ein bisschen kleiner machen wir noch, schieben es ein bisschen in die Ecke."}, {"id": 25, "start": 112.64, "end": 113.64, "text": "So."}, {"id": 26, "start": 113.64, "end": 120.24, "text": "5000er-Series, ja, davon geht man, geht man ja wirklich überall schon aus."}, {"id": 27, "start": 120.24, "end": 130.84, "text": "Okay, das ist kein Livestream, auch wenn die so tun, aha, ist das so?"}, {"id": 28, "start": 130.84, "end": 138.36, "text": "Na gut, steht überall live, letztendlich ist es wurscht, wir sehen es ja alle zeitgleich."}, {"id": 29, "start": 138.36, "end": 143.76, "text": "Also egal, ob das ein Livestream ist, ob da irgendwie einer, eine ist es ja, bei AMD"}, {"id": 30, "start": 143.76, "end": 147.68, "text": "auf der Bühne steht und erzählt wie Super Amazing noch nie da gewesen und Katiosi reCPU"}, {"id": 31, "start": 147.68, "end": 150.84, "text": "sind, oder ob das recorded ist, ist mir ehrlich gesagt ziemlich wurscht."}, {"id": 32, "start": 150.84, "end": 156.88, "text": "Gibt es da irgendwelche Predictions?"}, {"id": 33, "start": 156.88, "end": 161.92, "text": "Weil der gelingen hat, muss ich mir gerade nochmal die aktuellen AMD Desktop CPUs angucken,"}, {"id": 34, "start": 161.92, "end": 164.96, "text": "weil ihr wisst ja, ich bin jetzt nicht der Wahnsinns-CPU-Guru, was das angeht, also ich"}, {"id": 35, "start": 164.96, "end": 169.64, "text": "kann euch nicht, äh, anhand des, der Pin-Belegung von hinten sagen, was das für eine CPU ist"}, {"id": 36, "start": 169.64, "end": 172.16, "text": "oder sowas, wobei die Pins sehen eigentlich überall gleich aus."}, {"id": 37, "start": 172.16, "end": 174.16, "text": "Na, ihr wisst, was ich mein."}, {"id": 38, "start": 174.16, "end": 177.92, "text": "Ich weiß, was ich missen muss und ich kenne mich immer nur aus, wenn ich mir einen neuen"}, {"id": 39, "start": 177.92, "end": 182.88, "text": "PC kaufe und aktuell kann ich mir keinen neuen PC kaufen, weil ich bekomme erstens keine"}, {"id": 40, "start": 182.88, "end": 185.92, "text": "neue Grafikkarte und zweitens gibt es keine CPU, die mir was bringt."}, {"id": 41, "start": 185.92, "end": 198.0, "text": "Also, zeig mal hier, äh, nee, Threadripper, das brauchen wir nicht, Ryzen, Brauma, so,"}, {"id": 42, "start": 198.0, "end": 205.96, "text": "das sind die aktuellen, 7, 7, 9, 5, die 3 sind jetzt nicht so, nicht so spannend, genau,"}, {"id": 43, "start": 205.96, "end": 206.96, "text": "was hatten sie?"}, {"id": 44, "start": 206.96, "end": 211.96, "text": "Also, ich muss ehrlich sagen, die Intel-Seite finde ich deutlich übersichtlicher, was CPU-Vergleiche"}, {"id": 45, "start": 211.96, "end": 212.96, "text": "angeht."}, {"id": 46, "start": 212.96, "end": 223.48, "text": "Jetzt bei AMD ist es ein bisschen, ähm, bisschen, ja, nicht so schön übersichtbar, bei Intel"}, {"id": 47, "start": 223.48, "end": 228.16, "text": "suchst du zum Beispiel nach einem 8700K, so, dann kommst du auf diese Seite hier und hast"}, {"id": 48, "start": 228.16, "end": 229.16, "text": "alles da."}, {"id": 49, "start": 229.16, "end": 233.48, "text": "Sowas, ich meine, die AMD-Seite sieht schicker aus, ja, aber das, äh, so finde ich das schon"}, {"id": 50, "start": 233.48, "end": 234.48, "text": "angenehmer."}, {"id": 51, "start": 234.48, "end": 235.48, "text": "Wahrscheinlich haben die auch sowas."}, {"id": 52, "start": 235.48, "end": 240.96, "text": "Hitopipo, oh, wobei, das, das müssen wir gerade mal probieren, ob mein Text-to-Speech"}, {"id": 53, "start": 240.96, "end": 241.96, "text": "das hinbekommt."}, {"id": 54, "start": 241.96, "end": 247.36, "text": "Hitopipo zu sagen, mein Text-to-Speech kackt ja, kackt ja manchmal ganz gerne ab."}, {"id": 55, "start": 247.36, "end": 265.04, "text": "Also, äh, Text-to-Speech, Hitpipo, Hyper-Subscriber-Big-Brain, Hitpipo, okay, oh, ich hab's gecrasht,"}, {"id": 56, "start": 265.04, "end": 271.68, "text": "Leute, RIP, ja, das ist ein bisschen verbuggt seit, seit, äh, ja, Jahren quasi schon,"}, {"id": 57, "start": 271.68, "end": 288.76, "text": "aber, äh, ich hab, war besser zu faul, das zu fixen, Hitpipo, jetzt, pass auf, das funktioniert,"}, {"id": 58, "start": 288.76, "end": 300.96, "text": "Hitpipo, Hitdo, Hyper-Subscriber-Big-Brain, Hitpipo, ohje, ne, das ist nix, aber Hit ist"}, {"id": 59, "start": 300.96, "end": 315.0, "text": "schon mal richtig, Hit ist schon mal, okay, äh, mh, das hört sich aber nicht gut an,"}, {"id": 60, "start": 315.0, "end": 335.56, "text": "h'haha, okay, wir kommen in die Nähe, fast, fast, das ist okay, es geht, es geht, na ja,"}, {"id": 61, "start": 335.56, "end": 341.84, "text": "ok, also, die, die, das ist ja auch, das ist ja auch kein japanisch Text-to-Speech-Service,"}, {"id": 62, "start": 341.84, "end": 345.44, "text": "Text-to-Speech-Service, das ist ja auch ein koreanischer Text-to-Speech-Service, glaube ich, ne?"}, {"id": 63, "start": 345.44, "end": 346.84, "text": "Keine Ahnung, dass die das nicht kann."}, {"id": 64, "start": 347.84, "end": 349.24, "text": "Vielleicht soll man das so machen, Pippo."}, {"id": 65, "start": 350.34, "end": 351.04, "text": "Pippo."}, {"id": 66, "start": 353.54, "end": 354.04, "text": "Pippo."}, {"id": 67, "start": 354.94, "end": 355.44, "text": "Pippo."}, {"id": 68, "start": 357.34, "end": 358.04, "text": "Pippo."}, {"id": 69, "start": 359.54, "end": 362.04, "text": "Funktioniert nicht so wirklich gut, wie ich mir das vorgestellt hab."}, {"id": 70, "start": 362.04, "end": 369.14, "text": "Pippo."}, {"id": 71, "start": 369.14, "end": 369.74, "text": "Pippo."}, {"id": 72, "start": 372.44, "end": 373.34, "text": "Hito Pippo."}, {"id": 73, "start": 374.04, "end": 377.24, "text": "Ja, ja, das ist gar nicht so, gar nicht so, gar nicht so, so schlecht."}, {"id": 74, "start": 379.14, "end": 379.94, "text": "Hito Pippo."}, {"id": 75, "start": 381.14, "end": 382.74, "text": "Ja, das ist okay, das ist nicht schlecht."}, {"id": 76, "start": 384.34, "end": 386.84, "text": "Hört sich jetzt zwar eher an, wie Hito Pippo."}, {"id": 77, "start": 386.84, "end": 391.24, "text": "Das ist um 18 Uhr geht es los."}, {"id": 78, "start": 391.24, "end": 394.14, "text": "Hier, guckt, da, Moment, ich hab sie auf."}, {"id": 79, "start": 396.14, "end": 397.14, "text": "18 Minuten."}, {"id": 80, "start": 399.94, "end": 405.94, "text": "YouTube Chat versucht, sein bestes Twitch Chat zu sein, aber YouTube Chat ist einfach unterlegen."}, {"id": 81, "start": 405.94, "end": 406.94, "text": "Das wissen wir ja."}, {"id": 82, "start": 408.34, "end": 409.34, "text": "Hito Pippo."}, {"id": 83, "start": 410.74, "end": 411.74, "text": "Hito Pippo."}, {"id": 84, "start": 411.74, "end": 421.74, "text": "Hito Pippo."}, {"id": 85, "start": 421.74, "end": 422.74, "text": "Hito Pippo."}, {"id": 86, "start": 422.74, "end": 424.44, "text": "Nee, das hört sich alles dumm an."}, {"id": 87, "start": 425.44, "end": 426.44, "text": "Hito Pippo."}, {"id": 88, "start": 428.24, "end": 429.64, "text": "Mein Chat-Overlay ist aus."}, {"id": 89, "start": 429.64, "end": 441.64, "text": "Ja gut, das kann ich anmachen, aber wenn die Übertragung anfängt, müssen wir das Ganze wieder, müssen wir das eh ausmachen."}, {"id": 90, "start": 441.64, "end": 442.64, "text": "Hito Pippo."}, {"id": 91, "start": 442.64, "end": 443.64, "text": "Hito Pippo."}, {"id": 92, "start": 445.64, "end": 446.64, "text": "Das ist so dumm, Alter."}, {"id": 93, "start": 446.64, "end": 447.64, "text": "Hito Pippo."}, {"id": 94, "start": 449.14, "end": 450.14, "text": "Piss dich also."}, {"id": 95, "start": 450.14, "end": 455.14, "text": "Hito Pippo."}, {"id": 96, "start": 455.14, "end": 458.14, "text": "Ich muss mal, Moment, ich muss die Emotes mal ein bisschen kleiner machen."}, {"id": 97, "start": 462.14, "end": 463.14, "text": "Bisschen wegschieben."}, {"id": 98, "start": 469.14, "end": 470.14, "text": "Excellent."}, {"id": 99, "start": 471.14, "end": 472.14, "text": "So ist gut."}, {"id": 100, "start": 472.14, "end": 475.14, "text": "So, jetzt haben wir die AMD-CPUs hier mal."}, {"id": 101, "start": 475.14, "end": 479.14, "text": "Kurz reingucken, dass ich so ungefähr..."}, {"id": 102, "start": 481.14, "end": 482.14, "text": "Hier ist es kaputt."}, {"id": 103, "start": 484.14, "end": 485.14, "text": "Geht wieder."}, {"id": 104, "start": 485.14, "end": 488.14, "text": "Dass ich so ungefähr einen Plan habe von dem, was die gleich erzählen."}, {"id": 105, "start": 488.14, "end": 490.14, "text": "Bist du wirklich 36?"}, {"id": 106, "start": 490.14, "end": 493.14, "text": "Tja, wir werden es nie rausfinden."}, {"id": 107, "start": 497.14, "end": 499.14, "text": "Nutella mit oder ohne Butter?"}, {"id": 108, "start": 499.14, "end": 513.14, "text": "Ohne mit Butter ist Pepega-Style, das ist eklig."}, {"id": 109, "start": 513.14, "end": 516.14, "text": "So, Chat, also, wen haben wir denn hier am Start?"}, {"id": 110, "start": 516.14, "end": 521.14, "text": "Marc Yoyo wieder da, Captain Peng, Muscle Plays, der Titan Toaster."}, {"id": 111, "start": 521.14, "end": 523.14, "text": "Übrigens, wo bleibt eigentlich mein Toaster?"}, {"id": 112, "start": 523.14, "end": 527.14, "text": "Ich hab den Toaster bestellt und angeblich sollte der heute ankommen."}, {"id": 113, "start": 527.14, "end": 528.14, "text": "Was sagt denn Amazon dazu?"}, {"id": 114, "start": 528.14, "end": 531.14, "text": "Moment, Moment, muss ich mal kurz nebenbei gucken."}, {"id": 115, "start": 531.14, "end": 533.14, "text": "Ankunft heute bis 20 Uhr."}, {"id": 116, "start": 533.14, "end": 534.14, "text": "Hermes!"}, {"id": 117, "start": 537.14, "end": 539.14, "text": "Hermes, muss das sein?"}, {"id": 118, "start": 543.14, "end": 545.14, "text": "Also, Hermes ist ja... Nee."}, {"id": 119, "start": 547.14, "end": 550.14, "text": "Nee, nee, Hermes ist ja die schlimmste Versandoption, die es irgendwie gibt."}, {"id": 120, "start": 551.14, "end": 556.14, "text": "So, ähm, der Knäber ist auch am Start, Tribulon haben wir auch, der Flow 690 ist da."}, {"id": 121, "start": 556.14, "end": 562.14, "text": "Herz 93, El Mustafa ist da, wenn den Herr... Nee, hatten wir schon, der Phipps ist da."}, {"id": 122, "start": 562.14, "end": 566.14, "text": "Cheat 95, Max Rolls, King Wall."}, {"id": 123, "start": 566.14, "end": 569.14, "text": "Ja, viele der üblichen Verdächtigen wieder am Start."}, {"id": 124, "start": 570.14, "end": 575.14, "text": "Ich bin echt gespannt, was AMD vorstellt, weil ihr wisst ja, dass ich mir eigentlich seit letztem Jahr schon einen neuen PC kaufen will."}, {"id": 125, "start": 575.14, "end": 577.14, "text": "Und es sich einfach nicht lohnt aktuell."}, {"id": 126, "start": 577.14, "end": 584.14, "text": "Und ich ja drauf spekuliere, dass es sich vielleicht mit einer neuen Grafikkarte, also mit einer neuen Nvidia-Grafikkarte,"}, {"id": 127, "start": 584.14, "end": 589.14, "text": "ich glaube nicht, dass AMD irgendwie da was raushaut, was da Konkurrenz macht bei Nvidia,"}, {"id": 128, "start": 589.14, "end": 600.14, "text": "dass ich dann mit einem 5950X plus 13090 mal endlich einen sinnvollen Upgradeweg habe, der sich auch lohnt."}, {"id": 129, "start": 600.14, "end": 606.14, "text": "Weil bisher, ich habe eine 1080 CI und 8700K und den habe ich übertaktet ein bisschen."}, {"id": 130, "start": 606.14, "end": 610.14, "text": "Aktuell gibt es schlicht und ergreifend nichts, was nennenswert schneller wäre."}, {"id": 131, "start": 610.14, "end": 614.14, "text": "Du findest zwar was mit massig viel Kern, was im Benchmark schneller ist und sowas,"}, {"id": 132, "start": 614.14, "end": 617.14, "text": "aber in praktischer Anwendung macht das alles keinen Unterschied."}, {"id": 133, "start": 628.14, "end": 632.14, "text": "Max, du bist einfach immer noch der geilste, weil du damals meine Rollstuhl-Hater-Jokes instant ver-"}, {"id": 134, "start": 632.14, "end": 635.14, "text": "Ach du bist der Rollstuhl-Hater, nice."}, {"id": 135, "start": 636.14, "end": 638.14, "text": "Bester Rollstuhl-Hater."}, {"id": 136, "start": 638.14, "end": 642.14, "text": "Na gut, es gibt auf YouTube viele Leute, die verstehen absolut nicht, wenn einer irgendwie"}, {"id": 137, "start": 642.14, "end": 646.14, "text": "einen Witz macht, ohne direkt zu sagen, dass es ein Witz ist."}, {"id": 138, "start": 646.14, "end": 649.14, "text": "Also YouTube-Homor geht so, nur Leute ist das lustig."}, {"id": 139, "start": 653.14, "end": 656.14, "text": "Und ansonsten kapieren die Leute das nicht, wenn du das auf YouTube machst."}, {"id": 140, "start": 659.14, "end": 661.14, "text": "Genshin Impact getestet, ne."}, {"id": 141, "start": 661.14, "end": 664.14, "text": "Ich habe mir einen Account, oder besser gesagt, ich wollte mir einen Account machen."}, {"id": 142, "start": 666.14, "end": 668.14, "text": "Aber ich habe mir keinen Account gemacht."}, {"id": 143, "start": 668.14, "end": 671.14, "text": "Der Fabian spielt das ja gerade rauf und runter."}, {"id": 144, "start": 671.14, "end": 677.14, "text": "So, also ich musste mal gucken, was aktuell einen 3.150X hat."}, {"id": 145, "start": 677.14, "end": 681.14, "text": "Eine Sache, die ich auch merkwürdig finde, warum haben die 4.000 übersprungen?"}, {"id": 146, "start": 681.14, "end": 684.14, "text": "4.000 waren Notebook-CPUs, das wollten sie wohl nicht verwenden."}, {"id": 147, "start": 684.14, "end": 687.14, "text": "Und außerdem haben sie sich gedacht, dass sie das nicht verwenden wollen."}, {"id": 148, "start": 687.14, "end": 691.14, "text": "Und die können auch auf 50 Versionen überspringen, da können wir einfach auch mal 1.000 überspringen."}, {"id": 149, "start": 691.14, "end": 693.14, "text": "Das ist gar kein Problem."}, {"id": 150, "start": 693.14, "end": 694.14, "text": "Was?"}, {"id": 151, "start": 694.14, "end": 696.14, "text": "Valorant ist tot, warum das denn?"}, {"id": 152, "start": 699.14, "end": 701.14, "text": "Das kann ich mir gar nicht vorstellen."}, {"id": 153, "start": 701.14, "end": 705.14, "text": "Das letzte Mal, wo ich Valorant auf Twitch geguckt habe, war das noch ziemlich alive."}, {"id": 154, "start": 707.14, "end": 709.14, "text": "Zeig mal, Browse."}, {"id": 155, "start": 709.14, "end": 719.14, "text": "Ja, also, ich würde es jetzt nicht unbedingt als tot bezeichnen, wenn es in Regionen wie Apex, Minecraft und Noter II schwebt."}, {"id": 156, "start": 719.14, "end": 723.14, "text": "Mein Gut mag kein League of Legends sein und es mag jetzt kein Fortnite sein, von der Beliebtheit her."}, {"id": 157, "start": 724.14, "end": 727.14, "text": "Und auch kein CS und Warzone, aber tot ist es nicht."}, {"id": 158, "start": 728.14, "end": 731.14, "text": "Aber es ist nicht tot, es ist nicht tot, es ist nicht tot."}, {"id": 159, "start": 731.14, "end": 734.14, "text": "Und es ist nicht tot, es ist nicht tot, es ist nicht tot."}, {"id": 160, "start": 734.14, "end": 739.14, "text": "Wie kommst du zu der Annahme, was will Twitch eigentlich von mir?"}, {"id": 161, "start": 739.14, "end": 741.14, "text": "Ich bin überhaupt nicht eingeloggt, Twitch."}, {"id": 162, "start": 741.14, "end": 743.14, "text": "Jaja, ist alles klar."}, {"id": 163, "start": 743.14, "end": 744.14, "text": "Na natürlich."}, {"id": 164, "start": 745.14, "end": 747.14, "text": "Prime Gaming."}, {"id": 165, "start": 747.14, "end": 752.14, "text": "Also ich hab seit 2000, drei oder so, Prime, Ewig."}, {"id": 166, "start": 752.14, "end": 754.14, "text": "Ich hab Prime seit es Prime gibt."}, {"id": 167, "start": 755.14, "end": 759.14, "text": "Noch nicht komm, aber warum sollte, warum sollte es noch nicht kommen von Twitch?"}, {"id": 168, "start": 759.14, "end": 765.1, "text": "Ich hab Prime, seit es Prime gibt noch nicht Kombi, aber warum sollte Valorant in deiner"}, {"id": 169, "start": 765.1, "end": 766.46, "text": "Meinung nach tot sein?"}, {"id": 170, "start": 766.46, "end": 770.46, "text": "Es gibt ab und zu mal Turniere, nicht mal so viel wie in der Beta, muss ich sagen, ich"}, {"id": 171, "start": 770.46, "end": 772.7, "text": "verfolge das auch noch am Rande aktuell."}, {"id": 172, "start": 772.7, "end": 778.82, "text": "Es gibt immer mal wieder neue Teams, es gibt sogar so eine Art Profi-Spieler, die damit"}, {"id": 173, "start": 778.82, "end": 782.18, "text": "zumindest Geld verdienen, also so tot sieht das nicht aus."}, {"id": 174, "start": 782.18, "end": 792.58, "text": "Wenn du ein totes Spiel sehen willst, dann musst du die Overwatch angucken, weil Overwatch"}, {"id": 175, "start": 792.58, "end": 797.74, "text": "ist ja nun wirklich, nein, Overwatch ist genauso wenig tot, aber im Vergleich zum Potential,"}, {"id": 176, "start": 797.74, "end": 801.62, "text": "was das Game eigentlich ist, Overwatch irgendwie RIP."}, {"id": 177, "start": 801.62, "end": 808.78, "text": "Prime, Massive Subscription hier, ganz schön Sneaky, reingestellt die Subscription, Dankeschön."}, {"id": 178, "start": 808.78, "end": 823.98, "text": "Die warten halt auf Teil 2, Blizzard hat es mit Overwatch total verkackt, die haben richtig"}, {"id": 179, "start": 823.98, "end": 827.46, "text": "gut gestartet und dann ihre Blizzard-Taktik gemacht."}, {"id": 180, "start": 827.46, "end": 833.1, "text": "Die Blizzard-Taktik ist, wir wissen es besser als alle anderen, scheißen auf das was die"}, {"id": 181, "start": 833.1, "end": 838.26, "text": "Leute sagen und bringen Patches raus, die jenseits von Gut und Böse Sachen machen."}, {"id": 182, "start": 838.26, "end": 845.9, "text": "Die Blizzard-Taktik ist, bleiben wir mal bei einem einfachen Beispiel, es gibt ein Spiel"}, {"id": 183, "start": 845.9, "end": 852.86, "text": "mit drei Klassen, egal welche Klassen, eine Klasse davon ist total OP."}, {"id": 184, "start": 852.86, "end": 859.9, "text": "Die Blizzard-Taktik ist, die anderen beiden ein bisschen zu buffen und dann drei von fünf"}, {"id": 185, "start": 859.9, "end": 866.38, "text": "Fähigkeiten der OP-Klasse komplett uses zu machen, sodass die Klasse nach dem Patch"}, {"id": 186, "start": 866.38, "end": 870.38, "text": "von der besten Klasse zu der mit Abstand schlechtesten Klasse wird."}, {"id": 187, "start": 870.38, "end": 871.38, "text": "Das ist die Blizzard-Taktik."}, {"id": 188, "start": 871.38, "end": 875.9, "text": "Das haben die schon gerne, das haben die anderen Games auch schon gerne gemacht."}, {"id": 189, "start": 875.9, "end": 885.1, "text": "So und dieses Holzhammer-Balancing mit teilweise monatelangem Schweigen haben sie halt in Overwatch"}, {"id": 190, "start": 885.1, "end": 888.98, "text": "am Anfang lange gemacht, mittlerweile ist das besser, aber das haben die halt angefangen"}, {"id": 191, "start": 888.98, "end": 894.58, "text": "als Overwatch schon irgendwie auf dem Absteigen nass war, dazu kommt, dass die viel zu wenig"}, {"id": 192, "start": 894.58, "end": 899.66, "text": "das ganze, ich meine, es klingt jetzt blöd wenn ich sage, aber ich bin der Mann, die"}, {"id": 193, "start": 899.66, "end": 900.98, "text": "haben es zu wenig ausgeschlachtet."}, {"id": 194, "start": 900.98, "end": 907.38, "text": "Overwatch hatte so einen krassen Hype als rausgekommen ist, das war ja auch das erste"}, {"id": 195, "start": 907.38, "end": 912.26, "text": "Spiel so dieser Art, es gab danach noch ein bisschen mehr Hero Shooters und sowas, aber"}, {"id": 196, "start": 912.26, "end": 916.62, "text": "die hätten das so krass ausschlagen müssen, die haben ab und zu mal einen Kurzfilm rausgebracht,"}, {"id": 197, "start": 916.62, "end": 921.54, "text": "ab und zu mal einen Comic rausgebracht, die hätten da übelst abgemissen, die hätten"}, {"id": 198, "start": 921.54, "end": 926.46, "text": "eine Web-Series machen müssen, eine Live-Action-Serie machen müssen, Comic-Bücher releasen, laufen"}, {"id": 199, "start": 926.46, "end": 931.3, "text": "irgendwie Geschiss machen, es müssen laufen Maps, Helden, Patches, alles möglich kommen,"}, {"id": 200, "start": 931.3, "end": 935.9, "text": "du musst das Gefühl haben, dass sich der Overwatch-Content wenn du schlafen gehst umhaut, wenn"}, {"id": 201, "start": 935.9, "end": 936.9, "text": "du wieder aufstehst."}, {"id": 202, "start": 936.9, "end": 942.5, "text": "So ein bisschen wie die das seit Jahren in LoL machen, vielleicht auch nicht, naja,"}, {"id": 203, "start": 942.5, "end": 956.5, "text": "da... chat, das müsste, ich glaube, das würden wir nicht von Blizzard sehen, offiziell LoL"}, {"id": 204, "start": 956.5, "end": 962.02, "text": "von Warchenta als Eparo, aber die anderen Sachen, die hätten da übelst mehr, die hätten"}, {"id": 205, "start": 962.02, "end": 967.76, "text": "viel mehr machen müssen und nicht teilweise, wir machen nen Patch, buffen irgendwas übertrieben"}, {"id": 206, "start": 967.76, "end": 974.08, "text": "Und und und machen was total kaputt und dann halten wir sechs monat die klappe und äußern uns gar nicht mehr dazu"}, {"id": 207, "start": 975.24, "end": 981.72, "text": "Also irgendwie haben sie es voll verschissen, aber es ist besser geworden allerdings ist jetzt die ist dazu glaube ich abgefahren"}, {"id": 208, "start": 982.16, "end": 984.66, "text": "dazu kommt dazu kommt dass die Overwatch League"}, {"id": 209, "start": 985.28, "end": 989.86, "text": "Also meiner meiner mann nach ich fand das Konzept von der Overwatch League von Anfang an kacke"}, {"id": 210, "start": 991.08, "end": 996.68, "text": "In gewissen erfolg hat das ganze also man kann jetzt nicht sagen ich kann jetzt nicht sagen max ich hab's von Anfang an gesagt das stimmt"}, {"id": 211, "start": 996.68, "end": 1001.92, "text": "nicht ich hab ich hab eher das ganze schlechter voraus gesagt als es gelaufen ist mit der Overwatch League"}, {"id": 212, "start": 1002.32, "end": 1004.32, "text": "Alter was ist denn mit dem Chat Schluss?"}, {"id": 213, "start": 1006.36, "end": 1008.36, "text": "Youtube Chat beruhigt euch mal"}, {"id": 214, "start": 1018.76, "end": 1024.32, "text": "Genau ich wollte mal kurz die CPU angucken die also das ist ja die wo ich geliebäubig hab mir die zu kauf"}, {"id": 215, "start": 1024.32, "end": 1029.28, "text": "aber es dann sein lassen hab weil es kein richtiges Upgrade war für die Anwendungszwecke die ich hab"}, {"id": 216, "start": 1034.8, "end": 1036.08, "text": "So"}, {"id": 217, "start": 1036.08, "end": 1040.48, "text": "Genau ich wollte noch ein lass mich doch mal einen Satz zum thema Overwatch und Overwatch League sagen"}, {"id": 218, "start": 1040.72, "end": 1046.84, "text": "Wie gesagt die Overwatch League das ist ein bisschen besser gelaufen als ich mir das ausgemalt habe am Anfang aber insgesamt ist die Overwatch League trotzdem"}, {"id": 219, "start": 1047.36, "end": 1048.96, "text": "eSport mäßig"}, {"id": 220, "start": 1048.96, "end": 1057.24, "text": "Also generell eSport mäßig ist Overwatch kompletter fail die haben eine so so so eine franchise league gemacht wo sie alles unter unter Kontrolle haben"}, {"id": 221, "start": 1057.32, "end": 1061.88, "text": "Aber schon so sehr unter Kontrolle haben dass es finde ich einfach extrem langweilig ist"}, {"id": 222, "start": 1063.6, "end": 1070.92, "text": "So dazu kommt dass der ganze kram jetzt auf Youtube ist und dass sie es ewig gebraucht haben bis sie"}, {"id": 223, "start": 1072.08, "end": 1074.08, "text": "das Spiel mit"}, {"id": 224, "start": 1074.08, "end": 1081.36, "text": "eSport Content verbunden haben die haben ewig gebraucht bis die bis die die Overwatch League beworben haben überhaupt richtig"}, {"id": 225, "start": 1081.36, "end": 1086.36, "text": "Ewig gebraucht bis die in Game Skins und Geschiss rausgebracht haben das hat das hat teilweise ewig gedauert"}, {"id": 226, "start": 1086.36, "end": 1093.04, "text": "Du hättest im Hintergrund auf dem Startbildschirm direkt auch schon früher Matches promoten müssen und das größte Problem an"}, {"id": 227, "start": 1093.48, "end": 1098.32, "text": "Overwatch eSport ist wo man sieht dass das eigentlich nur mit viel viel Geld"}, {"id": 228, "start": 1099.36, "end": 1103.12, "text": "aufgeblasen ohne was dahinter ist sieht man daran dass es"}, {"id": 229, "start": 1103.12, "end": 1105.84, "text": "Keinerlei Tier 2 und Tier 3 gibt"}, {"id": 230, "start": 1106.44, "end": 1110.88, "text": "Und es gibt Tier 2 und Tier 3 Teams aber keine nennenswerte"}, {"id": 231, "start": 1111.32, "end": 1116.2, "text": "Competition keine nennenswerte Turniere kein nennenswertes irgendwas so und"}, {"id": 232, "start": 1116.52, "end": 1121.88, "text": "Ich meine was sagt uns das es gibt eine offizielle league wo es theoretisch auch ein bisschen Kohle zu holen gibt"}, {"id": 233, "start": 1121.88, "end": 1133.0, "text": "Aber es gibt nichts an Tier 2 und Tier 3 das sagt mir dass das künstlich aufgeblasener kram ist"}, {"id": 234, "start": 1134.6, "end": 1141.32, "text": "Guckt euch mal CS an CS ist voll CS hast du nicht nur die die es Teams du hast du hast"}, {"id": 235, "start": 1141.52, "end": 1144.96, "text": "Tier 2 Tier 3 Tier 4 es gibt ja teilweise sogar"}, {"id": 236, "start": 1145.8, "end": 1147.8, "text": "wenn du CS anguckst"}, {"id": 237, "start": 1147.8, "end": 1153.2, "text": "deutsche Leaks und sonst was ich habe keine ahnung das ist wahrscheinlich eher Richtung Tier 3 4"}, {"id": 238, "start": 1153.72, "end": 1156.88, "text": "Das gucken auch 2-3.000 Leute natürlich gucken dass keine"}, {"id": 239, "start": 1157.52, "end": 1163.24, "text": "150.000 Leute 500.000 Leute wie irgendwelche Majors aber das ist vorhanden das ist alive"}, {"id": 240, "start": 1163.6, "end": 1169.8, "text": "Das interessiert und das gibt es halt einfach bei Overwatch nicht oder bei LOL oder sonst wo so 5 Minuten noch also ich wollte mir"}, {"id": 241, "start": 1169.8, "end": 1171.8, "text": "mal schnell hier angucken"}, {"id": 242, "start": 1172.44, "end": 1174.44, "text": "Was ich mir hätte kaufen"}, {"id": 243, "start": 1174.44, "end": 1179.6, "text": "wollen aber dann nicht gemacht habe als kein richtiges Upgrade ist für meine Anwendungszwecke also"}, {"id": 244, "start": 1180.36, "end": 1185.64, "text": "Mal gucken ob es da was Vergleichbares gibt also die CPU die mich interessiert hat hatte wie viel 16 kerne"}, {"id": 245, "start": 1186.76, "end": 1189.04, "text": "und einen Base Takt von"}, {"id": 246, "start": 1190.36, "end": 1192.36, "text": "Ich sag"}, {"id": 247, "start": 1193.48, "end": 1195.48, "text": "Fuck"}, {"id": 248, "start": 1196.04, "end": 1198.04, "text": "Ach da 3,5"}, {"id": 249, "start": 1198.04, "end": 1204.56, "text": "Das ist die wichtigste Info hätte man nicht weiter rechts in der Ecke platzieren könne so und turbo"}, {"id": 250, "start": 1205.32, "end": 1209.16, "text": "Max boost 4,7 die das ding aber wahrscheinlich kaum erreicht"}, {"id": 251, "start": 1212.76, "end": 1219.92, "text": "Hat der bauer nicht mal ein testvideo gemacht dass die dass der turbo quasi irgendwie bei maximal 4,3 oder so ist"}, {"id": 252, "start": 1219.92, "end": 1227.32, "text": "So 4,3 4,2 4,3 4,4 oder so derauer genau ich fange ich ja auch schon an das richtig auszusprechen"}, {"id": 253, "start": 1230.88, "end": 1234.32, "text": "Es ist ja derauer stimmt ja und das"}, {"id": 254, "start": 1238.04, "end": 1240.04, "text": "Ja da bin ich mal gespannt"}, {"id": 255, "start": 1240.68, "end": 1244.16, "text": "So und mal gucken was Intel demnächst zu bieten hat man Intel ist ja aktuell"}, {"id": 256, "start": 1244.16, "end": 1250.16, "text": "Seit Jahren mal wieder in der Situation dass dies auch ein bisschen über den preis machen müssen"}, {"id": 257, "start": 1250.56, "end": 1253.72, "text": "das ist ja das musste Intel nie Intel konnte uns die"}, {"id": 258, "start": 1255.0, "end": 1259.52, "text": "Letzten zehn Jahre eigentlich den allerletzten"}, {"id": 259, "start": 1260.76, "end": 1265.12, "text": "Mini Upgrade kram verkaufen der knerbe ist gut richtig ab"}, {"id": 260, "start": 1265.8, "end": 1271.12, "text": "Den allerletzten Mini Upgrade Mist verkaufen von Jahr zu Jahr für übels viel Kohle"}, {"id": 261, "start": 1271.12, "end": 1274.68, "text": "Ohne dass ich was getan hat ich meine wir haben es letztendlich amd zu verdanken"}, {"id": 262, "start": 1275.4, "end": 1276.8, "text": "der chat"}, {"id": 263, "start": 1276.8, "end": 1278.72, "text": "drehe ja durch"}, {"id": 264, "start": 1278.72, "end": 1280.72, "text": "Wir haben es letztendlich amd zu versorgen"}, {"id": 265, "start": 1282.04, "end": 1285.08, "text": "Wir haben es letztlich amd zu verdanken dass"}, {"id": 266, "start": 1286.08, "end": 1292.44, "text": "Es halbwegs zu einem halbwegs normalen preisen desktop cpus mit 16 kerne gibt das jetzt bei Intel so nicht gegeben"}, {"id": 267, "start": 1293.0, "end": 1298.6, "text": "Bei Intel werden wir jetzt vielleicht die waren ja die waren ja bei bei sechs kerne waren ja schon dann"}, {"id": 268, "start": 1298.6, "end": 1305.4, "text": "angekommen vielleicht hätten wir übelst high end desktop segment mittlerweile acht kerne vielleicht wenn wir glück hätten zehn"}, {"id": 269, "start": 1305.92, "end": 1313.84, "text": "Aber dass wir da jetzt irgendwie bei zwölf plus in in wirklich auch sehr erschwinglichen dimensionen schweben das haben wir"}, {"id": 270, "start": 1317.68, "end": 1320.6, "text": "Ne quadri waren sechs core mein meiner ist schon sechs core"}, {"id": 271, "start": 1321.68, "end": 1326.08, "text": "8700 k das war high end also wirklich oberstes oberstes ding als das rausgekommen ist"}, {"id": 272, "start": 1326.08, "end": 1332.88, "text": "Also oder natürlich konnte man sich auch irgendwelche workstation xeons bauen oder so aber so normal desktop cpus war es obere geschichte"}, {"id": 273, "start": 1333.4, "end": 1339.84, "text": "Ist Intel überhaupt schon zehn nanometer ich verfolge diese die cpu geschichte nicht so richtig"}, {"id": 274, "start": 1340.88, "end": 1343.36, "text": "angeblich also die aktuelle cpus wohl noch nicht"}, {"id": 275, "start": 1344.68, "end": 1348.88, "text": "Aber ich glaube die die jetzt kommen soll sind wohl angeblich auch zehn nanometer"}, {"id": 276, "start": 1349.96, "end": 1353.36, "text": "Das habe ich das habe ich auf irgendwelche news seiten in den letzten wochen aufgeschnappt keine ahnung"}, {"id": 277, "start": 1353.36, "end": 1356.8, "text": "Ob das stimmt oder ob ich falls verstanden habe keine ahnung"}, {"id": 278, "start": 1362.0, "end": 1367.88, "text": "Die erste whitebird die erste ryzen generation die war die war noch nicht so mega erfolgreich"}, {"id": 279, "start": 1368.48, "end": 1374.04, "text": "Da hat zwar amd richtig was verkauft und die haben auch gezeigt alter intel jetzt ist langsam mal gut"}, {"id": 280, "start": 1374.2, "end": 1380.6, "text": "Aber die erste ryzen generation das ging so ein bisschen parallel zu intel vor allem gamer haben sich haben sich zum größten teil noch intel gekauft"}, {"id": 281, "start": 1380.6, "end": 1387.52, "text": "Und das ist jetzt teilweise immer noch so aber bei weitem nicht mehr so wie es bei der ersten generation war so und jetzt leute"}, {"id": 282, "start": 1388.2, "end": 1391.6, "text": "Wenn die das jetzt hinkriegen die müssen ja gar nicht so viel hinkriegen"}, {"id": 283, "start": 1392.44, "end": 1398.32, "text": "Ich habe mir das im vorfeld ein bisschen anguckt wenn die einfach nur 15 prozent leistungssteigerung haben"}, {"id": 284, "start": 1399.48, "end": 1407.24, "text": "Jetzt vielleicht jetzt nicht noch mehr kerne oder sowas das brauche also ich brauche es zumindest wenn die 15 prozent leistungssteigerung haben"}, {"id": 285, "start": 1407.24, "end": 1414.56, "text": "Dann sieht intel wirklich ganz schlecht aus und das ist denke ich mal durchaus durchaus im rahmen"}, {"id": 286, "start": 1416.68, "end": 1420.72, "text": "Weil der vorsprung von intel ist auch im gaming bereich schon nicht"}, {"id": 287, "start": 1421.8, "end": 1423.8, "text": "nicht substanziell mehr also"}, {"id": 288, "start": 1424.36, "end": 1427.28, "text": "Ja du hast schon wenn du den direkten vergleich machst"}, {"id": 289, "start": 1427.8, "end": 1432.24, "text": "Und auch spiele benchmarks mast dann dann ist die sagen sind die schon noch einen ticken schneller"}, {"id": 290, "start": 1432.24, "end": 1436.76, "text": "Aber nicht in so einem bereich dass du sagen würdest da kommt einem die innert hin"}, {"id": 291, "start": 1438.76, "end": 1441.24, "text": "Deswegen so leute geht los"}, {"id": 292, "start": 1442.52, "end": 1447.12, "text": "Bin ich aber gespannt was da jetzt rauskommt ich mache gleich fullscreen ich mache schon mal den chat aus"}, {"id": 293, "start": 1448.76, "end": 1450.76, "text": "Chat aus"}, {"id": 294, "start": 1450.76, "end": 1452.76, "text": "exquisite"}, {"id": 295, "start": 1453.16, "end": 1459.56, "text": "So und wenn deine geile cpu dabei ich hoffe ja die stellen auch schon zumindest so ein bisschen specks vor in die richtung was ich"}, {"id": 296, "start": 1459.56, "end": 1464.24, "text": "Mir dann kaufen will an cpu weil das letzte mal haben die den 3950 xx auch spät"}, {"id": 297, "start": 1465.12, "end": 1467.12, "text": "geht das schon los oder spackt"}, {"id": 298, "start": 1469.52, "end": 1471.52, "text": "Geht noch nicht los"}, {"id": 299, "start": 1476.56, "end": 1478.56, "text": "Ja"}, {"id": 300, "start": 1479.08, "end": 1481.08, "text": "Pog post jam"}, {"id": 301, "start": 1483.96, "end": 1487.08, "text": "Guck mal seht ihr unten links der post jam minimiert nicht richtig"}, {"id": 302, "start": 1487.08, "end": 1489.08, "text": "Der post schämt sich so in die taskleiste"}, {"id": 303, "start": 1491.4, "end": 1493.4, "text": "Okay 18 uhr"}, {"id": 304, "start": 1497.4, "end": 1499.4, "text": "Auf"}, {"id": 305, "start": 1501.12, "end": 1503.12, "text": "Let's go"}, {"id": 306, "start": 1506.8, "end": 1513.16, "text": "Wir refreshen jetzt einfach wir machen das so wie beim bei bei dem mmo oder bei diablo release wir refreshen einfach"}, {"id": 307, "start": 1513.48, "end": 1515.48, "text": "Weil wir wissen ja alle dass es dazu bei"}, {"id": 308, "start": 1515.48, "end": 1517.48, "text": "Das ist hat geholfen"}, {"id": 309, "start": 1517.48, "end": 1522.2, "text": "Das ist es wir sind die ersten die allerersten world"}, {"id": 310, "start": 1523.08, "end": 1525.08, "text": "reveal"}, {"id": 311, "start": 1526.4, "end": 1528.88, "text": "Wir sind vier sekunden vor den anderen ich sag es euch"}, {"id": 312, "start": 1529.36, "end": 1533.64, "text": "Wir probieren mal der bei der gelegenheit gerade noch mal schnell aus das ding mit dem vlc zu starten"}, {"id": 313, "start": 1534.44, "end": 1536.44, "text": "Weil manchmal ist mit dem vlc noch einen ticken schneller"}, {"id": 314, "start": 1541.88, "end": 1543.88, "text": "Was das für eine krasse"}, {"id": 315, "start": 1543.88, "end": 1549.28, "text": "Nein vlc ist halbe minuten zwanzig sekunden hintendran nope"}, {"id": 316, "start": 1555.96, "end": 1559.56, "text": "Okay, es ist wirklich kein live stream ist es was aufgezeichnet ist"}, {"id": 317, "start": 1562.88, "end": 1565.6, "text": "Ich mache gleich lauter und fullscreen sobald es losgeht"}, {"id": 318, "start": 1565.6, "end": 1568.64, "text": "Ich mache gleich lauter und fullscreen sobald es losgeht"}, {"id": 319, "start": 1572.72, "end": 1576.76, "text": "Wie ich habe noch eine idee was kann kann ff play das mittlerweile"}, {"id": 320, "start": 1579.68, "end": 1581.68, "text": "Nein"}, {"id": 321, "start": 1583.12, "end": 1588.08, "text": "Weil ff play kann man die buffers als einstellen das ist teilweise dann nahezu ohne ohne latency"}, {"id": 322, "start": 1588.4, "end": 1592.16, "text": "Deswegen habe ich auch meine webcam übersicht mit ffmpeg im back end gemacht"}, {"id": 323, "start": 1592.16, "end": 1598.4, "text": "Mpv habe ich nicht installiert also nicht unter windows und in der vm hat es dann eh 1-2 sekunden lag bei sowas"}, {"id": 324, "start": 1601.36, "end": 1603.36, "text": "Man kann die geschwindigkeit auf 2 setzen"}, {"id": 325, "start": 1608.88, "end": 1610.88, "text": "Wait a minute"}, {"id": 326, "start": 1615.44, "end": 1617.44, "text": "WTF"}, {"id": 327, "start": 1617.44, "end": 1621.44, "text": "WTF"}, {"id": 328, "start": 1632.08, "end": 1634.08, "text": "Auf geht's"}, {"id": 329, "start": 1640.96, "end": 1642.96, "text": "Sie haben da quasi geschrieben man soll sie nicht so sehr"}, {"id": 330, "start": 1642.96, "end": 1644.96, "text": "Ja"}, {"id": 331, "start": 1646.08, "end": 1648.08, "text": "Was ist das für ein quali"}, {"id": 332, "start": 1648.08, "end": 1667.2, "text": "So geht's"}, {"id": 333, "start": 1667.2, "end": 1674.16, "text": "Ich bin sehr glücklich, euch den Namen unserer neuen CQ für das erste Mal zu zeigen."}, {"id": 334, "start": 1674.16, "end": 1676.16, "text": "Gebt uns den Biffle!"}, {"id": 335, "start": 1677.12, "end": 1681.12, "text": "Jetzt ist es Zeit, Ryzen in Aktion zu sehen."}, {"id": 336, "start": 1681.12, "end": 1685.12, "text": "Wir wollten das Historie-Event verbreiten."}, {"id": 337, "start": 1685.12, "end": 1689.12, "text": "Wir wollten das Twitch-AMD-Event verbreiten."}, {"id": 338, "start": 1689.12, "end": 1693.12, "text": "Wo gibt es das auf Twitch, Leute?"}, {"id": 339, "start": 1693.12, "end": 1700.08, "text": "In High-Performance-PCs ging es darum, mehr Performance zu verbreiten an jedem Preispunkt."}, {"id": 340, "start": 1700.08, "end": 1705.08, "text": "Wir sind so stolz darauf, zurückzulauen und zu sagen, dass das ein Teil davon war."}, {"id": 341, "start": 1705.08, "end": 1709.08, "text": "Unsere Mission mit CQ hat immer noch klar gemacht."}, {"id": 342, "start": 1709.08, "end": 1713.08, "text": "Es geht darum, die richtige Beteiligung zu machen."}, {"id": 343, "start": 1713.08, "end": 1718.08, "text": "Wir haben die gleiche PC und brauchen die Skalabilität und die Performance, um das zu machen."}, {"id": 344, "start": 1718.08, "end": 1722.08, "text": "Und das ist das, was die Threadripper-Chip wirklich aufregend ist."}, {"id": 345, "start": 1722.08, "end": 1727.08, "text": "Es ist unser Verschleiß an unsere Kunden, dass wir den Roadmap verbreiten."}, {"id": 346, "start": 1727.08, "end": 1730.08, "text": "Und momentan sind wir auf unserer Seite."}, {"id": 347, "start": 1730.08, "end": 1734.08, "text": "Die Anticipation um den 3. Gen Ryzen ist wirklich beeindruckend."}, {"id": 348, "start": 1734.08, "end": 1738.08, "text": "Gebt uns den ersten 16-Core-Gaming-Prozessor."}, {"id": 349, "start": 1738.08, "end": 1741.08, "text": "Jetzt, im Jahr 2019, der 3. Gen Ryzen Z."}, {"id": 350, "start": 1741.08, "end": 1745.08, "text": "Was wir in Xen gemacht haben, war, viel mehr zu machen, als wir dachten."}, {"id": 351, "start": 1745.08, "end": 1751.08, "text": "Es macht mich so stolz darauf, zurückzulauen und zu sagen, dass ich ein Teil davon war."}, {"id": 352, "start": 1751.08, "end": 1755.08, "text": "Unsere Mission mit Ryzen hat immer noch klar gemacht."}, {"id": 353, "start": 1755.08, "end": 1757.08, "text": "Es geht darum, die richtige Beteiligung zu machen."}, {"id": 354, "start": 1757.08, "end": 1759.08, "text": "3-5 Jahre voran."}, {"id": 355, "start": 1759.08, "end": 1761.08, "text": "Und dafür zu sorgen, dass sie..."}, {"id": 356, "start": 1761.08, "end": 1762.08, "text": "Das CPU ist so fett!"}, {"id": 357, "start": 1762.08, "end": 1764.08, "text": "Unser Ziel ist es, euch das Beste zu geben."}, {"id": 358, "start": 1773.08, "end": 1774.08, "text": "Willkommen alle!"}, {"id": 359, "start": 1774.08, "end": 1776.08, "text": "Ein großer Willkommen an alle von euch."}, {"id": 360, "start": 1776.08, "end": 1778.08, "text": "Und danke, dass ihr heute dabei seid."}, {"id": 361, "start": 1778.08, "end": 1780.08, "text": "Ich freue mich auf diesen Moment jedes Jahr."}, {"id": 362, "start": 1780.08, "end": 1782.08, "text": "Und ich kenne viele von euch auch."}, {"id": 363, "start": 1782.08, "end": 1784.08, "text": "Es war ein schwieriger Jahr für alle."}, {"id": 364, "start": 1784.08, "end": 1786.08, "text": "Als wir die Covid-19-Pandemie durchgeführt haben..."}, {"id": 365, "start": 1788.08, "end": 1794.08, "text": "Aber eine Sache, die wir gelernt haben, ist, wie wichtig die hohen Leistungskomputing-Technologien wirklich sind."}, {"id": 366, "start": 1794.08, "end": 1798.08, "text": "Von Arbeit, zu Schule, zu Gaming, zu Unterhaltung..."}, {"id": 367, "start": 1798.08, "end": 1803.08, "text": "Die PC ist jetzt die Komputing-Plattform der Wahl im Jahr 2020."}, {"id": 368, "start": 1803.08, "end": 1808.08, "text": "Und ich freue mich, euch heute zu zeigen, was wir für die nächsten gen PC-Plattformen arbeiten."}, {"id": 369, "start": 1808.08, "end": 1810.08, "text": "Und insbesondere für alle."}, {"id": 370, "start": 1810.08, "end": 1813.08, "text": "Jetzt, es ist bereits ein unglaublicher Jahr für die Spieler."}, {"id": 371, "start": 1813.08, "end": 1817.08, "text": "Es gibt so viel Freude um die nächsten gen PC-Plattformen."}, {"id": 372, "start": 1817.08, "end": 1820.08, "text": "Wir sind so stolz auf die neue Sony PlayStation 5."}, {"id": 373, "start": 1820.08, "end": 1822.08, "text": "Mit einer hohen Leistungskomputing-Tasche..."}, {"id": 374, "start": 1822.08, "end": 1828.08, "text": "Die AMD Ryzen-CPU und die AMD Radeon-GPU-Technologie."}, {"id": 375, "start": 1828.08, "end": 1836.08, "text": "Und wir sind auch stolz auf die neue Microsoft Xbox Series X und Series S-Konsole."}, {"id": 376, "start": 1836.08, "end": 1841.08, "text": "Da hat sie aber geübt, dass sie das Microsoft-Zeug richtig ausgesprochen hat."}, {"id": 377, "start": 1841.08, "end": 1845.08, "text": "Diese Konsolen bringen nur unglaubliche Technologien für die Spieler überall im Welt."}, {"id": 378, "start": 1845.08, "end": 1852.08, "text": "Und sind wirklich ein Ergebnis von tiefen, englischen Partnerschaften über viele, viele Jahre mit Sony und Microsoft."}, {"id": 379, "start": 1852.08, "end": 1856.08, "text": "Gaming ist im Herzen so vieles, was wir bei AMD tun."}, {"id": 380, "start": 1856.08, "end": 1862.08, "text": "Ob du über PCs oder Konsolen oder Cloud-Gaming und Mobile sprichst."}, {"id": 381, "start": 1862.08, "end": 1867.08, "text": "AMD liebt Gaming und wir sagen immer, dass Gaming mit AMD beginnt."}, {"id": 382, "start": 1867.08, "end": 1872.08, "text": "Heute werden wir insbesondere über die nächste gen PC-Gaming-Plattform reden."}, {"id": 383, "start": 1872.08, "end": 1875.08, "text": "Also reden wir ein bisschen über Ryzen."}, {"id": 384, "start": 1875.08, "end": 1880.08, "text": "Ihr wisst, dass wir die erste Generation von Ryzen 2017 in den Markt gebracht haben."}, {"id": 385, "start": 1880.08, "end": 1882.08, "text": "Und wir hatten eigentlich ein Ziel."}, {"id": 386, "start": 1882.08, "end": 1887.08, "text": "Es war, den besten PC-Desktop-Prozessor zu bauen."}, {"id": 387, "start": 1887.08, "end": 1890.08, "text": "Wir wussten, dass wir nicht in einem Schritt kommen würden."}, {"id": 388, "start": 1890.08, "end": 1893.08, "text": "Aber mit jeder Generation von Ryzen ist es besser geworden."}, {"id": 389, "start": 1893.08, "end": 1897.08, "text": "Und wir fokussierten an, wie wir mehr Leistung erwerben."}, {"id": 390, "start": 1897.08, "end": 1899.08, "text": "Wie wir die besten Features erwerben."}, {"id": 391, "start": 1899.08, "end": 1903.08, "text": "Und wie wir allen PC-Enthusiasten mehr Fähigkeiten geben."}, {"id": 392, "start": 1903.08, "end": 1906.08, "text": "So dass ihr mehr machen könnt, als ihr gedacht habt."}, {"id": 393, "start": 1906.08, "end": 1908.08, "text": "Mit eurem Desktop oder in eurem Notebook."}, {"id": 394, "start": 1908.08, "end": 1911.08, "text": "Und wir haben einen großen, großen Prozess gemacht."}, {"id": 395, "start": 1911.08, "end": 1913.08, "text": "Wir haben mit Ryzen und desktops angefangen."}, {"id": 396, "start": 1913.08, "end": 1917.08, "text": "Und dann haben wir Ryzen Threadripper in High-End-Desktops eingeführt."}, {"id": 397, "start": 1917.08, "end": 1920.08, "text": "Jetzt ist Ryzen in vielen tolle Notebook-Systemen."}, {"id": 398, "start": 1920.08, "end": 1922.08, "text": "Mit unserer Ryzen 4000-Serie."}, {"id": 399, "start": 1922.08, "end": 1926.08, "text": "Ich denke, es ist sicher zu sagen, dass AMD den PC liebt."}, {"id": 400, "start": 1926.08, "end": 1929.08, "text": "Und ich denke auch, es ist sicher zu sagen, dass PC-User Ryzen lieben."}, {"id": 401, "start": 1929.08, "end": 1931.08, "text": "Also, wir freuen uns auf das."}, {"id": 402, "start": 1931.08, "end": 1935.08, "text": "Jetzt schauen wir uns an den Desktop ein paar Minuten."}, {"id": 403, "start": 1935.08, "end": 1940.08, "text": "Der Prozess, den wir in den letzten Jahren gemacht haben, ist wirklich tolle."}, {"id": 404, "start": 1940.08, "end": 1943.08, "text": "Wenn man sich den Markt vor Ryzen anschaut,"}, {"id": 405, "start": 1943.08, "end": 1947.08, "text": "dann sieht man, dass das Desktop-PC eine inkrementale Leistung hat."}, {"id": 406, "start": 1947.08, "end": 1950.08, "text": "Das stimmt, da hat sie recht."}, {"id": 407, "start": 1950.08, "end": 1954.08, "text": "In den letzten drei Jahren haben wir die Tragödie deutlich verändert."}, {"id": 408, "start": 1954.08, "end": 1958.08, "text": "Das liegt aber auch daran, dass ihr 15 Jahre Intel habt machen lassen, was sie wollen."}, {"id": 409, "start": 1958.08, "end": 1962.08, "text": "Wir haben von 1. Gen Ryzen bis 2. Gen Ryzen, jetzt bis 3. Gen Ryzen."}, {"id": 410, "start": 1962.08, "end": 1966.08, "text": "Wir waren die ersten, die einen 7-nanometer-Desktop-Prozessor starten wollten."}, {"id": 411, "start": 1966.08, "end": 1970.08, "text": "Und heute führt 3. Gen Ryzen in so vielen Bereichen."}, {"id": 412, "start": 1970.08, "end": 1973.08, "text": "Wir sind die höchsten in der Multithreading-Performance."}, {"id": 413, "start": 1973.08, "end": 1976.08, "text": "Wir sind die Besten in Bezug auf die volle Leistung."}, {"id": 414, "start": 1976.08, "end": 1980.08, "text": "Und 3. Gen Ryzen ist ein absoluter großartiger Gaming-Prozessor."}, {"id": 415, "start": 1980.08, "end": 1983.08, "text": "Aber wie ihr wisst, sind wir wirklich ambitios."}, {"id": 416, "start": 1983.08, "end": 1986.08, "text": "Also, unsere Arbeit mit Ryzen ist nie fertig."}, {"id": 417, "start": 1986.08, "end": 1989.08, "text": "Unsere Ingenieure sind auf diesem maniösen Fokus,"}, {"id": 418, "start": 1989.08, "end": 1991.08, "text": "auf was wir mehr tun können."}, {"id": 419, "start": 1991.08, "end": 1993.08, "text": "Was wir besser tun können."}, {"id": 420, "start": 1993.08, "end": 1996.08, "text": "Also heute sind wir hier, um zu sprechen,"}, {"id": 421, "start": 1996.08, "end": 2001.08, "text": "auf Zen 3."}, {"id": 422, "start": 2001.08, "end": 2006.08, "text": "Und mit Zen 3 haben wir uns wieder um das Beste auf den PC-Markt konzentriert."}, {"id": 423, "start": 2006.08, "end": 2009.08, "text": "Ich bin so stolz auf das, was wir erreicht haben."}, {"id": 424, "start": 2009.08, "end": 2013.08, "text": "Zen 3 erhöht unsere Leistung in der overallen Performance."}, {"id": 425, "start": 2013.08, "end": 2016.08, "text": "Es erhöht unsere Leistung in der Power-Effizienz."}, {"id": 426, "start": 2016.08, "end": 2022.08, "text": "Und jetzt gibt es die beste Single-Threaded-Performance und Gaming-Performance."}, {"id": 427, "start": 2022.08, "end": 2025.08, "text": "Wir haben große Veränderungen in der Core-Architektur."}, {"id": 428, "start": 2025.08, "end": 2028.08, "text": "Und ich bin mir sicher, dass alle wissen wollen, was in Zen 3 ist."}, {"id": 429, "start": 2028.08, "end": 2032.08, "text": "Also lasst mich das Mikroskop herausholen."}, {"id": 430, "start": 2032.08, "end": 2034.08, "text": "Mark?"}, {"id": 431, "start": 2034.08, "end": 2036.08, "text": "Mark?"}, {"id": 432, "start": 2036.08, "end": 2039.08, "text": "Also wenn das stimmt mit Single-Threaded Performance,"}, {"id": 433, "start": 2039.08, "end": 2041.08, "text": "dann bin ich echt skeptisch."}, {"id": 434, "start": 2041.08, "end": 2045.08, "text": "Ich kann mir ein bisschen mehr über Zen 3 und unsere Progression erzählen."}, {"id": 435, "start": 2045.08, "end": 2047.08, "text": "Es war eine Reise."}, {"id": 436, "start": 2047.08, "end": 2050.08, "text": "Wir haben vor fünf Jahren einen Kurs geplant,"}, {"id": 437, "start": 2050.08, "end": 2054.08, "text": "um eine Familie von hochwertigen X86-CPUs zu erzeugen."}, {"id": 438, "start": 2054.08, "end": 2057.08, "text": "Unser Ziel ist sehr einfach."}, {"id": 439, "start": 2057.08, "end": 2059.08, "text": "Wir haben das Team erzeugt,"}, {"id": 440, "start": 2059.08, "end": 2063.08, "text": "damit die Entwicklung von mehreren Prozessor-Generationen"}, {"id": 441, "start": 2063.08, "end": 2068.08, "text": "in parallel mit dem Design von einer Generation zum anderen gemacht werden kann."}, {"id": 442, "start": 2068.08, "end": 2070.08, "text": "Das hat mit so laut ein, oder?"}, {"id": 443, "start": 2070.08, "end": 2072.08, "text": "Ich bin das nicht."}, {"id": 444, "start": 2072.08, "end": 2075.08, "text": "Ich könnte nicht mehr stolz sein, als zu helfen,"}, {"id": 445, "start": 2075.08, "end": 2078.08, "text": "unsere dritte Generation von Zen Core zu erzeugen,"}, {"id": 446, "start": 2078.08, "end": 2081.08, "text": "die im Fall des Ryzen Desktops debutiert wird."}, {"id": 447, "start": 2081.08, "end": 2083.08, "text": "Es ist ein Beste in der Performance."}, {"id": 448, "start": 2083.08, "end": 2087.08, "text": "Und es wird in dem X86-Markt absoluten Leadership erzeugen."}, {"id": 449, "start": 2087.08, "end": 2090.08, "text": "Zen hat uns zurückgebracht und eine hohe Performance"}, {"id": 450, "start": 2090.08, "end": 2092.08, "text": "mit einem 52% Prozessor-Generation."}, {"id": 451, "start": 2092.08, "end": 2093.08, "text": "Okay, was?"}, {"id": 452, "start": 2093.08, "end": 2095.08, "text": "Heuer Boost?"}, {"id": 453, "start": 2095.08, "end": 2098.08, "text": "Okay, mehr Boost ist schon mal gut."}, {"id": 454, "start": 2098.08, "end": 2102.08, "text": "Zu dem Rest kann man jetzt noch nicht allzu viel sagen."}, {"id": 455, "start": 2102.08, "end": 2106.08, "text": "Letztes Jahr hat Zen 2 einen Doppel-Digit-Prozess-Einkauf"}, {"id": 456, "start": 2106.08, "end": 2110.08, "text": "in der Prozessor-Generation und debutierte 7nm in Chiplet-Technologie."}, {"id": 457, "start": 2110.08, "end": 2113.08, "text": "Ob das wirklich viertes Quartal chippt?"}, {"id": 458, "start": 2113.08, "end": 2142.08, "text": "Mal gucken, vielleicht 5 Stück."}, {"id": 459, "start": 2142.08, "end": 2145.08, "text": "Also das wäre wirklich nicht schlecht,"}, {"id": 460, "start": 2145.08, "end": 2148.08, "text": "weil aktuell haben wir ja Zahlen draufstehen,"}, {"id": 461, "start": 2148.08, "end": 2172.08, "text": "die ber RPMren置 und Alexia Chloe scolden."}, {"id": 462, "start": 2172.08, "end": 2174.08, "text": "Okay."}, {"id": 463, "start": 2175.08, "end": 2177.08, "text": "Dazu kenn ich mich zu wenig aus."}, {"id": 464, "start": 2177.08, "end": 2198.08, "text": "was zu sagen, der 19 Instructions, oder welche Instructions, oder ich glaube ich bin dazu"}, {"id": 465, "start": 2198.08, "end": 2225.08, "text": "Low Brain für. Weider, weider ist gut. Ich weiß zwar nicht, was ist weider als, egal."}, {"id": 466, "start": 2225.08, "end": 2254.08, "text": "Was steht da gerade? Zero Bubble? Was, was, was steht hier unten?"}, {"id": 467, "start": 2254.08, "end": 2274.08, "text": "Branch Prediction, gut, das nächste. Was, 4G? Oh, das geht so schnell?"}, {"id": 468, "start": 2274.08, "end": 2301.08, "text": "Excellent Core and Cache Communication for Gaming. Du weißt doch immer, dass das jetzt genau heißt."}, {"id": 469, "start": 2301.08, "end": 2309.08, "text": "Okay, die haben jetzt, die haben jetzt anstatt 2x 16 MB Cache, haben die den fetten 32 MB Cache, wo alle Kerne drauf zugreifen können."}, {"id": 470, "start": 2309.08, "end": 2326.08, "text": "Das habe ich jetzt kapiert. Was, heißt, heißt das? Moment, wenn der Cache für alle CPU Cores gilt, heißt es doch auch, wenn ich"}, {"id": 471, "start": 2326.08, "end": 2347.08, "text": "irgendwelche Threads wechsle, dann muss ich kein Zeugs mehr umschreiben, oder?"}, {"id": 472, "start": 2347.08, "end": 2370.08, "text": "Ach so, nur L3, stimmt, ja. Das ist gut. Also Energieeffizienz ist wirklich ein Ding."}, {"id": 473, "start": 2370.08, "end": 2383.08, "text": "Gerade, gerade im Low, im unteren Segment, da war Intel wirklich schon eine ganze Ecke besser."}, {"id": 474, "start": 2383.08, "end": 2409.08, "text": "Mal gucken, wie das jetzt wird. Intel, Alter. Intel beißt sich jetzt den Arsch gerade."}, {"id": 475, "start": 2409.08, "end": 2420.08, "text": "Thank you, and let me welcome back Lisa to now show off our Zen 3 and new Ryzen processors."}, {"id": 476, "start": 2420.08, "end": 2425.08, "text": "Thank you, Mark. That was great. I'm so proud of what the team has accomplished with Zen 3."}, {"id": 477, "start": 2425.08, "end": 2433.08, "text": "We really focused on what is most important for gamers and enthusiasts, and at 19% IPC increase, it's our largest increase,"}, {"id": 478, "start": 2433.08, "end": 2439.08, "text": "generation over generation since we launched the Zen family. So now let's see Zen 3 in action."}, {"id": 479, "start": 2439.08, "end": 2446.08, "text": "I'm so proud to show you for the very first time the AMD Ryzen 5000 series for high performance PCs."}, {"id": 480, "start": 2446.08, "end": 2463.08, "text": "The world's first Zen 3 powered CPU. This is the AMD Ryzen 9 5900X. 12 cores, 24 threads and a boost up to 4.800. It's a very special product, the ultimate enthusiast processor."}, {"id": 481, "start": 2463.08, "end": 2474.08, "text": "Compared to the 3900XT, the 5900X has 19% higher IPC, higher clock speeds and all of the Zen 3 core improvements that Mark talked about."}, {"id": 482, "start": 2474.08, "end": 2477.08, "text": "12 Kerne, 12 Kerne, 4,8 boost."}, {"id": 483, "start": 2477.08, "end": 2484.08, "text": "This makes Ryzen 5900X a big upgrade from 3rd gen Ryzen all around, but especially in gaming."}, {"id": 484, "start": 2484.08, "end": 2488.08, "text": "The question is whether it can handle 4,8."}, {"id": 485, "start": 2488.08, "end": 2502.08, "text": "Thanks Lisa. Hey everyone, let me give you a sense of just how much faster the 5900X is compared to our current best, the 3900XT."}, {"id": 486, "start": 2502.08, "end": 2510.08, "text": "To do that we're going to use Shadow of the Tomb Raider, a game I personally love and a game reviewers often look at to judge CPU performance."}, {"id": 487, "start": 2510.08, "end": 2518.08, "text": "We're going to run the built-in benchmark here at 1080p using the high image quality preset on two otherwise identical systems."}, {"id": 488, "start": 2518.08, "end": 2528.08, "text": "You can see a whopping 28% increase just by moving from the 39XT to the 5900X in Shadow of the Tomb Raider."}, {"id": 489, "start": 2528.08, "end": 2534.08, "text": "And as you will soon see, the performance from the 5900X is faster than the competing processors as well."}, {"id": 490, "start": 2534.08, "end": 2540.08, "text": "Now as any enthusiast knows, 28% from a processor change is a massive upgrade."}, {"id": 491, "start": 2540.08, "end": 2544.08, "text": "But that's what AMD customers like me can look forward to."}, {"id": 492, "start": 2544.08, "end": 2554.08, "text": "This truly demonstrates the gaming strength of Zen 3 when you combine the historic IPC uplift, unified cores and unified cache pools."}, {"id": 493, "start": 2554.08, "end": 2566.08, "text": "Now as we zoom out to look at a wider set of games, you can see that the 28% uplift in Shadow of the Tomb Raider is joined by many titles with significant double-digit performance improvements."}, {"id": 494, "start": 2566.08, "end": 2572.08, "text": "The gains are even bigger in titles like CSGO and League of Legends."}, {"id": 495, "start": 2572.08, "end": 2577.08, "text": "The highest possible frame rate is practically the number one priority to be competitive."}, {"id": 496, "start": 2577.08, "end": 2592.08, "text": "Overall, gamers upgrading from the Ryzen 5000 series to the Ryzen 5000 series can expect an average performance improvement of 26%."}, {"id": 497, "start": 2592.08, "end": 2603.08, "text": "Again, this is just a monumental performance jump for an in-socket upgrade in the same motherboard and a true testament for how good Zen 3 is in gaming."}, {"id": 498, "start": 2603.08, "end": 2609.08, "text": "Now as many know, strong gaming performance relies on strong single core performance."}, {"id": 499, "start": 2609.08, "end": 2612.08, "text": "That's exactly what Zen 3 has."}, {"id": 500, "start": 2612.08, "end": 2615.08, "text": "And I want to show you two Cinebench R20 single thread."}, {"id": 501, "start": 2615.08, "end": 2622.08, "text": "There are many ways to assess single thread performance, but Cinebench is a fast and easy tool that you can run at home."}, {"id": 502, "start": 2622.08, "end": 2630.08, "text": "And it's one of the 25 workloads that we used to calculate the 19% improvement for Zen 3's instructions per cycle."}, {"id": 503, "start": 2630.08, "end": 2638.08, "text": "As you can see, the 5900X is the first desktop processor to ever break a 600 score."}, {"id": 504, "start": 2638.08, "end": 2644.08, "text": "We don't break it by a little, we break it by a lot with a score of 631."}, {"id": 505, "start": 2644.08, "end": 2654.08, "text": "BDMD heard you loud and clear as you challenged us to continue investing in single core performance and the results speak for themselves."}, {"id": 506, "start": 2654.08, "end": 2666.08, "text": "The combination of IPC, frequency, cores and cache give AMD the fastest cores in the desktop market and give you the best possible gaming performance."}, {"id": 507, "start": 2666.08, "end": 2670.08, "text": "So let's take that landmark for performance into a head-to-head battle."}, {"id": 508, "start": 2670.08, "end": 2678.08, "text": "Across the same set of games you just saw, the AMD Ryzen 9 5900X is a clear winner at 1080p."}, {"id": 509, "start": 2678.08, "end": 2687.08, "text": "As I promised you, AMD wins in Shadow of the Tomb Raider by plus six and is joined by many other games popular with viewers and users like you."}, {"id": 510, "start": 2687.08, "end": 2694.08, "text": "League of Legends and CSGO are once again standout victories for the Ryzen 9 5900X."}, {"id": 511, "start": 2694.08, "end": 2698.08, "text": "That was a lot of data very quickly. Let's take a step back, let's recap."}, {"id": 512, "start": 2698.08, "end": 2707.08, "text": "You saw an average uplift of 26% for Ryzen customers upgrading from the 3000 series to the 5000 series."}, {"id": 513, "start": 2707.08, "end": 2713.08, "text": "You just watched AMD deliver the highest single core performance in the entire desktop PC market."}, {"id": 514, "start": 2713.08, "end": 2720.08, "text": "And you just saw AMD clearly offer the best performance of any gaming processor on the market."}, {"id": 515, "start": 2720.08, "end": 2724.08, "text": "I will put it plainly, we know that you're going to wait for benchmarks,"}, {"id": 516, "start": 2724.08, "end": 2736.08, "text": "but customers who buy processors purely for their gaming performance will absolutely want a Ryzen 9 5900X for the best possible PC gaming experience."}, {"id": 517, "start": 2736.08, "end": 2741.08, "text": "Let's bring Lisa back up to give you more details on these awesome gaming processors."}, {"id": 518, "start": 2741.08, "end": 2746.08, "text": "Thanks Trevor, that was fantastic."}, {"id": 519, "start": 2746.08, "end": 2754.08, "text": "I hope you're all now convinced that the Ryzen 9 5900X is the best gaming processor in the world."}, {"id": 520, "start": 2754.08, "end": 2757.08, "text": "Now let's look at the stack."}, {"id": 521, "start": 2757.08, "end": 2762.08, "text": "In the 5000 series we have a great choice for every gamer or PC enthusiast."}, {"id": 522, "start": 2762.08, "end": 2774.08, "text": "In addition to the 5900X we have the 5800X, an 8 core 16 thread processor with boost frequencies up to 4.7 GHz at 105 watts."}, {"id": 523, "start": 2774.08, "end": 2783.08, "text": "And we also have the 5600X, a 6 core 12 thread CPU with boost frequencies up to 4.6 GHz at 65 watts."}, {"id": 524, "start": 2783.08, "end": 2786.08, "text": "Now let's talk about price availability."}, {"id": 525, "start": 2786.08, "end": 2796.08, "text": "The 6 core 5600X is $299, the 8 core 5800X is $449, and the amazing 5900X,"}, {"id": 526, "start": 2796.08, "end": 2806.08, "text": "combining the leadership performance and power of the 16 thread CPU in a 12 core 7nm design is priced at $549."}, {"id": 527, "start": 2806.08, "end": 2810.08, "text": "And all of these will be available globally on November 5th."}, {"id": 528, "start": 2810.08, "end": 2814.08, "text": "We're really proud of the 5000 series, but you know we're not done."}, {"id": 529, "start": 2814.08, "end": 2818.08, "text": "We love our enthusiasts and there's one more processor in our stack,"}, {"id": 530, "start": 2818.08, "end": 2822.08, "text": "which is the ultimate processor for gaming and content creation."}, {"id": 531, "start": 2822.08, "end": 2827.08, "text": "For those of you who want the very best processor in a desktop PC,"}, {"id": 532, "start": 2827.08, "end": 2832.08, "text": "we have the 16 core Ryzen 9 5950X."}, {"id": 533, "start": 2832.08, "end": 2836.08, "text": "The 5950X is simply an amazing CPU."}, {"id": 534, "start": 2836.08, "end": 2845.08, "text": "16 cores, 32 threads, and our fastest processor with boost frequencies up to 4.9 GHz."}, {"id": 535, "start": 2845.08, "end": 2855.08, "text": "The 5950X breaks the Cinebench R20 single threaded record that Robert set just a few minutes ago with a score of 640."}, {"id": 536, "start": 2855.08, "end": 2858.08, "text": "It is truly the best in class in every dimension."}, {"id": 537, "start": 2858.08, "end": 2865.08, "text": "Best gaming performance meets best processor for content creation, and all of this still at 105 watts."}, {"id": 538, "start": 2865.08, "end": 2868.08, "text": "Now let's take a look at some of the performance."}, {"id": 539, "start": 2868.08, "end": 2874.08, "text": "If we look at the generational uplift from the 3950X to the 5950X,"}, {"id": 540, "start": 2874.08, "end": 2881.08, "text": "we see up to 27% more performance in CAD workloads and 12% more performance in rendering workloads."}, {"id": 541, "start": 2881.08, "end": 2886.08, "text": "More aggressively, we see up to 29% more gaming performance."}, {"id": 542, "start": 2886.08, "end": 2889.08, "text": "And this is really how we bring the best of both worlds together."}, {"id": 543, "start": 2889.08, "end": 2896.08, "text": "Sollte das auch nur ansatzweise stimmen, wäre das mega geil, aber wie gesagt, ich bin da ein bisschen skeptisch."}, {"id": 544, "start": 2896.08, "end": 2904.08, "text": "We see that the 5950X provides up to 59% more creative performance in rendering workloads."}, {"id": 545, "start": 2904.08, "end": 2908.08, "text": "Double digit wins in video editing and software compiling."}, {"id": 546, "start": 2908.08, "end": 2912.08, "text": "And we also win in lightly threaded CAD workloads as well."}, {"id": 547, "start": 2912.08, "end": 2916.08, "text": "We're really proud of the fact that we also win in gaming."}, {"id": 548, "start": 2916.08, "end": 2919.08, "text": "There's nothing like the 5950X in the world."}, {"id": 549, "start": 2919.08, "end": 2925.08, "text": "One processor that delivers the best power efficiency, our highest clock speeds,"}, {"id": 550, "start": 2925.08, "end": 2928.08, "text": "the highest single core performance in the industry,"}, {"id": 551, "start": 2928.08, "end": 2933.08, "text": "and the highest multi-core performance of any gaming processor."}, {"id": 552, "start": 2933.08, "end": 2939.08, "text": "And it's priced at 799 dollars and will also be available globally on November 5th."}, {"id": 553, "start": 2939.08, "end": 2943.08, "text": "I hope you're now as excited about AMD Ryzen 5000 series as I am."}, {"id": 554, "start": 2943.08, "end": 2951.08, "text": "Das ist meine CPU, Leute. Habt ihr gesehen? Habt ihr meine zukünftige CPU gesehen?"}, {"id": 555, "start": 2951.08, "end": 2955.08, "text": "And I know that you're not just excited about Ryzen 5000 series,"}, {"id": 556, "start": 2955.08, "end": 2961.08, "text": "but there's a tremendous amount of enthusiasm and curiosity about our Ryzen 5000 series as well."}, {"id": 557, "start": 2961.08, "end": 2964.08, "text": "The next few weeks are just an amazing time for us."}, {"id": 558, "start": 2964.08, "end": 2972.08, "text": "In addition to introducing our Ryzen 5000 series, we're also going to introduce our next-gen Radeon GPU."}, {"id": 559, "start": 2972.08, "end": 2976.08, "text": "And I want to give you a small preview of that today."}, {"id": 560, "start": 2976.08, "end": 2982.08, "text": "This is the AMD Radeon RX 6000 series, which we now affectionately call Big Navi,"}, {"id": 561, "start": 2982.08, "end": 2985.08, "text": "thanks to many of you who nicknamed it for us."}, {"id": 562, "start": 2985.08, "end": 2991.08, "text": "It is absolutely gorgeous, and by far the most powerful gaming GPU we have ever built."}, {"id": 563, "start": 2991.08, "end": 2994.08, "text": "We got a lot of requests from our fans on social,"}, {"id": 564, "start": 2994.08, "end": 3000.08, "text": "and I heard a whole conversation on the Full Nerd last week about wanting to see Zen 3 and Big Navi in action."}, {"id": 565, "start": 3000.08, "end": 3009.08, "text": "So today I'm going to show you a preview of what you can expect from AMD Ryzen 5900X and our Radeon 6000 series."}, {"id": 566, "start": 3009.08, "end": 3015.08, "text": "We've been doing a tremendous amount of work on the Ryzen gameplay with Ryzen 5000 and Radeon 6000 series."}, {"id": 567, "start": 3015.08, "end": 3026.08, "text": "So let me show you today Borderlands 3, which is a very popular AAA title running at 4K resolution on the Ryzen 5900X and our Radeon 6000 series."}, {"id": 568, "start": 3026.08, "end": 3034.08, "text": "Just take a look at that performance. Over 60 frames per second at 4K with beautiful and bold."}, {"id": 569, "start": 3034.08, "end": 3038.08, "text": "We are super excited with what we've accomplished with Big Navi."}, {"id": 570, "start": 3038.08, "end": 3047.08, "text": "In addition to Borderlands 3, here's a bit more of a performance preview on Call of Duty Modern Warfare and Gears of War 5 at ultra settings in 4K."}, {"id": 571, "start": 3047.08, "end": 3051.08, "text": "And again, what you can expect is 4K performance across the board."}, {"id": 572, "start": 3051.08, "end": 3056.08, "text": "We still have a few weeks until launch and the team is really hard on finding games."}, {"id": 573, "start": 3056.08, "end": 3064.08, "text": "But I hope you're as excited as we are about what Ryzen 5000 series and Radeon 6000 series can do together for your next generation PC."}, {"id": 574, "start": 3064.08, "end": 3068.08, "text": "So that brings us to the end. I hope you enjoyed today."}, {"id": 575, "start": 3068.08, "end": 3071.08, "text": "It's been so much fun spending time with you."}, {"id": 576, "start": 3071.08, "end": 3073.08, "text": "We have a lot more to show you later this month."}, {"id": 577, "start": 3073.08, "end": 3080.08, "text": "So join us again on October 28th where we'll give you the full story of our AMD Radeon RX 6000 series"}, {"id": 578, "start": 3080.08, "end": 3086.08, "text": "and make sure you mark your calendar for November 5th to find Ryzen 5000 series on shelf worldwide."}, {"id": 579, "start": 3086.08, "end": 3114.08, "text": "Take care and see you soon."}, {"id": 580, "start": 3116.08, "end": 3119.08, "text": "Zweifel so, zweifel, so, so..."}, {"id": 581, "start": 3120.08, "end": 3122.08, "text": "Ja klar, na klar will ich das."}, {"id": 582, "start": 3122.08, "end": 3126.08, "text": "Ich mein, es muss sich doch irgendwie lohnen, dass ich mir einen neuen Rechner kauf."}, {"id": 583, "start": 3126.08, "end": 3133.08, "text": "Wenn ich upgrade vor einem 8700K mit einer 1080 Ti, dann muss ich upgraden auf das beste, was es gibt."}, {"id": 584, "start": 3133.08, "end": 3138.08, "text": "Und das ist ein 5950X mit einer 3090 RTX, fertig."}, {"id": 585, "start": 3138.08, "end": 3145.44, "text": "Bekommst du mal, bekommst den alten Rechner, nee Sebaro, den alten Rechner, der wird zum"}, {"id": 586, "start": 3145.44, "end": 3150.76, "text": "Streaming Vorschau Rechner und wir probieren auf dem alten Rechner dann mal aus, wie es"}, {"id": 587, "start": 3150.76, "end": 3156.76, "text": "mit Linux Gaming so aussieht, weil das soll ich ja schon mal eine Weile machen, laut Stream,"}, {"id": 588, "start": 3156.76, "end": 3160.04, "text": "hatten wir ja schon öfters mal das Thema, ich bin ja da immer ein bisschen am Flamen,"}, {"id": 589, "start": 3160.04, "end": 3164.64, "text": "dass das geschönt dargestellt wird, wie gut das angeblich funktioniert, das gucken wir"}, {"id": 590, "start": 3164.64, "end": 3165.64, "text": "uns dann mal zusammen an."}, {"id": 591, "start": 3165.64, "end": 3170.56, "text": "Und der aktuelle Streaming Vorschau Rechner, der wird zu nichts, der kommt auf den Dachboden"}, {"id": 592, "start": 3170.56, "end": 3175.56, "text": "oder so."}, {"id": 593, "start": 3175.56, "end": 3193.88, "text": "So, also, was hat der gekostet, 850, 800 klat, 5950, 799, ok 800, alles klar, das geht doch,"}, {"id": 594, "start": 3193.88, "end": 3204.64, "text": "es gibt schlimmeres, was kosten aktuellen 3950x, gut, das geht doch, das ist doch alles"}, {"id": 595, "start": 3204.64, "end": 3221.56, "text": "kein Ding, kann man es schon mal gönnen, alle dreieinhalb Jahre, gut, also ich werde"}, {"id": 596, "start": 3221.56, "end": 3226.76, "text": "aber auf jeden Fall mal auf normale Benchmarks warten, was mich interessieren würde, ob es"}, {"id": 597, "start": 3226.76, "end": 3229.72, "text": "vielleicht schon ein paar Seiten gibt, die geleakte Sachen haben, aber wenn die das heute"}, {"id": 598, "start": 3229.72, "end": 3237.0, "text": "anstellen, dann eher nicht, ja das sagt, also ich bin der Letzte, der was dagegen hat,"}, {"id": 599, "start": 3237.0, "end": 3243.12, "text": "wenn AMD in allen Bereichen die schnellste CPU hat, weil wie gesagt, mein nächster Rechner"}, {"id": 600, "start": 3243.12, "end": 3252.36, "text": "wird AMD und wenn die dann in Spielen, in was weiß ich, Zeug kompilieren, Video rendern"}, {"id": 601, "start": 3252.36, "end": 3260.36, "text": "und irgendwie, die schnellsten in jedem Bereich sind, sollen mir recht sein, aber, also, das"}, {"id": 602, "start": 3260.36, "end": 3266.04, "text": "war, man kann den Sachen immer nur so zur Hälfte trauen, was auf diesen Präsentationen"}, {"id": 603, "start": 3266.04, "end": 3273.04, "text": "gezeigt wird, da werden sich die optimalen Spiele in den optimalen Szenen und mit den"}, {"id": 604, "start": 3273.04, "end": 3278.72, "text": "optimalen Settings ausgesucht, weil ich meine im Ernst, das könnte genauso gut bedeuten,"}, {"id": 605, "start": 3278.72, "end": 3288.88, "text": "wenn die sagen, was weiß ich, 39% Performance Boost in CSGO oder 39% Performance Boost in"}, {"id": 606, "start": 3288.88, "end": 3293.96, "text": "Call of Duty, was auch immer, die können durchaus auf unterschiedlichen Maps das ausprobiert"}, {"id": 607, "start": 3293.96, "end": 3299.92, "text": "haben, was auch immer, also ich traue den bei sowas nicht über den Weg, also weder"}, {"id": 608, "start": 3299.92, "end": 3306.8, "text": "AMD noch Intel, noch Nvidia, noch irgendjemand, dass da wirklich realitätsnahe Sachen gezeigt"}, {"id": 609, "start": 3306.8, "end": 3312.4, "text": "werden, immerhin haben sie gezeigt, dass Battlefield schlechter läuft, mittlerweile, früher hätte"}, {"id": 610, "start": 3312.4, "end": 3318.4, "text": "ich mir gedacht, das spricht dafür, dass das näher an der Realität ist, allerdings"}, {"id": 611, "start": 3318.4, "end": 3324.44, "text": "mittlerweile, ja, Intel, müsste Intel nicht auch demnächst was zeigen oder haben die schon,"}, {"id": 612, "start": 3324.44, "end": 3329.64, "text": "mittlerweile glaube ich, dass man sowas einbaut, dass es glaubhafter wirkt, also die sind"}, {"id": 613, "start": 3329.64, "end": 3339.72, "text": "quasi schon Next Level, die Musik ist bei mir, ja, die sind quasi schon Next Level und"}, {"id": 614, "start": 3339.72, "end": 3344.92, "text": "bauen Sachen ein, die erstmal schlechter aussehen, damit man das für glaubwürdig"}, {"id": 615, "start": 3344.92, "end": 3349.52, "text": "erhält, also ich glaube denen nichts, ich glaube denen nichts, bis man wirklich unabhängige"}, {"id": 616, "start": 3349.52, "end": 3354.76, "text": "Benchmarks gesehen hat, aber wenn das auch nur halbwegs in diese Richtung kommt, ist"}, {"id": 617, "start": 3354.76, "end": 3364.44, "text": "das für AMD ziemlich gut, ich weiß nicht, ob Intel, macht Intel dieses Jahr noch was"}, {"id": 618, "start": 3364.44, "end": 3373.56, "text": "oder haben die schon, oder haben die schon, ich habe keine Ahnung, was ich höre, ich"}, {"id": 619, "start": 3373.56, "end": 3392.4, "text": "habe irgendeinen Mix an, ich weiß gar nicht, was das ist, ich habe einfach irgendwas angemacht,"}, {"id": 620, "start": 3392.4, "end": 3402.96, "text": "sagt mir auch nichts jetzt, Intel bringt erst nächstes Jahr was raus, ok, welches Case"}, {"id": 621, "start": 3402.96, "end": 3423.08, "text": "werde ich mir holen, das da, das da, ja, das da, ja, ja wieviel RAM weiß ich nicht, ich"}, {"id": 622, "start": 3423.08, "end": 3427.56, "text": "würde ja gern 64G RAM haben, weil ich möchte bei sowas immer ein Upgrade zu dem, was ich"}, {"id": 623, "start": 3427.56, "end": 3435.4, "text": "schon hab, so und aktuell sieht es halt so aus, 32G RAM, 8700K, 1080Ti und nachdem ich"}, {"id": 624, "start": 3435.4, "end": 3440.36, "text": "alles gerne immer upgrade, würde das ja eigentlich bedeuten 64G RAM und zumal RAM, genau PC"}, {"id": 625, "start": 3440.36, "end": 3447.52, "text": "lustig, zumal RAM auch sehr billig ist aktuell, doch das Gehäuse ist mega geil, also jetzt"}, {"id": 626, "start": 3447.52, "end": 3451.0, "text": "mal ernsthaft, findet wirklich jemand, dass das Gehäuse nicht gut aussieht, ich finde"}, {"id": 627, "start": 3451.0, "end": 3460.36, "text": "das sieht huge aus, also das gibt es auch mit Fenster, das gibt es auch mit Fenster,"}, {"id": 628, "start": 3460.36, "end": 3467.2, "text": "das gibt es auch mit Fenster, weiß nicht, ob die hier das mit Fenster zeigen, also ich"}, {"id": 629, "start": 3467.2, "end": 3477.32, "text": "hab das mit Fenster, dass man ein bisschen RGB sieht, so dezentes RGB mag ich ja auch,"}, {"id": 630, "start": 3477.32, "end": 3488.08, "text": "also hier, alter, what, wie wärs einfach mit nem Bild, hier, hier kann man reingucken,"}, {"id": 631, "start": 3488.08, "end": 3494.72, "text": "mein Gott, mach ich das kompliziert, ja, aber das werd ich mir holen, weil ich hab"}, {"id": 632, "start": 3494.72, "end": 3498.84, "text": "die letzten, die letzten Rechnergenerationen, die ich hatte, die hatten auch schon alle"}, {"id": 633, "start": 3498.84, "end": 3502.72, "text": "dieses Gehäuse beziehungsweise Vorgänger davon und ich bin damit so zufrieden, dass"}, {"id": 634, "start": 3502.72, "end": 3507.56, "text": "ich mir jetzt schon zum dritten Mark quasi infolge diese, diese, diesen Refresh vom Gehäuse"}, {"id": 635, "start": 3507.56, "end": 3508.56, "text": "hol."}, {"id": 636, "start": 3508.56, "end": 3513.16, "text": "Teilst du deine ganzen Specks dann mit, wenn der PC da ist, ja klar, wir werden den PC"}, {"id": 637, "start": 3513.16, "end": 3517.96, "text": "auch zusammen im Stream, vielleicht nicht bestellen direkt, aber die Teile in, in den"}, {"id": 638, "start": 3517.96, "end": 3522.64, "text": "Warenkorb zusammen legen und dann bestellen, wenn der Stream aus ist, weil ich mein Paypal"}, {"id": 639, "start": 3522.64, "end": 3527.92, "text": "und so nicht on Stream eingeben will, also wie gesagt, ich find das Gehäuse ultra nice"}, {"id": 640, "start": 3527.92, "end": 3537.56, "text": "und das werd ich auch so wieder, wiederholen."}, {"id": 641, "start": 3537.56, "end": 3543.6, "text": "Kennst du das von Be Quiet, nee, wie gesagt, meine letzten Rechnergenerationen hatten nur"}, {"id": 642, "start": 3543.6, "end": 3549.08, "text": "diese Sachen hier, alter, was ist mit der Seite los, die ist übelst lahm as fuck, komm"}, {"id": 643, "start": 3549.08, "end": 3554.32, "text": "mal kurz, guck mal, die Seite hängt auch, bin ich so zufrieden, ich hab mir keine anderen"}, {"id": 644, "start": 3554.32, "end": 3558.8, "text": "Gehäuse angeguckt, aber das ist wirklich top, gerade mit der, mit der, mit der Scheibe"}, {"id": 645, "start": 3558.8, "end": 3561.76, "text": "hier nebendran, dass man noch ein bisschen RGB-Gedöns sieht, also wenn ich jetzt bei"}, {"id": 646, "start": 3561.76, "end": 3565.64, "text": "mir so neben dem Rechner gucke, seh ich, nee, ich seh noch nicht mal was durch die"}, {"id": 647, "start": 3565.64, "end": 3570.76, "text": "Scheibe, fällt mir grad auf, ich hab den anderen Rechner direkt daneben gestellt,"}, {"id": 648, "start": 3570.76, "end": 3575.56, "text": "ich hab zwar jetzt einen mit Scheibe, dass ich meinen geilen RGB-RAM und RGB-Grafikkarte"}, {"id": 649, "start": 3575.56, "end": 3579.96, "text": "und, und Gedöns angucken kann, aber jetzt hab ich den zweiten Rechner daneben gestellt,"}, {"id": 650, "start": 3579.96, "end": 3582.64, "text": "der steht vor der Scheibe, jetzt kann ich nicht mehr reingucken, hat sich ja richtig"}, {"id": 651, "start": 3582.64, "end": 3588.28, "text": "gelohnt, vor allem ich hab mir sogar damals noch für die Noctua-Lüfter extra farbige"}, {"id": 652, "start": 3588.28, "end": 3594.2, "text": "Plänten geholt, weil stylischer aussieht, jetzt guck ich nicht mehr rein, das ist mir"}, {"id": 653, "start": 3594.2, "end": 3607.28, "text": "total hängen geblieben ey, mal gucken, ob die schon aktualisiert haben auf ihrer Homepage,"}, {"id": 654, "start": 3607.28, "end": 3615.96, "text": "watch now, das haben wir schon gewatched, Fußnoten, nee so schnell sind die nicht bei"}, {"id": 655, "start": 3615.96, "end": 3624.52, "text": "IMD, Stonks, Young Snorlax, Dankeschön für den Sub, Huge Subscription, echt, haben die"}, {"id": 656, "start": 3624.52, "end": 3642.24, "text": "den schon drinnen stehen, ah yes, Anni Sign Up, und wie siehts mit 9050x aus, ooooh, Specifications,"}, {"id": 657, "start": 3642.24, "end": 3650.2, "text": "ah, da können wir doch mal gucken, das ist ja nice, da müssen wir gar nicht raten, da"}, {"id": 658, "start": 3650.2, "end": 3657.28, "text": "müssen wir gar nicht raten, was da drin ist, also, 4,9 Boost, also mit 5 Boost ist nix,"}, {"id": 659, "start": 3657.28, "end": 3666.76, "text": "was manche Leute gesagt haben, AMDs Aktienkurs direkt 2% getroppt, auf die Stonks würde"}, {"id": 660, "start": 3666.76, "end": 3671.56, "text": "ich da jetzt erstmal nix geben, wie, was macht eigentlich Intel Aktie, Intel Aktie, das gucken"}, {"id": 661, "start": 3671.56, "end": 3677.68, "text": "wir uns jetzt mal an, AMD Aktie, was ist da eben passiert, so, AMD Aktie ist erstmal direkt"}, {"id": 662, "start": 3677.68, "end": 3690.04, "text": "runter, und Intel Aktie ist, juckt nicht, ich fand das nicht schlecht, was AMD gezeigt hat,"}, {"id": 663, "start": 3690.04, "end": 3693.16, "text": "das war eigentlich so die logische Konsequenz aus dem, was man das letzte Mal gesehen hat,"}, {"id": 664, "start": 3693.16, "end": 3704.44, "text": "warum, kein Schimmer, ich würd mal morgen abwarten, ich mein natürlich, es hätte nochmal"}, {"id": 665, "start": 3704.44, "end": 3709.48, "text": "eine Nummer härter sein können, aber, wenn das so kommt, und wenn Intel bei diesen Dingern"}, {"id": 666, "start": 3709.48, "end": 3718.28, "text": "jetzt erstmal bleibt, was da grad aktuell ist, dann ist AMD jetzt, zumindest mal, selbst"}, {"id": 667, "start": 3718.28, "end": 3723.08, "text": "wenn wir bezweifeln, dass das stimmt, was die da an Verbesserungen erzählt haben, wird"}, {"id": 668, "start": 3723.08, "end": 3730.68, "text": "teilweise 50% und so, das ist Marketing, Stonks Gelaber, Diana, 2 Monate, Dankeschön, Exquisite"}, {"id": 669, "start": 3730.68, "end": 3743.84, "text": "Subscription, oh, sorry, falsches Emote, Alter, Dankeschön für den Sub, falsches Emote,"}, {"id": 670, "start": 3743.84, "end": 3753.64, "text": "manchmal ist schlecht, wenn Subscription über Piss dich, Alter, oben steht, ja, danke für"}, {"id": 671, "start": 3753.64, "end": 3762.32, "text": "den Sub, Massive Subscription, huge, was wollte ich jetzt sagen, selbst wenn wir mal bezweifeln,"}, {"id": 672, "start": 3762.32, "end": 3768.96, "text": "dass das stimmt, was AMD da erzählt hat mit ihren Gamevergleichen, aber sie sollten mal"}, {"id": 673, "start": 3768.96, "end": 3773.8, "text": "zumindest gleichgezogen sein, was Gaming Performance angeht mit Intel, und allein schon das wird"}, {"id": 674, "start": 3773.8, "end": 3779.56, "text": "ein riesen Verkaufspunkt für viele sein, die sich jetzt immer noch krampfhaft Intel gekauft"}, {"id": 675, "start": 3779.56, "end": 3786.0, "text": "haben, weil Intel ja ein paar FPS in manchen Games mehr hatte, es ist einfach unglaubliches"}, {"id": 676, "start": 3786.0, "end": 3793.0, "text": "Prestige, wenn man sagen kann, man hat die schnellste CPU in allen Bereichen, das bringt"}, {"id": 677, "start": 3793.0, "end": 3807.92, "text": "schon was, PC Lustig hat sich AMD Aktien gekauft, Exzellent, warum hast du die nicht gekauft,"}, {"id": 678, "start": 3807.92, "end": 3815.92, "text": "ist anscheinend besser als gerade AMD, AMD hat gerade gesagt, übrigens der Chat ist gerade"}, {"id": 679, "start": 3815.92, "end": 3821.44, "text": "abgestürzt, bei euch auch, ist bei euch auch der Chat abgekackt, das letzte, was ich im"}, {"id": 680, "start": 3821.44, "end": 3832.24, "text": "Chat gesehen habe, ist von PC Lustig, hat mir extra noch AMD Aktien gekauft, danach"}, {"id": 681, "start": 3832.24, "end": 3840.84, "text": "habe ich nichts mehr gesehen, na jetzt seh ich euch ja wieder, keine Reprise, Chat wieder"}, {"id": 682, "start": 3840.84, "end": 3841.84, "text": "einblenden."}, {"id": 683, "start": 3841.84, "end": 3867.36, "text": "Ja, aber irgendjemand im Stream hat ja geschrieben, er geht safe davon aus, dass es 5GHz Boost"}, {"id": 684, "start": 3867.36, "end": 3873.44, "text": "sein wird, das hat nicht funktioniert, es sind nur 4,9, allerdings ist es für mich gar"}, {"id": 685, "start": 3873.44, "end": 3878.88, "text": "nicht so von Bedeutung muss ich ehrlich sagen, ob das jetzt 4,9, 5, 4,8 Boost hat, das wichtige"}, {"id": 686, "start": 3878.88, "end": 3884.96, "text": "ist ja, dass der Boost auch irgendwie mal erreicht wird, bei den letzten AMD CPUs haben"}, {"id": 687, "start": 3884.96, "end": 3889.44, "text": "wir bei den Videos vom Bauer auch schon oft gesehen, dass eben das einfach nur eine Zahl"}, {"id": 688, "start": 3889.44, "end": 3895.32, "text": "war, die drauf stand und nichts mit der Realität zu tun hatte, da stand da Boost 4,7 oder so"}, {"id": 689, "start": 3895.32, "end": 3901.88, "text": "drauf und es hat Boost gemacht 4,4, war ein bisschen Post-Camp."}, {"id": 690, "start": 3901.88, "end": 3922.04, "text": "So, was haben wir hier, also Up to 4,9GHz, 16 Kerne, noch einmal mehr Cache, sag mal,"}, {"id": 691, "start": 3922.04, "end": 3925.8, "text": "sehe ich das richtig, dass die immer noch den gleichen Sockel verwenden?"}, {"id": 692, "start": 3925.8, "end": 3941.72, "text": "Da kommt, ich mein, wenn man sich überlegt, Intel hat bei wirklich jeder Furzänderung"}, {"id": 693, "start": 3941.72, "end": 3952.84, "text": "einen neuen Sockel rausgebracht, die haben, keine Ahnung, 2MB mehr Cache draufgesteckt,"}, {"id": 694, "start": 3952.84, "end": 3960.68, "text": "neuer Sockel, Video Encoder Upgraded, neuer Sockel, 2 PC Express Lanes mehr, neuer Sockel,"}, {"id": 695, "start": 3960.68, "end": 3965.36, "text": "also Intel hat ja wirklich zu jeder CPU einen neuen Sockel gebracht, unsinnigerweise ehrlich"}, {"id": 696, "start": 3965.36, "end": 3974.4, "text": "gesagt, hieß es nicht das letzte Mal schon, dass es die letzte AM4 Generation wird?"}, {"id": 697, "start": 3974.4, "end": 3982.0, "text": "Ist auf jeden Fall nice, auf der anderen Seite dann vielleicht auch wieder nicht so nice"}, {"id": 698, "start": 3982.0, "end": 3986.68, "text": "für die Leute, die sagen, sie kaufen sich jetzt zum ersten Mal ein AMD System hier mit,"}, {"id": 699, "start": 3986.68, "end": 3990.4, "text": "weil dann kannst du sicher sein, das Upgrade ist ja nicht mehr, aber ich kauf mir ehrlich"}, {"id": 700, "start": 3990.4, "end": 3996.84, "text": "gesagt eh nicht die, ich kauf mir eh nicht die Rechner im Hinblick auf Upgrade-Fähigkeit."}, {"id": 701, "start": 3996.84, "end": 4002.84, "text": "Das, wenn man ehrlich ist, das einzige, was man überhaupt, wenn überhaupt mal Upgraded"}, {"id": 702, "start": 4002.84, "end": 4004.32, "text": "in so einem System ist die Grafikkarte."}, {"id": 703, "start": 4004.32, "end": 4010.84, "text": "Jetzt mal, mal Hand aufs Herz, Leute, wie oft habt ihr schon bei einem bestehenden System"}, {"id": 704, "start": 4010.84, "end": 4013.92, "text": "nach sagen wir 2 Jahren die CPU mal gewechselt?"}, {"id": 705, "start": 4013.92, "end": 4023.6, "text": "Also ich überleg grad, ob ich das überhaupt schon mal gemacht hab, doch hab ich, hab ich,"}, {"id": 706, "start": 4023.6, "end": 4028.08, "text": "hab ich, hab ich und zwar, das ist aber schon ewig schwer, da hab ich glaube ich von einem"}, {"id": 707, "start": 4028.08, "end": 4034.36, "text": "Atlon 64 oder so auf einen Atlon 64 X2 oder wie das Ding, was war denn das hier, AMD,"}, {"id": 708, "start": 4034.36, "end": 4041.64, "text": "wie ist das, Toledo oder so, CPU war das damals, genau, auf so einen hab ich mal gewechselt,"}, {"id": 709, "start": 4041.64, "end": 4052.28, "text": "Sockel 939 kann sein, ja, das hab ich mal gemacht, von einem Atlon 64 Sockel 939 auf"}, {"id": 710, "start": 4052.28, "end": 4059.92, "text": "so einen, aber das war auch das einzige Mal, wo ich das gemacht hab, ansonsten nie und wie"}, {"id": 711, "start": 4059.92, "end": 4066.72, "text": "gesagt, also ich bin jetzt 36, ich bastel bestimmt schon seit, frag mich nicht, 1999, 2000 so"}, {"id": 712, "start": 4066.72, "end": 4074.28, "text": "ein bisschen an dem Kram rum, ich hab einmal meine CPU geupgraded, RAM, RAM upgraden man"}, {"id": 713, "start": 4074.28, "end": 4080.2, "text": "vielleicht auch manchmal, ja, das stimmt, aber ehrlich gesagt, bei mir ist es, ist es,"}, {"id": 714, "start": 4080.2, "end": 4085.2, "text": "es ist zu 90% Grafikkarte, wenn überhaupt was geupgraded wird, bei dem Rechner hier"}, {"id": 715, "start": 4085.2, "end": 4091.28, "text": "hab ich nichts geupgraded, das Ding hab ich gekauft vor 3 Jahren, 8700K, das war einer"}, {"id": 716, "start": 4091.28, "end": 4097.52, "text": "der ersten 8700K, die es in Deutschland gegeben hat, 8700K, 1080Ti, die hatte ich schon sogar"}, {"id": 717, "start": 4097.52, "end": 4103.6, "text": "noch ein Jahr vorher und jetzt 3 Jahre am Stück, doch, doch, ich hab 16G RAM noch dazu"}, {"id": 718, "start": 4103.6, "end": 4109.16, "text": "gesteckt, das stimmt, stimmt, das ist aber alles gewesen, also da hat sich nichts getan,"}, {"id": 719, "start": 4109.16, "end": 4116.12, "text": "ne, aber so CPU Upgraden im laufenden Betrieb, zumal ich bei meinem aktuellen Rechner garantiert"}, {"id": 720, "start": 4116.12, "end": 4126.16, "text": "keine CPU Upgrade, weil ich hab den, ich hab den 8700K, den hab ich geköpft, Flüssigmetall"}, {"id": 721, "start": 4126.16, "end": 4129.96, "text": "dazwischen geschmiert und den Heat-Spreader nicht wieder festgemacht, der Heat-Spreader"}, {"id": 722, "start": 4129.96, "end": 4135.16, "text": "hängt einzig und allein gerade fest, weil ich den Lüfter fest angezogen hab, wenn ich"}, {"id": 723, "start": 4135.16, "end": 4138.92, "text": "den Lüfter jetzt abmach, dann fällt erstmal der Heat-Spreader ab wahrscheinlich, ich muss"}, {"id": 724, "start": 4138.92, "end": 4146.88, "text": "neue Wärmeleitpaste und neue Flüssigmetall drauf machen und sowas, ne, wieso, das ist"}, {"id": 725, "start": 4146.88, "end": 4150.24, "text": "an sich kein Problem, kann man machen, ansonsten hätt ich dann eben ein bisschen Silikon drum"}, {"id": 726, "start": 4150.24, "end": 4156.88, "text": "schmieren müssen, naja, ich hab eh nicht vor das ganze zu Upgraden, macht es eigentlich"}, {"id": 727, "start": 4156.88, "end": 4161.36, "text": "Sinn preisleistungsfähig immer die neuesten CPU zu holen oder lieber die alte GAN, das"}, {"id": 728, "start": 4161.36, "end": 4167.08, "text": "kann durchaus Sinn machen sich die alte GAN zu holen, gerade bei AMD, bei der aktuellen"}, {"id": 729, "start": 4167.08, "end": 4172.04, "text": "AMD-Generation war es teilweise sinnvoll sich noch einen von letzter Generation zu holen."}, {"id": 730, "start": 4172.04, "end": 4183.32, "text": "Also es haben viele, die Budgetgeschichten gebaut haben, die haben noch 1700 oder sowas"}, {"id": 731, "start": 4183.32, "end": 4190.96, "text": "verbaut anstatt 2700 und solche Dinger, ne Moment, 1700 statt 3700, oder was 2700 statt"}, {"id": 732, "start": 4190.96, "end": 4197.6, "text": "3700, was auch immer, die Generation vor der aktuellen, ich glaub 2700 und 3700 war das"}, {"id": 733, "start": 4197.6, "end": 4207.24, "text": "noch, ne, oder, AMD-Benahmung, aber die blick ich immer noch mehr durch als Intel-Benahmung,"}, {"id": 734, "start": 4207.24, "end": 4211.32, "text": "zumindest haben das viele, die aktuell in dieser Generation irgendwie Anfang des Jahres"}, {"id": 735, "start": 4211.32, "end": 4214.76, "text": "sich so einen Budgetrechner zusammengebaut haben mit Ryzen, die haben oftmals noch einen"}, {"id": 736, "start": 4214.76, "end": 4222.48, "text": "von der letzten Generation genommen, ja, das kann sich manchmal lohnen, ich machs nicht,"}, {"id": 737, "start": 4222.48, "end": 4226.0, "text": "das liegt hauptsächlich daran, weil wenn ich mir einen Rechner kaufe und ich hab mir halt"}, {"id": 738, "start": 4226.0, "end": 4233.72, "text": "die letzten Jahre wirklich immer ordentliche Systeme mit Wumms gekauft zum aktuellen Zeitpunkt"}, {"id": 739, "start": 4233.72, "end": 4239.76, "text": "und für mich machts keinen Sinn, weil ich finde ja jetzt schon kaum was an Hardware,"}, {"id": 740, "start": 4239.76, "end": 4246.88, "text": "was sich lohnt zum Upgraden, das heißt ich muss eigentlich sowas hier in der Richtung"}, {"id": 741, "start": 4246.88, "end": 4253.16, "text": "kaufen oder mindestens 5000 oder nix, dass es sich überhaupt lohnt zu Upgraden und das"}, {"id": 742, "start": 4253.16, "end": 4257.84, "text": "ist wenigstens mein ordentliches Upgrade, ich mein es wird jetzt nicht die Welt verändern"}, {"id": 743, "start": 4257.84, "end": 4265.64, "text": "von einem 8700k was Spiele angeht, Spiele, natürlich Video rendern ist hier, das ist"}, {"id": 744, "start": 4265.64, "end": 4270.64, "text": "ne ganz andere Sache, also ob du jetzt mit nem 6-Core Video renderst oder mit nem 16-Core"}, {"id": 745, "start": 4270.64, "end": 4274.48, "text": "Video renderst ist natürlich was ganz anderes, die Sache ist bloß dazu müsste ich erstmal"}, {"id": 746, "start": 4274.48, "end": 4282.52, "text": "Videos machen, dass ich das lohnen würde, aber natürlich, das ist ein riesen Unterschied."}, {"id": 747, "start": 4282.52, "end": 4302.72, "text": "So ist der Sound einfach aus, WTF, warum ist der Sound einfach weg, ah keine Ahnung, ja"}, {"id": 748, "start": 4302.72, "end": 4307.0, "text": "aber das ist ein riesen Unterschied und ich denke auch, dass es im Gaming Bereich ein bisschen"}, {"id": 749, "start": 4307.0, "end": 4312.2, "text": "nen Unterschied macht, ich mein mein 8700k der geht bis zu 5,1 GHz wenn ich den wieder"}, {"id": 750, "start": 4312.2, "end": 4318.68, "text": "hoch takte, AMD, wenn wir mal von ausgehen wie es das letzte mal gewesen ist, dann erreichen"}, {"id": 751, "start": 4318.68, "end": 4324.16, "text": "die auch keine 4,9, dann machen die vielleicht 4,5, 4,6 oder sowas, sie haben zwar großartig"}, {"id": 752, "start": 4324.16, "end": 4328.72, "text": "erzählt mehr Boost noch noch besser und so, aber AMD hat das letzte mal schon gezeigt,"}, {"id": 753, "start": 4328.72, "end": 4338.72, "text": "dass die Boostzahlen mit dem echten Boost nicht all zu viel zu tun haben, ja und deswegen"}, {"id": 754, "start": 4338.72, "end": 4343.28, "text": "glaube ich gerade in Games, dass das jetzt nicht zwei unterschiedliche Welten sind von"}, {"id": 755, "start": 4343.28, "end": 4349.84, "text": "den übertakteten 8700k zu 5,950x, aber es ist vielleicht, es ist zumindest nicht schlechter,"}, {"id": 756, "start": 4349.84, "end": 4352.92, "text": "das ist ja schonmal das was mir am allerwichtigsten ist, dass ich jetzt irgendwie nicht downgrade"}, {"id": 757, "start": 4352.92, "end": 4356.48, "text": "in manchen Bereichen, vielleicht ist es ein bisschen besser, aber das wird mir ja schon"}, {"id": 758, "start": 4356.48, "end": 4361.96, "text": "reichen, ja und dafür hast du eine CPUkerne, ich mein ich lass jetzt schon viele VMs laufen,"}, {"id": 759, "start": 4361.96, "end": 4364.84, "text": "jetzt kann ich, weil im Stream hat es keinen Sinn, aber ansonsten hab ich auch schon immer"}, {"id": 760, "start": 4364.84, "end": 4369.52, "text": "recht viele VMs an, es kann durchaus sein, dass ich mal 2,3 VMs oder manchmal auch 3,4"}, {"id": 761, "start": 4369.52, "end": 4376.12, "text": "VMs nehm bei Laufen ab, da ist es sicherlich nicht verkehrt, wenn man die ein oder anderen"}, {"id": 762, "start": 4376.12, "end": 4385.64, "text": "CPUkurs auch mehr hat, aber ne VM im Eidl braucht jetzt auch nix, so, ja also ich fand"}, {"id": 763, "start": 4385.64, "end": 4392.64, "text": "die Vorstellung nicht schlecht, warum der AMD Stock, Stonks Kurs jetzt getroppt ist,"}, {"id": 764, "start": 4392.64, "end": 4400.2, "text": "keine Ahnung, aber die Stonks Leute versteh ich eh nicht, ich bin auf jeden Fall mal auf"}, {"id": 765, "start": 4400.2, "end": 4405.04, "text": "echte Benchmarks gespannt, ob bei der Sache rauskommt, wir vergleichen jetzt noch mal"}, {"id": 766, "start": 4405.04, "end": 4412.44, "text": "den 9500x, weil der ja nur die Hälfte kostet und deutlich erschwingbarer sein dürfte,"}, {"id": 767, "start": 4412.44, "end": 4437.68, "text": "was es gibt nen Intel 5960x, warum das denn, bei den Intel heißen die Dinger doch 109700k"}, {"id": 768, "start": 4437.68, "end": 4446.4, "text": "oder so was, ach du scheiße, aber das war bei den Mainboards auch mal so, als ich mein"}, {"id": 769, "start": 4446.4, "end": 4454.16, "text": "CPU gekauft hab, da hieß die Plattform glaube von AMD X370 und Intel war Z370, das war auch"}, {"id": 770, "start": 4454.16, "end": 4465.48, "text": "so richtig so richtig pepega, aber ich glaube für die meisten dürfte das hier eher die"}, {"id": 771, "start": 4465.48, "end": 4474.16, "text": "CPU sein, anstatt der 5950x, weil im Prinzip bezahlst du hier für 4 Kerne mehr, 100MHz"}, {"id": 772, "start": 4474.16, "end": 4480.12, "text": "mehr Boost, RAM ist auch kein Unterschied, also im Prinzip ist der einzige Unterschied,"}, {"id": 773, "start": 4480.12, "end": 4491.56, "text": "der andere hat 4 Kerne mehr und 100MHz mehr Boost und kostet das doppelte fast, also das"}, {"id": 774, "start": 4491.56, "end": 4497.76, "text": "lohnt sich nicht, das lohnt sich wahrscheinlich aber zumindest ein bisschen mehr, wie ne 3090"}, {"id": 775, "start": 4497.76, "end": 4504.04, "text": "RTX anstatt ne 3080 RTX, weil das macht ja gerade im Gaming Bereich eigentlich überhaupt"}, {"id": 776, "start": 4504.04, "end": 4510.8, "text": "keinen Unterschied, wenn man sich die Benchmarks anguckt, also mehr Preis bei den Grafiken"}, {"id": 777, "start": 4510.8, "end": 4519.2, "text": "lohnt sich ehrlich gesagt überhaupt nicht, aber trotzdem muss das sein, so stehen die"}, {"id": 778, "start": 4519.2, "end": 4523.52, "text": "anderen auch schon drinne, weil die meisten aktuell haben ja eher sowas, ne da gibts,"}, {"id": 779, "start": 4523.52, "end": 4534.08, "text": "ah Moment da heißt ja auch Ryzen 7 dann ne, ne haben die den nicht auch, ach Moment X,"}, {"id": 780, "start": 4534.08, "end": 4563.76, "text": "ohje, MonkaS, AMD ist überlastet, egal ist das eigentlich Mode ja, ok AMD ist Grip,"}, {"id": 781, "start": 4563.76, "end": 4578.04, "text": "was 7 5800X, aha, Elite Gaming CPU, jetzt haben sie ja oft genug betont, dass sie Gaming"}, {"id": 782, "start": 4578.04, "end": 4588.32, "text": "und PC lieben und Elite und sowieso sind, ja das ist wahrscheinlich, aber hatten die"}, {"id": 783, "start": 4588.32, "end": 4592.72, "text": "nicht nen 7 oder hab ich das durcheinander gebracht, ne wahrscheinlich bring ich das"}, {"id": 784, "start": 4592.72, "end": 4596.64, "text": "durcheinander, was der 8er, das ist wahrscheinlich eher die CPU, die sich die meisten Leute"}, {"id": 785, "start": 4596.64, "end": 4610.24, "text": "holen werden, ne auf meinen hab ich nicht gesehen, will ja auch nicht sein, 5600, ok,"}, {"id": 786, "start": 4610.24, "end": 4620.96, "text": "aber beim 5600 auch ein X dahinter oder, also die Benamung macht immer noch nicht so wirklich"}, {"id": 787, "start": 4620.96, "end": 4637.08, "text": "komplett Klick bei mir im Kopf, aber wenn das jetzt Ryzen 5, ne 5000X, ahja, ok das"}, {"id": 788, "start": 4637.08, "end": 4646.76, "text": "ist der mit 6 Kern, denk mal das wird auch ne Option für viele Leute sein, eine Sache"}, {"id": 789, "start": 4646.76, "end": 4655.0, "text": "kapier ich nicht so genau, müssten nicht theoretisch die CPUs mit weniger Kern potentiell"}, {"id": 790, "start": 4655.0, "end": 4666.84, "text": "höhere Boost erreichen, weil einfach weniger drauf ist, muss das nicht eigentlich so sein,"}, {"id": 791, "start": 4666.84, "end": 4676.8, "text": "also rein so thermalmäßig, was viele sind mit dem Preis, dass Ryzen 5 nicht glücklich"}, {"id": 792, "start": 4676.8, "end": 4682.36, "text": "ist, ist auch 100 US Dollar teurer geworden, ja AMD ist mittlerweile so in der Position,"}, {"id": 793, "start": 4682.36, "end": 4690.36, "text": "wo man sich anscheinend leisten kann, ne, also ich find's noch verdrehtbar, besser als"}, {"id": 794, "start": 4690.36, "end": 4695.28, "text": "das teilweise bei Intel gewesen ist noch vor ein paar Jahren, wo nur eine 2% schnellere"}, {"id": 795, "start": 4695.28, "end": 4699.52, "text": "Enthusiasten High-End CPU gekriegt hat, die das doppelte oder dreifache oder so gekostet"}, {"id": 796, "start": 4699.52, "end": 4705.6, "text": "hat, weißte ich, normale CPU, sinnvoll Preis-Leistung, keine Ahnung, 400 Euro, High-End sonst was"}, {"id": 797, "start": 4705.6, "end": 4716.24, "text": "CPU, 1300 Euro, bam, the fuck, also ich fand die, ich fand die Geschichte nicht übel,"}, {"id": 798, "start": 4716.24, "end": 4729.56, "text": "man kann damit leben, mal gucken, was Twitter sagt, wir geben uns jetzt mal, übrigens,"}, {"id": 799, "start": 4729.56, "end": 4737.08, "text": "also meine Mediatweets sagen immer alles, meine Tweets bestehen aus der Hälfte irgendwelchen"}, {"id": 800, "start": 4737.08, "end": 4743.52, "text": "bescheuerten Meme-Bildchen, Essen, Katzenfotos und mal ein bisschen Programmier-Screenshots,"}, {"id": 801, "start": 4743.52, "end": 4753.24, "text": "fertig, okay, was sagt denn Twitter, Ausnahmezustand, ohje, was ist das, achso, ich dachte wegen"}, {"id": 802, "start": 4753.24, "end": 4759.88, "text": "AMD, was für ein Ding, was in Berliner, Szene, Viertel, Viertel herrscht Ausnahmezustand,"}, {"id": 803, "start": 4759.88, "end": 4767.6, "text": "30 Jahre Besetzung, what the fuck, warum dürfen da Leute 30 Jahre irgendwas besetzen, ey,"}, {"id": 804, "start": 4767.6, "end": 4771.4, "text": "was ist das für eine Logik, okay, ich hab keine Ahnung von dem Fall jetzt, ich sag"}, {"id": 805, "start": 4771.4, "end": 4778.76, "text": "jetzt mal was übel Stammtisch-mäßiges, ja, wenn ich bei mir im Garten einen Baum fälle,"}, {"id": 806, "start": 4778.76, "end": 4783.64, "text": "ich hab einen Baum gefällt bei mir im Garten und ich war dazu verpflichtet einen neuen"}, {"id": 807, "start": 4783.64, "end": 4788.88, "text": "Baum zu pflanzen und dann kam einer, der hat kontrolliert, dass ich den richtigen Baum"}, {"id": 808, "start": 4788.88, "end": 4793.52, "text": "an der richtigen Stelle die richtige Sorte gepflanzt hab, also sprich ich darf auf meinem"}, {"id": 809, "start": 4793.52, "end": 4798.52, "text": "eigenen Grundstück keinen Baum fällen und in Berlin dürfen Leute 30 Jahre raus besetzen"}, {"id": 810, "start": 4798.52, "end": 4803.44, "text": "ohne dass was passiert mit dem, aber wie gesagt ich kenne den aktuellen Fall nicht, ich hab"}, {"id": 811, "start": 4803.44, "end": 4807.96, "text": "keine Ahnung davon, ich weiß nicht was da ist, ja, das sind dann bloß so Dinge, die"}, {"id": 812, "start": 4807.96, "end": 4815.28, "text": "klingen so voll, was gibt's, ach nee, bin ich der einzige der Moria irgendwie mit Herr"}, {"id": 813, "start": 4815.28, "end": 4819.56, "text": "der Ringe in Verbindung bringt und nicht mit Flüchtlingslager, ich denk da immer an Herr"}, {"id": 814, "start": 4819.56, "end": 4828.32, "text": "der Ringe, zumal ich mir dann, weil Amazon macht ja auch ne neue Herr der Ringe Serie"}, {"id": 815, "start": 4828.32, "end": 4833.36, "text": "und ich denk bei solchen Sachen, K-Pop trending, Alter hör mal auf, ich denk bei solchen"}, {"id": 816, "start": 4833.36, "end": 4836.16, "text": "Sachen immer, vielleicht gibt's neue Infos zu der Amazon Serie und dann erinnert's mich"}, {"id": 817, "start": 4836.16, "end": 4840.08, "text": "immer wieder dran, ach Quatsch, das ist ja Flüchtlingslager, das hat ja mit Herr der"}, {"id": 818, "start": 4840.08, "end": 4846.76, "text": "Ringe gar nichts zu tun, aber K-Pop ist trending, so, also interessiert Twitter irgendwie was"}, {"id": 819, "start": 4846.76, "end": 4855.92, "text": "AMD-mäßiges, ist das irgendwie relevant für Twitter, was AMD gemacht hat, Rassistin,"}, {"id": 820, "start": 4855.92, "end": 4863.32, "text": "aber Deutschland geht mir so auf den Sack, ich kann's mir nicht mehr antun, äh, deswegen"}, {"id": 821, "start": 4863.32, "end": 4869.24, "text": "hab ich meinen Twitter auch auf Andorra gestellt, ok, suchen wir mal nach AMD, da muss doch"}, {"id": 822, "start": 4869.24, "end": 4878.96, "text": "irgendwas hier, muss doch irgendwas geben, Big Navi, weiß nicht, irgendwie Big Navi"}, {"id": 823, "start": 4878.96, "end": 4891.52, "text": "hört sich, hört sich halt Big Navi an, gut, das haben wir gerade gesehen, also AMD, ajajaja,"}, {"id": 824, "start": 4891.52, "end": 4905.24, "text": "was auch immer, äh, tja, ok, keine Ahnung was Twitter macht, gibt's da nicht, Twitch,"}, {"id": 825, "start": 4905.24, "end": 4924.48, "text": "Twitch trendet, ok, Twitch ist jetzt auch, ist jetzt auch Sexist und Rassist, ok, aber"}, {"id": 826, "start": 4924.48, "end": 4941.16, "text": "warum trendet Twitch, ok, wegen irgendwie Dingern, wegen aktuellen Dingern, Intel trendet"}, {"id": 827, "start": 4941.16, "end": 4956.88, "text": "in Deutschland, warum, warum trendet ausgerechnet Intel, soll es sich umgedreht sein, wisst ihr,"}, {"id": 828, "start": 4956.88, "end": 4961.08, "text": "dass bei den deutschen Trends traust du dich da gar nicht mehr drauf zu, drauf zu drücken,"}, {"id": 829, "start": 4961.08, "end": 4968.88, "text": "Currywurst könnte es wirklich um ne Wurst gehen, oder um diesen einen Typ, ich weiß"}, {"id": 830, "start": 4968.88, "end": 4973.12, "text": "gar nicht wie der Channel heißt, es gab noch diesen einen Typ, ähm, wo, der auch so ein"}, {"id": 831, "start": 4973.12, "end": 4978.08, "text": "bisschen, äh, was war denn das, irgendein Skandal gab's da doch, hat da nicht auch"}, {"id": 832, "start": 4978.08, "end": 4982.24, "text": "irgendwelche jungen Mädels was geschrieben auf Discord, ich hab, ich verfolge das alles"}, {"id": 833, "start": 4982.24, "end": 4994.48, "text": "nur am Rande und, ähm, ist der Typ nicht so, der Typ ist so, ne, wie gesagt, ich verfolge"}, {"id": 834, "start": 4994.48, "end": 4997.84, "text": "YouTube Deutschland nur am Rande, da traust du dich ja gar nicht mehr durch drauf zu"}, {"id": 835, "start": 4997.84, "end": 5006.12, "text": "klicken, ok, warum, warum trendet Intel, das muss ich jetzt, muss ich jetzt, warum, warum"}, {"id": 836, "start": 5006.12, "end": 5034.28, "text": "trendet Intel, was, Moment, das hat mit Intel aber nichts zu tun, hä, das sind irgendwelche"}, {"id": 837, "start": 5034.28, "end": 5042.44, "text": "Freedom, Freedom Tweets, Alter, was juckt mich das denn, ok, hier, hier, ne, was zum,"}, {"id": 838, "start": 5042.44, "end": 5051.2, "text": "was zum, aaah, ok, Twitter, vergesst, Twitter, vergesst, Twitter sackt einfach nur gerade"}, {"id": 839, "start": 5051.2, "end": 5068.4, "text": "wieder richtig rein, Kokona-Politics, genau, Kokona und Russland-Kommentare hab ich auch"}, {"id": 840, "start": 5068.4, "end": 5076.28, "text": "auf Twitter gerade gesehen, das Video anschauen bezüglich AMD, oh, weiß ich nicht, zeig"}, {"id": 841, "start": 5076.28, "end": 5081.84, "text": "mal, ich mein, wenn es so ne Zusammenfassung ist, ne, das müssen wir uns nicht angehen,"}, {"id": 842, "start": 5081.84, "end": 5086.2, "text": "wir haben es gerade zusammengeguckt, wir müssen uns kein Recap angucken, oder meinte da ist"}, {"id": 843, "start": 5086.2, "end": 5093.04, "text": "irgendwas interessantes drin, ne, das haben wir uns gerade angeguckt, wie sieht es eigentlich"}, {"id": 844, "start": 5093.04, "end": 5101.24, "text": "in Frankfurt wegen Corona aus, schlecht, Frankfurt und Offenbach haben jetzt als erste zwei Städte"}, {"id": 845, "start": 5101.24, "end": 5109.36, "text": "in Hessen wieder verschärfte Maßnahmen, weil sie über irgendeiner komischen Fallzahl pro"}, {"id": 846, "start": 5109.36, "end": 5115.64, "text": "100.000 Einwohner drin sind, ich mein, Frankfurt und Offenbach, passt ja wieder, was Performance"}, {"id": 847, "start": 5115.64, "end": 5138.28, "text": "Claims, ok, ok, gucken wir mal, was er dazu sagt, meint, muss ich mal hier Musik ausmachen,"}, {"id": 848, "start": 5138.28, "end": 5151.68, "text": "ja, ok, ne, der zeigt einfach nur, was AMD gezeigt hat, ich mein, wie gesagt, ich bin"}, {"id": 849, "start": 5151.68, "end": 5168.2, "text": "da auch skeptisch, ne, was ich halt auch geil finde, Battlefield, nicht nur auf dem Abstand,"}, {"id": 850, "start": 5168.2, "end": 5174.24, "text": "auf dem absteigenden Ast, was Gaming angeht, aber auf dem absteigenden Ast, was CPU angeht,"}, {"id": 851, "start": 5174.24, "end": 5180.12, "text": "aber ich sag's euch, ich sag's euch, wie es ist, ich habe in solche Stonks-Grafiken von"}, {"id": 852, "start": 5180.12, "end": 5185.16, "text": "offizieller Seite kein Vertrauen, weil ich trau denen durchaus zu, dass sie sowas hier"}, {"id": 853, "start": 5185.16, "end": 5192.2, "text": "eingebaut haben, einzig und allein dadurch, dass diese Zahlen glaubhafter sind, wobei,"}, {"id": 854, "start": 5192.2, "end": 5200.48, "text": "moment, hä, das, ach, moment, das ist jetzt der Vergleich mit dem, mit dem, ok, der Vergleich"}, {"id": 855, "start": 5200.48, "end": 5210.64, "text": "mit über 50% war mit dem direkten Vorgänger, so, und da müssen wir echt mal normale Benchbugs"}, {"id": 856, "start": 5210.64, "end": 5215.72, "text": "abwarten, ne, das mit, wo so 50% Verbesserungen drinstehen hatten in der Präsentation vorher"}, {"id": 857, "start": 5215.72, "end": 5225.36, "text": "war zwischen 5900 X und 3900 XT? Warum gibt es eigentlich ein 3900 X, ein 3900 XT und"}, {"id": 858, "start": 5225.36, "end": 5233.48, "text": "ein 5900 X? Für was ist denn das T? Und warum gibt es kein 5900 XT? Oder gar eine 9000,"}, {"id": 859, "start": 5233.48, "end": 5250.52, "text": "5900 XT? XT war der Refresh, ah, Chat. Chat kennt sich aus. Da steht nicht mal, was diese"}, {"id": 860, "start": 5250.52, "end": 5259.28, "text": "Balken bedeuten, ja, Image Quality, ne, ne, sie wollen, dass es so aussieht wie Performance,"}, {"id": 861, "start": 5259.28, "end": 5264.24, "text": "wahrscheinlich meinen sie auch Performance, aber welche, was, was sie genau meinen, man"}, {"id": 862, "start": 5264.24, "end": 5268.88, "text": "weiß es nicht. Wie gesagt, deswegen bin ich da immer sehr skeptisch, was solche Grafiken"}, {"id": 863, "start": 5268.88, "end": 5277.6, "text": "angeht. Wenn das bei CSGO stimmt, warum, ist doch egal, man, CSGO läuft überall schon"}, {"id": 864, "start": 5277.6, "end": 5283.84, "text": "am Limit. Ob du CSGO jetzt mit 900 FPS oder mit 950 FPS theoretisch laufen lassen kannst,"}, {"id": 865, "start": 5283.84, "end": 5291.12, "text": "das ist eine große Unterschied, oder? Okay, vielleicht übertrieben, das sind halt vielleicht"}, {"id": 866, "start": 5291.12, "end": 5308.16, "text": "da neutraler 50 FPS. Doch, macht's. Gut, wenn ihr das sagt, Chat. Ja, also wie gesagt,"}, {"id": 867, "start": 5308.16, "end": 5312.24, "text": "auf die Frage, was Corona macht, war in Hessen, wie gesagt, Frankfurt und Offenbach müssen"}, {"id": 868, "start": 5312.24, "end": 5317.68, "text": "jetzt wieder verschärfte, auf Verbotszonen in Frankfurt. Oh, da muss ich mir mal angucken,"}, {"id": 869, "start": 5317.68, "end": 5328.4, "text": "wo ich denn hin darf. Verbot, Alkohol und Maskenpflicht in großen Teilen Frankfurts."}, {"id": 870, "start": 5328.4, "end": 5333.72, "text": "Okay, die Stadt ankündigt Alkoholverbot zu wieder Tragen einer Mund-Nase, das ist,"}, {"id": 871, "start": 5333.72, "end": 5339.8, "text": "das ist auch so geil. Die Mund-Nasen, Maske, Maske geht nicht, weil irgendjemand Copyright"}, {"id": 872, "start": 5339.8, "end": 5346.48, "text": "auf Maske hat, deswegen muss das eine Mund-Nasen-Bedeckung sein. Und es scheißen genug Leute drauf,"}, {"id": 873, "start": 5346.48, "end": 5354.6, "text": "die haben das Ding dann irgendwie so unterm Kinn bammeln oder sowas. Und die richtig"}, {"id": 874, "start": 5354.6, "end": 5359.88, "text": "coolen Leute kürzen das hier ab, MNS oder sowas. So, also von wo nach wo, wo ist in"}, {"id": 875, "start": 5359.88, "end": 5365.64, "text": "Frankfurt, wo ist das in Frankfurt, was? Von Freitag an bis, bis Ende kommender Woche"}, {"id": 876, "start": 5365.64, "end": 5371.8, "text": "ist der Konsum alkoholischer Getränke demnach in folgende Be- Was hat denn Alkoholsaufen"}, {"id": 877, "start": 5371.8, "end": 5379.64, "text": "mit Corona zu tun? Das verstehe ich nicht. Man kann bestimmt argumentieren so nach dem"}, {"id": 878, "start": 5379.64, "end": 5385.08, "text": "Motto, da sitzen die Leute länger zusammen und besaufen sich, aber so prinzipiell hat"}, {"id": 879, "start": 5385.08, "end": 5397.12, "text": "jetzt der Alkoholkonsum und Corona erst einmal nichts direkt miteinander zu tun. Wenn Menschen"}, {"id": 880, "start": 5397.12, "end": 5401.84, "text": "Alkohol gesoffen haben, verhalten sie sich noch dümmer. Ne, ich glaube die Dummheit"}, {"id": 881, "start": 5401.84, "end": 5407.88, "text": "tritt nur mehr zutage, die sind ansonsten genauso dumm. Okay, hier gilt zwischen 8 und"}, {"id": 882, "start": 5407.88, "end": 5416.76, "text": "21 Uhr eine Maskenpflicht im Freien. Goethe-Straße, Goethe-Straße, Louis Vuitton-Store, zahl die"}, {"id": 883, "start": 5416.76, "end": 5424.12, "text": "Kollektion barfick auf Sponsor. Haftbefehl wusste ich mal wieder. Goethe-Straße, zahl,"}, {"id": 884, "start": 5424.12, "end": 5429.04, "text": "Goethe-Straße, da müsste ich, da müsste ich theoretisch ne Maske, ne Maske hier auf"}, {"id": 885, "start": 5429.04, "end": 5436.24, "text": "der Straße. Schweizerstraße, Schweizer Platz, da laufe ich morgens vorbei. Ähm, ich weiß"}, {"id": 886, "start": 5436.24, "end": 5444.48, "text": "nicht wo das ist, Kaiserstraße, jawoll. Also da laufe ich lang, da laufe ich lang und"}, {"id": 887, "start": 5444.48, "end": 5455.68, "text": "da laufe ich öfters lang. Und Opernplatz bis auf... Seit wann gibt es Maskenpflicht"}, {"id": 888, "start": 5455.68, "end": 5461.08, "text": "im Freien? Ja anscheinend in Frankfurt jetzt, seitdem Frankfurt über irgendwelche Grenzwerte"}, {"id": 889, "start": 5461.08, "end": 5472.16, "text": "wieder gekommen ist. Solange du vor 8 und nach 22 Uhr lang läufst, kein Problem. Naja,"}, {"id": 890, "start": 5472.16, "end": 5482.96, "text": "also vor 8 und, das ist so, also zwischen 8 und 22 Uhr ist so die Hauptzeit, ja. Natürlich"}, {"id": 891, "start": 5482.96, "end": 5488.16, "text": "laufe ich da zwischen 8 und 22 Uhr lang. Also ich laufe, wenn ich Glück habe und ganz"}, {"id": 892, "start": 5488.16, "end": 5493.24, "text": "früh auf die Arbeit fahre, dann bin ich vor 8 da, aber ich, wie gesagt, ich habe eh grad"}, {"id": 893, "start": 5493.24, "end": 5498.0, "text": "dauer Homeoffice, aber nur mal so, wenn ich theoretisch dahin fahren würde, dann könnte"}, {"id": 894, "start": 5498.0, "end": 5502.24, "text": "ich das vor 8 packen, aber das, ich muss auf jeden Fall vor 22 Uhr zum Bahnhof, was soll"}, {"id": 895, "start": 5502.24, "end": 5509.92, "text": "da sonst, sonst klappt das ja überhaupt gar nicht. Tja, gut wie es in Offenbach aussieht,"}, {"id": 896, "start": 5509.92, "end": 5514.24, "text": "juckt mich ehrlich gesagt nicht, weil in Offenbach bin ich nie und nach Offenbach gehe ich auch"}, {"id": 897, "start": 5514.24, "end": 5528.04, "text": "freiwillig nicht. Offenbach, Null, ja, nee, nee. Aber gut, in Hanau, wie sieht es in Hanau"}, {"id": 898, "start": 5528.04, "end": 5534.08, "text": "aus? Ihr wisst ja, ich wohne in Hanau, was ist in Hanau los? Schule bleibt weiter dicht,"}, {"id": 899, "start": 5534.08, "end": 5542.52, "text": "Neuinfektionen bei Hanau, okay. Wie viele? Leute, soll ich euch mal was sagen, mir geht"}, {"id": 900, "start": 5542.52, "end": 5549.04, "text": "ehrlich gesagt mittlerweile die ganze Corona-Geschichte voll am Arsch vorbei, ich hoffe nur, also ich"}, {"id": 901, "start": 5549.04, "end": 5552.72, "text": "meine so newsmäßig und so, ich kann mir das nicht jeden Tag wieder neu geben, ich hoffe"}, {"id": 902, "start": 5552.72, "end": 5557.84, "text": "nur, dass es nicht dazu führt, dass die Leute jetzt alle ultra leichtsinnig werden. Na,"}, {"id": 903, "start": 5557.84, "end": 5561.24, "text": "also wie gesagt, wenn ich wirklich mal in Zug steige, dann natürlich ziehe ich meine"}, {"id": 904, "start": 5561.24, "end": 5566.36, "text": "Maske an und alles, aber es ist ja mittlerweile jetzt nichts ultra, es ist ja nichts neues"}, {"id": 905, "start": 5566.36, "end": 5571.2, "text": "mehr, also es ist jetzt nicht so, dass ich mir jeden Tag jegliche News da angucken muss."}, {"id": 906, "start": 5571.2, "end": 5577.08, "text": "Aber man weiß jetzt, was Sache ist, man weiß, dass da sich das auch noch eine Weile hinziehen"}, {"id": 907, "start": 5577.08, "end": 5583.96, "text": "wird und ich, aktuell sieht es für mich so aus, in meinem täglichen Leben spielt Corona"}, {"id": 908, "start": 5583.96, "end": 5589.04, "text": "eigentlich keine Rolle. Corona würde in meinem täglichen Leben nur eine Rolle spielen, wenn"}, {"id": 909, "start": 5589.04, "end": 5597.16, "text": "ich es hätte. Das wäre schlecht, wenn ich es hätte, aber nachdem ich gerade eh Dauer"}, {"id": 910, "start": 5597.16, "end": 5602.92, "text": "Homeoffice hab und ich eh nicht der Allersozialste bin, ihr kennt mich ja mittlerweile, der permanent"}, {"id": 911, "start": 5602.92, "end": 5608.48, "text": "sich da irgendwie in Gruppen besaufen muss, dann ist, also ich hab nicht die großartigen"}, {"id": 912, "start": 5608.48, "end": 5617.04, "text": "Einschränkungen. Also mich betrifft es nicht so, mich wird es nur richtig betreffen, wenn"}, {"id": 913, "start": 5617.04, "end": 5624.0, "text": "ich halt Corona bekomme, das wäre natürlich kacke. So, ja gut, zur AMD kann ich jetzt"}, {"id": 914, "start": 5624.0, "end": 5627.28, "text": "nicht mehr wirklich großartig was sagen, müssen wir mal eine richtige Benchmarks abwarten."}, {"id": 915, "start": 5627.28, "end": 5633.44, "text": "Ich hoffe, dass, wann war Release? Vierter, fünfter Dezember? Fünfter, Fünfter, ne? Kann"}, {"id": 916, "start": 5633.44, "end": 5637.0, "text": "man schon vorbestellen? Kann man schon vorbestellen?"}, {"id": 917, "start": 5637.0, "end": 5666.08, "text": "Oder kann man schon, muss ich mal gucken. Nein, man kann doch nicht vorbestellen. Wäre"}, {"id": 918, "start": 5666.08, "end": 5673.4, "text": "hier, bei Ebay, auf Ebay kannst du schon immer alles bestellen, auch bevor es das gibt. Ah,"}, {"id": 919, "start": 5673.4, "end": 5682.32, "text": "eine 5059X Scheibe verzinkt, exellent. Ja, das ist schon doof, dass Intel eine ältere"}, {"id": 920, "start": 5682.32, "end": 5689.36, "text": "CPU hat, die genauso heißt. Gibt es bei Ebay Kleinanzeigen schon einen? War das letzte"}, {"id": 921, "start": 5689.36, "end": 5700.08, "text": "Preis? Oh, ne. Kann man denn bei, äh, wir haben es bei Alternate geguckt, das schreibe"}, {"id": 922, "start": 5700.08, "end": 5709.92, "text": "ich bei Amazon. Übrigens habe ich alles bestellt, was wir gestern eingekauft haben, Bestellung"}, {"id": 923, "start": 5709.92, "end": 5715.08, "text": "ist raus. Bei Wish, ne, bei Wish kann ich nicht gucken, weil ich den Account nicht mehr"}, {"id": 924, "start": 5715.08, "end": 5733.24, "text": "habe, für Wish. AliExpress, nein, Quatsch, plötze, die haben alle noch nichts. So sieht"}, {"id": 925, "start": 5733.24, "end": 5739.56, "text": "der also aus, die neue AMD CPU. Ich dachte mir schon, dass das fake ist, was die auf"}, {"id": 926, "start": 5739.56, "end": 5745.92, "text": "der Präsentation hochgehalten haben. Das ist der richtig echte neue 5950X. Der sieht"}, {"id": 927, "start": 5745.92, "end": 5751.08, "text": "auch schon so aus. Ich mein, guckt mal, es muss doch einen Vorteil haben, wenn AMD die"}, {"id": 928, "start": 5751.08, "end": 5756.68, "text": "Sachen demnächst in 5nm produzieren lässt. Die können einfach kleiner bauen. Intel hat"}, {"id": 929, "start": 5756.68, "end": 5765.84, "text": "noch so große Dinge, AMD macht jetzt sowas. Please kontaktieren Sie uns zuerst vor Platz"}, {"id": 930, "start": 5765.84, "end": 5775.72, "text": "ein Auftrag. Ah, yes. Exquisite. Wir können Ihnen einen Rabatt, wenn Sie mehr Quantität"}, {"id": 931, "start": 5775.72, "end": 5780.92, "text": "bedrücken. Auch wir können akzeptieren, eine Liste anfangen. Alles klar, natürlich. Kaufen"}, {"id": 932, "start": 5780.92, "end": 5790.28, "text": "wir uns gleich ein paar 5950X auf AliExpress beim AGBG, beim AGBG Store. Gleich fünf Stück"}, {"id": 933, "start": 5790.28, "end": 5796.56, "text": "ordern. Exzellent. Was schreiben wir bei Computer Base dazu? Der gucke ich eigentlich auch immer"}, {"id": 934, "start": 5796.56, "end": 5809.28, "text": "gerne. Warum? Ja, weil die Notebook CPUs so heiß. Kommt bei Anfangs nur auf 500er Mainboards."}, {"id": 935, "start": 5809.28, "end": 5817.3, "text": "Okay. Ersteller Benchmarks. Zen3 stellt Intel komplett in den Stand, sagt AMD. Also wie"}, {"id": 936, "start": 5817.3, "end": 5821.2, "text": "gesagt, mir würde es ja schon fast reichen, und das ist eigentlich auch das Mindeste,"}, {"id": 937, "start": 5821.2, "end": 5824.48, "text": "das mit dem ich mir so einen kaufe, dass sie zumindest gaming-performance-mäßig gleich"}, {"id": 938, "start": 5824.48, "end": 5828.64, "text": "ziehen mit Intel. Der Rest ist dann, der Rest ist Bonus. Ich will aber keinen Downgrade"}, {"id": 939, "start": 5828.64, "end": 5836.6, "text": "von meiner CPU haben. Ananas auf Pizza, nein oder neiner? Also ich, ich esse keinen Ananas"}, {"id": 940, "start": 5836.6, "end": 5843.64, "text": "auf der Pizza, aber kann man, ja warum nicht, wenn es einem schmeckt. Ich mein, ich kenne"}, {"id": 941, "start": 5843.64, "end": 5847.92, "text": "das Ananas-Pizza-Meme. Mir klar. Wobei das stimmt nicht. Ich hab sogar schon mal Ananas-Pizza"}, {"id": 942, "start": 5847.92, "end": 5852.84, "text": "gegessen und zwar mit Hähnchen. Hähnchen-Ananas. War eigentlich ganz gut. Aber meine Lieblingspizza"}, {"id": 943, "start": 5852.84, "end": 5859.72, "text": "ist eh, und jetzt, jetzt, jetzt postchamp der Chat wieder. Meine Lieblingspizza ist"}, {"id": 944, "start": 5859.72, "end": 5881.4, "text": "eh, Pepperoni-Wurst-Spargel-Sauce Hollandaise. Oder mit Hähnchen. Anstatt, anstatt, Hähnchen"}, {"id": 945, "start": 5881.4, "end": 5888.6, "text": "ist auch gut. Hähnchen anstatt Pepperoni-Wurst ist auch gut. Oh hat er, Moment, hängt, hängt,"}, {"id": 946, "start": 5888.6, "end": 5896.8, "text": "hängt der Chat? Hängt das Stream? Ne. Ne, die Vorschau ist einfach kaputt gegangen."}, {"id": 947, "start": 5896.8, "end": 5902.76, "text": "Lul. Aber so ist Hollandaise auf Pizza, Leute. Ich sag's euch, beste. Was auch, ey, was"}, {"id": 948, "start": 5902.76, "end": 5911.24, "text": "auch mega gut schmeckt. Ich bin, ich bin ja kein Pizza-Hut-Fan. Und ja, ich sag Pizza-Hut"}, {"id": 949, "start": 5911.24, "end": 5916.44, "text": "und nicht Pizza-Hut. Aber, ähm, ich bin ja kein großer Pizza-Hut-Fan. Aber es gibt"}, {"id": 950, "start": 5916.44, "end": 5924.8, "text": "eine Sache, die echt geil schmeckt bei Pizza-Hut. Und zwar, keine Ahnung. Äh, kann man sich"}, {"id": 951, "start": 5924.8, "end": 5940.72, "text": "das nicht einfach angucken? Okay, Start. Ich zeil eins suchen. Was? Wohnung. Dafack. Natürlich"}, {"id": 952, "start": 5940.72, "end": 5947.84, "text": "gibt's die Zeil. Was soll denn das sonst sein? Elf. Ey, ich will auch die Zeil geliefert"}, {"id": 953, "start": 5947.84, "end": 5968.32, "text": "bekommen. Okay, Goethe-Straße. What the fuck? Was ist mit Pizza-Hut los? Band. Wie Goethe-Straße"}, {"id": 954, "start": 5968.32, "end": 5977.12, "text": "eins ist nicht drinne. Ach so. Postal-Zeil erkennt er, der ist aber schlecht gemacht."}, {"id": 955, "start": 5977.12, "end": 5984.28, "text": "Äh ja. Ich will euch einfach nur mal zeigen. Also, eine Sache schmeckt, oder wir gehen"}, {"id": 956, "start": 5984.28, "end": 5990.08, "text": "einfach Lieferando-Pizza-Hut. Ist auch vollkommen egal. Nur eine Sache will ich... Ja, Hauptbahnhof."}, {"id": 957, "start": 5990.08, "end": 6006.84, "text": "Perfekt. Eine Sache ist richtig gut beim Pizza-Hut. Und zwar, die Barbecue... Meine Vorschauers"}, {"id": 958, "start": 6006.84, "end": 6032.04, "text": "übelst am Abkacken vom Stream. Barbecue-Lovers. Genau. Wo ist das denn? Barbecue-Lovers. Hier,"}, {"id": 959, "start": 6032.04, "end": 6041.08, "text": "die da. Die schmeckt übertrieben gut. Poggers-Pizza hier. Huge. Ich mag ansonsten Pizza-Hut nicht,"}, {"id": 960, "start": 6041.08, "end": 6051.04, "text": "aber die ist wirklich geil. Die ist wirklich geil. Hier ein schönes Bild von. Die ist"}, {"id": 961, "start": 6051.04, "end": 6059.24, "text": "wirklich geil. Bacon, Pepperoni-Wurst und Barbecue-Sauce. Die ist wirklich geil. Bestellen"}, {"id": 962, "start": 6059.24, "end": 6065.16, "text": "und Refueling. Ich hab die erst vor ein paar Tagen bestellt. Aber das nächste Mal lasse"}, {"id": 963, "start": 6065.16, "end": 6070.2, "text": "ich euch daran teilhaben, Chat. Übelst nice. Weil ich hab jetzt ja auch eine Kamera, da"}, {"id": 964, "start": 6070.2, "end": 6075.08, "text": "kann ich das reinhalten. Die Kamera ist zwar eigentlich für Mikro-Controller und Mainboards"}, {"id": 965, "start": 6075.08, "end": 6078.56, "text": "zum Einplanten, wenn wir was basteln gedacht haben, aber ich kann auch Pizza-Cam machen,"}, {"id": 966, "start": 6078.56, "end": 6086.72, "text": "kein Problem. Also, das ist wirklich sehr, sehr nice. Ist die von den Pit Boys erstellt?"}, {"id": 967, "start": 6086.72, "end": 6091.6, "text": "Nee, wahrscheinlich eher nicht. Aber es wäre geil, wenn es eine Pizza-Hut-Barbecue-Pit-Boys-Kollaboration"}, {"id": 968, "start": 6091.6, "end": 6098.2, "text": "gäbe. Ich bin übrigens doof. Ich hab den Chat nicht aufgemacht. Das kann ich gar nicht"}, {"id": 969, "start": 6098.2, "end": 6107.92, "text": "nachgucken, ob es irgendwelche offenen Punkte gab. Hast du eigentlich dein Licht automatisiert"}, {"id": 970, "start": 6107.92, "end": 6117.12, "text": "bezüglich Smart Home? Ja, also nicht viel. Ich hab eine RGB-Lampe, die anzeigt, ob der"}, {"id": 971, "start": 6117.12, "end": 6120.48, "text": "Zug Verspätung hat. Dass ich gleich morgens beim Aufstehen sehe, ob das Ding schon Verspätung"}, {"id": 972, "start": 6120.48, "end": 6132.36, "text": "hat oder nicht. Ups. Ich hab mal einen Weihnachtsbaum im Smart Home drin mit RGB-Lüchterkette,"}, {"id": 973, "start": 6132.36, "end": 6140.48, "text": "aber ansonsten hab ich keinerlei Licht großartig mit Beleuchtungsszenen und sonst was. Ich"}, {"id": 974, "start": 6140.48, "end": 6147.72, "text": "hab ein paar Relays zum Lichtan- und Ausschalten. Ja, aber das war's. Serious Max, es gab mal"}, {"id": 975, "start": 6147.72, "end": 6156.32, "text": "eine Zeit, da war das fast jeden Morgen rot, die RGB für die Bahn. Wie gesagt, ich hab"}, {"id": 976, "start": 6156.32, "end": 6161.96, "text": "ein paar Relays für Lichter zum Ein- und Ausschalten. Das ist aber alles, was ich großartig an Lichter-Automatisierung"}, {"id": 977, "start": 6161.96, "end": 6168.0, "text": "hab. Falls du ein paar Relays zum Ein- und Ausschalten für Lichter empfohlen haben willst,"}, {"id": 978, "start": 6168.0, "end": 6173.92, "text": "da kann ich dir was Gutes empfehlen. Aber RGB-Lichter, keine Ahnung. So, ich muss mal kurz den Chat"}, {"id": 979, "start": 6173.92, "end": 6185.6, "text": "durchgehen, weil ich hab in der letzten Zeit gar nicht mitgelesen. Gyros-Pizza, oh nee,"}, {"id": 980, "start": 6185.6, "end": 6191.28, "text": "das ist was, da hätt ich keinen Bock drauf. Ich glaub, das wird mir nicht schmecken. Aber"}, {"id": 981, "start": 6191.28, "end": 6196.08, "text": "jedem was ihm schmeckt, ne. Wenn euch Gyros Pizza schmeckt oder wenn euch sogar Ananas"}, {"id": 982, "start": 6196.08, "end": 6200.88, "text": "Pizza schmeckt, esst was ihr wollt. Solange ich meine Spargel-Sauce-Hollandes-Pizza essen"}, {"id": 983, "start": 6200.88, "end": 6210.56, "text": "darf. Nee, Chat war nix. Also Chat, wenn ihr irgendwelche Fragen übersehen habt, gönnt"}, {"id": 984, "start": 6210.56, "end": 6219.36, "text": "ihr Linus Tech-Tipps letzte Tweet. Wenn ihr irgendwas übersehen habt im Chat, dann sagt"}, {"id": 985, "start": 6219.36, "end": 6229.92, "text": "ich, ich hab Bescheid. Letzte Tweet, New Video, nee. Ja, wie gesagt, ich seh das sehr skeptisch,"}, {"id": 986, "start": 6229.92, "end": 6245.76, "text": "diese Verbesserung da. Also ich bin da ganz verhalten begeistert davon. Genau, die Shelly-Sachen"}, {"id": 987, "start": 6245.76, "end": 6256.88, "text": "sind super. Die wollte ich ihm grad auch empfehlen, falls er sowas braucht. Nee, ich hab im Chat"}, {"id": 988, "start": 6256.88, "end": 6259.76, "text": "anscheinend nix übersehen, okay. Also wie gesagt, wenn ihr was übersehen habt, schreibt"}, {"id": 989, "start": 6259.76, "end": 6278.24, "text": "einfach nochmal rein. So, exellent. Es ging doch um die Hot Wheels, nee, oder? Das ist einfach"}, {"id": 990, "start": 6278.24, "end": 6285.24, "text": "nur ein neues Video. Nee, er meint schon den Tweet hier. Wie gesagt, ich bin da verhalten"}, {"id": 991, "start": 6285.24, "end": 6292.44, "text": "optimistisch, ja. Also ich denke, es wird nicht komplett ausgedacht sein, aber als sehr optimiert"}, {"id": 992, "start": 6292.44, "end": 6297.28, "text": "und genau die passenden Sachen rausgesucht. Passende Settings, passende Auflösungen,"}, {"id": 993, "start": 6297.28, "end": 6302.12, "text": "passende Vergleichsmöglichkeiten. Also die Sachen sind immer mit Vorsicht zu genießen."}, {"id": 994, "start": 6302.12, "end": 6308.08, "text": "Noch ein paar Stellen anzeigen. Ich glaub, das passt jetzt grad nicht rein. Hast du da"}, {"id": 995, "start": 6308.08, "end": 6322.16, "text": "ein Video mit der Deutschen Bahn und RGB? Nein, hab ich nicht. Gab es einen Preis für den"}, {"id": 996, "start": 6322.16, "end": 6333.4, "text": "5.900? Nee. Das höchste, was die gezeigt haben, war der 950X. Ach nee, Moment. Das"}, {"id": 997, "start": 6333.4, "end": 6336.4, "text": "war das größte, was sie gezeigt haben. Zu den anderen Sachen haben sie nichts gesagt."}, {"id": 998, "start": 6336.4, "end": 6346.84, "text": "Ich glaube, der wird hier auch noch gar nicht drinne stehen. Nee. Was? Also zu 5.990X hab"}, {"id": 999, "start": 6346.84, "end": 6356.88, "text": "ich nix mitgekriegt. Was? Quatsch, nein. Chat. 5.990X, da haben die noch nix zugesagt."}, {"id": 1000, "start": 6356.88, "end": 6377.76, "text": "Die haben zum 5.900X was gesagt, aber nicht zum 5.990X. Choose my name oder der echte"}, {"id": 1001, "start": 6377.76, "end": 6383.12, "text": "Proxy? Nee, das geht über das eingebaute Bahnmodul von Home Assistant. Wobei das in"}, {"id": 1002, "start": 6383.12, "end": 6391.6, "text": "letzter Zeit ganz schön rumgespackt hat, muss ich sagen. Das geht direkt hier drüber."}, {"id": 1003, "start": 6391.6, "end": 6398.16, "text": "Da gibst du an, von welcher Station du fährst, zu welcher Station du fährst und dann musst"}, {"id": 1004, "start": 6398.16, "end": 6404.08, "text": "du nur noch sagen hier Only Direct Connections, dass er dir auch den richtigen Zug raussucht"}, {"id": 1005, "start": 6404.08, "end": 6408.92, "text": "und dann zeigt er dir direkt den Webinterface an, ob dein Zug Verspätung hat oder nicht"}, {"id": 1006, "start": 6408.92, "end": 6413.68, "text": "und wenn du die Info hast, kannst du danach dann auch ein Template machen und eine RGB"}, {"id": 1007, "start": 6413.68, "end": 6424.04, "text": "Lampe steuern mit den Infos. Genau, also das hier ist das Höchste, was"}, {"id": 1008, "start": 6424.04, "end": 6438.48, "text": "wir heute gezeigt haben. Mit 5.990X haben sie nix zugezeigt. Gibt's ja gar nicht oder"}, {"id": 1009, "start": 6438.48, "end": 6446.48, "text": "keine Ahnung, bei AMD Benahmung ist da alles möglich. Achso, den haben sie gezeigt. Der"}, {"id": 1010, "start": 6446.48, "end": 6452.88, "text": "hat irgendwas um 500 Euro gekostet. Dollar, aber im Prinzip ist ja der Kram. Du kannst"}, {"id": 1011, "start": 6452.88, "end": 6456.72, "text": "den Kram ja fast mehr oder weniger 1 zu 1 in Euro umrechnen. Sorry, bin gerade erst"}, {"id": 1012, "start": 6456.72, "end": 6463.68, "text": "rein. Sind die neuen Prozesse krass oder wie erwartet? Also ich würde sagen, wie erwartet?"}, {"id": 1013, "start": 6463.68, "end": 6472.64, "text": "Nicht übertrieben krass, aber ziemlich gut. Kennst du dich mit Smartphones aus? Nee, nicht"}, {"id": 1014, "start": 6472.64, "end": 6481.44, "text": "großartig. Aber ich finde das ziemlich gut, was AMD gezeigt hat. Es ist die konsequente"}, {"id": 1015, "start": 6481.44, "end": 6485.04, "text": "Weiterentwicklung von dem, was sie schon vorher gemacht haben. Also was anderes habe ich jetzt"}, {"id": 1016, "start": 6485.04, "end": 6489.4, "text": "nicht erwartet. Also ich habe nicht gedacht, dass AMD jetzt um die Ecke kommt irgendwie"}, {"id": 1017, "start": 6489.4, "end": 6496.92, "text": "und sagt Bam 32 Kerne Desktop CPU, Bam 5,5 GHz, 6 GHz Boost oder da habe ich ehrlich"}, {"id": 1018, "start": 6496.92, "end": 6502.48, "text": "gesagt nicht mit gerechnet. Wäre auch ziemlich unrealistisch gewesen. Ich meine, es wäre"}, {"id": 1019, "start": 6502.48, "end": 6509.0, "text": "natürlich Porgas gewesen, aber da kommt man eigentlich nicht mit rechnen. Das ist eigentlich"}, {"id": 1020, "start": 6509.0, "end": 6515.2, "text": "eher so die logische konsequente Weiterentwicklung und das ist auch okay. Chuck 690, 14 Monate"}, {"id": 1021, "start": 6515.2, "end": 6529.52, "text": "schon, guck mal hier. Massive Brain Subscripts, danke schön. 10900, wie spricht man die Intel"}, {"id": 1022, "start": 6529.52, "end": 6540.76, "text": "CPUs eigentlich richtig aus? 10900K, 10900K, 10900K, zumindest man kann nicht schlecht"}, {"id": 1023, "start": 6540.76, "end": 6545.0, "text": "sagen, ob sie den platt gemacht haben. In der Präsentation haben sie gesagt, sie haben"}, {"id": 1024, "start": 6545.0, "end": 6551.68, "text": "den platt gemacht, aber es ist halt die Frage, wie sehr man diesen Sachen trauen kann, was"}, {"id": 1025, "start": 6551.68, "end": 6556.44, "text": "sie in der offiziellen Präsentation zeigen. Ich gehe davon aus, dass es nicht komplett"}, {"id": 1026, "start": 6556.44, "end": 6562.76, "text": "erlogen ist, aber ich gehe davon aus, dass sie halt wirklich sehr optimale Settings in"}, {"id": 1027, "start": 6562.76, "end": 6571.56, "text": "den besten Stellen in einem Spiel, wo man das eben zeigen kann, genommen haben. Und da"}, {"id": 1028, "start": 6571.56, "end": 6577.6, "text": "waren sie eine ganze Ecke schneller, guck mal hier, hier zeigt das doch gerade im Video,"}, {"id": 1029, "start": 6577.6, "end": 6581.96, "text": "wie viel schneller die waren. Das ist wohl der Vergleich von AMD aber wohlgemerkt, von"}, {"id": 1030, "start": 6581.96, "end": 6601.56, "text": "AMD der Vergleich zum 10900K. Also, es ist ein bisschen schneller. Und gerade in CS GO"}, {"id": 1031, "start": 6601.56, "end": 6607.48, "text": "und League of Legends, ok. Aber wie gesagt, es ist schwierig zu sagen, also ich warte"}, {"id": 1032, "start": 6607.48, "end": 6611.64, "text": "erstmal, bis es unabhängige Benchmarks gibt. Genau und außerdem ist es 1080p, wie gesagt,"}, {"id": 1033, "start": 6611.64, "end": 6619.0, "text": "die haben schon absichtlich genau das rausgesucht, was halt gut passt. Zumindest wenn man jetzt"}, {"id": 1034, "start": 6619.0, "end": 6623.92, "text": "den 10900K hat, der ist ja über Nacht nicht schlecht, wie gesagt, ich habe ja auch noch"}, {"id": 1035, "start": 6623.92, "end": 6629.84, "text": "ein 8700K drinne und bei mir war das Problem die ganze Zeit, ich habe keinen Grund gefunden"}, {"id": 1036, "start": 6629.84, "end": 6636.52, "text": "zum Upgraden. Aber PClustig, ich wollte es gerade sagen, ich kann schon verstehen, warum"}, {"id": 1037, "start": 6636.52, "end": 6641.92, "text": "es mit 1080p gemacht hat. Weil in 1080p kannst du deutlich besser zeigen, je nach Szene,"}, {"id": 1038, "start": 6641.92, "end": 6646.92, "text": "je nach Game, kannst du deutlich besser zeigen, was die CPU so kann, deswegen wäre vielleicht"}, {"id": 1039, "start": 6646.92, "end": 6654.28, "text": "sogar fast Low Image Quality noch besser gewesen, was die CPU so kann, als bei 4K, wo es hauptsächlich"}, {"id": 1040, "start": 6654.28, "end": 6662.8, "text": "an der Grafikkarte hängt. Ja, Mad Vibe, das haben wir vorher auch schon"}, {"id": 1041, "start": 6662.8, "end": 6666.56, "text": "besprochen, das war ja gerade zu lächerlich, was Intel getrieben hat mit den neuen Sockel"}, {"id": 1042, "start": 6666.56, "end": 6672.6, "text": "in den letzten Jahren. Wie gesagt, äh, keine Ahnung, CPU hat jetzt 2MB mehr Cache, bam,"}, {"id": 1043, "start": 6672.6, "end": 6679.52, "text": "neuer Sockel. CPU hat jetzt irgendwie, was weiß ich, den Heatspreader andersrum drauf"}, {"id": 1044, "start": 6679.52, "end": 6697.92, "text": "gemacht, neuer Sockel, Intel hat für jeden Scheiß neuer Sockel gemacht. Ja, gut, was"}, {"id": 1045, "start": 6697.92, "end": 6702.12, "text": "soll ich noch großartig sagen zu dem Tohler Geschichte, wir müssen uns mal abwarten, ich"}, {"id": 1046, "start": 6702.12, "end": 6707.76, "text": "bin halt, also wo ich wirklich am meisten gespannt drauf bin, ist, ob es am 5. November"}, {"id": 1047, "start": 6707.76, "end": 6715.88, "text": "wirklich welche lieferbar gibt, oder zumindest, dass man, wenn man früh dran ist, eine halbwegs"}, {"id": 1048, "start": 6715.88, "end": 6728.0, "text": "realistische Chance hat einzubekommen. Hast du Stonks von AMD? Nein, ich hab keine AMD"}, {"id": 1049, "start": 6728.0, "end": 6732.76, "text": "Stonks, wobei AMD Stonks auch gerade nicht so gut sind, was ich nicht verstehe, weil"}, {"id": 1050, "start": 6732.76, "end": 6739.52, "text": "die AMD Aktie ist jetzt erstmal runtergefallen, bei der Präsentation hier, guck, bam, warum"}, {"id": 1051, "start": 6739.52, "end": 6746.16, "text": "auch immer, die Ankündigungen waren eigentlich vollkommen in Ordnung, Stonks erstmal hier,"}, {"id": 1052, "start": 6746.16, "end": 6767.0, "text": "hopp, hat sich ausgestonkt, was Nvidia auch, echt, da würd ich jetzt nicht allzu viel drauf"}, {"id": 1053, "start": 6767.0, "end": 6773.2, "text": "geben, aber morgen abwarten. Kommt in absehbarer Zukunft nochmal ein Laberstelz? Ja, ich hab"}, {"id": 1054, "start": 6773.2, "end": 6776.16, "text": "einfach am Sonntag was aufgenommen, aber es hat mir nicht gefallen, das nehm ich immer"}, {"id": 1055, "start": 6776.16, "end": 6781.84, "text": "neu auf, aber hat nichts mit AMD zu tun und nichts mit Gaming zu tun, hab ich ja letztens"}, {"id": 1056, "start": 6781.84, "end": 6794.92, "text": "im Stream, im letzten Stream glaub ich schon ein bisschen erzählt. Also nein, ist für"}, {"id": 1057, "start": 6794.92, "end": 6800.88, "text": "nichts, komm, ja, wenn's nach meinem Upload-Output geht, dann wahrscheinlich nicht, ne, oder"}, {"id": 1058, "start": 6800.88, "end": 6820.48, "text": "eher nicht. Mein letztes, wie lang ist mein letztes Video schon her jetzt? Ups. Ah, halbes"}, {"id": 1059, "start": 6820.48, "end": 6839.88, "text": "Jahr. Halbes Jahr ist es schon wieder her. Da machst du nix. Okay Leute, ist der Friseur"}, {"id": 1060, "start": 6839.88, "end": 6860.52, "text": "am Start. Machst du Hito? Hab ich schon. Hab ich schon drin. Der Friseur streamt, bam,"}, {"id": 1061, "start": 6860.52, "end": 6867.4, "text": "Leute. Ich hoste jetzt den Friseur. Oh, geh auf, weil ich hab für heute nichts geplant."}, {"id": 1062, "start": 6867.4, "end": 6877.6, "text": "Wir raiden den jetzt. Was geplant am 21? Ich glaub da ist Apple, ne? Der Friseur spielt"}, {"id": 1063, "start": 6877.6, "end": 6888.36, "text": "wieder irgendwelche Weep-Games. Also, dann spamme mal beim Friseur kurz ein bisschen"}, {"id": 1064, "start": 6888.36, "end": 6894.48, "text": "rum, der freut sich bestimmt. Und am 13. ist Apple-Event, kann auch sein, ich weiß nicht,"}, {"id": 1065, "start": 6894.48, "end": 6902.92, "text": "ich werde es nach Möglichkeit streamen und mein Self zugeben. Also, wir sehen uns im"}, {"id": 1066, "start": 6902.92, "end": 6925.24, "text": "nächsten Stream, machts gut, bis dann, see you."}]}