{"text": "Hallo? Hallo? Hallo? Hallo? Hallo? Oh, der Ori-Sound-Rektor schlägt sich ein, weil... Oh, ich höre mich doppelt, ich muss auf der anderen Seite ausmachen. Nein, nein, nein, ich spiele nicht heute, Ori, ich hab nur den Soundtrack an, aber, ha? Big Brain. Wobei, hatten wir den nicht auch als Emote? Ah, ich muss den erstmal auf Twitter posten. Twitter bestes Social Network, oder bestes Social Plattform, ist ja kein Social Network. Aber Twitter ist beste Social-Gedöns-Plattform. Und wisst ihr woran das liegt? Warum Twitter die beste Social Plattform ist? Oh, jetzt hab ich meinen Stream zugemacht hier auf der anderen Seite, jetzt seh ich den Chat gar nicht. Lull. So, erstmal posten. Twitter ist die beste Social Plattform, weil das irgendwie eine gewisse Einstiegshürde hat und die Idioten das nicht checken. Also die Deppen checken Twitter nicht, deswegen sind sie nicht auf Twitter und deswegen ist Twitter besser. Sollte ich den Titel vielleicht noch schreiben, weiter programmieren oder sowas? Das ist richtig, das ist richtig, Big Brain. Was zum Teufel ist Master Don, hab ich noch nie gehört. Was ist Master Don? The Invisible Darkness, da ist der EQ nicht Big Brain genug für mich. So, ich wollte das jetzt noch auf Twitter posten. Oh, ich weiß nicht, was ich hier gesagt habe… So, wieder, Twitter ist raus, Tweet ist raus, kann sein losgehen, so, also, ähm, 17 Uhr, denke ich, sind die meisten glücklicherweise schon daheim. Max ist Anwendungs-Entwickler geworden, statt System-Indikator. Eigentlich, äh, eigentlich war ich da schon immer. Deswegen mache ich auf der Arbeit eigentlich auch kaum noch Admin-Geschichten. Es haben mich in letzter Zeit öfters Leute gefragt, was ich auf der Arbeit mache. Ich habe mir da ein bisschen Gedanken zugemacht, wie ich das erklären kann, aber ich versuche das mal zu zeigen. Also, schwierig zu zeigen, weil wir haben bloß einen Pull-Request. Ich versuche das euch mal so ein bisschen zu erklären. Was zum Teufel ist Master Dawn, das habe ich ja noch nie gehört. Ah, yet another social network, ein dezentralisiertes Microplogging-Netzwerk, ja, jetzt schauen wir mal die richtigen BuzzBuds am Start, aber beste, beste BuzzBuds, also beste Bullshit-Bingo-Sache war gar nicht auf der E3, sondern die Apple Keynote, die er da gehalten hat, wo er dann angefangen hat zu erzählen, Deep Technology Accelerated Workflow, das könnte auch in irgendeinem Hip-Hop-Song vorkommen, so, weißt du, Deep Technology Accelerated Workflow, mit Bitches oder so. Ah ja, gleich da, gleich da, wäre nicht schlecht. Siehste, deswegen, es fragen ja auch immer Leute im Stream, warum, Max, warum willst du die Overlays sehen? Genau aus so einem Grund will ich die Overlays sehen, weil ich sie sonst vergesse rauszumachen, das suckt. Genau, also nachdem ich ja in der letzten Zeit ein paar Leute gefragt habe auf der Arbeit, was ich denn mache, ich versuche das mal hier an unserem GitHub-Repo für das Memboard zu demonstrieren, das ist ein bisschen klein, ja, und außer einem Pull-Request haben wir nix, aber eine der Sachen, die ich auf der Arbeit mache, und das ist immer schwierig, wenn ich einfach sage, ich kümmere mich um Software-Repos und sonst was, da kann man sich immer so schwer, so schwer was drunter vorstellen, meine Tür klappert, das ist ja nervig, aber zum Beispiel, das ist das GitHub-Repo, wo sich jeder hier das Tool angucken kann, was ich, was ich programmiere gerade. Und einer der Hauptgründe, warum GitHub so beliebt ist, und warum das so viele Leute benutzen ist, weil man da zusammenarbeiten kann, ganz gut, und das heißt, jeder kann sich jetzt diesen Code hier neben den Showclan haben, was ändern, und wenn er möchte, dass seine Änderung quasi in das Hauptprojekt wieder rein kommen, macht er ein Pull-Request. So ungefähr in der Richtung, das ist ja nix GitHub-spezifisches, das ist eigentlich eher Basket-spezifisches, also was Versionsverwaltung-spezifisches, dass man eben sagt, hey, ich mach mir den eigenen Branch auf, entwickle da neue Dinger drinnen, und dann reiche ich das Ganze wieder ein. So, und so machen wir das auf der Arbeit auch, plus, dass wir da nicht ein Mini-Repo haben, sondern ein paar ziemlich große, mit Source-Code von verschiedenen Software-Projekten drin, ein riesengroßes und der Rest ein bisschen kleiner. So, und dementsprechend kommt da nicht ein Merch-Request, beziehungsweise nicht ein Pull-Request, wie es bei GitHub heißt, sondern, sag mal mal so, im Monat ungefähr 60, so über den Daumen gepeilt jetzt mal, so ungefähr, ja, das schwankt immer ein bisschen, aber ich kann es euch jetzt auch schlecht nicht zeigen, weil dann müsste ich ja mehr oder weniger was, ja, revealen, leak, expose, und so ungefähr 60 für das große, für das große Repo. Kommt ungefähr 60 neue Features oder, ja, zum größten Teil tatsächlich irgendwelche neuen Sachen. So, und ich kümmere mich drum, ich gucke mir das dann an, was die Leute gemacht haben, gucke mir das an, also hier ist jetzt beispielsweise eins offen, bei uns sind es 260 Stück, mit auch ein bisschen umfangreicheren Änderungen als das hier, ach wobei, ne, das kommt sogar ungefähr hin. Die Dinger bei uns auf der Arbeit sind ungefähr ähnlich umfangreich wie der Pull-Request hier, so zumindest von Zeilen geändert. Wobei dies oftmals ein bisschen komplizierter ist durchzublicken. So, dann nehme ich mir das, gucke mir das an, gebe da mal einen Senf dazu ab, dann haben wir noch so einen, das gibt es hier glaube ich auf GitHub nicht, dass man quasi noch Daumen hoch geben kann, so nach dem Motto, ja, ich hab mir das angeguckt, ich find das gut, dann müssen mindestens zwei Leute Daumen hoch gegeben haben, dass bei uns das überhaupt bis zu dem Punkt kommt, dass ich das mir angucke und das gemercht werden kann, gucke mir das Ganze an, gebe hier noch ein bisschen mal einen Senf dazu, wenn ich das nicht verstehe oder wenn ich überhaupt nicht checke um was es geht, frage ich den Typ nochmal was er gemacht hat, und dann kommt der Knackpunkt, entweder es passt zu den Änderungen die andere gemacht haben oder es passt nicht, und das ist immer so ein bisschen das komplizierteste, und das ist eigentlich auch das wo die meiste Zeit, wo die Hälfte der Zeit rauf geht, wenn man sich vorstellt mal ein großes Software repo und da arbeiten, sagen wir mal es kommen 60 relativ umfangreiche Changes pro Monat, da kann das durchaus sein, dass die eine Änderung nicht unbedingt so gut mit der anderen harmoniert, drücken wir das mal so aus, das kann so vorkommen, also meistens ist es relativ unabhängig, aber das kommt schon ab und an mal vor, ja, und da muss ich mit die Leute schlappen und sagen, guck mal was hast du da gemacht, guck mal was hast du da gemacht, dass dann irgendwie so ein Best-of rauskommt am Ende, dass das alles funktioniert, und wenn das dann fertig ist, dann machen wir eine Beta-Version aus der ganzen Sache, dann probieren wir das aus, testen das, dann irgendwann machen wir mal so eine Art Release Candidate-Version draus, man darf dann mal die Qualitätssicherung und alle anderen Abteilungen, die ihr selbst noch dazu abgeben, und irgendwann wird dann diese Version, geht das live, und dann geht das ganze wieder von vorne los, so, ungefähr das mache ich auf der Arbeit, zur Erklärung, ja, das klingt jetzt vielleicht ein bisschen, hat man das verstanden, hat man verstanden was ich mache, ich habe mir nämlich ein bisschen, ich habe mir überlegt, wie kann ich das jetzt sinnvoll erklären, das hat kaum noch was mit Administrator an sich zu tun, also gar nicht mehr, ich habe Systemintegrator gelernt, das ist was aber auch, so, und das mache ich schon im Endeffekt jetzt seit, mal überlegen, seit 2012, nee, ja doch, so, so 2012 rum, würde ich sagen, mache ich das schon, in dem Dreh, dementsprechend kenne ich mich mit Git auch ganz gut aus, und ich kann euch sagen, man kann mit Git alles machen, ob es eine sinnvolle Idee ist, ist was anderes, aber man kann alles machen, noch so bescheuert, die bescheuertsten Sachen, ja, dementsprechend programmiere ich in letzter Zeit relativ wenig selbst, bis auf so ein paar kleine Hobbydinger, also nee, ich nenne es zwar Hobbydinger, ja, also es sind schon sinnvolle Sachen auf der Arbeit, Arbeit ist nichts großartiges oder so, hast du dir ein paar Bitcoins gekauft, während die zurzeit noch günstig sind, nee, habe ich nicht, das muss jeder selber wissen, ob er sich Kryptowährung oder sowas holen will, Moment, was, was macht denn eigentlich, Alter, okay, abbrechen, diese Programmingkategorie auf Twitch, das ist mega fail, das ist mega fail, ist Git Turing complete, nee, kannste ja schlecht sagen, Git, kannste keine Logik programmieren, und nachdem du Git Hooks in allen Sprachen machen kannst, die natürlich schon, so, also, nachdem schon wieder die Frage kam, sag mal, können wir, mal Frage an die Mods, können wir noch ein Kommando machen für das Memetool, was das macht, dass ich das dann immer erklären muss, das Screenshot Tool ist ja erstmal auf Eis, das wird erst wieder aktuell, wenn ich aktiv anfange mit der BDO zu spielen, also was ich mache ist folgendes, ich meine, ihr habt ja im Prinzip schon gerade in Auktionen gesehen, ne, das hat vielleicht gar nicht aufgefallen, aber die, die dabei sind, die kennen das natürlich, das Memetool macht sowas hier, das Overlaid, transparente PNGs und animierte Gips, und es Overlaid die nicht nur, also, es zeigt die nicht nur an, das ist ein richtiges Overlaid, also sprich, man kann durchklicken, also sprich, das ist transparent, das Bild, ist über allen anderen Anwendungen drüber, das war gar nicht so einfach, und man sieht, es nimmt sich auch keinen Fokus, also wenn ich hier, ne, ihr seht es im Hintergrund, das Strakentrop bleibt aktiv, selbst wenn ich es ein- und ausblende, ne, Big Brain, das macht das, und wir haben das das letzte Mal eigentlich auch ganz gut hingekriegt, es fehlen jetzt noch ein paar Sachen, also es fehlen noch eine wichtige Sache, die machen wir heute, wo ich der Meinung bin, dass es essentiell, dass die geht, und das nächste Mal, also da werden wir heute wahrscheinlich auch ein bisschen für brauchen, so, und das nächste, was wir machen ist, das ist aber in einem der nächsten Streams, wir machen ein Dashboard, was übers Netzwerk funktioniert, weil aktuell ist es ja so, das liest hier, ich zeig's mal, ist die Ori Musik zu laut, oder passt das so, sag mal, ob die Musik passt, ähm, aktuell ist es so, das liest hier hardcoded noch aus einem Ordner die Bilder ein, so, ich zeig's mal, so, und hier liegen die Bilder drinne, also alle Bilder, die ich hier als Auferlay anzeigen kann, ne, zum Beispiel, ich starte das ganze nochmal, zum Beispiel hier mein Plon, bam, mein Plon, zeigt da an, so, das ist natürlich nicht schön, wenn man hier wie hardcoded irgendwelche Pfade drin hat, oder so, und eine Sache, die ich, bisschen leiser, ok, ja, was denn, Ju, Just Marv sagt etwas lauter, Hype sagt, passt, White Tiger Sinon sagt, bisschen leiser, so, ich hab jetzt drei Antworten, und drei Leute sagen was Unterschiedliches, lull, ich glaub, das kommt auch ein bisschen auf den Soundtrack an, was gerade läuft, das, das ist glaube ich jetzt gerade recht angenehm, guck mal mal, also, wenn es irgendwie zu laut ist, sagt einfach Bescheid, so, ich muss da gleich mal was zu trinken holen, ja, jetzt wirklich ein bisschen laut, wir machen mal einen Tickenleiser, so, das ist ganz gut, denke ich, hallo, this is Snax, Agis, moin, so, was wollte ich gerade sagen, genau, eine ganz wichtige Funktion, die noch fehlt, die noch unbedingt sein muss, ist, dass man hier Bilder, während das läuft, hinzufügen kann, und auch entfernen kann, aber das kommt so dann mit, also zum Beispiel, wenn ich mal angenommen, ich hab das jetzt laufen im Hintergrund, ich hab irgendeinen Stream an, oder sonst was in der Richtung, ich denk mir jetzt so, ey, guck mal, ich hätte jetzt hier gerne noch ein paar Bilder dabei, dann kann ich das Bild hier einfach reinziehen, und kann es benutzen, ohne dass ich den ganzen Scheiß neu starten muss, das finde ich ganz praktisch, vor allem auch in Kombination, was wir dann nächsten Streams machen, ist, dass wir das Ding noch netzwerkfähig machen, dass man es quasi von einem zweiten Rechner aus fernsteuern kann, das ist dann quasi so ein Elgato Stream Deck Light selbst gemacht, wobei ich mir nicht sicher bin, hat jemand von euch das Ding hier? Hat das jemand? Mich würde nämlich mal interessieren, wie das funktioniert, ich hab es nicht ausprobiert, ob das quasi die Bilder wirklich als Overlay anzeigt, sodass es der Streamer auch sieht, oder ob das nur die Bilder im OBS anzeigt, so wie den Text hier zum Beispiel, das würde mich interessieren. A Pavilion Man fragt, ob ich mal drüber nachgedacht hab, die Watts auf YouTube hochzuladen, nö, weil man kann die, erstens kann man die Sachen angucken auf Twitch, oder aber, du gehst auf die Archivseite vom Sebaro, da hast du keine Werbung, du hast allerdings auch kein Twitch Chat dabei, und du hast alle Aufzeichnungen seit September. Ich kann euch das mal zeigen, hat er nämlich sehr schön gemacht, hat das Sebaro gebastelt hier, www.wobblers.tv, so, und da kann man jetzt nämlich sagen, Archiv Twitch, ja, es stand sich schnell, ist die Seite, nett, das stimmt, aber ist doch egal, so, und dann geht man hier auf Archiv, da, nicht auf Twitch, auf Archiv, und dann sieht man, da sind fast alle Streams drin, ah, das ist der E3 Stream, das ist alles drin, könnt ihr hier rumscrollen, sogar Tooth the Moon ist drinne, Bible Thump, Bidiorio, jetzt Overwatch, geht jetzt alles drinne, seit, hier sogar, sogar, ich hab's gehabt, ich hab's gesehen, sogar der Übertakter-Stream ist drinne, furchtbar neuer Rechner-Übertakter, alles seit September, fehlen ein paar Streams davor, aber das ist nicht so, nicht weiter wild, könnt ihr euch angucken, wer es sehen will, also wer ein Archiv braucht, so, auf geht's, also, wie gesagt, ich halte es für wichtig, dass man Bilder hinzufügen kann, so, und da ich nicht vergess auszumachen, will ich die Overlays halt selbst sehen, genau, und ich will das, ich will es so machen, dass ich beispielsweise sagen kann, hier, während das läuft, will ich einfach auch ein paar Bilder entfernen, vielleicht will ich manche nicht verwenden oder so, und vor allem will ich neue reinziehen, aktuell ist das auch noch ein bisschen umständlich, weil man kann Bilder, also die Overlays hier, kann man nur mit Shortcuts aufrufen, das ist super, wenn man quasi spielt und zwischendrin irgendwie sagen will, null, also sprich, wenn ich jetzt irgendwas am Spielen will und will mal kurz null machen, das ist mit Shortcuts natürlich am besten, aber wenn man dann irgendwann 32 hat und sich theoretisch 32 Shortcuts vergeben muss, ist das vielleicht ein bisschen viel, aber irgendwann gehen an mir auch die Shortcuts aus, ne, deswegen werden wir auch noch einbauen, dass man einfach Bilder reinlegen kann, ohne Shortcuts, und die kann man dann halt über das Dashboard, was wir in einem der nächsten Streams programmieren werden, dann aufrufen vom zweiten Rechner aus, ist dann ganz praktisch, ich weiß jetzt nicht, hat jemand das Elgato Streamdeck, ich hab's jetzt nicht gesehen, so, dann fangen wir mal an, und wir haben aufgehört mit, genau, wir haben das letzte Mal rausgekriegt, dass es relativ einfach ist, das hat mir sogar jemand im Chat erzählt, ich wusste gar nicht, dass es das gibt, wer braucht schon 32 Memes, das ist sogar noch viel zu wenig, da muss da eigentlich noch viel mehr rein, aber das ist alles kein Ding, man kann sich dann nämlich die wichtigsten, kann man sich dann einfach auf irgendwelche Shortcuts legen, die man halt nicht so oft braucht, die man halt auch nicht aus versehen, während man ein Spiel drückt, du musst das nicht vom zweiten Rechner aus starten, du kannst es natürlich auch vom zweiten Monitor aufmachen, vom gleichen Rechner, geht natürlich auch, man kann es auch auf dem gleichen Monitor aufmachen, das ist aber ein bisschen schwierig, auf dem gleichen Monitor was zu spielen, plus das Dashboard zu bedienen, also wenn du das hinkriegst, kannst du das machen, das ist überhaupt kein Problem, das funktioniert, kannst du im Prinzip starten, wo du willst, das geht über das Netzwerk, du kannst das auch auf dem Tablet starten, wenn du mir das Programm ausführen kannst, aber ja. So und wir haben es jetzt mal herausgefunden, es ist relativ einfach, einen Ordner zu überwachen auf Änderungen, also sprich, ob hier Bilder unbenannt werden, ob hier Bilder hinzugefügt werden oder gelöscht werden, ich war mir das letzte Mal bloß nicht so ganz sicher, wie wir das jetzt gescheit einbauen, das ganze, was wir heute auch noch machen ist, wir machen, das machen wir als erstes, wir machen einen Tray-Icon, einen Tray-Icon, wo man das ausschalten kann, weil im Prinzip ist es ja so, dass ich jetzt hier eine Konsole habe, das ist ja nur zu Debug-Zwecken, die Konsole, das heißt in der Konsole kann ich zuklicken, aber normalerweise habe ich ja gar keine Konsole, das heißt ich habe nichts, wo ich das Programm ausmachen kann, und ein Programm, was man nicht ausmachen kann, ist vielleicht nicht die benutzerfreundlichste Sache, das heißt wir machen uns einen Tray-Icon, wenn man da rechts draufklickt und sagt exit, dann geht es aus, also auch nichts großartiges, kompliziert das, das machen wir zuerst, weil das ist simpel, zumindest glaube ich das, weil ich habe das in WPF noch nicht gemacht, WPF selbst hat keinen Tray-Icon, fragt mich nicht warum, Microsoft hat sich gedacht, ja das Tray-Icon gucke ich mir auch bei deinem Pull-Request ab, weil ich habe keine Ahnung, wie das funktioniert, aha, das Elgato-Ding kann OBS-Overlays, das wird aber auf dem Knopf angezeigt, ja da finde ich Mines dann noch viel besser, deine Stream Deck ist outdated, overrated, gebaited, meme board activated, so, dann machen wir das mal, gucken wir uns wirklich bei seinem Pull-Request ab, wie das mit dem Tray-Icon funktioniert, aber ich habe mal im Vorfeld schon geguckt, also das ist auch nicht sonderlich schwierig, wir müssen bloß gucken, was wir für einen Icon machen, genau das gibt es hier nämlich diese komische Tray-Icon Library, die nehmen wir dafür, die verwendet ihr hier glaube ich in seinem Pull-Request auch, ja, du kannst transparente PNGs overlayen mit GIFs und nicht transparente GIFs und halt Bilder, alle möglichen Bilder die du willst, also sprich du hast den Vorteil dadurch, du siehst die Dinger halt selbst und kannst die per Shortcut, das heißt du brauchst keine Software wo du Bilder anklickst oder sowas, kannst die per Shortcut dann overlayen, das ist halt für Streamer und Leute die Videos machen ganz praktisch, stell dir vor du spielst was und willst dann kurz, gehst in Deckung, hast voll auf den Sack gekriegt und willst hier mal das einblenden, das geht halt sonst nicht so einfach und das Schöne daran ist, du siehst das, das heißt du vergisst sie auch nicht auszumachen, ein weiterer Vorteil ist, es ist zwar ein eigenes Fenster aber das haben wir geschickt gefaked, man kann nämlich komplett durchklicken und das ist das geilste, das crappt auch beim aufmachen keinen Fokus, also sprich wenn ich jetzt hier im Hintergrund etwas spiele und das overlay an und aus mache, hat es überhaupt keine Auswirkungen drauf, das macht das. So und was wir heute machen ist, wir basteln Tray-Icon dafür, dass man das Programm natürlich auch mal an und ausschalten kann, was nicht schlecht ist und dass man automatisch Bilder und Memes hinzufügen kann und löschen kann während das läuft. Ach es ist Triggered, Triggered, eventuell wenn man das Numpad als Shortcut-Plattform nutzt, Umschaltbar-Aktionsleisten, ja sowas in der Richtung zum Beispiel, ja das ist keine schlechte Idee. Das finde ich ist eine super Idee, also Crypto84 wenn ich das richtig verstehe, meinst du man könnte das Numpad quasi für Shortcuts verwenden, dass man dann quasi sagt, man belegt halt seine Bilder mit Numpad 0-9 und dann hat man mehrere Ebenen, sprich wenn man plus auf Numpad drückt, dann schaltet es in Profil 2 und in Profil 2 sind dann 0-9 und wieder andere Bilder, das muss ich mir mal aufschreiben, Profiles, das finde ich sehr nice, das ist sehr praktisch, das finde ich gut, das finde ich cool, da bräuchte man auch irgendwie so eine, das war richtig BigBrain, da bräuchte man auch irgendwie so eine Anzeige, was das, in welchem Profil man ist, das kann man theoretisch auch einfach im Tray anzeigen oder so, oder man hat, ah übrigens noch eine Sache, die ich mir überlegt habe, was wir machen können, ich habe was gefunden, auf GitHub, zeige ich euch mal, ich habe hier so eine special RGB-Tastatur und ich glaube das ist eine richtig coole Funktion für Leute, die auch sowas haben, also ich habe hier dieses bunte Teil, so und da kann man einstellen, dass einzelne, einzelne Tasten leuchten, so und ich habe mir gedacht, ich habe hier nämlich was gefunden, und zwar gibt es eine, gibt es eine.net Library, um die RGB-Beleuchtung von Corsair-Tastaturen zu steuern, das heißt, man könnte jetzt das verbinden mit dem, was Chris84 geschrieben hat, man, man zeigt einfach an, welches Profil aktiv ist mit RGB-Beleuchtung, das ist dann quasi, das ist dann richtig Trick 17, ja genau, Ex-Shadow-Ghost, so werde ich es wahrscheinlich auch machen, Pop-Up will ich nicht machen, weil es geht ja darum, dass man den Cremple verwenden kann, ohne dass es Einfluss auf das Game hat, was man spielt, und so ein Pop-Up geht dann richtig auf den Sack, Tray-Anzeige kann die Ebene, also ich würde sagen, die Tray-Anzeige zeigt an 1, 2, 3, 4, 5 oder irgendwie sowas, mal gucken, mal gucken, wie man das, wie man überhaupt ein Tray macht, und wenn man eine RGB-Tastatur hat, kann man sich das dann quasi auch noch, da wird dann einfach das Numpad, wird dann, keine Ahnung, blau, grün oder rot, dann weißt du, welche Ebene du hast, und für die Leute, die es richtig advanced wollen, unter 32 Memes drin haben, die können sich dann einfach auch auf dem zweiten Monitor oder auf dem zweiten Rechner über das Netzwerk das Dashboard installieren, was man das nächste Mal bastelt, wo man dann einfach draufklicken kann, und die Bilder aktivieren kann, oder auch Bilder aktivieren kann, die kein Shortcut haben, das finde ich nice, sehr, sehr nice, so, wir machen jetzt mal ein Tray-Icon, das kann ja nicht allzu schwer sein, die Musik, die Musik ist richtig monochrisch gerade, so, wie verwenden wir das Ding, wir copy-pasten es einfach mal, vorher müssen wir das Ding natürlich noch importieren, oder es leuchtet einfach die Zahl auf dem Numpad entsprechend der Ebene, oh, das ist auch, das ist, das ist auch eine coole Idee, dass dann quasi 1, 2, 3, 4, oh, das ist auch cool, siehste, siehste, Big-Prain-Chat, ich hab Biggest-Prain, 900 IQ-Chat haben wir hier, ich schreibe mir das mal auf, mach das Memboard als Abo-Modell, ne, ne, ich, ich mach meine Heizungs-App, die Bitcoins meint, ich hab das auch ein bisschen ausgebaut, die Idee schon von der Android-App, die werden wir dann auch hier irgendwann programmieren und streamen, aber in der Android-App, die, also die Heizungs-App, die verkaufen wir als Heizungs-App, wo die Leute sich im Winter die Hände dran werben können und um Hitze zu generieren, meinen wir Krypto-Werbung da drauf und das wird dann dazu führen, dass wir super Bewertungen im App-Store kriegen, weil wir bieten das kostenlos an, ohne Werbung und die App macht das, was sie soll, sie heizt das Smartphone auf, d.h. die Leute freuen sich, weil sie das genau kriegen, was sie wollen und wir meinen auf den Smartphones Krypto-Werbung und alle finden es geil, so machen wir das und man kann natürlich dann auch für alle noch ein bisschen was einbauen in diese App, z.B. kann man dann schön, z.B. könnte man dann schön animierten Kamin einbauen, den man dann quasi per Microtransactions upgraden kann, unterschiedliche Knister-Sounds oder sowas und um die Sache dann auch auf die Spitze zu treiben, kann man dann natürlich auch noch verschiedene Knister-Sounds und Kamin-Skins, verschiedene Feuerfarben, verschiedene Tageslicht-Farben und so kann man sich dann auch aus Lootboxen oder aus Kaminboxen, was auch immer holen, kommt dann der Schornstein-Figur vorbei und bringt das und die kann man aber nicht aufmachen, die kann man nur mit Schlüsseln aufmachen und jetzt kommt wieder Big Brain, der Bogen zum eigentlichen, wir wollen ja Krypto-Werbung meinen, die Schlüssel für diese Boxen kriegt man nur durch Laufzeit der App, also sprich auch wenn die Leute sich nicht ihre Hände wehren müssen, lassen sie die App trotzdem an, weil sie ja Schlüssel-Drops haben wollen für die Boxen, die sie umsonst kriegen, ja so machen wir das und dann wären wir reich damit, was sagt ihr dazu, klingt das gut, das machen wir so, das brauchen wir glaube ich, so was in der Richtung, das ist richtig Big Brain, das dürfen wir aber nicht erzählen, weil sonst hat Ubisoft demnächst sowas, EA glaube ich, Ubisoft hat sowas dann und die verstehen das Konzept dann nicht und bauen Türme ein, wo man raufklettern muss, was, ja ja ist schön, ja dass euch die Idee gefällt war klar, ok jetzt haben wir den Krempel hier eingebaut, jetzt kann man, wir copypasten das jetzt einfach mal hier, gucken wir wie das funktioniert, Tray-Icon, Moment, Source, Source kaputt, Beams 2, Lull, das heißt ja auch Lull, L, Lull, heißt ja auch, so, übrigens der Anteil von Code zu restlichen Fenster ist mal wieder absolut erstaunlich hier, so, jetzt müssen wir das Tray-Icon mal hier irgendwie reinhauen, so, das machen wir erstmal, also ganzen Events weg, jetzt gucken wir mal, ob das funktioniert, dann kriegen wir jetzt wahrscheinlich erstmal ein leeres Tray-Icon, hier unten, so, was nichts macht, Fallback für Windows XP brauchen wir nicht, Windows XP in 2k18, das ist ja, das ist nicht mal Lull, das ist Omega-Lull, so, 3, Tray-Icon visible, bla bla bla, so, geht nicht, warum geht das nicht, achso, ha, weil mir jetzt nur einmal Content geben darf, ach ne, ich hab die Namespace vergessen, ja ich bin ja auch so ein alter GPF-Pro, kein Wunder, dass das nicht geht, funktioniert jetzt nicht, weil jetzt ist Content doppeldefiniert, ne, genau, das heißt da machen wir jetzt mal irgendwie einen Stack-Panel, bo, was hab ich hier gemacht, so, zack, so, zurück, wenigstens rückt Twizzle Studio das Zeug immer schick ein, so, gucken wir mal, ob ich jetzt einen Task-Icon kriege, ah, da ist es, guckt hier, da ist es, Poggers, ein leeres Tray-Icon, was nichts tut, was nichts macht, es geht kein Popup auf oder sonst was, aber es ist da und das ist das wichtigste, so, ähm, wie kriegen wir denn da jetzt ein Menü rein, das guck ich mir jetzt mal ab hier, wie er das gemacht hat, wie hat er das gemacht, aha, Kontext-Menü, da ist es doch, Kontext-Menü, ja, so machen wir das, warum macht GitHub, warum, warum, lassen die mich nicht Copy-Pasten ohne den Schmodder hier vorne dran, warum, was ist das, ja, so machen wir das. So, ähm, so, jetzt kopieren wir den Krempel mal hier rein, wie geht das jetzt, ja, so, jetzt kopieren wir den Krempel mal hier rein, wie geht das jetzt, ähm, das muss man wahrscheinlich erstmal so machen und das hier irgendwie rein kopieren, ha, ne, ok, so geht das schonmal nicht, wie hat er das denn gemacht, ah, da bindet das irgendwie, das ist ja, das ist mir zu hoch, ich hab von XAML und WPF keine Ahnung, das ist mir zu hoch, man kann das doch garantiert hier auch irgendwie, irgendwie reinschreiben, so inline, was gibt's denn da so zu auswahlen, gibt's da irgendwie ein Menü, ha, Kontext-Menü, bam, jetzt machen wir das da rein und jetzt geht's, oder auch nicht, ok, das Zeug machen wir hier mal alles weg, also auch wenn es vielleicht so aussieht oder den Anschein erweckt, also WPF-Technik hab ich nicht so wirklich Ahnung, was ich mache, aber dafür funktioniert's erstaunlich gut, so, machen wir den Krempel mal weg, wir wollen eigentlich bloß so was haben, header, irgendwie exit, ganz, ganz billig und dann wollen wir das auch nicht über Commands machen, sondern wir machen das richtig oldschool Windows-Form-Style, sondern wir machen Click-Event, das meinetwegen, dann heißt es halt Menü-Item-Click, wobei das nennen wir, das benennen wir um, das ist dumm, Menü-Item-Click, wo ist es denn, Menü-Item-Click, Menü-Item-Click nennen wir um in J-Exit, so, und wenn das geklärt, jetzt gucken wir erstmal, ob das funktioniert, ja, funktioniert, auch wenn es mit Link am Ausschuss ein bisschen leckt, aber ok, aber es exited noch nicht, das ist natürlich blöd, aber das lässt sich ja einfach beheben, oh, raus, und dann geht es zu, wenn ich auf exit drücke, ah, exit, bam, weg ist es, wunderbar, jetzt brauchen wir noch, jetzt brauchen wir noch ein Icon, was wir nehmen, weil so ein leeres Icon ist doof, das ist halt leer, jetzt haben wir eine schizze Auswahl, oh, wir wollen auf alle Clicks reagieren, ja, wunderbar, jetzt brauchen wir noch ein cooles Keksbild für den Tray, Keks oder Dance Game, Link, nein, wir können Trays unterstützen, glaube ich, keine Animationen, das wäre zu kompliziert für Microsoft, Keks, ok, dann machen wir jetzt hier, ne, den da nicht, schon den normalen Keks, nicht den Weihnachtskeks, den da, den nehmen wir jetzt, ist das auch die transparente Variante, oh man, ist das die transparente Variante, das ist die transparente Variante, guck mal, soweit sind wir schon, ich muss mir meinen eigenen Avatar im Internet herunterladen, lol, so, Desktop, mein Vater hat immer gesagt, der wusste nicht, dass man Desktop, Desktop ausspricht, er hat immer gesagt, Descope, ich packe mir das jetzt auf Descope, ich mache das auf Descope, ich habe das jetzt auf Descope abgelegt, so, so, und wie macht man daraus jetzt ein Icon-File, weil Windows, weil Windows ist ja so fortschrittlich und erlaubt hier unten keine ordentlichen Bildformate, sondern das muss in Icon-Format sein, Convert, PNG, Icon, das war klar, dass es da ein Online-Convert dafür gibt, also wir haben zur Auswahl Convert, Ico oder Ico Convert, tja, nehmen wir mal das erste, easy, das sieht aus wie irgendeine Seite, wo ich mir ein Virus einfange, wenn ich es runter lade, ich muss mal gucken, nee, go, Upload, so, Upload, wollen die mich verarschen, File was 502 Kilobyte, so, und jetzt Upload Max 2 MB each, der widerspricht sich ein bisschen, was denn du, 500 KB oder 2 MB, Kackseite, sucked, was ist das, nächste, das sieht besser aus, man könnte auch mal gucken, wie man den Scheiß selbst konvertiert, aber warum, warum selbst konvertieren, wenn man doch einfach irgendwelche Online-Services verwenden kann, so, Upload, bam, nein, ich will das, wow, was ist das, kann das croppen, ok, dann croppen wir das noch, oder auch nicht, ok, wir croppen das nicht, das lässt sich nicht croppen, ich schalte, sucked, alter, drop, wer hat sich das wieder ausgedacht, die Bedienung von der Seite ist echt abenteuerlich, so, Styles, wat, ok, wir bauen das als Icon für Windows 7, meinetwegen, Multisize in one Icon, nee, so, 690 x 6, ach nee, Icon, ach du Scheiße, das kompliziert gemacht, convert, wie siehts mit einer VR, mal gucken, was ich mir jetzt hier runter lade, ach nee, es funktioniert, ok, der Windows Betrachter, der Windows Bilder Betrachter ist anscheinend nicht in der Lage das zu öffnen, ok, da haben wirs, bilden wir erstmal um, in, ach immer, Meme, Board, Icon, so, und dann direkt dropen wir das hier rein und versuchen das mal hinzuzufügen, da bin ich mal gespannt ob das klappt, wo ist es denn, da, mal gucken ob das funktioniert, Icon Source, Board Punkt Ico, ich bin ja gespannt ob das tut jetzt, mal richtig einrücken alles, hey, guck mal, es klappt, Poggers, Poggers, ich hab hier eine Lade, oh da ist es, wir haben einen Keks als Trey Icon und können das exiten, so muss das sein, eats as fuck, Koggers schon, ja genau, sowieso wieder sehbar war das als easy clap Koggers, so, das war jetzt ja nicht sonderlich schwer, also muss man sagen das Teufel funktioniert, sehr schön, ich mag Libraries die einfach, die ein schönes Beispiel haben dabei und was dann auch einfach funktioniert, das ist schick, das ist wirklich easy, ok, weiter im Text, wir haben den Trey Icon und können exiten, das heißt wir können jetzt anfangen mit der eigentliche Sache die wir heute machen wollten, das Lick E-Mode scheint euch zu gefallen oder, oh mein geht das Soundtrack grad wieder von vorne los, das ist das Main Theme quasi, ok, was auch immer hier changed machen soll, keine Ahnung, das schmeißen wir mal raus, das brauchen wir nicht, das schmeißen wir auch raus, das schmeißen wir auch raus, also ich hab mir ein bisschen Gedanken dazu gemacht, aktuell ist es ja so, wir laden das einmal statisch, also sprich wenn ich das Programm starte, dann lädt das einmal alle Bilder und merkt sich das und fertig, das heißt wenn ich ein Bild hier lösche, wird es abkacken wenn ich versuch anzuzeigen und wenn ich ein neues Bild reinziehe, dann wird es nicht mitkriegen dass es da ist, das ist natürlich blöd, deswegen tauschen wir diesen Campbell den wir jetzt das letzte Mal gebastelt haben hier, dass es sich quasi das einmal statisch lädt am Anfang, übrigens das müssen wir auch noch dynamisch machen den Fahrt, da ist mir noch nichts gescheites zu eingefallen wie ich das ohne Config Datei irgendwie, keine Ahnung, weil ich will eigentlich keine Config Datei haben, so, aktuell laden wir das hier einfach und schreiben es hier rein und arbeiten dann permanent halt mit dieser statischen Liste von Bildchen, bzw. eigentlich ist es keine statische Liste von Bildchen, sondern es ist eine Liste halt mit dieser Meme Klasse wo dann drinnen steht wo das Bild liegt, welches Shortcut es bekommen soll das Bild und halt ob es ein GIF ist oder nicht, Relativer Fahrt zu Exe, das ist eine gute Idee, das gefällt mir, hallo, howdy, das gefällt mir, das ist eine gute Idee, genau, dann machen wir Relativer Fahrt und man muss es halt einfach neben das Programm legen, das ist ja kein Ding, so und ich habe mir überlegt wir machen das folgendermaßen, wir nehmen diesen File System Watcher, sagen dem, beobachte dieses Verzeichnis und immer wenn du feststellst, dass sich das was hinzugefügt wurde, unbenannt wurde oder gelöscht wurde, dann updaten wir diese Liste, so nachdem, da fängt es aber schon an ein bisschen problematisch zu werden, denn Leute die schon ein bisschen was mit Multisoldin gemacht haben, denen ist das wahrscheinlich sofort klar, dass es keine gute Idee ist, aber ich versuche das mal noch ein bisschen auszuführen warum das keine gute Idee ist so zu machen, weil das ist ein Fehler in den jeder früher oder später läuft und sich fragt warum geht denn das nicht, also wenn ich jetzt im Hintergrund was habe, was guckt, ob sich hier drin etwas aktualisiert und sobald sich etwas aktualisiert, dann hier in meiner UI was ändere, dann hast du ein Problem, nämlich dass die Oberfläche, also im Endeffekt das unsichtbare Fenster, wo das Bild angezeigt wird, die Oberfläche läuft in einem eigenen Thread und das hier, was im Hintergrund den Ordner überwacht läuft in einem eigenen Thread, so und dann kann es natürlich passieren, dass ich Sachen mache, die halt nicht parallel funktionieren, zum Beispiel das Bild wird unbenannt und ich versuche es anzuzeigen oder aber ich lese die Liste hier gerade aus, während ich sie update und der Index den ich ausgelesen habe ist danach was anderes, also das ist keine gute Idee auf jeden Fall, also quasi auf UI Elemente zuzugreifen, auch von einem anderen Thread aus ist selten eine gute Idee. Es gibt Frameworks, ich glaube in Qt ist es so, das verbietet das prinzipiell, wenn ich da versuche von irgendeinem anderen Thread außer dem UI Thread darauf zuzugreifen, dann gibt es einen Fehler und es kackt ab, ich glaube WPF macht es auch so, bin ich mir aber nicht sicher, wie man das ganze umgehen kann ist, man muss beim updaten sagen, dass er das nicht in dem Thread machen soll, der läuft wo er das Verzeichnis überwacht, sondern in die Eventwarteschlange werfen soll für den UI Thread, dann funktioniert das und das macht man folgendermaßen und ja auch wenn es, Tommy schreibt es gerade, WPF würde abkacken wenn ich das mache, andere Sachen, die haben den Check halt nicht, die kacken nicht ab, die haben dann bloß ganz merkwürdige Fehler oftmals, also man muss aufpassen, also immer wenn man quasi von mehreren Sätzen auf einen Speicherbereich irgendwie drauf zugreift und vor allem wenn man von mehreren Stellen aus diesen Speicherbereich ändern kann, also wenn man den ändert von verschiedenen Stellen ist meistens das Problem, also an einer Stelle schreiben und an mehreren Stellen lesen, wenn man da ein bisschen aufpasst gibt es eigentlich kaum Probleme, aber spätestens wenn man von mehreren Stellen ausschreibt, was jetzt hier nicht der Fall ist, aber dann gibt es definitiv Probleme, da muss man sich was überlegen und selbst hier kann es Probleme geben, wenn ich im Hintergrund quasi diese Liste ändere und quasi gerade hier im Vordergrund irgendwas updatet, drauf zugreife oder sonst was in der Richtung ist, ich meine es ist im Prinzip ja auch ganz logisch, wenn ich jetzt sage gib mir Element 5, also in diesem Thread, in meinem UI Thread würde ich sagen gib mir Element 5 aus der Liste, während gerade im Hintergrund das Ding erkennt, oh es gibt ein neues Bild, pusht das rein und auf einmal ist Element 5 nicht mehr Element 5, sondern keine Ahnung Element 4 oder Element 8 oder irgendwie ist ja egal, also man sieht es gibt, kann auf jeden Fall immer Probleme geben, sobald ihr da mit mehreren Stellen rumwurstet, so die einfachste Variante, dass WPF zumindest nicht meckert ist wenn man sagt, wenn man eben quasi sagt hier, wow wow der Soundtrack, ja ronkar ist, als käme jetzt hier gerade die ultraepische Ansage, nicht Credo, hi, aber wenn man das hiermit macht kann man eben quasi sagen, mach das nicht in dem ursprünglichen Thread, sondern mach das in dem Thread von dem GUI, so aber jetzt müssen wir natürlich erstmal basteln, dass diese Ordner über Wachung im Hintergrund überhaupt richtig funktioniert, so und das letzte Mal, aber ich bin nicht ganz sicher wo wir das hinschreiben, weil hier in dieser Klasse hat das eigentlich überhaupt nichts verloren und wir machen uns, warte mal ich muss mal den Soundtrack eben ein bisschen leiser machen, zu der Musik fällt mir eigentlich gerade nur das hier ein, wozu das Add vor dem Fahrt, das Add sorgt dafür, dass da hier nichts escapt, guck wenn ich das Add weg, woops, what the fuck, was hab ich jetzt gedrückt, wenn ich das Add weg mache, dann sind die Backslashes Escape Zeichen, man sagt ja auch hier, aber Backslash U ist keine Escape Sequenz, ich könnte alternativ auch jeden Backslash doppelt escapten, aber nachdem ich da, das ist das gleiche im Endeffekt, aber nachdem ich da keinen Bock drauf hab, mach ich einfach ein Add davor, hallo da Woodface, ja Backslash kann man auch machen, Flo 690, aber mit Add ist das angenehmer und ich hab im Hinterkopf, dass es irgendwie, sei es C-Sharp 7 noch eine dritte Variante gibt, wie man das schreiben kann, hab ich irgendwo mal gelesen, so fangen wir mal an, also was wir auf jeden Fall nicht mal machen wollen ist, statisch das einmal am Anfang zu laden und nicht mehr zu updaten, das heißt mit der internen Liste in unserem UI, in unserer Fensterklasse bringt das das ganze schon mal nicht, was wird das für ein Tool, du hast es gerade gesehen, guck mal, kannst Overlayen, Bilder Overlayen und GIFs, transparente PNGs und GIFs, wobei es müssen nicht mehr transparente PNGs sein, also Bilder und GIFs, Format ist fast burscht, außer wenn es animiert ist, muss es halt ein GIF sein, so also mit einmaligen Liste laden am Anfang ist es nicht getan und ihr habt mir gedacht, wir lagern das aus in irgendwie in so eine eigene Klasse, die dafür zuständig ist, wir machen das mal ganz korrekt, wir machen da eine eigene Datei, ich bin mir nicht ganz sicher, wie wir das nennen sollen das ganze, wir machen mal so ein bisschen 0815 Standard Benamung, die man immer schön nehmen kann, wenn ab sonst nichts einfällt, wenn man irgendeine Sammlung hat, es gibt eigentlich zwei Varianten, wenn man eine Sammlung hat von Elementen, dann macht man entweder was, was sich sowas wie, das ist auch in dem einen Pull Request drin, was sich sowas wie meme Collection nennt, was dann im Hintergrund irgendwelche Dinger macht, wobei Collection heißt eigentlich für denjenigen, der es liest, dass es halt im Prinzip mehr oder weniger ja eigentlich sowas wie eine Liste ist, ja eine Liste, wo du dann eine Schleife drum machen kannst und sonst was, so und das zweite Ding, was sich so eingebürgert hat, wenn man eine Sammlung oder ne, ne, das ist keine Sammlung, das heißt eine Ansammlung von Objekten hat, die man dann quasi auch mal rausgeben will und man durchlaufen kann und sowas, dass man sowas macht wie ein, da stehen die Java Programmierer übrigens mega drauf, normal meme repo machts, also Java Programmierer stehen unglaublich auf Klassen, die Manager heißen, die Factory heißen und die Repository heißen, wenn ich es richtig schreiben könnte, da stehen, ich weiß nicht genau warum ehrlich gesagt, aber jedes mal, wenn ich mir irgendwie Java Source Code angucken muss, da besteht die Hälfte aus Sachen, die Manager Factory Repository heißen und das nimmt dann ganz abstruse Ausmaße an, dass es dann in Java den, die Manager Factory of Repository Manager Factories oder sowas gibt, dann hast du teilweise in Java solche Klassen, die über einen halben Bildschirm gehen, die macht dann zwei Zeilen oder so, da stehen die Java Leute halt drauf, so und das Ding ist jetzt dafür zuständig, dass wir im Hinter, dass wir den Ordner überwachen und halt eben Sachen, Änderungen erkennen plus, dass er immer eine aktuelle Liste zur Verfügung stellt von zur Zeit aktuellen Objekten, also von aktuellen Bildern, so wie es gerade ist, also das heißt, ich muss auch gucken, ob der EJX mittlerweile da ist, der ist auch nicht da, das heißt wir brauchen auf jeden Fall sowas, was wir auf jeden Fall brauchen, weil sowas haben wir hier ja auch drinne, wir brauchen immer eine aktuelle Liste mit allen gültigen Meme Bildchen, die brauchen wir, dass wir sie anzeigen können, das ist ja der Kern, das ganze, also das heißt wir brauchen auf jeden Fall irgendwie mal die Möglichkeit da eine immer aktuelle Meme Liste raus zu holen aus der ganzen Sache, so und nachdem wir jetzt ja sicherstellen wollen, dass die Liste, die wir rausgeben, nicht dazu führt, dass irgendwie unsere interne Struktur, die wir haben, unsere interne Ordnung irgendwie kaputt gemacht werden kann, müssen wir sicherstellen, dass das was hier rausgegeben wird eigentlich nur eine Kopie ist von unserer internen Liste, die noch nicht mal so aussieht wie unsere interne Liste mit allen Meme Bildchen drinne, sondern einfach nur dazu da ist, dass man eben eine aktuelle Auflistung bekommt. Was ist da, eins, drei, drei, sieben, what the fuck, krieg ich Lied alle hier, so das heißt wir brauchen noch Private, wir brauchen auch intern irgendeine Struktur, wo wir dann die tatsächliche Zuordnung drinne speichern und dazu werden wir, hab ich mir überlegt, dazu nehmen wir ein Dictionary und zwar ein Dictionary aus String und dem jeweiligen Memeobjekt, String ist der Filename, ja also das hier, das bietet sich in dem Fall an, weil den kann es tatsächlich nur einmal geben und nachdem wir den Filename immer brauchen um zu gucken, ob das da ist oder ob es sich geändert hat oder ob es gelöscht wurde, ist das eine super Sache für einen Key, da finden wir es auch schnell und müssen nicht immer die Liste durchsuchen. Was bei 32 Memes im Prinzip scheiß egal ist, 32 Dinge hat es in ein paar Nanosekunden wahrscheinlich durchsucht, so und das Ding nennen wir dann einfach auch klein, nur für internen Gebrauch. So und wie ich hier schon gesagt hab, die Liste, die wir rausgeben, die sollte eigentlich im Prinzip immer nur eine Kopie sein von unserer internen Liste, was meckert der hier eigentlich, nicht only, immer nur eine Kopie von unserer internen Liste, weil wenn wir jetzt quasi unsere interne Liste, das ist das Dictionary hier, wo wir uns hier die Zuordnungen speichern, so Dateiname zu Memebild und sowas, wenn wir das rausgeben, dann könnte einfach irgendjemand dann sagen, blablabla repo, Memes, clear und dann ist alles weg, sprich da macht er quasi unsere internen Ordnungen in der Klasse kaputt, deswegen müssen wir sicherstellen, dass wir im Prinzip nur eine Kopie davon rausgeben. Da machen wir sowas, das ist jetzt neu, das kann man seit C Sharp 7 kann man das machen, und zwar gibt es da so eine, euer Property Syntax, kann man quasi direkt sagen, ich leite das quasi auf einen Funktionsaufruf um, dann ist gut und dann kopieren wir uns einfach alle Werte in den Array und geben das dann als Kopie raus, ich hoffe das macht eine Kopie, aber muss es ja, ich mein wir brauchen von den Memes keine Kopie, wir brauchen einfach eine neue Collection, die nicht unsere Diction, ja das passt so, das muss so gehen, genau und jetzt kann ich das verwenden, extra, also von außen und ich mach hier nicht meine interne Collection kaputt, oder kann ich nicht kaputt machen, so, das bringen wir uns allerdings noch nicht allzu viel, jetzt müssen wir erstmal einen Konstruktor anlegen und wir brauchen natürlich einen Pfad, nämlich den Pfad von dem Verzeichnis, den wir überwachen wollen, anders funktioniert das ganze nicht, so, dann brauchen wir noch einen Private File System Watcher, der heißt dann einfach mal Cal Watcher, New, so, das will er wahrscheinlich wieder Read-Only machen, nein wir können gerne Read-Only machen, so, dem sagen wir jetzt, dass er das übergebende Verzeichnis überwachen soll, wir interessieren uns für Dateien, die erstellt werden, Dateien die unbenannt werden und Dateien die gelöscht werden, hier drinnen, also es kann ja sein, dass ich ein Bild unbenenne, dann muss ich hier im Zweifelsfall die Shortcuts noch einlesen, es kann sein, dass ich ein neues Bild reinkopiere, es kann sein, dass ich eins lösche, dann muss es weg, und dann wollen wir die Überwachung einschalten, so, dann brauchen wir noch eine Funktion, die das ganze macht, so, da werden die Argumente jetzt nicht passen denke ich mal, das heißt wir brauchen dann, und was war das, Event, File Event Arcs oder sowas, File System Event Arcs, genau, wunderbar, so, jetzt probieren wir mal ob das prinzipiell funktioniert, Test, nein machen wir irgendwie File Changed, einfach mal kurz gucken ob das funktioniert, was wir hier fabriziert haben, so, und das sollte jetzt ausspucken wenn ich starte, sollte das ausspucken wenn ich irgendwie was hier an den Bildern ändere oder unbenenne oder was auch immer, sollte das jetzt was ausgehen, probieren wir das mal aus, erstmal muss ich das Ding noch laden, das sind hier meine Load Window, das ist ja nur testweise, Fahrt ist dann der da, so, jo das wars, ok gucken wir mal ob das klappt, so, benennen wir das mal um, wow, ach nee, das ist ja schon geöffnet, also Bild was ich grad drauf zugreife kann ich natürlich nicht unbenennen, benennen wir mal Poggers um, wow, hat funktioniert, ich hab es aus Versehen gelöscht, aber er hat es mitgekriegt dass ich es gelöscht habe, und er hat auch wieder mitgekriegt wenn es Created wird, ok, das funktioniert prinzipiell, das ist schon mal gut, sehr, sehr nice, Musik ist vorbei, so, das klappt, das heißt ich kriege jetzt mit, wenn sich hier Bilder drinne ändern, gut, jetzt kann ich noch auswerten, jetzt muss ich ja je nachdem was genau passiert, muss ich da unterschiedlich drauf reagieren, so, juckt mich net, changed juckt mich auch net, mich juckt plus Created, Deleted und Renamed bei den Bildern, so, wenn was Created wird ist das relativ einfach, dann will ich das hinzufügen, dann ist es neu, da muss ich keine Sperenzien machen, einfach hinzufügen und gut ist, fertig, so, wenn es gelöscht wird muss ich eigentlich auch keine große Aktion machen, sondern, und deswegen habe ich hier oben auch als Key den Pfeil, den Dateinamen genommen, weil das ist das eindeutigste an so einem Bild, und jetzt muss ich das löschen, das ist auch einfach, ein bisschen komplizierter wird jetzt wahrscheinlich Renamed, weil bei Renamed muss ich quasi das alte Bild hier oben draus entfernen und das neue Bild mit dem neuen Namen dazu hängen, der Desmond hat eine Frage, ist vielleicht ziemlich doof, aber ist mir gerade wieder auffallend, wofür genau steht das E-Punkt, ach das da, meinste hier, na mit dem Punkt greifste auf die Methoden von dem Objekt zu, das Ding hat bestimmt auch irgendeinen Namen, wahrscheinlich irgendwie Referenzoperator oder so was, ich weiß gar nicht wie das Ding genau heißt, in C++ machst du so, was aus irgendwelchen Gründen, die es sogar angibt, als Vervollständigung, aber das funktioniert nicht. Wir sagen jetzt ja, wenn der File System Watcher erkennt, dass sich das Bild ändert, soll er in dem Fall, dass das Bild quasi erstellt wurde, diese Funktion aufrufen, und übergeben quasi, wer das Event ausgelöst hat und was sich geändert hat. Genau in dem Fall ist E ein File System Event. So sieht es aus. Und E Punkt Changed ist halt, deswegen da ist Visual Studio ganz praktisch, weil es hier zu allem was anzeigt. E Punkt Changed, also Changed sagt ihr halt in dem Fall, zeigt ihr an was sich genau geändert hat. Dementsprechend können wir auch gucken, wenn wir einen Switch auf diesen Typ machen, können wir dann quasi gucken, wenn eben E Punkt Changed Created ist, dann machen wir das, wenn es Deleted ist, dann machen wir das, wenn es Renamed ist, dann machen wir das. Jetzt habe ich es verschoben. Kein BDO mehr, doch ich hole noch Daily Rewards. Oh, Press of the Wild Musik, ich weiß nicht. Ich muss euch ja sagen, so gut ich Press of the Wild fand, der Soundtrack hat mir nicht gefallen. Der Soundtrack hat mir nicht gefallen, der war mir zu minimalistisch. Und ja, ich weiß, dass das Absicht ist, aber es hat mir trotzdem nicht gefallen. So, wie machen wir jetzt Renamed, was haben wir denn zur Auswahl? Moment, da muss ich mal nachgucken. Ha, ja, wusste ich doch. Genau, das war nämlich nicht das. Stimmt, das war das einzige, Renamed war das einzige Event, was andere Event-Arcs übergeben hat. Aber das können wir schön machen, wir können nämlich einfach sagen, das ist jetzt auch neu, seit C Sharp 7. Also wir wissen jetzt, dass es immer im Prinzip ein Filesystem Event-Arc Objekt gibt hier, bei einem Update von diesem Ordner. Außer bei Renamed gibt es einen Renamed Event-Arcs. Allerdings ist Renamed Event-Arcs abgeleitet von Filesystem Event-Arcs. Das heißt, wir können ein schönes neues C Sharp 7 Feature verwenden. Und zwar kann man das inline jetzt, wie nennen sie das, Pattern matchen. Also man kann quasi sagen, ok, wenn jetzt der Change Typ Renamed ist, dann ist das hier kein Filesystem Event-Arc, sondern das ist ein Renamed Event-Arc, das nennen wir mal R. Also der castet das im Endeffekt, also ne, was heißt der castet das, der guckt, ob der Typ von E Renamed Event-Arcs ist, und castet das quasi dann für mich schon. Und mit R habe ich dann quasi das auf Renamed Event-Arcs gecastete Filesystem Event-Arcs. Das ist ein bisschen schöner inline. Und wenn ich jetzt hier reingucke, sehe ich auch, ich habe mehr Sachen, nämlich bei einem Renamed Event, bei einem Renamed Event brauche ich nämlich den alten Namen und den alten Fahrt und den neuen Fahrt. Sonst geht es logischerweise nicht. So, und deswegen kann ich jetzt hier sagen, bisschen lauter. Stfu. Ja, ich nehme hier, was Invisible Darkness geschickt hat. Das ist ein schöner Soundtrack. So, ähm, remove. So, wenn die Datei entfernt wurde, müssen wir im Prinzip den alten Namen löschen, den neuen Namen hinzufügen. Im Prinzip das und das hier zusammen. Das heißt, wir wollen jetzt erstmal den alten entfernen und den neuen hinzufügen. Das kann man bestimmt irgendwie schöner machen, aber das muss ich jetzt erstmal tun. So. Ach, Quatsch. So. Wie wäre es denn mit der Metal Gear Rising Revengeance Ost als Hintergrundmusik? Können wir das auch nochmal. Aber ich glaube, so lange brauchen wir heute nicht. Ich zeige dir, was das macht. Marcilein. Und zwar, ich hoffe, es läuft gerade, weil wir haben rumgebastelt. Es zeigt dir Bilder als Overlay. Allerdings hast du halt Tastatur-Shortcuts. Also wenn ich jetzt Steuerung M einmal drücke, gibt es eine Runde MonkaS. Wenn ich Steuerung M nochmal drücke, ist es wieder weg. Drück ich L, ist LUL, drück ich 3, ist LUL 3D, drück ich 1. Und passend für den EA Livestream haben wir extra noch das eingefügt. Das kannst du damit machen. Transparente Overlays über allen anderen Anwendungen einplanten. Und das ist halt auch wirklich Overlay, du kannst durchklicken. Was wir jetzt gerade programmieren ist, dass du während das läuft auch Bilder hinzufügen kannst und löschen kannst, ohne das Ganze neu starten zu müssen. Sieht man das selbst auch oder nur das Stream? Das sieht man selbst auch. Das ist gerade der Witz daran, weil OBS kann das zwar auch. Und Elgatos Stream Deck und so können das auch. Aber dort sieht man nur im Stream die Bilder. Das heißt, man sieht die selbst nicht. Und ich habe nach einem Tool gesucht, wo man die Bilder selbst sieht. Weil, stellt euch mal vor, man macht im OBS, definiert man sich einen Shortcut für LUL. Dann blendet man das einmal ein, man sieht es selber nicht, man hat keine Ahnung, dass es an ist. Und das Stream muss ich 10 Minuten LUL im Fullscreen angucken. Und natürlich kannst du ja auch die ganzen Bilder definieren, was du halt, die Shortcuts kannst du dir halt selbst definieren, je nachdem, wie du das Bild nennst. Wenn du also sprichst, wenn du das Bild F4 Gaben Scary nennst, oder wichtig ist, dass das Bild halt F4 Unterstrich heißt, dann drückst du jetzt Steuerung F4 und dann ist der Gaben am Start. Der schlecht freigestellte Gaben wohlgemerkt ist am Start. Was hältst du von einer Soundboard-Funktion? Na, das sind Sachen, die man in Zukunft vielleicht mal einbauen kann. Aber das ist keine schlechte Idee. Also, ich denke mal, Otsaru, die Frage ist auch jetzt beantwortet damit. Ich hab's ja gerade mehr oder weniger schon gezeigt, bevor ich das gelesen hab von dir. Was passiert, wenn man zwei Bilder mit der gleichen Taste übernacht? Das ist eine gute Frage, dann kackts ab. Das haben wir noch nicht behandelt, den Fehler. Aber das machen wir noch. Das kackt ab mit, wie hieß das, Key Already In Use. Kackts ab, wenn du versuchst, den gleichen Shortcut zweimal zu registrieren. Und es funktioniert auch nicht, wenn du Shortcuts verwendest, die schon Windows verwendet. Das geht nicht. Also sprich, wenn du jetzt irgendwie Alt-Tab oder so verwenden willst, dann sagt dir die auch Shortcut Already In Use. Morgen hast du frei oder arbeitest du 80%? Nee, ich hab montags frei, nicht freitags. Morgen muss ich arbeiten. Montags hab ich frei. Kennst du Ahead In Time? Ja, kenn ich. Ist ein sehr, ein nicees Game ist das. So, ähm, ich will das nochmal fertig bauen. So, von der Idee her ist es ja, von der Logik her, viel mehr brauchen wir jetzt ja an der Stelle gar nicht. So, jetzt wollen wir was Neues. Haben wir noch nie gemacht. Ich glaub, ich glaub, in noch keinem Programm oder in keinem Stream bisher, auch nicht beim Screenshot Tool, haben wir Events verwendet. Hab ich aber noch nirgendswo gemacht. Aber jetzt brauchen wir welche. Denn, wenn dieses Ding hier, wenn ich das hier starte und das kriegt mit. Das ist jetzt ein bisschen laut, das Soundtrack wieder. Ai. So, ähm, wenn das jetzt mitkriegt, das läuft da im Hintergrund und checkt, ob sich hier in dem Ordner was ändert. Wenn sich was geändert hat, dann muss ich das ja hier mitkriegen. Das bringt mir ja nichts, wenn sich das einfach ändert im Hintergrund. Da hab ich nichts davon. Ich muss ja darüber benachrichtigt werden, dass sich was geändert hat. Und darauf reagieren. Das heißt, wenn mir das hier Bescheid sagt, mit einem Event, dass sich in diesem Ordner was geändert hat, dann muss ich mir quasi die Liste hier neu holen und die Shortcuts neu anlegen. Weil, mal angenommen, ich ziehe jetzt hier ein neues Bild rein. Ähm, keine Ahnung, f12.blub.png, dann muss ich ja einen neuen Shortcut registrieren, nämlich Steuerung f12. Das heißt, wenn das hier erkennt, dass es ein neues Bild gibt, muss ich das ja in meinem UI mitkriegen. Dazu brauchen wir einen Event. Ähm, overlayt das auch Games im Fullscreen? Nein, das geht nicht. Window, Borderless Window Fullscreen geht. Das ist das aktuelle Game, die Funktion für Borderless Window. Aber Fullscreen geht technisch nicht. Wir haben schon das Maximale gemacht, was geht, dass die Bilder halt, dass man durchklicken kann, dass die immer on top sind und dass du quasi nie den Fokus verlierst im Endeffekt. Guck hier, ich track und drop im Hintergrund weiter, obwohl ich Overlay-Dinger ein- und ausblende. Da passiert halt nichts. Aber Fullscreen geht nicht. Weil Fullscreen ist exklusiv und das geht aus einem logischen Grund auch nicht. Ähm, das hier, das Bild, man kann auch ganz einfach erklären, warum das im Fullscreen nicht geht, im exklusiven Fullscreen nicht funktioniert. Das hier ist ja im Endeffekt ein transparentes Fenster hier drum herum. Ein transparentes Fenster, wo dann ein Transparent, ein GIF mit Transparenz drin ist. So, und damit man mehr als ein Fenster quasi gleichzeitig rendern kann, muss der Windows, wie heißt das Ding, DWM, dieser, der Windows, der von Windows, der Window Manager muss die Fenster rendern. Ja, also sprich, der macht halt auch so Dinge wie dieses Window, überlappt dieses Window und durch Transparenz gucke ich da so durch und sowas. Ähm, das heißt der Windows, Window Manager muss das rendern, dass es funktioniert. Und bei einer exklusiven Fullscreen-Anwendung rendert nicht der Windows, Window Manager den Inhalt. Dementsprechend kann es nicht funktionieren. Wenn man ein Overlay machen möchte in einem exklusiven Fullscreen, in einem Fullscreen-Spiel, was exklusiv diesen Fullscreen-Modus hat, dann bleiben dir im Prinzip, bleiben dir eigentlich zwei Möglichkeiten. Du verwendest irgendwelche Nvidia-Hacks, die haben da irgendwas für. Ja, also so wie Steam zum Beispiel dann auch irgendwelche Bilder abgreift und sowas. Ähm, was Normalsterbliche nur mit Quadro-Karten dürfen, darf Steam auch mit Geforce-Karten machen. Also entweder verwendet man irgendwelche Nvidia-Hacks oder aber man muss das in das jeweilige 3D-Rendering irgendwie injecten. Sein Overlay, so macht das, so macht das FRAPS zum Beispiel für seinen FPS-Counter, den es oben anzeigt. Ja, oder Steam für den FPS-Counter und sowas. Allerdings ein komplettes Overlay mit Bildern und so, das ist so eine Sache. Zumal das Injecten in diese Diode-X-Rendering-Geschichte, da springen natürlich auch mal Anti-Cheat-Tools ganz gern drauf an. Weil in der Vergangenheit haben das halt viele Hacks gemacht. Wenn du früher einen Wall-Hack hattest, da musstest du ja irgendwie quasi anzeigen, wo der Gegner hinter der Wand ist. So, und wenn du das quasi so gemacht hast, dass du in das Rendering vom Spiel eingekrippten hast, um dann quasi deinen Wall-Hack da rein zu rendern, das war halt ziemlich easy zu bemerken für den Hersteller. Das heißt auch die krassen Hacksore sind mittlerweile darauf umgestiegen, das mit Overlays zu machen. Weil das merkst du nicht. Das kannst du im Prinzip nicht feststellen. Zumindest nicht so einfach. Weil der Windows Display Manager, wie auch immer dieses Ding da genau heißt, ist ja für das Rendern zuständig. Und dein Spiel rendert ganz normal und du siehst ja nicht, dass jetzt der Benutzer noch ein Fenster davor geschoben hat. Das muss dich ja auch überhaupt nicht interessieren. Das heißt Hacks haben heute auch eher so einen Overlay und hängen sich nicht mehr in das Spiel rein fürs Rendern. Deswegen funktioniert das exklusiv Fullscreen nicht. Und ohne Hacks, also offiziell funktioniert das bei exklusiven Fullscreen-Spielen nichts. Nur halt mit irgendwelchen komischen Hacks, wie das zum Beispiel in FRAPS und Steam natürlich auch machen, dass du einen FPS-Counter hast. Die einzigen quasi legit FPS-Counter sind halt die, die ein Spiel selbst zur Verfügung stellt, weil das rendert es halt selbst. Ja, Desktop-Screenshots als Anti-Cheat ist auch gar nicht so blöd. Wenn man quasi das Gleiche macht, was im Endeffekt Drucken bzw. Alt-Print und so macht, da kannst du ja auch nichts verstecken. So, Events. Ich war bei Events. Nun müssen wir jetzt ein Event einbauen, was uns hier in unserem UI Bescheid sagt, sobald sich im Hintergrund was geändert hat. Gucken wir mal, wie wir das jetzt am besten machen. Eventhenge, brauchen wir da überhaupt einen für... Ich würde euch ganz sicher was machen. Wir machen jetzt ein Event, das ich abonnieren kann aus meinem GUI, was mir Bescheid sagt, sobald sich was in diesem Ordner geändert hat. Und das nennen wir einfach Updated. Updated, Gebated, Activated, Overrated. Updated heißt das Ding. Und man sieht es jetzt auch schon. Ich habe jetzt hier ein neues Event Updated. Und da kann ich mich jetzt dranhängen und sagen, wenn dieses Event auftritt, also sprich, wenn sich was geändert hat an den Bildern, dann ruf folgende Funktion auf. Der klassische Weg ist, dass man das so macht, sprich, man muss dann eine eigene Funktion anlegen, die aufgerufen wird und hin und her. Ich finde das mit Lambdas einfacher, weil wir müssen ja nicht viel machen im Endeffekt an der Stelle. Jetzt muss man sich überlegen, was will man dann updaten, wenn sich eine Datei ändert. Im Prinzip sind das ja eigentlich nur die Shortcuts. Also sprich, wenn das Programm läuft und ich lösche jetzt LUL, dann will ich das Shortcut für Steuerung L entfernen. Wenn ich jetzt ein neues Bild rein mache, was F12 Blub heißt, will ich das neue Shortcut F12 anlegen. Das heißt, ich brauche eine Funktion, die quasi ganz billig beim Aufruf alle Shortcuts löscht und alle Shortcuts neu anlegt. Das ist die billige Variante, wo du am wenigsten Probleme hast. Die legen wir jetzt mal erstmal leer an, ohne dass er was macht. Refresh, ich weiß nicht, ob das ein schöner Name ist, aber das passt schon. Refresh Keybindings macht erstmal nichts. Wir werden gleich basteln, dass die was macht. Und wenn das Event aufgerufen wird, also sprich, sobald sich hier was ändert im Hintergrund, dann wollen wir diese Refresh Keybindings aufrufen. Ich überlege gerade, wie wir das jetzt gescheit machen. Was hat er für Schmerzen? Warum geht es nicht? Okay, es funktioniert nicht, weil ich sage hier ja, dass dieses Event möchte Event-Arcs übergeben, aber diese Funktion hier nimmt keine Event-Arcs. Aber eigentlich will ich überhaupt keine Event-Arcs. Das brauche ich ja auch nicht. Updated reicht. Updated heißt, ich muss mir die Liste neu abrufen und gut ist. Ganz schnell mal eine Frage. Man könnte sich für LoL einen Overlay machen und solange man es in Windows Fullscreen hat, sollte das klappen, oder? Ja. Richtig. Wenn du in Borderless Windout Mode oder irgendwie sowas hast, dann geht das. Das funktioniert ja auch, was wir hier haben. Also die Bilder kannst du in LoL, wenn Windout Modus ist, kannst du anzeigen. Hallo Max 3 Elmuth, Max Selmuth, Max Elmuth. Das funktioniert in LoL. So, wir sind stehen geblieben. Okay, gucken wir mal, ob das prinzipiell tut. Okay, das wird funktionieren, wenn man das richtig aufruft. Das ist auch so was, als kleiner Tipp. Wenn ihr mal irgendwo Parameter kriegt, die ihr übergeben bekommt, die ihr eigentlich gar nicht braucht, kann man einfach hier underscore underscore schreiben. Also Variable dürfen halt so heißen. Das ist so ein bisschen inoffizielle Konvention für, dass man es wegwirft. LoL blockt Hotkeys von den meisten Programmen. Bin mir nicht sicher, ob das bei Memeboard geht. Na ja, doch. Also je nachdem, wie sie es gemacht haben, müsste das funktionieren. Das einzige, was sein könnte, wenn die einen eigenen Tastaturtreiber haben, so ein Low-Level-Ding, wie das VMWare zum Beispiel hat, und exklusiv die Tastendrücke abgreifen, bevor die quasi überhaupt bei Windows ankommen sozusagen. Dann könnte das sein, dass es nicht funktioniert. Allerdings würde damit ja LoL auch alle anderen Funktionen aushebeln. Also sprich, wenn du eine, keine Ahnung, da kannste nicht mal Windows switchen gescheit, wenn die sowas blocken. Es kann sein, dass die da was dagegen gebaut haben, weil die wollen ja wahrscheinlich auch gegen Makrosoftware vorgehen. Wir können irgendwann mal ausprobieren, ob es in LoL funktioniert. Ich habe LoL noch nie installiert, aber wir können es ja mal ausprobieren. Machen wir nichts bestreben. Also wenn AutoHotkey nicht funktioniert in LoL, dann spricht das für ihren eigenen Tastaturtreiber, wie das VMWare auch macht. Wobei, Moment, es ist ein Unterschied, geht es jetzt um Shortcuts senden an das Programm, ohne einfach nur Shortcuts durchlassen, dass ein anderes Programm darauf reagieren kann. Dass Key Inputs senden an LoL nicht funktioniert, kann ich mir vorstellen, das wäre bescheuert, wenn sie das machen würden. Aber ob die Shortcuts blocken, sodass sie auch bei anderen Programmen nicht ankommen, das kann ich mir kaum vorstellen. Da würde ja Discord-Muten nicht mehr funktionieren. Stellt euch vor, LoL würde Shortcuts blocken, dann könnte ich mich im Discord nicht mehr muten. Also sprich, wenn ich jetzt im Discord ein Shortcut für Alt-GR und M anlege, dass es mich jetzt mutet im Discord, und es würden die blocken, dann könnte es das glaube ich nicht. So, übrigens, wir machen mal kurz weiter. Also wir wollen im Prinzip, sobald sich hier irgendwas ändert, die Key Bindings refreshen. Ja, das wollen wir machen. Bloß das Key Bindings Refreshen halt gerade noch nichts macht, aber prinzipiell wollen wir das machen. Jetzt müssen wir natürlich noch dafür sorgen, dass das Event, er meckerte ja schon, dass es nicht benutzt wird, dass das Event auch getriggert wird, sobald sich was ändert. Und im Prinzip müssen wir das Event hier am unteren Ende von dieser Funktion triggern. Also im Prinzip, sobald das hier durchgelaufen ist und alles richtig einsortiert wurde, können wir sagen, hallo an alle da draußen, es hat sich was geändert. So, dann sagen wir es dis, update, invoke, invoke. So, und die ganzen Event-Arcs-Scheiß brauche ich nicht, die brauche ich eh nicht, will ich eh nicht auswerten. Das ist übrigens auch schönes neues C sharp 7 Feature. Früher musste man immer sowas hier machen. Dis, updated, ungleich Null, ungleich Null und dann, und dann konnte man sagen, dis, updated, ausführen. Oder, ging das überhaupt so? Ja, genau. Doch, das ging so. So musste man das früher machen. Weil es könnte ja sein, dass es niemand gibt, der das Event haben will. Und wenn es keinen gibt, der das Event haben will und ich rufe das Event auf, dann gibt es einen Fehler, weil er versucht was aufzurufen, wo halt nichts ist. Das kann man jetzt schon umgehen mit diesem Null-Gedöns-Operator in C sharp 7. Fragt mich nicht, wie das Teil heißt, genau. Der ruft das also nur auf, wenn da mindestens einer ist, der das Event haben will. So, was mir jetzt echt auch krankkeks geht hier, dass ich hier irgendwelche komischen Event-Arcs und Geschiss brauche, das will ich nicht. Das ist bescheuert, brauche ich nicht. Ich will einfach nur update wissen. Du musst doch auch nicht, dass die... Das stimmt. Kann ich einfach einen normalen Event-Händler verwenden? Naja, da muss ich aber auch so einen Scheiß angeben. Nee, eine eigene Delegate will ich nicht, das ist doof. Sucked. Da muss doch jemand anderes geben. Da gibt es was schöneres für. 100 Pro. Stack Overflow. C sharp. Empty Event-Händler. Ich habe keine Ahnung, was ich suchen soll. Krass. Die wichtigsten Sachen, die wichtigsten Sachen, alle schon mal angeguckt. Gecheat. Exposed. Max revealed. Ich habe gecheatet, ich habe schon mal nachgeguckt. Nee, das will ich nicht, ich will kein eigenen. Ja, das ist kacke, das will ich nicht. Ich will kein eigenen, das ist doof. Das ist eine gute Idee, laubpetin. Das ist eine wirklich nice Idee. Wir nehmen einfach kein Event-Händler, wir nehmen eine Action. Und da können wir wahrscheinlich die Funktion sogar direkt... Oh, das ist sehr nice, das gefällt mir. Da können wir nämlich die Funktion wahrscheinlich direkt hier dran hängen. Oh, das ist schick. Das ist schick. Oh ja, das ist das, gefällt mir. Das ist sehr nice. So mag ich das. Kein überflüssiges Geblubber, einfach nur das Nötigste. Das Einzige, was wir jetzt noch nicht gemacht haben, obwohl ich am Anfang des Streams da irgendwie 20 Minuten drüber gelabert habe, ist, wenn ich jetzt eben aus diesem Thread komme und in meinem UI-Thread etwas aufrufe, und je nachdem, was ich hier mache, kann es knallen. Dementsprechend muss ich sicherstellen, dass es im richtigen Thread aufgerufen wird. Das heißt, ich brauche noch einen Invoke. So, und dann funktioniert das nämlich auch nicht mehr so einfach. Aber, weißt was, drauf geschissen. Es sieht halt ein bisschen hässlicher aus, aber es funktioniert. Jetzt ist nämlich sichergestellt, dass RefreshKeyBindings immer im UI-Thread aufgerufen wird und nicht hier von diesem Background-Filesystem. Watcher. So, das Ding hier ist jetzt eigentlich fertig. Mehr muss ich da nicht mehr dran machen. Das funktioniert. Das finde ich sehr nice. Achso, doch, eine Sache muss ich noch machen, fällt mir klar. Ich muss das Ding ja einmal initial befüllen. Also quasi das, was ich hier mache, muss ich hier einmal am Anfang machen. Komm, wir machen das klassisch mit irgendeiner Schleife. Vorfile in Files, und jetzt sagen wir einfach this add. So, jetzt haben wir nämlich den ganzen Campbell drin, und das ist einmal initial befüllt. Alles gut, alles toll. Dann tauschen wir jetzt den Campbell erstmal aus. Und zwar, wir wollen jetzt keine interne Liste mehr mit Memes haben, sondern wir wollen ein internes Memerepo haben, was jetzt einfach mal ganz willig hardcoded mit dem Fahrt aufgerufen wird. Load brauchen wir auch nicht mehr. Load können wir hier rausschmeißen. Ah, das Ganze wird gleich schon ein bisschen übersichtlicher. Das da verschieben wir mal in eine eigene Datei. So, jetzt gibt es aber doch irgendwelche Fehler. Genau. Jetzt muss ich mal meinen bestehenden Code umstellen, der ja auf die interne Liste zugegriffen hat, dass der jetzt dieses Repo verwendet. So. Updaten wir einfach nur, dass die Fehler weggehen. Und dann arbeiten wir uns da mal langsam vor. Okay, jetzt sollte die gleiche Funktionalität wie vorher auch noch tun. Genau, aber das Updaten und so funktioniert natürlich noch nicht. Aber Bildchen und so funktionieren alle. Also das klappt prinzipiell schon mal. So. Ach ja, das müssen wir auch noch machen, dass Bild hoch und runter die Kreiselanimation triggert. So. Ich meine, von der Idee her muss ich jetzt einfach bei einem Refresh... Also sobald sich was geändert hat in dem Ort, dann muss ich ja meine Keybindings refreshen. Das heißt doch, von der Idee her, dass ich sowas hier machen muss. Keybindings, clear. So. Und danach haben wir mal irgendwie eine Schleife über die neuen. So. Nachdem das auch immer eine Kopie vom aktuellsten Stand ist, habe ich da auch gar nicht Gefahr, dass irgendwas kaputt geht. So. Und jetzt fügen wir einfach das neu ein. Also im Prinzip nehmen wir einfach die Funktion, die wir schon mal gemacht haben hier. Set Keybindings. So. Jetzt bin ich ja mal gespannt, ob das funktioniert. So. Okay. Wir kopieren jetzt mal was. Wir kopieren jetzt mal was. Mal gucken, ob das funktioniert. Wir kopieren jetzt da ein neues Bild rein, was den Shortcut F11 registrieren will. Kaputt. Funktioniert nicht. Was habe ich denn verkehrt gemacht? Fuck. What? Hä? Moment, gibt es das schon? Warum ist der already in use? Ich clear den Scheiß hier. Ah, ich habe eine Idee. Das könnte sein, dass ja, die Dinger werden wahrscheinlich erst regulär geklärt, wenn das nächste Mal der Garbage-Collector läuft. Hier verlieren sie alle Keybindings quasi ja nur ihre Referenz. Das heißt, ich muss die Dinger selbst aufräumen vorher. Hallo Jonas Nils. Wir probieren jetzt mal aus, ob das daran liegt. Also quasi sowas wie... Keine Ahnung, ich probiere das jetzt einfach mal aus. Keybindings. So. Und jetzt muss man aufpassen. Was keine gute Idee ist, wäre jetzt sowas hier zu machen. Ich könnte mir vorstellen, dass es Probleme gibt, wenn ich for each über eine Liste mache und im Lauf vom for each quasi den Inhalt dieser Liste kaputt mache. Das ist glaube ich keine gute Idee. Deswegen machen wir mal vorher uns irgendwie eine temporäre andere Liste und machen das dann dann kaputt. So. Gucken wir mal, ob es jetzt funktioniert. Jetzt wird es spannend. Ich hoffe, heute kommt keiner wieder und sagt, Max, drück doch Steuerung C zum Kopieren. Sollte offensichtlich sein, warum das nicht funktioniert gerade, wenn das Programm gestartet ist. Bäm. Funktioniert. Poggers, Alter. Poggers. Omega Poggers. Monka Giga Poggers. Okay, das war es. Das war das Problem. Oh, ich habe eine Idee. Wir können jetzt den übelst krassen Hack machen. Also, naja. Das war jetzt... Okay, die Ankündigung war ein bisschen übertrieben. Aber ich habe eine Idee. Wir könnten jetzt mal... Also, es wird jetzt hässlich. Ich will bloß mal ausprobieren, ob das funktioniert. Man könnte noch eigentlich sagen... Also, jetzt mal, wenn ich mir die Schleife sparen will, ich könnte jetzt quasi sowas hier in der Richtung machen. Ähm, guck mal, ob das funktioniert. For each, ähm, äh, äh, key, key dispose. Das geht. Was findet ihr schöner, so oder mit Schleife? Das sollte eigentlich das Gleiche machen. So oder mit Schleife. Und vielleicht sogar noch kürzer. Einfach nur so. Einfach nur so. Ich habe halt meine Bedenken, wenn ich quasi die Sachen kaputt mache in der Liste, während ich quasi drüber laufe. Probieren wir es einfach mal aus. Scheiße, aber das sehen wir jetzt dann gleich. Ob das was bringt oder nicht. Ich kann es jetzt löschen. Geht genauso. Nö. Okay, wir können uns das zu Listen sparen. Da war ich ein bisschen übertrieben. Vorsichtig jetzt wahrscheinlich. Ja, so ist doch viel schicker. So ist es doch wirklich nice. Wir löschen alle Keybindings, werfen danach unsere Liste mit Keybindings weg. Also den Inhalt der Liste mit Keybindings. Und machen neue Keybindings. Eats as fuck, würde ich sagen. So und wir können das Ganze übrigens noch ein bisschen verkürzen. Also ein Switch kann auch mal ein infinitendes Ding nicht in Bindingkey, sondern in Prefix. Weil an der Stelle ist es kein Key oder sonst was. Es ist einfach nur ein String-Prefix. Key wird es erst hier drinnen, wenn man daraus ein Hotkey macht. So wir nennen das Ding Prefix. Und nachdem wir ja gerade irgendwie schon den leichten Hang zu 1-Heilern haben, ich benenne das hier auch nochmal um. Das heißt nicht change me, sondern zählen wir mal. Toggle me. Weil es zeigt ja auch das gleiche an und lässt es verschwinden. So, nachdem ich gerade den Hang zu 1-Heilern habe, was haltet ihr denn von? Achtung, ich bin noch nicht fertig. Ich bin noch nicht fertig. Was haltet ihr denn von sowas hier? Okay, das ist vielleicht ein bisschen übertrieben an einen Zeiler jetzt, oder? So oder eine Funktion mit bisschen kürzeren Zeilen. Moin, naturedief, def. Wir können einfach noch einen Zeilenobbruch rein machen. Ach so schlimm sieht das doch gar nicht aus mit einem Zeilenobbruch, oder? Das ist doch eigentlich ganz schick. Eigentlich ist das das so ganz schick. Bitte nehm geschweif- ne, ne, ne. Wenn wir es schon in einen Zeiler rein kriegen, dann machen wir das einfach ohne geschweifte Klammern. Die ganze Klasse in eine Zeile. Ach, ich finde das sieht gar nicht so schlecht aus jetzt. Es sieht schon ein bisschen hässlich aus. Ja, das muss man schon zugeben. Egal. Ach ja, und das machen wir übrigens auch noch, fällt mir gerade auf. Man konnte dem Ding hier nämlich übergeben, ob case-sensitive oder nicht. Das heißt, der interessiert sich jetzt dafür, ob es ein großes L ist oder ein kleines L hier und wir sagen ihm jetzt mal scheiß drauf. L ist L. Ich lasse das jetzt mal so. Ich finde das eigentlich ganz schick. Es ist schon- also es ist jetzt nicht unbedingt das Schönste, aber dafür ist es kurz und knackig. Mach das for each auch zu einem Lamm. Hab ich doch. Also hier innen drinnen. So, fertig jetzt. Weiter, weiter im Text. Gibt es überhaupt noch was weiter im Text? Ich meine, im Prinzip geht jetzt nicht das, was wir machen wollten. Was mache ich hier eigentlich gerade? Das ist doch vollkommener Blödsinn. Ich muss einmalig, einmalig, einmalig muss ich beim Start alle Keybindings anlegen und danach macht er das automatisch. Danach macht er das automatisch immer, wenn sich was ändert. Nee, da gibt es doch nichts drüber zu meckern. Ja, das passt doch eigentlich. Eigentlich ist es genau das, was wir wollen. Mehr müssen wir doch gar nicht machen. So, alles gut, alles nice. So, was wir jetzt noch machen ist, dass das Bild sich dreht. Das brauche ich auf jeden Fall wieder. Also sprich, dass das Bild muss sich drehen, sonst geht es nicht. Die ursprüngliche Implementierung war ja, man klickt rechts auf das Bild, dann fängt es sich an zu drehen. Das Problem ist, seitdem wir durch das Bild durchklicken können, ist halt mit Rechtsklick nichts mehr. Dementsprechend müssen wir diese komischen Events da wieder weg machen. What? Ah, ist das kompliziert. Warte, Window, da, Window. Nein, geh weg. Piss dich alle. Das da weg, das da weg, gut, zack. Das da weg, rumtracken ist eh nicht mehr angesagt. Right Mouse Button ist auch nicht mehr angesagt. Sondern wir registrieren uns jetzt einen neuen Hotkey für Page Up, Page Down. Und hauen die Logik da rein. Und wir benennen das mal um. Double Rotation. Und sagen jetzt hier, wir wollen den neuen Hotkey. New Hotkey, äh, wieder Steuerung, Control, Key, äh, Page Down. Page One mit Page Up an. Page Up. Und zwar... Double Rotation. Ah ja, das kann ich jetzt hier natürlich so nicht direkt übergeben. Ich bin mit euch ganz sicher, wie wir das jetzt hier machen. Hab ich verschrieben? Was, was, was hab ich vertan? Ah, ja, ich hab das unbenannt, obwohl es Blödsinn. Brauchen wir doch alles gerne mehr. Okay, das funktioniert. Äh, Key Up, Page, Page Down. Äh, Rosarota, Panther, ich zeig's dir gleich. Schauen wir mal, ob das funktioniert mit der Rotation. Ha! Oh, nice! Jetzt haben wir einen richtig geilen Lull-Effekt noch. Omega-Lull. Monka-Shake. Monka-Shake. Also, das kann ich sehr zeigen. Äh, Rosarota, Panther, was hier programmiert wird, äh, ist eigentlich das, was du hier siehst. Du kannst Bilder transparent overlayen über alle anderen Programme. Ohne, dass es das Programm da drunter stören wird, weil guck hier, du siehst, du kannst sogar durchklicken durch das Bild. Das ist quasi gar nicht da im Endeffekt. Das ist Big Brain, das Programm, nicht Big Brain. So, mir ist gerade etwas eingefallen, wir können uns diese ganze Funktion hier umsparen. Wir können uns die ganze Funktion hier ersparen. Weil im Prinzip das einzige, was wir hier drin machen ist, Storyboard, Start, Stop, Begin, Begin, Stop. Wir brauchen den ganzen Scheiß nicht. Wir können einfach hier sagen, begin und end. Fertig. Ups, ne, Stop, Stop war es, ne, Stop. So, wisst ihr, wieder was gelöscht. Wenn man versucht, ein Meme auf Page Up und Down zu legen, stürzt er ab. Ja. Das würde er aktuell noch machen. Das finde ich ist ein geiler Effekt irgendwie, oder? Ok, Page Down zum Rotation Stoppen, Page Up für Rotation Starten. Das hat irgendwie was. Geht das auch mit Omega Null? Oder kriegst du es ja mit Angst zu tun, ey. Freust du dich auf Battlefield 5? Ich bin, ne, ehrlich gesagt, freue ich mich nicht auf Battlefield 5. Ich will mich von dem Game diesmal überzeugen lassen. Ich gehe da mit keinen Erwartungen ran. Battlefield 1 hat mir ja, wie gesagt, ich habe es ja oft erzählt, überhaupt nicht gefallen. Hallo, Schrecken. Es. Ich gehe da mit gar keinen Erwartungen dran. Ich will, dass das Spiel mich überzeugt diesmal. Das kriegt keinen Vorschuss-Hype von mir, Battlefield 5. Black Ops 4 übrigens auch nicht. So. Was hältst du von variabler Rotationsgeschwindigkeit? Ja, ich finde das eine gute Idee. Und zwar, man sollte nicht nur links rotieren können, sondern man könnte vielleicht auch rechts rotieren. Also man könnte quasi sagen, ok, ich drücke Page Up, er rotiert links, ich drücke Page Down, er stoppt. Ich drücke Page Down und er rotiert in die andere Richtung. Also man könnte nicht nur links rum rotieren, man könnte auch rechts rum rotieren. Aber dazu muss ich mir erstmal Gedanken machen, weil dazu brauchen wir irgendwelche WPF-Magie, wo ich überhaupt keine Ahnung von habe. Ich habe es ja mit Ach und Krach geschafft, diese Rotation das erste Mal mir zusammen zu Copy-Pasten von Stack Overflow. Aber das nehme ich gerne als Pull-Request. Also ich werde nach dem Stream wieder pushen, falls sich irgendjemand dazu berufen fühlt oder gerne daran mitwirken möchte. Und das einbaut, dass man quasi nicht nur links rotieren kann, sondern auch rechts rotieren kann mit Bild hoch und runter. Plus eventuell noch variable Rotationsgeschwindigkeit, wenn er richtig sophisticated langsam. Den Pull-Request werde ich dann beim nächsten Stream gucken wir uns den zusammen an und Merchandise. Gibt es jetzt noch etwas zu machen? Wir können noch den Krempel hier oben mal umbenennen. Der meckert auch schon die ganze Zeit. In was möchte er denn umbenannt werden? In SB. Ne, bevor wir den SB nennen, nennen wir den Storyboard in groß. Ja, okay. Ja, also ich würde mal sagen, im Prinzip haben wir alles gemacht, was wir machen wollten. Gibt jetzt eigentlich nichts mehr Großartiges zu tun in dem Stream heute, was Programmieren angeht? Nächsten Stream bringen wir dem Ding Netzwerkfunktionen bei. Dann wird es spannend, weil das habe ich auch noch nicht gemacht mit SignalR. Wie heißt denn das überhaupt? Wie spricht man das aus? SignalR, SignalIR, IR, IR, IR, wie spricht man das aus? Habe ich nämlich mal einen Guide zugelesen und damit probieren wir das dann. Da bringen wir dem Ding Netzwerkfunktionen bei, dass man quasi ein Dashboard hat, ein bisschen wie diese Ordnerübersicht eigentlich, aber halt auf einem zweiten Monitor oder auf einem zweiten Rechner, wo man halt quasi in diesem Dashboard anklicken kann und das, was man anklickt, erscheint dann, wird dann hier eingeplendet. Also sprich, ich kann dann auf einem zweiten Rechner übers Netzwerk sagen, hey, ich möchte jetzt gerne dieses Bildchen hier aktivieren und dann erscheint es auf dem anderen Rechner. Das ist Pflicht, wenn man eine gewisse Anzahl hat, weil erstens, es soll ja nicht alles Shortcuts kriegen, wenn man jetzt zum Beispiel irgendwas spielt oder irgendwie einen Livestream oder irgendwie nehmen wir die E3 Pressekonferenz kommentiert, ein bisschen blödes Zeug dazu erzählt, dann brauche ich ja nicht für alles Shortcuts, ich brauche hier so 3-4 Bildchen, die brauche ich laufend und die anderen kann ich dann quasi über das Dashboard aktivieren vom anderen Rechner, weil wenn ich hier jedes Mal die ganzen Shortcuts mir merken muss bzw. hier mit Steuerung C jetzt ja auch wichtige Shortcuts belege, ist ein bisschen blöd. Das heißt, das nächste Mal gucken wir uns mal an, wie wir dem Ding Netzwerkfunktionen beibringen, dass ich das fernsteuern kann, das Ganze noch. Und wenn das fertig ist, werde ich das auch als erste Version dann zum runterladen für Nicht-Entwickler veröffentlichen auf GitHub, dass man sich direkt runterladen kann. Aktuell kann man sich ja auch hier angucken auf Systema, wichtige Shortcuts belegen, GitHub, Inboard und sich selbst kompilieren, wenn man das will. Wenn die Netzwerkfunktion fertig ist, dann werde ich das auch direkt einmal zum Download anbieten, dass das kann dann jeder verwenden, der will. So, da wirklich langsam mal mit Programming heute fertig. Ich gucke mal, ob der Ehex da ist. Wenn der Ehex da ist, spielen wir jetzt noch eine Runde. Oder werden wir jetzt noch 1-2 Stunden, eher 2,5 Stunden, bis 22 Uhr spielen wir noch Realm Royale. Oh, der Meshed streamt auch gerade Realm Royale. Da müssen wir jetzt mal gucken. Der Meshed streamt Realm Royale. Gucken. Outer? Sieht man nicht richtig. Er ist zumindest gleich tot. Reckt. Schreckt. Hast du mal in Quake Champions reingeguckt? Nee. Ich kenne das von Streams, ja, aber etwas gespielt habe ich es noch nicht. So, sind wir jetzt hier fertig? Ist ja noch irgendwas offensichtliches, was wir noch machen müssen. Sollte Mist drinne stehen, quasi hier vorne, sollte hier einer sagen, ich möchte als Shortcut irgendwie irgendeine Taste haben, die es nicht gibt. Also ich möchte als Shortcut jetzt blub. Es gibt ja offensichtlich die Taste blub auf der Tastatur nicht. Dann wäre er abgekackt und jetzt kackt er nicht mal ab, weil jetzt versucht er zu erkennen, was das für ein Key ist und wenn er den Key nicht erkennt, dann legt er es einfach nicht an. Das ist insofern eigentlich schon mal recht fehlertolerant jetzt dadurch geworden. Was er nicht abfängt bis jetzt ist, wenn es das schon gibt. Das könnten wir theoretisch noch einbauen. Also ich finde bei Realm Royale ist gerade, dass es verschiedene Helden mit Fähigkeiten gibt, auch das was es zu anderen Spielen irgendwo unterscheidet, zu anderen Battle Royale Spielen. Ich meine, es hat ja schon im Vergleich zu Pupke, hat er den Realismus Faktor, Inventory Management, relativ viel Mikro Management, Fortnite hat das Bauen und Realm Royale hat halt Klassen mit Fähigkeiten. Wenn du jetzt dem Spiel Klassen mit Fähigkeiten wegnehmen würdest, dann ist es nur noch ein halbes Game im Endeffekt. Hat dich der Mesh eigentlich mal real gesehen? Ja. Wir kennen uns schon seit ein paar Jahren. Also ich überlege gerade, wer kennt mich eigentlich in echt von YouTube Leuten? Also länger als fünf Minuten mal gesehen. Der Mesh kennt mich. Wen kenne ich denn länger als fünf Minuten? Der kennt mich ja auch länger als fünf Minuten. Der Mesh, der Lost, der Kanbum, der Self-Owned, der Krieger, der Gaming-Clerks, Nico. Wen kenne ich denn noch? Wobei, den Nico habe ich auch nicht länger als fünf Minuten gesehen. Wen kenne ich denn noch länger als fünf Minuten? Ja, die ganze Call of Duty, die ganzen ehemaligen Call of Duty Leute. Also den Marcel, Montana Black, die ehemaligen Call of Duty Leute. Wen kenne ich denn noch? Dr. Banks kenne ich noch. Also ich kenne ein paar Leute, aber so wirklich gut, also länger und mit denen ich auch wirklich schon eine längere Zeit gelabert habe. Von denen die noch aktiv sind, ist das eigentlich hauptsächlich der Mesh. Der Lost auch noch ein bisschen, aber ansonsten hält sich den Grenzen, wo ich da großartig Kontakt habe mit YouTube Leuten. Ja, der Friseur, der ist jetzt keine YouTube Leute. Den Friseur kenne ich schon Jahre vor YouTube. Der ist der, ich kann es ja nicht dabei erzählen. Ah ja, der, äh, der, ähm... Ich überlege gerade, kenne ich den Danny in Echt eigentlich? Er stimmt in Solution noch, genau. Kenne ich, ich überlege gerade, ob ich den Danny in Echt mal gesehen habe, keine Ahnung. Nee, ich glaube nicht. Ah, was auch immer. Ich habe mich ja aus diesem ganzen YouTube Deutschland Zeug schon vor Jahren irgendwie ein bisschen rausgezogen, weil mir das immer, immer, immer, weil das alles irgendwie, keine Ahnung, immer weiter von dem weg entwickelt, wo ich mit was zu tun haben will. Ich habe, ich habe, äh, irgendwo letztens einen Streamausschnitt gesehen, wo sich Montana Black eine Rolex gekauft hat im Livestream. Gut, wenn man, wenn man das halt unbedingt jedem zeigen muss, dann warum nicht, aber das jetzt sein muss, sei mal dahingestellt. Das Trash-TV-YouTube. Ja, das Problem dabei ist ja gar nicht mal, dass es nichts Gescheites gibt. Es gibt ja genug Gescheites, aber es wird einfach geflutet von Bullshit auf YouTube. Und die Empfehlungen sind halt erst mal, wenn du da drauf kommst, so breit angelegt, dass die gucken, dass die, wenn die dich noch nicht kennen, ne? Denkt YouTube halt, aha, guckt mal, wir gucken, guckt es euch doch mal an. Guckt es euch doch mal an. Wenn ich hier, das haben wir das letzte Mal schon gemacht, das haben wir jetzt noch mal. Ähm, ach nee, Moment, ich muss mal, ich muss nen, nen, nen, nen. Ah ja, Git, äh, Committen muss ich noch. Committen muss ich noch und pushen. Mal gucken wir uns nochmal YouTube an. Ich mach gleich mal ein Inkognito-Tab auf. Ähm, Commit, ähm, Feinschliff. Das wäre beispielsweise so ein Commit, wo ich auf der Arbeit sagen würde, schreib nochmal ein ordentliches, aber ich darf das jetzt hier. So. Push. Was kann der mal schreiben? Master. Wat? Ich hab doch mein Key, ich hab doch mein Key hochgeladen. Warum geht denn das nicht? Was, was, was spackt denn das so rum? Ist wieder Gefahr laufen mein Passwort zu exposen. Okay, ist gepusht, Leute. Wer sich dran beteiligen will, so zum Beispiel dieses, dieses Animationsding, Bild hoch, Bild runter. Pull-Requests sind immer willkommen. Auch der Pull-Request, der hat uns schon mal was gebracht. Wir konnten nachgucken, wie das mit dem Tray-Icon funktioniert. Leider ist das, passt das halt überhaupt nicht mehr zu unserem aktuellen und auch nicht mit XML-Dateien, so wie im XML-Files, wie ich's haben wollte. Aber trotzdem, schön, dass du das eingereicht hast. Ich werd das jetzt mal... Wie lehnt man hier auf GitHub überhaupt ab? Ich close das mal, ne? Wir haben es uns ja zusammen jetzt im Stream angeguckt, auch ein paar nützliche Sachen jetzt rausgezogen, aber in der Form passt es nicht mehr und ich will auch kein XML-Config. Bible-Thump. Was hast du für eine Tastatur? Eine, hab's vorhin schon mal gezeigt, eine K95, eine Corsair K95 RGB Platinum. Das Ding da. Was wollen wir im nächsten Stream machen? Es gibt ja im Prinzip zwei Sachen noch zur Auswahl. So zwei größere, größere Dinger noch zur Auswahl. Und zwar das Dashboard zum Fernsteuern von den Programmen. Das ist halt ne Sache, die brauch ich selbst, weil wenn ich, beispielsweise wo ich den E3-Stream gezeigt hab, ich hab mir so ne rudimentäre Sache ja schon mal gebaut, da kann ich mir die Shortcuts nicht alle merken. Also hab ich mir einfach auf dem zweiten Bildschirm das Ganze aufgemacht und konnte es dann dort anklicken und es wurde halt hier angezeigt. Das war echt praktisch. Also wollen wir die Fernsteuerung machen vom zweiten Rechner oder vom zweiten Monitor aus, nächsten Stream, wollen wir uns mal angucken, wie man Corsair RGB Tastaturen ansteuern kann. Sodass man zum Beispiel anzeigen lassen können, wenn man einen Shortcut gedrückt hat, dass der gerade aktiv ist. Ich hab keine Ahnung, wie das geht. Ich hab nur auf GitHub gesehen, dass es eine Library gibt, die das macht. Wir könnten uns auch mal in dem Stream angucken, wie man Corsair Tastaturen RGB Beleuchtung programmiert. Was wollen wir denn im nächsten Stream machen? Netzwerk, Fernsteuerung oder Corsair RGB? Auch die Musik ist weg. Beides ist eine größere Geschichte. Und ich kann mich keine fünf Stunden konzentrieren. RGB, okay. Also mir ist egal. 24 Stunden Programming Stream. Ich bin ja immer noch begeistert, dass das so gut ankommt. Netzwerk. Stimmt. Und ich bräuchte dann wahrscheinlich eine Kamera für den Schreibtisch. Dass man sieht, dass die Tastatur leuchtet. Und sieht es ja langweilig aus. Dann machen wir erstmal Netzwerk. Dann machen wir erstmal Netzwerk. Ihr hört einfach gerne zu. Ein Tastatur-Cam. Ich habe es gepusht. So, ich mache mal kurz ein Release-Bild. Guck mal, ob das auch schön unabhängig läuft, alles. Weil ich glaube nämlich, dass das gar nicht die... Das kopiert das nicht mit, oder? Doch. Hä? Leute, das muss mir jetzt mal jemand erklären, das Cheggie-Nut. Warum findet denn... Wow! Wir haben ordentlich viele Trey-Eikens erzeugt. Warum findet ihr denn das Trey-Eiken? Das liegt doch hier überhaupt nicht. Das Trey-Eiken liegt hier. Warum findet ihr das überhaupt? Aber eigentlich ist es mir egal, dass es funktioniert. Das ist eine Ressource in der Exe? Ah! Also, mag sein. Ich habe das nicht eingestellt. Ich habe sie einfach nur reingetrocknet. Guckt. Einfach nur da. Also, wenn es eine Ressource ist, ist es auch gut. Nice. Wird es mit in die Exe gepuckt? Keine Ahnung. Das habe ich nicht eingestellt, dass es mit in die Exe gepackt wird. So, ich würde sagen, ich esse jetzt was. Und wenn der Ex am Start ist, spielen wir dann noch 2-2,5 Stunden Realm Royale. Mittlerweile, muss ich sagen... Zeige ich euch das mal kurz. Steam. Geh auf. Mittlerweile haben wir sogar schon ein paar Games gewonnen. Alter, geh mal auf. Ich würde eigentlich nur kurz was zeigen. Zack, zack, kein Bock. Also, immer Discord da macht. Discord, piss dich mal. Komm mal. Diamond Noob bin ich jetzt. Jetzt können wir mal gucken. Guck mal. Jetzt machen wir mal das Memetool an. Ups. Memetool machen wir mal an. Und Nu sollte hier eigentlich... Guckt. Man kann durchklicken. Es ist Overlay in Game. Was natürlich sehr, sehr nice ist. So, und um das mal zu demonstrieren. Weil es vorher in der Diskussion darüber gab. Es funktioniert nur in Borderless-Window. Wir können uns mal angucken, was passiert, wenn ich es auf Fullscreen stelle. Und versuche einzublenden. Passiert nichts. Also man sieht, es wird angezeigt. Aber es ist weg. Also das kann nicht funktionieren. Weil es halt exklusiv, ohne über den Windows DWM-Render-Dings zu gehen, auf den Bildschirm kommt. Es funktioniert nur in Borderless-Windows und dann ist es halt direkt am Start. Jetzt haben wir hier in Game. In Game unsere Meme-Action. Ja, ihr seht das Spiel nicht, weil es Fullscreen war. Aber es hat nicht funktioniert. Ja, für Fullscreen hätte ich Game Capture machen müssen. Irgendwie hat Breath of the Wild schon ziemlich nervigen Soundtrack gehabt an manchen Stellen. So, und nachdem wir jetzt... Jetzt seht ihr es auch. Jetzt habe ich kein Fenster zum Beenden. Und jetzt ist es ja auch gut, dass wir unser Tray-Icon haben, wo ich sagen kann, Exit. Dann ist es weg. Kirby-Gummy-Race. Die Musik ist aber geil. Die Musik ist aber geil. Also man sieht doch, es kackt nicht ab, wenn man schnell die Sache durchswitcht. Die Musik ist aber geil. Die Musik ist aber geil. Wenn man genau dazu einschaltet, ist das irgendwie verstörend. Das verstehe ich schon. Also nochmal angemerkt, nur weil ich das dafür verwende, um irgendwelche Minenbildchen durchzuklicken und anzuzeigen, heißt das nicht, dass man es dafür verwenden muss. Man könnte das auch für deutlich seriösere Zwecke verwenden, indem man einfach passende Einblendungen macht. Und der Vorteil ist halt einfach, ich sehe sie selbst, was bei reinem Overlay in OBS nicht so ist. Wow, Gachi-Buzz. Gibt es das eigentlich als ordentliches Skip? Das brauchen wir auch noch. Ich weiß gar nicht, was jetzt kommt, wenn ich weiter runter scroll. Ich will es gar nicht wissen. Das ist aber eine ziemlich schlechte Variante davon. So Leute, ich gehe jetzt was essen. Danach, je nachdem, ob der Erex da ist oder nicht, spüren wir noch zwei Stunden Renin Royale. Ich hoffe, euch hat's gefallen. Nächstes Mal werden wir uns dann die Netzwerkfunktionen widmen. Macht's gut. Bis denn. Tschüss. See you.", "segments": [{"id": 1, "start": 30.0, "end": 31.0, "text": "Hallo?"}, {"id": 2, "start": 31.0, "end": 32.0, "text": "Hallo?"}, {"id": 3, "start": 32.0, "end": 33.0, "text": "Hallo?"}, {"id": 4, "start": 33.0, "end": 34.0, "text": "Hallo?"}, {"id": 5, "start": 34.0, "end": 35.0, "text": "Hallo?"}, {"id": 6, "start": 35.0, "end": 63.08, "text": "Oh, der Ori-Sound-Rektor schlägt sich ein, weil..."}, {"id": 7, "start": 63.08, "end": 71.16, "text": "Oh, ich höre mich doppelt, ich muss auf der anderen Seite ausmachen."}, {"id": 8, "start": 71.16, "end": 79.4, "text": "Nein, nein, nein, ich spiele nicht heute, Ori, ich hab nur den Soundtrack an, aber,"}, {"id": 9, "start": 79.4, "end": 80.4, "text": "ha?"}, {"id": 10, "start": 80.4, "end": 81.4, "text": "Big Brain."}, {"id": 11, "start": 81.4, "end": 88.56, "text": "Wobei, hatten wir den nicht auch als Emote?"}, {"id": 12, "start": 88.56, "end": 106.6, "text": "Ah, ich muss den erstmal auf Twitter posten."}, {"id": 13, "start": 106.6, "end": 119.76, "text": "Twitter bestes Social Network, oder bestes Social Plattform, ist ja kein Social Network."}, {"id": 14, "start": 119.76, "end": 122.92, "text": "Aber Twitter ist beste Social-Gedöns-Plattform."}, {"id": 15, "start": 122.92, "end": 129.36, "text": "Und wisst ihr woran das liegt?"}, {"id": 16, "start": 129.36, "end": 131.36, "text": "Warum Twitter die beste Social Plattform ist?"}, {"id": 17, "start": 131.36, "end": 137.36, "text": "Oh, jetzt hab ich meinen Stream zugemacht hier auf der anderen Seite, jetzt seh ich"}, {"id": 18, "start": 137.36, "end": 138.36, "text": "den Chat gar nicht."}, {"id": 19, "start": 138.36, "end": 139.36, "text": "Lull."}, {"id": 20, "start": 139.36, "end": 158.0, "text": "So, erstmal posten."}, {"id": 21, "start": 158.0, "end": 163.72, "text": "Twitter ist die beste Social Plattform, weil das irgendwie eine gewisse Einstiegshürde"}, {"id": 22, "start": 163.72, "end": 166.08, "text": "hat und die Idioten das nicht checken."}, {"id": 23, "start": 166.08, "end": 169.4, "text": "Also die Deppen checken Twitter nicht, deswegen sind sie nicht auf Twitter und deswegen ist"}, {"id": 24, "start": 169.4, "end": 170.4, "text": "Twitter besser."}, {"id": 25, "start": 170.4, "end": 177.4, "text": "Sollte ich den Titel vielleicht noch schreiben, weiter programmieren oder sowas?"}, {"id": 26, "start": 177.4, "end": 192.24, "text": "Das ist richtig, das ist richtig, Big Brain."}, {"id": 27, "start": 192.24, "end": 198.76, "text": "Was zum Teufel ist Master Don, hab ich noch nie gehört."}, {"id": 28, "start": 198.76, "end": 201.8, "text": "Was ist Master Don?"}, {"id": 29, "start": 201.8, "end": 213.08, "text": "The Invisible Darkness, da ist der EQ nicht Big Brain genug für mich."}, {"id": 30, "start": 213.08, "end": 222.28, "text": "So, ich wollte das jetzt noch auf Twitter posten."}, {"id": 31, "start": 222.28, "end": 246.4, "text": "Oh, ich weiß nicht, was ich hier gesagt habe…"}, {"id": 32, "start": 246.4, "end": 274.92, "text": "So, wieder, Twitter ist raus, Tweet ist raus, kann sein losgehen, so, also, ähm, 17 Uhr,"}, {"id": 33, "start": 274.92, "end": 276.92, "text": "denke ich, sind die meisten glücklicherweise schon daheim."}, {"id": 34, "start": 276.92, "end": 283.92, "text": "Max ist Anwendungs-Entwickler geworden, statt System-Indikator."}, {"id": 35, "start": 283.92, "end": 288.32, "text": "Eigentlich, äh, eigentlich war ich da schon immer."}, {"id": 36, "start": 288.32, "end": 295.08, "text": "Deswegen mache ich auf der Arbeit eigentlich auch kaum noch Admin-Geschichten."}, {"id": 37, "start": 295.08, "end": 301.64, "text": "Es haben mich in letzter Zeit öfters Leute gefragt, was ich auf der Arbeit mache."}, {"id": 38, "start": 301.64, "end": 306.44, "text": "Ich habe mir da ein bisschen Gedanken zugemacht, wie ich das erklären kann, aber ich versuche"}, {"id": 39, "start": 306.44, "end": 307.44, "text": "das mal zu zeigen."}, {"id": 40, "start": 307.44, "end": 311.68, "text": "Also, schwierig zu zeigen, weil wir haben bloß einen Pull-Request."}, {"id": 41, "start": 311.68, "end": 314.08, "text": "Ich versuche das euch mal so ein bisschen zu erklären."}, {"id": 42, "start": 314.08, "end": 318.68, "text": "Was zum Teufel ist Master Dawn, das habe ich ja noch nie gehört."}, {"id": 43, "start": 318.68, "end": 332.68, "text": "Ah, yet another social network, ein dezentralisiertes Microplogging-Netzwerk, ja, jetzt schauen"}, {"id": 44, "start": 332.68, "end": 343.92, "text": "wir mal die richtigen BuzzBuds am Start, aber beste, beste BuzzBuds, also beste Bullshit-Bingo-Sache"}, {"id": 45, "start": 343.92, "end": 350.24, "text": "war gar nicht auf der E3, sondern die Apple Keynote, die er da gehalten hat, wo er dann"}, {"id": 46, "start": 350.24, "end": 354.44, "text": "angefangen hat zu erzählen, Deep Technology Accelerated Workflow, das könnte auch in"}, {"id": 47, "start": 354.44, "end": 362.28, "text": "irgendeinem Hip-Hop-Song vorkommen, so, weißt du, Deep Technology Accelerated Workflow,"}, {"id": 48, "start": 362.28, "end": 363.28, "text": "mit Bitches oder so."}, {"id": 49, "start": 363.28, "end": 371.52, "text": "Ah ja, gleich da, gleich da, wäre nicht schlecht."}, {"id": 50, "start": 371.52, "end": 376.84, "text": "Siehste, deswegen, es fragen ja auch immer Leute im Stream, warum, Max, warum willst"}, {"id": 51, "start": 376.84, "end": 378.6, "text": "du die Overlays sehen?"}, {"id": 52, "start": 378.6, "end": 383.48, "text": "Genau aus so einem Grund will ich die Overlays sehen, weil ich sie sonst vergesse rauszumachen,"}, {"id": 53, "start": 383.48, "end": 384.48, "text": "das suckt."}, {"id": 54, "start": 384.48, "end": 388.6, "text": "Genau, also nachdem ich ja in der letzten Zeit ein paar Leute gefragt habe auf der Arbeit,"}, {"id": 55, "start": 388.6, "end": 394.04, "text": "was ich denn mache, ich versuche das mal hier an unserem GitHub-Repo für das Memboard"}, {"id": 56, "start": 394.04, "end": 399.72, "text": "zu demonstrieren, das ist ein bisschen klein, ja, und außer einem Pull-Request haben wir"}, {"id": 57, "start": 399.72, "end": 405.52, "text": "nix, aber eine der Sachen, die ich auf der Arbeit mache, und das ist immer schwierig,"}, {"id": 58, "start": 405.52, "end": 409.32, "text": "wenn ich einfach sage, ich kümmere mich um Software-Repos und sonst was, da kann man"}, {"id": 59, "start": 409.32, "end": 419.24, "text": "sich immer so schwer, so schwer was drunter vorstellen, meine Tür klappert, das ist ja"}, {"id": 60, "start": 419.24, "end": 424.24, "text": "nervig, aber zum Beispiel, das ist das GitHub-Repo, wo sich jeder hier das Tool angucken"}, {"id": 61, "start": 424.24, "end": 426.96, "text": "kann, was ich, was ich programmiere gerade."}, {"id": 62, "start": 426.96, "end": 434.96, "text": "Und einer der Hauptgründe, warum GitHub so beliebt ist, und warum das so viele Leute"}, {"id": 63, "start": 434.96, "end": 440.92, "text": "benutzen ist, weil man da zusammenarbeiten kann, ganz gut, und das heißt, jeder kann"}, {"id": 64, "start": 440.92, "end": 445.68, "text": "sich jetzt diesen Code hier neben den Showclan haben, was ändern, und wenn er möchte, dass"}, {"id": 65, "start": 445.68, "end": 449.52, "text": "seine Änderung quasi in das Hauptprojekt wieder rein kommen, macht er ein Pull-Request."}, {"id": 66, "start": 449.52, "end": 454.76, "text": "So ungefähr in der Richtung, das ist ja nix GitHub-spezifisches, das ist eigentlich eher"}, {"id": 67, "start": 454.76, "end": 462.04, "text": "Basket-spezifisches, also was Versionsverwaltung-spezifisches, dass man eben sagt, hey, ich mach mir den"}, {"id": 68, "start": 462.04, "end": 465.68, "text": "eigenen Branch auf, entwickle da neue Dinger drinnen, und dann reiche ich das Ganze wieder"}, {"id": 69, "start": 465.68, "end": 466.68, "text": "ein."}, {"id": 70, "start": 466.68, "end": 471.04, "text": "So, und so machen wir das auf der Arbeit auch, plus, dass wir da nicht ein Mini-Repo haben,"}, {"id": 71, "start": 471.04, "end": 476.08, "text": "sondern ein paar ziemlich große, mit Source-Code von verschiedenen Software-Projekten drin,"}, {"id": 72, "start": 476.08, "end": 480.2, "text": "ein riesengroßes und der Rest ein bisschen kleiner."}, {"id": 73, "start": 480.2, "end": 486.84, "text": "So, und dementsprechend kommt da nicht ein Merch-Request, beziehungsweise nicht ein Pull-Request,"}, {"id": 74, "start": 486.84, "end": 493.2, "text": "wie es bei GitHub heißt, sondern, sag mal mal so, im Monat ungefähr 60, so über den"}, {"id": 75, "start": 493.2, "end": 498.44, "text": "Daumen gepeilt jetzt mal, so ungefähr, ja, das schwankt immer ein bisschen, aber ich"}, {"id": 76, "start": 498.44, "end": 501.92, "text": "kann es euch jetzt auch schlecht nicht zeigen, weil dann müsste ich ja mehr oder weniger"}, {"id": 77, "start": 501.92, "end": 508.76, "text": "was, ja, revealen, leak, expose, und so ungefähr 60 für das große, für das große Repo."}, {"id": 78, "start": 508.76, "end": 514.68, "text": "Kommt ungefähr 60 neue Features oder, ja, zum größten Teil tatsächlich irgendwelche"}, {"id": 79, "start": 514.68, "end": 515.68, "text": "neuen Sachen."}, {"id": 80, "start": 515.68, "end": 521.4, "text": "So, und ich kümmere mich drum, ich gucke mir das dann an, was die Leute gemacht haben,"}, {"id": 81, "start": 521.4, "end": 525.92, "text": "gucke mir das an, also hier ist jetzt beispielsweise eins offen, bei uns sind es 260 Stück, mit"}, {"id": 82, "start": 525.92, "end": 530.44, "text": "auch ein bisschen umfangreicheren Änderungen als das hier, ach wobei, ne, das kommt sogar"}, {"id": 83, "start": 530.44, "end": 531.44, "text": "ungefähr hin."}, {"id": 84, "start": 531.44, "end": 534.4, "text": "Die Dinger bei uns auf der Arbeit sind ungefähr ähnlich umfangreich wie der Pull-Request"}, {"id": 85, "start": 534.4, "end": 537.76, "text": "hier, so zumindest von Zeilen geändert."}, {"id": 86, "start": 537.76, "end": 541.76, "text": "Wobei dies oftmals ein bisschen komplizierter ist durchzublicken."}, {"id": 87, "start": 541.76, "end": 549.16, "text": "So, dann nehme ich mir das, gucke mir das an, gebe da mal einen Senf dazu ab, dann haben"}, {"id": 88, "start": 549.16, "end": 556.04, "text": "wir noch so einen, das gibt es hier glaube ich auf GitHub nicht, dass man quasi noch"}, {"id": 89, "start": 556.04, "end": 559.0, "text": "Daumen hoch geben kann, so nach dem Motto, ja, ich hab mir das angeguckt, ich find das"}, {"id": 90, "start": 559.0, "end": 565.68, "text": "gut, dann müssen mindestens zwei Leute Daumen hoch gegeben haben, dass bei uns das überhaupt"}, {"id": 91, "start": 565.68, "end": 571.64, "text": "bis zu dem Punkt kommt, dass ich das mir angucke und das gemercht werden kann, gucke mir das"}, {"id": 92, "start": 571.64, "end": 575.36, "text": "Ganze an, gebe hier noch ein bisschen mal einen Senf dazu, wenn ich das nicht verstehe"}, {"id": 93, "start": 575.36, "end": 579.4, "text": "oder wenn ich überhaupt nicht checke um was es geht, frage ich den Typ nochmal was er"}, {"id": 94, "start": 579.4, "end": 583.64, "text": "gemacht hat, und dann kommt der Knackpunkt, entweder es passt zu den Änderungen die andere"}, {"id": 95, "start": 583.64, "end": 587.96, "text": "gemacht haben oder es passt nicht, und das ist immer so ein bisschen das komplizierteste,"}, {"id": 96, "start": 587.96, "end": 595.0, "text": "und das ist eigentlich auch das wo die meiste Zeit, wo die Hälfte der Zeit rauf geht, wenn"}, {"id": 97, "start": 595.0, "end": 599.16, "text": "man sich vorstellt mal ein großes Software repo und da arbeiten, sagen wir mal es kommen"}, {"id": 98, "start": 599.16, "end": 606.24, "text": "60 relativ umfangreiche Changes pro Monat, da kann das durchaus sein, dass die eine Änderung"}, {"id": 99, "start": 606.24, "end": 612.44, "text": "nicht unbedingt so gut mit der anderen harmoniert, drücken wir das mal so aus, das kann so vorkommen,"}, {"id": 100, "start": 612.44, "end": 616.92, "text": "also meistens ist es relativ unabhängig, aber das kommt schon ab und an mal vor, ja,"}, {"id": 101, "start": 616.92, "end": 619.36, "text": "und da muss ich mit die Leute schlappen und sagen, guck mal was hast du da gemacht, guck"}, {"id": 102, "start": 619.36, "end": 623.92, "text": "mal was hast du da gemacht, dass dann irgendwie so ein Best-of rauskommt am Ende, dass das"}, {"id": 103, "start": 623.92, "end": 627.84, "text": "alles funktioniert, und wenn das dann fertig ist, dann machen wir eine Beta-Version aus"}, {"id": 104, "start": 627.84, "end": 632.36, "text": "der ganzen Sache, dann probieren wir das aus, testen das, dann irgendwann machen wir mal"}, {"id": 105, "start": 632.36, "end": 639.64, "text": "so eine Art Release Candidate-Version draus, man darf dann mal die Qualitätssicherung"}, {"id": 106, "start": 639.64, "end": 645.92, "text": "und alle anderen Abteilungen, die ihr selbst noch dazu abgeben, und irgendwann wird dann"}, {"id": 107, "start": 645.92, "end": 650.12, "text": "diese Version, geht das live, und dann geht das ganze wieder von vorne los, so, ungefähr"}, {"id": 108, "start": 650.12, "end": 658.72, "text": "das mache ich auf der Arbeit, zur Erklärung, ja, das klingt jetzt vielleicht ein bisschen,"}, {"id": 109, "start": 658.72, "end": 664.48, "text": "hat man das verstanden, hat man verstanden was ich mache, ich habe mir nämlich ein bisschen,"}, {"id": 110, "start": 664.48, "end": 671.0, "text": "ich habe mir überlegt, wie kann ich das jetzt sinnvoll erklären, das hat kaum noch was"}, {"id": 111, "start": 671.0, "end": 676.64, "text": "mit Administrator an sich zu tun, also gar nicht mehr, ich habe Systemintegrator gelernt,"}, {"id": 112, "start": 676.64, "end": 685.52, "text": "das ist was aber auch, so, und das mache ich schon im Endeffekt jetzt seit, mal überlegen,"}, {"id": 113, "start": 685.52, "end": 703.24, "text": "seit 2012, nee, ja doch, so, so 2012 rum, würde ich sagen, mache ich das schon, in"}, {"id": 114, "start": 703.24, "end": 709.72, "text": "dem Dreh, dementsprechend kenne ich mich mit Git auch ganz gut aus, und ich kann euch"}, {"id": 115, "start": 709.72, "end": 713.76, "text": "sagen, man kann mit Git alles machen, ob es eine sinnvolle Idee ist, ist was anderes,"}, {"id": 116, "start": 713.76, "end": 726.52, "text": "aber man kann alles machen, noch so bescheuert, die bescheuertsten Sachen, ja, dementsprechend"}, {"id": 117, "start": 726.52, "end": 730.88, "text": "programmiere ich in letzter Zeit relativ wenig selbst, bis auf so ein paar kleine Hobbydinger,"}, {"id": 118, "start": 730.88, "end": 734.84, "text": "also nee, ich nenne es zwar Hobbydinger, ja, also es sind schon sinnvolle Sachen auf"}, {"id": 119, "start": 734.84, "end": 746.04, "text": "der Arbeit, Arbeit ist nichts großartiges oder so, hast du dir ein paar Bitcoins gekauft,"}, {"id": 120, "start": 746.04, "end": 752.12, "text": "während die zurzeit noch günstig sind, nee, habe ich nicht, das muss jeder selber wissen,"}, {"id": 121, "start": 752.12, "end": 761.8, "text": "ob er sich Kryptowährung oder sowas holen will, Moment, was, was macht denn eigentlich,"}, {"id": 122, "start": 761.8, "end": 776.2, "text": "Alter, okay, abbrechen, diese Programmingkategorie auf Twitch, das ist mega fail, das ist mega"}, {"id": 123, "start": 776.2, "end": 794.08, "text": "fail, ist Git Turing complete, nee, kannste ja schlecht sagen, Git, kannste keine Logik"}, {"id": 124, "start": 794.08, "end": 800.76, "text": "programmieren, und nachdem du Git Hooks in allen Sprachen machen kannst, die natürlich"}, {"id": 125, "start": 800.76, "end": 806.48, "text": "schon, so, also, nachdem schon wieder die Frage kam, sag mal, können wir, mal Frage an die"}, {"id": 126, "start": 806.48, "end": 813.36, "text": "Mods, können wir noch ein Kommando machen für das Memetool, was das macht, dass ich"}, {"id": 127, "start": 813.36, "end": 820.0, "text": "das dann immer erklären muss, das Screenshot Tool ist ja erstmal auf Eis, das wird erst"}, {"id": 128, "start": 820.0, "end": 824.32, "text": "wieder aktuell, wenn ich aktiv anfange mit der BDO zu spielen, also was ich mache ist"}, {"id": 129, "start": 824.32, "end": 827.64, "text": "folgendes, ich meine, ihr habt ja im Prinzip schon gerade in Auktionen gesehen, ne, das"}, {"id": 130, "start": 827.64, "end": 831.76, "text": "hat vielleicht gar nicht aufgefallen, aber die, die dabei sind, die kennen das natürlich,"}, {"id": 131, "start": 831.76, "end": 842.04, "text": "das Memetool macht sowas hier, das Overlaid, transparente PNGs und animierte Gips, und"}, {"id": 132, "start": 842.04, "end": 846.44, "text": "es Overlaid die nicht nur, also, es zeigt die nicht nur an, das ist ein richtiges Overlaid,"}, {"id": 133, "start": 846.44, "end": 851.28, "text": "also sprich, man kann durchklicken, also sprich, das ist transparent, das Bild, ist über"}, {"id": 134, "start": 851.28, "end": 856.8, "text": "allen anderen Anwendungen drüber, das war gar nicht so einfach, und man sieht, es nimmt"}, {"id": 135, "start": 856.8, "end": 861.16, "text": "sich auch keinen Fokus, also wenn ich hier, ne, ihr seht es im Hintergrund, das Strakentrop"}, {"id": 136, "start": 861.16, "end": 869.08, "text": "bleibt aktiv, selbst wenn ich es ein- und ausblende, ne, Big Brain, das macht das, und"}, {"id": 137, "start": 869.08, "end": 872.8, "text": "wir haben das das letzte Mal eigentlich auch ganz gut hingekriegt, es fehlen jetzt noch"}, {"id": 138, "start": 872.8, "end": 879.4, "text": "ein paar Sachen, also es fehlen noch eine wichtige Sache, die machen wir heute, wo ich"}, {"id": 139, "start": 879.4, "end": 884.56, "text": "der Meinung bin, dass es essentiell, dass die geht, und das nächste Mal, also da werden"}, {"id": 140, "start": 884.56, "end": 888.68, "text": "wir heute wahrscheinlich auch ein bisschen für brauchen, so, und das nächste, was wir"}, {"id": 141, "start": 888.68, "end": 893.56, "text": "machen ist, das ist aber in einem der nächsten Streams, wir machen ein Dashboard, was übers"}, {"id": 142, "start": 893.56, "end": 899.24, "text": "Netzwerk funktioniert, weil aktuell ist es ja so, das liest hier, ich zeig's mal, ist"}, {"id": 143, "start": 899.24, "end": 907.4, "text": "die Ori Musik zu laut, oder passt das so, sag mal, ob die Musik passt, ähm, aktuell"}, {"id": 144, "start": 907.4, "end": 914.92, "text": "ist es so, das liest hier hardcoded noch aus einem Ordner die Bilder ein, so, ich zeig's"}, {"id": 145, "start": 914.92, "end": 918.6, "text": "mal, so, und hier liegen die Bilder drinne, also alle Bilder, die ich hier als Auferlay"}, {"id": 146, "start": 918.6, "end": 925.64, "text": "anzeigen kann, ne, zum Beispiel, ich starte das ganze nochmal, zum Beispiel hier mein"}, {"id": 147, "start": 925.64, "end": 933.04, "text": "Plon, bam, mein Plon, zeigt da an, so, das ist natürlich nicht schön, wenn man hier"}, {"id": 148, "start": 933.04, "end": 938.56, "text": "wie hardcoded irgendwelche Pfade drin hat, oder so, und eine Sache, die ich, bisschen"}, {"id": 149, "start": 938.56, "end": 944.56, "text": "leiser, ok, ja, was denn, Ju, Just Marv sagt etwas lauter, Hype sagt, passt, White Tiger"}, {"id": 150, "start": 944.56, "end": 950.88, "text": "Sinon sagt, bisschen leiser, so, ich hab jetzt drei Antworten, und drei Leute sagen was"}, {"id": 151, "start": 950.88, "end": 956.84, "text": "Unterschiedliches, lull, ich glaub, das kommt auch ein bisschen auf den Soundtrack an, was"}, {"id": 152, "start": 956.84, "end": 963.36, "text": "gerade läuft, das, das ist glaube ich jetzt gerade recht angenehm, guck mal mal, also,"}, {"id": 153, "start": 963.36, "end": 967.24, "text": "wenn es irgendwie zu laut ist, sagt einfach Bescheid, so, ich muss da gleich mal was zu"}, {"id": 154, "start": 967.24, "end": 980.24, "text": "trinken holen, ja, jetzt wirklich ein bisschen laut, wir machen mal einen Tickenleiser,"}, {"id": 155, "start": 980.24, "end": 998.72, "text": "so, das ist ganz gut, denke ich, hallo, this is Snax, Agis, moin, so, was wollte ich gerade"}, {"id": 156, "start": 998.72, "end": 1005.76, "text": "sagen, genau, eine ganz wichtige Funktion, die noch fehlt, die noch unbedingt sein muss,"}, {"id": 157, "start": 1005.76, "end": 1012.2, "text": "ist, dass man hier Bilder, während das läuft, hinzufügen kann, und auch entfernen kann,"}, {"id": 158, "start": 1012.2, "end": 1017.16, "text": "aber das kommt so dann mit, also zum Beispiel, wenn ich mal angenommen, ich hab das jetzt"}, {"id": 159, "start": 1017.16, "end": 1022.28, "text": "laufen im Hintergrund, ich hab irgendeinen Stream an, oder sonst was in der Richtung,"}, {"id": 160, "start": 1022.28, "end": 1027.56, "text": "ich denk mir jetzt so, ey, guck mal, ich hätte jetzt hier gerne noch ein paar Bilder dabei,"}, {"id": 161, "start": 1027.56, "end": 1031.28, "text": "dann kann ich das Bild hier einfach reinziehen, und kann es benutzen, ohne dass ich den ganzen"}, {"id": 162, "start": 1031.28, "end": 1038.36, "text": "Scheiß neu starten muss, das finde ich ganz praktisch, vor allem auch in Kombination,"}, {"id": 163, "start": 1038.36, "end": 1043.2, "text": "was wir dann nächsten Streams machen, ist, dass wir das Ding noch netzwerkfähig machen,"}, {"id": 164, "start": 1043.2, "end": 1047.48, "text": "dass man es quasi von einem zweiten Rechner aus fernsteuern kann, das ist dann quasi"}, {"id": 165, "start": 1047.48, "end": 1055.24, "text": "so ein Elgato Stream Deck Light selbst gemacht, wobei ich mir nicht sicher bin, hat jemand"}, {"id": 166, "start": 1055.24, "end": 1074.64, "text": "von euch das Ding hier? Hat das jemand? Mich würde nämlich mal interessieren, wie das"}, {"id": 167, "start": 1074.64, "end": 1081.88, "text": "funktioniert, ich hab es nicht ausprobiert, ob das quasi die Bilder wirklich als Overlay"}, {"id": 168, "start": 1081.88, "end": 1088.92, "text": "anzeigt, sodass es der Streamer auch sieht, oder ob das nur die Bilder im OBS anzeigt,"}, {"id": 169, "start": 1088.92, "end": 1100.0, "text": "so wie den Text hier zum Beispiel, das würde mich interessieren. A Pavilion Man fragt,"}, {"id": 170, "start": 1100.0, "end": 1108.72, "text": "ob ich mal drüber nachgedacht hab, die Watts auf YouTube hochzuladen, nö, weil man kann"}, {"id": 171, "start": 1108.72, "end": 1115.12, "text": "die, erstens kann man die Sachen angucken auf Twitch, oder aber, du gehst auf die Archivseite"}, {"id": 172, "start": 1115.12, "end": 1121.76, "text": "vom Sebaro, da hast du keine Werbung, du hast allerdings auch kein Twitch Chat dabei, und"}, {"id": 173, "start": 1121.76, "end": 1130.56, "text": "du hast alle Aufzeichnungen seit September. Ich kann euch das mal zeigen, hat er nämlich"}, {"id": 174, "start": 1130.56, "end": 1155.36, "text": "sehr schön gemacht, hat das Sebaro gebastelt hier, www.wobblers.tv, so, und da kann man"}, {"id": 175, "start": 1155.36, "end": 1162.52, "text": "jetzt nämlich sagen, Archiv Twitch, ja, es stand sich schnell, ist die Seite, nett, das"}, {"id": 176, "start": 1162.52, "end": 1167.8, "text": "stimmt, aber ist doch egal, so, und dann geht man hier auf Archiv, da, nicht auf Twitch,"}, {"id": 177, "start": 1167.8, "end": 1181.12, "text": "auf Archiv, und dann sieht man, da sind fast alle Streams drin, ah, das ist der E3 Stream,"}, {"id": 178, "start": 1181.12, "end": 1191.08, "text": "das ist alles drin, könnt ihr hier rumscrollen, sogar Tooth the Moon ist drinne, Bible Thump,"}, {"id": 179, "start": 1191.08, "end": 1198.12, "text": "Bidiorio, jetzt Overwatch, geht jetzt alles drinne, seit, hier sogar, sogar, ich hab's"}, {"id": 180, "start": 1198.12, "end": 1203.84, "text": "gehabt, ich hab's gesehen, sogar der Übertakter-Stream ist drinne, furchtbar neuer Rechner-Übertakter,"}, {"id": 181, "start": 1203.84, "end": 1208.8, "text": "alles seit September, fehlen ein paar Streams davor, aber das ist nicht so, nicht weiter"}, {"id": 182, "start": 1208.8, "end": 1217.32, "text": "wild, könnt ihr euch angucken, wer es sehen will, also wer ein Archiv braucht, so, auf"}, {"id": 183, "start": 1217.32, "end": 1222.64, "text": "geht's, also, wie gesagt, ich halte es für wichtig, dass man Bilder hinzufügen kann,"}, {"id": 184, "start": 1222.64, "end": 1250.84, "text": "so, und da ich nicht vergess auszumachen, will ich die Overlays halt selbst sehen, genau,"}, {"id": 185, "start": 1250.84, "end": 1255.32, "text": "und ich will das, ich will es so machen, dass ich beispielsweise sagen kann, hier, während"}, {"id": 186, "start": 1255.32, "end": 1259.2, "text": "das läuft, will ich einfach auch ein paar Bilder entfernen, vielleicht will ich manche"}, {"id": 187, "start": 1259.2, "end": 1266.2, "text": "nicht verwenden oder so, und vor allem will ich neue reinziehen, aktuell ist das auch"}, {"id": 188, "start": 1266.2, "end": 1276.08, "text": "noch ein bisschen umständlich, weil man kann Bilder, also die Overlays hier, kann man nur"}, {"id": 189, "start": 1276.08, "end": 1281.0, "text": "mit Shortcuts aufrufen, das ist super, wenn man quasi spielt und zwischendrin irgendwie"}, {"id": 190, "start": 1281.0, "end": 1285.44, "text": "sagen will, null, also sprich, wenn ich jetzt irgendwas am Spielen will und will mal kurz"}, {"id": 191, "start": 1285.44, "end": 1290.52, "text": "null machen, das ist mit Shortcuts natürlich am besten, aber wenn man dann irgendwann"}, {"id": 192, "start": 1290.52, "end": 1300.96, "text": "32 hat und sich theoretisch 32 Shortcuts vergeben muss, ist das vielleicht ein bisschen viel,"}, {"id": 193, "start": 1300.96, "end": 1309.28, "text": "aber irgendwann gehen an mir auch die Shortcuts aus, ne, deswegen werden wir auch noch einbauen,"}, {"id": 194, "start": 1309.28, "end": 1314.12, "text": "dass man einfach Bilder reinlegen kann, ohne Shortcuts, und die kann man dann halt über"}, {"id": 195, "start": 1314.12, "end": 1318.32, "text": "das Dashboard, was wir in einem der nächsten Streams programmieren werden, dann aufrufen"}, {"id": 196, "start": 1318.32, "end": 1323.36, "text": "vom zweiten Rechner aus, ist dann ganz praktisch, ich weiß jetzt nicht, hat jemand das Elgato"}, {"id": 197, "start": 1323.36, "end": 1332.88, "text": "Streamdeck, ich hab's jetzt nicht gesehen, so, dann fangen wir mal an, und wir haben aufgehört"}, {"id": 198, "start": 1332.88, "end": 1341.52, "text": "mit, genau, wir haben das letzte Mal rausgekriegt, dass es relativ einfach ist, das hat mir"}, {"id": 199, "start": 1341.52, "end": 1346.52, "text": "sogar jemand im Chat erzählt, ich wusste gar nicht, dass es das gibt, wer braucht schon"}, {"id": 200, "start": 1346.52, "end": 1356.16, "text": "32 Memes, das ist sogar noch viel zu wenig, da muss da eigentlich noch viel mehr rein,"}, {"id": 201, "start": 1356.16, "end": 1360.04, "text": "aber das ist alles kein Ding, man kann sich dann nämlich die wichtigsten, kann man sich"}, {"id": 202, "start": 1360.04, "end": 1364.8, "text": "dann einfach auf irgendwelche Shortcuts legen, die man halt nicht so oft braucht, die man"}, {"id": 203, "start": 1364.8, "end": 1371.32, "text": "halt auch nicht aus versehen, während man ein Spiel drückt, du musst das nicht vom"}, {"id": 204, "start": 1371.32, "end": 1376.76, "text": "zweiten Rechner aus starten, du kannst es natürlich auch vom zweiten Monitor aufmachen,"}, {"id": 205, "start": 1376.76, "end": 1379.72, "text": "vom gleichen Rechner, geht natürlich auch, man kann es auch auf dem gleichen Monitor"}, {"id": 206, "start": 1379.72, "end": 1383.4, "text": "aufmachen, das ist aber ein bisschen schwierig, auf dem gleichen Monitor was zu spielen,"}, {"id": 207, "start": 1383.4, "end": 1387.6, "text": "plus das Dashboard zu bedienen, also wenn du das hinkriegst, kannst du das machen, das"}, {"id": 208, "start": 1387.6, "end": 1391.96, "text": "ist überhaupt kein Problem, das funktioniert, kannst du im Prinzip starten, wo du willst,"}, {"id": 209, "start": 1391.96, "end": 1396.68, "text": "das geht über das Netzwerk, du kannst das auch auf dem Tablet starten, wenn du mir"}, {"id": 210, "start": 1396.68, "end": 1404.64, "text": "das Programm ausführen kannst, aber ja. So und wir haben es jetzt mal herausgefunden,"}, {"id": 211, "start": 1404.64, "end": 1412.12, "text": "es ist relativ einfach, einen Ordner zu überwachen auf Änderungen, also sprich, ob hier Bilder"}, {"id": 212, "start": 1412.12, "end": 1415.8, "text": "unbenannt werden, ob hier Bilder hinzugefügt werden oder gelöscht werden, ich war mir"}, {"id": 213, "start": 1415.8, "end": 1424.0, "text": "das letzte Mal bloß nicht so ganz sicher, wie wir das jetzt gescheit einbauen, das ganze,"}, {"id": 214, "start": 1424.0, "end": 1430.52, "text": "was wir heute auch noch machen ist, wir machen, das machen wir als erstes, wir machen einen"}, {"id": 215, "start": 1430.52, "end": 1436.52, "text": "Tray-Icon, einen Tray-Icon, wo man das ausschalten kann, weil im Prinzip ist es ja so, dass"}, {"id": 216, "start": 1436.52, "end": 1441.52, "text": "ich jetzt hier eine Konsole habe, das ist ja nur zu Debug-Zwecken, die Konsole, das heißt"}, {"id": 217, "start": 1441.52, "end": 1445.8, "text": "in der Konsole kann ich zuklicken, aber normalerweise habe ich ja gar keine Konsole, das heißt"}, {"id": 218, "start": 1445.8, "end": 1449.92, "text": "ich habe nichts, wo ich das Programm ausmachen kann, und ein Programm, was man nicht ausmachen"}, {"id": 219, "start": 1449.92, "end": 1457.28, "text": "kann, ist vielleicht nicht die benutzerfreundlichste Sache, das heißt wir machen uns einen Tray-Icon,"}, {"id": 220, "start": 1457.28, "end": 1463.76, "text": "wenn man da rechts draufklickt und sagt exit, dann geht es aus, also auch nichts großartiges,"}, {"id": 221, "start": 1463.76, "end": 1469.48, "text": "kompliziert das, das machen wir zuerst, weil das ist simpel, zumindest glaube ich das,"}, {"id": 222, "start": 1469.48, "end": 1475.88, "text": "weil ich habe das in WPF noch nicht gemacht, WPF selbst hat keinen Tray-Icon, fragt mich"}, {"id": 223, "start": 1475.88, "end": 1481.12, "text": "nicht warum, Microsoft hat sich gedacht, ja das Tray-Icon gucke ich mir auch bei deinem"}, {"id": 224, "start": 1481.12, "end": 1493.64, "text": "Pull-Request ab, weil ich habe keine Ahnung, wie das funktioniert, aha, das Elgato-Ding"}, {"id": 225, "start": 1493.64, "end": 1498.52, "text": "kann OBS-Overlays, das wird aber auf dem Knopf angezeigt, ja da finde ich Mines dann noch"}, {"id": 226, "start": 1498.52, "end": 1507.84, "text": "viel besser, deine Stream Deck ist outdated, overrated, gebaited, meme board activated,"}, {"id": 227, "start": 1507.84, "end": 1518.72, "text": "so, dann machen wir das mal, gucken wir uns wirklich bei seinem Pull-Request ab, wie das"}, {"id": 228, "start": 1518.72, "end": 1524.84, "text": "mit dem Tray-Icon funktioniert, aber ich habe mal im Vorfeld schon geguckt, also das ist"}, {"id": 229, "start": 1524.84, "end": 1532.08, "text": "auch nicht sonderlich schwierig, wir müssen bloß gucken, was wir für einen Icon machen,"}, {"id": 230, "start": 1532.08, "end": 1536.08, "text": "genau das gibt es hier nämlich diese komische Tray-Icon Library, die nehmen wir dafür, die"}, {"id": 231, "start": 1536.08, "end": 1554.52, "text": "verwendet ihr hier glaube ich in seinem Pull-Request auch, ja, du kannst transparente PNGs overlayen"}, {"id": 232, "start": 1554.52, "end": 1565.32, "text": "mit GIFs und nicht transparente GIFs und halt Bilder, alle möglichen Bilder die du willst,"}, {"id": 233, "start": 1565.32, "end": 1568.84, "text": "also sprich du hast den Vorteil dadurch, du siehst die Dinger halt selbst und kannst"}, {"id": 234, "start": 1568.84, "end": 1575.0, "text": "die per Shortcut, das heißt du brauchst keine Software wo du Bilder anklickst oder sowas,"}, {"id": 235, "start": 1575.0, "end": 1578.52, "text": "kannst die per Shortcut dann overlayen, das ist halt für Streamer und Leute die Videos"}, {"id": 236, "start": 1578.52, "end": 1584.16, "text": "machen ganz praktisch, stell dir vor du spielst was und willst dann kurz, gehst in Deckung,"}, {"id": 237, "start": 1584.16, "end": 1589.52, "text": "hast voll auf den Sack gekriegt und willst hier mal das einblenden, das geht halt sonst"}, {"id": 238, "start": 1589.52, "end": 1592.52, "text": "nicht so einfach und das Schöne daran ist, du siehst das, das heißt du vergisst sie"}, {"id": 239, "start": 1592.52, "end": 1600.88, "text": "auch nicht auszumachen, ein weiterer Vorteil ist, es ist zwar ein eigenes Fenster aber das"}, {"id": 240, "start": 1600.88, "end": 1606.84, "text": "haben wir geschickt gefaked, man kann nämlich komplett durchklicken und das ist das geilste,"}, {"id": 241, "start": 1606.84, "end": 1610.04, "text": "das crappt auch beim aufmachen keinen Fokus, also sprich wenn ich jetzt hier im Hintergrund"}, {"id": 242, "start": 1610.04, "end": 1616.92, "text": "etwas spiele und das overlay an und aus mache, hat es überhaupt keine Auswirkungen drauf,"}, {"id": 243, "start": 1616.92, "end": 1617.92, "text": "das macht das."}, {"id": 244, "start": 1617.92, "end": 1622.24, "text": "So und was wir heute machen ist, wir basteln Tray-Icon dafür, dass man das Programm natürlich"}, {"id": 245, "start": 1622.24, "end": 1626.84, "text": "auch mal an und ausschalten kann, was nicht schlecht ist und dass man automatisch Bilder"}, {"id": 246, "start": 1626.84, "end": 1629.32, "text": "und Memes hinzufügen kann und löschen kann während das läuft."}, {"id": 247, "start": 1629.32, "end": 1644.04, "text": "Ach es ist Triggered, Triggered, eventuell wenn man das Numpad als Shortcut-Plattform"}, {"id": 248, "start": 1644.04, "end": 1651.56, "text": "nutzt, Umschaltbar-Aktionsleisten, ja sowas in der Richtung zum Beispiel, ja das ist keine"}, {"id": 249, "start": 1651.56, "end": 1652.56, "text": "schlechte Idee."}, {"id": 250, "start": 1652.56, "end": 1661.52, "text": "Das finde ich ist eine super Idee, also Crypto84 wenn ich das richtig verstehe, meinst du"}, {"id": 251, "start": 1661.52, "end": 1666.16, "text": "man könnte das Numpad quasi für Shortcuts verwenden, dass man dann quasi sagt, man"}, {"id": 252, "start": 1666.16, "end": 1673.84, "text": "belegt halt seine Bilder mit Numpad 0-9 und dann hat man mehrere Ebenen, sprich wenn man"}, {"id": 253, "start": 1673.84, "end": 1679.84, "text": "plus auf Numpad drückt, dann schaltet es in Profil 2 und in Profil 2 sind dann 0-9"}, {"id": 254, "start": 1679.84, "end": 1685.16, "text": "und wieder andere Bilder, das muss ich mir mal aufschreiben, Profiles, das finde ich"}, {"id": 255, "start": 1685.16, "end": 1698.68, "text": "sehr nice, das ist sehr praktisch, das finde ich gut, das finde ich cool, da bräuchte"}, {"id": 256, "start": 1698.68, "end": 1703.2, "text": "man auch irgendwie so eine, das war richtig BigBrain, da bräuchte man auch irgendwie"}, {"id": 257, "start": 1703.2, "end": 1709.96, "text": "so eine Anzeige, was das, in welchem Profil man ist, das kann man theoretisch auch einfach"}, {"id": 258, "start": 1709.96, "end": 1714.8, "text": "im Tray anzeigen oder so, oder man hat, ah übrigens noch eine Sache, die ich mir überlegt"}, {"id": 259, "start": 1714.8, "end": 1721.8, "text": "habe, was wir machen können, ich habe was gefunden, auf GitHub, zeige ich euch mal,"}, {"id": 260, "start": 1721.8, "end": 1727.72, "text": "ich habe hier so eine special RGB-Tastatur und ich glaube das ist eine richtig coole"}, {"id": 261, "start": 1727.72, "end": 1732.76, "text": "Funktion für Leute, die auch sowas haben, also ich habe hier dieses bunte Teil, so und"}, {"id": 262, "start": 1732.76, "end": 1737.28, "text": "da kann man einstellen, dass einzelne, einzelne Tasten leuchten, so und ich habe mir gedacht,"}, {"id": 263, "start": 1737.28, "end": 1747.28, "text": "ich habe hier nämlich was gefunden, und zwar gibt es eine, gibt es eine.net Library,"}, {"id": 264, "start": 1747.28, "end": 1754.72, "text": "um die RGB-Beleuchtung von Corsair-Tastaturen zu steuern, das heißt, man könnte jetzt"}, {"id": 265, "start": 1754.72, "end": 1765.28, "text": "das verbinden mit dem, was Chris84 geschrieben hat, man, man zeigt einfach an, welches Profil"}, {"id": 266, "start": 1765.28, "end": 1776.24, "text": "aktiv ist mit RGB-Beleuchtung, das ist dann quasi, das ist dann richtig Trick 17, ja"}, {"id": 267, "start": 1776.24, "end": 1779.32, "text": "genau, Ex-Shadow-Ghost, so werde ich es wahrscheinlich auch machen, Pop-Up will ich nicht machen,"}, {"id": 268, "start": 1779.32, "end": 1783.76, "text": "weil es geht ja darum, dass man den Cremple verwenden kann, ohne dass es Einfluss auf"}, {"id": 269, "start": 1783.76, "end": 1790.96, "text": "das Game hat, was man spielt, und so ein Pop-Up geht dann richtig auf den Sack, Tray-Anzeige"}, {"id": 270, "start": 1790.96, "end": 1794.88, "text": "kann die Ebene, also ich würde sagen, die Tray-Anzeige zeigt an 1, 2, 3, 4, 5 oder"}, {"id": 271, "start": 1794.88, "end": 1800.2, "text": "irgendwie sowas, mal gucken, mal gucken, wie man das, wie man überhaupt ein Tray macht,"}, {"id": 272, "start": 1800.2, "end": 1804.84, "text": "und wenn man eine RGB-Tastatur hat, kann man sich das dann quasi auch noch, da wird dann"}, {"id": 273, "start": 1804.84, "end": 1808.92, "text": "einfach das Numpad, wird dann, keine Ahnung, blau, grün oder rot, dann weißt du, welche"}, {"id": 274, "start": 1808.92, "end": 1813.84, "text": "Ebene du hast, und für die Leute, die es richtig advanced wollen, unter 32 Memes drin"}, {"id": 275, "start": 1813.84, "end": 1818.72, "text": "haben, die können sich dann einfach auch auf dem zweiten Monitor oder auf dem zweiten"}, {"id": 276, "start": 1818.72, "end": 1823.08, "text": "Rechner über das Netzwerk das Dashboard installieren, was man das nächste Mal bastelt, wo man dann"}, {"id": 277, "start": 1823.08, "end": 1827.2, "text": "einfach draufklicken kann, und die Bilder aktivieren kann, oder auch Bilder aktivieren"}, {"id": 278, "start": 1827.2, "end": 1832.12, "text": "kann, die kein Shortcut haben, das finde ich nice, sehr, sehr nice, so, wir machen jetzt"}, {"id": 279, "start": 1832.12, "end": 1840.68, "text": "mal ein Tray-Icon, das kann ja nicht allzu schwer sein, die Musik, die Musik ist richtig"}, {"id": 280, "start": 1840.68, "end": 1851.6, "text": "monochrisch gerade, so, wie verwenden wir das Ding, wir copy-pasten es einfach mal, vorher"}, {"id": 281, "start": 1851.6, "end": 1862.68, "text": "müssen wir das Ding natürlich noch importieren, oder es leuchtet einfach die Zahl auf dem"}, {"id": 282, "start": 1862.68, "end": 1870.68, "text": "Numpad entsprechend der Ebene, oh, das ist auch, das ist, das ist auch eine coole Idee,"}, {"id": 283, "start": 1870.68, "end": 1876.24, "text": "dass dann quasi 1, 2, 3, 4, oh, das ist auch cool, siehste, siehste, Big-Prain-Chat, ich"}, {"id": 284, "start": 1876.24, "end": 1888.92, "text": "hab Biggest-Prain, 900 IQ-Chat haben wir hier, ich schreibe mir das mal auf, mach das Memboard"}, {"id": 285, "start": 1888.92, "end": 1894.68, "text": "als Abo-Modell, ne, ne, ich, ich mach meine Heizungs-App, die Bitcoins meint, ich hab"}, {"id": 286, "start": 1894.68, "end": 1900.56, "text": "das auch ein bisschen ausgebaut, die Idee schon von der Android-App, die werden wir"}, {"id": 287, "start": 1900.56, "end": 1907.88, "text": "dann auch hier irgendwann programmieren und streamen, aber in der Android-App, die, also"}, {"id": 288, "start": 1907.88, "end": 1913.04, "text": "die Heizungs-App, die verkaufen wir als Heizungs-App, wo die Leute sich im Winter die Hände dran"}, {"id": 289, "start": 1913.04, "end": 1918.8, "text": "werben können und um Hitze zu generieren, meinen wir Krypto-Werbung da drauf und das"}, {"id": 290, "start": 1918.8, "end": 1922.04, "text": "wird dann dazu führen, dass wir super Bewertungen im App-Store kriegen, weil wir bieten das"}, {"id": 291, "start": 1922.04, "end": 1927.68, "text": "kostenlos an, ohne Werbung und die App macht das, was sie soll, sie heizt das Smartphone"}, {"id": 292, "start": 1927.68, "end": 1935.4, "text": "auf, d.h. die Leute freuen sich, weil sie das genau kriegen, was sie wollen und wir"}, {"id": 293, "start": 1935.4, "end": 1943.44, "text": "meinen auf den Smartphones Krypto-Werbung und alle finden es geil, so machen wir das"}, {"id": 294, "start": 1943.44, "end": 1948.16, "text": "und man kann natürlich dann auch für alle noch ein bisschen was einbauen in diese App,"}, {"id": 295, "start": 1948.16, "end": 1956.56, "text": "z.B. kann man dann schön, z.B. könnte man dann schön animierten Kamin einbauen, den"}, {"id": 296, "start": 1956.56, "end": 1961.8, "text": "man dann quasi per Microtransactions upgraden kann, unterschiedliche Knister-Sounds oder"}, {"id": 297, "start": 1961.8, "end": 1966.52, "text": "sowas und um die Sache dann auch auf die Spitze zu treiben, kann man dann natürlich auch"}, {"id": 298, "start": 1966.52, "end": 1973.16, "text": "noch verschiedene Knister-Sounds und Kamin-Skins, verschiedene Feuerfarben, verschiedene Tageslicht-Farben"}, {"id": 299, "start": 1973.16, "end": 1979.6, "text": "und so kann man sich dann auch aus Lootboxen oder aus Kaminboxen, was auch immer holen,"}, {"id": 300, "start": 1979.6, "end": 1984.24, "text": "kommt dann der Schornstein-Figur vorbei und bringt das und die kann man aber nicht aufmachen,"}, {"id": 301, "start": 1984.24, "end": 1990.44, "text": "die kann man nur mit Schlüsseln aufmachen und jetzt kommt wieder Big Brain, der Bogen"}, {"id": 302, "start": 1990.44, "end": 1995.72, "text": "zum eigentlichen, wir wollen ja Krypto-Werbung meinen, die Schlüssel für diese Boxen kriegt"}, {"id": 303, "start": 1995.72, "end": 2000.08, "text": "man nur durch Laufzeit der App, also sprich auch wenn die Leute sich nicht ihre Hände"}, {"id": 304, "start": 2000.08, "end": 2006.6, "text": "wehren müssen, lassen sie die App trotzdem an, weil sie ja Schlüssel-Drops haben wollen"}, {"id": 305, "start": 2006.6, "end": 2011.8, "text": "für die Boxen, die sie umsonst kriegen, ja so machen wir das und dann wären wir reich"}, {"id": 306, "start": 2011.8, "end": 2030.12, "text": "damit, was sagt ihr dazu, klingt das gut, das machen wir so, das brauchen wir glaube"}, {"id": 307, "start": 2030.12, "end": 2043.08, "text": "ich, so was in der Richtung, das ist richtig Big Brain, das dürfen wir aber nicht erzählen,"}, {"id": 308, "start": 2043.08, "end": 2050.32, "text": "weil sonst hat Ubisoft demnächst sowas, EA glaube ich, Ubisoft hat sowas dann und die"}, {"id": 309, "start": 2050.32, "end": 2061.04, "text": "verstehen das Konzept dann nicht und bauen Türme ein, wo man raufklettern muss, was,"}, {"id": 310, "start": 2061.04, "end": 2075.32, "text": "ja ja ist schön, ja dass euch die Idee gefällt war klar, ok jetzt haben wir den Krempel hier"}, {"id": 311, "start": 2075.32, "end": 2081.2, "text": "eingebaut, jetzt kann man, wir copypasten das jetzt einfach mal hier, gucken wir wie das"}, {"id": 312, "start": 2081.2, "end": 2089.88, "text": "funktioniert, Tray-Icon, Moment, Source, Source kaputt, Beams 2, Lull, das heißt ja auch"}, {"id": 313, "start": 2089.88, "end": 2097.72, "text": "Lull, L, Lull, heißt ja auch, so, übrigens der Anteil von Code zu restlichen Fenster"}, {"id": 314, "start": 2097.72, "end": 2106.68, "text": "ist mal wieder absolut erstaunlich hier, so, jetzt müssen wir das Tray-Icon mal hier irgendwie"}, {"id": 315, "start": 2106.68, "end": 2110.84, "text": "reinhauen, so, das machen wir erstmal, also ganzen Events weg, jetzt gucken wir mal, ob"}, {"id": 316, "start": 2110.84, "end": 2115.88, "text": "das funktioniert, dann kriegen wir jetzt wahrscheinlich erstmal ein leeres Tray-Icon, hier unten,"}, {"id": 317, "start": 2115.88, "end": 2123.96, "text": "so, was nichts macht, Fallback für Windows XP brauchen wir nicht, Windows XP in 2k18,"}, {"id": 318, "start": 2123.96, "end": 2136.6, "text": "das ist ja, das ist nicht mal Lull, das ist Omega-Lull, so, 3, Tray-Icon visible, bla bla"}, {"id": 319, "start": 2136.6, "end": 2143.72, "text": "bla, so, geht nicht, warum geht das nicht, achso, ha, weil mir jetzt nur einmal Content"}, {"id": 320, "start": 2143.72, "end": 2151.16, "text": "geben darf, ach ne, ich hab die Namespace vergessen, ja ich bin ja auch so ein alter"}, {"id": 321, "start": 2151.16, "end": 2157.16, "text": "GPF-Pro, kein Wunder, dass das nicht geht, funktioniert jetzt nicht, weil jetzt ist Content"}, {"id": 322, "start": 2157.16, "end": 2163.16, "text": "doppeldefiniert, ne, genau, das heißt da machen wir jetzt mal irgendwie einen Stack-Panel,"}, {"id": 323, "start": 2163.16, "end": 2171.64, "text": "bo, was hab ich hier gemacht, so, zack, so, zurück, wenigstens rückt Twizzle Studio das"}, {"id": 324, "start": 2171.64, "end": 2177.04, "text": "Zeug immer schick ein, so, gucken wir mal, ob ich jetzt einen Task-Icon kriege, ah, da"}, {"id": 325, "start": 2177.04, "end": 2183.72, "text": "ist es, guckt hier, da ist es, Poggers, ein leeres Tray-Icon, was nichts tut, was nichts"}, {"id": 326, "start": 2183.72, "end": 2191.64, "text": "macht, es geht kein Popup auf oder sonst was, aber es ist da und das ist das wichtigste,"}, {"id": 327, "start": 2191.64, "end": 2202.4, "text": "so, ähm, wie kriegen wir denn da jetzt ein Menü rein, das guck ich mir jetzt mal ab"}, {"id": 328, "start": 2202.4, "end": 2218.16, "text": "hier, wie er das gemacht hat, wie hat er das gemacht, aha, Kontext-Menü, da ist es doch,"}, {"id": 329, "start": 2218.16, "end": 2227.92, "text": "Kontext-Menü, ja, so machen wir das, warum macht GitHub, warum, warum, lassen die mich"}, {"id": 330, "start": 2227.92, "end": 2237.8, "text": "nicht Copy-Pasten ohne den Schmodder hier vorne dran, warum, was ist das, ja, so machen"}, {"id": 331, "start": 2237.8, "end": 2238.8, "text": "wir das."}, {"id": 332, "start": 2238.8, "end": 2266.8, "text": "So, ähm, so, jetzt kopieren wir den Krempel mal hier rein, wie geht das jetzt, ja, so,"}, {"id": 333, "start": 2266.8, "end": 2271.0, "text": "jetzt kopieren wir den Krempel mal hier rein, wie geht das jetzt, ähm, das muss man wahrscheinlich"}, {"id": 334, "start": 2271.0, "end": 2280.52, "text": "erstmal so machen und das hier irgendwie rein kopieren, ha, ne, ok, so geht das schonmal"}, {"id": 335, "start": 2280.52, "end": 2292.48, "text": "nicht, wie hat er das denn gemacht, ah, da bindet das irgendwie, das ist ja, das ist"}, {"id": 336, "start": 2292.48, "end": 2298.88, "text": "mir zu hoch, ich hab von XAML und WPF keine Ahnung, das ist mir zu hoch, man kann das"}, {"id": 337, "start": 2298.88, "end": 2307.52, "text": "doch garantiert hier auch irgendwie, irgendwie reinschreiben, so inline, was gibt's denn"}, {"id": 338, "start": 2307.52, "end": 2315.48, "text": "da so zu auswahlen, gibt's da irgendwie ein Menü, ha, Kontext-Menü, bam, jetzt machen"}, {"id": 339, "start": 2315.48, "end": 2322.64, "text": "wir das da rein und jetzt geht's, oder auch nicht, ok, das Zeug machen wir hier mal alles"}, {"id": 340, "start": 2322.64, "end": 2327.32, "text": "weg, also auch wenn es vielleicht so aussieht oder den Anschein erweckt, also WPF-Technik"}, {"id": 341, "start": 2327.32, "end": 2332.16, "text": "hab ich nicht so wirklich Ahnung, was ich mache, aber dafür funktioniert's erstaunlich"}, {"id": 342, "start": 2332.16, "end": 2339.48, "text": "gut, so, machen wir den Krempel mal weg, wir wollen eigentlich bloß so was haben, header,"}, {"id": 343, "start": 2339.48, "end": 2343.6, "text": "irgendwie exit, ganz, ganz billig und dann wollen wir das auch nicht über Commands"}, {"id": 344, "start": 2343.6, "end": 2354.72, "text": "machen, sondern wir machen das richtig oldschool Windows-Form-Style, sondern wir machen Click-Event,"}, {"id": 345, "start": 2354.72, "end": 2358.64, "text": "das meinetwegen, dann heißt es halt Menü-Item-Click, wobei das nennen wir, das benennen wir um,"}, {"id": 346, "start": 2358.64, "end": 2370.0, "text": "das ist dumm, Menü-Item-Click, wo ist es denn, Menü-Item-Click, Menü-Item-Click nennen"}, {"id": 347, "start": 2370.0, "end": 2376.88, "text": "wir um in J-Exit, so, und wenn das geklärt, jetzt gucken wir erstmal, ob das funktioniert,"}, {"id": 348, "start": 2376.88, "end": 2388.6, "text": "ja, funktioniert, auch wenn es mit Link am Ausschuss ein bisschen leckt, aber ok, aber"}, {"id": 349, "start": 2388.6, "end": 2397.92, "text": "es exited noch nicht, das ist natürlich blöd, aber das lässt sich ja einfach beheben, oh,"}, {"id": 350, "start": 2397.92, "end": 2410.72, "text": "raus, und dann geht es zu, wenn ich auf exit drücke, ah, exit, bam, weg ist es, wunderbar,"}, {"id": 351, "start": 2410.72, "end": 2415.12, "text": "jetzt brauchen wir noch, jetzt brauchen wir noch ein Icon, was wir nehmen, weil so ein"}, {"id": 352, "start": 2415.12, "end": 2426.0, "text": "leeres Icon ist doof, das ist halt leer, jetzt haben wir eine schizze Auswahl, oh, wir wollen"}, {"id": 353, "start": 2426.0, "end": 2435.28, "text": "auf alle Clicks reagieren, ja, wunderbar, jetzt brauchen wir noch ein cooles Keksbild"}, {"id": 354, "start": 2435.28, "end": 2443.68, "text": "für den Tray, Keks oder Dance Game, Link, nein, wir können Trays unterstützen, glaube"}, {"id": 355, "start": 2443.68, "end": 2454.92, "text": "ich, keine Animationen, das wäre zu kompliziert für Microsoft, Keks, ok, dann machen wir"}, {"id": 356, "start": 2454.92, "end": 2462.24, "text": "jetzt hier, ne, den da nicht, schon den normalen Keks, nicht den Weihnachtskeks, den da, den"}, {"id": 357, "start": 2462.24, "end": 2468.72, "text": "nehmen wir jetzt, ist das auch die transparente Variante, oh man, ist das die transparente"}, {"id": 358, "start": 2468.72, "end": 2475.64, "text": "Variante, das ist die transparente Variante, guck mal, soweit sind wir schon, ich muss"}, {"id": 359, "start": 2475.64, "end": 2491.08, "text": "mir meinen eigenen Avatar im Internet herunterladen, lol, so, Desktop, mein Vater hat immer gesagt,"}, {"id": 360, "start": 2491.08, "end": 2495.44, "text": "der wusste nicht, dass man Desktop, Desktop ausspricht, er hat immer gesagt, Descope,"}, {"id": 361, "start": 2495.44, "end": 2499.76, "text": "ich packe mir das jetzt auf Descope, ich mache das auf Descope, ich habe das jetzt auf Descope"}, {"id": 362, "start": 2499.76, "end": 2508.48, "text": "abgelegt, so, so, und wie macht man daraus jetzt ein Icon-File, weil Windows, weil Windows"}, {"id": 363, "start": 2508.48, "end": 2513.56, "text": "ist ja so fortschrittlich und erlaubt hier unten keine ordentlichen Bildformate, sondern"}, {"id": 364, "start": 2513.56, "end": 2527.24, "text": "das muss in Icon-Format sein, Convert, PNG, Icon, das war klar, dass es da ein Online-Convert"}, {"id": 365, "start": 2527.24, "end": 2534.76, "text": "dafür gibt, also wir haben zur Auswahl Convert, Ico oder Ico Convert, tja, nehmen wir mal"}, {"id": 366, "start": 2534.76, "end": 2542.24, "text": "das erste, easy, das sieht aus wie irgendeine Seite, wo ich mir ein Virus einfange, wenn"}, {"id": 367, "start": 2542.24, "end": 2558.64, "text": "ich es runter lade, ich muss mal gucken, nee, go, Upload, so, Upload, wollen die mich verarschen,"}, {"id": 368, "start": 2558.64, "end": 2566.84, "text": "File was 502 Kilobyte, so, und jetzt Upload Max 2 MB each, der widerspricht sich ein bisschen,"}, {"id": 369, "start": 2566.84, "end": 2580.16, "text": "was denn du, 500 KB oder 2 MB, Kackseite, sucked, was ist das, nächste, das sieht besser"}, {"id": 370, "start": 2580.16, "end": 2586.52, "text": "aus, man könnte auch mal gucken, wie man den Scheiß selbst konvertiert, aber warum, warum"}, {"id": 371, "start": 2586.52, "end": 2593.24, "text": "selbst konvertieren, wenn man doch einfach irgendwelche Online-Services verwenden kann,"}, {"id": 372, "start": 2593.24, "end": 2606.44, "text": "so, Upload, bam, nein, ich will das, wow, was ist das, kann das croppen, ok, dann croppen"}, {"id": 373, "start": 2606.44, "end": 2614.2, "text": "wir das noch, oder auch nicht, ok, wir croppen das nicht, das lässt sich nicht croppen,"}, {"id": 374, "start": 2614.2, "end": 2623.36, "text": "ich schalte, sucked, alter, drop, wer hat sich das wieder ausgedacht, die Bedienung von"}, {"id": 375, "start": 2623.36, "end": 2633.04, "text": "der Seite ist echt abenteuerlich, so, Styles, wat, ok, wir bauen das als Icon für Windows"}, {"id": 376, "start": 2633.04, "end": 2646.8, "text": "7, meinetwegen, Multisize in one Icon, nee, so, 690 x 6, ach nee, Icon, ach du Scheiße,"}, {"id": 377, "start": 2646.8, "end": 2653.48, "text": "das kompliziert gemacht, convert, wie siehts mit einer VR, mal gucken, was ich mir jetzt"}, {"id": 378, "start": 2653.48, "end": 2663.04, "text": "hier runter lade, ach nee, es funktioniert, ok, der Windows Betrachter, der Windows Bilder"}, {"id": 379, "start": 2663.04, "end": 2667.68, "text": "Betrachter ist anscheinend nicht in der Lage das zu öffnen, ok, da haben wirs, bilden"}, {"id": 380, "start": 2667.68, "end": 2684.6, "text": "wir erstmal um, in, ach immer, Meme, Board, Icon, so, und dann direkt dropen wir das hier"}, {"id": 381, "start": 2684.6, "end": 2689.84, "text": "rein und versuchen das mal hinzuzufügen, da bin ich mal gespannt ob das klappt, wo"}, {"id": 382, "start": 2689.84, "end": 2704.76, "text": "ist es denn, da, mal gucken ob das funktioniert, Icon Source, Board Punkt Ico, ich bin ja gespannt"}, {"id": 383, "start": 2704.76, "end": 2718.92, "text": "ob das tut jetzt, mal richtig einrücken alles, hey, guck mal, es klappt, Poggers, Poggers,"}, {"id": 384, "start": 2718.92, "end": 2724.28, "text": "ich hab hier eine Lade, oh da ist es, wir haben einen Keks als Trey Icon und können"}, {"id": 385, "start": 2724.28, "end": 2733.32, "text": "das exiten, so muss das sein, eats as fuck, Koggers schon, ja genau, sowieso wieder sehbar"}, {"id": 386, "start": 2733.32, "end": 2738.72, "text": "war das als easy clap Koggers, so, das war jetzt ja nicht sonderlich schwer, also muss"}, {"id": 387, "start": 2738.72, "end": 2742.92, "text": "man sagen das Teufel funktioniert, sehr schön, ich mag Libraries die einfach, die ein schönes"}, {"id": 388, "start": 2742.92, "end": 2751.4, "text": "Beispiel haben dabei und was dann auch einfach funktioniert, das ist schick, das ist wirklich"}, {"id": 389, "start": 2751.4, "end": 2758.52, "text": "easy, ok, weiter im Text, wir haben den Trey Icon und können exiten, das heißt wir können"}, {"id": 390, "start": 2758.52, "end": 2763.76, "text": "jetzt anfangen mit der eigentliche Sache die wir heute machen wollten, das Lick E-Mode"}, {"id": 391, "start": 2763.76, "end": 2770.72, "text": "scheint euch zu gefallen oder, oh mein geht das Soundtrack grad wieder von vorne los,"}, {"id": 392, "start": 2770.72, "end": 2780.44, "text": "das ist das Main Theme quasi, ok, was auch immer hier changed machen soll, keine Ahnung,"}, {"id": 393, "start": 2780.44, "end": 2784.04, "text": "das schmeißen wir mal raus, das brauchen wir nicht, das schmeißen wir auch raus, das"}, {"id": 394, "start": 2784.04, "end": 2788.76, "text": "schmeißen wir auch raus, also ich hab mir ein bisschen Gedanken dazu gemacht, aktuell"}, {"id": 395, "start": 2788.76, "end": 2795.56, "text": "ist es ja so, wir laden das einmal statisch, also sprich wenn ich das Programm starte,"}, {"id": 396, "start": 2795.56, "end": 2801.52, "text": "dann lädt das einmal alle Bilder und merkt sich das und fertig, das heißt wenn ich ein"}, {"id": 397, "start": 2801.52, "end": 2805.84, "text": "Bild hier lösche, wird es abkacken wenn ich versuch anzuzeigen und wenn ich ein neues"}, {"id": 398, "start": 2805.84, "end": 2817.96, "text": "Bild reinziehe, dann wird es nicht mitkriegen dass es da ist, das ist natürlich blöd, deswegen"}, {"id": 399, "start": 2817.96, "end": 2821.56, "text": "tauschen wir diesen Campbell den wir jetzt das letzte Mal gebastelt haben hier, dass"}, {"id": 400, "start": 2821.56, "end": 2825.76, "text": "es sich quasi das einmal statisch lädt am Anfang, übrigens das müssen wir auch noch"}, {"id": 401, "start": 2825.76, "end": 2829.44, "text": "dynamisch machen den Fahrt, da ist mir noch nichts gescheites zu eingefallen wie ich"}, {"id": 402, "start": 2829.44, "end": 2835.96, "text": "das ohne Config Datei irgendwie, keine Ahnung, weil ich will eigentlich keine Config Datei"}, {"id": 403, "start": 2835.96, "end": 2843.76, "text": "haben, so, aktuell laden wir das hier einfach und schreiben es hier rein und arbeiten dann"}, {"id": 404, "start": 2843.76, "end": 2847.64, "text": "permanent halt mit dieser statischen Liste von Bildchen, bzw. eigentlich ist es keine"}, {"id": 405, "start": 2847.64, "end": 2853.72, "text": "statische Liste von Bildchen, sondern es ist eine Liste halt mit dieser Meme Klasse wo"}, {"id": 406, "start": 2853.72, "end": 2859.44, "text": "dann drinnen steht wo das Bild liegt, welches Shortcut es bekommen soll das Bild und halt"}, {"id": 407, "start": 2859.44, "end": 2866.4, "text": "ob es ein GIF ist oder nicht, Relativer Fahrt zu Exe, das ist eine gute Idee, das gefällt"}, {"id": 408, "start": 2866.4, "end": 2872.44, "text": "mir, hallo, howdy, das gefällt mir, das ist eine gute Idee, genau, dann machen wir Relativer"}, {"id": 409, "start": 2872.44, "end": 2877.96, "text": "Fahrt und man muss es halt einfach neben das Programm legen, das ist ja kein Ding, so"}, {"id": 410, "start": 2877.96, "end": 2884.0, "text": "und ich habe mir überlegt wir machen das folgendermaßen, wir nehmen diesen File System"}, {"id": 411, "start": 2884.0, "end": 2891.2, "text": "Watcher, sagen dem, beobachte dieses Verzeichnis und immer wenn du feststellst, dass sich das"}, {"id": 412, "start": 2891.2, "end": 2900.04, "text": "was hinzugefügt wurde, unbenannt wurde oder gelöscht wurde, dann updaten wir diese Liste,"}, {"id": 413, "start": 2900.04, "end": 2905.8, "text": "so nachdem, da fängt es aber schon an ein bisschen problematisch zu werden, denn Leute"}, {"id": 414, "start": 2905.8, "end": 2908.64, "text": "die schon ein bisschen was mit Multisoldin gemacht haben, denen ist das wahrscheinlich"}, {"id": 415, "start": 2908.64, "end": 2912.08, "text": "sofort klar, dass es keine gute Idee ist, aber ich versuche das mal noch ein bisschen"}, {"id": 416, "start": 2912.08, "end": 2918.0, "text": "auszuführen warum das keine gute Idee ist so zu machen, weil das ist ein Fehler in den"}, {"id": 417, "start": 2918.0, "end": 2923.84, "text": "jeder früher oder später läuft und sich fragt warum geht denn das nicht, also wenn ich jetzt"}, {"id": 418, "start": 2923.84, "end": 2930.4, "text": "im Hintergrund was habe, was guckt, ob sich hier drin etwas aktualisiert und sobald sich"}, {"id": 419, "start": 2930.4, "end": 2936.96, "text": "etwas aktualisiert, dann hier in meiner UI was ändere, dann hast du ein Problem, nämlich"}, {"id": 420, "start": 2936.96, "end": 2941.4, "text": "dass die Oberfläche, also im Endeffekt das unsichtbare Fenster, wo das Bild angezeigt"}, {"id": 421, "start": 2941.4, "end": 2949.2, "text": "wird, die Oberfläche läuft in einem eigenen Thread und das hier, was im Hintergrund den"}, {"id": 422, "start": 2949.2, "end": 2955.16, "text": "Ordner überwacht läuft in einem eigenen Thread, so und dann kann es natürlich passieren,"}, {"id": 423, "start": 2955.16, "end": 2961.72, "text": "dass ich Sachen mache, die halt nicht parallel funktionieren, zum Beispiel das Bild wird"}, {"id": 424, "start": 2961.72, "end": 2972.52, "text": "unbenannt und ich versuche es anzuzeigen oder aber ich lese die Liste hier gerade aus, während"}, {"id": 425, "start": 2972.52, "end": 2979.08, "text": "ich sie update und der Index den ich ausgelesen habe ist danach was anderes, also das ist"}, {"id": 426, "start": 2979.08, "end": 2984.84, "text": "keine gute Idee auf jeden Fall, also quasi auf UI Elemente zuzugreifen, auch von einem"}, {"id": 427, "start": 2984.84, "end": 2991.52, "text": "anderen Thread aus ist selten eine gute Idee. Es gibt Frameworks, ich glaube in Qt ist es"}, {"id": 428, "start": 2991.52, "end": 2997.16, "text": "so, das verbietet das prinzipiell, wenn ich da versuche von irgendeinem anderen Thread"}, {"id": 429, "start": 2997.16, "end": 3001.8, "text": "außer dem UI Thread darauf zuzugreifen, dann gibt es einen Fehler und es kackt ab, ich"}, {"id": 430, "start": 3001.8, "end": 3007.0, "text": "glaube WPF macht es auch so, bin ich mir aber nicht sicher, wie man das ganze umgehen kann"}, {"id": 431, "start": 3007.0, "end": 3016.88, "text": "ist, man muss beim updaten sagen, dass er das nicht in dem Thread machen soll, der läuft"}, {"id": 432, "start": 3016.88, "end": 3022.04, "text": "wo er das Verzeichnis überwacht, sondern in die Eventwarteschlange werfen soll für"}, {"id": 433, "start": 3022.04, "end": 3030.96, "text": "den UI Thread, dann funktioniert das und das macht man folgendermaßen und ja auch wenn"}, {"id": 434, "start": 3030.96, "end": 3040.8, "text": "es, Tommy schreibt es gerade, WPF würde abkacken wenn ich das mache, andere Sachen, die haben"}, {"id": 435, "start": 3040.8, "end": 3044.48, "text": "den Check halt nicht, die kacken nicht ab, die haben dann bloß ganz merkwürdige Fehler"}, {"id": 436, "start": 3044.48, "end": 3052.68, "text": "oftmals, also man muss aufpassen, also immer wenn man quasi von mehreren Sätzen auf einen"}, {"id": 437, "start": 3052.68, "end": 3056.6, "text": "Speicherbereich irgendwie drauf zugreift und vor allem wenn man von mehreren Stellen aus"}, {"id": 438, "start": 3056.6, "end": 3062.12, "text": "diesen Speicherbereich ändern kann, also wenn man den ändert von verschiedenen Stellen"}, {"id": 439, "start": 3062.12, "end": 3068.76, "text": "ist meistens das Problem, also an einer Stelle schreiben und an mehreren Stellen lesen, wenn"}, {"id": 440, "start": 3068.76, "end": 3073.84, "text": "man da ein bisschen aufpasst gibt es eigentlich kaum Probleme, aber spätestens wenn man von"}, {"id": 441, "start": 3073.84, "end": 3078.36, "text": "mehreren Stellen ausschreibt, was jetzt hier nicht der Fall ist, aber dann gibt es definitiv"}, {"id": 442, "start": 3078.36, "end": 3085.16, "text": "Probleme, da muss man sich was überlegen und selbst hier kann es Probleme geben, wenn"}, {"id": 443, "start": 3085.16, "end": 3091.2, "text": "ich im Hintergrund quasi diese Liste ändere und quasi gerade hier im Vordergrund irgendwas"}, {"id": 444, "start": 3091.2, "end": 3095.16, "text": "updatet, drauf zugreife oder sonst was in der Richtung ist, ich meine es ist im Prinzip"}, {"id": 445, "start": 3095.16, "end": 3099.76, "text": "ja auch ganz logisch, wenn ich jetzt sage gib mir Element 5, also in diesem Thread, in"}, {"id": 446, "start": 3099.76, "end": 3104.28, "text": "meinem UI Thread würde ich sagen gib mir Element 5 aus der Liste, während gerade im"}, {"id": 447, "start": 3104.28, "end": 3110.08, "text": "Hintergrund das Ding erkennt, oh es gibt ein neues Bild, pusht das rein und auf einmal"}, {"id": 448, "start": 3110.08, "end": 3117.04, "text": "ist Element 5 nicht mehr Element 5, sondern keine Ahnung Element 4 oder Element 8 oder"}, {"id": 449, "start": 3117.04, "end": 3122.12, "text": "irgendwie ist ja egal, also man sieht es gibt, kann auf jeden Fall immer Probleme geben,"}, {"id": 450, "start": 3122.12, "end": 3127.2, "text": "sobald ihr da mit mehreren Stellen rumwurstet, so die einfachste Variante, dass WPF zumindest"}, {"id": 451, "start": 3127.2, "end": 3135.68, "text": "nicht meckert ist wenn man sagt, wenn man eben quasi sagt hier, wow wow der Soundtrack,"}, {"id": 452, "start": 3135.68, "end": 3145.4, "text": "ja ronkar ist, als käme jetzt hier gerade die ultraepische Ansage, nicht Credo, hi,"}, {"id": 453, "start": 3145.4, "end": 3151.72, "text": "aber wenn man das hiermit macht kann man eben quasi sagen, mach das nicht in dem ursprünglichen"}, {"id": 454, "start": 3151.72, "end": 3158.36, "text": "Thread, sondern mach das in dem Thread von dem GUI, so aber jetzt müssen wir natürlich"}, {"id": 455, "start": 3158.36, "end": 3163.2, "text": "erstmal basteln, dass diese Ordner über Wachung im Hintergrund überhaupt richtig funktioniert,"}, {"id": 456, "start": 3163.2, "end": 3169.04, "text": "so und das letzte Mal, aber ich bin nicht ganz sicher wo wir das hinschreiben, weil"}, {"id": 457, "start": 3169.04, "end": 3176.08, "text": "hier in dieser Klasse hat das eigentlich überhaupt nichts verloren und wir machen uns, warte"}, {"id": 458, "start": 3176.08, "end": 3185.08, "text": "mal ich muss mal den Soundtrack eben ein bisschen leiser machen, zu der Musik fällt mir eigentlich"}, {"id": 459, "start": 3185.08, "end": 3195.76, "text": "gerade nur das hier ein, wozu das Add vor dem Fahrt, das Add sorgt dafür, dass da hier"}, {"id": 460, "start": 3195.76, "end": 3201.12, "text": "nichts escapt, guck wenn ich das Add weg, woops, what the fuck, was hab ich jetzt gedrückt,"}, {"id": 461, "start": 3201.12, "end": 3207.84, "text": "wenn ich das Add weg mache, dann sind die Backslashes Escape Zeichen, man sagt ja auch"}, {"id": 462, "start": 3207.84, "end": 3219.24, "text": "hier, aber Backslash U ist keine Escape Sequenz, ich könnte alternativ auch jeden Backslash"}, {"id": 463, "start": 3219.24, "end": 3224.88, "text": "doppelt escapten, aber nachdem ich da, das ist das gleiche im Endeffekt, aber nachdem"}, {"id": 464, "start": 3224.88, "end": 3235.32, "text": "ich da keinen Bock drauf hab, mach ich einfach ein Add davor, hallo da Woodface, ja Backslash"}, {"id": 465, "start": 3235.32, "end": 3241.2, "text": "kann man auch machen, Flo 690, aber mit Add ist das angenehmer und ich hab im Hinterkopf,"}, {"id": 466, "start": 3241.2, "end": 3245.96, "text": "dass es irgendwie, sei es C-Sharp 7 noch eine dritte Variante gibt, wie man das schreiben"}, {"id": 467, "start": 3245.96, "end": 3254.8, "text": "kann, hab ich irgendwo mal gelesen, so fangen wir mal an, also was wir auf jeden Fall nicht"}, {"id": 468, "start": 3254.8, "end": 3259.12, "text": "mal machen wollen ist, statisch das einmal am Anfang zu laden und nicht mehr zu updaten,"}, {"id": 469, "start": 3259.12, "end": 3265.72, "text": "das heißt mit der internen Liste in unserem UI, in unserer Fensterklasse bringt das das"}, {"id": 470, "start": 3265.72, "end": 3271.04, "text": "ganze schon mal nicht, was wird das für ein Tool, du hast es gerade gesehen, guck mal,"}, {"id": 471, "start": 3271.04, "end": 3281.28, "text": "kannst Overlayen, Bilder Overlayen und GIFs, transparente PNGs und GIFs, wobei es müssen"}, {"id": 472, "start": 3281.28, "end": 3288.04, "text": "nicht mehr transparente PNGs sein, also Bilder und GIFs, Format ist fast burscht, außer"}, {"id": 473, "start": 3288.04, "end": 3293.72, "text": "wenn es animiert ist, muss es halt ein GIF sein, so also mit einmaligen Liste laden am"}, {"id": 474, "start": 3293.72, "end": 3297.84, "text": "Anfang ist es nicht getan und ihr habt mir gedacht, wir lagern das aus in irgendwie"}, {"id": 475, "start": 3297.84, "end": 3302.12, "text": "in so eine eigene Klasse, die dafür zuständig ist, wir machen das mal ganz korrekt, wir"}, {"id": 476, "start": 3302.12, "end": 3306.32, "text": "machen da eine eigene Datei, ich bin mir nicht ganz sicher, wie wir das nennen sollen das"}, {"id": 477, "start": 3306.32, "end": 3313.04, "text": "ganze, wir machen mal so ein bisschen 0815 Standard Benamung, die man immer schön nehmen"}, {"id": 478, "start": 3313.04, "end": 3317.04, "text": "kann, wenn ab sonst nichts einfällt, wenn man irgendeine Sammlung hat, es gibt eigentlich"}, {"id": 479, "start": 3317.04, "end": 3322.52, "text": "zwei Varianten, wenn man eine Sammlung hat von Elementen, dann macht man entweder was,"}, {"id": 480, "start": 3322.52, "end": 3326.92, "text": "was sich sowas wie, das ist auch in dem einen Pull Request drin, was sich sowas wie meme"}, {"id": 481, "start": 3326.92, "end": 3332.0, "text": "Collection nennt, was dann im Hintergrund irgendwelche Dinger macht, wobei Collection"}, {"id": 482, "start": 3332.0, "end": 3336.0, "text": "heißt eigentlich für denjenigen, der es liest, dass es halt im Prinzip mehr oder weniger"}, {"id": 483, "start": 3336.0, "end": 3339.96, "text": "ja eigentlich sowas wie eine Liste ist, ja eine Liste, wo du dann eine Schleife drum"}, {"id": 484, "start": 3339.96, "end": 3346.0, "text": "machen kannst und sonst was, so und das zweite Ding, was sich so eingebürgert hat, wenn"}, {"id": 485, "start": 3346.0, "end": 3352.96, "text": "man eine Sammlung oder ne, ne, das ist keine Sammlung, das heißt eine Ansammlung von Objekten"}, {"id": 486, "start": 3352.96, "end": 3359.0, "text": "hat, die man dann quasi auch mal rausgeben will und man durchlaufen kann und sowas, dass"}, {"id": 487, "start": 3359.0, "end": 3364.28, "text": "man sowas macht wie ein, da stehen die Java Programmierer übrigens mega drauf, normal"}, {"id": 488, "start": 3364.28, "end": 3370.8, "text": "meme repo machts, also Java Programmierer stehen unglaublich auf Klassen, die Manager"}, {"id": 489, "start": 3370.8, "end": 3377.4, "text": "heißen, die Factory heißen und die Repository heißen, wenn ich es richtig schreiben könnte,"}, {"id": 490, "start": 3377.4, "end": 3382.72, "text": "da stehen, ich weiß nicht genau warum ehrlich gesagt, aber jedes mal, wenn ich mir irgendwie"}, {"id": 491, "start": 3382.72, "end": 3390.0, "text": "Java Source Code angucken muss, da besteht die Hälfte aus Sachen, die Manager Factory"}, {"id": 492, "start": 3390.0, "end": 3396.68, "text": "Repository heißen und das nimmt dann ganz abstruse Ausmaße an, dass es dann in Java"}, {"id": 493, "start": 3396.68, "end": 3404.84, "text": "den, die Manager Factory of Repository Manager Factories oder sowas gibt, dann hast du teilweise"}, {"id": 494, "start": 3404.84, "end": 3409.44, "text": "in Java solche Klassen, die über einen halben Bildschirm gehen, die macht dann zwei Zeilen"}, {"id": 495, "start": 3409.44, "end": 3422.04, "text": "oder so, da stehen die Java Leute halt drauf, so und das Ding ist jetzt dafür zuständig,"}, {"id": 496, "start": 3422.04, "end": 3428.96, "text": "dass wir im Hinter, dass wir den Ordner überwachen und halt eben Sachen, Änderungen erkennen"}, {"id": 497, "start": 3428.96, "end": 3439.48, "text": "plus, dass er immer eine aktuelle Liste zur Verfügung stellt von zur Zeit aktuellen Objekten,"}, {"id": 498, "start": 3439.48, "end": 3444.44, "text": "also von aktuellen Bildern, so wie es gerade ist, also das heißt, ich muss auch gucken,"}, {"id": 499, "start": 3444.44, "end": 3449.24, "text": "ob der EJX mittlerweile da ist, der ist auch nicht da, das heißt wir brauchen auf jeden"}, {"id": 500, "start": 3449.24, "end": 3457.44, "text": "Fall sowas, was wir auf jeden Fall brauchen, weil sowas haben wir hier ja auch drinne,"}, {"id": 501, "start": 3457.44, "end": 3463.16, "text": "wir brauchen immer eine aktuelle Liste mit allen gültigen Meme Bildchen, die brauchen"}, {"id": 502, "start": 3463.16, "end": 3469.12, "text": "wir, dass wir sie anzeigen können, das ist ja der Kern, das ganze, also das heißt wir"}, {"id": 503, "start": 3469.12, "end": 3474.36, "text": "brauchen auf jeden Fall irgendwie mal die Möglichkeit da eine immer aktuelle Meme Liste"}, {"id": 504, "start": 3474.36, "end": 3488.52, "text": "raus zu holen aus der ganzen Sache, so und nachdem wir jetzt ja sicherstellen wollen,"}, {"id": 505, "start": 3488.52, "end": 3500.0, "text": "dass die Liste, die wir rausgeben, nicht dazu führt, dass irgendwie unsere interne Struktur,"}, {"id": 506, "start": 3500.0, "end": 3506.6, "text": "die wir haben, unsere interne Ordnung irgendwie kaputt gemacht werden kann, müssen wir sicherstellen,"}, {"id": 507, "start": 3506.6, "end": 3512.8, "text": "dass das was hier rausgegeben wird eigentlich nur eine Kopie ist von unserer internen Liste,"}, {"id": 508, "start": 3512.8, "end": 3518.4, "text": "die noch nicht mal so aussieht wie unsere interne Liste mit allen Meme Bildchen drinne,"}, {"id": 509, "start": 3518.4, "end": 3524.28, "text": "sondern einfach nur dazu da ist, dass man eben eine aktuelle Auflistung bekommt."}, {"id": 510, "start": 3524.28, "end": 3533.52, "text": "Was ist da, eins, drei, drei, sieben, what the fuck, krieg ich Lied alle hier, so das"}, {"id": 511, "start": 3533.52, "end": 3540.16, "text": "heißt wir brauchen noch Private, wir brauchen auch intern irgendeine Struktur, wo wir dann"}, {"id": 512, "start": 3540.16, "end": 3548.16, "text": "die tatsächliche Zuordnung drinne speichern und dazu werden wir, hab ich mir überlegt,"}, {"id": 513, "start": 3548.16, "end": 3553.6, "text": "dazu nehmen wir ein Dictionary und zwar ein Dictionary aus String und dem jeweiligen"}, {"id": 514, "start": 3553.6, "end": 3561.68, "text": "Memeobjekt, String ist der Filename, ja also das hier, das bietet sich in dem Fall an,"}, {"id": 515, "start": 3561.68, "end": 3566.76, "text": "weil den kann es tatsächlich nur einmal geben und nachdem wir den Filename immer brauchen"}, {"id": 516, "start": 3566.76, "end": 3571.08, "text": "um zu gucken, ob das da ist oder ob es sich geändert hat oder ob es gelöscht wurde, ist"}, {"id": 517, "start": 3571.08, "end": 3575.16, "text": "das eine super Sache für einen Key, da finden wir es auch schnell und müssen nicht immer"}, {"id": 518, "start": 3575.16, "end": 3576.16, "text": "die Liste durchsuchen."}, {"id": 519, "start": 3576.16, "end": 3582.36, "text": "Was bei 32 Memes im Prinzip scheiß egal ist, 32 Dinge hat es in ein paar Nanosekunden wahrscheinlich"}, {"id": 520, "start": 3582.36, "end": 3589.24, "text": "durchsucht, so und das Ding nennen wir dann einfach auch klein, nur für internen Gebrauch."}, {"id": 521, "start": 3589.24, "end": 3602.2, "text": "So und wie ich hier schon gesagt hab, die Liste, die wir rausgeben, die sollte eigentlich"}, {"id": 522, "start": 3602.2, "end": 3609.24, "text": "im Prinzip immer nur eine Kopie sein von unserer internen Liste, was meckert der hier eigentlich,"}, {"id": 523, "start": 3609.24, "end": 3615.24, "text": "nicht only, immer nur eine Kopie von unserer internen Liste, weil wenn wir jetzt quasi"}, {"id": 524, "start": 3615.24, "end": 3619.08, "text": "unsere interne Liste, das ist das Dictionary hier, wo wir uns hier die Zuordnungen speichern,"}, {"id": 525, "start": 3619.08, "end": 3625.36, "text": "so Dateiname zu Memebild und sowas, wenn wir das rausgeben, dann könnte einfach irgendjemand"}, {"id": 526, "start": 3625.36, "end": 3631.96, "text": "dann sagen, blablabla repo, Memes, clear und dann ist alles weg, sprich da macht er quasi"}, {"id": 527, "start": 3631.96, "end": 3639.24, "text": "unsere internen Ordnungen in der Klasse kaputt, deswegen müssen wir sicherstellen, dass wir"}, {"id": 528, "start": 3639.24, "end": 3641.56, "text": "im Prinzip nur eine Kopie davon rausgeben."}, {"id": 529, "start": 3641.56, "end": 3650.4, "text": "Da machen wir sowas, das ist jetzt neu, das kann man seit C Sharp 7 kann man das machen,"}, {"id": 530, "start": 3650.4, "end": 3663.92, "text": "und zwar gibt es da so eine, euer Property Syntax, kann man quasi direkt sagen, ich leite"}, {"id": 531, "start": 3663.92, "end": 3669.6, "text": "das quasi auf einen Funktionsaufruf um, dann ist gut und dann kopieren wir uns einfach"}, {"id": 532, "start": 3669.6, "end": 3675.68, "text": "alle Werte in den Array und geben das dann als Kopie raus, ich hoffe das macht eine Kopie,"}, {"id": 533, "start": 3675.68, "end": 3679.12, "text": "aber muss es ja, ich mein wir brauchen von den Memes keine Kopie, wir brauchen einfach"}, {"id": 534, "start": 3679.12, "end": 3683.64, "text": "eine neue Collection, die nicht unsere Diction, ja das passt so, das muss so gehen, genau"}, {"id": 535, "start": 3683.64, "end": 3690.72, "text": "und jetzt kann ich das verwenden, extra, also von außen und ich mach hier nicht meine interne"}, {"id": 536, "start": 3690.72, "end": 3698.04, "text": "Collection kaputt, oder kann ich nicht kaputt machen, so, das bringen wir uns allerdings"}, {"id": 537, "start": 3698.04, "end": 3702.52, "text": "noch nicht allzu viel, jetzt müssen wir erstmal einen Konstruktor anlegen und wir brauchen"}, {"id": 538, "start": 3702.52, "end": 3710.76, "text": "natürlich einen Pfad, nämlich den Pfad von dem Verzeichnis, den wir überwachen wollen,"}, {"id": 539, "start": 3710.76, "end": 3720.16, "text": "anders funktioniert das ganze nicht, so, dann brauchen wir noch einen Private File System"}, {"id": 540, "start": 3720.16, "end": 3730.32, "text": "Watcher, der heißt dann einfach mal Cal Watcher, New, so, das will er wahrscheinlich wieder"}, {"id": 541, "start": 3730.32, "end": 3746.84, "text": "Read-Only machen, nein wir können gerne Read-Only machen, so, dem sagen wir jetzt, dass er"}, {"id": 542, "start": 3746.84, "end": 3752.24, "text": "das übergebende Verzeichnis überwachen soll, wir interessieren uns für Dateien, die erstellt"}, {"id": 543, "start": 3752.24, "end": 3757.8, "text": "werden, Dateien die unbenannt werden und Dateien die gelöscht werden, hier drinnen, also es"}, {"id": 544, "start": 3757.8, "end": 3763.64, "text": "kann ja sein, dass ich ein Bild unbenenne, dann muss ich hier im Zweifelsfall die Shortcuts"}, {"id": 545, "start": 3763.64, "end": 3766.68, "text": "noch einlesen, es kann sein, dass ich ein neues Bild reinkopiere, es kann sein, dass ich eins"}, {"id": 546, "start": 3766.68, "end": 3774.84, "text": "lösche, dann muss es weg, und dann wollen wir die Überwachung einschalten, so, dann"}, {"id": 547, "start": 3774.84, "end": 3795.6, "text": "brauchen wir noch eine Funktion, die das ganze macht, so, da werden die Argumente jetzt nicht"}, {"id": 548, "start": 3795.6, "end": 3804.8, "text": "passen denke ich mal, das heißt wir brauchen dann, und was war das, Event, File Event Arcs"}, {"id": 549, "start": 3804.8, "end": 3813.8, "text": "oder sowas, File System Event Arcs, genau, wunderbar, so, jetzt probieren wir mal ob das"}, {"id": 550, "start": 3813.8, "end": 3823.64, "text": "prinzipiell funktioniert, Test, nein machen wir irgendwie File Changed, einfach mal kurz"}, {"id": 551, "start": 3823.64, "end": 3830.36, "text": "gucken ob das funktioniert, was wir hier fabriziert haben, so, und das sollte jetzt ausspucken"}, {"id": 552, "start": 3830.36, "end": 3836.4, "text": "wenn ich starte, sollte das ausspucken wenn ich irgendwie was hier an den Bildern ändere"}, {"id": 553, "start": 3836.4, "end": 3842.2, "text": "oder unbenenne oder was auch immer, sollte das jetzt was ausgehen, probieren wir das"}, {"id": 554, "start": 3842.2, "end": 3855.64, "text": "mal aus, erstmal muss ich das Ding noch laden, das sind hier meine Load Window, das ist ja"}, {"id": 555, "start": 3855.64, "end": 3877.72, "text": "nur testweise, Fahrt ist dann der da, so, jo das wars, ok gucken wir mal ob das klappt,"}, {"id": 556, "start": 3877.72, "end": 3889.28, "text": "so, benennen wir das mal um, wow, ach nee, das ist ja schon geöffnet, also Bild was ich"}, {"id": 557, "start": 3889.28, "end": 3894.32, "text": "grad drauf zugreife kann ich natürlich nicht unbenennen, benennen wir mal Poggers um, wow,"}, {"id": 558, "start": 3894.32, "end": 3898.2, "text": "hat funktioniert, ich hab es aus Versehen gelöscht, aber er hat es mitgekriegt dass"}, {"id": 559, "start": 3898.2, "end": 3902.68, "text": "ich es gelöscht habe, und er hat auch wieder mitgekriegt wenn es Created wird, ok, das"}, {"id": 560, "start": 3902.68, "end": 3918.24, "text": "funktioniert prinzipiell, das ist schon mal gut, sehr, sehr nice, Musik ist vorbei, so,"}, {"id": 561, "start": 3918.24, "end": 3928.36, "text": "das klappt, das heißt ich kriege jetzt mit, wenn sich hier Bilder drinne ändern, gut, jetzt"}, {"id": 562, "start": 3928.36, "end": 3935.52, "text": "kann ich noch auswerten, jetzt muss ich ja je nachdem was genau passiert, muss ich da"}, {"id": 563, "start": 3935.52, "end": 3951.6, "text": "unterschiedlich drauf reagieren, so, juckt mich net, changed juckt mich auch net, mich"}, {"id": 564, "start": 3951.6, "end": 3960.56, "text": "juckt plus Created, Deleted und Renamed bei den Bildern, so, wenn was Created wird ist"}, {"id": 565, "start": 3960.56, "end": 3968.88, "text": "das relativ einfach, dann will ich das hinzufügen, dann ist es neu, da muss ich keine Sperenzien"}, {"id": 566, "start": 3968.88, "end": 3981.44, "text": "machen, einfach hinzufügen und gut ist, fertig, so, wenn es gelöscht wird muss ich eigentlich"}, {"id": 567, "start": 3981.44, "end": 3988.88, "text": "auch keine große Aktion machen, sondern, und deswegen habe ich hier oben auch als Key"}, {"id": 568, "start": 3988.88, "end": 3994.72, "text": "den Pfeil, den Dateinamen genommen, weil das ist das eindeutigste an so einem Bild, und"}, {"id": 569, "start": 3994.72, "end": 3999.2, "text": "jetzt muss ich das löschen, das ist auch einfach, ein bisschen komplizierter wird jetzt"}, {"id": 570, "start": 3999.2, "end": 4005.04, "text": "wahrscheinlich Renamed, weil bei Renamed muss ich quasi das alte Bild hier oben draus entfernen"}, {"id": 571, "start": 4005.04, "end": 4024.0, "text": "und das neue Bild mit dem neuen Namen dazu hängen, der Desmond hat eine Frage, ist vielleicht"}, {"id": 572, "start": 4024.0, "end": 4033.2, "text": "ziemlich doof, aber ist mir gerade wieder auffallend, wofür genau steht das E-Punkt,"}, {"id": 573, "start": 4033.2, "end": 4045.48, "text": "ach das da, meinste hier, na mit dem Punkt greifste auf die Methoden von dem Objekt zu,"}, {"id": 574, "start": 4045.48, "end": 4048.88, "text": "das Ding hat bestimmt auch irgendeinen Namen, wahrscheinlich irgendwie Referenzoperator"}, {"id": 575, "start": 4048.88, "end": 4060.8, "text": "oder so was, ich weiß gar nicht wie das Ding genau heißt, in C++ machst du so, was aus"}, {"id": 576, "start": 4060.8, "end": 4082.44, "text": "irgendwelchen Gründen, die es sogar angibt, als Vervollständigung, aber das funktioniert"}, {"id": 577, "start": 4082.44, "end": 4083.44, "text": "nicht."}, {"id": 578, "start": 4083.44, "end": 4094.54, "text": "Wir sagen jetzt ja, wenn der File System Watcher erkennt, dass sich das Bild ändert,"}, {"id": 579, "start": 4094.54, "end": 4101.8, "text": "soll er in dem Fall, dass das Bild quasi erstellt wurde, diese Funktion aufrufen, und übergeben"}, {"id": 580, "start": 4101.8, "end": 4106.5, "text": "quasi, wer das Event ausgelöst hat und was sich geändert hat."}, {"id": 581, "start": 4106.5, "end": 4112.24, "text": "Genau in dem Fall ist E ein File System Event."}, {"id": 582, "start": 4112.24, "end": 4115.24, "text": "So sieht es aus."}, {"id": 583, "start": 4115.24, "end": 4123.24, "text": "Und E Punkt Changed ist halt, deswegen da ist Visual Studio ganz praktisch, weil es hier zu allem was anzeigt."}, {"id": 584, "start": 4123.24, "end": 4130.24, "text": "E Punkt Changed, also Changed sagt ihr halt in dem Fall, zeigt ihr an was sich genau geändert hat."}, {"id": 585, "start": 4130.24, "end": 4136.24, "text": "Dementsprechend können wir auch gucken, wenn wir einen Switch auf diesen Typ machen, können wir dann quasi gucken,"}, {"id": 586, "start": 4136.24, "end": 4143.24, "text": "wenn eben E Punkt Changed Created ist, dann machen wir das, wenn es Deleted ist, dann machen wir das, wenn es Renamed ist, dann machen wir das."}, {"id": 587, "start": 4143.24, "end": 4145.24, "text": "Jetzt habe ich es verschoben."}, {"id": 588, "start": 4145.24, "end": 4150.24, "text": "Kein BDO mehr, doch ich hole noch Daily Rewards."}, {"id": 589, "start": 4150.24, "end": 4164.24, "text": "Oh, Press of the Wild Musik, ich weiß nicht."}, {"id": 590, "start": 4164.24, "end": 4171.24, "text": "Ich muss euch ja sagen, so gut ich Press of the Wild fand, der Soundtrack hat mir nicht gefallen."}, {"id": 591, "start": 4171.24, "end": 4176.24, "text": "Der Soundtrack hat mir nicht gefallen, der war mir zu minimalistisch."}, {"id": 592, "start": 4176.24, "end": 4184.24, "text": "Und ja, ich weiß, dass das Absicht ist, aber es hat mir trotzdem nicht gefallen."}, {"id": 593, "start": 4194.24, "end": 4198.24, "text": "So, wie machen wir jetzt Renamed, was haben wir denn zur Auswahl?"}, {"id": 594, "start": 4198.24, "end": 4206.24, "text": "Moment, da muss ich mal nachgucken."}, {"id": 595, "start": 4206.24, "end": 4212.24, "text": "Ha, ja, wusste ich doch."}, {"id": 596, "start": 4212.24, "end": 4216.24, "text": "Genau, das war nämlich nicht das."}, {"id": 597, "start": 4216.24, "end": 4226.24, "text": "Stimmt, das war das einzige, Renamed war das einzige Event, was andere Event-Arcs übergeben hat."}, {"id": 598, "start": 4226.24, "end": 4236.24, "text": "Aber das können wir schön machen, wir können nämlich einfach sagen, das ist jetzt auch neu, seit C Sharp 7."}, {"id": 599, "start": 4236.24, "end": 4246.24, "text": "Also wir wissen jetzt, dass es immer im Prinzip ein Filesystem Event-Arc Objekt gibt hier, bei einem Update von diesem Ordner."}, {"id": 600, "start": 4246.24, "end": 4254.24, "text": "Außer bei Renamed gibt es einen Renamed Event-Arcs."}, {"id": 601, "start": 4254.24, "end": 4266.24, "text": "Allerdings ist Renamed Event-Arcs abgeleitet von Filesystem Event-Arcs."}, {"id": 602, "start": 4266.24, "end": 4272.24, "text": "Das heißt, wir können ein schönes neues C Sharp 7 Feature verwenden."}, {"id": 603, "start": 4272.24, "end": 4280.24, "text": "Und zwar kann man das inline jetzt, wie nennen sie das, Pattern matchen."}, {"id": 604, "start": 4280.24, "end": 4294.24, "text": "Also man kann quasi sagen, ok, wenn jetzt der Change Typ Renamed ist, dann ist das hier kein Filesystem Event-Arc,"}, {"id": 605, "start": 4294.24, "end": 4302.24, "text": "sondern das ist ein Renamed Event-Arc, das nennen wir mal R."}, {"id": 606, "start": 4302.24, "end": 4312.24, "text": "Also der castet das im Endeffekt, also ne, was heißt der castet das, der guckt, ob der Typ von E Renamed Event-Arcs ist,"}, {"id": 607, "start": 4312.24, "end": 4316.24, "text": "und castet das quasi dann für mich schon."}, {"id": 608, "start": 4316.24, "end": 4322.24, "text": "Und mit R habe ich dann quasi das auf Renamed Event-Arcs gecastete Filesystem Event-Arcs."}, {"id": 609, "start": 4322.24, "end": 4328.24, "text": "Das ist ein bisschen schöner inline. Und wenn ich jetzt hier reingucke, sehe ich auch, ich habe mehr Sachen, nämlich bei einem Renamed Event,"}, {"id": 610, "start": 4328.24, "end": 4332.24, "text": "bei einem Renamed Event brauche ich nämlich den alten Namen und den alten Fahrt und den neuen Fahrt."}, {"id": 611, "start": 4332.24, "end": 4336.24, "text": "Sonst geht es logischerweise nicht."}, {"id": 612, "start": 4336.24, "end": 4346.24, "text": "So, und deswegen kann ich jetzt hier sagen, bisschen lauter."}, {"id": 613, "start": 4346.24, "end": 4360.24, "text": "Stfu."}, {"id": 614, "start": 4360.24, "end": 4374.24, "text": "Ja, ich nehme hier, was Invisible Darkness geschickt hat. Das ist ein schöner Soundtrack."}, {"id": 615, "start": 4374.24, "end": 4388.24, "text": "So, ähm, remove. So, wenn die Datei entfernt wurde, müssen wir im Prinzip den alten Namen löschen, den neuen Namen hinzufügen."}, {"id": 616, "start": 4388.24, "end": 4398.24, "text": "Im Prinzip das und das hier zusammen. Das heißt, wir wollen jetzt erstmal den alten entfernen und den neuen hinzufügen."}, {"id": 617, "start": 4398.24, "end": 4404.24, "text": "Das kann man bestimmt irgendwie schöner machen, aber das muss ich jetzt erstmal tun."}, {"id": 618, "start": 4404.24, "end": 4416.24, "text": "So. Ach, Quatsch. So."}, {"id": 619, "start": 4416.24, "end": 4422.24, "text": "Wie wäre es denn mit der Metal Gear Rising Revengeance Ost als Hintergrundmusik?"}, {"id": 620, "start": 4422.24, "end": 4427.24, "text": "Können wir das auch nochmal. Aber ich glaube, so lange brauchen wir heute nicht."}, {"id": 621, "start": 4427.24, "end": 4433.24, "text": "Ich zeige dir, was das macht. Marcilein. Und zwar, ich hoffe, es läuft gerade, weil wir haben rumgebastelt."}, {"id": 622, "start": 4433.24, "end": 4438.24, "text": "Es zeigt dir Bilder als Overlay. Allerdings hast du halt Tastatur-Shortcuts."}, {"id": 623, "start": 4438.24, "end": 4444.24, "text": "Also wenn ich jetzt Steuerung M einmal drücke, gibt es eine Runde MonkaS."}, {"id": 624, "start": 4444.24, "end": 4448.24, "text": "Wenn ich Steuerung M nochmal drücke, ist es wieder weg."}, {"id": 625, "start": 4448.24, "end": 4454.24, "text": "Drück ich L, ist LUL, drück ich 3, ist LUL 3D, drück ich 1."}, {"id": 626, "start": 4454.24, "end": 4469.24, "text": "Und passend für den EA Livestream haben wir extra noch das eingefügt."}, {"id": 627, "start": 4469.24, "end": 4475.24, "text": "Das kannst du damit machen. Transparente Overlays über allen anderen Anwendungen einplanten."}, {"id": 628, "start": 4475.24, "end": 4483.24, "text": "Und das ist halt auch wirklich Overlay, du kannst durchklicken."}, {"id": 629, "start": 4483.24, "end": 4489.24, "text": "Was wir jetzt gerade programmieren ist, dass du während das läuft auch Bilder hinzufügen kannst und löschen kannst,"}, {"id": 630, "start": 4489.24, "end": 4510.24, "text": "ohne das Ganze neu starten zu müssen."}, {"id": 631, "start": 4510.24, "end": 4517.24, "text": "Sieht man das selbst auch oder nur das Stream? Das sieht man selbst auch."}, {"id": 632, "start": 4517.24, "end": 4523.24, "text": "Das ist gerade der Witz daran, weil OBS kann das zwar auch."}, {"id": 633, "start": 4523.24, "end": 4526.24, "text": "Und Elgatos Stream Deck und so können das auch."}, {"id": 634, "start": 4526.24, "end": 4533.24, "text": "Aber dort sieht man nur im Stream die Bilder. Das heißt, man sieht die selbst nicht."}, {"id": 635, "start": 4533.24, "end": 4536.24, "text": "Und ich habe nach einem Tool gesucht, wo man die Bilder selbst sieht."}, {"id": 636, "start": 4536.24, "end": 4543.24, "text": "Weil, stellt euch mal vor, man macht im OBS, definiert man sich einen Shortcut für LUL."}, {"id": 637, "start": 4543.24, "end": 4548.24, "text": "Dann blendet man das einmal ein, man sieht es selber nicht, man hat keine Ahnung, dass es an ist."}, {"id": 638, "start": 4548.24, "end": 4555.24, "text": "Und das Stream muss ich 10 Minuten LUL im Fullscreen angucken."}, {"id": 639, "start": 4555.24, "end": 4562.24, "text": "Und natürlich kannst du ja auch die ganzen Bilder definieren, was du halt, die Shortcuts kannst du dir halt selbst definieren,"}, {"id": 640, "start": 4562.24, "end": 4567.24, "text": "je nachdem, wie du das Bild nennst. Wenn du also sprichst, wenn du das Bild F4 Gaben Scary nennst,"}, {"id": 641, "start": 4567.24, "end": 4574.24, "text": "oder wichtig ist, dass das Bild halt F4 Unterstrich heißt, dann drückst du jetzt Steuerung F4 und dann ist der Gaben am Start."}, {"id": 642, "start": 4574.24, "end": 4583.24, "text": "Der schlecht freigestellte Gaben wohlgemerkt ist am Start."}, {"id": 643, "start": 4583.24, "end": 4591.24, "text": "Was hältst du von einer Soundboard-Funktion? Na, das sind Sachen, die man in Zukunft vielleicht mal einbauen kann."}, {"id": 644, "start": 4591.24, "end": 4595.24, "text": "Aber das ist keine schlechte Idee."}, {"id": 645, "start": 4595.24, "end": 4599.24, "text": "Also, ich denke mal, Otsaru, die Frage ist auch jetzt beantwortet damit."}, {"id": 646, "start": 4599.24, "end": 4609.24, "text": "Ich hab's ja gerade mehr oder weniger schon gezeigt, bevor ich das gelesen hab von dir."}, {"id": 647, "start": 4609.24, "end": 4615.24, "text": "Was passiert, wenn man zwei Bilder mit der gleichen Taste übernacht? Das ist eine gute Frage, dann kackts ab."}, {"id": 648, "start": 4615.24, "end": 4621.24, "text": "Das haben wir noch nicht behandelt, den Fehler. Aber das machen wir noch."}, {"id": 649, "start": 4621.24, "end": 4629.24, "text": "Das kackt ab mit, wie hieß das, Key Already In Use."}, {"id": 650, "start": 4629.24, "end": 4634.24, "text": "Kackts ab, wenn du versuchst, den gleichen Shortcut zweimal zu registrieren."}, {"id": 651, "start": 4634.24, "end": 4639.24, "text": "Und es funktioniert auch nicht, wenn du Shortcuts verwendest, die schon Windows verwendet. Das geht nicht."}, {"id": 652, "start": 4639.24, "end": 4650.24, "text": "Also sprich, wenn du jetzt irgendwie Alt-Tab oder so verwenden willst, dann sagt dir die auch Shortcut Already In Use."}, {"id": 653, "start": 4650.24, "end": 4662.24, "text": "Morgen hast du frei oder arbeitest du 80%? Nee, ich hab montags frei, nicht freitags. Morgen muss ich arbeiten. Montags hab ich frei."}, {"id": 654, "start": 4662.24, "end": 4670.24, "text": "Kennst du Ahead In Time? Ja, kenn ich. Ist ein sehr, ein nicees Game ist das."}, {"id": 655, "start": 4670.24, "end": 4676.24, "text": "So, ähm, ich will das nochmal fertig bauen."}, {"id": 656, "start": 4676.24, "end": 4681.24, "text": "So, von der Idee her ist es ja, von der Logik her, viel mehr brauchen wir jetzt ja an der Stelle gar nicht."}, {"id": 657, "start": 4681.24, "end": 4695.24, "text": "So, jetzt wollen wir was Neues. Haben wir noch nie gemacht. Ich glaub, ich glaub, in noch keinem Programm oder in keinem Stream bisher, auch nicht beim Screenshot Tool, haben wir Events verwendet."}, {"id": 658, "start": 4695.24, "end": 4699.24, "text": "Hab ich aber noch nirgendswo gemacht. Aber jetzt brauchen wir welche."}, {"id": 659, "start": 4699.24, "end": 4707.24, "text": "Denn, wenn dieses Ding hier, wenn ich das hier starte und das kriegt mit."}, {"id": 660, "start": 4707.24, "end": 4719.24, "text": "Das ist jetzt ein bisschen laut, das Soundtrack wieder. Ai."}, {"id": 661, "start": 4719.24, "end": 4726.24, "text": "So, ähm, wenn das jetzt mitkriegt, das läuft da im Hintergrund und checkt, ob sich hier in dem Ordner was ändert."}, {"id": 662, "start": 4726.24, "end": 4734.24, "text": "Wenn sich was geändert hat, dann muss ich das ja hier mitkriegen."}, {"id": 663, "start": 4734.24, "end": 4739.24, "text": "Das bringt mir ja nichts, wenn sich das einfach ändert im Hintergrund."}, {"id": 664, "start": 4739.24, "end": 4747.24, "text": "Da hab ich nichts davon. Ich muss ja darüber benachrichtigt werden, dass sich was geändert hat."}, {"id": 665, "start": 4747.24, "end": 4756.24, "text": "Und darauf reagieren. Das heißt, wenn mir das hier Bescheid sagt, mit einem Event, dass sich in diesem Ordner was geändert hat,"}, {"id": 666, "start": 4756.24, "end": 4767.24, "text": "dann muss ich mir quasi die Liste hier neu holen und die Shortcuts neu anlegen."}, {"id": 667, "start": 4767.24, "end": 4771.24, "text": "Weil, mal angenommen, ich ziehe jetzt hier ein neues Bild rein."}, {"id": 668, "start": 4771.24, "end": 4781.24, "text": "Ähm, keine Ahnung, f12.blub.png, dann muss ich ja einen neuen Shortcut registrieren, nämlich Steuerung f12."}, {"id": 669, "start": 4781.24, "end": 4786.24, "text": "Das heißt, wenn das hier erkennt, dass es ein neues Bild gibt, muss ich das ja in meinem UI mitkriegen."}, {"id": 670, "start": 4786.24, "end": 4794.24, "text": "Dazu brauchen wir einen Event."}, {"id": 671, "start": 4794.24, "end": 4801.24, "text": "Ähm, overlayt das auch Games im Fullscreen? Nein, das geht nicht."}, {"id": 672, "start": 4801.24, "end": 4806.24, "text": "Window, Borderless Window Fullscreen geht."}, {"id": 673, "start": 4806.24, "end": 4814.24, "text": "Das ist das aktuelle Game, die Funktion für Borderless Window. Aber Fullscreen geht technisch nicht."}, {"id": 674, "start": 4814.24, "end": 4821.24, "text": "Wir haben schon das Maximale gemacht, was geht, dass die Bilder halt, dass man durchklicken kann,"}, {"id": 675, "start": 4821.24, "end": 4826.24, "text": "dass die immer on top sind und dass du quasi nie den Fokus verlierst im Endeffekt."}, {"id": 676, "start": 4826.24, "end": 4830.24, "text": "Guck hier, ich track und drop im Hintergrund weiter, obwohl ich Overlay-Dinger ein- und ausblende."}, {"id": 677, "start": 4830.24, "end": 4836.24, "text": "Da passiert halt nichts. Aber Fullscreen geht nicht."}, {"id": 678, "start": 4836.24, "end": 4842.24, "text": "Weil Fullscreen ist exklusiv und das geht aus einem logischen Grund auch nicht."}, {"id": 679, "start": 4842.24, "end": 4849.24, "text": "Ähm, das hier, das Bild, man kann auch ganz einfach erklären, warum das im Fullscreen nicht geht,"}, {"id": 680, "start": 4849.24, "end": 4852.24, "text": "im exklusiven Fullscreen nicht funktioniert."}, {"id": 681, "start": 4852.24, "end": 4856.24, "text": "Das hier ist ja im Endeffekt ein transparentes Fenster hier drum herum."}, {"id": 682, "start": 4856.24, "end": 4860.24, "text": "Ein transparentes Fenster, wo dann ein Transparent, ein GIF mit Transparenz drin ist."}, {"id": 683, "start": 4860.24, "end": 4868.24, "text": "So, und damit man mehr als ein Fenster quasi gleichzeitig rendern kann, muss der Windows,"}, {"id": 684, "start": 4868.24, "end": 4876.24, "text": "wie heißt das Ding, DWM, dieser, der Windows, der von Windows, der Window Manager muss die Fenster rendern."}, {"id": 685, "start": 4876.24, "end": 4880.24, "text": "Ja, also sprich, der macht halt auch so Dinge wie dieses Window, überlappt dieses Window"}, {"id": 686, "start": 4880.24, "end": 4883.24, "text": "und durch Transparenz gucke ich da so durch und sowas."}, {"id": 687, "start": 4883.24, "end": 4890.24, "text": "Ähm, das heißt der Windows, Window Manager muss das rendern, dass es funktioniert."}, {"id": 688, "start": 4890.24, "end": 4897.24, "text": "Und bei einer exklusiven Fullscreen-Anwendung rendert nicht der Windows, Window Manager den Inhalt."}, {"id": 689, "start": 4897.24, "end": 4899.24, "text": "Dementsprechend kann es nicht funktionieren."}, {"id": 690, "start": 4899.24, "end": 4907.24, "text": "Wenn man ein Overlay machen möchte in einem exklusiven Fullscreen, in einem Fullscreen-Spiel,"}, {"id": 691, "start": 4907.24, "end": 4914.24, "text": "was exklusiv diesen Fullscreen-Modus hat, dann bleiben dir im Prinzip, bleiben dir eigentlich zwei Möglichkeiten."}, {"id": 692, "start": 4914.24, "end": 4921.24, "text": "Du verwendest irgendwelche Nvidia-Hacks, die haben da irgendwas für."}, {"id": 693, "start": 4921.24, "end": 4926.24, "text": "Ja, also so wie Steam zum Beispiel dann auch irgendwelche Bilder abgreift und sowas."}, {"id": 694, "start": 4926.24, "end": 4933.24, "text": "Ähm, was Normalsterbliche nur mit Quadro-Karten dürfen, darf Steam auch mit Geforce-Karten machen."}, {"id": 695, "start": 4933.24, "end": 4945.24, "text": "Also entweder verwendet man irgendwelche Nvidia-Hacks oder aber man muss das in das jeweilige 3D-Rendering irgendwie injecten."}, {"id": 696, "start": 4945.24, "end": 4951.24, "text": "Sein Overlay, so macht das, so macht das FRAPS zum Beispiel für seinen FPS-Counter, den es oben anzeigt."}, {"id": 697, "start": 4951.24, "end": 4955.24, "text": "Ja, oder Steam für den FPS-Counter und sowas."}, {"id": 698, "start": 4955.24, "end": 4959.24, "text": "Allerdings ein komplettes Overlay mit Bildern und so, das ist so eine Sache."}, {"id": 699, "start": 4959.24, "end": 4971.24, "text": "Zumal das Injecten in diese Diode-X-Rendering-Geschichte, da springen natürlich auch mal Anti-Cheat-Tools ganz gern drauf an."}, {"id": 700, "start": 4971.24, "end": 4975.24, "text": "Weil in der Vergangenheit haben das halt viele Hacks gemacht."}, {"id": 701, "start": 4975.24, "end": 4983.24, "text": "Wenn du früher einen Wall-Hack hattest, da musstest du ja irgendwie quasi anzeigen, wo der Gegner hinter der Wand ist."}, {"id": 702, "start": 4983.24, "end": 4991.24, "text": "So, und wenn du das quasi so gemacht hast, dass du in das Rendering vom Spiel eingekrippten hast, um dann quasi deinen Wall-Hack da rein zu rendern,"}, {"id": 703, "start": 4991.24, "end": 4995.24, "text": "das war halt ziemlich easy zu bemerken für den Hersteller."}, {"id": 704, "start": 4995.24, "end": 5005.24, "text": "Das heißt auch die krassen Hacksore sind mittlerweile darauf umgestiegen, das mit Overlays zu machen."}, {"id": 705, "start": 5005.24, "end": 5009.24, "text": "Weil das merkst du nicht. Das kannst du im Prinzip nicht feststellen."}, {"id": 706, "start": 5009.24, "end": 5019.24, "text": "Zumindest nicht so einfach. Weil der Windows Display Manager, wie auch immer dieses Ding da genau heißt, ist ja für das Rendern zuständig."}, {"id": 707, "start": 5019.24, "end": 5025.24, "text": "Und dein Spiel rendert ganz normal und du siehst ja nicht, dass jetzt der Benutzer noch ein Fenster davor geschoben hat."}, {"id": 708, "start": 5025.24, "end": 5029.24, "text": "Das muss dich ja auch überhaupt nicht interessieren."}, {"id": 709, "start": 5029.24, "end": 5044.24, "text": "Das heißt Hacks haben heute auch eher so einen Overlay und hängen sich nicht mehr in das Spiel rein fürs Rendern."}, {"id": 710, "start": 5044.24, "end": 5048.24, "text": "Deswegen funktioniert das exklusiv Fullscreen nicht."}, {"id": 711, "start": 5048.24, "end": 5054.24, "text": "Und ohne Hacks, also offiziell funktioniert das bei exklusiven Fullscreen-Spielen nichts."}, {"id": 712, "start": 5054.24, "end": 5062.24, "text": "Nur halt mit irgendwelchen komischen Hacks, wie das zum Beispiel in FRAPS und Steam natürlich auch machen, dass du einen FPS-Counter hast."}, {"id": 713, "start": 5062.24, "end": 5072.24, "text": "Die einzigen quasi legit FPS-Counter sind halt die, die ein Spiel selbst zur Verfügung stellt, weil das rendert es halt selbst."}, {"id": 714, "start": 5072.24, "end": 5080.24, "text": "Ja, Desktop-Screenshots als Anti-Cheat ist auch gar nicht so blöd."}, {"id": 715, "start": 5080.24, "end": 5094.24, "text": "Wenn man quasi das Gleiche macht, was im Endeffekt Drucken bzw. Alt-Print und so macht, da kannst du ja auch nichts verstecken."}, {"id": 716, "start": 5094.24, "end": 5109.24, "text": "So, Events. Ich war bei Events."}, {"id": 717, "start": 5109.24, "end": 5124.24, "text": "Nun müssen wir jetzt ein Event einbauen, was uns hier in unserem UI Bescheid sagt, sobald sich im Hintergrund was geändert hat."}, {"id": 718, "start": 5124.24, "end": 5139.24, "text": "Gucken wir mal, wie wir das jetzt am besten machen. Eventhenge, brauchen wir da überhaupt einen für... Ich würde euch ganz sicher was machen."}, {"id": 719, "start": 5139.24, "end": 5151.24, "text": "Wir machen jetzt ein Event, das ich abonnieren kann aus meinem GUI, was mir Bescheid sagt, sobald sich was in diesem Ordner geändert hat."}, {"id": 720, "start": 5151.24, "end": 5159.24, "text": "Und das nennen wir einfach Updated. Updated, Gebated, Activated, Overrated. Updated heißt das Ding."}, {"id": 721, "start": 5159.24, "end": 5165.24, "text": "Und man sieht es jetzt auch schon."}, {"id": 722, "start": 5165.24, "end": 5185.24, "text": "Ich habe jetzt hier ein neues Event Updated. Und da kann ich mich jetzt dranhängen und sagen, wenn dieses Event auftritt, also sprich, wenn sich was geändert hat an den Bildern, dann ruf folgende Funktion auf."}, {"id": 723, "start": 5185.24, "end": 5199.24, "text": "Der klassische Weg ist, dass man das so macht, sprich, man muss dann eine eigene Funktion anlegen, die aufgerufen wird und hin und her."}, {"id": 724, "start": 5199.24, "end": 5207.24, "text": "Ich finde das mit Lambdas einfacher, weil wir müssen ja nicht viel machen im Endeffekt an der Stelle."}, {"id": 725, "start": 5207.24, "end": 5215.24, "text": "Jetzt muss man sich überlegen, was will man dann updaten, wenn sich eine Datei ändert. Im Prinzip sind das ja eigentlich nur die Shortcuts."}, {"id": 726, "start": 5215.24, "end": 5223.24, "text": "Also sprich, wenn das Programm läuft und ich lösche jetzt LUL, dann will ich das Shortcut für Steuerung L entfernen."}, {"id": 727, "start": 5223.24, "end": 5229.24, "text": "Wenn ich jetzt ein neues Bild rein mache, was F12 Blub heißt, will ich das neue Shortcut F12 anlegen."}, {"id": 728, "start": 5229.24, "end": 5239.24, "text": "Das heißt, ich brauche eine Funktion, die quasi ganz billig beim Aufruf alle Shortcuts löscht und alle Shortcuts neu anlegt."}, {"id": 729, "start": 5239.24, "end": 5243.24, "text": "Das ist die billige Variante, wo du am wenigsten Probleme hast."}, {"id": 730, "start": 5243.24, "end": 5259.24, "text": "Die legen wir jetzt mal erstmal leer an, ohne dass er was macht."}, {"id": 731, "start": 5259.24, "end": 5267.24, "text": "Refresh, ich weiß nicht, ob das ein schöner Name ist, aber das passt schon."}, {"id": 732, "start": 5267.24, "end": 5275.24, "text": "Refresh Keybindings macht erstmal nichts. Wir werden gleich basteln, dass die was macht."}, {"id": 733, "start": 5275.24, "end": 5293.24, "text": "Und wenn das Event aufgerufen wird, also sprich, sobald sich hier was ändert im Hintergrund, dann wollen wir diese Refresh Keybindings aufrufen."}, {"id": 734, "start": 5293.24, "end": 5309.24, "text": "Ich überlege gerade, wie wir das jetzt gescheit machen."}, {"id": 735, "start": 5309.24, "end": 5313.24, "text": "Was hat er für Schmerzen? Warum geht es nicht?"}, {"id": 736, "start": 5313.24, "end": 5326.24, "text": "Okay, es funktioniert nicht, weil ich sage hier ja, dass dieses Event möchte Event-Arcs übergeben, aber diese Funktion hier nimmt keine Event-Arcs."}, {"id": 737, "start": 5326.24, "end": 5330.24, "text": "Aber eigentlich will ich überhaupt keine Event-Arcs. Das brauche ich ja auch nicht."}, {"id": 738, "start": 5330.24, "end": 5341.24, "text": "Updated reicht. Updated heißt, ich muss mir die Liste neu abrufen und gut ist."}, {"id": 739, "start": 5341.24, "end": 5347.24, "text": "Ganz schnell mal eine Frage. Man könnte sich für LoL einen Overlay machen und solange man es in Windows Fullscreen hat, sollte das klappen, oder?"}, {"id": 740, "start": 5347.24, "end": 5351.24, "text": "Ja. Richtig."}, {"id": 741, "start": 5351.24, "end": 5359.24, "text": "Wenn du in Borderless Windout Mode oder irgendwie sowas hast, dann geht das."}, {"id": 742, "start": 5359.24, "end": 5364.24, "text": "Das funktioniert ja auch, was wir hier haben. Also die Bilder kannst du in LoL, wenn Windout Modus ist, kannst du anzeigen."}, {"id": 743, "start": 5364.24, "end": 5378.24, "text": "Hallo Max 3 Elmuth, Max Selmuth, Max Elmuth. Das funktioniert in LoL."}, {"id": 744, "start": 5378.24, "end": 5388.24, "text": "So, wir sind stehen geblieben. Okay, gucken wir mal, ob das prinzipiell tut."}, {"id": 745, "start": 5388.24, "end": 5391.24, "text": "Okay, das wird funktionieren, wenn man das richtig aufruft."}, {"id": 746, "start": 5391.24, "end": 5407.24, "text": "Das ist auch so was, als kleiner Tipp. Wenn ihr mal irgendwo Parameter kriegt, die ihr übergeben bekommt, die ihr eigentlich gar nicht braucht, kann man einfach hier underscore underscore schreiben."}, {"id": 747, "start": 5407.24, "end": 5420.24, "text": "Also Variable dürfen halt so heißen. Das ist so ein bisschen inoffizielle Konvention für, dass man es wegwirft."}, {"id": 748, "start": 5420.24, "end": 5433.24, "text": "LoL blockt Hotkeys von den meisten Programmen. Bin mir nicht sicher, ob das bei Memeboard geht."}, {"id": 749, "start": 5433.24, "end": 5441.24, "text": "Na ja, doch. Also je nachdem, wie sie es gemacht haben, müsste das funktionieren."}, {"id": 750, "start": 5441.24, "end": 5462.24, "text": "Das einzige, was sein könnte, wenn die einen eigenen Tastaturtreiber haben, so ein Low-Level-Ding, wie das VMWare zum Beispiel hat, und exklusiv die Tastendrücke abgreifen, bevor die quasi überhaupt bei Windows ankommen sozusagen."}, {"id": 751, "start": 5462.24, "end": 5472.24, "text": "Dann könnte das sein, dass es nicht funktioniert."}, {"id": 752, "start": 5472.24, "end": 5479.24, "text": "Allerdings würde damit ja LoL auch alle anderen Funktionen aushebeln."}, {"id": 753, "start": 5479.24, "end": 5492.24, "text": "Also sprich, wenn du eine, keine Ahnung, da kannste nicht mal Windows switchen gescheit, wenn die sowas blocken."}, {"id": 754, "start": 5492.24, "end": 5499.24, "text": "Es kann sein, dass die da was dagegen gebaut haben, weil die wollen ja wahrscheinlich auch gegen Makrosoftware vorgehen."}, {"id": 755, "start": 5499.24, "end": 5506.24, "text": "Wir können irgendwann mal ausprobieren, ob es in LoL funktioniert. Ich habe LoL noch nie installiert, aber wir können es ja mal ausprobieren."}, {"id": 756, "start": 5506.24, "end": 5520.24, "text": "Machen wir nichts bestreben."}, {"id": 757, "start": 5520.24, "end": 5536.24, "text": "Also wenn AutoHotkey nicht funktioniert in LoL, dann spricht das für ihren eigenen Tastaturtreiber, wie das VMWare auch macht."}, {"id": 758, "start": 5536.24, "end": 5550.24, "text": "Wobei, Moment, es ist ein Unterschied, geht es jetzt um Shortcuts senden an das Programm, ohne einfach nur Shortcuts durchlassen, dass ein anderes Programm darauf reagieren kann."}, {"id": 759, "start": 5550.24, "end": 5557.24, "text": "Dass Key Inputs senden an LoL nicht funktioniert, kann ich mir vorstellen, das wäre bescheuert, wenn sie das machen würden."}, {"id": 760, "start": 5557.24, "end": 5564.24, "text": "Aber ob die Shortcuts blocken, sodass sie auch bei anderen Programmen nicht ankommen, das kann ich mir kaum vorstellen."}, {"id": 761, "start": 5564.24, "end": 5573.24, "text": "Da würde ja Discord-Muten nicht mehr funktionieren. Stellt euch vor, LoL würde Shortcuts blocken, dann könnte ich mich im Discord nicht mehr muten."}, {"id": 762, "start": 5573.24, "end": 5595.24, "text": "Also sprich, wenn ich jetzt im Discord ein Shortcut für Alt-GR und M anlege, dass es mich jetzt mutet im Discord, und es würden die blocken, dann könnte es das glaube ich nicht."}, {"id": 763, "start": 5595.24, "end": 5604.24, "text": "So, übrigens, wir machen mal kurz weiter. Also wir wollen im Prinzip, sobald sich hier irgendwas ändert, die Key Bindings refreshen."}, {"id": 764, "start": 5604.24, "end": 5614.24, "text": "Ja, das wollen wir machen. Bloß das Key Bindings Refreshen halt gerade noch nichts macht, aber prinzipiell wollen wir das machen."}, {"id": 765, "start": 5614.24, "end": 5624.24, "text": "Jetzt müssen wir natürlich noch dafür sorgen, dass das Event, er meckerte ja schon, dass es nicht benutzt wird, dass das Event auch getriggert wird, sobald sich was ändert."}, {"id": 766, "start": 5624.24, "end": 5634.24, "text": "Und im Prinzip müssen wir das Event hier am unteren Ende von dieser Funktion triggern."}, {"id": 767, "start": 5634.24, "end": 5645.24, "text": "Also im Prinzip, sobald das hier durchgelaufen ist und alles richtig einsortiert wurde, können wir sagen, hallo an alle da draußen, es hat sich was geändert."}, {"id": 768, "start": 5645.24, "end": 5661.24, "text": "So, dann sagen wir es dis, update, invoke, invoke. So, und die ganzen Event-Arcs-Scheiß brauche ich nicht, die brauche ich eh nicht, will ich eh nicht auswerten."}, {"id": 769, "start": 5661.24, "end": 5667.24, "text": "Das ist übrigens auch schönes neues C sharp 7 Feature. Früher musste man immer sowas hier machen."}, {"id": 770, "start": 5667.24, "end": 5680.24, "text": "Dis, updated, ungleich Null, ungleich Null und dann, und dann konnte man sagen, dis, updated, ausführen."}, {"id": 771, "start": 5680.24, "end": 5687.24, "text": "Oder, ging das überhaupt so? Ja, genau. Doch, das ging so. So musste man das früher machen."}, {"id": 772, "start": 5687.24, "end": 5702.24, "text": "Weil es könnte ja sein, dass es niemand gibt, der das Event haben will. Und wenn es keinen gibt, der das Event haben will und ich rufe das Event auf, dann gibt es einen Fehler, weil er versucht was aufzurufen, wo halt nichts ist."}, {"id": 773, "start": 5702.24, "end": 5710.24, "text": "Das kann man jetzt schon umgehen mit diesem Null-Gedöns-Operator in C sharp 7. Fragt mich nicht, wie das Teil heißt, genau."}, {"id": 774, "start": 5710.24, "end": 5717.24, "text": "Der ruft das also nur auf, wenn da mindestens einer ist, der das Event haben will."}, {"id": 775, "start": 5717.24, "end": 5724.24, "text": "So, was mir jetzt echt auch krankkeks geht hier, dass ich hier irgendwelche komischen Event-Arcs und Geschiss brauche, das will ich nicht."}, {"id": 776, "start": 5724.24, "end": 5732.24, "text": "Das ist bescheuert, brauche ich nicht. Ich will einfach nur update wissen."}, {"id": 777, "start": 5732.24, "end": 5742.24, "text": "Du musst doch auch nicht, dass die... Das stimmt. Kann ich einfach einen normalen Event-Händler verwenden?"}, {"id": 778, "start": 5742.24, "end": 5748.24, "text": "Naja, da muss ich aber auch so einen Scheiß angeben."}, {"id": 779, "start": 5748.24, "end": 5763.24, "text": "Nee, eine eigene Delegate will ich nicht, das ist doof. Sucked. Da muss doch jemand anderes geben. Da gibt es was schöneres für. 100 Pro."}, {"id": 780, "start": 5763.24, "end": 5778.24, "text": "Stack Overflow. C sharp. Empty Event-Händler. Ich habe keine Ahnung, was ich suchen soll. Krass."}, {"id": 781, "start": 5778.24, "end": 5784.24, "text": "Die wichtigsten Sachen, die wichtigsten Sachen, alle schon mal angeguckt."}, {"id": 782, "start": 5784.24, "end": 5794.24, "text": "Gecheat. Exposed. Max revealed. Ich habe gecheatet, ich habe schon mal nachgeguckt."}, {"id": 783, "start": 5794.24, "end": 5800.24, "text": "Nee, das will ich nicht, ich will kein eigenen. Ja, das ist kacke, das will ich nicht."}, {"id": 784, "start": 5800.24, "end": 5809.24, "text": "Ich will kein eigenen, das ist doof."}, {"id": 785, "start": 5809.24, "end": 5815.24, "text": "Das ist eine gute Idee, laubpetin. Das ist eine wirklich nice Idee."}, {"id": 786, "start": 5815.24, "end": 5818.24, "text": "Wir nehmen einfach kein Event-Händler, wir nehmen eine Action."}, {"id": 787, "start": 5818.24, "end": 5822.24, "text": "Und da können wir wahrscheinlich die Funktion sogar direkt... Oh, das ist sehr nice, das gefällt mir."}, {"id": 788, "start": 5822.24, "end": 5830.24, "text": "Da können wir nämlich die Funktion wahrscheinlich direkt hier dran hängen."}, {"id": 789, "start": 5830.24, "end": 5840.24, "text": "Oh, das ist schick. Das ist schick. Oh ja, das ist das, gefällt mir."}, {"id": 790, "start": 5840.24, "end": 5847.24, "text": "Das ist sehr nice. So mag ich das. Kein überflüssiges Geblubber, einfach nur das Nötigste."}, {"id": 791, "start": 5847.24, "end": 5854.24, "text": "Das Einzige, was wir jetzt noch nicht gemacht haben, obwohl ich am Anfang des Streams da irgendwie 20 Minuten drüber gelabert habe, ist,"}, {"id": 792, "start": 5854.24, "end": 5861.24, "text": "wenn ich jetzt eben aus diesem Thread komme und in meinem UI-Thread etwas aufrufe, und je nachdem, was ich hier mache, kann es knallen."}, {"id": 793, "start": 5861.24, "end": 5866.24, "text": "Dementsprechend muss ich sicherstellen, dass es im richtigen Thread aufgerufen wird."}, {"id": 794, "start": 5866.24, "end": 5875.24, "text": "Das heißt, ich brauche noch einen Invoke. So, und dann funktioniert das nämlich auch nicht mehr so einfach."}, {"id": 795, "start": 5875.24, "end": 5880.24, "text": "Aber, weißt was, drauf geschissen. Es sieht halt ein bisschen hässlicher aus, aber es funktioniert."}, {"id": 796, "start": 5880.24, "end": 5890.24, "text": "Jetzt ist nämlich sichergestellt, dass RefreshKeyBindings immer im UI-Thread aufgerufen wird und nicht hier von diesem Background-Filesystem."}, {"id": 797, "start": 5890.24, "end": 5900.24, "text": "Watcher. So, das Ding hier ist jetzt eigentlich fertig. Mehr muss ich da nicht mehr dran machen."}, {"id": 798, "start": 5900.24, "end": 5909.24, "text": "Das funktioniert. Das finde ich sehr nice. Achso, doch, eine Sache muss ich noch machen, fällt mir klar."}, {"id": 799, "start": 5909.24, "end": 5922.24, "text": "Ich muss das Ding ja einmal initial befüllen. Also quasi das, was ich hier mache, muss ich hier einmal am Anfang machen."}, {"id": 800, "start": 5922.24, "end": 5941.24, "text": "Komm, wir machen das klassisch mit irgendeiner Schleife. Vorfile in Files, und jetzt sagen wir einfach this add."}, {"id": 801, "start": 5941.24, "end": 5948.24, "text": "So, jetzt haben wir nämlich den ganzen Campbell drin, und das ist einmal initial befüllt. Alles gut, alles toll."}, {"id": 802, "start": 5948.24, "end": 5958.24, "text": "Dann tauschen wir jetzt den Campbell erstmal aus. Und zwar, wir wollen jetzt keine interne Liste mehr mit Memes haben,"}, {"id": 803, "start": 5958.24, "end": 5978.24, "text": "sondern wir wollen ein internes Memerepo haben, was jetzt einfach mal ganz willig hardcoded mit dem Fahrt aufgerufen wird."}, {"id": 804, "start": 5978.24, "end": 5986.24, "text": "Load brauchen wir auch nicht mehr. Load können wir hier rausschmeißen. Ah, das Ganze wird gleich schon ein bisschen übersichtlicher."}, {"id": 805, "start": 5986.24, "end": 6003.24, "text": "Das da verschieben wir mal in eine eigene Datei. So, jetzt gibt es aber doch irgendwelche Fehler."}, {"id": 806, "start": 6003.24, "end": 6018.24, "text": "Genau. Jetzt muss ich mal meinen bestehenden Code umstellen, der ja auf die interne Liste zugegriffen hat, dass der jetzt dieses Repo verwendet."}, {"id": 807, "start": 6018.24, "end": 6031.24, "text": "So. Updaten wir einfach nur, dass die Fehler weggehen. Und dann arbeiten wir uns da mal langsam vor."}, {"id": 808, "start": 6031.24, "end": 6039.24, "text": "Okay, jetzt sollte die gleiche Funktionalität wie vorher auch noch tun. Genau, aber das Updaten und so funktioniert natürlich noch nicht."}, {"id": 809, "start": 6039.24, "end": 6047.24, "text": "Aber Bildchen und so funktionieren alle. Also das klappt prinzipiell schon mal."}, {"id": 810, "start": 6047.24, "end": 6061.24, "text": "So. Ach ja, das müssen wir auch noch machen, dass Bild hoch und runter die Kreiselanimation triggert."}, {"id": 811, "start": 6061.24, "end": 6081.24, "text": "So. Ich meine, von der Idee her muss ich jetzt einfach bei einem Refresh..."}, {"id": 812, "start": 6081.24, "end": 6096.24, "text": "Also sobald sich was geändert hat in dem Ort, dann muss ich ja meine Keybindings refreshen. Das heißt doch, von der Idee her, dass ich sowas hier machen muss."}, {"id": 813, "start": 6096.24, "end": 6111.24, "text": "Keybindings, clear. So. Und danach haben wir mal irgendwie eine Schleife über die neuen."}, {"id": 814, "start": 6111.24, "end": 6120.24, "text": "So. Nachdem das auch immer eine Kopie vom aktuellsten Stand ist, habe ich da auch gar nicht Gefahr, dass irgendwas kaputt geht."}, {"id": 815, "start": 6120.24, "end": 6132.24, "text": "So. Und jetzt fügen wir einfach das neu ein. Also im Prinzip nehmen wir einfach die Funktion, die wir schon mal gemacht haben hier."}, {"id": 816, "start": 6132.24, "end": 6145.24, "text": "Set Keybindings. So. Jetzt bin ich ja mal gespannt, ob das funktioniert."}, {"id": 817, "start": 6145.24, "end": 6153.24, "text": "So. Okay. Wir kopieren jetzt mal was. Wir kopieren jetzt mal was. Mal gucken, ob das funktioniert."}, {"id": 818, "start": 6153.24, "end": 6165.24, "text": "Wir kopieren jetzt da ein neues Bild rein, was den Shortcut F11 registrieren will."}, {"id": 819, "start": 6165.24, "end": 6180.24, "text": "Kaputt. Funktioniert nicht. Was habe ich denn verkehrt gemacht?"}, {"id": 820, "start": 6180.24, "end": 6202.24, "text": "Fuck. What? Hä? Moment, gibt es das schon? Warum ist der already in use? Ich clear den Scheiß hier."}, {"id": 821, "start": 6202.24, "end": 6212.24, "text": "Ah, ich habe eine Idee. Das könnte sein, dass ja, die Dinger werden wahrscheinlich erst regulär geklärt, wenn das nächste Mal der Garbage-Collector läuft."}, {"id": 822, "start": 6212.24, "end": 6219.24, "text": "Hier verlieren sie alle Keybindings quasi ja nur ihre Referenz. Das heißt, ich muss die Dinger selbst aufräumen vorher."}, {"id": 823, "start": 6219.24, "end": 6238.24, "text": "Hallo Jonas Nils. Wir probieren jetzt mal aus, ob das daran liegt. Also quasi sowas wie... Keine Ahnung, ich probiere das jetzt einfach mal aus."}, {"id": 824, "start": 6238.24, "end": 6253.24, "text": "Keybindings. So. Und jetzt muss man aufpassen. Was keine gute Idee ist, wäre jetzt sowas hier zu machen."}, {"id": 825, "start": 6253.24, "end": 6263.24, "text": "Ich könnte mir vorstellen, dass es Probleme gibt, wenn ich for each über eine Liste mache und im Lauf vom for each quasi den Inhalt dieser Liste kaputt mache."}, {"id": 826, "start": 6263.24, "end": 6275.24, "text": "Das ist glaube ich keine gute Idee. Deswegen machen wir mal vorher uns irgendwie eine temporäre andere Liste und machen das dann dann kaputt."}, {"id": 827, "start": 6275.24, "end": 6286.24, "text": "So. Gucken wir mal, ob es jetzt funktioniert. Jetzt wird es spannend."}, {"id": 828, "start": 6286.24, "end": 6296.24, "text": "Ich hoffe, heute kommt keiner wieder und sagt, Max, drück doch Steuerung C zum Kopieren."}, {"id": 829, "start": 6296.24, "end": 6302.24, "text": "Sollte offensichtlich sein, warum das nicht funktioniert gerade, wenn das Programm gestartet ist."}, {"id": 830, "start": 6302.24, "end": 6322.24, "text": "Bäm. Funktioniert."}, {"id": 831, "start": 6322.24, "end": 6338.24, "text": "Poggers, Alter. Poggers. Omega Poggers. Monka Giga Poggers. Okay, das war es. Das war das Problem."}, {"id": 832, "start": 6338.24, "end": 6345.24, "text": "Oh, ich habe eine Idee. Wir können jetzt den übelst krassen Hack machen. Also, naja. Das war jetzt... Okay, die Ankündigung war ein bisschen übertrieben."}, {"id": 833, "start": 6345.24, "end": 6352.24, "text": "Aber ich habe eine Idee. Wir könnten jetzt mal... Also, es wird jetzt hässlich. Ich will bloß mal ausprobieren, ob das funktioniert."}, {"id": 834, "start": 6352.24, "end": 6361.24, "text": "Man könnte noch eigentlich sagen... Also, jetzt mal, wenn ich mir die Schleife sparen will, ich könnte jetzt quasi sowas hier in der Richtung machen."}, {"id": 835, "start": 6361.24, "end": 6375.24, "text": "Ähm, guck mal, ob das funktioniert. For each, ähm, äh, äh, key, key dispose."}, {"id": 836, "start": 6375.24, "end": 6384.24, "text": "Das geht. Was findet ihr schöner, so oder mit Schleife? Das sollte eigentlich das Gleiche machen."}, {"id": 837, "start": 6384.24, "end": 6393.24, "text": "So oder mit Schleife. Und vielleicht sogar noch kürzer. Einfach nur so."}, {"id": 838, "start": 6393.24, "end": 6410.24, "text": "Einfach nur so. Ich habe halt meine Bedenken, wenn ich quasi die Sachen kaputt mache in der Liste, während ich quasi drüber laufe."}, {"id": 839, "start": 6410.24, "end": 6421.24, "text": "Probieren wir es einfach mal aus. Scheiße, aber das sehen wir jetzt dann gleich. Ob das was bringt oder nicht."}, {"id": 840, "start": 6421.24, "end": 6425.24, "text": "Ich kann es jetzt löschen. Geht genauso. Nö. Okay, wir können uns das zu Listen sparen."}, {"id": 841, "start": 6425.24, "end": 6433.24, "text": "Da war ich ein bisschen übertrieben. Vorsichtig jetzt wahrscheinlich. Ja, so ist doch viel schicker. So ist es doch wirklich nice."}, {"id": 842, "start": 6433.24, "end": 6440.24, "text": "Wir löschen alle Keybindings, werfen danach unsere Liste mit Keybindings weg. Also den Inhalt der Liste mit Keybindings."}, {"id": 843, "start": 6440.24, "end": 6450.24, "text": "Und machen neue Keybindings. Eats as fuck, würde ich sagen. So und wir können das Ganze übrigens noch ein bisschen verkürzen."}, {"id": 844, "start": 6450.24, "end": 6459.24, "text": "Also ein Switch kann auch mal ein infinitendes Ding nicht in Bindingkey, sondern in Prefix. Weil an der Stelle ist es kein Key oder sonst was."}, {"id": 845, "start": 6459.24, "end": 6466.24, "text": "Es ist einfach nur ein String-Prefix. Key wird es erst hier drinnen, wenn man daraus ein Hotkey macht. So wir nennen das Ding Prefix."}, {"id": 846, "start": 6466.24, "end": 6480.24, "text": "Und nachdem wir ja gerade irgendwie schon den leichten Hang zu 1-Heilern haben, ich benenne das hier auch nochmal um."}, {"id": 847, "start": 6480.24, "end": 6488.24, "text": "Das heißt nicht change me, sondern zählen wir mal. Toggle me. Weil es zeigt ja auch das gleiche an und lässt es verschwinden."}, {"id": 848, "start": 6488.24, "end": 6498.24, "text": "So, nachdem ich gerade den Hang zu 1-Heilern habe, was haltet ihr denn von?"}, {"id": 849, "start": 6498.24, "end": 6511.24, "text": "Achtung, ich bin noch nicht fertig. Ich bin noch nicht fertig. Was haltet ihr denn von sowas hier?"}, {"id": 850, "start": 6511.24, "end": 6528.24, "text": "Okay, das ist vielleicht ein bisschen übertrieben an einen Zeiler jetzt, oder?"}, {"id": 851, "start": 6528.24, "end": 6538.24, "text": "So oder eine Funktion mit bisschen kürzeren Zeilen. Moin, naturedief, def."}, {"id": 852, "start": 6538.24, "end": 6543.24, "text": "Wir können einfach noch einen Zeilenobbruch rein machen. Ach so schlimm sieht das doch gar nicht aus mit einem Zeilenobbruch, oder?"}, {"id": 853, "start": 6543.24, "end": 6549.24, "text": "Das ist doch eigentlich ganz schick."}, {"id": 854, "start": 6549.24, "end": 6557.24, "text": "Eigentlich ist das das so ganz schick."}, {"id": 855, "start": 6557.24, "end": 6567.24, "text": "Bitte nehm geschweif- ne, ne, ne. Wenn wir es schon in einen Zeiler rein kriegen, dann machen wir das einfach ohne geschweifte Klammern."}, {"id": 856, "start": 6567.24, "end": 6571.24, "text": "Die ganze Klasse in eine Zeile."}, {"id": 857, "start": 6571.24, "end": 6591.24, "text": "Ach, ich finde das sieht gar nicht so schlecht aus jetzt. Es sieht schon ein bisschen hässlich aus. Ja, das muss man schon zugeben."}, {"id": 858, "start": 6591.24, "end": 6598.24, "text": "Egal. Ach ja, und das machen wir übrigens auch noch, fällt mir gerade auf. Man konnte dem Ding hier nämlich übergeben, ob case-sensitive oder nicht."}, {"id": 859, "start": 6598.24, "end": 6606.24, "text": "Das heißt, der interessiert sich jetzt dafür, ob es ein großes L ist oder ein kleines L hier und wir sagen ihm jetzt mal scheiß drauf. L ist L."}, {"id": 860, "start": 6606.24, "end": 6620.24, "text": "Ich lasse das jetzt mal so. Ich finde das eigentlich ganz schick. Es ist schon- also es ist jetzt nicht unbedingt das Schönste, aber dafür ist es kurz und knackig."}, {"id": 861, "start": 6620.24, "end": 6627.24, "text": "Mach das for each auch zu einem Lamm. Hab ich doch. Also hier innen drinnen."}, {"id": 862, "start": 6627.24, "end": 6630.24, "text": "So, fertig jetzt. Weiter, weiter im Text."}, {"id": 863, "start": 6630.24, "end": 6658.24, "text": "Gibt es überhaupt noch was weiter im Text? Ich meine, im Prinzip geht jetzt nicht das, was wir machen wollten."}, {"id": 864, "start": 6658.24, "end": 6664.24, "text": "Was mache ich hier eigentlich gerade? Das ist doch vollkommener Blödsinn."}, {"id": 865, "start": 6664.24, "end": 6683.24, "text": "Ich muss einmalig, einmalig, einmalig muss ich beim Start alle Keybindings anlegen und danach macht er das automatisch."}, {"id": 866, "start": 6683.24, "end": 6689.24, "text": "Danach macht er das automatisch immer, wenn sich was ändert."}, {"id": 867, "start": 6689.24, "end": 6693.24, "text": "Nee, da gibt es doch nichts drüber zu meckern."}, {"id": 868, "start": 6693.24, "end": 6697.24, "text": "Ja, das passt doch eigentlich. Eigentlich ist es genau das, was wir wollen. Mehr müssen wir doch gar nicht machen."}, {"id": 869, "start": 6697.24, "end": 6705.24, "text": "So, alles gut, alles nice."}, {"id": 870, "start": 6705.24, "end": 6714.24, "text": "So, was wir jetzt noch machen ist, dass das Bild sich dreht. Das brauche ich auf jeden Fall wieder."}, {"id": 871, "start": 6714.24, "end": 6719.24, "text": "Also sprich, dass das Bild muss sich drehen, sonst geht es nicht."}, {"id": 872, "start": 6719.24, "end": 6725.24, "text": "Die ursprüngliche Implementierung war ja, man klickt rechts auf das Bild, dann fängt es sich an zu drehen."}, {"id": 873, "start": 6725.24, "end": 6732.24, "text": "Das Problem ist, seitdem wir durch das Bild durchklicken können, ist halt mit Rechtsklick nichts mehr."}, {"id": 874, "start": 6732.24, "end": 6739.24, "text": "Dementsprechend müssen wir diese komischen Events da wieder weg machen."}, {"id": 875, "start": 6739.24, "end": 6747.24, "text": "What? Ah, ist das kompliziert. Warte, Window, da, Window."}, {"id": 876, "start": 6747.24, "end": 6757.24, "text": "Nein, geh weg. Piss dich alle. Das da weg, das da weg, gut, zack."}, {"id": 877, "start": 6757.24, "end": 6765.24, "text": "Das da weg, rumtracken ist eh nicht mehr angesagt."}, {"id": 878, "start": 6765.24, "end": 6771.24, "text": "Right Mouse Button ist auch nicht mehr angesagt."}, {"id": 879, "start": 6771.24, "end": 6780.24, "text": "Sondern wir registrieren uns jetzt einen neuen Hotkey für Page Up, Page Down."}, {"id": 880, "start": 6780.24, "end": 6790.24, "text": "Und hauen die Logik da rein. Und wir benennen das mal um."}, {"id": 881, "start": 6790.24, "end": 6798.24, "text": "Double Rotation. Und sagen jetzt hier, wir wollen den neuen Hotkey."}, {"id": 882, "start": 6798.24, "end": 6811.24, "text": "New Hotkey, äh, wieder Steuerung, Control, Key, äh, Page Down."}, {"id": 883, "start": 6811.24, "end": 6822.24, "text": "Page One mit Page Up an. Page Up. Und zwar..."}, {"id": 884, "start": 6822.24, "end": 6838.24, "text": "Double Rotation. Ah ja, das kann ich jetzt hier natürlich so nicht direkt übergeben."}, {"id": 885, "start": 6838.24, "end": 6852.24, "text": "Ich bin mit euch ganz sicher, wie wir das jetzt hier machen."}, {"id": 886, "start": 6852.24, "end": 6861.24, "text": "Hab ich verschrieben?"}, {"id": 887, "start": 6861.24, "end": 6869.24, "text": "Was, was, was hab ich vertan? Ah, ja, ich hab das unbenannt, obwohl es Blödsinn."}, {"id": 888, "start": 6869.24, "end": 6874.24, "text": "Brauchen wir doch alles gerne mehr. Okay, das funktioniert."}, {"id": 889, "start": 6874.24, "end": 6881.24, "text": "Äh, Key Up, Page, Page Down. Äh, Rosarota, Panther, ich zeig's dir gleich."}, {"id": 890, "start": 6881.24, "end": 6892.24, "text": "Schauen wir mal, ob das funktioniert mit der Rotation. Ha! Oh, nice! Jetzt haben wir einen richtig geilen Lull-Effekt noch."}, {"id": 891, "start": 6892.24, "end": 6897.24, "text": "Omega-Lull."}, {"id": 892, "start": 6897.24, "end": 6911.24, "text": "Monka-Shake. Monka-Shake. Also, das kann ich sehr zeigen."}, {"id": 893, "start": 6911.24, "end": 6916.24, "text": "Äh, Rosarota, Panther, was hier programmiert wird, äh, ist eigentlich das, was du hier siehst."}, {"id": 894, "start": 6916.24, "end": 6922.24, "text": "Du kannst Bilder transparent overlayen über alle anderen Programme."}, {"id": 895, "start": 6922.24, "end": 6927.24, "text": "Ohne, dass es das Programm da drunter stören wird, weil guck hier, du siehst, du kannst sogar durchklicken durch das Bild."}, {"id": 896, "start": 6927.24, "end": 6934.24, "text": "Das ist quasi gar nicht da im Endeffekt. Das ist Big Brain, das Programm, nicht Big Brain."}, {"id": 897, "start": 6934.24, "end": 6942.24, "text": "So, mir ist gerade etwas eingefallen, wir können uns diese ganze Funktion hier umsparen."}, {"id": 898, "start": 6942.24, "end": 6947.24, "text": "Wir können uns die ganze Funktion hier ersparen. Weil im Prinzip das einzige, was wir hier drin machen ist,"}, {"id": 899, "start": 6947.24, "end": 6952.24, "text": "Storyboard, Start, Stop, Begin, Begin, Stop. Wir brauchen den ganzen Scheiß nicht."}, {"id": 900, "start": 6952.24, "end": 6971.24, "text": "Wir können einfach hier sagen, begin und end. Fertig."}, {"id": 901, "start": 6971.24, "end": 6980.24, "text": "Ups, ne, Stop, Stop war es, ne, Stop. So, wisst ihr, wieder was gelöscht."}, {"id": 902, "start": 6980.24, "end": 6985.24, "text": "Wenn man versucht, ein Meme auf Page Up und Down zu legen, stürzt er ab. Ja."}, {"id": 903, "start": 6985.24, "end": 6990.24, "text": "Das würde er aktuell noch machen."}, {"id": 904, "start": 6990.24, "end": 6998.24, "text": "Das finde ich ist ein geiler Effekt irgendwie, oder?"}, {"id": 905, "start": 6998.24, "end": 7010.24, "text": "Ok, Page Down zum Rotation Stoppen, Page Up für Rotation Starten."}, {"id": 906, "start": 7010.24, "end": 7020.24, "text": "Das hat irgendwie was. Geht das auch mit Omega Null?"}, {"id": 907, "start": 7020.24, "end": 7029.24, "text": "Oder kriegst du es ja mit Angst zu tun, ey."}, {"id": 908, "start": 7029.24, "end": 7032.24, "text": "Freust du dich auf Battlefield 5?"}, {"id": 909, "start": 7032.24, "end": 7037.24, "text": "Ich bin, ne, ehrlich gesagt, freue ich mich nicht auf Battlefield 5."}, {"id": 910, "start": 7037.24, "end": 7041.24, "text": "Ich will mich von dem Game diesmal überzeugen lassen."}, {"id": 911, "start": 7041.24, "end": 7046.24, "text": "Ich gehe da mit keinen Erwartungen ran. Battlefield 1 hat mir ja, wie gesagt, ich habe es ja oft erzählt, überhaupt nicht gefallen."}, {"id": 912, "start": 7046.24, "end": 7053.24, "text": "Hallo, Schrecken. Es. Ich gehe da mit gar keinen Erwartungen dran. Ich will, dass das Spiel mich überzeugt diesmal."}, {"id": 913, "start": 7053.24, "end": 7058.24, "text": "Das kriegt keinen Vorschuss-Hype von mir, Battlefield 5."}, {"id": 914, "start": 7058.24, "end": 7068.24, "text": "Black Ops 4 übrigens auch nicht."}, {"id": 915, "start": 7068.24, "end": 7076.24, "text": "So."}, {"id": 916, "start": 7076.24, "end": 7079.24, "text": "Was hältst du von variabler Rotationsgeschwindigkeit? Ja, ich finde das eine gute Idee."}, {"id": 917, "start": 7079.24, "end": 7084.24, "text": "Und zwar, man sollte nicht nur links rotieren können, sondern man könnte vielleicht auch rechts rotieren."}, {"id": 918, "start": 7084.24, "end": 7091.24, "text": "Also man könnte quasi sagen, ok, ich drücke Page Up, er rotiert links, ich drücke Page Down, er stoppt."}, {"id": 919, "start": 7091.24, "end": 7095.24, "text": "Ich drücke Page Down und er rotiert in die andere Richtung."}, {"id": 920, "start": 7095.24, "end": 7098.24, "text": "Also man könnte nicht nur links rum rotieren, man könnte auch rechts rum rotieren."}, {"id": 921, "start": 7098.24, "end": 7105.24, "text": "Aber dazu muss ich mir erstmal Gedanken machen, weil dazu brauchen wir irgendwelche WPF-Magie, wo ich überhaupt keine Ahnung von habe."}, {"id": 922, "start": 7105.24, "end": 7122.24, "text": "Ich habe es ja mit Ach und Krach geschafft, diese Rotation das erste Mal mir zusammen zu Copy-Pasten von Stack Overflow."}, {"id": 923, "start": 7122.24, "end": 7132.24, "text": "Aber das nehme ich gerne als Pull-Request."}, {"id": 924, "start": 7132.24, "end": 7141.24, "text": "Also ich werde nach dem Stream wieder pushen, falls sich irgendjemand dazu berufen fühlt oder gerne daran mitwirken möchte."}, {"id": 925, "start": 7141.24, "end": 7152.24, "text": "Und das einbaut, dass man quasi nicht nur links rotieren kann, sondern auch rechts rotieren kann mit Bild hoch und runter."}, {"id": 926, "start": 7152.24, "end": 7158.24, "text": "Plus eventuell noch variable Rotationsgeschwindigkeit, wenn er richtig sophisticated langsam."}, {"id": 927, "start": 7158.24, "end": 7165.24, "text": "Den Pull-Request werde ich dann beim nächsten Stream gucken wir uns den zusammen an und Merchandise."}, {"id": 928, "start": 7165.24, "end": 7171.24, "text": "Gibt es jetzt noch etwas zu machen? Wir können noch den Krempel hier oben mal umbenennen."}, {"id": 929, "start": 7171.24, "end": 7173.24, "text": "Der meckert auch schon die ganze Zeit."}, {"id": 930, "start": 7173.24, "end": 7177.24, "text": "In was möchte er denn umbenannt werden? In SB."}, {"id": 931, "start": 7177.24, "end": 7185.24, "text": "Ne, bevor wir den SB nennen, nennen wir den Storyboard in groß."}, {"id": 932, "start": 7185.24, "end": 7195.24, "text": "Ja, okay."}, {"id": 933, "start": 7195.24, "end": 7204.24, "text": "Ja, also ich würde mal sagen, im Prinzip haben wir alles gemacht, was wir machen wollten."}, {"id": 934, "start": 7204.24, "end": 7211.24, "text": "Gibt jetzt eigentlich nichts mehr Großartiges zu tun in dem Stream heute, was Programmieren angeht?"}, {"id": 935, "start": 7211.24, "end": 7215.24, "text": "Nächsten Stream bringen wir dem Ding Netzwerkfunktionen bei."}, {"id": 936, "start": 7215.24, "end": 7223.24, "text": "Dann wird es spannend, weil das habe ich auch noch nicht gemacht mit SignalR."}, {"id": 937, "start": 7223.24, "end": 7227.24, "text": "Wie heißt denn das überhaupt? Wie spricht man das aus?"}, {"id": 938, "start": 7227.24, "end": 7236.24, "text": "SignalR, SignalIR, IR, IR, IR, wie spricht man das aus?"}, {"id": 939, "start": 7236.24, "end": 7242.24, "text": "Habe ich nämlich mal einen Guide zugelesen und damit probieren wir das dann."}, {"id": 940, "start": 7242.24, "end": 7248.24, "text": "Da bringen wir dem Ding Netzwerkfunktionen bei, dass man quasi ein Dashboard hat,"}, {"id": 941, "start": 7248.24, "end": 7255.24, "text": "ein bisschen wie diese Ordnerübersicht eigentlich, aber halt auf einem zweiten Monitor oder auf einem zweiten Rechner,"}, {"id": 942, "start": 7255.24, "end": 7264.24, "text": "wo man halt quasi in diesem Dashboard anklicken kann und das, was man anklickt, erscheint dann, wird dann hier eingeplendet."}, {"id": 943, "start": 7264.24, "end": 7270.24, "text": "Also sprich, ich kann dann auf einem zweiten Rechner übers Netzwerk sagen,"}, {"id": 944, "start": 7270.24, "end": 7278.24, "text": "hey, ich möchte jetzt gerne dieses Bildchen hier aktivieren und dann erscheint es auf dem anderen Rechner."}, {"id": 945, "start": 7278.24, "end": 7284.24, "text": "Das ist Pflicht, wenn man eine gewisse Anzahl hat, weil erstens, es soll ja nicht alles Shortcuts kriegen,"}, {"id": 946, "start": 7284.24, "end": 7290.24, "text": "wenn man jetzt zum Beispiel irgendwas spielt oder irgendwie einen Livestream oder irgendwie"}, {"id": 947, "start": 7290.24, "end": 7294.24, "text": "nehmen wir die E3 Pressekonferenz kommentiert, ein bisschen blödes Zeug dazu erzählt,"}, {"id": 948, "start": 7294.24, "end": 7299.24, "text": "dann brauche ich ja nicht für alles Shortcuts, ich brauche hier so 3-4 Bildchen, die brauche ich laufend"}, {"id": 949, "start": 7299.24, "end": 7304.24, "text": "und die anderen kann ich dann quasi über das Dashboard aktivieren vom anderen Rechner,"}, {"id": 950, "start": 7304.24, "end": 7311.24, "text": "weil wenn ich hier jedes Mal die ganzen Shortcuts mir merken muss bzw. hier mit Steuerung C jetzt ja auch wichtige Shortcuts belege,"}, {"id": 951, "start": 7311.24, "end": 7316.24, "text": "ist ein bisschen blöd. Das heißt, das nächste Mal gucken wir uns mal an,"}, {"id": 952, "start": 7316.24, "end": 7321.24, "text": "wie wir dem Ding Netzwerkfunktionen beibringen, dass ich das fernsteuern kann, das Ganze noch."}, {"id": 953, "start": 7321.24, "end": 7330.24, "text": "Und wenn das fertig ist, werde ich das auch als erste Version dann zum runterladen für Nicht-Entwickler veröffentlichen"}, {"id": 954, "start": 7330.24, "end": 7336.24, "text": "auf GitHub, dass man sich direkt runterladen kann. Aktuell kann man sich ja auch hier angucken auf"}, {"id": 955, "start": 7336.24, "end": 7347.24, "text": "Systema, wichtige Shortcuts belegen, GitHub, Inboard und sich selbst kompilieren, wenn man das will."}, {"id": 956, "start": 7347.24, "end": 7353.24, "text": "Wenn die Netzwerkfunktion fertig ist, dann werde ich das auch direkt einmal zum Download anbieten,"}, {"id": 957, "start": 7353.24, "end": 7356.24, "text": "dass das kann dann jeder verwenden, der will."}, {"id": 958, "start": 7356.24, "end": 7366.24, "text": "So, da wirklich langsam mal mit Programming heute fertig."}, {"id": 959, "start": 7366.24, "end": 7370.24, "text": "Ich gucke mal, ob der Ehex da ist. Wenn der Ehex da ist, spielen wir jetzt noch eine Runde."}, {"id": 960, "start": 7370.24, "end": 7380.24, "text": "Oder werden wir jetzt noch 1-2 Stunden, eher 2,5 Stunden, bis 22 Uhr spielen wir noch Realm Royale."}, {"id": 961, "start": 7380.24, "end": 7385.24, "text": "Oh, der Meshed streamt auch gerade Realm Royale. Da müssen wir jetzt mal gucken."}, {"id": 962, "start": 7385.24, "end": 7395.24, "text": "Der Meshed streamt Realm Royale."}, {"id": 963, "start": 7395.24, "end": 7401.24, "text": "Gucken."}, {"id": 964, "start": 7401.24, "end": 7405.24, "text": "Outer?"}, {"id": 965, "start": 7405.24, "end": 7411.24, "text": "Sieht man nicht richtig. Er ist zumindest gleich tot."}, {"id": 966, "start": 7411.24, "end": 7416.24, "text": "Reckt. Schreckt."}, {"id": 967, "start": 7416.24, "end": 7422.24, "text": "Hast du mal in Quake Champions reingeguckt? Nee."}, {"id": 968, "start": 7422.24, "end": 7426.24, "text": "Ich kenne das von Streams, ja, aber etwas gespielt habe ich es noch nicht."}, {"id": 969, "start": 7426.24, "end": 7435.24, "text": "So, sind wir jetzt hier fertig? Ist ja noch irgendwas offensichtliches, was wir noch machen müssen."}, {"id": 970, "start": 7435.24, "end": 7445.24, "text": "Sollte Mist drinne stehen, quasi hier vorne, sollte hier einer sagen, ich möchte als Shortcut"}, {"id": 971, "start": 7445.24, "end": 7451.24, "text": "irgendwie irgendeine Taste haben, die es nicht gibt."}, {"id": 972, "start": 7451.24, "end": 7457.24, "text": "Also ich möchte als Shortcut jetzt blub. Es gibt ja offensichtlich die Taste blub auf der Tastatur nicht."}, {"id": 973, "start": 7457.24, "end": 7462.24, "text": "Dann wäre er abgekackt und jetzt kackt er nicht mal ab, weil jetzt versucht er zu erkennen,"}, {"id": 974, "start": 7462.24, "end": 7467.24, "text": "was das für ein Key ist und wenn er den Key nicht erkennt, dann legt er es einfach nicht an."}, {"id": 975, "start": 7467.24, "end": 7474.24, "text": "Das ist insofern eigentlich schon mal recht fehlertolerant jetzt dadurch geworden."}, {"id": 976, "start": 7474.24, "end": 7484.24, "text": "Was er nicht abfängt bis jetzt ist, wenn es das schon gibt."}, {"id": 977, "start": 7484.24, "end": 7495.24, "text": "Das könnten wir theoretisch noch einbauen."}, {"id": 978, "start": 7495.24, "end": 7499.24, "text": "Also ich finde bei Realm Royale ist gerade, dass es verschiedene Helden mit Fähigkeiten gibt,"}, {"id": 979, "start": 7499.24, "end": 7504.24, "text": "auch das was es zu anderen Spielen irgendwo unterscheidet, zu anderen Battle Royale Spielen."}, {"id": 980, "start": 7504.24, "end": 7510.24, "text": "Ich meine, es hat ja schon im Vergleich zu Pupke, hat er den Realismus Faktor,"}, {"id": 981, "start": 7510.24, "end": 7516.24, "text": "Inventory Management, relativ viel Mikro Management, Fortnite hat das Bauen"}, {"id": 982, "start": 7516.24, "end": 7519.24, "text": "und Realm Royale hat halt Klassen mit Fähigkeiten."}, {"id": 983, "start": 7519.24, "end": 7522.24, "text": "Wenn du jetzt dem Spiel Klassen mit Fähigkeiten wegnehmen würdest,"}, {"id": 984, "start": 7522.24, "end": 7527.24, "text": "dann ist es nur noch ein halbes Game im Endeffekt."}, {"id": 985, "start": 7527.24, "end": 7533.24, "text": "Hat dich der Mesh eigentlich mal real gesehen? Ja."}, {"id": 986, "start": 7533.24, "end": 7543.24, "text": "Wir kennen uns schon seit ein paar Jahren."}, {"id": 987, "start": 7543.24, "end": 7550.24, "text": "Also ich überlege gerade, wer kennt mich eigentlich in echt von YouTube Leuten?"}, {"id": 988, "start": 7550.24, "end": 7556.24, "text": "Also länger als fünf Minuten mal gesehen."}, {"id": 989, "start": 7556.24, "end": 7559.24, "text": "Der Mesh kennt mich."}, {"id": 990, "start": 7559.24, "end": 7563.24, "text": "Wen kenne ich denn länger als fünf Minuten? Der kennt mich ja auch länger als fünf Minuten."}, {"id": 991, "start": 7563.24, "end": 7582.24, "text": "Der Mesh, der Lost, der Kanbum, der Self-Owned, der Krieger, der Gaming-Clerks, Nico."}, {"id": 992, "start": 7582.24, "end": 7592.24, "text": "Wen kenne ich denn noch? Wobei, den Nico habe ich auch nicht länger als fünf Minuten gesehen."}, {"id": 993, "start": 7592.24, "end": 7595.24, "text": "Wen kenne ich denn noch länger als fünf Minuten?"}, {"id": 994, "start": 7595.24, "end": 7604.24, "text": "Ja, die ganze Call of Duty, die ganzen ehemaligen Call of Duty Leute."}, {"id": 995, "start": 7604.24, "end": 7617.24, "text": "Also den Marcel, Montana Black, die ehemaligen Call of Duty Leute."}, {"id": 996, "start": 7617.24, "end": 7623.24, "text": "Wen kenne ich denn noch? Dr. Banks kenne ich noch."}, {"id": 997, "start": 7623.24, "end": 7626.24, "text": "Also ich kenne ein paar Leute, aber so wirklich gut,"}, {"id": 998, "start": 7626.24, "end": 7634.24, "text": "also länger und mit denen ich auch wirklich schon eine längere Zeit gelabert habe."}, {"id": 999, "start": 7634.24, "end": 7638.24, "text": "Von denen die noch aktiv sind, ist das eigentlich hauptsächlich der Mesh."}, {"id": 1000, "start": 7638.24, "end": 7643.24, "text": "Der Lost auch noch ein bisschen, aber ansonsten hält sich den Grenzen,"}, {"id": 1001, "start": 7643.24, "end": 7648.24, "text": "wo ich da großartig Kontakt habe mit YouTube Leuten."}, {"id": 1002, "start": 7648.24, "end": 7656.24, "text": "Ja, der Friseur, der ist jetzt keine YouTube Leute. Den Friseur kenne ich schon Jahre vor YouTube."}, {"id": 1003, "start": 7656.24, "end": 7658.24, "text": "Der ist der, ich kann es ja nicht dabei erzählen."}, {"id": 1004, "start": 7658.24, "end": 7662.24, "text": "Ah ja, der, äh, der, ähm..."}, {"id": 1005, "start": 7662.24, "end": 7666.24, "text": "Ich überlege gerade, kenne ich den Danny in Echt eigentlich?"}, {"id": 1006, "start": 7666.24, "end": 7669.24, "text": "Er stimmt in Solution noch, genau."}, {"id": 1007, "start": 7669.24, "end": 7672.24, "text": "Kenne ich, ich überlege gerade, ob ich den Danny in Echt mal gesehen habe, keine Ahnung."}, {"id": 1008, "start": 7672.24, "end": 7677.24, "text": "Nee, ich glaube nicht."}, {"id": 1009, "start": 7677.24, "end": 7681.24, "text": "Ah, was auch immer."}, {"id": 1010, "start": 7681.24, "end": 7686.24, "text": "Ich habe mich ja aus diesem ganzen YouTube Deutschland Zeug schon vor Jahren irgendwie ein bisschen rausgezogen,"}, {"id": 1011, "start": 7686.24, "end": 7689.24, "text": "weil mir das immer, immer, immer, weil das alles irgendwie, keine Ahnung,"}, {"id": 1012, "start": 7689.24, "end": 7697.24, "text": "immer weiter von dem weg entwickelt, wo ich mit was zu tun haben will."}, {"id": 1013, "start": 7697.24, "end": 7701.24, "text": "Ich habe, ich habe, äh, irgendwo letztens einen Streamausschnitt gesehen,"}, {"id": 1014, "start": 7701.24, "end": 7704.24, "text": "wo sich Montana Black eine Rolex gekauft hat im Livestream."}, {"id": 1015, "start": 7704.24, "end": 7708.24, "text": "Gut, wenn man, wenn man das halt unbedingt jedem zeigen muss,"}, {"id": 1016, "start": 7708.24, "end": 7718.24, "text": "dann warum nicht, aber das jetzt sein muss, sei mal dahingestellt."}, {"id": 1017, "start": 7718.24, "end": 7719.24, "text": "Das Trash-TV-YouTube."}, {"id": 1018, "start": 7719.24, "end": 7723.24, "text": "Ja, das Problem dabei ist ja gar nicht mal, dass es nichts Gescheites gibt."}, {"id": 1019, "start": 7723.24, "end": 7729.24, "text": "Es gibt ja genug Gescheites, aber es wird einfach geflutet von Bullshit auf YouTube."}, {"id": 1020, "start": 7729.24, "end": 7734.24, "text": "Und die Empfehlungen sind halt erst mal, wenn du da drauf kommst, so breit angelegt,"}, {"id": 1021, "start": 7734.24, "end": 7737.24, "text": "dass die gucken, dass die, wenn die dich noch nicht kennen, ne?"}, {"id": 1022, "start": 7737.24, "end": 7743.24, "text": "Denkt YouTube halt, aha, guckt mal, wir gucken, guckt es euch doch mal an."}, {"id": 1023, "start": 7743.24, "end": 7745.24, "text": "Guckt es euch doch mal an."}, {"id": 1024, "start": 7745.24, "end": 7748.24, "text": "Wenn ich hier, das haben wir das letzte Mal schon gemacht, das haben wir jetzt noch mal."}, {"id": 1025, "start": 7748.24, "end": 7753.24, "text": "Ähm, ach nee, Moment, ich muss mal, ich muss nen, nen, nen, nen."}, {"id": 1026, "start": 7753.24, "end": 7755.24, "text": "Ah ja, Git, äh, Committen muss ich noch."}, {"id": 1027, "start": 7755.24, "end": 7757.24, "text": "Committen muss ich noch und pushen."}, {"id": 1028, "start": 7757.24, "end": 7759.24, "text": "Mal gucken wir uns nochmal YouTube an."}, {"id": 1029, "start": 7759.24, "end": 7761.24, "text": "Ich mach gleich mal ein Inkognito-Tab auf."}, {"id": 1030, "start": 7761.24, "end": 7771.24, "text": "Ähm, Commit, ähm, Feinschliff."}, {"id": 1031, "start": 7771.24, "end": 7774.24, "text": "Das wäre beispielsweise so ein Commit, wo ich auf der Arbeit sagen würde,"}, {"id": 1032, "start": 7774.24, "end": 7777.24, "text": "schreib nochmal ein ordentliches, aber ich darf das jetzt hier."}, {"id": 1033, "start": 7777.24, "end": 7780.24, "text": "So."}, {"id": 1034, "start": 7780.24, "end": 7785.24, "text": "Push."}, {"id": 1035, "start": 7785.24, "end": 7788.24, "text": "Was kann der mal schreiben?"}, {"id": 1036, "start": 7788.24, "end": 7796.24, "text": "Master."}, {"id": 1037, "start": 7796.24, "end": 7797.24, "text": "Wat?"}, {"id": 1038, "start": 7797.24, "end": 7802.24, "text": "Ich hab doch mein Key, ich hab doch mein Key hochgeladen."}, {"id": 1039, "start": 7802.24, "end": 7807.24, "text": "Warum geht denn das nicht?"}, {"id": 1040, "start": 7807.24, "end": 7814.24, "text": "Was, was, was spackt denn das so rum?"}, {"id": 1041, "start": 7814.24, "end": 7836.24, "text": "Ist wieder Gefahr laufen mein Passwort zu exposen."}, {"id": 1042, "start": 7836.24, "end": 7839.24, "text": "Okay, ist gepusht, Leute."}, {"id": 1043, "start": 7839.24, "end": 7844.24, "text": "Wer sich dran beteiligen will, so zum Beispiel dieses, dieses Animationsding, Bild hoch, Bild runter."}, {"id": 1044, "start": 7844.24, "end": 7848.24, "text": "Pull-Requests sind immer willkommen."}, {"id": 1045, "start": 7848.24, "end": 7852.24, "text": "Auch der Pull-Request, der hat uns schon mal was gebracht."}, {"id": 1046, "start": 7852.24, "end": 7857.24, "text": "Wir konnten nachgucken, wie das mit dem Tray-Icon funktioniert."}, {"id": 1047, "start": 7857.24, "end": 7862.24, "text": "Leider ist das, passt das halt überhaupt nicht mehr zu unserem aktuellen"}, {"id": 1048, "start": 7862.24, "end": 7868.24, "text": "und auch nicht mit XML-Dateien, so wie im XML-Files, wie ich's haben wollte."}, {"id": 1049, "start": 7868.24, "end": 7872.24, "text": "Aber trotzdem, schön, dass du das eingereicht hast."}, {"id": 1050, "start": 7872.24, "end": 7875.24, "text": "Ich werd das jetzt mal..."}, {"id": 1051, "start": 7875.24, "end": 7878.24, "text": "Wie lehnt man hier auf GitHub überhaupt ab?"}, {"id": 1052, "start": 7878.24, "end": 7880.24, "text": "Ich close das mal, ne?"}, {"id": 1053, "start": 7880.24, "end": 7883.24, "text": "Wir haben es uns ja zusammen jetzt im Stream angeguckt,"}, {"id": 1054, "start": 7883.24, "end": 7886.24, "text": "auch ein paar nützliche Sachen jetzt rausgezogen,"}, {"id": 1055, "start": 7886.24, "end": 7895.24, "text": "aber in der Form passt es nicht mehr und ich will auch kein XML-Config."}, {"id": 1056, "start": 7895.24, "end": 7899.24, "text": "Bible-Thump."}, {"id": 1057, "start": 7899.24, "end": 7901.24, "text": "Was hast du für eine Tastatur?"}, {"id": 1058, "start": 7901.24, "end": 7908.24, "text": "Eine, hab's vorhin schon mal gezeigt, eine K95, eine Corsair K95 RGB Platinum."}, {"id": 1059, "start": 7908.24, "end": 7919.24, "text": "Das Ding da."}, {"id": 1060, "start": 7919.24, "end": 7924.24, "text": "Was wollen wir im nächsten Stream machen?"}, {"id": 1061, "start": 7924.24, "end": 7927.24, "text": "Es gibt ja im Prinzip zwei Sachen noch zur Auswahl."}, {"id": 1062, "start": 7927.24, "end": 7932.24, "text": "So zwei größere, größere Dinger noch zur Auswahl."}, {"id": 1063, "start": 7932.24, "end": 7939.24, "text": "Und zwar das Dashboard zum Fernsteuern von den Programmen."}, {"id": 1064, "start": 7939.24, "end": 7943.24, "text": "Das ist halt ne Sache, die brauch ich selbst, weil wenn ich,"}, {"id": 1065, "start": 7943.24, "end": 7946.24, "text": "beispielsweise wo ich den E3-Stream gezeigt hab,"}, {"id": 1066, "start": 7946.24, "end": 7950.24, "text": "ich hab mir so ne rudimentäre Sache ja schon mal gebaut,"}, {"id": 1067, "start": 7950.24, "end": 7953.24, "text": "da kann ich mir die Shortcuts nicht alle merken."}, {"id": 1068, "start": 7953.24, "end": 7956.24, "text": "Also hab ich mir einfach auf dem zweiten Bildschirm das Ganze aufgemacht"}, {"id": 1069, "start": 7956.24, "end": 7960.24, "text": "und konnte es dann dort anklicken und es wurde halt hier angezeigt."}, {"id": 1070, "start": 7960.24, "end": 7962.24, "text": "Das war echt praktisch."}, {"id": 1071, "start": 7962.24, "end": 7968.24, "text": "Also wollen wir die Fernsteuerung machen vom zweiten Rechner"}, {"id": 1072, "start": 7968.24, "end": 7971.24, "text": "oder vom zweiten Monitor aus, nächsten Stream,"}, {"id": 1073, "start": 7971.24, "end": 7984.24, "text": "wollen wir uns mal angucken, wie man Corsair RGB Tastaturen ansteuern kann."}, {"id": 1074, "start": 7984.24, "end": 7987.24, "text": "Sodass man zum Beispiel anzeigen lassen können,"}, {"id": 1075, "start": 7987.24, "end": 7995.24, "text": "wenn man einen Shortcut gedrückt hat, dass der gerade aktiv ist."}, {"id": 1076, "start": 7995.24, "end": 7996.24, "text": "Ich hab keine Ahnung, wie das geht."}, {"id": 1077, "start": 7996.24, "end": 7999.24, "text": "Ich hab nur auf GitHub gesehen, dass es eine Library gibt, die das macht."}, {"id": 1078, "start": 7999.24, "end": 8001.24, "text": "Wir könnten uns auch mal in dem Stream angucken,"}, {"id": 1079, "start": 8001.24, "end": 8010.24, "text": "wie man Corsair Tastaturen RGB Beleuchtung programmiert."}, {"id": 1080, "start": 8010.24, "end": 8014.24, "text": "Was wollen wir denn im nächsten Stream machen?"}, {"id": 1081, "start": 8014.24, "end": 8019.24, "text": "Netzwerk, Fernsteuerung oder Corsair RGB?"}, {"id": 1082, "start": 8019.24, "end": 8026.24, "text": "Auch die Musik ist weg."}, {"id": 1083, "start": 8026.24, "end": 8037.24, "text": "Beides ist eine größere Geschichte."}, {"id": 1084, "start": 8037.24, "end": 8042.24, "text": "Und ich kann mich keine fünf Stunden konzentrieren."}, {"id": 1085, "start": 8042.24, "end": 8043.24, "text": "RGB, okay."}, {"id": 1086, "start": 8043.24, "end": 8050.24, "text": "Also mir ist egal."}, {"id": 1087, "start": 8050.24, "end": 8052.24, "text": "24 Stunden Programming Stream."}, {"id": 1088, "start": 8052.24, "end": 8071.24, "text": "Ich bin ja immer noch begeistert, dass das so gut ankommt."}, {"id": 1089, "start": 8071.24, "end": 8077.24, "text": "Netzwerk."}, {"id": 1090, "start": 8077.24, "end": 8078.24, "text": "Stimmt."}, {"id": 1091, "start": 8078.24, "end": 8082.24, "text": "Und ich bräuchte dann wahrscheinlich eine Kamera für den Schreibtisch."}, {"id": 1092, "start": 8082.24, "end": 8085.24, "text": "Dass man sieht, dass die Tastatur leuchtet."}, {"id": 1093, "start": 8085.24, "end": 8090.24, "text": "Und sieht es ja langweilig aus."}, {"id": 1094, "start": 8090.24, "end": 8092.24, "text": "Dann machen wir erstmal Netzwerk."}, {"id": 1095, "start": 8092.24, "end": 8107.24, "text": "Dann machen wir erstmal Netzwerk."}, {"id": 1096, "start": 8107.24, "end": 8118.24, "text": "Ihr hört einfach gerne zu."}, {"id": 1097, "start": 8118.24, "end": 8125.24, "text": "Ein Tastatur-Cam."}, {"id": 1098, "start": 8125.24, "end": 8153.24, "text": "Ich habe es gepusht."}, {"id": 1099, "start": 8153.24, "end": 8163.24, "text": "So, ich mache mal kurz ein Release-Bild."}, {"id": 1100, "start": 8163.24, "end": 8166.24, "text": "Guck mal, ob das auch schön unabhängig läuft, alles."}, {"id": 1101, "start": 8166.24, "end": 8172.24, "text": "Weil ich glaube nämlich, dass das gar nicht die..."}, {"id": 1102, "start": 8172.24, "end": 8175.24, "text": "Das kopiert das nicht mit, oder?"}, {"id": 1103, "start": 8175.24, "end": 8177.24, "text": "Doch."}, {"id": 1104, "start": 8177.24, "end": 8184.24, "text": "Hä?"}, {"id": 1105, "start": 8184.24, "end": 8188.24, "text": "Leute, das muss mir jetzt mal jemand erklären, das Cheggie-Nut."}, {"id": 1106, "start": 8188.24, "end": 8192.24, "text": "Warum findet denn..."}, {"id": 1107, "start": 8192.24, "end": 8194.24, "text": "Wow!"}, {"id": 1108, "start": 8194.24, "end": 8199.24, "text": "Wir haben ordentlich viele Trey-Eikens erzeugt."}, {"id": 1109, "start": 8199.24, "end": 8201.24, "text": "Warum findet ihr denn das Trey-Eiken?"}, {"id": 1110, "start": 8201.24, "end": 8206.24, "text": "Das liegt doch hier überhaupt nicht."}, {"id": 1111, "start": 8206.24, "end": 8208.24, "text": "Das Trey-Eiken liegt hier."}, {"id": 1112, "start": 8208.24, "end": 8226.24, "text": "Warum findet ihr das überhaupt?"}, {"id": 1113, "start": 8226.24, "end": 8229.24, "text": "Aber eigentlich ist es mir egal, dass es funktioniert."}, {"id": 1114, "start": 8229.24, "end": 8233.24, "text": "Das ist eine Ressource in der Exe?"}, {"id": 1115, "start": 8233.24, "end": 8235.24, "text": "Ah!"}, {"id": 1116, "start": 8235.24, "end": 8236.24, "text": "Also, mag sein."}, {"id": 1117, "start": 8236.24, "end": 8238.24, "text": "Ich habe das nicht eingestellt."}, {"id": 1118, "start": 8238.24, "end": 8240.24, "text": "Ich habe sie einfach nur reingetrocknet."}, {"id": 1119, "start": 8240.24, "end": 8241.24, "text": "Guckt."}, {"id": 1120, "start": 8241.24, "end": 8242.24, "text": "Einfach nur da."}, {"id": 1121, "start": 8242.24, "end": 8244.24, "text": "Also, wenn es eine Ressource ist, ist es auch gut."}, {"id": 1122, "start": 8244.24, "end": 8251.24, "text": "Nice."}, {"id": 1123, "start": 8251.24, "end": 8252.24, "text": "Wird es mit in die Exe gepuckt?"}, {"id": 1124, "start": 8252.24, "end": 8253.24, "text": "Keine Ahnung."}, {"id": 1125, "start": 8253.24, "end": 8262.24, "text": "Das habe ich nicht eingestellt, dass es mit in die Exe gepackt wird."}, {"id": 1126, "start": 8262.24, "end": 8264.24, "text": "So, ich würde sagen, ich esse jetzt was."}, {"id": 1127, "start": 8264.24, "end": 8271.24, "text": "Und wenn der Ex am Start ist, spielen wir dann noch 2-2,5 Stunden Realm Royale."}, {"id": 1128, "start": 8271.24, "end": 8274.24, "text": "Mittlerweile, muss ich sagen..."}, {"id": 1129, "start": 8274.24, "end": 8278.24, "text": "Zeige ich euch das mal kurz."}, {"id": 1130, "start": 8278.24, "end": 8279.24, "text": "Steam."}, {"id": 1131, "start": 8279.24, "end": 8286.24, "text": "Geh auf."}, {"id": 1132, "start": 8286.24, "end": 8297.24, "text": "Mittlerweile haben wir sogar schon ein paar Games gewonnen."}, {"id": 1133, "start": 8297.24, "end": 8300.24, "text": "Alter, geh mal auf."}, {"id": 1134, "start": 8300.24, "end": 8308.24, "text": "Ich würde eigentlich nur kurz was zeigen."}, {"id": 1135, "start": 8308.24, "end": 8314.24, "text": "Zack, zack, kein Bock."}, {"id": 1136, "start": 8314.24, "end": 8316.24, "text": "Also, immer Discord da macht."}, {"id": 1137, "start": 8316.24, "end": 8320.24, "text": "Discord, piss dich mal."}, {"id": 1138, "start": 8320.24, "end": 8321.24, "text": "Komm mal."}, {"id": 1139, "start": 8321.24, "end": 8322.24, "text": "Diamond Noob bin ich jetzt."}, {"id": 1140, "start": 8322.24, "end": 8323.24, "text": "Jetzt können wir mal gucken."}, {"id": 1141, "start": 8323.24, "end": 8324.24, "text": "Guck mal."}, {"id": 1142, "start": 8324.24, "end": 8329.24, "text": "Jetzt machen wir mal das Memetool an."}, {"id": 1143, "start": 8329.24, "end": 8330.24, "text": "Ups."}, {"id": 1144, "start": 8330.24, "end": 8332.24, "text": "Memetool machen wir mal an."}, {"id": 1145, "start": 8332.24, "end": 8336.24, "text": "Und Nu sollte hier eigentlich..."}, {"id": 1146, "start": 8336.24, "end": 8337.24, "text": "Guckt."}, {"id": 1147, "start": 8337.24, "end": 8338.24, "text": "Man kann durchklicken."}, {"id": 1148, "start": 8338.24, "end": 8344.24, "text": "Es ist Overlay in Game."}, {"id": 1149, "start": 8344.24, "end": 8354.24, "text": "Was natürlich sehr, sehr nice ist."}, {"id": 1150, "start": 8354.24, "end": 8358.24, "text": "So, und um das mal zu demonstrieren."}, {"id": 1151, "start": 8358.24, "end": 8364.24, "text": "Weil es vorher in der Diskussion darüber gab."}, {"id": 1152, "start": 8364.24, "end": 8367.24, "text": "Es funktioniert nur in Borderless-Window."}, {"id": 1153, "start": 8367.24, "end": 8373.24, "text": "Wir können uns mal angucken, was passiert, wenn ich es auf Fullscreen stelle."}, {"id": 1154, "start": 8373.24, "end": 8376.24, "text": "Und versuche einzublenden."}, {"id": 1155, "start": 8376.24, "end": 8378.24, "text": "Passiert nichts."}, {"id": 1156, "start": 8378.24, "end": 8381.24, "text": "Also man sieht, es wird angezeigt."}, {"id": 1157, "start": 8381.24, "end": 8382.24, "text": "Aber es ist weg."}, {"id": 1158, "start": 8382.24, "end": 8385.24, "text": "Also das kann nicht funktionieren."}, {"id": 1159, "start": 8385.24, "end": 8393.24, "text": "Weil es halt exklusiv, ohne über den Windows DWM-Render-Dings zu gehen, auf den Bildschirm kommt."}, {"id": 1160, "start": 8393.24, "end": 8399.24, "text": "Es funktioniert nur in Borderless-Windows und dann ist es halt direkt am Start."}, {"id": 1161, "start": 8399.24, "end": 8406.24, "text": "Jetzt haben wir hier in Game."}, {"id": 1162, "start": 8406.24, "end": 8410.24, "text": "In Game unsere Meme-Action."}, {"id": 1163, "start": 8410.24, "end": 8413.24, "text": "Ja, ihr seht das Spiel nicht, weil es Fullscreen war."}, {"id": 1164, "start": 8413.24, "end": 8425.24, "text": "Aber es hat nicht funktioniert."}, {"id": 1165, "start": 8425.24, "end": 8434.24, "text": "Ja, für Fullscreen hätte ich Game Capture machen müssen."}, {"id": 1166, "start": 8434.24, "end": 8462.24, "text": "Irgendwie hat Breath of the Wild schon ziemlich nervigen Soundtrack gehabt an manchen Stellen."}, {"id": 1167, "start": 8462.24, "end": 8464.24, "text": "So, und nachdem wir jetzt..."}, {"id": 1168, "start": 8464.24, "end": 8465.24, "text": "Jetzt seht ihr es auch."}, {"id": 1169, "start": 8465.24, "end": 8467.24, "text": "Jetzt habe ich kein Fenster zum Beenden."}, {"id": 1170, "start": 8467.24, "end": 8471.24, "text": "Und jetzt ist es ja auch gut, dass wir unser Tray-Icon haben, wo ich sagen kann, Exit."}, {"id": 1171, "start": 8471.24, "end": 8478.24, "text": "Dann ist es weg."}, {"id": 1172, "start": 8478.24, "end": 8487.24, "text": "Kirby-Gummy-Race."}, {"id": 1173, "start": 8487.24, "end": 8499.24, "text": "Die Musik ist aber geil."}, {"id": 1174, "start": 8499.24, "end": 8526.24, "text": "Die Musik ist aber geil."}, {"id": 1175, "start": 8526.24, "end": 8533.24, "text": "Also man sieht doch, es kackt nicht ab, wenn man schnell die Sache durchswitcht."}, {"id": 1176, "start": 8533.24, "end": 8556.24, "text": "Die Musik ist aber geil."}, {"id": 1177, "start": 8556.24, "end": 8574.24, "text": "Die Musik ist aber geil."}, {"id": 1178, "start": 8574.24, "end": 8577.24, "text": "Wenn man genau dazu einschaltet, ist das irgendwie verstörend."}, {"id": 1179, "start": 8577.24, "end": 8581.24, "text": "Das verstehe ich schon."}, {"id": 1180, "start": 8581.24, "end": 8592.24, "text": "Also nochmal angemerkt, nur weil ich das dafür verwende, um irgendwelche Minenbildchen durchzuklicken und anzuzeigen,"}, {"id": 1181, "start": 8592.24, "end": 8596.24, "text": "heißt das nicht, dass man es dafür verwenden muss."}, {"id": 1182, "start": 8596.24, "end": 8604.24, "text": "Man könnte das auch für deutlich seriösere Zwecke verwenden, indem man einfach passende Einblendungen macht."}, {"id": 1183, "start": 8604.24, "end": 8621.24, "text": "Und der Vorteil ist halt einfach, ich sehe sie selbst, was bei reinem Overlay in OBS nicht so ist."}, {"id": 1184, "start": 8621.24, "end": 8641.24, "text": "Wow, Gachi-Buzz."}, {"id": 1185, "start": 8641.24, "end": 8651.24, "text": "Gibt es das eigentlich als ordentliches Skip? Das brauchen wir auch noch."}, {"id": 1186, "start": 8651.24, "end": 8670.24, "text": "Ich weiß gar nicht, was jetzt kommt, wenn ich weiter runter scroll. Ich will es gar nicht wissen."}, {"id": 1187, "start": 8670.24, "end": 8684.24, "text": "Das ist aber eine ziemlich schlechte Variante davon."}, {"id": 1188, "start": 8684.24, "end": 8694.24, "text": "So Leute, ich gehe jetzt was essen. Danach, je nachdem, ob der Erex da ist oder nicht, spüren wir noch zwei Stunden Renin Royale."}, {"id": 1189, "start": 8694.24, "end": 8703.24, "text": "Ich hoffe, euch hat's gefallen. Nächstes Mal werden wir uns dann die Netzwerkfunktionen widmen. Macht's gut. Bis denn. Tschüss."}, {"id": 1190, "start": 8703.24, "end": 8732.24, "text": "See you."}]}