{"text": "Sollte das ganze stimmen Jetzt sollte das ganze stimmen wisst ihr woran es gelegen hat wobei aber ich glaube es läuft noch gar nicht Wisst ihr woran das gelegen hat Sondern better twitch tv gelegen gelegen das hat es einfach nicht aktualisiert jetzt habe ich better twitch tv Ausgemacht jetzt hat es aktualisiert jetzt mache ich better twitch tv mal wieder an weil das brauche ich sonst kann ich sonst sonst Erkenn ich im chat nicht wenn mich einer erwähnt und jetzt stimmt es Okay, was auch immer Na gut aber damit kann ich leben Gg eats Okay wunderbar dann legen wir mal los also ich bin level 1 Ja das stimmt sehbaro better twitch tv passt noch überhaupt nicht zum neuen Better twitch tv passt noch überhaupt nicht zum neuen Twitch das stimmt So haben wir hier mal das zeug zumachen aufwärts an auf geht's ich bin level 1 neuer account Bist du komplett gestört dass das dreck spiel overwatch ist kein dreck spiel Overwatch ist übelst geil das problem an overwatch ist vom jetzt das sound zu laut wartet mal kurz Das problem an overwatch ist Das problem an overwatch ist so Das problem an overwatch ist jetzt gar krank system der rest ist toll Okay, passt alles so wir sind level 1 also noch nicht nicht ein spiel gespielt absolut gar nichts Ich mach mal meine vorschau aus und jetzt Legen wir mal los also das ich ich muss erst mal mit level 25 level miss my rank spielen können das heißt es wird noch eine ganze Weile dauern ich sehe auch nicht ich sehe das glaube ich auch eher nicht dass wir da heute noch zu kommen aber auf geht's Was hier tutorial nein kommen nicht i'm ready. Don't ask me Das ist ich bin besoffen als ich das geschrieben habe warum aufwärts ist geil macht übelst bock Hat einer eine gute super nintendo playlist also so eine richtig gute super nintendo playlist wo jetzt nicht soviel crap musik drinne ist Finding game residency Find a game residency Find a game residency Find a game residency Find a game residency Find a game residency Find a game residency Habt ihr habt ihr eine fps anzeige Ja ich spiele ich spiele auf dem account ich will generell mal so mein hero Repertoire erweitern zwar mit oh game fun Und ich will mir mal wieder bauch die neuen tanks angucken So Go go go Das ist schon der erste schau mal raus Der erste schau mal raus So wir starten erst mal mit dem typischen call of duty held ich muss mich erst wieder einspielen Was Was ganz klein was ganz klein Ihr müsst mir gleich mal sagen wie sound von mir es zu in game sound lautstärke und musik im Hysterken ohne musik Imップj paralysis So Jetzt So, ach FPS Anzahl ganz klein, ja wunderbar, also ihr seht auch, ich hab 300 FPS, easy, easy 300 FPS, easy. Äh, das haben wir nie, das geht nicht los. So, neue Map, also für mich relativ neue Map, hab ich glaube ich zweimal gespielt, insgesamt. Ich hab ja nicht viel gespielt, weil ich seh übrigens keine Views oder so, das geht mir grad ein bisschen auf den Sack. Mal refreshen. Was? Du hättest auch den Account von meinem Cousin haben können. Ist zwar Silber, aber damit kannst du nicht climben, der kommt beinahe los. Doch, also ich kann mit dem Silber-Account definitiv climben. Elo Hell gibt's in der Form eh nicht. Es gibt bloß Bullshit Hell in Overwatch. So, wo läuft man jetzt am besten lang? Ich kenn die Map nicht. Hier geht's nicht lang. Also ich mein ich kenn die Maps aus Streams und sowas. Aber nie wirklich großartig selbst gespielt. Ich glaub wir gehen hier am besten rechts lang. Kommt her Leute. Gehen wir mal hier durch, gucken was da abgeht. 2 CP LUL, ja. Warum kriegt der keinen Damage, bin ich doof? Oh, ich muss mich erstmal wieder an AD-AD-Spam gewöhnen. Der Typ will mich Baschen. Oh, AIM. AIM ist totes R. Perfekt. Das Spiel ist so geil. Das Spiel ist halt einfach geil. Das Problem ist, dass es mich immer so abfuckt. Zu Star Wars noch ein Video, nein. Battlefront hat mich. Ich hab mir, danke für die Donation, ich seh grad nicht welche. Und der Sound ist übelst laut. Ich guck gleich Donations alle nach. Ein Gengu, wo ist er? Da war er. Aber ich find's geil, konstant. Konstant 300 FPS. Ich muss mal kurz. Achtung, huge, huge. Was macht der Typ da? Na gut, das ist Level 2 Match, was sollste da erwarten, ja? Money in the bank. 50 Euro hat alle donaten. Moment, da muss ich jetzt nachgucken. WTF? Donations. Fuck, wo seh ich das denn jetzt hier? Donations, hier. Sebaro, 51 Euro, krasser Scheiß. 22 Tage seine letzten Donations, so kann das nicht weitergehen, null. Dafür gab's dann aber auch Oldschool-Videos. Ja, ich hab mir Mühe gegeben, ich hab viele Videos gemacht. Und ich werd auch in nächster Zeit weiter viele Videos machen hier. Ich worte mich mal selbst. Ich worte mich mal selbst. Easy play of the game. Ich hab jetzt gar nicht geguckt, ich muss Donation gucken. Wir machen auch... 39. Aber ich bin zuversichtlich, wenn ich ein bisschen eingespielt hab, wird das wieder... Nope, wird das wieder funktionieren. Denn ich war ja mal ganz gut in dem Game. Das ist auch übrigens der Grund, warum ich mit meinem Main-Account nicht spiele. Genau, weil der Board-Guy fragt es gerade, warum neuen Account. Ich bin mit meinem Main-Account, weil Blizzard-Logik, weil man intern auf seinem Rating mehr oder weniger bleibt, plus sichtbar absteigt, was auch ganz merkwürdig ist. Mein Main-Account ist ungefähr Highmaster, Low Grandmaster in dem Dreh gerankt. Immer noch, obwohl ich Side-Season 4 nicht richtig gespielt habe. Hab ich letztes Mal gemerkt, wo ich letzte Season mit dem Eaxe die 10 Placement-Matches gemacht hab. Da haben wir ja, glaub ich, 6 gewonnen, 4 verloren oder so was in dem Dreh, wo wir beide gedacht haben, naja, so hoch wären wir jetzt nicht eingerankt. Was würden wir irgendwie eingerankt? 3900 oder so was. Deswegen, nachdem ich selbst der Ansicht bin, ich bin schlecht mittlerweile in dem Game. Schlechter geht es immer, aber es geht mit Sicherheit auch noch viel, viel besser. Und ich kein Bock habe, quasi den Leuten die Games zu verlieren, weil ich viel zu hoch gerankt bin, bis das Ranking-System das irgendwann mal gecheckt hat, wenn überhaupt. Hab ich mir gedacht, ich mach mal einen neuen Account, da kann ich mir auch die neuen Maps angucken, die neuen Helden angucken und das ganze Zeug, bis ich halt 25 bin, das dauert ja eh ein bisschen, das geht ja eh nicht von jetzt auf gleich. Ja, du hättest den Main verkauft für 200 bis 300, warum soll ich meinen Main-Account verkaufen? Ich könnte ja einen Boosting-Service anbieten, wenn ich wieder ganz gut in dem Game bin. Mein Master ist einfach, Master krieg ich easy hin. Da bin ich zuversichtlich. Soll ich, soll ich übrigens Super Nintendo Musik im Hintergrund anlassen oder wollen wir uns Overwatch Musik, ähm, Overwatch Main Theme im Hauptmenü geben? Wieso hast du eigentlich so viel FPS, liegt das an der Grafikkarte oder an der CPU? Beidem. Also ich mein, erstens habe ich den FPS, den ich eigentlich an der Grafikkarte habe, und dann habe ich den FPS, den ich eigentlich an der Grafikkarte habe, und dann habe ich den FPS, den ich eigentlich an der Grafikkarte habe, und dann habe ich den FPS, den ich eigentlich an der Grafikkarte habe, aber ich mein erstens habe ich den übelten Highend-Rechner. Nach 1.700K 1080Ti, 16убit RAM, 4TB SSD ist es insgesamt, nach 1.700K 1080Ti, 16UBIT RAM, 4TB SSD ist es insgesamt, übelst geiler Rechner, aber ich spiele halt Low. Ich spiel halt lau-", "segments": [{"id": 1, "start": 0.0, "end": 2.0, "text": "Sollte das ganze stimmen"}, {"id": 2, "start": 5.22, "end": 10.3, "text": "Jetzt sollte das ganze stimmen wisst ihr woran es gelegen hat wobei aber ich glaube es läuft noch gar nicht"}, {"id": 3, "start": 11.4, "end": 13.4, "text": "Wisst ihr woran das gelegen hat"}, {"id": 4, "start": 13.76, "end": 19.2, "text": "Sondern better twitch tv gelegen gelegen das hat es einfach nicht aktualisiert jetzt habe ich better twitch tv"}, {"id": 5, "start": 19.64, "end": 25.8, "text": "Ausgemacht jetzt hat es aktualisiert jetzt mache ich better twitch tv mal wieder an weil das brauche ich sonst kann ich sonst sonst"}, {"id": 6, "start": 25.8, "end": 32.4, "text": "Erkenn ich im chat nicht wenn mich einer erwähnt und jetzt stimmt es"}, {"id": 7, "start": 33.52, "end": 35.52, "text": "Okay, was auch immer"}, {"id": 8, "start": 36.88, "end": 38.88, "text": "Na gut aber damit kann ich leben"}, {"id": 9, "start": 40.32, "end": 42.32, "text": "Gg eats"}, {"id": 10, "start": 49.88, "end": 53.36, "text": "Okay wunderbar dann legen wir mal los also ich bin level 1"}, {"id": 11, "start": 53.36, "end": 57.36, "text": "Ja das stimmt sehbaro better twitch tv passt noch überhaupt nicht zum neuen"}, {"id": 12, "start": 65.0, "end": 67.0, "text": "Better twitch tv passt noch überhaupt nicht zum neuen"}, {"id": 13, "start": 69.44, "end": 71.44, "text": "Twitch das stimmt"}, {"id": 14, "start": 72.44, "end": 78.8, "text": "So haben wir hier mal das zeug zumachen aufwärts an auf geht's ich bin level 1 neuer account"}, {"id": 15, "start": 78.8, "end": 83.56, "text": "Bist du komplett gestört dass das dreck spiel overwatch ist kein dreck spiel"}, {"id": 16, "start": 84.52, "end": 90.28, "text": "Overwatch ist übelst geil das problem an overwatch ist vom jetzt das sound zu laut wartet mal kurz"}, {"id": 17, "start": 96.08, "end": 98.08, "text": "Das problem an overwatch ist"}, {"id": 18, "start": 98.08, "end": 101.92, "text": "Das problem an overwatch ist so"}, {"id": 19, "start": 109.88, "end": 113.76, "text": "Das problem an overwatch ist jetzt gar krank system der rest ist toll"}, {"id": 20, "start": 114.64, "end": 121.6, "text": "Okay, passt alles so wir sind level 1 also noch nicht nicht ein spiel gespielt absolut gar nichts"}, {"id": 21, "start": 121.6, "end": 124.2, "text": "Ich mach mal meine vorschau aus und jetzt"}, {"id": 22, "start": 125.76, "end": 132.08, "text": "Legen wir mal los also das ich ich muss erst mal mit level 25 level miss my rank spielen können das heißt es wird noch eine ganze"}, {"id": 23, "start": 132.08, "end": 139.08, "text": "Weile dauern ich sehe auch nicht ich sehe das glaube ich auch eher nicht dass wir da heute noch zu kommen aber auf geht's"}, {"id": 24, "start": 139.08, "end": 143.08, "text": "Was hier tutorial nein kommen nicht i'm ready. Don't ask me"}, {"id": 25, "start": 143.08, "end": 146.6, "text": "Das ist ich bin besoffen als ich das geschrieben habe warum aufwärts ist geil macht übelst bock"}, {"id": 26, "start": 146.6, "end": 156.36, "text": "Hat einer eine gute super nintendo playlist also so eine richtig gute super nintendo playlist wo jetzt nicht soviel crap musik drinne ist"}, {"id": 27, "start": 161.16, "end": 163.18, "text": "Finding game residency"}, {"id": 28, "start": 163.18, "end": 165.18, "text": "Find a game residency"}, {"id": 29, "start": 165.18, "end": 167.18, "text": "Find a game residency"}, {"id": 30, "start": 167.18, "end": 169.18, "text": "Find a game residency"}, {"id": 31, "start": 169.18, "end": 171.18, "text": "Find a game residency"}, {"id": 32, "start": 171.18, "end": 173.18, "text": "Find a game residency"}, {"id": 33, "start": 173.18, "end": 177.18, "text": "Find a game residency"}, {"id": 34, "start": 181.18, "end": 184.44, "text": "Habt ihr habt ihr eine fps anzeige"}, {"id": 35, "start": 186.08, "end": 190.1, "text": "Ja ich spiele ich spiele auf dem account ich will generell mal so mein hero"}, {"id": 36, "start": 191.6, "end": 194.88, "text": "Repertoire erweitern zwar mit oh game fun"}, {"id": 37, "start": 194.88, "end": 203.04, "text": "Und ich will mir mal wieder bauch die neuen tanks angucken"}, {"id": 38, "start": 203.04, "end": 205.04, "text": "So"}, {"id": 39, "start": 205.04, "end": 207.04, "text": "Go go go"}, {"id": 40, "start": 207.04, "end": 209.04, "text": "Das ist schon der erste schau mal raus"}, {"id": 41, "start": 209.04, "end": 211.04, "text": "Der erste schau mal raus"}, {"id": 42, "start": 211.04, "end": 215.04, "text": "So wir starten erst mal mit dem typischen call of duty held ich muss mich erst wieder einspielen"}, {"id": 43, "start": 215.04, "end": 216.84, "text": "Was"}, {"id": 44, "start": 223.84, "end": 225.38, "text": "Was ganz klein was ganz klein"}, {"id": 45, "start": 228.02, "end": 235.96, "text": "Ihr müsst mir gleich mal sagen wie sound von mir es zu in game sound lautstärke und musik im Hysterken ohne musik"}, {"id": 46, "start": 236.04, "end": 238.04, "text": "Imップj paralysis"}, {"id": 47, "start": 240.56, "end": 240.56, "text": "So"}, {"id": 48, "start": 241.28, "end": 242.2, "text": "Jetzt"}, {"id": 49, "start": 242.2, "end": 253.2, "text": "So, ach FPS Anzahl ganz klein, ja wunderbar, also ihr seht auch, ich hab 300 FPS, easy, easy 300 FPS, easy."}, {"id": 50, "start": 253.2, "end": 259.2, "text": "Äh, das haben wir nie, das geht nicht los."}, {"id": 51, "start": 259.2, "end": 265.2, "text": "So, neue Map, also für mich relativ neue Map, hab ich glaube ich zweimal gespielt, insgesamt."}, {"id": 52, "start": 265.2, "end": 270.2, "text": "Ich hab ja nicht viel gespielt, weil ich seh übrigens keine Views oder so, das geht mir grad ein bisschen auf den Sack."}, {"id": 53, "start": 270.2, "end": 281.2, "text": "Mal refreshen."}, {"id": 54, "start": 281.2, "end": 285.2, "text": "Was? Du hättest auch den Account von meinem Cousin haben können."}, {"id": 55, "start": 285.2, "end": 288.2, "text": "Ist zwar Silber, aber damit kannst du nicht climben, der kommt beinahe los."}, {"id": 56, "start": 288.2, "end": 292.2, "text": "Doch, also ich kann mit dem Silber-Account definitiv climben."}, {"id": 57, "start": 292.2, "end": 295.2, "text": "Elo Hell gibt's in der Form eh nicht."}, {"id": 58, "start": 295.2, "end": 299.2, "text": "Es gibt bloß Bullshit Hell in Overwatch."}, {"id": 59, "start": 299.2, "end": 302.2, "text": "So, wo läuft man jetzt am besten lang? Ich kenn die Map nicht."}, {"id": 60, "start": 302.2, "end": 307.2, "text": "Hier geht's nicht lang. Also ich mein ich kenn die Maps aus Streams und sowas."}, {"id": 61, "start": 307.2, "end": 312.2, "text": "Aber nie wirklich großartig selbst gespielt."}, {"id": 62, "start": 312.2, "end": 321.2, "text": "Ich glaub wir gehen hier am besten rechts lang. Kommt her Leute."}, {"id": 63, "start": 321.2, "end": 323.2, "text": "Gehen wir mal hier durch, gucken was da abgeht."}, {"id": 64, "start": 323.2, "end": 330.2, "text": "2 CP LUL, ja. Warum kriegt der keinen Damage, bin ich doof?"}, {"id": 65, "start": 330.2, "end": 337.2, "text": "Oh, ich muss mich erstmal wieder an AD-AD-Spam gewöhnen."}, {"id": 66, "start": 337.2, "end": 345.2, "text": "Der Typ will mich Baschen."}, {"id": 67, "start": 345.2, "end": 353.2, "text": "Oh, AIM. AIM ist totes R."}, {"id": 68, "start": 353.2, "end": 359.2, "text": "Perfekt."}, {"id": 69, "start": 359.2, "end": 362.2, "text": "Das Spiel ist so geil. Das Spiel ist halt einfach geil."}, {"id": 70, "start": 362.2, "end": 366.2, "text": "Das Problem ist, dass es mich immer so abfuckt."}, {"id": 71, "start": 366.2, "end": 369.2, "text": "Zu Star Wars noch ein Video, nein. Battlefront hat mich."}, {"id": 72, "start": 369.2, "end": 373.2, "text": "Ich hab mir, danke für die Donation, ich seh grad nicht welche."}, {"id": 73, "start": 373.2, "end": 377.2, "text": "Und der Sound ist übelst laut. Ich guck gleich Donations alle nach."}, {"id": 74, "start": 377.2, "end": 382.2, "text": "Ein Gengu, wo ist er?"}, {"id": 75, "start": 382.2, "end": 386.2, "text": "Da war er."}, {"id": 76, "start": 386.2, "end": 390.2, "text": "Aber ich find's geil, konstant."}, {"id": 77, "start": 390.2, "end": 393.2, "text": "Konstant 300 FPS."}, {"id": 78, "start": 393.2, "end": 400.2, "text": "Ich muss mal kurz."}, {"id": 79, "start": 400.2, "end": 405.2, "text": "Achtung, huge, huge."}, {"id": 80, "start": 405.2, "end": 415.2, "text": "Was macht der Typ da?"}, {"id": 81, "start": 415.2, "end": 422.2, "text": "Na gut, das ist Level 2 Match, was sollste da erwarten, ja?"}, {"id": 82, "start": 422.2, "end": 426.2, "text": "Money in the bank. 50 Euro hat alle donaten. Moment, da muss ich jetzt nachgucken."}, {"id": 83, "start": 426.2, "end": 429.2, "text": "WTF?"}, {"id": 84, "start": 429.2, "end": 432.2, "text": "Donations."}, {"id": 85, "start": 432.2, "end": 436.2, "text": "Fuck, wo seh ich das denn jetzt hier? Donations, hier."}, {"id": 86, "start": 436.2, "end": 440.2, "text": "Sebaro, 51 Euro, krasser Scheiß."}, {"id": 87, "start": 440.2, "end": 443.2, "text": "22 Tage seine letzten Donations, so kann das nicht weitergehen, null."}, {"id": 88, "start": 443.2, "end": 447.2, "text": "Dafür gab's dann aber auch Oldschool-Videos. Ja, ich hab mir Mühe gegeben, ich hab viele Videos gemacht."}, {"id": 89, "start": 447.2, "end": 450.2, "text": "Und ich werd auch in nächster Zeit weiter viele Videos machen hier."}, {"id": 90, "start": 450.2, "end": 454.2, "text": "Ich worte mich mal selbst."}, {"id": 91, "start": 454.2, "end": 456.2, "text": "Ich worte mich mal selbst. Easy play of the game."}, {"id": 92, "start": 456.2, "end": 461.2, "text": "Ich hab jetzt gar nicht geguckt, ich muss Donation gucken."}, {"id": 93, "start": 461.2, "end": 465.2, "text": "Wir machen auch..."}, {"id": 94, "start": 465.2, "end": 470.2, "text": "39."}, {"id": 95, "start": 470.2, "end": 475.2, "text": "Aber ich bin zuversichtlich, wenn ich ein bisschen eingespielt hab, wird das wieder..."}, {"id": 96, "start": 475.2, "end": 478.2, "text": "Nope, wird das wieder funktionieren."}, {"id": 97, "start": 478.2, "end": 482.2, "text": "Denn ich war ja mal ganz gut in dem Game."}, {"id": 98, "start": 482.2, "end": 487.2, "text": "Das ist auch übrigens der Grund, warum ich mit meinem Main-Account nicht spiele."}, {"id": 99, "start": 487.2, "end": 491.2, "text": "Genau, weil der Board-Guy fragt es gerade, warum neuen Account."}, {"id": 100, "start": 491.2, "end": 497.2, "text": "Ich bin mit meinem Main-Account, weil Blizzard-Logik, weil man intern auf seinem Rating mehr oder weniger bleibt,"}, {"id": 101, "start": 497.2, "end": 502.2, "text": "plus sichtbar absteigt, was auch ganz merkwürdig ist."}, {"id": 102, "start": 502.2, "end": 508.2, "text": "Mein Main-Account ist ungefähr Highmaster, Low Grandmaster in dem Dreh gerankt."}, {"id": 103, "start": 508.2, "end": 512.2, "text": "Immer noch, obwohl ich Side-Season 4 nicht richtig gespielt habe."}, {"id": 104, "start": 512.2, "end": 517.2, "text": "Hab ich letztes Mal gemerkt, wo ich letzte Season mit dem Eaxe die 10 Placement-Matches gemacht hab."}, {"id": 105, "start": 517.2, "end": 520.2, "text": "Da haben wir ja, glaub ich, 6 gewonnen, 4 verloren oder so was in dem Dreh,"}, {"id": 106, "start": 520.2, "end": 523.2, "text": "wo wir beide gedacht haben, naja, so hoch wären wir jetzt nicht eingerankt."}, {"id": 107, "start": 523.2, "end": 527.2, "text": "Was würden wir irgendwie eingerankt? 3900 oder so was."}, {"id": 108, "start": 527.2, "end": 532.2, "text": "Deswegen, nachdem ich selbst der Ansicht bin, ich bin schlecht mittlerweile in dem Game."}, {"id": 109, "start": 532.2, "end": 536.2, "text": "Schlechter geht es immer, aber es geht mit Sicherheit auch noch viel, viel besser."}, {"id": 110, "start": 536.2, "end": 543.2, "text": "Und ich kein Bock habe, quasi den Leuten die Games zu verlieren, weil ich viel zu hoch gerankt bin,"}, {"id": 111, "start": 543.2, "end": 547.2, "text": "bis das Ranking-System das irgendwann mal gecheckt hat, wenn überhaupt."}, {"id": 112, "start": 547.2, "end": 550.2, "text": "Hab ich mir gedacht, ich mach mal einen neuen Account, da kann ich mir auch die neuen Maps angucken,"}, {"id": 113, "start": 550.2, "end": 556.2, "text": "die neuen Helden angucken und das ganze Zeug, bis ich halt 25 bin, das dauert ja eh ein bisschen,"}, {"id": 114, "start": 556.2, "end": 560.2, "text": "das geht ja eh nicht von jetzt auf gleich."}, {"id": 115, "start": 560.2, "end": 567.2, "text": "Ja, du hättest den Main verkauft für 200 bis 300, warum soll ich meinen Main-Account verkaufen?"}, {"id": 116, "start": 567.2, "end": 571.2, "text": "Ich könnte ja einen Boosting-Service anbieten, wenn ich wieder ganz gut in dem Game bin."}, {"id": 117, "start": 571.2, "end": 574.2, "text": "Mein Master ist einfach, Master krieg ich easy hin."}, {"id": 118, "start": 574.2, "end": 577.2, "text": "Da bin ich zuversichtlich."}, {"id": 119, "start": 577.2, "end": 581.2, "text": "Soll ich, soll ich übrigens Super Nintendo Musik im Hintergrund anlassen oder wollen wir uns"}, {"id": 120, "start": 581.2, "end": 588.2, "text": "Overwatch Musik, ähm, Overwatch Main Theme im Hauptmenü geben?"}, {"id": 121, "start": 588.2, "end": 592.2, "text": "Wieso hast du eigentlich so viel FPS, liegt das an der Grafikkarte oder an der CPU?"}, {"id": 122, "start": 592.2, "end": 594.2, "text": "Beidem."}, {"id": 123, "start": 594.2, "end": 599.2, "text": "Also ich mein, erstens habe ich den FPS, den ich eigentlich an der Grafikkarte habe,"}, {"id": 124, "start": 599.2, "end": 603.2, "text": "und dann habe ich den FPS, den ich eigentlich an der Grafikkarte habe,"}, {"id": 125, "start": 603.2, "end": 606.2, "text": "und dann habe ich den FPS, den ich eigentlich an der Grafikkarte habe,"}, {"id": 126, "start": 606.2, "end": 609.2, "text": "und dann habe ich den FPS, den ich eigentlich an der Grafikkarte habe,"}, {"id": 127, "start": 609.2, "end": 612.2, "text": "aber ich mein erstens habe ich den übelten Highend-Rechner."}, {"id": 128, "start": 612.2, "end": 611.04, "text": "Nach 1.700K 1080Ti, 16убit RAM, 4TB SSD ist es insgesamt,"}, {"id": 129, "start": 611.04, "end": 616.48, "text": "nach 1.700K 1080Ti, 16UBIT RAM, 4TB SSD ist es insgesamt,"}, {"id": 130, "start": 616.48, "end": 621.2, "text": "übelst geiler Rechner, aber ich spiele halt Low."}, {"id": 131, "start": 621.2, "end": 622.5, "text": "Ich spiel halt lau-"}]}