{"text": "Das war's für heute. Ich hoffe, dass es euch gefallen hat. Wenn ihr mehr von uns sehen wollt, dann klickt auf den Link in der Beschreibung. Dann sehen wir uns beim nächsten Mal wieder. Das war's für heute. Bis zum nächsten Mal. So Leute, bin ich am Start. Ich muss noch mal schnell aufs Klo. Und was zu trinken holen. Ich habe jetzt zwei Stunden schon ein bisschen am Preis-Champ gebastelt. Aber ich habe mir gedacht, ich mache jetzt einfach Stream an. Ich hatte heute leider nicht so viel Zeit, etwas großartig zu machen. Real-Life-Stells. Megasack. Dabei wollte ich mit dem M-Core noch etwas aufnehmen, irgendwann die Woche. Das Wochenende. Habe ich jetzt gar nicht in Discord geguckt heute. Und dann wollte ich mich ein bisschen um Sellout-Stunks-Zeug kümmern. Dass ich da ein bisschen Sellout-Money hinkriege wieder. Wow, ein bisschen groß. Kack-Wait. Ja, ich habe den M-Core angeschrieben nach dem letzten Video, was er hochgeladen hat. Ich kenne ja noch jemand. Und habe gesagt, wie sieht es aus? Wollen wir etwas aufnehmen? Ich bin mir jetzt gar nicht sicher, was das da, glaube ich, hat er hochgeladen. Genau. Da habe ich genau drauf geantwortet, hier wäre nice, wenn wir da etwas aufnehmen. Und ich kann euch schon sagen, was wir für ein Thema machen. Und zwar, ich mache mal die Musik ein bisschen leiser. Ich kann euch schon sagen, was wir für ein Thema machen. Und zwar, es gibt so viele Videos, so, how to bekommen große, erfolgreiche YouTuber. Aber niemand macht ein Video. Ich war mal erfolgreicher YouTuber und mache keinen YouTube mehr. Wisst ihr, wie ich meine? So, es gibt total viele Videos, how to become YouTuber, aber nicht wie werde ich von YouTube wieder zu normal. Und der M-Core war damals ja auch dick im Business. Ich mache auch schon jahrelang kaum noch aktiv richtig was. Könnten wir sich mal drüber auslassen. Exzellent, exzellent. How to be normie. Na gut, wir nicht. Also ich schonmal, ich schonmal nicht. Ich muss mal kurz hier bringen, die VM neu starten. Ich glaube, da ist ein bisschen was im Argen gerade. Die mag ich irgendwie nicht so richtig. Das sieht mittlerweile viel cooler aus. Ich habe vorhin was nice gebastelt. Äh, warte mal, wo habe ich den Preischamp? Pull. Oh, what the fuck. Alter, ich kann immer tippen. So. Reset. In your face. Origin. Master. Bam. So, letztes Comet. Timer. Alles klar, passt. So, ich reboote mal schnell. Also, nicht den Stream. Master. Ja, mittlerweile. Ey. Das wird sich irgendwie so viel unsinnige Sachen aus. Ja, was? Was ist damit? Ach, hat jemand gefragt, wo es die Seite gibt, oder was? Genau, die gibt es da. Excellent. Das coole ist, ich habe auf meinem zweiten PC ein YouTube Video Vorschau Ding. Und da sehe ich genau, dass es irgendwelche random Schwachsinnensvideos sind, die gepostet werden, da muss ich gerade draufklicken. He doesn't know he lacks critical information. Ah, ah, ah. Record, haben wir doch? Gibt es doch? Es gibt doch Ah, ah, ah Record für Preischamp. Äh, Kampf Kevin. Kannst du beim Preischamp vielleicht noch Filter entzogen das auch auf Lager? Ich weiß nicht, ob der Crawler das kann. Was soll das denn heißen? Auf Lager, ausschließlich Versand. Was soll das jetzt genau bedeuten? Du meinst Sachen, die auch wirklich innerhalb der nächsten ein, zwei Tage verschickt werden können, oder was? Es war nur der Name frei zwei acht Monate. Dankeschön für den Sub. Massive IQ increase für den Chat, wieder. Die findet er aber doch auch so. Die findet er doch auch so. Hier, RTX war vorhin am Start, habe ich genau gesehen, während ich entwickelt habe. Guck hier, bei Alternate ist er auch am Start. Die findet er schon. Nee, aber ich glaube, da habe ich keinen. Hier, passt doch. Auf Lager, ausschließlich Versand. Ja gut, wenn die, wenn die 30, wenn wenn die Das kann sein, dass das noch nicht aktualisiert ist. Nee. Ach hier, guck mal. Das kann sein, dass er die Produktseite nicht drin hat. Warum ist das denn so teuer? Ist das so gedacht? Ja, also, die müssen, die müssen da finden, wenn die Produktseite drin ist. Das ist halt so ein Ding, wenn die Produktseite, ich kann mal gucken, ob die Produktseite drin ist. Kann man nachschauen. Wartet mal. Schauen wir mal. Hier. Terminal aufmachen. Ich habe jetzt Rebooted. So, gehen wir mal. Wo habe ich das? Repos. Street. So. Source. Shops. Oh nee, wo haben sie das? Stores. Wo haben sie das versteckt? Model und dann Alternate. 60, 90. 60, 90. Ach, die steht gerade, die steht hier noch gar nicht drin. Das ist ganz neu. Haben sie noch gar nicht drin. Aber 60, 80. Nee, warte. Wie? Ach, es ist 6.800. Doch, ist drin. So, gucken wir mal, ob eins von denen das ist, was du gezeigt hast. Ja, die links stimmen einfach nicht mehr. Keck, Keck, Hyperweight. Die links stimmen nicht. So. Welchen Link hast du gerade geschickt? Den da. Ja. Siehst du? Das steht da einfach nicht drin. Tja, kein Wunder, dass es das nicht krault. Wenn es da nicht drin steht. Wir pullen mal hier aktuell. Der macht natürlich mehr. Das ist auch schon wieder so eine Sache, warum man diese Main-Master-Geschichte auf den Keks geht. Man kann einfach keinen History-Eintrag mehr verwenden. Man muss dann umwursten das Ganze. Das nervt. Und der hat Alternate, hat er nichts gemacht. Also das ist immer noch nicht drinne. Ich meine, wir können das auch von Hand dazuschreiben, aber ehrlich gesagt ja scheiß drauf, wir schreiben das von Hand dazu. Ich weiß nicht. Mal gucken, ob das russische Botnetz wieder am Start ist heute. Nicht Pokchamp, nicht Pokchamp. Preischamp. Mal gucken, ob das russische Botnetz heute wieder zuguckt. Nee, pingen kann ich ja nicht. Da lieg ich ja wieder IPs. Wir tragen das mal ein und gucken, ob es dann funktioniert. Also Source Store Model Jetzt Alternate und jetzt 6900 XT Ich hab da noch nie was von Hand eingetragen. Mal gucken, wie das funktioniert. Also nehmen wir mal so ein Ding Copypasten das So und das ist jetzt Brand Asus AMD Reference. Ehrlich gesagt kein Plastenschimmer, da steht überall AMD Ich schreib da einfach AMD Reference, ist doch egal. So und jetzt ist Produktseite Produktseite, die du geschickt hast. Moment, wo ist die Produktseite, die du geschickt hast? Ist das blöd? Ich steh irgendwo weg. Check, check, wait. Wo hab ich die hin? Ach nee, da. Hier. Blablabla Product Ok, wie baustelle Einfach so? Ah ja, nice. Ok. Massive Wim trick Ich weiß nicht, ob ihr das schon kennt. Wenn ihr in Anführungszeichen seid Dann drückt ihr einfach C, I und Anführungsstriche und schon löscht alles. Bam. So, mal gucken ob der das jetzt richtig crawlt. Das ist nicht AMD. Ich nehm dieses Model eh für nix, also ist es auch wurscht. Start Start So, der sollte das jetzt checken. Der sollte jetzt, der Preischamp sollte jetzt gleich wenn er gestartet ist, das dauert ne Minute oder so, sollte der jetzt anzeigen AMD ist am Start. Wann kann man wieder erwarten, dass der Staff zu normalen Preisen am Start ist? Irgendwann im Sommer? So Leute, ich zeig euch jetzt mal den neuen Preischamp. Ich hab ein bisschen was geupdatet und wir machen heute ein bisschen Fine Tuning dass ich mal wieder was neues pushen kann. Weil wir wissen ja, die Leute stehen drauf, wenn es neue Änderungen gibt, die sie sich angucken können. Den machen wir mal zu. Depots, Preischamp .net und achso Wir müssen vorher noch was anderes machen. Weil ich hab ja das Problem Ich hab ja das Problem, dass ach Moment, ich muss Alter JavaScript, lass dich doch einfach Das ist hartnäckig Ich wollte es eigentlich einfach nur abbrechen ja So Wir müssen erstmal ein Install machen, weil ich hab ne Craft Chart Library vorhin installiert. Die ist ja hier sicherlich noch gar nicht drauf Okay So jetzt aber Und wir müssen vorhin nämlich noch was anderes machen Weil guckt mal, wir müssen das verdockerisieren Weil wenn ich das hier starte dann braucht das Start dann braucht das meine komplette CPU-Leistung von der Kiste Deswegen müssen wir das verdockerisieren und dann docker starten mit CPU-Limit, viel einfacher Ja richtig Monarch-S Das sollte aber relativ einfach sein, weil der Typ hat ein Docker-File am Start Das heißt theoretisch können wir einfach sagen docker-build. und dann funktioniert's Mal gucken ob das so ist, wie ich mir das denke Und dann können wir starten im Docker mit verschiedenen Parameter für CPU-Beschränkungen Verdockerisieren sollte im Tuden stehen Mittlerweile wird alles verdockerisiert Ich warte noch drauf bis die Leute mal LS-SSService verwenden Oder Top-SSS, wobei das gibt's schon Bring soll ich euch nochmal was richtig nicees zeigen Grafana Passt mal auf Nodex-Porter Extern Ich hab mein Beta-Preis-Champ im Grafana-Monitoring jetzt drin Bäm Und jetzt seh ich auch gleich, was hier abgeht mit Traffic Allerdings wie gesagt, der Server wird eh nicht lang aktiv noch bleiben, sobald das irgendwie funktioniert Zieh ich das um auf Preis-Champ.org Und das kommt hinter Cloudflare Ist das nicht Pog? Oh Leute, was ist das? Das ist Statistik von meinem Server bei Hetzner 50% CPU-Last 16 CPU-Cores, 2,4 Tage ab 32G RAM RAM-Verbrauch ist nicht so hoch Ist aber ganz gut ausgelastet, die Kiste Was ist hinter Preis-Champ.org? Da ist Kappe 1,2,3 Soll ich online? Ja, das dauert Das dauert, bis der das erkennt Das dauert, der muss ja erstmal alles durchcrawlen und dann irgendwann mal da ankommen, das dauert Sobald ich ihn jetzt neu gestartet hab Sonsten gehts schneller Was kostet ich die Kiste? 50€ im Monat Die fette Aber ich werd das auch anders machen Ich hab ja jetzt zum Test mal so eine 16-Core-Kiste Ich werd das anders machen Ich mach einen 8-Kerner zum Crawlen und einen Dual- oder Triple-Core fürs Frontend Das Frontend kommt mit einem Core aus, wenn man ehrlich ist Du musst das horizontal skalierbar machen Das geht sogar Der Patrick bringt mich auf eine Idee Man kann das sogar relativ easy mit Entspannungsmusik machen Das ist zu entspannt Relaxing-Nintendo-Musik Das ist cool Das war schon fast ein bisschen zu Relaxing Der Patrick hat mich auf eine echt geile Idee gebracht Jawoll Und zwar Es war natürlich nur Gebat, aber hat mich wirklich auf eine gute Idee gebracht Das ist Das hab ich nicht selbst gemacht Das ist das fertige Notexporter-Dashboard Warte mal, wo war das denn? Man kann das sogar relativ einfach skalieren Ich könnte einfach 3 Server nehmen mit dem Crawler drauf Und auf dem ersten Server mach ich Shops 1-5, dann mach ich Shops auf dem zweiten Server 5-10 und auf dem dritten Server 10-15 Also Shops, Stores Also die Läden, wo man kaufen kann Das wird funktionieren Und das Frontend Das kann man nicht gescheit skalieren Dazu müsste ich das von SQLite auf Postgres oder irgendwas umbauen Dann könnte man das auch richtig Serverless High Serverless High Availability Horizontal Scaling Enable Ok, Dogger-Container ist gebaut Exquisite Ich muss mal ein Beispiel bei denen suchen Gering Star, der hatte doch so ein Docker-Beispiel Nur, dass wir das nicht wollen von dem Das wollen wir nicht von dem, wir wollen mal ein eigenes Docker-Image Passt Und jetzt müssen wir nämlich noch angeben, dass wir CPU limitieren wollen Das ist, wenn der Kram im Dogger-Container läuft viel einfacher, weil wenn man Lokal-CPU limitieren will Einfach CPUs 2 und gut ist Wenn man nämlich Lokal-CPUs limitieren will, geht das Aber spätestens, wenn man einen Prozess limitiert, der weitere Prozesse startet geht's nicht Kann man später auch Manuellprodukte Nein, kannst du nicht, kannst du nicht Kannst da nichts einstellen Du weißt ja gar nicht wie die ganzen Urls von den Shops und sowas sind, also du weißt das vielleicht schon aber der Crawler weißt das ja nicht Der kann ja nix crawlen, explizit für dich Das wäre ja riesen Aufwand, wenn jeder sein eigenes Zeug da rein macht Tja, Docker funktioniert das, aber wenn man ein bisschen CPU-Set macht, funktioniert's nicht Also, wie gesagt Im Dogger-Container ist es am einfachsten CPU zu beschreiten. Guck mal, ob das funktioniert Der sollte sich jetzt ein bisschen im Rahmen halten Oh, ich muss noch vorher was ändern Ich muss die Adresse, wo er einliefert, ändern Zwar, was hab ich denn lokal für eine IP hier auf meiner Kiste 2.31 So, das sollte jetzt eigentlich funktionieren Start Burger King Coupons Burger King Coupons Irgendwann, irgendwann mach ich sowas Irgendwann mach ich sowas Ich könnte das ohne Scheiß, ich könnte das aus Spaß, ich mach das aus Spaß rein Burger King Coupons Wo gibt's die? Die mach ich rein, das ist einfach Das ist witzig, wenn Burger King Coupons gibt Das ist lustig, wenn's dann einfach neben Hardware noch Burger King Coupons gibt Sag mal, welche Seite kann ich erkennen ob's die gibt? Eigentlich sollte der jetzt beschränkt sein auf 2 CPUs Warum ist der nicht auf 2 CPUs beschränkt? Also normalerweise sollte er das sein Ach, weil ich NPM Start gemacht hab Alter Richtig dumm Pains Champ So, und jetzt zeig ich euch die neue Preis Champ Version Ah, so ist gut, guck mal hier So ist das viel besser My Deals einfach via Feed Reader, das ist ne gute Idee Da muss ich nen Custom-Crawler basteln aber das ist ne gute Idee Und die haben dann RSS-Feed oder was? So? Ne Wo gibt's denn hier nen RSS-Feed von denen? Ami Hier, RSS-Hot Exzellent Da können wir nämlich mal gucken Was gibt's? Da gibt's Burger King Gibt's den auch gar nicht Chat Gibt keinen Burger King Anzeige ist raus und King Aber die Idee ist gut Die Idee ist gut Die Idee ist auf jeden Fall gut Ok, jetzt passt's Ok, so jetzt starte ich den lokalen Preis Champ Und jetzt zeig ich euch mal was Neues Jetzt richtig Massive Nice gemacht Aber mir gefällt's optisch schon nicht so 100% Das können wir jetzt im Stream machen Dass es dann hübsch aussieht bevor ich das pushe Out aufmachen Chrome aufmachen Jetzt zeig ich euch den lokalen Preis Champ 80 Warum hab ich den scheißen Lokal noch laufen? Keck weh Wann hab ich das gestartet? Warte mal Wo hab ich denn das überhaupt gestartet? Läuft da noch irgendein Docker-Container oder so? Ach der Crap ist noch am Start, Alter Stopp Haben die sich neu gestartet? Wo hab ich denn den Kram Docker-Composed? Hier? Meine exzellente Benamung Weißt du sofort Bescheid Das da? Nee Ich mein Das ist es Down Was? Das ist es Das ist es Das ist es Die Die Keck, warte Wo hab ich denn das? Ok dann lösche ich den Kram von Hand Docker stopp das da, das da, das da, docker, images, was hab ich denn, alter was ist da alles dabei, äh, lull, na gut, kann ich den auch nochmal löschen, so, jetzt muss ich das Surf nochmal neu machen, so, und jetzt zeige ich euch den neuen Preis-Champ, alter, minus v ist version, ne, minus v ist doch eigentlich löschen, ach, es ist minus, es ist down minus v, ne, das kommt auch noch auf die, das kommt auch noch auf die, ok, das ist echt hängen geblieben, das ist echt hängen geblieben, das, das minus v, was anderes ist wie das, ne, es ist minus v, was war minus v an der falschen Stelle, keck wait, ok, jetzt zeige ich euch den neuen Preis-Champ, bam, es ist noch kein großer Unterschied, erstens, das allerwichtigste, pass mal auf, ich hab, ich hab nen, nen Alarmsymbol gefunden, was mich nicht mehr triggert, guck mal, das ist jetzt properly aligned alles, ja, also da, da zuckelt kein Alken mehr rum, allerwichtigste, ohne hätt ich nicht weiter gemacht, so, und jetzt, guck mal, wenn du jetzt hier drauf gehst, an der Preis-Champ eigentlich jetzt mal die, die rtx gefunden, ne, aber guck mal, die andere rtx ist jetzt auch weg, lull, so, pass mal auf, wenns jetzt geht, all die musik, die musik ist ja monkaS, so, pass mal auf, wenn man jetzt hier drauf drückt, 30.90, bam, das gefällt mir aber optisch noch nicht so ganz, also, man kriegt angezeigt, welche Shops den Kram haben, man kann hier den Shop öffnen, sortiert nach Preis, und man sieht, wann der das gefunden hat, und die Zeit tickt runter, also sprich, hier weiß man, das ist noch ziemlich, ziemlich aktuell refreshed, guck, der geht, ich find's auch cool, wie redet das wieder hoch animiert, und so, da ist der Chat im Weg, achso, guck mal, seht ihr mal, wie hyper responsive das ganze ist, massive responsive, huge responsive, exellent, so, guckt, und hier sieht man auch, wann er immer zuletzt gecrawlt hat, und das tickt dann runter, ich mein, das sind halt 15 Minuten, das tickt ein bisschen langsam runter, also sprich, nach 15 Minuten time outed, das ist ja eh, ich hab das so eingestellt, wenn der was findet, und wenn er es innerhalb von 15 Minuten nicht nochmal gefunden hat, dann geht's weg, so, und wenn man dann hier oben drauf drückt, kann man sich die ganzen Angebote angucken, guck da, lagern, nur noch eine, Leute, bald gibt's nichts mehr, mehr Storngs für Media, äh, für Mindfab, wie komm ich auf Media Markt, Mindfabry, auch noch hier am Start, Alter, die Preise, was ist denn mit denen los, das ist einfach 1000 Euro teurer als angekündigt, so, aber das ist schon sehr nice, oder, übrigens, die Storngs stimmen nicht, by the way, ne, also das ist einfach nur ein fixer Graph, der sich nicht ändert, das ist noch null dynamisch, aber ich hab gedacht, ich bau das schon mal hin, weil das cool aussieht, lass einfach starten, fällt eh keinem auf bei den Preisen aktuell, merkt doch eh keiner, by the way, warum braucht der denn so lange, bis er das Ding geladen hat, ah, guck mal, ich hab da noch ein Bug drin, guck mal, das Verbug, das braucht so lang, weil der immer erst mal eine Sekunde braucht, guck mal, das riecht stumm, da muss ich gleich mal fixen, äh, Timer, äh, Timer, Timer, hier Timer da, jetzt machen wir anders, jetzt machen wir anders, dann ist es nämlich auch instant da, Update, Alter, ich kann heute nicht mehr tippen, das ist zu viel, Update, und dann, bevor wir das gestartet haben, noch mal ein Update, und jetzt ist es auch instant am Start, passt auf, zack, ohne dass das irgendwie erst laden muss, instant, instant Timer, instant Timer am Start, äh, by the way, soll ich den Chat irgendwo anders hinschieben, dass man das da besser sieht, ich könnte den Chat, wo schieben wir den Chat hin, unten links, ich weiß nicht, ich glaub unten links ist nicht so spannend gerade, unten links, da fehlt ein bisschen was von meinem Terminal Output oder so, aber das juckt ja nicht, guck mal mal, ja, also sprich, ihr seht, das tickt auch runter, und sobald sich das Refreshed, das können wir mal abwarten, aktuell gibt es bloß 3 Sachen, gibt bloß 3 Läden mit 30,90, ok, was sagt der Preischamp hier dazu, ah, der hat ja noch gar keine History, lull, ja, nur 3 Läden mit 30,90 gerade, aber sobald es aktuell ist, das ist ja übrigens auch live im Vergleich zu gestern, ne, also, wenn jetzt hier ein neuer Laden dazukommt, wir können ja mal kurz, wir können ja mal kurz zugucken, ob der irgendwie eine 30,90 hier findet, ah, der ist gerade bei 60,80 am Crawlen, ok, 30,80, wenn das eine 30,90 bei einem anderen Laden findet, dann ploppt das jetzt hier dynamisch auf, also sprich, man muss wirklich nichts mehr zu machen und aktualisieren, was haltet ihr denn davon, wie viel Schweizer Shops haben die denn da drinnen, ich lasse es einfach mal laufen, wir gucken mal, wie viel Schweizer Shops, ob sich das überhaupt lohnt, da einen Schalter zu machen für Schweiz und Österreich, aber die meisten deutschen Shops liefern doch auch nach Österreich und Schweiz, oder, oder nicht, ich hab keine Ahnung, wenn ich ehrlich bin, Austria, jetzt die Musik bisschen lauter, oh ne, passt, Austria, Switz, wie, Keg-Wade, die Schweiz gibt es da gar nicht, Zauerei, Repos, Street-Virgent, gucken wir mal, Stores, Store, kannst du grundsätzlich alle EU-Shops crawlen, ne, na gut, UK ist ja kein EU mehr, aber es gibt genug EU-Shops, die halt wahrscheinlich gar nicht nach Deutschland liefern, im Zweifelsfall, zumindest UK ist vorbei, UK liefert nicht mal nach, nach DE, also Overclockers hab ich rausgeschmissen, was ist denn, was ist denn John Lewis, hört sich an wie irgendein Wrestler oder so, aber es ist anscheinend, so, Crab, mal nach Punkt AT, mal gucken, gibt es keinen, und gibt es einen CH-Shop, lull, ok, es gibt keine Schweizer Shops und keine AT-Shops, also im Prinzip lohnt sich das nicht, Digitech, gibt es nicht, nach was, Brack, alter, ne, gibt es nicht, kein Brack, kein Brack, Digga, alter, Digga, Digitech, ne, gibt es nicht, guck mal, er hat live geupdatet hier, wir haben es zwar nicht gesehen, guck, jetzt hat er hier auch gerade Alternate geupdatet, die Animation ist ein bisschen schnell, oder, das sieht so aus, als backt es rum, ich sollte die Animation ein bisschen langsamer machen, für dieses einfaden, machen wir das eine Sekunde lang, dann sieht es eher so aus, als wollte ich, dass es updatet, ah, den Fix habe ich eh noch gar nicht drinnen, Moment, Moment, Minus eins, das habe ich doch gestern, gestern habe ich das schon mal, gestern habe ich das schon mal gefixt, Moment, Price, also, das ist noch der von gestern, Cacquait, das ist noch das von gestern, wartet mal, ja, geil, null, das muss ich jetzt mal kurz reverten, das hat, irgendwie, Wistel Studio hat das zwischengecashed, warum auch immer, Kackding, ich mache einfach mal alles zu, alles weg, was will das immer von mir, piss dich, alte, geh fort, so, jetzt schauen wir mal, was der hier drin hat, Serious Box, äh, ach ne, das ist doch richtig, passt doch alles, alles gut, alles gut, passt, ist doch richtig, so, also Asus Minus eins muss gefixt werden, hier, Asus Minus eins muss gefixt werden, also gucken wir mal, das heißt, wenn der Preis, hier, das da müssen wir machen, also wenn der Preis, äh ja, irgendwie reloaded kann nicht, but why, so, also, wenn, wenn der Preis, kleiner null ist, dann zeigen wir an, dann zeigen wir an, äh, kein Preis verfügbar, ja, das hatten wir gestern auch so, haben wir im Alter einen Api, um den Preis abzurufen, ne, ne, ne, ne, ne, die sind da auch glaube ich nicht so scharf drauf gecrawlt zu werden, aber die aktuelle Liefersituation, ähm, bleibt uns ja nichts anderes übrig, kann man den Chat nach oben, oben rechts machen, irgendwie ist der Chat überall im Weg heute, Chat, zu dick, Chat ist heute zu pepo fett, die können es oben links hin machen, ich habe eine andere Idee, wir machen einfach so, wir machen so, ach Moment, das, das, ihh, null, boah, das sieht ja kacke aus, der Chat ist jetzt kleiner als sonst, ne, der Chat, der Chat war doch vorher eher immer, Chat, ich glaube ich habe es kaputt gemacht, warte mal, wie resetet man das jetzt nochmal, transform, reset, Chat, ich habe keine Ahnung, wie groß ich euch immer hatte, so, rückgängig machen kann man hier nicht, soll der größer oder wart ihr noch größer, so, wo mache ich euch denn jetzt mal hin, wartet mal, wartet mal, ich habe eine Idee, da konnte man noch die Zeilen einstellen oder, ne, man kann die Zeilen nicht einstellen, na geil, ok Chat, so mache ich euch hin, wartet mal, ich habe noch eine andere Idee, so Chat, also ich mache jetzt mal unten rechts nochmal hin und jetzt machen wir aber die Höhe von 300 mal runter auf 150, das sollte nur die Hälfte hoch sein und dementsprechend solltet ihr dann eigentlich nirgendwo drüber sein, ok Chat, mal was testen, irgendwas spammen, gucken wie viele Zeilen der jetzt da drin anzeigen kann, ja jetzt seid ihr nirgendwo drüber, komm mal Chat, jetzt seid ihr nirgendwo drüber, Golden Kappa Test, perfekt, so lassen wir das, alles klar, gut, wo sind wir stehen geblieben, wir wollten das mit keinem Preis verfügbar fixen, also Leute wisst ihr was mir noch nicht so, was mir noch nicht wirklich gut gefällt, ist dieser Timer, der sieht da so fehler am Platz aus irgendwie, ne, habt ihr eine bessere Idee wo ich den hin machen kann, dürft nicht vergessen hier oben, das kann ganz schön lang werden, zum Beispiel wenn da Notebooks billiger drin steht, dann geht der Überschrift bis hier, weiter woher findet ihr das besser, wenn das direkt hier oben verlinkt ist oder mit diesem öffnen Button, ich find gerade im Detail View ist das mit diesem öffnen Button eigentlich ganz nice, ich mein wir könnten den, wir könnten das Bild vorne weg machen und dafür den Timer hin machen, aber das Bild hat was, weil wir machen die Bilder ja je nachdem wie teuer das ist, so wie es ist, ich weiß nicht, das sieht irgendwie nicht sonderlich gut durchdacht aus oder gerade wenn hier kein Preis steht, wobei wir können einfach nur kein Preis hinschreiben, du könnt den Timer rechts vorm Preis machen, ja hab ich doch, das ist wann er das gesehen hat, ja, einfach im durchsichtlichen Kreis wo der Border kleiner wird, ein durchsichtlicher Kreis wo der Border kleiner wird, also quasi jetzt, ich mein man könnte auch ne Progress Bar da unten hin machen, das ist zu big brain für mich, man könnte das sogar im Hintergrund irgendwie machen, Progress um das ganze Feld, oh das ist ein bisschen kompliziert, Serious Maxi meinst du das durchsichtliche Preis, wir könnten auch ne Progress, oh exellent, ach so, also du meinst ohne Zahl drinne oder was, wir könnten auch ne Progress Bar machen, gucken wir mal wie das aussieht, ich vermute mal das können wir einfach austauschen, nee können wir nicht, ok Rotate gibt es schon mal nicht dafür, alter was stört ihn jetzt, was stört ihn jetzt da dran, ach so das muss er wahrscheinlich größer machen, jetzt muss man das hier wahrscheinlich raus machen, ah hier, wow was jetzt, was hab ich jetzt kaputt gemacht, höchst besser sieht das ja nicht aus, so, wir könnten das unten an der Box machen, das ist glaub ich gar keine so schlechte Idee, so die Zahl muss halt weg, wobei das sieht aus wie Verfügbarkeit, das verwirrt die Leute, genau, genau, ohne Zahl sieht das so aus als ist das irgendwie Verfügbarkeit oder so, hm, kein Preis ist natürlich das beste, der niedrigste. Ja gut aber die Zahl die geht da ja nicht hin, die Zahl die sieht halt mega bescheuert aus, nee das sieht total beknackt aus wenn ich da eine Zahl hin mache, man müsste höchstens irgendwie nebeneinander machen oder so, geht gar nicht, mach doch die Zahl trotzdem dahin, da wo vorher der Kreis war, das funktioniert nicht richtig, weil das ist alles in einer Komponente drin, die Zahl und das the progress das krieg ich da nicht hin, das ist guck mal das ist super responsive, pass mal auf, huge responsive, siehste das wie massive responsive das ist, exquisite responsive, so, ja das sieht kacke aus, machs mal wieder rückgängig, warum checkt der das net, das ist wieder rund, der soll das jetzt gefälligst rund anzeigen, so jetzt mach ich das ja auch mal wieder rückgängig, ach nee, ok leute ich glaube ich lasse das jetzt einfach mal so mir fällt nichts besseres gerade ein, mir fällt gerade echt nichts besseres ein dazu, so also bevor ich das pushe, was meint ihr, was soll ich denn mit dem unten war besser, ja aber unten sagt das absolut gar nichts, also unten, genau, wenn das unten ist denkt man das ist irgendwie verfügbarkeit, ja wie könnte man das denn machen, dass man es versteht, ich mein, ich hab ne Idee, leute ich hab ne Idee, ich hab ne Idee, wir machen das anders, guck mal wartet mal, wir schreiben da gar keine zahl rein, wir schreiben da gar keine zahl rein, wir schreiben da rein, wir machen dann icon rein, wie wärs mal mit updaten, was ist denn los hier, normalerweise macht das updaten das automatisch, na das sieht auch nicht gut aus oder, braucht man das überhaupt, ja das ist schon nicht schlecht zu wissen weil man das gefunden hat zuletzt, das sieht dumm aus, na vielleicht, ne ok das sieht dumm aus, ich mein wir könntens hier unten drunter machen in klein oder, warum machen wirs nicht unter das keck w in klein, ja zeitstempel hatte ich vorher, das sah auch nicht gut aus, wir machen das mal unter das keck w in klein, ok wir machen die zahl weg, dann machen wir den kram kleiner und das in der mitte fetter, so, das zeigt was er zuletzt refreshed hat, so und jetzt, und jetzt, richtig agile, ja, und jetzt zeigen wir das unter dem keck w an, so wo ist der hier, da, kann man das jetzt einfach hier unten drunter machen, äh, äh, wartet mal, ne das sieht kacke aus, ich war mal die höhe irgendwie auf 60 oder so, oh, das war die, ist das irgendein flex oder was ist da, was passiert nur jetzt wenn ich dem einfach sag, margin top 15 oder so, gehts dann runter, ne, wie krieg ich denn das jetzt runter, dann break dazwischen, float wirds auch nicht tun wahrscheinlich, äh, also float wirds auf jeden fall nicht bringen, so, ich mein wir können das eingebaute zeug verwenden, sollte das einsch machen, äh, wov wird der immer schlimmer, fast, fast, fast, wir nähern uns, wir nähern uns leute, wir nähern uns, wir nähern uns der sache, guck mal, guck mal, fast, fast, äh, äh, äh, excellent, ein bisschen höher müßt man es glaub ich noch machen, jetzt ist zu hoch, 70, auch zu hoch, 60, warum schneidet der das denn da unten ab, was ist das für, was ist das für ein kacknooper, 18, warum schneidet der das ab, will er mich rollen, anzeige ist raus, äh, ok, so, äh, den preis denn der ist nicht richtig, nicht richtig ausgerichtet, wahrscheinlich kann ich den ganzen kram jetzt hier wegmachen, äh, so, excellent, excellent, das sieht doch jetzt aber schon mal ganz gut aus oder, man kann besser also ein kringel da irgendwo nehmen, pacman frister's zeichen, das sieht aber immer noch wie ne menge aus, das gefällt mir nicht, ich war, ach, keine ahnung, ich mein wir können doch einfach nen timestamp hin machen, und nen progress bar war am besten, ja dann machen wir einfach, dann schreiben wir wirklich einfach die zeit hin, kann man ja machen, das ist kein ding, dann machen wir das weg, so, dann kann ich nämlich auch diesen ganzen müll da unten weg machen, äh, das hab ich jetzt verkackt, warum ist denn das jetzt untereinander, das ist doch normalerweise nie untereinander, span sein, ahja, ok, ok, passt, ok, ok, ok, alles, was in zeit 38, oh, ich mein wir können da einfach nen timestamp drunter machen, das geht, aber letztendlich mal im ernst, interessiert es überhaupt irgendjemand, wann er zuletzt abgefragt hat, ich mein es verschwindet halt einfach nach 15 Minuten, eigentlich ist die doch wurscht oder? Das reicht doch komplett was da drin steht. Ich kann die Zeit mal neben dem preis probieren vielleicht vielleicht etwas andere variante das ist das ist ist auch nicht wirklich besser oder? Oder? Ja gut dann lassen wir es erst mal so serious marks was meinst du als exzellent frontend expert nicht mehr das ist das bei dir sieht das anders aus bei mir im bei bei mir im browser ist es 12 stunden stimmt wir könnten das wir könnten das nach sekunden wir könnten das vorweg wir können hinschreiben vor ich habe die nachricht jetzt gar nicht gesehen was habe ich wieder zu was habe ich was zum lachen verpasst man könnte wirklich hinter guck mal wenn er wenn er anstatt die zeit stehen würde wenn man da einfach hinschreibt wir gucken wir vor vor 13 minuten ist das das wäre doch besser oder das das wäre doch das wäre doch eins besser jepp das ist gut dann machen wir das da gibt es da gibt es doch bestimmt schon irgendwas fertig ist um den kram umzurechnen ich meine ich könnte meinen timer mein timer progress zu umbauen dass der das dass der das ausrechnet weil du brauchst ja einen timer sonst aktualisiert er das nicht na also ich mein das ist gar nicht mal so einfach kann das also ich meine in sekunden umrechnen ist kein problem ok ich ich ich ich ich werde mal mein ich werde mal meinen timer umwursten zu was was das anzeigen kann hier ich werde mal meinen timer umwursten zu was was das anzeigen kann was ist denn jetzt das problem was keck wait was was das hatte ich doch eben drinnen es all oder die bin die klärt moment importierst du es mehrfach warum das denn wo kommt das auf einmal her ne hab ich da gemacht war das auto im das ja das war auto import auto import scheint nicht so clever zu sein ok so jetzt jetzt wurscht jetzt wusste ich nehme ich dieses dieses um diesen timer um zu einfach nur texte hinten dran steht so time out also der ganze mist kommt weg alle was mit der musik los eigentlich gerade im hintergrund das ist ja absolut monach es muss ich so irgendwie ich muss ich muss man hätte sein ein kloten ich höre mich auf der linken seite nicht mehr so es passt für die richtige agile arbeitsgruppe hier im chat wieder ok jetzt kommt dieses progress ding weg und wir schreiben da einfach nur noch genau so also diese die minuten habe ich schon die minuten habe ich die sekunden habe ich auch das ist gar nicht so einfach das umzuwandeln doch gibt es doch bestimmt schon irgendwas fertig ist für j.s. convert time to time ago oder so weil die sekunden habe ich ja also mit sekunden ist es einfach mit sekunden ist es einfach schreibe ich aber vor sekunden so fertig ach so start gleich also in sekunden ist das einfach ups aber das müsste man jetzt umrechnen gibt es eigentlich ein format für oder so hat das ja ja was gibt auch bestimmt irgendwie so ein so ein so ein format time format string gedöns oder ich meine das ist auf jeden fall schon mal schon mal besser ok j.s. format string time wie das muss doch so was haben das hat doch alles ich mache da jetzt nicht moment j.s. rein nur für sie für sowas wie das muss doch format das muss doch sowas haben to local time string das das habe ich glaube ich auch schon mal verwendet das options genau options time so ein aus format matcher alter warum ist das so ultra kompliziert in java script wieder was ist denn hier los ok ok das ist java script kompliziert aber es scheint zu funktionieren also also also ok das heißt monka es also also also wie jetzt keck keck wait also moment mal also time ist die musik wills auch gerade wissen time so jetzt haben wir chat im weg schon so hier datetime chat ich blende euch aus hier guckt mal jetzt könnt ihr zugucken ich blende euch nicht aus also das ist detail und was muss man da jetzt machen monka es options alter was zum nicht spanien de de ok ok ok so und jetzt will ich will es ich will es eigentlich gar nicht will überhaupt kein day ich will eigentlich nur minute und so formatieren minute so kann man kann man kann man das aus wenn ich zu lokal times kann man da sagen falls oder so was dass er das weglässt aber wenn man das nicht angibt dann ist es weg oder was oh moment ich bin übelst verwirrt da fuck ich muss es ja vorher ich mein ich muss es ja vorher voneinander abziehen auch noch ich will es ja gar nicht ich will ja ich will ja new ich will ja datetime now minus date aber das geht ja nicht ah wie ziehe ich in java script zwei zwei zeiten voneinander ab wozu schreiben wir hier was hier das da guck mal preis preis tracker habe ich erweitert an java script macht mich fertig ok man kann also man zwei dates kann man nicht voneinander abziehen js subtract date da muss es doch irgendwas geben autos abt ein bisschen was neueres please get time und das dann voneinander ok ok also get time moment das habe ich doch hier oben schon gemacht get time ist millisekunden seit 1970 beta.preischepp.org jetzt kann ich natürlich nicht mehr formatieren alter das ist mir zu dumm ich meine ich habe ja so gekam hier schon programmiert so das ist das ist für sekunden das sind die sekunden das kann ich eigentlich schon mal verwenden kann ich jetzt aus den sekunden neu ins neues date machen geht das irgendwie es geht bestimmt das geht bestimmt das probiere ich jetzt aus ok new date aus den sekunden aha das das sieht das sieht sogar schon mal ganz gut aus das sieht sogar schon mal ganz brauchbar aus eins ach man kann er einfach man kann er ernsthaft to string machen das geht moment wenn es so einfach ist hey quake so einfach ist es nicht ok aber aber ich copy paste jetzt mal den chat ich glaube passt jetzt mal den chat chat easy ich glaube ich das jetzt einfach mal gucken ob ich jebaited werde geht nicht easy aber man muss dann bestimmt clear time is not a function siehste der chat jebaited mich und add seconds geht wahrscheinlich auch nicht ich will eine sekundenanzahl umwandeln in minute sekunde mit javascript build ins ich will da nicht anfangen mit wenn größer als 60 dann eine minute dazu und sowas da muss eigentlich was eingebautes für geben was hier das was da in den chat gepostet hat ging schon mal wie gesagt das js epoch to date wie geht das kann man kann man nicht what oh jetzt wird es wahnsinn alter der chat der chat will es wissen jetzt passt auf ok jetzt jetzt bin ich mal gespannt ob das funktioniert leute beim easy also moment javascript logik moment das was ich gemacht habe war doch gar nicht so verkehrt das war sich so gemacht was ich so gemacht hat war doch gar nicht verkehrt warum geht warum ging das bei mir nicht das ist doch mehr oder weniger fast das gleiche wartet mal hätte ich das mal 1000 rechnen müssen das ist milliseconds das ist nicht sekunden seit 1970 das in millisekunden seit 1970 alter wo kommt da überhaupt die stunde her jetzt wo kommt da wo kommt wo kommt da jetzt wo genau kommt da die stunde her so und jetzt options adi zeitzone das wird da macht auch noch zeitzonen geschiss ok bei minuten interessiert uns das mit zeitzeitzonen natürlich nicht ok also wie der man nicht kann man jetzt sagen aber ok aber kann ich jetzt einfach minutes was ist wenn ich das weglasse der macht immer die fucking stunde dahin aber to time string bringt an sich an nichts kann man da auch optionen übergeben kann man da options übergeben kann man da options über geht ne warum kann man ach so einfach nur options ja ja war script ich check die logik nicht warum kann ich bei local time string was übergeben und bei was wo ist denn jetzt das problem nehmen doch einfach eine fertig ich habe doch schon was was funktioniert aber ich will nur wissen was wie weit ich da jetzt davon entfernt war das aber ist noch die feind ach so ok ja ja gefahrt und ja quä kann man da options übergeben das macht mich fertig wobei das was was der was der chat verwendet ist eigentlich noch besser das kann er jetzt sein und ich will einfach keine stunde anzeigen warum haben wir nicht einfach mit dem time format ding ist das ist ist das zu zu high level für für java script leute oder wie ok auch man kann auch nicht einfach null schreiben dass das weglässt oder ne das geht nicht meinst du wenn ich aber wenn ich da minutes angebe so nicht verfunktionieren so ich nehme jetzt das was der chat gepostet hat excellent und dann ist gut einfach so zack gut ist ich nehme einfach das was der was der was der chat was der chat geschrieben hat chat chat kennt sich aus wissen wir excellent chat immer excellent drauf der chat excellent timer timer da brauche ich noch was anderes dafür irgendwie go oder so das ist bestimmt ein string der da zurückkommt das go gleich ja moment warum ist der warum ist da 00 warum ist moment moment moment von da muss ich bestimmt später anfangen 13 oder so ja 14 und dann irgendwie nur 4 5 aber das funktioniert doch auch nur ok wartet mal wenn die erste zahl null wird ob das dann auch funktioniert ok ok nice nice ok alles klar excellent mit minute oder ohne ich glaube die die einheit können wir uns sogar schenken weil die meisten leute das checken wenn sie das so sehen glaubt das kann man so lassen wie es jetzt ist wie lange haben wir jetzt an dem scheiß rumgemacht sorry ich hab falls ich irgendwelche subs übersehen hab muss mich gerade über ja fast krebt pp gar die zeiten zählen runter da stimmt was nicht sekunde das falsch rum das falsch rum wartet mal aber das lässt sich glaube ich einfach fixen aha so das ist das gefällt mir das hat doch was oder finde ich auch das doch schick nur dass es nicht richtig allein ist aber das ist in ordnung so lassen wir das alles gut bevor ich habe kein bock mehr da weiter dran rum zu machen wir allein ist noch mal kurz die die currency richtig warum allein das nicht warum allein sich das nicht jetzt was ist hier los ist das ist das vielleicht das hat es refresh nicht gecheckt warum allein sich das jetzt nicht mehr eben ging es auch noch ich krieg anfälle excellent frontend kann ich einfach sagen dann wenn sich das nicht allein dann mache ich einfach das das ding hoch und gut ist das allein sich einfach gar nicht was hat kein bock mehr ist dem vollkommen egal kann ich auch wegschmeißen was ist das ist margin right margin bottom margin left aber so ist ok ich fasse es nicht wahr leute so bleibt es jetzt schluss so so so bleibt es jetzt fertig so das update machen noch auf eine sekunde hoch dann sieht es ein bisschen gewollter aus so sehr schön soll ich bin mir noch nicht so ganz sicher was mit dem graf mache übrigens wisst ihr wisst ihr was ich mir überlegt habe ja das sieht viel cooler aus oder wenn es die sekunde wenn es die sekunde braucht dann sieht es dann habt ihr es gerade gesehen in sekunde sieht das viel gewollter aus die animation so was ist welche umfrage ich habe es nicht gesehen exquisite umfrage was was gibt es für eine umfrage eine umfrage vorgeschlagen umfrage ja was für eine umfrage ah könnte man ja hier habe ich habe ich alter chat also eine umfrage vorschlagen könnte man in den grafen für den preisverlauf noch einen balken für den uvp machen damit man preis besser einschätzen kann ja das haben das haben wir uns letztes mal auch schon überlegt ob man das machen kann aber das ding ist schon ganz schön ganz schön beladen also sprich die uvp könnte man entweder wie könnte man das machen also eigentlich mein ursprünglicher plan war das bild ändert sich je nach abweichung zum uvp das das das fängt dann an wenn es wenn es richtig billig ist wenn es richtig billig ist fängt es dann fängt es dann irgendwie so an über so und hört dann irgendwie so auf oder so und kein preis kein preis kriegt ein anderes emote moment wartet mal price was klatter balken ins diagramm hier oben balken aber aber solche balken rein machen das sieht doch so viel besser aus als mit einem balken ach so uvp so ein ding das ist eine gute idee das gefällt mir das ist nice das das das müssen wir mal gucken wie man das macht ich habe keine ahnung wie das geht das ist chargers ich habe einfach einen statisches statischen kraft drin aktuell das geht das geht garantiert das geht ja was ich muss ein plugin verwenden dafür ernsthaft kann doch nicht sein das geht garantiert auch so ohne ohne plugin also das ist data wir machen einfach ein zweites data set rein was was einfach was einfach nur so geht passt mal auf das kann man bestimmt machen data set und jetzt einfach irgendwie eins was die ganzen zeit nur so geht ja easy border eins by the way warum also was ist und was ist in der uvp 1500 zu schnell copy pasted kann er das nicht automatisch extenden muss ich da wirklich für jeden punkt ein angeben ich will diesen diesen diesen huppel hier aber weg haben falls das soll nicht gefilmt werden das soll gefilmt aber wie kriege ich da die die knubbel weg aber bei spiel ist ein schon mal ganz gut ja preis es ist nicht preis es ist uvp das ist eine richtig coole idee leute aber der graf ist halt eh statisch wir haben die die infos habe ich noch gar nicht ich habe die infos aber das gute ist ich kann das jederzeit füllen ich habe nämlich die infos in der datenbank stehen elements radius point excellent der chat kennst damit aus ups nein aber fast aber fast oder oder nee wohin wohin damit was ist das point radius null ich hab von der library kein plastenschimmer ups ich muss aber richtig schreiben können ne ne ne so auch nicht in die options ja aber wo sind die options gibt es also gibt options so was fast und ne dann gilt ja für alle für alle will ich das nicht für alle ist das doof ich muss mal googeln ja ok moment halt points in kraft das ist ja nur für einen moment ist das ja das ist global you can set point radius aha aha siehste so geht das also so geht das ist einfach mal google google magic gemacht nice so und wisst ihr was wir jetzt machen wir nehmen jetzt die gleiche linie wie oben im header ich gebe dir header alter das ist auch das gefällt mir das schick oder heute jetzt jetzt habe ich eine idee habe ich einen color picker habe ich einen color picker was ist ein guter color picker für linux color picker color picker e color color 3 excellent ich baue irgendwas was mit knorrm keyring ok was auch immer der alles damit installiert ok e color picker so und wie pick ich jetzt color wie funst das geht das nicht der scheiß kronbst ich hätte erwartet ich klicke da drauf und dann kann ich was was was color kram aber ich glaube das geht nicht oder die da sind noch das problem ist dass das gnome zeug geht nicht wenn wenn kein chrome gestartet ist glaube ich mal je color alles wieder entfernen davon jetzt sofort ok ich meine wir könnten winnows color picker in die vm also die 3m color picker was gibt's was gibt's für einen guten firefox color picker color picker was ist das fage ok das brauche ich fage geht das geht das unter i3 if you use x color picker ok ok den benutzen wir von excellent ist ja seht ihr mal für manche sachen sind nur linux gar nicht so einfach hallo was ist das problem color picker ja welcher color picker davon ist der richtige click on a pixel on your screen das scheint der richtige zu sein einfach schnell ein ruby programmieren ich hätte euch das erzählen soll color wo ist er da ist er ok das scheint zu funktionieren warum ist das jetzt nicht bei meinen programm zum starten drin alter das kann jetzt nicht euer ernst sein dass ich das jetzt über das terminal starten soll dass ich das nicht als normale desktop anwendung registriert hat oder ok also was ich machen wollte ich wollte mit den color pick den hier picken und jetzt in dem in dem craft den keks mund color verwenden für den craft das doch nice oder so muss das sein und ich hab mir auch überlegt ob wir nicht die alerts ob wir nicht die alerts auch in so einer farbe machen alerts ja alert nicht verfügbar color kein preis bild ändern ja das müssen wir noch machen ich meine das hat ein bisschen besseren kontrast aber jetzt so viel besser ist bin ich mir nicht so sicher zumal an dem keks nix grünes ist das sieht kacke aus für nicht verfügbar keckweight ersetzen ne nicht verfügbar zeigt der da drin gar nicht an wir lassen es jetzt erstmal so wir wollen die Leute nicht zu sehr verwirren so notifications geht immer noch wunderbar ok kein preis haben wir hier angezeigt also da gehen wir nochmal in dialog avatar so das können wir zumindest mal einbauen also wenn ja ja das jetzt ein bisschen viel kacke weh if preis kleiner null wobei was mache ich denn warum kopiere ich denn das ganze reicht auch wenn ich das image wenn ich das auf dem image mache reicht auch wenn ich das auf dem image mache ich muss doch gar nicht das ganze ding hallo ich will es hier copy pasten alert sound muss den browser ändern das kannst du da nicht machen so jetzt kacke weight das wird nice ok ffz kacke weight ist auch in groß aber immer angst wenn ich auf google bilder suche gehe dass da irgendwas falsch rum falsch rum leute das ist nice das gefällt mir ich kann sound auf einer seite abspielen das funktioniert mobile nicht und das mag eigentlich keiner wenn die seite irgendwelche sounds abspielt macht das lieber über die notifications ich weil oder how to play sound und website ich weiß gar nicht wie das geht also man muss jetzt hinterlegen und dann einfach play ok der sound kommt ja nur wenn du notifications angemacht hast aber ganz ehrlich das braucht man nicht die desktop notifications machen auch ein bimm und da kann es jeder einstellen eigentlich eigentlich ist das sinniger ich glaube wir bauen noch keinen sound ein ok kacke weight so wir schreiben jetzt noch hier hinter das popup bevor ich das pushe und ihr das ausprobieren könnt hinter das popup schreibe ich jetzt noch in arbeit dass man weiß dass es noch nicht funktioniert aber ich finde sie schon mal cool aus platzhalter so alles klar so was müssen wir jetzt noch machen lassen wir überlegen ach ja ich habe eine sache könnte man noch echt cool machen hier oben da zeigt jetzt überall so eine gpu an wir könnten es dynamisch machen dass der gpu anzeigt und bei der konsole dass da bei der konsole sogar anzeigt eine konsole halt ne oder zumindest irgendwas was so ähnlich aussieht wie eine konsole gibt es da gibt es dann schönes bild für konsole controller oder sowas ja an die konsole controller ja dann zeigen wir so gamepad an super nintendo wo es ist eine mischung aus dem super nintendo dem ns controller moment stadia gibt es ein stadia icon da seht ihr mal die kacke google selber stadia findet die hat noch nicht mal ein stadia icon gemacht wenn die digger sind von google plus ein paar community addons aber zum größten teil ist es google also es gibt kein xbox control das macht nichts die kriegen gleich ein controller so das müssen wir jetzt bloß noch mal einstellen dass es auch tut erst einmal müssen wir hier unsere übrigens unsere beschreibung fixen die stimmt ja nur für grafikkarten also wie heißen die reisen dinger richtig amd reisen hier ist die richtige bezeichnung von den dinger amd reisen alter lass mich copy so so so heißt es richtig amd reisen 5 5600 so sagt mir wenn ich misst machen der hier heißt wahrscheinlich genauso mit 8000 und der heißt wahrscheinlich genauso mit 9000 und der heißt wahrscheinlich genauso mit 9050 der heißt nicht x oder der heißt 9 der heißt der heißt wirklich 5950 ohne x vergessen wo ist nix wo ist nix wo muss nix hin echt ich x x was sind das jetzt eigentlich für einer das sind siebener oder was das ist auch wieder ein x dahinter das ist ein 7 7 x und das ist nun 9 x und ist das auch den neuen x oder ist das einfach nur ohne x letztes auch x alles klar excellent so und die dinger heißen dann so amd ich glaube so heißt wenn man ganz ganz korrekt ist so so und der hier wahrscheinlich ohne xt und der hier mit 9 xt so sony gut das ist einfach sony plays ich kann immer schreiben plastics playstation 5 das schreibt man glaube ich zusammen playstation 5 wie nennt man die classic wie heißt die heißt die classic edition classic das da unten ist digital edition digital auf die xbox das habe ich jetzt keinen bock ich glaube ich glaube die dinger heißen auch tatsächlich einfach nur so nur noch das microsoft davor kommt x ok jetzt haben wir das ganze in schön müsste es das pop up schon mal funktionieren sehr gut habt ihr gesehen wie dynamisch er das abgedatet hat classic guck mal da macht sogar man darf es nicht zu klein machen seht ihr mal wie clever der sogar ist und da punkte hinten dran macht wenn es nicht ausreicht nicki 9208 dankeschön für den sub großes playstation die sind ja hardcore drauf die leute da bei sony kann es doch keiner merken so alles klar sehr schön sehr schön so jetzt sieht das pop up schön aus ja oh guck mal computer universe klitscht in da rein wenn man nicht aufpasst anzeige ist raus direkt also gut wunderbar so jetzt müssen wir nur noch gucken dass der hier oben das richtige anzeigt das heißt wir müssen das wir müssen das hinten bisschen erweitern wir brauchen hier noch sowas wie also entweder machen wir jetzt direkt das emoji rein was wir für den den den den das symbol rein oder wir schreiben hier sowas wie type ach komm wir machen direkt das symbol an scheiß warum soll ich das im frontend noch mal extra matchen ist doch komplett komplett bescheuert wo sind meine icons also das gibt gpu beziehungsweise extension card oder so hieß das glaube die seite ist auch hardcore langsam kann man da eins für eine die die mit die extension also icon sieht richtig champig aus ja so das ist auch gpu seht ihr mal wie clever das ding ist guck mal da macht für mich ein kommer hinten dran das sind auch gpus das nicht das sind auch wieder welche so cpu hatten die hatten auch cpu hatten sie auch so und jetzt dann ich schöne das processor ich nehme halt den meinetwegen wenn es sein muss was witzig ist intel ist mittlerweile so irrelevant dass noch nicht mal im preis champ drin stehen cip cip was genau cip der da ne das ist memory aber ich finde sieht aus wie cpu ach wir nehmen das mit 64 das doch wir gucken dann mal ob das live updaten kann der sollte das nämlich live updaten wenn ich das dann ändere im hintergrund ok jetzt haben wir das hier alles drin stehen und jetzt brauchen wir noch controller controller jetzt wim shortcuts ok hammer so dass das jetzt funktioniert muss ich auch mein typ erweitern wenn ich wüsste wenn ich mich noch dran erinnern könnte wo ich den kram hin gepappt hab product series genau das hat jetzt nicht das hat auch noch ein icon sehr gut so warten bis restartet ist nehm den xbox controller es gibt keinen xbox controller oder gibt es den xbox controller du meinst den da ach guck mal das ist ein stadia controller die gibt es tatsächlich findest du nur nicht unter stadia ok es gibt tatsächlich einen xbox controller aber es gibt kein xbox controller outline gibt es kein xbox controller outline das ist ziemlich doof die outline varianten sehen viel cooler aus das können wir gleich mal live ändern während es läuft dann können wir schauen dass das auch funzt ok das heißt wir zeigen jetzt hier oben nicht immer expansion card an sondern wir zeigen an serious icon hier warum hack wait marifreschen marifreschen muss mal kurz mal kurz hier die debug stels aufmachen macht das auch so dass ihr was seht chat aha wo kommt man den scheiß noch mal verschieben wo ist das wo ist das icon wo ist das ding zum verschieben von ihr ne das war das wollte ich gar nicht das wollte ich btf so man ist ja auch das falsche ist ja auch das falsche muss ich hier nachgucken im main datei muss ich das nachgucken ja da wird es ja schon die ganze zeit raus gedammt warum ist hier das icon nicht da ich habe es im craftql nicht abgefragt kann das sein icon da ist es doch zack guck mal da bisschen fett würde ich sagen aber xbox also das funst und für die grafika der extension geht auch habe ich mich hier verschrieben ich habe mdi vergessen guck mal pass mal auf der sollte das eigentlich live updaten wenn ich das hat schon gemacht ok sehr gut die ryzen cpu ist ein bisschen fett aber sieht eigentlich gar nicht so schlecht aus oder so und jetzt und jetzt updaten wir das mal live was haben wir hier auf der 5800x und da haben wir jetzt einfach mdi chip draus und da sollte das quasi on the fly ne das ist nicht so reactive wie ich mir das gedacht habe da muss man halt neu laden es gibt schlimmeres aber aber das dynamische hinzufügen funst noch oder oder habe ich das irgendwie geprägt ne das funktioniert noch also hier xbox hier ist xs confirmed ok nice excellent excellent so dann würde ich das mal pushen da können wir es ausprobieren gucken ob es auch funktioniert guck da lieferbar rx ok wir pushen mal den preiszamp jetzt bin ich mal gespannt mal gucken ob die russischen dedos tippen wieder am start sind jetzt mal ein grefana dashboard aufmachen ach komm mal hier war ein aussetzer hier hier wirds hier wirds schonmal gel gel guck mal da war ein aussetzer sag mal kann das sein dass ich dass ich nicht gededost werde sondern hetzner um die urzeit ein paar probleme hat weil das sind immer guck mal leute das ist immer die gleiche urzeit ne das das vielleicht werde ich gar nicht gededost kakwait ich hab mich schon gefreut dass ich das das das so beliebt ist dass ich gededost werde ok wir sehens gleich ich lock mich jetzt ein ich lock mich jetzt ein mal gucken mal gucken wie gut es läuft attach achso moment kann ich da überhaupt hin pushen jetzt ok kakwait ich bin mir gar nicht sicher ob ich da ob ich da überhaupt hin pushen kann ok ich muss erstmal auf jeden fall neues frontend bilden ok leute hab ich schon irgendwas vergessen ich will jetzt nicht dass es kaputt geht wenn ichs pushe ähm kann aber alles zu funsten erstmal ne was nice wäre wenns vielleicht ein paar von euch auf dem android und auf dem iphone wobei im iphone kann ich selbst ausprobieren ob da alles ordentlich scaled skaliert ok alles erden git add git commit a minus m streamsorts push ähm ach du scheiße ähm was hat ich denn da nochmal genommen ich hab sonst einfach key-authentifizierung ok das ist bei mir lokal daheim das ist egal admin admin ne ne warte mal probier mal ich hab ich hab normalerweise nehme ich ja immer so einen schwachsinn aber ich da hab ich da hab ich glaube ich was nicht super kompliziert ist aber was doch ein bisschen längeres genommen das ist lokal domain bei mir na gut ist egal ich muss ja da auch gar nicht hin pushen ich muss ja auf meinen server pushen das reicht ähm aber hier kurz das ding aus das ach das doch von gestern auf dem server hier oder was ok dann gucken wir mal wobei ich müsste jetzt ja eigentlich einfach das ding als remote adden können wenn ich das noch richtig aus dem kopf geht remote add ähm preisschamp oh wie war die syntax dafür äh natürlich als root als was sonst beta bezeit ich mal ein paar github actions oder irgendwie sowas mach da kann ich einfach git pushen nach github auch in private repo ist egal und es funktioniert einfach ok ich hoffe ich hab das richtig gemacht jetzt muss ich jetzt muss ich jetzt geht kurz der preisschamp kaputt preisschamp shut down wie kann man ordnung auf seinem c halten äh downloads einfach auf eine andere andere ähm andere platte machen hab ich auch ich hab ja nur eine 512 g ssd drin und da kommen ein paar einzelne spiele drauf aber ich hab noch eine zweite 2 terabyte ssd und noch eine äh 6 terabyte platte dran und das passt eigentlich und dann hab ich die downloads hab ich auf der magnet festplatte alter beende dich mal der preisschamp will nicht so mal gucken was macht der preisschamp wow der überträgt ganz schön viel komm mal der preisschamp der will gar nicht mehr abbrechen preisschamp paper please könntest du was zu deinem system in der vm sagen erklären ja aber er ist noch nicht beendet ist der preisschamp der preisschamp ist weg oder ok der preisschamp ist ist ist wohl weg wo ist das alter wo ist das problem beende dich mal ähm könntest du was zu deinem system in der vm sagen das ist mein charo mit die 3 wm alter ich kill das jetzt gleich der preisschamp hängt aber ganz schön hart ok leute jetzt ah jetzt vielleicht jetzt vielleicht preisschamp preisschamp geh aus ansonsten wenn du nicht brav bist preisschamp dann weißt du was passiert der preisschamp will sie nicht beenden weiß ich weiß ich gesagt gar nicht warum die rammer haben wir eigentlich gerade so ok preisschamp 5 4 3 2 1 ok repp preisschamp hat sich ausgezämmt jetzt hängt er wieder leute kann das sein dass der einfach nur ewig lange braucht bis zur verbindung weil guck mal jetzt hängt wieder ich glaube das sind gar keine russischen denos dudes oder so der preisschamp hat irgendwie probleme beim verbindung schließen oder so könnte das sein programmierst du den preisschamp aus spaß ja hauptsächlich unfalls was bringt kann das sein dass der preisschamp ein bisschen irgendwie linux netzwerk mäßig probleme macht oder kann es sein dass der preisschamp weil da so viele connections closed die hetsen der dedos protection triggert oder irgendwie sowas dann guck mal hier der macht dann der macht schon ein bisschen was der ganze chat ist eingeloggt oh nee warum alter warum ist der server auf einmal so am rumspacken wo ist das problem das sind 16 kerne und das ding macht faktisch nix ganz die ganze welt ist lockt in da preisschamp ist total aber warum hä das verstehe ich nicht das leuchtet mir echt nicht ein warum der so am abkacken ist dabei jetzt der pinkt auch nicht mehr wahnsinn okay dann dann glaube ich doch nicht dass ich gededost werde ich habe ich hatte ja so die vermutung aber aber wie kann das sein was macht er irgendwie 30 aber selbst wenn er 30.000 verbindung beendet wo ist das problem ich habe ich will mich jetzt nicht bei hetsen einloggen da muss man smartphone holen für otp hast du geguckt ob das ding am brennen ist naja wenn schon brennt bei hetsen im rechenzentrum und es ist eine vm nee also warum der so am abkacken ist verstehe ich nicht kann es sein dass bei einer registrierten notification der server ständig abgefragt wird wenn er nicht antwortet ja aber selbst wenn dann machen die paar besucher die da drauf sind auch nicht den server dauen ich verstehe das verstehe nicht ich muss mal kurz hier ausmachen mal kurz und dann gehe ich mal ich logg mich mal bei hetsen ein wird Zeit dass ich das aufsplitte leute morgen splitt ich das auf dass das stört dass der scrawler ding so otp muss die muss die autentifizierung app aufmachen immer so ein akt sich da einzuloggen aber so ist das halt bequemlichkeit versus security ne okay ich bin eingeloggt okay gut dann machen wir die vm wieder an ich mach die fall immer aus dass nix über den clipboard manager landet an passwörtern und so oder war noch nicht ganz tot er hat kurz geantwortet er hat kurz geantwortet der preis jump alles vorbei okay ich starte jetzt neu über die über die konsole er hat wieder geantwortet leute hat wieder er hat wieder geantwortet er antwortet schon wieder was ist jetzt fängt er sich noch mal fängt er sich noch mal postchamp er will nicht er will nicht disabelt werden er will nicht er will nicht rebooted werden naja wenn du cloudflare davor machst wieder auf irgendeine hetsnerkiste ne leute ist vorbei ist vorbei ich starte jetzt neu ist aus und jetzt mache ich wieder an dabei guck mal der leckt sogar dabei seht ihr das okay wie gesagt ich glaube nicht mehr an den russischen dedos sondern dass dass irgendwas anderes da nicht stimmt guck mal hier 300 leute pingen an das juckt überhaupt nicht ob 300 leute an pingen 300 leute pingen ist vollkommen egal kann man kann man das rechenzentrum verschieben bei hetsner irgendwie geht nicht ja gut dann müssen wir warten bis er jetzt wieder bis er sich wieder gefangen hat er ich mein ich mein er pinkt ja zumindest schon mal ein bisschen wieder zwar nicht oft aber aber ab und zu ab und zu pinkt aber wie kann das sein dass es nach dem reboot immer noch probleme gibt es gibt doch überhaupt keinen sinn aber erst mal das ganze andere zeug zu rippe price jam sicher dass er dauernd war er ich habe ausgeschaltet wieder angemacht dass hier abteilen drin steht das hat nichts zu sagen da konnte einfach noch nicht weiter abfragen guck mal hier cpu wie das raufgegangen ist jetzt hat er keine datmen er konnte einfach nur nichts abfragen in der zwischenzeit sag mal hetsner datacenter es war übelst am abkacken aber das verstehe ich aber guck mal hat er sich eingekriegt ist er ist der russische dados vorbei jetzt hängt es wieder also das sind so merkwürdige sachen so so random so unerklärliche hänger die sollten eigentlich nicht aufdrehen deswegen war ja auch meine erste vermutung irgendeiner hat sich da sein russisches spotnetz am start oder was auch immer den pranz guck es euch mal an das ist doch definitiv nicht normal der server steht in nürnberg oder so nürnberg ja schön mittler da musst du nicht glaube der macht ja nix ich weiß ja auch nicht was der für schmerzen hat ehrlich gesagt so jetzt pushen wir erstmal den preisschamp push auf preisschamp und da will ich allerdings den beta branch pushen verkehrt kommt an die hett ist ja groß könnte das sein dass das irgendeine hetsner dedos protection ist dass das aus irgendwelchen gründen der 50.000 verbindungen zu macht und dann die hetsner dedos protection irgendwie meint oder stimmt was nicht weil ich glaube nicht wirklich dass ernsthaft irgendjemand nix hier im stream sitzt und da ding wie dedos oder das ergibt eigentlich wenig sinn wird mich nicht wohl ja man weiß es ist aber komisch es ist immer nur im stream so wir haben gepusht ja selbst hatte hier auch nicht viel network disk hat er hat er packages per second drin network traffic bei packets komm mal der hat der hat einfach mal 100.000 100.000 packages per second so will transmit als auch receive und ihr seht das ist den ganzen tag über 12 stunden den ganzen tag über ist nix das ist nur wenn man nur wenn man im stream on ist schon merkwürdig oder schon schon merkwürdig arbeitest du auch untertags dran ich glaube ich habe das noch nicht ausgeschaltet untertags aber ich mache den ich wie gesagt ich mache das hinter cloud flair sobald das jetzt läuft dann ok also check out beta dot net run so wenn ich jetzt alles richtig gemacht habe sollte der preisschamp demnächst mit an der preisschamp kann es kann wieder nicht erreichbar ok ist ja gut warum hast du bei cloud flair eine dsg voklage am hals cloud flair verwendet so gut wie jeder da ist er es hat jetzt über 15 minuten gedauert lull so poggers street merchant und jetzt start wie alt ich bin 36 so jeder preisschamp sieht schon mal ganz gut aus dass mit den mit den grafen sieht auch ok aus jetzt muss nur noch jetzt muss nur noch der tracker starten dann passt das alles voll alt ja ich sag es doch die leute klauen mit jetzt immer noch die sagen dass da max du bist du hörst dich so an wie 20 das ist ja nice aber bin ich nicht oder preisschamp hängt wieder wolltest du nicht den tracker im docker laufen lassen nee ich werde das front an dem docker laufen lassen und ich also ich habe es mir so überlegt ich werde mir den also hetzner pricing ich zeige euch mal was wir da machen cloud pricing also was ich mir überlegt habe weiße so ich hole mir so ein ding so ein ding fürs für für den crawler acht kerne reicht ist ok dann hole ich mir so ein ding hier oder so oder wahrscheinlich hole ich mir erstmal so ein ding fürs front end fertig da kommt dann cloud flair davor und gut ist da mache ich ein internes netzwerk dazwischen kann man ja bei hetzner machen dass quasi die beiden server inter noch mal im gleichen netz hängen und der publish dann neueste sachen zum preisschamp ist schon gestartet er crawlt und er crawlt ordentlich so erste sache ist grün jawohl ne xbox guck mal bei otto deutscher autolan hat ne xbox ja also wer schon leute ihr habt es im stream gesehen wer schon immer mal ne xbox series s haben will für dass das die keiner haben will ist die erstaun oh keck wait oh nee der preisschamp wird wieder die dorst ok dann gehen wir jetzt hier runter welche seiten checken die ab so gut wie alle deutschen seiten checkt ihr ab mein factory alternate otto art cyberport computer universe sonst was so man kann sich noch die not not notifications dann schicken lassen sagst du hier zack will ich informiert werden gut ist da muss jetzt natürlich erstmal sich wieder eine runde durchcrawlen wir gehen einfach in die magenta cloud leute wir gucken mal was es kostet nein es ist compute wie heißt es bei denen will kein speicher cloud server hier ok sollen sollen die grafen schon funktionieren nein die grafen funktionieren nicht steht ja auch dahinter in arbeit die grafen funktionieren noch nicht magenta cloud zu den tarifen also zeig mal was kostet sichern sie sich extra viel nein ich will ein will kein speicher ich will ich will surfer haben haben die haben die keine server zu mieten oder was ach das ist die open telekom cloud ok open telekom cloud alles klar da also compute ich will einfach nur stink normalen poplischen popliche vm gibts sowas hier nicht die haben sowas ok was kostet ein bare metal server erfolgreich hinzugefügt und jetzt open linux alle haben die die haben doch nicht mal nur bunto oder debian was redhead wer will so crap alter ich will einfach das ist mir zu dumm da checkt es checkt doch keiner also was ich vor hab ist folgendes ich hol mir so ein achtkerner machen internes netz dazwischen hier kommt das frontend drauf und der besucherzähler und hier kommt der crawler drauf ein gutes 2k im monat ja ich weiß nicht was los ist bei hetsner bezahlt ich für 16 kerne ok nicht dedicated aber dedicated cpu bezahlt für 16 kerne 160 ich weiß nicht was mit der telekom los ist wer sich diesen kram überhaupt geben will ja und den letzten letzten 15 minuten gucken wir mal das ist ja der hatte schon ein bisschen was zu tun der gute hier 100.000 package per second kann das sein dass da drüber aber 100.000 das klingt so glatt das klingt schon irgendwie nach das irgendwo was limitiert wird connections 250.000 connections 250.000 connections ok das ist doch der russische dedos am start das kann es das kann es anders da kann es nicht sein anders kann es das ergibt eigentlich keinen sinn cloudflare floor and fair ja hab ich schon preisschamp orc ist schon über über über things über cloudflare es ist halt dumm weil eigentlich wenn ich hier im stream was mache dann will ich das nicht über den server mit cloudflare machen weil sonst liegt ich im zweifelsfall noch die server ip dann muss die server ip erst ändern bei cloudflare die floating ip bei hetsner hetsner hat doch der hätte sagen sie haben dedos protection aber was auch immer interne connections oder externe das sieht man nicht allerdings so viel interne connections kann das ja net net haben das ding hatte keinerlei interne ip irgendwie und andere server cloudflare da vorn gut ist so aber leute der neue preisschamp ist am start was sagt ihr ja exzellente da fehlt was warum zeigt der oh nee ich ich ich hätte den russischen dedos nicht ansprechen sollen leute ich hätte nicht sagen sollen wo wo wo wo wo sind die einträge da unten wo sind die einträge für die jeweiligen sachen die er gefunden hat der zeigt gar nix an grad was ist das denn okay der reisen an falsches eiken echt welcher der reisen 5800 ne hat doch passt doch das stimmt ach nee das habe ich ausprobiert das habe ich ausprobiert aber wir können mal gucken ob wir das live updaten können solange soll ich drauf kommen lull weh solange ich drauf kommen ja guck der der der da brechen die verbindung weg ich jetzt kein bock mehr etze hat in der klaut natürlich haben in der klaut eine konsole das bringt mir nur nix also da kommt jetzt klautflare da vorn gut ist lustigerweise wenn ich den stream ausmache beruhigt sich auch immer was sehr verdächtig ist weiß aber nicht warum also was der zweck da jetzt von ist also ich meine es macht ja nix geht aber wieder irgendwie spackt die anzeige rum was kostet der spaß klaut für nix klautflare kostet da ist erstmal nix na gut leute das ist jetzt erstmal gepusht was willst du machen irgendwas ist noch falsch der reisen war aber welcher reisen war falsch das grafana auf lull jaja guck mal hier 5800 ist falsch ok excellent excellent naja das muss schon einer sein wenn es einer wirklich steht was sollte dann ist das irgendjemand im stream naja so also was machen wir jetzt noch klautflare mach ich einrichten kann ich nicht im stream machen wenn ich klautflare einrichten im stream mache dann sind die ips ja geleakt das ist ja nicht so sinnvoll aber ich mache das morgen danach im aufwachen stream wobei nee ich mache das jetzt glaube ich noch pw a draus zu machen ist easy ich mache das jetzt noch weil dann hat das dns zeit beziehungsweise die namensauflösung zeit sich auf klautflare umzustellen heute nacht das dauert ja immer ein paar stunden bis das bei allen so ist bis der cash überall weg ist also vielleicht stelle ich jetzt doch noch auf klautflare die kiste um ich meine ich muss die ip vorher ändern ip ist ja schon milliardenfach geleakt hier einfach neue ip dran hängen und dann klautflare anschalten da kann sich das heute nacht propagaten die dns geschichte so ich gucke jetzt mal subscribers weil ich glaube ich habe die hälfte wieder nicht gesehen starte noch mal kurz lokal bin ich bin ich bei github eingeloggt ah nee sonst hätten wir vielleicht mal github github actions machen können dafür also der emko hat gesagt ja ich habe es nicht gesehen ich habe das mit dem video nicht vergessen ich hatte den ganzen tag keine zeit ich habe noch nicht mal ins discord geguckt falls du geantwortet hast aber also wir machen das ja ich habe es nicht gesehen dass du gesagt hast danke für den zap huge chat iq wieder monopole hat abonniert dankeschön exzellenz nicki 9208 prime subscription ich weiß gar nicht ob ihr alle noch da seid ich hoffe mal jetzt wo ich vorlese dass auch ein paar im start sind es war nur der name frei dankeschön für den sap ob das habe ich schon gesehen die ganzen aussetzer hier also das hat schon sehr auffällig wenn ich hier auf einmal 100 7 267.000 connections hast und es ist limit mehr geht nicht unterschiedliche gpu hersteller aber das funktioniert nicht wirklich gut ich habe zwar die info aber der tracker enthält dafür zu wenig also der ist ja teilweise schon nicht sonderlich up to date wenn es darum geht bei den das dauert er teilweise eine ganze weile bis die neuen grafika hat ein paar neuen shops daneben klicken da geht sich mal auf ha ha es ist verbuckt keck weight warum das können wir noch fixen schnell ich weiß zwar nicht woran es liegt was wollte ich gerade sagen es hat mich jetzt abgelenkt ja genau der track der tracker braucht teilweise schon so lang bis das überhaupt gecheckt hat es geht wirklich nicht mit einem mit den einzelnen karten und die kommen da nicht hinterher mit hersteller und und verschiedene modellen und so das hat glaube ich keinen sinn das ist nie aktuell du musst zumachen durch hier oben so drauf dann geht es nicht mehr dass das fixen wir noch schnell aber lokal jetzt hier repos docker ps läuft das war das was nämlich laufen also woran könnte das denn liegen ich weiß woran es liegt ich weiß es ist easy ich weiß woran es liegt wenn ich hier auf fack wie mache ich das jetzt also wenn ich escape drücke sage ich klaus wenn ich darauf drücke sage ich klaus aber wie ketsche ich das hat außen hingeklickt event um klaus zu zu machen click outer ich habe keine ahnung click outside moment au outside click outside ernsthaft gibt es sowas aber es müsste es müsste ein ad ad click outside sein stack overflow triffen programming ich sage es euch beste fix easy so dann pushen wir das das noch mal so her da so ich bin wieder auf meinem server drauf keck weh den aus engage wie noch nicht gut da legen wir jetzt los wir können mal ein zweites git repo machen geht inne da können wir das nämlich hierauf pushen während das läuft also das ist auch ein ding wo ich mich mal hinsetzen muss das können wir auch am stream mal wir machen in github actions workflow auf obs levels auf an 1000 wir machen in github actions workflow was das alles macht oder noch cooler noch besser wie leute ich weiß was wir machen ich weiß was wir machen wir machen den docker feil für die asp.net anwendung und dann benutzen wir die neue github github container registry um das um das zu speichern und das checken wir uns dann aus im workflow irgendwie sowas das richtig big brain logik machen wir dann und was macht der dedos immer noch nicht enttäuschend enttäuschende so also dann pushen remote ad price champ 2 heißt es jetzt excellent push push price champ 2 in branch beta jawoll in branch price champ 2 geht check out wunderbar cp die datenbank kopieren wir mal rüber und ja ich habe forst noch beim letzten mal dran gemacht das ist immer witzig auf der arbeit sag ich immer leute macht forst nicht standardmäßig rein jetzt kontrollieren wir mal was so ich mache jetzt den price champ aus guck mal den price champ mal zu beim ausgehen ich verstehe halt echt nicht warum der hängt bei mir lokal geht er auch easy aus überhaupt kein problem ok ich kill den price champ wieder geht immer noch alles juckt juckt die nicht kein china dedos am start wie groß ist die db ach nicht so groß 6,4 gigabyte und das schreibt schon vier tage am stück kram darein jetzt bei euch was hier los leute es ist nicht gefixt ach so wisst ihr warum es nicht gefixt ist lull weh ich hab ich hab nicht gepusht ich hab mich ich hab mich committed ich hab mich committed aber gebildet hammer ok ok ok ok wisst ihr was der price champ der wird jetzt immer gekillt weil er irgendwie nicht will so wir hängen das jetzt einfach an ans letzte und gut ist push price champ ok und jetzt auf gehts ne ne dotnet run so jetzt sollte es jetzt sollte es gleich funktionieren ok das kam noch aus dem cash what the what the fuck what wait was musst du nicht aus g2 starten ich hab es ins erste gepusht ich hab es ins erste gepusht dialerates ok ok ok okafter was ist es doch auch Ich hab schon richtig gepusht. Ok, Preischamp machen wir nochmal aus. Killen. Ähhh. Ich hab's doch. Also prinzipiell geht das doch. Ich bin verwirrt. Alles gut. Doch alles committed. Mal ein Bild machen. Woran könnte es das liegen, dass das jetzt nicht mehr aufgeht? So Bild haben wir gemacht. Push. Preischamp. Achso ich weiß woran es gelegen hat. Lull. Ich bin im falschen Branch. Es wird Zeit für den ultimativen Big Brain Death Ops Workflow hier, ich sag's euch. Aha. Fixed Leute, fixed. Asp.net Core mit Vue, ja genau. Die coolen Leute, die würden das ja auch nicht auf zwei Hetsnetservern hausten, sondern die, also Leute, die die richtig im Trend sind, die würden, also erstens mal mindestens so wie ich das gemacht hätte, ein Backend Cloud Server, ein App Cloud Server, das ganze natürlich verdockerisiert und Netlify, Netlify für, für das Frontend. Also das wäre mal das Mindeste, was man als richtig, richtig hipper, Bro Kramer 2021 so macht. Ich habe mir jetzt übrigens bei Hetsna ein neues Projekt angelegt, das ich im Stream nichts mehr liege. Das habe ich extra genannt Alarm, mit so einem Alarm Emoji, der ja nicht öffnen. Netlify ist wirklich cool, ja. Was hat Max vor Feasy gelernt? Stonks Zeug habe ich gelernt, daher kommt ja meine Abneigung zur BWL Kram. So sieht ja normaler Traffic bei dem Ding aus, by the way. Leute, iChill ist am Start, iChill x4 Inno3D. So jetzt, jetzt lasse ich aber gut sein für heute, was die fixe Sachen angeht. Ihr dürft euch jetzt am aktuellen Preis Champ erfreuen. Du brauchst noch Easter Eggs, ich brauche erst mal alle Funktionen bevor ich Easter Eggs brauche. Wobei, wisst ihr was ein geiles Easter Egg wäre? Dass man irgendwo Dings abgespielt bekommt. Das wirst du vielleicht wieder einbauen. Guck mal Leute, wie es aktualisiert hier. Ach guck mal, jetzt kann man sich gar nicht anzeigen lassen, was der rote. Vielleicht soll ich dann wirklich eine Legende einblenden lassen. Okay, aber das fixen wir heute nicht mehr online. Jetzt machen wir nur mal lokal. Kann man da eine Legende einblenden lassen? Äh Fletcher, vier Monate, Dankeschön für den Sub. Wann postest du das auf Slashprogramm? Ich poste sowas prinzipiell nicht auf Reddit. Generell sind Foren wenig hilfreich, wenn es um sowas geht. Foren sind eher dafür da, Leute die neu anfangen zu verwirren. Weil sie denen immer erklären wollen, so nach dem Motto. In einem Forum fragt einer, wie mache ich eine Webseite mit zwei Bildern vom letzten Urlaub. Das ist die Frage im Forum. Oder auf Reddit. Und da kommt als Antwort, jetzt musst du erstmal Webpack lernen. Dann musst du dir noch irgendein Frontend Framework angucken. Nicht zu vergessen irgendwelche automatisierte Testing Suites. Dann musst du noch Flask und Python lernen fürs Backend. Und dann Svelte als Frontend noch dabei. Die verwirren die Leute so extrem. Ist echt der Wahnsinn. Oder wenn die dann anfangen. Was auch immer geil ist, wenn es eine.NET Geschichte ist. Die Leute fragen so nach dem Motto, wie filtre ich aus irgendeine Schulaufgabe. Wie filtre ich aus dem Array Elemente größer fünf raus. Was der Typ braucht ist, dass ihm einer sagt, an der Stelle nimmst du einen For Each. An der Stelle nimmst du einen Four. Das braucht er. Und die Leute schicken ihm dann so einen Link Query. Fünf Seiten lang ist Link Query und sagen, so gehts. Da kommt jetzt exakt raus, was du brauchst. Der Typ hat keinen Blasenschimmer, was der da eigentlich gerade liest. Und natürlich nicht zu vergessen, ohne Strukturam und UML Diagramm kannst du eh nix machen. Das haben wir ja in der Schule so gelernt. Ich hoffe ihr macht das auch alle so, wie man das immer lernt. Als erstes mal ein UML Diagramm und ein Strukturam machen. Macht ihr das auch so? Also wenn ihr das nicht so macht, dann zweifle ich an euren professionellen Developer Skills. Ein Papp, ein Papp auch noch davor. Ein Papp muss auch noch sein. Und ganz wichtig ein Ishikawa Diagramm. Wisst ihr was ein Ishikawa Diagramm ist? Ist auch ganz ganz wichtig. Das muss man auch vorher machen. Weg damit. Leute, fuck, jetzt hab ich voll verdrängt, was soll ich jetzt machen. Ich hab gesagt wir fixen das nicht mehr online, sondern... Ihr müsst mir heben, mein Boomer hier leckt. Legende vom Chart, genau. Hat der Preis-Champ schon ein paar Einträge? Warum hat der Preis-Champ noch keine Einträge? Oh. Nein, es läuft nicht. Nein, nein, ich bin nicht geplogged. Das ist die List. Das ist das Ding, was dieser Docker-Container abrufen will. Ich weiß, von GitHub-Dings. Warum geht das nicht? Da kann er nicht starten, wenn das nicht abrufbar ist. Das sackt. Ist doch abrufbar. Kegweight-Docker. So, Legende. Weil ich brauch erstmal was, wo was... Wobei ich kann es auch so mit der Legende machen. Also Chart, Legende, hier. Legend, Legend gleich True. Alles klar. Kann man das nicht unten machen? Das sieht da... Äh. Äh. Onker-S. Das sieht scheiße aus mit der Legende. Oder? Warum kann das nicht so eine Grafana-Legende machen? So ein großes Ding ist UVP. Ach, die Leute sind nicht dumm. Die erkennen, dass das UVP ist. Nur zwei Punkte und an der Seite einladen. Ja, das funktioniert leider nicht. Man kann nur die Punkte komplett ausmachen. Wenn ich nämlich sowas hier mache, der kann es nicht erweitern von einem Datenpunkt zunächst. Da hab ich plus von Sonntag bis Montag. Ach, Moment. Wenn man weiß, wo man drüber gehen muss, dann... Äh. Das findet doch niemand. Das findet doch legit keiner. Was passiert eigentlich, wenn ich mehr Einträge mache, als da steht? Hör mal auf. Was ist das hier? Warum macht er da nicht mehr Punkte? Leute, was ist ein gutes Chart-Framework für JavaScript? Das ist Chart.js. Ich hab mal Am-Charts verwendet vor einem Jahr oder so. Auf der Y-Achse stehen viel zu große Werte. Wieso? Stimmt doch. 2500 Euro, 0 Euro. Geh mal auf eine andere Karte. Ja, und das ist immer der gleiche Graph. Das ist immer der gleiche Graph. Falls du nicht gemerkt hast, der Graph ändert sich nicht. Ist immer der gleiche Graph. Deswegen steht ihr da auch in Arbeit dahinter. Aber die Legende ist kacke. Was hat man da für Optionen für Legende? Top, left, bottom. Okay, okay. Wie macht man das? Wow. Ach, wisst ihr was? Das passt schon. Kann man Point-Radius eins machen? Das passt schon. Komm mal, so lasst mal das. Da können die Leute draufklicken und erkennen, dass das UVP gut ist. Oder wir machen einfach Größe 60. Und dann ist es easy, dann findet man es überall. Kann man das hoch machen? Point-Radius 10. Bäm. Voll beschissen aus. 0W. Camping macht es gut. So, so lasse ich das jetzt. Reicht. So. Ähm. Hat sich der Preis-Cham selbst wieder eingependelt? Jawohl, geht alles. PC King hat was am Start. So, gucken wir mal auf den Preis-Cham drauf. Was gibt es hier Neues? Schönes. Komm mal hier, fast alles verfügbar. Seht ihr mal, Leute. Unsere Seite hat funktioniert. Das, wir haben doch, wir haben doch die, wir haben das doch geadded, die 6900. Das ist die, die wir vorhin geadded haben. Gibt es nur auf Alternate. Es, also man muss ja sagen, das Pop-Up sieht ein bisschen kacke aus, wenn da nur ein Shop drin steht. Vielleicht sollte man das noch in die Mitte machen, wenn da nur ein Shop drin ist. By the way, Docker, was ist das Problem hier gerade? Was ist eigentlich mit einem Dark Mode? Ah, Dark Mode ist eine coole Idee. Dark Mode ist auch easy umzusetzen. Das machen wir noch. Mir ist eh langweilig. Ich bin echt nicht richtig müde heute. Ähm. Jetzt crawlt er. Im Docker hat er vorher nicht gecrawlt. Jetzt habe ich aber wieder 100% CPU-Auslastung, Lokal Null. Nee, ich, ich, das, das Dark Mode machen wir noch schnell. Das geht nämlich wirklich sehr, sehr zackig. Ist nur die Frage, wo wir das hinmachen. Kann, kann man das nicht zentrieren? Kann man nicht? Moment, das, guck mal, wie's geht jetzt. Line-Shot nehmen wir noch mal. Äh, wenn nur eins da ist. Sprit. Ja. Aber wie, aber das war doch richtig. Jetzt muss ich die Kram nur noch zentrieren. Aber dann ist es nicht mehr, aber dann ist es nicht mehr so cool responsive, wenn ich das wegmache. Ach komm. Wir werden's überleben. Und so, so schlimm sieht's jetzt anders aus. Ist halt dann nur ein Ding. Hängt halt ein bisschen links in der Ecke, aber okay. Okay, also, Dark Seam ist total einfach zu konfigurieren. Muss ich mir aber trotzdem mal abgucken, weil falsch, der weiß, wie's funktioniert. Aber es ist einfach. Und danach gehen wir ins Bett. Ja, also da muss man die config. Ja. Seam Dark True. Und zack, ist Dark Seamed. Jetzt muss man nur noch einen Schalter einbauen. Und das sieht Dark auch gar nicht so übel aus. So, das guck ich mir jetzt einfach ab. Wo, wo hab ich hier meinen Seam Switcher drin? Home? Moment, hatte ich das da überhaupt, hatte ich überhaupt den Monarch Essen Seam Switcher? Ah nee, das ist standardmäßig Dark. Nee, ich mach, die Boomer, die wollen das nicht auf standardmäßig Dark. Ich glaub, man kann aber einfach setzen. Ich glaub, das war ziemlich easy. Man musste sagen, irgendwie, this Beautify Theme Dark gleich True oder so. Ah, easy, das war's. Genau, siehst du, aus dem Kopf. Oder auch nicht. Doch, aus dem Kopf. So, und jetzt brauchen wir nur noch einen Knopf. Wo machen, wo könnte man da einen guten Knopf hin machen für Dark Seamed? Ob rechts? Irgendwo hier so? Ob links, ob rechts? Ja, also, VBTN, Icon. So, MDE idea ist glaub ich die Lampe, ne? Ok, das kann, warum kann ich mir diese Material Design Icons nicht merken? Auf den Keks klicken. Das ist eine coole Idee. Auf den Keks klicken. Ey, das ist eine geile Idee. Man kann es ja zusätzlich machen. So, jetzt hätten wir noch einen Icon da oben mit Button. Aber wir machen auf den Keks klicken, das finde ich jetzt eine coole Idee. Aus Versehen auf den Keks geklickt, blind. Toggle Sieme. Das Sieme toggeln wir. So, wo sind wir hier? Dark Seamed, wo sind wir, wo sind wir? Da, ich hab's. Bin es schon wieder nicht mehr. Mounted, irgendwo in Mounted. Ah, ich kacke nur, hab's gelöscht. Wenn man da drauf kommt, der Keg W Sound, das ist auch eine gute Idee. Excellent Switch. Das ist die faulste Variante für einen Switch, der mir jetzt eingefallen ist. Okay. Ach, Moment, was mache ich da für einen Blödsinn? Klick. Ich toggle Sie. Lull. Zu spät. Zack. Wisst ihr, was jetzt noch cool wäre? Wenn wir den Keks mit einer Sonnenbrille hätten. Wir haben doch Woop Prime, der hat doch eine Sonnenbrille auf. Woop. Wir haben doch Woop Prime, der hat doch eine Sonnenbrille auf. Our Copy, Image, Adress, ah nee, den hab ich erst. Woop Prime würde mega gut passen, ja. Mein Problem ist nur, haben wir noch einen Mod am Start, der zufällig einen Link hat zu dem Emote in High Res. Ich habe das auf dem account nicht wo erziehst du die preise da von von allen möglichen shop seiten mordcheck mordcheck alles schon weg ja wo kriege ich meine eigenen emotes jetzt her gab sich twitch emotes search die seite online ja hier kannst du ausprobieren beta punkt preisschirm punkt org twitch emotes search ja dann haben wir prime aber drauf wenn es wenn es dark ist eigentlich richtig cool warte mal ich habe eine idee ich mal kurz ausblenden starte mal kurz admin admin fenster ich darf nicht darauf zugreifen na geil darf ich nicht mal als admin drauf zugreifen keck weh das denn users da habe ich doch ok wie kopiert man was in der winnaus cmd leute copy cp weiß ich wie das geht wie kopiert man der winnaus cmd alter ich kann nicht rechtstück machen das ist kommandos sein fenster nein ich meine datei kopieren datei kopieren cmd copy file gehen das x copy kann man nicht einfach eine datei kopieren unter winnaus einfach copy ok copy wub boom wub leak wub old wub pock wub prime wub prime will ich kopieren nach c doppelpunkt users stream so hat er das jetzt kopiert ok easy ich kann euch wieder einblenden was ein act so ein kram zu kopieren ok jetzt hat es twitch emote schon gefahren jetzt habe ich jetzt habe ich schon kopiert wub prime da ist es muss den kram nur noch kurz die vm in die vm kopieren kopieren wir den kram mal kurz rein wub prime zack und jetzt wub prime in assets alles klar da sind wir am start wub prime so also klick klick ist das so source müsste doch eigentlich auch so gehen source wenn das dark dann hoffe das funst weil ich da mache dann das und wenn ansonsten erstmal gucken ob es prinzipiell geht ah Mist ok ok das dynamisch machen geht sieht schonmal nett ich erwarte dass das geht wenn if else können wir machen ne ok das funktioniert nicht source dann ups jetzt habe ich komplett kaputt gemacht lull achso ok guck mal was der flow in oben geschrieben hat hat er denn geschrieben agile microservices hat er geschrieben so dann machen wir sowas jetzt hier if u if wenn das nicht dark ist dann das weil das ist ja das normale und das andere ist u else wub prime ich glaube das hat er nicht gecheckt sehr gut das ist ja cool oder erst pockt er erst pockt er und im dunklen hat er hat er easy money easy life das finde ich richtig nice das gefällt mir dark reader brauchen wir nicht wir haben net native dark dark theme das ist sogar halbwegs gut lesbar dark das dark theme braucht vielleicht noch ein paar optimierungen alles gut erkennbar ist da nicht aber hauptsache asus hat keck keck weight drinne hauptsache asus hat keck weight weil kein preis ja das das passt sich leider nicht an dark theme an in 45 min nur hast du gewürzter ja schau alles cool aber so lang bleib ich die katze war an der tür preis unter uvp ja wunsch denken der punkt ist viel zu klein und auch so fett man das noch so machen das diagramm sieht schon ein bisschen räudig schlecht aus oder weil es hier ein loch hat vorne und hinten warum warum hat das warum hat das hier so ein ding also leute jetzt ins bett gehen wir sehen uns dann guck mal hier wie das sieht cool aus wie er das aktualisiert ja leute soll ich noch soll ich noch schnell den preis champ mit neuen mit neuen bildern pushen mit dark theme kommen das machen wir jetzt noch schnell erkannte kann er da kann der dedos du sich noch mal dann auslassen lokal kann ich das doch auch quitten wo ist das problem ja es war ich gehe gleich gleich auf ich push jetzt noch das ding hier und dann ist gut das löst er da alles der wird schon der wird schon wissen was er macht erst mal schön anhängen so mit der killen check out was da ist ja nicht ganz so opti optimaler workflow check out beta release ist der preis champ wieder am start die musik eigentlich ist das relaxen kirby music oder so was stand da doch dran ane happy happy und epic nicht relaxen beim leute du musst mal refreshen du musst mal refreshen ohne ohne cash dann gehts bestimmt bei dir auch nice ok leute viel spaß mit dem preis champ heute nacht ich gehe jetzt auf gepen noch einmal für alle die schon länger dabei sind die übliche outro musik die habe ich die letzte zeit etwas vernachlässigt wir sehen uns leute bis denn see you", "segments": [{"id": 1, "start": 60.0, "end": 62.0, "text": "Das war's für heute."}, {"id": 2, "start": 62.0, "end": 64.0, "text": "Ich hoffe, dass es euch gefallen hat."}, {"id": 3, "start": 64.0, "end": 66.0, "text": "Wenn ihr mehr von uns sehen wollt,"}, {"id": 4, "start": 66.0, "end": 68.0, "text": "dann klickt auf den Link in der Beschreibung."}, {"id": 5, "start": 68.0, "end": 70.0, "text": "Dann sehen wir uns beim nächsten Mal wieder."}, {"id": 6, "start": 70.0, "end": 95.0, "text": "Das war's für heute. Bis zum nächsten Mal."}, {"id": 7, "start": 100.0, "end": 104.0, "text": "So Leute, bin ich am Start."}, {"id": 8, "start": 104.0, "end": 106.0, "text": "Ich muss noch mal schnell aufs Klo."}, {"id": 9, "start": 106.0, "end": 108.0, "text": "Und was zu trinken holen."}, {"id": 10, "start": 108.0, "end": 110.0, "text": "Ich habe jetzt zwei Stunden"}, {"id": 11, "start": 110.0, "end": 112.0, "text": "schon ein bisschen am Preis-Champ gebastelt."}, {"id": 12, "start": 112.0, "end": 114.0, "text": "Aber ich habe mir gedacht,"}, {"id": 13, "start": 114.0, "end": 116.0, "text": "ich mache jetzt einfach Stream an."}, {"id": 14, "start": 116.0, "end": 118.0, "text": "Ich hatte heute leider nicht so viel Zeit,"}, {"id": 15, "start": 118.0, "end": 120.0, "text": "etwas großartig zu machen."}, {"id": 16, "start": 120.0, "end": 122.0, "text": "Real-Life-Stells."}, {"id": 17, "start": 122.0, "end": 124.0, "text": "Megasack."}, {"id": 18, "start": 124.0, "end": 126.0, "text": "Dabei wollte ich mit dem M-Core"}, {"id": 19, "start": 126.0, "end": 128.0, "text": "noch etwas aufnehmen, irgendwann die Woche."}, {"id": 20, "start": 128.0, "end": 130.0, "text": "Das Wochenende."}, {"id": 21, "start": 130.0, "end": 132.0, "text": "Habe ich jetzt gar nicht in Discord geguckt heute."}, {"id": 22, "start": 134.0, "end": 136.0, "text": "Und dann wollte ich mich ein bisschen"}, {"id": 23, "start": 136.0, "end": 138.0, "text": "um Sellout-Stunks-Zeug kümmern."}, {"id": 24, "start": 138.0, "end": 140.0, "text": "Dass ich da ein bisschen"}, {"id": 25, "start": 140.0, "end": 142.0, "text": "Sellout-Money hinkriege wieder."}, {"id": 26, "start": 144.0, "end": 146.0, "text": "Wow, ein bisschen groß."}, {"id": 27, "start": 146.0, "end": 158.0, "text": "Kack-Wait."}, {"id": 28, "start": 158.0, "end": 160.0, "text": "Ja, ich habe den M-Core angeschrieben"}, {"id": 29, "start": 160.0, "end": 162.0, "text": "nach dem letzten Video,"}, {"id": 30, "start": 162.0, "end": 164.0, "text": "was er hochgeladen hat."}, {"id": 31, "start": 164.0, "end": 166.0, "text": "Ich kenne ja noch jemand."}, {"id": 32, "start": 166.0, "end": 168.0, "text": "Und habe gesagt,"}, {"id": 33, "start": 168.0, "end": 172.0, "text": "wie sieht es aus? Wollen wir etwas aufnehmen?"}, {"id": 34, "start": 172.0, "end": 174.0, "text": "Ich bin mir jetzt gar nicht sicher,"}, {"id": 35, "start": 174.0, "end": 176.0, "text": "was das da, glaube ich,"}, {"id": 36, "start": 176.0, "end": 178.0, "text": "hat er hochgeladen. Genau."}, {"id": 37, "start": 178.0, "end": 180.0, "text": "Da habe ich genau drauf geantwortet,"}, {"id": 38, "start": 180.0, "end": 182.0, "text": "hier wäre nice, wenn wir da etwas aufnehmen."}, {"id": 39, "start": 182.0, "end": 184.0, "text": "Und ich kann euch schon sagen, was wir für ein Thema machen."}, {"id": 40, "start": 184.0, "end": 186.0, "text": "Und zwar, ich mache mal die Musik ein bisschen leiser."}, {"id": 41, "start": 186.0, "end": 188.0, "text": "Ich kann euch schon sagen,"}, {"id": 42, "start": 188.0, "end": 190.0, "text": "was wir für ein Thema machen. Und zwar,"}, {"id": 43, "start": 190.0, "end": 192.0, "text": "es gibt so viele Videos,"}, {"id": 44, "start": 192.0, "end": 194.0, "text": "so, how to bekommen große,"}, {"id": 45, "start": 194.0, "end": 196.0, "text": "erfolgreiche YouTuber. Aber niemand"}, {"id": 46, "start": 196.0, "end": 198.0, "text": "macht ein Video."}, {"id": 47, "start": 198.0, "end": 200.0, "text": "Ich war mal erfolgreicher YouTuber"}, {"id": 48, "start": 200.0, "end": 202.0, "text": "und mache keinen YouTube mehr."}, {"id": 49, "start": 202.0, "end": 204.0, "text": "Wisst ihr, wie ich meine? So, es gibt total viele Videos,"}, {"id": 50, "start": 204.0, "end": 206.0, "text": "how to become YouTuber, aber nicht"}, {"id": 51, "start": 206.0, "end": 208.0, "text": "wie werde ich von YouTube wieder zu normal."}, {"id": 52, "start": 214.0, "end": 216.0, "text": "Und der M-Core war damals ja auch dick im Business."}, {"id": 53, "start": 216.0, "end": 218.0, "text": "Ich mache auch schon jahrelang kaum noch aktiv richtig was."}, {"id": 54, "start": 218.0, "end": 220.0, "text": "Könnten wir sich mal drüber auslassen."}, {"id": 55, "start": 222.0, "end": 224.0, "text": "Exzellent, exzellent."}, {"id": 56, "start": 224.0, "end": 226.0, "text": "How to be normie. Na gut, wir nicht."}, {"id": 57, "start": 226.0, "end": 228.0, "text": "Also ich schonmal, ich schonmal nicht."}, {"id": 58, "start": 228.0, "end": 230.0, "text": "Ich muss mal kurz hier"}, {"id": 59, "start": 230.0, "end": 232.0, "text": "bringen, die VM neu starten."}, {"id": 60, "start": 232.0, "end": 234.0, "text": "Ich glaube, da ist ein bisschen was"}, {"id": 61, "start": 234.0, "end": 236.0, "text": "im Argen gerade."}, {"id": 62, "start": 236.0, "end": 238.0, "text": "Die mag ich irgendwie nicht"}, {"id": 63, "start": 238.0, "end": 240.0, "text": "so richtig. Das sieht"}, {"id": 64, "start": 240.0, "end": 242.0, "text": "mittlerweile viel cooler aus. Ich habe vorhin was"}, {"id": 65, "start": 242.0, "end": 244.0, "text": "nice gebastelt."}, {"id": 66, "start": 244.0, "end": 246.0, "text": "Äh, warte mal, wo habe ich den"}, {"id": 67, "start": 246.0, "end": 248.0, "text": "Preischamp? Pull."}, {"id": 68, "start": 248.0, "end": 250.0, "text": "Oh, what the fuck."}, {"id": 69, "start": 254.0, "end": 256.0, "text": "Alter, ich kann"}, {"id": 70, "start": 256.0, "end": 258.0, "text": "immer tippen."}, {"id": 71, "start": 258.0, "end": 260.0, "text": "So."}, {"id": 72, "start": 260.0, "end": 262.0, "text": "Reset."}, {"id": 73, "start": 262.0, "end": 264.0, "text": "In your face. Origin."}, {"id": 74, "start": 264.0, "end": 266.0, "text": "Master. Bam."}, {"id": 75, "start": 266.0, "end": 268.0, "text": "So, letztes Comet. Timer."}, {"id": 76, "start": 268.0, "end": 270.0, "text": "Alles klar, passt. So, ich reboote mal schnell."}, {"id": 77, "start": 270.0, "end": 272.0, "text": "Also, nicht den"}, {"id": 78, "start": 272.0, "end": 274.0, "text": "Stream."}, {"id": 79, "start": 274.0, "end": 276.0, "text": "Master."}, {"id": 80, "start": 276.0, "end": 278.0, "text": "Ja, mittlerweile."}, {"id": 81, "start": 278.0, "end": 280.0, "text": "Ey."}, {"id": 82, "start": 280.0, "end": 282.0, "text": "Das wird sich irgendwie so viel"}, {"id": 83, "start": 282.0, "end": 284.0, "text": "unsinnige Sachen aus."}, {"id": 84, "start": 284.0, "end": 286.0, "text": "Ja, was?"}, {"id": 85, "start": 286.0, "end": 288.0, "text": "Was ist damit?"}, {"id": 86, "start": 288.0, "end": 290.0, "text": "Ach, hat jemand gefragt,"}, {"id": 87, "start": 290.0, "end": 292.0, "text": "wo es die Seite gibt, oder was?"}, {"id": 88, "start": 292.0, "end": 294.0, "text": "Genau, die gibt es da."}, {"id": 89, "start": 294.0, "end": 296.0, "text": "Excellent."}, {"id": 90, "start": 298.0, "end": 300.0, "text": "Das coole ist,"}, {"id": 91, "start": 300.0, "end": 302.0, "text": "ich habe auf meinem zweiten PC ein YouTube Video"}, {"id": 92, "start": 302.0, "end": 304.0, "text": "Vorschau Ding."}, {"id": 93, "start": 304.0, "end": 306.0, "text": "Und da"}, {"id": 94, "start": 306.0, "end": 308.0, "text": "sehe ich genau, dass es irgendwelche random"}, {"id": 95, "start": 308.0, "end": 310.0, "text": "Schwachsinnensvideos sind, die gepostet werden, da muss ich gerade draufklicken."}, {"id": 96, "start": 310.0, "end": 312.0, "text": "He doesn't"}, {"id": 97, "start": 312.0, "end": 314.0, "text": "know he lacks critical information."}, {"id": 98, "start": 316.0, "end": 318.0, "text": "Ah, ah, ah."}, {"id": 99, "start": 318.0, "end": 320.0, "text": "Record, haben wir doch? Gibt es doch?"}, {"id": 100, "start": 320.0, "end": 322.0, "text": "Es gibt doch Ah, ah, ah"}, {"id": 101, "start": 322.0, "end": 324.0, "text": "Record für Preischamp."}, {"id": 102, "start": 330.0, "end": 332.0, "text": "Äh, Kampf Kevin."}, {"id": 103, "start": 334.0, "end": 336.0, "text": "Kannst du beim"}, {"id": 104, "start": 336.0, "end": 338.0, "text": "Preischamp vielleicht noch"}, {"id": 105, "start": 338.0, "end": 340.0, "text": "Filter entzogen das"}, {"id": 106, "start": 340.0, "end": 342.0, "text": "auch auf Lager?"}, {"id": 107, "start": 342.0, "end": 344.0, "text": "Ich weiß nicht, ob der"}, {"id": 108, "start": 344.0, "end": 346.0, "text": "Crawler das kann."}, {"id": 109, "start": 348.0, "end": 350.0, "text": "Was soll das denn heißen?"}, {"id": 110, "start": 350.0, "end": 352.0, "text": "Auf Lager, ausschließlich Versand."}, {"id": 111, "start": 352.0, "end": 354.0, "text": "Was soll das jetzt genau bedeuten?"}, {"id": 112, "start": 354.0, "end": 356.0, "text": "Du meinst Sachen, die"}, {"id": 113, "start": 356.0, "end": 358.0, "text": "auch wirklich innerhalb der nächsten"}, {"id": 114, "start": 358.0, "end": 360.0, "text": "ein, zwei Tage verschickt werden können, oder was?"}, {"id": 115, "start": 360.0, "end": 362.0, "text": "Es war nur der Name frei zwei"}, {"id": 116, "start": 362.0, "end": 364.0, "text": "acht Monate. Dankeschön für den Sub."}, {"id": 117, "start": 364.0, "end": 366.0, "text": "Massive IQ increase für den Chat,"}, {"id": 118, "start": 366.0, "end": 368.0, "text": "wieder."}, {"id": 119, "start": 374.0, "end": 376.0, "text": "Die findet er aber doch auch so."}, {"id": 120, "start": 376.0, "end": 378.0, "text": "Die findet er doch auch so."}, {"id": 121, "start": 378.0, "end": 380.0, "text": "Hier, RTX war"}, {"id": 122, "start": 380.0, "end": 382.0, "text": "vorhin am Start, habe ich genau gesehen,"}, {"id": 123, "start": 382.0, "end": 384.0, "text": "während ich entwickelt habe. Guck hier,"}, {"id": 124, "start": 384.0, "end": 386.0, "text": "bei Alternate ist er auch am Start."}, {"id": 125, "start": 386.0, "end": 388.0, "text": "Die findet er schon. Nee, aber ich glaube,"}, {"id": 126, "start": 388.0, "end": 390.0, "text": "da habe ich keinen. Hier, passt doch."}, {"id": 127, "start": 390.0, "end": 392.0, "text": "Auf Lager, ausschließlich Versand."}, {"id": 128, "start": 392.0, "end": 394.0, "text": "Ja gut, wenn die, wenn die"}, {"id": 129, "start": 394.0, "end": 396.0, "text": "30, wenn"}, {"id": 130, "start": 396.0, "end": 398.0, "text": "wenn die"}, {"id": 131, "start": 398.0, "end": 400.0, "text": "Das kann sein, dass das"}, {"id": 132, "start": 400.0, "end": 402.0, "text": "noch nicht aktualisiert ist."}, {"id": 133, "start": 402.0, "end": 404.0, "text": "Nee."}, {"id": 134, "start": 410.0, "end": 412.0, "text": "Ach hier, guck mal."}, {"id": 135, "start": 414.0, "end": 416.0, "text": "Das kann sein, dass er die Produktseite nicht drin hat."}, {"id": 136, "start": 416.0, "end": 418.0, "text": "Warum ist das denn so teuer?"}, {"id": 137, "start": 418.0, "end": 434.0, "text": "Ist das so gedacht?"}, {"id": 138, "start": 434.0, "end": 436.0, "text": "Ja, also, die"}, {"id": 139, "start": 436.0, "end": 438.0, "text": "müssen, die müssen da finden, wenn die Produktseite drin ist."}, {"id": 140, "start": 438.0, "end": 440.0, "text": "Das ist halt so ein"}, {"id": 141, "start": 440.0, "end": 442.0, "text": "Ding, wenn die Produktseite, ich kann mal"}, {"id": 142, "start": 442.0, "end": 444.0, "text": "gucken, ob die Produktseite drin ist. Kann man nachschauen."}, {"id": 143, "start": 444.0, "end": 446.0, "text": "Wartet mal. Schauen wir mal."}, {"id": 144, "start": 446.0, "end": 448.0, "text": "Hier."}, {"id": 145, "start": 448.0, "end": 450.0, "text": "Terminal aufmachen. Ich habe jetzt"}, {"id": 146, "start": 450.0, "end": 452.0, "text": "Rebooted. So, gehen wir mal."}, {"id": 147, "start": 452.0, "end": 454.0, "text": "Wo habe ich das? Repos."}, {"id": 148, "start": 454.0, "end": 456.0, "text": "Street."}, {"id": 149, "start": 456.0, "end": 458.0, "text": "So."}, {"id": 150, "start": 458.0, "end": 460.0, "text": "Source."}, {"id": 151, "start": 460.0, "end": 462.0, "text": "Shops. Oh nee, wo haben sie das?"}, {"id": 152, "start": 462.0, "end": 464.0, "text": "Stores. Wo haben sie das versteckt?"}, {"id": 153, "start": 464.0, "end": 466.0, "text": "Model und dann"}, {"id": 154, "start": 466.0, "end": 468.0, "text": "Alternate."}, {"id": 155, "start": 470.0, "end": 472.0, "text": "60,"}, {"id": 156, "start": 472.0, "end": 474.0, "text": "90."}, {"id": 157, "start": 474.0, "end": 476.0, "text": "60, 90."}, {"id": 158, "start": 476.0, "end": 478.0, "text": "Ach, die steht gerade, die steht hier noch gar nicht drin."}, {"id": 159, "start": 478.0, "end": 480.0, "text": "Das ist ganz neu."}, {"id": 160, "start": 480.0, "end": 482.0, "text": "Haben sie noch gar nicht drin."}, {"id": 161, "start": 482.0, "end": 484.0, "text": "Aber 60, 80. Nee, warte."}, {"id": 162, "start": 484.0, "end": 486.0, "text": "Wie?"}, {"id": 163, "start": 486.0, "end": 488.0, "text": "Ach,"}, {"id": 164, "start": 488.0, "end": 490.0, "text": "es ist 6.800."}, {"id": 165, "start": 490.0, "end": 492.0, "text": "Doch, ist drin."}, {"id": 166, "start": 492.0, "end": 494.0, "text": "So, gucken wir mal, ob"}, {"id": 167, "start": 494.0, "end": 496.0, "text": "eins von denen das ist, was du gezeigt"}, {"id": 168, "start": 496.0, "end": 498.0, "text": "hast."}, {"id": 169, "start": 498.0, "end": 500.0, "text": "Ja, die links stimmen einfach nicht mehr."}, {"id": 170, "start": 500.0, "end": 502.0, "text": "Keck, Keck, Hyperweight."}, {"id": 171, "start": 502.0, "end": 504.0, "text": "Die links stimmen nicht."}, {"id": 172, "start": 504.0, "end": 506.0, "text": "So."}, {"id": 173, "start": 506.0, "end": 508.0, "text": "Welchen Link hast du gerade geschickt?"}, {"id": 174, "start": 508.0, "end": 510.0, "text": "Den da."}, {"id": 175, "start": 510.0, "end": 512.0, "text": "Ja."}, {"id": 176, "start": 512.0, "end": 514.0, "text": "Siehst du? Das steht da einfach"}, {"id": 177, "start": 514.0, "end": 516.0, "text": "nicht drin."}, {"id": 178, "start": 518.0, "end": 520.0, "text": "Tja, kein Wunder, dass es das nicht"}, {"id": 179, "start": 520.0, "end": 522.0, "text": "krault."}, {"id": 180, "start": 522.0, "end": 524.0, "text": "Wenn es da nicht drin steht."}, {"id": 181, "start": 524.0, "end": 526.0, "text": "Wir pullen mal"}, {"id": 182, "start": 526.0, "end": 528.0, "text": "hier aktuell. Der macht natürlich"}, {"id": 183, "start": 528.0, "end": 530.0, "text": "mehr. Das ist auch schon wieder so eine Sache, warum man diese"}, {"id": 184, "start": 530.0, "end": 532.0, "text": "Main-Master-Geschichte"}, {"id": 185, "start": 532.0, "end": 534.0, "text": "auf den Keks geht."}, {"id": 186, "start": 534.0, "end": 536.0, "text": "Man kann einfach keinen History-Eintrag"}, {"id": 187, "start": 536.0, "end": 538.0, "text": "mehr verwenden. Man muss dann"}, {"id": 188, "start": 538.0, "end": 540.0, "text": "umwursten das Ganze."}, {"id": 189, "start": 540.0, "end": 542.0, "text": "Das nervt."}, {"id": 190, "start": 548.0, "end": 550.0, "text": "Und der hat Alternate, hat er nichts"}, {"id": 191, "start": 550.0, "end": 552.0, "text": "gemacht. Also das ist immer noch nicht drinne."}, {"id": 192, "start": 556.0, "end": 558.0, "text": "Ich meine, wir können das"}, {"id": 193, "start": 558.0, "end": 560.0, "text": "auch von Hand dazuschreiben, aber"}, {"id": 194, "start": 560.0, "end": 562.0, "text": "ehrlich gesagt"}, {"id": 195, "start": 562.0, "end": 564.0, "text": "ja scheiß drauf, wir schreiben das von Hand"}, {"id": 196, "start": 564.0, "end": 566.0, "text": "dazu."}, {"id": 197, "start": 566.0, "end": 568.0, "text": "Ich weiß nicht."}, {"id": 198, "start": 572.0, "end": 574.0, "text": "Mal gucken, ob das russische Botnetz wieder am Start"}, {"id": 199, "start": 574.0, "end": 576.0, "text": "ist heute. Nicht Pokchamp,"}, {"id": 200, "start": 576.0, "end": 578.0, "text": "nicht Pokchamp."}, {"id": 201, "start": 578.0, "end": 580.0, "text": "Preischamp."}, {"id": 202, "start": 582.0, "end": 584.0, "text": "Mal gucken, ob das russische"}, {"id": 203, "start": 584.0, "end": 588.0, "text": "Botnetz heute wieder zuguckt."}, {"id": 204, "start": 594.0, "end": 596.0, "text": "Nee, pingen kann ich ja nicht. Da lieg ich ja"}, {"id": 205, "start": 596.0, "end": 598.0, "text": "wieder IPs."}, {"id": 206, "start": 600.0, "end": 602.0, "text": "Wir tragen das mal ein und gucken, ob es dann"}, {"id": 207, "start": 602.0, "end": 604.0, "text": "funktioniert. Also"}, {"id": 208, "start": 604.0, "end": 606.0, "text": "Source"}, {"id": 209, "start": 606.0, "end": 608.0, "text": "Store"}, {"id": 210, "start": 608.0, "end": 610.0, "text": "Model"}, {"id": 211, "start": 610.0, "end": 612.0, "text": "Jetzt Alternate"}, {"id": 212, "start": 612.0, "end": 614.0, "text": "und jetzt"}, {"id": 213, "start": 614.0, "end": 616.0, "text": "6900 XT"}, {"id": 214, "start": 616.0, "end": 618.0, "text": "Ich hab da noch nie was von Hand"}, {"id": 215, "start": 618.0, "end": 620.0, "text": "eingetragen. Mal gucken, wie das funktioniert."}, {"id": 216, "start": 620.0, "end": 622.0, "text": "Also"}, {"id": 217, "start": 622.0, "end": 624.0, "text": "nehmen wir mal so ein Ding"}, {"id": 218, "start": 624.0, "end": 626.0, "text": "Copypasten das"}, {"id": 219, "start": 626.0, "end": 628.0, "text": "So und das ist jetzt Brand"}, {"id": 220, "start": 628.0, "end": 630.0, "text": "Asus"}, {"id": 221, "start": 630.0, "end": 632.0, "text": "AMD Reference. Ehrlich gesagt"}, {"id": 222, "start": 632.0, "end": 634.0, "text": "kein Plastenschimmer, da steht überall"}, {"id": 223, "start": 634.0, "end": 636.0, "text": "AMD"}, {"id": 224, "start": 636.0, "end": 638.0, "text": "Ich schreib da einfach AMD Reference, ist doch egal."}, {"id": 225, "start": 638.0, "end": 640.0, "text": "So und jetzt ist Produktseite"}, {"id": 226, "start": 640.0, "end": 642.0, "text": "Produktseite, die du"}, {"id": 227, "start": 642.0, "end": 644.0, "text": "geschickt hast. Moment, wo ist die"}, {"id": 228, "start": 644.0, "end": 646.0, "text": "Produktseite, die du geschickt hast? Ist das blöd?"}, {"id": 229, "start": 646.0, "end": 648.0, "text": "Ich steh irgendwo weg."}, {"id": 230, "start": 648.0, "end": 650.0, "text": "Check, check, wait."}, {"id": 231, "start": 650.0, "end": 652.0, "text": "Wo hab ich die hin? Ach nee, da."}, {"id": 232, "start": 652.0, "end": 654.0, "text": "Hier. Blablabla"}, {"id": 233, "start": 654.0, "end": 656.0, "text": "Product"}, {"id": 234, "start": 656.0, "end": 658.0, "text": "Ok, wie"}, {"id": 235, "start": 658.0, "end": 660.0, "text": "baustelle"}, {"id": 236, "start": 660.0, "end": 662.0, "text": "Einfach so?"}, {"id": 237, "start": 662.0, "end": 664.0, "text": "Ah ja, nice. Ok."}, {"id": 238, "start": 664.0, "end": 666.0, "text": "Massive Wim trick"}, {"id": 239, "start": 666.0, "end": 668.0, "text": "Ich weiß nicht, ob ihr das schon kennt. Wenn"}, {"id": 240, "start": 668.0, "end": 670.0, "text": "ihr in Anführungszeichen seid"}, {"id": 241, "start": 674.0, "end": 676.0, "text": "Dann drückt ihr einfach C, I"}, {"id": 242, "start": 676.0, "end": 678.0, "text": "und Anführungsstriche"}, {"id": 243, "start": 678.0, "end": 680.0, "text": "und schon löscht alles. Bam. So, mal gucken"}, {"id": 244, "start": 680.0, "end": 682.0, "text": "ob der das jetzt richtig crawlt."}, {"id": 245, "start": 682.0, "end": 684.0, "text": "Das ist nicht AMD. Ich nehm"}, {"id": 246, "start": 684.0, "end": 686.0, "text": "dieses Model eh für nix, also ist es auch wurscht."}, {"id": 247, "start": 686.0, "end": 688.0, "text": "Start"}, {"id": 248, "start": 690.0, "end": 692.0, "text": "Start"}, {"id": 249, "start": 692.0, "end": 694.0, "text": "So, der sollte das jetzt checken. Der sollte"}, {"id": 250, "start": 694.0, "end": 696.0, "text": "jetzt, der Preischamp sollte"}, {"id": 251, "start": 696.0, "end": 698.0, "text": "jetzt gleich"}, {"id": 252, "start": 698.0, "end": 700.0, "text": "wenn er gestartet ist, das dauert ne Minute"}, {"id": 253, "start": 700.0, "end": 702.0, "text": "oder so, sollte der jetzt anzeigen"}, {"id": 254, "start": 702.0, "end": 704.0, "text": "AMD ist am Start."}, {"id": 255, "start": 706.0, "end": 708.0, "text": "Wann kann man wieder erwarten, dass der Staff"}, {"id": 256, "start": 708.0, "end": 710.0, "text": "zu normalen Preisen am Start ist?"}, {"id": 257, "start": 710.0, "end": 712.0, "text": "Irgendwann im Sommer?"}, {"id": 258, "start": 712.0, "end": 714.0, "text": "So Leute, ich zeig euch jetzt mal den neuen"}, {"id": 259, "start": 714.0, "end": 716.0, "text": "Preischamp. Ich hab ein bisschen was geupdatet"}, {"id": 260, "start": 716.0, "end": 718.0, "text": "und wir machen heute ein bisschen Fine Tuning"}, {"id": 261, "start": 718.0, "end": 720.0, "text": "dass ich mal wieder was neues pushen kann."}, {"id": 262, "start": 720.0, "end": 722.0, "text": "Weil wir wissen ja, die Leute stehen drauf, wenn es"}, {"id": 263, "start": 722.0, "end": 726.0, "text": "neue Änderungen gibt, die sie sich angucken können."}, {"id": 264, "start": 730.0, "end": 732.0, "text": "Den machen wir mal zu."}, {"id": 265, "start": 732.0, "end": 734.0, "text": "Depots, Preischamp"}, {"id": 266, "start": 736.0, "end": 738.0, "text": ".net"}, {"id": 267, "start": 738.0, "end": 740.0, "text": "und"}, {"id": 268, "start": 740.0, "end": 742.0, "text": "achso"}, {"id": 269, "start": 744.0, "end": 746.0, "text": "Wir müssen vorher noch was anderes machen."}, {"id": 270, "start": 746.0, "end": 748.0, "text": "Weil"}, {"id": 271, "start": 748.0, "end": 752.0, "text": "ich hab ja das Problem"}, {"id": 272, "start": 752.0, "end": 754.0, "text": "Ich hab ja das Problem, dass"}, {"id": 273, "start": 754.0, "end": 756.0, "text": "ach Moment, ich muss"}, {"id": 274, "start": 756.0, "end": 758.0, "text": "Alter"}, {"id": 275, "start": 758.0, "end": 760.0, "text": "JavaScript, lass dich doch einfach"}, {"id": 276, "start": 764.0, "end": 766.0, "text": "Das ist hartnäckig"}, {"id": 277, "start": 766.0, "end": 768.0, "text": "Ich wollte es eigentlich einfach nur abbrechen"}, {"id": 278, "start": 768.0, "end": 770.0, "text": "ja"}, {"id": 279, "start": 770.0, "end": 772.0, "text": "So"}, {"id": 280, "start": 772.0, "end": 774.0, "text": "Wir müssen erstmal"}, {"id": 281, "start": 774.0, "end": 776.0, "text": "ein Install machen, weil ich"}, {"id": 282, "start": 776.0, "end": 778.0, "text": "hab ne"}, {"id": 283, "start": 778.0, "end": 780.0, "text": "Craft Chart Library vorhin"}, {"id": 284, "start": 780.0, "end": 782.0, "text": "installiert. Die ist ja hier sicherlich noch gar nicht drauf"}, {"id": 285, "start": 782.0, "end": 784.0, "text": "Okay"}, {"id": 286, "start": 784.0, "end": 786.0, "text": "So jetzt aber"}, {"id": 287, "start": 786.0, "end": 788.0, "text": "Und wir müssen vorhin nämlich noch was anderes machen"}, {"id": 288, "start": 788.0, "end": 790.0, "text": "Weil guckt mal, wir müssen das"}, {"id": 289, "start": 790.0, "end": 792.0, "text": "verdockerisieren"}, {"id": 290, "start": 792.0, "end": 794.0, "text": "Weil"}, {"id": 291, "start": 794.0, "end": 796.0, "text": "wenn ich das hier starte"}, {"id": 292, "start": 796.0, "end": 798.0, "text": "dann braucht das"}, {"id": 293, "start": 798.0, "end": 800.0, "text": "Start"}, {"id": 294, "start": 800.0, "end": 802.0, "text": "dann braucht das meine"}, {"id": 295, "start": 802.0, "end": 804.0, "text": "komplette CPU-Leistung von der Kiste"}, {"id": 296, "start": 804.0, "end": 806.0, "text": "Deswegen müssen wir das"}, {"id": 297, "start": 806.0, "end": 808.0, "text": "verdockerisieren"}, {"id": 298, "start": 808.0, "end": 810.0, "text": "und dann docker starten mit"}, {"id": 299, "start": 810.0, "end": 812.0, "text": "CPU-Limit, viel einfacher"}, {"id": 300, "start": 812.0, "end": 814.0, "text": "Ja richtig"}, {"id": 301, "start": 814.0, "end": 816.0, "text": "Monarch-S"}, {"id": 302, "start": 816.0, "end": 818.0, "text": "Das sollte aber relativ einfach sein, weil"}, {"id": 303, "start": 818.0, "end": 820.0, "text": "der Typ hat ein Docker-File am Start"}, {"id": 304, "start": 820.0, "end": 822.0, "text": "Das heißt theoretisch"}, {"id": 305, "start": 822.0, "end": 824.0, "text": "können wir einfach sagen docker-build."}, {"id": 306, "start": 824.0, "end": 826.0, "text": "und dann funktioniert's"}, {"id": 307, "start": 828.0, "end": 830.0, "text": "Mal gucken"}, {"id": 308, "start": 830.0, "end": 834.0, "text": "ob das so ist, wie ich mir das denke"}, {"id": 309, "start": 836.0, "end": 838.0, "text": "Und dann können wir starten im Docker"}, {"id": 310, "start": 838.0, "end": 840.0, "text": "mit verschiedenen"}, {"id": 311, "start": 840.0, "end": 842.0, "text": "Parameter für"}, {"id": 312, "start": 844.0, "end": 846.0, "text": "CPU-Beschränkungen"}, {"id": 313, "start": 848.0, "end": 850.0, "text": "Verdockerisieren sollte im Tuden stehen"}, {"id": 314, "start": 850.0, "end": 852.0, "text": "Mittlerweile wird alles verdockerisiert"}, {"id": 315, "start": 852.0, "end": 854.0, "text": "Ich warte noch drauf bis die Leute mal"}, {"id": 316, "start": 854.0, "end": 856.0, "text": "LS-SSService verwenden"}, {"id": 317, "start": 856.0, "end": 858.0, "text": "Oder"}, {"id": 318, "start": 858.0, "end": 860.0, "text": "Top-SSS, wobei das gibt's schon"}, {"id": 319, "start": 860.0, "end": 862.0, "text": "Bring soll ich euch nochmal was richtig"}, {"id": 320, "start": 862.0, "end": 864.0, "text": "nicees zeigen"}, {"id": 321, "start": 868.0, "end": 870.0, "text": "Grafana"}, {"id": 322, "start": 870.0, "end": 872.0, "text": "Passt mal auf"}, {"id": 323, "start": 872.0, "end": 874.0, "text": "Nodex-Porter"}, {"id": 324, "start": 876.0, "end": 878.0, "text": "Extern"}, {"id": 325, "start": 878.0, "end": 880.0, "text": "Ich hab mein"}, {"id": 326, "start": 880.0, "end": 882.0, "text": "Beta-Preis-Champ"}, {"id": 327, "start": 882.0, "end": 884.0, "text": "im"}, {"id": 328, "start": 884.0, "end": 886.0, "text": "Grafana-Monitoring jetzt drin"}, {"id": 329, "start": 886.0, "end": 888.0, "text": "Bäm"}, {"id": 330, "start": 888.0, "end": 890.0, "text": "Und jetzt seh ich auch gleich, was hier abgeht mit"}, {"id": 331, "start": 890.0, "end": 892.0, "text": "Traffic"}, {"id": 332, "start": 892.0, "end": 894.0, "text": "Allerdings wie gesagt, der Server wird eh nicht lang aktiv"}, {"id": 333, "start": 894.0, "end": 896.0, "text": "noch bleiben, sobald das irgendwie funktioniert"}, {"id": 334, "start": 898.0, "end": 900.0, "text": "Zieh ich das um auf Preis-Champ.org"}, {"id": 335, "start": 900.0, "end": 902.0, "text": "Und das kommt hinter Cloudflare"}, {"id": 336, "start": 906.0, "end": 908.0, "text": "Ist das nicht Pog?"}, {"id": 337, "start": 908.0, "end": 910.0, "text": "Oh"}, {"id": 338, "start": 914.0, "end": 916.0, "text": "Leute, was ist das?"}, {"id": 339, "start": 916.0, "end": 918.0, "text": "Das ist Statistik von meinem Server"}, {"id": 340, "start": 918.0, "end": 920.0, "text": "bei Hetzner"}, {"id": 341, "start": 922.0, "end": 924.0, "text": "50% CPU-Last"}, {"id": 342, "start": 924.0, "end": 926.0, "text": "16 CPU-Cores, 2,4 Tage ab"}, {"id": 343, "start": 926.0, "end": 928.0, "text": "32G RAM"}, {"id": 344, "start": 932.0, "end": 934.0, "text": "RAM-Verbrauch ist nicht so hoch"}, {"id": 345, "start": 934.0, "end": 936.0, "text": "Ist aber ganz gut"}, {"id": 346, "start": 936.0, "end": 938.0, "text": "ausgelastet, die Kiste"}, {"id": 347, "start": 940.0, "end": 942.0, "text": "Was ist"}, {"id": 348, "start": 942.0, "end": 944.0, "text": "hinter Preis-Champ.org?"}, {"id": 349, "start": 946.0, "end": 948.0, "text": "Da ist Kappe"}, {"id": 350, "start": 948.0, "end": 950.0, "text": "1,2,3"}, {"id": 351, "start": 952.0, "end": 954.0, "text": "Soll ich online? Ja, das dauert"}, {"id": 352, "start": 956.0, "end": 958.0, "text": "Das dauert, bis der das erkennt"}, {"id": 353, "start": 960.0, "end": 962.0, "text": "Das dauert, der muss ja erstmal alles"}, {"id": 354, "start": 962.0, "end": 964.0, "text": "durchcrawlen und dann irgendwann mal"}, {"id": 355, "start": 964.0, "end": 966.0, "text": "da ankommen, das dauert"}, {"id": 356, "start": 968.0, "end": 970.0, "text": "Sobald ich ihn jetzt neu gestartet hab"}, {"id": 357, "start": 970.0, "end": 972.0, "text": "Sonsten gehts schneller"}, {"id": 358, "start": 976.0, "end": 978.0, "text": "Was kostet ich die Kiste? 50€ im Monat"}, {"id": 359, "start": 978.0, "end": 980.0, "text": "Die fette"}, {"id": 360, "start": 980.0, "end": 982.0, "text": "Aber ich werd das auch anders machen"}, {"id": 361, "start": 982.0, "end": 984.0, "text": "Ich hab ja jetzt zum Test mal so eine 16-Core-Kiste"}, {"id": 362, "start": 984.0, "end": 986.0, "text": "Ich werd das anders machen"}, {"id": 363, "start": 986.0, "end": 988.0, "text": "Ich mach einen 8-Kerner zum Crawlen"}, {"id": 364, "start": 988.0, "end": 990.0, "text": "und einen Dual- oder"}, {"id": 365, "start": 990.0, "end": 992.0, "text": "Triple-Core fürs Frontend"}, {"id": 366, "start": 992.0, "end": 994.0, "text": "Das Frontend kommt mit einem Core"}, {"id": 367, "start": 994.0, "end": 996.0, "text": "aus, wenn man ehrlich ist"}, {"id": 368, "start": 998.0, "end": 1000.0, "text": "Du musst das horizontal skalierbar machen"}, {"id": 369, "start": 1000.0, "end": 1002.0, "text": "Das geht sogar"}, {"id": 370, "start": 1002.0, "end": 1004.0, "text": "Der Patrick bringt"}, {"id": 371, "start": 1004.0, "end": 1006.0, "text": "mich auf eine Idee"}, {"id": 372, "start": 1006.0, "end": 1008.0, "text": "Man kann das sogar relativ easy"}, {"id": 373, "start": 1008.0, "end": 1010.0, "text": "mit Entspannungsmusik machen"}, {"id": 374, "start": 1014.0, "end": 1016.0, "text": "Das ist zu entspannt"}, {"id": 375, "start": 1016.0, "end": 1018.0, "text": "Relaxing-Nintendo-Musik"}, {"id": 376, "start": 1018.0, "end": 1020.0, "text": "Das ist cool"}, {"id": 377, "start": 1020.0, "end": 1022.0, "text": "Das war schon fast ein bisschen zu"}, {"id": 378, "start": 1022.0, "end": 1024.0, "text": "Relaxing"}, {"id": 379, "start": 1026.0, "end": 1028.0, "text": "Der Patrick hat mich auf eine echt geile Idee"}, {"id": 380, "start": 1028.0, "end": 1030.0, "text": "gebracht"}, {"id": 381, "start": 1030.0, "end": 1032.0, "text": "Jawoll"}, {"id": 382, "start": 1032.0, "end": 1034.0, "text": "Und zwar"}, {"id": 383, "start": 1034.0, "end": 1036.0, "text": "Es war natürlich nur"}, {"id": 384, "start": 1036.0, "end": 1038.0, "text": "Gebat, aber"}, {"id": 385, "start": 1038.0, "end": 1040.0, "text": "hat mich wirklich auf eine gute Idee gebracht"}, {"id": 386, "start": 1042.0, "end": 1044.0, "text": "Das ist"}, {"id": 387, "start": 1044.0, "end": 1046.0, "text": "Das hab ich nicht selbst gemacht"}, {"id": 388, "start": 1046.0, "end": 1048.0, "text": "Das ist das fertige"}, {"id": 389, "start": 1048.0, "end": 1050.0, "text": "Notexporter-Dashboard"}, {"id": 390, "start": 1050.0, "end": 1052.0, "text": "Warte mal, wo war das denn?"}, {"id": 391, "start": 1052.0, "end": 1054.0, "text": "Man kann das sogar relativ"}, {"id": 392, "start": 1054.0, "end": 1056.0, "text": "einfach skalieren"}, {"id": 393, "start": 1056.0, "end": 1058.0, "text": "Ich könnte einfach"}, {"id": 394, "start": 1058.0, "end": 1060.0, "text": "3 Server nehmen"}, {"id": 395, "start": 1060.0, "end": 1062.0, "text": "mit dem Crawler drauf"}, {"id": 396, "start": 1062.0, "end": 1064.0, "text": "Und auf dem ersten Server mach ich"}, {"id": 397, "start": 1064.0, "end": 1066.0, "text": "Shops 1-5, dann mach ich Shops"}, {"id": 398, "start": 1066.0, "end": 1068.0, "text": "auf dem zweiten Server 5-10"}, {"id": 399, "start": 1068.0, "end": 1070.0, "text": "und auf dem dritten Server 10-15"}, {"id": 400, "start": 1070.0, "end": 1072.0, "text": "Also Shops, Stores"}, {"id": 401, "start": 1072.0, "end": 1074.0, "text": "Also die Läden, wo man kaufen kann"}, {"id": 402, "start": 1074.0, "end": 1076.0, "text": "Das wird funktionieren"}, {"id": 403, "start": 1076.0, "end": 1078.0, "text": "Und das Frontend"}, {"id": 404, "start": 1078.0, "end": 1080.0, "text": "Das kann man nicht gescheit skalieren"}, {"id": 405, "start": 1080.0, "end": 1082.0, "text": "Dazu müsste ich das von"}, {"id": 406, "start": 1082.0, "end": 1084.0, "text": "SQLite auf Postgres oder irgendwas umbauen"}, {"id": 407, "start": 1084.0, "end": 1086.0, "text": "Dann könnte man das auch"}, {"id": 408, "start": 1086.0, "end": 1088.0, "text": "richtig"}, {"id": 409, "start": 1090.0, "end": 1092.0, "text": "Serverless"}, {"id": 410, "start": 1092.0, "end": 1094.0, "text": "High"}, {"id": 411, "start": 1094.0, "end": 1096.0, "text": "Serverless High Availability"}, {"id": 412, "start": 1096.0, "end": 1098.0, "text": "Horizontal Scaling"}, {"id": 413, "start": 1098.0, "end": 1100.0, "text": "Enable"}, {"id": 414, "start": 1100.0, "end": 1102.0, "text": "Ok, Dogger-Container ist gebaut"}, {"id": 415, "start": 1102.0, "end": 1104.0, "text": "Exquisite"}, {"id": 416, "start": 1110.0, "end": 1112.0, "text": "Ich muss mal ein Beispiel"}, {"id": 417, "start": 1112.0, "end": 1114.0, "text": "bei denen suchen"}, {"id": 418, "start": 1116.0, "end": 1118.0, "text": "Gering Star, der hatte doch so"}, {"id": 419, "start": 1118.0, "end": 1120.0, "text": "ein Docker-Beispiel"}, {"id": 420, "start": 1120.0, "end": 1122.0, "text": "Nur, dass wir das nicht wollen von dem"}, {"id": 421, "start": 1122.0, "end": 1124.0, "text": "Das wollen wir nicht von dem, wir wollen mal"}, {"id": 422, "start": 1124.0, "end": 1126.0, "text": "ein eigenes Docker-Image"}, {"id": 423, "start": 1126.0, "end": 1128.0, "text": "Passt"}, {"id": 424, "start": 1128.0, "end": 1130.0, "text": "Und jetzt müssen wir nämlich noch angeben, dass wir CPU limitieren wollen"}, {"id": 425, "start": 1130.0, "end": 1132.0, "text": "Das ist, wenn der Kram im Dogger-Container läuft"}, {"id": 426, "start": 1132.0, "end": 1134.0, "text": "viel einfacher, weil"}, {"id": 427, "start": 1134.0, "end": 1136.0, "text": "wenn man Lokal-CPU limitieren will"}, {"id": 428, "start": 1138.0, "end": 1140.0, "text": "Einfach CPUs 2 und gut ist"}, {"id": 429, "start": 1140.0, "end": 1142.0, "text": "Wenn man nämlich Lokal-CPUs limitieren will, geht das"}, {"id": 430, "start": 1142.0, "end": 1144.0, "text": "Aber spätestens, wenn man einen Prozess"}, {"id": 431, "start": 1144.0, "end": 1146.0, "text": "limitiert, der weitere Prozesse startet"}, {"id": 432, "start": 1146.0, "end": 1148.0, "text": "geht's nicht"}, {"id": 433, "start": 1148.0, "end": 1150.0, "text": "Kann man später auch Manuellprodukte"}, {"id": 434, "start": 1150.0, "end": 1152.0, "text": "Nein, kannst du nicht, kannst du nicht"}, {"id": 435, "start": 1152.0, "end": 1154.0, "text": "Kannst da nichts einstellen"}, {"id": 436, "start": 1156.0, "end": 1158.0, "text": "Du weißt ja gar nicht"}, {"id": 437, "start": 1158.0, "end": 1160.0, "text": "wie die ganzen Urls von den Shops"}, {"id": 438, "start": 1160.0, "end": 1162.0, "text": "und sowas sind, also du weißt das vielleicht schon"}, {"id": 439, "start": 1162.0, "end": 1164.0, "text": "aber der Crawler"}, {"id": 440, "start": 1164.0, "end": 1166.0, "text": "weißt das ja nicht"}, {"id": 441, "start": 1166.0, "end": 1168.0, "text": "Der kann ja nix crawlen, explizit für dich"}, {"id": 442, "start": 1168.0, "end": 1170.0, "text": "Das wäre ja riesen"}, {"id": 443, "start": 1170.0, "end": 1172.0, "text": "Aufwand, wenn jeder sein eigenes"}, {"id": 444, "start": 1172.0, "end": 1174.0, "text": "Zeug da rein macht"}, {"id": 445, "start": 1174.0, "end": 1176.0, "text": "Tja, Docker funktioniert das, aber"}, {"id": 446, "start": 1176.0, "end": 1178.0, "text": "wenn man ein bisschen CPU-Set macht, funktioniert's nicht"}, {"id": 447, "start": 1178.0, "end": 1180.0, "text": "Also, wie gesagt"}, {"id": 448, "start": 1180.0, "end": 1182.0, "text": "Im Dogger-Container ist es am einfachsten"}, {"id": 449, "start": 1182.0, "end": 1184.0, "text": "CPU zu beschreiten. Guck mal, ob das funktioniert"}, {"id": 450, "start": 1184.0, "end": 1186.0, "text": "Der sollte sich jetzt ein bisschen im Rahmen halten"}, {"id": 451, "start": 1186.0, "end": 1188.0, "text": "Oh, ich muss noch vorher was ändern"}, {"id": 452, "start": 1190.0, "end": 1192.0, "text": "Ich muss die Adresse, wo er"}, {"id": 453, "start": 1192.0, "end": 1194.0, "text": "einliefert, ändern"}, {"id": 454, "start": 1194.0, "end": 1196.0, "text": "Zwar, was hab ich denn lokal für eine IP"}, {"id": 455, "start": 1196.0, "end": 1198.0, "text": "hier auf meiner Kiste"}, {"id": 456, "start": 1198.0, "end": 1200.0, "text": "2.31"}, {"id": 457, "start": 1206.0, "end": 1208.0, "text": "So, das sollte jetzt eigentlich funktionieren"}, {"id": 458, "start": 1208.0, "end": 1210.0, "text": "Start"}, {"id": 459, "start": 1210.0, "end": 1212.0, "text": "Burger King Coupons"}, {"id": 460, "start": 1214.0, "end": 1216.0, "text": "Burger King Coupons"}, {"id": 461, "start": 1216.0, "end": 1218.0, "text": "Irgendwann, irgendwann"}, {"id": 462, "start": 1218.0, "end": 1220.0, "text": "mach ich sowas"}, {"id": 463, "start": 1220.0, "end": 1222.0, "text": "Irgendwann mach ich sowas"}, {"id": 464, "start": 1222.0, "end": 1224.0, "text": "Ich könnte das ohne Scheiß, ich könnte das"}, {"id": 465, "start": 1224.0, "end": 1226.0, "text": "aus Spaß, ich mach das aus Spaß rein"}, {"id": 466, "start": 1226.0, "end": 1228.0, "text": "Burger King Coupons"}, {"id": 467, "start": 1228.0, "end": 1230.0, "text": "Wo gibt's die?"}, {"id": 468, "start": 1230.0, "end": 1232.0, "text": "Die mach ich rein, das ist einfach"}, {"id": 469, "start": 1232.0, "end": 1234.0, "text": "Das ist witzig, wenn Burger King"}, {"id": 470, "start": 1234.0, "end": 1236.0, "text": "Coupons gibt"}, {"id": 471, "start": 1238.0, "end": 1240.0, "text": "Das ist lustig, wenn's dann einfach neben"}, {"id": 472, "start": 1240.0, "end": 1242.0, "text": "Hardware noch Burger King Coupons gibt"}, {"id": 473, "start": 1242.0, "end": 1244.0, "text": "Sag mal, welche Seite kann ich erkennen"}, {"id": 474, "start": 1244.0, "end": 1246.0, "text": "ob's die gibt?"}, {"id": 475, "start": 1252.0, "end": 1254.0, "text": "Eigentlich sollte der jetzt"}, {"id": 476, "start": 1254.0, "end": 1256.0, "text": "beschränkt sein auf 2 CPUs"}, {"id": 477, "start": 1258.0, "end": 1260.0, "text": "Warum ist der nicht auf 2 CPUs beschränkt?"}, {"id": 478, "start": 1260.0, "end": 1262.0, "text": "Also normalerweise"}, {"id": 479, "start": 1262.0, "end": 1264.0, "text": "sollte er das sein"}, {"id": 480, "start": 1266.0, "end": 1268.0, "text": "Ach, weil ich NPM Start gemacht hab"}, {"id": 481, "start": 1268.0, "end": 1270.0, "text": "Alter"}, {"id": 482, "start": 1274.0, "end": 1276.0, "text": "Richtig dumm"}, {"id": 483, "start": 1276.0, "end": 1278.0, "text": "Pains Champ"}, {"id": 484, "start": 1280.0, "end": 1282.0, "text": "So, und jetzt zeig ich euch die neue"}, {"id": 485, "start": 1282.0, "end": 1284.0, "text": "Preis Champ Version"}, {"id": 486, "start": 1286.0, "end": 1288.0, "text": "Ah, so ist gut, guck mal hier"}, {"id": 487, "start": 1288.0, "end": 1290.0, "text": "So ist das viel besser"}, {"id": 488, "start": 1294.0, "end": 1296.0, "text": "My Deals einfach via"}, {"id": 489, "start": 1296.0, "end": 1298.0, "text": "Feed Reader, das ist ne gute Idee"}, {"id": 490, "start": 1300.0, "end": 1302.0, "text": "Da muss ich nen Custom-Crawler basteln"}, {"id": 491, "start": 1302.0, "end": 1304.0, "text": "aber das ist ne gute Idee"}, {"id": 492, "start": 1304.0, "end": 1306.0, "text": "Und die haben dann"}, {"id": 493, "start": 1306.0, "end": 1318.0, "text": "RSS-Feed oder was?"}, {"id": 494, "start": 1318.0, "end": 1320.0, "text": "So?"}, {"id": 495, "start": 1322.0, "end": 1324.0, "text": "Ne"}, {"id": 496, "start": 1326.0, "end": 1328.0, "text": "Wo gibt's denn hier"}, {"id": 497, "start": 1328.0, "end": 1330.0, "text": "nen RSS-Feed von denen?"}, {"id": 498, "start": 1330.0, "end": 1334.0, "text": "Ami"}, {"id": 499, "start": 1336.0, "end": 1338.0, "text": "Hier, RSS-Hot"}, {"id": 500, "start": 1338.0, "end": 1340.0, "text": "Exzellent"}, {"id": 501, "start": 1344.0, "end": 1346.0, "text": "Da können wir nämlich mal gucken"}, {"id": 502, "start": 1346.0, "end": 1348.0, "text": "Was gibt's? Da gibt's Burger King"}, {"id": 503, "start": 1348.0, "end": 1350.0, "text": "Gibt's den auch gar nicht"}, {"id": 504, "start": 1350.0, "end": 1352.0, "text": "Chat"}, {"id": 505, "start": 1352.0, "end": 1354.0, "text": "Gibt keinen Burger King"}, {"id": 506, "start": 1356.0, "end": 1358.0, "text": "Anzeige ist raus"}, {"id": 507, "start": 1358.0, "end": 1360.0, "text": "und"}, {"id": 508, "start": 1364.0, "end": 1366.0, "text": "King"}, {"id": 509, "start": 1370.0, "end": 1372.0, "text": "Aber die Idee ist gut"}, {"id": 510, "start": 1372.0, "end": 1374.0, "text": "Die Idee ist gut"}, {"id": 511, "start": 1376.0, "end": 1378.0, "text": "Die Idee ist auf jeden Fall gut"}, {"id": 512, "start": 1378.0, "end": 1380.0, "text": "Ok, jetzt passt's"}, {"id": 513, "start": 1380.0, "end": 1382.0, "text": "Ok, so jetzt starte ich den lokalen Preis Champ"}, {"id": 514, "start": 1384.0, "end": 1386.0, "text": "Und jetzt zeig ich euch mal was Neues"}, {"id": 515, "start": 1386.0, "end": 1388.0, "text": "Jetzt richtig"}, {"id": 516, "start": 1388.0, "end": 1390.0, "text": "Massive Nice gemacht"}, {"id": 517, "start": 1392.0, "end": 1394.0, "text": "Aber mir gefällt's optisch schon nicht so 100%"}, {"id": 518, "start": 1394.0, "end": 1396.0, "text": "Das können wir jetzt im Stream machen"}, {"id": 519, "start": 1396.0, "end": 1398.0, "text": "Dass es dann hübsch aussieht bevor ich das pushe"}, {"id": 520, "start": 1406.0, "end": 1408.0, "text": "Out aufmachen"}, {"id": 521, "start": 1408.0, "end": 1410.0, "text": "Chrome aufmachen"}, {"id": 522, "start": 1410.0, "end": 1416.0, "text": "Jetzt zeig ich euch den lokalen Preis Champ"}, {"id": 523, "start": 1416.0, "end": 1418.0, "text": "80"}, {"id": 524, "start": 1424.0, "end": 1426.0, "text": "Warum hab ich den scheißen Lokal noch laufen?"}, {"id": 525, "start": 1428.0, "end": 1430.0, "text": "Keck weh"}, {"id": 526, "start": 1430.0, "end": 1432.0, "text": "Wann hab ich das gestartet?"}, {"id": 527, "start": 1432.0, "end": 1434.0, "text": "Warte mal"}, {"id": 528, "start": 1436.0, "end": 1438.0, "text": "Wo hab ich denn das überhaupt gestartet?"}, {"id": 529, "start": 1440.0, "end": 1442.0, "text": "Läuft da noch irgendein Docker-Container oder so?"}, {"id": 530, "start": 1444.0, "end": 1446.0, "text": "Ach der Crap ist noch am Start, Alter"}, {"id": 531, "start": 1446.0, "end": 1448.0, "text": "Stopp"}, {"id": 532, "start": 1448.0, "end": 1450.0, "text": "Haben die sich neu gestartet?"}, {"id": 533, "start": 1452.0, "end": 1454.0, "text": "Wo hab ich denn den Kram Docker-Composed?"}, {"id": 534, "start": 1454.0, "end": 1456.0, "text": "Hier?"}, {"id": 535, "start": 1456.0, "end": 1458.0, "text": "Meine exzellente Benamung"}, {"id": 536, "start": 1458.0, "end": 1460.0, "text": "Weißt du sofort Bescheid"}, {"id": 537, "start": 1460.0, "end": 1462.0, "text": "Das da? Nee"}, {"id": 538, "start": 1464.0, "end": 1466.0, "text": "Ich mein"}, {"id": 539, "start": 1470.0, "end": 1472.0, "text": "Das ist es"}, {"id": 540, "start": 1472.0, "end": 1474.0, "text": "Down"}, {"id": 541, "start": 1474.0, "end": 1476.0, "text": "Was?"}, {"id": 542, "start": 1476.0, "end": 1478.0, "text": "Das ist es"}, {"id": 543, "start": 1478.0, "end": 1480.0, "text": "Das ist es"}, {"id": 544, "start": 1480.0, "end": 1482.0, "text": "Das ist es"}, {"id": 545, "start": 1482.0, "end": 1484.0, "text": "Die"}, {"id": 546, "start": 1490.0, "end": 1494.0, "text": "Die"}, {"id": 547, "start": 1494.0, "end": 1496.0, "text": "Keck, warte"}, {"id": 548, "start": 1498.0, "end": 1500.0, "text": "Wo hab ich denn das?"}, {"id": 549, "start": 1502.0, "end": 1504.0, "text": "Ok dann lösche ich den Kram von Hand"}, {"id": 550, "start": 1504.0, "end": 1506.0, "text": "Docker stopp"}, {"id": 551, "start": 1506.0, "end": 1515.2, "text": "das da, das da, das da, docker, images, was hab ich denn, alter was ist da alles dabei,"}, {"id": 552, "start": 1515.2, "end": 1525.36, "text": "äh, lull, na gut, kann ich den auch nochmal löschen, so, jetzt muss ich das Surf nochmal"}, {"id": 553, "start": 1525.36, "end": 1537.6, "text": "neu machen, so, und jetzt zeige ich euch den neuen Preis-Champ, alter, minus v ist version,"}, {"id": 554, "start": 1537.6, "end": 1545.68, "text": "ne, minus v ist doch eigentlich löschen, ach, es ist minus, es ist down minus v, ne,"}, {"id": 555, "start": 1545.68, "end": 1556.52, "text": "das kommt auch noch auf die, das kommt auch noch auf die, ok, das ist echt hängen geblieben,"}, {"id": 556, "start": 1556.52, "end": 1566.44, "text": "das ist echt hängen geblieben, das, das minus v, was anderes ist wie das, ne, es ist minus"}, {"id": 557, "start": 1566.44, "end": 1575.28, "text": "v, was war minus v an der falschen Stelle, keck wait, ok, jetzt zeige ich euch den neuen"}, {"id": 558, "start": 1575.28, "end": 1582.12, "text": "Preis-Champ, bam, es ist noch kein großer Unterschied, erstens, das allerwichtigste,"}, {"id": 559, "start": 1582.12, "end": 1587.76, "text": "pass mal auf, ich hab, ich hab nen, nen Alarmsymbol gefunden, was mich nicht mehr triggert, guck"}, {"id": 560, "start": 1587.76, "end": 1596.64, "text": "mal, das ist jetzt properly aligned alles, ja, also da, da zuckelt kein Alken mehr rum,"}, {"id": 561, "start": 1596.64, "end": 1607.12, "text": "allerwichtigste, ohne hätt ich nicht weiter gemacht, so, und jetzt, guck mal, wenn du"}, {"id": 562, "start": 1607.12, "end": 1620.76, "text": "jetzt hier drauf gehst, an der Preis-Champ eigentlich jetzt mal die, die rtx gefunden,"}, {"id": 563, "start": 1620.76, "end": 1630.76, "text": "ne, aber guck mal, die andere rtx ist jetzt auch weg, lull, so, pass mal auf, wenns jetzt"}, {"id": 564, "start": 1630.76, "end": 1643.12, "text": "geht, all die musik, die musik ist ja monkaS, so, pass mal auf, wenn man jetzt hier drauf"}, {"id": 565, "start": 1643.12, "end": 1658.6, "text": "drückt, 30.90, bam, das gefällt mir aber optisch noch nicht so ganz, also, man kriegt"}, {"id": 566, "start": 1658.6, "end": 1662.84, "text": "angezeigt, welche Shops den Kram haben, man kann hier den Shop öffnen, sortiert nach"}, {"id": 567, "start": 1662.84, "end": 1670.28, "text": "Preis, und man sieht, wann der das gefunden hat, und die Zeit tickt runter, also sprich,"}, {"id": 568, "start": 1670.28, "end": 1675.72, "text": "hier weiß man, das ist noch ziemlich, ziemlich aktuell refreshed, guck, der geht, ich find's"}, {"id": 569, "start": 1675.72, "end": 1692.24, "text": "auch cool, wie redet das wieder hoch animiert, und so, da ist der Chat im Weg, achso, guck"}, {"id": 570, "start": 1692.24, "end": 1707.12, "text": "mal, seht ihr mal, wie hyper responsive das ganze ist, massive responsive, huge responsive,"}, {"id": 571, "start": 1707.12, "end": 1714.96, "text": "exellent, so, guckt, und hier sieht man auch, wann er immer zuletzt gecrawlt hat, und das"}, {"id": 572, "start": 1714.96, "end": 1721.76, "text": "tickt dann runter, ich mein, das sind halt 15 Minuten, das tickt ein bisschen langsam"}, {"id": 573, "start": 1721.76, "end": 1728.84, "text": "runter, also sprich, nach 15 Minuten time outed, das ist ja eh, ich hab das so eingestellt,"}, {"id": 574, "start": 1728.84, "end": 1733.76, "text": "wenn der was findet, und wenn er es innerhalb von 15 Minuten nicht nochmal gefunden hat,"}, {"id": 575, "start": 1733.76, "end": 1742.24, "text": "dann geht's weg, so, und wenn man dann hier oben drauf drückt, kann man sich die ganzen"}, {"id": 576, "start": 1742.24, "end": 1751.16, "text": "Angebote angucken, guck da, lagern, nur noch eine, Leute, bald gibt's nichts mehr, mehr"}, {"id": 577, "start": 1751.16, "end": 1755.6, "text": "Storngs für Media, äh, für Mindfab, wie komm ich auf Media Markt, Mindfabry, auch"}, {"id": 578, "start": 1755.6, "end": 1768.68, "text": "noch hier am Start, Alter, die Preise, was ist denn mit denen los, das ist einfach 1000"}, {"id": 579, "start": 1768.68, "end": 1783.24, "text": "Euro teurer als angekündigt, so, aber das ist schon sehr nice, oder, übrigens, die"}, {"id": 580, "start": 1783.24, "end": 1790.84, "text": "Storngs stimmen nicht, by the way, ne, also das ist einfach nur ein fixer Graph, der sich"}, {"id": 581, "start": 1790.84, "end": 1794.96, "text": "nicht ändert, das ist noch null dynamisch, aber ich hab gedacht, ich bau das schon mal"}, {"id": 582, "start": 1794.96, "end": 1811.56, "text": "hin, weil das cool aussieht, lass einfach starten, fällt eh keinem auf bei den Preisen"}, {"id": 583, "start": 1811.56, "end": 1822.36, "text": "aktuell, merkt doch eh keiner, by the way, warum braucht der denn so lange, bis er das"}, {"id": 584, "start": 1822.36, "end": 1829.96, "text": "Ding geladen hat, ah, guck mal, ich hab da noch ein Bug drin, guck mal, das Verbug,"}, {"id": 585, "start": 1829.96, "end": 1834.32, "text": "das braucht so lang, weil der immer erst mal eine Sekunde braucht, guck mal, das riecht"}, {"id": 586, "start": 1834.32, "end": 1845.36, "text": "stumm, da muss ich gleich mal fixen, äh, Timer, äh, Timer, Timer, hier Timer da,"}, {"id": 587, "start": 1845.36, "end": 1858.76, "text": "jetzt machen wir anders, jetzt machen wir anders, dann ist es nämlich auch instant da,"}, {"id": 588, "start": 1858.76, "end": 1864.2, "text": "Update, Alter, ich kann heute nicht mehr tippen, das ist zu viel, Update, und dann, bevor"}, {"id": 589, "start": 1864.2, "end": 1868.56, "text": "wir das gestartet haben, noch mal ein Update, und jetzt ist es auch instant am Start, passt"}, {"id": 590, "start": 1868.56, "end": 1877.16, "text": "auf, zack, ohne dass das irgendwie erst laden muss, instant, instant Timer, instant Timer"}, {"id": 591, "start": 1877.16, "end": 1885.96, "text": "am Start, äh, by the way, soll ich den Chat irgendwo anders hinschieben, dass man das"}, {"id": 592, "start": 1885.96, "end": 1898.32, "text": "da besser sieht, ich könnte den Chat, wo schieben wir den Chat hin, unten links, ich weiß nicht,"}, {"id": 593, "start": 1898.32, "end": 1904.92, "text": "ich glaub unten links ist nicht so spannend gerade, unten links, da fehlt ein bisschen"}, {"id": 594, "start": 1904.92, "end": 1920.48, "text": "was von meinem Terminal Output oder so, aber das juckt ja nicht, guck mal mal, ja, also"}, {"id": 595, "start": 1920.48, "end": 1926.16, "text": "sprich, ihr seht, das tickt auch runter, und sobald sich das Refreshed, das können wir"}, {"id": 596, "start": 1926.16, "end": 1933.32, "text": "mal abwarten, aktuell gibt es bloß 3 Sachen, gibt bloß 3 Läden mit 30,90, ok, was sagt"}, {"id": 597, "start": 1933.32, "end": 1940.88, "text": "der Preischamp hier dazu, ah, der hat ja noch gar keine History, lull, ja, nur 3 Läden"}, {"id": 598, "start": 1940.88, "end": 1946.64, "text": "mit 30,90 gerade, aber sobald es aktuell ist, das ist ja übrigens auch live im Vergleich"}, {"id": 599, "start": 1946.64, "end": 1954.56, "text": "zu gestern, ne, also, wenn jetzt hier ein neuer Laden dazukommt, wir können ja mal kurz,"}, {"id": 600, "start": 1954.56, "end": 1960.72, "text": "wir können ja mal kurz zugucken, ob der irgendwie eine 30,90 hier findet, ah, der ist gerade"}, {"id": 601, "start": 1960.72, "end": 1966.64, "text": "bei 60,80 am Crawlen, ok, 30,80, wenn das eine 30,90 bei einem anderen Laden findet,"}, {"id": 602, "start": 1966.64, "end": 1969.84, "text": "dann ploppt das jetzt hier dynamisch auf, also sprich, man muss wirklich nichts mehr"}, {"id": 603, "start": 1969.84, "end": 1982.64, "text": "zu machen und aktualisieren, was haltet ihr denn davon, wie viel Schweizer Shops haben"}, {"id": 604, "start": 1982.64, "end": 1990.08, "text": "die denn da drinnen, ich lasse es einfach mal laufen, wir gucken mal, wie viel Schweizer"}, {"id": 605, "start": 1990.08, "end": 1994.52, "text": "Shops, ob sich das überhaupt lohnt, da einen Schalter zu machen für Schweiz und Österreich,"}, {"id": 606, "start": 1994.52, "end": 1998.76, "text": "aber die meisten deutschen Shops liefern doch auch nach Österreich und Schweiz, oder,"}, {"id": 607, "start": 1998.76, "end": 2017.8, "text": "oder nicht, ich hab keine Ahnung, wenn ich ehrlich bin, Austria, jetzt die Musik bisschen"}, {"id": 608, "start": 2017.8, "end": 2032.64, "text": "lauter, oh ne, passt, Austria, Switz, wie, Keg-Wade, die Schweiz gibt es da gar nicht,"}, {"id": 609, "start": 2032.64, "end": 2043.68, "text": "Zauerei, Repos, Street-Virgent, gucken wir mal, Stores, Store, kannst du grundsätzlich"}, {"id": 610, "start": 2043.68, "end": 2051.92, "text": "alle EU-Shops crawlen, ne, na gut, UK ist ja kein EU mehr, aber es gibt genug EU-Shops,"}, {"id": 611, "start": 2051.92, "end": 2059.2, "text": "die halt wahrscheinlich gar nicht nach Deutschland liefern, im Zweifelsfall, zumindest UK ist"}, {"id": 612, "start": 2059.2, "end": 2064.0, "text": "vorbei, UK liefert nicht mal nach, nach DE, also Overclockers hab ich rausgeschmissen,"}, {"id": 613, "start": 2064.0, "end": 2069.36, "text": "was ist denn, was ist denn John Lewis, hört sich an wie irgendein Wrestler oder so, aber"}, {"id": 614, "start": 2069.36, "end": 2080.8, "text": "es ist anscheinend, so, Crab, mal nach Punkt AT, mal gucken, gibt es keinen, und gibt es"}, {"id": 615, "start": 2080.8, "end": 2087.08, "text": "einen CH-Shop, lull, ok, es gibt keine Schweizer Shops und keine AT-Shops, also im Prinzip"}, {"id": 616, "start": 2087.08, "end": 2104.8, "text": "lohnt sich das nicht, Digitech, gibt es nicht, nach was, Brack, alter, ne, gibt es nicht,"}, {"id": 617, "start": 2104.8, "end": 2119.2, "text": "kein Brack, kein Brack, Digga, alter, Digga, Digitech, ne, gibt es nicht, guck mal, er"}, {"id": 618, "start": 2119.2, "end": 2122.2, "text": "hat live geupdatet hier, wir haben es zwar nicht gesehen, guck, jetzt hat er hier auch"}, {"id": 619, "start": 2122.2, "end": 2128.92, "text": "gerade Alternate geupdatet, die Animation ist ein bisschen schnell, oder, das sieht so"}, {"id": 620, "start": 2128.92, "end": 2137.44, "text": "aus, als backt es rum, ich sollte die Animation ein bisschen langsamer machen, für dieses"}, {"id": 621, "start": 2137.44, "end": 2141.2, "text": "einfaden, machen wir das eine Sekunde lang, dann sieht es eher so aus, als wollte ich,"}, {"id": 622, "start": 2141.2, "end": 2146.96, "text": "dass es updatet, ah, den Fix habe ich eh noch gar nicht drinnen, Moment, Moment, Minus"}, {"id": 623, "start": 2146.96, "end": 2151.08, "text": "eins, das habe ich doch gestern, gestern habe ich das schon mal, gestern habe ich das schon"}, {"id": 624, "start": 2151.08, "end": 2176.92, "text": "mal gefixt, Moment, Price, also, das ist noch der von gestern, Cacquait, das ist noch"}, {"id": 625, "start": 2176.92, "end": 2201.4, "text": "das von gestern, wartet mal, ja, geil, null, das muss ich jetzt mal kurz reverten, das"}, {"id": 626, "start": 2201.4, "end": 2210.84, "text": "hat, irgendwie, Wistel Studio hat das zwischengecashed, warum auch immer, Kackding, ich mache einfach"}, {"id": 627, "start": 2210.84, "end": 2221.52, "text": "mal alles zu, alles weg, was will das immer von mir, piss dich, alte, geh fort, so, jetzt"}, {"id": 628, "start": 2221.52, "end": 2249.68, "text": "schauen wir mal, was der hier drin hat, Serious Box, äh, ach ne, das ist doch richtig, passt"}, {"id": 629, "start": 2249.68, "end": 2255.72, "text": "doch alles, alles gut, alles gut, passt, ist doch richtig, so, also Asus Minus eins muss"}, {"id": 630, "start": 2255.72, "end": 2263.52, "text": "gefixt werden, hier, Asus Minus eins muss gefixt werden, also gucken wir mal, das heißt,"}, {"id": 631, "start": 2263.52, "end": 2276.56, "text": "wenn der Preis, hier, das da müssen wir machen, also wenn der Preis, äh ja, irgendwie reloaded"}, {"id": 632, "start": 2276.56, "end": 2289.08, "text": "kann nicht, but why, so, also, wenn, wenn der Preis, kleiner null ist, dann zeigen wir"}, {"id": 633, "start": 2289.08, "end": 2304.36, "text": "an, dann zeigen wir an, äh, kein Preis verfügbar, ja, das hatten wir gestern auch so, haben"}, {"id": 634, "start": 2304.36, "end": 2309.72, "text": "wir im Alter einen Api, um den Preis abzurufen, ne, ne, ne, ne, ne, die sind da auch glaube"}, {"id": 635, "start": 2309.72, "end": 2316.0, "text": "ich nicht so scharf drauf gecrawlt zu werden, aber die aktuelle Liefersituation, ähm,"}, {"id": 636, "start": 2316.0, "end": 2321.44, "text": "bleibt uns ja nichts anderes übrig, kann man den Chat nach oben, oben rechts machen,"}, {"id": 637, "start": 2321.44, "end": 2330.64, "text": "irgendwie ist der Chat überall im Weg heute, Chat, zu dick, Chat ist heute zu pepo fett,"}, {"id": 638, "start": 2330.64, "end": 2340.52, "text": "die können es oben links hin machen, ich habe eine andere Idee, wir machen einfach"}, {"id": 639, "start": 2340.52, "end": 2366.52, "text": "so, wir machen so, ach Moment, das, das, ihh, null, boah, das sieht ja kacke aus,"}, {"id": 640, "start": 2366.52, "end": 2379.88, "text": "der Chat ist jetzt kleiner als sonst, ne, der Chat, der Chat war doch vorher eher immer,"}, {"id": 641, "start": 2379.88, "end": 2389.0, "text": "Chat, ich glaube ich habe es kaputt gemacht, warte mal, wie resetet man das jetzt nochmal,"}, {"id": 642, "start": 2389.0, "end": 2405.12, "text": "transform, reset, Chat, ich habe keine Ahnung, wie groß ich euch immer hatte, so, rückgängig"}, {"id": 643, "start": 2405.12, "end": 2426.88, "text": "machen kann man hier nicht, soll der größer oder wart ihr noch größer, so, wo mache"}, {"id": 644, "start": 2426.88, "end": 2442.6, "text": "ich euch denn jetzt mal hin, wartet mal, wartet mal, ich habe eine Idee, da konnte man noch"}, {"id": 645, "start": 2442.6, "end": 2471.36, "text": "die Zeilen einstellen oder, ne, man kann die Zeilen nicht einstellen, na geil, ok Chat,"}, {"id": 646, "start": 2471.36, "end": 2481.04, "text": "so mache ich euch hin, wartet mal, ich habe noch eine andere Idee, so Chat, also ich mache"}, {"id": 647, "start": 2481.04, "end": 2487.44, "text": "jetzt mal unten rechts nochmal hin und jetzt machen wir aber die Höhe von 300 mal runter"}, {"id": 648, "start": 2487.44, "end": 2498.86, "text": "auf 150, das sollte nur die Hälfte hoch sein und dementsprechend solltet ihr dann eigentlich"}, {"id": 649, "start": 2498.86, "end": 2512.0, "text": "nirgendwo drüber sein, ok Chat, mal was testen, irgendwas spammen, gucken wie viele Zeilen"}, {"id": 650, "start": 2512.0, "end": 2523.2, "text": "der jetzt da drin anzeigen kann, ja jetzt seid ihr nirgendwo drüber, komm mal Chat,"}, {"id": 651, "start": 2523.2, "end": 2552.72, "text": "jetzt seid ihr nirgendwo drüber, Golden Kappa Test, perfekt, so lassen wir das, alles klar,"}, {"id": 652, "start": 2552.72, "end": 2557.08, "text": "gut, wo sind wir stehen geblieben, wir wollten das mit keinem Preis verfügbar fixen, also"}, {"id": 653, "start": 2557.08, "end": 2561.04, "text": "Leute wisst ihr was mir noch nicht so, was mir noch nicht wirklich gut gefällt, ist"}, {"id": 654, "start": 2561.04, "end": 2567.2, "text": "dieser Timer, der sieht da so fehler am Platz aus irgendwie, ne, habt ihr eine bessere Idee"}, {"id": 655, "start": 2567.2, "end": 2572.08, "text": "wo ich den hin machen kann, dürft nicht vergessen hier oben, das kann ganz schön lang werden,"}, {"id": 656, "start": 2572.08, "end": 2577.4, "text": "zum Beispiel wenn da Notebooks billiger drin steht, dann geht der Überschrift bis hier,"}, {"id": 657, "start": 2577.4, "end": 2583.04, "text": "weiter woher findet ihr das besser, wenn das direkt hier oben verlinkt ist oder mit diesem"}, {"id": 658, "start": 2583.04, "end": 2586.8, "text": "öffnen Button, ich find gerade im Detail View ist das mit diesem öffnen Button eigentlich"}, {"id": 659, "start": 2586.8, "end": 2597.48, "text": "ganz nice, ich mein wir könnten den, wir könnten das Bild vorne weg machen und dafür"}, {"id": 660, "start": 2597.48, "end": 2603.04, "text": "den Timer hin machen, aber das Bild hat was, weil wir machen die Bilder ja je nachdem wie"}, {"id": 661, "start": 2603.04, "end": 2609.36, "text": "teuer das ist, so wie es ist, ich weiß nicht, das sieht irgendwie nicht sonderlich gut"}, {"id": 662, "start": 2609.36, "end": 2613.8, "text": "durchdacht aus oder gerade wenn hier kein Preis steht, wobei wir können einfach nur"}, {"id": 663, "start": 2613.8, "end": 2624.0, "text": "kein Preis hinschreiben, du könnt den Timer rechts vorm Preis machen, ja hab ich doch,"}, {"id": 664, "start": 2624.0, "end": 2632.96, "text": "das ist wann er das gesehen hat, ja, einfach im durchsichtlichen Kreis wo der"}, {"id": 665, "start": 2632.96, "end": 2647.6, "text": "Border kleiner wird, ein durchsichtlicher Kreis wo der Border kleiner wird, also quasi"}, {"id": 666, "start": 2647.6, "end": 2665.24, "text": "jetzt, ich mein man könnte auch ne Progress Bar da unten hin machen, das ist zu big brain"}, {"id": 667, "start": 2665.24, "end": 2677.56, "text": "für mich, man könnte das sogar im Hintergrund irgendwie machen, Progress um das"}, {"id": 668, "start": 2677.56, "end": 2689.68, "text": "ganze Feld, oh das ist ein bisschen kompliziert, Serious Maxi meinst du das durchsichtliche"}, {"id": 669, "start": 2689.68, "end": 2702.32, "text": "Preis, wir könnten auch ne Progress, oh exellent, ach so, also du meinst ohne Zahl drinne oder"}, {"id": 670, "start": 2702.32, "end": 2711.4, "text": "was, wir könnten auch ne Progress Bar machen, gucken wir mal wie das aussieht, ich vermute"}, {"id": 671, "start": 2711.4, "end": 2727.4, "text": "mal das können wir einfach austauschen, nee können wir nicht, ok Rotate gibt es schon"}, {"id": 672, "start": 2727.4, "end": 2741.4, "text": "mal nicht dafür, alter was stört ihn jetzt, was stört ihn jetzt da dran, ach so das muss"}, {"id": 673, "start": 2741.4, "end": 2758.88, "text": "er wahrscheinlich größer machen, jetzt muss man das hier wahrscheinlich raus machen,"}, {"id": 674, "start": 2758.88, "end": 2782.24, "text": "ah hier, wow was jetzt, was hab ich jetzt kaputt gemacht, höchst besser sieht das"}, {"id": 675, "start": 2782.24, "end": 2792.16, "text": "ja nicht aus, so, wir könnten das unten an der Box machen, das ist glaub ich gar keine"}, {"id": 676, "start": 2792.16, "end": 2803.96, "text": "so schlechte Idee, so die Zahl muss halt weg, wobei das sieht aus wie Verfügbarkeit, das"}, {"id": 677, "start": 2803.96, "end": 2812.8, "text": "verwirrt die Leute, genau, genau, ohne Zahl sieht das so aus als ist das irgendwie Verfügbarkeit"}, {"id": 678, "start": 2812.8, "end": 2840.8, "text": "oder so, hm, kein Preis ist natürlich das beste, der niedrigste."}, {"id": 679, "start": 2840.8, "end": 2854.24, "text": "Ja gut aber die Zahl die geht da ja nicht hin, die Zahl die sieht halt mega bescheuert"}, {"id": 680, "start": 2854.24, "end": 2866.64, "text": "aus, nee das sieht total beknackt aus wenn ich da eine Zahl hin mache, man müsste höchstens"}, {"id": 681, "start": 2866.64, "end": 2878.0, "text": "irgendwie nebeneinander machen oder so, geht gar nicht, mach doch die Zahl trotzdem dahin,"}, {"id": 682, "start": 2878.0, "end": 2882.24, "text": "da wo vorher der Kreis war, das funktioniert nicht richtig, weil das ist alles in einer"}, {"id": 683, "start": 2882.24, "end": 2889.6, "text": "Komponente drin, die Zahl und das the progress das krieg ich da nicht hin, das ist guck mal"}, {"id": 684, "start": 2889.6, "end": 2901.12, "text": "das ist super responsive, pass mal auf, huge responsive, siehste das wie massive responsive"}, {"id": 685, "start": 2901.12, "end": 2928.44, "text": "das ist, exquisite responsive, so, ja das sieht kacke aus, machs mal wieder rückgängig,"}, {"id": 686, "start": 2928.44, "end": 2946.72, "text": "warum checkt der das net, das ist wieder rund, der soll das jetzt gefälligst rund anzeigen,"}, {"id": 687, "start": 2946.72, "end": 2963.68, "text": "so jetzt mach ich das ja auch mal wieder rückgängig, ach nee, ok leute ich glaube ich lasse das"}, {"id": 688, "start": 2963.68, "end": 2970.68, "text": "jetzt einfach mal so mir fällt nichts besseres gerade ein, mir fällt gerade echt nichts"}, {"id": 689, "start": 2970.68, "end": 2983.08, "text": "besseres ein dazu, so also bevor ich das pushe, was meint ihr, was soll ich denn mit dem unten"}, {"id": 690, "start": 2983.08, "end": 2998.48, "text": "war besser, ja aber unten sagt das absolut gar nichts, also unten, genau, wenn das unten"}, {"id": 691, "start": 2998.48, "end": 3014.16, "text": "ist denkt man das ist irgendwie verfügbarkeit, ja wie könnte man das denn machen, dass man"}, {"id": 692, "start": 3014.16, "end": 3027.04, "text": "es versteht, ich mein, ich hab ne Idee, leute ich hab ne Idee, ich hab ne Idee, wir machen"}, {"id": 693, "start": 3027.04, "end": 3032.32, "text": "das anders, guck mal wartet mal, wir schreiben da gar keine zahl rein, wir schreiben da gar"}, {"id": 694, "start": 3032.32, "end": 3043.8, "text": "keine zahl rein, wir schreiben da rein, wir machen dann icon rein, wie wärs mal mit updaten,"}, {"id": 695, "start": 3043.8, "end": 3049.08, "text": "was ist denn los hier, normalerweise macht das updaten das automatisch, na das sieht"}, {"id": 696, "start": 3049.08, "end": 3055.36, "text": "auch nicht gut aus oder, braucht man das überhaupt, ja das ist schon nicht schlecht zu wissen weil"}, {"id": 697, "start": 3055.36, "end": 3076.56, "text": "man das gefunden hat zuletzt, das sieht dumm aus, na vielleicht, ne ok das sieht dumm aus,"}, {"id": 698, "start": 3076.56, "end": 3082.48, "text": "ich mein wir könntens hier unten drunter machen in klein oder, warum machen wirs nicht"}, {"id": 699, "start": 3082.48, "end": 3095.92, "text": "unter das keck w in klein, ja zeitstempel hatte ich vorher, das sah auch nicht gut aus,"}, {"id": 700, "start": 3095.92, "end": 3104.32, "text": "wir machen das mal unter das keck w in klein, ok wir machen die zahl weg, dann machen wir"}, {"id": 701, "start": 3104.32, "end": 3115.8, "text": "den kram kleiner und das in der mitte fetter, so, das zeigt was er zuletzt refreshed hat,"}, {"id": 702, "start": 3115.8, "end": 3122.96, "text": "so und jetzt, und jetzt, richtig agile, ja, und jetzt zeigen wir das unter dem keck w"}, {"id": 703, "start": 3122.96, "end": 3140.68, "text": "an, so wo ist der hier, da, kann man das jetzt einfach hier unten drunter machen, äh, äh,"}, {"id": 704, "start": 3140.68, "end": 3153.56, "text": "wartet mal, ne das sieht kacke aus, ich war mal die höhe irgendwie auf 60 oder so, oh,"}, {"id": 705, "start": 3153.56, "end": 3160.68, "text": "das war die, ist das irgendein flex oder was ist da, was passiert nur jetzt wenn ich dem"}, {"id": 706, "start": 3160.68, "end": 3168.2, "text": "einfach sag, margin top 15 oder so, gehts dann runter, ne, wie krieg ich denn das jetzt"}, {"id": 707, "start": 3168.2, "end": 3182.84, "text": "runter, dann break dazwischen, float wirds auch nicht tun wahrscheinlich, äh, also float"}, {"id": 708, "start": 3182.84, "end": 3198.48, "text": "wirds auf jeden fall nicht bringen, so, ich mein wir können das eingebaute zeug verwenden,"}, {"id": 709, "start": 3198.48, "end": 3213.64, "text": "sollte das einsch machen, äh, wov wird der immer schlimmer, fast, fast, fast, wir nähern"}, {"id": 710, "start": 3213.64, "end": 3223.68, "text": "uns, wir nähern uns leute, wir nähern uns, wir nähern uns der sache, guck mal, guck"}, {"id": 711, "start": 3223.68, "end": 3242.28, "text": "mal, fast, fast, äh, äh, äh, excellent, ein bisschen höher müßt man es glaub ich"}, {"id": 712, "start": 3242.28, "end": 3252.36, "text": "noch machen, jetzt ist zu hoch, 70, auch zu hoch, 60, warum schneidet der das denn da"}, {"id": 713, "start": 3252.36, "end": 3272.8, "text": "unten ab, was ist das für, was ist das für ein kacknooper, 18, warum schneidet der das"}, {"id": 714, "start": 3272.8, "end": 3295.8, "text": "ab, will er mich rollen, anzeige ist raus, äh, ok, so, äh, den preis denn der ist nicht"}, {"id": 715, "start": 3295.8, "end": 3303.92, "text": "richtig, nicht richtig ausgerichtet, wahrscheinlich kann ich den ganzen kram jetzt hier wegmachen,"}, {"id": 716, "start": 3303.92, "end": 3327.12, "text": "äh, so, excellent, excellent, das sieht doch jetzt aber schon mal ganz gut aus oder, man"}, {"id": 717, "start": 3327.12, "end": 3336.04, "text": "kann besser also ein kringel da irgendwo nehmen, pacman frister's zeichen, das sieht aber immer"}, {"id": 718, "start": 3336.04, "end": 3350.08, "text": "noch wie ne menge aus, das gefällt mir nicht, ich war, ach, keine ahnung, ich mein wir können"}, {"id": 719, "start": 3350.08, "end": 3369.76, "text": "doch einfach nen timestamp hin machen, und nen progress bar war am besten, ja dann machen"}, {"id": 720, "start": 3369.76, "end": 3375.08, "text": "wir einfach, dann schreiben wir wirklich einfach die zeit hin, kann man ja machen, das ist"}, {"id": 721, "start": 3375.08, "end": 3383.44, "text": "kein ding, dann machen wir das weg, so, dann kann ich nämlich auch diesen ganzen müll"}, {"id": 722, "start": 3383.44, "end": 3403.4, "text": "da unten weg machen, äh, das hab ich jetzt verkackt, warum ist denn das jetzt untereinander,"}, {"id": 723, "start": 3403.4, "end": 3429.24, "text": "das ist doch normalerweise nie untereinander, span sein, ahja, ok, ok, passt, ok, ok, ok,"}, {"id": 724, "start": 3429.24, "end": 3442.68, "text": "alles, was in zeit 38, oh, ich mein wir können da einfach nen timestamp drunter machen, das"}, {"id": 725, "start": 3442.68, "end": 3454.0, "text": "geht, aber letztendlich mal im ernst, interessiert es überhaupt irgendjemand, wann er zuletzt"}, {"id": 726, "start": 3454.0, "end": 3458.52, "text": "abgefragt hat, ich mein es verschwindet halt einfach nach 15 Minuten, eigentlich ist die"}, {"id": 727, "start": 3458.52, "end": 3468.9, "text": "doch wurscht oder? Das reicht doch komplett was da drin steht. Ich kann die Zeit mal neben"}, {"id": 728, "start": 3468.9, "end": 3487.52, "text": "dem preis probieren vielleicht vielleicht etwas andere variante"}, {"id": 729, "start": 3487.52, "end": 3515.86, "text": "das ist das ist ist auch nicht wirklich besser oder? Oder? Ja gut dann lassen wir es erst"}, {"id": 730, "start": 3515.86, "end": 3536.7, "text": "mal so serious marks was meinst du als exzellent frontend expert nicht mehr das"}, {"id": 731, "start": 3536.7, "end": 3541.86, "text": "ist das bei dir sieht das anders aus bei mir im bei bei mir im browser ist es 12"}, {"id": 732, "start": 3541.86, "end": 3548.7, "text": "stunden stimmt wir könnten das wir könnten das nach sekunden wir könnten"}, {"id": 733, "start": 3548.7, "end": 3556.74, "text": "das vorweg wir können hinschreiben vor ich habe die nachricht jetzt gar nicht"}, {"id": 734, "start": 3556.74, "end": 3559.9, "text": "gesehen was habe ich wieder zu was habe ich was zum lachen verpasst"}, {"id": 735, "start": 3559.9, "end": 3572.58, "text": "man könnte wirklich hinter guck mal wenn er wenn er anstatt die zeit stehen würde"}, {"id": 736, "start": 3572.58, "end": 3584.84, "text": "wenn man da einfach hinschreibt wir gucken wir vor vor 13 minuten ist das das"}, {"id": 737, "start": 3584.84, "end": 3596.38, "text": "wäre doch besser oder das das wäre doch das wäre doch eins besser"}, {"id": 738, "start": 3596.38, "end": 3600.82, "text": "jepp"}, {"id": 739, "start": 3605.82, "end": 3609.9, "text": "das ist gut dann machen wir das da gibt es da gibt es doch bestimmt schon"}, {"id": 740, "start": 3609.9, "end": 3618.3, "text": "irgendwas fertig ist um den kram umzurechnen ich meine ich könnte meinen"}, {"id": 741, "start": 3618.3, "end": 3621.82, "text": "timer mein timer progress zu umbauen dass der das dass der das ausrechnet"}, {"id": 742, "start": 3621.82, "end": 3636.02, "text": "weil du brauchst ja einen timer sonst aktualisiert er das nicht na also ich"}, {"id": 743, "start": 3636.02, "end": 3651.78, "text": "mein das ist gar nicht mal so einfach kann das"}, {"id": 744, "start": 3656.06, "end": 3659.78, "text": "also ich meine in sekunden umrechnen ist kein problem"}, {"id": 745, "start": 3659.78, "end": 3669.34, "text": "ok ich ich ich ich ich werde mal mein ich werde mal meinen timer umwursten zu"}, {"id": 746, "start": 3669.34, "end": 3673.18, "text": "was was das anzeigen kann hier"}, {"id": 747, "start": 3678.86, "end": 3682.86, "text": "ich werde mal meinen timer umwursten zu was was das anzeigen kann"}, {"id": 748, "start": 3682.86, "end": 3695.1, "text": "was ist denn jetzt das problem was keck wait was"}, {"id": 749, "start": 3695.58, "end": 3704.7, "text": "was das hatte ich doch eben drinnen es all oder die bin die klärt"}, {"id": 750, "start": 3704.7, "end": 3711.78, "text": "moment importierst du es mehrfach"}, {"id": 751, "start": 3713.5, "end": 3719.74, "text": "warum das denn wo kommt das auf einmal her"}, {"id": 752, "start": 3719.74, "end": 3737.74, "text": "ne hab ich da gemacht war das auto im das ja das war auto import auto import"}, {"id": 753, "start": 3737.74, "end": 3744.58, "text": "scheint nicht so clever zu sein ok so jetzt jetzt wurscht jetzt wusste ich"}, {"id": 754, "start": 3744.58, "end": 3749.94, "text": "nehme ich dieses dieses um diesen timer um zu einfach nur texte hinten dran"}, {"id": 755, "start": 3749.94, "end": 3756.66, "text": "steht so time out also der ganze mist kommt weg"}, {"id": 756, "start": 3756.66, "end": 3762.86, "text": "alle was mit der musik los eigentlich gerade im hintergrund das ist ja absolut"}, {"id": 757, "start": 3762.86, "end": 3773.14, "text": "monach es muss ich so irgendwie ich muss ich muss man hätte sein ein kloten ich"}, {"id": 758, "start": 3773.14, "end": 3776.34, "text": "höre mich auf der linken seite nicht mehr"}, {"id": 759, "start": 3786.3, "end": 3794.1, "text": "so es passt für die richtige agile arbeitsgruppe hier im chat wieder ok"}, {"id": 760, "start": 3794.1, "end": 3800.34, "text": "jetzt kommt dieses progress ding weg und wir schreiben da einfach nur noch genau"}, {"id": 761, "start": 3800.34, "end": 3805.54, "text": "so also diese die minuten habe ich schon die minuten habe ich die sekunden habe"}, {"id": 762, "start": 3805.54, "end": 3807.78, "text": "ich auch"}, {"id": 763, "start": 3810.34, "end": 3814.86, "text": "das ist gar nicht so einfach das umzuwandeln"}, {"id": 764, "start": 3814.86, "end": 3819.42, "text": "doch gibt es doch bestimmt schon irgendwas fertig ist für"}, {"id": 765, "start": 3819.42, "end": 3828.22, "text": "j.s. convert time to time ago oder so"}, {"id": 766, "start": 3828.22, "end": 3850.54, "text": "weil die sekunden habe ich ja also mit sekunden ist es einfach mit sekunden"}, {"id": 767, "start": 3850.54, "end": 3859.54, "text": "ist es einfach schreibe ich aber vor sekunden so fertig"}, {"id": 768, "start": 3859.54, "end": 3876.42, "text": "ach so start gleich also in sekunden ist das einfach"}, {"id": 769, "start": 3876.42, "end": 3891.98, "text": "ups aber das müsste man jetzt umrechnen gibt es eigentlich ein format für oder"}, {"id": 770, "start": 3891.98, "end": 3902.58, "text": "so hat das ja ja was gibt auch bestimmt irgendwie so ein so ein so ein format"}, {"id": 771, "start": 3902.58, "end": 3908.1, "text": "time format string gedöns oder ich meine das ist auf jeden fall schon mal schon"}, {"id": 772, "start": 3908.1, "end": 3934.1, "text": "mal besser ok j.s. format string time"}, {"id": 773, "start": 3934.1, "end": 3938.58, "text": "wie das muss doch so was haben das hat doch alles"}, {"id": 774, "start": 3941.62, "end": 3947.22, "text": "ich mache da jetzt nicht moment j.s. rein nur für sie für sowas"}, {"id": 775, "start": 3947.82, "end": 3953.86, "text": "wie das muss doch format"}, {"id": 776, "start": 3953.86, "end": 3966.5, "text": "das muss doch sowas haben to local time string das das habe ich glaube ich auch"}, {"id": 777, "start": 3966.5, "end": 3977.82, "text": "schon mal verwendet das options genau options time so ein aus format matcher"}, {"id": 778, "start": 3977.82, "end": 3985.18, "text": "alter warum ist das so ultra kompliziert in java script wieder was ist denn hier los"}, {"id": 779, "start": 3985.18, "end": 4010.22, "text": "ok ok das ist java script kompliziert aber es scheint zu funktionieren also"}, {"id": 780, "start": 4010.22, "end": 4019.62, "text": "also also ok das heißt monka es also also also wie jetzt keck keck wait also"}, {"id": 781, "start": 4019.62, "end": 4040.74, "text": "moment mal also time ist die musik wills auch gerade wissen time so jetzt haben wir"}, {"id": 782, "start": 4040.74, "end": 4052.74, "text": "chat im weg schon so hier datetime"}, {"id": 783, "start": 4052.74, "end": 4056.34, "text": "chat ich blende euch aus hier guckt mal jetzt könnt ihr zugucken"}, {"id": 784, "start": 4056.34, "end": 4062.34, "text": "ich blende euch nicht aus also das ist detail und was muss man da jetzt machen"}, {"id": 785, "start": 4062.34, "end": 4074.78, "text": "monka es options alter was zum"}, {"id": 786, "start": 4074.78, "end": 4097.94, "text": "nicht spanien de de ok ok ok so und jetzt will ich will es ich will es eigentlich"}, {"id": 787, "start": 4097.94, "end": 4102.02, "text": "gar nicht will überhaupt kein day ich will eigentlich nur minute und so"}, {"id": 788, "start": 4102.02, "end": 4115.54, "text": "formatieren minute so kann man kann man kann man das aus"}, {"id": 789, "start": 4132.02, "end": 4139.54, "text": "wenn ich zu lokal times kann man da sagen falls oder so was dass er das"}, {"id": 790, "start": 4139.54, "end": 4142.18, "text": "weglässt"}, {"id": 791, "start": 4149.38, "end": 4154.62, "text": "aber wenn man das nicht angibt dann ist es weg oder was"}, {"id": 792, "start": 4154.62, "end": 4162.98, "text": "oh moment ich bin übelst verwirrt da fuck ich muss es ja vorher ich mein ich"}, {"id": 793, "start": 4162.98, "end": 4167.62, "text": "muss es ja vorher voneinander abziehen auch noch ich will es ja gar nicht ich"}, {"id": 794, "start": 4167.62, "end": 4173.66, "text": "will ja ich will ja new ich will ja datetime now minus date aber das geht"}, {"id": 795, "start": 4173.66, "end": 4180.78, "text": "ja nicht ah wie ziehe ich in java script zwei zwei zeiten voneinander ab"}, {"id": 796, "start": 4180.78, "end": 4188.82, "text": "wozu schreiben wir hier was hier das da guck mal preis preis tracker habe ich"}, {"id": 797, "start": 4188.82, "end": 4195.22, "text": "erweitert an java script macht mich fertig ok man kann also man zwei dates"}, {"id": 798, "start": 4195.22, "end": 4199.9, "text": "kann man nicht voneinander abziehen js subtract date da muss es doch"}, {"id": 799, "start": 4199.9, "end": 4210.74, "text": "irgendwas geben autos abt ein bisschen was neueres please get time und das dann"}, {"id": 800, "start": 4210.74, "end": 4218.18, "text": "voneinander ok ok also get time"}, {"id": 801, "start": 4221.54, "end": 4225.02, "text": "moment das habe ich doch hier oben schon gemacht"}, {"id": 802, "start": 4225.02, "end": 4232.9, "text": "get time ist millisekunden seit 1970 beta.preischepp.org"}, {"id": 803, "start": 4236.02, "end": 4242.46, "text": "jetzt kann ich natürlich nicht mehr formatieren alter das ist mir zu dumm"}, {"id": 804, "start": 4245.62, "end": 4248.66, "text": "ich meine ich habe ja so gekam hier schon programmiert so das ist das ist"}, {"id": 805, "start": 4248.66, "end": 4255.06, "text": "für sekunden das sind die sekunden das kann ich eigentlich schon mal verwenden"}, {"id": 806, "start": 4255.06, "end": 4260.14, "text": "kann ich jetzt aus den sekunden neu ins neues date machen geht das irgendwie"}, {"id": 807, "start": 4260.14, "end": 4266.82, "text": "es geht bestimmt das geht bestimmt das probiere ich jetzt aus ok new date aus"}, {"id": 808, "start": 4266.82, "end": 4269.42, "text": "den sekunden"}, {"id": 809, "start": 4270.9, "end": 4277.86, "text": "aha das das sieht das sieht sogar schon mal ganz gut aus das sieht sogar schon"}, {"id": 810, "start": 4277.86, "end": 4280.86, "text": "mal ganz brauchbar aus"}, {"id": 811, "start": 4287.62, "end": 4290.62, "text": "eins"}, {"id": 812, "start": 4298.42, "end": 4305.38, "text": "ach man kann er einfach man kann er ernsthaft to string machen das geht"}, {"id": 813, "start": 4305.38, "end": 4308.58, "text": "moment wenn es so einfach ist"}, {"id": 814, "start": 4308.58, "end": 4319.54, "text": "hey quake so einfach ist es nicht ok aber aber ich copy paste jetzt mal den"}, {"id": 815, "start": 4319.54, "end": 4323.58, "text": "chat ich glaube passt jetzt mal den chat"}, {"id": 816, "start": 4323.58, "end": 4339.9, "text": "chat easy ich glaube ich das jetzt einfach mal gucken ob ich jebaited"}, {"id": 817, "start": 4339.9, "end": 4366.02, "text": "werde geht nicht easy aber man muss dann bestimmt"}, {"id": 818, "start": 4366.02, "end": 4373.38, "text": "clear time is not a function siehste der chat jebaited mich"}, {"id": 819, "start": 4378.26, "end": 4384.5, "text": "und add seconds geht wahrscheinlich auch nicht ich will eine sekundenanzahl"}, {"id": 820, "start": 4384.5, "end": 4393.54, "text": "umwandeln in minute sekunde mit javascript build ins ich will da nicht"}, {"id": 821, "start": 4393.54, "end": 4400.38, "text": "anfangen mit wenn größer als 60 dann eine minute dazu und sowas"}, {"id": 822, "start": 4400.38, "end": 4405.06, "text": "da muss eigentlich was eingebautes für geben was hier das was da in den chat"}, {"id": 823, "start": 4405.06, "end": 4408.06, "text": "gepostet hat ging schon mal"}, {"id": 824, "start": 4408.06, "end": 4423.14, "text": "wie gesagt das js epoch to date wie geht das"}, {"id": 825, "start": 4427.98, "end": 4430.98, "text": "kann man kann man nicht"}, {"id": 826, "start": 4430.98, "end": 4440.5, "text": "what oh jetzt wird es wahnsinn alter der chat der chat will es wissen jetzt"}, {"id": 827, "start": 4440.5, "end": 4444.26, "text": "passt auf ok"}, {"id": 828, "start": 4448.26, "end": 4451.18, "text": "jetzt jetzt bin ich mal gespannt ob das funktioniert leute"}, {"id": 829, "start": 4451.18, "end": 4462.66, "text": "beim easy also moment javascript logik moment das was ich gemacht habe war doch"}, {"id": 830, "start": 4462.66, "end": 4467.5, "text": "gar nicht so verkehrt das war sich so gemacht was ich so gemacht hat war doch"}, {"id": 831, "start": 4467.5, "end": 4473.46, "text": "gar nicht verkehrt warum geht warum ging das bei mir nicht das ist doch mehr oder"}, {"id": 832, "start": 4473.46, "end": 4482.86, "text": "weniger fast das gleiche wartet mal"}, {"id": 833, "start": 4484.38, "end": 4488.34, "text": "hätte ich das mal 1000 rechnen müssen"}, {"id": 834, "start": 4490.34, "end": 4496.26, "text": "das ist milliseconds das ist nicht sekunden seit 1970 das in millisekunden"}, {"id": 835, "start": 4496.26, "end": 4512.5, "text": "seit 1970 alter wo kommt da überhaupt die stunde her jetzt wo kommt da wo kommt"}, {"id": 836, "start": 4512.5, "end": 4517.38, "text": "wo kommt da jetzt wo genau kommt da die stunde her"}, {"id": 837, "start": 4517.38, "end": 4529.14, "text": "so und jetzt options adi zeitzone das wird da macht auch noch zeitzonen"}, {"id": 838, "start": 4529.14, "end": 4536.62, "text": "geschiss ok bei minuten interessiert uns das mit zeitzeitzonen natürlich nicht"}, {"id": 839, "start": 4536.62, "end": 4557.86, "text": "ok also wie der man nicht kann man jetzt sagen aber ok aber kann ich jetzt"}, {"id": 840, "start": 4557.86, "end": 4562.94, "text": "einfach minutes was ist wenn ich das weglasse"}, {"id": 841, "start": 4562.94, "end": 4569.1, "text": "der macht immer die fucking stunde dahin aber to time string bringt an sich"}, {"id": 842, "start": 4569.1, "end": 4577.5, "text": "an nichts kann man da auch optionen übergeben kann man da options übergeben"}, {"id": 843, "start": 4580.54, "end": 4584.1, "text": "kann man da options über geht"}, {"id": 844, "start": 4584.1, "end": 4593.02, "text": "ne warum kann man ach so einfach nur options ja ja war script ich check die"}, {"id": 845, "start": 4593.02, "end": 4597.14, "text": "logik nicht warum kann ich bei local time string was übergeben und bei"}, {"id": 846, "start": 4597.14, "end": 4599.9, "text": "was"}, {"id": 847, "start": 4603.74, "end": 4604.94, "text": "wo ist denn jetzt das problem"}, {"id": 848, "start": 4604.94, "end": 4612.22, "text": "nehmen doch einfach eine fertig ich habe doch schon was was funktioniert aber ich"}, {"id": 849, "start": 4612.22, "end": 4617.14, "text": "will nur wissen was wie weit ich da jetzt davon entfernt war das aber ist"}, {"id": 850, "start": 4617.14, "end": 4623.22, "text": "noch die feind ach so ok ja ja gefahrt"}, {"id": 851, "start": 4627.78, "end": 4630.38, "text": "und"}, {"id": 852, "start": 4630.38, "end": 4639.7, "text": "ja quä kann man da options übergeben das"}, {"id": 853, "start": 4646.06, "end": 4647.06, "text": "macht mich fertig"}, {"id": 854, "start": 4647.06, "end": 4654.26, "text": "wobei das was was der was der chat verwendet ist eigentlich noch besser"}, {"id": 855, "start": 4654.26, "end": 4668.26, "text": "das kann er jetzt sein und ich will einfach keine stunde anzeigen warum"}, {"id": 856, "start": 4668.26, "end": 4675.18, "text": "haben wir nicht einfach mit dem time format ding ist das ist ist das zu zu"}, {"id": 857, "start": 4675.18, "end": 4680.26, "text": "high level für für java script leute oder wie ok auch man kann auch nicht"}, {"id": 858, "start": 4680.26, "end": 4685.86, "text": "einfach null schreiben dass das weglässt oder ne das geht nicht"}, {"id": 859, "start": 4690.78, "end": 4696.54, "text": "meinst du wenn ich aber wenn ich da minutes angebe"}, {"id": 860, "start": 4699.66, "end": 4704.14, "text": "so nicht verfunktionieren so ich nehme jetzt das was der chat gepostet hat"}, {"id": 861, "start": 4704.14, "end": 4713.98, "text": "excellent und dann ist gut einfach so zack gut ist ich nehme einfach das was"}, {"id": 862, "start": 4713.98, "end": 4717.42, "text": "der was der was der chat was der chat geschrieben hat chat chat kennt sich aus"}, {"id": 863, "start": 4717.42, "end": 4722.7, "text": "wissen wir excellent chat immer excellent drauf der chat"}, {"id": 864, "start": 4722.7, "end": 4734.5, "text": "excellent timer timer da brauche ich noch was anderes dafür irgendwie go oder so das"}, {"id": 865, "start": 4734.5, "end": 4741.14, "text": "ist bestimmt ein string der da zurückkommt das go gleich"}, {"id": 866, "start": 4741.14, "end": 4743.14, "text": "ja"}, {"id": 867, "start": 4751.02, "end": 4757.66, "text": "moment warum ist der warum ist da 00 warum ist moment moment moment von da"}, {"id": 868, "start": 4757.66, "end": 4767.14, "text": "muss ich bestimmt später anfangen 13 oder so ja 14 und dann irgendwie nur 4 5"}, {"id": 869, "start": 4767.14, "end": 4772.5, "text": "aber das funktioniert doch auch nur ok wartet mal wenn die erste zahl null wird"}, {"id": 870, "start": 4772.5, "end": 4785.66, "text": "ob das dann auch funktioniert ok ok nice nice ok alles klar excellent"}, {"id": 871, "start": 4791.38, "end": 4795.5, "text": "mit minute oder ohne ich glaube die die einheit können wir uns sogar schenken"}, {"id": 872, "start": 4795.5, "end": 4802.5, "text": "weil die meisten leute das checken wenn sie das so sehen glaubt das kann man so"}, {"id": 873, "start": 4802.5, "end": 4805.78, "text": "lassen wie es jetzt ist wie lange haben wir jetzt an dem scheiß rumgemacht"}, {"id": 874, "start": 4805.78, "end": 4809.66, "text": "sorry ich hab falls ich irgendwelche subs übersehen hab muss mich gerade über"}, {"id": 875, "start": 4809.66, "end": 4838.06, "text": "ja fast krebt pp gar die zeiten zählen runter da stimmt was nicht sekunde"}, {"id": 876, "start": 4838.06, "end": 4842.62, "text": "das falsch rum das falsch rum wartet mal aber das lässt sich glaube ich einfach"}, {"id": 877, "start": 4842.62, "end": 4844.94, "text": "fixen"}, {"id": 878, "start": 4857.66, "end": 4860.66, "text": "aha"}, {"id": 879, "start": 4860.66, "end": 4866.26, "text": "so"}, {"id": 880, "start": 4871.82, "end": 4877.38, "text": "das ist das gefällt mir das hat doch was oder finde ich auch das doch schick nur"}, {"id": 881, "start": 4877.38, "end": 4882.62, "text": "dass es nicht richtig allein ist aber das ist in ordnung so lassen wir das"}, {"id": 882, "start": 4882.62, "end": 4886.54, "text": "alles gut bevor ich habe kein bock mehr da weiter dran rum zu machen wir allein"}, {"id": 883, "start": 4886.54, "end": 4898.94, "text": "ist noch mal kurz die die currency richtig"}, {"id": 884, "start": 4898.94, "end": 4902.98, "text": "warum allein das nicht"}, {"id": 885, "start": 4902.98, "end": 4918.94, "text": "warum allein sich das nicht jetzt was ist hier los ist das ist das vielleicht"}, {"id": 886, "start": 4918.94, "end": 4926.54, "text": "das hat es refresh nicht gecheckt warum allein sich das jetzt nicht mehr eben"}, {"id": 887, "start": 4926.54, "end": 4934.3, "text": "ging es auch noch ich krieg anfälle excellent frontend kann ich einfach"}, {"id": 888, "start": 4934.3, "end": 4936.58, "text": "sagen"}, {"id": 889, "start": 4945.9, "end": 4950.02, "text": "dann wenn sich das nicht allein dann mache ich einfach das das ding hoch und"}, {"id": 890, "start": 4950.02, "end": 4958.82, "text": "gut ist das allein sich einfach gar nicht was hat kein bock mehr ist dem"}, {"id": 891, "start": 4958.82, "end": 4964.06, "text": "vollkommen egal kann ich auch wegschmeißen was ist das ist margin"}, {"id": 892, "start": 4964.06, "end": 4969.7, "text": "right margin bottom margin left aber so ist ok ich fasse es nicht wahr leute so"}, {"id": 893, "start": 4969.7, "end": 4976.78, "text": "bleibt es jetzt schluss so so so bleibt es jetzt fertig so das update machen"}, {"id": 894, "start": 4976.78, "end": 4982.74, "text": "noch auf eine sekunde hoch dann sieht es ein bisschen gewollter aus so sehr"}, {"id": 895, "start": 4982.74, "end": 4986.14, "text": "schön soll ich bin mir noch nicht so ganz sicher was mit dem graf mache"}, {"id": 896, "start": 4986.14, "end": 4990.94, "text": "übrigens wisst ihr wisst ihr was ich mir überlegt habe ja das sieht viel"}, {"id": 897, "start": 4990.94, "end": 4994.74, "text": "cooler aus oder wenn es die sekunde wenn es die sekunde braucht dann sieht es"}, {"id": 898, "start": 4994.74, "end": 4997.86, "text": "dann habt ihr es gerade gesehen in sekunde sieht das viel gewollter aus die"}, {"id": 899, "start": 4997.86, "end": 5005.54, "text": "animation so was ist welche umfrage ich habe es nicht gesehen exquisite umfrage"}, {"id": 900, "start": 5005.54, "end": 5009.54, "text": "was was gibt es für eine umfrage"}, {"id": 901, "start": 5009.54, "end": 5027.34, "text": "eine umfrage vorgeschlagen umfrage ja was für eine umfrage"}, {"id": 902, "start": 5027.34, "end": 5039.22, "text": "ah könnte man ja hier habe ich habe ich"}, {"id": 903, "start": 5039.22, "end": 5062.38, "text": "alter chat also eine umfrage vorschlagen könnte man in den grafen für den"}, {"id": 904, "start": 5062.38, "end": 5066.1, "text": "preisverlauf noch einen balken für den uvp machen damit man preis besser"}, {"id": 905, "start": 5066.1, "end": 5070.66, "text": "einschätzen kann ja das haben das haben wir uns letztes mal auch schon überlegt"}, {"id": 906, "start": 5070.66, "end": 5077.34, "text": "ob man das machen kann aber das ding ist schon ganz schön ganz schön beladen"}, {"id": 907, "start": 5077.34, "end": 5085.14, "text": "also sprich die uvp könnte man entweder wie könnte man das machen"}, {"id": 908, "start": 5087.7, "end": 5092.1, "text": "also eigentlich mein ursprünglicher plan war das bild ändert sich je nach"}, {"id": 909, "start": 5092.1, "end": 5097.1, "text": "abweichung zum uvp das das das fängt dann an wenn es wenn es richtig billig"}, {"id": 910, "start": 5097.1, "end": 5102.66, "text": "ist wenn es richtig billig ist fängt es dann fängt es dann irgendwie so an"}, {"id": 911, "start": 5102.66, "end": 5107.5, "text": "über so und hört dann irgendwie so auf oder so"}, {"id": 912, "start": 5107.5, "end": 5119.1, "text": "und kein preis kein preis kriegt ein anderes emote moment wartet mal price"}, {"id": 913, "start": 5119.1, "end": 5134.26, "text": "was klatter balken ins diagramm hier oben balken"}, {"id": 914, "start": 5134.26, "end": 5149.38, "text": "aber aber solche balken rein machen das sieht doch so viel besser aus als mit"}, {"id": 915, "start": 5149.38, "end": 5157.02, "text": "einem balken ach so uvp so ein ding das ist eine gute idee das gefällt mir das"}, {"id": 916, "start": 5157.02, "end": 5163.42, "text": "ist nice das das das müssen wir mal gucken wie man das macht ich habe keine"}, {"id": 917, "start": 5163.42, "end": 5166.26, "text": "ahnung wie das geht das ist chargers ich habe einfach"}, {"id": 918, "start": 5166.26, "end": 5170.7, "text": "einen statisches statischen kraft drin aktuell"}, {"id": 919, "start": 5178.58, "end": 5182.7, "text": "das geht das geht garantiert das geht"}, {"id": 920, "start": 5182.7, "end": 5186.9, "text": "ja"}, {"id": 921, "start": 5189.9, "end": 5192.3, "text": "was ich muss ein plugin verwenden dafür"}, {"id": 922, "start": 5198.7, "end": 5199.3, "text": "ernsthaft"}, {"id": 923, "start": 5206.5, "end": 5210.86, "text": "kann doch nicht sein das geht garantiert auch so ohne ohne plugin"}, {"id": 924, "start": 5210.86, "end": 5216.78, "text": "also das ist data"}, {"id": 925, "start": 5222.42, "end": 5227.22, "text": "wir machen einfach ein zweites data set rein was was einfach"}, {"id": 926, "start": 5227.22, "end": 5237.46, "text": "was einfach nur so geht passt mal auf das kann man bestimmt machen data set"}, {"id": 927, "start": 5237.46, "end": 5248.14, "text": "und jetzt einfach irgendwie eins was die ganzen zeit nur so geht ja easy border"}, {"id": 928, "start": 5248.14, "end": 5255.26, "text": "eins by the way warum also was ist und was ist in der uvp 1500"}, {"id": 929, "start": 5255.26, "end": 5273.02, "text": "zu schnell copy pasted kann er das nicht automatisch extenden muss ich da wirklich"}, {"id": 930, "start": 5273.02, "end": 5277.86, "text": "für jeden punkt ein angeben ich will diesen diesen diesen huppel hier aber"}, {"id": 931, "start": 5277.86, "end": 5286.62, "text": "weg haben falls das soll nicht gefilmt werden das soll gefilmt"}, {"id": 932, "start": 5286.62, "end": 5310.78, "text": "aber wie kriege ich da die die knubbel weg aber bei spiel ist ein schon mal ganz"}, {"id": 933, "start": 5310.78, "end": 5321.66, "text": "gut ja preis es ist nicht preis es ist uvp das ist eine richtig coole idee leute"}, {"id": 934, "start": 5321.66, "end": 5325.62, "text": "aber der graf ist halt eh statisch wir haben die die infos habe ich noch gar"}, {"id": 935, "start": 5325.62, "end": 5329.58, "text": "nicht ich habe die infos aber das gute ist ich kann das jederzeit füllen ich"}, {"id": 936, "start": 5329.58, "end": 5335.62, "text": "habe nämlich die infos in der datenbank stehen elements radius point excellent"}, {"id": 937, "start": 5335.62, "end": 5350.26, "text": "der chat kennst damit aus ups nein aber fast aber fast oder oder nee wohin wohin"}, {"id": 938, "start": 5350.26, "end": 5352.66, "text": "damit"}, {"id": 939, "start": 5352.66, "end": 5360.74, "text": "was ist das point radius null"}, {"id": 940, "start": 5368.74, "end": 5370.82, "text": "ich hab von der library kein plastenschimmer"}, {"id": 941, "start": 5370.82, "end": 5381.98, "text": "ups ich muss aber richtig schreiben können ne ne ne so auch nicht in die options ja"}, {"id": 942, "start": 5381.98, "end": 5386.06, "text": "aber wo sind die options gibt es also gibt options so was"}, {"id": 943, "start": 5386.06, "end": 5402.94, "text": "fast und ne dann gilt ja für alle für alle will ich das nicht für alle ist das doof ich"}, {"id": 944, "start": 5402.94, "end": 5417.74, "text": "muss mal googeln ja ok moment halt points in kraft das ist ja nur für einen moment"}, {"id": 945, "start": 5417.74, "end": 5425.82, "text": "ist das ja das ist global you can set point radius aha aha siehste so geht das"}, {"id": 946, "start": 5425.82, "end": 5438.82, "text": "also so geht das ist einfach mal google google magic gemacht nice"}, {"id": 947, "start": 5444.22, "end": 5447.74, "text": "so und wisst ihr was wir jetzt machen wir nehmen jetzt die gleiche linie wie oben im"}, {"id": 948, "start": 5447.74, "end": 5467.54, "text": "header ich gebe dir header alter das ist auch das gefällt mir das schick oder heute jetzt"}, {"id": 949, "start": 5467.54, "end": 5472.42, "text": "jetzt habe ich eine idee habe ich einen color picker habe ich einen color picker was ist"}, {"id": 950, "start": 5472.42, "end": 5486.5, "text": "ein guter color picker für linux color picker color picker e color color 3 excellent ich"}, {"id": 951, "start": 5486.5, "end": 5504.26, "text": "baue irgendwas was mit knorrm keyring ok was auch immer der alles damit installiert ok"}, {"id": 952, "start": 5504.26, "end": 5531.3, "text": "e color picker so und wie pick ich jetzt color wie funst das geht das nicht der scheiß kronbst"}, {"id": 953, "start": 5531.3, "end": 5538.98, "text": "ich hätte erwartet ich klicke da drauf und dann kann ich was was was color kram aber ich"}, {"id": 954, "start": 5538.98, "end": 5550.86, "text": "glaube das geht nicht oder die da sind noch das problem ist dass das gnome zeug geht nicht"}, {"id": 955, "start": 5550.86, "end": 5558.9, "text": "wenn wenn kein chrome gestartet ist glaube ich mal je color alles wieder entfernen davon"}, {"id": 956, "start": 5558.9, "end": 5567.86, "text": "jetzt sofort ok ich meine wir könnten winnows color picker in die vm also die 3m color picker"}, {"id": 957, "start": 5567.86, "end": 5577.7, "text": "was gibt's was gibt's für einen guten firefox color picker color picker was ist das fage"}, {"id": 958, "start": 5577.7, "end": 5585.62, "text": "ok das brauche ich fage"}, {"id": 959, "start": 5592.1, "end": 5603.26, "text": "geht das geht das unter i3 if you use x color picker ok ok den benutzen wir von excellent"}, {"id": 960, "start": 5603.26, "end": 5609.58, "text": "ist ja seht ihr mal für manche sachen sind nur linux gar nicht so einfach hallo was ist"}, {"id": 961, "start": 5609.58, "end": 5616.58, "text": "das problem color picker ja welcher color picker davon ist der richtige click on a pixel on"}, {"id": 962, "start": 5616.58, "end": 5631.66, "text": "your screen das scheint der richtige zu sein einfach schnell ein ruby programmieren ich"}, {"id": 963, "start": 5631.66, "end": 5646.42, "text": "hätte euch das erzählen soll color wo ist er da ist er ok das scheint zu funktionieren"}, {"id": 964, "start": 5646.42, "end": 5652.98, "text": "warum ist das jetzt nicht bei meinen programm zum starten drin alter das kann jetzt nicht"}, {"id": 965, "start": 5652.98, "end": 5656.5, "text": "euer ernst sein dass ich das jetzt über das terminal starten soll dass ich das nicht als"}, {"id": 966, "start": 5656.5, "end": 5663.06, "text": "normale desktop anwendung registriert hat oder ok also was ich machen wollte ich wollte"}, {"id": 967, "start": 5663.06, "end": 5671.22, "text": "mit den color pick den hier picken und jetzt in dem in dem craft den keks mund color verwenden"}, {"id": 968, "start": 5671.22, "end": 5681.1, "text": "für den craft das doch nice oder so muss das sein und ich hab mir auch überlegt ob"}, {"id": 969, "start": 5681.1, "end": 5696.9, "text": "wir nicht die alerts ob wir nicht die alerts auch in so einer farbe machen alerts ja alert"}, {"id": 970, "start": 5696.9, "end": 5715.54, "text": "nicht verfügbar color kein preis bild ändern ja das müssen wir noch machen ich meine das"}, {"id": 971, "start": 5715.54, "end": 5723.74, "text": "hat ein bisschen besseren kontrast aber jetzt so viel besser ist bin ich mir nicht so sicher"}, {"id": 972, "start": 5723.74, "end": 5740.82, "text": "zumal an dem keks nix grünes ist das sieht kacke aus"}, {"id": 973, "start": 5740.82, "end": 5744.98, "text": "für nicht verfügbar keckweight ersetzen ne nicht verfügbar zeigt der da drin gar nicht"}, {"id": 974, "start": 5744.98, "end": 5749.62, "text": "an wir lassen es jetzt erstmal so wir wollen die"}, {"id": 975, "start": 5749.62, "end": 5756.42, "text": "Leute nicht zu sehr verwirren so notifications geht immer noch wunderbar ok kein preis haben"}, {"id": 976, "start": 5756.42, "end": 5763.94, "text": "wir hier angezeigt also da gehen wir nochmal in dialog avatar so das können wir zumindest"}, {"id": 977, "start": 5763.94, "end": 5783.82, "text": "mal einbauen also wenn ja ja das jetzt ein bisschen viel kacke weh if preis kleiner null"}, {"id": 978, "start": 5783.82, "end": 5786.62, "text": "wobei was mache ich denn warum kopiere ich denn das ganze reicht auch wenn ich das image"}, {"id": 979, "start": 5786.62, "end": 5790.42, "text": "wenn ich das auf dem image mache reicht auch wenn ich das auf dem image mache ich muss"}, {"id": 980, "start": 5790.42, "end": 5798.82, "text": "doch gar nicht das ganze ding hallo ich will es hier copy pasten alert sound muss den browser"}, {"id": 981, "start": 5798.82, "end": 5816.54, "text": "ändern das kannst du da nicht machen so jetzt kacke weight das wird nice ok ffz kacke weight"}, {"id": 982, "start": 5816.54, "end": 5833.98, "text": "ist auch in groß aber immer angst wenn ich auf google bilder suche gehe dass da irgendwas"}, {"id": 983, "start": 5833.98, "end": 5860.82, "text": "falsch rum falsch rum leute das ist nice das gefällt mir ich kann sound auf einer seite"}, {"id": 984, "start": 5860.82, "end": 5867.5, "text": "abspielen das funktioniert mobile nicht und das mag eigentlich keiner wenn die seite irgendwelche"}, {"id": 985, "start": 5867.5, "end": 5880.94, "text": "sounds abspielt macht das lieber über die notifications ich weil oder how to play sound"}, {"id": 986, "start": 5880.94, "end": 5893.9, "text": "und website ich weiß gar nicht wie das geht also man muss jetzt hinterlegen und dann einfach"}, {"id": 987, "start": 5893.9, "end": 5908.46, "text": "play ok der sound kommt ja nur wenn du notifications angemacht hast aber ganz ehrlich das braucht"}, {"id": 988, "start": 5908.46, "end": 5913.06, "text": "man nicht die desktop notifications machen auch ein bimm und da kann es jeder einstellen"}, {"id": 989, "start": 5913.06, "end": 5920.94, "text": "eigentlich eigentlich ist das sinniger ich glaube wir bauen noch keinen sound ein ok"}, {"id": 990, "start": 5920.94, "end": 5933.86, "text": "kacke weight so wir schreiben jetzt noch hier hinter das popup bevor ich das pushe und ihr"}, {"id": 991, "start": 5933.86, "end": 5941.78, "text": "das ausprobieren könnt hinter das popup schreibe ich jetzt noch in arbeit dass man weiß dass"}, {"id": 992, "start": 5941.78, "end": 5960.98, "text": "es noch nicht funktioniert aber ich finde sie schon mal cool aus platzhalter so alles"}, {"id": 993, "start": 5960.98, "end": 5978.54, "text": "klar so was müssen wir jetzt noch machen lassen wir überlegen ach ja ich habe eine"}, {"id": 994, "start": 5978.54, "end": 5984.64, "text": "sache könnte man noch echt cool machen hier oben da zeigt jetzt überall so eine gpu an"}, {"id": 995, "start": 5984.64, "end": 5991.5, "text": "wir könnten es dynamisch machen dass der gpu anzeigt und bei der konsole dass da bei der"}, {"id": 996, "start": 5991.5, "end": 5998.58, "text": "konsole sogar anzeigt eine konsole halt ne oder zumindest irgendwas was so ähnlich aussieht"}, {"id": 997, "start": 5998.58, "end": 6005.86, "text": "wie eine konsole gibt es da gibt es dann schönes bild für konsole controller oder sowas ja"}, {"id": 998, "start": 6005.86, "end": 6019.3, "text": "an die konsole controller ja dann zeigen wir so gamepad an super nintendo wo es ist eine"}, {"id": 999, "start": 6019.3, "end": 6025.82, "text": "mischung aus dem super nintendo dem ns controller moment stadia gibt es ein stadia icon da"}, {"id": 1000, "start": 6025.82, "end": 6036.46, "text": "seht ihr mal die kacke google selber stadia findet die hat noch nicht mal ein stadia icon"}, {"id": 1001, "start": 6036.46, "end": 6042.46, "text": "gemacht wenn die digger sind von google plus ein paar community addons aber zum größten"}, {"id": 1002, "start": 6042.46, "end": 6055.5, "text": "teil ist es google also es gibt kein xbox control das macht nichts die kriegen gleich"}, {"id": 1003, "start": 6055.5, "end": 6061.06, "text": "ein controller so das müssen wir jetzt bloß noch mal einstellen dass es auch tut erst"}, {"id": 1004, "start": 6061.06, "end": 6064.14, "text": "einmal müssen wir hier unsere übrigens unsere beschreibung fixen die stimmt ja nur für"}, {"id": 1005, "start": 6064.14, "end": 6070.38, "text": "grafikkarten also wie heißen die reisen dinger richtig amd reisen hier ist die richtige bezeichnung"}, {"id": 1006, "start": 6070.38, "end": 6092.98, "text": "von den dinger amd reisen alter lass mich copy so so so heißt es richtig amd reisen"}, {"id": 1007, "start": 6092.98, "end": 6099.58, "text": "5 5600 so sagt mir wenn ich misst machen der hier heißt wahrscheinlich genauso mit 8000"}, {"id": 1008, "start": 6099.58, "end": 6103.22, "text": "und der heißt wahrscheinlich genauso mit 9000 und der heißt wahrscheinlich genauso mit"}, {"id": 1009, "start": 6103.22, "end": 6111.62, "text": "9050 der heißt nicht x oder der heißt 9 der heißt der heißt wirklich 5950 ohne x vergessen"}, {"id": 1010, "start": 6111.62, "end": 6137.22, "text": "wo ist nix wo ist nix wo muss nix hin echt ich"}, {"id": 1011, "start": 6137.22, "end": 6150.54, "text": "x x"}, {"id": 1012, "start": 6150.54, "end": 6159.9, "text": "was sind das jetzt eigentlich für einer das sind siebener oder was das ist auch wieder"}, {"id": 1013, "start": 6159.9, "end": 6176.7, "text": "ein x dahinter das ist ein 7 7 x und das ist nun 9 x und ist das auch den neuen x oder"}, {"id": 1014, "start": 6176.7, "end": 6188.14, "text": "ist das einfach nur ohne x letztes auch x alles klar excellent so und die dinger heißen"}, {"id": 1015, "start": 6188.14, "end": 6217.82, "text": "dann so amd ich glaube so heißt wenn man ganz ganz"}, {"id": 1016, "start": 6217.82, "end": 6231.82, "text": "korrekt ist so so und der hier wahrscheinlich ohne xt und der hier mit 9 xt so sony gut das"}, {"id": 1017, "start": 6231.82, "end": 6239.34, "text": "ist einfach sony plays ich kann immer schreiben plastics playstation 5 das schreibt man glaube"}, {"id": 1018, "start": 6239.34, "end": 6252.22, "text": "ich zusammen playstation 5 wie nennt man die classic wie heißt die heißt die classic edition"}, {"id": 1019, "start": 6252.22, "end": 6267.1, "text": "classic das da unten ist digital edition digital auf die xbox das habe ich jetzt keinen"}, {"id": 1020, "start": 6267.1, "end": 6274.3, "text": "bock ich glaube ich glaube die dinger heißen auch tatsächlich einfach nur so nur noch"}, {"id": 1021, "start": 6274.3, "end": 6281.86, "text": "das microsoft davor kommt x ok jetzt haben wir das ganze in schön müsste es das pop"}, {"id": 1022, "start": 6281.86, "end": 6287.26, "text": "up schon mal funktionieren sehr gut habt ihr gesehen wie dynamisch er das abgedatet hat"}, {"id": 1023, "start": 6287.26, "end": 6302.58, "text": "classic guck mal da macht sogar man darf es nicht zu klein machen seht ihr mal wie clever"}, {"id": 1024, "start": 6302.58, "end": 6309.5, "text": "der sogar ist und da punkte hinten dran macht wenn es nicht ausreicht nicki 9208 dankeschön"}, {"id": 1025, "start": 6309.5, "end": 6319.46, "text": "für den sub großes playstation die sind ja hardcore drauf die leute da bei sony kann"}, {"id": 1026, "start": 6319.46, "end": 6326.58, "text": "es doch keiner merken so alles klar sehr schön sehr schön so jetzt sieht das pop up schön"}, {"id": 1027, "start": 6326.58, "end": 6346.58, "text": "aus ja oh guck mal computer universe klitscht in da rein wenn man nicht aufpasst anzeige"}, {"id": 1028, "start": 6346.58, "end": 6358.34, "text": "ist raus direkt also gut wunderbar so jetzt müssen wir nur noch gucken dass der hier"}, {"id": 1029, "start": 6358.34, "end": 6366.14, "text": "oben das richtige anzeigt das heißt wir müssen das wir müssen das hinten bisschen erweitern"}, {"id": 1030, "start": 6366.14, "end": 6371.22, "text": "wir brauchen hier noch sowas wie also entweder machen wir jetzt direkt das emoji rein was"}, {"id": 1031, "start": 6371.22, "end": 6380.1, "text": "wir für den den den den das symbol rein oder wir schreiben hier sowas wie type ach komm"}, {"id": 1032, "start": 6380.1, "end": 6383.3, "text": "wir machen direkt das symbol an scheiß warum soll ich das im frontend noch mal extra matchen"}, {"id": 1033, "start": 6383.3, "end": 6398.74, "text": "ist doch komplett komplett bescheuert wo sind meine icons also das gibt gpu beziehungsweise"}, {"id": 1034, "start": 6398.74, "end": 6411.7, "text": "extension card oder so hieß das glaube die seite ist auch hardcore langsam kann man da"}, {"id": 1035, "start": 6411.7, "end": 6433.36, "text": "eins für eine die die mit die extension also icon sieht richtig champig aus ja so das ist"}, {"id": 1036, "start": 6433.36, "end": 6439.5, "text": "auch gpu seht ihr mal wie clever das ding ist guck mal da macht für mich ein kommer"}, {"id": 1037, "start": 6439.5, "end": 6454.9, "text": "hinten dran das sind auch gpus das nicht das sind auch wieder welche so cpu hatten die"}, {"id": 1038, "start": 6454.9, "end": 6470.3, "text": "hatten auch cpu hatten sie auch so und jetzt dann ich schöne das processor ich nehme halt"}, {"id": 1039, "start": 6470.3, "end": 6477.34, "text": "den meinetwegen wenn es sein muss was witzig ist intel ist mittlerweile so irrelevant dass"}, {"id": 1040, "start": 6477.34, "end": 6492.82, "text": "noch nicht mal im preis champ drin stehen cip cip was genau cip der da ne das ist memory"}, {"id": 1041, "start": 6492.82, "end": 6500.9, "text": "aber ich finde sieht aus wie cpu ach wir nehmen das mit 64 das doch wir gucken dann mal ob"}, {"id": 1042, "start": 6500.9, "end": 6507.78, "text": "das live updaten kann der sollte das nämlich live updaten wenn ich das dann ändere im"}, {"id": 1043, "start": 6507.78, "end": 6516.58, "text": "hintergrund ok jetzt haben wir das hier alles drin stehen und jetzt brauchen wir noch controller"}, {"id": 1044, "start": 6516.58, "end": 6540.46, "text": "controller"}, {"id": 1045, "start": 6540.46, "end": 6548.9, "text": "jetzt wim shortcuts ok hammer so dass das jetzt funktioniert muss ich auch mein typ erweitern"}, {"id": 1046, "start": 6548.9, "end": 6554.5, "text": "wenn ich wüsste wenn ich mich noch dran erinnern könnte wo ich den kram hin gepappt hab product"}, {"id": 1047, "start": 6554.5, "end": 6563.42, "text": "series genau das hat jetzt nicht das hat auch noch ein icon sehr gut so warten bis restartet"}, {"id": 1048, "start": 6563.42, "end": 6572.7, "text": "ist nehm den xbox controller es gibt keinen xbox controller oder gibt es den xbox controller"}, {"id": 1049, "start": 6572.7, "end": 6581.84, "text": "du meinst den da ach guck mal das ist ein stadia controller die gibt es tatsächlich"}, {"id": 1050, "start": 6581.84, "end": 6588.02, "text": "findest du nur nicht unter stadia ok es gibt tatsächlich einen xbox controller aber es"}, {"id": 1051, "start": 6588.02, "end": 6596.06, "text": "gibt kein xbox controller outline gibt es kein xbox controller outline das ist ziemlich"}, {"id": 1052, "start": 6596.06, "end": 6602.42, "text": "doof die outline varianten sehen viel cooler aus das können wir gleich mal live ändern"}, {"id": 1053, "start": 6602.42, "end": 6608.42, "text": "während es läuft dann können wir schauen dass das auch funzt ok das heißt wir zeigen"}, {"id": 1054, "start": 6608.42, "end": 6630.42, "text": "jetzt hier oben nicht immer expansion card an sondern wir zeigen an serious icon hier"}, {"id": 1055, "start": 6630.42, "end": 6651.7, "text": "warum hack wait marifreschen marifreschen muss mal kurz mal kurz hier die debug stels"}, {"id": 1056, "start": 6651.7, "end": 6657.82, "text": "aufmachen macht das auch so dass ihr was seht chat aha wo kommt man den scheiß noch mal"}, {"id": 1057, "start": 6657.82, "end": 6664.66, "text": "verschieben wo ist das wo ist das icon wo ist das ding zum verschieben von ihr ne das"}, {"id": 1058, "start": 6664.66, "end": 6691.7, "text": "war das wollte ich gar nicht das wollte ich btf so"}, {"id": 1059, "start": 6691.7, "end": 6703.46, "text": "man ist ja auch das falsche ist ja auch das falsche muss ich hier nachgucken im main datei"}, {"id": 1060, "start": 6703.46, "end": 6728.34, "text": "muss ich das nachgucken ja da wird es ja schon die ganze zeit raus gedammt warum ist hier"}, {"id": 1061, "start": 6728.34, "end": 6756.7, "text": "das icon nicht da ich habe es im craftql nicht abgefragt kann das sein icon da ist es doch"}, {"id": 1062, "start": 6756.7, "end": 6771.66, "text": "zack guck mal da bisschen fett würde ich sagen aber xbox also das funst und für die"}, {"id": 1063, "start": 6771.66, "end": 6778.62, "text": "grafika der extension geht auch habe ich mich hier verschrieben ich habe mdi vergessen"}, {"id": 1064, "start": 6778.62, "end": 6790.5, "text": "guck mal pass mal auf der sollte das eigentlich live updaten wenn ich das hat schon gemacht"}, {"id": 1065, "start": 6790.5, "end": 6800.42, "text": "ok sehr gut die ryzen cpu ist ein bisschen fett aber sieht eigentlich gar nicht so schlecht"}, {"id": 1066, "start": 6800.42, "end": 6809.22, "text": "aus oder so und jetzt und jetzt updaten wir das mal live was haben wir hier auf der 5800x"}, {"id": 1067, "start": 6809.22, "end": 6815.18, "text": "und da haben wir jetzt einfach mdi chip draus und da sollte das quasi on the fly ne das"}, {"id": 1068, "start": 6815.18, "end": 6824.5, "text": "ist nicht so reactive wie ich mir das gedacht habe da muss man halt neu laden es gibt schlimmeres"}, {"id": 1069, "start": 6824.5, "end": 6843.54, "text": "aber aber das dynamische hinzufügen funst noch oder oder habe ich das irgendwie geprägt"}, {"id": 1070, "start": 6843.54, "end": 6866.94, "text": "ne das funktioniert noch also hier xbox hier ist xs confirmed ok nice excellent excellent"}, {"id": 1071, "start": 6866.94, "end": 6881.58, "text": "so dann würde ich das mal pushen da können wir es ausprobieren"}, {"id": 1072, "start": 6881.58, "end": 6892.46, "text": "gucken ob es auch funktioniert guck da lieferbar rx ok wir pushen mal den preiszamp jetzt bin"}, {"id": 1073, "start": 6892.46, "end": 6903.5, "text": "ich mal gespannt mal gucken ob die russischen dedos tippen wieder am start sind jetzt mal"}, {"id": 1074, "start": 6903.5, "end": 6910.38, "text": "ein grefana dashboard aufmachen ach komm mal hier war ein aussetzer hier hier wirds"}, {"id": 1075, "start": 6910.38, "end": 6919.34, "text": "hier wirds schonmal gel gel guck mal da war ein aussetzer sag mal kann das sein dass ich"}, {"id": 1076, "start": 6919.34, "end": 6924.22, "text": "dass ich nicht gededost werde sondern hetzner um die urzeit ein paar probleme hat weil das"}, {"id": 1077, "start": 6924.22, "end": 6933.7, "text": "sind immer guck mal leute das ist immer die gleiche urzeit ne das das vielleicht werde"}, {"id": 1078, "start": 6933.7, "end": 6940.22, "text": "ich gar nicht gededost kakwait ich hab mich schon gefreut dass ich das das das so beliebt"}, {"id": 1079, "start": 6940.22, "end": 6952.82, "text": "ist dass ich gededost werde ok wir sehens gleich ich lock mich jetzt ein ich lock mich"}, {"id": 1080, "start": 6952.82, "end": 6967.26, "text": "jetzt ein mal gucken mal gucken wie gut es läuft attach achso moment kann ich da überhaupt"}, {"id": 1081, "start": 6967.26, "end": 6977.74, "text": "hin pushen jetzt ok kakwait ich bin mir gar nicht sicher ob ich da ob ich da überhaupt"}, {"id": 1082, "start": 6977.74, "end": 6983.66, "text": "hin pushen kann ok ich muss erstmal auf jeden fall neues frontend bilden ok leute hab ich"}, {"id": 1083, "start": 6983.66, "end": 6988.62, "text": "schon irgendwas vergessen ich will jetzt nicht dass es kaputt geht wenn ichs pushe ähm"}, {"id": 1084, "start": 6988.62, "end": 6994.34, "text": "kann aber alles zu funsten erstmal ne was nice wäre wenns vielleicht ein paar von euch"}, {"id": 1085, "start": 6994.34, "end": 6998.66, "text": "auf dem android und auf dem iphone wobei im iphone kann ich selbst ausprobieren ob da"}, {"id": 1086, "start": 6998.66, "end": 7023.46, "text": "alles ordentlich scaled skaliert ok alles erden git add git commit a minus m streamsorts"}, {"id": 1087, "start": 7023.46, "end": 7043.18, "text": "push ähm ach du scheiße ähm was hat ich denn da nochmal genommen ich hab sonst einfach"}, {"id": 1088, "start": 7043.18, "end": 7051.02, "text": "key-authentifizierung ok das ist bei mir lokal daheim das ist egal admin admin ne ne"}, {"id": 1089, "start": 7051.02, "end": 7057.7, "text": "warte mal probier mal ich hab ich hab normalerweise nehme ich ja immer so einen schwachsinn aber"}, {"id": 1090, "start": 7057.7, "end": 7062.5, "text": "ich da hab ich da hab ich glaube ich was nicht super kompliziert ist aber was doch ein bisschen"}, {"id": 1091, "start": 7062.5, "end": 7069.1, "text": "längeres genommen das ist lokal domain bei mir na gut ist egal ich muss ja da auch gar"}, {"id": 1092, "start": 7069.1, "end": 7074.1, "text": "nicht hin pushen ich muss ja auf meinen server pushen das reicht ähm aber hier kurz das"}, {"id": 1093, "start": 7074.1, "end": 7094.62, "text": "ding aus das ach das doch von gestern auf dem server hier oder was ok dann gucken wir"}, {"id": 1094, "start": 7094.62, "end": 7101.86, "text": "mal wobei ich müsste jetzt ja eigentlich einfach das ding als remote adden können"}, {"id": 1095, "start": 7101.86, "end": 7111.86, "text": "wenn ich das noch richtig aus dem kopf geht remote add ähm preisschamp oh wie war die"}, {"id": 1096, "start": 7111.86, "end": 7122.26, "text": "syntax dafür äh natürlich als root als was sonst beta bezeit ich mal ein paar github"}, {"id": 1097, "start": 7122.26, "end": 7126.38, "text": "actions oder irgendwie sowas mach da kann ich einfach git pushen nach github auch in"}, {"id": 1098, "start": 7126.38, "end": 7137.62, "text": "private repo ist egal und es funktioniert einfach ok ich hoffe ich hab das richtig gemacht"}, {"id": 1099, "start": 7137.62, "end": 7150.66, "text": "jetzt muss ich jetzt muss ich jetzt geht kurz der preisschamp kaputt preisschamp shut down"}, {"id": 1100, "start": 7150.66, "end": 7157.22, "text": "wie kann man ordnung auf seinem c halten äh downloads einfach auf eine andere andere ähm"}, {"id": 1101, "start": 7157.22, "end": 7163.34, "text": "andere platte machen hab ich auch ich hab ja nur eine 512 g ssd drin und da kommen ein"}, {"id": 1102, "start": 7163.34, "end": 7168.86, "text": "paar einzelne spiele drauf aber ich hab noch eine zweite 2 terabyte ssd und noch eine äh"}, {"id": 1103, "start": 7168.86, "end": 7175.46, "text": "6 terabyte platte dran und das passt eigentlich und dann hab ich die downloads hab ich auf"}, {"id": 1104, "start": 7175.46, "end": 7182.9, "text": "der magnet festplatte alter beende dich mal der preisschamp will nicht so mal gucken was"}, {"id": 1105, "start": 7182.9, "end": 7196.1, "text": "macht der preisschamp wow der überträgt ganz schön viel"}, {"id": 1106, "start": 7196.1, "end": 7209.26, "text": "komm mal der preisschamp der will gar nicht mehr abbrechen preisschamp paper please könntest"}, {"id": 1107, "start": 7209.26, "end": 7215.26, "text": "du was zu deinem system in der vm sagen erklären ja aber er ist noch nicht beendet ist der"}, {"id": 1108, "start": 7215.26, "end": 7227.86, "text": "preisschamp der preisschamp ist weg oder ok der preisschamp ist ist ist wohl weg wo ist"}, {"id": 1109, "start": 7227.86, "end": 7237.98, "text": "das alter wo ist das problem beende dich mal ähm könntest du was zu deinem system in der"}, {"id": 1110, "start": 7237.98, "end": 7249.02, "text": "vm sagen das ist mein charo mit die 3 wm alter ich kill das jetzt gleich"}, {"id": 1111, "start": 7249.02, "end": 7255.86, "text": "der preisschamp hängt aber ganz schön hart ok leute jetzt ah jetzt vielleicht jetzt vielleicht"}, {"id": 1112, "start": 7255.86, "end": 7262.94, "text": "preisschamp preisschamp geh aus ansonsten wenn du nicht brav bist preisschamp dann weißt"}, {"id": 1113, "start": 7262.94, "end": 7268.9, "text": "du was passiert der preisschamp will sie nicht beenden weiß ich weiß ich gesagt gar nicht"}, {"id": 1114, "start": 7268.9, "end": 7290.34, "text": "warum die rammer haben wir eigentlich gerade so ok preisschamp 5 4 3 2 1 ok repp preisschamp"}, {"id": 1115, "start": 7290.34, "end": 7309.98, "text": "hat sich ausgezämmt jetzt hängt er wieder leute kann das sein dass der einfach nur ewig"}, {"id": 1116, "start": 7309.98, "end": 7315.74, "text": "lange braucht bis zur verbindung weil guck mal jetzt hängt wieder ich glaube das sind"}, {"id": 1117, "start": 7315.74, "end": 7322.1, "text": "gar keine russischen denos dudes oder so der preisschamp hat irgendwie probleme beim verbindung"}, {"id": 1118, "start": 7322.1, "end": 7329.78, "text": "schließen oder so könnte das sein programmierst du den preisschamp aus spaß ja hauptsächlich"}, {"id": 1119, "start": 7329.78, "end": 7337.54, "text": "unfalls was bringt kann das sein dass der preisschamp ein bisschen irgendwie linux"}, {"id": 1120, "start": 7337.54, "end": 7351.94, "text": "netzwerk mäßig probleme macht oder kann es sein dass der preisschamp weil da so viele"}, {"id": 1121, "start": 7351.94, "end": 7359.02, "text": "connections closed die hetsen der dedos protection triggert oder irgendwie sowas dann guck mal"}, {"id": 1122, "start": 7359.02, "end": 7371.66, "text": "hier der macht dann der macht schon ein bisschen was der ganze chat ist eingeloggt oh nee"}, {"id": 1123, "start": 7371.66, "end": 7381.1, "text": "warum alter warum ist der server auf einmal so am rumspacken wo ist das problem das sind"}, {"id": 1124, "start": 7381.1, "end": 7404.86, "text": "16 kerne und das ding macht faktisch nix ganz die ganze welt ist lockt in da preisschamp"}, {"id": 1125, "start": 7404.86, "end": 7416.26, "text": "ist total aber warum hä das verstehe ich nicht das leuchtet mir echt nicht ein warum"}, {"id": 1126, "start": 7416.26, "end": 7443.26, "text": "der so am abkacken ist dabei jetzt der pinkt auch nicht mehr wahnsinn okay dann dann glaube"}, {"id": 1127, "start": 7443.26, "end": 7455.5, "text": "ich doch nicht dass ich gededost werde ich habe ich hatte ja so die vermutung aber aber"}, {"id": 1128, "start": 7455.5, "end": 7461.82, "text": "wie kann das sein was macht er irgendwie 30 aber selbst wenn er 30.000 verbindung beendet"}, {"id": 1129, "start": 7461.82, "end": 7473.98, "text": "wo ist das problem ich habe ich will mich jetzt nicht bei hetsen einloggen da muss man"}, {"id": 1130, "start": 7473.98, "end": 7485.06, "text": "smartphone holen für otp hast du geguckt ob das ding am brennen ist naja wenn schon brennt"}, {"id": 1131, "start": 7485.06, "end": 7493.66, "text": "bei hetsen im rechenzentrum und es ist eine vm nee also warum der so am abkacken ist verstehe"}, {"id": 1132, "start": 7493.66, "end": 7502.54, "text": "ich nicht kann es sein dass bei einer registrierten notification der server ständig abgefragt"}, {"id": 1133, "start": 7502.54, "end": 7510.78, "text": "wird wenn er nicht antwortet ja aber selbst wenn dann machen die paar besucher die da"}, {"id": 1134, "start": 7510.78, "end": 7520.66, "text": "drauf sind auch nicht den server dauen ich verstehe das verstehe nicht ich muss mal kurz"}, {"id": 1135, "start": 7520.66, "end": 7534.3, "text": "hier ausmachen mal kurz und dann gehe ich mal ich logg mich mal bei hetsen ein wird"}, {"id": 1136, "start": 7534.3, "end": 7542.14, "text": "Zeit dass ich das aufsplitte leute morgen splitt ich das auf dass das stört dass der"}, {"id": 1137, "start": 7542.14, "end": 7570.42, "text": "scrawler ding so otp muss die muss die autentifizierung app"}, {"id": 1138, "start": 7570.42, "end": 7581.34, "text": "aufmachen immer so ein akt sich da einzuloggen aber so ist das halt bequemlichkeit versus"}, {"id": 1139, "start": 7581.34, "end": 7603.26, "text": "security ne okay ich bin eingeloggt okay gut dann machen wir die vm wieder an ich mach"}, {"id": 1140, "start": 7603.26, "end": 7613.18, "text": "die fall immer aus dass nix über den clipboard manager landet an passwörtern und so oder"}, {"id": 1141, "start": 7613.18, "end": 7625.82, "text": "war noch nicht ganz tot er hat kurz geantwortet er hat kurz geantwortet der preis jump"}, {"id": 1142, "start": 7625.82, "end": 7648.02, "text": "alles vorbei"}, {"id": 1143, "start": 7648.02, "end": 7658.46, "text": "okay ich starte jetzt neu über die über die konsole er hat wieder geantwortet leute"}, {"id": 1144, "start": 7658.46, "end": 7662.9, "text": "hat wieder er hat wieder geantwortet er antwortet schon wieder was ist jetzt fängt er sich"}, {"id": 1145, "start": 7662.9, "end": 7668.98, "text": "noch mal fängt er sich noch mal postchamp er will nicht er will nicht disabelt werden"}, {"id": 1146, "start": 7668.98, "end": 7685.14, "text": "er will nicht er will nicht rebooted werden naja wenn du cloudflare davor machst wieder"}, {"id": 1147, "start": 7685.14, "end": 7700.9, "text": "auf irgendeine hetsnerkiste ne leute ist vorbei ist vorbei ich starte jetzt neu ist aus und"}, {"id": 1148, "start": 7700.9, "end": 7720.38, "text": "jetzt mache ich wieder an"}, {"id": 1149, "start": 7720.38, "end": 7731.5, "text": "dabei guck mal der leckt sogar dabei"}, {"id": 1150, "start": 7731.5, "end": 7739.54, "text": "seht ihr das okay wie gesagt ich glaube nicht mehr an den russischen dedos sondern dass"}, {"id": 1151, "start": 7739.54, "end": 7755.06, "text": "dass irgendwas anderes da nicht stimmt guck mal hier 300 leute pingen an das juckt überhaupt"}, {"id": 1152, "start": 7755.06, "end": 7774.58, "text": "nicht ob 300 leute an pingen 300 leute pingen ist vollkommen egal"}, {"id": 1153, "start": 7774.58, "end": 7785.18, "text": "kann man kann man das rechenzentrum verschieben bei hetsner irgendwie"}, {"id": 1154, "start": 7785.18, "end": 7800.78, "text": "geht nicht ja gut dann müssen wir warten bis er jetzt wieder bis er sich wieder gefangen"}, {"id": 1155, "start": 7800.78, "end": 7807.3, "text": "hat er ich mein ich mein er pinkt ja zumindest schon mal ein bisschen wieder zwar nicht oft"}, {"id": 1156, "start": 7807.3, "end": 7816.5, "text": "aber aber ab und zu ab und zu pinkt aber wie kann das sein dass es nach dem reboot immer"}, {"id": 1157, "start": 7816.5, "end": 7836.86, "text": "noch probleme gibt es gibt doch überhaupt keinen sinn aber erst mal das ganze andere"}, {"id": 1158, "start": 7836.86, "end": 7859.74, "text": "zeug zu rippe price jam sicher dass er dauernd war er ich habe ausgeschaltet wieder angemacht"}, {"id": 1159, "start": 7859.74, "end": 7862.74, "text": "dass hier abteilen drin steht das hat nichts zu sagen da konnte einfach noch nicht weiter"}, {"id": 1160, "start": 7862.74, "end": 7870.74, "text": "abfragen guck mal hier cpu wie das raufgegangen ist jetzt hat er keine datmen er konnte einfach"}, {"id": 1161, "start": 7870.74, "end": 7880.74, "text": "nur nichts abfragen in der zwischenzeit sag mal hetsner datacenter es war übelst am abkacken"}, {"id": 1162, "start": 7880.74, "end": 7892.86, "text": "aber das verstehe ich aber guck mal hat er sich eingekriegt ist er ist der russische"}, {"id": 1163, "start": 7892.86, "end": 7916.74, "text": "dados vorbei jetzt hängt es wieder also das sind so merkwürdige sachen so so random so"}, {"id": 1164, "start": 7916.74, "end": 7920.78, "text": "unerklärliche hänger die sollten eigentlich nicht aufdrehen deswegen war ja auch meine"}, {"id": 1165, "start": 7920.78, "end": 7926.7, "text": "erste vermutung irgendeiner hat sich da sein russisches spotnetz am start oder was auch"}, {"id": 1166, "start": 7926.7, "end": 7936.7, "text": "immer den pranz guck es euch mal an das ist doch definitiv nicht normal der server steht"}, {"id": 1167, "start": 7936.7, "end": 7963.78, "text": "in nürnberg oder so nürnberg ja schön mittler da musst du nicht glaube der macht ja nix"}, {"id": 1168, "start": 7963.78, "end": 7967.98, "text": "ich weiß ja auch nicht was der für schmerzen hat ehrlich gesagt so jetzt pushen wir erstmal"}, {"id": 1169, "start": 7967.98, "end": 7981.78, "text": "den preisschamp push auf preisschamp und da will ich allerdings den beta branch pushen"}, {"id": 1170, "start": 7981.78, "end": 8000.22, "text": "verkehrt kommt an die hett ist ja groß"}, {"id": 1171, "start": 8000.22, "end": 8009.06, "text": "könnte das sein dass das irgendeine hetsner dedos protection ist dass das aus irgendwelchen"}, {"id": 1172, "start": 8009.06, "end": 8014.82, "text": "gründen der 50.000 verbindungen zu macht und dann die hetsner dedos protection irgendwie"}, {"id": 1173, "start": 8014.82, "end": 8024.1, "text": "meint oder stimmt was nicht weil ich glaube nicht wirklich dass ernsthaft irgendjemand"}, {"id": 1174, "start": 8024.1, "end": 8035.3, "text": "nix hier im stream sitzt und da ding wie dedos oder das ergibt eigentlich wenig sinn wird"}, {"id": 1175, "start": 8035.3, "end": 8045.98, "text": "mich nicht wohl ja man weiß es ist aber komisch es ist immer nur im stream so wir haben gepusht"}, {"id": 1176, "start": 8045.98, "end": 8074.06, "text": "ja selbst hatte hier auch nicht viel network disk hat er hat er packages per second drin"}, {"id": 1177, "start": 8074.06, "end": 8084.3, "text": "network traffic bei packets komm mal der hat der hat einfach mal 100.000 100.000 packages"}, {"id": 1178, "start": 8084.3, "end": 8098.3, "text": "per second so will transmit als auch receive und ihr seht das ist den ganzen tag über"}, {"id": 1179, "start": 8098.3, "end": 8107.38, "text": "12 stunden den ganzen tag über ist nix das ist nur wenn man nur wenn man im stream on"}, {"id": 1180, "start": 8107.38, "end": 8121.5, "text": "ist schon merkwürdig oder schon schon merkwürdig arbeitest du auch untertags dran ich glaube"}, {"id": 1181, "start": 8121.5, "end": 8126.7, "text": "ich habe das noch nicht ausgeschaltet untertags aber ich mache den ich wie gesagt ich mache"}, {"id": 1182, "start": 8126.7, "end": 8148.54, "text": "das hinter cloud flair sobald das jetzt läuft dann ok also check out beta dot net run so"}, {"id": 1183, "start": 8148.54, "end": 8156.58, "text": "wenn ich jetzt alles richtig gemacht habe sollte der preisschamp demnächst mit an der"}, {"id": 1184, "start": 8156.58, "end": 8163.86, "text": "preisschamp kann es kann wieder nicht erreichbar ok ist ja gut warum hast du bei cloud flair"}, {"id": 1185, "start": 8163.86, "end": 8181.54, "text": "eine dsg voklage am hals cloud flair verwendet so gut wie jeder da ist er es hat jetzt über"}, {"id": 1186, "start": 8181.54, "end": 8211.22, "text": "15 minuten gedauert lull so poggers street merchant und jetzt start wie alt ich bin 36"}, {"id": 1187, "start": 8211.22, "end": 8217.98, "text": "so jeder preisschamp sieht schon mal ganz gut aus dass mit den mit den grafen sieht auch"}, {"id": 1188, "start": 8217.98, "end": 8224.14, "text": "ok aus jetzt muss nur noch jetzt muss nur noch der tracker starten dann passt das alles"}, {"id": 1189, "start": 8224.14, "end": 8231.18, "text": "voll alt ja ich sag es doch die leute klauen mit jetzt immer noch die sagen dass da max"}, {"id": 1190, "start": 8231.18, "end": 8242.1, "text": "du bist du hörst dich so an wie 20 das ist ja nice aber bin ich nicht oder preisschamp"}, {"id": 1191, "start": 8242.1, "end": 8247.9, "text": "hängt wieder wolltest du nicht den tracker im docker laufen lassen nee ich werde das"}, {"id": 1192, "start": 8247.9, "end": 8253.66, "text": "front an dem docker laufen lassen und ich also ich habe es mir so überlegt ich werde"}, {"id": 1193, "start": 8253.66, "end": 8262.98, "text": "mir den also hetzner pricing ich zeige euch mal was wir da machen cloud pricing also was"}, {"id": 1194, "start": 8262.98, "end": 8271.82, "text": "ich mir überlegt habe weiße so ich hole mir so ein ding so ein ding fürs für für den"}, {"id": 1195, "start": 8271.82, "end": 8283.42, "text": "crawler acht kerne reicht ist ok dann hole ich mir so ein ding hier oder so oder wahrscheinlich"}, {"id": 1196, "start": 8283.42, "end": 8289.18, "text": "hole ich mir erstmal so ein ding fürs front end fertig da kommt dann cloud flair davor"}, {"id": 1197, "start": 8289.18, "end": 8294.14, "text": "und gut ist da mache ich ein internes netzwerk dazwischen kann man ja bei hetzner machen"}, {"id": 1198, "start": 8294.14, "end": 8298.18, "text": "dass quasi die beiden server inter noch mal im gleichen netz hängen und der publish dann"}, {"id": 1199, "start": 8298.18, "end": 8312.5, "text": "neueste sachen zum preisschamp ist schon gestartet er crawlt"}, {"id": 1200, "start": 8328.18, "end": 8344.14, "text": "und er crawlt ordentlich"}, {"id": 1201, "start": 8344.14, "end": 8351.38, "text": "so erste sache ist grün jawohl ne xbox guck mal bei otto deutscher autolan hat ne xbox"}, {"id": 1202, "start": 8351.38, "end": 8361.34, "text": "ja also wer schon leute ihr habt es im stream gesehen wer schon immer mal ne xbox series"}, {"id": 1203, "start": 8361.34, "end": 8378.98, "text": "s haben will für dass das die keiner haben will ist die erstaun oh keck wait oh nee der"}, {"id": 1204, "start": 8378.98, "end": 8402.18, "text": "preisschamp wird wieder die dorst ok dann gehen wir jetzt hier runter"}, {"id": 1205, "start": 8402.18, "end": 8406.62, "text": "welche seiten checken die ab so gut wie alle deutschen seiten checkt ihr ab mein factory"}, {"id": 1206, "start": 8406.62, "end": 8413.5, "text": "alternate otto art cyberport computer universe sonst was so man kann sich noch die not not"}, {"id": 1207, "start": 8413.5, "end": 8418.3, "text": "notifications dann schicken lassen sagst du hier zack will ich informiert werden gut"}, {"id": 1208, "start": 8418.3, "end": 8427.82, "text": "ist da muss jetzt natürlich erstmal sich wieder eine runde durchcrawlen wir gehen einfach"}, {"id": 1209, "start": 8427.82, "end": 8441.46, "text": "in die magenta cloud leute wir gucken mal was es kostet nein es ist compute wie heißt"}, {"id": 1210, "start": 8441.46, "end": 8458.46, "text": "es bei denen will kein speicher cloud server hier ok sollen sollen die grafen schon funktionieren"}, {"id": 1211, "start": 8458.46, "end": 8464.34, "text": "nein die grafen funktionieren nicht steht ja auch dahinter in arbeit die grafen funktionieren"}, {"id": 1212, "start": 8464.34, "end": 8478.46, "text": "noch nicht magenta cloud zu den tarifen also zeig mal was kostet sichern sie sich extra"}, {"id": 1213, "start": 8478.46, "end": 8495.42, "text": "viel nein ich will ein will kein speicher ich will ich will surfer haben haben die haben"}, {"id": 1214, "start": 8495.42, "end": 8509.86, "text": "die keine server zu mieten oder was ach das ist die open telekom cloud ok open telekom"}, {"id": 1215, "start": 8509.86, "end": 8522.7, "text": "cloud alles klar da also compute ich will einfach nur stink normalen poplischen popliche"}, {"id": 1216, "start": 8522.7, "end": 8545.26, "text": "vm gibts sowas hier nicht die haben sowas ok was kostet ein bare metal server erfolgreich"}, {"id": 1217, "start": 8545.26, "end": 8559.5, "text": "hinzugefügt und jetzt open linux alle haben die die haben doch nicht mal nur bunto oder"}, {"id": 1218, "start": 8559.5, "end": 8575.02, "text": "debian was redhead wer will so crap alter ich will einfach das ist mir zu dumm da checkt"}, {"id": 1219, "start": 8575.02, "end": 8583.62, "text": "es checkt doch keiner also was ich vor hab ist folgendes ich hol mir so ein achtkerner"}, {"id": 1220, "start": 8583.62, "end": 8588.3, "text": "machen internes netz dazwischen hier kommt das frontend drauf und der besucherzähler"}, {"id": 1221, "start": 8588.3, "end": 8596.82, "text": "und hier kommt der crawler drauf ein gutes 2k im monat ja ich weiß nicht was los ist"}, {"id": 1222, "start": 8596.82, "end": 8602.06, "text": "bei hetsner bezahlt ich für 16 kerne ok nicht dedicated aber dedicated cpu bezahlt"}, {"id": 1223, "start": 8602.06, "end": 8605.98, "text": "für 16 kerne 160 ich weiß nicht was mit der telekom los ist wer sich diesen kram überhaupt"}, {"id": 1224, "start": 8605.98, "end": 8616.5, "text": "geben will ja und den letzten letzten 15 minuten gucken wir mal das ist ja der hatte schon"}, {"id": 1225, "start": 8616.5, "end": 8634.02, "text": "ein bisschen was zu tun der gute hier 100.000 package per second kann das sein dass da drüber"}, {"id": 1226, "start": 8634.02, "end": 8639.66, "text": "aber 100.000 das klingt so glatt das klingt schon irgendwie nach das irgendwo was limitiert"}, {"id": 1227, "start": 8639.66, "end": 8666.86, "text": "wird connections 250.000 connections 250.000 connections ok das ist doch der russische"}, {"id": 1228, "start": 8666.86, "end": 8680.98, "text": "dedos am start das kann es das kann es anders da kann es nicht sein anders kann es das ergibt"}, {"id": 1229, "start": 8680.98, "end": 8699.58, "text": "eigentlich keinen sinn cloudflare floor and fair ja hab ich schon preisschamp orc ist"}, {"id": 1230, "start": 8699.58, "end": 8706.66, "text": "schon über über über things über cloudflare es ist halt dumm weil eigentlich wenn ich"}, {"id": 1231, "start": 8706.66, "end": 8710.46, "text": "hier im stream was mache dann will ich das nicht über den server mit cloudflare machen"}, {"id": 1232, "start": 8710.46, "end": 8714.5, "text": "weil sonst liegt ich im zweifelsfall noch die server ip dann muss die server ip erst"}, {"id": 1233, "start": 8714.5, "end": 8719.66, "text": "ändern bei cloudflare die floating ip bei hetsner hetsner hat doch der hätte sagen"}, {"id": 1234, "start": 8719.66, "end": 8729.06, "text": "sie haben dedos protection aber was auch immer interne connections oder externe das sieht"}, {"id": 1235, "start": 8729.06, "end": 8737.7, "text": "man nicht allerdings so viel interne connections kann das ja net net haben das ding hatte keinerlei"}, {"id": 1236, "start": 8737.7, "end": 8748.26, "text": "interne ip irgendwie und andere server cloudflare da vorn gut ist so aber leute der neue preisschamp"}, {"id": 1237, "start": 8748.26, "end": 8773.1, "text": "ist am start was sagt ihr ja exzellente da fehlt was warum zeigt der oh nee ich ich ich"}, {"id": 1238, "start": 8773.1, "end": 8783.1, "text": "hätte den russischen dedos nicht ansprechen sollen leute ich hätte nicht sagen sollen"}, {"id": 1239, "start": 8783.1, "end": 8797.26, "text": "wo wo wo wo wo sind die einträge da unten wo sind die einträge für die jeweiligen"}, {"id": 1240, "start": 8797.26, "end": 8805.9, "text": "sachen die er gefunden hat der zeigt gar nix an grad was ist das denn"}, {"id": 1241, "start": 8805.9, "end": 8834.82, "text": "okay der reisen an falsches eiken echt welcher der reisen 5800 ne hat doch passt doch das"}, {"id": 1242, "start": 8834.82, "end": 8843.82, "text": "stimmt ach nee das habe ich ausprobiert das habe ich ausprobiert aber wir können mal"}, {"id": 1243, "start": 8843.82, "end": 8850.34, "text": "gucken ob wir das live updaten können solange soll ich drauf kommen lull weh solange ich"}, {"id": 1244, "start": 8850.34, "end": 8875.54, "text": "drauf kommen ja guck der der der da brechen die verbindung weg ich jetzt kein bock mehr"}, {"id": 1245, "start": 8875.54, "end": 8888.18, "text": "etze hat in der klaut natürlich haben in der klaut eine konsole das bringt mir nur nix"}, {"id": 1246, "start": 8888.18, "end": 8894.18, "text": "also da kommt jetzt klautflare da vorn gut ist lustigerweise wenn ich den stream ausmache"}, {"id": 1247, "start": 8894.18, "end": 8902.94, "text": "beruhigt sich auch immer was sehr verdächtig ist weiß aber nicht warum also was der zweck"}, {"id": 1248, "start": 8902.94, "end": 8921.14, "text": "da jetzt von ist also ich meine es macht ja nix geht aber wieder"}, {"id": 1249, "start": 8921.14, "end": 8940.14, "text": "irgendwie spackt die anzeige rum was kostet der spaß klaut für nix klautflare kostet"}, {"id": 1250, "start": 8940.14, "end": 8953.58, "text": "da ist erstmal nix na gut leute das ist jetzt erstmal gepusht was willst du machen irgendwas"}, {"id": 1251, "start": 8953.58, "end": 8968.86, "text": "ist noch falsch der reisen war aber welcher reisen war falsch das grafana auf lull jaja"}, {"id": 1252, "start": 8968.86, "end": 8993.54, "text": "guck mal hier 5800 ist falsch ok excellent excellent"}, {"id": 1253, "start": 8993.54, "end": 9017.3, "text": "naja das muss schon einer sein wenn es einer wirklich steht was sollte dann ist das irgendjemand"}, {"id": 1254, "start": 9017.3, "end": 9040.3, "text": "im stream naja so also was machen wir jetzt noch klautflare mach ich einrichten kann ich"}, {"id": 1255, "start": 9040.3, "end": 9047.18, "text": "nicht im stream machen wenn ich klautflare einrichten im stream mache dann sind die"}, {"id": 1256, "start": 9047.18, "end": 9057.94, "text": "ips ja geleakt das ist ja nicht so sinnvoll aber ich mache das morgen danach im aufwachen"}, {"id": 1257, "start": 9057.94, "end": 9078.42, "text": "stream wobei nee ich mache das jetzt glaube ich noch pw a draus zu machen ist easy ich"}, {"id": 1258, "start": 9078.42, "end": 9088.14, "text": "mache das jetzt noch weil dann hat das dns zeit beziehungsweise die namensauflösung"}, {"id": 1259, "start": 9088.14, "end": 9096.9, "text": "zeit sich auf klautflare umzustellen heute nacht das dauert ja immer ein paar stunden"}, {"id": 1260, "start": 9096.9, "end": 9103.06, "text": "bis das bei allen so ist bis der cash überall weg ist also vielleicht stelle ich jetzt doch"}, {"id": 1261, "start": 9103.06, "end": 9108.22, "text": "noch auf klautflare die kiste um ich meine ich muss die ip vorher ändern ip ist ja schon"}, {"id": 1262, "start": 9108.22, "end": 9117.74, "text": "milliardenfach geleakt hier einfach neue ip dran hängen und dann klautflare anschalten"}, {"id": 1263, "start": 9117.74, "end": 9126.18, "text": "da kann sich das heute nacht propagaten die dns geschichte so ich gucke jetzt mal subscribers"}, {"id": 1264, "start": 9126.18, "end": 9143.74, "text": "weil ich glaube ich habe die hälfte wieder nicht gesehen starte noch mal kurz lokal bin"}, {"id": 1265, "start": 9143.74, "end": 9151.48, "text": "ich bin ich bei github eingeloggt ah nee sonst hätten wir vielleicht mal github github"}, {"id": 1266, "start": 9151.48, "end": 9160.78, "text": "actions machen können dafür also der emko hat gesagt ja ich habe es nicht gesehen ich"}, {"id": 1267, "start": 9160.78, "end": 9165.02, "text": "habe das mit dem video nicht vergessen ich hatte den ganzen tag keine zeit ich habe"}, {"id": 1268, "start": 9165.02, "end": 9171.1, "text": "noch nicht mal ins discord geguckt falls du geantwortet hast aber also wir machen das"}, {"id": 1269, "start": 9171.1, "end": 9177.58, "text": "ja ich habe es nicht gesehen dass du gesagt hast danke für den zap huge chat iq wieder"}, {"id": 1270, "start": 9177.58, "end": 9199.74, "text": "monopole hat abonniert dankeschön exzellenz"}, {"id": 1271, "start": 9199.74, "end": 9204.86, "text": "nicki 9208 prime subscription ich weiß gar nicht ob ihr alle noch da seid ich hoffe mal"}, {"id": 1272, "start": 9204.86, "end": 9214.3, "text": "jetzt wo ich vorlese dass auch ein paar im start sind es war nur der name frei dankeschön"}, {"id": 1273, "start": 9214.3, "end": 9239.98, "text": "für den sap ob das habe ich schon gesehen die ganzen aussetzer hier"}, {"id": 1274, "start": 9239.98, "end": 9257.86, "text": "also das hat schon sehr auffällig wenn ich hier auf einmal 100 7 267.000 connections"}, {"id": 1275, "start": 9257.86, "end": 9277.02, "text": "hast und es ist limit mehr geht nicht unterschiedliche gpu hersteller aber das funktioniert nicht"}, {"id": 1276, "start": 9277.02, "end": 9287.42, "text": "wirklich gut ich habe zwar die info aber der tracker enthält dafür zu wenig also der ist"}, {"id": 1277, "start": 9287.42, "end": 9292.66, "text": "ja teilweise schon nicht sonderlich up to date wenn es darum geht bei den das dauert"}, {"id": 1278, "start": 9292.66, "end": 9300.98, "text": "er teilweise eine ganze weile bis die neuen grafika hat ein paar neuen shops daneben klicken"}, {"id": 1279, "start": 9300.98, "end": 9313.3, "text": "da geht sich mal auf ha ha es ist verbuckt keck weight warum das können wir noch fixen"}, {"id": 1280, "start": 9313.3, "end": 9318.1, "text": "schnell ich weiß zwar nicht woran es liegt was wollte ich gerade sagen es hat mich jetzt"}, {"id": 1281, "start": 9318.1, "end": 9324.3, "text": "abgelenkt ja genau der track der tracker braucht teilweise schon so lang bis das überhaupt"}, {"id": 1282, "start": 9324.3, "end": 9332.46, "text": "gecheckt hat es geht wirklich nicht mit einem mit den einzelnen karten und die kommen da"}, {"id": 1283, "start": 9332.46, "end": 9337.9, "text": "nicht hinterher mit hersteller und und verschiedene modellen und so das hat glaube ich keinen"}, {"id": 1284, "start": 9337.9, "end": 9347.34, "text": "sinn das ist nie aktuell du musst zumachen durch hier oben so drauf dann geht es nicht"}, {"id": 1285, "start": 9347.34, "end": 9372.18, "text": "mehr dass das fixen wir noch schnell aber lokal jetzt hier repos docker ps läuft das"}, {"id": 1286, "start": 9372.18, "end": 9378.26, "text": "war das was nämlich laufen also woran könnte das denn liegen ich weiß woran es liegt ich"}, {"id": 1287, "start": 9378.26, "end": 9393.9, "text": "weiß es ist easy ich weiß woran es liegt wenn ich hier auf fack wie mache ich das jetzt"}, {"id": 1288, "start": 9393.9, "end": 9399.38, "text": "also wenn ich escape drücke sage ich klaus wenn ich darauf drücke sage ich klaus aber"}, {"id": 1289, "start": 9399.38, "end": 9420.42, "text": "wie ketsche ich das hat außen hingeklickt event um klaus zu zu machen"}, {"id": 1290, "start": 9420.42, "end": 9444.18, "text": "click outer ich habe keine ahnung click outside moment au outside click outside ernsthaft"}, {"id": 1291, "start": 9444.18, "end": 9458.22, "text": "gibt es sowas aber es müsste es müsste ein ad ad click outside sein stack overflow triffen"}, {"id": 1292, "start": 9458.22, "end": 9487.94, "text": "programming ich sage es euch beste fix easy so dann pushen wir das das noch mal so her"}, {"id": 1293, "start": 9487.94, "end": 9514.22, "text": "da so ich bin wieder auf meinem server drauf keck weh den aus engage wie noch nicht gut"}, {"id": 1294, "start": 9514.22, "end": 9524.18, "text": "da legen wir jetzt los wir können mal ein zweites git repo machen geht inne da können"}, {"id": 1295, "start": 9524.18, "end": 9536.38, "text": "wir das nämlich hierauf pushen während das läuft also das ist auch ein ding wo ich mich"}, {"id": 1296, "start": 9536.38, "end": 9542.62, "text": "mal hinsetzen muss das können wir auch am stream mal wir machen in github actions workflow"}, {"id": 1297, "start": 9542.62, "end": 9550.18, "text": "auf obs levels auf an 1000 wir machen in github actions workflow was das alles macht oder"}, {"id": 1298, "start": 9550.18, "end": 9556.9, "text": "noch cooler noch besser wie leute ich weiß was wir machen ich weiß was wir machen wir"}, {"id": 1299, "start": 9556.9, "end": 9565.86, "text": "machen den docker feil für die asp.net anwendung und dann benutzen wir die neue github github"}, {"id": 1300, "start": 9565.86, "end": 9574.94, "text": "container registry um das um das zu speichern und das checken wir uns dann aus im workflow"}, {"id": 1301, "start": 9574.94, "end": 9583.18, "text": "irgendwie sowas das richtig big brain logik machen wir dann und was macht der dedos immer"}, {"id": 1302, "start": 9583.18, "end": 9594.34, "text": "noch nicht enttäuschend enttäuschende so also dann pushen remote ad price champ 2 heißt"}, {"id": 1303, "start": 9594.34, "end": 9608.58, "text": "es jetzt excellent push push price champ 2 in branch beta jawoll in branch price champ"}, {"id": 1304, "start": 9608.58, "end": 9626.86, "text": "2 geht check out wunderbar cp die datenbank kopieren wir mal rüber und ja ich habe forst"}, {"id": 1305, "start": 9626.86, "end": 9630.18, "text": "noch beim letzten mal dran gemacht das ist immer witzig auf der arbeit sag ich immer"}, {"id": 1306, "start": 9630.18, "end": 9643.46, "text": "leute macht forst nicht standardmäßig rein jetzt kontrollieren wir mal was so ich mache"}, {"id": 1307, "start": 9643.46, "end": 9663.94, "text": "jetzt den price champ aus guck mal den price champ mal zu beim ausgehen ich verstehe halt"}, {"id": 1308, "start": 9663.94, "end": 9667.86, "text": "echt nicht warum der hängt bei mir lokal geht er auch easy aus überhaupt kein problem"}, {"id": 1309, "start": 9667.86, "end": 9690.02, "text": "ok ich kill den price champ wieder geht immer noch alles juckt juckt die nicht kein china"}, {"id": 1310, "start": 9690.02, "end": 9713.98, "text": "dedos am start wie groß ist die db ach nicht so groß 6,4 gigabyte und das schreibt schon"}, {"id": 1311, "start": 9713.98, "end": 9740.74, "text": "vier tage am stück kram darein jetzt bei euch was hier los leute es ist nicht gefixt"}, {"id": 1312, "start": 9740.74, "end": 9748.74, "text": "ach so wisst ihr warum es nicht gefixt ist lull weh ich hab ich hab nicht gepusht ich"}, {"id": 1313, "start": 9748.74, "end": 9763.7, "text": "hab mich ich hab mich committed ich hab mich committed aber gebildet hammer ok ok ok ok"}, {"id": 1314, "start": 9763.7, "end": 9779.58, "text": "wisst ihr was der price champ der wird jetzt immer gekillt weil er irgendwie nicht will"}, {"id": 1315, "start": 9779.58, "end": 9801.38, "text": "so wir hängen das jetzt einfach an ans letzte und gut ist push price champ ok und jetzt auf"}, {"id": 1316, "start": 9801.38, "end": 9826.66, "text": "gehts ne ne dotnet run so jetzt sollte es jetzt sollte es gleich funktionieren ok das"}, {"id": 1317, "start": 9826.66, "end": 9847.9, "text": "kam noch aus dem cash what the what the fuck what"}, {"id": 1318, "start": 9847.9, "end": 9866.7, "text": "wait was musst du nicht aus g2 starten ich hab es ins erste gepusht ich hab es ins erste"}, {"id": 1319, "start": 9866.7, "end": 9876.22, "text": "gepusht dialerates ok ok ok okafter"}, {"id": 1320, "start": 9876.22, "end": 9886.1, "text": "was ist es doch auch"}, {"id": 1321, "start": 9886.1, "end": 9890.1, "text": "Ich hab schon richtig gepusht."}, {"id": 1322, "start": 9890.1, "end": 9895.1, "text": "Ok, Preischamp machen wir nochmal aus."}, {"id": 1323, "start": 9895.1, "end": 9900.1, "text": "Killen."}, {"id": 1324, "start": 9900.1, "end": 9905.1, "text": "Ähhh."}, {"id": 1325, "start": 9905.1, "end": 9916.1, "text": "Ich hab's doch."}, {"id": 1326, "start": 9916.1, "end": 9925.1, "text": "Also prinzipiell geht das doch."}, {"id": 1327, "start": 9925.1, "end": 9928.1, "text": "Ich bin verwirrt."}, {"id": 1328, "start": 9928.1, "end": 9932.1, "text": "Alles gut."}, {"id": 1329, "start": 9932.1, "end": 9944.1, "text": "Doch alles committed. Mal ein Bild machen."}, {"id": 1330, "start": 9944.1, "end": 9954.1, "text": "Woran könnte es das liegen, dass das jetzt nicht mehr aufgeht?"}, {"id": 1331, "start": 9954.1, "end": 9959.1, "text": "So Bild haben wir gemacht."}, {"id": 1332, "start": 9959.1, "end": 9964.1, "text": "Push."}, {"id": 1333, "start": 9964.1, "end": 9969.1, "text": "Preischamp."}, {"id": 1334, "start": 9969.1, "end": 9973.1, "text": "Achso ich weiß woran es gelegen hat. Lull."}, {"id": 1335, "start": 9973.1, "end": 9978.1, "text": "Ich bin im falschen Branch."}, {"id": 1336, "start": 9978.1, "end": 10001.1, "text": "Es wird Zeit für den ultimativen Big Brain Death Ops Workflow hier, ich sag's euch."}, {"id": 1337, "start": 10001.1, "end": 10007.1, "text": "Aha. Fixed Leute, fixed."}, {"id": 1338, "start": 10007.1, "end": 10012.1, "text": "Asp.net Core mit Vue, ja genau."}, {"id": 1339, "start": 10012.1, "end": 10035.1, "text": "Die coolen Leute, die würden das ja auch nicht auf zwei Hetsnetservern hausten, sondern die, also Leute, die die richtig im Trend sind, die würden, also erstens mal mindestens so wie ich das gemacht hätte, ein Backend Cloud Server, ein App Cloud Server, das ganze natürlich verdockerisiert und Netlify,"}, {"id": 1340, "start": 10035.1, "end": 10038.1, "text": "Netlify für, für das Frontend."}, {"id": 1341, "start": 10038.1, "end": 10043.1, "text": "Also das wäre mal das Mindeste, was man als richtig, richtig hipper,"}, {"id": 1342, "start": 10043.1, "end": 10052.1, "text": "Bro Kramer 2021 so macht."}, {"id": 1343, "start": 10052.1, "end": 10056.1, "text": "Ich habe mir jetzt übrigens bei Hetsna ein neues Projekt angelegt, das ich im Stream nichts mehr liege."}, {"id": 1344, "start": 10056.1, "end": 10064.1, "text": "Das habe ich extra genannt Alarm, mit so einem Alarm Emoji, der ja nicht öffnen."}, {"id": 1345, "start": 10064.1, "end": 10071.1, "text": "Netlify ist wirklich cool, ja."}, {"id": 1346, "start": 10071.1, "end": 10091.1, "text": "Was hat Max vor Feasy gelernt? Stonks Zeug habe ich gelernt, daher kommt ja meine Abneigung zur BWL Kram."}, {"id": 1347, "start": 10091.1, "end": 10095.1, "text": "So sieht ja normaler Traffic bei dem Ding aus, by the way."}, {"id": 1348, "start": 10095.1, "end": 10102.1, "text": "Leute, iChill ist am Start, iChill x4 Inno3D."}, {"id": 1349, "start": 10102.1, "end": 10107.1, "text": "So jetzt, jetzt lasse ich aber gut sein für heute, was die fixe Sachen angeht."}, {"id": 1350, "start": 10107.1, "end": 10110.1, "text": "Ihr dürft euch jetzt am aktuellen Preis Champ erfreuen."}, {"id": 1351, "start": 10110.1, "end": 10116.1, "text": "Du brauchst noch Easter Eggs, ich brauche erst mal alle Funktionen bevor ich Easter Eggs brauche."}, {"id": 1352, "start": 10116.1, "end": 10123.1, "text": "Wobei, wisst ihr was ein geiles Easter Egg wäre?"}, {"id": 1353, "start": 10123.1, "end": 10140.1, "text": "Dass man irgendwo Dings abgespielt bekommt."}, {"id": 1354, "start": 10140.1, "end": 10147.1, "text": "Das wirst du vielleicht wieder einbauen."}, {"id": 1355, "start": 10147.1, "end": 10156.1, "text": "Guck mal Leute, wie es aktualisiert hier."}, {"id": 1356, "start": 10156.1, "end": 10160.1, "text": "Ach guck mal, jetzt kann man sich gar nicht anzeigen lassen, was der rote."}, {"id": 1357, "start": 10160.1, "end": 10163.1, "text": "Vielleicht soll ich dann wirklich eine Legende einblenden lassen."}, {"id": 1358, "start": 10163.1, "end": 10166.1, "text": "Okay, aber das fixen wir heute nicht mehr online."}, {"id": 1359, "start": 10166.1, "end": 10170.1, "text": "Jetzt machen wir nur mal lokal. Kann man da eine Legende einblenden lassen?"}, {"id": 1360, "start": 10170.1, "end": 10181.1, "text": "Äh Fletcher, vier Monate, Dankeschön für den Sub."}, {"id": 1361, "start": 10181.1, "end": 10187.1, "text": "Wann postest du das auf Slashprogramm? Ich poste sowas prinzipiell nicht auf Reddit."}, {"id": 1362, "start": 10187.1, "end": 10191.1, "text": "Generell sind Foren wenig hilfreich, wenn es um sowas geht."}, {"id": 1363, "start": 10191.1, "end": 10195.1, "text": "Foren sind eher dafür da, Leute die neu anfangen zu verwirren."}, {"id": 1364, "start": 10195.1, "end": 10198.1, "text": "Weil sie denen immer erklären wollen, so nach dem Motto."}, {"id": 1365, "start": 10198.1, "end": 10207.1, "text": "In einem Forum fragt einer, wie mache ich eine Webseite mit zwei Bildern vom letzten Urlaub."}, {"id": 1366, "start": 10207.1, "end": 10210.1, "text": "Das ist die Frage im Forum. Oder auf Reddit."}, {"id": 1367, "start": 10210.1, "end": 10213.1, "text": "Und da kommt als Antwort, jetzt musst du erstmal Webpack lernen."}, {"id": 1368, "start": 10213.1, "end": 10216.1, "text": "Dann musst du dir noch irgendein Frontend Framework angucken."}, {"id": 1369, "start": 10216.1, "end": 10221.1, "text": "Nicht zu vergessen irgendwelche automatisierte Testing Suites."}, {"id": 1370, "start": 10221.1, "end": 10224.1, "text": "Dann musst du noch Flask und Python lernen fürs Backend."}, {"id": 1371, "start": 10224.1, "end": 10229.1, "text": "Und dann Svelte als Frontend noch dabei."}, {"id": 1372, "start": 10229.1, "end": 10243.1, "text": "Die verwirren die Leute so extrem. Ist echt der Wahnsinn."}, {"id": 1373, "start": 10243.1, "end": 10248.1, "text": "Oder wenn die dann anfangen. Was auch immer geil ist, wenn es eine.NET Geschichte ist."}, {"id": 1374, "start": 10248.1, "end": 10253.1, "text": "Die Leute fragen so nach dem Motto, wie filtre ich aus irgendeine Schulaufgabe."}, {"id": 1375, "start": 10253.1, "end": 10258.1, "text": "Wie filtre ich aus dem Array Elemente größer fünf raus."}, {"id": 1376, "start": 10258.1, "end": 10265.1, "text": "Was der Typ braucht ist, dass ihm einer sagt, an der Stelle nimmst du einen For Each."}, {"id": 1377, "start": 10265.1, "end": 10267.1, "text": "An der Stelle nimmst du einen Four. Das braucht er."}, {"id": 1378, "start": 10267.1, "end": 10271.1, "text": "Und die Leute schicken ihm dann so einen Link Query."}, {"id": 1379, "start": 10271.1, "end": 10274.1, "text": "Fünf Seiten lang ist Link Query und sagen, so gehts."}, {"id": 1380, "start": 10274.1, "end": 10276.1, "text": "Da kommt jetzt exakt raus, was du brauchst."}, {"id": 1381, "start": 10276.1, "end": 10281.1, "text": "Der Typ hat keinen Blasenschimmer, was der da eigentlich gerade liest."}, {"id": 1382, "start": 10281.1, "end": 10287.1, "text": "Und natürlich nicht zu vergessen, ohne Strukturam und UML Diagramm kannst du eh nix machen."}, {"id": 1383, "start": 10287.1, "end": 10289.1, "text": "Das haben wir ja in der Schule so gelernt."}, {"id": 1384, "start": 10289.1, "end": 10294.1, "text": "Ich hoffe ihr macht das auch alle so, wie man das immer lernt."}, {"id": 1385, "start": 10294.1, "end": 10298.1, "text": "Als erstes mal ein UML Diagramm und ein Strukturam machen."}, {"id": 1386, "start": 10298.1, "end": 10302.1, "text": "Macht ihr das auch so?"}, {"id": 1387, "start": 10302.1, "end": 10309.1, "text": "Also wenn ihr das nicht so macht, dann zweifle ich an euren professionellen Developer Skills."}, {"id": 1388, "start": 10309.1, "end": 10311.1, "text": "Ein Papp, ein Papp auch noch davor."}, {"id": 1389, "start": 10311.1, "end": 10313.1, "text": "Ein Papp muss auch noch sein."}, {"id": 1390, "start": 10313.1, "end": 10315.1, "text": "Und ganz wichtig ein Ishikawa Diagramm."}, {"id": 1391, "start": 10315.1, "end": 10319.1, "text": "Wisst ihr was ein Ishikawa Diagramm ist?"}, {"id": 1392, "start": 10319.1, "end": 10322.1, "text": "Ist auch ganz ganz wichtig."}, {"id": 1393, "start": 10322.1, "end": 10344.1, "text": "Das muss man auch vorher machen."}, {"id": 1394, "start": 10344.1, "end": 10347.1, "text": "Weg damit."}, {"id": 1395, "start": 10347.1, "end": 10352.1, "text": "Leute, fuck, jetzt hab ich voll verdrängt, was soll ich jetzt machen."}, {"id": 1396, "start": 10352.1, "end": 10354.1, "text": "Ich hab gesagt wir fixen das nicht mehr online, sondern..."}, {"id": 1397, "start": 10354.1, "end": 10359.1, "text": "Ihr müsst mir heben, mein Boomer hier leckt."}, {"id": 1398, "start": 10359.1, "end": 10364.1, "text": "Legende vom Chart, genau."}, {"id": 1399, "start": 10364.1, "end": 10366.1, "text": "Hat der Preis-Champ schon ein paar Einträge?"}, {"id": 1400, "start": 10366.1, "end": 10369.1, "text": "Warum hat der Preis-Champ noch keine Einträge?"}, {"id": 1401, "start": 10369.1, "end": 10383.1, "text": "Oh."}, {"id": 1402, "start": 10383.1, "end": 10388.1, "text": "Nein, es läuft nicht."}, {"id": 1403, "start": 10388.1, "end": 10390.1, "text": "Nein, nein, ich bin nicht geplogged."}, {"id": 1404, "start": 10390.1, "end": 10392.1, "text": "Das ist die List."}, {"id": 1405, "start": 10392.1, "end": 10395.1, "text": "Das ist das Ding, was dieser Docker-Container abrufen will."}, {"id": 1406, "start": 10395.1, "end": 10398.1, "text": "Ich weiß, von GitHub-Dings."}, {"id": 1407, "start": 10398.1, "end": 10401.1, "text": "Warum geht das nicht?"}, {"id": 1408, "start": 10401.1, "end": 10403.1, "text": "Da kann er nicht starten, wenn das nicht abrufbar ist."}, {"id": 1409, "start": 10403.1, "end": 10405.1, "text": "Das sackt."}, {"id": 1410, "start": 10405.1, "end": 10408.1, "text": "Ist doch abrufbar."}, {"id": 1411, "start": 10408.1, "end": 10412.1, "text": "Kegweight-Docker."}, {"id": 1412, "start": 10412.1, "end": 10413.1, "text": "So, Legende."}, {"id": 1413, "start": 10413.1, "end": 10414.1, "text": "Weil ich brauch erstmal was, wo was..."}, {"id": 1414, "start": 10414.1, "end": 10416.1, "text": "Wobei ich kann es auch so mit der Legende machen."}, {"id": 1415, "start": 10416.1, "end": 10422.1, "text": "Also Chart, Legende, hier."}, {"id": 1416, "start": 10422.1, "end": 10424.1, "text": "Legend, Legend gleich True."}, {"id": 1417, "start": 10424.1, "end": 10427.1, "text": "Alles klar."}, {"id": 1418, "start": 10427.1, "end": 10428.1, "text": "Kann man das nicht unten machen?"}, {"id": 1419, "start": 10428.1, "end": 10429.1, "text": "Das sieht da..."}, {"id": 1420, "start": 10429.1, "end": 10433.1, "text": "Äh."}, {"id": 1421, "start": 10433.1, "end": 10437.1, "text": "Äh."}, {"id": 1422, "start": 10437.1, "end": 10442.1, "text": "Onker-S."}, {"id": 1423, "start": 10442.1, "end": 10447.1, "text": "Das sieht scheiße aus mit der Legende."}, {"id": 1424, "start": 10447.1, "end": 10450.1, "text": "Oder?"}, {"id": 1425, "start": 10450.1, "end": 10452.1, "text": "Warum kann das nicht so eine Grafana-Legende machen?"}, {"id": 1426, "start": 10452.1, "end": 10454.1, "text": "So ein großes Ding ist UVP."}, {"id": 1427, "start": 10454.1, "end": 10456.1, "text": "Ach, die Leute sind nicht dumm."}, {"id": 1428, "start": 10456.1, "end": 10476.1, "text": "Die erkennen, dass das UVP ist."}, {"id": 1429, "start": 10476.1, "end": 10478.1, "text": "Nur zwei Punkte und an der Seite einladen."}, {"id": 1430, "start": 10478.1, "end": 10480.1, "text": "Ja, das funktioniert leider nicht."}, {"id": 1431, "start": 10480.1, "end": 10486.1, "text": "Man kann nur die Punkte komplett ausmachen."}, {"id": 1432, "start": 10486.1, "end": 10488.1, "text": "Wenn ich nämlich sowas hier mache,"}, {"id": 1433, "start": 10488.1, "end": 10491.1, "text": "der kann es nicht erweitern von einem Datenpunkt zunächst."}, {"id": 1434, "start": 10491.1, "end": 10496.1, "text": "Da hab ich plus von Sonntag bis Montag."}, {"id": 1435, "start": 10496.1, "end": 10497.1, "text": "Ach, Moment."}, {"id": 1436, "start": 10497.1, "end": 10503.1, "text": "Wenn man weiß, wo man drüber gehen muss, dann..."}, {"id": 1437, "start": 10503.1, "end": 10504.1, "text": "Äh."}, {"id": 1438, "start": 10504.1, "end": 10507.1, "text": "Das findet doch niemand."}, {"id": 1439, "start": 10507.1, "end": 10515.1, "text": "Das findet doch legit keiner."}, {"id": 1440, "start": 10515.1, "end": 10517.1, "text": "Was passiert eigentlich, wenn ich mehr Einträge mache,"}, {"id": 1441, "start": 10517.1, "end": 10522.1, "text": "als da steht?"}, {"id": 1442, "start": 10522.1, "end": 10524.1, "text": "Hör mal auf."}, {"id": 1443, "start": 10524.1, "end": 10528.1, "text": "Was ist das hier?"}, {"id": 1444, "start": 10528.1, "end": 10534.1, "text": "Warum macht er da nicht mehr Punkte?"}, {"id": 1445, "start": 10534.1, "end": 10537.1, "text": "Leute, was ist ein gutes Chart-Framework für JavaScript?"}, {"id": 1446, "start": 10537.1, "end": 10540.1, "text": "Das ist Chart.js."}, {"id": 1447, "start": 10540.1, "end": 10551.1, "text": "Ich hab mal Am-Charts verwendet vor einem Jahr oder so."}, {"id": 1448, "start": 10551.1, "end": 10553.1, "text": "Auf der Y-Achse stehen viel zu große Werte."}, {"id": 1449, "start": 10553.1, "end": 10554.1, "text": "Wieso?"}, {"id": 1450, "start": 10554.1, "end": 10555.1, "text": "Stimmt doch."}, {"id": 1451, "start": 10555.1, "end": 10576.1, "text": "2500 Euro, 0 Euro."}, {"id": 1452, "start": 10576.1, "end": 10580.1, "text": "Geh mal auf eine andere Karte."}, {"id": 1453, "start": 10580.1, "end": 10585.1, "text": "Ja, und das ist immer der gleiche Graph."}, {"id": 1454, "start": 10585.1, "end": 10587.1, "text": "Das ist immer der gleiche Graph."}, {"id": 1455, "start": 10587.1, "end": 10596.1, "text": "Falls du nicht gemerkt hast, der Graph ändert sich nicht."}, {"id": 1456, "start": 10596.1, "end": 10598.1, "text": "Ist immer der gleiche Graph."}, {"id": 1457, "start": 10598.1, "end": 10608.1, "text": "Deswegen steht ihr da auch in Arbeit dahinter."}, {"id": 1458, "start": 10608.1, "end": 10611.1, "text": "Aber die Legende ist kacke."}, {"id": 1459, "start": 10611.1, "end": 10617.1, "text": "Was hat man da für Optionen für Legende?"}, {"id": 1460, "start": 10617.1, "end": 10619.1, "text": "Top, left, bottom."}, {"id": 1461, "start": 10619.1, "end": 10620.1, "text": "Okay, okay."}, {"id": 1462, "start": 10620.1, "end": 10622.1, "text": "Wie macht man das?"}, {"id": 1463, "start": 10622.1, "end": 10624.1, "text": "Wow."}, {"id": 1464, "start": 10624.1, "end": 10625.1, "text": "Ach, wisst ihr was?"}, {"id": 1465, "start": 10625.1, "end": 10627.1, "text": "Das passt schon."}, {"id": 1466, "start": 10627.1, "end": 10633.1, "text": "Kann man Point-Radius eins machen?"}, {"id": 1467, "start": 10633.1, "end": 10634.1, "text": "Das passt schon."}, {"id": 1468, "start": 10634.1, "end": 10636.1, "text": "Komm mal, so lasst mal das."}, {"id": 1469, "start": 10636.1, "end": 10644.1, "text": "Da können die Leute draufklicken und erkennen, dass das UVP gut ist."}, {"id": 1470, "start": 10644.1, "end": 10650.1, "text": "Oder wir machen einfach Größe 60."}, {"id": 1471, "start": 10650.1, "end": 10672.1, "text": "Und dann ist es easy, dann findet man es überall."}, {"id": 1472, "start": 10672.1, "end": 10675.1, "text": "Kann man das hoch machen?"}, {"id": 1473, "start": 10675.1, "end": 10680.1, "text": "Point-Radius 10."}, {"id": 1474, "start": 10680.1, "end": 10681.1, "text": "Bäm."}, {"id": 1475, "start": 10681.1, "end": 10682.1, "text": "Voll beschissen aus."}, {"id": 1476, "start": 10682.1, "end": 10683.1, "text": "0W."}, {"id": 1477, "start": 10683.1, "end": 10684.1, "text": "Camping macht es gut."}, {"id": 1478, "start": 10684.1, "end": 10685.1, "text": "So, so lasse ich das jetzt."}, {"id": 1479, "start": 10685.1, "end": 10686.1, "text": "Reicht."}, {"id": 1480, "start": 10686.1, "end": 10687.1, "text": "So."}, {"id": 1481, "start": 10687.1, "end": 10688.1, "text": "Ähm."}, {"id": 1482, "start": 10688.1, "end": 10692.1, "text": "Hat sich der Preis-Cham selbst wieder eingependelt?"}, {"id": 1483, "start": 10692.1, "end": 10693.1, "text": "Jawohl, geht alles."}, {"id": 1484, "start": 10693.1, "end": 10695.1, "text": "PC King hat was am Start."}, {"id": 1485, "start": 10695.1, "end": 10697.1, "text": "So, gucken wir mal auf den Preis-Cham drauf."}, {"id": 1486, "start": 10697.1, "end": 10698.1, "text": "Was gibt es hier Neues?"}, {"id": 1487, "start": 10698.1, "end": 10699.1, "text": "Schönes."}, {"id": 1488, "start": 10699.1, "end": 10701.1, "text": "Komm mal hier, fast alles verfügbar."}, {"id": 1489, "start": 10701.1, "end": 10702.1, "text": "Seht ihr mal, Leute."}, {"id": 1490, "start": 10702.1, "end": 10703.1, "text": "Unsere Seite hat funktioniert."}, {"id": 1491, "start": 10703.1, "end": 10709.1, "text": "Das, wir haben doch, wir haben doch die, wir haben das doch geadded, die 6900."}, {"id": 1492, "start": 10709.1, "end": 10712.1, "text": "Das ist die, die wir vorhin geadded haben."}, {"id": 1493, "start": 10712.1, "end": 10717.1, "text": "Gibt es nur auf Alternate."}, {"id": 1494, "start": 10717.1, "end": 10722.1, "text": "Es, also man muss ja sagen, das Pop-Up sieht ein bisschen kacke aus, wenn da nur ein Shop"}, {"id": 1495, "start": 10722.1, "end": 10723.1, "text": "drin steht."}, {"id": 1496, "start": 10723.1, "end": 10729.1, "text": "Vielleicht sollte man das noch in die Mitte machen, wenn da nur ein Shop drin ist."}, {"id": 1497, "start": 10729.1, "end": 10737.1, "text": "By the way, Docker, was ist das Problem hier gerade?"}, {"id": 1498, "start": 10737.1, "end": 10739.1, "text": "Was ist eigentlich mit einem Dark Mode?"}, {"id": 1499, "start": 10739.1, "end": 10741.1, "text": "Ah, Dark Mode ist eine coole Idee."}, {"id": 1500, "start": 10741.1, "end": 10744.1, "text": "Dark Mode ist auch easy umzusetzen."}, {"id": 1501, "start": 10744.1, "end": 10745.1, "text": "Das machen wir noch."}, {"id": 1502, "start": 10745.1, "end": 10746.1, "text": "Mir ist eh langweilig."}, {"id": 1503, "start": 10746.1, "end": 10748.1, "text": "Ich bin echt nicht richtig müde heute."}, {"id": 1504, "start": 10748.1, "end": 10749.1, "text": "Ähm."}, {"id": 1505, "start": 10749.1, "end": 10752.1, "text": "Jetzt crawlt er."}, {"id": 1506, "start": 10752.1, "end": 10755.1, "text": "Im Docker hat er vorher nicht gecrawlt."}, {"id": 1507, "start": 10755.1, "end": 10763.1, "text": "Jetzt habe ich aber wieder 100% CPU-Auslastung, Lokal Null."}, {"id": 1508, "start": 10763.1, "end": 10769.1, "text": "Nee, ich, ich, das, das Dark Mode machen wir noch schnell."}, {"id": 1509, "start": 10769.1, "end": 10771.1, "text": "Das geht nämlich wirklich sehr, sehr zackig."}, {"id": 1510, "start": 10771.1, "end": 10774.1, "text": "Ist nur die Frage, wo wir das hinmachen."}, {"id": 1511, "start": 10774.1, "end": 10777.1, "text": "Kann, kann man das nicht zentrieren?"}, {"id": 1512, "start": 10777.1, "end": 10784.1, "text": "Kann man nicht?"}, {"id": 1513, "start": 10784.1, "end": 10787.1, "text": "Moment, das, guck mal, wie's geht jetzt."}, {"id": 1514, "start": 10787.1, "end": 10793.1, "text": "Line-Shot nehmen wir noch mal."}, {"id": 1515, "start": 10793.1, "end": 10798.1, "text": "Äh, wenn nur eins da ist."}, {"id": 1516, "start": 10798.1, "end": 10804.1, "text": "Sprit."}, {"id": 1517, "start": 10804.1, "end": 10808.1, "text": "Ja."}, {"id": 1518, "start": 10808.1, "end": 10816.1, "text": "Aber wie, aber das war doch richtig."}, {"id": 1519, "start": 10816.1, "end": 10822.1, "text": "Jetzt muss ich die Kram nur noch zentrieren."}, {"id": 1520, "start": 10822.1, "end": 10831.1, "text": "Aber dann ist es nicht mehr, aber dann ist es nicht mehr so cool responsive, wenn ich das wegmache."}, {"id": 1521, "start": 10831.1, "end": 10833.1, "text": "Ach komm."}, {"id": 1522, "start": 10833.1, "end": 10836.1, "text": "Wir werden's überleben."}, {"id": 1523, "start": 10836.1, "end": 10838.1, "text": "Und so, so schlimm sieht's jetzt anders aus."}, {"id": 1524, "start": 10838.1, "end": 10840.1, "text": "Ist halt dann nur ein Ding."}, {"id": 1525, "start": 10840.1, "end": 10849.1, "text": "Hängt halt ein bisschen links in der Ecke, aber okay."}, {"id": 1526, "start": 10849.1, "end": 10856.1, "text": "Okay, also, Dark Seam ist total einfach zu konfigurieren."}, {"id": 1527, "start": 10856.1, "end": 10860.1, "text": "Muss ich mir aber trotzdem mal abgucken, weil falsch, der weiß, wie's funktioniert."}, {"id": 1528, "start": 10860.1, "end": 10862.1, "text": "Aber es ist einfach."}, {"id": 1529, "start": 10862.1, "end": 10869.1, "text": "Und danach gehen wir ins Bett."}, {"id": 1530, "start": 10869.1, "end": 10874.1, "text": "Ja, also da muss man die config."}, {"id": 1531, "start": 10874.1, "end": 10875.1, "text": "Ja."}, {"id": 1532, "start": 10875.1, "end": 10877.1, "text": "Seam Dark True."}, {"id": 1533, "start": 10877.1, "end": 10881.1, "text": "Und zack, ist Dark Seamed."}, {"id": 1534, "start": 10881.1, "end": 10883.1, "text": "Jetzt muss man nur noch einen Schalter einbauen."}, {"id": 1535, "start": 10883.1, "end": 10901.1, "text": "Und das sieht Dark auch gar nicht so übel aus."}, {"id": 1536, "start": 10901.1, "end": 10909.1, "text": "So, das guck ich mir jetzt einfach ab."}, {"id": 1537, "start": 10909.1, "end": 10913.1, "text": "Wo, wo hab ich hier meinen Seam Switcher drin?"}, {"id": 1538, "start": 10913.1, "end": 10917.1, "text": "Home?"}, {"id": 1539, "start": 10917.1, "end": 10928.1, "text": "Moment, hatte ich das da überhaupt, hatte ich überhaupt den Monarch Essen Seam Switcher?"}, {"id": 1540, "start": 10928.1, "end": 10933.1, "text": "Ah nee, das ist standardmäßig Dark."}, {"id": 1541, "start": 10933.1, "end": 10940.1, "text": "Nee, ich mach, die Boomer, die wollen das nicht auf standardmäßig Dark."}, {"id": 1542, "start": 10940.1, "end": 10945.1, "text": "Ich glaub, man kann aber einfach setzen."}, {"id": 1543, "start": 10945.1, "end": 10947.1, "text": "Ich glaub, das war ziemlich easy."}, {"id": 1544, "start": 10947.1, "end": 10959.1, "text": "Man musste sagen, irgendwie, this Beautify Theme Dark gleich True oder so."}, {"id": 1545, "start": 10959.1, "end": 10961.1, "text": "Ah, easy, das war's."}, {"id": 1546, "start": 10961.1, "end": 10964.1, "text": "Genau, siehst du, aus dem Kopf."}, {"id": 1547, "start": 10964.1, "end": 10966.1, "text": "Oder auch nicht."}, {"id": 1548, "start": 10966.1, "end": 10968.1, "text": "Doch, aus dem Kopf."}, {"id": 1549, "start": 10968.1, "end": 10969.1, "text": "So, und jetzt brauchen wir nur noch einen Knopf."}, {"id": 1550, "start": 10969.1, "end": 10973.1, "text": "Wo machen, wo könnte man da einen guten Knopf hin machen für Dark Seamed?"}, {"id": 1551, "start": 10973.1, "end": 10979.1, "text": "Ob rechts?"}, {"id": 1552, "start": 10979.1, "end": 10982.1, "text": "Irgendwo hier so?"}, {"id": 1553, "start": 10982.1, "end": 10987.1, "text": "Ob links, ob rechts?"}, {"id": 1554, "start": 10987.1, "end": 11001.1, "text": "Ja, also, VBTN, Icon."}, {"id": 1555, "start": 11001.1, "end": 11008.1, "text": "So, MDE idea ist glaub ich die Lampe, ne?"}, {"id": 1556, "start": 11008.1, "end": 11015.1, "text": "Ok, das kann, warum kann ich mir diese Material Design Icons nicht merken?"}, {"id": 1557, "start": 11015.1, "end": 11018.1, "text": "Auf den Keks klicken."}, {"id": 1558, "start": 11018.1, "end": 11020.1, "text": "Das ist eine coole Idee."}, {"id": 1559, "start": 11020.1, "end": 11023.1, "text": "Auf den Keks klicken."}, {"id": 1560, "start": 11023.1, "end": 11027.1, "text": "Ey, das ist eine geile Idee."}, {"id": 1561, "start": 11027.1, "end": 11044.1, "text": "Man kann es ja zusätzlich machen."}, {"id": 1562, "start": 11044.1, "end": 11048.1, "text": "So, jetzt hätten wir noch einen Icon da oben mit Button."}, {"id": 1563, "start": 11048.1, "end": 11055.1, "text": "Aber wir machen auf den Keks klicken, das finde ich jetzt eine coole Idee."}, {"id": 1564, "start": 11055.1, "end": 11060.1, "text": "Aus Versehen auf den Keks geklickt, blind."}, {"id": 1565, "start": 11060.1, "end": 11064.1, "text": "Toggle Sieme."}, {"id": 1566, "start": 11064.1, "end": 11065.1, "text": "Das Sieme toggeln wir."}, {"id": 1567, "start": 11065.1, "end": 11069.1, "text": "So, wo sind wir hier?"}, {"id": 1568, "start": 11069.1, "end": 11072.1, "text": "Dark Seamed, wo sind wir, wo sind wir?"}, {"id": 1569, "start": 11072.1, "end": 11074.1, "text": "Da, ich hab's."}, {"id": 1570, "start": 11074.1, "end": 11075.1, "text": "Bin es schon wieder nicht mehr."}, {"id": 1571, "start": 11075.1, "end": 11077.1, "text": "Mounted, irgendwo in Mounted."}, {"id": 1572, "start": 11077.1, "end": 11083.1, "text": "Ah, ich kacke nur, hab's gelöscht."}, {"id": 1573, "start": 11083.1, "end": 11091.1, "text": "Wenn man da drauf kommt, der Keg W Sound, das ist auch eine gute Idee."}, {"id": 1574, "start": 11091.1, "end": 11092.1, "text": "Excellent Switch."}, {"id": 1575, "start": 11092.1, "end": 11096.1, "text": "Das ist die faulste Variante für einen Switch, der mir jetzt eingefallen ist."}, {"id": 1576, "start": 11096.1, "end": 11103.1, "text": "Okay."}, {"id": 1577, "start": 11103.1, "end": 11109.1, "text": "Ach, Moment, was mache ich da für einen Blödsinn?"}, {"id": 1578, "start": 11109.1, "end": 11110.1, "text": "Klick."}, {"id": 1579, "start": 11110.1, "end": 11111.1, "text": "Ich toggle Sie."}, {"id": 1580, "start": 11111.1, "end": 11112.1, "text": "Lull."}, {"id": 1581, "start": 11112.1, "end": 11113.1, "text": "Zu spät."}, {"id": 1582, "start": 11113.1, "end": 11118.1, "text": "Zack."}, {"id": 1583, "start": 11118.1, "end": 11120.1, "text": "Wisst ihr, was jetzt noch cool wäre?"}, {"id": 1584, "start": 11120.1, "end": 11128.1, "text": "Wenn wir den Keks mit einer Sonnenbrille hätten."}, {"id": 1585, "start": 11128.1, "end": 11139.1, "text": "Wir haben doch Woop Prime, der hat doch eine Sonnenbrille auf."}, {"id": 1586, "start": 11139.1, "end": 11142.1, "text": "Woop."}, {"id": 1587, "start": 11142.1, "end": 11149.1, "text": "Wir haben doch Woop Prime, der hat doch eine Sonnenbrille auf."}, {"id": 1588, "start": 11149.1, "end": 11164.78, "text": "Our"}, {"id": 1589, "start": 11164.78, "end": 11168.1, "text": "Copy, Image, Adress, ah nee, den hab ich erst."}, {"id": 1590, "start": 11168.1, "end": 11170.1, "text": "Woop Prime würde mega gut passen, ja."}, {"id": 1591, "start": 11170.1, "end": 11176.1, "text": "Mein Problem ist nur, haben wir noch einen Mod am Start, der zufällig einen Link hat"}, {"id": 1592, "start": 11176.1, "end": 11177.8, "text": "zu dem Emote in High Res."}, {"id": 1593, "start": 11177.8, "end": 11182.76, "text": "Ich habe das auf dem account nicht wo erziehst du die preise da von von allen möglichen shop seiten"}, {"id": 1594, "start": 11182.76, "end": 11203.86, "text": "mordcheck mordcheck alles schon weg"}, {"id": 1595, "start": 11212.76, "end": 11220.36, "text": "ja wo kriege ich meine eigenen emotes jetzt her"}, {"id": 1596, "start": 11220.36, "end": 11230.76, "text": "gab sich twitch emotes search die seite online ja hier kannst du ausprobieren"}, {"id": 1597, "start": 11230.76, "end": 11234.52, "text": "beta punkt preisschirm punkt org"}, {"id": 1598, "start": 11234.52, "end": 11245.56, "text": "twitch emotes search ja"}, {"id": 1599, "start": 11245.56, "end": 11256.28, "text": "dann haben wir prime aber drauf wenn es wenn es dark ist eigentlich richtig cool"}, {"id": 1600, "start": 11256.28, "end": 11264.24, "text": "warte mal ich habe eine idee ich mal kurz ausblenden"}, {"id": 1601, "start": 11264.24, "end": 11288.92, "text": "starte mal kurz admin admin fenster ich darf nicht darauf zugreifen na geil"}, {"id": 1602, "start": 11288.92, "end": 11300.28, "text": "darf ich nicht mal als admin drauf zugreifen keck weh das denn users da habe ich doch"}, {"id": 1603, "start": 11300.28, "end": 11309.48, "text": "ok"}, {"id": 1604, "start": 11309.48, "end": 11324.44, "text": "wie kopiert man was in der winnaus cmd leute copy cp weiß ich wie das geht wie kopiert man"}, {"id": 1605, "start": 11324.44, "end": 11331.28, "text": "der winnaus cmd alter ich kann nicht rechtstück machen das ist kommandos sein fenster nein ich"}, {"id": 1606, "start": 11331.28, "end": 11348.68, "text": "meine datei kopieren datei kopieren cmd copy file gehen das x copy kann man nicht einfach"}, {"id": 1607, "start": 11348.68, "end": 11360.88, "text": "eine datei kopieren unter winnaus einfach copy ok copy"}, {"id": 1608, "start": 11360.88, "end": 11376.84, "text": "wub boom wub leak wub old wub pock wub prime wub prime will ich kopieren"}, {"id": 1609, "start": 11376.84, "end": 11387.48, "text": "nach c doppelpunkt users stream so hat er das jetzt kopiert"}, {"id": 1610, "start": 11387.48, "end": 11412.8, "text": "ok easy ich kann euch wieder einblenden was ein act so ein kram zu kopieren ok jetzt hat"}, {"id": 1611, "start": 11412.8, "end": 11418.16, "text": "es twitch emote schon gefahren jetzt habe ich jetzt habe ich schon kopiert wub prime da"}, {"id": 1612, "start": 11418.16, "end": 11423.76, "text": "ist es muss den kram nur noch kurz die vm in die vm kopieren"}, {"id": 1613, "start": 11423.76, "end": 11444.48, "text": "kopieren wir den kram mal kurz rein wub prime zack und jetzt wub prime in assets alles klar"}, {"id": 1614, "start": 11444.48, "end": 11457.04, "text": "da sind wir am start wub prime so also klick klick ist das so source müsste doch eigentlich"}, {"id": 1615, "start": 11457.04, "end": 11471.0, "text": "auch so gehen source wenn das dark dann hoffe das funst weil ich da mache dann das und wenn"}, {"id": 1616, "start": 11471.0, "end": 11482.04, "text": "ansonsten erstmal gucken ob es prinzipiell geht ah Mist ok ok das dynamisch machen geht"}, {"id": 1617, "start": 11482.04, "end": 11508.44, "text": "sieht schonmal nett ich erwarte dass das geht wenn if else können wir machen ne ok das"}, {"id": 1618, "start": 11508.44, "end": 11531.08, "text": "funktioniert nicht source dann ups jetzt habe ich komplett kaputt gemacht lull achso ok"}, {"id": 1619, "start": 11531.08, "end": 11541.8, "text": "guck mal was der flow in oben geschrieben hat hat er denn geschrieben"}, {"id": 1620, "start": 11541.8, "end": 11562.32, "text": "agile microservices hat er geschrieben so dann machen wir sowas jetzt hier if u if wenn"}, {"id": 1621, "start": 11562.32, "end": 11575.88, "text": "das nicht dark ist dann das weil das ist ja das normale und das andere ist u else wub"}, {"id": 1622, "start": 11575.88, "end": 11592.88, "text": "prime"}, {"id": 1623, "start": 11592.88, "end": 11615.72, "text": "ich glaube das hat er nicht gecheckt sehr gut das ist ja cool oder erst pockt er erst"}, {"id": 1624, "start": 11615.72, "end": 11624.56, "text": "pockt er und im dunklen hat er hat er easy money easy life das finde ich richtig nice"}, {"id": 1625, "start": 11624.56, "end": 11638.0, "text": "das gefällt mir dark reader brauchen wir nicht wir haben net native dark dark theme"}, {"id": 1626, "start": 11638.0, "end": 11653.92, "text": "das ist sogar halbwegs gut lesbar dark das dark theme braucht vielleicht noch ein paar"}, {"id": 1627, "start": 11653.92, "end": 11670.48, "text": "optimierungen alles gut erkennbar ist da nicht aber hauptsache asus hat keck keck weight"}, {"id": 1628, "start": 11670.48, "end": 11684.2, "text": "drinne hauptsache asus hat keck weight weil kein preis ja das das passt sich leider nicht"}, {"id": 1629, "start": 11684.2, "end": 11707.16, "text": "an dark theme an in 45 min nur hast du gewürzter ja schau alles cool aber so lang bleib ich"}, {"id": 1630, "start": 11707.16, "end": 11735.88, "text": "die katze war an der tür preis unter uvp ja wunsch denken der punkt ist viel zu klein"}, {"id": 1631, "start": 11735.88, "end": 11758.16, "text": "und auch so fett man"}, {"id": 1632, "start": 11758.16, "end": 11779.28, "text": "das noch so machen das diagramm sieht schon ein bisschen räudig schlecht aus oder weil"}, {"id": 1633, "start": 11779.28, "end": 11788.28, "text": "es hier ein loch hat vorne und hinten warum warum hat das warum hat das hier so ein ding"}, {"id": 1634, "start": 11788.28, "end": 11800.76, "text": "also leute jetzt ins bett gehen wir sehen uns dann guck mal hier wie das sieht cool aus"}, {"id": 1635, "start": 11800.76, "end": 11811.76, "text": "wie er das aktualisiert ja leute soll ich noch soll ich noch schnell den preis champ"}, {"id": 1636, "start": 11811.76, "end": 11818.04, "text": "mit neuen mit neuen bildern pushen mit dark theme kommen das machen wir jetzt noch schnell"}, {"id": 1637, "start": 11818.04, "end": 11826.16, "text": "erkannte kann er da kann der dedos du sich noch mal dann auslassen lokal kann ich das"}, {"id": 1638, "start": 11826.16, "end": 11836.92, "text": "doch auch quitten wo ist das problem ja es war ich gehe gleich gleich auf ich push jetzt"}, {"id": 1639, "start": 11836.92, "end": 11856.56, "text": "noch das ding hier und dann ist gut"}, {"id": 1640, "start": 11856.56, "end": 11872.2, "text": "das löst er da alles"}, {"id": 1641, "start": 11872.2, "end": 11895.84, "text": "der wird schon der wird schon wissen was er macht erst mal schön anhängen so mit der"}, {"id": 1642, "start": 11895.84, "end": 11913.16, "text": "killen check out was da ist ja nicht ganz so opti optimaler workflow check out beta release"}, {"id": 1643, "start": 11913.16, "end": 11926.32, "text": "ist der preis champ wieder am start die musik eigentlich ist das relaxen kirby music oder"}, {"id": 1644, "start": 11926.32, "end": 11935.32, "text": "so was stand da doch dran ane happy happy und epic nicht relaxen"}, {"id": 1645, "start": 11935.32, "end": 11947.4, "text": "beim leute du musst mal refreshen du musst mal refreshen ohne ohne cash dann gehts bestimmt"}, {"id": 1646, "start": 11947.4, "end": 11966.88, "text": "bei dir auch nice ok leute viel spaß mit dem preis champ"}, {"id": 1647, "start": 11966.88, "end": 11980.0, "text": "heute nacht ich gehe jetzt auf gepen noch einmal für alle die schon länger dabei sind"}, {"id": 1648, "start": 11980.0, "end": 11996.12, "text": "die übliche outro musik die habe ich die letzte zeit etwas vernachlässigt wir sehen"}, {"id": 1649, "start": 11996.12, "end": 12021.32, "text": "uns leute bis denn see you"}]}