{"text": "So, da sind wir ein bisschen später als gedacht. Eigentlich habe ich gedacht, ich Kreiselgrinder heute Abend ein bisschen komme gar nicht on, aber ich hatte irgendwie dann doch keinen Bock mehr. Hab gedacht, komm, machst du noch, machst noch mal eine Stunde an, ey. Oh, ich bin irgendwie voll kaputt heute. Es war überhaupt schon jemand da. Cute Chat. Excellent Chat. Ah, der KarniL10 ist schon da. Bam, 2, 4, 6, okay, ein paar sind doch noch da. Angeblich sind nur vier Leute da, das heißt wir haben jetzt schon 50% im Chat. Quickmuffs. Phoenix ist auch am Start, ne Leute, ich bin halt irgendwie total kaputt. Kennt ihr das irgendwie, dass manchmal, dass ihr das Gefühl habt, also immer so die Leute, die auch so IT und Umfeld arbeiten, habt ihr manchmal den Eindruck, dass ihr irgendwie so Babysitter machen müsst für irgendwelche Projektmanager, weil die eigentlich das Projekt managen sollen, aber gar keine Ahnung haben davon, was die eigentlich machen. Ja, ist irgendwie sehr merkwürdig. Was geht, wie gesagt, nicht viel. Was gibt es eigentlich für sinnvolle IT-Zertifikate, das werde ich immer im Stream gefragt, so nach dem Motto, Max, was hältst du von Zertifikaten, ich habe gar keine Ahnung, was ist für gute, was es für gute Zertifikate gibt, müssen wir gleich mal so was, useful IT, komm, wir suchen mal auf Deutsch, sinnvolle IT-Zertif, IT-Zertif, weil ich habe echt keine Ahnung, was da für gute Sachen gibt. Also ja, mal von den üblichen Verdächtigen, so was, wie ein CCNA abgesehen, aber ein CCNA juckt doch im Endeffekt auch keinen, CCNA ist das, ist quasi der Cisco Noob, nur nicht ganz, also der Cisco Einsteiger plus nicht mal ganz so Noob, CCNA Krieger hat doch, ja hat doch entweder jeder, oder kannst du einem, was mit dem CCNA lernt, kannst du einem in der Woche beibringen. Jaja, also, ja, aber wie gesagt, jetzt wo ein bisschen mehr Leute da sind, kennt ihr das? Wenn ihr, wenn ihr das Gefühl habt, ihr müsst irgendwie Babysitter für irgendwelche Projektmanager machen, weil die sonst ganz merkwürdige Dinge machen würden, also zum Beispiel, zum Beispiel habe ich, habe ich bei uns ein Ticket gekriegt, da steht drinnen, ich soll, also nicht näher definiert, irgendwelche Ressourcen schätzen. So, da habe ich erstmal gefragt, ok, was genau meinste denn eigentlich? Leute, Hardware, Cluster-Ressourcen, was, was denn für Ressourcen, da hat es großartig ausgeholt, so nach dem Motto, ja alles, alles, und dann habe ich gesagt, ja, was wollt ihr denn machen? Ja, sie wollen das quasi einmal die komplette, komplette Infrastruktur klonen, habe ich auch gemeint, so, seid ihr euch sicher, also ist, ist, ist euch klar, was ihr da gerade erzählt oder nicht, komplette Infrastruktur klonen, auch noch ein drittes Rechenzentrum oder was, oder wie, ähm, hast du das mitbekommen mit Google plus Deutsche Bank, nee, nee, habe ich nicht mitbekommen, was denn? Ne, ähm, so, und dann, und dann, was witziger war, jetzt lief es darauf raus, jetzt lief es darauf raus, dass, wir haben ja auch ein paar Kubernetes, wir haben ja auch zwei Kubernetes Cluster und ein paar Linux Container und sowas, ich habe halt gefragt, ok, was, was wollt ihr denn für Ressourcen wissen bei, bei VMs oder gar bei Container, und da haben die geschrieben, die Anzahl, mir gedacht, ok, das ist zwar überhaupt nicht das, was irgendwie sinnvoll ist, aber, dann schreibe ich euch halt mal rein, wir haben, äh, ein Pod davon, zwei Pods davon, drei davon, zwei davon und sonst was, wir mal gucken, was ihr davon macht, ja, aber übrigens, dann habe ich nochmal die Hardware rausgesucht, worauf das läuft, und dann haben sie erzählt, sie wollen irgendwie was, was komplett anderes, also, ich bin, ich meine, ich muss doch nicht die Arbeit von irgendeinem Projektmanager machen, das kann der machen, der soll mir sagen, was er haben will, ja, also, wenn er das nicht weiß, da kriegt er halt genau das, irgendwas, weil woher soll ich es wissen, äh, das kommt meist der, dass die Projektmanager zum Teil technologisch und nicht ansatzweise wissen, was da abgeht, ja, das stimmt, aber es wäre schon mal allen Beteiligten geholfen, wenn sie da nicht so tun würden, so tun, so tun würden, als ob sie es wissen, weil viele Projektmanager haben so einen, haben wahrscheinlich einen Rhetorikkurs gemacht, so nach dem Motto, wie verkaufe ich überzeugend, wovon ich gar keine Ahnung habe, das ist bestimmt ein sinnvoller Skill, wenn es darum geht, Projekte irgendwie noch höhere Managementleuten zu, äh, präsentieren, allerdings beim Einsammeln von Informationen sollte man diesen Skill deaktivieren, weil ansonsten wirkt das so, als hätte man Ahnung, obwohl man gar keine Ahnung hat, dementsprechend kriegt man gar nicht die Infos, die man haben will, das wäre ja schon immer ein erster Schritt, wenn man das gleich mal sagt, so nach dem Motto, ok, ähm, erklär mal langsam, bei uns ist auch immer geil, der interne Auftraggeber von einer internen Software kann sich nichts vorstellen, also, alles erstmal bauen, sodass alles klappt und danach umbauen oder neue exzellent effizientes Zeitmanagement, ja, ja sowieso ähnliche Dinge haben wir auch, bei uns läuft das aber meistens so, irgendwelche Marketingköppe, ich hab eigentlich keine Ahnung, weil das alles so ist, machen irgendwie ne ganz tolle Präsentation zu was, wovon eigentlich auch keiner genau weiß, ähm, was es werden soll, ja, zum Beispiel, ich muss das ein bisschen abändern, damit es nicht zu klar ist, um was es geht, oh Tainsaw geht hier wieder ab, drei Subs, danke schön, wer kriegt denn was, der Twinkower kriegt was, End of Function und der Akte, Poggers, exzellent, Big Brain, Huge Subscription, das ist ja quasi fast schon, Moment, ich finde es nicht, exzellent, ähm, genau, und bei uns halten die immer irgendwelche, irgendwelche geilen Präsentationen, bevor man genau weiß, was abgeht, so, und wir haben jetzt was, da hat irgendjemand gedacht, ok, Tesla und Elon Musk und SpaceX und sowas, ist grad voll angesagt, und hat dann gesagt, wir machen jetzt ein Projekt, ähm, unser Flug zum Mars, es hat mit dem Flug zum Mars nichts zu tun, also nicht, das heißt einfach nur so, ach ne, Elon Musk, nicht Elon Musk, Elon Musk, komm ich auf, Elon Musk, Elon Musk, so, zumindest ist auch wurscht, mir gehts ja nicht, zumindest ist das grad angesagt, SpaceX, Elon Musk, Tesla, alles mögliche, und da hat jetzt irgendjemand bei uns ein Projekt ins Leben gerufen, unser Flug zum Mars, es hat, wie gesagt, ich hab es ein bisschen abgewandelt, es ist ein bisschen anders, und wenn man da jetzt denkt, ok, wir wollen zum Mars, da bin ich der erste, der sagt, ich flieg da garantiert nicht mit, wenn wir zum Mars fliegen, äh, Fleege Express Twitch Prime, dankeschön, vier Monate, huge, so, und, um was es letztendlich geht ist, und warum das so heißt, hat nur zwei Gründe, erstens, weil man Mars abgekürzt hat zu irgendwas, frag mich nicht, blah, services, irgendwas, also, weil man gesehen hat, Mars ist eine coole Abkürzung, und weil man eine Präsentation machen konnte, die, kein Witz, aufgebaut ist wie eine Rakete, sieht aus wie eine Rakete, ja, so, sieht cool aus, hat natürlich keinen Mehrwert, und was es im Endeffekt gehen soll ist, komplett abstrakt, dass alle services quasi in die Cloud wandern sollen, so, komplett abstraktes Ding, so, und es hat da jetzt irgendeiner präsentiert, und hat sich gefreut, dass das gut angekommen ist, weil es so eine stylische Präsentation war, aber was jetzt damit gemacht werden soll, weiß keiner so genau, es ist einfach da, gifted it here so once a Blockwatcher, Big Brain, der Blockwatcher hat was gekriegt, dankeschön, für den fünften Sub hier schon, exzellente, naja, und sowas haben wir laufend, und ich weiß, dass es woanders nicht viel besser läuft, man sagt immer so, oh, ich brauche mal ein Wasser hier, wo habe ich denn, glaube ich im kleinen Wasserholen, ich höre das ja auch von anderen, dass es da ähnlich läuft, wo ich mich immer frage, wo es mich dann nicht wundert, dass manche Start-ups Sachen einfach eleganter und besser hinkriegen als irgendwelche großen Dinger, wenn man sich überlegt, wie das bei uns sein wird, also das Scam-Train läuft, der Scam-Train ist am Start, Lim Squizzy hat Twitch Prime abonniert, dankeschön, der Chibay-Train läuft, ok, solange der Chibay-Train läuft, erzähle ich euch das nochmal kurz weiter, das Scam-Train, ja, NicoCS Twitch Prime, sieben Monate, dankeschön, aja ja, Poggers Subscription, so, was wollte ich jetzt sagen, genau, also das wundert mich manchmal nicht, wie gut das Start-ups hinkriegen, weil da ist einfach viel Overhead nicht vorhanden, ja, bei uns ist es teilweise so, jetzt mal ganz übertrieben gesagt, aber es ist schon ziemlich nah an der Wahrheit dran, also bei uns ist es manchmal so, wenn du es richtig machst, also so, dass es dir was bringt, dem eigenen Team was bringt und alle anderen das Gefühl haben, es hätte was gebracht, dann musst du Folgendes machen bei uns und wahrscheinlich ist das bei vielen, die in einem größeren Laden machen, ähnlich, man tippt eine Zeile auf der Shell, die irgendwas halbwegs Sinnvolles macht, es ist gar nicht mal so entscheidend, wie sinnvoll das ist und danach geht man in Gruppenleiter-Runden, Abteilungsrunden, IT-Runden, Statusrunden und erzählt für den nächsten Monat, dass man diese eine Sache gemacht hat und dann feiern sich alle richtig krass drauf ab, dass man wieder so geile Sachen gemacht hat und am Ende hast du eigentlich nichts gemacht, richtig, aber alle haben das Gefühl, es war richtig geil, was bei uns teilweise für kleine Dinge riesig breit getreten werden und fünf Stunden Retrospektive, sonstige Abstimmungsdinger gemacht werden, das nimmt teilweise total überhand. Scheiße, das ist bei uns genauso, ey ich glaube, das ist bei den meisten so. Wir haben übrigens noch mehr Subs, hab ich gerade gesehen, General Slane hat auch wieder Subs, drei Monate, dankeschön, excellent Subs, big brain. Ja und der Witz dabei ist ja auch noch, warum ich das jetzt erzähle ist, der Captain Peng spricht's gerade an, der Witz dabei ist auch noch, dass das alle lieber ist, wie man macht in seiner Zeit was Sinnvolles. Wenn ich mir überlege, was ich hab, ich hab heute, glaube von ungefähr acht Stunden, wo ich da war, hab ich Wartungsarbeiten-Meeting gedürnt gemacht, eine Stunde, in einem Team-Meeting, in dem Team bin ich zwar nicht, aber da bin ich öfters dabei, Besprechung, neues Release-Runde, eine Stunde, irgendwelche Ticket-Abstimmungs-Meetings bestimmt auch noch mal eine Stunde und dann hab ich mit einem Kollegen nach der Runde noch mal eine halbe Stunde über aktuelle Sachen geschwätzt. Also quasi, ich war bestimmt viereinhalb Stunden mit zu 90% sinnlosen Laberstell-Sachen beschäftigt. Äh, was? Nee, also Skill-Killer, da hab ich nix mit zu tun. Ich muss, ich muss, ich muss keine PR-Sachen, ach du weißt, Pull-Requests! Ich dachte du meinst mit Werbung. Naja, also PR-Approven ist ein Teil davon. Das ist das, was man unter anderem macht. Das war einfach, ist es ja nicht. Mit PR-Approven ist ja nicht getan. Man muss sich ja auch erstens mal die Änderung angucken, die Änderung mit den anderen Änderungen, die Leute machen, unter einen Hut bringen. Und oftmals funktioniert es nicht, sich mit den Leuten zusammensetzen, gucken was es funktioniert. Das an die restliche Welt verkaufen, das war übrigens heute, weil ich meinte Runde zum neuen Release. Heute ist nämlich Release-Start in unserer Testumgebung. Und da war die Runde heute dafür. Der restlichen Welt verkaufen, was für geile Änderungen haben. Da haben wir ein richtig langes Chainslot mittlerweile zu, wo dann nach Möglichkeit für auch nicht ganz so IT-versierte Leute drin steht, was passiert. Zum Beispiel, dass jetzt eine neue Domain verwendet werden kann für Mails und sowas. Sowas steht dann da drin. Manche Sachen, die kompliziert sind, schreibe ich da gar nicht rein, weil die Noobs damit nichts anfangen können, sondern wenn ich die Auswahl habe, wie, ich schreibe rein, wir haben jetzt eine neue HA-Proxy-Version, die Intel IES Hardware Encryption verwenden kann, oder ich habe die Möglichkeit reinzuschreiben, wir können jetzt eine neue Absender-E-Mail-Adresse verwenden. Dann schreibe ich wahrscheinlich rein, wir können eine neue Absender-E-Mail-Adresse verwenden, in das öffentliche Aushängeschild Chainslot, weil mit der anderen Sache kann kein Mensch was anfangen. Was wir wahrscheinlich machen würden ist, ich würde das umschreiben, ich bekomme einen Change, da steht drin, okay, wir haben eine neue HA-Proxy-Version, die kann jetzt SSL-Beschleunigung mit der CPU machen, wunderbar. Da steht er drin, das würde ich aber so nicht reinschreiben, sondern ich würde irgendwie das in Performance Improvement umdichten, was es ja unter dem Strich auch ist und das irgendwie als Load Balancing Performance Verbesserung oder so verkaufen. Das finden wir wieder alle geil. Sind Merch-Konflikte bei euch Teil des Prozesses oder versucht ihr das zu vermeiden? Also vermeiden kannst du es nicht. Also ja, das ist Teil, das vermeiden kannst du es nicht. Also ich habe das bei uns als relativ klassische Git-Struktur da aufgezogen, also sprich, wir haben, ich zeige euch mal ein Bild, wir machen das nicht genau so, aber ich glaube da gibt es ein ganz gutes Bild, was Branches angeht. Leute, ich weiß, Big Brain, ja so ungefähr ist es bei uns, genau. Das Big Brain, aber ich weiß auch umgedreht, dass es ein paar interessiert. Also wir haben es folgendermaßen, ja doch, das trifft es eigentlich ganz gut, wie es hier aufgemalt ist. Also wir haben eine Master-Branche, da kommt alles Mögliche rein. Von Server-Config bis irgendwelche Mail-Config-Files, XML-Config für Java-Gedöns, zumindest wenn es um Infrastruktur-Gedöns geht. So und das kommt da rein, per Software ist es ähnlich. Ich weiß, Master-Branche ist voll verpönt aktuell, aber wie gesagt bei Software ist es ähnlich. Also zumindest, wir haben eine Master-Branche und das heißt bei uns auch tatsächlich immer noch Master, ich werde das auch nicht umbenennen, weil ich da in so vielen Stellen was umbenennen müsste, dass das eigentlich den Aufwand nicht rechtfertigt. Es sei denn, irgendjemand kommt auf die Ideen, fühlt sich getriggert dadurch und unser Abteilungsleiter sagt, wir müssen das jetzt umbenennen, aber ich glaube, ganz so verrückt sind sie noch nicht. Zumindest, wir haben eine Master-Branche und ähm, übrigens da stimmt überhaupt nicht, was das Bild hier zeigt. Das ist gar nicht richtig. Äh, ne, das, okay die Bilder sind voll für'n Arsch. Ne, stimmt nicht so. Wir machen's wieder Git-Model-Linux-Kernel, wir machen's ziemlich genau wie der Linux-Kernel, aber halt nur vom, vom Branch. Äh, ja, so, so in der Richtung machen wir's, genau. Ähm, das, das trifft's, das trifft's eigentlich ganz gut. Also wir haben eine Master-Branche, von da kommt alles und da geht auch alles rein. Also sprich, das hier ist irgendwie Stand X und irgendeiner ist jetzt der Meinung, da kommen wir nämlich jetzt auch gleich, wenn wir das in Merge-Konflikten machen, ähm, da kommt jetzt irgendeiner auf die Idee, okay, wir brauchen, was ich, neue Zertifikate oder so, oder, äh, wir brauchen, neun, neun Mail-Domains oder so. So, und, oder er muss den, er muss bei dem, er muss für die Java-Anwendungszeuge muss irgendwie den Zertifikat-Store updaten oder sowas. Okay, ähm, dann macht er sich den Branch auf, vom Master hier, macht da seine Commits drin und macht ein Pull-Request auf, zurück auf Master. So, jemand anderes macht parallel auch was und, äh, entwickelt sagen wir jetzt an, an irgendeinem anderen Feature ist egal was. So, und da können die hier parallel entwickeln und beide machen ein Merge-Request auf, wenn's so weit ist. Der macht den hier auf, der macht den hier auf und das ist dann die Stelle, wo ich mir das angucke, was die gemacht haben. Und das passt meistens und es kommt halt nur zu Merge-Konflikten, wenn der und der parallel in den gleichen Files rumwurstet. Und das ist recht selten, weil die meisten Leute ihre Aufgabenfelder haben. Das kommt nicht so oft vor, kommt vor bei Basic-Geschichten wie SSL-Zertifikaten, zum Beispiel im Zertifikat-Store, da kommt das öfters vor, weil da viele Leute mal dran rumwursten. Ja gut, wenn's den Merge-Konflikt gibt, da siehst du den Pull-Request schon. Das Beste ist, die Leute lösen das selbst, indem sie das rebasen auf Master vorher und den Merge-Konflikt selbst lösen. Oder aber, wenn das nicht geht, dann nehm ich den da, und mich und wir überlegen uns zusammen, wie die Änderung am Ende aussehen muss. Nicht nur gleiche Files, sondern sogar gleiche Zeilen. Ja, richtig. Gleiche Files allein ist Git teilweise recht clever, aber da muss man auch drauf achten, Git macht da manchmal, zwar nicht oft, aber manchmal komische Dinger, wenn es die gleiche Datei parallel ändert. An unterschiedlichen Stellen. Wo der Unterschied ist, dass die noch einen Develop-Branch haben, wo sie was drauf machen, und hier wird alles auf Master gemacht. So, und das ist eigentlich kein großes Ding mit Merge-Konflikten, muss man ehrlich sagen. Das lässt sich recht easy handeln. Es gibt nicht viele, aber wenn's welche gibt, gibt's halt welche, die sind teilweise echt eklig, aber 80% der Merge-Requests, oder ne, 80% der Konflikte, die wir haben, sind wirklich kein großes Ding. Das kriegt man mit den beteiligten Leuten relativ gut hin. Bei SSL-Zertifikaten ist es auch einfach, da brauchst du in der Regel einfach beides, es ist nur parallel entstanden. Na gut. Und im gleichen Atemzug, wie hier der Pull-Request ist, wird dann auch ein bisschen Infos dazu gesammelt, sprich, was genau macht das, wie verkauft man das am besten, und wir schreiben das in unser Change-Log für die nächste Version, und dann sind die Leute, die entwickeln, eigentlich fertig. Da müssen die sich nicht mehr weiter drum kümmern. Das nächste mach ich, dann mach ich so ungefähr sowas wie das hier, mach ich dann, ich mach nen Tag drauf irgendwann mal auf Master. Also man taggt ja am Master nicht, mein Tag ist ja ne Zeige auf nen Commit, hat mit Branches überhaupt nix zu tun, aber zu dem Zeitpunkt bin ich im Master, sag ok, keine Ahnung, an der Stelle hier jetzt, jetzt ist es laut Kalender wieder soweit, da mach ich nen Tag drauf auf diesen Commit hier, und dann kommt der Commit dahin. Das muss man machen, mit dem Tag, erstens weil es besser nachvollziehbar ist, und weil man sich sicher sein will, dass wenn man Hotfixes macht, wenn es nur so einfach ist wie hier, ist das kein Ding, aber bei uns ist es noch ein bisschen komplizierter, dass man sicher ist, man bekommt nicht zwischendurch irgendwelche Commits mit rein, die man gar nicht haben will. Zum Beispiel, was ich auch schon gelesen hab, was einige Leute verkehrt machen, so hat die Motto, die taggen das hier, das hier ist Tag 1, da machen sie hier weiter und sagen, das hier ist jetzt, oh fuck, bei Version 1 ist was kaputt, wir brauchen jetzt nen Fix, und dann sagen, taggen sie das hier als Version 1.1, das ist aber Fail, weil in der Zwischenzeit sind die ganzen Änderungen dabei, das heißt, Version 1.1 wäre dann nicht Version 1 plus nen Fix, gleich Version 1.1, sondern eigentlich wäre das hier unten dann Version 2 fast schon, also das geht so nicht, deswegen muss man das taggen, und wenn man dann was fixen will, dann macht man das mehr oder weniger so, ich nehm mir das aktuelle Tag, check das aus, cherrypick den Hotfix Commit, deswegen leg ich auch immer Wert darauf, dass Hotfixes möglichst klein sind, nach Möglichkeit auch nur ein Commit, weil da lässt sich das einfacher cherrypicken, dann check ich den Tag aus, mach den Cherrypick von dem jeweiligen Hotfix Commit, und dann mach ich den neuen Tag drauf, und dann hast du nur die alte Version plus den einen Fix, und dann ist gut, wo man dann natürlich darauf achten muss, ist, dass wenn man Hotfix kriegt, dass der natürlich auch in Master kommt, weil sonst sehen den die anderen Leute nicht, so machen wir das, wir machen das ziemlich klassisch, so jetzt mal auf die anderen Sachen einzugehen, die noch gekommen ist, kann man einen Pullrequest direkt auf einen Tag merchen, eh theoretisch schon ja, ich weiß nicht ob das GitHub, Bitbucket oder sonst was unterstützt, Git technisch ist das kein Problem, Git technisch geht das, also du kannst den Tag auschecken, kannst dort einen Branch reinmerchen in diesen Stand, und danach einen neuen Tag draufsetzen, das geht, das will man aber in der Regel nicht machen, weil dann hast du das Problem, die Leute die sich das vom Master auschecken, stellt euch mal vor, das hier ist die aktuelle Version, irgendeiner checkt sich einen Branch aus vom Master und sagt dann ja, ich möchte den jetzt da rein, dann bringt der ja alle anderen Änderungen, die in der Zwischenzeit zur nächsten Version passiert sind mit, das will man ja nicht, also deswegen macht man das eigentlich anders, wenn man einen Hotfix hat für die aktuelle Version, dann nehmen sich die Leute für ihren Hotfix Branch als Grundlage den aktuellen Tag, oder wenn es was ganz kleines ist und sie das für Master eh schon gefixt haben, nimmst du einfach das Comet und Cherrypicks rein und hoffst, dass es funktioniert, was meistens klappt, aber wenn es was ein bisschen umfangreicheres ist, musst du als Grundlage für den Hotfix Branch den aktuellen Live Produktions Tag nehmen, weil sonst bringst du aus dem Master die halbe nächste Version mit, wenn du das mercht, das willst du ja nicht, deswegen wird da auch nichts gemercht, sondern so gut wie immer rein Cherrypicked, was besonders gut ist, wenn man halt nur ein, zwei Comets hat. Cherrypicks sind für mich immer noch Kid Magic, da ist eigentlich relativ wenig Magic dabei. Sollte man nicht eh pro Release einen Branch sich gönnen, nö, also kann man, wenn man mehrere Releases parallel supporten will, haben wir auch, wir haben da eigene Namen für, aber im Endeffekt haben wir nen Testing Branch und nen Live Branch noch zusätzlich aus dem Grund, weil es manchmal vorkommt, dass spezielle Änderungen nur für die Testversion gemacht werden, um zu erproben, ob irgendwas funktioniert. Das sind dann auch Comets, die nicht Bestandteil im aktuellen Release sind, die werden dann quasi zusätzlich noch obendrauf in den aktuellen Testing Branch Cherrypicked, weil die dürfen ja nicht ins Release, sonst kommen ja irgendwelche Testing Features live, das möchte man ja nicht unbedingt. Ja, aber ansonsten machen wir nicht pro Release einen Branch. Der Colonel macht's, der Colonel hat so nen Old Stable und Older Stable und so komische Dinger noch, das haben wir nicht, und eigentlich braucht man das auch nicht. Also wir haben nen Master Branch, wir haben nen Testing Branch, so die Kurzvariante ist das jetzt, und wir haben nen Live Branch, die drei Sachen haben wir, dann gibt's noch hunderttausende Feature Branches von den Leuten, die Sachen entwickeln, aber das war's. So, und Hotfixen, wie gesagt, von dem jeweiligen Tag, per Cherrypick zurück, und du hast ja das Tag auf das Comet, also du brauchst ja keinen Branch für das aktuelle Release noch zusätzlich. Wir haben nen Live Branch und dort kommt immer das aktuelle Release rein, wenn's soweit ist. Was ich ab und zu mal mache ist, dass ich die einmal im Jahr lösche und nochmal neu aufmache. So, aber ansonsten brauchen wir das, brauchen wir das nicht. Wieso streamst du eigentlich in 48Hz, ist bei deinen YouTube Videos auch so, also Stream in 48Hz mach ich, damit es besser aussieht und weniger Bandbreite als 60Hz braucht. Also es sieht besser aus als 30FPS, und es braucht weniger Bandbreite als 60, ist eigentlich die Big Brain Lösung, 48FPS Stream. Wie oft habt ihr einen neuen Master-Comet pro Tag? Boah, ganz schön viel, ähm, Tag ist einfach nur einem Comet einen Namen geben, korrekt, das ist, denn Tag ist, dass du's einfacher wieder findest, das Comet, du könntest ja auch selbst ne Tabelle machen mit Comets, aber wozu, wenn's Tags gibt, wie oft habt ihr also, was haben wir denn so, 20, 20 Comets am Tag oder so, im Durchschnitt, na, wobei das kommt, manchmal ist es deutlich mehr, manchmal ist es auch weniger, ich sag mal so im Durchschnitt 20 Comets am Tag, ungefähr so, würd ich sagen. Also was ich bei Merch-Konflikten immer ganz gern verwendet hab, ist VimDiv, aber da bin ich mittlerweile auch von weggekommen, so ich mach das, ich mach's komplett von Hand über den Editor, wenn man sich da dran gewöhnt hat, ist gar nicht schlecht, am besten ist, wenn man, ähm, nen Editor mit Git-Plaim-Support hat, dass man sich direkt anzeigen lassen kann, wer von wem welche Änderungen sind, aber ansonsten sind Merch-Konflikte, finde ich, am einfachsten von Hand gelöst. Äh, du machst, doch, doch, mach ich auch, allerdings jetzt nicht so ultratief, ich guck mir an, ob's da, äh, irgendwelche Verschreiber gibt oder ob da offensichtlich Mist drin ist. Letztens hat einer nen, nen Python-Monitoring, äh, Change gemacht, also für, für die, für unser Prometheus-Monitoring in nem Python-Skript geupdatet, da hab ich gleich gesehen, die Eindrückungen stimmten nicht, sowas seh ich schon, im Detail kann ich's meistens gar nicht genau beurteilen, ob das stimmt, ja. Wenn da jetzt irgendwie einer sagt, ok, der Logik nach muss das kleiner 5 sein und es stimmt nicht, dann glaub ich ihm das trotzdem, aber das, keine Ahnung, ob das stimmt, also so sehr kenn ich mich damit nicht aus. Äh, wie viele Feature-Branches kann man denn haben oder was ist die Regel, äh, unbegrenzt viele, Git juckt das überhaupt nicht, wie viele Branches man hat, Git wird auch nicht langsam durch. Also wir haben Leute, die haben glaub ich schon 5 Jahre oder so nix mal aufgeräumt, die haben 350 offene Branches, ich hab mir mal überlegt, ob ich was basteln soll, was die Leute benachrichtigt, aber wozu, juckt nicht, kannst so viel haben, wie du willst. Ähm, die Eindrückung, ja, das ist typische First World-Python-Problems, reicht da eine Proof oder müssen das mehrere Leute erst bestätigen, das müssen mehrere Leute bestätigen oder, ich weiß, klingt jetzt, klingt jetzt vielleicht sogar schon ein bisschen überheblich oder ich, das reicht meistens auch, ähm, also wir haben es so gemacht, dass wenn es ein Thema ist, wo es noch ein paar andere Leute gibt, die sich auskennen, zum Beispiel haben wir einen Repo, da sind alle unsere DNS-Config drinne und wenn dort einer DNS-Changes-Committed einreicht, dann haben wir es so gemacht, dass quasi, bevor ich drauf gucke, noch mal einer drauf guckt, der auch aus dem gleichen Team ist und erst wenn noch ein fachlicher Kenner es approved hat, approve ich es auch, aber die meisten Sachen, wenn ich sie mir angeguckt hab und approve, äh, dann juckt das kein mehr, sondern wir nehmen es direkt, auch weil es vielleicht nicht hundertprozentig richtig ist, aber das meiste wird nicht so arg reviewed, wie es vielleicht sollte. Wie groß sind denn die ganzen Repos zusammen? Boah, also unser altes, wir hatten mal ein altes Repo, wo wir alles in einem Repo gemacht haben, wirklich alles, sogar RPM-Pakete, da waren wir aber noch big, big noob, ja, ähm, und da haben wir teilweise Target-Sets und RPMs in das Git-Repo-Committed und das war am Ende, glaube ich, acht Gigabyte oder so. Wenn du das geklont hast, neu, hast du erst mal ein halben Tag Gefühl dargesessen. Also das war das alte Repo, das war richtig bepega, bebega war das. Das haben wir dann aber nach einem Jahr oder so gecheckt, dass das keine gute Idee ist, jetzt haben wir ein bisschen mehr Repos und wir checken auch keine großen Binaries mehr drin, aber man lernt ja, man lernt ja. Also unser aktuelles Repo ist, glaube ich, so, was wird denn das sein, so das Haupt-Repo, wo das meiste drin ist, wird so 250 MB sein. So in dem Dreh würde ich jetzt mal, würde ich mal sagen, das allermeiste sind Text-Files, die nehmen nichts weg. Es sind ein paar ganz kleine Go-Binaries drin, die sind aber vielleicht, wenn es hochkommt, wenn es hochkommt, dann MB pro Binary, weil das Sachen sind die immer tagtäglich da im Handling und auch so brauche. So und ich sag mal 200, 250 MB, ich weiß es ehrlich gesagt gar nicht genau. Ich hab unser Repo ewig, also wirklich ewig nicht mehr geklont. Wozu auch? Ich hab das ja eh permanent aktuell. Da wird, wieso? Stört das, siehst du doch überhaupt nichts. Achso ja, damit es nicht, damit es nicht stört, haben wir folgendes gemacht, das ist auch eine Sache, die ich empfehlen kann, wenn man entweder Git managen bzw. vielleicht selbst besseren Überblick behalten will, macht Namespaces davor oder Gruppierungen. Also in Git kann man z.B. machen, dass man einen Branch nennt, so nach dem Motto, dass man Git einen Branch macht, der max slash neues Feature heißt. Das ist ganz praktisch, weil alle Branches ohne Namespace davor sind meine, also zum verwalten der ganze Geschichte, also sprich Master hat keinen Namespace davor, also Testing und Live haben auch keinen Namespace davor, sprich da, das sind meine, da hab auch ich Rechte drauf, aber andere können dann irgendwie, der Felix hat nen Branch, das heißt dann irgendwie Omega, Lul und sonst was. Das heißt alle Branches mit Namespace davor sind Feature Branches, da kann man das recht gut erkennen. Das wird auch von Git von Haus aus unterstützt, das ist eigentlich ne ziemlich gute Sache, das so zu kopieren. Kann man erkennen, von welchem Branch ein Branch abstammt? Ja und nein, du kannst erkennen, von welchem Commit der Branch abstammt. Von welchem Branch ein Branch abstammt, gibt es nicht, weil sowohl Text als auch Branches gibt es ja streng genommen in Git so, in der History gar nicht. Also du hast Commits, du hast quasi ne Reihe von Commits, die aufeinander basieren und in Tag ist ein Zeiger, nen Namen geben für nen Commit und ein Branch ist halt nen Namen für nen Commit, wo man weitere Commits drauf machen kann. Also wichtig ist, von welchem Commit man das aufmacht. Also sprich, wenn ich drei Branches habe, oder sag mal, ich hab ne Master Branch und mach davon drei Branches auf, so und A, B, C und du machst von C deinen Branch auf, dann kann ich nicht erkennen, ob du ihn von A, B oder C aufgemacht hast. Das weiß ich nicht, ich weiß nur, dass du ihn aufgemacht hast zum Stand von Commit X, Y. Also ich kann nicht erkennen, ob du ihn von Master aufgemacht hast, von A, von B, von C. Ja, so ungefähr machen wir es auch. So ähnlich machen wir es auch. Einziger Unterschied ist, wir machen Underscore, weil wir manche Branches als Puppet-Environment verwenden zum Dingertest. Ja, da liegt auch Puppet-Config drin, jede Menge. Also das ist ein bisschen umfangreich, da ist das Main-Repo, da ist ganz viel Puppet-Config drin. Und Puppet mag Minus in Environment haben nicht, deswegen ist es bei uns in Underscore. Ja, so sieht das aus. Puppet ist echt ein Krampf, ja das stimmt. Aber wir verwenden Puppet schon ewig. Wir haben ja auch einen riesen Puppet-Code-Base. Als Erklärung, Puppet ist ein Tool, dem gibst du das. Das ist noch vor der Zeit, aber mittlerweile nennt sich sowas ja Infrastructure as Code. Nee, Code als Infrastructure as Code, ja, Baswords. Also sprich, man beschreibt, wie ein System aufgebaut werden soll und hat nen Config-Programm, das lässt man laufen, nen Config-Management-Programm und das baut aus der Meta-Config quasi die Config aus zusammen, wie sie dann am Ende auf einem Server hinten rauskommt. So musst du zum Beispiel, wenn du 50 Server aufbauen willst, die sich alle bis nur im Namen unterscheiden, so kannst du quasi eine Puppet-Config machen, die du dann quasi applies auf 50 Server anstatt dass du 50 Server einrichten musst, so weit von der Theorie her. Puppet ist doch Ruby-Kacke, ja aber Ruby ist doch gut und es ist nicht Docker für Arme, es war ganz was anderes. Ach guck mal, hier, er weiß wovon ich rede. Ich verwende, ach so, also ich verwende Privat vmware, auf der Arbeit haben wir jede Menge Sachen, also wir haben zum größten Teil vmware, das glaube ich kein Geheimnis, das haben die meisten im Enterprise-Umfeld, wir haben allerdings mittlerweile auch jede Menge Container und solche Sachen und auch Dinger in Azure und in der Cloud und ganz tolle Dinger. Aber zum größten Teil vmware und die meisten Business-Enterprise-Geschichten, die du so antreffen wirst, die haben auch vmware. Vmware ist in dem Umfeld einfach das etablierteste, was es gibt. Wir haben auch witzigerweise ein paar KVM-Kisten, habe ich letztens gelernt. Wusste ich bis vorgestern auch nicht, dass wir KVM haben. Boah, das ist viel zu kräll, da wirst du ja blind von. Ne, ne, ne, wir haben die wieder. Wir haben wieder KVM. Hab ich heute gelernt, ja. Im Kubernetes-Umfeld haben wir irgendwie KVM noch. Wusste ich bis vorgestern auch nicht, dass wir sowas haben. Genau, so sieht das aus. Also das ist bei uns so die Geschichte. Und wie gesagt, Puppet ist an sich ganz gut. Es ist halt ein bisschen bloated mittlerweile bei uns. Okay, ich glaube, jetzt haben wir das alles. Kann man eigentlich Docker in Windows Home in vmware Ubuntu benutzen? Klar. Wenn du dir eine Linux VM installierst, kannst du da drin alles funktionieren. Alles verwenden, was du verwenden willst. Was ist denn Windows Home? Was ist denn Windows Home? Ach, Home, das ist die Home und Professional. Ja, ja. Lul. Monarch S. Klar, in Virtualbox geht das auch. Natürlich funktioniert das. Virtualbox und vmware, das ist beides voll Virtualisierung. Das System, was da drin läuft, hat keine Ahnung, dass es in der, also realistisch betrachtet weiß es natürlich, dass es in der VM läuft. Aber reine Lehre mäßig hat es keine Ahnung, dass es in der VM läuft. Also sprich, du kannst in der Linux VM, die du voll virtualisiert laufen hast, alles machen, was du willst, sofern es die Hardware hergibt. Du hast keine Beschränkung. Also du kannst es sowohl in Virtualbox machen, du kannst es auch in vmware Workstation machen, du kannst es in Parallels machen unter Mac und Fusion unter Mac. Du kannst es in KVM machen, vollkommen egal. Also voll virtualisiert kannst du alles machen, was die Hardware hergibt. Wie gesagt, sowas wie Spiele ohne GPU pass-through, was ja nicht funktioniert mit vmware Workstation, Desktop, Windows, gibt halt die Hardware dann nicht her. Aber hey, für SuperTuxCard reicht es immer noch. Geh weg. Also ich mein, wenn SuperTuxCard geht, dann geht alles andere auch. Da sind wir uns ja einig. Ok, was war denn jetzt eigentlich mit Google und Deutscher Bank, was ich angeblich wissen müsste hier? Google hilft Deutscher Bank, ok. End of Function Zero, ja das funktioniert auch mehr schlecht als recht. Aber Docker bzw. ne, was wolltest du verwenden? Docker ist keine nested Virtualisierung. Ich find's immer noch blöd, dass das ganze Zeug Container heißt, muss ich ehrlich sagen. Container klingt nach vm, ist es aber nicht. Den Container gibt es auf Linux-Ebene eigentlich gar nicht. Man nennt das nur Container. Also sprich, ein Prozess, den du startest auf deinem Linux-System, wenn du jetzt einfach ne Bash startest oder so, ist da erst mal fundamental kein Unterschied dazwischen, ob du die Bash so startest oder die Bash über Docker in nem Container startest. Beide Prozesse laufen nicht virtualisiert, sondern sind ganz normale Prozesse, die der jeweilige Hostkernel ausführt. Also Bash in Docker ist nicht virtualisiert und Bash ohne Docker ist als rechtlich virtualisiert. Der einzige Unterschied dazwischen ist, dass es auf Kernel-Ebene sowas wie Namespaces und Cgroups gibt. Das ist so ein bisschen Sandbox- Sandbox-Möglichkeiten, dass die Bash in nem Container vielleicht nicht Zugriff auf alles vom Host hat. Aber das ist keine Virtualisierung. Also sprich, wenn du Docker in einer Ubuntu-VM betreibst, dann ist das keine nested Virtualisierung, sondern das ist ein stinknormaler Prozess wie alles andere auch, was du in dieser VM ausführst. Docker interessiert sich oder generell Linux-Container interessieren sich absolut null für Virtualisierung. Und es würde sogar nested-virtualisiert funktionieren. Also du könntest sogar ganz abgedrehte Sachen machen wie, vor allem bei Workstation, darauf KVM und dann bei KVM-Linux-Kiste-Docker. Aber dann ist nested-virtualisiert und dann ist die Performance auch im Arsch. Aber vor allem bei Workstation, guck mal, ich verwende das doch hier auch laufen. Ich hab hier meine VM bei Workstation und ich kann hier ohne Probleme sagen, Docker, PS, zack, läuft. Gar kein Ding. Sollte mal an meiner Master-Thesis, das solltest du machen, ja, über was schreibst du? Ach, übrigens hier, jung, oder Snorlax, weiß ich genau, was davon? Wie war so dein Probearbeitstag heute? Google hilft deutscher Bank, ok. Was macht denn die deutsche Bank da? Scheiß VDSL Telekom, warum das denn? Knäbier hast recht, ja, müsste ich mal echt updaten. Also was, die deutsche Bank will ihre IT-Probleme unter anderem mit der Hilfe von Google lösen. Na dann, easy as fuck, würde ich sagen. Sollen sie mal machen. Also beide Firmen, blablabla, das Finanzinstitut bekommt Zugang zu den Cloud-Diensten der Alphabet-Tochter, ok, Google, das finden die News-Schreiber immer geil, weil die suchen immer händrigen Synonyme für die gleichen Sachen. Jetzt können sie anstatt Google schreiben, die Alphabet-Tochter. Zudem wollen die Unternehmen die nächste Generation... blablabla, ok, was machen sie denn jetzt eigentlich? Ok. Die deutsche Bank kämpft wie viele andere deutsche Finanzinstitute mit technischen Problemen. Das sind hausgemachte Probleme. Wenn man das ja auch 20 Jahre lang verschläft und verkackt, dann muss man sich nicht wundern. Schon der frühere Konzernschaftler, kurz nach seinem Amt, hat er öffentlich als lausig bezeichnet. Mich würde interessieren, wenn er die IT als lausig bezeichnet, was er damit genau meint. Weil ich könnte mir vorstellen, dass die Leute, die da arbeiten, alles andere als lausig sind, damit der ganze Scheiß auf der alten Infrastruktur und dem ganzen alten Müll überhaupt noch funktioniert. Er meint wahrscheinlich, dass er und seine Manager es verkackt haben, bzw. er, sein Vorgänger und seine Manager es verkackt haben. Ex-IT-Chefin Kim Hammond, aha, ok, die Ex-IT-Chefin musste wieder weg. Zuvor hatte sie die Bank als das dysfunktionalste Unternehmen, für das sie je gearbeitet haben, kann ich voll und ganz nachvollziehen. Wenn ich mir das teilweise angucke, wie das bei uns läuft, und ich arbeite nicht bei der deutschen Bank, aber so weit davon weg, also rein geografisch gesehen sind wir nicht. Also, vieles ist bei uns auch sehr, sehr merkwürdig, wo man sich fragt, wie zum Teufel funktioniert das überhaupt. Und genau das wird bei der Deutschen Bank auch so sein. Ich kenne ja ein paar Leute, die bei uns gearbeitet haben, die auch vorher bei der Deutschen Bank gearbeitet haben, die haben da auch wenig Gutes dran gelassen. Also, von allem, was ich gehört habe, könnte ich das bestätigen. Die musste wahrscheinlich gehen, weil sie gesagt hat, wie es ist. Die musste wahrscheinlich gehen, weil sie gesagt hatte, Jungs, wenn wir das lösen wollen, müssen wir uns erstmal eingestehen, dass wir Scheiße sind. Und das hört wahrscheinlich kein Manager gerne. Die haben sie eingestellt dafür und wollten nicht hören, was was ist. Das kommt öfters vor, dass Leute eingestellt werden so nach dem Motto, wir brauchen jetzt das hier, wir brauchen hier, wir brauchen jenes. Und wenn man dann jemanden hat, der das wirklich nachhaltig lösen will, der muss dann erstmal auf den Tisch packen. Okay, Leute, in diesen Bereichen haben wir 20 Jahre geschlafen, wir sind viel schlechter als die Konkurrenz. Wir haben vielleicht eine gewisse Stellung, dass sieht das nicht so aus wie, aber wir sind einfach Scheiße. Und das hören die Leute halt nicht gerne. Ich meine, niemand stellt jemand gerne ein und kriegt dann von dem gesagt, dass er Scheiße gebaut hat die letzten 20 Jahre. Aber wenn man Probleme lösen will, muss man sich der Sache halt manchmal stellen. Da haben viele Manager anscheinend Probleme damit. So und das betrifft die meisten großen deutschen IT Unternehmen, bin ich mit ziemlich, also nicht IT und die meisten größten deutschen Unternehmen wird das betreffen, uns mit Sicherheit auch. Und was soll ich jetzt sagen, also es ist ja kein Wunder, dass in Deutschland so viele Startups mittlerweile erfolgreich sind, nicht etwa, indem sie das machen, was Startups normalerweise machen, irgendwie tolle neuen innovativen Sachen ausprobieren und zu 80 Prozent failen und zu 19 Prozent verkauft werden und zu einem Prozent mal was großes werden, sondern die Startups in Deutschland sind so gut im Geschäft, weil die den alten großen Unternehmen helfen, wieder ein bisschen Anschluss zu bekommen. Also wir verdienen quasi unsere Startups gibt es nur, weil es die großen Unternehmen verschissen haben. So also weiter, das größte Problem der Deutschen Bank sind die vielen verschiedenen Systemen. Christian bist du noch da? Da können wir auch ein Lied von singen. Das größte Problem der Deutschen Bank, also das größte Problem bei uns, was wir haben ist auch ähnlich. Wir haben auch sehr viele verschiedene Systeme. Das könnte ich so unterschreiben. 2012 hatte die Bank SAP damit beaufragt, die Plattform zu harmonisieren, was jedoch scheitert. Also wir fassen mal zusammen, die haben das Problem schon lange erkannt, aber sie kriegen es nicht gebacken, was definitiv dafür spricht, dass es intern Widerstände dagegen gibt. Widerstände, die sich nicht einfach durch einen neuen IT-Chef oder irgendwelche Konsultanten Leute aus dem Weg schaffen lassen. Also höchstwahrscheinlich Widerstände auf einer ähnlichen Ebene, wie hier oben die Leute einstellt. So, ob die das jetzt mit Google hinkriegen, wenn sie alles so machen wie bisher, ist das auch fragwürdig. Neben dem Umbau der IT haben die Banken viel mit Konkurrenz von Techland gekämpft, die wie Apple und Google ihre Marktmarkennutzung und Teile des Zahlungsverkehrs. Warum muss ich das jetzt unbedingt lesen? So was Tolles stand jetzt da auch nicht drin. Eins wird das auf jeden Fall machen, so eine Kooperation zwischen Google und der Deutschen Bank. Es wird sehr viel Geld verbrennen, ob da am Ende was Gutes rauskommt oder nicht, wage ich nicht zu sagen, dafür kenne ich mich mit der Deutschen Bank zu wenig aus. Wie gesagt, die paar Leute, die ich kenne, die da gearbeitet haben, was sie erzählt haben, so ein umfassendes Bild gibt es jetzt auch nicht. Es wird auf jeden Fall sehr viel Geld verbrennen und Google wird sich an der Deutschen Bank die Haare raufen, da bin ich mir ziemlich sicher. Da kommen dann irgendwelche super agilen Amis an oder wer auch immer und meinen hier, das geht hier auch so und die werden dann erstmal konfrontiert mit der Schwerfälligkeit eines großen deutschen Unternehmens im Finanzsektor. Die Schwerfälligkeit kann sich ein Googler wahrscheinlich noch nicht mal in seinem Traum ausmalen, wie schwerfällig sowas sein kann. Also es wird auf jeden Fall auch den härtesten Googler zur Verzweiflung bringen, die Deutsche Bank. Mich würde mal interessieren, ob es dann irgendwann mal Berichte gibt, wie es eigentlich gelaufen ist. Mein Probetag war nice, habe gesehen, wie die arbeiten, wir waren beim größten Kunden, die haben einen 200.000 Euro Server im Rack mit Virtualisierung im Keller stehen. Es gibt fette Systeme. Guckt euch mal IBM Großrechner an, IBM Host Geschichten an, was das kostet. Und da bezahlst du auch noch die Rechenzeit, das ist so richtig oldschool. Diese Season wieder relativ viel. Gut, also wir wollten uns ja mal, irgendwie hat mich der Chat am Anfang da auf die Idee gebracht, angucken, was denn für IT Zertifizierung empfohlen werden. Ich habe nämlich legit keine, what the fuck. Die besten IT Zertifizierung, ok gucken wir mal, was gibt es denn da. Warum ist das gelb? Wie sieht denn die Seite ohne Dark Reader aus? Ich bin blind. Welche Zertifizierung, 2018, ok. Die Top 10 IT Zertifizierung. EC Concealed Certified Ethical Hacker, habe ich noch nie gehört. ESC 2 CESSP, habe ich auch noch nie gehört. Degra Datenschutzbeauftragter, what the fuck, habe ich auch noch nicht gehört. Certified Cloud Security Professional, klingt irgendwie ein bisschen nach Cisco, ist es aber anscheinend, doch, ist es? Ne, ist es nicht. Ist es nicht, habe ich auch noch nicht gehört. Cisco CCNA, ok, den kennt man. Vorbei ich echt meine Zweifel habe, dass ein CCNA so beliebt ist. Ich habe auch ein CCNA gemacht vor Uhrzeiten. Hat bis jetzt nicht die Bohne irgendjemand interessiert und ich meine so ein CCNA, so ein CCNA ist, das ist ein Inhalt, das kannst du innerhalb von einer Woche easy lernen. CCNA ist nichts, also beim CCNA ist nichts großartiges dabei. Da lernst du so Sachen wie, wie man mit einer seriellen Konsole an den Cisco Switch geht, wie man da Enable Mode anmacht, wie man da ein paar Routing-Tabellen konfiguriert, wie man, wie man OSPF einschaltet und das war es zum größten und ganzen. Also viel mehr kommt da nicht bei rum. Kenn ich nicht, kenne ich auch nicht. IGIT. Axel OS Prince 2. Das hört sich an wie ein griechischer, wie ein griechischer Millionär oder sowas. Alexios Prince 2. Second, was auch immer, Foundation and Practitioner. Lean, oh je, das ist, das ist BWL Stonks Zeug. Das ist doch nicht euer Arzt, das können doch nicht die besten Zertifizierungen sein. Meine IT-Kerre, Überblick über die Wicht, ok, zeig mal her. Ja, End of Functions, ich weiß, machen viele in der Schule, deswegen ist ein CCNA nur wirklich nichts so Geiles. Erstens hat fast jeder einen CCNA und außerdem lernt man beim CCNA nichts, was man nicht auch so in 1-2 Wochen lernen könnte. Beim Internet-Engineer sieht es dann schon ein bisschen anders aus. CISM, CCNA, CCSP, KISO, KISO Certified Security Professional, das kann ich mir tatsächlich vorstellen, dass das gar nicht so übel ist. ISTQB, das klingt wie irgendeine, keine Ahnung, irgendeine Lobby-Gruppe für, mir fällt jetzt zu ISTQB nichts ein. Ok, was ist denn International Software Testing Certification Board? Software Testing, hab ich auch noch nichts von gehört. Oh Gott, ITIL, jetzt wollen sie es auch wissen. Excellent ITIL. Oh, wir haben einen im Chat, der Nico hat ein ISTQB, er sagt, er ist trash. Excellent. IREP, International Requirements, das sind doch keine Zertifikate, das sind BWL-Stonks-Dinger, das ist doch nichts, was ein ordentlicher IT-Mann, der sich mit Technik auskennt hat. Was, ECDL sagt mir gar nichts, was ist denn das? ECDL-Zertifikat. Was? Der Europäischer Computerführerschein. Kann man den online machen? Den will ich machen. Ich will den Computer-Triving-License machen. Kann man den online machen? Oh ne, das kann ich nicht. Das kann ich nicht. Textverarbeitung, Tabelle, das kann ich nicht. Das ist durchgefallen. Die Österreicher machen es richtig, die nennen es gleich Image-Editing. Ich will das machen, wo kann man das machen? Okay, ECDL, Online-Test-Free. Begriff, teste dein Wissen. Quiz, okay, excellent. Quiz, online, online-Aufragen. Also, wir machen jetzt den europäischen Computerführerschein. Auf geht's. Welche Zahlungsarten ist bei einer Online-Bestellung für die Käufer am sichersten? Das kommt vom Bezahl, das hängt vom Bezahl-Service ab. Bezahlung per Überweisung vor Lieferung der Ware, Bezahlung mit Abrechnungsaufgabe. Was hat denn das mit Computer? Okay, am Rande, am Rande, ja. Abbuchungsauftrag, Bezahlung mit Überweisung nach Erhalt. Na ja gut, Bezahlung vor Überweisung. Was? Nein, nein, nein. Das habe ich falsch gelesen. Das habe ich falsch gelesen. Ich meinte, das ist Vorkasse. Das ist aber gar keine Vorkasse, ne? Das da dann, ja. Ich dachte, das ist, ich dachte, das ist Nachname. Nachname meinte, aber ist es nicht. Okay, Pepega, next. Also, was ist der Unterschied zwischen Internet und World Wide Web? Das Internet ist... Staatliche Einrichtung verwenden das Internet Firmen und Privat... What? Das WWW ist ein Dienst des Internets, muss es eigentlich sein. Richtig. Jawoll. Next. Welche Web-Adresse könnte es wirklich geben? Die sind nicht immer so ganz aktuell. Mittlerweile könnte es davon so ziemlich jede Adresse geben. Okay, die hier, die hier nicht. Die hier könnte es nicht geben, aber die könnte es geben. Das ist das, was die auch wissen wollen. Aber die könnte es mittlerweile auch geben und die könnte es mittlerweile auch geben, weil die vergeben ja mittlerweile alle möglichen Top-Level-Domains. Ich weiß nicht, ob sie Top-Level-Domains mit Minus vergeben. Hab ich noch nicht gesehen, aber ich könnte mir vorstellen, wenn du genug Geld da auf den Tisch legst, kriegst du auch Vienna Active als Top-Level-Domain. Aber was die wissen wollen, ist das hier. Also Sub-Domain, Top-Level-Domain und wie nennen sie das eigentlich? Domain, Top-Level-Domain, Sub-Domain. Aber mittlerweile könnte fast alles irgendwo sein. So, was ist die Startseite eines Browsers? Ja, Pornhub, oder? Was ist die Startseite? Die Webseite, die nach dem Starten des Browsers angezeigt wird. Die, echt jetzt? Es kommt übrigens ganz entscheidend auf die Config an, weil die Startseite ist mittlerweile so ein Dashboard, auch bei Firefox. Was sind Favoriten? Microsoft Edge. Sogar schon, das ist top aktuell, Leute. Top aktuell, seht ihr das? Sogar Edge drinnen. Was sind Favoriten? Was ist denn das für eine Pepega-Fragen, ey? Und guckt euch mal dieses Hi-Res-Commuter-Bild hier nebenan. Gespeicherte Verknüpfungs-Webseite, okay, weiter. Auf welchen ist besonders, das 31 ist so eine Kackfrage. Na gut. Auf welchen Webseiten ist es besonders wichtig, Benutzern ein Kennwort zu haben? Sie wollen das hören, okay. Ähm, auf, auf, na ja, also, streng genommen ist das nicht das, ist Benutzern Passwort nicht das Wichtige, sondern dass irgendeine wirksame Authentifizierung verwendet wird. Und eine wirksame Authentifizierung sollte immer dann verwendet werden, wenn ich dort auf irgendwelche Sachen zugreifen kann, wodurch ich drauf zugreifen kann. Das kann bei allen anderen auch der Fall sein, aber die wollen eindeutig natürlich ein D hören. Wozu werden Daten verschlüsselt? Ähm, äh, damit die Daten für Hacker unlesen? Das stimmt aber gar nicht. Das stimmt nicht. Das wollen die hören, aber das stimmt nicht. In der Regel ist, während der Computer an ist, die ganze Sache ja unanschlüsselt. Und wenn du dir den Keylogger oder irgendeinen anderen Trojaner einfängst, dann kann der auf die unverschlüsselten Daten zugreifen. Also die wollen das hier hören, aber das stimmt nicht. Das hier ist richtig, aber das stimmt nicht. Ähm, wo besteht die größte Gefahr? Was ist das für Fragen, Alter? Das ist ja absolut Noobstyle. Wo besteht die größte Gefahr? Beim Aktualisieren, beim Besuch, bei der Nutzung von Suchmaschinen, beim Download von der Teilenprogramm? Ja, okay, next. Das mach ich nicht alles. Das mach ich nicht alles. Das ist mir zu doof. Welcher Teil der E-Mail-Adresse Office and Easy-For-Me-Info ist die Top-Level-Domain-Info? Das ist übrigens mal ne ordentliche Frage. Ist ja auch nur für 7-8-Klessler. 7-8-Klessler können das auch schon besser. Was ist der wichtigste Vorteil von E-Mail? Keine Sau verwendet mehr E-Mail. Außer PP-Gast, die diese Fragen erstellen. Okay, was ist ein Vorteil? Dass es Spam gibt, dass es Mails gibt, verbale Kommunikation ist nicht mehr notwendig, E-Mails erreichen den Empfänger in kurzer Zeit. Also, ähm, für mich B, für mich B, allerdings wollen die wahrscheinlich A hören, wobei man aber dazu sagen muss, das stimmt nichts. E-Mails ist kein irgendwie Echtzeit-Kommunikations-Medium. Also, also für mich ist B richtig, aber B ist falsch, die wollen A hören. Siehste? Bäm. Das ist kein Vorteil. Natürlich ist das ein Vorteil. Verbale Kommunikation zwischen menschliche Interaktionen ist nervig. Windows-Click-Fragen, ich glaub es nicht. Das heißt doch nicht, wie kriege ich in Windows was angeklickt, sondern Computerführerschein. Das ist so dumm. Welche Aufgaben hat ein Internet-Service-Provider? Stell dir in der Stelle die Hardware-Garantie, die Gerichtskanale. Okay, also, next. Welche dieser Seiten kommt aus Österreich? Die Schweizer Seite natürlich. Was man übrigens auch nicht so genau an der Top-Level-Domain sagen kann, es gibt sicherlich einige DE und AT-Info-CH Seiten, die weder sonderlich informativ sind, aus der Schweiz kommen, aus Österreich kommen oder aus Deutschland kommen. Was sind das für... Wo ist da der Unterschied? Ah, da ist ein Punkt, da ist ein Doppelpunkt. Okay. Viele Websites miteinander verbunden, verlinkt, gedruckt, vertauscht. Ein Programm zum Betrachten von Websites ist ein Surfer. Ein Modem. Okay, die Fragen gehen halbwegs. Welches dieser Programme ist ein Browser? Firefox bzw. Internet-Explorer. Linux, eindeutig. Das ist richtig pepega. Was ein Reisender möchte, laufend online über seine Erlebnisse berichten. Welches Werkzeug eignet sich am besten dafür? Bluetooth. Da kann er sich mit seinem Handy verbinden und daheim anrufen. Wie wird der Datenverkehr aus dem Internet kontrolliert? Firewall, USB-Stick, externe Festplatte, WL... Hä? Die Firewall... Also, ich meine, die wollen A wissen, aber das ist blödsinn. Alle Cookies löschen... Die Firewall aktivieren. Okay, da habe ich jetzt keine Ahnung. Was sollte bei dem Besuch von sozialen Netzwerken beachtet werden? Sich auch wieder abmelden, alle Cookies löschen, Cookies zulassen, ne? Cookies löschen? Cookies löschen? Ja, abmelden bringt dir ja nichts ohne Cookies zu löschen. Ich sag Cookies löschen. Okay, abmelden. Also, ohne Cookies löschen bringt dir abmelden nichts. Nach welchen Informationen wird meine Hilfe... Oh Gott, geh weg. Was versteht man unter Spam? Das ist ein Wahn. Das schmerzt ja. Ist die Favoritenleiste eingeblendet? Das weiß ich. Achso, da, ja. Welches der Programme ist kein Browser? Edge. Internet Explorer. Das zählt nicht als Browser. Ich weiß, dass es Word ist, aber das zählt nicht. Was ein Blödsinn. Was ein Schwachsinn. Okay, für Siebklässler mag das ja ganz nett sein, aber wirklich was draus ableiten kann man sich auch nicht. Okay, wir waren bei IT-Zertifikaten gucken. Damit bekommst du einen Job. Das wäre echt armselig, wenn man damit einen Job bekommt. Auf der anderen Seite, ich bin überrascht, wie wenig Ahnung jüngere Leute von Computerzeug an sich haben. Ich hätte eigentlich gedacht, dass die Generation, die nach mir kommt und die damit ja komplett aufwächst, dass alles easy as fuck kann. Dass sich da keiner mehr von irgendwelchem Spamchi baiten lässt, dass sich da keiner mehr sinnlos irgendwelche Viren einfängt, dass die Leute so Basic-Tasks im Internet können, aber irgendwie sind die ja genauso bescheuert wie bei mir damals. Das kann doch nicht sein. Die meisten wissen nur, wie man Snapchat und TikTok installiert. Ja, das kann ich mir vorstellen. Aber das hätte ich nicht gedacht. Ich hätte wirklich gedacht, dass die Generation, die nach mir jetzt aufwächst, komplett mit Computer, die Basics einfach Intos hat und kann ganz automatisch. Aber ist anscheinend nicht so. So, was gibt es denn noch für tolle Zertifikate, die man machen soll? Eitel. Nein. Das ist somit das bekannteste, was es gibt, aber nein. Gehen wir weg mit Eitel. Ich musste auch schon Eitel-Kurse machen. Eitel-Kurse sind wirklich echt ätzend. Ich musste, ich habe schon ein paar Eitel-Kurse gemacht. Einer schlimmer als der andere. Du dürft, du dürft den Test nicht machen, das ist aber. Heute würdest du einfach anrufen und sagen, du fühlst dich diskriminiert, darfst du den Test machen. Lernt man da, wie man richtig agile und innovative Projekte macht? Nee, bei Eitel lernst du irgendwelche merkwürdigen Best-Practice für Prozesse und Abläufe, die die Leute nicht nehmen als Vorschläge, weil die meisten Leute einfach low-brain und dumm sind. Auch in solchen Positionen, wo das entschieden wird, die Leute nicht einfach als Vorschläge nehmen, so könnte man das machen, sondern das eher als Religion aufziehen, so nach dem Motto, Eitel sagt, man müsste das so und so machen. Es ist scheißegal, was Eitel sagt. Eitel schlägt was vor und man kann sich davon was rausnehmen, was passt. Das ist keine, keine Glaubensfrage. Mcse, Microsoft Certified Systems Engineer. Ich glaube, das ist das, das ist ein wirklich sinnvolles Zertifikat, wenn man in Microsoft Umgebung arbeitet. Das ist denke ich wirklich eines der wenigen sinnvollen, die wir uns da angeguckt haben. Und viele, viele so Windows-Läden gucken da auch drauf. PMP, Project, nein, ganz bestimmt nicht. PMF, Project Management, Moment, das ist genau das gleiche, nur einmal in Deutsch und einmal in Englisch, oder was? Project Management, Professional, Project Management, das ist doch genau das gleiche. Nur das Fachmann und Professional, das ist doch genau das gleiche. Ach nee, das ist was anderes. Für erfahrene Project Manager, mein Group Professional und Fachmann ist genau das gleiche. Welcher Pepega Two-Head-Kopf hat sich das wieder ausgedacht, die Projekt, die Bezeichnung von diesem Ding, ey. Prince II. Da habe ich schon mal was von gehört. Das ist auch irgendeine Stonks-Geschichte. Six Sigma. Klingt nach einer Sache, wo ich einen großen Bogen drum machen will. Prost dich. Welche Zertifikate bringen was? Okay, das ist, alle akzeptieren alle Cookies. Was genau macht der da? Sind das die Zertifikate von ihm? Der hat sich gedacht, scheiße, man, so viel Zeit das alles zu machen und alles bringt nichts. Wie heißt das Meme mit dem Jungen, der das Kreuz vor sich hält, der? Ich habe keine Ahnung. Ich dachte immer, das ist ein Mädchen. Vielleicht ist auch ein Junge. Keine Ahnung. Weiß ich nicht. Ich habe keine Ahnung, wie das heißt. Musst du mal suchen. Wenn du Google suchst, bestimmt Child Holding Cross Meme. Da findest du bestimmt neue Meme-Einträge, noch ein Löcher zu. Agile Zertifikate. Oh, Scrum Master. Yes, yes, yes. Scrum Master. Agile Coach. Jawoll. Microsoft Certified Solution Developer. Die Dinger, die haben immer so, die haben mittlerweile so richtige Big Brain Namen, die ganzen Zertifikate. Du kannst dir anhand des Zertifikats gar nicht mal genau überlegen, was das eigentlich bedeutet. Isakwap. Isakwup. Open Group Togath. Was ist, was? Togath. Open Group Architecture Framework. Ja. Alles klar. Aytel. Nein, nein, nein, nein, nein, nein. Geh's mir fort. Aytel kommt mir nicht, kommt mir hier nicht ins Haus. Es ist ja schon wieder CISP. Oh, CISP. Das, das ist Privilege. Das dürfen nicht alle machen. Caesar Pen Test Plus. Wer wird denn da penetriert bei dem Test, fragt man sich, ne? Der Wertschuss ist am Start. Bin ich mal lang da? Acht Minuten noch. Als Scrum Lehrer muss man das echt i-Zahmbeschreibe choose my name. Ja, du musst so Scrum Consultant sein oder sowas, ja. Too-Lang-Lütten-Treat. In ein paar Berufen wie Administrator, Team Manager oder Tester sind Zertifikate auf Voraussetzungen verwendet. Ich sollte das wirklich flächendeckend der Fall sein, halte ich es für total fail, Zertifikate irgendwie vorauszusetzen. Der einzige Grund, wo ich es selbst für sinnvoll halten würde, nach Zertifikaten zu gucken, ist, wenn du jemand suchst, sehr speziell für ein gewisses Fachgebiet, sagen wir jetzt mal IBM Host-Entwicklung oder sowas in der Richtung. Also wirklich ein sehr spezielles Fachgebiet und du willst wissen, dass der auch echt ein bisschen Ahnung hat von dem, was er macht. Dann ist das ein guter Hinweis, wenn er vielleicht so ein Host-Zertifikat hat oder so. Aber ansonsten einfach mal ausprobieren, wie der mit aktuellen Problemen umgeht und... Scheiß auf Zertifikat, Alter. Ich meine, hey, ich hab mal, als ich jung war, ganz ganz jung, hab ich mal einen Wishful-Basics-6-Kurs gemacht an der Volkshochschule. Ich glaube, das Zertifikat sollte ich jetzt auch nochmal beilegen. Vor allem Wishful-Basics-6? Ich glaube, da findest du heute richtig gut bezahlte Jobs mit, wenn die noch was haben. Ey, wenn man heute noch Wishful-Basics-6-Anwendungen hat, sucht bestimmt Händeregen nach Wishful-Basics-6 an Programmierern. Ups, das wollte ich auch nicht sagen. Das ist ein bisschen wie Kobol. Das ist das Kobol von Microsoft, genau. Das ist ein bisschen wie Kobol. Wishful-Basics-6. Du hast mal einen C++-Kurs an der Volkshochschule. Okay, das sind zwei Dinge, von denen ich relativ wenig halte. Vor der Volkshochschule, weil das alles, was ich da bisher vorhin gesehen hab, ziemlich ercrabt war, und C++. Zwei Sachen in Kombination, die nicht gut ausgehen können. Chat, was ist mit euch denn jetzt schon wieder los hier? Easykiller sehe ich ähnlich. Es gibt an unseren Schulen viel zu wenig IT-Unterricht, den man auch wirklich so nennen könnte. Und ich sage damit nicht, dass man den Leuten irgendwelche Mathe-Geschichten beibringen soll, oder irgendwelche Machine-Learning-AIs programmieren lassen soll oder sonst was. Sondern, dass man denen einfach mal ein paar Grundlagen, die Basics, also die Computer-Grundlagen beibringen soll. Und ich meine, mit Computer-Grundlagen nicht Word-Texte eintippen. Sondern man fängt an mit Bedienung, so nach dem Motto, was für unterschiedliche Programme gibt es auf dem aktuellen PC, was für unterschiedliche Betriebssysteme gibt es so, warum gibt es unterschiedliche Programme in verschiedenen Kategorien, wie verwendet man das Internet ordentlich ohne sich irgendeinen Mist einzufangen, so kann man anfangen und da geht man über mit aus was bestehendem Computer, warum ist das ganze so aufgebaut, Internet, Netzwerk, ein bisschen drumherum. Und dann am Ende vielleicht ein bisschen programmieren. Das ist doch super. Das wäre doch schonmal mehr als das, was die meisten Leute in 10 oder 12 Jahren in der Schule machen. Also für das, was man in der Schule, also allein schon das, was da Informatik heißt, hat ja damit kaum was zu tun. Und das, was man da macht, ist wahrscheinlich ziemlich easy mode. Also bei mir war der Informatikunterricht an der Schule echt lächerlich. Das kann man überhaupt nicht so nennen. Wir haben Word-Dokumente in Lila gemacht, weil das Leila Leila, weil der Lehrer das so geil fand, wenn Lila Schrift drinne war. Und dann haben wir noch ein bisschen PowerPoint, Excel und AXS gemacht. AXS, kann ich mir noch dran erinnern. AXS war echt die Höhe. Da hat nicht mal Verstanden uns richtig erklären oder konnte sich immer richtig erklären, wozu man eine Datenbank braucht. Wir haben Java programmiert ab der 10. Klasse. Ja, das ist gut. Da lernt man wenigstens was. Was ich halt oft gesehen habe, ist, dass sinnvoller Informatikunterricht oftmals rein freiwillig ist. Also sprich, es gibt irgendwie so einen Computerkurs oder irgendwie auch ein bisschen etwa ein Programmierkurs und sowas, aber der ist freiwillig irgendwann nachmittags, kaum einer macht, außer die Ultrageeks. Für was benötigt man eigentlich AXS? Ehrlich gesagt, ich habe keine Ahnung, wofür man AXS verwendet. Ich habe ernsthaft keinen blassen Schimmer, warum man sich AXS antut. Choose my name sagt, Informatik im IT-Abitur geht eigentlich ganz klar. Java, Bizzle, Software Engineering, Datenbank, SQL, Semplicy. Ich glaube, du warst einer der Ausnahmen, wo das so gut funktioniert hat. Der Informatikunterricht zum größten Teil ist einfach crap. Falls es überhaupt gibt. Sunni sagt, er hat HTML gemacht und danach Java. Ja, perfekt. Perfekt. So muss das sein. Es wird ja auch besser, aber es hat eigentlich nichts mit der Realität zu tun im Jahr 2020. Das ist eh so ein Ding, wo ich sage, durch die Bank weg, kriegt man eigentlich in der Schule viel zu wenig erzählt, was man später interessantes Wichtiges braucht. Es wird ja immer gesagt, so nach dem Motto, in der Schule lernt man fürs Leben und sowas ist kompletter Schwachsinn. So ein paar Sachen zum Thema, was muss man machen, um ein Unternehmen in Deutschland zu gründen oder wie macht man eine Steuererklärung oder solche Dinge. Hey, sowas sollte man den Leuten auch mal erklären. Und man lernt in der Schule, finde ich auch nicht mal, weil es jemand gerade geschrieben hat, wie man sich Wissen aneignet. Das lernst du vielleicht, wenn du was studierst. Was du meistens in der Schule lernst, ist, wie man mit möglichst wenig auswendig Lernen so gut es geht, durchkommt irgendwie. Wirklich lernen oder auch Wissen lernen oder so, wirst du eigentlich nicht. Man entwickelt der Schule ein Gefühl für, was man sagen soll, was als richtige Antwort akzeptiert wird. Mietverträge, ja, solche Sachen. Ich finde, so ein bisschen Probleme des alltäglichen Lebens, die auf einen zukommen, sollte man in der Schule mal zumindest thematisieren. Wie gesagt, sowas wie, wie miete ich mir eine Wohnung, wie mache ich eine Steuererklärung, wie gründet man in Deutschland Unternehmen, worauf achtet man so, wie sieht es mit Vermögens, was weiß ich, mit Haus kaufen in Deutschland aus, wie sieht es mit Vermögensanlagen in Deutschland aus. Also generell so ein bisschen was, was man im Leben auch was von hat. Dann müssen auch die Eltern was beibringen, ja klar. Letztendlich kann es den Eltern keiner abnehmen, das zu machen. Aber guck mal, wenn einer acht, was weiß ich, wie viele Stunden am Tag, fünf Tage die Woche in der Schule ist, dann ist er nicht so viel verlangt, dass dort auch mal ein paar Sachen beigebracht werden, die fürs alltägliche Leben später für jeden oder für nahezu jeden relevant sind. Und ich sage gar nicht, dass man anderes jetzt gar nicht mehr machen soll, aber vielleicht, vielleicht könnte man die ein oder andere Sache ein bisschen zurückfahren. Zum Beispiel mein persönlicher Eindruck war, lassen wir jetzt mal Kunst, Musik und sowas mal weg. Religion, Ethik, lassen wir mal weg. Also gehen wir mal von aus, das behalten wir bei, da beschneiden wir nix. Zum Beispiel war Chemie. Chemie war so ein Ding, das hat man viel zu viel gemacht für das, was auch nur ansatzweise wichtig ist später. Man hat irgendwelche Masse von Atomen und Gedöns berechnet. Das mag durchaus sein, dass das elementare Bestandteile unserer Umwelt sind, aber das sind keine elementaren Bestandteile unserer Umwelt, über die man für das tagtägliche Leben Bescheid wissen muss. Es ist wichtig, dass man das weiß, das sind so grundsätzliche Sachen, wie ist die Welt aufgebaut, wie ist Materie aufgebaut. Klar, aber ob man Masse von Atomen und dichte Geschichten, ob man das wirklich unbedingt dann alles so im Detail wissen muss, wage ich mal zu bezweifeln. Zumal man das dann irgendwie auch in Klassen macht, dass man das später erstens mal weiß, sollte man es noch mal brauchen. Und wenn man sich dafür interessiert und man sowas gar so was studieren möchte, dann ist es eh egal, ob man das mal an der Schule gehabt hat oder nicht. Ich denke, man könnte schon in einigen Bereichen da ein bisschen Platz machen, dass man eben alltägliche Sachen lernt, die 90% oder ein Riesenteil der Leute später mal betreffen wird. Und das wird in der Schule, finde ich, zu wenig gemacht. Außerdem wird generell in der Schule zu viel auswendig gelernt. Religionsunterricht würde ich prinzipiell eh nicht machen, das ist ja zum größten Teil auch schon Ethik. Weiß gar nicht, ob es klassische Religionsunterricht noch gibt. Ja, auch so biologische Sachen. Da ist auch vieles dabei, wo man sagen will, ok, Grundlagen an sich gut und schön, aber gar so im Detail muss man es gar nicht wissen. Es ist schwierig. Was ich auf keinen Fall will, ist, dass man jetzt sagt, ok, da müssen die Leute eben noch länger in die Schule gehen. Das kann ja nicht Sinn und Zweck der Sache sein. Noch länger sollen die Leute nicht in die Schule. Wenn es nach mir geht, sollen die Leute eher weniger in die Schule gehen. Es kann mir keiner erzählen, dass man wirklich was lernt und auch was hängen bleibt, wenn man 12 Stunden am Tag hat. Wie soll denn das funktionieren? Und wohlgemerkt, 12 Stunden, die total unterschiedlich sind. Wir hatten teilweise Stundenpläne, die gingen bis nachmittags, selten gebe ich zu, aber hatten wir 12 Stunden, und das war dann so was wie 4 Stunden Mathe, 2 Stunden Geschichte, Sport, Musik und dann irgendwie nochmal hintendran Biologie oder so. Komplett zusammengewürfeltes Zeug. Ja, wir hatten einen Tag mit, vielleicht erzähle ich jetzt auch Scheiße. Wir hatten saulang. Ja, wir hatten auch noch 45 Minuten. Ach ja, mit Stunden, mit Stunden meine ich 45 Minutens Stunden, ja. 45 Minutens Stunden. 45 Minutens Stunden, Doppelstunde war 90 Minuten, dann gab es Viertelstunde Pause, außer um, ich glaube um 11 gab es dann eine halbe Stunde Pause, irgendwie so. Weiß gar nicht mehr genau. Und ich bin mir jetzt eigentlich relativ sicher, dass wir an einem Tag in der Woche, in der letzten Klasse, dass wir da 12 Stunden haben. Das war irgendwann mittags, mittags 15.30 Uhr oder so war das irgendwie erst fertig. Lass doch mal ausrechnen. Ja, sind 9 Stunden, passt doch. Das sind 9 Stunden, 9 Stunden Unterricht mit Pause. Das ist ein bisschen sehr lang, oder? Aber ich bin mir jetzt, ich kann es also ich kann es jetzt nicht beschwören, ja. Aber ich bin mir relativ sicher, dass wir einen Tag hatten, das war 12 Stunden und dabei, da kannst du dir doch nichts merken. 6 Stunden ist das höchste der Gefühle. 6 Stunden ist das wirklich das höchste der Gefühle, wo du auch nur halbwegs aufmerksam sein kannst. Ich fände das viel sinnvoller, wenn es 6 Stunden wären und dafür 4 Stunden das eine und vielleicht noch 2 Stunden bisschen was zum Ausgleich, also dass man irgendwie sowas hätte wie 4 Stunden. Na gut, wir haben angefangen, glaub. Wann ging die Schule los? 7.45 Uhr? Ne, das kann nicht sein, dann habe ich Mist erzählt. Das kann nicht sein. Das können keine 12 Stunden gewesen sein, weil das wären allein schon 9 Stunden, das wären allein schon 9 Stunden bis 17, das kann nicht sein. Ne, das muss weniger gewesen sein. Es können keine 12 Stunden und 45 gewesen sein mit Pause. Egal, scheiß drauf, es war saumäßig lang. Ich fände das viel sinnvoller, wenn man dann sagt, ok, es sind 6 Stunden, da kann man sich wenigstens ein bisschen was merken und dann hast du aber die Sache wenigstens am Stück wahrgenommen, dann hättest du 4 Stunden Mathe, jetzt mal Hardcore-Geschichte gesagt und dann hättest du nachmittags noch 2 Stunden irgendwas zum bisschen abschalten im Kopf, sei es eine Doppelstunde Musik oder eine Doppelstunde Kunst oder eine Doppelstunde Sport oder irgendwas, das wäre doch eigentlich ganz sinnvoll. Ja und wie gesagt, ich fände es halt cool, wenn man den Leuten ein bisschen mehr Sachen beibringt, die im alltäglichen Leben auch was bringen. Wie gesagt, sei es nur wie das mit Steuererklärung, Mietverträgen aussieht, vielleicht auch mal angucken, ok, wie gucke ich denn nach einem Ausbildungsplatz, wie gucke ich denn das einzelne Unternehmen an, was könnte da was für mich sein, wie gründe ich ein Unternehmen in Deutschland vielleicht, es gibt ja zig Themen, die vielen Leuten später was bringen würden. Du warst bestimmt 12 Stunden aus dem Haus und deshalb macht sich eingebrannt, ja das kann schon sein. Wirtschaft und Recht, zumindest ein bisschen, ja genau. Ja, genau. So ein paar Sachen drum herum, das wäre echt gut. Und ich hab jetzt schon, weil es hier gerade alle im Chat schreibt, diese 30 Beispiele gab es alle bei uns, ich hab das jetzt auch schon von eingehört, dass es ein bisschen mehr Einzug hält mittlerweile. Aber ich hab so meine Zweifel, ob das die Leute wirklich gut für das Leben, was nach der Schule kommt, vorbereitet. Letztendlich die meisten Erfahrungen musst du selbst machen, aber es ist doch nicht verkehrt, wenn du von ein paar Sachen schon mal gehört hast. Der größte Jebait, den es bei mir jemals in der Schule gegeben hat, war, wir hatten einen Wahlpflichtfach, das hieß selbstständig werden. Und der Text war schon so geschrieben, als ging es da wirklich drum, so nach dem Motto, wie gründet man Unternehmen in Deutschland, was gibt es da so für rechtliche Geschichten und so. Und das war halt ein Thema, was mich damals auch schon echt interessiert hat. Da hab ich mir gedacht, okay, meldest du dich dafür an. Und wisst ihr, was wir gemacht haben, was die mit selbstständig lernen gemeint haben? Wir haben kochen gelernt. Die haben einen Wahlpflichtfach angeboten, was sich gelesen hat nach ein bisschen minimal BWL und rechtliche Geschichten und auch vom Text her und vom Titel her und am Ende hat man gekocht. Nicht, dass es jetzt wahnsinnig schlecht wäre, ein bisschen kochen zu lernen, aber der Jebait war, dass es komplett anders verkauft wurde. Ich fand das am Ende gar nicht schlecht. Da haben wir Kekse gebacken und sonst was, das waren auch die letzten zwei Stunden am Tag, da kann ich mich noch dran erinnern. Wahlpflichtfach, ja, sowas hatten wir, also ich, du musst, du hattest irgendwie, keine Ahnung, vier Stunden in der Woche, da musst du dir dann aussuchen, was du machen willst. Und ich fand das mit kochen gar nicht mal schlecht, weil wir haben dann Kekse gemacht und solche Sachen und ich fand es aus so fern nicht schlecht, weil das waren die letzten zwei Stunden, da hat man sich immer was zu essen gemacht und ordentlich gefressen, bevor man nach Hause gegangen ist. Meine Oma hat sich immer gewundert, warum ich nichts mehr zu essen wollte. Vielleicht warst du einfach im falschen Raum, ja man weiß nie genau. Das war noch, ich fand es gar nicht schlecht, was ich aber richtig jebaited fand, war halt einfach, dass die das uns anders verkauft haben und das hat mich bis zum Schluss übelst angepisst. Sport war immer easy, auch wenn man pepo fett war. Ja, damals war ich noch nicht pepo fett, damals war ich ziemlich sportlich. Ich hab nie Strecken gemessen und sowas, aber ich weiß, dass ich teilweise mehrere Kilometer geschwommen bin und auch rennen konnte, ohne dass ich irgendwie großartig aus der Puste kam, also sprich heute, wenn ich mal Gas gebe und über den Bahnübergang renne, denke ich mir so, war aber anstrengend. Captain Peng, das haben wir in diesem Kochen Kurs auch gemacht. Wir haben auch ein bisschen was genäht. Naja, gut, also es ist 22.00 und ich muss ins Bett. Spontaner Stream heute gewesen. Außerdem schön, dass viele am Start waren. Wir sehen uns, machts gut, bis morgen, oder so, see you.", "segments": [{"id": 1, "start": 30.0, "end": 57.48, "text": "So, da sind wir ein bisschen später als gedacht."}, {"id": 2, "start": 57.48, "end": 62.88, "text": "Eigentlich habe ich gedacht, ich Kreiselgrinder heute Abend ein bisschen komme gar nicht on,"}, {"id": 3, "start": 62.88, "end": 65.76, "text": "aber ich hatte irgendwie dann doch keinen Bock mehr."}, {"id": 4, "start": 65.76, "end": 69.76, "text": "Hab gedacht, komm, machst du noch, machst noch mal eine Stunde an, ey."}, {"id": 5, "start": 69.76, "end": 72.24, "text": "Oh, ich bin irgendwie voll kaputt heute."}, {"id": 6, "start": 72.24, "end": 75.8, "text": "Es war überhaupt schon jemand da."}, {"id": 7, "start": 75.8, "end": 88.36, "text": "Cute Chat."}, {"id": 8, "start": 88.36, "end": 89.36, "text": "Excellent Chat."}, {"id": 9, "start": 89.36, "end": 93.52, "text": "Ah, der KarniL10 ist schon da."}, {"id": 10, "start": 93.52, "end": 96.52, "text": "Bam, 2, 4, 6, okay, ein paar sind doch noch da."}, {"id": 11, "start": 96.52, "end": 100.48, "text": "Angeblich sind nur vier Leute da, das heißt wir haben jetzt schon 50% im Chat."}, {"id": 12, "start": 100.48, "end": 101.48, "text": "Quickmuffs."}, {"id": 13, "start": 101.48, "end": 108.32, "text": "Phoenix ist auch am Start, ne Leute, ich bin halt irgendwie total kaputt."}, {"id": 14, "start": 108.32, "end": 113.24, "text": "Kennt ihr das irgendwie, dass manchmal, dass ihr das Gefühl habt, also immer so die Leute,"}, {"id": 15, "start": 113.24, "end": 120.76, "text": "die auch so IT und Umfeld arbeiten, habt ihr manchmal den Eindruck, dass ihr irgendwie"}, {"id": 16, "start": 120.76, "end": 127.52, "text": "so Babysitter machen müsst für irgendwelche Projektmanager, weil die eigentlich das Projekt"}, {"id": 17, "start": 127.52, "end": 131.56, "text": "managen sollen, aber gar keine Ahnung haben davon, was die eigentlich machen."}, {"id": 18, "start": 131.56, "end": 135.6, "text": "Ja, ist irgendwie sehr merkwürdig."}, {"id": 19, "start": 135.6, "end": 143.72, "text": "Was geht, wie gesagt, nicht viel."}, {"id": 20, "start": 143.72, "end": 150.48, "text": "Was gibt es eigentlich für sinnvolle IT-Zertifikate, das werde ich immer im Stream gefragt, so"}, {"id": 21, "start": 150.48, "end": 155.84, "text": "nach dem Motto, Max, was hältst du von Zertifikaten, ich habe gar keine Ahnung, was ist für gute,"}, {"id": 22, "start": 155.84, "end": 161.88, "text": "was es für gute Zertifikate gibt, müssen wir gleich mal so was, useful IT, komm, wir"}, {"id": 23, "start": 161.88, "end": 169.16, "text": "suchen mal auf Deutsch, sinnvolle IT-Zertif, IT-Zertif, weil ich habe echt keine Ahnung,"}, {"id": 24, "start": 169.16, "end": 170.16, "text": "was da für gute Sachen gibt."}, {"id": 25, "start": 170.16, "end": 176.6, "text": "Also ja, mal von den üblichen Verdächtigen, so was, wie ein CCNA abgesehen, aber ein CCNA"}, {"id": 26, "start": 176.6, "end": 183.48, "text": "juckt doch im Endeffekt auch keinen, CCNA ist das, ist quasi der Cisco Noob, nur nicht"}, {"id": 27, "start": 183.48, "end": 188.68, "text": "ganz, also der Cisco Einsteiger plus nicht mal ganz so Noob, CCNA Krieger hat doch, ja"}, {"id": 28, "start": 188.68, "end": 192.36, "text": "hat doch entweder jeder, oder kannst du einem, was mit dem CCNA lernt, kannst du einem in"}, {"id": 29, "start": 192.36, "end": 193.36, "text": "der Woche beibringen."}, {"id": 30, "start": 193.36, "end": 202.4, "text": "Jaja, also, ja, aber wie gesagt, jetzt wo ein bisschen mehr Leute da sind, kennt ihr"}, {"id": 31, "start": 202.4, "end": 203.4, "text": "das?"}, {"id": 32, "start": 203.4, "end": 208.64, "text": "Wenn ihr, wenn ihr das Gefühl habt, ihr müsst irgendwie Babysitter für irgendwelche Projektmanager"}, {"id": 33, "start": 208.64, "end": 216.64, "text": "machen, weil die sonst ganz merkwürdige Dinge machen würden, also zum Beispiel, zum Beispiel"}, {"id": 34, "start": 216.64, "end": 222.6, "text": "habe ich, habe ich bei uns ein Ticket gekriegt, da steht drinnen, ich soll, also nicht näher"}, {"id": 35, "start": 222.6, "end": 225.56, "text": "definiert, irgendwelche Ressourcen schätzen."}, {"id": 36, "start": 225.56, "end": 230.04, "text": "So, da habe ich erstmal gefragt, ok, was genau meinste denn eigentlich?"}, {"id": 37, "start": 230.04, "end": 238.88, "text": "Leute, Hardware, Cluster-Ressourcen, was, was denn für Ressourcen, da hat es großartig"}, {"id": 38, "start": 238.88, "end": 243.2, "text": "ausgeholt, so nach dem Motto, ja alles, alles, und dann habe ich gesagt, ja, was wollt ihr"}, {"id": 39, "start": 243.2, "end": 244.2, "text": "denn machen?"}, {"id": 40, "start": 244.2, "end": 248.92, "text": "Ja, sie wollen das quasi einmal die komplette, komplette Infrastruktur klonen, habe ich auch"}, {"id": 41, "start": 248.92, "end": 255.0, "text": "gemeint, so, seid ihr euch sicher, also ist, ist, ist euch klar, was ihr da gerade erzählt"}, {"id": 42, "start": 255.0, "end": 262.6, "text": "oder nicht, komplette Infrastruktur klonen, auch noch ein drittes Rechenzentrum oder was,"}, {"id": 43, "start": 262.6, "end": 267.96, "text": "oder wie, ähm, hast du das mitbekommen mit Google plus Deutsche Bank, nee, nee, habe"}, {"id": 44, "start": 267.96, "end": 268.96, "text": "ich nicht mitbekommen, was denn?"}, {"id": 45, "start": 268.96, "end": 280.84, "text": "Ne, ähm, so, und dann, und dann, was witziger war, jetzt lief es darauf raus, jetzt lief"}, {"id": 46, "start": 280.84, "end": 285.84, "text": "es darauf raus, dass, wir haben ja auch ein paar Kubernetes, wir haben ja auch zwei Kubernetes"}, {"id": 47, "start": 285.84, "end": 291.52, "text": "Cluster und ein paar Linux Container und sowas, ich habe halt gefragt, ok, was, was wollt"}, {"id": 48, "start": 291.52, "end": 296.32, "text": "ihr denn für Ressourcen wissen bei, bei VMs oder gar bei Container, und da haben die"}, {"id": 49, "start": 296.32, "end": 304.68, "text": "geschrieben, die Anzahl, mir gedacht, ok, das ist zwar überhaupt nicht das, was irgendwie"}, {"id": 50, "start": 304.68, "end": 310.72, "text": "sinnvoll ist, aber, dann schreibe ich euch halt mal rein, wir haben, äh, ein Pod davon,"}, {"id": 51, "start": 310.72, "end": 316.24, "text": "zwei Pods davon, drei davon, zwei davon und sonst was, wir mal gucken, was ihr davon"}, {"id": 52, "start": 316.24, "end": 322.92, "text": "macht, ja, aber übrigens, dann habe ich nochmal die Hardware rausgesucht, worauf das läuft,"}, {"id": 53, "start": 322.92, "end": 329.28, "text": "und dann haben sie erzählt, sie wollen irgendwie was, was komplett anderes, also, ich bin,"}, {"id": 54, "start": 329.28, "end": 332.24, "text": "ich meine, ich muss doch nicht die Arbeit von irgendeinem Projektmanager machen, das"}, {"id": 55, "start": 332.24, "end": 340.84, "text": "kann der machen, der soll mir sagen, was er haben will, ja, also, wenn er das nicht weiß,"}, {"id": 56, "start": 340.84, "end": 350.04, "text": "da kriegt er halt genau das, irgendwas, weil woher soll ich es wissen, äh, das kommt meist"}, {"id": 57, "start": 350.04, "end": 354.72, "text": "der, dass die Projektmanager zum Teil technologisch und nicht ansatzweise wissen, was da abgeht,"}, {"id": 58, "start": 354.72, "end": 361.08, "text": "ja, das stimmt, aber es wäre schon mal allen Beteiligten geholfen, wenn sie da nicht so"}, {"id": 59, "start": 361.08, "end": 368.44, "text": "tun würden, so tun, so tun würden, als ob sie es wissen, weil viele Projektmanager haben"}, {"id": 60, "start": 368.44, "end": 375.28, "text": "so einen, haben wahrscheinlich einen Rhetorikkurs gemacht, so nach dem Motto, wie verkaufe ich"}, {"id": 61, "start": 375.28, "end": 381.12, "text": "überzeugend, wovon ich gar keine Ahnung habe, das ist bestimmt ein sinnvoller Skill, wenn"}, {"id": 62, "start": 381.12, "end": 388.6, "text": "es darum geht, Projekte irgendwie noch höhere Managementleuten zu, äh, präsentieren, allerdings"}, {"id": 63, "start": 388.6, "end": 395.28, "text": "beim Einsammeln von Informationen sollte man diesen Skill deaktivieren, weil ansonsten"}, {"id": 64, "start": 395.28, "end": 398.88, "text": "wirkt das so, als hätte man Ahnung, obwohl man gar keine Ahnung hat, dementsprechend"}, {"id": 65, "start": 398.88, "end": 403.88, "text": "kriegt man gar nicht die Infos, die man haben will, das wäre ja schon immer ein erster"}, {"id": 66, "start": 403.88, "end": 415.08, "text": "Schritt, wenn man das gleich mal sagt, so nach dem Motto, ok, ähm, erklär mal langsam,"}, {"id": 67, "start": 415.08, "end": 419.76, "text": "bei uns ist auch immer geil, der interne Auftraggeber von einer internen Software kann sich nichts"}, {"id": 68, "start": 419.76, "end": 425.12, "text": "vorstellen, also, alles erstmal bauen, sodass alles klappt und danach umbauen oder neue"}, {"id": 69, "start": 425.12, "end": 434.96, "text": "exzellent effizientes Zeitmanagement, ja, ja sowieso ähnliche Dinge haben wir auch,"}, {"id": 70, "start": 434.96, "end": 443.4, "text": "bei uns läuft das aber meistens so, irgendwelche Marketingköppe, ich hab eigentlich keine"}, {"id": 71, "start": 443.4, "end": 451.6, "text": "Ahnung, weil das alles so ist, machen irgendwie ne ganz tolle Präsentation zu was, wovon"}, {"id": 72, "start": 451.6, "end": 464.68, "text": "eigentlich auch keiner genau weiß, ähm, was es werden soll, ja, zum Beispiel, ich muss"}, {"id": 73, "start": 464.68, "end": 470.96, "text": "das ein bisschen abändern, damit es nicht zu klar ist, um was es geht, oh Tainsaw geht"}, {"id": 74, "start": 470.96, "end": 475.12, "text": "hier wieder ab, drei Subs, danke schön, wer kriegt denn was, der Twinkower kriegt was,"}, {"id": 75, "start": 475.12, "end": 482.56, "text": "End of Function und der Akte, Poggers, exzellent, Big Brain, Huge Subscription, das ist ja quasi"}, {"id": 76, "start": 482.56, "end": 492.64, "text": "fast schon, Moment, ich finde es nicht, exzellent, ähm, genau, und bei uns halten die immer"}, {"id": 77, "start": 492.64, "end": 500.32, "text": "irgendwelche, irgendwelche geilen Präsentationen, bevor man genau weiß, was abgeht, so, und"}, {"id": 78, "start": 500.32, "end": 509.44, "text": "wir haben jetzt was, da hat irgendjemand gedacht, ok, Tesla und Elon Musk und SpaceX und sowas,"}, {"id": 79, "start": 509.44, "end": 517.08, "text": "ist grad voll angesagt, und hat dann gesagt, wir machen jetzt ein Projekt, ähm, unser"}, {"id": 80, "start": 517.08, "end": 526.88, "text": "Flug zum Mars, es hat mit dem Flug zum Mars nichts zu tun, also nicht, das heißt einfach"}, {"id": 81, "start": 526.88, "end": 538.32, "text": "nur so, ach ne, Elon Musk, nicht Elon Musk, Elon Musk, komm ich auf, Elon Musk, Elon Musk,"}, {"id": 82, "start": 538.32, "end": 543.72, "text": "so, zumindest ist auch wurscht, mir gehts ja nicht, zumindest ist das grad angesagt,"}, {"id": 83, "start": 543.72, "end": 547.96, "text": "SpaceX, Elon Musk, Tesla, alles mögliche, und da hat jetzt irgendjemand bei uns ein Projekt"}, {"id": 84, "start": 547.96, "end": 553.12, "text": "ins Leben gerufen, unser Flug zum Mars, es hat, wie gesagt, ich hab es ein bisschen abgewandelt,"}, {"id": 85, "start": 553.12, "end": 558.32, "text": "es ist ein bisschen anders, und wenn man da jetzt denkt, ok, wir wollen zum Mars, da bin"}, {"id": 86, "start": 558.32, "end": 563.48, "text": "ich der erste, der sagt, ich flieg da garantiert nicht mit, wenn wir zum Mars fliegen, äh,"}, {"id": 87, "start": 563.48, "end": 572.6, "text": "Fleege Express Twitch Prime, dankeschön, vier Monate, huge, so, und, um was es letztendlich"}, {"id": 88, "start": 572.6, "end": 582.36, "text": "geht ist, und warum das so heißt, hat nur zwei Gründe, erstens, weil man Mars abgekürzt"}, {"id": 89, "start": 582.36, "end": 591.28, "text": "hat zu irgendwas, frag mich nicht, blah, services, irgendwas, also, weil man gesehen hat, Mars"}, {"id": 90, "start": 591.28, "end": 597.52, "text": "ist eine coole Abkürzung, und weil man eine Präsentation machen konnte, die, kein Witz,"}, {"id": 91, "start": 597.52, "end": 602.68, "text": "aufgebaut ist wie eine Rakete, sieht aus wie eine Rakete, ja, so, sieht cool aus, hat natürlich"}, {"id": 92, "start": 602.68, "end": 612.32, "text": "keinen Mehrwert, und was es im Endeffekt gehen soll ist, komplett abstrakt, dass alle services"}, {"id": 93, "start": 612.32, "end": 618.84, "text": "quasi in die Cloud wandern sollen, so, komplett abstraktes Ding, so, und es hat da jetzt irgendeiner"}, {"id": 94, "start": 618.84, "end": 623.08, "text": "präsentiert, und hat sich gefreut, dass das gut angekommen ist, weil es so eine stylische"}, {"id": 95, "start": 623.08, "end": 627.24, "text": "Präsentation war, aber was jetzt damit gemacht werden soll, weiß keiner so genau, es ist"}, {"id": 96, "start": 627.24, "end": 635.56, "text": "einfach da, gifted it here so once a Blockwatcher, Big Brain, der Blockwatcher hat was gekriegt,"}, {"id": 97, "start": 635.56, "end": 647.2, "text": "dankeschön, für den fünften Sub hier schon, exzellente, naja, und sowas haben wir laufend,"}, {"id": 98, "start": 647.2, "end": 651.36, "text": "und ich weiß, dass es woanders nicht viel besser läuft, man sagt immer so, oh, ich"}, {"id": 99, "start": 651.36, "end": 658.28, "text": "brauche mal ein Wasser hier, wo habe ich denn, glaube ich im kleinen Wasserholen, ich höre"}, {"id": 100, "start": 658.28, "end": 668.68, "text": "das ja auch von anderen, dass es da ähnlich läuft, wo ich mich immer frage, wo es mich"}, {"id": 101, "start": 668.68, "end": 675.12, "text": "dann nicht wundert, dass manche Start-ups Sachen einfach eleganter und besser hinkriegen"}, {"id": 102, "start": 675.12, "end": 682.16, "text": "als irgendwelche großen Dinger, wenn man sich überlegt, wie das bei uns sein wird,"}, {"id": 103, "start": 682.16, "end": 689.64, "text": "also das Scam-Train läuft, der Scam-Train ist am Start, Lim Squizzy hat Twitch Prime"}, {"id": 104, "start": 689.64, "end": 694.88, "text": "abonniert, dankeschön, der Chibay-Train läuft, ok, solange der Chibay-Train läuft, erzähle"}, {"id": 105, "start": 694.88, "end": 701.48, "text": "ich euch das nochmal kurz weiter, das Scam-Train, ja, NicoCS Twitch Prime, sieben Monate, dankeschön,"}, {"id": 106, "start": 701.48, "end": 710.96, "text": "aja ja, Poggers Subscription, so, was wollte ich jetzt sagen, genau, also das wundert"}, {"id": 107, "start": 710.96, "end": 720.04, "text": "mich manchmal nicht, wie gut das Start-ups hinkriegen, weil da ist einfach viel Overhead"}, {"id": 108, "start": 720.04, "end": 726.64, "text": "nicht vorhanden, ja, bei uns ist es teilweise so, jetzt mal ganz übertrieben gesagt, aber"}, {"id": 109, "start": 726.64, "end": 731.64, "text": "es ist schon ziemlich nah an der Wahrheit dran, also bei uns ist es manchmal so, wenn"}, {"id": 110, "start": 731.64, "end": 739.12, "text": "du es richtig machst, also so, dass es dir was bringt, dem eigenen Team was bringt und"}, {"id": 111, "start": 739.12, "end": 744.76, "text": "alle anderen das Gefühl haben, es hätte was gebracht, dann musst du Folgendes machen"}, {"id": 112, "start": 744.76, "end": 750.32, "text": "bei uns und wahrscheinlich ist das bei vielen, die in einem größeren Laden machen, ähnlich,"}, {"id": 113, "start": 750.32, "end": 757.0, "text": "man tippt eine Zeile auf der Shell, die irgendwas halbwegs Sinnvolles macht, es ist gar nicht"}, {"id": 114, "start": 757.0, "end": 764.12, "text": "mal so entscheidend, wie sinnvoll das ist und danach geht man in Gruppenleiter-Runden,"}, {"id": 115, "start": 764.12, "end": 771.92, "text": "Abteilungsrunden, IT-Runden, Statusrunden und erzählt für den nächsten Monat, dass man"}, {"id": 116, "start": 771.92, "end": 778.24, "text": "diese eine Sache gemacht hat und dann feiern sich alle richtig krass drauf ab, dass man"}, {"id": 117, "start": 778.24, "end": 785.84, "text": "wieder so geile Sachen gemacht hat und am Ende hast du eigentlich nichts gemacht, richtig,"}, {"id": 118, "start": 785.84, "end": 793.4, "text": "aber alle haben das Gefühl, es war richtig geil, was bei uns teilweise für kleine Dinge"}, {"id": 119, "start": 793.4, "end": 800.4, "text": "riesig breit getreten werden und fünf Stunden Retrospektive, sonstige Abstimmungsdinger gemacht"}, {"id": 120, "start": 800.4, "end": 806.96, "text": "werden, das nimmt teilweise total überhand. Scheiße, das ist bei uns genauso, ey ich"}, {"id": 121, "start": 806.96, "end": 817.08, "text": "glaube, das ist bei den meisten so. Wir haben übrigens noch mehr Subs, hab ich gerade gesehen,"}, {"id": 122, "start": 817.08, "end": 829.24, "text": "General Slane hat auch wieder Subs, drei Monate, dankeschön, excellent Subs, big brain. Ja"}, {"id": 123, "start": 829.24, "end": 835.36, "text": "und der Witz dabei ist ja auch noch, warum ich das jetzt erzähle ist, der Captain Peng"}, {"id": 124, "start": 835.36, "end": 840.76, "text": "spricht's gerade an, der Witz dabei ist auch noch, dass das alle lieber ist, wie man macht"}, {"id": 125, "start": 840.76, "end": 854.12, "text": "in seiner Zeit was Sinnvolles. Wenn ich mir überlege, was ich hab, ich hab heute, glaube"}, {"id": 126, "start": 854.12, "end": 861.0, "text": "von ungefähr acht Stunden, wo ich da war, hab ich Wartungsarbeiten-Meeting gedürnt"}, {"id": 127, "start": 861.0, "end": 867.8, "text": "gemacht, eine Stunde, in einem Team-Meeting, in dem Team bin ich zwar nicht, aber da bin"}, {"id": 128, "start": 867.8, "end": 880.32, "text": "ich öfters dabei, Besprechung, neues Release-Runde, eine Stunde, irgendwelche Ticket-Abstimmungs-Meetings"}, {"id": 129, "start": 880.32, "end": 888.0, "text": "bestimmt auch noch mal eine Stunde und dann hab ich mit einem Kollegen nach der Runde"}, {"id": 130, "start": 888.0, "end": 892.6, "text": "noch mal eine halbe Stunde über aktuelle Sachen geschwätzt. Also quasi, ich war bestimmt"}, {"id": 131, "start": 892.6, "end": 914.28, "text": "viereinhalb Stunden mit zu 90% sinnlosen Laberstell-Sachen beschäftigt. Äh, was? Nee, also Skill-Killer,"}, {"id": 132, "start": 914.28, "end": 922.04, "text": "da hab ich nix mit zu tun. Ich muss, ich muss, ich muss keine PR-Sachen, ach du weißt, Pull-Requests!"}, {"id": 133, "start": 922.04, "end": 932.12, "text": "Ich dachte du meinst mit Werbung. Naja, also PR-Approven ist ein Teil davon. Das ist das,"}, {"id": 134, "start": 932.12, "end": 938.56, "text": "was man unter anderem macht. Das war einfach, ist es ja nicht. Mit PR-Approven ist ja nicht"}, {"id": 135, "start": 938.56, "end": 944.16, "text": "getan. Man muss sich ja auch erstens mal die Änderung angucken, die Änderung mit den"}, {"id": 136, "start": 944.16, "end": 950.4, "text": "anderen Änderungen, die Leute machen, unter einen Hut bringen. Und oftmals funktioniert"}, {"id": 137, "start": 950.4, "end": 955.4, "text": "es nicht, sich mit den Leuten zusammensetzen, gucken was es funktioniert. Das an die restliche"}, {"id": 138, "start": 955.4, "end": 961.44, "text": "Welt verkaufen, das war übrigens heute, weil ich meinte Runde zum neuen Release. Heute"}, {"id": 139, "start": 961.44, "end": 968.48, "text": "ist nämlich Release-Start in unserer Testumgebung. Und da war die Runde heute dafür. Der restlichen"}, {"id": 140, "start": 968.48, "end": 972.8, "text": "Welt verkaufen, was für geile Änderungen haben. Da haben wir ein richtig langes Chainslot"}, {"id": 141, "start": 972.8, "end": 980.72, "text": "mittlerweile zu, wo dann nach Möglichkeit für auch nicht ganz so IT-versierte Leute"}, {"id": 142, "start": 980.72, "end": 987.08, "text": "drin steht, was passiert. Zum Beispiel, dass jetzt eine neue Domain verwendet werden kann"}, {"id": 143, "start": 987.08, "end": 992.76, "text": "für Mails und sowas. Sowas steht dann da drin. Manche Sachen, die kompliziert sind,"}, {"id": 144, "start": 992.76, "end": 998.4, "text": "schreibe ich da gar nicht rein, weil die Noobs damit nichts anfangen können, sondern wenn"}, {"id": 145, "start": 998.4, "end": 1003.32, "text": "ich die Auswahl habe, wie, ich schreibe rein, wir haben jetzt eine neue HA-Proxy-Version,"}, {"id": 146, "start": 1003.32, "end": 1010.44, "text": "die Intel IES Hardware Encryption verwenden kann, oder ich habe die Möglichkeit reinzuschreiben,"}, {"id": 147, "start": 1010.44, "end": 1013.92, "text": "wir können jetzt eine neue Absender-E-Mail-Adresse verwenden. Dann schreibe ich wahrscheinlich"}, {"id": 148, "start": 1013.92, "end": 1018.6, "text": "rein, wir können eine neue Absender-E-Mail-Adresse verwenden, in das öffentliche Aushängeschild"}, {"id": 149, "start": 1018.6, "end": 1026.6, "text": "Chainslot, weil mit der anderen Sache kann kein Mensch was anfangen. Was wir wahrscheinlich"}, {"id": 150, "start": 1026.6, "end": 1031.8, "text": "machen würden ist, ich würde das umschreiben, ich bekomme einen Change, da steht drin, okay,"}, {"id": 151, "start": 1031.8, "end": 1035.4, "text": "wir haben eine neue HA-Proxy-Version, die kann jetzt SSL-Beschleunigung mit der CPU machen,"}, {"id": 152, "start": 1035.4, "end": 1040.84, "text": "wunderbar. Da steht er drin, das würde ich aber so nicht reinschreiben, sondern ich"}, {"id": 153, "start": 1040.84, "end": 1046.72, "text": "würde irgendwie das in Performance Improvement umdichten, was es ja unter dem Strich auch"}, {"id": 154, "start": 1046.72, "end": 1054.96, "text": "ist und das irgendwie als Load Balancing Performance Verbesserung oder so verkaufen. Das finden"}, {"id": 155, "start": 1054.96, "end": 1062.6, "text": "wir wieder alle geil. Sind Merch-Konflikte bei euch Teil des Prozesses oder versucht"}, {"id": 156, "start": 1062.6, "end": 1072.4, "text": "ihr das zu vermeiden? Also vermeiden kannst du es nicht. Also ja, das ist Teil, das vermeiden"}, {"id": 157, "start": 1072.4, "end": 1080.84, "text": "kannst du es nicht. Also ich habe das bei uns als relativ klassische Git-Struktur da"}, {"id": 158, "start": 1080.84, "end": 1086.64, "text": "aufgezogen, also sprich, wir haben, ich zeige euch mal ein Bild, wir machen das nicht genau"}, {"id": 159, "start": 1086.64, "end": 1093.96, "text": "so, aber ich glaube da gibt es ein ganz gutes Bild, was Branches angeht. Leute, ich weiß,"}, {"id": 160, "start": 1093.96, "end": 1101.8, "text": "Big Brain, ja so ungefähr ist es bei uns, genau. Das Big Brain, aber ich weiß auch"}, {"id": 161, "start": 1101.8, "end": 1108.88, "text": "umgedreht, dass es ein paar interessiert. Also wir haben es folgendermaßen, ja doch,"}, {"id": 162, "start": 1108.88, "end": 1113.48, "text": "das trifft es eigentlich ganz gut, wie es hier aufgemalt ist. Also wir haben eine Master-Branche,"}, {"id": 163, "start": 1113.48, "end": 1125.72, "text": "da kommt alles Mögliche rein. Von Server-Config bis irgendwelche Mail-Config-Files, XML-Config"}, {"id": 164, "start": 1125.72, "end": 1137.08, "text": "für Java-Gedöns, zumindest wenn es um Infrastruktur-Gedöns geht. So und das kommt da rein, per"}, {"id": 165, "start": 1137.08, "end": 1142.8, "text": "Software ist es ähnlich. Ich weiß, Master-Branche ist voll verpönt aktuell, aber wie gesagt"}, {"id": 166, "start": 1142.8, "end": 1146.68, "text": "bei Software ist es ähnlich. Also zumindest, wir haben eine Master-Branche und das heißt"}, {"id": 167, "start": 1146.68, "end": 1150.88, "text": "bei uns auch tatsächlich immer noch Master, ich werde das auch nicht umbenennen, weil"}, {"id": 168, "start": 1150.88, "end": 1154.92, "text": "ich da in so vielen Stellen was umbenennen müsste, dass das eigentlich den Aufwand nicht"}, {"id": 169, "start": 1154.92, "end": 1161.12, "text": "rechtfertigt. Es sei denn, irgendjemand kommt auf die Ideen, fühlt sich getriggert dadurch"}, {"id": 170, "start": 1161.12, "end": 1164.72, "text": "und unser Abteilungsleiter sagt, wir müssen das jetzt umbenennen, aber ich glaube, ganz"}, {"id": 171, "start": 1164.72, "end": 1172.16, "text": "so verrückt sind sie noch nicht. Zumindest, wir haben eine Master-Branche und ähm, übrigens"}, {"id": 172, "start": 1172.16, "end": 1181.8, "text": "da stimmt überhaupt nicht, was das Bild hier zeigt. Das ist gar nicht richtig. Äh, ne,"}, {"id": 173, "start": 1181.8, "end": 1190.56, "text": "das, okay die Bilder sind voll für'n Arsch. Ne, stimmt nicht so. Wir machen's wieder Git-Model-Linux-Kernel,"}, {"id": 174, "start": 1190.56, "end": 1204.2, "text": "wir machen's ziemlich genau wie der Linux-Kernel, aber halt nur vom, vom Branch. Äh, ja, so,"}, {"id": 175, "start": 1204.2, "end": 1208.8, "text": "so in der Richtung machen wir's, genau. Ähm, das, das trifft's, das trifft's eigentlich"}, {"id": 176, "start": 1208.8, "end": 1214.84, "text": "ganz gut. Also wir haben eine Master-Branche, von da kommt alles und da geht auch alles"}, {"id": 177, "start": 1214.84, "end": 1221.8, "text": "rein. Also sprich, das hier ist irgendwie Stand X und irgendeiner ist jetzt der Meinung,"}, {"id": 178, "start": 1221.8, "end": 1226.0, "text": "da kommen wir nämlich jetzt auch gleich, wenn wir das in Merge-Konflikten machen, ähm,"}, {"id": 179, "start": 1226.0, "end": 1232.28, "text": "da kommt jetzt irgendeiner auf die Idee, okay, wir brauchen, was ich, neue Zertifikate oder"}, {"id": 180, "start": 1232.28, "end": 1248.56, "text": "so, oder, äh, wir brauchen, neun, neun Mail-Domains oder so. So, und, oder er muss den, er muss"}, {"id": 181, "start": 1248.56, "end": 1252.2, "text": "bei dem, er muss für die Java-Anwendungszeuge muss irgendwie den Zertifikat-Store updaten"}, {"id": 182, "start": 1252.2, "end": 1257.84, "text": "oder sowas. Okay, ähm, dann macht er sich den Branch auf, vom Master hier, macht da"}, {"id": 183, "start": 1257.84, "end": 1262.92, "text": "seine Commits drin und macht ein Pull-Request auf, zurück auf Master. So, jemand anderes"}, {"id": 184, "start": 1262.92, "end": 1269.16, "text": "macht parallel auch was und, äh, entwickelt sagen wir jetzt an, an irgendeinem anderen"}, {"id": 185, "start": 1269.16, "end": 1273.28, "text": "Feature ist egal was. So, und da können die hier parallel entwickeln und beide machen"}, {"id": 186, "start": 1273.28, "end": 1276.8, "text": "ein Merge-Request auf, wenn's so weit ist. Der macht den hier auf, der macht den hier"}, {"id": 187, "start": 1276.8, "end": 1282.0, "text": "auf und das ist dann die Stelle, wo ich mir das angucke, was die gemacht haben. Und das"}, {"id": 188, "start": 1282.0, "end": 1291.92, "text": "passt meistens und es kommt halt nur zu Merge-Konflikten, wenn der und der parallel in den gleichen"}, {"id": 189, "start": 1291.92, "end": 1300.28, "text": "Files rumwurstet. Und das ist recht selten, weil die meisten Leute ihre Aufgabenfelder"}, {"id": 190, "start": 1300.28, "end": 1307.52, "text": "haben. Das kommt nicht so oft vor, kommt vor bei Basic-Geschichten wie SSL-Zertifikaten,"}, {"id": 191, "start": 1307.52, "end": 1313.16, "text": "zum Beispiel im Zertifikat-Store, da kommt das öfters vor, weil da viele Leute mal dran"}, {"id": 192, "start": 1313.16, "end": 1317.8, "text": "rumwursten. Ja gut, wenn's den Merge-Konflikt gibt, da siehst du den Pull-Request schon."}, {"id": 193, "start": 1317.8, "end": 1324.52, "text": "Das Beste ist, die Leute lösen das selbst, indem sie das rebasen auf Master vorher und"}, {"id": 194, "start": 1324.52, "end": 1329.88, "text": "den Merge-Konflikt selbst lösen. Oder aber, wenn das nicht geht, dann nehm ich den da,"}, {"id": 195, "start": 1329.88, "end": 1339.76, "text": "und mich und wir überlegen uns zusammen, wie die Änderung am Ende aussehen muss. Nicht"}, {"id": 196, "start": 1339.76, "end": 1345.0, "text": "nur gleiche Files, sondern sogar gleiche Zeilen. Ja, richtig. Gleiche Files allein ist Git"}, {"id": 197, "start": 1345.0, "end": 1349.12, "text": "teilweise recht clever, aber da muss man auch drauf achten, Git macht da manchmal, zwar"}, {"id": 198, "start": 1349.12, "end": 1352.84, "text": "nicht oft, aber manchmal komische Dinger, wenn es die gleiche Datei parallel ändert."}, {"id": 199, "start": 1352.84, "end": 1363.12, "text": "An unterschiedlichen Stellen. Wo der Unterschied ist, dass die noch einen Develop-Branch haben,"}, {"id": 200, "start": 1363.12, "end": 1370.64, "text": "wo sie was drauf machen, und hier wird alles auf Master gemacht. So, und das ist eigentlich"}, {"id": 201, "start": 1370.64, "end": 1375.6, "text": "kein großes Ding mit Merge-Konflikten, muss man ehrlich sagen. Das lässt sich recht"}, {"id": 202, "start": 1375.6, "end": 1381.08, "text": "easy handeln. Es gibt nicht viele, aber wenn's welche gibt, gibt's halt welche, die sind"}, {"id": 203, "start": 1381.08, "end": 1389.36, "text": "teilweise echt eklig, aber 80% der Merge-Requests, oder ne, 80% der Konflikte, die wir haben,"}, {"id": 204, "start": 1389.36, "end": 1394.44, "text": "sind wirklich kein großes Ding. Das kriegt man mit den beteiligten Leuten relativ gut"}, {"id": 205, "start": 1394.44, "end": 1398.52, "text": "hin. Bei SSL-Zertifikaten ist es auch einfach, da brauchst du in der Regel einfach beides,"}, {"id": 206, "start": 1398.52, "end": 1406.24, "text": "es ist nur parallel entstanden. Na gut. Und im gleichen Atemzug, wie hier der Pull-Request"}, {"id": 207, "start": 1406.24, "end": 1411.92, "text": "ist, wird dann auch ein bisschen Infos dazu gesammelt, sprich, was genau macht das, wie"}, {"id": 208, "start": 1411.92, "end": 1419.12, "text": "verkauft man das am besten, und wir schreiben das in unser Change-Log für die nächste Version,"}, {"id": 209, "start": 1419.12, "end": 1422.08, "text": "und dann sind die Leute, die entwickeln, eigentlich fertig. Da müssen die sich nicht"}, {"id": 210, "start": 1422.08, "end": 1427.56, "text": "mehr weiter drum kümmern. Das nächste mach ich, dann mach ich so ungefähr sowas wie"}, {"id": 211, "start": 1427.56, "end": 1433.12, "text": "das hier, mach ich dann, ich mach nen Tag drauf irgendwann mal auf Master. Also man taggt"}, {"id": 212, "start": 1433.12, "end": 1437.12, "text": "ja am Master nicht, mein Tag ist ja ne Zeige auf nen Commit, hat mit Branches überhaupt"}, {"id": 213, "start": 1437.12, "end": 1441.68, "text": "nix zu tun, aber zu dem Zeitpunkt bin ich im Master, sag ok, keine Ahnung, an der Stelle"}, {"id": 214, "start": 1441.68, "end": 1446.64, "text": "hier jetzt, jetzt ist es laut Kalender wieder soweit, da mach ich nen Tag drauf auf diesen"}, {"id": 215, "start": 1446.64, "end": 1459.88, "text": "Commit hier, und dann kommt der Commit dahin. Das muss man machen, mit dem Tag, erstens"}, {"id": 216, "start": 1459.88, "end": 1466.52, "text": "weil es besser nachvollziehbar ist, und weil man sich sicher sein will, dass wenn man"}, {"id": 217, "start": 1466.52, "end": 1470.56, "text": "Hotfixes macht, wenn es nur so einfach ist wie hier, ist das kein Ding, aber bei uns"}, {"id": 218, "start": 1470.56, "end": 1478.2, "text": "ist es noch ein bisschen komplizierter, dass man sicher ist, man bekommt nicht zwischendurch"}, {"id": 219, "start": 1478.2, "end": 1481.16, "text": "irgendwelche Commits mit rein, die man gar nicht haben will. Zum Beispiel, was ich auch"}, {"id": 220, "start": 1481.16, "end": 1485.72, "text": "schon gelesen hab, was einige Leute verkehrt machen, so hat die Motto, die taggen das hier,"}, {"id": 221, "start": 1485.72, "end": 1491.16, "text": "das hier ist Tag 1, da machen sie hier weiter und sagen, das hier ist jetzt, oh fuck, bei"}, {"id": 222, "start": 1491.16, "end": 1495.04, "text": "Version 1 ist was kaputt, wir brauchen jetzt nen Fix, und dann sagen, taggen sie das hier"}, {"id": 223, "start": 1495.04, "end": 1499.72, "text": "als Version 1.1, das ist aber Fail, weil in der Zwischenzeit sind die ganzen Änderungen"}, {"id": 224, "start": 1499.72, "end": 1507.12, "text": "dabei, das heißt, Version 1.1 wäre dann nicht Version 1 plus nen Fix, gleich Version 1.1,"}, {"id": 225, "start": 1507.12, "end": 1517.16, "text": "sondern eigentlich wäre das hier unten dann Version 2 fast schon, also das geht so nicht,"}, {"id": 226, "start": 1517.16, "end": 1521.0, "text": "deswegen muss man das taggen, und wenn man dann was fixen will, dann macht man das mehr"}, {"id": 227, "start": 1521.0, "end": 1529.48, "text": "oder weniger so, ich nehm mir das aktuelle Tag, check das aus, cherrypick den Hotfix"}, {"id": 228, "start": 1529.48, "end": 1533.92, "text": "Commit, deswegen leg ich auch immer Wert darauf, dass Hotfixes möglichst klein sind, nach Möglichkeit"}, {"id": 229, "start": 1533.92, "end": 1538.36, "text": "auch nur ein Commit, weil da lässt sich das einfacher cherrypicken, dann check ich den"}, {"id": 230, "start": 1538.36, "end": 1544.16, "text": "Tag aus, mach den Cherrypick von dem jeweiligen Hotfix Commit, und dann mach ich den neuen"}, {"id": 231, "start": 1544.16, "end": 1553.84, "text": "Tag drauf, und dann hast du nur die alte Version plus den einen Fix, und dann ist gut, wo man"}, {"id": 232, "start": 1553.84, "end": 1557.16, "text": "dann natürlich darauf achten muss, ist, dass wenn man Hotfix kriegt, dass der natürlich"}, {"id": 233, "start": 1557.16, "end": 1561.76, "text": "auch in Master kommt, weil sonst sehen den die anderen Leute nicht, so machen wir das,"}, {"id": 234, "start": 1561.76, "end": 1565.96, "text": "wir machen das ziemlich klassisch, so jetzt mal auf die anderen Sachen einzugehen, die"}, {"id": 235, "start": 1565.96, "end": 1574.2, "text": "noch gekommen ist, kann man einen Pullrequest direkt auf einen Tag merchen, eh theoretisch"}, {"id": 236, "start": 1574.2, "end": 1581.76, "text": "schon ja, ich weiß nicht ob das GitHub, Bitbucket oder sonst was unterstützt, Git technisch"}, {"id": 237, "start": 1581.76, "end": 1588.32, "text": "ist das kein Problem, Git technisch geht das, also du kannst den Tag auschecken, kannst"}, {"id": 238, "start": 1588.32, "end": 1593.96, "text": "dort einen Branch reinmerchen in diesen Stand, und danach einen neuen Tag draufsetzen, das"}, {"id": 239, "start": 1593.96, "end": 1600.12, "text": "geht, das will man aber in der Regel nicht machen, weil dann hast du das Problem, die"}, {"id": 240, "start": 1600.12, "end": 1604.16, "text": "Leute die sich das vom Master auschecken, stellt euch mal vor, das hier ist die aktuelle"}, {"id": 241, "start": 1604.16, "end": 1611.12, "text": "Version, irgendeiner checkt sich einen Branch aus vom Master und sagt dann ja, ich möchte"}, {"id": 242, "start": 1611.12, "end": 1614.76, "text": "den jetzt da rein, dann bringt der ja alle anderen Änderungen, die in der Zwischenzeit"}, {"id": 243, "start": 1614.76, "end": 1620.16, "text": "zur nächsten Version passiert sind mit, das will man ja nicht, also deswegen macht man"}, {"id": 244, "start": 1620.16, "end": 1626.56, "text": "das eigentlich anders, wenn man einen Hotfix hat für die aktuelle Version, dann nehmen"}, {"id": 245, "start": 1626.56, "end": 1633.32, "text": "sich die Leute für ihren Hotfix Branch als Grundlage den aktuellen Tag, oder wenn es"}, {"id": 246, "start": 1633.32, "end": 1636.76, "text": "was ganz kleines ist und sie das für Master eh schon gefixt haben, nimmst du einfach"}, {"id": 247, "start": 1636.76, "end": 1644.92, "text": "das Comet und Cherrypicks rein und hoffst, dass es funktioniert, was meistens klappt,"}, {"id": 248, "start": 1644.92, "end": 1649.36, "text": "aber wenn es was ein bisschen umfangreicheres ist, musst du als Grundlage für den Hotfix"}, {"id": 249, "start": 1649.36, "end": 1656.64, "text": "Branch den aktuellen Live Produktions Tag nehmen, weil sonst bringst du aus dem Master"}, {"id": 250, "start": 1656.64, "end": 1661.0, "text": "die halbe nächste Version mit, wenn du das mercht, das willst du ja nicht, deswegen wird"}, {"id": 251, "start": 1661.0, "end": 1667.16, "text": "da auch nichts gemercht, sondern so gut wie immer rein Cherrypicked, was besonders gut"}, {"id": 252, "start": 1667.16, "end": 1672.96, "text": "ist, wenn man halt nur ein, zwei Comets hat."}, {"id": 253, "start": 1672.96, "end": 1675.64, "text": "Cherrypicks sind für mich immer noch Kid Magic, da ist eigentlich relativ wenig Magic"}, {"id": 254, "start": 1675.64, "end": 1676.64, "text": "dabei."}, {"id": 255, "start": 1676.64, "end": 1682.88, "text": "Sollte man nicht eh pro Release einen Branch sich gönnen, nö, also kann man, wenn man"}, {"id": 256, "start": 1682.88, "end": 1688.64, "text": "mehrere Releases parallel supporten will, haben wir auch, wir haben da eigene Namen"}, {"id": 257, "start": 1688.64, "end": 1696.24, "text": "für, aber im Endeffekt haben wir nen Testing Branch und nen Live Branch noch zusätzlich"}, {"id": 258, "start": 1696.24, "end": 1704.92, "text": "aus dem Grund, weil es manchmal vorkommt, dass spezielle Änderungen nur für die Testversion"}, {"id": 259, "start": 1704.92, "end": 1709.04, "text": "gemacht werden, um zu erproben, ob irgendwas funktioniert."}, {"id": 260, "start": 1709.04, "end": 1719.52, "text": "Das sind dann auch Comets, die nicht Bestandteil im aktuellen Release sind, die werden dann"}, {"id": 261, "start": 1719.52, "end": 1727.2, "text": "quasi zusätzlich noch obendrauf in den aktuellen Testing Branch Cherrypicked, weil die dürfen"}, {"id": 262, "start": 1727.2, "end": 1731.44, "text": "ja nicht ins Release, sonst kommen ja irgendwelche Testing Features live, das möchte man ja"}, {"id": 263, "start": 1731.44, "end": 1732.44, "text": "nicht unbedingt."}, {"id": 264, "start": 1732.44, "end": 1736.96, "text": "Ja, aber ansonsten machen wir nicht pro Release einen Branch."}, {"id": 265, "start": 1736.96, "end": 1741.68, "text": "Der Colonel macht's, der Colonel hat so nen Old Stable und Older Stable und so komische"}, {"id": 266, "start": 1741.68, "end": 1745.72, "text": "Dinger noch, das haben wir nicht, und eigentlich braucht man das auch nicht."}, {"id": 267, "start": 1745.72, "end": 1750.68, "text": "Also wir haben nen Master Branch, wir haben nen Testing Branch, so die Kurzvariante ist"}, {"id": 268, "start": 1750.68, "end": 1754.64, "text": "das jetzt, und wir haben nen Live Branch, die drei Sachen haben wir, dann gibt's noch"}, {"id": 269, "start": 1754.64, "end": 1758.4, "text": "hunderttausende Feature Branches von den Leuten, die Sachen entwickeln, aber das"}, {"id": 270, "start": 1758.4, "end": 1759.4, "text": "war's."}, {"id": 271, "start": 1759.4, "end": 1765.96, "text": "So, und Hotfixen, wie gesagt, von dem jeweiligen Tag, per Cherrypick zurück, und du hast ja"}, {"id": 272, "start": 1765.96, "end": 1769.92, "text": "das Tag auf das Comet, also du brauchst ja keinen Branch für das aktuelle Release noch"}, {"id": 273, "start": 1769.92, "end": 1770.92, "text": "zusätzlich."}, {"id": 274, "start": 1770.92, "end": 1777.56, "text": "Wir haben nen Live Branch und dort kommt immer das aktuelle Release rein, wenn's soweit"}, {"id": 275, "start": 1777.56, "end": 1778.56, "text": "ist."}, {"id": 276, "start": 1778.56, "end": 1787.16, "text": "Was ich ab und zu mal mache ist, dass ich die einmal im Jahr lösche und nochmal neu"}, {"id": 277, "start": 1787.16, "end": 1788.16, "text": "aufmache."}, {"id": 278, "start": 1788.16, "end": 1791.04, "text": "So, aber ansonsten brauchen wir das, brauchen wir das nicht."}, {"id": 279, "start": 1791.04, "end": 1798.12, "text": "Wieso streamst du eigentlich in 48Hz, ist bei deinen YouTube Videos auch so, also Stream"}, {"id": 280, "start": 1798.12, "end": 1803.92, "text": "in 48Hz mach ich, damit es besser aussieht und weniger Bandbreite als 60Hz braucht."}, {"id": 281, "start": 1803.92, "end": 1813.44, "text": "Also es sieht besser aus als 30FPS, und es braucht weniger Bandbreite als 60, ist eigentlich"}, {"id": 282, "start": 1813.44, "end": 1817.8, "text": "die Big Brain Lösung, 48FPS Stream."}, {"id": 283, "start": 1817.8, "end": 1822.08, "text": "Wie oft habt ihr einen neuen Master-Comet pro Tag?"}, {"id": 284, "start": 1822.08, "end": 1832.0, "text": "Boah, ganz schön viel, ähm, Tag ist einfach nur einem Comet einen Namen geben, korrekt,"}, {"id": 285, "start": 1832.0, "end": 1837.36, "text": "das ist, denn Tag ist, dass du's einfacher wieder findest, das Comet, du könntest ja"}, {"id": 286, "start": 1837.36, "end": 1842.44, "text": "auch selbst ne Tabelle machen mit Comets, aber wozu, wenn's Tags gibt, wie oft habt"}, {"id": 287, "start": 1842.44, "end": 1856.64, "text": "ihr also, was haben wir denn so, 20, 20 Comets am Tag oder so, im Durchschnitt, na, wobei"}, {"id": 288, "start": 1856.64, "end": 1862.28, "text": "das kommt, manchmal ist es deutlich mehr, manchmal ist es auch weniger, ich sag mal so"}, {"id": 289, "start": 1862.28, "end": 1881.24, "text": "im Durchschnitt 20 Comets am Tag, ungefähr so, würd ich sagen."}, {"id": 290, "start": 1881.24, "end": 1885.04, "text": "Also was ich bei Merch-Konflikten immer ganz gern verwendet hab, ist VimDiv, aber da bin"}, {"id": 291, "start": 1885.04, "end": 1889.72, "text": "ich mittlerweile auch von weggekommen, so ich mach das, ich mach's komplett von Hand über"}, {"id": 292, "start": 1889.72, "end": 1894.88, "text": "den Editor, wenn man sich da dran gewöhnt hat, ist gar nicht schlecht, am besten ist,"}, {"id": 293, "start": 1894.88, "end": 1900.68, "text": "wenn man, ähm, nen Editor mit Git-Plaim-Support hat, dass man sich direkt anzeigen lassen"}, {"id": 294, "start": 1900.68, "end": 1904.4, "text": "kann, wer von wem welche Änderungen sind, aber ansonsten sind Merch-Konflikte, finde"}, {"id": 295, "start": 1904.4, "end": 1905.88, "text": "ich, am einfachsten von Hand gelöst."}, {"id": 296, "start": 1905.88, "end": 1914.32, "text": "Äh, du machst, doch, doch, mach ich auch, allerdings jetzt nicht so ultratief, ich guck"}, {"id": 297, "start": 1914.32, "end": 1918.88, "text": "mir an, ob's da, äh, irgendwelche Verschreiber gibt oder ob da offensichtlich Mist drin"}, {"id": 298, "start": 1918.88, "end": 1919.88, "text": "ist."}, {"id": 299, "start": 1919.88, "end": 1925.28, "text": "Letztens hat einer nen, nen Python-Monitoring, äh, Change gemacht, also für, für die,"}, {"id": 300, "start": 1925.28, "end": 1929.52, "text": "für unser Prometheus-Monitoring in nem Python-Skript geupdatet, da hab ich gleich gesehen,"}, {"id": 301, "start": 1929.52, "end": 1933.44, "text": "die Eindrückungen stimmten nicht, sowas seh ich schon, im Detail kann ich's meistens"}, {"id": 302, "start": 1933.44, "end": 1935.96, "text": "gar nicht genau beurteilen, ob das stimmt, ja."}, {"id": 303, "start": 1935.96, "end": 1942.16, "text": "Wenn da jetzt irgendwie einer sagt, ok, der Logik nach muss das kleiner 5 sein und es"}, {"id": 304, "start": 1942.16, "end": 1946.16, "text": "stimmt nicht, dann glaub ich ihm das trotzdem, aber das, keine Ahnung, ob das stimmt, also"}, {"id": 305, "start": 1946.16, "end": 1949.12, "text": "so sehr kenn ich mich damit nicht aus."}, {"id": 306, "start": 1949.12, "end": 1955.2, "text": "Äh, wie viele Feature-Branches kann man denn haben oder was ist die Regel, äh, unbegrenzt"}, {"id": 307, "start": 1955.2, "end": 1959.28, "text": "viele, Git juckt das überhaupt nicht, wie viele Branches man hat, Git wird auch nicht"}, {"id": 308, "start": 1959.28, "end": 1960.28, "text": "langsam durch."}, {"id": 309, "start": 1960.28, "end": 1966.0, "text": "Also wir haben Leute, die haben glaub ich schon 5 Jahre oder so nix mal aufgeräumt,"}, {"id": 310, "start": 1966.0, "end": 1971.2, "text": "die haben 350 offene Branches, ich hab mir mal überlegt, ob ich was basteln soll, was"}, {"id": 311, "start": 1971.2, "end": 1982.24, "text": "die Leute benachrichtigt, aber wozu, juckt nicht, kannst so viel haben, wie du willst."}, {"id": 312, "start": 1982.24, "end": 1986.84, "text": "Ähm, die Eindrückung, ja, das ist typische First World-Python-Problems, reicht da eine"}, {"id": 313, "start": 1986.84, "end": 1990.68, "text": "Proof oder müssen das mehrere Leute erst bestätigen, das müssen mehrere Leute bestätigen"}, {"id": 314, "start": 1990.68, "end": 1996.2, "text": "oder, ich weiß, klingt jetzt, klingt jetzt vielleicht sogar schon ein bisschen überheblich"}, {"id": 315, "start": 1996.2, "end": 2004.76, "text": "oder ich, das reicht meistens auch, ähm, also wir haben es so gemacht, dass wenn es"}, {"id": 316, "start": 2004.76, "end": 2009.28, "text": "ein Thema ist, wo es noch ein paar andere Leute gibt, die sich auskennen, zum Beispiel"}, {"id": 317, "start": 2009.28, "end": 2021.4, "text": "haben wir einen Repo, da sind alle unsere DNS-Config drinne und wenn dort einer DNS-Changes-Committed"}, {"id": 318, "start": 2021.4, "end": 2027.04, "text": "einreicht, dann haben wir es so gemacht, dass quasi, bevor ich drauf gucke, noch mal einer"}, {"id": 319, "start": 2027.04, "end": 2033.4, "text": "drauf guckt, der auch aus dem gleichen Team ist und erst wenn noch ein fachlicher Kenner"}, {"id": 320, "start": 2033.4, "end": 2037.96, "text": "es approved hat, approve ich es auch, aber die meisten Sachen, wenn ich sie mir angeguckt"}, {"id": 321, "start": 2037.96, "end": 2044.76, "text": "hab und approve, äh, dann juckt das kein mehr, sondern wir nehmen es direkt, auch weil"}, {"id": 322, "start": 2044.76, "end": 2051.36, "text": "es vielleicht nicht hundertprozentig richtig ist, aber das meiste wird nicht so arg reviewed,"}, {"id": 323, "start": 2051.36, "end": 2057.68, "text": "wie es vielleicht sollte. Wie groß sind denn die ganzen Repos zusammen? Boah, also unser"}, {"id": 324, "start": 2057.68, "end": 2063.16, "text": "altes, wir hatten mal ein altes Repo, wo wir alles in einem Repo gemacht haben, wirklich"}, {"id": 325, "start": 2063.16, "end": 2073.32, "text": "alles, sogar RPM-Pakete, da waren wir aber noch big, big noob, ja, ähm, und da haben"}, {"id": 326, "start": 2073.32, "end": 2078.76, "text": "wir teilweise Target-Sets und RPMs in das Git-Repo-Committed und das war am Ende, glaube"}, {"id": 327, "start": 2078.76, "end": 2083.96, "text": "ich, acht Gigabyte oder so. Wenn du das geklont hast, neu, hast du erst mal ein halben Tag"}, {"id": 328, "start": 2083.96, "end": 2089.24, "text": "Gefühl dargesessen. Also das war das alte Repo, das war richtig bepega, bebega war das."}, {"id": 329, "start": 2089.24, "end": 2095.28, "text": "Das haben wir dann aber nach einem Jahr oder so gecheckt, dass das keine gute Idee ist,"}, {"id": 330, "start": 2095.28, "end": 2099.68, "text": "jetzt haben wir ein bisschen mehr Repos und wir checken auch keine großen Binaries mehr"}, {"id": 331, "start": 2099.68, "end": 2105.48, "text": "drin, aber man lernt ja, man lernt ja. Also unser aktuelles Repo ist, glaube ich, so,"}, {"id": 332, "start": 2105.48, "end": 2111.16, "text": "was wird denn das sein, so das Haupt-Repo, wo das meiste drin ist, wird so 250 MB sein."}, {"id": 333, "start": 2111.16, "end": 2116.64, "text": "So in dem Dreh würde ich jetzt mal, würde ich mal sagen, das allermeiste sind Text-Files,"}, {"id": 334, "start": 2116.64, "end": 2121.8, "text": "die nehmen nichts weg. Es sind ein paar ganz kleine Go-Binaries drin, die sind aber vielleicht,"}, {"id": 335, "start": 2121.8, "end": 2128.56, "text": "wenn es hochkommt, wenn es hochkommt, dann MB pro Binary, weil das Sachen sind die immer"}, {"id": 336, "start": 2128.56, "end": 2137.24, "text": "tagtäglich da im Handling und auch so brauche. So und ich sag mal 200, 250 MB, ich weiß"}, {"id": 337, "start": 2137.24, "end": 2141.32, "text": "es ehrlich gesagt gar nicht genau. Ich hab unser Repo ewig, also wirklich ewig nicht"}, {"id": 338, "start": 2141.32, "end": 2149.04, "text": "mehr geklont. Wozu auch? Ich hab das ja eh permanent aktuell. Da wird, wieso? Stört"}, {"id": 339, "start": 2149.04, "end": 2152.48, "text": "das, siehst du doch überhaupt nichts. Achso ja, damit es nicht, damit es nicht stört,"}, {"id": 340, "start": 2152.48, "end": 2158.56, "text": "haben wir folgendes gemacht, das ist auch eine Sache, die ich empfehlen kann, wenn man"}, {"id": 341, "start": 2158.56, "end": 2164.52, "text": "entweder Git managen bzw. vielleicht selbst besseren Überblick behalten will, macht"}, {"id": 342, "start": 2164.52, "end": 2171.64, "text": "Namespaces davor oder Gruppierungen. Also in Git kann man z.B. machen, dass man einen"}, {"id": 343, "start": 2171.64, "end": 2183.24, "text": "Branch nennt, so nach dem Motto, dass man Git einen Branch macht, der max slash neues"}, {"id": 344, "start": 2183.24, "end": 2190.88, "text": "Feature heißt. Das ist ganz praktisch, weil alle Branches ohne Namespace davor sind meine,"}, {"id": 345, "start": 2190.88, "end": 2198.76, "text": "also zum verwalten der ganze Geschichte, also sprich Master hat keinen Namespace davor,"}, {"id": 346, "start": 2198.76, "end": 2205.92, "text": "also Testing und Live haben auch keinen Namespace davor, sprich da, das sind meine, da hab"}, {"id": 347, "start": 2205.92, "end": 2210.64, "text": "auch ich Rechte drauf, aber andere können dann irgendwie, der Felix hat nen Branch,"}, {"id": 348, "start": 2210.64, "end": 2217.88, "text": "das heißt dann irgendwie Omega, Lul und sonst was. Das heißt alle Branches mit Namespace"}, {"id": 349, "start": 2217.88, "end": 2223.12, "text": "davor sind Feature Branches, da kann man das recht gut erkennen. Das wird auch von Git"}, {"id": 350, "start": 2223.12, "end": 2229.28, "text": "von Haus aus unterstützt, das ist eigentlich ne ziemlich gute Sache, das so zu kopieren."}, {"id": 351, "start": 2229.28, "end": 2237.76, "text": "Kann man erkennen, von welchem Branch ein Branch abstammt? Ja und nein, du kannst erkennen,"}, {"id": 352, "start": 2237.76, "end": 2244.16, "text": "von welchem Commit der Branch abstammt. Von welchem Branch ein Branch abstammt, gibt"}, {"id": 353, "start": 2244.16, "end": 2250.44, "text": "es nicht, weil sowohl Text als auch Branches gibt es ja streng genommen in Git so, in"}, {"id": 354, "start": 2250.44, "end": 2256.8, "text": "der History gar nicht. Also du hast Commits, du hast quasi ne Reihe von Commits, die aufeinander"}, {"id": 355, "start": 2256.8, "end": 2261.88, "text": "basieren und in Tag ist ein Zeiger, nen Namen geben für nen Commit und ein Branch ist halt"}, {"id": 356, "start": 2261.88, "end": 2267.92, "text": "nen Namen für nen Commit, wo man weitere Commits drauf machen kann. Also wichtig ist,"}, {"id": 357, "start": 2267.92, "end": 2276.88, "text": "von welchem Commit man das aufmacht. Also sprich, wenn ich drei Branches habe, oder sag mal,"}, {"id": 358, "start": 2276.88, "end": 2283.24, "text": "ich hab ne Master Branch und mach davon drei Branches auf, so und A, B, C und du machst"}, {"id": 359, "start": 2283.24, "end": 2288.16, "text": "von C deinen Branch auf, dann kann ich nicht erkennen, ob du ihn von A, B oder C aufgemacht"}, {"id": 360, "start": 2288.16, "end": 2293.64, "text": "hast. Das weiß ich nicht, ich weiß nur, dass du ihn aufgemacht hast zum Stand von Commit"}, {"id": 361, "start": 2293.64, "end": 2298.2, "text": "X, Y. Also ich kann nicht erkennen, ob du ihn von Master aufgemacht hast, von A, von"}, {"id": 362, "start": 2298.2, "end": 2311.04, "text": "B, von C. Ja, so ungefähr machen wir es auch. So ähnlich machen wir es auch. Einziger Unterschied"}, {"id": 363, "start": 2311.04, "end": 2318.6, "text": "ist, wir machen Underscore, weil wir manche Branches als Puppet-Environment verwenden"}, {"id": 364, "start": 2318.6, "end": 2325.16, "text": "zum Dingertest. Ja, da liegt auch Puppet-Config drin, jede Menge. Also das ist ein bisschen"}, {"id": 365, "start": 2325.16, "end": 2331.6, "text": "umfangreich, da ist das Main-Repo, da ist ganz viel Puppet-Config drin. Und Puppet mag"}, {"id": 366, "start": 2331.6, "end": 2338.8, "text": "Minus in Environment haben nicht, deswegen ist es bei uns in Underscore. Ja, so sieht"}, {"id": 367, "start": 2338.8, "end": 2351.4, "text": "das aus. Puppet ist echt ein Krampf, ja das stimmt. Aber wir verwenden Puppet schon ewig."}, {"id": 368, "start": 2351.4, "end": 2358.6, "text": "Wir haben ja auch einen riesen Puppet-Code-Base. Als Erklärung, Puppet ist ein Tool, dem gibst"}, {"id": 369, "start": 2358.6, "end": 2366.84, "text": "du das. Das ist noch vor der Zeit, aber mittlerweile nennt sich sowas ja Infrastructure as Code."}, {"id": 370, "start": 2366.84, "end": 2376.84, "text": "Nee, Code als Infrastructure as Code, ja, Baswords. Also sprich, man beschreibt, wie"}, {"id": 371, "start": 2376.84, "end": 2383.0, "text": "ein System aufgebaut werden soll und hat nen Config-Programm, das lässt man laufen, nen"}, {"id": 372, "start": 2383.0, "end": 2391.56, "text": "Config-Management-Programm und das baut aus der Meta-Config quasi die Config aus zusammen,"}, {"id": 373, "start": 2391.56, "end": 2395.96, "text": "wie sie dann am Ende auf einem Server hinten rauskommt. So musst du zum Beispiel, wenn"}, {"id": 374, "start": 2395.96, "end": 2402.68, "text": "du 50 Server aufbauen willst, die sich alle bis nur im Namen unterscheiden, so kannst"}, {"id": 375, "start": 2402.68, "end": 2409.04, "text": "du quasi eine Puppet-Config machen, die du dann quasi applies auf 50 Server anstatt"}, {"id": 376, "start": 2409.04, "end": 2413.8, "text": "dass du 50 Server einrichten musst, so weit von der Theorie her. Puppet ist doch Ruby-Kacke,"}, {"id": 377, "start": 2413.8, "end": 2419.28, "text": "ja aber Ruby ist doch gut und es ist nicht Docker für Arme, es war ganz was anderes."}, {"id": 378, "start": 2419.28, "end": 2434.48, "text": "Ach guck mal, hier, er weiß wovon ich rede. Ich verwende, ach so, also ich verwende Privat"}, {"id": 379, "start": 2434.48, "end": 2438.88, "text": "vmware, auf der Arbeit haben wir jede Menge Sachen, also wir haben zum größten Teil"}, {"id": 380, "start": 2438.88, "end": 2443.72, "text": "vmware, das glaube ich kein Geheimnis, das haben die meisten im Enterprise-Umfeld, wir"}, {"id": 381, "start": 2443.72, "end": 2448.6, "text": "haben allerdings mittlerweile auch jede Menge Container und solche Sachen und auch Dinger"}, {"id": 382, "start": 2448.6, "end": 2455.44, "text": "in Azure und in der Cloud und ganz tolle Dinger. Aber zum größten Teil vmware und"}, {"id": 383, "start": 2455.44, "end": 2459.64, "text": "die meisten Business-Enterprise-Geschichten, die du so antreffen wirst, die haben auch"}, {"id": 384, "start": 2459.64, "end": 2466.24, "text": "vmware. Vmware ist in dem Umfeld einfach das etablierteste, was es gibt. Wir haben auch"}, {"id": 385, "start": 2466.24, "end": 2472.08, "text": "witzigerweise ein paar KVM-Kisten, habe ich letztens gelernt. Wusste ich bis vorgestern"}, {"id": 386, "start": 2472.08, "end": 2475.48, "text": "auch nicht, dass wir KVM haben. Boah, das ist viel zu kräll, da wirst du ja blind von."}, {"id": 387, "start": 2475.48, "end": 2489.96, "text": "Ne, ne, ne, wir haben die wieder. Wir haben wieder KVM. Hab ich heute gelernt, ja. Im Kubernetes-Umfeld"}, {"id": 388, "start": 2489.96, "end": 2494.92, "text": "haben wir irgendwie KVM noch. Wusste ich bis vorgestern auch nicht, dass wir sowas haben."}, {"id": 389, "start": 2494.92, "end": 2505.52, "text": "Genau, so sieht das aus. Also das ist bei uns so die Geschichte. Und wie gesagt, Puppet"}, {"id": 390, "start": 2505.52, "end": 2520.76, "text": "ist an sich ganz gut. Es ist halt ein bisschen bloated mittlerweile bei uns. Okay, ich glaube,"}, {"id": 391, "start": 2520.76, "end": 2529.16, "text": "jetzt haben wir das alles. Kann man eigentlich Docker in Windows Home in vmware Ubuntu benutzen?"}, {"id": 392, "start": 2529.16, "end": 2536.96, "text": "Klar. Wenn du dir eine Linux VM installierst, kannst du da drin alles funktionieren. Alles"}, {"id": 393, "start": 2536.96, "end": 2546.52, "text": "verwenden, was du verwenden willst. Was ist denn Windows Home? Was ist denn Windows Home?"}, {"id": 394, "start": 2546.52, "end": 2555.92, "text": "Ach, Home, das ist die Home und Professional. Ja, ja. Lul. Monarch S. Klar, in Virtualbox"}, {"id": 395, "start": 2555.92, "end": 2562.04, "text": "geht das auch. Natürlich funktioniert das. Virtualbox und vmware, das ist beides voll"}, {"id": 396, "start": 2562.04, "end": 2567.56, "text": "Virtualisierung. Das System, was da drin läuft, hat keine Ahnung, dass es in der, also realistisch"}, {"id": 397, "start": 2567.56, "end": 2573.04, "text": "betrachtet weiß es natürlich, dass es in der VM läuft. Aber reine Lehre mäßig hat es"}, {"id": 398, "start": 2573.04, "end": 2577.92, "text": "keine Ahnung, dass es in der VM läuft. Also sprich, du kannst in der Linux VM, die du"}, {"id": 399, "start": 2577.92, "end": 2582.04, "text": "voll virtualisiert laufen hast, alles machen, was du willst, sofern es die Hardware hergibt."}, {"id": 400, "start": 2582.04, "end": 2588.2, "text": "Du hast keine Beschränkung. Also du kannst es sowohl in Virtualbox machen, du kannst"}, {"id": 401, "start": 2588.2, "end": 2594.96, "text": "es auch in vmware Workstation machen, du kannst es in Parallels machen unter Mac und Fusion"}, {"id": 402, "start": 2594.96, "end": 2599.84, "text": "unter Mac. Du kannst es in KVM machen, vollkommen egal. Also voll virtualisiert kannst du alles"}, {"id": 403, "start": 2599.84, "end": 2606.04, "text": "machen, was die Hardware hergibt. Wie gesagt, sowas wie Spiele ohne GPU pass-through, was"}, {"id": 404, "start": 2606.04, "end": 2610.68, "text": "ja nicht funktioniert mit vmware Workstation, Desktop, Windows, gibt halt die Hardware dann"}, {"id": 405, "start": 2610.68, "end": 2626.72, "text": "nicht her. Aber hey, für SuperTuxCard reicht es immer noch. Geh weg. Also ich mein, wenn"}, {"id": 406, "start": 2626.72, "end": 2633.36, "text": "SuperTuxCard geht, dann geht alles andere auch. Da sind wir uns ja einig. Ok, was war"}, {"id": 407, "start": 2633.36, "end": 2639.0, "text": "denn jetzt eigentlich mit Google und Deutscher Bank, was ich angeblich wissen müsste hier?"}, {"id": 408, "start": 2639.0, "end": 2647.68, "text": "Google hilft Deutscher Bank, ok. End of Function Zero, ja das funktioniert auch mehr schlecht"}, {"id": 409, "start": 2647.68, "end": 2654.8, "text": "als recht. Aber Docker bzw. ne, was wolltest du verwenden? Docker ist keine nested Virtualisierung."}, {"id": 410, "start": 2654.8, "end": 2663.52, "text": "Ich find's immer noch blöd, dass das ganze Zeug Container heißt, muss ich ehrlich sagen."}, {"id": 411, "start": 2663.52, "end": 2671.46, "text": "Container klingt nach vm, ist es aber nicht. Den Container gibt es auf Linux-Ebene eigentlich"}, {"id": 412, "start": 2671.46, "end": 2677.68, "text": "gar nicht. Man nennt das nur Container. Also sprich, ein Prozess, den du startest auf"}, {"id": 413, "start": 2677.68, "end": 2684.84, "text": "deinem Linux-System, wenn du jetzt einfach ne Bash startest oder so, ist da erst mal fundamental"}, {"id": 414, "start": 2684.84, "end": 2688.88, "text": "kein Unterschied dazwischen, ob du die Bash so startest oder die Bash über Docker in"}, {"id": 415, "start": 2688.88, "end": 2694.36, "text": "nem Container startest. Beide Prozesse laufen nicht virtualisiert, sondern sind ganz normale"}, {"id": 416, "start": 2694.36, "end": 2701.96, "text": "Prozesse, die der jeweilige Hostkernel ausführt. Also Bash in Docker ist nicht virtualisiert"}, {"id": 417, "start": 2701.96, "end": 2707.52, "text": "und Bash ohne Docker ist als rechtlich virtualisiert. Der einzige Unterschied dazwischen ist, dass"}, {"id": 418, "start": 2707.52, "end": 2714.76, "text": "es auf Kernel-Ebene sowas wie Namespaces und Cgroups gibt. Das ist so ein bisschen Sandbox-"}, {"id": 419, "start": 2714.76, "end": 2720.92, "text": "Sandbox-Möglichkeiten, dass die Bash in nem Container vielleicht nicht Zugriff auf alles"}, {"id": 420, "start": 2720.92, "end": 2728.04, "text": "vom Host hat. Aber das ist keine Virtualisierung. Also sprich, wenn du Docker in einer Ubuntu-VM"}, {"id": 421, "start": 2728.04, "end": 2734.56, "text": "betreibst, dann ist das keine nested Virtualisierung, sondern das ist ein stinknormaler Prozess"}, {"id": 422, "start": 2734.56, "end": 2738.92, "text": "wie alles andere auch, was du in dieser VM ausführst. Docker interessiert sich oder"}, {"id": 423, "start": 2738.92, "end": 2747.2, "text": "generell Linux-Container interessieren sich absolut null für Virtualisierung. Und es"}, {"id": 424, "start": 2747.2, "end": 2751.48, "text": "würde sogar nested-virtualisiert funktionieren. Also du könntest sogar ganz abgedrehte Sachen"}, {"id": 425, "start": 2751.48, "end": 2757.4, "text": "machen wie, vor allem bei Workstation, darauf KVM und dann bei KVM-Linux-Kiste-Docker."}, {"id": 426, "start": 2757.4, "end": 2763.24, "text": "Aber dann ist nested-virtualisiert und dann ist die Performance auch im Arsch. Aber vor"}, {"id": 427, "start": 2763.24, "end": 2766.2, "text": "allem bei Workstation, guck mal, ich verwende das doch hier auch laufen. Ich hab hier meine"}, {"id": 428, "start": 2766.2, "end": 2770.96, "text": "VM bei Workstation und ich kann hier ohne Probleme sagen, Docker, PS, zack, läuft. Gar"}, {"id": 429, "start": 2770.96, "end": 2779.32, "text": "kein Ding. Sollte mal an meiner Master-Thesis, das solltest du machen, ja, über was schreibst"}, {"id": 430, "start": 2779.32, "end": 2786.48, "text": "du? Ach, übrigens hier, jung, oder Snorlax, weiß ich genau, was davon? Wie war so dein"}, {"id": 431, "start": 2786.48, "end": 2793.4, "text": "Probearbeitstag heute? Google hilft deutscher Bank, ok. Was macht denn die deutsche Bank"}, {"id": 432, "start": 2793.4, "end": 2802.6, "text": "da? Scheiß VDSL Telekom, warum das denn? Knäbier hast recht, ja, müsste ich mal echt"}, {"id": 433, "start": 2802.6, "end": 2807.08, "text": "updaten. Also was, die deutsche Bank will ihre IT-Probleme unter anderem mit der Hilfe"}, {"id": 434, "start": 2807.08, "end": 2819.0, "text": "von Google lösen. Na dann, easy as fuck, würde ich sagen. Sollen sie mal machen. Also beide"}, {"id": 435, "start": 2819.0, "end": 2826.56, "text": "Firmen, blablabla, das Finanzinstitut bekommt Zugang zu den Cloud-Diensten der Alphabet-Tochter,"}, {"id": 436, "start": 2826.56, "end": 2831.96, "text": "ok, Google, das finden die News-Schreiber immer geil, weil die suchen immer händrigen"}, {"id": 437, "start": 2831.96, "end": 2835.0, "text": "Synonyme für die gleichen Sachen. Jetzt können sie anstatt Google schreiben, die"}, {"id": 438, "start": 2835.0, "end": 2841.16, "text": "Alphabet-Tochter. Zudem wollen die Unternehmen die nächste Generation... blablabla, ok,"}, {"id": 439, "start": 2841.16, "end": 2848.8, "text": "was machen sie denn jetzt eigentlich? Ok. Die deutsche Bank kämpft wie viele andere"}, {"id": 440, "start": 2848.8, "end": 2852.92, "text": "deutsche Finanzinstitute mit technischen Problemen. Das sind hausgemachte Probleme. Wenn man das"}, {"id": 441, "start": 2852.92, "end": 2857.4, "text": "ja auch 20 Jahre lang verschläft und verkackt, dann muss man sich nicht wundern."}, {"id": 442, "start": 2857.4, "end": 2873.0, "text": "Schon der frühere Konzernschaftler, kurz nach seinem Amt, hat er öffentlich als lausig"}, {"id": 443, "start": 2873.0, "end": 2879.44, "text": "bezeichnet. Mich würde interessieren, wenn er die IT als lausig bezeichnet, was er damit"}, {"id": 444, "start": 2879.44, "end": 2883.78, "text": "genau meint. Weil ich könnte mir vorstellen, dass die Leute, die da arbeiten, alles andere"}, {"id": 445, "start": 2883.78, "end": 2888.24, "text": "als lausig sind, damit der ganze Scheiß auf der alten Infrastruktur und dem ganzen alten"}, {"id": 446, "start": 2888.24, "end": 2894.52, "text": "Müll überhaupt noch funktioniert. Er meint wahrscheinlich, dass er und seine"}, {"id": 447, "start": 2894.52, "end": 2900.72, "text": "Manager es verkackt haben, bzw. er, sein Vorgänger und seine Manager es verkackt haben."}, {"id": 448, "start": 2900.72, "end": 2916.16, "text": "Ex-IT-Chefin Kim Hammond, aha, ok, die Ex-IT-Chefin musste wieder weg. Zuvor hatte sie die Bank"}, {"id": 449, "start": 2916.16, "end": 2920.24, "text": "als das dysfunktionalste Unternehmen, für das sie je gearbeitet haben, kann ich voll"}, {"id": 450, "start": 2920.24, "end": 2924.12, "text": "und ganz nachvollziehen. Wenn ich mir das teilweise angucke, wie das bei uns läuft,"}, {"id": 451, "start": 2924.12, "end": 2929.98, "text": "und ich arbeite nicht bei der deutschen Bank, aber so weit davon weg, also rein geografisch"}, {"id": 452, "start": 2929.98, "end": 2946.04, "text": "gesehen sind wir nicht. Also, vieles ist bei uns auch sehr, sehr merkwürdig, wo man sich"}, {"id": 453, "start": 2946.04, "end": 2950.96, "text": "fragt, wie zum Teufel funktioniert das überhaupt. Und genau das wird bei der Deutschen Bank"}, {"id": 454, "start": 2950.96, "end": 2955.12, "text": "auch so sein. Ich kenne ja ein paar Leute, die bei uns gearbeitet haben, die auch vorher"}, {"id": 455, "start": 2955.12, "end": 2964.76, "text": "bei der Deutschen Bank gearbeitet haben, die haben da auch wenig Gutes dran gelassen. Also,"}, {"id": 456, "start": 2964.76, "end": 2972.44, "text": "von allem, was ich gehört habe, könnte ich das bestätigen. Die musste wahrscheinlich"}, {"id": 457, "start": 2972.44, "end": 2980.0, "text": "gehen, weil sie gesagt hat, wie es ist. Die musste wahrscheinlich gehen, weil sie gesagt"}, {"id": 458, "start": 2980.0, "end": 2986.24, "text": "hatte, Jungs, wenn wir das lösen wollen, müssen wir uns erstmal eingestehen, dass wir Scheiße"}, {"id": 459, "start": 2986.24, "end": 2991.44, "text": "sind. Und das hört wahrscheinlich kein Manager gerne. Die haben sie eingestellt dafür und"}, {"id": 460, "start": 2991.44, "end": 2997.6, "text": "wollten nicht hören, was was ist. Das kommt öfters vor, dass Leute eingestellt werden"}, {"id": 461, "start": 2997.6, "end": 3000.96, "text": "so nach dem Motto, wir brauchen jetzt das hier, wir brauchen hier, wir brauchen jenes."}, {"id": 462, "start": 3000.96, "end": 3008.04, "text": "Und wenn man dann jemanden hat, der das wirklich nachhaltig lösen will, der muss dann erstmal"}, {"id": 463, "start": 3008.04, "end": 3013.16, "text": "auf den Tisch packen. Okay, Leute, in diesen Bereichen haben wir 20 Jahre geschlafen, wir"}, {"id": 464, "start": 3013.16, "end": 3017.84, "text": "sind viel schlechter als die Konkurrenz. Wir haben vielleicht eine gewisse Stellung, dass"}, {"id": 465, "start": 3017.84, "end": 3022.04, "text": "sieht das nicht so aus wie, aber wir sind einfach Scheiße. Und das hören die Leute"}, {"id": 466, "start": 3022.04, "end": 3026.16, "text": "halt nicht gerne. Ich meine, niemand stellt jemand gerne ein und kriegt dann von dem gesagt,"}, {"id": 467, "start": 3026.16, "end": 3030.6, "text": "dass er Scheiße gebaut hat die letzten 20 Jahre. Aber wenn man Probleme lösen will,"}, {"id": 468, "start": 3030.6, "end": 3035.76, "text": "muss man sich der Sache halt manchmal stellen. Da haben viele Manager anscheinend Probleme"}, {"id": 469, "start": 3035.76, "end": 3045.16, "text": "damit. So und das betrifft die meisten großen deutschen IT Unternehmen, bin ich mit ziemlich,"}, {"id": 470, "start": 3045.16, "end": 3050.48, "text": "also nicht IT und die meisten größten deutschen Unternehmen wird das betreffen, uns mit Sicherheit"}, {"id": 471, "start": 3050.48, "end": 3057.6, "text": "auch. Und was soll ich jetzt sagen, also es ist ja kein Wunder, dass in Deutschland so"}, {"id": 472, "start": 3057.6, "end": 3065.04, "text": "viele Startups mittlerweile erfolgreich sind, nicht etwa, indem sie das machen, was Startups"}, {"id": 473, "start": 3065.04, "end": 3071.36, "text": "normalerweise machen, irgendwie tolle neuen innovativen Sachen ausprobieren und zu 80"}, {"id": 474, "start": 3071.36, "end": 3076.68, "text": "Prozent failen und zu 19 Prozent verkauft werden und zu einem Prozent mal was großes"}, {"id": 475, "start": 3076.68, "end": 3085.44, "text": "werden, sondern die Startups in Deutschland sind so gut im Geschäft, weil die den alten"}, {"id": 476, "start": 3085.44, "end": 3091.8, "text": "großen Unternehmen helfen, wieder ein bisschen Anschluss zu bekommen. Also wir verdienen"}, {"id": 477, "start": 3091.8, "end": 3096.04, "text": "quasi unsere Startups gibt es nur, weil es die großen Unternehmen verschissen haben."}, {"id": 478, "start": 3096.04, "end": 3102.24, "text": "So also weiter, das größte Problem der Deutschen Bank sind die vielen verschiedenen Systemen."}, {"id": 479, "start": 3102.24, "end": 3109.12, "text": "Christian bist du noch da? Da können wir auch ein Lied von singen. Das größte Problem"}, {"id": 480, "start": 3109.12, "end": 3113.36, "text": "der Deutschen Bank, also das größte Problem bei uns, was wir haben ist auch ähnlich."}, {"id": 481, "start": 3113.36, "end": 3121.52, "text": "Wir haben auch sehr viele verschiedene Systeme. Das könnte ich so unterschreiben. 2012 hatte"}, {"id": 482, "start": 3121.52, "end": 3125.64, "text": "die Bank SAP damit beaufragt, die Plattform zu harmonisieren, was jedoch scheitert. Also"}, {"id": 483, "start": 3125.64, "end": 3130.32, "text": "wir fassen mal zusammen, die haben das Problem schon lange erkannt, aber sie kriegen es"}, {"id": 484, "start": 3130.32, "end": 3139.56, "text": "nicht gebacken, was definitiv dafür spricht, dass es intern Widerstände dagegen gibt. Widerstände,"}, {"id": 485, "start": 3139.56, "end": 3143.92, "text": "die sich nicht einfach durch einen neuen IT-Chef oder irgendwelche Konsultanten Leute"}, {"id": 486, "start": 3143.92, "end": 3150.72, "text": "aus dem Weg schaffen lassen. Also höchstwahrscheinlich Widerstände auf einer ähnlichen Ebene, wie"}, {"id": 487, "start": 3150.72, "end": 3161.96, "text": "hier oben die Leute einstellt. So, ob die das jetzt mit Google hinkriegen, wenn sie alles"}, {"id": 488, "start": 3161.96, "end": 3167.76, "text": "so machen wie bisher, ist das auch fragwürdig. Neben dem Umbau der IT haben die Banken viel"}, {"id": 489, "start": 3167.76, "end": 3171.6, "text": "mit Konkurrenz von Techland gekämpft, die wie Apple und Google ihre Marktmarkennutzung"}, {"id": 490, "start": 3171.6, "end": 3184.12, "text": "und Teile des Zahlungsverkehrs. Warum muss ich das jetzt unbedingt lesen? So was Tolles"}, {"id": 491, "start": 3184.12, "end": 3194.88, "text": "stand jetzt da auch nicht drin. Eins wird das auf jeden Fall machen, so eine Kooperation"}, {"id": 492, "start": 3194.88, "end": 3200.92, "text": "zwischen Google und der Deutschen Bank. Es wird sehr viel Geld verbrennen, ob da am Ende"}, {"id": 493, "start": 3200.92, "end": 3205.32, "text": "was Gutes rauskommt oder nicht, wage ich nicht zu sagen, dafür kenne ich mich mit der Deutschen"}, {"id": 494, "start": 3205.32, "end": 3208.16, "text": "Bank zu wenig aus. Wie gesagt, die paar Leute, die ich kenne, die da gearbeitet haben, was"}, {"id": 495, "start": 3208.16, "end": 3214.04, "text": "sie erzählt haben, so ein umfassendes Bild gibt es jetzt auch nicht. Es wird auf jeden"}, {"id": 496, "start": 3214.04, "end": 3221.32, "text": "Fall sehr viel Geld verbrennen und Google wird sich an der Deutschen Bank die Haare raufen,"}, {"id": 497, "start": 3221.32, "end": 3229.8, "text": "da bin ich mir ziemlich sicher. Da kommen dann irgendwelche super agilen Amis an oder"}, {"id": 498, "start": 3229.8, "end": 3235.0, "text": "wer auch immer und meinen hier, das geht hier auch so und die werden dann erstmal konfrontiert"}, {"id": 499, "start": 3235.0, "end": 3244.2, "text": "mit der Schwerfälligkeit eines großen deutschen Unternehmens im Finanzsektor. Die Schwerfälligkeit"}, {"id": 500, "start": 3244.2, "end": 3248.68, "text": "kann sich ein Googler wahrscheinlich noch nicht mal in seinem Traum ausmalen, wie schwerfällig"}, {"id": 501, "start": 3248.68, "end": 3259.12, "text": "sowas sein kann. Also es wird auf jeden Fall auch den härtesten Googler zur Verzweiflung"}, {"id": 502, "start": 3259.12, "end": 3264.48, "text": "bringen, die Deutsche Bank. Mich würde mal interessieren, ob es dann irgendwann mal Berichte"}, {"id": 503, "start": 3264.48, "end": 3274.64, "text": "gibt, wie es eigentlich gelaufen ist. Mein Probetag war nice, habe gesehen, wie die arbeiten,"}, {"id": 504, "start": 3274.64, "end": 3280.6, "text": "wir waren beim größten Kunden, die haben einen 200.000 Euro Server im Rack mit Virtualisierung"}, {"id": 505, "start": 3280.6, "end": 3295.32, "text": "im Keller stehen. Es gibt fette Systeme. Guckt euch mal IBM Großrechner an, IBM Host Geschichten"}, {"id": 506, "start": 3295.32, "end": 3300.48, "text": "an, was das kostet. Und da bezahlst du auch noch die Rechenzeit, das ist so richtig oldschool."}, {"id": 507, "start": 3300.48, "end": 3312.12, "text": "Diese Season wieder relativ viel. Gut, also wir wollten uns ja mal, irgendwie hat mich"}, {"id": 508, "start": 3312.12, "end": 3318.68, "text": "der Chat am Anfang da auf die Idee gebracht, angucken, was denn für IT Zertifizierung empfohlen"}, {"id": 509, "start": 3318.68, "end": 3330.52, "text": "werden. Ich habe nämlich legit keine, what the fuck. Die besten IT Zertifizierung, ok"}, {"id": 510, "start": 3330.52, "end": 3337.4, "text": "gucken wir mal, was gibt es denn da. Warum ist das gelb? Wie sieht denn die Seite ohne"}, {"id": 511, "start": 3337.4, "end": 3348.28, "text": "Dark Reader aus? Ich bin blind. Welche Zertifizierung, 2018, ok. Die Top 10 IT Zertifizierung. EC"}, {"id": 512, "start": 3348.28, "end": 3356.6, "text": "Concealed Certified Ethical Hacker, habe ich noch nie gehört. ESC 2 CESSP, habe ich auch"}, {"id": 513, "start": 3356.6, "end": 3362.84, "text": "noch nie gehört. Degra Datenschutzbeauftragter, what the fuck, habe ich auch noch nicht gehört."}, {"id": 514, "start": 3362.84, "end": 3368.04, "text": "Certified Cloud Security Professional, klingt irgendwie ein bisschen nach Cisco, ist es"}, {"id": 515, "start": 3368.04, "end": 3373.32, "text": "aber anscheinend, doch, ist es? Ne, ist es nicht. Ist es nicht, habe ich auch noch nicht"}, {"id": 516, "start": 3373.32, "end": 3381.08, "text": "gehört. Cisco CCNA, ok, den kennt man. Vorbei ich echt meine Zweifel habe, dass ein CCNA"}, {"id": 517, "start": 3381.08, "end": 3386.72, "text": "so beliebt ist. Ich habe auch ein CCNA gemacht vor Uhrzeiten. Hat bis jetzt nicht die Bohne"}, {"id": 518, "start": 3386.72, "end": 3394.36, "text": "irgendjemand interessiert und ich meine so ein CCNA, so ein CCNA ist, das ist ein Inhalt,"}, {"id": 519, "start": 3394.36, "end": 3404.52, "text": "das kannst du innerhalb von einer Woche easy lernen. CCNA ist nichts, also beim CCNA ist"}, {"id": 520, "start": 3404.52, "end": 3410.24, "text": "nichts großartiges dabei. Da lernst du so Sachen wie, wie man mit einer seriellen Konsole"}, {"id": 521, "start": 3410.24, "end": 3414.64, "text": "an den Cisco Switch geht, wie man da Enable Mode anmacht, wie man da ein paar Routing-Tabellen"}, {"id": 522, "start": 3414.64, "end": 3429.12, "text": "konfiguriert, wie man, wie man OSPF einschaltet und das war es zum größten und ganzen. Also"}, {"id": 523, "start": 3429.12, "end": 3438.76, "text": "viel mehr kommt da nicht bei rum. Kenn ich nicht, kenne ich auch nicht. IGIT. Axel OS"}, {"id": 524, "start": 3438.76, "end": 3447.72, "text": "Prince 2. Das hört sich an wie ein griechischer, wie ein griechischer Millionär oder sowas."}, {"id": 525, "start": 3447.72, "end": 3454.76, "text": "Alexios Prince 2. Second, was auch immer, Foundation and Practitioner. Lean, oh je, das"}, {"id": 526, "start": 3454.76, "end": 3460.2, "text": "ist, das ist BWL Stonks Zeug. Das ist doch nicht euer Arzt, das können doch nicht die"}, {"id": 527, "start": 3460.2, "end": 3465.24, "text": "besten Zertifizierungen sein. Meine IT-Kerre, Überblick über die Wicht, ok, zeig mal her."}, {"id": 528, "start": 3465.24, "end": 3474.08, "text": "Ja, End of Functions, ich weiß, machen viele in der Schule, deswegen ist ein CCNA nur wirklich"}, {"id": 529, "start": 3474.08, "end": 3479.28, "text": "nichts so Geiles. Erstens hat fast jeder einen CCNA und außerdem lernt man beim CCNA nichts,"}, {"id": 530, "start": 3479.28, "end": 3484.84, "text": "was man nicht auch so in 1-2 Wochen lernen könnte. Beim Internet-Engineer sieht es dann"}, {"id": 531, "start": 3484.84, "end": 3504.52, "text": "schon ein bisschen anders aus. CISM, CCNA, CCSP, KISO, KISO Certified Security Professional,"}, {"id": 532, "start": 3504.52, "end": 3511.44, "text": "das kann ich mir tatsächlich vorstellen, dass das gar nicht so übel ist. ISTQB, das klingt"}, {"id": 533, "start": 3511.44, "end": 3531.72, "text": "wie irgendeine, keine Ahnung, irgendeine Lobby-Gruppe für, mir fällt jetzt zu ISTQB nichts ein. Ok,"}, {"id": 534, "start": 3531.72, "end": 3538.32, "text": "was ist denn International Software Testing Certification Board? Software Testing, hab"}, {"id": 535, "start": 3538.32, "end": 3545.92, "text": "ich auch noch nichts von gehört. Oh Gott, ITIL, jetzt wollen sie es auch wissen. Excellent"}, {"id": 536, "start": 3545.92, "end": 3556.76, "text": "ITIL. Oh, wir haben einen im Chat, der Nico hat ein ISTQB, er sagt, er ist trash. Excellent."}, {"id": 537, "start": 3556.76, "end": 3571.92, "text": "IREP, International Requirements, das sind doch keine Zertifikate, das sind BWL-Stonks-Dinger,"}, {"id": 538, "start": 3571.92, "end": 3580.96, "text": "das ist doch nichts, was ein ordentlicher IT-Mann, der sich mit Technik auskennt hat. Was, ECDL"}, {"id": 539, "start": 3580.96, "end": 3597.6, "text": "sagt mir gar nichts, was ist denn das? ECDL-Zertifikat. Was? Der Europäischer Computerführerschein."}, {"id": 540, "start": 3597.6, "end": 3610.88, "text": "Kann man den online machen? Den will ich machen. Ich will den Computer-Triving-License machen."}, {"id": 541, "start": 3610.88, "end": 3621.32, "text": "Kann man den online machen? Oh ne, das kann ich nicht. Das kann ich nicht. Textverarbeitung,"}, {"id": 542, "start": 3621.32, "end": 3636.72, "text": "Tabelle, das kann ich nicht. Das ist durchgefallen. Die Österreicher machen es richtig, die nennen"}, {"id": 543, "start": 3636.72, "end": 3659.36, "text": "es gleich Image-Editing. Ich will das machen, wo kann man das machen? Okay, ECDL, Online-Test-Free."}, {"id": 544, "start": 3659.36, "end": 3676.84, "text": "Begriff, teste dein Wissen. Quiz, okay, excellent. Quiz, online, online-Aufragen. Also, wir machen"}, {"id": 545, "start": 3676.84, "end": 3687.24, "text": "jetzt den europäischen Computerführerschein. Auf geht's. Welche Zahlungsarten ist bei"}, {"id": 546, "start": 3687.24, "end": 3693.72, "text": "einer Online-Bestellung für die Käufer am sichersten? Das kommt vom Bezahl, das hängt"}, {"id": 547, "start": 3693.72, "end": 3700.24, "text": "vom Bezahl-Service ab. Bezahlung per Überweisung vor Lieferung der Ware, Bezahlung mit Abrechnungsaufgabe."}, {"id": 548, "start": 3700.24, "end": 3704.88, "text": "Was hat denn das mit Computer? Okay, am Rande, am Rande, ja. Abbuchungsauftrag, Bezahlung"}, {"id": 549, "start": 3704.88, "end": 3716.2, "text": "mit Überweisung nach Erhalt. Na ja gut, Bezahlung vor Überweisung. Was? Nein, nein, nein. Das"}, {"id": 550, "start": 3716.2, "end": 3721.92, "text": "habe ich falsch gelesen. Das habe ich falsch gelesen. Ich meinte, das ist Vorkasse. Das"}, {"id": 551, "start": 3721.92, "end": 3731.28, "text": "ist aber gar keine Vorkasse, ne? Das da dann, ja. Ich dachte, das ist, ich dachte, das ist"}, {"id": 552, "start": 3731.28, "end": 3738.8, "text": "Nachname. Nachname meinte, aber ist es nicht. Okay, Pepega, next. Also, was ist der Unterschied"}, {"id": 553, "start": 3738.8, "end": 3759.12, "text": "zwischen Internet und World Wide Web? Das Internet ist... Staatliche Einrichtung verwenden"}, {"id": 554, "start": 3759.12, "end": 3767.28, "text": "das Internet Firmen und Privat... What? Das WWW ist ein Dienst des Internets, muss es"}, {"id": 555, "start": 3767.28, "end": 3775.92, "text": "eigentlich sein. Richtig. Jawoll. Next. Welche Web-Adresse könnte es wirklich geben?"}, {"id": 556, "start": 3775.92, "end": 3787.44, "text": "Die sind nicht immer so ganz aktuell. Mittlerweile könnte es davon so ziemlich jede Adresse"}, {"id": 557, "start": 3787.44, "end": 3795.0, "text": "geben. Okay, die hier, die hier nicht. Die hier könnte es nicht geben, aber die könnte"}, {"id": 558, "start": 3795.0, "end": 3799.04, "text": "es geben. Das ist das, was die auch wissen wollen. Aber die könnte es mittlerweile auch"}, {"id": 559, "start": 3799.04, "end": 3802.68, "text": "geben und die könnte es mittlerweile auch geben, weil die vergeben ja mittlerweile alle"}, {"id": 560, "start": 3802.68, "end": 3807.32, "text": "möglichen Top-Level-Domains. Ich weiß nicht, ob sie Top-Level-Domains mit Minus vergeben."}, {"id": 561, "start": 3807.32, "end": 3816.48, "text": "Hab ich noch nicht gesehen, aber ich könnte mir vorstellen, wenn du genug Geld da auf"}, {"id": 562, "start": 3816.48, "end": 3822.32, "text": "den Tisch legst, kriegst du auch Vienna Active als Top-Level-Domain. Aber was die wissen"}, {"id": 563, "start": 3822.32, "end": 3829.72, "text": "wollen, ist das hier. Also Sub-Domain, Top-Level-Domain und wie nennen sie das eigentlich? Domain,"}, {"id": 564, "start": 3829.72, "end": 3838.84, "text": "Top-Level-Domain, Sub-Domain. Aber mittlerweile könnte fast alles irgendwo sein. So, was"}, {"id": 565, "start": 3838.84, "end": 3849.88, "text": "ist die Startseite eines Browsers? Ja, Pornhub, oder? Was ist die Startseite? Die Webseite,"}, {"id": 566, "start": 3849.88, "end": 3860.4, "text": "die nach dem Starten des Browsers angezeigt wird. Die, echt jetzt? Es kommt übrigens"}, {"id": 567, "start": 3860.4, "end": 3869.4, "text": "ganz entscheidend auf die Config an, weil die Startseite ist mittlerweile so ein Dashboard,"}, {"id": 568, "start": 3869.4, "end": 3879.44, "text": "auch bei Firefox. Was sind Favoriten? Microsoft Edge. Sogar schon, das ist top aktuell, Leute."}, {"id": 569, "start": 3879.44, "end": 3886.96, "text": "Top aktuell, seht ihr das? Sogar Edge drinnen. Was sind Favoriten? Was ist denn das für"}, {"id": 570, "start": 3886.96, "end": 3896.08, "text": "eine Pepega-Fragen, ey? Und guckt euch mal dieses Hi-Res-Commuter-Bild hier nebenan."}, {"id": 571, "start": 3896.08, "end": 3901.32, "text": "Gespeicherte Verknüpfungs-Webseite, okay, weiter. Auf welchen ist besonders, das 31"}, {"id": 572, "start": 3901.32, "end": 3905.32, "text": "ist so eine Kackfrage. Na gut. Auf welchen Webseiten ist es besonders wichtig, Benutzern"}, {"id": 573, "start": 3905.32, "end": 3919.96, "text": "ein Kennwort zu haben? Sie wollen das hören, okay. Ähm, auf, auf, na ja, also, streng"}, {"id": 574, "start": 3919.96, "end": 3925.34, "text": "genommen ist das nicht das, ist Benutzern Passwort nicht das Wichtige, sondern dass"}, {"id": 575, "start": 3925.34, "end": 3930.08, "text": "irgendeine wirksame Authentifizierung verwendet wird. Und eine wirksame Authentifizierung sollte"}, {"id": 576, "start": 3930.08, "end": 3933.76, "text": "immer dann verwendet werden, wenn ich dort auf irgendwelche Sachen zugreifen kann, wodurch"}, {"id": 577, "start": 3933.76, "end": 3938.8, "text": "ich drauf zugreifen kann. Das kann bei allen anderen auch der Fall sein, aber die wollen"}, {"id": 578, "start": 3938.8, "end": 3955.24, "text": "eindeutig natürlich ein D hören. Wozu werden Daten verschlüsselt? Ähm, äh, damit die"}, {"id": 579, "start": 3955.24, "end": 3964.08, "text": "Daten für Hacker unlesen? Das stimmt aber gar nicht. Das stimmt nicht. Das wollen die"}, {"id": 580, "start": 3964.08, "end": 3970.4, "text": "hören, aber das stimmt nicht. In der Regel ist, während der Computer an ist, die ganze"}, {"id": 581, "start": 3970.4, "end": 3974.04, "text": "Sache ja unanschlüsselt. Und wenn du dir den Keylogger oder irgendeinen anderen Trojaner"}, {"id": 582, "start": 3974.04, "end": 3982.4, "text": "einfängst, dann kann der auf die unverschlüsselten Daten zugreifen. Also die wollen das hier"}, {"id": 583, "start": 3982.4, "end": 3990.36, "text": "hören, aber das stimmt nicht. Das hier ist richtig, aber das stimmt nicht. Ähm, wo besteht"}, {"id": 584, "start": 3990.36, "end": 3998.92, "text": "die größte Gefahr? Was ist das für Fragen, Alter? Das ist ja absolut Noobstyle. Wo besteht"}, {"id": 585, "start": 3998.92, "end": 4002.64, "text": "die größte Gefahr? Beim Aktualisieren, beim Besuch, bei der Nutzung von Suchmaschinen,"}, {"id": 586, "start": 4002.64, "end": 4008.88, "text": "beim Download von der Teilenprogramm? Ja, okay, next. Das mach ich nicht alles. Das mach"}, {"id": 587, "start": 4008.88, "end": 4013.76, "text": "ich nicht alles. Das ist mir zu doof. Welcher Teil der E-Mail-Adresse Office and Easy-For-Me-Info"}, {"id": 588, "start": 4013.76, "end": 4022.24, "text": "ist die Top-Level-Domain-Info? Das ist übrigens mal ne ordentliche Frage. Ist ja auch nur"}, {"id": 589, "start": 4022.24, "end": 4027.96, "text": "für 7-8-Klessler. 7-8-Klessler können das auch schon besser. Was ist der wichtigste"}, {"id": 590, "start": 4027.96, "end": 4035.92, "text": "Vorteil von E-Mail? Keine Sau verwendet mehr E-Mail. Außer PP-Gast, die diese Fragen erstellen."}, {"id": 591, "start": 4035.92, "end": 4046.92, "text": "Okay, was ist ein Vorteil? Dass es Spam gibt, dass es Mails gibt, verbale Kommunikation"}, {"id": 592, "start": 4046.92, "end": 4054.4, "text": "ist nicht mehr notwendig, E-Mails erreichen den Empfänger in kurzer Zeit. Also, ähm,"}, {"id": 593, "start": 4054.4, "end": 4061.0, "text": "für mich B, für mich B, allerdings wollen die wahrscheinlich A hören, wobei man aber"}, {"id": 594, "start": 4061.0, "end": 4071.48, "text": "dazu sagen muss, das stimmt nichts. E-Mails ist kein irgendwie Echtzeit-Kommunikations-Medium."}, {"id": 595, "start": 4071.48, "end": 4077.0, "text": "Also, also für mich ist B richtig, aber B ist falsch, die wollen A hören. Siehste?"}, {"id": 596, "start": 4077.0, "end": 4081.96, "text": "Bäm. Das ist kein Vorteil. Natürlich ist das ein Vorteil. Verbale Kommunikation zwischen"}, {"id": 597, "start": 4081.96, "end": 4094.28, "text": "menschliche Interaktionen ist nervig. Windows-Click-Fragen, ich glaub es nicht. Das heißt doch nicht,"}, {"id": 598, "start": 4094.28, "end": 4102.48, "text": "wie kriege ich in Windows was angeklickt, sondern Computerführerschein. Das ist so dumm."}, {"id": 599, "start": 4102.48, "end": 4106.96, "text": "Welche Aufgaben hat ein Internet-Service-Provider? Stell dir in der Stelle die Hardware-Garantie,"}, {"id": 600, "start": 4106.96, "end": 4113.12, "text": "die Gerichtskanale. Okay, also, next. Welche dieser Seiten kommt aus Österreich? Die Schweizer"}, {"id": 601, "start": 4113.12, "end": 4119.12, "text": "Seite natürlich. Was man übrigens auch nicht so genau an der Top-Level-Domain sagen kann,"}, {"id": 602, "start": 4119.12, "end": 4124.48, "text": "es gibt sicherlich einige DE und AT-Info-CH Seiten, die weder sonderlich informativ sind,"}, {"id": 603, "start": 4124.48, "end": 4131.24, "text": "aus der Schweiz kommen, aus Österreich kommen oder aus Deutschland kommen. Was sind das"}, {"id": 604, "start": 4131.24, "end": 4140.44, "text": "für... Wo ist da der Unterschied? Ah, da ist ein Punkt, da ist ein Doppelpunkt. Okay."}, {"id": 605, "start": 4140.44, "end": 4147.8, "text": "Viele Websites miteinander verbunden, verlinkt, gedruckt, vertauscht. Ein Programm zum Betrachten"}, {"id": 606, "start": 4147.8, "end": 4156.12, "text": "von Websites ist ein Surfer. Ein Modem. Okay, die Fragen gehen halbwegs. Welches dieser"}, {"id": 607, "start": 4156.12, "end": 4176.56, "text": "Programme ist ein Browser? Firefox bzw. Internet-Explorer. Linux, eindeutig. Das ist richtig pepega. Was"}, {"id": 608, "start": 4176.56, "end": 4181.32, "text": "ein Reisender möchte, laufend online über seine Erlebnisse berichten. Welches Werkzeug"}, {"id": 609, "start": 4181.32, "end": 4186.48, "text": "eignet sich am besten dafür? Bluetooth. Da kann er sich mit seinem Handy verbinden und"}, {"id": 610, "start": 4186.48, "end": 4195.64, "text": "daheim anrufen. Wie wird der Datenverkehr aus dem Internet kontrolliert? Firewall, USB-Stick,"}, {"id": 611, "start": 4195.64, "end": 4215.0, "text": "externe Festplatte, WL... Hä? Die Firewall... Also, ich meine, die wollen A wissen, aber"}, {"id": 612, "start": 4215.0, "end": 4227.76, "text": "das ist blödsinn. Alle Cookies löschen... Die Firewall aktivieren. Okay, da habe ich"}, {"id": 613, "start": 4227.76, "end": 4234.28, "text": "jetzt keine Ahnung. Was sollte bei dem Besuch von sozialen Netzwerken beachtet werden? Sich"}, {"id": 614, "start": 4234.28, "end": 4246.44, "text": "auch wieder abmelden, alle Cookies löschen, Cookies zulassen, ne? Cookies löschen? Cookies"}, {"id": 615, "start": 4246.44, "end": 4254.84, "text": "löschen? Ja, abmelden bringt dir ja nichts ohne Cookies zu löschen. Ich sag Cookies"}, {"id": 616, "start": 4254.84, "end": 4265.12, "text": "löschen. Okay, abmelden. Also, ohne Cookies löschen bringt dir abmelden nichts. Nach"}, {"id": 617, "start": 4265.12, "end": 4271.52, "text": "welchen Informationen wird meine Hilfe... Oh Gott, geh weg. Was versteht man unter Spam?"}, {"id": 618, "start": 4271.52, "end": 4293.96, "text": "Das ist ein Wahn. Das schmerzt ja. Ist die Favoritenleiste eingeblendet? Das weiß ich."}, {"id": 619, "start": 4293.96, "end": 4309.32, "text": "Achso, da, ja. Welches der Programme ist kein Browser? Edge. Internet Explorer. Das zählt"}, {"id": 620, "start": 4309.32, "end": 4322.52, "text": "nicht als Browser. Ich weiß, dass es Word ist, aber das zählt nicht. Was ein Blödsinn."}, {"id": 621, "start": 4322.52, "end": 4329.32, "text": "Was ein Schwachsinn. Okay, für Siebklässler mag das ja ganz nett sein, aber wirklich"}, {"id": 622, "start": 4329.32, "end": 4335.0, "text": "was draus ableiten kann man sich auch nicht. Okay, wir waren bei IT-Zertifikaten gucken."}, {"id": 623, "start": 4335.0, "end": 4341.96, "text": "Damit bekommst du einen Job. Das wäre echt armselig, wenn man damit einen Job bekommt."}, {"id": 624, "start": 4341.96, "end": 4357.04, "text": "Auf der anderen Seite, ich bin überrascht, wie wenig Ahnung jüngere Leute von Computerzeug"}, {"id": 625, "start": 4357.04, "end": 4364.96, "text": "an sich haben. Ich hätte eigentlich gedacht, dass die Generation, die nach mir kommt und"}, {"id": 626, "start": 4364.96, "end": 4375.4, "text": "die damit ja komplett aufwächst, dass alles easy as fuck kann. Dass sich da keiner mehr"}, {"id": 627, "start": 4375.4, "end": 4379.68, "text": "von irgendwelchem Spamchi baiten lässt, dass sich da keiner mehr sinnlos irgendwelche Viren"}, {"id": 628, "start": 4379.68, "end": 4386.36, "text": "einfängt, dass die Leute so Basic-Tasks im Internet können, aber irgendwie sind die"}, {"id": 629, "start": 4386.36, "end": 4402.88, "text": "ja genauso bescheuert wie bei mir damals. Das kann doch nicht sein. Die meisten wissen"}, {"id": 630, "start": 4402.88, "end": 4407.0, "text": "nur, wie man Snapchat und TikTok installiert. Ja, das kann ich mir vorstellen. Aber das"}, {"id": 631, "start": 4407.0, "end": 4411.04, "text": "hätte ich nicht gedacht. Ich hätte wirklich gedacht, dass die Generation, die nach mir"}, {"id": 632, "start": 4411.04, "end": 4417.76, "text": "jetzt aufwächst, komplett mit Computer, die Basics einfach Intos hat und kann ganz automatisch."}, {"id": 633, "start": 4417.76, "end": 4435.8, "text": "Aber ist anscheinend nicht so. So, was gibt es denn noch für tolle Zertifikate, die man"}, {"id": 634, "start": 4435.8, "end": 4445.88, "text": "machen soll? Eitel. Nein. Das ist somit das bekannteste, was es gibt, aber nein. Gehen"}, {"id": 635, "start": 4445.88, "end": 4452.88, "text": "wir weg mit Eitel. Ich musste auch schon Eitel-Kurse machen. Eitel-Kurse sind wirklich echt ätzend."}, {"id": 636, "start": 4452.88, "end": 4472.08, "text": "Ich musste, ich habe schon ein paar Eitel-Kurse gemacht. Einer schlimmer als der andere. Du"}, {"id": 637, "start": 4472.08, "end": 4477.48, "text": "dürft, du dürft den Test nicht machen, das ist aber. Heute würdest du einfach anrufen"}, {"id": 638, "start": 4477.48, "end": 4483.72, "text": "und sagen, du fühlst dich diskriminiert, darfst du den Test machen. Lernt man da, wie man"}, {"id": 639, "start": 4483.72, "end": 4491.88, "text": "richtig agile und innovative Projekte macht? Nee, bei Eitel lernst du irgendwelche merkwürdigen"}, {"id": 640, "start": 4491.88, "end": 4499.64, "text": "Best-Practice für Prozesse und Abläufe, die die Leute nicht nehmen als Vorschläge, weil"}, {"id": 641, "start": 4499.64, "end": 4506.24, "text": "die meisten Leute einfach low-brain und dumm sind. Auch in solchen Positionen, wo das entschieden"}, {"id": 642, "start": 4506.24, "end": 4510.64, "text": "wird, die Leute nicht einfach als Vorschläge nehmen, so könnte man das machen, sondern"}, {"id": 643, "start": 4510.64, "end": 4514.88, "text": "das eher als Religion aufziehen, so nach dem Motto, Eitel sagt, man müsste das so und"}, {"id": 644, "start": 4514.88, "end": 4520.48, "text": "so machen. Es ist scheißegal, was Eitel sagt. Eitel schlägt was vor und man kann sich davon"}, {"id": 645, "start": 4520.48, "end": 4534.76, "text": "was rausnehmen, was passt. Das ist keine, keine Glaubensfrage. Mcse, Microsoft Certified Systems"}, {"id": 646, "start": 4534.76, "end": 4543.52, "text": "Engineer. Ich glaube, das ist das, das ist ein wirklich sinnvolles Zertifikat, wenn"}, {"id": 647, "start": 4543.52, "end": 4549.4, "text": "man in Microsoft Umgebung arbeitet. Das ist denke ich wirklich eines der wenigen sinnvollen,"}, {"id": 648, "start": 4549.4, "end": 4558.08, "text": "die wir uns da angeguckt haben. Und viele, viele so Windows-Läden gucken da auch drauf."}, {"id": 649, "start": 4558.08, "end": 4566.68, "text": "PMP, Project, nein, ganz bestimmt nicht. PMF, Project Management, Moment, das ist genau"}, {"id": 650, "start": 4566.68, "end": 4572.68, "text": "das gleiche, nur einmal in Deutsch und einmal in Englisch, oder was? Project Management,"}, {"id": 651, "start": 4572.68, "end": 4580.16, "text": "Professional, Project Management, das ist doch genau das gleiche. Nur das Fachmann und Professional,"}, {"id": 652, "start": 4580.16, "end": 4589.4, "text": "das ist doch genau das gleiche. Ach nee, das ist was anderes. Für erfahrene Project Manager,"}, {"id": 653, "start": 4589.4, "end": 4595.88, "text": "mein Group Professional und Fachmann ist genau das gleiche. Welcher Pepega Two-Head-Kopf"}, {"id": 654, "start": 4595.88, "end": 4602.64, "text": "hat sich das wieder ausgedacht, die Projekt, die Bezeichnung von diesem Ding, ey. Prince"}, {"id": 655, "start": 4602.64, "end": 4614.84, "text": "II. Da habe ich schon mal was von gehört. Das ist auch irgendeine Stonks-Geschichte."}, {"id": 656, "start": 4614.84, "end": 4624.4, "text": "Six Sigma. Klingt nach einer Sache, wo ich einen großen Bogen drum machen will. Prost"}, {"id": 657, "start": 4624.4, "end": 4638.44, "text": "dich. Welche Zertifikate bringen was? Okay, das ist, alle akzeptieren alle Cookies. Was"}, {"id": 658, "start": 4638.44, "end": 4642.52, "text": "genau macht der da? Sind das die Zertifikate von ihm? Der hat sich gedacht, scheiße, man,"}, {"id": 659, "start": 4642.52, "end": 4649.64, "text": "so viel Zeit das alles zu machen und alles bringt nichts. Wie heißt das Meme mit dem"}, {"id": 660, "start": 4649.64, "end": 4654.64, "text": "Jungen, der das Kreuz vor sich hält, der? Ich habe keine Ahnung. Ich dachte immer, das"}, {"id": 661, "start": 4654.64, "end": 4660.0, "text": "ist ein Mädchen. Vielleicht ist auch ein Junge. Keine Ahnung. Weiß ich nicht. Ich habe keine"}, {"id": 662, "start": 4660.0, "end": 4666.8, "text": "Ahnung, wie das heißt. Musst du mal suchen. Wenn du Google suchst, bestimmt Child Holding"}, {"id": 663, "start": 4666.8, "end": 4680.12, "text": "Cross Meme. Da findest du bestimmt neue Meme-Einträge, noch ein Löcher zu. Agile Zertifikate. Oh,"}, {"id": 664, "start": 4680.12, "end": 4694.44, "text": "Scrum Master. Yes, yes, yes. Scrum Master. Agile Coach. Jawoll. Microsoft Certified Solution"}, {"id": 665, "start": 4694.44, "end": 4699.48, "text": "Developer. Die Dinger, die haben immer so, die haben mittlerweile so richtige Big Brain"}, {"id": 666, "start": 4699.48, "end": 4703.2, "text": "Namen, die ganzen Zertifikate. Du kannst dir anhand des Zertifikats gar nicht mal genau"}, {"id": 667, "start": 4703.2, "end": 4719.6, "text": "überlegen, was das eigentlich bedeutet. Isakwap. Isakwup. Open Group Togath. Was ist, was? Togath."}, {"id": 668, "start": 4719.6, "end": 4732.48, "text": "Open Group Architecture Framework. Ja. Alles klar. Aytel. Nein, nein, nein, nein, nein,"}, {"id": 669, "start": 4732.48, "end": 4740.32, "text": "nein. Geh's mir fort. Aytel kommt mir nicht, kommt mir hier nicht ins Haus. Es ist ja schon"}, {"id": 670, "start": 4740.32, "end": 4752.64, "text": "wieder CISP. Oh, CISP. Das, das ist Privilege. Das dürfen nicht alle machen. Caesar Pen Test"}, {"id": 671, "start": 4752.64, "end": 4763.84, "text": "Plus. Wer wird denn da penetriert bei dem Test, fragt man sich, ne? Der Wertschuss ist am Start."}, {"id": 672, "start": 4763.84, "end": 4770.96, "text": "Bin ich mal lang da? Acht Minuten noch. Als Scrum Lehrer muss man das echt i-Zahmbeschreibe"}, {"id": 673, "start": 4770.96, "end": 4783.6, "text": "choose my name. Ja, du musst so Scrum Consultant sein oder sowas, ja. Too-Lang-Lütten-Treat."}, {"id": 674, "start": 4783.6, "end": 4790.4, "text": "In ein paar Berufen wie Administrator, Team Manager oder Tester sind Zertifikate auf Voraussetzungen"}, {"id": 675, "start": 4790.4, "end": 4797.56, "text": "verwendet. Ich sollte das wirklich flächendeckend der Fall sein, halte ich es für total fail,"}, {"id": 676, "start": 4797.56, "end": 4806.68, "text": "Zertifikate irgendwie vorauszusetzen. Der einzige Grund, wo ich es selbst für sinnvoll"}, {"id": 677, "start": 4806.68, "end": 4813.2, "text": "halten würde, nach Zertifikaten zu gucken, ist, wenn du jemand suchst, sehr speziell"}, {"id": 678, "start": 4813.2, "end": 4823.52, "text": "für ein gewisses Fachgebiet, sagen wir jetzt mal IBM Host-Entwicklung oder sowas in der"}, {"id": 679, "start": 4823.52, "end": 4827.76, "text": "Richtung. Also wirklich ein sehr spezielles Fachgebiet und du willst wissen, dass der"}, {"id": 680, "start": 4827.76, "end": 4833.52, "text": "auch echt ein bisschen Ahnung hat von dem, was er macht. Dann ist das ein guter Hinweis,"}, {"id": 681, "start": 4833.52, "end": 4840.28, "text": "wenn er vielleicht so ein Host-Zertifikat hat oder so. Aber ansonsten einfach mal ausprobieren,"}, {"id": 682, "start": 4840.28, "end": 4849.36, "text": "wie der mit aktuellen Problemen umgeht und... Scheiß auf Zertifikat, Alter. Ich meine,"}, {"id": 683, "start": 4849.36, "end": 4854.0, "text": "hey, ich hab mal, als ich jung war, ganz ganz jung, hab ich mal einen Wishful-Basics-6-Kurs"}, {"id": 684, "start": 4854.0, "end": 4857.56, "text": "gemacht an der Volkshochschule. Ich glaube, das Zertifikat sollte ich jetzt auch nochmal"}, {"id": 685, "start": 4857.56, "end": 4866.88, "text": "beilegen. Vor allem Wishful-Basics-6? Ich glaube, da findest du heute richtig gut bezahlte"}, {"id": 686, "start": 4866.88, "end": 4871.76, "text": "Jobs mit, wenn die noch was haben. Ey, wenn man heute noch Wishful-Basics-6-Anwendungen"}, {"id": 687, "start": 4871.76, "end": 4878.16, "text": "hat, sucht bestimmt Händeregen nach Wishful-Basics-6 an Programmierern. Ups, das wollte ich auch"}, {"id": 688, "start": 4878.16, "end": 4887.24, "text": "nicht sagen. Das ist ein bisschen wie Kobol. Das ist das Kobol von Microsoft, genau. Das"}, {"id": 689, "start": 4887.24, "end": 4898.28, "text": "ist ein bisschen wie Kobol. Wishful-Basics-6. Du hast mal einen C++-Kurs an der Volkshochschule."}, {"id": 690, "start": 4898.28, "end": 4903.76, "text": "Okay, das sind zwei Dinge, von denen ich relativ wenig halte. Vor der Volkshochschule, weil"}, {"id": 691, "start": 4903.76, "end": 4909.08, "text": "das alles, was ich da bisher vorhin gesehen hab, ziemlich ercrabt war, und C++. Zwei"}, {"id": 692, "start": 4909.08, "end": 4914.0, "text": "Sachen in Kombination, die nicht gut ausgehen können. Chat, was ist mit euch denn jetzt"}, {"id": 693, "start": 4914.0, "end": 4923.76, "text": "schon wieder los hier? Easykiller sehe ich ähnlich. Es gibt an unseren Schulen viel zu"}, {"id": 694, "start": 4923.76, "end": 4929.88, "text": "wenig IT-Unterricht, den man auch wirklich so nennen könnte. Und ich sage damit nicht,"}, {"id": 695, "start": 4929.88, "end": 4936.0, "text": "dass man den Leuten irgendwelche Mathe-Geschichten beibringen soll, oder irgendwelche Machine-Learning-AIs"}, {"id": 696, "start": 4936.0, "end": 4939.76, "text": "programmieren lassen soll oder sonst was. Sondern, dass man denen einfach mal ein paar"}, {"id": 697, "start": 4939.76, "end": 4945.68, "text": "Grundlagen, die Basics, also die Computer-Grundlagen beibringen soll. Und ich meine, mit Computer-Grundlagen"}, {"id": 698, "start": 4945.68, "end": 4956.72, "text": "nicht Word-Texte eintippen. Sondern man fängt an mit Bedienung, so nach dem Motto, was für"}, {"id": 699, "start": 4956.72, "end": 4961.2, "text": "unterschiedliche Programme gibt es auf dem aktuellen PC, was für unterschiedliche Betriebssysteme"}, {"id": 700, "start": 4961.2, "end": 4966.88, "text": "gibt es so, warum gibt es unterschiedliche Programme in verschiedenen Kategorien, wie"}, {"id": 701, "start": 4966.88, "end": 4971.64, "text": "verwendet man das Internet ordentlich ohne sich irgendeinen Mist einzufangen, so kann"}, {"id": 702, "start": 4971.64, "end": 4975.96, "text": "man anfangen und da geht man über mit aus was bestehendem Computer, warum ist das ganze"}, {"id": 703, "start": 4975.96, "end": 4981.8, "text": "so aufgebaut, Internet, Netzwerk, ein bisschen drumherum. Und dann am Ende vielleicht ein"}, {"id": 704, "start": 4981.8, "end": 4993.56, "text": "bisschen programmieren. Das ist doch super. Das wäre doch schonmal mehr als das, was die"}, {"id": 705, "start": 4993.56, "end": 5009.64, "text": "meisten Leute in 10 oder 12 Jahren in der Schule machen. Also für das, was man in der"}, {"id": 706, "start": 5009.64, "end": 5021.96, "text": "Schule, also allein schon das, was da Informatik heißt, hat ja damit kaum was zu tun. Und das,"}, {"id": 707, "start": 5021.96, "end": 5034.24, "text": "was man da macht, ist wahrscheinlich ziemlich easy mode. Also bei mir war der Informatikunterricht"}, {"id": 708, "start": 5034.24, "end": 5040.0, "text": "an der Schule echt lächerlich. Das kann man überhaupt nicht so nennen. Wir haben Word-Dokumente"}, {"id": 709, "start": 5040.0, "end": 5045.32, "text": "in Lila gemacht, weil das Leila Leila, weil der Lehrer das so geil fand, wenn Lila Schrift"}, {"id": 710, "start": 5045.32, "end": 5052.8, "text": "drinne war. Und dann haben wir noch ein bisschen PowerPoint, Excel und AXS gemacht. AXS, kann"}, {"id": 711, "start": 5052.8, "end": 5058.4, "text": "ich mir noch dran erinnern. AXS war echt die Höhe. Da hat nicht mal Verstanden uns richtig"}, {"id": 712, "start": 5058.4, "end": 5064.12, "text": "erklären oder konnte sich immer richtig erklären, wozu man eine Datenbank braucht. Wir haben"}, {"id": 713, "start": 5064.12, "end": 5070.16, "text": "Java programmiert ab der 10. Klasse. Ja, das ist gut. Da lernt man wenigstens was. Was"}, {"id": 714, "start": 5070.16, "end": 5078.32, "text": "ich halt oft gesehen habe, ist, dass sinnvoller Informatikunterricht oftmals rein freiwillig"}, {"id": 715, "start": 5078.32, "end": 5087.16, "text": "ist. Also sprich, es gibt irgendwie so einen Computerkurs oder irgendwie auch ein bisschen"}, {"id": 716, "start": 5087.16, "end": 5092.64, "text": "etwa ein Programmierkurs und sowas, aber der ist freiwillig irgendwann nachmittags,"}, {"id": 717, "start": 5092.64, "end": 5100.88, "text": "kaum einer macht, außer die Ultrageeks. Für was benötigt man eigentlich AXS? Ehrlich gesagt,"}, {"id": 718, "start": 5100.88, "end": 5106.28, "text": "ich habe keine Ahnung, wofür man AXS verwendet. Ich habe ernsthaft keinen blassen Schimmer,"}, {"id": 719, "start": 5106.28, "end": 5117.68, "text": "warum man sich AXS antut. Choose my name sagt, Informatik im IT-Abitur geht eigentlich ganz"}, {"id": 720, "start": 5117.68, "end": 5125.48, "text": "klar. Java, Bizzle, Software Engineering, Datenbank, SQL, Semplicy. Ich glaube, du warst einer"}, {"id": 721, "start": 5125.48, "end": 5129.84, "text": "der Ausnahmen, wo das so gut funktioniert hat. Der Informatikunterricht zum größten Teil"}, {"id": 722, "start": 5129.84, "end": 5148.0, "text": "ist einfach crap. Falls es überhaupt gibt. Sunni sagt, er hat HTML gemacht und danach"}, {"id": 723, "start": 5148.0, "end": 5158.44, "text": "Java. Ja, perfekt. Perfekt. So muss das sein. Es wird ja auch besser, aber es hat eigentlich"}, {"id": 724, "start": 5158.44, "end": 5163.88, "text": "nichts mit der Realität zu tun im Jahr 2020. Das ist eh so ein Ding, wo ich sage, durch"}, {"id": 725, "start": 5163.88, "end": 5167.84, "text": "die Bank weg, kriegt man eigentlich in der Schule viel zu wenig erzählt, was man später"}, {"id": 726, "start": 5167.84, "end": 5172.0, "text": "interessantes Wichtiges braucht. Es wird ja immer gesagt, so nach dem Motto, in der Schule"}, {"id": 727, "start": 5172.0, "end": 5181.96, "text": "lernt man fürs Leben und sowas ist kompletter Schwachsinn. So ein paar Sachen zum Thema,"}, {"id": 728, "start": 5181.96, "end": 5186.28, "text": "was muss man machen, um ein Unternehmen in Deutschland zu gründen oder wie macht man"}, {"id": 729, "start": 5186.28, "end": 5191.84, "text": "eine Steuererklärung oder solche Dinge. Hey, sowas sollte man den Leuten auch mal erklären."}, {"id": 730, "start": 5191.84, "end": 5199.96, "text": "Und man lernt in der Schule, finde ich auch nicht mal, weil es jemand gerade geschrieben"}, {"id": 731, "start": 5199.96, "end": 5203.32, "text": "hat, wie man sich Wissen aneignet. Das lernst du vielleicht, wenn du was studierst. Was"}, {"id": 732, "start": 5203.32, "end": 5211.72, "text": "du meistens in der Schule lernst, ist, wie man mit möglichst wenig auswendig Lernen"}, {"id": 733, "start": 5211.72, "end": 5220.44, "text": "so gut es geht, durchkommt irgendwie. Wirklich lernen oder auch Wissen lernen oder so, wirst"}, {"id": 734, "start": 5220.44, "end": 5230.64, "text": "du eigentlich nicht. Man entwickelt der Schule ein Gefühl für, was man sagen soll, was als"}, {"id": 735, "start": 5230.64, "end": 5238.88, "text": "richtige Antwort akzeptiert wird. Mietverträge, ja, solche Sachen. Ich finde, so ein bisschen"}, {"id": 736, "start": 5238.88, "end": 5246.56, "text": "Probleme des alltäglichen Lebens, die auf einen zukommen, sollte man in der Schule mal"}, {"id": 737, "start": 5246.56, "end": 5252.24, "text": "zumindest thematisieren. Wie gesagt, sowas wie, wie miete ich mir eine Wohnung, wie mache"}, {"id": 738, "start": 5252.24, "end": 5256.2, "text": "ich eine Steuererklärung, wie gründet man in Deutschland Unternehmen, worauf achtet"}, {"id": 739, "start": 5256.2, "end": 5264.44, "text": "man so, wie sieht es mit Vermögens, was weiß ich, mit Haus kaufen in Deutschland aus,"}, {"id": 740, "start": 5264.44, "end": 5268.32, "text": "wie sieht es mit Vermögensanlagen in Deutschland aus. Also generell so ein bisschen was, was"}, {"id": 741, "start": 5268.32, "end": 5278.56, "text": "man im Leben auch was von hat. Dann müssen auch die Eltern was beibringen, ja klar. Letztendlich"}, {"id": 742, "start": 5278.56, "end": 5284.2, "text": "kann es den Eltern keiner abnehmen, das zu machen. Aber guck mal, wenn einer acht, was"}, {"id": 743, "start": 5284.2, "end": 5288.52, "text": "weiß ich, wie viele Stunden am Tag, fünf Tage die Woche in der Schule ist, dann ist"}, {"id": 744, "start": 5288.52, "end": 5292.24, "text": "er nicht so viel verlangt, dass dort auch mal ein paar Sachen beigebracht werden, die"}, {"id": 745, "start": 5292.24, "end": 5302.08, "text": "fürs alltägliche Leben später für jeden oder für nahezu jeden relevant sind. Und"}, {"id": 746, "start": 5302.08, "end": 5307.32, "text": "ich sage gar nicht, dass man anderes jetzt gar nicht mehr machen soll, aber vielleicht,"}, {"id": 747, "start": 5307.32, "end": 5311.96, "text": "vielleicht könnte man die ein oder andere Sache ein bisschen zurückfahren. Zum Beispiel"}, {"id": 748, "start": 5311.96, "end": 5317.72, "text": "mein persönlicher Eindruck war, lassen wir jetzt mal Kunst, Musik und sowas mal weg."}, {"id": 749, "start": 5317.72, "end": 5322.92, "text": "Religion, Ethik, lassen wir mal weg. Also gehen wir mal von aus, das behalten wir bei,"}, {"id": 750, "start": 5322.92, "end": 5330.4, "text": "da beschneiden wir nix. Zum Beispiel war Chemie. Chemie war so ein Ding, das hat man viel zu"}, {"id": 751, "start": 5330.4, "end": 5338.28, "text": "viel gemacht für das, was auch nur ansatzweise wichtig ist später. Man hat irgendwelche"}, {"id": 752, "start": 5338.28, "end": 5349.44, "text": "Masse von Atomen und Gedöns berechnet. Das mag durchaus sein, dass das elementare Bestandteile"}, {"id": 753, "start": 5349.44, "end": 5354.44, "text": "unserer Umwelt sind, aber das sind keine elementaren Bestandteile unserer Umwelt, über"}, {"id": 754, "start": 5354.44, "end": 5359.2, "text": "die man für das tagtägliche Leben Bescheid wissen muss. Es ist wichtig, dass man das"}, {"id": 755, "start": 5359.2, "end": 5362.72, "text": "weiß, das sind so grundsätzliche Sachen, wie ist die Welt aufgebaut, wie ist Materie"}, {"id": 756, "start": 5362.72, "end": 5368.52, "text": "aufgebaut. Klar, aber ob man Masse von Atomen und dichte Geschichten, ob man das wirklich"}, {"id": 757, "start": 5368.52, "end": 5374.32, "text": "unbedingt dann alles so im Detail wissen muss, wage ich mal zu bezweifeln. Zumal man das dann"}, {"id": 758, "start": 5374.32, "end": 5377.52, "text": "irgendwie auch in Klassen macht, dass man das später erstens mal weiß, sollte man es"}, {"id": 759, "start": 5377.52, "end": 5382.44, "text": "noch mal brauchen. Und wenn man sich dafür interessiert und man sowas gar so was studieren"}, {"id": 760, "start": 5382.44, "end": 5396.68, "text": "möchte, dann ist es eh egal, ob man das mal an der Schule gehabt hat oder nicht. Ich denke,"}, {"id": 761, "start": 5396.68, "end": 5403.84, "text": "man könnte schon in einigen Bereichen da ein bisschen Platz machen, dass man eben alltägliche"}, {"id": 762, "start": 5403.84, "end": 5411.28, "text": "Sachen lernt, die 90% oder ein Riesenteil der Leute später mal betreffen wird. Und"}, {"id": 763, "start": 5411.28, "end": 5415.6, "text": "das wird in der Schule, finde ich, zu wenig gemacht. Außerdem wird generell in der Schule"}, {"id": 764, "start": 5415.6, "end": 5424.72, "text": "zu viel auswendig gelernt. Religionsunterricht würde ich prinzipiell eh nicht machen, das"}, {"id": 765, "start": 5424.72, "end": 5429.68, "text": "ist ja zum größten Teil auch schon Ethik. Weiß gar nicht, ob es klassische Religionsunterricht"}, {"id": 766, "start": 5429.68, "end": 5446.96, "text": "noch gibt. Ja, auch so biologische Sachen. Da ist auch vieles dabei, wo man sagen will,"}, {"id": 767, "start": 5446.96, "end": 5453.8, "text": "ok, Grundlagen an sich gut und schön, aber gar so im Detail muss man es gar nicht wissen."}, {"id": 768, "start": 5453.8, "end": 5460.76, "text": "Es ist schwierig. Was ich auf keinen Fall will, ist, dass man jetzt sagt, ok, da müssen"}, {"id": 769, "start": 5460.76, "end": 5465.08, "text": "die Leute eben noch länger in die Schule gehen. Das kann ja nicht Sinn und Zweck der Sache"}, {"id": 770, "start": 5465.08, "end": 5468.4, "text": "sein. Noch länger sollen die Leute nicht in die Schule. Wenn es nach mir geht, sollen"}, {"id": 771, "start": 5468.4, "end": 5474.24, "text": "die Leute eher weniger in die Schule gehen. Es kann mir keiner erzählen, dass man wirklich"}, {"id": 772, "start": 5474.24, "end": 5480.0, "text": "was lernt und auch was hängen bleibt, wenn man 12 Stunden am Tag hat. Wie soll denn das"}, {"id": 773, "start": 5480.0, "end": 5484.48, "text": "funktionieren? Und wohlgemerkt, 12 Stunden, die total unterschiedlich sind. Wir hatten"}, {"id": 774, "start": 5484.48, "end": 5494.24, "text": "teilweise Stundenpläne, die gingen bis nachmittags, selten gebe ich zu, aber hatten wir 12 Stunden,"}, {"id": 775, "start": 5494.24, "end": 5508.32, "text": "und das war dann so was wie 4 Stunden Mathe, 2 Stunden Geschichte, Sport, Musik und dann"}, {"id": 776, "start": 5508.32, "end": 5517.24, "text": "irgendwie nochmal hintendran Biologie oder so. Komplett zusammengewürfeltes Zeug. Ja,"}, {"id": 777, "start": 5517.24, "end": 5524.04, "text": "wir hatten einen Tag mit, vielleicht erzähle ich jetzt auch Scheiße. Wir hatten saulang."}, {"id": 778, "start": 5524.04, "end": 5538.76, "text": "Ja, wir hatten auch noch 45 Minuten. Ach ja, mit Stunden, mit Stunden meine ich 45 Minutens"}, {"id": 779, "start": 5538.76, "end": 5551.04, "text": "Stunden, ja. 45 Minutens Stunden. 45 Minutens Stunden, Doppelstunde war 90 Minuten, dann"}, {"id": 780, "start": 5551.04, "end": 5559.6, "text": "gab es Viertelstunde Pause, außer um, ich glaube um 11 gab es dann eine halbe Stunde"}, {"id": 781, "start": 5559.6, "end": 5564.36, "text": "Pause, irgendwie so. Weiß gar nicht mehr genau. Und ich bin mir jetzt eigentlich relativ"}, {"id": 782, "start": 5564.36, "end": 5570.96, "text": "sicher, dass wir an einem Tag in der Woche, in der letzten Klasse, dass wir da 12 Stunden"}, {"id": 783, "start": 5570.96, "end": 5577.36, "text": "haben. Das war irgendwann mittags, mittags 15.30 Uhr oder so war das irgendwie erst fertig."}, {"id": 784, "start": 5577.36, "end": 5591.92, "text": "Lass doch mal ausrechnen. Ja, sind 9 Stunden, passt doch. Das sind 9 Stunden, 9 Stunden Unterricht"}, {"id": 785, "start": 5591.92, "end": 5602.48, "text": "mit Pause. Das ist ein bisschen sehr lang, oder? Aber ich bin mir jetzt, ich kann es"}, {"id": 786, "start": 5602.48, "end": 5605.44, "text": "also ich kann es jetzt nicht beschwören, ja. Aber ich bin mir relativ sicher, dass wir"}, {"id": 787, "start": 5605.44, "end": 5611.56, "text": "einen Tag hatten, das war 12 Stunden und dabei, da kannst du dir doch nichts merken. 6 Stunden"}, {"id": 788, "start": 5611.56, "end": 5617.92, "text": "ist das höchste der Gefühle. 6 Stunden ist das wirklich das höchste der Gefühle, wo"}, {"id": 789, "start": 5617.92, "end": 5627.96, "text": "du auch nur halbwegs aufmerksam sein kannst. Ich fände das viel sinnvoller, wenn es 6"}, {"id": 790, "start": 5627.96, "end": 5635.28, "text": "Stunden wären und dafür 4 Stunden das eine und vielleicht noch 2 Stunden bisschen was"}, {"id": 791, "start": 5635.28, "end": 5644.48, "text": "zum Ausgleich, also dass man irgendwie sowas hätte wie 4 Stunden. Na gut, wir haben angefangen,"}, {"id": 792, "start": 5644.48, "end": 5654.04, "text": "glaub. Wann ging die Schule los? 7.45 Uhr? Ne, das kann nicht sein, dann habe ich Mist"}, {"id": 793, "start": 5654.04, "end": 5659.4, "text": "erzählt. Das kann nicht sein. Das können keine 12 Stunden gewesen sein, weil das wären"}, {"id": 794, "start": 5659.4, "end": 5664.52, "text": "allein schon 9 Stunden, das wären allein schon 9 Stunden bis 17, das kann nicht sein. Ne,"}, {"id": 795, "start": 5664.52, "end": 5668.68, "text": "das muss weniger gewesen sein. Es können keine 12 Stunden und 45 gewesen sein mit Pause."}, {"id": 796, "start": 5668.68, "end": 5675.0, "text": "Egal, scheiß drauf, es war saumäßig lang. Ich fände das viel sinnvoller, wenn man dann"}, {"id": 797, "start": 5675.0, "end": 5679.6, "text": "sagt, ok, es sind 6 Stunden, da kann man sich wenigstens ein bisschen was merken und dann"}, {"id": 798, "start": 5679.6, "end": 5684.08, "text": "hast du aber die Sache wenigstens am Stück wahrgenommen, dann hättest du 4 Stunden Mathe,"}, {"id": 799, "start": 5684.08, "end": 5689.76, "text": "jetzt mal Hardcore-Geschichte gesagt und dann hättest du nachmittags noch 2 Stunden irgendwas"}, {"id": 800, "start": 5689.76, "end": 5693.8, "text": "zum bisschen abschalten im Kopf, sei es eine Doppelstunde Musik oder eine Doppelstunde Kunst"}, {"id": 801, "start": 5693.8, "end": 5698.2, "text": "oder eine Doppelstunde Sport oder irgendwas, das wäre doch eigentlich ganz sinnvoll."}, {"id": 802, "start": 5698.2, "end": 5709.08, "text": "Ja und wie gesagt, ich fände es halt cool, wenn man den Leuten ein bisschen mehr Sachen"}, {"id": 803, "start": 5709.08, "end": 5715.4, "text": "beibringt, die im alltäglichen Leben auch was bringen. Wie gesagt, sei es nur wie das"}, {"id": 804, "start": 5715.4, "end": 5722.44, "text": "mit Steuererklärung, Mietverträgen aussieht, vielleicht auch mal angucken, ok, wie gucke"}, {"id": 805, "start": 5722.44, "end": 5728.4, "text": "ich denn nach einem Ausbildungsplatz, wie gucke ich denn das einzelne Unternehmen an,"}, {"id": 806, "start": 5728.4, "end": 5734.88, "text": "was könnte da was für mich sein, wie gründe ich ein Unternehmen in Deutschland vielleicht,"}, {"id": 807, "start": 5734.88, "end": 5745.48, "text": "es gibt ja zig Themen, die vielen Leuten später was bringen würden. Du warst bestimmt 12"}, {"id": 808, "start": 5745.48, "end": 5754.0, "text": "Stunden aus dem Haus und deshalb macht sich eingebrannt, ja das kann schon sein. Wirtschaft"}, {"id": 809, "start": 5754.0, "end": 5763.2, "text": "und Recht, zumindest ein bisschen, ja genau. Ja, genau. So ein paar Sachen drum herum,"}, {"id": 810, "start": 5763.2, "end": 5768.12, "text": "das wäre echt gut. Und ich hab jetzt schon, weil es hier gerade alle im Chat schreibt,"}, {"id": 811, "start": 5768.12, "end": 5771.92, "text": "diese 30 Beispiele gab es alle bei uns, ich hab das jetzt auch schon von eingehört, dass"}, {"id": 812, "start": 5771.92, "end": 5781.12, "text": "es ein bisschen mehr Einzug hält mittlerweile. Aber ich hab so meine Zweifel, ob das die"}, {"id": 813, "start": 5781.12, "end": 5789.84, "text": "Leute wirklich gut für das Leben, was nach der Schule kommt, vorbereitet. Letztendlich"}, {"id": 814, "start": 5789.84, "end": 5792.8, "text": "die meisten Erfahrungen musst du selbst machen, aber es ist doch nicht verkehrt, wenn du von"}, {"id": 815, "start": 5792.8, "end": 5803.64, "text": "ein paar Sachen schon mal gehört hast. Der größte Jebait, den es bei mir jemals in"}, {"id": 816, "start": 5803.64, "end": 5812.4, "text": "der Schule gegeben hat, war, wir hatten einen Wahlpflichtfach, das hieß selbstständig werden."}, {"id": 817, "start": 5812.4, "end": 5819.36, "text": "Und der Text war schon so geschrieben, als ging es da wirklich drum, so nach dem Motto,"}, {"id": 818, "start": 5819.36, "end": 5823.96, "text": "wie gründet man Unternehmen in Deutschland, was gibt es da so für rechtliche Geschichten"}, {"id": 819, "start": 5823.96, "end": 5828.08, "text": "und so. Und das war halt ein Thema, was mich damals auch schon echt interessiert hat. Da"}, {"id": 820, "start": 5828.08, "end": 5831.68, "text": "hab ich mir gedacht, okay, meldest du dich dafür an. Und wisst ihr, was wir gemacht"}, {"id": 821, "start": 5831.68, "end": 5837.04, "text": "haben, was die mit selbstständig lernen gemeint haben? Wir haben kochen gelernt. Die haben"}, {"id": 822, "start": 5837.04, "end": 5844.32, "text": "einen Wahlpflichtfach angeboten, was sich gelesen hat nach ein bisschen minimal BWL"}, {"id": 823, "start": 5844.32, "end": 5849.92, "text": "und rechtliche Geschichten und auch vom Text her und vom Titel her und am Ende hat man"}, {"id": 824, "start": 5849.92, "end": 5857.64, "text": "gekocht. Nicht, dass es jetzt wahnsinnig schlecht wäre, ein bisschen kochen zu lernen, aber"}, {"id": 825, "start": 5857.64, "end": 5862.36, "text": "der Jebait war, dass es komplett anders verkauft wurde. Ich fand das am Ende gar nicht schlecht."}, {"id": 826, "start": 5862.36, "end": 5866.44, "text": "Da haben wir Kekse gebacken und sonst was, das waren auch die letzten zwei Stunden am"}, {"id": 827, "start": 5866.44, "end": 5870.88, "text": "Tag, da kann ich mich noch dran erinnern. Wahlpflichtfach, ja, sowas hatten wir, also"}, {"id": 828, "start": 5870.88, "end": 5874.84, "text": "ich, du musst, du hattest irgendwie, keine Ahnung, vier Stunden in der Woche, da musst"}, {"id": 829, "start": 5874.84, "end": 5881.84, "text": "du dir dann aussuchen, was du machen willst. Und ich fand das mit kochen gar nicht mal"}, {"id": 830, "start": 5881.84, "end": 5886.8, "text": "schlecht, weil wir haben dann Kekse gemacht und solche Sachen und ich fand es aus so"}, {"id": 831, "start": 5886.8, "end": 5890.68, "text": "fern nicht schlecht, weil das waren die letzten zwei Stunden, da hat man sich immer was zu"}, {"id": 832, "start": 5890.68, "end": 5894.4, "text": "essen gemacht und ordentlich gefressen, bevor man nach Hause gegangen ist. Meine Oma hat"}, {"id": 833, "start": 5894.4, "end": 5898.64, "text": "sich immer gewundert, warum ich nichts mehr zu essen wollte. Vielleicht warst du einfach"}, {"id": 834, "start": 5898.64, "end": 5905.04, "text": "im falschen Raum, ja man weiß nie genau. Das war noch, ich fand es gar nicht schlecht,"}, {"id": 835, "start": 5905.04, "end": 5908.96, "text": "was ich aber richtig jebaited fand, war halt einfach, dass die das uns anders verkauft"}, {"id": 836, "start": 5908.96, "end": 5916.04, "text": "haben und das hat mich bis zum Schluss übelst angepisst. Sport war immer easy, auch wenn"}, {"id": 837, "start": 5916.04, "end": 5923.72, "text": "man pepo fett war. Ja, damals war ich noch nicht pepo fett, damals war ich ziemlich"}, {"id": 838, "start": 5923.72, "end": 5932.56, "text": "sportlich. Ich hab nie Strecken gemessen und sowas, aber ich weiß, dass ich teilweise"}, {"id": 839, "start": 5932.56, "end": 5937.52, "text": "mehrere Kilometer geschwommen bin und auch rennen konnte, ohne dass ich irgendwie großartig"}, {"id": 840, "start": 5937.52, "end": 5941.8, "text": "aus der Puste kam, also sprich heute, wenn ich mal Gas gebe und über den Bahnübergang"}, {"id": 841, "start": 5941.8, "end": 5953.52, "text": "renne, denke ich mir so, war aber anstrengend. Captain Peng, das haben wir in diesem Kochen"}, {"id": 842, "start": 5953.52, "end": 5970.04, "text": "Kurs auch gemacht. Wir haben auch ein bisschen was genäht. Naja, gut, also es ist 22.00"}, {"id": 843, "start": 5970.04, "end": 5975.12, "text": "und ich muss ins Bett. Spontaner Stream heute gewesen. Außerdem schön, dass viele am Start"}, {"id": 844, "start": 5975.12, "end": 5985.12, "text": "waren. Wir sehen uns, machts gut, bis morgen, oder so, see you."}]}