{"text": "Das war's für heute. Bis zum nächsten Mal. Das war's für heute. So, moin Leute. War heute anstrengend wieder. Massiv anstrengend. Ich hab den Allemtag aufgeräumt, ich hab ganz viel Zeug gefunden, von dem ich gar nicht wusste, dass ich das noch habe. Unter anderem, viel zu viele VGA-Kabeln. Ich wusste gar nicht, dass ich im Besitz von so vielen VGA-Kabeln gewesen bin. Weil ich hab in der Kiste stehen, was ich da für einen ollen Scheiß gefunden hab, das könnt ihr euch auch nicht vorstellen. Also schmeiß ich alles weg, ja. Aber da ist so viel Legacy-Technologie in einer Kiste, das könnt ihr euch ja nicht vorstellen. Mich eine ganze Kiste voll von THE-Stecker bis kaputtenes Xbox-Kabel. Diese alten Stecker für die Wii mit so drei Farben dran. Kaputtener uralt Kopfhörer, da wirklich Zeug drin. DVI-Kabel in Massen. Ich wusste gar nicht, dass ich so viele DVI-Kabel hab. VGA-Kabel in Massen. Sattkabel, also ohne Scheiß. Also was ich da für einen Dreck rumliegen habe, ist der Wahnsinn. Zumindest, ich hab alles bisschen ausgemistet. Ich hab auch alte Grafikkarte gefunden. Eine 980, ne. Was für eine ist das? Die 980 kann das sein. Es muss viel älter sein. Steht das da drauf? Was ist das für eine Grafikkarte, die ich hier gefunden hab? Die ist ziemlich fett. Steht da irgendwie drauf, was es ist? Irgendeine Nvidia-Karte ist das. Was steht da drauf hier? Made in China. Ne. Modell steht da drauf. P348. Keine Ahnung, was für eine Grafikkarte ist. Ist aber eine recht fette Grafikkarte. Allerdings ist die so alt. Die hat nur zwei DVI-Ausgänge und ein S-Video-Ausgang. Die scheinen schon ein bisschen älter zu sein. Also damit ist nichts mit Krypto-Mine oder sowas. Steht gar nicht drauf, was das für eine ist. Egal. Kommt alles in Müll, Leute. Alles in Müll. Aber ich hab auch ein paar gute Sachen gefunden. 9800. Ja, das kann tatsächlich sein, so was in der Richtung. Also, ich hab auch wirklich Zeug gefunden. Das ist gar nicht so schlecht, dass ich das mal gefunden hab. Guckt mal hier, was ich gefunden hab. Hab ich heute gepostet auf Twitter? Nein, das bin ich nicht. Das ist meine Katze, was auch immer, wenn er alles findet. Ich hab einen von zwei Super Nintendo-Controllern gefunden. Bester Controller ever. Warum kann Windows dieses Emote nicht? Was ist das überhaupt für ein Emote? Das da, warum kann Windows das immer noch nicht? Ecke. Ah ja. Quadro ist es bestimmt nicht. Und, ihr werdet es nicht glauben, ich hab meine PS Vita gefunden. Guck mal. Bisschen staubig, gebe ich zu. Die hatte ich drei, vier Mal an, wenn es hochkommt. Ich hab auf Twitter zweimal geschrieben. Wahrscheinlich stimmt das eher. Ich hatte die so gut wie gar nicht an. Was mache ich denn damit jetzt? Leute, habt ihr eine klare Idee? Die ist wirklich wie neu. Die ist komplett neu. Außer, dass sie staubig ist. Der Rest ist wirklich wie neu. Aber was mache ich damit jetzt? Also, ich meine, ist das jetzt so, als könnte man damit großartig was anfangen? Ja, Customfirma. Ich weiß, dass es da für Customfirma und was sich Homepro gibt. Aber was gibt es da drauf schon, was man wirklich haben will? Also, wisst ihr, wie ich meine? Es ist ja cool, dass man alles drauf macht, dass man vieles drauf machen kann. Das ist so, wie es cool ist, was man mittlerweile mit der Wii alles machen kann. Aber was will man damit machen? Also, was hat man davon? Ja, darauf kannst du SNES Zeug emulieren. Aber wozu? Warum will ich das? Will ich ja nicht. Wo ist der Sinn? Retroarch für unterwegs. Ja, gut. Ja, dafür ist es tatsächlich gar nicht so blöd. Das stimmt schon. Da fällt mir jetzt aber eher sonst nichts Vergleichbares ein. Da bräuchte ich sonst ein Steam Deck oder sowas. Aber das ist halt ein bisschen fett für unterwegs. Ja. Aber guck mal, hat einfach schon mal 20 Antworten. Ach ja, und ich habe noch ein IDE-Kabel gefunden, wusste ich gar nicht. Leute, ein Marken-IDE-Kabel. Nicht einfach nur ein IDE-Kabel. Ein ASUS oder besser gesagt ein ASUS-IDE-Kabel. Aber nicht einfach nur ein CD-ROM-Kabel, bitte schön. Ich habe so viel altes Zeug heute ausgebundelt. Das meiste habe ich komplett direkt einfach in die Tonne gefeffert. Ich habe glaube ich heute eine halbe Tonne an Elektroschrott. Also nicht Tonne meine ich jetzt nicht das Gewicht, sondern eine Mülltonne. Eine halbe Mülltonne voll mit Elektro-Kram und Plastik-Zeug. Na ja, was heute so ansteht. Ich bin genau ungefähr eine Stunde on oder eineinhalb Stunden. Das war es. Wir können auch nicht allzu viel machen. Wir können vielleicht ein bisschen schwätzen und ein paar Sachen angucken über aktuelle Ereignisse und auslassen, falls es da irgendwas gibt. Oder ihr könnt mir sagen, was ich mit meiner PS Vita machen soll. Battlefield spielen wir heute nicht. Ein bisschen kleines Ticken. Warum sind eigentlich alle Anwendungen mittlerweile so scheiße und an Tablet-Bedienung angepasst, dass sie einfach nur sacken für alles andere. Ich meine, guck mal, ich habe eine super feine Maus-Auflösung. Das ist überhaupt kein Problem. Aber ich kann diesen Kack-Slider, diesen Kack-Slider nur so bewegen, dass er entweder zu laut oder zu leise ist. Was denkt man sich dabei? Warum macht man seine Anwendung so kacke? Das liegt eigentlich nur daran, dass dieser ganze Krempel ordentlich auf Smartphones und Tablets funktioniert und Desktop interessiert wirklich kein Sau mehr. So, ich muss mal kurz dieses Plugin wieder einschalten. Warum habe ich das eigentlich disabled? Volume Master, genau, das brauche ich. Volume Master. Da kann ich jetzt nämlich so runterstellen, dann geht das wieder gescheit. Richtig hängen geblieben. Ja, jetzt ist die Lautstärke genau richtig. Das ist wieder ein richtiger Mobile-Crap alles. Noch schlimmer, bloß, wenn das Ganze dann auch in der Elektron-Anwendung verpackt ist. Pfeil-Taste hoch und runter ist ja noch cooler. Sorry, vor Basch, Dankeschön für den Sub. Nee, nee, heute nicht. Hat Max eigentlich Only-Fans? Nee, kein Only-Fans, ich habe nur Fansli. Ich sage Only-Fans, ich benutze nur noch Fansli. Wahrscheinlich nicht gut genug, nee. Nicht nur gut genug, dafür gehe ich mal von aus. Ja, das ist normal. Ich weiß nicht, ob ich... Doch, habe ich, habe ich erzählt. Meinem Chef, also meinem aktuellen Chef wurde tatsächlich auf YouTube mein Schnee-Video empfohlen. Also durch den, durch den Schneestell-Video. Ziemlich cringe. Aber irgendwie ein bisschen merkwürdig gewesen, als der mir das erzählt hat. Ich hatte ein Video von mir gesehen, wo ich durch den Schnee gelaufen bin. Hab ich mir gedacht, oh nein, das ist bei dir jetzt auch schon so weit gewesen, ja. YouTube hat dir mein Schnee-Video empfohlen. Ich verstehe nicht, warum dieses Video... Seriously, warum wird dieses Video empfohlen? Ich verstehe es nicht. Ich habe keine Ahnung, Alter. YouTube... Muss man nicht verstehen, oder? Muss man echt nicht verstehen. Quatsch, die meisten Leute... Okay, okay, vielleicht habe ich die meisten Leute mal gesehen durch dieses Video. Wer abonniert und regelmäßig guckt, tut durch dieses Video so gut wie niemand. Warum auch? Ich meine, niemand, der mich vorher nicht kannte, bzw. die Videos und den Content nicht kannte und dem das Schnee-Video empfohlen würde, hat sich nach dem Schnee-Video gedacht, oh ja. Den Max, den muss ich mir öfters angucken. Die Leute haben... Das Schnee-Video hat, glaube ich, mit die kürzeste View-Time überhaupt bei mir auf dem Channel. Das hat irgendwie 35 Sekunden View-Time von 7 Minuten oder so. Normalerweise habe ich irgendwie 50-60% der Video-Länge View-Time oder teilweise mehr. Bei kürzeren Videos ist es tatsächlich oftmals sogar höher, weil die Leute halt eben länger durchhalten. Also, prozentual. Aber dort, ich meine, ich kann es verstehen. Wer will sich das auch angucken? Das ist vielleicht für Leute damals interessant gewesen, als ich noch die ganzen Baustellen-Videos ab und zu gezeigt habe. Aber das ist auch schon 10 Jahre her fast. Sag mal, ist das irgendwelche Bots? Also, ich meine, Darkseid, du bist kein Bot, das weiß ich, weil du bist öfters hier, aber... Diese Fragen... Ich habe langsam das Gefühl... Es gibt echt irgendwelche Bots, die das fragen. Das kommt jeden Stream bestimmt fünfmal diese Frage, ob ich Seven vs. Wild gucke. Nee, gucke ich nicht. Ich habe auch die erste Staffel nicht geguckt. Und ich muss auch ehrlich sagen, interessiert mich auch überhaupt nicht. Keck B, genau. Und weil ich da sein muss, Keckl ist das bessere Emote. Vodafone hat heute eine Umfrage gemacht auf Twitter, wo es darum ging, ob die Leute wissen, was Scam bedeutet. Und da wollte ich eigentlich drauf fragen... Weiß ich, ja, nicht jetzt... Oh Gott, Twitter, man. Da wollte ich eigentlich drauf antworten... Unity Media hat mich mal gescampt. Mir wurde versprochen, ich bekomme eine richtige IPv4-Adresse weiterhin und hatte auf einmal Dual-Stack-Lite. Und damit man das beheben konnte, bezahle ich jetzt doppelt Power-Upload. Obwohl ich eigentlich nur einmal Upload bekomme. Aber ich bezahle es trotzdem doppelt. Und ich traue mich nicht daran, was zu ändern, weil ich sonst wieder Dual-Stack-Lite vielleicht bekomme. Warum hat Vodafone noch das Pride-Empflecht? Sind sie Super Pride? Keine Ahnung. Kappa Pride. Ja, genau, diese komische Umfrage hier meine ich. Ja, Vodafone hat mich gescampt. Damals aber noch Unity Media. Scam, was ist das? Ach nee, man darf hier nicht abstimmen, wenn man nicht eingeloggt ist. Wann eigentlich noch... Ach ja. Da weiß ich nicht, soll ich da was zu erzählen? Ich war in Würzburg. Und da war ich zum Vorstellungsgespräch in Würzburg. Und ich will jetzt nicht glauben... Nee, das erzähle ich im Video, Leute. Das erzähle ich im Video. Ich will jetzt nicht spoilern, ihr müsst euch dann alle morgen das Video angucken. Das Video kriegt aber so einen richtig krassen Titel, so nach dem Motto Neuer Job Oder Vorstellungsgespräch direkt verkackt oder irgendwie sowas oder Bewerbung Zukunft ruiniert oder Irgendwie sowas in der Richtung. Das braucht so eine richtige Hand. Aber ihr wisst ja... Leute, ich verrate euch jetzt mal den besten Trick Für Clickbait-Thumbnails. Macht einfach... Oder auch für Titel. Also, dass ihr was lernt, so wie das auf YouTube funktioniert. Korrekt. Ihr macht einfach Fragezeichen in den Titel. Also entweder ihr macht in den Thumbnail ein Fragezeichen Oder ihr macht in den Titel ein Fragezeichen. Weil dann könnt ihr in das Thumbnail und in den Titel das eine schreiben Und im Video was komplett anderes behaupten. Oder was komplett anderes sagen. Und wenn dann einer sagt, aber im Titel steht doch ganz was anderes Dann kannst du sagen, ne, im Video, Titel ist ein Fragezeichen. Alter, Sixhead-Titel, das muss ich mir aufschreiben. Bald... Der beste Titel, Alter. Das mach ich morgen als Titel, Alter. Neuer Job, Vorstellungsgespräch verkackt. Bald Arbeitslos. Das ist der beste Titel, Alter, das muss ich mir aufschreiben. Das hab ich mir jetzt aufgeschrieben. Irgendwas in der Richtung, irgendwas... Irgendwas baue ich da draus. Bald drogenabhängig. Hey, dazu mach ich noch ein eigenes Video. Ich hab euch ja schon ein paar mal die Story erzählt, wo ich quasi einen halben Tag quasi drogenabhängiger war. Also nicht wirklich. Wo die Frankfurter Drogenabhängigen dachten, ich bin einer von ihnen. Das hab ich euch ja schon ein paar mal erzählt. Das müsste ich eigentlich auch mal in Video verkacken. Verpacken, nicht verkacken. Das ist einfach so eine kurze Geschichte eigentlich. Da kann ich kein eigenes Video draus machen. Da muss ich noch ein paar andere Sachen dazu erzählen. Vielleicht mach ich ja irgendwie so Frankfurt-Story. Immer so ein, zwei Sachen. Weil ich hab da schon wirklich ganz viel merkwürdiges Zeug. Der eine, der seine Bekannte überfallen hat in Frankfurt, wo ich mir auch dachte, was zum Teufel ist, wo der euch los? Frankfurt Hauptbahnhof einfach anderer Planet. Ich fand Sariks Titel besser, weil arbeitslos. Wen juckt Bürgergeld? By the way, wen juckt Bürgergeld? Wisst ihr, was anscheinend auch keinen juckt? Die ganze Geschichte mit dem 49-Euro-Ticket. Ich hab heute gelesen, 49-Euro-Ticket soll erst im Mai kommen. Und können ihr euch dran erinnern, was ich die letzten Monate über immer gesagt hab, auch schon im Stream? Was hab ich gesagt? Wer erinnert sich? Mehrfach. Ich hab gesagt, ich glaube nicht dran, dass dieses Ticket nächstes Jahr kommt. Und dann habt ihr gesagt, doch, doch, das ist doch schon alles bestimmt worden und das ist doch schon alles beschlossen. Leute, bis ich das Ding nicht in der Hand halte, glaube ich da an nichts. Die werden es irgendwie verkacken. Und auf diesem Standpunkt bleibe ich. Und das hat man jetzt gesehen. Die Anfänge davon sind schon wieder am Start. Mai. Alter, was kriegen die eigentlich gebacken? Was kriegen sie gebacken? Kannst ja Coop mit dem Held machen. Hä? Ach. Jetzt weiß ich, was du meinst. Ja, weil der auch aus Frankfurt kommt. Der kennt mich nicht, ich kenn ihn nicht. Ich muss die Leute zum Coop, zum Coop schon kennen. Und wieder Hachi Baited. Leute, ich verstehe es nicht, wie sie das nicht auf die Reihe kriegen. Ich meine, es ist schon bitter genug, dass es keinen direkten Nachfolger gab. Anschließend direkt an das 9-Euro-Ticket. Dass es 9 Euro eigentlich viel zu wenig waren. Das, ja. Okay, 49 finde ich okay. Ganz ehrlich, 69 hätte ich auch noch okay gefunden. Ich meine, das Monat-Ticket von 69. Das Gute an diesem 49-Euro-Ticket ist ja, es ist Zug und Bus. Und es ist halt deutschlandweit. Leute, das Beste, ganz ehrlich, das Beste, das ist doch die Leute, die mit dem Auto fahren wollen. Also du wirst wahrscheinlich keinen vom Gegenteil überzeugen, ob 49 oder 9 Euro. Das denken vielleicht die, die sich irgendwo festkleben oder so. Habe ich heute auch schon auf Twitter gelesen, dass die sich darüber aufregen. 49-Euro-Ticket viel zu teuer. Ganz im Ernst, ob das jetzt 49 Euro oder 9 Euro kostet. Jemand, der gerne Auto fährt, dem ist das doch wurscht, ob das jetzt 49 oder 9 Euro. Der wird beides, wird der nicht benutzen. Selbst wenn es wahrscheinlich umsonst so wäre, würde das nicht machen. Aber wisst ihr, was das eigentlich wirklich Gute ist am 49-Euro-Ticket? Das ist, dass du dich in Deutschland nicht mehr mit diesem ganzen Tarifverbund und Verkehrsverbund shit befassen musst. Die Musik ist unterschiedlich laut, das nervt mich. Zack. Ich mach mal ein bisschen was anderes an. Mach mal nochmal Dings hier. Crypt of the Necro Dancer Soundtrack. Der ist gut. Ja, das Beste ist, dass du dich mit diesem 49-Euro-Ticket nicht mehr mit Verkehrsverbünden und Nahverkehr, und gilt das in der Bahn, gilt das auch für den Nahverkehr in der Stadt. Du musst dich einfach mit nichts mehr beschäftigen. Du kaufst dir so ein Ticket und fährst einfach in Deutschland rum, wie du lustig bist. Fertig. Ich kann mich noch dran erinnern, als ich mit dem Felix damals zur Gamescom gefahren bin. Also zur ersten Gamescom, wo wir hingefahren sind zusammen. Da sind wir in Köln angekommen und wollten uns so eine Wochenkarte kaufen. Also was macht man? Man geht an den Automat, drückt auf Wochenkarte und dann kommt eine Karte raus. So weit so gut. Da kam eine Karte raus und unten auf dieser Karte stand drauf, also wir haben bezahlt, es kam eine Wochenkarte raus und unten auf der Wochenkarte, nachdem wir bezahlt hatten auf diesem Ticket, stand drauf, nur gültig mit, frag mich nicht, Kölner Verkehrsverbundsnummer oder sowas in der Richtung stand da drauf. Da haben wir uns eingeschaut, haben gesagt, wir haben eine Wochenkarte, wir haben dafür bezahlt, aber jetzt steht auf der Karte drauf, die wäre nicht gültig? Was ist das denn? Okay, sind wir dort in dieses komische Infocenter gegangen und haben der Frau das gezeigt und die hat sich diese Karte angeguckt. Also wohlgemerkt, das ist eine vom Kölner Verkehrsverbund, die müsste das eigentlich wissen, hat sich diese Karte angeguckt und hat gemeint, das kann ich ihnen jetzt aber auch nicht sagen, was das da drauf macht. Aber sie können von uns so eine Karte haben, da müssen wir das hier ausfüllen. Nein, wir wollen nicht Köln Verkehrsverbund Mitglied werden, wir wollen einfach mit unserer Wochenkarte fahren, die wir gerade aus dem Automat geholt haben. Okay, sind wir raus, haben es dem Busfahrer gezeigt, haben den Busfahrer gefragt, ja wissen Sie, wofür ist denn jetzt eigentlich dieses Feld da unten? Meint der Busfahrer, keine Ahnung, steigt einfach ein und es hat danach nie jemand wieder gefragt. Aber warum ist das überhaupt ein Ding? Warum steht da überhaupt sowas drauf? Warum ist das einfach alles von inkompetenten Kackspasten gemacht in Deutschland, sowas? Wie dumm kann man sowas eigentlich gestalten? Das ist doch nicht von Menschen für Menschen gemacht, das ist einfach von irgendwelchen hirnlosen Leuten, die den Scheiß selbst nicht benutzen müssen gemacht. Und das ist an ganz vielen Stellen so. Und das hat mich so aufgeregt, wo ich mir gedacht habe, das kann doch nicht sein, das steht drauf, das ist nicht gültig und du sollst jetzt trotzdem damit fahren, obwohl drauf steht, dass es nicht gültig ist. Ähm, das, das, deswegen. Und das Gute ist, das Gute, das ist das wirklich Gute an diesem 49 Euro, es hat ja wirklich keinen interessiert, ob wir da so eine Nummer hatten oder nicht. Kannste ja, ist ja auch besteuert. Wäre ihr auch überhaupt nicht gültig, nachdem du es gekauft hast, nachdem du es bezahlt hast, zu sagen, ach nö, ihr habt es bezahlt, aber jetzt ist es doch nicht mehr gültig. So, aber das ist das, das ist wirklich das Gute am 49 Euro Ticket. Du kaufst dir so ein Ticket, du steigst irgendwo ein, du fährst innerhalb Deutschland irgendwo hin und das ist gut. Ich bin zum Beispiel nach Würzburg gefahren, am Montag. Und es ging ohne weiteres erstmal gar nicht. Also ich hätte mit meinem normalen RMV-Ticket, also ich hab ja so ein RMV-Ticket, da nicht hinfahren können, weil das nicht Bestandteil vom RMV ist. Ich kann mit meinem Ticket nur im gesamten RMV-Gebiet fahren. Ich kann nicht außerhalb des RMV-Gebiets fahren, das heißt Würzburg geht nicht, weil Würzburg ist Bayern. Das ist zu geil, oder? Zumindest, was hab ich gemacht? Logischerweise, ich hab kein normales Bayern-Verkehrsticket gekauft, weil das normale Bayern-Verkehr, also das normale Fahrt-Ticket für den RE hätte 26 Euro einfach gekostet. 26 Euro von Hanau nach Würzburg, einfach 26 Euro gekostet. Alter, nee oder sogar 36 oder so. Total bescheuert. Fährt niemand. Was hab ich gemacht? Ich hab mir ein Bayern-Ticket geholt für 25 Euro oder 28 Euro oder so. So, und da bin ich ein paar Stationen gefahren mit meinem RMV-Ticket. Nee, hatte ich keinen Bock. Da bin ich ein paar Stationen gefahren mit meinem RMV-Ticket bis zur Grenze von Bayern. Und dann hab ich das Bayern-Ticket benutzt. Und ihr werdet es nicht glauben, aber das Bayern-Ticket ist gültig ab 9 Uhr. Ratet mal, und das ist kein Spaß, Leute, ich erzähl euch jetzt keinen Mist. Das Bayern-Ticket ist gültig ab 9 Uhr. Ratet mal, um wie viel Uhr ich kontrolliert wurde, wo einer vorbeigekommen ist. War kurz nach Hanau, war kurz nach Hanau. Ja, so in dem Dreh. 8.59 Uhr. Aber glücklicherweise hat sie nicht interessiert. Ich hab ihm mein RMV-Ticket gezeigt und hab ihm das Bayern-Ticket gezeigt. Da hat das gescannt und gut war. Ich hab schon gedacht, jetzt kommt wieder irgendwas. Ich dachte schon, wahrscheinlich beschwert er sich jetzt. Warte mal eine halbe Minute, dann können wir noch mal kontrollieren. Ja, aber es ist ja gut, dass es so was wie ein Bayern-Ticket gibt. Mit dem Bayern-Ticket konnte ich dann quasi komplette Strecke fahren, hin und zurück. Und dort noch Bus und sonst was in der Richtung. Das ist gut, das ist quasi, das 49-Euro-Ticket ist quasi ein Bayern-Ticket nur für ganz Deutschland ein bisschen teurer. Und dafür ist das gut, dass man sich nicht mehr mit diesem ganzen wirren und durchschaubaren regionalen Verkehrsverbundsshit befassen muss. Also dort in Würzburg ging es mit dem Bus. Kann sein, dass es nicht überall in Bayern ist. Aber es gilt zum größten Teil auch für Busse und für Würzburg gilt es. Bayern-Ticket gilt halt für Busse auch nur dort, wo der jeweilige Verkehrsverbund dann wiederum mitmacht. Es ist halt, es ist halt wir. Ganz im Ernst, erklär das doch mal irgendeinem Tourist, dass wenn er von Frankfurt nach Köln fährt, dass er sich da irgendwie zwei bis fünf verschiedene Tickets kaufen muss. Neun Euro kann man sich blind kaufen. Ja, das stimmt schon. Es würde bestimmt, du hast insofern schon recht, ich denke auch, es würde schon dazu führen, dass ich potenziell noch ein bisschen mehr kaufen würde. Aber das sind ja auch Leute, die normalerweise schon nicht abgeneigt sind, den Bahn fahren. Jemand, der wirklich gerne Auto fährt und täglich mit dem Auto fährt und da nicht irgendwie überlegt, ah, ich würde eigentlich gerne, guck mal, wie viele Leute gibt es denn, die täglich wirklich Auto fahren, aber sagen, ha, ich würde ja eigentlich lieber Zug fahren, aber das ist mir zu teuer und wenn es jetzt anstatt 49 kosten würde, dann würde ich auf das Auto verzichten. Ich will nicht sagen, dass es da keine gibt. Aber die wenigsten, die wenigsten werden es sein. Paar Prozent vielleicht. Und die, die das machen, die freuen sich auch über 49 Euro Ticket. Das ist zwar kein, weder mit 9 noch mit 49 Euro, du kriegst zwar kaum einen weg vom Auto damit, aber es ist die eigentlich gute Sache, dass du diesen ganzen Verkehrsverbund nicht mehr machen musst. Ja und es entlastet die Leute, die täglich zur Arbeit pendeln. Ja. Ich war billiger als das Auto, ist es definitiv 49 Euro im Monat. Was bezahlst du denn heute für einmal tanken? Musik geht wieder ab hier. Genau, das wäre für dich auch egal, ob 9 oder 49. Siehst du? Also lohnt sich das für 49 auch? Sieg eskaliert gerade wieder. Ich mach noch mal einen. Ich meine, versteht mich nicht falsch. Es wäre jetzt auch besser, wenn es 9 Euro statt 49 kosten würde. Aber für mich ist das schon eine sehr gute Geschichte, dass es 49 Euro kostet. Und wie gesagt, das Beste ist, ich würde es auch für 69, also 69 wäre eh die bessere Zahl dafür gewesen. Ich persönlich finde es mit 49 Euro schon gut, dass du dich nicht mehr damit beschäftigen musst und dass du einfach den Kram kaufen kannst und gut ist. Was machen die Leute im Zug eigentlich alles? Ich hatte auch im Rückblick von Würzburg einen nervigen Typ drin. Das war Araber oder so. Der hat, der hat keine Ahnung mit seiner Frau in Katar oder so telefoniert. Ich weiß es nicht, aber da hatte das Handy laut. Das war ätzender. Hat die Kinderschrein gehabt im Hintergrund und sowas. Ich verstehe es nicht. Vielleicht ist es dort ja normal, dass man das Handy auf laut stehen hat. Und es ist mittlerweile auch hier oft genug so, dass die Leute ihr Handy auf laut haben. Aber Alter, meine Güte, ging mir das auf den Sack wieder. Zum Glück habe ich meine Noise Cancelling Kopfhörer. Das war eines der besten Investitionen überhaupt. Noise Cancelling Kopfhörer. Sowohl wenn man seine Ruhe haben will auf der Arbeit als auch im Zug. Noise Cancelling Kopfhörer sind das Beste. Jetzt geht es wirklich schäber richtig. Leute, ich hatte schon, ich hatte schon Typen. Was heißt denn hier Typen? Ja, Leute. Leute schon im Zug. Was die, was die sich erzählt haben. Ich hatte mal eine im Zug, die erzählt hat so nach dem Motto. Ja, gestern hat sie der Kell wieder schön geknallt und sowas in der Richtung. Richtig schön durchgeknallt. Bin ich jetzt beim Asitoni gelandet oder was? Wo sind wir denn hier? Macht was ihr wollt. Ihr müsst aber noch nicht den ganzen Zug mitteilen. Aber ich glaube den Leuten ist das gar nicht so klar. Die sind im Kopf irgendwie so privat, aber sie sitzen halt mitten im Abteil. Ich bin in Freiburg überall anders auch so. Ich bin schon in vielen Teilen Deutschlands Zug gefahren. Das ist eigentlich überall ähnlich. In Frankfurt, das Problem, dass du in Frankfurt bist, merkst du eigentlich erst, wenn du aussteigst. Wenn du am Hauptbahnhof aussteigst oder wenn du generell, wenn du in Frankfurt aussteigst, dann merkst du erst so richtig, dass du in, dass du in Frankfurt bist. Ah ja. How to build a custom TCP Server in Golang. Ich würde empfehlen am besten gar nicht. Wobei doch gerade für sowas ist Go eigentlich relativ gut. Besser als C++. Ja, da hast du schon. Angeben hatte ich auch. Das habe ich glaube ich sogar auf Twitter geschrieben, als ich den Typ in der Bahn hatte. Angeben hatte ich auch einen. Der hat doch irgendwas erzählt, das letztens bei ihm in der Shisha Barazja war. Überlegt mal. Also ganz im Ernst, wenn das stimmt, wäre das doppelt blöd, das im Video zu, nicht im Video, am Handy zu erzählen. Der hat erzählt, in seiner Shisha Bar war wieder Razja. Weil wir sind halt in Frankfurt. Was ist das? Okay, das kommen wir uns gleich, kommen wir uns gleich an. Ja, so super krasse Business Leute hast du überall. Schau dir das mal an. Nee, jetzt nicht. Das ist jetzt nichts, was mich beschäftigen will im Stream. Bam, bam, bam, so sieht es aus. Nee, ich weiß auch nicht, was mit denen alles los ist. Das ist echt nicht mehr normal. Ja, aber sag mir doch mal jetzt, was ich mit meiner PS Vita machen soll. Ich weiß jetzt nicht, wie wir da von der PS Vita eigentlich drauf gekommen sind, oft das was ich euch jetzt erzählt habe. Aber sag mir doch mal, was ich mit meiner PS Vita machen soll. Also diese Emulationsgeschichte habe ich ja am Anfang erst mal gedacht, ist blödsinnig. Wer braucht sowas? Ein Emulator kann ich überall, aber ganz ehrlich, wenn man wirklich mobil die ein oder anderen Sachen spielen will, ist die Vita wahrscheinlich dafür gar nicht so schlecht. Weil was gibt es sonst noch? 3DS vielleicht? Weiß ich, ob der 3DS komplett geknackt ist mittlerweile? 3DS habe ich übrigens auch noch rumfliegen. Habe ich auch nur zweimal angehabt. Hat noch nicht mal WLAN Einrichtung, glaube ich, hinter sich. Weiß ich auch nicht, teilweise habe ich schon übelst unsinnigen Mist gekauft. Ich könnte das wirklich, das ist eigentlich gar nicht schlecht, das Teil in Rucksack schmeißen, dass ich was zu spielen habe im Zug. Besser als irgendwelche kack Handy Games. Handy Games ist ja wirklich das allerletzte. Ja, Steam Deck ist halt das Problem. Steam Deck ist halt auch viel größer. Wisst ihr, was meine zwei Top Games im Zug waren, jahrelang? Auf dem DS, auf dem DS. Das erste ist Mario Kart DS. Was war das Mario? Ich glaube, es hieß sogar Mario Kart DS. Habe ich alles durch, alles auf drei Sterne, sonst wie? Mario Kart DS. Und das andere, jetzt lacht ihr mich wahrscheinlich aus, Cooking Mama DS. Bestes Game. Leute, da habe ich bestimmt 100 Spielstunden oder so drinne. Das ist Catchy Bay, das ist echt, da habe ich massig viele Spielstunden drinne. Cooking Mama. Hey, das war quasi Mobile Game ohne den ganzen Mobile Shit. Überlegt euch mal, ihr würdet sowas auf dem Handy spielen, dann könntet ihr nach der dritten Reisdose, müsstet ihr irgendwelche komischen Diamanten, Juwelen und Goldstücke zum Anlocken kaufen. Das ist halt, im Prinzip ist das eine Mini-Spiele-Sammlung mit Thema Kochen. Hat mit Kochen ja gar nichts zu tun. Ja. Cooking Mama. Ja, genau. Schnitzelrollen. Gibt es da Speedruns? Bestimmt, bestimmt. Bestes, bestes Game für im Zug, nehmen wir ein Beispiel, Cooking Mama. Also ich habe bestimmt, wie gesagt, bestimmt 100 Stunden plus in Cooking Mama. Ich habe, wie gesagt, Mario Kart DS und Cooking Mama. Das war das Hauptsächliche, das, was ich gespielt habe. Auf dem DS, auf dem Heimweg und morgens. Mein DS habe ich auch noch am Start. DS aber nur mit so einer Mod-Karte. Darf man das heute überhaupt erwähnen, so was? Es gab so Modding-Karten für ein DS, wahrscheinlich kennt ihr das. Konnte man dann quasi Spiele, selbstverständlich habe ich nur selbst von der selbst geladenen Karte Games da drauf gemacht. Da konnte man beispielsweise DS-Spiele von der MicroSD-Karte starten und so was. Was anderes hätte ich, ich hätte ja selbstverständlich da nie mir irgendwelche Roms oder so runtergeladen. Meint ihr, der Akku tut überhaupt noch? Ich habe noch ein 3DS, ich habe noch ein 3DS. Gibt es eigentlich noch DS-Ladegeräte? Das ist kein normaler USB-Stecker. Oder ist das so ein eigenes Nintendo-Ding wieder? Oder ist das was eigenes? Natürlich was eigenes. Was sonst? Sicherlich alles selbst gerippt noch. Wie gesagt, ich habe jetzt einen Vita, einen 3DS und einen DS. Da steht dem Flaschen ja nichts im Wege. Was ist mit der Switch? Die Switch habe ich auch. Aber die Switch nehme ich ungern mit. Außerdem habe ich keine Games für die Switch. Es gibt ja auch kaum etwas, was man spielen will auf der Switch. Mode die Switch? Geht das mittlerweile? Kann man die Switch flashen? Auch mit aktueller Firmware? Weil ich habe eine alte Switch. Ich habe eine ganz alte, ich habe eine Release-Switch. Die, die noch vergratzt ist, wenn man sie in den Ständer stellt. Falls noch einer membert. Membert ihr noch, Leute? Die Release-Switch, wenn man die in den Ständer gesteckt hat, kann das Display vergratzen. Das könnte man tatsächlich mal ausprobieren. Eine Runde Switch-Flaschen. Wie voll war der Akku von der Vita, als du sie gefunden hast? Ich habe sie nicht versucht einzuschalten. Soll ich mal versuchen, einzuschalten? Soll ich die mal holen? Ich hole die mal kurz, ich versuche mal einzuschalten. Diese 10 Jahre oder so. Ich habe die mir zur Release gekauft. Wann kam die denn raus? Okay, ich probiere das mal. Wann kam die denn raus? Wo ist überhaupt der Einschalter davon? Oben links, oben links der Einschalter. Die macht nichts mehr, Leute. Die macht nichts mehr. Die machen gar nichts mehr. Verkaufst du die? Nö, behalte ich alles. Ist das ein USB-Ladekabel oder was ist das da unten? Nee, oder? Ich habe da glaube ich gar kein Ladekabel mehr für. Wie sieht denn das, wie sieht denn das Vita? PS Vita Ladekabel. Wie sieht denn das überhaupt aus? What the fuck? Sowas habe ich nicht. Das Netzteil habe ich noch gefunden heute. Das Netzteil habe ich noch. Bastel doch selber, ich weiß nicht ob das so einfach selbst gebastelt ist ehrlich gesagt, wenn ich mir das so angucke. Gut, aber sowas kostet ja auch nicht viel. Guck mal hier, 5 Euro oder so. Leute, ich muss das Ding wieder wegbringen, das ist voll verstaubt. Wenn du die Switch moden willst, biegt dir schon mal eine Büroklammer zurecht. Wir gucken mal kurz ein Video, wie man das macht. Mod Nintendo Switch. Nintendo Switch, Niklas, der erklärt uns das jetzt. Wir lassen es jetzt von Niklas erklären, wie das funktioniert. Herr Endpunkt. Höchstpersönlich. Cheesypro, danke schön für den Sub. V2. Ganz wichtig. Nextgen. Jetzt gucken wir uns jetzt immer schnell an. Niklas erklärt uns das jetzt. Moin Niklas. Wie ihr eure Nintendo Switch moden könnt. Was wir hierfür benötigen ist eine modbare Switch. Was das ist erkläre ich gleich. Eine RCM-Jig. Ein was? Was ist ein RCM-Jig? Mit dem PC zu verbinden. Eine 64 GB Micro SD-Karte. Ihr seht hier gerade mal eine 32 GB SD-Karte. Die geht zwar nicht, aber es ist... Die Büroklammer? Ah ja. Und ein PC natürlich. Was wir als erstes machen ist, wir gehen auf die Seite SMS-Switch-Patch. Die habe ich auch in der Beschreibung verlinkt. Nein, nein, meine Switch ist nicht patched. Die ist... J7 00 Ja, ja. Und wenn es rot ist heißt es 40 Patchen. Oder wenn der Präfix gar nicht vorkommt, den ihr habt. Zum Beispiel e.g. e.g. EG��. Der Konsole ist auf dem letzten Stand. Und dann können wir auch weitermachen. Wir laden uns im Tagra RCM-GUI herunter. Drückt dann einfach auf der Seite auf Tagra RCM-GUI installer.msl. Aufkommt zum Punkt. Drück auf install-driver. Könnte das erstmal schließen. So, als nächstes stecken wir die SD-Karte an unserem PC rein. Das habe ich schon getan. Wie wir sehen, da ist die SD-Karte, aber die geht zwar nicht ab und ab und das ist die SD-Karte, wo ihr mitpackt, wie das geht. Gehen wir dann erstmal auf den PC zurück, öffnen das, probiert nochmal in den ACM-Mode zu gehen, oder guckt auf eurer Switch, ob ihr zu oder zu können. Jetzt habe ich das Wichtige verpasst. Wo macht er denn jetzt hier was an der Switch? Da! Aha! Okay, da kommt die SD-Karte rein. Das ist die SD-Karte drinnen, macht die dann folgendermaßen, den rechten Joy-Con raus. Liegt! Den vorhin erwähnten ACM, auf der Beschreibung verlinke, hier, den packt ihr zwar aus der Verpackung raus. Dann nimmt ihr den ACM-Jig und dann mit den unteren Kontakten, wie ihr seht. Okay, das ist quasi eine Büroklammer mit einem 3D-Drucker-Halterung. Auf der unteren Seite halt, so in die Switch reinstecken, in den rechten Klick, bis es unten fest sitzt. Dann drücken wir den Power-Button und den Volume-Up-Button, also Power-Button und Lautstärke hoch knopft gleichzeitig. Wenn wir nichts sehen, heißt es, es hat funktioniert, gehen wir dann erstmal auf den PC zurück, öffnen Tegra ACM-GUI, verbinden unser Kabel mit dem PC und der Home-Menü sieht aus. Okay, nice, also das scheint mir easy zu sein, die Switch zu flashen. Tja, könnte man tatsächlich mal ausprobieren. Hat das irgendwelche Nachteile, wenn man seine Switch flasht, kann man dann offizielle Games nicht mehr spielen oder wird man gebannt oder... Wobei, das ist Nintendo, die kriegen das wahrscheinlich noch nicht immer mit. Du darfst nicht mehr online gehen? Ernsthaft? Wie, Nintendo merkt das wirklich? Du darfst nicht mehr online gehen? Ach, doch. Also ich hätte mich jetzt sehr gewundert, wenn Nintendo sowas merkt. Ich meine, Nintendo und online... Ist immer, ist ja so ein Ding. Ey, ich flash lieber meine Vita, warum sollte ich? Also das Nintendo hingeht, hinbekommt Leute online zu bannen wegen einer gemordeten Switch, glaube ich an die Skills bei Nintendo nicht wirklich. Also das Nintendo hingeht, hinbekommt Leute online zu bannen wegen einer gemordeten Switch, glaube ich an die Skills bei Nintendo nicht wirklich. Okay, wisst ihr was? Wir gucken jetzt noch eins, zwei Videos an. Was haben wir denn hier Schönes? Was haben wir denn hier? Paradox! Wenige Arbeitszeit, leicht mehr Betrachtung. Was haben wir denn hier Schönes? Was haben wir denn hier? Paradox! Wenige Arbeitszeit, leicht mehr Betrachtung. Was haben wir denn hier Schönes? Wir gucken jetzt noch eins, zwei Videos an. Was haben wir denn hier Schönes? Was haben wir denn hier? Paradox! Wenige Arbeitszeit, leicht mehr Produktivität. Das ist doch das, was ich seit Jahren auch im Stream schon immer erzähle, Leute. Vier Tage Woche ist das Beste, was man machen kann. Ich mache das seit 2000... Joa, wo war ich? 2012 oder so? Seit wann mache ich vier Tage Woche? Hab ich ja irgendwann mal ein Video zugemacht? Ich weiß nicht mehr, seit wann ich das mache. Nee, das ist von Corona. Das Bahnvideo? Okay, Moment, okay. Okay, okay, okay, wir machen das Bahnvideo. Moment, ich muss das Video... Das muss man lauter machen, da versteht man sonst nichts. Das ist ein richtig geiles Video. Siehst du es so richtig schön von hinten, die Hose und das... Ganz ehrlich... Das ist ein Scheiß, Alter. Du musst es dir vorstellen. Das ist ein richtig geiles Video. Siehst du es so richtig schön von hinten, die Hose und das... Ganz ehrlich, man soll es auch nicht schlagen. Was? Das hätte aber schnell eskaliert. Das ist aber schnell eskaliert. Wir sehen davon ein Problem. Nebel fesseln, schlagen... Ich hatte mal das ein mit einer Hand, sie hat mir gesagt, ich soll ihnen eine nette Faust mit dem Gesicht schlagen. Das war zu wohl. Alter, so eine Scheiße, musst du dir da anhören, man. Manchmal würde ich wirklich gerne den Leuten aufs Maul hauen. Okay, das ist... Leute, das ist noch nicht mal irgendein Typ, der laut telefoniert. Das ist einfach irgendein... Ich hätte jetzt gedacht, das ist irgendein Drogenabhängiger in Frankfurt. Irgendeiner, der sich gerade was gespritzt hat. Alter, die Leute, das ist erschrecklich, man. Das ist der Grund, warum ich neues Canceling-Kopfhörer habe. Ich habe mich zwar auch schon ab und zu mal angelegt mit Leuten in der Bahn, aber... Was willst du machen? Ich meine, das ist der halbe Zug, der dir auf den Sack geht. Der Lokführer hat Durchfall, alles klar. Hab ich euch schon mal die Story erzählt, wo ich mich mit drei Halbstarken mal fast gekloppt habe in der Bahn? Ist aber nicht wirklich... Also, es hört sich jetzt krasser an, als es ist. Es war am Ende nix. Doch, ich glaube, das habe ich euch schon mal erzählt. Es war S-Bahn, Leute, S-Bahn. Was auch sonst außer S-Bahn? Ich meine, überlegt euch, Frankfurt nach Hanau S-Bahn. Da sitzt schon einiges drin rum. Nee, das waren irgendwie drei, keine Ahnung. Lass mich jetzt keinen Mist erzählen. 12-, 13-, 14-Jährige oder so. Und die sind die ganze Zeit durch diesen S-Bahnwagen gepflützt und haben gegen die Türen getreten und sowas. Und ihr wisst, wie das in der Bahn ist. Jeder guckt dann aus dem Fenster und will eigentlich nur seine Ruhe haben. Und Leute, die gingen mir echt massiv auf den Sack. Die sind rumgeflitzt, sonst wie. Dann hat dann irgendeine Frau mal was gesagt. So nach dem Motto, ich weiß nicht, was sie gesagt hat, ihr spinnt ja jetzt komplett. Und dann sind sie dann weitergegangen. Und irgendwann habe ich halt gesagt, Jungs, halt's Maul. Und dann kam, das war ja der Witz, dann kam dann einer von denen. Und hat gemeint, das ist natürlich eine Back-Up gehabt mit seinen Jungs dabei. Und da kam der und hat dann so gemacht, so, wisst ihr, kam er nicht schlecht damit. So gestmäßig, so auf starker Kerl halt, ja. Und ich sitze halt bei mir auf dem Platz. Er hat natürlich genau gesehen, dass ich das gewesen bin. Kommt er her und hängt sich ungefähr zwei Zentimeter mit seinem Gesicht vor meinem. Alter, das war irgendeine 13-jährige, halbstarker Mann. Das ist schon eine Weile her, wie alt wäre ich denn da gewesen sein, irgendwie 32 oder so. Der Typ fragt mich nicht, wenn es hochkommt, hat er 50 Kilo gewogen. Ich hätte ihn einfach umrennen können fast schon. Also ich weiß nicht, was mit den Leuten los ist. Hat er sich zwei Zentimeter mit seinem Gesicht vor meins gehangen und hat irgendwelche blöden Sachen erzählt. Zumindest lief es dann darauf raus, ich hatte keinen Bock, dass er sich zwei Zentimeter vor meinem Gesicht nimmt. Ich habe meine Hand genommen, habe sie ins Gesicht gedrückt und haben so meter zurück gestummt. Dann hat er die Fresse gehalten. Alter, was für kleine Kackspasten, Mann. Und die anderen haben sich dann auch nicht mehr gerührt. Aber es ging natürlich weiter danach. Also du hast ja so einen S-Bahn-Wagon, das ist ja immer eingeteilt in so vier Zwischendinger. Oder drei sind es, glaube ich. Du hast ja immer so links und rechts ein paar Sitzgruppen. Dann hast du Tür, du hast ganz am Anfang eine Tür, links und rechts Sitzgruppen, nimm wieder eine Tür, links und rechts Sitzgruppen, sind einfach weitergegangen ans Ende des Waggons und haben dann wieder runter gemacht. Alter, ich habe gedacht, ich muss mich jetzt gleich mit denen kloppen, als sie angerückt sind zu dritt auch noch. Das hast du schon gesehen, da hast du richtig so auf starker Kerl gemacht. Ich gehe einfach mal stark von aus, dass er sich gekränkt gefühlt hat vor seinen Kollegen dort und dass er sich jetzt quasi dazu genötigt sah, was machen zu müssen. Ansonsten wären die unglaublich bescheuert gewesen. Ich meine, die waren vielleicht ein Stück größer als ich, aber ich war definitiv breiter und eine ganze Hecke schwerer als die. Also ich glaube, das wäre nicht so gut ausgegangen. Ich habe mich noch nie, ohne Scheißleute, ich habe mich noch nie wirklich gekloppt in meinem Leben. So richtig mit Blut und blauen Flecken und so. Noch nie. Klar, ich habe mich in der Schule mal gekloppt ein bisschen, aber noch nie. Habe ich auch nicht vor. Aber da habe ich gedacht, es ist echt soweit. Ich habe noch mal ein paar andere in der S-Bahn in Frankfurt, die haben Handy gehört und die habe ich halt auch gefragt, soll ich mir den Mist jetzt die ganze Zeit anhören? Und da haben sie auch irgendwelches blöde Zeug erzählt und irgendwie, wen es stören würde. Da habe ich gesagt, mich stört es. Ich stehe direkt neben euch. Und wahrscheinlich haben sie nicht mit solchen energischen Widerspruch gerechnet. Da war dann auch erst mal Ruhe bis Südbahnhof. Da waren ja nur drei Stationen. Meine Güte. Ich mache sowas ungern. Ich traue mich eigentlich da nicht, weil Frankfurt weiß ja nie so genau, was los ist. Aber manchmal geht es einem dann doch zu sehr auf den Sack. In Frankfurt hast du dann vielleicht auch mal irgendwelche Leute, die sich vorher was gespritzt haben oder irgendwelche Messer in der Tasche stecken haben oder weißt es ja nie. Aber manchmal ist das einfach, soll ich sagen, dann überwiegt so dieser geht mir mega auf den Sack Adrenalinschub versus eigentlich habe ich mir keinen Bock mit Leuten im Zug anzulegen. Du kannst auch deinen Cousin holen, genau. Hol deinen Cousin. Wobei wir wissen ja alle, der Cousin ist eh blöd, der macht das. Oder wie ging das? Mein Cousin ist eh dumm, der macht das. Mal gucken, was haben wir denn hier sonst noch so? Okay, das ist irgendein Besoffener. Das ist irgendein Besoffener. Das ist irgendein Besoffener Typ. So fällt Justin in Frankfurt auch öfters. Muss ich ehrlich sagen, das stört mich gar nicht mal so sehr. Die sind halt komplett in ihrer eigenen Welt und irgendwie kann man auch sagen, die können ja auch nur am Rande was für. Aber die ganzen Typen, von denen ich euch jetzt erzählt habe, die waren alle voll zurechnungsfähig und haben trotzdem gedacht, nein, wir müssen irgendwelchen komischen Deutschrap für die komplette S-Baden spielen. Ich muss sagen, mit Fußballfans habe ich bis jetzt keine schlechten Erfahrungen gemacht. Ja, ich hatte schon die ein oder anderen, die rumgekrischen haben, gerade wenn du abends von Frankfurt fährst, wenn die dann quasi vom Spiel zurückfahren, vor allem wenn die dann auch noch verloren haben, dann wird ja immer noch rumgesungen und rumgemacht. Aber da hatte ich noch nie schlechte Erfahrungen gemacht bisher. War sogar eher so, dass mal zwei Stück, einen dritten, der hat sich wahrscheinlich zu sehr besoffen, die haben den quasi mehr oder weniger halb aus dem Zug getragen dann an ihrer Station. Die sind dann irgendwie, ich glaube, muss ja Offenbach gewesen sein, was anderes geht eigentlich auf dem Zwischen, da gibt es ja keinen großartigen Zwischenhalt mehr. Die haben ihn dann halb rausgetragen, ihren Fan-Kollege aus dem Zug. Ja, das Gesinge, das ist, also ich vermeide Zug zu fahren, wenn Fußballspieler waren. Au! Au! Au! Au! Alter, die Leute! Alter, die Leute! Kannst du mir ganz kurz nicht aufgehen? Die muss nach Hamburg. Ja, du musst auf der Seite warten. Ja, Vitamals heute? Als Kind hab ich das mal nicht. Vor ein paar Tagen hab ich mir das aufgekauft. Einfach so. Einfach so? Alter, was? Gangstermann, Vitamals? Deine Meinung? Bitte? Zu Corona, deine Meinung? Man sollte vorsichtig sein. Meinst du wirklich? Ja klar. Ich glaub darin nicht. Du glaubst nicht an Corona? Nein, nein, nein. Gibt's das wirklich? Aber der Typ ist aber auch ein bisschen besoffen, mit dem er da redet. Also was heißt besoffen? Es muss nicht besoffen sein. Ich sag jetzt besoffen mal stellvertretend für alle möglichen Sachen, die er eingeworfen haben kann. Der kann besoffen sein, der kann sich was gespritzt haben, der kann irgendwas geraucht haben, der kann sonst alles zu sich genommen haben. Aber er ist zumindest nicht 100%ig bei der Sache. Also er ist nicht 100%ig in unserer Welt. Er ist nicht 100%ig in unserer Welt. Er ist drauf, genau. Was trinkt ihr denn? Wodka und Vodka. Willst du alleine gehen? Nein. Aber jetzt ja. Du bist vergeben. Du bist so süß. Du mit Falten. Du mit Falten? Du bist so süß. Du bist so süß. Du bist so süß. Du bist so süß. Du mit Falten. Du mit Falten. Alter, das ist ja schlimm. Das ist ja schlimm. Die haben auch überhaupt keine Hemmungen mehr, die Leute, oder? Hier. Was jetzt? Wo sind wir stehen geblieben? Den hatten wir schon. Hier. Wo sind wir stehen geblieben? Hier. Die haben auch wirklich keine Hemmungen mehr, oder? Also macht euch nichts auf, ich verstehe auch nichts. Das würde ich mir dann auch denken. Was zum Teufel? Okay. So Verrückte in der Richtung haben wir auch. Aber welche, die mit Puppen umgefahren sind noch nicht, aber Verrückte in gewisser Weise, Gestörte haben wir auch genug. Wie weit ist es ungefähr nach Hamburg jetzt? 40 Minuten. Ich bin nur zum Ficken nach Bremen gefahren. Ich bin nur zum Ficken eingefahren. Kann er das nicht auch woanders machen? Warum musst du zum Ficken nach Bremen fahren? Wir haben nicht gepickt, wir haben wohlgebackt, aber das hat sich gelohnt. Siehst auf jeden Fall dehydriert aus. Entschuldigung, ganz kurze Frage. Ich wollte euch eigentlich so klarmachen, wie es hier ist. Aber ist okay. Die haben echt keine Hemmungen mehr, Mann. Wir haben halt 365 Days geguckt. Oh Gott. Da habe ich so Angst. Übung macht den Meister, wie bei allem. Ich bin so gay gefahren. Oh Mann. Das will man alles gar nicht wissen. Ich habe ja überhaupt kein Problem. Es können die ja alles denken und die können auch alle bevorzugen, was sie bevorzugen wollen. Jeder was ihm gefällt. Aber musste man das wirklich der Welt so mitteilen? Deswegen habe ich meine Noise-Canceling- Kopfhörer. Und für den Fall der Fälle, dass meine Noise-Canceling- Kopfhörer nicht gehen, ich habe auch noch so Stöpsel. Ohrstöpsel. Gummiohrstöpsel dabei. Rock am Ring, Leute, sind das noch. Rock am Ring, Rock am Ring, Ohrstöpsel. Ryze, jetzt werden sie einschienen. Das ist auch ein ganz schönes Geschoss, also würde mein Opa Ein Junker sozusagen. Geht das heute? War das jetzt schon, ging das jetzt schon ins Fett Shaming durch? Ja. Ich darf das Leute. Ich bin auch zu fett. Hat der ernsthaft einen Lautsprecher umhängen und hat den laut beweis ich poste regelmäßig meine vage auf twitter ihr wisst dass ich zu dick bin warum hängt man sich den Lautsprecher um das erinnert mich fast an dieses komische erinnert sich vielleicht vielleicht kennen ihr das auch noch es gab noch so ein gefälltes kickstarter projekt wo irgendeiner der meinung war das wäre jetzt eine richtig gute idee so einen umhängbaren bluetooth lautsprecher zu entwickeln das wurde nicht gefaundet aber der war da voll überzeugt von. Warum will man die restliche welt an seiner musik da teilhaben lassen? Ah erstmal schön. Ok man weiß es nicht ob geschissen oder nicht. Ok das ist typisches frankfurter publikum das gibt es da auch in massen. Der hat angesetzt und weggekippt der macht den ganzen tag nichts anderes der hat übung. Es könnten durchaus fußballfans sein also vom besoffenheitsgrad her gehts schon wobei die eher schlager singen als fußballzeug also es könnten fußballfans sein aber es sieht mir eher aus wie welche die gerade zum flughafen fahren oder mit dem neun euro ticket nach sylt oder welche die jungen gesellen abschied machen ja das kann auch sein ja gut so schnell wie der seine bierflasche weggekippt hat dass er nicht mal normale worte rauskriegt das ist schon logisch. Kommt da noch was? Kommt da noch was? Ach du scheiße was zum Teufel. Na gut in seiner welt hat er sin ergeben was er gesagt hat wahrscheinlich. Hat die da gerade was für ihr only fans aufgenommen oder sowas was war ich da gerade sehend? Ja ungefähr ungefähr so hörte sich das gestern im Zug an als der Araber telefoniert hat. Leute das hab ich auch gerne gibt's öfters hab ich sogar schon Bilder auf twitter gepostet wo ich Leute hatte neben mir im Zug und ganz im ernst die sieht ja noch so aus als also wartet mal ich mein die sieht jetzt nicht so aus als stinkt das den ganzen Zug voll ich hatte mal einen neben mir sitzen der war so dreckig und so eklig und hat die schuhe aus gehabt das war aber nicht moment das hab ich auf twitter gepost man findet halt auf twitter nix hier der Dude neben mir genau nicht jetzt hier guckt euch an den Kerl ich hab nicht neben mich geguckt ich denke mir so alter was stinkt denn hier so und dann guck ich neben mich und auf einmal sitzt der Typ da mit ausgezogenen Schuhen und stinkt den ganzen Zug voll ja guck mal meine Hand ist liegt in der Spiegelung ja ja das sag ich das ist normaler Wahnsinn hier Frankfurt und Umgebung ich weiß nicht ob der da irgendwelche Gebete gerade voll führt oder was das was das gibt wenn der Tag lang ist was ich ich denke mir auch was ist was ist mit den Leuten eigentlich verkehrt der Typ neben mir im Zug der hat nix mehr gecheckt aber die checkt es doch noch wie kommt man auf die Idee dass man seine Schuhe einfach mitten im Zug aussieht und dann noch nicht mal Socken an hat ich mein ich fände es schon fragwürdig wenn die Leute ihre Schuhe aussehen haben Socken an aber naggische Füße muss das wirklich sein? Sieh doch nicht im Wohnzimmer Jo setz dich gerade jetzt Wie lange bleibt ihr hier stehen? Ich will nicht wissen was da alles rauskommt Warum raust du das? Oh das schmeckt! Oh die ganz dicken! Du raust doch keine Zigarre! Nicht durch die Lunge oder? Klar ganz normal! Du kriegst doch richtig Durchfall von! Das ist normal! Das ist normal! Wen juckts? Durchfall! Standardzustand! Default! Lungenärzte hassen diesen Dreck! Die haben auch irgendwas genommen vorher! Schlapper mich nicht zu! Ja das, gut da wollte ich sagen, hatte ich auch schon ein paar Ansagen wo ich mir gedacht habe was genau haben die da jetzt durchgesagt aber die kann das wahrscheinlich in 1-2 Wochen wenn sie übt das kann ich umsteigen was hat er da für welche am Start? Die halt ich fest, weil ich die gedingst hab, die langen hier, Leergut nehmen wir mit, die sind aus Berlin, da nimmt man immer Leergut mit! Echt? Ja! Standard Berliner Unterhaltung! Statt das Default dort! Uuuh ne! Wobei das ist nicht tiktok leute das sind eher facebook. Das ist eher facebook gucken Ja super Ich meine die wollen ihn wenigstens daran teilhaben lassen ja Was ist hier los Ja, ich glaube ich müsste auch manchmal ein bisschen aufnehmen das wäre das käme bestimmt gut an Leute ich capture jetzt einfach ab und zu mal im zug wenn irgendwas ist Was Wirklich teil 2 noch gucken Okay, also ihr habt die auswahl chat entweder gucken wir uns jetzt an paradox und weniger aber es zeigt gleich mehr poloketei 2 ist gut ist gut weil weil ihr seid teil 2 best of bar in die bahn weiß alles Ich sehe der chat ist heute auf vollem voller dauer reaction beschallung Wo habe ich die musik an ich blick ich blick nicht mehr durch okay Wo denn jetzt Ja chat ich habe zu viele Waren ja, okay, die rauche ich nicht Der typ Da es harzt rauf wirst du text gesellt sleep Einfach eine Schicht Was ist das für ne? So ist das irgendein Rentnerklapptelefon oder was? Und mit Ladestation! Warum hat die eine Ladestation im Zug dabei für den Set? Meine Güte! Das ist ja Vollausstattung! Ich mein immerhin singt er leise! Alter! Man muss einfach nur Bahn Videos machen, dann sprechen an die Mädels von sich aus dem Zug an! Wie könnt ihr euch das vorstellen? Auf gehts Leute! Direkt geht jetzt das Smartphone auf Record! Jetzt kenn ich endlich den Trick, wie das funktioniert! 500k auf Insta muss da eigentlich schon sein! Mit 300.000 YouTube kann man da nicht punkten oder? Insta? TikTok oder? 300k TikTok ist doch nicht besser! Was übrigens der Hauptgrund ist, warum ich mich nie in Videos gezeigt habe und zeigen werde? Weil ich keinen Bock hab, dass mich Leute auf der Straße erkennen! Ich hab mir Masken bestellt, ich werd demnächst mir einen neuen Rechner kaufen und den werden wir live zusammen im Stream bauen! Und ich möchte mich nicht leaken, aber es kann durchaus sein, dass ich mich leaken werde! Deswegen hab ich mir zwei Masken gekauft, nämlich, hier hab ich sie, ich kann sie euch jetzt schlecht zeigen, ich kann sie hier hochhalten! Also ich hab hier noch eine eingepackt und eine schon ausgepackt, das ist eine Maske mit einem Keks drauf! Ich hab zwei Custom Keks Masken drucken lassen, die kann ich mir dann übers Gesicht ziehen, bzw. meine Augen gucken da noch raus! Und dann kann ich mich nicht leaken, aber ich seh alles, ihr könnt mich im Zweifelsfall auch sehen, falls ich mich irgendwo spiegele, aber es erkennt mich keiner! Top Secret! Und? Ja, dann Facecam Stream mit Maske! Okay, weiter! Was hat der Typ da am Start? Ist das ein Lautsprecher? Moment! Ist das irgendwie ein Zirkus, der unterwegs ist, oder? Ich bin so ausgezuckt in diesem Moment, dass ich das gemacht hab, ich bin Sherlock Holmes Bruder, ich neig das sofort, wenn jemand das macht! Ich bin Sherlock Holmes Bruder, ich neig das sofort, wenn jemand das macht! Ich sag dir ehrlich Bruder, ich glaub dies nicht so, wenn jemand das macht! Bruder, okay, ist Bruder wieder angesagter? Ich dachte Digger ist es immer noch! Das müsst ihr mir jetzt erklären, ich bin da im Jugend-Slang nicht mal so wirklich drinne mit 38, aber ist es eher Bruder oder Digger? Ich dachte es ist eigentlich immer Digger! Oder ist es schon wieder, oder ist es eher Bro, Bro? Aber Bruder, spricht man das wirklich so aus? Manche Leute sagen Bre! Bre, hab ich auch schon gesehen! Alle Schmutzdigger! Man kann aber bestimmt sagen Bro Digger oder sowas in Kombination, ich glaub das ist auch möglich! Oh nein! Boah! Übertreibt halt! Ist das Dubstep? Hört heute wirklich noch jemand Dubstep? Ist das irgendein Fetisch-Telefon oder was? Dominante 50-Jährige, die dir ins Ohr rülpsen oder sowas? Warum rülpst du ins Telefon? Das ist der Wahnsinn, die Leute! Oh nein, wieder einer mit nackten Füßen! Leute, lasst doch wenigstens die Socken an! Das ist aber auch ein Typ, oder? Wenn ich mir die Uhr und den Arm so angucke! Scheiß auf Bewährung! Das sind ja schon wieder die richtig harten Leute unterwegs! Vor allem, wisst ihr was ich geil finde? Was richtig hängen geblieben ist, die feiern sich für diesen Scheiß auch noch übelst ab dann! Die größten Spasten aller Zeiten, aber die feiern sich da richtig ab! Mag aber auch daran liegen, der ist aus dem Netto geflogen! Ja, zu Recht ist er aus dem Netto geflogen! Die feiern sich, aber das geht auch nur, weil die Leute mit ähnlicher Weltanschauung kennen. Wo das quasi Status Talk ist, wenn man sowas von sich gibt. Ich bin aus dem Netto rausgeflogen! Man muss sich mal vorstellen, es gibt Leute auf dieser Welt, die erzählen sich untereinander, ich bin aus dem Netto rausgeflogen! Und bei denen ist das die krasseste Errungenschaft! Wenn ich euch erzählen würde, ich bin aus dem Netto rausgeflogen, dann würdet ihr denken, was, warum, erzählen mal, stimmt doch irgendwas merkwürdig! Aber nee, bei denen ist das, ich bin aus dem Netto rausgeflogen! Boah ey, du bist der Beste, du bist so geil, du bist aus dem Netto rausgeflogen! Die feiern das richtig! Nee, nee, nee, nee, okay, aha, okay, ich hab fast Bier dabei, ich hab die 4 flassen Wassermaisel mit, danach fahr ich mit dem Töv, Töv nach Netto, will eigentlich kaufen. Auch zum Netto? Was wollt ihr da leben, Netto? Ich bin aus dem Brot geschenkt, Donner! Morgen, KS! Was zum... Das sagt ein Zugbegleiter, aber in der Regel nicht. Ich habe noch nie einen Zugbegleiter gesehen, der gesagt hat, deine Fresse gefällt mir nicht! Scheint ja in der Welt da öfters vorzukommen! Meine? Nein, meine Fresse gefällt mir jetzt nicht! Weil ich Zugbegleiter bin? Nein, weil ich Zugbegleiter bin! Nein, ich bin Zugbegleiter! Ja? Moment, das ist immer noch der gleiche Typ aus dem ersten Video! Kickel! Ja? Ich sag Versuch! Ja? Du guckst hier auch nicht raus! Ja? Ich hol die Bullen! Ja? Und du sagst zu den Bullen, er hat mich geschlagen! Die nehmen das auf, als Anzeige, die Bullen! Du hast mich geschlagen! Jetzt nicht! Wer kann das beweisen? Nein, aber versteht ihr das mein? Ja! Nein, nein, nein, nein! Ich meine nicht, den Typ, den man da sieht! Der, der erzählt, ist immer noch der gleiche aus dem ersten Video! Also der, der eben ihm was erzählt hat, dass der Typ in der Kamera der gleiche ist, ist mir auch klar, chat! Was bin ich da sehend? Was... Oh, der schnarcht! Ja, schnarchende Leute hatte ich auch schon öfters! Der ist aber schon besonders raus! Ist alles, was du willst! Ist das in Berlin? Ist das irgendwo in der Nähe von Berlin? Mit Familienbereichen und Kinderbetreuung, mit individuellem Service und Genuss auf ganzer Strecke! Oh man! Man sieht nicht, worauf er fährt! Boah! Du hast eine Persönlichkeit dazu! Egal, sieht man sofort! Du bist ein Talent! Das ist aber sehr bescheiden, ja! Hä? Was? Für dich! Tschüss! Confused! Gibt's hier eine artistische Einlage noch zwischendurch? Warum müssten sie zusammen aufs Klo? Ich bin gestern nach Würzburg gefahren, da war ich auch auf dem Hinweg aufm Klo! Und ich werde das nicht glauben, aber das ging! Also komplett ohne Begleitung, das war möglich! Was ist das mit diesen Bluetooth-Lautsprechern eigentlich? Warum haben die so viele? Ich meine, die brauchen ja trotzdem ein Handy dazu, oder? Ohne Handy hier das doch nicht! Na gut, es ist wahrscheinlich, wenn du da so quasi am Bahnhof lebst, dann ist das ja dein Wohnzimmer! Da hast du da auch einen Lautsprecher! Bitte was? Vom Skateboard fahren gehen die Schuhe kaputt? Was ist so? Nice Effects getroppt hier! War das nicht das Handy oder so? Feuerzeug? Ja gut, Feuerzeug kann jeder mal irgendwie klauen, aber weil es halt rumliegt, aber da hat er die Effects getroppt jetzt! Bildungsauftrag erfüllt, ja! 70? Ich hab so meine Zweifel, dass ich gerade im Klo bin! Ich kann mir nicht vorstellen, dass er 70 gefahren ist, ich schau mal aufm Longboard! Aufm Longboard? Weil das teuer ist, kann man da zu viert draufstehen, die Logik ist bestechend! Ach, das ist immer noch der, der kein reicher Wichser ist, okay! Okay, mach's gut man! Ich frag mich immer, warum haben die so Mitteilungsbedürfnis? Ach, deswegen hat er ihm die Story erzählt! Deswegen hat er ihm die Story erzählt! Das war die Zigarettenschnorrtaktik! Ach so! Das Problem, was ich da immer hab, ist, du weißt nie! Das ist ja bis zu einem gewissen Punkt alles ganz lustig, ja! Du weißt aber nie, wie die Leute darauf reagieren, wenn du ihren Scheiß nicht mitmachst! Stell euch mal vor, der erzählt dir erst wie sein halbes Leben und am Ende denkt er, du bist sein bester Freund, obwohl er dich einfach nur vollgelabert hat! Und dann fragt er dich nach einer Zigarette und du sagst, nee! Da kann es durchaus sein, dass die mal voll ausrasten! Weißt ja nicht! Achso, der wollte ihm eine geben, ja gut! Ja, trotzdem! Also, dann jetzt nicht der, aber trotzdem, das kann dir schon passieren! Du weißt ja nie, das ist ja alles ganz lustig, aber du weißt ja nie, wie die Leute ticken! Was? Die Aussprache erinnert mich an eine aus der Berufsschule! Ich hab keine Ahnung, wo die hergekommen ist, aber ihr kennt doch das Spiel Worms! Also nicht die Stadt, game! Das kennt ja wahrscheinlich jeder! Und wir hatten eine in der Berufsschule, die hat unglaublich gerne Worms gebucht, oder meint wegen, wie würde der Ami sagen, Worms oder so? Keine Ahnung, zumindest, ich sag immer, es heißt Worms! Zumindest, die war der Meinung, es heißt Worms! Und die hat jedes Mal, wenn es um irgendwelche Games oder so, gesagt, sie spielt Worms! Und ich hab gesagt, was will die überhaupt? Von was spricht die? Bis ich es irgendwann mal gecheckt habe, dass sie Worms meint! Und dann hab ich gesagt, ach du meinst Worms? Und dann hat sie das für mich korrekt ausgesprochen! Die hat gesagt, ja! Also sonst hat sie immer gesagt Worms! Und dann hab ich gesagt, ach du meinst Worms? Du meinst das mit den Würmern, die sich abschießen und so? Dann meint sie, ja! Ich meine, ja! Ich meine Worms! Kann ich mich nur dran erinnern, als wäre es gestern gewesen! Die hat das dann quasi langsam ausgesprochen für mich, dass ich es quasi verstehe! Ich meine Worms! Und irgendwie hat mich das, wie die das im Zug ausgesprochen hat, total an den Dialekt von der auch erinnert! Die hat es genau so angehört! Scheiße! Okay, die hat wirklich Spaß an ihrem Job! Ist es nicht so, dass man Englisch Worms sagt und die Amis sagen Worms oder so? Es ist zumindest nicht Worms und auch nicht Würms! Was bin ich da sehend? Ich erkenne es da nicht so genau! Ach so, der bohrt in der Nase! Ja, gut, wenn man unbeobachtet ist! Ah, noch mehr Nasenbohrer! Ah, jawoll! Lecker! Krassen Rollertricks! Da haben sie sich schon ein bisschen gefeiert für jetzt, oder? Für diesen Hardcore-Trick! Das ist ja, da kann er mit seinem Skateboard bestimmt nicht mithalten! Guckt euch mal den zweiten Typ an! Der Roller ist viel zu klein für den! Oder die Hose hängt so weit unten! Ist das nicht so eine Adidas? So eine Adidas-Hose mit Knöpfen dran! So eine, was man früher Schnellficker-Hose genannt hat! So eine Adidas-Hose! So etwas hatte ich auch! Ich bin aber auch alt, da war so etwas angesagt früher! ASMR-Sounds! Ach du Scheiße! Okay, da ist ja wirklich alles fail dran! Also erstens, warum rennen die schon wieder mit Boxen rum? Zweitens, was ist das für eine Kackmusik? Also die Musik ist keine Musik und was ist das für ein Text? Das ist schon wieder... Ich bete zu Gott, lass die Muschi eng sein! Da war ja hier lyrisch wieder alles auf absolut höchstem Niveau! Moment, ich muss jetzt nachgucken, was das für eine Song ist! Moment, das google ich aber nicht im Stream! Okay, und ich bete zu Gott! Okay, das ist... Okay, wir hören uns jetzt mal an! Also wir hören uns das jetzt nicht an! Wir lassen uns mal kurz die Lyrics dazu! Geben wir uns jetzt mal! Also das ist Bait und Tech! Schatz, was ist los? Kann man das hier überhaupt zeigen? Das ist wahrscheinlich absolut TOS, Jugendschutz, sonst was! Das darf man wahrscheinlich gar nicht zeigen! Okay, aber zahl mal! Was ist das schon wieder für ein Text, Mann? Ich bete mit euch, für diesen Reim hier feiern sich die Ersteller auch noch wahnsinnig ab und denken, sie sind hier Goethe 2.0! Ach, Goethe reicht schon gar nicht mehr, Shakespeare 2.0! Das ist so schlecht auch noch, Mann! Ohne Scheiß! Also nicht nur Deutschrap, diesen ganzen Krempel, das kann jeder, jeder der sich irgendwie... ...der sich dazu hinreißen lässt, sowas öffentlich dann auch noch vor sich geben zu wollen. Es gibt ja durchaus gute Sachen, will ich mal gar nichts zu sagen! Ich hab früher relativ viel Semidilux gehört zum Beispiel, das geht ja! Und Eminem kann ich mir auch geben, Rap und Hip-Hop ist sicherlich nicht meine Lieblingsmusikrichtung! Es gibt aber, ich will nicht alles schlecht reden, es gibt durchaus gute Sachen, die kann ich mir auch anhören! Aber meine Güte, ey! Wie sehr die sich da drauf abfeiern müssen, dass sie zwei gerade, das sind doch nicht mal gerade Sätze! Das sind ja auch noch absolut bescheuerte sinnlos Sätze! Aber wie die sich wahrscheinlich innerlich dafür auch noch abfeiern, dass sie zwei Sätze hinbekommen, die man beim Aussprechen irgendwie aufeinander reimen kann... ...es ist unbegreiflich! Und dann hört man den Scheiß auch noch mit Boxen laut, wenn man unterwegs ist! Was denn Scheiße, man! Was denn Scheiße! Ich weiß es nicht! Die Socken sind so hoch, das ist gewöhnungsbedürftig! Warum laberst du Leute im Zug an, erzählst ihnen, dass die Socken so hoch sind? Die Socken sind so hoch, das ist gewöhnungsbedürftig! Warum laberst du Leute im Zug an, erzählst ihnen, dass die Socken so hoch sind? Das ist Marek, gut zu wissen! Malte! Mitte 30, glaube ich! Okay, krass! Ja, ernsthaft? Krass! Oh Mann! Nee, das Glück habe ich nicht, von Leuten so oft zugelabert zu werden im Zug! Oder bin ich auch echt froh drum? Wisst ihr, was mein Beweis ist? Wenn irgendjemand sagt, Bugs, das stimmt überhaupt nicht, niemand, nur ganz super high IQ Leute, können deutsche Rap-Texte schreiben... ...dann antworte ich einfach, dann zeige ich ihnen einfach das Video, ich weiß nicht mehr, welches es war, ich finde es aber, wenn ich danach suche... ...wo ich zwei Zeilen aus einem Haftbefehl-Song genommen habe, habe zwei neue Zeilen mir selbst ausgedacht und niemand hat von den Leuten in den Kommentaren gemerkt, dass das nicht Haftbefehl ist, die letzten zwei Zeilen! Niemand! Ich dachte mir so, wann merkt es denn mal irgendjemand, dass das nicht Haftbefehl ist, was ich hier gerade zitiert habe? Es hat keiner gecheckt! Was war das denn? Welches Video war das? Ich meine, mir geht es um die Texte, dass das von der Aussprache her und vom Stil her und vom Rhythmus, vom Tempo und sowas, dass das mal ein eigener Skill ist, das erkenne ich ja an. So ist das nicht, das ist sicherlich auch nicht ganz ohne, aber die Texte sind teilweise wirklich, als hätte das irgendein 5-Jähriger geschrieben, oder 5-Jähriger stimmt noch nicht mal, die haben doch nicht so komische Gedanken. Das hört sich an wie irgendein 12-Jähriger, der nicht richtig aufgepasst hat und keine Sätze ordentlich tippen kann und auch die Word-Auto-Korrektur nicht richtig verwenden kann und meint, er muss jetzt mal richtig starke Fick die Bitches-Wag-Texte machen. Wo habe ich das denn? Welches Video war das, wo ich bei Haftbefehl noch was dazu erfunden habe? Das Video mit dem... Nein, nein, nein, nein, das war das nicht, das war irgendein Battlefield-Video, Bahn. Irgendwas mit Bahn. Es ging, glaube ich, um die Bahn. Was auch sonst, Leute, was auch sonst? Bahn gleich und das ist zu alt, das kann es nicht sein. Bitch, Haftbefehl, das ist es. Hallo Leute hier. Das ist es. Äh, das ist es. Wo ist Haftbefehl? Da magst du nicht, ich muss einfach mal ein paar... Total versagen auf ganzer... Und es ist natürlich... Einfach komplett... Hier, jetzt kommt es, glaube ich. Okay, ich meine, scheiß auf saubere Klos, also nicht scheiß auf saubere Klos, sondern scheiß auf saubere Klos oder bistro-Restaurant oder sonst was im Zug, ich will einfach nur ankommen und das Ganze halbwegs pünktlich, aber ankommen ist das Wichtigste und es kann nicht sein, dass so oft der letzte... Ich reakte nicht auf meine eigenen Videos, ich will euch zeigen, dass jeder irgendwelche deutschen Rap-Texte schreiben kann. Wie gesagt, von Aussprache, Tempo und sonst was wieder was anderes. Aber rein die Texte, das kann jeder. Das kann jeder, der halbwegs gescheit ein paar Wörter aneinanderreihen kann. Um die Statistik zu schönen. Ach ja, übrigens... Nicht die Normalen, die vor Ort sind, sei es jetzt als... Wird bestimmt vieles noch schlimmer wird, dann möchte ich jetzt mal so virtuell meinen Hut vor euch ziehen, mal verkaufen, sondern zu suchen. Am besten nimmt er... ...einer nicht nur Statistiken schön rechnen kann, mit Halten ausfallen lassen, sondern auch wirklich, dass da sich mal was tut. Es ist unglaublich. Und das ist ungefähr so, wie wenn ihr IT-Experte seid... Danach ging's. Ich bin dann an Willy... ...Brandplatz ausgestiegen, dann zur Goethe-Straße und ja, so wie Haftbefehl, das quasi schon... Jetzt, jetzt. Schon ganz früh wusste... ...der hat ja mal gesagt, Goethe-Straße, Louis Vuitton Store, zahl die Kollektion bar, fick auf Sponsor. Hauptbahnhof, Rotlicht, Nutten und Penner, fick die Bahn seit richtige Männer. Der hat dann... Was davon ist Haftbefehl, was ist von mir? Sagt's. Und ich wette mit euch, niemand, der das Original nicht kennt, hört's raus. Ja, natürlich ist das letzte von mir mit der Bahn. Das muss ja auch zum Video passen. Ich mein, Chat, ich weiß, ich weiß, ihr seid schlau, sonst werdet ihr nicht bei mir am Start und Leute, die Prime-Subscripted haben, sind natürlich... Subscripted, Alter. Leute, die Prime-Subscripted haben, sind natürlich noch schlauer. Ich weiß, ihr seid H1Q-Chat, ihr wisst das. Natürlich ist das von mir, gerade auch, weil es in dem Video um die Bahn geht. Aber ohne Mist, das ist genau so. Das kann absolut jeder diesen Mist zusammendichten. Absolut jeder. Ja, sich auf ne Bühne stellen und das dann zu erzählen und das zu rappen und so, ganz was anderes. Aber diesen Text, das kann absolut jeder. Und dass gerade dann irgendwelche Low-IQ-Dudes sich übelst darauf abfeiern, dass sie vielleicht im Zweifelsfall noch mit Wörtrechtschreibkorrektur 5 Sätze hintereinander gebracht haben, die mit sehr viel Hängen und Würgen ein paar Reime drin haben. Und dann meinen, Alter, ich werd der krasse nächste Kollege sonst wie Deutschrapper. Das ist echt der Wahnsinn. Also jeder ist der Meinung, er kann das. Und anscheinend klappt das ja auch, wenn ich mir das zum größten Teil so angucke. Wisst ihr, was die machen? Die schreiben iOS-Notizen-App, genau. Die schreiben aber mit der iOS-Notizen-App so diese Challenge, wo man nur das erste Wort schreibt und danach nur noch Autokorrektur macht. Ich glaub, so entstehen diese Texte. Diese Autokorrektur-Challenge. Gibt ja zu allem irgendwelche, Autokorrektur-Challenge. So entstehen diese ganzen Texte. Was anderes kann ich mir nicht erklären, das was wir eben gelesen haben. Also ob Haftbefehl Ami-Deutsch hat, hab ich so mal eine Zweifel, ehrlich gesagt. Es gibt durchaus gute Sachen, es gibt auch wirklich sehr bedeutungsvoll zusammengedichtete Sachen. Da will ich nichts gegen sagen. Aber nicht jeder, der drei Sätze rausbekommt, wo sich dann vielleicht auch noch mit viel verbogener Aussprache was reimt, ist der geborene Dichter und Rapper. Denkt es leider bloß zu viele. Erinnert mich wieder an den Typ bei mir aus dem Arbeitsamtkurs, der auch der Meinung war, was willst du später werden? Rapper. Dann hat er mir den Text von sich gezeigt und da kam da drin vor, machst du Faxen, mach ich dich platt mit Axten. Und er fand den Text geil. Und da musste ich lachen, nachdem ich das gelesen hab, da hat er mir den Zettel wieder abgenommen. Machst du Faxen, mach ich dich platt mit Axten. Also nicht Axten, das hätte ja noch Sinn gemacht. Axten als quasi im übertragenen Sinne für ich überfahre dich. Hey, hätte ich gesagt, coole Idee, aber nein, nein, Axten. Ihm ist nichts anderes eingefallen als Axt. Und nachdem sich das ganze rein musste, waren es halt Axten. Und ich glaube, über dieses Dichter-Niveau sind halt die meisten auch noch nicht rausgekommen. Und wisst ihr was noch anspruchsloser ist, wenn das ganze dann auch noch mit Autotune gemacht ist, dann hört es komplett auf. Dann sind die Texte scheiße, die Musik ist scheiße, dann ist alles scheiße. Da bleib ich doch lieber bei Death Metal oder sowas. Da hat man wenigstens was. Wird ein bisschen gekrunzt. Und ein bisschen merkwürdiges Zeug erzählen. Ich will nicht sagen, dass diese Sachen lyrisch immer sonderlich anspruchsvoll sind, ehrlich gesagt. Aber das höre ich mir 100 mal lieber an. Aha. Naja, gut. Lass ich mal so durchgehen. Oh man, Leute, ich hatte jetzt eigentlich gar nicht vor, dass ich mich über Deutschrap auslasse bzw. mir zwei Videos angucke, bahnen, auswüchse. Aber war doch ganz lustig, muss ich sagen. Fand ich echt unterhaltsam. Also da können wir uns tatsächlich, erinnert mich mal dran, Leute. Wir können uns ab und zu mal da ein Video, falls das eine Serie ist, mal so ein Video aus der Serie angucken. Fand ich doch recht lustig. Nein, Teil drei kann ich mir heute nicht mehr angucken. Das halte ich nicht aus. Morgen machen wir tatsächlich was. Da müssen wir ein bisschen TypeScript üben. Falls das was wird, ich vielleicht räume ich auch morgen hier mal alles fertig auf. Pogscript. Gibt es das? Also ich meine, ich weiß, was du meinst. Es gibt Postscript, aber gibt es schon Pogscript? Hat das schon jemand erfunden? Nein, nein. Pogscript. Nicht Postscript. Pogscript. Okay, nice. Pogscript. HelloWorld.pg. Simple macro language. Pogscript. No, God. No, God, please no. No. Das ist doch auch irgendeine Memesprache, oder? Pogscript. Das sieht aber nicht so, wie ich Pog aus aus. Nicht so Pog. Nee. Dann wird es Zeit. Nein, habe ich noch nicht bestellt. Ja, wenn es nächstes Jahr ist, wird es halt erst nächstes Jahr. Ich habe nämlich immer noch nicht genau geguckt, welche Wasserkühlung ich will oder nicht. Vielleicht doch Luft und was für eine genaue CPU und was für ein genaues Mainboard. Das müssen wir eigentlich auch machen. Vielleicht sollten wir das lieber morgen machen. Vielleicht sollten wir Pogscript morgen verschieben und nicht bauen. Leute, ihr könnt euch heute aussuchen. Und Disclaimer ist nicht gesagt, dass es morgen oder übermorgen wird, aber ich hoffe morgen. Wir machen mal eine Umfrage. Was wollen wir im nächsten Stream machen? Ja, oder 420 kann auch sein. Nächster Stream. Rechnerzusammenstellung. Fertig. Mach. Oder TypeScript. Also die Rechnerzusammenstellung ist ja mehr oder weniger fertig, aber es fehlen halt wirklich noch die wichtigen Details, auch wie schnell der RAM sein soll, welche CPUs genau wird. So grob weiß ich es ja schon. Haben wir schon gemacht. So, das machen wir jetzt gerade noch. Also was wollen wir im nächsten Stream machen? Pass auf, jetzt machen die Leute wieder 50-50. Das ist ja der neueste Trend, dass man versucht 50-50 daraus zu kriegen. Leute, die es nicht interessiert, voten dann mit. Nur um es auf 50-50 zu bringen. Und dadurch, dass ich es jetzt gesagt habe, habe ich Leute sogar noch auf die Idee gebracht, das zu machen. Siehst du, siehst du. Das ist aber typische Twitch Chat Psychologie. Hätte ich das jetzt nicht gesagt, wäre das nicht so eingetreten. Es war nur, weil ich es gesagt habe. Genau, ich wusste, dass das so kommt. 25-25. Und? Und? Verkackt es noch einer? Nein. Sehr schön. Gut gemacht, Chat. Also mache ich einfach, was ich machen will. Good job. Nice, nice, nice. Okay Leute, wir sehen uns, mach's gut. Bis morgen, see you.", "segments": [{"id": 1, "start": 0.0, "end": 2.0, "text": "Das war's für heute."}, {"id": 2, "start": 2.0, "end": 4.0, "text": "Bis zum nächsten Mal."}, {"id": 3, "start": 4.0, "end": 31.0, "text": "Das war's für heute."}, {"id": 4, "start": 31.0, "end": 45.0, "text": "So, moin Leute."}, {"id": 5, "start": 45.0, "end": 47.0, "text": "War heute anstrengend wieder."}, {"id": 6, "start": 47.0, "end": 51.0, "text": "Massiv anstrengend."}, {"id": 7, "start": 51.0, "end": 58.0, "text": "Ich hab den Allemtag aufgeräumt, ich hab ganz viel Zeug gefunden, von dem ich gar nicht wusste, dass ich das noch habe."}, {"id": 8, "start": 58.0, "end": 64.0, "text": "Unter anderem, viel zu viele VGA-Kabeln."}, {"id": 9, "start": 64.0, "end": 68.0, "text": "Ich wusste gar nicht, dass ich im Besitz von so vielen VGA-Kabeln gewesen bin."}, {"id": 10, "start": 68.0, "end": 74.0, "text": "Weil ich hab in der Kiste stehen, was ich da für einen ollen Scheiß gefunden hab, das könnt ihr euch auch nicht vorstellen."}, {"id": 11, "start": 74.0, "end": 76.0, "text": "Also schmeiß ich alles weg, ja."}, {"id": 12, "start": 76.0, "end": 80.0, "text": "Aber da ist so viel Legacy-Technologie in einer Kiste, das könnt ihr euch ja nicht vorstellen."}, {"id": 13, "start": 80.0, "end": 90.0, "text": "Mich eine ganze Kiste voll von THE-Stecker bis kaputtenes Xbox-Kabel."}, {"id": 14, "start": 90.0, "end": 95.0, "text": "Diese alten Stecker für die Wii mit so drei Farben dran."}, {"id": 15, "start": 95.0, "end": 99.0, "text": "Kaputtener uralt Kopfhörer, da wirklich Zeug drin."}, {"id": 16, "start": 99.0, "end": 101.0, "text": "DVI-Kabel in Massen."}, {"id": 17, "start": 101.0, "end": 103.0, "text": "Ich wusste gar nicht, dass ich so viele DVI-Kabel hab."}, {"id": 18, "start": 103.0, "end": 105.0, "text": "VGA-Kabel in Massen."}, {"id": 19, "start": 105.0, "end": 107.0, "text": "Sattkabel, also ohne Scheiß."}, {"id": 20, "start": 107.0, "end": 109.0, "text": "Also was ich da für einen Dreck rumliegen habe, ist der Wahnsinn."}, {"id": 21, "start": 109.0, "end": 112.0, "text": "Zumindest, ich hab alles bisschen ausgemistet."}, {"id": 22, "start": 112.0, "end": 115.0, "text": "Ich hab auch alte Grafikkarte gefunden."}, {"id": 23, "start": 115.0, "end": 117.0, "text": "Eine 980, ne."}, {"id": 24, "start": 117.0, "end": 119.0, "text": "Was für eine ist das?"}, {"id": 25, "start": 119.0, "end": 122.0, "text": "Die 980 kann das sein."}, {"id": 26, "start": 122.0, "end": 124.0, "text": "Es muss viel älter sein."}, {"id": 27, "start": 124.0, "end": 127.0, "text": "Steht das da drauf?"}, {"id": 28, "start": 127.0, "end": 132.0, "text": "Was ist das für eine Grafikkarte, die ich hier gefunden hab?"}, {"id": 29, "start": 132.0, "end": 133.0, "text": "Die ist ziemlich fett."}, {"id": 30, "start": 133.0, "end": 134.0, "text": "Steht da irgendwie drauf, was es ist?"}, {"id": 31, "start": 134.0, "end": 137.0, "text": "Irgendeine Nvidia-Karte ist das."}, {"id": 32, "start": 137.0, "end": 139.0, "text": "Was steht da drauf hier?"}, {"id": 33, "start": 139.0, "end": 141.0, "text": "Made in China."}, {"id": 34, "start": 141.0, "end": 143.0, "text": "Ne."}, {"id": 35, "start": 143.0, "end": 146.0, "text": "Modell steht da drauf."}, {"id": 36, "start": 146.0, "end": 148.0, "text": "P348."}, {"id": 37, "start": 148.0, "end": 152.0, "text": "Keine Ahnung, was für eine Grafikkarte ist."}, {"id": 38, "start": 152.0, "end": 154.0, "text": "Ist aber eine recht fette Grafikkarte."}, {"id": 39, "start": 154.0, "end": 155.0, "text": "Allerdings ist die so alt."}, {"id": 40, "start": 155.0, "end": 158.0, "text": "Die hat nur zwei DVI-Ausgänge und ein S-Video-Ausgang."}, {"id": 41, "start": 158.0, "end": 161.0, "text": "Die scheinen schon ein bisschen älter zu sein."}, {"id": 42, "start": 161.0, "end": 165.0, "text": "Also damit ist nichts mit Krypto-Mine oder sowas."}, {"id": 43, "start": 165.0, "end": 168.0, "text": "Steht gar nicht drauf, was das für eine ist."}, {"id": 44, "start": 168.0, "end": 170.0, "text": "Egal."}, {"id": 45, "start": 170.0, "end": 172.0, "text": "Kommt alles in Müll, Leute."}, {"id": 46, "start": 172.0, "end": 173.0, "text": "Alles in Müll."}, {"id": 47, "start": 173.0, "end": 176.0, "text": "Aber ich hab auch ein paar gute Sachen gefunden."}, {"id": 48, "start": 176.0, "end": 179.0, "text": "9800."}, {"id": 49, "start": 179.0, "end": 182.0, "text": "Ja, das kann tatsächlich sein, so was in der Richtung."}, {"id": 50, "start": 182.0, "end": 187.0, "text": "Also, ich hab auch wirklich Zeug gefunden."}, {"id": 51, "start": 187.0, "end": 189.0, "text": "Das ist gar nicht so schlecht, dass ich das mal gefunden hab."}, {"id": 52, "start": 189.0, "end": 191.0, "text": "Guckt mal hier, was ich gefunden hab."}, {"id": 53, "start": 191.0, "end": 195.0, "text": "Hab ich heute gepostet auf Twitter?"}, {"id": 54, "start": 195.0, "end": 196.0, "text": "Nein, das bin ich nicht."}, {"id": 55, "start": 196.0, "end": 206.0, "text": "Das ist meine Katze, was auch immer, wenn er alles findet."}, {"id": 56, "start": 206.0, "end": 213.0, "text": "Ich hab einen von zwei Super Nintendo-Controllern gefunden."}, {"id": 57, "start": 213.0, "end": 217.0, "text": "Bester Controller ever."}, {"id": 58, "start": 217.0, "end": 220.0, "text": "Warum kann Windows dieses Emote nicht?"}, {"id": 59, "start": 220.0, "end": 222.0, "text": "Was ist das überhaupt für ein Emote?"}, {"id": 60, "start": 222.0, "end": 224.0, "text": "Das da, warum kann Windows das immer noch nicht?"}, {"id": 61, "start": 224.0, "end": 226.0, "text": "Ecke."}, {"id": 62, "start": 226.0, "end": 230.0, "text": "Ah ja."}, {"id": 63, "start": 230.0, "end": 244.0, "text": "Quadro ist es bestimmt nicht."}, {"id": 64, "start": 244.0, "end": 246.0, "text": "Und, ihr werdet es nicht glauben,"}, {"id": 65, "start": 246.0, "end": 249.0, "text": "ich hab meine PS Vita gefunden."}, {"id": 66, "start": 249.0, "end": 250.0, "text": "Guck mal."}, {"id": 67, "start": 250.0, "end": 253.0, "text": "Bisschen staubig, gebe ich zu."}, {"id": 68, "start": 253.0, "end": 255.0, "text": "Die hatte ich drei, vier Mal an, wenn es hochkommt."}, {"id": 69, "start": 255.0, "end": 257.0, "text": "Ich hab auf Twitter zweimal geschrieben."}, {"id": 70, "start": 257.0, "end": 259.0, "text": "Wahrscheinlich stimmt das eher."}, {"id": 71, "start": 259.0, "end": 261.0, "text": "Ich hatte die so gut wie gar nicht an."}, {"id": 72, "start": 261.0, "end": 262.0, "text": "Was mache ich denn damit jetzt?"}, {"id": 73, "start": 262.0, "end": 264.0, "text": "Leute, habt ihr eine klare Idee?"}, {"id": 74, "start": 264.0, "end": 265.0, "text": "Die ist wirklich wie neu."}, {"id": 75, "start": 265.0, "end": 266.0, "text": "Die ist komplett neu."}, {"id": 76, "start": 266.0, "end": 267.0, "text": "Außer, dass sie staubig ist."}, {"id": 77, "start": 267.0, "end": 270.0, "text": "Der Rest ist wirklich wie neu."}, {"id": 78, "start": 270.0, "end": 272.0, "text": "Aber was mache ich damit jetzt?"}, {"id": 79, "start": 272.0, "end": 273.0, "text": "Also, ich meine, ist das jetzt so,"}, {"id": 80, "start": 273.0, "end": 275.0, "text": "als könnte man damit großartig was anfangen?"}, {"id": 81, "start": 275.0, "end": 276.0, "text": "Ja, Customfirma."}, {"id": 82, "start": 276.0, "end": 280.0, "text": "Ich weiß, dass es da für Customfirma und was sich Homepro gibt."}, {"id": 83, "start": 280.0, "end": 287.0, "text": "Aber was gibt es da drauf schon, was man wirklich haben will?"}, {"id": 84, "start": 287.0, "end": 288.0, "text": "Also, wisst ihr, wie ich meine?"}, {"id": 85, "start": 288.0, "end": 290.0, "text": "Es ist ja cool, dass man alles drauf macht,"}, {"id": 86, "start": 290.0, "end": 291.0, "text": "dass man vieles drauf machen kann."}, {"id": 87, "start": 291.0, "end": 293.0, "text": "Das ist so, wie es cool ist,"}, {"id": 88, "start": 293.0, "end": 295.0, "text": "was man mittlerweile mit der Wii alles machen kann."}, {"id": 89, "start": 295.0, "end": 299.0, "text": "Aber was will man damit machen?"}, {"id": 90, "start": 299.0, "end": 303.0, "text": "Also, was hat man davon?"}, {"id": 91, "start": 303.0, "end": 308.0, "text": "Ja, darauf kannst du SNES Zeug emulieren."}, {"id": 92, "start": 308.0, "end": 309.0, "text": "Aber wozu?"}, {"id": 93, "start": 309.0, "end": 310.0, "text": "Warum will ich das?"}, {"id": 94, "start": 310.0, "end": 311.0, "text": "Will ich ja nicht."}, {"id": 95, "start": 311.0, "end": 312.0, "text": "Wo ist der Sinn?"}, {"id": 96, "start": 312.0, "end": 315.0, "text": "Retroarch für unterwegs."}, {"id": 97, "start": 315.0, "end": 320.0, "text": "Ja, gut."}, {"id": 98, "start": 320.0, "end": 329.0, "text": "Ja, dafür ist es tatsächlich gar nicht so blöd."}, {"id": 99, "start": 329.0, "end": 330.0, "text": "Das stimmt schon."}, {"id": 100, "start": 330.0, "end": 332.0, "text": "Da fällt mir jetzt aber eher sonst nichts Vergleichbares ein."}, {"id": 101, "start": 332.0, "end": 335.0, "text": "Da bräuchte ich sonst ein Steam Deck oder sowas."}, {"id": 102, "start": 335.0, "end": 341.0, "text": "Aber das ist halt ein bisschen fett für unterwegs."}, {"id": 103, "start": 341.0, "end": 342.0, "text": "Ja."}, {"id": 104, "start": 342.0, "end": 345.0, "text": "Aber guck mal, hat einfach schon mal 20 Antworten."}, {"id": 105, "start": 345.0, "end": 348.0, "text": "Ach ja, und ich habe noch ein IDE-Kabel gefunden, wusste ich gar nicht."}, {"id": 106, "start": 348.0, "end": 351.0, "text": "Leute, ein Marken-IDE-Kabel."}, {"id": 107, "start": 351.0, "end": 353.0, "text": "Nicht einfach nur ein IDE-Kabel."}, {"id": 108, "start": 353.0, "end": 358.0, "text": "Ein ASUS oder besser gesagt ein ASUS-IDE-Kabel."}, {"id": 109, "start": 358.0, "end": 361.0, "text": "Aber nicht einfach nur ein CD-ROM-Kabel, bitte schön."}, {"id": 110, "start": 361.0, "end": 371.0, "text": "Ich habe so viel altes Zeug heute ausgebundelt."}, {"id": 111, "start": 371.0, "end": 375.0, "text": "Das meiste habe ich komplett direkt einfach in die Tonne gefeffert."}, {"id": 112, "start": 375.0, "end": 379.0, "text": "Ich habe glaube ich heute eine halbe Tonne an Elektroschrott."}, {"id": 113, "start": 379.0, "end": 384.0, "text": "Also nicht Tonne meine ich jetzt nicht das Gewicht, sondern eine Mülltonne."}, {"id": 114, "start": 384.0, "end": 389.0, "text": "Eine halbe Mülltonne voll mit Elektro-Kram und Plastik-Zeug."}, {"id": 115, "start": 389.0, "end": 394.0, "text": "Na ja, was heute so ansteht."}, {"id": 116, "start": 394.0, "end": 397.0, "text": "Ich bin genau ungefähr eine Stunde on oder eineinhalb Stunden."}, {"id": 117, "start": 397.0, "end": 398.0, "text": "Das war es."}, {"id": 118, "start": 398.0, "end": 400.0, "text": "Wir können auch nicht allzu viel machen."}, {"id": 119, "start": 400.0, "end": 402.0, "text": "Wir können vielleicht ein bisschen schwätzen und ein paar Sachen angucken"}, {"id": 120, "start": 402.0, "end": 406.0, "text": "über aktuelle Ereignisse und auslassen, falls es da irgendwas gibt."}, {"id": 121, "start": 406.0, "end": 410.0, "text": "Oder ihr könnt mir sagen, was ich mit meiner PS Vita machen soll."}, {"id": 122, "start": 410.0, "end": 420.0, "text": "Battlefield spielen wir heute nicht."}, {"id": 123, "start": 420.0, "end": 427.0, "text": "Ein bisschen kleines Ticken."}, {"id": 124, "start": 427.0, "end": 436.0, "text": "Warum sind eigentlich alle Anwendungen mittlerweile so scheiße"}, {"id": 125, "start": 436.0, "end": 441.0, "text": "und an Tablet-Bedienung angepasst, dass sie einfach nur sacken für alles andere."}, {"id": 126, "start": 441.0, "end": 445.0, "text": "Ich meine, guck mal, ich habe eine super feine Maus-Auflösung."}, {"id": 127, "start": 445.0, "end": 447.0, "text": "Das ist überhaupt kein Problem."}, {"id": 128, "start": 447.0, "end": 453.0, "text": "Aber ich kann diesen Kack-Slider, diesen Kack-Slider nur so bewegen,"}, {"id": 129, "start": 453.0, "end": 457.0, "text": "dass er entweder zu laut oder zu leise ist."}, {"id": 130, "start": 457.0, "end": 459.0, "text": "Was denkt man sich dabei?"}, {"id": 131, "start": 459.0, "end": 464.0, "text": "Warum macht man seine Anwendung so kacke?"}, {"id": 132, "start": 464.0, "end": 467.0, "text": "Das liegt eigentlich nur daran, dass dieser ganze Krempel ordentlich"}, {"id": 133, "start": 467.0, "end": 470.0, "text": "auf Smartphones und Tablets funktioniert"}, {"id": 134, "start": 470.0, "end": 472.0, "text": "und Desktop interessiert wirklich kein Sau mehr."}, {"id": 135, "start": 472.0, "end": 474.0, "text": "So, ich muss mal kurz dieses Plugin wieder einschalten."}, {"id": 136, "start": 474.0, "end": 477.0, "text": "Warum habe ich das eigentlich disabled?"}, {"id": 137, "start": 477.0, "end": 481.0, "text": "Volume Master, genau, das brauche ich."}, {"id": 138, "start": 481.0, "end": 484.0, "text": "Volume Master."}, {"id": 139, "start": 484.0, "end": 493.0, "text": "Da kann ich jetzt nämlich so runterstellen, dann geht das wieder gescheit."}, {"id": 140, "start": 493.0, "end": 496.0, "text": "Richtig hängen geblieben."}, {"id": 141, "start": 496.0, "end": 498.0, "text": "Ja, jetzt ist die Lautstärke genau richtig."}, {"id": 142, "start": 498.0, "end": 513.0, "text": "Das ist wieder ein richtiger Mobile-Crap alles."}, {"id": 143, "start": 513.0, "end": 527.0, "text": "Noch schlimmer, bloß, wenn das Ganze dann auch in der Elektron-Anwendung verpackt ist."}, {"id": 144, "start": 527.0, "end": 530.0, "text": "Pfeil-Taste hoch und runter ist ja noch cooler."}, {"id": 145, "start": 530.0, "end": 533.0, "text": "Sorry, vor Basch, Dankeschön für den Sub."}, {"id": 146, "start": 533.0, "end": 535.0, "text": "Nee, nee, heute nicht."}, {"id": 147, "start": 535.0, "end": 537.0, "text": "Hat Max eigentlich Only-Fans?"}, {"id": 148, "start": 537.0, "end": 541.0, "text": "Nee, kein Only-Fans, ich habe nur Fansli."}, {"id": 149, "start": 541.0, "end": 551.0, "text": "Ich sage Only-Fans, ich benutze nur noch Fansli."}, {"id": 150, "start": 551.0, "end": 553.0, "text": "Wahrscheinlich nicht gut genug, nee."}, {"id": 151, "start": 553.0, "end": 562.0, "text": "Nicht nur gut genug, dafür gehe ich mal von aus."}, {"id": 152, "start": 562.0, "end": 563.0, "text": "Ja, das ist normal."}, {"id": 153, "start": 563.0, "end": 564.0, "text": "Ich weiß nicht, ob ich..."}, {"id": 154, "start": 564.0, "end": 565.0, "text": "Doch, habe ich, habe ich erzählt."}, {"id": 155, "start": 565.0, "end": 571.0, "text": "Meinem Chef, also meinem aktuellen Chef wurde tatsächlich auf YouTube mein Schnee-Video empfohlen."}, {"id": 156, "start": 571.0, "end": 576.0, "text": "Also durch den, durch den Schneestell-Video."}, {"id": 157, "start": 576.0, "end": 579.0, "text": "Ziemlich cringe."}, {"id": 158, "start": 579.0, "end": 582.0, "text": "Aber irgendwie ein bisschen merkwürdig gewesen, als der mir das erzählt hat."}, {"id": 159, "start": 582.0, "end": 584.0, "text": "Ich hatte ein Video von mir gesehen, wo ich durch den Schnee gelaufen bin."}, {"id": 160, "start": 584.0, "end": 589.0, "text": "Hab ich mir gedacht, oh nein, das ist bei dir jetzt auch schon so weit gewesen, ja."}, {"id": 161, "start": 589.0, "end": 593.0, "text": "YouTube hat dir mein Schnee-Video empfohlen."}, {"id": 162, "start": 593.0, "end": 595.0, "text": "Ich verstehe nicht, warum dieses Video..."}, {"id": 163, "start": 595.0, "end": 601.0, "text": "Seriously, warum wird dieses Video empfohlen?"}, {"id": 164, "start": 601.0, "end": 603.0, "text": "Ich verstehe es nicht."}, {"id": 165, "start": 603.0, "end": 605.0, "text": "Ich habe keine Ahnung, Alter."}, {"id": 166, "start": 605.0, "end": 607.0, "text": "YouTube..."}, {"id": 167, "start": 607.0, "end": 612.0, "text": "Muss man nicht verstehen, oder?"}, {"id": 168, "start": 612.0, "end": 615.0, "text": "Muss man echt nicht verstehen."}, {"id": 169, "start": 615.0, "end": 616.0, "text": "Quatsch, die meisten Leute..."}, {"id": 170, "start": 616.0, "end": 621.0, "text": "Okay, okay, vielleicht habe ich die meisten Leute mal gesehen durch dieses Video."}, {"id": 171, "start": 621.0, "end": 625.0, "text": "Wer abonniert und regelmäßig guckt, tut durch dieses Video so gut wie niemand."}, {"id": 172, "start": 625.0, "end": 627.0, "text": "Warum auch?"}, {"id": 173, "start": 627.0, "end": 631.0, "text": "Ich meine, niemand, der mich vorher nicht kannte, bzw. die Videos und den Content nicht kannte"}, {"id": 174, "start": 631.0, "end": 635.0, "text": "und dem das Schnee-Video empfohlen würde, hat sich nach dem Schnee-Video gedacht, oh ja."}, {"id": 175, "start": 635.0, "end": 638.0, "text": "Den Max, den muss ich mir öfters angucken."}, {"id": 176, "start": 638.0, "end": 639.0, "text": "Die Leute haben..."}, {"id": 177, "start": 639.0, "end": 643.0, "text": "Das Schnee-Video hat, glaube ich, mit die kürzeste View-Time überhaupt bei mir auf dem Channel."}, {"id": 178, "start": 643.0, "end": 646.0, "text": "Das hat irgendwie 35 Sekunden View-Time von 7 Minuten oder so."}, {"id": 179, "start": 646.0, "end": 652.0, "text": "Normalerweise habe ich irgendwie 50-60% der Video-Länge View-Time oder teilweise mehr."}, {"id": 180, "start": 652.0, "end": 656.0, "text": "Bei kürzeren Videos ist es tatsächlich oftmals sogar höher, weil die Leute halt eben länger durchhalten."}, {"id": 181, "start": 656.0, "end": 658.0, "text": "Also, prozentual."}, {"id": 182, "start": 658.0, "end": 660.0, "text": "Aber dort, ich meine, ich kann es verstehen."}, {"id": 183, "start": 660.0, "end": 662.0, "text": "Wer will sich das auch angucken?"}, {"id": 184, "start": 662.0, "end": 667.0, "text": "Das ist vielleicht für Leute damals interessant gewesen, als ich noch die ganzen Baustellen-Videos ab und zu gezeigt habe."}, {"id": 185, "start": 667.0, "end": 670.0, "text": "Aber das ist auch schon 10 Jahre her fast."}, {"id": 186, "start": 670.0, "end": 673.0, "text": "Sag mal, ist das irgendwelche Bots?"}, {"id": 187, "start": 673.0, "end": 677.0, "text": "Also, ich meine, Darkseid, du bist kein Bot, das weiß ich, weil du bist öfters hier, aber..."}, {"id": 188, "start": 677.0, "end": 680.0, "text": "Diese Fragen..."}, {"id": 189, "start": 680.0, "end": 683.0, "text": "Ich habe langsam das Gefühl..."}, {"id": 190, "start": 683.0, "end": 686.0, "text": "Es gibt echt irgendwelche Bots, die das fragen."}, {"id": 191, "start": 686.0, "end": 691.0, "text": "Das kommt jeden Stream bestimmt fünfmal diese Frage, ob ich Seven vs. Wild gucke."}, {"id": 192, "start": 691.0, "end": 695.0, "text": "Nee, gucke ich nicht. Ich habe auch die erste Staffel nicht geguckt."}, {"id": 193, "start": 695.0, "end": 709.0, "text": "Und ich muss auch ehrlich sagen, interessiert mich auch überhaupt nicht."}, {"id": 194, "start": 709.0, "end": 711.0, "text": "Keck B, genau."}, {"id": 195, "start": 711.0, "end": 723.0, "text": "Und weil ich da sein muss, Keckl ist das bessere Emote."}, {"id": 196, "start": 723.0, "end": 730.0, "text": "Vodafone hat heute eine Umfrage gemacht auf Twitter,"}, {"id": 197, "start": 730.0, "end": 735.0, "text": "wo es darum ging, ob die Leute wissen, was Scam bedeutet."}, {"id": 198, "start": 735.0, "end": 738.0, "text": "Und da wollte ich eigentlich drauf fragen..."}, {"id": 199, "start": 738.0, "end": 742.0, "text": "Weiß ich, ja, nicht jetzt..."}, {"id": 200, "start": 742.0, "end": 744.0, "text": "Oh Gott, Twitter, man."}, {"id": 201, "start": 744.0, "end": 750.0, "text": "Da wollte ich eigentlich drauf antworten..."}, {"id": 202, "start": 750.0, "end": 754.0, "text": "Unity Media hat mich mal gescampt."}, {"id": 203, "start": 754.0, "end": 760.0, "text": "Mir wurde versprochen, ich bekomme eine richtige IPv4-Adresse weiterhin und hatte auf einmal Dual-Stack-Lite."}, {"id": 204, "start": 760.0, "end": 764.0, "text": "Und damit man das beheben konnte, bezahle ich jetzt doppelt Power-Upload."}, {"id": 205, "start": 764.0, "end": 766.0, "text": "Obwohl ich eigentlich nur einmal Upload bekomme."}, {"id": 206, "start": 766.0, "end": 769.0, "text": "Aber ich bezahle es trotzdem doppelt."}, {"id": 207, "start": 769.0, "end": 781.0, "text": "Und ich traue mich nicht daran, was zu ändern, weil ich sonst wieder Dual-Stack-Lite vielleicht bekomme."}, {"id": 208, "start": 781.0, "end": 783.0, "text": "Warum hat Vodafone noch das Pride-Empflecht?"}, {"id": 209, "start": 783.0, "end": 785.0, "text": "Sind sie Super Pride? Keine Ahnung."}, {"id": 210, "start": 785.0, "end": 789.0, "text": "Kappa Pride."}, {"id": 211, "start": 789.0, "end": 794.0, "text": "Ja, genau, diese komische Umfrage hier meine ich."}, {"id": 212, "start": 794.0, "end": 796.0, "text": "Ja, Vodafone hat mich gescampt."}, {"id": 213, "start": 796.0, "end": 799.0, "text": "Damals aber noch Unity Media."}, {"id": 214, "start": 799.0, "end": 800.0, "text": "Scam, was ist das?"}, {"id": 215, "start": 800.0, "end": 803.0, "text": "Ach nee, man darf hier nicht abstimmen, wenn man nicht eingeloggt ist."}, {"id": 216, "start": 803.0, "end": 805.0, "text": "Wann eigentlich noch... Ach ja."}, {"id": 217, "start": 805.0, "end": 808.0, "text": "Da weiß ich nicht, soll ich da was zu erzählen?"}, {"id": 218, "start": 808.0, "end": 812.0, "text": "Ich war in Würzburg."}, {"id": 219, "start": 812.0, "end": 817.0, "text": "Und da war ich zum Vorstellungsgespräch in Würzburg."}, {"id": 220, "start": 817.0, "end": 819.0, "text": "Und ich will jetzt nicht glauben..."}, {"id": 221, "start": 819.0, "end": 821.0, "text": "Nee, das erzähle ich im Video, Leute."}, {"id": 222, "start": 821.0, "end": 824.0, "text": "Das erzähle ich im Video."}, {"id": 223, "start": 824.0, "end": 830.0, "text": "Ich will jetzt nicht spoilern, ihr müsst euch dann alle morgen das Video angucken."}, {"id": 224, "start": 830.0, "end": 833.0, "text": "Das Video kriegt aber so einen richtig krassen Titel, so nach dem Motto"}, {"id": 225, "start": 833.0, "end": 837.0, "text": "Neuer Job"}, {"id": 226, "start": 837.0, "end": 844.0, "text": "Oder Vorstellungsgespräch direkt verkackt oder irgendwie sowas oder"}, {"id": 227, "start": 844.0, "end": 847.0, "text": "Bewerbung Zukunft ruiniert oder"}, {"id": 228, "start": 847.0, "end": 852.0, "text": "Irgendwie sowas in der Richtung."}, {"id": 229, "start": 852.0, "end": 854.0, "text": "Das braucht so eine richtige Hand."}, {"id": 230, "start": 854.0, "end": 855.0, "text": "Aber ihr wisst ja..."}, {"id": 231, "start": 855.0, "end": 861.0, "text": "Leute, ich verrate euch jetzt mal den besten Trick"}, {"id": 232, "start": 861.0, "end": 866.0, "text": "Für Clickbait-Thumbnails."}, {"id": 233, "start": 866.0, "end": 868.0, "text": "Macht einfach..."}, {"id": 234, "start": 868.0, "end": 869.0, "text": "Oder auch für Titel."}, {"id": 235, "start": 869.0, "end": 874.0, "text": "Also, dass ihr was lernt, so wie das auf YouTube funktioniert."}, {"id": 236, "start": 874.0, "end": 876.0, "text": "Korrekt."}, {"id": 237, "start": 876.0, "end": 880.0, "text": "Ihr macht einfach Fragezeichen in den Titel."}, {"id": 238, "start": 880.0, "end": 882.0, "text": "Also entweder ihr macht in den Thumbnail ein Fragezeichen"}, {"id": 239, "start": 882.0, "end": 884.0, "text": "Oder ihr macht in den Titel ein Fragezeichen."}, {"id": 240, "start": 884.0, "end": 887.0, "text": "Weil dann könnt ihr in das Thumbnail und in den Titel das eine schreiben"}, {"id": 241, "start": 887.0, "end": 890.0, "text": "Und im Video was komplett anderes behaupten."}, {"id": 242, "start": 890.0, "end": 892.0, "text": "Oder was komplett anderes sagen."}, {"id": 243, "start": 892.0, "end": 896.0, "text": "Und wenn dann einer sagt, aber im Titel steht doch ganz was anderes"}, {"id": 244, "start": 896.0, "end": 906.0, "text": "Dann kannst du sagen, ne, im Video, Titel ist ein Fragezeichen."}, {"id": 245, "start": 906.0, "end": 913.0, "text": "Alter, Sixhead-Titel, das muss ich mir aufschreiben."}, {"id": 246, "start": 913.0, "end": 916.0, "text": "Bald..."}, {"id": 247, "start": 916.0, "end": 918.0, "text": "Der beste Titel, Alter."}, {"id": 248, "start": 918.0, "end": 923.0, "text": "Das mach ich morgen als Titel, Alter."}, {"id": 249, "start": 923.0, "end": 926.0, "text": "Neuer Job, Vorstellungsgespräch verkackt."}, {"id": 250, "start": 926.0, "end": 935.0, "text": "Bald Arbeitslos."}, {"id": 251, "start": 935.0, "end": 950.0, "text": "Das ist der beste Titel, Alter, das muss ich mir aufschreiben."}, {"id": 252, "start": 950.0, "end": 951.0, "text": "Das hab ich mir jetzt aufgeschrieben."}, {"id": 253, "start": 951.0, "end": 953.0, "text": "Irgendwas in der Richtung, irgendwas..."}, {"id": 254, "start": 953.0, "end": 957.0, "text": "Irgendwas baue ich da draus."}, {"id": 255, "start": 957.0, "end": 958.0, "text": "Bald drogenabhängig."}, {"id": 256, "start": 958.0, "end": 960.0, "text": "Hey, dazu mach ich noch ein eigenes Video."}, {"id": 257, "start": 960.0, "end": 962.0, "text": "Ich hab euch ja schon ein paar mal die Story erzählt,"}, {"id": 258, "start": 962.0, "end": 966.0, "text": "wo ich quasi einen halben Tag quasi drogenabhängiger war."}, {"id": 259, "start": 966.0, "end": 968.0, "text": "Also nicht wirklich."}, {"id": 260, "start": 968.0, "end": 975.0, "text": "Wo die Frankfurter Drogenabhängigen dachten, ich bin einer von ihnen."}, {"id": 261, "start": 975.0, "end": 977.0, "text": "Das hab ich euch ja schon ein paar mal erzählt."}, {"id": 262, "start": 977.0, "end": 979.0, "text": "Das müsste ich eigentlich auch mal in Video verkacken."}, {"id": 263, "start": 979.0, "end": 982.0, "text": "Verpacken, nicht verkacken."}, {"id": 264, "start": 982.0, "end": 984.0, "text": "Das ist einfach so eine kurze Geschichte eigentlich."}, {"id": 265, "start": 984.0, "end": 986.0, "text": "Da kann ich kein eigenes Video draus machen."}, {"id": 266, "start": 986.0, "end": 989.0, "text": "Da muss ich noch ein paar andere Sachen dazu erzählen."}, {"id": 267, "start": 989.0, "end": 992.0, "text": "Vielleicht mach ich ja irgendwie so Frankfurt-Story."}, {"id": 268, "start": 992.0, "end": 994.0, "text": "Immer so ein, zwei Sachen."}, {"id": 269, "start": 994.0, "end": 996.0, "text": "Weil ich hab da schon wirklich ganz viel merkwürdiges Zeug."}, {"id": 270, "start": 996.0, "end": 1000.0, "text": "Der eine, der seine Bekannte überfallen hat in Frankfurt,"}, {"id": 271, "start": 1000.0, "end": 1004.0, "text": "wo ich mir auch dachte, was zum Teufel ist, wo der euch los?"}, {"id": 272, "start": 1004.0, "end": 1017.0, "text": "Frankfurt Hauptbahnhof einfach anderer Planet."}, {"id": 273, "start": 1017.0, "end": 1025.0, "text": "Ich fand Sariks Titel besser, weil arbeitslos."}, {"id": 274, "start": 1025.0, "end": 1028.0, "text": "Wen juckt Bürgergeld?"}, {"id": 275, "start": 1028.0, "end": 1030.0, "text": "By the way, wen juckt Bürgergeld?"}, {"id": 276, "start": 1030.0, "end": 1032.0, "text": "Wisst ihr, was anscheinend auch keinen juckt?"}, {"id": 277, "start": 1032.0, "end": 1035.0, "text": "Die ganze Geschichte mit dem 49-Euro-Ticket."}, {"id": 278, "start": 1035.0, "end": 1038.0, "text": "Ich hab heute gelesen, 49-Euro-Ticket soll erst im Mai kommen."}, {"id": 279, "start": 1038.0, "end": 1040.0, "text": "Und können ihr euch dran erinnern, was ich die letzten Monate"}, {"id": 280, "start": 1040.0, "end": 1044.0, "text": "über immer gesagt hab, auch schon im Stream?"}, {"id": 281, "start": 1044.0, "end": 1045.0, "text": "Was hab ich gesagt?"}, {"id": 282, "start": 1045.0, "end": 1048.0, "text": "Wer erinnert sich? Mehrfach."}, {"id": 283, "start": 1048.0, "end": 1050.0, "text": "Ich hab gesagt, ich glaube nicht dran, dass dieses Ticket"}, {"id": 284, "start": 1050.0, "end": 1052.0, "text": "nächstes Jahr kommt."}, {"id": 285, "start": 1052.0, "end": 1054.0, "text": "Und dann habt ihr gesagt, doch, doch, das ist doch schon alles"}, {"id": 286, "start": 1054.0, "end": 1056.0, "text": "bestimmt worden und das ist doch schon alles beschlossen."}, {"id": 287, "start": 1056.0, "end": 1060.0, "text": "Leute, bis ich das Ding nicht in der Hand halte, glaube ich da an nichts."}, {"id": 288, "start": 1060.0, "end": 1062.0, "text": "Die werden es irgendwie verkacken."}, {"id": 289, "start": 1062.0, "end": 1066.0, "text": "Und auf diesem Standpunkt bleibe ich."}, {"id": 290, "start": 1066.0, "end": 1068.0, "text": "Und das hat man jetzt gesehen."}, {"id": 291, "start": 1068.0, "end": 1074.0, "text": "Die Anfänge davon sind schon wieder am Start."}, {"id": 292, "start": 1074.0, "end": 1075.0, "text": "Mai."}, {"id": 293, "start": 1075.0, "end": 1078.0, "text": "Alter, was kriegen die eigentlich gebacken?"}, {"id": 294, "start": 1078.0, "end": 1088.0, "text": "Was kriegen sie gebacken?"}, {"id": 295, "start": 1088.0, "end": 1091.0, "text": "Kannst ja Coop mit dem Held machen."}, {"id": 296, "start": 1091.0, "end": 1092.0, "text": "Hä?"}, {"id": 297, "start": 1092.0, "end": 1094.0, "text": "Ach."}, {"id": 298, "start": 1094.0, "end": 1095.0, "text": "Jetzt weiß ich, was du meinst."}, {"id": 299, "start": 1095.0, "end": 1097.0, "text": "Ja, weil der auch aus Frankfurt kommt."}, {"id": 300, "start": 1097.0, "end": 1100.0, "text": "Der kennt mich nicht, ich kenn ihn nicht."}, {"id": 301, "start": 1100.0, "end": 1108.0, "text": "Ich muss die Leute zum Coop, zum Coop schon kennen."}, {"id": 302, "start": 1108.0, "end": 1109.0, "text": "Und wieder Hachi Baited."}, {"id": 303, "start": 1109.0, "end": 1113.0, "text": "Leute, ich verstehe es nicht, wie sie das nicht auf die Reihe kriegen."}, {"id": 304, "start": 1113.0, "end": 1117.0, "text": "Ich meine, es ist schon bitter genug, dass es keinen direkten Nachfolger gab."}, {"id": 305, "start": 1117.0, "end": 1120.0, "text": "Anschließend direkt an das 9-Euro-Ticket."}, {"id": 306, "start": 1120.0, "end": 1122.0, "text": "Dass es 9 Euro eigentlich viel zu wenig waren."}, {"id": 307, "start": 1122.0, "end": 1124.0, "text": "Das, ja."}, {"id": 308, "start": 1124.0, "end": 1126.0, "text": "Okay, 49 finde ich okay."}, {"id": 309, "start": 1126.0, "end": 1128.0, "text": "Ganz ehrlich, 69 hätte ich auch noch okay gefunden."}, {"id": 310, "start": 1128.0, "end": 1130.0, "text": "Ich meine, das Monat-Ticket von 69."}, {"id": 311, "start": 1130.0, "end": 1134.0, "text": "Das Gute an diesem 49-Euro-Ticket ist ja, es ist Zug und Bus."}, {"id": 312, "start": 1134.0, "end": 1137.0, "text": "Und es ist halt deutschlandweit."}, {"id": 313, "start": 1137.0, "end": 1146.0, "text": "Leute, das Beste, ganz ehrlich, das Beste, das ist doch die Leute, die mit dem Auto fahren wollen."}, {"id": 314, "start": 1146.0, "end": 1153.0, "text": "Also du wirst wahrscheinlich keinen vom Gegenteil überzeugen, ob 49 oder 9 Euro."}, {"id": 315, "start": 1153.0, "end": 1155.0, "text": "Das denken vielleicht die, die sich irgendwo festkleben oder so."}, {"id": 316, "start": 1155.0, "end": 1158.0, "text": "Habe ich heute auch schon auf Twitter gelesen, dass die sich darüber aufregen."}, {"id": 317, "start": 1158.0, "end": 1159.0, "text": "49-Euro-Ticket viel zu teuer."}, {"id": 318, "start": 1159.0, "end": 1163.0, "text": "Ganz im Ernst, ob das jetzt 49 Euro oder 9 Euro kostet."}, {"id": 319, "start": 1163.0, "end": 1167.0, "text": "Jemand, der gerne Auto fährt, dem ist das doch wurscht, ob das jetzt 49 oder 9 Euro."}, {"id": 320, "start": 1167.0, "end": 1171.0, "text": "Der wird beides, wird der nicht benutzen."}, {"id": 321, "start": 1171.0, "end": 1174.0, "text": "Selbst wenn es wahrscheinlich umsonst so wäre, würde das nicht machen."}, {"id": 322, "start": 1174.0, "end": 1180.0, "text": "Aber wisst ihr, was das eigentlich wirklich Gute ist am 49-Euro-Ticket?"}, {"id": 323, "start": 1180.0, "end": 1190.0, "text": "Das ist, dass du dich in Deutschland nicht mehr mit diesem ganzen Tarifverbund und Verkehrsverbund shit befassen musst."}, {"id": 324, "start": 1190.0, "end": 1194.0, "text": "Die Musik ist unterschiedlich laut, das nervt mich."}, {"id": 325, "start": 1194.0, "end": 1195.0, "text": "Zack."}, {"id": 326, "start": 1195.0, "end": 1197.0, "text": "Ich mach mal ein bisschen was anderes an."}, {"id": 327, "start": 1197.0, "end": 1199.0, "text": "Mach mal nochmal Dings hier."}, {"id": 328, "start": 1199.0, "end": 1201.0, "text": "Crypt of the Necro Dancer Soundtrack."}, {"id": 329, "start": 1201.0, "end": 1211.0, "text": "Der ist gut."}, {"id": 330, "start": 1211.0, "end": 1218.0, "text": "Ja, das Beste ist, dass du dich mit diesem 49-Euro-Ticket nicht mehr mit Verkehrsverbünden und Nahverkehr,"}, {"id": 331, "start": 1218.0, "end": 1221.0, "text": "und gilt das in der Bahn, gilt das auch für den Nahverkehr in der Stadt."}, {"id": 332, "start": 1221.0, "end": 1223.0, "text": "Du musst dich einfach mit nichts mehr beschäftigen."}, {"id": 333, "start": 1223.0, "end": 1226.0, "text": "Du kaufst dir so ein Ticket und fährst einfach in Deutschland rum, wie du lustig bist."}, {"id": 334, "start": 1226.0, "end": 1227.0, "text": "Fertig."}, {"id": 335, "start": 1227.0, "end": 1231.0, "text": "Ich kann mich noch dran erinnern, als ich mit dem Felix damals zur Gamescom gefahren bin."}, {"id": 336, "start": 1231.0, "end": 1235.0, "text": "Also zur ersten Gamescom, wo wir hingefahren sind zusammen."}, {"id": 337, "start": 1235.0, "end": 1245.0, "text": "Da sind wir in Köln angekommen und wollten uns so eine Wochenkarte kaufen."}, {"id": 338, "start": 1245.0, "end": 1248.0, "text": "Also was macht man?"}, {"id": 339, "start": 1248.0, "end": 1253.0, "text": "Man geht an den Automat, drückt auf Wochenkarte und dann kommt eine Karte raus."}, {"id": 340, "start": 1253.0, "end": 1254.0, "text": "So weit so gut."}, {"id": 341, "start": 1254.0, "end": 1260.0, "text": "Da kam eine Karte raus und unten auf dieser Karte stand drauf, also wir haben bezahlt,"}, {"id": 342, "start": 1260.0, "end": 1264.0, "text": "es kam eine Wochenkarte raus und unten auf der Wochenkarte, nachdem wir bezahlt hatten"}, {"id": 343, "start": 1264.0, "end": 1270.0, "text": "auf diesem Ticket, stand drauf, nur gültig mit, frag mich nicht, Kölner Verkehrsverbundsnummer"}, {"id": 344, "start": 1270.0, "end": 1272.0, "text": "oder sowas in der Richtung stand da drauf."}, {"id": 345, "start": 1272.0, "end": 1276.0, "text": "Da haben wir uns eingeschaut, haben gesagt, wir haben eine Wochenkarte, wir haben dafür bezahlt,"}, {"id": 346, "start": 1276.0, "end": 1279.0, "text": "aber jetzt steht auf der Karte drauf, die wäre nicht gültig?"}, {"id": 347, "start": 1279.0, "end": 1281.0, "text": "Was ist das denn?"}, {"id": 348, "start": 1281.0, "end": 1288.0, "text": "Okay, sind wir dort in dieses komische Infocenter gegangen und haben der Frau das gezeigt und"}, {"id": 349, "start": 1288.0, "end": 1290.0, "text": "die hat sich diese Karte angeguckt."}, {"id": 350, "start": 1290.0, "end": 1294.0, "text": "Also wohlgemerkt, das ist eine vom Kölner Verkehrsverbund, die müsste das eigentlich"}, {"id": 351, "start": 1294.0, "end": 1298.0, "text": "wissen, hat sich diese Karte angeguckt und hat gemeint, das kann ich ihnen jetzt aber"}, {"id": 352, "start": 1298.0, "end": 1302.0, "text": "auch nicht sagen, was das da drauf macht."}, {"id": 353, "start": 1302.0, "end": 1306.0, "text": "Aber sie können von uns so eine Karte haben, da müssen wir das hier ausfüllen."}, {"id": 354, "start": 1306.0, "end": 1310.0, "text": "Nein, wir wollen nicht Köln Verkehrsverbund Mitglied werden, wir wollen einfach mit unserer"}, {"id": 355, "start": 1310.0, "end": 1314.0, "text": "Wochenkarte fahren, die wir gerade aus dem Automat geholt haben."}, {"id": 356, "start": 1314.0, "end": 1318.0, "text": "Okay, sind wir raus, haben es dem Busfahrer gezeigt, haben den Busfahrer gefragt, ja wissen"}, {"id": 357, "start": 1318.0, "end": 1321.0, "text": "Sie, wofür ist denn jetzt eigentlich dieses Feld da unten?"}, {"id": 358, "start": 1321.0, "end": 1326.0, "text": "Meint der Busfahrer, keine Ahnung, steigt einfach ein und es hat danach nie jemand wieder"}, {"id": 359, "start": 1326.0, "end": 1327.0, "text": "gefragt."}, {"id": 360, "start": 1327.0, "end": 1329.0, "text": "Aber warum ist das überhaupt ein Ding?"}, {"id": 361, "start": 1329.0, "end": 1330.0, "text": "Warum steht da überhaupt sowas drauf?"}, {"id": 362, "start": 1330.0, "end": 1335.0, "text": "Warum ist das einfach alles von inkompetenten Kackspasten gemacht in Deutschland, sowas?"}, {"id": 363, "start": 1335.0, "end": 1337.0, "text": "Wie dumm kann man sowas eigentlich gestalten?"}, {"id": 364, "start": 1337.0, "end": 1342.0, "text": "Das ist doch nicht von Menschen für Menschen gemacht, das ist einfach von irgendwelchen"}, {"id": 365, "start": 1342.0, "end": 1346.0, "text": "hirnlosen Leuten, die den Scheiß selbst nicht benutzen müssen gemacht."}, {"id": 366, "start": 1346.0, "end": 1348.0, "text": "Und das ist an ganz vielen Stellen so."}, {"id": 367, "start": 1348.0, "end": 1352.0, "text": "Und das hat mich so aufgeregt, wo ich mir gedacht habe, das kann doch nicht sein, das"}, {"id": 368, "start": 1352.0, "end": 1356.0, "text": "steht drauf, das ist nicht gültig und du sollst jetzt trotzdem damit fahren, obwohl drauf steht,"}, {"id": 369, "start": 1356.0, "end": 1357.0, "text": "dass es nicht gültig ist."}, {"id": 370, "start": 1357.0, "end": 1361.0, "text": "Ähm, das, das, deswegen."}, {"id": 371, "start": 1361.0, "end": 1366.0, "text": "Und das Gute ist, das Gute, das ist das wirklich Gute an diesem 49 Euro, es hat ja wirklich"}, {"id": 372, "start": 1366.0, "end": 1368.0, "text": "keinen interessiert, ob wir da so eine Nummer hatten oder nicht."}, {"id": 373, "start": 1368.0, "end": 1370.0, "text": "Kannste ja, ist ja auch besteuert."}, {"id": 374, "start": 1370.0, "end": 1374.0, "text": "Wäre ihr auch überhaupt nicht gültig, nachdem du es gekauft hast, nachdem du es bezahlt hast,"}, {"id": 375, "start": 1374.0, "end": 1378.0, "text": "zu sagen, ach nö, ihr habt es bezahlt, aber jetzt ist es doch nicht mehr gültig."}, {"id": 376, "start": 1378.0, "end": 1383.0, "text": "So, aber das ist das, das ist wirklich das Gute am 49 Euro Ticket."}, {"id": 377, "start": 1383.0, "end": 1387.0, "text": "Du kaufst dir so ein Ticket, du steigst irgendwo ein, du fährst innerhalb Deutschland irgendwo"}, {"id": 378, "start": 1387.0, "end": 1388.0, "text": "hin und das ist gut."}, {"id": 379, "start": 1388.0, "end": 1392.0, "text": "Ich bin zum Beispiel nach Würzburg gefahren, am Montag."}, {"id": 380, "start": 1392.0, "end": 1396.0, "text": "Und es ging ohne weiteres erstmal gar nicht."}, {"id": 381, "start": 1396.0, "end": 1401.0, "text": "Also ich hätte mit meinem normalen RMV-Ticket, also ich hab ja so ein RMV-Ticket, da nicht"}, {"id": 382, "start": 1401.0, "end": 1405.0, "text": "hinfahren können, weil das nicht Bestandteil vom RMV ist."}, {"id": 383, "start": 1405.0, "end": 1408.0, "text": "Ich kann mit meinem Ticket nur im gesamten RMV-Gebiet fahren."}, {"id": 384, "start": 1408.0, "end": 1414.0, "text": "Ich kann nicht außerhalb des RMV-Gebiets fahren, das heißt Würzburg geht nicht, weil Würzburg"}, {"id": 385, "start": 1414.0, "end": 1415.0, "text": "ist Bayern."}, {"id": 386, "start": 1415.0, "end": 1425.0, "text": "Das ist zu geil, oder?"}, {"id": 387, "start": 1425.0, "end": 1428.0, "text": "Zumindest, was hab ich gemacht?"}, {"id": 388, "start": 1428.0, "end": 1434.0, "text": "Logischerweise, ich hab kein normales Bayern-Verkehrsticket gekauft, weil das normale Bayern-Verkehr,"}, {"id": 389, "start": 1434.0, "end": 1443.0, "text": "also das normale Fahrt-Ticket für den RE hätte 26 Euro einfach gekostet."}, {"id": 390, "start": 1443.0, "end": 1450.0, "text": "26 Euro von Hanau nach Würzburg, einfach 26 Euro gekostet."}, {"id": 391, "start": 1450.0, "end": 1453.0, "text": "Alter, nee oder sogar 36 oder so."}, {"id": 392, "start": 1453.0, "end": 1454.0, "text": "Total bescheuert."}, {"id": 393, "start": 1454.0, "end": 1455.0, "text": "Fährt niemand."}, {"id": 394, "start": 1455.0, "end": 1456.0, "text": "Was hab ich gemacht?"}, {"id": 395, "start": 1456.0, "end": 1461.0, "text": "Ich hab mir ein Bayern-Ticket geholt für 25 Euro oder 28 Euro oder so."}, {"id": 396, "start": 1461.0, "end": 1465.0, "text": "So, und da bin ich ein paar Stationen gefahren mit meinem RMV-Ticket."}, {"id": 397, "start": 1465.0, "end": 1467.0, "text": "Nee, hatte ich keinen Bock."}, {"id": 398, "start": 1467.0, "end": 1474.0, "text": "Da bin ich ein paar Stationen gefahren mit meinem RMV-Ticket bis zur Grenze von Bayern."}, {"id": 399, "start": 1474.0, "end": 1478.0, "text": "Und dann hab ich das Bayern-Ticket benutzt."}, {"id": 400, "start": 1478.0, "end": 1485.0, "text": "Und ihr werdet es nicht glauben, aber das Bayern-Ticket ist gültig ab 9 Uhr."}, {"id": 401, "start": 1485.0, "end": 1488.0, "text": "Ratet mal, und das ist kein Spaß, Leute, ich erzähl euch jetzt keinen Mist."}, {"id": 402, "start": 1488.0, "end": 1491.0, "text": "Das Bayern-Ticket ist gültig ab 9 Uhr."}, {"id": 403, "start": 1491.0, "end": 1497.0, "text": "Ratet mal, um wie viel Uhr ich kontrolliert wurde, wo einer vorbeigekommen ist."}, {"id": 404, "start": 1497.0, "end": 1502.0, "text": "War kurz nach Hanau, war kurz nach Hanau."}, {"id": 405, "start": 1502.0, "end": 1504.0, "text": "Ja, so in dem Dreh."}, {"id": 406, "start": 1504.0, "end": 1508.0, "text": "8.59 Uhr."}, {"id": 407, "start": 1508.0, "end": 1510.0, "text": "Aber glücklicherweise hat sie nicht interessiert."}, {"id": 408, "start": 1510.0, "end": 1515.0, "text": "Ich hab ihm mein RMV-Ticket gezeigt und hab ihm das Bayern-Ticket gezeigt."}, {"id": 409, "start": 1515.0, "end": 1518.0, "text": "Da hat das gescannt und gut war."}, {"id": 410, "start": 1518.0, "end": 1521.0, "text": "Ich hab schon gedacht, jetzt kommt wieder irgendwas."}, {"id": 411, "start": 1521.0, "end": 1524.0, "text": "Ich dachte schon, wahrscheinlich beschwert er sich jetzt."}, {"id": 412, "start": 1524.0, "end": 1529.0, "text": "Warte mal eine halbe Minute, dann können wir noch mal kontrollieren."}, {"id": 413, "start": 1529.0, "end": 1532.0, "text": "Ja, aber es ist ja gut, dass es so was wie ein Bayern-Ticket gibt."}, {"id": 414, "start": 1532.0, "end": 1535.0, "text": "Mit dem Bayern-Ticket konnte ich dann quasi komplette Strecke fahren, hin und zurück."}, {"id": 415, "start": 1535.0, "end": 1538.0, "text": "Und dort noch Bus und sonst was in der Richtung."}, {"id": 416, "start": 1538.0, "end": 1544.0, "text": "Das ist gut, das ist quasi, das 49-Euro-Ticket ist quasi ein Bayern-Ticket nur für ganz Deutschland ein bisschen teurer."}, {"id": 417, "start": 1544.0, "end": 1556.0, "text": "Und dafür ist das gut, dass man sich nicht mehr mit diesem ganzen wirren und durchschaubaren regionalen Verkehrsverbundsshit befassen muss."}, {"id": 418, "start": 1556.0, "end": 1559.0, "text": "Also dort in Würzburg ging es mit dem Bus."}, {"id": 419, "start": 1559.0, "end": 1561.0, "text": "Kann sein, dass es nicht überall in Bayern ist."}, {"id": 420, "start": 1561.0, "end": 1565.0, "text": "Aber es gilt zum größten Teil auch für Busse und für Würzburg gilt es."}, {"id": 421, "start": 1565.0, "end": 1573.0, "text": "Bayern-Ticket gilt halt für Busse auch nur dort, wo der jeweilige Verkehrsverbund dann wiederum mitmacht."}, {"id": 422, "start": 1573.0, "end": 1574.0, "text": "Es ist halt, es ist halt wir."}, {"id": 423, "start": 1574.0, "end": 1591.0, "text": "Ganz im Ernst, erklär das doch mal irgendeinem Tourist, dass wenn er von Frankfurt nach Köln fährt, dass er sich da irgendwie zwei bis fünf verschiedene Tickets kaufen muss."}, {"id": 424, "start": 1591.0, "end": 1593.0, "text": "Neun Euro kann man sich blind kaufen."}, {"id": 425, "start": 1593.0, "end": 1594.0, "text": "Ja, das stimmt schon."}, {"id": 426, "start": 1594.0, "end": 1601.0, "text": "Es würde bestimmt, du hast insofern schon recht, ich denke auch, es würde schon dazu führen, dass ich potenziell noch ein bisschen mehr kaufen würde."}, {"id": 427, "start": 1601.0, "end": 1606.0, "text": "Aber das sind ja auch Leute, die normalerweise schon nicht abgeneigt sind, den Bahn fahren."}, {"id": 428, "start": 1606.0, "end": 1627.0, "text": "Jemand, der wirklich gerne Auto fährt und täglich mit dem Auto fährt und da nicht irgendwie überlegt, ah, ich würde eigentlich gerne, guck mal, wie viele Leute gibt es denn, die täglich wirklich Auto fahren, aber sagen, ha, ich würde ja eigentlich lieber Zug fahren, aber das ist mir zu teuer und wenn es jetzt anstatt 49 kosten würde, dann würde ich auf das Auto verzichten."}, {"id": 429, "start": 1627.0, "end": 1629.0, "text": "Ich will nicht sagen, dass es da keine gibt."}, {"id": 430, "start": 1629.0, "end": 1634.0, "text": "Aber die wenigsten, die wenigsten werden es sein."}, {"id": 431, "start": 1634.0, "end": 1636.0, "text": "Paar Prozent vielleicht."}, {"id": 432, "start": 1636.0, "end": 1640.0, "text": "Und die, die das machen, die freuen sich auch über 49 Euro Ticket."}, {"id": 433, "start": 1640.0, "end": 1655.0, "text": "Das ist zwar kein, weder mit 9 noch mit 49 Euro, du kriegst zwar kaum einen weg vom Auto damit, aber es ist die eigentlich gute Sache, dass du diesen ganzen Verkehrsverbund nicht mehr machen musst."}, {"id": 434, "start": 1655.0, "end": 1658.0, "text": "Ja und es entlastet die Leute, die täglich zur Arbeit pendeln."}, {"id": 435, "start": 1658.0, "end": 1661.0, "text": "Ja."}, {"id": 436, "start": 1661.0, "end": 1667.0, "text": "Ich war billiger als das Auto, ist es definitiv 49 Euro im Monat."}, {"id": 437, "start": 1667.0, "end": 1675.0, "text": "Was bezahlst du denn heute für einmal tanken?"}, {"id": 438, "start": 1675.0, "end": 1679.0, "text": "Musik geht wieder ab hier."}, {"id": 439, "start": 1679.0, "end": 1684.0, "text": "Genau, das wäre für dich auch egal, ob 9 oder 49."}, {"id": 440, "start": 1684.0, "end": 1686.0, "text": "Siehst du?"}, {"id": 441, "start": 1686.0, "end": 1694.0, "text": "Also lohnt sich das für 49 auch?"}, {"id": 442, "start": 1694.0, "end": 1698.0, "text": "Sieg eskaliert gerade wieder."}, {"id": 443, "start": 1698.0, "end": 1710.0, "text": "Ich mach noch mal einen."}, {"id": 444, "start": 1710.0, "end": 1712.0, "text": "Ich meine, versteht mich nicht falsch."}, {"id": 445, "start": 1712.0, "end": 1727.0, "text": "Es wäre jetzt auch besser, wenn es 9 Euro statt 49 kosten würde."}, {"id": 446, "start": 1727.0, "end": 1730.0, "text": "Aber für mich ist das schon eine sehr gute Geschichte, dass es 49 Euro kostet."}, {"id": 447, "start": 1730.0, "end": 1740.0, "text": "Und wie gesagt, das Beste ist, ich würde es auch für 69, also 69 wäre eh die bessere Zahl dafür gewesen."}, {"id": 448, "start": 1740.0, "end": 1746.0, "text": "Ich persönlich finde es mit 49 Euro schon gut, dass du dich nicht mehr damit beschäftigen musst und dass du einfach den Kram kaufen kannst und gut ist."}, {"id": 449, "start": 1770.0, "end": 1778.0, "text": "Was machen die Leute im Zug eigentlich alles?"}, {"id": 450, "start": 1778.0, "end": 1782.0, "text": "Ich hatte auch im Rückblick von Würzburg einen nervigen Typ drin."}, {"id": 451, "start": 1782.0, "end": 1784.0, "text": "Das war Araber oder so."}, {"id": 452, "start": 1784.0, "end": 1787.0, "text": "Der hat, der hat keine Ahnung mit seiner Frau in Katar oder so telefoniert."}, {"id": 453, "start": 1787.0, "end": 1791.0, "text": "Ich weiß es nicht, aber da hatte das Handy laut."}, {"id": 454, "start": 1791.0, "end": 1793.0, "text": "Das war ätzender."}, {"id": 455, "start": 1793.0, "end": 1797.0, "text": "Hat die Kinderschrein gehabt im Hintergrund und sowas."}, {"id": 456, "start": 1797.0, "end": 1798.0, "text": "Ich verstehe es nicht."}, {"id": 457, "start": 1798.0, "end": 1802.0, "text": "Vielleicht ist es dort ja normal, dass man das Handy auf laut stehen hat."}, {"id": 458, "start": 1802.0, "end": 1806.0, "text": "Und es ist mittlerweile auch hier oft genug so, dass die Leute ihr Handy auf laut haben."}, {"id": 459, "start": 1806.0, "end": 1809.0, "text": "Aber Alter, meine Güte, ging mir das auf den Sack wieder."}, {"id": 460, "start": 1809.0, "end": 1812.0, "text": "Zum Glück habe ich meine Noise Cancelling Kopfhörer."}, {"id": 461, "start": 1812.0, "end": 1815.0, "text": "Das war eines der besten Investitionen überhaupt."}, {"id": 462, "start": 1815.0, "end": 1817.0, "text": "Noise Cancelling Kopfhörer."}, {"id": 463, "start": 1817.0, "end": 1821.0, "text": "Sowohl wenn man seine Ruhe haben will auf der Arbeit als auch im Zug."}, {"id": 464, "start": 1821.0, "end": 1830.0, "text": "Noise Cancelling Kopfhörer sind das Beste."}, {"id": 465, "start": 1830.0, "end": 1832.0, "text": "Jetzt geht es wirklich schäber richtig."}, {"id": 466, "start": 1832.0, "end": 1835.0, "text": "Leute, ich hatte schon, ich hatte schon Typen."}, {"id": 467, "start": 1835.0, "end": 1837.0, "text": "Was heißt denn hier Typen?"}, {"id": 468, "start": 1837.0, "end": 1838.0, "text": "Ja, Leute."}, {"id": 469, "start": 1838.0, "end": 1839.0, "text": "Leute schon im Zug."}, {"id": 470, "start": 1839.0, "end": 1841.0, "text": "Was die, was die sich erzählt haben."}, {"id": 471, "start": 1841.0, "end": 1844.0, "text": "Ich hatte mal eine im Zug, die erzählt hat so nach dem Motto."}, {"id": 472, "start": 1844.0, "end": 1847.0, "text": "Ja, gestern hat sie der Kell wieder schön geknallt und sowas in der Richtung."}, {"id": 473, "start": 1847.0, "end": 1848.0, "text": "Richtig schön durchgeknallt."}, {"id": 474, "start": 1848.0, "end": 1851.0, "text": "Bin ich jetzt beim Asitoni gelandet oder was?"}, {"id": 475, "start": 1851.0, "end": 1852.0, "text": "Wo sind wir denn hier?"}, {"id": 476, "start": 1852.0, "end": 1856.0, "text": "Macht was ihr wollt."}, {"id": 477, "start": 1856.0, "end": 1858.0, "text": "Ihr müsst aber noch nicht den ganzen Zug mitteilen."}, {"id": 478, "start": 1858.0, "end": 1861.0, "text": "Aber ich glaube den Leuten ist das gar nicht so klar."}, {"id": 479, "start": 1861.0, "end": 1867.0, "text": "Die sind im Kopf irgendwie so privat, aber sie sitzen halt mitten im Abteil."}, {"id": 480, "start": 1867.0, "end": 1871.0, "text": "Ich bin in Freiburg überall anders auch so."}, {"id": 481, "start": 1871.0, "end": 1874.0, "text": "Ich bin schon in vielen Teilen Deutschlands Zug gefahren."}, {"id": 482, "start": 1874.0, "end": 1875.0, "text": "Das ist eigentlich überall ähnlich."}, {"id": 483, "start": 1875.0, "end": 1879.0, "text": "In Frankfurt, das Problem, dass du in Frankfurt bist, merkst du eigentlich erst, wenn du aussteigst."}, {"id": 484, "start": 1879.0, "end": 1883.0, "text": "Wenn du am Hauptbahnhof aussteigst oder wenn du generell, wenn du in Frankfurt aussteigst,"}, {"id": 485, "start": 1883.0, "end": 1892.0, "text": "dann merkst du erst so richtig, dass du in, dass du in Frankfurt bist."}, {"id": 486, "start": 1892.0, "end": 1896.0, "text": "Ah ja."}, {"id": 487, "start": 1896.0, "end": 1899.0, "text": "How to build a custom TCP Server in Golang."}, {"id": 488, "start": 1899.0, "end": 1902.0, "text": "Ich würde empfehlen am besten gar nicht."}, {"id": 489, "start": 1902.0, "end": 1906.0, "text": "Wobei doch gerade für sowas ist Go eigentlich relativ gut."}, {"id": 490, "start": 1906.0, "end": 1912.0, "text": "Besser als C++."}, {"id": 491, "start": 1912.0, "end": 1914.0, "text": "Ja, da hast du schon."}, {"id": 492, "start": 1914.0, "end": 1916.0, "text": "Angeben hatte ich auch."}, {"id": 493, "start": 1916.0, "end": 1919.0, "text": "Das habe ich glaube ich sogar auf Twitter geschrieben, als ich den Typ in der Bahn hatte."}, {"id": 494, "start": 1919.0, "end": 1921.0, "text": "Angeben hatte ich auch einen."}, {"id": 495, "start": 1921.0, "end": 1925.0, "text": "Der hat doch irgendwas erzählt, das letztens bei ihm in der Shisha Barazja war."}, {"id": 496, "start": 1925.0, "end": 1930.0, "text": "Überlegt mal."}, {"id": 497, "start": 1930.0, "end": 1936.0, "text": "Also ganz im Ernst, wenn das stimmt, wäre das doppelt blöd, das im Video zu, nicht im Video,"}, {"id": 498, "start": 1936.0, "end": 1941.0, "text": "am Handy zu erzählen."}, {"id": 499, "start": 1941.0, "end": 1948.0, "text": "Der hat erzählt, in seiner Shisha Bar war wieder Razja."}, {"id": 500, "start": 1948.0, "end": 1951.0, "text": "Weil wir sind halt in Frankfurt."}, {"id": 501, "start": 1951.0, "end": 1958.0, "text": "Was ist das?"}, {"id": 502, "start": 1958.0, "end": 1979.0, "text": "Okay, das kommen wir uns gleich, kommen wir uns gleich an."}, {"id": 503, "start": 1979.0, "end": 1984.0, "text": "Ja, so super krasse Business Leute hast du überall."}, {"id": 504, "start": 1984.0, "end": 1991.0, "text": "Schau dir das mal an."}, {"id": 505, "start": 1991.0, "end": 1997.0, "text": "Nee, jetzt nicht."}, {"id": 506, "start": 1997.0, "end": 2006.0, "text": "Das ist jetzt nichts, was mich beschäftigen will im Stream."}, {"id": 507, "start": 2006.0, "end": 2009.0, "text": "Bam, bam, bam, so sieht es aus."}, {"id": 508, "start": 2009.0, "end": 2012.0, "text": "Nee, ich weiß auch nicht, was mit denen alles los ist."}, {"id": 509, "start": 2012.0, "end": 2019.0, "text": "Das ist echt nicht mehr normal."}, {"id": 510, "start": 2019.0, "end": 2022.0, "text": "Ja, aber sag mir doch mal jetzt, was ich mit meiner PS Vita machen soll."}, {"id": 511, "start": 2022.0, "end": 2026.0, "text": "Ich weiß jetzt nicht, wie wir da von der PS Vita eigentlich drauf gekommen sind,"}, {"id": 512, "start": 2026.0, "end": 2028.0, "text": "oft das was ich euch jetzt erzählt habe."}, {"id": 513, "start": 2028.0, "end": 2030.0, "text": "Aber sag mir doch mal, was ich mit meiner PS Vita machen soll."}, {"id": 514, "start": 2030.0, "end": 2034.0, "text": "Also diese Emulationsgeschichte habe ich ja am Anfang erst mal gedacht, ist blödsinnig."}, {"id": 515, "start": 2034.0, "end": 2036.0, "text": "Wer braucht sowas?"}, {"id": 516, "start": 2036.0, "end": 2042.0, "text": "Ein Emulator kann ich überall, aber ganz ehrlich,"}, {"id": 517, "start": 2042.0, "end": 2046.0, "text": "wenn man wirklich mobil die ein oder anderen Sachen spielen will,"}, {"id": 518, "start": 2046.0, "end": 2050.0, "text": "ist die Vita wahrscheinlich dafür gar nicht so schlecht."}, {"id": 519, "start": 2050.0, "end": 2053.0, "text": "Weil was gibt es sonst noch?"}, {"id": 520, "start": 2053.0, "end": 2055.0, "text": "3DS vielleicht?"}, {"id": 521, "start": 2055.0, "end": 2058.0, "text": "Weiß ich, ob der 3DS komplett geknackt ist mittlerweile?"}, {"id": 522, "start": 2058.0, "end": 2060.0, "text": "3DS habe ich übrigens auch noch rumfliegen."}, {"id": 523, "start": 2060.0, "end": 2061.0, "text": "Habe ich auch nur zweimal angehabt."}, {"id": 524, "start": 2061.0, "end": 2064.0, "text": "Hat noch nicht mal WLAN Einrichtung, glaube ich, hinter sich."}, {"id": 525, "start": 2064.0, "end": 2071.0, "text": "Weiß ich auch nicht, teilweise habe ich schon übelst unsinnigen Mist gekauft."}, {"id": 526, "start": 2071.0, "end": 2074.0, "text": "Ich könnte das wirklich, das ist eigentlich gar nicht schlecht,"}, {"id": 527, "start": 2074.0, "end": 2079.0, "text": "das Teil in Rucksack schmeißen, dass ich was zu spielen habe im Zug."}, {"id": 528, "start": 2079.0, "end": 2081.0, "text": "Besser als irgendwelche kack Handy Games."}, {"id": 529, "start": 2081.0, "end": 2086.0, "text": "Handy Games ist ja wirklich das allerletzte."}, {"id": 530, "start": 2086.0, "end": 2087.0, "text": "Ja, Steam Deck ist halt das Problem."}, {"id": 531, "start": 2087.0, "end": 2094.0, "text": "Steam Deck ist halt auch viel größer."}, {"id": 532, "start": 2094.0, "end": 2099.0, "text": "Wisst ihr, was meine zwei Top Games im Zug waren, jahrelang?"}, {"id": 533, "start": 2099.0, "end": 2103.0, "text": "Auf dem DS, auf dem DS."}, {"id": 534, "start": 2103.0, "end": 2105.0, "text": "Das erste ist Mario Kart DS."}, {"id": 535, "start": 2105.0, "end": 2106.0, "text": "Was war das Mario?"}, {"id": 536, "start": 2106.0, "end": 2111.0, "text": "Ich glaube, es hieß sogar Mario Kart DS."}, {"id": 537, "start": 2111.0, "end": 2114.0, "text": "Habe ich alles durch, alles auf drei Sterne, sonst wie?"}, {"id": 538, "start": 2114.0, "end": 2115.0, "text": "Mario Kart DS."}, {"id": 539, "start": 2115.0, "end": 2122.0, "text": "Und das andere, jetzt lacht ihr mich wahrscheinlich aus, Cooking Mama DS."}, {"id": 540, "start": 2122.0, "end": 2145.0, "text": "Bestes Game."}, {"id": 541, "start": 2145.0, "end": 2153.0, "text": "Leute, da habe ich bestimmt 100 Spielstunden oder so drinne."}, {"id": 542, "start": 2153.0, "end": 2161.0, "text": "Das ist Catchy Bay, das ist echt, da habe ich massig viele Spielstunden drinne."}, {"id": 543, "start": 2161.0, "end": 2164.0, "text": "Cooking Mama."}, {"id": 544, "start": 2164.0, "end": 2167.0, "text": "Hey, das war quasi Mobile Game ohne den ganzen Mobile Shit."}, {"id": 545, "start": 2167.0, "end": 2170.0, "text": "Überlegt euch mal, ihr würdet sowas auf dem Handy spielen,"}, {"id": 546, "start": 2170.0, "end": 2172.0, "text": "dann könntet ihr nach der dritten Reisdose,"}, {"id": 547, "start": 2172.0, "end": 2177.0, "text": "müsstet ihr irgendwelche komischen Diamanten, Juwelen und Goldstücke zum Anlocken kaufen."}, {"id": 548, "start": 2177.0, "end": 2184.0, "text": "Das ist halt, im Prinzip ist das eine Mini-Spiele-Sammlung mit Thema Kochen."}, {"id": 549, "start": 2184.0, "end": 2188.0, "text": "Hat mit Kochen ja gar nichts zu tun."}, {"id": 550, "start": 2188.0, "end": 2190.0, "text": "Ja."}, {"id": 551, "start": 2190.0, "end": 2192.0, "text": "Cooking Mama."}, {"id": 552, "start": 2192.0, "end": 2193.0, "text": "Ja, genau."}, {"id": 553, "start": 2193.0, "end": 2196.0, "text": "Schnitzelrollen."}, {"id": 554, "start": 2196.0, "end": 2203.0, "text": "Gibt es da Speedruns? Bestimmt, bestimmt."}, {"id": 555, "start": 2203.0, "end": 2206.0, "text": "Bestes, bestes Game für im Zug, nehmen wir ein Beispiel, Cooking Mama."}, {"id": 556, "start": 2206.0, "end": 2211.0, "text": "Also ich habe bestimmt, wie gesagt, bestimmt 100 Stunden plus in Cooking Mama."}, {"id": 557, "start": 2211.0, "end": 2214.0, "text": "Ich habe, wie gesagt, Mario Kart DS und Cooking Mama."}, {"id": 558, "start": 2214.0, "end": 2216.0, "text": "Das war das Hauptsächliche, das, was ich gespielt habe."}, {"id": 559, "start": 2216.0, "end": 2220.0, "text": "Auf dem DS, auf dem Heimweg und morgens."}, {"id": 560, "start": 2220.0, "end": 2223.0, "text": "Mein DS habe ich auch noch am Start."}, {"id": 561, "start": 2223.0, "end": 2227.0, "text": "DS aber nur mit so einer Mod-Karte."}, {"id": 562, "start": 2227.0, "end": 2230.0, "text": "Darf man das heute überhaupt erwähnen, so was?"}, {"id": 563, "start": 2230.0, "end": 2233.0, "text": "Es gab so Modding-Karten für ein DS, wahrscheinlich kennt ihr das."}, {"id": 564, "start": 2233.0, "end": 2237.0, "text": "Konnte man dann quasi Spiele, selbstverständlich habe ich nur"}, {"id": 565, "start": 2237.0, "end": 2242.0, "text": "selbst von der selbst geladenen Karte Games da drauf gemacht."}, {"id": 566, "start": 2242.0, "end": 2249.0, "text": "Da konnte man beispielsweise DS-Spiele von der MicroSD-Karte starten und so was."}, {"id": 567, "start": 2249.0, "end": 2257.0, "text": "Was anderes hätte ich, ich hätte ja selbstverständlich da nie mir irgendwelche Roms oder so runtergeladen."}, {"id": 568, "start": 2257.0, "end": 2265.0, "text": "Meint ihr, der Akku tut überhaupt noch?"}, {"id": 569, "start": 2265.0, "end": 2267.0, "text": "Ich habe noch ein 3DS, ich habe noch ein 3DS."}, {"id": 570, "start": 2267.0, "end": 2278.0, "text": "Gibt es eigentlich noch DS-Ladegeräte?"}, {"id": 571, "start": 2278.0, "end": 2280.0, "text": "Das ist kein normaler USB-Stecker."}, {"id": 572, "start": 2280.0, "end": 2288.0, "text": "Oder ist das so ein eigenes Nintendo-Ding wieder?"}, {"id": 573, "start": 2288.0, "end": 2291.0, "text": "Oder ist das was eigenes?"}, {"id": 574, "start": 2291.0, "end": 2293.0, "text": "Natürlich was eigenes."}, {"id": 575, "start": 2293.0, "end": 2299.0, "text": "Was sonst?"}, {"id": 576, "start": 2299.0, "end": 2305.0, "text": "Sicherlich alles selbst gerippt noch."}, {"id": 577, "start": 2305.0, "end": 2308.0, "text": "Wie gesagt, ich habe jetzt einen Vita, einen 3DS und einen DS."}, {"id": 578, "start": 2308.0, "end": 2316.0, "text": "Da steht dem Flaschen ja nichts im Wege."}, {"id": 579, "start": 2316.0, "end": 2317.0, "text": "Was ist mit der Switch?"}, {"id": 580, "start": 2317.0, "end": 2319.0, "text": "Die Switch habe ich auch."}, {"id": 581, "start": 2319.0, "end": 2323.0, "text": "Aber die Switch nehme ich ungern mit."}, {"id": 582, "start": 2323.0, "end": 2325.0, "text": "Außerdem habe ich keine Games für die Switch."}, {"id": 583, "start": 2325.0, "end": 2335.0, "text": "Es gibt ja auch kaum etwas, was man spielen will auf der Switch."}, {"id": 584, "start": 2335.0, "end": 2336.0, "text": "Mode die Switch?"}, {"id": 585, "start": 2336.0, "end": 2338.0, "text": "Geht das mittlerweile?"}, {"id": 586, "start": 2338.0, "end": 2345.0, "text": "Kann man die Switch flashen?"}, {"id": 587, "start": 2345.0, "end": 2348.0, "text": "Auch mit aktueller Firmware?"}, {"id": 588, "start": 2348.0, "end": 2350.0, "text": "Weil ich habe eine alte Switch."}, {"id": 589, "start": 2350.0, "end": 2354.0, "text": "Ich habe eine ganz alte, ich habe eine Release-Switch."}, {"id": 590, "start": 2354.0, "end": 2358.0, "text": "Die, die noch vergratzt ist, wenn man sie in den Ständer stellt."}, {"id": 591, "start": 2358.0, "end": 2361.0, "text": "Falls noch einer membert."}, {"id": 592, "start": 2361.0, "end": 2363.0, "text": "Membert ihr noch, Leute?"}, {"id": 593, "start": 2363.0, "end": 2366.0, "text": "Die Release-Switch, wenn man die in den Ständer gesteckt hat,"}, {"id": 594, "start": 2366.0, "end": 2369.0, "text": "kann das Display vergratzen."}, {"id": 595, "start": 2369.0, "end": 2372.0, "text": "Das könnte man tatsächlich mal ausprobieren."}, {"id": 596, "start": 2372.0, "end": 2375.0, "text": "Eine Runde Switch-Flaschen."}, {"id": 597, "start": 2375.0, "end": 2379.0, "text": "Wie voll war der Akku von der Vita, als du sie gefunden hast?"}, {"id": 598, "start": 2379.0, "end": 2381.0, "text": "Ich habe sie nicht versucht einzuschalten."}, {"id": 599, "start": 2381.0, "end": 2383.0, "text": "Soll ich mal versuchen, einzuschalten?"}, {"id": 600, "start": 2383.0, "end": 2385.0, "text": "Soll ich die mal holen?"}, {"id": 601, "start": 2385.0, "end": 2388.0, "text": "Ich hole die mal kurz, ich versuche mal einzuschalten."}, {"id": 602, "start": 2388.0, "end": 2390.0, "text": "Diese 10 Jahre oder so."}, {"id": 603, "start": 2390.0, "end": 2392.0, "text": "Ich habe die mir zur Release gekauft."}, {"id": 604, "start": 2392.0, "end": 2401.0, "text": "Wann kam die denn raus?"}, {"id": 605, "start": 2401.0, "end": 2403.0, "text": "Okay, ich probiere das mal."}, {"id": 606, "start": 2403.0, "end": 2404.0, "text": "Wann kam die denn raus?"}, {"id": 607, "start": 2404.0, "end": 2408.0, "text": "Wo ist überhaupt der Einschalter davon?"}, {"id": 608, "start": 2408.0, "end": 2414.0, "text": "Oben links, oben links der Einschalter."}, {"id": 609, "start": 2414.0, "end": 2422.0, "text": "Die macht nichts mehr, Leute."}, {"id": 610, "start": 2422.0, "end": 2424.0, "text": "Die macht nichts mehr."}, {"id": 611, "start": 2424.0, "end": 2427.0, "text": "Die machen gar nichts mehr."}, {"id": 612, "start": 2427.0, "end": 2428.0, "text": "Verkaufst du die?"}, {"id": 613, "start": 2428.0, "end": 2432.0, "text": "Nö, behalte ich alles."}, {"id": 614, "start": 2432.0, "end": 2437.0, "text": "Ist das ein USB-Ladekabel oder was ist das da unten?"}, {"id": 615, "start": 2437.0, "end": 2439.0, "text": "Nee, oder?"}, {"id": 616, "start": 2439.0, "end": 2442.0, "text": "Ich habe da glaube ich gar kein Ladekabel mehr für."}, {"id": 617, "start": 2442.0, "end": 2445.0, "text": "Wie sieht denn das, wie sieht denn das Vita?"}, {"id": 618, "start": 2445.0, "end": 2447.0, "text": "PS Vita Ladekabel."}, {"id": 619, "start": 2447.0, "end": 2456.0, "text": "Wie sieht denn das überhaupt aus?"}, {"id": 620, "start": 2456.0, "end": 2458.0, "text": "What the fuck?"}, {"id": 621, "start": 2458.0, "end": 2473.0, "text": "Sowas habe ich nicht."}, {"id": 622, "start": 2473.0, "end": 2476.0, "text": "Das Netzteil habe ich noch gefunden heute."}, {"id": 623, "start": 2476.0, "end": 2481.0, "text": "Das Netzteil habe ich noch."}, {"id": 624, "start": 2481.0, "end": 2485.0, "text": "Bastel doch selber, ich weiß nicht ob das so einfach selbst gebastelt ist ehrlich gesagt,"}, {"id": 625, "start": 2485.0, "end": 2488.0, "text": "wenn ich mir das so angucke."}, {"id": 626, "start": 2488.0, "end": 2490.0, "text": "Gut, aber sowas kostet ja auch nicht viel."}, {"id": 627, "start": 2490.0, "end": 2494.0, "text": "Guck mal hier, 5 Euro oder so."}, {"id": 628, "start": 2494.0, "end": 2514.0, "text": "Leute, ich muss das Ding wieder wegbringen, das ist voll verstaubt."}, {"id": 629, "start": 2514.0, "end": 2522.0, "text": "Wenn du die Switch moden willst, biegt dir schon mal eine Büroklammer zurecht."}, {"id": 630, "start": 2522.0, "end": 2526.0, "text": "Wir gucken mal kurz ein Video, wie man das macht."}, {"id": 631, "start": 2526.0, "end": 2532.0, "text": "Mod Nintendo Switch."}, {"id": 632, "start": 2532.0, "end": 2539.0, "text": "Nintendo Switch, Niklas, der erklärt uns das jetzt."}, {"id": 633, "start": 2539.0, "end": 2542.0, "text": "Wir lassen es jetzt von Niklas erklären, wie das funktioniert."}, {"id": 634, "start": 2542.0, "end": 2545.0, "text": "Herr Endpunkt."}, {"id": 635, "start": 2545.0, "end": 2547.0, "text": "Höchstpersönlich."}, {"id": 636, "start": 2547.0, "end": 2549.0, "text": "Cheesypro, danke schön für den Sub."}, {"id": 637, "start": 2549.0, "end": 2550.0, "text": "V2."}, {"id": 638, "start": 2550.0, "end": 2552.0, "text": "Ganz wichtig."}, {"id": 639, "start": 2552.0, "end": 2554.0, "text": "Nextgen."}, {"id": 640, "start": 2554.0, "end": 2558.0, "text": "Jetzt gucken wir uns jetzt immer schnell an."}, {"id": 641, "start": 2558.0, "end": 2562.0, "text": "Niklas erklärt uns das jetzt."}, {"id": 642, "start": 2562.0, "end": 2564.0, "text": "Moin Niklas."}, {"id": 643, "start": 2564.0, "end": 2566.0, "text": "Wie ihr eure Nintendo Switch moden könnt."}, {"id": 644, "start": 2566.0, "end": 2569.0, "text": "Was wir hierfür benötigen ist eine modbare Switch."}, {"id": 645, "start": 2569.0, "end": 2571.0, "text": "Was das ist erkläre ich gleich."}, {"id": 646, "start": 2571.0, "end": 2573.0, "text": "Eine RCM-Jig."}, {"id": 647, "start": 2573.0, "end": 2577.0, "text": "Ein was?"}, {"id": 648, "start": 2577.0, "end": 2579.0, "text": "Was ist ein RCM-Jig?"}, {"id": 649, "start": 2579.0, "end": 2581.0, "text": "Mit dem PC zu verbinden."}, {"id": 650, "start": 2581.0, "end": 2583.0, "text": "Eine 64 GB Micro SD-Karte."}, {"id": 651, "start": 2583.0, "end": 2585.0, "text": "Ihr seht hier gerade mal eine 32 GB SD-Karte."}, {"id": 652, "start": 2585.0, "end": 2587.0, "text": "Die geht zwar nicht, aber es ist..."}, {"id": 653, "start": 2587.0, "end": 2588.0, "text": "Die Büroklammer?"}, {"id": 654, "start": 2588.0, "end": 2589.0, "text": "Ah ja."}, {"id": 655, "start": 2589.0, "end": 2591.0, "text": "Und ein PC natürlich."}, {"id": 656, "start": 2591.0, "end": 2593.0, "text": "Was wir als erstes machen ist, wir gehen auf die Seite SMS-Switch-Patch."}, {"id": 657, "start": 2593.0, "end": 2595.0, "text": "Die habe ich auch in der Beschreibung verlinkt."}, {"id": 658, "start": 2595.0, "end": 2597.0, "text": "Nein, nein, meine Switch ist nicht patched."}, {"id": 659, "start": 2597.0, "end": 2598.0, "text": "Die ist..."}, {"id": 660, "start": 2598.0, "end": 2601.0, "text": "J7 00"}, {"id": 661, "start": 2601.0, "end": 2602.0, "text": "Ja, ja."}, {"id": 662, "start": 2602.0, "end": 2604.0, "text": "Und wenn es rot ist heißt es 40 Patchen."}, {"id": 663, "start": 2604.0, "end": 2606.0, "text": "Oder wenn der Präfix gar nicht vorkommt, den ihr habt."}, {"id": 664, "start": 2606.0, "end": 2608.0, "text": "Zum Beispiel e.g. e.g. EG��."}, {"id": 665, "start": 2608.0, "end": 2610.0, "text": "Der Konsole ist auf dem letzten Stand."}, {"id": 666, "start": 2610.0, "end": 2612.0, "text": "Und dann können wir auch weitermachen."}, {"id": 667, "start": 2612.0, "end": 2614.0, "text": "Wir laden uns im Tagra RCM-GUI herunter."}, {"id": 668, "start": 2614.0, "end": 2617.0, "text": "Drückt dann einfach auf der Seite auf Tagra RCM-GUI installer.msl."}, {"id": 669, "start": 2617.0, "end": 2619.0, "text": "Aufkommt zum Punkt."}, {"id": 670, "start": 2619.0, "end": 2620.0, "text": "Drück auf install-driver."}, {"id": 671, "start": 2620.0, "end": 2622.0, "text": "Könnte das erstmal schließen."}, {"id": 672, "start": 2622.0, "end": 2625.0, "text": "So, als nächstes stecken wir die SD-Karte an unserem PC rein."}, {"id": 673, "start": 2625.0, "end": 2626.0, "text": "Das habe ich schon getan."}, {"id": 674, "start": 2626.0, "end": 2632.0, "text": "Wie wir sehen, da ist die SD-Karte, aber die geht zwar nicht ab und ab und das ist die SD-Karte, wo ihr mitpackt, wie das geht."}, {"id": 675, "start": 2633.0, "end": 2640.0, "text": "Gehen wir dann erstmal auf den PC zurück, öffnen das, probiert nochmal in den ACM-Mode zu gehen, oder guckt auf eurer Switch, ob ihr zu oder zu können."}, {"id": 676, "start": 2641.0, "end": 2646.0, "text": "Jetzt habe ich das Wichtige verpasst. Wo macht er denn jetzt hier was an der Switch? Da!"}, {"id": 677, "start": 2647.0, "end": 2651.0, "text": "Aha! Okay, da kommt die SD-Karte rein."}, {"id": 678, "start": 2651.0, "end": 2657.0, "text": "Das ist die SD-Karte drinnen, macht die dann folgendermaßen, den rechten Joy-Con raus."}, {"id": 679, "start": 2658.0, "end": 2659.0, "text": "Liegt!"}, {"id": 680, "start": 2659.0, "end": 2665.0, "text": "Den vorhin erwähnten ACM, auf der Beschreibung verlinke, hier, den packt ihr zwar aus der Verpackung raus."}, {"id": 681, "start": 2666.0, "end": 2671.0, "text": "Dann nimmt ihr den ACM-Jig und dann mit den unteren Kontakten, wie ihr seht."}, {"id": 682, "start": 2672.0, "end": 2676.0, "text": "Okay, das ist quasi eine Büroklammer mit einem 3D-Drucker-Halterung."}, {"id": 683, "start": 2676.0, "end": 2681.0, "text": "Auf der unteren Seite halt, so in die Switch reinstecken, in den rechten Klick, bis es unten fest sitzt."}, {"id": 684, "start": 2682.0, "end": 2689.0, "text": "Dann drücken wir den Power-Button und den Volume-Up-Button, also Power-Button und Lautstärke hoch knopft gleichzeitig."}, {"id": 685, "start": 2690.0, "end": 2702.0, "text": "Wenn wir nichts sehen, heißt es, es hat funktioniert, gehen wir dann erstmal auf den PC zurück, öffnen Tegra ACM-GUI, verbinden unser Kabel mit dem PC und der Home-Menü sieht aus."}, {"id": 686, "start": 2702.0, "end": 2706.0, "text": "Okay, nice, also das scheint mir easy zu sein, die Switch zu flashen."}, {"id": 687, "start": 2709.0, "end": 2711.0, "text": "Tja, könnte man tatsächlich mal ausprobieren."}, {"id": 688, "start": 2712.0, "end": 2719.0, "text": "Hat das irgendwelche Nachteile, wenn man seine Switch flasht, kann man dann offizielle Games nicht mehr spielen oder wird man gebannt oder..."}, {"id": 689, "start": 2720.0, "end": 2723.0, "text": "Wobei, das ist Nintendo, die kriegen das wahrscheinlich noch nicht immer mit."}, {"id": 690, "start": 2723.0, "end": 2729.0, "text": "Du darfst nicht mehr online gehen? Ernsthaft? Wie, Nintendo merkt das wirklich? Du darfst nicht mehr online gehen?"}, {"id": 691, "start": 2732.0, "end": 2740.0, "text": "Ach, doch. Also ich hätte mich jetzt sehr gewundert, wenn Nintendo sowas merkt. Ich meine, Nintendo und online..."}, {"id": 692, "start": 2741.0, "end": 2743.0, "text": "Ist immer, ist ja so ein Ding."}, {"id": 693, "start": 2743.0, "end": 2750.0, "text": "Ey, ich flash lieber meine Vita, warum sollte ich?"}, {"id": 694, "start": 2757.0, "end": 2765.0, "text": "Also das Nintendo hingeht, hinbekommt Leute online zu bannen wegen einer gemordeten Switch, glaube ich an die Skills bei Nintendo nicht wirklich."}, {"id": 695, "start": 2765.0, "end": 2773.0, "text": "Also das Nintendo hingeht, hinbekommt Leute online zu bannen wegen einer gemordeten Switch, glaube ich an die Skills bei Nintendo nicht wirklich."}, {"id": 696, "start": 2773.0, "end": 2777.0, "text": "Okay, wisst ihr was? Wir gucken jetzt noch eins, zwei Videos an. Was haben wir denn hier Schönes?"}, {"id": 697, "start": 2778.0, "end": 2785.0, "text": "Was haben wir denn hier? Paradox! Wenige Arbeitszeit, leicht mehr Betrachtung."}, {"id": 698, "start": 2786.0, "end": 2788.0, "text": "Was haben wir denn hier Schönes?"}, {"id": 699, "start": 2789.0, "end": 2793.0, "text": "Was haben wir denn hier? Paradox! Wenige Arbeitszeit, leicht mehr Betrachtung."}, {"id": 700, "start": 2794.0, "end": 2796.0, "text": "Was haben wir denn hier Schönes?"}, {"id": 701, "start": 2796.0, "end": 2803.0, "text": "Wir gucken jetzt noch eins, zwei Videos an. Was haben wir denn hier Schönes? Was haben wir denn hier? Paradox! Wenige Arbeitszeit, leicht mehr Produktivität."}, {"id": 702, "start": 2804.0, "end": 2811.0, "text": "Das ist doch das, was ich seit Jahren auch im Stream schon immer erzähle, Leute. Vier Tage Woche ist das Beste, was man machen kann."}, {"id": 703, "start": 2812.0, "end": 2819.0, "text": "Ich mache das seit 2000... Joa, wo war ich? 2012 oder so? Seit wann mache ich vier Tage Woche?"}, {"id": 704, "start": 2819.0, "end": 2826.0, "text": "Hab ich ja irgendwann mal ein Video zugemacht? Ich weiß nicht mehr, seit wann ich das mache."}, {"id": 705, "start": 2832.0, "end": 2834.0, "text": "Nee, das ist von Corona."}, {"id": 706, "start": 2834.0, "end": 2846.0, "text": "Das Bahnvideo? Okay, Moment, okay. Okay, okay, okay, wir machen das Bahnvideo."}, {"id": 707, "start": 2846.0, "end": 2859.0, "text": "Moment, ich muss das Video... Das muss man lauter machen, da versteht man sonst nichts."}, {"id": 708, "start": 2859.0, "end": 2869.0, "text": "Das ist ein richtig geiles Video. Siehst du es so richtig schön von hinten, die Hose und das... Ganz ehrlich... Das ist ein Scheiß, Alter."}, {"id": 709, "start": 2870.0, "end": 2878.0, "text": "Du musst es dir vorstellen. Das ist ein richtig geiles Video. Siehst du es so richtig schön von hinten, die Hose und das... Ganz ehrlich, man soll es auch nicht schlagen."}, {"id": 710, "start": 2879.0, "end": 2883.0, "text": "Was? Das hätte aber schnell eskaliert. Das ist aber schnell eskaliert."}, {"id": 711, "start": 2883.0, "end": 2895.0, "text": "Wir sehen davon ein Problem. Nebel fesseln, schlagen... Ich hatte mal das ein mit einer Hand, sie hat mir gesagt, ich soll ihnen eine nette Faust mit dem Gesicht schlagen."}, {"id": 712, "start": 2895.0, "end": 2916.0, "text": "Das war zu wohl. Alter, so eine Scheiße, musst du dir da anhören, man. Manchmal würde ich wirklich gerne den Leuten aufs Maul hauen."}, {"id": 713, "start": 2925.0, "end": 2937.0, "text": "Okay, das ist... Leute, das ist noch nicht mal irgendein Typ, der laut telefoniert. Das ist einfach irgendein... Ich hätte jetzt gedacht, das ist irgendein Drogenabhängiger in Frankfurt."}, {"id": 714, "start": 2937.0, "end": 2966.0, "text": "Irgendeiner, der sich gerade was gespritzt hat. Alter, die Leute, das ist erschrecklich, man. Das ist der Grund, warum ich neues Canceling-Kopfhörer habe."}, {"id": 715, "start": 2967.0, "end": 2978.0, "text": "Ich habe mich zwar auch schon ab und zu mal angelegt mit Leuten in der Bahn, aber... Was willst du machen? Ich meine, das ist der halbe Zug, der dir auf den Sack geht."}, {"id": 716, "start": 2986.0, "end": 2988.0, "text": "Der Lokführer hat Durchfall, alles klar."}, {"id": 717, "start": 2988.0, "end": 3001.0, "text": "Hab ich euch schon mal die Story erzählt, wo ich mich mit drei Halbstarken mal fast gekloppt habe in der Bahn? Ist aber nicht wirklich... Also, es hört sich jetzt krasser an, als es ist. Es war am Ende nix."}, {"id": 718, "start": 3002.0, "end": 3010.0, "text": "Doch, ich glaube, das habe ich euch schon mal erzählt. Es war S-Bahn, Leute, S-Bahn. Was auch sonst außer S-Bahn?"}, {"id": 719, "start": 3010.0, "end": 3023.0, "text": "Ich meine, überlegt euch, Frankfurt nach Hanau S-Bahn. Da sitzt schon einiges drin rum. Nee, das waren irgendwie drei, keine Ahnung. Lass mich jetzt keinen Mist erzählen. 12-, 13-, 14-Jährige oder so."}, {"id": 720, "start": 3024.0, "end": 3034.0, "text": "Und die sind die ganze Zeit durch diesen S-Bahnwagen gepflützt und haben gegen die Türen getreten und sowas. Und ihr wisst, wie das in der Bahn ist."}, {"id": 721, "start": 3034.0, "end": 3048.0, "text": "Jeder guckt dann aus dem Fenster und will eigentlich nur seine Ruhe haben. Und Leute, die gingen mir echt massiv auf den Sack. Die sind rumgeflitzt, sonst wie. Dann hat dann irgendeine Frau mal was gesagt."}, {"id": 722, "start": 3049.0, "end": 3061.0, "text": "So nach dem Motto, ich weiß nicht, was sie gesagt hat, ihr spinnt ja jetzt komplett. Und dann sind sie dann weitergegangen. Und irgendwann habe ich halt gesagt, Jungs, halt's Maul. Und dann kam, das war ja der Witz, dann kam dann einer von denen."}, {"id": 723, "start": 3061.0, "end": 3076.0, "text": "Und hat gemeint, das ist natürlich eine Back-Up gehabt mit seinen Jungs dabei. Und da kam der und hat dann so gemacht, so, wisst ihr, kam er nicht schlecht damit. So gestmäßig, so auf starker Kerl halt, ja."}, {"id": 724, "start": 3077.0, "end": 3085.0, "text": "Und ich sitze halt bei mir auf dem Platz. Er hat natürlich genau gesehen, dass ich das gewesen bin. Kommt er her und hängt sich ungefähr zwei Zentimeter mit seinem Gesicht vor meinem."}, {"id": 725, "start": 3085.0, "end": 3094.0, "text": "Alter, das war irgendeine 13-jährige, halbstarker Mann. Das ist schon eine Weile her, wie alt wäre ich denn da gewesen sein, irgendwie 32 oder so."}, {"id": 726, "start": 3095.0, "end": 3107.0, "text": "Der Typ fragt mich nicht, wenn es hochkommt, hat er 50 Kilo gewogen. Ich hätte ihn einfach umrennen können fast schon. Also ich weiß nicht, was mit den Leuten los ist."}, {"id": 727, "start": 3107.0, "end": 3122.0, "text": "Hat er sich zwei Zentimeter mit seinem Gesicht vor meins gehangen und hat irgendwelche blöden Sachen erzählt. Zumindest lief es dann darauf raus, ich hatte keinen Bock, dass er sich zwei Zentimeter vor meinem Gesicht nimmt."}, {"id": 728, "start": 3122.0, "end": 3136.0, "text": "Ich habe meine Hand genommen, habe sie ins Gesicht gedrückt und haben so meter zurück gestummt. Dann hat er die Fresse gehalten. Alter, was für kleine Kackspasten, Mann. Und die anderen haben sich dann auch nicht mehr gerührt."}, {"id": 729, "start": 3136.0, "end": 3152.0, "text": "Aber es ging natürlich weiter danach. Also du hast ja so einen S-Bahn-Wagon, das ist ja immer eingeteilt in so vier Zwischendinger. Oder drei sind es, glaube ich. Du hast ja immer so links und rechts ein paar Sitzgruppen."}, {"id": 730, "start": 3153.0, "end": 3161.0, "text": "Dann hast du Tür, du hast ganz am Anfang eine Tür, links und rechts Sitzgruppen, nimm wieder eine Tür, links und rechts Sitzgruppen, sind einfach weitergegangen ans Ende des Waggons und haben dann wieder runter gemacht."}, {"id": 731, "start": 3161.0, "end": 3168.0, "text": "Alter, ich habe gedacht, ich muss mich jetzt gleich mit denen kloppen, als sie angerückt sind zu dritt auch noch."}, {"id": 732, "start": 3169.0, "end": 3183.0, "text": "Das hast du schon gesehen, da hast du richtig so auf starker Kerl gemacht. Ich gehe einfach mal stark von aus, dass er sich gekränkt gefühlt hat vor seinen Kollegen dort und dass er sich jetzt quasi dazu genötigt sah, was machen zu müssen."}, {"id": 733, "start": 3183.0, "end": 3197.0, "text": "Ansonsten wären die unglaublich bescheuert gewesen. Ich meine, die waren vielleicht ein Stück größer als ich, aber ich war definitiv breiter und eine ganze Hecke schwerer als die. Also ich glaube, das wäre nicht so gut ausgegangen."}, {"id": 734, "start": 3197.0, "end": 3214.0, "text": "Ich habe mich noch nie, ohne Scheißleute, ich habe mich noch nie wirklich gekloppt in meinem Leben. So richtig mit Blut und blauen Flecken und so. Noch nie. Klar, ich habe mich in der Schule mal gekloppt ein bisschen, aber noch nie."}, {"id": 735, "start": 3214.0, "end": 3231.0, "text": "Habe ich auch nicht vor. Aber da habe ich gedacht, es ist echt soweit. Ich habe noch mal ein paar andere in der S-Bahn in Frankfurt, die haben Handy gehört und die habe ich halt auch gefragt, soll ich mir den Mist jetzt die ganze Zeit anhören?"}, {"id": 736, "start": 3231.0, "end": 3248.0, "text": "Und da haben sie auch irgendwelches blöde Zeug erzählt und irgendwie, wen es stören würde. Da habe ich gesagt, mich stört es. Ich stehe direkt neben euch. Und wahrscheinlich haben sie nicht mit solchen energischen Widerspruch gerechnet."}, {"id": 737, "start": 3249.0, "end": 3259.0, "text": "Da war dann auch erst mal Ruhe bis Südbahnhof. Da waren ja nur drei Stationen. Meine Güte. Ich mache sowas ungern. Ich traue mich eigentlich da nicht, weil Frankfurt weiß ja nie so genau, was los ist."}, {"id": 738, "start": 3259.0, "end": 3269.0, "text": "Aber manchmal geht es einem dann doch zu sehr auf den Sack. In Frankfurt hast du dann vielleicht auch mal irgendwelche Leute, die sich vorher was gespritzt haben oder irgendwelche Messer in der Tasche stecken haben oder weißt es ja nie."}, {"id": 739, "start": 3270.0, "end": 3285.0, "text": "Aber manchmal ist das einfach, soll ich sagen, dann überwiegt so dieser geht mir mega auf den Sack Adrenalinschub versus eigentlich habe ich mir keinen Bock mit Leuten im Zug anzulegen."}, {"id": 740, "start": 3285.0, "end": 3300.0, "text": "Du kannst auch deinen Cousin holen, genau. Hol deinen Cousin. Wobei wir wissen ja alle, der Cousin ist eh blöd, der macht das. Oder wie ging das? Mein Cousin ist eh dumm, der macht das."}, {"id": 741, "start": 3300.0, "end": 3328.0, "text": "Mal gucken, was haben wir denn hier sonst noch so? Okay, das ist irgendein Besoffener. Das ist irgendein Besoffener."}, {"id": 742, "start": 3328.0, "end": 3344.0, "text": "Das ist irgendein Besoffener Typ. So fällt Justin in Frankfurt auch öfters. Muss ich ehrlich sagen, das stört mich gar nicht mal so sehr."}, {"id": 743, "start": 3345.0, "end": 3351.0, "text": "Die sind halt komplett in ihrer eigenen Welt und irgendwie kann man auch sagen, die können ja auch nur am Rande was für."}, {"id": 744, "start": 3351.0, "end": 3361.0, "text": "Aber die ganzen Typen, von denen ich euch jetzt erzählt habe, die waren alle voll zurechnungsfähig und haben trotzdem gedacht, nein, wir müssen irgendwelchen komischen Deutschrap für die komplette S-Baden spielen."}, {"id": 745, "start": 3362.0, "end": 3368.0, "text": "Ich muss sagen, mit Fußballfans habe ich bis jetzt keine schlechten Erfahrungen gemacht."}, {"id": 746, "start": 3368.0, "end": 3384.0, "text": "Ja, ich hatte schon die ein oder anderen, die rumgekrischen haben, gerade wenn du abends von Frankfurt fährst, wenn die dann quasi vom Spiel zurückfahren, vor allem wenn die dann auch noch verloren haben, dann wird ja immer noch rumgesungen und rumgemacht."}, {"id": 747, "start": 3384.0, "end": 3398.0, "text": "Aber da hatte ich noch nie schlechte Erfahrungen gemacht bisher. War sogar eher so, dass mal zwei Stück, einen dritten, der hat sich wahrscheinlich zu sehr besoffen, die haben den quasi mehr oder weniger halb aus dem Zug getragen dann an ihrer Station."}, {"id": 748, "start": 3399.0, "end": 3407.0, "text": "Die sind dann irgendwie, ich glaube, muss ja Offenbach gewesen sein, was anderes geht eigentlich auf dem Zwischen, da gibt es ja keinen großartigen Zwischenhalt mehr."}, {"id": 749, "start": 3408.0, "end": 3412.0, "text": "Die haben ihn dann halb rausgetragen, ihren Fan-Kollege aus dem Zug."}, {"id": 750, "start": 3412.0, "end": 3423.0, "text": "Ja, das Gesinge, das ist, also ich vermeide Zug zu fahren, wenn Fußballspieler waren."}, {"id": 751, "start": 3424.0, "end": 3426.0, "text": "Au! Au! Au! Au!"}, {"id": 752, "start": 3427.0, "end": 3429.0, "text": "Alter, die Leute!"}, {"id": 753, "start": 3429.0, "end": 3431.0, "text": "Alter, die Leute!"}, {"id": 754, "start": 3431.0, "end": 3433.0, "text": "Kannst du mir ganz kurz nicht aufgehen?"}, {"id": 755, "start": 3433.0, "end": 3435.0, "text": "Die muss nach Hamburg."}, {"id": 756, "start": 3435.0, "end": 3437.0, "text": "Ja, du musst auf der Seite warten."}, {"id": 757, "start": 3437.0, "end": 3439.0, "text": "Ja, Vitamals heute?"}, {"id": 758, "start": 3439.0, "end": 3441.0, "text": "Als Kind hab ich das mal nicht."}, {"id": 759, "start": 3441.0, "end": 3443.0, "text": "Vor ein paar Tagen hab ich mir das aufgekauft."}, {"id": 760, "start": 3443.0, "end": 3445.0, "text": "Einfach so."}, {"id": 761, "start": 3445.0, "end": 3447.0, "text": "Einfach so? Alter, was?"}, {"id": 762, "start": 3447.0, "end": 3449.0, "text": "Gangstermann, Vitamals?"}, {"id": 763, "start": 3449.0, "end": 3451.0, "text": "Deine Meinung? Bitte?"}, {"id": 764, "start": 3451.0, "end": 3453.0, "text": "Zu Corona, deine Meinung? Man sollte vorsichtig sein."}, {"id": 765, "start": 3453.0, "end": 3455.0, "text": "Meinst du wirklich? Ja klar."}, {"id": 766, "start": 3455.0, "end": 3457.0, "text": "Ich glaub darin nicht. Du glaubst nicht an Corona?"}, {"id": 767, "start": 3457.0, "end": 3459.0, "text": "Nein, nein, nein."}, {"id": 768, "start": 3459.0, "end": 3461.0, "text": "Gibt's das wirklich?"}, {"id": 769, "start": 3461.0, "end": 3463.0, "text": "Aber der Typ ist aber auch ein bisschen besoffen, mit dem er da redet."}, {"id": 770, "start": 3463.0, "end": 3465.0, "text": "Also was heißt besoffen?"}, {"id": 771, "start": 3465.0, "end": 3467.0, "text": "Es muss nicht besoffen sein."}, {"id": 772, "start": 3467.0, "end": 3469.0, "text": "Ich sag jetzt besoffen mal stellvertretend für"}, {"id": 773, "start": 3469.0, "end": 3471.0, "text": "alle möglichen Sachen,"}, {"id": 774, "start": 3471.0, "end": 3473.0, "text": "die er eingeworfen haben kann."}, {"id": 775, "start": 3473.0, "end": 3475.0, "text": "Der kann besoffen sein, der kann sich was gespritzt haben,"}, {"id": 776, "start": 3475.0, "end": 3477.0, "text": "der kann irgendwas geraucht haben,"}, {"id": 777, "start": 3477.0, "end": 3479.0, "text": "der kann sonst alles zu sich genommen haben."}, {"id": 778, "start": 3479.0, "end": 3483.0, "text": "Aber er ist zumindest nicht 100%ig bei der Sache."}, {"id": 779, "start": 3483.0, "end": 3485.0, "text": "Also er ist nicht 100%ig in unserer Welt."}, {"id": 780, "start": 3485.0, "end": 3487.0, "text": "Er ist nicht 100%ig in unserer Welt."}, {"id": 781, "start": 3487.0, "end": 3489.0, "text": "Er ist drauf, genau."}, {"id": 782, "start": 3489.0, "end": 3491.0, "text": "Was trinkt ihr denn?"}, {"id": 783, "start": 3491.0, "end": 3493.0, "text": "Wodka und Vodka."}, {"id": 784, "start": 3493.0, "end": 3495.0, "text": "Willst du alleine gehen? Nein."}, {"id": 785, "start": 3495.0, "end": 3497.0, "text": "Aber jetzt ja."}, {"id": 786, "start": 3497.0, "end": 3499.0, "text": "Du bist vergeben."}, {"id": 787, "start": 3499.0, "end": 3501.0, "text": "Du bist so süß."}, {"id": 788, "start": 3501.0, "end": 3503.0, "text": "Du mit Falten."}, {"id": 789, "start": 3503.0, "end": 3505.0, "text": "Du mit Falten?"}, {"id": 790, "start": 3505.0, "end": 3507.0, "text": "Du bist so süß."}, {"id": 791, "start": 3507.0, "end": 3509.0, "text": "Du bist so süß."}, {"id": 792, "start": 3509.0, "end": 3511.0, "text": "Du bist so süß."}, {"id": 793, "start": 3511.0, "end": 3513.0, "text": "Du bist so süß."}, {"id": 794, "start": 3513.0, "end": 3515.0, "text": "Du mit Falten."}, {"id": 795, "start": 3515.0, "end": 3517.0, "text": "Du mit Falten."}, {"id": 796, "start": 3523.0, "end": 3525.0, "text": "Alter, das ist ja schlimm."}, {"id": 797, "start": 3525.0, "end": 3527.0, "text": "Das ist ja schlimm."}, {"id": 798, "start": 3529.0, "end": 3531.0, "text": "Die haben auch überhaupt keine Hemmungen"}, {"id": 799, "start": 3531.0, "end": 3533.0, "text": "mehr, die Leute, oder?"}, {"id": 800, "start": 3533.0, "end": 3535.0, "text": "Hier."}, {"id": 801, "start": 3535.0, "end": 3537.0, "text": "Was jetzt?"}, {"id": 802, "start": 3537.0, "end": 3539.0, "text": "Wo sind wir stehen geblieben?"}, {"id": 803, "start": 3539.0, "end": 3541.0, "text": "Den hatten wir schon."}, {"id": 804, "start": 3541.0, "end": 3543.0, "text": "Hier."}, {"id": 805, "start": 3549.0, "end": 3551.0, "text": "Wo sind wir stehen geblieben?"}, {"id": 806, "start": 3553.0, "end": 3555.0, "text": "Hier."}, {"id": 807, "start": 3555.0, "end": 3557.0, "text": "Die haben auch wirklich keine Hemmungen"}, {"id": 808, "start": 3557.0, "end": 3559.0, "text": "mehr, oder?"}, {"id": 809, "start": 3559.0, "end": 3565.0, "text": "Also macht euch nichts auf, ich verstehe auch nichts."}, {"id": 810, "start": 3571.0, "end": 3573.0, "text": "Das würde ich mir dann auch denken."}, {"id": 811, "start": 3577.0, "end": 3579.0, "text": "Was zum Teufel?"}, {"id": 812, "start": 3583.0, "end": 3585.0, "text": "Okay."}, {"id": 813, "start": 3585.0, "end": 3587.0, "text": "So Verrückte in der"}, {"id": 814, "start": 3587.0, "end": 3589.0, "text": "Richtung haben wir auch."}, {"id": 815, "start": 3589.0, "end": 3591.0, "text": "Aber welche,"}, {"id": 816, "start": 3591.0, "end": 3593.0, "text": "die mit Puppen umgefahren sind"}, {"id": 817, "start": 3593.0, "end": 3595.0, "text": "noch nicht, aber Verrückte"}, {"id": 818, "start": 3595.0, "end": 3597.0, "text": "in gewisser Weise,"}, {"id": 819, "start": 3597.0, "end": 3599.0, "text": "Gestörte haben wir auch genug."}, {"id": 820, "start": 3599.0, "end": 3601.0, "text": "Wie weit ist es ungefähr nach Hamburg"}, {"id": 821, "start": 3601.0, "end": 3603.0, "text": "jetzt?"}, {"id": 822, "start": 3603.0, "end": 3605.0, "text": "40 Minuten."}, {"id": 823, "start": 3605.0, "end": 3607.0, "text": "Ich bin nur zum Ficken nach Bremen gefahren."}, {"id": 824, "start": 3607.0, "end": 3609.0, "text": "Ich bin nur zum Ficken"}, {"id": 825, "start": 3609.0, "end": 3611.0, "text": "eingefahren."}, {"id": 826, "start": 3611.0, "end": 3613.0, "text": "Kann er das nicht auch woanders machen?"}, {"id": 827, "start": 3613.0, "end": 3615.0, "text": "Warum musst du zum Ficken nach Bremen"}, {"id": 828, "start": 3615.0, "end": 3617.0, "text": "fahren?"}, {"id": 829, "start": 3617.0, "end": 3619.0, "text": "Wir haben nicht gepickt, wir haben wohlgebackt,"}, {"id": 830, "start": 3619.0, "end": 3621.0, "text": "aber das hat sich gelohnt."}, {"id": 831, "start": 3621.0, "end": 3623.0, "text": "Siehst auf jeden Fall dehydriert aus."}, {"id": 832, "start": 3623.0, "end": 3625.0, "text": "Entschuldigung, ganz kurze Frage."}, {"id": 833, "start": 3625.0, "end": 3627.0, "text": "Ich wollte euch eigentlich so klarmachen,"}, {"id": 834, "start": 3627.0, "end": 3629.0, "text": "wie es hier ist."}, {"id": 835, "start": 3629.0, "end": 3631.0, "text": "Aber ist okay."}, {"id": 836, "start": 3631.0, "end": 3633.0, "text": "Die haben echt keine Hemmungen mehr, Mann."}, {"id": 837, "start": 3637.0, "end": 3639.0, "text": "Wir haben halt 365 Days geguckt."}, {"id": 838, "start": 3639.0, "end": 3641.0, "text": "Oh Gott."}, {"id": 839, "start": 3641.0, "end": 3643.0, "text": "Da habe ich so"}, {"id": 840, "start": 3643.0, "end": 3645.0, "text": "Angst."}, {"id": 841, "start": 3655.0, "end": 3657.0, "text": "Übung macht den Meister,"}, {"id": 842, "start": 3657.0, "end": 3659.0, "text": "wie bei allem."}, {"id": 843, "start": 3659.0, "end": 3661.0, "text": "Ich bin so gay gefahren."}, {"id": 844, "start": 3671.0, "end": 3673.0, "text": "Oh Mann."}, {"id": 845, "start": 3673.0, "end": 3675.0, "text": "Das will man alles gar nicht wissen."}, {"id": 846, "start": 3675.0, "end": 3677.0, "text": "Ich habe ja überhaupt kein Problem."}, {"id": 847, "start": 3677.0, "end": 3679.0, "text": "Es können die ja alles denken und die können auch alle"}, {"id": 848, "start": 3679.0, "end": 3681.0, "text": "bevorzugen, was sie bevorzugen wollen."}, {"id": 849, "start": 3681.0, "end": 3683.0, "text": "Jeder was ihm gefällt."}, {"id": 850, "start": 3683.0, "end": 3685.0, "text": "Aber musste man das wirklich der Welt"}, {"id": 851, "start": 3685.0, "end": 3689.0, "text": "so mitteilen?"}, {"id": 852, "start": 3689.0, "end": 3691.0, "text": "Deswegen habe ich meine Noise-Canceling-"}, {"id": 853, "start": 3691.0, "end": 3693.0, "text": "Kopfhörer."}, {"id": 854, "start": 3693.0, "end": 3695.0, "text": "Und für den Fall der Fälle, dass meine Noise-Canceling-"}, {"id": 855, "start": 3695.0, "end": 3697.0, "text": "Kopfhörer nicht gehen, ich habe auch noch"}, {"id": 856, "start": 3697.0, "end": 3699.0, "text": "so"}, {"id": 857, "start": 3699.0, "end": 3701.0, "text": "Stöpsel."}, {"id": 858, "start": 3701.0, "end": 3703.0, "text": "Ohrstöpsel."}, {"id": 859, "start": 3703.0, "end": 3705.0, "text": "Gummiohrstöpsel dabei."}, {"id": 860, "start": 3705.0, "end": 3707.0, "text": "Rock am Ring,"}, {"id": 861, "start": 3707.0, "end": 3709.0, "text": "Leute, sind das noch. Rock am Ring,"}, {"id": 862, "start": 3709.0, "end": 3715.0, "text": "Rock am Ring, Ohrstöpsel."}, {"id": 863, "start": 3723.0, "end": 3725.0, "text": "Ryze, jetzt werden sie"}, {"id": 864, "start": 3725.0, "end": 3727.0, "text": "einschienen."}, {"id": 865, "start": 3727.0, "end": 3729.0, "text": "Das ist auch ein ganz schönes"}, {"id": 866, "start": 3729.0, "end": 3731.0, "text": "Geschoss, also würde mein Opa"}, {"id": 867, "start": 3731.0, "end": 3740.16, "text": "Ein Junker sozusagen."}, {"id": 868, "start": 3740.16, "end": 3744.12, "text": "Geht das heute?"}, {"id": 869, "start": 3744.12, "end": 3747.08, "text": "War das jetzt schon, ging das jetzt schon ins Fett Shaming durch?"}, {"id": 870, "start": 3747.08, "end": 3748.08, "text": "Ja."}, {"id": 871, "start": 3748.08, "end": 3749.08, "text": "Ich darf das Leute."}, {"id": 872, "start": 3749.08, "end": 3750.08, "text": "Ich bin auch zu fett."}, {"id": 873, "start": 3750.08, "end": 3764.36, "text": "Hat der ernsthaft einen Lautsprecher umhängen und hat den laut beweis ich poste regelmäßig"}, {"id": 874, "start": 3764.36, "end": 3769.28, "text": "meine vage auf twitter ihr wisst dass ich zu dick bin warum hängt man sich den Lautsprecher"}, {"id": 875, "start": 3769.28, "end": 3773.64, "text": "um das erinnert mich fast an dieses komische erinnert sich vielleicht vielleicht kennen"}, {"id": 876, "start": 3773.64, "end": 3777.72, "text": "ihr das auch noch es gab noch so ein gefälltes kickstarter projekt wo irgendeiner der meinung"}, {"id": 877, "start": 3777.72, "end": 3782.0, "text": "war das wäre jetzt eine richtig gute idee so einen umhängbaren bluetooth lautsprecher"}, {"id": 878, "start": 3782.0, "end": 3786.96, "text": "zu entwickeln das wurde nicht gefaundet aber der war da voll überzeugt von."}, {"id": 879, "start": 3786.96, "end": 3796.96, "text": "Warum will man die restliche welt an seiner musik da teilhaben lassen?"}, {"id": 880, "start": 3796.96, "end": 3800.12, "text": "Ah erstmal schön."}, {"id": 881, "start": 3800.12, "end": 3804.0, "text": "Ok man weiß es nicht ob geschissen oder nicht."}, {"id": 882, "start": 3804.0, "end": 3823.48, "text": "Ok das ist typisches frankfurter publikum das gibt es da auch in massen."}, {"id": 883, "start": 3823.48, "end": 3848.8, "text": "Der hat angesetzt und weggekippt der macht den ganzen tag nichts anderes der hat übung."}, {"id": 884, "start": 3848.8, "end": 3855.08, "text": "Es könnten durchaus fußballfans sein also vom besoffenheitsgrad her gehts schon wobei"}, {"id": 885, "start": 3855.08, "end": 3859.92, "text": "die eher schlager singen als fußballzeug also es könnten fußballfans sein aber es"}, {"id": 886, "start": 3859.92, "end": 3865.36, "text": "sieht mir eher aus wie welche die gerade zum flughafen fahren oder mit dem neun euro ticket"}, {"id": 887, "start": 3865.36, "end": 3889.16, "text": "nach sylt oder welche die jungen gesellen abschied machen ja das kann auch sein ja gut"}, {"id": 888, "start": 3889.16, "end": 3894.04, "text": "so schnell wie der seine bierflasche weggekippt hat dass er nicht mal normale worte rauskriegt"}, {"id": 889, "start": 3894.04, "end": 3896.04, "text": "das ist schon logisch."}, {"id": 890, "start": 3896.04, "end": 3900.8, "text": "Kommt da noch was?"}, {"id": 891, "start": 3900.8, "end": 3906.68, "text": "Kommt da noch was?"}, {"id": 892, "start": 3906.68, "end": 3914.96, "text": "Ach du scheiße was zum Teufel."}, {"id": 893, "start": 3914.96, "end": 3926.24, "text": "Na gut in seiner welt hat er sin ergeben was er gesagt hat wahrscheinlich."}, {"id": 894, "start": 3926.24, "end": 3949.68, "text": "Hat die da gerade was für ihr only fans aufgenommen oder sowas was war ich da gerade sehend?"}, {"id": 895, "start": 3949.68, "end": 3962.4, "text": "Ja ungefähr ungefähr so hörte sich das gestern im Zug an als der Araber telefoniert hat."}, {"id": 896, "start": 3962.4, "end": 3980.24, "text": "Leute das hab ich auch gerne gibt's öfters hab ich sogar schon Bilder auf twitter gepostet"}, {"id": 897, "start": 3980.24, "end": 3990.12, "text": "wo ich Leute hatte neben mir im Zug und ganz im ernst die sieht ja noch so aus als also"}, {"id": 898, "start": 3990.12, "end": 3997.16, "text": "wartet mal ich mein die sieht jetzt nicht so aus als stinkt das den ganzen Zug voll ich"}, {"id": 899, "start": 3997.16, "end": 4003.74, "text": "hatte mal einen neben mir sitzen der war so dreckig und so eklig und hat die schuhe aus"}, {"id": 900, "start": 4003.74, "end": 4011.4, "text": "gehabt das war aber nicht moment das hab ich auf twitter gepost man findet halt auf twitter"}, {"id": 901, "start": 4011.4, "end": 4028.8, "text": "nix hier der Dude neben mir genau nicht jetzt hier guckt euch an den Kerl ich hab nicht"}, {"id": 902, "start": 4028.8, "end": 4035.8, "text": "neben mich geguckt ich denke mir so alter was stinkt denn hier so und dann guck ich"}, {"id": 903, "start": 4035.8, "end": 4041.8, "text": "neben mich und auf einmal sitzt der Typ da mit ausgezogenen Schuhen und stinkt den ganzen"}, {"id": 904, "start": 4041.8, "end": 4050.32, "text": "Zug voll ja guck mal meine Hand ist liegt in der Spiegelung ja ja das sag ich das ist"}, {"id": 905, "start": 4050.32, "end": 4055.04, "text": "normaler Wahnsinn hier Frankfurt und Umgebung ich weiß nicht ob der da irgendwelche Gebete"}, {"id": 906, "start": 4055.04, "end": 4065.72, "text": "gerade voll führt oder was das was das gibt wenn der Tag lang ist was ich ich denke mir"}, {"id": 907, "start": 4065.72, "end": 4070.6, "text": "auch was ist was ist mit den Leuten eigentlich verkehrt der Typ neben mir im Zug der hat"}, {"id": 908, "start": 4070.6, "end": 4075.32, "text": "nix mehr gecheckt aber die checkt es doch noch wie kommt man auf die Idee dass man seine"}, {"id": 909, "start": 4075.32, "end": 4081.08, "text": "Schuhe einfach mitten im Zug aussieht und dann noch nicht mal Socken an hat ich mein"}, {"id": 910, "start": 4081.08, "end": 4085.12, "text": "ich fände es schon fragwürdig wenn die Leute ihre Schuhe aussehen haben Socken an aber"}, {"id": 911, "start": 4085.12, "end": 4087.24, "text": "naggische Füße muss das wirklich sein?"}, {"id": 912, "start": 4087.24, "end": 4114.88, "text": "Sieh doch nicht im Wohnzimmer Jo setz dich gerade jetzt Wie lange bleibt ihr hier stehen?"}, {"id": 913, "start": 4114.88, "end": 4123.12, "text": "Ich will nicht wissen was da alles rauskommt"}, {"id": 914, "start": 4123.12, "end": 4124.12, "text": "Warum raust du das?"}, {"id": 915, "start": 4124.12, "end": 4125.12, "text": "Oh das schmeckt!"}, {"id": 916, "start": 4125.12, "end": 4126.12, "text": "Oh die ganz dicken!"}, {"id": 917, "start": 4126.12, "end": 4127.12, "text": "Du raust doch keine Zigarre!"}, {"id": 918, "start": 4127.12, "end": 4128.12, "text": "Nicht durch die Lunge oder?"}, {"id": 919, "start": 4128.12, "end": 4129.12, "text": "Klar ganz normal!"}, {"id": 920, "start": 4129.12, "end": 4130.12, "text": "Du kriegst doch richtig Durchfall von!"}, {"id": 921, "start": 4130.12, "end": 4131.12, "text": "Das ist normal!"}, {"id": 922, "start": 4131.12, "end": 4132.12, "text": "Das ist normal!"}, {"id": 923, "start": 4132.12, "end": 4133.12, "text": "Wen juckts?"}, {"id": 924, "start": 4133.12, "end": 4134.12, "text": "Durchfall!"}, {"id": 925, "start": 4134.12, "end": 4135.12, "text": "Standardzustand!"}, {"id": 926, "start": 4135.12, "end": 4146.12, "text": "Default!"}, {"id": 927, "start": 4146.12, "end": 4165.64, "text": "Lungenärzte hassen diesen Dreck!"}, {"id": 928, "start": 4165.64, "end": 4179.16, "text": "Die haben auch irgendwas genommen vorher!"}, {"id": 929, "start": 4179.16, "end": 4180.92, "text": "Schlapper mich nicht zu!"}, {"id": 930, "start": 4180.92, "end": 4201.04, "text": "Ja das, gut da wollte ich sagen, hatte ich auch schon ein paar Ansagen wo ich mir gedacht"}, {"id": 931, "start": 4201.04, "end": 4205.72, "text": "habe was genau haben die da jetzt durchgesagt aber die kann das wahrscheinlich in 1-2 Wochen"}, {"id": 932, "start": 4205.72, "end": 4222.16, "text": "wenn sie übt das kann ich umsteigen was hat er da für welche am Start?"}, {"id": 933, "start": 4222.16, "end": 4237.6, "text": "Die halt ich fest, weil ich die gedingst hab, die langen hier, Leergut nehmen wir mit,"}, {"id": 934, "start": 4237.6, "end": 4241.8, "text": "die sind aus Berlin, da nimmt man immer Leergut mit!"}, {"id": 935, "start": 4241.8, "end": 4242.8, "text": "Echt?"}, {"id": 936, "start": 4242.8, "end": 4243.8, "text": "Ja!"}, {"id": 937, "start": 4243.8, "end": 4244.8, "text": "Standard Berliner Unterhaltung!"}, {"id": 938, "start": 4244.8, "end": 4271.56, "text": "Statt das Default dort!"}, {"id": 939, "start": 4271.56, "end": 4276.42, "text": "Uuuh ne!"}, {"id": 940, "start": 4276.42, "end": 4281.66, "text": "Wobei das ist nicht tiktok leute das sind eher facebook. Das ist eher facebook gucken"}, {"id": 941, "start": 4285.26, "end": 4287.26, "text": "Ja super"}, {"id": 942, "start": 4292.3, "end": 4295.78, "text": "Ich meine die wollen ihn wenigstens daran teilhaben lassen ja"}, {"id": 943, "start": 4297.54, "end": 4299.54, "text": "Was ist hier los"}, {"id": 944, "start": 4299.54, "end": 4307.06, "text": "Ja, ich glaube ich müsste auch manchmal ein bisschen aufnehmen das wäre das käme bestimmt gut an"}, {"id": 945, "start": 4308.9, "end": 4312.7, "text": "Leute ich capture jetzt einfach ab und zu mal im zug wenn irgendwas ist"}, {"id": 946, "start": 4314.9, "end": 4316.86, "text": "Was"}, {"id": 947, "start": 4316.86, "end": 4318.86, "text": "Wirklich teil 2 noch gucken"}, {"id": 948, "start": 4319.38, "end": 4323.06, "text": "Okay, also ihr habt die auswahl chat entweder gucken wir uns jetzt an"}, {"id": 949, "start": 4323.06, "end": 4330.22, "text": "paradox und weniger aber es zeigt gleich mehr poloketei 2 ist gut ist gut weil weil ihr seid teil 2"}, {"id": 950, "start": 4331.62, "end": 4333.62, "text": "best of bar in die bahn weiß alles"}, {"id": 951, "start": 4336.14, "end": 4341.58, "text": "Ich sehe der chat ist heute auf vollem voller dauer reaction beschallung"}, {"id": 952, "start": 4342.58, "end": 4345.22, "text": "Wo habe ich die musik an ich blick ich blick nicht mehr durch"}, {"id": 953, "start": 4346.1, "end": 4348.1, "text": "okay"}, {"id": 954, "start": 4348.58, "end": 4350.58, "text": "Wo denn jetzt"}, {"id": 955, "start": 4350.58, "end": 4353.74, "text": "Ja chat ich habe zu viele"}, {"id": 956, "start": 4360.9, "end": 4364.7, "text": "Waren ja, okay, die rauche ich nicht"}, {"id": 957, "start": 4367.14, "end": 4369.14, "text": "Der typ"}, {"id": 958, "start": 4369.14, "end": 4378.9, "text": "Da es harzt rauf wirst du text gesellt"}, {"id": 959, "start": 4382.5, "end": 4383.54, "text": "sleep"}, {"id": 960, "start": 4384.06, "end": 4386.4, "text": "Einfach eine"}, {"id": 961, "start": 4390.5, "end": 4392.14, "text": "Schicht"}, {"id": 962, "start": 4392.14, "end": 4403.14, "text": "Was ist das für ne? So ist das irgendein Rentnerklapptelefon oder was?"}, {"id": 963, "start": 4403.14, "end": 4415.14, "text": "Und mit Ladestation! Warum hat die eine Ladestation im Zug dabei für den Set?"}, {"id": 964, "start": 4415.14, "end": 4434.14, "text": "Meine Güte! Das ist ja Vollausstattung!"}, {"id": 965, "start": 4434.14, "end": 4451.14, "text": "Ich mein immerhin singt er leise!"}, {"id": 966, "start": 4451.14, "end": 4461.14, "text": "Alter! Man muss einfach nur Bahn Videos machen, dann sprechen an die Mädels von sich aus dem Zug an!"}, {"id": 967, "start": 4461.14, "end": 4470.14, "text": "Wie könnt ihr euch das vorstellen? Auf gehts Leute! Direkt geht jetzt das Smartphone auf Record!"}, {"id": 968, "start": 4470.14, "end": 4476.14, "text": "Jetzt kenn ich endlich den Trick, wie das funktioniert!"}, {"id": 969, "start": 4476.14, "end": 4492.14, "text": "500k auf Insta muss da eigentlich schon sein!"}, {"id": 970, "start": 4492.14, "end": 4507.14, "text": "Mit 300.000 YouTube kann man da nicht punkten oder?"}, {"id": 971, "start": 4507.14, "end": 4529.14, "text": "Insta? TikTok oder? 300k TikTok ist doch nicht besser!"}, {"id": 972, "start": 4529.14, "end": 4539.14, "text": "Was übrigens der Hauptgrund ist, warum ich mich nie in Videos gezeigt habe und zeigen werde?"}, {"id": 973, "start": 4539.14, "end": 4542.14, "text": "Weil ich keinen Bock hab, dass mich Leute auf der Straße erkennen!"}, {"id": 974, "start": 4542.14, "end": 4550.14, "text": "Ich hab mir Masken bestellt, ich werd demnächst mir einen neuen Rechner kaufen und den werden wir live zusammen im Stream bauen!"}, {"id": 975, "start": 4550.14, "end": 4555.14, "text": "Und ich möchte mich nicht leaken, aber es kann durchaus sein, dass ich mich leaken werde!"}, {"id": 976, "start": 4555.14, "end": 4562.14, "text": "Deswegen hab ich mir zwei Masken gekauft, nämlich, hier hab ich sie, ich kann sie euch jetzt schlecht zeigen, ich kann sie hier hochhalten!"}, {"id": 977, "start": 4562.14, "end": 4569.14, "text": "Also ich hab hier noch eine eingepackt und eine schon ausgepackt, das ist eine Maske mit einem Keks drauf!"}, {"id": 978, "start": 4569.14, "end": 4578.14, "text": "Ich hab zwei Custom Keks Masken drucken lassen, die kann ich mir dann übers Gesicht ziehen, bzw. meine Augen gucken da noch raus!"}, {"id": 979, "start": 4578.14, "end": 4588.14, "text": "Und dann kann ich mich nicht leaken, aber ich seh alles, ihr könnt mich im Zweifelsfall auch sehen, falls ich mich irgendwo spiegele, aber es erkennt mich keiner!"}, {"id": 980, "start": 4588.14, "end": 4592.14, "text": "Top Secret!"}, {"id": 981, "start": 4592.14, "end": 4595.14, "text": "Und?"}, {"id": 982, "start": 4595.14, "end": 4602.14, "text": "Ja, dann Facecam Stream mit Maske!"}, {"id": 983, "start": 4602.14, "end": 4608.14, "text": "Okay, weiter!"}, {"id": 984, "start": 4608.14, "end": 4610.14, "text": "Was hat der Typ da am Start?"}, {"id": 985, "start": 4610.14, "end": 4614.14, "text": "Ist das ein Lautsprecher?"}, {"id": 986, "start": 4614.14, "end": 4616.14, "text": "Moment!"}, {"id": 987, "start": 4616.14, "end": 4627.14, "text": "Ist das irgendwie ein Zirkus, der unterwegs ist, oder?"}, {"id": 988, "start": 4627.14, "end": 4634.14, "text": "Ich bin so ausgezuckt in diesem Moment, dass ich das gemacht hab, ich bin Sherlock Holmes Bruder, ich neig das sofort, wenn jemand das macht!"}, {"id": 989, "start": 4634.14, "end": 4638.14, "text": "Ich bin Sherlock Holmes Bruder, ich neig das sofort, wenn jemand das macht!"}, {"id": 990, "start": 4638.14, "end": 4642.14, "text": "Ich sag dir ehrlich Bruder, ich glaub dies nicht so, wenn jemand das macht!"}, {"id": 991, "start": 4642.14, "end": 4649.14, "text": "Bruder, okay, ist Bruder wieder angesagter? Ich dachte Digger ist es immer noch!"}, {"id": 992, "start": 4649.14, "end": 4656.14, "text": "Das müsst ihr mir jetzt erklären, ich bin da im Jugend-Slang nicht mal so wirklich drinne mit 38, aber ist es eher Bruder oder Digger?"}, {"id": 993, "start": 4656.14, "end": 4658.14, "text": "Ich dachte es ist eigentlich immer Digger!"}, {"id": 994, "start": 4658.14, "end": 4663.14, "text": "Oder ist es schon wieder, oder ist es eher Bro, Bro?"}, {"id": 995, "start": 4663.14, "end": 4666.14, "text": "Aber Bruder, spricht man das wirklich so aus?"}, {"id": 996, "start": 4666.14, "end": 4670.14, "text": "Manche Leute sagen Bre!"}, {"id": 997, "start": 4670.14, "end": 4675.14, "text": "Bre, hab ich auch schon gesehen!"}, {"id": 998, "start": 4675.14, "end": 4683.14, "text": "Alle Schmutzdigger!"}, {"id": 999, "start": 4683.14, "end": 4694.14, "text": "Man kann aber bestimmt sagen Bro Digger oder sowas in Kombination, ich glaub das ist auch möglich!"}, {"id": 1000, "start": 4694.14, "end": 4700.14, "text": "Oh nein!"}, {"id": 1001, "start": 4700.14, "end": 4703.14, "text": "Boah!"}, {"id": 1002, "start": 4703.14, "end": 4707.14, "text": "Übertreibt halt!"}, {"id": 1003, "start": 4707.14, "end": 4709.14, "text": "Ist das Dubstep?"}, {"id": 1004, "start": 4709.14, "end": 4721.14, "text": "Hört heute wirklich noch jemand Dubstep?"}, {"id": 1005, "start": 4721.14, "end": 4729.14, "text": "Ist das irgendein Fetisch-Telefon oder was?"}, {"id": 1006, "start": 4729.14, "end": 4740.14, "text": "Dominante 50-Jährige, die dir ins Ohr rülpsen oder sowas?"}, {"id": 1007, "start": 4740.14, "end": 4747.14, "text": "Warum rülpst du ins Telefon?"}, {"id": 1008, "start": 4747.14, "end": 4752.14, "text": "Das ist der Wahnsinn, die Leute!"}, {"id": 1009, "start": 4752.14, "end": 4755.14, "text": "Oh nein, wieder einer mit nackten Füßen!"}, {"id": 1010, "start": 4755.14, "end": 4764.14, "text": "Leute, lasst doch wenigstens die Socken an!"}, {"id": 1011, "start": 4764.14, "end": 4768.14, "text": "Das ist aber auch ein Typ, oder?"}, {"id": 1012, "start": 4768.14, "end": 4778.14, "text": "Wenn ich mir die Uhr und den Arm so angucke!"}, {"id": 1013, "start": 4778.14, "end": 4780.14, "text": "Scheiß auf Bewährung!"}, {"id": 1014, "start": 4780.14, "end": 4795.14, "text": "Das sind ja schon wieder die richtig harten Leute unterwegs!"}, {"id": 1015, "start": 4795.14, "end": 4798.14, "text": "Vor allem, wisst ihr was ich geil finde?"}, {"id": 1016, "start": 4798.14, "end": 4803.14, "text": "Was richtig hängen geblieben ist, die feiern sich für diesen Scheiß auch noch übelst ab dann!"}, {"id": 1017, "start": 4803.14, "end": 4807.14, "text": "Die größten Spasten aller Zeiten, aber die feiern sich da richtig ab!"}, {"id": 1018, "start": 4807.14, "end": 4811.14, "text": "Mag aber auch daran liegen, der ist aus dem Netto geflogen!"}, {"id": 1019, "start": 4811.14, "end": 4815.14, "text": "Ja, zu Recht ist er aus dem Netto geflogen!"}, {"id": 1020, "start": 4815.14, "end": 4822.14, "text": "Die feiern sich, aber das geht auch nur, weil die Leute mit ähnlicher Weltanschauung kennen."}, {"id": 1021, "start": 4822.14, "end": 4827.14, "text": "Wo das quasi Status Talk ist, wenn man sowas von sich gibt."}, {"id": 1022, "start": 4827.14, "end": 4830.14, "text": "Ich bin aus dem Netto rausgeflogen!"}, {"id": 1023, "start": 4830.14, "end": 4835.14, "text": "Man muss sich mal vorstellen, es gibt Leute auf dieser Welt, die erzählen sich untereinander,"}, {"id": 1024, "start": 4835.14, "end": 4837.14, "text": "ich bin aus dem Netto rausgeflogen!"}, {"id": 1025, "start": 4837.14, "end": 4841.14, "text": "Und bei denen ist das die krasseste Errungenschaft!"}, {"id": 1026, "start": 4841.14, "end": 4845.14, "text": "Wenn ich euch erzählen würde, ich bin aus dem Netto rausgeflogen,"}, {"id": 1027, "start": 4845.14, "end": 4849.14, "text": "dann würdet ihr denken, was, warum, erzählen mal, stimmt doch irgendwas merkwürdig!"}, {"id": 1028, "start": 4849.14, "end": 4852.14, "text": "Aber nee, bei denen ist das, ich bin aus dem Netto rausgeflogen!"}, {"id": 1029, "start": 4852.14, "end": 4857.14, "text": "Boah ey, du bist der Beste, du bist so geil, du bist aus dem Netto rausgeflogen!"}, {"id": 1030, "start": 4857.14, "end": 4859.14, "text": "Die feiern das richtig!"}, {"id": 1031, "start": 4859.14, "end": 4870.14, "text": "Nee, nee, nee, nee, okay, aha, okay, ich hab fast Bier dabei, ich hab die 4 flassen Wassermaisel mit,"}, {"id": 1032, "start": 4870.14, "end": 4873.14, "text": "danach fahr ich mit dem Töv, Töv nach Netto, will eigentlich kaufen."}, {"id": 1033, "start": 4873.14, "end": 4877.14, "text": "Auch zum Netto? Was wollt ihr da leben, Netto?"}, {"id": 1034, "start": 4877.14, "end": 4879.14, "text": "Ich bin aus dem Brot geschenkt, Donner!"}, {"id": 1035, "start": 4879.14, "end": 4881.14, "text": "Morgen, KS!"}, {"id": 1036, "start": 4885.14, "end": 4887.14, "text": "Was zum..."}, {"id": 1037, "start": 4901.14, "end": 4904.14, "text": "Das sagt ein Zugbegleiter, aber in der Regel nicht."}, {"id": 1038, "start": 4904.14, "end": 4908.14, "text": "Ich habe noch nie einen Zugbegleiter gesehen, der gesagt hat,"}, {"id": 1039, "start": 4908.14, "end": 4910.14, "text": "deine Fresse gefällt mir nicht!"}, {"id": 1040, "start": 4910.14, "end": 4913.14, "text": "Scheint ja in der Welt da öfters vorzukommen!"}, {"id": 1041, "start": 4913.14, "end": 4914.14, "text": "Meine?"}, {"id": 1042, "start": 4914.14, "end": 4916.14, "text": "Nein, meine Fresse gefällt mir jetzt nicht!"}, {"id": 1043, "start": 4916.14, "end": 4918.14, "text": "Weil ich Zugbegleiter bin?"}, {"id": 1044, "start": 4918.14, "end": 4920.14, "text": "Nein, weil ich Zugbegleiter bin!"}, {"id": 1045, "start": 4920.14, "end": 4922.14, "text": "Nein, ich bin Zugbegleiter!"}, {"id": 1046, "start": 4922.14, "end": 4923.14, "text": "Ja?"}, {"id": 1047, "start": 4923.14, "end": 4926.14, "text": "Moment, das ist immer noch der gleiche Typ aus dem ersten Video!"}, {"id": 1048, "start": 4926.14, "end": 4927.14, "text": "Kickel!"}, {"id": 1049, "start": 4927.14, "end": 4928.14, "text": "Ja?"}, {"id": 1050, "start": 4928.14, "end": 4929.14, "text": "Ich sag Versuch!"}, {"id": 1051, "start": 4929.14, "end": 4930.14, "text": "Ja?"}, {"id": 1052, "start": 4930.14, "end": 4931.14, "text": "Du guckst hier auch nicht raus!"}, {"id": 1053, "start": 4931.14, "end": 4932.14, "text": "Ja?"}, {"id": 1054, "start": 4932.14, "end": 4933.14, "text": "Ich hol die Bullen!"}, {"id": 1055, "start": 4933.14, "end": 4934.14, "text": "Ja?"}, {"id": 1056, "start": 4934.14, "end": 4935.14, "text": "Und du sagst zu den Bullen, er hat mich geschlagen!"}, {"id": 1057, "start": 4935.14, "end": 4937.14, "text": "Die nehmen das auf, als Anzeige, die Bullen!"}, {"id": 1058, "start": 4937.14, "end": 4938.14, "text": "Du hast mich geschlagen!"}, {"id": 1059, "start": 4938.14, "end": 4939.14, "text": "Jetzt nicht!"}, {"id": 1060, "start": 4939.14, "end": 4941.14, "text": "Wer kann das beweisen?"}, {"id": 1061, "start": 4941.14, "end": 4943.14, "text": "Nein, aber versteht ihr das mein?"}, {"id": 1062, "start": 4943.14, "end": 4944.14, "text": "Ja!"}, {"id": 1063, "start": 4951.14, "end": 4952.14, "text": "Nein, nein, nein, nein!"}, {"id": 1064, "start": 4952.14, "end": 4954.14, "text": "Ich meine nicht, den Typ, den man da sieht!"}, {"id": 1065, "start": 4954.14, "end": 4957.14, "text": "Der, der erzählt, ist immer noch der gleiche aus dem ersten Video!"}, {"id": 1066, "start": 4961.14, "end": 4964.14, "text": "Also der, der eben ihm was erzählt hat,"}, {"id": 1067, "start": 4964.14, "end": 4968.14, "text": "dass der Typ in der Kamera der gleiche ist, ist mir auch klar, chat!"}, {"id": 1068, "start": 4970.14, "end": 4971.14, "text": "Was bin ich da sehend?"}, {"id": 1069, "start": 4971.14, "end": 4972.14, "text": "Was..."}, {"id": 1070, "start": 4972.14, "end": 4973.14, "text": "Oh, der schnarcht!"}, {"id": 1071, "start": 4975.14, "end": 4977.14, "text": "Ja, schnarchende Leute hatte ich auch schon öfters!"}, {"id": 1072, "start": 4983.14, "end": 4985.14, "text": "Der ist aber schon besonders raus!"}, {"id": 1073, "start": 4985.14, "end": 4987.14, "text": "Ist alles, was du willst!"}, {"id": 1074, "start": 4992.14, "end": 4994.14, "text": "Ist das in Berlin?"}, {"id": 1075, "start": 4996.14, "end": 4998.14, "text": "Ist das irgendwo in der Nähe von Berlin?"}, {"id": 1076, "start": 4998.14, "end": 5010.14, "text": "Mit Familienbereichen und Kinderbetreuung, mit individuellem Service und Genuss auf ganzer Strecke!"}, {"id": 1077, "start": 5010.14, "end": 5018.14, "text": "Oh man!"}, {"id": 1078, "start": 5018.14, "end": 5019.14, "text": "Man sieht nicht, worauf er fährt!"}, {"id": 1079, "start": 5021.14, "end": 5022.14, "text": "Boah!"}, {"id": 1080, "start": 5030.14, "end": 5032.14, "text": "Du hast eine Persönlichkeit dazu!"}, {"id": 1081, "start": 5032.14, "end": 5034.14, "text": "Egal, sieht man sofort!"}, {"id": 1082, "start": 5034.14, "end": 5040.14, "text": "Du bist ein Talent!"}, {"id": 1083, "start": 5040.14, "end": 5042.14, "text": "Das ist aber sehr bescheiden, ja!"}, {"id": 1084, "start": 5056.14, "end": 5057.14, "text": "Hä?"}, {"id": 1085, "start": 5057.14, "end": 5058.14, "text": "Was?"}, {"id": 1086, "start": 5058.14, "end": 5062.14, "text": "Für dich!"}, {"id": 1087, "start": 5062.14, "end": 5063.14, "text": "Tschüss!"}, {"id": 1088, "start": 5068.14, "end": 5069.14, "text": "Confused!"}, {"id": 1089, "start": 5076.14, "end": 5078.14, "text": "Gibt's hier eine artistische Einlage noch zwischendurch?"}, {"id": 1090, "start": 5078.14, "end": 5080.14, "text": "Warum müssten sie zusammen aufs Klo?"}, {"id": 1091, "start": 5080.14, "end": 5083.14, "text": "Ich bin gestern nach Würzburg gefahren, da war ich auch auf dem Hinweg aufm Klo!"}, {"id": 1092, "start": 5083.14, "end": 5086.14, "text": "Und ich werde das nicht glauben, aber das ging!"}, {"id": 1093, "start": 5086.14, "end": 5109.14, "text": "Also komplett ohne Begleitung, das war möglich!"}, {"id": 1094, "start": 5109.14, "end": 5123.14, "text": "Was ist das mit diesen Bluetooth-Lautsprechern eigentlich?"}, {"id": 1095, "start": 5123.14, "end": 5126.14, "text": "Warum haben die so viele?"}, {"id": 1096, "start": 5126.14, "end": 5132.14, "text": "Ich meine, die brauchen ja trotzdem ein Handy dazu, oder?"}, {"id": 1097, "start": 5132.14, "end": 5134.14, "text": "Ohne Handy hier das doch nicht!"}, {"id": 1098, "start": 5134.14, "end": 5141.14, "text": "Na gut, es ist wahrscheinlich, wenn du da so quasi am Bahnhof lebst, dann ist das ja dein Wohnzimmer!"}, {"id": 1099, "start": 5141.14, "end": 5143.14, "text": "Da hast du da auch einen Lautsprecher!"}, {"id": 1100, "start": 5148.14, "end": 5149.14, "text": "Bitte was?"}, {"id": 1101, "start": 5153.14, "end": 5155.14, "text": "Vom Skateboard fahren gehen die Schuhe kaputt?"}, {"id": 1102, "start": 5155.14, "end": 5167.14, "text": "Was ist so?"}, {"id": 1103, "start": 5167.14, "end": 5170.14, "text": "Nice Effects getroppt hier!"}, {"id": 1104, "start": 5175.14, "end": 5177.14, "text": "War das nicht das Handy oder so?"}, {"id": 1105, "start": 5177.14, "end": 5178.14, "text": "Feuerzeug?"}, {"id": 1106, "start": 5178.14, "end": 5184.14, "text": "Ja gut, Feuerzeug kann jeder mal irgendwie klauen, aber weil es halt rumliegt, aber da hat er die Effects getroppt jetzt!"}, {"id": 1107, "start": 5184.14, "end": 5188.14, "text": "Bildungsauftrag erfüllt, ja!"}, {"id": 1108, "start": 5188.14, "end": 5193.14, "text": "70?"}, {"id": 1109, "start": 5193.14, "end": 5200.14, "text": "Ich hab so meine Zweifel, dass ich gerade im Klo bin!"}, {"id": 1110, "start": 5200.14, "end": 5204.14, "text": "Ich kann mir nicht vorstellen, dass er 70 gefahren ist, ich schau mal aufm Longboard!"}, {"id": 1111, "start": 5204.14, "end": 5214.14, "text": "Aufm Longboard?"}, {"id": 1112, "start": 5214.14, "end": 5218.14, "text": "Weil das teuer ist, kann man da zu viert draufstehen, die Logik ist bestechend!"}, {"id": 1113, "start": 5218.14, "end": 5222.14, "text": "Ach, das ist immer noch der, der kein reicher Wichser ist, okay!"}, {"id": 1114, "start": 5222.14, "end": 5228.14, "text": "Okay, mach's gut man!"}, {"id": 1115, "start": 5228.14, "end": 5232.14, "text": "Ich frag mich immer, warum haben die so Mitteilungsbedürfnis?"}, {"id": 1116, "start": 5232.14, "end": 5240.14, "text": "Ach, deswegen hat er ihm die Story erzählt!"}, {"id": 1117, "start": 5240.14, "end": 5243.14, "text": "Deswegen hat er ihm die Story erzählt!"}, {"id": 1118, "start": 5243.14, "end": 5246.14, "text": "Das war die Zigarettenschnorrtaktik!"}, {"id": 1119, "start": 5246.14, "end": 5248.14, "text": "Ach so!"}, {"id": 1120, "start": 5248.14, "end": 5258.14, "text": "Das Problem, was ich da immer hab, ist, du weißt nie!"}, {"id": 1121, "start": 5258.14, "end": 5261.14, "text": "Das ist ja bis zu einem gewissen Punkt alles ganz lustig, ja!"}, {"id": 1122, "start": 5261.14, "end": 5266.14, "text": "Du weißt aber nie, wie die Leute darauf reagieren, wenn du ihren Scheiß nicht mitmachst!"}, {"id": 1123, "start": 5266.14, "end": 5270.14, "text": "Stell euch mal vor, der erzählt dir erst wie sein halbes Leben und am Ende denkt er,"}, {"id": 1124, "start": 5270.14, "end": 5273.14, "text": "du bist sein bester Freund, obwohl er dich einfach nur vollgelabert hat!"}, {"id": 1125, "start": 5273.14, "end": 5275.14, "text": "Und dann fragt er dich nach einer Zigarette und du sagst, nee!"}, {"id": 1126, "start": 5275.14, "end": 5278.14, "text": "Da kann es durchaus sein, dass die mal voll ausrasten!"}, {"id": 1127, "start": 5278.14, "end": 5281.14, "text": "Weißt ja nicht!"}, {"id": 1128, "start": 5281.14, "end": 5283.14, "text": "Achso, der wollte ihm eine geben, ja gut!"}, {"id": 1129, "start": 5283.14, "end": 5284.14, "text": "Ja, trotzdem!"}, {"id": 1130, "start": 5284.14, "end": 5287.14, "text": "Also, dann jetzt nicht der, aber trotzdem, das kann dir schon passieren!"}, {"id": 1131, "start": 5287.14, "end": 5290.14, "text": "Du weißt ja nie, das ist ja alles ganz lustig, aber du weißt ja nie, wie die Leute ticken!"}, {"id": 1132, "start": 5290.14, "end": 5304.14, "text": "Was?"}, {"id": 1133, "start": 5304.14, "end": 5310.14, "text": "Die Aussprache erinnert mich an eine aus der Berufsschule!"}, {"id": 1134, "start": 5310.14, "end": 5316.14, "text": "Ich hab keine Ahnung, wo die hergekommen ist, aber ihr kennt doch das Spiel Worms!"}, {"id": 1135, "start": 5316.14, "end": 5324.14, "text": "Also nicht die Stadt, game!"}, {"id": 1136, "start": 5324.14, "end": 5326.14, "text": "Das kennt ja wahrscheinlich jeder!"}, {"id": 1137, "start": 5326.14, "end": 5330.14, "text": "Und wir hatten eine in der Berufsschule, die hat unglaublich gerne Worms gebucht,"}, {"id": 1138, "start": 5330.14, "end": 5334.14, "text": "oder meint wegen, wie würde der Ami sagen, Worms oder so?"}, {"id": 1139, "start": 5334.14, "end": 5337.14, "text": "Keine Ahnung, zumindest, ich sag immer, es heißt Worms!"}, {"id": 1140, "start": 5337.14, "end": 5343.14, "text": "Zumindest, die war der Meinung, es heißt Worms!"}, {"id": 1141, "start": 5343.14, "end": 5350.14, "text": "Und die hat jedes Mal, wenn es um irgendwelche Games oder so, gesagt, sie spielt Worms!"}, {"id": 1142, "start": 5350.14, "end": 5353.14, "text": "Und ich hab gesagt, was will die überhaupt?"}, {"id": 1143, "start": 5353.14, "end": 5355.14, "text": "Von was spricht die?"}, {"id": 1144, "start": 5355.14, "end": 5359.14, "text": "Bis ich es irgendwann mal gecheckt habe, dass sie Worms meint!"}, {"id": 1145, "start": 5359.14, "end": 5361.14, "text": "Und dann hab ich gesagt, ach du meinst Worms?"}, {"id": 1146, "start": 5361.14, "end": 5364.14, "text": "Und dann hat sie das für mich korrekt ausgesprochen!"}, {"id": 1147, "start": 5364.14, "end": 5366.14, "text": "Die hat gesagt, ja!"}, {"id": 1148, "start": 5366.14, "end": 5368.14, "text": "Also sonst hat sie immer gesagt Worms!"}, {"id": 1149, "start": 5368.14, "end": 5370.14, "text": "Und dann hab ich gesagt, ach du meinst Worms?"}, {"id": 1150, "start": 5370.14, "end": 5372.14, "text": "Du meinst das mit den Würmern, die sich abschießen und so?"}, {"id": 1151, "start": 5372.14, "end": 5373.14, "text": "Dann meint sie, ja!"}, {"id": 1152, "start": 5373.14, "end": 5375.14, "text": "Ich meine, ja!"}, {"id": 1153, "start": 5375.14, "end": 5379.14, "text": "Ich meine Worms!"}, {"id": 1154, "start": 5379.14, "end": 5381.14, "text": "Kann ich mich nur dran erinnern, als wäre es gestern gewesen!"}, {"id": 1155, "start": 5381.14, "end": 5386.14, "text": "Die hat das dann quasi langsam ausgesprochen für mich, dass ich es quasi verstehe!"}, {"id": 1156, "start": 5386.14, "end": 5392.14, "text": "Ich meine Worms!"}, {"id": 1157, "start": 5392.14, "end": 5395.14, "text": "Und irgendwie hat mich das, wie die das im Zug ausgesprochen hat,"}, {"id": 1158, "start": 5395.14, "end": 5403.14, "text": "total an den Dialekt von der auch erinnert!"}, {"id": 1159, "start": 5403.14, "end": 5419.14, "text": "Die hat es genau so angehört!"}, {"id": 1160, "start": 5419.14, "end": 5421.14, "text": "Scheiße!"}, {"id": 1161, "start": 5421.14, "end": 5430.14, "text": "Okay, die hat wirklich Spaß an ihrem Job!"}, {"id": 1162, "start": 5430.14, "end": 5436.14, "text": "Ist es nicht so, dass man Englisch Worms sagt und die Amis sagen Worms oder so?"}, {"id": 1163, "start": 5436.14, "end": 5442.14, "text": "Es ist zumindest nicht Worms und auch nicht Würms!"}, {"id": 1164, "start": 5442.14, "end": 5448.14, "text": "Was bin ich da sehend? Ich erkenne es da nicht so genau!"}, {"id": 1165, "start": 5448.14, "end": 5456.14, "text": "Ach so, der bohrt in der Nase!"}, {"id": 1166, "start": 5456.14, "end": 5461.14, "text": "Ja, gut, wenn man unbeobachtet ist!"}, {"id": 1167, "start": 5461.14, "end": 5465.14, "text": "Ah, noch mehr Nasenbohrer! Ah, jawoll!"}, {"id": 1168, "start": 5465.14, "end": 5473.14, "text": "Lecker!"}, {"id": 1169, "start": 5473.14, "end": 5481.14, "text": "Krassen Rollertricks!"}, {"id": 1170, "start": 5481.14, "end": 5487.14, "text": "Da haben sie sich schon ein bisschen gefeiert für jetzt, oder? Für diesen Hardcore-Trick!"}, {"id": 1171, "start": 5487.14, "end": 5497.14, "text": "Das ist ja, da kann er mit seinem Skateboard bestimmt nicht mithalten!"}, {"id": 1172, "start": 5497.14, "end": 5506.14, "text": "Guckt euch mal den zweiten Typ an! Der Roller ist viel zu klein für den!"}, {"id": 1173, "start": 5506.14, "end": 5510.14, "text": "Oder die Hose hängt so weit unten! Ist das nicht so eine Adidas?"}, {"id": 1174, "start": 5510.14, "end": 5513.14, "text": "So eine Adidas-Hose mit Knöpfen dran!"}, {"id": 1175, "start": 5513.14, "end": 5517.14, "text": "So eine, was man früher Schnellficker-Hose genannt hat!"}, {"id": 1176, "start": 5517.14, "end": 5522.14, "text": "So eine Adidas-Hose!"}, {"id": 1177, "start": 5522.14, "end": 5535.14, "text": "So etwas hatte ich auch! Ich bin aber auch alt, da war so etwas angesagt früher!"}, {"id": 1178, "start": 5535.14, "end": 5552.14, "text": "ASMR-Sounds!"}, {"id": 1179, "start": 5552.14, "end": 5557.14, "text": "Ach du Scheiße!"}, {"id": 1180, "start": 5557.14, "end": 5567.14, "text": "Okay, da ist ja wirklich alles fail dran! Also erstens, warum rennen die schon wieder mit Boxen rum?"}, {"id": 1181, "start": 5567.14, "end": 5577.14, "text": "Zweitens, was ist das für eine Kackmusik? Also die Musik ist keine Musik und was ist das für ein Text?"}, {"id": 1182, "start": 5577.14, "end": 5587.14, "text": "Das ist schon wieder... Ich bete zu Gott, lass die Muschi eng sein!"}, {"id": 1183, "start": 5587.14, "end": 5596.14, "text": "Da war ja hier lyrisch wieder alles auf absolut höchstem Niveau!"}, {"id": 1184, "start": 5596.14, "end": 5600.14, "text": "Moment, ich muss jetzt nachgucken, was das für eine Song ist!"}, {"id": 1185, "start": 5600.14, "end": 5605.14, "text": "Moment, das google ich aber nicht im Stream!"}, {"id": 1186, "start": 5605.14, "end": 5612.14, "text": "Okay, und ich bete zu Gott!"}, {"id": 1187, "start": 5612.14, "end": 5629.14, "text": "Okay, das ist..."}, {"id": 1188, "start": 5629.14, "end": 5639.14, "text": "Okay, wir hören uns jetzt mal an! Also wir hören uns das jetzt nicht an! Wir lassen uns mal kurz die Lyrics dazu!"}, {"id": 1189, "start": 5639.14, "end": 5648.14, "text": "Geben wir uns jetzt mal! Also das ist Bait und Tech! Schatz, was ist los?"}, {"id": 1190, "start": 5648.14, "end": 5668.14, "text": "Kann man das hier überhaupt zeigen? Das ist wahrscheinlich absolut TOS, Jugendschutz, sonst was! Das darf man wahrscheinlich gar nicht zeigen! Okay, aber zahl mal!"}, {"id": 1191, "start": 5668.14, "end": 5681.14, "text": "Was ist das schon wieder für ein Text, Mann?"}, {"id": 1192, "start": 5681.14, "end": 5689.14, "text": "Ich bete mit euch, für diesen Reim hier feiern sich die Ersteller auch noch wahnsinnig ab und denken, sie sind hier Goethe 2.0!"}, {"id": 1193, "start": 5689.14, "end": 5696.14, "text": "Ach, Goethe reicht schon gar nicht mehr, Shakespeare 2.0!"}, {"id": 1194, "start": 5696.14, "end": 5713.14, "text": "Das ist so schlecht auch noch, Mann! Ohne Scheiß! Also nicht nur Deutschrap, diesen ganzen Krempel, das kann jeder, jeder der sich irgendwie..."}, {"id": 1195, "start": 5713.14, "end": 5722.14, "text": "...der sich dazu hinreißen lässt, sowas öffentlich dann auch noch vor sich geben zu wollen. Es gibt ja durchaus gute Sachen, will ich mal gar nichts zu sagen!"}, {"id": 1196, "start": 5722.14, "end": 5732.14, "text": "Ich hab früher relativ viel Semidilux gehört zum Beispiel, das geht ja! Und Eminem kann ich mir auch geben, Rap und Hip-Hop ist sicherlich nicht meine Lieblingsmusikrichtung!"}, {"id": 1197, "start": 5732.14, "end": 5737.14, "text": "Es gibt aber, ich will nicht alles schlecht reden, es gibt durchaus gute Sachen, die kann ich mir auch anhören!"}, {"id": 1198, "start": 5737.14, "end": 5752.14, "text": "Aber meine Güte, ey! Wie sehr die sich da drauf abfeiern müssen, dass sie zwei gerade, das sind doch nicht mal gerade Sätze! Das sind ja auch noch absolut bescheuerte sinnlos Sätze!"}, {"id": 1199, "start": 5752.14, "end": 5762.14, "text": "Aber wie die sich wahrscheinlich innerlich dafür auch noch abfeiern, dass sie zwei Sätze hinbekommen, die man beim Aussprechen irgendwie aufeinander reimen kann..."}, {"id": 1200, "start": 5762.14, "end": 5768.14, "text": "...es ist unbegreiflich! Und dann hört man den Scheiß auch noch mit Boxen laut, wenn man unterwegs ist!"}, {"id": 1201, "start": 5775.14, "end": 5777.14, "text": "Was denn Scheiße, man!"}, {"id": 1202, "start": 5777.14, "end": 5791.14, "text": "Was denn Scheiße! Ich weiß es nicht! Die Socken sind so hoch, das ist gewöhnungsbedürftig! Warum laberst du Leute im Zug an, erzählst ihnen, dass die Socken so hoch sind?"}, {"id": 1203, "start": 5791.14, "end": 5807.14, "text": "Die Socken sind so hoch, das ist gewöhnungsbedürftig! Warum laberst du Leute im Zug an, erzählst ihnen, dass die Socken so hoch sind? Das ist Marek, gut zu wissen!"}, {"id": 1204, "start": 5807.14, "end": 5821.14, "text": "Malte! Mitte 30, glaube ich! Okay, krass! Ja, ernsthaft? Krass!"}, {"id": 1205, "start": 5821.14, "end": 5833.14, "text": "Oh Mann! Nee, das Glück habe ich nicht, von Leuten so oft zugelabert zu werden im Zug! Oder bin ich auch echt froh drum?"}, {"id": 1206, "start": 5833.14, "end": 5842.14, "text": "Wisst ihr, was mein Beweis ist? Wenn irgendjemand sagt, Bugs, das stimmt überhaupt nicht, niemand, nur ganz super high IQ Leute, können deutsche Rap-Texte schreiben..."}, {"id": 1207, "start": 5842.14, "end": 5851.14, "text": "...dann antworte ich einfach, dann zeige ich ihnen einfach das Video, ich weiß nicht mehr, welches es war, ich finde es aber, wenn ich danach suche..."}, {"id": 1208, "start": 5851.14, "end": 5867.14, "text": "...wo ich zwei Zeilen aus einem Haftbefehl-Song genommen habe, habe zwei neue Zeilen mir selbst ausgedacht und niemand hat von den Leuten in den Kommentaren gemerkt, dass das nicht Haftbefehl ist, die letzten zwei Zeilen!"}, {"id": 1209, "start": 5867.14, "end": 5881.14, "text": "Niemand! Ich dachte mir so, wann merkt es denn mal irgendjemand, dass das nicht Haftbefehl ist, was ich hier gerade zitiert habe? Es hat keiner gecheckt!"}, {"id": 1210, "start": 5881.14, "end": 5904.14, "text": "Was war das denn? Welches Video war das? Ich meine, mir geht es um die Texte, dass das von der Aussprache her und vom Stil her und vom Rhythmus, vom Tempo und sowas, dass das mal ein eigener Skill ist, das erkenne ich ja an."}, {"id": 1211, "start": 5904.14, "end": 5916.14, "text": "So ist das nicht, das ist sicherlich auch nicht ganz ohne, aber die Texte sind teilweise wirklich, als hätte das irgendein 5-Jähriger geschrieben, oder 5-Jähriger stimmt noch nicht mal, die haben doch nicht so komische Gedanken."}, {"id": 1212, "start": 5916.14, "end": 5932.14, "text": "Das hört sich an wie irgendein 12-Jähriger, der nicht richtig aufgepasst hat und keine Sätze ordentlich tippen kann und auch die Word-Auto-Korrektur nicht richtig verwenden kann und meint, er muss jetzt mal richtig starke Fick die Bitches-Wag-Texte machen."}, {"id": 1213, "start": 5932.14, "end": 5945.14, "text": "Wo habe ich das denn? Welches Video war das, wo ich bei Haftbefehl noch was dazu erfunden habe?"}, {"id": 1214, "start": 5945.14, "end": 5959.14, "text": "Das Video mit dem... Nein, nein, nein, nein, das war das nicht, das war irgendein Battlefield-Video, Bahn. Irgendwas mit Bahn. Es ging, glaube ich, um die Bahn. Was auch sonst, Leute, was auch sonst? Bahn gleich und das ist zu alt, das kann es nicht sein."}, {"id": 1215, "start": 5959.14, "end": 5968.14, "text": "Bitch, Haftbefehl, das ist es. Hallo Leute hier. Das ist es."}, {"id": 1216, "start": 5968.14, "end": 5971.14, "text": "Äh, das ist es. Wo ist Haftbefehl?"}, {"id": 1217, "start": 5971.14, "end": 5982.14, "text": "Da magst du nicht, ich muss einfach mal ein paar... Total versagen auf ganzer... Und es ist natürlich... Einfach komplett..."}, {"id": 1218, "start": 5982.14, "end": 5990.14, "text": "Hier, jetzt kommt es, glaube ich."}, {"id": 1219, "start": 5990.14, "end": 6002.14, "text": "Okay, ich meine, scheiß auf saubere Klos, also nicht scheiß auf saubere Klos, sondern scheiß auf saubere Klos oder bistro-Restaurant oder sonst was im Zug, ich will einfach nur ankommen und das Ganze halbwegs pünktlich, aber ankommen ist das Wichtigste und es kann nicht sein, dass so oft der letzte..."}, {"id": 1220, "start": 6002.14, "end": 6017.14, "text": "Ich reakte nicht auf meine eigenen Videos, ich will euch zeigen, dass jeder irgendwelche deutschen Rap-Texte schreiben kann. Wie gesagt, von Aussprache, Tempo und sonst was wieder was anderes. Aber rein die Texte, das kann jeder. Das kann jeder, der halbwegs gescheit ein paar Wörter aneinanderreihen kann."}, {"id": 1221, "start": 6017.14, "end": 6032.14, "text": "Um die Statistik zu schönen. Ach ja, übrigens... Nicht die Normalen, die vor Ort sind, sei es jetzt als... Wird bestimmt vieles noch schlimmer wird, dann möchte ich jetzt mal so virtuell meinen Hut vor euch ziehen, mal verkaufen, sondern zu suchen. Am besten nimmt er..."}, {"id": 1222, "start": 6032.14, "end": 6047.14, "text": "...einer nicht nur Statistiken schön rechnen kann, mit Halten ausfallen lassen, sondern auch wirklich, dass da sich mal was tut. Es ist unglaublich. Und das ist ungefähr so, wie wenn ihr IT-Experte seid... Danach ging's. Ich bin dann an Willy..."}, {"id": 1223, "start": 6047.14, "end": 6059.14, "text": "...Brandplatz ausgestiegen, dann zur Goethe-Straße und ja, so wie Haftbefehl, das quasi schon... Jetzt, jetzt. Schon ganz früh wusste..."}, {"id": 1224, "start": 6059.14, "end": 6070.14, "text": "...der hat ja mal gesagt, Goethe-Straße, Louis Vuitton Store, zahl die Kollektion bar, fick auf Sponsor. Hauptbahnhof, Rotlicht, Nutten und Penner, fick die Bahn seit richtige Männer. Der hat dann..."}, {"id": 1225, "start": 6070.14, "end": 6087.14, "text": "Was davon ist Haftbefehl, was ist von mir? Sagt's. Und ich wette mit euch, niemand, der das Original nicht kennt, hört's raus. Ja, natürlich ist das letzte von mir mit der Bahn. Das muss ja auch zum Video passen."}, {"id": 1226, "start": 6087.14, "end": 6096.14, "text": "Ich mein, Chat, ich weiß, ich weiß, ihr seid schlau, sonst werdet ihr nicht bei mir am Start und Leute, die Prime-Subscripted haben, sind natürlich... Subscripted, Alter."}, {"id": 1227, "start": 6096.14, "end": 6104.14, "text": "Leute, die Prime-Subscripted haben, sind natürlich noch schlauer. Ich weiß, ihr seid H1Q-Chat, ihr wisst das. Natürlich ist das von mir, gerade auch, weil es in dem Video um die Bahn geht."}, {"id": 1228, "start": 6104.14, "end": 6119.14, "text": "Aber ohne Mist, das ist genau so. Das kann absolut jeder diesen Mist zusammendichten. Absolut jeder. Ja, sich auf ne Bühne stellen und das dann zu erzählen und das zu rappen und so, ganz was anderes. Aber diesen Text, das kann absolut jeder."}, {"id": 1229, "start": 6119.14, "end": 6136.14, "text": "Und dass gerade dann irgendwelche Low-IQ-Dudes sich übelst darauf abfeiern, dass sie vielleicht im Zweifelsfall noch mit Wörtrechtschreibkorrektur 5 Sätze hintereinander gebracht haben, die mit sehr viel Hängen und Würgen ein paar Reime drin haben."}, {"id": 1230, "start": 6136.14, "end": 6155.14, "text": "Und dann meinen, Alter, ich werd der krasse nächste Kollege sonst wie Deutschrapper. Das ist echt der Wahnsinn. Also jeder ist der Meinung, er kann das. Und anscheinend klappt das ja auch, wenn ich mir das zum größten Teil so angucke."}, {"id": 1231, "start": 6155.14, "end": 6168.14, "text": "Wisst ihr, was die machen? Die schreiben iOS-Notizen-App, genau. Die schreiben aber mit der iOS-Notizen-App so diese Challenge, wo man nur das erste Wort schreibt und danach nur noch Autokorrektur macht."}, {"id": 1232, "start": 6168.14, "end": 6183.14, "text": "Ich glaub, so entstehen diese Texte. Diese Autokorrektur-Challenge. Gibt ja zu allem irgendwelche, Autokorrektur-Challenge. So entstehen diese ganzen Texte. Was anderes kann ich mir nicht erklären, das was wir eben gelesen haben."}, {"id": 1233, "start": 6183.14, "end": 6195.14, "text": "Also ob Haftbefehl Ami-Deutsch hat, hab ich so mal eine Zweifel, ehrlich gesagt."}, {"id": 1234, "start": 6195.14, "end": 6218.14, "text": "Es gibt durchaus gute Sachen, es gibt auch wirklich sehr bedeutungsvoll zusammengedichtete Sachen. Da will ich nichts gegen sagen. Aber nicht jeder, der drei Sätze rausbekommt, wo sich dann vielleicht auch noch mit viel verbogener Aussprache was reimt, ist der geborene Dichter und Rapper."}, {"id": 1235, "start": 6218.14, "end": 6228.14, "text": "Denkt es leider bloß zu viele. Erinnert mich wieder an den Typ bei mir aus dem Arbeitsamtkurs, der auch der Meinung war, was willst du später werden? Rapper."}, {"id": 1236, "start": 6228.14, "end": 6244.14, "text": "Dann hat er mir den Text von sich gezeigt und da kam da drin vor, machst du Faxen, mach ich dich platt mit Axten. Und er fand den Text geil. Und da musste ich lachen, nachdem ich das gelesen hab, da hat er mir den Zettel wieder abgenommen."}, {"id": 1237, "start": 6244.14, "end": 6262.14, "text": "Machst du Faxen, mach ich dich platt mit Axten. Also nicht Axten, das hätte ja noch Sinn gemacht. Axten als quasi im übertragenen Sinne für ich überfahre dich."}, {"id": 1238, "start": 6262.14, "end": 6282.14, "text": "Hey, hätte ich gesagt, coole Idee, aber nein, nein, Axten. Ihm ist nichts anderes eingefallen als Axt. Und nachdem sich das ganze rein musste, waren es halt Axten."}, {"id": 1239, "start": 6282.14, "end": 6292.14, "text": "Und ich glaube, über dieses Dichter-Niveau sind halt die meisten auch noch nicht rausgekommen."}, {"id": 1240, "start": 6292.14, "end": 6320.14, "text": "Und wisst ihr was noch anspruchsloser ist, wenn das ganze dann auch noch mit Autotune gemacht ist, dann hört es komplett auf. Dann sind die Texte scheiße, die Musik ist scheiße, dann ist alles scheiße."}, {"id": 1241, "start": 6320.14, "end": 6337.14, "text": "Da bleib ich doch lieber bei Death Metal oder sowas. Da hat man wenigstens was. Wird ein bisschen gekrunzt. Und ein bisschen merkwürdiges Zeug erzählen."}, {"id": 1242, "start": 6337.14, "end": 6357.14, "text": "Ich will nicht sagen, dass diese Sachen lyrisch immer sonderlich anspruchsvoll sind, ehrlich gesagt. Aber das höre ich mir 100 mal lieber an."}, {"id": 1243, "start": 6357.14, "end": 6376.14, "text": "Aha. Naja, gut. Lass ich mal so durchgehen."}, {"id": 1244, "start": 6376.14, "end": 6388.14, "text": "Oh man, Leute, ich hatte jetzt eigentlich gar nicht vor, dass ich mich über Deutschrap auslasse bzw. mir zwei Videos angucke, bahnen, auswüchse. Aber war doch ganz lustig, muss ich sagen."}, {"id": 1245, "start": 6388.14, "end": 6400.14, "text": "Fand ich echt unterhaltsam. Also da können wir uns tatsächlich, erinnert mich mal dran, Leute. Wir können uns ab und zu mal da ein Video, falls das eine Serie ist, mal so ein Video aus der Serie angucken. Fand ich doch recht lustig."}, {"id": 1246, "start": 6400.14, "end": 6416.14, "text": "Nein, Teil drei kann ich mir heute nicht mehr angucken. Das halte ich nicht aus. Morgen machen wir tatsächlich was. Da müssen wir ein bisschen TypeScript üben. Falls das was wird, ich vielleicht räume ich auch morgen hier mal alles fertig auf."}, {"id": 1247, "start": 6416.14, "end": 6441.14, "text": "Pogscript. Gibt es das? Also ich meine, ich weiß, was du meinst. Es gibt Postscript, aber gibt es schon Pogscript? Hat das schon jemand erfunden? Nein, nein. Pogscript."}, {"id": 1248, "start": 6441.14, "end": 6465.14, "text": "Nicht Postscript. Pogscript. Okay, nice. Pogscript. HelloWorld.pg. Simple macro language. Pogscript."}, {"id": 1249, "start": 6465.14, "end": 6481.14, "text": "No, God. No, God, please no. No. Das ist doch auch irgendeine Memesprache, oder? Pogscript."}, {"id": 1250, "start": 6481.14, "end": 6498.14, "text": "Das sieht aber nicht so, wie ich Pog aus aus. Nicht so Pog. Nee. Dann wird es Zeit. Nein, habe ich noch nicht bestellt. Ja, wenn es nächstes Jahr ist, wird es halt erst nächstes Jahr."}, {"id": 1251, "start": 6498.14, "end": 6505.14, "text": "Ich habe nämlich immer noch nicht genau geguckt, welche Wasserkühlung ich will oder nicht. Vielleicht doch Luft und was für eine genaue CPU und was für ein genaues Mainboard."}, {"id": 1252, "start": 6505.14, "end": 6514.14, "text": "Das müssen wir eigentlich auch machen. Vielleicht sollten wir das lieber morgen machen. Vielleicht sollten wir Pogscript morgen verschieben und nicht bauen. Leute, ihr könnt euch heute aussuchen."}, {"id": 1253, "start": 6514.14, "end": 6525.14, "text": "Und Disclaimer ist nicht gesagt, dass es morgen oder übermorgen wird, aber ich hoffe morgen. Wir machen mal eine Umfrage. Was wollen wir im nächsten Stream machen?"}, {"id": 1254, "start": 6525.14, "end": 6545.14, "text": "Ja, oder 420 kann auch sein. Nächster Stream. Rechnerzusammenstellung. Fertig. Mach. Oder TypeScript."}, {"id": 1255, "start": 6545.14, "end": 6556.14, "text": "Also die Rechnerzusammenstellung ist ja mehr oder weniger fertig, aber es fehlen halt wirklich noch die wichtigen Details, auch wie schnell der RAM sein soll, welche CPUs genau wird. So grob weiß ich es ja schon."}, {"id": 1256, "start": 6556.14, "end": 6564.14, "text": "Haben wir schon gemacht. So, das machen wir jetzt gerade noch. Also was wollen wir im nächsten Stream machen?"}, {"id": 1257, "start": 6564.14, "end": 6570.14, "text": "Pass auf, jetzt machen die Leute wieder 50-50. Das ist ja der neueste Trend, dass man versucht 50-50 daraus zu kriegen."}, {"id": 1258, "start": 6570.14, "end": 6576.14, "text": "Leute, die es nicht interessiert, voten dann mit. Nur um es auf 50-50 zu bringen."}, {"id": 1259, "start": 6576.14, "end": 6593.14, "text": "Und dadurch, dass ich es jetzt gesagt habe, habe ich Leute sogar noch auf die Idee gebracht, das zu machen."}, {"id": 1260, "start": 6593.14, "end": 6603.14, "text": "Siehst du, siehst du. Das ist aber typische Twitch Chat Psychologie. Hätte ich das jetzt nicht gesagt, wäre das nicht so eingetreten."}, {"id": 1261, "start": 6603.14, "end": 6614.14, "text": "Es war nur, weil ich es gesagt habe. Genau, ich wusste, dass das so kommt."}, {"id": 1262, "start": 6614.14, "end": 6626.14, "text": "25-25. Und? Und? Verkackt es noch einer? Nein. Sehr schön. Gut gemacht, Chat. Also mache ich einfach, was ich machen will."}, {"id": 1263, "start": 6626.14, "end": 6630.14, "text": "Good job."}, {"id": 1264, "start": 6630.14, "end": 6637.14, "text": "Nice, nice, nice."}, {"id": 1265, "start": 6637.14, "end": 6644.14, "text": "Okay Leute, wir sehen uns, mach's gut. Bis morgen, see you."}]}