{"text": "Samsung Galaxy Note 20 Pro So, da bin ich! MMO Kreisel-Krein-Sucht gestillt für heute. Jetzt können wir noch ein bisschen, äh, High-IQ, Five Head Chat, den High-IQ ausspielen lassen. Seh, Staub! Schluss mit Klammern und Silvio-Lauten, genau. Brauchen wir nicht. Also, ein bisschen kann ich das, ja. Also, komplett planlos bin ich nicht. Aber mir fehlt halt so die Übung. Und ich dachte mir so in letzter Zeit öfters, wäre es nicht praktisch, ein bisschen besser Pies entstellt zu können. Einfach, wenn Bash zu ätzend wird und sich irgendwie ein.NET GO, was auch immer Programm jetzt nicht gerade anbietet für irgendwie was kleines. Also, ich glaube, das kann auf jeden Fall nichts schaden. Also, ich glaube, das kann nichts schaden. Bei der Gelegenheit, ich mach mal kurz die VM an. Ich mach einmal Updates, installier Pi. Wie heißt das Ding? Community Edition. PyCharm, jetzt hab ich's. Kann ich das hier abbrechen, VMWare, please? Chat, weil ihr seid. Weil ihr seid, Sekunde. Tolle Webladung für heute. Gleich 3.11 Beta. Ja, wenn du mir sagst, was es für gescheite Package Manager gibt, dass man sich die Preview Version installieren kann. So, volle Webladung für heute. Ihr habt 5 Sekunden, ihr habt 10 Sekunden Zeit, also in euch aufzunehmen, weil dann schalten wir wieder weg. Okay. Genug, next. So, also, ich mach erst mal kurz ein Update. 1, 2, 3, 4, 5, 6. Massive FileFile Passwort. Oh. Was ist das denn? Was ist das denn? Was ist das denn? Was ist das denn? Was ist das denn? Was ist das denn? Was ist das denn? Massive FileFile Passwort. Also ich... Hab ich das hier installiert? Nee. Package Manager, der ist eigentlich ganz gut zu installieren von so Zeug. Alle switchen von Piesen auf Go. Nee, überhaupt nicht. Das sind 2 Sprachen. Die haben vielleicht... Mehr kann ich nicht sagen. Überschneidungen, weil das stimmt nicht. Überschneidung in der Fan-Gruppe, also es gibt bestimmt viele Leute die Paisten mögen die auch go mögen und umgedreht, aber ansonsten ist das wirklich was wo ich sagen würde das macht sich nicht großartig Konkurrenz? Ich mein du kannst ja eh prinzipiell alles in allem machen, mehr oder weniger gut. Du kannst auch theoretisch alles in C++ machen, wenn du es erträgst oder dass du selbstwortbegehst oder so aber das theoretisch möglich ist das du kannst auch mehr oder weniger fast alles in Javascript machen oder in Rust oder ansonsten das einzige was sich manchmal davon abhält ist halt wenn spezielle Libraries nicht gibt oder je nachdem wenn es halt was ganz Low-Leveliges sein soll also du wirst wahrscheinlich keinen Boot Manager in Javascript programmieren wobei selbst das theoretisch gehen würde du brauchst in jedem Fall ein paar Zeilen Assembler, das du auf die richtigen Adresse springen kannst und wenn du es dann dort schaffst irgendwie einen Javascript Interpreter zu starten oder was auch immer, theoretisch wird das bestimmt gehen aber ich glaube nicht das man das machen will. DrBronoopsXx excellents subscribtion overlieh danke für den Zap parallel downloads ja Das ist eine gute Idee, aber das ist auch so schnell im Vergleich zu dem ganzen anderen Krempel. Was haben wir denn hier noch offen? Ah, nee kein C++ heute, please Leute, ich muss weg, ich muss los. Haben wir nicht sogar noch irgendwo den Pruder muss los Typ? Tatsächlich, das verwende ich nie, total outdated Meme, warum habe ich das hier überhaupt noch drinne? Pruder muss los, das ist komplett, das habe ich noch nie verwendet. Seit, also doch, aber seit 2 Jahren nicht mehr oder so, noch länger. Weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, jawoll, zack, nochmal Update, ich mache jetzt, ich mache jetzt alle mal kurz die Update und dann starten wir neu und dann können wir uns das Ganze angucken. Wie? nichts, nichts beim Updaten, also den Krempel können wir auf jeden Fall alle schon mal entfernen. ne 3 1 keck wait alter so installieren wir das noch und dann machen wir reboot und dann gucken wir uns das mal an toolbox updates toolbox hat keine updates hat meine toolbox für es aktuell update update so pie charm community ich meine ich könnte ja professionell installieren weil ich habe eine all all desktop license ja immer schon kanalpunkte ausgeben umschlag umfrage vorgeschlagen minus 5000 beste umfrage ja also ich glaube die leute voten für dein voten in deinem sinne ja ja war im browser mit webgl das das klingt mir jetzt irgendwie nach nicht der besten idee desktop app ja du willst auch einen browser haben denke ich oder oder war das nicht sinn und zweck der sache was pipe nf die pippen mache ich chat ihr müsst mir ich habe da keine ahnung von was ist was ist pippen heißen pippen sacred marriage of pippfile pipp und virtual nf das nimmt ja fast schon auf ausmaße an wie bei irgendwelchen javascript libraries wurde keine ahnung mehr hast was alles brauchst was ist das development workflow for humans aber das andere nicht oder wie pipe nf tool aims best of packages und warum genau brauche ich das jetzt also was ist der sinn ok dass ich behalte ich behalte das mal im hinterkopf aber jetzt aber jetzt rebooten wir erst mal war er fertig mit installieren ich hoffe mal ich werde erst mal nichts mit pipp installieren ich werde erst mal standard library machen oder ist es web request zu machen in der peisen standard library immer noch so pence champ wie früher das geht auch bestimmt mittlerweile besser das ging im falschen fenster auf request get und auf geht's jawoll ist es standard library wie gesagt will start library für ein high charm das sind wir du hast wie bei npm logfiles ich weiß jetzt nicht ob ich das jetzt gut oder schlecht finden soll ehrlich gesagt dass man npm nachgebaut hat so auf geht's was haben wir denn für eine version installiert version 3 10.5 ok pleading edge version komm mal hier 26 heute release date heute danke für die ganzen subs leute ich habe mir die hälfte vergessen maxilbermann mehr selbst subscription hier schon neun monate so was ist neu in version 11 3.11 ok 3.11 ist 6 es ist 10 bis 60 mal schneller denn bei wisst ihr was ich auch nicht verstehe was ist denn der unterschied zwischen sieb heißen peipai und und was es da nicht alles gibt das ist mir alles zu als als nichts heißen main ist es mir alles zu 6 hat sieb heißen kompiliert zu 10 ne das stimmt nicht oder sieb heißen ist die standard in der breiter implementierung in c aber was ist der unterschied zwischen peipai und sieb ich habe kein schimmer ok exception groups variating generics moment moment in piste gibt es generics was ist der sinn davon das ding ist dynamisch da brauchst du keine generics das ist das ist generic per design ok wahrscheinlich bin ich einfach zu low IQ dafür das zu verstehen typed dick dick ok nach dick dick required self type ok ich habe keinen platzen schimmer was da überhaupt sich getan hat in drei punkten gibt sogar ein int wait a minute was ist das seit wann schreibt man in pisen irgendwelche types type dictionary ist das so was wie javascript u int 8 array oder sowas return self ich sehe schon ich bin hoffnungslos outdated ich bin hoffnungslos outdated mit meinem pisen game genau aber komplett data class transforms ich dachte immer ein vorteil davon sollte dass das gut lesbar sein sein soll kann ich jetzt drüber kann ich jetzt über streiten ob das gut lesbar ist ok alles klar 6 hat time was ist ein guter pisen verse version manager was ist quasi das rust ab in pisen oder das oder das rbn von pisen also wie kann ich wie kann ich neue versionen installieren ohne mir mein system zu zerschießen oder ist das das was eben jemand gepostet hat das hier was konder ich habe chat ich habe kein nee das was anderes das was anderes monka es alter ich blicke da überhaupt nicht durch also bei ruby gab es rbn das der rbn gemacht konnte den ruby interpreter deiner wahl installieren poetry ich tippe das einfach nur ein weil ihr das sagt nicht dass ich irgendwie ahnung davon hätte man könnte das mit dem container machen ja das würde würde funktionieren was ist das packaging dependency manager nee das ist nichts mit ich würde sagen wir bleiben einfach bei dem der vor installiert ist ich weiß für meine zweck ist das doch eh erst mal egal erst mal den shell script ausführen ok vias code def container habe ich noch nie verwendet was ist das developing inside container six hat time also haben wir alles installiert ja ja ok lelux habe ich habe ich alles installiert ich habe auch dockerberechtigung remote developer extension pack muss ich installieren aber das ist vias code ich will vias code nicht verwenden ich habe keine ahnung was ich will ich wollte eigentlich nur die neust die allerneuste python beta version ausprobieren ich will dann vias code gar nicht verwenden achso ok das ist tatsächlich easy warte mal das probieren wir jetzt mal kurz aus ich mein jetzt habe ich das ganze z plus plus zeug hier offener wartet mal ein eigener ordner ja ich truste komplett so was muss ich installieren ich habe ich habe schon docker extensions installiert hier remote remote ok was muss ich installieren die jetzt jetzt jetzt finde ich nicht wo steht was ich installieren muss hier den krempel da remote development muss ich installieren webpack webpack habe ich immer in großen großen bogen drum gemacht remote development soll ich installieren alles klar ok so jetzt wird es jetzt wird es jetzt wird es gleich richtig zum einstieg mal advance hier restart vias code mache ich sofort so mark dann ja ja ja dann so und wie geht es jetzt weiter quick try development container the easiest way to get started the containers also sprich einfach einfach container oder was nee ok es remote containers docker ist installiert was ist das was ist das für ein massive ja ja habe ich alles moment das ist wieder was anderes habe ich das habe ich das noch nicht installiert jetzt ich habe alles installiert nee remote content doch doch tatsächlich jetzt schon bloatet ja wir brauchen erst mal docker dass wir passen soll ich machen können was restart schon wieder ok was mache ich jetzt sagt es mir chat wie wie funktioniert das hier check installation open folder in container attach running container was zum hier try a development container sample ok ok was auch immer try a try a development container example komm mal da gibt es sogar postchamp der lädt jetzt wahrscheinlich gerade runter oder ja warum installiert der npm what is happening bloatet erst mal die festplatte voll erst mal festplatte voll geblutet ja ich warte es auch nur weil der chat das geschrieben hat und wir wissen ja prinzipiell der chat hat mittlerweile ein IQ level erreicht da kannst du eigentlich nichts mehr dagegen sagen was macht das ding monka es ok press start es ist eine flask ich will keine flask app ja ich hatte ich eigentlich vor aber der chat mein visual studio code developer container sind massif geil so und nun installen was installiert er da so chat ohne über jeden zweifel haben natürlich was was ist aber was macht er denn da im hintergrund er macht dinger guck mal was macht er denn das würde ich auch immer machen was zum was installiert er mir da alles bloat bloat run any percent allah was ist das ich glaube ich muss danach mein visual studio ordner erstmal löschen weil die festplatte voll ist sondern hatte ich eben noch bei 42 gigabyte nie der installiert mir das gar nicht alles der hängt einfach so leh leh leute das ist mir jetzt zu zu zu six hätt ich das kann ich das mache ich jetzt nicht warum gibt es nicht ein stink normalen version manager ok lithium dann sag mir sag mir was ich machen soll ich habe jetzt einen eigenen ordner so eigene ordner guck mal beste so ich mache jetzt das damit auf da ist nix drinne in dem ordner ich habe das ups noch nie verwendet wie in github containers ein def container erstellen in dein projekt machst du def container geisen oder docker fall 3 ne das mache ich jetzt nicht das mache ich jetzt nicht das muss ich mir irgendwann mal auf stream angucken was hat er mir denn jetzt alles draufgehauen remote vs l remote edit man visual studio kohl flatter gehst weg so auf gehts pie entf ja pie entf ist auch das einzige wie ich habe pie entf sogar noch drauf wait a minute install gibt sowas wie update oder so install kann ich kann ich sagen 3.1 3.11 beta 3.11 beta 3 ne ah das das kennt er noch nicht die neueste beta version also richtig outdated jebaited so wir bleiben jetzt wir bleiben jetzt bei dem was ich installiert habe ich glaube das ist doch ganze ecke einfacher also neues projekt meinung zu commander krieger kommt jetzt etwas überraschend ja ich habe mir mit mit dem krieger seit 5 jahren nichts mal großartig zu tun gehabt gibt es irgendwie den anlass hat er irgendwas angestellt oder einfach nur so kommt jetzt sehr überraschend ja also virtual entf will auch standardmäßig ok er macht schon standardmäßig virtual entf der existiert ja die klage existiert auf dem fall manchmal sachen auf dem kopf habe ich gesehen im stream ich lasse jetzt einfach mal die defaults ich lasse jetzt einfach mal hier alles default ausgewählt ja wir gehen davon aus pajam weiß was es macht ich will nicht 3.11 b0 ich will 3.11 b3 aber das gibt es hier nicht ok create ok warum ist da ein breakpoint drinne brauchen wir nicht die fort beste so terminal sind wir hier ok heißen main ok es läuft schon also print weg jawoll ok das funktioniert also so ist so was hat er hier dran auszusetzen no new line at end of file da ist aber pingelig ist aber ganz schön pingelig oder ok das funktioniert schon einmal also jetzt muss ich erst einmal gucken dass ich die schriftgröße irgendwie ordentlich einstelle weil das ist nix font font nicht jetblades mode hack auf 16 18 bm jawoll das ist doch schon viel besser habt ihr irgendwelche sieben empfehlung ansonsten würde ich jetzt einfach mal gucken ob es nicht das rider das rider sieben einfach für pajam gibt hier nicht davon aus dass es gibt die haben das doch teilweise gradin toh was one dark da purple not es erinnert mich zu sehr an nord vpn material sieben wishel studio co dark plus kein bild was was ohne bild nehme ich nicht atom 1 rider ui ja ja please da weiß ich wenigstens wie es aussieht rider ui perfekt install ich also das default ist aber nicht das rider ui das war high contrast nee nicht heiko rider dark rider dark ist ok wo ist oder wo ist studio da meine augen oder wo ist studio da ist jetzt mein font wieder weg ich glaube ich glaube ich starte das noch mal neu das ist das glaube ich etwas abgekackt gerade nein ja ja ich got it always download ich weiß zwar nicht was aber always download visual studio sieben wishel studio rider rider dark oder wishel studio rider dark komm rider dark gut fertig alles klar wunderbar schriftgröße passt hat jetzt meine meine font size eigentlich umgestellt hack 18 alles gut ok auf geht's jetzt jetzt bin ich mal gespannt also wisst ihr was ich mir überlegt habe was zum üben ja ich weiß dass es schon tausendfach gibt aber zum üben einen download speed test also ich werde mir ich habe mir schon eine seite rausgesucht nämlich die hier guck mal wir werden jetzt einfach mal ganz dreist nicht speed champ kleinzeitig wir werden jetzt einfach mal ganz dreist ich habe nämlich eine speed test seite von hetzner gefunden und da kann man einfach downloaden zehn gigabyte datei das sollte zum speed zum speed testen reichen mein ziel ist ja eh dass ich das abbrechen kann dann nach irgendwie zwei sekunden wenn er gemessen hat wie schnell es maximal geht man ks musiker ok also dann dann mal der reihe nach lasst mal lasst mal kurz in mich gehen also im schluss machen wir das multithreaded das letzte mal wo ich mich mit multithreaded in python beschäftigt habe war vorbei das kann überhaupt nicht funktioniert gescheit das ist aber auch schon eine ganze weile her stimmt wir machen da keine semi cola uns hinten dran ja ich bin es einfach so gewöhnt semi cola hinten dran zu machen aber guckt mal das funktioniert anscheinend was sagt er denn trailing semi cola ok es funktioniert aber er will das nicht ok also mit was fangen wir an ich würde sagen wir fangen mit was ganz simplem an nämlich wie mache ich in htp request mit der standard library leute ich will noch keine packages mit der standard library htp get wie funktioniert das how to perform a ttp request bis pyson python part 1 standard library alles klar rom urlip request import url open das sieht relativ easy aus das will ich so will ich das haben so ach ja wie viele einrückungen macht man eigentlich ein vier oder zwei was ist denn so der etablierte standard also ich vermute ich glaube genauso ich glaube vier oder halt vier vier für den tab ein tab ich glaube da macht startmäßig spaces zu tabs ja vier spaces ist es chat ist sich uneinig der chat hat so einen hohen intelligenzquotient ist kein gewunder dass die sich uneinig sind da ist jeder fife hättiger als der andere also normalerweise mag ich ja zwei das kennt ihr von meinen anderen editor einstellungen normalerweise habe ich ja immer zwei spaces aber wir bleiben jetzt hier mal bei dem bei dem default so also warum kann ich das hier nicht verschieben weil die settings shortcuts manage shortcuts gibt es gibt es von jetframes jetframes irgendwie ne ide sync oder so also dass man die die einstellung von der ein ide in die andere sinken kann oh hier aha ne login mit dem account ja das ist mist das meine ich nicht share ide settings ne ich dachte dass ich meine rider keybindings da irgendwie verwenden kann ok line move line move wo ist move line move line ab add keyboard shortcut bamm ist zu irgendeinem anderen müll gebunden den keiner braucht keyboard shortcut down comment comment with line comment with block add keyboard shortcut oh ne das funktioniert so glaube ich nicht wie kann ich multi wie kann ich multi line binden nicht mulche wie will ich wie kann ich sagen dass ich kontrol c kontrol kontrol k kontrol c ne ne anscheinend ja dann kann dann muss es erst mal so reichen also so wir wollen nicht die nasa url ok wie macht man eine function funktion macht man glaube ich immer noch so oder def und dann irgendwie sowas wie irgendwie measure download speed in mbit url nach quatsch hängen geblieben aber brauchen keine klammern und wir brauchen kein simpel cola und wer so und jetzt den kram hier rein schauen wir mal so funktioniert was hat er denn hier für schmerzen damit eigentlich expected to blank new lines expected to obendrüber obendrüber ok da hat aber äußerst genaue vorstellungen wie das aussehen ist wie das auszusehen hat ja sharing your ide settings ist wie man die shared nicht wie man die zwischen eigenen ide shared oder das hatte ich eben kurz auf aber ich glaube das ist was komplett anderes between different instances of the same product ne das ist es ja nicht ich will ja quasi meine rider shortcuts nach pyjam importieren egal das funktioniert schon so was hat er denn jetzt für probleme mit url was hat er für probleme mit mbit typo in word mbit soll ich es allen jetzt megabit schreiben oder wie ok so url url name shadows from autos go ok ja ok verstehe measure download speed nicht dass ich wüsste was ich mache ich habe immer noch keine ahnung wie ich es denn dann machen will er unten drunter auch zwei haben acht er will über und unter den funktion immer zwei zwei sachen haben aha gut zu wissen warum auch immer so open ne url open s response response read ich will aber nicht response read ich brauche den download callback oder sowas oder oder ne wie lese ich denn ok heißt denn download will open chunks oder so stream large binary file with urlib urlib das klingt auch gut ist miss chunker ne response url open ach hier hatte die response ok also response read und dann die chunk size also 4096 und aber das muss ja nicht zwangsläufig 4096 sein ok endlos schleifend time es ist weil eins oder ist es weil true ne es ist pysons es ist weil true mit dem großen t glaub ne wie heißt das programm das er nutzt um linux den windows zustand das hier ist vor immer workstation ich habe es nur im fullscreen auf dem zweiten desktop also guck ich hab das so du kannst hier unten mit windows 11 geht das auch du kannst mehrere desktops aufmachen unter windows ich habe einen zweiten desktop da habe ich vor immer workstation im fullscreen fullscreen drauf laufen kam hier ober mich ausgestellt und es kann ich mit tastatur shortkarte rüber switchen auf windows und rüber switchen wieder auf die vm ist sehr praktisch weil die meisten sachen sind einfach pains champ unter windows zu erledigen ok ergibt das sinn was ich hier mache data response read ok print data ne moment länge sekunde länge len so ne ein bisschen ein bisschen ein bisschen es kann erinnern kann ich mich ja noch ok zeig mal her ich weiß dass es ne endlos schleife ist die aber wahrscheinlich jetzt das ganze ding kaputt machen aber ich will wissen was passiert denn wenn er fertig lesen ist aber das kann ich bei 10 gigabyte bei 10 gigabyte ja nicht ausprobieren ich glaube die hatten auch 100 mb datei bäm not found ok was 100 mb excellent null ok null also sprich wenn ich null gelesen habe ist der input zu ende gibt es gibt es auch sowas wie response ok es gibt keinerlei autocomplete leute wie kriege ich da jetzt ein autocomplete für dass ich weiß was das ist wie kann ich den dazu überreden das zu autocompleten ich meine neue type annotation habe ich gelesen man kann glaube ich sowas machen gell oder str oder so das das geht glaube ich das habe ich letztens in dem video gesehen space before da ist aber äußerst pingelig so und return wert kann man irgendwie so machen das kenne ich das war der autocomplete response hat nur read ja da gibt es kein das hat überhaupt kein autocomplete ok heißen response muss man die hilfe gucken response rttp response response das jetzt response response objects also read haben wir zu bieten read into get header message url headers status na gut status ist 400 das gibt es nicht sowas wie end file end oder so status nee es gibt nur den status code den brauche ich keine ahnung ob das nach geht das stimmt stimmt ja ja ich könnte ich könnte tatsächlich if data was kann man if not data geht das auch ist null ist null not gucken wir mal hey 5 header alter ok das muss das muss man auch wissen if not gibt es gibt es ein paar sie du weil oder sowas ich glaube nicht ich glaube es gibt bloß vor und weil wenn ich das richtige erinnerung habe nee gibt es nicht ok also das das würde funktionieren data response read also in 4000 ok wenn wenn response aber wisst ihr was funktioniert passt mal auf 6 hat heim if nee oder das wäre jetzt so schön wenn das funktioniert python weil running variable oder sowas es ein variable in while loop condition excellent while line gleich ja genau sowas will ich mache ah guck mal da doppelpunkt gleich das ist ja fast wie in goal ein bisschen doppelpunkt gleich so da können wir uns das nämlich sparen drin checken ob das auch funktioniert oder oder muss ich jetzt noch sowas wie das dahinter machen irgendwie schauen wir mal nee ok das ist das finde ich schick dass das finde ich ganz nice nice nice so das ist schon kurz und knackig das gefällt mir ok cool so ich retorne keinen int sagt er mir gut dann retorne ich jetzt mal testweise einen int du lernst sogar noch was ja siehst du ich ich weiß gar nicht wie es anders funktioniert das ist ein ganz neues feature siehst du leute ihr pleading edge hütonisiert alles die nennen sich python programmierer eigentlich die russleute rennen sich ja ganz ganz furchtbar cringe ich krass krass tachens oder so da muss ich immer auch mit den augen rollen wenn ich das höre dass das irgendjemand schreibt oder ich höre nicht dass es jemand schreibt wenn ich es höre dass das irgendjemand sagt beziehungsweise wenn ich lese dass es irgendjemand schreibt das ist sehr neu enterprise developer enterprise developer wäre angela und java ok also weiter lass mal lass lass mal fife hatten also leute das müssen wir unbedingt etablieren anstatt zu sagen lass mal nachdenken lass mal konzentrieren sagen wir ab jetzt immer lass mal fife hatten das ist auch sichergestellt dass es auf der welt genau eine handvoll leute versteht kann ich als sap was entwickler bestätigen ist das so lass mal fife hatten genau so wie kann ich jetzt überprüfen ok lass mal ich muss mal ich muss mal kurz in mich gehen leute also ich möchte ja so viel downloaden so viel wie geht und dann will ich abbrechen nach sagen wir drei sekunden oder so also ich muss mir die size jetzt merken ok also size gleich data länge ne das muss ich hier oben reinschreiben ne sei es sei es klar ich soße sei es gleich null so ah alter ich bin mal im semi kohle und man sei es gleich null so funktioniert jetzt wenigstens das hochzählen und im moment sei es plus plus kann man plus gleich machen ist plus gleich auch neu ich bilde mir ein früher musste man sei es plus sei es machen wie gesagt meine pausenkenntnisse halten sich in grenzen ok sei es das sollte doch jetzt funktionieren mit hochzählen oder ja funktioniert sei es plus plus geht nicht sei es plus plus geht tatsächlich nicht das das ist nicht pyson style genug anscheinend was macht man was macht man in pyson anstatt dessen plus gleich eins wahrscheinlich ne was alter boah der ist aber mal super pingelig der checker hier aber ist gar nicht schlecht eigentlich gar nicht so übel dann sieht das wenigstens halbwegs ordentlich aus warum ich diese einschreite weil ich das mir bescheuert weise angewöhnt habe ok also jetzt wissen wir unsere size davon so und von der idee her kriege ich ja meine download geschwindigkeit relativ einfach raus und zwar wenn ich irgendwie meine meine sagen wir mal time now ich weiß dass ich das so nicht geht aber nur mal von der idee her ja von der idee her würde ich sagen time now dann würde ich so was sagen wie elapsed elapsed oder sowas und dann irgendwie now minus start falls man das start so und dann würde ich einfach sei es geteilt durch dauer machen und dann hätte ich mein download geschwindigkeit so ungefähr aber das funktioniert wahrscheinlich nicht date time now date time now pyson format on safe ja können die bestimmt das ist eine gute idee format gucken wir mal ob der das ob der das checkt wenn ich das so mache und sag jetzt hier format document ja das checkter safe format on safe format safe actions on safe reformat code excellent nao date time now was kommt denn da raus wenn ich date da date time now benutze nein es ist ein eine raute ok was kommt denn da raus date time not defined ok import muss man importieren date time from date time da hätte ich auch selbst drauf kommen können ok und das kann man voneinander abziehen geht das ach so ja natürlich das ist klar dass das nicht funktioniert das ist das ist klar dass es nicht funktioniert ich muss quasi sowas hier machen start und dann date time now minus start ja das funktioniert easy ist das der ist das der pyson gedachte weg sowas so zu machen oder wir machen mal pyson time oder gibt es sowas wie stop stop watch oder sowas how to create a stopwatch nee dachte vielleicht in der standard library schon drinne ist es der pysonic way genau elapsed time how to measure elapsed time in pyson time it import time time another option science pyson 3. might be perfcounter was aber warum gibt es da 20 varianten warum gibt es date time now time time time perfcounter time process time da komme ich ja fast wie ein java script von mit sich in deprecated sachen perf perfcounter klingt so als wäre es super superschnell jetzt gibt es ein beispiel für import from time import perfcounter ok ich hasse das kann ich einfach sagen from time import time oder einfach nur import time und dann sagen time perfcounter doch viel besser so ok also achtung gucken wir mal perfcounter ahja obvious alles klar 2711 das ist meine ab time wtf das ist meine ab time aha ok ok ich habe keine ahnung warum es da so viele varianten gibt aber ok wir nehmen jetzt den perfcounter das sieht moderner und und pfeilfertiger aus ach guck mal der kann sogar das eindrücken jetzt selber machen da gott sei danke ok also now ist dann time perfcounter bla bla bla read und jetzt ist die elapsed ist time perfcounter minus start und dann die size size durch elapsed ja wo da vorne war auch schon mal schneller aber das ist jetzt ja insgesamt über den gesamten download das passt zum das ist viel zu schnell ah moment moment moment lass mal kurz überlegen das ist jetzt ja auch in megabyte nee es ist nicht in byte das sind bytes in bytes pro sekunde was kommt denn da überhaupt raus pro sekunde oder was ist das ja pro sekunde seh ich das richtig also die einheit hier ist jetzt bytes pro sekunde also bytes pro sekunde also sprich irgendwie 50 mb das kann durchaus sein 400 mbit zu megabyte das sind irgendwie was um 15 doch gar nicht so schlecht das das kommt schon ungefähr natürlich ist das so wie ich das messe absolut hirn verbrannt aber von der idee her ist das glaube ich schon mal gar nicht verkehrt so so und wir messern wir messern da jetzt natürlich nicht das so sondern wir warten eine sekunde messern das einmal und dann resetten wir das und dann messern wir dreimal und nehmen dann irgendwie den höchsten wert oder sowas von würde ich sagen also lass mal überlegen ob das funktioniert was ich mir da so vorstelle also if elapsed größer gleich eins also eine sekunde dann bin ich das ok und dann resette ich sei es und resette ich elapsed auf neustart wert aber wir können uns ich habe eine idee was wir machen wir machen das objekt orientiert ich baue mir ich baue mir eine stoppur klasse dafür nicht weil sinnvoll ist sondern einfach das ist das miem zu teimet es gibt ein miem zu teimet was ihr alles gibt du musst schon start resetten das ist richtig muss start resetten nicht elapsed so Leute das funktioniert relativ gut ich meine der bricht zwischendrin mal ja zwischenzeitlich bricht er immer mal ein da hat der hetzer server kein bock mehr ordentlich zu antworten dann schwankt es schwankt ein bisschen ja muss die 10 gigabyte datei muss erstmal wieder bei hetzer in cash geladen werden kannst du bei mir einen kurs machen ja super ich bin als ich bin am besten um den kurs zu machen ja ich habe selbst keine ahnung wobei es gibt so viele leute die was verkaufen wovon sie keine ahnung haben da bin ich wäre ich eigentlich in bester gesellschaft stimmt der buffer ist ein bisschen klein vielleicht gell ja der buffer ist ein bisschen klein komm wir machen einfach mal das zehnfache ne ne ich war ich habe keine kurse dafür ist es auch viel zu verplant was ich mache da müsste ich ja auch mal strukturiert irgendwas ne ne sowas gibt es habe ich nicht aber ich habe gelesen dass twitter glorian wie heißt er irgendwie so algorithmen verstehen dass der gerade an einem pyson buch schreibt und ich glaube der hat ein plan davon wenn es was taugt dann ich denke mal das wird empfehlenswert aber ob es dann wirklich was taugt muss man mal gucken spuky spuky musik sie konnten leute schon mal kurz was zu essen abholen unten schicken Das war's für heute. Bis zum nächsten Mal. Das war's für heute. Das war's für heute. ist ja nirgends win. Also meine download-geschwindigkeit ist ziemlich am schwanken. Guck mal hier, wie die einbricht zwischendurch. Das könnte natürlich auch daran liegen, dass Vodafone sonntags abends irgendwie rumspackt. Was die Magic in Zeile 12 macht, das weiß, das hab ich auch gerade gelernt. Wie gesagt, ich hab keinen großen Plan davon, aber das hab ich mir auch gerade ergoogelt. Das nimmt die Variable, also das schreibt das hier in die Variable Data, sodass du Data in der Schleife verwenden kannst. Ansonsten hättest du es vorher deklarieren müssen und checkt auch gleichzeitig Data auf die Abbruchbedingungen, ob Data true ist. Das ist fast ein bisschen wie JavaScript, weil eigentlich kann ja ein Int, wobei das ist ja gar kein Int. Doch, nee, das ist ein Array oder sowas, was da zurückkommt. Eigentlich kann ein Array nie false sein, aber in Python und JavaScript geht das anscheinend. Das sind 4 Kilobyte mal 10. Musst du nicht die Endzeit, Startzeit messen, bis die Datei fertig geladen ist? Nee, ich messe eine Sekunde lang. Guck mal, sobald eine Sekunde um ist, messe ich die Zeit und dann setze ich Startzeit und gemessene Size wieder auf Null und dann mach ich wieder von vorne. Also, das find ich nice. Also mein Downloadspeed schwankt ganz schön. Warum das am Anfang so schnell ist, liegt wahrscheinlich daran, weil der Kram irgendwo im Cache liegt. Entweder bei mir oder auf dem Server, beim Anbieter oder so, keine Ahnung. Du nimmst 10 Gigabyte an RAM auf? Nee, Quatsch. Also so blöd wird er nicht sein. Der wird da schon re-usen und garbage collecten zwischendurch. Das wäre ja bescheuert, wenn das mein RAM voll machen würde. Ich mein, das hier ist nicht mehr, das ist ja nicht mehr referenziert nach einem Durchlauf. Das wird er schon aufräumen. By the way Leute, wisst ihr, was ich gesehen hab? Hier auf dieser Hilfeseite vorhin zu response, es gibt doch sowas wie read into. Und jetzt mal eine blöde Frage, warum gibt es read und gibt es read into? Read into liest das in einen Buffer, den ich vorher bereitstellen muss. Ist das schneller, weil das hier jedes Mal dynamisch einen Buffer macht? Also wenn ich jetzt sage read into, also ja. Wie macht man eigentlich einen Buffer? Wie heißt das? Buffer fixed size. Float a game, Dankeschön für den Sub. Wie macht man denn Array? Wie macht man denn Array? Array, jawoll. Ich brauche einen Buffer mit einer festen, wie geht das? Fixed size. Fixed size, ok. Das kann doch nicht sein. Nee, nee, nee, nee, nee, nee. Wenn die in der Standard Library drinstehen haben, read into, da brauche ich dazu garantiert keine extra Library, dass es. Aber List gleich Null kann es ja alles sein. Memory View, what? Ok, Python Array, bytes. Byte, was? Byte Array message returns, a byte array object. Ich bin einfach nur am googeln, aber so ist das halt, wenn man was Neues lernt. Byte Array Syntax. Byte Array Source. Ich habe keine Ahnung, geht das? Buffer? Und was jetzt? Byte Array? Ok, Byte Array. Ja, example please. Byte Array Objects. Byte Array. Source encoding. Ah, zero filled instance with length 10. Also Byte Array 4096. Read into. Ich glaube der andere Weg ist schon der bessere, oder? Read into returns die Länge der gelesenen bytes. Also es ist nicht data, sondern es ist Länge. Und da muss ich gucken, ob Länge größer Null ist. Ok, Leute das andere ist aber schöner. Wobei ich dann hier direkt, wobei das muss ich nicht Länge numm, numm heißt das jetzt. Dann muss ich hier nämlich size. Und ist das jetzt? Nein. Was steht denn in numm drinnen? Was? Ah, Moment, der schreibt das da jetzt rein. Kann man das klammern? Aha, hey, das funktioniert. Das ist jetzt aber eher C-Style als Python-Style, oder? Ich glaube nicht, dass es so gedacht ist, das zu verwenden. Aber das funktioniert. Aber wirklich schneller ist es auch nicht. Aber das macht keinen Unterschied, guckt mal. Das macht überhaupt keinen Unterschied in der Geschwindigkeit. Ok, das mache ich wieder rückgängig, das ist ja komplett unsinnig so. Also es war vorher doch schon schöner. Das Byte Array kommt auch wieder weg. Read, ja. 4096 muss reichen. Das Internet wird auch... Ja, aber guckt mal, die ersten paar kommen aus irgendeinem Cache und es geht mega schnell. Und danach geht es wieder runter. Jetzt bleibt es länger oben. Nee, jetzt geht es wieder runter. Ok, jetzt rechnen wir das mal um. Jetzt Leute, jetzt rechnen, lass mal Fivehead sein. Also wir rechnen das jetzt um. Die... Nimm mal raid. Let raid gleich... Was mache ich denn hier, meine Güte. Raid, klar. Kein Semikolon, kein Let, kein War, nix. Nimm mal raid. Ja, ich bin ja noch zu hardcoded von anderen Sachen. Size durch elapsed ist die Raid. Ok. Raid... Leute, wir machen es in Bit, oder? Wir machen es in Megabit. Also es ist die Size mal 8, dann ist es dann in Bit und dann die Raid durch 1024 Kilobit durch 1024 Megabit. Ergibt das Sinn, was ich mache? Schauen wir mal. Nicht... Naja. Wobei das kann schon sein. Was ist noch ein Vorstellungsgespräch für Physiak? Ich dachte, du hast den Vertrag schon unterschrieben. Ja, kommt hin, oder? Ich meine, es müsste eigentlich 400 MBit sein. Nee, nicht das durch 8. Ich habe das hier mal 8 gemacht, dass ich es in Bit habe. Ich habe das ja schon in Bit. Dadurch habe ich das in Bit. Ich sag doch, die suchen Leute. Wie verrückt. Ok, passt, passt. 400 MBit, maximal. Leute, ich habe eine Idee. Wir traffic-shapen einfach mein Interface runter auf irgendwas und dann sehen wir, ob... Monkeys. Was ist das? No. Was habe ich gedrückt? Wir traffic-shapen jetzt mein Interface und dann sehen wir, ob das funktioniert oder nicht. Ich muss aber noch mal kurz in mich gehen. Also, das hier ist die Raid in MBit. Wir machen das anders. Wir machen jetzt noch was wie Max Raid. Hier unten returnen wir Max Raid. Problem ist nur, wenn es 0 ist, Leute. Da gibt es die Weit-durch-Null-Error. Wobei, nee. 0 durchgeht ja. Plus durch 0 geht nicht. Also, Max Raid. Was hat er für Schmerzen jetzt? Expected Type-In, Gott, Float. Ja, dann stell dich nicht so an, dann Float. Nee, das muss so schon funktionieren. Ich will da keinen Exception Handling-Krobot machen. Raid. Und jetzt, und jetzt, passt mal auf, und jetzt machen wir es so. If Max Raid ist kleiner als Raid, nur dann setzen wir Max Raid auf Raid. Das heißt, so kriegen wir immer das Schnellste, weil was interessiert mich, wenn der Download zwischenzeitlich mal schwankt. Ich will einfach nur gucken, was das Schnellste ist, was durchging. Kann man sowas machen? Max Raid gleich Raid if kleiner Raid? Geht sowas? Nee. Ok, weil in Ruby würde das funktionieren. Aber das geht anscheinend nicht. Ja gut, else könnte ich hier machen, aber das ist... Ah, das geht tatsächlich, aber das ist nicht das, was ich haben will. So. Rind. Max Raid. Ja, am Anfang flutscht es mal. Wir brauchen noch mal einen anderen Server zum Speedtesten. Speedtest10gb. Gibt es da nicht noch irgendwelche... Hier, genau das gleiche habe ich gesucht im Hinterhalt. Dafür habe ich nämlich diesen Hetzner Speedtest Server gefunden mit 10gb. Belvispeed. Wunderbar. Das wollte ich auch machen. Ist doch ok. Mal gucken, wie sehr das runtergeht. Alter, warum bricht denn der Download immer so krass schnell ein? Guck mal, der Download ist total... Der startet mega schnell und dann wird es kacke. So als Traffic Shape mich Vodafone übelst runter. Der Download ist einfach nur halb so schnell, wie er sein könnte. Startet mega schnell, wahrscheinlich, weil es aus dem Web-Server Cache kommt oder so. Aber das sind ja eh nur Nullen wahrscheinlich. Guck mal, das ist richtig mies der Download zwischenzeitlich. Sind die ersten Biles nicht immer mega schnell? Ja, wahrscheinlich, weil sie aus dem Cache kommen. Ach, das ist random? Ja, trotzdem. Aber trotzdem Müll. Guck mal, wie lahm das ist. Also müsste ich theoretisch die ersten 10 Sekunden vom Download fast schon wegschmeißen. Ne, ne. Haben wir noch irgendwie einen schönen Test-Server? Speed X? Test File. Ok, ich nehm' das. Test File. Test Download. Bandwidth. Test. Vergleiche das mal mit Weget. Doch, ich könnte Speedtest CLI nehmen. Natürlich könnte ich das. Das ist aber nicht hin und zweck der Sache. So, ich Wegette das mal. Ja, ja. Guck mal. Also mein Speedtest ist relativ genau. Das geht einfach runter. Na gut, es ist Sonntagabend und es ist Vodafone. Aber wisst ihr, was wir machen könnten? Ja, zwischens. Ja, das ist genau das, was ich auch messe. Aber wisst ihr, was wir machen könnten? Wir könnten einfach einen parallelen Download machen. Guck mal, sowas hier. Aber machen wir nur 10G. ARIA 2C und dann Minus X oder so. X20? Ne. Das ist ein Kommandozeilen-Download-Manager, der Multithreaded downloaden kann. Minus X und dann irgendwie 16. Da flutscht's, wenn ich jetzt einfach 16 Verbindungen aufmache. Guck mal. Das bleibt am Limit. Leute, ich seh schon, wir müssen heute auch noch lernen, wie man Multithreading in Python macht, dass ich das nachbauen kann. Ich ahne Schlimmes. Guck, der bleibt immer auf einem Niveau, weil der eben zig, der macht 16 Verbindungen auf. Das ist kein Ding. Aber mit einer Verbindung, können wir noch mal ausprobieren, wie das mit einer Verbindung aussieht. Ja, jetzt ist es noch im cache und sobald es aus dem cache draußen ist, geht's runter. Guckt. Async ist angenehmer. Ich weiß aber nicht, ob mir Async was bringt. Ich brauch ja wirklich 10 gleichzeitige Downloads im Endeffekt. Ja, ok. Zumindest wissen wir schon mal, dass wir wissen schon mal, dass meine Download-Messungen relativ akkurat sind. Ich mein, exakt das gleiche passiert bei mir auch. Guck, das startet schnell. Trosselt der Server die Connections? Ganz ehrlich, ich glaube eher sogar, dass das Vodafone ist. Würde ich jetzt einfach mal vermuten, ja. Weil Sonntag Abend ist. Genau so ist das hier. So. Alles klar. Ok, Fivehead-Time. Lass mal, lass mal. Also das mit der Max-Rate, das lass ich mal, das lass ich mal weg. Ich mein, wir könnten auch sowas machen wie Bites to Mega-Bit. Oh Gott, man. Ich wusste, wer das... Ich hab mir einfach zu sehr Klammern und Simikolon angehört. Bites to Mega-Bit. So, und da machen wir jetzt einfach Return. Das durch 8 durch 1024 durch 1024. Stimmt das, was ich da mache? Ihr seid sixheadiger als ich. Und wenn ich jetzt sage, Rate? Mal 8? Oh. Mal 8? Nee, Leute. Aber das muss man, das Klammern? Hä? Ach, der macht immer noch mal 8. Hier. Lull. Ja, ja. Das ist aber falsch, was ich mache. Moment. Moment, nicht die Rate, die Size. Die Size. Wartet mal. Ist zwar doch richtig, was ich gemacht hab am Anfang. Nee. Ah, Moment. Ich bin, ich bin, ich bin... Also jetzt ist es... Ah, man, Bites, Bit, Umreiche, please. Das ist jetzt die Rate Bites pro Sekunde. Ah. Okay, das sind jetzt Mega-Bites pro Sekunde. Und wenn ich das Ganze jetzt mal 8 rechne, dann stimmt's. Okay, gut. Alles klar. Das ist dann, können wir uns, können wir uns das sparen. Bites. Alles klar. So. Das ist jetzt vielleicht ein bisschen besser lesbar. Also, wie können wir das jetzt mit mehreren Connections machen? Multithreading ist einfach. Thread, threading, target, minor, target, arcs. Okay. Warum threads? Ja, was ist denn die Alternative? Ich lese in Chunks. Ja, aber ich mach nur eine Verbindung auf. Ich will mehrere Verbindungen haben. Ich will mehr, ich will das hier quasi mehrfach starten. Also von der Idee her, lasst mal überlegen, vielleicht sollten wir das hier erstmal ordentlich machen, sodass es gut funktioniert. Also, ich müsste jetzt ja von der Idee her, das sagen wir mal 10 mal starten und dann in allen Jobs, meine, oh nee, ach du Scheiße. Wie mach ich denn das jetzt gescheit? Ich müsste den Kram ja auch noch irgendwie synchronisieren, oder? Boah nee, das ist mir jetzt zu kompliziert. So, wenn ich einmal insgesamt durchlaufen lassen könnte, wäre das easy. Also, wenn ich einfach bis zum Ende durchlaufen lassen könnte und dann würde ich die Zeit, nee. Da muss ich mir jetzt erstmal Gedanken zu machen. Ich glaube, das schieben wir jetzt erstmal auf, bis ich ein bisschen mehr Basic Sachen gemacht habe. Genau, ich müsste aus allen Threads die Rate addieren, aber, wobei gleichzeitig ist egal, oder? Nee, wisst ihr was ich bräuchte? Ich bräuchte eine Liste, wo jeder Thread seine aktuelle Rate reinschreibt und dann bräuchte ich noch so eine Art Monitoring Thread, der dann die Rate einmal in einer Sekunde ausliest und zusammenrechnet. So was in der Richtung müsste man. Also quasi, ich schreibe es nur sinngemäß hin, dass man irgendwie eine Liste hat. So, das ist Rate 1, also keine Ahnung, das hier ist Thread 0, das hier ist Thread 1, das 2, 3, 4, 5, 7, 8. So, an jeder Stelle schreibt der Thread seine aktuelle Transferrate hin und dann würde ich noch einen Thread starten, der einmal in einer Sekunde nachguckt und das ausgibt, was da drin steht. MonkaS, Alter. Da bin ich mal gespannt, ob wir das gebacken kriegen. Aber von der Idee her funktioniert ja meine Messmethode so halbwegs. Wir sollten vielleicht nach 3 Sekunden, Leute, wir brechen, ich meine, das sind 100 GB, die lade ich nicht so schnell runter. Wir brechen ab, wir brechen ab nach 10 Lesendinger, irgendwie Counter gleich 0. Kann man eigentlich sowas hier machen? Was? Heißen Multi Initialization. Assign Values. Hä? Ich bin einer, ich will das gleiche Value haben. So. Okay, das ist doch unlesbar as fuck, oder? Das macht man doch nicht. Sag mal, Leute, wie würdet ihr das schreiben? So oder untereinander einfach? Untereinander ist die schönere Variante, oder? So, oder? Ich glaube, so ist doch die bessere, die bessere Variante. AndiProfis hat Python-Channels wie aus Go oder Rust? Naja. Jede Programmiersprache hat Channels in diesem Sinn, aber halt nicht Sündagstechnisch in die Sprache integriert wie Go. Es gibt in jeder x-beliebigen Sprache sowas wie Channels, aber halt nicht mit der schönen Sündags dazu. Warum überhaupt vor der Schleife Initialisieren? Äh. Naja, weil ich die Sachen brauche in der Schleife und das Ergebnis nach der Schleife dementsprechend kann ich es nicht in der Schleife machen, weil dann das Ergebnis nicht nach der Schleife da ist. Na, wenn ich start in die Schleife pack, funktioniert das Ganze ja nicht mehr. So, Counter. Machen wir mal hier, Counter. Wie war das jetzt? Plus gleich eins, ne? Genau. Und jetzt, if, Counter, größer oder, wir machen mal größer, gleich fünf und dann ausführen. Ja, funktioniert. In dem Fall ist es doch egal, ob das richtig echtes Multiswerding ist oder irgendwas, was automatisch lockt oder, oder irgendwie das JavaScript-mäßig Event-Loop queued. Wir warten doch eh hauptsächlich IO hier. Das sollte doch eigentlich keine großartigen Auswirkungen haben. Wenn ich die Schleife, deine Vorschleife ist in dem Fall tatsächlich blöd, weil ich mache hier diese Zuweisung drinnen. Ja, aber wahrscheinlich ist es tatsächlich besser in dem Fall. In dem Fall ist es tatsächlich, ne, ich will es ja laufen lassen. Fünf Mal oder bis es zu Ende gelesen ist. Das kann ja auch sein. Letztendlich macht es aber nicht viel Unterschied. Das ist eins, zwei, drei, vier, fünf, sondern beim sechsten Mal bricht es ab. Guck mal, größer, gleich fünf. Fünf, bumm. So. Wunderbar. Eine Sekunde. Alter, es ist la... What the fuck? Ja. Okay, funktioniert. Wunderbar. So und das jetzt Multithreaded. Das wird ja, das wird ja was. Eigentlich setzt man auch alles unnötige, was nicht im Rift drin ist, außerhalb wie die Variablen. Du meinst, kann ich das dann da drin gesche... Achso, ja. Meinst du so? Ja, ist auch deutlich sinniger, oder? Was anderes kann ich nicht, gibt es nicht? Da kommt doch ein Request zurück, oder? Kann ich nicht so machen? Request? Und dann das hier einfach weglassen? Ne. Warte mal. Einmal nicht Response. Response. Response. So. Muss auch gehen. Ach, jetzt close da das aber nicht automatisch, ne? Also müsste da ein Response close. Auf der anderen Seite, wenn es irgendeine Exception gibt, dann kackt es ab. Dieses Width gibt es doch eh nur für den Fall der Fälle, dass es dann finally Block drum macht, oder? Das ist schon, das ist ein bisschen wie wenn ich ein, ein, ein Using in C-Sharp mache, vermute ich jetzt einfach mal. Ne, dann ist das so schon sinniger. Was, while data gleich und re... Wie das funktioniert? Und? Range? Was zum? Das geht? Igitt? Was hab ich denn? Was ist das? Monka. S hoch, hoch 3, Alter. Und wie kann ich jetzt auf Range hier drinnen zugreifen? Ah ne, gar nicht, muss ich ja nicht. Nein. Funktioniert nicht. Chat. Funktioniert nicht, was ihr gesagt habt. Nope. No Pass. Das wäre ja aber auch hässlich für die Nacht. Das ist, ja der macht einen und. And? Ne, das, ich will doch keine logische, ich will doch hier keine logische, ne, ne, ne, ne. Da kommt jetzt hier als Datatyp True oder so wieder raus. Ne, ne, ne, ne, das will ich nicht. Hier soll ja, hier soll ja wirklich die, die, die, die Response drinnen stehen. Ne, ich bleib jetzt mal bei dem, was ich hier gemacht hab, man, das funktioniert ja ganz gut. So, das mach ich wieder weg. Alter, wie oft hab ich denn die eins bitte schon copy pasted? Was? Ok, wunderbar, Kunst. Ok, wie kriegt man das Multithreaded? Jetzt wird's, jetzt, jetzt wird's richtig advanced. Also, ok, Multithreaded. Python. Task. Coroutines and Tasks. Ok. Creating Tasks. For Range. Async IO. Create Tasks. Background. Oh, jetzt wird's, jetzt wird's aber pfeifert. Was war das andere, was jemand hier oben geschrieben hat? Threading Thread. Was ist denn da jetzt schon wieder der Unterschied? Warum gibt es da verschiedene Dinge? Wann verwende ich was? Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Wann verwende ich was? Ok, ich mach erst mal Threading Thread. Ok. Ok. Das, also, was machen wir da jetzt? Import? Ne. Threading? Einfach so? Ok, das muss ich jetzt, das muss ich jetzt mal kurz austest. Also, ich sag jetzt, was? Threading? Thread? Und dann? Hab ich kein Autocomplete? Das ist schonmal äußerst not Pog? Doch, ich hab Autocomplete. Group? Target. Alter, wie? Target. Also, Target ist dann Measure. Aber das, das, das braucht ja ein Argument. Ah, hier. Arcs. Arcs. Und das ist dann was? So? Und jetzt sag ich irgendwie, was kommt denn da jetzt zurück? Irgendwie ein Thread? Oder so? Und dann sag ich Threading Join? Ne. Hab ich kein Plan ab, was ich mache? Einfach so Join? Ne. T1 Join? Join? Ah. Run? Join? Start. Was ist denn da jetzt der Unterschied? Start. Also, muss ich erst jetzt noch sagen Start? Und dann Join? Oder wie? Oder wo? Ne. Wow, wow, wow. 33 were given? What? Jedes Character, oder? Wie übergebe ich denn da Arcs? Bei den Arcs musst du ein Komma hinter die Klammer machen, dass er Eck. Hinter die Klammer? So? Oder so? Alter, 5 Head. Da wär ich ja nie drauf gekommen. Kann ich nicht, warum kann ich nicht einfach sowas hier machen? Jetzt mal was anderes. Jetzt mal was bescheuertes. Wie ist denn die Lambda Syntax in Python? Wie sieht denn das aus? So? Also, kann ich nicht sowas hier machen? Ne. Aber wie? Was? Das check ich nicht. Das kapier ich nicht. Ach, man muss da einen Doppelpunkt dahinter machen, oder wie? So, so dachte ich mir das eigentlich jetzt. Ja. Da spar ich mir nämlich diesen ganzen Arc-Krempel. Ja, ok, nice. So, und jetzt starte ich das mehrfach. Ich copy paste das mal zum testen. Ja, das ist die T2. Ja. Punkt zioniert. Ok. Also, jetzt machen wir eine Schleife. Oh, wie sieht eine Vorloop aus? Ich weiß ja nicht mal, wie man eine publische Vorschleife macht. For range, range, range. Alles klar. Ok. For i in range. Das da. T1. T1 start. Und jetzt muss ich das in irgendeine Liste schreiben. Keine Ahnung. Threads. Ich hab keine Ahnung, ob das irgendwie Sinn ergibt. Und der Pythonic Way ist, was ich hier mache. Threads. Push. Add. Insert. Er pennt. Ja, meine Güte, Alter. Ich hätte fast alles durch gehabt. Ok. Und gibt es jetzt sowas wie threading weight auf eine Liste oder so? Threading weight. Python thread join list. Ja, auf die Idee wäre ich jetzt auch gekommen. Gibt es da nicht so, gibt es da nicht irgendwas fertiges? So alles in dieser Collection warten wir mal. Concurrent Futures. Was? Submit. Ah, boah, das ist also die Standard Library ist wirklich Sixhead. Da gibt es für alles 20 Varianten. Das Thread Pool Executor. Ok, das ist mir gerade zu high IQ. Wir machen jetzt einfach das gleiche noch mal. Aber jetzt kann ich so hier machen. Vor. In. Threads. Und dann kann ich sagen. E. Oh, guck mal, der erkennt, dass das ein Thread ist. Sixhead Time. Aha. Guck mal da. Funktioniert. Und was habt ihr eben gesagt? Soll ich jetzt List Com. Das kenne ich. Warum Threads und nicht S und I. Oh, weil ich keine Ahnung habe, was davon die Vorzüge sind und was besser und schlechter ist. Das erst mal ausprobieren muss. List Comprehension. X vor X in fruits, F, A in X. Massive. So muss das sein. Also sprich anstatt sowas. Wir machen mal die Kurzvariante von also. Nee Moment. Sagt mal gibt es gibt es nicht sowas wie Link, sowas wie Each oder so. Each nee sowas gibt es hier nicht. Gibt es. Weißen List. Ich. Das sowas. Okay, nee, ich glaube, ich lasse das einfach so. Aber das würde ich jetzt machen. S wie vor I in range 6. Das kann man. Das bringt mir doch hierfür gar nichts. Das bringt mir doch hierfür gar nichts. Hast du schon mal ein Replet ausprobiert? Weiß nicht, was das ist. Jetzt habe ich es gelöscht. Ich kann nur. Leute, das bleibt jetzt. Das bleibt jetzt so. Genug. Das reicht jetzt. Dann brauchst du die for each nicht? Moment, das geht. Wartet mal. Das geht. T join. T in. Ach ja. Ganz ehrlich Leute, da gefällt mir das untere aber besser. Da gefällt mir das untere aber besser als das obere. Kann man sich jetzt drüber streiten? Chat, was sagt ihr? Das da? Okay, wir machen Umfrage. Das interessiert mich jetzt. A oder B. Das oder das. Das oder das. Ob's, jetzt habe ich mich vercopy pastet. Okay Leute, das geht nicht. Ich kann. Okay, das hier ist A und das hier ist B. Also. Was findet ihr besser? A oder B? A oder B? A, B. Eine Minute Abstimmung. Umfrage beginnen. A oder B? 50, 50 ziemlich genau. Gleich ist der Paul vorbei. B? Ach so, ja, ja. Ich persönlich finde B auch schöner. Irgendwie finde ich das griffiger, aber wahrscheinlich ist das die Frage, wie viel Pausen man schon gemacht hat, ob man das schöner oder weniger schön findet. B. Ich kann aber, ich kann aber das Pro und Contra, also viel Unterschied gibt es ja nicht, aber ich kann es verstehen, wenn einer A mehr mag als B. Also, so will man das. Das erste als List-Completion schreiben ist Pain's Champ, oder? Das will man eher nicht. Also wir starten, okay, wir starten nur mal vier Threads, das sollte reichen. So. Ich bin mir immer noch unschlüssig, wie ich das jetzt gescheit mache. Ich muss ja das Ergebnis. Ich mache jetzt mal was ekliges Chat, weil ich nicht weiß, wie ich es besser machen soll. Ich weiß nicht, wie ich es besser machen soll. Das hier ist die Nummer und ich mache jetzt eine Liste mit vier, irgendwie keine Ahnung, Rates. Ihr könnt mir ja sagen, wie es besser geht. So, und das hier ist I. Fängt es auch bei Null an. So, und die Raid, die Raid, die kommt jetzt einfach in I. Raid. Warum geht das nicht? Unexpected Float? Hä? Ah, Moment. Hast du shadowed irgendwas? Warum shadowed das da irgendwas? Welches Outer Scope? Was will er von mir? Hä? Okay, keine Ahnung, ID. Das heißt jetzt einfach ID. Ah, das ist Build-In. Meine Güte. Keg W. Keg W. So. Und er sagte mir, es ist ein Float. Na, meinetwegen ist es halt ein Float, wenn es... Nee. Ja, was denn jetzt? Ach nee, Moment. Doch, hä? Du schreibst in eine externe... Ich weiß, ich weiß, aber wo ist das Problem? Wo ist denn das Problem? Unexpected Types. Warum? Moment, ich will ein Int. Int ist doch schon gut. Ich meine, das ist ein Index. Ach, das hier ist... Moment, das hier ist Unexpected, oder? Das hier ist Unexpected. Muss ich da F dahinter schreiben für ein Float oder muss ich 0,0 machen, dass das checkt? So? Ah, so besser. Okay, gut. Jetzt, jetzt, also... So, da schreibt es jetzt... Ich meine, mir fällt... Das ist wirklich eklig mit der globalen Liste, aber... Mir fällt gerade wirklich nichts anderes ein. So, und hier unten machen wir das jetzt folgendermaßen. Wir machen hier vor dem Join, wir machen eine Schleife. Vor E in Range 10, mir vollkommen egal. So, und jetzt Rind Ranges. Boah, das muss man doch schöner machen können. Wie rechne ich das jetzt alles zusammen? Gibt es sowas wie Zoom oder so? Ranges? Zoom? Nee. Zoom Ranges? Nee, geht nicht. Ach, Rates, nicht Ranges. So, und ob das jetzt... Hey! Wait a minute, wait a minute. Das Print muss weg. Threading? Sleep? Time? Sleep? Sleep? So, okay, und funktioniert das jetzt theoretisch? Leute, wir haben angeblich mehr Bandbreite, als meine Leitung überhaupt kann. So wirklich gut funktioniert es nicht, was ich hier gebastelt habe. Wo davon hast du diesen Trick? Kann es sein, dass du vergessen hast, durch die Anzahl der Threads zu teilen? Nee, ich will nicht durch die Anzahl der Threads teilen. Die Leitung soll ausgelastet sein. Die Threads können so viel machen, wie sie wollen. Ich glaube, ich weiß, warum das geht. Ich weiß, warum das nicht geht. Weil ich hier immer nur pro Sekunde reinschreibe und pro Sekunde ist halt viel zu lang. Da hat ein Thread mal viel gemacht, ein weniger. Nein, wo davon lässt er auch nicht kurzzeitig mehr Traffic zu? Das ist einfach miesgemessen, was ich da mache. Meine Einheiten sind falsch? Nee, meine Einheiten sind nicht falsch. Warum? Ah, meine Einheiten sind falsch. Weil es Raid ist. Und Raid ist, Moment, Moment, meine Einheiten sind tatsächlich falsch. Ich muss sowas hier machen. Bites to megabit. Ah, das ist doch, das ist gar nicht schlecht, Leute. Das ist ziemlich, das ist ziemlich gut. Das funktioniert. Zwar nicht so, nicht so nice, wie gedacht. Übrigens, das mit dem Join, das mit dem Join kann ich mir einfach mal komplett schenken. Das brauche ich nicht. Wir lassen es einfach 10 Sekunden laufen und wir schenken uns auch jeglichen, jeglichen Counter. Wofür das lieb? Naja, dass ich will nicht 100% CPU-Last verursachen. So. Ja, Funst. Du musst in der Raids-Liste den Wert wieder auf Null setzen, wenn ein Thread durch ist. Das ist richtig, aber die Threads sind nicht durch, weil die einen Terabyte runterladen. Aber du hast recht, das müsste ich. Aber bevor... Oh. Was ist jetzt? Ach so, da ist 10 Mal durchgelaufen. Okay. Warum beendet der sich nicht, wenn er 10 Mal durchgelaufen ist? Keck. Lass mal 5 Mal durchlaufen. Warum beendet er sich jetzt hier nicht? Weil noch Threads offen sind? Sollte er das nicht checken? Und einfach sagen hier und Tschüss, Goodbye? Cancel gibt es nicht, oder? Schalt um auf Demon Threads. Kann ich die abschießen? T1? Wie schießt man Threads ab? Das sagt man ja eigentlich, dass man Threads nicht abschießt, sondern eigentlich sagt man Threads sollen sich ordnungsgemäß beenden. Was? List Clear? Nee, das bringt doch gar nichts. Du meinst Threads Clear, aber davon hören die doch jetzt auch nicht auf. Ich warte doch gar nicht. Ich warte aktuell. Doch. Nee, warum sollte Threads Clear irgendwas bewirken? Also wenn das funktioniert, würde mich äußerst wundern. Ich warte doch überhaupt nicht explizit da drauf. Ich mach nur die Liste leer, die Threads laufen immer noch. Nee guck, es hängt immer noch, sag ich doch. Aber wenn ich die in Demon Modus versetze, dann laufen die wahrscheinlich weiter im Hintergrund, selbst wenn mein Python Programm weg ist. Nee? Machen sie nicht? Oder ich sag, was war das? Kill? Gibt's nicht, oder? Python Thread Kill. Das ist hochgradig eklig, was ich hier mache, aber... Man kann das nicht killen. Der Multiprocess Thread, das könnte ich mal, da könnte ich den Prozess abschießen. Das, das ersitzt... Nee, ich will nicht joinen, ich will, das soll einfach, das soll einfach abbrechen am Ende. Ich würde es eh nie so machen. Das ist jetzt nur, weil ich gucken wollte, ob es funktioniert. Aber es funktioniert von der Idee her. BW? BTOP? Nee. Linux Bandwidth Monitor. Alter, jetzt wird rumgespammt, äh. Nee, nee, nee, nee. Was war das? EFTOP? Nee, nee, nee, nee. Nload, Nload, Nload war nice. Will einfach mal wissen, ob der das dann auch richtig beendet. Nload? Alter, wie viel haben wir denn hier jetzt, Mann? Nee, wie hieß der Kram? Nload? BMON meinte ich. Ah, das haben wir nämlich auch installiert. So, also macht der denn jetzt hier was? Bandbreite pro Sekunde. Zeig mal her. Ja. Das Funst, 50 MB. Das hier, ok. Wenn ich es beende, ist es alles weg. Ok, was hat der Chat gesagt? Ich soll heißen Demon Threads verwenden. Zeig her. Import, Threading, Import, Sternchen. Set Demon, true, null W, ok. Oh, soll man das nicht mal verwenden? Ist es Set? Attribute? Äh. Äh. Keine Ahnung, true. Ah, ich hab vorher schon gestartet. So. Ah, jetzt beendet sich alles am Ende. Aber aus irgendwelchen Gründen ist er jetzt langsamer als vorher. Muss ich T1? Ah, so? Warum ist er jetzt langsamer als vorher? What the f... Ach, ich starte das gar nicht mehr. Ah, nee, jetzt passt es. Ok, nach 10 Mal beendet er sich. Ok, nice. So, schön ist nun wirklich was anderes. Aber es funktioniert. Also, wir lesen das alle 10 Sekunden aus. So, und jetzt, und jetzt können wir das hier natürlich nochmal ne ganze Ecke, ne ganze Ecke schöner machen. Und zwar, wir können uns hier drinnen theoretisch sogar das mit dem Elapsed, Elapsed sparen. Mal gucken, mal gucken wie hoch dann die CPU-Auslastung wird. Mal gucken. Ach nee, Moment, das mit dem Reset. Warte mal, nee, nee, nee, nee. Wir aktualisieren das jetzt jede, jede, jede 100 Millisekunden. Wow. Ja, die erste Messung vielleicht nicht stimmt, kann ich, kann ich verstehen. Jetzt ist es ziemlich am Limit, ne? Jetzt ist es, jetzt ist die Leitung eigentlich komplett, komplett ausgelastet, wenn ich das so richtig sehe. Oh ja, bam, 50 MB, 52 MB. Ja, ich mein, das müsste man wahrscheinlich, wenn man das wirklich genau messen will, schon, man könnte das sicherlich noch deutlich besser machen. So, aber jetzt gucken wir uns mal was anderes an. Was ist denn jetzt der Unterschied zwischen, was ist denn jetzt der Unterschied zwischen dem hier? Ok, Python Threads versus AsyncIO. Jetzt Five-Header-Time, Alter. Wow, das ist mir deutlich zu lang. Ich brauche Stackoverflow-Antwort für, für Noobs. Alter, was sind das alles für Riesendinger? Yeah, gut, das ist, das kommt mir jetzt zugute, weil ansonsten hätte ich hier garantiert irgendwelche Exceptions, weil ich versucht habe, auf das gleiche Objekt gleichermaßen zuzugreifen. Twitch geht, klar. Download ist jetzt erstmal nicht so wichtig, denke ich. Ich kriege auch meinen vollen Upload nicht voll, dadurch, dass ich noch, äh, Download nicht voll, ich uploade. Async allows concurrency within a single thread. This gives you as much more control of the task switching. Moment. Jetzt blicke ich nicht mehr durch. Es gibt Python Threads, die ineffizient sind. Dann gibt es quasi so eine Art JavaScript Event Loop mit, mit Async Await oder sowas. Und dann gibt es Multiprocessing, wo er dann aber wirklich die komplette Hardware ausnutzen kann. Das heißt, der Fork dann den, das heißt, der Fork dann den Mainprozess irgendwie achtmal und braucht achtmal so viel Speicher oder wie oder was, hä? Python Multiprocessing Thread. Ich sehe es schon, das ist Sixheadiger, als ich das gedacht habe. Was from Multiprocessing Import Pool? Pool 5 SP. What? Und warum kommt hier eins, vier, neun raus? Ach so, weil er, weil er das irgendwie zusammen rechnet oder? Ach, keine Ahnung. Was hat's, was hat's hier mit, mit Pool auf sich? Über den Pool kann deine Mainfunktion, kann deine Funktion den Return Wert an die, an den Mainprozess zurückliefern. Aha. Lass mal kurz überlegen, wie würde ich da meist mal Threads oder Multiprocess außen vor, wie würde ich das denn jetzt sagen, sagen wir mal in, in, sagen wir mal in.NET, wie würde ich das denn jetzt ordentlich machen? Muss ich mal kurz, mal kurz in mich gehen. Ich meine, so global Ding kann man machen, aber die schönste Variante wäre eigentlich, wenn ich eine Klasse hätte, die, die ein Threadsafe Property hat, wobei ich mich ja in Python anscheinend um Threadsafe, Safety nicht kümmern muss und das lese ich dann aus. Dann bräuchte ich nämlich so global, global Ding hier nicht. Ok, dann fang mal an, wie macht man denn eine ordentliche Klasse in Python? Gibt's Logs? Ich hab keinen Plassen, schimmer, ob es Logs gibt. Weil anderweitig oder aber, was auch funktionieren würde ist, ne, würde nicht, würde nicht funktionieren. Also Klasse, gibt's da kein Makro für? Python Klasse, Example, Example ist immer gut. Klasse, My Klasse, x gleich fünf. Inlet ist so was wie ein Constructor, das kenne ich noch. Das kann ich mir noch dran erinnern. Also Public Klasse, wir nennen das hier jetzt einfach mal Speed Test. Mir fällt grad nichts anderes ein. Speed Test, wir brauchen global, gibt es sowas wie Public? Nee, Public muss man nicht. Warte mal Leute, wie war das in Python? Man muss, man macht das hier da vor, wenn man will, dass es private ist, gell? Aber das ist nur quasi ein Hint, dass es private ist und nicht wirklich private. Global, ne. Also würde ich jetzt quasi sagen sowas wie hier Don't Load Raid. Heck, muss ich das weglassen, wenn ich nichts übergebe? Ne. Gibt es, ach Self, Self muss man da immer über. Aha, Self ist quasi sowas wie This. Ok, gibt es irgendeine Schreibweise für Public, Public Properties? Sollte man die irgendwie groß schreiben oder nicht, oder ist das egal? Was heißt denn Public Property? Klein? Private und Public Attributes. Ach Attributes heißt was da, ok. Das ist eine bescheuerte Seite, die echt, does not have, ja. Add Property, was zum, ah das ist quasi so eine Getter, das ist quasi eine Getterfunktion oder sowas, gell? Würde ich jetzt einfach mal raten, wenn man da Add Property oben dran setzt. Warum sich überhaupt die Mühe machen, wir machen einfach Public Variable und gut ist. Obei. Warum nicht? Warum nicht? Warum nicht? Wisst ihr was wir machen? Ich hab ne Idee. Also wir machen sowas wie hier Self, ne. Warum ist das jetzt undingst Reference? Self sein? Ne. Äh, pff, keine Ahnung. Moment, das kann ich direkt zuweisen, das nicht. Ach ansonsten ist es statisch. Moment, wenn ich sowas hier mache bedeutet das, das ist Static, also ich könnte jetzt quasi, ach so, ach so, das will ich ja gar nicht, ich will das so haben, also irgendwie. Rate. So, Underscore, was ist der Unterschied zwischen Underscore und Underscore? Underscore, Underscore. So, Self, Rate, Rate. So, und das wollen wir aber nicht returnen, sondern, da wollen wir jetzt das mitmachen. Self, Rate, Exzellent, wo ist das Problem jetzt? End of Statement Expected. Ach ne, ich blick, hä? Was ist denn jetzt das für? Was hat er denn jetzt für Schmerzen? Rate, Rate. Ne, die Klammern sind doch richtig so. Ne, die Klammer ist zu viel. Kacknub, Alter, die Klammer ist zu viel. Und jetzt? Rate, Rate. Ne, das schreibe ich gar nicht hier hin oder was, das würde ich nur hier machen? Ach so, das muss ich gar nicht da oben hinschreiben, das würde ich einfach hier festlegen oder, aha, MonkaS, Alter, da muss ich jetzt erstmal drauf kommen. Okay, wir nähern uns, wir nähern uns. So, und jetzt packe ich im Prinzip dieses ganze Ding da rein. So, die ID brauche ich nimmer, cool, das hier brauche ich nimmer, das hier brauche ich im Prinzip auch nimmer. Rate. So, Self, Dot, Rate. Was hat er denn jetzt für Schmerzen? Unresolved Reference Self. Ach, weil ich Self hier davor wieder übergeben muss oder was, aha. Okay, das ist in der Tat äußerst gewöhnungsbedürftig, muss ich sagen. Glaubst du, Getter, Syntax ist anders als das? Okay, werden wir jetzt ja gleich sehen. Comment, aber das kommentieren wir das mal aus. Denken wir mal, ob das funktioniert. Der kommt nicht so ganz klar hier, oder? Print. So, das sollte doch jetzt soweit funktionieren, was ich gemacht habe. Der updated jetzt die Rate. Okay, ähm, let, nein nicht let, also speedtest gleich new speedtest, so? Ne, äh, da sollte ich die URL auch hier übergeben. Oh, einfach so? Schau mal, NeoWim ausbricht, klar, ich hab früher nur Wim verwendet, ich hatte irgendwie 800 Zeilen Wimrc und 500 Plugins drin. Einfach so, okay. Speedtest, Rate, da kann ich das, also jetzt würde ich hier das starten. Das ist nicht so schön, das wäre deutlich sinnvoller, wenn ich die URL im Konstruktor übergebe, weil dafür ist er ja letztendlich da. Self. Okay, das ist für mich echt gewöhnungsbedürftig, diese Schreibweise. So, und hier kommt die URL weg. Kann man, kann man das hier oben auch annotaten irgendwie, dass ich jetzt sage, self drill? Ey, tatsächlich, cool. Load. Park. URL open. Self? Warum eigentlich self, warum nicht this? Da könnt ich mich viel einfacher dran gewöhnen. Okay, measure download speed megabit. Gut, es scheint zu funktionieren, es macht was. Du kannst auch this importieren. Wirklich? Geht das? This? Kannste das? Echt? Geht das? This? Ey, oder? Wie kann ich das, aber ich benenne das nicht um. Ach, das hier kann ich nennen, wie ich will. Aber ich nenne das nicht um, das ist ja dann absolut nicht der Pythonic Way. Ne, ne, ne, das lasse ich so. So, jetzt haben wir hier eine Klasse. So, und von der Theorie her sollte das jetzt ja so funktionieren, wenn ich das Ding starte, und wir machen jetzt einfach mal, wo ist meine Endlosschleife hier unten? Oder meine, nicht wirklich Endlosschleife, meine 100 Sekunden Schleife. So, und ich könnte jetzt nur mal zum testen, ob das funktioniert. Print. Speed test. Achso, ich muss erst noch ein Thread starten. Ja, Raid. So. Du, du, du, du, du. Comment, oh, ups. Comment. Also, jetzt müssen wir den Krempel ja mehrfach, mehrfach starten. Speed test. Jetzt brauchen wir eine Liste. Threads. Gleich, so. Ne, nicht. Ja, so ungefähr. So, Speed test. Jetzt kann ich das weglassen, jetzt kann ich theoretisch das direkt so aufrufen wahrscheinlich, denke ich mal. Hoffe ich, dass das so geht. Start. So, und jetzt. For. Threads. T, Raid. Und dann Sleep. Na, ob das jetzt funzt? Nope. Nope, was? Warum nicht? Wo ist das Problem jetzt? Warum funktioniert das jetzt nicht? Ah, ja, natürlich. Threads append. Speed test. Achso, ich kann das muss weg. Ja, klar. Ok, nice. Ok, also und jetzt das gleiche Spiel wieder. Also, das will ich ja eigentlich gar nicht so machen. Ich will ja eigentlich Print. Threads. Ne, Summen, Summen. Das macht mich fertig. Das es so globale Magic Funktionen gibt. Threads. Ne. Wait a minute. Das kann ich jetzt gar nicht summen. Wie kann ich ihm denn sagen, was er da jetzt, wie er die Summe genau machen soll? Ja, in Dotnet würde ich jetzt einfach sagen Select. Sowas wie Select, aber. Ne, aber der weiß doch gar nicht, der weiß doch gar nicht, dass er das Raid Property nehmen soll, in Summe. So? Ne, oder? Also, wenn das funktioniert, das kann doch nicht funktionieren. Ne, das hätte mich auch sehr gewundert, wenn das funktioniert. Threads. Also quasi. Da drinne. Threads. Ok, das ist wirklich gewöhnungsbedürftig. Ne, funktioniert, ja. Wow, aber viel zu viel zwischzeitlich. Das geht auch ohne eckige Klammern. Wirklich? Ah, Sixhead Time. Ohne ist Deprecated. Ja, was denn jetzt? Ich find's auch so im ersten Blick besser. Da muss man sich aber wirklich erstmal reindenken. Das ist auf jeden Fall ein bisschen gehirnverknoten. Ja, ok, aber das ist jetzt schon deutlich besser lesbar als der andere Krämpel, den ich vorher gebastelt hab. Mach mal die Sekunden hoch auf eine Sekunde Messzeit. Was ist jetzt? Ah ja, jetzt. Hat Vodafone wieder gewodafoned zwischenzeitlich. Guck mal, ob das immer so ist. Es braucht alles? Nö. Das hat eben einfach nicht gewollt. Ruckelt übrigens das Stream, wenn ich hier volle Pulle Download mache, weil mein kompletter Download ist fertig. Ja, ist voll leer. Oder je nachdem, wie man das sieht. Also, die komplette Leitung ist voll. Mein Downloadvolumen ist leer sozusagen. Wir können ja mal kurz gucken, ob das irgendwie ruckelt. Aha, hier hat er Frames getroppt. Droppt er Frames? Massive Drop? Aha! Leute, der droppt richtig krass die Frames, wenn ich das hier anschmeiße. Lull. Guck mal. Die Downloadtests sind keine so gute Idee. Aber da sieht man, die Leitung ist voll. Jetzt testen wir mal was. Wir trosseln mal die Bandbreite. Wondershaper oder so hieß das, glaube ich. Ist schon installiert. Wondershaper, mein Interface. Wondershaper, hallo. Wondershaper minus Interface Download. Das betrifft jetzt ja nur meine Linux-VM, also keine Sorge, das ist für den Stream jetzt erstmal egal. So, wir limitieren den Download auf 4000 auf 4 MBit. Gucken, ob das funktioniert. Ja. Ja. Es kommt schon so ungefähr hin. Ich würde jetzt auch nicht drauf tippen, dass das so 100% exakt ist. Aber im Großen und Ganzen. Ok, und jetzt machen wir mal ein Limit. Ich glaube, ich muss jetzt erstmal clearen das Ganze wieder, dass es funktioniert. Ne, hier. Jetzt gehen wir mal auf das Doppelte hoch. Ne, das Zehnfache hoch. Ich hab's geklärt. Sekunde runter. 40 haben wir jetzt, guck. 33, 37, 35. Also ich würde sagen, das funktioniert schon ganz ordentlich, ja. Man kann übrigens jetzt nicht so machen, weil man muss immer erst clearen zwischendurch. Ja. Wollen wir den Buffer größer machen? Wir können den Buffer auch größer machen. Was ist das? 8, 1, 2, 9? Die nächste größere. Macht keinen Unterschied. Jetzt aber auch sehr gewundert. Aber zu kleiner Buffer backt, glaube ich, 8. Das sollte das ziemlich, ja. Das, na wobei, geht eigentlich. Aber wenn ich das nochmal cleare, der geht nicht auf 400mbit hoch mit so einem Mini-Buffer. Ne, guck. Der hängt hier bei irgendwie sonst was, ja. Ne, ein zu großer Buffer ist jetzt hier in dem Fall auch nicht so sinnvoll, weil umso seltener aktualisiert der. Ich finde 4096 schon ganz passend. Aber jetzt haben wir den Multithreaded-Test. Ach ne, Moment. Ich sollte es ja noch mit threading... Ich wollte ja eigentlich gucken, was denn jetzt der unter... So kann man das doch lassen, oder? Das ist doch durchaus okay. Würde man das jetzt in eine eigene Datei verschieben als guter Pytonic-Way? Du kannst runden. Ich will gar nicht runden. Bei der Länge nicht. Ne. Das finde ich aber so ganz schick. Das kann man jetzt wenigstens ordentlich lesen. So, ich sollte multiprozess noch ausprobieren. Vorm multiprozess import process. Okay, also nicht thread, sondern process. Und jetzt sage ich process target. Also im Prinzip exakt das gleiche, nur anstatt thread, process. Und das war's jetzt? Demon muss ich wahrscheinlich weglassen. Ha, hast du so gedacht, Keg-Wade. Funktioniert net. Kann es sein, dass es jetzt nicht funktioniert, daraus etwas auszulesen? Der bekommt nie mit, wenn hier was Neues gesetzt wird. Guck mal, der macht volle Pulle Download. Aber hier erkennt er nie, dass die Rate sich geändert hat. Was ist der technische Unterschied? Naja, ich vermute mal, bei dem einen ist es quasi in einem Prozess mehrere Threads und beim anderen folgt er das und macht mehrere Threads, was dann mehr RAM braucht. Aber ich kann jetzt aus multiprozess kann ich nicht mehr die Variablen auslesen, aus meinem Mainprozess von den Child-Prozessen. Das ist wahrscheinlich auch der Grund, warum es zwei verschiedene Sachen gibt. Genau, deswegen. Das hat schon sein Sinn, dass es da zwei verschiedene Sachen gibt. In dem Fall muss es tatsächlich das hier sein. Habe ich hier noch Traffic Shaping on oder so? Nö, es ist einfach langsam. Ah nee, jetzt geht es wieder hoch. Sollte vielleicht die Eins anstelle Spieltests ins Liste? Nö. Sollte nicht. Deswegen sollte es nicht Svets heißen, sondern irgendwie Speedtests. Ein Tupel in die Liste, man braucht ja auch Raid. Ja, Raid habe ich ja hier. Raid habe ich doch hier drüber. Was aber mit multiprozess nicht funktioniert, was hätte hier für Schmerzen? Taipo, überhaupt kein Taipo, lügt nicht. Ok, das funzt, ich bin begeistert. Ich muss aber einen Speed Limit machen, weil ansonsten... Spack da rum. Ja, 40mbit Speed Limit. Ich will nicht Join Call, nee. Der soll die automatisch beenden am Ende des Programms. Vollkommen in Ordnung. Scheiß auf Join. Die Dinger werden eh nicht fertig. Die laden einen Terabyte runter, die werden nicht so schnell fertig. Also nicht innerhalb von 2 Sekunden. So und von der Idee her ist es jetzt so, ich könnte das 5 Sekunden laufen lassen oder sagen wir mal, vielleicht nicht mal 5 Sekunden. Kann man 0.5 sleepen? Geht das? Hey. Ja, bringt ja nichts. Ich muss schon länger laufen lassen, dass das alles Rats überhaupt nennenswert was machen. Multiprocess Shared Memory. Oh, jetzt wird's. Oh, 5 Head Time. Shared Memory Size. Ok, das wird jetzt aber richtig Raw, oder? Jetzt wird's aber richtig Raw. Shared Memory Block. Bäh. Eigentlich fehlt ja noch die Main Methode, das stimmt. Das geht doch irgendwie in Pyres irgendwie so if Main oder irgendwie so, ne? Also ganz komisches Zeug. Ah guck mal, die können das schon. Ok, nice. Kann ich das jetzt einfach da drunter kopieren? Lul. Ah. Sehr schön, sehr schön. Ok, das gefällt mir. So, was kann man jetzt, was kann man denn sonst noch machen? Also die Speedtest Geschichte Multithreaded kann man sagen ist in Ordnung. Huf eine Methode Main auf und pack da alles rein. Ist das der Pythonische Way? So zu ach, oh man, ich krieg die Klammer nicht weg. Ich werde nie Klammern raus bekommen. Ja. Macht man, machen die coolen Leute das so, ja? Ok. Die coolen Leute, na das ist in jeder Sprache so, oder? Das erste was entsteht für jede x beliebige Sprache ist eine Library, die um Sprachen Sachen work aroundet. Überall. So, also das funktioniert mit dem Download Speed. Ich bin begeistert, wir können mehrere Threads verwenden. So, die eigentliche Sache, die ich mir jetzt aber noch angucken wollte, was genau ist hier der Unterschied? Async. Und was ist der Unterschied zwischen Concurrent Futures und Async.io? Gibt es da überhaupt einen? Ach komm, hier gibt es sogar ein Beispiel. Ok, das ist richtig Next Level Shit. Das hier ist quasi ein Await, oder? Seh ich das richtig? Ok, ne, das ist mir, das sieht aber um ein vielfaches komplizierter aus als das andere. Also, das hier, muss ich ehrlich sagen, das hier macht einen ziemlich einfachen Eindruck. Das ist jetzt nicht so viel anderes, wie ein Task starten in C Sharp. Wobei ein Task eigentlich Awaitable ist in C Sharp. Ne, das ist eher wie ein Thread starten direkt. Schreib mal zwischen den zwei Vorschleifen ein Sleep. Du meinst, dass er am Anfang nicht 0-0 macht? 10 ist vielleicht jetzt ein bisschen viel gewesen. 2. Lass mal weg, wozu? Also was machen hier? Async, Def, Main, Await, Async.io, Sleep. Task. Ok, Task 1, Async.io, Create Task, After. Wir probieren das jetzt einfach mal aus. Also, anstatt Threading, Async.io. Und jetzt, was war das? Async.io, Create Task. So, das heißt im Endeffekt, anstatt den Kram, sage ich ihm, ne, mach ich nicht. Ach ne, hier füll ich das direkt drin aus? Oder wie, oder was? Ne. Ah, das muss eine Async Function sein. Ok. Alles klar. Da bin ich jetzt ja mal gespannt, ob das funzt. So. Jetzt einfach so? Ne. Bam. Was never awaited. Ja, ich will ja auch, dass du startest. Ich will nicht, dass es Await. Ich will das nicht Awaiten. Der soll das einfach starten. Das funktioniert glaube ich nicht so, wie ich mir das vorstelle, oder? Ich muss, ich muss den Krampel irgendwann Awaiten. Was, Async.io Run? Ah. Ne. Ah, ich hab das jetzt erpennt. Ne, jetzt hab ich das erpennt drinne. Hm. Muss ich hier die Klammern wegmachen? Ne. Macht das, macht das überhaupt jetzt Async technisch was? Ne, oder? Das hängt hier jetzt einfach. Ich muss Main auch Async starten? What? Jetzt. So? Und dann? So? Ok, das ist, das ist sehr feifertig. Ne. Seriously, das ist mir zu doof. Ich will nicht auf alle warten. Da ist mir, ne. Wisst ihr was? Scheiß drauf. Ich will da nichts Awaiten. Das soll einfach laufen und dann abgeschossen werden. Wenn es die scharpe hätte ich ihnen den Cancellation Token mitgegeben, was das abbricht. Und ich hätte gesagt, das Cancellation Token Throat einfachen Fehler. Ne, aber ich glaube, das ist mir so deutlich lieber. Ne, also, warum sollte ich kompliziert machen, wenn es noch so funktioniert? Ne, also damit bin ich, damit bin ich jetzt eigentlich ganz zufrieden. So. Was können wir da jetzt, was können wir da jetzt noch dran basteln? Also. Wir haben das mit Multithreaded ausprobiert. Ich hab sogar paar Type Annotations ausprobiert. Also ich würde sagen, heute habe ich einiges, einiges gelernt, was etwas moderneres Python Zeug angeht. Ich meine, ich hab da nicht wirklich Ahnung von gehabt. Ich hab die ein oder anderen kleinen Sachen damit schon gemacht, aber immer sehr unregelmäßig und nie wirklich was Großes. Das ist jetzt ja auch nichts Großes, aber zumindest mal sowas wie Multithreading habe ich noch nie gemacht. Ich gucke mir heute Abend den Webcast an. Python Async.io und lasst mir das mal erklären von irgendwie einem, der Ahnung hat. So. Ich glaube, ich muss jetzt mal was essen. Ich habe übelst Hunger. Überlegt gerade noch, können wir noch irgendwie. Das mit dem Performance-Counter ist vollkommen in Ordnung. Du kannst sagen, dass er nichts doppelt printen soll. Der printet doch nichts doppelt. Der printet, der printet immer nur eine Zeile, aber der printet hier halt alle 100 Millisekunden. Deswegen ist es besser, wenn ich auf eine Sekunde stelle. Ach nee, das ist, das ist. Ich weiß, dass es Speedtest-DLI gibt. Das war nicht Sinn und Zweck der Sache. Das ist, das weiß ich nicht. Könnte ich, easy, Speedtest-DLI. Ich könnte ja auch einfach einen Webcast machen und die Zeit stoppen oder so. Wobei das nicht ein Aria-Download-Manager Zeit stoppen oder so. Das wäre deutlich einfacher. Du könntest eine Que verwenden anstatt eine globale Liste. Wie soll denn das funktionieren? Wie soll mir eine Que helfen in dem Fall? Ich meine, die Klasse sagt, welche Downloadrate sie aktuell gemessen hat in ihrem jeweiligen Thread. Und das Ganze lese ich dann hier aus. Da bringt mir eine Que doch nichts. Weil ich will ja immer wieder die gleichen rauslesen. Ich will ja nicht etwa einmal auslesen und dann ist wieder gut. Das ist aber schwierig, sowas mit einer Que zu machen, weil dann hast du beispielsweise in der Que acht Werte stehen und dann müsstest du wissen, du darfst nur vier maximal auf einmal lesen und müsstest sie dann zusammenrechnen. Und was ist, wenn eins Thread hängt und der eine dann zweimal reingeschrieben hat? Ne, ich glaube mit einer Que macht es in dem Fall einfach noch komplizierter. Zumal, wenn ich es richtig verstanden habe, dadurch, dass wir Python Threads verwenden, muss ich mich ja überhaupt nicht um Locking oder sonst was kümmern. Das geht einfach. It just works. Würde Apple wahrscheinlich jetzt sagen. Es hat vielleicht nicht die mega Performance, wie das woanders wäre, aber für den Fall reicht es, Digga, aus. Ich finde das eigentlich ganz nice, so muss ich ehrlich sagen. Und es ist für sich genommen auch wirklich gut lesbar. Also man versteht alles, was passiert. Da kann sich C++ und sonstige Sachen echt noch eine Scheibe von abschneiden. In C++ hätte ich jetzt hier schon 50 Klammern mit sonstigen Dingern dazumachen müssen, dass das gültiges C++ ist und dann kommt eine Fehlermeldung, dass angeblich in Zeile 1 ein Schreibfehler ist, obwohl der eigentliche Fehler hier unten ist, weil ich falsche Zeichen habe. In C++ habe ich hier ein Semikolon vergessen und er sagt mir irgendwie, hier oben ist falsch. Das ist aber wirklich nicht schlecht, das kann man ganz gut lesen. Was ist der Sinn von AddProperty? Dumme Frage, das kann ich doch einfach wegmachen, das funktioniert immer noch. Warum funktioniert das jetzt nicht? Ah, dann müsste ich Raid so machen. Das finde ich gut, finde ich nice, dass es geht. Das finde ich gut. Das ist ein Getter. In C sharp wäre das, was du in einem Getter schreibst. Das finde ich gut, das ist ein schöner Sonntag, gefällt mir. Die wichtigste Frage ist, wie gut Cobolinterop funktioniert. Wahrscheinlich, wenn du deine Coboldinger mit C Interfaces exportieren kannst, funktioniert es wunderbar. Wie gut das in Cobol geht, weiß ich nicht. Und wenn es nicht geht, dann ist der Interop für ein Arsch. Ich habe aber von niemand gehört, der Cobol-Python-Interop. War natürlich klar. Ich glaube, Cobolinterop, das wollen wir uns jetzt an der Stelle eher nicht geben. Ja, zum Üben war das doch ganz nice. Leute, ich gehe jetzt was essen. Wir sehen uns im nächsten Stream. Macht es gut, bis dann. CO!", "segments": [{"id": 1, "start": 30.0, "end": 56.42, "text": "Samsung Galaxy Note 20 Pro"}, {"id": 2, "start": 116.42, "end": 145.18, "text": "So, da bin ich!"}, {"id": 3, "start": 146.82, "end": 149.82, "text": "MMO Kreisel-Krein-Sucht gestillt für heute."}, {"id": 4, "start": 152.82, "end": 159.82, "text": "Jetzt können wir noch ein bisschen, äh, High-IQ, Five Head Chat, den High-IQ ausspielen lassen."}, {"id": 5, "start": 163.82, "end": 164.82, "text": "Seh, Staub!"}, {"id": 6, "start": 172.22, "end": 174.82, "text": "Schluss mit Klammern und Silvio-Lauten, genau."}, {"id": 7, "start": 174.82, "end": 176.82, "text": "Brauchen wir nicht."}, {"id": 8, "start": 177.82, "end": 179.82, "text": "Also, ein bisschen kann ich das, ja."}, {"id": 9, "start": 180.82, "end": 182.82, "text": "Also, komplett planlos bin ich nicht."}, {"id": 10, "start": 183.82, "end": 185.82, "text": "Aber mir fehlt halt so die Übung."}, {"id": 11, "start": 186.82, "end": 193.82, "text": "Und ich dachte mir so in letzter Zeit öfters, wäre es nicht praktisch, ein bisschen besser Pies entstellt zu können."}, {"id": 12, "start": 193.82, "end": 203.82, "text": "Einfach, wenn Bash zu ätzend wird und sich irgendwie ein.NET GO, was auch immer Programm jetzt nicht gerade anbietet für irgendwie was kleines."}, {"id": 13, "start": 204.82, "end": 209.82, "text": "Also, ich glaube, das kann auf jeden Fall nichts schaden."}, {"id": 14, "start": 209.82, "end": 211.82, "text": "Also, ich glaube, das kann nichts schaden."}, {"id": 15, "start": 212.82, "end": 214.82, "text": "Bei der Gelegenheit, ich mach mal kurz die VM an."}, {"id": 16, "start": 215.82, "end": 217.82, "text": "Ich mach einmal Updates, installier Pi."}, {"id": 17, "start": 218.82, "end": 220.82, "text": "Wie heißt das Ding?"}, {"id": 18, "start": 221.82, "end": 223.82, "text": "Community Edition."}, {"id": 19, "start": 224.82, "end": 226.82, "text": "PyCharm, jetzt hab ich's."}, {"id": 20, "start": 227.82, "end": 229.82, "text": "Kann ich das hier abbrechen, VMWare, please?"}, {"id": 21, "start": 229.82, "end": 245.82, "text": "Chat, weil ihr seid."}, {"id": 22, "start": 246.82, "end": 248.82, "text": "Weil ihr seid, Sekunde."}, {"id": 23, "start": 249.82, "end": 251.82, "text": "Tolle Webladung für heute."}, {"id": 24, "start": 252.82, "end": 254.82, "text": "Gleich 3.11 Beta."}, {"id": 25, "start": 254.82, "end": 262.82, "text": "Ja, wenn du mir sagst, was es für gescheite Package Manager gibt, dass man sich die Preview Version installieren kann."}, {"id": 26, "start": 263.82, "end": 265.82, "text": "So, volle Webladung für heute."}, {"id": 27, "start": 266.82, "end": 272.82, "text": "Ihr habt 5 Sekunden, ihr habt 10 Sekunden Zeit, also in euch aufzunehmen, weil dann schalten wir wieder weg."}, {"id": 28, "start": 272.82, "end": 274.82, "text": "Okay."}, {"id": 29, "start": 275.82, "end": 277.82, "text": "Genug, next."}, {"id": 30, "start": 279.82, "end": 281.82, "text": "So, also, ich mach erst mal kurz ein Update."}, {"id": 31, "start": 281.82, "end": 283.82, "text": "1, 2, 3, 4, 5, 6."}, {"id": 32, "start": 283.82, "end": 285.82, "text": "Massive FileFile Passwort."}, {"id": 33, "start": 285.82, "end": 286.82, "text": "Oh."}, {"id": 34, "start": 286.82, "end": 288.82, "text": "Was ist das denn?"}, {"id": 35, "start": 288.82, "end": 290.82, "text": "Was ist das denn?"}, {"id": 36, "start": 290.82, "end": 292.82, "text": "Was ist das denn?"}, {"id": 37, "start": 292.82, "end": 294.82, "text": "Was ist das denn?"}, {"id": 38, "start": 294.82, "end": 296.82, "text": "Was ist das denn?"}, {"id": 39, "start": 296.82, "end": 298.82, "text": "Was ist das denn?"}, {"id": 40, "start": 298.82, "end": 300.82, "text": "Was ist das denn?"}, {"id": 41, "start": 300.82, "end": 302.82, "text": "Massive FileFile Passwort."}, {"id": 42, "start": 306.82, "end": 308.82, "text": "Also ich..."}, {"id": 43, "start": 308.82, "end": 310.82, "text": "Hab ich das hier installiert?"}, {"id": 44, "start": 310.82, "end": 312.82, "text": "Nee."}, {"id": 45, "start": 312.82, "end": 314.82, "text": "Package Manager, der ist eigentlich ganz gut zu installieren von so Zeug."}, {"id": 46, "start": 316.82, "end": 318.82, "text": "Alle switchen von Piesen auf Go."}, {"id": 47, "start": 318.82, "end": 320.82, "text": "Nee, überhaupt nicht."}, {"id": 48, "start": 320.82, "end": 322.82, "text": "Das sind 2 Sprachen."}, {"id": 49, "start": 322.82, "end": 324.82, "text": "Die haben vielleicht..."}, {"id": 50, "start": 324.82, "end": 326.82, "text": "Mehr kann ich nicht sagen."}, {"id": 51, "start": 326.82, "end": 328.82, "text": "Überschneidungen, weil das stimmt nicht."}, {"id": 52, "start": 328.82, "end": 336.02, "text": "Überschneidung in der Fan-Gruppe, also es gibt bestimmt viele Leute die Paisten mögen"}, {"id": 53, "start": 336.02, "end": 342.14, "text": "die auch go mögen und umgedreht, aber ansonsten ist das wirklich was wo ich sagen würde das"}, {"id": 54, "start": 342.14, "end": 345.58, "text": "macht sich nicht großartig Konkurrenz?"}, {"id": 55, "start": 345.58, "end": 353.22, "text": "Ich mein du kannst ja eh prinzipiell alles in allem machen, mehr oder weniger gut."}, {"id": 56, "start": 353.22, "end": 358.7, "text": "Du kannst auch theoretisch alles in C++ machen, wenn du es erträgst oder dass du"}, {"id": 57, "start": 358.7, "end": 363.22, "text": "selbstwortbegehst oder so aber das theoretisch möglich ist das du kannst auch mehr oder"}, {"id": 58, "start": 363.22, "end": 367.62, "text": "weniger fast alles in Javascript machen oder in Rust oder ansonsten das einzige was sich"}, {"id": 59, "start": 367.62, "end": 372.66, "text": "manchmal davon abhält ist halt wenn spezielle Libraries nicht gibt oder je nachdem wenn"}, {"id": 60, "start": 372.66, "end": 378.14, "text": "es halt was ganz Low-Leveliges sein soll also du wirst wahrscheinlich keinen Boot Manager"}, {"id": 61, "start": 378.14, "end": 386.5, "text": "in Javascript programmieren wobei selbst das theoretisch gehen würde du brauchst in jedem"}, {"id": 62, "start": 386.5, "end": 391.12, "text": "Fall ein paar Zeilen Assembler, das du auf die richtigen Adresse springen kannst und"}, {"id": 63, "start": 391.12, "end": 395.48, "text": "wenn du es dann dort schaffst irgendwie einen Javascript Interpreter zu starten oder was"}, {"id": 64, "start": 395.48, "end": 399.32, "text": "auch immer, theoretisch wird das bestimmt gehen aber ich glaube nicht das man das machen"}, {"id": 65, "start": 399.32, "end": 402.32, "text": "will."}, {"id": 66, "start": 402.32, "end": 413.4, "text": "DrBronoopsXx excellents subscribtion overlieh danke für den Zap parallel downloads ja"}, {"id": 67, "start": 413.4, "end": 418.0, "text": "Das ist eine gute Idee, aber das ist auch so schnell im Vergleich zu dem ganzen anderen"}, {"id": 68, "start": 418.0, "end": 419.0, "text": "Krempel."}, {"id": 69, "start": 419.0, "end": 435.04, "text": "Was haben wir denn hier noch offen?"}, {"id": 70, "start": 435.04, "end": 441.16, "text": "Ah, nee kein C++ heute, please Leute, ich muss weg, ich muss los."}, {"id": 71, "start": 441.16, "end": 446.6, "text": "Haben wir nicht sogar noch irgendwo den Pruder muss los Typ?"}, {"id": 72, "start": 446.6, "end": 454.12, "text": "Tatsächlich, das verwende ich nie, total outdated Meme, warum habe ich das hier überhaupt noch"}, {"id": 73, "start": 454.12, "end": 455.12, "text": "drinne?"}, {"id": 74, "start": 455.12, "end": 460.12, "text": "Pruder muss los, das ist komplett, das habe ich noch nie verwendet."}, {"id": 75, "start": 460.12, "end": 466.08, "text": "Seit, also doch, aber seit 2 Jahren nicht mehr oder so, noch länger."}, {"id": 76, "start": 466.08, "end": 470.96, "text": "Weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg, weg,"}, {"id": 77, "start": 470.96, "end": 478.84, "text": "weg, jawoll, zack, nochmal Update, ich mache jetzt, ich mache jetzt alle mal kurz die Update"}, {"id": 78, "start": 478.84, "end": 481.72, "text": "und dann starten wir neu und dann können wir uns das Ganze angucken."}, {"id": 79, "start": 481.72, "end": 484.28, "text": "Wie?"}, {"id": 80, "start": 484.28, "end": 493.36, "text": "nichts, nichts beim Updaten, also den Krempel können wir auf jeden Fall alle schon mal entfernen."}, {"id": 81, "start": 493.36, "end": 505.28, "text": "ne 3 1 keck wait alter so installieren wir das noch und dann machen wir reboot und dann"}, {"id": 82, "start": 505.28, "end": 519.56, "text": "gucken wir uns das mal an toolbox updates toolbox hat keine updates hat meine toolbox"}, {"id": 83, "start": 519.56, "end": 529.48, "text": "für es aktuell update update so pie charm community ich meine ich könnte ja"}, {"id": 84, "start": 529.48, "end": 533.64, "text": "professionell installieren weil ich habe eine all all desktop license"}, {"id": 85, "start": 533.64, "end": 544.2, "text": "ja immer schon kanalpunkte ausgeben umschlag umfrage vorgeschlagen minus 5000 beste umfrage"}, {"id": 86, "start": 544.2, "end": 558.08, "text": "ja also ich glaube die leute voten für dein voten in deinem sinne ja ja war im browser mit"}, {"id": 87, "start": 558.08, "end": 569.12, "text": "webgl das das klingt mir jetzt irgendwie nach nicht der besten idee desktop app ja du willst"}, {"id": 88, "start": 569.12, "end": 576.44, "text": "auch einen browser haben denke ich oder oder war das nicht sinn und zweck der sache was"}, {"id": 89, "start": 576.44, "end": 583.6, "text": "pipe nf die pippen mache ich chat ihr müsst mir ich habe da keine ahnung von was ist was ist"}, {"id": 90, "start": 583.6, "end": 596.8, "text": "pippen heißen pippen sacred marriage of pippfile pipp und virtual nf das nimmt ja fast schon"}, {"id": 91, "start": 596.8, "end": 601.88, "text": "auf ausmaße an wie bei irgendwelchen javascript libraries wurde keine ahnung mehr hast was"}, {"id": 92, "start": 601.88, "end": 613.84, "text": "alles brauchst was ist das development workflow for humans aber das andere nicht oder wie"}, {"id": 93, "start": 613.84, "end": 628.24, "text": "pipe nf tool aims best of packages und warum genau brauche ich das jetzt also was ist der sinn"}, {"id": 94, "start": 634.24, "end": 639.84, "text": "ok dass ich behalte ich behalte das mal im hinterkopf aber jetzt aber jetzt rebooten wir"}, {"id": 95, "start": 639.84, "end": 651.96, "text": "erst mal war er fertig mit installieren ich hoffe mal ich werde erst mal nichts mit pipp"}, {"id": 96, "start": 651.96, "end": 657.64, "text": "installieren ich werde erst mal standard library machen oder ist es web request zu machen in der"}, {"id": 97, "start": 657.64, "end": 662.32, "text": "peisen standard library immer noch so pence champ wie früher das geht auch bestimmt mittlerweile"}, {"id": 98, "start": 662.32, "end": 676.92, "text": "besser das ging im falschen fenster auf request get und auf geht's jawoll ist es standard library"}, {"id": 99, "start": 676.92, "end": 685.44, "text": "wie gesagt will start library für ein high charm das sind wir du hast wie bei npm logfiles ich"}, {"id": 100, "start": 685.44, "end": 688.4, "text": "weiß jetzt nicht ob ich das jetzt gut oder schlecht finden soll ehrlich gesagt dass man"}, {"id": 101, "start": 688.4, "end": 701.32, "text": "npm nachgebaut hat so auf geht's was haben wir denn für eine version installiert version 3 10.5 ok"}, {"id": 102, "start": 701.32, "end": 724.48, "text": "pleading edge version komm mal hier 26 heute release date heute danke für die ganzen subs"}, {"id": 103, "start": 724.48, "end": 734.36, "text": "leute ich habe mir die hälfte vergessen maxilbermann mehr selbst subscription hier schon neun monate so was ist neu in version 11 3.11 ok"}, {"id": 104, "start": 734.36, "end": 744.04, "text": "3.11 ist 6 es ist 10 bis 60 mal schneller denn bei wisst ihr was ich auch nicht verstehe was"}, {"id": 105, "start": 744.04, "end": 751.08, "text": "ist denn der unterschied zwischen sieb heißen peipai und und was es da nicht alles gibt das ist mir"}, {"id": 106, "start": 751.08, "end": 763.12, "text": "alles zu als als nichts heißen main ist es mir alles zu 6 hat sieb heißen kompiliert zu 10 ne das"}, {"id": 107, "start": 763.12, "end": 778.92, "text": "stimmt nicht oder sieb heißen ist die standard in der breiter implementierung in c aber was ist"}, {"id": 108, "start": 778.92, "end": 788.12, "text": "der unterschied zwischen peipai und sieb ich habe kein schimmer ok exception groups variating"}, {"id": 109, "start": 788.12, "end": 793.68, "text": "generics moment moment in piste gibt es generics was ist der sinn davon das ding ist dynamisch"}, {"id": 110, "start": 793.68, "end": 801.6, "text": "da brauchst du keine generics das ist das ist generic per design ok wahrscheinlich bin ich"}, {"id": 111, "start": 801.6, "end": 820.84, "text": "einfach zu low IQ dafür das zu verstehen typed dick dick ok nach dick dick required self type ok"}, {"id": 112, "start": 820.84, "end": 835.64, "text": "ich habe keinen platzen schimmer was da überhaupt sich getan hat in drei punkten gibt sogar ein"}, {"id": 113, "start": 835.64, "end": 853.04, "text": "int wait a minute was ist das seit wann schreibt man in pisen irgendwelche types type dictionary"}, {"id": 114, "start": 853.04, "end": 869.04, "text": "ist das so was wie javascript u int 8 array oder sowas return self ich sehe schon ich bin"}, {"id": 115, "start": 869.04, "end": 878.88, "text": "hoffnungslos outdated ich bin hoffnungslos outdated mit meinem pisen game genau aber"}, {"id": 116, "start": 878.88, "end": 888.0, "text": "komplett data class transforms ich dachte immer ein vorteil davon sollte dass das gut lesbar"}, {"id": 117, "start": 888.0, "end": 895.28, "text": "sein sein soll kann ich jetzt drüber kann ich jetzt über streiten ob das gut lesbar ist"}, {"id": 118, "start": 895.28, "end": 909.52, "text": "ok alles klar 6 hat time was ist ein guter pisen verse version manager was ist quasi das"}, {"id": 119, "start": 909.52, "end": 926.56, "text": "rust ab in pisen oder das oder das rbn von pisen also wie kann ich wie kann ich neue"}, {"id": 120, "start": 926.56, "end": 931.72, "text": "versionen installieren ohne mir mein system zu zerschießen oder ist das das was eben"}, {"id": 121, "start": 931.72, "end": 954.4, "text": "jemand gepostet hat das hier was konder ich habe chat ich habe kein nee das was anderes"}, {"id": 122, "start": 954.4, "end": 967.0, "text": "das was anderes monka es alter ich blicke da überhaupt nicht durch also bei ruby gab"}, {"id": 123, "start": 967.0, "end": 973.8, "text": "es rbn das der rbn gemacht konnte den ruby interpreter deiner wahl installieren poetry"}, {"id": 124, "start": 973.8, "end": 980.0, "text": "ich tippe das einfach nur ein weil ihr das sagt nicht dass ich irgendwie ahnung davon"}, {"id": 125, "start": 980.0, "end": 990.68, "text": "hätte man könnte das mit dem container machen ja das würde würde funktionieren was ist"}, {"id": 126, "start": 990.68, "end": 1004.64, "text": "das packaging dependency manager nee das ist nichts mit ich würde sagen wir bleiben"}, {"id": 127, "start": 1004.64, "end": 1011.56, "text": "einfach bei dem der vor installiert ist ich weiß für meine zweck ist das doch eh erst"}, {"id": 128, "start": 1011.56, "end": 1030.28, "text": "mal egal erst mal den shell script ausführen ok vias code def container habe ich noch nie"}, {"id": 129, "start": 1030.28, "end": 1044.4, "text": "verwendet was ist das developing inside container six hat time also haben wir alles installiert"}, {"id": 130, "start": 1044.4, "end": 1055.56, "text": "ja ja ok lelux habe ich habe ich alles installiert ich habe auch dockerberechtigung remote developer"}, {"id": 131, "start": 1055.56, "end": 1060.28, "text": "extension pack muss ich installieren aber das ist vias code ich will vias code nicht"}, {"id": 132, "start": 1060.28, "end": 1067.44, "text": "verwenden ich habe keine ahnung was ich will ich wollte eigentlich nur die neust die allerneuste"}, {"id": 133, "start": 1067.44, "end": 1081.92, "text": "python beta version ausprobieren ich will dann vias code gar nicht verwenden achso ok"}, {"id": 134, "start": 1081.92, "end": 1090.44, "text": "das ist tatsächlich easy warte mal das probieren wir jetzt mal kurz aus ich mein jetzt habe"}, {"id": 135, "start": 1090.44, "end": 1102.76, "text": "ich das ganze z plus plus zeug hier offener wartet mal ein eigener ordner ja ich truste"}, {"id": 136, "start": 1102.76, "end": 1107.8, "text": "komplett so was muss ich installieren ich habe ich habe schon docker extensions installiert"}, {"id": 137, "start": 1107.8, "end": 1124.0, "text": "hier remote remote ok was muss ich installieren die jetzt jetzt jetzt finde ich nicht wo steht"}, {"id": 138, "start": 1124.0, "end": 1132.56, "text": "was ich installieren muss hier den krempel da remote development muss ich installieren"}, {"id": 139, "start": 1132.56, "end": 1138.88, "text": "webpack webpack habe ich immer in großen großen bogen drum gemacht remote development soll"}, {"id": 140, "start": 1138.88, "end": 1160.84, "text": "ich installieren alles klar ok so jetzt wird es jetzt wird es jetzt wird es gleich richtig"}, {"id": 141, "start": 1160.84, "end": 1170.52, "text": "zum einstieg mal advance hier restart vias code mache ich sofort so mark dann ja ja ja"}, {"id": 142, "start": 1170.52, "end": 1178.2, "text": "dann so und wie geht es jetzt weiter quick try development container the easiest way"}, {"id": 143, "start": 1178.2, "end": 1193.08, "text": "to get started the containers also sprich einfach einfach container oder was nee ok es"}, {"id": 144, "start": 1193.08, "end": 1208.92, "text": "remote containers docker ist installiert was ist das was ist das für ein massive ja ja"}, {"id": 145, "start": 1208.92, "end": 1216.52, "text": "habe ich alles moment das ist wieder was anderes habe ich das habe ich das noch nicht installiert"}, {"id": 146, "start": 1216.52, "end": 1230.16, "text": "jetzt ich habe alles installiert nee remote content doch doch tatsächlich jetzt schon"}, {"id": 147, "start": 1230.16, "end": 1234.2, "text": "bloatet ja wir brauchen erst mal docker dass wir passen soll ich machen können was restart"}, {"id": 148, "start": 1234.2, "end": 1242.64, "text": "schon wieder ok was mache ich jetzt sagt es mir chat wie wie funktioniert das hier check"}, {"id": 149, "start": 1242.64, "end": 1252.44, "text": "installation open folder in container attach running container was zum hier try a development"}, {"id": 150, "start": 1252.44, "end": 1261.76, "text": "container sample ok ok was auch immer try a try a development container example komm"}, {"id": 151, "start": 1261.76, "end": 1282.24, "text": "mal da gibt es sogar postchamp der lädt jetzt wahrscheinlich gerade runter oder ja warum"}, {"id": 152, "start": 1282.24, "end": 1309.92, "text": "installiert der npm what is happening bloatet erst mal die festplatte voll erst mal festplatte"}, {"id": 153, "start": 1309.92, "end": 1316.44, "text": "voll geblutet ja ich warte es auch nur weil der chat das geschrieben hat und wir wissen"}, {"id": 154, "start": 1316.44, "end": 1320.76, "text": "ja prinzipiell der chat hat mittlerweile ein IQ level erreicht da kannst du eigentlich"}, {"id": 155, "start": 1320.76, "end": 1341.92, "text": "nichts mehr dagegen sagen was macht das ding monka es ok press start es ist eine flask"}, {"id": 156, "start": 1341.92, "end": 1369.8, "text": "ich will keine flask app ja"}, {"id": 157, "start": 1369.8, "end": 1374.24, "text": "ich hatte ich eigentlich vor aber der chat mein visual studio code developer container"}, {"id": 158, "start": 1374.24, "end": 1397.96, "text": "sind massif geil so und nun installen was installiert er da so chat ohne über jeden zweifel haben"}, {"id": 159, "start": 1397.96, "end": 1415.24, "text": "natürlich was was ist aber was macht er denn da im hintergrund"}, {"id": 160, "start": 1415.24, "end": 1443.4, "text": "er macht dinger guck mal was macht er denn das würde ich auch immer machen was zum was"}, {"id": 161, "start": 1443.4, "end": 1453.0, "text": "installiert er mir da alles bloat bloat run any percent allah was ist das ich glaube ich"}, {"id": 162, "start": 1453.0, "end": 1457.6, "text": "muss danach mein visual studio ordner erstmal löschen weil die festplatte voll ist sondern"}, {"id": 163, "start": 1457.6, "end": 1469.04, "text": "hatte ich eben noch bei 42 gigabyte nie der installiert mir das gar nicht alles der hängt"}, {"id": 164, "start": 1469.04, "end": 1484.4, "text": "einfach so leh leh leute das ist mir jetzt zu zu zu six hätt ich das kann ich das mache"}, {"id": 165, "start": 1484.4, "end": 1493.32, "text": "ich jetzt nicht warum gibt es nicht ein stink normalen version manager ok lithium dann sag"}, {"id": 166, "start": 1493.32, "end": 1499.24, "text": "mir sag mir was ich machen soll ich habe jetzt einen eigenen ordner so eigene ordner guck"}, {"id": 167, "start": 1499.24, "end": 1504.6, "text": "mal beste so ich mache jetzt das damit auf da ist nix drinne in dem ordner ich habe"}, {"id": 168, "start": 1504.6, "end": 1515.08, "text": "das ups noch nie verwendet wie in github containers ein def container erstellen in dein projekt"}, {"id": 169, "start": 1515.08, "end": 1521.64, "text": "machst du def container geisen oder docker fall 3 ne das mache ich jetzt nicht das mache"}, {"id": 170, "start": 1521.64, "end": 1528.0, "text": "ich jetzt nicht das muss ich mir irgendwann mal auf stream angucken was hat er mir denn"}, {"id": 171, "start": 1528.0, "end": 1536.84, "text": "jetzt alles draufgehauen remote vs l remote edit man visual studio kohl flatter gehst"}, {"id": 172, "start": 1536.84, "end": 1544.6, "text": "weg so auf gehts pie entf ja pie entf ist auch das einzige wie ich habe pie entf sogar"}, {"id": 173, "start": 1544.6, "end": 1559.96, "text": "noch drauf wait a minute install gibt sowas wie update oder so install kann ich kann ich"}, {"id": 174, "start": 1559.96, "end": 1574.3, "text": "sagen 3.1 3.11 beta 3.11 beta 3 ne ah das das kennt er noch nicht die neueste beta version"}, {"id": 175, "start": 1574.3, "end": 1581.8, "text": "also richtig outdated jebaited so wir bleiben jetzt wir bleiben jetzt bei dem was ich installiert"}, {"id": 176, "start": 1581.8, "end": 1591.52, "text": "habe ich glaube das ist doch ganze ecke einfacher also neues projekt meinung zu commander krieger"}, {"id": 177, "start": 1591.52, "end": 1598.08, "text": "kommt jetzt etwas überraschend ja ich habe mir mit mit dem krieger seit 5 jahren nichts"}, {"id": 178, "start": 1598.08, "end": 1601.88, "text": "mal großartig zu tun gehabt gibt es irgendwie den anlass hat er irgendwas angestellt oder"}, {"id": 179, "start": 1601.88, "end": 1610.16, "text": "einfach nur so kommt jetzt sehr überraschend ja also virtual entf will auch standardmäßig"}, {"id": 180, "start": 1610.16, "end": 1618.44, "text": "ok er macht schon standardmäßig virtual entf der existiert ja die klage existiert"}, {"id": 181, "start": 1618.44, "end": 1623.48, "text": "auf dem fall manchmal sachen auf dem kopf habe ich gesehen im stream ich lasse jetzt"}, {"id": 182, "start": 1623.48, "end": 1629.8, "text": "einfach mal die defaults ich lasse jetzt einfach mal hier alles default ausgewählt"}, {"id": 183, "start": 1629.8, "end": 1637.76, "text": "ja wir gehen davon aus pajam weiß was es macht ich will nicht 3.11 b0 ich will 3.11"}, {"id": 184, "start": 1637.76, "end": 1661.12, "text": "b3 aber das gibt es hier nicht ok create ok warum ist da ein breakpoint drinne brauchen"}, {"id": 185, "start": 1661.12, "end": 1674.96, "text": "wir nicht die fort beste so terminal sind wir hier ok heißen main ok es läuft schon"}, {"id": 186, "start": 1674.96, "end": 1685.32, "text": "also print weg jawoll ok das funktioniert also so ist so was hat er hier dran auszusetzen"}, {"id": 187, "start": 1685.32, "end": 1693.84, "text": "no new line at end of file da ist aber pingelig ist aber ganz schön pingelig oder ok das"}, {"id": 188, "start": 1693.84, "end": 1698.88, "text": "funktioniert schon einmal also jetzt muss ich erst einmal gucken dass ich die schriftgröße"}, {"id": 189, "start": 1698.88, "end": 1712.96, "text": "irgendwie ordentlich einstelle weil das ist nix font font nicht jetblades mode hack auf"}, {"id": 190, "start": 1712.96, "end": 1721.88, "text": "16 18 bm jawoll das ist doch schon viel besser habt ihr irgendwelche sieben empfehlung ansonsten"}, {"id": 191, "start": 1721.88, "end": 1731.04, "text": "würde ich jetzt einfach mal gucken ob es nicht das rider das rider sieben einfach für pajam"}, {"id": 192, "start": 1731.04, "end": 1743.76, "text": "gibt hier nicht davon aus dass es gibt die haben das doch teilweise gradin toh was one dark da purple not"}, {"id": 193, "start": 1743.76, "end": 1753.16, "text": "es erinnert mich zu sehr an nord vpn material sieben wishel studio co dark plus kein bild was was"}, {"id": 194, "start": 1753.16, "end": 1765.96, "text": "ohne bild nehme ich nicht atom 1 rider ui ja ja please da weiß ich wenigstens wie es aussieht"}, {"id": 195, "start": 1765.96, "end": 1794.16, "text": "rider ui perfekt install ich also das default ist aber nicht das rider ui das war high contrast"}, {"id": 196, "start": 1794.16, "end": 1804.56, "text": "nee nicht heiko rider dark rider dark ist ok wo ist oder wo ist studio da meine augen"}, {"id": 197, "start": 1804.56, "end": 1815.2, "text": "oder wo ist studio da ist jetzt mein font wieder weg ich glaube ich glaube ich starte das noch"}, {"id": 198, "start": 1815.2, "end": 1831.08, "text": "mal neu das ist das glaube ich etwas abgekackt gerade nein ja ja ich got it always download ich"}, {"id": 199, "start": 1831.08, "end": 1849.12, "text": "weiß zwar nicht was aber always download visual studio sieben wishel studio rider rider dark oder"}, {"id": 200, "start": 1849.12, "end": 1857.56, "text": "wishel studio rider dark komm rider dark gut fertig alles klar wunderbar schriftgröße passt"}, {"id": 201, "start": 1857.56, "end": 1866.04, "text": "hat jetzt meine meine font size eigentlich umgestellt hack 18 alles gut ok auf geht's"}, {"id": 202, "start": 1866.04, "end": 1876.04, "text": "jetzt jetzt bin ich mal gespannt also wisst ihr was ich mir überlegt habe was zum üben ja ich"}, {"id": 203, "start": 1876.04, "end": 1884.28, "text": "weiß dass es schon tausendfach gibt aber zum üben einen download speed test also ich werde"}, {"id": 204, "start": 1884.28, "end": 1889.2, "text": "mir ich habe mir schon eine seite rausgesucht nämlich die hier guck mal wir werden jetzt einfach"}, {"id": 205, "start": 1889.2, "end": 1896.52, "text": "mal ganz dreist nicht speed champ kleinzeitig wir werden jetzt einfach mal ganz dreist ich"}, {"id": 206, "start": 1896.52, "end": 1905.68, "text": "habe nämlich eine speed test seite von hetzner gefunden und da kann man einfach downloaden"}, {"id": 207, "start": 1905.68, "end": 1913.8, "text": "zehn gigabyte datei das sollte zum speed zum speed testen reichen mein ziel ist ja eh dass"}, {"id": 208, "start": 1913.8, "end": 1920.76, "text": "ich das abbrechen kann dann nach irgendwie zwei sekunden wenn er gemessen hat wie schnell es"}, {"id": 209, "start": 1920.76, "end": 1942.72, "text": "maximal geht man ks musiker ok also dann dann mal der reihe nach lasst mal lasst mal kurz in"}, {"id": 210, "start": 1942.72, "end": 1949.32, "text": "mich gehen also im schluss machen wir das multithreaded das letzte mal wo ich mich mit"}, {"id": 211, "start": 1949.32, "end": 1953.92, "text": "multithreaded in python beschäftigt habe war vorbei das kann überhaupt nicht funktioniert"}, {"id": 212, "start": 1953.92, "end": 1959.1, "text": "gescheit das ist aber auch schon eine ganze weile her stimmt wir machen da keine semi"}, {"id": 213, "start": 1959.1, "end": 1964.76, "text": "cola uns hinten dran ja ich bin es einfach so gewöhnt semi cola hinten dran zu machen"}, {"id": 214, "start": 1964.76, "end": 1975.52, "text": "aber guckt mal das funktioniert anscheinend was sagt er denn trailing semi cola ok es"}, {"id": 215, "start": 1975.52, "end": 1982.08, "text": "funktioniert aber er will das nicht ok also mit was fangen wir an ich würde sagen wir"}, {"id": 216, "start": 1982.08, "end": 1989.8, "text": "fangen mit was ganz simplem an nämlich wie mache ich in htp request mit der standard"}, {"id": 217, "start": 1989.8, "end": 1996.48, "text": "library leute ich will noch keine packages mit der standard library htp get wie funktioniert"}, {"id": 218, "start": 1996.48, "end": 2007.52, "text": "das how to perform a ttp request bis pyson python part 1 standard library alles klar"}, {"id": 219, "start": 2007.52, "end": 2016.68, "text": "rom urlip request import url open das sieht relativ easy aus das will ich so will ich das haben"}, {"id": 220, "start": 2016.68, "end": 2032.04, "text": "so ach ja wie viele einrückungen macht man eigentlich ein vier oder zwei was ist denn"}, {"id": 221, "start": 2032.04, "end": 2038.96, "text": "so der etablierte standard also ich vermute ich glaube genauso ich glaube vier oder halt"}, {"id": 222, "start": 2038.96, "end": 2049.24, "text": "vier vier für den tab ein tab ich glaube da macht startmäßig spaces zu tabs ja vier"}, {"id": 223, "start": 2049.24, "end": 2056.2, "text": "spaces ist es chat ist sich uneinig der chat hat so einen hohen intelligenzquotient ist"}, {"id": 224, "start": 2056.2, "end": 2064.84, "text": "kein gewunder dass die sich uneinig sind da ist jeder fife hättiger als der andere also"}, {"id": 225, "start": 2064.84, "end": 2070.8, "text": "normalerweise mag ich ja zwei das kennt ihr von meinen anderen editor einstellungen normalerweise"}, {"id": 226, "start": 2070.8, "end": 2077.04, "text": "habe ich ja immer zwei spaces aber wir bleiben jetzt hier mal bei dem bei dem default so also"}, {"id": 227, "start": 2077.04, "end": 2091.2, "text": "warum kann ich das hier nicht verschieben weil die settings shortcuts manage shortcuts gibt es gibt"}, {"id": 228, "start": 2091.2, "end": 2098.84, "text": "es von jetframes jetframes irgendwie ne ide sync oder so also dass man die die einstellung von"}, {"id": 229, "start": 2098.84, "end": 2112.32, "text": "der ein ide in die andere sinken kann oh hier aha ne login mit dem account ja das ist mist das"}, {"id": 230, "start": 2112.32, "end": 2120.08, "text": "meine ich nicht share ide settings ne ich dachte dass ich meine rider keybindings da irgendwie"}, {"id": 231, "start": 2120.08, "end": 2136.08, "text": "verwenden kann ok line move line move wo ist move line move line ab"}, {"id": 232, "start": 2136.08, "end": 2149.4, "text": "add keyboard shortcut bamm ist zu irgendeinem anderen müll gebunden den keiner braucht keyboard"}, {"id": 233, "start": 2149.4, "end": 2174.52, "text": "shortcut down comment comment with line comment with block add keyboard shortcut oh ne das"}, {"id": 234, "start": 2174.52, "end": 2186.4, "text": "funktioniert so glaube ich nicht wie kann ich multi wie kann ich multi line binden nicht"}, {"id": 235, "start": 2186.4, "end": 2191.92, "text": "mulche wie will ich wie kann ich sagen dass ich kontrol c kontrol kontrol k kontrol c"}, {"id": 236, "start": 2191.92, "end": 2206.92, "text": "ne ne anscheinend ja dann kann dann muss es erst mal so reichen also so wir wollen nicht"}, {"id": 237, "start": 2206.92, "end": 2215.24, "text": "die nasa url ok wie macht man eine function funktion macht man glaube ich immer noch so"}, {"id": 238, "start": 2215.24, "end": 2225.2, "text": "oder def und dann irgendwie sowas wie irgendwie measure download speed in mbit url nach quatsch"}, {"id": 239, "start": 2225.2, "end": 2236.44, "text": "hängen geblieben aber brauchen keine klammern und wir brauchen kein simpel cola und wer so"}, {"id": 240, "start": 2236.44, "end": 2243.68, "text": "und jetzt den kram hier rein schauen wir mal so funktioniert was hat er denn hier für schmerzen"}, {"id": 241, "start": 2243.68, "end": 2262.72, "text": "damit eigentlich expected to blank new lines expected to obendrüber obendrüber ok da hat"}, {"id": 242, "start": 2262.72, "end": 2271.44, "text": "aber äußerst genaue vorstellungen wie das aussehen ist wie das auszusehen hat ja sharing"}, {"id": 243, "start": 2271.44, "end": 2277.44, "text": "your ide settings ist wie man die shared nicht wie man die zwischen eigenen ide shared oder"}, {"id": 244, "start": 2277.44, "end": 2284.68, "text": "das hatte ich eben kurz auf aber ich glaube das ist was komplett anderes"}, {"id": 245, "start": 2284.68, "end": 2289.44, "text": "between different instances of the same product ne das ist es ja nicht ich will ja quasi"}, {"id": 246, "start": 2289.44, "end": 2298.16, "text": "meine rider shortcuts nach pyjam importieren egal das funktioniert schon so was hat er"}, {"id": 247, "start": 2298.16, "end": 2302.96, "text": "denn jetzt für probleme mit url was hat er für probleme mit mbit typo in word mbit soll"}, {"id": 248, "start": 2302.96, "end": 2310.48, "text": "ich es allen jetzt megabit schreiben oder wie ok so url url name shadows from autos go"}, {"id": 249, "start": 2310.48, "end": 2320.48, "text": "ok ja ok verstehe measure download speed nicht dass ich wüsste was ich mache ich habe immer"}, {"id": 250, "start": 2320.48, "end": 2325.32, "text": "noch keine ahnung wie ich es denn dann machen will er unten drunter auch zwei haben acht"}, {"id": 251, "start": 2325.32, "end": 2337.64, "text": "er will über und unter den funktion immer zwei zwei sachen haben aha gut zu wissen warum"}, {"id": 252, "start": 2337.64, "end": 2350.92, "text": "auch immer so open ne url open s response response read ich will aber nicht response"}, {"id": 253, "start": 2350.92, "end": 2360.52, "text": "read ich brauche den download callback oder sowas oder oder ne wie lese ich denn ok heißt"}, {"id": 254, "start": 2360.52, "end": 2368.76, "text": "denn download will open chunks oder so stream large binary file with urlib urlib das klingt"}, {"id": 255, "start": 2368.76, "end": 2396.12, "text": "auch gut ist miss chunker ne response url open ach hier hatte die response ok also response"}, {"id": 256, "start": 2396.12, "end": 2410.2, "text": "read und dann die chunk size also 4096 und aber das muss ja nicht zwangsläufig 4096"}, {"id": 257, "start": 2410.2, "end": 2422.56, "text": "sein ok endlos schleifend time es ist weil eins oder ist es weil true ne es ist pysons"}, {"id": 258, "start": 2422.56, "end": 2428.64, "text": "es ist weil true mit dem großen t glaub ne wie heißt das programm das er nutzt um linux"}, {"id": 259, "start": 2428.64, "end": 2432.96, "text": "den windows zustand das hier ist vor immer workstation ich habe es nur im fullscreen"}, {"id": 260, "start": 2432.96, "end": 2437.12, "text": "auf dem zweiten desktop also guck ich hab das so du kannst hier unten mit windows 11"}, {"id": 261, "start": 2437.12, "end": 2441.84, "text": "geht das auch du kannst mehrere desktops aufmachen unter windows ich habe einen zweiten desktop"}, {"id": 262, "start": 2441.84, "end": 2446.04, "text": "da habe ich vor immer workstation im fullscreen fullscreen drauf laufen kam hier ober mich"}, {"id": 263, "start": 2446.04, "end": 2450.4, "text": "ausgestellt und es kann ich mit tastatur shortkarte rüber switchen auf windows und rüber switchen"}, {"id": 264, "start": 2450.4, "end": 2455.44, "text": "wieder auf die vm ist sehr praktisch weil die meisten sachen sind einfach pains champ"}, {"id": 265, "start": 2455.44, "end": 2465.52, "text": "unter windows zu erledigen ok ergibt das sinn was ich hier mache data response read ok print"}, {"id": 266, "start": 2465.52, "end": 2476.28, "text": "data ne moment länge sekunde länge len so ne ein bisschen ein bisschen ein bisschen"}, {"id": 267, "start": 2476.28, "end": 2482.52, "text": "es kann erinnern kann ich mich ja noch ok zeig mal her ich weiß dass es ne endlos schleife"}, {"id": 268, "start": 2482.52, "end": 2486.76, "text": "ist die aber wahrscheinlich jetzt das ganze ding kaputt machen aber ich will wissen was"}, {"id": 269, "start": 2486.76, "end": 2491.8, "text": "passiert denn wenn er fertig lesen ist aber das kann ich bei 10 gigabyte bei 10 gigabyte"}, {"id": 270, "start": 2491.8, "end": 2499.48, "text": "ja nicht ausprobieren ich glaube die hatten auch 100 mb datei bäm not found ok was 100"}, {"id": 271, "start": 2499.48, "end": 2511.96, "text": "mb excellent null ok null also sprich wenn ich null gelesen habe ist der input zu ende"}, {"id": 272, "start": 2511.96, "end": 2524.4, "text": "gibt es gibt es auch sowas wie response ok es gibt keinerlei autocomplete leute wie kriege"}, {"id": 273, "start": 2524.4, "end": 2534.76, "text": "ich da jetzt ein autocomplete für dass ich weiß was das ist wie kann ich den dazu überreden"}, {"id": 274, "start": 2534.76, "end": 2546.74, "text": "das zu autocompleten ich meine neue type annotation habe ich gelesen man kann glaube ich sowas"}, {"id": 275, "start": 2546.74, "end": 2552.06, "text": "machen gell oder str oder so das das geht glaube ich das habe ich letztens in dem video"}, {"id": 276, "start": 2552.06, "end": 2557.76, "text": "gesehen space before da ist aber äußerst pingelig so und return wert kann man irgendwie"}, {"id": 277, "start": 2557.76, "end": 2570.16, "text": "so machen das kenne ich das war der autocomplete response hat nur read ja da gibt es kein das"}, {"id": 278, "start": 2570.16, "end": 2591.16, "text": "hat überhaupt kein autocomplete ok heißen response muss man die hilfe gucken"}, {"id": 279, "start": 2591.16, "end": 2608.44, "text": "response rttp response"}, {"id": 280, "start": 2608.44, "end": 2630.92, "text": "response das jetzt response response objects also read haben wir zu bieten read into get"}, {"id": 281, "start": 2630.92, "end": 2644.56, "text": "header message url headers status na gut status ist 400 das gibt es nicht sowas wie end file"}, {"id": 282, "start": 2644.56, "end": 2674.12, "text": "end oder so status nee es gibt nur den status code den brauche ich keine ahnung ob das"}, {"id": 283, "start": 2674.12, "end": 2686.24, "text": "nach geht das stimmt stimmt ja ja ich könnte ich könnte tatsächlich if data was kann man"}, {"id": 284, "start": 2686.24, "end": 2707.4, "text": "if not data geht das auch ist null ist null not gucken wir mal hey 5 header alter ok das"}, {"id": 285, "start": 2707.4, "end": 2724.16, "text": "muss das muss man auch wissen if not gibt es gibt es ein paar sie du weil oder sowas"}, {"id": 286, "start": 2724.16, "end": 2728.52, "text": "ich glaube nicht ich glaube es gibt bloß vor und weil wenn ich das richtige erinnerung"}, {"id": 287, "start": 2728.52, "end": 2745.68, "text": "habe nee gibt es nicht ok also das das würde funktionieren data response read also in 4000"}, {"id": 288, "start": 2745.68, "end": 2756.76, "text": "ok wenn wenn response aber wisst ihr was funktioniert passt mal auf 6 hat heim if nee oder"}, {"id": 289, "start": 2756.76, "end": 2782.04, "text": "das wäre jetzt so schön wenn das funktioniert python weil running variable oder sowas es"}, {"id": 290, "start": 2782.04, "end": 2792.84, "text": "ein variable in while loop condition excellent while line gleich ja genau sowas will ich"}, {"id": 291, "start": 2792.84, "end": 2805.16, "text": "mache ah guck mal da doppelpunkt gleich das ist ja fast wie in goal ein bisschen doppelpunkt"}, {"id": 292, "start": 2805.16, "end": 2818.04, "text": "gleich so da können wir uns das nämlich sparen drin checken ob das auch funktioniert oder"}, {"id": 293, "start": 2818.04, "end": 2829.52, "text": "oder muss ich jetzt noch sowas wie das dahinter machen irgendwie schauen wir mal nee ok das"}, {"id": 294, "start": 2829.52, "end": 2835.8, "text": "ist das finde ich schick dass das finde ich ganz nice nice nice so das ist schon kurz"}, {"id": 295, "start": 2835.8, "end": 2850.64, "text": "und knackig das gefällt mir ok cool so ich retorne keinen int sagt er mir gut dann retorne"}, {"id": 296, "start": 2850.64, "end": 2859.44, "text": "ich jetzt mal testweise einen int du lernst sogar noch was ja siehst du ich ich weiß gar"}, {"id": 297, "start": 2859.44, "end": 2864.6, "text": "nicht wie es anders funktioniert das ist ein ganz neues feature siehst du leute ihr pleading"}, {"id": 298, "start": 2864.6, "end": 2871.16, "text": "edge hütonisiert alles die nennen sich python programmierer eigentlich die russleute rennen"}, {"id": 299, "start": 2871.16, "end": 2879.6, "text": "sich ja ganz ganz furchtbar cringe ich krass krass tachens oder so da muss ich immer auch"}, {"id": 300, "start": 2879.6, "end": 2884.08, "text": "mit den augen rollen wenn ich das höre dass das irgendjemand schreibt oder ich höre nicht"}, {"id": 301, "start": 2884.08, "end": 2887.36, "text": "dass es jemand schreibt wenn ich es höre dass das irgendjemand sagt beziehungsweise"}, {"id": 302, "start": 2887.36, "end": 2901.28, "text": "wenn ich lese dass es irgendjemand schreibt das ist sehr neu enterprise developer enterprise"}, {"id": 303, "start": 2901.28, "end": 2913.04, "text": "developer wäre angela und java ok also weiter lass mal lass lass mal fife hatten also leute"}, {"id": 304, "start": 2913.04, "end": 2918.28, "text": "das müssen wir unbedingt etablieren anstatt zu sagen lass mal nachdenken lass mal konzentrieren"}, {"id": 305, "start": 2918.28, "end": 2925.68, "text": "sagen wir ab jetzt immer lass mal fife hatten das ist auch sichergestellt dass es auf der"}, {"id": 306, "start": 2925.68, "end": 2937.16, "text": "welt genau eine handvoll leute versteht kann ich als sap was entwickler bestätigen ist"}, {"id": 307, "start": 2937.16, "end": 2943.56, "text": "das so lass mal fife hatten genau so wie kann ich jetzt überprüfen ok lass mal ich muss"}, {"id": 308, "start": 2943.56, "end": 2949.6, "text": "mal ich muss mal kurz in mich gehen leute also ich möchte ja so viel downloaden so viel"}, {"id": 309, "start": 2949.6, "end": 2956.0, "text": "wie geht und dann will ich abbrechen nach sagen wir drei sekunden oder so also ich muss"}, {"id": 310, "start": 2956.0, "end": 2974.68, "text": "mir die size jetzt merken ok also size gleich data länge ne das muss ich hier oben reinschreiben"}, {"id": 311, "start": 2974.68, "end": 2984.72, "text": "ne sei es sei es klar ich soße sei es gleich null so ah alter ich bin mal im semi kohle"}, {"id": 312, "start": 2984.72, "end": 2992.04, "text": "und man sei es gleich null so funktioniert jetzt wenigstens das hochzählen und im moment"}, {"id": 313, "start": 2992.04, "end": 3002.4, "text": "sei es plus plus kann man plus gleich machen ist plus gleich auch neu ich bilde mir ein"}, {"id": 314, "start": 3002.4, "end": 3011.68, "text": "früher musste man sei es plus sei es machen wie gesagt meine pausenkenntnisse halten"}, {"id": 315, "start": 3011.68, "end": 3021.28, "text": "sich in grenzen ok sei es das sollte doch jetzt funktionieren mit hochzählen oder ja"}, {"id": 316, "start": 3021.28, "end": 3034.56, "text": "funktioniert sei es plus plus geht nicht sei es plus plus geht tatsächlich nicht das"}, {"id": 317, "start": 3034.56, "end": 3042.04, "text": "das ist nicht pyson style genug anscheinend was macht man was macht man in pyson anstatt"}, {"id": 318, "start": 3042.04, "end": 3056.4, "text": "dessen plus gleich eins wahrscheinlich ne was alter boah der ist aber mal super pingelig"}, {"id": 319, "start": 3056.4, "end": 3065.12, "text": "der checker hier aber ist gar nicht schlecht eigentlich gar nicht so übel dann sieht das"}, {"id": 320, "start": 3065.12, "end": 3071.08, "text": "wenigstens halbwegs ordentlich aus warum ich diese einschreite weil ich das mir bescheuert"}, {"id": 321, "start": 3071.08, "end": 3078.88, "text": "weise angewöhnt habe ok also jetzt wissen wir unsere size davon so und von der idee"}, {"id": 322, "start": 3078.88, "end": 3085.44, "text": "her kriege ich ja meine download geschwindigkeit relativ einfach raus und zwar wenn ich irgendwie"}, {"id": 323, "start": 3085.44, "end": 3090.6, "text": "meine meine sagen wir mal time now ich weiß dass ich das so nicht geht aber nur mal von"}, {"id": 324, "start": 3090.6, "end": 3096.48, "text": "der idee her ja von der idee her würde ich sagen time now dann würde ich so was sagen"}, {"id": 325, "start": 3096.48, "end": 3108.12, "text": "wie elapsed elapsed oder sowas und dann irgendwie now minus start falls man das start so und"}, {"id": 326, "start": 3108.12, "end": 3114.64, "text": "dann würde ich einfach sei es geteilt durch dauer machen und dann hätte ich mein download"}, {"id": 327, "start": 3114.64, "end": 3125.96, "text": "geschwindigkeit so ungefähr aber das funktioniert wahrscheinlich nicht date time now date time"}, {"id": 328, "start": 3125.96, "end": 3139.4, "text": "now pyson format on safe ja können die bestimmt das ist eine gute idee format gucken wir mal"}, {"id": 329, "start": 3139.4, "end": 3144.84, "text": "ob der das ob der das checkt wenn ich das so mache und sag jetzt hier format document"}, {"id": 330, "start": 3144.84, "end": 3160.96, "text": "ja das checkter safe format on safe format safe actions on safe reformat code excellent"}, {"id": 331, "start": 3160.96, "end": 3183.08, "text": "nao date time now was kommt denn da raus wenn ich date da date time now benutze nein es"}, {"id": 332, "start": 3183.08, "end": 3200.88, "text": "ist ein eine raute ok was kommt denn da raus date time not defined ok import muss man importieren"}, {"id": 333, "start": 3200.88, "end": 3208.26, "text": "date time from date time da hätte ich auch selbst drauf kommen können ok und das kann"}, {"id": 334, "start": 3208.26, "end": 3219.36, "text": "man voneinander abziehen geht das ach so ja natürlich das ist klar dass das nicht funktioniert"}, {"id": 335, "start": 3219.36, "end": 3229.12, "text": "das ist das ist klar dass es nicht funktioniert ich muss quasi sowas hier machen start und"}, {"id": 336, "start": 3229.12, "end": 3241.52, "text": "dann date time now minus start ja das funktioniert easy ist das der ist das der pyson gedachte"}, {"id": 337, "start": 3241.52, "end": 3250.96, "text": "weg sowas so zu machen oder wir machen mal pyson time oder gibt es sowas wie stop stop"}, {"id": 338, "start": 3250.96, "end": 3258.04, "text": "watch oder sowas how to create a stopwatch nee dachte vielleicht in der standard library"}, {"id": 339, "start": 3258.04, "end": 3267.72, "text": "schon drinne ist es der pysonic way genau elapsed time how to measure elapsed time in"}, {"id": 340, "start": 3267.72, "end": 3278.8, "text": "pyson time it import time time another option science pyson 3. might be perfcounter was"}, {"id": 341, "start": 3278.8, "end": 3288.24, "text": "aber warum gibt es da 20 varianten warum gibt es date time now time time time perfcounter"}, {"id": 342, "start": 3288.24, "end": 3293.56, "text": "time process time da komme ich ja fast wie ein java script von mit sich in deprecated"}, {"id": 343, "start": 3293.56, "end": 3309.0, "text": "sachen perf perfcounter klingt so als wäre es super superschnell jetzt gibt es ein beispiel"}, {"id": 344, "start": 3309.0, "end": 3328.6, "text": "für import from time import perfcounter ok ich hasse das kann ich einfach sagen from"}, {"id": 345, "start": 3328.6, "end": 3336.76, "text": "time import time oder einfach nur import time und dann sagen time perfcounter doch"}, {"id": 346, "start": 3336.76, "end": 3361.44, "text": "viel besser so ok also achtung gucken wir mal perfcounter ahja obvious alles klar 2711"}, {"id": 347, "start": 3361.44, "end": 3387.84, "text": "das ist meine ab time wtf das ist meine ab time aha ok ok ich habe keine ahnung warum"}, {"id": 348, "start": 3387.84, "end": 3391.92, "text": "es da so viele varianten gibt aber ok wir nehmen jetzt den perfcounter das sieht moderner"}, {"id": 349, "start": 3391.92, "end": 3397.72, "text": "und und pfeilfertiger aus ach guck mal der kann sogar das eindrücken jetzt selber machen"}, {"id": 350, "start": 3397.72, "end": 3410.96, "text": "da gott sei danke ok also now ist dann time perfcounter bla bla bla read und jetzt ist"}, {"id": 351, "start": 3410.96, "end": 3439.08, "text": "die elapsed ist time perfcounter minus start und dann die size size durch elapsed ja wo"}, {"id": 352, "start": 3439.08, "end": 3444.28, "text": "da vorne war auch schon mal schneller aber das ist jetzt ja insgesamt über den gesamten"}, {"id": 353, "start": 3444.28, "end": 3454.16, "text": "download das passt zum das ist viel zu schnell ah moment moment moment lass mal kurz überlegen"}, {"id": 354, "start": 3454.16, "end": 3465.32, "text": "das ist jetzt ja auch in megabyte nee es ist nicht in byte das sind bytes in bytes pro"}, {"id": 355, "start": 3465.32, "end": 3473.2, "text": "sekunde was kommt denn da überhaupt raus pro sekunde oder was ist das ja pro sekunde"}, {"id": 356, "start": 3473.2, "end": 3488.2, "text": "seh ich das richtig also die einheit hier ist jetzt bytes pro sekunde also bytes pro"}, {"id": 357, "start": 3488.2, "end": 3495.12, "text": "sekunde also sprich irgendwie 50 mb das kann durchaus sein 400 mbit zu megabyte das sind"}, {"id": 358, "start": 3495.12, "end": 3503.12, "text": "irgendwie was um 15 doch gar nicht so schlecht das das kommt schon ungefähr natürlich ist"}, {"id": 359, "start": 3503.12, "end": 3510.4, "text": "das so wie ich das messe absolut hirn verbrannt aber von der idee her ist das glaube ich schon"}, {"id": 360, "start": 3510.4, "end": 3518.4, "text": "mal gar nicht verkehrt so so und wir messern wir messern da jetzt natürlich nicht das so"}, {"id": 361, "start": 3518.4, "end": 3528.56, "text": "sondern wir warten eine sekunde messern das einmal und dann resetten wir das und dann"}, {"id": 362, "start": 3528.56, "end": 3534.24, "text": "messern wir dreimal und nehmen dann irgendwie den höchsten wert oder sowas von würde ich"}, {"id": 363, "start": 3534.24, "end": 3542.56, "text": "sagen also lass mal überlegen ob das funktioniert was ich mir da so vorstelle also if elapsed"}, {"id": 364, "start": 3542.56, "end": 3555.68, "text": "größer gleich eins also eine sekunde dann bin ich das ok und dann resette ich sei es"}, {"id": 365, "start": 3555.68, "end": 3566.32, "text": "und resette ich elapsed auf neustart wert aber wir können uns ich habe eine idee was"}, {"id": 366, "start": 3566.32, "end": 3572.88, "text": "wir machen wir machen das objekt orientiert ich baue mir ich baue mir eine stoppur klasse"}, {"id": 367, "start": 3572.88, "end": 3585.24, "text": "dafür nicht weil sinnvoll ist sondern einfach das ist das miem zu teimet es gibt ein miem"}, {"id": 368, "start": 3585.24, "end": 3594.04, "text": "zu teimet was ihr alles gibt du musst schon start resetten das ist richtig muss start"}, {"id": 369, "start": 3594.04, "end": 3611.08, "text": "resetten nicht elapsed so Leute das funktioniert relativ gut ich meine der bricht zwischendrin"}, {"id": 370, "start": 3611.08, "end": 3627.04, "text": "mal"}, {"id": 371, "start": 3627.04, "end": 3634.44, "text": "ja zwischenzeitlich bricht er immer mal ein da hat der hetzer server kein bock mehr ordentlich"}, {"id": 372, "start": 3634.44, "end": 3644.72, "text": "zu antworten dann schwankt es schwankt ein bisschen ja muss die 10 gigabyte datei muss"}, {"id": 373, "start": 3644.72, "end": 3651.2, "text": "erstmal wieder bei hetzer in cash geladen werden kannst du bei mir einen kurs machen"}, {"id": 374, "start": 3651.2, "end": 3656.08, "text": "ja super ich bin als ich bin am besten um den kurs zu machen ja ich habe selbst keine"}, {"id": 375, "start": 3656.08, "end": 3660.24, "text": "ahnung wobei es gibt so viele leute die was verkaufen wovon sie keine ahnung haben da"}, {"id": 376, "start": 3660.24, "end": 3666.56, "text": "bin ich wäre ich eigentlich in bester gesellschaft stimmt der buffer ist ein bisschen klein vielleicht"}, {"id": 377, "start": 3666.56, "end": 3670.96, "text": "gell ja der buffer ist ein bisschen klein komm wir machen einfach mal das zehnfache"}, {"id": 378, "start": 3670.96, "end": 3678.72, "text": "ne ne ich war ich habe keine kurse dafür ist es auch viel zu verplant was ich mache da"}, {"id": 379, "start": 3678.72, "end": 3683.76, "text": "müsste ich ja auch mal strukturiert irgendwas ne ne sowas gibt es habe ich nicht aber ich"}, {"id": 380, "start": 3683.76, "end": 3695.76, "text": "habe gelesen dass twitter glorian wie heißt er irgendwie so algorithmen verstehen dass"}, {"id": 381, "start": 3695.76, "end": 3702.24, "text": "der gerade an einem pyson buch schreibt und ich glaube der hat ein plan davon wenn es"}, {"id": 382, "start": 3702.24, "end": 3710.52, "text": "was taugt dann ich denke mal das wird empfehlenswert aber ob es dann wirklich was taugt muss man"}, {"id": 383, "start": 3710.52, "end": 3727.36, "text": "mal gucken spuky spuky musik sie konnten leute schon mal kurz was zu essen abholen unten"}, {"id": 384, "start": 3727.36, "end": 3741.0, "text": "schicken"}, {"id": 385, "start": 3741.0, "end": 3743.0, "text": "Das war's für heute."}, {"id": 386, "start": 3743.0, "end": 3745.0, "text": "Bis zum nächsten Mal."}, {"id": 387, "start": 3745.0, "end": 3773.0, "text": "Das war's für heute."}, {"id": 388, "start": 3773.0, "end": 3801.0, "text": "Das war's für heute."}, {"id": 389, "start": 3801.0, "end": 3805.6, "text": "ist ja nirgends win. Also meine download-geschwindigkeit ist ziemlich am schwanken. Guck mal hier,"}, {"id": 390, "start": 3805.6, "end": 3812.28, "text": "wie die einbricht zwischendurch. Das könnte natürlich auch daran liegen, dass Vodafone"}, {"id": 391, "start": 3812.28, "end": 3820.48, "text": "sonntags abends irgendwie rumspackt. Was die Magic in Zeile 12 macht, das weiß, das hab"}, {"id": 392, "start": 3820.48, "end": 3824.12, "text": "ich auch gerade gelernt. Wie gesagt, ich hab keinen großen Plan davon, aber das hab ich"}, {"id": 393, "start": 3824.12, "end": 3830.2, "text": "mir auch gerade ergoogelt. Das nimmt die Variable, also das schreibt das hier in die Variable"}, {"id": 394, "start": 3830.2, "end": 3837.68, "text": "Data, sodass du Data in der Schleife verwenden kannst. Ansonsten hättest du es vorher deklarieren"}, {"id": 395, "start": 3837.68, "end": 3843.56, "text": "müssen und checkt auch gleichzeitig Data auf die Abbruchbedingungen, ob Data true ist."}, {"id": 396, "start": 3843.56, "end": 3851.64, "text": "Das ist fast ein bisschen wie JavaScript, weil eigentlich kann ja ein Int, wobei das"}, {"id": 397, "start": 3851.64, "end": 3861.84, "text": "ist ja gar kein Int. Doch, nee, das ist ein Array oder sowas, was da zurückkommt. Eigentlich"}, {"id": 398, "start": 3861.84, "end": 3869.84, "text": "kann ein Array nie false sein, aber in Python und JavaScript geht das anscheinend. Das sind"}, {"id": 399, "start": 3869.84, "end": 3884.6, "text": "4 Kilobyte mal 10. Musst du nicht die Endzeit, Startzeit messen, bis die Datei fertig geladen"}, {"id": 400, "start": 3884.6, "end": 3893.72, "text": "ist? Nee, ich messe eine Sekunde lang. Guck mal, sobald eine Sekunde um ist, messe ich"}, {"id": 401, "start": 3893.72, "end": 3903.0, "text": "die Zeit und dann setze ich Startzeit und gemessene Size wieder auf Null und dann mach"}, {"id": 402, "start": 3903.0, "end": 3912.84, "text": "ich wieder von vorne. Also, das find ich nice. Also mein Downloadspeed schwankt ganz schön."}, {"id": 403, "start": 3912.84, "end": 3917.08, "text": "Warum das am Anfang so schnell ist, liegt wahrscheinlich daran, weil der Kram irgendwo"}, {"id": 404, "start": 3917.08, "end": 3926.76, "text": "im Cache liegt. Entweder bei mir oder auf dem Server, beim Anbieter oder so, keine Ahnung."}, {"id": 405, "start": 3926.76, "end": 3937.48, "text": "Du nimmst 10 Gigabyte an RAM auf? Nee, Quatsch. Also so blöd wird er nicht sein. Der wird"}, {"id": 406, "start": 3937.48, "end": 3946.2, "text": "da schon re-usen und garbage collecten zwischendurch. Das wäre ja bescheuert, wenn das mein RAM"}, {"id": 407, "start": 3946.2, "end": 3950.08, "text": "voll machen würde. Ich mein, das hier ist nicht mehr, das ist ja nicht mehr referenziert"}, {"id": 408, "start": 3950.08, "end": 3956.24, "text": "nach einem Durchlauf. Das wird er schon aufräumen. By the way Leute, wisst ihr, was ich gesehen"}, {"id": 409, "start": 3956.24, "end": 3962.28, "text": "hab? Hier auf dieser Hilfeseite vorhin zu response, es gibt doch sowas wie read into. Und jetzt"}, {"id": 410, "start": 3962.28, "end": 3967.64, "text": "mal eine blöde Frage, warum gibt es read und gibt es read into? Read into liest das"}, {"id": 411, "start": 3967.64, "end": 3974.68, "text": "in einen Buffer, den ich vorher bereitstellen muss. Ist das schneller, weil das hier jedes"}, {"id": 412, "start": 3974.68, "end": 3990.92, "text": "Mal dynamisch einen Buffer macht? Also wenn ich jetzt sage read into, also ja. Wie macht"}, {"id": 413, "start": 3990.92, "end": 3997.88, "text": "man eigentlich einen Buffer? Wie heißt das? Buffer fixed size. Float a game, Dankeschön"}, {"id": 414, "start": 3997.88, "end": 4012.28, "text": "für den Sub. Wie macht man denn Array? Wie macht man denn Array? Array, jawoll. Ich brauche"}, {"id": 415, "start": 4012.28, "end": 4034.24, "text": "einen Buffer mit einer festen, wie geht das? Fixed size. Fixed size, ok. Das kann doch"}, {"id": 416, "start": 4034.24, "end": 4043.2, "text": "nicht sein. Nee, nee, nee, nee, nee, nee. Wenn die in der Standard Library drinstehen"}, {"id": 417, "start": 4043.2, "end": 4056.84, "text": "haben, read into, da brauche ich dazu garantiert keine extra Library, dass es. Aber List gleich"}, {"id": 418, "start": 4056.84, "end": 4076.32, "text": "Null kann es ja alles sein. Memory View, what? Ok, Python Array, bytes. Byte, was? Byte Array"}, {"id": 419, "start": 4076.32, "end": 4085.56, "text": "message returns, a byte array object. Ich bin einfach nur am googeln, aber so ist das"}, {"id": 420, "start": 4085.56, "end": 4094.64, "text": "halt, wenn man was Neues lernt. Byte Array Syntax. Byte Array Source. Ich habe keine"}, {"id": 421, "start": 4094.64, "end": 4113.84, "text": "Ahnung, geht das? Buffer? Und was jetzt? Byte Array? Ok, Byte Array. Ja, example please."}, {"id": 422, "start": 4113.84, "end": 4129.56, "text": "Byte Array Objects. Byte Array. Source encoding. Ah, zero filled instance with length 10. Also"}, {"id": 423, "start": 4129.56, "end": 4143.92, "text": "Byte Array 4096. Read into. Ich glaube der andere Weg ist schon der bessere, oder? Read"}, {"id": 424, "start": 4143.92, "end": 4151.28, "text": "into returns die Länge der gelesenen bytes. Also es ist nicht data, sondern es ist Länge."}, {"id": 425, "start": 4151.28, "end": 4161.28, "text": "Und da muss ich gucken, ob Länge größer Null ist. Ok, Leute das andere ist aber schöner."}, {"id": 426, "start": 4161.28, "end": 4166.32, "text": "Wobei ich dann hier direkt, wobei das muss ich nicht Länge numm, numm heißt das jetzt."}, {"id": 427, "start": 4166.32, "end": 4182.32, "text": "Dann muss ich hier nämlich size. Und ist das jetzt? Nein. Was steht denn in numm drinnen?"}, {"id": 428, "start": 4182.32, "end": 4206.36, "text": "Was? Ah, Moment, der schreibt das da jetzt rein. Kann man das klammern? Aha, hey, das"}, {"id": 429, "start": 4206.36, "end": 4213.76, "text": "funktioniert. Das ist jetzt aber eher C-Style als Python-Style, oder? Ich glaube nicht,"}, {"id": 430, "start": 4213.76, "end": 4224.88, "text": "dass es so gedacht ist, das zu verwenden. Aber das funktioniert. Aber wirklich schneller"}, {"id": 431, "start": 4224.88, "end": 4237.56, "text": "ist es auch nicht. Aber das macht keinen Unterschied, guckt mal. Das macht überhaupt keinen Unterschied"}, {"id": 432, "start": 4237.56, "end": 4243.24, "text": "in der Geschwindigkeit. Ok, das mache ich wieder rückgängig, das ist ja komplett unsinnig"}, {"id": 433, "start": 4243.24, "end": 4255.2, "text": "so. Also es war vorher doch schon schöner. Das Byte Array kommt auch wieder weg. Read,"}, {"id": 434, "start": 4255.2, "end": 4260.24, "text": "ja. 4096 muss reichen. Das Internet wird auch... Ja, aber guckt mal, die ersten paar"}, {"id": 435, "start": 4260.24, "end": 4266.12, "text": "kommen aus irgendeinem Cache und es geht mega schnell. Und danach geht es wieder runter."}, {"id": 436, "start": 4266.12, "end": 4274.4, "text": "Jetzt bleibt es länger oben. Nee, jetzt geht es wieder runter. Ok, jetzt rechnen wir das"}, {"id": 437, "start": 4274.4, "end": 4280.6, "text": "mal um. Jetzt Leute, jetzt rechnen, lass mal Fivehead sein. Also wir rechnen das jetzt"}, {"id": 438, "start": 4280.6, "end": 4289.08, "text": "um. Die... Nimm mal raid. Let raid gleich... Was mache ich denn hier, meine Güte. Raid,"}, {"id": 439, "start": 4289.08, "end": 4300.28, "text": "klar. Kein Semikolon, kein Let, kein War, nix. Nimm mal raid. Ja, ich bin ja noch zu"}, {"id": 440, "start": 4300.28, "end": 4310.72, "text": "hardcoded von anderen Sachen. Size durch elapsed ist die Raid. Ok. Raid... Leute, wir"}, {"id": 441, "start": 4310.72, "end": 4318.48, "text": "machen es in Bit, oder? Wir machen es in Megabit. Also es ist die Size mal 8, dann ist es dann"}, {"id": 442, "start": 4318.48, "end": 4335.64, "text": "in Bit und dann die Raid durch 1024 Kilobit durch 1024 Megabit. Ergibt das Sinn, was ich"}, {"id": 443, "start": 4335.64, "end": 4364.92, "text": "mache? Schauen wir mal. Nicht... Naja. Wobei das kann schon sein. Was ist noch ein Vorstellungsgespräch"}, {"id": 444, "start": 4364.92, "end": 4370.2, "text": "für Physiak? Ich dachte, du hast den Vertrag schon unterschrieben. Ja, kommt hin, oder?"}, {"id": 445, "start": 4370.2, "end": 4376.92, "text": "Ich meine, es müsste eigentlich 400 MBit sein. Nee, nicht das durch 8. Ich habe das"}, {"id": 446, "start": 4376.92, "end": 4383.36, "text": "hier mal 8 gemacht, dass ich es in Bit habe. Ich habe das ja schon in Bit. Dadurch habe"}, {"id": 447, "start": 4383.36, "end": 4394.12, "text": "ich das in Bit. Ich sag doch, die suchen Leute. Wie verrückt. Ok, passt, passt. 400 MBit,"}, {"id": 448, "start": 4394.12, "end": 4404.16, "text": "maximal. Leute, ich habe eine Idee. Wir traffic-shapen einfach mein Interface runter auf irgendwas"}, {"id": 449, "start": 4404.16, "end": 4410.52, "text": "und dann sehen wir, ob... Monkeys. Was ist das? No. Was habe ich gedrückt? Wir traffic-shapen"}, {"id": 450, "start": 4410.52, "end": 4422.6, "text": "jetzt mein Interface und dann sehen wir, ob das funktioniert oder nicht. Ich muss aber"}, {"id": 451, "start": 4422.6, "end": 4428.32, "text": "noch mal kurz in mich gehen. Also, das hier ist die Raid in MBit. Wir machen das anders."}, {"id": 452, "start": 4428.32, "end": 4438.2, "text": "Wir machen jetzt noch was wie Max Raid. Hier unten returnen wir Max Raid. Problem ist nur,"}, {"id": 453, "start": 4438.2, "end": 4445.12, "text": "wenn es 0 ist, Leute. Da gibt es die Weit-durch-Null-Error. Wobei, nee. 0 durchgeht ja. Plus durch"}, {"id": 454, "start": 4445.12, "end": 4455.96, "text": "0 geht nicht. Also, Max Raid. Was hat er für Schmerzen jetzt? Expected Type-In, Gott, Float."}, {"id": 455, "start": 4455.96, "end": 4462.16, "text": "Ja, dann stell dich nicht so an, dann Float. Nee, das muss so schon funktionieren. Ich"}, {"id": 456, "start": 4462.16, "end": 4473.92, "text": "will da keinen Exception Handling-Krobot machen. Raid. Und jetzt, und jetzt, passt mal auf,"}, {"id": 457, "start": 4473.92, "end": 4488.72, "text": "und jetzt machen wir es so. If Max Raid ist kleiner als Raid, nur dann setzen wir Max Raid"}, {"id": 458, "start": 4488.72, "end": 4492.92, "text": "auf Raid. Das heißt, so kriegen wir immer das Schnellste, weil was interessiert mich,"}, {"id": 459, "start": 4492.92, "end": 4496.6, "text": "wenn der Download zwischenzeitlich mal schwankt. Ich will einfach nur gucken, was das Schnellste"}, {"id": 460, "start": 4496.6, "end": 4507.24, "text": "ist, was durchging. Kann man sowas machen? Max Raid gleich Raid if kleiner Raid? Geht"}, {"id": 461, "start": 4507.24, "end": 4520.04, "text": "sowas? Nee. Ok, weil in Ruby würde das funktionieren. Aber das geht anscheinend nicht. Ja gut, else"}, {"id": 462, "start": 4520.04, "end": 4524.68, "text": "könnte ich hier machen, aber das ist... Ah, das geht tatsächlich, aber das ist nicht"}, {"id": 463, "start": 4524.68, "end": 4550.64, "text": "das, was ich haben will. So. Rind. Max Raid. Ja, am Anfang flutscht es mal. Wir brauchen"}, {"id": 464, "start": 4550.64, "end": 4558.44, "text": "noch mal einen anderen Server zum Speedtesten. Speedtest10gb. Gibt es da nicht noch irgendwelche..."}, {"id": 465, "start": 4558.44, "end": 4562.6, "text": "Hier, genau das gleiche habe ich gesucht im Hinterhalt. Dafür habe ich nämlich diesen"}, {"id": 466, "start": 4562.6, "end": 4581.96, "text": "Hetzner Speedtest Server gefunden mit 10gb. Belvispeed. Wunderbar. Das wollte ich auch"}, {"id": 467, "start": 4581.96, "end": 4600.56, "text": "machen. Ist doch ok. Mal gucken, wie sehr das runtergeht. Alter, warum bricht denn der"}, {"id": 468, "start": 4600.56, "end": 4612.36, "text": "Download immer so krass schnell ein? Guck mal, der Download ist total... Der startet"}, {"id": 469, "start": 4612.36, "end": 4620.32, "text": "mega schnell und dann wird es kacke. So als Traffic Shape mich Vodafone übelst runter."}, {"id": 470, "start": 4620.32, "end": 4630.76, "text": "Der Download ist einfach nur halb so schnell, wie er sein könnte. Startet mega schnell,"}, {"id": 471, "start": 4630.76, "end": 4633.0, "text": "wahrscheinlich, weil es aus dem Web-Server Cache kommt oder so. Aber das sind ja eh"}, {"id": 472, "start": 4633.0, "end": 4643.76, "text": "nur Nullen wahrscheinlich. Guck mal, das ist richtig mies der Download zwischenzeitlich."}, {"id": 473, "start": 4643.76, "end": 4648.68, "text": "Sind die ersten Biles nicht immer mega schnell? Ja, wahrscheinlich, weil sie aus dem Cache"}, {"id": 474, "start": 4648.68, "end": 4660.32, "text": "kommen. Ach, das ist random? Ja, trotzdem. Aber trotzdem Müll. Guck mal, wie lahm das"}, {"id": 475, "start": 4660.32, "end": 4669.0, "text": "ist. Also müsste ich theoretisch die ersten 10 Sekunden vom Download fast schon wegschmeißen."}, {"id": 476, "start": 4669.0, "end": 4689.84, "text": "Ne, ne. Haben wir noch irgendwie einen schönen Test-Server? Speed X? Test File. Ok, ich"}, {"id": 477, "start": 4689.84, "end": 4717.12, "text": "nehm' das. Test File. Test Download. Bandwidth. Test. Vergleiche das mal mit Weget. Doch,"}, {"id": 478, "start": 4717.12, "end": 4720.88, "text": "ich könnte Speedtest CLI nehmen. Natürlich könnte ich das. Das ist aber nicht hin und"}, {"id": 479, "start": 4720.88, "end": 4731.76, "text": "zweck der Sache. So, ich Wegette das mal. Ja, ja. Guck mal. Also mein Speedtest ist"}, {"id": 480, "start": 4731.76, "end": 4737.56, "text": "relativ genau. Das geht einfach runter. Na gut, es ist Sonntagabend und es ist Vodafone."}, {"id": 481, "start": 4737.56, "end": 4743.28, "text": "Aber wisst ihr, was wir machen könnten? Ja, zwischens. Ja, das ist genau das, was ich"}, {"id": 482, "start": 4743.28, "end": 4747.96, "text": "auch messe. Aber wisst ihr, was wir machen könnten? Wir könnten einfach einen parallelen"}, {"id": 483, "start": 4747.96, "end": 4753.8, "text": "Download machen. Guck mal, sowas hier. Aber machen wir nur 10G. ARIA 2C und dann Minus"}, {"id": 484, "start": 4753.8, "end": 4772.72, "text": "X oder so. X20? Ne. Das ist ein Kommandozeilen-Download-Manager, der Multithreaded downloaden kann. Minus X und dann"}, {"id": 485, "start": 4772.72, "end": 4784.56, "text": "irgendwie 16. Da flutscht's, wenn ich jetzt einfach 16 Verbindungen aufmache. Guck mal."}, {"id": 486, "start": 4784.56, "end": 4788.32, "text": "Das bleibt am Limit. Leute, ich seh schon, wir müssen heute auch noch lernen, wie man"}, {"id": 487, "start": 4788.32, "end": 4797.16, "text": "Multithreading in Python macht, dass ich das nachbauen kann. Ich ahne Schlimmes. Guck,"}, {"id": 488, "start": 4797.16, "end": 4805.08, "text": "der bleibt immer auf einem Niveau, weil der eben zig, der macht 16 Verbindungen auf."}, {"id": 489, "start": 4805.08, "end": 4810.76, "text": "Das ist kein Ding. Aber mit einer Verbindung, können wir noch mal ausprobieren, wie das"}, {"id": 490, "start": 4810.76, "end": 4818.16, "text": "mit einer Verbindung aussieht. Ja, jetzt ist es noch im cache und sobald es aus dem cache"}, {"id": 491, "start": 4818.16, "end": 4829.2, "text": "draußen ist, geht's runter. Guckt. Async ist angenehmer. Ich weiß aber nicht, ob mir Async"}, {"id": 492, "start": 4829.2, "end": 4841.32, "text": "was bringt. Ich brauch ja wirklich 10 gleichzeitige Downloads im Endeffekt. Ja, ok. Zumindest wissen"}, {"id": 493, "start": 4841.32, "end": 4858.08, "text": "wir schon mal, dass wir wissen schon mal, dass meine Download-Messungen relativ akkurat"}, {"id": 494, "start": 4858.08, "end": 4864.72, "text": "sind. Ich mein, exakt das gleiche passiert bei mir auch. Guck, das startet schnell."}, {"id": 495, "start": 4864.72, "end": 4872.92, "text": "Trosselt der Server die Connections? Ganz ehrlich, ich glaube eher sogar, dass das Vodafone ist."}, {"id": 496, "start": 4872.92, "end": 4885.0, "text": "Würde ich jetzt einfach mal vermuten, ja. Weil Sonntag Abend ist. Genau so ist das hier."}, {"id": 497, "start": 4885.0, "end": 4892.12, "text": "So. Alles klar. Ok, Fivehead-Time. Lass mal, lass mal. Also das mit der Max-Rate, das lass"}, {"id": 498, "start": 4892.12, "end": 4908.4, "text": "ich mal, das lass ich mal weg. Ich mein, wir könnten auch sowas machen wie Bites to Mega-Bit."}, {"id": 499, "start": 4908.4, "end": 4917.16, "text": "Oh Gott, man. Ich wusste, wer das... Ich hab mir einfach zu sehr Klammern und Simikolon"}, {"id": 500, "start": 4917.16, "end": 4924.44, "text": "angehört. Bites to Mega-Bit. So, und da machen wir jetzt einfach Return. Das durch 8 durch"}, {"id": 501, "start": 4924.44, "end": 4935.28, "text": "1024 durch 1024. Stimmt das, was ich da mache? Ihr seid sixheadiger als ich. Und wenn ich"}, {"id": 502, "start": 4935.28, "end": 4961.36, "text": "jetzt sage, Rate? Mal 8? Oh. Mal 8? Nee, Leute. Aber das muss man, das Klammern?"}, {"id": 503, "start": 4961.36, "end": 4984.2, "text": "Hä? Ach, der macht immer noch mal 8. Hier. Lull."}, {"id": 504, "start": 4984.2, "end": 4996.52, "text": "Ja, ja. Das ist aber falsch, was ich mache. Moment. Moment, nicht die Rate, die Size."}, {"id": 505, "start": 4996.52, "end": 5005.52, "text": "Die Size. Wartet mal. Ist zwar doch richtig, was ich gemacht hab am Anfang. Nee. Ah, Moment."}, {"id": 506, "start": 5005.52, "end": 5011.12, "text": "Ich bin, ich bin, ich bin... Also jetzt ist es... Ah, man, Bites, Bit, Umreiche, please."}, {"id": 507, "start": 5011.12, "end": 5040.08, "text": "Das ist jetzt die Rate Bites pro Sekunde. Ah. Okay, das sind jetzt Mega-Bites pro Sekunde."}, {"id": 508, "start": 5040.08, "end": 5056.64, "text": "Und wenn ich das Ganze jetzt mal 8 rechne, dann stimmt's. Okay, gut. Alles klar. Das"}, {"id": 509, "start": 5056.64, "end": 5068.12, "text": "ist dann, können wir uns, können wir uns das sparen. Bites. Alles klar. So. Das ist jetzt"}, {"id": 510, "start": 5068.12, "end": 5074.2, "text": "vielleicht ein bisschen besser lesbar. Also, wie können wir das jetzt mit mehreren Connections"}, {"id": 511, "start": 5074.2, "end": 5084.16, "text": "machen? Multithreading ist einfach. Thread, threading, target, minor, target, arcs. Okay."}, {"id": 512, "start": 5084.16, "end": 5094.2, "text": "Warum threads? Ja, was ist denn die Alternative? Ich lese in Chunks. Ja, aber ich mach nur eine"}, {"id": 513, "start": 5094.2, "end": 5107.92, "text": "Verbindung auf. Ich will mehrere Verbindungen haben. Ich will mehr, ich will das hier quasi"}, {"id": 514, "start": 5107.92, "end": 5112.4, "text": "mehrfach starten. Also von der Idee her, lasst mal überlegen, vielleicht sollten wir das"}, {"id": 515, "start": 5112.4, "end": 5129.48, "text": "hier erstmal ordentlich machen, sodass es gut funktioniert. Also, ich müsste jetzt ja"}, {"id": 516, "start": 5129.48, "end": 5146.44, "text": "von der Idee her, das sagen wir mal 10 mal starten und dann in allen Jobs, meine, oh"}, {"id": 517, "start": 5146.44, "end": 5160.12, "text": "nee, ach du Scheiße. Wie mach ich denn das jetzt gescheit? Ich müsste den Kram ja auch"}, {"id": 518, "start": 5160.12, "end": 5168.0, "text": "noch irgendwie synchronisieren, oder? Boah nee, das ist mir jetzt zu kompliziert. So,"}, {"id": 519, "start": 5168.0, "end": 5174.24, "text": "wenn ich einmal insgesamt durchlaufen lassen könnte, wäre das easy. Also, wenn ich einfach"}, {"id": 520, "start": 5174.24, "end": 5185.44, "text": "bis zum Ende durchlaufen lassen könnte und dann würde ich die Zeit, nee. Da muss ich"}, {"id": 521, "start": 5185.44, "end": 5189.44, "text": "mir jetzt erstmal Gedanken zu machen. Ich glaube, das schieben wir jetzt erstmal auf,"}, {"id": 522, "start": 5189.44, "end": 5195.36, "text": "bis ich ein bisschen mehr Basic Sachen gemacht habe. Genau, ich müsste aus allen Threads"}, {"id": 523, "start": 5195.36, "end": 5204.76, "text": "die Rate addieren, aber, wobei gleichzeitig ist egal, oder? Nee, wisst ihr was ich bräuchte?"}, {"id": 524, "start": 5204.76, "end": 5221.8, "text": "Ich bräuchte eine Liste, wo jeder Thread seine aktuelle Rate reinschreibt und dann"}, {"id": 525, "start": 5221.8, "end": 5227.72, "text": "bräuchte ich noch so eine Art Monitoring Thread, der dann die Rate einmal in einer Sekunde"}, {"id": 526, "start": 5227.72, "end": 5236.24, "text": "ausliest und zusammenrechnet. So was in der Richtung müsste man. Also quasi, ich schreibe"}, {"id": 527, "start": 5236.24, "end": 5243.08, "text": "es nur sinngemäß hin, dass man irgendwie eine Liste hat. So, das ist Rate 1, also keine"}, {"id": 528, "start": 5243.08, "end": 5249.12, "text": "Ahnung, das hier ist Thread 0, das hier ist Thread 1, das 2, 3, 4, 5, 7, 8. So, an jeder"}, {"id": 529, "start": 5249.12, "end": 5254.4, "text": "Stelle schreibt der Thread seine aktuelle Transferrate hin und dann würde ich noch einen"}, {"id": 530, "start": 5254.4, "end": 5260.72, "text": "Thread starten, der einmal in einer Sekunde nachguckt und das ausgibt, was da drin steht."}, {"id": 531, "start": 5260.72, "end": 5269.04, "text": "MonkaS, Alter. Da bin ich mal gespannt, ob wir das gebacken kriegen. Aber von der Idee"}, {"id": 532, "start": 5269.04, "end": 5278.6, "text": "her funktioniert ja meine Messmethode so halbwegs. Wir sollten vielleicht nach 3 Sekunden, Leute,"}, {"id": 533, "start": 5278.6, "end": 5283.08, "text": "wir brechen, ich meine, das sind 100 GB, die lade ich nicht so schnell runter. Wir brechen"}, {"id": 534, "start": 5283.08, "end": 5292.68, "text": "ab, wir brechen ab nach 10 Lesendinger, irgendwie Counter gleich 0. Kann man eigentlich sowas"}, {"id": 535, "start": 5292.68, "end": 5317.52, "text": "hier machen? Was? Heißen Multi Initialization. Assign Values. Hä? Ich bin einer, ich will"}, {"id": 536, "start": 5317.52, "end": 5334.64, "text": "das gleiche Value haben. So. Okay, das ist doch unlesbar as fuck, oder? Das macht man"}, {"id": 537, "start": 5334.64, "end": 5341.6, "text": "doch nicht. Sag mal, Leute, wie würdet ihr das schreiben? So oder untereinander einfach?"}, {"id": 538, "start": 5341.6, "end": 5349.04, "text": "Untereinander ist die schönere Variante, oder? So, oder? Ich glaube, so ist doch die bessere,"}, {"id": 539, "start": 5349.04, "end": 5366.0, "text": "die bessere Variante. AndiProfis hat Python-Channels wie aus Go oder Rust? Naja. Jede Programmiersprache"}, {"id": 540, "start": 5366.0, "end": 5370.04, "text": "hat Channels in diesem Sinn, aber halt nicht Sündagstechnisch in die Sprache integriert"}, {"id": 541, "start": 5370.04, "end": 5377.52, "text": "wie Go. Es gibt in jeder x-beliebigen Sprache sowas wie Channels, aber halt nicht mit der"}, {"id": 542, "start": 5377.52, "end": 5395.2, "text": "schönen Sündags dazu. Warum überhaupt vor der Schleife Initialisieren? Äh. Naja,"}, {"id": 543, "start": 5395.2, "end": 5403.48, "text": "weil ich die Sachen brauche in der Schleife und das Ergebnis nach der Schleife dementsprechend"}, {"id": 544, "start": 5403.48, "end": 5407.36, "text": "kann ich es nicht in der Schleife machen, weil dann das Ergebnis nicht nach der Schleife"}, {"id": 545, "start": 5407.36, "end": 5416.6, "text": "da ist. Na, wenn ich start in die Schleife pack, funktioniert das Ganze ja nicht mehr."}, {"id": 546, "start": 5416.6, "end": 5433.08, "text": "So, Counter. Machen wir mal hier, Counter. Wie war das jetzt? Plus gleich eins, ne? Genau."}, {"id": 547, "start": 5433.08, "end": 5448.76, "text": "Und jetzt, if, Counter, größer oder, wir machen mal größer, gleich fünf und dann"}, {"id": 548, "start": 5448.76, "end": 5471.84, "text": "ausführen. Ja, funktioniert. In dem Fall ist es doch egal, ob das richtig echtes Multiswerding"}, {"id": 549, "start": 5471.84, "end": 5479.16, "text": "ist oder irgendwas, was automatisch lockt oder, oder irgendwie das JavaScript-mäßig"}, {"id": 550, "start": 5479.16, "end": 5485.32, "text": "Event-Loop queued. Wir warten doch eh hauptsächlich IO hier. Das sollte doch eigentlich keine"}, {"id": 551, "start": 5485.32, "end": 5493.44, "text": "großartigen Auswirkungen haben. Wenn ich die Schleife, deine Vorschleife ist in dem Fall"}, {"id": 552, "start": 5493.44, "end": 5499.24, "text": "tatsächlich blöd, weil ich mache hier diese Zuweisung drinnen. Ja, aber wahrscheinlich"}, {"id": 553, "start": 5499.24, "end": 5505.52, "text": "ist es tatsächlich besser in dem Fall. In dem Fall ist es tatsächlich, ne, ich will"}, {"id": 554, "start": 5505.52, "end": 5516.52, "text": "es ja laufen lassen. Fünf Mal oder bis es zu Ende gelesen ist. Das kann ja auch sein."}, {"id": 555, "start": 5516.52, "end": 5523.76, "text": "Letztendlich macht es aber nicht viel Unterschied. Das ist eins, zwei, drei, vier, fünf, sondern"}, {"id": 556, "start": 5523.76, "end": 5542.04, "text": "beim sechsten Mal bricht es ab. Guck mal, größer, gleich fünf. Fünf, bumm. So. Wunderbar."}, {"id": 557, "start": 5542.04, "end": 5549.28, "text": "Eine Sekunde. Alter, es ist la... What the fuck? Ja. Okay, funktioniert. Wunderbar. So und"}, {"id": 558, "start": 5549.28, "end": 5560.48, "text": "das jetzt Multithreaded. Das wird ja, das wird ja was. Eigentlich setzt man auch alles"}, {"id": 559, "start": 5560.48, "end": 5567.4, "text": "unnötige, was nicht im Rift drin ist, außerhalb wie die Variablen. Du meinst, kann ich das"}, {"id": 560, "start": 5567.4, "end": 5574.44, "text": "dann da drin gesche... Achso, ja. Meinst du so? Ja, ist auch deutlich sinniger, oder?"}, {"id": 561, "start": 5574.44, "end": 5581.64, "text": "Was anderes kann ich nicht, gibt es nicht? Da kommt doch ein Request zurück, oder? Kann"}, {"id": 562, "start": 5581.64, "end": 5595.76, "text": "ich nicht so machen? Request? Und dann das hier einfach weglassen? Ne. Warte mal. Einmal"}, {"id": 563, "start": 5595.76, "end": 5617.4, "text": "nicht Response. Response. Response. So. Muss auch gehen. Ach, jetzt close da das aber nicht"}, {"id": 564, "start": 5617.4, "end": 5626.12, "text": "automatisch, ne? Also müsste da ein Response close. Auf der anderen Seite, wenn es irgendeine"}, {"id": 565, "start": 5626.12, "end": 5631.16, "text": "Exception gibt, dann kackt es ab. Dieses Width gibt es doch eh nur für den Fall der"}, {"id": 566, "start": 5631.16, "end": 5635.68, "text": "Fälle, dass es dann finally Block drum macht, oder? Das ist schon, das ist ein bisschen"}, {"id": 567, "start": 5635.68, "end": 5642.0, "text": "wie wenn ich ein, ein, ein Using in C-Sharp mache, vermute ich jetzt einfach mal. Ne,"}, {"id": 568, "start": 5642.0, "end": 5653.56, "text": "dann ist das so schon sinniger. Was, while data gleich und re... Wie das funktioniert?"}, {"id": 569, "start": 5653.56, "end": 5672.2, "text": "Und? Range? Was zum? Das geht? Igitt? Was hab ich denn? Was ist das? Monka. S hoch,"}, {"id": 570, "start": 5672.2, "end": 5675.92, "text": "hoch 3, Alter. Und wie kann ich jetzt auf Range hier drinnen zugreifen? Ah ne, gar"}, {"id": 571, "start": 5675.92, "end": 5689.04, "text": "nicht, muss ich ja nicht. Nein. Funktioniert nicht. Chat. Funktioniert nicht, was ihr gesagt"}, {"id": 572, "start": 5689.04, "end": 5701.12, "text": "habt. Nope. No Pass. Das wäre ja aber auch hässlich für die Nacht. Das ist, ja der"}, {"id": 573, "start": 5701.12, "end": 5711.28, "text": "macht einen und. And? Ne, das, ich will doch keine logische, ich will doch hier keine logische,"}, {"id": 574, "start": 5711.28, "end": 5717.6, "text": "ne, ne, ne, ne. Da kommt jetzt hier als Datatyp True oder so wieder raus. Ne, ne, ne, ne,"}, {"id": 575, "start": 5717.6, "end": 5728.16, "text": "das will ich nicht. Hier soll ja, hier soll ja wirklich die, die, die, die Response drinnen"}, {"id": 576, "start": 5728.16, "end": 5732.04, "text": "stehen. Ne, ich bleib jetzt mal bei dem, was ich hier gemacht hab, man, das funktioniert"}, {"id": 577, "start": 5732.04, "end": 5741.04, "text": "ja ganz gut. So, das mach ich wieder weg. Alter, wie oft hab ich denn die eins bitte"}, {"id": 578, "start": 5741.04, "end": 5753.28, "text": "schon copy pasted? Was? Ok, wunderbar, Kunst. Ok, wie kriegt man das Multithreaded? Jetzt"}, {"id": 579, "start": 5753.28, "end": 5764.96, "text": "wird's, jetzt, jetzt wird's richtig advanced. Also, ok, Multithreaded. Python. Task. Coroutines"}, {"id": 580, "start": 5764.96, "end": 5782.92, "text": "and Tasks. Ok. Creating Tasks. For Range. Async IO. Create Tasks. Background. Oh, jetzt"}, {"id": 581, "start": 5782.92, "end": 5787.96, "text": "wird's, jetzt wird's aber pfeifert. Was war das andere, was jemand hier oben geschrieben"}, {"id": 582, "start": 5787.96, "end": 5792.68, "text": "hat? Threading Thread. Was ist denn da jetzt schon wieder der Unterschied? Warum gibt es"}, {"id": 583, "start": 5792.68, "end": 5818.48, "text": "da verschiedene Dinge? Wann verwende ich was? Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok."}, {"id": 584, "start": 5818.48, "end": 5841.24, "text": "Wann verwende ich was? Ok, ich mach erst mal Threading Thread. Ok. Ok. Das, also, was"}, {"id": 585, "start": 5841.24, "end": 5853.12, "text": "machen wir da jetzt? Import? Ne. Threading? Einfach so? Ok, das muss ich jetzt, das muss"}, {"id": 586, "start": 5853.12, "end": 5859.36, "text": "ich jetzt mal kurz austest. Also, ich sag jetzt, was? Threading? Thread? Und dann? Hab"}, {"id": 587, "start": 5859.36, "end": 5869.16, "text": "ich kein Autocomplete? Das ist schonmal äußerst not Pog? Doch, ich hab Autocomplete. Group?"}, {"id": 588, "start": 5869.16, "end": 5892.08, "text": "Target. Alter, wie? Target. Also, Target ist dann Measure. Aber das, das, das braucht"}, {"id": 589, "start": 5892.08, "end": 5912.68, "text": "ja ein Argument. Ah, hier. Arcs. Arcs. Und das ist dann was? So? Und jetzt sag ich irgendwie,"}, {"id": 590, "start": 5912.68, "end": 5917.56, "text": "was kommt denn da jetzt zurück? Irgendwie ein Thread? Oder so? Und dann sag ich Threading"}, {"id": 591, "start": 5917.56, "end": 5939.12, "text": "Join? Ne. Hab ich kein Plan ab, was ich mache? Einfach so Join? Ne. T1 Join? Join? Ah. Run?"}, {"id": 592, "start": 5939.12, "end": 5949.52, "text": "Join? Start. Was ist denn da jetzt der Unterschied? Start. Also, muss ich erst jetzt noch sagen"}, {"id": 593, "start": 5949.52, "end": 5963.04, "text": "Start? Und dann Join? Oder wie? Oder wo? Ne. Wow, wow, wow. 33 were given? What? Jedes"}, {"id": 594, "start": 5963.04, "end": 5973.88, "text": "Character, oder? Wie übergebe ich denn da Arcs? Bei den Arcs musst du ein Komma hinter"}, {"id": 595, "start": 5973.88, "end": 5993.4, "text": "die Klammer machen, dass er Eck. Hinter die Klammer? So? Oder so? Alter, 5 Head. Da wär"}, {"id": 596, "start": 5993.4, "end": 5998.68, "text": "ich ja nie drauf gekommen. Kann ich nicht, warum kann ich nicht einfach sowas hier machen?"}, {"id": 597, "start": 5998.68, "end": 6013.44, "text": "Jetzt mal was anderes. Jetzt mal was bescheuertes. Wie ist denn die Lambda Syntax in Python?"}, {"id": 598, "start": 6013.44, "end": 6039.2, "text": "Wie sieht denn das aus? So? Also, kann ich nicht sowas hier machen? Ne. Aber wie? Was?"}, {"id": 599, "start": 6039.2, "end": 6054.56, "text": "Das check ich nicht. Das kapier ich nicht. Ach, man muss da einen Doppelpunkt dahinter"}, {"id": 600, "start": 6054.56, "end": 6069.16, "text": "machen, oder wie? So, so dachte ich mir das eigentlich jetzt. Ja. Da spar ich mir nämlich"}, {"id": 601, "start": 6069.16, "end": 6082.12, "text": "diesen ganzen Arc-Krempel. Ja, ok, nice. So, und jetzt starte ich das mehrfach. Ich copy"}, {"id": 602, "start": 6082.12, "end": 6103.52, "text": "paste das mal zum testen. Ja, das ist die T2. Ja. Punkt zioniert. Ok. Also, jetzt machen"}, {"id": 603, "start": 6103.52, "end": 6121.24, "text": "wir eine Schleife. Oh, wie sieht eine Vorloop aus? Ich weiß ja nicht mal, wie man eine publische"}, {"id": 604, "start": 6121.24, "end": 6137.52, "text": "Vorschleife macht. For range, range, range. Alles klar. Ok. For i in range. Das da. T1."}, {"id": 605, "start": 6137.52, "end": 6150.0, "text": "T1 start. Und jetzt muss ich das in irgendeine Liste schreiben. Keine Ahnung. Threads. Ich"}, {"id": 606, "start": 6150.0, "end": 6155.72, "text": "hab keine Ahnung, ob das irgendwie Sinn ergibt. Und der Pythonic Way ist, was ich hier mache."}, {"id": 607, "start": 6155.72, "end": 6168.08, "text": "Threads. Push. Add. Insert. Er pennt. Ja, meine Güte, Alter. Ich hätte fast alles"}, {"id": 608, "start": 6168.08, "end": 6182.88, "text": "durch gehabt. Ok. Und gibt es jetzt sowas wie threading weight auf eine Liste oder so?"}, {"id": 609, "start": 6182.88, "end": 6203.92, "text": "Threading weight. Python thread join list. Ja, auf die Idee wäre ich jetzt auch gekommen."}, {"id": 610, "start": 6203.92, "end": 6212.84, "text": "Gibt es da nicht so, gibt es da nicht irgendwas fertiges? So alles in dieser Collection warten"}, {"id": 611, "start": 6212.84, "end": 6230.88, "text": "wir mal. Concurrent Futures. Was? Submit. Ah, boah, das ist also die Standard Library"}, {"id": 612, "start": 6230.88, "end": 6246.04, "text": "ist wirklich Sixhead. Da gibt es für alles 20 Varianten. Das Thread Pool Executor. Ok,"}, {"id": 613, "start": 6246.04, "end": 6252.52, "text": "das ist mir gerade zu high IQ. Wir machen jetzt einfach das gleiche noch mal. Aber jetzt"}, {"id": 614, "start": 6252.52, "end": 6262.16, "text": "kann ich so hier machen. Vor. In. Threads. Und dann kann ich sagen. E. Oh, guck mal, der"}, {"id": 615, "start": 6262.16, "end": 6277.08, "text": "erkennt, dass das ein Thread ist. Sixhead Time. Aha. Guck mal da. Funktioniert. Und"}, {"id": 616, "start": 6277.08, "end": 6283.96, "text": "was habt ihr eben gesagt? Soll ich jetzt List Com. Das kenne ich. Warum Threads und nicht"}, {"id": 617, "start": 6283.96, "end": 6288.28, "text": "S und I. Oh, weil ich keine Ahnung habe, was davon die Vorzüge sind und was besser und"}, {"id": 618, "start": 6288.28, "end": 6303.92, "text": "schlechter ist. Das erst mal ausprobieren muss. List Comprehension. X vor X in fruits,"}, {"id": 619, "start": 6303.92, "end": 6315.0, "text": "F, A in X. Massive. So muss das sein. Also sprich anstatt sowas. Wir machen mal die"}, {"id": 620, "start": 6315.0, "end": 6325.08, "text": "Kurzvariante von also. Nee Moment. Sagt mal gibt es gibt es nicht sowas wie Link, sowas"}, {"id": 621, "start": 6325.08, "end": 6340.84, "text": "wie Each oder so. Each nee sowas gibt es hier nicht. Gibt es. Weißen List. Ich. Das"}, {"id": 622, "start": 6340.84, "end": 6359.6, "text": "sowas. Okay, nee, ich glaube, ich lasse das einfach so. Aber das würde ich jetzt machen."}, {"id": 623, "start": 6359.6, "end": 6376.04, "text": "S wie vor I in range 6. Das kann man. Das bringt mir doch hierfür gar nichts. Das bringt"}, {"id": 624, "start": 6376.04, "end": 6381.08, "text": "mir doch hierfür gar nichts. Hast du schon mal ein Replet ausprobiert? Weiß nicht,"}, {"id": 625, "start": 6381.08, "end": 6389.04, "text": "was das ist. Jetzt habe ich es gelöscht. Ich kann nur. Leute, das bleibt jetzt. Das"}, {"id": 626, "start": 6389.04, "end": 6406.08, "text": "bleibt jetzt so. Genug. Das reicht jetzt. Dann brauchst du die for each nicht? Moment,"}, {"id": 627, "start": 6406.08, "end": 6419.92, "text": "das geht. Wartet mal. Das geht. T join. T in. Ach ja. Ganz ehrlich Leute, da gefällt"}, {"id": 628, "start": 6419.92, "end": 6429.8, "text": "mir das untere aber besser. Da gefällt mir das untere aber besser als das obere. Kann"}, {"id": 629, "start": 6429.8, "end": 6436.68, "text": "man sich jetzt drüber streiten? Chat, was sagt ihr? Das da? Okay, wir machen Umfrage."}, {"id": 630, "start": 6436.68, "end": 6455.04, "text": "Das interessiert mich jetzt. A oder B. Das oder das. Das oder das. Ob's, jetzt habe"}, {"id": 631, "start": 6455.04, "end": 6462.4, "text": "ich mich vercopy pastet. Okay Leute, das geht nicht. Ich kann. Okay, das hier ist A und"}, {"id": 632, "start": 6462.4, "end": 6480.84, "text": "das hier ist B. Also. Was findet ihr besser? A oder B? A oder B? A, B. Eine Minute Abstimmung."}, {"id": 633, "start": 6480.84, "end": 6501.24, "text": "Umfrage beginnen. A oder B? 50, 50 ziemlich genau."}, {"id": 634, "start": 6501.24, "end": 6529.72, "text": "Gleich ist der Paul vorbei. B? Ach so, ja, ja. Ich persönlich finde B auch schöner."}, {"id": 635, "start": 6529.72, "end": 6535.6, "text": "Irgendwie finde ich das griffiger, aber wahrscheinlich ist das die Frage, wie viel Pausen man schon"}, {"id": 636, "start": 6535.6, "end": 6546.12, "text": "gemacht hat, ob man das schöner oder weniger schön findet. B. Ich kann aber, ich kann"}, {"id": 637, "start": 6546.12, "end": 6550.44, "text": "aber das Pro und Contra, also viel Unterschied gibt es ja nicht, aber ich kann es verstehen,"}, {"id": 638, "start": 6550.44, "end": 6561.64, "text": "wenn einer A mehr mag als B. Also, so will man das. Das erste als List-Completion schreiben"}, {"id": 639, "start": 6561.64, "end": 6567.2, "text": "ist Pain's Champ, oder? Das will man eher nicht. Also wir starten, okay, wir starten"}, {"id": 640, "start": 6567.2, "end": 6575.84, "text": "nur mal vier Threads, das sollte reichen. So. Ich bin mir immer noch unschlüssig, wie"}, {"id": 641, "start": 6575.84, "end": 6587.96, "text": "ich das jetzt gescheit mache. Ich muss ja das Ergebnis. Ich mache jetzt mal was ekliges"}, {"id": 642, "start": 6587.96, "end": 6595.6, "text": "Chat, weil ich nicht weiß, wie ich es besser machen soll. Ich weiß nicht, wie ich es besser"}, {"id": 643, "start": 6595.6, "end": 6609.28, "text": "machen soll. Das hier ist die Nummer und ich mache jetzt eine Liste mit vier, irgendwie"}, {"id": 644, "start": 6609.28, "end": 6619.44, "text": "keine Ahnung, Rates. Ihr könnt mir ja sagen, wie es besser geht. So, und das hier ist I."}, {"id": 645, "start": 6619.44, "end": 6639.12, "text": "Fängt es auch bei Null an. So, und die Raid, die Raid, die kommt jetzt einfach in I. Raid."}, {"id": 646, "start": 6639.12, "end": 6663.48, "text": "Warum geht das nicht? Unexpected Float? Hä? Ah, Moment. Hast du shadowed irgendwas? Warum"}, {"id": 647, "start": 6663.48, "end": 6674.4, "text": "shadowed das da irgendwas? Welches Outer Scope? Was will er von mir? Hä? Okay, keine Ahnung,"}, {"id": 648, "start": 6674.4, "end": 6696.84, "text": "ID. Das heißt jetzt einfach ID. Ah, das ist Build-In. Meine Güte. Keg W. Keg W. So."}, {"id": 649, "start": 6696.84, "end": 6705.56, "text": "Und er sagte mir, es ist ein Float. Na, meinetwegen ist es halt ein Float, wenn es... Nee. Ja,"}, {"id": 650, "start": 6705.56, "end": 6715.48, "text": "was denn jetzt? Ach nee, Moment. Doch, hä? Du schreibst in eine externe... Ich weiß,"}, {"id": 651, "start": 6715.48, "end": 6725.56, "text": "ich weiß, aber wo ist das Problem? Wo ist denn das Problem? Unexpected Types. Warum?"}, {"id": 652, "start": 6725.56, "end": 6737.28, "text": "Moment, ich will ein Int. Int ist doch schon gut. Ich meine, das ist ein Index. Ach, das"}, {"id": 653, "start": 6737.28, "end": 6743.64, "text": "hier ist... Moment, das hier ist Unexpected, oder? Das hier ist Unexpected. Muss ich da"}, {"id": 654, "start": 6743.64, "end": 6754.84, "text": "F dahinter schreiben für ein Float oder muss ich 0,0 machen, dass das checkt? So? Ah,"}, {"id": 655, "start": 6754.84, "end": 6769.36, "text": "so besser. Okay, gut. Jetzt, jetzt, also... So, da schreibt es jetzt... Ich meine, mir"}, {"id": 656, "start": 6769.36, "end": 6778.56, "text": "fällt... Das ist wirklich eklig mit der globalen Liste, aber... Mir fällt gerade wirklich"}, {"id": 657, "start": 6778.56, "end": 6783.8, "text": "nichts anderes ein. So, und hier unten machen wir das jetzt folgendermaßen. Wir machen"}, {"id": 658, "start": 6783.8, "end": 6804.24, "text": "hier vor dem Join, wir machen eine Schleife. Vor E in Range 10, mir vollkommen egal. So,"}, {"id": 659, "start": 6804.24, "end": 6811.96, "text": "und jetzt Rind Ranges. Boah, das muss man doch schöner machen können. Wie rechne ich"}, {"id": 660, "start": 6811.96, "end": 6825.84, "text": "das jetzt alles zusammen? Gibt es sowas wie Zoom oder so? Ranges? Zoom? Nee. Zoom Ranges?"}, {"id": 661, "start": 6825.84, "end": 6843.56, "text": "Nee, geht nicht. Ach, Rates, nicht Ranges. So, und ob das jetzt... Hey! Wait a minute,"}, {"id": 662, "start": 6843.56, "end": 6868.4, "text": "wait a minute. Das Print muss weg. Threading? Sleep? Time? Sleep? Sleep? So, okay, und funktioniert"}, {"id": 663, "start": 6868.4, "end": 6881.64, "text": "das jetzt theoretisch? Leute, wir haben angeblich mehr Bandbreite, als meine Leitung überhaupt"}, {"id": 664, "start": 6881.64, "end": 6895.72, "text": "kann. So wirklich gut funktioniert es nicht, was ich hier gebastelt habe. Wo davon hast"}, {"id": 665, "start": 6895.72, "end": 6912.96, "text": "du diesen Trick? Kann es sein, dass du vergessen hast, durch die Anzahl der Threads zu teilen?"}, {"id": 666, "start": 6912.96, "end": 6922.4, "text": "Nee, ich will nicht durch die Anzahl der Threads teilen. Die Leitung soll ausgelastet sein."}, {"id": 667, "start": 6922.4, "end": 6927.68, "text": "Die Threads können so viel machen, wie sie wollen. Ich glaube, ich weiß, warum das geht."}, {"id": 668, "start": 6927.68, "end": 6932.52, "text": "Ich weiß, warum das nicht geht. Weil ich hier immer nur pro Sekunde reinschreibe und pro"}, {"id": 669, "start": 6932.52, "end": 6940.28, "text": "Sekunde ist halt viel zu lang. Da hat ein Thread mal viel gemacht, ein weniger. Nein,"}, {"id": 670, "start": 6940.28, "end": 6945.12, "text": "wo davon lässt er auch nicht kurzzeitig mehr Traffic zu? Das ist einfach miesgemessen,"}, {"id": 671, "start": 6945.12, "end": 6951.04, "text": "was ich da mache. Meine Einheiten sind falsch? Nee, meine Einheiten sind nicht falsch. Warum?"}, {"id": 672, "start": 6951.04, "end": 6959.04, "text": "Ah, meine Einheiten sind falsch. Weil es Raid ist. Und Raid ist, Moment, Moment, meine"}, {"id": 673, "start": 6959.04, "end": 6980.88, "text": "Einheiten sind tatsächlich falsch. Ich muss sowas hier machen. Bites to megabit. Ah,"}, {"id": 674, "start": 6980.88, "end": 6987.92, "text": "das ist doch, das ist gar nicht schlecht, Leute. Das ist ziemlich, das ist ziemlich gut. Das"}, {"id": 675, "start": 6987.92, "end": 6996.32, "text": "funktioniert. Zwar nicht so, nicht so nice, wie gedacht. Übrigens, das mit dem Join,"}, {"id": 676, "start": 6996.32, "end": 7000.88, "text": "das mit dem Join kann ich mir einfach mal komplett schenken. Das brauche ich nicht."}, {"id": 677, "start": 7000.88, "end": 7008.68, "text": "Wir lassen es einfach 10 Sekunden laufen und wir schenken uns auch jeglichen, jeglichen"}, {"id": 678, "start": 7008.68, "end": 7022.92, "text": "Counter. Wofür das lieb? Naja, dass ich will nicht 100% CPU-Last verursachen. So. Ja,"}, {"id": 679, "start": 7022.92, "end": 7032.24, "text": "Funst. Du musst in der Raids-Liste den Wert wieder auf Null setzen, wenn ein Thread durch"}, {"id": 680, "start": 7032.24, "end": 7036.28, "text": "ist. Das ist richtig, aber die Threads sind nicht durch, weil die einen Terabyte runterladen."}, {"id": 681, "start": 7036.28, "end": 7050.76, "text": "Aber du hast recht, das müsste ich. Aber bevor... Oh. Was ist jetzt? Ach so, da ist 10 Mal durchgelaufen."}, {"id": 682, "start": 7050.76, "end": 7063.44, "text": "Okay. Warum beendet der sich nicht, wenn er 10 Mal durchgelaufen ist? Keck. Lass mal 5"}, {"id": 683, "start": 7063.44, "end": 7075.04, "text": "Mal durchlaufen. Warum beendet er sich jetzt hier nicht? Weil noch Threads offen sind?"}, {"id": 684, "start": 7075.04, "end": 7086.24, "text": "Sollte er das nicht checken? Und einfach sagen hier und Tschüss, Goodbye? Cancel gibt es"}, {"id": 685, "start": 7086.24, "end": 7100.04, "text": "nicht, oder? Schalt um auf Demon Threads. Kann ich die abschießen? T1? Wie schießt"}, {"id": 686, "start": 7100.04, "end": 7105.36, "text": "man Threads ab? Das sagt man ja eigentlich, dass man Threads nicht abschießt, sondern"}, {"id": 687, "start": 7105.36, "end": 7112.12, "text": "eigentlich sagt man Threads sollen sich ordnungsgemäß beenden. Was? List Clear? Nee, das bringt"}, {"id": 688, "start": 7112.12, "end": 7118.24, "text": "doch gar nichts. Du meinst Threads Clear, aber davon hören die doch jetzt auch nicht"}, {"id": 689, "start": 7118.24, "end": 7127.68, "text": "auf. Ich warte doch gar nicht. Ich warte aktuell. Doch. Nee, warum sollte Threads Clear"}, {"id": 690, "start": 7127.68, "end": 7136.64, "text": "irgendwas bewirken? Also wenn das funktioniert, würde mich äußerst wundern. Ich warte doch"}, {"id": 691, "start": 7136.64, "end": 7142.24, "text": "überhaupt nicht explizit da drauf. Ich mach nur die Liste leer, die Threads laufen immer"}, {"id": 692, "start": 7142.24, "end": 7151.68, "text": "noch. Nee guck, es hängt immer noch, sag ich doch. Aber wenn ich die in Demon Modus"}, {"id": 693, "start": 7151.68, "end": 7155.56, "text": "versetze, dann laufen die wahrscheinlich weiter im Hintergrund, selbst wenn mein Python Programm"}, {"id": 694, "start": 7155.56, "end": 7169.76, "text": "weg ist. Nee? Machen sie nicht? Oder ich sag, was war das? Kill? Gibt's nicht, oder?"}, {"id": 695, "start": 7169.76, "end": 7181.16, "text": "Python Thread Kill. Das ist hochgradig eklig, was ich hier mache, aber... Man kann das nicht"}, {"id": 696, "start": 7181.16, "end": 7193.92, "text": "killen. Der Multiprocess Thread, das könnte ich mal, da könnte ich den Prozess abschießen."}, {"id": 697, "start": 7193.92, "end": 7200.08, "text": "Das, das ersitzt... Nee, ich will nicht joinen, ich will, das soll einfach, das soll einfach"}, {"id": 698, "start": 7200.08, "end": 7207.2, "text": "abbrechen am Ende. Ich würde es eh nie so machen. Das ist jetzt nur, weil ich gucken"}, {"id": 699, "start": 7207.2, "end": 7227.72, "text": "wollte, ob es funktioniert. Aber es funktioniert von der Idee her. BW? BTOP? Nee. Linux Bandwidth"}, {"id": 700, "start": 7227.72, "end": 7237.88, "text": "Monitor. Alter, jetzt wird rumgespammt, äh. Nee, nee, nee, nee. Was war das? EFTOP? Nee,"}, {"id": 701, "start": 7237.88, "end": 7243.2, "text": "nee, nee, nee. Nload, Nload, Nload war nice. Will einfach mal wissen, ob der das dann auch"}, {"id": 702, "start": 7243.2, "end": 7258.64, "text": "richtig beendet. Nload? Alter, wie viel haben wir denn hier jetzt, Mann? Nee, wie hieß der"}, {"id": 703, "start": 7258.64, "end": 7269.16, "text": "Kram? Nload? BMON meinte ich. Ah, das haben wir nämlich auch installiert. So, also macht"}, {"id": 704, "start": 7269.16, "end": 7290.56, "text": "der denn jetzt hier was? Bandbreite pro Sekunde. Zeig mal her. Ja. Das Funst, 50 MB. Das hier,"}, {"id": 705, "start": 7290.56, "end": 7301.32, "text": "ok. Wenn ich es beende, ist es alles weg. Ok, was hat der Chat gesagt? Ich soll heißen"}, {"id": 706, "start": 7301.32, "end": 7323.88, "text": "Demon Threads verwenden. Zeig her. Import, Threading, Import, Sternchen. Set Demon, true,"}, {"id": 707, "start": 7323.88, "end": 7344.96, "text": "null W, ok. Oh, soll man das nicht mal verwenden? Ist es Set? Attribute? Äh. Äh. Keine Ahnung,"}, {"id": 708, "start": 7344.96, "end": 7364.68, "text": "true. Ah, ich hab vorher schon gestartet. So. Ah, jetzt beendet sich alles am Ende."}, {"id": 709, "start": 7364.68, "end": 7380.92, "text": "Aber aus irgendwelchen Gründen ist er jetzt langsamer als vorher. Muss ich T1? Ah, so?"}, {"id": 710, "start": 7380.92, "end": 7390.32, "text": "Warum ist er jetzt langsamer als vorher? What the f... Ach, ich starte das gar nicht"}, {"id": 711, "start": 7390.32, "end": 7410.08, "text": "mehr. Ah, nee, jetzt passt es. Ok, nach 10 Mal beendet er sich. Ok, nice. So, schön"}, {"id": 712, "start": 7410.08, "end": 7420.08, "text": "ist nun wirklich was anderes. Aber es funktioniert. Also, wir lesen das alle 10 Sekunden aus."}, {"id": 713, "start": 7420.08, "end": 7425.96, "text": "So, und jetzt, und jetzt können wir das hier natürlich nochmal ne ganze Ecke, ne ganze"}, {"id": 714, "start": 7425.96, "end": 7431.28, "text": "Ecke schöner machen. Und zwar, wir können uns hier drinnen theoretisch sogar das mit"}, {"id": 715, "start": 7431.28, "end": 7437.76, "text": "dem Elapsed, Elapsed sparen. Mal gucken, mal gucken wie hoch dann die CPU-Auslastung wird."}, {"id": 716, "start": 7437.76, "end": 7455.24, "text": "Mal gucken. Ach nee, Moment, das mit dem Reset. Warte mal, nee, nee, nee, nee. Wir"}, {"id": 717, "start": 7455.24, "end": 7468.2, "text": "aktualisieren das jetzt jede, jede, jede 100 Millisekunden. Wow. Ja, die erste Messung"}, {"id": 718, "start": 7468.2, "end": 7473.4, "text": "vielleicht nicht stimmt, kann ich, kann ich verstehen. Jetzt ist es ziemlich am Limit,"}, {"id": 719, "start": 7473.4, "end": 7478.88, "text": "ne? Jetzt ist es, jetzt ist die Leitung eigentlich komplett, komplett ausgelastet, wenn ich das"}, {"id": 720, "start": 7478.88, "end": 7498.52, "text": "so richtig sehe. Oh ja, bam, 50 MB, 52 MB. Ja, ich mein, das müsste man wahrscheinlich,"}, {"id": 721, "start": 7498.52, "end": 7503.84, "text": "wenn man das wirklich genau messen will, schon, man könnte das sicherlich noch deutlich"}, {"id": 722, "start": 7503.84, "end": 7510.16, "text": "besser machen. So, aber jetzt gucken wir uns mal was anderes an. Was ist denn jetzt der"}, {"id": 723, "start": 7510.16, "end": 7534.28, "text": "Unterschied zwischen, was ist denn jetzt der Unterschied zwischen dem hier? Ok, Python"}, {"id": 724, "start": 7534.28, "end": 7539.36, "text": "Threads versus AsyncIO. Jetzt Five-Header-Time, Alter. Wow, das ist mir deutlich zu lang."}, {"id": 725, "start": 7539.36, "end": 7546.56, "text": "Ich brauche Stackoverflow-Antwort für, für Noobs. Alter, was sind das alles für Riesendinger?"}, {"id": 726, "start": 7546.56, "end": 7562.4, "text": "Yeah, gut, das ist, das kommt mir jetzt zugute, weil ansonsten hätte ich hier garantiert"}, {"id": 727, "start": 7562.4, "end": 7565.92, "text": "irgendwelche Exceptions, weil ich versucht habe, auf das gleiche Objekt gleichermaßen"}, {"id": 728, "start": 7565.92, "end": 7573.84, "text": "zuzugreifen. Twitch geht, klar. Download ist jetzt erstmal nicht so wichtig, denke ich."}, {"id": 729, "start": 7573.84, "end": 7578.0, "text": "Ich kriege auch meinen vollen Upload nicht voll, dadurch, dass ich noch, äh, Download"}, {"id": 730, "start": 7578.0, "end": 7595.24, "text": "nicht voll, ich uploade. Async allows concurrency within a single thread. This gives you as"}, {"id": 731, "start": 7595.24, "end": 7613.28, "text": "much more control of the task switching. Moment. Jetzt blicke ich nicht mehr durch. Es gibt"}, {"id": 732, "start": 7613.28, "end": 7619.0, "text": "Python Threads, die ineffizient sind. Dann gibt es quasi so eine Art JavaScript Event"}, {"id": 733, "start": 7619.0, "end": 7626.48, "text": "Loop mit, mit Async Await oder sowas. Und dann gibt es Multiprocessing, wo er dann aber"}, {"id": 734, "start": 7626.48, "end": 7635.28, "text": "wirklich die komplette Hardware ausnutzen kann. Das heißt, der Fork dann den, das heißt,"}, {"id": 735, "start": 7635.28, "end": 7640.12, "text": "der Fork dann den Mainprozess irgendwie achtmal und braucht achtmal so viel Speicher oder"}, {"id": 736, "start": 7640.12, "end": 7656.28, "text": "wie oder was, hä? Python Multiprocessing Thread. Ich sehe es schon, das ist Sixheadiger, als"}, {"id": 737, "start": 7656.28, "end": 7671.6, "text": "ich das gedacht habe. Was from Multiprocessing Import Pool? Pool 5 SP. What?"}, {"id": 738, "start": 7686.28, "end": 7701.84, "text": "Und warum kommt hier eins, vier, neun raus? Ach so, weil er, weil er das irgendwie zusammen"}, {"id": 739, "start": 7701.84, "end": 7713.92, "text": "rechnet oder? Ach, keine Ahnung. Was hat's, was hat's hier mit, mit Pool auf sich? Über"}, {"id": 740, "start": 7713.92, "end": 7719.2, "text": "den Pool kann deine Mainfunktion, kann deine Funktion den Return Wert an die, an den Mainprozess"}, {"id": 741, "start": 7719.2, "end": 7729.08, "text": "zurückliefern. Aha. Lass mal kurz überlegen, wie würde ich da meist mal Threads oder Multiprocess"}, {"id": 742, "start": 7729.08, "end": 7734.44, "text": "außen vor, wie würde ich das denn jetzt sagen, sagen wir mal in, in, sagen wir mal in.NET,"}, {"id": 743, "start": 7734.44, "end": 7737.84, "text": "wie würde ich das denn jetzt ordentlich machen? Muss ich mal kurz, mal kurz in mich gehen."}, {"id": 744, "start": 7737.84, "end": 7746.88, "text": "Ich meine, so global Ding kann man machen, aber die schönste Variante wäre eigentlich,"}, {"id": 745, "start": 7746.88, "end": 7755.44, "text": "wenn ich eine Klasse hätte, die, die ein Threadsafe Property hat, wobei ich mich ja"}, {"id": 746, "start": 7755.44, "end": 7761.6, "text": "in Python anscheinend um Threadsafe, Safety nicht kümmern muss und das lese ich dann"}, {"id": 747, "start": 7761.6, "end": 7767.28, "text": "aus. Dann bräuchte ich nämlich so global, global Ding hier nicht. Ok, dann fang mal"}, {"id": 748, "start": 7767.28, "end": 7778.08, "text": "an, wie macht man denn eine ordentliche Klasse in Python? Gibt's Logs? Ich hab keinen Plassen,"}, {"id": 749, "start": 7778.08, "end": 7785.72, "text": "schimmer, ob es Logs gibt. Weil anderweitig oder aber, was auch funktionieren würde ist,"}, {"id": 750, "start": 7785.72, "end": 7797.64, "text": "ne, würde nicht, würde nicht funktionieren. Also Klasse, gibt's da kein Makro für? Python"}, {"id": 751, "start": 7797.64, "end": 7810.2, "text": "Klasse, Example, Example ist immer gut. Klasse, My Klasse, x gleich fünf. Inlet ist so was"}, {"id": 752, "start": 7810.2, "end": 7815.96, "text": "wie ein Constructor, das kenne ich noch. Das kann ich mir noch dran erinnern. Also Public"}, {"id": 753, "start": 7815.96, "end": 7819.72, "text": "Klasse, wir nennen das hier jetzt einfach mal Speed Test. Mir fällt grad nichts anderes"}, {"id": 754, "start": 7819.72, "end": 7827.48, "text": "ein. Speed Test, wir brauchen global, gibt es sowas wie Public? Nee, Public muss man"}, {"id": 755, "start": 7827.48, "end": 7834.08, "text": "nicht. Warte mal Leute, wie war das in Python? Man muss, man macht das hier da vor, wenn"}, {"id": 756, "start": 7834.08, "end": 7842.8, "text": "man will, dass es private ist, gell? Aber das ist nur quasi ein Hint, dass es private"}, {"id": 757, "start": 7842.8, "end": 7851.28, "text": "ist und nicht wirklich private. Global, ne. Also würde ich jetzt quasi sagen sowas wie"}, {"id": 758, "start": 7851.28, "end": 7880.44, "text": "hier Don't Load Raid. Heck, muss ich das weglassen, wenn ich nichts übergebe? Ne. Gibt"}, {"id": 759, "start": 7880.44, "end": 7892.52, "text": "es, ach Self, Self muss man da immer über. Aha, Self ist quasi sowas wie This. Ok, gibt"}, {"id": 760, "start": 7892.52, "end": 7901.88, "text": "es irgendeine Schreibweise für Public, Public Properties? Sollte man die irgendwie groß"}, {"id": 761, "start": 7901.88, "end": 7915.4, "text": "schreiben oder nicht, oder ist das egal? Was heißt denn Public Property? Klein? Private"}, {"id": 762, "start": 7915.4, "end": 7936.0, "text": "und Public Attributes. Ach Attributes heißt was da, ok. Das ist eine bescheuerte Seite,"}, {"id": 763, "start": 7936.0, "end": 7949.64, "text": "die echt, does not have, ja. Add Property, was zum, ah das ist quasi so eine Getter,"}, {"id": 764, "start": 7949.64, "end": 7955.52, "text": "das ist quasi eine Getterfunktion oder sowas, gell? Würde ich jetzt einfach mal raten,"}, {"id": 765, "start": 7955.52, "end": 7961.12, "text": "wenn man da Add Property oben dran setzt. Warum sich überhaupt die Mühe machen, wir"}, {"id": 766, "start": 7961.12, "end": 7976.16, "text": "machen einfach Public Variable und gut ist. Obei. Warum nicht? Warum nicht? Warum nicht?"}, {"id": 767, "start": 7976.16, "end": 7983.68, "text": "Wisst ihr was wir machen? Ich hab ne Idee. Also wir machen sowas wie hier Self, ne. Warum"}, {"id": 768, "start": 7983.68, "end": 8009.92, "text": "ist das jetzt undingst Reference? Self sein? Ne. Äh, pff, keine Ahnung. Moment, das kann"}, {"id": 769, "start": 8009.92, "end": 8022.68, "text": "ich direkt zuweisen, das nicht. Ach ansonsten ist es statisch. Moment, wenn ich sowas hier"}, {"id": 770, "start": 8022.68, "end": 8031.08, "text": "mache bedeutet das, das ist Static, also ich könnte jetzt quasi, ach so, ach so, das will"}, {"id": 771, "start": 8031.08, "end": 8038.24, "text": "ich ja gar nicht, ich will das so haben, also irgendwie. Rate. So, Underscore, was ist der"}, {"id": 772, "start": 8038.24, "end": 8047.12, "text": "Unterschied zwischen Underscore und Underscore? Underscore, Underscore. So, Self, Rate, Rate."}, {"id": 773, "start": 8047.12, "end": 8060.52, "text": "So, und das wollen wir aber nicht returnen, sondern, da wollen wir jetzt das mitmachen."}, {"id": 774, "start": 8060.52, "end": 8086.84, "text": "Self, Rate, Exzellent, wo ist das Problem jetzt? End of Statement Expected. Ach ne,"}, {"id": 775, "start": 8086.84, "end": 8101.96, "text": "ich blick, hä? Was ist denn jetzt das für? Was hat er denn jetzt für Schmerzen? Rate,"}, {"id": 776, "start": 8101.96, "end": 8115.04, "text": "Rate. Ne, die Klammern sind doch richtig so. Ne, die Klammer ist zu viel. Kacknub, Alter,"}, {"id": 777, "start": 8115.04, "end": 8135.68, "text": "die Klammer ist zu viel. Und jetzt? Rate, Rate. Ne, das schreibe ich gar nicht hier hin"}, {"id": 778, "start": 8135.68, "end": 8142.88, "text": "oder was, das würde ich nur hier machen? Ach so, das muss ich gar nicht da oben hinschreiben,"}, {"id": 779, "start": 8142.88, "end": 8148.04, "text": "das würde ich einfach hier festlegen oder, aha, MonkaS, Alter, da muss ich jetzt erstmal"}, {"id": 780, "start": 8148.04, "end": 8165.88, "text": "drauf kommen. Okay, wir nähern uns, wir nähern uns. So, und jetzt packe ich im Prinzip dieses"}, {"id": 781, "start": 8165.88, "end": 8182.28, "text": "ganze Ding da rein. So, die ID brauche ich nimmer, cool, das hier brauche ich nimmer,"}, {"id": 782, "start": 8182.28, "end": 8196.68, "text": "das hier brauche ich im Prinzip auch nimmer. Rate. So, Self, Dot, Rate. Was hat er denn"}, {"id": 783, "start": 8196.68, "end": 8201.12, "text": "jetzt für Schmerzen? Unresolved Reference Self. Ach, weil ich Self hier davor wieder"}, {"id": 784, "start": 8201.12, "end": 8212.4, "text": "übergeben muss oder was, aha. Okay, das ist in der Tat äußerst gewöhnungsbedürftig,"}, {"id": 785, "start": 8212.4, "end": 8222.92, "text": "muss ich sagen. Glaubst du, Getter, Syntax ist anders als das? Okay, werden wir jetzt"}, {"id": 786, "start": 8222.92, "end": 8231.04, "text": "ja gleich sehen. Comment, aber das kommentieren wir das mal aus. Denken wir mal, ob das funktioniert."}, {"id": 787, "start": 8231.04, "end": 8242.24, "text": "Der kommt nicht so ganz klar hier, oder? Print. So, das sollte doch jetzt soweit funktionieren,"}, {"id": 788, "start": 8242.24, "end": 8248.48, "text": "was ich gemacht habe. Der updated jetzt die Rate. Okay, ähm, let, nein nicht let, also"}, {"id": 789, "start": 8248.48, "end": 8262.0, "text": "speedtest gleich new speedtest, so? Ne, äh, da sollte ich die URL auch hier übergeben."}, {"id": 790, "start": 8262.0, "end": 8274.76, "text": "Oh, einfach so? Schau mal, NeoWim ausbricht, klar, ich hab früher nur Wim verwendet, ich"}, {"id": 791, "start": 8274.76, "end": 8283.44, "text": "hatte irgendwie 800 Zeilen Wimrc und 500 Plugins drin. Einfach so, okay. Speedtest, Rate, da"}, {"id": 792, "start": 8283.44, "end": 8292.4, "text": "kann ich das, also jetzt würde ich hier das starten. Das ist nicht so schön, das wäre"}, {"id": 793, "start": 8292.4, "end": 8298.4, "text": "deutlich sinnvoller, wenn ich die URL im Konstruktor übergebe, weil dafür ist er ja letztendlich"}, {"id": 794, "start": 8298.4, "end": 8313.84, "text": "da. Self. Okay, das ist für mich echt gewöhnungsbedürftig, diese Schreibweise. So, und hier kommt die"}, {"id": 795, "start": 8313.84, "end": 8320.52, "text": "URL weg. Kann man, kann man das hier oben auch annotaten irgendwie, dass ich jetzt sage,"}, {"id": 796, "start": 8320.52, "end": 8332.48, "text": "self drill? Ey, tatsächlich, cool. Load. Park. URL open. Self? Warum eigentlich self, warum"}, {"id": 797, "start": 8332.48, "end": 8338.56, "text": "nicht this? Da könnt ich mich viel einfacher dran gewöhnen. Okay, measure download speed"}, {"id": 798, "start": 8338.56, "end": 8350.84, "text": "megabit. Gut, es scheint zu funktionieren, es macht was. Du kannst auch this importieren."}, {"id": 799, "start": 8350.84, "end": 8374.48, "text": "Wirklich? Geht das? This? Kannste das? Echt? Geht das? This? Ey, oder? Wie kann ich das,"}, {"id": 800, "start": 8374.48, "end": 8383.24, "text": "aber ich benenne das nicht um. Ach, das hier kann ich nennen, wie ich will. Aber ich nenne"}, {"id": 801, "start": 8383.24, "end": 8394.36, "text": "das nicht um, das ist ja dann absolut nicht der Pythonic Way. Ne, ne, ne, das lasse ich"}, {"id": 802, "start": 8394.36, "end": 8400.0, "text": "so. So, jetzt haben wir hier eine Klasse. So, und von der Theorie her sollte das jetzt"}, {"id": 803, "start": 8400.0, "end": 8405.36, "text": "ja so funktionieren, wenn ich das Ding starte, und wir machen jetzt einfach mal, wo ist meine"}, {"id": 804, "start": 8405.36, "end": 8410.48, "text": "Endlosschleife hier unten? Oder meine, nicht wirklich Endlosschleife, meine 100 Sekunden"}, {"id": 805, "start": 8410.48, "end": 8418.32, "text": "Schleife. So, und ich könnte jetzt nur mal zum testen, ob das funktioniert. Print. Speed"}, {"id": 806, "start": 8418.32, "end": 8432.08, "text": "test. Achso, ich muss erst noch ein Thread starten. Ja, Raid. So. Du, du, du, du, du."}, {"id": 807, "start": 8432.08, "end": 8441.28, "text": "Comment, oh, ups. Comment. Also, jetzt müssen wir den Krempel ja mehrfach, mehrfach starten."}, {"id": 808, "start": 8441.28, "end": 8459.04, "text": "Speed test. Jetzt brauchen wir eine Liste. Threads. Gleich, so. Ne, nicht. Ja, so ungefähr."}, {"id": 809, "start": 8459.04, "end": 8475.16, "text": "So, Speed test. Jetzt kann ich das weglassen, jetzt kann ich theoretisch das direkt so aufrufen"}, {"id": 810, "start": 8475.16, "end": 8490.16, "text": "wahrscheinlich, denke ich mal. Hoffe ich, dass das so geht. Start. So, und jetzt. For."}, {"id": 811, "start": 8490.16, "end": 8515.04, "text": "Threads. T, Raid. Und dann Sleep. Na, ob das jetzt funzt? Nope. Nope, was? Warum nicht?"}, {"id": 812, "start": 8515.04, "end": 8531.92, "text": "Wo ist das Problem jetzt? Warum funktioniert das jetzt nicht? Ah, ja, natürlich. Threads"}, {"id": 813, "start": 8531.92, "end": 8556.28, "text": "append. Speed test. Achso, ich kann das muss weg. Ja, klar. Ok, nice. Ok, also und jetzt"}, {"id": 814, "start": 8556.28, "end": 8562.08, "text": "das gleiche Spiel wieder. Also, das will ich ja eigentlich gar nicht so machen. Ich will"}, {"id": 815, "start": 8562.08, "end": 8569.92, "text": "ja eigentlich Print. Threads. Ne, Summen, Summen. Das macht mich fertig. Das es so globale"}, {"id": 816, "start": 8569.92, "end": 8578.44, "text": "Magic Funktionen gibt. Threads. Ne. Wait a minute. Das kann ich jetzt gar nicht summen."}, {"id": 817, "start": 8578.44, "end": 8587.64, "text": "Wie kann ich ihm denn sagen, was er da jetzt, wie er die Summe genau machen soll? Ja, in"}, {"id": 818, "start": 8587.64, "end": 8600.8, "text": "Dotnet würde ich jetzt einfach sagen Select. Sowas wie Select, aber. Ne, aber der weiß"}, {"id": 819, "start": 8600.8, "end": 8608.72, "text": "doch gar nicht, der weiß doch gar nicht, dass er das Raid Property nehmen soll, in Summe."}, {"id": 820, "start": 8608.72, "end": 8636.32, "text": "So? Ne, oder? Also, wenn das funktioniert, das kann doch nicht funktionieren. Ne, das"}, {"id": 821, "start": 8636.32, "end": 8661.0, "text": "hätte mich auch sehr gewundert, wenn das funktioniert. Threads. Also quasi. Da drinne. Threads. Ok,"}, {"id": 822, "start": 8661.0, "end": 8668.04, "text": "das ist wirklich gewöhnungsbedürftig. Ne, funktioniert, ja. Wow, aber viel zu viel zwischzeitlich."}, {"id": 823, "start": 8668.04, "end": 8693.64, "text": "Das geht auch ohne eckige Klammern. Wirklich? Ah, Sixhead Time. Ohne ist Deprecated. Ja,"}, {"id": 824, "start": 8693.64, "end": 8699.4, "text": "was denn jetzt? Ich find's auch so im ersten Blick besser. Da muss man sich aber wirklich"}, {"id": 825, "start": 8699.4, "end": 8707.76, "text": "erstmal reindenken. Das ist auf jeden Fall ein bisschen gehirnverknoten. Ja, ok, aber"}, {"id": 826, "start": 8707.76, "end": 8712.12, "text": "das ist jetzt schon deutlich besser lesbar als der andere Krämpel, den ich vorher gebastelt"}, {"id": 827, "start": 8712.12, "end": 8738.96, "text": "hab. Mach mal die Sekunden hoch auf eine Sekunde Messzeit. Was ist jetzt? Ah ja, jetzt. Hat"}, {"id": 828, "start": 8738.96, "end": 8745.8, "text": "Vodafone wieder gewodafoned zwischenzeitlich. Guck mal, ob das immer so ist. Es braucht"}, {"id": 829, "start": 8745.8, "end": 8751.88, "text": "alles? Nö. Das hat eben einfach nicht gewollt. Ruckelt übrigens das Stream, wenn ich hier"}, {"id": 830, "start": 8751.88, "end": 8760.48, "text": "volle Pulle Download mache, weil mein kompletter Download ist fertig. Ja, ist voll leer. Oder"}, {"id": 831, "start": 8760.48, "end": 8766.48, "text": "je nachdem, wie man das sieht. Also, die komplette Leitung ist voll. Mein Downloadvolumen ist"}, {"id": 832, "start": 8766.48, "end": 8785.68, "text": "leer sozusagen. Wir können ja mal kurz gucken, ob das irgendwie ruckelt. Aha, hier hat er"}, {"id": 833, "start": 8785.68, "end": 8793.8, "text": "Frames getroppt. Droppt er Frames? Massive Drop? Aha! Leute, der droppt richtig krass"}, {"id": 834, "start": 8793.8, "end": 8799.88, "text": "die Frames, wenn ich das hier anschmeiße. Lull. Guck mal. Die Downloadtests sind keine"}, {"id": 835, "start": 8799.88, "end": 8807.44, "text": "so gute Idee. Aber da sieht man, die Leitung ist voll. Jetzt testen wir mal was. Wir trosseln"}, {"id": 836, "start": 8807.44, "end": 8826.92, "text": "mal die Bandbreite. Wondershaper oder so hieß das, glaube ich. Ist schon installiert. Wondershaper,"}, {"id": 837, "start": 8826.92, "end": 8832.6, "text": "mein Interface. Wondershaper, hallo. Wondershaper minus Interface Download. Das betrifft jetzt"}, {"id": 838, "start": 8832.6, "end": 8836.84, "text": "ja nur meine Linux-VM, also keine Sorge, das ist für den Stream jetzt erstmal egal. So,"}, {"id": 839, "start": 8836.84, "end": 8861.48, "text": "wir limitieren den Download auf 4000 auf 4 MBit. Gucken, ob das funktioniert. Ja. Ja."}, {"id": 840, "start": 8861.48, "end": 8867.6, "text": "Es kommt schon so ungefähr hin. Ich würde jetzt auch nicht drauf tippen, dass das so"}, {"id": 841, "start": 8867.6, "end": 8876.72, "text": "100% exakt ist. Aber im Großen und Ganzen. Ok, und jetzt machen wir mal ein Limit. Ich"}, {"id": 842, "start": 8876.72, "end": 8882.32, "text": "glaube, ich muss jetzt erstmal clearen das Ganze wieder, dass es funktioniert. Ne, hier."}, {"id": 843, "start": 8882.32, "end": 8891.72, "text": "Jetzt gehen wir mal auf das Doppelte hoch. Ne, das Zehnfache hoch. Ich hab's geklärt."}, {"id": 844, "start": 8891.72, "end": 8905.32, "text": "Sekunde runter. 40 haben wir jetzt, guck. 33, 37, 35. Also ich würde sagen, das funktioniert"}, {"id": 845, "start": 8905.32, "end": 8916.2, "text": "schon ganz ordentlich, ja. Man kann übrigens jetzt nicht so machen, weil man muss immer"}, {"id": 846, "start": 8916.2, "end": 8935.28, "text": "erst clearen zwischendurch. Ja. Wollen wir den Buffer größer machen? Wir können"}, {"id": 847, "start": 8935.28, "end": 8943.92, "text": "den Buffer auch größer machen. Was ist das? 8, 1, 2, 9? Die nächste größere. Macht"}, {"id": 848, "start": 8943.92, "end": 8950.92, "text": "keinen Unterschied. Jetzt aber auch sehr gewundert. Aber zu kleiner Buffer backt, glaube ich,"}, {"id": 849, "start": 8950.92, "end": 8965.88, "text": "8. Das sollte das ziemlich, ja. Das, na wobei, geht eigentlich. Aber wenn ich das nochmal"}, {"id": 850, "start": 8965.88, "end": 8978.08, "text": "cleare, der geht nicht auf 400mbit hoch mit so einem Mini-Buffer. Ne, guck. Der hängt"}, {"id": 851, "start": 8978.08, "end": 8985.52, "text": "hier bei irgendwie sonst was, ja. Ne, ein zu großer Buffer ist jetzt hier in dem Fall"}, {"id": 852, "start": 8985.52, "end": 8992.4, "text": "auch nicht so sinnvoll, weil umso seltener aktualisiert der. Ich finde 4096 schon ganz"}, {"id": 853, "start": 8992.4, "end": 8998.72, "text": "passend. Aber jetzt haben wir den Multithreaded-Test. Ach ne, Moment. Ich sollte es ja noch mit"}, {"id": 854, "start": 8998.72, "end": 9005.16, "text": "threading... Ich wollte ja eigentlich gucken, was denn jetzt der unter... So kann man das"}, {"id": 855, "start": 9005.16, "end": 9010.92, "text": "doch lassen, oder? Das ist doch durchaus okay. Würde man das jetzt in eine eigene Datei"}, {"id": 856, "start": 9010.92, "end": 9029.0, "text": "verschieben als guter Pytonic-Way? Du kannst runden. Ich will gar nicht runden. Bei der"}, {"id": 857, "start": 9029.0, "end": 9040.64, "text": "Länge nicht. Ne. Das finde ich aber so ganz schick. Das kann man jetzt wenigstens ordentlich"}, {"id": 858, "start": 9040.64, "end": 9057.84, "text": "lesen. So, ich sollte multiprozess noch ausprobieren. Vorm multiprozess import process. Okay, also"}, {"id": 859, "start": 9057.84, "end": 9065.76, "text": "nicht thread, sondern process. Und jetzt sage ich process target. Also im Prinzip exakt"}, {"id": 860, "start": 9065.76, "end": 9072.68, "text": "das gleiche, nur anstatt thread, process. Und das war's jetzt? Demon muss ich wahrscheinlich"}, {"id": 861, "start": 9072.68, "end": 9090.42, "text": "weglassen. Ha, hast du so gedacht, Keg-Wade. Funktioniert net. Kann es sein, dass es jetzt"}, {"id": 862, "start": 9090.42, "end": 9099.88, "text": "nicht funktioniert, daraus etwas auszulesen? Der bekommt nie mit, wenn hier was Neues gesetzt"}, {"id": 863, "start": 9099.88, "end": 9106.76, "text": "wird. Guck mal, der macht volle Pulle Download. Aber hier erkennt er nie, dass die Rate sich"}, {"id": 864, "start": 9106.76, "end": 9114.84, "text": "geändert hat. Was ist der technische Unterschied? Naja, ich vermute mal, bei dem einen ist es"}, {"id": 865, "start": 9114.84, "end": 9119.68, "text": "quasi in einem Prozess mehrere Threads und beim anderen folgt er das und macht mehrere"}, {"id": 866, "start": 9119.68, "end": 9128.36, "text": "Threads, was dann mehr RAM braucht. Aber ich kann jetzt aus multiprozess kann ich nicht"}, {"id": 867, "start": 9128.36, "end": 9135.16, "text": "mehr die Variablen auslesen, aus meinem Mainprozess von den Child-Prozessen. Das ist wahrscheinlich"}, {"id": 868, "start": 9135.16, "end": 9140.84, "text": "auch der Grund, warum es zwei verschiedene Sachen gibt. Genau, deswegen. Das hat schon"}, {"id": 869, "start": 9140.84, "end": 9147.08, "text": "sein Sinn, dass es da zwei verschiedene Sachen gibt. In dem Fall muss es tatsächlich das"}, {"id": 870, "start": 9147.08, "end": 9169.92, "text": "hier sein. Habe ich hier noch Traffic Shaping on oder so? Nö, es ist einfach langsam."}, {"id": 871, "start": 9169.92, "end": 9177.92, "text": "Ah nee, jetzt geht es wieder hoch. Sollte vielleicht die Eins anstelle Spieltests ins"}, {"id": 872, "start": 9177.92, "end": 9206.56, "text": "Liste? Nö. Sollte nicht. Deswegen sollte es nicht Svets heißen, sondern irgendwie Speedtests."}, {"id": 873, "start": 9206.56, "end": 9211.4, "text": "Ein Tupel in die Liste, man braucht ja auch Raid. Ja, Raid habe ich ja hier. Raid habe"}, {"id": 874, "start": 9211.4, "end": 9216.0, "text": "ich doch hier drüber. Was aber mit multiprozess nicht funktioniert, was hätte hier für Schmerzen?"}, {"id": 875, "start": 9216.0, "end": 9223.84, "text": "Taipo, überhaupt kein Taipo, lügt nicht. Ok, das funzt, ich bin begeistert. Ich muss"}, {"id": 876, "start": 9223.84, "end": 9240.12, "text": "aber einen Speed Limit machen, weil ansonsten... Spack da rum. Ja, 40mbit Speed Limit. Ich will"}, {"id": 877, "start": 9240.12, "end": 9245.6, "text": "nicht Join Call, nee. Der soll die automatisch beenden am Ende des Programms. Vollkommen"}, {"id": 878, "start": 9245.6, "end": 9251.96, "text": "in Ordnung. Scheiß auf Join. Die Dinger werden eh nicht fertig. Die laden einen Terabyte"}, {"id": 879, "start": 9251.96, "end": 9257.04, "text": "runter, die werden nicht so schnell fertig. Also nicht innerhalb von 2 Sekunden. So und"}, {"id": 880, "start": 9257.04, "end": 9261.48, "text": "von der Idee her ist es jetzt so, ich könnte das 5 Sekunden laufen lassen oder sagen wir"}, {"id": 881, "start": 9261.48, "end": 9271.4, "text": "mal, vielleicht nicht mal 5 Sekunden. Kann man 0.5 sleepen? Geht das? Hey. Ja, bringt"}, {"id": 882, "start": 9271.4, "end": 9278.2, "text": "ja nichts. Ich muss schon länger laufen lassen, dass das alles Rats überhaupt nennenswert"}, {"id": 883, "start": 9278.2, "end": 9298.48, "text": "was machen. Multiprocess Shared Memory. Oh, jetzt wird's. Oh, 5 Head Time. Shared Memory"}, {"id": 884, "start": 9298.48, "end": 9306.04, "text": "Size. Ok, das wird jetzt aber richtig Raw, oder? Jetzt wird's aber richtig Raw. Shared"}, {"id": 885, "start": 9306.04, "end": 9313.2, "text": "Memory Block. Bäh. Eigentlich fehlt ja noch die Main Methode, das stimmt. Das geht doch"}, {"id": 886, "start": 9313.2, "end": 9319.92, "text": "irgendwie in Pyres irgendwie so if Main oder irgendwie so, ne? Also ganz komisches Zeug."}, {"id": 887, "start": 9319.92, "end": 9330.36, "text": "Ah guck mal, die können das schon. Ok, nice. Kann ich das jetzt einfach da drunter kopieren?"}, {"id": 888, "start": 9330.36, "end": 9347.28, "text": "Lul. Ah. Sehr schön, sehr schön. Ok, das gefällt mir. So, was kann man jetzt, was"}, {"id": 889, "start": 9347.28, "end": 9352.12, "text": "kann man denn sonst noch machen? Also die Speedtest Geschichte Multithreaded kann man"}, {"id": 890, "start": 9352.12, "end": 9358.96, "text": "sagen ist in Ordnung. Huf eine Methode Main auf und pack da alles rein. Ist das der Pythonische"}, {"id": 891, "start": 9358.96, "end": 9368.24, "text": "Way? So zu ach, oh man, ich krieg die Klammer nicht weg. Ich werde nie Klammern raus bekommen."}, {"id": 892, "start": 9368.24, "end": 9392.76, "text": "Ja. Macht man, machen die coolen Leute das so, ja? Ok."}, {"id": 893, "start": 9392.76, "end": 9405.16, "text": "Die coolen Leute, na das ist in jeder Sprache so, oder? Das erste was entsteht für jede"}, {"id": 894, "start": 9405.16, "end": 9410.96, "text": "x beliebige Sprache ist eine Library, die um Sprachen Sachen work aroundet. Überall."}, {"id": 895, "start": 9410.96, "end": 9417.04, "text": "So, also das funktioniert mit dem Download Speed. Ich bin begeistert, wir können mehrere"}, {"id": 896, "start": 9417.04, "end": 9420.36, "text": "Threads verwenden. So, die eigentliche Sache, die ich mir jetzt aber noch angucken wollte,"}, {"id": 897, "start": 9420.36, "end": 9430.28, "text": "was genau ist hier der Unterschied? Async. Und was ist der Unterschied zwischen Concurrent"}, {"id": 898, "start": 9430.28, "end": 9455.88, "text": "Futures und Async.io? Gibt es da überhaupt einen? Ach komm, hier gibt es sogar ein Beispiel."}, {"id": 899, "start": 9455.88, "end": 9481.6, "text": "Ok, das ist richtig Next Level Shit. Das hier ist quasi ein Await, oder? Seh ich das richtig?"}, {"id": 900, "start": 9481.6, "end": 9496.28, "text": "Ok, ne, das ist mir, das sieht aber um ein vielfaches komplizierter aus als das andere."}, {"id": 901, "start": 9496.28, "end": 9516.36, "text": "Also, das hier, muss ich ehrlich sagen, das hier macht einen ziemlich einfachen Eindruck."}, {"id": 902, "start": 9516.36, "end": 9522.8, "text": "Das ist jetzt nicht so viel anderes, wie ein Task starten in C Sharp. Wobei ein Task eigentlich"}, {"id": 903, "start": 9522.8, "end": 9530.76, "text": "Awaitable ist in C Sharp. Ne, das ist eher wie ein Thread starten direkt. Schreib mal"}, {"id": 904, "start": 9530.76, "end": 9555.36, "text": "zwischen den zwei Vorschleifen ein Sleep. Du meinst, dass er am Anfang nicht 0-0 macht?"}, {"id": 905, "start": 9555.36, "end": 9582.6, "text": "10 ist vielleicht jetzt ein bisschen viel gewesen. 2. Lass mal weg, wozu? Also was machen hier?"}, {"id": 906, "start": 9582.6, "end": 9605.44, "text": "Async, Def, Main, Await, Async.io, Sleep. Task. Ok, Task 1, Async.io, Create Task, After."}, {"id": 907, "start": 9605.44, "end": 9619.76, "text": "Wir probieren das jetzt einfach mal aus. Also, anstatt Threading, Async.io. Und jetzt, was"}, {"id": 908, "start": 9619.76, "end": 9635.68, "text": "war das? Async.io, Create Task. So, das heißt im Endeffekt, anstatt den Kram, sage ich ihm,"}, {"id": 909, "start": 9635.68, "end": 9651.32, "text": "ne, mach ich nicht. Ach ne, hier füll ich das direkt drin aus? Oder wie, oder was? Ne."}, {"id": 910, "start": 9651.32, "end": 9678.08, "text": "Ah, das muss eine Async Function sein. Ok. Alles klar. Da bin ich jetzt ja mal gespannt,"}, {"id": 911, "start": 9678.08, "end": 9693.32, "text": "ob das funzt. So. Jetzt einfach so? Ne. Bam. Was never awaited. Ja, ich will ja auch, dass"}, {"id": 912, "start": 9693.32, "end": 9701.48, "text": "du startest. Ich will nicht, dass es Await. Ich will das nicht Awaiten. Der soll das einfach"}, {"id": 913, "start": 9701.48, "end": 9710.52, "text": "starten. Das funktioniert glaube ich nicht so, wie ich mir das vorstelle, oder? Ich"}, {"id": 914, "start": 9710.52, "end": 9727.8, "text": "muss, ich muss den Krampel irgendwann Awaiten. Was, Async.io Run? Ah. Ne. Ah, ich hab das"}, {"id": 915, "start": 9727.8, "end": 9740.36, "text": "jetzt erpennt. Ne, jetzt hab ich das erpennt drinne. Hm. Muss ich hier die Klammern wegmachen?"}, {"id": 916, "start": 9740.36, "end": 9756.16, "text": "Ne. Macht das, macht das überhaupt jetzt Async technisch was? Ne, oder? Das hängt"}, {"id": 917, "start": 9756.16, "end": 9785.28, "text": "hier jetzt einfach. Ich muss Main auch Async starten? What? Jetzt. So? Und dann? So? Ok,"}, {"id": 918, "start": 9785.28, "end": 9800.48, "text": "das ist, das ist sehr feifertig. Ne. Seriously, das ist mir zu doof. Ich will nicht auf alle"}, {"id": 919, "start": 9800.48, "end": 9810.44, "text": "warten. Da ist mir, ne. Wisst ihr was? Scheiß drauf. Ich will da nichts Awaiten. Das soll"}, {"id": 920, "start": 9810.44, "end": 9823.24, "text": "einfach laufen und dann abgeschossen werden. Wenn es die scharpe hätte ich ihnen den Cancellation"}, {"id": 921, "start": 9823.24, "end": 9828.72, "text": "Token mitgegeben, was das abbricht. Und ich hätte gesagt, das Cancellation Token Throat"}, {"id": 922, "start": 9828.72, "end": 9842.2, "text": "einfachen Fehler. Ne, aber ich glaube, das ist mir so deutlich lieber. Ne, also, warum"}, {"id": 923, "start": 9842.2, "end": 9846.6, "text": "sollte ich kompliziert machen, wenn es noch so funktioniert? Ne, also damit bin ich, damit"}, {"id": 924, "start": 9846.6, "end": 9852.12, "text": "bin ich jetzt eigentlich ganz zufrieden. So. Was können wir da jetzt, was können wir da"}, {"id": 925, "start": 9852.12, "end": 9865.28, "text": "jetzt noch dran basteln? Also. Wir haben das mit Multithreaded ausprobiert. Ich hab sogar"}, {"id": 926, "start": 9865.28, "end": 9870.08, "text": "paar Type Annotations ausprobiert. Also ich würde sagen, heute habe ich einiges, einiges"}, {"id": 927, "start": 9870.08, "end": 9875.0, "text": "gelernt, was etwas moderneres Python Zeug angeht. Ich meine, ich hab da nicht wirklich"}, {"id": 928, "start": 9875.0, "end": 9878.68, "text": "Ahnung von gehabt. Ich hab die ein oder anderen kleinen Sachen damit schon gemacht, aber immer"}, {"id": 929, "start": 9878.68, "end": 9884.08, "text": "sehr unregelmäßig und nie wirklich was Großes. Das ist jetzt ja auch nichts Großes, aber"}, {"id": 930, "start": 9884.08, "end": 9889.0, "text": "zumindest mal sowas wie Multithreading habe ich noch nie gemacht. Ich gucke mir heute"}, {"id": 931, "start": 9889.0, "end": 9896.0, "text": "Abend den Webcast an. Python Async.io und lasst mir das mal erklären von irgendwie"}, {"id": 932, "start": 9896.0, "end": 9902.72, "text": "einem, der Ahnung hat. So. Ich glaube, ich muss jetzt mal was essen. Ich habe übelst"}, {"id": 933, "start": 9902.72, "end": 9916.36, "text": "Hunger. Überlegt gerade noch, können wir noch irgendwie. Das mit dem Performance-Counter"}, {"id": 934, "start": 9916.36, "end": 9927.92, "text": "ist vollkommen in Ordnung. Du kannst sagen, dass er nichts doppelt printen soll. Der printet"}, {"id": 935, "start": 9927.92, "end": 9935.52, "text": "doch nichts doppelt. Der printet, der printet immer nur eine Zeile, aber der printet hier"}, {"id": 936, "start": 9935.52, "end": 9940.04, "text": "halt alle 100 Millisekunden. Deswegen ist es besser, wenn ich auf eine Sekunde stelle."}, {"id": 937, "start": 9940.04, "end": 9963.0, "text": "Ach nee, das ist, das ist. Ich weiß, dass es Speedtest-DLI gibt. Das war nicht Sinn"}, {"id": 938, "start": 9963.0, "end": 9966.84, "text": "und Zweck der Sache. Das ist, das weiß ich nicht. Könnte ich, easy, Speedtest-DLI. Ich"}, {"id": 939, "start": 9966.84, "end": 9971.08, "text": "könnte ja auch einfach einen Webcast machen und die Zeit stoppen oder so. Wobei das nicht"}, {"id": 940, "start": 9971.08, "end": 9978.88, "text": "ein Aria-Download-Manager Zeit stoppen oder so. Das wäre deutlich einfacher. Du könntest"}, {"id": 941, "start": 9978.88, "end": 9990.76, "text": "eine Que verwenden anstatt eine globale Liste. Wie soll denn das funktionieren? Wie soll"}, {"id": 942, "start": 9990.76, "end": 9999.08, "text": "mir eine Que helfen in dem Fall? Ich meine, die Klasse sagt, welche Downloadrate sie aktuell"}, {"id": 943, "start": 9999.08, "end": 10006.8, "text": "gemessen hat in ihrem jeweiligen Thread. Und das Ganze lese ich dann hier aus. Da bringt"}, {"id": 944, "start": 10006.8, "end": 10017.64, "text": "mir eine Que doch nichts. Weil ich will ja immer wieder die gleichen rauslesen. Ich"}, {"id": 945, "start": 10017.64, "end": 10028.36, "text": "will ja nicht etwa einmal auslesen und dann ist wieder gut. Das ist aber schwierig, sowas"}, {"id": 946, "start": 10028.36, "end": 10033.72, "text": "mit einer Que zu machen, weil dann hast du beispielsweise in der Que acht Werte stehen"}, {"id": 947, "start": 10033.72, "end": 10038.68, "text": "und dann müsstest du wissen, du darfst nur vier maximal auf einmal lesen und müsstest"}, {"id": 948, "start": 10038.68, "end": 10042.08, "text": "sie dann zusammenrechnen. Und was ist, wenn eins Thread hängt und der eine dann zweimal"}, {"id": 949, "start": 10042.08, "end": 10048.84, "text": "reingeschrieben hat? Ne, ich glaube mit einer Que macht es in dem Fall einfach noch komplizierter."}, {"id": 950, "start": 10048.84, "end": 10053.52, "text": "Zumal, wenn ich es richtig verstanden habe, dadurch, dass wir Python Threads verwenden,"}, {"id": 951, "start": 10053.52, "end": 10057.72, "text": "muss ich mich ja überhaupt nicht um Locking oder sonst was kümmern. Das geht einfach."}, {"id": 952, "start": 10057.72, "end": 10063.08, "text": "It just works. Würde Apple wahrscheinlich jetzt sagen. Es hat vielleicht nicht die"}, {"id": 953, "start": 10063.08, "end": 10069.92, "text": "mega Performance, wie das woanders wäre, aber für den Fall reicht es, Digga, aus."}, {"id": 954, "start": 10069.92, "end": 10078.48, "text": "Ich finde das eigentlich ganz nice, so muss ich ehrlich sagen. Und es ist für sich genommen"}, {"id": 955, "start": 10078.48, "end": 10084.08, "text": "auch wirklich gut lesbar. Also man versteht alles, was passiert. Da kann sich C++ und"}, {"id": 956, "start": 10084.08, "end": 10088.16, "text": "sonstige Sachen echt noch eine Scheibe von abschneiden. In C++ hätte ich jetzt hier"}, {"id": 957, "start": 10088.16, "end": 10095.52, "text": "schon 50 Klammern mit sonstigen Dingern dazumachen müssen, dass das gültiges C++ ist und dann"}, {"id": 958, "start": 10095.52, "end": 10099.28, "text": "kommt eine Fehlermeldung, dass angeblich in Zeile 1 ein Schreibfehler ist, obwohl der"}, {"id": 959, "start": 10099.28, "end": 10103.84, "text": "eigentliche Fehler hier unten ist, weil ich falsche Zeichen habe. In C++ habe ich hier"}, {"id": 960, "start": 10103.84, "end": 10111.24, "text": "ein Semikolon vergessen und er sagt mir irgendwie, hier oben ist falsch. Das ist aber wirklich"}, {"id": 961, "start": 10111.24, "end": 10118.52, "text": "nicht schlecht, das kann man ganz gut lesen. Was ist der Sinn von AddProperty? Dumme Frage,"}, {"id": 962, "start": 10118.52, "end": 10135.72, "text": "das kann ich doch einfach wegmachen, das funktioniert immer noch. Warum funktioniert das jetzt nicht?"}, {"id": 963, "start": 10135.72, "end": 10151.24, "text": "Ah, dann müsste ich Raid so machen. Das finde ich gut, finde ich nice, dass es geht. Das"}, {"id": 964, "start": 10151.24, "end": 10159.56, "text": "finde ich gut. Das ist ein Getter. In C sharp wäre das, was du in einem Getter schreibst."}, {"id": 965, "start": 10159.56, "end": 10182.36, "text": "Das finde ich gut, das ist ein schöner Sonntag, gefällt mir. Die wichtigste Frage ist, wie"}, {"id": 966, "start": 10182.36, "end": 10188.4, "text": "gut Cobolinterop funktioniert. Wahrscheinlich, wenn du deine Coboldinger mit C Interfaces"}, {"id": 967, "start": 10188.4, "end": 10197.0, "text": "exportieren kannst, funktioniert es wunderbar. Wie gut das in Cobol geht, weiß ich nicht."}, {"id": 968, "start": 10197.0, "end": 10203.8, "text": "Und wenn es nicht geht, dann ist der Interop für ein Arsch. Ich habe aber von niemand"}, {"id": 969, "start": 10203.8, "end": 10231.56, "text": "gehört, der Cobol-Python-Interop. War natürlich klar. Ich glaube, Cobolinterop, das wollen"}, {"id": 970, "start": 10231.56, "end": 10239.56, "text": "wir uns jetzt an der Stelle eher nicht geben. Ja, zum Üben war das doch ganz nice. Leute,"}, {"id": 971, "start": 10239.56, "end": 10245.4, "text": "ich gehe jetzt was essen. Wir sehen uns im nächsten Stream. Macht es gut, bis dann."}, {"id": 972, "start": 10245.4, "end": 10271.36, "text": "CO!"}]}