{"text": "Ich bin übrigens kaputt, ich wusste gar nicht ob ich Stream anmachen soll, aber ich habe mir gedacht, was will sie großartig machen, was gibt es besseres als eine Runde Streamen. Aber wie gesagt, Sonderliche 5-Header-Time wird es heute nicht werden, weil ich kann mich jetzt nicht wirklich großartig konzentrieren, hier 5, 6, 11-Head-Dinger machen. Ich muss zwar wieder nach Frankfurt fahren, unsinnigerweise, außer dass ich da irgendwie wieder mehr oder weniger dreiviertel des Tages gemietet habe, ist eigentlich sehr überflüssig gewesen. Am Rande, ich habe ein paar Videos geguckt, aber es juckt mich wenig, das juckt mich genauso viel wie diese, ich weiß gar nicht wie der Typ heißt, Flynn oder so, der Typ mit den Masken, der irgendwie die Masken verkauft hat und dann sich für gefeiert hat, als hätte er sie gespendet und es irgendwelche komischen China-Chinesen-Masken waren. Keine Ahnung, ich kriege das alles so am Rande mit, aber es geht mir alles vorbei, wenn ich ehrlich bin. Juckt mich alles nicht, was ich heißt, dass ich irgendwas gut finde, das juckt mich einfach nicht. Oder schlecht, das juckt mich einfach nicht. Wie gesagt, ich weiß auch nicht mal wie der Kerl heißt, irgendwie gefühlt wahrscheinlich 90% in Deutschland wissen das nicht, ich hab keine Ahnung. Flynn oder so, wie heißt denn der Dude, sagt mal, ihr wisst das doch, Chet, Kiemann Flynn oder irgendwie so, Klee, Klee, nee, Cleansman war jemand anderes, ach keine Ahnung, wie gesagt, das interessiert mich auch überhaupt nicht, Leute, ich weiß nicht mal wie der Typ heißt. Ich muss mal kurz in meine Mails gucken, ach Finn, ach ja, ja, irgendwas mit Finn wusste ich doch. Kann man das auch nur merken, weil der Meshed Finn heißt, der Einzige den ich kenne, der Finn heißt... Moment, ich hab mein E-Mail-Passwort falsch eingegeben, warum mache ich denn sowas? So, kurz E-Mails check, Swann, Pay Reminder, warum das, oh, darfst du keinem erzählen, ich hab meine Hetzner-Rechnung nicht bezahlt diesen Monat bis jetzt, die hab ich grad ein Reminder geschickt, für 5,83 Euro, Alter, was hab ich denn da überhaupt, was 5,83 Euro kostet noch? Irgendeine Single-VM, oder, 5,83 Euro, Mann, das sieht sehr nach Single-VM aus, oder? Das steht doch auf der Rechnung bestimmt drauf, ne. Du hast Twitch, bestimmt, bestimmt, hast du Twitch gehackt, daran wird es liegen, dass man die Nachrichten nicht sieht. Geh ich auch von aus, es kann, es kann keinen anderen Grund geben, als, als hast du, dass du Twitch gehackt hast, ja, so ist es, Horst-Champ, wie siehts heute aus, Weeps in oder Weeps out? Ich bin ja immer für Weeps in, wow, Alter, viel zu laut, Mann, MonkaS, Sekunde, Sekunde, Freund, geht es hier drüber, muss mal kurz den Aja-Ja-Sound runterschrauben, so, das ist jetzt doch noch laut genug, ja, ok, ok, das kann man so ertragen, mal testen, was sagt der, was sagt der Wendler dazu? Ok, Sound passt, alles klar, macht der eigentlich, ist das immer noch in seiner Telegram-Gruppe? Was für ein Ding, seit ich wieder festbar eine Mix aus Uberspace, ist das irgendein Co-Location-Host, sagt mir gar nichts, und selbst Hosted bin, habe ich meinen Hetzer-Server wieder weg, aber eigentlich ganz zufrieden mit den, ja, die sind nicht schlecht, ich hab dieses Jahr, haben wir noch nichts ausgehandelt, das heißt, mein Hetzer-Startgutscheincode funktioniert auch nicht mehr, obwohl man den gerade jetzt, wo die Leute eh schon wieder wenig Kohle haben, brauchen könnte. Ja, Leute, also, grüne Pizza, Dankeschön für den Sub, Massive zwei Monate. Zeig mal, zeig mal her, was für ein Ding, Uberspace, Hosting of Asteroids, ok, ich bin froh, dass die nicht schreiben, Hosting on Steroids, das ist so, das ist so eine Redewendung, die kann ich überhaupt nicht leiden, das war, das war mal eine Zeitlein sehr angesagt, so zu der Zeit, wo auch Hubi-Entwickler sich als Rockstar-Developer bezeichnet haben, da war alles blablabla on Steroids und, ok, und was können die so geiles, dass die, dass, dass man Universal-Hosting für Shell-Lovers, aha, kurz ein bisschen leiser machen, Leute, ich muss mir zu laut gerade, mach das mal wieder hoch, ich hab ja auch viel zu laut, fällt mir gerade auf, normalerweise hab ich immer auf 30, Leute, ich muss die Resident-Sleeper, ich muss die kurz ein bisschen durch was, etwas, etwas weniger, äh, Resident-Sleeper-Riches ersetzen, weil ansonsten ist gleich wirklich Badge angesagt, das fände ich tatsächlich geil, wenn einer ein Rechenzentrum auf dem Mond eröffnet, wisst ihr warum ich das geil finde, weniger wegen dem Rechenzentrum auf dem Mond, ich seh nämlich ehrlich gesagt nicht so wirklich, wo der Sinn von einem Rechenzentrum auf dem Mond ist, also was es für Vorteile haben soll, außer, äh, Strahlung, ähm, beschissene Latenz, ähm, wo kriegt's den Strom, also eigentlich nur Probleme, aber warum ich's geil finden würde ist, weil dann müsste jemand mal wieder auf den Mond fliegen, dort landen und da was Sinnvolles machen, da wart ich ja drauf, die Amis haben das ja vor ein paar Jahren angekündigt, dass sie wieder auf den Mond fliegen wollen, aber mittlerweile, hat sich da nicht viel getan, ah ja, ich wollt ja gucken, was die so Geiles haben, also, was, Pricing, zeig her, äh, Rakete, das ist ein gutes Pricing, Budget, 5 Euro, ja, und was bekommt man da, ich, ich sag, ich versteh's nicht, also ich mein, mal angenommen, ich bezahl da jetzt 15 Euro, was bekomm ich dafür, so genau, ich, ich, so, ich versteh's nicht so, so richtig, man bekommt da einen Container oder was, einen Container und auf dem kann man machen, was man will, ja, aber, was hält mich da von ab, in, habe, ja gut, ich hab wahrscheinlich irgendwelche Limits oder so, wahrscheinlich ist es keine VM, ok, das muss ich mal angucken, Chat, ich hab's nicht so genau kapiert, ehrlich gesagt, der ideale Ort, Rechenzentrum, der Mond ist doch alles andere als der ideale Ort für ein Rechenzentrum, also manche, ich mein, muss man denn sagen, also manche Unternehmen haben sehr gutes Marketingmaterial und können viel Zeug erzählen, aber mir kann niemand erzählen, dass der optimale Standort für ein Rechenzentrum auf dem Mond ist, und ok, warum, warum ist das so, Sub ignoriert, Doom Swap, danke für den Sub, Kengin, Pogger, Sub, ich seh's jetzt zwar nicht, aber Dankeschön, nice, ach hier 17 Monate, Massive, Pfeifheader, Sub, ok, jetzt lassen wir uns doch mal kurz erklären, du hast für drei Monate gesubbt, das ist ja, dazu kann ich nur sagen, oder alternativ, oder alternativ, wenn man auf die Ollen Call of Duty Sachen steht, Weirdchamp, danke für den Sub, ok, also, was haben wir denn hier, um Daten und Rechenkapazität, wie macht man das eigentlich gescheit, mit Kühlung auf dem Mond, egal, um Daten und Rechenkapazität auch in notwendigen, ok, krisensicher auf dem Mond, also ganz ehrlich, wenn hier die Welt untergeht, auf der Erde, ich weiß nicht, ob uns das Rechenzentrum auf dem Mond rettet, aber das ist tatsächlich ein Punkt, den lasse ich mir noch irgendwie gefallen, ja, weil mein Content so gut ist, das ist schön, dass dir mein Content gefällt, ok, das unternehmen hat sich dafür auch am, im kommenden Jahr, ja Moment, in diesem Jahr, das sagen die ganzen Startups, und dann passiert fünf Jahre nichts und sie gehen out of Service, ein bisschen teurer, ok, ja, was jetzt der Vorteil davon ist, hat man immer noch, nicht so genau verstanden, also es gibt ein großes Problem, wenn die Erde unbewohnbar wird, dann sind wahrscheinlich die Leute dort dann irgendwann tot, und tote Leute interessieren sich wenig für Daten im Rechenzentrum auf dem Mond, aber ok, ich bin, hey, vielleicht gibt es ja da irgendeinen Markt für, keine Ahnung, aktuell sieht das für mich einfach nur nach irgendwie, Schnapsidee, Startups Schnapsidee aus, aber ok, wenn sie meinen, breche ich jetzt auf dem Mond, ach so soll das aussehen, ja gut, das können die ganzen Ami Startups auch immer gut, irgendwelche Renderbilder machen, mit wie das mal in Zukunft aussehen wird, wie sie, Dankeschön für den Zap, aber, also mir erschließt sich die Logik nicht, was man mit dem Rechenzentrum auf dem Mond macht, also was der Sinn davon ist, weil das ist quasi der unsinnigste Platz für den Rechenzentrum, der mir so einfällt, ansonsten keine Ahnung, ja ich lasse das Argument irgendwie zum Teil ziehen, dass sie sagen, ja da sind die Daten sicher vor irgendwelchen Katastrophen auf der Erde, wobei man halt sagen muss, wenn man so große globale Katastrophen auf der Erde hat, dass jetzt auch ein, mehrfach redundantausgelegter Daten auf der Erde weg sind, ja, also sprich, wenn man seine Daten spiegelt, sagen wir mal, einmal in Europa, einmal in Nordamerika und einmal in Asien oder so zum Beispiel, und alle drei Standorte sind wirklich kaputt, dann muss ja irgendwas hier von wirklich großem Ausmaß passiert sein, also da langt es weder, dass die Russen in der Ukraine sind, noch dass Kim Jong-Dings irgendwie komische Dinge macht oder was weiß ich, dass irgendwelche Alawakbar-Leute am Start sind, da muss ja wirklich was globales passieren, weltweit, wenn du einen geo-redundanten Datentopf kaputt kriegst, also was ist der Vorteil von einem Rechenzentrum auf dem Mond, ich weiß es nicht, keine Ahnung, was auch immer, ich muss aber nicht jede Startup-Idee verstehen, weil wenn es danach geht, ich würde wahrscheinlich nie ein Startup gründen und ich würde wahrscheinlich auch die, die funktionieren, nie gründen, das heißt, ich bin da schlechter Ratgeber wahrscheinlich, weil ich alles schlecht finde, von Startup-Ideen gehe ich mal von aus, das meiste will ich schlecht finden, aber in dem Fall verstehe ich es wirklich nicht, wo das Sinn ist, was ist es, es ist das Gegenteil von On-Prem, das ist ja dann auch nicht in der Cloud, da braucht man dann noch ein drittes Wort für oder, also ich meine, wir haben Cloud, wir haben Lokal, also coole Leute nennen das On-Prem, aber ich nenne es mal Lokal, so wie normale Leute das nennen, was ist denn das, Overcloud, Intergalactic, nee, Space, aber Space ist tatsächlich ein bisschen zu, zu normales Wort für super agiles Startup-Dinger, Orbit, Orbit finde ich gut, Hyperspace, so Galactic, Galactic Cloud oder so, Superlativ brauchst du da schon ein bisschen, Marco, was sagt denn das heise Forum dazu? Ideal für, wie macht man das, blöde Frage, habt ihr eine Vorstellung, habt ihr, oder habt ihr eine klorische Idee, wie man das dort gescheit mit der Kühlung macht, weil ich mein, ja, wenn nicht gerade die Sonne drauf scheint, ist es kalt, aber du musst ja Server, also du musst ja die Kälte irgendwie an die Server bekommen und das Problem ist am Vakuum, dass selbst wenn du sagen wir mal einen großen passiven Kühlklotz nimmst und den raushängst, du hast ja wenig, wenig, du hast ja kein Material, du hast ja keine Luft drum oder kein Wasser drum oder sonst was, was quasi die Wärme da leiten würde, also ich bin mir nicht so sicher, ob man das Zeug gescheit kühlen kann, ja Strahlung, da gibt es so viele Probleme, die habe ich ja gerade schon ein paar aufgezählt, Strahlung, Strahlung ist wahrscheinlich noch das kleinste, die Latenz zur Erde ist eigentlich das, was mir am meisten Sorgen macht, da sieht der Satelliten nix dagegen, ich weiß nicht, was ist, was ist Lichtgeschwindigkeit zum Mond, wie lange, wie lange braucht man da, sein Licht rein, okay, überlegt euch das mal, im aller, aller, allerbesten Fall braucht ein Ping 2,5, 2,5, 2,5 Sekunden, im aller, allerbesten Fall, realistisch betrachtet wird es noch eine ganze, eine ganze Weile mehr dauern, weil du musst ja erstmal gucken, dass du auch dann im richtigen, du kommst, es reicht ja wahrscheinlich nicht, wenn du irgendwo auf der Erde runter kommst, du musst ja wahrscheinlich noch halbwegs, du musst das Signal wahrscheinlich noch relayen mit irgendwelchen Satelliten, weil ansonsten musst du es nochmal quer durch die ganze Erde schicken, je nachdem, wo das gerade empfangen wird, die Bandbreite wird wahrscheinlich nicht so berauschend sein, das ist ja quasi wie Satelliteninternet nur noch, noch, noch viel, viel, viel, viel, viel langsamer, 2.560 Millisekunden Ping, ja, das ist doch nix, das ist doch Intergalactic Data Center, also ich weiß nicht, die Start-up Idee überzeugt mich jetzt persönlich nicht so wirklich, aber wer weiß, vielleicht wird es der neue große Shit, dann kann er das Elon Musk irgendwann kaufen, wenn das, der hat irgendwie eh zu viel Geld, was das angeht, und dann kann er selbst Server hochschicken, ich meine, hat er nicht schon irgendeinen Tesla in die Umlaufbahn geschossen, dann wäre doch jetzt das nächste ein Tesla auf den Mond, beziehungsweise ein paar Server auf, auf den Mond wenigstens. Okay, also wie funktioniert das, die machen viel über Querfinanzierung, du bekommst einen Nutzer, also geht es übrigens nicht um das Rechenzentrum auf dem Mond, sondern um diesen Hosting-Anbieter, du bekommst einen Nutzer in einer 4MD-Limit, sind halt sehr, sehr locker, zumindest meiner Meinung nach bekommt man gerade für Spitzen mehr das, als bei anderen für die Produktion. Das heißt, ich könnte da auch mal kurz mal, also könnte ich da beispielsweise auch mein Open Street View preprocessen, das braucht 48 CPU-Kerner, damit es ungefähr so in 40 Minuten fertig ist. Und, und ich glaube 40 oder 50 Gigabyte RAM, oder, oder löschen die mich dann direkt, dafür brauche ich da aber auch nur 40 Minuten für dann. Mal kurz ja, kurz sind da wahrscheinlich keine 40 Minuten, 48 Kerne und 50 Gigabyte RAM, oder? Das ist wahrscheinlich nicht, nicht, nicht, nicht kurz. Das haben ja schon viele gemacht, wobei ganz ehrlich, das ist im Kryptosektor, glaube ich, deutlich attraktiver. Nur, dass da die Investoren irgendwelche privaten Leute sind, die du verarschst, in denen sagst, gibts uns euer Geld. Was ich persönlich immer sehr beeindruckend finde, dass das überhaupt funktioniert. Generell sollte man auch mittlerweile im Internet ja eigentlich gecheckt haben, dass Leute, die sagen, gib mir dein Geld und ich mach dich reich, egal ob das in irgendwelche Gruppen sind, wo du reingehen sollst, oder Leute, die dich mit Krypto reich machen. Kurz eben mal gucken, was meine Stonks machen. Meine Stonks sind heute, dass das alles Scam ist. Oh, 85 Euro, meine Stonks, immerhin. 85 Euro, 542 Euro die Woche. Na, da kann ich doch mit leben. Besser als weiter, minus, Alter. Aber immer noch im Minus, also ich hab immer noch keinen Plus gemacht mit meinen Stonks. Na ja. Und Amazon ist auch nicht besser. Na ja, was auch immer. Entspannter RZ-Kontrollgang auf dem Boot, ja. Okay, das ist wohl wahr. Man braucht dort keinen Sicherheitsdienst oder so. Da kommt halt, da kommt jetzt nicht mal so nebenbei einer hin. Äh, ist die Erde nicht immer noch näher an Satelliten als der Mond? Satelliten sind irgendwie so 80.000 Kilometer teilweise weg. Also nicht die Tiefen, sondern die höheren, oder? Sind die irgendwie 80.000 Kilometer weg oder sowas? Und da ist der Mond ja deutlich weiter weg als, ja, aber vielleicht, ja. Jo, danke für den Sub. Was machen eigentlich die Microsoft Unterwasser Rechenzentren? Was machen die so? Die gibt's anscheinend noch, okay. Ah nee, die sind doch nicht so geil. Ach, weniger Fehler anfällig. Ja, die haben da irgendwie so ein U-Boot versenkt, weil das ist im Gegensatz zum Mond tatsächlich eine relativ gute Idee für Kühlung. Weil da hast du quasi Wasserkühlung gratis. Oh, kurz bin ich ein bisschen schneller. Ja, genau, das werden die machen. Die umgehen einfach mal, ich weiß jetzt gar nicht, wie es heißt, die umgeben einfach mal das Problem, dass du halt auch mit Quantenverschränkungen und Geschichten keine Informationen gescheit übertragen kannst. Aber da werden die schon was Neues, also was du gar nicht gescheit gar nicht übertragen kannst, das werden die schon, die werden das lösen. Easy, kein Problem. Also ich habe ja Vertrauen in Startups generell, die sagen immer nur die Wahrheit, die sagen immer nur, wie es ist. Genauso, der beste, eines der geilsten Startup Scams war doch diese Geschichte mit, die stechen dir in den Finger und können dann irgendwie 5000 Krankheiten erkennen, was nie richtig funktioniert hat, wo da kerngesunde Leute krebsdiagnostiziert wurde und sowas. Ich habe vergessen, wie die hießen, aber das war auch richtig massive Scam. Mit dieser plonten Vorstandsfrau da von denen. War noch jemand im Kopf, wie die heißen? Was mit T? Was mit T? Terra? TerraBus oder so? Wie hießen die denn? Moment, Startup, Scam, der schon mit Elisabeth kommt. Ja, die meine ich doch, die meine ich doch. TerraNos, nicht TerraBus. Wie komme ich auf TerraBus? TerraBus gibt es das überhaupt? Okay, das ist tatsächlich ein Bus, alles klar. Ich war aber nah dran, TerraBus war das. Ja, die meine ich. Weiß ich, ob die jetzt im Knast gelandet ist? Also das war auch so richtig, richtig massive Scam. Da gab es dann irgendwelche Wellness und Hotelketten, die den Kram gekauft haben und am Ende haben die Sachen diagnostiziert bei Leuten, was sie nie hatten. Nee, nee, die meine ich nicht. Ich meinte hier diese Elisabeth Homes. Ja, den gibt es auch. Weiß ich gar nicht. Das ist so ein lila Ding gewesen, oder? Ich habe Brick und Morty nie großartig geguckt, aber den Plumbus oder wie man das ausführt, den kenne ich auch. Das ist auch so eine Serie, wo ich total oft gelesen habe, dass man das eigentlich nicht weiter als, glaube ich, zweite Staffel oder so gucken muss, weil ihnen dann irgendwie die Ideen ausgegangen sind. Ich weiß nicht, ob das stimmt. Habe ich gelesen, keine Ahnung. Nie groß geguckt. So Leute, also ich sage euch mal, was wir heute vorhaben. Ich habe nichts großartig vor. Ich bin mega im Arsch, weil ich heute mal wieder sinnloserweise nach Frankfurt fahren musste, dementsprechend früher aufstehen und hin und zurück. Und mir sind die Leute heute im Zug schon wieder richtig auf den Sack gegangen. Es ist unglaublich, wie die das schaffen. In den Zug eingestiegen und morgen gegenüber, also stimmt nicht, also eine Sitzreihe vor mir, eine gehabt, die am Telefon rumschreit, weil sie daheim irgendwas gesucht haben und nicht gefunden. Also laut gesprochen, nicht wirklich ist es törig rumgeschrien, sondern laut gesprochen. Alter, haltet doch einer mal die Klappe. Und dann war es auch noch so voll wieder. Dann hatte ich eine Kontrollfrau, die nicht wusste, wie man oder es nicht auf die Reihe gekriegt hat, meine Karte zu kontrollieren im, wie nennt man das, Kartenschutzbehälter. Ich habe so elektronisches Ticket und das hat irgendwie nicht funktioniert. Und da muss ich das rausfummeln. Dabei habe ich meine Eintrittskarte und meine Fahrkarte und das Geld alles in so einem Schutzbehälter reingestopft, dass ich eben alles zusammen in der Tasche habe. Die Leute gehen mir einfach drauf. Ich soll mich einfach in Ruhe lassen. Tja, dafür, dafür, warte mal auf das 9 Euro Ticket. Ganz ehrlich, ich finde die Idee von dem 9 Euro Ticket nicht schlecht. Gerade, also aus mehreren Gründen, aus mehreren Gründen. Und ob das mit mit Sylt so krass wird, wie die Leute denken, da habe ich eh so meine Zweifel, aber warten wir mal ab, warten wir mal ab. Ich finde, ich finde das 9 Euro Ticket aus mehreren Gründen gut. Erstens finde ich, dass das prinzipiell eine gute Idee ist, wenn man den Leuten sagen möchte, sie sollen nicht mit dem Auto in die Stadt fahren und das teilweise sogar schon denkt, dass per Gesetzverordnung auch immer die Leute vorzuschreiben, nicht mehr mit dem Auto in die Stadt zu fahren, dann muss man ja irgendwie Alternativen schaffen. Zum Glück hat sich das dann nicht durchgesetzt mit dem Verbieten, das wäre auch absolut nicht praktikabel gewesen, aber das könnte ja zumindest ein erster Schritt sein, wenn man das irgendwie dann beibehält, wo bestimmt einige Leute sagen würden, hey, das ist so viel günstiger als Auto fahren, das würde ich machen. So, ganz kostenlos, weiß ich nicht, ob es eine gute Idee ist, weil dann hast du auch quasi die ganzen Assis den ganzen Tag nur noch in der Bahn abgammeln, das wird vielleicht bei dem 9 Euro Ticket schon ein bisschen so sein, aber ich glaube, bei 9 Euro, da ist es so, die ganz Ultra Assis, die überlegen sich dann auch nochmal bei 9 Euro. Naja, zumindest der zweite Grund, warum ich es gut finde, dass noch mehr Leute mal auf den Boden der Tatsache geholt werden, den Satz muss ich neu anfangen, dass noch ein paar mehr Leute damit jetzt quasi in Kontakt kommen mit der Bahn und auf den Boden der Tatsachen geholt werden, was für ein absoluter Picker-Drecks-Verein die Bahn ist. Und ich rede nicht von irgendwie dem Einzelnen, der sich täglich den Arsch aufreißt, dass es doch noch funktioniert, sondern ich meine das Gesamtkonzept, also das Gesamtkonstrukt. Das ist der allerletzte Scheißhaufen, die Bahn und ich hoffe, dass dadurch noch mehr Leute das mitbekommen und sich vielleicht mal irgendwas tut, außer schön gerechnete Statistiken. Also das sind so die Gründe, warum ich das eigentlich ganz gut finde. Nur die Leute, wo ich es nicht gut finde, ist, die darunter leiden müssen, die eventuell dann im Berufsverkehr quasi gar nicht mehr durchkommen und eventuell dann Auto fahren, weil sie wirklich, müssen wir mal gucken, da bin ich gespannt, da bin ich gespannt. Ich habe ja schon, ich habe ja schon die ersten Kommentare gelesen, die gesagt haben, man sollte es im Berufsverkehr verbieten. Dann kamen die nächsten Leute an, die gesagt haben, ja, man sollte verbieten, dass die Leute, die ein 9-Euro-Ticket haben, noch überhaupt fahren mit dem Auto. Und wisst ihr, was ich mir bei solchen Kommentaren immer denke? Wie wär's dann einfach mit gar nichts verbieten? Muss man jeden Scheiß verbieten, immer wenn einem nichts besseres einfällt als Alternative. Gibt es auch so viel Anreize, die man setzen kann, Sachen, wie man, wie man Dinge beeinflussen kann, ohne gleich zu sagen, nee, alles oder nichts. Naja. Ich bin mal gespannt, was da dran wird. Ehrlich gesagt habe ich keine Ahnung, aber auf jeden Fall ein ganz, ganz großer Teil. Aber es müssen eigentlich 100% Anteile der Bahn gehören, weil die Bahn ist ja nie so wirklich öffentlich an die Börse und konnte da gehandelt werden. Das heißt jetzt zwar nicht zwangsläufig, dass alles 100% ich dem, ich weiß es nicht, keine Ahnung. Naja, aber dann wird Geld wenigstens mal für was verbrannt, wo man was von hat. Ja, gut, das kannst du bei allem sagen. Wenn es danach geht, darfst du dir auch kein Elektroauto kaufen, weil nichts ist umweltschonender, als ein altes Schrottauto noch weiter zu fahren, bis es letztendlich auseinanderfällt. Aber ja, ich, ich, also wie sagt man, ich gette den Point, ja, da ist natürlich schon was dran. Scheiß Satz, Alter. Gettet ihr auch manchmal den Point, Leute? Pains Jam. Ich bin mal gespannt, was da rauskommt. Ich bin ja auch mal gespannt, ob das überhaupt, ist das eigentlich mittlerweile alles genehmigt und geregelt und so. Ich bin ja auch mal gespannt. Nee, ist ja nicht durch. Ob sie das wirklich schaffen, bis, man soll es ja angeblich irgendwie ab 5. Mai oder so, 25. Mai kaufen können. Ich bin mal wirklich gespannt, ob das überhaupt möglich ist. Also wisst ihr, wie ich meine, ich bin mal gespannt, ob sie das überhaupt hinbekommen, das zu genehmigen. Ich, ich, ich hab da nicht so, wie soll ich sagen, ich hab da nicht so hohes Vertrauen, weil ihr erinnert euch vielleicht noch, okay, das ist jetzt ein bisschen was anderes, aber es ist immer das beste Beispiel, was mir dafür einfällt. Ihr erinnert euch doch vielleicht noch daran, dass wir abgestimmt haben, wie es mit Sommer-Winterzeit-Umstellung aussieht. Da ist auch nicht so viel passiert, obwohl alle gesagt haben, so ein Scheiß weg damit. Moin, WoutsTronic. Tommy schreibt, wollt ihr mal live danke sagen, ich schaue seit 2014 deine Videos und hab dir, hab dank dir mein Interesse zu IT geworden. Das finde ich immer schön, wenn das Leute schreiben. Du bist nicht der Erste, der da schreibt. Das finde ich aber immer cool. Ich muss dazu sagen, mittlerweile mache ich ja auch Videos manchmal mit dem Hinblick drauf, weil ich jetzt weiß, dass Leute sich den Graben angucken, die vielleicht in Zukunft in diese Richtung gehen werden oder gehen wollen, ja. Damals habe ich Videos, ehrlich gesagt, auch wenn es sich so angehört hat, weniger mit dem Hintergedanken gemacht, weil es mir gar nicht klar war, dass es, weil ich es wirklich realisiert habe, dass das tatsächlich Leute beeinflusst oder man könnte ja sagen, quasi influenced, wie das heutzutage heißt, dass da was zu machen. Aber ich finde, ich finde, ich finde das immer schön zu lesen, ja. So, also heute mit 21 Jahren arbeite ich. Okay, wenn du heute 21 bist, warst du damals eines der ganzen 12-jährigen Call of Duty Kinder, die rumgeflapt haben unter den Channels, gib es zu, unter den Videos. Da gibt es ganz viele. Chat, wer von euch war da auch dabei? Ganz viele, ich weiß es auch von vielen Kommentaren. Genau so einer war ich, ja, war klar. Heute mit 21 Jahren arbeite ich bei einem großen Automobilkonzern in der Entwicklung und mache viel Geld nebenher als Freelancer mit anderen Projekten. Dadurch, durch die habe ich sehr früh selber Programmieren beigebracht, mich viel weiter gemeldet in Sachen harten Software, ich war ständig von meinem Vorgesetzten gelobt. Na dann, siehst du man, besser, besser konnte es doch gar nicht laufen. Du musst nur gucken, es fällt mir gerade an der Stelle ein, ich weiß ja nicht, was, was da jetzt genau dahinter steckt. Du musst nur gucken, dass sie dich ordentlich bezahlen und nicht ausbeuten. Das ist auch was, das habe ich erst später kapiert, da habe ich früher auch nichts so gesagt in Videos, weil es gibt manche Leute, gerade im Management, die haben da Talente für, sie haben ein gewisses Gespür dafür, was Leute hören wollen und erzählen das dann den Leuten und die geben sich damit zu Frieden und fragen nicht nach mehr Geld. Aber wenn du sagst, du verdienst viel Kohle, dann ist ja alles in Ordnung. Aber man sieht es bei unseren Pflegekräften und den Leuten im Supermarkt, hast du nicht gesehen, rein mit warmen Worten bezahlt sich halt auch nichts. Wer ist der FyFat-Content auf YouTube? Ja, so sieht es aus, aber es gibt noch mehr FyFat-Channels. Aber es ist schön, dass das funktioniert hat. Ja, übrigens, achso, also wer darauf hofft, dass wir heute irgendwas weiter programmieren oder basteln oder so, ich bin viel zu sehr im Arsch, ich kann heute nichts großartig machen. Neues Armor schon gesehen? Nee. Ja, dann ist doch alles gut. Naja, das kommt natürlich ganz entscheidend darauf an, ob sich dein Aufgabenfeld erweitert hat, ob du jetzt andere Sachen machst, ob sich vielleicht grundsätzlich was geändert hat, ob du jetzt andere Positionen hast oder sonst was. Das kann man so pauschal schlecht sagen. Das kommt auf sehr vieles an. Ich tue mir da selbst auch immer schwer, mir was zu überlegen, was ich sagen könnte. Aber eine Sache hat sich mittlerweile, das habe ich auch glaube ich in dem Video mal erzählt, also eine Sache hat sich bei mir da, wie soll ich sagen, als lohnend rausgestellt oder als sinnvoll rausgestellt immer mehr sagen als das, mit dem du zufrieden bist oder als das, was du haben willst oder. Ja, also was weiß ich? Was weiß ich? Sagen wir sagen, du verdienst 2000 Euro im Monat und du würdest gerne 2200 Euro im Monat verdienen und das ist halt auch das, was du anstrebst. Dann kannst du nicht sagen, du möchtest 200 Euro mehr oder 10 Prozent mehr, was bei manche denken, das ist super viel. Also gerade bei uns machen sie auch, wenn du bei einem zweistelligen Betrag ankommst, machen sie immer, machen sie Augen, ne, mach Auge oder wie sagt man da mittlerweile? Sie machen Auge, wenn du da mit was zweistelligem ankommst. Aber ganz im Ernst, sag ruhig das Doppelte von dem, was du haben willst. Das wirst du wahrscheinlich nicht kriegen, aber dann kommt am Ende irgendwas anderes bei rum, wo du wahrscheinlich eher mit zufrieden bist, als wenn du mit kleineren Sachen ins Rennen gehst. Und selbst wenn sich am Anfang aus deinem Bauchgefühl unverschämt anhört, so viel zu sagen, es kann dir nichts passieren. Die werden dich wegen einer etwas überhöhten Gehaltsvorstellung sicherlich nicht rausschmeißen. Im Zweifelsfall lacht man dann mal drüber und dein Chef sagt, er guckt mal, was er für dich tun kann oder was auch immer. Aber es ist auf jeden Fall besser, als zu niedrig anzufangen oder glatt mit dem, mit dem du zufrieden bist. Weil natürlich, das verspricht dir am Ende nicht, dass das dann auch wirklich genau das wird, was du haben willst. Aber das hat sich bei mir ganz gut bewährt. Reforger. Das heißt nicht wirklich Reforger, oder? Der Name ist etwas verbrannt seit Warcraft. Ich meine, das heißt, das hieß Reforged und das heißt Reforger, aber die Benamung ist schon Pains Champ. Das läuft wahrscheinlich nur auf dem absoluten NASA PC. Arma läuft nie gut und jetzt ist eh vorbei. Noch, noch, noch einen neuen. Warum sind die Leute nicht zufrieden? Simplified. Moment, Moment. Die können Arma nicht simplifien. Wenn die Arma simplifien hat Arma keine Daseinsberechtigung mehr. Jetzt ohne Scheiß. Das ist der Selling Point für Arma, dass es noch mehr oder weniger Simulation ist. Das sind ja, glaube ich, die gleichen Leute, die früher auch Operation Flashpoint und sowas gemacht haben. Bin mir nicht ganz sicher, aber ich glaube schon. Und ich glaube, die haben auch tatsächlich für Militärs auf der Welt und sowas Simulation und Sachen schon entwickelt. Also, die haben Plan. Und was ist die Daseinsberechtigung von Arma, wenn Arma mit dem Controller easy spielbar und vercasualt ist? Also, Patrick ist, ich bin kaputt als fuck, das geht. Immer gespannt. Ich bin kein großer Arma-Spieler. Kann ich nichts zu sagen. Da kennt sich der Patrick mit aus. Was ich gemacht habe, ich musste sinnvollerweise unsinnigerweise heute nach Frankfurt fahren für einen ganzen Tag voller Gemiete, die ich dann doch bis auf eines über Teams gemacht habe. Alles klar. Muss man Arma mit Semper-Video spielen? Also, ich kenne erstens Semper-Video nicht persönlich und zweitens kann ich Arma nicht. Ich glaube, okay, ich lehne mich jetzt mal aus dem Fenster. Ich habe keine Ahnung, wie gut der Sprecher in Games ist, aber wahrscheinlich wird er jetzt auch nicht der überkrasse Arma-Basher sein. Das hat sich richtig gelohnt, nach Frankfurt zu fahren dafür heute. Ihr müsst ja eure neue Placing-Machine da hinbekommen. On-Prem-Video-Konferenz. Ja, habe ich heute quasi gemacht. Ich habe den ganzen Tag gemietet. Über Teams vor Ort. Richtig bescheuert. Wie viele Leute seid ihr denn mittlerweile? Wobei ihr braucht das wahrscheinlich hauptsächlich für irgendwelche Maschinen und Sachen, die da rumstehen. Gehe ich mal von aus. Aber Leute, wenn ihr einen fragen wollt, der sich mit Verhandlungen auskennt, fragt den Patrick. Der sagt einfach, bezahlt jetzt mal ordentlich oder ich hau ab. Oder fickt euch, macht was ihr wollt und dann sagen die alle, ja, wir bezahlen jetzt ordentlich. Ganz einfach, easy, so musst du es machen. Ich habe mal eine andere Frage an euch. Hat mal einer zufälligerweise diesen Hersteller bei USVs ausprobiert? Ich weiß, random, super random Themenwechsel hat mal einer das da ausprobiert. Also nicht explizit die, sondern hat mal einer was von dem Hersteller gehabt? Weil, ich bin immer noch am überlegen, ob ich mir nicht doch eine USV ins Rack haue. Ich habe eine, taugt die. Und was ich viel interessanter finde, läuft die weiter, wenn die Batterie abkackt. Also, noch mal so für alle, ich hab's letztens nicht mehr erzählt. Ich hatte ja eine Cyber Power USV Rack. Ja, so ein Teil hier in der Richtung hatte ich so was da. Sieht ziemlich genauso aus wie das. Alter, wir hatten das Bild, das ist ja mal. Igitt, was ist mit eurem Background los? Also so ein Teil in der Richtung hatte ich. Und das Problem damit war, was ist das für ein abfuck Hintergrund, man? Ist das von Chrome der neueste transparent Background oder was? So, also da hatte ich welche. Und auf eines Morgens, ich hatte, ich kanns euch ja mal zeigen, ich bin mir gar nicht sehr, wie heißt das Ding? Cyber Power 600. Ja, das wird's wahrscheinlich sein. Das sieht sehr genau aus, wie das, was ich aktuell hab. Oder besser gesagt, auch im Rack hängen habe, aber nicht mehr verwende. So, also das Problem, was ich damit hatte, ist, die hat immer wunderbar funktioniert. Überhaupt gar kein Problem. Eines Tages war mein komplettes Rack aus. Und ich denk mir, warum? Stromausfall oder was? Nö, Strom geht. Was passiert ist, der Akku war kaputt. Und da hat sich die USB einfach gedacht, ja, wenn der Akku kaputt ist, dann bin ich auch kaputt. Dann geht gar nix mehr. So, und ich kann mich ja noch dunkel dran erinnern, dass es verschiedene Typen von USBs gibt. Also erst einmal so die klassische USB, die tatsächlich umschaltet, wenn, das Strom, wenn Stromausfall ist. So, dann hast du Sachen, die das permanent durch die Batterie leiten. Und dann hast du noch irgendwas drin, das weiß ich jetzt aber gerade vergessen habe. So, und wahrscheinlich war das hier so eine, die das durch die Batterie leitet. Das ist natürlich, hat seine Vorteile, ja, zum Beispiel, dass es keine Spannungsspitzen gibt oder sonst was. Aber ganz im Ernst, ich hab keinen Bock, dass von fünf Jahren der einzige Ausfall ist, nicht der Stromausfall, sondern das mein USB verreckt und der Akku wird früher oder später verrecken. So, das heißt, ich will eine USB, ich will quasi die billigste USB von der Bauart haben, ich will eine USB, die einfach geht und den Strom durchleitet, solang Strom da ist. So, also ihr sagt, dass der Hersteller taugt was, ich weiß halt nicht, ob das, was der USB hier auch so ist. Also im Zweifelsfall wäre cool, wenn man die auch aufmachen könnte und den Akku wechseln, ohne dass man das ausschalten muss. Wobei ich mir vorstellen könnte, dass das nicht so gebaut ist, du kommst da wahrscheinlich gar nicht richtig dran. Ja, ich will ja auch keine 300 Euro USB. Ja, also meint ihr sowas? Ja, kannst du bei dem Ding, kannst du dort die Batterie im laufenden Betrieb wechseln, geht das? Also könntest du, ich weiß gar nicht, wie man die öffnet hier, keine Ahnung. Ich guck mal kurz in das Handbuch. Manual. Die Sonnenkönig Eco. Äh, das glaube ich einfach nur schlecht übersetzt, oder? So, wie tauscht man, wie tauscht man denn hier Batterien? Wie ich solche Bedienungsanleitungen hasse, Alter. Das ist absoluter, absoluter Schmutz, wie man da so heute sagte. Ihr wisst, Hello Fellow Kids, ich muss bisschen Jugendsprache trainieren, um am Puls der Zeit zu bleiben. Ja, ich hab gehört, man so Schmutz sagt man da jetzt dazu. Nicht mehr Dreck, früher hat man gesagt Dreck, mittlerweile sagt man Schmutz. Aber war Schmutz nicht vor drei Jahren? Ah, kann sein, kann sein. Möglich. Sus. Bald mach ich das wie die Tagesschau-Sprecherin. Sus. Die haben glaube ich, ich glaube diesen Tagesschau-Clip haben die hochgeladen, weil irgendjemand dort erkannt hat, das hat Meme-Potenzial. Irgendeiner von den Nicht-Boomer-Mitarbeitern dort bei der ARD hat das kapiert und hat das hochgeladen, hat Gold richtig damit gelegen. Ist Digger, ist Digger wirklich immer noch angesagt? Digger war doch vor fünf Jahren schon. Was ist es denn jetzt wieder? Brudi? Ne, immer noch Digger? Das sagt man immer noch Digger? Also wir haben immer gesagt Alter, das sag ich ja immer noch. Alter. Digger sagt man immer noch, jetzt ist es auch langsam schwierig. Wenn Bruder durch ist, Alter durch ist Digger durch ist. Valar, ja Valar hat ja nichts mit Digger zu tun. Wobei das hat auch abgenommen. Bratan ist richtig cringe. So, also wie tauscht man denn jetzt die Batterien? Also aktuell seh ich da halt einfach nur Stecker, da wäre ich auf die Idee, da wäre ich auch selbst noch gekommen. Beep, machts da wenn man da drauf drückt. Sehr schön. Das hätte ich mir nicht gedacht. Aha, Battery Change. Kann man das im laufenden Blittrieb machen? Take care not to inverse polarity. Wie wärs damit, wenn man die Stecker einfach unterschiedlich macht, dass man nicht polarity reversen kann? Save nicht, kauf einfach alle vier Jahre eine neue, da muss ich ja alle vier Jahre einmal ausschalten, um eine neue anzuschließen. Auf der anderen Seite Patrick, ich glaube, das ist gar keine so blöde Idee. Weil ganz im Ernst 84 Euro alle vier Jahre kann man sich eigentlich mal gönnen. Oder ich mach so wie bisher und lass einfach das ganze Ding ohne USV laufen, weil seit meine letzte verreckt ist hab ich auch nichts dran, es ist noch nie was passiert. Aber es ist noch nie was passiert, Famous Last Words, ihr wisst ja. Am Endeffekt ist dann irgendwie das Raid korrupt, wobei ich ja gar kein richtiges Raid im klassischen Sinn mehr hab. Die sagen nicht explizit, dass man, ach doch, guck mal, man muss soll rausziehen. Die sagen, man soll den Stecker raus machen, bevor man die Batterie wechselt. Ok, also man soll ausschalten. Ok, Batterie charge, ne, change, change, change. Weil vielleicht, Chet, was mein dir? Soll ich einfach YOLO Modus weiterfahren, scheiß drauf, ohne USV? Was würdet ihr machen? Also man weiß halt nicht, was da auf einen zukommt. Es kann morgen der Stromausfall sein oder halt auch nie. Meint ihr eine USV? Vom Preis erscheint die ja ok zu sein. Aber ich will die mit USV, ich will die mit USV. Also die ist kacke, ich brauch die mit USV. Also bräuchte ich mindestens die hier, 106 Euro. Weil ohne USV ist Müll. Ich muss den Status auslesen können. Äh, ja was hat die jetzt eigentlich für Anschlüsse? Hat die so Kaltgerätestecker oder hat die Schoko-Dosen? Dean im Namen lässt mich darauf schließen, dass die Schoko-Dosen hat und keine Kaltgerätestecker. Kann die andere das nicht auch? Die hat, ne, das glaube ich nicht. Ich glaube die Netzwerkstecke hier oben sind rein Überspannungsschutz. Glaub nicht, dass da eh. Das ist ja wahnsinnig gut aufgelöstes Bild hier. Ne, das ist glaube ich einfach ein Überspannungsschutz. Ich glaube nicht, dass die Netzwerk Connect hat. Das wird mich bei dem Preis wirklich wundern. Also die haben ja eher USB-Verbindung bevor sie Netzwerkverbindung haben. Also Anschlüsse erklären ist out, das braucht man nicht. Guck mal, FR Dean hat Stecker? Ne, doch. Okay, das ist überhaupt nicht. Ich bin überhaupt nicht dran, ich traine Network. Ne, Modern Ethernet can be protected in searches. Okay, das hat kein, das hat keine Datenaustausch. Das ist nur, das ist rein Überspannungsschutz. Joa. Also, zeig mal her. Ja, deswegen will ich auch ne billige. Ich will, dass es weiter läuft, wenn die Batterie verreckt. Ich will nicht den Akku überbrücken. Ich will, dass das Ding weiter läuft, solange Strom aus der Steckdose kommt, auch wenn der Akku im Zweifelsfall rausgezogen ist. Das soll einfach funktionieren, solange Strom aus der Wand kommt. Es gibt Videos. Okay, okay, Sekunde. Change Battery. Ja, das ist so ne super fette. Das sind ja, das sind ja die Profi-Dinger. Da komm ich nicht weit mit. Wie heißen die normale? Ellipse? Replace Battery. Okay, zeig her. Ja, super, da hat die nicht angeschlossen. Das ist jetzt ja auch nichts, nichts, äh, nichts sagend. Das, das krieg ich, ja, das krieg ich schon hin, die zu wechseln. Frage ist halt, wie sieht's aus, wenn die abgeschl... Also, wenn die nicht angeschlossen ist. Die machen das alle ab? Machen das alle ab? Okay, how to change battery? Switch OPS off from the front panel and unplug. Ah, das ist doch Dreck alles, oder? Ich kauf mir keine USB, scheiß drauf. Lass es einfach, wie's ist. Und wenn's ausfällt, fällt's aus. Gibt doch hier eh kaum Stromausfälle. Naja, um den Preis, was ich erwarte? Naja, solange Strom aus der Leitung kommt, es weiterläuft. Das ist die billigste Art von USBs, weil die nur umschalten, wenn wirklich der Strom ausfällt. Warum sollte der Strom ausgehen, wenn es überhaupt nicht durch die Batterie läuft? Im RZ schaltet keiner seine USB aus beim Batteriewechsel. Ah ja, du hast auch im Zweifelsfall zwei, aber das bei uns ein USB ausgeschaltet, um die Batterie zu wechseln, hab ich noch nie mitgekriegt. Schmutzdigger, genau. Ich will die Batterie nicht im laufenden Betrieb wechseln, auch wenn ich das die ganze Zeit sage. Mir geht's da drum, dass wenn die Batterie den Geist aufgibt durch Altersschwäche, dass es weiterläuft, solange Strom aus der Wand kommt. Ich hab keinen Bock, dass in drei Jahren wird da mein Rack verreckt, nicht weil der Strom ausfällt, sondern weil die USB im Arsch ist. Ey, es sind bei uns auch schon so viele bescheuerte Sachen passiert, weil Techniker nicht aufgepasst haben. Das eine Video hab ich euch ja mal erzählt, mit dem USB Stick, den sie in den Fahrstuhl geworfen haben, ausversehen durch den Schlitz. Naja, nee Leute, keine USB. Was hab ich denn hier noch im Bars getrennt? Theoretisch müssen wir endlich mal, die hab ich übrigens mittlerweile gekauft, die Wetterstation. Oh, Massive Ersparnis, Leute. Decreased von 69,96 auf 58,57. Und da sagt mal einer, es wird alles teurer. Das ist der Gegenbeweis hier. Ja, dann ist gut, das wäre zum Beispiel was, warum ich hier wieder eine hinstellen würde. Die dürfen ruhig maulen, wenn die Batterie kaputt ist, aber das Rack soll nicht ausgehen. Hauptsache man kann sie muten. Hä? Ach so. Ich habe keine Ahnung, wie ich das geschafft hab. Taskbar Settings. So anscheinend. Nee, Colors. Custom. Anscheinend so, ich hab keinen Plan. Ach so, hier unten hab ich das abgehakt irgendwie. Custom Color ist doch nur. Ah nee, Window ist im Dark Mode, App ist im Light Mode. Alles klar. Was man da alles für widersprüchliche Dinger machen muss, dass Windows das macht, was man haben will. Es gibt Wasserkocher, auf die du das Motor flashen kannst. Echt? Zeig Link, wo? Das wäre was für mich. Eton Flex. Nee, das ist keine USB, das ist einfach nur eine Stromleiste. Das ist keine USB, oder? Ach doch. Welche davon? Die kleinste, hä? Welche davon? Die sind mir so kryptisch benannt. Den hier zum Beispiel. Okay, okay. Ach so, Moment. Profi... Nein. Profi Kuck. Hat nichts mit Jep Kuck zu tun. Profi Kuck. PC WKS 2-in-1 Tea-Water-Kettle. Warum entsteht das bei mir eigentlich auf Deutsch? Und man kann allen Ernstes das Ding flaschen. Da ist ein ESP 2866 drin. Das ist ja mal ein Pog, Alter. Das brauche ich. Ein flashbarer Wasserkocher. Aber der hat nicht wirklich gute Bewertung, oder? Warum nicht? Alles irgendwelche Fake-Reviews. Das Teil funkt ausschließlich im 4,5 GHz Netz. Ja, okay, die Bewertungen sind wahrscheinlich schlecht, weil die App kacke ist. Und das umgehe ich ja komplett, weil ich die App nicht verwende. Aber die Sache ist halt die Chat, ihr habt recht. Du musst ja Wasser eh von Hand reinfüllen. Ich meine, du könntest abends Wasser reinfüllen und morgens dann einschalten. Das wäre zum Beispiel nicht schlecht. Du könntest es abends voll machen und morgens, wenn du dir Tee kochen willst, drückst, geht es dann schon an, wenn deine Heimautomatisierung erkennt. So krass verkalkt das über Nacht auch nicht. Zumal selbst wenn da irgendwas drin wäre und sich vermehrt über Nacht, wenn du es kochst, ist es eh vorbei. Also, had to return. Warum? It turned on whilst being empty. Moment, das hat kein Check dagegen, ob da nicht Wasser, ob es leer ist. Also jeder normale ordentliche Wasserkocher hat ein Check drin, ob Wasser drin ist oder nicht. Aber wenn du es flaschen kannst, ist es ein China-Chinesen-Gerät, oder? Hersteller? ProfiCookStore. Ok, das könnte durchaus ein China-Chinesen Zeug sein vom Namen her. ProfiCook.de. Deutschlands Beste. Das ist einfach nur re-branded oder so. Impressum. Ok, das ist anscheinend wirklich eine deutsche Firma, aber vielleicht ist es re-branded. Auf der anderen Seite, wenn es sogar bei Tasmota als ProfiCook drinne steht. So, die Frage ist, kann man den aktuell überhaupt noch flaschen? Guck mal AliExpress, da muss ich aber nicht nach ProfiCook suchen, sondern nach was soll ich denn suchen auf AliExpress? It's 2 in 1 Tea & Water Kettle. Wieder was gelernt, weil ich wusste gar nicht, dass es Kettle heißt. Aber heute haben wir keine Hose zu ficken. Also wenn ich dabei war und ich frage, was labert da, Max? Letztes Mal Vorschlag bei AliExpress war, nach was ich suchen soll, Hose für Ficken. Autovervollständigung. Als ich die Seite das erste Mal geladen habe. Genau, da gibts. Guck mal, es gibt sogar eine Xiaomi-Mijia-Dinger, bestimmt Zigbee Übertragung. Also die Dinger sehen eindeutig zu futuristisch aus, dass sie gescheit funktionieren. Ah ja, der ist bestimmt, also Leute, ich glaube, den bestelle ich, den 5,99€ China-Chinesen Wasserkocher. Der ist bestimmt genau das Richtige. Der hat bestimmt auch alle Prüfzeichen, die sind bestimmt auch alle echt. Es ist anscheinend nicht Reprinted, ich sehe hier keinen. Moment. Der sieht dem doch, nee. Anderer. Das Motor. Nee. Okay, und den kann man wirklich flashen, ja? Das muss ich jetzt gleich mal. Ich mein, es spricht auch für, dass es kaum andere Geräte gibt, die exakt genauso aussehen. Okay, das muss ich jetzt gleich mal checken. Erstmal muss ich die Musik wieder anmachen. Ja, komm. Wo sind wir stehen geblieben hier? Das kann man jetzt wirklich flashen, oder? Das muss ich jetzt mal in den Kommentaren gucken. Das Motor. Das Motor. Ah, November 2022. Ob sich das eineinhalb Jahre jetzt noch flashen lässt? Flash. Schwer zu sagen. Vielleicht lässt sich das auch nicht mehr flashen. Hm. Ich weiß nicht, ob ich das auf gut Glück kaufen soll, Leute. Eigentlich ist es zu teuer für so was Unsinniges. 60€. Aber wenn das Ding, Leute, das muss ein China-Chinesen-Produkt sein. Okay, China. Heißt das wirklich Waterkette? Wi-Fi. AliExpress. Das muss ein Reprint sein. Wenn es kein Reprint ist, dann wäre das doch kein Tuya Zeug. Dann hätten die ein ordentliches Webinterface gemacht oder so. Da stand Warning wegen Wi-Fi. Was? Ja, das steht bei allen Tuya Sachen. Ich weiß, ich weiß. Aber vielleicht ist es ja tatsächlich in dem Fall auch so. Das sieht erst mal relativ ähnlich. Hier, da ist er. Das ist er doch, oder? Das sieht sehr ähnlich aus, das Ding. Die Basis ist ein bisschen anders. Die Basis ist ein bisschen anders. Aber guck mal. Mobile. Hä? Das sieht da wieder komplett anders aus. Aber das da hinten? Wieso willst du das Ding flashen? Naja, weil ich alles flashe, was flashbar ist. Nee, das sieht tatsächlich anders aus. Der Profi Kok. Der Griff ist auch ganz anders. Ja, da finde ich das passende China-Chinesen-Produkt nicht. Ich verstehe den Sinn auch nicht. Deswegen werde ich es mir wahrscheinlich nicht kaufen. Der Sinn erschließt sich mir nämlich wirklich nicht. Das Einzige, was mir einfällt, ist, man könnte abends Wasser reinmachen und es dann morgen kochen lassen, wenn man ins Bad geht oder so. Aber naja. Das könnte man auch anders mit einer Wi-Fi-schaltbaren Steckdose könnte man das genauso machen. Ich glaube, ich werde das nicht kaufen. Okay, welche davon sollte ich mir denn jetzt angucken, dass ich weiß, wie das preislich liegt? Doch, ich brauche einen Wasserkocher. Ich wollte mir eigentlich den Wasserkocher hier holen, weil ich habe quasi den davor und der hat jetzt irgendwie 13 Jahre gehalten oder so. Nee, 11. Nee, 9. 2013 habe ich den gekauft. Temperatur einstellen wäre auch sinnvoll. Na gut, das heißt Wasserkocher, weil man da mit Wasser kocht. Und Wasser kochen geht halt nur mit, also was brauchst du da Temperatur? Aber ja, das andere wäre ein Wasserkocher-Schrägstrich-Erwärmer, dann wäre das mit Temperatur sinnvoll. Mit dem Switchpot den Wasserhahn. Genau, ein Schlauch am Wasserhahn und dann mit dem Switchpot den Wasserhahn schalten. Exzellent. Das machen wir in der Chain-Lore. Kann ich das anklicken? Ich wusste mir das gerade mal. Bin ich mir bei dir immer nicht so sicher. Ich gucke mal auf dem zweiten Bildschirm, ob man sich das anschauen kann. Ah ja, okay, das ist safe. PokiW-Virgin-Check, I'm safe. Manchmal kommen mir unsinnigerweise solche dämlichen Copypasta in den Kopf. Ich weiß nicht warum. Ich habe heute auf der Arbeit Fivehead gesagt. Einfach so, Fivehead. Also sowas macht ihr in der 11. Klasse. Ist das ein Bild von euch aus dem Klassenraum? Nee, oder? Das ist bei dir aus dem Zimmer. Wobei, nee, das ist aus dem Klassenraum. Da ist ein Arm von irgendeinem anderen Dude. Okay, sowas macht ihr da mit dem guten allen Strukturizer 3.28-10 Krankenhaus. Krankenhaus? Und neben dran den Windows-Taschenrechner. Ich weiß ja nicht, ich weiß ja nicht was ich schlimmer finde. Die Kombination aus Oldest School, Anwendung plus UWP oder dass es Strukturgramme sind. Aber du hast deine Leiste und so schon mal im Dark Mode, das ist schon mal gut. By the way, Chain-Lore. Wie alt ist denn euer Windows? Weil das ist der Calculator vom vorletzten Feature-Update. Der aktuelle Calculator sieht so aus, auch in der Taskleiste. Das ist bestimmt noch LTS oder so von vor drei Jahren. Die machen kein Update. Genauso sieht das auch aus. Das wundert mich nicht. Hast du eine Smartwatch? Hab ich nicht. Kannst du dich aussprechen. Smartwatch. Okay, was macht ihr denn da, schönes Chain-Lore? Zeigt mal hier. Krankenhaus. Aufenthaltsdauer, Versicherungsart, Pflegeart. Okay, okay, ich geh mal in mich. Strukturgramm. Das hier sind so die Parameter, die man übergibt. In dem Fall halt. Okay, Kommandozeilen, Eingabe. Grundbetrag gleich 200 Euro. Versicherungsart, TF. Wie? Was ist T und F? Gesetzlich oder privat oder? Ne. Ach, True, False. Wie kann eine Versicherungsart True oder False sein? Wie? Hä? Okay, hat eine Versicherung oder hat keine, hat keine Versich... Okay, versichert. Versichert sollte das eigentlich bedeuten. Versichert, Fragezeichen. Ja, nein. Zuschlag. Warum muss man, warum muss man unversichert mehr bezahlen? Den Zuschlag gibt es doch sonst auch, oder? Oder na gut, das sind quasi Selbstzahler. Selbstzahler, wenn immer krasser zur Kasse gebeten, ja. Wobei das, wobei das so ohne weiteres gar nicht zulässig ist, du musst das, du musst das nach, äh, Dings hier Ärzte Gebührenordnung abrechnen und einfach random Zuschläge verteilen, bin ich mir nicht so sicher. Egal, das ist ja nur eine Aufgabe, das hat ja mit der Realität nichts zu tun. Also, ähm, Unterbringung, Verpflegungsart True, False. Ich wusste gar nicht, dass Verpflegungsart auch True oder False sein kann. Dieses Struktogramm ist einfach mal so krass useless. Warum macht man sowas? Kein Plan soll fast lernen, ja. Was auch immer, man da ist großartig lernt bei. Okay, okay, wie sie? Fy-FyFat. Oh, ich muss ja merken, wo ich war. Okay, wie sie? Erklär mir als super FyFat Entwickler, wie kann Verpflegungsart True oder False sein? Das will ich jetzt wissen. Was ist ein Verpflegungsart True oder False? Wenn du nur ein, ich hab keine Ahnung. False gleich verhungern. Ist das, ist das du bekommst Essen oder nicht? Dann, dann muss man das doch einfach nur Verpflegung Fragezeichen nennt, nicht Verpflegungsart. Aber das ist komplett useless, dieses Diagramm. Was soll einem das jetzt bringen? Also ich mein, anhand dessen könntest du immer noch nichts programmieren, weil du nicht mal weißt, wie du Eingabe machst. Aber gut, was auch immer, ich finde es bedenklich, dass ihr Struktogramme macht. Sogar der, hast du 15 von 15 bekommen, dann ist ja pock, dann ist ja alles gut. Sogar der Struktogramm-Erfinder hat ein paar Jahre später gesagt, dass Struktogramme nicht so der Weisheit letzter Schluss sind. Wenn es der Struktogramm-Erfinder sagt. Oje, schreib das mal nicht auf Twitter. Wenn du das auf Twitter schreibst, dann ist es richtig, dann ist es regert. Canceled. Früher, vor noch nicht allzu langer Zeit hättest du wahrscheinlich irgendwelche Konstanten so definieren können. Aber heutzutage würde ich das lieber sein lassen. Egal, gut, dass du 15 Punkte bekommen hast, Chainlord, pock. Was passiert eigentlich, wenn man da auf Debug klickt? Geht da dann die einzelnen Punkte durch oder so? Ich hab den Strukturizer schon 15 Jahre oder so nicht mehr verwendet. Ich kenn mich da nicht mehr so aus. Der Strukturizer, so ein Blödsinn. Aber der Taschenrechner ist am Start. Na gut, ich mein, kann man ja auch nicht erwarten, dass man das im Kopf rechnen kann. Das ist eindeutig zu schwer. 200 plus 100 plus 100 und dann vielleicht noch plus 7. Ok, mal auf den Hals Dauer wird es tatsächlich dann schon ein bisschen schwieriger. Ok, das verstehe ich, das verstehe ich. Ja, alles klar. Also wenn man das ganze mal 37 rechnen soll oder so, dann ja. Wirklich? Ich Strukturizer, ist das Java? Ich mein, das sieht so hässlich aus. Das könnte tatsächlich Java sein. Wahrscheinlich irgendwie, das ist doch nicht mal Swing. Was gab es denn vor Swing? Noch älter. Strukturizer, GitHub. AWT, stimmt. Strukturizer. Fischl, der ist es. Da gibt es gar keinen Sourcecode dazu. Der Strukturizer ist nicht Open Source, Anzeige. Wobei man kann keinen Anzeigen dafür, dass er nicht Open Source ist. Das wäre doch mal was, oder? Einfach gleich verklagen, wer nicht Open Source ist. Opening when complete. Ja, auf. Komm, es ist complete. Source? Trau ich es, mich aufzumachen. Wo ist mein VS Code? Hallo? Wozu? Wo ist es hin? Da ist es doch. Kann man das Track und Dropen? Nee, oder? Nee. Okay, okay. Trick 17. Notepad öffnen, neues File machen, einfügen und dann umstellen auf Java. Alter, was ein Ding. Wird immer noch regelmäßig updated. Okay Leute, erkennt man Java Experten? Erkennt man, was das für eine GUI Library ist, irgendwo ran? Main, der muss ja irgendwo das Fenster starten jetzt. Command Line Arguments. Der passt ganz viele. Sag mal, da gibt es noch einen Command Line Parser, oder? What the fuck? UI Manager, set look and feel. UI Manager, get. Okay, das ist, das ist. Können wir gucken, was das Java ist. UI Manager. Swing, Swing ist es. Alles klar, okay. Und ganz schnell, ganz schnell wieder weg. No. Nicht, nicht saven. Gut, wissen wir Bescheid. Swing. Aber eins muss man mal sagen, ich meine, der Kram funktioniert. Man kann sich da jetzt noch so viel drüber lustig machen, ja. Der hat was entwickelt, was wahrscheinlich schon mehr Leuten geholfen hat, als viele andere. So gut wie jeder in der Berufsschule oder jeder Informatiker oder Fachinformatiker oder sei es nur IT Klasse in der Schule benutzt irgendwann mal den Strukturizer. Wo kommt das neue Pepega Board? Wurde die Entwicklung getroppt? Naja, das tun für mich das Pepega Board. Für alle anderen muss das nicht tun, zumal das Pepega Board einige Ungereimtheiten hat. Man könnte auch sagen, Bugs, die es manchmal crashen lassen, wenn ich neue Bilder hinzufüge und es nicht in der richtigen Reihenfolge anklicke. Kannst du Weird Champing abspielen? Ja. Ups. Ja. Weird Champing. Und hinterher eine Runde Gachirole. So, gut. Wir haben Strukturkram tatsächlich teilweise noch von Hand gezeichnet. Und das war in der Berufsschule 2007 oder so herum. Also das ist doch gar nicht so lange her. Nicht so, dass es letztes Jahr 1000 war. 2007 ist jetzt auch schon ein bisschen her, aber es ist wie gesagt nicht letztes Jahr 1000 oder 1990 oder so. Von Handzeichen ist wahrscheinlich einfacher. Ich glaube die Software ist gar nicht so kacke. Für das, was es sein soll, ist doch gut. Weil da hat sich hingesetzt einfach Sinnvolles entwickelt. Passt doch. Ja, ich hab mal eine neue, ich hab mit FFm verpackt und der Renderer könnte tatsächlich DirectX gewesen sein, die Bilder ins Fenster rendern. Ja, das hab ich mal angefangen, dass solche Bilder wie das hier, guck, weil WPF ist richtig lahm. WPF ist richtig lahm bei sowas hier, guck. Bei manchen GIFs, die etwas bessere Auflösung haben und mehr FPS. Ich hab jetzt schon längst geklickt und es kommt immer noch nichts. Guck, das ist richtig, richtig lahm. Und das hab ich gerendert mit FFm pack und das war instant da. FFm pack ist richtig massive Pog. Ja, FFm pack ist das beste oder eines der besten. Übrigens, Chat, wo wir gerade dabei sind. Ganz kurz, zwei Minuten. Ich weiß, dass nicht alle dabei waren. Ich habe rausbekommen, woran das mit dem Filename lag. Erinnert ihr euch noch dran, dass wir gestern versucht haben, was zu programmieren? Wo ich auf meine Router-API zugreifen wollte. Ich habe rausbekommen, woran es lag. Passt mal auf. Wie gesagt, zwei Minuten. Wenn ich dabei war, wird es jetzt nicht checken. Ich zeige euch, woran es gelegen hat. Die eine Stelle, woran es gelegen hat, zeige ich euch. So, auf, geh an. Und zwar, es war die Reihenfolge. Es muss sein, Name gleich u und die.NET Library hat geschrieben, Filename gleich. Und danach, also das hier und das hier war vertauscht. Ihr habt es glaube ich gesehen. Die Reihenfolge ist das Problem gewesen. Korrekt. Also sprich, das hier und das hier muss vertauscht werden. Wobei das vertauscht in der Klasse nicht getan hat logischerweise. Ich musste wirklich das von Hand String interpolate die Message. Dann hat es funktioniert. Habe ich ausprobiert. Also die Reihenfolge ist entscheidend. Ich gehe davon aus, dass das nicht standardkonform ist. Ne, ich mache jetzt mal mein Tool fertig. Also ich will zumindest über Kommandozeile WLANs auflisten können, User auflisten können und neue User anlegen. Dann verwende ich den, ja. Aber das ist garantiert nicht standardkonform, weil ich, also ich habe ihn nicht gelesen, aber ich gehe ganz stark davon aus, im Standard steht die Reihenfolge, der Felder ist egal, weil die Library generiert nicht ohne Grund das so. Ich meine, das ist der offizielle unter der Haube, der offizielle HTTP-Klein von.NET. Dass der nicht standardkonforme Formrequest macht, glaube ich nicht. Ich muss jetzt mal, ich mache jetzt mal wieder Chat, ja. Du schreibst hier Nutzerartstilung Spider-Man mit Gnome. Jetzt müsste ich dich fragen, warum nicht Manjaro? Warum nicht Endeavor OS? Das ist immer so die Standardfrage vom Chat. Ich sage irgendwas, so nach dem Motto, ja wir gucken uns das jetzt mal an, da kommt der Chat um die Ecke. Ja, warum nicht mit was anderem? Warum nicht so? Warum machst du es so? Warum nicht anders? Ich muss das auch mal machen öfters. Warum nicht Windows? Die Antwort ist ganz einfach, Windows ist immer Painschamp, egal was du machst. Gibt es irgendwas, was unter Windows nicht Painschamp ist? Ich meine, du kannst unter Windows spielen, ja. Das ist aber auch Painschamp. Das einzige, warum das die Leute machen ist, weil es die einzige Plattform ist, wo du wirklich sicher sein kannst, dass alle Games laufen. Also Konsole außen vor, aber da geht es ja nicht rum. Windows halt. Windows ist immer Painschamp. Selbst Windows unter Windows ist schwierig. Windows, es ist alles schwierig unter Windows. Wo bin ich denn stehen geblieben, Freund? Ich habe bestimmt noch irgendwas übersehen, warte mal. Easy Ausbildung. Ich habe nichts übersehen, oder? Nix. Na ja gut, mal einmal refreshen, vielleicht hat YouTube noch ein schönes Video, was wir uns jetzt heute zum Einschlafen angucken können. Introducing Avandos Pro. Nein, ich weiß nicht, was es ist. Ich will es wahrscheinlich auch nicht wissen. Keine Ahnung, will man nicht, will man nicht haben. Kennst du den Java Editor? Also wenn ich einen Java Editor suche, finde ich wahrscheinlich 1000 Sachen, oder? Ach Moment, das heißt wirklich so. Ach du Scheiße, das ist noch aktuell. Hallo? Guck mal, die Seite ist sogar down, Leute, die Seite geht nicht mal auf. Ach du Scheiße. Ach du Kruse. Das ist ja Monka Shake, Alter. Das wollte ich gar nicht drücken. Das sieht aus wie Software, die man in der Berufsschule verwendet, ja. Man verwendet das in der Berufsschule, weil die Berufsschule vor 30 Jahren mal Lizenzen dafür gekauft hat. Na gut, nicht so feifett. Ach ja, was macht New World? Abkacken, was macht Battlefield? Noch mehr abkacken, Alter. Easy, bald Race to Null Players ist eröffnet. So schlecht. Ja, das kenne ich auch noch, das Ding. Es hat mich immer noch irritiert, das ernsthaft, was Bloodshed heißt. Kann die denn Modern C++, um die Sache noch schlimmer zu machen? Modern C++, die Sprache, die zum größten Teil aus Klammern in dieser Richtung hier besteht. Wahrscheinlich ist das, Leute, meint ihr, das ist Welle C++ Syntax? Ich gehe davon aus. Ich denke, das geht. Und im Zweifelsfall, wenn es nicht geht, ist die Fehlermeldung 40 Zeilen lang und man versteht nicht, was die Fehlermeldung einem sagen soll. Testen wir doch mal. Es gibt doch so einen Online C++ Compiler. Ist das da? Nee, das meine ich nicht. Ist das gültiges C++ Run? Moment. Ist das wirklich halbwegs hilfreiche Compiler-Fehlermeldung? Sehe ich das gerade richtig? Ich meine, dass er das 580 mal schreibt, ist vielleicht nicht so sinnvoll, aber das kann nicht sein. Das ist Fake C++. Ist die Scharpe in Whistle Studio oder in Whistle Studio oder Codebesser zu programmieren? Eindeutig. Eindeutig in Whistle Studio. Oder aber gar nichts davon und Ryder. Ryder ist mein persönlicher Favorit, aber Ryder ist halt offiziell nicht kostenlos, es sei denn, du bist Student oder Schüler und du hast die Trial ausgenutzt. 30 Tage kannst du es kostenlos verwenden. Na sehr teuer ist es nicht. Ich finde Ryder ist tatsächlich relativ angemessen. Also ich habe das JetBrains All Products Pack. Ich will alles. Ja. Und das kostet für Privatpersonen nicht so viel wie da steht. Für persönliche Nutzung. Guck mal. All Products Pack 250 Euro im Jahr und ab dem dritten Jahr, das müsste ich mittlerweile eigentlich schon haben, kostet es dann quasi irgendwie nur noch 100, 170 oder so. Das kann man schon machen. Ich finde das ist gar nicht so teuer. Also wenn man das regelmäßig benutzt. Ich mein, wenn man Schüler ist, würde ich es nicht unbedingt machen, aber wenn man das unter anderem dafür benutzt, womit man dann sein Geld verdient, ist das eigentlich gar keine Frage. Also vollkommen in Ordnung. Oder ihr lasst es euren Chef für euch kaufen. Ritual Studio ist vollkommen in Ordnung. Ja, kann man auch benutzen. Ich habe auch jahrelang Ritual Studio verwendet, aber seit ich seit.net Core im Endeffekt seit.net Core halbwegs sinnvoll Cross Plattform ist, also seit 2.1 oder so oder 2.0 und auch alle notwendigen Klassen hatte, ich glaube, es war so seit 2.0 2.1, bin ich ja komplett auf Linux als Entwicklungsplattform umgestiegen und seitdem verwende ich nur noch Rider und ich komme damit echt gut klar. Also ich kann das eigentlich nur empfehlen. Natürlich, wenn man das hobbymäßig verwendet und Schüler ist und kein Geld hat, dann nicht, dann Ritual Studio. Aber Ritual Studio Code würde ich nicht verwenden für C Sharp, weil das ist in Ritual Studio deutlich angenehmer. Ja, doch Pog. Mache ich nicht. Deswegen habe ich mir mal Infinity Designer und Infinity Photo gekauft, weil ich keinen Bock auf Adobe Gremble habe und ich Adobe Gremble erstens nicht gescheit benennen kann und das zweitens viel zu teuer ist. Ja, also Visual Studio Code für C Sharp ist nicht schön. Das habe ich auch schon mal Just For Fun ausprobiert, aber das macht keinen Spaß. Webstorm habe ich nie, bin ich nie so richtig warm geworden mit. Ich verwende tatsächlich für Frontend ausschließlich Visual Studio Code. Da gehen ja auch die Meinungen auseinander. Ob Webstorm jetzt oder Visual Studio Code. Gibt Leute, die schwören komplett auf Visual Studio Code und Leute, die schwören komplett auf Webstorm. Werden wir hier nicht weiter behandeln. Profis programmieren in Vim. Ja, Leute, die in Vim programmieren, die müssen vor allem, die erzählen, dass sie in Vim programmieren. Das ist so ein bisschen wie Arch Linux User, die müssen das auch erzählen. Das sind die gleichen Leute, die ja sagen, es ist alles so ineffizient. Meine Finger müssen auf der Home Row Stain. Also wenn ich weiß, was die Home Row ist, Keyboard Layout, die Home Row ist das Ding hier. In der Mitte. Das da. Das ist die Home Row. So. Und wenn deine Finger nicht auf der Home Row Stain, dann ist es schlecht. Sagen die Vim Power User. Das Problem ist nur in der heutigen Zeit, dass ich das für totalen Schwachsinn halte, weil was bringt dir auf der Home Row zu Stain, wenn du die Maus brauchst, um den Browser ordentlich zu bedienen und im Internet was nachzugucken. Und es ist einfach so, dass du auch wenn du dich gut auskennst, 40 Prozent der Zeit trotzdem im Internet nachguckst und Dinger, Dinger schaust und ausprobierst und nachgucken muss. Und sei es nur, dass du Tickets bearbeiten musst, nebenbei mal kurz. Also das bringt dir überhaupt nichts, nur auf der Home Row zu Stain. Ja, ich kenne das. Ich habe das selbst benutzt. Leute, ich habe das früher selbst so gemacht. Ich hatte früher eine Vim-Config von 8000 Zeilen oder so mit 15 Extensions und mein Vim hat immer nicht richtig funktioniert, nachdem ich die mal geupdatet habe. Ich habe das früher genauso gemacht. Total abfuck. Heute habe ich die Vim-Config, die hat die notwendigsten Sachen und fertig und ich verwende das nur, wenn ich schnell auf der Kommandozeile was editieren muss und weil es auf jedem Server voll installiert ist. Genau, ich mache alles nur noch über Sprachassistenten, dass ich auf der Home Row Stain kann. Also ich finde, das ist heutzutage nicht zeitgemäß. Du verbringst bestimmt, ich sage jetzt mal 50 Prozent, aber das schwankt ja bei manchen 30, bei manchen vielleicht 60, 70 Prozent des Tages im Browser und du kannst einen Browser nicht gescheit bedienen über Tastatur-Shortcuts. Ich kenne diese Plugins, ich habe die früher selbst verwendet, dass du den Browser mit Vim-Shortcuts bedienen kannst. Das geht. Dann drückst du zum Beispiel F und der highlightet dir alle Links und dann drückst du zum Beispiel ein BV oder so für den Link und das geht. Es fühlt sich aber nicht nach natürlicher Browsernutzung an. Ganz ehrlich, Maus ist im Browser das beste und da bringt es dir auch nichts, dass du im Vim geil auf der Home Row stayst und dann alle zwei Sekunden trotzdem zur Maus rübergreifen musst. Ja, jeder was er will, du kannst deinen Browser auch mit einem Gaspedal bedienen, wenn du denkst, dass du dann besser auf der Home Row stayen kannst. Kein Problem, mach. V-Controller, das ist auch nice. Also ich programmiere mit einem Lenkrad oft öfters mal. Also ich habe CS mit dem Lenkrad gespielt früher und nachdem das hier noch rumliegt, programmiere ich da auch ganz gerne mal mit. Maus auf dem Boden und am Schreibtisch. Jetzt weiß ich, man macht die Maus auf dem Boden, stayt schön auf der Home Row mit seinen Fingern und man macht dann quasi so einen Klettverschluss an die Maus dran und klettet sich die Maus quasi an den Fuß und dann kann man auf der Home Row stayen und kann mit dem Fuß die Maus bewegen. Leute, das ist so eine bescheuerte Idee. Ich könnte wetten, dass es Leute gibt, die machen das. Nicht viele, nicht viele, aber es gibt bestimmt Leute, die machen das bzw. haben es zumindest probiert. Man spricht ja erstmal nichts dagegen. Die Füße brauchst du zum Programmieren, nicht? Und wenn du ein krasser, krasser auf der Home Row stayer bist, dann kannst du schon mal die Maus auch mit der Tastatur, mit dem Fuß bedienen. Das Patent, das kannst du machreich ein. Tanzmatte. Was ist das? Stream das lieber. TriHack streamt das auch manchmal, der Dance da auf so einem komischen, was ist das, ein komischen Dance Game mit Tanzmatte. Was ein Azubi hat mir erzählt, dass eine Firma BWL Stonks als Einstellungstest Excel Aufgaben stellt, Bedingung nur Tastatur und keine Maus. Ich weiß jetzt gar nicht, was ich daran absurder finden soll, dass man glaubt, dass das Aussagekraft hat für einen IT-Job oder dass es irgendwie erstrebenswert ist Excel nur mit Tastatur zu bedienen. Keine Ahnung, die Interviews und Einstellungstests nehmen groteske Formen an mittlerweile. Ne, ich schnall mir meine Maus garantiert nicht an Fuß. Dafür bin ich kein groß genuger auf der Home Row stayer. Ja, das ist wohl wahr. Am besten ist es gar nicht zu benutzen. Trackpad für die Füße ist auch nicht schlecht. Da kannst du immer so mit dem großen Fuß zäh, kannst du dann quasi über das Trackpad scratchen oder noch besser auf dem Boden diesen komischen Joystick, den die Thinkpads immer haben. Bist dir mal in den Trackpoint, den roten. Sowas kannst du bestimmt mit dem großen Fuß zäh unterm Tisch gut bedienen für die Maus und dann kannst du immer auf der Home Row stayen für maximale Wim-Shortcuts. Wie man Farben für eine Webseite auswählt. Ja, ich auch. Easy Step. Ganz ehrlich, den besten Tipp, wisst ihr was den besten Tipp ist, den ich je in einem Video gehört hab, wo es um Design ging, also den ich persönlich sehr sehr gut und praktisch fand. Anfangen mit schwarz und weiß. Wenn die Seite schon in schwarz und weiß ultra beschissen aussieht, dann soll man sich was anderes überlegen. Und erst wenn die Seite in schwarz und weiß ganz, ganz brauchbar aussieht, dann noch die ein oder anderen Farben dabei machen. Es muss nicht wirklich schwarz und weiß sein, es kann auch grau und weiß sein. Aber erstmal die Webseite zweifarbig machen. Und wenn die Webseite da schon mega beschissen aussieht, so dass man sie nicht benutzen möchte, dann ist was grundlegend verkehrt. Und dann kann man sich ein paar Abstufungen überlegen, noch so zwei, drei Farben dabei machen. Das fand ich war ein guter Ratschlag. Die Fußmause, wenn sowas gibt es wirklich. Das ist ja fast so toll wie der Fanatic Headshot Controller. Ok 2008. Das kann doch nicht wirklich irgendjemand verwendet haben, oder? Keine Ahnung, was sich alles gibt. Ja, dafür ist tatsächlich, ich sag ja auch, ich hab das schon total auf dem Stream gesagt, dass Excel, das meiner Meinung nach einzige Produkt ist, in der gesamten Office Suite, was irgendwie eine Daseinsberechtigung hat. Ja auch, auch sagen wir mal auch für mich vielleicht. Ich benutze zwar Excel nahezu nie, aber ich könnte mir vorstellen, das vielleicht zu verwenden. Aber alles andere ist Müll. Outlook ist nicht Bestandteil von der Office Suite. Im Office Suite ist Word, Excel, PowerPoint, früher war es noch Access. Und was hab ich noch? Was hab ich noch vergessen? Publisher gab es früher, das war aber auch nur Bonus. Ja, also Word, Excel, PowerPoint, Outlook ist standardmäßig nicht dabei. Access, Publisher, ich glaub Standardmäßig auch nicht mehr. Ok, das war's. Also Word, Excel, PowerPoint, Access. Also Access ist Paints Chairman. So und Word ist so ziemlich das Unsinnigste überhaupt. Also wer Word verwendet hat glaube ich echt die Kontrolle über sein Leben verloren, weil da wirklich abhängig von ist. Und nichts anderes als Alternative kennt, das ist schon sehr sehr Paints Champion. Weil ich bin der Meinung, wenn man einfach nur Text schreiben will, dann brauchst du keine Textverarbeitung, weil dann geht es ja um den Text. Und wenn man Text, wenn man was optisch schön machen will, ja die Hardcore Leute machen das mit Latex, Latech, wie man das genau ausspricht. Man kann das aber auch in jedem x-beliebigen Designerprogramm machen, wenn es einfach nur hübsch aussehen soll. Ich mein niemand schreibt ein Buch in Word, schickt es dem Verlag und der Verlag, der haut es dann in die Presse so nach dem Motto. Vom Word Dokument zum Druck, das passiert ja nicht. Also deswegen, Word ist da halt total unsinnig. Powerpoint, verwende ich tatsächlich am meisten davon, aber nur weil ich manchmal muss, weil es bei uns auf der Arbeit immer noch Leute gibt, die der Meinung sind, man muss die Corporate Identity Vorlagen verwenden, nur dann geht es als Präsentation durch. Das Chebat Video, natürlich ist das Chebat, auch Comic Sans, was sonst, hab ich schon im ersten April hochgeladen. Man kann einfach Fußnoten machen. Ja ok, ich lass mir's gefallen, ich will ja keinem ausreden, dass er Word verwendet. Wenn jemand mit Word zufrieden ist und das quasi Funktionen hat, die er braucht, das war meinetwegen, verwendet Word, ich will euch ja nicht bekehren, macht was ihr wollt. Undok ist auch Pog, ja. Twitch Mason, danke für den Sub. Leute, ich hab gefühlt wieder einige Subs übersehen, ich guck mal kurz rein bevor ich gleich ins Bett gehen muss. Wolle hat gecheert mit Bits, Dankeschön für die 250 Milliarden Bits. Joho hat abonniert, der Weezy hat abonniert, das hab ich alle schon gesehen glaub ich, Doomsweb hat abonniert, Kengin, ja das hab ich schon gesehen, danke Leute nochmal für die Subs, falls ich irgendwann übersehen hab, aber ich glaube nicht. Der Name sagt mir was, ist es der mit dem Goldfisch, ist es der mit dem Goldfisch der angeblich Stonks kauft, ja haben wir geguckt, das war auch reichlich sinnlos, ich mein im Prinzip war das Randomize und der Goldfisch hatte damit, ja weiß nicht, nicht viel zu tun eigentlich, das hätte ohne den Goldfisch fast genauso gut funktioniert. Trustfire, Dankeschön für den Sub. Kommt auf die Firma an, kommt drauf an was du machst, kommt drauf an in welcher Region du bist, kann man schlecht sagen, guck dir mal irgendwelche Vergleiche an, gibt es ja genug Umfrage, ab und zu macht Heise ja auch so einen Gehaltsvergleich, aber ansonsten schwierig zu sagen, ja, das stimmt wohl, ja, gleich Bett gehen, ja ich geh jetzt mal. Ok Leute, ne wir gucken jetzt kein Axel Video, ist es der der Raytracing in Axel gemacht hat? Ne. Es gab ja einen Raytracer für Axel irgendwie, kann ich mich erinnern. Ich mach jetzt gar nichts, ich mach jetzt Heck Bett gehen, ich geh jetzt pennen, weil ich bin übelst kaputt und morgen zum Glück wieder Homeoffice und das heißt ich bin danach auch fitter, danach muss ich meine 1-2 Stunden Sport machen, gut Sport ihr wisst was ich mach, ich laufe ein bisschen draußen rum, ich laufe etwas schneller 2 Stunden draußen rum, 1,5-2 Stunden, nicht jeder würde Sport nennen, aber es hat was gebracht, ihr habt als letztes auf der Waage gesehen, Meilenstein ist erreicht. Ja, jeden Tag 1-2 Stunden, das sind nicht immer 2 Stunden, das ist meistens 1,5-2 Stunden, wo ich etwas schneller spazieren gehe, nicht super krass schnell, also jetzt nicht hier irgendwie norwegisches Militärmarsch, den Berg rauf, 7 Stunden Kilometer mit 35 Kilo Gepäck. Ach früher, ich hab hast du früher, also ich glaube Wanderurlaub haben wir früher nie gemacht, kann ich mich nicht daran erinnern, dass wir früher Wanderurlaub gemacht haben. An Strand sind wir öfters ausgefahren, wo waren wir denn überall, die üblichen Sachen, Gran Canaria, Tenerife, in der Türkei waren wir auch, kann ich mich noch dran erinnern, sowas, wobei ich in die Türkei heute wahrscheinlich auch nicht mehr fahren würde, die sind mir zu weird champ geworden dort, nach Ägypten kannst du auch nicht mehr fahren, das sind auch weird champ geworden, aber ganz im Ernst, ganz im Ernst, ja ich zähl Schritte, ich hab ja immer mein iPhone dabei, das macht das ja so, in der Hells App standardmäßig schon, aber da guck ich so gut wie nie rein, aber ich hab theoretisch einen Zähler, ja. Jetzt in Bitcoin investieren, nee, ich hab ziemlich langweilige ETF Stonks, die dank den China-Chinesen ordentlich runtergegangen sind die letzten paar Wochen. Wer ist die Katz? Chico. Chico, aber es ist ein Mädchen, warum auch immer sie Chico heißt, ich weiß es nicht, die hieß schon so, die hab ich aus dem Tierheim gehört, und warum soll ich die Oma nennen? Warum man die Katze Chico genannt hat, ich habe keine Ahnung. Katzcam, keine Ahnung, ich geh jetzt bett hier, Leute wir sehen uns, machts gut, bis morgen, vielleicht CU.", "segments": [{"id": 1, "start": 60.0, "end": 86.1, "text": "Ich bin übrigens kaputt, ich wusste gar nicht ob ich Stream anmachen soll, aber ich"}, {"id": 2, "start": 86.1, "end": 93.82, "text": "habe mir gedacht, was will sie großartig machen, was gibt es besseres als eine Runde"}, {"id": 3, "start": 93.82, "end": 94.82, "text": "Streamen."}, {"id": 4, "start": 94.82, "end": 99.48, "text": "Aber wie gesagt, Sonderliche 5-Header-Time wird es heute nicht werden, weil ich kann"}, {"id": 5, "start": 99.48, "end": 106.64, "text": "mich jetzt nicht wirklich großartig konzentrieren, hier 5, 6, 11-Head-Dinger machen."}, {"id": 6, "start": 106.64, "end": 113.8, "text": "Ich muss zwar wieder nach Frankfurt fahren, unsinnigerweise, außer dass ich da irgendwie"}, {"id": 7, "start": 113.8, "end": 123.4, "text": "wieder mehr oder weniger dreiviertel des Tages gemietet habe, ist eigentlich sehr überflüssig"}, {"id": 8, "start": 123.4, "end": 124.4, "text": "gewesen."}, {"id": 9, "start": 124.4, "end": 133.0, "text": "Am Rande, ich habe ein paar Videos geguckt, aber es juckt mich wenig, das juckt mich"}, {"id": 10, "start": 133.0, "end": 141.04, "text": "genauso viel wie diese, ich weiß gar nicht wie der Typ heißt, Flynn oder so, der Typ"}, {"id": 11, "start": 141.04, "end": 147.36, "text": "mit den Masken, der irgendwie die Masken verkauft hat und dann sich für gefeiert hat, als"}, {"id": 12, "start": 147.36, "end": 151.2, "text": "hätte er sie gespendet und es irgendwelche komischen China-Chinesen-Masken waren."}, {"id": 13, "start": 151.2, "end": 155.92, "text": "Keine Ahnung, ich kriege das alles so am Rande mit, aber es geht mir alles vorbei,"}, {"id": 14, "start": 155.92, "end": 156.92, "text": "wenn ich ehrlich bin."}, {"id": 15, "start": 156.92, "end": 165.44, "text": "Juckt mich alles nicht, was ich heißt, dass ich irgendwas gut finde, das juckt mich einfach"}, {"id": 16, "start": 165.44, "end": 166.44, "text": "nicht."}, {"id": 17, "start": 166.44, "end": 167.68, "text": "Oder schlecht, das juckt mich einfach nicht."}, {"id": 18, "start": 167.68, "end": 173.0, "text": "Wie gesagt, ich weiß auch nicht mal wie der Kerl heißt, irgendwie gefühlt wahrscheinlich"}, {"id": 19, "start": 173.0, "end": 177.64, "text": "90% in Deutschland wissen das nicht, ich hab keine Ahnung."}, {"id": 20, "start": 177.64, "end": 184.0, "text": "Flynn oder so, wie heißt denn der Dude, sagt mal, ihr wisst das doch, Chet, Kiemann Flynn"}, {"id": 21, "start": 184.0, "end": 190.12, "text": "oder irgendwie so, Klee, Klee, nee, Cleansman war jemand anderes, ach keine Ahnung, wie"}, {"id": 22, "start": 190.12, "end": 193.48, "text": "gesagt, das interessiert mich auch überhaupt nicht, Leute, ich weiß nicht mal wie der"}, {"id": 23, "start": 193.48, "end": 194.48, "text": "Typ heißt."}, {"id": 24, "start": 194.48, "end": 199.68, "text": "Ich muss mal kurz in meine Mails gucken, ach Finn, ach ja, ja, irgendwas mit Finn wusste"}, {"id": 25, "start": 199.68, "end": 200.68, "text": "ich doch."}, {"id": 26, "start": 200.68, "end": 204.72, "text": "Kann man das auch nur merken, weil der Meshed Finn heißt, der Einzige den ich kenne, der"}, {"id": 27, "start": 204.72, "end": 205.72, "text": "Finn heißt..."}, {"id": 28, "start": 205.72, "end": 215.6, "text": "Moment, ich hab mein E-Mail-Passwort falsch eingegeben, warum mache ich denn sowas?"}, {"id": 29, "start": 215.6, "end": 234.0, "text": "So, kurz E-Mails check, Swann, Pay Reminder, warum das, oh, darfst du keinem erzählen,"}, {"id": 30, "start": 234.0, "end": 238.44, "text": "ich hab meine Hetzner-Rechnung nicht bezahlt diesen Monat bis jetzt, die hab ich grad"}, {"id": 31, "start": 238.44, "end": 247.44, "text": "ein Reminder geschickt, für 5,83 Euro, Alter, was hab ich denn da überhaupt, was 5,83 Euro"}, {"id": 32, "start": 247.44, "end": 248.44, "text": "kostet noch?"}, {"id": 33, "start": 248.44, "end": 257.48, "text": "Irgendeine Single-VM, oder, 5,83 Euro, Mann, das sieht sehr nach Single-VM aus, oder?"}, {"id": 34, "start": 257.48, "end": 274.52, "text": "Das steht doch auf der Rechnung bestimmt drauf, ne."}, {"id": 35, "start": 274.52, "end": 278.56, "text": "Du hast Twitch, bestimmt, bestimmt, hast du Twitch gehackt, daran wird es liegen, dass"}, {"id": 36, "start": 278.56, "end": 281.56, "text": "man die Nachrichten nicht sieht."}, {"id": 37, "start": 281.56, "end": 287.76, "text": "Geh ich auch von aus, es kann, es kann keinen anderen Grund geben, als, als hast du, dass"}, {"id": 38, "start": 287.76, "end": 296.08, "text": "du Twitch gehackt hast, ja, so ist es, Horst-Champ, wie siehts heute aus, Weeps in oder Weeps"}, {"id": 39, "start": 296.08, "end": 297.08, "text": "out?"}, {"id": 40, "start": 297.08, "end": 305.68, "text": "Ich bin ja immer für Weeps in, wow, Alter, viel zu laut, Mann, MonkaS, Sekunde, Sekunde,"}, {"id": 41, "start": 305.68, "end": 317.08, "text": "Freund, geht es hier drüber, muss mal kurz den Aja-Ja-Sound runterschrauben, so, das"}, {"id": 42, "start": 317.08, "end": 323.24, "text": "ist jetzt doch noch laut genug, ja, ok, ok, das kann man so ertragen, mal testen, was"}, {"id": 43, "start": 323.24, "end": 324.8, "text": "sagt der, was sagt der Wendler dazu?"}, {"id": 44, "start": 324.8, "end": 333.16, "text": "Ok, Sound passt, alles klar, macht der eigentlich, ist das immer noch in seiner Telegram-Gruppe?"}, {"id": 45, "start": 333.16, "end": 344.32, "text": "Was für ein Ding, seit ich wieder festbar eine Mix aus Uberspace, ist das irgendein"}, {"id": 46, "start": 344.32, "end": 350.6, "text": "Co-Location-Host, sagt mir gar nichts, und selbst Hosted bin, habe ich meinen Hetzer-Server"}, {"id": 47, "start": 350.6, "end": 354.44, "text": "wieder weg, aber eigentlich ganz zufrieden mit den, ja, die sind nicht schlecht, ich"}, {"id": 48, "start": 354.44, "end": 360.32, "text": "hab dieses Jahr, haben wir noch nichts ausgehandelt, das heißt, mein Hetzer-Startgutscheincode"}, {"id": 49, "start": 360.32, "end": 365.84, "text": "funktioniert auch nicht mehr, obwohl man den gerade jetzt, wo die Leute eh schon wieder"}, {"id": 50, "start": 365.84, "end": 367.28, "text": "wenig Kohle haben, brauchen könnte."}, {"id": 51, "start": 367.28, "end": 391.08, "text": "Ja, Leute, also, grüne Pizza, Dankeschön für den Sub, Massive zwei Monate."}, {"id": 52, "start": 391.08, "end": 410.44, "text": "Zeig mal, zeig mal her, was für ein Ding, Uberspace, Hosting of Asteroids, ok, ich bin"}, {"id": 53, "start": 410.44, "end": 416.08, "text": "froh, dass die nicht schreiben, Hosting on Steroids, das ist so, das ist so eine Redewendung,"}, {"id": 54, "start": 416.08, "end": 421.96, "text": "die kann ich überhaupt nicht leiden, das war, das war mal eine Zeitlein sehr angesagt, so"}, {"id": 55, "start": 421.96, "end": 427.8, "text": "zu der Zeit, wo auch Hubi-Entwickler sich als Rockstar-Developer bezeichnet haben, da"}, {"id": 56, "start": 427.8, "end": 434.56, "text": "war alles blablabla on Steroids und, ok, und was können die so geiles, dass die, dass,"}, {"id": 57, "start": 434.56, "end": 450.32, "text": "dass man Universal-Hosting für Shell-Lovers, aha, kurz ein bisschen leiser machen, Leute,"}, {"id": 58, "start": 450.32, "end": 456.24, "text": "ich muss mir zu laut gerade, mach das mal wieder hoch, ich hab ja auch viel zu laut,"}, {"id": 59, "start": 456.24, "end": 463.08, "text": "fällt mir gerade auf, normalerweise hab ich immer auf 30, Leute, ich muss die Resident-Sleeper,"}, {"id": 60, "start": 463.08, "end": 471.04, "text": "ich muss die kurz ein bisschen durch was, etwas, etwas weniger, äh, Resident-Sleeper-Riches"}, {"id": 61, "start": 471.04, "end": 484.44, "text": "ersetzen, weil ansonsten ist gleich wirklich Badge angesagt, das fände ich tatsächlich"}, {"id": 62, "start": 484.44, "end": 490.16, "text": "geil, wenn einer ein Rechenzentrum auf dem Mond eröffnet, wisst ihr warum ich das geil"}, {"id": 63, "start": 490.16, "end": 493.8, "text": "finde, weniger wegen dem Rechenzentrum auf dem Mond, ich seh nämlich ehrlich gesagt"}, {"id": 64, "start": 493.8, "end": 497.44, "text": "nicht so wirklich, wo der Sinn von einem Rechenzentrum auf dem Mond ist, also was es für Vorteile"}, {"id": 65, "start": 497.44, "end": 507.08, "text": "haben soll, außer, äh, Strahlung, ähm, beschissene Latenz, ähm, wo kriegt's den Strom, also"}, {"id": 66, "start": 507.08, "end": 512.28, "text": "eigentlich nur Probleme, aber warum ich's geil finden würde ist, weil dann müsste jemand"}, {"id": 67, "start": 512.28, "end": 515.8, "text": "mal wieder auf den Mond fliegen, dort landen und da was Sinnvolles machen, da wart ich"}, {"id": 68, "start": 515.8, "end": 519.96, "text": "ja drauf, die Amis haben das ja vor ein paar Jahren angekündigt, dass sie wieder auf den"}, {"id": 69, "start": 519.96, "end": 532.12, "text": "Mond fliegen wollen, aber mittlerweile, hat sich da nicht viel getan, ah ja, ich wollt"}, {"id": 70, "start": 532.12, "end": 537.92, "text": "ja gucken, was die so Geiles haben, also, was, Pricing, zeig her, äh, Rakete, das ist ein"}, {"id": 71, "start": 537.92, "end": 550.2, "text": "gutes Pricing, Budget, 5 Euro, ja, und was bekommt man da, ich, ich sag, ich versteh's"}, {"id": 72, "start": 550.2, "end": 556.4, "text": "nicht, also ich mein, mal angenommen, ich bezahl da jetzt 15 Euro, was bekomm ich dafür,"}, {"id": 73, "start": 556.4, "end": 569.88, "text": "so genau, ich, ich, so, ich versteh's nicht so, so richtig, man bekommt da einen Container"}, {"id": 74, "start": 569.88, "end": 575.68, "text": "oder was, einen Container und auf dem kann man machen, was man will, ja, aber, was hält"}, {"id": 75, "start": 575.68, "end": 582.0, "text": "mich da von ab, in, habe, ja gut, ich hab wahrscheinlich irgendwelche Limits oder so,"}, {"id": 76, "start": 582.0, "end": 587.72, "text": "wahrscheinlich ist es keine VM, ok, das muss ich mal angucken, Chat, ich hab's nicht so"}, {"id": 77, "start": 587.72, "end": 595.56, "text": "genau kapiert, ehrlich gesagt, der ideale Ort, Rechenzentrum, der Mond ist doch alles"}, {"id": 78, "start": 595.56, "end": 603.2, "text": "andere als der ideale Ort für ein Rechenzentrum, also manche, ich mein, muss man denn sagen,"}, {"id": 79, "start": 603.2, "end": 608.16, "text": "also manche Unternehmen haben sehr gutes Marketingmaterial und können viel Zeug erzählen, aber mir kann"}, {"id": 80, "start": 608.16, "end": 613.68, "text": "niemand erzählen, dass der optimale Standort für ein Rechenzentrum auf dem Mond ist, und"}, {"id": 81, "start": 613.68, "end": 626.76, "text": "ok, warum, warum ist das so, Sub ignoriert, Doom Swap, danke für den Sub, Kengin, Pogger,"}, {"id": 82, "start": 626.76, "end": 635.56, "text": "Sub, ich seh's jetzt zwar nicht, aber Dankeschön, nice, ach hier 17 Monate, Massive, Pfeifheader,"}, {"id": 83, "start": 635.56, "end": 648.56, "text": "Sub, ok, jetzt lassen wir uns doch mal kurz erklären, du hast für drei Monate gesubbt,"}, {"id": 84, "start": 648.56, "end": 662.72, "text": "das ist ja, dazu kann ich nur sagen, oder alternativ, oder alternativ, wenn man auf"}, {"id": 85, "start": 662.72, "end": 675.4, "text": "die Ollen Call of Duty Sachen steht, Weirdchamp, danke für den Sub, ok, also, was haben wir"}, {"id": 86, "start": 675.4, "end": 684.48, "text": "denn hier, um Daten und Rechenkapazität, wie macht man das eigentlich gescheit, mit Kühlung"}, {"id": 87, "start": 684.48, "end": 690.68, "text": "auf dem Mond, egal, um Daten und Rechenkapazität auch in notwendigen, ok, krisensicher auf"}, {"id": 88, "start": 690.68, "end": 695.4, "text": "dem Mond, also ganz ehrlich, wenn hier die Welt untergeht, auf der Erde, ich weiß nicht,"}, {"id": 89, "start": 695.4, "end": 699.76, "text": "ob uns das Rechenzentrum auf dem Mond rettet, aber das ist tatsächlich ein Punkt, den lasse"}, {"id": 90, "start": 699.76, "end": 704.88, "text": "ich mir noch irgendwie gefallen, ja, weil mein Content so gut ist, das ist schön, dass"}, {"id": 91, "start": 704.88, "end": 715.28, "text": "dir mein Content gefällt, ok, das unternehmen hat sich dafür auch am, im kommenden Jahr,"}, {"id": 92, "start": 715.28, "end": 719.68, "text": "ja Moment, in diesem Jahr, das sagen die ganzen Startups, und dann passiert fünf Jahre nichts"}, {"id": 93, "start": 719.68, "end": 732.52, "text": "und sie gehen out of Service, ein bisschen teurer, ok, ja, was jetzt der Vorteil davon"}, {"id": 94, "start": 732.52, "end": 751.44, "text": "ist, hat man immer noch, nicht so genau verstanden, also es gibt ein großes Problem, wenn die"}, {"id": 95, "start": 751.44, "end": 758.36, "text": "Erde unbewohnbar wird, dann sind wahrscheinlich die Leute dort dann irgendwann tot, und tote"}, {"id": 96, "start": 758.36, "end": 762.12, "text": "Leute interessieren sich wenig für Daten im Rechenzentrum auf dem Mond, aber ok, ich"}, {"id": 97, "start": 762.12, "end": 766.36, "text": "bin, hey, vielleicht gibt es ja da irgendeinen Markt für, keine Ahnung, aktuell sieht das"}, {"id": 98, "start": 766.36, "end": 773.8, "text": "für mich einfach nur nach irgendwie, Schnapsidee, Startups Schnapsidee aus, aber ok, wenn sie"}, {"id": 99, "start": 773.8, "end": 779.28, "text": "meinen, breche ich jetzt auf dem Mond, ach so soll das aussehen, ja gut, das können die"}, {"id": 100, "start": 779.28, "end": 785.16, "text": "ganzen Ami Startups auch immer gut, irgendwelche Renderbilder machen, mit wie das mal in Zukunft"}, {"id": 101, "start": 785.16, "end": 793.16, "text": "aussehen wird, wie sie, Dankeschön für den Zap, aber, also mir erschließt sich die Logik"}, {"id": 102, "start": 793.16, "end": 799.68, "text": "nicht, was man mit dem Rechenzentrum auf dem Mond macht, also was der Sinn davon ist, weil"}, {"id": 103, "start": 799.68, "end": 811.04, "text": "das ist quasi der unsinnigste Platz für den Rechenzentrum, der mir so einfällt, ansonsten"}, {"id": 104, "start": 811.04, "end": 817.04, "text": "keine Ahnung, ja ich lasse das Argument irgendwie zum Teil ziehen, dass sie sagen, ja da sind"}, {"id": 105, "start": 817.04, "end": 821.48, "text": "die Daten sicher vor irgendwelchen Katastrophen auf der Erde, wobei man halt sagen muss, wenn"}, {"id": 106, "start": 821.48, "end": 832.32, "text": "man so große globale Katastrophen auf der Erde hat, dass jetzt auch ein, mehrfach redundantausgelegter"}, {"id": 107, "start": 832.32, "end": 837.88, "text": "Daten auf der Erde weg sind, ja, also sprich, wenn man seine Daten spiegelt, sagen wir mal,"}, {"id": 108, "start": 837.88, "end": 843.04, "text": "einmal in Europa, einmal in Nordamerika und einmal in Asien oder so zum Beispiel, und"}, {"id": 109, "start": 843.04, "end": 849.76, "text": "alle drei Standorte sind wirklich kaputt, dann muss ja irgendwas hier von wirklich großem"}, {"id": 110, "start": 849.76, "end": 854.28, "text": "Ausmaß passiert sein, also da langt es weder, dass die Russen in der Ukraine sind, noch"}, {"id": 111, "start": 854.28, "end": 860.84, "text": "dass Kim Jong-Dings irgendwie komische Dinge macht oder was weiß ich, dass irgendwelche"}, {"id": 112, "start": 860.84, "end": 868.28, "text": "Alawakbar-Leute am Start sind, da muss ja wirklich was globales passieren, weltweit, wenn du"}, {"id": 113, "start": 868.28, "end": 876.24, "text": "einen geo-redundanten Datentopf kaputt kriegst, also was ist der Vorteil von einem Rechenzentrum"}, {"id": 114, "start": 876.24, "end": 885.44, "text": "auf dem Mond, ich weiß es nicht, keine Ahnung, was auch immer, ich muss aber nicht jede Startup-Idee"}, {"id": 115, "start": 885.44, "end": 890.84, "text": "verstehen, weil wenn es danach geht, ich würde wahrscheinlich nie ein Startup gründen und"}, {"id": 116, "start": 890.84, "end": 894.88, "text": "ich würde wahrscheinlich auch die, die funktionieren, nie gründen, das heißt, ich bin da schlechter"}, {"id": 117, "start": 894.88, "end": 900.08, "text": "Ratgeber wahrscheinlich, weil ich alles schlecht finde, von Startup-Ideen gehe ich mal von aus,"}, {"id": 118, "start": 900.08, "end": 903.48, "text": "das meiste will ich schlecht finden, aber in dem Fall verstehe ich es wirklich nicht,"}, {"id": 119, "start": 903.48, "end": 910.0, "text": "wo das Sinn ist, was ist es, es ist das Gegenteil von On-Prem, das ist ja dann auch nicht in"}, {"id": 120, "start": 910.0, "end": 915.56, "text": "der Cloud, da braucht man dann noch ein drittes Wort für oder, also ich meine, wir haben Cloud, wir"}, {"id": 121, "start": 915.56, "end": 920.8, "text": "haben Lokal, also coole Leute nennen das On-Prem, aber ich nenne es mal Lokal, so wie normale Leute"}, {"id": 122, "start": 920.8, "end": 931.28, "text": "das nennen, was ist denn das, Overcloud, Intergalactic, nee, Space, aber Space ist tatsächlich ein"}, {"id": 123, "start": 931.28, "end": 940.92, "text": "bisschen zu, zu normales Wort für super agiles Startup-Dinger, Orbit, Orbit finde ich gut,"}, {"id": 124, "start": 940.92, "end": 949.76, "text": "Hyperspace, so Galactic, Galactic Cloud oder so, Superlativ brauchst du da schon ein bisschen,"}, {"id": 125, "start": 949.76, "end": 962.44, "text": "Marco, was sagt denn das heise Forum dazu? Ideal für, wie macht man das, blöde Frage,"}, {"id": 126, "start": 962.44, "end": 966.2, "text": "habt ihr eine Vorstellung, habt ihr, oder habt ihr eine klorische Idee, wie man das dort gescheit"}, {"id": 127, "start": 966.2, "end": 976.72, "text": "mit der Kühlung macht, weil ich mein, ja, wenn nicht gerade die Sonne drauf scheint, ist es kalt,"}, {"id": 128, "start": 976.72, "end": 984.48, "text": "aber du musst ja Server, also du musst ja die Kälte irgendwie an die Server bekommen und das"}, {"id": 129, "start": 984.48, "end": 991.84, "text": "Problem ist am Vakuum, dass selbst wenn du sagen wir mal einen großen passiven Kühlklotz nimmst"}, {"id": 130, "start": 991.84, "end": 999.36, "text": "und den raushängst, du hast ja wenig, wenig, du hast ja kein Material, du hast ja keine Luft drum"}, {"id": 131, "start": 999.36, "end": 1005.36, "text": "oder kein Wasser drum oder sonst was, was quasi die Wärme da leiten würde, also ich bin mir"}, {"id": 132, "start": 1005.36, "end": 1011.32, "text": "nicht so sicher, ob man das Zeug gescheit kühlen kann, ja Strahlung, da gibt es so viele Probleme,"}, {"id": 133, "start": 1011.32, "end": 1014.84, "text": "die habe ich ja gerade schon ein paar aufgezählt, Strahlung, Strahlung ist wahrscheinlich noch das"}, {"id": 134, "start": 1014.84, "end": 1018.28, "text": "kleinste, die Latenz zur Erde ist eigentlich das, was mir am meisten Sorgen macht, da sieht"}, {"id": 135, "start": 1018.28, "end": 1027.28, "text": "der Satelliten nix dagegen, ich weiß nicht, was ist, was ist Lichtgeschwindigkeit zum Mond,"}, {"id": 136, "start": 1027.28, "end": 1035.24, "text": "wie lange, wie lange braucht man da, sein Licht rein, okay, überlegt euch das mal, im aller, aller,"}, {"id": 137, "start": 1035.24, "end": 1050.52, "text": "allerbesten Fall braucht ein Ping 2,5, 2,5, 2,5 Sekunden, im aller, allerbesten Fall, realistisch"}, {"id": 138, "start": 1050.52, "end": 1055.36, "text": "betrachtet wird es noch eine ganze, eine ganze Weile mehr dauern, weil du musst ja erstmal gucken,"}, {"id": 139, "start": 1055.36, "end": 1059.08, "text": "dass du auch dann im richtigen, du kommst, es reicht ja wahrscheinlich nicht, wenn du irgendwo"}, {"id": 140, "start": 1059.08, "end": 1064.08, "text": "auf der Erde runter kommst, du musst ja wahrscheinlich noch halbwegs, du musst das Signal wahrscheinlich"}, {"id": 141, "start": 1064.08, "end": 1067.72, "text": "noch relayen mit irgendwelchen Satelliten, weil ansonsten musst du es nochmal quer durch die"}, {"id": 142, "start": 1067.72, "end": 1072.72, "text": "ganze Erde schicken, je nachdem, wo das gerade empfangen wird, die Bandbreite wird wahrscheinlich"}, {"id": 143, "start": 1072.72, "end": 1077.92, "text": "nicht so berauschend sein, das ist ja quasi wie Satelliteninternet nur noch, noch, noch viel,"}, {"id": 144, "start": 1077.92, "end": 1085.6, "text": "viel, viel, viel, viel langsamer, 2.560 Millisekunden Ping, ja, das ist doch nix,"}, {"id": 145, "start": 1085.6, "end": 1096.44, "text": "das ist doch Intergalactic Data Center, also ich weiß nicht, die Start-up Idee überzeugt mich jetzt"}, {"id": 146, "start": 1096.44, "end": 1102.64, "text": "persönlich nicht so wirklich, aber wer weiß, vielleicht wird es der neue große Shit, dann"}, {"id": 147, "start": 1102.64, "end": 1109.28, "text": "kann er das Elon Musk irgendwann kaufen, wenn das, der hat irgendwie eh zu viel Geld, was das angeht, und dann kann er"}, {"id": 148, "start": 1109.28, "end": 1113.44, "text": "selbst Server hochschicken, ich meine, hat er nicht schon irgendeinen Tesla in die Umlaufbahn geschossen,"}, {"id": 149, "start": 1113.44, "end": 1117.96, "text": "dann wäre doch jetzt das nächste ein Tesla auf den Mond, beziehungsweise ein paar Server auf,"}, {"id": 150, "start": 1117.96, "end": 1130.08, "text": "auf den Mond wenigstens. Okay, also wie funktioniert das, die machen viel über Querfinanzierung,"}, {"id": 151, "start": 1130.08, "end": 1133.36, "text": "du bekommst einen Nutzer, also geht es übrigens nicht um das Rechenzentrum auf dem Mond, sondern"}, {"id": 152, "start": 1133.36, "end": 1139.2, "text": "um diesen Hosting-Anbieter, du bekommst einen Nutzer in einer 4MD-Limit, sind halt sehr, sehr locker,"}, {"id": 153, "start": 1139.2, "end": 1142.96, "text": "zumindest meiner Meinung nach bekommt man gerade für Spitzen mehr das, als bei anderen für die"}, {"id": 154, "start": 1142.96, "end": 1156.92, "text": "Produktion. Das heißt, ich könnte da auch mal kurz mal, also könnte ich da beispielsweise auch mein"}, {"id": 155, "start": 1156.92, "end": 1162.96, "text": "Open Street View preprocessen, das braucht 48 CPU-Kerner, damit es ungefähr so in 40 Minuten"}, {"id": 156, "start": 1162.96, "end": 1174.92, "text": "fertig ist. Und, und ich glaube 40 oder 50 Gigabyte RAM, oder, oder löschen die mich dann direkt,"}, {"id": 157, "start": 1174.92, "end": 1185.48, "text": "dafür brauche ich da aber auch nur 40 Minuten für dann. Mal kurz ja, kurz sind da wahrscheinlich"}, {"id": 158, "start": 1185.48, "end": 1190.4, "text": "keine 40 Minuten, 48 Kerne und 50 Gigabyte RAM, oder? Das ist wahrscheinlich nicht, nicht, nicht,"}, {"id": 159, "start": 1190.4, "end": 1203.92, "text": "nicht kurz. Das haben ja schon viele gemacht, wobei ganz ehrlich, das ist im Kryptosektor,"}, {"id": 160, "start": 1203.92, "end": 1211.4, "text": "glaube ich, deutlich attraktiver. Nur, dass da die Investoren irgendwelche privaten Leute sind,"}, {"id": 161, "start": 1211.4, "end": 1217.24, "text": "die du verarschst, in denen sagst, gibts uns euer Geld. Was ich persönlich immer sehr beeindruckend"}, {"id": 162, "start": 1217.24, "end": 1222.16, "text": "finde, dass das überhaupt funktioniert. Generell sollte man auch mittlerweile im Internet ja"}, {"id": 163, "start": 1222.16, "end": 1227.72, "text": "eigentlich gecheckt haben, dass Leute, die sagen, gib mir dein Geld und ich mach dich reich, egal ob"}, {"id": 164, "start": 1227.72, "end": 1232.08, "text": "das in irgendwelche Gruppen sind, wo du reingehen sollst, oder Leute, die dich mit Krypto reich"}, {"id": 165, "start": 1232.08, "end": 1237.68, "text": "machen. Kurz eben mal gucken, was meine Stonks machen. Meine Stonks sind heute, dass das alles"}, {"id": 166, "start": 1237.68, "end": 1246.76, "text": "Scam ist. Oh, 85 Euro, meine Stonks, immerhin. 85 Euro, 542 Euro die Woche. Na, da kann ich"}, {"id": 167, "start": 1246.76, "end": 1251.76, "text": "doch mit leben. Besser als weiter, minus, Alter. Aber immer noch im Minus, also ich hab immer noch"}, {"id": 168, "start": 1251.76, "end": 1257.36, "text": "keinen Plus gemacht mit meinen Stonks. Na ja. Und Amazon ist auch nicht besser. Na ja, was auch immer."}, {"id": 169, "start": 1257.36, "end": 1265.68, "text": "Entspannter RZ-Kontrollgang auf dem Boot, ja. Okay, das ist wohl wahr. Man braucht dort keinen"}, {"id": 170, "start": 1265.68, "end": 1270.08, "text": "Sicherheitsdienst oder so. Da kommt halt, da kommt jetzt nicht mal so nebenbei einer hin."}, {"id": 171, "start": 1276.08, "end": 1283.48, "text": "Äh, ist die Erde nicht immer noch näher an Satelliten als der Mond? Satelliten sind irgendwie"}, {"id": 172, "start": 1283.48, "end": 1289.36, "text": "so 80.000 Kilometer teilweise weg. Also nicht die Tiefen, sondern die höheren, oder? Sind"}, {"id": 173, "start": 1289.36, "end": 1296.92, "text": "die irgendwie 80.000 Kilometer weg oder sowas? Und da ist der Mond ja deutlich weiter weg als,"}, {"id": 174, "start": 1296.92, "end": 1308.8, "text": "ja, aber vielleicht, ja. Jo, danke für den Sub. Was machen eigentlich die Microsoft Unterwasser"}, {"id": 175, "start": 1308.8, "end": 1319.56, "text": "Rechenzentren? Was machen die so? Die gibt's anscheinend noch, okay. Ah nee, die sind doch"}, {"id": 176, "start": 1319.56, "end": 1326.08, "text": "nicht so geil. Ach, weniger Fehler anfällig. Ja, die haben da irgendwie so ein U-Boot versenkt,"}, {"id": 177, "start": 1326.08, "end": 1332.34, "text": "weil das ist im Gegensatz zum Mond tatsächlich eine relativ gute Idee für Kühlung. Weil da hast"}, {"id": 178, "start": 1332.34, "end": 1353.68, "text": "du quasi Wasserkühlung gratis. Oh, kurz bin ich ein bisschen schneller. Ja, genau, das werden"}, {"id": 179, "start": 1353.68, "end": 1360.6, "text": "die machen. Die umgehen einfach mal, ich weiß jetzt gar nicht, wie es heißt, die umgeben"}, {"id": 180, "start": 1360.6, "end": 1363.92, "text": "einfach mal das Problem, dass du halt auch mit Quantenverschränkungen und Geschichten"}, {"id": 181, "start": 1363.92, "end": 1368.56, "text": "keine Informationen gescheit übertragen kannst. Aber da werden die schon was Neues, also was"}, {"id": 182, "start": 1368.56, "end": 1375.32, "text": "du gar nicht gescheit gar nicht übertragen kannst, das werden die schon, die werden das lösen. Easy,"}, {"id": 183, "start": 1375.32, "end": 1379.56, "text": "kein Problem. Also ich habe ja Vertrauen in Startups generell, die sagen immer nur die Wahrheit,"}, {"id": 184, "start": 1379.56, "end": 1384.64, "text": "die sagen immer nur, wie es ist. Genauso, der beste, eines der geilsten Startup Scams war doch"}, {"id": 185, "start": 1384.64, "end": 1389.88, "text": "diese Geschichte mit, die stechen dir in den Finger und können dann irgendwie 5000 Krankheiten"}, {"id": 186, "start": 1389.88, "end": 1394.56, "text": "erkennen, was nie richtig funktioniert hat, wo da kerngesunde Leute krebsdiagnostiziert"}, {"id": 187, "start": 1394.56, "end": 1398.44, "text": "wurde und sowas. Ich habe vergessen, wie die hießen, aber das war auch richtig massive"}, {"id": 188, "start": 1398.44, "end": 1405.36, "text": "Scam. Mit dieser plonten Vorstandsfrau da von denen. War noch jemand im Kopf, wie die heißen?"}, {"id": 189, "start": 1405.36, "end": 1420.12, "text": "Was mit T? Was mit T? Terra? TerraBus oder so? Wie hießen die denn? Moment, Startup, Scam, der"}, {"id": 190, "start": 1420.12, "end": 1428.2, "text": "schon mit Elisabeth kommt. Ja, die meine ich doch, die meine ich doch. TerraNos, nicht TerraBus."}, {"id": 191, "start": 1428.2, "end": 1437.56, "text": "Wie komme ich auf TerraBus? TerraBus gibt es das überhaupt? Okay, das ist tatsächlich ein Bus,"}, {"id": 192, "start": 1437.56, "end": 1444.04, "text": "alles klar. Ich war aber nah dran, TerraBus war das. Ja, die meine ich. Weiß ich, ob die jetzt im"}, {"id": 193, "start": 1444.04, "end": 1451.52, "text": "Knast gelandet ist? Also das war auch so richtig, richtig massive Scam. Da gab es dann irgendwelche"}, {"id": 194, "start": 1451.52, "end": 1456.4, "text": "Wellness und Hotelketten, die den Kram gekauft haben und am Ende haben die Sachen diagnostiziert"}, {"id": 195, "start": 1456.4, "end": 1463.56, "text": "bei Leuten, was sie nie hatten. Nee, nee, die meine ich nicht. Ich meinte hier diese Elisabeth"}, {"id": 196, "start": 1463.56, "end": 1479.12, "text": "Homes. Ja, den gibt es auch. Weiß ich gar nicht. Das ist so ein lila Ding gewesen, oder? Ich habe"}, {"id": 197, "start": 1479.12, "end": 1484.08, "text": "Brick und Morty nie großartig geguckt, aber den Plumbus oder wie man das ausführt, den kenne"}, {"id": 198, "start": 1484.08, "end": 1493.52, "text": "ich auch. Das ist auch so eine Serie, wo ich total oft gelesen habe, dass man das eigentlich nicht"}, {"id": 199, "start": 1493.52, "end": 1499.4, "text": "weiter als, glaube ich, zweite Staffel oder so gucken muss, weil ihnen dann irgendwie die Ideen"}, {"id": 200, "start": 1499.4, "end": 1504.48, "text": "ausgegangen sind. Ich weiß nicht, ob das stimmt. Habe ich gelesen, keine Ahnung. Nie groß geguckt."}, {"id": 201, "start": 1504.48, "end": 1511.76, "text": "So Leute, also ich sage euch mal, was wir heute vorhaben. Ich habe nichts großartig vor. Ich"}, {"id": 202, "start": 1511.76, "end": 1515.72, "text": "bin mega im Arsch, weil ich heute mal wieder sinnloserweise nach Frankfurt fahren musste,"}, {"id": 203, "start": 1515.72, "end": 1521.12, "text": "dementsprechend früher aufstehen und hin und zurück. Und mir sind die Leute heute im Zug"}, {"id": 204, "start": 1521.12, "end": 1527.6, "text": "schon wieder richtig auf den Sack gegangen. Es ist unglaublich, wie die das schaffen. In den Zug"}, {"id": 205, "start": 1527.6, "end": 1534.56, "text": "eingestiegen und morgen gegenüber, also stimmt nicht, also eine Sitzreihe vor mir,"}, {"id": 206, "start": 1534.56, "end": 1539.44, "text": "eine gehabt, die am Telefon rumschreit, weil sie daheim irgendwas gesucht haben und nicht gefunden."}, {"id": 207, "start": 1539.44, "end": 1547.68, "text": "Also laut gesprochen, nicht wirklich ist es törig rumgeschrien, sondern laut gesprochen."}, {"id": 208, "start": 1547.68, "end": 1555.52, "text": "Alter, haltet doch einer mal die Klappe. Und dann war es auch noch so voll wieder. Dann hatte"}, {"id": 209, "start": 1555.52, "end": 1561.68, "text": "ich eine Kontrollfrau, die nicht wusste, wie man oder es nicht auf die Reihe gekriegt hat,"}, {"id": 210, "start": 1561.68, "end": 1568.04, "text": "meine Karte zu kontrollieren im, wie nennt man das, Kartenschutzbehälter. Ich habe so"}, {"id": 211, "start": 1568.04, "end": 1573.52, "text": "elektronisches Ticket und das hat irgendwie nicht funktioniert. Und da muss ich das rausfummeln."}, {"id": 212, "start": 1573.52, "end": 1577.68, "text": "Dabei habe ich meine Eintrittskarte und meine Fahrkarte und das Geld alles in so einem"}, {"id": 213, "start": 1577.68, "end": 1582.64, "text": "Schutzbehälter reingestopft, dass ich eben alles zusammen in der Tasche habe. Die Leute gehen mir"}, {"id": 214, "start": 1582.64, "end": 1588.84, "text": "einfach drauf. Ich soll mich einfach in Ruhe lassen. Tja, dafür, dafür, warte mal auf das"}, {"id": 215, "start": 1588.84, "end": 1593.64, "text": "9 Euro Ticket. Ganz ehrlich, ich finde die Idee von dem 9 Euro Ticket nicht schlecht. Gerade,"}, {"id": 216, "start": 1593.64, "end": 1599.16, "text": "also aus mehreren Gründen, aus mehreren Gründen. Und ob das mit mit Sylt so krass wird,"}, {"id": 217, "start": 1599.16, "end": 1602.44, "text": "wie die Leute denken, da habe ich eh so meine Zweifel, aber warten wir mal ab, warten wir mal"}, {"id": 218, "start": 1602.44, "end": 1608.64, "text": "ab. Ich finde, ich finde das 9 Euro Ticket aus mehreren Gründen gut. Erstens finde ich,"}, {"id": 219, "start": 1608.64, "end": 1613.28, "text": "dass das prinzipiell eine gute Idee ist, wenn man den Leuten sagen möchte, sie sollen nicht mit dem"}, {"id": 220, "start": 1613.28, "end": 1619.28, "text": "Auto in die Stadt fahren und das teilweise sogar schon denkt, dass per Gesetzverordnung auch immer"}, {"id": 221, "start": 1619.28, "end": 1624.24, "text": "die Leute vorzuschreiben, nicht mehr mit dem Auto in die Stadt zu fahren, dann muss man ja"}, {"id": 222, "start": 1624.24, "end": 1629.04, "text": "irgendwie Alternativen schaffen. Zum Glück hat sich das dann nicht durchgesetzt mit dem"}, {"id": 223, "start": 1629.04, "end": 1633.2, "text": "Verbieten, das wäre auch absolut nicht praktikabel gewesen, aber das könnte ja zumindest ein erster"}, {"id": 224, "start": 1633.2, "end": 1638.12, "text": "Schritt sein, wenn man das irgendwie dann beibehält, wo bestimmt einige Leute sagen würden, hey,"}, {"id": 225, "start": 1638.12, "end": 1647.04, "text": "das ist so viel günstiger als Auto fahren, das würde ich machen. So, ganz kostenlos, weiß ich"}, {"id": 226, "start": 1647.04, "end": 1652.6, "text": "nicht, ob es eine gute Idee ist, weil dann hast du auch quasi die ganzen Assis den ganzen Tag nur noch"}, {"id": 227, "start": 1652.6, "end": 1656.16, "text": "in der Bahn abgammeln, das wird vielleicht bei dem 9 Euro Ticket schon ein bisschen so sein,"}, {"id": 228, "start": 1656.16, "end": 1662.24, "text": "aber ich glaube, bei 9 Euro, da ist es so, die ganz Ultra Assis, die überlegen sich dann auch"}, {"id": 229, "start": 1662.24, "end": 1669.76, "text": "nochmal bei 9 Euro. Naja, zumindest der zweite Grund, warum ich es gut finde, dass noch mehr"}, {"id": 230, "start": 1669.76, "end": 1676.48, "text": "Leute mal auf den Boden der Tatsache geholt werden, den Satz muss ich neu anfangen,"}, {"id": 231, "start": 1676.48, "end": 1682.44, "text": "dass noch ein paar mehr Leute damit jetzt quasi in Kontakt kommen mit der Bahn und auf den Boden"}, {"id": 232, "start": 1682.44, "end": 1691.12, "text": "der Tatsachen geholt werden, was für ein absoluter Picker-Drecks-Verein die Bahn ist. Und ich rede"}, {"id": 233, "start": 1691.12, "end": 1695.72, "text": "nicht von irgendwie dem Einzelnen, der sich täglich den Arsch aufreißt, dass es doch noch funktioniert,"}, {"id": 234, "start": 1695.72, "end": 1701.96, "text": "sondern ich meine das Gesamtkonzept, also das Gesamtkonstrukt. Das ist der allerletzte Scheißhaufen,"}, {"id": 235, "start": 1701.96, "end": 1706.92, "text": "die Bahn und ich hoffe, dass dadurch noch mehr Leute das mitbekommen und sich vielleicht mal"}, {"id": 236, "start": 1706.92, "end": 1712.64, "text": "irgendwas tut, außer schön gerechnete Statistiken. Also das sind so die Gründe, warum ich das"}, {"id": 237, "start": 1712.64, "end": 1719.84, "text": "eigentlich ganz gut finde. Nur die Leute, wo ich es nicht gut finde, ist, die darunter leiden müssen,"}, {"id": 238, "start": 1719.84, "end": 1724.8, "text": "die eventuell dann im Berufsverkehr quasi gar nicht mehr durchkommen und eventuell dann Auto"}, {"id": 239, "start": 1724.8, "end": 1730.04, "text": "fahren, weil sie wirklich, müssen wir mal gucken, da bin ich gespannt, da bin ich gespannt. Ich habe"}, {"id": 240, "start": 1730.04, "end": 1735.52, "text": "ja schon, ich habe ja schon die ersten Kommentare gelesen, die gesagt haben, man sollte es im"}, {"id": 241, "start": 1735.52, "end": 1741.84, "text": "Berufsverkehr verbieten. Dann kamen die nächsten Leute an, die gesagt haben, ja, man sollte verbieten,"}, {"id": 242, "start": 1741.84, "end": 1747.0, "text": "dass die Leute, die ein 9-Euro-Ticket haben, noch überhaupt fahren mit dem Auto. Und wisst ihr,"}, {"id": 243, "start": 1747.0, "end": 1752.16, "text": "was ich mir bei solchen Kommentaren immer denke? Wie wär's dann einfach mit gar nichts verbieten?"}, {"id": 244, "start": 1752.16, "end": 1758.12, "text": "Muss man jeden Scheiß verbieten, immer wenn einem nichts besseres einfällt als Alternative. Gibt"}, {"id": 245, "start": 1758.12, "end": 1762.08, "text": "es auch so viel Anreize, die man setzen kann, Sachen, wie man, wie man Dinge beeinflussen kann,"}, {"id": 246, "start": 1762.08, "end": 1771.64, "text": "ohne gleich zu sagen, nee, alles oder nichts. Naja. Ich bin mal gespannt, was da dran wird."}, {"id": 247, "start": 1771.64, "end": 1778.48, "text": "Ehrlich gesagt habe ich keine Ahnung, aber auf jeden Fall ein ganz, ganz großer Teil. Aber es"}, {"id": 248, "start": 1778.48, "end": 1782.8, "text": "müssen eigentlich 100% Anteile der Bahn gehören, weil die Bahn ist ja nie so wirklich öffentlich an"}, {"id": 249, "start": 1782.8, "end": 1788.8, "text": "die Börse und konnte da gehandelt werden. Das heißt jetzt zwar nicht zwangsläufig, dass alles 100%"}, {"id": 250, "start": 1788.8, "end": 1808.28, "text": "ich dem, ich weiß es nicht, keine Ahnung. Naja, aber dann wird Geld wenigstens mal für was"}, {"id": 251, "start": 1808.28, "end": 1821.44, "text": "verbrannt, wo man was von hat. Ja, gut, das kannst du bei allem sagen. Wenn es danach geht, darfst du"}, {"id": 252, "start": 1821.44, "end": 1826.84, "text": "dir auch kein Elektroauto kaufen, weil nichts ist umweltschonender, als ein altes Schrottauto noch"}, {"id": 253, "start": 1826.84, "end": 1831.6, "text": "weiter zu fahren, bis es letztendlich auseinanderfällt. Aber ja, ich, ich, also wie sagt man,"}, {"id": 254, "start": 1831.6, "end": 1842.12, "text": "ich gette den Point, ja, da ist natürlich schon was dran. Scheiß Satz, Alter. Gettet ihr auch"}, {"id": 255, "start": 1842.12, "end": 1857.44, "text": "manchmal den Point, Leute? Pains Jam. Ich bin mal gespannt, was da rauskommt. Ich bin ja auch mal"}, {"id": 256, "start": 1857.44, "end": 1862.72, "text": "gespannt, ob das überhaupt, ist das eigentlich mittlerweile alles genehmigt und geregelt und so."}, {"id": 257, "start": 1862.72, "end": 1875.92, "text": "Ich bin ja auch mal gespannt. Nee, ist ja nicht durch. Ob sie das wirklich schaffen, bis, man soll"}, {"id": 258, "start": 1875.92, "end": 1880.84, "text": "es ja angeblich irgendwie ab 5. Mai oder so, 25. Mai kaufen können. Ich bin mal wirklich gespannt,"}, {"id": 259, "start": 1880.84, "end": 1899.0, "text": "ob das überhaupt möglich ist. Also wisst ihr, wie ich meine, ich bin mal gespannt,"}, {"id": 260, "start": 1899.0, "end": 1918.92, "text": "ob sie das überhaupt hinbekommen, das zu genehmigen. Ich, ich, ich hab da nicht so,"}, {"id": 261, "start": 1918.92, "end": 1925.88, "text": "wie soll ich sagen, ich hab da nicht so hohes Vertrauen, weil ihr erinnert euch vielleicht"}, {"id": 262, "start": 1925.88, "end": 1930.44, "text": "noch, okay, das ist jetzt ein bisschen was anderes, aber es ist immer das beste Beispiel,"}, {"id": 263, "start": 1930.44, "end": 1934.44, "text": "was mir dafür einfällt. Ihr erinnert euch doch vielleicht noch daran, dass wir abgestimmt haben,"}, {"id": 264, "start": 1934.44, "end": 1941.68, "text": "wie es mit Sommer-Winterzeit-Umstellung aussieht. Da ist auch nicht so viel passiert,"}, {"id": 265, "start": 1941.68, "end": 1954.4, "text": "obwohl alle gesagt haben, so ein Scheiß weg damit. Moin, WoutsTronic. Tommy schreibt,"}, {"id": 266, "start": 1954.4, "end": 1959.12, "text": "wollt ihr mal live danke sagen, ich schaue seit 2014 deine Videos und hab dir, hab dank dir mein"}, {"id": 267, "start": 1959.12, "end": 1962.56, "text": "Interesse zu IT geworden. Das finde ich immer schön, wenn das Leute schreiben. Du bist nicht"}, {"id": 268, "start": 1962.56, "end": 1966.56, "text": "der Erste, der da schreibt. Das finde ich aber immer cool. Ich muss dazu sagen, mittlerweile mache"}, {"id": 269, "start": 1966.56, "end": 1970.16, "text": "ich ja auch Videos manchmal mit dem Hinblick drauf, weil ich jetzt weiß, dass Leute sich den Graben"}, {"id": 270, "start": 1970.16, "end": 1974.96, "text": "angucken, die vielleicht in Zukunft in diese Richtung gehen werden oder gehen wollen, ja."}, {"id": 271, "start": 1974.96, "end": 1981.68, "text": "Damals habe ich Videos, ehrlich gesagt, auch wenn es sich so angehört hat, weniger mit dem"}, {"id": 272, "start": 1981.68, "end": 1985.84, "text": "Hintergedanken gemacht, weil es mir gar nicht klar war, dass es, weil ich es wirklich realisiert"}, {"id": 273, "start": 1985.84, "end": 1990.4, "text": "habe, dass das tatsächlich Leute beeinflusst oder man könnte ja sagen, quasi influenced,"}, {"id": 274, "start": 1990.4, "end": 1996.16, "text": "wie das heutzutage heißt, dass da was zu machen. Aber ich finde, ich finde, ich finde das immer"}, {"id": 275, "start": 1996.16, "end": 2002.72, "text": "schön zu lesen, ja. So, also heute mit 21 Jahren arbeite ich. Okay, wenn du heute 21 bist, warst du"}, {"id": 276, "start": 2002.72, "end": 2009.04, "text": "damals eines der ganzen 12-jährigen Call of Duty Kinder, die rumgeflapt haben unter den Channels,"}, {"id": 277, "start": 2009.04, "end": 2017.04, "text": "gib es zu, unter den Videos. Da gibt es ganz viele. Chat, wer von euch war da auch dabei?"}, {"id": 278, "start": 2017.04, "end": 2024.16, "text": "Ganz viele, ich weiß es auch von vielen Kommentaren. Genau so einer war ich, ja, war klar."}, {"id": 279, "start": 2024.16, "end": 2033.12, "text": "Heute mit 21 Jahren arbeite ich bei einem großen Automobilkonzern in der Entwicklung und mache"}, {"id": 280, "start": 2033.12, "end": 2037.92, "text": "viel Geld nebenher als Freelancer mit anderen Projekten. Dadurch, durch die habe ich sehr früh"}, {"id": 281, "start": 2037.92, "end": 2042.32, "text": "selber Programmieren beigebracht, mich viel weiter gemeldet in Sachen harten Software, ich war ständig"}, {"id": 282, "start": 2042.32, "end": 2047.12, "text": "von meinem Vorgesetzten gelobt. Na dann, siehst du man, besser, besser konnte es doch gar nicht"}, {"id": 283, "start": 2047.12, "end": 2053.6, "text": "laufen. Du musst nur gucken, es fällt mir gerade an der Stelle ein, ich weiß ja nicht, was, was da"}, {"id": 284, "start": 2053.6, "end": 2061.68, "text": "jetzt genau dahinter steckt. Du musst nur gucken, dass sie dich ordentlich bezahlen und nicht ausbeuten."}, {"id": 285, "start": 2061.68, "end": 2065.64, "text": "Das ist auch was, das habe ich erst später kapiert, da habe ich früher auch nichts so gesagt in Videos,"}, {"id": 286, "start": 2065.64, "end": 2073.2, "text": "weil es gibt manche Leute, gerade im Management, die haben da Talente für, sie haben ein gewisses"}, {"id": 287, "start": 2073.2, "end": 2079.8, "text": "Gespür dafür, was Leute hören wollen und erzählen das dann den Leuten und die geben sich damit zu"}, {"id": 288, "start": 2079.8, "end": 2084.32, "text": "Frieden und fragen nicht nach mehr Geld. Aber wenn du sagst, du verdienst viel Kohle, dann ist ja"}, {"id": 289, "start": 2084.32, "end": 2091.4, "text": "alles in Ordnung. Aber man sieht es bei unseren Pflegekräften und den Leuten im Supermarkt,"}, {"id": 290, "start": 2091.4, "end": 2098.52, "text": "hast du nicht gesehen, rein mit warmen Worten bezahlt sich halt auch nichts. Wer ist der"}, {"id": 291, "start": 2098.52, "end": 2103.36, "text": "FyFat-Content auf YouTube? Ja, so sieht es aus, aber es gibt noch mehr FyFat-Channels."}, {"id": 292, "start": 2103.36, "end": 2111.76, "text": "Aber es ist schön, dass das funktioniert hat. Ja, übrigens, achso, also wer darauf hofft,"}, {"id": 293, "start": 2111.76, "end": 2115.68, "text": "dass wir heute irgendwas weiter programmieren oder basteln oder so, ich bin viel zu sehr im Arsch,"}, {"id": 294, "start": 2115.68, "end": 2122.32, "text": "ich kann heute nichts großartig machen. Neues Armor schon gesehen? Nee. Ja, dann ist doch alles gut."}, {"id": 295, "start": 2122.32, "end": 2133.24, "text": "Naja, das kommt natürlich ganz entscheidend darauf an, ob sich dein Aufgabenfeld erweitert hat,"}, {"id": 296, "start": 2133.24, "end": 2137.16, "text": "ob du jetzt andere Sachen machst, ob sich vielleicht grundsätzlich was geändert hat,"}, {"id": 297, "start": 2137.16, "end": 2144.48, "text": "ob du jetzt andere Positionen hast oder sonst was. Das kann man so pauschal schlecht sagen."}, {"id": 298, "start": 2144.48, "end": 2153.68, "text": "Das kommt auf sehr vieles an. Ich tue mir da selbst auch immer schwer, mir was zu überlegen,"}, {"id": 299, "start": 2153.68, "end": 2160.88, "text": "was ich sagen könnte. Aber eine Sache hat sich mittlerweile, das habe ich auch glaube ich in"}, {"id": 300, "start": 2160.88, "end": 2168.6, "text": "dem Video mal erzählt, also eine Sache hat sich bei mir da, wie soll ich sagen, als lohnend"}, {"id": 301, "start": 2168.6, "end": 2177.8, "text": "rausgestellt oder als sinnvoll rausgestellt immer mehr sagen als das, mit dem du zufrieden bist"}, {"id": 302, "start": 2177.8, "end": 2184.56, "text": "oder als das, was du haben willst oder. Ja, also was weiß ich? Was weiß ich? Sagen wir sagen,"}, {"id": 303, "start": 2184.56, "end": 2193.6, "text": "du verdienst 2000 Euro im Monat und du würdest gerne 2200 Euro im Monat verdienen und das ist"}, {"id": 304, "start": 2193.6, "end": 2198.68, "text": "halt auch das, was du anstrebst. Dann kannst du nicht sagen, du möchtest 200 Euro mehr oder 10"}, {"id": 305, "start": 2198.68, "end": 2204.92, "text": "Prozent mehr, was bei manche denken, das ist super viel. Also gerade bei uns machen sie auch,"}, {"id": 306, "start": 2204.92, "end": 2210.96, "text": "wenn du bei einem zweistelligen Betrag ankommst, machen sie immer, machen sie Augen, ne, mach"}, {"id": 307, "start": 2210.96, "end": 2218.16, "text": "Auge oder wie sagt man da mittlerweile? Sie machen Auge, wenn du da mit was zweistelligem ankommst."}, {"id": 308, "start": 2218.16, "end": 2222.32, "text": "Aber ganz im Ernst, sag ruhig das Doppelte von dem, was du haben willst. Das wirst du wahrscheinlich"}, {"id": 309, "start": 2222.32, "end": 2227.32, "text": "nicht kriegen, aber dann kommt am Ende irgendwas anderes bei rum, wo du wahrscheinlich eher mit"}, {"id": 310, "start": 2227.32, "end": 2232.96, "text": "zufrieden bist, als wenn du mit kleineren Sachen ins Rennen gehst. Und selbst wenn sich am Anfang"}, {"id": 311, "start": 2232.96, "end": 2241.88, "text": "aus deinem Bauchgefühl unverschämt anhört, so viel zu sagen, es kann dir nichts passieren. Die"}, {"id": 312, "start": 2241.88, "end": 2248.08, "text": "werden dich wegen einer etwas überhöhten Gehaltsvorstellung sicherlich nicht rausschmeißen."}, {"id": 313, "start": 2248.08, "end": 2253.52, "text": "Im Zweifelsfall lacht man dann mal drüber und dein Chef sagt, er guckt mal, was er für dich tun kann"}, {"id": 314, "start": 2253.52, "end": 2259.96, "text": "oder was auch immer. Aber es ist auf jeden Fall besser, als zu niedrig anzufangen oder glatt mit"}, {"id": 315, "start": 2259.96, "end": 2264.88, "text": "dem, mit dem du zufrieden bist. Weil natürlich, das verspricht dir am Ende nicht, dass das dann"}, {"id": 316, "start": 2264.88, "end": 2269.52, "text": "auch wirklich genau das wird, was du haben willst. Aber das hat sich bei mir ganz gut bewährt."}, {"id": 317, "start": 2269.52, "end": 2284.56, "text": "Reforger. Das heißt nicht wirklich Reforger, oder? Der Name ist etwas verbrannt seit Warcraft."}, {"id": 318, "start": 2284.56, "end": 2293.8, "text": "Ich meine, das heißt, das hieß Reforged und das heißt Reforger, aber die Benamung ist schon"}, {"id": 319, "start": 2293.8, "end": 2303.76, "text": "Pains Champ. Das läuft wahrscheinlich nur auf dem absoluten NASA PC. Arma läuft nie gut und jetzt"}, {"id": 320, "start": 2303.76, "end": 2315.44, "text": "ist eh vorbei. Noch, noch, noch einen neuen. Warum sind die Leute nicht zufrieden? Simplified."}, {"id": 321, "start": 2315.44, "end": 2323.16, "text": "Moment, Moment. Die können Arma nicht simplifien. Wenn die Arma simplifien hat Arma keine"}, {"id": 322, "start": 2323.16, "end": 2329.28, "text": "Daseinsberechtigung mehr. Jetzt ohne Scheiß. Das ist der Selling Point für Arma, dass es noch"}, {"id": 323, "start": 2329.28, "end": 2333.92, "text": "mehr oder weniger Simulation ist. Das sind ja, glaube ich, die gleichen Leute, die früher auch"}, {"id": 324, "start": 2333.92, "end": 2339.16, "text": "Operation Flashpoint und sowas gemacht haben. Bin mir nicht ganz sicher, aber ich glaube schon. Und"}, {"id": 325, "start": 2339.16, "end": 2347.32, "text": "ich glaube, die haben auch tatsächlich für Militärs auf der Welt und sowas Simulation und"}, {"id": 326, "start": 2347.32, "end": 2354.12, "text": "Sachen schon entwickelt. Also, die haben Plan. Und was ist die Daseinsberechtigung von Arma,"}, {"id": 327, "start": 2354.12, "end": 2362.28, "text": "wenn Arma mit dem Controller easy spielbar und vercasualt ist? Also, Patrick ist, ich bin kaputt"}, {"id": 328, "start": 2362.28, "end": 2384.08, "text": "als fuck, das geht. Immer gespannt. Ich bin kein großer Arma-Spieler. Kann ich nichts zu sagen."}, {"id": 329, "start": 2384.08, "end": 2393.32, "text": "Da kennt sich der Patrick mit aus. Was ich gemacht habe, ich musste sinnvollerweise unsinnigerweise"}, {"id": 330, "start": 2393.32, "end": 2397.92, "text": "heute nach Frankfurt fahren für einen ganzen Tag voller Gemiete, die ich dann doch bis auf"}, {"id": 331, "start": 2397.92, "end": 2411.12, "text": "eines über Teams gemacht habe. Alles klar. Muss man Arma mit Semper-Video spielen? Also,"}, {"id": 332, "start": 2411.12, "end": 2414.68, "text": "ich kenne erstens Semper-Video nicht persönlich und zweitens kann ich Arma nicht. Ich glaube,"}, {"id": 333, "start": 2414.68, "end": 2420.84, "text": "okay, ich lehne mich jetzt mal aus dem Fenster. Ich habe keine Ahnung, wie gut der Sprecher in"}, {"id": 334, "start": 2420.84, "end": 2427.16, "text": "Games ist, aber wahrscheinlich wird er jetzt auch nicht der überkrasse Arma-Basher sein."}, {"id": 335, "start": 2427.16, "end": 2444.0, "text": "Das hat sich richtig gelohnt, nach Frankfurt zu fahren dafür heute. Ihr müsst ja eure"}, {"id": 336, "start": 2444.0, "end": 2453.32, "text": "neue Placing-Machine da hinbekommen. On-Prem-Video-Konferenz. Ja, habe ich heute quasi gemacht. Ich habe"}, {"id": 337, "start": 2453.32, "end": 2464.0, "text": "den ganzen Tag gemietet. Über Teams vor Ort. Richtig bescheuert. Wie viele Leute seid ihr"}, {"id": 338, "start": 2464.0, "end": 2467.72, "text": "denn mittlerweile? Wobei ihr braucht das wahrscheinlich hauptsächlich für irgendwelche Maschinen und"}, {"id": 339, "start": 2467.72, "end": 2475.56, "text": "Sachen, die da rumstehen. Gehe ich mal von aus. Aber Leute, wenn ihr einen fragen wollt,"}, {"id": 340, "start": 2475.56, "end": 2480.28, "text": "der sich mit Verhandlungen auskennt, fragt den Patrick. Der sagt einfach, bezahlt jetzt"}, {"id": 341, "start": 2480.28, "end": 2486.96, "text": "mal ordentlich oder ich hau ab. Oder fickt euch, macht was ihr wollt und dann sagen die"}, {"id": 342, "start": 2486.96, "end": 2495.76, "text": "alle, ja, wir bezahlen jetzt ordentlich. Ganz einfach, easy, so musst du es machen. Ich"}, {"id": 343, "start": 2495.76, "end": 2501.68, "text": "habe mal eine andere Frage an euch. Hat mal einer zufälligerweise diesen Hersteller bei"}, {"id": 344, "start": 2501.68, "end": 2510.36, "text": "USVs ausprobiert? Ich weiß, random, super random Themenwechsel hat mal einer das da ausprobiert."}, {"id": 345, "start": 2510.36, "end": 2521.52, "text": "Also nicht explizit die, sondern hat mal einer was von dem Hersteller gehabt? Weil, ich bin"}, {"id": 346, "start": 2521.52, "end": 2526.96, "text": "immer noch am überlegen, ob ich mir nicht doch eine USV ins Rack haue. Ich habe eine,"}, {"id": 347, "start": 2526.96, "end": 2535.36, "text": "taugt die. Und was ich viel interessanter finde, läuft die weiter, wenn die Batterie"}, {"id": 348, "start": 2535.36, "end": 2542.44, "text": "abkackt. Also, noch mal so für alle, ich hab's letztens nicht mehr erzählt. Ich hatte"}, {"id": 349, "start": 2542.44, "end": 2556.96, "text": "ja eine Cyber Power USV Rack. Ja, so ein Teil hier in der Richtung hatte ich so was da."}, {"id": 350, "start": 2556.96, "end": 2562.92, "text": "Sieht ziemlich genauso aus wie das. Alter, wir hatten das Bild, das ist ja mal. Igitt,"}, {"id": 351, "start": 2562.92, "end": 2567.92, "text": "was ist mit eurem Background los? Also so ein Teil in der Richtung hatte ich. Und das Problem"}, {"id": 352, "start": 2567.92, "end": 2576.6, "text": "damit war, was ist das für ein abfuck Hintergrund, man? Ist das von Chrome der neueste transparent"}, {"id": 353, "start": 2576.6, "end": 2590.04, "text": "Background oder was? So, also da hatte ich welche. Und auf eines Morgens, ich hatte,"}, {"id": 354, "start": 2590.04, "end": 2593.8, "text": "ich kanns euch ja mal zeigen, ich bin mir gar nicht sehr, wie heißt das Ding? Cyber Power"}, {"id": 355, "start": 2593.8, "end": 2600.8, "text": "600. Ja, das wird's wahrscheinlich sein. Das sieht sehr genau aus, wie das, was ich"}, {"id": 356, "start": 2600.8, "end": 2605.52, "text": "aktuell hab. Oder besser gesagt, auch im Rack hängen habe, aber nicht mehr verwende. So,"}, {"id": 357, "start": 2605.52, "end": 2608.8, "text": "also das Problem, was ich damit hatte, ist, die hat immer wunderbar funktioniert. Überhaupt"}, {"id": 358, "start": 2608.8, "end": 2619.44, "text": "gar kein Problem. Eines Tages war mein komplettes Rack aus. Und ich denk mir, warum? Stromausfall"}, {"id": 359, "start": 2619.44, "end": 2627.28, "text": "oder was? Nö, Strom geht. Was passiert ist, der Akku war kaputt. Und da hat sich die USB"}, {"id": 360, "start": 2627.28, "end": 2634.88, "text": "einfach gedacht, ja, wenn der Akku kaputt ist, dann bin ich auch kaputt. Dann geht gar"}, {"id": 361, "start": 2634.88, "end": 2641.24, "text": "nix mehr. So, und ich kann mich ja noch dunkel dran erinnern, dass es verschiedene Typen"}, {"id": 362, "start": 2641.24, "end": 2649.4, "text": "von USBs gibt. Also erst einmal so die klassische USB, die tatsächlich umschaltet, wenn, das"}, {"id": 363, "start": 2649.4, "end": 2656.32, "text": "Strom, wenn Stromausfall ist. So, dann hast du Sachen, die das permanent durch die Batterie"}, {"id": 364, "start": 2656.32, "end": 2660.84, "text": "leiten. Und dann hast du noch irgendwas drin, das weiß ich jetzt aber gerade vergessen habe."}, {"id": 365, "start": 2660.84, "end": 2665.68, "text": "So, und wahrscheinlich war das hier so eine, die das durch die Batterie leitet. Das ist"}, {"id": 366, "start": 2665.68, "end": 2670.44, "text": "natürlich, hat seine Vorteile, ja, zum Beispiel, dass es keine Spannungsspitzen gibt oder sonst"}, {"id": 367, "start": 2670.44, "end": 2676.12, "text": "was. Aber ganz im Ernst, ich hab keinen Bock, dass von fünf Jahren der einzige Ausfall"}, {"id": 368, "start": 2676.12, "end": 2680.84, "text": "ist, nicht der Stromausfall, sondern das mein USB verreckt und der Akku wird früher oder"}, {"id": 369, "start": 2680.84, "end": 2687.32, "text": "später verrecken. So, das heißt, ich will eine USB, ich will quasi die billigste USB"}, {"id": 370, "start": 2687.32, "end": 2693.08, "text": "von der Bauart haben, ich will eine USB, die einfach geht und den Strom durchleitet, solang"}, {"id": 371, "start": 2693.08, "end": 2699.8, "text": "Strom da ist. So, also ihr sagt, dass der Hersteller taugt was, ich weiß halt nicht,"}, {"id": 372, "start": 2699.8, "end": 2707.96, "text": "ob das, was der USB hier auch so ist. Also im Zweifelsfall wäre cool, wenn man die auch"}, {"id": 373, "start": 2707.96, "end": 2712.4, "text": "aufmachen könnte und den Akku wechseln, ohne dass man das ausschalten muss. Wobei ich mir"}, {"id": 374, "start": 2712.4, "end": 2715.36, "text": "vorstellen könnte, dass das nicht so gebaut ist, du kommst da wahrscheinlich gar nicht"}, {"id": 375, "start": 2715.36, "end": 2744.04, "text": "richtig dran. Ja, ich will ja auch keine 300 Euro USB. Ja, also meint ihr sowas? Ja, kannst"}, {"id": 376, "start": 2744.04, "end": 2749.72, "text": "du bei dem Ding, kannst du dort die Batterie im laufenden Betrieb wechseln, geht das? Also"}, {"id": 377, "start": 2749.72, "end": 2754.48, "text": "könntest du, ich weiß gar nicht, wie man die öffnet hier, keine Ahnung. Ich guck mal"}, {"id": 378, "start": 2754.48, "end": 2765.44, "text": "kurz in das Handbuch. Manual. Die Sonnenkönig Eco. Äh, das glaube ich einfach nur schlecht"}, {"id": 379, "start": 2765.44, "end": 2777.72, "text": "übersetzt, oder? So, wie tauscht man, wie tauscht man denn hier Batterien? Wie ich solche Bedienungsanleitungen"}, {"id": 380, "start": 2777.72, "end": 2785.0, "text": "hasse, Alter. Das ist absoluter, absoluter Schmutz, wie man da so heute sagte. Ihr wisst,"}, {"id": 381, "start": 2785.0, "end": 2790.64, "text": "Hello Fellow Kids, ich muss bisschen Jugendsprache trainieren, um am Puls der Zeit zu bleiben."}, {"id": 382, "start": 2790.64, "end": 2793.96, "text": "Ja, ich hab gehört, man so Schmutz sagt man da jetzt dazu. Nicht mehr Dreck, früher hat"}, {"id": 383, "start": 2793.96, "end": 2801.88, "text": "man gesagt Dreck, mittlerweile sagt man Schmutz. Aber war Schmutz nicht vor drei Jahren? Ah,"}, {"id": 384, "start": 2801.88, "end": 2816.04, "text": "kann sein, kann sein. Möglich. Sus. Bald mach ich das wie die Tagesschau-Sprecherin. Sus."}, {"id": 385, "start": 2816.04, "end": 2821.36, "text": "Die haben glaube ich, ich glaube diesen Tagesschau-Clip haben die hochgeladen, weil irgendjemand"}, {"id": 386, "start": 2821.36, "end": 2827.32, "text": "dort erkannt hat, das hat Meme-Potenzial. Irgendeiner von den Nicht-Boomer-Mitarbeitern"}, {"id": 387, "start": 2827.32, "end": 2833.36, "text": "dort bei der ARD hat das kapiert und hat das hochgeladen, hat Gold richtig damit gelegen."}, {"id": 388, "start": 2833.36, "end": 2843.84, "text": "Ist Digger, ist Digger wirklich immer noch angesagt? Digger war doch vor fünf Jahren"}, {"id": 389, "start": 2843.84, "end": 2853.84, "text": "schon. Was ist es denn jetzt wieder? Brudi? Ne, immer noch Digger? Das sagt man immer"}, {"id": 390, "start": 2853.84, "end": 2862.56, "text": "noch Digger? Also wir haben immer gesagt Alter, das sag ich ja immer noch. Alter. Digger"}, {"id": 391, "start": 2862.56, "end": 2866.4, "text": "sagt man immer noch, jetzt ist es auch langsam schwierig. Wenn Bruder durch ist, Alter durch"}, {"id": 392, "start": 2866.4, "end": 2876.08, "text": "ist Digger durch ist. Valar, ja Valar hat ja nichts mit Digger zu tun. Wobei das hat"}, {"id": 393, "start": 2876.08, "end": 2889.84, "text": "auch abgenommen. Bratan ist richtig cringe. So, also wie tauscht man denn jetzt die Batterien?"}, {"id": 394, "start": 2889.84, "end": 2894.48, "text": "Also aktuell seh ich da halt einfach nur Stecker, da wäre ich auf die Idee, da wäre ich auch"}, {"id": 395, "start": 2894.48, "end": 2899.12, "text": "selbst noch gekommen. Beep, machts da wenn man da drauf drückt. Sehr schön. Das hätte"}, {"id": 396, "start": 2899.12, "end": 2918.24, "text": "ich mir nicht gedacht. Aha, Battery Change. Kann man das im laufenden Blittrieb machen?"}, {"id": 397, "start": 2918.24, "end": 2930.0, "text": "Take care not to inverse polarity. Wie wärs damit, wenn man die Stecker einfach unterschiedlich"}, {"id": 398, "start": 2930.0, "end": 2938.48, "text": "macht, dass man nicht polarity reversen kann? Save nicht, kauf einfach alle vier Jahre"}, {"id": 399, "start": 2938.48, "end": 2941.48, "text": "eine neue, da muss ich ja alle vier Jahre einmal ausschalten, um eine neue anzuschließen."}, {"id": 400, "start": 2941.48, "end": 2947.24, "text": "Auf der anderen Seite Patrick, ich glaube, das ist gar keine so blöde Idee. Weil ganz"}, {"id": 401, "start": 2947.24, "end": 2954.64, "text": "im Ernst 84 Euro alle vier Jahre kann man sich eigentlich mal gönnen. Oder ich mach"}, {"id": 402, "start": 2954.64, "end": 2959.48, "text": "so wie bisher und lass einfach das ganze Ding ohne USV laufen, weil seit meine letzte verreckt"}, {"id": 403, "start": 2959.48, "end": 2963.6, "text": "ist hab ich auch nichts dran, es ist noch nie was passiert. Aber es ist noch nie was"}, {"id": 404, "start": 2963.6, "end": 2967.76, "text": "passiert, Famous Last Words, ihr wisst ja. Am Endeffekt ist dann irgendwie das Raid"}, {"id": 405, "start": 2967.76, "end": 2971.08, "text": "korrupt, wobei ich ja gar kein richtiges Raid im klassischen Sinn mehr hab."}, {"id": 406, "start": 2971.08, "end": 2985.72, "text": "Die sagen nicht explizit, dass man, ach doch, guck mal, man muss soll rausziehen. Die sagen,"}, {"id": 407, "start": 2985.72, "end": 2990.92, "text": "man soll den Stecker raus machen, bevor man die Batterie wechselt. Ok, also man soll ausschalten."}, {"id": 408, "start": 2990.92, "end": 3019.28, "text": "Ok, Batterie charge, ne, change, change, change. Weil vielleicht, Chet, was mein dir? Soll"}, {"id": 409, "start": 3019.28, "end": 3029.28, "text": "ich einfach YOLO Modus weiterfahren, scheiß drauf, ohne USV? Was würdet ihr machen? Also"}, {"id": 410, "start": 3029.28, "end": 3034.96, "text": "man weiß halt nicht, was da auf einen zukommt. Es kann morgen der Stromausfall sein oder"}, {"id": 411, "start": 3034.96, "end": 3043.32, "text": "halt auch nie. Meint ihr eine USV? Vom Preis erscheint die ja ok zu sein. Aber ich will"}, {"id": 412, "start": 3043.32, "end": 3050.84, "text": "die mit USV, ich will die mit USV. Also die ist kacke, ich brauch die mit USV. Also bräuchte"}, {"id": 413, "start": 3050.84, "end": 3060.24, "text": "ich mindestens die hier, 106 Euro. Weil ohne USV ist Müll. Ich muss den Status auslesen"}, {"id": 414, "start": 3060.24, "end": 3069.76, "text": "können. Äh, ja was hat die jetzt eigentlich für Anschlüsse? Hat die so Kaltgerätestecker"}, {"id": 415, "start": 3069.76, "end": 3075.36, "text": "oder hat die Schoko-Dosen? Dean im Namen lässt mich darauf schließen, dass die Schoko-Dosen"}, {"id": 416, "start": 3075.36, "end": 3081.52, "text": "hat und keine Kaltgerätestecker. Kann die andere das nicht auch? Die hat, ne, das glaube"}, {"id": 417, "start": 3081.52, "end": 3086.6, "text": "ich nicht. Ich glaube die Netzwerkstecke hier oben sind rein Überspannungsschutz. Glaub"}, {"id": 418, "start": 3086.6, "end": 3091.48, "text": "nicht, dass da eh. Das ist ja wahnsinnig gut aufgelöstes Bild hier. Ne, das ist glaube"}, {"id": 419, "start": 3091.48, "end": 3096.2, "text": "ich einfach ein Überspannungsschutz. Ich glaube nicht, dass die Netzwerk Connect hat."}, {"id": 420, "start": 3096.2, "end": 3101.64, "text": "Das wird mich bei dem Preis wirklich wundern. Also die haben ja eher USB-Verbindung bevor"}, {"id": 421, "start": 3101.64, "end": 3110.44, "text": "sie Netzwerkverbindung haben. Also Anschlüsse erklären ist out, das braucht man nicht."}, {"id": 422, "start": 3110.44, "end": 3130.92, "text": "Guck mal, FR Dean hat Stecker? Ne, doch. Okay, das ist überhaupt nicht. Ich bin überhaupt"}, {"id": 423, "start": 3130.92, "end": 3144.4, "text": "nicht dran, ich traine Network. Ne, Modern Ethernet can be protected in searches. Okay,"}, {"id": 424, "start": 3144.4, "end": 3161.28, "text": "das hat kein, das hat keine Datenaustausch. Das ist nur, das ist rein Überspannungsschutz."}, {"id": 425, "start": 3161.28, "end": 3170.92, "text": "Joa. Also, zeig mal her. Ja, deswegen will ich auch ne billige. Ich will, dass es weiter"}, {"id": 426, "start": 3170.92, "end": 3183.44, "text": "läuft, wenn die Batterie verreckt. Ich will nicht den Akku überbrücken. Ich will, dass"}, {"id": 427, "start": 3183.44, "end": 3188.36, "text": "das Ding weiter läuft, solange Strom aus der Steckdose kommt, auch wenn der Akku im Zweifelsfall"}, {"id": 428, "start": 3188.36, "end": 3200.4, "text": "rausgezogen ist. Das soll einfach funktionieren, solange Strom aus der Wand kommt. Es gibt"}, {"id": 429, "start": 3200.4, "end": 3212.88, "text": "Videos. Okay, okay, Sekunde. Change Battery. Ja, das ist so ne super fette. Das sind ja,"}, {"id": 430, "start": 3212.88, "end": 3226.68, "text": "das sind ja die Profi-Dinger. Da komm ich nicht weit mit. Wie heißen die normale? Ellipse?"}, {"id": 431, "start": 3226.68, "end": 3234.16, "text": "Replace Battery. Okay, zeig her. Ja, super, da hat die nicht angeschlossen. Das ist jetzt"}, {"id": 432, "start": 3234.16, "end": 3241.6, "text": "ja auch nichts, nichts, äh, nichts sagend. Das, das krieg ich, ja, das krieg ich schon"}, {"id": 433, "start": 3241.6, "end": 3246.6, "text": "hin, die zu wechseln. Frage ist halt, wie sieht's aus, wenn die abgeschl... Also, wenn"}, {"id": 434, "start": 3246.6, "end": 3259.12, "text": "die nicht angeschlossen ist. Die machen das alle ab? Machen das alle ab? Okay, how to"}, {"id": 435, "start": 3259.12, "end": 3270.28, "text": "change battery? Switch OPS off from the front panel and unplug. Ah, das ist doch Dreck alles,"}, {"id": 436, "start": 3270.28, "end": 3278.36, "text": "oder? Ich kauf mir keine USB, scheiß drauf. Lass es einfach, wie's ist. Und wenn's ausfällt,"}, {"id": 437, "start": 3278.36, "end": 3298.8, "text": "fällt's aus. Gibt doch hier eh kaum Stromausfälle. Naja, um den Preis, was ich erwarte? Naja,"}, {"id": 438, "start": 3298.8, "end": 3303.84, "text": "solange Strom aus der Leitung kommt, es weiterläuft. Das ist die billigste Art von USBs, weil die"}, {"id": 439, "start": 3303.84, "end": 3309.4, "text": "nur umschalten, wenn wirklich der Strom ausfällt. Warum sollte der Strom ausgehen, wenn es überhaupt"}, {"id": 440, "start": 3309.4, "end": 3319.12, "text": "nicht durch die Batterie läuft? Im RZ schaltet keiner seine USB aus beim Batteriewechsel."}, {"id": 441, "start": 3319.12, "end": 3324.56, "text": "Ah ja, du hast auch im Zweifelsfall zwei, aber das bei uns ein USB ausgeschaltet, um"}, {"id": 442, "start": 3324.56, "end": 3336.56, "text": "die Batterie zu wechseln, hab ich noch nie mitgekriegt. Schmutzdigger, genau. Ich will"}, {"id": 443, "start": 3336.56, "end": 3339.72, "text": "die Batterie nicht im laufenden Betrieb wechseln, auch wenn ich das die ganze Zeit sage. Mir"}, {"id": 444, "start": 3339.72, "end": 3345.4, "text": "geht's da drum, dass wenn die Batterie den Geist aufgibt durch Altersschwäche, dass"}, {"id": 445, "start": 3345.4, "end": 3349.6, "text": "es weiterläuft, solange Strom aus der Wand kommt. Ich hab keinen Bock, dass in drei Jahren"}, {"id": 446, "start": 3349.6, "end": 3354.64, "text": "wird da mein Rack verreckt, nicht weil der Strom ausfällt, sondern weil die USB im Arsch"}, {"id": 447, "start": 3354.64, "end": 3362.16, "text": "ist. Ey, es sind bei uns auch schon so viele bescheuerte Sachen passiert, weil Techniker"}, {"id": 448, "start": 3362.16, "end": 3367.4, "text": "nicht aufgepasst haben. Das eine Video hab ich euch ja mal erzählt, mit dem USB Stick,"}, {"id": 449, "start": 3367.4, "end": 3378.56, "text": "den sie in den Fahrstuhl geworfen haben, ausversehen durch den Schlitz. Naja, nee Leute, keine"}, {"id": 450, "start": 3378.56, "end": 3383.2, "text": "USB. Was hab ich denn hier noch im Bars getrennt? Theoretisch müssen wir endlich mal, die hab"}, {"id": 451, "start": 3383.2, "end": 3391.32, "text": "ich übrigens mittlerweile gekauft, die Wetterstation. Oh, Massive Ersparnis, Leute. Decreased von"}, {"id": 452, "start": 3391.32, "end": 3399.68, "text": "69,96 auf 58,57. Und da sagt mal einer, es wird alles teurer. Das ist der Gegenbeweis"}, {"id": 453, "start": 3399.68, "end": 3411.2, "text": "hier. Ja, dann ist gut, das wäre zum Beispiel was, warum ich hier wieder eine hinstellen"}, {"id": 454, "start": 3411.2, "end": 3415.64, "text": "würde. Die dürfen ruhig maulen, wenn die Batterie kaputt ist, aber das Rack soll nicht"}, {"id": 455, "start": 3415.64, "end": 3433.6, "text": "ausgehen. Hauptsache man kann sie muten. Hä? Ach so. Ich habe keine Ahnung, wie ich das"}, {"id": 456, "start": 3433.6, "end": 3459.0, "text": "geschafft hab. Taskbar Settings. So anscheinend. Nee, Colors. Custom. Anscheinend so, ich hab"}, {"id": 457, "start": 3459.0, "end": 3469.36, "text": "keinen Plan. Ach so, hier unten hab ich das abgehakt irgendwie. Custom Color ist doch"}, {"id": 458, "start": 3469.36, "end": 3481.52, "text": "nur. Ah nee, Window ist im Dark Mode, App ist im Light Mode. Alles klar. Was man da alles"}, {"id": 459, "start": 3481.52, "end": 3486.96, "text": "für widersprüchliche Dinger machen muss, dass Windows das macht, was man haben will."}, {"id": 460, "start": 3486.96, "end": 3494.2, "text": "Es gibt Wasserkocher, auf die du das Motor flashen kannst. Echt? Zeig Link, wo? Das wäre"}, {"id": 461, "start": 3494.2, "end": 3501.08, "text": "was für mich. Eton Flex. Nee, das ist keine USB, das ist einfach nur eine Stromleiste."}, {"id": 462, "start": 3501.08, "end": 3524.36, "text": "Das ist keine USB, oder? Ach doch. Welche davon? Die kleinste, hä? Welche davon? Die"}, {"id": 463, "start": 3524.36, "end": 3545.4, "text": "sind mir so kryptisch benannt. Den hier zum Beispiel. Okay, okay. Ach so, Moment. Profi..."}, {"id": 464, "start": 3545.4, "end": 3563.12, "text": "Nein. Profi Kuck. Hat nichts mit Jep Kuck zu tun. Profi Kuck. PC WKS 2-in-1 Tea-Water-Kettle."}, {"id": 465, "start": 3563.12, "end": 3569.12, "text": "Warum entsteht das bei mir eigentlich auf Deutsch? Und man kann allen Ernstes das Ding"}, {"id": 466, "start": 3569.12, "end": 3584.04, "text": "flaschen. Da ist ein ESP 2866 drin. Das ist ja mal ein Pog, Alter. Das brauche ich. Ein"}, {"id": 467, "start": 3584.04, "end": 3590.92, "text": "flashbarer Wasserkocher. Aber der hat nicht wirklich gute Bewertung, oder? Warum nicht?"}, {"id": 468, "start": 3590.92, "end": 3611.76, "text": "Alles irgendwelche Fake-Reviews. Das Teil funkt ausschließlich im 4,5 GHz Netz. Ja, okay,"}, {"id": 469, "start": 3611.76, "end": 3620.32, "text": "die Bewertungen sind wahrscheinlich schlecht, weil die App kacke ist. Und das umgehe ich"}, {"id": 470, "start": 3620.32, "end": 3631.52, "text": "ja komplett, weil ich die App nicht verwende. Aber die Sache ist halt die Chat, ihr habt"}, {"id": 471, "start": 3631.52, "end": 3638.4, "text": "recht. Du musst ja Wasser eh von Hand reinfüllen. Ich meine, du könntest abends Wasser reinfüllen"}, {"id": 472, "start": 3638.4, "end": 3647.08, "text": "und morgens dann einschalten. Das wäre zum Beispiel nicht schlecht. Du könntest es"}, {"id": 473, "start": 3647.08, "end": 3650.56, "text": "abends voll machen und morgens, wenn du dir Tee kochen willst, drückst, geht es dann"}, {"id": 474, "start": 3650.56, "end": 3659.8, "text": "schon an, wenn deine Heimautomatisierung erkennt. So krass verkalkt das über Nacht auch nicht."}, {"id": 475, "start": 3659.8, "end": 3665.64, "text": "Zumal selbst wenn da irgendwas drin wäre und sich vermehrt über Nacht, wenn du es kochst,"}, {"id": 476, "start": 3665.64, "end": 3681.84, "text": "ist es eh vorbei. Also, had to return. Warum? It turned on whilst being empty. Moment, das"}, {"id": 477, "start": 3681.84, "end": 3688.36, "text": "hat kein Check dagegen, ob da nicht Wasser, ob es leer ist. Also jeder normale ordentliche"}, {"id": 478, "start": 3688.36, "end": 3697.64, "text": "Wasserkocher hat ein Check drin, ob Wasser drin ist oder nicht. Aber wenn du es flaschen"}, {"id": 479, "start": 3697.64, "end": 3705.64, "text": "kannst, ist es ein China-Chinesen-Gerät, oder? Hersteller? ProfiCookStore. Ok, das könnte"}, {"id": 480, "start": 3705.64, "end": 3715.6, "text": "durchaus ein China-Chinesen Zeug sein vom Namen her. ProfiCook.de. Deutschlands Beste."}, {"id": 481, "start": 3715.6, "end": 3728.16, "text": "Das ist einfach nur re-branded oder so. Impressum. Ok, das ist anscheinend wirklich"}, {"id": 482, "start": 3728.16, "end": 3739.08, "text": "eine deutsche Firma, aber vielleicht ist es re-branded. Auf der anderen Seite, wenn es"}, {"id": 483, "start": 3739.08, "end": 3757.44, "text": "sogar bei Tasmota als ProfiCook drinne steht. So, die Frage ist, kann man den aktuell überhaupt"}, {"id": 484, "start": 3757.44, "end": 3765.96, "text": "noch flaschen? Guck mal AliExpress, da muss ich aber nicht nach ProfiCook suchen, sondern"}, {"id": 485, "start": 3765.96, "end": 3776.24, "text": "nach was soll ich denn suchen auf AliExpress? It's 2 in 1 Tea & Water Kettle. Wieder was"}, {"id": 486, "start": 3776.24, "end": 3781.52, "text": "gelernt, weil ich wusste gar nicht, dass es Kettle heißt. Aber heute haben wir keine Hose"}, {"id": 487, "start": 3781.52, "end": 3786.36, "text": "zu ficken. Also wenn ich dabei war und ich frage, was labert da, Max? Letztes Mal Vorschlag"}, {"id": 488, "start": 3786.36, "end": 3793.4, "text": "bei AliExpress war, nach was ich suchen soll, Hose für Ficken. Autovervollständigung. Als"}, {"id": 489, "start": 3793.4, "end": 3816.76, "text": "ich die Seite das erste Mal geladen habe. Genau, da gibts. Guck mal, es gibt sogar"}, {"id": 490, "start": 3816.76, "end": 3830.6, "text": "eine Xiaomi-Mijia-Dinger, bestimmt Zigbee Übertragung. Also die Dinger sehen eindeutig"}, {"id": 491, "start": 3830.6, "end": 3837.96, "text": "zu futuristisch aus, dass sie gescheit funktionieren. Ah ja, der ist bestimmt, also Leute, ich glaube,"}, {"id": 492, "start": 3837.96, "end": 3844.4, "text": "den bestelle ich, den 5,99€ China-Chinesen Wasserkocher. Der ist bestimmt genau das"}, {"id": 493, "start": 3844.4, "end": 3858.2, "text": "Richtige. Der hat bestimmt auch alle Prüfzeichen, die sind bestimmt auch alle echt. Es ist anscheinend"}, {"id": 494, "start": 3858.2, "end": 3875.16, "text": "nicht Reprinted, ich sehe hier keinen. Moment. Der sieht dem doch, nee. Anderer. Das Motor."}, {"id": 495, "start": 3875.16, "end": 3888.96, "text": "Nee. Okay, und den kann man wirklich flashen, ja? Das muss ich jetzt gleich mal. Ich mein,"}, {"id": 496, "start": 3888.96, "end": 3893.68, "text": "es spricht auch für, dass es kaum andere Geräte gibt, die exakt genauso aussehen."}, {"id": 497, "start": 3893.68, "end": 3905.32, "text": "Okay, das muss ich jetzt gleich mal checken. Erstmal muss ich die Musik wieder anmachen."}, {"id": 498, "start": 3905.32, "end": 3916.88, "text": "Ja, komm. Wo sind wir stehen geblieben hier? Das kann man jetzt wirklich flashen, oder?"}, {"id": 499, "start": 3916.88, "end": 3931.2, "text": "Das muss ich jetzt mal in den Kommentaren gucken. Das Motor. Das Motor. Ah, November 2022. Ob"}, {"id": 500, "start": 3931.2, "end": 3957.0, "text": "sich das eineinhalb Jahre jetzt noch flashen lässt? Flash. Schwer zu sagen. Vielleicht"}, {"id": 501, "start": 3957.0, "end": 3970.04, "text": "lässt sich das auch nicht mehr flashen. Hm. Ich weiß nicht, ob ich das auf gut Glück"}, {"id": 502, "start": 3970.04, "end": 3984.84, "text": "kaufen soll, Leute. Eigentlich ist es zu teuer für so was Unsinniges. 60€. Aber wenn das"}, {"id": 503, "start": 3984.84, "end": 3995.56, "text": "Ding, Leute, das muss ein China-Chinesen-Produkt sein. Okay, China. Heißt das wirklich Waterkette?"}, {"id": 504, "start": 3995.56, "end": 4012.84, "text": "Wi-Fi. AliExpress. Das muss ein Reprint sein. Wenn es kein Reprint ist, dann wäre das doch"}, {"id": 505, "start": 4012.84, "end": 4024.8, "text": "kein Tuya Zeug. Dann hätten die ein ordentliches Webinterface gemacht oder so. Da stand Warning"}, {"id": 506, "start": 4024.8, "end": 4033.04, "text": "wegen Wi-Fi. Was? Ja, das steht bei allen Tuya Sachen. Ich weiß, ich weiß. Aber vielleicht"}, {"id": 507, "start": 4033.04, "end": 4052.92, "text": "ist es ja tatsächlich in dem Fall auch so. Das sieht erst mal relativ ähnlich. Hier,"}, {"id": 508, "start": 4052.92, "end": 4065.68, "text": "da ist er. Das ist er doch, oder? Das sieht sehr ähnlich aus, das Ding. Die Basis ist"}, {"id": 509, "start": 4065.68, "end": 4083.52, "text": "ein bisschen anders. Die Basis ist ein bisschen anders. Aber guck mal. Mobile. Hä? Das sieht"}, {"id": 510, "start": 4083.52, "end": 4089.36, "text": "da wieder komplett anders aus. Aber das da hinten? Wieso willst du das Ding flashen?"}, {"id": 511, "start": 4089.36, "end": 4098.56, "text": "Naja, weil ich alles flashe, was flashbar ist. Nee, das sieht tatsächlich anders aus."}, {"id": 512, "start": 4098.56, "end": 4120.8, "text": "Der Profi Kok. Der Griff ist auch ganz anders. Ja, da finde ich das passende China-Chinesen-Produkt"}, {"id": 513, "start": 4120.8, "end": 4128.96, "text": "nicht. Ich verstehe den Sinn auch nicht. Deswegen werde ich es mir wahrscheinlich nicht kaufen."}, {"id": 514, "start": 4128.96, "end": 4132.88, "text": "Der Sinn erschließt sich mir nämlich wirklich nicht. Das Einzige, was mir einfällt, ist,"}, {"id": 515, "start": 4132.88, "end": 4136.36, "text": "man könnte abends Wasser reinmachen und es dann morgen kochen lassen, wenn man ins Bad"}, {"id": 516, "start": 4136.36, "end": 4146.76, "text": "geht oder so. Aber naja. Das könnte man auch anders mit einer Wi-Fi-schaltbaren Steckdose"}, {"id": 517, "start": 4146.76, "end": 4158.48, "text": "könnte man das genauso machen. Ich glaube, ich werde das nicht kaufen. Okay, welche davon"}, {"id": 518, "start": 4158.48, "end": 4164.48, "text": "sollte ich mir denn jetzt angucken, dass ich weiß, wie das preislich liegt? Doch, ich"}, {"id": 519, "start": 4164.48, "end": 4170.48, "text": "brauche einen Wasserkocher. Ich wollte mir eigentlich den Wasserkocher hier holen, weil"}, {"id": 520, "start": 4170.48, "end": 4177.16, "text": "ich habe quasi den davor und der hat jetzt irgendwie 13 Jahre gehalten oder so. Nee,"}, {"id": 521, "start": 4177.16, "end": 4186.76, "text": "11. Nee, 9. 2013 habe ich den gekauft. Temperatur einstellen wäre auch sinnvoll. Na gut, das"}, {"id": 522, "start": 4186.76, "end": 4194.28, "text": "heißt Wasserkocher, weil man da mit Wasser kocht. Und Wasser kochen geht halt nur mit,"}, {"id": 523, "start": 4194.28, "end": 4203.16, "text": "also was brauchst du da Temperatur? Aber ja, das andere wäre ein Wasserkocher-Schrägstrich-Erwärmer,"}, {"id": 524, "start": 4203.16, "end": 4216.16, "text": "dann wäre das mit Temperatur sinnvoll. Mit dem Switchpot den Wasserhahn. Genau, ein Schlauch"}, {"id": 525, "start": 4216.16, "end": 4226.32, "text": "am Wasserhahn und dann mit dem Switchpot den Wasserhahn schalten. Exzellent. Das machen"}, {"id": 526, "start": 4226.32, "end": 4231.96, "text": "wir in der Chain-Lore. Kann ich das anklicken? Ich wusste mir das gerade mal. Bin ich mir"}, {"id": 527, "start": 4231.96, "end": 4236.24, "text": "bei dir immer nicht so sicher. Ich gucke mal auf dem zweiten Bildschirm, ob man sich"}, {"id": 528, "start": 4236.24, "end": 4246.68, "text": "das anschauen kann. Ah ja, okay, das ist safe. PokiW-Virgin-Check, I'm safe. Manchmal kommen"}, {"id": 529, "start": 4246.68, "end": 4252.28, "text": "mir unsinnigerweise solche dämlichen Copypasta in den Kopf. Ich weiß nicht warum. Ich habe"}, {"id": 530, "start": 4252.28, "end": 4264.0, "text": "heute auf der Arbeit Fivehead gesagt. Einfach so, Fivehead. Also sowas macht ihr in der"}, {"id": 531, "start": 4264.0, "end": 4269.32, "text": "11. Klasse. Ist das ein Bild von euch aus dem Klassenraum? Nee, oder? Das ist bei dir"}, {"id": 532, "start": 4269.32, "end": 4273.0, "text": "aus dem Zimmer. Wobei, nee, das ist aus dem Klassenraum. Da ist ein Arm von irgendeinem"}, {"id": 533, "start": 4273.0, "end": 4282.12, "text": "anderen Dude. Okay, sowas macht ihr da mit dem guten allen Strukturizer 3.28-10 Krankenhaus."}, {"id": 534, "start": 4282.12, "end": 4291.84, "text": "Krankenhaus? Und neben dran den Windows-Taschenrechner. Ich weiß ja nicht, ich weiß ja nicht was"}, {"id": 535, "start": 4291.84, "end": 4300.16, "text": "ich schlimmer finde. Die Kombination aus Oldest School, Anwendung plus UWP oder dass es Strukturgramme"}, {"id": 536, "start": 4300.16, "end": 4315.52, "text": "sind. Aber du hast deine Leiste und so schon mal im Dark Mode, das ist schon mal gut. By"}, {"id": 537, "start": 4315.52, "end": 4326.44, "text": "the way, Chain-Lore. Wie alt ist denn euer Windows? Weil das ist der Calculator vom vorletzten"}, {"id": 538, "start": 4326.44, "end": 4331.92, "text": "Feature-Update. Der aktuelle Calculator sieht so aus, auch in der Taskleiste. Das ist bestimmt"}, {"id": 539, "start": 4331.92, "end": 4337.32, "text": "noch LTS oder so von vor drei Jahren. Die machen kein Update. Genauso sieht das auch"}, {"id": 540, "start": 4337.32, "end": 4351.84, "text": "aus. Das wundert mich nicht. Hast du eine Smartwatch? Hab ich nicht. Kannst du dich aussprechen."}, {"id": 541, "start": 4351.84, "end": 4359.32, "text": "Smartwatch. Okay, was macht ihr denn da, schönes Chain-Lore? Zeigt mal hier. Krankenhaus."}, {"id": 542, "start": 4359.32, "end": 4366.24, "text": "Aufenthaltsdauer, Versicherungsart, Pflegeart. Okay, okay, ich geh mal in mich. Strukturgramm."}, {"id": 543, "start": 4366.24, "end": 4373.16, "text": "Das hier sind so die Parameter, die man übergibt. In dem Fall halt. Okay, Kommandozeilen, Eingabe."}, {"id": 544, "start": 4373.16, "end": 4387.48, "text": "Grundbetrag gleich 200 Euro. Versicherungsart, TF. Wie? Was ist T und F? Gesetzlich oder"}, {"id": 545, "start": 4387.48, "end": 4397.16, "text": "privat oder? Ne. Ach, True, False. Wie kann eine Versicherungsart True oder False sein?"}, {"id": 546, "start": 4397.16, "end": 4410.96, "text": "Wie? Hä? Okay, hat eine Versicherung oder hat keine, hat keine Versich... Okay, versichert."}, {"id": 547, "start": 4410.96, "end": 4428.96, "text": "Versichert sollte das eigentlich bedeuten. Versichert, Fragezeichen. Ja, nein. Zuschlag."}, {"id": 548, "start": 4428.96, "end": 4433.56, "text": "Warum muss man, warum muss man unversichert mehr bezahlen? Den Zuschlag gibt es doch"}, {"id": 549, "start": 4433.56, "end": 4440.28, "text": "sonst auch, oder? Oder na gut, das sind quasi Selbstzahler. Selbstzahler, wenn immer krasser"}, {"id": 550, "start": 4440.28, "end": 4447.6, "text": "zur Kasse gebeten, ja. Wobei das, wobei das so ohne weiteres gar nicht zulässig ist,"}, {"id": 551, "start": 4447.6, "end": 4451.36, "text": "du musst das, du musst das nach, äh, Dings hier Ärzte Gebührenordnung abrechnen und"}, {"id": 552, "start": 4451.36, "end": 4454.68, "text": "einfach random Zuschläge verteilen, bin ich mir nicht so sicher. Egal, das ist ja nur"}, {"id": 553, "start": 4454.68, "end": 4462.04, "text": "eine Aufgabe, das hat ja mit der Realität nichts zu tun. Also, ähm, Unterbringung,"}, {"id": 554, "start": 4462.04, "end": 4471.16, "text": "Verpflegungsart True, False. Ich wusste gar nicht, dass Verpflegungsart auch True oder"}, {"id": 555, "start": 4471.16, "end": 4483.96, "text": "False sein kann. Dieses Struktogramm ist einfach mal so krass useless. Warum macht man sowas?"}, {"id": 556, "start": 4483.96, "end": 4508.76, "text": "Kein Plan soll fast lernen, ja. Was auch immer, man da ist großartig lernt bei. Okay, okay,"}, {"id": 557, "start": 4508.76, "end": 4519.08, "text": "wie sie? Fy-FyFat. Oh, ich muss ja merken, wo ich war. Okay, wie sie? Erklär mir als"}, {"id": 558, "start": 4519.08, "end": 4527.8, "text": "super FyFat Entwickler, wie kann Verpflegungsart True oder False sein? Das will ich jetzt"}, {"id": 559, "start": 4527.8, "end": 4545.08, "text": "wissen. Was ist ein Verpflegungsart True oder False? Wenn du nur ein, ich hab keine Ahnung."}, {"id": 560, "start": 4545.08, "end": 4552.56, "text": "False gleich verhungern. Ist das, ist das du bekommst Essen oder nicht? Dann, dann muss"}, {"id": 561, "start": 4552.56, "end": 4562.08, "text": "man das doch einfach nur Verpflegung Fragezeichen nennt, nicht Verpflegungsart. Aber das ist"}, {"id": 562, "start": 4562.08, "end": 4588.88, "text": "komplett useless, dieses Diagramm. Was soll einem das jetzt bringen? Also ich mein, anhand"}, {"id": 563, "start": 4588.88, "end": 4593.84, "text": "dessen könntest du immer noch nichts programmieren, weil du nicht mal weißt, wie du Eingabe machst."}, {"id": 564, "start": 4593.84, "end": 4603.6, "text": "Aber gut, was auch immer, ich finde es bedenklich, dass ihr Struktogramme macht. Sogar der,"}, {"id": 565, "start": 4603.6, "end": 4609.36, "text": "hast du 15 von 15 bekommen, dann ist ja pock, dann ist ja alles gut. Sogar der Struktogramm-Erfinder"}, {"id": 566, "start": 4609.36, "end": 4614.16, "text": "hat ein paar Jahre später gesagt, dass Struktogramme nicht so der Weisheit letzter Schluss sind."}, {"id": 567, "start": 4614.16, "end": 4625.44, "text": "Wenn es der Struktogramm-Erfinder sagt. Oje, schreib das mal nicht auf Twitter. Wenn du"}, {"id": 568, "start": 4625.44, "end": 4650.6, "text": "das auf Twitter schreibst, dann ist es richtig, dann ist es regert. Canceled. Früher, vor"}, {"id": 569, "start": 4650.6, "end": 4657.24, "text": "noch nicht allzu langer Zeit hättest du wahrscheinlich irgendwelche Konstanten so definieren können."}, {"id": 570, "start": 4657.24, "end": 4667.48, "text": "Aber heutzutage würde ich das lieber sein lassen. Egal, gut, dass du 15 Punkte bekommen"}, {"id": 571, "start": 4667.48, "end": 4673.12, "text": "hast, Chainlord, pock. Was passiert eigentlich, wenn man da auf Debug klickt? Geht da dann"}, {"id": 572, "start": 4673.12, "end": 4680.56, "text": "die einzelnen Punkte durch oder so? Ich hab den Strukturizer schon 15 Jahre oder so nicht"}, {"id": 573, "start": 4680.56, "end": 4687.24, "text": "mehr verwendet. Ich kenn mich da nicht mehr so aus. Der Strukturizer, so ein Blödsinn."}, {"id": 574, "start": 4687.24, "end": 4698.8, "text": "Aber der Taschenrechner ist am Start. Na gut, ich mein, kann man ja auch nicht erwarten,"}, {"id": 575, "start": 4698.8, "end": 4709.08, "text": "dass man das im Kopf rechnen kann. Das ist eindeutig zu schwer. 200 plus 100 plus 100"}, {"id": 576, "start": 4709.08, "end": 4717.88, "text": "und dann vielleicht noch plus 7. Ok, mal auf den Hals Dauer wird es tatsächlich dann"}, {"id": 577, "start": 4717.88, "end": 4723.4, "text": "schon ein bisschen schwieriger. Ok, das verstehe ich, das verstehe ich. Ja, alles klar. Also"}, {"id": 578, "start": 4723.4, "end": 4739.56, "text": "wenn man das ganze mal 37 rechnen soll oder so, dann ja. Wirklich? Ich Strukturizer, ist"}, {"id": 579, "start": 4739.56, "end": 4747.12, "text": "das Java? Ich mein, das sieht so hässlich aus. Das könnte tatsächlich Java sein. Wahrscheinlich"}, {"id": 580, "start": 4747.12, "end": 4758.04, "text": "irgendwie, das ist doch nicht mal Swing. Was gab es denn vor Swing? Noch älter. Strukturizer,"}, {"id": 581, "start": 4758.04, "end": 4774.64, "text": "GitHub. AWT, stimmt. Strukturizer. Fischl, der ist es. Da gibt es gar keinen Sourcecode"}, {"id": 582, "start": 4774.64, "end": 4784.12, "text": "dazu. Der Strukturizer ist nicht Open Source, Anzeige. Wobei man kann keinen Anzeigen dafür,"}, {"id": 583, "start": 4784.12, "end": 4787.88, "text": "dass er nicht Open Source ist. Das wäre doch mal was, oder? Einfach gleich verklagen, wer"}, {"id": 584, "start": 4787.88, "end": 4808.0, "text": "nicht Open Source ist. Opening when complete. Ja, auf. Komm, es ist complete. Source? Trau"}, {"id": 585, "start": 4808.0, "end": 4828.72, "text": "ich es, mich aufzumachen. Wo ist mein VS Code? Hallo? Wozu? Wo ist es hin? Da ist es doch."}, {"id": 586, "start": 4828.72, "end": 4845.64, "text": "Kann man das Track und Dropen? Nee, oder? Nee. Okay, okay. Trick 17. Notepad öffnen,"}, {"id": 587, "start": 4845.64, "end": 4858.76, "text": "neues File machen, einfügen und dann umstellen auf Java. Alter, was ein Ding. Wird immer noch"}, {"id": 588, "start": 4858.76, "end": 4863.44, "text": "regelmäßig updated. Okay Leute, erkennt man Java Experten? Erkennt man, was das für"}, {"id": 589, "start": 4863.44, "end": 4870.84, "text": "eine GUI Library ist, irgendwo ran? Main, der muss ja irgendwo das Fenster starten jetzt."}, {"id": 590, "start": 4870.84, "end": 4877.96, "text": "Command Line Arguments. Der passt ganz viele. Sag mal, da gibt es noch einen Command Line"}, {"id": 591, "start": 4877.96, "end": 4891.68, "text": "Parser, oder? What the fuck? UI Manager, set look and feel. UI Manager, get. Okay, das"}, {"id": 592, "start": 4891.68, "end": 4901.64, "text": "ist, das ist. Können wir gucken, was das Java ist. UI Manager. Swing, Swing ist es. Alles"}, {"id": 593, "start": 4901.64, "end": 4908.2, "text": "klar, okay. Und ganz schnell, ganz schnell wieder weg. No. Nicht, nicht saven. Gut, wissen"}, {"id": 594, "start": 4908.2, "end": 4914.56, "text": "wir Bescheid. Swing. Aber eins muss man mal sagen, ich meine, der Kram funktioniert."}, {"id": 595, "start": 4914.56, "end": 4918.76, "text": "Man kann sich da jetzt noch so viel drüber lustig machen, ja. Der hat was entwickelt,"}, {"id": 596, "start": 4918.76, "end": 4926.28, "text": "was wahrscheinlich schon mehr Leuten geholfen hat, als viele andere. So gut wie jeder in"}, {"id": 597, "start": 4926.28, "end": 4932.8, "text": "der Berufsschule oder jeder Informatiker oder Fachinformatiker oder sei es nur IT Klasse"}, {"id": 598, "start": 4932.8, "end": 4945.8, "text": "in der Schule benutzt irgendwann mal den Strukturizer. Wo kommt das neue Pepega Board? Wurde die"}, {"id": 599, "start": 4945.8, "end": 4953.08, "text": "Entwicklung getroppt? Naja, das tun für mich das Pepega Board. Für alle anderen muss"}, {"id": 600, "start": 4953.08, "end": 4960.48, "text": "das nicht tun, zumal das Pepega Board einige Ungereimtheiten hat. Man könnte auch sagen,"}, {"id": 601, "start": 4960.48, "end": 4965.04, "text": "Bugs, die es manchmal crashen lassen, wenn ich neue Bilder hinzufüge und es nicht in"}, {"id": 602, "start": 4965.04, "end": 4987.88, "text": "der richtigen Reihenfolge anklicke. Kannst du Weird Champing abspielen? Ja. Ups. Ja."}, {"id": 603, "start": 4987.88, "end": 5009.84, "text": "Weird Champing. Und hinterher eine Runde Gachirole. So, gut. Wir haben Strukturkram tatsächlich"}, {"id": 604, "start": 5009.84, "end": 5015.8, "text": "teilweise noch von Hand gezeichnet. Und das war in der Berufsschule 2007 oder so herum."}, {"id": 605, "start": 5015.8, "end": 5024.52, "text": "Also das ist doch gar nicht so lange her. Nicht so, dass es letztes Jahr 1000 war. 2007"}, {"id": 606, "start": 5024.52, "end": 5028.36, "text": "ist jetzt auch schon ein bisschen her, aber es ist wie gesagt nicht letztes Jahr 1000"}, {"id": 607, "start": 5028.36, "end": 5039.52, "text": "oder 1990 oder so. Von Handzeichen ist wahrscheinlich einfacher. Ich glaube die Software ist gar"}, {"id": 608, "start": 5039.52, "end": 5045.84, "text": "nicht so kacke. Für das, was es sein soll, ist doch gut. Weil da hat sich hingesetzt"}, {"id": 609, "start": 5045.84, "end": 5061.64, "text": "einfach Sinnvolles entwickelt. Passt doch. Ja, ich hab mal eine neue, ich hab mit FFm"}, {"id": 610, "start": 5061.64, "end": 5069.92, "text": "verpackt und der Renderer könnte tatsächlich DirectX gewesen sein, die Bilder ins Fenster"}, {"id": 611, "start": 5069.92, "end": 5079.96, "text": "rendern. Ja, das hab ich mal angefangen, dass solche Bilder wie das hier, guck, weil"}, {"id": 612, "start": 5079.96, "end": 5088.56, "text": "WPF ist richtig lahm. WPF ist richtig lahm bei sowas hier, guck. Bei manchen GIFs, die"}, {"id": 613, "start": 5088.56, "end": 5093.68, "text": "etwas bessere Auflösung haben und mehr FPS. Ich hab jetzt schon längst geklickt und es"}, {"id": 614, "start": 5093.68, "end": 5101.08, "text": "kommt immer noch nichts. Guck, das ist richtig, richtig lahm. Und das hab ich gerendert mit"}, {"id": 615, "start": 5101.08, "end": 5109.16, "text": "FFm pack und das war instant da. FFm pack ist richtig massive Pog. Ja, FFm pack ist"}, {"id": 616, "start": 5109.16, "end": 5116.28, "text": "das beste oder eines der besten. Übrigens, Chat, wo wir gerade dabei sind. Ganz kurz,"}, {"id": 617, "start": 5116.28, "end": 5126.44, "text": "zwei Minuten. Ich weiß, dass nicht alle dabei waren. Ich habe rausbekommen, woran das mit"}, {"id": 618, "start": 5126.44, "end": 5130.52, "text": "dem Filename lag. Erinnert ihr euch noch dran, dass wir gestern versucht haben, was zu programmieren?"}, {"id": 619, "start": 5130.52, "end": 5139.56, "text": "Wo ich auf meine Router-API zugreifen wollte. Ich habe rausbekommen, woran es lag. Passt"}, {"id": 620, "start": 5139.56, "end": 5145.6, "text": "mal auf. Wie gesagt, zwei Minuten. Wenn ich dabei war, wird es jetzt nicht checken. Ich"}, {"id": 621, "start": 5145.6, "end": 5149.84, "text": "zeige euch, woran es gelegen hat. Die eine Stelle, woran es gelegen hat, zeige ich euch."}, {"id": 622, "start": 5149.84, "end": 5166.72, "text": "So, auf, geh an. Und zwar, es war die Reihenfolge. Es muss sein, Name gleich u und die.NET Library"}, {"id": 623, "start": 5166.72, "end": 5175.92, "text": "hat geschrieben, Filename gleich. Und danach, also das hier und das hier war vertauscht."}, {"id": 624, "start": 5175.92, "end": 5182.32, "text": "Ihr habt es glaube ich gesehen. Die Reihenfolge ist das Problem gewesen. Korrekt. Also sprich,"}, {"id": 625, "start": 5182.32, "end": 5186.76, "text": "das hier und das hier muss vertauscht werden. Wobei das vertauscht in der Klasse nicht getan"}, {"id": 626, "start": 5186.76, "end": 5197.04, "text": "hat logischerweise. Ich musste wirklich das von Hand String interpolate die Message. Dann"}, {"id": 627, "start": 5197.04, "end": 5202.88, "text": "hat es funktioniert. Habe ich ausprobiert. Also die Reihenfolge ist entscheidend. Ich"}, {"id": 628, "start": 5202.88, "end": 5210.68, "text": "gehe davon aus, dass das nicht standardkonform ist. Ne, ich mache jetzt mal mein Tool fertig."}, {"id": 629, "start": 5210.68, "end": 5216.24, "text": "Also ich will zumindest über Kommandozeile WLANs auflisten können, User auflisten können"}, {"id": 630, "start": 5216.24, "end": 5222.64, "text": "und neue User anlegen. Dann verwende ich den, ja. Aber das ist garantiert nicht standardkonform,"}, {"id": 631, "start": 5222.64, "end": 5227.92, "text": "weil ich, also ich habe ihn nicht gelesen, aber ich gehe ganz stark davon aus, im Standard"}, {"id": 632, "start": 5227.92, "end": 5232.28, "text": "steht die Reihenfolge, der Felder ist egal, weil die Library generiert nicht ohne Grund"}, {"id": 633, "start": 5232.28, "end": 5238.56, "text": "das so. Ich meine, das ist der offizielle unter der Haube, der offizielle HTTP-Klein"}, {"id": 634, "start": 5238.56, "end": 5249.6, "text": "von.NET. Dass der nicht standardkonforme Formrequest macht, glaube ich nicht. Ich"}, {"id": 635, "start": 5249.6, "end": 5254.2, "text": "muss jetzt mal, ich mache jetzt mal wieder Chat, ja. Du schreibst hier Nutzerartstilung"}, {"id": 636, "start": 5254.2, "end": 5258.44, "text": "Spider-Man mit Gnome. Jetzt müsste ich dich fragen, warum nicht Manjaro? Warum nicht"}, {"id": 637, "start": 5258.44, "end": 5265.44, "text": "Endeavor OS? Das ist immer so die Standardfrage vom Chat. Ich sage irgendwas, so nach dem"}, {"id": 638, "start": 5265.44, "end": 5269.2, "text": "Motto, ja wir gucken uns das jetzt mal an, da kommt der Chat um die Ecke. Ja, warum nicht"}, {"id": 639, "start": 5269.2, "end": 5277.64, "text": "mit was anderem? Warum nicht so? Warum machst du es so? Warum nicht anders? Ich muss das"}, {"id": 640, "start": 5277.64, "end": 5285.72, "text": "auch mal machen öfters. Warum nicht Windows? Die Antwort ist ganz einfach, Windows ist"}, {"id": 641, "start": 5285.72, "end": 5290.72, "text": "immer Painschamp, egal was du machst. Gibt es irgendwas, was unter Windows nicht Painschamp"}, {"id": 642, "start": 5290.72, "end": 5295.92, "text": "ist? Ich meine, du kannst unter Windows spielen, ja. Das ist aber auch Painschamp. Das einzige,"}, {"id": 643, "start": 5295.92, "end": 5300.12, "text": "warum das die Leute machen ist, weil es die einzige Plattform ist, wo du wirklich sicher"}, {"id": 644, "start": 5300.12, "end": 5306.6, "text": "sein kannst, dass alle Games laufen. Also Konsole außen vor, aber da geht es ja nicht"}, {"id": 645, "start": 5306.6, "end": 5326.24, "text": "rum. Windows halt. Windows ist immer Painschamp. Selbst Windows unter Windows ist schwierig."}, {"id": 646, "start": 5326.24, "end": 5331.52, "text": "Windows, es ist alles schwierig unter Windows. Wo bin ich denn stehen geblieben, Freund?"}, {"id": 647, "start": 5331.52, "end": 5338.08, "text": "Ich habe bestimmt noch irgendwas übersehen, warte mal. Easy Ausbildung. Ich habe nichts"}, {"id": 648, "start": 5338.08, "end": 5349.04, "text": "übersehen, oder? Nix. Na ja gut, mal einmal refreshen, vielleicht hat YouTube noch ein"}, {"id": 649, "start": 5349.04, "end": 5354.48, "text": "schönes Video, was wir uns jetzt heute zum Einschlafen angucken können. Introducing"}, {"id": 650, "start": 5354.48, "end": 5362.08, "text": "Avandos Pro. Nein, ich weiß nicht, was es ist. Ich will es wahrscheinlich auch nicht"}, {"id": 651, "start": 5362.08, "end": 5386.2, "text": "wissen. Keine Ahnung, will man nicht, will man nicht haben. Kennst du den Java Editor?"}, {"id": 652, "start": 5386.2, "end": 5390.48, "text": "Also wenn ich einen Java Editor suche, finde ich wahrscheinlich 1000 Sachen, oder? Ach"}, {"id": 653, "start": 5390.48, "end": 5399.68, "text": "Moment, das heißt wirklich so. Ach du Scheiße, das ist noch aktuell. Hallo? Guck mal, die"}, {"id": 654, "start": 5399.68, "end": 5416.0, "text": "Seite ist sogar down, Leute, die Seite geht nicht mal auf. Ach du Scheiße. Ach du Kruse."}, {"id": 655, "start": 5416.0, "end": 5433.96, "text": "Das ist ja Monka Shake, Alter. Das wollte ich gar nicht drücken. Das sieht aus wie"}, {"id": 656, "start": 5433.96, "end": 5438.4, "text": "Software, die man in der Berufsschule verwendet, ja. Man verwendet das in der Berufsschule,"}, {"id": 657, "start": 5438.4, "end": 5465.96, "text": "weil die Berufsschule vor 30 Jahren mal Lizenzen dafür gekauft hat. Na gut, nicht so feifett."}, {"id": 658, "start": 5465.96, "end": 5475.68, "text": "Ach ja, was macht New World? Abkacken, was macht Battlefield? Noch mehr abkacken, Alter."}, {"id": 659, "start": 5475.68, "end": 5504.6, "text": "Easy, bald Race to Null Players ist eröffnet. So schlecht. Ja, das kenne ich auch noch,"}, {"id": 660, "start": 5504.6, "end": 5516.16, "text": "das Ding. Es hat mich immer noch irritiert, das ernsthaft, was Bloodshed heißt. Kann"}, {"id": 661, "start": 5516.16, "end": 5526.6, "text": "die denn Modern C++, um die Sache noch schlimmer zu machen? Modern C++, die Sprache, die zum"}, {"id": 662, "start": 5526.6, "end": 5533.32, "text": "größten Teil aus Klammern in dieser Richtung hier besteht. Wahrscheinlich ist das, Leute,"}, {"id": 663, "start": 5533.32, "end": 5544.32, "text": "meint ihr, das ist Welle C++ Syntax? Ich gehe davon aus. Ich denke, das geht. Und im Zweifelsfall,"}, {"id": 664, "start": 5544.32, "end": 5548.2, "text": "wenn es nicht geht, ist die Fehlermeldung 40 Zeilen lang und man versteht nicht, was"}, {"id": 665, "start": 5548.2, "end": 5555.04, "text": "die Fehlermeldung einem sagen soll. Testen wir doch mal. Es gibt doch so einen Online"}, {"id": 666, "start": 5555.04, "end": 5573.76, "text": "C++ Compiler. Ist das da? Nee, das meine ich nicht. Ist das gültiges C++ Run? Moment."}, {"id": 667, "start": 5573.76, "end": 5580.92, "text": "Ist das wirklich halbwegs hilfreiche Compiler-Fehlermeldung? Sehe ich das gerade richtig? Ich meine, dass"}, {"id": 668, "start": 5580.92, "end": 5585.32, "text": "er das 580 mal schreibt, ist vielleicht nicht so sinnvoll, aber das kann nicht sein. Das"}, {"id": 669, "start": 5585.32, "end": 5600.4, "text": "ist Fake C++. Ist die Scharpe in Whistle Studio oder in Whistle Studio oder Codebesser zu"}, {"id": 670, "start": 5600.4, "end": 5606.68, "text": "programmieren? Eindeutig. Eindeutig in Whistle Studio. Oder aber gar nichts davon und Ryder."}, {"id": 671, "start": 5606.68, "end": 5613.96, "text": "Ryder ist mein persönlicher Favorit, aber Ryder ist halt offiziell nicht kostenlos,"}, {"id": 672, "start": 5613.96, "end": 5622.0, "text": "es sei denn, du bist Student oder Schüler und du hast die Trial ausgenutzt. 30 Tage"}, {"id": 673, "start": 5622.0, "end": 5629.28, "text": "kannst du es kostenlos verwenden. Na sehr teuer ist es nicht. Ich finde Ryder ist tatsächlich"}, {"id": 674, "start": 5629.28, "end": 5640.8, "text": "relativ angemessen. Also ich habe das JetBrains All Products Pack. Ich will alles. Ja. Und"}, {"id": 675, "start": 5640.8, "end": 5646.84, "text": "das kostet für Privatpersonen nicht so viel wie da steht. Für persönliche Nutzung. Guck"}, {"id": 676, "start": 5646.84, "end": 5654.0, "text": "mal. All Products Pack 250 Euro im Jahr und ab dem dritten Jahr, das müsste ich mittlerweile"}, {"id": 677, "start": 5654.0, "end": 5663.96, "text": "eigentlich schon haben, kostet es dann quasi irgendwie nur noch 100, 170 oder so. Das kann"}, {"id": 678, "start": 5663.96, "end": 5673.24, "text": "man schon machen. Ich finde das ist gar nicht so teuer. Also wenn man das regelmäßig benutzt."}, {"id": 679, "start": 5673.24, "end": 5679.2, "text": "Ich mein, wenn man Schüler ist, würde ich es nicht unbedingt machen, aber wenn man das"}, {"id": 680, "start": 5679.2, "end": 5684.08, "text": "unter anderem dafür benutzt, womit man dann sein Geld verdient, ist das eigentlich gar"}, {"id": 681, "start": 5684.08, "end": 5693.52, "text": "keine Frage. Also vollkommen in Ordnung. Oder ihr lasst es euren Chef für euch kaufen."}, {"id": 682, "start": 5693.52, "end": 5703.6, "text": "Ritual Studio ist vollkommen in Ordnung. Ja, kann man auch benutzen. Ich habe auch jahrelang"}, {"id": 683, "start": 5703.6, "end": 5709.56, "text": "Ritual Studio verwendet, aber seit ich seit.net Core im Endeffekt seit.net Core halbwegs sinnvoll"}, {"id": 684, "start": 5709.56, "end": 5716.44, "text": "Cross Plattform ist, also seit 2.1 oder so oder 2.0 und auch alle notwendigen Klassen"}, {"id": 685, "start": 5716.44, "end": 5721.76, "text": "hatte, ich glaube, es war so seit 2.0 2.1, bin ich ja komplett auf Linux als Entwicklungsplattform"}, {"id": 686, "start": 5721.76, "end": 5726.36, "text": "umgestiegen und seitdem verwende ich nur noch Rider und ich komme damit echt gut klar."}, {"id": 687, "start": 5726.36, "end": 5733.8, "text": "Also ich kann das eigentlich nur empfehlen. Natürlich, wenn man das hobbymäßig verwendet"}, {"id": 688, "start": 5733.8, "end": 5739.16, "text": "und Schüler ist und kein Geld hat, dann nicht, dann Ritual Studio. Aber Ritual Studio Code"}, {"id": 689, "start": 5739.16, "end": 5744.68, "text": "würde ich nicht verwenden für C Sharp, weil das ist in Ritual Studio deutlich angenehmer."}, {"id": 690, "start": 5744.68, "end": 5759.16, "text": "Ja, doch Pog. Mache ich nicht. Deswegen habe ich mir mal Infinity Designer und Infinity"}, {"id": 691, "start": 5759.16, "end": 5763.76, "text": "Photo gekauft, weil ich keinen Bock auf Adobe Gremble habe und ich Adobe Gremble erstens"}, {"id": 692, "start": 5763.76, "end": 5773.88, "text": "nicht gescheit benennen kann und das zweitens viel zu teuer ist. Ja, also Visual Studio"}, {"id": 693, "start": 5773.88, "end": 5778.72, "text": "Code für C Sharp ist nicht schön. Das habe ich auch schon mal Just For Fun ausprobiert,"}, {"id": 694, "start": 5778.72, "end": 5786.16, "text": "aber das macht keinen Spaß. Webstorm habe ich nie, bin ich nie so richtig warm geworden"}, {"id": 695, "start": 5786.16, "end": 5792.64, "text": "mit. Ich verwende tatsächlich für Frontend ausschließlich Visual Studio Code. Da gehen"}, {"id": 696, "start": 5792.64, "end": 5798.64, "text": "ja auch die Meinungen auseinander. Ob Webstorm jetzt oder Visual Studio Code. Gibt Leute,"}, {"id": 697, "start": 5798.64, "end": 5805.28, "text": "die schwören komplett auf Visual Studio Code und Leute, die schwören komplett auf Webstorm."}, {"id": 698, "start": 5805.28, "end": 5814.8, "text": "Werden wir hier nicht weiter behandeln. Profis programmieren in Vim. Ja, Leute, die in Vim"}, {"id": 699, "start": 5814.8, "end": 5818.0, "text": "programmieren, die müssen vor allem, die erzählen, dass sie in Vim programmieren."}, {"id": 700, "start": 5818.0, "end": 5823.36, "text": "Das ist so ein bisschen wie Arch Linux User, die müssen das auch erzählen. Das sind die"}, {"id": 701, "start": 5823.36, "end": 5828.2, "text": "gleichen Leute, die ja sagen, es ist alles so ineffizient. Meine Finger müssen auf der"}, {"id": 702, "start": 5828.2, "end": 5835.16, "text": "Home Row Stain. Also wenn ich weiß, was die Home Row ist, Keyboard Layout, die Home Row"}, {"id": 703, "start": 5835.16, "end": 5844.64, "text": "ist das Ding hier. In der Mitte. Das da. Das ist die Home Row. So. Und wenn deine Finger"}, {"id": 704, "start": 5844.64, "end": 5852.88, "text": "nicht auf der Home Row Stain, dann ist es schlecht. Sagen die Vim Power User. Das Problem"}, {"id": 705, "start": 5852.88, "end": 5860.88, "text": "ist nur in der heutigen Zeit, dass ich das für totalen Schwachsinn halte, weil was bringt"}, {"id": 706, "start": 5860.88, "end": 5865.72, "text": "dir auf der Home Row zu Stain, wenn du die Maus brauchst, um den Browser ordentlich"}, {"id": 707, "start": 5865.72, "end": 5870.96, "text": "zu bedienen und im Internet was nachzugucken. Und es ist einfach so, dass du auch wenn du"}, {"id": 708, "start": 5870.96, "end": 5877.52, "text": "dich gut auskennst, 40 Prozent der Zeit trotzdem im Internet nachguckst und Dinger, Dinger"}, {"id": 709, "start": 5877.52, "end": 5882.24, "text": "schaust und ausprobierst und nachgucken muss. Und sei es nur, dass du Tickets bearbeiten"}, {"id": 710, "start": 5882.24, "end": 5888.76, "text": "musst, nebenbei mal kurz. Also das bringt dir überhaupt nichts, nur auf der Home Row"}, {"id": 711, "start": 5888.76, "end": 5893.96, "text": "zu Stain. Ja, ich kenne das. Ich habe das selbst benutzt. Leute, ich habe das früher"}, {"id": 712, "start": 5893.96, "end": 5900.88, "text": "selbst so gemacht. Ich hatte früher eine Vim-Config von 8000 Zeilen oder so mit 15 Extensions"}, {"id": 713, "start": 5900.88, "end": 5904.24, "text": "und mein Vim hat immer nicht richtig funktioniert, nachdem ich die mal geupdatet habe. Ich habe"}, {"id": 714, "start": 5904.24, "end": 5912.08, "text": "das früher genauso gemacht. Total abfuck. Heute habe ich die Vim-Config, die hat die"}, {"id": 715, "start": 5912.08, "end": 5916.56, "text": "notwendigsten Sachen und fertig und ich verwende das nur, wenn ich schnell auf der Kommandozeile"}, {"id": 716, "start": 5916.56, "end": 5922.16, "text": "was editieren muss und weil es auf jedem Server voll installiert ist. Genau, ich mache alles"}, {"id": 717, "start": 5922.16, "end": 5926.04, "text": "nur noch über Sprachassistenten, dass ich auf der Home Row Stain kann. Also ich finde,"}, {"id": 718, "start": 5926.04, "end": 5933.52, "text": "das ist heutzutage nicht zeitgemäß. Du verbringst bestimmt, ich sage jetzt mal 50 Prozent,"}, {"id": 719, "start": 5933.52, "end": 5942.48, "text": "aber das schwankt ja bei manchen 30, bei manchen vielleicht 60, 70 Prozent des Tages im Browser"}, {"id": 720, "start": 5942.48, "end": 5948.56, "text": "und du kannst einen Browser nicht gescheit bedienen über Tastatur-Shortcuts. Ich kenne"}, {"id": 721, "start": 5948.56, "end": 5955.44, "text": "diese Plugins, ich habe die früher selbst verwendet, dass du den Browser mit Vim-Shortcuts"}, {"id": 722, "start": 5955.44, "end": 5959.84, "text": "bedienen kannst. Das geht. Dann drückst du zum Beispiel F und der highlightet dir alle"}, {"id": 723, "start": 5959.84, "end": 5967.16, "text": "Links und dann drückst du zum Beispiel ein BV oder so für den Link und das geht. Es"}, {"id": 724, "start": 5967.16, "end": 5973.8, "text": "fühlt sich aber nicht nach natürlicher Browsernutzung an. Ganz ehrlich, Maus ist im Browser das"}, {"id": 725, "start": 5973.8, "end": 5979.0, "text": "beste und da bringt es dir auch nichts, dass du im Vim geil auf der Home Row stayst und"}, {"id": 726, "start": 5979.0, "end": 5987.56, "text": "dann alle zwei Sekunden trotzdem zur Maus rübergreifen musst. Ja, jeder was er will,"}, {"id": 727, "start": 5987.56, "end": 5991.64, "text": "du kannst deinen Browser auch mit einem Gaspedal bedienen, wenn du denkst, dass du dann besser"}, {"id": 728, "start": 5991.64, "end": 6002.48, "text": "auf der Home Row stayen kannst. Kein Problem, mach. V-Controller, das ist auch nice. Also"}, {"id": 729, "start": 6002.48, "end": 6008.08, "text": "ich programmiere mit einem Lenkrad oft öfters mal. Also ich habe CS mit dem Lenkrad gespielt"}, {"id": 730, "start": 6008.08, "end": 6011.16, "text": "früher und nachdem das hier noch rumliegt, programmiere ich da auch ganz gerne mal mit."}, {"id": 731, "start": 6011.16, "end": 6022.36, "text": "Maus auf dem Boden und am Schreibtisch. Jetzt weiß ich, man macht die Maus auf dem Boden,"}, {"id": 732, "start": 6022.36, "end": 6026.96, "text": "stayt schön auf der Home Row mit seinen Fingern und man macht dann quasi so einen Klettverschluss"}, {"id": 733, "start": 6026.96, "end": 6032.28, "text": "an die Maus dran und klettet sich die Maus quasi an den Fuß und dann kann man auf der"}, {"id": 734, "start": 6032.28, "end": 6037.72, "text": "Home Row stayen und kann mit dem Fuß die Maus bewegen. Leute, das ist so eine bescheuerte"}, {"id": 735, "start": 6037.72, "end": 6045.4, "text": "Idee. Ich könnte wetten, dass es Leute gibt, die machen das. Nicht viele, nicht viele,"}, {"id": 736, "start": 6045.4, "end": 6050.96, "text": "aber es gibt bestimmt Leute, die machen das bzw. haben es zumindest probiert. Man spricht"}, {"id": 737, "start": 6050.96, "end": 6054.72, "text": "ja erstmal nichts dagegen. Die Füße brauchst du zum Programmieren, nicht? Und wenn du"}, {"id": 738, "start": 6054.72, "end": 6060.72, "text": "ein krasser, krasser auf der Home Row stayer bist, dann kannst du schon mal die Maus auch"}, {"id": 739, "start": 6060.72, "end": 6084.84, "text": "mit der Tastatur, mit dem Fuß bedienen. Das Patent, das kannst du machreich ein. Tanzmatte."}, {"id": 740, "start": 6084.84, "end": 6092.44, "text": "Was ist das? Stream das lieber. TriHack streamt das auch manchmal, der Dance da auf so einem"}, {"id": 741, "start": 6092.44, "end": 6104.24, "text": "komischen, was ist das, ein komischen Dance Game mit Tanzmatte. Was ein Azubi hat mir"}, {"id": 742, "start": 6104.24, "end": 6109.96, "text": "erzählt, dass eine Firma BWL Stonks als Einstellungstest Excel Aufgaben stellt, Bedingung nur Tastatur"}, {"id": 743, "start": 6109.96, "end": 6121.04, "text": "und keine Maus. Ich weiß jetzt gar nicht, was ich daran absurder finden soll, dass man"}, {"id": 744, "start": 6121.04, "end": 6128.76, "text": "glaubt, dass das Aussagekraft hat für einen IT-Job oder dass es irgendwie erstrebenswert"}, {"id": 745, "start": 6128.76, "end": 6139.32, "text": "ist Excel nur mit Tastatur zu bedienen. Keine Ahnung, die Interviews und Einstellungstests"}, {"id": 746, "start": 6139.32, "end": 6147.0, "text": "nehmen groteske Formen an mittlerweile. Ne, ich schnall mir meine Maus garantiert nicht"}, {"id": 747, "start": 6147.0, "end": 6159.24, "text": "an Fuß. Dafür bin ich kein groß genuger auf der Home Row stayer. Ja, das ist wohl wahr."}, {"id": 748, "start": 6159.24, "end": 6165.12, "text": "Am besten ist es gar nicht zu benutzen. Trackpad für die Füße ist auch nicht schlecht. Da"}, {"id": 749, "start": 6165.12, "end": 6170.56, "text": "kannst du immer so mit dem großen Fuß zäh, kannst du dann quasi über das Trackpad scratchen"}, {"id": 750, "start": 6170.56, "end": 6180.04, "text": "oder noch besser auf dem Boden diesen komischen Joystick, den die Thinkpads immer haben. Bist"}, {"id": 751, "start": 6180.04, "end": 6188.36, "text": "dir mal in den Trackpoint, den roten. Sowas kannst du bestimmt mit dem großen Fuß zäh"}, {"id": 752, "start": 6188.36, "end": 6192.16, "text": "unterm Tisch gut bedienen für die Maus und dann kannst du immer auf der Home Row stayen"}, {"id": 753, "start": 6192.16, "end": 6207.0, "text": "für maximale Wim-Shortcuts. Wie man Farben für eine Webseite auswählt. Ja, ich auch."}, {"id": 754, "start": 6207.0, "end": 6211.84, "text": "Easy Step. Ganz ehrlich, den besten Tipp, wisst ihr was den besten Tipp ist, den ich"}, {"id": 755, "start": 6211.84, "end": 6217.24, "text": "je in einem Video gehört hab, wo es um Design ging, also den ich persönlich sehr sehr gut"}, {"id": 756, "start": 6217.24, "end": 6222.28, "text": "und praktisch fand. Anfangen mit schwarz und weiß. Wenn die Seite schon in schwarz und"}, {"id": 757, "start": 6222.28, "end": 6227.12, "text": "weiß ultra beschissen aussieht, dann soll man sich was anderes überlegen. Und erst"}, {"id": 758, "start": 6227.12, "end": 6231.0, "text": "wenn die Seite in schwarz und weiß ganz, ganz brauchbar aussieht, dann noch die ein oder"}, {"id": 759, "start": 6231.0, "end": 6234.64, "text": "anderen Farben dabei machen. Es muss nicht wirklich schwarz und weiß sein, es kann auch"}, {"id": 760, "start": 6234.64, "end": 6239.72, "text": "grau und weiß sein. Aber erstmal die Webseite zweifarbig machen. Und wenn die Webseite da"}, {"id": 761, "start": 6239.72, "end": 6245.16, "text": "schon mega beschissen aussieht, so dass man sie nicht benutzen möchte, dann ist was grundlegend"}, {"id": 762, "start": 6245.16, "end": 6250.0, "text": "verkehrt. Und dann kann man sich ein paar Abstufungen überlegen, noch so zwei, drei"}, {"id": 763, "start": 6250.0, "end": 6267.76, "text": "Farben dabei machen. Das fand ich war ein guter Ratschlag. Die Fußmause, wenn sowas"}, {"id": 764, "start": 6267.76, "end": 6288.96, "text": "gibt es wirklich. Das ist ja fast so toll wie der Fanatic Headshot Controller. Ok 2008."}, {"id": 765, "start": 6288.96, "end": 6299.4, "text": "Das kann doch nicht wirklich irgendjemand verwendet haben, oder? Keine Ahnung, was sich alles"}, {"id": 766, "start": 6299.4, "end": 6307.36, "text": "gibt. Ja, dafür ist tatsächlich, ich sag ja auch, ich hab das schon total auf dem Stream"}, {"id": 767, "start": 6307.36, "end": 6319.12, "text": "gesagt, dass Excel, das meiner Meinung nach einzige Produkt ist, in der gesamten Office"}, {"id": 768, "start": 6319.12, "end": 6324.12, "text": "Suite, was irgendwie eine Daseinsberechtigung hat. Ja auch, auch sagen wir mal auch für"}, {"id": 769, "start": 6324.12, "end": 6329.8, "text": "mich vielleicht. Ich benutze zwar Excel nahezu nie, aber ich könnte mir vorstellen, das vielleicht"}, {"id": 770, "start": 6329.8, "end": 6334.92, "text": "zu verwenden. Aber alles andere ist Müll. Outlook ist nicht Bestandteil von der Office"}, {"id": 771, "start": 6334.92, "end": 6345.84, "text": "Suite. Im Office Suite ist Word, Excel, PowerPoint, früher war es noch Access. Und was hab ich"}, {"id": 772, "start": 6345.84, "end": 6356.0, "text": "noch? Was hab ich noch vergessen? Publisher gab es früher, das war aber auch nur Bonus."}, {"id": 773, "start": 6356.0, "end": 6365.2, "text": "Ja, also Word, Excel, PowerPoint, Outlook ist standardmäßig nicht dabei. Access, Publisher,"}, {"id": 774, "start": 6365.2, "end": 6369.88, "text": "ich glaub Standardmäßig auch nicht mehr. Ok, das war's. Also Word, Excel, PowerPoint,"}, {"id": 775, "start": 6369.88, "end": 6379.2, "text": "Access. Also Access ist Paints Chairman. So und Word ist so ziemlich das Unsinnigste überhaupt."}, {"id": 776, "start": 6379.2, "end": 6386.08, "text": "Also wer Word verwendet hat glaube ich echt die Kontrolle über sein Leben verloren, weil"}, {"id": 777, "start": 6386.08, "end": 6392.52, "text": "da wirklich abhängig von ist. Und nichts anderes als Alternative kennt, das ist schon sehr"}, {"id": 778, "start": 6392.52, "end": 6398.08, "text": "sehr Paints Champion. Weil ich bin der Meinung, wenn man einfach nur Text schreiben will, dann"}, {"id": 779, "start": 6398.08, "end": 6403.28, "text": "brauchst du keine Textverarbeitung, weil dann geht es ja um den Text. Und wenn man Text,"}, {"id": 780, "start": 6403.28, "end": 6410.88, "text": "wenn man was optisch schön machen will, ja die Hardcore Leute machen das mit Latex, Latech,"}, {"id": 781, "start": 6410.88, "end": 6415.16, "text": "wie man das genau ausspricht. Man kann das aber auch in jedem x-beliebigen Designerprogramm"}, {"id": 782, "start": 6415.16, "end": 6420.56, "text": "machen, wenn es einfach nur hübsch aussehen soll. Ich mein niemand schreibt ein Buch"}, {"id": 783, "start": 6420.56, "end": 6425.4, "text": "in Word, schickt es dem Verlag und der Verlag, der haut es dann in die Presse so nach dem"}, {"id": 784, "start": 6425.4, "end": 6431.32, "text": "Motto. Vom Word Dokument zum Druck, das passiert ja nicht. Also deswegen, Word ist da halt"}, {"id": 785, "start": 6431.32, "end": 6455.88, "text": "total unsinnig. Powerpoint, verwende ich tatsächlich am meisten davon, aber nur weil ich manchmal"}, {"id": 786, "start": 6455.88, "end": 6459.2, "text": "muss, weil es bei uns auf der Arbeit immer noch Leute gibt, die der Meinung sind, man"}, {"id": 787, "start": 6459.2, "end": 6465.88, "text": "muss die Corporate Identity Vorlagen verwenden, nur dann geht es als Präsentation durch."}, {"id": 788, "start": 6465.88, "end": 6489.24, "text": "Das Chebat Video, natürlich ist das Chebat, auch Comic Sans, was sonst, hab ich schon im"}, {"id": 789, "start": 6489.24, "end": 6503.2, "text": "ersten April hochgeladen. Man kann einfach Fußnoten machen. Ja ok, ich lass mir's gefallen,"}, {"id": 790, "start": 6503.2, "end": 6508.88, "text": "ich will ja keinem ausreden, dass er Word verwendet. Wenn jemand mit Word zufrieden ist"}, {"id": 791, "start": 6508.88, "end": 6514.6, "text": "und das quasi Funktionen hat, die er braucht, das war meinetwegen, verwendet Word, ich will"}, {"id": 792, "start": 6514.6, "end": 6520.28, "text": "euch ja nicht bekehren, macht was ihr wollt. Undok ist auch Pog, ja. Twitch Mason, danke"}, {"id": 793, "start": 6520.28, "end": 6523.8, "text": "für den Sub. Leute, ich hab gefühlt wieder einige Subs übersehen, ich guck mal kurz"}, {"id": 794, "start": 6523.8, "end": 6531.8, "text": "rein bevor ich gleich ins Bett gehen muss. Wolle hat gecheert mit Bits, Dankeschön"}, {"id": 795, "start": 6531.8, "end": 6541.16, "text": "für die 250 Milliarden Bits. Joho hat abonniert, der Weezy hat abonniert, das hab ich alle"}, {"id": 796, "start": 6541.16, "end": 6547.32, "text": "schon gesehen glaub ich, Doomsweb hat abonniert, Kengin, ja das hab ich schon gesehen, danke"}, {"id": 797, "start": 6547.32, "end": 6566.84, "text": "Leute nochmal für die Subs, falls ich irgendwann übersehen hab, aber ich glaube nicht. Der"}, {"id": 798, "start": 6566.84, "end": 6573.4, "text": "Name sagt mir was, ist es der mit dem Goldfisch, ist es der mit dem Goldfisch der angeblich"}, {"id": 799, "start": 6573.4, "end": 6579.96, "text": "Stonks kauft, ja haben wir geguckt, das war auch reichlich sinnlos, ich mein im Prinzip"}, {"id": 800, "start": 6579.96, "end": 6587.6, "text": "war das Randomize und der Goldfisch hatte damit, ja weiß nicht, nicht viel zu tun eigentlich,"}, {"id": 801, "start": 6587.6, "end": 6595.92, "text": "das hätte ohne den Goldfisch fast genauso gut funktioniert. Trustfire, Dankeschön"}, {"id": 802, "start": 6595.92, "end": 6607.84, "text": "für den Sub. Kommt auf die Firma an, kommt drauf an was du machst, kommt drauf an in"}, {"id": 803, "start": 6607.84, "end": 6615.32, "text": "welcher Region du bist, kann man schlecht sagen, guck dir mal irgendwelche Vergleiche"}, {"id": 804, "start": 6615.32, "end": 6620.4, "text": "an, gibt es ja genug Umfrage, ab und zu macht Heise ja auch so einen Gehaltsvergleich, aber"}, {"id": 805, "start": 6620.4, "end": 6638.8, "text": "ansonsten schwierig zu sagen, ja, das stimmt wohl, ja, gleich Bett gehen, ja ich geh jetzt"}, {"id": 806, "start": 6638.8, "end": 6651.36, "text": "mal. Ok Leute, ne wir gucken jetzt kein Axel Video, ist es der der Raytracing in Axel gemacht"}, {"id": 807, "start": 6651.36, "end": 6663.24, "text": "hat? Ne. Es gab ja einen Raytracer für Axel irgendwie, kann ich mich erinnern. Ich mach"}, {"id": 808, "start": 6663.24, "end": 6669.88, "text": "jetzt gar nichts, ich mach jetzt Heck Bett gehen, ich geh jetzt pennen, weil ich bin"}, {"id": 809, "start": 6669.88, "end": 6675.44, "text": "übelst kaputt und morgen zum Glück wieder Homeoffice und das heißt ich bin danach auch"}, {"id": 810, "start": 6675.44, "end": 6680.6, "text": "fitter, danach muss ich meine 1-2 Stunden Sport machen, gut Sport ihr wisst was ich"}, {"id": 811, "start": 6680.6, "end": 6685.44, "text": "mach, ich laufe ein bisschen draußen rum, ich laufe etwas schneller 2 Stunden draußen"}, {"id": 812, "start": 6685.44, "end": 6692.56, "text": "rum, 1,5-2 Stunden, nicht jeder würde Sport nennen, aber es hat was gebracht, ihr habt"}, {"id": 813, "start": 6692.56, "end": 6710.68, "text": "als letztes auf der Waage gesehen, Meilenstein ist erreicht. Ja, jeden Tag 1-2 Stunden, das"}, {"id": 814, "start": 6710.68, "end": 6719.48, "text": "sind nicht immer 2 Stunden, das ist meistens 1,5-2 Stunden, wo ich etwas schneller spazieren"}, {"id": 815, "start": 6719.48, "end": 6724.56, "text": "gehe, nicht super krass schnell, also jetzt nicht hier irgendwie norwegisches Militärmarsch,"}, {"id": 816, "start": 6724.56, "end": 6736.2, "text": "den Berg rauf, 7 Stunden Kilometer mit 35 Kilo Gepäck. Ach früher, ich hab hast du"}, {"id": 817, "start": 6736.2, "end": 6741.88, "text": "früher, also ich glaube Wanderurlaub haben wir früher nie gemacht, kann ich mich nicht"}, {"id": 818, "start": 6741.88, "end": 6748.4, "text": "daran erinnern, dass wir früher Wanderurlaub gemacht haben. An Strand sind wir öfters"}, {"id": 819, "start": 6748.4, "end": 6755.6, "text": "ausgefahren, wo waren wir denn überall, die üblichen Sachen, Gran Canaria, Tenerife,"}, {"id": 820, "start": 6755.6, "end": 6764.64, "text": "in der Türkei waren wir auch, kann ich mich noch dran erinnern, sowas, wobei ich in die"}, {"id": 821, "start": 6764.64, "end": 6768.28, "text": "Türkei heute wahrscheinlich auch nicht mehr fahren würde, die sind mir zu weird champ"}, {"id": 822, "start": 6768.28, "end": 6772.64, "text": "geworden dort, nach Ägypten kannst du auch nicht mehr fahren, das sind auch weird champ"}, {"id": 823, "start": 6772.64, "end": 6777.84, "text": "geworden, aber ganz im Ernst, ganz im Ernst, ja ich zähl Schritte, ich hab ja immer mein"}, {"id": 824, "start": 6777.84, "end": 6786.4, "text": "iPhone dabei, das macht das ja so, in der Hells App standardmäßig schon, aber da guck"}, {"id": 825, "start": 6786.4, "end": 6792.2, "text": "ich so gut wie nie rein, aber ich hab theoretisch einen Zähler, ja. Jetzt in Bitcoin investieren,"}, {"id": 826, "start": 6792.2, "end": 6799.76, "text": "nee, ich hab ziemlich langweilige ETF Stonks, die dank den China-Chinesen ordentlich runtergegangen"}, {"id": 827, "start": 6799.76, "end": 6818.56, "text": "sind die letzten paar Wochen. Wer ist die Katz? Chico. Chico, aber es ist ein Mädchen, warum"}, {"id": 828, "start": 6818.56, "end": 6822.96, "text": "auch immer sie Chico heißt, ich weiß es nicht, die hieß schon so, die hab ich aus dem Tierheim"}, {"id": 829, "start": 6822.96, "end": 6832.0, "text": "gehört, und warum soll ich die Oma nennen? Warum man die Katze Chico genannt hat, ich"}, {"id": 830, "start": 6832.0, "end": 6838.96, "text": "habe keine Ahnung. Katzcam, keine Ahnung, ich geh jetzt bett hier, Leute wir sehen uns,"}, {"id": 831, "start": 6838.96, "end": 6853.52, "text": "machts gut, bis morgen, vielleicht CU."}]}