{"text": ". . . . . So, dann wollen wir mal das Ding benutzbar machen. Ich hab gestern Abend noch ein bisschen weiter gebaut und hab das vorhin gepusht. Das heißt wir sind ein bisschen weiter als gestern. Das sieht jetzt etwas schöner aus als gestern noch, was wir gebaut haben. Äh, Essen? Ja, gegen so aufgewärmte Nudels. Also, das war jetzt nicht die geilsten Nudeln überhaupt. DHL krank geworden. Kannst du noch nix für? Sollen sie jemand anderes ins Auto setzen? Joa, sollen wir mal gucken wie lange das jetzt geht. Ich denke nicht, dass wir wieder 4 Stunden dran rum basteln jetzt, in dem ich schon fast 3 Stunden vorhin on war. So, also ich zeige euch mal wie es gerade ausschaut. Äh, ich guck noch mal ob zwischendurch noch mal Updates checken, man weiß ja nie. Äh, warum hängt denn das da so lange? Ja, schon wieder on. Der echte Age des Ministers haben schon hat 24 Monate, Dankeschön für den Sub. Ja, ich glaube nicht, dass wir so lange basteln wie gestern. Es fehlt ja im Prinzip jetzt nur noch das Popup, was man macht zum Programmieren und dann ist erstmal so von den Basic Funktionalitäten gut und dann kann man sich ja noch was überlegen. Also, ich mach den Kram mal kurz auf und dann zeige ich euch wie es aktuell aussieht, weil ich hab noch ein bisschen dran gebastelt. Ja, eine Sache, da haben wir gestern überhaupt nicht dran gedacht, das zeige ich euch mal schnell, guck mal. So, und zwar es kann passieren, dass zwei EPG Einträge Lücken haben, weil der Sender Mist verschickt und da muss man die Lücke schließen zwischen den EPG Einträgen. Also wenn eine Sendung aufhört um 15 Uhr und die andere fängt erst um 15.05 Uhr an, dann ist das zwar unlogisch, aber das kann der Sender halt ausliefern, weil sie, wenn sie blöd sind, ja das machen sie auch. So, ich starte das jetzt mal und dann zeige ich euch wie es aussieht. Ihr werdet auch feststellen, wir haben jetzt, pass mal auf, guckt mal, wir haben einen Spinner. Massive. Ah, das Backend ist gar nicht gestartet, deswegen spinnt der Spinner auch so lang. Ja, eins bis zwei Lücken ist halt blöd, die muss ich jetzt überbrücken, ok, nochmal. So, das, wow, was habe ich hier aufgemacht, guckt mal, so sieht es jetzt aus, sieht besser aus als gestern, oder? Und wir haben einen Spinner, es lädt schneller und wir haben einen Spinner, das in Kombination kommt einem gar nicht mehr, gar nicht mehr so lange vor und seht ihr das hier oben, guckt mal, Pfeifferer-Time, das ändert die Hintergrundfarbe anhand der Tageszeit, seht ihr das, guckt mal, 22, 23 Joules Nachts und jetzt, jetzt wird es wieder langsam hell, d.h. du kannst beim Durchscrollen schon so ungefähr sehen, wie viel Uhr es ist, richtig Pfeifferer, ja. Und ihr seht es hier, 20.15 Uhr, das ist auch alles jetzt richtig, richtig aligned, außer manche Sender wie RTL2, die der Meinung sind, dass die Geissens Roberts Mega Mansions 20.14 anfangen, warum? Man weiß es nicht. Tja, und ProSieben ist Pamela Anderson-Buba, wobei, nee, ich glaube nicht, dass sie das noch ist. Wofür die Farben stehen, weiß ich ehrlich gesagt auch nicht, das habe ich gestern random wieder reingewurscht, dass es noch irgendwie geht, ja, man hat keine Ahnung, wofür die Farben stehen, das ist schon richtig. Woher ich die Daten ziehe von meinem TV-Headend-Server? Es gibt aber auch Web-EPGs, die man anzapfen kann, wenn man will. So. Und wisst ihr, was es für ein Akt war, diese Sache hier genauso hoch zu bekommen, wie den Rest der Seite, ich habe da eine ekliche Lösung, ich zeige euch das mal kurz. Ich habe keine Ahnung, ob das besser geht, aber ich rechne die Höhen der Seite aus, wie hoch ich, wie lange ich den Strich machen muss. Ich habe keine Ahnung, ob es schönere Lösungen gibt, aber die funktionieren. Nein, nein, nein, nein, nein, das funktioniert nicht. 100% View-High, funktioniert nicht, 100% View-High ist so und wenn ich runter scrolle, hört es auf. Full geht auch nicht, ja, ich habe keine Ahnung, Max Content geht auch nicht, habe ich auch ausprobiert, das ist das einzig Sinnvolle, was mir eingefallen ist, ich habe fast alles andere ausprobiert. Ich benutze gerne Tailwind, weil ich habe keine Ahnung von CSS und irgendwie finde ich das griffiger. Übrigens, dieser Strich hier, der gibt auch nicht wirklich Sinn, der Strich ist einfach irgendwie so um 15 Uhr rum jetzt, weil es immer gleich breit ist, also okay, also was wir heute machen müssen ist folgendes, wir müssen das Ding erstmal funktional machen, das heißt, wenn man hier draufklickt, dann muss ein Popup kommen und ein Popup, wo man dann Details sieht und aufnehmen kann und so und dann können wir die schöneren Sachen kümmern, so zum Beispiel, dass die Farben richtig sind, weil aktuell ist es einfach nur ein riesig langes If, was anhand der Senderkategorie irgendwelche Farben zuweist, das hat keinen tieferen Sinn, automatisches Skalieren funktioniert nicht, aber insgesamt, muss man sagen, sieht das durchaus brauchbar aus und das sieht deutlich moderner aus als die Sachen, die ich dafür gefunden habe. Einzig dumme ist, wenn man wirklich durchscrollt bis zum Schluss, ich gehe mal ganz hinten hin, da sieht man halt an den Stellen wo es aufhört, dann hört es halt einfach auf, weil gerade das hier, das sieht nicht so schön aus, aber da gehen halt die Daten irgendwann aus. Was willst du machen? Filter Suchfunktion, ehrlich gesagt, weiß ich nicht wie sinnvoll das ist, es soll jetzt dann nicht zu überladen sein, na wobei Filter, an sich ist die Idee gar nicht schlecht, ich hab doch hier irgendwo mein txt-File, eventuell Filter, aber Filter nur wirklich ultra simple, da machen wir irgendwie die Möglichkeit das zu sagen, hier Textbox, aber Filtern, das ist schwierig in dieser Darstellung zu Filtern, weil ich kann die Dinge zwar easy rausfiltern, die nicht deiner Sache, die du suchst entsprechen, aber dann hast du Lücken, wirst du gar nicht wie ein Filter hier aussehen sollte. Ich mein man kann in Zukunft ja noch vieles machen, wenn man es denn will, man kann auch sagen, hey wenn man auf den Sender klickt, dann kommt so eine Darstellung pro Sender mit der Zeit, anstatt diese hier, ich will jetzt aber erstmal so die basic Sachen funktionieren und wir müssen probieren ob das überhaupt gescheit läuft auf dem Linux Receiver wo das dann im Ende laufen soll. Ich finde das ehrlich gesagt jetzt ganz hübsch zum aktuellen Zeitpunkt, das default Image könnte man noch austauschen, ich weiß nicht wie seriös so ein CAC W Bild wirkt auf Leute auf GitHub, aber ist mir ehrlich gesagt auch wurscht. Leere Plöcke mit fehlenden Daten, ja das habe ich mir auch schon überlegt, hier hinter, da müsste ich halt ausrechnen, da müsste ich quasi gucken, wann hört der längste Block auf und dann quasi gucken wie lange muss ich den Block machen, wo keine Daten drin stehen, das wäre sogar ganz gut, weil er würde alles hier gleich abschließen. Die Zeitleiste ist ultra bescheuert gemacht, die geht als einfach eine Schleife für 8 Tage mit jeweils 24 Stunden am Tag und dann hier oben den, sagt mal Leute braucht man hier oben überhaupt die Zeit, ich meine die Zeit sieht man ja hier unten oder, wobei die Übersicht ist schon schneller, ja wenn ich jetzt raussuchen will, keine Ahnung, Dienstag 20.15 Uhr dann gehe ich dahin, das ist schon halt schlecht, so jetzt müssen wir mal wie gesagt Pop-Up machen, also sprich wenn man hier draufklickt, erstmal User Select ausmachen, das sieht halt, das ist ja richtig beknackt so, kann man das vielleicht für das ganze Ding ausschalten, select, select none, aha, wie kann man das denn unterbinden, ah da gehe ich aufs Image und sag Class Pointer Events None, dann gibt es auch keinen, ha guck jetzt wird eh nicht mehr track and drop, man könnte jetzt hier vielleicht noch den Cursor anders machen wenn man hier drüber ist, könnte jetzt noch, weil ansonsten checkt ja da keiner dass man da draufklicken muss, Leute sagen wenn man jetzt hier drüber ist, Alter, also die Standard Code Formatierung ist hier schon ziemlich ppeger oder, wieso ist der Strich bei 520, weil der Strich Hardcoded ist und absolut keinen Sinn hat aktuell, außer dass man sieht ungefähr hier ist es gerade aktuell, Pointer, nee Cursor, Pointer, aha, oh nee, aha, ah, da kann man nicht durchklicken, MonkaS, wie macht man dann den, habt ihr mal eine Ahnung wie man in HTML was Click-Through macht, dass es nicht mal in den Pointer Events frisst, sondern durch geht, hier funktioniert es, guck hier kann man dann draufklicken, Sogar das jetzt funktioniert. Nice. Äh, weil RTL 2 das so macht, das liegt nicht an mir, bei RTL 2 sind die Dinger so shab, das ist normal. Guck, RTL 2 hat aus irgendwelchen Gründen diese Sendung so shab, alle andere nicht, das ist weil die das so ausstrahlen. Sinn ergibt das nicht, aber es ist halt so bei RTL 2. Keine Ahnung. Einfach Pointer Events ignorieren, dann funktioniert aber wahrscheinlich... Oh, ich habe meinen Browser kaputt gemacht. Wenn ich Pointer Events none mache, dann kann ich aber doch nicht durchklicken, oder? Hallo? Video, please? Warte mal, wo bin ich denn überhaupt? Aber ich blick gerade nicht mehr durch, wo bin ich denn? Ne, hier, hier bin ich richtig. Orange, ich weiß nicht wo wir sind. Ah, hier, hier bin ich, ok, alles klar, obvious. Ey doch, funktioniert, alles klar, einfach Pointer Events ignorieren, ok, hätte ich das mal früher gewusst. Auch weil er durchklicken soll, ist es mir doch wurscht, ob das Anti-Pattern sind oder nicht, solange das funktioniert. Ganz davon abgesehen, hier will es ja durchklicken, das ist ja nur zum Anzeigen, dass es hier die aktuelle Zeit ist. Was willst du denn genau machen, das ist an sich nicht so schwierig, Websockets, also sowohl Home Assistant als auch Grafana benutzen Websockets, wobei beim Grafana, ich bin gar nicht so sicher, aber Home Assistant benutzt auf jeden Fall Websockets zum, kannst sogar subscriben und dann bekommst du Daten rausgeschickt regelmäßig. Oder willst du Informationen abrufen und diese Informationen dann, also die, willst du Informationen über eine Websocket Verbindung bekommen und die dann irgendwann mal diese Infos so umschreiben, das sind ja im Grafana, also wenn du sie im Grafana einbinden willst, ist die Frage was für eine Source du verwendest, wenn es Prometheus ist, muss es ein Notexporter Format sein. Achso, ja, ja, ok, da sind ja zwei Schritte, erstmal die Daten rausbekommen aus der Websockets API und dann die Daten reinpumpen, jeweils ins Grafana oder ins Home Assistant, also Grafana hängt davon ab was du für eine Quelle verwendest, wenn wie gesagt, wenn es Prometheus ist, musst du da ein Notexporter draus machen, das kannst du mit irgendwie so einem Mini-Bash mit machen oder im Prinzip mit was du lustig bist und ins Home Assistant gibt es verschiedene Sachen, kannst du über MQTT machen, kannst du über HTTP machen, Home Assistant hat mehrere Sachen, du kannst beispielsweise einen HTTP Sensor machen, was sein kann ist, dass Home Assistant irgendwas bietet, wo man direkt von Websockets was abfragen kann, das weiß ich nicht, also ich würde jetzt ein kleines Skript machen, was die Websockets Sachen abfragt und dann per HTTP in Home Assistant pusht, irgendwie so, da muss man sich jetzt genauer angucken. So, wir machen jetzt das Popup, also wie kriegen wir ein Popup hin, übrigens Leute, das ist absolut nicht modular, das ist eine Seite mit allem drinnen, aber wir sind nur bei 2 und 19 Teilen, inklusive JavaScript und sonst was, also passt halbwegs, so, wir müssen das Popup designen, ihr wisst ja, ich bin ein großer Popup Designer, ich kann das wahnsinnig gut designen, haben wir schon ein paar mal verkackt, ok, wir machen ein Popup, ich meine, man könnte auch eine extra Klasse machen für das Popup, dann ist es nicht ganz so hässlich, eventuell, vielleicht, ach was, inline, alles in die eine Datei rein, gut ist, also wie machen wir jetzt hier ein Popup, also, class, fixed, das muss man glaube ich sinnvollerweise nehmen, left, 5 frei, right, 5 frei, pop, 5 frei, bottom, 5 frei, bg, red, so, dass man sieht, so, ist das jetzt ein Popup, hey, das ist ein Popup, pog, ne, ne, das sieht nicht, z-index, 50, soll vorne sein, ok, besser, so, wir haben ein Popup, zwar kein wahnsinnig schönes Popup, aber wir haben ein Popup, ah, tatsächlich, Grafana Websocket Source, tatsächlich, using the new Websocket Data Source Plugin, aha, wusste ich gar nicht, dass die sowas haben, pog, ansonsten, das habe ich noch nie verwendet, Grafana mit Websockets, also nicht mit diesem Websocket Plugin, Home Assistant hat auch für ziemlich, Websocket Sensor, Home Assistant hat auch für ziemlich alles irgendwelche Plugins, Websocket Sensor, Websocket Integration, ja, also das kenne ich, ja, du kannst, du kannst dem Home Assistant die Sachen über, über, HTTP reinpumpen, ne, das ist, das ist die Websocket API, ne, da gibt es anscheinend nichts, direkt in Websocket Verbindung machen aber glaube ich auch die wenigsten, so, so, unser, unser Massive, ok Leute, wir machen jetzt, wir machen tatsächlich mal, wisst ihr was, wir machen zur Abwechslung mal ein schönes Pop-Up, das ist schwierig, ja, weil ich sacke in CSS, aber wir machen, wir machen mal ein schönes Pop-Up und zwar, man könnte, so, also der Hintergrund, der Hintergrund ist auf jeden Fall schon mal nicht, nicht x-taubt, ja, ok, ok, lass mal, lass mal kurz, lass mal kurz in mich gehen, wie könnten wir ein schönes Pop-Up machen, ok, ich weiß wie wir das machen, ich weiß wie wir das machen, ok, also Massive, Massive Idee, also bg, grey, 900, pass mal auf, pass mal auf, ich hab ne Idee, so, opacity 50, so guckt, jetzt kann man schon mal durchgucken, aber nicht durchklicken, ok, jetzt haben wir so ein halbtransparentes Pop-Up und jetzt, hallo, ah, da fehlt, da fehlt ein Quote, so, und jetzt machen wir den eigentlichen Pop-Up Content da rein, kekwe, schöner, ja, rounded border ist ne gute Idee, rounded border ist ganz wichtig, kennst du das, nee, a beautiful, responsive, customizable, possible, was für ein Ding, hab ich noch nie gehört, soll das sein, sweet alert, beautiful, responsive, customizable, accessible, weiraria, alles klar, das ist irgendwelche Sachen, die man, oh, frag mich nicht, das ist, ist das nicht das, um Seitenbehinderter gerecht zu machen mit irgendwelchen annotations und sowas, supports, danke für den Zapp, replacement for java script pop-up boxes, aha, nö, das kenn ich nicht, show alert, das sieht tatsächlich ganz nett aus, aber ich will jetzt nicht irgendwie ne pop-up library oder so da reinhauen, scheint sehr beliebt zu sein, rounded border machen wir, so, also, poggers, poggers pop-up, also, so, das hier wird absolute position, left 5, top 5, right 5, bottom 5, ah, guck mal hier, da stehts hier, kqw ist da, so, rounded, ganz wichtig, border, was ist denn der Unterschied zwischen border und border 1, das ist gleich, oder, also jetzt war rounded 1, nicht border, ich bin ja auch blöd, irgendeiner hat gespammt, ja, weg, weg, weg mit spammern, so, tatsächlich, massive, so, ok, border, grey, so, und jetzt sollte man halbwegs, zumindest was ein bisschen aussieht wie ein pop-up haben, seht ihr irgendwas, ich seh nix, border 4, wo ist der border, ah, moment die opacity ist vererbt, äh, äh, was sagt, ja die stile opacity ist vererbt, lull, also muss ich hier sagen opacity 0, äh, ne 100, oder, ne, ähm, oh Gott, warum ist css immer so ein krasse abfuckender, oh, manne, das ist grau, ich glaub ich weiß was ich falsch mach, ja, wir können hintergrund opacity machen, äh, bg opacity, 50 oder so, ah ja, ok, schon besser, ok, ok, alles klar, gut, so, und jetzt bg grey 100, jetzt sollte das doch ein bisschen, ja, das sieht doch, guck mal, das sieht tatsächlich nach einem halbwegs brauchbaren pop-up aus, so, padding 2, guck mal, das hat doch schon mal was von einem pop-up, was als pop-up durchgeht, der hintergrund ist grau, man kann nicht durch klicken und hier kann man drinnen rum, oh, was ist das da, ich hab's genau gesehen, man konnte gerade im hintergrund zeug anklicken, ihh, warum kann der hintergrund überhaupt fokus kriegen, anzeige direkt, was ist da, ihh, na gut, das macht ja eh keiner, so, pop-up, also was muss da, was muss da in die überschrift, also in die überschrift muss sowas rein wie ehm, ehm, der sender, sender, muss da oben rein, so sender, den sender machen wir bold und text 2xl, so, so das ist der sendername, darunter kommt dann die sendung, titel oder sowas, titel, oh, ehm, und dann unten drunter der text, würde ich sagen, macht ja keiner, da kann ja nix passieren, kann ja nix passieren, was soll passieren, wenn da im hintergrund einer steuerung a drückt, so sender, titel, dann kommt der text unten drunter, ehm, die start und stoppzeit sollten wir vielleicht noch machen, ok, also, achso, wir brauchen vielleicht ein paar schließen buttons, weil, moment, wie machen wir das ding überhaupt auf und zu, sekunde, ehm, let, selected, epg, entry, so, also, das ist hidden, hidden, solange das nicht selected ist, was das für idee, das ist wishlist studio code und das ist rider, so, jetzt ist unser popup weg, gut, so, das heißt, egal was ich anklicke, ich will, dass das popup aufgeht, machen wir doch, also easy, easy, egal was ich, alter, die discount formatting hier ist schon ganz schön, ganz schön abfang, oder, das ist nicht so, als hätte ich das gemacht, wishlist studio ist irgendwie der meinung, das ist ein geiles auto formatting, was es da macht, weiß nicht so genau warum, es sieht zumindest nicht sonderlich geil aus, sieht richtig hängen geblieben aus, aber, hey, solange es funktioniert soll, soll es mir recht sein, ok, also, onclick, onclick, click, eigentlich, weil wir onclick nix großartig machen, außer, selected, epg, entry, da draufsetzen, so, und wenn ich das jetzt anklicke, kommen wir in den popup, jawoll, bäm, ist doch schon mal gut, dann kriegen wir in popup, pogchamp, ok, also, dann brauchen wir an der stelle, jetzt den titel, selected, epg, das will ich schon immer mal gucken, so, dann, moment, nee, nee, warte mal, nicht den titel, den sender, den sender will ich anzeigen, nicht, nicht den titel, also muss ich zwei sachen übergeben, oh, das ist jetzt ja schon wieder eklig, wobei, brauchen wir den sender, wir brauchen den sender nicht, so ist auch gut, es reicht, einfach, einfach den titel von dem teil anzeigen und gut ist, wen interessiert es, dass es im ersten ist, who cares, so, also, die bad homburger kartenfreunde, gut, das, das müssen wir, müssen wir später gucken, es gibt schon, es gibt schon echt unglaublich viel müll, oder, ok, wir, wir, wir cheaten, Leute, wir cheaten mal kurz, get emoji, ich brauch nen recording oder sowas, gab das nicht nen record, record emoji, ja, das meine ich, den da, den da will ich haben, was ist da, weiß ich welches emoji das ist, einfach red dot, weil, das könnte man eigentlich hier hinter machen, wenn es ne aufnahme gibt, guck mal, ist ne aufnahme, wenn das, wenn das aufgenommen wird, dann, dann könnte man hier hinter versuchen, so nen kringel hinten drin, hinten dran machen, ja, da kümmern, kümmern wir uns dann drum, ähm, Leute, wir machen hier, machen wir hier ein eigenes, ah, mal gucken, so, dann haben wir start stop zeit, sollten wir noch anzeigen, das ist glaube ich da auch nicht schlecht, also quasi, ähm, start string, cactv, stop string, so, und jetzt sollten wir zumindest durch die zeit runter stehen haben, ah, aber das ist ein bisschen groß, also, dann machen wir text, sogar text sm, ja, das ist gar nicht so blöd, hast du da auch eine user story, ja, wir haben, wir haben ganz viele user stories und, und design mockups erstellt im vor, äh, ich, ich plan da schon seit drei monaten, no cup, cup, das wird ein problem mit dem sender, ich hab die info über den sender grad nicht, man kann auch inset null schreiben, five header time, inset, was macht das, aha, bam, ah, yes, siehste, deswegen, five head chat, gut, der große duftraub, so, und jetzt muss da unten drunter, jetzt kommt ja eigentlich das wichtigste, die description, ähm, fünf abstand oder so, description, description, so, das heißt, wenn wir jetzt was finden mit description, da, bisschen klein, ja, nee, nee, nee, nee, nicht sm, einfach so, was ist das zwischen dem html, das da, das, äh, ist das wie man das ins welt macht, so escape, escape, javascript, kram, das da, ja, oder was meinste, ach stimmt, hier können wir auch inset fünf machen, ja, inset fünf, ok, also, ich mein, das sieht jetzt nicht super krass hübsch aus oder so, wisst ihr was, wir machen glaub ich ein padding mehr, das padding ist vielleicht bisschen wenig, wir machen aber padding, padding fünf, ja, schon besser, gut, so, waren wir jetzt vielleicht noch in klammern, ja, ich find das sieht brauchbar aus, ich find das sieht, das sieht brauchbar aus, wirklich viel schöner formatiert, nehmen wir den text wahrscheinlich nicht, das sieht halt so aus, wie es aussieht, das sieht doch, wir brauchen buttons, wir brauchen buttons zum schließen noch, angular, nee, mit angular hatte ich noch nie was zu tun großartig, alles was ich gesehen hab von angular hat mich aber abgeschreckt bisher, so, button, button, ich bin auch outdated, also, so, wir brauchen ein button für aufnahme und ein button für schließen, schließen, ich weiß es triggert jetzt schon wieder viele leute, dass es deutsch und englisch heißt, aber da können wir später, beigen es für hin machen, ja, ich mags welt, fühlt das nicht schlecht, aber ich kenne nur das welt und vue js halbwegs, so wie machen wir denn unseren button schön, also class, rounded button, immer, immer, ja, den machen wir rot, den aufnahme button machen wir rot, aufnahme und rot passt irgendwie zusammen, bold, font, warum nicht, und den text man weiß, dass man es auch ordentlich erkennt, schauen wie es aussieht, null, achso, ja, weil das kein text hat, ok, da muss man vielleicht ein bisschen, ein bisschen abstand oben drüber machen, das ist meine eigene box, klebt, klebt ein bisschen sehr oben, machen wir, hopp, so, woher hast du die daten von meinem tv, von meiner tv box, die, das wird gekrappt von meiner, von meinem receiver im wohnzimmer, hier, guck mal, das besteht ja aus zwei sachen, es gibt einmal ein backend, was dieses abfragen vom epg macht, von der receiver box und dann gibt es dieses frontend für diesen krempel, ja, gut, so, aufnahme button haben wir, schließen button, das sieht doch, das sieht doch eigentlich ganz ok aus, dann duplizieren wir den button mal, schließen, der schließen button, was kriegt, der kriegt einfach blue 500, so, hey, das sieht doch, ohne mist, das sieht doch tatsächlich ganz brauchbar aus, so schließen, wie schließen wir das ganze, schließen, on, klick, sagen wir einfach, selected gleich 0, so, dann sollte es wieder zugehen, schauen wir mal, zack, zack, zack, naja, oh Leute, ich habe, ich habe, ich habe die idee, um das ganze noch deutlich schicker zu machen, pass mal auf, import, von wo müssen wir importieren, swell, transitions, muss ich mal kurz nachgucken, warte mal, doch, ist richtig, was ich mache, ist richtig, was ich mache, paid und fly, ich kann nämlich ein bisschen cheaten, ich kann nämlich einfach abgucken, warte mal, ich guck mal kurz ab, so, easy, ich guck kurz ab, das ist nicht plane yawas script, nee, nee, nee, das ist nicht plane yawas script, was, wie, warum finde ich das nicht, auf, naja, das ist doch, guck mal, und was wir jetzt machen, ist folgendes, bam, ha, äh, warum, ah, ich weiß warum, ich darf nicht hinten machen, sondern ich muss dann if drum herum machen, sonst checkt er das nicht, if, das muss da rein, weil sonst ist er zu blöd, das zu checken, ah, ok, und jetzt, jetzt sollten wir, und jetzt sollten wir massive ein fade, boah, guckt euch das mal an hier, hui, hui, hui, richtig, richtig, web 6.0, paychamp, web 11.0, guck mal, wie es reingefahren kommt, plupp, fast wie medal of honor warfighter, die gegner durch den boden, hui, das, das kann ich jetzt, ich kann jetzt den ganzen tag hier rumklicken, easy, ok, das müssen wir, null will ich da nicht stehen haben, wenn es keine description gibt, dann einfach nix, der backdrop kommt auch reingefahren, ja, da kommt alles reingefahren, der backdrop kommt reingefahren, ok, das ist tatsächlich nicht so schön, dass der backdrop reingefahren kommt, ja, das müsste man eigentlich, das müsste man eigentlich doppelt machen, man müsste eigentlich den, das rein faden lassen, auch input faden, und das andere müsste man rein fliegen lassen, geht das, geht das jetzt, dass ich so, dass ich, dass ich sowas hier mache, das wird wahrscheinlich nicht, nicht, nicht funktionieren, wenn ich hier noch ein in mach, doch, funktioniert leute, easy, ponst, alles gut, so ist gut, das ist doch auf body tag ebene, das ist das oberste hier im body tag, wo das drin ist, ja, das passt, boah, zack, also jetzt für das, dass es so schnell zusammen gewurstet ist, ich muss sagen, ich finde das erstaunlich schick, blub, blub, blub, blub, blub, nice, find ich cool, hat was, buttons für das tablet etwas größer, ja, wir können die buttons insgesamt ein bisschen größer machen, wie macht man gescheit buttons größer, so jetzt, ja, sieht das ein bisschen deplatziert aus, oder, fette, pepo fat button, so, das soll jetzt erstmal rein für die optik reichen, weil wir müssen jetzt ja noch programmieren, dass man aufnehmen kann, also, wie machen wir das denn jetzt, also, wir müssen wahrscheinlich irgendwas zum server schicken, also, keine ahnung, set timer nennen wir das mal, mir fällt nämlich gerade nichts anderes ein, epg entry, so, und jetzt müssen wir das zum server schicken, ich glaube wir haben noch keinen endpunkt auf dem server, wie man das funktioniert, kannst du den frame nicht an den text anpassen, da muss ich den text fetter machen, da ist der text ganz schön, ich lasse es jetzt erstmal so, also set timer, wait, wie könnte man das jetzt schön machen, also, was müsste man denn zum server schicken, dass der aufnehmen kann, ich glaube wir müssen das backend zuerst machen, also, wir haben ja im prinzip aktuell nur zwei endpunkte, slash epg und slash image cache, also, was brauchen wir zum aufnehmen, also, record, wir könnten das so machen, aufnehmen und dann übergeben wir die event id, fertig, wir machen ein get und wir machen ein map delete, doch die haben eine eindeutige id, so was machen wir einfach, guck mal, das müsste eigentlich passen, wir sagen hier die id aufnehmen und die id löschen, so, also, int id, was ist das hier, ok, wenn man jetzt noch richtig schreiben könnte, wäre nicht schlecht, doch wir brauchen, ne doch das brauchen wir, also int id, da haben wir das delete, machen wir mal weg, das machen wir dann später, so, ich brauche als service auf jeden fall meine api dafür, sonst funktioniert das ganze nicht, ist das denn nicht sinnvoll startzeitpunkt angeben zu können, mit dem man das planen kann, ich brauche keinen startzeitpunkt angeben, weil es gibt eine record epg event, also das habe ich hier im backend gebastelt, dass es das gibt, record epg event und was der macht unter der haube ist, der lädt sich die infos runter vor dem linux receiver was er braucht um eine epg event aufnahme zu starten, also record epg event, ulong epg event id, ja da ist halt ein ulong wenns sein muss, was ist das, warum haben die eigentlich so bescheuerte datentypen, als bräuchte man allen ernstes mehr als int max für event ids, ich mein guck mal, int max ist was für ein value, das reicht wahrscheinlich für epg einträge bis zum ende der zeit, wobei gucken wir mal, vielleicht auch gar nicht mal, jetzt haben wir hier crit, ne hab ich gar nicht jetzt drinne, vielleicht doch nicht, vielleicht ist es doch sinnvoller da 64bit zu nehmen, ja ok, geh ich mit, geh ich mit, ist in ordnung, await, async gachibas, ok, also ap record event, so da haben wir die response davon, also wenn ich das richtig mitbekommen habe und wenn ich das hier ordentlich programmiert habe, ich hab es noch nicht bekommen, bekomme ich eine timer id zurück, wenn es erfolgreich programmiert wurde, stimmt, du hast recht, youtube ist irgendwann mal übergelaufen, vor nicht allzu langer zeit, oder hat gedroht überzulaufen, irgendwie sowas, ah die views, die views, ja genau, stimmt, stimmt, ja das war's, ich überleg gerade, geb ich das einfach weiter, ne, moment, wir müssen was anderes machen, also, wir müssen gucken, ne passt, also, also, ich weiß was wir machen, es ist jetzt so, stell euch mal vor, ich mach das hier auf und drücke auf aufnahme, wie lang programmierst du schon, also angefangen hab ich mal mit, als.net, 2 oder 1.1 recht neu war, also.net framework, das alte, das uralte, 2003 oder so war das, ja davor hab ich tatsächlich mal nen paistenbuch schon gelesen, und wir haben auch in der schule ein bisschen zäh gemacht, aber das zähl ich jetzt nicht, so wirklich angefangen hab ich, hab ich hier so in dem dreh würd ich sagen, weil ich weiß noch, dass, ich überleg grad, also ich weiß noch, dass, als ich damals mit.net angefangen hab, da hatten sie ganz neue generics, und ich glaub das war mit.net 2, und das eigentliche zeug, was man überall gefunden hat, war aber noch 1.1, also irgendwie in dem dreh hier,.net 3 wer macht denn sowas, ich mein.net core 3.1 geht ja noch, aber richtig, richtiges.net 3.1 ist, oder 3 ist pains champ, wie alt ich bin, ich bin 37, man glaubt das kaum, ich sitz sonntag morgens mit 37 vorm rechner und erzähl was von massive poggers 5 hat, aber so ist das halt, mein innerer zoomer braucht das, also, was ich sagen wollte, also guckt mal, mal angenommen, man klickt jetzt hier drauf und sagt aufnehmen, dann muss ja dieser eintrag hier aktualisiert werden, wisst ihr wie ich mein, und dieser eintrag, dass der aktualisiert wird, müsste ich eigentlich, wenn die aufnahme erfolgreich programmiert wurde, ein update für diesen eintrag zurückschicken, das probier ich jetzt einfach mal, ob das funktioniert, also return a wait, von der api, gut, dass ich mir bei der tv her den api mühe gegeben hab, refresh epg event, event id, so, und da soll ich jetzt ein event zurückbekommen, wyvern sagt, ich bin seit ein paar jahren cshsoftware entwickler, aber hab noch nie webdev gemacht, sondern nur backend business domain, jetzt würd ich gerne mit webdev anfangen, eventuell sogar ein startup kunden, das ist aber mutig, nix gemacht, wobei, ganz ehrlich, wenns in die hose geht, gehts halt in die hose, würdest du empfehlen microsoft, nein, also ja, ja, ja, aber blazer nicht, blazer mag ich nicht, oder lieber javascript oder was anderes, also, was ich, also, wie gesagt, ich verdiene mit dieser sache hier nicht mein geld, hauptberuflich, aber von dem, was ich gerne verwenden würde, ja, also asp.net verwendet man nicht mehr, asp.net core ist angesagt, die benahmung, das kennst du ja als cshsoftware, die benahmung bei microsoft ist ja komplett abgefuckt, also,.net framework, dann.net core, jetzt nur noch.net, dann hast du entity framework, dann hast du entity framework core, und jetzt haben sie das core weggelassen, also, die benahmung ist ja eh komplett wirr, und asp.net ist das alte, asp.net core ist das neue, was jetzt auf.net 6 beziehungsweise.net 7 basiert, weil microsoft benahmung halt einfach für ein arsch ist, ja, also asp.net core ist richtig gut, ich finde, wenn ihr mich fragt, das beste web framework was es gibt, es hat ein paar komische designentscheidungen an manchen stellen, und, dass man mittlerweile drei, vier verschiedene möglichkeiten hat, Dinge zu machen, ist auch etwas wirr, aber im gesamtpaket für mich persönlich ist es das beste web framework was es gibt, für den frontend part nehme ich eigentlich hauptsächlich javascript, plazer mag ich gar nicht, plazer gibt es in zwei verschiedenen varianten, plazer kannst du server side machen mit irgendeiner websocket verbindung, die das dann update, oder du kannst pleading edge razor mit web assembly machen, wo es eine.net runtime im browser runter lädt, und dann kannst du quasi dein frontend in c sharp programmieren, das klingt erstmal nice, in der praxis, ich muss aber sagen, ist ein bisschen her, als ich das letzte mal ausprobiert habe, in der praxis ist das gar nicht so nice gewesen, weil die ladezeiten der seite wirklich unterirdisch waren, und die ladezeiten kommen ja noch dabei, also sprich, keine ahnung, wenn das fünf sekunden runter lädt, und die seite nochmal fünf sekunden lädt, ich meine, guck mal, meine seite braucht zum beispiel hier fünf sekunden, bis das, naja, eine sekunde, bis das überhaupt die ganzen epg daten gefetched hat, ja da kommt ja die ladezeit noch dazu von.net, da hast du sechs, sieben sekunden ladezeit, ladezeit, das kannst du vergessen, solange war doch keiner, also ich mag weder razor pages, noch blazer, noch sonstige frontend geschichten, sondern, ich benutze asp.net core eigentlich rein als backend api, endpunkt, auch mit craftql gibt es auch coole libraries für.net, und frontend sachen in javascript, du kannst mittlerweile beides halbwegs verwenden, also du kannst javascript, also der neueste trend in der frontendentwicklung ist ja, dass man client side application und server side render ring kombiniert, und da gibt es verschiedene frameworks für, ja, das gibt next und nuxt und unsweltkit und dinger, und da kannst du die seite schon vorrendern lassen auf dem server, was den vorteil hat, die seite wird deutlich schneller angezeigt auf dem client, und dann kannst du das auf dem client quasi umwandeln, nachdem man das runtergeladen hat in eine reine client side application, da hast du das beste aus beiden welten, das ist so der aktuelle trend das so zu machen, hat auch den vorteil suchmaschinen können die seiten ordentlich indizieren, weil sie eben inhalt sehen, also meine persönliche lieblingskombination aktuell ist asp.net core backend api mit entweder vue js oder neuerdings svelte, svelte finde ich richtig nice, im frontend, und ob man dann server side rendering mit dabei macht oder nicht hängt ein bisschen vom anwendungszweck ab, tja, kennst du gute tutorials und ressourcen, das kommt ganz entscheidend drauf an was man eigentlich genau verwenden will, also für vue js finde ich ist mit abstand das einfachste framework zum einsteigen, weil es vom handling her relativ easy ist, finde ich, was ist das denn, computer explodes, weil es vom handling her am intuitivsten ist, finde ich, manch einer wird sagen angular, dann musst du aber erstmal dich durch 30.000 files kämpfen, oder manch machen auch react oder sowas, aber eigentlich ist es egal, eigentlich ist es egal, ob du vue oder react oder svelte oder angular nimmst, solange du nicht angular nimmst, kannst du damit alles was anfangen, aber ich finde vue js ist zum einstieg am besten, die haben ziemlich gute offizielle docs, und zu vue js findest du auch tausende tutorials, in kombination mit dass es, wie ich finde, die einfachste synthax hat, ist es nicht schlecht, finde ich gut zum einstieg, svelte ist aber auch cool, und ansonsten, wenn du einfach nur sicher gehen willst, dass es weit verbreitet ist und du mal leute für findest und sonst was, dann eindeutig react, weil react ist das mit abstand verbreitetste von allen, ja, so würde ich das machen, ne, würde ich nicht machen, da muss ich mit express rumwursten, also ich habe mal ein tutorial gesehen für express und ich muss ehrlich sagen, da ist mir asp.net core umlängen lieber, als express, was ich da gesehen habe, aber mittwoch nvt test, was ist denn ein nvt test, nvt test, kann man danach suchen, ohne dass man monka tost wird, ok, ich hab keine, ach ist das für sprache lernen oder sowas, ach ne, netzwerk technik, netzwerk technik test, was wollen die da so wissen, monorepo ist der neue shit, ja, aber es ist jetzt nicht unbedingt, was ich so, wer weiß ich, also wie man seine repos organisiert, hat erstmal wenig mit der, welche technologie verwende ich zu tun, also es ist jetzt egal, ob er, ob er sfeld, angular, react oder sonst was nimmt und was im back end, du willst was mit maps integrationen bauen, ja, das kannst du mit so ziemlich allem machen, musst dir nur überlegen, ob es google maps sein soll oder ob sowas wie open street maps tut, open street maps tut es in der regel, aber wenn es ein bisschen mehr sein darf, gibts noch map box oder google maps, wobei google maps muss ich ehrlich sagen, wird relativ schnell teuer, ich hab ja mal was mit dem kollege programmiert, ist aus der alpha, aus der alpha phase nie rausgekommen, da haben wir was programmiert, wo man, wo handwerker, die die route besser planen können am tag, da konntest du die termine eintragen und dann hat es dir ausgerechnet quasi, wer mit welchem auto, welche route die leute am besten abfährt, und da haben wir ein open street maps routenplaner für verwendet von github, das an sich war ein cooles projekt, gerade weil das auch timeslots unterstützt hat mit pufferzeit und sowas, aber für adressvervollständigung und sowas mussten wir google maps verwenden, weil alles andere konntest du vergessen, ich hab nichts gefunden, was ansatzweise da vergleichbar wäre mit google maps und ich hab festgestellt, adressvervollständigung mit google maps ist saumäßig teuer, also das ist nicht so, dass du denkst, ah da kannst du quasi jetzt 3, 3 monat lang tippen und nee nee nee nee, das ist gar nicht, du hast 10.000 euro google rechnung gemacht, ja wunderbar, das ist ganz schön teuer adressvervollständigung mit google maps zu machen, ja klar warum nicht, kannst du machen, du kannst alles miteinander koppeln, du machst im backend ein paar api endpunkte und den disfrontend machst du rein kleinseitig, da ist es egal, du kannst auch cobol backend machen, wenn es einen gescheiten webserver für cobol gibt, das ist ja mal rundum, das kann ja alles sein und haben sich rausgeschmissen, nee oder, haben gesagt ja shit happens ja ich hab vom paisen ökosystem wenig ahnung, ok weiter gehts, so wir sind beim, also wo sind wir stehen geblieben, wir schicken jetzt was ans server, der server nimmt auf und schickt uns was zurück, also wir machen jetzt ein get request await fetch, so http doppelpunkte localhost 4500, das müssen wir übrigens auch noch überschreiben, dass es dann wenns deployed ist ordentlich funktioniert, weil dann funktioniert localhost nicht mehr, so und jetzt die id, wir hängen das einfach hintereinander, epg entry event id, ja und jetzt geben wir mal aus, ob da was ordentliches zurückkommt, schauen wir mal, backend neu starten und gucken ob das klappt, das klappt selten beim ersten, beim first try, mal gucken, also wir nehmen jetzt auf irgendwas, dass er nicht gleich anfängt hier das da, klein gegen groß, das unglaubliche duel, das wollte ich schon immer auf dem aufnahme, ah ich hab die funktion überhaupt nirgendswo eingefügt, ok, ja das sollte man vielleicht noch machen, on click, so set timer, selected epg entry, ok das da, aufnahme, was not found, wait a minute, ah record slash, ja wenn man das richtig macht, dann funktioniert es wahrscheinlich auch, so jetzt aber, bamm, alter wo ist das denn, was, aber guck mal wir haben jetzt zumindest den request, ok request, köl, was, äh ja, not authorized, ok massive password leak leute, häh, funktioniert doch, fail to fetch, häh, was ist das denn für ein schwachsinn, jetzt hats funktioniert, hm, hm, das ist ja komisch, machen die gehen und dann wieder nicht, und jetzt ist dvr state null, ist null was gutes, oh ne minute, das ist blödsinn was ich hier gemacht hab, äh wartet mal, ja das brauchen wir überhaupt nicht, ähm wollen wir was anderes, das ist das ist das falsche, das will ich gar nicht, return, jetzt muss ich ernsthaft den kram da noch mal reinschreiben, das ist doch eklig, new, epg event, muss ich wirklich den ganzen krempel hier noch mal machen, ja das ist das ist doof, da muss ich mir was anderes überlegen, wartet mal, wo mach ich denn das hier, pff, das muss ich irgendwie ausladen, guck mal ich müsste den ganzen krempel jetzt hier copy pasten von, ok wir machen das anders, wir schicken nicht das ganze event zurück, wir schicken nicht das ganze event zurück, ich habs mir anders überlegt, wir returnen einfach nur, ob dvr state jetzt auf scheduled ist, fertig, true false return, gutes verstanden, und wenn true zurück kommt dann hat das aufnehmen geklappt, true, true null w, ok gut, alles klar, wenn true zurück kommt hat das aufnehmen geklappt, das heißt wir müssen jetzt gucken beim rendern von klein gegen, das muss ich gleich suchen wenn ich refresche, das heißt jetzt sollte, jetzt sollten wir hier anzeigen, dass das schon programmiert ist, also, wie machen wir das denn jetzt schön, klein gegen groß, das ist eine unglaubliche duelle, alleine schon der titel von diesem krempel immer, also wie machen wir das denn jetzt am besten, hier ist der titel, kannst du auch einen statuscode, ja könnte ich auch, hatte ich nicht hier irgendwo dieses ding im hintergrund da, so, das heißt wenn das schon recorded ist dann machen wir sowas, also nicht überall, nicht überall, ja, if, if epg entry is scheduled und funds, postchamp, warum ist denn da so viel scheduled, ah weil die dinger schon programmiert sind, ja die guckt gerne tatort, ja das hat die wahrscheinlich wirklich programmiert, ein sommer in der toskana und tatort unklare lage, alles klar, und jetzt ist auch klein gegen groß das unglaubliche duelle programmiert, gut, sehr schön, also das funds, das funds, da sieht man was aufgenommen wird, jetzt muss natürlich aufnahmen auch wieder löschen können, gut, aufnahmen wieder löschen, machen wir hier oben, hier ist das popup, ja ja wir machen das mit aufnahmen löschen, jetzt popup, startzeit description titel, hinter den titel würde ich sagen, und auch so ein ding, jo, das man weiß das nimmt auf, ok, jetzt müssen wir nochmal eine sache testen ob das updaten klappt, also sprich ich sag ihm jetzt nehm auf set timer, records, epg entry, event id, der aufnahme button muss disabled werden, ne ne ich verwende den aufnahme button für aufnahme programmieren und löschen, das heißt wir müssen, ok, ihr habt recht, guck mal wir müssen sowas hier gucken, aufnahme, da darf nicht aufnahme rein, da muss drinnen stehen, is scheduled, und wenn ja löschen und wenn nein dann aufnahme, er steht löschen drin, nur dass er noch nix macht, wir müssen nochmal kurz gucken ob das updaten, wir machen das löschen glaube ich vorher, ok also das funktioniert, jetzt müssen wir mal gucken wenn, set timer, also jetzt müssen wir nämlich schauen wenn, wenn das programmiert ist, dann wollen wir was anderes machen, also wenn das nicht programmiert ist dann wollen wir es programmieren und wenn das programmiert ist dann wollen wir es löschen, also machen wir sowas hier nur das wir hier sagen record, das gleiche nur das wir kein get schicken sondern das wir ein delete schicken, ich glaube so macht man das mit fetch, ok wir schicken ein delete, gut geht nicht weil ist logisch haben wir noch nicht programmiert, alles klar, ok also jetzt müssen wir diesen Krempel hier machen, map delete, wir kriegen im Prinzip können wir das hier kopieren, map delete record id, passt und das hier unten können wir eigentlich genau wieder genauso machen bloß dass wir jetzt den state nicht haben wollen also wenn es nicht scheduled ist, ist true, habe ich denn schon eine api für delete event, ich habe eine für record event, habe ich eine für delete event, sieht nicht so aus, wie deleted man dann events, ok das muss ich gucken, wie deleted man, ne nicht epg, das ist wahrscheinlich bei dvr jetzt, delete gibt sowas hier, ok ne, create entry, dvr entry cancel, die id vom record, wait a minute, die id vom record habe ich im frontend aber gar nicht, alter pains champ, epg event is scheduled habe ich hier nur, ich brauche noch tja dvr, so das ist natürlich doof, wo befülle ich den kram denn, monka, so viel zeug hier, dvr, ok geben, kann optional sein, das ist richtig, das kann optional sein, das kann auch hier optional sein, alles klar, gut jetzt haben wir den state, muss ich das backend neu starten, paypo please, musik, gut, löschen, müssen wir ja, also wie kriege ich den kram denn jetzt gelöscht, ich habe die id, so, wait a minute, ich brauche die id gar nicht, ich kann mir einfach das event abrufen mit der id und dann nehme ich hier aus dem event die id, brauche ich gar nicht, das hätte ich mir ersparen können was ich eben gemacht habe, record, und jetzt brauche ich noch was um records zu löschen, also so funktioniert das, gut, das heißt wir kopieren uns diesen krample record event und nennen es irgendwie delete, irgendwie sowas, timer, nennen wir das mal eher delete timer, weil wenn ich das mit dem epg event mache, dann muss ich das auch nicht hier drinnen machen, sondern kann das direkt, refresh epg event, schauen ob das irgendwie Sinn ergibt was ich da mache, event id, so also den krample brauchen wir auf jeden fall nicht mehr, den brauchen wir auch nicht mehr, ja das hier ist epg event, so und jetzt soll das löschen, löschen funktioniert mit dvr entry cancel, also dvr entry cancel, und zwar mit parametern, die id vom event, ne nicht vom event, vom, also wirklich konsistent ist die benahmung bei denen auch nicht, wieso das ist doch gar nicht, sieht doch eigentlich ganz gut aus, so und jetzt müssen wir hoffen dass es das gibt, so event id brauchen wir nicht, dvr create response, ja was kriegen wir hier überhaupt für ne response, keine ahnung, müssen wir mal ausprobieren, weiß ich doch nicht, was kriegt man da für ne response wenns funktioniert hat, ja, zack, also jetzt machen wir mal, und 1234 was es definitiv nicht gibt, not found, muss das ein post sein, ok das ist aber auch hardcore inkonsistent alter, warum muss das beim create und get sein und beim löschen ein post, was ist denn das für ein blödsinn, wer hat sich das ausgedacht da, bei tvheadend, ok also es muss ein post, ne, post async sein, receive, was auch immer, so und wie sieht das reply aus, wenn man, das ist keine ahnung was das sein soll, irgendwas was noch nicht mal eine offizielle doku hat, so jetzt brauchen wir nochmal, Leute ich brauch mal die event id von dem ding, epg entry, oh ich muss die klima an machen, viel zu warm, so dot net, hier event id, dvr event, komm hier lass dich markieren, was passiert wenn wir das jetzt löschen, was passiert wenn wir das hier löschen, also so, empty reply, na geil, ist immer, moment da muss ich jetzt vielleicht den get machen, kriege ich nie den reply, vielleicht ist es jetzt schon weg, ne, hm, nochmal ein telit, ich bezweifle, dass das was bringt, ok, wir googeln mal wie das andere machen, ok da gibt es kein beispiel für, hm, wie kriegen wir das gelöscht gescheit, ich würde fast sagen das geht so, muss man das vielleicht ul encode, Leute kann das sein, dass das irgendwie nicht funktioniert, ist hier bestimmt ein get, dvr, not found, warum ist das not found, da gibt es auch gar keinen sinn dass das not found ist, ap dvr, entry cancel, duu id, ach moment, das muss ein fragezeichen sein, das muss ein fragezeichen sein Leute, meine sündag stimmt nicht, erik danke für den sub, grepp.app, was soll ich damit machen, ne das bringt nichts, jetzt wird es wahrscheinlich funktionieren, ah, ok gut, jetzt funktioniert es auch, also empty, empty reply, ok, na gut, dann kann ich damit nichts anfangen, also delete timer epg event, alles klar, so blablub, dann stimmt das ja was ich mache hier, das ist eigentlich alles gut so, so nur dass ich eigentlich gar nichts receive ehrlich gesagt, weil es gibt nichts zu receiveen und auch nichts zu return, das klappt einfach, wenn man glück hat oder wenn man pech hat dann klappt es halt nicht, so, das brauchen wir nicht, wir brauchen einfach nur record, delete, so, tja, das ist ziemlich ja müll dass da nichts returned wird, jetzt muss ich den kram tatsächlich nochmal abfragen und gucken ob es jetzt richtig ist, das ist ok, das ist eine äußerst ineffiziente möglichkeit das zu machen, aber ok, tja, ok, dann machen wir es so, das heißt ich frage das jetzt doppelt und dreifach ab, einmal vorher, einmal zum deleting und dann danach, nice, ok, brauche mal drei requests anstatt von einem, soll mir recht sein, ok, alles klar, das heißt jetzt sollten wir da true zurück bekommen wenn es gelöscht wurde, true 0w bekommen wir zurück, löschen, warum, bad request, post, ah, Moment, es darf ja gar kein post sein, ich dachte ja nur es muss ein post sein, es ist gar kein post, es ist ein get, einfach ein ganz normaler get, ok, meine Güte, was ein, oh alter, get, api, warum, 400, why, 400, was willst du von mir, weshalb, get, das ist doch richtig, api, dvr, entry, cancel, ach da hat jetzt gecancelt oder was, wait a minute, jetzt, was ist das denn, 400, cancel, warum ruft der jetzt cancel auf, der soll nicht cancel aufrufen, was, ok, Moment, jetzt pflege ich den mal durch, scale is false, warum ruft der denn noch, hä, Leute irgendwie check ich das gerade nicht, jetzt hat es funktioniert, eben vorher gab es noch einen Error, da kann auch was nicht, das ist auch richtig, warum gab es da vorhin einen Error, und jetzt geht es wieder, irgendwie ist das pains champ, du hast wahrscheinlich better twitch tv nicht installiert, ok, das funktioniert, refresh, also das delete, das delete, nee, ich bekomme anfälle hier, was ist denn das, so schwer kann es doch nicht sein, Leute ich programmier jetzt was anderes, was näher an der aktuellen zeit liegt, so, der camping check, aufnahme, warum, wo ist das problem, warum kackt der camping check ab, und beim zweiten mal geht der request, das verstehe ich nicht, was ist denn das für ein blödsinn, warum geht der immer einmal kaputt, so löschen hat funktioniert, und es ist nicht gelöscht, was, irgendwas ist gerade richtig, richtig verkehrt, ja, das ist das richtige, ich meine es gibt nur ein delete, und ich habe keine daten drin stehen, jetzt ist der camping check weg, ok, das muss wir anders machen, ok, wo kann das denn jetzt großartig schief gehen, wir machen noch was anderes, also, Moment, ist das überhaupt, also wenn das funktioniert, dann sagen wir selected is scheduled gleich true, so, und hier unten gleich false, weil das dann weg sein soll, so, von der Idee her, wenn ich den kram jetzt, what the fuck, ok, ich brauch debug ausgabe auf dem server, ist ja irgendwie der meinung, er kann irgendwas hier nicht serialisieren oder so, und löschen tut das auch nicht, was zum, ich guck, was ist das denn, nee, nee, selected ist richtig, achso, äh, eigentlich nicht, weil das genau das gleiche ist, eigentlich nicht, das müsste genau das gleiche sein, aber man weiß ja nie, so, jetzt brauchen wir noch kurz ein bisschen, ein bisschen debug ausgabe, was ist denn hier los, wo kann dann hier was, also der kackt schon beim aufnehmen ab, so, wenn man den camping check programmieren will, ich meine, großartig was verkehrt sein kann er hier nicht, doch ich kann breakpoint setzen, aber ich weiß gar nicht genau wo ehrlich gesagt, also, record event, gutes printf debugging, so, ich hab keine, also Moment, Moment, das brauchen wir ja gar nicht, ähm, wir brauchen was der, was der hier macht, also wo er abkackt, müssten wir ja schon mal wissen, ich klaue der kackt ab beim recording request aufnahme, bäm, kaputt, weil, beim recording request kackt der ab, hier, create event, event id, das mag er nicht, response could not be deserialized, interessant, so, wenn ichs von hand mache, wenn ich das von hand mache, jaja unauthorized is ok, wat, ok, wenn ichs von hand mache funktioniert das, delete, nein, nein, nein, delete, so, jetzt löschen wirs wieder und da kackts ja auch ab einmal, hm, ey, der kühler, das ist doch das was ich eben ausgefüllt hab vorhand, ich blick nicht mehr durch, ist das ding jetzt eigentlich programmiert oder nicht der camping check, jetzt hab ichs komplett gekillt, was ist denn jetzt mit dem camping check, der camping check ist immer noch programmiert, ok, also, der camping check hatte irgendwie diese, diese id da, warum geht denn das scheiß net, was ist das denn, ok, crit, so, was hat denn der camping check bitteschön für, für eine id, das da, ok, moment, wo ist der Unterschied zu, ah ich hab das falsche vorhin ausgefüllt, ok, also, muss man vielleicht warten, weil es ne weile braucht bis das anfängt, ok, also das funktioniert ja im prinzip, ok, ok, es kommt nen 404, wenn er, ok, das ist, das ist weird, weird, weirdchamperapi, aber ok, so, der camping check, ich hab, ich hab die aufnahme grade gelöscht, ach ich weiß, glaube ich, woran es liegt, der refresh doch nur alle 30 sekunden, ich muss irgendwie nen refresh triggern, wenn das, jaja ok, ok, ich glaub, ich glaub jetzt weiß ich, ja, was aber an der stelle zumindest funktionieren sollte, so, log, so, epg entry, gucken was da zurückkommt, so, jetzt kackt er immer ab am anfang, und warum, immer wenn ich das erste mal programmiere kackt das, kackt er ab, und zwar weil er sagt, dass er das jason nicht irgendwie serialisieren kann, ich mach jetzt buyer shark an, keine ahnung was er für schmerzen hat, bam, sack, aufnahme, gecrashed, ok, so, ist wieder der meinung, dass es hier aus irgendwelchen gründen not serialized werden kann, destination, da, ja, oder was macht der da alles, irgendwo am ende sein, hier, grid, wo ist denn der request, wo ist denn der request, warum fragt er diesen kram eigentlich so oft ab, content type list, das sollte er doch nur einmal machen, was fragt er denn da 30 milliarden mal ab, ganz, ganz schön, ach nee, der fragt jeden channel ab, ok, ok, verstehe, ok, follow, ok, ich muss things, nee, nee, nicht delete, create suchen, hier, create event, ach, das ist ein array, das ist weil man mehrere theoretisch programmiert, das ist ein array, ja, kein wunder, dass er das nicht serialisieren kann, ja, ok, dann, damit hätte sich das an der stelle schon mal erledigt, warum das nicht funktioniert, das funktioniert nicht, weil das kein string ist, sondern ein array, tja, nice, warum es beim zweiten anlauf geht, beim zweiten anlauf funktioniert es, weil die response leer ist, und die response ist leer, dementsprechend versucht er da nichts reinzuschreiben, ok, das muss ich nicht, das muss ich doch hier nicht returnen, ja, meinetwegen, ok, das ist, das ist ein array, alles klar, meine Güte, wie soll er da drauf kommen, ok, der Rest ist ja davon nicht betroffen, ok, den, den part, den part hätten wir schon mal, das heißt im endeffekt, das, das müsste jetzt, das müsste jetzt funktionieren, das recording müsste ohne probleme funktionieren, moment, ich muss den camping check, ich muss den camping check gerade nochmal von hand löschen, das hier der camping check, ach, keine ahnung, ach, die haben auch immer andere ids jetzt logischerweise, löschen, oh, das löschen hat direkt funktioniert, ok, ok, das ist auch noch blöd, der refresht ja nur alle 30 sekunden seinen datenbestand, dementsprechend, der hat jetzt den camping check gelöscht, aber wenn uns refresht, ist der camping check für 30 sekunden noch drin, das heißt ich brauch auf jeden fall hier irgendwie noch was, refresh, epg, so, da muss mir noch was überlegen, der gesamte epg muss da refreshed werden, oder zumindest das eine event, alles klar, so, das sollte jetzt ohne probleme funktionieren, der camping check, ich werde den jetzt aufnehmen, ach so, moment, das ist ja blöd, ich muss die response, ja, das erklärt auch warum der kram kaputt geht, weil es 30 sekunden verzögert ist, aber das hier sollte der eigentlich checken, ok, wartet mal, das, das müssen wir jetzt mal checken, warum das nicht funktioniert, was der für schmerzen hat, so, camping check, so, löschen, ja, ich weiß, ist gut, already red, ach so, hier, weil hier das delete ist, ist auch falsch rum, meine güde, so, also jetzt, jetzt, jetzt funktioniert es wahrscheinlich, ich muss wissen, was da Sache ist an der Stelle, ok, camping check, aufnahme, true, es wäre schön, wenn da true drinne steht, und warum setzt der da nicht, ist scheduled auf true, was ist das, wird das hier ausgeführt, wird das hier ausgeführt, oder ist das irgendwie nicht reactive beim updaten, ich dreh hier, ich dreh echt am rad noch, löschen, ok, wenigstens das funktioniert ohne Fehler, jetzt muss man warten, bis der camping check wieder entfernt ist, ja, das mit dem, ich muss irgendwie gucken, dass ich den manuell noch refreshen kann, ok, ja, das interessiert ihn einfach nicht, das interessiert ihn einfach nicht, na geil, das aus irgendwelchen Gründen nicht reactive, da hab ich jetzt gar keinen Bock drauf, warum checkt ihr das nicht, ich mein, wo ist das Problem, ok, das müssen wir, das müssen wir jetzt mal nachstellen, in irgendwie etwas einfacherer Variante, ja, ohne, ohne diese ganzen requests und so zu verschicken, set timer, wir testen, wir testen das jetzt, wir testen das jetzt ohne, ohne requests, ich weiß nicht, warum er das nicht macht, eklig, ok, also, if, ich kann mich nicht mehr konzentrieren, was wollte ich jetzt machen, dass der Kram, normalerweise sollte er das von alleine checken, zeig mal, wie es der timer aufgerufen wird, so, wartet mal, wartet mal, ich, ich mach es jetzt so, wenn ich auf den button drücke, naja, ist not defined und so, also, ich mach es jetzt so, wenn ich auf den button drücke, ist things, dann sagen wir einfach hier, is, is false und dann, dann sollte das einfach immer switchen jetzt, ok, das juckt den gar nicht, w-wait a minute, w-warum juckt den das nicht, moment, das ist, hä, breakpoints calculate, warum juckt den das nicht, w-warum interessiert den das nicht, wenn das, das ist das gleiche, selected und das da, ich kanns mal ausprobieren, ja, so mach ich das, das ist doch genau das gleiche, alter, so, was man daran jetzt auch noch sieht, ist bei der Aufnahme, bei der Aufnahme müsste es eine feste Breite haben, ich übergebe das hier, das ist genau das gleiche, boah, was ein ekliger Kram, so, dass der löschen Knopf kriegt, wird genauso fett, alter, p-pro-fett, ok, wunderbar, ok, gut, gut, da kann ich mit dem, dann kommentieren wir das alles mal wieder ein, zack, if, zack, oh, ok, ok, ok, ok, ok, gut, ok, jetzt sollte das funktionieren, weiß nicht, war, ich weiß nicht, was er für Schmerzen hatte, löschen, bam, weg ist es, aufnehmen, jawohl, löschen, nice, so muss das sein, so, jetzt muss ich noch gucken wie ich den Kram, guck, wenn ich jetzt nämlich, Ja das funktioniert jetzt nicht, weil es ist eigentlich schon gelöscht und der Refresh ist bloß nicht schnell genug, wie kann ich beim Backend beibringen, dass das jetzt instant Refreshen soll, weil das Refreshen funktioniert bei mir ja automatisch auf einem Timer von 30 Sekunden. Und das funktioniert hier drüber, boah da fällt mir jetzt grad nichts gescheites ein. Ich könnte, ja ich müsste dem Ding, ich müsste dem irgendwie Bescheid sagen, so nach dem Motto Hallo guck mal, das ist jetzt bitte neu Fetschen. Aber ich will jetzt da keine Message Queue oder sonstigen Krämpel, ja Refresh Event, das ist alles, hast schon Overkill dafür, vielleicht fällt mir, ja weil das hier will ich das Copy Paste, ich bestimmt nicht alles, was ich zum Refreshen machen muss, ja ich muss gucken, dass keine Sachen Lücken haben, dann muss ich das neu zuordnen, die Uhrzeit setzen und sowas, das mach ich bestimmt nicht alles doppelt und dreifach. Den Timer, nee den Timer kann ich noch nur, der Zertimer ist das, ich müsste, ich müsste quasi sowas, ich müsste irgendwie sowas machen wie Wait und dann könnte ich ihm sagen, wie ich mein, naja, ja doch wir könnten, wir könnten sowas machen, irgendwie keine Public Trigger, Refresh, irgendwie sowas, machen wir das jetzt irgendwie schön, Trigger Refresh, ja so was in der Richtung, theoretisch, nee nicht stoppen und wieder starten, also ich müsste sowas hier machen, so nicht, dass das jetzt Hardcoded Task Delay ist, sondern ich müsste ihm jetzt irgendwie sagen, oh da bin ich aber gerade zu Low IQ für, das, das ist, nee das ist Hackfond, was ich verwende, ja in dem Reset Event an sich, ich brauch ja jetzt bei das, ich brauch ja einmal den normalen Timer oder es wird resettet, ich muss den Timer cancelen, das ist alles, alles in Anführungenstrichen, ich muss den Timer cancelen, ja das reicht doch, ich muss den Timer cancelen, damit man Timer cancelen kann muss man den da rein schmeißen, ja oder Kangin, wie meinst du das, ach wobei das Reset Event kann ein Timeout haben gell, kannst du dem ein Timeout geben, wenn es nicht auftritt dann geht das, kannst du dem ein Timeout, wie, ähm, Timeout, Auto Reset Event, Timeout, ach so geht das, ok, wait und dann Timeout, aha, aha, ok, dann ist es tatsächlich gar nicht so schwierig, dann brauchen wir sowas hier, Reset Event, alter, lul, können wir auch slim nehmen, was ist eigentlich der Unterschied zwischen slim und not, not slim, weird champ, so tauschen wir das aus, wait, Reset, Reset Event, äh, Timeout Milliseconds 3000, so, so müsste das funktionieren, Refactor Reset, so, wenn ich das jetzt richtig gemacht habe, Digger Refresh, sag ich jetzt Reset Event, Reset oder Reset, funktioniert das so, verwende das nicht so oft, das müsste doch jetzt funktionieren, also, der geht hier rein, der geht rein, wartet 30 Sekunden, außer ich sag Digger Refresh, oder, wie wärs mit, nee, nee, nee, kein Sus, Sass, testen wir mal, ob's funktioniert, ähm, Programm, jetzt brauch ich diesen Krempel hier noch, ja fast mehr Dependency Injection, wie wenn ich alles global gemacht hätte, ups, äh, was hab ich denn hier gemacht, so, wunderbar, auch mal hier, so, EPG, Digger Refresh, ok, schauen wir mal, ob's funktioniert, ich bin gespannt, naja, das war mal zu, Quid, ok, schauen wir mal, ob's geht, zack, ok, das funktioniert schon mal, Aufnahme, schließen, funktioniert auch, ich müsste reinschreiben, ob er reloadet, und, und, und, und, alter, was mach ich falsch, der sollte eigentlich refreshen, ach, Moment, ich noob, ich muss den Refresh beim Delete auch reinmachen, so, jaja, ok, ok, ok, ok, ok, ok, ok, ok, ok, ah, ok, ne, gut, er ist nicht so schnell im refreshen, n, was zum... Warum klappt das nicht? Ich hab Aufnahme gedrückt, nicht Delete. Achso. Das kann schon sein, dass der 2-3 Sekunden braucht zum Refreshen. Doch, doch, ich glaube das funktioniert, 30 Sekunden sind das nicht. Das ist einfach halt asynchron, guck Aufnahme, 1, 2, 3, 4, 5, Refresh, fuck, ah Moment, ist doch richtig. So, löschen, 1, 2, 3, 4, 5, ja es funktioniert, es funktioniert, Problem ist nur, das Refresh, der Refresh dauert halt ein bisschen. Der Refresh ist halt nicht instant, der Refresh dauert, wir können mal gucken wie lange der Refresh braucht, ein Refresh braucht, probieren wir aus, sag ich euch, ich hab schon ein slimes Event, so ein Refresh braucht, stopwatch, start new, elapsed milliseconds, so ich sag euch wie lange ein Refresh braucht, das ist absolut nicht optimiert was ich da gebaut hab, ne Sekunde, das kann sein Leute, der Refresh dauert eine Sekunde, ungefähr. Ah Moment, jetzt hab ich ja kein stopp Event mehr, kann man das, kann das Ding cancelation talking support, ah exellent, ok gut, ok es dauert, es dauert eine Sekunde zu Refreshen, deswegen ist das, wenn ich in der Zwischenzeit Refresh hab das nicht kapiert, das ist aber auch ok, mein, was willst du machen, das ist halt, Sekunde asynchron, jetzt funktioniert es ja, ja, würde es nicht schneller gehen, wenn du nur den einen Channel nachlädst, doch mit Sicherheit, aber das Problem ist, mein Fetch-EPG macht halt immer alles, und dann müsste ich das jetzt irgendwie einprogrammieren, dass er nur einen Channel Refresht, ja, jaja, du hast recht, Refresh one channel only, ja keine Ahnung, da müsste ich mir was überlegen, ja, da müsste man das ein bisschen umstricken, dass es einzeln, dass das einzeln geht, da müsste ich irgendwie mal Refresh Channel, und dann, ich mein, ja, da müsste ich mir, man könnte jetzt auch irgendwie ein concurrent dictionary reinhauen, und dann würde ich es hier oben einfach, ja, irgendwie so, denke, denke, da fällt mir schon noch was ein, aber das ist schon erstmal in Ordnung, ist die EPG Ansicht Final, na, Final ist hier nichts, aber zumindest an sich funktioniert es jetzt, so, wir können sagen, ich will regionale Küche ist Sus aus der Wetterau aufnehmen, Bäm, zack, ah super, jetzt sehe ich es aber nicht an der Stelle, löschen, wo sehe ich denn hier was, wo passt denn hier rein, wo haben wir denn hier, hier ein seltsames Paar, das wollte ich schon immer mal aufnehmen, Aufnahme, Schließen, aha, ok, gut, gut, sehr schön, sehr gut, exellent, Trigger Refresh ist hier, ok, das klappt, ja, da bin ich eigentlich ganz zufrieden so, man, das kann man ja erstmal denke ich ganz gut verwenden jetzt, jetzt müssen wir noch was testen, jetzt bin ich mal gespannt, läuft der Kram auf meinem Linux Receiver, ich meine, dass man hier noch einiges, man kann das schon noch durch, durch das deutlich schöner machen und sicherlich auch performanter an vielen Stellen, also zum Beispiel, wie das hier im Hintergrund mit dem Refresh funktioniert, ich dachte erst, es ist eine gute Idee, einfach hier Hardcoded einen Timer laufen zu lassen mit 30 Sekunden Refresh, aber es wäre wahrscheinlich besser, ich habe einen Timer und ich habe die Möglichkeit, den Refresh ohne hier diese Umwege anzustoßen, ich meine, ein Vorteil hat es, ja, das hier ist Threadsafe, wenn ich jetzt hier direkt was updaten würde drin und wenn würde dann beide, würden hier drauf zugreifen, das wird ein bisschen schwierig, ja, also so ist es auf jeden Fall Threadsafe, weil das immer nur an dieser Stelle aktualisiert wird, das einzige, was wir machen, ist halt das Aktualisieren vorziehen und wir lesen an vielen Stellen daraus, aber wir schreiben nur an einer Stelle da rein und wie wir alle wissen, solange man nur an einer Stelle schreibt und an mehreren Stellen liest, es ist eigentlich so gut wie immer Threadsafe, problematisch wird es eigentlich nur, wenn man an mehreren Stellen schreibt, also nein, wenn man in unterschiedlichen Threads schreibt, dann gibt es Probleme, ja und wir könnten es definitiv schneller machen, wenn man den hier ein Channel Refreshen lassen würde, ich meine, das wäre gar nicht so super kompliziert, man müsste, man müsste es so machen, wobei, nein, so einfach ist es nicht, ich kann ja hier nichts übertragen, ja, Set, ich kann hier nur sagen, laufen oder blocken, ich müsste es auf jeden Fall anders bauen, ich müsste das hier, das hier müsste ein Concurrent Dictionary werden, dass es Threadsafe ist, falls ich mal zufälligerweise hier Refreshe, während ich hier auch gerade ein Update Trigger, und dann müsste ich dieses Fetch-EPG auseinanderwurschteln zu einem Fetch-Channel, ja, das müsste funktionieren, ja, also nicht alles aktualisieren, sondern nur den Channel, Channel UUID, ja, das würde funktionieren, iPeppeRS, Dankeschön, ist RS für, bist du Rust-Programmierer, ein, ein, wie nennen sich, wie nennen sich die Rust-Leute nochmal, die nennen sich doch noch dieser komischen Krabbe, ich komm nicht drauf, Rust-Programmierer nennen sich irgendwie so speziell, Rust-Dashens, Rust-Dashens, irgendwie sowas, ja, nach dieser komischen Krabbe, hier, Rust-Crap, dem Ding, ja, nein, nicht Larry the Lobster, nach dieser Krabbe, so, ok, wir testen jetzt mal, ob das auf meinem Linux-Receiver läuft, also, da, was ist denn das hier, ah, das ist mein, oh fuck, der refresht viel zu schnell, ähm, warum, Moment, ok, ok, ok, äh, der resetet sich nicht wieder, w-wait a minute, muss ich, muss ich irgendwie hier sagen, reset oder so, muss ich am Anfang resetten, also sowas hier machen, mit Task verwendet man diesen oldschool Krabbe sowieso selten, ok, ah ja, ok, nice, funktioniert, alles klar, Auto Reset Event macht das, dann wollen wir ein Auto Reset Event haben, Auto Reset Event, beste, new, initial state, true, äh, false, oder, wir wollen nicht, nicht, nicht signet anfangen, äh, Moment, dem kann man kein, kein Cancellation Topen geben, warum nicht, äh, das ist doch doof, ich brauch beides, ich brauch Cancellation Topen und, und mein Timeout, ja, dann lass ich's jetzt einfach so, fertig, so ist gut, passt, TV Headend User Statistiken, man braucht Series, streamst du damit an 50 Leute oder wie, also ich hab, drei, ich stream vom PC, ich stream vielleicht am Fernseher, ich stream vielleicht im Erdgeschoss, also im Prinzip an drei Statistiken, was, was, was, User Statistiken, da wäre ich noch nie drauf gekommen, dass man, äh, für was, also was machst du damit, dass du User Statistiken haben willst, die ganze Familie auch extern, ach so, ja, ist die Frage, wie man das abrufen kann, ok, exzellent, so, das funktioniert, jetzt müssen wir gucken, ob dieser Krempel läuft, by the way, wir machen tatsächlich mal Debug Ausgabe, hab ich, jawoll, in Farbe, in Farbe, weil's so schön ist, Mark-Appline, weil's, weil's so schön ist, Blue, äh, EPG Refreshed, ich bin mir nicht sicher, ob ich richtig, richtig gemacht hab, von der Syntax, ey, es ist der EPG Refresh in Blau, Massive, Augen, mach, machst du Auge, gut, ok, wir kompilieren den Krempel und schieben's auf meinen TV-Header drauf, auf meinen, äh, Linux-Resiever, gucken, ob das funktioniert, äh, Publish,.NET Publish Configuration, Linux-Arm, Self-Contained-Build, R-Sync, lustigerweise ist es 2.129, 2.129, der ADC-Champ, null, ok, ich will es aber nicht als Build haben, ähm, warte mal, sondern, ähm, der Zielordner soll heißen, EPG-Champ, und auch nicht Pi-Add, sondern Root-Add, so, äh, funktioniert das jetzt, ja, wahrscheinlich, nein, warum, weil, ok, gut, dann loggen wir uns mal da drauf ein, Root-Add, nee, war ich dann nie drauf eingeloggt hier, auf welcher Kiste läuft mein TV-Header auf dem Ding, so ein Linux-Receiver mit 8-fach Tuner, so, deswegen wollte ich es nicht nach Bild kopieren, weil ich hier testweise schon mal was anderes mal drauf kopiert habe, ok, EPG-Champ, EPG-Champ, Team Accession starten, Bild, Backend, BÄM, und, das startet, easy, funktioniert einfach, wisst ihr mal, Massive-Portables.net hier, fast so gut wie Go, was das angeht mittlerweile, nicht wirklich, also Go ist was, ähm, statische Binaries angeht, nochmal eine ganze Ecke besser, wie viel CPU-Kerne hat das Ding auch, doch so viel, 2 RAM, viel RAM hat das ja auch nicht gerade, oder? Achso, mir fällt gerade ein, das ist jetzt blöd gewesen, wir können das gar nicht ausführen auf der Kiste, weil, also noch nicht, weil die Web-Anwendung ja überhaupt nicht dafür ausgelegt ist, guckt mal, die Web-Anwendung geht überall Hardcoded, Hardcoded auf Localhost 4500, das kann nicht funktionieren, Localhost, das haben wir an drei Stellen, nee, Moment, eins, zwei, drei, vier Stellen, wie macht man denn sowas jetzt eigentlich, hm, wie, wie macht man, wie macht man einen guten Schalter, ob es lokal läuft oder, oder deploit auf dem Server, wie, da hab ich jetzt eine gute, wie macht man das schön, ähm, Host und Port-Variabel, ich hätte jetzt Host und Port gecheckt, also mein Lokal läuft ja auf Port 3000, ENF, aber Environment, wie soll ich denn im Frontend in meinem Browser auf Environment-Variablen zugreifen, die auf dem Server sind, das geht ja nicht, ok, wir müssen zwei Sachen machen, wir müssen statisch Svelte Static Adapter brauchen wir, wir müssen erstmal Svelte bilden überhaupt, ansonsten funktioniert es nicht, Static, ja, Adapter Static brauchen wir, das ist irgendwie das Svelte-Config, Adapter Static und das muss man irgendwie auch installieren noch, NPM install, gut, und jetzt NPM build glaube ich NPM build, ist das NPM build, nein, ähm, Moment, Svelte, NPM run build, NPM run build, was vielleicht, das schon besser, äh, und hier drunter liegt es jetzt wahrscheinlich, oder, Svelte-Kit, äh, Bild, Index, nee, äh, Output, Server, Monkeys, was davon, was davon brauche ich jetzt eigentlich, nochmal löschen, wie macht man das jetzt eigentlich, das, und ich muss auch in der.NET Anwendung einstellen, dass ich den Kram ausliefern will, haben wir noch gar nicht gemacht, www root Verzeichnis, da muss es nämlich rein, da muss die Web Anwendung rein, im Ende, hier ist ein Bild, ach, hier ist ein Bild Ordner, oh, was habe ich denn gerade da gelöscht, Leute, ich habe gerade ein.Svelte-Kit Ordner gelöscht, war das eine gute Idee, aber wahrscheinlich ist nichts kaputt gegangen, das Java-Skript, da kann man die Hälfte löschen und das macht nichts, ok, CP, Bild, oder, äh, Sternchen, nach Big End, www root, ok, Run, so, von der Idee her sollte ich jetzt zumindest den Kram aufrufen können, direkt von, von.NET aus, also, Local Host 4500, das sieht gut aus, das sieht gut aus, ok, das funktioniert prinzipiell schon mal, Alter, das lag im Firefox, guck mal hier, der Firefox kann die Animation nicht, seht ihr das, keck weh, die Animation ist im Firefox, geht einfach nicht, warum, liegt das am Dark Reader, off, ah, ne, die, what the fuck, Leute, die Animation geht nur einmalig, das ist ein Bug im Firefox, oder, das ist mega laggy, das Ding im Firefox mit der Animation, ich mein, viel anders kann ich jetzt nicht machen, also, oh ne, ich muss npm install nochmal raushauen, npm install, ich bin mir nicht so, ich bin mir nicht sicher, ob das so eine gute Idee war, den SvelteKit Ordner zu löschen, Trash, Restore, SvelteKit, lieber mal wieder hin machen, ne, ja, da ist schon übrigens am rumspatten, ok, ne, Moment, Moment, Moment, Zack, schauen die Konsole, ob's Exceptions gibt, gute Idee, nö, es buggt einfach nur in es langsam, wie Sau, ok, wisst ihr was, ganz einfach, Fly, Zack, alles geht hier hin, Scheiß auf Animation, kommt jetzt weg, und hier mal wieder, Class, Hidden, gleich, Not, ah, weg damit, Pot, was ist das, Brüschl Studio hat gefailt beim Laden, alles klar, ok, Build, also im Prinzip wollen wir ja sowas hier machen, nach jedem, nach jedem Build, Build, Run, Build, und dann das, ok, hier ist jetzt die aktualisierte Anwendung drin, alles klar, und Run, startet, gucken, ob's jetzt schneller geht, hallo, wie's, oh ne, hab ich's jetzt kaputt gemacht, alter, mein einer Edit hat irgendwas zerstört jetzt, was hab ich denn jetzt kaputt gemacht, hab ich, was war das, Quoten, ne, was hab ich denn jetzt, irgendwas hab ich jetzt zerstört, Klassiker, ja, ok, Run, Open, ok, es ist dem Chrome auch kaputt, das ist schon mal gut zu wissen, Cannot Read, ah, ich weiß woran's liegt, guck mal, ich greif hier auf Dinge zu, die's, die's gar nicht gibt, wenn es das, das ist natürlich blöd von mir, ok, gut, so, Fixed, so wunderbar, jetzt müssen wir die Seite irgendwie noch Fit machen, das Local Host muss raus, Leute, mir fällt, mir fällt nix gescheites ein, wenn ihr eine bessere Idee habt, die ganzen JavaScript File Fats, sagt's mir, man könnte, man könnte doch sowas hier checken, schau dir mal das hier an, ok, zeig mal, how do I include details from in my application, import, Read, File, Sync, ne, das ist Server-Side-Rendering-Campel, Import, Meta, Env, Backend, Path, ja, aber wo soll ich in meinem Frontend dann irgendwelche Environment Variablen herkriegen? Achso, das compilte er mir da rein oder was, oder wie, also, aber, ok, ok, ok, ok, ok, aber, wo setze ich das denn jetzt, also sprich, bei einem Bild, bei einem Bild erkennt er es jetzt quasi in Production Mode, oder wie, und woher weiß der, dass er bei einem Run was anderes in die Variable rein schreiben muss als mit einem Bild, aber ich mache hier ein Static-Bild, ne, also ich mache ein Static-Bild, das ist dann einmalig rein gebacken, ist das, also müsste ich dann quasi sowas hier machen, also ich sag ihm dann quasi im Endeffekt Export, Wide, Underscore, sowas, sowas, also quasi irgendwie Wide, Env, oder sag ich irgendwie die Prot, oder sowas, und dann mach ich ein Bild, und wenn ich das jetzt im Browser aufrufe, ist es, ist es, ähm, drinnen oder was, ne, wobei ich könnte eigentlich auch so machen, ne, so, ok, das muss ich jetzt ausprobieren, das, das, das stellen wir jetzt, ok, ähm, machen wir hier rein, Lock, und wie greife ich dann drauf zu, so, you can access the variable using Import-Meter, ok, also im Prinzip würde ich jetzt sowas hier machen, Lock, Lock, Env, sowas da, oder, seh ich das richtig, und dann, da würde jetzt Port rauskommen, wenn ich, wenn ich das bilde, da bin ich ja mal gespannt, ob das funzt, Pog, das ist ja gut, das wusste ich nicht, ok, das ist nice, das ist nice, da kann ich jetzt nämlich checken, das finde ich gut, da wird ja was gelernt, Chat, das finde ich gut, das heißt jetzt kann ich hier nämlich checken, im Endeffekt, sagen wir mal irgendwie, let url gleich, so, dann checken wir das, gleich, gleich, Prot, so, wenn das so ist, dann ist es einfach nur ein Slash, und wenn das das nicht ist, dann ist es Localhost 45000, das müsste doch eigentlich funktionieren, was ich hier mache, und jetzt sage ich an der Stelle, url plus epg, bin ich mal gespannt, ob das tut, du kannst ins Welt direkt checken, ob es in Prot läuft, und wie, das wäre natürlich noch besser, aber so müsste es auch funktionieren, was mache ich denn hier an der Stelle, so, jetzt müsste es gehen, Import, Meta, Enf, ach ich muss das gar nicht setzen, ich kann einfach sagen, Import, Meta, Enf, Prot, also so quasi dann, das werden wir jetzt gleich sehen, ob das funktioniert, da brauche ich den Kram ja auch nicht setzen, schau mal mal, ne, oder, ach hier habe ich einen Slash hinten dran, und sonst nicht, hier habe ich den von Slash dran, ich darf da auch keinen Slash hinten dran machen, ich kann, ja das ist jetzt, da gibt es mit einer globalen Variable, fände ich das schöner so, ach, ok, das ist auch nicht verkehrt, lull, ja ok, ich teste es jetzt erstmal so, ob das funzt, was der Chat geschrieben hat, aber das scheint auch zu funktionieren Leute, wobei Local Host ist in dem Fall immer Local Host, ok, wir deployen das mal und gucken, ob es funktioniert, also Build, ne Publish, Release, EpgChamp, ok zack, EpgChamp, Build, Backend, ach ne jetzt läuft es ja Local Host, ah was war das, ASP.NET, Ural, Export, dass man dem sagen kann, irgendwie so hieß das doch, Export, ASP.NET, Ural, hier, ASP.NET Core Ural, das meine ich, so, ein Sternchen, Doppelpunkt, auf welchem Port lassen wir es laufen, wieder 4500, ist doch Ach so, weil ich Http davor machen muss. Aha! Okay. 122.161.29.4500. Und... Pog! Nice! Es läuft auf meiner Linux-Box. Ah, der hat... der hat KegW nicht mit deployed, Leute. Kein KegW. Ich muss sagen, das ist sogar relativ schnell, der Kram. Kannst du den nicht beschweren, guck mal. Das läuft relativ zackig. So, mal gucken, ob wir was... ob wir... ja, Aladdin unbedingt. Aufnahme. Bam, Funst! Aufnahme! Things löschen, zack! Nice! Das läuft ausgesprochen gut, das hätte ich gar nicht gedacht. Wie viel... oh. Ach so, das ist, weil ich das nicht abrufen kann von den Images. Ja, okay. Wie viel... wie viel... poah, hatten das so CPU-Auslastungen und so? Nix, oder? Es juckt ihn überhaupt nicht. Hm. Three. Nö, das interessiert ihn nicht wirklich. Das braucht kaum RAM. Äh, hey Max, mal was ganz anderes. Ja, schieß los. Ich habe auch eine 8-Linux-VM, by the way. Beste, beste Distribution. Infallible Worksite, ursprünglich erstellt 60G. Habe die VM-DK jetzt auf 120GB erweitert, aber wie kann ich jetzt ohne reinstall die... Äh, nee, ganz einfach, ganz einfach. Easy, easy. Resize to FS einfach machen. Bam. Fertig. Äh. Ging das nicht so? Sudo muss man, glaube ich, machen. Resize to FS slash. Äh, ging das nicht so? Ach gut, ich habe ja auch nichts zum Resi... Soll ich euch zeigen, wie man das mit dem Resi-sen macht? Mal gucken, ob ich das jetzt hinbekomme. Also, wir haben hier eine Festplatte mit. 125G. Und jetzt Resi-sen. Ich weiß nicht, ob ich dafür ausschalten muss. Muss man erst die Partition vergrößern, ja? Ja, stimmt. Du musst erst die Partition... Probier mal aus, probier mal aus. So, ähm... Okay, probieren wir das jetzt aus. Das, das machen wir jetzt mal nebenbei. So, EPG-Champ abgebrochen. Du kannst doch eine zweite Platte nehmen, ja, aber... Nee, nee, wir machen das jetzt mal mit dem Resize. Mal ein bisschen was anderes zwischendurch. Wir machen das jetzt noch mal von der VM. So, probieren wir das nochmal. Ähm, Hard, Expand. Und zwar 130G. Es reichen da zwei Gigabyte mehr, oder? Ist ja egal. Expand. Expanding Disk. Schrrr, schrrr, schrrr. Schrrr, schrrr, schrrr, schrrr. Ich bin mir nicht sicher, ob wir das wirklich machen wollen. Das braucht ganz schön lang. Ich meine, es ist eine SSD. Was macht der da um zwei Gigabyte erweitern? WTF? Ich wette mit euch, wenn ich abbrechen drücke, bringt das nix. Okay, Chat, ich lese mal ein paar Fragen durch. Ja, wahrscheinlich ist deine VM auch relativ neu und kaum was drauf. Oder? Ja, also das würde auch funktionieren. Zwei als neue Platte einbinden. Aber das klappt nur gut, wenn du eine LVM drunter hast. Dass du das dann ins LVM zusätzlich reinhängst. Ohne LVM ist das... ...bisschen doof. Aber hier hab ich wieder was gelernt. Das ist gut zu wissen, dass sowas funktioniert. Das ist gut zu wissen, dass sowas funktioniert. Tja. Leute, wenn ich jetzt abbrechen drücke... ...weiß ich genau... ...wir gucken da jetzt gar nicht zu. Ich meine, guck mal. Das hat jetzt 2-3 Minuten gebraucht, da war es soweit. In 10 Minuten ist das fertig, spätestens. So, was haben wir sonst noch Interessantes? Chat, gibt es irgendwas Spannendes, was wir noch klären müssen heute? Irgendwas übersehen. Nee, sieht nicht so aus. Können noch ein Video anschauen, ja. Bis das... ...bis das fertig ist, können wir uns... Es geht eigentlich. Ein GUI-Vorschlag fürs EPG, zeig ich mal her. Nope. Funktioniert nicht. Wir machen von links nach rechts und nicht von oben nach unten. Wir machen von links nach rechts und nicht von oben nach unten. Außerdem ist das doch überhaupt nicht richtig tabletbedienbar, oder? Wie soll man das im Tablet gescheit bedienen? Wie soll man das im Tablet gescheit bedienen? Das funktioniert nicht gut im Tablet, oder? Ich hab' den Emoji-Film, Alter! Das ist so ein Rotz. Nee, ich hab' den Emoji-Film. Ich hab' den Emoji-Film. Ich hab' den Emoji-Film. Ich hab' den Emoji-Film. Ich hab' den Emoji-Film. Nee, da find' ich meinen's ja tatsächlich besser. Was haben wir denn noch für einen Witz? So schwärzt du deinen Personalausweis. So schwärzt du deinen Personalausweis. Ist dein Strike eigentlich weg? Ist dein Strike eigentlich weg? Ich hoffe mal. Nee, da müssen wir mal ein bisschen, ein bisschen, ich müsste da mal auf Twitter das noch mal Quoten und mal ein paar Leute, die ich, die ich, ein bisschen, bisschen größere Leute, die man so die Jahre über kennt, einfach mal add, add schreiben, weil wenn es, wenn es genug Leute retweeten, guckt sich das einer von YouTube an, der ein bisschen Plan hat und sagt nie so einen Schwachsinn, das ist doch gar kein, das ist doch gar kein, kein, kein, gegen unsere Richtlinien. Das Problem bei YouTube ist, dass wenn das ihr Algorithmus erkannt hat und es dann an irgendein Mensch geht, der Mensch sagt nö, nö, unser Algorithmus war schon richtig und dann kannst du nie wieder was einlegen, dann müsstest du irgendeinen Anwalt nehmen, wer macht das dann? Was haben wir denn hier sonst noch, die bessere Form der Product Placement, okay das ist 6 Minuten, das geht schon schnell, nach dem Video ist das fertig, zeig mal her, das neue bessere Product Placement, not VPN, ich kann, der EPG funktioniert erstaunlich gut, du hast verpasst, ich hab im Chat jemand gesagt, ich zeig dir mal kurz wie du in der VM deine Festplatte resized und jetzt ist mein VM-Werder Meinung, ja nicht so schnell, okay. Das stimmt, das stimmt, das ist mir auch aufgefallen, es gibt ganz viele, die machen das jetzt wieder bauer zum Beispiel, die rattern diesen ganzen Krempel einfach nur noch runter und das ist eine Sorte von Produktplatzierung, mit der könnte ich mich auch öfters anfreunden, also im Prinzip sag ich da nicht so nach dem Motto, so wie Bibi das gemacht hat, Leute ich hab heute so eine schöne Uhr gefunden, oh da freu ich mich, dass ich diese Uhr gefunden habe, die gibt's auch gerade bei XY ganz günstig, diese Uhr die ist so toll, nicht mehr, so macht man das nicht mehr, ich hab's jetzt an vielen Stellen gesehen, dass die Leute auf YouTube quasi sagen, Hersteller XY hat eine neue Uhr rausgebracht, ihr könnt ihr unter dieser Uhr euch das Ganze angucken, bis zum ersten, fünften, bla bla bla, ist das Ganze kostenlos und hier weitere Informationen, next, next, fertig, so muss man's machen, es ist ein bisschen, wie dann, wenn, keine Ahnung, irgendein Promi sagt, ah ich verwende jetzt, was weiß ich, Manscape oder so, einfach durch rattern und gut. Die Grafik hier hab ich schon in einigen Videos gezeigt, es ist die Fivehead Grafik, aha, das POX Modell, achso, ich glaub ich weiß, Leute ich hab keine Ahnung von so Marketing aber ich glaube, ich weiß um was es da geht, das ist das was es seit hunderten Jahren schon gibt, dass Leute die du magst, ähm, wie ist das, dass Leute die du magst und wenn die dir was mit persönlicher Empfehlung empfehlen, dann ist die Chance, dass du das Produkt magst auch höher. Oder was heißt Influencer Marketing, jegliche Marketing, das du empfiehst, das liegt nur da dran, weil ich jemandem im Stream was zeigen wollte und hier muss ich jetzt warten bis dieser tolle Balken fertig ist, er, du hast den Spaß studiert, ohje, Marketing-Stroggs-Mann, das genau, das ist das was ich meinte, das ist das was ich meinte, das ist das was ich meinte, das ist das was ich meinte, was ich meinte, ganz 결국 des Problems ist, man hat auf jeden Fall eine continuously residentsielle conteúdo, soidan zwarOTHEN knowing Ich glaube das ist doch umgedreht auch so stellen euch mal vor ihr guckt gerne Influencer a und Influencer a sagt immer alter xbox scheiße playstation geilste dann machen die leute da auch mit oder Scheiß Wichtbox genau Deswegen auch die beziehung tendieren dazu im gleichgewicht zu bleiben wenn ich als o beispielsweise testimonial p überhaupt nicht mag kann das dazu führen dass sich das von ihm beworbene produkt x auch weniger mag und das ist kein garant auf keinen fall aber so steigt die Wahrscheinlichkeit dass das positive bild dass wir von einer person haben auch auf ein produkt abfärbt und so hat influencer marketing jahre lang bei der weil ich influenza euch jetzt alle dass c++ die beschissenste programmier sprache ever ist und tut es auch immer noch für genügend geld kann sich eine firma die hart erarbeitete glaubwürdigkeit eines influencers ausleihen wobei dazu muss ich eigentlich kein influencer das ist ja offensichtlich in der stimme eines sympathischen menschen sprechen lassen und da gibt es natürlich auch no goals die die influencer nicht zulassen ich mache nur für das werbung was mich auch wirklich persönlich überzeugt ist ein satz den man in den letzten jahren das ist er muss ich aber sagen deswegen mache ich auch so wenige placements also wenn ich was mega kacke finde sage ich da nicht zu eins also negativ erfahrung schlechthin war bettel viel 2042 ich war so gehyped auf das game und ich habe gesagt ja wohl leute ich mache drei videos paid placement kein ding oder kam das spiel raus und war komplette grütze platzierung unendlich oft gehört und ich mein bei dem einen video hat man ja nur leute bei diesem video hat man richtig gemerkt dass ich keinen bock habe oder das war doch nicht mal insgesamt das video hallo leute hier ist der max und heute wenn man sie anschießt sie haben auch nicht diesen panzer platten pop mit diesem blauen hitmarker solltet ihr aber nicht diese cheesy taktik spielen weil ich hatte so kein bock auf das video mann dabei ist das nicht ganz richtig der ganze satz sollte er lauten ich suche mir von den anfragen die ich bekomme häufig das geringste auch ich weiße werbeanfragen obwohl ich noch nie eine bezahlte produktion gemacht noch auf irgendeine dieser anfragen jemals geantwortet habe aber ich habe sie archiviert über jahre ich habe auch alles ich habe alles noch im archiv ich habe einen eimerb ordner den ich nicht aufräume was kann man auch archiv nennen für ein gutes moralisch einwandfreies product placement ist seltener als ein kompetenter verkehrsminister ja ich habe fünf sachen bekommen die letzten zwei wochen ich habe beispielsweise in den letzten zwölf monaten genau 30 werbeanfragen für produktplatzierung von insgesamt drei verschiedenen vpn anbietern bekommen das ist eine anfrage alle zwölf tage obwohl ich nie geantwortet habe wer mal sehen will was für anfragen man so zum großteil bekommt der kann sich dieses video von rob bubble angucken mit dieser wahrheit müssen wir lernen zu leben produktplatzierung sind notwendig schon alleine weil youtube interne monetarisierungsoptionen immer wieder von algorithmischer willkür geplagt sind aber auch weil es leute gibt die sich scheinbar in monatelanger selbstisolation eine moralisch einwandfreie legitimation dafür zurecht konstruiert haben ein blokker auf youtube zu nutzen und teil eben dieser wahrheit ist es ehrlich gesagt chat mich juckt es überhaupt nicht ob ihr mich mit youtube guckt oder nicht aber mich mit blokker auf youtube guckt oder nicht an guten produkt platzierung der nachfrage nicht gerecht wird wer von youtube lebt schmerzhaft starke ausgaben für jedes video hat und auf dessen neue inhalte ein begeistert ja ihr müsst mich alles haben ich habe wirklich schmerzhaft hohe ausgaben pro video hat kaum einer wenn ich wenn ich keine subs kriege sterbe ich ist in einer woche kommt der wandel der letzten monate zum vorschein das nicht über die balancetheorie machen mir ist aufgefallen dass immer mehr deutsche wie auch englischsprachige youtuber beginnen ihre produktplatzierung anders zu inszenieren da ist das eigentliche video der grund warum man drauf geklickt hat und dann ist da dieses kürzere die werbung auf youtube ist richtig ätzend gerade seit die fall settings ist dass man in video placements hat das ist richtig ätzend drin dass immer weniger gemeinsamkeit alle zwei minuten irgendwas man kann es doch gar nicht mehr gucken immer mehr leute legen sich eine rolle zurecht eine persona die für sie die werbe briefings verliehen in einer woche ja ist mir auch gar aufgefallen das macht eigentlich unser fertig mit der person hinter der rolle assoziieren nicht mehr zwangsläufig für die bewertung von produkt x abgerufen wird weil person p ja jetzt als jemand anderes spricht produkt x bekommt so nicht sofort einen unbewussten sympathie schub von uns funktioniert in beide richtungen entweder mit total überzeichneten werbestimmen aller wussten sie schon dass sie mit dem code gedanken fetisch 16 ein ganze 70 prozent rabatt bekommen oder im fall einiger englischsprachige ich würde ich würde das einfach runter rattern das habe ich mir auch schon überlegt ob ich nicht mehr produkt placements in dieser richtung mache ich mein anfragen gibt es letztendlich eigentlich genug weil da sind ich ich sagte so weil es sind immer noch sachen dabei dich nicht machen würde rate shadow legends habe ich wirklich gar keinen bock drauf sich sehe ich nicht ein und vpn anbieter wollen ja immer nicht weil die dann sehen ich habe ein vpn kritisches video gemacht aber ansonsten es gibt ja noch normales zeug da würde ich dann einfach irgendwas runter rattern super nüchtern vorgelesen der infotext egal wie man es macht die grenzen zum rest des videos werden stärker influencer marketing ähnelt so mehr red shadow legends mag ich nicht das war ich nicht die man sich einfach für sein produkt kaufen kann auch wenn die entscheidung das zu tun vielleicht bei einigen eher aus selbstschutz getroffen wurde so klammert diese methode trotzdem die balanstheorie zu einem mich juckt und wird so für die habe ich keinen bock nützlichen spagat auf der einen seite hat man die kosten gedeckt und bekommt geld für das was man tut auf der anderen seite hat man aber den schaden die man damit eventuell anrichtet verringert das wie ich finde faszinierendste beispiel für diese entwicklung ist tom scott der wie im letzten video bereits erwähnt vor etwa zwei jahren eine fantastische demontage der falschen werbeversprechen von vpn anbietern veröffentlicht hat und vor etwas über einem monat einen robotter der nach ihm modelliert wurde genutzt hat um an seiner stelle für vpn werben zu können ich beschwere mich nicht wenn ich produktplatzierung bei anderen sehe manchmal stimme ich nicht mit ihnen überein ob das gewählte produkt wirklich das kleinste übel war aber ich kenne die andere seite ich kenne das brachland entweder und durchsichtige versicherungs apps glücksspieltutorials fürs handy vpn oder gaming booster es ist wirklich nicht leicht deswegen wäre auch immer sich diese form der produkte gaming booster weiß nicht auch so ein ding ich glaube das ist die zukunft es gibt ja gaming booster mittlerweile schon in pillenform das ok also wir haben fertig resized ok wir haben resize von 128 130 g alles klar so ok starten so und jetzt gucken wir mal ob das so funktioniert wie ich mir das gedacht habe oder ob ich die hälfte vergessen habe hau ma ma einloggen warten bis es gestartet ist airfox aufmachen terminal aufmachen so schauen wir mal die f-h was haben wir da zu bieten 125 g das sollten gleich zwei gigabyte mehr sein wenn alles von was wollen die von mir wenn alles funktioniert also war das nicht resize fs resize 2 fs slash nope is a directory while opening bin ich ging das anders musste man das irgendwie aufs device machen nothing to do ok ich habe nichts gesagt man muss anscheinend doch gepartet starten und das ding resize tatsächlich guck mal man muss den kram resize na dann dann gepartet starten und einmal resize resize zack resize ne resize 2 fs ist was anderes resize 2 fs hat nicht funktioniert warum eigentlich nicht ach gepartet macht das alles in einem oder alles alles in einmal ja gut damit fx partition löschen ne ne das muss wie macht man das das ist schon eine weile her wo ich das gemacht habe also wie gesagt resize fs kenne ich aber das klappt nur wenn die partitions tabelle schon also wenn die partition drunter größer ist noch platz fürs für für das device bietet sisse das hätte ich da hätte ich jetzt auch gar nicht dran gedacht dass man das ja noch machen muss nee man muss es nicht vom usb-stick bundeskam am laufenden komm mal hier da wir lassen uns das mal vor vorn wir lassen uns das immer erklären von fremder wie das funktioniert ja im moment dass das funktioniert mit lvm drunter ist mir auch klar nee resize 2 fs ist live kroppart was ist das kroppart was es nicht alles gibt habe ich habe ich noch nie gesehen kroppart nein das installiere ich nicht das installiere ich nicht guck mal zwei sterne und nichts das kann man doch bestimmt auch mit mit mit mit mit mit mit fdisk machen oder kroppartition linux also ich würde es mit gepartet jetzt machen die machen auch lvm ja im moment das ist mir zu risikoreich ich kenne das ich weiß dass es geht und wenn du das an einem schritt machst passiert auch nichts gibt es ja nicht fertige tools für kroppart ok wo bekommt man das her kroppart ubuntu wie installiert man das oder von was ist das bestandteil cloud guest utils was gibt es das unter unter arch by the way nicht ach hier guck mal ok das probieren aus wenn das ding jetzt verreckt habe ich gelitten kroppart und dann da lernt man was ok def sda zack def sda 2 und jetzt eins eins muss man angeben und dann ach so resize partition 1 und es ach nee so muss man machen so muss man machen resize partition 2 und ok und jetzt resize 2 fs def sda 2 easy und jetzt haben wir 2 gigabyte mehr als vorher das kannte ich tatsächlich noch nicht kroppart es ist mir lieber als mit fdisk partitions tabelle löschen und anlegen und du siehst du musst nix flaschen oder sonst was es funktioniert einfach so leute wir sind hier stehen geblieben beim epg champ den wir nicht root add gepadet ist definitiv einfacher aber man will es vielleicht nicht machen mit dem gui das geht bei dir nicht warum geht das nicht ah deine partition ist da vor da müsstest du die vorher irgendwie relocaten oder so in gepadet ja dann weiß ich auch nicht ah du kannst den gepadet doch die pallet nee dann fällt mir aus dem kopf jetzt nix ein ich sehe den screenshot jaja da müsstest du lass mal kurz überlegen ah ok du hast die platte du vor dem swap erlöscht den swap doch einfach löscht den swap das wärs einfach so oder swap löschen swap aushängen und swap löschen dann expandest du deine x4 das geht dann bestimmt auch in gepadet dann expandest du die und machst den swap hinten dran neu du lässt einfach 8 gigabyte frei beim resize und machst da drinnen dann oder du nimmst ein swap file da brauchst du nämlich gar keine richtig da brauchst du nämlich gar keine swap partition oder du machst wie ich du machst gar keinen swap einfach 16 g ram rein und gut es braucht kein swap so also epg champ bild nummer so zum beweis so sieht es aktuell aus und so läuft es auf meinem linux receiver 5.000 nee was ah nee ttp doppelpunkts sternchen punkt 4.500 back-end so also so sieht es aus aktuell der epg champ ist am start und man kann sachen aufnehmen haben die alle keine besch... haben die alle keine beschreibung oder ist da was kaputt chat warum haben die alle keine beschreibung habe ich die habe ich die beschreibung oh ich glaube ich habe die ich glaube ich habe die beschreibung kaputt gemacht da ist selbst was kaputt aber nicht schlimm aber der rest funktioniert ich habe nee haben die haben die dinge alle keine beschreibung das kann doch nicht sein oder monkaS zu weit in der zukunft nee das die haben doch normalerweise beschreibung hier nee die haben geht war das kann es sein dass es einfach noch nicht geladen war so gut das ist sogar ausgesprochen schnell gut wunderbar das funktioniert achso ich war gerade zu weit in der zukunft da gab es noch gar keine ja das mit dem sendernamen das mache ich jetzt aber nicht das mache ich jetzt also ihr seht ihr seht es funktioniert es funktioniert auch hier drauf das ist interessant finde ich gut es ging einfach instant auf dem linux receiver mit uralt kernel aber es ist nice so was wir jetzt noch machen ist folgendes epg-stern git status backends ich push das ganze jetzt nochmal dass man sich das ganze auf shithub angucken können nice wäre auch wenn sendungen die man früher schon einmal aufgenommen hat gekennzeichnet werden sehr gute idee es gibt sogar eine funktion für serien oder sowas die man früher schon aufgenommen hat ja aber hauptsache das tut jetzt erstmal also sagen wir jetzt mal hier git add git commit minus m minus a was haben wir heute gemacht ja das ist über kabelanschluss mit einem achtfach tuner jetzt dank der neuen box was haben wir denn heute gemacht wie kann man das zusammenfassen wir haben heute commit messages ist das schlimmste überhaupt wir haben gbaited small changes monocommit klar ich mach doch jetzt nicht für den ganzen greppel was small small changes so push nicht force und auch nicht so gut dann können wir hier mal kurz gucken wo bloß epg champ hast du da unten im terminal auch noch mal tabs ja habe ich nur fürs terminal small changes so wunderbar gestern wollte mich einer gbaiten in den issues guckt mal funktioniert nicht und dann klickst du auf das video wo es nicht funktioniert so gepusht haben wir noch einen neuen screenshot machen das läuft noch wollte gerade sagen lull es kann nicht mehr laufen aber noch einen neuen screenshot erstmal mit dem seriösen cac w bild unten links in der ecke jetzt machen wir das was man wo ich sache auf der arbeit immer macht es auf gar keinen fall aber sehr egal das repo checkte er außer mir keiner aus jetzt haben wir noch einen screenshot dieser github cache macht mich hart fertig oder der github webserver cache man er hat es immer noch nicht gecheckt dass der screenshot geupdatet wurde das ist egal eine ritme hat sich auch nichts geändert hatten wir gestern auch liegt nicht am force pushen die ritme hat sich auch nicht geändert nur das screenshot fall das braucht jetzt ein bisschen nee das ist der github das ist nicht mehr der browser cache das ist der github webseiten der webserver cache der guckt irgendwie ob es schon verbindung zu einem hat und dann kannst du irgendwie eine example arpi response jason zum projekt hinzufügen sonst kann man ohne tv nicht mitentwickeln du meinst mir das frontend das frontend also das frontend geht ja gegen mein backend das hat ja mit tv hat ja nichts zu tun also von tv her gibt es halt diese arpi dock hier aber für meinst wisst ihr was wir machen können wisst ihr was wir machen können wir können ein feature verwenden wir können eine swagger dock generieren lassen schwäger das machen wir jetzt das geht ganz zackig das haben die mittlerweile eingebaut und zwar wie ging das jetzt noch mal dot net core schwäger just das da muss man da irgendwas hinzufügen oder wie das ging doch total easy das waren zwei zeilen letztendlich oder ist das jetzt ausgelagert wird das nicht mehr mitgebracht anscheinend nicht anscheinend nicht build services anscheinend wird es nicht mehr mitgebracht ok tatsächlich ok was muss ich installieren das da schwäger so und jetzt wenn ich das jetzt starte dann habe ich also serious bugs wenn du mitmachen willst wäre natürlich äußerst pock weil du hast von frontend sachen deutlich mehr ahnung als ich ich habe nichts gesagt es ist anscheinend doch nicht so einfach mit dem minimal api ok dann weiß ich nicht wie es funktioniert dann bin ich äußerst planlos wie das funktioniert das mache ich das nächste mal ich esse jetzt was minimal api schwäger jaja ach nee was muss man noch machen alles klar das machen wir gleich ganz hier oben ja und wo ist jetzt das problem ach jetzt geht es oder was und jetzt local host 4500 slash und dann äh worunter ist es jetzt verfügbar schwäger aha guck mal mit mit api docs das ist tatsächlich ganz cool guck mal der zeigt dir sogar was der zurückschickt dann ist ja der guter gibts ein image zurück response true oder false ja das ist cool nice production ready so machen wir noch jetzt komm mit api docs push ja also falls du dich ein bisschen mehr austoben willst jetzt kann man sich das sogar angucken ist klar heute jetzt gehe ich wirklich was essen ich hab hunger ich hab jetzt ja heute wirklich ganz schön ganz schön lange gestriemsel ich weiß nicht wie das manche leute schaffen ehrlich gesagt ich mein ich war heute online warum ist dieses warum ist die twitch seite eigentlich so pains champ mittlerweile zu bedienen guck mal ich war drei stunden sechs stunden das reicht jetzt genug genug wir sehen uns alles gut bis denn see you", "segments": [{"id": 1, "start": 60.0, "end": 65.0, "text": "."}, {"id": 2, "start": 65.0, "end": 70.0, "text": "."}, {"id": 3, "start": 70.0, "end": 75.0, "text": "."}, {"id": 4, "start": 75.0, "end": 80.0, "text": "."}, {"id": 5, "start": 80.0, "end": 85.0, "text": "."}, {"id": 6, "start": 115.0, "end": 119.52, "text": "So, dann wollen wir mal das Ding benutzbar machen."}, {"id": 7, "start": 119.52, "end": 124.56, "text": "Ich hab gestern Abend noch ein bisschen weiter gebaut und hab das vorhin gepusht."}, {"id": 8, "start": 124.56, "end": 127.68, "text": "Das heißt wir sind ein bisschen weiter als gestern."}, {"id": 9, "start": 127.68, "end": 132.04, "text": "Das sieht jetzt etwas schöner aus als gestern noch, was wir gebaut haben."}, {"id": 10, "start": 132.04, "end": 133.04, "text": "Äh, Essen?"}, {"id": 11, "start": 133.04, "end": 136.44, "text": "Ja, gegen so aufgewärmte Nudels."}, {"id": 12, "start": 136.44, "end": 144.64, "text": "Also, das war jetzt nicht die geilsten Nudeln überhaupt."}, {"id": 13, "start": 144.64, "end": 149.04, "text": "DHL krank geworden."}, {"id": 14, "start": 149.04, "end": 151.16, "text": "Kannst du noch nix für?"}, {"id": 15, "start": 151.16, "end": 153.08, "text": "Sollen sie jemand anderes ins Auto setzen?"}, {"id": 16, "start": 153.08, "end": 167.48, "text": "Joa, sollen wir mal gucken wie lange das jetzt geht."}, {"id": 17, "start": 167.48, "end": 171.0, "text": "Ich denke nicht, dass wir wieder 4 Stunden dran rum basteln jetzt,"}, {"id": 18, "start": 171.0, "end": 178.8, "text": "in dem ich schon fast 3 Stunden vorhin on war."}, {"id": 19, "start": 178.8, "end": 182.04, "text": "So, also ich zeige euch mal wie es gerade ausschaut."}, {"id": 20, "start": 182.04, "end": 190.84, "text": "Äh, ich guck noch mal ob zwischendurch noch mal Updates checken, man weiß ja nie."}, {"id": 21, "start": 190.84, "end": 204.32, "text": "Äh, warum hängt denn das da so lange?"}, {"id": 22, "start": 204.32, "end": 211.28, "text": "Ja, schon wieder on."}, {"id": 23, "start": 211.28, "end": 214.24, "text": "Der echte Age des Ministers haben schon hat 24 Monate,"}, {"id": 24, "start": 214.24, "end": 217.24, "text": "Dankeschön für den Sub."}, {"id": 25, "start": 217.24, "end": 221.0, "text": "Ja, ich glaube nicht, dass wir so lange basteln wie gestern."}, {"id": 26, "start": 221.0, "end": 224.56, "text": "Es fehlt ja im Prinzip jetzt nur noch das Popup, was man macht zum Programmieren und"}, {"id": 27, "start": 224.56, "end": 229.96, "text": "dann ist erstmal so von den Basic Funktionalitäten gut und dann kann man sich ja noch was überlegen."}, {"id": 28, "start": 229.96, "end": 237.44, "text": "Also, ich mach den Kram mal kurz auf und dann zeige ich euch wie es aktuell aussieht,"}, {"id": 29, "start": 237.44, "end": 239.4, "text": "weil ich hab noch ein bisschen dran gebastelt."}, {"id": 30, "start": 239.4, "end": 246.36, "text": "Ja, eine Sache, da haben wir gestern überhaupt nicht dran gedacht,"}, {"id": 31, "start": 246.36, "end": 250.16, "text": "das zeige ich euch mal schnell, guck mal."}, {"id": 32, "start": 250.16, "end": 259.56, "text": "So, und zwar es kann passieren, dass zwei EPG Einträge Lücken haben, weil der Sender"}, {"id": 33, "start": 259.56, "end": 264.4, "text": "Mist verschickt und da muss man die Lücke schließen zwischen den EPG Einträgen."}, {"id": 34, "start": 264.4, "end": 270.16, "text": "Also wenn eine Sendung aufhört um 15 Uhr und die andere fängt erst um 15.05 Uhr an,"}, {"id": 35, "start": 270.16, "end": 274.28, "text": "dann ist das zwar unlogisch, aber das kann der Sender halt ausliefern, weil sie, wenn"}, {"id": 36, "start": 274.28, "end": 281.28, "text": "sie blöd sind, ja das machen sie auch."}, {"id": 37, "start": 281.28, "end": 285.72, "text": "So, ich starte das jetzt mal und dann zeige ich euch wie es aussieht."}, {"id": 38, "start": 285.72, "end": 293.92, "text": "Ihr werdet auch feststellen, wir haben jetzt, pass mal auf, guckt mal, wir haben einen Spinner."}, {"id": 39, "start": 293.92, "end": 294.92, "text": "Massive."}, {"id": 40, "start": 294.92, "end": 299.96, "text": "Ah, das Backend ist gar nicht gestartet, deswegen spinnt der Spinner auch so lang."}, {"id": 41, "start": 299.96, "end": 306.2, "text": "Ja, eins bis zwei Lücken ist halt blöd, die muss ich jetzt überbrücken, ok, nochmal."}, {"id": 42, "start": 306.2, "end": 316.96, "text": "So, das, wow, was habe ich hier aufgemacht, guckt mal, so sieht es jetzt aus, sieht besser"}, {"id": 43, "start": 316.96, "end": 317.96, "text": "aus als gestern, oder?"}, {"id": 44, "start": 317.96, "end": 324.6, "text": "Und wir haben einen Spinner, es lädt schneller und wir haben einen Spinner, das in Kombination"}, {"id": 45, "start": 324.6, "end": 329.04, "text": "kommt einem gar nicht mehr, gar nicht mehr so lange vor und seht ihr das hier oben, guckt"}, {"id": 46, "start": 329.04, "end": 336.64, "text": "mal, Pfeifferer-Time, das ändert die Hintergrundfarbe anhand der Tageszeit, seht ihr das, guckt"}, {"id": 47, "start": 336.64, "end": 343.96, "text": "mal, 22, 23 Joules Nachts und jetzt, jetzt wird es wieder langsam hell, d.h. du kannst"}, {"id": 48, "start": 343.96, "end": 350.6, "text": "beim Durchscrollen schon so ungefähr sehen, wie viel Uhr es ist, richtig Pfeifferer, ja."}, {"id": 49, "start": 350.6, "end": 357.28, "text": "Und ihr seht es hier, 20.15 Uhr, das ist auch alles jetzt richtig, richtig aligned, außer"}, {"id": 50, "start": 357.28, "end": 365.64, "text": "manche Sender wie RTL2, die der Meinung sind, dass die Geissens Roberts Mega Mansions 20.14"}, {"id": 51, "start": 365.64, "end": 366.64, "text": "anfangen, warum?"}, {"id": 52, "start": 366.64, "end": 367.64, "text": "Man weiß es nicht."}, {"id": 53, "start": 367.64, "end": 376.36, "text": "Tja, und ProSieben ist Pamela Anderson-Buba, wobei, nee, ich glaube nicht, dass sie das"}, {"id": 54, "start": 376.36, "end": 377.36, "text": "noch ist."}, {"id": 55, "start": 377.36, "end": 382.72, "text": "Wofür die Farben stehen, weiß ich ehrlich gesagt auch nicht, das habe ich gestern random"}, {"id": 56, "start": 382.72, "end": 387.64, "text": "wieder reingewurscht, dass es noch irgendwie geht, ja, man hat keine Ahnung, wofür die"}, {"id": 57, "start": 387.64, "end": 388.72, "text": "Farben stehen, das ist schon richtig."}, {"id": 58, "start": 388.72, "end": 393.12, "text": "Woher ich die Daten ziehe von meinem TV-Headend-Server?"}, {"id": 59, "start": 393.12, "end": 399.32, "text": "Es gibt aber auch Web-EPGs, die man anzapfen kann, wenn man will."}, {"id": 60, "start": 399.32, "end": 400.32, "text": "So."}, {"id": 61, "start": 400.32, "end": 407.6, "text": "Und wisst ihr, was es für ein Akt war, diese Sache hier genauso hoch zu bekommen, wie den"}, {"id": 62, "start": 407.6, "end": 411.92, "text": "Rest der Seite, ich habe da eine ekliche Lösung, ich zeige euch das mal kurz."}, {"id": 63, "start": 411.92, "end": 426.68, "text": "Ich habe keine Ahnung, ob das besser geht, aber ich rechne die Höhen der Seite aus,"}, {"id": 64, "start": 426.68, "end": 428.56, "text": "wie hoch ich, wie lange ich den Strich machen muss."}, {"id": 65, "start": 428.56, "end": 433.36, "text": "Ich habe keine Ahnung, ob es schönere Lösungen gibt, aber die funktionieren."}, {"id": 66, "start": 433.36, "end": 438.36, "text": "Nein, nein, nein, nein, nein, das funktioniert nicht."}, {"id": 67, "start": 438.36, "end": 446.88, "text": "100% View-High, funktioniert nicht, 100% View-High ist so und wenn ich runter scrolle, hört es"}, {"id": 68, "start": 446.88, "end": 447.88, "text": "auf."}, {"id": 69, "start": 447.88, "end": 460.44, "text": "Full geht auch nicht, ja, ich habe keine Ahnung, Max Content geht auch nicht, habe ich auch"}, {"id": 70, "start": 460.44, "end": 465.6, "text": "ausprobiert, das ist das einzig Sinnvolle, was mir eingefallen ist, ich habe fast alles"}, {"id": 71, "start": 465.6, "end": 466.6, "text": "andere ausprobiert."}, {"id": 72, "start": 466.6, "end": 471.4, "text": "Ich benutze gerne Tailwind, weil ich habe keine Ahnung von CSS und irgendwie finde ich"}, {"id": 73, "start": 471.4, "end": 472.4, "text": "das griffiger."}, {"id": 74, "start": 472.4, "end": 478.76, "text": "Übrigens, dieser Strich hier, der gibt auch nicht wirklich Sinn, der Strich ist einfach"}, {"id": 75, "start": 478.76, "end": 487.44, "text": "irgendwie so um 15 Uhr rum jetzt, weil es immer gleich breit ist, also okay, also was"}, {"id": 76, "start": 487.44, "end": 490.84, "text": "wir heute machen müssen ist folgendes, wir müssen das Ding erstmal funktional machen,"}, {"id": 77, "start": 490.84, "end": 499.76, "text": "das heißt, wenn man hier draufklickt, dann muss ein Popup kommen und ein Popup, wo man"}, {"id": 78, "start": 499.76, "end": 507.32, "text": "dann Details sieht und aufnehmen kann und so und dann können wir die schöneren Sachen"}, {"id": 79, "start": 507.32, "end": 511.08, "text": "kümmern, so zum Beispiel, dass die Farben richtig sind, weil aktuell ist es einfach"}, {"id": 80, "start": 511.08, "end": 517.68, "text": "nur ein riesig langes If, was anhand der Senderkategorie irgendwelche Farben zuweist, das hat keinen"}, {"id": 81, "start": 517.68, "end": 526.28, "text": "tieferen Sinn, automatisches Skalieren funktioniert nicht, aber insgesamt, muss man sagen, sieht"}, {"id": 82, "start": 526.28, "end": 532.52, "text": "das durchaus brauchbar aus und das sieht deutlich moderner aus als die Sachen, die ich dafür"}, {"id": 83, "start": 532.52, "end": 533.52, "text": "gefunden habe."}, {"id": 84, "start": 533.52, "end": 539.48, "text": "Einzig dumme ist, wenn man wirklich durchscrollt bis zum Schluss, ich gehe mal ganz hinten"}, {"id": 85, "start": 539.48, "end": 548.56, "text": "hin, da sieht man halt an den Stellen wo es aufhört, dann hört es halt einfach auf, weil"}, {"id": 86, "start": 548.56, "end": 554.04, "text": "gerade das hier, das sieht nicht so schön aus, aber da gehen halt die Daten irgendwann"}, {"id": 87, "start": 554.04, "end": 555.04, "text": "aus."}, {"id": 88, "start": 555.04, "end": 560.96, "text": "Was willst du machen?"}, {"id": 89, "start": 560.96, "end": 567.52, "text": "Filter Suchfunktion, ehrlich gesagt, weiß ich nicht wie sinnvoll das ist, es soll jetzt"}, {"id": 90, "start": 567.52, "end": 575.52, "text": "dann nicht zu überladen sein, na wobei Filter, an sich ist die Idee gar nicht schlecht, ich"}, {"id": 91, "start": 575.52, "end": 586.92, "text": "hab doch hier irgendwo mein txt-File, eventuell Filter, aber Filter nur wirklich ultra simple,"}, {"id": 92, "start": 586.92, "end": 595.36, "text": "da machen wir irgendwie die Möglichkeit das zu sagen, hier Textbox, aber Filtern, das"}, {"id": 93, "start": 595.36, "end": 601.64, "text": "ist schwierig in dieser Darstellung zu Filtern, weil ich kann die Dinge zwar easy rausfiltern,"}, {"id": 94, "start": 601.64, "end": 608.4, "text": "die nicht deiner Sache, die du suchst entsprechen, aber dann hast du Lücken, wirst du gar nicht"}, {"id": 95, "start": 608.4, "end": 612.68, "text": "wie ein Filter hier aussehen sollte."}, {"id": 96, "start": 612.68, "end": 620.32, "text": "Ich mein man kann in Zukunft ja noch vieles machen, wenn man es denn will, man kann auch"}, {"id": 97, "start": 620.32, "end": 626.36, "text": "sagen, hey wenn man auf den Sender klickt, dann kommt so eine Darstellung pro Sender"}, {"id": 98, "start": 626.36, "end": 634.64, "text": "mit der Zeit, anstatt diese hier, ich will jetzt aber erstmal so die basic Sachen funktionieren"}, {"id": 99, "start": 634.64, "end": 642.68, "text": "und wir müssen probieren ob das überhaupt gescheit läuft auf dem Linux Receiver wo"}, {"id": 100, "start": 642.68, "end": 654.48, "text": "das dann im Ende laufen soll."}, {"id": 101, "start": 654.48, "end": 659.04, "text": "Ich finde das ehrlich gesagt jetzt ganz hübsch zum aktuellen Zeitpunkt, das default Image"}, {"id": 102, "start": 659.04, "end": 665.64, "text": "könnte man noch austauschen, ich weiß nicht wie seriös so ein CAC W Bild wirkt auf Leute"}, {"id": 103, "start": 665.64, "end": 673.08, "text": "auf GitHub, aber ist mir ehrlich gesagt auch wurscht."}, {"id": 104, "start": 673.08, "end": 681.36, "text": "Leere Plöcke mit fehlenden Daten, ja das habe ich mir auch schon überlegt, hier hinter,"}, {"id": 105, "start": 681.36, "end": 687.0, "text": "da müsste ich halt ausrechnen, da müsste ich quasi gucken, wann hört der längste"}, {"id": 106, "start": 687.0, "end": 694.8, "text": "Block auf und dann quasi gucken wie lange muss ich den Block machen, wo keine Daten"}, {"id": 107, "start": 694.8, "end": 701.36, "text": "drin stehen, das wäre sogar ganz gut, weil er würde alles hier gleich abschließen."}, {"id": 108, "start": 724.8, "end": 731.04, "text": "Die Zeitleiste ist ultra bescheuert gemacht, die geht als einfach eine Schleife für 8"}, {"id": 109, "start": 731.04, "end": 738.4, "text": "Tage mit jeweils 24 Stunden am Tag und dann hier oben den, sagt mal Leute braucht man"}, {"id": 110, "start": 738.4, "end": 743.28, "text": "hier oben überhaupt die Zeit, ich meine die Zeit sieht man ja hier unten oder, wobei die"}, {"id": 111, "start": 743.28, "end": 748.4, "text": "Übersicht ist schon schneller, ja wenn ich jetzt raussuchen will, keine Ahnung, Dienstag"}, {"id": 112, "start": 748.4, "end": 758.08, "text": "20.15 Uhr dann gehe ich dahin, das ist schon halt schlecht, so jetzt müssen wir mal wie"}, {"id": 113, "start": 758.08, "end": 766.44, "text": "gesagt Pop-Up machen, also sprich wenn man hier draufklickt, erstmal User Select ausmachen,"}, {"id": 114, "start": 766.44, "end": 777.4, "text": "das sieht halt, das ist ja richtig beknackt so, kann man das vielleicht für das ganze"}, {"id": 115, "start": 777.4, "end": 791.48, "text": "Ding ausschalten, select, select none, aha, wie kann man das denn unterbinden, ah da gehe"}, {"id": 116, "start": 791.48, "end": 802.04, "text": "ich aufs Image und sag Class Pointer Events None, dann gibt es auch keinen, ha guck jetzt"}, {"id": 117, "start": 802.04, "end": 807.66, "text": "wird eh nicht mehr track and drop, man könnte jetzt hier vielleicht noch den Cursor anders"}, {"id": 118, "start": 807.66, "end": 812.28, "text": "machen wenn man hier drüber ist, könnte jetzt noch, weil ansonsten checkt ja da keiner"}, {"id": 119, "start": 812.28, "end": 821.48, "text": "dass man da draufklicken muss, Leute sagen wenn man jetzt hier drüber ist, Alter, also"}, {"id": 120, "start": 821.48, "end": 827.36, "text": "die Standard Code Formatierung ist hier schon ziemlich ppeger oder, wieso ist der Strich"}, {"id": 121, "start": 827.36, "end": 832.68, "text": "bei 520, weil der Strich Hardcoded ist und absolut keinen Sinn hat aktuell, außer dass"}, {"id": 122, "start": 832.68, "end": 849.04, "text": "man sieht ungefähr hier ist es gerade aktuell, Pointer, nee Cursor, Pointer, aha, oh nee,"}, {"id": 123, "start": 849.04, "end": 859.74, "text": "aha, ah, da kann man nicht durchklicken, MonkaS, wie macht man dann den, habt ihr mal"}, {"id": 124, "start": 859.74, "end": 865.7, "text": "eine Ahnung wie man in HTML was Click-Through macht, dass es nicht mal in den Pointer Events"}, {"id": 125, "start": 865.7, "end": 873.28, "text": "frisst, sondern durch geht, hier funktioniert es, guck hier kann man dann draufklicken,"}, {"id": 126, "start": 873.28, "end": 874.28, "text": "Sogar das jetzt funktioniert."}, {"id": 127, "start": 874.28, "end": 875.28, "text": "Nice."}, {"id": 128, "start": 875.28, "end": 886.92, "text": "Äh, weil RTL 2 das so macht, das liegt nicht an mir, bei RTL 2 sind die Dinger so shab,"}, {"id": 129, "start": 886.92, "end": 887.92, "text": "das ist normal."}, {"id": 130, "start": 887.92, "end": 893.36, "text": "Guck, RTL 2 hat aus irgendwelchen Gründen diese Sendung so shab, alle andere nicht,"}, {"id": 131, "start": 893.36, "end": 895.08, "text": "das ist weil die das so ausstrahlen."}, {"id": 132, "start": 895.08, "end": 897.68, "text": "Sinn ergibt das nicht, aber es ist halt so bei RTL 2."}, {"id": 133, "start": 897.68, "end": 913.24, "text": "Keine Ahnung."}, {"id": 134, "start": 913.24, "end": 917.04, "text": "Einfach Pointer Events ignorieren, dann funktioniert aber wahrscheinlich..."}, {"id": 135, "start": 917.04, "end": 919.4, "text": "Oh, ich habe meinen Browser kaputt gemacht."}, {"id": 136, "start": 919.4, "end": 925.32, "text": "Wenn ich Pointer Events none mache, dann kann ich aber doch nicht durchklicken, oder?"}, {"id": 137, "start": 925.32, "end": 926.32, "text": "Hallo?"}, {"id": 138, "start": 926.32, "end": 928.32, "text": "Video, please?"}, {"id": 139, "start": 928.32, "end": 934.8, "text": "Warte mal, wo bin ich denn überhaupt?"}, {"id": 140, "start": 934.8, "end": 937.8, "text": "Aber ich blick gerade nicht mehr durch, wo bin ich denn?"}, {"id": 141, "start": 937.8, "end": 939.12, "text": "Ne, hier, hier bin ich richtig."}, {"id": 142, "start": 939.12, "end": 945.96, "text": "Orange, ich weiß nicht wo wir sind."}, {"id": 143, "start": 945.96, "end": 948.92, "text": "Ah, hier, hier bin ich, ok, alles klar, obvious."}, {"id": 144, "start": 948.92, "end": 960.2, "text": "Ey doch, funktioniert, alles klar, einfach Pointer Events ignorieren, ok, hätte ich"}, {"id": 145, "start": 960.2, "end": 961.2, "text": "das mal früher gewusst."}, {"id": 146, "start": 961.2, "end": 966.36, "text": "Auch weil er durchklicken soll, ist es mir doch wurscht, ob das Anti-Pattern sind oder"}, {"id": 147, "start": 966.36, "end": 968.96, "text": "nicht, solange das funktioniert."}, {"id": 148, "start": 968.96, "end": 974.92, "text": "Ganz davon abgesehen, hier will es ja durchklicken, das ist ja nur zum Anzeigen, dass es hier"}, {"id": 149, "start": 974.92, "end": 975.92, "text": "die aktuelle Zeit ist."}, {"id": 150, "start": 975.92, "end": 986.24, "text": "Was willst du denn genau machen, das ist an sich nicht so schwierig, Websockets, also"}, {"id": 151, "start": 986.24, "end": 990.76, "text": "sowohl Home Assistant als auch Grafana benutzen Websockets, wobei beim Grafana, ich bin gar"}, {"id": 152, "start": 990.76, "end": 997.32, "text": "nicht so sicher, aber Home Assistant benutzt auf jeden Fall Websockets zum, kannst sogar"}, {"id": 153, "start": 997.32, "end": 1000.32, "text": "subscriben und dann bekommst du Daten rausgeschickt regelmäßig."}, {"id": 154, "start": 1000.32, "end": 1011.8, "text": "Oder willst du Informationen abrufen und diese Informationen dann, also die, willst du Informationen"}, {"id": 155, "start": 1011.8, "end": 1017.04, "text": "über eine Websocket Verbindung bekommen und die dann irgendwann mal diese Infos so umschreiben,"}, {"id": 156, "start": 1017.04, "end": 1020.24, "text": "das sind ja im Grafana, also wenn du sie im Grafana einbinden willst, ist die Frage was"}, {"id": 157, "start": 1020.24, "end": 1025.8, "text": "für eine Source du verwendest, wenn es Prometheus ist, muss es ein Notexporter Format sein."}, {"id": 158, "start": 1025.8, "end": 1034.52, "text": "Achso, ja, ja, ok, da sind ja zwei Schritte, erstmal die Daten rausbekommen aus der Websockets"}, {"id": 159, "start": 1034.52, "end": 1040.84, "text": "API und dann die Daten reinpumpen, jeweils ins Grafana oder ins Home Assistant, also"}, {"id": 160, "start": 1040.84, "end": 1044.92, "text": "Grafana hängt davon ab was du für eine Quelle verwendest, wenn wie gesagt, wenn es Prometheus"}, {"id": 161, "start": 1044.92, "end": 1049.16, "text": "ist, musst du da ein Notexporter draus machen, das kannst du mit irgendwie so einem Mini-Bash"}, {"id": 162, "start": 1049.16, "end": 1057.0, "text": "mit machen oder im Prinzip mit was du lustig bist und ins Home Assistant gibt es verschiedene"}, {"id": 163, "start": 1057.0, "end": 1063.4, "text": "Sachen, kannst du über MQTT machen, kannst du über HTTP machen, Home Assistant hat mehrere"}, {"id": 164, "start": 1063.4, "end": 1071.88, "text": "Sachen, du kannst beispielsweise einen HTTP Sensor machen, was sein kann ist, dass Home"}, {"id": 165, "start": 1071.88, "end": 1076.48, "text": "Assistant irgendwas bietet, wo man direkt von Websockets was abfragen kann, das weiß ich"}, {"id": 166, "start": 1076.48, "end": 1082.52, "text": "nicht, also ich würde jetzt ein kleines Skript machen, was die Websockets Sachen abfragt"}, {"id": 167, "start": 1082.52, "end": 1089.16, "text": "und dann per HTTP in Home Assistant pusht, irgendwie so, da muss man sich jetzt genauer"}, {"id": 168, "start": 1089.16, "end": 1090.16, "text": "angucken."}, {"id": 169, "start": 1090.16, "end": 1094.08, "text": "So, wir machen jetzt das Popup, also wie kriegen wir ein Popup hin, übrigens Leute, das ist"}, {"id": 170, "start": 1094.08, "end": 1098.6, "text": "absolut nicht modular, das ist eine Seite mit allem drinnen, aber wir sind nur bei"}, {"id": 171, "start": 1098.6, "end": 1104.84, "text": "2 und 19 Teilen, inklusive JavaScript und sonst was, also passt halbwegs, so, wir müssen"}, {"id": 172, "start": 1104.84, "end": 1110.88, "text": "das Popup designen, ihr wisst ja, ich bin ein großer Popup Designer, ich kann das wahnsinnig"}, {"id": 173, "start": 1110.88, "end": 1127.28, "text": "gut designen, haben wir schon ein paar mal verkackt, ok, wir machen ein Popup, ich meine,"}, {"id": 174, "start": 1127.28, "end": 1132.84, "text": "man könnte auch eine extra Klasse machen für das Popup, dann ist es nicht ganz so hässlich,"}, {"id": 175, "start": 1132.84, "end": 1144.2, "text": "eventuell, vielleicht, ach was, inline, alles in die eine Datei rein, gut ist, also wie machen"}, {"id": 176, "start": 1144.2, "end": 1152.44, "text": "wir jetzt hier ein Popup, also, class, fixed, das muss man glaube ich sinnvollerweise nehmen,"}, {"id": 177, "start": 1152.44, "end": 1164.48, "text": "left, 5 frei, right, 5 frei, pop, 5 frei, bottom, 5 frei, bg, red, so, dass man sieht, so, ist"}, {"id": 178, "start": 1164.48, "end": 1172.56, "text": "das jetzt ein Popup, hey, das ist ein Popup, pog, ne, ne, das sieht nicht, z-index, 50,"}, {"id": 179, "start": 1172.56, "end": 1180.24, "text": "soll vorne sein, ok, besser, so, wir haben ein Popup, zwar kein wahnsinnig schönes Popup,"}, {"id": 180, "start": 1180.24, "end": 1200.84, "text": "aber wir haben ein Popup, ah, tatsächlich, Grafana Websocket Source, tatsächlich, using"}, {"id": 181, "start": 1200.84, "end": 1214.96, "text": "the new Websocket Data Source Plugin, aha, wusste ich gar nicht, dass die sowas haben,"}, {"id": 182, "start": 1214.96, "end": 1224.64, "text": "pog, ansonsten, das habe ich noch nie verwendet, Grafana mit Websockets, also nicht mit diesem"}, {"id": 183, "start": 1224.64, "end": 1233.64, "text": "Websocket Plugin, Home Assistant hat auch für ziemlich, Websocket Sensor, Home Assistant"}, {"id": 184, "start": 1233.64, "end": 1240.72, "text": "hat auch für ziemlich alles irgendwelche Plugins, Websocket Sensor, Websocket Integration,"}, {"id": 185, "start": 1240.72, "end": 1255.0, "text": "ja, also das kenne ich, ja, du kannst, du kannst dem Home Assistant die Sachen über,"}, {"id": 186, "start": 1255.0, "end": 1259.72, "text": "über, HTTP reinpumpen, ne, das ist, das ist die Websocket API, ne, da gibt es anscheinend"}, {"id": 187, "start": 1259.72, "end": 1265.6, "text": "nichts, direkt in Websocket Verbindung machen aber glaube ich auch die wenigsten, so, so,"}, {"id": 188, "start": 1265.6, "end": 1269.68, "text": "unser, unser Massive, ok Leute, wir machen jetzt, wir machen tatsächlich mal, wisst"}, {"id": 189, "start": 1269.68, "end": 1277.72, "text": "ihr was, wir machen zur Abwechslung mal ein schönes Pop-Up, das ist schwierig, ja, weil"}, {"id": 190, "start": 1277.72, "end": 1284.84, "text": "ich sacke in CSS, aber wir machen, wir machen mal ein schönes Pop-Up und zwar, man könnte,"}, {"id": 191, "start": 1284.84, "end": 1293.4, "text": "so, also der Hintergrund, der Hintergrund ist auf jeden Fall schon mal nicht, nicht x-taubt,"}, {"id": 192, "start": 1293.4, "end": 1299.2, "text": "ja, ok, ok, lass mal, lass mal kurz, lass mal kurz in mich gehen, wie könnten wir ein"}, {"id": 193, "start": 1299.2, "end": 1309.76, "text": "schönes Pop-Up machen, ok, ich weiß wie wir das machen, ich weiß wie wir das machen,"}, {"id": 194, "start": 1309.76, "end": 1323.76, "text": "ok, also Massive, Massive Idee, also bg, grey, 900, pass mal auf, pass mal auf, ich hab ne"}, {"id": 195, "start": 1323.76, "end": 1330.64, "text": "Idee, so, opacity 50, so guckt, jetzt kann man schon mal durchgucken, aber nicht durchklicken,"}, {"id": 196, "start": 1330.64, "end": 1341.6, "text": "ok, jetzt haben wir so ein halbtransparentes Pop-Up und jetzt, hallo, ah, da fehlt, da"}, {"id": 197, "start": 1341.6, "end": 1350.56, "text": "fehlt ein Quote, so, und jetzt machen wir den eigentlichen Pop-Up Content da rein, kekwe,"}, {"id": 198, "start": 1350.56, "end": 1355.64, "text": "schöner, ja, rounded border ist ne gute Idee, rounded border ist ganz wichtig, kennst du"}, {"id": 199, "start": 1355.64, "end": 1364.88, "text": "das, nee, a beautiful, responsive, customizable, possible, was für ein Ding, hab ich noch nie"}, {"id": 200, "start": 1364.88, "end": 1376.04, "text": "gehört, soll das sein, sweet alert, beautiful, responsive, customizable, accessible, weiraria,"}, {"id": 201, "start": 1376.04, "end": 1381.4, "text": "alles klar, das ist irgendwelche Sachen, die man, oh, frag mich nicht, das ist, ist das"}, {"id": 202, "start": 1381.4, "end": 1386.96, "text": "nicht das, um Seitenbehinderter gerecht zu machen mit irgendwelchen annotations und sowas,"}, {"id": 203, "start": 1386.96, "end": 1392.52, "text": "supports, danke für den Zapp, replacement for java script pop-up boxes, aha, nö, das"}, {"id": 204, "start": 1392.52, "end": 1401.8, "text": "kenn ich nicht, show alert, das sieht tatsächlich ganz nett aus, aber ich will jetzt nicht"}, {"id": 205, "start": 1401.8, "end": 1417.16, "text": "irgendwie ne pop-up library oder so da reinhauen, scheint sehr beliebt zu sein, rounded border"}, {"id": 206, "start": 1417.16, "end": 1428.64, "text": "machen wir, so, also, poggers, poggers pop-up, also, so, das hier wird absolute position,"}, {"id": 207, "start": 1428.64, "end": 1445.2, "text": "left 5, top 5, right 5, bottom 5, ah, guck mal hier, da stehts hier, kqw ist da, so, rounded,"}, {"id": 208, "start": 1445.2, "end": 1454.92, "text": "ganz wichtig, border, was ist denn der Unterschied zwischen border und border 1, das ist gleich,"}, {"id": 209, "start": 1454.92, "end": 1466.36, "text": "oder, also jetzt war rounded 1, nicht border, ich bin ja auch blöd, irgendeiner hat gespammt,"}, {"id": 210, "start": 1466.36, "end": 1479.12, "text": "ja, weg, weg, weg mit spammern, so, tatsächlich, massive, so, ok, border, grey, so, und jetzt"}, {"id": 211, "start": 1479.12, "end": 1492.0, "text": "sollte man halbwegs, zumindest was ein bisschen aussieht wie ein pop-up haben, seht ihr irgendwas,"}, {"id": 212, "start": 1492.0, "end": 1520.96, "text": "ich seh nix, border 4, wo ist der border, ah, moment die opacity ist vererbt, äh, äh,"}, {"id": 213, "start": 1520.96, "end": 1529.12, "text": "was sagt, ja die stile opacity ist vererbt, lull, also muss ich hier sagen opacity 0, äh,"}, {"id": 214, "start": 1529.12, "end": 1554.56, "text": "ne 100, oder, ne, ähm, oh Gott, warum ist css immer so ein krasse abfuckender, oh, manne,"}, {"id": 215, "start": 1554.56, "end": 1565.48, "text": "das ist grau, ich glaub ich weiß was ich falsch mach, ja, wir können hintergrund opacity machen,"}, {"id": 216, "start": 1565.48, "end": 1585.16, "text": "äh, bg opacity, 50 oder so, ah ja, ok, schon besser, ok, ok, alles klar, gut, so, und jetzt"}, {"id": 217, "start": 1585.16, "end": 1591.0, "text": "bg grey 100, jetzt sollte das doch ein bisschen, ja, das sieht doch, guck mal, das sieht tatsächlich"}, {"id": 218, "start": 1591.0, "end": 1599.4, "text": "nach einem halbwegs brauchbaren pop-up aus, so, padding 2, guck mal, das hat doch schon"}, {"id": 219, "start": 1599.4, "end": 1605.44, "text": "mal was von einem pop-up, was als pop-up durchgeht, der hintergrund ist grau, man kann nicht durch"}, {"id": 220, "start": 1605.44, "end": 1610.8, "text": "klicken und hier kann man drinnen rum, oh, was ist das da, ich hab's genau gesehen, man"}, {"id": 221, "start": 1610.8, "end": 1617.32, "text": "konnte gerade im hintergrund zeug anklicken, ihh, warum kann der hintergrund überhaupt"}, {"id": 222, "start": 1617.32, "end": 1628.68, "text": "fokus kriegen, anzeige direkt, was ist da, ihh, na gut, das macht ja eh keiner, so, pop-up,"}, {"id": 223, "start": 1628.68, "end": 1633.52, "text": "also was muss da, was muss da in die überschrift, also in die überschrift muss sowas rein wie"}, {"id": 224, "start": 1633.52, "end": 1647.28, "text": "ehm, ehm, der sender, sender, muss da oben rein, so sender, den sender machen wir bold"}, {"id": 225, "start": 1647.28, "end": 1660.68, "text": "und text 2xl, so, so das ist der sendername, darunter kommt dann die sendung, titel oder"}, {"id": 226, "start": 1660.68, "end": 1672.6, "text": "sowas, titel, oh, ehm, und dann unten drunter der text, würde ich sagen, macht ja keiner,"}, {"id": 227, "start": 1672.6, "end": 1682.32, "text": "da kann ja nix passieren, kann ja nix passieren, was soll passieren, wenn da im hintergrund"}, {"id": 228, "start": 1682.32, "end": 1691.04, "text": "einer steuerung a drückt, so sender, titel, dann kommt der text unten drunter, ehm, die"}, {"id": 229, "start": 1691.04, "end": 1695.12, "text": "start und stoppzeit sollten wir vielleicht noch machen, ok, also, achso, wir brauchen"}, {"id": 230, "start": 1695.12, "end": 1699.56, "text": "vielleicht ein paar schließen buttons, weil, moment, wie machen wir das ding überhaupt"}, {"id": 231, "start": 1699.56, "end": 1715.76, "text": "auf und zu, sekunde, ehm, let, selected, epg, entry, so, also, das ist hidden, hidden,"}, {"id": 232, "start": 1715.76, "end": 1729.88, "text": "solange das nicht selected ist, was das für idee, das ist wishlist studio code und das"}, {"id": 233, "start": 1729.88, "end": 1735.6, "text": "ist rider, so, jetzt ist unser popup weg, gut, so, das heißt, egal was ich anklicke,"}, {"id": 234, "start": 1735.6, "end": 1742.68, "text": "ich will, dass das popup aufgeht, machen wir doch, also easy, easy, egal was ich, alter,"}, {"id": 235, "start": 1742.68, "end": 1746.24, "text": "die discount formatting hier ist schon ganz schön, ganz schön abfang, oder, das ist"}, {"id": 236, "start": 1746.24, "end": 1750.92, "text": "nicht so, als hätte ich das gemacht, wishlist studio ist irgendwie der meinung, das ist"}, {"id": 237, "start": 1750.92, "end": 1755.56, "text": "ein geiles auto formatting, was es da macht, weiß nicht so genau warum, es sieht zumindest"}, {"id": 238, "start": 1755.56, "end": 1763.8, "text": "nicht sonderlich geil aus, sieht richtig hängen geblieben aus, aber, hey, solange es funktioniert"}, {"id": 239, "start": 1763.8, "end": 1776.44, "text": "soll, soll es mir recht sein, ok, also, onclick, onclick, click, eigentlich, weil wir onclick"}, {"id": 240, "start": 1776.44, "end": 1784.96, "text": "nix großartig machen, außer, selected, epg, entry, da draufsetzen, so, und wenn ich das"}, {"id": 241, "start": 1784.96, "end": 1790.4, "text": "jetzt anklicke, kommen wir in den popup, jawoll, bäm, ist doch schon mal gut, dann kriegen"}, {"id": 242, "start": 1790.4, "end": 1802.2, "text": "wir in popup, pogchamp, ok, also, dann brauchen wir an der stelle, jetzt den titel, selected,"}, {"id": 243, "start": 1802.2, "end": 1809.04, "text": "epg, das will ich schon immer mal gucken, so, dann, moment, nee, nee, warte mal, nicht"}, {"id": 244, "start": 1809.04, "end": 1815.16, "text": "den titel, den sender, den sender will ich anzeigen, nicht, nicht den titel, also muss"}, {"id": 245, "start": 1815.16, "end": 1825.16, "text": "ich zwei sachen übergeben, oh, das ist jetzt ja schon wieder eklig, wobei, brauchen wir"}, {"id": 246, "start": 1825.16, "end": 1830.12, "text": "den sender, wir brauchen den sender nicht, so ist auch gut, es reicht, einfach, einfach"}, {"id": 247, "start": 1830.12, "end": 1834.16, "text": "den titel von dem teil anzeigen und gut ist, wen interessiert es, dass es im ersten ist,"}, {"id": 248, "start": 1834.16, "end": 1843.16, "text": "who cares, so, also, die bad homburger kartenfreunde, gut, das, das müssen wir, müssen wir später"}, {"id": 249, "start": 1843.16, "end": 1859.6, "text": "gucken, es gibt schon, es gibt schon echt unglaublich viel müll, oder, ok, wir, wir,"}, {"id": 250, "start": 1859.6, "end": 1877.68, "text": "wir cheaten, Leute, wir cheaten mal kurz, get emoji, ich brauch nen recording oder sowas,"}, {"id": 251, "start": 1877.68, "end": 1887.88, "text": "gab das nicht nen record, record emoji, ja, das meine ich, den da, den da will ich haben,"}, {"id": 252, "start": 1887.88, "end": 1895.24, "text": "was ist da, weiß ich welches emoji das ist, einfach red dot, weil, das könnte man eigentlich"}, {"id": 253, "start": 1895.24, "end": 1901.16, "text": "hier hinter machen, wenn es ne aufnahme gibt, guck mal, ist ne aufnahme, wenn das, wenn"}, {"id": 254, "start": 1901.16, "end": 1906.08, "text": "das aufgenommen wird, dann, dann könnte man hier hinter versuchen, so nen kringel hinten"}, {"id": 255, "start": 1906.08, "end": 1912.52, "text": "drin, hinten dran machen, ja, da kümmern, kümmern wir uns dann drum, ähm, Leute, wir"}, {"id": 256, "start": 1912.52, "end": 1922.36, "text": "machen hier, machen wir hier ein eigenes, ah, mal gucken, so, dann haben wir start stop"}, {"id": 257, "start": 1922.36, "end": 1932.88, "text": "zeit, sollten wir noch anzeigen, das ist glaube ich da auch nicht schlecht, also quasi, ähm,"}, {"id": 258, "start": 1932.88, "end": 1944.12, "text": "start string, cactv, stop string, so, und jetzt sollten wir zumindest durch die zeit"}, {"id": 259, "start": 1944.12, "end": 1952.48, "text": "runter stehen haben, ah, aber das ist ein bisschen groß, also, dann machen wir text, sogar text"}, {"id": 260, "start": 1952.48, "end": 1967.24, "text": "sm, ja, das ist gar nicht so blöd, hast du da auch eine user story, ja, wir haben, wir"}, {"id": 261, "start": 1967.24, "end": 1972.52, "text": "haben ganz viele user stories und, und design mockups erstellt im vor, äh, ich, ich plan"}, {"id": 262, "start": 1972.52, "end": 1988.08, "text": "da schon seit drei monaten, no cup, cup, das wird ein problem mit dem sender, ich hab"}, {"id": 263, "start": 1988.08, "end": 1996.2, "text": "die info über den sender grad nicht, man kann auch inset null schreiben, five header"}, {"id": 264, "start": 1996.2, "end": 2010.92, "text": "time, inset, was macht das, aha, bam, ah, yes, siehste, deswegen, five head chat, gut,"}, {"id": 265, "start": 2010.92, "end": 2015.36, "text": "der große duftraub, so, und jetzt muss da unten drunter, jetzt kommt ja eigentlich das"}, {"id": 266, "start": 2015.36, "end": 2033.84, "text": "wichtigste, die description, ähm, fünf abstand oder so, description, description, so, das"}, {"id": 267, "start": 2033.84, "end": 2039.56, "text": "heißt, wenn wir jetzt was finden mit description, da, bisschen klein, ja, nee, nee, nee, nee,"}, {"id": 268, "start": 2039.56, "end": 2048.48, "text": "nicht sm, einfach so, was ist das zwischen dem html, das da, das, äh, ist das wie man"}, {"id": 269, "start": 2048.48, "end": 2061.6, "text": "das ins welt macht, so escape, escape, javascript, kram, das da, ja, oder was meinste, ach stimmt,"}, {"id": 270, "start": 2061.6, "end": 2069.28, "text": "hier können wir auch inset fünf machen, ja, inset fünf, ok, also, ich mein, das sieht"}, {"id": 271, "start": 2069.28, "end": 2073.92, "text": "jetzt nicht super krass hübsch aus oder so, wisst ihr was, wir machen glaub ich ein padding"}, {"id": 272, "start": 2073.92, "end": 2083.08, "text": "mehr, das padding ist vielleicht bisschen wenig, wir machen aber padding, padding fünf, ja,"}, {"id": 273, "start": 2083.08, "end": 2097.92, "text": "schon besser, gut, so, waren wir jetzt vielleicht noch in klammern, ja, ich find das sieht"}, {"id": 274, "start": 2097.92, "end": 2106.48, "text": "brauchbar aus, ich find das sieht, das sieht brauchbar aus, wirklich viel schöner formatiert,"}, {"id": 275, "start": 2106.48, "end": 2118.76, "text": "nehmen wir den text wahrscheinlich nicht, das sieht halt so aus, wie es aussieht, das"}, {"id": 276, "start": 2118.76, "end": 2125.12, "text": "sieht doch, wir brauchen buttons, wir brauchen buttons zum schließen noch, angular, nee,"}, {"id": 277, "start": 2125.12, "end": 2128.48, "text": "mit angular hatte ich noch nie was zu tun großartig, alles was ich gesehen hab von angular hat mich"}, {"id": 278, "start": 2128.48, "end": 2140.0, "text": "aber abgeschreckt bisher, so, button, button, ich bin auch outdated, also, so, wir brauchen"}, {"id": 279, "start": 2140.0, "end": 2150.0, "text": "ein button für aufnahme und ein button für schließen, schließen, ich weiß es triggert"}, {"id": 280, "start": 2150.0, "end": 2154.08, "text": "jetzt schon wieder viele leute, dass es deutsch und englisch heißt, aber da können wir später,"}, {"id": 281, "start": 2154.08, "end": 2163.36, "text": "beigen es für hin machen, ja, ich mags welt, fühlt das nicht schlecht, aber ich kenne nur"}, {"id": 282, "start": 2163.36, "end": 2169.84, "text": "das welt und vue js halbwegs, so wie machen wir denn unseren button schön, also class,"}, {"id": 283, "start": 2169.84, "end": 2184.72, "text": "rounded button, immer, immer, ja, den machen wir rot, den aufnahme button machen wir rot,"}, {"id": 284, "start": 2184.72, "end": 2197.32, "text": "aufnahme und rot passt irgendwie zusammen, bold, font, warum nicht, und den text man weiß,"}, {"id": 285, "start": 2197.32, "end": 2204.12, "text": "dass man es auch ordentlich erkennt, schauen wie es aussieht, null, achso, ja, weil das"}, {"id": 286, "start": 2204.12, "end": 2211.52, "text": "kein text hat, ok, da muss man vielleicht ein bisschen, ein bisschen abstand oben drüber"}, {"id": 287, "start": 2211.52, "end": 2222.44, "text": "machen, das ist meine eigene box, klebt, klebt ein bisschen sehr oben, machen wir, hopp,"}, {"id": 288, "start": 2222.44, "end": 2231.92, "text": "so, woher hast du die daten von meinem tv, von meiner tv box, die, das wird gekrappt"}, {"id": 289, "start": 2231.92, "end": 2241.56, "text": "von meiner, von meinem receiver im wohnzimmer, hier, guck mal, das besteht ja aus zwei sachen,"}, {"id": 290, "start": 2241.56, "end": 2250.48, "text": "es gibt einmal ein backend, was dieses abfragen vom epg macht, von der receiver box und dann"}, {"id": 291, "start": 2250.48, "end": 2262.08, "text": "gibt es dieses frontend für diesen krempel, ja, gut, so, aufnahme button haben wir, schließen"}, {"id": 292, "start": 2262.08, "end": 2270.52, "text": "button, das sieht doch, das sieht doch eigentlich ganz ok aus, dann duplizieren wir den button"}, {"id": 293, "start": 2270.52, "end": 2282.6, "text": "mal, schließen, der schließen button, was kriegt, der kriegt einfach blue 500, so, hey,"}, {"id": 294, "start": 2282.6, "end": 2288.24, "text": "das sieht doch, ohne mist, das sieht doch tatsächlich ganz brauchbar aus, so schließen, wie schließen"}, {"id": 295, "start": 2288.24, "end": 2302.8, "text": "wir das ganze, schließen, on, klick, sagen wir einfach, selected gleich 0, so, dann sollte"}, {"id": 296, "start": 2302.8, "end": 2315.68, "text": "es wieder zugehen, schauen wir mal, zack, zack, zack, naja, oh Leute, ich habe, ich habe,"}, {"id": 297, "start": 2315.68, "end": 2326.8, "text": "ich habe die idee, um das ganze noch deutlich schicker zu machen, pass mal auf, import,"}, {"id": 298, "start": 2326.8, "end": 2337.36, "text": "von wo müssen wir importieren, swell, transitions, muss ich mal kurz nachgucken, warte mal, doch,"}, {"id": 299, "start": 2337.36, "end": 2342.48, "text": "ist richtig, was ich mache, ist richtig, was ich mache, paid und fly, ich kann nämlich"}, {"id": 300, "start": 2342.48, "end": 2347.24, "text": "ein bisschen cheaten, ich kann nämlich einfach abgucken, warte mal, ich guck mal kurz ab,"}, {"id": 301, "start": 2347.24, "end": 2358.32, "text": "so, easy, ich guck kurz ab, das ist nicht plane yawas script, nee, nee, nee, das ist"}, {"id": 302, "start": 2358.32, "end": 2363.12, "text": "nicht plane yawas script, was, wie, warum finde ich das nicht, auf, naja, das ist doch,"}, {"id": 303, "start": 2363.12, "end": 2385.04, "text": "guck mal, und was wir jetzt machen, ist folgendes, bam, ha, äh, warum, ah, ich weiß warum,"}, {"id": 304, "start": 2385.04, "end": 2388.4, "text": "ich darf nicht hinten machen, sondern ich muss dann if drum herum machen, sonst checkt"}, {"id": 305, "start": 2388.4, "end": 2403.16, "text": "er das nicht, if, das muss da rein, weil sonst ist er zu blöd, das zu checken, ah, ok, und"}, {"id": 306, "start": 2403.16, "end": 2412.48, "text": "jetzt, jetzt sollten wir, und jetzt sollten wir massive ein fade, boah, guckt euch das"}, {"id": 307, "start": 2412.48, "end": 2429.76, "text": "mal an hier, hui, hui, hui, richtig, richtig, web 6.0, paychamp, web 11.0, guck mal, wie"}, {"id": 308, "start": 2429.76, "end": 2434.92, "text": "es reingefahren kommt, plupp, fast wie medal of honor warfighter, die gegner durch den"}, {"id": 309, "start": 2434.92, "end": 2444.28, "text": "boden, hui, das, das kann ich jetzt, ich kann jetzt den ganzen tag hier rumklicken, easy,"}, {"id": 310, "start": 2444.28, "end": 2455.44, "text": "ok, das müssen wir, null will ich da nicht stehen haben, wenn es keine description gibt,"}, {"id": 311, "start": 2455.44, "end": 2470.0, "text": "dann einfach nix, der backdrop kommt auch reingefahren, ja, da kommt alles reingefahren,"}, {"id": 312, "start": 2470.0, "end": 2477.12, "text": "der backdrop kommt reingefahren, ok, das ist tatsächlich nicht so schön, dass der backdrop"}, {"id": 313, "start": 2477.12, "end": 2487.76, "text": "reingefahren kommt, ja, das müsste man eigentlich, das müsste man eigentlich doppelt machen,"}, {"id": 314, "start": 2487.76, "end": 2502.56, "text": "man müsste eigentlich den, das rein faden lassen, auch input faden, und das andere müsste"}, {"id": 315, "start": 2502.56, "end": 2507.8, "text": "man rein fliegen lassen, geht das, geht das jetzt, dass ich so, dass ich, dass ich sowas"}, {"id": 316, "start": 2507.8, "end": 2512.96, "text": "hier mache, das wird wahrscheinlich nicht, nicht, nicht funktionieren, wenn ich hier"}, {"id": 317, "start": 2512.96, "end": 2539.28, "text": "noch ein in mach, doch, funktioniert leute, easy, ponst, alles gut, so ist gut, das ist"}, {"id": 318, "start": 2539.28, "end": 2547.16, "text": "doch auf body tag ebene, das ist das oberste hier im body tag, wo das drin ist, ja, das"}, {"id": 319, "start": 2547.16, "end": 2560.68, "text": "passt, boah, zack, also jetzt für das, dass es so schnell zusammen gewurstet ist, ich"}, {"id": 320, "start": 2560.68, "end": 2581.0, "text": "muss sagen, ich finde das erstaunlich schick, blub, blub, blub, blub, blub, nice, find ich"}, {"id": 321, "start": 2581.0, "end": 2605.4, "text": "cool, hat was, buttons für das tablet etwas größer, ja, wir können die buttons insgesamt"}, {"id": 322, "start": 2605.4, "end": 2619.88, "text": "ein bisschen größer machen, wie macht man gescheit buttons größer, so jetzt, ja, sieht"}, {"id": 323, "start": 2619.88, "end": 2641.08, "text": "das ein bisschen deplatziert aus, oder, fette, pepo fat button, so, das soll jetzt erstmal"}, {"id": 324, "start": 2641.08, "end": 2645.24, "text": "rein für die optik reichen, weil wir müssen jetzt ja noch programmieren, dass man aufnehmen"}, {"id": 325, "start": 2645.24, "end": 2651.52, "text": "kann, also, wie machen wir das denn jetzt, also, wir müssen wahrscheinlich irgendwas"}, {"id": 326, "start": 2651.52, "end": 2660.76, "text": "zum server schicken, also, keine ahnung, set timer nennen wir das mal, mir fällt nämlich"}, {"id": 327, "start": 2660.76, "end": 2668.84, "text": "gerade nichts anderes ein, epg entry, so, und jetzt müssen wir das zum server schicken,"}, {"id": 328, "start": 2668.84, "end": 2675.52, "text": "ich glaube wir haben noch keinen endpunkt auf dem server, wie man das funktioniert,"}, {"id": 329, "start": 2675.52, "end": 2680.04, "text": "kannst du den frame nicht an den text anpassen, da muss ich den text fetter machen, da ist"}, {"id": 330, "start": 2680.04, "end": 2685.88, "text": "der text ganz schön, ich lasse es jetzt erstmal so, also set timer, wait, wie könnte man"}, {"id": 331, "start": 2685.88, "end": 2692.16, "text": "das jetzt schön machen, also, was müsste man denn zum server schicken, dass der aufnehmen"}, {"id": 332, "start": 2692.16, "end": 2698.56, "text": "kann, ich glaube wir müssen das backend zuerst machen, also, wir haben ja im prinzip aktuell"}, {"id": 333, "start": 2698.56, "end": 2707.52, "text": "nur zwei endpunkte, slash epg und slash image cache, also, was brauchen wir zum aufnehmen,"}, {"id": 334, "start": 2707.52, "end": 2720.2, "text": "also, record, wir könnten das so machen, aufnehmen und dann übergeben wir die event id, fertig,"}, {"id": 335, "start": 2720.2, "end": 2728.36, "text": "wir machen ein get und wir machen ein map delete, doch die haben eine eindeutige id, so was"}, {"id": 336, "start": 2728.36, "end": 2739.2, "text": "machen wir einfach, guck mal, das müsste eigentlich passen, wir sagen hier die id aufnehmen und"}, {"id": 337, "start": 2739.2, "end": 2752.88, "text": "die id löschen, so, also, int id, was ist das hier, ok, wenn man jetzt noch richtig"}, {"id": 338, "start": 2752.88, "end": 2759.48, "text": "schreiben könnte, wäre nicht schlecht, doch wir brauchen, ne doch das brauchen wir, also"}, {"id": 339, "start": 2759.48, "end": 2766.44, "text": "int id, da haben wir das delete, machen wir mal weg, das machen wir dann später, so,"}, {"id": 340, "start": 2766.44, "end": 2774.16, "text": "ich brauche als service auf jeden fall meine api dafür, sonst funktioniert das ganze nicht,"}, {"id": 341, "start": 2774.16, "end": 2777.52, "text": "ist das denn nicht sinnvoll startzeitpunkt angeben zu können, mit dem man das planen"}, {"id": 342, "start": 2777.52, "end": 2785.48, "text": "kann, ich brauche keinen startzeitpunkt angeben, weil es gibt eine record epg event, also das"}, {"id": 343, "start": 2785.48, "end": 2790.56, "text": "habe ich hier im backend gebastelt, dass es das gibt, record epg event und was der macht"}, {"id": 344, "start": 2790.56, "end": 2797.04, "text": "unter der haube ist, der lädt sich die infos runter vor dem linux receiver was er braucht"}, {"id": 345, "start": 2797.04, "end": 2814.84, "text": "um eine epg event aufnahme zu starten, also record epg event, ulong epg event id, ja da"}, {"id": 346, "start": 2814.84, "end": 2820.28, "text": "ist halt ein ulong wenns sein muss, was ist das, warum haben die eigentlich so bescheuerte"}, {"id": 347, "start": 2820.28, "end": 2825.8, "text": "datentypen, als bräuchte man allen ernstes mehr als int max für event ids, ich mein guck"}, {"id": 348, "start": 2825.8, "end": 2837.28, "text": "mal, int max ist was für ein value, das reicht wahrscheinlich für epg einträge bis zum"}, {"id": 349, "start": 2837.28, "end": 2843.52, "text": "ende der zeit, wobei gucken wir mal, vielleicht auch gar nicht mal, jetzt haben wir hier crit,"}, {"id": 350, "start": 2843.52, "end": 2852.24, "text": "ne hab ich gar nicht jetzt drinne, vielleicht doch nicht, vielleicht ist es doch sinnvoller"}, {"id": 351, "start": 2852.24, "end": 2863.16, "text": "da 64bit zu nehmen, ja ok, geh ich mit, geh ich mit, ist in ordnung, await, async gachibas,"}, {"id": 352, "start": 2863.16, "end": 2869.04, "text": "ok, also ap record event, so da haben wir die response davon, also wenn ich das richtig"}, {"id": 353, "start": 2869.04, "end": 2872.8, "text": "mitbekommen habe und wenn ich das hier ordentlich programmiert habe, ich hab es noch nicht"}, {"id": 354, "start": 2872.8, "end": 2888.24, "text": "bekommen, bekomme ich eine timer id zurück, wenn es erfolgreich programmiert wurde, stimmt,"}, {"id": 355, "start": 2888.24, "end": 2892.6, "text": "du hast recht, youtube ist irgendwann mal übergelaufen, vor nicht allzu langer zeit, oder hat gedroht"}, {"id": 356, "start": 2892.6, "end": 2903.32, "text": "überzulaufen, irgendwie sowas, ah die views, die views, ja genau, stimmt, stimmt, ja das"}, {"id": 357, "start": 2903.32, "end": 2911.64, "text": "war's, ich überleg gerade, geb ich das einfach weiter, ne, moment, wir müssen was anderes"}, {"id": 358, "start": 2911.64, "end": 2921.24, "text": "machen, also, wir müssen gucken, ne passt, also, also, ich weiß was wir machen, es ist"}, {"id": 359, "start": 2921.24, "end": 2926.56, "text": "jetzt so, stell euch mal vor, ich mach das hier auf und drücke auf aufnahme, wie lang"}, {"id": 360, "start": 2926.56, "end": 2935.9, "text": "programmierst du schon, also angefangen hab ich mal mit, als.net, 2 oder 1.1 recht"}, {"id": 361, "start": 2935.9, "end": 2948.76, "text": "neu war, also.net framework, das alte, das uralte, 2003 oder so war das, ja davor hab"}, {"id": 362, "start": 2948.76, "end": 2952.36, "text": "ich tatsächlich mal nen paistenbuch schon gelesen, und wir haben auch in der schule"}, {"id": 363, "start": 2952.36, "end": 2956.48, "text": "ein bisschen zäh gemacht, aber das zähl ich jetzt nicht, so wirklich angefangen hab ich,"}, {"id": 364, "start": 2956.48, "end": 2971.64, "text": "hab ich hier so in dem dreh würd ich sagen, weil ich weiß noch, dass, ich überleg grad,"}, {"id": 365, "start": 2971.64, "end": 2977.92, "text": "also ich weiß noch, dass, als ich damals mit.net angefangen hab, da hatten sie ganz"}, {"id": 366, "start": 2977.92, "end": 2991.56, "text": "neue generics, und ich glaub das war mit.net 2, und das eigentliche zeug, was man überall"}, {"id": 367, "start": 2991.56, "end": 3002.84, "text": "gefunden hat, war aber noch 1.1, also irgendwie in dem dreh hier,.net 3 wer macht denn sowas,"}, {"id": 368, "start": 3002.84, "end": 3011.92, "text": "ich mein.net core 3.1 geht ja noch, aber richtig, richtiges.net 3.1 ist, oder 3 ist"}, {"id": 369, "start": 3011.92, "end": 3022.24, "text": "pains champ, wie alt ich bin, ich bin 37, man glaubt das kaum, ich sitz sonntag morgens"}, {"id": 370, "start": 3022.24, "end": 3031.8, "text": "mit 37 vorm rechner und erzähl was von massive poggers 5 hat, aber so ist das halt, mein"}, {"id": 371, "start": 3031.8, "end": 3044.4, "text": "innerer zoomer braucht das, also, was ich sagen wollte, also guckt mal, mal angenommen,"}, {"id": 372, "start": 3044.4, "end": 3049.96, "text": "man klickt jetzt hier drauf und sagt aufnehmen, dann muss ja dieser eintrag hier aktualisiert"}, {"id": 373, "start": 3049.96, "end": 3060.6, "text": "werden, wisst ihr wie ich mein, und dieser eintrag, dass der aktualisiert wird, müsste"}, {"id": 374, "start": 3060.6, "end": 3067.24, "text": "ich eigentlich, wenn die aufnahme erfolgreich programmiert wurde, ein update für diesen"}, {"id": 375, "start": 3067.24, "end": 3080.32, "text": "eintrag zurückschicken, das probier ich jetzt einfach mal, ob das funktioniert, also return"}, {"id": 376, "start": 3080.32, "end": 3091.36, "text": "a wait, von der api, gut, dass ich mir bei der tv her den api mühe gegeben hab, refresh"}, {"id": 377, "start": 3091.36, "end": 3099.24, "text": "epg event, event id, so, und da soll ich jetzt ein event zurückbekommen, wyvern sagt, ich"}, {"id": 378, "start": 3099.24, "end": 3104.08, "text": "bin seit ein paar jahren cshsoftware entwickler, aber hab noch nie webdev gemacht, sondern"}, {"id": 379, "start": 3104.08, "end": 3107.72, "text": "nur backend business domain, jetzt würd ich gerne mit webdev anfangen, eventuell sogar"}, {"id": 380, "start": 3107.72, "end": 3113.48, "text": "ein startup kunden, das ist aber mutig, nix gemacht, wobei, ganz ehrlich, wenns in die"}, {"id": 381, "start": 3113.48, "end": 3117.68, "text": "hose geht, gehts halt in die hose, würdest du empfehlen microsoft, nein, also ja, ja,"}, {"id": 382, "start": 3117.68, "end": 3122.4, "text": "ja, aber blazer nicht, blazer mag ich nicht, oder lieber javascript oder was anderes, also,"}, {"id": 383, "start": 3122.4, "end": 3128.68, "text": "was ich, also, wie gesagt, ich verdiene mit dieser sache hier nicht mein geld, hauptberuflich,"}, {"id": 384, "start": 3128.68, "end": 3135.12, "text": "aber von dem, was ich gerne verwenden würde, ja, also asp.net verwendet man nicht mehr,"}, {"id": 385, "start": 3135.12, "end": 3141.64, "text": "asp.net core ist angesagt, die benahmung, das kennst du ja als cshsoftware, die benahmung"}, {"id": 386, "start": 3141.64, "end": 3147.04, "text": "bei microsoft ist ja komplett abgefuckt, also,.net framework, dann.net core, jetzt nur"}, {"id": 387, "start": 3147.04, "end": 3150.8, "text": "noch.net, dann hast du entity framework, dann hast du entity framework core, und jetzt"}, {"id": 388, "start": 3150.8, "end": 3156.84, "text": "haben sie das core weggelassen, also, die benahmung ist ja eh komplett wirr, und asp.net ist das"}, {"id": 389, "start": 3156.84, "end": 3162.92, "text": "alte, asp.net core ist das neue, was jetzt auf.net 6 beziehungsweise.net 7 basiert,"}, {"id": 390, "start": 3162.92, "end": 3168.48, "text": "weil microsoft benahmung halt einfach für ein arsch ist, ja, also asp.net core ist richtig"}, {"id": 391, "start": 3168.48, "end": 3176.88, "text": "gut, ich finde, wenn ihr mich fragt, das beste web framework was es gibt, es hat ein paar"}, {"id": 392, "start": 3176.88, "end": 3183.68, "text": "komische designentscheidungen an manchen stellen, und, dass man mittlerweile drei, vier verschiedene"}, {"id": 393, "start": 3183.68, "end": 3188.92, "text": "möglichkeiten hat, Dinge zu machen, ist auch etwas wirr, aber im gesamtpaket für mich"}, {"id": 394, "start": 3188.92, "end": 3195.36, "text": "persönlich ist es das beste web framework was es gibt, für den frontend part nehme"}, {"id": 395, "start": 3195.36, "end": 3200.48, "text": "ich eigentlich hauptsächlich javascript, plazer mag ich gar nicht, plazer gibt es"}, {"id": 396, "start": 3200.48, "end": 3205.4, "text": "in zwei verschiedenen varianten, plazer kannst du server side machen mit irgendeiner websocket"}, {"id": 397, "start": 3205.4, "end": 3212.4, "text": "verbindung, die das dann update, oder du kannst pleading edge razor mit web assembly machen,"}, {"id": 398, "start": 3212.4, "end": 3219.0, "text": "wo es eine.net runtime im browser runter lädt, und dann kannst du quasi dein frontend"}, {"id": 399, "start": 3219.0, "end": 3224.04, "text": "in c sharp programmieren, das klingt erstmal nice, in der praxis, ich muss aber sagen,"}, {"id": 400, "start": 3224.04, "end": 3227.32, "text": "ist ein bisschen her, als ich das letzte mal ausprobiert habe, in der praxis ist das gar"}, {"id": 401, "start": 3227.32, "end": 3232.2, "text": "nicht so nice gewesen, weil die ladezeiten der seite wirklich unterirdisch waren, und"}, {"id": 402, "start": 3232.2, "end": 3237.84, "text": "die ladezeiten kommen ja noch dabei, also sprich, keine ahnung, wenn das fünf sekunden"}, {"id": 403, "start": 3237.84, "end": 3243.88, "text": "runter lädt, und die seite nochmal fünf sekunden lädt, ich meine, guck mal, meine seite braucht"}, {"id": 404, "start": 3243.88, "end": 3249.48, "text": "zum beispiel hier fünf sekunden, bis das, naja, eine sekunde, bis das überhaupt die"}, {"id": 405, "start": 3249.48, "end": 3254.16, "text": "ganzen epg daten gefetched hat, ja da kommt ja die ladezeit noch dazu von.net, da hast"}, {"id": 406, "start": 3254.16, "end": 3257.76, "text": "du sechs, sieben sekunden ladezeit, ladezeit, das kannst du vergessen, solange war doch"}, {"id": 407, "start": 3257.76, "end": 3266.24, "text": "keiner, also ich mag weder razor pages, noch blazer, noch sonstige frontend geschichten,"}, {"id": 408, "start": 3266.24, "end": 3273.2, "text": "sondern, ich benutze asp.net core eigentlich rein als backend api, endpunkt, auch mit"}, {"id": 409, "start": 3273.2, "end": 3279.48, "text": "craftql gibt es auch coole libraries für.net, und frontend sachen in javascript, du kannst"}, {"id": 410, "start": 3279.48, "end": 3286.92, "text": "mittlerweile beides halbwegs verwenden, also du kannst javascript, also der neueste trend"}, {"id": 411, "start": 3286.92, "end": 3296.16, "text": "in der frontendentwicklung ist ja, dass man client side application und server side render"}, {"id": 412, "start": 3296.16, "end": 3304.88, "text": "ring kombiniert, und da gibt es verschiedene frameworks für, ja, das gibt next und nuxt"}, {"id": 413, "start": 3304.88, "end": 3312.0, "text": "und unsweltkit und dinger, und da kannst du die seite schon vorrendern lassen auf dem"}, {"id": 414, "start": 3312.0, "end": 3317.08, "text": "server, was den vorteil hat, die seite wird deutlich schneller angezeigt auf dem client,"}, {"id": 415, "start": 3317.08, "end": 3321.08, "text": "und dann kannst du das auf dem client quasi umwandeln, nachdem man das runtergeladen hat"}, {"id": 416, "start": 3321.08, "end": 3325.0, "text": "in eine reine client side application, da hast du das beste aus beiden welten, das ist"}, {"id": 417, "start": 3325.0, "end": 3330.56, "text": "so der aktuelle trend das so zu machen, hat auch den vorteil suchmaschinen können die"}, {"id": 418, "start": 3330.56, "end": 3336.72, "text": "seiten ordentlich indizieren, weil sie eben inhalt sehen, also meine persönliche lieblingskombination"}, {"id": 419, "start": 3336.72, "end": 3346.28, "text": "aktuell ist asp.net core backend api mit entweder vue js oder neuerdings svelte, svelte finde"}, {"id": 420, "start": 3346.28, "end": 3352.48, "text": "ich richtig nice, im frontend, und ob man dann server side rendering mit dabei macht"}, {"id": 421, "start": 3352.48, "end": 3359.36, "text": "oder nicht hängt ein bisschen vom anwendungszweck ab, tja, kennst du gute tutorials und ressourcen,"}, {"id": 422, "start": 3359.36, "end": 3363.44, "text": "das kommt ganz entscheidend drauf an was man eigentlich genau verwenden will, also für"}, {"id": 423, "start": 3363.44, "end": 3369.48, "text": "vue js finde ich ist mit abstand das einfachste framework zum einsteigen, weil es vom handling"}, {"id": 424, "start": 3369.48, "end": 3376.64, "text": "her relativ easy ist, finde ich, was ist das denn, computer explodes, weil es vom handling"}, {"id": 425, "start": 3376.64, "end": 3383.12, "text": "her am intuitivsten ist, finde ich, manch einer wird sagen angular, dann musst du aber"}, {"id": 426, "start": 3383.12, "end": 3389.28, "text": "erstmal dich durch 30.000 files kämpfen, oder manch machen auch react oder sowas, aber"}, {"id": 427, "start": 3389.28, "end": 3393.04, "text": "eigentlich ist es egal, eigentlich ist es egal, ob du vue oder react oder svelte oder"}, {"id": 428, "start": 3393.04, "end": 3398.12, "text": "angular nimmst, solange du nicht angular nimmst, kannst du damit alles was anfangen, aber ich"}, {"id": 429, "start": 3398.12, "end": 3403.28, "text": "finde vue js ist zum einstieg am besten, die haben ziemlich gute offizielle docs, und"}, {"id": 430, "start": 3403.28, "end": 3409.4, "text": "zu vue js findest du auch tausende tutorials, in kombination mit dass es, wie ich finde,"}, {"id": 431, "start": 3409.4, "end": 3415.68, "text": "die einfachste synthax hat, ist es nicht schlecht, finde ich gut zum einstieg, svelte ist aber"}, {"id": 432, "start": 3415.68, "end": 3420.36, "text": "auch cool, und ansonsten, wenn du einfach nur sicher gehen willst, dass es weit verbreitet"}, {"id": 433, "start": 3420.36, "end": 3425.28, "text": "ist und du mal leute für findest und sonst was, dann eindeutig react, weil react ist"}, {"id": 434, "start": 3425.28, "end": 3440.36, "text": "das mit abstand verbreitetste von allen, ja, so würde ich das machen, ne, würde ich nicht"}, {"id": 435, "start": 3440.36, "end": 3445.24, "text": "machen, da muss ich mit express rumwursten, also ich habe mal ein tutorial gesehen für"}, {"id": 436, "start": 3445.24, "end": 3452.56, "text": "express und ich muss ehrlich sagen, da ist mir asp.net core umlängen lieber, als express,"}, {"id": 437, "start": 3452.56, "end": 3475.56, "text": "was ich da gesehen habe, aber mittwoch nvt test, was ist denn ein nvt test, nvt test,"}, {"id": 438, "start": 3475.56, "end": 3484.96, "text": "kann man danach suchen, ohne dass man monka tost wird, ok, ich hab keine, ach ist das"}, {"id": 439, "start": 3484.96, "end": 3493.16, "text": "für sprache lernen oder sowas, ach ne, netzwerk technik, netzwerk technik test, was wollen"}, {"id": 440, "start": 3493.16, "end": 3518.16, "text": "die da so wissen, monorepo ist der neue shit, ja, aber es ist jetzt nicht unbedingt, was"}, {"id": 441, "start": 3518.16, "end": 3523.92, "text": "ich so, wer weiß ich, also wie man seine repos organisiert, hat erstmal wenig mit der, welche"}, {"id": 442, "start": 3523.92, "end": 3530.52, "text": "technologie verwende ich zu tun, also es ist jetzt egal, ob er, ob er sfeld, angular, react"}, {"id": 443, "start": 3530.52, "end": 3536.92, "text": "oder sonst was nimmt und was im back end, du willst was mit maps integrationen bauen,"}, {"id": 444, "start": 3536.92, "end": 3544.52, "text": "ja, das kannst du mit so ziemlich allem machen, musst dir nur überlegen, ob es google maps"}, {"id": 445, "start": 3544.52, "end": 3551.68, "text": "sein soll oder ob sowas wie open street maps tut, open street maps tut es in der regel,"}, {"id": 446, "start": 3551.68, "end": 3561.24, "text": "aber wenn es ein bisschen mehr sein darf, gibts noch map box oder google maps, wobei"}, {"id": 447, "start": 3561.24, "end": 3569.64, "text": "google maps muss ich ehrlich sagen, wird relativ schnell teuer, ich hab ja mal was"}, {"id": 448, "start": 3569.64, "end": 3574.64, "text": "mit dem kollege programmiert, ist aus der alpha, aus der alpha phase nie rausgekommen,"}, {"id": 449, "start": 3574.64, "end": 3580.36, "text": "da haben wir was programmiert, wo man, wo handwerker, die die route besser planen können"}, {"id": 450, "start": 3580.36, "end": 3588.48, "text": "am tag, da konntest du die termine eintragen und dann hat es dir ausgerechnet quasi, wer"}, {"id": 451, "start": 3588.48, "end": 3598.0, "text": "mit welchem auto, welche route die leute am besten abfährt, und da haben wir ein open"}, {"id": 452, "start": 3598.0, "end": 3604.44, "text": "street maps routenplaner für verwendet von github, das an sich war ein cooles projekt,"}, {"id": 453, "start": 3604.44, "end": 3614.36, "text": "gerade weil das auch timeslots unterstützt hat mit pufferzeit und sowas, aber für adressvervollständigung"}, {"id": 454, "start": 3614.36, "end": 3619.6, "text": "und sowas mussten wir google maps verwenden, weil alles andere konntest du vergessen, ich"}, {"id": 455, "start": 3619.6, "end": 3624.92, "text": "hab nichts gefunden, was ansatzweise da vergleichbar wäre mit google maps und ich hab festgestellt,"}, {"id": 456, "start": 3624.92, "end": 3634.76, "text": "adressvervollständigung mit google maps ist saumäßig teuer, also das ist nicht so, dass"}, {"id": 457, "start": 3634.76, "end": 3640.36, "text": "du denkst, ah da kannst du quasi jetzt 3, 3 monat lang tippen und nee nee nee nee, das"}, {"id": 458, "start": 3640.36, "end": 3645.68, "text": "ist gar nicht, du hast 10.000 euro google rechnung gemacht, ja wunderbar, das ist ganz"}, {"id": 459, "start": 3645.68, "end": 3653.04, "text": "schön teuer adressvervollständigung mit google maps zu machen, ja klar warum nicht, kannst"}, {"id": 460, "start": 3653.04, "end": 3658.4, "text": "du machen, du kannst alles miteinander koppeln, du machst im backend ein paar api endpunkte"}, {"id": 461, "start": 3658.4, "end": 3664.96, "text": "und den disfrontend machst du rein kleinseitig, da ist es egal, du kannst auch cobol backend"}, {"id": 462, "start": 3664.96, "end": 3678.08, "text": "machen, wenn es einen gescheiten webserver für cobol gibt, das ist ja mal rundum, das"}, {"id": 463, "start": 3678.08, "end": 3686.88, "text": "kann ja alles sein und haben sich rausgeschmissen, nee oder, haben gesagt ja shit happens"}, {"id": 464, "start": 3708.08, "end": 3722.52, "text": "ja ich hab vom paisen ökosystem wenig ahnung, ok weiter gehts, so wir sind beim, also wo"}, {"id": 465, "start": 3722.52, "end": 3729.4, "text": "sind wir stehen geblieben, wir schicken jetzt was ans server, der server nimmt auf und schickt"}, {"id": 466, "start": 3729.4, "end": 3741.72, "text": "uns was zurück, also wir machen jetzt ein get request await fetch, so http doppelpunkte"}, {"id": 467, "start": 3741.72, "end": 3746.36, "text": "localhost 4500, das müssen wir übrigens auch noch überschreiben, dass es dann wenns deployed"}, {"id": 468, "start": 3746.36, "end": 3754.0, "text": "ist ordentlich funktioniert, weil dann funktioniert localhost nicht mehr, so und jetzt die id,"}, {"id": 469, "start": 3754.0, "end": 3767.52, "text": "wir hängen das einfach hintereinander, epg entry event id, ja und jetzt geben wir mal"}, {"id": 470, "start": 3767.52, "end": 3778.64, "text": "aus, ob da was ordentliches zurückkommt, schauen wir mal, backend neu starten und gucken ob"}, {"id": 471, "start": 3778.64, "end": 3791.72, "text": "das klappt, das klappt selten beim ersten, beim first try, mal gucken, also wir nehmen"}, {"id": 472, "start": 3791.72, "end": 3797.88, "text": "jetzt auf irgendwas, dass er nicht gleich anfängt hier das da, klein gegen groß, das unglaubliche"}, {"id": 473, "start": 3797.88, "end": 3809.24, "text": "duel, das wollte ich schon immer auf dem aufnahme, ah ich hab die funktion überhaupt nirgendswo"}, {"id": 474, "start": 3809.24, "end": 3822.68, "text": "eingefügt, ok, ja das sollte man vielleicht noch machen, on click, so set timer, selected"}, {"id": 475, "start": 3822.68, "end": 3840.12, "text": "epg entry, ok das da, aufnahme, was not found, wait a minute, ah record slash, ja wenn man"}, {"id": 476, "start": 3840.12, "end": 3856.4, "text": "das richtig macht, dann funktioniert es wahrscheinlich auch, so jetzt aber, bamm, alter wo ist das"}, {"id": 477, "start": 3856.4, "end": 3878.56, "text": "denn, was, aber guck mal wir haben jetzt zumindest den request, ok request, köl, was, äh ja,"}, {"id": 478, "start": 3878.56, "end": 3898.16, "text": "not authorized, ok massive password leak leute, häh, funktioniert doch, fail to fetch, häh,"}, {"id": 479, "start": 3898.16, "end": 3916.76, "text": "was ist das denn für ein schwachsinn, jetzt hats funktioniert, hm, hm, das ist ja komisch,"}, {"id": 480, "start": 3916.76, "end": 3932.6, "text": "machen die gehen und dann wieder nicht, und jetzt ist dvr state null, ist null was gutes,"}, {"id": 481, "start": 3932.6, "end": 3946.84, "text": "oh ne minute, das ist blödsinn was ich hier gemacht hab, äh wartet mal, ja das brauchen"}, {"id": 482, "start": 3946.84, "end": 3951.72, "text": "wir überhaupt nicht, ähm wollen wir was anderes, das ist das ist das falsche, das will ich"}, {"id": 483, "start": 3951.72, "end": 3960.08, "text": "gar nicht, return, jetzt muss ich ernsthaft den kram da noch mal reinschreiben, das ist"}, {"id": 484, "start": 3960.08, "end": 3974.28, "text": "doch eklig, new, epg event, muss ich wirklich den ganzen krempel hier noch mal machen, ja"}, {"id": 485, "start": 3974.28, "end": 3981.48, "text": "das ist das ist doof, da muss ich mir was anderes überlegen, wartet mal, wo mach ich denn das"}, {"id": 486, "start": 3981.48, "end": 3990.68, "text": "hier, pff, das muss ich irgendwie ausladen, guck mal ich müsste den ganzen krempel jetzt"}, {"id": 487, "start": 3990.68, "end": 3999.52, "text": "hier copy pasten von, ok wir machen das anders, wir schicken nicht das ganze event zurück,"}, {"id": 488, "start": 3999.52, "end": 4003.72, "text": "wir schicken nicht das ganze event zurück, ich habs mir anders überlegt, wir returnen"}, {"id": 489, "start": 4003.72, "end": 4028.56, "text": "einfach nur, ob dvr state jetzt auf scheduled ist, fertig, true false return, gutes verstanden,"}, {"id": 490, "start": 4028.56, "end": 4037.16, "text": "und wenn true zurück kommt dann hat das aufnehmen geklappt, true, true null w, ok gut, alles"}, {"id": 491, "start": 4037.16, "end": 4044.68, "text": "klar, wenn true zurück kommt hat das aufnehmen geklappt, das heißt wir müssen jetzt gucken"}, {"id": 492, "start": 4044.68, "end": 4052.92, "text": "beim rendern von klein gegen, das muss ich gleich suchen wenn ich refresche, das heißt"}, {"id": 493, "start": 4052.92, "end": 4060.28, "text": "jetzt sollte, jetzt sollten wir hier anzeigen, dass das schon programmiert ist, also, wie"}, {"id": 494, "start": 4060.28, "end": 4068.36, "text": "machen wir das denn jetzt schön, klein gegen groß, das ist eine unglaubliche duelle, alleine"}, {"id": 495, "start": 4068.36, "end": 4075.76, "text": "schon der titel von diesem krempel immer, also wie machen wir das denn jetzt am besten,"}, {"id": 496, "start": 4075.76, "end": 4084.0, "text": "hier ist der titel, kannst du auch einen statuscode, ja könnte ich auch, hatte ich nicht hier"}, {"id": 497, "start": 4084.0, "end": 4091.6, "text": "irgendwo dieses ding im hintergrund da, so, das heißt wenn das schon recorded ist dann"}, {"id": 498, "start": 4091.6, "end": 4107.0, "text": "machen wir sowas, also nicht überall, nicht überall, ja, if, if epg entry is scheduled"}, {"id": 499, "start": 4107.0, "end": 4114.68, "text": "und funds, postchamp, warum ist denn da so viel scheduled, ah weil die dinger schon"}, {"id": 500, "start": 4114.68, "end": 4121.32, "text": "programmiert sind, ja die guckt gerne tatort, ja das hat die wahrscheinlich wirklich programmiert,"}, {"id": 501, "start": 4121.32, "end": 4126.72, "text": "ein sommer in der toskana und tatort unklare lage, alles klar, und jetzt ist auch klein"}, {"id": 502, "start": 4126.72, "end": 4135.16, "text": "gegen groß das unglaubliche duelle programmiert, gut, sehr schön, also das funds, das funds,"}, {"id": 503, "start": 4135.16, "end": 4139.04, "text": "da sieht man was aufgenommen wird, jetzt muss natürlich aufnahmen auch wieder löschen"}, {"id": 504, "start": 4139.04, "end": 4151.36, "text": "können, gut, aufnahmen wieder löschen, machen wir hier oben, hier ist das popup, ja ja wir"}, {"id": 505, "start": 4151.36, "end": 4164.44, "text": "machen das mit aufnahmen löschen, jetzt popup, startzeit description titel, hinter den titel"}, {"id": 506, "start": 4164.44, "end": 4178.6, "text": "würde ich sagen, und auch so ein ding, jo, das man weiß das nimmt auf, ok, jetzt müssen"}, {"id": 507, "start": 4178.6, "end": 4184.36, "text": "wir nochmal eine sache testen ob das updaten klappt, also sprich ich sag ihm jetzt nehm"}, {"id": 508, "start": 4184.36, "end": 4197.32, "text": "auf set timer, records, epg entry, event id, der aufnahme button muss disabled werden,"}, {"id": 509, "start": 4197.32, "end": 4201.96, "text": "ne ne ich verwende den aufnahme button für aufnahme programmieren und löschen, das"}, {"id": 510, "start": 4201.96, "end": 4208.12, "text": "heißt wir müssen, ok, ihr habt recht, guck mal wir müssen sowas hier gucken, aufnahme,"}, {"id": 511, "start": 4208.12, "end": 4221.44, "text": "da darf nicht aufnahme rein, da muss drinnen stehen, is scheduled, und wenn ja löschen"}, {"id": 512, "start": 4221.44, "end": 4233.08, "text": "und wenn nein dann aufnahme, er steht löschen drin, nur dass er noch nix macht, wir müssen"}, {"id": 513, "start": 4233.08, "end": 4245.28, "text": "nochmal kurz gucken ob das updaten, wir machen das löschen glaube ich vorher, ok also das"}, {"id": 514, "start": 4245.28, "end": 4258.6, "text": "funktioniert, jetzt müssen wir mal gucken wenn, set timer, also jetzt müssen wir nämlich"}, {"id": 515, "start": 4258.6, "end": 4278.0, "text": "schauen wenn, wenn das programmiert ist, dann wollen wir was anderes machen, also wenn das"}, {"id": 516, "start": 4278.0, "end": 4289.56, "text": "nicht programmiert ist dann wollen wir es programmieren und wenn das programmiert ist"}, {"id": 517, "start": 4289.56, "end": 4295.72, "text": "dann wollen wir es löschen, also machen wir sowas hier nur das wir hier sagen record,"}, {"id": 518, "start": 4295.72, "end": 4306.88, "text": "das gleiche nur das wir kein get schicken sondern das wir ein delete schicken, ich glaube"}, {"id": 519, "start": 4306.88, "end": 4318.0, "text": "so macht man das mit fetch, ok wir schicken ein delete, gut geht nicht weil ist logisch"}, {"id": 520, "start": 4318.0, "end": 4328.04, "text": "haben wir noch nicht programmiert, alles klar, ok also jetzt müssen wir diesen Krempel hier"}, {"id": 521, "start": 4328.04, "end": 4340.04, "text": "machen, map delete, wir kriegen im Prinzip können wir das hier kopieren, map delete"}, {"id": 522, "start": 4340.04, "end": 4348.96, "text": "record id, passt und das hier unten können wir eigentlich genau wieder genauso machen"}, {"id": 523, "start": 4348.96, "end": 4354.2, "text": "bloß dass wir jetzt den state nicht haben wollen also wenn es nicht scheduled ist, ist"}, {"id": 524, "start": 4354.2, "end": 4360.56, "text": "true, habe ich denn schon eine api für delete event, ich habe eine für record event, habe"}, {"id": 525, "start": 4360.56, "end": 4369.04, "text": "ich eine für delete event, sieht nicht so aus, wie deleted man dann events, ok das muss"}, {"id": 526, "start": 4369.04, "end": 4389.68, "text": "ich gucken, wie deleted man, ne nicht epg, das ist wahrscheinlich bei dvr jetzt, delete"}, {"id": 527, "start": 4389.68, "end": 4405.36, "text": "gibt sowas hier, ok ne, create entry, dvr entry cancel, die id vom record, wait a minute,"}, {"id": 528, "start": 4405.36, "end": 4416.0, "text": "die id vom record habe ich im frontend aber gar nicht, alter pains champ, epg event is"}, {"id": 529, "start": 4416.0, "end": 4439.0, "text": "scheduled habe ich hier nur, ich brauche noch tja dvr, so das ist natürlich doof, wo"}, {"id": 530, "start": 4439.0, "end": 4457.8, "text": "befülle ich den kram denn, monka, so viel zeug hier, dvr, ok geben, kann optional sein,"}, {"id": 531, "start": 4457.8, "end": 4469.6, "text": "das ist richtig, das kann optional sein, das kann auch hier optional sein, alles klar, gut"}, {"id": 532, "start": 4469.6, "end": 4488.56, "text": "jetzt haben wir den state, muss ich das backend neu starten, paypo please, musik, gut, löschen,"}, {"id": 533, "start": 4488.56, "end": 4501.68, "text": "müssen wir ja, also wie kriege ich den kram denn jetzt gelöscht, ich habe die id, so,"}, {"id": 534, "start": 4501.68, "end": 4509.64, "text": "wait a minute, ich brauche die id gar nicht, ich kann mir einfach das event abrufen mit"}, {"id": 535, "start": 4509.64, "end": 4516.12, "text": "der id und dann nehme ich hier aus dem event die id, brauche ich gar nicht, das hätte"}, {"id": 536, "start": 4516.12, "end": 4524.96, "text": "ich mir ersparen können was ich eben gemacht habe, record, und jetzt brauche ich noch was"}, {"id": 537, "start": 4524.96, "end": 4531.28, "text": "um records zu löschen, also so funktioniert das, gut, das heißt wir kopieren uns diesen"}, {"id": 538, "start": 4531.28, "end": 4548.12, "text": "krample record event und nennen es irgendwie delete, irgendwie sowas, timer, nennen wir"}, {"id": 539, "start": 4548.12, "end": 4555.08, "text": "das mal eher delete timer, weil wenn ich das mit dem epg event mache, dann muss ich das"}, {"id": 540, "start": 4555.08, "end": 4578.92, "text": "auch nicht hier drinnen machen, sondern kann das direkt, refresh epg event, schauen ob das"}, {"id": 541, "start": 4578.92, "end": 4585.26, "text": "irgendwie Sinn ergibt was ich da mache, event id, so also den krample brauchen wir auf jeden"}, {"id": 542, "start": 4585.26, "end": 4596.16, "text": "fall nicht mehr, den brauchen wir auch nicht mehr, ja das hier ist epg event, so und jetzt"}, {"id": 543, "start": 4596.16, "end": 4606.92, "text": "soll das löschen, löschen funktioniert mit dvr entry cancel, also dvr entry cancel, und"}, {"id": 544, "start": 4606.92, "end": 4625.28, "text": "zwar mit parametern, die id vom event, ne nicht vom event, vom, also wirklich konsistent"}, {"id": 545, "start": 4625.28, "end": 4629.8, "text": "ist die benahmung bei denen auch nicht, wieso das ist doch gar nicht, sieht doch eigentlich"}, {"id": 546, "start": 4629.8, "end": 4639.96, "text": "ganz gut aus, so und jetzt müssen wir hoffen dass es das gibt, so event id brauchen wir"}, {"id": 547, "start": 4639.96, "end": 4646.12, "text": "nicht, dvr create response, ja was kriegen wir hier überhaupt für ne response, keine"}, {"id": 548, "start": 4646.12, "end": 4652.64, "text": "ahnung, müssen wir mal ausprobieren, weiß ich doch nicht, was kriegt man da für ne response"}, {"id": 549, "start": 4652.64, "end": 4670.68, "text": "wenns funktioniert hat, ja, zack, also jetzt machen wir mal, und 1234 was es definitiv"}, {"id": 550, "start": 4670.68, "end": 4679.88, "text": "nicht gibt, not found, muss das ein post sein, ok das ist aber auch hardcore inkonsistent"}, {"id": 551, "start": 4679.88, "end": 4686.96, "text": "alter, warum muss das beim create und get sein und beim löschen ein post, was ist denn"}, {"id": 552, "start": 4686.96, "end": 4705.32, "text": "das für ein blödsinn, wer hat sich das ausgedacht da, bei tvheadend, ok also es muss ein post,"}, {"id": 553, "start": 4705.32, "end": 4727.04, "text": "ne, post async sein, receive, was auch immer, so und wie sieht das reply aus, wenn man,"}, {"id": 554, "start": 4727.04, "end": 4733.12, "text": "das ist keine ahnung was das sein soll, irgendwas was noch nicht mal eine offizielle doku hat,"}, {"id": 555, "start": 4733.12, "end": 4743.28, "text": "so jetzt brauchen wir nochmal, Leute ich brauch mal die event id von dem ding, epg entry,"}, {"id": 556, "start": 4743.28, "end": 4757.4, "text": "oh ich muss die klima an machen, viel zu warm, so dot net, hier event id, dvr event, komm"}, {"id": 557, "start": 4757.4, "end": 4763.12, "text": "hier lass dich markieren, was passiert wenn wir das jetzt löschen, was passiert wenn"}, {"id": 558, "start": 4763.12, "end": 4771.12, "text": "wir das hier löschen, also so, empty reply, na geil, ist immer, moment da muss ich jetzt"}, {"id": 559, "start": 4771.12, "end": 4787.28, "text": "vielleicht den get machen, kriege ich nie den reply, vielleicht ist es jetzt schon"}, {"id": 560, "start": 4787.28, "end": 4816.72, "text": "weg, ne, hm,"}, {"id": 561, "start": 4816.72, "end": 4826.88, "text": "nochmal ein telit, ich bezweifle, dass das was bringt, ok, wir googeln mal wie das andere"}, {"id": 562, "start": 4826.88, "end": 4849.24, "text": "machen, ok da gibt es kein beispiel für, hm, wie kriegen wir das gelöscht gescheit,"}, {"id": 563, "start": 4849.24, "end": 4870.56, "text": "ich würde fast sagen das geht so, muss man das vielleicht ul encode, Leute kann das sein,"}, {"id": 564, "start": 4870.56, "end": 4892.16, "text": "dass das irgendwie nicht funktioniert, ist hier bestimmt ein get, dvr, not found, warum"}, {"id": 565, "start": 4892.16, "end": 4900.0, "text": "ist das not found, da gibt es auch gar keinen sinn dass das not found ist, ap dvr, entry"}, {"id": 566, "start": 4900.0, "end": 4911.24, "text": "cancel, duu id, ach moment, das muss ein fragezeichen sein, das muss ein fragezeichen sein Leute,"}, {"id": 567, "start": 4911.24, "end": 4919.96, "text": "meine sündag stimmt nicht, erik danke für den sub, grepp.app, was soll ich damit machen,"}, {"id": 568, "start": 4919.96, "end": 4928.16, "text": "ne das bringt nichts, jetzt wird es wahrscheinlich funktionieren, ah, ok gut, jetzt funktioniert"}, {"id": 569, "start": 4928.16, "end": 4933.52, "text": "es auch, also empty, empty reply, ok, na gut, dann kann ich damit nichts anfangen, also"}, {"id": 570, "start": 4933.52, "end": 4940.16, "text": "delete timer epg event, alles klar, so blablub, dann stimmt das ja was ich mache hier, das"}, {"id": 571, "start": 4940.16, "end": 4948.24, "text": "ist eigentlich alles gut so, so nur dass ich eigentlich gar nichts receive ehrlich gesagt,"}, {"id": 572, "start": 4948.24, "end": 4955.2, "text": "weil es gibt nichts zu receiveen und auch nichts zu return, das klappt einfach, wenn"}, {"id": 573, "start": 4955.2, "end": 4960.64, "text": "man glück hat oder wenn man pech hat dann klappt es halt nicht, so, das brauchen wir"}, {"id": 574, "start": 4960.64, "end": 4976.12, "text": "nicht, wir brauchen einfach nur record, delete, so, tja, das ist ziemlich ja müll dass da"}, {"id": 575, "start": 4976.12, "end": 4983.28, "text": "nichts returned wird, jetzt muss ich den kram tatsächlich nochmal abfragen und gucken ob"}, {"id": 576, "start": 4983.28, "end": 4990.4, "text": "es jetzt richtig ist, das ist ok, das ist eine äußerst ineffiziente möglichkeit das"}, {"id": 577, "start": 4990.4, "end": 4997.08, "text": "zu machen, aber ok, tja, ok, dann machen wir es so, das heißt ich frage das jetzt doppelt"}, {"id": 578, "start": 4997.08, "end": 5004.64, "text": "und dreifach ab, einmal vorher, einmal zum deleting und dann danach, nice, ok, brauche"}, {"id": 579, "start": 5004.64, "end": 5013.84, "text": "mal drei requests anstatt von einem, soll mir recht sein, ok, alles klar, das heißt"}, {"id": 580, "start": 5013.84, "end": 5018.96, "text": "jetzt sollten wir da true zurück bekommen wenn es gelöscht wurde, true 0w bekommen"}, {"id": 581, "start": 5018.96, "end": 5031.4, "text": "wir zurück, löschen, warum, bad request, post, ah, Moment, es darf ja gar kein post"}, {"id": 582, "start": 5031.4, "end": 5038.08, "text": "sein, ich dachte ja nur es muss ein post sein, es ist gar kein post, es ist ein get, einfach"}, {"id": 583, "start": 5038.08, "end": 5060.36, "text": "ein ganz normaler get, ok, meine Güte, was ein, oh alter, get, api, warum, 400, why,"}, {"id": 584, "start": 5060.36, "end": 5079.24, "text": "400, was willst du von mir, weshalb, get, das ist doch richtig, api, dvr, entry, cancel,"}, {"id": 585, "start": 5079.24, "end": 5094.04, "text": "ach da hat jetzt gecancelt oder was, wait a minute, jetzt, was ist das denn, 400, cancel,"}, {"id": 586, "start": 5094.04, "end": 5103.4, "text": "warum ruft der jetzt cancel auf, der soll nicht cancel aufrufen, was, ok, Moment, jetzt"}, {"id": 587, "start": 5103.4, "end": 5123.4, "text": "pflege ich den mal durch, scale is false, warum ruft der denn noch, hä, Leute irgendwie check"}, {"id": 588, "start": 5123.4, "end": 5128.24, "text": "ich das gerade nicht, jetzt hat es funktioniert, eben vorher gab es noch einen Error, da kann"}, {"id": 589, "start": 5128.24, "end": 5138.88, "text": "auch was nicht, das ist auch richtig, warum gab es da vorhin einen Error, und jetzt geht"}, {"id": 590, "start": 5138.88, "end": 5147.52, "text": "es wieder, irgendwie ist das pains champ, du hast wahrscheinlich better twitch tv nicht"}, {"id": 591, "start": 5147.52, "end": 5166.36, "text": "installiert, ok, das funktioniert, refresh, also das delete, das delete, nee, ich bekomme"}, {"id": 592, "start": 5166.36, "end": 5178.84, "text": "anfälle hier, was ist denn das, so schwer kann es doch nicht sein, Leute ich programmier"}, {"id": 593, "start": 5178.84, "end": 5186.8, "text": "jetzt was anderes, was näher an der aktuellen zeit liegt, so, der camping check, aufnahme,"}, {"id": 594, "start": 5186.8, "end": 5196.24, "text": "warum, wo ist das problem, warum kackt der camping check ab, und beim zweiten mal geht"}, {"id": 595, "start": 5196.24, "end": 5208.88, "text": "der request, das verstehe ich nicht, was ist denn das für ein blödsinn, warum geht der"}, {"id": 596, "start": 5208.88, "end": 5232.84, "text": "immer einmal kaputt, so löschen hat funktioniert, und es ist nicht gelöscht, was, irgendwas"}, {"id": 597, "start": 5232.84, "end": 5248.72, "text": "ist gerade richtig, richtig verkehrt, ja, das ist das richtige, ich meine es gibt nur"}, {"id": 598, "start": 5248.72, "end": 5260.12, "text": "ein delete, und ich habe keine daten drin stehen, jetzt ist der camping check weg, ok,"}, {"id": 599, "start": 5260.12, "end": 5279.96, "text": "das muss wir anders machen, ok, wo kann das denn jetzt großartig schief gehen, wir machen"}, {"id": 600, "start": 5279.96, "end": 5294.92, "text": "noch was anderes, also, Moment, ist das überhaupt, also wenn das funktioniert, dann sagen wir"}, {"id": 601, "start": 5294.92, "end": 5306.2, "text": "selected is scheduled gleich true, so, und hier unten gleich false, weil das dann weg"}, {"id": 602, "start": 5306.2, "end": 5321.28, "text": "sein soll, so, von der Idee her, wenn ich den kram jetzt, what the fuck, ok, ich brauch"}, {"id": 603, "start": 5321.28, "end": 5325.48, "text": "debug ausgabe auf dem server, ist ja irgendwie der meinung, er kann irgendwas hier nicht"}, {"id": 604, "start": 5325.48, "end": 5344.04, "text": "serialisieren oder so, und löschen tut das auch nicht, was zum, ich guck, was ist das"}, {"id": 605, "start": 5344.04, "end": 5370.6, "text": "denn, nee, nee, selected ist richtig, achso, äh, eigentlich nicht, weil das genau das"}, {"id": 606, "start": 5370.6, "end": 5380.32, "text": "gleiche ist, eigentlich nicht, das müsste genau das gleiche sein, aber man weiß ja nie,"}, {"id": 607, "start": 5380.32, "end": 5383.6, "text": "so, jetzt brauchen wir noch kurz ein bisschen, ein bisschen debug ausgabe, was ist denn hier"}, {"id": 608, "start": 5383.6, "end": 5389.44, "text": "los, wo kann dann hier was, also der kackt schon beim aufnehmen ab, so, wenn man den"}, {"id": 609, "start": 5389.44, "end": 5399.44, "text": "camping check programmieren will, ich meine, großartig was verkehrt sein kann er hier nicht,"}, {"id": 610, "start": 5399.44, "end": 5417.4, "text": "doch ich kann breakpoint setzen, aber ich weiß gar nicht genau wo ehrlich gesagt, also,"}, {"id": 611, "start": 5417.4, "end": 5436.12, "text": "record event, gutes printf debugging, so, ich hab keine, also Moment, Moment, das brauchen"}, {"id": 612, "start": 5436.12, "end": 5444.0, "text": "wir ja gar nicht, ähm, wir brauchen was der, was der hier macht, also wo er abkackt, müssten"}, {"id": 613, "start": 5444.0, "end": 5453.52, "text": "wir ja schon mal wissen, ich klaue der kackt ab beim recording request aufnahme, bäm, kaputt,"}, {"id": 614, "start": 5453.52, "end": 5466.12, "text": "weil, beim recording request kackt der ab, hier, create event, event id, das mag er nicht,"}, {"id": 615, "start": 5466.12, "end": 5476.72, "text": "response could not be deserialized, interessant, so, wenn ichs von hand mache, wenn ich das"}, {"id": 616, "start": 5476.72, "end": 5489.96, "text": "von hand mache, jaja unauthorized is ok, wat, ok, wenn ichs von hand mache funktioniert"}, {"id": 617, "start": 5489.96, "end": 5505.6, "text": "das, delete, nein, nein, nein, delete, so, jetzt löschen wirs wieder und da kackts ja"}, {"id": 618, "start": 5505.6, "end": 5533.4, "text": "auch ab einmal, hm, ey, der kühler, das ist doch das was ich eben ausgefüllt hab vorhand,"}, {"id": 619, "start": 5533.4, "end": 5541.28, "text": "ich blick nicht mehr durch, ist das ding jetzt eigentlich programmiert oder nicht der camping"}, {"id": 620, "start": 5541.28, "end": 5556.0, "text": "check, jetzt hab ichs komplett gekillt, was ist denn jetzt mit dem camping check, der"}, {"id": 621, "start": 5556.0, "end": 5564.4, "text": "camping check ist immer noch programmiert, ok, also, der camping check hatte irgendwie"}, {"id": 622, "start": 5564.4, "end": 5593.48, "text": "diese, diese id da, warum geht denn das scheiß net, was ist das denn, ok, crit, so, was hat"}, {"id": 623, "start": 5593.48, "end": 5613.88, "text": "denn der camping check bitteschön für, für eine id, das da, ok, moment, wo ist der Unterschied"}, {"id": 624, "start": 5613.88, "end": 5622.12, "text": "zu, ah ich hab das falsche vorhin ausgefüllt, ok, also, muss man vielleicht warten, weil"}, {"id": 625, "start": 5622.12, "end": 5629.88, "text": "es ne weile braucht bis das anfängt, ok, also das funktioniert ja im prinzip, ok, ok,"}, {"id": 626, "start": 5629.88, "end": 5637.96, "text": "es kommt nen 404, wenn er, ok, das ist, das ist weird, weird, weirdchamperapi, aber ok,"}, {"id": 627, "start": 5637.96, "end": 5651.2, "text": "so, der camping check, ich hab, ich hab die aufnahme grade gelöscht, ach ich weiß, glaube"}, {"id": 628, "start": 5651.2, "end": 5660.04, "text": "ich, woran es liegt, der refresh doch nur alle 30 sekunden, ich muss irgendwie nen refresh"}, {"id": 629, "start": 5660.04, "end": 5670.96, "text": "triggern, wenn das, jaja ok, ok, ich glaub, ich glaub jetzt weiß ich, ja, was aber an"}, {"id": 630, "start": 5670.96, "end": 5683.76, "text": "der stelle zumindest funktionieren sollte, so, log, so, epg entry, gucken was da zurückkommt,"}, {"id": 631, "start": 5683.76, "end": 5702.92, "text": "so, jetzt kackt er immer ab am anfang, und warum, immer wenn ich das erste mal programmiere"}, {"id": 632, "start": 5702.92, "end": 5714.64, "text": "kackt das, kackt er ab, und zwar weil er sagt, dass er das jason nicht irgendwie serialisieren"}, {"id": 633, "start": 5714.64, "end": 5731.08, "text": "kann, ich mach jetzt buyer shark an, keine ahnung was er für schmerzen hat, bam, sack,"}, {"id": 634, "start": 5731.08, "end": 5744.92, "text": "aufnahme, gecrashed, ok, so, ist wieder der meinung, dass es hier aus irgendwelchen gründen"}, {"id": 635, "start": 5744.92, "end": 5764.16, "text": "not serialized werden kann, destination, da, ja, oder was macht der da alles, irgendwo"}, {"id": 636, "start": 5764.16, "end": 5788.96, "text": "am ende sein, hier, grid, wo ist denn der request, wo ist denn der request, warum fragt"}, {"id": 637, "start": 5788.96, "end": 5798.56, "text": "er diesen kram eigentlich so oft ab, content type list, das sollte er doch nur einmal machen,"}, {"id": 638, "start": 5798.56, "end": 5813.16, "text": "was fragt er denn da 30 milliarden mal ab, ganz, ganz schön, ach nee, der fragt jeden"}, {"id": 639, "start": 5813.16, "end": 5826.92, "text": "channel ab, ok, ok, verstehe, ok, follow, ok, ich muss things, nee, nee, nicht delete,"}, {"id": 640, "start": 5826.92, "end": 5846.2, "text": "create suchen, hier, create event, ach, das ist ein array, das ist weil man mehrere theoretisch"}, {"id": 641, "start": 5846.2, "end": 5850.84, "text": "programmiert, das ist ein array, ja, kein wunder, dass er das nicht serialisieren kann,"}, {"id": 642, "start": 5850.84, "end": 5857.56, "text": "ja, ok, dann, damit hätte sich das an der stelle schon mal erledigt, warum das nicht"}, {"id": 643, "start": 5857.56, "end": 5874.56, "text": "funktioniert, das funktioniert nicht, weil das kein string ist, sondern ein array, tja,"}, {"id": 644, "start": 5874.56, "end": 5881.96, "text": "nice, warum es beim zweiten anlauf geht, beim zweiten anlauf funktioniert es, weil"}, {"id": 645, "start": 5881.96, "end": 5886.68, "text": "die response leer ist, und die response ist leer, dementsprechend versucht er da nichts"}, {"id": 646, "start": 5886.68, "end": 5914.08, "text": "reinzuschreiben, ok, das muss ich nicht, das muss ich doch hier nicht returnen, ja, meinetwegen,"}, {"id": 647, "start": 5914.08, "end": 5934.68, "text": "ok, das ist, das ist ein array, alles klar, meine Güte, wie soll er da drauf kommen,"}, {"id": 648, "start": 5934.68, "end": 5944.8, "text": "ok, der Rest ist ja davon nicht betroffen, ok, den, den part, den part hätten wir schon"}, {"id": 649, "start": 5944.8, "end": 5951.52, "text": "mal, das heißt im endeffekt, das, das müsste jetzt, das müsste jetzt funktionieren, das"}, {"id": 650, "start": 5951.52, "end": 5961.6, "text": "recording müsste ohne probleme funktionieren, moment, ich muss den camping check, ich muss"}, {"id": 651, "start": 5961.6, "end": 5967.16, "text": "den camping check gerade nochmal von hand löschen, das hier der camping check, ach,"}, {"id": 652, "start": 5967.16, "end": 5974.92, "text": "keine ahnung, ach, die haben auch immer andere ids jetzt logischerweise, löschen, oh, das"}, {"id": 653, "start": 5974.92, "end": 5980.96, "text": "löschen hat direkt funktioniert, ok, ok, das ist auch noch blöd, der refresht ja nur"}, {"id": 654, "start": 5980.96, "end": 5988.0, "text": "alle 30 sekunden seinen datenbestand, dementsprechend, der hat jetzt den camping check gelöscht,"}, {"id": 655, "start": 5988.0, "end": 5992.96, "text": "aber wenn uns refresht, ist der camping check für 30 sekunden noch drin, das heißt ich"}, {"id": 656, "start": 5992.96, "end": 6003.4, "text": "brauch auf jeden fall hier irgendwie noch was, refresh, epg, so, da muss mir noch was"}, {"id": 657, "start": 6003.4, "end": 6015.4, "text": "überlegen, der gesamte epg muss da refreshed werden, oder zumindest das eine event, alles"}, {"id": 658, "start": 6015.4, "end": 6032.84, "text": "klar, so, das sollte jetzt ohne probleme funktionieren, der camping check, ich werde den jetzt aufnehmen,"}, {"id": 659, "start": 6032.84, "end": 6038.04, "text": "ach so, moment, das ist ja blöd, ich muss die response, ja, das erklärt auch warum"}, {"id": 660, "start": 6038.04, "end": 6046.8, "text": "der kram kaputt geht, weil es 30 sekunden verzögert ist, aber das hier sollte der eigentlich"}, {"id": 661, "start": 6046.8, "end": 6059.92, "text": "checken, ok, wartet mal, das, das müssen wir jetzt mal checken, warum das nicht funktioniert,"}, {"id": 662, "start": 6059.92, "end": 6078.8, "text": "was der für schmerzen hat, so, camping check, so, löschen, ja, ich weiß, ist gut, already"}, {"id": 663, "start": 6078.8, "end": 6102.36, "text": "red, ach so, hier, weil hier das delete ist, ist auch falsch rum, meine güde, so, also"}, {"id": 664, "start": 6102.36, "end": 6117.4, "text": "jetzt, jetzt, jetzt funktioniert es wahrscheinlich, ich muss wissen, was da Sache ist an der Stelle,"}, {"id": 665, "start": 6117.4, "end": 6124.76, "text": "ok, camping check, aufnahme, true, es wäre schön, wenn da true drinne steht, und warum"}, {"id": 666, "start": 6124.76, "end": 6140.76, "text": "setzt der da nicht, ist scheduled auf true, was ist das, wird das hier ausgeführt, wird"}, {"id": 667, "start": 6140.76, "end": 6146.12, "text": "das hier ausgeführt, oder ist das irgendwie nicht reactive beim updaten, ich dreh hier,"}, {"id": 668, "start": 6146.12, "end": 6152.72, "text": "ich dreh echt am rad noch, löschen, ok, wenigstens das funktioniert ohne Fehler, jetzt"}, {"id": 669, "start": 6152.72, "end": 6159.84, "text": "muss man warten, bis der camping check wieder entfernt ist, ja, das mit dem, ich muss irgendwie"}, {"id": 670, "start": 6159.84, "end": 6178.36, "text": "gucken, dass ich den manuell noch refreshen kann, ok, ja, das interessiert ihn einfach"}, {"id": 671, "start": 6178.36, "end": 6188.32, "text": "nicht, das interessiert ihn einfach nicht, na geil, das aus irgendwelchen Gründen nicht"}, {"id": 672, "start": 6188.32, "end": 6197.0, "text": "reactive, da hab ich jetzt gar keinen Bock drauf, warum checkt ihr das nicht, ich mein,"}, {"id": 673, "start": 6197.0, "end": 6209.12, "text": "wo ist das Problem, ok, das müssen wir, das müssen wir jetzt mal nachstellen, in irgendwie"}, {"id": 674, "start": 6209.12, "end": 6218.92, "text": "etwas einfacherer Variante, ja, ohne, ohne diese ganzen requests und so zu verschicken,"}, {"id": 675, "start": 6218.92, "end": 6228.56, "text": "set timer, wir testen, wir testen das jetzt, wir testen das jetzt ohne, ohne requests, ich"}, {"id": 676, "start": 6228.56, "end": 6252.96, "text": "weiß nicht, warum er das nicht macht, eklig, ok, also, if, ich kann mich nicht mehr konzentrieren,"}, {"id": 677, "start": 6252.96, "end": 6268.28, "text": "was wollte ich jetzt machen, dass der Kram, normalerweise sollte er das von alleine checken,"}, {"id": 678, "start": 6268.28, "end": 6288.24, "text": "zeig mal, wie es der timer aufgerufen wird, so, wartet mal, wartet mal, ich, ich mach"}, {"id": 679, "start": 6288.24, "end": 6293.72, "text": "es jetzt so, wenn ich auf den button drücke, naja, ist not defined und so, also, ich mach"}, {"id": 680, "start": 6293.72, "end": 6298.56, "text": "es jetzt so, wenn ich auf den button drücke, ist things, dann sagen wir einfach hier, is,"}, {"id": 681, "start": 6298.56, "end": 6310.88, "text": "is false und dann, dann sollte das einfach immer switchen jetzt, ok, das juckt den gar"}, {"id": 682, "start": 6310.88, "end": 6334.32, "text": "nicht, w-wait a minute, w-warum juckt den das nicht, moment, das ist, hä, breakpoints"}, {"id": 683, "start": 6334.32, "end": 6353.6, "text": "calculate, warum juckt den das nicht, w-warum interessiert den das nicht, wenn das, das"}, {"id": 684, "start": 6353.6, "end": 6374.2, "text": "ist das gleiche, selected und das da, ich kanns mal ausprobieren, ja, so mach ich das,"}, {"id": 685, "start": 6374.2, "end": 6383.2, "text": "das ist doch genau das gleiche, alter, so, was man daran jetzt auch noch sieht, ist bei"}, {"id": 686, "start": 6383.2, "end": 6392.96, "text": "der Aufnahme, bei der Aufnahme müsste es eine feste Breite haben, ich übergebe das"}, {"id": 687, "start": 6392.96, "end": 6409.48, "text": "hier, das ist genau das gleiche, boah, was ein ekliger Kram, so, dass der löschen Knopf"}, {"id": 688, "start": 6409.48, "end": 6423.28, "text": "kriegt, wird genauso fett, alter, p-pro-fett, ok, wunderbar, ok, gut, gut, da kann ich mit"}, {"id": 689, "start": 6423.28, "end": 6451.08, "text": "dem, dann kommentieren wir das alles mal wieder ein, zack, if, zack, oh, ok, ok, ok, ok, ok,"}, {"id": 690, "start": 6451.08, "end": 6459.32, "text": "gut, ok, jetzt sollte das funktionieren, weiß nicht, war, ich weiß nicht, was er für"}, {"id": 691, "start": 6459.32, "end": 6471.08, "text": "Schmerzen hatte, löschen, bam, weg ist es, aufnehmen, jawohl, löschen, nice, so muss"}, {"id": 692, "start": 6471.08, "end": 6476.52, "text": "das sein, so, jetzt muss ich noch gucken wie ich den Kram, guck, wenn ich jetzt nämlich,"}, {"id": 693, "start": 6476.52, "end": 6482.92, "text": "Ja das funktioniert jetzt nicht, weil es ist eigentlich schon gelöscht und der Refresh"}, {"id": 694, "start": 6482.92, "end": 6486.88, "text": "ist bloß nicht schnell genug, wie kann ich beim Backend beibringen, dass das jetzt instant"}, {"id": 695, "start": 6486.88, "end": 6491.2, "text": "Refreshen soll, weil das Refreshen funktioniert bei mir ja automatisch auf einem Timer von"}, {"id": 696, "start": 6491.2, "end": 6492.2, "text": "30 Sekunden."}, {"id": 697, "start": 6492.2, "end": 6503.6, "text": "Und das funktioniert hier drüber, boah da fällt mir jetzt grad nichts gescheites ein."}, {"id": 698, "start": 6503.6, "end": 6509.56, "text": "Ich könnte, ja ich müsste dem Ding, ich müsste dem irgendwie Bescheid sagen, so nach dem"}, {"id": 699, "start": 6509.56, "end": 6512.24, "text": "Motto Hallo guck mal, das ist jetzt bitte neu Fetschen."}, {"id": 700, "start": 6512.24, "end": 6519.48, "text": "Aber ich will jetzt da keine Message Queue oder sonstigen Krämpel, ja Refresh Event,"}, {"id": 701, "start": 6519.48, "end": 6532.36, "text": "das ist alles, hast schon Overkill dafür, vielleicht fällt mir, ja weil das hier will"}, {"id": 702, "start": 6532.36, "end": 6538.48, "text": "ich das Copy Paste, ich bestimmt nicht alles, was ich zum Refreshen machen muss, ja ich"}, {"id": 703, "start": 6538.48, "end": 6547.4, "text": "muss gucken, dass keine Sachen Lücken haben, dann muss ich das neu zuordnen, die Uhrzeit"}, {"id": 704, "start": 6547.4, "end": 6550.8, "text": "setzen und sowas, das mach ich bestimmt nicht alles doppelt und dreifach."}, {"id": 705, "start": 6550.8, "end": 6558.16, "text": "Den Timer, nee den Timer kann ich noch nur, der Zertimer ist das, ich müsste, ich müsste"}, {"id": 706, "start": 6558.16, "end": 6570.6, "text": "quasi sowas, ich müsste irgendwie sowas machen wie Wait und dann könnte ich ihm sagen,"}, {"id": 707, "start": 6570.6, "end": 6581.96, "text": "wie ich mein, naja, ja doch wir könnten, wir könnten sowas machen, irgendwie keine"}, {"id": 708, "start": 6581.96, "end": 6590.48, "text": "Public Trigger, Refresh, irgendwie sowas, machen wir das jetzt irgendwie schön, Trigger"}, {"id": 709, "start": 6590.48, "end": 6599.56, "text": "Refresh, ja so was in der Richtung, theoretisch, nee nicht stoppen und wieder starten, also"}, {"id": 710, "start": 6599.56, "end": 6604.12, "text": "ich müsste sowas hier machen, so nicht, dass das jetzt Hardcoded Task Delay ist, sondern"}, {"id": 711, "start": 6604.12, "end": 6610.32, "text": "ich müsste ihm jetzt irgendwie sagen, oh da bin ich aber gerade zu Low IQ für, das, das"}, {"id": 712, "start": 6610.32, "end": 6616.6, "text": "ist, nee das ist Hackfond, was ich verwende, ja in dem Reset Event an sich, ich brauch"}, {"id": 713, "start": 6616.6, "end": 6628.84, "text": "ja jetzt bei das, ich brauch ja einmal den normalen Timer oder es wird resettet, ich"}, {"id": 714, "start": 6628.84, "end": 6634.56, "text": "muss den Timer cancelen, das ist alles, alles in Anführungenstrichen, ich muss den Timer"}, {"id": 715, "start": 6634.56, "end": 6646.4, "text": "cancelen, ja das reicht doch, ich muss den Timer cancelen, damit man Timer cancelen kann"}, {"id": 716, "start": 6646.4, "end": 6666.56, "text": "muss man den da rein schmeißen, ja oder Kangin, wie meinst du das, ach wobei das Reset Event"}, {"id": 717, "start": 6666.56, "end": 6679.6, "text": "kann ein Timeout haben gell, kannst du dem ein Timeout geben, wenn es nicht auftritt"}, {"id": 718, "start": 6679.6, "end": 6709.2, "text": "dann geht das, kannst du dem ein Timeout, wie, ähm, Timeout, Auto Reset Event, Timeout,"}, {"id": 719, "start": 6709.2, "end": 6716.96, "text": "ach so geht das, ok, wait und dann Timeout, aha, aha, ok, dann ist es tatsächlich gar"}, {"id": 720, "start": 6716.96, "end": 6735.84, "text": "nicht so schwierig, dann brauchen wir sowas hier, Reset Event, alter, lul, können wir auch"}, {"id": 721, "start": 6735.84, "end": 6746.56, "text": "slim nehmen, was ist eigentlich der Unterschied zwischen slim und not, not slim, weird champ,"}, {"id": 722, "start": 6746.56, "end": 6763.0, "text": "so tauschen wir das aus, wait, Reset, Reset Event, äh, Timeout Milliseconds 3000, so,"}, {"id": 723, "start": 6763.0, "end": 6771.84, "text": "so müsste das funktionieren, Refactor Reset, so, wenn ich das jetzt richtig gemacht habe,"}, {"id": 724, "start": 6771.84, "end": 6796.28, "text": "Digger Refresh, sag ich jetzt Reset Event, Reset oder Reset, funktioniert das so, verwende"}, {"id": 725, "start": 6796.28, "end": 6809.64, "text": "das nicht so oft, das müsste doch jetzt funktionieren, also, der geht hier rein, der geht rein, wartet"}, {"id": 726, "start": 6809.64, "end": 6826.48, "text": "30 Sekunden, außer ich sag Digger Refresh, oder, wie wärs mit, nee, nee, nee, kein Sus,"}, {"id": 727, "start": 6826.48, "end": 6832.92, "text": "Sass, testen wir mal, ob's funktioniert, ähm, Programm, jetzt brauch ich diesen Krempel"}, {"id": 728, "start": 6832.92, "end": 6838.4, "text": "hier noch, ja fast mehr Dependency Injection, wie wenn ich alles global gemacht hätte, ups,"}, {"id": 729, "start": 6838.4, "end": 6857.28, "text": "äh, was hab ich denn hier gemacht, so, wunderbar, auch mal hier, so, EPG, Digger Refresh, ok,"}, {"id": 730, "start": 6857.28, "end": 6865.6, "text": "schauen wir mal, ob's funktioniert, ich bin gespannt, naja, das war mal zu, Quid, ok,"}, {"id": 731, "start": 6865.6, "end": 6874.44, "text": "schauen wir mal, ob's geht, zack, ok, das funktioniert schon mal, Aufnahme, schließen,"}, {"id": 732, "start": 6874.44, "end": 6882.2, "text": "funktioniert auch, ich müsste reinschreiben, ob er reloadet, und, und, und, und, alter,"}, {"id": 733, "start": 6882.2, "end": 6891.92, "text": "was mach ich falsch, der sollte eigentlich refreshen, ach, Moment, ich noob, ich muss"}, {"id": 734, "start": 6891.92, "end": 6920.28, "text": "den Refresh beim Delete auch reinmachen, so, jaja, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 735, "start": 6920.28, "end": 6942.76, "text": "ah, ok, ne, gut, er ist nicht so schnell im refreshen, n, was zum..."}, {"id": 736, "start": 6942.76, "end": 6951.28, "text": "Warum klappt das nicht?"}, {"id": 737, "start": 6951.28, "end": 6962.0, "text": "Ich hab Aufnahme gedrückt, nicht Delete."}, {"id": 738, "start": 6962.0, "end": 6963.0, "text": "Achso."}, {"id": 739, "start": 6963.0, "end": 6986.12, "text": "Das kann schon sein, dass der 2-3 Sekunden braucht zum Refreshen."}, {"id": 740, "start": 6986.12, "end": 6991.24, "text": "Doch, doch, ich glaube das funktioniert, 30 Sekunden sind das nicht."}, {"id": 741, "start": 6991.24, "end": 7003.28, "text": "Das ist einfach halt asynchron, guck Aufnahme, 1, 2, 3, 4, 5, Refresh, fuck, ah Moment, ist"}, {"id": 742, "start": 7003.28, "end": 7004.28, "text": "doch richtig."}, {"id": 743, "start": 7004.28, "end": 7019.08, "text": "So, löschen, 1, 2, 3, 4, 5, ja es funktioniert, es funktioniert, Problem ist nur, das Refresh,"}, {"id": 744, "start": 7019.08, "end": 7022.2, "text": "der Refresh dauert halt ein bisschen."}, {"id": 745, "start": 7022.2, "end": 7026.96, "text": "Der Refresh ist halt nicht instant, der Refresh dauert, wir können mal gucken wie lange der"}, {"id": 746, "start": 7026.96, "end": 7033.6, "text": "Refresh braucht, ein Refresh braucht, probieren wir aus, sag ich euch, ich hab schon ein"}, {"id": 747, "start": 7033.6, "end": 7050.2, "text": "slimes Event, so ein Refresh braucht, stopwatch, start new, elapsed milliseconds, so ich sag"}, {"id": 748, "start": 7050.2, "end": 7054.6, "text": "euch wie lange ein Refresh braucht, das ist absolut nicht optimiert was ich da gebaut"}, {"id": 749, "start": 7054.6, "end": 7061.48, "text": "hab, ne Sekunde, das kann sein Leute, der Refresh dauert eine Sekunde, ungefähr."}, {"id": 750, "start": 7061.48, "end": 7070.0, "text": "Ah Moment, jetzt hab ich ja kein stopp Event mehr, kann man das, kann das Ding cancelation"}, {"id": 751, "start": 7070.0, "end": 7081.24, "text": "talking support, ah exellent, ok gut, ok es dauert, es dauert eine Sekunde zu Refreshen,"}, {"id": 752, "start": 7081.24, "end": 7084.92, "text": "deswegen ist das, wenn ich in der Zwischenzeit Refresh hab das nicht kapiert, das ist aber"}, {"id": 753, "start": 7084.92, "end": 7097.64, "text": "auch ok, mein, was willst du machen, das ist halt, Sekunde asynchron, jetzt funktioniert"}, {"id": 754, "start": 7097.64, "end": 7106.8, "text": "es ja, ja, würde es nicht schneller gehen, wenn du nur den einen Channel nachlädst, doch"}, {"id": 755, "start": 7106.8, "end": 7113.04, "text": "mit Sicherheit, aber das Problem ist, mein Fetch-EPG macht halt immer alles, und dann"}, {"id": 756, "start": 7113.04, "end": 7117.56, "text": "müsste ich das jetzt irgendwie einprogrammieren, dass er nur einen Channel Refresht, ja, jaja,"}, {"id": 757, "start": 7117.56, "end": 7128.4, "text": "du hast recht, Refresh one channel only, ja keine Ahnung, da müsste ich mir was überlegen,"}, {"id": 758, "start": 7128.4, "end": 7136.16, "text": "ja, da müsste man das ein bisschen umstricken, dass es einzeln, dass das einzeln geht, da"}, {"id": 759, "start": 7136.16, "end": 7147.4, "text": "müsste ich irgendwie mal Refresh Channel, und dann, ich mein, ja, da müsste ich mir,"}, {"id": 760, "start": 7147.4, "end": 7152.72, "text": "man könnte jetzt auch irgendwie ein concurrent dictionary reinhauen, und dann würde ich"}, {"id": 761, "start": 7152.72, "end": 7159.16, "text": "es hier oben einfach, ja, irgendwie so, denke, denke, da fällt mir schon noch was ein, aber"}, {"id": 762, "start": 7159.16, "end": 7166.48, "text": "das ist schon erstmal in Ordnung, ist die EPG Ansicht Final, na, Final ist hier nichts,"}, {"id": 763, "start": 7166.48, "end": 7173.2, "text": "aber zumindest an sich funktioniert es jetzt, so, wir können sagen, ich will regionale Küche"}, {"id": 764, "start": 7173.2, "end": 7181.24, "text": "ist Sus aus der Wetterau aufnehmen, Bäm, zack, ah super, jetzt sehe ich es aber nicht"}, {"id": 765, "start": 7181.24, "end": 7190.36, "text": "an der Stelle, löschen, wo sehe ich denn hier was, wo passt denn hier rein, wo haben"}, {"id": 766, "start": 7190.36, "end": 7194.76, "text": "wir denn hier, hier ein seltsames Paar, das wollte ich schon immer mal aufnehmen, Aufnahme,"}, {"id": 767, "start": 7194.76, "end": 7214.48, "text": "Schließen, aha, ok, gut, gut, sehr schön, sehr gut, exellent, Trigger Refresh ist hier,"}, {"id": 768, "start": 7214.48, "end": 7226.8, "text": "ok, das klappt, ja, da bin ich eigentlich ganz zufrieden so, man, das kann man ja erstmal"}, {"id": 769, "start": 7226.8, "end": 7230.16, "text": "denke ich ganz gut verwenden jetzt, jetzt müssen wir noch was testen, jetzt bin ich"}, {"id": 770, "start": 7230.16, "end": 7239.32, "text": "mal gespannt, läuft der Kram auf meinem Linux Receiver, ich meine, dass man hier noch einiges,"}, {"id": 771, "start": 7239.32, "end": 7243.6, "text": "man kann das schon noch durch, durch das deutlich schöner machen und sicherlich auch performanter"}, {"id": 772, "start": 7243.6, "end": 7249.32, "text": "an vielen Stellen, also zum Beispiel, wie das hier im Hintergrund mit dem Refresh funktioniert,"}, {"id": 773, "start": 7249.32, "end": 7253.96, "text": "ich dachte erst, es ist eine gute Idee, einfach hier Hardcoded einen Timer laufen zu lassen"}, {"id": 774, "start": 7253.96, "end": 7261.44, "text": "mit 30 Sekunden Refresh, aber es wäre wahrscheinlich besser, ich habe einen Timer und ich habe"}, {"id": 775, "start": 7261.44, "end": 7270.2, "text": "die Möglichkeit, den Refresh ohne hier diese Umwege anzustoßen, ich meine, ein Vorteil"}, {"id": 776, "start": 7270.2, "end": 7277.16, "text": "hat es, ja, das hier ist Threadsafe, wenn ich jetzt hier direkt was updaten würde drin"}, {"id": 777, "start": 7277.16, "end": 7281.12, "text": "und wenn würde dann beide, würden hier drauf zugreifen, das wird ein bisschen schwierig,"}, {"id": 778, "start": 7281.12, "end": 7287.56, "text": "ja, also so ist es auf jeden Fall Threadsafe, weil das immer nur an dieser Stelle aktualisiert"}, {"id": 779, "start": 7287.56, "end": 7294.72, "text": "wird, das einzige, was wir machen, ist halt das Aktualisieren vorziehen und wir lesen"}, {"id": 780, "start": 7294.72, "end": 7299.44, "text": "an vielen Stellen daraus, aber wir schreiben nur an einer Stelle da rein und wie wir alle"}, {"id": 781, "start": 7299.44, "end": 7305.44, "text": "wissen, solange man nur an einer Stelle schreibt und an mehreren Stellen liest, es ist eigentlich"}, {"id": 782, "start": 7305.44, "end": 7310.76, "text": "so gut wie immer Threadsafe, problematisch wird es eigentlich nur, wenn man an mehreren"}, {"id": 783, "start": 7310.76, "end": 7319.92, "text": "Stellen schreibt, also nein, wenn man in unterschiedlichen Threads schreibt, dann gibt es Probleme, ja"}, {"id": 784, "start": 7319.92, "end": 7325.04, "text": "und wir könnten es definitiv schneller machen, wenn man den hier ein Channel Refreshen lassen"}, {"id": 785, "start": 7325.04, "end": 7333.2, "text": "würde, ich meine, das wäre gar nicht so super kompliziert, man müsste, man müsste es so"}, {"id": 786, "start": 7333.2, "end": 7342.84, "text": "machen, wobei, nein, so einfach ist es nicht, ich kann ja hier nichts übertragen, ja, Set,"}, {"id": 787, "start": 7342.84, "end": 7349.72, "text": "ich kann hier nur sagen, laufen oder blocken, ich müsste es auf jeden Fall anders bauen,"}, {"id": 788, "start": 7349.72, "end": 7355.16, "text": "ich müsste das hier, das hier müsste ein Concurrent Dictionary werden, dass es Threadsafe"}, {"id": 789, "start": 7355.16, "end": 7363.4, "text": "ist, falls ich mal zufälligerweise hier Refreshe, während ich hier auch gerade ein Update Trigger,"}, {"id": 790, "start": 7363.4, "end": 7377.52, "text": "und dann müsste ich dieses Fetch-EPG auseinanderwurschteln zu einem Fetch-Channel, ja, das müsste funktionieren,"}, {"id": 791, "start": 7377.52, "end": 7394.96, "text": "ja, also nicht alles aktualisieren, sondern nur den Channel, Channel UUID, ja, das würde"}, {"id": 792, "start": 7394.96, "end": 7409.08, "text": "funktionieren, iPeppeRS, Dankeschön, ist RS für, bist du Rust-Programmierer, ein,"}, {"id": 793, "start": 7409.08, "end": 7414.56, "text": "ein, wie nennen sich, wie nennen sich die Rust-Leute nochmal, die nennen sich doch noch"}, {"id": 794, "start": 7414.56, "end": 7423.04, "text": "dieser komischen Krabbe, ich komm nicht drauf, Rust-Programmierer nennen sich irgendwie so"}, {"id": 795, "start": 7423.04, "end": 7437.16, "text": "speziell, Rust-Dashens, Rust-Dashens, irgendwie sowas, ja, nach dieser komischen Krabbe, hier,"}, {"id": 796, "start": 7437.16, "end": 7461.72, "text": "Rust-Crap, dem Ding, ja, nein, nicht Larry the Lobster, nach dieser Krabbe, so, ok, wir"}, {"id": 797, "start": 7461.72, "end": 7467.92, "text": "testen jetzt mal, ob das auf meinem Linux-Receiver läuft, also, da, was ist denn das hier, ah,"}, {"id": 798, "start": 7467.92, "end": 7497.68, "text": "das ist mein, oh fuck, der refresht viel zu schnell, ähm, warum, Moment, ok, ok, ok,"}, {"id": 799, "start": 7497.68, "end": 7514.76, "text": "äh, der resetet sich nicht wieder, w-wait a minute, muss ich, muss ich irgendwie hier"}, {"id": 800, "start": 7514.76, "end": 7535.56, "text": "sagen, reset oder so, muss ich am Anfang resetten, also sowas hier machen, mit Task verwendet"}, {"id": 801, "start": 7535.56, "end": 7552.84, "text": "man diesen oldschool Krabbe sowieso selten, ok, ah ja, ok, nice, funktioniert, alles"}, {"id": 802, "start": 7552.84, "end": 7560.48, "text": "klar, Auto Reset Event macht das, dann wollen wir ein Auto Reset Event haben, Auto Reset"}, {"id": 803, "start": 7560.48, "end": 7570.68, "text": "Event, beste, new, initial state, true, äh, false, oder, wir wollen nicht, nicht, nicht"}, {"id": 804, "start": 7570.68, "end": 7587.76, "text": "signet anfangen, äh, Moment, dem kann man kein, kein Cancellation Topen geben, warum"}, {"id": 805, "start": 7587.76, "end": 7597.64, "text": "nicht, äh, das ist doch doof, ich brauch beides, ich brauch Cancellation Topen und,"}, {"id": 806, "start": 7597.64, "end": 7621.36, "text": "und mein Timeout, ja, dann lass ich's jetzt einfach so, fertig, so ist gut, passt, TV"}, {"id": 807, "start": 7621.36, "end": 7629.88, "text": "Headend User Statistiken, man braucht Series, streamst du damit an 50 Leute oder wie, also"}, {"id": 808, "start": 7629.88, "end": 7634.8, "text": "ich hab, drei, ich stream vom PC, ich stream vielleicht am Fernseher, ich stream vielleicht"}, {"id": 809, "start": 7634.8, "end": 7639.2, "text": "im Erdgeschoss, also im Prinzip an drei Statistiken, was, was, was, User Statistiken, da wäre"}, {"id": 810, "start": 7639.2, "end": 7643.56, "text": "ich noch nie drauf gekommen, dass man, äh, für was, also was machst du damit, dass du"}, {"id": 811, "start": 7643.56, "end": 7651.56, "text": "User Statistiken haben willst, die ganze Familie auch extern, ach so, ja, ist die Frage, wie"}, {"id": 812, "start": 7651.56, "end": 7659.4, "text": "man das abrufen kann, ok, exzellent, so, das funktioniert, jetzt müssen wir gucken, ob"}, {"id": 813, "start": 7659.4, "end": 7668.16, "text": "dieser Krempel läuft, by the way, wir machen tatsächlich mal Debug Ausgabe, hab ich, jawoll,"}, {"id": 814, "start": 7668.16, "end": 7682.56, "text": "in Farbe, in Farbe, weil's so schön ist, Mark-Appline, weil's, weil's so schön ist, Blue, äh, EPG"}, {"id": 815, "start": 7682.56, "end": 7691.12, "text": "Refreshed, ich bin mir nicht sicher, ob ich richtig, richtig gemacht hab, von der Syntax,"}, {"id": 816, "start": 7691.12, "end": 7704.68, "text": "ey, es ist der EPG Refresh in Blau, Massive, Augen, mach, machst du Auge, gut, ok, wir kompilieren"}, {"id": 817, "start": 7704.68, "end": 7711.88, "text": "den Krempel und schieben's auf meinen TV-Header drauf, auf meinen, äh, Linux-Resiever, gucken,"}, {"id": 818, "start": 7711.88, "end": 7721.56, "text": "ob das funktioniert, äh, Publish,.NET Publish Configuration, Linux-Arm, Self-Contained-Build,"}, {"id": 819, "start": 7721.56, "end": 7734.64, "text": "R-Sync, lustigerweise ist es 2.129, 2.129, der ADC-Champ, null, ok, ich will es aber"}, {"id": 820, "start": 7734.64, "end": 7750.12, "text": "nicht als Build haben, ähm, warte mal, sondern, ähm, der Zielordner soll heißen, EPG-Champ,"}, {"id": 821, "start": 7750.12, "end": 7758.52, "text": "und auch nicht Pi-Add, sondern Root-Add, so, äh, funktioniert das jetzt, ja, wahrscheinlich,"}, {"id": 822, "start": 7758.52, "end": 7785.32, "text": "nein, warum, weil, ok, gut, dann loggen wir uns mal da drauf ein, Root-Add, nee, war ich"}, {"id": 823, "start": 7785.32, "end": 7794.04, "text": "dann nie drauf eingeloggt hier, auf welcher Kiste läuft mein TV-Header auf dem Ding, so"}, {"id": 824, "start": 7794.04, "end": 7804.04, "text": "ein Linux-Receiver mit 8-fach Tuner, so, deswegen wollte ich es nicht nach Bild kopieren, weil"}, {"id": 825, "start": 7804.04, "end": 7816.32, "text": "ich hier testweise schon mal was anderes mal drauf kopiert habe, ok, EPG-Champ, EPG-Champ,"}, {"id": 826, "start": 7816.32, "end": 7834.88, "text": "Team Accession starten, Bild, Backend, BÄM, und, das startet, easy, funktioniert einfach,"}, {"id": 827, "start": 7834.88, "end": 7840.64, "text": "wisst ihr mal, Massive-Portables.net hier, fast so gut wie Go, was das angeht mittlerweile,"}, {"id": 828, "start": 7840.64, "end": 7848.16, "text": "nicht wirklich, also Go ist was, ähm, statische Binaries angeht, nochmal eine ganze Ecke besser,"}, {"id": 829, "start": 7848.16, "end": 7863.18, "text": "wie viel CPU-Kerne hat das Ding auch, doch so viel, 2 RAM, viel RAM hat das ja auch nicht"}, {"id": 830, "start": 7863.18, "end": 7877.24, "text": "gerade, oder? Achso, mir fällt gerade ein, das ist jetzt blöd gewesen, wir können das"}, {"id": 831, "start": 7877.24, "end": 7885.24, "text": "gar nicht ausführen auf der Kiste, weil, also noch nicht, weil die Web-Anwendung ja"}, {"id": 832, "start": 7885.24, "end": 7891.16, "text": "überhaupt nicht dafür ausgelegt ist, guckt mal, die Web-Anwendung geht überall Hardcoded,"}, {"id": 833, "start": 7891.16, "end": 7905.32, "text": "Hardcoded auf Localhost 4500, das kann nicht funktionieren, Localhost, das haben wir an"}, {"id": 834, "start": 7905.32, "end": 7915.0, "text": "drei Stellen, nee, Moment, eins, zwei, drei, vier Stellen, wie macht man denn sowas jetzt"}, {"id": 835, "start": 7915.0, "end": 7928.0, "text": "eigentlich, hm, wie, wie macht man, wie macht man einen guten Schalter, ob es lokal läuft"}, {"id": 836, "start": 7928.0, "end": 7934.08, "text": "oder, oder deploit auf dem Server, wie, da hab ich jetzt eine gute, wie macht man das"}, {"id": 837, "start": 7934.08, "end": 7944.28, "text": "schön, ähm, Host und Port-Variabel, ich hätte jetzt Host und Port gecheckt, also mein Lokal"}, {"id": 838, "start": 7944.28, "end": 7956.92, "text": "läuft ja auf Port 3000, ENF, aber Environment, wie soll ich denn im Frontend in meinem Browser"}, {"id": 839, "start": 7956.92, "end": 7977.8, "text": "auf Environment-Variablen zugreifen, die auf dem Server sind, das geht ja nicht, ok,"}, {"id": 840, "start": 7977.8, "end": 7984.36, "text": "wir müssen zwei Sachen machen, wir müssen statisch Svelte Static Adapter brauchen wir,"}, {"id": 841, "start": 7984.36, "end": 7994.16, "text": "wir müssen erstmal Svelte bilden überhaupt, ansonsten funktioniert es nicht, Static, ja,"}, {"id": 842, "start": 7994.16, "end": 8003.44, "text": "Adapter Static brauchen wir, das ist irgendwie das Svelte-Config, Adapter Static und das"}, {"id": 843, "start": 8003.44, "end": 8015.16, "text": "muss man irgendwie auch installieren noch, NPM install, gut, und jetzt NPM build glaube"}, {"id": 844, "start": 8015.16, "end": 8034.64, "text": "ich NPM build, ist das NPM build, nein, ähm, Moment, Svelte, NPM run build, NPM run build,"}, {"id": 845, "start": 8034.64, "end": 8045.36, "text": "was vielleicht, das schon besser, äh, und hier drunter liegt es jetzt wahrscheinlich,"}, {"id": 846, "start": 8045.36, "end": 8057.24, "text": "oder, Svelte-Kit, äh, Bild, Index, nee, äh, Output, Server, Monkeys, was davon, was davon"}, {"id": 847, "start": 8057.24, "end": 8073.12, "text": "brauche ich jetzt eigentlich, nochmal löschen, wie macht man das jetzt eigentlich, das, und"}, {"id": 848, "start": 8073.12, "end": 8078.44, "text": "ich muss auch in der.NET Anwendung einstellen, dass ich den Kram ausliefern will, haben wir"}, {"id": 849, "start": 8078.44, "end": 8084.96, "text": "noch gar nicht gemacht, www root Verzeichnis, da muss es nämlich rein, da muss die Web Anwendung"}, {"id": 850, "start": 8084.96, "end": 8109.4, "text": "rein, im Ende, hier ist ein Bild, ach, hier ist ein Bild Ordner, oh, was habe ich denn"}, {"id": 851, "start": 8109.4, "end": 8115.12, "text": "gerade da gelöscht, Leute, ich habe gerade ein.Svelte-Kit Ordner gelöscht, war das"}, {"id": 852, "start": 8115.12, "end": 8126.56, "text": "eine gute Idee, aber wahrscheinlich ist nichts kaputt gegangen, das Java-Skript, da kann"}, {"id": 853, "start": 8126.56, "end": 8138.36, "text": "man die Hälfte löschen und das macht nichts, ok, CP, Bild, oder, äh, Sternchen, nach"}, {"id": 854, "start": 8138.36, "end": 8149.76, "text": "Big End, www root, ok, Run, so, von der Idee her sollte ich jetzt zumindest den Kram aufrufen"}, {"id": 855, "start": 8149.76, "end": 8159.8, "text": "können, direkt von, von.NET aus, also, Local Host 4500, das sieht gut aus, das sieht gut"}, {"id": 856, "start": 8159.8, "end": 8168.52, "text": "aus, ok, das funktioniert prinzipiell schon mal, Alter, das lag im Firefox, guck mal hier,"}, {"id": 857, "start": 8168.52, "end": 8177.76, "text": "der Firefox kann die Animation nicht, seht ihr das, keck weh, die Animation ist im Firefox,"}, {"id": 858, "start": 8177.76, "end": 8196.64, "text": "geht einfach nicht, warum, liegt das am Dark Reader, off, ah, ne, die, what the fuck, Leute,"}, {"id": 859, "start": 8196.64, "end": 8213.72, "text": "die Animation geht nur einmalig, das ist ein Bug im Firefox, oder, das ist mega laggy,"}, {"id": 860, "start": 8213.72, "end": 8223.72, "text": "das Ding im Firefox mit der Animation, ich mein, viel anders kann ich jetzt nicht machen,"}, {"id": 861, "start": 8223.72, "end": 8233.24, "text": "also, oh ne, ich muss npm install nochmal raushauen, npm install, ich bin mir nicht"}, {"id": 862, "start": 8233.24, "end": 8236.6, "text": "so, ich bin mir nicht sicher, ob das so eine gute Idee war, den SvelteKit Ordner zu löschen,"}, {"id": 863, "start": 8236.6, "end": 8260.48, "text": "Trash, Restore, SvelteKit, lieber mal wieder hin machen, ne, ja, da ist schon übrigens"}, {"id": 864, "start": 8260.48, "end": 8269.68, "text": "am rumspatten, ok, ne, Moment, Moment, Moment, Zack, schauen die Konsole, ob's Exceptions"}, {"id": 865, "start": 8269.68, "end": 8280.56, "text": "gibt, gute Idee, nö, es buggt einfach nur in es langsam, wie Sau, ok, wisst ihr was,"}, {"id": 866, "start": 8280.56, "end": 8292.0, "text": "ganz einfach, Fly, Zack, alles geht hier hin, Scheiß auf Animation, kommt jetzt weg, und"}, {"id": 867, "start": 8292.0, "end": 8308.32, "text": "hier mal wieder, Class, Hidden, gleich, Not, ah, weg damit, Pot, was ist das, Brüschl Studio"}, {"id": 868, "start": 8308.32, "end": 8320.76, "text": "hat gefailt beim Laden, alles klar, ok, Build, also im Prinzip wollen wir ja sowas hier machen,"}, {"id": 869, "start": 8320.76, "end": 8345.52, "text": "nach jedem, nach jedem Build, Build, Run, Build, und dann das, ok, hier ist jetzt die"}, {"id": 870, "start": 8345.52, "end": 8355.08, "text": "aktualisierte Anwendung drin, alles klar, und Run, startet, gucken, ob's jetzt schneller"}, {"id": 871, "start": 8355.08, "end": 8366.0, "text": "geht, hallo, wie's, oh ne, hab ich's jetzt kaputt gemacht, alter, mein einer Edit hat"}, {"id": 872, "start": 8366.0, "end": 8376.12, "text": "irgendwas zerstört jetzt, was hab ich denn jetzt kaputt gemacht, hab ich, was war das,"}, {"id": 873, "start": 8376.12, "end": 8385.8, "text": "Quoten, ne, was hab ich denn jetzt, irgendwas hab ich jetzt zerstört, Klassiker, ja, ok,"}, {"id": 874, "start": 8385.8, "end": 8398.56, "text": "Run, Open, ok, es ist dem Chrome auch kaputt, das ist schon mal gut zu wissen, Cannot Read,"}, {"id": 875, "start": 8398.56, "end": 8406.76, "text": "ah, ich weiß woran's liegt, guck mal, ich greif hier auf Dinge zu, die's, die's gar"}, {"id": 876, "start": 8406.76, "end": 8427.8, "text": "nicht gibt, wenn es das, das ist natürlich blöd von mir, ok, gut, so, Fixed, so wunderbar,"}, {"id": 877, "start": 8427.8, "end": 8432.36, "text": "jetzt müssen wir die Seite irgendwie noch Fit machen, das Local Host muss raus, Leute,"}, {"id": 878, "start": 8432.36, "end": 8437.12, "text": "mir fällt, mir fällt nix gescheites ein, wenn ihr eine bessere Idee habt, die ganzen"}, {"id": 879, "start": 8437.12, "end": 8444.36, "text": "JavaScript File Fats, sagt's mir, man könnte, man könnte doch sowas hier checken, schau"}, {"id": 880, "start": 8444.36, "end": 8456.64, "text": "dir mal das hier an, ok, zeig mal, how do I include details from in my application, import,"}, {"id": 881, "start": 8456.64, "end": 8470.92, "text": "Read, File, Sync, ne, das ist Server-Side-Rendering-Campel, Import, Meta, Env, Backend, Path, ja, aber wo"}, {"id": 882, "start": 8470.92, "end": 8474.16, "text": "soll ich in meinem Frontend dann irgendwelche Environment Variablen herkriegen?"}, {"id": 883, "start": 8474.16, "end": 8503.32, "text": "Achso, das compilte er mir da rein oder was, oder wie, also, aber, ok, ok, ok, ok, ok,"}, {"id": 884, "start": 8503.32, "end": 8511.64, "text": "aber, wo setze ich das denn jetzt, also sprich, bei einem Bild, bei einem Bild erkennt er"}, {"id": 885, "start": 8511.64, "end": 8522.28, "text": "es jetzt quasi in Production Mode, oder wie, und woher weiß der, dass er bei einem Run"}, {"id": 886, "start": 8522.28, "end": 8533.2, "text": "was anderes in die Variable rein schreiben muss als mit einem Bild, aber ich mache hier"}, {"id": 887, "start": 8533.2, "end": 8541.96, "text": "ein Static-Bild, ne, also ich mache ein Static-Bild, das ist dann einmalig rein gebacken, ist"}, {"id": 888, "start": 8541.96, "end": 8547.72, "text": "das, also müsste ich dann quasi sowas hier machen, also ich sag ihm dann quasi im Endeffekt"}, {"id": 889, "start": 8547.72, "end": 8556.84, "text": "Export, Wide, Underscore, sowas, sowas, also quasi irgendwie Wide, Env, oder sag ich irgendwie"}, {"id": 890, "start": 8556.84, "end": 8563.28, "text": "die Prot, oder sowas, und dann mach ich ein Bild, und wenn ich das jetzt im Browser aufrufe,"}, {"id": 891, "start": 8563.28, "end": 8578.84, "text": "ist es, ist es, ähm, drinnen oder was, ne, wobei ich könnte eigentlich auch so machen,"}, {"id": 892, "start": 8578.84, "end": 8593.24, "text": "ne, so, ok, das muss ich jetzt ausprobieren, das, das, das stellen wir jetzt, ok, ähm,"}, {"id": 893, "start": 8593.24, "end": 8598.52, "text": "machen wir hier rein, Lock, und wie greife ich dann drauf zu, so, you can access the variable"}, {"id": 894, "start": 8598.52, "end": 8618.88, "text": "using Import-Meter, ok, also im Prinzip würde ich jetzt sowas hier machen, Lock, Lock, Env,"}, {"id": 895, "start": 8618.88, "end": 8626.36, "text": "sowas da, oder, seh ich das richtig, und dann, da würde jetzt Port rauskommen, wenn ich,"}, {"id": 896, "start": 8626.36, "end": 8648.48, "text": "wenn ich das bilde, da bin ich ja mal gespannt, ob das funzt, Pog, das ist ja gut, das wusste"}, {"id": 897, "start": 8648.48, "end": 8654.64, "text": "ich nicht, ok, das ist nice, das ist nice, da kann ich jetzt nämlich checken, das finde"}, {"id": 898, "start": 8654.64, "end": 8659.0, "text": "ich gut, da wird ja was gelernt, Chat, das finde ich gut, das heißt jetzt kann ich hier"}, {"id": 899, "start": 8659.0, "end": 8665.6, "text": "nämlich checken, im Endeffekt, sagen wir mal irgendwie, let url gleich, so, dann checken"}, {"id": 900, "start": 8665.6, "end": 8673.88, "text": "wir das, gleich, gleich, Prot, so, wenn das so ist, dann ist es einfach nur ein Slash,"}, {"id": 901, "start": 8673.88, "end": 8687.04, "text": "und wenn das das nicht ist, dann ist es Localhost 45000, das müsste doch eigentlich funktionieren,"}, {"id": 902, "start": 8687.04, "end": 8697.6, "text": "was ich hier mache, und jetzt sage ich an der Stelle, url plus epg, bin ich mal gespannt,"}, {"id": 903, "start": 8697.6, "end": 8717.56, "text": "ob das tut, du kannst ins Welt direkt checken, ob es in Prot läuft, und wie, das wäre natürlich"}, {"id": 904, "start": 8717.56, "end": 8745.68, "text": "noch besser, aber so müsste es auch funktionieren, was mache ich denn hier an der Stelle, so,"}, {"id": 905, "start": 8745.68, "end": 8757.6, "text": "jetzt müsste es gehen, Import, Meta, Enf, ach ich muss das gar nicht setzen, ich kann"}, {"id": 906, "start": 8757.6, "end": 8768.12, "text": "einfach sagen, Import, Meta, Enf, Prot, also so quasi dann, das werden wir jetzt gleich"}, {"id": 907, "start": 8768.12, "end": 8784.6, "text": "sehen, ob das funktioniert, da brauche ich den Kram ja auch nicht setzen, schau mal mal,"}, {"id": 908, "start": 8784.6, "end": 8795.36, "text": "ne, oder, ach hier habe ich einen Slash hinten dran, und sonst nicht, hier habe ich den von"}, {"id": 909, "start": 8795.36, "end": 8800.04, "text": "Slash dran, ich darf da auch keinen Slash hinten dran machen, ich kann, ja das ist jetzt,"}, {"id": 910, "start": 8800.04, "end": 8816.8, "text": "da gibt es mit einer globalen Variable, fände ich das schöner so, ach, ok, das ist auch"}, {"id": 911, "start": 8816.8, "end": 8827.52, "text": "nicht verkehrt, lull, ja ok, ich teste es jetzt erstmal so, ob das funzt, was der Chat"}, {"id": 912, "start": 8827.52, "end": 8840.32, "text": "geschrieben hat, aber das scheint auch zu funktionieren Leute, wobei Local Host ist"}, {"id": 913, "start": 8840.32, "end": 8856.6, "text": "in dem Fall immer Local Host, ok, wir deployen das mal und gucken, ob es funktioniert, also"}, {"id": 914, "start": 8856.6, "end": 8878.76, "text": "Build, ne Publish, Release, EpgChamp, ok zack, EpgChamp, Build, Backend, ach ne jetzt läuft"}, {"id": 915, "start": 8878.76, "end": 8890.6, "text": "es ja Local Host, ah was war das, ASP.NET, Ural, Export, dass man dem sagen kann, irgendwie"}, {"id": 916, "start": 8890.6, "end": 8910.8, "text": "so hieß das doch, Export, ASP.NET, Ural, hier, ASP.NET Core Ural, das meine ich, so,"}, {"id": 917, "start": 8910.8, "end": 8928.56, "text": "ein Sternchen, Doppelpunkt, auf welchem Port lassen wir es laufen, wieder 4500, ist doch"}, {"id": 918, "start": 8928.56, "end": 8931.56, "text": "Ach so, weil ich Http davor machen muss."}, {"id": 919, "start": 8934.56, "end": 8935.56, "text": "Aha!"}, {"id": 920, "start": 8935.56, "end": 8936.56, "text": "Okay."}, {"id": 921, "start": 8936.56, "end": 8941.56, "text": "122.161.29.4500."}, {"id": 922, "start": 8941.56, "end": 8942.56, "text": "Und..."}, {"id": 923, "start": 8942.56, "end": 8943.56, "text": "Pog!"}, {"id": 924, "start": 8944.56, "end": 8945.56, "text": "Nice!"}, {"id": 925, "start": 8945.56, "end": 8948.56, "text": "Es läuft auf meiner Linux-Box."}, {"id": 926, "start": 8948.56, "end": 8958.56, "text": "Ah, der hat... der hat KegW nicht mit deployed, Leute."}, {"id": 927, "start": 8958.56, "end": 8960.56, "text": "Kein KegW."}, {"id": 928, "start": 8962.56, "end": 8965.56, "text": "Ich muss sagen, das ist sogar relativ schnell, der Kram."}, {"id": 929, "start": 8965.56, "end": 8967.56, "text": "Kannst du den nicht beschweren, guck mal."}, {"id": 930, "start": 8967.56, "end": 8969.56, "text": "Das läuft relativ zackig."}, {"id": 931, "start": 8972.56, "end": 8976.56, "text": "So, mal gucken, ob wir was... ob wir... ja, Aladdin unbedingt."}, {"id": 932, "start": 8976.56, "end": 8978.56, "text": "Aufnahme. Bam, Funst!"}, {"id": 933, "start": 8979.56, "end": 8980.56, "text": "Aufnahme!"}, {"id": 934, "start": 8980.56, "end": 8982.56, "text": "Things löschen, zack!"}, {"id": 935, "start": 8983.56, "end": 8984.56, "text": "Nice!"}, {"id": 936, "start": 8985.56, "end": 8988.56, "text": "Das läuft ausgesprochen gut, das hätte ich gar nicht gedacht."}, {"id": 937, "start": 8988.56, "end": 8990.56, "text": "Wie viel... oh."}, {"id": 938, "start": 8990.56, "end": 8992.56, "text": "Ach so, das ist, weil ich das nicht abrufen kann von den Images."}, {"id": 939, "start": 8992.56, "end": 8993.56, "text": "Ja, okay."}, {"id": 940, "start": 8993.56, "end": 8997.56, "text": "Wie viel... wie viel... poah, hatten das so CPU-Auslastungen und so?"}, {"id": 941, "start": 8997.56, "end": 8999.56, "text": "Nix, oder? Es juckt ihn überhaupt nicht."}, {"id": 942, "start": 8999.56, "end": 9002.56, "text": "Hm."}, {"id": 943, "start": 9003.56, "end": 9005.56, "text": "Three."}, {"id": 944, "start": 9006.56, "end": 9008.56, "text": "Nö, das interessiert ihn nicht wirklich."}, {"id": 945, "start": 9009.56, "end": 9011.56, "text": "Das braucht kaum RAM."}, {"id": 946, "start": 9011.56, "end": 9013.56, "text": "Äh, hey Max, mal was ganz anderes."}, {"id": 947, "start": 9013.56, "end": 9015.56, "text": "Ja, schieß los."}, {"id": 948, "start": 9015.56, "end": 9019.56, "text": "Ich habe auch eine 8-Linux-VM, by the way."}, {"id": 949, "start": 9019.56, "end": 9021.56, "text": "Beste, beste Distribution."}, {"id": 950, "start": 9021.56, "end": 9023.56, "text": "Infallible Worksite, ursprünglich erstellt 60G."}, {"id": 951, "start": 9023.56, "end": 9028.56, "text": "Habe die VM-DK jetzt auf 120GB erweitert, aber wie kann ich jetzt ohne reinstall die..."}, {"id": 952, "start": 9028.56, "end": 9030.56, "text": "Äh, nee, ganz einfach, ganz einfach."}, {"id": 953, "start": 9030.56, "end": 9032.56, "text": "Easy, easy."}, {"id": 954, "start": 9033.56, "end": 9036.56, "text": "Resize to FS einfach machen."}, {"id": 955, "start": 9036.56, "end": 9038.56, "text": "Bam."}, {"id": 956, "start": 9039.56, "end": 9041.56, "text": "Fertig."}, {"id": 957, "start": 9041.56, "end": 9043.56, "text": "Äh."}, {"id": 958, "start": 9043.56, "end": 9044.56, "text": "Ging das nicht so?"}, {"id": 959, "start": 9044.56, "end": 9046.56, "text": "Sudo muss man, glaube ich, machen."}, {"id": 960, "start": 9048.56, "end": 9052.56, "text": "Resize to FS slash."}, {"id": 961, "start": 9054.56, "end": 9056.56, "text": "Äh, ging das nicht so?"}, {"id": 962, "start": 9056.56, "end": 9058.56, "text": "Ach gut, ich habe ja auch nichts zum Resi..."}, {"id": 963, "start": 9058.56, "end": 9060.56, "text": "Soll ich euch zeigen, wie man das mit dem Resi-sen macht?"}, {"id": 964, "start": 9060.56, "end": 9062.56, "text": "Mal gucken, ob ich das jetzt hinbekomme."}, {"id": 965, "start": 9062.56, "end": 9064.56, "text": "Also, wir haben hier eine Festplatte mit."}, {"id": 966, "start": 9064.56, "end": 9066.56, "text": "125G."}, {"id": 967, "start": 9069.56, "end": 9071.56, "text": "Und jetzt Resi-sen."}, {"id": 968, "start": 9071.56, "end": 9073.56, "text": "Ich weiß nicht, ob ich dafür ausschalten muss."}, {"id": 969, "start": 9073.56, "end": 9076.56, "text": "Muss man erst die Partition vergrößern, ja?"}, {"id": 970, "start": 9077.56, "end": 9080.56, "text": "Ja, stimmt. Du musst erst die Partition..."}, {"id": 971, "start": 9081.56, "end": 9083.56, "text": "Probier mal aus, probier mal aus."}, {"id": 972, "start": 9083.56, "end": 9086.56, "text": "So, ähm..."}, {"id": 973, "start": 9091.56, "end": 9094.56, "text": "Okay, probieren wir das jetzt aus."}, {"id": 974, "start": 9095.56, "end": 9098.56, "text": "Das, das machen wir jetzt mal nebenbei."}, {"id": 975, "start": 9098.56, "end": 9101.56, "text": "So, EPG-Champ abgebrochen."}, {"id": 976, "start": 9103.56, "end": 9105.56, "text": "Du kannst doch eine zweite Platte nehmen, ja, aber..."}, {"id": 977, "start": 9105.56, "end": 9108.56, "text": "Nee, nee, wir machen das jetzt mal mit dem Resize."}, {"id": 978, "start": 9108.56, "end": 9110.56, "text": "Mal ein bisschen was anderes zwischendurch."}, {"id": 979, "start": 9110.56, "end": 9113.56, "text": "Wir machen das jetzt noch mal von der VM."}, {"id": 980, "start": 9115.56, "end": 9118.56, "text": "So, probieren wir das nochmal."}, {"id": 981, "start": 9118.56, "end": 9121.56, "text": "Ähm, Hard, Expand."}, {"id": 982, "start": 9121.56, "end": 9123.56, "text": "Und zwar 130G."}, {"id": 983, "start": 9123.56, "end": 9125.56, "text": "Es reichen da zwei Gigabyte mehr, oder?"}, {"id": 984, "start": 9125.56, "end": 9127.56, "text": "Ist ja egal."}, {"id": 985, "start": 9127.56, "end": 9128.56, "text": "Expand."}, {"id": 986, "start": 9128.56, "end": 9130.56, "text": "Expanding Disk."}, {"id": 987, "start": 9130.56, "end": 9133.56, "text": "Schrrr, schrrr, schrrr."}, {"id": 988, "start": 9133.56, "end": 9138.56, "text": "Schrrr, schrrr, schrrr, schrrr."}, {"id": 989, "start": 9142.56, "end": 9145.56, "text": "Ich bin mir nicht sicher, ob wir das wirklich machen wollen."}, {"id": 990, "start": 9154.56, "end": 9157.56, "text": "Das braucht ganz schön lang."}, {"id": 991, "start": 9157.56, "end": 9159.56, "text": "Ich meine, es ist eine SSD."}, {"id": 992, "start": 9159.56, "end": 9162.56, "text": "Was macht der da um zwei Gigabyte erweitern?"}, {"id": 993, "start": 9165.56, "end": 9167.56, "text": "WTF?"}, {"id": 994, "start": 9168.56, "end": 9172.56, "text": "Ich wette mit euch, wenn ich abbrechen drücke, bringt das nix."}, {"id": 995, "start": 9175.56, "end": 9178.56, "text": "Okay, Chat, ich lese mal ein paar Fragen durch."}, {"id": 996, "start": 9179.56, "end": 9183.56, "text": "Ja, wahrscheinlich ist deine VM auch relativ neu und kaum was drauf."}, {"id": 997, "start": 9183.56, "end": 9187.56, "text": "Oder?"}, {"id": 998, "start": 9187.56, "end": 9189.56, "text": "Ja, also das würde auch funktionieren."}, {"id": 999, "start": 9189.56, "end": 9191.56, "text": "Zwei als neue Platte einbinden."}, {"id": 1000, "start": 9191.56, "end": 9194.56, "text": "Aber das klappt nur gut, wenn du eine LVM drunter hast."}, {"id": 1001, "start": 9196.56, "end": 9199.56, "text": "Dass du das dann ins LVM zusätzlich reinhängst."}, {"id": 1002, "start": 9199.56, "end": 9201.56, "text": "Ohne LVM ist das..."}, {"id": 1003, "start": 9201.56, "end": 9203.56, "text": "...bisschen doof."}, {"id": 1004, "start": 9203.56, "end": 9206.56, "text": "Aber hier hab ich wieder was gelernt."}, {"id": 1005, "start": 9206.56, "end": 9209.56, "text": "Das ist gut zu wissen, dass sowas funktioniert."}, {"id": 1006, "start": 9209.56, "end": 9212.56, "text": "Das ist gut zu wissen, dass sowas funktioniert."}, {"id": 1007, "start": 9220.56, "end": 9222.56, "text": "Tja."}, {"id": 1008, "start": 9233.56, "end": 9236.56, "text": "Leute, wenn ich jetzt abbrechen drücke..."}, {"id": 1009, "start": 9236.56, "end": 9238.56, "text": "...weiß ich genau..."}, {"id": 1010, "start": 9238.56, "end": 9240.56, "text": "...wir gucken da jetzt gar nicht zu."}, {"id": 1011, "start": 9240.56, "end": 9242.56, "text": "Ich meine, guck mal."}, {"id": 1012, "start": 9242.56, "end": 9244.56, "text": "Das hat jetzt 2-3 Minuten gebraucht, da war es soweit."}, {"id": 1013, "start": 9244.56, "end": 9246.56, "text": "In 10 Minuten ist das fertig, spätestens."}, {"id": 1014, "start": 9246.56, "end": 9248.56, "text": "So, was haben wir sonst noch Interessantes?"}, {"id": 1015, "start": 9248.56, "end": 9251.56, "text": "Chat, gibt es irgendwas Spannendes, was wir noch klären müssen heute?"}, {"id": 1016, "start": 9251.56, "end": 9263.56, "text": "Irgendwas übersehen."}, {"id": 1017, "start": 9263.56, "end": 9265.56, "text": "Nee, sieht nicht so aus."}, {"id": 1018, "start": 9265.56, "end": 9267.56, "text": "Können noch ein Video anschauen, ja."}, {"id": 1019, "start": 9267.56, "end": 9269.56, "text": "Bis das..."}, {"id": 1020, "start": 9269.56, "end": 9271.56, "text": "...bis das fertig ist, können wir uns..."}, {"id": 1021, "start": 9271.56, "end": 9273.56, "text": "Es geht eigentlich."}, {"id": 1022, "start": 9273.56, "end": 9281.56, "text": "Ein GUI-Vorschlag fürs EPG, zeig ich mal her."}, {"id": 1023, "start": 9281.56, "end": 9283.56, "text": "Nope."}, {"id": 1024, "start": 9283.56, "end": 9285.56, "text": "Funktioniert nicht."}, {"id": 1025, "start": 9285.56, "end": 9287.56, "text": "Wir machen von links nach rechts und nicht von oben nach unten."}, {"id": 1026, "start": 9287.56, "end": 9289.56, "text": "Wir machen von links nach rechts und nicht von oben nach unten."}, {"id": 1027, "start": 9289.56, "end": 9291.56, "text": "Außerdem ist das doch überhaupt nicht richtig tabletbedienbar, oder?"}, {"id": 1028, "start": 9291.56, "end": 9293.56, "text": "Wie soll man das im Tablet gescheit bedienen?"}, {"id": 1029, "start": 9293.56, "end": 9295.56, "text": "Wie soll man das im Tablet gescheit bedienen?"}, {"id": 1030, "start": 9295.56, "end": 9297.56, "text": "Das funktioniert nicht gut im Tablet, oder?"}, {"id": 1031, "start": 9307.56, "end": 9309.56, "text": "Ich hab' den Emoji-Film, Alter!"}, {"id": 1032, "start": 9309.56, "end": 9311.56, "text": "Das ist so ein Rotz."}, {"id": 1033, "start": 9315.56, "end": 9317.56, "text": "Nee, ich hab' den Emoji-Film."}, {"id": 1034, "start": 9317.56, "end": 9319.56, "text": "Ich hab' den Emoji-Film."}, {"id": 1035, "start": 9319.56, "end": 9321.56, "text": "Ich hab' den Emoji-Film."}, {"id": 1036, "start": 9321.56, "end": 9323.56, "text": "Ich hab' den Emoji-Film."}, {"id": 1037, "start": 9323.56, "end": 9325.56, "text": "Ich hab' den Emoji-Film."}, {"id": 1038, "start": 9325.56, "end": 9327.56, "text": "Nee, da find' ich meinen's ja tatsächlich besser."}, {"id": 1039, "start": 9331.56, "end": 9333.56, "text": "Was haben wir denn noch für einen Witz?"}, {"id": 1040, "start": 9337.56, "end": 9339.56, "text": "So schwärzt du deinen Personalausweis."}, {"id": 1041, "start": 9339.56, "end": 9341.56, "text": "So schwärzt du deinen Personalausweis."}, {"id": 1042, "start": 9341.56, "end": 9343.56, "text": "Ist dein Strike eigentlich weg?"}, {"id": 1043, "start": 9343.56, "end": 9345.56, "text": "Ist dein Strike eigentlich weg? Ich hoffe mal."}, {"id": 1044, "start": 9345.56, "end": 9357.72, "text": "Nee, da müssen wir mal ein bisschen, ein bisschen, ich müsste da mal auf Twitter das"}, {"id": 1045, "start": 9357.72, "end": 9364.2, "text": "noch mal Quoten und mal ein paar Leute, die ich, die ich, ein bisschen, bisschen größere"}, {"id": 1046, "start": 9364.2, "end": 9370.4, "text": "Leute, die man so die Jahre über kennt, einfach mal add, add schreiben, weil wenn es, wenn"}, {"id": 1047, "start": 9370.4, "end": 9374.32, "text": "es genug Leute retweeten, guckt sich das einer von YouTube an, der ein bisschen Plan hat"}, {"id": 1048, "start": 9374.32, "end": 9378.32, "text": "und sagt nie so einen Schwachsinn, das ist doch gar kein, das ist doch gar kein, kein,"}, {"id": 1049, "start": 9378.32, "end": 9381.16, "text": "kein, gegen unsere Richtlinien."}, {"id": 1050, "start": 9381.16, "end": 9385.44, "text": "Das Problem bei YouTube ist, dass wenn das ihr Algorithmus erkannt hat und es dann an"}, {"id": 1051, "start": 9385.44, "end": 9389.4, "text": "irgendein Mensch geht, der Mensch sagt nö, nö, unser Algorithmus war schon richtig und"}, {"id": 1052, "start": 9389.4, "end": 9393.28, "text": "dann kannst du nie wieder was einlegen, dann müsstest du irgendeinen Anwalt nehmen, wer"}, {"id": 1053, "start": 9393.28, "end": 9394.28, "text": "macht das dann?"}, {"id": 1054, "start": 9394.28, "end": 9406.28, "text": "Was haben wir denn hier sonst noch, die bessere Form der Product Placement, okay das ist 6"}, {"id": 1055, "start": 9406.28, "end": 9412.92, "text": "Minuten, das geht schon schnell, nach dem Video ist das fertig, zeig mal her, das neue"}, {"id": 1056, "start": 9412.92, "end": 9421.56, "text": "bessere Product Placement, not VPN, ich kann, der EPG funktioniert erstaunlich gut, du hast"}, {"id": 1057, "start": 9421.56, "end": 9427.28, "text": "verpasst, ich hab im Chat jemand gesagt, ich zeig dir mal kurz wie du in der VM deine Festplatte"}, {"id": 1058, "start": 9427.28, "end": 9439.04, "text": "resized und jetzt ist mein VM-Werder Meinung, ja nicht so schnell, okay."}, {"id": 1059, "start": 9439.04, "end": 9464.68, "text": "Das stimmt, das stimmt, das ist mir auch aufgefallen, es gibt ganz viele, die machen das jetzt wieder"}, {"id": 1060, "start": 9464.68, "end": 9469.92, "text": "bauer zum Beispiel, die rattern diesen ganzen Krempel einfach nur noch runter und das ist"}, {"id": 1061, "start": 9469.92, "end": 9475.08, "text": "eine Sorte von Produktplatzierung, mit der könnte ich mich auch öfters anfreunden, also"}, {"id": 1062, "start": 9475.08, "end": 9480.28, "text": "im Prinzip sag ich da nicht so nach dem Motto, so wie Bibi das gemacht hat, Leute ich hab"}, {"id": 1063, "start": 9480.28, "end": 9485.04, "text": "heute so eine schöne Uhr gefunden, oh da freu ich mich, dass ich diese Uhr gefunden habe,"}, {"id": 1064, "start": 9485.04, "end": 9490.36, "text": "die gibt's auch gerade bei XY ganz günstig, diese Uhr die ist so toll, nicht mehr, so"}, {"id": 1065, "start": 9490.36, "end": 9494.04, "text": "macht man das nicht mehr, ich hab's jetzt an vielen Stellen gesehen, dass die Leute"}, {"id": 1066, "start": 9494.04, "end": 9499.12, "text": "auf YouTube quasi sagen, Hersteller XY hat eine neue Uhr rausgebracht, ihr könnt ihr"}, {"id": 1067, "start": 9499.12, "end": 9502.56, "text": "unter dieser Uhr euch das Ganze angucken, bis zum ersten, fünften, bla bla bla, ist das"}, {"id": 1068, "start": 9502.56, "end": 9515.68, "text": "Ganze kostenlos und hier weitere Informationen, next, next, fertig, so muss man's machen,"}, {"id": 1069, "start": 9515.68, "end": 9524.4, "text": "es ist ein bisschen, wie dann, wenn, keine Ahnung, irgendein Promi sagt, ah ich verwende"}, {"id": 1070, "start": 9524.4, "end": 9533.28, "text": "jetzt, was weiß ich, Manscape oder so, einfach durch rattern und gut."}, {"id": 1071, "start": 9533.28, "end": 9545.92, "text": "Die Grafik hier hab ich schon in einigen Videos gezeigt, es ist die Fivehead Grafik,"}, {"id": 1072, "start": 9545.92, "end": 9557.76, "text": "aha, das POX Modell, achso, ich glaub ich weiß, Leute ich hab keine Ahnung von so Marketing"}, {"id": 1073, "start": 9557.76, "end": 9563.56, "text": "aber ich glaube, ich weiß um was es da geht, das ist das was es seit hunderten Jahren schon"}, {"id": 1074, "start": 9563.56, "end": 9572.92, "text": "gibt, dass Leute die du magst, ähm, wie ist das, dass Leute die du magst und wenn die"}, {"id": 1075, "start": 9572.92, "end": 9578.48, "text": "dir was mit persönlicher Empfehlung empfehlen, dann ist die Chance, dass du das Produkt magst"}, {"id": 1076, "start": 9578.48, "end": 9579.48, "text": "auch höher."}, {"id": 1077, "start": 9579.48, "end": 9583.96, "text": "Oder was heißt Influencer Marketing, jegliche Marketing, das du empfiehst, das liegt nur"}, {"id": 1078, "start": 9583.96, "end": 9587.6, "text": "da dran, weil ich jemandem im Stream was zeigen wollte und hier muss ich jetzt warten bis dieser"}, {"id": 1079, "start": 9587.6, "end": 9609.84, "text": "tolle Balken fertig ist, er, du hast den Spaß studiert, ohje, Marketing-Stroggs-Mann, das"}, {"id": 1080, "start": 9609.84, "end": 9617.52, "text": "genau, das ist das was ich meinte, das ist das was ich meinte, das ist das was ich meinte,"}, {"id": 1081, "start": 9617.52, "end": 9623.34, "text": "das ist das was ich meinte, was ich meinte, ganz 결국 des Problems ist, man hat auf"}, {"id": 1082, "start": 9623.34, "end": 9618.02, "text": "jeden Fall eine continuously residentsielle conteúdo, soidan zwarOTHEN"}, {"id": 1083, "start": 9618.02, "end": 9638.24, "text": "knowing"}, {"id": 1084, "start": 9638.24, "end": 9642.9, "text": "Ich glaube das ist doch umgedreht auch so stellen euch mal vor ihr guckt gerne"}, {"id": 1085, "start": 9644.64, "end": 9648.36, "text": "Influencer a und Influencer a sagt immer alter"}, {"id": 1086, "start": 9649.6, "end": 9654.4, "text": "xbox scheiße playstation geilste dann machen die leute da auch mit oder"}, {"id": 1087, "start": 9654.4, "end": 9666.6, "text": "Scheiß Wichtbox genau"}, {"id": 1088, "start": 9666.6, "end": 9674.52, "text": "Deswegen auch die beziehung tendieren dazu im gleichgewicht zu bleiben wenn ich als o"}, {"id": 1089, "start": 9674.52, "end": 9679.8, "text": "beispielsweise testimonial p überhaupt nicht mag kann das dazu führen dass sich das von ihm"}, {"id": 1090, "start": 9679.8, "end": 9685.76, "text": "beworbene produkt x auch weniger mag und das ist kein garant auf keinen fall aber so steigt die"}, {"id": 1091, "start": 9685.76, "end": 9690.8, "text": "Wahrscheinlichkeit dass das positive bild dass wir von einer person haben auch auf ein produkt"}, {"id": 1092, "start": 9690.8, "end": 9696.56, "text": "abfärbt und so hat influencer marketing jahre lang bei der weil ich influenza euch jetzt alle"}, {"id": 1093, "start": 9696.56, "end": 9703.72, "text": "dass c++ die beschissenste programmier sprache ever ist und tut es auch immer noch für genügend"}, {"id": 1094, "start": 9703.72, "end": 9708.28, "text": "geld kann sich eine firma die hart erarbeitete glaubwürdigkeit eines influencers ausleihen"}, {"id": 1095, "start": 9708.28, "end": 9714.28, "text": "wobei dazu muss ich eigentlich kein influencer das ist ja offensichtlich in der stimme eines"}, {"id": 1096, "start": 9714.28, "end": 9718.8, "text": "sympathischen menschen sprechen lassen und da gibt es natürlich auch no goals die die influencer"}, {"id": 1097, "start": 9718.8, "end": 9725.08, "text": "nicht zulassen ich mache nur für das werbung was mich auch wirklich persönlich überzeugt ist ein"}, {"id": 1098, "start": 9725.08, "end": 9731.4, "text": "satz den man in den letzten jahren das ist er muss ich aber sagen deswegen mache ich auch so"}, {"id": 1099, "start": 9731.4, "end": 9739.96, "text": "wenige placements also wenn ich was mega kacke finde sage ich da nicht zu eins also negativ"}, {"id": 1100, "start": 9739.96, "end": 9746.28, "text": "erfahrung schlechthin war bettel viel 2042 ich war so gehyped auf das game und ich habe gesagt ja"}, {"id": 1101, "start": 9746.28, "end": 9752.44, "text": "wohl leute ich mache drei videos paid placement kein ding oder kam das spiel raus und war komplette"}, {"id": 1102, "start": 9752.44, "end": 9760.8, "text": "grütze platzierung unendlich oft gehört und ich mein bei dem einen video hat man ja nur leute bei"}, {"id": 1103, "start": 9760.8, "end": 9771.12, "text": "diesem video hat man richtig gemerkt dass ich keinen bock habe oder das war doch nicht mal"}, {"id": 1104, "start": 9771.12, "end": 9778.2, "text": "insgesamt das video hallo leute hier ist der max und heute wenn man sie anschießt sie haben auch"}, {"id": 1105, "start": 9778.2, "end": 9785.32, "text": "nicht diesen panzer platten pop mit diesem blauen hitmarker solltet ihr aber nicht diese"}, {"id": 1106, "start": 9785.32, "end": 9791.6, "text": "cheesy taktik spielen weil ich hatte so kein bock auf das video mann dabei ist das nicht ganz"}, {"id": 1107, "start": 9791.6, "end": 9797.8, "text": "richtig der ganze satz sollte er lauten ich suche mir von den anfragen die ich bekomme häufig das"}, {"id": 1108, "start": 9797.8, "end": 9806.28, "text": "geringste auch ich weiße werbeanfragen obwohl ich noch nie eine bezahlte produktion gemacht noch"}, {"id": 1109, "start": 9806.28, "end": 9813.16, "text": "auf irgendeine dieser anfragen jemals geantwortet habe aber ich habe sie archiviert über jahre ich"}, {"id": 1110, "start": 9813.16, "end": 9817.88, "text": "habe auch alles ich habe alles noch im archiv ich habe einen eimerb ordner den ich nicht aufräume"}, {"id": 1111, "start": 9817.88, "end": 9823.72, "text": "was kann man auch archiv nennen für ein gutes moralisch einwandfreies product placement ist"}, {"id": 1112, "start": 9823.72, "end": 9831.76, "text": "seltener als ein kompetenter verkehrsminister ja ich habe fünf sachen bekommen die letzten zwei"}, {"id": 1113, "start": 9831.76, "end": 9837.0, "text": "wochen ich habe beispielsweise in den letzten zwölf monaten genau 30 werbeanfragen für"}, {"id": 1114, "start": 9837.0, "end": 9843.32, "text": "produktplatzierung von insgesamt drei verschiedenen vpn anbietern bekommen das ist eine anfrage alle"}, {"id": 1115, "start": 9843.32, "end": 9848.88, "text": "zwölf tage obwohl ich nie geantwortet habe wer mal sehen will was für anfragen man so zum"}, {"id": 1116, "start": 9848.88, "end": 9854.12, "text": "großteil bekommt der kann sich dieses video von rob bubble angucken mit dieser wahrheit müssen"}, {"id": 1117, "start": 9854.12, "end": 9859.6, "text": "wir lernen zu leben produktplatzierung sind notwendig schon alleine weil youtube interne"}, {"id": 1118, "start": 9859.6, "end": 9864.16, "text": "monetarisierungsoptionen immer wieder von algorithmischer willkür geplagt sind aber"}, {"id": 1119, "start": 9864.16, "end": 9868.8, "text": "auch weil es leute gibt die sich scheinbar in monatelanger selbstisolation eine moralisch"}, {"id": 1120, "start": 9868.8, "end": 9874.88, "text": "einwandfreie legitimation dafür zurecht konstruiert haben ein blokker auf youtube zu nutzen und teil"}, {"id": 1121, "start": 9874.88, "end": 9879.04, "text": "eben dieser wahrheit ist es ehrlich gesagt chat mich juckt es überhaupt nicht ob ihr mich mit"}, {"id": 1122, "start": 9879.04, "end": 9885.12, "text": "youtube guckt oder nicht aber mich mit blokker auf youtube guckt oder nicht an guten produkt"}, {"id": 1123, "start": 9885.12, "end": 9891.16, "text": "platzierung der nachfrage nicht gerecht wird wer von youtube lebt schmerzhaft starke ausgaben für"}, {"id": 1124, "start": 9891.16, "end": 9896.2, "text": "jedes video hat und auf dessen neue inhalte ein begeistert ja ihr müsst mich alles haben ich"}, {"id": 1125, "start": 9896.2, "end": 9901.72, "text": "habe wirklich schmerzhaft hohe ausgaben pro video hat kaum einer wenn ich wenn ich keine subs kriege"}, {"id": 1126, "start": 9901.72, "end": 9908.4, "text": "sterbe ich ist in einer woche kommt der wandel der letzten monate zum vorschein das nicht über"}, {"id": 1127, "start": 9908.4, "end": 9913.44, "text": "die balancetheorie machen mir ist aufgefallen dass immer mehr deutsche wie auch englischsprachige"}, {"id": 1128, "start": 9913.44, "end": 9919.28, "text": "youtuber beginnen ihre produktplatzierung anders zu inszenieren da ist das eigentliche video der"}, {"id": 1129, "start": 9919.28, "end": 9923.8, "text": "grund warum man drauf geklickt hat und dann ist da dieses kürzere die werbung auf youtube ist"}, {"id": 1130, "start": 9923.8, "end": 9932.08, "text": "richtig ätzend gerade seit die fall settings ist dass man in video placements hat das ist"}, {"id": 1131, "start": 9932.08, "end": 9938.16, "text": "richtig ätzend drin dass immer weniger gemeinsamkeit alle zwei minuten irgendwas man kann es doch"}, {"id": 1132, "start": 9938.16, "end": 9944.4, "text": "gar nicht mehr gucken immer mehr leute legen sich eine rolle zurecht eine persona die für sie die"}, {"id": 1133, "start": 9944.4, "end": 9950.04, "text": "werbe briefings verliehen in einer woche ja ist mir auch gar aufgefallen das macht eigentlich"}, {"id": 1134, "start": 9950.04, "end": 9954.96, "text": "unser fertig mit der person hinter der rolle assoziieren nicht mehr zwangsläufig für die"}, {"id": 1135, "start": 9954.96, "end": 9960.36, "text": "bewertung von produkt x abgerufen wird weil person p ja jetzt als jemand anderes spricht"}, {"id": 1136, "start": 9960.36, "end": 9966.84, "text": "produkt x bekommt so nicht sofort einen unbewussten sympathie schub von uns funktioniert in beide"}, {"id": 1137, "start": 9966.84, "end": 9971.16, "text": "richtungen entweder mit total überzeichneten werbestimmen aller wussten sie schon dass sie"}, {"id": 1138, "start": 9971.16, "end": 9976.96, "text": "mit dem code gedanken fetisch 16 ein ganze 70 prozent rabatt bekommen oder im fall einiger"}, {"id": 1139, "start": 9976.96, "end": 9982.72, "text": "englischsprachige ich würde ich würde das einfach runter rattern das habe ich mir auch"}, {"id": 1140, "start": 9982.72, "end": 9986.6, "text": "schon überlegt ob ich nicht mehr produkt placements in dieser richtung mache ich mein anfragen gibt"}, {"id": 1141, "start": 9986.6, "end": 9992.6, "text": "es letztendlich eigentlich genug weil da sind ich ich sagte so weil es sind immer noch sachen dabei"}, {"id": 1142, "start": 9992.6, "end": 9998.0, "text": "dich nicht machen würde rate shadow legends habe ich wirklich gar keinen bock drauf sich sehe ich"}, {"id": 1143, "start": 9998.0, "end": 10002.32, "text": "nicht ein und vpn anbieter wollen ja immer nicht weil die dann sehen ich habe ein vpn"}, {"id": 1144, "start": 10002.32, "end": 10008.72, "text": "kritisches video gemacht aber ansonsten es gibt ja noch normales zeug da würde ich dann einfach"}, {"id": 1145, "start": 10008.72, "end": 10014.52, "text": "irgendwas runter rattern super nüchtern vorgelesen der infotext egal wie man es macht die grenzen"}, {"id": 1146, "start": 10014.52, "end": 10020.44, "text": "zum rest des videos werden stärker influencer marketing ähnelt so mehr red shadow legends"}, {"id": 1147, "start": 10020.44, "end": 10025.64, "text": "mag ich nicht das war ich nicht die man sich einfach für sein produkt kaufen kann auch wenn"}, {"id": 1148, "start": 10025.64, "end": 10030.76, "text": "die entscheidung das zu tun vielleicht bei einigen eher aus selbstschutz getroffen wurde so klammert"}, {"id": 1149, "start": 10030.76, "end": 10035.92, "text": "diese methode trotzdem die balanstheorie zu einem mich juckt und wird so für die habe ich keinen"}, {"id": 1150, "start": 10035.92, "end": 10041.04, "text": "bock nützlichen spagat auf der einen seite hat man die kosten gedeckt und bekommt geld für das was"}, {"id": 1151, "start": 10041.04, "end": 10046.44, "text": "man tut auf der anderen seite hat man aber den schaden die man damit eventuell anrichtet verringert"}, {"id": 1152, "start": 10046.44, "end": 10052.04, "text": "das wie ich finde faszinierendste beispiel für diese entwicklung ist tom scott der wie im"}, {"id": 1153, "start": 10052.04, "end": 10057.08, "text": "letzten video bereits erwähnt vor etwa zwei jahren eine fantastische demontage der falschen"}, {"id": 1154, "start": 10057.08, "end": 10063.64, "text": "werbeversprechen von vpn anbietern veröffentlicht hat und vor etwas über einem monat einen robotter"}, {"id": 1155, "start": 10063.64, "end": 10070.76, "text": "der nach ihm modelliert wurde genutzt hat um an seiner stelle für vpn werben zu können ich"}, {"id": 1156, "start": 10070.76, "end": 10075.52, "text": "beschwere mich nicht wenn ich produktplatzierung bei anderen sehe manchmal stimme ich nicht mit"}, {"id": 1157, "start": 10075.52, "end": 10081.0, "text": "ihnen überein ob das gewählte produkt wirklich das kleinste übel war aber ich kenne die andere"}, {"id": 1158, "start": 10081.0, "end": 10087.12, "text": "seite ich kenne das brachland entweder und durchsichtige versicherungs apps glücksspieltutorials"}, {"id": 1159, "start": 10087.12, "end": 10094.32, "text": "fürs handy vpn oder gaming booster es ist wirklich nicht leicht deswegen wäre auch immer sich diese"}, {"id": 1160, "start": 10094.32, "end": 10100.92, "text": "form der produkte gaming booster weiß nicht auch so ein ding ich glaube das ist die zukunft es"}, {"id": 1161, "start": 10100.92, "end": 10110.98, "text": "gibt ja gaming booster mittlerweile schon in pillenform das ok also wir haben fertig resized ok wir"}, {"id": 1162, "start": 10110.98, "end": 10119.92, "text": "haben resize von 128 130 g alles klar so ok starten so und jetzt gucken wir mal ob das so"}, {"id": 1163, "start": 10119.92, "end": 10124.52, "text": "funktioniert wie ich mir das gedacht habe oder ob ich die hälfte vergessen habe hau ma ma"}, {"id": 1164, "start": 10124.52, "end": 10144.2, "text": "einloggen warten bis es gestartet ist airfox aufmachen terminal aufmachen so schauen wir mal"}, {"id": 1165, "start": 10144.2, "end": 10149.4, "text": "die f-h was haben wir da zu bieten 125 g das sollten gleich zwei gigabyte mehr sein wenn"}, {"id": 1166, "start": 10149.4, "end": 10157.16, "text": "alles von was wollen die von mir wenn alles funktioniert also war das nicht resize fs"}, {"id": 1167, "start": 10157.16, "end": 10166.64, "text": "resize 2 fs slash nope is a directory while opening bin ich ging das anders musste man das"}, {"id": 1168, "start": 10166.64, "end": 10175.24, "text": "irgendwie aufs device machen nothing to do ok ich habe nichts gesagt man muss anscheinend doch"}, {"id": 1169, "start": 10175.24, "end": 10184.8, "text": "gepartet starten und das ding resize tatsächlich guck mal man muss den kram resize na dann dann"}, {"id": 1170, "start": 10184.8, "end": 10192.2, "text": "gepartet starten und einmal resize resize zack resize"}, {"id": 1171, "start": 10192.2, "end": 10202.72, "text": "ne resize 2 fs ist was anderes"}, {"id": 1172, "start": 10202.72, "end": 10208.36, "text": "resize 2 fs hat nicht funktioniert"}, {"id": 1173, "start": 10208.36, "end": 10213.44, "text": "warum eigentlich nicht"}, {"id": 1174, "start": 10213.44, "end": 10233.72, "text": "ach gepartet macht das alles in einem oder alles alles in einmal ja gut damit"}, {"id": 1175, "start": 10233.72, "end": 10239.52, "text": "fx partition löschen ne ne das muss wie macht man das das ist schon eine weile her wo ich das"}, {"id": 1176, "start": 10239.52, "end": 10246.4, "text": "gemacht habe also wie gesagt resize fs kenne ich aber das klappt nur wenn die partitions tabelle"}, {"id": 1177, "start": 10246.4, "end": 10253.76, "text": "schon also wenn die partition drunter größer ist noch platz fürs für für das device bietet"}, {"id": 1178, "start": 10253.76, "end": 10263.16, "text": "sisse das hätte ich da hätte ich jetzt auch gar nicht dran gedacht dass man das ja noch machen"}, {"id": 1179, "start": 10263.16, "end": 10275.88, "text": "muss nee man muss es nicht vom usb-stick bundeskam am laufenden komm mal hier da wir lassen uns"}, {"id": 1180, "start": 10275.88, "end": 10280.08, "text": "das mal vor vorn wir lassen uns das immer erklären von fremder wie das funktioniert"}, {"id": 1181, "start": 10280.08, "end": 10286.12, "text": "ja im moment dass das funktioniert mit lvm drunter ist mir auch klar"}, {"id": 1182, "start": 10286.12, "end": 10293.08, "text": "nee resize 2 fs ist live"}, {"id": 1183, "start": 10293.08, "end": 10312.6, "text": "kroppart was ist das kroppart was es nicht alles gibt habe ich habe ich noch nie gesehen"}, {"id": 1184, "start": 10312.6, "end": 10320.28, "text": "kroppart nein das installiere ich nicht das installiere ich nicht guck mal zwei"}, {"id": 1185, "start": 10320.28, "end": 10324.72, "text": "sterne und nichts das kann man doch bestimmt auch mit mit mit mit mit mit mit fdisk machen"}, {"id": 1186, "start": 10324.72, "end": 10336.8, "text": "oder kroppartition linux also ich würde es mit gepartet jetzt machen die machen auch lvm"}, {"id": 1187, "start": 10336.8, "end": 10344.12, "text": "ja im moment das ist mir zu risikoreich ich kenne das ich weiß dass es geht und wenn du"}, {"id": 1188, "start": 10344.12, "end": 10347.2, "text": "das an einem schritt machst passiert auch nichts gibt es ja nicht fertige tools für"}, {"id": 1189, "start": 10347.2, "end": 10374.36, "text": "kroppart ok wo bekommt man das her kroppart ubuntu wie installiert man das oder von was"}, {"id": 1190, "start": 10374.36, "end": 10383.92, "text": "ist das bestandteil cloud guest utils was gibt es das unter unter arch by the way nicht"}, {"id": 1191, "start": 10383.92, "end": 10390.2, "text": "ach hier guck mal ok das probieren aus wenn das ding jetzt verreckt habe ich gelitten"}, {"id": 1192, "start": 10390.2, "end": 10402.6, "text": "kroppart und dann da lernt man was ok def sda zack def sda 2"}, {"id": 1193, "start": 10402.6, "end": 10407.92, "text": "und jetzt"}, {"id": 1194, "start": 10407.92, "end": 10414.2, "text": "eins eins muss man angeben und dann"}, {"id": 1195, "start": 10414.2, "end": 10421.44, "text": "ach so resize partition 1 und es ach nee so muss man machen"}, {"id": 1196, "start": 10421.44, "end": 10440.84, "text": "so muss man machen resize partition 2 und ok und jetzt resize 2 fs def sda 2 easy und"}, {"id": 1197, "start": 10440.84, "end": 10450.4, "text": "jetzt haben wir 2 gigabyte mehr als vorher das kannte ich tatsächlich noch nicht kroppart"}, {"id": 1198, "start": 10450.4, "end": 10457.52, "text": "es ist mir lieber als mit fdisk partitions tabelle löschen und anlegen und du siehst"}, {"id": 1199, "start": 10457.52, "end": 10466.4, "text": "du musst nix flaschen oder sonst was es funktioniert einfach so leute wir sind hier stehen geblieben"}, {"id": 1200, "start": 10466.4, "end": 10467.52, "text": "beim epg champ"}, {"id": 1201, "start": 10467.52, "end": 10472.68, "text": "den wir nicht root add"}, {"id": 1202, "start": 10472.68, "end": 10479.84, "text": "gepadet ist definitiv einfacher aber man will es vielleicht nicht machen mit dem gui"}, {"id": 1203, "start": 10479.84, "end": 10482.44, "text": "das geht bei dir nicht warum geht das nicht"}, {"id": 1204, "start": 10482.44, "end": 10497.64, "text": "ah deine partition ist da vor da müsstest du die vorher irgendwie relocaten oder so"}, {"id": 1205, "start": 10497.64, "end": 10500.32, "text": "in gepadet ja dann weiß ich auch nicht"}, {"id": 1206, "start": 10500.32, "end": 10510.32, "text": "ah du kannst den gepadet doch die pallet nee dann fällt mir aus dem kopf jetzt nix ein"}, {"id": 1207, "start": 10510.32, "end": 10513.8, "text": "ich sehe den screenshot jaja"}, {"id": 1208, "start": 10513.8, "end": 10516.52, "text": "da müsstest du lass mal kurz überlegen"}, {"id": 1209, "start": 10516.52, "end": 10522.32, "text": "ah ok du hast die platte du vor dem swap erlöscht den swap doch einfach"}, {"id": 1210, "start": 10522.32, "end": 10536.48, "text": "löscht den swap das wärs einfach so oder swap löschen"}, {"id": 1211, "start": 10536.48, "end": 10544.32, "text": "swap aushängen und swap löschen"}, {"id": 1212, "start": 10544.32, "end": 10549.24, "text": "dann expandest du deine x4 das geht dann bestimmt auch in gepadet"}, {"id": 1213, "start": 10549.24, "end": 10555.56, "text": "dann expandest du die und machst den swap hinten dran neu"}, {"id": 1214, "start": 10555.56, "end": 10559.76, "text": "du lässt einfach 8 gigabyte frei beim resize und machst da drinnen dann"}, {"id": 1215, "start": 10559.76, "end": 10563.56, "text": "oder du nimmst ein swap file da brauchst du nämlich gar keine richtig da brauchst du"}, {"id": 1216, "start": 10563.56, "end": 10566.44, "text": "nämlich gar keine swap partition"}, {"id": 1217, "start": 10566.44, "end": 10571.88, "text": "oder du machst wie ich du machst gar keinen swap"}, {"id": 1218, "start": 10571.88, "end": 10574.2, "text": "einfach 16 g ram rein und gut es braucht kein swap"}, {"id": 1219, "start": 10574.2, "end": 10588.64, "text": "so also epg champ bild"}, {"id": 1220, "start": 10588.64, "end": 10592.28, "text": "nummer so zum beweis so sieht es aktuell aus und so läuft es auf meinem linux receiver"}, {"id": 1221, "start": 10592.28, "end": 10604.52, "text": "5.000 nee was ah nee"}, {"id": 1222, "start": 10604.52, "end": 10609.2, "text": "ttp doppelpunkts sternchen punkt 4.500 back-end"}, {"id": 1223, "start": 10609.2, "end": 10618.92, "text": "so also so sieht es aus aktuell"}, {"id": 1224, "start": 10618.92, "end": 10628.36, "text": "der epg champ ist am start und man kann sachen aufnehmen"}, {"id": 1225, "start": 10628.36, "end": 10634.2, "text": "haben die alle keine besch... haben die alle keine beschreibung"}, {"id": 1226, "start": 10634.2, "end": 10639.24, "text": "oder ist da was kaputt chat warum haben die alle keine beschreibung"}, {"id": 1227, "start": 10639.24, "end": 10646.96, "text": "habe ich die habe ich die beschreibung oh ich glaube ich habe die ich"}, {"id": 1228, "start": 10646.96, "end": 10648.88, "text": "glaube ich habe die beschreibung kaputt gemacht"}, {"id": 1229, "start": 10648.88, "end": 10659.84, "text": "da ist selbst was kaputt aber nicht schlimm aber der rest funktioniert"}, {"id": 1230, "start": 10659.84, "end": 10660.84, "text": "ich habe nee"}, {"id": 1231, "start": 10660.84, "end": 10671.64, "text": "haben die haben die dinge alle keine beschreibung"}, {"id": 1232, "start": 10671.64, "end": 10677.28, "text": "das kann doch nicht sein oder"}, {"id": 1233, "start": 10677.28, "end": 10694.12, "text": "monkaS zu weit in der zukunft nee"}, {"id": 1234, "start": 10694.12, "end": 10696.64, "text": "das die haben doch normalerweise beschreibung hier"}, {"id": 1235, "start": 10696.64, "end": 10697.64, "text": "nee die haben geht"}, {"id": 1236, "start": 10697.64, "end": 10703.12, "text": "war das kann es sein dass es einfach noch nicht geladen war"}, {"id": 1237, "start": 10703.12, "end": 10717.24, "text": "so gut"}, {"id": 1238, "start": 10717.24, "end": 10719.32, "text": "das ist sogar ausgesprochen schnell"}, {"id": 1239, "start": 10719.32, "end": 10729.8, "text": "gut wunderbar das funktioniert"}, {"id": 1240, "start": 10729.8, "end": 10734.4, "text": "achso ich war gerade zu weit in der zukunft da gab es noch gar keine"}, {"id": 1241, "start": 10734.4, "end": 10740.52, "text": "ja das mit dem sendernamen das mache ich jetzt aber nicht"}, {"id": 1242, "start": 10740.52, "end": 10743.6, "text": "das mache ich jetzt also ihr seht ihr seht es funktioniert"}, {"id": 1243, "start": 10743.6, "end": 10747.12, "text": "es funktioniert auch hier drauf das ist interessant finde ich gut es ging"}, {"id": 1244, "start": 10747.12, "end": 10751.44, "text": "einfach instant auf dem linux receiver mit uralt kernel aber es ist nice"}, {"id": 1245, "start": 10751.44, "end": 10762.8, "text": "so was wir jetzt noch machen ist folgendes epg-stern git status"}, {"id": 1246, "start": 10762.8, "end": 10763.8, "text": "backends"}, {"id": 1247, "start": 10763.8, "end": 10778.88, "text": "ich push das ganze jetzt nochmal dass man sich das ganze auf"}, {"id": 1248, "start": 10778.88, "end": 10780.04, "text": "shithub angucken können"}, {"id": 1249, "start": 10780.04, "end": 10787.08, "text": "nice wäre auch wenn sendungen die man früher schon einmal aufgenommen hat gekennzeichnet"}, {"id": 1250, "start": 10787.08, "end": 10788.08, "text": "werden"}, {"id": 1251, "start": 10788.08, "end": 10789.08, "text": "sehr gute idee"}, {"id": 1252, "start": 10789.08, "end": 10795.4, "text": "es gibt sogar eine funktion für"}, {"id": 1253, "start": 10795.4, "end": 10796.4, "text": "serien oder sowas"}, {"id": 1254, "start": 10796.4, "end": 10799.68, "text": "die man früher schon aufgenommen hat"}, {"id": 1255, "start": 10799.68, "end": 10804.48, "text": "ja aber hauptsache das tut jetzt erstmal"}, {"id": 1256, "start": 10804.48, "end": 10812.28, "text": "also sagen wir jetzt mal hier git add git commit minus m minus a"}, {"id": 1257, "start": 10812.28, "end": 10813.4, "text": "was haben wir heute gemacht"}, {"id": 1258, "start": 10813.4, "end": 10821.6, "text": "ja das ist über kabelanschluss mit einem achtfach tuner"}, {"id": 1259, "start": 10821.6, "end": 10822.84, "text": "jetzt dank der neuen box"}, {"id": 1260, "start": 10822.84, "end": 10827.48, "text": "was haben wir denn heute gemacht wie kann man das zusammenfassen"}, {"id": 1261, "start": 10827.48, "end": 10828.48, "text": "wir haben heute"}, {"id": 1262, "start": 10828.48, "end": 10833.2, "text": "commit messages ist das schlimmste überhaupt"}, {"id": 1263, "start": 10833.2, "end": 10839.8, "text": "wir haben gbaited"}, {"id": 1264, "start": 10839.8, "end": 10844.12, "text": "small changes monocommit klar ich mach doch jetzt nicht für den ganzen greppel was"}, {"id": 1265, "start": 10844.12, "end": 10847.72, "text": "small small changes"}, {"id": 1266, "start": 10847.72, "end": 10851.08, "text": "so push nicht force und auch nicht"}, {"id": 1267, "start": 10851.08, "end": 10852.08, "text": "so"}, {"id": 1268, "start": 10852.08, "end": 10853.08, "text": "gut"}, {"id": 1269, "start": 10853.08, "end": 10860.76, "text": "dann können wir hier mal kurz gucken"}, {"id": 1270, "start": 10860.76, "end": 10861.76, "text": "wo bloß"}, {"id": 1271, "start": 10861.76, "end": 10864.76, "text": "epg champ"}, {"id": 1272, "start": 10864.76, "end": 10871.6, "text": "hast du da unten im terminal auch noch mal tabs ja"}, {"id": 1273, "start": 10871.6, "end": 10874.68, "text": "habe ich nur fürs terminal"}, {"id": 1274, "start": 10874.68, "end": 10875.68, "text": "small changes"}, {"id": 1275, "start": 10875.68, "end": 10879.32, "text": "so wunderbar"}, {"id": 1276, "start": 10879.32, "end": 10882.56, "text": "gestern wollte mich einer gbaiten in den issues guckt mal"}, {"id": 1277, "start": 10882.56, "end": 10883.56, "text": "funktioniert nicht"}, {"id": 1278, "start": 10883.56, "end": 10887.92, "text": "und dann klickst du auf das video wo es nicht funktioniert"}, {"id": 1279, "start": 10887.92, "end": 10912.32, "text": "so gepusht"}, {"id": 1280, "start": 10912.32, "end": 10924.16, "text": "haben wir noch einen neuen screenshot machen"}, {"id": 1281, "start": 10924.16, "end": 10925.56, "text": "das läuft noch wollte gerade sagen"}, {"id": 1282, "start": 10925.56, "end": 10942.72, "text": "lull es kann nicht mehr laufen aber noch einen neuen screenshot"}, {"id": 1283, "start": 10942.72, "end": 10957.24, "text": "erstmal mit dem seriösen cac w bild unten links in der ecke"}, {"id": 1284, "start": 10957.24, "end": 10974.64, "text": "jetzt machen wir das was man wo ich sache auf der arbeit immer macht es auf gar keinen"}, {"id": 1285, "start": 10974.64, "end": 10975.64, "text": "fall"}, {"id": 1286, "start": 10975.64, "end": 10980.56, "text": "aber sehr egal das repo checkte er außer mir keiner aus"}, {"id": 1287, "start": 10980.56, "end": 10988.24, "text": "jetzt haben wir noch einen screenshot"}, {"id": 1288, "start": 10988.24, "end": 10992.88, "text": "dieser github cache macht mich hart fertig oder"}, {"id": 1289, "start": 10992.88, "end": 10994.44, "text": "der github webserver cache man"}, {"id": 1290, "start": 10994.44, "end": 11016.88, "text": "er hat es immer noch nicht gecheckt dass der screenshot geupdatet wurde"}, {"id": 1291, "start": 11016.88, "end": 11032.76, "text": "das ist egal eine ritme hat sich auch nichts geändert"}, {"id": 1292, "start": 11032.76, "end": 11036.6, "text": "hatten wir gestern auch liegt nicht am force pushen"}, {"id": 1293, "start": 11036.6, "end": 11043.44, "text": "die ritme hat sich auch nicht geändert nur das screenshot fall das braucht jetzt ein"}, {"id": 1294, "start": 11043.44, "end": 11044.44, "text": "bisschen"}, {"id": 1295, "start": 11044.44, "end": 11049.04, "text": "nee das ist der github das ist nicht mehr der browser cache"}, {"id": 1296, "start": 11049.04, "end": 11053.0, "text": "das ist der github webseiten der webserver cache der guckt irgendwie ob es schon verbindung"}, {"id": 1297, "start": 11053.0, "end": 11054.0, "text": "zu einem hat und dann"}, {"id": 1298, "start": 11054.0, "end": 11062.4, "text": "kannst du irgendwie eine example arpi response jason zum projekt hinzufügen sonst kann man"}, {"id": 1299, "start": 11062.4, "end": 11064.08, "text": "ohne tv nicht mitentwickeln"}, {"id": 1300, "start": 11064.08, "end": 11068.72, "text": "du meinst mir das frontend"}, {"id": 1301, "start": 11068.72, "end": 11078.24, "text": "das frontend also das frontend geht ja gegen mein backend das hat ja mit tv hat ja nichts"}, {"id": 1302, "start": 11078.24, "end": 11079.24, "text": "zu tun"}, {"id": 1303, "start": 11079.24, "end": 11081.68, "text": "also von tv her gibt es halt diese arpi dock hier"}, {"id": 1304, "start": 11081.68, "end": 11085.56, "text": "aber für meinst wisst ihr was wir machen können"}, {"id": 1305, "start": 11085.56, "end": 11090.4, "text": "wisst ihr was wir machen können wir können ein feature verwenden"}, {"id": 1306, "start": 11090.4, "end": 11100.64, "text": "wir können eine swagger dock generieren lassen"}, {"id": 1307, "start": 11100.64, "end": 11105.04, "text": "schwäger"}, {"id": 1308, "start": 11105.04, "end": 11115.48, "text": "das machen wir jetzt das geht ganz zackig das haben die mittlerweile eingebaut"}, {"id": 1309, "start": 11115.48, "end": 11122.88, "text": "und zwar"}, {"id": 1310, "start": 11122.88, "end": 11123.88, "text": "wie ging das jetzt noch mal"}, {"id": 1311, "start": 11123.88, "end": 11126.8, "text": "dot net core"}, {"id": 1312, "start": 11126.8, "end": 11127.8, "text": "schwäger"}, {"id": 1313, "start": 11127.8, "end": 11141.88, "text": "just das da"}, {"id": 1314, "start": 11141.88, "end": 11147.72, "text": "muss man da irgendwas hinzufügen oder wie"}, {"id": 1315, "start": 11147.72, "end": 11151.12, "text": "das ging doch total easy"}, {"id": 1316, "start": 11151.12, "end": 11156.36, "text": "das waren zwei zeilen letztendlich"}, {"id": 1317, "start": 11156.36, "end": 11159.24, "text": "oder ist das jetzt ausgelagert wird das nicht mehr mitgebracht"}, {"id": 1318, "start": 11159.24, "end": 11167.4, "text": "anscheinend nicht"}, {"id": 1319, "start": 11167.4, "end": 11168.4, "text": "anscheinend nicht"}, {"id": 1320, "start": 11168.4, "end": 11169.4, "text": "build services"}, {"id": 1321, "start": 11169.4, "end": 11175.16, "text": "anscheinend wird es nicht mehr mitgebracht ok"}, {"id": 1322, "start": 11175.16, "end": 11176.16, "text": "tatsächlich"}, {"id": 1323, "start": 11176.16, "end": 11180.44, "text": "ok was muss ich installieren"}, {"id": 1324, "start": 11180.44, "end": 11203.0, "text": "das da"}, {"id": 1325, "start": 11203.0, "end": 11204.0, "text": "schwäger"}, {"id": 1326, "start": 11204.0, "end": 11210.76, "text": "so und jetzt"}, {"id": 1327, "start": 11210.76, "end": 11212.48, "text": "wenn ich das jetzt starte dann habe ich"}, {"id": 1328, "start": 11212.48, "end": 11221.0, "text": "also serious bugs wenn du mitmachen willst wäre natürlich äußerst pock weil du hast"}, {"id": 1329, "start": 11221.0, "end": 11222.76, "text": "von frontend sachen deutlich mehr ahnung als ich"}, {"id": 1330, "start": 11222.76, "end": 11241.84, "text": "ich habe nichts gesagt es ist anscheinend doch nicht so einfach mit"}, {"id": 1331, "start": 11241.84, "end": 11264.16, "text": "dem minimal api ok dann weiß ich nicht wie es funktioniert"}, {"id": 1332, "start": 11264.16, "end": 11269.72, "text": "dann bin ich äußerst planlos wie das funktioniert das mache ich das nächste mal ich esse jetzt"}, {"id": 1333, "start": 11269.72, "end": 11273.84, "text": "was minimal api schwäger"}, {"id": 1334, "start": 11273.84, "end": 11288.28, "text": "jaja"}, {"id": 1335, "start": 11288.28, "end": 11289.64, "text": "ach nee was muss man noch machen"}, {"id": 1336, "start": 11289.64, "end": 11300.6, "text": "alles klar das machen wir gleich ganz hier oben"}, {"id": 1337, "start": 11300.6, "end": 11312.88, "text": "ja und wo ist jetzt das problem"}, {"id": 1338, "start": 11312.88, "end": 11323.92, "text": "ach jetzt geht es oder was und jetzt local host 4500 slash und dann äh worunter ist es"}, {"id": 1339, "start": 11323.92, "end": 11324.92, "text": "jetzt verfügbar"}, {"id": 1340, "start": 11324.92, "end": 11329.92, "text": "schwäger"}, {"id": 1341, "start": 11329.92, "end": 11343.32, "text": "aha guck mal mit mit api docs das ist tatsächlich ganz cool"}, {"id": 1342, "start": 11343.32, "end": 11363.92, "text": "guck mal der zeigt dir sogar was der zurückschickt dann"}, {"id": 1343, "start": 11363.92, "end": 11380.68, "text": "ist ja der guter gibts ein image zurück response true oder false ja"}, {"id": 1344, "start": 11380.68, "end": 11400.64, "text": "das ist cool nice production ready so machen wir noch jetzt komm mit api docs push ja also"}, {"id": 1345, "start": 11400.64, "end": 11410.64, "text": "falls du dich ein bisschen mehr austoben willst jetzt kann man sich das sogar angucken"}, {"id": 1346, "start": 11410.64, "end": 11414.2, "text": "ist klar heute jetzt gehe ich wirklich was essen ich hab hunger ich hab jetzt ja heute"}, {"id": 1347, "start": 11414.2, "end": 11418.88, "text": "wirklich ganz schön ganz schön lange gestriemsel ich weiß nicht wie das manche leute schaffen"}, {"id": 1348, "start": 11418.88, "end": 11423.52, "text": "ehrlich gesagt ich mein ich war heute online"}, {"id": 1349, "start": 11423.52, "end": 11430.6, "text": "warum ist dieses warum ist die twitch seite eigentlich so pains champ mittlerweile zu bedienen"}, {"id": 1350, "start": 11430.6, "end": 11443.76, "text": "guck mal ich war drei stunden sechs stunden das reicht jetzt genug genug"}, {"id": 1351, "start": 11443.76, "end": 11461.04, "text": "wir sehen uns alles gut bis denn see you"}]}