{"text": "Okay, das war jetzt keine DDoS Action wie das letzte Mal, das war jetzt wirklich Vodafone. Das, das Kabelmodem hat sich einfach desyncht gerade. Chat ist RIP, ja gut was soll ich machen ne? Chat ist RIP, aber warte mal vielleicht krieg ich den Chat wieder zum Laufen, wenn ich das einen ausblende. Vielleicht, vielleicht connectet er sich gleich wieder. Mal gucken, mal gucken. Also das war auf jeden Fall jetzt kein, kein DDoS. Gut, habe ich meine IP irgendwo geleakt Leute? Hab ich meine, habe ich, habe ich wieder eine IP, Big IP Leak gemacht? Nee, habe ich nicht oder? Oh sopper, jetzt, jetzt habe ich es, jetzt habe ich es aber geleakt, super, ganz, ganz grandios. Hat ja wunderbar funktioniert. Schön von Frankfurt bis Düsseldorf eine Störung. Ja wir gucken mal kurz Twitter, ob es da irgendwelche Vodafone geschenkt, weil das, das sah nicht nach, das sah nicht aus nach irgendwelchen DDoS Geschichten, sondern ganz normal nach Vodafone, weil Kabelmodem desyncht und sowas. Ah ja guck mal, alle Störungen. Wow, ok RIP. Vodafone, RIP. Wenn man nach Vodafone sucht ist hier. Guck mal, ist irgendwas mit Vodafone gerade? Ich und mein Mate Disconnecten ein gleichzeitig. Tja, ok, das wie gesagt war auch meine Vermutung es lag an Vodafone. Vielleicht, vielleicht passiert denen ja gerade das gleiche wie der Telekom, was ich gerade erzählt habe. Ne, das kann nicht sein, dann würde es nicht so schnell wieder gehen, aber das wärs jetzt. Ja gut, was mache ich mit dem Chat jetzt? Der Chat ist jetzt, der Chat ist jetzt broken. Kann man hier refreshen? Refresh Browser When Scene Becomes Active, jawoll. Ah, Chat, wir sind back. Chat back. So, ok, wo sind wir denn jetzt stehen geblieben, nachdem Vodafone einfach desyncht hat? Ganz vergessen. Ja, irgendwo, irgendwo hier. Wenn den Trick die China-Chinesen erfahren. Ja, das ist glaube ich gar nicht aktuell so das Problem. Ich weiß nämlich nicht inwieweit BGP technisch den Reisschamp ist noch da. Ja, das lag eben an Vodafone, als ich hingekommen bin. Das war das war abkacken mit Ansage. Hier ist der Link. Ok, schenke ich dir gleich. Ich weiß nicht, wie hoch so das Vertrauen in chinesische Provider ist BGP technisch. Keine Ahnung, ob das ein größeres Problem ist. Aber ja, die China-Chinesen sollten vielleicht auch nicht Missed Announcen. Oh ja, ganz großes Default Bild hier gewesen. Also, ab 1. August erhöhnt sich der Preis für neu erstellte Floating IPs. Ok, das dachte ich mir. Ach, für neu erstellte Cloud-Surfer wie unten angegeben. Das ist aber teuer. Ja, ok. Was heißt teuer? Aber teurer. Es ist teuer, doch das ist echt teuer. Insgesamt geht das immer noch klar, aber das ist schon ganz ordentlich teuer. Teurer, ja. Wann kommt das nächste Tipp-Video für angehende Anzug? Ich versuche das irgendwann am Wochenende noch zu machen. Aber vorzuschieben, weil ich weiß, dass für viele erst der erste bzw. der zweite achte Arbeitstag ist. Erster Arbeitstag ist. Preise für Server erhöhen sich. Na, Preise für Server erhöhen sich hauptsächlich wegen der IP-Adresse, oder? Weil die immer mehr Probleme bekommen, IPv4-Adressen zu bekommen. Leute, ich verstehe es bis heute nicht, ne? Wir haben einen auf der Arbeit, der hat früher beim Denik gearbeitet. Und er hatte noch ein persönliches, ich sage jetzt einfach mal, ich bin mir ehrlich gesagt nicht sicher, was er hatte. Ich glaube, der hatte noch ein persönliches Slash-12-Netz von seiner Arbeit da. Und was heißt persönliches? Der hatte quasi noch, war Besitzer eines IPv4-Slash-12. Was der hätte damit für Kohle machen können? Der hat es aber einfach, stellt euch mal vor, selbstlos wie er ist, er hat das einfach zurückgegeben, hat gesagt, macht mal damit. Der hätte es nicht zurückgeben sollen, der hätte erstmal Big Stonks damit machen sollen. Aber wollte nicht, er hat es einfach zurückgegeben. Ich weiß nicht, ob es ein Slash-12 war, vielleicht war es auch nur ein Slash-20. Was heißt nur? Nur ein Slash-20. Aber es war ordentlich auf jeden Fall. Na gut, dann wird es halt ein bisschen teurer. Warum verifizieren, das ist eine gute Frage, warum verifizieren die andere Router nicht, mit welchem Präfix? Was? Nicht, mit welchen Präfix? Tja, das sieht BGP so nicht direkt vor. Es gibt wohl Alternifizierungsmechanismen, die aber so gut wie niemand verwendet aktuell. Und da muss man wahrscheinlich extern irgendwas skrippen und basteln. Aber Microsoft macht das nicht. Oder haben das nicht gemacht. Das wirft nicht unbedingt ein gutes Licht auf die Netzwerkadmins von Microsoft. Das kann man machen, hat haben sie aber nicht gemacht. BGP kann man im Packet Tracer simulieren. Gibt es in Packet Tracer noch kostenlos? Früher konnte man sich Packet Tracer installieren. Das richtig cooles Tool für Netzwerksachen zum Üben. Download Packet Tracer. Oder braucht man da, oder braucht man da irgendeinen Account für? Probier das jetzt einfach mal aus zu installieren. 7-7-3-8-0. Dann installieren wir den neuesten Packet Tracer. Du brauchst ein Cisco Login und ein Cisco Login kriegt man nicht kostenlos wahrscheinlich, oder? Hast du noch die Website? Ja, hier, Preischamp. Aber wie gesagt, so aktuell mit Grafikkarten ist das nicht. Die, die drin sind, sind aktuell, aber die anderen nicht wirklich. Ok, ich teste jetzt mal, ob man da ein Cisco Login für brauche. Testen wir jetzt mal. Ah, nice, sehr gut, easy, GG. Lass mal updaten, vielleicht bringt das was. Ok, ich lass ihn mal nehmen bei updaten. Du musst glaube ich nur Student sein. Kann man das Cisco irgendwie faken, dass man Student ist? Kann man sich da anmelden und sagen, ich bin Student, ohne dass sie das überprüfen? Frag einfach den Sebaro, der kann sich da anmelden als Student. Ja, das wird schon irgendwie klappen. Das kann durchaus sein, dass er das machen wollte, ja. Ich gehe auch mal davon aus, es war irgendein Tippfehler. Ja, das macht nix. Ich muss nur, wie sagt man so schön, so ahead of the curve oder wie das heißt sein. Dann macht mir das nix. Ich muss immer der Erste sein, der mehr bekommt, dann ist es egal. Dann bekomme ich immer mehr. Stonks, genau. Ja, das ist letztendlich so. Du hast schon recht, also ich gehe auch nicht davon aus, dass IPv4 jemals, zumindest nicht zu meinen Lebzeiten abgeschaltet wird, aber ich gehe nicht davon aus, dass ich zu meinen Lebzeiten noch erlebe, dass IPv4 so unwichtig ist, bzw. dass es komplett problemlos mit IPv6 alles, was man so machen will, läuft. Irgendwie sehe ich es einfach nicht. Das hätte schon die letzten zehn Jahre über passieren müssen und ist es nicht. Ja, feels cozy man. Das wäre natürlich cool, wobei, ja gut, du bekommst eine IPv6 Adresse, das stimmt, aber du kannst IPv4 wahrscheinlich nicht abhaken. Apple Mobile Apps müssen IPv6 auch nicht funktionieren. Das kann ja sein, aber das bringt dir nix, wenn du eine Webseite aufmachen willst, die nicht IPv6 angebunden ist. Ja, es sind theoretisch alle IPv4 Adressen schon vergeben, aber es gibt einen reigen Handel mit IPv4 Adressen. Also man kann noch IPv4 Adressen bekommen. Das ist dann eventuell teilweise auch ein bisschen halboffiziell, aber das geht und das machen auch viele noch. Was sagt ihr zu dem Emote? Brauchen wir das? Das kann man aber noch ein bisschen verschönern, oder? Ist das so? Ja komm, wir machen das jetzt rein. Bettge. Das geht besser, finde ich auch. Das kann man noch ein bisschen schöner machen. Ich finde das sehr gut, das Emote, aber ich glaube das können wir noch ein bisschen schöner machen. Das der lacht finde ich schon mal gut. Aber ich mache es vorläufig rein. Ich speichere mir das mal. Wie nennen wir das? Wupp Bett. Ich mache das schon vorläufig rein am Steam. So, ich wollte jetzt gucken ob ich den Packet Tracer installiert kriege. Packet Tracer. Und wie man sich da anmelden kann? Nö, gibt's nicht. Okay. Ups. Also den gibt's nicht immer zum installieren. Dann installieren wir jetzt einfach was Altes, was es wahrscheinlich noch gibt. Den da. 6, 2. Bam. Yes. No. Okay, da muss ich mal gucken. Zumindest das Packet Tracer wäre eine coole Sache um das mal auszuprobieren. Bin ich beruhigt. Wie gesagt, ich gucke, dass ich das am Wochenende hochgeladen kriege. Das wird in nächster Zeit schwierig. Also es wird ja immer besser bei Grafikkarten oder wurde jetzt besser, aber die ganze Knappheit macht halt alles saumäßig toll. Bei uns auf der Arbeit ist es bei The Way mittlerweile schon so schlimm. Flashbang, Alter. Bei uns auf der Arbeit ist es mittlerweile schon so schlimm, dass die gar keine neuen Notebooks mehr bekommen für die Mitarbeiter. Die versuchen neue Notebooks zu kaufen und kriegen keine. Dass die China-Chinesen H2-IPv6 pushen, wundert mich nicht. Die sind ja late bei der Party gewesen. Das heißt, die kriegen umso schwieriger IPv4. Hast du das Projekt? Ja, das kenne ich schon. Hat mich jetzt aber nicht so überzeugt, weil es ein ziemliches Gebastel ist. Ich hab mir eine billige KVM und eine billige Remote. Wie nennt man das? Das ist ja nicht wirklich eine KVM, das ist nur für einen Server. Ich hab mir so eine billige Remote-Lösung gekauft, Stöpselstöpfer per VGA oder HDMI oder Displayport dran, an den Rechner und per USB und dann kannst du dich über den Browser dran connecten. Also so, als würdest du davor sitzen. Irgendwie 120 Euro auf Ebay. Irgendwas Gebrauchtes gekauft dafür. Das finde ich besser als dieses selbstgebastelte Ding. IPv1? Nein, wenn du was Neues machst. Wie wäre es denn mit IPv5 dazwischen? Das haben wir doch nicht. Das machen die einfach wie IPv4. Die behalten quasi den ganzen ollen Scheiß, den die Leute mögen an IPv4. So von Natt bis bis dem ganzen Müll, der bei IPv4 drin ist, und machen einfach nur mehr Adressen. Das wäre doch mal eine Stonks-Lösung. Vielleicht sollten wir das verkaufen. Ich meint es gab auch S10G. Guckt mal, bei Netzwerk für daheim. Es gab auch S10G und jetzt gibt es 5G und 2,5G. Warum sollten die nicht jetzt, wenn sie merken, wir versuchen seit 20 Jahren IPv6 durchzusetzen und es klappt nicht, warum sollten sie jetzt nicht einfach IPv5 machen? Oder IPv6NG. Oder sowas. Ja, ich suche mir für die Badges welche. Bist du das zu keiner Ahnung von, das sind die, die wir haben, aber nicht schlecht. Gab es das? Habe ich nicht. Habe ich nicht verfolgt. Naja. Bei der Gelegenheit erstmal eine Runde Aquarium entspannen. Der Titel ist heute by the way Programm. Ich habe mich jetzt über ein paar aktuelle Sachen ausgelassen und jetzt habe ich absolut keine Ahnung mehr, was ich machen soll. Ich habe gedacht, ich komme einfach nur mal on und gut ist. Kein Stream ist ja der Eis. Hackerman Action. Ja, was soll ich denn Hackerman? War mal ein Vorschlag. BDO Kreisel. Ich habe, habe ich BDO, ich habe, ich habe BDO gar nicht installiert. Nee. Nee. Peeway habe ich auch nicht mal installiert. Alles runter geschmissen. Ja, wie gesagt, das ist klar, dass sie das pushen wollen. Das ist unglaublich. Die Chinesen, die pushen ja in so ziemlich allem aktuell. Also wenn man sich überlegt euch mal, wo die Chinesen technologisch gewesen sind vor, keine Ahnung, es reicht ja schon vor 20 Jahren, da hast du die belacht, da hast du im besten Fall, da hast du im besten Fall gesagt, du kannst dir irgendwelche billig, billig kopierten und geklauten Produkte in China kaufen und heute bauen die in manchen Bereichen schon mit die beste Hardware. Guckt euch Xiaomi Smartphones an, guckt euch die Roborock Staubsaugerroboter an. Also das ist schon lange nicht mehr so, dass die, dass die chinesischen, Chinesen, China, Chinesen da kacke herstellen. Die haben aktuell finde ich eine super Mischung aus copy paste, low price, qualitativ fragwürdigen Shit und richtig gute Sachen, die aber auch preisleistungsmäßig meistens relativ gut sind. Also die Chinesen, es ist jetzt nicht so, dass man sich forscht, also technologisch, ich rede jetzt nicht irgendwie was die sonst machen, aber rein von der Technologie her werden wir uns darauf einstellen müssen, dass uns China, ich meine eingeholt haben die uns ja fast schon. China ist halt groß, es braucht da alles ein bisschen, bis das dann auch komplett adopted ist alles, aber sagen wir so eingeholt haben die uns ja mehr oder weniger schon mittlerweile. Die werden uns in den nächsten 20 Jahren aber sowas von abhängen, nachdem wir auch nicht in der Lage sind irgendwelche zukunftsfähigen Sachen zu machen. Wir wollen ja lieber zurück in die Steinzeit anstatt zukunftsfähige Sachen machen. Die werden uns sowas von abhängen, so schnell kannst du grad gucken. Fangen wir am 1.9. eine Ausbildung zum fahrinformatik anwendungsentwicklung an, dank dir, nice, white pepo happy, ja sehe ich auch so, richtig heckerman geht los. Die machen ipv6 nut, kann ich mir grad vorstellen, wer macht ein ipv6 nut, ja das kenne ich, das ist auch dieser netzwerksimulator, da braucht man aber ein echtes bios von den netzwerkgeräten und sowas, da finde ich den packetray schon deutlich cooler, dass du auch ein GUI dabei hast, wo du dann siehst wie Pakete langlaufen und sowas und das ist nicht ganz so kompliziert. Kennst du crossing? Nee, sagt mir nix. Across NG? Nee, keine Ahnung, aber NG ist sag mal mal ein beliebter, in der open source Szene beliebter Name für Projekte, die geforkt werden, die heißen dann immer NG. Das wird nix mehr, also mit dem kaboom vielleicht, mit dem giga hab ich wenig kontakten, da hab ich ja keinen Bock mehr was aufzunehmen für youtube. Ja genau, giga z deckt telephone, eindeutig, technologieführer. Es wird über kurz oder lang so sein, dass wahrscheinlich Leute freiwillig hier mandarin beziehungsweise chinesisch lernen, weil sie dort besser ihren kram verkaufen können. Schauen deine Kollegen deine Videos, ähm, teilweise, wenig, wenig, wenig, ein paar wissen es, ein paar wissen es, ein paar gucken auch. Beispielsweise letztens erst mit dem Azubi telefoniert, mit dem letzten Azubi, den wir noch haben, der hat gesagt, ich hab mal ein Video geguckt, wo ich erzählt hab, wieviel ich verdiene. Natürlich bestes Einstiegsthema überhaupt, aber ansonsten gibt ein paar, die gucken, aber die meisten wissen das nicht. Der Chef schaut zu, das ist theoretisch möglich, von dem weiß ich, dass der öfters mal twitch guckt. Jetzt nicht unbedingt bei mir, aber twitch. Warum war das neuste Video kein IT-Mythen? Weil's Mythen die Mehrzahl ist. Genau, weil's so ein Mythos war und der Titel bisschen besser ist, weil clickbaitiger, obwohl der Inhalt stimmt. Ja, aber wenn du mal guckst, wieviel die schon versuchen, die kriegen's vielleicht noch nicht richtig gut hin, aber gib denen mal noch ein paar Jahre. Sie versuchen ja auch schon eigene CPU-Architekturen und sowas. Also, die Chinesen haben halt einen großen Vorteil. Die haben Leute in Massen und die haben auch weniger Probleme. Man kann das jetzt als Vorteil oder Nachteil sehen, aber ich sag das jetzt einfach mal. Die haben da auch weniger moralische Probleme bei manchen Sachen. Ich drück das mal so aus. Das wird entweder gemacht oder, keine Ahnung, du fliegst ins Beton-Fundament und wirst einbetoniert so nach dem Otto. Chefku- Keine Ahnung. Haben die auch nicht? Noch nicht. Noch nicht. Noch nicht. Aber ich könnte mir gut vorstellen, dass die Chinesen das früher oder später auch merken werden, dass sie an Umweltschutz nicht vorbeikommen. Das kann aber noch dauern und ob das rechtzeitig passieren wird, sei mal dahingestellt. Aber früher oder später kommen die da wahrscheinlich auch nicht dran vorbei. Aber aktuell, ja, ist das denen ziemlich egal. Wobei ich mir da gar nicht mal so sicher bin. Man hat ja schon öfters gesehen, sobald es den Leuten ein bisschen besser geht, dass sie nicht mehr von tagtäglich ans Überleben denken müssen, dann sind die relativ schnell dabei, dass sie sowas auch nicht gut finden. Mal gucken, mal gucken, wir werden mal gespannt. Zumindest, was ich eigentlich sagen wollte ist, die haben uns mehr oder weniger, was Technologie angeht, schon fast eingeholt. Vielleicht nicht überall, aber fast. Und die nächsten 20 Jahre, machen die uns platt? Also sinnbildlich, ja. Und wir sind ja aktuell eher damit beschäftigt, uns selbst zu zerfleischen mit irgendwelchen Themen, anstatt die Weichen so für die Zukunft zu stellen oder mal zukunftsfähige Technologien zu entwickeln. Oder sich mal wenigstens öffentlich Gedanken drüber zu machen, dass man sowas vielleicht tun sollte. Aber wir zerfleischen uns aktuell richtig krass selbst. Das machen wir aber nicht nur wir. In den USA ist das auch so, wenn diese ganzen, diese ganze Selbstzerfleischungsbewegung kommt ja so ein bisschen aus den USA. Oder haben die Chinesen kein Problem mit? Ja, das verstehe ich ehrlich gesagt auch nicht so genau, weil wenn doch unmittelbar, also das leuchtet mir auch nicht ein, warum man das in dieser Reihenfolge machen will. Kohlekraft ist doch erst mal zumindest kurzfristiger, also vielleicht habe ich überhaupt, vielleicht liege ich auch total falsch, aber das verstehe ich nicht so genau. Kohlekraft ist doch auf jeden Fall kurzfristiger, klimatechnisch das größere Problem. Ja, du hast bei Atomkraftwerken natürlich das riesen Problem, dass du nicht weißt, wohin mit der ganzen Scheiße. Aber wenn es jetzt gerade so das unmittelbare Klimaproblem ausgelöst wird mit von Kohlekraft, dann ist halt die Frage, okay, wenn man es unmittelbar damit größere Katastrophen abwenden können, warum macht man es dann so rum und nicht anders rum? Das verstehe ich auch nicht. Leuchtet mir nicht ein und dass es Probleme gibt, streitet da mittlerweile wohl kaum auch noch eine ab. Die Frage, um die sich aktuell dreht, ist eher, worüber diskutiert wird, kann der Mensch was dafür oder nicht? Also die Sache mit, wir bezweifeln, dass es so etwas, dass es Klimawandel was gibt, sagt ja eigentlich kaum noch einer. Ja, da hast du auch, da hast du auch Leute, die teilweise übelst schwach sind, erzählen. Aber ich kann mir nicht, bei Trump weiß ich, der erzählt ja auch, man soll Desinfektionsmittel trinken und sowas. Ja, und klar, die AfD hat sicherlich auch viele Leute, die sehr weltfremde Sachen erzählen, aber dass die zum überwiegenden Teil sagen, dass es den Klimawandel nicht gibt, das kann ich mir nicht mal bei denen vorstellen. China, Chinesen, Virus, naja, gut, ich will es jetzt nicht so sehr aus, das ist immer ein schwieriges, sehr strengendes Thema. Was machen eigentlich so die aktuellen Umfragewerte? Umfrage, Bundestagswahl 2021, wie sieht das aus? Was haben wir da so, taugt die Seite was? Also CDU ist bei 28,2, null Schett, 18,4 die Grünen. Warum hat die SPD eigentlich so viel? Das ist für mich die unsympathische Partei von allen. Das kann ich dir verstehen, ich. Das habe ich keinen Schimmer. Haben die mehr als das letzte Mal? Nee, oder? Warum haben die überhaupt noch so viel? Also ich habe es ja schon öfters gesagt, ich tendiere tatsächlich aktuell zu, ich will mich da jetzt aber nicht länger darüber auslassen, weil ich weiß, es sieht jeder ein bisschen an, ich persönlich tendiere ja aktuell zur FDP. Mal gucken, ich bin mal gespannt, mal gucken, ob mich noch jemand überzeugen kann, dass ich wirklich sage, so wirklich überzeugt haben die mich nämlich auch hundertprozentig nicht. Vielleicht kommt ja noch irgendwie, ich gucke ja in letzter Zeit auch immer öfters ein bisschen Fragerunden und sonst was, vielleicht kommt ja noch irgend einer, wo ich sage, ey das überzeugt mich jetzt richtig und nehm noch was anderes. Ja, ohne Scheiß, das habe ich sogar mal gemacht, also ich habe ja mal eine Zeit lang Piraten für Internet gewählt und Zeug. Ich würde auch sowas wie die Tierschutzpartei wählen, ohne Mist, das Problem ist nur, das ist verschenkt. Die haben keine Chance irgendwie da rein zu kommen, die Tierschutzpartei und dann ist deine Stimme im Endeffekt verschenkt, weil das wird ja alles rausgerechnet, also wenn jetzt ganz viele Leute nicht wählen oder sagen wir mal ungültig wählen, nicht wählen oder na gut, nicht wählen taucht da nicht auf, aber sagen wir mal ungültig wählen oder keine Ahnung, so Kleinparteien wählen, dann hast du das Problem, dass du dann beispielsweise auch Mehrheiten hast unter 50%, weil das aus der Gesamtsumme dann wieder rausgerechnet wird, also das bringt leider nichts, so gerne ich vielleicht auch sowas mal hier so was unterstützen würde, es ist halt verschenkt. Die sind richtig weird, ich habe die Piraten vor 10 Jahren oder so gewählt, als die neu waren und ich vom Ansatz her das gut fand, dass es mal eine Partei gibt, die sagt, hey wir setzen uns für Infrastruktur, Technologie und Internet ein, die haben sich aber dann auch selbst irgendwie eliminiert und seit den letzten paar Jahren interessiert sich ja keiner mehr für, die treten ja zum größten Teil sogar gar nirgendswo mal richtig an, unter 5% ist bloated, naja ich bin echt gespannt, was da rauskommt, also diesmal wirklich noch mehr als das letzte Mal, ich hoffe nur inständig, dass es nicht noch mal auf groß, wobei große Koalition kann es ja nicht mehr geben, ich gehe davon aus, dass die Grünen mehr bekommen als die Linken, äh ja, dass die Grünen mehr bekommen als die SPD meine ich, nicht die Linken, mehr als die Linken bekommen sie auf jeden Fall, dass die mehr bekommen als die SPD, das heißt die große Koalition in, jetzt wäre ja CDU und die Grüne, das wäre, wenn du die zwei größten zusammen nimmst, ja aber naja, keine Ahnung, ich bin echt mal gespannt, ja, ich glaube das kann man so noch überhaupt nicht sagen, es tut sich, also gerade die letzten Monate vermute ich, zumindest man wird sich da einiges tun, weil viele Leute noch unentschlossen sind und jetzt sagen ah das, das, jenes, ich weiß es nicht, manche entscheiden sich ja, ich glaube da gibt es sogar Untersuchungen zu, dass sich viele sogar auch sogar am letzten Tag oder auf dem Weg zum Wahllokal oder quasi noch, wenn sie den Stimmzettel vor sich liegen haben, entscheiden, also das ist gar nicht so klar, dass das so in die ähnliche Richtung kommt, wie jetzt die Umfragen sind, Musik starten, gut, aber es ist letztendlich ein müßiges Thema darüber zu diskutieren, weil es jeder ein bisschen anders sieht, wobei ich es ganz gut finde, wenn man, wenn, wenn sich mal, wie soll ich sagen, wenn die Leute sich nicht gleich wie auf Twitter an den Hals springen, wenn einer was sagt, was ihnen nicht gefällt, ja, Twitter ist ja ganz schlimm, also Twitter ist wirklich die schlimmste Plattform, die es gibt, so, wenn du mal wirklich zwei Seiten sehen willst, die aufeinander losgehen, also wenn du, wenn du Twitter, wenn du dir Twitter anguckst, also wenn, also wenn es nach Twitter geht, dann gibt es eigentlich nur noch Extremisten auf allen Seiten oder man kann nicht mal so weit gehen und sagen, es gibt links und rechts, auf Twitter gibt es ja alles, ja, links, rechts, oben, unten, vorne, hinten, aber Extremistisch, zumindest, zumindest wenn du dir die Tweets anguckst, die sind ja so krass drauf, die Leute auf Twitter, also zum Glück ist das nicht repräsentativ für einen Großteil der Bevölkerung, Twitter sind so viele Leute instant ausgelöst durch jeden Scheiß, ja, ich bin übrigens immer noch der Meinung, obwohl ich Twitter immer flame, ich, das wird das auch nicht, wird das auch nicht, obwohl ich Twitter immer flame, ich finde, Twitter ist immer noch die beste Social Media Plattform, man muss halt seine Trends umstellen, also Twitter Trends auf Deutschland ist für den Arsch, ne, die gibt es nicht, die gibt es noch, aber die sind kaum noch am Start, also du musst erstmal die Twitter Trends auf Deutschland ausstellen, ich habe es auf Andorra stehen, aber man kann es auch auf irgendein anderes Land stellen, wo vielleicht was vorkommt, was einen interessiert, Andorra habe ich, weil es ist einfach nie Trends in Andorra, das ist der einzige Trend, in dem ich mich erinnern kann, in Andorra war letztens Tour de France, ansonsten ist Twitter Andorra Trends ist immer komplett leer, das finde ich sehr angenehm, weil immer wenn ich in die Deutschland Trends gucke, habe ich wieder den, wie soll ich sagen, die geistige Elite vor mir, ja, oder das halte ich nicht auf Dauer aus, ne Reddit ist nicht so schlimm, Reddit kannst du dir ja wirklich genau aussuchen, wenn du jetzt natürlich in irgendein Politik Forum auf Reddit gehst, oder in irgendeinem, ja du wirst wahrscheinlich selber wissen, wenn du dann in irgendeinem Subreddit gehst, wo du halt sowas abgeht, dann klar, aber ansonsten ist es auf Reddit nicht schlimm, Reddit hat die übliche Forumskrankheit, die alle Foren haben, dass quasi mehr auf Fehler eingegangen wird, anstatt auf Antworten, also sprich, wenn du eine Frage stellst auf Reddit, antwortet keiner drauf, wenn du auf Reddit sagst, ich habe rausgefunden, es ist so und so und so, und das ist nicht so, dann hast du 500 Antworten, die sagen, alter du Kacknut, du hast keine Ahnung, du bist richtig dumm, also du musst eigentlich auf Reddit, wenn du die Antwort wissen, wenn du die Antwort für was haben willst, musst du behaupten, du kennst die Antwort, und was falsches hinschreiben, dann bekommst du die Antwort, das ist so der Trick an Reddit, wenn du einfach nur eine Frage stellst, klappt das in der Regel, das ist übrigens bei allen Foren so, ja und dann hast du natürlich die üblichen Sachen, die in jedem Forum sind, die hast du natürlich auch auf Reddit, dass die Leute dann schreiben, hm, warum willst du denn so was machen, das ist eben eher die beste Forum, nein, das macht man so nicht, und dann postet ihr eine 200 Seiten lange Konfig, oder sagt ihr, ich hatte das noch nie nötig so zu machen, ein bisschen Schwanzvergleich auf Reddit, das ist übliche Forumssachen, aber an sich ist Reddit gut, also ich würde sagen, Twitter ist für mich die beste Social Media Plattform, trotz den links, rechts, oben, unten, vorne, hinten extremistischen Leuten auf Twitter, und Reddit ist die beste Forumsplattform, obwohl die üblichen blöden Forumsdiskutierer am Start sind, leider was Reddit richtig sagt, ist das finde ich, ist das neue Reddit Layout, ich mag es nicht, ich mag es einfach überhaupt nicht, ich finde es richtig eklig, leider ist Old Reddit auch schon ziemlich in die Jahre gekommen, dass es nicht nur nicht schön aussieht, sondern auch funktionell ein bisschen zu wünschen übrig lässt, so, und was der richtige Hyper Cancer, also um es jetzt mal wirklich übertrieben zu sagen, an Reddit ist, ist die Smartphone App, Reddit hat sich ja überlegt, wenn man sie über die Suchmaschine aufmacht, dann kann man sich die Posts nicht mal angucken, also ich weiß nicht, ob ihr schon mal in letzter Zeit auf dem Smartphone oder auf einem iPhone, da weiß ich es halt, weil ich kriege ja eins gestellt von der Firma, ich habe ein iPhone 11 und wenn man da Posts auf Reddit aufmacht, dann steht hier jetzt als erstes drinne, wollen sie wirklich in Safari durch, wollen sie wirklich in Safari fortsetzen, dann sagst du, ja fortsetzen in Safari und dann steht dann, dieses Subreddit kann nicht angezeigt werden, verwenden sie jetzt die App, das fuckt mich richtig ab, ich verwende ja auch eine Reddit App auf dem Smartphone, aber nicht die offizielle Reddit App, weil den Erfolg gönne ich ihnen nicht, ich verwende auf IOS, IOS Apollo Reader für Reddit, Reddit, der Christian Selig, der ist Big Brain, der kennt sich aus, die verwende ich, aber auch nur, weil ich Reddit den Triumph nicht gönnen will, dass ich ihre App verwende, am liebsten würde ich den Browser angucken, ich finde das auch so bescheuert, du suchst was in Google, du findest ja immer viel Reddit als Antworten, das ist ja normal, du hast irgendwas, ich programmiere Netzwerk, Technik, du suchst irgendwas, findest einen Reddit Post, drückst drauf in Google auf die Suchmaschine, kriegst den Reddit an und das erste was kommt ist, ah nee geht nicht, das fuckt mich so ab, also das ist wirklich, ich weiß auch gar nicht, was Reddit sich dabei denkt, das bringt ihn doch nicht wirklich mehr User oder, meint ihr wirklich, das bringt Reddit, ich kann's mir nicht vorstellen, ja gut, ja er muss einfach den richtigen Leuten folgen auf Twitter und diesen ganzen, dieses ganze gegenseitige runter und niedergemache einfach nicht die Deutschland Trends angucken einfach, das ist das beste, die zerfleischen sich immer so selbst auf Twitter, das ist richtig krass, ja, ich hab es nie für möglich gehalten, dass ich das machen muss, aber ich musste tatsächlich ein paar Leute ignoren und ein paar Leute bannen, bannen weil total dummes Zeug, ne, wollte ich nicht sehen und ignoren weil, man kann ja so silent ignoren auf Twitter, also Leute die ich nicht wirklich ignoren will, weil ich bin nicht bannen will, also weil ich nichts gegen sie persönlich habe, aber ich folge Leuten wo mich eigentlich schon interessiert was sie schreiben, aber die retweeten manchmal Leute die ich partout nicht ab kann und das ist dann schwierig, hast du MSI gebannt, stimmt, ich muss mal Leute, ich muss gucken ob ich immer noch bei MSI gebannt bin, Moment, Moment Twitter, MSI, Sekunde, Sekunde, MSI Deutschland Gaming, ich bin immer noch blockiert, warum? Was haben die, warum haben die mich immer noch gebannt, guck mal, was soll das, warum, ich dachte die können mich endlich mal anbanen, aber nein machen sie nicht, ich weiß bis heute ehrlich gesagt nicht hundertprozentig warum, ich hab mich über ihre RGB Mainboards lustig gemacht, das ist alles, ich hab mich 2, 3 mal über ihre RGB Mainboards lustig gebannt, da bannt man doch jetzt nicht jemand für, ich mein was hab ich denn, jetzt mal ernsthaft, Twitter, ich muss jetzt mal gucken, was, MSI, Twitter Deutschland, ich muss jetzt mal gucken, was hab ich denn Schlimmes geschrieben, MSI Gaming, was hab ich Schlimmes geschrieben, das muss ich mir jetzt nochmal angucken, was, was hab ich Schlimmes geschrieben, was, was hab ich denn, was hab ich denn überhaupt getan, muss irgendwie MSI drinstehen, das ist so alt, das ist so alt, ja sowas hab ich geschrieben, wo ist das Problem da dran, mal ernsthaft, Blink und Leuchte Mainboards, wozu, danach wurd ich gebannt, guck hier Oktober 2016 und das hab ich vierprozentig, ich wurd wegen diesem Tweet gebannt, sonst zwischenseitig hatte ich mit dir nix zu tun, warum haben die mich dafür gebannt, findet ihr jetzt mal ernsthaft, findet ihr den Tweet bannwürdig, chat, sagt mal ehrlich, findet ihr das bannwürdig, ist das schon Hatespeech, ist das schon Hatespeech, Leute, wenn ich die Twitter Trends schon seh, ok, hier weiß ich, klick ich definitiv nicht drauf, auf gar keinen Fall klick ich auf diesen Trend in Deutschland drauf, wer das ist, hab ich keine Ahnung, wer das ist, hab ich auch keine, Bratwurst Trends, warum Trends, nein, nein Max, ich guck nicht rein, ich gucke nicht in deutsche Trends, so, keine Ahnung, was ist das, menschenfeindlich, oh ja, Twitter, Twitter ist menschenfeindlich in Person, Salazar weiß ich nicht, wer das ist, ich kenn Sarazar, das war mal der Sidekick von Gronkh, das Salad macht Dinger, Beatmungsgerät trendet, ok, der Falk, ok, ich find's schon mal, es scheint ganz ok zu sein aktuell, tja, aber wie gesagt keine Ahnung warum ich gebannt wurde, ich weiß es nicht, wer weiß, wer weiß, ja, heute wird alles gecancelt, instant wrecked, ja, Apollo beste, da muss ich übrigens auch demnächst wieder einkaufen, weil ich hab keine Spaghetti mehr, ich muss Spaghetti kaufen, guck mal hier, ich kauf wieder diese Website, Mom's Spaghetti, was ne Website, hier, ne, die nicht, die nicht, die da, Spaghetti, Anzahl Kartons, ok, man braucht 100 Euro für versand, für kostenlosen versand, 6 Kartons sind das 100 Euro, wo sieht man, alter die Seite ist so schlecht, nein reicht nicht, 7 Kartons, das kann ich ja im Leben nicht, ich kann auch keine 7 Kartons Spaghetti futtern, also 7 Kartons sind jeweils 1 Karton, gleich 6 Spaghetti, ich kann Spaghetti nicht schreiben, seht ihr mal, richtig oi, richtig, richtig 3-Head, wie schreibt man Spaghetti, das sind, guck mal, das sind 7 oder 8, wie viel waren es jetzt, 7 Pakete, jeweils 6 mal Spaghetti, das ist zu viel, 500 Gramm ist ein Paket, da hab ich 2 Jahre Spaghetti, wenn ich das bestelle, ja das ist auch nervig, das sind so Kleinigkeiten auf Reddit, die einfach abfacken, genau, manchmal hast du sogar das Problem, dass du nen Thread aufmachst, der hat nur 5 Antworten und trotzdem möchte Reddit, dass du sie ausklappst, obwohl wenn du sie ausklappst, sie dann auch noch falsch ausgeklappt werden, Chainlaw, hast du gerade irgendwie ein Passwort in den Chat gepostet, oder ist es Gbait, beim Chainlaw bin ich mir immer nicht sicher, ich trau dem auch zu, dass der einen Fake Passwort generiert hat und dann so zu tun im Chat, als hätte er sein Passwort gepostet, ich trau dir alles zu. RPG, du meinst RGB oder? Rot, Grün, Blau, was wäre denn dann die, sagt mal Leute, was wäre denn eine RBG, eine RBG Koalition, was wäre das denn dann, RGB Koalition, das wäre dann Rot, Grün, Blau, also AFD ist Blau, oder, Rot, Grün, Blau, also SPD, Grün und AFD, ja eine äußerst wahrscheinlich Koalition, die RGB Koalition, ja, Max warum klingt deine Stimme gerade so jung, weiß nicht, klingt die anders als sonst, Zoomer, Zoomer Max heute, das war klar, ja wahrscheinlich, wahrscheinlich weil ich gesagt hab, RGB Mainbots sind unsinn, keine Ahnung, ich hab mich aber auch nicht darum gekümmert, dass die mich irgendwie entbannen, das juckt mich auch nicht, mach hier mit MSI auch nichts, hast du die neuen C++ Updates bereits gelesen, guter Chebat, aber da falle ich nicht drauf rein, nee, für den Chat kochen, ganz bestimmt, ja, dann müsste ja der Chat zu mir nach Hause kommen, nee, nee, es gibt so ein paar Dinger, die wird's nie geben, ich mach garantiert, ich mach garantiert kein Spaghetti kochen für den Chat, doch, doch Leute, das mach ich nach dem Face Reveal und das Face Reveal wisst ihr ja, ist bei 1 Million Abos und bei 2 Millionen Abos, mach ich dann, äh Viewer treffen, was auch nie, was beides nicht eintreten wird, ah wir posten alle Passwörter aber jetzt verstehe ich, sehr gut, exzellent, ein Onlyfans, mach mir, ich sage euch nächstes Jahr, am 1. April ist es wieder der Trollolollacher von allen Streamer und Streamerinnen, saß ich jetzt schreibe auf Twitter, Leute, hab übrigens einen Onlyfans-Account gemacht, haha, lulcibaited, das werden dann wieder 150 Leute an einem Tag machen und dann ist es natürlich immer noch furchtbar lustig, seh ich ein, ja ich weiß aber das alte Reddit-Interface ist auch nicht der Weisheitsletzter Schluss, das ist ja auch nicht geil, das ist nur besser als das neue, Max, was hältst du von radikaler Ehrlichkeit, hä wie was, du meinst, dass man immer exakt sagt, was man denkt und ich halte, also wenn du das meinst, halte ich das für äußerst unvorteilhaft in vielen Situationen, sowohl nachteilig für dich als auch für andere Leute, also man muss jetzt vielleicht nicht den ganzen Tag den Leuten irgendwie was aufs Ohr erzählen, aber manchmal ist es sicherlich nicht verkehrt, manche Sachen wegzulassen oder sie etwas in etwas besserem Licht erscheinen zu lassen, als sie eigentlich sind, ist das eine Wette, ja im Prinzip nur eine Wette, wo ich relativ gute Chancen habe sie zu gewinnen, wann kommt das Schmink-Tutorial, das müssen wir den Fabian unbedingt mal wieder fragen, wenn er online ist, ist er online, Chat, mal checken, checken, Moment, ist da Frazier am Start, was, ach so, OnKS, ich hab schon gedacht, irgendwie ein Channel gelöscht oder so, so viele Anime Games, jetzt gibaten sich alle mit Passwörtern rum, wisst ihr was, dem Chandler würde ich sogar zutrauen, dass es echte Passwörter sind, dass er jetzt erstmal den Tor Browser angeschmissen hat, sich irgendein Passwort-DB gezogen hat und jetzt echte Passwörter postet, so als würde er gibaten und er gibated eigentlich gar nicht, also quasi Reverse-Gibating der Gibater, versteht ihr was ich meine, Triple-Bate, Admin, Admin, da fällt mir auch was lustiges ein, ihr wisst, Boomer-Gehirn, vielleicht hab ich euch das schon mal erzählt, ich muss mich jetzt sogar ein bisschen überlegen, wie das genau war, letztens haben wir eine Kiste gesucht und ich weiß gar nicht genau, wie das Passwort am Ende war, also letztens hat irgendjemand bei uns angefragt, so nach dem Motto, könnt ihr mal so einen uralt Server wieder einschalten, so irgendwas, was es schon länger gibt, als ich überhaupt in der Firma bin und haben wir wieder eingeschaltet, sind wir nicht draufgekommen und am Ende hab ich das Passwort durch reinen Zufall geprootforced, durch reinen Zufall, also ich hätte nie damit gerechnet, ich hab mich versucht einzuloggen mit PSSH und ich weiß gar nicht, was das Passwort war, es war entweder 123456 oder 123456, ich glaub es war 123456 und ich hab einfach, weil ich das gewöhnt bin von meinen Testkisten, hab ich gesagt, root at Passwort 123456, bam, rootforced, stimmt nicht was ich euch erzähle, stimmt nicht, ich hab zwei Sachen vermischt Leute, ich hab zwei Sachen vermischt, das war kein Server, das war ein Passwort für ein Zertifikat, das mit dem Server war was anderes, da mussten wir das Passwort resetten, das wo ich 123456 aus Versehen prutforced habe, war ein Passwort für ein Zertifikat, wo man es nicht importieren konnte ohne richtiges Passwort oder entpacken konnte, nee, man konnte es nicht entpacken und man konnte es nicht importieren, so rum, nicht mit dem richtigen Passwort und ich hab dann einfach gesagt 123456 und instant ging's, das war quasi der luckiest prutforced Dings of my life, von Hand geprootforced first try, 123456 versus 123456, was ist besser, 123456, besser, wissenschaftlich erwiesen best practice, also es ist ja klar, man sollte möglichst viel erprobte Sachen verwenden in seiner IT, da muss man nicht so viel selbst erfinden und 123456 ist eindeutig best practice, der Suss hat mir den Tag schon thematisiert, nee, ich weiß auch nicht was ich da groß zu sagen soll, was soll ich da groß zu sagen, Suss hat mir den Tag, einzige was ich dazu gesehen hab, heute war auf heise ne Torte mit Pinguin drauf, hatten wir doch erst letztens, achso C++ Stream, ja, wenn wir die ESP32 Kameradinger programmieren, würde es, nein, auf gar keinen Fall, also und schon gar nicht als Programmierer oder irgendwie Level Designer oder gut, da hab ich hier keine Ahnung von, aber auf gar keinen Fall, nein, würd ich nicht machen, bist du ignoriert, wieso, was denn, wo dann, was hältst du, ja da drum, ja, echt, du hast was, hast du, seh ich net, ist das die seriöse Frage, hab ich doch gesehen, nee, dann weiß ich nicht, welche du meinst, kein Rant über C++, nee, heute nicht, also du kannst, poste einfach noch mal, ich hab keine Ahnung wo, vielleicht war es aber auch einfach nur G-Bait, nee, aber da hätt ich keinen Bock drauf, das muss ich mal ausprobieren, Terox, dankeschön für den Prime Sub und 16 Monate Hyper Subscription, das ist ja schon richtig lang, ich hab wieder die Hälfte wahrscheinlich heute gar nicht erwähnt, sorry Leute, ich guck mal schnell, Tommy05, dankeschön für den Sub, der Herwing ist auch am Start, mustifreak und ein Dev-Operator, ein Dev-Operator verliebt speakt, Nierdu hat auch Subscribed, der Tains auch wieder 25 Monate, meine Güte, gar nicht gesehen alles, zauerei, Anzeige ist raus, was hältst du von keypass, ich verwende das selbst, ist ein sinnvoller Passwortmanager, kann man verwenden, das hab ich auch gehört, gerade bei Blizzard ist es wohl ab 2013 ganz toll gewesen zu arbeiten, da bin ich ja auch mal wahnsinnig gespannt, was da rauskommt, die werden ja nicht von irgendwie den 0815 Leuten verklagt, sondern das ist quasi der Start Kalifornien, da bin ich wirklich mal gespannt, und die Antworten, die CEO und was ich Inklusionsbeauftragte und was sie nicht alles noch haben da geschrieben haben, war halt echt lächerlich, so nach dem Motto, man schreibt einfach, das was einem vorgeworfen wird, kann ja überhaupt nicht sein, und man ist stolz in so einer tollen Arbeit, in so einer tollen Firma zu arbeiten, wo sowas ja nicht passieren kann, also diese, ach ja, und dann hat der Blizzard-Chef ja noch, oder ich weiß gar nicht, ob es der Blizzard-Chef oder der andere Typ, oder nee, das waren zwei Typen und eine Frau, die glaube ich die Mails geschrieben hat, ich weiß es jetzt aus dem Kopf nicht, wo sie geschrieben haben, sie haben jetzt Anti-Rassismus, Anti-Mopping, Anti-Familie, Anti-Sexismus und sowas, Training, Training und sowas, Alter, jetzt, und damit hat sie es jetzt, oder wie, war das nicht Activision, ne doch, das ist der gleiche Laden mittlerweile, seit 10 Jahren oder so, also ganz merkwürdige Statements auf jeden Fall, du siehst Schwarz für Overwatch 2, ich hab auch schon vor dieser Geschichte Schwarz für Overwatch 2 gesehen, da kannst du mal ein gutes MMO für dich programmieren, das stimmt, aber das kann ich wahrscheinlich gar nicht, weil ich überhaupt keine Erfahrung in der Spielentwicklung hab, aber ich könnte sicherlich mitprogrammieren da dran, ob da natürlich das ein gutes MMO wird, wenn ich es nicht entscheiden kann, also nein, weil es ein gutes MMO wird, wenn ich was nicht entscheiden kann, kann durchaus sein, aber nicht ein MMO, was ich gerne hätte, also so wie ich es mir gerne vorstelle wahrscheinlich, warum gibt es kein Crap für Twitch Chat, wieso gar kein Problem, nimmst einfach einen ISC Client, Konsolen ISC Client, connectest dich zum Twitch Chat und crepst, oh ist das Problem, echte Hacker-Mans machen das so, ISC only, Kommandozeilen ISC only, wenn du ein richtiger Hacker-Man wärst, dann hättest du wahrscheinlich schon ein Twitch Addon programmiert, das in einem Terminal Twitch Emotes anzeigen kann, also quasi Twitch Emote to ASCII, ASCII Art, New Basic, nein bestimmt nicht, im nächsten Azubi Video geht es um den ersten Arbeitstag, hab ich im letzten Video schon gesagt und was ich für sinnvoll halte, zum Beispiel eine der Sachen, die ich da erzähle ist, wenn man vorausgehende Azubis hatte oder vielleicht noch welche die Azubis noch sind, ist es sicherlich nicht verkehrt, mal am ersten Tag ein bisschen sich umzuhören, ok was sind denn so die Dinge, die ihr verkackt habt bzw. was sollte man denn auf gar keinen Fall machen oder wo sind sie besonders empfindlich drauf, ich hab zum Beispiel am ersten Tag was gemacht, was ich bis heute nicht schlimm finde, wo ich aber gehört hab, dass sich Leute drüber aufgeregt haben, ich hab am Telefon gesagt, ich hab mich hier mal telefoniert, irgendwie, keine Ahnung, 15 Minuten über irgendwas und ich hab dann beim Auflegen gesagt, ja und Tschüss, ja und Tschüss und da haben die gesagt, das wäre ja voll, oh keine Ahnung, da haben sie sich voll drüber aufgeregt, da haben sie sich voll drüber aufgeregt, das weiß ich noch, da waren sie, waren sie getriggert, ja ich kanns verstehen, ich kanns verstehen, das klingt schon, das klingt schon ein bisschen unfreundlich, aber was sie da für ein Oppress drum gemacht haben, hätte ja bloß noch gefehlt, dass sie mich zum Ritorikseminar geschickt haben, ich hätte auch beim Auflegen einfach sagen können, also da so eine Welle zu machen, ja solche Sachen sind nicht verkehrt zu fragen, aber also, halt Yo, ich bin jetzt schon rein! Oder selten, weil die meisten, die sagen wir ein Jahr plus dabei sind, die im Chat aktiv sind, die kenne ich jetzt wieder, aber trotzdem, cool, dass du so oft reinguckst, nice. Silence aber. Joa, muss ja nicht jeder den Chat vollspammen mit sinnlosem Zeug. Jailor macht das schon für mindestens 50 andere Leute mit, kein Problem. Ehm, Physix, danke schön für den Prime-Sub. Lulub96, danke schön, vier Monate. Ne, Social Media Manager oder Social Media Sachen, so Marketing-Stonkstinger würde ich nie machen, das ist echt, ich habe so eine Abneigung gegen solche Jobs. Und gegen das, was die machen, nicht gegen die Leute. KitKat, danke schön, aja ja, aber richtig, aja ja. Ja, hab ich. Das ist ja relativ einfach einzuschalten, ich hab das mal, als es noch nicht, wie soll ich sagen, es ist ja nicht gekündigt, als es noch nicht auf Eis gelegt wurde, hab ich mal folgende Sachen gemacht mit Swarm. Ich hab gesagt, Docker, Swarm, was sagt man, Enable? Es gibt den Befehl zum Einschalten. Und danach hab ich mich gefragt, warum genau hast du das jetzt eigentlich gemacht? Und dann hab ich dich verwendet. Nein, ich hab damit noch nichts wirklich gemacht. Das ist wohl wahr, gerade in kleineren Umgebungen, da muss man hier nicht irgendwelche Kubernetes-Geschütze auffahren. Aber Kubernetes zu lernen, hat natürlich den Vorteil, dass Kubernetes äußerst gefragt ist. Docker Swarm ist doch sowas wie Kubernetes, ja, es geht in die gleiche Richtung. Aber Kubernetes ist die deutlich verbreitetere und beliebtere Technik. Und Docker Swarm möchte selbst der Hersteller selbst nicht mehr unterstützen. Hast du schon mal was mit dem, ich persönlich nicht, wir haben auf der Arbeit Elasticsearch und, warte mal, Logs-Kibana, genau, haben wir im Einsatz. Das funktioniert erstaunlich gut, bis auf dann, wenn es nicht funktioniert. Und wenn es nicht funktioniert, ist der Support von Elastic, oder von dem Hersteller, weiß gar nicht, wie die genau heißen, keine große Hilfe. Das weiß ich noch, wir hatten mal das Problem, dass unsere Elasticsearch-Cluster der Meinung waren, sie machen keinen Cluster mehr. Und da muss man die irgendwie rausnehmen und mit neuem Token sünken oder so, das ist total die Wissenschaft für sich. Und der Support hat die unsinnigsten Antworten geschrieben. Die war nicht hilfreich, aber wenn es funktioniert, funktioniert es gut und schnell und es ist echt nicht übel. Ja, das ist doch cool. Der erste Arbeitstag ist doch schon unter, ja, also für alle, die am 2.8. anfangen. Wie kann man als Azubi einen guten Eindruck hinterlassen? Also, ich kann dir nur sagen, wie das bei mir ist. So, und bei mir hinterlässt ein Azubi einen guten Eindruck, wo ich das Gefühl habe, der interessiert sich für das, was er macht. Der interessiert sich eben für die Tätigkeit und es geht nicht ins eine Ohr raus und ins andere Ohr rein. Und man merkt, der, wie soll ich sagen, ich will nicht sagen, man merkt, dass er lernt, das ist jetzt das falsche Wort. Aber ich freue mich, wenn das, was man mit einem Azubi macht, auf fruchtbaren Boden fällt. Dann hinterlässt er auch bei mir einen guten Eindruck. Also, wenn man sich mit dem zwei Tage was angeguckt hat, immer mal wieder über zwei Tage verteilt und der am dritten Tag sagt, was haben wir eigentlich noch mal gemacht die letzten zwei Tage über, ich brauche das für meinen Bericht, dann macht es keinen allzu guten Eindruck. Das konnte Herr Endpunkt übrigens auch richtig gut. Der hat mich wirklich mal gefragt, das ist kein Witz, ich habe mir mit dem eine Woche lang Netzwerkbasics angeguckt. Und dann hat er mich gefragt, Max, was haben wir eigentlich noch mal gemacht, ich brauche das für meinen Bericht. Ich bin auch ein bisschen, ich bin echt ein bisschen verarscht vor allem. Ja, also das muss nicht unbedingt sein. Aber wenn ich das Gefühl habe, dass das, was man mit dem Azubi macht, irgendwie auf fruchtbaren Boden fällt oder noch besser, man merkt halt, dass er wirklich auch was draus gelernt hat, weil er ein paar Sachen halt dann besser kann als vorher, das reicht mir eigentlich schon. Ich habe auch keine Schmerzen mit, wenn mich Azubis nerven. Also nerven in Form von, mich Sachen fragen. Aber guck mal hier so, ja gut, wusste ich, wusste ich das viel. Ich habe kein Problem, wenn die mich nerven, indem sie mich Sachen fragen, so nach dem Motto, was ist hier mit, wie funktioniert das, warum geht das, was auch immer. Was mich nervt ist, wenn sie mich immer die gleichen Sachen fragen oder blöde Sachen fragen, so nach dem Motto, zum fünften Mal das gleiche, ohne dass man gesehen hat, dass sie sich versucht haben, nennenswert mit der Thematik auseinanderzusetzen. Ich habe den Polle übrigens gar nicht gesehen, bis er fertig war. Ich glaube, so ging es vielen Leuten. Intern war das. Noch schlimmer, das war intern zu jemand, der im Büro weiter gesessen hat. Also, naja, gut. Nochmal, ok, ja, ok, dann machen wir nochmal. Jetzt haben wir alle den Polle gesehen, jetzt können wir alle daran teilnehmen. Es sind halt echt viele. Es sind echt viele. Aber gut, ich meine, content-technisch ist es ja hier auch hauptsächlich mal, würde ich sagen, gerade für so Leute interessant, wenn ich irgendwelche Linux-Krempel bastle oder vielleicht irgendwelche Micro-Controller-Zeug rund, das interessiert ja die meisten Leute nicht. Aber ich muss ja echt mal sagen, es ist wirklich richtig poggers, dass ich hier, ich habe mir ja letztens mal meine Statistiken angeguckt, wir haben ja, das habe ich gar nicht realisiert, wir haben ja relativ oft Streams, da gucken 450 Leute zu, wenn ich irgendwas mache. Letztens beim Linux-Server-Einrichten für Einsteiger haben 450 Leute zugeguckt, bis der DDoS anfing. Also, wenn der DDoS, wahrscheinlich hätte ich auch noch mehr bekommen. Das riecht krass, vor allem mit dem Zeug hier, das hätte ich ja nie gedacht, was natürlich doppelt, doppelt, doppelt plus nice ist, ja. Aber man muss auch sagen, wir machen ja auch oftmals, also ich würde mir das auch angucken. Ich mache jetzt, ich gucke mir ja auch meine eigenen Videos teilweise selbst an nach einem Jahr oder so. Und dann gucke ich mir das Video und denke mir, ja, es ist eigentlich nicht verkehrt, was ich so gesagt habe. Und ja, aber wisst ihr, was echt zu ganz merkwürdigen Sachen führt? Ich hatte letztens Twitch auf, auf dem Handy im Bett, habe geguckt und irgendwie wurden mir, glaube ich, einen Clip angezeigt, habe ich einen Clip geguckt und irgendwie bin ich eingepennt und die Clips laufen ja dann weiter und irgendwie war es dann so, ich weiß gar nicht, vielleicht habe ich auch aufs Display gedrückt, man kann ja bei den Clips draufklicken, so weiterschauen. Zumindest habe ich es geschafft, dass ich in meinem eigenen Stream gelandet bin und dann lief mein eigener Stream, während ich gepennt habe, auf dem Smartphone. Ey, das macht dich im Kopf fertig, du checkst überhaupt nichts, du denkst die ganze Zeit, warum hörst du dich selbst? Das war wirklich sehr, sehr merkwürdig. Hab ich letztens schon mal erzählt, ja ihr wisst ja, ich erzähle manche Sachen öfters, ich kann mir das einfach nicht mehr merken. C++ Marketing, die bräuchten ohne Scheiß, wisst ihr was die wirklich bräuchten? Was das C++ Gremium oder dieses C++ Standardisierungs, die, die bei C++ den Hut aufhaben, was die wirklich bräuchten? Ja, die bräuchten einen Marketing-Mensch und die bräuchten irgendjemanden, der gescheite, sinnvolle Roadmaps macht. Und nicht diesen Shit, den die da produzieren die letzten Jahre über. Dass die sagen, ey scheiß drauf, dass wir jetzt irgendwie die 85.000, was weiß ich, Abwandlung von Templates einbauen, wo kein Sau mehr durchblickt, sondern dass die mal mit Basics anfangen von aktuellen Sprachen. Zum Beispiel, dass du gescheites Library-Dependency-Management hast, dass dieser ganze Headershit wegkommt. Der ja theoretisch mit Modules ein bisschen abgeschwägt. Alter, das ist so schlecht. Naja. Stand-Spoiler eigentlich für den Zapp. Eingangshalle geht wieder huge. Ja, also sind wirklich, die am allermeisten sind hier aus der IT. Natürlich sind alle willkommen, auch wenn sie nicht in der IT sind. Wir sind ja inclusive hier. Ich freue mich über jeden Zuschauer. Und wenn ihr irgendwas aus diesen Streams hier mitnehmen könnt, freue ich mich. Bin ich, bin ich schon happy. Sind auch gar keine, immer nur 69 Abstimmungen, ja. Ups. Ich wollte es ausklappen, aber 80% waren es am Schluss. Das habe ich einfach instant geklaust. Ach, ich kann es aber im zweiten Bildschirm gucken. Ja, 80, 80 zu 20. Also alle Chatter-Innen sind hier willkommen, ja. Ja, das ist nicht verkehrt, das ist schade nichts. Das war, ich kann mich an meinen, ich kann mich noch an meinen ersten Arbeitstag erinnern. Ich kann mich noch an meinen ersten Arbeitstag erinnern. Da musste ich auf so eine Status-Runde. Das hieß damals noch nicht, hatte damals noch keinen agilen Namen. Das war ein ganz normales Status-Meeting. Und da standen dann irgendwie zehn Leute im Kreis. Und jeder hat mit Fachbegriffen um sich geworfen, wo ich das Gefühl hatte, die anderen verstehen das auch nicht und ich erst recht nicht. Das war ein ganz merkwürdiges Gefühl. Aber ich habe über die Jahre über mittlerweile realisiert, dass das heute immer noch so ist. Also, dass auf diesen Meetings die Leute irgendwie besonders schlau wirken wollen. Und dementsprechend jeder, oder aber sich nicht darin reinversetzen können, dass keiner eine Ahnung hat, was sie erzählen. Aber ich glaube, die meisten wollen besonders schlau wirken, dass dort die Leute absichtlich mit den abgedrehtesten Fachbegriffen um sich werfen, nur damit die anderen es nicht verstehen oder dass man denkt, das ist cool. Keine Ahnung. Ja, das kann man mal echt fragen. Das gute Hetzner-Placement. By the way, Ausrufezeichen Hetzner. Wer noch 20 Euro Startgut haben für seine Cloud-Abendbuyerbrauch hier. Mit meinem Code. Weißt du, wo das steht? Ja, Google. Das haben die selbst geschrieben. Docker wurde ja verkauft und zwei Wochen später wurde dann gesagt, Swarm juckt nicht mehr. Nee, das können wir aber tatsächlich machen. Das ist eine gute Idee. Ich brauche eine Packet Tracer-Version, die funktioniert. Klar, jeder darf zugucken. Du darfst sogar als Agile Head of Agile Coaching zugucken. Sogar noch schlimmer, sogar BWL-Leute dürfen zugucken, wenn sie wollen. Wobei ich mir dann noch überlege, ob das wirklich eine gute Idee ist. Aber ja, auch BWL-Leute dürfen zugucken. C-Sharp würde ich empfehlen. Meine absolute Lieblingsprogrammiersprache. Wenn du eine Programmiersprache willst, die hip ist und weit verbreitet. Wenn du Richtung AI und wissenschaftliche Sachen gucken willst und Automatisierung, wenn du Richtung Cloud, Tools und Google stellst, gucken willst, dann go. Aber ich würde C-Sharp empfehlen, meine absolut Lieblingsprogrammiersprache. C-Sharp ist eine Programmiersprache, die ist für Probleme aus der echten Welt gedacht. Was heißt, vergiss es. Komisches Wort, was ich mir mit dem Friseur zusammen ausgedacht habe. Hat keinen tieferen Sinn. Der Desktop, der ist Pongas. So muss das sein. Da findet man wenigstens was. Nein, Java würde ich nicht empfehlen. Also wenn ich heute jvmäßig anfangen würde, würde ich wahrscheinlich Kotlin verwenden. Und nicht Java. So Leute, ich habe den Chat durch. Alles klar. Leute, wir sehen uns morgen. Wahrscheinlich morgen nicht. Morgen muss ich das Azubi Video machen und das Telekom Video. Mal gucken. Mal gucken. Vielleicht sehen wir uns morgen auch. Ich bin mir noch nicht ganz sicher. Schauen wir mal. Bis denn. Alles Gute. Wir sehen uns. Tschüss.", "segments": [{"id": 1, "start": 0.0, "end": 19.16, "text": "Okay, das war jetzt keine DDoS Action wie das letzte Mal, das war jetzt wirklich Vodafone."}, {"id": 2, "start": 19.16, "end": 25.08, "text": "Das, das Kabelmodem hat sich einfach desyncht gerade."}, {"id": 3, "start": 25.08, "end": 42.92, "text": "Chat ist RIP, ja gut was soll ich machen ne?"}, {"id": 4, "start": 42.92, "end": 51.72, "text": "Chat ist RIP, aber warte mal vielleicht krieg ich den Chat wieder zum Laufen,"}, {"id": 5, "start": 51.72, "end": 61.64, "text": "wenn ich das einen ausblende. Vielleicht, vielleicht connectet er sich gleich wieder."}, {"id": 6, "start": 61.64, "end": 74.2, "text": "Mal gucken, mal gucken. Also das war auf jeden Fall jetzt kein, kein DDoS. Gut,"}, {"id": 7, "start": 74.2, "end": 77.72, "text": "habe ich meine IP irgendwo geleakt Leute? Hab ich meine, habe ich, habe ich wieder"}, {"id": 8, "start": 77.72, "end": 88.64, "text": "eine IP, Big IP Leak gemacht? Nee, habe ich nicht oder? Oh sopper, jetzt, jetzt habe ich"}, {"id": 9, "start": 88.64, "end": 93.8, "text": "es, jetzt habe ich es aber geleakt, super, ganz, ganz grandios. Hat ja wunderbar funktioniert."}, {"id": 10, "start": 93.8, "end": 104.0, "text": "Schön von Frankfurt bis Düsseldorf eine Störung. Ja wir gucken mal kurz Twitter,"}, {"id": 11, "start": 104.0, "end": 112.96, "text": "ob es da irgendwelche Vodafone geschenkt, weil das, das sah nicht nach, das sah nicht aus nach"}, {"id": 12, "start": 112.96, "end": 122.76, "text": "irgendwelchen DDoS Geschichten, sondern ganz normal nach Vodafone, weil Kabelmodem desyncht"}, {"id": 13, "start": 122.76, "end": 148.88, "text": "und sowas. Ah ja guck mal, alle Störungen. Wow, ok RIP. Vodafone, RIP. Wenn man nach Vodafone"}, {"id": 14, "start": 148.88, "end": 157.72, "text": "sucht ist hier. Guck mal, ist irgendwas mit Vodafone gerade? Ich und mein Mate Disconnecten"}, {"id": 15, "start": 157.72, "end": 168.2, "text": "ein gleichzeitig. Tja, ok, das wie gesagt war auch meine Vermutung es lag an Vodafone. Vielleicht,"}, {"id": 16, "start": 168.2, "end": 174.24, "text": "vielleicht passiert denen ja gerade das gleiche wie der Telekom, was ich gerade erzählt habe."}, {"id": 17, "start": 174.24, "end": 184.6, "text": "Ne, das kann nicht sein, dann würde es nicht so schnell wieder gehen, aber das wärs jetzt. Ja"}, {"id": 18, "start": 184.6, "end": 192.24, "text": "gut, was mache ich mit dem Chat jetzt? Der Chat ist jetzt, der Chat ist jetzt broken. Kann man"}, {"id": 19, "start": 192.24, "end": 204.64, "text": "hier refreshen? Refresh Browser When Scene Becomes Active, jawoll. Ah, Chat, wir sind back. Chat"}, {"id": 20, "start": 204.64, "end": 215.56, "text": "back. So, ok, wo sind wir denn jetzt stehen geblieben, nachdem Vodafone einfach desyncht hat?"}, {"id": 21, "start": 215.56, "end": 231.68, "text": "Ganz vergessen. Ja, irgendwo, irgendwo hier. Wenn den Trick die China-Chinesen erfahren. Ja,"}, {"id": 22, "start": 231.68, "end": 237.64, "text": "das ist glaube ich gar nicht aktuell so das Problem. Ich weiß nämlich nicht inwieweit"}, {"id": 23, "start": 237.64, "end": 247.08, "text": "BGP technisch den Reisschamp ist noch da. Ja, das lag eben an Vodafone, als ich hingekommen bin."}, {"id": 24, "start": 247.08, "end": 258.0, "text": "Das war das war abkacken mit Ansage. Hier ist der Link. Ok, schenke ich dir gleich. Ich weiß"}, {"id": 25, "start": 258.0, "end": 266.84, "text": "nicht, wie hoch so das Vertrauen in chinesische Provider ist BGP technisch. Keine Ahnung,"}, {"id": 26, "start": 266.84, "end": 270.88, "text": "ob das ein größeres Problem ist. Aber ja, die China-Chinesen sollten vielleicht auch nicht"}, {"id": 27, "start": 270.88, "end": 277.96, "text": "Missed Announcen. Oh ja, ganz großes Default Bild hier gewesen. Also, ab 1. August erhöhnt"}, {"id": 28, "start": 277.96, "end": 283.16, "text": "sich der Preis für neu erstellte Floating IPs. Ok, das dachte ich mir. Ach, für neu erstellte"}, {"id": 29, "start": 283.16, "end": 298.48, "text": "Cloud-Surfer wie unten angegeben. Das ist aber teuer. Ja, ok. Was heißt teuer? Aber teurer."}, {"id": 30, "start": 298.48, "end": 303.8, "text": "Es ist teuer, doch das ist echt teuer. Insgesamt geht das immer noch klar, aber das ist schon"}, {"id": 31, "start": 303.8, "end": 312.32, "text": "ganz ordentlich teuer. Teurer, ja. Wann kommt das nächste Tipp-Video für angehende Anzug?"}, {"id": 32, "start": 312.32, "end": 318.72, "text": "Ich versuche das irgendwann am Wochenende noch zu machen. Aber vorzuschieben, weil ich"}, {"id": 33, "start": 318.72, "end": 324.2, "text": "weiß, dass für viele erst der erste bzw. der zweite achte Arbeitstag ist. Erster Arbeitstag"}, {"id": 34, "start": 324.2, "end": 332.44, "text": "ist. Preise für Server erhöhen sich. Na, Preise für Server erhöhen sich hauptsächlich"}, {"id": 35, "start": 332.44, "end": 336.8, "text": "wegen der IP-Adresse, oder? Weil die immer mehr Probleme bekommen, IPv4-Adressen zu"}, {"id": 36, "start": 336.8, "end": 343.32, "text": "bekommen. Leute, ich verstehe es bis heute nicht, ne? Wir haben einen auf der Arbeit,"}, {"id": 37, "start": 343.32, "end": 349.0, "text": "der hat früher beim Denik gearbeitet. Und er hatte noch ein persönliches, ich sage jetzt"}, {"id": 38, "start": 349.0, "end": 352.32, "text": "einfach mal, ich bin mir ehrlich gesagt nicht sicher, was er hatte. Ich glaube, der hatte"}, {"id": 39, "start": 352.32, "end": 359.72, "text": "noch ein persönliches Slash-12-Netz von seiner Arbeit da. Und was heißt persönliches? Der"}, {"id": 40, "start": 359.72, "end": 367.48, "text": "hatte quasi noch, war Besitzer eines IPv4-Slash-12. Was der hätte damit für Kohle machen können?"}, {"id": 41, "start": 367.48, "end": 375.6, "text": "Der hat es aber einfach, stellt euch mal vor, selbstlos wie er ist, er hat das einfach"}, {"id": 42, "start": 375.6, "end": 380.36, "text": "zurückgegeben, hat gesagt, macht mal damit. Der hätte es nicht zurückgeben sollen, der"}, {"id": 43, "start": 380.36, "end": 384.36, "text": "hätte erstmal Big Stonks damit machen sollen. Aber wollte nicht, er hat es einfach zurückgegeben."}, {"id": 44, "start": 384.36, "end": 396.64, "text": "Ich weiß nicht, ob es ein Slash-12 war, vielleicht war es auch nur ein Slash-20. Was heißt nur?"}, {"id": 45, "start": 396.64, "end": 404.56, "text": "Nur ein Slash-20. Aber es war ordentlich auf jeden Fall. Na gut, dann wird es halt ein"}, {"id": 46, "start": 404.56, "end": 410.08, "text": "bisschen teurer. Warum verifizieren, das ist eine gute Frage, warum verifizieren die"}, {"id": 47, "start": 410.08, "end": 416.76, "text": "andere Router nicht, mit welchem Präfix? Was? Nicht, mit welchen Präfix? Tja, das sieht"}, {"id": 48, "start": 416.76, "end": 424.16, "text": "BGP so nicht direkt vor. Es gibt wohl Alternifizierungsmechanismen, die aber so gut wie niemand verwendet aktuell."}, {"id": 49, "start": 424.16, "end": 432.28, "text": "Und da muss man wahrscheinlich extern irgendwas skrippen und basteln. Aber Microsoft macht"}, {"id": 50, "start": 432.28, "end": 438.28, "text": "das nicht. Oder haben das nicht gemacht. Das wirft nicht unbedingt ein gutes Licht auf"}, {"id": 51, "start": 438.28, "end": 442.6, "text": "die Netzwerkadmins von Microsoft. Das kann man machen, hat haben sie aber nicht gemacht."}, {"id": 52, "start": 442.6, "end": 456.88, "text": "BGP kann man im Packet Tracer simulieren. Gibt es in Packet Tracer noch kostenlos?"}, {"id": 53, "start": 456.88, "end": 464.64, "text": "Früher konnte man sich Packet Tracer installieren. Das richtig cooles Tool für Netzwerksachen"}, {"id": 54, "start": 464.64, "end": 477.08, "text": "zum Üben. Download Packet Tracer. Oder braucht man da, oder braucht man da irgendeinen Account"}, {"id": 55, "start": 477.08, "end": 489.48, "text": "für? Probier das jetzt einfach mal aus zu installieren. 7-7-3-8-0. Dann installieren"}, {"id": 56, "start": 489.48, "end": 493.64, "text": "wir den neuesten Packet Tracer. Du brauchst ein Cisco Login und ein Cisco Login kriegt"}, {"id": 57, "start": 493.64, "end": 500.4, "text": "man nicht kostenlos wahrscheinlich, oder? Hast du noch die Website? Ja, hier, Preischamp."}, {"id": 58, "start": 500.4, "end": 504.88, "text": "Aber wie gesagt, so aktuell mit Grafikkarten ist das nicht. Die, die drin sind, sind aktuell,"}, {"id": 59, "start": 504.88, "end": 512.36, "text": "aber die anderen nicht wirklich. Ok, ich teste jetzt mal, ob man da ein Cisco Login für"}, {"id": 60, "start": 512.36, "end": 524.88, "text": "brauche. Testen wir jetzt mal. Ah, nice, sehr gut, easy, GG. Lass mal updaten, vielleicht"}, {"id": 61, "start": 524.88, "end": 534.36, "text": "bringt das was. Ok, ich lass ihn mal nehmen bei updaten. Du musst glaube ich nur Student"}, {"id": 62, "start": 534.36, "end": 538.64, "text": "sein. Kann man das Cisco irgendwie faken, dass man Student ist? Kann man sich da anmelden"}, {"id": 63, "start": 538.64, "end": 542.72, "text": "und sagen, ich bin Student, ohne dass sie das überprüfen? Frag einfach den Sebaro,"}, {"id": 64, "start": 542.72, "end": 551.4, "text": "der kann sich da anmelden als Student. Ja, das wird schon irgendwie klappen. Das kann"}, {"id": 65, "start": 551.4, "end": 556.76, "text": "durchaus sein, dass er das machen wollte, ja. Ich gehe auch mal davon aus, es war irgendein"}, {"id": 66, "start": 556.76, "end": 571.28, "text": "Tippfehler. Ja, das macht nix. Ich muss nur, wie sagt man so schön, so ahead of the curve"}, {"id": 67, "start": 571.28, "end": 575.48, "text": "oder wie das heißt sein. Dann macht mir das nix. Ich muss immer der Erste sein, der mehr"}, {"id": 68, "start": 575.48, "end": 586.72, "text": "bekommt, dann ist es egal. Dann bekomme ich immer mehr. Stonks, genau. Ja, das ist letztendlich"}, {"id": 69, "start": 586.72, "end": 592.8, "text": "so. Du hast schon recht, also ich gehe auch nicht davon aus, dass IPv4 jemals, zumindest"}, {"id": 70, "start": 592.8, "end": 599.88, "text": "nicht zu meinen Lebzeiten abgeschaltet wird, aber ich gehe nicht davon aus, dass ich zu"}, {"id": 71, "start": 599.88, "end": 607.6, "text": "meinen Lebzeiten noch erlebe, dass IPv4 so unwichtig ist, bzw. dass es komplett problemlos"}, {"id": 72, "start": 607.6, "end": 614.06, "text": "mit IPv6 alles, was man so machen will, läuft. Irgendwie sehe ich es einfach nicht. Das hätte"}, {"id": 73, "start": 614.06, "end": 628.44, "text": "schon die letzten zehn Jahre über passieren müssen und ist es nicht. Ja, feels cozy man."}, {"id": 74, "start": 628.44, "end": 633.36, "text": "Das wäre natürlich cool, wobei, ja gut, du bekommst eine IPv6 Adresse, das stimmt, aber"}, {"id": 75, "start": 633.36, "end": 643.52, "text": "du kannst IPv4 wahrscheinlich nicht abhaken. Apple Mobile Apps müssen IPv6 auch nicht"}, {"id": 76, "start": 643.52, "end": 646.84, "text": "funktionieren. Das kann ja sein, aber das bringt dir nix, wenn du eine Webseite aufmachen"}, {"id": 77, "start": 646.84, "end": 654.72, "text": "willst, die nicht IPv6 angebunden ist. Ja, es sind theoretisch alle IPv4 Adressen schon"}, {"id": 78, "start": 654.72, "end": 661.6, "text": "vergeben, aber es gibt einen reigen Handel mit IPv4 Adressen. Also man kann noch IPv4"}, {"id": 79, "start": 661.6, "end": 668.2, "text": "Adressen bekommen. Das ist dann eventuell teilweise auch ein bisschen halboffiziell,"}, {"id": 80, "start": 668.2, "end": 681.08, "text": "aber das geht und das machen auch viele noch. Was sagt ihr zu dem Emote? Brauchen wir das?"}, {"id": 81, "start": 681.08, "end": 688.36, "text": "Das kann man aber noch ein bisschen verschönern, oder? Ist das so? Ja komm, wir machen das"}, {"id": 82, "start": 688.36, "end": 698.48, "text": "jetzt rein. Bettge. Das geht besser, finde ich auch. Das kann man noch ein bisschen schöner"}, {"id": 83, "start": 698.48, "end": 705.72, "text": "machen. Ich finde das sehr gut, das Emote, aber ich glaube das können wir noch ein bisschen"}, {"id": 84, "start": 705.72, "end": 716.36, "text": "schöner machen. Das der lacht finde ich schon mal gut. Aber ich mache es vorläufig rein."}, {"id": 85, "start": 716.36, "end": 728.28, "text": "Ich speichere mir das mal. Wie nennen wir das? Wupp Bett. Ich mache das schon vorläufig"}, {"id": 86, "start": 728.28, "end": 731.72, "text": "rein am Steam. So, ich wollte jetzt gucken ob ich den Packet Tracer installiert kriege."}, {"id": 87, "start": 731.72, "end": 739.64, "text": "Packet Tracer. Und wie man sich da anmelden kann? Nö, gibt's nicht. Okay. Ups. Also den"}, {"id": 88, "start": 739.64, "end": 742.56, "text": "gibt's nicht immer zum installieren. Dann installieren wir jetzt einfach was Altes,"}, {"id": 89, "start": 742.56, "end": 751.48, "text": "was es wahrscheinlich noch gibt. Den da. 6, 2. Bam. Yes. No. Okay, da muss ich mal gucken."}, {"id": 90, "start": 751.48, "end": 759.28, "text": "Zumindest das Packet Tracer wäre eine coole Sache um das mal auszuprobieren. Bin ich"}, {"id": 91, "start": 759.28, "end": 774.92, "text": "beruhigt. Wie gesagt, ich gucke, dass ich das am Wochenende hochgeladen kriege."}, {"id": 92, "start": 789.28, "end": 797.24, "text": "Das wird in nächster Zeit schwierig. Also es wird ja immer besser bei Grafikkarten oder"}, {"id": 93, "start": 797.24, "end": 801.68, "text": "wurde jetzt besser, aber die ganze Knappheit macht halt alles saumäßig toll. Bei uns"}, {"id": 94, "start": 801.68, "end": 806.04, "text": "auf der Arbeit ist es bei The Way mittlerweile schon so schlimm. Flashbang, Alter. Bei uns"}, {"id": 95, "start": 806.04, "end": 810.48, "text": "auf der Arbeit ist es mittlerweile schon so schlimm, dass die gar keine neuen Notebooks"}, {"id": 96, "start": 810.48, "end": 815.12, "text": "mehr bekommen für die Mitarbeiter. Die versuchen neue Notebooks zu kaufen und kriegen keine."}, {"id": 97, "start": 815.12, "end": 824.52, "text": "Dass die China-Chinesen H2-IPv6 pushen, wundert mich nicht. Die sind ja late bei der Party"}, {"id": 98, "start": 824.52, "end": 830.88, "text": "gewesen. Das heißt, die kriegen umso schwieriger IPv4. Hast du das Projekt? Ja, das kenne ich"}, {"id": 99, "start": 830.88, "end": 838.08, "text": "schon. Hat mich jetzt aber nicht so überzeugt, weil es ein ziemliches Gebastel ist. Ich hab"}, {"id": 100, "start": 838.08, "end": 845.68, "text": "mir eine billige KVM und eine billige Remote. Wie nennt man das? Das ist ja nicht wirklich"}, {"id": 101, "start": 845.68, "end": 851.8, "text": "eine KVM, das ist nur für einen Server. Ich hab mir so eine billige Remote-Lösung gekauft,"}, {"id": 102, "start": 851.8, "end": 857.32, "text": "Stöpselstöpfer per VGA oder HDMI oder Displayport dran, an den Rechner und per USB und dann"}, {"id": 103, "start": 857.32, "end": 865.32, "text": "kannst du dich über den Browser dran connecten. Also so, als würdest du davor sitzen. Irgendwie"}, {"id": 104, "start": 865.32, "end": 871.04, "text": "120 Euro auf Ebay. Irgendwas Gebrauchtes gekauft dafür. Das finde ich besser als dieses selbstgebastelte"}, {"id": 105, "start": 871.04, "end": 880.64, "text": "Ding. IPv1? Nein, wenn du was Neues machst. Wie wäre es denn mit IPv5 dazwischen? Das"}, {"id": 106, "start": 880.64, "end": 887.92, "text": "haben wir doch nicht. Das machen die einfach wie IPv4. Die behalten quasi den ganzen ollen"}, {"id": 107, "start": 887.92, "end": 893.6, "text": "Scheiß, den die Leute mögen an IPv4. So von Natt bis bis dem ganzen Müll, der bei"}, {"id": 108, "start": 893.6, "end": 899.12, "text": "IPv4 drin ist, und machen einfach nur mehr Adressen. Das wäre doch mal eine Stonks-Lösung."}, {"id": 109, "start": 899.12, "end": 907.56, "text": "Vielleicht sollten wir das verkaufen. Ich meint es gab auch S10G. Guckt mal, bei Netzwerk"}, {"id": 110, "start": 907.56, "end": 915.72, "text": "für daheim. Es gab auch S10G und jetzt gibt es 5G und 2,5G. Warum sollten die nicht jetzt,"}, {"id": 111, "start": 915.72, "end": 920.76, "text": "wenn sie merken, wir versuchen seit 20 Jahren IPv6 durchzusetzen und es klappt nicht, warum"}, {"id": 112, "start": 920.76, "end": 945.08, "text": "sollten sie jetzt nicht einfach IPv5 machen? Oder IPv6NG. Oder sowas. Ja, ich suche mir"}, {"id": 113, "start": 945.08, "end": 951.0, "text": "für die Badges welche. Bist du das zu keiner Ahnung von, das sind die, die wir haben,"}, {"id": 114, "start": 951.0, "end": 959.84, "text": "aber nicht schlecht. Gab es das? Habe ich nicht. Habe ich nicht verfolgt. Naja. Bei"}, {"id": 115, "start": 959.84, "end": 968.96, "text": "der Gelegenheit erstmal eine Runde Aquarium entspannen. Der Titel ist heute by the way"}, {"id": 116, "start": 968.96, "end": 972.88, "text": "Programm. Ich habe mich jetzt über ein paar aktuelle Sachen ausgelassen und jetzt habe"}, {"id": 117, "start": 972.88, "end": 977.12, "text": "ich absolut keine Ahnung mehr, was ich machen soll. Ich habe gedacht, ich komme einfach"}, {"id": 118, "start": 977.12, "end": 995.56, "text": "nur mal on und gut ist. Kein Stream ist ja der Eis. Hackerman Action. Ja, was soll ich"}, {"id": 119, "start": 995.56, "end": 1003.52, "text": "denn Hackerman? War mal ein Vorschlag. BDO Kreisel. Ich habe, habe ich BDO, ich habe,"}, {"id": 120, "start": 1003.52, "end": 1016.44, "text": "ich habe BDO gar nicht installiert. Nee. Nee. Peeway habe ich auch nicht mal installiert."}, {"id": 121, "start": 1016.44, "end": 1022.84, "text": "Alles runter geschmissen. Ja, wie gesagt, das ist klar, dass sie das pushen wollen. Das"}, {"id": 122, "start": 1022.84, "end": 1027.8, "text": "ist unglaublich. Die Chinesen, die pushen ja in so ziemlich allem aktuell. Also wenn"}, {"id": 123, "start": 1027.8, "end": 1033.92, "text": "man sich überlegt euch mal, wo die Chinesen technologisch gewesen sind vor, keine Ahnung,"}, {"id": 124, "start": 1033.92, "end": 1040.44, "text": "es reicht ja schon vor 20 Jahren, da hast du die belacht, da hast du im besten Fall,"}, {"id": 125, "start": 1040.44, "end": 1044.32, "text": "da hast du im besten Fall gesagt, du kannst dir irgendwelche billig, billig kopierten"}, {"id": 126, "start": 1044.32, "end": 1050.12, "text": "und geklauten Produkte in China kaufen und heute bauen die in manchen Bereichen schon"}, {"id": 127, "start": 1050.12, "end": 1055.92, "text": "mit die beste Hardware. Guckt euch Xiaomi Smartphones an, guckt euch die Roborock Staubsaugerroboter"}, {"id": 128, "start": 1055.92, "end": 1062.28, "text": "an. Also das ist schon lange nicht mehr so, dass die, dass die chinesischen, Chinesen,"}, {"id": 129, "start": 1062.28, "end": 1070.76, "text": "China, Chinesen da kacke herstellen. Die haben aktuell finde ich eine super Mischung aus"}, {"id": 130, "start": 1070.76, "end": 1078.8, "text": "copy paste, low price, qualitativ fragwürdigen Shit und richtig gute Sachen, die aber auch"}, {"id": 131, "start": 1078.8, "end": 1091.52, "text": "preisleistungsmäßig meistens relativ gut sind. Also die Chinesen, es ist jetzt nicht"}, {"id": 132, "start": 1091.52, "end": 1095.72, "text": "so, dass man sich forscht, also technologisch, ich rede jetzt nicht irgendwie was die sonst"}, {"id": 133, "start": 1095.72, "end": 1099.92, "text": "machen, aber rein von der Technologie her werden wir uns darauf einstellen müssen,"}, {"id": 134, "start": 1099.92, "end": 1105.8, "text": "dass uns China, ich meine eingeholt haben die uns ja fast schon. China ist halt groß,"}, {"id": 135, "start": 1105.8, "end": 1109.92, "text": "es braucht da alles ein bisschen, bis das dann auch komplett adopted ist alles, aber"}, {"id": 136, "start": 1109.92, "end": 1114.4, "text": "sagen wir so eingeholt haben die uns ja mehr oder weniger schon mittlerweile. Die werden"}, {"id": 137, "start": 1114.4, "end": 1118.96, "text": "uns in den nächsten 20 Jahren aber sowas von abhängen, nachdem wir auch nicht in der"}, {"id": 138, "start": 1118.96, "end": 1123.08, "text": "Lage sind irgendwelche zukunftsfähigen Sachen zu machen. Wir wollen ja lieber zurück in"}, {"id": 139, "start": 1123.08, "end": 1129.32, "text": "die Steinzeit anstatt zukunftsfähige Sachen machen. Die werden uns sowas von abhängen,"}, {"id": 140, "start": 1129.32, "end": 1140.68, "text": "so schnell kannst du grad gucken. Fangen wir am 1.9. eine Ausbildung zum fahrinformatik"}, {"id": 141, "start": 1140.68, "end": 1145.96, "text": "anwendungsentwicklung an, dank dir, nice, white pepo happy, ja sehe ich auch so, richtig"}, {"id": 142, "start": 1145.96, "end": 1159.48, "text": "heckerman geht los. Die machen ipv6 nut, kann ich mir grad vorstellen, wer macht ein ipv6"}, {"id": 143, "start": 1159.48, "end": 1165.56, "text": "nut, ja das kenne ich, das ist auch dieser netzwerksimulator, da braucht man aber ein"}, {"id": 144, "start": 1165.56, "end": 1170.0, "text": "echtes bios von den netzwerkgeräten und sowas, da finde ich den packetray schon deutlich"}, {"id": 145, "start": 1170.0, "end": 1176.56, "text": "cooler, dass du auch ein GUI dabei hast, wo du dann siehst wie Pakete langlaufen und sowas"}, {"id": 146, "start": 1176.56, "end": 1185.44, "text": "und das ist nicht ganz so kompliziert. Kennst du crossing? Nee, sagt mir nix. Across NG?"}, {"id": 147, "start": 1185.44, "end": 1193.32, "text": "Nee, keine Ahnung, aber NG ist sag mal mal ein beliebter, in der open source Szene beliebter"}, {"id": 148, "start": 1193.32, "end": 1200.12, "text": "Name für Projekte, die geforkt werden, die heißen dann immer NG. Das wird nix mehr,"}, {"id": 149, "start": 1200.12, "end": 1205.28, "text": "also mit dem kaboom vielleicht, mit dem giga hab ich wenig kontakten, da hab ich ja keinen"}, {"id": 150, "start": 1205.28, "end": 1218.76, "text": "Bock mehr was aufzunehmen für youtube. Ja genau, giga z deckt telephone, eindeutig,"}, {"id": 151, "start": 1218.76, "end": 1234.76, "text": "technologieführer. Es wird über kurz oder lang so sein, dass wahrscheinlich Leute freiwillig"}, {"id": 152, "start": 1234.76, "end": 1240.24, "text": "hier mandarin beziehungsweise chinesisch lernen, weil sie dort besser ihren kram verkaufen"}, {"id": 153, "start": 1240.24, "end": 1260.76, "text": "können. Schauen deine Kollegen deine Videos, ähm, teilweise, wenig, wenig, wenig, ein"}, {"id": 154, "start": 1260.76, "end": 1264.6, "text": "paar wissen es, ein paar wissen es, ein paar gucken auch. Beispielsweise letztens erst"}, {"id": 155, "start": 1264.6, "end": 1268.24, "text": "mit dem Azubi telefoniert, mit dem letzten Azubi, den wir noch haben, der hat gesagt,"}, {"id": 156, "start": 1268.24, "end": 1272.76, "text": "ich hab mal ein Video geguckt, wo ich erzählt hab, wieviel ich verdiene. Natürlich bestes"}, {"id": 157, "start": 1272.76, "end": 1278.68, "text": "Einstiegsthema überhaupt, aber ansonsten gibt ein paar, die gucken, aber die meisten"}, {"id": 158, "start": 1278.68, "end": 1283.12, "text": "wissen das nicht. Der Chef schaut zu, das ist theoretisch möglich, von dem weiß ich,"}, {"id": 159, "start": 1283.12, "end": 1290.08, "text": "dass der öfters mal twitch guckt. Jetzt nicht unbedingt bei mir, aber twitch. Warum war"}, {"id": 160, "start": 1290.08, "end": 1295.76, "text": "das neuste Video kein IT-Mythen? Weil's Mythen die Mehrzahl ist. Genau, weil's so ein Mythos"}, {"id": 161, "start": 1295.76, "end": 1300.64, "text": "war und der Titel bisschen besser ist, weil clickbaitiger, obwohl der Inhalt stimmt."}, {"id": 162, "start": 1300.64, "end": 1310.28, "text": "Ja, aber wenn du mal guckst, wieviel die schon versuchen, die kriegen's vielleicht"}, {"id": 163, "start": 1310.28, "end": 1316.76, "text": "noch nicht richtig gut hin, aber gib denen mal noch ein paar Jahre. Sie versuchen ja"}, {"id": 164, "start": 1316.76, "end": 1321.48, "text": "auch schon eigene CPU-Architekturen und sowas. Also, die Chinesen haben halt einen großen"}, {"id": 165, "start": 1321.48, "end": 1329.08, "text": "Vorteil. Die haben Leute in Massen und die haben auch weniger Probleme. Man kann das"}, {"id": 166, "start": 1329.08, "end": 1332.2, "text": "jetzt als Vorteil oder Nachteil sehen, aber ich sag das jetzt einfach mal. Die haben da"}, {"id": 167, "start": 1332.2, "end": 1339.72, "text": "auch weniger moralische Probleme bei manchen Sachen. Ich drück das mal so aus. Das wird"}, {"id": 168, "start": 1339.72, "end": 1346.96, "text": "entweder gemacht oder, keine Ahnung, du fliegst ins Beton-Fundament und wirst einbetoniert"}, {"id": 169, "start": 1346.96, "end": 1369.6, "text": "so nach dem Otto. Chefku- Keine Ahnung. Haben die auch nicht? Noch nicht. Noch nicht. Noch"}, {"id": 170, "start": 1369.6, "end": 1374.52, "text": "nicht. Aber ich könnte mir gut vorstellen, dass die Chinesen das früher oder später"}, {"id": 171, "start": 1374.52, "end": 1380.28, "text": "auch merken werden, dass sie an Umweltschutz nicht vorbeikommen. Das kann aber noch dauern"}, {"id": 172, "start": 1380.28, "end": 1386.2, "text": "und ob das rechtzeitig passieren wird, sei mal dahingestellt. Aber früher oder später"}, {"id": 173, "start": 1386.2, "end": 1389.96, "text": "kommen die da wahrscheinlich auch nicht dran vorbei. Aber aktuell, ja, ist das denen ziemlich"}, {"id": 174, "start": 1389.96, "end": 1401.36, "text": "egal. Wobei ich mir da gar nicht mal so sicher bin. Man hat ja schon öfters gesehen, sobald"}, {"id": 175, "start": 1401.36, "end": 1407.36, "text": "es den Leuten ein bisschen besser geht, dass sie nicht mehr von tagtäglich ans Überleben"}, {"id": 176, "start": 1407.36, "end": 1413.72, "text": "denken müssen, dann sind die relativ schnell dabei, dass sie sowas auch nicht gut finden."}, {"id": 177, "start": 1413.72, "end": 1420.4, "text": "Mal gucken, mal gucken, wir werden mal gespannt. Zumindest, was ich eigentlich sagen wollte"}, {"id": 178, "start": 1420.4, "end": 1425.88, "text": "ist, die haben uns mehr oder weniger, was Technologie angeht, schon fast eingeholt."}, {"id": 179, "start": 1425.88, "end": 1431.96, "text": "Vielleicht nicht überall, aber fast. Und die nächsten 20 Jahre, machen die uns platt?"}, {"id": 180, "start": 1431.96, "end": 1440.76, "text": "Also sinnbildlich, ja. Und wir sind ja aktuell eher damit beschäftigt, uns selbst zu zerfleischen"}, {"id": 181, "start": 1440.76, "end": 1445.76, "text": "mit irgendwelchen Themen, anstatt die Weichen so für die Zukunft zu stellen oder mal zukunftsfähige"}, {"id": 182, "start": 1445.76, "end": 1450.48, "text": "Technologien zu entwickeln. Oder sich mal wenigstens öffentlich Gedanken drüber zu"}, {"id": 183, "start": 1450.48, "end": 1456.16, "text": "machen, dass man sowas vielleicht tun sollte. Aber wir zerfleischen uns aktuell richtig"}, {"id": 184, "start": 1456.16, "end": 1460.72, "text": "krass selbst. Das machen wir aber nicht nur wir. In den USA ist das auch so, wenn diese"}, {"id": 185, "start": 1460.72, "end": 1468.76, "text": "ganzen, diese ganze Selbstzerfleischungsbewegung kommt ja so ein bisschen aus den USA. Oder"}, {"id": 186, "start": 1468.76, "end": 1486.16, "text": "haben die Chinesen kein Problem mit? Ja, das verstehe ich ehrlich gesagt auch nicht so"}, {"id": 187, "start": 1486.16, "end": 1493.76, "text": "genau, weil wenn doch unmittelbar, also das leuchtet mir auch nicht ein, warum man das"}, {"id": 188, "start": 1493.76, "end": 1499.88, "text": "in dieser Reihenfolge machen will. Kohlekraft ist doch erst mal zumindest kurzfristiger,"}, {"id": 189, "start": 1499.88, "end": 1503.64, "text": "also vielleicht habe ich überhaupt, vielleicht liege ich auch total falsch, aber das verstehe"}, {"id": 190, "start": 1503.64, "end": 1508.48, "text": "ich nicht so genau. Kohlekraft ist doch auf jeden Fall kurzfristiger, klimatechnisch das"}, {"id": 191, "start": 1508.48, "end": 1512.32, "text": "größere Problem. Ja, du hast bei Atomkraftwerken natürlich das riesen Problem, dass du nicht"}, {"id": 192, "start": 1512.32, "end": 1521.52, "text": "weißt, wohin mit der ganzen Scheiße. Aber wenn es jetzt gerade so das unmittelbare Klimaproblem"}, {"id": 193, "start": 1521.52, "end": 1528.64, "text": "ausgelöst wird mit von Kohlekraft, dann ist halt die Frage, okay, wenn man es unmittelbar"}, {"id": 194, "start": 1528.64, "end": 1532.64, "text": "damit größere Katastrophen abwenden können, warum macht man es dann so rum und nicht anders"}, {"id": 195, "start": 1532.64, "end": 1537.88, "text": "rum? Das verstehe ich auch nicht. Leuchtet mir nicht ein und dass es Probleme gibt, streitet"}, {"id": 196, "start": 1537.88, "end": 1541.48, "text": "da mittlerweile wohl kaum auch noch eine ab. Die Frage, um die sich aktuell dreht, ist"}, {"id": 197, "start": 1541.48, "end": 1548.92, "text": "eher, worüber diskutiert wird, kann der Mensch was dafür oder nicht? Also die Sache mit,"}, {"id": 198, "start": 1548.92, "end": 1553.36, "text": "wir bezweifeln, dass es so etwas, dass es Klimawandel was gibt, sagt ja eigentlich kaum"}, {"id": 199, "start": 1553.36, "end": 1571.44, "text": "noch einer. Ja, da hast du auch, da hast du auch Leute, die teilweise übelst schwach"}, {"id": 200, "start": 1571.44, "end": 1575.24, "text": "sind, erzählen. Aber ich kann mir nicht, bei Trump weiß ich, der erzählt ja auch, man"}, {"id": 201, "start": 1575.24, "end": 1581.08, "text": "soll Desinfektionsmittel trinken und sowas. Ja, und klar, die AfD hat sicherlich auch"}, {"id": 202, "start": 1581.08, "end": 1588.84, "text": "viele Leute, die sehr weltfremde Sachen erzählen, aber dass die zum überwiegenden Teil sagen,"}, {"id": 203, "start": 1588.84, "end": 1595.48, "text": "dass es den Klimawandel nicht gibt, das kann ich mir nicht mal bei denen vorstellen. China,"}, {"id": 204, "start": 1595.48, "end": 1600.68, "text": "Chinesen, Virus, naja, gut, ich will es jetzt nicht so sehr aus, das ist immer ein schwieriges,"}, {"id": 205, "start": 1600.68, "end": 1607.96, "text": "sehr strengendes Thema. Was machen eigentlich so die aktuellen Umfragewerte? Umfrage, Bundestagswahl"}, {"id": 206, "start": 1607.96, "end": 1622.84, "text": "2021, wie sieht das aus? Was haben wir da so, taugt die Seite was? Also CDU ist bei 28,2,"}, {"id": 207, "start": 1622.84, "end": 1633.0, "text": "null Schett, 18,4 die Grünen. Warum hat die SPD eigentlich so viel? Das ist für mich"}, {"id": 208, "start": 1633.0, "end": 1642.0, "text": "die unsympathische Partei von allen. Das kann ich dir verstehen, ich. Das habe ich keinen"}, {"id": 209, "start": 1642.0, "end": 1648.8, "text": "Schimmer. Haben die mehr als das letzte Mal? Nee, oder? Warum haben die überhaupt noch"}, {"id": 210, "start": 1648.8, "end": 1656.36, "text": "so viel? Also ich habe es ja schon öfters gesagt, ich tendiere tatsächlich aktuell"}, {"id": 211, "start": 1656.36, "end": 1659.4, "text": "zu, ich will mich da jetzt aber nicht länger darüber auslassen, weil ich weiß, es sieht"}, {"id": 212, "start": 1659.4, "end": 1667.08, "text": "jeder ein bisschen an, ich persönlich tendiere ja aktuell zur FDP. Mal gucken, ich bin mal"}, {"id": 213, "start": 1667.08, "end": 1670.6, "text": "gespannt, mal gucken, ob mich noch jemand überzeugen kann, dass ich wirklich sage, so"}, {"id": 214, "start": 1670.6, "end": 1674.32, "text": "wirklich überzeugt haben die mich nämlich auch hundertprozentig nicht. Vielleicht kommt"}, {"id": 215, "start": 1674.32, "end": 1678.84, "text": "ja noch irgendwie, ich gucke ja in letzter Zeit auch immer öfters ein bisschen Fragerunden"}, {"id": 216, "start": 1678.84, "end": 1683.16, "text": "und sonst was, vielleicht kommt ja noch irgend einer, wo ich sage, ey das überzeugt mich"}, {"id": 217, "start": 1683.16, "end": 1691.12, "text": "jetzt richtig und nehm noch was anderes. Ja, ohne Scheiß, das habe ich sogar mal gemacht,"}, {"id": 218, "start": 1691.12, "end": 1699.08, "text": "also ich habe ja mal eine Zeit lang Piraten für Internet gewählt und Zeug. Ich würde"}, {"id": 219, "start": 1699.08, "end": 1703.68, "text": "auch sowas wie die Tierschutzpartei wählen, ohne Mist, das Problem ist nur, das ist verschenkt."}, {"id": 220, "start": 1703.68, "end": 1715.88, "text": "Die haben keine Chance irgendwie da rein zu kommen, die Tierschutzpartei und dann ist"}, {"id": 221, "start": 1715.88, "end": 1722.76, "text": "deine Stimme im Endeffekt verschenkt, weil das wird ja alles rausgerechnet, also wenn"}, {"id": 222, "start": 1722.76, "end": 1727.8, "text": "jetzt ganz viele Leute nicht wählen oder sagen wir mal ungültig wählen, nicht wählen"}, {"id": 223, "start": 1727.8, "end": 1731.32, "text": "oder na gut, nicht wählen taucht da nicht auf, aber sagen wir mal ungültig wählen"}, {"id": 224, "start": 1731.32, "end": 1737.08, "text": "oder keine Ahnung, so Kleinparteien wählen, dann hast du das Problem, dass du dann beispielsweise"}, {"id": 225, "start": 1737.08, "end": 1743.2, "text": "auch Mehrheiten hast unter 50%, weil das aus der Gesamtsumme dann wieder rausgerechnet"}, {"id": 226, "start": 1743.2, "end": 1750.56, "text": "wird, also das bringt leider nichts, so gerne ich vielleicht auch sowas mal hier so was"}, {"id": 227, "start": 1750.56, "end": 1755.72, "text": "unterstützen würde, es ist halt verschenkt. Die sind richtig weird, ich habe die Piraten"}, {"id": 228, "start": 1755.72, "end": 1760.56, "text": "vor 10 Jahren oder so gewählt, als die neu waren und ich vom Ansatz her das gut fand,"}, {"id": 229, "start": 1760.56, "end": 1764.52, "text": "dass es mal eine Partei gibt, die sagt, hey wir setzen uns für Infrastruktur, Technologie"}, {"id": 230, "start": 1764.52, "end": 1775.44, "text": "und Internet ein, die haben sich aber dann auch selbst irgendwie eliminiert und seit"}, {"id": 231, "start": 1775.44, "end": 1778.24, "text": "den letzten paar Jahren interessiert sich ja keiner mehr für, die treten ja zum größten"}, {"id": 232, "start": 1778.24, "end": 1789.88, "text": "Teil sogar gar nirgendswo mal richtig an, unter 5% ist bloated, naja ich bin echt gespannt,"}, {"id": 233, "start": 1789.88, "end": 1795.76, "text": "was da rauskommt, also diesmal wirklich noch mehr als das letzte Mal, ich hoffe nur inständig,"}, {"id": 234, "start": 1795.76, "end": 1801.84, "text": "dass es nicht noch mal auf groß, wobei große Koalition kann es ja nicht mehr geben, ich"}, {"id": 235, "start": 1801.84, "end": 1806.86, "text": "gehe davon aus, dass die Grünen mehr bekommen als die Linken, äh ja, dass die Grünen mehr"}, {"id": 236, "start": 1806.86, "end": 1810.6, "text": "bekommen als die SPD meine ich, nicht die Linken, mehr als die Linken bekommen sie auf"}, {"id": 237, "start": 1810.6, "end": 1817.84, "text": "jeden Fall, dass die mehr bekommen als die SPD, das heißt die große Koalition in, jetzt"}, {"id": 238, "start": 1817.84, "end": 1823.88, "text": "wäre ja CDU und die Grüne, das wäre, wenn du die zwei größten zusammen nimmst, ja"}, {"id": 239, "start": 1823.88, "end": 1837.56, "text": "aber naja, keine Ahnung, ich bin echt mal gespannt, ja, ich glaube das kann man so noch"}, {"id": 240, "start": 1837.56, "end": 1844.28, "text": "überhaupt nicht sagen, es tut sich, also gerade die letzten Monate vermute ich, zumindest"}, {"id": 241, "start": 1844.28, "end": 1848.92, "text": "man wird sich da einiges tun, weil viele Leute noch unentschlossen sind und jetzt sagen"}, {"id": 242, "start": 1848.92, "end": 1852.24, "text": "ah das, das, jenes, ich weiß es nicht, manche entscheiden sich ja, ich glaube da gibt es"}, {"id": 243, "start": 1852.24, "end": 1859.0, "text": "sogar Untersuchungen zu, dass sich viele sogar auch sogar am letzten Tag oder auf dem Weg"}, {"id": 244, "start": 1859.0, "end": 1865.36, "text": "zum Wahllokal oder quasi noch, wenn sie den Stimmzettel vor sich liegen haben, entscheiden,"}, {"id": 245, "start": 1865.36, "end": 1872.6, "text": "also das ist gar nicht so klar, dass das so in die ähnliche Richtung kommt, wie jetzt"}, {"id": 246, "start": 1872.6, "end": 1885.0, "text": "die Umfragen sind, Musik starten, gut, aber es ist letztendlich ein müßiges Thema darüber"}, {"id": 247, "start": 1885.0, "end": 1891.48, "text": "zu diskutieren, weil es jeder ein bisschen anders sieht, wobei ich es ganz gut finde,"}, {"id": 248, "start": 1891.48, "end": 1895.64, "text": "wenn man, wenn, wenn sich mal, wie soll ich sagen, wenn die Leute sich nicht gleich wie"}, {"id": 249, "start": 1895.64, "end": 1900.0, "text": "auf Twitter an den Hals springen, wenn einer was sagt, was ihnen nicht gefällt, ja, Twitter"}, {"id": 250, "start": 1900.0, "end": 1907.44, "text": "ist ja ganz schlimm, also Twitter ist wirklich die schlimmste Plattform, die es gibt, so,"}, {"id": 251, "start": 1907.44, "end": 1912.8, "text": "wenn du mal wirklich zwei Seiten sehen willst, die aufeinander losgehen, also wenn du, wenn"}, {"id": 252, "start": 1912.8, "end": 1918.48, "text": "du Twitter, wenn du dir Twitter anguckst, also wenn, also wenn es nach Twitter geht,"}, {"id": 253, "start": 1918.48, "end": 1923.78, "text": "dann gibt es eigentlich nur noch Extremisten auf allen Seiten oder man kann nicht mal so"}, {"id": 254, "start": 1923.78, "end": 1928.16, "text": "weit gehen und sagen, es gibt links und rechts, auf Twitter gibt es ja alles, ja, links, rechts,"}, {"id": 255, "start": 1928.16, "end": 1933.92, "text": "oben, unten, vorne, hinten, aber Extremistisch, zumindest, zumindest wenn du dir die Tweets"}, {"id": 256, "start": 1933.92, "end": 1939.44, "text": "anguckst, die sind ja so krass drauf, die Leute auf Twitter, also zum Glück ist das"}, {"id": 257, "start": 1939.44, "end": 1946.04, "text": "nicht repräsentativ für einen Großteil der Bevölkerung, Twitter sind so viele Leute"}, {"id": 258, "start": 1946.04, "end": 1954.2, "text": "instant ausgelöst durch jeden Scheiß, ja, ich bin übrigens immer noch der Meinung,"}, {"id": 259, "start": 1954.2, "end": 1963.68, "text": "obwohl ich Twitter immer flame, ich, das wird das auch nicht, wird das auch nicht, obwohl"}, {"id": 260, "start": 1963.68, "end": 1970.12, "text": "ich Twitter immer flame, ich finde, Twitter ist immer noch die beste Social Media Plattform,"}, {"id": 261, "start": 1970.12, "end": 1974.96, "text": "man muss halt seine Trends umstellen, also Twitter Trends auf Deutschland ist für den"}, {"id": 262, "start": 1974.96, "end": 1987.16, "text": "Arsch, ne, die gibt es nicht, die gibt es noch, aber die sind kaum noch am Start, also"}, {"id": 263, "start": 1987.16, "end": 1992.72, "text": "du musst erstmal die Twitter Trends auf Deutschland ausstellen, ich habe es auf Andorra stehen,"}, {"id": 264, "start": 1992.72, "end": 1995.28, "text": "aber man kann es auch auf irgendein anderes Land stellen, wo vielleicht was vorkommt,"}, {"id": 265, "start": 1995.28, "end": 2001.72, "text": "was einen interessiert, Andorra habe ich, weil es ist einfach nie Trends in Andorra, das"}, {"id": 266, "start": 2001.72, "end": 2005.6, "text": "ist der einzige Trend, in dem ich mich erinnern kann, in Andorra war letztens Tour de France,"}, {"id": 267, "start": 2005.6, "end": 2010.32, "text": "ansonsten ist Twitter Andorra Trends ist immer komplett leer, das finde ich sehr angenehm,"}, {"id": 268, "start": 2010.32, "end": 2016.52, "text": "weil immer wenn ich in die Deutschland Trends gucke, habe ich wieder den, wie soll ich"}, {"id": 269, "start": 2016.52, "end": 2026.88, "text": "sagen, die geistige Elite vor mir, ja, oder das halte ich nicht auf Dauer aus, ne Reddit"}, {"id": 270, "start": 2026.88, "end": 2030.68, "text": "ist nicht so schlimm, Reddit kannst du dir ja wirklich genau aussuchen, wenn du jetzt"}, {"id": 271, "start": 2030.68, "end": 2037.8, "text": "natürlich in irgendein Politik Forum auf Reddit gehst, oder in irgendeinem, ja du wirst"}, {"id": 272, "start": 2037.8, "end": 2042.72, "text": "wahrscheinlich selber wissen, wenn du dann in irgendeinem Subreddit gehst, wo du halt"}, {"id": 273, "start": 2042.72, "end": 2046.36, "text": "sowas abgeht, dann klar, aber ansonsten ist es auf Reddit nicht schlimm, Reddit hat die"}, {"id": 274, "start": 2046.36, "end": 2053.36, "text": "übliche Forumskrankheit, die alle Foren haben, dass quasi mehr auf Fehler eingegangen wird,"}, {"id": 275, "start": 2053.36, "end": 2059.12, "text": "anstatt auf Antworten, also sprich, wenn du eine Frage stellst auf Reddit, antwortet"}, {"id": 276, "start": 2059.12, "end": 2064.32, "text": "keiner drauf, wenn du auf Reddit sagst, ich habe rausgefunden, es ist so und so und so,"}, {"id": 277, "start": 2064.32, "end": 2068.32, "text": "und das ist nicht so, dann hast du 500 Antworten, die sagen, alter du Kacknut, du hast keine"}, {"id": 278, "start": 2068.32, "end": 2074.84, "text": "Ahnung, du bist richtig dumm, also du musst eigentlich auf Reddit, wenn du die Antwort"}, {"id": 279, "start": 2074.84, "end": 2078.12, "text": "wissen, wenn du die Antwort für was haben willst, musst du behaupten, du kennst die"}, {"id": 280, "start": 2078.12, "end": 2081.8, "text": "Antwort, und was falsches hinschreiben, dann bekommst du die Antwort, das ist so der Trick"}, {"id": 281, "start": 2081.8, "end": 2085.12, "text": "an Reddit, wenn du einfach nur eine Frage stellst, klappt das in der Regel, das ist"}, {"id": 282, "start": 2085.12, "end": 2088.36, "text": "übrigens bei allen Foren so, ja und dann hast du natürlich die üblichen Sachen, die"}, {"id": 283, "start": 2088.36, "end": 2092.4, "text": "in jedem Forum sind, die hast du natürlich auch auf Reddit, dass die Leute dann schreiben,"}, {"id": 284, "start": 2092.4, "end": 2097.32, "text": "hm, warum willst du denn so was machen, das ist eben eher die beste Forum, nein, das macht"}, {"id": 285, "start": 2097.32, "end": 2103.08, "text": "man so nicht, und dann postet ihr eine 200 Seiten lange Konfig, oder sagt ihr, ich hatte"}, {"id": 286, "start": 2103.08, "end": 2107.56, "text": "das noch nie nötig so zu machen, ein bisschen Schwanzvergleich auf Reddit, das ist übliche"}, {"id": 287, "start": 2107.56, "end": 2111.24, "text": "Forumssachen, aber an sich ist Reddit gut, also ich würde sagen, Twitter ist für mich"}, {"id": 288, "start": 2111.24, "end": 2116.44, "text": "die beste Social Media Plattform, trotz den links, rechts, oben, unten, vorne, hinten"}, {"id": 289, "start": 2116.44, "end": 2121.48, "text": "extremistischen Leuten auf Twitter, und Reddit ist die beste Forumsplattform, obwohl die"}, {"id": 290, "start": 2121.48, "end": 2127.56, "text": "üblichen blöden Forumsdiskutierer am Start sind, leider was Reddit richtig sagt, ist"}, {"id": 291, "start": 2127.56, "end": 2133.04, "text": "das finde ich, ist das neue Reddit Layout, ich mag es nicht, ich mag es einfach überhaupt"}, {"id": 292, "start": 2133.04, "end": 2139.48, "text": "nicht, ich finde es richtig eklig, leider ist Old Reddit auch schon ziemlich in die Jahre"}, {"id": 293, "start": 2139.48, "end": 2145.88, "text": "gekommen, dass es nicht nur nicht schön aussieht, sondern auch funktionell ein bisschen zu wünschen"}, {"id": 294, "start": 2145.88, "end": 2153.08, "text": "übrig lässt, so, und was der richtige Hyper Cancer, also um es jetzt mal wirklich übertrieben"}, {"id": 295, "start": 2153.08, "end": 2159.52, "text": "zu sagen, an Reddit ist, ist die Smartphone App, Reddit hat sich ja überlegt, wenn man"}, {"id": 296, "start": 2159.52, "end": 2165.4, "text": "sie über die Suchmaschine aufmacht, dann kann man sich die Posts nicht mal angucken, also"}, {"id": 297, "start": 2165.4, "end": 2169.4, "text": "ich weiß nicht, ob ihr schon mal in letzter Zeit auf dem Smartphone oder auf einem iPhone,"}, {"id": 298, "start": 2169.4, "end": 2172.56, "text": "da weiß ich es halt, weil ich kriege ja eins gestellt von der Firma, ich habe ein iPhone"}, {"id": 299, "start": 2172.56, "end": 2178.12, "text": "11 und wenn man da Posts auf Reddit aufmacht, dann steht hier jetzt als erstes drinne, wollen"}, {"id": 300, "start": 2178.12, "end": 2183.56, "text": "sie wirklich in Safari durch, wollen sie wirklich in Safari fortsetzen, dann sagst du, ja fortsetzen"}, {"id": 301, "start": 2183.56, "end": 2187.76, "text": "in Safari und dann steht dann, dieses Subreddit kann nicht angezeigt werden, verwenden sie"}, {"id": 302, "start": 2187.76, "end": 2192.16, "text": "jetzt die App, das fuckt mich richtig ab, ich verwende ja auch eine Reddit App auf dem"}, {"id": 303, "start": 2192.16, "end": 2196.96, "text": "Smartphone, aber nicht die offizielle Reddit App, weil den Erfolg gönne ich ihnen nicht,"}, {"id": 304, "start": 2196.96, "end": 2208.68, "text": "ich verwende auf IOS, IOS Apollo Reader für Reddit, Reddit, der Christian Selig, der ist"}, {"id": 305, "start": 2208.68, "end": 2218.12, "text": "Big Brain, der kennt sich aus, die verwende ich, aber auch nur, weil ich Reddit den Triumph"}, {"id": 306, "start": 2218.12, "end": 2221.88, "text": "nicht gönnen will, dass ich ihre App verwende, am liebsten würde ich den Browser angucken,"}, {"id": 307, "start": 2221.88, "end": 2225.6, "text": "ich finde das auch so bescheuert, du suchst was in Google, du findest ja immer viel Reddit"}, {"id": 308, "start": 2225.6, "end": 2230.76, "text": "als Antworten, das ist ja normal, du hast irgendwas, ich programmiere Netzwerk, Technik, du suchst"}, {"id": 309, "start": 2230.76, "end": 2234.96, "text": "irgendwas, findest einen Reddit Post, drückst drauf in Google auf die Suchmaschine, kriegst"}, {"id": 310, "start": 2234.96, "end": 2239.48, "text": "den Reddit an und das erste was kommt ist, ah nee geht nicht, das fuckt mich so ab, also"}, {"id": 311, "start": 2239.48, "end": 2243.56, "text": "das ist wirklich, ich weiß auch gar nicht, was Reddit sich dabei denkt, das bringt ihn"}, {"id": 312, "start": 2243.56, "end": 2248.0, "text": "doch nicht wirklich mehr User oder, meint ihr wirklich, das bringt Reddit, ich kann's"}, {"id": 313, "start": 2248.0, "end": 2266.72, "text": "mir nicht vorstellen, ja gut, ja er muss einfach den richtigen Leuten folgen auf Twitter und"}, {"id": 314, "start": 2266.72, "end": 2275.76, "text": "diesen ganzen, dieses ganze gegenseitige runter und niedergemache einfach nicht die Deutschland"}, {"id": 315, "start": 2275.76, "end": 2281.36, "text": "Trends angucken einfach, das ist das beste, die zerfleischen sich immer so selbst auf"}, {"id": 316, "start": 2281.36, "end": 2287.32, "text": "Twitter, das ist richtig krass, ja, ich hab es nie für möglich gehalten, dass ich das"}, {"id": 317, "start": 2287.32, "end": 2295.08, "text": "machen muss, aber ich musste tatsächlich ein paar Leute ignoren und ein paar Leute bannen,"}, {"id": 318, "start": 2295.08, "end": 2302.88, "text": "bannen weil total dummes Zeug, ne, wollte ich nicht sehen und ignoren weil, man kann"}, {"id": 319, "start": 2302.88, "end": 2307.52, "text": "ja so silent ignoren auf Twitter, also Leute die ich nicht wirklich ignoren will, weil"}, {"id": 320, "start": 2307.52, "end": 2311.64, "text": "ich bin nicht bannen will, also weil ich nichts gegen sie persönlich habe, aber ich folge"}, {"id": 321, "start": 2311.64, "end": 2317.16, "text": "Leuten wo mich eigentlich schon interessiert was sie schreiben, aber die retweeten manchmal"}, {"id": 322, "start": 2317.16, "end": 2327.16, "text": "Leute die ich partout nicht ab kann und das ist dann schwierig, hast du MSI gebannt, stimmt,"}, {"id": 323, "start": 2327.16, "end": 2331.12, "text": "ich muss mal Leute, ich muss gucken ob ich immer noch bei MSI gebannt bin, Moment, Moment"}, {"id": 324, "start": 2331.12, "end": 2339.88, "text": "Twitter, MSI, Sekunde, Sekunde, MSI Deutschland Gaming, ich bin immer noch blockiert, warum?"}, {"id": 325, "start": 2339.88, "end": 2355.4, "text": "Was haben die, warum haben die mich immer noch gebannt, guck mal, was soll das, warum,"}, {"id": 326, "start": 2355.4, "end": 2364.96, "text": "ich dachte die können mich endlich mal anbanen, aber nein machen sie nicht, ich weiß bis"}, {"id": 327, "start": 2364.96, "end": 2370.04, "text": "heute ehrlich gesagt nicht hundertprozentig warum, ich hab mich über ihre RGB Mainboards"}, {"id": 328, "start": 2370.04, "end": 2377.64, "text": "lustig gemacht, das ist alles, ich hab mich 2, 3 mal über ihre RGB Mainboards lustig"}, {"id": 329, "start": 2377.64, "end": 2385.72, "text": "gebannt, da bannt man doch jetzt nicht jemand für, ich mein was hab ich denn, jetzt mal"}, {"id": 330, "start": 2385.72, "end": 2391.28, "text": "ernsthaft, Twitter, ich muss jetzt mal gucken, was, MSI, Twitter Deutschland, ich muss jetzt"}, {"id": 331, "start": 2391.28, "end": 2403.88, "text": "mal gucken, was hab ich denn Schlimmes geschrieben, MSI Gaming, was hab ich Schlimmes geschrieben,"}, {"id": 332, "start": 2403.88, "end": 2422.72, "text": "das muss ich mir jetzt nochmal angucken, was, was hab ich Schlimmes geschrieben, was, was"}, {"id": 333, "start": 2422.72, "end": 2434.32, "text": "hab ich denn, was hab ich denn überhaupt getan, muss irgendwie MSI drinstehen, das ist so alt,"}, {"id": 334, "start": 2434.32, "end": 2446.48, "text": "das ist so alt, ja sowas hab ich geschrieben, wo ist das Problem da dran, mal ernsthaft,"}, {"id": 335, "start": 2446.48, "end": 2453.04, "text": "Blink und Leuchte Mainboards, wozu, danach wurd ich gebannt, guck hier Oktober 2016 und"}, {"id": 336, "start": 2453.04, "end": 2456.32, "text": "das hab ich vierprozentig, ich wurd wegen diesem Tweet gebannt, sonst zwischenseitig"}, {"id": 337, "start": 2456.32, "end": 2467.24, "text": "hatte ich mit dir nix zu tun, warum haben die mich dafür gebannt, findet ihr jetzt mal"}, {"id": 338, "start": 2467.24, "end": 2473.24, "text": "ernsthaft, findet ihr den Tweet bannwürdig, chat, sagt mal ehrlich, findet ihr das bannwürdig,"}, {"id": 339, "start": 2473.24, "end": 2495.68, "text": "ist das schon Hatespeech, ist das schon Hatespeech, Leute, wenn ich die Twitter Trends schon seh,"}, {"id": 340, "start": 2495.68, "end": 2500.6, "text": "ok, hier weiß ich, klick ich definitiv nicht drauf, auf gar keinen Fall klick ich auf"}, {"id": 341, "start": 2500.6, "end": 2504.72, "text": "diesen Trend in Deutschland drauf, wer das ist, hab ich keine Ahnung, wer das ist, hab"}, {"id": 342, "start": 2504.72, "end": 2509.44, "text": "ich auch keine, Bratwurst Trends, warum Trends, nein, nein Max, ich guck nicht rein, ich gucke"}, {"id": 343, "start": 2509.44, "end": 2517.28, "text": "nicht in deutsche Trends, so, keine Ahnung, was ist das, menschenfeindlich, oh ja, Twitter,"}, {"id": 344, "start": 2517.28, "end": 2524.56, "text": "Twitter ist menschenfeindlich in Person, Salazar weiß ich nicht, wer das ist, ich kenn Sarazar,"}, {"id": 345, "start": 2524.56, "end": 2541.04, "text": "das war mal der Sidekick von Gronkh, das Salad macht Dinger, Beatmungsgerät trendet, ok,"}, {"id": 346, "start": 2541.04, "end": 2556.96, "text": "der Falk, ok, ich find's schon mal, es scheint ganz ok zu sein aktuell, tja, aber wie gesagt"}, {"id": 347, "start": 2556.96, "end": 2575.24, "text": "keine Ahnung warum ich gebannt wurde, ich weiß es nicht, wer weiß, wer weiß, ja, heute"}, {"id": 348, "start": 2575.24, "end": 2592.4, "text": "wird alles gecancelt, instant wrecked, ja, Apollo beste, da muss ich übrigens auch demnächst"}, {"id": 349, "start": 2592.4, "end": 2599.52, "text": "wieder einkaufen, weil ich hab keine Spaghetti mehr, ich muss Spaghetti kaufen, guck mal hier,"}, {"id": 350, "start": 2599.52, "end": 2614.56, "text": "ich kauf wieder diese Website, Mom's Spaghetti, was ne Website, hier, ne, die nicht, die nicht,"}, {"id": 351, "start": 2614.56, "end": 2623.56, "text": "die da, Spaghetti, Anzahl Kartons, ok, man braucht 100 Euro für versand, für kostenlosen"}, {"id": 352, "start": 2623.56, "end": 2632.8, "text": "versand, 6 Kartons sind das 100 Euro, wo sieht man, alter die Seite ist so schlecht, nein reicht"}, {"id": 353, "start": 2632.8, "end": 2639.96, "text": "nicht, 7 Kartons, das kann ich ja im Leben nicht, ich kann auch keine 7 Kartons Spaghetti"}, {"id": 354, "start": 2639.96, "end": 2653.0, "text": "futtern, also 7 Kartons sind jeweils 1 Karton, gleich 6 Spaghetti, ich kann Spaghetti nicht"}, {"id": 355, "start": 2653.0, "end": 2664.64, "text": "schreiben, seht ihr mal, richtig oi, richtig, richtig 3-Head, wie schreibt man Spaghetti,"}, {"id": 356, "start": 2664.64, "end": 2674.68, "text": "das sind, guck mal, das sind 7 oder 8, wie viel waren es jetzt, 7 Pakete, jeweils 6 mal"}, {"id": 357, "start": 2674.68, "end": 2685.08, "text": "Spaghetti, das ist zu viel, 500 Gramm ist ein Paket, da hab ich 2 Jahre Spaghetti, wenn ich"}, {"id": 358, "start": 2685.08, "end": 2694.16, "text": "das bestelle, ja das ist auch nervig, das sind so Kleinigkeiten auf Reddit, die einfach"}, {"id": 359, "start": 2694.16, "end": 2699.32, "text": "abfacken, genau, manchmal hast du sogar das Problem, dass du nen Thread aufmachst, der"}, {"id": 360, "start": 2699.32, "end": 2704.12, "text": "hat nur 5 Antworten und trotzdem möchte Reddit, dass du sie ausklappst, obwohl wenn du sie"}, {"id": 361, "start": 2704.12, "end": 2713.16, "text": "ausklappst, sie dann auch noch falsch ausgeklappt werden, Chainlaw, hast du gerade irgendwie"}, {"id": 362, "start": 2713.16, "end": 2717.44, "text": "ein Passwort in den Chat gepostet, oder ist es Gbait, beim Chainlaw bin ich mir immer"}, {"id": 363, "start": 2717.44, "end": 2722.28, "text": "nicht sicher, ich trau dem auch zu, dass der einen Fake Passwort generiert hat und dann"}, {"id": 364, "start": 2722.28, "end": 2727.36, "text": "so zu tun im Chat, als hätte er sein Passwort gepostet, ich trau dir alles zu."}, {"id": 365, "start": 2727.36, "end": 2740.68, "text": "RPG, du meinst RGB oder?"}, {"id": 366, "start": 2740.68, "end": 2755.28, "text": "Rot, Grün, Blau, was wäre denn dann die, sagt mal Leute, was wäre denn eine RBG, eine"}, {"id": 367, "start": 2755.28, "end": 2768.32, "text": "RBG Koalition, was wäre das denn dann, RGB Koalition, das wäre dann Rot, Grün, Blau,"}, {"id": 368, "start": 2768.32, "end": 2778.96, "text": "also AFD ist Blau, oder, Rot, Grün, Blau, also SPD, Grün und AFD, ja eine äußerst"}, {"id": 369, "start": 2778.96, "end": 2786.92, "text": "wahrscheinlich Koalition, die RGB Koalition, ja, Max warum klingt deine Stimme gerade so"}, {"id": 370, "start": 2786.92, "end": 2815.8, "text": "jung, weiß nicht, klingt die anders als sonst, Zoomer, Zoomer Max heute, das war klar,"}, {"id": 371, "start": 2815.8, "end": 2828.32, "text": "ja wahrscheinlich, wahrscheinlich weil ich gesagt hab, RGB Mainbots sind unsinn, keine"}, {"id": 372, "start": 2828.32, "end": 2838.76, "text": "Ahnung, ich hab mich aber auch nicht darum gekümmert, dass die mich irgendwie entbannen,"}, {"id": 373, "start": 2838.76, "end": 2844.52, "text": "das juckt mich auch nicht, mach hier mit MSI auch nichts, hast du die neuen C++ Updates"}, {"id": 374, "start": 2844.52, "end": 2871.08, "text": "bereits gelesen, guter Chebat, aber da falle ich nicht drauf rein, nee, für den Chat kochen,"}, {"id": 375, "start": 2871.08, "end": 2880.28, "text": "ganz bestimmt, ja, dann müsste ja der Chat zu mir nach Hause kommen, nee, nee, es gibt"}, {"id": 376, "start": 2880.28, "end": 2885.56, "text": "so ein paar Dinger, die wird's nie geben, ich mach garantiert, ich mach garantiert kein"}, {"id": 377, "start": 2885.56, "end": 2893.0, "text": "Spaghetti kochen für den Chat, doch, doch Leute, das mach ich nach dem Face Reveal und das"}, {"id": 378, "start": 2893.0, "end": 2899.08, "text": "Face Reveal wisst ihr ja, ist bei 1 Million Abos und bei 2 Millionen Abos, mach ich dann,"}, {"id": 379, "start": 2899.08, "end": 2909.76, "text": "äh Viewer treffen, was auch nie, was beides nicht eintreten wird, ah wir posten alle Passwörter"}, {"id": 380, "start": 2909.76, "end": 2937.32, "text": "aber jetzt verstehe ich, sehr gut, exzellent, ein Onlyfans, mach mir, ich sage euch nächstes"}, {"id": 381, "start": 2937.32, "end": 2945.12, "text": "Jahr, am 1. April ist es wieder der Trollolollacher von allen Streamer und Streamerinnen, saß"}, {"id": 382, "start": 2945.12, "end": 2949.0, "text": "ich jetzt schreibe auf Twitter, Leute, hab übrigens einen Onlyfans-Account gemacht,"}, {"id": 383, "start": 2949.0, "end": 2956.28, "text": "haha, lulcibaited, das werden dann wieder 150 Leute an einem Tag machen und dann ist"}, {"id": 384, "start": 2956.28, "end": 2964.28, "text": "es natürlich immer noch furchtbar lustig, seh ich ein, ja ich weiß aber das alte Reddit-Interface"}, {"id": 385, "start": 2964.28, "end": 2970.8, "text": "ist auch nicht der Weisheitsletzter Schluss, das ist ja auch nicht geil, das ist nur besser"}, {"id": 386, "start": 2970.8, "end": 2978.48, "text": "als das neue, Max, was hältst du von radikaler Ehrlichkeit, hä wie was, du meinst, dass man"}, {"id": 387, "start": 2978.48, "end": 2985.08, "text": "immer exakt sagt, was man denkt und ich halte, also wenn du das meinst, halte ich das für"}, {"id": 388, "start": 2985.08, "end": 2991.48, "text": "äußerst unvorteilhaft in vielen Situationen, sowohl nachteilig für dich als auch für"}, {"id": 389, "start": 2991.48, "end": 2998.32, "text": "andere Leute, also man muss jetzt vielleicht nicht den ganzen Tag den Leuten irgendwie"}, {"id": 390, "start": 2998.32, "end": 3002.52, "text": "was aufs Ohr erzählen, aber manchmal ist es sicherlich nicht verkehrt, manche Sachen"}, {"id": 391, "start": 3002.52, "end": 3009.72, "text": "wegzulassen oder sie etwas in etwas besserem Licht erscheinen zu lassen, als sie eigentlich"}, {"id": 392, "start": 3009.72, "end": 3027.76, "text": "sind, ist das eine Wette, ja im Prinzip nur eine Wette, wo ich relativ gute Chancen habe"}, {"id": 393, "start": 3027.76, "end": 3032.8, "text": "sie zu gewinnen, wann kommt das Schmink-Tutorial, das müssen wir den Fabian unbedingt mal wieder"}, {"id": 394, "start": 3032.8, "end": 3040.4, "text": "fragen, wenn er online ist, ist er online, Chat, mal checken, checken, Moment, ist da"}, {"id": 395, "start": 3040.4, "end": 3050.84, "text": "Frazier am Start, was, ach so, OnKS, ich hab schon gedacht, irgendwie ein Channel gelöscht"}, {"id": 396, "start": 3050.84, "end": 3067.28, "text": "oder so, so viele Anime Games, jetzt gibaten sich alle mit Passwörtern rum, wisst ihr was,"}, {"id": 397, "start": 3067.28, "end": 3072.56, "text": "dem Chandler würde ich sogar zutrauen, dass es echte Passwörter sind, dass er jetzt erstmal"}, {"id": 398, "start": 3072.56, "end": 3078.4, "text": "den Tor Browser angeschmissen hat, sich irgendein Passwort-DB gezogen hat und jetzt echte Passwörter"}, {"id": 399, "start": 3078.4, "end": 3085.44, "text": "postet, so als würde er gibaten und er gibated eigentlich gar nicht, also quasi Reverse-Gibating"}, {"id": 400, "start": 3085.44, "end": 3104.92, "text": "der Gibater, versteht ihr was ich meine, Triple-Bate, Admin, Admin, da fällt mir auch was lustiges"}, {"id": 401, "start": 3104.92, "end": 3113.08, "text": "ein, ihr wisst, Boomer-Gehirn, vielleicht hab ich euch das schon mal erzählt, ich muss"}, {"id": 402, "start": 3113.08, "end": 3116.6, "text": "mich jetzt sogar ein bisschen überlegen, wie das genau war, letztens haben wir eine Kiste"}, {"id": 403, "start": 3116.6, "end": 3122.68, "text": "gesucht und ich weiß gar nicht genau, wie das Passwort am Ende war, also letztens hat"}, {"id": 404, "start": 3122.68, "end": 3126.12, "text": "irgendjemand bei uns angefragt, so nach dem Motto, könnt ihr mal so einen uralt Server"}, {"id": 405, "start": 3126.12, "end": 3131.12, "text": "wieder einschalten, so irgendwas, was es schon länger gibt, als ich überhaupt in der Firma"}, {"id": 406, "start": 3131.12, "end": 3139.84, "text": "bin und haben wir wieder eingeschaltet, sind wir nicht draufgekommen und am Ende hab ich"}, {"id": 407, "start": 3139.84, "end": 3150.44, "text": "das Passwort durch reinen Zufall geprootforced, durch reinen Zufall, also ich hätte nie damit"}, {"id": 408, "start": 3150.44, "end": 3158.96, "text": "gerechnet, ich hab mich versucht einzuloggen mit PSSH und ich weiß gar nicht, was das"}, {"id": 409, "start": 3158.96, "end": 3170.4, "text": "Passwort war, es war entweder 123456 oder 123456, ich glaub es war 123456 und ich hab"}, {"id": 410, "start": 3170.4, "end": 3175.84, "text": "einfach, weil ich das gewöhnt bin von meinen Testkisten, hab ich gesagt, root at Passwort"}, {"id": 411, "start": 3175.84, "end": 3183.12, "text": "123456, bam, rootforced, stimmt nicht was ich euch erzähle, stimmt nicht, ich hab zwei"}, {"id": 412, "start": 3183.12, "end": 3187.8, "text": "Sachen vermischt Leute, ich hab zwei Sachen vermischt, das war kein Server, das war ein"}, {"id": 413, "start": 3187.8, "end": 3192.08, "text": "Passwort für ein Zertifikat, das mit dem Server war was anderes, da mussten wir das"}, {"id": 414, "start": 3192.08, "end": 3199.32, "text": "Passwort resetten, das wo ich 123456 aus Versehen prutforced habe, war ein Passwort für ein"}, {"id": 415, "start": 3199.32, "end": 3206.4, "text": "Zertifikat, wo man es nicht importieren konnte ohne richtiges Passwort oder entpacken konnte,"}, {"id": 416, "start": 3206.4, "end": 3210.52, "text": "nee, man konnte es nicht entpacken und man konnte es nicht importieren, so rum, nicht"}, {"id": 417, "start": 3210.52, "end": 3216.2, "text": "mit dem richtigen Passwort und ich hab dann einfach gesagt 123456 und instant ging's,"}, {"id": 418, "start": 3216.2, "end": 3223.92, "text": "das war quasi der luckiest prutforced Dings of my life, von Hand geprootforced first try,"}, {"id": 419, "start": 3223.92, "end": 3236.92, "text": "123456 versus 123456, was ist besser, 123456, besser, wissenschaftlich erwiesen best practice,"}, {"id": 420, "start": 3236.92, "end": 3242.04, "text": "also es ist ja klar, man sollte möglichst viel erprobte Sachen verwenden in seiner IT,"}, {"id": 421, "start": 3242.04, "end": 3248.12, "text": "da muss man nicht so viel selbst erfinden und 123456 ist eindeutig best practice, der"}, {"id": 422, "start": 3248.12, "end": 3251.56, "text": "Suss hat mir den Tag schon thematisiert, nee, ich weiß auch nicht was ich da groß zu sagen"}, {"id": 423, "start": 3251.56, "end": 3264.44, "text": "soll, was soll ich da groß zu sagen, Suss hat mir den Tag, einzige was ich dazu gesehen"}, {"id": 424, "start": 3264.44, "end": 3272.96, "text": "hab, heute war auf heise ne Torte mit Pinguin drauf, hatten wir doch erst letztens, achso"}, {"id": 425, "start": 3272.96, "end": 3283.68, "text": "C++ Stream, ja, wenn wir die ESP32 Kameradinger programmieren, würde es, nein, auf gar keinen"}, {"id": 426, "start": 3283.68, "end": 3290.12, "text": "Fall, also und schon gar nicht als Programmierer oder irgendwie Level Designer oder gut, da"}, {"id": 427, "start": 3290.12, "end": 3295.0, "text": "hab ich hier keine Ahnung von, aber auf gar keinen Fall, nein, würd ich nicht machen,"}, {"id": 428, "start": 3295.0, "end": 3304.92, "text": "bist du ignoriert, wieso, was denn, wo dann, was hältst du, ja da drum, ja, echt, du hast"}, {"id": 429, "start": 3304.92, "end": 3316.34, "text": "was, hast du, seh ich net, ist das die seriöse Frage, hab ich doch gesehen, nee, dann weiß"}, {"id": 430, "start": 3316.34, "end": 3329.2, "text": "ich nicht, welche du meinst, kein Rant über C++, nee, heute nicht, also du kannst, poste"}, {"id": 431, "start": 3329.2, "end": 3334.32, "text": "einfach noch mal, ich hab keine Ahnung wo, vielleicht war es aber auch einfach nur G-Bait,"}, {"id": 432, "start": 3334.32, "end": 3355.08, "text": "nee, aber da hätt ich keinen Bock drauf, das muss ich mal ausprobieren, Terox, dankeschön"}, {"id": 433, "start": 3355.08, "end": 3362.76, "text": "für den Prime Sub und 16 Monate Hyper Subscription, das ist ja schon richtig lang, ich hab wieder"}, {"id": 434, "start": 3362.76, "end": 3368.84, "text": "die Hälfte wahrscheinlich heute gar nicht erwähnt, sorry Leute, ich guck mal schnell,"}, {"id": 435, "start": 3368.84, "end": 3380.56, "text": "Tommy05, dankeschön für den Sub, der Herwing ist auch am Start, mustifreak und ein Dev-Operator,"}, {"id": 436, "start": 3380.56, "end": 3386.68, "text": "ein Dev-Operator verliebt speakt, Nierdu hat auch Subscribed, der Tains auch wieder 25"}, {"id": 437, "start": 3386.68, "end": 3408.84, "text": "Monate, meine Güte, gar nicht gesehen alles, zauerei, Anzeige ist raus, was hältst du von"}, {"id": 438, "start": 3408.84, "end": 3422.0, "text": "keypass, ich verwende das selbst, ist ein sinnvoller Passwortmanager, kann man verwenden, das hab"}, {"id": 439, "start": 3422.0, "end": 3427.84, "text": "ich auch gehört, gerade bei Blizzard ist es wohl ab 2013 ganz toll gewesen zu arbeiten,"}, {"id": 440, "start": 3427.84, "end": 3433.64, "text": "da bin ich ja auch mal wahnsinnig gespannt, was da rauskommt, die werden ja nicht von"}, {"id": 441, "start": 3433.64, "end": 3441.16, "text": "irgendwie den 0815 Leuten verklagt, sondern das ist quasi der Start Kalifornien, da bin"}, {"id": 442, "start": 3441.16, "end": 3448.92, "text": "ich wirklich mal gespannt, und die Antworten, die CEO und was ich Inklusionsbeauftragte"}, {"id": 443, "start": 3448.92, "end": 3454.32, "text": "und was sie nicht alles noch haben da geschrieben haben, war halt echt lächerlich, so nach dem"}, {"id": 444, "start": 3454.32, "end": 3461.52, "text": "Motto, man schreibt einfach, das was einem vorgeworfen wird, kann ja überhaupt nicht"}, {"id": 445, "start": 3461.52, "end": 3465.68, "text": "sein, und man ist stolz in so einer tollen Arbeit, in so einer tollen Firma zu arbeiten,"}, {"id": 446, "start": 3465.68, "end": 3469.8, "text": "wo sowas ja nicht passieren kann, also diese, ach ja, und dann hat der Blizzard-Chef ja"}, {"id": 447, "start": 3469.8, "end": 3475.04, "text": "noch, oder ich weiß gar nicht, ob es der Blizzard-Chef oder der andere Typ, oder nee,"}, {"id": 448, "start": 3475.04, "end": 3479.32, "text": "das waren zwei Typen und eine Frau, die glaube ich die Mails geschrieben hat, ich weiß es"}, {"id": 449, "start": 3479.32, "end": 3485.28, "text": "jetzt aus dem Kopf nicht, wo sie geschrieben haben, sie haben jetzt Anti-Rassismus, Anti-Mopping,"}, {"id": 450, "start": 3485.28, "end": 3494.52, "text": "Anti-Familie, Anti-Sexismus und sowas, Training, Training und sowas, Alter, jetzt, und damit"}, {"id": 451, "start": 3494.52, "end": 3501.44, "text": "hat sie es jetzt, oder wie, war das nicht Activision, ne doch, das ist der gleiche Laden"}, {"id": 452, "start": 3501.44, "end": 3515.48, "text": "mittlerweile, seit 10 Jahren oder so, also ganz merkwürdige Statements auf jeden Fall,"}, {"id": 453, "start": 3515.48, "end": 3519.72, "text": "du siehst Schwarz für Overwatch 2, ich hab auch schon vor dieser Geschichte Schwarz"}, {"id": 454, "start": 3519.72, "end": 3525.64, "text": "für Overwatch 2 gesehen, da kannst du mal ein gutes MMO für dich programmieren, das"}, {"id": 455, "start": 3525.64, "end": 3532.0, "text": "stimmt, aber das kann ich wahrscheinlich gar nicht, weil ich überhaupt keine Erfahrung"}, {"id": 456, "start": 3532.0, "end": 3540.8, "text": "in der Spielentwicklung hab, aber ich könnte sicherlich mitprogrammieren da dran, ob da"}, {"id": 457, "start": 3540.8, "end": 3544.68, "text": "natürlich das ein gutes MMO wird, wenn ich es nicht entscheiden kann, also nein, weil"}, {"id": 458, "start": 3544.68, "end": 3548.12, "text": "es ein gutes MMO wird, wenn ich was nicht entscheiden kann, kann durchaus sein, aber"}, {"id": 459, "start": 3548.12, "end": 3554.52, "text": "nicht ein MMO, was ich gerne hätte, also so wie ich es mir gerne vorstelle wahrscheinlich,"}, {"id": 460, "start": 3554.52, "end": 3558.68, "text": "warum gibt es kein Crap für Twitch Chat, wieso gar kein Problem, nimmst einfach einen"}, {"id": 461, "start": 3558.68, "end": 3565.8, "text": "ISC Client, Konsolen ISC Client, connectest dich zum Twitch Chat und crepst, oh ist das"}, {"id": 462, "start": 3565.8, "end": 3576.76, "text": "Problem, echte Hacker-Mans machen das so, ISC only, Kommandozeilen ISC only, wenn du ein"}, {"id": 463, "start": 3576.76, "end": 3580.76, "text": "richtiger Hacker-Man wärst, dann hättest du wahrscheinlich schon ein Twitch Addon programmiert,"}, {"id": 464, "start": 3580.76, "end": 3586.4, "text": "das in einem Terminal Twitch Emotes anzeigen kann, also quasi Twitch Emote to ASCII, ASCII"}, {"id": 465, "start": 3586.4, "end": 3600.68, "text": "Art, New Basic, nein bestimmt nicht, im nächsten Azubi Video geht es um den ersten Arbeitstag,"}, {"id": 466, "start": 3600.68, "end": 3608.16, "text": "hab ich im letzten Video schon gesagt und was ich für sinnvoll halte, zum Beispiel"}, {"id": 467, "start": 3608.16, "end": 3613.76, "text": "eine der Sachen, die ich da erzähle ist, wenn man vorausgehende Azubis hatte oder vielleicht"}, {"id": 468, "start": 3613.76, "end": 3620.32, "text": "noch welche die Azubis noch sind, ist es sicherlich nicht verkehrt, mal am ersten Tag ein bisschen"}, {"id": 469, "start": 3620.32, "end": 3625.24, "text": "sich umzuhören, ok was sind denn so die Dinge, die ihr verkackt habt bzw. was sollte man"}, {"id": 470, "start": 3625.24, "end": 3629.12, "text": "denn auf gar keinen Fall machen oder wo sind sie besonders empfindlich drauf, ich hab zum"}, {"id": 471, "start": 3629.12, "end": 3634.12, "text": "Beispiel am ersten Tag was gemacht, was ich bis heute nicht schlimm finde, wo ich aber"}, {"id": 472, "start": 3634.12, "end": 3639.16, "text": "gehört hab, dass sich Leute drüber aufgeregt haben, ich hab am Telefon gesagt, ich hab"}, {"id": 473, "start": 3639.16, "end": 3646.68, "text": "mich hier mal telefoniert, irgendwie, keine Ahnung, 15 Minuten über irgendwas und ich"}, {"id": 474, "start": 3646.68, "end": 3653.12, "text": "hab dann beim Auflegen gesagt, ja und Tschüss, ja und Tschüss und da haben die gesagt, das"}, {"id": 475, "start": 3653.12, "end": 3660.0, "text": "wäre ja voll, oh keine Ahnung, da haben sie sich voll drüber aufgeregt, da haben sie"}, {"id": 476, "start": 3660.0, "end": 3672.44, "text": "sich voll drüber aufgeregt, das weiß ich noch, da waren sie, waren sie getriggert, ja"}, {"id": 477, "start": 3672.44, "end": 3676.68, "text": "ich kanns verstehen, ich kanns verstehen, das klingt schon, das klingt schon ein bisschen"}, {"id": 478, "start": 3676.68, "end": 3683.88, "text": "unfreundlich, aber was sie da für ein Oppress drum gemacht haben, hätte ja bloß noch gefehlt,"}, {"id": 479, "start": 3683.88, "end": 3694.28, "text": "dass sie mich zum Ritorikseminar geschickt haben, ich hätte auch beim Auflegen einfach"}, {"id": 480, "start": 3694.28, "end": 3702.44, "text": "sagen können, also da so eine Welle zu machen, ja solche Sachen sind nicht verkehrt zu fragen,"}, {"id": 481, "start": 3702.44, "end": 3721.08, "text": "aber also, halt Yo, ich bin"}, {"id": 482, "start": 3721.08, "end": 3722.46, "text": "jetzt schon rein!"}, {"id": 483, "start": 3722.46, "end": 3733.46, "text": "Oder selten, weil die meisten, die sagen wir ein Jahr plus dabei sind, die im Chat aktiv sind, die kenne ich jetzt wieder, aber trotzdem, cool, dass du so oft reinguckst, nice."}, {"id": 484, "start": 3733.46, "end": 3735.46, "text": "Silence aber."}, {"id": 485, "start": 3735.46, "end": 3739.46, "text": "Joa, muss ja nicht jeder den Chat vollspammen mit sinnlosem Zeug."}, {"id": 486, "start": 3739.46, "end": 3744.46, "text": "Jailor macht das schon für mindestens 50 andere Leute mit, kein Problem."}, {"id": 487, "start": 3744.46, "end": 3754.46, "text": "Ehm, Physix, danke schön für den Prime-Sub."}, {"id": 488, "start": 3754.46, "end": 3760.46, "text": "Lulub96, danke schön, vier Monate."}, {"id": 489, "start": 3760.46, "end": 3775.46, "text": "Ne, Social Media Manager oder Social Media Sachen, so Marketing-Stonkstinger würde ich nie machen, das ist echt, ich habe so eine Abneigung gegen solche Jobs."}, {"id": 490, "start": 3775.46, "end": 3779.46, "text": "Und gegen das, was die machen, nicht gegen die Leute."}, {"id": 491, "start": 3779.46, "end": 3791.46, "text": "KitKat, danke schön, aja ja, aber richtig, aja ja."}, {"id": 492, "start": 3791.46, "end": 3794.46, "text": "Ja, hab ich."}, {"id": 493, "start": 3794.46, "end": 3806.46, "text": "Das ist ja relativ einfach einzuschalten, ich hab das mal, als es noch nicht, wie soll ich sagen, es ist ja nicht gekündigt, als es noch nicht auf Eis gelegt wurde,"}, {"id": 494, "start": 3806.46, "end": 3809.46, "text": "hab ich mal folgende Sachen gemacht mit Swarm."}, {"id": 495, "start": 3809.46, "end": 3813.46, "text": "Ich hab gesagt, Docker, Swarm, was sagt man, Enable?"}, {"id": 496, "start": 3813.46, "end": 3815.46, "text": "Es gibt den Befehl zum Einschalten."}, {"id": 497, "start": 3815.46, "end": 3820.46, "text": "Und danach hab ich mich gefragt, warum genau hast du das jetzt eigentlich gemacht?"}, {"id": 498, "start": 3820.46, "end": 3823.46, "text": "Und dann hab ich dich verwendet."}, {"id": 499, "start": 3823.46, "end": 3826.46, "text": "Nein, ich hab damit noch nichts wirklich gemacht."}, {"id": 500, "start": 3826.46, "end": 3841.46, "text": "Das ist wohl wahr, gerade in kleineren Umgebungen, da muss man hier nicht irgendwelche Kubernetes-Geschütze auffahren."}, {"id": 501, "start": 3841.46, "end": 3847.46, "text": "Aber Kubernetes zu lernen, hat natürlich den Vorteil, dass Kubernetes äußerst gefragt ist."}, {"id": 502, "start": 3847.46, "end": 3856.46, "text": "Docker Swarm ist doch sowas wie Kubernetes, ja, es geht in die gleiche Richtung."}, {"id": 503, "start": 3856.46, "end": 3863.46, "text": "Aber Kubernetes ist die deutlich verbreitetere und beliebtere Technik."}, {"id": 504, "start": 3863.46, "end": 3880.46, "text": "Und Docker Swarm möchte selbst der Hersteller selbst nicht mehr unterstützen."}, {"id": 505, "start": 3880.46, "end": 3887.46, "text": "Hast du schon mal was mit dem, ich persönlich nicht, wir haben auf der Arbeit Elasticsearch und, warte mal,"}, {"id": 506, "start": 3887.46, "end": 3891.46, "text": "Logs-Kibana, genau, haben wir im Einsatz."}, {"id": 507, "start": 3891.46, "end": 3895.46, "text": "Das funktioniert erstaunlich gut, bis auf dann, wenn es nicht funktioniert."}, {"id": 508, "start": 3895.46, "end": 3904.46, "text": "Und wenn es nicht funktioniert, ist der Support von Elastic, oder von dem Hersteller, weiß gar nicht, wie die genau heißen, keine große Hilfe."}, {"id": 509, "start": 3904.46, "end": 3910.46, "text": "Das weiß ich noch, wir hatten mal das Problem, dass unsere Elasticsearch-Cluster der Meinung waren, sie machen keinen Cluster mehr."}, {"id": 510, "start": 3910.46, "end": 3916.46, "text": "Und da muss man die irgendwie rausnehmen und mit neuem Token sünken oder so, das ist total die Wissenschaft für sich."}, {"id": 511, "start": 3916.46, "end": 3920.46, "text": "Und der Support hat die unsinnigsten Antworten geschrieben."}, {"id": 512, "start": 3920.46, "end": 3932.46, "text": "Die war nicht hilfreich, aber wenn es funktioniert, funktioniert es gut und schnell und es ist echt nicht übel."}, {"id": 513, "start": 3932.46, "end": 3936.46, "text": "Ja, das ist doch cool."}, {"id": 514, "start": 3936.46, "end": 3947.46, "text": "Der erste Arbeitstag ist doch schon unter, ja, also für alle, die am 2.8. anfangen."}, {"id": 515, "start": 3947.46, "end": 3950.46, "text": "Wie kann man als Azubi einen guten Eindruck hinterlassen?"}, {"id": 516, "start": 3950.46, "end": 3956.46, "text": "Also, ich kann dir nur sagen, wie das bei mir ist."}, {"id": 517, "start": 3956.46, "end": 3963.46, "text": "So, und bei mir hinterlässt ein Azubi einen guten Eindruck, wo ich das Gefühl habe, der interessiert sich für das, was er macht."}, {"id": 518, "start": 3963.46, "end": 3969.46, "text": "Der interessiert sich eben für die Tätigkeit und es geht nicht ins eine Ohr raus und ins andere Ohr rein."}, {"id": 519, "start": 3969.46, "end": 3978.46, "text": "Und man merkt, der, wie soll ich sagen, ich will nicht sagen, man merkt, dass er lernt, das ist jetzt das falsche Wort."}, {"id": 520, "start": 3978.46, "end": 3984.46, "text": "Aber ich freue mich, wenn das, was man mit einem Azubi macht, auf fruchtbaren Boden fällt."}, {"id": 521, "start": 3984.46, "end": 3987.46, "text": "Dann hinterlässt er auch bei mir einen guten Eindruck."}, {"id": 522, "start": 3987.46, "end": 3994.46, "text": "Also, wenn man sich mit dem zwei Tage was angeguckt hat, immer mal wieder über zwei Tage verteilt und der am dritten Tag sagt,"}, {"id": 523, "start": 3994.46, "end": 4001.46, "text": "was haben wir eigentlich noch mal gemacht die letzten zwei Tage über, ich brauche das für meinen Bericht, dann macht es keinen allzu guten Eindruck."}, {"id": 524, "start": 4001.46, "end": 4004.46, "text": "Das konnte Herr Endpunkt übrigens auch richtig gut."}, {"id": 525, "start": 4004.46, "end": 4012.46, "text": "Der hat mich wirklich mal gefragt, das ist kein Witz, ich habe mir mit dem eine Woche lang Netzwerkbasics angeguckt."}, {"id": 526, "start": 4012.46, "end": 4019.46, "text": "Und dann hat er mich gefragt, Max, was haben wir eigentlich noch mal gemacht, ich brauche das für meinen Bericht."}, {"id": 527, "start": 4019.46, "end": 4024.46, "text": "Ich bin auch ein bisschen, ich bin echt ein bisschen verarscht vor allem."}, {"id": 528, "start": 4028.46, "end": 4030.46, "text": "Ja, also das muss nicht unbedingt sein."}, {"id": 529, "start": 4030.46, "end": 4036.46, "text": "Aber wenn ich das Gefühl habe, dass das, was man mit dem Azubi macht, irgendwie auf fruchtbaren Boden fällt oder noch besser,"}, {"id": 530, "start": 4036.46, "end": 4044.46, "text": "man merkt halt, dass er wirklich auch was draus gelernt hat, weil er ein paar Sachen halt dann besser kann als vorher, das reicht mir eigentlich schon."}, {"id": 531, "start": 4044.46, "end": 4049.46, "text": "Ich habe auch keine Schmerzen mit, wenn mich Azubis nerven."}, {"id": 532, "start": 4049.46, "end": 4057.46, "text": "Also nerven in Form von, mich Sachen fragen."}, {"id": 533, "start": 4057.46, "end": 4061.46, "text": "Aber guck mal hier so, ja gut, wusste ich, wusste ich das viel."}, {"id": 534, "start": 4061.46, "end": 4068.46, "text": "Ich habe kein Problem, wenn die mich nerven, indem sie mich Sachen fragen, so nach dem Motto, was ist hier mit, wie funktioniert das, warum geht das, was auch immer."}, {"id": 535, "start": 4068.46, "end": 4076.46, "text": "Was mich nervt ist, wenn sie mich immer die gleichen Sachen fragen oder blöde Sachen fragen, so nach dem Motto, zum fünften Mal das gleiche,"}, {"id": 536, "start": 4076.46, "end": 4083.46, "text": "ohne dass man gesehen hat, dass sie sich versucht haben, nennenswert mit der Thematik auseinanderzusetzen."}, {"id": 537, "start": 4083.46, "end": 4086.46, "text": "Ich habe den Polle übrigens gar nicht gesehen, bis er fertig war."}, {"id": 538, "start": 4086.46, "end": 4090.46, "text": "Ich glaube, so ging es vielen Leuten."}, {"id": 539, "start": 4090.46, "end": 4094.46, "text": "Intern war das."}, {"id": 540, "start": 4094.46, "end": 4101.46, "text": "Noch schlimmer, das war intern zu jemand, der im Büro weiter gesessen hat."}, {"id": 541, "start": 4101.46, "end": 4109.46, "text": "Also, naja, gut."}, {"id": 542, "start": 4109.46, "end": 4111.46, "text": "Nochmal, ok, ja, ok, dann machen wir nochmal."}, {"id": 543, "start": 4111.46, "end": 4132.46, "text": "Jetzt haben wir alle den Polle gesehen, jetzt können wir alle daran teilnehmen."}, {"id": 544, "start": 4132.46, "end": 4145.46, "text": "Es sind halt echt viele."}, {"id": 545, "start": 4145.46, "end": 4148.46, "text": "Es sind echt viele."}, {"id": 546, "start": 4148.46, "end": 4154.46, "text": "Aber gut, ich meine, content-technisch ist es ja hier auch hauptsächlich mal, würde ich sagen, gerade für so Leute interessant,"}, {"id": 547, "start": 4154.46, "end": 4162.46, "text": "wenn ich irgendwelche Linux-Krempel bastle oder vielleicht irgendwelche Micro-Controller-Zeug rund, das interessiert ja die meisten Leute nicht."}, {"id": 548, "start": 4162.46, "end": 4168.46, "text": "Aber ich muss ja echt mal sagen, es ist wirklich richtig poggers, dass ich hier, ich habe mir ja letztens mal meine Statistiken angeguckt,"}, {"id": 549, "start": 4168.46, "end": 4176.46, "text": "wir haben ja, das habe ich gar nicht realisiert, wir haben ja relativ oft Streams, da gucken 450 Leute zu, wenn ich irgendwas mache."}, {"id": 550, "start": 4176.46, "end": 4186.46, "text": "Letztens beim Linux-Server-Einrichten für Einsteiger haben 450 Leute zugeguckt, bis der DDoS anfing."}, {"id": 551, "start": 4186.46, "end": 4191.46, "text": "Also, wenn der DDoS, wahrscheinlich hätte ich auch noch mehr bekommen."}, {"id": 552, "start": 4191.46, "end": 4204.46, "text": "Das riecht krass, vor allem mit dem Zeug hier, das hätte ich ja nie gedacht, was natürlich doppelt, doppelt, doppelt plus nice ist, ja."}, {"id": 553, "start": 4204.46, "end": 4209.46, "text": "Aber man muss auch sagen, wir machen ja auch oftmals, also ich würde mir das auch angucken."}, {"id": 554, "start": 4209.46, "end": 4214.46, "text": "Ich mache jetzt, ich gucke mir ja auch meine eigenen Videos teilweise selbst an nach einem Jahr oder so."}, {"id": 555, "start": 4214.46, "end": 4220.46, "text": "Und dann gucke ich mir das Video und denke mir, ja, es ist eigentlich nicht verkehrt, was ich so gesagt habe."}, {"id": 556, "start": 4220.46, "end": 4231.46, "text": "Und ja, aber wisst ihr, was echt zu ganz merkwürdigen Sachen führt?"}, {"id": 557, "start": 4231.46, "end": 4242.46, "text": "Ich hatte letztens Twitch auf, auf dem Handy im Bett, habe geguckt und irgendwie wurden mir, glaube ich, einen Clip angezeigt,"}, {"id": 558, "start": 4242.46, "end": 4252.46, "text": "habe ich einen Clip geguckt und irgendwie bin ich eingepennt und die Clips laufen ja dann weiter und irgendwie war es dann so,"}, {"id": 559, "start": 4252.46, "end": 4259.46, "text": "ich weiß gar nicht, vielleicht habe ich auch aufs Display gedrückt, man kann ja bei den Clips draufklicken, so weiterschauen."}, {"id": 560, "start": 4259.46, "end": 4268.46, "text": "Zumindest habe ich es geschafft, dass ich in meinem eigenen Stream gelandet bin und dann lief mein eigener Stream, während ich gepennt habe, auf dem Smartphone."}, {"id": 561, "start": 4268.46, "end": 4276.46, "text": "Ey, das macht dich im Kopf fertig, du checkst überhaupt nichts, du denkst die ganze Zeit, warum hörst du dich selbst?"}, {"id": 562, "start": 4276.46, "end": 4280.46, "text": "Das war wirklich sehr, sehr merkwürdig."}, {"id": 563, "start": 4280.46, "end": 4286.46, "text": "Hab ich letztens schon mal erzählt, ja ihr wisst ja, ich erzähle manche Sachen öfters, ich kann mir das einfach nicht mehr merken."}, {"id": 564, "start": 4286.46, "end": 4303.46, "text": "C++ Marketing, die bräuchten ohne Scheiß, wisst ihr was die wirklich bräuchten?"}, {"id": 565, "start": 4303.46, "end": 4311.46, "text": "Was das C++ Gremium oder dieses C++ Standardisierungs, die, die bei C++ den Hut aufhaben, was die wirklich bräuchten?"}, {"id": 566, "start": 4311.46, "end": 4320.46, "text": "Ja, die bräuchten einen Marketing-Mensch und die bräuchten irgendjemanden, der gescheite, sinnvolle Roadmaps macht."}, {"id": 567, "start": 4320.46, "end": 4327.46, "text": "Und nicht diesen Shit, den die da produzieren die letzten Jahre über."}, {"id": 568, "start": 4327.46, "end": 4337.46, "text": "Dass die sagen, ey scheiß drauf, dass wir jetzt irgendwie die 85.000, was weiß ich, Abwandlung von Templates einbauen,"}, {"id": 569, "start": 4337.46, "end": 4343.46, "text": "wo kein Sau mehr durchblickt, sondern dass die mal mit Basics anfangen von aktuellen Sprachen."}, {"id": 570, "start": 4343.46, "end": 4351.46, "text": "Zum Beispiel, dass du gescheites Library-Dependency-Management hast, dass dieser ganze Headershit wegkommt."}, {"id": 571, "start": 4351.46, "end": 4357.46, "text": "Der ja theoretisch mit Modules ein bisschen abgeschwägt."}, {"id": 572, "start": 4357.46, "end": 4360.46, "text": "Alter, das ist so schlecht."}, {"id": 573, "start": 4360.46, "end": 4365.46, "text": "Naja."}, {"id": 574, "start": 4365.46, "end": 4370.46, "text": "Stand-Spoiler eigentlich für den Zapp."}, {"id": 575, "start": 4370.46, "end": 4373.46, "text": "Eingangshalle geht wieder huge."}, {"id": 576, "start": 4380.46, "end": 4384.46, "text": "Ja, also sind wirklich, die am allermeisten sind hier aus der IT."}, {"id": 577, "start": 4384.46, "end": 4388.46, "text": "Natürlich sind alle willkommen, auch wenn sie nicht in der IT sind."}, {"id": 578, "start": 4388.46, "end": 4391.46, "text": "Wir sind ja inclusive hier."}, {"id": 579, "start": 4395.46, "end": 4397.46, "text": "Ich freue mich über jeden Zuschauer."}, {"id": 580, "start": 4397.46, "end": 4400.46, "text": "Und wenn ihr irgendwas aus diesen Streams hier mitnehmen könnt, freue ich mich."}, {"id": 581, "start": 4400.46, "end": 4403.46, "text": "Bin ich, bin ich schon happy."}, {"id": 582, "start": 4403.46, "end": 4408.46, "text": "Sind auch gar keine, immer nur 69 Abstimmungen, ja."}, {"id": 583, "start": 4408.46, "end": 4409.46, "text": "Ups."}, {"id": 584, "start": 4409.46, "end": 4412.46, "text": "Ich wollte es ausklappen, aber 80% waren es am Schluss."}, {"id": 585, "start": 4412.46, "end": 4413.46, "text": "Das habe ich einfach instant geklaust."}, {"id": 586, "start": 4413.46, "end": 4415.46, "text": "Ach, ich kann es aber im zweiten Bildschirm gucken."}, {"id": 587, "start": 4415.46, "end": 4418.46, "text": "Ja, 80, 80 zu 20."}, {"id": 588, "start": 4426.46, "end": 4429.46, "text": "Also alle Chatter-Innen sind hier willkommen, ja."}, {"id": 589, "start": 4439.46, "end": 4441.46, "text": "Ja, das ist nicht verkehrt, das ist schade nichts."}, {"id": 590, "start": 4441.46, "end": 4446.46, "text": "Das war, ich kann mich an meinen, ich kann mich noch an meinen ersten Arbeitstag erinnern."}, {"id": 591, "start": 4453.46, "end": 4455.46, "text": "Ich kann mich noch an meinen ersten Arbeitstag erinnern."}, {"id": 592, "start": 4455.46, "end": 4460.46, "text": "Da musste ich auf so eine Status-Runde."}, {"id": 593, "start": 4460.46, "end": 4464.46, "text": "Das hieß damals noch nicht, hatte damals noch keinen agilen Namen."}, {"id": 594, "start": 4464.46, "end": 4466.46, "text": "Das war ein ganz normales Status-Meeting."}, {"id": 595, "start": 4466.46, "end": 4470.46, "text": "Und da standen dann irgendwie zehn Leute im Kreis."}, {"id": 596, "start": 4470.46, "end": 4478.46, "text": "Und jeder hat mit Fachbegriffen um sich geworfen, wo ich das Gefühl hatte,"}, {"id": 597, "start": 4478.46, "end": 4482.46, "text": "die anderen verstehen das auch nicht und ich erst recht nicht."}, {"id": 598, "start": 4482.46, "end": 4485.46, "text": "Das war ein ganz merkwürdiges Gefühl."}, {"id": 599, "start": 4485.46, "end": 4489.46, "text": "Aber ich habe über die Jahre über mittlerweile realisiert,"}, {"id": 600, "start": 4489.46, "end": 4491.46, "text": "dass das heute immer noch so ist."}, {"id": 601, "start": 4491.46, "end": 4496.46, "text": "Also, dass auf diesen Meetings die Leute irgendwie besonders schlau wirken wollen."}, {"id": 602, "start": 4496.46, "end": 4499.46, "text": "Und dementsprechend jeder, oder aber sich nicht darin reinversetzen können,"}, {"id": 603, "start": 4499.46, "end": 4501.46, "text": "dass keiner eine Ahnung hat, was sie erzählen."}, {"id": 604, "start": 4501.46, "end": 4504.46, "text": "Aber ich glaube, die meisten wollen besonders schlau wirken,"}, {"id": 605, "start": 4504.46, "end": 4510.46, "text": "dass dort die Leute absichtlich mit den abgedrehtesten Fachbegriffen um sich werfen,"}, {"id": 606, "start": 4510.46, "end": 4514.46, "text": "nur damit die anderen es nicht verstehen oder dass man denkt, das ist cool."}, {"id": 607, "start": 4514.46, "end": 4530.46, "text": "Keine Ahnung."}, {"id": 608, "start": 4530.46, "end": 4538.46, "text": "Ja, das kann man mal echt fragen."}, {"id": 609, "start": 4538.46, "end": 4539.46, "text": "Das gute Hetzner-Placement."}, {"id": 610, "start": 4539.46, "end": 4541.46, "text": "By the way, Ausrufezeichen Hetzner."}, {"id": 611, "start": 4541.46, "end": 4547.46, "text": "Wer noch 20 Euro Startgut haben für seine Cloud-Abendbuyerbrauch hier."}, {"id": 612, "start": 4547.46, "end": 4562.46, "text": "Mit meinem Code."}, {"id": 613, "start": 4562.46, "end": 4564.46, "text": "Weißt du, wo das steht?"}, {"id": 614, "start": 4564.46, "end": 4566.46, "text": "Ja, Google."}, {"id": 615, "start": 4566.46, "end": 4568.46, "text": "Das haben die selbst geschrieben."}, {"id": 616, "start": 4568.46, "end": 4573.46, "text": "Docker wurde ja verkauft und zwei Wochen später wurde dann gesagt,"}, {"id": 617, "start": 4573.46, "end": 4581.46, "text": "Swarm juckt nicht mehr."}, {"id": 618, "start": 4581.46, "end": 4583.46, "text": "Nee, das können wir aber tatsächlich machen."}, {"id": 619, "start": 4583.46, "end": 4591.46, "text": "Das ist eine gute Idee."}, {"id": 620, "start": 4591.46, "end": 4599.46, "text": "Ich brauche eine Packet Tracer-Version, die funktioniert."}, {"id": 621, "start": 4599.46, "end": 4604.46, "text": "Klar, jeder darf zugucken."}, {"id": 622, "start": 4604.46, "end": 4610.46, "text": "Du darfst sogar als Agile Head of Agile Coaching zugucken."}, {"id": 623, "start": 4610.46, "end": 4617.46, "text": "Sogar noch schlimmer, sogar BWL-Leute dürfen zugucken, wenn sie wollen."}, {"id": 624, "start": 4617.46, "end": 4620.46, "text": "Wobei ich mir dann noch überlege, ob das wirklich eine gute Idee ist."}, {"id": 625, "start": 4620.46, "end": 4627.46, "text": "Aber ja, auch BWL-Leute dürfen zugucken."}, {"id": 626, "start": 4627.46, "end": 4630.46, "text": "C-Sharp würde ich empfehlen."}, {"id": 627, "start": 4630.46, "end": 4632.46, "text": "Meine absolute Lieblingsprogrammiersprache."}, {"id": 628, "start": 4632.46, "end": 4636.46, "text": "Wenn du eine Programmiersprache willst, die hip ist und weit verbreitet."}, {"id": 629, "start": 4636.46, "end": 4641.46, "text": "Wenn du Richtung AI und wissenschaftliche Sachen gucken willst und Automatisierung,"}, {"id": 630, "start": 4641.46, "end": 4650.46, "text": "wenn du Richtung Cloud, Tools und Google stellst, gucken willst, dann go."}, {"id": 631, "start": 4650.46, "end": 4653.46, "text": "Aber ich würde C-Sharp empfehlen, meine absolut Lieblingsprogrammiersprache."}, {"id": 632, "start": 4653.46, "end": 4661.46, "text": "C-Sharp ist eine Programmiersprache, die ist für Probleme aus der echten Welt gedacht."}, {"id": 633, "start": 4661.46, "end": 4663.46, "text": "Was heißt, vergiss es."}, {"id": 634, "start": 4663.46, "end": 4668.46, "text": "Komisches Wort, was ich mir mit dem Friseur zusammen ausgedacht habe."}, {"id": 635, "start": 4668.46, "end": 4678.46, "text": "Hat keinen tieferen Sinn."}, {"id": 636, "start": 4678.46, "end": 4680.46, "text": "Der Desktop, der ist Pongas."}, {"id": 637, "start": 4680.46, "end": 4681.46, "text": "So muss das sein."}, {"id": 638, "start": 4681.46, "end": 4685.46, "text": "Da findet man wenigstens was."}, {"id": 639, "start": 4685.46, "end": 4688.46, "text": "Nein, Java würde ich nicht empfehlen."}, {"id": 640, "start": 4688.46, "end": 4694.46, "text": "Also wenn ich heute jvmäßig anfangen würde, würde ich wahrscheinlich Kotlin verwenden."}, {"id": 641, "start": 4694.46, "end": 4703.46, "text": "Und nicht Java."}, {"id": 642, "start": 4703.46, "end": 4705.46, "text": "So Leute, ich habe den Chat durch."}, {"id": 643, "start": 4705.46, "end": 4707.46, "text": "Alles klar."}, {"id": 644, "start": 4707.46, "end": 4709.46, "text": "Leute, wir sehen uns morgen."}, {"id": 645, "start": 4709.46, "end": 4710.46, "text": "Wahrscheinlich morgen nicht."}, {"id": 646, "start": 4710.46, "end": 4717.46, "text": "Morgen muss ich das Azubi Video machen und das Telekom Video."}, {"id": 647, "start": 4717.46, "end": 4718.46, "text": "Mal gucken."}, {"id": 648, "start": 4718.46, "end": 4719.46, "text": "Mal gucken."}, {"id": 649, "start": 4719.46, "end": 4720.46, "text": "Vielleicht sehen wir uns morgen auch."}, {"id": 650, "start": 4720.46, "end": 4721.46, "text": "Ich bin mir noch nicht ganz sicher."}, {"id": 651, "start": 4721.46, "end": 4722.46, "text": "Schauen wir mal."}, {"id": 652, "start": 4722.46, "end": 4723.46, "text": "Bis denn."}, {"id": 653, "start": 4723.46, "end": 4724.46, "text": "Alles Gute."}, {"id": 654, "start": 4724.46, "end": 4725.46, "text": "Wir sehen uns."}, {"id": 655, "start": 4725.46, "end": 4753.46, "text": "Tschüss."}]}