{"text": "So, auf geht's, exellent. Leute, ich find mein Ploieti nicht mehr. Ich hab echt die letzten zwei Tage immer mal wieder gesucht, aber ich find's einfach nicht. Ich hab keine Ahnung wo ich das hin hab. Es kann ja nicht weit sein, das Ding ist auch ziemlich groß, aber ich find's einfach nett. Sehr merkwürdig. Sehr merkwürdig, alles hier. Wollt mal wieder was mit dem Ploieti aufnehmen? Hab mir gedacht, jo, holste raus und irgendwie war's nicht da. Dieses Ding hier, das hab ich ja schon bestimmt, keine Ahnung, sechs Jahre oder so, oder länger. Die Ursprungsvariante, ja, dieses Ding. Ich wusste gar nicht, dass es da Neues gibt mittlerweile, denn ich find's einfach nicht. Ich weiß nicht wo ich's hin hab. Ich weiß wo ich's früher hatte. Früher hatte ich's entweder rechts auf dem Rechner oder hinterm Rechner stehen, weil ich auch das passende USB-Kabel dafür da hatte, aber es ist weg. Einfach weg. Und wisst ihr was auch weg ist? Meine Bestellung mit UPS ist weg. Ich hab mit UPS ja so ein Elgato Ringlight bestellt. Und UPS hat keine Ahnung wo das Ding ist. Also es wurde angeblich versucht Samstags zuzustellen. Okay, vielleicht war ich gerade nicht da. Okay, mag sein. So, dann wurde es angeblich am Montag wieder zugestellt, kam nix. Am Samstag wurde es angeblich, dann stand es danach da, dass es am Samstag ja schon abgegeben wurde, bei so einer Zusatz, bei so einer Paketstation Stelle, Sammelstelle, was auch immer. So, und dann stand gestern da, es ist angeblich wieder auf dem Weg zu mir, kam aber nix. Heute steht bei UPS wieder dran, es ist angeblich auf dem Weg, aber wird morgen zugestellt. Die haben keine Ahnung wo mein Zeug ist. Ich glaube die finden das einfach nicht. Gut, das ist jetzt nicht so wild. Ich mein, eigentlich wollte ich ein bisschen Bastelstream machen, deswegen hatte ich mir so ein Elgato, so ein Ding da bestellt. So was ist eigentlich viel zu teuer dafür, aber es ist schön hell. Da kann man Bastelstream so besser machen, also sprich, das nächste Mal wird das Ganze ein bisschen anders aussehen. Und zwar wird das nächste Mal wieder Bastelstream, ich muss mal Chat aufmachen, sonst vergess ich wieder irgendwas. Ja, der Gamer Alex, teilweise weiß ich auch nicht so genau was die da treiben. Ja, ich habe heute, ich habe von DHL, easy money, easy life, ich habe von DHL einen Dingzettel drin gehabt, das angeblich was beim Nachbar wäre. Und da dachte ich mir so, hä, die DHL, ich habe da überhaupt nix bestellt. So, und da bin ich zum Nachbar, mache die Nachbarin das Fenster auf und ich sage, ja Paket. Und dann gibt sie mir ein Paket mit, und jetzt kommt's, mit Weinverpackung. Ah, yes. Und das war tatsächlich an mich adressiert. Und da habe ich mir gedacht, wer zum Teufel schickt mir Wein? Bis ich dann irgendwann drauf gekommen bin, wer mir Wein schickt. Das ist irgendwas von der Arbeit, was ich da halt einfach nicht abgeholt habe, weil ich schon seit einem Monat ein Paket vom Chat, genau. Nee, das ist was von der Arbeit, die verteilen manchmal so ein paar Weihnachtsgeschenke. Und ich war einfach halt nicht da. Ich bin jetzt ja schon, ich habe jetzt ziemlich genau seit einem Monat Urlaub. Debaro sagt, er hat jetzt 200, 100 über Bonding. Was hast du denn wie gebondet dafür? Ich habe echt, ich habe noch nie Wein bekommen, ey. Na ja, gut, es war auch nicht nur Wein, es war irgendwie eine Weinflasche. Und irgendwie Nudeln und Soße und irgendwelche komischen Dinger. Ach, keine Ahnung. Das gibt's bei uns öfters und zeuglich auf der Arbeit als Weihnachtsgeschenke. Ich bin ja der Meinung, das müsste ehrlich gesagt überhaupt nicht sein. Sollten einfach jedem mehr Geld geben, easy. Ich brauche keine Weihnachtsgeschenke. Was heißt, ich habe fast keinen Content gemacht. Weißt du, wie viel Content ich gemacht habe? Spicke, guck dir das mal an. Also, ich habe auf, ich habe auf YouTube, ich habe auf YouTube die letzten Tage, guck dir das mal an hier, 1, 2, 3, 4 Videos gemacht, das ist für meine Verhältnisse viel. Und ich habe eigentlich fast jeden Tag oder jeden zweiten Tag gestreamt. Also, man kann sich nur wirklich nicht beschweren, dass das aktuell wenig wäre. Weil ich mache keine 5-Stunden-Streams oder so. Selfmade, ISE, 7 Monate Dankeschön für den Sub. Huge Subscription. Asif. Genau, was ich euch eigentlich zeigen wollte. Also, hier, letztes Mal Bastel-Stream sah ja so aus. Was ist denn jetzt? So, exellent. Also, so sah es ja im letzten Bastel-Stream aus. Kann man eigentlich Twitch anhalten? Oh, ich habe es irgendwie geschafft, Twitch anzuhalten, ohne dass das Anhaltensymbol eingeblendet wird. Okay, auch gut, da kann ich jetzt ja was sagen, was ich wollte. Und so sah es ja beim letzten Bastel-Stream aus. Ich habe das jetzt viel advanceder, haben wir das jetzt. Ich habe jetzt einen Kamerahalter, was ich hier neben am Tisch habe und ich habe meine ordentliche Beleuchtung bestellt und die Kamera übertragen werde, das nächste Mal auch nicht mehr so doof über diese komische iOS-App. So, ich bin mir nur nicht so ganz... Chat, da muss ich euch jetzt mal fragen. Ich bin mal... Was haben wir eigentlich noch für offene Stream-Ideen? Das kann ich... Das würde ich ja gerne on-Stream machen, meine Wii U-Flaschen, ey. Keck-WWW, das würde ich echt gerne machen. Zumindest, da muss ich euch was fragen. Also, für den nächsten Bastel-Stream. Also sprich, wenn wir das nächste Mal wieder sowas hier in dieser Richtung machen. Was wollen wir machen? Also, ich glaube, mit LED-Leisten haben wir jetzt genug gebastelt. LED-Leisten ist jetzt erstmal vorbei. Sag mal, kann man Twitch irgendwie anhalten, ohne dass es grau wird? Wahrscheinlich, ja. Also LED-Leisten haben wir jetzt, glaube ich, genug gemacht. Und ich glaube, Stecker... Ich glaube, Stecker... Moment. Stimmt, wie sieht es eigentlich mit Rush-Servern aus? Schauen wir mal kurz. Genau, und China-Steckdosen haben wir auch jetzt oft genug geflasht. Guck mal, hier ist ja richtig was los, Alter. Da geht ja richtig was hier. Metro Only, Rush Classics, aber 64-Mann, 64-Mann. Ehrlich gesagt, ein bisschen viel. Official. Gut, da ist keiner drauf. Da bleibt ja eigentlich nur das hier. Der ist nicht Metro Only, der hat alles Mögliche. Ja, genau. Also, um es mal wieder zurückzukommen. Also, es ist ein bisschen schwierig, was wir da machen könnten als nächstes. Ich bin mir da nicht so ganz sicher. Weil ich hätte was Cooles, was ich eh mal erneuern müsste, aber das kann ich nicht ausprobieren im Stream und das ist langweilig. Und zwar, ich hab bei mir ja im Keller noch sowas hier hängen. So ein ganz ollen, vielleicht kennt ihr es noch. Weiß ich nicht, hat das überhaupt noch einer von euch im Keller? So richtig ein Oldschool Stromzähler habe ich im Keller. Also, kennt ihr sowas noch? Ja, ist auch bei euch? Okay. So, und was ich da gemacht habe ist, also wir haben zwei Sachen. Wir haben so einen Stromzähler und wir haben so ein bisschen neueren, wo man so eine LED oben dran hat. Und was ich gemacht habe ist, schon vor einer ganzen Weile, an den Stromzähler kann man leider nicht ran und der ist so ausgebildet, kann man nicht flashen. Aber wenn, kennt ihr mich, ich will ihn flashen. Ne, also was ich gebaut habe ist, einmal was, was diese Scheibe hier abtastet und erkennt, wenn die rumläuft, okay, kann man quasi erkennen. Und einmal was, was die LED oben erkennt, wenn sie blinkt bei diesem anderen Stromzähler, wo ich quasi auch auswerten kann, was ich für einen Stromverbrauch im Haus habe. Ist eigentlich eine ganz coole Geschichte. Wollte ich mal im Stream nachbauen, weil das ist auch jetzt nicht unbedingt mehr das allerneueste Board. Und die Konstruktion ist auch sehr abenteuerlich. Wollte ich im Stream eigentlich nachbauen, aber das Dumme ist, man kann es halt nicht ausprobieren. Ich kann mir ja schlecht auf meinem Basteltisch so einen Stromzähler leben. Warum, was kosten sowas? So, jetzt vielleicht, warum, was kosten sowas eigentlich? Easy. Ich kaufe mir einfach für 9,17 Euro Stromzähler, dann können wir es im Stream ausprobieren. Eigentlich nicht schlecht, ja. Kann man das von Hand drehen? Kennt sich da irgend einer mit aus? Kann man das von Hand drehen? Weil anschließend werde ich den bestimmt nicht, ja. Kann man das von Hand drehen? Nee, kann man nicht. Na, das ist ja doof. Polarfuchs, zwei Monate, danke schön für den Sub. Sorry Leute, falls ich irgendwas übersehen habe, aber danke für die huge zwei Monate Subscription. Ich roll mal kurz Chat durch. Selfmade Eyes hab ich gesehen. Nee nee, sonst hatten wir nix. Genau, also das ist das eine, das wollte ich eigentlich im Stream nachbauen. Also kein Stromzähler, sondern mein Stromzähler-Abtast-Projekt. Dumme ist, es ist halt echt dumm, dass ich nicht ausprobieren kann, ja, im Stream dann. Das sackt. Die LED-Abtaste könnte man ausprobieren, aber alles andere nicht. Kannst du da einfach eine Steckdose anschließen? Ja, aber da muss ich den Zähler anschließen. Ich will den Zähler gar nicht anschließen. Da muss ich dann irgendwelche Stromdinger drum basteln. Will ich gar nicht. Nee nee, da müsste ich mir erstens einen kaufen und außerdem müsste ich irgendwie drum basteln. Das heißt, das Projekt ist ein bisschen doof, um das im Stream zu machen. Ich weiß nicht, aber könnte man trotzdem machen. Vielleicht kann man das irgendwie simulieren, dieses Ding, wenn es da durchläuft. Ich nehme dann einfach irgendeine Verpackung oder Alufolie oder so und mache einen Strich drauf und ziehe das dann durch und dass man halt einfach sieht, dass es funktioniert. Ja, was muss man da anschließen? Wie geht denn das? Ich habe keine Ahnung. Ich meine, hier klemmt man das wohl irgendwie dran und sehr gut. Ich meine, ich kann ja wahrscheinlich. Nee, das lasse ich bleiben. So, also das ist, wie gesagt, das eine, was man machen könnte. Ich kann noch mal kurz meine Ideen durchgucken. Und das andere weiß ich nicht so genau. Also ich habe mir überlegt, man könnte was machen, was jedem so ein bisschen was bringt. Hast du die Nanoleaf-Dinger versucht zu drucken? Nee, nee, habe ich nicht. Ich überlege gerade, was wir als nächstes im Bastelstream machen könnten. Ich wollte mein Stromzähler-Ding quasi neu nachbauen, aber das funktioniert nicht. Was ich mir dann überlegt habe, was wir machen könnten, ist, das ist jetzt halt für Leute, die ein bisschen was mit Controller gemacht haben, schon nicht so ultraspannend. Und zwar, wir könnten uns einen eigenen Multisensor bauen, also sprich ein Sensor mit, also ein Board, dann brauchen wir ein Gehäuse, vielleicht 3D drucken wir das auch. Und Luftfeuchtigkeit, Temperatur, Luftdruck, Bewegungsmelder und Sensor, ob Licht an oder aus ist. So was ist, denke ich mal, insofern ganz praktisch, weil, ich weiß, der Chat mag den Desktop, deswegen zeige ich den Desktop immer. Ich weiß nicht, ist es euch so lieber? Vielleicht noch. Ich glaube, so ist es noch besser, oder? Ah, yes. 2x Firefox, ja, ein Firefox kann man nie genug haben. Bitte ein Eierjahr als Background, nee, nee, ich behalte das Windows XP. Such mal was, was soll ich suchen? Disk TXT, da, ist es. War das jetzt, sollte das jetzt eine Challenge sein? Ich hätte gedacht, dass ich das so schnell finde, ne? Wie hat sich Microsoft Edge reingeschlichen? Das ist ganz einfach, wie sich Edge reingeschlichen hat. Der Kram ist vorinstalliert mittlerweile. Oder wird, wird, wird mittlerweile mitinstalliert. Also, insofern, der ist einfach standardmäßig da. Hast du schon mal was mit Maschinellem Lernen gemacht? Ja, aber nur als Benutzer von der Library. Ich habe nichts quasi da algorithmmäßig selbst implementiert, ja. Also, ich bin ja gerade dabei, was zu entwickeln, wo man seine Überwachungskameras reinmachen kann. Und der dann erkennt, wenn jemand durchs Bild läuft. Das funktioniert auch ziemlich gut, habe ich auch schon im Stream gezeigt hier. Und ja, das verwende ich gerade. Genau, also wie gesagt, so einen Multisensor könnten wir bauen. Was zum Geier wird Amazon jetzt mit Finanzierung, ja, ja, ich glaube mit Finanzierung ist klar. Was sagt uns, was sagt Amazon eigentlich hier zu Weihnachtsgeschenken? Habt ihr schon eure Weihnachtsgeschenke? Ich habe noch nichts, ich habe noch gar nichts. Und ich brauche noch was und ich habe keine Ahnung, was ich kaufen soll. Was haben wir da oben? Ah ja, so ein Cuttermesser für meine Mutter. Exzellent. Ich glaube, dass ich das richtig schenke. Oh, guck mal, es gibt einen China, es gibt einen China-Roller. Hast du eine Klimaanlage, in der du rumbasteln könntest? Ja, habe ich schon gemacht. Haben wir schon im Stream gemacht. Guck mal, ein China-Roller. Und warum genau ist der so teuer? Hä? Ach, das ist ein E-Scooter. Mit Straßenzulassung. Es ist witzig, dass man den überhaupt ohne Straßenzulassung bestellen kann. Weil mal im Ernst, wie viele Leute bestellen sich das Ding ohne Straßenzulassung und fahren damit auf der Straße? Wahrscheinlich jeder. Ich meine, wer bestellt sich so ein Ding ohne Straßenzulassung und fährt dann nicht damit? So was ohne Fahrt, das ist total eingepflegt. Den kann man flashen? Easy. Kann man den echt flashen? Moment, wie heißt das Ding? Moment, das muss ich jetzt nachgucken. Wie heißt denn der Modellnummer? Jetzt gucken wir mal, ob wir Custom-Firmware drauf machen können. Wie heißt das Ding? Hier. M365 Pro. Exzellent. Das hier ist Custom-Firmware. Custom-Firmware-Erfahrung mit dem Roller. Nice. Da muss ich gleich gucken. Guck mal, es gibt einen Custom-Firmware-Bilder für den Roller. Wow. Äußerst vertrauenserwürdige Seite. Ein Custom-Firmware-Bilder für den Roller. Okay, das finde ich geil irgendwie. Wie viel kostet der? Moment. Moment, Moment, Moment, Moment, Moment. Also, der mit 30 Kilometer Reichweite, der hat wahrscheinlich einfach einen kleineren Akku drin. Sehe ich das richtig? Hier, 205 Wattstunden Lithium-Ionen-Batterie und der hat? Steht nicht dabei. Auch? Nee, Moment. Ach nee. Ja, wahrscheinlich, wahrscheinlich einfach ein bisschen mehr. Aber das ist tatsächlich ganz interessant. Ich meine, man könnte, man kann sich doch dann einfach den da kaufen, Custom-Firmware drauf machen und, und, und, und, und easy, easy Turbo, oder? Das ist doch immer eine geile Idee. Nein, ich will natürlich hier keinen dazu anstiften, irgendwelche illegalen Dinger zu machen. So, das wird im Moment, das Video muss ich mir jetzt angucken. Der Roller mit der Custom-Firmware, Alter, das muss ich mir jetzt. Oh, Cocomodates am Start. Na, nee, also ich glaube nicht, dass du Probleme kriegst. Roffel, wenn du einfach nur Custom-Firmware draufflasht, die nicht schneller fahren kann, als zugelassen ist, ist das wahrscheinlich kein Problem, ja. Und mal davon abgesehen, es ist an sich auch kein Problem, solange du nicht schneller fährst. Ich gehe mal davon aus, ich hab keine Ahnung, wie das rechtlich ist, by the way. Ich denke jetzt einfach mal nur laut. Ich glaube, es ist ziemlich egal, ob dein Roller, ob du den mit Custom-Firmware, vielleicht, die keine Ahnung, 150 kmh fahren kann, wenn du nur 20 kmh fährst, ist egal. Speedchamp, genau, das muss ich mir jetzt ein Custom-Erfahrung mit... Ich finde, okay, das finde ich interessant, dass man Roller Custom-Firmware flaschen kann. Aber auf der anderen Seite, warum eigentlich? Warum sollte man den... Leute, ich nehme das zurück, die Frage stelle ich mir bei anderen Sachen auch nicht, weil es geht. Aber mich würde es trotzdem mal interessieren, warum sollte ich den Roller flaschen mit Custom-Firmware? Ach, ist das wirklich so, chat? Wie gesagt, ich kenne mich da nicht aus. Also was Auto und Verkehrssachen angeht, bin ich ja der übelste Kacknubig, man guckt euch mein Auto an. Ist das wirklich so? Also, ist das illegal, wenn ich meinen Roller Custom-Flasche? Ich meine, solange ich mich an die maximale Geschwindigkeit halte... Aha, okay, ich sehe da Chat, der Chat kennt sich aus, nee, dann lohnt sich das nicht. Dann lohnt sich das ja nicht, den Custom zu flaschen, das ist ja dann sinnlos. Das macht ja wirklich gar keinen Sinn. Wenn ich damit dann nicht mal auf der Straße fahre, also wenn ich mir einen Elektroroller hole, dann will ich damit auch auf der Straße fahren können. Wie schwer ist denn sowas? Ich muss mir jetzt mal einen Test zu diesem Ding angucken, das interessiert mich jetzt echt. Weil ich muss euch ehrlich sagen, ich lieb Eugeln schon die ganze Zeit. So ein bisschen mit einem Elektroroller. Wie hieß dieses Ding nochmal? M365 oder so? Da muss ich mir jetzt mal kurz einen Test angucken. 12 Kilo! Okay, das ist schon ein busy was, das würde ich jetzt nicht unbedingt im Zug mitschleppen müssen. Wobei, das kann man eben bei sich herrollen. Oh, Max 100 Kilo! Oh, wird ganz knapp. Ob es mich aushält? Aber ich muss natürlich, wenn ich das fahre, da muss ich auf jeden Fall meine Gunner Optics Scope Brille aufziehen und dann mache ich die 60s damit. So, ich muss mir damit echt einen Test angucken. One year later. Still best e-Scooter 2020. Okay, gibt es das Video auch noch in kurz? Ey, mit so einer GoPro Kamera sieht das aus wie ein Miniatur Fahrrad, oder? Guck mal, das sieht aus als fährt er so ein Minifahrrad mit der Kamera. Das ist ja nice! Ich brauche so einen Teil. Gibt es diese Dinger bei euch in der Stadt nicht zu mieten? Doch! Deswegen, ich finde die ultra nice. Was aber witzig ist, das ist typisch Frankfurt bei uns, ne? Am Anfang hast du die Dinger überall gesehen, mittlerweile ist schon die Hälfte weg. Weil die Leute, die keine Ahnung in meinen geschmissen haben oder so. Es sind viel weniger als noch vor einem halben oder vor, es sind viel weniger als vor einem dreiviertel Jahr oder einem Jahr, wo das angefangen hat. Letztes Jahr hat das, glaube ich, angefangen oder Frühling oder so hat das angefangen. Frühling, Frankfurt war alles voll mit e-Scootern und mittlerweile stehen da viel weniger rum. Und ich wette mit euch, Leute haben die in meinen geschmissen und sowas. Es gibt so viele fertige Leute in Frankfurt. Einfach selber kaufen, ne wieso? Ich bin ja nicht nur in der Innenstadt von Frankfurt unterwegs, wo es so Dinger gibt. Ja, ich wohne ja nicht direkt in Frankfurt und gerade da, wo ich wohne, ist das gar nicht mal schlecht, wenn ich so ein e-Scooter, weil ich fahre halt nicht gern Auto, das wisst ihr ja. Und mein Auto ist halt e-Scooter. Ihr kennt mein Auto, ja. Das will auch nicht, dass ich oft mit ihm fahre. Und so ein e-Scooter, wenn ich mal irgendwie was einkaufen will, das ist eigentlich was richtig Cooles. Und wie lange geht es? 30 km? Das reicht, ja. Kennt ihr mein Auto? Okay, okay. Ich muss es, okay Leute, ich muss es nochmal revealen. Es gibt kein Ausrufezeichen, Auto. Ich hab einen. Auch genau in der Farbe, Alter. Ich weiß, jetzt kommen die Alten, jetzt kommen die erst mal wieder an, Alter, Max, Ghetto, Auto oder irgendwie sowas. Aber GG, GG, ja. Nicht doch, das ist mein Ernst. Was habt ihr alle ge-, ich verstehe das gar nicht. Was, warum findet der Chad mein Auto so lustig? Das ist, das ist huge Auto, ja. Da passe ich gut rein. Das ist recht hoch. Das war nicht teuer. Und ich brauch's nicht oft. Vor allem auch in der Farbe. So, gut. Haben wir uns, jetzt haben wir uns erstmal alle eine Runde wieder über das Auto von Max gelacht. Wunderbar. So, könnt ihr euch jetzt vorstellen, warum ich lieber E-Scooter fahre? Nee, ich, wie gesagt, ich bin kein großer Auto. Ich mag, ich bin, fahre nicht gerne Auto. Aber ich finde das Ding übelst nice. So, und 20 km reicht auch, 30 km reicht auch voll und ganz. Das, ich finde das, finde das echt nice. Na ja. Ja, und 30 km, das war nicht, wobei, wobei ist halt die Frage, ne, ob die 30 km Angabe realistisch ist. Ich meine, die Chinesen sind ja nicht dafür bekannt, da realistische Zahlen auf ihre Sachen zu schreiben. Ja, 20 km reicht. Ist das der Akkustand oder ist das die Geschwindigkeit, was man da drauf sieht? Die Geschwindigkeit, hä? Der Akkustand ist hier unten. Das da unten ist der Akkustand. Da oben ist die Geschwindigkeit. Darf man das Ding, ja, das ist wohl ok. Das wird gerade bei Amazonie verkauft. Guck mal, da hat man sogar eine Bremse. Ich finde das geil. Ich will jetzt echt mal überlegen, ob ich mir einen kaufe. Das hat irgendwie was. Aber das Dumme ist, braucht man China Cloud dafür? Mi Home App, oh, geh mal weg, Alter, diese crap China Software da. Nein, ich mach da keine Custom Firmware drauf. Das Problem ist, ein Custom Firmware, ich finde, Custom Firmware ist ja das Beste, was man machen kann, aber gerade wenn man auf der Straße fährt und wenn es dann rechtliche Probleme in Deutschland gibt, dann lasse ich das eher sein. Ja, nee. Ich finde das geil. Irgendwie hat das was. Ich mein, alternativ könnte man sich ein Fahrrad holen, ne? Dann wären wir auch nicht mal pepo fett. Jetzt habe ich jetzt, Leute, ich habe die Idee. Ich hole mir erst ein Fahrrad und dann fahre ich so lange Fahrrad, bis ich unter dem Maximalgewicht vom Roller bin und dann fahre ich so lange Roller, bis ich wieder über das Maximalgewicht vom Roller komme und dann fahre ich wieder Fahrrad. Das ist auch ein guter Plan, oder? Jetzt wird der Wasserplan gespielt. Nee, aber Leute, jetzt mal, wie würde, Hand aufs Herz. Ich bin unter dem Maximalgewicht vom Roller, weil ihr könnt euch ja noch dran erinnern, als wir die Waage im Stream getestet haben. Nur, ich habe kein Fahrrad. Ich wollte mir das so eine Weile kaufen. Als wir die Waage im Stream getestet haben, weil weiß ich, ob da noch irgendjemand dabei war, der gerade am Start ist. Wir haben ja mal eine Waage getestet im Stream. China-Plutus-Waage, genau. Ah, das war was anderes. Die CD-Key gehen übrigens nicht. Falls jetzt irgendjemand denkt, oh, hier, nice, CD-Key. Das sind Fake-CD-Key. Das war was anderes. Da haben wir Zeug programmiert. Ist ja auch egal. Zumindest in dem Video mit der Waage, vielleicht erinnert sich der eine oder andere noch was, da hatte ich glaube ich 102 oder so. Also knapp, knapp, knapp über 100 rüber. Und seitdem ich da letztens mal eine meldepflichtige Krankheit hatte und ich will es jetzt nicht ausdehnen, aber die Leute, die öfters am Start sind, wissen es ja und es war kein Corona. Da habe ich insgesamt glaube ich fast 5 Kilo abgenommen. Gut, ich meine, da ging es ja auch rund. So, exzellent. Gut, dass wir das jetzt nochmal geklärt haben. Gut, das mit Custom-Firmware und dem Roller lassen wir jetzt mal bleiben. Der Gamer Alex, nee, du darfst nicht. Du musst machen, wie ich es vorgeschlagen habe. Fährst du jetzt Fahrrad? Oder wenn du drunter bist, dann fährst du Roller. Sodass man immer quasi so genau an der Zulassungsgrenze ist. Exzellent oder an der anderen erlauben. Hast du einen Steam-Controller? Hab ich einen Steam-Controller? Ich überlege gerade, ob ich mir irgendwann sowas gekauft habe. Nee, nee, habe ich nicht, habe ich nicht. Bei Aliexpress gibt es einen Rennrad für 170, zeige ich mal. Das muss ich mir angucken. Okay, nee, ich mache das jetzt zu, sonst kaufe ich den Kram auch noch. Äh, Browser? Hallo? Ah, jetzt geht es okay. Ja. Gut, dann werden wir im nächsten Stream so einen Multisensor basteln mit Bewegungserkennung und Temperatur und Luftfeuchtigkeit und sonst was. Wohlgemerkt, aber erst, sobald UPS das mit der Beleuchtung geschafft hat. Wenn UPS mir dieses Elgato-Ringlicht bringt, dann machen wir Bastel-Stream wieder. Ach ja, und mir hat im Discord einer was richtig Nices geschickt und zwar GitHub OBS Ninja. Das kann ich verwenden, um meine Kamera besser in OBS reinzukriegen, ohne diese komische App verwenden zu müssen. Funktioniert ein bisschen wie meine Überwachungskamera-App. Nur, dass du den Browser auf dem Smartphone aufmachst und dann machst du den Browser auf dem Desktop auf und die bauen eine Low-Latency-Verbindung auf und dann machst du einfach in OBS den Browser als Source rein. Eigentlich ziemlich nice Idee. Können wir einen... Die Kombination aus Themen, das ist ja genau das Richtige für mich, ja. C++ zu Cobaltranspiler. Also erstens, keiner möchte irgendwie was programmieren, was C++... Ich weiß, dass es T-Bate ist, aber trotzdem ist ja was zu sagen. Erstens, keiner möchte irgendeinen Paser für C++ programmieren. Ich glaube, wenn irgendjemand wirklich in Auftrag bekommt, einen Paser für C++ zu programmieren, der stürzt sich lieber von der nächsten Brücke anstatt damit anzufangen. Ich glaube, C++ ist so eine Sprache. Mehr Ausnahmen und Dreck kannst du da nicht einbauen. Das geht nicht. Und dann auch noch zu Cobalt. Also das ist wirklich die Höchststrafe, ne. Jo. Was kostet eigentlich gerade? Leute, ihr merkt, ich hab heut nix geplant. Ich hab einfach mal angemacht, weil mir ist eine Sache aufgefallen, das muss ich jetzt mal, muss ich jetzt mal. Ups. Falsch ist die Mode. Chat. Moment. Mir ist was aufgefallen. Ich hab gestern da nicht gestreamt und am Sonntag auch nur kurz, weil ich Steuererklärungen fertig machen wollte. Mir ist aufgefallen, dass ich bin das mittlerweile so dran gewöhnt, jeden Tag oder jeden zweiten Tag zu streamen. Mir hat echt heute was gefehlt, hab ich mir gedacht, ich hab jetzt den ganzen Tag und gestern auch nicht. Ich mach jetzt einfach mal streamen an. Ja. Exzellent. Viva Breaker. Twitch Prime. Dankeschön für den Sub. Vorausgeschaut. Exzellent. Ja, dafür hab ich die auch vor einem Jahr oder so gekauft. Mal gucken, ob die billiger geworden sind. 14 TB. Sag mal, sind die alle ausverkauft? Gibt's da auch welche mit nur 4000 Umdrehungen? Die sind leiser. Ok, kosten auch genau das gleiche wie vor einem Jahr. Ja, und eine 4 TB SSD möchte ich mir auch gern kaufen. Gibt's aber nicht. Weil Samsung sich denkt, warum sollen wir eine 4 TB, also NVMe. Also eine NVMe, ne? Äh, nein. Ah, das ist ein Schnapper. Der ist sofort... Moment, wann ist das lieferbar? Dezember bis 25. Februar? Löten die das in China direkt für mich zusammen oder was? Paints Champ, ey. Das... Oh Gott. Also ich versteh's ja, wenn man ne Grafikkarte kauft mit irgendeinem Spielebundle. Oder ich versteh's auch, wenn man Gears of War Fan ist und kauft sich ne Xbox im Gears of War Look. Aber warum brauch ich denn um alles in der Welt ne NVMe SSD, die irgendwo am besten noch hinter dem Mainboard rumgammelt, eingebaut, mit dem Call of Duty Logo? Das ist die verschwendetste Promotion-Dingsgedöns und Sache aller Zeiten. Ja, aber die Cosa will ich mir nicht kaufen. Ich warte schon seit Ewigkeiten auf ne 4 TB Samsung Evo oder sowas. Gibt's aber nicht. Es gibt Zata. Ist ja schön und gut, wenn es Zata gibt, aber ich hätt gerne NVMe. Ja, die können ja mein wenigstens fette Kühler drauf machen und mich nicht. Ja, die Sache ist, ich glaube gar nicht mal, dass die Cosa schlecht ist, aber ich hab halt bisher immer wirklich gute Erfahrungen mit Samsung gemacht, deswegen wollte ich mir eigentlich auch von denen eine kaufen. Letztendlich muss man aber auch mal ehrlich sein, es lohnt sich überhaupt nicht ne 4 TB SSD zu kaufen, rein preisleistungsmäßig. Du kannst dir für weniger als die Hälfte 2x2 TB kaufen, wenn du das wirklich willst, und preisleistungsmäßig lohnt sich das überhaupt nicht. Was uns aber ja oftmals nicht davon abhält. Ja, Battlefield können wir wieder dazu machen. Wie gesagt, ich hab gegen Cosa nix. Ich hatte nur noch nie eine und ich bin wirklich richtig zufrieden mit Samsung SSDs. Ich hatte noch nicht eine Samsung SSD, die mir verreckt ist bisher. Wisst ihr was die einzige SSD ist? Kein Witz jetzt. Die einzige SSD, die mir bisher verreckt ist, also ich hatte ja schon alle möglichen Sachen. Ich hatte billigste 32G SSDs, ich hatte damals zu Release für irgendwie 700€ eine 2 TB Samsung SSD gekauft, ich hatte alle möglichen SSDs. So, und die einzige SSD, die mir verreckt ist, ist eine Enterprise Intel SSD für Server, die war auch eine kleinere, also die ist auch schon ein bisschen älter gewesen. Ja, gut, ich hab ehrlich gesagt keine Ahnung was das für eine war, aber die war klein. Frag mich nicht, die war, die war als Hochkom 128G oder sowas. Ja, ja, Valentin war richtig. Das einzige was mir bisher, das war so ein Silberner, sowas hier in der Richtung. Ne, ne, ne, nur noch mit Intel Logo drauf, aber kein Metall, kein Metallgehäuse, sowas hier in der Richtung war das, genau. So. Und eigentlich witzig, ne, dass das einzige was mir verreckt ist, ist irgend so ein teures Business Server Ding. Und was noch viel schlimmer ist, wisst ihr was, ja das wisst ihr, das hab ich euch ja schon oft genug gesagt. Wisst ihr was das einzige ist, was mir bisher in meinem ganzen Server Rack verreckt ist? Ich weiß, der Chat weiß es aber, vielleicht sind ein paar Leute neu da, die es nicht wissen. Das einzige was hier drin verreckt ist, ist die, ist die, ähm, USB. Nichts anderes. Und ich hab mir die USB ja gekauft, gerade um dafür zu sorgen, dass das andere nicht verreckt. Und das einzige was mir verreckt ist, ist die USB. Und so genau kann man das natürlich nicht sagen, weil vielleicht hat er die USB schon dafür gesorgt, dass manche Sachen nicht ausfallen und dementsprechend hätte ich anderweitig einen Ausfall gehabt, ja. Aber so wirklich einmal komplett Rack aus, war nur als die USB verreckt ist. Wahrscheinlich sind die Batterien weg oder so. Jetzt betreibe ich es ohne USB. Naja. Übrigens voll beliebt das Video, ne? Vielleicht soll ich da mal ein Update machen, das dumme ist, da gibt es kein Update für. Das sieht noch genauso aus, der einzige Unterschied ist, dass ich die Kiste hier nicht mehr in Betrieb hab und diesen Access Point nicht mehr verwende. Aber ansonsten gibt es da eigentlich nix. Ich glaub sogar noch der Track, den ich hier im Video in der Ecke liegen hat, liegt glaub ich immer noch in der Ecke. Ähm. Egal, mach. Batterien sollten wir alle zwei Jahre tauschen, ja hast du recht, aber... Warum tauschen, wenn sie noch geht, ne? Übrigens das letzte Video hier, ne? Das hat jetzt zwar insgesamt, ich mein das ist jetzt nix was ich sonst so auf den Channel mache, ne? Das hat jetzt zwar insgesamt nicht so wahnsinnig viele Views oder irgendwas in der Richtung, aber wisst ihr was bei dem Video wirklich gut ist? Die Viewtime. Die Leute haben, normalerweise gucken die nie so lange. 90% haben das Video, ne Schwachsinn, stimmt nicht. Im Durchschnitt gucken sich 90%, es wird sich 90% des Videos angeguckt. Normalerweise gucken die Leute so, frag mich nicht. 60, 70% oder so von dem Video. Also das ist schon Pock. Du hast das Video viermal geschaut, exellent. Nice. Ja, also was ich ja gut finden würde, wenn der YouTube Algorithmus das dann irgendwann checkt, vielleicht promoten die das ja mal ein bisschen. So nach dem Motto, oh Video mit sehr hoher Viewtime, wir zeigen das mal zumindest irgendwo ein bisschen so rum. Naja, auf jeden Fall nice. Ja Leute, so siehts aus. Wammeln jetzt? Max up in die Trends, so muss das sein. Stonks, Alter. Habt ihr eigentlich mitbekommen, dass Pornhub 80% seiner Videos gelöscht hat? Weiß gar nicht ob heiße was dazu geschrieben hat. Habt ihr was zu Pornhub geschrieben? Habt ihr es mitgekriegt? Ja. Kein Toss, man sieht ja nix. 80% der Videos gelöscht. Also da sieht man, hätte Pornhub mal ein bisschen genauer den Content kontrolliert, den die so hochladen, hätten sie das Problem nicht gehabt. Das Problem dahinter war nämlich, das Problem hier hinter war nämlich, dass die, nee ich mach das jetzt nicht aus, man weiß ja nicht ob da vielleicht irgendwie was Toss ist. Das Problem war nämlich, dass Leute auf Pornhub irgendwelche Kinderporn und Dinge hochgeladen haben, irgendwelche Vergewaltigungsvideos und Pornhub hat es nicht geschafft das zu kontrollieren und das schlimmste war, dass manches dieser Videos sogar monetarisiert waren. Also ihr überlegt euch mal, ja, irgendeiner legt illegalen Porn hoch auf Pornhub und Pornhub monetarisiert das automatisch und das heißt, die haben da so krass gefailed, dass sie das nicht gecheckt haben und kontrolliert haben, dass es ihnen im Endeffekt jetzt auch irgendwie zurecht passiert, ja, aber die haben sich jetzt halt überlegt, weil sie auch von Mastercard und Visa geplockt wurden, also was geplockt, entgekickt oder entpartnert oder was auch immer und jetzt ist dir nichts anderes eingefallen wie 80% ihrer Videos zu lesen und das machen die bestimmt nicht einfach so aus Spaß an Freude, die haben das bestimmt abgewogen, die haben gesagt, hey, jetzt alle Videos zu kontrollieren ist aufwendiger als einfach alle 80% zu löschen. Auf der anderen Seite ist es nicht wirklich schlimm, weil es ist das Internet, also sprich, wenn jetzt irgendwie einer da Videos hatte, die er gerne geguckt hat und die gibt es da jetzt nicht mehr, da kann man sich im Internet ziemlich sicher sein, dass die jetzt woanders landen. Ja leider auch die Videos, um die es ursprünglich ging, die sind wahrscheinlich auch mittlerweile irgendwo anders, so ist das halt im Internet, ja. Einmal irgendwo was hochgeladenes kriegst du nie wieder raus. Passt nicht zum Thema, aber bei mir geht die Klammer nicht. Äh, hast du vielleicht englische Tastatur eingestellt? By the way, schau dir mal den Aruba, ein was für ein Ding, Moment, das muss ich mir jetzt machen. Aruba 24G 4S, oh mit SFP, das ist ja hier richtig. 4SFP, ok ich suche einfach nach JL3-Dings, hast du nicht gesehen. By HP. Ok, was haben wir denn da, zeig mal her. Kost, ist das so ein Ding, was man sich gebraucht kaufen muss, weil zu teuer. Ist schon recht teuer, ah Moment, das geht ja. Das ist gar nicht teuer. Das ist echt gut, 180€, ey das ist echt gut, so das muss ich mir jetzt mal ein bisschen genauer angucken, exzellent. Das muss ich mir jetzt mal ein bisschen genauer angucken, also was haben wir denn da am Start. Also wir gucken uns erstmal, wir gucken uns zwar das wichtigste, was man sich bei einem Switch immer angucken muss, erstmal ein Bild von. So, also wir haben 24 Ports, was 24, komische Gruppierung oder, 12 und 12, normalerweise machen die ja immer 8, 8, 8 oder so, 12, ok. Also 2x12 Ports und SFP+, 4 Stück, 4SFP 24G und das für 170, 180 und das ist wirklich gut, das ist wirklich gut. So, jetzt müssen wir uns einfach mal die Specs ein bisschen genauer angucken, also. Wie managet man den, ist das irgendwelche special HP CLI Geschichten, die man dafür braucht oder haben die auch ein halbwegs brauchbares Webinterface wie MikroTik. 1906, 90er CLI, ja die Befürchtung habe ich auch. Ok, also 7 fortschrittliche, hä, ist bestimmt nicht 7 Switche drin, was wollt ihr, was möchte mir HP damit sagen. Option über die lokale WebUI, das ist doch schon mal gut. Ich finde das cool, dass die mittlerweile dabei schreiben, lokale WebUI, so nach dem Motto, ok, ich brauch keine komische Cloud-Lösung von HP. Also Spezifikation zeig ich mal her, was haben wir denn da. Das ist vollkommen in Ordnung, also durchschnittlich wird das, also im Heimgebrauch, ja wenn man da nicht viele Ports benutzt, da wird das eher in dieser Richtung sein, um die 10 Watt nicht so wie das. Kann der PoE, nee oder PoE ist da nicht auch noch mit dabei, das wird mich jetzt auch sehr wundern, weil dann kommt nämlich die 22,6 Watt überhaupt nicht hin, maximal. Ok, Eingangsspannung, blablabla, Switching Leistung, 128 GB, ich hab jetzt keinen Vergleich zu den gleichen Mikrotik-Dingern, aber das erscheint mir erstmal absolut in Ordnung. Das sind Packets, oder? Oder was sind MPPS? Aber was interessieren mich überhaupt Packets auf dem Switch? Alter, was tut das, ist das immer noch Journey-Soundtrack? Ja, das ist immer noch Journey-Soundtrack, exellent. Der ist wirklich super entspannt, ne. So, der hat auch keinen, wenn ich das richtig verstanden hab, der hat auch keinen Lüfter, was auch schon ziemlich cool ist. Was stellt Twitch gerade an, echt? Zeig mal her. Oh. Ah Leute, gut, dass ihr, nicht Refreshed, Refreshed bloß den Stream nicht. Wenn ihr den Stream Refreshed, ist alles kaputt. Oder auch nicht. Nicht Refreshen, ne, aber das, finde ich, sieht ganz gut aus. Okay, zeig mal was. Was wird man auf Amazon dafür bezahlen? 200, ja. Das ist echt gut, das gefällt mir, das Teil. Also, ich mein, ich brauch's nicht, aber, aber, ja, warum nicht, ja. Ein bisschen. Ich würd allerdings immer noch sagen, wenn man was kleines braucht, äh, wenn man was kleines braucht, dann sollte man sich den hier holen. Ach, was interessieren mich statische Routen und Gedöns aufm Switch, die Switcher aufm Switch. Ja, also wenn man was kleines braucht, sollte man sich den holen, die gibt's auch um die 100 Euro, aber für alles ein bisschen größere, ist das wirklich eine gute Sache, das ist halt, das gefällt mir, also, bookmark ich mir mal, kann bestimmt mal gebrauchen. Aber was hört man noch? Oh, jawoll, der muss jetzt. Der Bible Thump Soundtrack schlechthin. Wobei, das ist mir zu Bible Thump Soundtrack. Ah, yes. Halo Soundtrack, ich muss euch sagen, ich bin kein großartiger Halo Fan. Ja, steigt mich, aber, äh, der Halo Soundtrack ist poggers. Der ist massive poggers. Eigentlich der Halo Soundtrack ist best am ganzen Spiel. Junge, deine Taskbar. Hä? Was gegen die Taskbar einzuwenden? Also wenn man jetzt was gegen den Desktop sagt, das kann ich ja noch verstehen, aber was ist an der Taskbar das Problem? Äh, warum nutzt du Ubuntu für deine Server und nicht Debian? Äh, Gewöhnung. Tymta ist, wat? Warum hab ich da Cortana drauf? Das ist ne gute Frage, wo kommt der Cortana her? Hatte ich das schon immer auf dem Desktop Cortana? Wo wir grad bei Halo sind? Bäm. Cento ist Ding mit IBM schon besprochen. Ja, da haben wir uns letztens mal kurzzeitig drüber ausgelassen. Ähm, ist halt Fail. Aber mal gucken, wie das mit diesem Alternativprojekt da wird. Kennst du schon den Microsoft Cortana Fail? Ne. Du meinst jetzt Cortana an sich oder was? Ne, also, ich, gibt's jetzt mal ernst gemeinte Frage Chat. Gibt's jemand von euch, der wirklich Cortana verwendet? Das erste, was ich unter Windows zumindest immer ausblende, ist Cortana. Ich verwende ja auch generell keine Voice Assistance. Das einzige, was ich mir gefallen lasse, ist, wenn man irgendwie im Auto vielleicht ne Voice Assistance verwendet, aber, ähm, ja, ähm, zumindest, ich benutze auch sonst keine Voice Assistance, aber ich bin der Ansicht, dass wenn man alles so mal gegeneinander mal so vergleicht, also sprich, du hast Google Assistant, du hast Cortana, du hast Siri, du hast Alexa, dann bin ich der Meinung, von allem dem, was ich so mitbekomme aktuell, auch als jemand, der es nicht benutzt und dementsprechend keine Sache irgendwie besonders bevorzugt, ich denke, dass Alexa aktuell das bessere System ist als die restlichen. Auf Platz zwei kann ich schlecht einschätzen. Ich, ich hab den Eindruck, als wäre Google mit Google Assistant ein bisschen abgehängt bei der ganzen Geschichte. Das kann ich jetzt aber echt schwer sagen, weil ich es halt nicht selbst benutze. Ähm, mir kommt es so vor, als jemand, der es halt einfach nur beobachtet, als ist Alexa vom Können, vom Ökosystem und den zusätzlichen Modulen, die es gibt, das Beste. Dann, äh, zweiter Platz, tja, kann ich, wie gesagt, kann ich schlecht sagen. Ich würde mal eher auf Siri tippen, wenn man eben in Apple unterwegs ist. Ähm, aber ansonsten ist ja egal, weil zweiter Platz ist dann Siri oder Google Assistant, je nachdem, was man verwendet. Und letzter Platz dürfte da wohl eindeutig an Cortana gehen, ne? Geh mal in Setting Apps, Cortana. Ja, mich wundert's eigentlich, dass du, äh, dass, dass, Apps. Das da? Nee. Dieser Windows. Wie man findet dazu Cortana. Was? Gibt's nicht. Guck mal. 0W. Kann man nicht deaktivieren, es, es, äh, ist nicht gebaidet. Der Desktop, den, den habe ich ja nur für den Stream so. Was wir heute machen, ja, es ist ja heute kein Stream, also machen wir im Stream auch nix. Gibt's eigentlich noch, noch das alte? Ja. Es wird aber weniger. Also, Microsoft kann ja, kann ja machen, was sie wollen und die werden definitiv nicht drauf hören, was ich sage. Aber, sagt was ihr wollt, Leute. Die alte Systemsteuerung hatte irgendwie eine sinnigere Struktur und mehr Optionen als die neue. Ich mein, allein schon, dass man keine Bildwiederholrate einstellen konnte bis zu Windows Update und dass man keine Maus Sensitivity richtig einstellen konnte bis zum vorletzten Update. Sagt ja wohl alles, oder? Das ist hier, guck mal, das ist ganz neu hier. Äh, ich weiß gar nicht, wo es ist, ehrlich gesagt. System. Display. Advanced. Genau, das hier. Das ist ganz neu. Das gab's letzte Windows Version noch nicht. Und Windows ist hier auch super korrekt. Es sind 239,760 Hertz. Ah ja, alles klar. Früher musste man hier drüber gehen. Äh, oh, oh, oh. Oh, was ist das? Jetzt bin ich ja schon wieder. Nee, Display Settings. Advanced Settings. Display Adapter. So. Warum sind das eigentlich da? Da wird aufgerundet, oder was? Man kann das auch, ja ja, man kann das auch über die Grafikkartensettings einstellen, natürlich, ne? Aber ich mein, jetzt mal ernsthaft. Also, Settings für die Bildwiederholrate, das konnte Windows 1 wahrscheinlich schon. Das ist der Halo Reach Soundtrack, ja. Der Sebaro hat irgendwas gefragt, seh ich ja jetzt erst. Wo ist er? Wo ist der Cute Mod? Äh, ja. Kannst du mir Folgendes erklären? Als nicht voll beschäftigt der Mitarbeiter mit 15,38 vom 100, was? Der regelmäßig eines voll beschäftigen auf bestimmte, äh, was? Sebaro, ich hab keine Ahnung, was, was das mir sagen soll. Das steh ich nicht. Was? Das ist ein Auszug aus irgendwas, ne, das versteh ich auch nicht. Das hat sich, das haben sich irgendwelche Super-Stonks-Männer ausgedacht, das ist nicht dafür gemacht, dass man's versteht. Was ist der was zum Teufel schon wieder TVL, ne? Du bist was? Pädagogischer Pandemie? Was für ein Ding bist du? Was du? Ich wusste gar nicht mal, dass es das überhaupt gibt. Und was macht man da? Pädagogischer Pandemie-Hilfe, alles klar, okay. Du betreust Klassen im Hybrid-Unterricht. Hoffentlich sind da Physik-Grills dabei, Sebaro, ne? Und mache nebenbei noch IT-Support, oh je. Das ist eine tolle Kombination. Das ist Monkathos. Ach so, äh, Sebaro, vielleicht hab ich's falsch verstanden. Ich dachte du redest vor Leuten, die studieren. Wie alt sind die Klassen, die du betreust? Dann ist das wahrscheinlich wirklich Monkathos, ja. Fünfte, ach du Scheiße, ich hab nix gesagt. Monkathos, ich hab nix gesagt, Sebaro. Richtig Toss. Äh, da kommt der Pädobär. Mach den Streben dicht. Äh, hättest du Interesse in den Vertreibern anzuschauen? Sebaro, ich glaub ich kann dazu überhaupt nix sagen. Also ich kann mir das gern anschauen, wenn du meinst, äh, das bringt dir irgendwas, ja, aber ich bin bei sowas nicht der große Kenner, ja. Matchvideos hab ich glaub ich letztens schon gelesen, kommt mir irgendwie bekannt vor. Muss mal kurz chat gucken, ob ich irgendwas übersehen hab. Übrigens, wisst ihr was auch geil ist, falls der Flo690 grad schreibt, was auch mega fail ist, ähm, wenn man Settings in Windows machen will, was Audio angeht, was Audio angeht, da musste da drauf klicken, Moment, warum aber, da musste erst mal da drauf klicken, dann musste, nee Moment, Moment, da musste da drauf klicken, da musste sagen Open Sound Settings, da musste das Sound Control Panel aufmachen, dann kriegste diese Sache aus Windows 95, ähm, und dann gehst du hier zum Beispiel aufs Mikrofon und kannst dann hier auf Levels einstellen. Also, gut, ich mein du kannst hier unten sicherlich auch, aber ey. Und das Schlimmste ist, was ich manchmal brauche ist, dass ich Supported Formats umstelle, weil mein Audio Interface manchmal rumspackt und sich umstellt auf 44 Hertz, auf 44 Kilohertz, obwohl es eigentlich auf 48 Kilohertz stehen müsste. Und das krieg ich dann mit, nur wenn es ein bisschen komisch rauscht. Und da musst du wirklich, ich mein, was haben die sich, was haben die sich beim Microsoft da gedacht, ist das hier irgendwie gute, gute Usability, wenn ich dann so machen muss, oder wie. Honig Brei schreibt, also bei mir geht nicht die Klammer. Also das Programm wird nicht mehr gehighlightet, oder wie man das nennt. Ich hab legit keine Ahnung, was, welches Programm und wo welche Klammer nicht geht. Aber als erstes was ich gucken würde ist, ob du unten das hier irgendwo umgestellt hast auf eine andere Sprache, und danach würde ich mal überprüfen, ob die Taste an sich funktioniert. Der User soll das Menü auch überhaupt nicht finden. Ich, ich bin auch User, und ich weiß, dass ich da was umstellen muss. Ja, richtig richtig fail, Alter. So, exzellent. Kommen wir mit den Fische an. Und wisst ihr auch, was wir auch gerade einfach, wenn ich mir diese Settings hier angucke, also hier hab ich den Eindruck, ich weiß ungefähr wo ich hin muss. Und mal ganz davon abgesehen, by the way, dass ich diese alten Symbole, diese alten Icons viel aussagekräftiger finde als das Zeug. Ich mein hier, wo ist hier Netzwerk, ach da, ich find hier erkennst du es sofort, naja gut. Aber es ist Geschmackssache, das ist ja generell so ein Trend, dass man diese, diese Flat Design Dinger, Icon Geschichten und sowas hat. Aber ich find die stechen viel mehr heraus und sind viel einprägsamer als das Zeug da. Nee, aber es ist wirklich, ist wirklich merkwürdig, ich weiß teilweise gar nicht wo ich suchen muss. Was auch, was auch witzig ist, dass man, ich weiß gar nicht, ob es jetzt funktioniert, aber vielleicht, zumindest ging das lange Zeit nicht, dass man, ans alte konnte man sich jetzt 20 Jahre gewöhnen, naja Spickel, so einfach ist das ja nicht. Du konntest dich ja in Windows 10 jetzt auch 5 Jahre gewöhnen und hat man sich dran gewöhnt, also irgendein Block im Gehirn scheint es ja dazu geben und das liegt zum größten Teil daran, dass es total inkonsistent umgesetzt ist, mal das alte mal das neue, sprich, dass man gar nicht das neue benutzen kann, noch zusätzlich das alte benutzen muss und das Microsoft an sich das sehr inkonsistent macht. Ich mein 5 Jahre sollten eigentlich reichen sich an sowas zu gewöhnen, wenn es konsequent und gut gemacht ist. So, ähm, jetzt wollte ich jetzt zeigen, genau, ähm, wenn man hier auf Apps geht, da konnte man mal, ah guck mal, oh, ah das geht jetzt auch, das ging bisher auch nur über das alte Windows Zeug. Vor allem, warum ist das hier ein anderer Knopf, als, ey, das versteht doch kein Mensch, wofür ist denn das jetzt da überhaupt, diese, wofür ist das da oben überhaupt, was ist die Existenzberechtigung davon, was macht man damit überhaupt, ich mein das hier kenn ich, das ist zum Beispiel das, wo man, äh, äh, das, das Windows Subsystem für Linux und, und Hyper-V und gedöhnt sind, aber was ist das? Ich, ich wills, ich wills gar nicht so, was auch immer die bei Microsoft da treiben. Du solltest einen Windows-Kurs besuchen, ey, auf der Arbeit, da gibt's ja mittlerweile schon so den Running Gag, dass ich einen Excel-Kurs machen soll. Also, das war mal so, wir sollten mal, irgend so eine ganz ultra nervige Excel, ähm, ähm, nicht Excel, wir sollten mal so eine ganz ultra nervige, äh, Tabelle erstellen, mit irgendwelchen Inventarlisten so und ich hab halt mich dummerweise freiwillig dazu bereit erklärt, das zu machen und, ähm, benutzt jemand von euch Confluence auf der Arbeit. Was ist da? So, und bei Confluence ist das so, also, die Leute, die technisch nicht sonderlich versiert sind, die kommen dann auf so grandiose Ideen wie eine Excel-Datei im Confluence anhängen und dann mit mehreren Leuten sharen, die dann parallel da drinnen bearbeitet werden sollen. So, und damit das funktioniert, also Confluence ist so eine Art Wiki im Endeffekt. So, und damit das funktioniert, gibt es dann eine Confluence-Companion-App oder sowas, ich kann das nicht richtig schreiben, hier. Dann gibt's hier auch eine Confluence-Companion-App, gibt's dann da unten. Das ploppt dann hier unten so auf, wenn man Sachen editiert hat im Confluence und lädt's wieder hoch, also sprich, man klickt in diesem Wiki das Excel-File an, dann geht's in Excel auf und wenn man speichert, muss man das über diese Companion-App hochladen. Ganz großer Scheiß, zumindest. Hab ich dann mal da 2 Stunden editiert, gespeichert, gespeichert und das Ding hat die ganze Zeit gesagt, jawoll, jawoll, jawoll, jawoll, so, und dann bin ich ins Confluence auf die Seite und hab gesehen, es hat nichts hochgeladen die letzten 2 Stunden, also hab ich Excel genommen, Excel gespeichert und einfach einen neuen Anhang auf die Seite gemacht und einen Kommentar reingeschrieben, wie kacke dieses System ist und warum man das verwendet und ich hab sogar, ich war sogar nett und ich hab noch den Bug-Report reingepostet vom Atlassian Bug-Tracker, hab ich gesagt, ja, das ist ein Fehler, der taucht öfters auf, hier ist der Bug-Report, ich hab jetzt, ich hab für heute die Nase voll, irgendwas hab ich reingeschrieben. So, und da hat dann die Stonksfrau darauf geantwortet, die diese Listen haben wollte, also bei mir gibt es damit überhaupt keine Probleme, möchtest du einen Excel-Kurs haben? Da konnte ich überlegen, wie sehr ich mich über dieses Kommentar gefreut hab, Alter. He lacks critical information, das hab ich mir vielleicht gedacht, Sebaro, sowas kannst du da nicht reinschreiben, da bist gleich Abmahnung raus. So, nee, nee, nee, nee, ich hab die Schulung bis heute nicht gemacht, aber das ist jetzt, das ist bei uns auf der Arbeit jetzt irgendwie so der Running-Gag, wenn irgendwas ist mit Tabellen, dann heißt dann, der Maxim Wilder wollte doch ne Excel-Schulung machen, oder irgendwie sowas, ja. Das stimmt schon, ja, das stimmt. Übrigens, ich sehs ja grad am Chat, ne, scheint wohl, scheint wohl nicht der einzige zu sein, der Confluence in Kombination mit dieser Atlassian Companion-App übel Scrap findet. Nee, also, das ist wirklich voll von Arsch, der Kram. Ich muss euch mal ehrlich sagen, weil jetzt ein bisschen geflamed wurde gegen Confluence, ich finde Confluence an sich, und ich finde auch vieles der Atlassian-Dinger gar nicht so schlecht. Also auch Hira, oder wie es die coolen Leute aussprechen, Gyra, was sagt ihr Leute? Hira, Gyra, oder Jira, Jira, oder was haben wir sonst noch? Chiara, oder sowas. Jira, okay, das ist gar nicht so kacke. Das Problem ist nur, dass oftmals in Super Enterprise Business Stonks Firmen, die Sachen, diese Systeme total verbogen werden, um irgendwas zu machen, was nicht gemacht werden soll. Also, Jira ist ein Ticket-System, wo man sich Aufgaben zuordnen kann und machen, das ist alles okay. Übrigens, auch noch Story von der Enterprise Business Front. Wir haben jetzt was Neues bei uns im Hira, das ist auch schon wieder so geil. Sowas kann nur in einer größeren Bank passieren, glaube ich zumindest. Du musst ein gewisses Level von Realitätsverweigerung haben, dass du sowas erst machen kannst. Und ich glaube, sowas gibt es nur bei besonders großen Firmen und ich glaube, auch bei Banken in Deutschland ist das eben besonders beliebt. So, und zwar, man hat sich jetzt überlegt, also wir verwenden ja Hira als Ticket-System schon relativ lange. Und jetzt haben sich Leute überlegt, okay, man sollte darüber Zeiterfassung machen. Ist ja an sich kein Problem, hat es ja glaube ich auch ein eingebautes Modul. Natürlich verwenden wir nicht das eingebaute Modul, sondern irgendein Trittanbieter-Modul, das sich überhaupt nicht gut integriert, aber sei mal dahingestellt. So, und was wollte ich jetzt erzählen? Zeiterfassung. Genau, und dann ist ihnen irgendwann aufgefallen, dass es ja gar nicht so genau geht mit der Zeiterfassung, so wie sie sich das vorgestellt haben, weil dann könnte man ja auf einmal kontrollieren, wer was in irgendeiner Art und Weise macht und das ist ja gar nicht erlaubt. Okay, also hat man das ein bisschen mehr anonymisiert und irgendwie noch ein bisschen dran rumgedockt hat und sonst was, alles gut. So, und jetzt ist das Problem, also ihr könnt euch ja vorstellen, wenn man ein Ticket-System hat, also sprich eines der zentralsten Funktionen von so einem Ticket-System ist, einmal, dass man sich selbst Aufgaben zuordnen kann, ja, dass andere Leute sich Aufgaben nehmen können und aber auch, dass man Aufgaben miteinander verknüpfen kann. Zum Beispiel, es gibt einen Ticket, wo drin steht, neue Version und dann verknüpft man halt ein paar Tickets mit, keine Ahnung, mit irgendwelchen To Do's, mit irgendwelchen Bugs vielleicht, mit einzelnen Features und so, also sprich, Tickets verknüpfen ist eines der wichtigsten Dinger überhaupt. Also, das ist eigentlich mit das wichtigste an so einem Ticket-System. Also nur mal so, meiner Meinung nach und vielleicht für Leute, die es nicht so oft verwenden. So, und jetzt gibt es ein Problem, das Zeit-Erfassungs-Plugin ist verbugt. Wenn du jetzt Zeit erfasst in einem Ticket und dieses Ticket wird verknüpft und das verknüpfte Ticket ist Bestandteil von einer, ja wie nennt man das, Bestandteil von irgendeinem übergeordneten Projekt-Ticket, dann geht die ganze erfasste Zeit auf die Projektzeit von diesem eigentlich nichts damit zu tun habenen Projekt. Das ist total wirr. Das ist verbugt ohne Ende das Ding. Zumindest führt das jetzt im Endeffekt dazu, dass auf einmal Projekte von nichts, also von 0 auf 100 irgendwie, keine Ahnung, das ist ein Projekt mit 20 Tagen und hat auf einmal, seitdem dieses Feature gibt, hat es nicht, hat es keine Ahnung, vorher hat es irgendwie, okay, 25 Tage Projektzeit und danach hat es 150 Tage von 20. Und das ist dieses Third-Party-Zeit-Erfassungs-Ding inklusive, inklusive, ich will das auch nicht mal dem Entwickler dieses Zeit-Erfassungs-Dings in die Schuhe schieben, das ist eine Mischung, ach guck mal der Keeper XY auch da, das ist eine Mischung aus Drittanbieter-Zeit-Erfassung und unsere Verwurstung mit den Tickets. Ja und da kannst du dazu führen, dass du quasi jetzt entweder die Zeit-Erfassung nirgendwo aufschlägt oder die Zeit-Erfassung bei den falschen Sachen aufschlägt. Ja, das darf ja an sich nicht gehen. Und du weißt ja, du machst dich ja, also haben sie ja in dieser Beschulung sogar erzählt, du machst dich ja sogar strafbar, solltest du in der API gucken, was dein Kollege im Ticket zugefügt hat. Naja, also ich glaube sowas geht echt nur in super, super großen Enterprise-Firmen, wo es auf die einzelnen Sachen nicht so genau ankommt. Jeder andere hätte schon gesagt, Alter, was machen wir da eigentlich für ein Scheiß, kann doch nicht sein, dass sich irgendwie 20 Leute um nichts anderes kümmern als sowas. Ja, das, das ist übrigens auch ein guter, das machen wir übrigens gerne. Äh, Pivion, danke schön für den Prime-Sub. Massive Sub, Big Brain-Subscription. So Dinger machen wir übrigens auch gerne hier auf der Arbeit, ne. Wo dann, wo dann sei es, ja also theoretisch könnte das der Dienstleister schon machen, aber wir haben ja im Vertrag drin stehen, dass er es nicht darf. Oder umgedreht ist auch geil, so nach dem Motto, ja also wir glauben ehrlich gesagt auch nicht, dass der Dienstleister das schafft, 99,99% Uptime, aber wir haben im Vertrag drin stehen in den SLSAs, dass der 99,99% Verfügbarkeit hat, also, also hat er die auch. Muss ich mal sagen, ja ja, aber wir haben es doch jetzt schon oft genug gesehen, dass er es nicht hat, ja das ist egal, Hauptsache man hat es im Vertrag drin stehen. Also es geht in der Enterprise-Business-Welt geht es oftmals nicht darum, was wirklich ist, sondern wem du offiziell die Schuld in die Schuhe schieben kannst. Hast du einen, dem du die Schuld in die Schuhe schieben kannst, ist alles in Ordnung, auch wenn es genauso kaputt geht wie sonst, aber du hast einen, dem du die Schuld in die Schuhe schieben kannst. Deswegen macht man auch gerne so viele Wartungsverträge und sowas, dass man einfach sagen kann, ja gut, die waren es. Wir sind nicht daran schuld, unser externer Dienstleister hat es verkackt oder irgendwie sowas. Ja, so Zeug waren wir gern. Wie kann man Prime Summen? Dazu brauchst du Amazon Prime und dann kriegst du einen kostenlosen Prime Sub im Monat, den du einem Channel deiner Wahl vergeben kannst. Aber solltest du kein Amazon Prime haben, nur dafür Amazon Prime holen lohnt sich nicht. Du musst das verknüpfen. Du musst irgendwie, boah frag mich nicht mehr aus dem Kopf, wie das ging. Du kannst dein Twitch-Account mit Amazon verknüpfen und dann kriegst du automatisch den Prime Sub. Außer du hast einen Studenten Prime, dann geht das. Der Sebaro weiß das. Sebaro, wenn man Studenten Prime hat, geht das dann auch? Ja, geht auch, ok. Äh, genau so ist es. Das ist der Grund, warum viele Leute was in die Cloud schieben, nicht weil es wirklich dadurch so viel einfacher zu handhaben wird oder weil das irgendwie prinzipiell besseres Software wird dadurch. Ich mein, es ist der gleiche Kram, ob der jetzt offline oder online läuft, ist vollkommen egal. Sondern weil man einfach die Schuld woanders abladen kann. Genau, das ist der Grund. Es wird auch meistens nicht billiger. Äh, ehrlich gesagt, das weiß ich aus dem Kopf jetzt nicht. Du musst, du musst zumindest das verknüpfen mit deinem Prime. Gerade gestern ging die Google Cloud übrigens richtig gut. Gestern war die ganze Google Cloud, also, das stimmt ja nicht, die Google Cloud hat gestern auch funktioniert, die Anmeldung war problematisch. Aber wisst ihr was geil, Wind? Die, das ist typische, typische Google Reaktion, ne? Der Google Clouds Fall, die sagen nichts. Die sagen einfach gar nichts dazu. Kann mal gucken, ob die überhaupt irgendwas dazu geschrieben haben. Ich glaub, die haben einfach nur geschrieben, äh, Verfügbarkeit ist unser höchstes Ziel oder irgendwie sowas. Der Provokateur 6 Monate Prime, Dankeschön für den Sub. Google hat ja gerne mal auf was zu posten, ne? Nö, die haben irgendwie nichts. Ach, keine Ahnung. Zumindest, Google äußert sich bei sowas eh nicht großartig. Es gab nen Tweet von denen, hab ich nicht gesehen, vielleicht haste den link ich zumindest jetzt nicht gefunden. Die haben aber da nix großartiges geschrieben, die haben einfach nur, was die haben unter dem Q geklaut, die haben einfach nur geschrieben, dass irgendwie Verfügbarkeit ihr höchstes Ziel ist oder sowas. Ah, exzellent, ich zeig mal her. Sag mal, Keeper XY, wie haben die eigentlich auf der Arbeit die Ankündigung aufgenommen, dass CentOS nicht mehr CentOS ist? Beziehungsweise, dass CentOS eingestellt wird. Die waren bestimmt alle sehr happy, oder? Ach tatsächlich, die haben sogar was dazu geschrieben? Das wird noch lustig. Wir sollten einfach das machen, was ich seit Jahren schon sage, einfach Ubuntu nehmen für alle Server, easy. Will ja keiner, ne? Einfach Ubuntu. Tomtricks CentOS wird eingestellt, allerdings, wenn du noch auf CentOS 7 bist, mal. Wir gucken uns den Blogpost einfach noch mal an. Kann ich dir noch mal schnell was zu sagen. Hier, das da. So, also, wenn du CentOS 7 verwendest, ist okay. CentOS 7 werden sie weiter supporten, bis der Rattan Enterprise Linux 7 Lifecycle vorbei ist, aber 8 wird es nicht geben. Es gibt jetzt so ein komisches Rolling Release, was auch nicht mehr direkt Binary-kompatibel zu Red Hat ist. Also eigentlich nicht das, was die Leute haben wollen. Ja, genau, und CentOS 8 ist Ende 2021 vorbei. Sie wurden IBM'ed sozusagen. Also Tomtricks, wenn ihr CentOS 8 habt, habt ihr ein Problem. Ihr könnt entweder auf CentOS Stream upgraden und hoffen, dass alles funktioniert. Was meistens nicht so der Fall ist, wenn man CentOS verwendet, weil man verwendet CentOS 7, nicht einfach nur, weil man ein stabiles Linux haben will, oftmals auch, weil man zertifizierte und dafür entwickelte Sachen hat. Und da kommt man mit CentOS Stream nicht sonderlich weit. Ja, wir sind zum größten Teil auch noch auf CentOS 7, aber CentOS 7 ist jetzt ja auch schon ein bisschen älter. Wann kam das raus? 2017 oder was auch immer. Das ist ja auch das Top Aktuelle. Guck mal, 2015 kam das Scheiß raus. Nee, 2014. Alter, ich hab nix gesagt. Das ist 6 Jahre alt. Colonel 3.1, das ist uralt. Also 6 Jahre alte, du hast jetzt schon das Problem unter Red Hat 7, dass du manche Sachen gar nicht mehr richtig drauf verwenden kannst. Willst du irgendwie eine neue Load-Balancer-Version haben, geht nicht. Brauchst du irgendwie neue SSL-Library, gibt's nicht. Brauchst du irgendwelche Container-Geschichten, Colonel zu alt. Also schön ist es nicht. Scientific ist doch auch dead, oder? Wir hatten mal eine Weile auf der Arbeit Scientific. Zumindest angeblich ist es jetzt so, dass es jetzt eine Alternative geben soll, die gibt's aber noch nicht, aber die soll's geben, und zwar Rocky Minox. Das hat einfach mal auf einen Schlag 6000 Sterne. Keeper Exist, oder? Gentoo, Gentoo, wie wär's damit? Wir kombinieren erst mal eine Woche. Gentoo. Wie gesagt, ich bin für Ubuntu Server. Ich mag Ubuntu Server. Ubuntu Beste. Außerdem kann man Ubuntu besonders cool aussprechen. Kann dann die coolen Leute sprechen, Ubuntu nicht Ubuntu aussehen, Jubantu, sagen wir. Ubuntu. Ich hoffe, bei uns kommen sie nicht auf die Idee, Suze zu kaufen oder sowas. Da bin ich mal gespannt drauf, was das hier wird. Haben die schon eine Webseite oder so? Rocky Minox. Rocky Minox Org, okay, zeig mal her. Bis das überhaupt losgeht, wird ja schon eine ganze Weile dauern. Ich mein, was ein bisschen Hoffnung lässt bei der Sache ist, dass das wohl der Gründer des CentOS Projekts gründet, also der gründet quasi ein zweites CentOS, und dann lässt er sich einfach wieder kaufen von IBM in ein paar Jahren für noch mehr Stonks. Das ist doch eigentlich eine geile Sache, oder? Man gründet ein Projekt, das ist eigentlich richtig big brain, Alter. Man gründet ein Projekt, wartet bis es erfolgreich ist, verkauft es, und dann steigt man aus und macht das gleiche nochmal, oder weiß man jetzt ja schon, wie es geht, und dann verkauft man es nochmal. Bam. Easy, easy money. Das kleine Problem dabei ist nur, man muss das Projekt erfolgreich machen, was eher öfters in die Hose geht, als dass es klappt. Ja, das funktioniert wunderbar. Ubuntu Updates funktioniert wunderbar. Ich hatte da auch noch nie Probleme. Ich hatte damit auch noch nie Probleme. Hattest du gerade angehört, als hättest du gesagt, ich hätte neulich Probleme. Nee, nee, ich hatte damit auch noch nie Probleme. Ubuntu hat auch so ein paar Macken, die mir auch auf den Keks gehen. Das Schlimmste unter Ubuntu ist Netplan. Also ich weiß nicht, was Canonical da geritten hat, Netzwerk-Config in Jaml zu machen. Warum hat irgendjemand auf dieser Welt gesagt, aber die Netzwerk-Config unter Debian, die ist ja so scheiße, ich bin gar nicht in der Lage, Netzwerke zu konfigurieren, da muss was anderes her. Niemand, also ich kenn niemand, der irgendwie was auszusetzen hatte an der Ubuntu oder Debian Netzwerk-Config. Das ist sehr nett, dass du das willst. Du hast normalerweise einfach oben nen Knopf, guck hier. Du hast hier irgendwo nen Subknopf, da. Easy. Da klickst du drauf und dann kannst du Prime auswählen, wenn es richtig verknüpft ist. Falls es nicht funktioniert mit Prime auswählen, dann dauert es wahrscheinlich einfach noch ein bisschen. Aber ich freu mich auch so über jeden Zuschauer auch ohne Prime Sub. Aber natürlich Massive High IQ kriegt man nur mit Prime Sub. Das ist ja allgemein bekannt mittlerweile. Alter, der Halo Soundtrack ist so poggers, oder? Oh, da hast du viel Spaß dabei, ja. Wenn du mich mal failen sehen willst. Wenn du mich failen sehen willst, musst du den Stream rein gucken, wo ich versucht hab, die China-Steckdosenleiste aufzumachen. Alter, hab ich da. Ja. Genau. Oh ne, da hab ich sie schon auf. Hier. Irgendwo verbiege ich das Zeug auch. Aber zumindest, du kennst ja, du kennst ja, dass das wichtigste Projekt, wenn es ums Flaschen von China-Steckdosenleisten geht, GitHub. Also sprich, wenn du, ne, ich bin von der falschen Seite ran. Ich hätte es vorne aufmachen können. Aber man kann die meisten China-Steckdosenleisten ja Wi-Fi mit einem Raspberry Pi flashen. Wenn man Glück hat, dass die Firmware noch alt genug ist, dass sie das unterstützt, das ist dann total easy damit. Ja, da hast du Glück, da hast du eine Steckdose gefunden. Da würd ich gleich noch ein paar von kaufen. Tja. Ne, aber noch mal jetzt zu dieser Geschichte. Ich weiß nicht, was mit den Leuten bei Canonica los ist, also bei den Ubuntu-Leuten. Ja, die Gose und Dinge hab ich auch. Genau. Gose und interessiert sich nicht für Sicherheitslücken. Die Patchen einfach irrefieren wir nicht. Ich weiß nicht, was die geritten hat, dass die sich gedacht haben. Alter, wir müssen unbedingt ne Yammel-Config machen für Netzwerk. So, also mal zum Vergleich. Das hier ist ne Network-Interfaces-Config. So war das die letzten 20 Jahre unter Debian und Ubuntu. So hat man Netzwerke konfiguriert bisher immer. Außer man hat DHCP verwendet, da musste man eh nix machen, aber okay. So hat man Netzwerke konfiguriert unter Debian und Ubuntu seit den letzten 20 Jahren. So. Und jetzt gibt's das hier. Ich würd ja mal gerne den Chat hier da zu interviewen. Also, was ist euch lieber? Das linke oder das rechte? Es macht ungefähr das gleiche. Rechts, ja, find ich auch. Ja, ne, also. Ich mein, man kann das schon lesen links, aber warum? Es ist ja, der Witz ist ja, es ist ja neunzig, ich mein's ist ein Riesenunterschied. Ich mein, das sind die gleichen Infos und alles. Der Witz ist ja, genau, man könnte Network-D verwenden. Network-D hat zum Teil so ein paar richtig coole Features. Zum Beispiel Interfaces umbenennen aufgrund von der Mac-Adresse oder aufgrund von der PCI-Nummer und sowas. Deswegen, ich hab's mittlerweile auf meinen Kisten mit mehreren Netzwerk-Interfaces auch so, dass ich über System-D, Network-D meine Interfaces zudem umbenenne, was sie sind. Also sprich, bei dieser 4HE-Kiste hier, bei dieser fetten, so. So, bei dieser fetten 4HE-Kiste, da hat ich ja zwei 10G-Onboard und ne 4-Port-Internetzwerkkarte drin und dort hab ich mit System-D einfach die Interfaces umbenannt. Also sprich, das erste Onboard-10G hieß nicht dann einfach ENS34 oder so, sondern hieß 10G-Intern. Und das ist ein nice Feature. Ich mein, da weiß man sofort anhand des Interface-Namens, was es ist. Ja, und das andere hab ich dann zum Beispiel genannt 1G-Telecom-Ablink oder sowas. Ich glaub, 1G-Unity-Media, 1G-Telecom und so hieß das dann. Eigentlich richtig cooles Feature kann man hiermit auch machen, aber ich mein, warum, wenn man das einfach so lassen kann, wie es ist, wo sich die Leute dran gewöhnt haben, was gut funktioniert, was keine Nachteile hat gegenüber dem anderen. Ich versteh die, also das ist was, was ich unter Ubuntu nicht verstehe. Das leuchtet mir nicht ein. Ansonsten muss ich sagen, ist mir Ubuntu als Server-Betriebssystem immer noch am liebsten. Was ich witzig finde, viele Leute scheinen es genau umgedreht zu sehen, die sagen, hey, Ubuntu auf dem Desktop Pock, Ubuntu auf dem Server Sucked, mit Demian kann ich auch noch leben. Aber ich bin da mittlerweile so dran gewöhnt und ich find auch die Ubuntu-Philosophie ganz gut. Du kriegst bei Ubuntu alle zwei Jahre einen LTS-Release, was dann glaube ich sechs Jahre oder so supportet wird, ich weiß gar nicht wie lang. Zeig mal her. Live Cycle. Hier, fünf Jahre, fünf Jahre. Du kriegst alles, das hast du bei Demian zum Beispiel nicht. Bei Demian hast du von Haus aus vielleicht fast genauso langen Release-Cycle, aber was anderes. Fünf Jahre kriegst du LTS-Release und das ist schon nice. Zumal man auch sagen muss, dass die das relativ ernst nehmen, auch was Security-Updates und so angeht. Das ist schon nicht verkehrt und das alles umsonst wohlgemerkt. Bei Red Hat bezahlst du da fett Geld für. Klar, bei Red Hat kannst du, wenn du Support-Vertrag hast, auch bei Red Hat die Support holen. Das kannst du bei Ubuntu nicht, aber das macht ja eh kaum einer. Zumal du, das stimmt ja gar nicht, zumal du bei Red Hat auch nicht den einfachsten Vertrag nehmen kannst für 350 Euro, 350 Dollar. Du musst den höherwertigen Support-Vertrag nehmen, dass du es überhaupt wagen darfst, Red Hat anzusprechen. Also dieses fünf Jahre LTS-Release Geschichten finde ich bei Ubuntu super. Dementsprechend hast du eigentlich auch immer zwei LTS-Versionen die aktuell sind. Das ist aktuell 18.04 und 20.04 und 18.04 wie gesagt wird auch noch bis 2023 supportet. 16.04 läuft jetzt langsam aus. Also 16.04 macht eigentlich keiner mehr was, der noch halbwegs beiverstanden ist. Aber mein Gen tut es immer noch. Auch noch nie. Ich glaube 16.04 geht sogar noch ein bisschen länger. Hatten die 16.04 nicht sogar noch ein Stückchen länger? Nee, nee passt. Also es ist super, kannst du dich überhaupt nicht beschweren. Dazu kommt, dass du die ganze Zeit durchgehend Security-Patches kriegst und ich muss auch ehrlich sagen, ich mag die Auswahl an Ubuntu-Paketen, was Aktualität angeht, zum Hinterhalt, zum Release und eben auch diese Philosophie, dass man vielleicht auch mal ein Auge zudrückt. Dass sie manche Sachen einfacher machen, auch wenn es jetzt vielleicht nicht der Open Source-God persönlich abgesegnet hat. Dafür machen sie halt so komische Scheiße wie Netplan, was ich nicht verstehe. Aber ansonsten mag ich Ubuntu. Ja zum Beispiel, dass die jetzt auch ZFS in Installer eingebaut haben und so was. Eigentlich eine richtig coole Geschichte. Wer will übrigens mit der nächsten Ubuntu-Version mal im Stream ausprobieren? Also dann 121204 wahrscheinlich. Ja. Vielleicht, oder ist das jetzt schon da? Ach, haben die jetzt schon drinne? Ja. Also, müssen wir mal ausprobieren. Also die haben es im Installer schon drinne, ZFS, aber ich glaube, die haben noch keine ZFS-Encryption drinne beim aktuellen Ubuntu. Und wenn man sich überlegt, wenn man so dumm ist wie manche Behörden in Deutschland und Microsoft bezahlt für den Windows XP Extended Support, oder ne, den Windows 7 Extended Support ist es, da kann man auch Canonical bezahlen für Extended Support. Also ich finde es gut, ganz ehrlich. Wenn es nach mir ging, wir hätten nur überall Ubuntu und gut ist. ECP, was? Moment, das kann ich nicht lesen. LS, Ipinlin, ach du große Scheiße, ich hab das sicherlich nicht richtig erkannt, wie man das ausspricht. Aber dankeschön für den Prime-Sub. Zipinlin, ah, alles klar. Ah, das sind die Streifen, also die L's links und rechts ist für den Coolness-Faktor, ne, verstehe, verstehe. Ja, dankeschön für den Sub, easy. Das stimmt, die Supportzeiten von Microsoft sind nicht ohne und wisst ihr auch was, die Supportzeiten von Apple sind auch nicht ohne. Wenn man sich überlegt, das iPhone SE, das alte, eins, ich weiß gar nicht, wann kam das raus. 2016. Das hat immer noch aktuelle Betriebssystem Updates bekommen, beim letzten Major-IOS-Release. Also da kannst du dich ehrlich gesagt nicht beschweren. Ja, angeblich bekommt das nächste, was ist denn das nächste, iOS 15? Angeblich bekommt es das nicht mehr, genau hier stehts ja auch, angeblich bekommt es das nicht mehr, aber das ist ja erstmal nur Gerücht. Aber guck mal, hier steht schon S6S und SE nicht mehr unterstützt. Das wären ja dann auch quasi 5 Jahre, das ist schon okay. Das ist schon okay. 5 Jahre ist in Ordnung. Wenn man sich das anguckt, ich erzähle ja immer gerne die Geschichte von diesem komischen ASUS Tablet, was ich mir gekauft habe, was gesagt hat von Anfang an und dann haben sie sogar gesagt, wir stellen es jetzt ein, gib nie wieder Firmware Updates zu und das Ding war zu unbeliebt, dass es Custom-Roms gegeben hat. Richtig rausgeschmissen 350 Euro gewesen, hätte ich über einen kleinen iPad gekauft. Android Tablet Paints Champ, die einzig guten Android Tablets, die sich wirklich preisleistungsmäßig richtig lohnen, sind Fire HD 8 und Fire HD 10 im Angebot. Kannst dir selber Custom-Roms erstellen, könnte ich vielleicht, aber mach ich nicht. Das SE funktioniert halt mit iOS 13 irgendwas bezüglich Akku nicht mehr so wie vorher. Okay, echt? Alter ich hab irgendwas, Auge, was ist denn das? Ich weiß nicht, was da mit dem Akku angeblich ist, aber. Ah, Akku schneller leer. Ja, die sagen ja natürlich, die machen das nicht absichtlich, aber ich glaub denen kein Wort. Was genau bedeutet mit Werbung bei den Fire HD Tablets, das ist wichtig, du musst immer das mit Werbung nehmen, weil das ist billiger. Und wohlgemerkt, nicht kaufen, weil jetzt lohnt es sich nicht, viel zu teuer, viel zu teuer. Du musst warten, bis das im Angebot ist. Da gibt es nämlich das hier für um die 50 Euro, ne nicht das plus. Also jetzt lohnt sich das nicht, es lohnt sich nicht. Da gibt es das hier ungefähr für 50, 60 Euro und das hier für 90 bis 100 Euro. Dafür lohnt sich das nur dann, ansonsten ist das unsinnig. Und was damit gemeint ist es ganz einfach, mit Werbung kriegst du halt Werbung von Amazon auf deinem Tablet. Ohne Werbung kriegst du nicht ganz so aufdringliche Werbung von Amazon, aber du musst immer mit Werbung nehmen, weil mit Werbung ist billiger und man wird das Tablet eh danach entamazonifizieren. Das heißt das Tablet ist genau das gleiche mit oder ohne Werbung. Das heißt du musst immer mit Werbung nehmen und danach den ganzen Amazonscheiß runterschmeißen. Da gibt es fertige Tools für, da gibt es zum Beispiel hier Amazon Fire Toolbox, da gibt es das hier für genau, zack, runterladen, installieren, durchklicken und dein Amazon Tablet ist Amazon reduziert. Amazon frei ist es nicht wirklich ganz. Also immer das mit Werbung nehmen. Ich verwende auch ein Fire HD 8, um abends im Bett noch ein bisschen streamen zu gucken. Einzige Dofe daran ist, du kannst auf einem so entamazonifizierten Tablet schlecht Amazon Apps verwenden. Also möchtest du die offizielle Amazon Shopping App oder Prime Video darauf verwenden, das ist ein bisschen eklig dann. Dann musst du dich auf jeden Fall einloggen mit deinem Amazon Account, was nicht schlimm ist, du hast kein Problem, kannst du machen und trotzdem entamazonifizieren. Aber ich wollte mich auf dem Tablet gar nicht überhaupt erst mit Amazon Account einloggen. Nein, du brauchst keinen Amazon Account mehr, außer du möchtest halt Amazon Apps verwenden. Und die Anmeldung auf dem Tablet geht nicht über die Amazon App, sondern über das Amazon Tablet an sich, also sprich, du siehst dann halt dein Tablet im Amazon Account aufplotten. Netflix geht auch, ja. Netflix geht sogar Disney Premium oder wie das heißt, geht angeblich auch. Du musst vorher mal gucken. Also in der Regel kann man sagen, ja das geht mit allen Tablets, aber wenn das ein ganz neues ist, was rauskommt, also sprich, wenn die ihre Tablets updaten, dass es eine komplett neue Serie von Amazon Tablets gibt, dann würde ich mich vorher mal schlaumachen, ob es geht. By the way, ist Twitch nicht Amazon? Weiß gar nicht, ob die das so scharf finden, wenn ich das hier breit rede. Okay, wir machen das wahrscheinlich nicht im Stream, aber ihr könnt es ja machen, also verboten ist es auf jeden Fall nicht. Also man braucht keinen Amazon Account, wenn man keine Amazonsachen verwenden will. Also ich benutze meinen Fire HD 8 auch komplett ohne Amazon Account. Ja, solange der Kram nicht ins Internet kann oder besser umgedreht ist, damit keiner aus dem Internet dran kommt. Ja gut, solange man es soweit erkennt. Da bin ich mal gespannt. Wisst ihr, wie das laufen wird? Die Hersteller sind ja erfinderisch bei sowas. Wisst ihr, wie das laufen wird? Wenn es eine EU-Verordnung gibt, okay, da gibt es wahrscheinlich eh wieder schon eingebaut 500 Hintertüren, aber mal angenommen, die Hersteller sind wirklich verpflichtet dazu, Updates 5 Jahre anzubieten. Die werden genau das Allermindest machen, was sie machen müssen, dass sie diese Vereinbarung erfüllen sollen. Wenn es bedeutet, man bietet Updates an, dann lassen sie dich einmal im Monat eine Readme runterladen, wo drin steht Performance Improvements und sie haben irgendwo was gemacht, eine Einspec oder so. Die werden das Allernötigste machen, was irgendwie möglich ist. Ich glaube nicht, dass das erfolgreich sein wird. Es ist genauso wie alle Handys sollen den gleichen Stecker machen. Hat ja auch nicht funktioniert. Magst du eigentlich Cringe-Werbung? Oh, nee. Ich cringe nicht so gern. Wenn ich hier auf Twitch bin, muss ich schon oft genug cringen. Ist Cringe nicht das Jugendwort des Jahres? Keck! Keck! Ernsthaft? Keck war das in der Abstimmung? Warum nur Keck und warum nicht KeckW? Okay, Jugendwort 2020. Lost? Hä? Das ist doch nichts Neues. Lost ist doch nur wirklich nichts Neues. Also Leute, Digga, das fühle ich ja mal gar nicht. Richtiger Schmutz. Lost, Alter. Digga. Ne. Cringe ist auch nichts. Aber Cringe ist ein gutes Wort. Lost sagt einfach nur. Digga, Alter. Digga. Schmutz, Digga. Also Lost fühle ich nicht. Ne. Haben sie da für ein Bild gemacht, ey? Das soll absichtlich nicht hip wirken, um wieder hip zu sein. Das kriegst du gern auch für die Boomer. Kriegst sogar noch eine Erklärung dabei, was Lost bedeutet. Digga, Alter. Richte Boomer-Erklärung, ja. Es hat doch tatsächlich jemand in meinem letzten Video geschrieben. Das Video hätte Boomer-Vibes. Könnt ihr euch das vorstellen? Könnt ihr euch das vorstellen? Der hat, der hat, das muss ich jetzt mal kurz. Moment. Wo ist es? Wo ist es? Sack. Hier, guck mal. No offense, Max. Aber das Video hat schon ein bisschen Boomer-Vibes. Was waren daran Boomer-Vibes? Ne, ne, ne. Gut, was auch immer. Die sind nicht dank genug, die Memes. Ja, das wird sein. Die fühlt er halt nicht so. Lit ist auch noch mal angesagt, oder? Was gab's denn? Was gab's denn zur Auswahl für eine Liste? Beste soehr als für Hybrid-Apps Developed. Frag's mich was, ich hab noch nicht eine App Developed für Android oder so. Das einzige höchste Gefühl, was ich gehört habe, waren PWAs. Aber allgemein mein Lieblings-Development-OS ist Linux. Liste der Jugendwörter. Okay, zeig mal her. Ne, was gab's denn für Kandidaten? Das sind die Top 10. Okay. Schabernack. Also, ich bin ja dank Twitter, YouTube und dem einen oder anderen Azubi auf der Arbeit und solchen Sachen zumindest nicht ganz weit entfernt. Ich bin noch etwas im Bilde, was Jugendwörter angeht. Aber Schabernack? Ja, das mag sein, dass die sich über ein Abenteuer lustig machen, aber benutzen tut das keiner oft. Das klingt mal nach Boomer-Wart. So. Mittwoch. Ein Frosch-Meme. Stimmt. Man darf das Ding ja nicht so nennen, wie es ist, weil das ist ja auch schon Hate Speech mittlerweile. Hab ich vergessen. Sauftrag. Wild. Okay, Wild stimmt. Wild ist tatsächlich oft. Lost auch. No Front. Okay. No Front ist mittlerweile das neue No Homo. Früher hat ja jeder, der was geschrieben hat, was irgendwie positiv war, hat dabei geschrieben No Homo. Hey Max, gutes Video. No Homo. Chat heute wieder richtig schlau. No Homo. Nice Pose. No Homo. Also, früher hat man immer No Homo geschrieben und das ist jetzt genau das Gegenteil davon. No Front. Front in Form von Frontal und Angreifen und sonst was. Front. Front halt. Frontal 21. Köpfelspieß. Das kenne ich sogar. Das habe ich gesehen, das Video. Das Video habe ich irgendwann gesehen, wo er erzählt hat, schön Köpfelspieß oder irgendwie sowas. Okay. Digga. Ja, das ist ja nichts Neues. War ganz nach vorne abgesehen, die sind ziemlich alt. Digga ist so ein Ding, das erzählen die Leute die letzten vier, fünf Jahre schon. Digga. Und weil man nicht Digga sagen darf, sondern Digga muss das sein. Digga. Also quasi wie jemand, der gräbt auf Englisch. Ja. Ein Digga. Und nicht zu verwechseln mit Dicker oder so. Digga. So, also was haben wir sonst noch? Cringe. Und was? Mashallah. Ach so, ja gut. Es gibt ja immer mehr arabische Aussprüche hier. Und das erinnert mich ein bisschen an, es gibt Chicken Masala. Das ist so Hähnchen mit so rotem scharfen Zeug dabei. Exzellent. Ja, Freund ist Digga. Immer Digga. Egal was. Cringe. Cringe Digga. Ja, auf, auf, auf mein Nacken und so ist nicht mal angesagt. Das benutzt man glaube ich nicht mehr. Es gibt noch viel mehr solcher Dinger. Wenn ich es höre, fallen sie mir ein. Ansonsten, ich benutze sie ja nicht täglich. Ich bin ja mit 36 jetzt ja auch nicht mehr derjenige der täglich da in Jugenddiskussion präsent ist, ja. So, ich gehe jetzt aber gleich auf. Ich küsse deine Augen. Genau. Das ist auch so ein Ding. Warum auch ausgerechnet die Augen? Ich weiß es nicht. Ich weiß es nicht. No homo aber ne. No homo hoffe ich. So. Ja wunderbar. Ja, es gab hier eh keinen offiziellen Stream. Das war ja alles nur nicht existent. Dieser Stream, den gab es ja gar nicht. Sagen Homos auch no homo. Ne. Der Friseur, der sagt irgendwie, der Friseur, dem war mal eine Zeit lang sein Lieblings, sein Lieblingswort war homo Fürst, das weiß ich noch. Ich kann mich noch richtig dran erinnern, der homo Fürst. Kennt ihr dieses Video von dieser, von dieser einen, von dieser einen Oma? Du homo Fürst. Jetzt muss ich mal kurz raussuchen. Genau. Die hier. Die Linie 140 hat ja angeblich Verspätung. Fick dich weg du homo Fürst. Du homo Fürst. Du homo Fürst. Du homo Fürst. Ich weiß es ist schon gestellt auf jeden Fall, aber ich find den Oma so geil. Du homo Fürst. Die sagt das auch schon so geil. Fick dich weg du homo Fürst. Sonst gastriere ich dir die Eier. Na gut. Irgendwie ist mir das egal. Das war mal so die, die Standard-Krise der Friseur mal eine Zeit lang gesagt hat. Flexen ist das Jugendwort. Was? Stimmt, flexen ist, flexen ist auch sehr angesagt. Und wenn man was sagt, wenn man was sagt, was jemand nicht gefällt, dann ist dann weird flex. Also quasi ein, ein merkwürdiger flex. Hast du eigentlich Urlaub morgen aufstehen streamen? Ich hab Urlaub seit einem Monat schon. Bis nächstes Jahr noch. Weird flex, but okay. Genau das musst du machen. Homo Fürst. Die Oma ist so geil. Was der Friseur macht, der macht Videos. Ups. Der macht Videos. Zelt euch mal vor. Okay, ich hab wieder eine Woche her, aber der hat, der hat wirklich Videos gemacht. Guck mal, der hat sogar den eigenen Wiki-Eintrag. Ist ein deutscher YouTuber. Was der Famine 1000? Das ist auch nicht aktuell, oder? Wer ist denn da vorne? Was? Wer ist das? Wer ist Contort? Achso, das ist irgendwelche Musik. Und wer ist A-Kiwa-Squip? Okay, Kron, kenn ich? Der Voice Kids. Okay, er ist PeetSmeet. BibisBeautyPalace. Okay, spielender Spielzeug, MySpaß. PromiFlash. Kenn ich auch nicht. Rammstein. Freak, kenn ich auch nicht. Ach, du große Scheiße. Äh, der sagt mir irgendwas. Wer ist denn das? Ach, der Concrafter ist das, genau. Wo bin ich? Und wo bin ich? Da ist er. Leute, da ist er. Ich bin auf Platz 646. Concrafter ist der mit der Kohle-Pizza, ne? Ich bin hinter Computer-Bild. Okay, es wird Zeit, Leute. Ich bin nicht weit weg. Guck mal, ich bin nicht weit weg. Wie viele Aufrufe machen die so? Okay, die haben sehr durchwachsene Aufrufe. Da könnte ich aufschließen. Ey, ich muss Computer-Bild überholen, ne? Und danach Mercedes-Benz Deutschland, ne? Oh, Mann. Kann man da sonst noch? Ich kenn, ich kenn davon kaum jemand. Wer ist das denn alles? Was soll das denn sein? Okay, ich kenn das, kenn das alles nicht. Dom Tendo, oder? Ich kenn auch nicht. Banger-Channel. Okay, der sagt mir was vom Namen her. Kenn ich auch nicht. Irgendwelche Hip-Hop-Dinger. Kenn ich, kenn ich, kenn ich nicht. Ist ja auch ein Hip-Hop-Tour. Haben wir bloß irgendwelche Hip-Hop-Gangster-Mans da? Singen mit mir Kinder-Lieder. MTV-Cast. Ach, du große Scheiße. Germany's Next Topman und der Unge am Stab. Freiheit für Unge. So, den kenn ich auch. Das sagt mir auch irgendwas. Die sagen mir auch noch was. Kenn ich nicht, kenn ich nicht. Die Lochis seit, wusstet ihr? Jetzt mal hier. Die Facts. Wusstet ihr, dass mir die Lochis seit 2000, keine Ahnung, 10 oder so Folgen auf YouTube, ja? Ich, die Lochis haben mich abonniert. Jetzt, jetzt, jetzt raus. Ach, kommt mal, der ist der, den kenn ich. Wenigstens meinen, den ich persönlich kenn hier. Boah, der ist aber explodiert. Den kenn ich auch so, um drei Ecken persönlich, aber der ist echt krass explodiert dann, ja. Den hab ich gar nicht so mitgekriegt. Gut, ich guck mir auch keinen Minecraft an. Ach, du große Scheiße, den gibt's ja auch noch. Das kenn ich nicht. Das ist der mit den Autos, den kenn ich. Die Klinik am Südring. Ah ja, alles klar. Hab ich nie gerne geguckt. Okay, jetzt kommen, jetzt kommen langsam mal ein paar Leute, von denen hab ich zumindest schon mal was gehört. Mein Herz schlägt Schlager, oy oy oy oy oy. Gromme. Schaut euch mal vor, ein Java-Programmiere unter den Top 90. Sachen gibt's. Sollte eigentlich nicht verboten sein. HD Corleone, was ist denn das für einer? Ach, Musik-Channel, ok. Ich dachte schon, das ist dieser Typ, den mal Alt-R4-Games verarscht hat. Kenn ich sonst? Ich sag, ich kenn keinen. Ok, die sagen mir vom Namen her irgendwas. Keine Ahnung, wer das ist. Alter, ich kenn mich überhaupt nicht mehr aus auf YouTube Deutschland. Ja, weh, ja, Gott, weh, es ist ein, den ich auch noch selbst kenne, ja. Allerdings noch aus Zeiten, wo er noch nicht 5 Meter Bizeps hat. Lebst du im Wald? Ja, kommt mir so vor. Naja, gut, was auch immer, ist ja auch egal. Was steht denn da eigentlich zu mir drin? Gibt's mich da auch? Im Influencer gibt's mich auch im Influencer-Wiki. Wenn's den Friseur da gibt, soll's mich auch geben. So, und wie sucht man sich da? Ey, mich gibt's da nicht. Anzeige ist raus. Sauerei. Gut, ich mein, ich mach seit 6 Jahren keine Videos mehr richtig, aber trotzdem, hey. Zumindest mal so einen Eintritt mit so einem Satz könnte man doch machen, oder? Sucht sich in der Neste, mein, ich bin ja trotzdem drin. YouTube-Ranking. Nein, gibt's? Oh, doch. Ach, tatsächlich. Aber da steht ja gar nix. Empfohlenes Video. What? He, wisst ihr, was so witzig ist? Ich hab seit 6 Jahren, wie gesagt, ich mache seit ungefähr 6 Jahren keine Videos mehr richtig, ja. Und ich hab auch seit 6 Jahren keine Abos bekommen. Das ist schon geil, ne? Ich hab immer mal wieder zwischendrin angefangen, dann hab ich die Abos, die ich verloren hab, wieder aufgeholt. Und dann hab ich wieder aufgehört, dann hab ich die alle Abos verloren, ne? Ähnliche YouTube-Stars. Julien Bam. Simon Tessio, come on, bro. Alles klar. Hättest du nie aufgehört, wärst du jetzt 1 Safecoin. 1 garantiert nicht, aber bestimmt nicht 609. Aber ganz ehrlich, hat ja seinen Grund gehabt, ja. Hat ja alles seinen Grund gehabt. Und ist ja jetzt irgendwo auch noch so, dass ich einfach keine Games hab, wo ich großartig was zu machen könnte. Ja, Marian, das ist eigentlich total easy. Also, wir sind die Games ausgegangen und letztendlich auch irgendwo die Motivation, YouTube-mäßig was zu machen. Weil ich halt auch keine Themen mehr hatte, die sich so ergeben haben, ja. Aber Battlefield und Call of Duty, da haben sich halt permanent irgendwelche Updates, irgendwelche Themen ergeben. Und ich hatte dann irgendwie auch keinen Bock mehr, mir die ganzen Sachen aus den Fingern zu saugen. Das heißt, ich werd's jetzt anders machen. Ich hab jetzt ja gerade wieder ein bisschen angefangen. Noch Kontakt zum Kaboom, ja. Ab und zu mal. Ich habe jetzt gerade ein bisschen angefangen wieder und ich werde es versuchen, jetzt ein bisschen anders zu machen. Ich versuche ein bisschen mehr, quasi ein bisschen mehr anderes Zeug zu etablieren, ja. Weil ich kann halt nicht zu Call of Duty was erzählen, wenn ich das selbst nicht spiele und es mir auch am Arsch vorbeigeht, ja. Was ich noch machen werde, ich werd mich mal ab und zu über aktuelle Sachen auslassen, was da so passiert. Zum Beispiel wollte ich mich jetzt auch mal auslassen, wieder mal über diese ganze Skill-Based-Matchmaking-Reverse-Boosting-Geschichte. Und das werd ich diesmal richtig trickreich machen. Ich werd mir ein paar Sachen, ich werd mir ein paar Aussagen raussuchen von bekannten YouTube-Leuten, die sich dazu auch geäußert haben. Und da werd ich dann erzählen, dass ich das überhaupt nicht so seh. Wobei das schwierig ist. Wahrscheinlich seh ich es nämlich genauso, aber gut. Mach doch ein bisschen Programmier-Stellzen. Nee, das kann ich nicht machen auf YouTube. Also, sag mal so, das höchste der Gefühle, was ich auf YouTube machen kann, ist wirklich sowas hier. Also das höchste der Gefühle, was ich technisch machen kann, ist sowas hier in der Richtung. Auch wenn das nicht viele geguckt haben, die Watch-Time war richtig gut. Man hat's ja glaub ich sicher, Battlefield-Video gemacht, bam, 30k. Instant-30k-Aufrufe einfach. Weißt du, ein Jahr lang nix hochgeladen, machst ein Battlefield-Video, 30k-Aufrufe. Bam. Instant-30k, easy. Ansonsten machst du irgendwelche anderen Sachen. Also, ist schwierig. Das ist auch das Problem. Ich muss jetzt mal gucken, ob ich irgendwas finde. Ob ich irgendwas finde, was sich halt, wo sich halt neue Themen und so auch irgendwie von selbst ergeben, ja. Ich kann jetzt nicht anfangen, da Hardcore-Technik-Krams zu machen. Das wollen von 270.000 Abos, wollen das 260.000 halt nicht sehen. Ein BF5-Video hätte safe weniger Views bekommen, ja klar. Alter, du kannst dir nicht vorstellen, ich hoffe insgeheim wirklich, also extrem extrem drauf, dass Venis Unleashed gut ankommt, aber ich hab wenig Hoffnung. Ich hab da wenig Hoffnung. Es ist so still, es ist so still drum und ich weiß auch nicht, wie viele Leute es noch wirklich interessiert. Also, das müsste schon richtig einschlagen und auch eine stabile Player-Base letztendlich haben und ja. Wie steht es denn zu aktuellen Spielen? Valorant, Cyberpunk, etc. Cyberpunk hab ich einen ganz großen Bogen drum gemacht, weil mir klar war, noch bevor das raus, ich hab's ja auch im Stream gesagt, dass das Ding unfertige Haufen an unzusammenhängenden Dingern sein wird, wobei Cyberpunk, wenn man mal die Open-World-Aspekte weglässt, wohl auch von der Story her und allem anderen ein recht gutes Game ist, wenn man den Reviews glaubt, aber der Open-World-Aspekt halt überhaupt nicht richtig gut funktioniert. Aber wie gesagt, deshalb hab ich einen riesen Bogen drum gemacht, es war von Anfang an klar, dass das höchst wahrscheinlich nix wird. Overwatch, nee, Overwatch hat Blizzard verkackt. Das Problem an Cold War ist tatsächlich zum coolsten Teil Skill-Based Matchmaking, was im Public Quickplay nix zu suchen hat. Man könnte es doch so gut machen, man könnte es so gut machen. Man macht einen Ranking-Modus und man macht einen Public Bash-Modus, ganz einfach. Warum haben die nicht stattdessen Witcher 4 gemacht? Wahrscheinlich weil sie keinen Bock hatten und keine Ideen für Witcher 4. Ich gehe aber davon aus, dass Witcher 4 kommen wird. Wenn die Cyberpunk überleben, könnte ich mir vorstellen, dass sie tatsächlich versuchen, das wieder gut zu machen und wo sie wissen, dass sie noch mal eine fette Bank, wie heißt denn das so? Bredt in der Bank? Nee, wie heißt man das? Wo sie halt einen dicken Bonus haben, dass sie vielleicht einen echten Witcher 4 probieren. Und ich muss euch ehrlich sagen, so sehr der Cyberpunk-Fail die Leute ärgert, das kann ich verstehen. Ich meine, das Game ist total unfertig, die NPCs ducken sich und machen nix. Aber eins muss man sagen, die Stonks-Leute von CD Projekt Red, die haben bei mir echt einen Pluspunkt gesammelt und zwar, die haben gesagt, dass, weiß nicht wo es steht, zumindest haben die gesagt, dass die ihren Entwicklern trotzdem, dass das Spiel jetzt nicht so gut angekommen ist, ihren Review-Score-Bonus bezahlen, weil sie erkannt haben, dass das ein Management-Problem ist. Ey, das hörst du sonst nirgendwo, ja? Genau, hier steht's. Also sprich, alle die da dran programmiert haben, bekommen ihren Bonus unabhängig vom Review-Score. Und mal ganz im Ernst, die haben es auch wirklich verdient. Ich meine, die sind gefühlt das komplette Ja im Überstunden-Modus und durch Entscheidungen, die sie nicht beeinflussen können oder zumindest nichts dran ändern können letztendlich, hätten sie jetzt quasi auch noch weniger bekommen, obwohl sie mehr geleistet haben. Also das finde ich voll, das finde ich top, ja? Natürlich, na klar, dreimal dürft ihr raten, wer den Scheiß bezahlt. Letztendlich die Typen, die pre-ordert haben und die das Spiel gekauft. Natürlich, aber die Entwickler haben es verdient. Also die Entwickler haben es auf jeden Fall verdient. Und da war eine gehörige Portion, das war nicht Unfähigkeit der Entwickler. Jeder trägt letztendlich aber seinen Teil zu bei, ja? Also da sind bestimmt auch ein paar Sachen drin, die man da schöner machen können. Aber zum größten Teil war das eine bisschen Stonks-Entscheidung, um das für diesen Weihnachten noch rauszubringen. Kill-Moves, das wird dir keiner so genau sagen können. Man kann so ein paar Sachen vermuten, ja? Dass halt vieles in das Game reingeklatscht wurde, dass es halt featuremäßig besser da steht, aber halt komplett unoptimiert. Ja, wenn du was programmierst, hast du ja immer die Wahl dazwischen, ok, ich feil da jetzt ein bisschen dran rum, dass es, sagen wir mal, schön ist und gut funktioniert und eben performant ist und so, das kostet halt Zeit. Oder ich kann in der gleichen Zeit zehn Sachen einbauen, dass es zumindest featuremäßig gut aussieht. Ja, jetzt stellt euch mal vor, als wäre Anfang des Jahres 2020 rausgekommen. Das wäre ja total kaputt gewesen, das Game. Wie sieht denn so ein Fehler im Management aus? Ja, so wie Cyberpunk. Ja, die haben zum Beispiel das mit Sicherheit abgewogen und gesagt, ok, die negative Presse und schlichten Reviews und alles Mögliche nehmen wir in Kauf, wenn wir das Weihnachtsgeschäft auch mitkriegen. Es gibt noch mehr Sachen. Du hast so was wie Enter, wo sie beispielsweise eine E3 Demo gemacht haben, ohne zu wissen, wie das fertige Game aussehen soll. Ja, aber ich finde es gut, dass sie das selbst erkannt haben und sagen, die Programmierer bekommen ihren Bonus. Stadia hat heute den ersten Cyberpunk-Conflict bekommen, den PC-Spieler schon seit vier Tagen haben. Es wird Zeit, dass wir mal irgendeinen Stadia im Meme-Build hier einblenden. Ok, so Leute, ich gehe jetzt ins Bett. Wir sehen uns nächsten Morgen oder so, mal gucken. Achso, ich bin ja schon aus der VM draußen. Ja, war Replay das Stream heute. Witcher war nicht so verbackt. Witcher hat auch seine Probleme gehabt, aber man muss auch ehrlich sagen, Witcher wurde meiner Ansicht nach auch nicht so sehr von der lebendigen Open World getragen, sondern eher von der Main-Quest und von der coolen Umgebung an sich, also von den nice Quests und dass halt die Welt cool gemacht war, aber nicht unbedingt jetzt durch irgendwelche super krassen ausgefeilten NPCs oder Sandbox-Geschichten. Da gab es ja in Witcher nicht so viel, weil man mal ehrlich ist. Witcher war Main-Quest und coole Side-Quests und die Welt war auch nice, ja, aber also Witcher war Open World mäßig jetzt auch nicht so wahnsinnig viel zu holen. Also Leute, ich gehe jetzt ins Bett, machts gut, wir sehen uns, bis dann, CU.", "segments": [{"id": 1, "start": 30.0, "end": 45.04, "text": "So, auf geht's, exellent. Leute, ich find mein Ploieti nicht mehr. Ich hab echt die"}, {"id": 2, "start": 45.04, "end": 49.16, "text": "letzten zwei Tage immer mal wieder gesucht, aber ich find's einfach nicht. Ich hab keine"}, {"id": 3, "start": 49.16, "end": 53.8, "text": "Ahnung wo ich das hin hab. Es kann ja nicht weit sein, das Ding ist auch ziemlich groß,"}, {"id": 4, "start": 53.8, "end": 65.24, "text": "aber ich find's einfach nett. Sehr merkwürdig. Sehr merkwürdig, alles hier. Wollt mal wieder"}, {"id": 5, "start": 65.24, "end": 70.32, "text": "was mit dem Ploieti aufnehmen? Hab mir gedacht, jo, holste raus und irgendwie war's nicht da."}, {"id": 6, "start": 70.32, "end": 79.08, "text": "Dieses Ding hier, das hab ich ja schon bestimmt, keine Ahnung, sechs Jahre oder so, oder länger."}, {"id": 7, "start": 79.08, "end": 85.88, "text": "Die Ursprungsvariante, ja, dieses Ding. Ich wusste gar nicht, dass es da Neues gibt mittlerweile,"}, {"id": 8, "start": 85.88, "end": 91.6, "text": "denn ich find's einfach nicht. Ich weiß nicht wo ich's hin hab. Ich weiß wo ich's früher hatte."}, {"id": 9, "start": 91.6, "end": 97.04, "text": "Früher hatte ich's entweder rechts auf dem Rechner oder hinterm Rechner stehen, weil ich"}, {"id": 10, "start": 97.04, "end": 104.36, "text": "auch das passende USB-Kabel dafür da hatte, aber es ist weg. Einfach weg. Und wisst ihr was auch"}, {"id": 11, "start": 104.36, "end": 113.12, "text": "weg ist? Meine Bestellung mit UPS ist weg. Ich hab mit UPS ja so ein Elgato Ringlight bestellt."}, {"id": 12, "start": 113.12, "end": 122.72, "text": "Und UPS hat keine Ahnung wo das Ding ist. Also es wurde angeblich versucht Samstags zuzustellen."}, {"id": 13, "start": 122.72, "end": 131.32, "text": "Okay, vielleicht war ich gerade nicht da. Okay, mag sein. So, dann wurde es angeblich am Montag"}, {"id": 14, "start": 131.32, "end": 140.0, "text": "wieder zugestellt, kam nix. Am Samstag wurde es angeblich, dann stand es danach da, dass es am"}, {"id": 15, "start": 140.0, "end": 146.8, "text": "Samstag ja schon abgegeben wurde, bei so einer Zusatz, bei so einer Paketstation Stelle, Sammelstelle,"}, {"id": 16, "start": 146.8, "end": 156.04, "text": "was auch immer. So, und dann stand gestern da, es ist angeblich wieder auf dem Weg zu mir, kam aber"}, {"id": 17, "start": 156.04, "end": 160.96, "text": "nix. Heute steht bei UPS wieder dran, es ist angeblich auf dem Weg, aber wird morgen zugestellt. Die"}, {"id": 18, "start": 160.96, "end": 167.36, "text": "haben keine Ahnung wo mein Zeug ist. Ich glaube die finden das einfach nicht. Gut, das ist jetzt nicht"}, {"id": 19, "start": 167.36, "end": 171.64, "text": "so wild. Ich mein, eigentlich wollte ich ein bisschen Bastelstream machen, deswegen hatte ich"}, {"id": 20, "start": 171.64, "end": 177.64, "text": "mir so ein Elgato, so ein Ding da bestellt. So was ist eigentlich viel zu teuer dafür, aber es ist"}, {"id": 21, "start": 177.64, "end": 182.52, "text": "schön hell. Da kann man Bastelstream so besser machen, also sprich, das nächste Mal wird das"}, {"id": 22, "start": 182.52, "end": 189.88, "text": "Ganze ein bisschen anders aussehen. Und zwar wird das nächste Mal wieder Bastelstream, ich muss"}, {"id": 23, "start": 189.88, "end": 198.92, "text": "mal Chat aufmachen, sonst vergess ich wieder irgendwas. Ja, der Gamer Alex, teilweise weiß ich auch nicht"}, {"id": 24, "start": 198.92, "end": 214.88, "text": "so genau was die da treiben. Ja, ich habe heute, ich habe von DHL, easy money, easy life, ich habe von"}, {"id": 25, "start": 214.88, "end": 221.04, "text": "DHL einen Dingzettel drin gehabt, das angeblich was beim Nachbar wäre. Und da dachte ich mir so,"}, {"id": 26, "start": 221.04, "end": 229.88, "text": "hä, die DHL, ich habe da überhaupt nix bestellt. So, und da bin ich zum Nachbar, mache die"}, {"id": 27, "start": 229.88, "end": 238.28, "text": "Nachbarin das Fenster auf und ich sage, ja Paket. Und dann gibt sie mir ein Paket mit, und jetzt"}, {"id": 28, "start": 238.28, "end": 249.68, "text": "kommt's, mit Weinverpackung. Ah, yes. Und das war tatsächlich an mich adressiert. Und da habe ich"}, {"id": 29, "start": 249.68, "end": 256.0, "text": "mir gedacht, wer zum Teufel schickt mir Wein? Bis ich dann irgendwann drauf gekommen bin, wer mir"}, {"id": 30, "start": 256.0, "end": 262.4, "text": "Wein schickt. Das ist irgendwas von der Arbeit, was ich da halt einfach nicht abgeholt habe,"}, {"id": 31, "start": 262.4, "end": 269.28, "text": "weil ich schon seit einem Monat ein Paket vom Chat, genau. Nee, das ist was von der Arbeit,"}, {"id": 32, "start": 269.28, "end": 275.76, "text": "die verteilen manchmal so ein paar Weihnachtsgeschenke. Und ich war einfach halt nicht da. Ich bin jetzt"}, {"id": 33, "start": 275.76, "end": 284.56, "text": "ja schon, ich habe jetzt ziemlich genau seit einem Monat Urlaub. Debaro sagt, er hat jetzt 200,"}, {"id": 34, "start": 284.56, "end": 289.24, "text": "100 über Bonding. Was hast du denn wie gebondet dafür? Ich habe echt, ich habe noch nie Wein"}, {"id": 35, "start": 289.24, "end": 297.84, "text": "bekommen, ey. Na ja, gut, es war auch nicht nur Wein, es war irgendwie eine Weinflasche. Und"}, {"id": 36, "start": 297.84, "end": 307.52, "text": "irgendwie Nudeln und Soße und irgendwelche komischen Dinger. Ach, keine Ahnung. Das gibt's"}, {"id": 37, "start": 307.52, "end": 311.2, "text": "bei uns öfters und zeuglich auf der Arbeit als Weihnachtsgeschenke. Ich bin ja der Meinung,"}, {"id": 38, "start": 311.2, "end": 316.32, "text": "das müsste ehrlich gesagt überhaupt nicht sein. Sollten einfach jedem mehr Geld geben, easy. Ich"}, {"id": 39, "start": 316.32, "end": 322.88, "text": "brauche keine Weihnachtsgeschenke. Was heißt, ich habe fast keinen Content gemacht. Weißt du,"}, {"id": 40, "start": 322.88, "end": 327.88, "text": "wie viel Content ich gemacht habe? Spicke, guck dir das mal an. Also, ich habe auf, ich habe auf"}, {"id": 41, "start": 327.88, "end": 337.88, "text": "YouTube, ich habe auf YouTube die letzten Tage, guck dir das mal an hier, 1, 2, 3, 4 Videos gemacht,"}, {"id": 42, "start": 337.88, "end": 343.36, "text": "das ist für meine Verhältnisse viel. Und ich habe eigentlich fast jeden Tag oder jeden zweiten"}, {"id": 43, "start": 343.36, "end": 346.96, "text": "Tag gestreamt. Also, man kann sich nur wirklich nicht beschweren, dass das aktuell wenig wäre."}, {"id": 44, "start": 346.96, "end": 354.16, "text": "Weil ich mache keine 5-Stunden-Streams oder so. Selfmade, ISE, 7 Monate Dankeschön für den"}, {"id": 45, "start": 354.16, "end": 360.16, "text": "Sub. Huge Subscription. Asif. Genau, was ich euch eigentlich zeigen wollte. Also, hier,"}, {"id": 46, "start": 360.16, "end": 376.16, "text": "letztes Mal Bastel-Stream sah ja so aus. Was ist denn jetzt? So, exellent. Also, so sah es ja im"}, {"id": 47, "start": 376.16, "end": 381.44, "text": "letzten Bastel-Stream aus. Kann man eigentlich Twitch anhalten? Oh, ich habe es irgendwie geschafft,"}, {"id": 48, "start": 381.44, "end": 386.96, "text": "Twitch anzuhalten, ohne dass das Anhaltensymbol eingeblendet wird. Okay, auch gut, da kann ich"}, {"id": 49, "start": 386.96, "end": 393.2, "text": "jetzt ja was sagen, was ich wollte. Und so sah es ja beim letzten Bastel-Stream aus. Ich habe das"}, {"id": 50, "start": 393.2, "end": 399.56, "text": "jetzt viel advanceder, haben wir das jetzt. Ich habe jetzt einen Kamerahalter, was ich hier neben"}, {"id": 51, "start": 399.56, "end": 406.36, "text": "am Tisch habe und ich habe meine ordentliche Beleuchtung bestellt und die Kamera übertragen"}, {"id": 52, "start": 406.36, "end": 413.64, "text": "werde, das nächste Mal auch nicht mehr so doof über diese komische iOS-App. So, ich bin mir"}, {"id": 53, "start": 413.64, "end": 417.8, "text": "nur nicht so ganz... Chat, da muss ich euch jetzt mal fragen. Ich bin mal... Was haben wir eigentlich"}, {"id": 54, "start": 417.8, "end": 423.8, "text": "noch für offene Stream-Ideen? Das kann ich... Das würde ich ja gerne on-Stream machen, meine"}, {"id": 55, "start": 423.8, "end": 433.04, "text": "Wii U-Flaschen, ey. Keck-WWW, das würde ich echt gerne machen. Zumindest, da muss ich euch was"}, {"id": 56, "start": 433.04, "end": 438.96, "text": "fragen. Also, für den nächsten Bastel-Stream. Also sprich, wenn wir das nächste Mal wieder"}, {"id": 57, "start": 438.96, "end": 445.48, "text": "sowas hier in dieser Richtung machen. Was wollen wir machen? Also, ich glaube, mit LED-Leisten haben"}, {"id": 58, "start": 445.48, "end": 451.72, "text": "wir jetzt genug gebastelt. LED-Leisten ist jetzt erstmal vorbei. Sag mal, kann man Twitch irgendwie"}, {"id": 59, "start": 451.72, "end": 461.04, "text": "anhalten, ohne dass es grau wird? Wahrscheinlich, ja. Also LED-Leisten haben wir jetzt, glaube ich,"}, {"id": 60, "start": 461.04, "end": 471.44, "text": "genug gemacht. Und ich glaube, Stecker... Ich glaube, Stecker... Moment. Stimmt, wie sieht es"}, {"id": 61, "start": 471.44, "end": 482.16, "text": "eigentlich mit Rush-Servern aus? Schauen wir mal kurz. Genau, und China-Steckdosen haben wir auch"}, {"id": 62, "start": 482.16, "end": 490.84, "text": "jetzt oft genug geflasht. Guck mal, hier ist ja richtig was los, Alter. Da geht ja richtig was"}, {"id": 63, "start": 490.84, "end": 496.2, "text": "hier. Metro Only, Rush Classics, aber 64-Mann, 64-Mann. Ehrlich gesagt, ein bisschen viel."}, {"id": 64, "start": 496.2, "end": 509.04, "text": "Official. Gut, da ist keiner drauf. Da bleibt ja eigentlich nur das hier. Der ist nicht Metro Only,"}, {"id": 65, "start": 509.04, "end": 514.92, "text": "der hat alles Mögliche. Ja, genau. Also, um es mal wieder zurückzukommen. Also, es ist ein bisschen"}, {"id": 66, "start": 514.92, "end": 523.68, "text": "schwierig, was wir da machen könnten als nächstes. Ich bin mir da nicht so ganz sicher. Weil ich"}, {"id": 67, "start": 523.68, "end": 527.96, "text": "hätte was Cooles, was ich eh mal erneuern müsste, aber das kann ich nicht ausprobieren im Stream und"}, {"id": 68, "start": 527.96, "end": 535.56, "text": "das ist langweilig. Und zwar, ich hab bei mir ja im Keller noch sowas hier hängen. So ein ganz"}, {"id": 69, "start": 535.56, "end": 539.08, "text": "ollen, vielleicht kennt ihr es noch. Weiß ich nicht, hat das überhaupt noch einer von euch im Keller?"}, {"id": 70, "start": 539.08, "end": 552.08, "text": "So richtig ein Oldschool Stromzähler habe ich im Keller. Also, kennt ihr sowas noch? Ja, ist auch bei"}, {"id": 71, "start": 552.08, "end": 555.8, "text": "euch? Okay. So, und was ich da gemacht habe ist, also wir haben zwei Sachen. Wir haben so einen"}, {"id": 72, "start": 555.8, "end": 561.8, "text": "Stromzähler und wir haben so ein bisschen neueren, wo man so eine LED oben dran hat. Und was ich"}, {"id": 73, "start": 561.8, "end": 565.92, "text": "gemacht habe ist, schon vor einer ganzen Weile, an den Stromzähler kann man leider nicht ran und"}, {"id": 74, "start": 565.92, "end": 572.04, "text": "der ist so ausgebildet, kann man nicht flashen. Aber wenn, kennt ihr mich, ich will ihn flashen."}, {"id": 75, "start": 572.04, "end": 577.68, "text": "Ne, also was ich gebaut habe ist, einmal was, was diese Scheibe hier abtastet und erkennt,"}, {"id": 76, "start": 577.68, "end": 583.32, "text": "wenn die rumläuft, okay, kann man quasi erkennen. Und einmal was, was die LED oben erkennt, wenn sie"}, {"id": 77, "start": 583.32, "end": 587.16, "text": "blinkt bei diesem anderen Stromzähler, wo ich quasi auch auswerten kann, was ich für einen"}, {"id": 78, "start": 587.16, "end": 592.44, "text": "Stromverbrauch im Haus habe. Ist eigentlich eine ganz coole Geschichte. Wollte ich mal im Stream"}, {"id": 79, "start": 592.44, "end": 598.8, "text": "nachbauen, weil das ist auch jetzt nicht unbedingt mehr das allerneueste Board. Und die Konstruktion"}, {"id": 80, "start": 598.8, "end": 604.84, "text": "ist auch sehr abenteuerlich. Wollte ich im Stream eigentlich nachbauen, aber das Dumme ist, man kann"}, {"id": 81, "start": 604.84, "end": 610.72, "text": "es halt nicht ausprobieren. Ich kann mir ja schlecht auf meinem Basteltisch so einen Stromzähler leben."}, {"id": 82, "start": 610.72, "end": 619.08, "text": "Warum, was kosten sowas? So, jetzt vielleicht, warum, was kosten sowas eigentlich? Easy."}, {"id": 83, "start": 619.08, "end": 626.28, "text": "Ich kaufe mir einfach für 9,17 Euro Stromzähler, dann können wir es im Stream ausprobieren."}, {"id": 84, "start": 626.28, "end": 640.2, "text": "Eigentlich nicht schlecht, ja. Kann man das von Hand drehen? Kennt sich da irgend einer mit aus?"}, {"id": 85, "start": 640.2, "end": 643.52, "text": "Kann man das von Hand drehen? Weil anschließend werde ich den bestimmt nicht, ja."}, {"id": 86, "start": 643.52, "end": 661.8, "text": "Kann man das von Hand drehen? Nee, kann man nicht. Na, das ist ja doof. Polarfuchs, zwei Monate,"}, {"id": 87, "start": 661.8, "end": 666.04, "text": "danke schön für den Sub. Sorry Leute, falls ich irgendwas übersehen habe, aber danke für die"}, {"id": 88, "start": 666.04, "end": 677.24, "text": "huge zwei Monate Subscription. Ich roll mal kurz Chat durch. Selfmade Eyes hab ich gesehen. Nee nee,"}, {"id": 89, "start": 677.24, "end": 681.96, "text": "sonst hatten wir nix. Genau, also das ist das eine, das wollte ich eigentlich im Stream nachbauen."}, {"id": 90, "start": 681.96, "end": 689.64, "text": "Also kein Stromzähler, sondern mein Stromzähler-Abtast-Projekt. Dumme ist, es ist halt echt dumm,"}, {"id": 91, "start": 689.64, "end": 695.04, "text": "dass ich nicht ausprobieren kann, ja, im Stream dann. Das sackt. Die LED-Abtaste könnte man"}, {"id": 92, "start": 695.04, "end": 702.88, "text": "ausprobieren, aber alles andere nicht. Kannst du da einfach eine Steckdose anschließen? Ja,"}, {"id": 93, "start": 702.88, "end": 707.96, "text": "aber da muss ich den Zähler anschließen. Ich will den Zähler gar nicht anschließen. Da muss"}, {"id": 94, "start": 707.96, "end": 712.12, "text": "ich dann irgendwelche Stromdinger drum basteln. Will ich gar nicht. Nee nee, da müsste ich mir"}, {"id": 95, "start": 712.12, "end": 715.36, "text": "erstens einen kaufen und außerdem müsste ich irgendwie drum basteln. Das heißt, das Projekt"}, {"id": 96, "start": 715.36, "end": 725.92, "text": "ist ein bisschen doof, um das im Stream zu machen. Ich weiß nicht, aber könnte man trotzdem machen."}, {"id": 97, "start": 725.92, "end": 730.96, "text": "Vielleicht kann man das irgendwie simulieren, dieses Ding, wenn es da durchläuft. Ich nehme"}, {"id": 98, "start": 730.96, "end": 739.6, "text": "dann einfach irgendeine Verpackung oder Alufolie oder so und mache einen Strich drauf und ziehe"}, {"id": 99, "start": 739.6, "end": 746.96, "text": "das dann durch und dass man halt einfach sieht, dass es funktioniert. Ja, was muss man da"}, {"id": 100, "start": 746.96, "end": 753.84, "text": "anschließen? Wie geht denn das? Ich habe keine Ahnung. Ich meine, hier klemmt man das wohl"}, {"id": 101, "start": 753.84, "end": 775.04, "text": "irgendwie dran und sehr gut. Ich meine, ich kann ja wahrscheinlich. Nee, das lasse ich bleiben."}, {"id": 102, "start": 775.04, "end": 779.0, "text": "So, also das ist, wie gesagt, das eine, was man machen könnte. Ich kann noch mal kurz"}, {"id": 103, "start": 779.0, "end": 789.72, "text": "meine Ideen durchgucken. Und das andere weiß ich nicht so genau. Also ich habe mir überlegt,"}, {"id": 104, "start": 789.72, "end": 796.68, "text": "man könnte was machen, was jedem so ein bisschen was bringt. Hast du die Nanoleaf-Dinger versucht"}, {"id": 105, "start": 796.68, "end": 800.44, "text": "zu drucken? Nee, nee, habe ich nicht. Ich überlege gerade, was wir als nächstes im"}, {"id": 106, "start": 800.44, "end": 807.28, "text": "Bastelstream machen könnten. Ich wollte mein Stromzähler-Ding quasi neu nachbauen,"}, {"id": 107, "start": 807.28, "end": 811.12, "text": "aber das funktioniert nicht. Was ich mir dann überlegt habe, was wir machen könnten, ist,"}, {"id": 108, "start": 811.12, "end": 813.72, "text": "das ist jetzt halt für Leute, die ein bisschen was mit Controller gemacht haben, schon nicht"}, {"id": 109, "start": 813.72, "end": 819.48, "text": "so ultraspannend. Und zwar, wir könnten uns einen eigenen Multisensor bauen, also sprich"}, {"id": 110, "start": 819.48, "end": 825.48, "text": "ein Sensor mit, also ein Board, dann brauchen wir ein Gehäuse, vielleicht 3D drucken wir"}, {"id": 111, "start": 825.48, "end": 839.72, "text": "das auch. Und Luftfeuchtigkeit, Temperatur, Luftdruck, Bewegungsmelder und Sensor, ob Licht"}, {"id": 112, "start": 839.72, "end": 846.08, "text": "an oder aus ist. So was ist, denke ich mal, insofern ganz praktisch, weil, ich weiß, der"}, {"id": 113, "start": 846.08, "end": 850.88, "text": "Chat mag den Desktop, deswegen zeige ich den Desktop immer. Ich weiß nicht, ist es euch"}, {"id": 114, "start": 850.88, "end": 866.72, "text": "so lieber? Vielleicht noch. Ich glaube, so ist es noch besser, oder? Ah, yes. 2x Firefox,"}, {"id": 115, "start": 866.72, "end": 877.12, "text": "ja, ein Firefox kann man nie genug haben. Bitte ein Eierjahr als Background, nee, nee,"}, {"id": 116, "start": 877.12, "end": 897.04, "text": "ich behalte das Windows XP. Such mal was, was soll ich suchen? Disk TXT, da, ist es."}, {"id": 117, "start": 897.04, "end": 908.56, "text": "War das jetzt, sollte das jetzt eine Challenge sein? Ich hätte gedacht, dass ich das so"}, {"id": 118, "start": 908.56, "end": 920.48, "text": "schnell finde, ne? Wie hat sich Microsoft Edge reingeschlichen? Das ist ganz einfach,"}, {"id": 119, "start": 920.48, "end": 926.76, "text": "wie sich Edge reingeschlichen hat. Der Kram ist vorinstalliert mittlerweile. Oder wird,"}, {"id": 120, "start": 926.76, "end": 930.64, "text": "wird, wird mittlerweile mitinstalliert. Also, insofern, der ist einfach standardmäßig"}, {"id": 121, "start": 930.64, "end": 939.4, "text": "da. Hast du schon mal was mit Maschinellem Lernen gemacht? Ja, aber nur als Benutzer"}, {"id": 122, "start": 939.4, "end": 947.8, "text": "von der Library. Ich habe nichts quasi da algorithmmäßig selbst implementiert, ja."}, {"id": 123, "start": 947.8, "end": 953.64, "text": "Also, ich bin ja gerade dabei, was zu entwickeln, wo man seine Überwachungskameras reinmachen"}, {"id": 124, "start": 953.64, "end": 958.24, "text": "kann. Und der dann erkennt, wenn jemand durchs Bild läuft. Das funktioniert auch ziemlich"}, {"id": 125, "start": 958.24, "end": 964.4, "text": "gut, habe ich auch schon im Stream gezeigt hier. Und ja, das verwende ich gerade. Genau,"}, {"id": 126, "start": 964.4, "end": 968.48, "text": "also wie gesagt, so einen Multisensor könnten wir bauen. Was zum Geier wird Amazon jetzt"}, {"id": 127, "start": 968.48, "end": 974.28, "text": "mit Finanzierung, ja, ja, ich glaube mit Finanzierung ist klar. Was sagt uns, was sagt Amazon eigentlich"}, {"id": 128, "start": 974.28, "end": 979.92, "text": "hier zu Weihnachtsgeschenken? Habt ihr schon eure Weihnachtsgeschenke? Ich habe noch nichts,"}, {"id": 129, "start": 979.92, "end": 983.84, "text": "ich habe noch gar nichts. Und ich brauche noch was und ich habe keine Ahnung, was ich"}, {"id": 130, "start": 983.84, "end": 988.36, "text": "kaufen soll. Was haben wir da oben? Ah ja, so ein Cuttermesser für meine Mutter. Exzellent."}, {"id": 131, "start": 988.36, "end": 994.12, "text": "Ich glaube, dass ich das richtig schenke. Oh, guck mal, es gibt einen China, es gibt"}, {"id": 132, "start": 994.12, "end": 1001.12, "text": "einen China-Roller. Hast du eine Klimaanlage, in der du rumbasteln könntest? Ja, habe ich"}, {"id": 133, "start": 1001.12, "end": 1009.88, "text": "schon gemacht. Haben wir schon im Stream gemacht. Guck mal, ein China-Roller. Und warum genau"}, {"id": 134, "start": 1009.88, "end": 1031.2, "text": "ist der so teuer? Hä? Ach, das ist ein E-Scooter. Mit Straßenzulassung. Es ist witzig, dass man"}, {"id": 135, "start": 1031.2, "end": 1035.4, "text": "den überhaupt ohne Straßenzulassung bestellen kann. Weil mal im Ernst, wie viele Leute bestellen"}, {"id": 136, "start": 1035.4, "end": 1040.32, "text": "sich das Ding ohne Straßenzulassung und fahren damit auf der Straße? Wahrscheinlich jeder."}, {"id": 137, "start": 1040.32, "end": 1043.4, "text": "Ich meine, wer bestellt sich so ein Ding ohne Straßenzulassung und fährt dann nicht damit?"}, {"id": 138, "start": 1043.4, "end": 1051.08, "text": "So was ohne Fahrt, das ist total eingepflegt. Den kann man flashen? Easy. Kann man den"}, {"id": 139, "start": 1051.08, "end": 1058.32, "text": "echt flashen? Moment, wie heißt das Ding? Moment, das muss ich jetzt nachgucken. Wie"}, {"id": 140, "start": 1058.32, "end": 1065.76, "text": "heißt denn der Modellnummer? Jetzt gucken wir mal, ob wir Custom-Firmware drauf machen"}, {"id": 141, "start": 1065.76, "end": 1084.28, "text": "können. Wie heißt das Ding? Hier. M365 Pro. Exzellent. Das hier ist Custom-Firmware. Custom-Firmware-Erfahrung"}, {"id": 142, "start": 1084.28, "end": 1096.8, "text": "mit dem Roller. Nice. Da muss ich gleich gucken. Guck mal, es gibt einen Custom-Firmware-Bilder"}, {"id": 143, "start": 1096.8, "end": 1115.36, "text": "für den Roller. Wow. Äußerst vertrauenserwürdige Seite. Ein Custom-Firmware-Bilder für den"}, {"id": 144, "start": 1115.36, "end": 1132.64, "text": "Roller. Okay, das finde ich geil irgendwie. Wie viel kostet der? Moment. Moment, Moment,"}, {"id": 145, "start": 1132.64, "end": 1142.2, "text": "Moment, Moment, Moment. Also, der mit 30 Kilometer Reichweite, der hat wahrscheinlich"}, {"id": 146, "start": 1142.2, "end": 1148.64, "text": "einfach einen kleineren Akku drin. Sehe ich das richtig? Hier, 205 Wattstunden Lithium-Ionen-Batterie"}, {"id": 147, "start": 1148.64, "end": 1174.84, "text": "und der hat? Steht nicht dabei. Auch? Nee, Moment. Ach nee."}, {"id": 148, "start": 1174.84, "end": 1182.72, "text": "Ja, wahrscheinlich, wahrscheinlich einfach ein bisschen mehr. Aber das ist tatsächlich"}, {"id": 149, "start": 1182.72, "end": 1188.44, "text": "ganz interessant. Ich meine, man könnte, man kann sich doch dann einfach den da kaufen,"}, {"id": 150, "start": 1188.44, "end": 1195.68, "text": "Custom-Firmware drauf machen und, und, und, und, und easy, easy Turbo, oder? Das ist doch"}, {"id": 151, "start": 1195.68, "end": 1199.44, "text": "immer eine geile Idee. Nein, ich will natürlich hier keinen dazu anstiften, irgendwelche"}, {"id": 152, "start": 1199.44, "end": 1203.4, "text": "illegalen Dinger zu machen. So, das wird im Moment, das Video muss ich mir jetzt angucken."}, {"id": 153, "start": 1203.4, "end": 1211.76, "text": "Der Roller mit der Custom-Firmware, Alter, das muss ich mir jetzt. Oh, Cocomodates am"}, {"id": 154, "start": 1211.76, "end": 1221.8, "text": "Start. Na, nee, also ich glaube nicht, dass du Probleme kriegst. Roffel, wenn du einfach"}, {"id": 155, "start": 1221.8, "end": 1229.36, "text": "nur Custom-Firmware draufflasht, die nicht schneller fahren kann, als zugelassen ist,"}, {"id": 156, "start": 1229.36, "end": 1234.84, "text": "ist das wahrscheinlich kein Problem, ja. Und mal davon abgesehen, es ist an sich auch"}, {"id": 157, "start": 1234.84, "end": 1239.24, "text": "kein Problem, solange du nicht schneller fährst. Ich gehe mal davon aus, ich hab keine Ahnung,"}, {"id": 158, "start": 1239.24, "end": 1243.96, "text": "wie das rechtlich ist, by the way. Ich denke jetzt einfach mal nur laut. Ich glaube, es"}, {"id": 159, "start": 1243.96, "end": 1250.92, "text": "ist ziemlich egal, ob dein Roller, ob du den mit Custom-Firmware, vielleicht, die keine"}, {"id": 160, "start": 1250.92, "end": 1262.24, "text": "Ahnung, 150 kmh fahren kann, wenn du nur 20 kmh fährst, ist egal. Speedchamp, genau,"}, {"id": 161, "start": 1262.24, "end": 1272.6, "text": "das muss ich mir jetzt ein Custom-Erfahrung mit... Ich finde, okay, das finde ich interessant,"}, {"id": 162, "start": 1272.6, "end": 1276.76, "text": "dass man Roller Custom-Firmware flaschen kann. Aber auf der anderen Seite, warum eigentlich?"}, {"id": 163, "start": 1276.76, "end": 1283.76, "text": "Warum sollte man den... Leute, ich nehme das zurück, die Frage stelle ich mir bei anderen"}, {"id": 164, "start": 1283.76, "end": 1288.6, "text": "Sachen auch nicht, weil es geht. Aber mich würde es trotzdem mal interessieren, warum"}, {"id": 165, "start": 1288.6, "end": 1296.84, "text": "sollte ich den Roller flaschen mit Custom-Firmware? Ach, ist das wirklich so, chat? Wie gesagt,"}, {"id": 166, "start": 1296.84, "end": 1302.76, "text": "ich kenne mich da nicht aus. Also was Auto und Verkehrssachen angeht, bin ich ja der"}, {"id": 167, "start": 1302.76, "end": 1314.04, "text": "übelste Kacknubig, man guckt euch mein Auto an. Ist das wirklich so? Also, ist das illegal,"}, {"id": 168, "start": 1314.04, "end": 1324.04, "text": "wenn ich meinen Roller Custom-Flasche? Ich meine, solange ich mich an die maximale Geschwindigkeit"}, {"id": 169, "start": 1324.04, "end": 1339.68, "text": "halte... Aha, okay, ich sehe da Chat, der Chat kennt sich aus, nee, dann lohnt sich"}, {"id": 170, "start": 1339.68, "end": 1345.6, "text": "das nicht. Dann lohnt sich das ja nicht, den Custom zu flaschen, das ist ja dann sinnlos."}, {"id": 171, "start": 1345.6, "end": 1351.04, "text": "Das macht ja wirklich gar keinen Sinn. Wenn ich damit dann nicht mal auf der Straße fahre,"}, {"id": 172, "start": 1351.04, "end": 1355.08, "text": "also wenn ich mir einen Elektroroller hole, dann will ich damit auch auf der Straße fahren"}, {"id": 173, "start": 1355.08, "end": 1361.4, "text": "können. Wie schwer ist denn sowas? Ich muss mir jetzt mal einen Test zu diesem Ding angucken,"}, {"id": 174, "start": 1361.4, "end": 1365.36, "text": "das interessiert mich jetzt echt. Weil ich muss euch ehrlich sagen, ich lieb Eugeln"}, {"id": 175, "start": 1365.36, "end": 1375.44, "text": "schon die ganze Zeit. So ein bisschen mit einem Elektroroller. Wie hieß dieses Ding"}, {"id": 176, "start": 1375.44, "end": 1393.56, "text": "nochmal? M365 oder so? Da muss ich mir jetzt mal kurz einen Test angucken. 12 Kilo! Okay,"}, {"id": 177, "start": 1393.56, "end": 1398.68, "text": "das ist schon ein busy was, das würde ich jetzt nicht unbedingt im Zug mitschleppen"}, {"id": 178, "start": 1398.68, "end": 1411.2, "text": "müssen. Wobei, das kann man eben bei sich herrollen. Oh, Max 100 Kilo! Oh, wird ganz"}, {"id": 179, "start": 1411.2, "end": 1429.92, "text": "knapp. Ob es mich aushält? Aber ich muss natürlich, wenn ich das fahre, da muss ich"}, {"id": 180, "start": 1429.92, "end": 1435.48, "text": "auf jeden Fall meine Gunner Optics Scope Brille aufziehen und dann mache ich die 60s damit."}, {"id": 181, "start": 1435.48, "end": 1444.44, "text": "So, ich muss mir damit echt einen Test angucken. One year later. Still best e-Scooter 2020."}, {"id": 182, "start": 1444.44, "end": 1460.04, "text": "Okay, gibt es das Video auch noch in kurz? Ey, mit so einer GoPro Kamera sieht das aus"}, {"id": 183, "start": 1460.04, "end": 1465.76, "text": "wie ein Miniatur Fahrrad, oder? Guck mal, das sieht aus als fährt er so ein Minifahrrad"}, {"id": 184, "start": 1465.76, "end": 1493.28, "text": "mit der Kamera. Das ist ja nice! Ich brauche so einen Teil. Gibt es diese Dinger bei euch"}, {"id": 185, "start": 1493.28, "end": 1502.04, "text": "in der Stadt nicht zu mieten? Doch! Deswegen, ich finde die ultra nice. Was aber witzig"}, {"id": 186, "start": 1502.04, "end": 1507.64, "text": "ist, das ist typisch Frankfurt bei uns, ne? Am Anfang hast du die Dinger überall gesehen,"}, {"id": 187, "start": 1507.64, "end": 1511.7, "text": "mittlerweile ist schon die Hälfte weg. Weil die Leute, die keine Ahnung in meinen geschmissen"}, {"id": 188, "start": 1511.7, "end": 1516.04, "text": "haben oder so. Es sind viel weniger als noch vor einem halben oder vor, es sind viel weniger"}, {"id": 189, "start": 1516.04, "end": 1519.44, "text": "als vor einem dreiviertel Jahr oder einem Jahr, wo das angefangen hat. Letztes Jahr"}, {"id": 190, "start": 1519.44, "end": 1523.92, "text": "hat das, glaube ich, angefangen oder Frühling oder so hat das angefangen. Frühling, Frankfurt"}, {"id": 191, "start": 1523.92, "end": 1529.84, "text": "war alles voll mit e-Scootern und mittlerweile stehen da viel weniger rum. Und ich wette"}, {"id": 192, "start": 1529.84, "end": 1533.08, "text": "mit euch, Leute haben die in meinen geschmissen und sowas. Es gibt so viele fertige Leute"}, {"id": 193, "start": 1533.08, "end": 1546.36, "text": "in Frankfurt. Einfach selber kaufen, ne wieso? Ich bin ja nicht nur in der Innenstadt von"}, {"id": 194, "start": 1546.36, "end": 1551.4, "text": "Frankfurt unterwegs, wo es so Dinger gibt. Ja, ich wohne ja nicht direkt in Frankfurt"}, {"id": 195, "start": 1551.4, "end": 1555.68, "text": "und gerade da, wo ich wohne, ist das gar nicht mal schlecht, wenn ich so ein e-Scooter, weil"}, {"id": 196, "start": 1555.68, "end": 1561.28, "text": "ich fahre halt nicht gern Auto, das wisst ihr ja. Und mein Auto ist halt e-Scooter. Ihr"}, {"id": 197, "start": 1561.28, "end": 1569.08, "text": "kennt mein Auto, ja. Das will auch nicht, dass ich oft mit ihm fahre. Und so ein e-Scooter,"}, {"id": 198, "start": 1569.08, "end": 1572.48, "text": "wenn ich mal irgendwie was einkaufen will, das ist eigentlich was richtig Cooles. Und"}, {"id": 199, "start": 1572.48, "end": 1578.88, "text": "wie lange geht es? 30 km? Das reicht, ja. Kennt ihr mein Auto? Okay, okay. Ich muss"}, {"id": 200, "start": 1578.88, "end": 1583.72, "text": "es, okay Leute, ich muss es nochmal revealen. Es gibt kein Ausrufezeichen, Auto. Ich hab"}, {"id": 201, "start": 1583.72, "end": 1593.96, "text": "einen. Auch genau in der Farbe, Alter. Ich weiß, jetzt kommen die Alten, jetzt kommen"}, {"id": 202, "start": 1593.96, "end": 1607.04, "text": "die erst mal wieder an, Alter, Max, Ghetto, Auto oder irgendwie sowas. Aber GG, GG, ja."}, {"id": 203, "start": 1607.04, "end": 1614.36, "text": "Nicht doch, das ist mein Ernst. Was habt ihr alle ge-, ich verstehe das gar nicht. Was,"}, {"id": 204, "start": 1614.36, "end": 1620.4, "text": "warum findet der Chad mein Auto so lustig? Das ist, das ist huge Auto, ja. Da passe"}, {"id": 205, "start": 1620.4, "end": 1629.52, "text": "ich gut rein. Das ist recht hoch. Das war nicht teuer. Und ich brauch's nicht oft."}, {"id": 206, "start": 1629.52, "end": 1637.8, "text": "Vor allem auch in der Farbe. So, gut. Haben wir uns, jetzt haben wir uns erstmal alle"}, {"id": 207, "start": 1637.8, "end": 1642.48, "text": "eine Runde wieder über das Auto von Max gelacht. Wunderbar. So, könnt ihr euch jetzt vorstellen,"}, {"id": 208, "start": 1642.48, "end": 1650.48, "text": "warum ich lieber E-Scooter fahre? Nee, ich, wie gesagt, ich bin kein großer Auto. Ich"}, {"id": 209, "start": 1650.48, "end": 1659.04, "text": "mag, ich bin, fahre nicht gerne Auto. Aber ich finde das Ding übelst nice. So, und"}, {"id": 210, "start": 1659.04, "end": 1672.84, "text": "20 km reicht auch, 30 km reicht auch voll und ganz. Das, ich finde das, finde das echt"}, {"id": 211, "start": 1672.84, "end": 1701.24, "text": "nice. Na ja. Ja, und 30 km, das war nicht, wobei, wobei ist halt die Frage, ne, ob die"}, {"id": 212, "start": 1701.24, "end": 1708.88, "text": "30 km Angabe realistisch ist. Ich meine, die Chinesen sind ja nicht dafür bekannt, da"}, {"id": 213, "start": 1708.88, "end": 1719.48, "text": "realistische Zahlen auf ihre Sachen zu schreiben. Ja, 20 km reicht. Ist das der Akkustand oder"}, {"id": 214, "start": 1719.48, "end": 1724.8, "text": "ist das die Geschwindigkeit, was man da drauf sieht? Die Geschwindigkeit, hä? Der Akkustand"}, {"id": 215, "start": 1724.8, "end": 1730.36, "text": "ist hier unten. Das da unten ist der Akkustand. Da oben ist die Geschwindigkeit. Darf man"}, {"id": 216, "start": 1730.36, "end": 1750.56, "text": "das Ding, ja, das ist wohl ok. Das wird gerade bei Amazonie verkauft. Guck mal, da hat man"}, {"id": 217, "start": 1750.56, "end": 1760.32, "text": "sogar eine Bremse. Ich finde das geil. Ich will jetzt echt mal überlegen, ob ich mir"}, {"id": 218, "start": 1760.32, "end": 1769.0, "text": "einen kaufe. Das hat irgendwie was. Aber das Dumme ist, braucht man China Cloud dafür?"}, {"id": 219, "start": 1769.0, "end": 1781.08, "text": "Mi Home App, oh, geh mal weg, Alter, diese crap China Software da. Nein, ich mach da"}, {"id": 220, "start": 1781.08, "end": 1787.0, "text": "keine Custom Firmware drauf. Das Problem ist, ein Custom Firmware, ich finde, Custom Firmware"}, {"id": 221, "start": 1787.0, "end": 1790.28, "text": "ist ja das Beste, was man machen kann, aber gerade wenn man auf der Straße fährt und"}, {"id": 222, "start": 1790.28, "end": 1804.92, "text": "wenn es dann rechtliche Probleme in Deutschland gibt, dann lasse ich das eher sein. Ja, nee."}, {"id": 223, "start": 1804.92, "end": 1810.88, "text": "Ich finde das geil. Irgendwie hat das was. Ich mein, alternativ könnte man sich ein"}, {"id": 224, "start": 1810.88, "end": 1818.32, "text": "Fahrrad holen, ne? Dann wären wir auch nicht mal pepo fett. Jetzt habe ich jetzt, Leute,"}, {"id": 225, "start": 1818.32, "end": 1827.52, "text": "ich habe die Idee. Ich hole mir erst ein Fahrrad und dann fahre ich so lange Fahrrad, bis ich"}, {"id": 226, "start": 1827.52, "end": 1834.16, "text": "unter dem Maximalgewicht vom Roller bin und dann fahre ich so lange Roller, bis ich wieder"}, {"id": 227, "start": 1834.16, "end": 1841.76, "text": "über das Maximalgewicht vom Roller komme und dann fahre ich wieder Fahrrad. Das ist"}, {"id": 228, "start": 1841.76, "end": 1856.08, "text": "auch ein guter Plan, oder? Jetzt wird der Wasserplan gespielt. Nee, aber Leute, jetzt mal, wie"}, {"id": 229, "start": 1856.08, "end": 1861.4, "text": "würde, Hand aufs Herz. Ich bin unter dem Maximalgewicht vom Roller, weil ihr könnt euch ja noch dran"}, {"id": 230, "start": 1861.4, "end": 1866.08, "text": "erinnern, als wir die Waage im Stream getestet haben. Nur, ich habe kein Fahrrad. Ich wollte"}, {"id": 231, "start": 1866.08, "end": 1870.4, "text": "mir das so eine Weile kaufen. Als wir die Waage im Stream getestet haben, weil weiß ich, ob"}, {"id": 232, "start": 1870.4, "end": 1875.96, "text": "da noch irgendjemand dabei war, der gerade am Start ist. Wir haben ja mal eine Waage getestet"}, {"id": 233, "start": 1875.96, "end": 1893.84, "text": "im Stream. China-Plutus-Waage, genau. Ah, das war was anderes. Die CD-Key gehen übrigens"}, {"id": 234, "start": 1893.84, "end": 1903.12, "text": "nicht. Falls jetzt irgendjemand denkt, oh, hier, nice, CD-Key. Das sind Fake-CD-Key."}, {"id": 235, "start": 1903.12, "end": 1913.28, "text": "Das war was anderes. Da haben wir Zeug programmiert. Ist ja auch egal. Zumindest in dem Video mit"}, {"id": 236, "start": 1913.28, "end": 1916.2, "text": "der Waage, vielleicht erinnert sich der eine oder andere noch was, da hatte ich glaube"}, {"id": 237, "start": 1916.2, "end": 1923.56, "text": "ich 102 oder so. Also knapp, knapp, knapp über 100 rüber. Und seitdem ich da letztens"}, {"id": 238, "start": 1923.56, "end": 1929.76, "text": "mal eine meldepflichtige Krankheit hatte und ich will es jetzt nicht ausdehnen, aber die"}, {"id": 239, "start": 1929.76, "end": 1934.0, "text": "Leute, die öfters am Start sind, wissen es ja und es war kein Corona. Da habe ich insgesamt"}, {"id": 240, "start": 1934.0, "end": 1948.44, "text": "glaube ich fast 5 Kilo abgenommen. Gut, ich meine, da ging es ja auch rund. So, exzellent."}, {"id": 241, "start": 1948.44, "end": 1952.48, "text": "Gut, dass wir das jetzt nochmal geklärt haben. Gut, das mit Custom-Firmware und dem Roller"}, {"id": 242, "start": 1952.48, "end": 1960.16, "text": "lassen wir jetzt mal bleiben. Der Gamer Alex, nee, du darfst nicht. Du musst machen, wie"}, {"id": 243, "start": 1960.16, "end": 1964.88, "text": "ich es vorgeschlagen habe. Fährst du jetzt Fahrrad? Oder wenn du drunter bist, dann fährst"}, {"id": 244, "start": 1964.88, "end": 1970.4, "text": "du Roller. Sodass man immer quasi so genau an der Zulassungsgrenze ist. Exzellent oder"}, {"id": 245, "start": 1970.4, "end": 1979.16, "text": "an der anderen erlauben. Hast du einen Steam-Controller? Hab ich einen Steam-Controller? Ich überlege"}, {"id": 246, "start": 1979.16, "end": 1986.76, "text": "gerade, ob ich mir irgendwann sowas gekauft habe. Nee, nee, habe ich nicht, habe ich nicht."}, {"id": 247, "start": 1986.76, "end": 1990.6, "text": "Bei Aliexpress gibt es einen Rennrad für 170, zeige ich mal. Das muss ich mir angucken."}, {"id": 248, "start": 1990.6, "end": 1997.96, "text": "Okay, nee, ich mache das jetzt zu, sonst kaufe ich den Kram auch noch. Äh, Browser? Hallo?"}, {"id": 249, "start": 1997.96, "end": 2009.32, "text": "Ah, jetzt geht es okay. Ja. Gut, dann werden wir im nächsten Stream so einen Multisensor"}, {"id": 250, "start": 2009.32, "end": 2016.84, "text": "basteln mit Bewegungserkennung und Temperatur und Luftfeuchtigkeit und sonst was. Wohlgemerkt,"}, {"id": 251, "start": 2016.84, "end": 2023.32, "text": "aber erst, sobald UPS das mit der Beleuchtung geschafft hat. Wenn UPS mir dieses Elgato-Ringlicht"}, {"id": 252, "start": 2023.32, "end": 2027.96, "text": "bringt, dann machen wir Bastel-Stream wieder. Ach ja, und mir hat im Discord einer was richtig"}, {"id": 253, "start": 2027.96, "end": 2044.88, "text": "Nices geschickt und zwar GitHub OBS Ninja. Das kann ich verwenden, um meine Kamera besser"}, {"id": 254, "start": 2044.88, "end": 2049.88, "text": "in OBS reinzukriegen, ohne diese komische App verwenden zu müssen. Funktioniert ein"}, {"id": 255, "start": 2049.88, "end": 2056.28, "text": "bisschen wie meine Überwachungskamera-App. Nur, dass du den Browser auf dem Smartphone"}, {"id": 256, "start": 2056.28, "end": 2061.2, "text": "aufmachst und dann machst du den Browser auf dem Desktop auf und die bauen eine Low-Latency-Verbindung"}, {"id": 257, "start": 2061.2, "end": 2066.4, "text": "auf und dann machst du einfach in OBS den Browser als Source rein. Eigentlich ziemlich"}, {"id": 258, "start": 2066.4, "end": 2076.48, "text": "nice Idee. Können wir einen... Die Kombination aus Themen, das ist ja genau das Richtige"}, {"id": 259, "start": 2076.48, "end": 2083.0, "text": "für mich, ja. C++ zu Cobaltranspiler. Also erstens, keiner möchte irgendwie was programmieren,"}, {"id": 260, "start": 2083.0, "end": 2088.44, "text": "was C++... Ich weiß, dass es T-Bate ist, aber trotzdem ist ja was zu sagen. Erstens, keiner"}, {"id": 261, "start": 2088.44, "end": 2092.56, "text": "möchte irgendeinen Paser für C++ programmieren. Ich glaube, wenn irgendjemand wirklich in"}, {"id": 262, "start": 2092.56, "end": 2097.24, "text": "Auftrag bekommt, einen Paser für C++ zu programmieren, der stürzt sich lieber von der nächsten"}, {"id": 263, "start": 2097.24, "end": 2104.4, "text": "Brücke anstatt damit anzufangen. Ich glaube, C++ ist so eine Sprache. Mehr Ausnahmen und"}, {"id": 264, "start": 2104.4, "end": 2108.96, "text": "Dreck kannst du da nicht einbauen. Das geht nicht. Und dann auch noch zu Cobalt. Also"}, {"id": 265, "start": 2108.96, "end": 2124.32, "text": "das ist wirklich die Höchststrafe, ne. Jo. Was kostet eigentlich gerade? Leute, ihr merkt,"}, {"id": 266, "start": 2124.32, "end": 2128.32, "text": "ich hab heut nix geplant. Ich hab einfach mal angemacht, weil mir ist eine Sache aufgefallen,"}, {"id": 267, "start": 2128.32, "end": 2136.2, "text": "das muss ich jetzt mal, muss ich jetzt mal. Ups. Falsch ist die Mode. Chat. Moment. Mir"}, {"id": 268, "start": 2136.2, "end": 2141.64, "text": "ist was aufgefallen. Ich hab gestern da nicht gestreamt und am Sonntag auch nur kurz, weil"}, {"id": 269, "start": 2141.64, "end": 2146.56, "text": "ich Steuererklärungen fertig machen wollte. Mir ist aufgefallen, dass ich bin das mittlerweile"}, {"id": 270, "start": 2146.56, "end": 2151.08, "text": "so dran gewöhnt, jeden Tag oder jeden zweiten Tag zu streamen. Mir hat echt heute was gefehlt,"}, {"id": 271, "start": 2151.08, "end": 2154.04, "text": "hab ich mir gedacht, ich hab jetzt den ganzen Tag und gestern auch nicht. Ich mach jetzt"}, {"id": 272, "start": 2154.04, "end": 2162.36, "text": "einfach mal streamen an. Ja. Exzellent. Viva Breaker. Twitch Prime. Dankeschön für den"}, {"id": 273, "start": 2162.36, "end": 2173.88, "text": "Sub. Vorausgeschaut. Exzellent. Ja, dafür hab ich die auch vor einem Jahr oder so gekauft."}, {"id": 274, "start": 2173.88, "end": 2185.76, "text": "Mal gucken, ob die billiger geworden sind. 14 TB. Sag mal, sind die alle ausverkauft?"}, {"id": 275, "start": 2185.76, "end": 2200.52, "text": "Gibt's da auch welche mit nur 4000 Umdrehungen? Die sind leiser. Ok, kosten auch genau das"}, {"id": 276, "start": 2200.52, "end": 2210.52, "text": "gleiche wie vor einem Jahr. Ja, und eine 4 TB SSD möchte ich mir auch gern kaufen. Gibt's"}, {"id": 277, "start": 2210.52, "end": 2220.72, "text": "aber nicht. Weil Samsung sich denkt, warum sollen wir eine 4 TB, also NVMe. Also eine"}, {"id": 278, "start": 2220.72, "end": 2243.16, "text": "NVMe, ne? Äh, nein. Ah, das ist ein Schnapper. Der ist sofort... Moment, wann ist das lieferbar?"}, {"id": 279, "start": 2243.16, "end": 2259.44, "text": "Dezember bis 25. Februar? Löten die das in China direkt für mich zusammen oder was?"}, {"id": 280, "start": 2259.44, "end": 2268.64, "text": "Paints Champ, ey. Das... Oh Gott. Also ich versteh's ja, wenn man ne Grafikkarte kauft"}, {"id": 281, "start": 2268.64, "end": 2272.84, "text": "mit irgendeinem Spielebundle. Oder ich versteh's auch, wenn man Gears of War Fan ist und kauft"}, {"id": 282, "start": 2272.84, "end": 2279.2, "text": "sich ne Xbox im Gears of War Look. Aber warum brauch ich denn um alles in der Welt ne NVMe"}, {"id": 283, "start": 2279.2, "end": 2286.92, "text": "SSD, die irgendwo am besten noch hinter dem Mainboard rumgammelt, eingebaut, mit dem Call"}, {"id": 284, "start": 2286.92, "end": 2295.0, "text": "of Duty Logo? Das ist die verschwendetste Promotion-Dingsgedöns und Sache aller Zeiten."}, {"id": 285, "start": 2295.0, "end": 2303.16, "text": "Ja, aber die Cosa will ich mir nicht kaufen. Ich warte schon seit Ewigkeiten auf ne 4 TB"}, {"id": 286, "start": 2303.16, "end": 2310.68, "text": "Samsung Evo oder sowas. Gibt's aber nicht. Es gibt Zata. Ist ja schön und gut, wenn"}, {"id": 287, "start": 2310.68, "end": 2322.44, "text": "es Zata gibt, aber ich hätt gerne NVMe. Ja, die können ja mein wenigstens fette Kühler"}, {"id": 288, "start": 2322.44, "end": 2335.2, "text": "drauf machen und mich nicht. Ja, die Sache ist, ich glaube gar nicht mal, dass die Cosa"}, {"id": 289, "start": 2335.2, "end": 2341.56, "text": "schlecht ist, aber ich hab halt bisher immer wirklich gute Erfahrungen mit Samsung gemacht,"}, {"id": 290, "start": 2341.56, "end": 2344.72, "text": "deswegen wollte ich mir eigentlich auch von denen eine kaufen. Letztendlich muss man aber"}, {"id": 291, "start": 2344.72, "end": 2350.44, "text": "auch mal ehrlich sein, es lohnt sich überhaupt nicht ne 4 TB SSD zu kaufen, rein preisleistungsmäßig."}, {"id": 292, "start": 2350.44, "end": 2362.28, "text": "Du kannst dir für weniger als die Hälfte 2x2 TB kaufen, wenn du das wirklich willst,"}, {"id": 293, "start": 2362.28, "end": 2370.08, "text": "und preisleistungsmäßig lohnt sich das überhaupt nicht. Was uns aber ja oftmals nicht davon"}, {"id": 294, "start": 2370.08, "end": 2385.84, "text": "abhält. Ja, Battlefield können wir wieder dazu machen. Wie gesagt, ich hab gegen Cosa"}, {"id": 295, "start": 2385.84, "end": 2391.68, "text": "nix. Ich hatte nur noch nie eine und ich bin wirklich richtig zufrieden mit Samsung SSDs."}, {"id": 296, "start": 2391.68, "end": 2396.64, "text": "Ich hatte noch nicht eine Samsung SSD, die mir verreckt ist bisher. Wisst ihr was die"}, {"id": 297, "start": 2396.64, "end": 2404.56, "text": "einzige SSD ist? Kein Witz jetzt. Die einzige SSD, die mir bisher verreckt ist, also ich"}, {"id": 298, "start": 2404.56, "end": 2410.28, "text": "hatte ja schon alle möglichen Sachen. Ich hatte billigste 32G SSDs, ich hatte damals"}, {"id": 299, "start": 2410.28, "end": 2415.08, "text": "zu Release für irgendwie 700€ eine 2 TB Samsung SSD gekauft, ich hatte alle möglichen"}, {"id": 300, "start": 2415.08, "end": 2423.96, "text": "SSDs. So, und die einzige SSD, die mir verreckt ist, ist eine Enterprise Intel SSD für Server,"}, {"id": 301, "start": 2423.96, "end": 2430.64, "text": "die war auch eine kleinere, also die ist auch schon ein bisschen älter gewesen. Ja, gut,"}, {"id": 302, "start": 2430.64, "end": 2434.0, "text": "ich hab ehrlich gesagt keine Ahnung was das für eine war, aber die war klein. Frag mich"}, {"id": 303, "start": 2434.0, "end": 2444.28, "text": "nicht, die war, die war als Hochkom 128G oder sowas. Ja, ja, Valentin war richtig. Das"}, {"id": 304, "start": 2444.28, "end": 2448.96, "text": "einzige was mir bisher, das war so ein Silberner, sowas hier in der Richtung. Ne, ne, ne, nur"}, {"id": 305, "start": 2448.96, "end": 2453.28, "text": "noch mit Intel Logo drauf, aber kein Metall, kein Metallgehäuse, sowas hier in der Richtung"}, {"id": 306, "start": 2453.28, "end": 2464.68, "text": "war das, genau. So. Und eigentlich witzig, ne, dass das einzige was mir verreckt ist,"}, {"id": 307, "start": 2464.68, "end": 2471.72, "text": "ist irgend so ein teures Business Server Ding. Und was noch viel schlimmer ist, wisst ihr"}, {"id": 308, "start": 2471.72, "end": 2479.68, "text": "was, ja das wisst ihr, das hab ich euch ja schon oft genug gesagt. Wisst ihr was das"}, {"id": 309, "start": 2479.68, "end": 2484.12, "text": "einzige ist, was mir bisher in meinem ganzen Server Rack verreckt ist? Ich weiß, der Chat"}, {"id": 310, "start": 2484.12, "end": 2487.32, "text": "weiß es aber, vielleicht sind ein paar Leute neu da, die es nicht wissen. Das einzige was"}, {"id": 311, "start": 2487.32, "end": 2493.52, "text": "hier drin verreckt ist, ist die, ist die, ähm, USB. Nichts anderes. Und ich hab mir die USB"}, {"id": 312, "start": 2493.52, "end": 2500.92, "text": "ja gekauft, gerade um dafür zu sorgen, dass das andere nicht verreckt. Und das einzige"}, {"id": 313, "start": 2500.92, "end": 2511.0, "text": "was mir verreckt ist, ist die USB. Und so genau kann man das natürlich nicht sagen, weil"}, {"id": 314, "start": 2511.0, "end": 2516.48, "text": "vielleicht hat er die USB schon dafür gesorgt, dass manche Sachen nicht ausfallen und dementsprechend"}, {"id": 315, "start": 2516.48, "end": 2521.6, "text": "hätte ich anderweitig einen Ausfall gehabt, ja. Aber so wirklich einmal komplett Rack"}, {"id": 316, "start": 2521.6, "end": 2527.32, "text": "aus, war nur als die USB verreckt ist. Wahrscheinlich sind die Batterien weg oder so. Jetzt betreibe"}, {"id": 317, "start": 2527.32, "end": 2540.28, "text": "ich es ohne USB. Naja. Übrigens voll beliebt das Video, ne? Vielleicht soll ich da mal"}, {"id": 318, "start": 2540.28, "end": 2544.32, "text": "ein Update machen, das dumme ist, da gibt es kein Update für. Das sieht noch genauso"}, {"id": 319, "start": 2544.32, "end": 2549.08, "text": "aus, der einzige Unterschied ist, dass ich die Kiste hier nicht mehr in Betrieb hab und"}, {"id": 320, "start": 2549.08, "end": 2553.08, "text": "diesen Access Point nicht mehr verwende. Aber ansonsten gibt es da eigentlich nix. Ich glaub"}, {"id": 321, "start": 2553.08, "end": 2555.96, "text": "sogar noch der Track, den ich hier im Video in der Ecke liegen hat, liegt glaub ich immer"}, {"id": 322, "start": 2555.96, "end": 2567.2, "text": "noch in der Ecke. Ähm. Egal, mach. Batterien sollten wir alle zwei Jahre tauschen, ja hast"}, {"id": 323, "start": 2567.2, "end": 2576.4, "text": "du recht, aber... Warum tauschen, wenn sie noch geht, ne? Übrigens das letzte Video"}, {"id": 324, "start": 2576.4, "end": 2580.4, "text": "hier, ne? Das hat jetzt zwar insgesamt, ich mein das ist jetzt nix was ich sonst so auf"}, {"id": 325, "start": 2580.4, "end": 2583.64, "text": "den Channel mache, ne? Das hat jetzt zwar insgesamt nicht so wahnsinnig viele Views"}, {"id": 326, "start": 2583.64, "end": 2588.6, "text": "oder irgendwas in der Richtung, aber wisst ihr was bei dem Video wirklich gut ist? Die"}, {"id": 327, "start": 2588.6, "end": 2596.64, "text": "Viewtime. Die Leute haben, normalerweise gucken die nie so lange. 90% haben das Video, ne"}, {"id": 328, "start": 2596.64, "end": 2601.92, "text": "Schwachsinn, stimmt nicht. Im Durchschnitt gucken sich 90%, es wird sich 90% des Videos"}, {"id": 329, "start": 2601.92, "end": 2611.56, "text": "angeguckt. Normalerweise gucken die Leute so, frag mich nicht. 60, 70% oder so von dem"}, {"id": 330, "start": 2611.56, "end": 2626.16, "text": "Video. Also das ist schon Pock. Du hast das Video viermal geschaut, exellent. Nice. Ja,"}, {"id": 331, "start": 2626.16, "end": 2633.92, "text": "also was ich ja gut finden würde, wenn der YouTube Algorithmus das dann irgendwann checkt,"}, {"id": 332, "start": 2633.92, "end": 2638.08, "text": "vielleicht promoten die das ja mal ein bisschen. So nach dem Motto, oh Video mit sehr hoher"}, {"id": 333, "start": 2638.08, "end": 2646.68, "text": "Viewtime, wir zeigen das mal zumindest irgendwo ein bisschen so rum. Naja, auf jeden Fall"}, {"id": 334, "start": 2646.68, "end": 2667.6, "text": "nice. Ja Leute, so siehts aus. Wammeln jetzt? Max up in die Trends, so muss das sein."}, {"id": 335, "start": 2667.6, "end": 2677.76, "text": "Stonks, Alter. Habt ihr eigentlich mitbekommen, dass Pornhub 80% seiner Videos gelöscht hat?"}, {"id": 336, "start": 2677.76, "end": 2683.04, "text": "Weiß gar nicht ob heiße was dazu geschrieben hat. Habt ihr was zu Pornhub geschrieben?"}, {"id": 337, "start": 2683.04, "end": 2712.12, "text": "Habt ihr es mitgekriegt? Ja. Kein Toss, man sieht ja nix. 80% der Videos gelöscht. Also"}, {"id": 338, "start": 2712.12, "end": 2717.64, "text": "da sieht man, hätte Pornhub mal ein bisschen genauer den Content kontrolliert, den die"}, {"id": 339, "start": 2717.64, "end": 2724.16, "text": "so hochladen, hätten sie das Problem nicht gehabt. Das Problem dahinter war nämlich,"}, {"id": 340, "start": 2724.16, "end": 2728.32, "text": "das Problem hier hinter war nämlich, dass die, nee ich mach das jetzt nicht aus, man"}, {"id": 341, "start": 2728.32, "end": 2732.28, "text": "weiß ja nicht ob da vielleicht irgendwie was Toss ist. Das Problem war nämlich, dass Leute"}, {"id": 342, "start": 2732.28, "end": 2738.4, "text": "auf Pornhub irgendwelche Kinderporn und Dinge hochgeladen haben, irgendwelche Vergewaltigungsvideos"}, {"id": 343, "start": 2738.4, "end": 2742.76, "text": "und Pornhub hat es nicht geschafft das zu kontrollieren und das schlimmste war, dass"}, {"id": 344, "start": 2742.76, "end": 2747.68, "text": "manches dieser Videos sogar monetarisiert waren. Also ihr überlegt euch mal, ja, irgendeiner"}, {"id": 345, "start": 2747.68, "end": 2755.48, "text": "legt illegalen Porn hoch auf Pornhub und Pornhub monetarisiert das automatisch und das heißt,"}, {"id": 346, "start": 2755.48, "end": 2761.48, "text": "die haben da so krass gefailed, dass sie das nicht gecheckt haben und kontrolliert haben,"}, {"id": 347, "start": 2761.48, "end": 2768.48, "text": "dass es ihnen im Endeffekt jetzt auch irgendwie zurecht passiert, ja, aber die haben sich jetzt"}, {"id": 348, "start": 2768.48, "end": 2777.12, "text": "halt überlegt, weil sie auch von Mastercard und Visa geplockt wurden, also was geplockt,"}, {"id": 349, "start": 2777.12, "end": 2783.84, "text": "entgekickt oder entpartnert oder was auch immer und jetzt ist dir nichts anderes eingefallen"}, {"id": 350, "start": 2783.84, "end": 2787.92, "text": "wie 80% ihrer Videos zu lesen und das machen die bestimmt nicht einfach so aus Spaß an"}, {"id": 351, "start": 2787.92, "end": 2791.84, "text": "Freude, die haben das bestimmt abgewogen, die haben gesagt, hey, jetzt alle Videos zu"}, {"id": 352, "start": 2791.84, "end": 2801.6, "text": "kontrollieren ist aufwendiger als einfach alle 80% zu löschen. Auf der anderen Seite"}, {"id": 353, "start": 2801.6, "end": 2809.6, "text": "ist es nicht wirklich schlimm, weil es ist das Internet, also sprich, wenn jetzt irgendwie"}, {"id": 354, "start": 2809.6, "end": 2815.84, "text": "einer da Videos hatte, die er gerne geguckt hat und die gibt es da jetzt nicht mehr, da"}, {"id": 355, "start": 2815.84, "end": 2821.64, "text": "kann man sich im Internet ziemlich sicher sein, dass die jetzt woanders landen. Ja leider"}, {"id": 356, "start": 2821.64, "end": 2824.28, "text": "auch die Videos, um die es ursprünglich ging, die sind wahrscheinlich auch mittlerweile"}, {"id": 357, "start": 2824.28, "end": 2829.48, "text": "irgendwo anders, so ist das halt im Internet, ja. Einmal irgendwo was hochgeladenes kriegst"}, {"id": 358, "start": 2829.48, "end": 2837.52, "text": "du nie wieder raus. Passt nicht zum Thema, aber bei mir geht die Klammer nicht. Äh,"}, {"id": 359, "start": 2837.52, "end": 2848.76, "text": "hast du vielleicht englische Tastatur eingestellt? By the way, schau dir mal den Aruba, ein was"}, {"id": 360, "start": 2848.76, "end": 2858.92, "text": "für ein Ding, Moment, das muss ich mir jetzt machen. Aruba 24G 4S, oh mit SFP, das ist"}, {"id": 361, "start": 2858.92, "end": 2870.16, "text": "ja hier richtig. 4SFP, ok ich suche einfach nach JL3-Dings, hast du nicht gesehen. By"}, {"id": 362, "start": 2870.16, "end": 2885.08, "text": "HP. Ok, was haben wir denn da, zeig mal her. Kost, ist das so ein Ding, was man sich gebraucht"}, {"id": 363, "start": 2885.08, "end": 2903.84, "text": "kaufen muss, weil zu teuer. Ist schon recht teuer, ah Moment, das geht ja. Das ist gar"}, {"id": 364, "start": 2903.84, "end": 2917.88, "text": "nicht teuer. Das ist echt gut, 180€, ey das ist echt gut, so das muss ich mir jetzt mal"}, {"id": 365, "start": 2917.88, "end": 2927.48, "text": "ein bisschen genauer angucken, exzellent. Das muss ich mir jetzt mal ein bisschen genauer"}, {"id": 366, "start": 2927.48, "end": 2932.6, "text": "angucken, also was haben wir denn da am Start. Also wir gucken uns erstmal, wir gucken uns"}, {"id": 367, "start": 2932.6, "end": 2935.24, "text": "zwar das wichtigste, was man sich bei einem Switch immer angucken muss, erstmal ein Bild"}, {"id": 368, "start": 2935.24, "end": 2948.72, "text": "von. So, also wir haben 24 Ports, was 24, komische Gruppierung oder, 12 und 12, normalerweise"}, {"id": 369, "start": 2948.72, "end": 2960.88, "text": "machen die ja immer 8, 8, 8 oder so, 12, ok. Also 2x12 Ports und SFP+, 4 Stück, 4SFP"}, {"id": 370, "start": 2960.88, "end": 2968.64, "text": "24G und das für 170, 180 und das ist wirklich gut, das ist wirklich gut. So, jetzt müssen"}, {"id": 371, "start": 2968.64, "end": 2975.88, "text": "wir uns einfach mal die Specs ein bisschen genauer angucken, also. Wie managet man den,"}, {"id": 372, "start": 2975.88, "end": 2982.8, "text": "ist das irgendwelche special HP CLI Geschichten, die man dafür braucht oder haben die auch"}, {"id": 373, "start": 2982.8, "end": 2996.12, "text": "ein halbwegs brauchbares Webinterface wie MikroTik. 1906, 90er CLI, ja die Befürchtung"}, {"id": 374, "start": 2996.12, "end": 3003.32, "text": "habe ich auch. Ok, also 7 fortschrittliche, hä, ist bestimmt nicht 7 Switche drin, was"}, {"id": 375, "start": 3003.32, "end": 3011.64, "text": "wollt ihr, was möchte mir HP damit sagen. Option über die lokale WebUI, das ist doch"}, {"id": 376, "start": 3011.64, "end": 3018.88, "text": "schon mal gut. Ich finde das cool, dass die mittlerweile dabei schreiben, lokale WebUI,"}, {"id": 377, "start": 3018.88, "end": 3024.48, "text": "so nach dem Motto, ok, ich brauch keine komische Cloud-Lösung von HP. Also Spezifikation zeig"}, {"id": 378, "start": 3024.48, "end": 3034.4, "text": "ich mal her, was haben wir denn da. Das ist vollkommen in Ordnung, also durchschnittlich"}, {"id": 379, "start": 3034.4, "end": 3041.52, "text": "wird das, also im Heimgebrauch, ja wenn man da nicht viele Ports benutzt, da wird das eher"}, {"id": 380, "start": 3041.52, "end": 3046.64, "text": "in dieser Richtung sein, um die 10 Watt nicht so wie das. Kann der PoE, nee oder PoE ist"}, {"id": 381, "start": 3046.64, "end": 3051.0, "text": "da nicht auch noch mit dabei, das wird mich jetzt auch sehr wundern, weil dann kommt nämlich"}, {"id": 382, "start": 3051.0, "end": 3063.64, "text": "die 22,6 Watt überhaupt nicht hin, maximal. Ok, Eingangsspannung, blablabla, Switching"}, {"id": 383, "start": 3063.64, "end": 3070.32, "text": "Leistung, 128 GB, ich hab jetzt keinen Vergleich zu den gleichen Mikrotik-Dingern, aber das"}, {"id": 384, "start": 3070.32, "end": 3081.8, "text": "erscheint mir erstmal absolut in Ordnung. Das sind Packets, oder? Oder was sind MPPS?"}, {"id": 385, "start": 3081.8, "end": 3090.72, "text": "Aber was interessieren mich überhaupt Packets auf dem Switch? Alter, was tut das, ist das"}, {"id": 386, "start": 3090.72, "end": 3097.48, "text": "immer noch Journey-Soundtrack? Ja, das ist immer noch Journey-Soundtrack, exellent. Der"}, {"id": 387, "start": 3097.48, "end": 3105.12, "text": "ist wirklich super entspannt, ne. So, der hat auch keinen, wenn ich das richtig verstanden"}, {"id": 388, "start": 3105.12, "end": 3110.96, "text": "hab, der hat auch keinen Lüfter, was auch schon ziemlich cool ist. Was stellt Twitch"}, {"id": 389, "start": 3110.96, "end": 3125.4, "text": "gerade an, echt? Zeig mal her. Oh. Ah Leute, gut, dass ihr, nicht Refreshed, Refreshed bloß"}, {"id": 390, "start": 3125.4, "end": 3138.76, "text": "den Stream nicht. Wenn ihr den Stream Refreshed, ist alles kaputt. Oder auch nicht. Nicht Refreshen,"}, {"id": 391, "start": 3138.76, "end": 3152.4, "text": "ne, aber das, finde ich, sieht ganz gut aus. Okay, zeig mal was. Was wird man auf Amazon"}, {"id": 392, "start": 3152.4, "end": 3159.52, "text": "dafür bezahlen? 200, ja. Das ist echt gut, das gefällt mir, das Teil. Also, ich mein,"}, {"id": 393, "start": 3159.52, "end": 3165.84, "text": "ich brauch's nicht, aber, aber, ja, warum nicht, ja. Ein bisschen. Ich würd allerdings"}, {"id": 394, "start": 3165.84, "end": 3175.12, "text": "immer noch sagen, wenn man was kleines braucht, äh, wenn man was kleines braucht, dann sollte"}, {"id": 395, "start": 3175.12, "end": 3182.08, "text": "man sich den hier holen. Ach, was interessieren mich statische Routen und Gedöns aufm Switch,"}, {"id": 396, "start": 3182.08, "end": 3192.04, "text": "die Switcher aufm Switch. Ja, also wenn man was kleines braucht, sollte man sich den holen,"}, {"id": 397, "start": 3192.04, "end": 3196.76, "text": "die gibt's auch um die 100 Euro, aber für alles ein bisschen größere, ist das wirklich"}, {"id": 398, "start": 3196.76, "end": 3201.92, "text": "eine gute Sache, das ist halt, das gefällt mir, also, bookmark ich mir mal, kann bestimmt"}, {"id": 399, "start": 3201.92, "end": 3215.0, "text": "mal gebrauchen. Aber was hört man noch? Oh, jawoll, der muss jetzt. Der Bible Thump Soundtrack"}, {"id": 400, "start": 3215.0, "end": 3231.12, "text": "schlechthin. Wobei, das ist mir zu Bible Thump Soundtrack. Ah, yes. Halo Soundtrack, ich muss"}, {"id": 401, "start": 3231.12, "end": 3236.68, "text": "euch sagen, ich bin kein großartiger Halo Fan. Ja, steigt mich, aber, äh, der Halo"}, {"id": 402, "start": 3236.68, "end": 3242.08, "text": "Soundtrack ist poggers. Der ist massive poggers. Eigentlich der Halo Soundtrack ist best am"}, {"id": 403, "start": 3242.08, "end": 3260.56, "text": "ganzen Spiel. Junge, deine Taskbar. Hä? Was gegen die Taskbar einzuwenden? Also wenn"}, {"id": 404, "start": 3260.56, "end": 3265.16, "text": "man jetzt was gegen den Desktop sagt, das kann ich ja noch verstehen, aber was ist an"}, {"id": 405, "start": 3265.16, "end": 3272.24, "text": "der Taskbar das Problem? Äh, warum nutzt du Ubuntu für deine Server und nicht Debian?"}, {"id": 406, "start": 3272.24, "end": 3288.68, "text": "Äh, Gewöhnung. Tymta ist, wat? Warum hab ich da Cortana drauf? Das ist ne gute Frage,"}, {"id": 407, "start": 3288.68, "end": 3299.8, "text": "wo kommt der Cortana her? Hatte ich das schon immer auf dem Desktop Cortana? Wo wir grad"}, {"id": 408, "start": 3299.8, "end": 3316.88, "text": "bei Halo sind? Bäm. Cento ist Ding mit IBM schon besprochen. Ja, da haben wir uns letztens"}, {"id": 409, "start": 3316.88, "end": 3324.04, "text": "mal kurzzeitig drüber ausgelassen. Ähm, ist halt Fail. Aber mal gucken, wie das mit"}, {"id": 410, "start": 3324.04, "end": 3331.56, "text": "diesem Alternativprojekt da wird. Kennst du schon den Microsoft Cortana Fail? Ne. Du"}, {"id": 411, "start": 3331.56, "end": 3337.92, "text": "meinst jetzt Cortana an sich oder was? Ne, also, ich, gibt's jetzt mal ernst gemeinte"}, {"id": 412, "start": 3337.92, "end": 3343.32, "text": "Frage Chat. Gibt's jemand von euch, der wirklich Cortana verwendet? Das erste, was ich unter"}, {"id": 413, "start": 3343.32, "end": 3356.48, "text": "Windows zumindest immer ausblende, ist Cortana. Ich verwende ja auch generell keine Voice"}, {"id": 414, "start": 3356.48, "end": 3360.28, "text": "Assistance. Das einzige, was ich mir gefallen lasse, ist, wenn man irgendwie im Auto vielleicht"}, {"id": 415, "start": 3360.28, "end": 3375.04, "text": "ne Voice Assistance verwendet, aber, ähm, ja, ähm, zumindest, ich benutze auch sonst"}, {"id": 416, "start": 3375.04, "end": 3385.68, "text": "keine Voice Assistance, aber ich bin der Ansicht, dass wenn man alles so mal gegeneinander mal"}, {"id": 417, "start": 3385.68, "end": 3390.96, "text": "so vergleicht, also sprich, du hast Google Assistant, du hast Cortana, du hast Siri,"}, {"id": 418, "start": 3390.96, "end": 3396.72, "text": "du hast Alexa, dann bin ich der Meinung, von allem dem, was ich so mitbekomme aktuell,"}, {"id": 419, "start": 3396.72, "end": 3400.48, "text": "auch als jemand, der es nicht benutzt und dementsprechend keine Sache irgendwie besonders"}, {"id": 420, "start": 3400.48, "end": 3408.56, "text": "bevorzugt, ich denke, dass Alexa aktuell das bessere System ist als die restlichen. Auf"}, {"id": 421, "start": 3408.56, "end": 3412.96, "text": "Platz zwei kann ich schlecht einschätzen. Ich, ich hab den Eindruck, als wäre Google"}, {"id": 422, "start": 3412.96, "end": 3417.56, "text": "mit Google Assistant ein bisschen abgehängt bei der ganzen Geschichte. Das kann ich jetzt"}, {"id": 423, "start": 3417.56, "end": 3422.36, "text": "aber echt schwer sagen, weil ich es halt nicht selbst benutze. Ähm, mir kommt es so"}, {"id": 424, "start": 3422.36, "end": 3427.32, "text": "vor, als jemand, der es halt einfach nur beobachtet, als ist Alexa vom Können, vom Ökosystem"}, {"id": 425, "start": 3427.32, "end": 3437.64, "text": "und den zusätzlichen Modulen, die es gibt, das Beste. Dann, äh, zweiter Platz, tja,"}, {"id": 426, "start": 3437.64, "end": 3440.32, "text": "kann ich, wie gesagt, kann ich schlecht sagen. Ich würde mal eher auf Siri tippen, wenn"}, {"id": 427, "start": 3440.32, "end": 3448.52, "text": "man eben in Apple unterwegs ist. Ähm, aber ansonsten ist ja egal, weil zweiter Platz"}, {"id": 428, "start": 3448.52, "end": 3453.52, "text": "ist dann Siri oder Google Assistant, je nachdem, was man verwendet. Und letzter Platz dürfte"}, {"id": 429, "start": 3453.52, "end": 3467.52, "text": "da wohl eindeutig an Cortana gehen, ne? Geh mal in Setting Apps, Cortana. Ja, mich wundert's"}, {"id": 430, "start": 3467.52, "end": 3480.64, "text": "eigentlich, dass du, äh, dass, dass, Apps. Das da? Nee. Dieser Windows. Wie man findet"}, {"id": 431, "start": 3480.64, "end": 3493.48, "text": "dazu Cortana. Was? Gibt's nicht. Guck mal. 0W. Kann man nicht deaktivieren, es, es, äh,"}, {"id": 432, "start": 3493.48, "end": 3499.6, "text": "ist nicht gebaidet. Der Desktop, den, den habe ich ja nur für den Stream so. Was wir"}, {"id": 433, "start": 3499.6, "end": 3514.24, "text": "heute machen, ja, es ist ja heute kein Stream, also machen wir im Stream auch nix. Gibt's"}, {"id": 434, "start": 3514.24, "end": 3522.52, "text": "eigentlich noch, noch das alte? Ja. Es wird aber weniger. Also, Microsoft kann ja, kann"}, {"id": 435, "start": 3522.52, "end": 3528.96, "text": "ja machen, was sie wollen und die werden definitiv nicht drauf hören, was ich sage. Aber, sagt"}, {"id": 436, "start": 3528.96, "end": 3538.48, "text": "was ihr wollt, Leute. Die alte Systemsteuerung hatte irgendwie eine sinnigere Struktur und"}, {"id": 437, "start": 3538.48, "end": 3545.48, "text": "mehr Optionen als die neue. Ich mein, allein schon, dass man keine Bildwiederholrate einstellen"}, {"id": 438, "start": 3545.48, "end": 3549.8, "text": "konnte bis zu Windows Update und dass man keine Maus Sensitivity richtig einstellen"}, {"id": 439, "start": 3549.8, "end": 3556.64, "text": "konnte bis zum vorletzten Update. Sagt ja wohl alles, oder? Das ist hier, guck mal,"}, {"id": 440, "start": 3556.64, "end": 3562.88, "text": "das ist ganz neu hier. Äh, ich weiß gar nicht, wo es ist, ehrlich gesagt. System. Display."}, {"id": 441, "start": 3562.88, "end": 3573.2, "text": "Advanced. Genau, das hier. Das ist ganz neu. Das gab's letzte Windows Version noch nicht."}, {"id": 442, "start": 3573.2, "end": 3580.4, "text": "Und Windows ist hier auch super korrekt. Es sind 239,760 Hertz. Ah ja, alles klar. Früher"}, {"id": 443, "start": 3580.4, "end": 3588.16, "text": "musste man hier drüber gehen. Äh, oh, oh, oh. Oh, was ist das? Jetzt bin ich ja schon"}, {"id": 444, "start": 3588.16, "end": 3602.44, "text": "wieder. Nee, Display Settings. Advanced Settings. Display Adapter. So. Warum sind das eigentlich"}, {"id": 445, "start": 3602.44, "end": 3610.44, "text": "da? Da wird aufgerundet, oder was? Man kann das auch, ja ja, man kann das auch über die"}, {"id": 446, "start": 3610.44, "end": 3618.0, "text": "Grafikkartensettings einstellen, natürlich, ne? Aber ich mein, jetzt mal ernsthaft. Also,"}, {"id": 447, "start": 3618.0, "end": 3622.32, "text": "Settings für die Bildwiederholrate, das konnte Windows 1 wahrscheinlich schon."}, {"id": 448, "start": 3622.32, "end": 3641.6, "text": "Das ist der Halo Reach Soundtrack, ja. Der Sebaro hat irgendwas gefragt, seh ich ja jetzt"}, {"id": 449, "start": 3641.6, "end": 3651.12, "text": "erst. Wo ist er? Wo ist der Cute Mod? Äh, ja. Kannst du mir Folgendes erklären? Als"}, {"id": 450, "start": 3651.12, "end": 3659.4, "text": "nicht voll beschäftigt der Mitarbeiter mit 15,38 vom 100, was? Der regelmäßig eines"}, {"id": 451, "start": 3659.4, "end": 3667.96, "text": "voll beschäftigen auf bestimmte, äh, was? Sebaro, ich hab keine Ahnung, was, was das"}, {"id": 452, "start": 3667.96, "end": 3682.36, "text": "mir sagen soll. Das steh ich nicht. Was? Das ist ein Auszug aus irgendwas, ne, das versteh"}, {"id": 453, "start": 3682.36, "end": 3686.36, "text": "ich auch nicht. Das hat sich, das haben sich irgendwelche Super-Stonks-Männer ausgedacht,"}, {"id": 454, "start": 3686.36, "end": 3697.4, "text": "das ist nicht dafür gemacht, dass man's versteht. Was ist der was zum Teufel schon wieder TVL,"}, {"id": 455, "start": 3697.4, "end": 3709.32, "text": "ne? Du bist was? Pädagogischer Pandemie? Was für ein Ding bist du? Was du? Ich wusste"}, {"id": 456, "start": 3709.32, "end": 3724.56, "text": "gar nicht mal, dass es das überhaupt gibt. Und was macht man da? Pädagogischer Pandemie-Hilfe,"}, {"id": 457, "start": 3724.56, "end": 3738.0, "text": "alles klar, okay. Du betreust Klassen im Hybrid-Unterricht. Hoffentlich sind da Physik-Grills dabei, Sebaro,"}, {"id": 458, "start": 3738.0, "end": 3748.2, "text": "ne? Und mache nebenbei noch IT-Support, oh je. Das ist eine tolle Kombination."}, {"id": 459, "start": 3748.2, "end": 3766.28, "text": "Das ist Monkathos. Ach so, äh, Sebaro, vielleicht hab ich's falsch verstanden. Ich dachte du"}, {"id": 460, "start": 3766.28, "end": 3775.2, "text": "redest vor Leuten, die studieren. Wie alt sind die Klassen, die du betreust? Dann ist"}, {"id": 461, "start": 3775.2, "end": 3784.52, "text": "das wahrscheinlich wirklich Monkathos, ja. Fünfte, ach du Scheiße, ich hab nix gesagt."}, {"id": 462, "start": 3784.52, "end": 3802.52, "text": "Monkathos, ich hab nix gesagt, Sebaro. Richtig Toss. Äh, da kommt der Pädobär. Mach den"}, {"id": 463, "start": 3802.52, "end": 3808.4, "text": "Streben dicht. Äh, hättest du Interesse in den Vertreibern anzuschauen? Sebaro, ich"}, {"id": 464, "start": 3808.4, "end": 3811.36, "text": "glaub ich kann dazu überhaupt nix sagen. Also ich kann mir das gern anschauen, wenn"}, {"id": 465, "start": 3811.36, "end": 3819.36, "text": "du meinst, äh, das bringt dir irgendwas, ja, aber ich bin bei sowas nicht der große Kenner,"}, {"id": 466, "start": 3819.36, "end": 3837.36, "text": "ja. Matchvideos hab ich glaub ich letztens schon gelesen, kommt mir irgendwie bekannt"}, {"id": 467, "start": 3837.36, "end": 3850.8, "text": "vor. Muss mal kurz chat gucken, ob ich irgendwas übersehen hab. Übrigens, wisst ihr was"}, {"id": 468, "start": 3850.8, "end": 3857.4, "text": "auch geil ist, falls der Flo690 grad schreibt, was auch mega fail ist, ähm, wenn man Settings"}, {"id": 469, "start": 3857.4, "end": 3862.44, "text": "in Windows machen will, was Audio angeht, was Audio angeht, da musste da drauf klicken,"}, {"id": 470, "start": 3862.44, "end": 3867.64, "text": "Moment, warum aber, da musste erst mal da drauf klicken, dann musste, nee Moment, Moment,"}, {"id": 471, "start": 3867.64, "end": 3872.08, "text": "da musste da drauf klicken, da musste sagen Open Sound Settings, da musste das Sound Control"}, {"id": 472, "start": 3872.08, "end": 3878.24, "text": "Panel aufmachen, dann kriegste diese Sache aus Windows 95, ähm, und dann gehst du hier"}, {"id": 473, "start": 3878.24, "end": 3884.2, "text": "zum Beispiel aufs Mikrofon und kannst dann hier auf Levels einstellen. Also, gut, ich"}, {"id": 474, "start": 3884.2, "end": 3888.68, "text": "mein du kannst hier unten sicherlich auch, aber ey. Und das Schlimmste ist, was ich manchmal"}, {"id": 475, "start": 3888.68, "end": 3894.0, "text": "brauche ist, dass ich Supported Formats umstelle, weil mein Audio Interface manchmal rumspackt"}, {"id": 476, "start": 3894.0, "end": 3898.8, "text": "und sich umstellt auf 44 Hertz, auf 44 Kilohertz, obwohl es eigentlich auf 48 Kilohertz stehen"}, {"id": 477, "start": 3898.8, "end": 3903.24, "text": "müsste. Und das krieg ich dann mit, nur wenn es ein bisschen komisch rauscht. Und da musst"}, {"id": 478, "start": 3903.24, "end": 3907.04, "text": "du wirklich, ich mein, was haben die sich, was haben die sich beim Microsoft da gedacht,"}, {"id": 479, "start": 3907.04, "end": 3920.04, "text": "ist das hier irgendwie gute, gute Usability, wenn ich dann so machen muss, oder wie. Honig"}, {"id": 480, "start": 3920.04, "end": 3926.08, "text": "Brei schreibt, also bei mir geht nicht die Klammer. Also das Programm wird nicht mehr"}, {"id": 481, "start": 3926.08, "end": 3937.0, "text": "gehighlightet, oder wie man das nennt. Ich hab legit keine Ahnung, was, welches Programm"}, {"id": 482, "start": 3937.0, "end": 3940.48, "text": "und wo welche Klammer nicht geht. Aber als erstes was ich gucken würde ist, ob du unten"}, {"id": 483, "start": 3940.48, "end": 3944.68, "text": "das hier irgendwo umgestellt hast auf eine andere Sprache, und danach würde ich mal überprüfen,"}, {"id": 484, "start": 3944.68, "end": 3953.08, "text": "ob die Taste an sich funktioniert. Der User soll das Menü auch überhaupt nicht finden."}, {"id": 485, "start": 3953.08, "end": 3964.0, "text": "Ich, ich bin auch User, und ich weiß, dass ich da was umstellen muss. Ja, richtig richtig"}, {"id": 486, "start": 3964.0, "end": 3978.48, "text": "fail, Alter. So, exzellent. Kommen wir mit den Fische an. Und wisst ihr auch, was wir"}, {"id": 487, "start": 3978.48, "end": 3986.68, "text": "auch gerade einfach, wenn ich mir diese Settings hier angucke, also hier hab ich den Eindruck,"}, {"id": 488, "start": 3986.68, "end": 3991.52, "text": "ich weiß ungefähr wo ich hin muss. Und mal ganz davon abgesehen, by the way, dass ich"}, {"id": 489, "start": 3991.52, "end": 3998.28, "text": "diese alten Symbole, diese alten Icons viel aussagekräftiger finde als das Zeug. Ich"}, {"id": 490, "start": 3998.28, "end": 4003.12, "text": "mein hier, wo ist hier Netzwerk, ach da, ich find hier erkennst du es sofort, naja gut."}, {"id": 491, "start": 4003.12, "end": 4011.32, "text": "Aber es ist Geschmackssache, das ist ja generell so ein Trend, dass man diese, diese Flat Design"}, {"id": 492, "start": 4011.32, "end": 4017.56, "text": "Dinger, Icon Geschichten und sowas hat. Aber ich find die stechen viel mehr heraus und"}, {"id": 493, "start": 4017.56, "end": 4023.72, "text": "sind viel einprägsamer als das Zeug da. Nee, aber es ist wirklich, ist wirklich merkwürdig,"}, {"id": 494, "start": 4023.72, "end": 4028.88, "text": "ich weiß teilweise gar nicht wo ich suchen muss. Was auch, was auch witzig ist, dass"}, {"id": 495, "start": 4028.88, "end": 4034.6, "text": "man, ich weiß gar nicht, ob es jetzt funktioniert, aber vielleicht, zumindest ging das lange"}, {"id": 496, "start": 4034.6, "end": 4042.48, "text": "Zeit nicht, dass man, ans alte konnte man sich jetzt 20 Jahre gewöhnen, naja Spickel,"}, {"id": 497, "start": 4042.48, "end": 4047.12, "text": "so einfach ist das ja nicht. Du konntest dich ja in Windows 10 jetzt auch 5 Jahre gewöhnen"}, {"id": 498, "start": 4047.12, "end": 4057.38, "text": "und hat man sich dran gewöhnt, also irgendein Block im Gehirn scheint es ja dazu geben"}, {"id": 499, "start": 4057.38, "end": 4061.48, "text": "und das liegt zum größten Teil daran, dass es total inkonsistent umgesetzt ist, mal das"}, {"id": 500, "start": 4061.48, "end": 4065.44, "text": "alte mal das neue, sprich, dass man gar nicht das neue benutzen kann, noch zusätzlich das"}, {"id": 501, "start": 4065.44, "end": 4071.24, "text": "alte benutzen muss und das Microsoft an sich das sehr inkonsistent macht. Ich mein 5 Jahre"}, {"id": 502, "start": 4071.24, "end": 4074.72, "text": "sollten eigentlich reichen sich an sowas zu gewöhnen, wenn es konsequent und gut gemacht"}, {"id": 503, "start": 4074.72, "end": 4081.96, "text": "ist. So, ähm, jetzt wollte ich jetzt zeigen, genau, ähm, wenn man hier auf Apps geht,"}, {"id": 504, "start": 4081.96, "end": 4092.4, "text": "da konnte man mal, ah guck mal, oh, ah das geht jetzt auch, das ging bisher auch nur über"}, {"id": 505, "start": 4092.4, "end": 4107.6, "text": "das alte Windows Zeug. Vor allem, warum ist das hier ein anderer Knopf, als, ey, das versteht"}, {"id": 506, "start": 4107.6, "end": 4113.12, "text": "doch kein Mensch, wofür ist denn das jetzt da überhaupt, diese, wofür ist das da oben"}, {"id": 507, "start": 4113.12, "end": 4118.12, "text": "überhaupt, was ist die Existenzberechtigung davon, was macht man damit überhaupt, ich"}, {"id": 508, "start": 4118.12, "end": 4124.04, "text": "mein das hier kenn ich, das ist zum Beispiel das, wo man, äh, äh, das, das Windows Subsystem"}, {"id": 509, "start": 4124.04, "end": 4133.6, "text": "für Linux und, und Hyper-V und gedöhnt sind, aber was ist das? Ich, ich wills, ich wills"}, {"id": 510, "start": 4133.6, "end": 4139.88, "text": "gar nicht so, was auch immer die bei Microsoft da treiben. Du solltest einen Windows-Kurs"}, {"id": 511, "start": 4139.88, "end": 4146.28, "text": "besuchen, ey, auf der Arbeit, da gibt's ja mittlerweile schon so den Running Gag, dass"}, {"id": 512, "start": 4146.28, "end": 4156.6, "text": "ich einen Excel-Kurs machen soll. Also, das war mal so, wir sollten mal, irgend so eine"}, {"id": 513, "start": 4156.6, "end": 4161.12, "text": "ganz ultra nervige Excel, ähm, ähm, nicht Excel, wir sollten mal so eine ganz ultra"}, {"id": 514, "start": 4161.12, "end": 4169.24, "text": "nervige, äh, Tabelle erstellen, mit irgendwelchen Inventarlisten so und ich hab halt mich dummerweise"}, {"id": 515, "start": 4169.24, "end": 4178.36, "text": "freiwillig dazu bereit erklärt, das zu machen und, ähm, benutzt jemand von euch Confluence"}, {"id": 516, "start": 4178.36, "end": 4191.12, "text": "auf der Arbeit. Was ist da? So, und bei Confluence ist das so, also, die Leute, die technisch"}, {"id": 517, "start": 4191.12, "end": 4197.32, "text": "nicht sonderlich versiert sind, die kommen dann auf so grandiose Ideen wie eine Excel-Datei"}, {"id": 518, "start": 4197.32, "end": 4202.64, "text": "im Confluence anhängen und dann mit mehreren Leuten sharen, die dann parallel da drinnen"}, {"id": 519, "start": 4202.64, "end": 4208.52, "text": "bearbeitet werden sollen. So, und damit das funktioniert, also Confluence ist so eine Art"}, {"id": 520, "start": 4208.52, "end": 4215.72, "text": "Wiki im Endeffekt. So, und damit das funktioniert, gibt es dann eine Confluence-Companion-App"}, {"id": 521, "start": 4215.72, "end": 4219.64, "text": "oder sowas, ich kann das nicht richtig schreiben, hier. Dann gibt's hier auch eine Confluence-Companion-App,"}, {"id": 522, "start": 4219.64, "end": 4223.8, "text": "gibt's dann da unten. Das ploppt dann hier unten so auf, wenn man Sachen editiert hat"}, {"id": 523, "start": 4223.8, "end": 4228.64, "text": "im Confluence und lädt's wieder hoch, also sprich, man klickt in diesem Wiki das Excel-File"}, {"id": 524, "start": 4228.64, "end": 4232.48, "text": "an, dann geht's in Excel auf und wenn man speichert, muss man das über diese Companion-App"}, {"id": 525, "start": 4232.48, "end": 4239.64, "text": "hochladen. Ganz großer Scheiß, zumindest. Hab ich dann mal da 2 Stunden editiert, gespeichert,"}, {"id": 526, "start": 4239.64, "end": 4244.72, "text": "gespeichert und das Ding hat die ganze Zeit gesagt, jawoll, jawoll, jawoll, jawoll, so,"}, {"id": 527, "start": 4244.72, "end": 4251.32, "text": "und dann bin ich ins Confluence auf die Seite und hab gesehen, es hat nichts hochgeladen"}, {"id": 528, "start": 4251.32, "end": 4257.48, "text": "die letzten 2 Stunden, also hab ich Excel genommen, Excel gespeichert und einfach einen neuen"}, {"id": 529, "start": 4257.48, "end": 4262.12, "text": "Anhang auf die Seite gemacht und einen Kommentar reingeschrieben, wie kacke dieses System ist"}, {"id": 530, "start": 4262.12, "end": 4270.28, "text": "und warum man das verwendet und ich hab sogar, ich war sogar nett und ich hab noch den Bug-Report"}, {"id": 531, "start": 4270.28, "end": 4276.64, "text": "reingepostet vom Atlassian Bug-Tracker, hab ich gesagt, ja, das ist ein Fehler, der taucht"}, {"id": 532, "start": 4276.64, "end": 4281.2, "text": "öfters auf, hier ist der Bug-Report, ich hab jetzt, ich hab für heute die Nase voll,"}, {"id": 533, "start": 4281.2, "end": 4287.56, "text": "irgendwas hab ich reingeschrieben. So, und da hat dann die Stonksfrau darauf geantwortet,"}, {"id": 534, "start": 4287.56, "end": 4292.48, "text": "die diese Listen haben wollte, also bei mir gibt es damit überhaupt keine Probleme, möchtest"}, {"id": 535, "start": 4292.48, "end": 4299.72, "text": "du einen Excel-Kurs haben? Da konnte ich überlegen, wie sehr ich mich über dieses Kommentar gefreut"}, {"id": 536, "start": 4299.72, "end": 4312.44, "text": "hab, Alter. He lacks critical information, das hab ich mir vielleicht gedacht, Sebaro,"}, {"id": 537, "start": 4312.44, "end": 4332.64, "text": "sowas kannst du da nicht reinschreiben, da bist gleich Abmahnung raus. So, nee, nee, nee,"}, {"id": 538, "start": 4332.64, "end": 4335.8, "text": "nee, ich hab die Schulung bis heute nicht gemacht, aber das ist jetzt, das ist bei uns"}, {"id": 539, "start": 4335.8, "end": 4340.44, "text": "auf der Arbeit jetzt irgendwie so der Running-Gag, wenn irgendwas ist mit Tabellen, dann heißt"}, {"id": 540, "start": 4340.44, "end": 4350.96, "text": "dann, der Maxim Wilder wollte doch ne Excel-Schulung machen, oder irgendwie sowas, ja. Das stimmt"}, {"id": 541, "start": 4350.96, "end": 4357.86, "text": "schon, ja, das stimmt. Übrigens, ich sehs ja grad am Chat, ne, scheint wohl, scheint"}, {"id": 542, "start": 4357.86, "end": 4362.96, "text": "wohl nicht der einzige zu sein, der Confluence in Kombination mit dieser Atlassian Companion-App"}, {"id": 543, "start": 4362.96, "end": 4383.12, "text": "übel Scrap findet. Nee, also, das ist wirklich voll von Arsch, der Kram. Ich muss euch mal"}, {"id": 544, "start": 4383.12, "end": 4387.64, "text": "ehrlich sagen, weil jetzt ein bisschen geflamed wurde gegen Confluence, ich finde Confluence"}, {"id": 545, "start": 4387.64, "end": 4393.16, "text": "an sich, und ich finde auch vieles der Atlassian-Dinger gar nicht so schlecht. Also auch Hira, oder"}, {"id": 546, "start": 4393.16, "end": 4401.6, "text": "wie es die coolen Leute aussprechen, Gyra, was sagt ihr Leute? Hira, Gyra, oder Jira,"}, {"id": 547, "start": 4401.6, "end": 4415.2, "text": "Jira, oder was haben wir sonst noch? Chiara, oder sowas. Jira, okay, das ist gar nicht"}, {"id": 548, "start": 4415.2, "end": 4426.44, "text": "so kacke. Das Problem ist nur, dass oftmals in Super Enterprise Business Stonks Firmen,"}, {"id": 549, "start": 4426.44, "end": 4430.96, "text": "die Sachen, diese Systeme total verbogen werden, um irgendwas zu machen, was nicht gemacht"}, {"id": 550, "start": 4430.96, "end": 4438.28, "text": "werden soll. Also, Jira ist ein Ticket-System, wo man sich Aufgaben zuordnen kann und machen,"}, {"id": 551, "start": 4438.28, "end": 4446.8, "text": "das ist alles okay. Übrigens, auch noch Story von der Enterprise Business Front. Wir haben"}, {"id": 552, "start": 4446.8, "end": 4452.12, "text": "jetzt was Neues bei uns im Hira, das ist auch schon wieder so geil. Sowas kann nur in einer"}, {"id": 553, "start": 4452.12, "end": 4462.48, "text": "größeren Bank passieren, glaube ich zumindest. Du musst ein gewisses Level von Realitätsverweigerung"}, {"id": 554, "start": 4462.48, "end": 4466.12, "text": "haben, dass du sowas erst machen kannst. Und ich glaube, sowas gibt es nur bei besonders"}, {"id": 555, "start": 4466.12, "end": 4470.12, "text": "großen Firmen und ich glaube, auch bei Banken in Deutschland ist das eben besonders beliebt."}, {"id": 556, "start": 4470.12, "end": 4474.6, "text": "So, und zwar, man hat sich jetzt überlegt, also wir verwenden ja Hira als Ticket-System"}, {"id": 557, "start": 4474.6, "end": 4480.92, "text": "schon relativ lange. Und jetzt haben sich Leute überlegt, okay, man sollte darüber"}, {"id": 558, "start": 4480.92, "end": 4487.52, "text": "Zeiterfassung machen. Ist ja an sich kein Problem, hat es ja glaube ich auch ein eingebautes"}, {"id": 559, "start": 4487.52, "end": 4492.36, "text": "Modul. Natürlich verwenden wir nicht das eingebaute Modul, sondern irgendein Trittanbieter-Modul,"}, {"id": 560, "start": 4492.36, "end": 4499.12, "text": "das sich überhaupt nicht gut integriert, aber sei mal dahingestellt. So, und was wollte"}, {"id": 561, "start": 4499.12, "end": 4505.2, "text": "ich jetzt erzählen? Zeiterfassung. Genau, und dann ist ihnen irgendwann aufgefallen,"}, {"id": 562, "start": 4505.2, "end": 4509.12, "text": "dass es ja gar nicht so genau geht mit der Zeiterfassung, so wie sie sich das vorgestellt"}, {"id": 563, "start": 4509.12, "end": 4515.16, "text": "haben, weil dann könnte man ja auf einmal kontrollieren, wer was in irgendeiner Art"}, {"id": 564, "start": 4515.16, "end": 4521.36, "text": "und Weise macht und das ist ja gar nicht erlaubt. Okay, also hat man das ein bisschen mehr anonymisiert"}, {"id": 565, "start": 4521.36, "end": 4525.44, "text": "und irgendwie noch ein bisschen dran rumgedockt hat und sonst was, alles gut. So, und jetzt"}, {"id": 566, "start": 4525.44, "end": 4530.88, "text": "ist das Problem, also ihr könnt euch ja vorstellen, wenn man ein Ticket-System hat, also sprich"}, {"id": 567, "start": 4530.88, "end": 4536.48, "text": "eines der zentralsten Funktionen von so einem Ticket-System ist, einmal, dass man sich"}, {"id": 568, "start": 4536.48, "end": 4541.84, "text": "selbst Aufgaben zuordnen kann, ja, dass andere Leute sich Aufgaben nehmen können und aber"}, {"id": 569, "start": 4541.84, "end": 4546.6, "text": "auch, dass man Aufgaben miteinander verknüpfen kann. Zum Beispiel, es gibt einen Ticket,"}, {"id": 570, "start": 4546.6, "end": 4551.64, "text": "wo drin steht, neue Version und dann verknüpft man halt ein paar Tickets mit, keine Ahnung,"}, {"id": 571, "start": 4551.64, "end": 4555.56, "text": "mit irgendwelchen To Do's, mit irgendwelchen Bugs vielleicht, mit einzelnen Features und"}, {"id": 572, "start": 4555.56, "end": 4563.84, "text": "so, also sprich, Tickets verknüpfen ist eines der wichtigsten Dinger überhaupt. Also, das"}, {"id": 573, "start": 4563.84, "end": 4568.56, "text": "ist eigentlich mit das wichtigste an so einem Ticket-System. Also nur mal so, meiner Meinung"}, {"id": 574, "start": 4568.56, "end": 4575.52, "text": "nach und vielleicht für Leute, die es nicht so oft verwenden. So, und jetzt gibt es ein"}, {"id": 575, "start": 4575.52, "end": 4585.0, "text": "Problem, das Zeit-Erfassungs-Plugin ist verbugt. Wenn du jetzt Zeit erfasst in einem Ticket"}, {"id": 576, "start": 4585.0, "end": 4592.84, "text": "und dieses Ticket wird verknüpft und das verknüpfte Ticket ist Bestandteil von einer,"}, {"id": 577, "start": 4592.84, "end": 4603.32, "text": "ja wie nennt man das, Bestandteil von irgendeinem übergeordneten Projekt-Ticket, dann geht"}, {"id": 578, "start": 4603.32, "end": 4609.56, "text": "die ganze erfasste Zeit auf die Projektzeit von diesem eigentlich nichts damit zu tun"}, {"id": 579, "start": 4609.56, "end": 4616.16, "text": "habenen Projekt. Das ist total wirr. Das ist verbugt ohne Ende das Ding. Zumindest führt"}, {"id": 580, "start": 4616.16, "end": 4623.76, "text": "das jetzt im Endeffekt dazu, dass auf einmal Projekte von nichts, also von 0 auf 100 irgendwie,"}, {"id": 581, "start": 4623.76, "end": 4628.16, "text": "keine Ahnung, das ist ein Projekt mit 20 Tagen und hat auf einmal, seitdem dieses Feature"}, {"id": 582, "start": 4628.16, "end": 4633.0, "text": "gibt, hat es nicht, hat es keine Ahnung, vorher hat es irgendwie, okay, 25 Tage Projektzeit"}, {"id": 583, "start": 4633.0, "end": 4643.44, "text": "und danach hat es 150 Tage von 20. Und das ist dieses Third-Party-Zeit-Erfassungs-Ding"}, {"id": 584, "start": 4643.44, "end": 4650.08, "text": "inklusive, inklusive, ich will das auch nicht mal dem Entwickler dieses Zeit-Erfassungs-Dings"}, {"id": 585, "start": 4650.08, "end": 4656.44, "text": "in die Schuhe schieben, das ist eine Mischung, ach guck mal der Keeper XY auch da, das ist"}, {"id": 586, "start": 4656.44, "end": 4667.96, "text": "eine Mischung aus Drittanbieter-Zeit-Erfassung und unsere Verwurstung mit den Tickets. Ja"}, {"id": 587, "start": 4667.96, "end": 4672.0, "text": "und da kannst du dazu führen, dass du quasi jetzt entweder die Zeit-Erfassung nirgendwo"}, {"id": 588, "start": 4672.0, "end": 4679.16, "text": "aufschlägt oder die Zeit-Erfassung bei den falschen Sachen aufschlägt. Ja, das darf"}, {"id": 589, "start": 4679.16, "end": 4682.68, "text": "ja an sich nicht gehen. Und du weißt ja, du machst dich ja, also haben sie ja in dieser"}, {"id": 590, "start": 4682.68, "end": 4686.6, "text": "Beschulung sogar erzählt, du machst dich ja sogar strafbar, solltest du in der API gucken,"}, {"id": 591, "start": 4686.6, "end": 4692.36, "text": "was dein Kollege im Ticket zugefügt hat. Naja, also ich glaube sowas geht echt nur"}, {"id": 592, "start": 4692.36, "end": 4697.84, "text": "in super, super großen Enterprise-Firmen, wo es auf die einzelnen Sachen nicht so genau"}, {"id": 593, "start": 4697.84, "end": 4702.08, "text": "ankommt. Jeder andere hätte schon gesagt, Alter, was machen wir da eigentlich für ein"}, {"id": 594, "start": 4702.08, "end": 4706.24, "text": "Scheiß, kann doch nicht sein, dass sich irgendwie 20 Leute um nichts anderes kümmern"}, {"id": 595, "start": 4706.24, "end": 4715.24, "text": "als sowas. Ja, das, das ist übrigens auch ein guter, das machen wir übrigens gerne."}, {"id": 596, "start": 4715.24, "end": 4722.52, "text": "Äh, Pivion, danke schön für den Prime-Sub. Massive Sub, Big Brain-Subscription. So Dinger"}, {"id": 597, "start": 4722.52, "end": 4728.4, "text": "machen wir übrigens auch gerne hier auf der Arbeit, ne. Wo dann, wo dann sei es, ja also"}, {"id": 598, "start": 4728.4, "end": 4734.4, "text": "theoretisch könnte das der Dienstleister schon machen, aber wir haben ja im Vertrag drin"}, {"id": 599, "start": 4734.4, "end": 4739.08, "text": "stehen, dass er es nicht darf. Oder umgedreht ist auch geil, so nach dem Motto, ja also wir"}, {"id": 600, "start": 4739.08, "end": 4748.28, "text": "glauben ehrlich gesagt auch nicht, dass der Dienstleister das schafft, 99,99% Uptime,"}, {"id": 601, "start": 4748.28, "end": 4754.0, "text": "aber wir haben im Vertrag drin stehen in den SLSAs, dass der 99,99% Verfügbarkeit hat,"}, {"id": 602, "start": 4754.0, "end": 4758.12, "text": "also, also hat er die auch. Muss ich mal sagen, ja ja, aber wir haben es doch jetzt schon oft"}, {"id": 603, "start": 4758.12, "end": 4761.28, "text": "genug gesehen, dass er es nicht hat, ja das ist egal, Hauptsache man hat es im Vertrag"}, {"id": 604, "start": 4761.28, "end": 4767.88, "text": "drin stehen. Also es geht in der Enterprise-Business-Welt geht es oftmals nicht darum, was wirklich"}, {"id": 605, "start": 4767.88, "end": 4773.88, "text": "ist, sondern wem du offiziell die Schuld in die Schuhe schieben kannst. Hast du einen,"}, {"id": 606, "start": 4773.88, "end": 4778.56, "text": "dem du die Schuld in die Schuhe schieben kannst, ist alles in Ordnung, auch wenn es genauso"}, {"id": 607, "start": 4778.56, "end": 4782.96, "text": "kaputt geht wie sonst, aber du hast einen, dem du die Schuld in die Schuhe schieben kannst."}, {"id": 608, "start": 4782.96, "end": 4788.72, "text": "Deswegen macht man auch gerne so viele Wartungsverträge und sowas, dass man einfach sagen kann, ja"}, {"id": 609, "start": 4788.72, "end": 4795.68, "text": "gut, die waren es. Wir sind nicht daran schuld, unser externer Dienstleister hat es verkackt"}, {"id": 610, "start": 4795.68, "end": 4809.16, "text": "oder irgendwie sowas. Ja, so Zeug waren wir gern. Wie kann man Prime Summen? Dazu brauchst"}, {"id": 611, "start": 4809.16, "end": 4817.04, "text": "du Amazon Prime und dann kriegst du einen kostenlosen Prime Sub im Monat, den du einem"}, {"id": 612, "start": 4817.04, "end": 4825.2, "text": "Channel deiner Wahl vergeben kannst. Aber solltest du kein Amazon Prime haben, nur dafür"}, {"id": 613, "start": 4825.2, "end": 4832.24, "text": "Amazon Prime holen lohnt sich nicht. Du musst das verknüpfen. Du musst irgendwie, boah frag"}, {"id": 614, "start": 4832.24, "end": 4837.28, "text": "mich nicht mehr aus dem Kopf, wie das ging. Du kannst dein Twitch-Account mit Amazon verknüpfen"}, {"id": 615, "start": 4837.28, "end": 4844.32, "text": "und dann kriegst du automatisch den Prime Sub. Außer du hast einen Studenten Prime,"}, {"id": 616, "start": 4844.32, "end": 4849.16, "text": "dann geht das. Der Sebaro weiß das. Sebaro, wenn man Studenten Prime hat, geht das dann"}, {"id": 617, "start": 4849.16, "end": 4868.8, "text": "auch? Ja, geht auch, ok. Äh, genau so ist es. Das ist der Grund, warum viele Leute was"}, {"id": 618, "start": 4868.8, "end": 4873.72, "text": "in die Cloud schieben, nicht weil es wirklich dadurch so viel einfacher zu handhaben wird"}, {"id": 619, "start": 4873.72, "end": 4878.64, "text": "oder weil das irgendwie prinzipiell besseres Software wird dadurch. Ich mein, es ist der"}, {"id": 620, "start": 4878.64, "end": 4882.44, "text": "gleiche Kram, ob der jetzt offline oder online läuft, ist vollkommen egal. Sondern weil man"}, {"id": 621, "start": 4882.44, "end": 4886.48, "text": "einfach die Schuld woanders abladen kann. Genau, das ist der Grund. Es wird auch meistens"}, {"id": 622, "start": 4886.48, "end": 4899.04, "text": "nicht billiger. Äh, ehrlich gesagt, das weiß ich aus dem Kopf jetzt nicht. Du musst, du"}, {"id": 623, "start": 4899.04, "end": 4907.36, "text": "musst zumindest das verknüpfen mit deinem Prime. Gerade gestern ging die Google Cloud"}, {"id": 624, "start": 4907.36, "end": 4915.24, "text": "übrigens richtig gut. Gestern war die ganze Google Cloud, also, das stimmt ja nicht,"}, {"id": 625, "start": 4915.24, "end": 4920.04, "text": "die Google Cloud hat gestern auch funktioniert, die Anmeldung war problematisch. Aber wisst"}, {"id": 626, "start": 4920.04, "end": 4926.96, "text": "ihr was geil, Wind? Die, das ist typische, typische Google Reaktion, ne? Der Google"}, {"id": 627, "start": 4926.96, "end": 4937.72, "text": "Clouds Fall, die sagen nichts. Die sagen einfach gar nichts dazu. Kann mal gucken, ob die überhaupt"}, {"id": 628, "start": 4937.72, "end": 4942.4, "text": "irgendwas dazu geschrieben haben. Ich glaub, die haben einfach nur geschrieben, äh, Verfügbarkeit"}, {"id": 629, "start": 4942.4, "end": 4947.12, "text": "ist unser höchstes Ziel oder irgendwie sowas. Der Provokateur 6 Monate Prime, Dankeschön"}, {"id": 630, "start": 4947.12, "end": 4966.2, "text": "für den Sub. Google hat ja gerne mal auf was zu posten, ne? Nö, die haben irgendwie"}, {"id": 631, "start": 4966.2, "end": 4973.64, "text": "nichts. Ach, keine Ahnung. Zumindest, Google äußert sich bei sowas eh nicht großartig."}, {"id": 632, "start": 4973.64, "end": 4977.44, "text": "Es gab nen Tweet von denen, hab ich nicht gesehen, vielleicht haste den link ich zumindest"}, {"id": 633, "start": 4977.44, "end": 4980.92, "text": "jetzt nicht gefunden. Die haben aber da nix großartiges geschrieben, die haben einfach"}, {"id": 634, "start": 4980.92, "end": 4985.32, "text": "nur, was die haben unter dem Q geklaut, die haben einfach nur geschrieben, dass irgendwie"}, {"id": 635, "start": 4985.32, "end": 4993.24, "text": "Verfügbarkeit ihr höchstes Ziel ist oder sowas. Ah, exzellent, ich zeig mal her."}, {"id": 636, "start": 4993.24, "end": 5003.88, "text": "Sag mal, Keeper XY, wie haben die eigentlich auf der Arbeit die Ankündigung aufgenommen,"}, {"id": 637, "start": 5003.88, "end": 5010.52, "text": "dass CentOS nicht mehr CentOS ist? Beziehungsweise, dass CentOS eingestellt wird. Die waren bestimmt"}, {"id": 638, "start": 5010.52, "end": 5027.52, "text": "alle sehr happy, oder? Ach tatsächlich, die haben sogar was dazu geschrieben? Das wird"}, {"id": 639, "start": 5027.52, "end": 5033.88, "text": "noch lustig. Wir sollten einfach das machen, was ich seit Jahren schon sage, einfach Ubuntu"}, {"id": 640, "start": 5033.88, "end": 5045.92, "text": "nehmen für alle Server, easy. Will ja keiner, ne? Einfach Ubuntu. Tomtricks CentOS wird"}, {"id": 641, "start": 5045.92, "end": 5059.8, "text": "eingestellt, allerdings, wenn du noch auf CentOS 7 bist, mal. Wir gucken uns den Blogpost einfach"}, {"id": 642, "start": 5059.8, "end": 5080.4, "text": "noch mal an. Kann ich dir noch mal schnell was zu sagen. Hier, das da. So, also, wenn"}, {"id": 643, "start": 5080.4, "end": 5087.28, "text": "du CentOS 7 verwendest, ist okay. CentOS 7 werden sie weiter supporten, bis der Rattan"}, {"id": 644, "start": 5087.28, "end": 5093.04, "text": "Enterprise Linux 7 Lifecycle vorbei ist, aber 8 wird es nicht geben. Es gibt jetzt so ein"}, {"id": 645, "start": 5093.04, "end": 5099.44, "text": "komisches Rolling Release, was auch nicht mehr direkt Binary-kompatibel zu Red Hat ist."}, {"id": 646, "start": 5099.44, "end": 5107.32, "text": "Also eigentlich nicht das, was die Leute haben wollen. Ja, genau, und CentOS 8 ist Ende"}, {"id": 647, "start": 5107.32, "end": 5117.2, "text": "2021 vorbei. Sie wurden IBM'ed sozusagen. Also Tomtricks, wenn ihr CentOS 8 habt, habt"}, {"id": 648, "start": 5117.2, "end": 5128.36, "text": "ihr ein Problem. Ihr könnt entweder auf CentOS Stream upgraden und hoffen, dass alles funktioniert."}, {"id": 649, "start": 5128.36, "end": 5134.16, "text": "Was meistens nicht so der Fall ist, wenn man CentOS verwendet, weil man verwendet CentOS"}, {"id": 650, "start": 5134.16, "end": 5139.32, "text": "7, nicht einfach nur, weil man ein stabiles Linux haben will, oftmals auch, weil man zertifizierte"}, {"id": 651, "start": 5139.32, "end": 5144.4, "text": "und dafür entwickelte Sachen hat. Und da kommt man mit CentOS Stream nicht sonderlich"}, {"id": 652, "start": 5144.4, "end": 5149.44, "text": "weit. Ja, wir sind zum größten Teil auch noch auf CentOS 7, aber CentOS 7 ist jetzt"}, {"id": 653, "start": 5149.44, "end": 5162.12, "text": "ja auch schon ein bisschen älter. Wann kam das raus? 2017 oder was auch immer. Das ist"}, {"id": 654, "start": 5162.12, "end": 5173.6, "text": "ja auch das Top Aktuelle. Guck mal, 2015 kam das Scheiß raus. Nee, 2014. Alter, ich"}, {"id": 655, "start": 5173.6, "end": 5181.12, "text": "hab nix gesagt. Das ist 6 Jahre alt. Colonel 3.1, das ist uralt. Also 6 Jahre alte, du"}, {"id": 656, "start": 5181.12, "end": 5186.68, "text": "hast jetzt schon das Problem unter Red Hat 7, dass du manche Sachen gar nicht mehr richtig"}, {"id": 657, "start": 5186.68, "end": 5190.12, "text": "drauf verwenden kannst. Willst du irgendwie eine neue Load-Balancer-Version haben, geht"}, {"id": 658, "start": 5190.12, "end": 5197.12, "text": "nicht. Brauchst du irgendwie neue SSL-Library, gibt's nicht. Brauchst du irgendwelche Container-Geschichten,"}, {"id": 659, "start": 5197.12, "end": 5204.88, "text": "Colonel zu alt. Also schön ist es nicht. Scientific ist doch auch dead, oder? Wir hatten mal eine"}, {"id": 660, "start": 5204.88, "end": 5212.92, "text": "Weile auf der Arbeit Scientific. Zumindest angeblich ist es jetzt so, dass es jetzt eine"}, {"id": 661, "start": 5212.92, "end": 5217.88, "text": "Alternative geben soll, die gibt's aber noch nicht, aber die soll's geben, und zwar Rocky"}, {"id": 662, "start": 5217.88, "end": 5228.56, "text": "Minox. Das hat einfach mal auf einen Schlag 6000 Sterne. Keeper Exist, oder? Gentoo, Gentoo,"}, {"id": 663, "start": 5228.56, "end": 5242.56, "text": "wie wär's damit? Wir kombinieren erst mal eine Woche. Gentoo. Wie gesagt, ich bin für"}, {"id": 664, "start": 5242.56, "end": 5253.44, "text": "Ubuntu Server. Ich mag Ubuntu Server. Ubuntu Beste. Außerdem kann man Ubuntu besonders cool"}, {"id": 665, "start": 5253.44, "end": 5261.0, "text": "aussprechen. Kann dann die coolen Leute sprechen, Ubuntu nicht Ubuntu aussehen, Jubantu, sagen"}, {"id": 666, "start": 5261.0, "end": 5275.32, "text": "wir. Ubuntu. Ich hoffe, bei uns kommen sie nicht auf die Idee, Suze zu kaufen oder sowas."}, {"id": 667, "start": 5275.32, "end": 5280.84, "text": "Da bin ich mal gespannt drauf, was das hier wird. Haben die schon eine Webseite oder so?"}, {"id": 668, "start": 5280.84, "end": 5291.56, "text": "Rocky Minox. Rocky Minox Org, okay, zeig mal her. Bis das überhaupt losgeht, wird ja schon"}, {"id": 669, "start": 5291.56, "end": 5305.2, "text": "eine ganze Weile dauern. Ich mein, was ein bisschen Hoffnung lässt bei der Sache ist,"}, {"id": 670, "start": 5305.2, "end": 5311.2, "text": "dass das wohl der Gründer des CentOS Projekts gründet, also der gründet quasi ein zweites"}, {"id": 671, "start": 5311.2, "end": 5317.84, "text": "CentOS, und dann lässt er sich einfach wieder kaufen von IBM in ein paar Jahren für noch"}, {"id": 672, "start": 5317.84, "end": 5324.72, "text": "mehr Stonks. Das ist doch eigentlich eine geile Sache, oder? Man gründet ein Projekt,"}, {"id": 673, "start": 5324.72, "end": 5331.92, "text": "das ist eigentlich richtig big brain, Alter. Man gründet ein Projekt, wartet bis es erfolgreich"}, {"id": 674, "start": 5331.92, "end": 5339.44, "text": "ist, verkauft es, und dann steigt man aus und macht das gleiche nochmal, oder weiß man"}, {"id": 675, "start": 5339.44, "end": 5351.88, "text": "jetzt ja schon, wie es geht, und dann verkauft man es nochmal. Bam. Easy, easy money. Das"}, {"id": 676, "start": 5351.88, "end": 5357.32, "text": "kleine Problem dabei ist nur, man muss das Projekt erfolgreich machen, was eher öfters"}, {"id": 677, "start": 5357.32, "end": 5370.2, "text": "in die Hose geht, als dass es klappt. Ja, das funktioniert wunderbar. Ubuntu Updates"}, {"id": 678, "start": 5370.2, "end": 5375.04, "text": "funktioniert wunderbar. Ich hatte da auch noch nie Probleme. Ich hatte damit auch noch"}, {"id": 679, "start": 5375.04, "end": 5379.24, "text": "nie Probleme. Hattest du gerade angehört, als hättest du gesagt, ich hätte neulich"}, {"id": 680, "start": 5379.24, "end": 5384.64, "text": "Probleme. Nee, nee, ich hatte damit auch noch nie Probleme. Ubuntu hat auch so ein paar"}, {"id": 681, "start": 5384.64, "end": 5391.32, "text": "Macken, die mir auch auf den Keks gehen. Das Schlimmste unter Ubuntu ist Netplan. Also"}, {"id": 682, "start": 5391.32, "end": 5402.68, "text": "ich weiß nicht, was Canonical da geritten hat, Netzwerk-Config in Jaml zu machen. Warum"}, {"id": 683, "start": 5402.68, "end": 5408.08, "text": "hat irgendjemand auf dieser Welt gesagt, aber die Netzwerk-Config unter Debian, die ist"}, {"id": 684, "start": 5408.08, "end": 5413.12, "text": "ja so scheiße, ich bin gar nicht in der Lage, Netzwerke zu konfigurieren, da muss was anderes"}, {"id": 685, "start": 5413.12, "end": 5419.88, "text": "her. Niemand, also ich kenn niemand, der irgendwie was auszusetzen hatte an der Ubuntu"}, {"id": 686, "start": 5419.88, "end": 5434.68, "text": "oder Debian Netzwerk-Config. Das ist sehr nett, dass du das willst. Du hast normalerweise"}, {"id": 687, "start": 5434.68, "end": 5445.6, "text": "einfach oben nen Knopf, guck hier. Du hast hier irgendwo nen Subknopf, da. Easy. Da klickst"}, {"id": 688, "start": 5445.6, "end": 5450.84, "text": "du drauf und dann kannst du Prime auswählen, wenn es richtig verknüpft ist. Falls es nicht"}, {"id": 689, "start": 5450.84, "end": 5454.56, "text": "funktioniert mit Prime auswählen, dann dauert es wahrscheinlich einfach noch ein bisschen."}, {"id": 690, "start": 5454.56, "end": 5462.4, "text": "Aber ich freu mich auch so über jeden Zuschauer auch ohne Prime Sub. Aber natürlich Massive"}, {"id": 691, "start": 5462.4, "end": 5468.84, "text": "High IQ kriegt man nur mit Prime Sub. Das ist ja allgemein bekannt mittlerweile. Alter,"}, {"id": 692, "start": 5468.84, "end": 5492.68, "text": "der Halo Soundtrack ist so poggers, oder? Oh, da hast du viel Spaß dabei, ja. Wenn du"}, {"id": 693, "start": 5492.68, "end": 5501.84, "text": "mich mal failen sehen willst. Wenn du mich failen sehen willst, musst du den Stream rein"}, {"id": 694, "start": 5501.84, "end": 5514.44, "text": "gucken, wo ich versucht hab, die China-Steckdosenleiste aufzumachen. Alter, hab ich da. Ja. Genau."}, {"id": 695, "start": 5514.44, "end": 5529.88, "text": "Oh ne, da hab ich sie schon auf. Hier. Irgendwo verbiege ich das Zeug auch. Aber zumindest,"}, {"id": 696, "start": 5529.88, "end": 5535.24, "text": "du kennst ja, du kennst ja, dass das wichtigste Projekt, wenn es ums Flaschen von China-Steckdosenleisten"}, {"id": 697, "start": 5535.24, "end": 5544.84, "text": "geht, GitHub. Also sprich, wenn du, ne, ich bin von der falschen Seite ran. Ich hätte"}, {"id": 698, "start": 5544.84, "end": 5549.44, "text": "es vorne aufmachen können. Aber man kann die meisten China-Steckdosenleisten ja Wi-Fi"}, {"id": 699, "start": 5549.44, "end": 5553.64, "text": "mit einem Raspberry Pi flashen. Wenn man Glück hat, dass die Firmware noch alt genug"}, {"id": 700, "start": 5553.64, "end": 5558.32, "text": "ist, dass sie das unterstützt, das ist dann total easy damit. Ja, da hast du Glück, da"}, {"id": 701, "start": 5558.32, "end": 5563.56, "text": "hast du eine Steckdose gefunden. Da würd ich gleich noch ein paar von kaufen. Tja."}, {"id": 702, "start": 5563.56, "end": 5568.64, "text": "Ne, aber noch mal jetzt zu dieser Geschichte. Ich weiß nicht, was mit den Leuten bei Canonica"}, {"id": 703, "start": 5568.64, "end": 5575.36, "text": "los ist, also bei den Ubuntu-Leuten. Ja, die Gose und Dinge hab ich auch. Genau. Gose und"}, {"id": 704, "start": 5575.36, "end": 5579.76, "text": "interessiert sich nicht für Sicherheitslücken. Die Patchen einfach irrefieren wir nicht."}, {"id": 705, "start": 5579.76, "end": 5583.52, "text": "Ich weiß nicht, was die geritten hat, dass die sich gedacht haben. Alter, wir müssen"}, {"id": 706, "start": 5583.52, "end": 5605.64, "text": "unbedingt ne Yammel-Config machen für Netzwerk. So, also mal zum Vergleich. Das hier ist ne"}, {"id": 707, "start": 5605.64, "end": 5611.32, "text": "Network-Interfaces-Config. So war das die letzten 20 Jahre unter Debian und Ubuntu."}, {"id": 708, "start": 5611.32, "end": 5616.56, "text": "So hat man Netzwerke konfiguriert bisher immer. Außer man hat DHCP verwendet, da musste man"}, {"id": 709, "start": 5616.56, "end": 5623.36, "text": "eh nix machen, aber okay. So hat man Netzwerke konfiguriert unter Debian und Ubuntu seit"}, {"id": 710, "start": 5623.36, "end": 5633.16, "text": "den letzten 20 Jahren. So. Und jetzt gibt's das hier. Ich würd ja mal gerne den Chat"}, {"id": 711, "start": 5633.16, "end": 5640.24, "text": "hier da zu interviewen. Also, was ist euch lieber? Das linke oder das rechte? Es macht"}, {"id": 712, "start": 5640.24, "end": 5661.32, "text": "ungefähr das gleiche. Rechts, ja, find ich auch. Ja, ne, also. Ich mein, man kann das"}, {"id": 713, "start": 5661.32, "end": 5666.68, "text": "schon lesen links, aber warum? Es ist ja, der Witz ist ja, es ist ja neunzig, ich mein's"}, {"id": 714, "start": 5666.68, "end": 5673.32, "text": "ist ein Riesenunterschied. Ich mein, das sind die gleichen Infos und alles. Der Witz"}, {"id": 715, "start": 5673.32, "end": 5678.48, "text": "ist ja, genau, man könnte Network-D verwenden. Network-D hat zum Teil so ein paar richtig"}, {"id": 716, "start": 5678.48, "end": 5685.92, "text": "coole Features. Zum Beispiel Interfaces umbenennen aufgrund von der Mac-Adresse oder aufgrund"}, {"id": 717, "start": 5685.92, "end": 5695.2, "text": "von der PCI-Nummer und sowas. Deswegen, ich hab's mittlerweile auf meinen Kisten mit"}, {"id": 718, "start": 5695.2, "end": 5700.96, "text": "mehreren Netzwerk-Interfaces auch so, dass ich über System-D, Network-D meine Interfaces"}, {"id": 719, "start": 5700.96, "end": 5710.84, "text": "zudem umbenenne, was sie sind. Also sprich, bei dieser 4HE-Kiste hier, bei dieser fetten,"}, {"id": 720, "start": 5710.84, "end": 5721.68, "text": "so. So, bei dieser fetten 4HE-Kiste, da hat ich ja zwei 10G-Onboard und ne 4-Port-Internetzwerkkarte"}, {"id": 721, "start": 5721.68, "end": 5726.72, "text": "drin und dort hab ich mit System-D einfach die Interfaces umbenannt. Also sprich, das"}, {"id": 722, "start": 5726.72, "end": 5735.52, "text": "erste Onboard-10G hieß nicht dann einfach ENS34 oder so, sondern hieß 10G-Intern."}, {"id": 723, "start": 5735.52, "end": 5744.08, "text": "Und das ist ein nice Feature. Ich mein, da weiß man sofort anhand des Interface-Namens,"}, {"id": 724, "start": 5744.08, "end": 5750.44, "text": "was es ist. Ja, und das andere hab ich dann zum Beispiel genannt 1G-Telecom-Ablink oder"}, {"id": 725, "start": 5750.44, "end": 5756.56, "text": "sowas. Ich glaub, 1G-Unity-Media, 1G-Telecom und so hieß das dann. Eigentlich richtig cooles"}, {"id": 726, "start": 5756.56, "end": 5763.44, "text": "Feature kann man hiermit auch machen, aber ich mein, warum, wenn man das einfach so lassen"}, {"id": 727, "start": 5763.44, "end": 5768.72, "text": "kann, wie es ist, wo sich die Leute dran gewöhnt haben, was gut funktioniert, was keine Nachteile"}, {"id": 728, "start": 5768.72, "end": 5772.84, "text": "hat gegenüber dem anderen. Ich versteh die, also das ist was, was ich unter Ubuntu nicht"}, {"id": 729, "start": 5772.84, "end": 5780.24, "text": "verstehe. Das leuchtet mir nicht ein. Ansonsten muss ich sagen, ist mir Ubuntu als Server-Betriebssystem"}, {"id": 730, "start": 5780.24, "end": 5786.08, "text": "immer noch am liebsten. Was ich witzig finde, viele Leute scheinen es genau umgedreht zu"}, {"id": 731, "start": 5786.08, "end": 5791.6, "text": "sehen, die sagen, hey, Ubuntu auf dem Desktop Pock, Ubuntu auf dem Server Sucked, mit Demian"}, {"id": 732, "start": 5791.6, "end": 5796.76, "text": "kann ich auch noch leben. Aber ich bin da mittlerweile so dran gewöhnt und ich find"}, {"id": 733, "start": 5796.76, "end": 5803.44, "text": "auch die Ubuntu-Philosophie ganz gut. Du kriegst bei Ubuntu alle zwei Jahre einen LTS-Release,"}, {"id": 734, "start": 5803.44, "end": 5810.32, "text": "was dann glaube ich sechs Jahre oder so supportet wird, ich weiß gar nicht wie lang. Zeig mal"}, {"id": 735, "start": 5810.32, "end": 5826.44, "text": "her. Live Cycle. Hier, fünf Jahre, fünf Jahre. Du kriegst alles, das hast du bei Demian zum"}, {"id": 736, "start": 5826.44, "end": 5832.04, "text": "Beispiel nicht. Bei Demian hast du von Haus aus vielleicht fast genauso langen Release-Cycle,"}, {"id": 737, "start": 5832.04, "end": 5842.88, "text": "aber was anderes. Fünf Jahre kriegst du LTS-Release und das ist schon nice. Zumal man auch sagen"}, {"id": 738, "start": 5842.88, "end": 5848.64, "text": "muss, dass die das relativ ernst nehmen, auch was Security-Updates und so angeht. Das ist"}, {"id": 739, "start": 5848.64, "end": 5852.4, "text": "schon nicht verkehrt und das alles umsonst wohlgemerkt. Bei Red Hat bezahlst du da fett"}, {"id": 740, "start": 5852.4, "end": 5858.24, "text": "Geld für. Klar, bei Red Hat kannst du, wenn du Support-Vertrag hast, auch bei Red Hat"}, {"id": 741, "start": 5858.24, "end": 5863.24, "text": "die Support holen. Das kannst du bei Ubuntu nicht, aber das macht ja eh kaum einer. Zumal"}, {"id": 742, "start": 5863.24, "end": 5867.56, "text": "du, das stimmt ja gar nicht, zumal du bei Red Hat auch nicht den einfachsten Vertrag"}, {"id": 743, "start": 5867.56, "end": 5874.44, "text": "nehmen kannst für 350 Euro, 350 Dollar. Du musst den höherwertigen Support-Vertrag nehmen,"}, {"id": 744, "start": 5874.44, "end": 5884.12, "text": "dass du es überhaupt wagen darfst, Red Hat anzusprechen. Also dieses fünf Jahre LTS-Release"}, {"id": 745, "start": 5884.12, "end": 5888.2, "text": "Geschichten finde ich bei Ubuntu super. Dementsprechend hast du eigentlich auch immer zwei LTS-Versionen"}, {"id": 746, "start": 5888.2, "end": 5894.96, "text": "die aktuell sind. Das ist aktuell 18.04 und 20.04 und 18.04 wie gesagt wird auch noch"}, {"id": 747, "start": 5894.96, "end": 5901.84, "text": "bis 2023 supportet. 16.04 läuft jetzt langsam aus. Also 16.04 macht eigentlich keiner mehr"}, {"id": 748, "start": 5901.84, "end": 5906.0, "text": "was, der noch halbwegs beiverstanden ist. Aber mein Gen tut es immer noch. Auch noch"}, {"id": 749, "start": 5906.0, "end": 5911.76, "text": "nie. Ich glaube 16.04 geht sogar noch ein bisschen länger. Hatten die 16.04 nicht sogar"}, {"id": 750, "start": 5911.76, "end": 5919.2, "text": "noch ein Stückchen länger? Nee, nee passt. Also es ist super, kannst du dich überhaupt"}, {"id": 751, "start": 5919.2, "end": 5924.92, "text": "nicht beschweren. Dazu kommt, dass du die ganze Zeit durchgehend Security-Patches kriegst"}, {"id": 752, "start": 5924.92, "end": 5930.04, "text": "und ich muss auch ehrlich sagen, ich mag die Auswahl an Ubuntu-Paketen, was Aktualität"}, {"id": 753, "start": 5930.04, "end": 5936.64, "text": "angeht, zum Hinterhalt, zum Release und eben auch diese Philosophie, dass man vielleicht"}, {"id": 754, "start": 5936.64, "end": 5941.36, "text": "auch mal ein Auge zudrückt. Dass sie manche Sachen einfacher machen, auch wenn es jetzt"}, {"id": 755, "start": 5941.36, "end": 5948.24, "text": "vielleicht nicht der Open Source-God persönlich abgesegnet hat. Dafür machen sie halt so komische"}, {"id": 756, "start": 5948.24, "end": 5954.8, "text": "Scheiße wie Netplan, was ich nicht verstehe. Aber ansonsten mag ich Ubuntu. Ja zum Beispiel,"}, {"id": 757, "start": 5954.8, "end": 5958.8, "text": "dass die jetzt auch ZFS in Installer eingebaut haben und so was. Eigentlich eine richtig"}, {"id": 758, "start": 5958.8, "end": 5964.16, "text": "coole Geschichte. Wer will übrigens mit der nächsten Ubuntu-Version mal im Stream ausprobieren?"}, {"id": 759, "start": 5964.16, "end": 5982.6, "text": "Also dann 121204 wahrscheinlich. Ja. Vielleicht, oder ist das jetzt schon da? Ach, haben die"}, {"id": 760, "start": 5982.6, "end": 5996.2, "text": "jetzt schon drinne? Ja. Also, müssen wir mal ausprobieren. Also die haben es im Installer"}, {"id": 761, "start": 5996.2, "end": 6002.44, "text": "schon drinne, ZFS, aber ich glaube, die haben noch keine ZFS-Encryption drinne beim aktuellen"}, {"id": 762, "start": 6002.44, "end": 6009.36, "text": "Ubuntu. Und wenn man sich überlegt, wenn man so dumm ist wie manche Behörden in Deutschland"}, {"id": 763, "start": 6009.36, "end": 6016.68, "text": "und Microsoft bezahlt für den Windows XP Extended Support, oder ne, den Windows 7 Extended Support"}, {"id": 764, "start": 6016.68, "end": 6026.56, "text": "ist es, da kann man auch Canonical bezahlen für Extended Support. Also ich finde es gut,"}, {"id": 765, "start": 6026.56, "end": 6034.04, "text": "ganz ehrlich. Wenn es nach mir ging, wir hätten nur überall Ubuntu und gut ist. ECP, was?"}, {"id": 766, "start": 6034.04, "end": 6043.0, "text": "Moment, das kann ich nicht lesen. LS, Ipinlin, ach du große Scheiße, ich hab das sicherlich"}, {"id": 767, "start": 6043.0, "end": 6051.76, "text": "nicht richtig erkannt, wie man das ausspricht. Aber dankeschön für den Prime-Sub. Zipinlin,"}, {"id": 768, "start": 6051.76, "end": 6059.36, "text": "ah, alles klar. Ah, das sind die Streifen, also die L's links und rechts ist für den"}, {"id": 769, "start": 6059.36, "end": 6068.76, "text": "Coolness-Faktor, ne, verstehe, verstehe. Ja, dankeschön für den Sub, easy. Das stimmt,"}, {"id": 770, "start": 6068.76, "end": 6074.0, "text": "die Supportzeiten von Microsoft sind nicht ohne und wisst ihr auch was, die Supportzeiten"}, {"id": 771, "start": 6074.0, "end": 6082.8, "text": "von Apple sind auch nicht ohne. Wenn man sich überlegt, das iPhone SE, das alte, eins,"}, {"id": 772, "start": 6082.8, "end": 6097.24, "text": "ich weiß gar nicht, wann kam das raus. 2016. Das hat immer noch aktuelle Betriebssystem"}, {"id": 773, "start": 6097.24, "end": 6113.28, "text": "Updates bekommen, beim letzten Major-IOS-Release. Also da kannst du dich ehrlich gesagt nicht"}, {"id": 774, "start": 6113.28, "end": 6126.16, "text": "beschweren. Ja, angeblich bekommt das nächste, was ist denn das nächste, iOS 15? Angeblich"}, {"id": 775, "start": 6126.16, "end": 6132.64, "text": "bekommt es das nicht mehr, genau hier stehts ja auch, angeblich bekommt es das nicht mehr,"}, {"id": 776, "start": 6132.64, "end": 6141.48, "text": "aber das ist ja erstmal nur Gerücht. Aber guck mal, hier steht schon S6S und SE nicht"}, {"id": 777, "start": 6141.48, "end": 6151.88, "text": "mehr unterstützt. Das wären ja dann auch quasi 5 Jahre, das ist schon okay. Das ist"}, {"id": 778, "start": 6151.88, "end": 6159.6, "text": "schon okay. 5 Jahre ist in Ordnung. Wenn man sich das anguckt, ich erzähle ja immer gerne"}, {"id": 779, "start": 6159.6, "end": 6163.72, "text": "die Geschichte von diesem komischen ASUS Tablet, was ich mir gekauft habe, was gesagt hat von"}, {"id": 780, "start": 6163.72, "end": 6166.92, "text": "Anfang an und dann haben sie sogar gesagt, wir stellen es jetzt ein, gib nie wieder Firmware"}, {"id": 781, "start": 6166.92, "end": 6171.96, "text": "Updates zu und das Ding war zu unbeliebt, dass es Custom-Roms gegeben hat. Richtig rausgeschmissen"}, {"id": 782, "start": 6171.96, "end": 6178.0, "text": "350 Euro gewesen, hätte ich über einen kleinen iPad gekauft. Android Tablet Paints Champ,"}, {"id": 783, "start": 6178.0, "end": 6183.32, "text": "die einzig guten Android Tablets, die sich wirklich preisleistungsmäßig richtig lohnen,"}, {"id": 784, "start": 6183.32, "end": 6198.64, "text": "sind Fire HD 8 und Fire HD 10 im Angebot. Kannst dir selber Custom-Roms erstellen, könnte"}, {"id": 785, "start": 6198.64, "end": 6208.84, "text": "ich vielleicht, aber mach ich nicht. Das SE funktioniert halt mit iOS 13 irgendwas bezüglich"}, {"id": 786, "start": 6208.84, "end": 6229.8, "text": "Akku nicht mehr so wie vorher. Okay, echt? Alter ich hab irgendwas, Auge, was ist denn"}, {"id": 787, "start": 6229.8, "end": 6241.84, "text": "das? Ich weiß nicht, was da mit dem Akku angeblich ist, aber. Ah, Akku schneller leer. Ja, die"}, {"id": 788, "start": 6241.84, "end": 6249.8, "text": "sagen ja natürlich, die machen das nicht absichtlich, aber ich glaub denen kein Wort. Was genau"}, {"id": 789, "start": 6249.8, "end": 6255.52, "text": "bedeutet mit Werbung bei den Fire HD Tablets, das ist wichtig, du musst immer das mit Werbung"}, {"id": 790, "start": 6255.52, "end": 6261.68, "text": "nehmen, weil das ist billiger. Und wohlgemerkt, nicht kaufen, weil jetzt lohnt es sich nicht,"}, {"id": 791, "start": 6261.68, "end": 6273.6, "text": "viel zu teuer, viel zu teuer. Du musst warten, bis das im Angebot ist. Da gibt es nämlich"}, {"id": 792, "start": 6273.6, "end": 6279.64, "text": "das hier für um die 50 Euro, ne nicht das plus. Also jetzt lohnt sich das nicht, es"}, {"id": 793, "start": 6279.64, "end": 6286.76, "text": "lohnt sich nicht. Da gibt es das hier ungefähr für 50, 60 Euro und das hier für 90 bis 100"}, {"id": 794, "start": 6286.76, "end": 6293.16, "text": "Euro. Dafür lohnt sich das nur dann, ansonsten ist das unsinnig. Und was damit gemeint ist"}, {"id": 795, "start": 6293.16, "end": 6299.48, "text": "es ganz einfach, mit Werbung kriegst du halt Werbung von Amazon auf deinem Tablet. Ohne"}, {"id": 796, "start": 6299.48, "end": 6305.96, "text": "Werbung kriegst du nicht ganz so aufdringliche Werbung von Amazon, aber du musst immer mit"}, {"id": 797, "start": 6305.96, "end": 6314.32, "text": "Werbung nehmen, weil mit Werbung ist billiger und man wird das Tablet eh danach entamazonifizieren."}, {"id": 798, "start": 6314.32, "end": 6319.68, "text": "Das heißt das Tablet ist genau das gleiche mit oder ohne Werbung. Das heißt du musst"}, {"id": 799, "start": 6319.68, "end": 6328.44, "text": "immer mit Werbung nehmen und danach den ganzen Amazonscheiß runterschmeißen. Da gibt es"}, {"id": 800, "start": 6328.44, "end": 6334.6, "text": "fertige Tools für, da gibt es zum Beispiel hier Amazon Fire Toolbox, da gibt es das"}, {"id": 801, "start": 6334.6, "end": 6345.92, "text": "hier für genau, zack, runterladen, installieren, durchklicken und dein Amazon Tablet ist Amazon"}, {"id": 802, "start": 6345.92, "end": 6359.0, "text": "reduziert. Amazon frei ist es nicht wirklich ganz. Also immer das mit Werbung nehmen."}, {"id": 803, "start": 6359.0, "end": 6368.68, "text": "Ich verwende auch ein Fire HD 8, um abends im Bett noch ein bisschen streamen zu gucken."}, {"id": 804, "start": 6368.68, "end": 6379.04, "text": "Einzige Dofe daran ist, du kannst auf einem so entamazonifizierten Tablet schlecht Amazon"}, {"id": 805, "start": 6379.04, "end": 6385.56, "text": "Apps verwenden. Also möchtest du die offizielle Amazon Shopping App oder Prime Video darauf"}, {"id": 806, "start": 6385.56, "end": 6392.0, "text": "verwenden, das ist ein bisschen eklig dann. Dann musst du dich auf jeden Fall einloggen"}, {"id": 807, "start": 6392.0, "end": 6395.8, "text": "mit deinem Amazon Account, was nicht schlimm ist, du hast kein Problem, kannst du machen"}, {"id": 808, "start": 6395.8, "end": 6399.88, "text": "und trotzdem entamazonifizieren. Aber ich wollte mich auf dem Tablet gar nicht überhaupt"}, {"id": 809, "start": 6399.88, "end": 6405.24, "text": "erst mit Amazon Account einloggen. Nein, du brauchst keinen Amazon Account mehr, außer"}, {"id": 810, "start": 6405.24, "end": 6412.36, "text": "du möchtest halt Amazon Apps verwenden. Und die Anmeldung auf dem Tablet geht nicht über"}, {"id": 811, "start": 6412.36, "end": 6416.92, "text": "die Amazon App, sondern über das Amazon Tablet an sich, also sprich, du siehst dann halt"}, {"id": 812, "start": 6416.92, "end": 6425.04, "text": "dein Tablet im Amazon Account aufplotten. Netflix geht auch, ja. Netflix geht sogar Disney Premium"}, {"id": 813, "start": 6425.04, "end": 6432.28, "text": "oder wie das heißt, geht angeblich auch. Du musst vorher mal gucken. Also in der Regel"}, {"id": 814, "start": 6432.28, "end": 6444.36, "text": "kann man sagen, ja das geht mit allen Tablets, aber wenn das ein ganz neues ist, was rauskommt,"}, {"id": 815, "start": 6444.36, "end": 6452.76, "text": "also sprich, wenn die ihre Tablets updaten, dass es eine komplett neue Serie von Amazon"}, {"id": 816, "start": 6452.76, "end": 6458.6, "text": "Tablets gibt, dann würde ich mich vorher mal schlaumachen, ob es geht. By the way, ist"}, {"id": 817, "start": 6458.6, "end": 6464.96, "text": "Twitch nicht Amazon? Weiß gar nicht, ob die das so scharf finden, wenn ich das hier breit"}, {"id": 818, "start": 6464.96, "end": 6470.56, "text": "rede. Okay, wir machen das wahrscheinlich nicht im Stream, aber ihr könnt es ja machen,"}, {"id": 819, "start": 6470.56, "end": 6477.68, "text": "also verboten ist es auf jeden Fall nicht. Also man braucht keinen Amazon Account, wenn"}, {"id": 820, "start": 6477.68, "end": 6482.72, "text": "man keine Amazonsachen verwenden will. Also ich benutze meinen Fire HD 8 auch komplett"}, {"id": 821, "start": 6482.72, "end": 6493.0, "text": "ohne Amazon Account. Ja, solange der Kram nicht ins Internet kann oder besser umgedreht"}, {"id": 822, "start": 6493.0, "end": 6519.08, "text": "ist, damit keiner aus dem Internet dran kommt. Ja gut, solange man es soweit erkennt. Da bin"}, {"id": 823, "start": 6519.08, "end": 6522.6, "text": "ich mal gespannt. Wisst ihr, wie das laufen wird? Die Hersteller sind ja erfinderisch"}, {"id": 824, "start": 6522.6, "end": 6527.76, "text": "bei sowas. Wisst ihr, wie das laufen wird? Wenn es eine EU-Verordnung gibt, okay, da"}, {"id": 825, "start": 6527.76, "end": 6531.68, "text": "gibt es wahrscheinlich eh wieder schon eingebaut 500 Hintertüren, aber mal angenommen, die"}, {"id": 826, "start": 6531.68, "end": 6536.84, "text": "Hersteller sind wirklich verpflichtet dazu, Updates 5 Jahre anzubieten. Die werden genau"}, {"id": 827, "start": 6536.84, "end": 6543.64, "text": "das Allermindest machen, was sie machen müssen, dass sie diese Vereinbarung erfüllen sollen."}, {"id": 828, "start": 6543.64, "end": 6548.4, "text": "Wenn es bedeutet, man bietet Updates an, dann lassen sie dich einmal im Monat eine Readme"}, {"id": 829, "start": 6548.4, "end": 6557.12, "text": "runterladen, wo drin steht Performance Improvements und sie haben irgendwo was gemacht, eine Einspec"}, {"id": 830, "start": 6557.12, "end": 6564.84, "text": "oder so. Die werden das Allernötigste machen, was irgendwie möglich ist. Ich glaube nicht,"}, {"id": 831, "start": 6564.84, "end": 6571.24, "text": "dass das erfolgreich sein wird. Es ist genauso wie alle Handys sollen den gleichen Stecker"}, {"id": 832, "start": 6571.24, "end": 6580.28, "text": "machen. Hat ja auch nicht funktioniert. Magst du eigentlich Cringe-Werbung? Oh, nee. Ich"}, {"id": 833, "start": 6580.28, "end": 6594.2, "text": "cringe nicht so gern. Wenn ich hier auf Twitch bin, muss ich schon oft genug cringen. Ist"}, {"id": 834, "start": 6594.2, "end": 6620.84, "text": "Cringe nicht das Jugendwort des Jahres? Keck! Keck! Ernsthaft? Keck war das in der Abstimmung?"}, {"id": 835, "start": 6620.84, "end": 6649.28, "text": "Warum nur Keck und warum nicht KeckW? Okay, Jugendwort 2020."}, {"id": 836, "start": 6649.28, "end": 6664.88, "text": "Lost? Hä? Das ist doch nichts Neues. Lost ist doch nur wirklich nichts Neues. Also Leute,"}, {"id": 837, "start": 6664.88, "end": 6676.64, "text": "Digga, das fühle ich ja mal gar nicht. Richtiger Schmutz. Lost, Alter. Digga. Ne. Cringe ist"}, {"id": 838, "start": 6676.64, "end": 6687.04, "text": "auch nichts. Aber Cringe ist ein gutes Wort. Lost sagt einfach nur. Digga, Alter. Digga."}, {"id": 839, "start": 6687.04, "end": 6701.0, "text": "Schmutz, Digga. Also Lost fühle ich nicht. Ne. Haben sie da für ein Bild gemacht, ey?"}, {"id": 840, "start": 6701.0, "end": 6706.48, "text": "Das soll absichtlich nicht hip wirken, um wieder hip zu sein. Das kriegst du gern auch"}, {"id": 841, "start": 6706.48, "end": 6724.44, "text": "für die Boomer. Kriegst sogar noch eine Erklärung dabei, was Lost bedeutet. Digga, Alter. Richte"}, {"id": 842, "start": 6724.44, "end": 6729.48, "text": "Boomer-Erklärung, ja. Es hat doch tatsächlich jemand in meinem letzten Video geschrieben."}, {"id": 843, "start": 6729.48, "end": 6739.84, "text": "Das Video hätte Boomer-Vibes. Könnt ihr euch das vorstellen? Könnt ihr euch das vorstellen?"}, {"id": 844, "start": 6739.84, "end": 6753.88, "text": "Der hat, der hat, das muss ich jetzt mal kurz. Moment. Wo ist es? Wo ist es? Sack. Hier,"}, {"id": 845, "start": 6753.88, "end": 6762.88, "text": "guck mal. No offense, Max. Aber das Video hat schon ein bisschen Boomer-Vibes. Was waren"}, {"id": 846, "start": 6762.88, "end": 6792.8, "text": "daran Boomer-Vibes? Ne, ne, ne. Gut, was auch immer. Die sind nicht dank genug, die Memes."}, {"id": 847, "start": 6792.8, "end": 6805.76, "text": "Ja, das wird sein. Die fühlt er halt nicht so. Lit ist auch noch mal angesagt, oder?"}, {"id": 848, "start": 6805.76, "end": 6813.52, "text": "Was gab's denn? Was gab's denn zur Auswahl für eine Liste? Beste soehr als für Hybrid-Apps"}, {"id": 849, "start": 6813.52, "end": 6823.4, "text": "Developed. Frag's mich was, ich hab noch nicht eine App Developed für Android oder so. Das"}, {"id": 850, "start": 6823.4, "end": 6827.08, "text": "einzige höchste Gefühl, was ich gehört habe, waren PWAs. Aber allgemein mein Lieblings-Development-OS"}, {"id": 851, "start": 6827.08, "end": 6834.88, "text": "ist Linux. Liste der Jugendwörter. Okay, zeig mal her. Ne, was gab's denn für Kandidaten?"}, {"id": 852, "start": 6834.88, "end": 6854.12, "text": "Das sind die Top 10. Okay. Schabernack. Also, ich bin ja dank Twitter, YouTube und dem einen"}, {"id": 853, "start": 6854.12, "end": 6863.64, "text": "oder anderen Azubi auf der Arbeit und solchen Sachen zumindest nicht ganz weit entfernt."}, {"id": 854, "start": 6863.64, "end": 6874.32, "text": "Ich bin noch etwas im Bilde, was Jugendwörter angeht. Aber Schabernack? Ja, das mag sein,"}, {"id": 855, "start": 6874.32, "end": 6880.04, "text": "dass die sich über ein Abenteuer lustig machen, aber benutzen tut das keiner oft. Das klingt"}, {"id": 856, "start": 6880.04, "end": 6895.84, "text": "mal nach Boomer-Wart. So. Mittwoch. Ein Frosch-Meme. Stimmt. Man darf das Ding ja nicht so nennen,"}, {"id": 857, "start": 6895.84, "end": 6899.84, "text": "wie es ist, weil das ist ja auch schon Hate Speech mittlerweile. Hab ich vergessen. Sauftrag."}, {"id": 858, "start": 6899.84, "end": 6908.4, "text": "Wild. Okay, Wild stimmt. Wild ist tatsächlich oft. Lost auch. No Front. Okay. No Front ist"}, {"id": 859, "start": 6908.4, "end": 6918.52, "text": "mittlerweile das neue No Homo. Früher hat ja jeder, der was geschrieben hat, was irgendwie"}, {"id": 860, "start": 6918.52, "end": 6926.48, "text": "positiv war, hat dabei geschrieben No Homo. Hey Max, gutes Video. No Homo. Chat heute"}, {"id": 861, "start": 6926.48, "end": 6932.24, "text": "wieder richtig schlau. No Homo. Nice Pose. No Homo. Also, früher hat man immer No Homo"}, {"id": 862, "start": 6932.24, "end": 6943.04, "text": "geschrieben und das ist jetzt genau das Gegenteil davon. No Front. Front in Form von Frontal"}, {"id": 863, "start": 6943.04, "end": 6960.4, "text": "und Angreifen und sonst was. Front. Front halt. Frontal 21. Köpfelspieß. Das kenne"}, {"id": 864, "start": 6960.4, "end": 6968.8, "text": "ich sogar. Das habe ich gesehen, das Video. Das Video habe ich irgendwann gesehen, wo"}, {"id": 865, "start": 6968.8, "end": 6975.0, "text": "er erzählt hat, schön Köpfelspieß oder irgendwie sowas. Okay. Digga. Ja, das ist"}, {"id": 866, "start": 6975.0, "end": 6981.6, "text": "ja nichts Neues. War ganz nach vorne abgesehen, die sind ziemlich alt. Digga ist so ein Ding,"}, {"id": 867, "start": 6981.6, "end": 6989.6, "text": "das erzählen die Leute die letzten vier, fünf Jahre schon. Digga. Und weil man nicht"}, {"id": 868, "start": 6989.6, "end": 6995.64, "text": "Digga sagen darf, sondern Digga muss das sein. Digga. Also quasi wie jemand, der gräbt"}, {"id": 869, "start": 6995.64, "end": 7004.84, "text": "auf Englisch. Ja. Ein Digga. Und nicht zu verwechseln mit Dicker oder so. Digga. So,"}, {"id": 870, "start": 7004.84, "end": 7011.0, "text": "also was haben wir sonst noch? Cringe. Und was? Mashallah. Ach so, ja gut. Es gibt ja"}, {"id": 871, "start": 7011.0, "end": 7020.24, "text": "immer mehr arabische Aussprüche hier. Und das erinnert mich ein bisschen an, es gibt"}, {"id": 872, "start": 7020.24, "end": 7033.0, "text": "Chicken Masala. Das ist so Hähnchen mit so rotem scharfen Zeug dabei. Exzellent. Ja,"}, {"id": 873, "start": 7033.0, "end": 7041.88, "text": "Freund ist Digga. Immer Digga. Egal was. Cringe. Cringe Digga. Ja, auf, auf, auf"}, {"id": 874, "start": 7041.88, "end": 7058.84, "text": "mein Nacken und so ist nicht mal angesagt. Das benutzt man glaube ich nicht mehr. Es"}, {"id": 875, "start": 7058.84, "end": 7066.32, "text": "gibt noch viel mehr solcher Dinger. Wenn ich es höre, fallen sie mir ein. Ansonsten,"}, {"id": 876, "start": 7066.32, "end": 7071.92, "text": "ich benutze sie ja nicht täglich. Ich bin ja mit 36 jetzt ja auch nicht mehr derjenige"}, {"id": 877, "start": 7071.92, "end": 7082.36, "text": "der täglich da in Jugenddiskussion präsent ist, ja. So, ich gehe jetzt aber gleich auf."}, {"id": 878, "start": 7082.36, "end": 7088.4, "text": "Ich küsse deine Augen. Genau. Das ist auch so ein Ding. Warum auch ausgerechnet die Augen?"}, {"id": 879, "start": 7088.4, "end": 7113.24, "text": "Ich weiß es nicht. Ich weiß es nicht. No homo aber ne. No homo hoffe ich. So. Ja wunderbar."}, {"id": 880, "start": 7113.24, "end": 7124.16, "text": "Ja, es gab hier eh keinen offiziellen Stream. Das war ja alles nur nicht existent. Dieser"}, {"id": 881, "start": 7124.16, "end": 7135.16, "text": "Stream, den gab es ja gar nicht. Sagen Homos auch no homo. Ne. Der Friseur, der sagt irgendwie,"}, {"id": 882, "start": 7135.16, "end": 7140.0, "text": "der Friseur, dem war mal eine Zeit lang sein Lieblings, sein Lieblingswort war homo Fürst,"}, {"id": 883, "start": 7140.0, "end": 7145.52, "text": "das weiß ich noch. Ich kann mich noch richtig dran erinnern, der homo Fürst. Kennt ihr dieses"}, {"id": 884, "start": 7145.52, "end": 7154.96, "text": "Video von dieser, von dieser einen, von dieser einen Oma? Du homo Fürst. Jetzt muss ich"}, {"id": 885, "start": 7154.96, "end": 7178.12, "text": "mal kurz raussuchen. Genau. Die hier. Die Linie 140 hat ja angeblich Verspätung. Fick"}, {"id": 886, "start": 7178.12, "end": 7204.28, "text": "dich weg du homo Fürst. Du homo Fürst. Du homo Fürst. Du homo Fürst. Ich weiß es"}, {"id": 887, "start": 7204.28, "end": 7224.24, "text": "ist schon gestellt auf jeden Fall, aber ich find den Oma so geil. Du homo Fürst. Die"}, {"id": 888, "start": 7224.24, "end": 7231.44, "text": "sagt das auch schon so geil. Fick dich weg du homo Fürst. Sonst gastriere ich dir die"}, {"id": 889, "start": 7231.44, "end": 7238.12, "text": "Eier. Na gut. Irgendwie ist mir das egal. Das war mal so die, die Standard-Krise der Friseur"}, {"id": 890, "start": 7238.12, "end": 7245.84, "text": "mal eine Zeit lang gesagt hat. Flexen ist das Jugendwort. Was? Stimmt, flexen ist,"}, {"id": 891, "start": 7245.84, "end": 7251.28, "text": "flexen ist auch sehr angesagt. Und wenn man was sagt, wenn man was sagt, was jemand nicht"}, {"id": 892, "start": 7251.28, "end": 7261.92, "text": "gefällt, dann ist dann weird flex. Also quasi ein, ein merkwürdiger flex. Hast du eigentlich"}, {"id": 893, "start": 7261.92, "end": 7265.84, "text": "Urlaub morgen aufstehen streamen? Ich hab Urlaub seit einem Monat schon. Bis nächstes"}, {"id": 894, "start": 7265.84, "end": 7281.48, "text": "Jahr noch. Weird flex, but okay. Genau das musst du machen. Homo Fürst. Die Oma ist"}, {"id": 895, "start": 7281.48, "end": 7298.0, "text": "so geil. Was der Friseur macht, der macht Videos. Ups. Der macht Videos. Zelt euch mal vor."}, {"id": 896, "start": 7298.0, "end": 7303.52, "text": "Okay, ich hab wieder eine Woche her, aber der hat, der hat wirklich Videos gemacht."}, {"id": 897, "start": 7303.52, "end": 7325.4, "text": "Guck mal, der hat sogar den eigenen Wiki-Eintrag. Ist ein deutscher YouTuber. Was der Famine"}, {"id": 898, "start": 7325.4, "end": 7338.36, "text": "1000? Das ist auch nicht aktuell, oder? Wer ist denn da vorne? Was? Wer ist das? Wer"}, {"id": 899, "start": 7338.36, "end": 7345.32, "text": "ist Contort? Achso, das ist irgendwelche Musik. Und wer ist A-Kiwa-Squip? Okay, Kron, kenn"}, {"id": 900, "start": 7345.32, "end": 7355.84, "text": "ich? Der Voice Kids. Okay, er ist PeetSmeet. BibisBeautyPalace. Okay, spielender Spielzeug,"}, {"id": 901, "start": 7355.84, "end": 7360.04, "text": "MySpaß. PromiFlash. Kenn ich auch nicht. Rammstein. Freak, kenn ich auch nicht. Ach,"}, {"id": 902, "start": 7360.04, "end": 7369.12, "text": "du große Scheiße. Äh, der sagt mir irgendwas. Wer ist denn das? Ach, der Concrafter ist"}, {"id": 903, "start": 7369.12, "end": 7379.52, "text": "das, genau. Wo bin ich? Und wo bin ich? Da ist er. Leute, da ist er. Ich bin auf Platz"}, {"id": 904, "start": 7379.52, "end": 7394.48, "text": "646. Concrafter ist der mit der Kohle-Pizza, ne? Ich bin hinter Computer-Bild. Okay, es"}, {"id": 905, "start": 7394.48, "end": 7400.76, "text": "wird Zeit, Leute. Ich bin nicht weit weg. Guck mal, ich bin nicht weit weg. Wie viele"}, {"id": 906, "start": 7400.76, "end": 7414.36, "text": "Aufrufe machen die so? Okay, die haben sehr durchwachsene Aufrufe. Da könnte ich aufschließen."}, {"id": 907, "start": 7414.36, "end": 7425.0, "text": "Ey, ich muss Computer-Bild überholen, ne? Und danach Mercedes-Benz Deutschland, ne? Oh,"}, {"id": 908, "start": 7425.0, "end": 7433.8, "text": "Mann. Kann man da sonst noch? Ich kenn, ich kenn davon kaum jemand. Wer ist das denn alles?"}, {"id": 909, "start": 7433.8, "end": 7443.96, "text": "Was soll das denn sein? Okay, ich kenn das, kenn das alles nicht. Dom Tendo, oder? Ich"}, {"id": 910, "start": 7443.96, "end": 7452.52, "text": "kenn auch nicht. Banger-Channel. Okay, der sagt mir was vom Namen her. Kenn ich auch"}, {"id": 911, "start": 7452.52, "end": 7459.92, "text": "nicht. Irgendwelche Hip-Hop-Dinger. Kenn ich, kenn ich, kenn ich nicht. Ist ja auch ein"}, {"id": 912, "start": 7459.92, "end": 7465.92, "text": "Hip-Hop-Tour. Haben wir bloß irgendwelche Hip-Hop-Gangster-Mans da? Singen mit mir Kinder-Lieder."}, {"id": 913, "start": 7465.92, "end": 7474.88, "text": "MTV-Cast. Ach, du große Scheiße. Germany's Next Topman und der Unge am Stab. Freiheit"}, {"id": 914, "start": 7474.88, "end": 7481.96, "text": "für Unge. So, den kenn ich auch. Das sagt mir auch irgendwas. Die sagen mir auch noch"}, {"id": 915, "start": 7481.96, "end": 7487.6, "text": "was. Kenn ich nicht, kenn ich nicht. Die Lochis seit, wusstet ihr? Jetzt mal hier. Die Facts."}, {"id": 916, "start": 7487.6, "end": 7497.6, "text": "Wusstet ihr, dass mir die Lochis seit 2000, keine Ahnung, 10 oder so Folgen auf YouTube,"}, {"id": 917, "start": 7497.6, "end": 7512.4, "text": "ja? Ich, die Lochis haben mich abonniert. Jetzt, jetzt, jetzt raus. Ach, kommt mal, der"}, {"id": 918, "start": 7512.4, "end": 7521.56, "text": "ist der, den kenn ich. Wenigstens meinen, den ich persönlich kenn hier. Boah, der ist"}, {"id": 919, "start": 7521.56, "end": 7527.48, "text": "aber explodiert. Den kenn ich auch so, um drei Ecken persönlich, aber der ist echt krass"}, {"id": 920, "start": 7527.48, "end": 7532.52, "text": "explodiert dann, ja. Den hab ich gar nicht so mitgekriegt. Gut, ich guck mir auch keinen"}, {"id": 921, "start": 7532.52, "end": 7546.4, "text": "Minecraft an. Ach, du große Scheiße, den gibt's ja auch noch. Das kenn ich nicht. Das"}, {"id": 922, "start": 7546.4, "end": 7557.4, "text": "ist der mit den Autos, den kenn ich. Die Klinik am Südring. Ah ja, alles klar. Hab ich nie"}, {"id": 923, "start": 7557.4, "end": 7567.76, "text": "gerne geguckt. Okay, jetzt kommen, jetzt kommen langsam mal ein paar Leute, von denen hab ich"}, {"id": 924, "start": 7567.76, "end": 7575.36, "text": "zumindest schon mal was gehört. Mein Herz schlägt Schlager, oy oy oy oy oy. Gromme."}, {"id": 925, "start": 7575.36, "end": 7584.96, "text": "Schaut euch mal vor, ein Java-Programmiere unter den Top 90. Sachen gibt's. Sollte eigentlich"}, {"id": 926, "start": 7584.96, "end": 7597.72, "text": "nicht verboten sein. HD Corleone, was ist denn das für einer? Ach, Musik-Channel, ok."}, {"id": 927, "start": 7597.72, "end": 7605.24, "text": "Ich dachte schon, das ist dieser Typ, den mal Alt-R4-Games verarscht hat. Kenn ich"}, {"id": 928, "start": 7605.24, "end": 7616.16, "text": "sonst? Ich sag, ich kenn keinen. Ok, die sagen mir vom Namen her irgendwas. Keine Ahnung, wer das ist."}, {"id": 929, "start": 7616.16, "end": 7620.84, "text": "Alter, ich kenn mich überhaupt nicht mehr aus auf YouTube Deutschland. Ja, weh, ja, Gott, weh,"}, {"id": 930, "start": 7620.84, "end": 7629.84, "text": "es ist ein, den ich auch noch selbst kenne, ja. Allerdings noch aus Zeiten, wo er noch nicht 5"}, {"id": 931, "start": 7629.84, "end": 7648.52, "text": "Meter Bizeps hat. Lebst du im Wald? Ja, kommt mir so vor. Naja, gut, was auch immer, ist ja auch egal."}, {"id": 932, "start": 7648.52, "end": 7653.8, "text": "Was steht denn da eigentlich zu mir drin? Gibt's mich da auch? Im Influencer gibt's mich auch im"}, {"id": 933, "start": 7653.8, "end": 7662.56, "text": "Influencer-Wiki. Wenn's den Friseur da gibt, soll's mich auch geben. So, und wie sucht man sich da?"}, {"id": 934, "start": 7662.56, "end": 7674.2, "text": "Ey, mich gibt's da nicht. Anzeige ist raus. Sauerei. Gut, ich mein, ich mach seit 6 Jahren"}, {"id": 935, "start": 7674.2, "end": 7682.04, "text": "keine Videos mehr richtig, aber trotzdem, hey. Zumindest mal so einen Eintritt mit so einem Satz"}, {"id": 936, "start": 7682.04, "end": 7688.2, "text": "könnte man doch machen, oder? Sucht sich in der Neste, mein, ich bin ja trotzdem drin."}, {"id": 937, "start": 7688.2, "end": 7694.12, "text": "YouTube-Ranking."}, {"id": 938, "start": 7694.12, "end": 7715.84, "text": "Nein, gibt's? Oh, doch. Ach, tatsächlich. Aber da steht ja gar nix. Empfohlenes Video. What?"}, {"id": 939, "start": 7724.12, "end": 7735.0, "text": "He, wisst ihr, was so witzig ist? Ich hab seit 6 Jahren, wie gesagt, ich mache seit ungefähr"}, {"id": 940, "start": 7735.0, "end": 7739.4, "text": "6 Jahren keine Videos mehr richtig, ja. Und ich hab auch seit 6 Jahren keine Abos bekommen."}, {"id": 941, "start": 7739.4, "end": 7744.88, "text": "Das ist schon geil, ne? Ich hab immer mal wieder zwischendrin angefangen, dann hab ich die Abos,"}, {"id": 942, "start": 7744.88, "end": 7749.8, "text": "die ich verloren hab, wieder aufgeholt. Und dann hab ich wieder aufgehört,"}, {"id": 943, "start": 7749.8, "end": 7758.44, "text": "dann hab ich die alle Abos verloren, ne? Ähnliche YouTube-Stars. Julien Bam. Simon Tessio, come on, bro."}, {"id": 944, "start": 7758.44, "end": 7774.96, "text": "Alles klar. Hättest du nie aufgehört, wärst du jetzt 1 Safecoin. 1 garantiert nicht,"}, {"id": 945, "start": 7774.96, "end": 7784.44, "text": "aber bestimmt nicht 609. Aber ganz ehrlich, hat ja seinen Grund gehabt, ja. Hat ja alles seinen"}, {"id": 946, "start": 7784.44, "end": 7790.0, "text": "Grund gehabt. Und ist ja jetzt irgendwo auch noch so, dass ich einfach keine Games hab,"}, {"id": 947, "start": 7790.0, "end": 7800.84, "text": "wo ich großartig was zu machen könnte. Ja, Marian, das ist eigentlich total easy. Also,"}, {"id": 948, "start": 7800.84, "end": 7807.92, "text": "wir sind die Games ausgegangen und letztendlich auch irgendwo die Motivation, YouTube-mäßig was"}, {"id": 949, "start": 7807.92, "end": 7815.84, "text": "zu machen. Weil ich halt auch keine Themen mehr hatte, die sich so ergeben haben, ja. Aber"}, {"id": 950, "start": 7815.84, "end": 7819.84, "text": "Battlefield und Call of Duty, da haben sich halt permanent irgendwelche Updates, irgendwelche"}, {"id": 951, "start": 7819.84, "end": 7824.76, "text": "Themen ergeben. Und ich hatte dann irgendwie auch keinen Bock mehr, mir die ganzen Sachen aus den"}, {"id": 952, "start": 7824.76, "end": 7829.04, "text": "Fingern zu saugen. Das heißt, ich werd's jetzt anders machen. Ich hab jetzt ja gerade wieder ein"}, {"id": 953, "start": 7829.04, "end": 7839.48, "text": "bisschen angefangen. Noch Kontakt zum Kaboom, ja. Ab und zu mal. Ich habe jetzt gerade ein bisschen"}, {"id": 954, "start": 7839.48, "end": 7845.48, "text": "angefangen wieder und ich werde es versuchen, jetzt ein bisschen anders zu machen. Ich versuche ein"}, {"id": 955, "start": 7845.48, "end": 7854.32, "text": "bisschen mehr, quasi ein bisschen mehr anderes Zeug zu etablieren, ja. Weil ich kann halt nicht"}, {"id": 956, "start": 7854.32, "end": 7859.6, "text": "zu Call of Duty was erzählen, wenn ich das selbst nicht spiele und es mir auch am Arsch"}, {"id": 957, "start": 7859.6, "end": 7868.28, "text": "vorbeigeht, ja. Was ich noch machen werde, ich werd mich mal ab und zu über aktuelle Sachen"}, {"id": 958, "start": 7868.28, "end": 7872.28, "text": "auslassen, was da so passiert. Zum Beispiel wollte ich mich jetzt auch mal auslassen,"}, {"id": 959, "start": 7872.28, "end": 7876.96, "text": "wieder mal über diese ganze Skill-Based-Matchmaking-Reverse-Boosting-Geschichte."}, {"id": 960, "start": 7876.96, "end": 7883.84, "text": "Und das werd ich diesmal richtig trickreich machen. Ich werd mir ein paar Sachen,"}, {"id": 961, "start": 7883.84, "end": 7887.36, "text": "ich werd mir ein paar Aussagen raussuchen von bekannten YouTube-Leuten, die sich dazu"}, {"id": 962, "start": 7887.36, "end": 7894.32, "text": "auch geäußert haben. Und da werd ich dann erzählen, dass ich das überhaupt nicht so"}, {"id": 963, "start": 7894.32, "end": 7900.56, "text": "seh. Wobei das schwierig ist. Wahrscheinlich seh ich es nämlich genauso, aber gut. Mach"}, {"id": 964, "start": 7900.56, "end": 7904.2, "text": "doch ein bisschen Programmier-Stellzen. Nee, das kann ich nicht machen auf YouTube. Also,"}, {"id": 965, "start": 7904.2, "end": 7908.72, "text": "sag mal so, das höchste der Gefühle, was ich auf YouTube machen kann, ist wirklich sowas hier."}, {"id": 966, "start": 7908.72, "end": 7915.2, "text": "Also das höchste der Gefühle, was ich technisch machen kann, ist sowas hier in der Richtung."}, {"id": 967, "start": 7915.2, "end": 7928.04, "text": "Auch wenn das nicht viele geguckt haben, die Watch-Time war richtig gut. Man hat's ja"}, {"id": 968, "start": 7928.04, "end": 7934.84, "text": "glaub ich sicher, Battlefield-Video gemacht, bam, 30k. Instant-30k-Aufrufe einfach. Weißt"}, {"id": 969, "start": 7934.84, "end": 7941.4, "text": "du, ein Jahr lang nix hochgeladen, machst ein Battlefield-Video, 30k-Aufrufe. Bam. Instant-30k,"}, {"id": 970, "start": 7941.4, "end": 7952.48, "text": "easy. Ansonsten machst du irgendwelche anderen Sachen. Also, ist schwierig. Das ist auch das"}, {"id": 971, "start": 7952.48, "end": 7962.04, "text": "Problem. Ich muss jetzt mal gucken, ob ich irgendwas finde. Ob ich irgendwas finde,"}, {"id": 972, "start": 7962.04, "end": 7972.52, "text": "was sich halt, wo sich halt neue Themen und so auch irgendwie von selbst ergeben, ja. Ich"}, {"id": 973, "start": 7972.52, "end": 7978.96, "text": "kann jetzt nicht anfangen, da Hardcore-Technik-Krams zu machen. Das wollen von 270.000 Abos,"}, {"id": 974, "start": 7978.96, "end": 7992.24, "text": "wollen das 260.000 halt nicht sehen. Ein BF5-Video hätte safe weniger Views bekommen, ja klar."}, {"id": 975, "start": 7992.24, "end": 8001.64, "text": "Alter, du kannst dir nicht vorstellen, ich hoffe insgeheim wirklich, also extrem extrem drauf,"}, {"id": 976, "start": 8001.64, "end": 8014.36, "text": "dass Venis Unleashed gut ankommt, aber ich hab wenig Hoffnung. Ich hab da wenig Hoffnung. Es"}, {"id": 977, "start": 8014.36, "end": 8019.04, "text": "ist so still, es ist so still drum und ich weiß auch nicht, wie viele Leute es noch wirklich"}, {"id": 978, "start": 8019.04, "end": 8026.36, "text": "interessiert. Also, das müsste schon richtig einschlagen und auch eine stabile Player-Base"}, {"id": 979, "start": 8026.36, "end": 8035.48, "text": "letztendlich haben und ja. Wie steht es denn zu aktuellen Spielen? Valorant, Cyberpunk,"}, {"id": 980, "start": 8035.48, "end": 8041.6, "text": "etc. Cyberpunk hab ich einen ganz großen Bogen drum gemacht, weil mir klar war, noch bevor das"}, {"id": 981, "start": 8041.6, "end": 8049.28, "text": "raus, ich hab's ja auch im Stream gesagt, dass das Ding unfertige Haufen an unzusammenhängenden"}, {"id": 982, "start": 8049.28, "end": 8054.6, "text": "Dingern sein wird, wobei Cyberpunk, wenn man mal die Open-World-Aspekte weglässt, wohl auch"}, {"id": 983, "start": 8054.6, "end": 8058.92, "text": "von der Story her und allem anderen ein recht gutes Game ist, wenn man den Reviews glaubt,"}, {"id": 984, "start": 8058.92, "end": 8064.76, "text": "aber der Open-World-Aspekt halt überhaupt nicht richtig gut funktioniert. Aber wie gesagt,"}, {"id": 985, "start": 8064.76, "end": 8068.08, "text": "deshalb hab ich einen riesen Bogen drum gemacht, es war von Anfang an klar, dass das höchst"}, {"id": 986, "start": 8068.08, "end": 8081.08, "text": "wahrscheinlich nix wird. Overwatch, nee, Overwatch hat Blizzard verkackt. Das Problem an Cold War ist"}, {"id": 987, "start": 8081.08, "end": 8088.56, "text": "tatsächlich zum coolsten Teil Skill-Based Matchmaking, was im Public Quickplay nix zu"}, {"id": 988, "start": 8088.56, "end": 8095.68, "text": "suchen hat. Man könnte es doch so gut machen, man könnte es so gut machen. Man macht einen"}, {"id": 989, "start": 8095.68, "end": 8106.88, "text": "Ranking-Modus und man macht einen Public Bash-Modus, ganz einfach. Warum haben die nicht stattdessen"}, {"id": 990, "start": 8106.88, "end": 8111.28, "text": "Witcher 4 gemacht? Wahrscheinlich weil sie keinen Bock hatten und keine Ideen für Witcher 4."}, {"id": 991, "start": 8111.28, "end": 8118.0, "text": "Ich gehe aber davon aus, dass Witcher 4 kommen wird. Wenn die Cyberpunk überleben, könnte ich mir"}, {"id": 992, "start": 8118.0, "end": 8123.96, "text": "vorstellen, dass sie tatsächlich versuchen, das wieder gut zu machen und wo sie wissen,"}, {"id": 993, "start": 8123.96, "end": 8129.68, "text": "dass sie noch mal eine fette Bank, wie heißt denn das so? Bredt in der Bank? Nee, wie heißt"}, {"id": 994, "start": 8129.68, "end": 8135.68, "text": "man das? Wo sie halt einen dicken Bonus haben, dass sie vielleicht einen echten Witcher 4"}, {"id": 995, "start": 8135.68, "end": 8147.16, "text": "probieren. Und ich muss euch ehrlich sagen, so sehr der Cyberpunk-Fail die Leute ärgert,"}, {"id": 996, "start": 8147.16, "end": 8151.08, "text": "das kann ich verstehen. Ich meine, das Game ist total unfertig, die NPCs ducken sich und machen"}, {"id": 997, "start": 8151.08, "end": 8162.36, "text": "nix. Aber eins muss man sagen, die Stonks-Leute von CD Projekt Red, die haben bei mir echt einen"}, {"id": 998, "start": 8162.36, "end": 8188.32, "text": "Pluspunkt gesammelt und zwar, die haben gesagt, dass, weiß nicht wo es steht, zumindest haben"}, {"id": 999, "start": 8188.32, "end": 8194.64, "text": "die gesagt, dass die ihren Entwicklern trotzdem, dass das Spiel jetzt nicht so gut angekommen ist,"}, {"id": 1000, "start": 8194.64, "end": 8203.4, "text": "ihren Review-Score-Bonus bezahlen, weil sie erkannt haben, dass das ein Management-Problem ist."}, {"id": 1001, "start": 8203.4, "end": 8213.04, "text": "Ey, das hörst du sonst nirgendwo, ja? Genau, hier steht's. Also sprich, alle die da dran"}, {"id": 1002, "start": 8213.04, "end": 8217.52, "text": "programmiert haben, bekommen ihren Bonus unabhängig vom Review-Score. Und mal ganz im Ernst,"}, {"id": 1003, "start": 8217.52, "end": 8225.4, "text": "die haben es auch wirklich verdient. Ich meine, die sind gefühlt das komplette Ja im Überstunden-Modus"}, {"id": 1004, "start": 8225.4, "end": 8236.36, "text": "und durch Entscheidungen, die sie nicht beeinflussen können oder zumindest nichts dran ändern können"}, {"id": 1005, "start": 8236.36, "end": 8243.68, "text": "letztendlich, hätten sie jetzt quasi auch noch weniger bekommen, obwohl sie mehr geleistet haben."}, {"id": 1006, "start": 8243.68, "end": 8252.52, "text": "Also das finde ich voll, das finde ich top, ja? Natürlich, na klar, dreimal dürft ihr raten,"}, {"id": 1007, "start": 8252.52, "end": 8256.0, "text": "wer den Scheiß bezahlt. Letztendlich die Typen, die pre-ordert haben und die das Spiel gekauft."}, {"id": 1008, "start": 8256.0, "end": 8266.76, "text": "Natürlich, aber die Entwickler haben es verdient. Also die Entwickler haben es auf jeden Fall"}, {"id": 1009, "start": 8266.76, "end": 8274.84, "text": "verdient. Und da war eine gehörige Portion, das war nicht Unfähigkeit der Entwickler. Jeder"}, {"id": 1010, "start": 8274.84, "end": 8278.36, "text": "trägt letztendlich aber seinen Teil zu bei, ja? Also da sind bestimmt auch ein paar Sachen drin,"}, {"id": 1011, "start": 8278.36, "end": 8281.24, "text": "die man da schöner machen können. Aber zum größten Teil war das eine bisschen"}, {"id": 1012, "start": 8281.24, "end": 8284.04, "text": "Stonks-Entscheidung, um das für diesen Weihnachten noch rauszubringen."}, {"id": 1013, "start": 8284.04, "end": 8293.96, "text": "Kill-Moves, das wird dir keiner so genau sagen können. Man kann so ein paar Sachen vermuten,"}, {"id": 1014, "start": 8293.96, "end": 8300.8, "text": "ja? Dass halt vieles in das Game reingeklatscht wurde, dass es halt featuremäßig besser da steht,"}, {"id": 1015, "start": 8300.8, "end": 8306.36, "text": "aber halt komplett unoptimiert. Ja, wenn du was programmierst, hast du ja immer die Wahl"}, {"id": 1016, "start": 8306.36, "end": 8312.48, "text": "dazwischen, ok, ich feil da jetzt ein bisschen dran rum, dass es, sagen wir mal, schön ist und gut"}, {"id": 1017, "start": 8312.48, "end": 8317.08, "text": "funktioniert und eben performant ist und so, das kostet halt Zeit. Oder ich kann in der gleichen"}, {"id": 1018, "start": 8317.08, "end": 8322.48, "text": "Zeit zehn Sachen einbauen, dass es zumindest featuremäßig gut aussieht. Ja, jetzt stellt"}, {"id": 1019, "start": 8322.48, "end": 8326.64, "text": "euch mal vor, als wäre Anfang des Jahres 2020 rausgekommen. Das wäre ja total kaputt gewesen,"}, {"id": 1020, "start": 8326.64, "end": 8336.12, "text": "das Game. Wie sieht denn so ein Fehler im Management aus? Ja, so wie Cyberpunk."}, {"id": 1021, "start": 8336.12, "end": 8346.56, "text": "Ja, die haben zum Beispiel das mit Sicherheit abgewogen und gesagt, ok, die negative Presse"}, {"id": 1022, "start": 8346.56, "end": 8351.68, "text": "und schlichten Reviews und alles Mögliche nehmen wir in Kauf, wenn wir das Weihnachtsgeschäft"}, {"id": 1023, "start": 8351.68, "end": 8358.44, "text": "auch mitkriegen. Es gibt noch mehr Sachen. Du hast so was wie Enter, wo sie beispielsweise"}, {"id": 1024, "start": 8358.44, "end": 8368.24, "text": "eine E3 Demo gemacht haben, ohne zu wissen, wie das fertige Game aussehen soll. Ja, aber ich"}, {"id": 1025, "start": 8368.24, "end": 8382.28, "text": "finde es gut, dass sie das selbst erkannt haben und sagen, die Programmierer bekommen ihren Bonus."}, {"id": 1026, "start": 8382.28, "end": 8391.6, "text": "Stadia hat heute den ersten Cyberpunk-Conflict bekommen, den PC-Spieler schon seit vier Tagen"}, {"id": 1027, "start": 8391.6, "end": 8398.6, "text": "haben. Es wird Zeit, dass wir mal irgendeinen Stadia im Meme-Build hier einblenden."}, {"id": 1028, "start": 8398.6, "end": 8427.36, "text": "Ok, so Leute, ich gehe jetzt ins Bett. Wir sehen uns nächsten Morgen oder so,"}, {"id": 1029, "start": 8427.36, "end": 8438.12, "text": "mal gucken. Achso, ich bin ja schon aus der VM draußen. Ja, war Replay das Stream heute."}, {"id": 1030, "start": 8438.12, "end": 8446.16, "text": "Witcher war nicht so verbackt. Witcher hat auch seine Probleme gehabt, aber man muss auch ehrlich"}, {"id": 1031, "start": 8446.16, "end": 8456.04, "text": "sagen, Witcher wurde meiner Ansicht nach auch nicht so sehr von der lebendigen Open World getragen,"}, {"id": 1032, "start": 8456.04, "end": 8463.92, "text": "sondern eher von der Main-Quest und von der coolen Umgebung an sich, also von den nice Quests und"}, {"id": 1033, "start": 8463.92, "end": 8469.48, "text": "dass halt die Welt cool gemacht war, aber nicht unbedingt jetzt durch irgendwelche super krassen"}, {"id": 1034, "start": 8469.48, "end": 8474.96, "text": "ausgefeilten NPCs oder Sandbox-Geschichten. Da gab es ja in Witcher nicht so viel,"}, {"id": 1035, "start": 8474.96, "end": 8482.84, "text": "weil man mal ehrlich ist. Witcher war Main-Quest und coole Side-Quests und die Welt war auch nice,"}, {"id": 1036, "start": 8482.84, "end": 8490.08, "text": "ja, aber also Witcher war Open World mäßig jetzt auch nicht so wahnsinnig viel zu holen."}, {"id": 1037, "start": 8490.08, "end": 8513.08, "text": "Also Leute, ich gehe jetzt ins Bett, machts gut, wir sehen uns, bis dann, CU."}]}