{"text": "die die die die die die die Betrayed sieht komisch aus Lull ne stimmt doch alles, muss zu gehen die Tüte Tüte Tüte Tüte Tüte Tüte Tüte Tüte Tüte Tüte Moin Shadow Ghost Ich glaube ich muss mal die Musik ein bisschen leiser machen, müssen wir gleich mal gucken Moin Leute So heute spielen wir Overwatch Äh, was auch immer das Spiel gerade rumspacken ist, keine Ahnung Äh, Overwatch ist gerade abgekackt, aber das lag an mir, weil ich komische Dinge rumgeklickt habe Yeah Mario Kart, ich hab mal eine Super Nintendo Playlist angemacht nicht immer dieses komische Elektronik gedudel da düdüdüdüdü, Overwatch nochmal neu starten So, ich hab mir einen neuen Account gemacht, Overwatch, ich hab irgendwie vorhin übelst Lust verspürt Overwatch wieder zu spielen Ich weiß halt nicht wie lange das anhält die Auflösung stimmt nicht so ganz Und ich muss mich erstmal wieder, das schreibe ich auch mal in den Titel rein. Kann das sein, Informationen aktualisieren, dass der denn... Kann das sein, dass er den Titel nicht wirklich aktualisiert hat? Der hat den Titel nicht aktualisiert, oder? Im Titel steht immer noch irgendein Scheiß drin. Im Titel steht immer noch... TF. Kann das sein, dass Twitch gerade bugged und Streamtitel nicht aktualisiert? Kann das sein? Ich hab, ich hab da, ich hab Overwatch reingeschrieben. Aber irgendwie... Hä? Was ist da los? Nee, Twitch ändert den Titel nicht. Warum hat Twitch denn den Titel nicht geändert? Ich mach noch mal kurz aus.", "segments": [{"id": 1, "start": 0.0, "end": 4.76, "text": "die die die die die die"}, {"id": 2, "start": 4.76, "end": 8.88, "text": "die Betrayed sieht komisch aus"}, {"id": 3, "start": 8.88, "end": 10.8, "text": "Lull"}, {"id": 4, "start": 10.8, "end": 13.6, "text": "ne stimmt doch alles, muss zu gehen"}, {"id": 5, "start": 13.6, "end": 40.96, "text": "die Tüte Tüte Tüte Tüte Tüte"}, {"id": 6, "start": 40.96, "end": 44.08, "text": "Tüte Tüte Tüte Tüte Tüte"}, {"id": 7, "start": 44.08, "end": 46.24, "text": "Moin Shadow Ghost"}, {"id": 8, "start": 46.24, "end": 59.04, "text": "Ich glaube ich muss mal die Musik ein bisschen leiser machen, müssen wir gleich mal gucken"}, {"id": 9, "start": 59.04, "end": 60.72, "text": "Moin Leute"}, {"id": 10, "start": 60.72, "end": 62.28, "text": "So heute spielen wir"}, {"id": 11, "start": 62.28, "end": 64.84, "text": "Overwatch"}, {"id": 12, "start": 64.84, "end": 71.24, "text": "Äh, was auch immer das Spiel gerade rumspacken ist, keine Ahnung"}, {"id": 13, "start": 71.24, "end": 80.52, "text": "Äh, Overwatch ist gerade abgekackt, aber das lag an mir, weil ich komische Dinge rumgeklickt habe"}, {"id": 14, "start": 80.52, "end": 84.52, "text": "Yeah Mario Kart, ich hab mal eine Super Nintendo Playlist angemacht"}, {"id": 15, "start": 84.52, "end": 90.16, "text": "nicht immer dieses komische Elektronik gedudel da"}, {"id": 16, "start": 90.16, "end": 96.6, "text": "düdüdüdüdü, Overwatch nochmal neu starten"}, {"id": 17, "start": 96.6, "end": 103.72, "text": "So, ich hab mir einen neuen Account gemacht, Overwatch, ich hab irgendwie vorhin übelst Lust verspürt"}, {"id": 18, "start": 103.72, "end": 106.84, "text": "Overwatch wieder zu spielen"}, {"id": 19, "start": 106.84, "end": 110.04, "text": "Ich weiß halt nicht wie lange das anhält"}, {"id": 20, "start": 110.04, "end": 114.48, "text": "die Auflösung stimmt nicht so ganz"}, {"id": 21, "start": 114.48, "end": 121.48, "text": "Und ich muss mich erstmal wieder, das schreibe ich auch mal in den Titel rein."}, {"id": 22, "start": 122.08, "end": 129.08, "text": "Kann das sein, Informationen aktualisieren, dass der denn..."}, {"id": 23, "start": 129.64, "end": 136.64, "text": "Kann das sein, dass er den Titel nicht wirklich aktualisiert hat?"}, {"id": 24, "start": 137.36, "end": 140.12, "text": "Der hat den Titel nicht aktualisiert, oder?"}, {"id": 25, "start": 140.12, "end": 146.0, "text": "Im Titel steht immer noch irgendein Scheiß drin."}, {"id": 26, "start": 146.0, "end": 153.0, "text": "Im Titel steht immer noch... TF."}, {"id": 27, "start": 155.36, "end": 161.92, "text": "Kann das sein, dass Twitch gerade bugged und Streamtitel nicht aktualisiert?"}, {"id": 28, "start": 161.92, "end": 163.04, "text": "Kann das sein?"}, {"id": 29, "start": 163.04, "end": 169.0, "text": "Ich hab, ich hab da, ich hab Overwatch reingeschrieben."}, {"id": 30, "start": 169.0, "end": 171.76, "text": "Aber irgendwie... Hä?"}, {"id": 31, "start": 171.76, "end": 174.0, "text": "Was ist da los?"}, {"id": 32, "start": 174.0, "end": 176.24, "text": "Nee, Twitch ändert den Titel nicht."}, {"id": 33, "start": 176.24, "end": 203.24, "text": "Warum hat Twitch denn den Titel nicht geändert? Ich mach noch mal kurz aus."}]}