{"text": "Bevor alle nachher Fussball gucken müssen, Fussball in 2k18, ich glaube es nicht. Der Serious Max ist auch da, ja du hast schon gelesen was ich geschrieben habe auf GitHub, gehe ich mal voll aus, weil du hast ja zugemacht. So, ich muss jetzt nochmal schnell auf Twitter posten, dann geht es los. Ich habe nämlich ein bisschen was, ich zeige euch gleich mal was es Neues hier gibt. Es gibt richtig viele geile, also naja, es war jetzt vielleicht ein bisschen dick aufgetragen, richtig viele geile Sachen. Aber es ist schon ganz nice, es ist vor allem viel hübscher, sogar Javascript sieht ganz hübsch aus mittlerweile. So, ich muss gerade nochmal Cider refreshen, weil irgendwie sehe ich weder Chat noch New Account richtig. Nur in der Vorschau, so perfekt. Eats clap. Very to Eats, Eats as fuck. So, Twitter post. Eigentlich könnte man den Titel vom Stream wieder irgendwie nennen, Max quält sich mit Javascript oder sowas. Das wird wieder grausam, ich kriege echt zu viel wenn ich Javascript Zeugs machen muss, muss ich euch mal zeigen. So, Eier Eats. Eier Eats. So, okay, auf gehts, ich habe den Grandloftwitter gepostet. Übrigens mal eine Frage an euch, an die ganzen Javascript Kenner oder wie natürlich die coolen Leute sagen an die Javascript Kenner, an die Javascript Experts. Wo kann man, wobei, ich wollte gerade, richtig dumm oder, ich wollte gerade nach einer Seite suchen wo man online Javascript ausführen kann. Wie wäre das mit meinem Browser? Geht ab, geht da ab. Naja, okay suchen wir mal ein bisschen schöneres Javascript. Ich muss euch nämlich mal was fragen. Der Javascript, ja genauerdings hier, das ist gut. Und dann gibt es ja noch CodePen oder sowas. Muss euch mal was fragen, habe ich nämlich letztens in einem Vortrag gesehen, übelst geil. Und ihr müsst raten was da rauskommt. In Javascript, das haben wir ja schonmal gemacht sowas, aber das war das beste was ich bisher gesehen habe. So, Javascript. Kann man hier die Schriftgröße ändern? Settings. Schriftgröße ist komplett overrated. Brauchen wir nicht. Schriftgröße ändern. Wie ändert man Schriftgröße? Fuck. Okay, keine Ahnung. Wie ändert man Schriftgröße? Kann nicht sein. So, was meint ihr was hier rauskommt, wenn man das ausführt? Denkt dran es ist Javascript. Jetzt kann ich hier nicht scrollen. Macht man den Krempel denn größer? Was meint ihr was hier rauskommt, wenn man das ausführt in Javascript? Beste. Habt ihr irgendeine Idee? Also ich mein, wir dürfen nicht vergessen, es ist Javascript. Also das heißt schonmal. Ja gut, die Leute kennen das wahrscheinlich. Oder ihr kennt das wahrscheinlich, aber das ist so bescheuert, dass das da rauskommt. Das ist einfach total beknackt. Also ich mein, wir müssen uns das erstmal auf der Zunge zergehen lassen, was uns Javascript hier mal sagen wird. Das hab ich übrigens aus einem Vortrag, den ich auf YouTube gesehen hab. Also, es gibt einen Array mit 6, also so wie man das jetzt als unbedarfter Javascript Benutzer liest. Es gibt einen Array mit 16 Plätzen, halb leer, würd ich mal sagen. Halb mit 16, was auch immer. Das ist ja auch schon das geile in Javascript. Mit 16, was auch immer. Man weiß es nicht, genau. So, und jetzt jedes Element. Was zum Teufel ist String-1? Was bitte ich schon ist String-1? Also man könnte sagen, ok, alles bis hier macht noch irgendwie Sinn. So, join ist halt, man macht das Array zu einem String und halt mit diesem Separator. Also sprich, ne, wenn man jetzt hier in dem Array abcd drin steht, mit join, sagst du dann, join Leerzeichen zum Beispiel. Kommt halt ein String aus A Leerzeichen, B Leerzeichen, C Leerzeichen. Allerdings hab ich schon mal keine Ahnung, was genau String-1 macht. Ich hab keine Ahnung. Ich würd auch, ich würd sowas sagen wie das Serious Max, also dass das quasi dann String oder so gibt. So, aber folgendes kommt drauf. Wie führt man hier Sachen aus? Fuck, äh, ähm, äh, Console, Log. So, ok, das funktioniert hier drinnen nicht. Wie kann man das jetzt hier ausführen? Ok, ich fühl's jetzt im Browser aus. Also, was da rauskommt, das Beste. Haha, das kommt raus. Ich mach mal ein bisschen größer hier, das kommt raus. Ich hab keine Ahnung warum. Ich hab keine Ahnung warum, ehrlich gesagt. Das ist hier absolut, ähm, ich, also, von der, von der Idee her, von, also, ok, versuch, ich hab's mal versucht zu verstehen. Ich mein, das hier ist relativ, das hier ist relativ klar. Ein Array mit 16, man weiß es nicht. So, und in JavaScript ist wahrscheinlich, man weiß es nicht, not a number. Was ja so auch nicht ganz verkehrt ist, ja. Oder? Ich hab keine Ahnung ob das, ok, machen wir mal einzeln. Was ist Array 16, was kommt da raus? Empty. 16 mal nichts. Ok, das ist das, daher kommt schon mal nicht not a number. So. So, und dann ist String minus 1. Was, was ist String minus 1? Aha, String minus 1 is not a number. Ich, ich bin ja geneigt dazu, JavaScript in dem Fall sogar recht zu geben. Aber, lass uns überhaupt gehen. Also ich hätte jetzt erwartet eigentlich, wenn man sich das so anguckt, String minus 1 ist halt einfach nur String oder sowas. Ich mein, warum auch immer man String und eine Zahl mit Minus, warum das überhaupt zusammen sowas. Ja, was auch immer, ja. Zumindest String minus 1 is not a number. Das heißt, wenn man jetzt 16 mal nichts in JavaScript mit separator not a number joint, dann kommt dann das hier raus. Es ist total, es ist, es ist JavaScript. Es ist JavaScript, man muss es nicht verstehen. Ja, das, das kenn ich, Sychin, was du geschrieben hast. Das ist geil, das kenn ich. Ich weiß aber nicht genau, was rauskommt. Plus, ist es false oder true oder irgendwie sowas? Ach nee, Null, genau. Ja, das gibt so auch so Dinger, die man nicht so genau checkt. Ach ja, und das ist übrigens was anderes, wenn ich das Richtige in Erinnerung habe. So rum ist was anderes wie so rum. Das ist auch JavaScript-Logik. Normalerweise bei einem Plus, würdest du eigentlich sagen, okay, so wie man das gelernt hat in der, ich weiß nicht in der wievielten Klasse man das lernt, ich sag jetzt einfach mal in der, keine Ahnung, in der zweiten Klasse oder so, ist es egal, bei einem Plus, ob es links oder rechts steht. Das ist allerdings, nur weil man das in der zweiten Klasse gelernt hat, heißt das noch lange nicht, dass es in JavaScript auch so ist. Also man kann sich das schon irgendwie dann zurechtbiegen und erklären, warum das so ist. Und wenn man die ganzen Einzelheiten auch mal sich irgendwann gemerkt hat, kann man auch bei solchen Dingen durchsteigen. Aber intuitiv ist was anderes. Das nochmal zum Einstieg. Ich zeige euch mal was das Memetool tolles Neues kann. Nein, das kann ich Deep House Relaxing Study Music. Das kann es noch nicht, vielleicht kann es das auch mal irgendwann. Wir haben das nämlich ein bisschen abgecradet. Und zwar, wir sind jetzt voll im Trend. Und zwar habe ich das ein bisschen neu gebastelt. Ich zeige euch das jetzt mal, ich muss das jetzt mal aufmachen. Also, ich habe eine neue Ordnung. Wir machen das erstmal in Visual Studio jetzt auf. Oh, die Cuts. Moment, warum sind die Fotos immer anders, je nachdem wie man klickt? Was zum Teufel? Ah, das hat anscheinend irgendwie Bilder zusammengesucht. Ich weiß nicht genau warum. Übrigens, beste Bild. Max Gesicht revealed in der Suppe. Ich weiß nicht, ob sich das geschwiegelt hat. Aber Visual Studio auf. Ja, Green Monster, das machen wir auch noch mal irgendwann. WebAssembly müssen wir uns auch noch mal irgendwann geben. Wie sieht das eigentlich mittlerweile aus? Vielleicht weiß das jemand von euch. Wie sieht das eigentlich aus in WebAssembly mittlerweile mit Dom-Elemente ändern? Geht das mittlerweile? Das erste Mal, wo ich mir das ein Beispiel von angeguckt habe, konntest du halt quasi mehr oder weniger musstest du alles selbst malen auf ein Canvas oder sowas. Was dann ein bisschen so die Sache in Frage stellt, warum ich das dann überhaupt im Browser mache. So, also, VM, nee, vMysterion, das ist das Backend. Also, das Ding besteht aus, jetzt kann ich gleich mal die neue Ordnerstruktur zeigen, wo wir gerade dabei sind. Ich habe das hier nämlich schon mal ein bisschen aufgeräumt. Wer das das letzte Mal gesehen hat, weiß wie eklig das war. Es gibt drei Teile im Endeffekt. Es gibt hier so einen, wie nennt man das, Data Layer, der dafür zuständig ist, Bildchen einzulesen. Und in dem Fall halt sowas hier, so, Min-Bildchen. Da kannst du ja alles bei den möglichen Bildchen einlesen. Dann gibt es ein Web-Interface und es gibt das eigentliche Frontend, was dafür zuständig ist, die Bilder dann auf dem Rechner anzuzeigen. Ich zeige das mal kurz. Oh nee, ich glaube, ich habe keine Bilder drin. Ich muss erstmal Bilder reinziehen. Was wird zum Schluss rauskommen? Ja, ich zeige euch das für die, die es noch nicht gesehen haben. Genau, und das ist in C-Sharp. Also, die Backend-Geschichte ist komplett in C-Sharp. Das Frontend ist in, ja, zumindest das Web-Frontend ist halt in JavaScript und HTML. Weil, mein Web-Frontend, was soll das sonst sein? Und jetzt ganz neu, ich zeige es euch gleich, mit Vue.js. Ich habe mir so ein abge-dingst abgebrochen bei ihr. Und ich habe mein ekliges JavaScript. Wir gucken uns das jetzt das letzte Mal an. Komm jetzt, ich zeige euch nochmal, wie es letztes Mal ausgesehen hat. Wo geht denn das hier auf GitHub überhaupt? Komm jetzt. Das da. Und letztes Mal war alles noch in einem Ordner drin und HTML JavaScript des Todes. Wo ist es denn? Index. Nein, das letzte Mal hatte ich alles in einer Datei. Guckt hier, Logik, JavaScript, zusammengefuddelt, irgendwelche CSS zusammengefuddelt. Alles schön inline mit Styles und so richtig, also so wie man es nicht macht. Und jetzt habe ich das Ganze ein bisschen schöner sortiert. So und jetzt kopieren wir mal ein paar Memes rein, dass wir ein paar Bildchen zum Anzeigen haben. So, wir müssen aber mal Steuerung C löschen, sonst ist es ein bisschen nervig. Steuerung T, Steuerung S löschen wir auch. Und R, glaube ich, ist auch keine so gute Idee. So, also was das Tool macht, kann ich doch mal kurz zeigen. Also ohne das Webinterface jetzt einfach nur, wenn man einen Ordner hat, wo man seine Memepildchen drin hat und das Tool startet, man sieht es hier unten ist es. Man kann auch das Webinterface starten, aber man kann es auch ohne Webinterface benutzen. Man kann einfach Memoverlays, Memepildchen einblenden. Und das Schöne daran ist, ich weiß jetzt ja schon mittlerweile, was ich erzählen muss, was die Leute interessiert, weil das wird in jedem Stream quasi 30 mal gefragt, was das eigentlich macht. Und man achtet übrigens mal auf die RAM-Auslastung, das ist richtig geil. Die jumped übel, guck mal hier, bam, einfach mal 500 MB, weil ich das GIF angezeigt habe. Wenn der Garbage-Collector läuft, geht es dann wieder runter, aber schon geil. So, und das Gute daran ist, das zeigt nicht einfach irgendwelche Bildchen an, weil einfach Bildchen anzeigen bringt es dir jetzt auch nicht, wenn es sich dann komplett aus dem Game raushaut. Diese Bildchen sind komplett transparent, also sprich, man kann durchklicken, siehst du ja hier, ich markiere im Hintergrund, obwohl ich im Bild rumklicke. Jetzt habe ich irgendwas komisches copy pasted. So, man kann komplett durchklicken, das heißt, man kann die auch verwenden, während man spielt und auch das anzeigen nimmt keinen Fokus weg. Das macht das, also sprich, das ist für Streamer, die Bildchen einplanten wollen, so wie ich. Das war nämlich der ursprüngliche Gedanken, hallo Mason, das war der ursprüngliche Gedanke, warum ich das überhaupt programmiert habe. Ja, die Sharp hat einen Garbage-Collector. Man sieht das auch hier dran, wenn ich jetzt zum Beispiel mal da hingehe und sage hier einmal, keine Ahnung, gc collect, dann sieht man auch, dass an der Stelle jetzt nicht der Garbage-Collector läuft, wenn er lustig ist, sondern jedes Mal, wenn ich ein Bild anzeige. Und das dann auch schneller aufräumt oder auch nicht. Ich weiß nicht, warum es nicht macht, ehrlich gesagt, aber keine Ahnung. Ach, was weiß ich, zumindest funktioniert es, ohne dass man manuell Garbage-Collector aufrufen braucht man eh nicht, also ganz selten. Und wenn man das braucht, muss man sich überlegen, ob man das nicht eh irgendwie anders macht. Normalerweise muss man den Garbage-Collector nicht direkt aufrufen. So, aber ich zeige euch jetzt mal, was es Neues gibt. Also als erstes haben wir natürlich eine neue Ordnerstruktur, dass es nicht mehr ganz so eklig ist. Und hier ist das Webinterface drinnen, das war vorher wie gesagt ja alles in einem. Und ist die Schriftgröße so okay Leute, passt das? Ich habe ja an den Settings nichts geändert, aber man weiß ja nie. Wie ein Doktor, das ist nicht schlecht. Wenn du den Garbage-Collector startest, installiert es sich Java. Allerdings, wer hat denn in 2k18 überhaupt noch Java installiert? Außer irgendwelche Minecraft-Kinder, ne? Das ist ja, ne, ne, ne, Java in 2018. Hyperlulpoggers. Mittlerweile ist es so schlimm, ne, mit meinen Twitch-Chat-Geschichten. Ich laber manchmal, es ist sogar auf der Arbeit so schlimm, ich laber manchmal vor mich hin. Also ich sitze dann da und sag dann irgendwann Hyperlulp oder sowas. Einfach so, einfach so. Oder poggers oder so, einfach so. Ich weiß nicht genau, was das auslöst, aber es wirkt glaube ich ein bisschen verwirrend auf Leute, die das Ganze nicht kennen. Aber lange rumgeschwätzt, ich zeige euch das jetzt erstmal, wie das aussieht. Weil die neue Oberfläche sieht richtig gut aus, sehr, sehr nice, schon viel besser. Ja, das zeige ich gleich. Wir starten die ganzen Templates erstmal. Und ich habe es jetzt so eingestellt, das muss man wissen, falls ihr das auch bei euch ein bisschen mit dran basteln wollt. Oder, ich meine vielleicht euch auch dran Beteiligung und Pull-Request aufmacht oder sowas. Ich habe es mittlerweile so eingestellt, dass der im Debug-Mode, also sprich wenn Environment-Development neu ist, dann benutzt er einen lokalen, dann benutzt er hier lokal was zum Seiten ausliefern. Und wenn man Production startet, dann nimmt er die Seiten, die quasi in der Echse drin sind. Das ist eigentlich ganz praktisch, das heißt es ist nach wie vor eine Echse, die man verteilen kann und alles ist drin. So, das heißt wir starten das Ganze jetzt in meinem Debug-Mode. So, starten den Webserver. Müssen wir machen. Und machen mal das kleine JavaScript-Zeug auf. Visual Studio Code habe ich mir jetzt mal neu installiert. Finde ich ist eine super Geschichte. Ups, äh, ich habe es falsch aufgemacht. Lul. Client-Code. So, das HTML zeige ich euch auf und nun starte ich hier mal, das ist so ein Plugin von Visual Studio, dass der die Files lokal bereitstellen kann, denn ich zeige euch nämlich nochmal was cooles, was ich rausgekriegt habe. Also unsere Web-Developer hat hier der Witz schlechthin. Aber wenn ich jetzt auf das Memboard drauf gehe, das läuft bei mir hier lokal, Index, HTML. Bam, guck mal wie schön das jetzt aussieht. Guck mal, wie nice das jetzt aussieht. Guck mal hier. Darklight-Seam oben, Searchbar. Also ich kann jetzt hier oben zum Beispiel den POG. Drücke Enter und dann ist es auch gleich an. Sehr nice. Man kann suchen nach Shortcut, man kann suchen nach Name oder nach was weiß ich. Aber es sieht schon mal nice aus, muss man sagen. Absolut nice. So. Und wie gesagt, es ist gedacht, dass man das auf dem zweiten Rechner aufmacht. Nur mal so zur Erklärung, weil es das letzte Mal immer gefragt wurde, was bringt es denn, wenn ich über den Webinterface Bilder auf dem gleichen Rechner anzeige. Die Idee ist ja, dass man das startet auf einem Rechner und dann macht man es vom zweiten Rechner auf oder vom Tablet oder vom Smartphone. Und während man am Streamen ist und ich quasi am zweiten Rechner bin, ich zeige euch, ich gehe jetzt mal am zweiten Rechner. Ihr seht das jetzt zwar nicht, aber was habe ich für eine IP? 64. Was habe ich denn? Ja, 64, ok. Ich gehe jetzt mal auf den zweiten Rechner und wenn ich das da aufmache, dann zeigt, seht ihr, dann kann ich jetzt im zweiten, also ihr seht es nicht, aber ihr seht es, dass ich hier nicht anklicke. Jetzt kann ich vom zweiten Rechner aus hier, während ich irgendwas spiele, streame, sonst was, blöde Memes einplanten, auch wenn ich mir die Shortcuts nicht merke. Also sprich, man kann ja auch Shortcuts belegen, dass man das schnell aufrufen kann, während man streamt, aber ich kann es auch vom zweiten Rechner aus bedienen. Dafür ist halt eben die Oberfläche. So und was wir heute machen ist, ich mache es mal wieder hier auf dem ersten Rechner auf. So und was wir heute machen ist, wir basteln eine Upload-Funktion, weil zur Zeit kann man nur Memes hinzufügen, wenn man das, Poggers muss da noch rein, fällt mir gerade auf. Poggers, guckt und wenn man es reinkopiert, ich will es nicht moveen, ich will es kopieren, zack, erscheint es hier. Wo ist es, wo ist Poggers? Warum geht das nicht? Jetzt gehts. Ok, das muss ich mir nochmal angucken, warum man das jetzt nicht geladen hat richtig, aber man kann es reintracken, droppen im Windows Explorer oder halt hier, dann lädt es automatisch, während es läuft. Die Sache ist die, das ist ziemlich doof, weil dann muss man quasi, wenn man neue Sachen hinzufügen will oder Shortcuts ändern oder sowas und man am Streamen ist, quasi in-game, also müsste man hier den Ordner aufmachen und das Zeug umbenennen und sowas, das ist nicht so schön. Deswegen basteln wir heute eine Upload-Funktion, dass man sich überhaupt nicht mehr drum kümmern muss, sondern man kann einfach das Web-Interface aufmachen, irgendwas, ich zeige das jetzt mal exemplarisch, weil das funktioniert jetzt natürlich nicht, weil wir haben es noch nicht programmiert. Wenn man hier confused, man sieht, er fügt das auch hinzu, ist jetzt nicht gemapped auf einem Key und das alte hat er entfernt, löschen wir mal. Ah ne, kann ich jetzt nicht löschen, ja, aber ihr seht, was ich meine. Und ich will es halt nicht im Ordner umbenennen, sondern ich will es halt hier reintracken, droppen können, also zum Beispiel das hier, zack, geht jetzt natürlich noch nicht, jetzt macht es da Pause auf, ich will es hier reintracken, droppen können und er fügt es automatisch hinzu, also vom zweiten Rechner aus. Das heißt, wir müssen zwei wichtige Sachen machen, wir müssen einmal in unserem Backend, dem beibringen, dass File Uploads möglich sind und wir müssen File Uploads implementieren in unserem Frontend. Schauen wir mal, wie wir das machen. Und hier oben machen wir noch einen Settings-Icon oder sowas hin, dass man auch ein paar... also ich will halt komplett ohne Config-Datei auskommen, die man von Hand schreiben muss, aber wenn man jetzt eine Oberfläche hat, kann man ein paar einfache Settings reinmachen, wie zum Beispiel, was der für eine Shortcut-Taste verwendet. Also Woodface ist jetzt auf F gelegt, allerdings ist es halt Steuerung F, Steuerung F zeigt er das an. Das heißt, wir brauchen noch ein Setting, wo ich auswählen kann, was er für ein Modifier-Key nehmen soll, keine Ahnung, Steuerung Alt oder nur Steuerung F oder Shift-Ctrl-F oder was auch immer. Deswegen, das ist das erste, das dürfte relativ simpel sein, wir machen so ein Settings-Icon hier oben hin. Und das Settings-Icon würde ich gerne animieren, wenn Uploads laufen oder irgendwie sowas. Muss dazu sagen, ich hab von JavaScript nicht großartig Ahnung, ich hab mir da schon ganz schön einen abgebrochen bisher. Ich hab mir da bisher ganz schön schon einen abgebrochen. Das hinzukriegen. Okay, wir machen jetzt erstmal Settings-Icon. Achso, ja, das müssen wir auch mal machen. Ich füg das mal wieder ein. Ja, und wenn das funktioniert, also sprich, wenn ich, dass man jetzt Bilder reintracken droppen kann, dann werde ich die nächste Vorschau-Version auf GitHub veröffentlichen, dass man sich den Kram eben nicht mehr selbst kompilieren muss. Dann würde ich als fertiges Windows-Exil einfach Downloaden ausführen, Memes reinziehen und fertig. So, jetzt starten wir das aber erstmal selbst. Ist die Musik laut? Stärke okay, lauter, leiser, passt das. Bist du sicher, dass du das nicht für 200.000 an Microsoft Twitch Elgato verkaufen willst? Elgato gibt's doch nicht mehr. Äh, was wollte ich jetzt machen? Auf Web-Interfell starten. Elgato gibt's doch nicht mehr. Elgato ist jetzt, haltet euch fest, wer es nicht mitgekriegt hat. Elgato ist jetzt Corsair, Corsair. Das Stream ist kaputt. Geht ja wieder. Ja, das ist noch nicht so lang her, die Meldung. Corsair, Corsair, Corsair. Corsair. Ja, das sind Sachen, die versteht man nicht so genau, aber gut, gab's wahrscheinlich ein gutes Angebot. GG Eats. Okay, ähm, so, ach ja, noch eine geile Sache wollte ich euch ja auch zeigen. Dadurch, dass wir das jetzt so eingestellt haben, dass, ähm, richtig geil, also zumindest zum Entwickeln übelst nice, wir haben das jetzt ja so eingestellt, dass wenn das im Developer-Modus läuft, also im Debug-Modus, dass der das dann von einem lokalen Server sich die, ähm, die HTML und JavaScript-Geschichten von unserer Anwendung holt. Dadurch haben wir jetzt auch, ich zeig's euch mal ausführen, das Ganze. Das ist jetzt wirklich sehr, sehr nice. Das macht das Ganze viel einfacher. So, wenn ich jetzt den Browser hier rechts mache und hier links mein Visual Studio und ich editier jetzt hier irgendwas, sagen wir, ich mach jetzt den Style hier raus, weil warum ist der überhaupt noch da, keine Ahnung, und ich drücke Speichern. Fuck, ich hätte erstmal reloaden müssen. Äh, Moment, das hab ich vergessen. Ah ja, so, kommt mal, und ich drücke jetzt Speichern, bäm, dann reloadet sich das automatisch. So, mach mal Platz, Alter. Geh weg. Das reloadet sich automatisch, also sprich, sobald ich hier was ändere im Editor, reloadet sich die Seite, das heißt, ich muss hier nicht mehr jedes Mal reinklicken, ja 5 drücken. Das ist ultra nice. Also sprich, ich kann jetzt hier zum Beispiel sagen, gehen wir jetzt mal hier Style, Dark Mode wollen wir irgendwie, irgendwas, dass man's halt sieht, ja. Also sprich, wir wollen jetzt hier Dark Mode Color irgendwie, keine Ahnung, das da als Hintergrund haben, und jetzt drücke Speichern, bäm, automatisch refreshed auf der rechten Seite. Und saumäßig schnell, ne. Das ist wirklich übelst nice. Was einem nämlich super auf den Sack geht, ist, wenn man JavaScript-Zeug macht, das war eins der ersten Sachen, die mich schon so abgefuckt haben, dass ich eigentlich keinen Bock mehr hatte, dass man jedes Mal, wenn man im Editor was speichert, den Browser aufmachen muss, ein F5 drücken oder auf dieses komische Häkchen hier oben. Ich dachte erst so, so quasi Frontend-Java-Script-Noop, wie ich bin, ich mach hier nen Chrome-Plugin, dass die Seite, die alle 5 Sekunden neu lädt, aber das ist auch kacke, da lädt es halt die Seite neu, wenn man das grad nicht will, zum Beispiel, wenn man hier tippt oder so. Pogas, alter, der Patrick ist da, Pogas. Ja, drück mal Steuerung S, zack, automatisch reload. Das geht allerdings nur im Debug-Mode. Das geht nur im Debug-Mode, wenn er das hier über diesen lokalen Server abruft, wenn das Ding hier quasi im Release-Mode läuft, dann nicht, dann ist es auch ein bisschen schneller. So. Okay. Und auf Wiedersehen, was für JavaScript-Lull. Tja, JavaScript halt, ne? Das ist halt JavaScript, was willst du machen? Das wollte ich jetzt zeigen. Ja, aber man sieht schon, es ist mittlerweile ziemlich ordentlich. Das letzte Mal war ja alles in einer Datei und jetzt machen wir das mit Vue.js. Das ist ja so der aktuelle Hyper-S-Trend. Ja, das Skaronator, das habe ich auch ausprobiert. Und zwar mit, es gibt hier so einen, ich zeig das mal, weil ich kann jetzt hier nichts editieren. Es gibt bei ASP.NET Core so ein Hot-Reload-Dingsgedöns, aber das hat den Nachteil, dass es übelst kompliziert einzurichten ist. Dann funktioniert das auch. Da musst du den Webpack installieren und npm und irgendwelche kryptischen Webpack-Config basteln und so was. Und der Nachteil daran ist auch, dass dann keiner mehr, der das nicht kann, mitmachen kann. Also sprich, du brauchst, du musst das dann haben. Wenn du das damit machst, wenn du das ganze über Webpack noch bundeln lässt und so was, dann muss halt jemand das lokal am Start haben und quasi auch wissen, dass das gibt und verwenden können und alles, dass er hier überhaupt mitmachen kann. Ich will es so einfach wie möglich halten, deswegen habe ich auch keine extra View-Component-Bundle-Geschichte gemacht, sondern das ist einfach nur ein ganz normales HTML-File und ein JavaScript-File, wo wir gerade wieder beim Thema sind. Aber im Vergleich zum letzten Mal ist das viel, viel lesbarer und viel schöner. Wie gesagt, das letzte Mal hier, ich habe es euch ja gerade gezeigt, hier alles inline JavaScript und sonst was und ich muss sagen, View ist wirklich schön simpel zu lesen. Also guck mal, wir haben jetzt hier in 61 Zeilen JavaScript, auch mit ein bisschen Boilerplate-Gedöns noch dabei, also sprich in 61 Zeilen JavaScript und in 33 Zeilen HTML, was viel ordentlicher ist als das letzte, sogar noch eine ganze Ecke mehr Funktionen drin und das Ganze noch hübscher. Ich finde, das sieht gar nicht so übel aus, die Geschichte. Ja, sehbaro, das sind wir uns einig. Alles, was Java im Namen hat, ganz vergessen. Also wir haben die gleiche Funktion wie das letzte Mal noch, dass man die Sachen anklicken kann, plus halt die Suche und den Theme-Switcher haben wir auch noch. So, als erstes will ich jetzt aber hier oben mal einen Settings-Knopf oder irgendwie sowas hinmachen. Achja, und was auch noch nice ist, ihr seht ja, das floated hier oben, also sprich die Suchleiste hat man immer, egal wie man scrollt. Hier oben ist die Suchleiste, das machen wir hier, schreiben wir was rein, POC oder irgendwas oder sonst was. Oder selbst wenn wir hier unten sind und nicht oben suchen, dann funktioniert das auch. Also das haben wir in CSS so eingestellt, dass das hier so floated oben drüber, der ganze Krämpel. So, also wir brauchen jetzt noch einen zweiten Button, und zwar einen Button für Settings. Und eigentlich habe ich ja von Vue kaum Ahnung, weil ich habe ein paar Tutorials geguckt und das hier jetzt gebastelt. Das heißt, kann sein, dass man da jetzt ein bisschen... Ich hoffe, das ist respon... Es ist einigermaßen responsive. Moment, warum aktualisiert Windows das nicht? Windows, hallo? Du darfst den Browser auch bewegen, das ist schon erlaubt. Also so, alter, Windows. So halbwegs, so halbwegs responsive ist es, guck, so halbwegs. Ab der Größe ist er nicht mehr responsive, so halbwegs, aber immerhin. Immerhin. Und das movet auch mit da oben. Was es halt nicht kann, was halt richtig pro ist, also was halt richtig pro wäre, wenn man jetzt da krasse CSS-Logik machen würde, dass da jetzt quasi sagt, okay, jetzt ist da Platz weg, jetzt macht er nur noch fünf Spalten oder so, ne? So. Das könnte man machen. Aber das könnt ihr ja alles... Wenn ihr wisst, wie das geht, könnt ihr da gerne ein Pull-Request aufmachen. Ja, Max, da war das allerdings noch nicht Vue.js. Also jetzt ist das so, jetzt ist das hier irgendwie ein Crit. Das können wir jetzt mal machen, also wenn ihr wisst, wie das geht, wir können das jetzt auch machen, schnell. Dann müsst ihr ja mal erzählen, wie das funktioniert. Und zwar aktuell ist es so, die Items, da, Items ist ein ListView, da hier, unordered list, Items, und der hat als CSS das da. Display, Crit, Crit, Template, Columns, sechs Stück und ein FR. Ich hab ja wieder vergessen, was FR ist. Irgendso ein vom Gesamtplatz, sonst was. Ich hab keine Ahnung, wie das funktioniert, ich hab mir das auch noch von Stack Overflow kopiert, weil es gibt ja, wenn man sich das hier mal anguckt, 30 Milliarden Sachen, die man da setzen kann, die kann man gerade alle wissen. Der Sideman ist richtig proer Frontend Developer, da kann man das. Ein Franzose. Das passt thematisch heute sogar ganz gut. So, also CSS Profis. Wie mach ich mein Crit mehr responsive, dass das jetzt hier sich anpasst? Irgendjemand hat gesagt, drei Zeilen zählt erst, dann zeichnet man, dann schießt man los. Was mit Bootstab verwenden, ja gut, das ist natürlich auch ne Magande. Das ist ja nur hier so entstanden, weil ich eigentlich gar nicht weiß, was es macht. Aber dafür funktioniert es gut, muss man da sagen. Das geht nur, wenn man das mit dem Fenster skalieren, das geht nur, wenn man links und rechts, also wenn man quasi so gemacht hat hier, wenn man das so an die Seite, beide Fenster an die Seite irgendwie so enttatscht hat. Aber es buggt auch rum, wie du siehst hier teilweise. Manchmal skaliert der Browser nicht richtig mit und so. Es ist irgendwie ziemlich kaputt. Habt ihr das gerade gesehen beim linken Fenster? Okay, Crit, Template, Columns, Auto Fit. Oh, oh, oh, oh, jetzt kommt's, jetzt bin ich gespannt. Achtung, Achtung Leute. Seht Auto Reload? Habt ihr das gesehen? Nice. Fuck. Alter. Oh, ist das responsive? Ist das responsive? Ja, guckt's euch an. Responsive as fuck ist das. Boah, ist das nice. Siehste, deswegen mache ich das hier on stream. Dann sehen Sie, wie ein paar Leute da die Ahnung haben von der ganzen Geschichte. So, und jetzt, Serious Max, jetzt muss ich mir nur noch erklären, was das macht. Okay, Repeat, Repeat, kann ich mir irgendwie, ne, wobei, ich hab nicht mal, was macht Repeat? Was? Ich hab keine Ahnung, was das macht, aber es funktioniert. 04D. Ach, du hast das auch noch, Stack Overflow Copy Paste. Naja, gut, das kann ich auch. Okay, ich wollte ein Settings Icon machen. Okay, ganz, ganz wichtig, wir brauchen ein passendes Emoji für dieses Settings Icon. Warum ein Emoji, da will ich keine Image Fonts einbinden muss. So, oh, das ist ein super, das ist ein super Settings Emoji hier. Ne, das sieht scheiße aus. Einfach nur der Hammer vielleicht. Ne, sieht auch kacke aus. Der Hammer, ja, der Hammer ist gut. Moment, warum ist das jetzt falsch rum? Ach so, weil das eine so rum und das andere so rum wäre, das ist klar. Settings Icon. Zahnrad, ja, hab ich auch schon gedacht, aber, also es gibt hier irgendwo ein Zahnrad, aber das sieht auch kacke aus, guck mal. Oder, warte mal. Ach, so schlecht sieht es gar nicht aus. Kockers. So, Zahnrad ist outtale, aber so muss das sein. So, wie kriege ich jetzt den Abstand dazwischen hin? Also, ich will jetzt, dass der Abstand zwischen dem und dem nicht so groß ist. Übrigens, jetzt, jetzt wird, also, jetzt, jetzt mal eine Frage an die richtig krassen. Das Kockers GIF, ja, das, das muss ich, das muss ich wirklich noch ganz, das muss man sein. Ernsthaft, Mann. Das da. Kockers GIF, F11 oder so, machen wir das. Kockers. So, das muss da rein. Moment, wo ist es? Desktop Memes. Kockers. Habe ich F11 schon? Oh, nee, F11 habe ich schon. Dann ist es jetzt F12. Mehr, mehr, mehr Shortcuts habe ich auch gar nicht. F12 habe ich noch nicht, ne? Kockers, da ist es. Kockers. Aber man sieht schon, dass es relativ einfach da was hinzuzufügen und dass es auch im Web-Interface erscheint. Und mit F12 funktioniert es auch. Okay, als, als Settings-Symbol, nee, nee, nee. So, und jetzt, jetzt ist die Frage, also mal angenommen. Man kann jetzt ja auch irgendwie mit, ja, die Software ist richtig sophisticated. Du musst dir mal angucken hier, wie das automatisch hinzugeedet hat sich im Web-Interface, als ich den Ordner gezogen habe. Sehr, sehr nice. Easy Money, wobei, Moment, ich kriege da kein Geld für. Ich lasse mich immer so leicht ablenken, wenn ich am Stream bin. Jetzt habe ich schon wieder vergessen, was ich machen wollte. Ja, genau. Man kann doch jetzt irgendwie, und ich habe es gesehen, im Chat sind auch ein paar, die wissen anscheinend, was sie machen. Im Gegensatz zu mir, was JavaScript angeht. In JavaScript kann man doch, äh, in CSS kann man doch jetzt irgendwelche Animationen machen. Kann ich jetzt dieses Zahnrad, kann ich das irgendwie drehen lassen? Geht das? Mit CSS-Animation? Also zu was weiß ich, wenn ich dem Ding jetzt irgendwie mal eine ID gebe von irgendwie, äh, Animation-Test oder irgendwie sowas. So. Klar geht das, aha, ja, wie geht das? Ähm, so, probieren wir mal aus. Transform, Rotate, aha. Ich will allerdings nur das Bild rotaten lassen und nicht den Button. Wie haben wir das genannt? Animation? Okay, probieren wir das jetzt mal aus. Also wie geht das? Wie könnte man das jetzt animieren lassen? Transform, Rotate, einfach so? Nee, nee, okay, das wäre zu einfach. Ah ja, einfach das Zahnrad in ein Span oder, oder, oder, ah ja, stimmt, stimmt, das ist natürlich stimmt. Wir müssen das ja nicht dem ganzen, ganzen Button das, das geben. Ja, das stimmt, das ist, das ist gut. So, genau. Okay, ähm, da muss ich jetzt mal suchen, wie das geht. Rotate Animation, Stack Overflow, beste. Animation, Spin Linear Infinite, beste. Stack Overflow, beste. Geht nicht. Geht nicht. Achso, geht immer noch nicht. Ha. Geht auch nicht, warum nicht? Warum geht das nicht? Alter, was ist das für Musik, das ist ja nervig. Das hört, das hört sich an als, als, als hängt irgendwie ein Lego-Motor oder sowas. Kennt ihr das noch von früher? Hatte ich auch mal einen Lego-Motor? Die Dinger haben sich ungefähr so angehört, wenn man sie zu sehr belastet hat. So. Okay, ich muss mal gucken, ob das jetzt dieses Ding überhaupt annimmt, diese Animation, wenn man müsste eigentlich, ne. Können wir mal ausbilden, ob das jetzt annimmt irgendwie, keine Ahnung. Background, Color, irgendwie so. Ja, da nimmt das. Okay, das funktioniert nicht. Warum, warum geht das nicht? Eventuell noch Display Inline-Plug, okay. Ich mach das einfach, ich mach das, was du sagst. Nope. Nein, zu einfach ist es nicht. CSS-Tricks, oh, gleich mit einem Code-Pen-Link. Ach so. Ja, im Moment der Rotate-Image, wir wollen ja ein Zeichen rotaten, so. Okay, ich copy-paste das jetzt mal von der anderen, von der anderen Seite, ob das hierfür auch funktioniert. Ah, Koggers, funktioniert. Warum das andere nicht funktioniert, verstehe ich allerdings nicht. Ja, warum das, warum das, das rotiert nicht in der Mitte, ja, das ist auch, irgendwie rotiert das, aber das Bild ist wahrscheinlich nicht ganz gerade, was da rotiert oder so. Keine Ahnung. Ja, fancy Zeugs, warum sollte man da irgendwie, jetzt machen wir das Ganze noch ein bisschen schneller, noch ein bisschen schneller. Bam. Okay, das ist vielleicht ein bisschen zu schnell. Es ist aber nicht ganz gerade. Moment, ich will jetzt, ich, das, CSS-Rotate-Infinite, das kann doch nicht so schwer sein. Endless Rotation Animation, okay, wie geht das? Man muss da echt, man muss da echt so eine Rotation, aber das haben wir ja, haben wir ja angegeben. Alter, die Musik geht mir mega offen, sag. Das muss doch irgendwie funktionieren. Ah, der, okay, nice. Ich copypaste das jetzt einfach mal, was er hier macht. Ansonsten kann ich auch erstmal damit leben. Ach nee, Moment, du meinst zusätzlich, ne? Nun ja. Übrigens, das ist gar nicht so unsinnig, ne? Mit diesem, also warum ich das drehen lassen will, das kann ich euch jetzt auch mal verraten, was ich eigentlich vorhabe. Span Alignment, okay, ja, das ist eine gute Idee. Kann man nicht einfach so Keyframes machen? Also warum ich will, dass ich das dreht, das kann ich jetzt mal revealen, warum ich das eigentlich machen will. Also ich will, dass das zwei Funktionen hat, dieses Icon hier oben. Und zwar einmal, wenn man draufklickt, also noch ist es halt der Button wie hier, das ist ein bisschen kacke. Wenn man draufklickt, kommt man in das Settings-Menü. Ach, in die Animation muss das rein, okay. Ich hab doch keine Ahnung. Ist das jetzt gerade? Nee. Was? Die Animation rein? Wie geht das? So? So? Ich weiß nicht, was ich machen muss. Aber Span Alignment, also warum ich will, dass ich das dreht, ist, ich will, dass das anzeigt, wenn ein Upload, weil eigentlich wollen wir heute ein Upload programmieren für das Ding, dass ich neue Memes uploaden kann. Vom zweiten Rechner aus oder vom Smartphone aus oder so. Und ich will, dass es sich dreht, solange der Upload läuft und sie nicht mehr dreht, sobald es nicht mehr läuft. Das ist richtig big brain. Okay, aber Alignment, das ist eine gute Idee, das können wir machen. Span Alignment hier. Ach so, du meinst hier. Nee, Textalign. Nee. Und das muss mit bei den Webkit transformen. Ach so. Also das muss da dahinter oder was? Ich hab keine Ahnung, wie das aussehen muss. CSS, Alter. Ach, ach, da unten dran. Ach hier. Alter Leute. Wow, das ist krass. So viel besser. Okay, jetzt verstehe ich sogar, was du meinst. Jetzt verstehe ich, dass man das hier einfach anpassen kann, wenn es nicht gerade ist. Okay, ja, ich hab's verstanden. Ich hab's verstanden. Ich gehe mal davon aus, dass es einfach nicht gerade ist. Also ich vermute mal, dass es nicht... Doch, das ist genau in der Mitte. Nee, ist es nicht. Guckt mal. Seht ihr das? Das ist ein bisschen zu weit oben. Guckt mal. Sieht es nur für mich so aus oder ist es bei euch auch so, dass das oben, dass das Bild einfach nicht ganz gerade ist? Das Bild hat links und rechts. Also das Bild ist 20, irgendwas mal 20. Ist kein Wunder, dass es nicht richtig dreht. Kann man das hier anpassen? Irgendwie darf ich sagen. Okay, das probieren wir jetzt mal aus. Mit so einem Scheiß verschwendet man immer die meiste Zeit, die man hat. Okay, also das heißt... Okay, im Button, im Button. Das können wir probieren. Also wir machen jetzt Button. Button. Style. Probieren wir mal aus. Button, Style. Und dann müssen wir das irgendwie alignen. Oh, jetzt kommen die krassen Tipps am Start. Display Flex, Justify Center, Align Center. Für den Button, ne? Also nicht für die Animation, sondern für den Button. Also für den da. Oder? Fast. Haha, fast. Das Span muss man style. Okay, also nicht den Button. Das sieht schon deutlich besser aus jetzt. Oder? Kommt es nur mir so vor? Es ist zwar nicht ganz gerade, aber ich finde es ist... Es ist gerade. Bisschen gerade als vorher. Ich glaube, da kann man im Prinzip nichts machen. Das Icon ist einfach nicht gerade. Guckt es euch doch mal an hier. Seht ihr das nicht? Das ist einfach weiter oben als unten rechts. Das ist einfach nicht gerade. Was? Justify Center? Okay, Moment. Moment, habe ich jetzt irgendwie ein bisschen zu viel copy pasted hier? Ah ja. Ne, nicht wirklich. Scheiß drauf. Wir halten uns jetzt viel zu lange an diesem hässlichen Zahnrad auf. Also falls einer eine gute Idee hat. Ja, das stimmt schon. Wahrscheinlich muss man das wirklich transformen. Aber ganz ehrlich, wir können es noch mal kurz probieren. Anderes Icon. Warum rotate das jetzt eigentlich nicht mal? Oh, Hä? Warum muss ich eigentlich Display Inline Block machen, dass es überhaupt rotatet? Was auch immer das macht. Das gucke ich mir mal an. Aber damit kann ich jetzt erst mal leben, so wie es ist. Es sollte sich ja gar nicht dauerhaft drehen. Sollte sich ja gar nicht dauerhaft drehen. Also wir haben hier Klaas. Koggers. Und wird also so viel Zeit mit irgendeinem blödsinnigen Kram verschwendet. Okay, die Klaas kommt jetzt weg. Jetzt einfach nur gucken, wie das funktioniert hat. Okay, also lass mich mal überlegen. Ich will jetzt track and dropen. Jetzt wird es kompliziert. Also was ich machen will ist, ich will ein Item hier drauf track and dropen dürfen. Das habe ich schon mal gemacht. Also von der Idee her weiß ich, wie das geht. Allerdings weiß ich nicht, wie das in Vue.js geht. Aber ich weiß nicht mehr genau, wie das funktioniert. Von der Idee her, ich bastel jetzt erstmal was und mal gucken, ob das funktioniert. Also als erstes müssen wir erstmal hier sowas wie on track enter track leave brauchen. Also ich werde das so machen. Ich habe mir das ja im Vorfeld schon mal überlegt. Wenn hier irgendjemand was rein zieht. Was ist denn Patrick? Was ist eigentlich WM-Finale? Ich wollte heute ausnahmsweise mal auf Fußball gucken. Es ist doch glaube ich erst um 17 Uhr, oder? Jaja, 17 Uhr. Okay. Dauer noch. Eigentlich guter Stream. Und uneigentlich. Ist auch noch gut. Ich hoffe es wird zumindest. Okay. Also ich bastel jetzt erstmal in der Hoffnung, dass das irgendwie funktioniert. Also wir brauchen sowas wie track. Weil das ist ja Vue. Das heißt wir machen das jetzt mit einem add davor. Weil die Tutorials das so sagen. Track over. Also das heißt wir brauchen jetzt die Events. Track enter und track over. Also sprich, sobald hier was reingezogen wird, löst das aus und sobald es drüber bewegt wird, löst das aus. So. Da machen wir jetzt eine Funktion dafür, die hier aufgerufen wird. Und zwar hier. Die nennen wir einfach irgendwie track. So. Und das Ding kriegt einen Event. Weil es kriegt alles in JavaScript einen Event. Kann man sich gar nicht dagegen wehren. Track. Und jetzt gucken wir mal, ob das funktioniert, wenn ich da was reinziehe. Ob das dann ausgelöst wird, das Event. Habe ich da Vue.js gehört? Ja, wir sind im Trend. Wir gehen mit der Zeit. Wir machen das jetzt mit Vue.js. Wir machen kein Raw DOM Manipulation 300 Zeilen Index JS mehr. Wir machen das jetzt ordentlich. Coggers log Event. Gucken wir mal, ob das Event auslöst. Konsole öffnen. Event löst aus. Guckt. Ich ziehe es drüber. Track enter. Track enter. Funktioniert. So. Und wie gesagt, nachdem ich wenig Frontends Zeug mache, weiß ich nicht, d.h. bevor ihr jetzt sagt, ok, der Max, der macht das so, so ist das gut, guckt euch lieber nochmal an anderen Stellen an, wie das richtig funktioniert. Aber von der Idee her werde ich jetzt so machen, sobald Track enter bzw. Track over ist, blende ich hier so einen Overlay ein. So ein Fullscreen Overlay, wo dann drauf steht, give your Memes oder irgendwie sowas. Und wenn man das dann loslässt, dann uploadet er das zum Server. D.h. wir müssen auch noch auf der Serverseite programmieren, dass er Uploads entgegennimmt. Musste aber noch alles außer GIFs Image filtern. Ja, richtig, richtig. Ich filte einfach alles, was nicht mit meinem Type Image anfängt. Trollprogramm. Das ist kein Trollprogramm. Also die Idee ist ja dahinter gewesen. Ich habe ja selbst sowas gesucht für meinen Stream. Oh, serious Max, das ist eine super Idee. Wir machen C9 GIF Energy. Den da, den machen wir. Der kommt da als Text dann rein. Das kommt dann als Text da rein, das ist gut, das ist nice. Das kopiere ich mir hier mal rein, damit ich es nicht vergesse. Okay, also wenn Track, also Track, okay, okay. Da brauchen wir noch irgendwas, wo wir uns das merken, ob ein Trackvorgang läuft. Also sowas wie, keine Ahnung, Track Active. Ich bastel jetzt einfach nur irgendwas grob hin, sowas von der Idee her hinkommen müsste. Okay, Track Enter, Track Offer. Das heißt wir brauchen jetzt noch ein GIF, ein GIF, was ich dann einplende. So, dann sagen wir, if, wenn Track Active, dann plenden wir das Ganze ein. Mal gucken, ob das funktioniert, wenn das nicht Active ist. Achso, das ist jetzt dahinter. Okay, dann nennen wir das jetzt mal ID. Das Ding brauchen wir noch CSS Styles, Track Overlay. So, CSS Styles, Coggers, ganz wichtig, Track Overlay. So, und dann kriegt das Ganze hier eine Höhe von, wir werden mal gucken, ob das anzeigt, und eine Höhe von 500 Pixel. Da ist es, okay. Dann haben wir Background, Background Color ist, jetzt, wir machen das erstmal fürs Dark Seam, Background Color ist Dark. Und dann lassen wir das einfach weg und sagen jetzt einfach nur Opacity, also, dass man durchgucken kann, ist 09. Das funktioniert nicht. Achso, Moment, ich muss das ja als Overlay machen. Das heißt, ich muss jetzt noch sagen, Position Fixed. Nee, fuck. Ach, du Scheiße, wie ging das nochmal? Ich will das ja als Overlay haben. Ich will ja, dass das nicht, ach du Scheiße, wie ging das hier Fixed? Float, nein. Display Flex, was Display Flex Fixed? Nee. Ach, fuck, wie ging das jetzt nochmal? Ähm, dass das als Overlay angezeigt wird. Ist das vielleicht im Hintergrund irgendwie? Nee. Absolut, absolut, ja genau. Nee. Warte mal, was mache ich denn hier jetzt verkehrt? Ähm, warte mal, also von der Idee her, ich will es ja immer, ich will es ja immer an der gleichen, an der gleichen Stelle anzeigen lassen. Also wir brauchen, wir brauchen schon sowas wie, ach, ich weiß, was wir machen müssen. Wir sagen Fixed und dann müssen wir nämlich noch sagen, Top, wo, wohin, müssen wir sagen, Left. Oder auch nicht. Warte mal. Warum zeigt es denn jetzt nicht an? Hä? Warte mal, was? Moment, das zeigt es doch an, oder? Oder nicht? Was mache ich denn jetzt verkehrt? Okay, was, warum zeigt das den Scheiß nicht an? Absolut, okay. Moment, das ist, ich hab doch, ich hab mich doch hier irgendwo garantiert verschrieben. Wirst du ein Video machen, wenn das Tool fertig ist? Weiß ich nicht, genau. Okay, von der Idee her ist es doch da. Warte mal, irgendwas, irgendwo habe ich gerade einen Denkfehler, das kann ja nicht so, kann ja nicht so schwierig sein. Also, das Ding muss doch Position Fixed. Hä? Track Overlay, ich hab mich auch nicht verschrieben, ne? Was, was mache ich denn jetzt hier verkehrt? Das kann doch nicht sein. Schieben wir das mal woanders hin. Man sagt nicht egal, wo das ist. Du mein, das ist ein Overlay, was absolut platziert ist. Schreiben wir mal was rein. Aber wirklich, wo ist denn dieses kack Overlay jetzt? Hä? Ich check's noch. Warum, warum wird das nicht angezeigt? Oh, ich krieg links geschickt, wie es richtig geht. How to CSS Overlay. Okay, gucken wir uns jetzt zusammen an. How to CSS Overlay. Ja, hab ich doch. Es ist doch fast genau das gleiche, was ich da gemacht hab. Doch, hier mehr oder weniger. Okay, Z-Index 2, meinetwegen. Ich check's nicht, warum wird das Overlay nicht angezeigt? Ich bin jetzt grad echt. Nee, nee, nee, sehbar, aber es ist ja, ich hab hier überhaupt keine Bedingungen irgendwie drinne. Ja, Displan, ja Displan None will ich ja auch nicht. Ich will's ja displanen. Wenn ich sag, hidden by default. Ich will's ja nicht heiden by default. Ich will's ja anzeigen by default. Ich bin verwirrt. Ach, ich, könnte das daran liegen, dass ich, warte mal. Ha! Ich hatte kein Background. Lull! Da muss er erstmal drauf kommen. Meine Fresse, ey. Richtig Omega-Lull. Alter! Das hat mich jetzt geschockt, ey. Nice. Okay, okay, okay. Weiter geht's, weiter geht's. Wir wollen das in Dark. Overlay. Jetzt können wir das machen, was ich eigentlich machen wollte. Und zwar sagen, durchsichtig. Genau. Das will ich als Overlay haben. So, und da kommt jetzt noch ein Text rein. Alter, CSS, JavaScript. Ich krieg echt die Krise, ey. Vor allem kann mir mal jemand erklären, warum erbt denn jetzt bitte schön nicht das Diff-Background-Color von Diff außen rum. Aus welchen Gründen ist das jetzt so? Kann das jemand erklären? Give memes. Give memes. Okay, so. Und da machen wir jetzt noch Schriftgröße. Da haben wir noch Text-Align. Da haben wir noch Center. So. Und, ähm, das ist Trick 17. Das hab ich mir mal gemerkt. Mit der Zeilenhöhe kann man das hier irgendwie auch noch vertikal zentrieren, weil ich weiß, ehrlich gesagt, aus dem Kopf nicht, wie man Text vertikal richtig zentriert in der Mitte. Wie macht man das eigentlich? So. Give memes. Dann sagen wir jetzt noch, äh, Font-Size. 50. Mal 50. Okay, vielleicht bisschen, bisschen viel. 40. Ein bisschen mehr Platz. So, schön. Es ist nicht sonderlich responsive, ja. Aber das passt schon. Vielleicht machen wir das noch ein Ticken weniger durchsichtig. Und noch ein bisschen mehr. Nee, das ist okay. Das ist gut so. So. Okay. Ähm. So, und das zeigen wir nur an. If this track active. Okay. Dann testen wir mal, ob das funktioniert. Von der Idee her. Also, das bedeutet, wenn ich jetzt was reinziehe. Und das ist das Schöne an Viewchairs, was ich sofort zu schätzen gelernt hab. Quasi schon während ich das Tutorial geguckt hab. Das bindet in beide Richtungen. Also sprich, ähm, oder besser gesagt, wenn ich jetzt sage hier, ähm, wo ist es denn jetzt hier? Ich sag hier, das wird nur angezeigt, wenn track active. Das heißt, wenn ich jetzt hier drinne irgendwo halt das hier auf True setze, dann rendert das automatisch rein. Das heißt, ich muss nichts machen. Nichts extra. So. Wir testen es jetzt einfach mal ganz billig, sagt track active. Das ist natürlich nicht so der Weisheitsletzter Schluss. Aber wenn ich jetzt was reinziehe, geht das Overlay hin. Sehr nice. Aber es geht noch nicht wieder weg. Das heißt, das müssen wir auch noch machen. So. Also jetzt gucken wir mal. Wenn Event. Ähm. Ich hab keine Ahnung, auf was ich checken kann. Event. Gucken wir uns mal das Event an, was da gefeuert wird. Kogas. So. Ähm. Event. Hat das irgendwie so was wie ein Type oder sowas? Type. Track over. Ok. Also wenn. Gucken wir mal, ob das so funktioniert. Wenn Event. Type. Track over. Oder Event. Type. Gleich. Track enter. Dann ist es active. Wobei, das können wir einfacher schreiben. So. Dann ist es active. Genau. So. Und jetzt müssen wir noch sagen. Und jetzt müssen wir noch registrieren, dass Track. Track. Oder Drop. Oder was auch immer für ein Event genau geworfen wird. Wenn man das. Wenn man das. Ach nee. Wir müssen. Es gibt ja zwei Fälle. Es gibt entweder. Es wird getropped. Oder es wird rausgezogen wieder. Wenn es wieder rausgezogen wird, müssen wir hier sagen. Ähm. Leave. Frag mich nicht, warum wir das alles in der gleichen Funktion machen, aber das ist jetzt erstmal ziemlich einfach. So. Eats. Funktioniert. Wobei. Es buggt. Guck mal. Es buggt. Wenn man schnell. Wenn man schnell reintrop, buggt es. Habt ihr es gesehen? Weil es mehrfach auslöst dann. Oh, das ist doof. Dann machen wir es anders. Wir machen es anders. Ha. Viel besser. Track. Leave. Binden wir nicht hier drauf, sondern. Track. Leave. Binden. Funktioniert das überhaupt? Äh. Mal gucken. Track. Leave. Binden wir hier drauf. Ha. Easy. Es gibt auch keine Bugs mehr. Oh, das ist doch. Das ist doch mega nice, oder? So. Und jetzt. Okay. So. Und jetzt brauchen wir. Jetzt müssen wir noch hier uns das Event für drop registrieren. Drop. Das heißt wahrscheinlich einfach nur Drop. On. Drop. Ja. Drop. Track. Oh, mega nice. Ja. Richtig nice. So. Warum auch immer wir jetzt unser Drop Event auf Track binden, aber das ist. Ich meine. Das ist JavaScript. Kannst mal richtig einrücken hier. So. Okay. Und jetzt müssen wir mal gucken, wenn das Event Type wahrscheinlich Drop ist. Vielleicht heißt es einfach nur Drop. Gehe ich mal von aus. Dann geben wir mal was aus. So. Drop. Moment. Ach. Moment. Ja. Moment. Ah. Scheiße. Ich muss dem Ding jetzt erst mal sagen, dass die. Dass die Standardaktion, die rausführt, nicht, nicht gemacht werden soll. Drag. Drop. JavaScript. Default. Action. Prevent Default. Klingt gut. Google Foo ist echt strong heute. Wir finden heute alles auf Anhieb. Ah. Ich muss F muss noch weg. Lohnen muss man in dem Framework die Methoden wirklich alle in ein Objekt packen. Man kann das irgendwie. Man kann das wohl auch irgendwie splitten. Also man kann irgendwie auch sagen, man macht den Skript Anteil in ein eigenes File und den Template Anteil und irgendwie sowas. Aber wir machen das alles alleine. Ich meine, es ist ja noch sehr übersichtlich. Sind ja 70 Zeilen. Das ist ja nichts. Und ich finde insgesamt, auch wenn JavaScript an sich immer ziemlich hässlich ist, das finde ich sogar recht gut lesbar. Unterschied zwischen Java und JavaScript sind zwei komplett unterschiedliche Programmersprachen. Nur weil die ähnlich heißen, haben die überhaupt nichts miteinander zu tun. JavaScript ist das Ding, was du im Browser hast, beziehungsweise Node.js. Also JavaScript meistens V8. Also du hast ja im Prinzip, JavaScript gibt es im Prinzip in, also von den Implementierungen her eigentlich drei große. Es gibt noch ein paar andere, aber eigentlich JavaScript hast du drei große. Du hast Chakra, du hast heute wie heißt die Firefox Implementierung, irgendwas mit Monkey glaube ich und du hast V8. V8 ist mit Abstand das am verbreitetsten. Das ist das aus Chrome und aus Node.js und das was eigentlich fast jeder verwendet. Chakra ist das von Microsoft Edge. Genau. Und Java ist halt eine komplett andere Programmersprache von Sun, äh von Oracle. Sun ist ja nicht mehr, hat es ja ausgesunt. Ich soll es erloschen bei Sun. 5 Milliarden Jahre zu früh, aber Sun ist Geschichte. Event-Default. Ich muss das gerade nochmal kurz stoppen. Ich muss noch hier das, äh, Steuerung F löschen, weil ich das zum Suchen brauche, das ziemlich doof ist. Event-Prevent-Default. Das hört sich gut an. Gibt es eine Programmiersprache, mit der man ins Programmieren einsteigen möchte? Ja, da habe ich ein paar Empfehlungen für. Es kommt drauf an, was du machen willst. Also, bzw. nicht so sehr, nicht so sehr was sagen wir mal, ne, das war alles blöd. Ähm, erstmal natürlich schon was du machen willst, aber wo du, auf welcher Plattform du unterwegs bist. Das ist ähm eine wichtige Entscheidung. Also sprich bist du unter Windows unterwegs und willst, sagen wir mal, mit Windows-Programmen anfangen, dann finde ich es zum einsteigen.net und C-Sharp das beste. Dazu gibt es auch so viele Tutorial-Videos und Bücher kostenlose und Stack-Overflow-Einträge und alles. Also unter Windows kann man nicht, äh, also da führt eigentlich kein Weg an.net vorbei und C-Sharp, wenn man unter Windows anfangen will. Ansonsten, ähm, weitere Sachen zum Einstieg finde ich ganz gut, so mal ganz allgemein, sind, äh, Python und Ruby. Einfach weil es, äh, somantisch, finde ich, sehr, sehr schöne, beides schöne Sprachen sind. Zwar komplett anders, ja, Python ist eindeutig das ordentliche, aber Ruby ist, äh, relativ nah an, also an der natürlichen Sprache dran, wie man Ruby programmieren kann. Und das, das, ja, das vierte im Bunde ist eindeutig JavaScript, wenn du Web-Geschichten machen willst. Und eigentlich ist das, sind diese, diese vier Sachen. Lassen wir mal Ruby, lassen wir mal Ruby weg. Wobei Ruby nicht schlecht ist, weil viele, viele der aktuellen, moderner Tools kommen von der Idee her so ein bisschen aus der Ruby-Ecke. Auch wenn Ruby schon ziemlich, also die besten Tage hinter sich hat, vor allem Rails, ja, ähm, aber viele Ideen, also auch die ganzen, so wie die Web-Frameworks heute funktionieren und wie die, wie die ganzen Test-Tools und so funktionieren, das ist sehr stark von Ruby-Sachen inspiriert. Ähm, aber eigentlich, wenn, wenn du, wenn du, ähm,.NET, also wenn du C-Sharp kannst und JavaScript und vielleicht noch Python, wenn du das in Kombination hast, du kannst eigentlich alles machen. Du kannst wirklich, es gibt nichts, was du nicht machen kannst. Ähm, alles. Du kannst alles, Unity kannst du C-Sharp programmieren. Du kannst alles machen. Wenn du die drei Sachen kennst, ist, ist perfekt. Und natürlich gibt's immer noch, muss man sich immer weiterbilden. Das gibt's jetzt Go ist angesagt. Dann gibt's jetzt noch Flutter. Kennt, kennt ihr Flutter? Das ist von Google jetzt was Neues für, für UIs. Ähm, aber wenn die drei Sachen hast, da kannst du wirklich, da fehlt dir nichts, ja? Und mit was du davon anfängst, ist eigentlich egal. Ich würd's davon abhängig machen, auf welcher Plattform ich bin und ähm, was ich, was ich machen will. Sprich bist du unter Windows und willst Windows-Programme machen, dann würd ich mit.NET anfangen und C-Sharp. Willst du Web-Geschichten machen, egal wo, dann mit JavaScript und, ähm, bist du vielleicht unter Mac oder Linux oder so unterwegs und willst, ähm, da irgendwas machen bzw. äh, in Verbindung für, für JavaScript Web-Geschichten mit Python lernen. Es ist, nimmt sich eigentlich nix großartig mit was du anfängst. Mein persönlicher Favorit zum Anfang ist, weil die meisten Leute sind unter Windows und so Windows-Programme sind auch immer ne schöne Sache zum Üben, ist mit.NET und C-Sharp anzufangen. Du kannst, du kommst im Prinzip, aber angenommen, du lernst das jetzt und hast dann, lernt es spät und du willst das irgendwann mal auch beruflich machen und lernst das dann bei der richtigen Firma, du müsstest theoretisch nie wieder was anderes lernen, wenn die Firma das macht und das sich noch hält. Aber eigentlich will das kein Programmierer, also keiner den ich kenne und da wirklich was taugt, ja, und die wollen jetzt in der Regel lernen die Leute freiwillig neue Sachen, weil es es interessiert. So, genug geschwätzt. Okay, PreventDefault, haben wir gesagt, ne, muss man machen. PreventDefault. Habe ich die Frage auch beantwortet damit? Ich weiß nicht mehr wer sie gefragt hat, aber ich hoffe das hat jetzt irgendwie Sinn ergeben, was ich vor mir gegeben habe. Ha, funktioniert, guckt. Nice. Also der Upload funktioniert nicht, aber rein und raus funktioniert und beim loslassen funktioniert es jetzt auch. Das ist schon mal, das ist schon mal richtig, das ist schon echt extrem Korgas gerade. Die Musik eher. Okay, so, also wir können jetzt Bilder reintrecken, droppen, sehr schön. Jetzt müssen wir noch gucken, dass der Scheiß geuploadet wird. So, ifEventDrop, also sprich, der Typ hat das Bild reingezogen und hat es auch losgelassen. Das war eine sehr gute Ahnung, das ist schön. Bin ja froh, wenn das was bringt, was ich so erzähle. Okay. Wenn das EventDrop ist, also sprich, der Typ hat die Bilder losgelassen, dann muss ich mir mal das Event angucken, was da jetzt eigentlich reinkommt. Zack. EventType, kann man das ein bisschen kürzer machen hier ohne, jawoll, dass ihr auch was seht. EventType ist Drop. Nice. Desmond. Nee, Desmond, das kann ich nicht aussprechen, ich sag mal Desmond. Also, ich finde die Motivation, das ist falsch rum. Man braucht was, was man machen will, dann lernt sich die Sprache und das Drumherum quasi dabei bzw. von alleine. Also, wenn man sagt, man lernt jetzt eine Sprache und wenn man die Sprache kann, dann mach ich was damit, dann hat man nicht die Motivation, das zu lernen. Du musst, als erstes muss stehen, dass du, also, das erste, was man machen muss, man braucht eine Idee, was man machen will und dann sucht man sich das, was dafür passt und setzt das damit um. Dann hat man auch keine Motivationsprobleme, weil man ja als Ziel hat, dass man was Spezielles machen will. Wenn man einfach nur was lernt, um danach was mitzumachen, wird man es nicht lernen. Also, du brauchst, du brauchst irgendeinen Aufhänger. Also, zu sagen, ich will jetzt ein, keine Ahnung, ein Meme Tool programmieren. Was brauch ich dazu? Ich brauch irgendwie ein Backend-Geschichte und ich brauch Javascript. So. Und ich hatte hier vor auch keine Ahnung von Vue.js oder sonst was, paar Tutorials angeguckt, weil dementsprechend auch die Motivation da war, weil ich das machen will und eats as fuck. So. Okay, also, Trangle-Trop. Wenn das Event-Trop ist, dann... Moment. Jetzt hab ich hier eine halbe Stunde reincopy-pasted. Also, wenn das Event-Trop ist, was ist denn da alles so drinnen? IsTrusted, bla, bla, bla, Path. Wo krieg ich denn jetzt die Files her? Ich meine, muss ja irgendwo stehen, welche Files getracked and dropped wurden. Track-Overlay, Two Element, bla, bla, bla. Wo stehen denn jetzt die Files drinnen? Datatransfer. Oh, das klingt gut. Datatransfer-FileList. FileList ist 0. Warum ist denn die FileList 0? Ich glaube, das buggt rum im Browser, die Anzeige. Aber FileList klingt gut. Also sprich, Files ist Event-Datatransfer-Files. Ähm, da machen wir mal ne Schleife drüber und lassen uns mal die Files... Ups. Alter. JavaScript. In File... Übrigens, ist ein JavaScript auch übelst verwirrend, ne? Dass es for each, for off und for in gibt und so. But why? Weil JavaScript. File. Coggers, da ist es. F12, Coggers. File, FileName. F12, Coggers. Ok, das heißt, hier haben wir die Files drinnen. Ok. Oh fuck, wie schicke ich denn das jetzt zu meinem Server? Äh, wie schicke ich das jetzt zu meinem Server? Ich brauch, ich brauch nen... ViewHTTPPost. Wie macht man das? ViewResource. Das klingt gut. SendPostRequest. Weil ich muss jetzt ja, also von der Idee her, ne, was ich jetzt vorhabe, ob das funktioniert oder was ganz anderes. Also, wenn irgendjemand ein Bild hier reinzieht und loslässt, dann wird das hier aufgerufen. Ich, ähm, hol mir die Dateinamen raus. Beziehungsweise, wahrscheinlich kann man das auch irgendwie einlesen hier drüber, muss ich da mal gucken. Ähm, ich hol mir die Dateinamen raus, was gedroppt wurde, weil ich mein, es kann ja auch sein, dass irgendwie einer drei Sachen droppt oder so. Und jetzt muss ich die irgendwie zum Server schicken. Das heißt, wir müssen jetzt zwei Sachen machen. Ich muss, ähm, auf dem, auf dem Server muss ich einstellen, muss ich noch was, müssen wir hier im Backend noch basteln, dass ich überhaupt das annehme. Aber bevor ich das mache, will ich erstmal im Frontend einstellen, dass es überhaupt zum Server hinschickt. Moin, Elina, Elinas, was ein S ausmachen kann. Das S macht Grill oder nicht Grill aus. Ähm, genau, und dann schickt das zum Server. Das muss ich dem jetzt irgendwie beibringen. Wie macht man ein Postrequest aus Vue.js? Beziehungsweise, wie macht man überhaupt im Browser das? Geht das nicht mit Fetch? Fetch ist doch irgendwie ein neuer, neuer Special API. Axios? Nee, das ist echt, ich will irgendwas eingebautes nehmen. Das gibt es, das habe ich letztendlich nicht mehr gelesen, es gibt so ein neuer, neue HTTP API im Browser. Hä? Ah, hier oben. Fetch? MethodPost? Ähm, warte mal, da gibt es doch bestimmt irgendetwas, warte mal. Ich habe doch das da. Das ist irgendwie ein bisschen für Vue.js da. Das ist doch viel, viel nicer. Ja, so. Oh, das ist schön. Das ist nice. Das ist schick, sowas hier. Einfach nur blablabla. Anstatt, anstatt, anstatt get kann man hier bestimmt auch post machen. Das ist schön. Das nehmen wir. Da müssen wir uns nicht mit hier irgendwie, ähm, merkwürdig in APIs rumquälen. Vue.Resource nehmen wir, Vue.Resource. Packen wir das mal als Skript rein zum Testen nur. Danach laden wir das runter und schieben. Aber wir können es auch gleich runterladen. Aber gleich runter. Ladest du das am besten jetzt runter? Lol. Scheiß drauf. Ich will jetzt erstmal ausbringen, ob das funktioniert. Danach laden wir das runter. So, ähm, wo ist es denn hier? Skript. So, und jetzt kann ich hier sagen, this things, rttp, oder wie ging das jetzt? Post, post, url, ok. Post. Hat er ein Beispiel für ein Post? Post. Ich denke, dass wir Dinge mit Postrequest machen können. Und sonst kannst du das überhaupt nicht gebrauchen. Fetch ist simpler. Ok, ja, kann auch sein. Also, ja gut, Fetch ist wirklich simpel. Ja, das stimmt schon. Guck mal, das ist eats as fuck eigentlich. Ich mein, du musst ja nichts machen. Du sagst die World, wo du hin willst. Ich mach das jetzt mal mit Vue.Resource und danach stellen wir das auf Fetch um. Also hier, so, das will ich. Das will ich haben. So, also, Post machen wir api slash upload. Ähm, das muss ich noch anlegen, das gibt's auf Serverseite noch nicht. Diese Seite. So, senden tun wir. Fuck, was sende ich denn da? Die Files? Nee, das kann nicht sein. Config haben wir nicht. Und jetzt machen wir Trick 17, ich sehe, das ist so ein Promise Zeug, da können wir Await verwenden. So, als alter C-Sharp-Fan. Ist mir, ist mir das hier eine viel lieber Syntax. What? Ist mir die Syntax so viel lieber? Moment. Await is only, ach so, Async Functions. Ok. Async. Ja, ach gut. Upload Files. Files kann ich so, das geht so nicht. Garantiert geht das so nicht. Aber wir können mal gucken, was passiert. Restart. Also wir laden das jetzt zu unserem Server hoch, hier unter dieser Uhr. Allerdings gibt's das auf Serverseite noch gar nicht. Dementsprechend kann das nicht funktionieren. So, method not allowed. Das ist klar, mein Server sagt, gibt es nicht. Aber es funktioniert prinzipiell. Also das, das klappt doch. Kann man, kann man eigentlich sowas hier machen? Also jetzt haben wir eine Frage an die JavaScript-Kanäle. Also angenommen, ich benutze hier Await. Was, was kann ich ihm denn sagen, was er im Fehlerfall machen soll? Also ich sag jetzt hier Await Result und was sag ich ihm auf, was sag ich ihm on Error? Try Catch. Ich weiß nicht, ob sowas gibt. Keine Ahnung. Await Promise Error. Wie macht man das? How to write? Noob. Ja, richtig. Reject. Reject. Aha. Interessant. Reject. Gucken wir uns das mal an. Reject. Reject. Ah ja. Okay, also sprich, geht das, geht das dann so? Reject. Äh. Keine Ahnung. Kein Chimmer. Try Catch? Nein, nein, nein, nein. Reject. Ja, mach ich doch. Wir gehen einfach davon aus, dass es keinen Fehler gibt. Ja, ich bin, ich bin geneigt dazu, das zu machen, ja. Reject is not a function. Was mach ich denn verkehrt? Oder ist das gar kein Promise? Aber wenn es kein Promise wäre, könnte ich es doch gar nicht Awaiten. When, when we use Async and Await, we write it because... But, but... Alter, warum ist das in JavaScript alles so kompliziert? Egal. Es gibt keine Fehlerfälle. Es gibt keine. Es gibt keine Fehler. Easy. Wir ignorieren es einfach, dass es Fehler gibt. Ach so. Punkt Catch ist es. Punkt Catch. Ha. Nee. Ach fick dich, keine Ahnung. Lol. Was weiß ich wie der Scheiß funktioniert. Es gibt keine Fehler. Fehler outdated, overrated, debated. Brauchen wir nicht. Ja, ja doch. Aber ich will es ja eigentlich mit Await machen. Also, dass ich schreiben kann irgendwie. Wenn sonst was, sowieso ist klar. Aber warum kann ich nicht Await und Error oder irgendwie sowas. Also, quasi Await da drauf und wenn Fehler dann... Ach, keine Ahnung. Ich hab das Promise Prinzip noch nicht verstanden. Das ist richtig. Das ist korrekt. Da kann ich nichts dagegen sagen. Das ist so. Await debated. Jetzt gucken wir uns dann klar hin. Jetzt will ich erstmal den Upload hinkriegen. Das ist aber richtig, Ibims Mary. Ich hab das Promise Prinzip wirklich nicht verstanden. Ich hab allgemein wenig verstanden, weil es um JavaScript geht. So. Result. Okay Result ist dann... Moment. Ist das Result? Ist in dem Result dann vielleicht irgendwie das? Was ist drinnen? Also Saito, wenn du irgendwas hast, im Zweifel machst du auf Pastebin oder so. Aber ich lasse es jetzt erstmal. Ich will jetzt erstmal gucken, dass es mit dem Upload funktioniert. Okay. Also, wenn ich es jetzt hier reintrack und droppe, dann versucht ihr es zum Server zu posten. Gut. Nice. Das heißt, als nächstes müssen wir uns auf der Serverseite einstellen. Mit einer ordentlichen Programmiersprache, dass er das entgegennimmt. Da geben wir uns einen AP-Controller, der noch nicht allzu viel macht, außer bei Index irgendwie ein sinnloses JSON zurück zu liefern. Das heißt, das können wir uns auch gleich schon mal schenken. So. Oder wir schreiben das einfach um. So. Das Ding haben wir genannt Upload. Upload. Upload. Mega Upload. Mega. Wir brauchen gleich noch mal den Mega Upload Song, oder? Leute, was sagt ihr? Bist du eigentlich auch schon so hyped auf die Black Ops 4 Beta? Du weißt gar nicht, dass es eine Black Ops 4 Beta gibt. Gibt es eine Black Ops 4 Beta? Open Beta für August angekündigt. Oh mein Gott. Black Ops 4 Beta. Mit Granaten. Mit Noobtube Grill. Warum? Warum? Also nicht warum. Ist das überhaupt ein Grill? Ich weiß nicht. Aber warum Noobtube? Warum sehen wir schon den Noobtube auf dem... Warum? Wenn du als BWLerin sitzt und keine Ahnung hast, was passiert. Ja, aber das ist doch als BWLer normal, oder? Omega Lul. Also ich weiß nicht, ob ich so gehypt bin auf Black Ops. Keine Ahnung. Dreck. Also wenn die Beta kostenlos ist, dann werde ich mir das wahrscheinlich mal angucken. Ah, nee, nee, nee. Okay, also. Wir müssen dem Ding jetzt irgendwie beibringen. Paste Bin. Oh, das Saito. Das Saito blickt durch. Await Promise Function Catch Error. Das habe ich ausprobiert eben. Das hat nicht funktioniert, weil ich probiere es jetzt nochmal aus. Ich probiere es nochmal aus. So. Wo habe ich es denn hier? Da. Also. Okay, wir probieren es jetzt nochmal aus. Ach, ich habe es wieder verkackt. Ich habe wieder auf den Kopf gedrückt, obwohl ich nicht auf den Kopf drücken darf. Das hat jetzt zwar keiner verstanden, was ich meine, aber ich habe es verstanden. Das reicht. So. Weil es geht kaputt, wenn ich jetzt zweimal starte. So. Also. Angeblich geht das so, schreibt das Saito. Das bedeutet. Await Blablabla. Falsch Catch. Das habe ich eben. Ach so. Ah. Muss man das dahinter schreiben? So was hier. Achtung Leute. Gucken, ob das jetzt funktioniert. Bam. Ja. Ja. Das funktioniert. Coggers Leute. Nice. Error Handling in 2K18. Ah. Mein Chat ist halt einfach der beste. Mein Chat weiß halt Bescheid. Das sieht überall hässlich aus. Egal, wo ich es hinschiebe. So. Nee. So. Nee. Sieht ja egal, wo ich es hinschiebe. Kacke aus. Wir lassen es da hinten dran hängen. Ok. Sehr schön. Sehr, sehr nice. So. Jetzt müssen wir unseren AP Controller. So. Ja. Ja, warum nicht? Ja, stimmt. Sieht doch ganz hübsch aus. Ok. So. Jetzt müssen wir uns dem Server irgendwie beibringen, dass er die Upload-Geschichte entgegen nimmt. Und dazu muss ich, weil meine Standard-Routen komplett fail sind, die werfe ich einfach mal alle raus. Sonst reagiert das überhaupt nicht auf Upload. So. Dann sagt man eben hier, für welche Route er zuständig ist. Route. Und zwar ist er zuständig für slash ap slash upload. Das ist das. Also sprich, nur so zur Erklärung, wenn man jetzt sagt, ich rufe auf meinem Server auf, also quasi sowas hier, ap slash upload. So. Dann muss er ja wissen, welchen Code er letztendlich aufruft dahinter. Und das sagt man hiermit. Ok. Upload. Und das Ganze ist ein HTTP-Post. HTTP-Post. Kein Get, sondern ein Post. Weil wir wollen ja was schicken. Also wir wollen ja was zum Server schicken. Wir wollen nichts abrufen. Da wäre es ein Get. Wir wollen was posten. Zum Server. So. Upload. Dann müssen wir eben natürlich auch noch sagen, was wir haben. Ok. Scheiß. Wie macht man, ich bin echt jetzt überfragt. Wie macht man denn jetzt einen Image-Upload? Wie macht man das jetzt richtig? Datei-Uploads in ASP.NET Core. Also wir sind heute wirklich Weltmeister im Googeln. Highform-File. Post. Ok, die schreiben das ein bisschen anders, aber das ist wurscht letztendlich. Ok, wir kriegen eine Liste mit Files. Das ist von der Idee her auch logisch, weil ich kann ja mehrere Dateien markieren und hochladen. Ok. Eine Stunde geht Fußball aus. Alter Fußball. Also ich glaube ich werde es mir heute echt mal geben. Ich glaube ich gebe mir heute mal eine Runde Fußball. So Files. Files kann ich mal angucken. So. Also brauchen wir im Endeffekt das hier. Lists. Muss man erstmal einbinden. Fußball. Doch. Normalerweise bin ich richtiger Informatiker, was Fußball angeht. Ich gucke nie Fußball. Ich gucke nie Fußball. Ich habe aber auch früher nie Fußball geguckt. Was ich früher gerne geguckt habe ist, wahrscheinlich werde ich jetzt sagen, wie kann man sowas gucken. Ich habe immer gerne Tour de France und sowas geguckt. Als ich noch ein bisschen jünger war. Als ich in Ulrich noch am Start war und sowas. Da habe ich immer Opa zusammen geguckt immer. So Rundfahrzeugs. Upload Files. Ich habe keine Ahnung ob das funktioniert. Ok. Wir geben jetzt mal 200 zurück. 200 ist immer gut. 200. Easy. Und jetzt lasse ich mir mal ausgeben, falls das in irgendeiner Form funktionieren sollte, ist es beim Programmieren eigentlich normal, dass man fast 95% der Zeit auf Stack Overflow ist oder Sachen googelt. Ja. Nicht falsch verstehen. Das gibt es nicht falsch verstehen. Ist so. Ist so. Ist so. Wenn 75% mal reichen. Wenn du was neues lernst, sind es wahrscheinlich sogar 90%. So. Ob das jetzt funktioniert? Ich glaube ja nicht, aber probieren wir mal aus. Vielleicht sollte man eine Konsolenausgabe einstellen. Danke, dann kommst du wieder. Also du musst dir nicht blöd vorkommen, wenn du googelst. Das ist vollkommen normal. Das ist das Normalste der Welt. Stack Overflow gucken, googeln. Ist das JavaScript? Das ist C-Sharp. Das ist JavaScript. So. Jetzt bin ich ja mal gespannt, ob das jetzt irgendwie funktioniert. Ok. Ich track and drop jetzt mal ein Bild. Oh. Not acceptable. Warum nicht? Moment. Ach so. Ja, weil das das falsche Format ist, in dem ich das schicke. Wir haben Leute vor Google programmiert. Sehr viel langsamer. Sehr viel langsamer und für jeden Scheiß das Rad neu erfinden. Arbeitest du mit ASP.NET? Ja, das ist ASP.NET Core 2.1? 2.0? Ich glaube 2.0. Es ist ja auch klar, dass das nicht funktioniert, weil das Format nicht stimmt, in dem ich das schicke. Das Format ist fail. Ich kann nicht einfach die Files da dran hängen. Da muss ich, siehste? Google. Upload. Files. JavaScript. I form data. Ok. Form data. Das heißt ich, achja gut, ich hängs aktuell einfach nur als dieses komische File Objekt dran, was ich kriege. Ich muss das als Form data posten. Also quasi wie, wenn ich das in so einem File select Dialog drin hätte. Ja. Form data append. Append. Append user file. File input elements file. Input. Ok, wir haben aber kein Input. Aber wir haben eine Files Liste. Das machen wir jetzt einfach mal so. Wir machen das so. Jetzt wird einfach mal ganz eiskalt wieder copy pasted. So. Files. Also Form data. Eine Schleife über das ganze. File. Nein. File. Of files. Und dann sagen wir Form data append. File. Und jetzt gucken wir, ob das Scheiß funktioniert. Ups. Was hab ich jetzt gemacht? Ah, ich hab F5 gedrückt. Das war keine gute Idee. Wie wurde eigentlich der erste Compiler kompiliert? Gar nicht. Achso. File. Files. Irgendwie so. Files. Ja. Ja. Ja. Ob das jetzt klappt. Ich bin skeptisch. Fuck. Ha. Ah, Moment. Vielleicht soll ich auch das Richtige pasten. No happy meal, mein. So. Not acceptable. Ha. Was mach ich denn jetzt falsch? Was mach ich jetzt falsch? Hm. Warum klappt das jetzt nicht? Was mach ich denn falsch? Hm. Happy upload. Ist in meinem Controller irgendwas falsch? Ah. Muss das da hin? Mit oder ohne Slash? Ah, bin ich mir nicht so sicher. Okay. Probieren wir es nochmal aus, ob ich mich da vielleicht irgendwie verschrieben hab. Aus Versehen. Ach. Fuck. Was ist denn das Problem jetzt, Alter? Wo ist das Problem? Was? Warum spackt es denn jetzt rum? Was mach ich denn falsch hier? File upload. Ha. Hm. Was ist daran denn jetzt bitteschön falsch? Was? Was ist daran jetzt verkehrt? Not acceptable. Hab ich irgendwie zu viel Zeug deaktiviert oder was? Schauen wir mal. Schalten wir alles an. Ha. Ich hab irgendwas war nicht aktiviert, was aktiviert sein musste. Okay. Was auch immer. Was auch immer. Sehr, sehr nice. Okay. Das funktioniert. Das funktioniert. Also das Upload funktioniert. Jetzt müssen wir nur noch gucken, wie ich auf Serverseite dieses Bild irgendwie speichere. Funktioniert. Sehr, sehr nice. Okay. Okay. Aber der Upload klappt. So, jetzt muss ich nur noch gucken, wie man das Bild irgendwie speichert. So, das Result brauchen wir nicht. Okay, dann speichern wir den Kram jetzt mal. Ach nee, wir müssen auch noch hier eine Sache einbauen und zwar, dass wir nur. Wir akzeptieren nur Images. Richtig. Wir akzeptieren nur Images. Und das müssen wir Serverseitig und Kleinseitig machen, weil ich mein, Kleinseitig kann jeder, jeder machen, was er will. Beziehungsweise. Eigentlich können wir drauf scheißen, wir machen das nur Serverseitig. Wenn irgendwie einer so doof ist und lädt da Scheiße hoch, dann nehmen wir es einfach Serverseitig nicht an. So, also for each, File in Files, File Type, Content Type. So, Content Type ist dann wahrscheinlich so was wie Image slash PNG und sowas. Startet muss starten mit Image. Ansonsten wollen wir es gar nicht. Das machen wir hier mit Link, dann ist das viel schöner. Select, F, Content Type starts with Image. Das heißt, wir nehmen jetzt nur die Bilder, die auch mit Image starten. Und nu. So, und nun speichern wir das irgendwo. Also, File, was gibt es denn da alles so? Objekt. Objekt, das muss iPhone-File sein. Objekt, the fuck? Wegen dem Select oder was? Ja, wegen dem Select, was auch immer. Das War ist eigentlich nur so eine taktische Geschichte. Also guck, wenn ich über das War gehe, der weiß, dass das ein iPhone-File ist. Also, so oder so ist genau das gleiche. Das ist einfach nur kürzer. Also, War ist in sich nicht wahr. Ich habe auch, ehrlich gesagt habe ich keine Ahnung. Also, War ist quasi nicht, ist quasi halt einfach nur für Variable anlegen, nicht, dass der Typ Variabel wäre. Ja klar, ich kann es danach wieder casten, aber warum weiß er das nicht, dass es ein iPhone-File ist? Was soll das sonst sein? Das ist eine List auf iPhone-File. Keine Ahnung, da war mir das If drin. War ist nicht wahr. Content-Type, Start, das schreiben wir jetzt gleich zum zwanzigsten Mal. Image, so. Wenn das, wenn das ein Image, wir machen das einfach so, wenn das, wenn das ein Image ist, dann... Ach, Wear, nicht Select. Ach, ja, WTF, klar, natürlich. Oh Mann. Ja, klar ist es Wear, nicht Select. Oh Mann. Das ist zu viel, zu viel Sprachen, Müschtmasch. Da blickst du aber durch. Ich glaube, in Javascript ist Select, oder was, in Javascript war es Filter? Ja, genau. In C-Sharp ist War quasi einfach nur syntaktisch. Das ist immer fest. Deswegen, nur mal so zu erklären, ich kann sagen War, Plup ist eins, allerdings was da nicht geht ist das hier. In Javascript wird das funktionieren, dass ich quasi erstmal sage Plup ist eins und danach ist es in String irgendwas, geht aber in C-Sharp nicht. Weil, sobald das Ding einmal angelegt ist, sieht man auch hier, dass es in 32 und das ist, bis dieser Scope hier fertig ist, ist es immer in 32. Javascript ist Filter, ok. Moin Informatiker, underscore, Formatikorps. Ok, also File, blablabla, Plup. So, und nun will ich das Ding einfach mal irgendwo serverseitig wo hin speichern, einfach nur damit ich weiß, ob das funktioniert mit dem Upload. Copy2, oh nice, da ist schon alles eingebaut. Also ich mag ohne Scheiß die, man kann auf Microsoft viel rumhalten, aber die.NET, das ist ja nicht mal die.NET Standard Library, halt die ganzen offiziellen.NET Libraries, die sind alle super durchdacht, das macht Spaß damit rumzubasteln, das ist einfach schon alles dabei. File, Copy2, ok, was jetzt hier noch fehlt ist File, Copy2 und dann da Teilnahme, da muss ich jetzt halt selbst machen, also dass ich da irgendwie sowas sage wie Using, File, Dot, File, Reader, File, File, File, Stream, ne, warte mal. File, was gibt es denn File, ich weiß nicht, achso, weil es doppelt belegt ist, lull. File, File, Stream, Stream, Stream gleich, File, Stream, File, Stream müssen wir importieren, zack. So und zwar File, Stream für File, File Name, ok, dann speicher das jetzt einfach im aktuellen Verzeichnis, wo es läuft, das Bild, das ist ja ok. Mode, Create, ok, so und dann sage ich File, Copy2, das ist halt wirklich Eats, Stream und dann sollte, also von der Idee her sollte ich jetzt ein Bild, no happy meal for you habe ich gehört, aber hat er nicht Berufung nochmal eingelegt, dass er nicht ausgeliefert wird. So also von der Idee her, ich track and drop jetzt ins Webinterface ein Bild und dann erscheint das hier. Bam, easy clap, funktioniert, Bilder Upload klappt. Sogar ziemlich easy, das war, also das war jetzt wirklich nicht schwer. Ja, das ist geil, wie gut das funktioniert. Moin, Mango United Gaming, das war jetzt wirklich einfach, viel einfacher als ich mir das vorgestellt habe. Ok, weiter im Text, also wir haben jetzt noch 40 Minuten Zeit bis Fußball losgeht, dann machen wir das mal. Also wir schaffen es jetzt Bilder hochzuladen, das heißt wir wollen ja eigentlich nicht die Bilder hochladen in irgendwie ein Verzeichnis, sondern in das Memeverzeichnis, dass es dann da erscheint, das heißt ich muss jetzt erstmal mir ein Memelippo besorgen, wo ich mir den Fad hole. So, das muss man noch hier injecten, dass es funktioniert. Magic, mehr muss man dazu nicht sagen, also sprich dadurch, dass ich das jetzt hier beim Anlegen von dem Server eingegeben habe, kann ich jetzt das Repo auch auf Magic Art und Weise irgendwie hier verwenden, weil Magic, so und jetzt heißt ich kopiere das Ganze jetzt in Tag, also der Fad, der Fad, wo das Bild hin muss, ist PathCombine und zwar mein Meme-Ordner, der da plus Filename von dem hochgeladenen Image und dann kopiere ich das dahin. So, wenn das jetzt alles funktioniert, dann sollte jetzt folgendes passieren, ich track and drop jetzt quasi hier in den Meme rein, wenn man irgendein 20 noch nicht drinne hat, so das da zum Beispiel, ich track and drop das hier jetzt rein und dann, das müssen wir mal Vollbild machen, dass man es sieht und dann lädt er das zum Server hoch, also ich ziehe das hier rein, dann kommt das Upload auf Alley, ich lasse den Maus, ich lasse jetzt los, dann lädt das zum Server hoch und fügt es hinzu. Das hat nicht funktioniert. Warum nicht? Moment, warum hat das nicht funktioniert? Warum hat das nicht funktioniert? Ah, weil ich, oh ich noob, guck mal, ich habe den Ort nicht eingetragen, der hat es jetzt wieder, guck mal, da hat es jetzt wieder in dem Verzeichnis von vorher gespeichert. Ah, da ist es, da soll es ja gar nicht hin. Ja, Spatzgranate, hast du recht, das war eher Spatzbremse hier gerade, dass es nicht funktioniert. So, nu aber, ok, nochmal. Warum kann, ich muss mich jetzt mal kurz über Windows nochmal auskotzen, warum kann der Windows Explorer keine Tabs? Ich meine, WTF Microsoft, warum? Guck mal, im Windows Explorer spätestens, wenn man vier so Dinger, drei so Dinger auf, du blickst nicht mehr durch, du hast keine Ahnung, warum kann dieses Scheiß Ding keine Tabs? Ich verstehe es nicht. So, easy. Ha! Bam! Oh, ich habe es irgendwie kaputt gemacht. Ah, ok, das muss ich noch ausschalten, dass es nur für externe Bilder geht und nicht für eigene Bilder. Aber es hat funktioniert. Wird die App dann immer über den Browser angesprochen? Ja gut, die App an sich hat ja kein User Interface. Die App an sich funktioniert ja über Shortcuts, wie die hier siehst. Also, das da. Also, da hast du Shortcuts an deinem Streaming Rechner. Das Web Interface ist ja dafür gedacht, dass man das vom zweiten Rechner oder vom Smartphone oder Tablet bedienen kann. Und das ist, wenn man sich das mal überlegt, auch die einzig sinnvolle Variante, eine Oberfläche zu machen für ein Tool, was quasi im Hintergrund sein soll während dem Streamen. Deswegen ist die einzige Oberfläche, die es gibt, halt Web Interface, weil es die einzig sinnvolle Sache ist an der Stelle. Aber man hat gesehen, Track & Drop funktioniert sehr nice. Ja, Stream Deck Integration machen wir noch. Allerdings ist meins, finde ich, ich finde mein Tool ist besser in einem Punkt als Stream Deck, deutlich besser. Und zwar der Streamer sieht selbst, was er anzeigt. Und das ist der hauptsächliche Grund, warum ich das Ganze überhaupt programmiert habe. Das Problem nämlich mit Shortcuts in OBS und Stream Deck und sowas ist, das ist quasi per OBS Plugin. Also, der rendert das in OBS rein, aber du selbst siehst es nicht. Das heißt, wenn ich jetzt einen Shortcut habe im OBS und blende das hier ein. Ich blende irgendwas ein in OBS über einen Shortcut. Dann lasse ich es eine halbe Stunde eingeblendet, weil ich es selbst nicht sehe. Und außerdem haben wir ja noch super Features wie Kogas schnell und Kogas langsam. Das ist witzig, weil ich habe ja eingebaut, dass man Bilder drehen kann und sowas. Und wenn man jetzt einen lustigen Effekt ergibt, wenn man hier Lull Shake macht. Wenn der Streamer das nicht selbst sehen will, dann würde ich das nicht verwenden. Aber das war ja gerade auch die Aufhängung bei mir. Ich wollte es ja gerade sehen. Ja, ein X-Button zum entfernen braucht auch noch Max. Das ist richtig. Das können wir jetzt eigentlich auch noch machen. Das probieren wir jetzt mal aus, ob wir das noch hinkriegen. Nee, nee, nee, machen wir nicht. Wir müssen unsere krassen Animationen hier oben noch machen, während Upload ist. Das witzige ist, dass man jetzt quasi Kogas, weil es sich ja schon dreht, wenn ich die Drehanimation mache, dreht sich schneller. Hyper Kogas ist das dann. Guck, das hier, das ist normal Kogas. Das ist Hyper Kogas. Kannst du aber, was, kannst du ja aber eigentlich noch einbinden? Rendern für eine Videoquelle, aber nicht für einen selbst. Was meinst du? Das verstehe ich jetzt nicht. Was, Rendern für eine Videoquelle, aber nicht für einen selbst? Du meinst, dass man das dann nur ins OBS rein kriegt? Na gut, aber wenn ich es doch nur im OBS machen will, dann kann ich ja auch OBS Shortcuts verwenden. Und das ins OBS rein zu kriegen, ist ein größerer Akt, da müsste man... Nee, das geht nicht. Weil aktuell seht ihr es ja im Stream, weil OBS mein Screen crappt. OBS crappt den Stream. Also mein Screen und deswegen sieht man es ja. Ich muss es selbst sehen, dass OBS das auch sieht. Wenn ich das nur in OBS... Man kann es allerdings auch nicht mit Fullscreen crappt machen, weil man sieht es ja hier. Das Programm hat ja hier ein Hauptfenster, sprich das kann ich auch mit OBS crappen, wenn ich es haben will. Aber das nur ins OBS reinrendern ist ziemlich kompliziert. Das müsste man dann mit irgendeinem OBS Plugin oder sowas machen. Nee, das übersteigt meine OBS Skills. Ist es nicht möglich per Browser Source in OBS das einfach auf einer Seite anzeigen zu lassen? Das ist eine gute Idee, doch... Das mit Browser Source ist eine... Das mit Browser Source ist eine gute Idee. Geht das dann auch bei Game Stream? Das geht bei allem. Das geht bei allem was dein Bildschirm aufnimmt. Das hat nichts mit OBS oder so zu tun. Weil du siehst es ja selbst und weil du es selbst siehst kannst du mit allem aufnehmen. Aber das mit Browser Source finde ich jetzt eine gute Idee. Das könnte man noch einbauen, dass der quasi das ausgibt auf irgendeiner Seite oder so. Ja, das geht. Dass man beispielsweise hier noch so ein Output tappt. Das könnte man machen. Mit Browser Source könnte funktionieren. So, aber jetzt müssen wir noch unser Rädchen hier oben zum Spinnen kriegen. Wenn der Upload läuft. Echt mal guck mal, das ist doch keine Usability hier Windows. Da blickst du doch nicht durch. Windows. Zu Windows kann ich nur sagen... Omega Little. Omega Little. Omega Little. Fidget Spinner als Settings Symbol. Wenn du denn den Emoji Fidget Spinner hast, dann geht das. Ok, Track and Drop funktioniert. Sehr schön. Black Dare. Doch, du musst einfach beides Captchern. Also entweder captcherst du deinen kompletten Monitor. Dann ist natürlich immer drauf. Oder du stellst dem OBS halt ein, dass du quasi dein Bild, dass du dein Game captcherst. Plus jetzt halt zum Beispiel. Kannst doch hier sagen... Irgendwie Window Capture. Wo geht denn das Scheiß hier? Window Capture. Ok, dann muss ich Game Capture machen. Irgendwie. Also es funktioniert prinzipiell. Du musst dann einfach im OBS einstellen, dass du das Fenster auch noch captcherst. Wenn man es richtig macht. Wobei ich mich frage, warum das das nicht Captchern kann. Also mir ist nicht ganz klar, warum sich das jetzt nicht Captchern lässt. Es müsste sich eigentlich ohne Probleme Captchern lassen. Aber von der Idee her funktioniert das. Warum lässt es sich denn nicht Captchern? Hä? Achso. Ja, wahrscheinlich weil ich das... Hä? Also ich weiß ehrlich gesagt nicht, warum sich das gerade nicht Captchern lässt. Bin ich überfragt. Aber von der Idee her sollte sich das in OBS auch Captchern lassen. Dann kannst du beides Captchern und gut ist. Muss ich mal gucken, warum das OBS nicht Captchern kann. Da machst du nämlich einfach Window, Window Captcher und musst es halt nochmal ein Overlay im OBS machen. Ich bin jetzt aber echt... Ich hab keine Ahnung, warum das denn funktioniert. Ich bin jetzt echt überfragt, warum das das hier nicht Captchert. Keine Ahnung. Ist auch egal. Ich hab eh immer Full Display. Und das muss ich mir mal angucken, warum es das nicht Captchert. Alter, es gibt einen Fidget Spinner Emoji. Allen Ernstes, ja? Ist das wirklich jetzt... Ach du Scheiße. Warum? Also von allen Emojis diese... Aber sieht kacke aus, guck mal. Sieht scheiße aus. Fidget Spinner Emoji. Das sieht des Kogas doch besser aus. Ja, Promise. Ich hab es aber gerade angezeigt. Aber wie gesagt, keine Ahnung, warum das nicht funktioniert. Das muss ich mal ausprobieren. Vielleicht muss man OBS auch nochmal neu starten, nachdem man das Programm gestartet hat. Oder irgendwie sowas. Aber es müsste gehen, weil es ist prinzipiell ein ganz normales Fenster, wie jedes andere Fenster auch. NvEng ist doch voll der schlechte Codierer. Mit gleicher Bitrate sieht NvEng schlechter aus. Aber es macht halt keine Last auf dem System, was dann wieder ganz gut ist. Und mittlerweile kann man ja auf Twitch mit ein bisschen höherer Bitrate streamen. Da geht das eigentlich schon. Moin, xAzerbaidscher an. So, wir wollten das spinnen lassen, wenn Upload an ist. Das müssen wir jetzt noch machen. Wir haben noch eine halbe Stunde Zeit. Also, Drag Over. Also wir brauchen noch eine neue Variable. Drag Active. Wir müssen sowas wie Is Uploading oder sowas machen. False. Is Uploading. So, und wenn Is Uploading, dann wollen wir sowas hier machen. Wenn das hoch lädt, dann setzen wir hier unser Kogas Class. So, und von der Idee her, wenn Is Uploaded, soll sich das drehen. Funktioniert. Also, Ich hab's jetzt mal negiert. Also wenn Is Uploaded, das heißt, das muss ich jetzt hier drinnen noch setzen. Das finde ich an View geil. Das ist mega einfach. Wie gesagt, ich hab mir ein paar Tutorials angeguckt und flutscht. So, im Prinzip sag ich hier einfach, also sag ich hier davor schon, sag ich hier, Is Uploading. Und wenn das fertig ist, so. So, und von der Idee her, wenn Ich jetzt was hochlade, sollte sich das drehen. Probieren wir mal aus. Ja, habt ihr's gesehen? Warum geht das jetzt nicht nochmal? Ach doch, der ist nur einfach zu schnell. Ja guck, wenn ich mehr hochlade, dann geht's auch. Seht ihr's? Also wenn wir da jetzt was Großes hochladen würden, dann geht das. Ich mein, es sieht ganz schön räudig aus, wie das humpelt, ja. Haben wir hier irgendwas Größeres, was ich hochladen kann? Ich werf's ja Server-seitig eh weg. Ah, ich guck nochmal, werf ich Server-seitig weg? Ja, genau, ich werf Server-seitig weg. Haben wir noch ein bisschen was Größeres hier, was ich uploaden kann? Aufnahme zu Meltdown, Aufnahme zu Antivirus, ja. Ja guck, das lädt ein bisschen länger hoch. Der hat gesagt, gibt's nicht, mach ich nicht. Und der hat's halt gecasht, der Browser, deswegen geht das jetzt so schnell. Aber es funktioniert, wir können das übrigens ganz einfach simulieren, wenn der Upload etwas länger dauert. Können wir einfach simulieren? Ach Quatsch, wir simulieren jetzt einfach mal, wenn's wieder etwas länger dauert. Der Upload dauert jetzt 5 Sekunden auf Server-Seite. Guckt, solang der Upload läuft, Coggarts vor sich hin. Der ist sehr nice, ich bin begeistert. Oder in DevTools einstellen, ja, aber so ging's jetzt auch. Man hat ja gesehen, dass das prinzipiell geht. Was mir natürlich nicht gefällt, ist, dass es so eiert. Ich mach jetzt das Fidget Spinner Emoji. Fidget Spinner. So, und wir stellen jetzt mal ein, dass das immer rotiert, auch ohne Upload. Das sieht so richtig kacke aus. So, da waren wir die. Wir müssen jetzt eh gleich Schluss machen, weil hier klein 17 Uhr ist. Das Poise machen wir noch ein bisschen fancy. Das sieht übelst kacke aus. Das sieht übelst kacke aus, der Fidget Spinner. Und so ganz rund ist der auch nicht, oder? Da bleib ich lieber mal hier bei meinem Coggarts, auch wenn das irgendwie ein bisschen humpelt. Ja, dann ist da noch was. Wie kriege ich denn den Button da jetzt irgendwie rüber? Wir machen das jetzt noch ein bisschen hübscher. Wie kriege ich denn den Button da irgendwie rüber jetzt? Dann machen wir noch mal ein eigenes Diff drum. Ha, nice. Jetzt hängt es aneinander. Da machen wir jetzt noch ein Padding dabei und Margin auf der rechten Seite, den Button. 15 Pixel, ja. Ist doch ganz nice. Kann mir mal jemand erklären, warum die Buttons jetzt vertauscht sind? Warum sind die jetzt vertauscht die Buttons, nur weil ich einen Diff drum gemacht habe? Ach so. Deswegen, ja. Transform Origin Property. Ja, sowas in der Richtung haben wir vorhin schon probiert, dass wir hier irgendwie noch irgendwie Translate oder irgendwie sowas gemacht haben. Oder wie wird das jetzt? Ja, irgendwie sowas haben wir vorhin schon ausprobiert, aber ja. Das ist eklig. Was macht denn Translate 3D? Keine Ahnung. Aber das sieht doch, ich meine, man muss sagen, ich meine, ihr erinnert euch vielleicht auch daran, wie räudig der erste Versuch vom Web-Interface ausgesehen hat. Vielleicht macht jemand einen Pull-Request. Ja, genau, stimmt. Also Leute, wenn ihr da gute Ideen für habt oder noch ein paar Sachen einbauen wollt, also Pull-Requests sind immer willkommen. Ich habe hier auch noch ein paar auf, die sind leider schon ein bisschen älter, beziehen sich aber auf das quasi dieses unsichtbare WPF-Fenster, wo man Rotationen sowas so einstellen kann. Das heißt, das stand jetzt noch nicht auf dem Programm in letzter Zeit, dass ich daran weiter gebastelt habe. Aber wenn ihr da noch was habt, ihr könnt gerne alle Pull-Requests aufmachen, die ihr wollt. Wir haben auch ein paar gemercht letztens schon. Aber hier vom Auskern Fuchs das letzte Mal, genau, vom Max hier, der sich die Buttons hier ausgedacht hat. Aber ich muss sagen, es ist doch echt schick geworden. Jetzt kann man hier oben suchen, sucht man nach POG, findet man die beiden Dinger, ist ja ganz logisch. Drückt man Enter, zeigt er das erste an. Das ist übrigens doof, dass der jetzt das Diff so breit macht. Der macht das Diff so breit, weil wir super responsive sind. Wobei eigentlich finde ich gar nicht so schlecht, dass er das komplett anzeigt. Monka Shake können wir hier auch simulieren. Sieht man das eigentlich im Webinterface, sieht man das im Stream richtig? Warte mal, das muss ich mir jetzt mal angucken, Leute. Ich muss mir jetzt mal meinen eigenen Stream angucken. So, sieht man das? Ja, man sieht das, Monka Shake. Ja, übrigens, der Sebaro hat ein Archiv gebaut. Äh, nee, der Sebaro hat ein Archiv gebaut, das heißt, falls ihr irgendwas gesehen habt, mal in einem älteren Stream und es ist auf Twitch nicht mehr da, weil Twitch löscht es ja nach einer Zeit. Und wenn die Seite dann eben mal fertig geladen ist, es gibt maxfps.tv und es gibt wubblos.tv, kann man hier im Archiv gucken, hat der Sebaro gebaut. Das sind alle Streams seit September dabei. So, das nächste, was wir machen, ist, dass wir jetzt noch ein kleines Video machen, das ist, also im nächsten Stream, wahrscheinlich morgen, weil es wird mal Zeit, wir stellen das um. Und das ist das einzige, was ich noch machen will, bevor ich quasi so mal die erste Version von dem Ding hochlade, die jeder benutzen kann, also die erste nicht-ultra-alpha-test-Version, und zwar, ich will das Umstellen von einem Ordner, wo alles drin ist, auf einen Ordner plus eine Lightdb, wo man dann auch ein paar Sachen drin speichern kann, weil aktuell ist es ja so, ich habe keine Möglichkeit, irgendwo Settings zu speichern, also den Shortcut kann ich hier quasi mit diesem komischen Hack, quasi Shortcut-Dateinahme reinbauen. Ein Auto-Updater, Max, das machen wir auch noch, stimmt, stimmt, die zwei Sachen, stimmt, muss ich mal kleiner aufschreiben, weil die zwei Sachen, da weiß ich auch schon, wie wir das machen. Also ein Auto-Updater braucht es nicht, es braucht einen Updater, mal gucken, also sprich, wir sind ja unter Windows, da wird ja alles runtergeladen und von Hand installiert, das heißt, wir brauchen einen Updater, ich mache es einfach so, dass das Ding nachguckt, ob es eine neue Version gibt, und dann sagt es hier, hallo, neue Version ist verfügbar, das ist dann relativ simpel, so und wir stellen das um von eben nur diesem Ordner, wo die Bilder drin liegen, auf eine Lightdb mit, ja, wo man dann sich ein paar Sachen drin merken kann, zum Beispiel, dass man dann, wenn man mal genommen hat, hat es da 50 Bilder drin und man möchte ein paar favorisieren, dass die immer oben stehen und sowas, ich habe aktuell keine Möglichkeit, irgendwo zusätzliche Infos zu speichern, oder Settings, dass ich nicht Ctrl-B haben will für das Bild, sondern vielleicht Alt-B oder so, ich habe keine Möglichkeit, Settings zu speichern, das heißt, da machen wir noch eine Lightdb drunter, die Bilder bleiben weiterhin im File-System liegen, weil die machen wir garantiert nicht in die Datenbank rein, und das mache ich noch, und dann hauen wir die erste Version raus hier, vielleicht morgen schon, mal gucken, wann kann das jeder verwenden, das ist halt ein Tool, was aus dem, was ich brauche für ein Stream, entstanden ist, und ihr habt ja quasi alles mitverfolgt, von Anfang an, konntet ihr das ja quasi mitverfolgen, wie das entstanden ist, dieses Tool, und was ist so eine Frage jetzt, für die, die seit Anfang an dabei sind, die ersten Sachen, wo ich rumgewurstet habe hier, das ist schon ganz gut geworden mittlerweile, von den ersten Anfängen, wo wir es gerade mal hingekriegt haben, irgendwie mit Fehlermeldung noch Bilder anzuzeigen, zu einem Web-Interface, wo man drinnen suchen kann, dass alles quasi Echtzeit geupdatet wird, wenn ich das anzeige, plus, dass ich sogar noch Text-to-Speech abspielen kann, und das sogar automatisch wieder deaktiviert, wenn das fertig abgespielt ist und sowas. Ach ja, und dass wir Memes löschen können, das muss man auch noch einbauen, das wird aber ein bisschen schwer, ohne dass ich diese Datenbank-Geschichte eingebaut habe, weil aktuell ist es ja so, es ist entweder auf dem File-System da oder nicht, und wenn ich ein Bild hier quasi anzeige, kann ich es nicht löschen, und selbst wenn ich das nächste Bild anzeige, kann ich das davor nicht löschen, weil das noch offen im Cache ist, das heißt, da muss ich die Light-DB noch dazwischenladen. Und dann bauen wir ein, dass wir noch Memes löschen können, genau, die drei Sachen machen wir Updater, Light-DB und Memes löschen, sondern ich glaube, ich werde das Ganze hier rein verpacken, das ist so ein Setup-Creator für Windows-Zeug, allerdings ohne großartigen Installer, also das klickt man einfach an und dann startet das und kopiert es dann in App-Folder, in App-Data oder so hin, das ist super simpel und hat dann Updater dabei, also sprich, das kann einem dann sagen, hier, guck mal, gibt eine neue Version und kann sich das auch runterladen und sowas, und die Installation wird auch nicht schwerer, einfach runterladen, anklicken, gut ist, übrigens, muss ich hier nochmal zeigen, wo man sich nicht so sehr verwirren lassen kann, darf es, ich habe hier schonmal eine Testversion gepusht letzte Woche, die sieht aber noch viel, viel, allein schon zwischen der ersten Version, die ich gepusht habe und jetzt sind schon Welten dazwischen, nur mal um das zu zeigen, wenn man das runterlädt, dann ist mindestens der Meinung, weil diese Datei noch nicht oft genug runtergeladen wurde und ich glaube, Chrome meckert schon, oh nein, mittlerweile nicht mehr, oder, doch, genau, dann ist Windows ja der Meinung, oh, das ist eine, von einem Unknown Publisher runtergeladene Datei, oh mein Gott, da muss man einmal bestätigen und das geht nach einer Zeit wieder weg, jetzt gucken wir uns nochmal ganz schnell an, wie das Programm vor einer Woche ausgesehen hat, weil es war noch ein bisschen anders, ich weiß gar nicht mehr, wie ich den Scheiß aufrufen musste, habe ich sie irgendwie reingeschrieben, ah hier, so, so musste man das damals noch aufrufen, ok, noch nichts, nichts, ok, wartet mal, Downloads, Memes, ziehen wir mal was rein, ich glaube, das hat damals schon funktioniert, ja, so sah die Oberfläche letzte Woche noch aus, ihr seht den Unterschied, oder, das ist schon ein Unterschied, das da, oder das da, ja und unser Theme-Switcher und sowas, sehr, sehr nice, für die Epilepsischen Anfälle, guckt mal, seht ihr das hier, wie das Symbol invertiert wird, weiß, schwarz, weiß, schwarz, je nach Theme, das ist richtig, das ist massiv poggers, achso, es läuft ja gar nicht mehr, kann es auch nicht angehen, ja ja, Omega Lone, ja, so siehts aus, graues Symbol wäre schöner, wo, was für ein graues Symbol hat Omega Lone, eh, achso, ich habe Brüssel Studio zugemacht, Code zugemacht, da kann es natürlich nicht funktionieren, grau anstatt schwarz, ja, da muss ich mal gucken, wie das geht, weil, das ist ziemlich primitiv, wie ich das mache, das ist ein SVG, ich sag einfach invert, vielleicht kann man sagen, probieren wir mal aus, invert 80%, ja, guckt daher, grau, ja gut, das andersrum geht da natürlich nicht, weil, weil das ursprüngliche Symbol ist schwarz, kann man das in CSS, kann man SVG, color changen, geht das, das wird mich mal interessieren, was ist das für komische Symbol, das geht nicht, ne, echt, wie, fill, fill, aha, aha, interessant, interessant, Poggers, fill und dann, fuck, was zum Teufel mache ich da eigentlich gerade, ja, 65, 50 mal, gleich los, achso, fill, fill, fill, color, color, color, was, what the fuck, geht das so, ups, ob ich das jetzt richtig kopiert, Moment, was kopiere ich da, okay, keine Ahnung, wie es funktioniert, das kriegen wir doch alles raus, wie lautet das jetzt überhaupt gerade, ne, aus irgendwelchen Gründen reloaden wir das nicht, aber ist auch egal, wir machen Schluss, ich hoffe euch hat es gefallen, morgen geht es weiter, morgen machen wir noch die letzten drei Punkte, dass wir den Grams dann endlich mal, dass wir endlich mal eine Version raushauen können, ich hoffe euch hat es gefallen, macht es gut, bis denn, tschüss.", "segments": [{"id": 1, "start": 60.0, "end": 68.0, "text": "Bevor alle nachher Fussball gucken müssen, Fussball in 2k18, ich glaube es nicht."}, {"id": 2, "start": 68.0, "end": 90.0, "text": "Der Serious Max ist auch da, ja du hast schon gelesen was ich geschrieben habe auf GitHub, gehe ich mal voll aus, weil du hast ja zugemacht."}, {"id": 3, "start": 90.0, "end": 98.0, "text": "So, ich muss jetzt nochmal schnell auf Twitter posten, dann geht es los."}, {"id": 4, "start": 98.0, "end": 104.0, "text": "Ich habe nämlich ein bisschen was, ich zeige euch gleich mal was es Neues hier gibt."}, {"id": 5, "start": 104.0, "end": 110.0, "text": "Es gibt richtig viele geile, also naja, es war jetzt vielleicht ein bisschen dick aufgetragen, richtig viele geile Sachen."}, {"id": 6, "start": 110.0, "end": 116.0, "text": "Aber es ist schon ganz nice, es ist vor allem viel hübscher, sogar Javascript sieht ganz hübsch aus mittlerweile."}, {"id": 7, "start": 116.0, "end": 124.0, "text": "So, ich muss gerade nochmal Cider refreshen, weil irgendwie sehe ich weder Chat noch New Account richtig."}, {"id": 8, "start": 124.0, "end": 132.0, "text": "Nur in der Vorschau, so perfekt. Eats clap. Very to Eats, Eats as fuck."}, {"id": 9, "start": 132.0, "end": 148.0, "text": "So, Twitter post."}, {"id": 10, "start": 148.0, "end": 154.0, "text": "Eigentlich könnte man den Titel vom Stream wieder irgendwie nennen, Max quält sich mit Javascript oder sowas."}, {"id": 11, "start": 154.0, "end": 168.0, "text": "Das wird wieder grausam, ich kriege echt zu viel wenn ich Javascript Zeugs machen muss, muss ich euch mal zeigen."}, {"id": 12, "start": 168.0, "end": 190.0, "text": "So, Eier Eats."}, {"id": 13, "start": 190.0, "end": 210.0, "text": "Eier Eats."}, {"id": 14, "start": 210.0, "end": 228.0, "text": "So, okay, auf gehts, ich habe den Grandloftwitter gepostet."}, {"id": 15, "start": 228.0, "end": 240.0, "text": "Übrigens mal eine Frage an euch, an die ganzen Javascript Kenner oder wie natürlich die coolen Leute sagen an die Javascript Kenner, an die Javascript Experts."}, {"id": 16, "start": 240.0, "end": 255.0, "text": "Wo kann man, wobei, ich wollte gerade, richtig dumm oder, ich wollte gerade nach einer Seite suchen wo man online Javascript ausführen kann."}, {"id": 17, "start": 255.0, "end": 259.0, "text": "Wie wäre das mit meinem Browser?"}, {"id": 18, "start": 259.0, "end": 269.0, "text": "Geht ab, geht da ab. Naja, okay suchen wir mal ein bisschen schöneres Javascript."}, {"id": 19, "start": 269.0, "end": 275.0, "text": "Ich muss euch nämlich mal was fragen. Der Javascript, ja genauerdings hier, das ist gut. Und dann gibt es ja noch CodePen oder sowas."}, {"id": 20, "start": 275.0, "end": 280.0, "text": "Muss euch mal was fragen, habe ich nämlich letztens in einem Vortrag gesehen, übelst geil. Und ihr müsst raten was da rauskommt."}, {"id": 21, "start": 280.0, "end": 288.0, "text": "In Javascript, das haben wir ja schonmal gemacht sowas, aber das war das beste was ich bisher gesehen habe."}, {"id": 22, "start": 288.0, "end": 303.0, "text": "So, Javascript. Kann man hier die Schriftgröße ändern? Settings. Schriftgröße ist komplett overrated. Brauchen wir nicht."}, {"id": 23, "start": 303.0, "end": 314.0, "text": "Schriftgröße ändern. Wie ändert man Schriftgröße? Fuck. Okay, keine Ahnung. Wie ändert man Schriftgröße? Kann nicht sein."}, {"id": 24, "start": 314.0, "end": 324.0, "text": "So, was meint ihr was hier rauskommt, wenn man das ausführt? Denkt dran es ist Javascript. Jetzt kann ich hier nicht scrollen."}, {"id": 25, "start": 324.0, "end": 337.0, "text": "Macht man den Krempel denn größer? Was meint ihr was hier rauskommt, wenn man das ausführt in Javascript?"}, {"id": 26, "start": 337.0, "end": 348.0, "text": "Beste. Habt ihr irgendeine Idee? Also ich mein, wir dürfen nicht vergessen, es ist Javascript. Also das heißt schonmal."}, {"id": 27, "start": 348.0, "end": 355.0, "text": "Ja gut, die Leute kennen das wahrscheinlich. Oder ihr kennt das wahrscheinlich, aber das ist so bescheuert, dass das da rauskommt."}, {"id": 28, "start": 355.0, "end": 362.0, "text": "Das ist einfach total beknackt. Also ich mein, wir müssen uns das erstmal auf der Zunge zergehen lassen, was uns Javascript hier mal sagen wird."}, {"id": 29, "start": 362.0, "end": 375.0, "text": "Das hab ich übrigens aus einem Vortrag, den ich auf YouTube gesehen hab. Also, es gibt einen Array mit 6, also so wie man das jetzt als unbedarfter Javascript Benutzer liest."}, {"id": 30, "start": 375.0, "end": 390.0, "text": "Es gibt einen Array mit 16 Plätzen, halb leer, würd ich mal sagen. Halb mit 16, was auch immer. Das ist ja auch schon das geile in Javascript. Mit 16, was auch immer. Man weiß es nicht, genau."}, {"id": 31, "start": 390.0, "end": 415.0, "text": "So, und jetzt jedes Element. Was zum Teufel ist String-1? Was bitte ich schon ist String-1? Also man könnte sagen, ok, alles bis hier macht noch irgendwie Sinn."}, {"id": 32, "start": 415.0, "end": 427.0, "text": "So, join ist halt, man macht das Array zu einem String und halt mit diesem Separator. Also sprich, ne, wenn man jetzt hier in dem Array abcd drin steht, mit join, sagst du dann, join Leerzeichen zum Beispiel."}, {"id": 33, "start": 427.0, "end": 437.0, "text": "Kommt halt ein String aus A Leerzeichen, B Leerzeichen, C Leerzeichen. Allerdings hab ich schon mal keine Ahnung, was genau String-1 macht. Ich hab keine Ahnung."}, {"id": 34, "start": 437.0, "end": 454.0, "text": "Ich würd auch, ich würd sowas sagen wie das Serious Max, also dass das quasi dann String oder so gibt. So, aber folgendes kommt drauf. Wie führt man hier Sachen aus?"}, {"id": 35, "start": 454.0, "end": 472.0, "text": "Fuck, äh, ähm, äh, Console, Log. So, ok, das funktioniert hier drinnen nicht. Wie kann man das jetzt hier ausführen? Ok, ich fühl's jetzt im Browser aus."}, {"id": 36, "start": 472.0, "end": 497.0, "text": "Also, was da rauskommt, das Beste. Haha, das kommt raus. Ich mach mal ein bisschen größer hier, das kommt raus. Ich hab keine Ahnung warum."}, {"id": 37, "start": 497.0, "end": 513.0, "text": "Ich hab keine Ahnung warum, ehrlich gesagt. Das ist hier absolut, ähm, ich, also, von der, von der Idee her, von, also, ok, versuch, ich hab's mal versucht zu verstehen."}, {"id": 38, "start": 513.0, "end": 527.0, "text": "Ich mein, das hier ist relativ, das hier ist relativ klar. Ein Array mit 16, man weiß es nicht. So, und in JavaScript ist wahrscheinlich, man weiß es nicht, not a number. Was ja so auch nicht ganz verkehrt ist, ja."}, {"id": 39, "start": 527.0, "end": 543.0, "text": "Oder? Ich hab keine Ahnung ob das, ok, machen wir mal einzeln. Was ist Array 16, was kommt da raus? Empty. 16 mal nichts. Ok, das ist das, daher kommt schon mal nicht not a number. So."}, {"id": 40, "start": 543.0, "end": 558.0, "text": "So, und dann ist String minus 1. Was, was ist String minus 1? Aha, String minus 1 is not a number. Ich, ich bin ja geneigt dazu, JavaScript in dem Fall sogar recht zu geben. Aber, lass uns überhaupt gehen."}, {"id": 41, "start": 558.0, "end": 573.0, "text": "Also ich hätte jetzt erwartet eigentlich, wenn man sich das so anguckt, String minus 1 ist halt einfach nur String oder sowas. Ich mein, warum auch immer man String und eine Zahl mit Minus, warum das überhaupt zusammen sowas."}, {"id": 42, "start": 573.0, "end": 588.0, "text": "Ja, was auch immer, ja. Zumindest String minus 1 is not a number. Das heißt, wenn man jetzt 16 mal nichts in JavaScript mit separator not a number joint, dann kommt dann das hier raus."}, {"id": 43, "start": 588.0, "end": 603.0, "text": "Es ist total, es ist, es ist JavaScript. Es ist JavaScript, man muss es nicht verstehen. Ja, das, das kenn ich, Sychin, was du geschrieben hast. Das ist geil, das kenn ich. Ich weiß aber nicht genau, was rauskommt."}, {"id": 44, "start": 603.0, "end": 618.0, "text": "Plus, ist es false oder true oder irgendwie sowas? Ach nee, Null, genau. Ja, das gibt so auch so Dinger, die man nicht so genau checkt. Ach ja, und das ist übrigens was anderes, wenn ich das Richtige in Erinnerung habe. So rum ist was anderes wie so rum."}, {"id": 45, "start": 618.0, "end": 637.0, "text": "Das ist auch JavaScript-Logik. Normalerweise bei einem Plus, würdest du eigentlich sagen, okay, so wie man das gelernt hat in der, ich weiß nicht in der wievielten Klasse man das lernt, ich sag jetzt einfach mal in der, keine Ahnung, in der zweiten Klasse oder so, ist es egal, bei einem Plus, ob es links oder rechts steht."}, {"id": 46, "start": 637.0, "end": 651.0, "text": "Das ist allerdings, nur weil man das in der zweiten Klasse gelernt hat, heißt das noch lange nicht, dass es in JavaScript auch so ist."}, {"id": 47, "start": 651.0, "end": 667.0, "text": "Also man kann sich das schon irgendwie dann zurechtbiegen und erklären, warum das so ist. Und wenn man die ganzen Einzelheiten auch mal sich irgendwann gemerkt hat, kann man auch bei solchen Dingen durchsteigen. Aber intuitiv ist was anderes."}, {"id": 48, "start": 667.0, "end": 682.0, "text": "Das nochmal zum Einstieg. Ich zeige euch mal was das Memetool tolles Neues kann. Nein, das kann ich Deep House Relaxing Study Music. Das kann es noch nicht, vielleicht kann es das auch mal irgendwann."}, {"id": 49, "start": 682.0, "end": 697.0, "text": "Wir haben das nämlich ein bisschen abgecradet. Und zwar, wir sind jetzt voll im Trend. Und zwar habe ich das ein bisschen neu gebastelt. Ich zeige euch das jetzt mal, ich muss das jetzt mal aufmachen."}, {"id": 50, "start": 697.0, "end": 713.0, "text": "Also, ich habe eine neue Ordnung. Wir machen das erstmal in Visual Studio jetzt auf. Oh, die Cuts. Moment, warum sind die Fotos immer anders, je nachdem wie man klickt?"}, {"id": 51, "start": 713.0, "end": 728.0, "text": "Was zum Teufel? Ah, das hat anscheinend irgendwie Bilder zusammengesucht. Ich weiß nicht genau warum. Übrigens, beste Bild. Max Gesicht revealed in der Suppe. Ich weiß nicht, ob sich das geschwiegelt hat."}, {"id": 52, "start": 728.0, "end": 743.0, "text": "Aber Visual Studio auf. Ja, Green Monster, das machen wir auch noch mal irgendwann. WebAssembly müssen wir uns auch noch mal irgendwann geben."}, {"id": 53, "start": 743.0, "end": 761.0, "text": "Wie sieht das eigentlich mittlerweile aus? Vielleicht weiß das jemand von euch. Wie sieht das eigentlich aus in WebAssembly mittlerweile mit Dom-Elemente ändern? Geht das mittlerweile? Das erste Mal, wo ich mir das ein Beispiel von angeguckt habe, konntest du halt quasi mehr oder weniger musstest du alles selbst malen auf ein Canvas oder sowas."}, {"id": 54, "start": 761.0, "end": 777.0, "text": "Was dann ein bisschen so die Sache in Frage stellt, warum ich das dann überhaupt im Browser mache. So, also, VM, nee, vMysterion, das ist das Backend."}, {"id": 55, "start": 777.0, "end": 784.0, "text": "Also, das Ding besteht aus, jetzt kann ich gleich mal die neue Ordnerstruktur zeigen, wo wir gerade dabei sind. Ich habe das hier nämlich schon mal ein bisschen aufgeräumt."}, {"id": 56, "start": 784.0, "end": 800.0, "text": "Wer das das letzte Mal gesehen hat, weiß wie eklig das war. Es gibt drei Teile im Endeffekt. Es gibt hier so einen, wie nennt man das, Data Layer, der dafür zuständig ist, Bildchen einzulesen."}, {"id": 57, "start": 800.0, "end": 815.0, "text": "Und in dem Fall halt sowas hier, so, Min-Bildchen. Da kannst du ja alles bei den möglichen Bildchen einlesen. Dann gibt es ein Web-Interface und es gibt das eigentliche Frontend, was dafür zuständig ist, die Bilder dann auf dem Rechner anzuzeigen."}, {"id": 58, "start": 815.0, "end": 829.0, "text": "Ich zeige das mal kurz. Oh nee, ich glaube, ich habe keine Bilder drin. Ich muss erstmal Bilder reinziehen. Was wird zum Schluss rauskommen? Ja, ich zeige euch das für die, die es noch nicht gesehen haben."}, {"id": 59, "start": 829.0, "end": 844.0, "text": "Genau, und das ist in C-Sharp. Also, die Backend-Geschichte ist komplett in C-Sharp. Das Frontend ist in, ja, zumindest das Web-Frontend ist halt in JavaScript und HTML. Weil, mein Web-Frontend, was soll das sonst sein?"}, {"id": 60, "start": 844.0, "end": 861.0, "text": "Und jetzt ganz neu, ich zeige es euch gleich, mit Vue.js. Ich habe mir so ein abge-dingst abgebrochen bei ihr. Und ich habe mein ekliges JavaScript. Wir gucken uns das jetzt das letzte Mal an. Komm jetzt, ich zeige euch nochmal, wie es letztes Mal ausgesehen hat."}, {"id": 61, "start": 861.0, "end": 882.0, "text": "Wo geht denn das hier auf GitHub überhaupt? Komm jetzt. Das da. Und letztes Mal war alles noch in einem Ordner drin und HTML JavaScript des Todes. Wo ist es denn? Index."}, {"id": 62, "start": 882.0, "end": 894.0, "text": "Nein, das letzte Mal hatte ich alles in einer Datei. Guckt hier, Logik, JavaScript, zusammengefuddelt, irgendwelche CSS zusammengefuddelt. Alles schön inline mit Styles und so richtig, also so wie man es nicht macht."}, {"id": 63, "start": 894.0, "end": 915.0, "text": "Und jetzt habe ich das Ganze ein bisschen schöner sortiert. So und jetzt kopieren wir mal ein paar Memes rein, dass wir ein paar Bildchen zum Anzeigen haben. So, wir müssen aber mal Steuerung C löschen, sonst ist es ein bisschen nervig. Steuerung T, Steuerung S löschen wir auch. Und R, glaube ich, ist auch keine so gute Idee."}, {"id": 64, "start": 915.0, "end": 926.0, "text": "So, also was das Tool macht, kann ich doch mal kurz zeigen. Also ohne das Webinterface jetzt einfach nur, wenn man einen Ordner hat, wo man seine Memepildchen drin hat und das Tool startet, man sieht es hier unten ist es."}, {"id": 65, "start": 926.0, "end": 934.0, "text": "Man kann auch das Webinterface starten, aber man kann es auch ohne Webinterface benutzen. Man kann einfach Memoverlays, Memepildchen einblenden."}, {"id": 66, "start": 934.0, "end": 949.0, "text": "Und das Schöne daran ist, ich weiß jetzt ja schon mittlerweile, was ich erzählen muss, was die Leute interessiert, weil das wird in jedem Stream quasi 30 mal gefragt, was das eigentlich macht. Und man achtet übrigens mal auf die RAM-Auslastung, das ist richtig geil."}, {"id": 67, "start": 949.0, "end": 964.0, "text": "Die jumped übel, guck mal hier, bam, einfach mal 500 MB, weil ich das GIF angezeigt habe. Wenn der Garbage-Collector läuft, geht es dann wieder runter, aber schon geil."}, {"id": 68, "start": 964.0, "end": 974.0, "text": "So, und das Gute daran ist, das zeigt nicht einfach irgendwelche Bildchen an, weil einfach Bildchen anzeigen bringt es dir jetzt auch nicht, wenn es sich dann komplett aus dem Game raushaut."}, {"id": 69, "start": 974.0, "end": 984.0, "text": "Diese Bildchen sind komplett transparent, also sprich, man kann durchklicken, siehst du ja hier, ich markiere im Hintergrund, obwohl ich im Bild rumklicke. Jetzt habe ich irgendwas komisches copy pasted."}, {"id": 70, "start": 984.0, "end": 992.0, "text": "So, man kann komplett durchklicken, das heißt, man kann die auch verwenden, während man spielt und auch das anzeigen nimmt keinen Fokus weg."}, {"id": 71, "start": 992.0, "end": 1005.0, "text": "Das macht das, also sprich, das ist für Streamer, die Bildchen einplanten wollen, so wie ich. Das war nämlich der ursprüngliche Gedanken, hallo Mason, das war der ursprüngliche Gedanke, warum ich das überhaupt programmiert habe."}, {"id": 72, "start": 1005.0, "end": 1034.0, "text": "Ja, die Sharp hat einen Garbage-Collector. Man sieht das auch hier dran, wenn ich jetzt zum Beispiel mal da hingehe und sage hier einmal, keine Ahnung, gc collect, dann sieht man auch, dass an der Stelle jetzt nicht der Garbage-Collector läuft, wenn er lustig ist, sondern jedes Mal, wenn ich ein Bild anzeige."}, {"id": 73, "start": 1034.0, "end": 1048.0, "text": "Und das dann auch schneller aufräumt oder auch nicht. Ich weiß nicht, warum es nicht macht, ehrlich gesagt, aber keine Ahnung."}, {"id": 74, "start": 1048.0, "end": 1056.0, "text": "Ach, was weiß ich, zumindest funktioniert es, ohne dass man manuell Garbage-Collector aufrufen braucht man eh nicht, also ganz selten."}, {"id": 75, "start": 1056.0, "end": 1066.0, "text": "Und wenn man das braucht, muss man sich überlegen, ob man das nicht eh irgendwie anders macht. Normalerweise muss man den Garbage-Collector nicht direkt aufrufen."}, {"id": 76, "start": 1066.0, "end": 1090.0, "text": "So, aber ich zeige euch jetzt mal, was es Neues gibt. Also als erstes haben wir natürlich eine neue Ordnerstruktur, dass es nicht mehr ganz so eklig ist. Und hier ist das Webinterface drinnen, das war vorher wie gesagt ja alles in einem. Und ist die Schriftgröße so okay Leute, passt das? Ich habe ja an den Settings nichts geändert, aber man weiß ja nie."}, {"id": 77, "start": 1097.0, "end": 1109.0, "text": "Wie ein Doktor, das ist nicht schlecht. Wenn du den Garbage-Collector startest, installiert es sich Java. Allerdings, wer hat denn in 2k18 überhaupt noch Java installiert?"}, {"id": 78, "start": 1109.0, "end": 1127.0, "text": "Außer irgendwelche Minecraft-Kinder, ne? Das ist ja, ne, ne, ne, Java in 2018. Hyperlulpoggers."}, {"id": 79, "start": 1127.0, "end": 1141.0, "text": "Mittlerweile ist es so schlimm, ne, mit meinen Twitch-Chat-Geschichten. Ich laber manchmal, es ist sogar auf der Arbeit so schlimm, ich laber manchmal vor mich hin. Also ich sitze dann da und sag dann irgendwann Hyperlulp oder sowas."}, {"id": 80, "start": 1141.0, "end": 1158.0, "text": "Einfach so, einfach so. Oder poggers oder so, einfach so. Ich weiß nicht genau, was das auslöst, aber es wirkt glaube ich ein bisschen verwirrend auf Leute, die das Ganze nicht kennen."}, {"id": 81, "start": 1158.0, "end": 1174.0, "text": "Aber lange rumgeschwätzt, ich zeige euch das jetzt erstmal, wie das aussieht. Weil die neue Oberfläche sieht richtig gut aus, sehr, sehr nice, schon viel besser."}, {"id": 82, "start": 1174.0, "end": 1188.0, "text": "Ja, das zeige ich gleich. Wir starten die ganzen Templates erstmal. Und ich habe es jetzt so eingestellt, das muss man wissen, falls ihr das auch bei euch ein bisschen mit dran basteln wollt."}, {"id": 83, "start": 1188.0, "end": 1208.0, "text": "Oder, ich meine vielleicht euch auch dran Beteiligung und Pull-Request aufmacht oder sowas. Ich habe es mittlerweile so eingestellt, dass der im Debug-Mode, also sprich wenn Environment-Development neu ist, dann benutzt er einen lokalen, dann benutzt er hier lokal was zum Seiten ausliefern."}, {"id": 84, "start": 1208.0, "end": 1222.0, "text": "Und wenn man Production startet, dann nimmt er die Seiten, die quasi in der Echse drin sind. Das ist eigentlich ganz praktisch, das heißt es ist nach wie vor eine Echse, die man verteilen kann und alles ist drin."}, {"id": 85, "start": 1222.0, "end": 1246.0, "text": "So, das heißt wir starten das Ganze jetzt in meinem Debug-Mode. So, starten den Webserver. Müssen wir machen. Und machen mal das kleine JavaScript-Zeug auf."}, {"id": 86, "start": 1246.0, "end": 1255.0, "text": "Visual Studio Code habe ich mir jetzt mal neu installiert. Finde ich ist eine super Geschichte. Ups, äh, ich habe es falsch aufgemacht. Lul."}, {"id": 87, "start": 1255.0, "end": 1276.0, "text": "Client-Code. So, das HTML zeige ich euch auf und nun starte ich hier mal, das ist so ein Plugin von Visual Studio, dass der die Files lokal bereitstellen kann, denn ich zeige euch nämlich nochmal was cooles, was ich rausgekriegt habe."}, {"id": 88, "start": 1276.0, "end": 1290.0, "text": "Also unsere Web-Developer hat hier der Witz schlechthin. Aber wenn ich jetzt auf das Memboard drauf gehe, das läuft bei mir hier lokal, Index, HTML. Bam, guck mal wie schön das jetzt aussieht."}, {"id": 89, "start": 1290.0, "end": 1307.0, "text": "Guck mal, wie nice das jetzt aussieht. Guck mal hier. Darklight-Seam oben, Searchbar. Also ich kann jetzt hier oben zum Beispiel den POG. Drücke Enter und dann ist es auch gleich an."}, {"id": 90, "start": 1307.0, "end": 1332.0, "text": "Sehr nice. Man kann suchen nach Shortcut, man kann suchen nach Name oder nach was weiß ich. Aber es sieht schon mal nice aus, muss man sagen. Absolut nice."}, {"id": 91, "start": 1332.0, "end": 1344.0, "text": "So. Und wie gesagt, es ist gedacht, dass man das auf dem zweiten Rechner aufmacht. Nur mal so zur Erklärung, weil es das letzte Mal immer gefragt wurde, was bringt es denn, wenn ich über den Webinterface Bilder auf dem gleichen Rechner anzeige."}, {"id": 92, "start": 1344.0, "end": 1364.0, "text": "Die Idee ist ja, dass man das startet auf einem Rechner und dann macht man es vom zweiten Rechner auf oder vom Tablet oder vom Smartphone. Und während man am Streamen ist und ich quasi am zweiten Rechner bin, ich zeige euch, ich gehe jetzt mal am zweiten Rechner. Ihr seht das jetzt zwar nicht, aber was habe ich für eine IP? 64."}, {"id": 93, "start": 1364.0, "end": 1377.0, "text": "Was habe ich denn? Ja, 64, ok. Ich gehe jetzt mal auf den zweiten Rechner und wenn ich das da aufmache, dann zeigt, seht ihr, dann kann ich jetzt im zweiten, also ihr seht es nicht, aber ihr seht es, dass ich hier nicht anklicke."}, {"id": 94, "start": 1377.0, "end": 1385.0, "text": "Jetzt kann ich vom zweiten Rechner aus hier, während ich irgendwas spiele, streame, sonst was, blöde Memes einplanten, auch wenn ich mir die Shortcuts nicht merke."}, {"id": 95, "start": 1385.0, "end": 1395.0, "text": "Also sprich, man kann ja auch Shortcuts belegen, dass man das schnell aufrufen kann, während man streamt, aber ich kann es auch vom zweiten Rechner aus bedienen. Dafür ist halt eben die Oberfläche."}, {"id": 96, "start": 1395.0, "end": 1418.0, "text": "So und was wir heute machen ist, ich mache es mal wieder hier auf dem ersten Rechner auf. So und was wir heute machen ist, wir basteln eine Upload-Funktion, weil zur Zeit kann man nur Memes hinzufügen, wenn man das, Poggers muss da noch rein, fällt mir gerade auf."}, {"id": 97, "start": 1418.0, "end": 1431.0, "text": "Poggers, guckt und wenn man es reinkopiert, ich will es nicht moveen, ich will es kopieren, zack, erscheint es hier. Wo ist es, wo ist Poggers?"}, {"id": 98, "start": 1431.0, "end": 1445.0, "text": "Warum geht das nicht? Jetzt gehts. Ok, das muss ich mir nochmal angucken, warum man das jetzt nicht geladen hat richtig, aber man kann es reintracken, droppen im Windows Explorer oder halt hier, dann lädt es automatisch, während es läuft."}, {"id": 99, "start": 1445.0, "end": 1461.0, "text": "Die Sache ist die, das ist ziemlich doof, weil dann muss man quasi, wenn man neue Sachen hinzufügen will oder Shortcuts ändern oder sowas und man am Streamen ist, quasi in-game, also müsste man hier den Ordner aufmachen und das Zeug umbenennen und sowas, das ist nicht so schön."}, {"id": 100, "start": 1461.0, "end": 1475.0, "text": "Deswegen basteln wir heute eine Upload-Funktion, dass man sich überhaupt nicht mehr drum kümmern muss, sondern man kann einfach das Web-Interface aufmachen, irgendwas, ich zeige das jetzt mal exemplarisch, weil das funktioniert jetzt natürlich nicht, weil wir haben es noch nicht programmiert."}, {"id": 101, "start": 1475.0, "end": 1492.0, "text": "Wenn man hier confused, man sieht, er fügt das auch hinzu, ist jetzt nicht gemapped auf einem Key und das alte hat er entfernt, löschen wir mal."}, {"id": 102, "start": 1492.0, "end": 1512.0, "text": "Ah ne, kann ich jetzt nicht löschen, ja, aber ihr seht, was ich meine. Und ich will es halt nicht im Ordner umbenennen, sondern ich will es halt hier reintracken, droppen können, also zum Beispiel das hier, zack, geht jetzt natürlich noch nicht, jetzt macht es da Pause auf, ich will es hier reintracken, droppen können und er fügt es automatisch hinzu, also vom zweiten Rechner aus."}, {"id": 103, "start": 1512.0, "end": 1526.0, "text": "Das heißt, wir müssen zwei wichtige Sachen machen, wir müssen einmal in unserem Backend, dem beibringen, dass File Uploads möglich sind und wir müssen File Uploads implementieren in unserem Frontend."}, {"id": 104, "start": 1526.0, "end": 1546.0, "text": "Schauen wir mal, wie wir das machen. Und hier oben machen wir noch einen Settings-Icon oder sowas hin, dass man auch ein paar... also ich will halt komplett ohne Config-Datei auskommen, die man von Hand schreiben muss, aber wenn man jetzt eine Oberfläche hat, kann man ein paar einfache Settings reinmachen, wie zum Beispiel, was der für eine Shortcut-Taste verwendet."}, {"id": 105, "start": 1546.0, "end": 1563.0, "text": "Also Woodface ist jetzt auf F gelegt, allerdings ist es halt Steuerung F, Steuerung F zeigt er das an. Das heißt, wir brauchen noch ein Setting, wo ich auswählen kann, was er für ein Modifier-Key nehmen soll, keine Ahnung, Steuerung Alt oder nur Steuerung F oder Shift-Ctrl-F oder was auch immer."}, {"id": 106, "start": 1563.0, "end": 1578.0, "text": "Deswegen, das ist das erste, das dürfte relativ simpel sein, wir machen so ein Settings-Icon hier oben hin. Und das Settings-Icon würde ich gerne animieren, wenn Uploads laufen oder irgendwie sowas."}, {"id": 107, "start": 1578.0, "end": 1597.0, "text": "Muss dazu sagen, ich hab von JavaScript nicht großartig Ahnung, ich hab mir da schon ganz schön einen abgebrochen bisher. Ich hab mir da bisher ganz schön schon einen abgebrochen."}, {"id": 108, "start": 1597.0, "end": 1611.0, "text": "Das hinzukriegen. Okay, wir machen jetzt erstmal Settings-Icon. Achso, ja, das müssen wir auch mal machen. Ich füg das mal wieder ein."}, {"id": 109, "start": 1611.0, "end": 1627.0, "text": "Ja, und wenn das funktioniert, also sprich, wenn ich, dass man jetzt Bilder reintracken droppen kann, dann werde ich die nächste Vorschau-Version auf GitHub veröffentlichen, dass man sich den Kram eben nicht mehr selbst kompilieren muss."}, {"id": 110, "start": 1627.0, "end": 1641.0, "text": "Dann würde ich als fertiges Windows-Exil einfach Downloaden ausführen, Memes reinziehen und fertig. So, jetzt starten wir das aber erstmal selbst."}, {"id": 111, "start": 1641.0, "end": 1670.0, "text": "Ist die Musik laut? Stärke okay, lauter, leiser, passt das. Bist du sicher, dass du das nicht für 200.000 an Microsoft Twitch Elgato verkaufen willst? Elgato gibt's doch nicht mehr."}, {"id": 112, "start": 1670.0, "end": 1695.0, "text": "Äh, was wollte ich jetzt machen? Auf Web-Interfell starten. Elgato gibt's doch nicht mehr. Elgato ist jetzt, haltet euch fest, wer es nicht mitgekriegt hat. Elgato ist jetzt Corsair, Corsair."}, {"id": 113, "start": 1695.0, "end": 1723.0, "text": "Das Stream ist kaputt. Geht ja wieder. Ja, das ist noch nicht so lang her, die Meldung. Corsair, Corsair, Corsair. Corsair. Ja, das sind Sachen, die versteht man nicht so genau, aber gut, gab's wahrscheinlich ein gutes Angebot."}, {"id": 114, "start": 1723.0, "end": 1730.0, "text": "GG Eats."}, {"id": 115, "start": 1730.0, "end": 1758.0, "text": "Okay, ähm, so, ach ja, noch eine geile Sache wollte ich euch ja auch zeigen. Dadurch, dass wir das jetzt so eingestellt haben, dass, ähm, richtig geil, also zumindest zum Entwickeln übelst nice, wir haben das jetzt ja so eingestellt, dass wenn das im Developer-Modus läuft, also im Debug-Modus, dass der das dann von einem lokalen Server sich die, ähm,"}, {"id": 116, "start": 1758.0, "end": 1773.0, "text": "die HTML und JavaScript-Geschichten von unserer Anwendung holt. Dadurch haben wir jetzt auch, ich zeig's euch mal ausführen, das Ganze. Das ist jetzt wirklich sehr, sehr nice. Das macht das Ganze viel einfacher."}, {"id": 117, "start": 1773.0, "end": 1788.0, "text": "So, wenn ich jetzt den Browser hier rechts mache und hier links mein Visual Studio und ich editier jetzt hier irgendwas, sagen wir, ich mach jetzt den Style hier raus, weil warum ist der überhaupt noch da, keine Ahnung, und ich drücke Speichern. Fuck, ich hätte erstmal reloaden müssen."}, {"id": 118, "start": 1788.0, "end": 1809.0, "text": "Äh, Moment, das hab ich vergessen. Ah ja, so, kommt mal, und ich drücke jetzt Speichern, bäm, dann reloadet sich das automatisch."}, {"id": 119, "start": 1809.0, "end": 1824.0, "text": "So, mach mal Platz, Alter. Geh weg. Das reloadet sich automatisch, also sprich, sobald ich hier was ändere im Editor, reloadet sich die Seite, das heißt, ich muss hier nicht mehr jedes Mal reinklicken, ja 5 drücken. Das ist ultra nice."}, {"id": 120, "start": 1824.0, "end": 1842.0, "text": "Also sprich, ich kann jetzt hier zum Beispiel sagen, gehen wir jetzt mal hier Style, Dark Mode wollen wir irgendwie, irgendwas, dass man's halt sieht, ja. Also sprich, wir wollen jetzt hier Dark Mode Color irgendwie, keine Ahnung, das da als Hintergrund haben, und jetzt drücke Speichern, bäm, automatisch refreshed auf der rechten Seite."}, {"id": 121, "start": 1842.0, "end": 1863.0, "text": "Und saumäßig schnell, ne. Das ist wirklich übelst nice. Was einem nämlich super auf den Sack geht, ist, wenn man JavaScript-Zeug macht, das war eins der ersten Sachen, die mich schon so abgefuckt haben, dass ich eigentlich keinen Bock mehr hatte, dass man jedes Mal, wenn man im Editor was speichert, den Browser aufmachen muss, ein F5 drücken oder auf dieses komische Häkchen hier oben."}, {"id": 122, "start": 1863.0, "end": 1877.0, "text": "Ich dachte erst so, so quasi Frontend-Java-Script-Noop, wie ich bin, ich mach hier nen Chrome-Plugin, dass die Seite, die alle 5 Sekunden neu lädt, aber das ist auch kacke, da lädt es halt die Seite neu, wenn man das grad nicht will, zum Beispiel, wenn man hier tippt oder so."}, {"id": 123, "start": 1877.0, "end": 1900.0, "text": "Pogas, alter, der Patrick ist da, Pogas. Ja, drück mal Steuerung S, zack, automatisch reload. Das geht allerdings nur im Debug-Mode. Das geht nur im Debug-Mode, wenn er das hier über diesen lokalen Server abruft, wenn das Ding hier quasi im Release-Mode läuft, dann nicht, dann ist es auch ein bisschen schneller."}, {"id": 124, "start": 1900.0, "end": 1919.0, "text": "So. Okay. Und auf Wiedersehen, was für JavaScript-Lull. Tja, JavaScript halt, ne? Das ist halt JavaScript, was willst du machen? Das wollte ich jetzt zeigen."}, {"id": 125, "start": 1919.0, "end": 1935.0, "text": "Ja, aber man sieht schon, es ist mittlerweile ziemlich ordentlich. Das letzte Mal war ja alles in einer Datei und jetzt machen wir das mit Vue.js. Das ist ja so der aktuelle Hyper-S-Trend."}, {"id": 126, "start": 1935.0, "end": 1950.0, "text": "Ja, das Skaronator, das habe ich auch ausprobiert. Und zwar mit, es gibt hier so einen, ich zeig das mal, weil ich kann jetzt hier nichts editieren."}, {"id": 127, "start": 1950.0, "end": 1967.0, "text": "Es gibt bei ASP.NET Core so ein Hot-Reload-Dingsgedöns, aber das hat den Nachteil, dass es übelst kompliziert einzurichten ist."}, {"id": 128, "start": 1967.0, "end": 1988.0, "text": "Dann funktioniert das auch. Da musst du den Webpack installieren und npm und irgendwelche kryptischen Webpack-Config basteln und so was. Und der Nachteil daran ist auch, dass dann keiner mehr, der das nicht kann, mitmachen kann."}, {"id": 129, "start": 1988.0, "end": 2005.0, "text": "Also sprich, du brauchst, du musst das dann haben. Wenn du das damit machst, wenn du das ganze über Webpack noch bundeln lässt und so was, dann muss halt jemand das lokal am Start haben und quasi auch wissen, dass das gibt und verwenden können und alles, dass er hier überhaupt mitmachen kann."}, {"id": 130, "start": 2005.0, "end": 2022.0, "text": "Ich will es so einfach wie möglich halten, deswegen habe ich auch keine extra View-Component-Bundle-Geschichte gemacht, sondern das ist einfach nur ein ganz normales HTML-File und ein JavaScript-File, wo wir gerade wieder beim Thema sind."}, {"id": 131, "start": 2022.0, "end": 2041.0, "text": "Aber im Vergleich zum letzten Mal ist das viel, viel lesbarer und viel schöner. Wie gesagt, das letzte Mal hier, ich habe es euch ja gerade gezeigt, hier alles inline JavaScript und sonst was und ich muss sagen, View ist wirklich schön simpel zu lesen."}, {"id": 132, "start": 2041.0, "end": 2063.0, "text": "Also guck mal, wir haben jetzt hier in 61 Zeilen JavaScript, auch mit ein bisschen Boilerplate-Gedöns noch dabei, also sprich in 61 Zeilen JavaScript und in 33 Zeilen HTML, was viel ordentlicher ist als das letzte, sogar noch eine ganze Ecke mehr Funktionen drin und das Ganze noch hübscher."}, {"id": 133, "start": 2063.0, "end": 2068.0, "text": "Ich finde, das sieht gar nicht so übel aus, die Geschichte."}, {"id": 134, "start": 2068.0, "end": 2076.0, "text": "Ja, sehbaro, das sind wir uns einig. Alles, was Java im Namen hat, ganz vergessen."}, {"id": 135, "start": 2076.0, "end": 2085.0, "text": "Also wir haben die gleiche Funktion wie das letzte Mal noch, dass man die Sachen anklicken kann, plus halt die Suche und den Theme-Switcher haben wir auch noch."}, {"id": 136, "start": 2085.0, "end": 2093.0, "text": "So, als erstes will ich jetzt aber hier oben mal einen Settings-Knopf oder irgendwie sowas hinmachen."}, {"id": 137, "start": 2093.0, "end": 2103.0, "text": "Achja, und was auch noch nice ist, ihr seht ja, das floated hier oben, also sprich die Suchleiste hat man immer, egal wie man scrollt."}, {"id": 138, "start": 2103.0, "end": 2108.0, "text": "Hier oben ist die Suchleiste, das machen wir hier, schreiben wir was rein, POC oder irgendwas oder sonst was."}, {"id": 139, "start": 2108.0, "end": 2113.0, "text": "Oder selbst wenn wir hier unten sind und nicht oben suchen, dann funktioniert das auch."}, {"id": 140, "start": 2113.0, "end": 2120.0, "text": "Also das haben wir in CSS so eingestellt, dass das hier so floated oben drüber, der ganze Krämpel."}, {"id": 141, "start": 2120.0, "end": 2126.0, "text": "So, also wir brauchen jetzt noch einen zweiten Button, und zwar einen Button für Settings."}, {"id": 142, "start": 2126.0, "end": 2134.0, "text": "Und eigentlich habe ich ja von Vue kaum Ahnung, weil ich habe ein paar Tutorials geguckt und das hier jetzt gebastelt."}, {"id": 143, "start": 2134.0, "end": 2141.0, "text": "Das heißt, kann sein, dass man da jetzt ein bisschen... Ich hoffe, das ist respon... Es ist einigermaßen responsive."}, {"id": 144, "start": 2141.0, "end": 2145.0, "text": "Moment, warum aktualisiert Windows das nicht?"}, {"id": 145, "start": 2145.0, "end": 2150.0, "text": "Windows, hallo? Du darfst den Browser auch bewegen, das ist schon erlaubt."}, {"id": 146, "start": 2150.0, "end": 2154.0, "text": "Also so, alter, Windows."}, {"id": 147, "start": 2154.0, "end": 2160.0, "text": "So halbwegs, so halbwegs responsive ist es, guck, so halbwegs."}, {"id": 148, "start": 2160.0, "end": 2165.0, "text": "Ab der Größe ist er nicht mehr responsive, so halbwegs, aber immerhin."}, {"id": 149, "start": 2165.0, "end": 2169.0, "text": "Immerhin."}, {"id": 150, "start": 2169.0, "end": 2174.0, "text": "Und das movet auch mit da oben."}, {"id": 151, "start": 2174.0, "end": 2179.0, "text": "Was es halt nicht kann, was halt richtig pro ist, also was halt richtig pro wäre,"}, {"id": 152, "start": 2179.0, "end": 2188.0, "text": "wenn man jetzt da krasse CSS-Logik machen würde, dass da jetzt quasi sagt, okay, jetzt ist da Platz weg,"}, {"id": 153, "start": 2188.0, "end": 2196.0, "text": "jetzt macht er nur noch fünf Spalten oder so, ne?"}, {"id": 154, "start": 2196.0, "end": 2198.0, "text": "So."}, {"id": 155, "start": 2198.0, "end": 2201.0, "text": "Das könnte man machen."}, {"id": 156, "start": 2201.0, "end": 2205.0, "text": "Aber das könnt ihr ja alles..."}, {"id": 157, "start": 2205.0, "end": 2220.0, "text": "Wenn ihr wisst, wie das geht, könnt ihr da gerne ein Pull-Request aufmachen."}, {"id": 158, "start": 2220.0, "end": 2223.0, "text": "Ja, Max, da war das allerdings noch nicht Vue.js."}, {"id": 159, "start": 2223.0, "end": 2229.0, "text": "Also jetzt ist das so, jetzt ist das hier irgendwie ein Crit."}, {"id": 160, "start": 2229.0, "end": 2233.0, "text": "Das können wir jetzt mal machen, also wenn ihr wisst, wie das geht, wir können das jetzt auch machen, schnell."}, {"id": 161, "start": 2233.0, "end": 2235.0, "text": "Dann müsst ihr ja mal erzählen, wie das funktioniert."}, {"id": 162, "start": 2235.0, "end": 2249.0, "text": "Und zwar aktuell ist es so, die Items, da, Items ist ein ListView, da hier, unordered list, Items,"}, {"id": 163, "start": 2249.0, "end": 2253.0, "text": "und der hat als CSS das da."}, {"id": 164, "start": 2253.0, "end": 2259.0, "text": "Display, Crit, Crit, Template, Columns, sechs Stück und ein FR. Ich hab ja wieder vergessen, was FR ist."}, {"id": 165, "start": 2259.0, "end": 2263.0, "text": "Irgendso ein vom Gesamtplatz, sonst was."}, {"id": 166, "start": 2263.0, "end": 2267.0, "text": "Ich hab keine Ahnung, wie das funktioniert, ich hab mir das auch noch von Stack Overflow kopiert,"}, {"id": 167, "start": 2267.0, "end": 2272.0, "text": "weil es gibt ja, wenn man sich das hier mal anguckt, 30 Milliarden Sachen, die man da setzen kann,"}, {"id": 168, "start": 2272.0, "end": 2274.0, "text": "die kann man gerade alle wissen."}, {"id": 169, "start": 2274.0, "end": 2286.0, "text": "Der Sideman ist richtig proer Frontend Developer, da kann man das. Ein Franzose."}, {"id": 170, "start": 2286.0, "end": 2292.0, "text": "Das passt thematisch heute sogar ganz gut."}, {"id": 171, "start": 2292.0, "end": 2297.0, "text": "So, also CSS Profis."}, {"id": 172, "start": 2297.0, "end": 2308.0, "text": "Wie mach ich mein Crit mehr responsive, dass das jetzt hier sich anpasst?"}, {"id": 173, "start": 2308.0, "end": 2315.0, "text": "Irgendjemand hat gesagt, drei Zeilen zählt erst, dann zeichnet man, dann schießt man los."}, {"id": 174, "start": 2315.0, "end": 2326.0, "text": "Was mit Bootstab verwenden, ja gut, das ist natürlich auch ne Magande."}, {"id": 175, "start": 2326.0, "end": 2331.0, "text": "Das ist ja nur hier so entstanden, weil ich eigentlich gar nicht weiß, was es macht."}, {"id": 176, "start": 2331.0, "end": 2339.0, "text": "Aber dafür funktioniert es gut, muss man da sagen."}, {"id": 177, "start": 2339.0, "end": 2345.0, "text": "Das geht nur, wenn man das mit dem Fenster skalieren, das geht nur, wenn man links und rechts,"}, {"id": 178, "start": 2345.0, "end": 2350.0, "text": "also wenn man quasi so gemacht hat hier, wenn man das so an die Seite, beide Fenster an die Seite irgendwie so"}, {"id": 179, "start": 2350.0, "end": 2356.0, "text": "enttatscht hat. Aber es buggt auch rum, wie du siehst hier teilweise. Manchmal skaliert der Browser nicht richtig mit und so."}, {"id": 180, "start": 2356.0, "end": 2363.0, "text": "Es ist irgendwie ziemlich kaputt. Habt ihr das gerade gesehen beim linken Fenster?"}, {"id": 181, "start": 2363.0, "end": 2374.0, "text": "Okay, Crit, Template, Columns, Auto Fit. Oh, oh, oh, oh, jetzt kommt's, jetzt bin ich gespannt."}, {"id": 182, "start": 2374.0, "end": 2382.0, "text": "Achtung, Achtung Leute. Seht Auto Reload? Habt ihr das gesehen? Nice."}, {"id": 183, "start": 2382.0, "end": 2393.0, "text": "Fuck. Alter. Oh, ist das responsive? Ist das responsive? Ja, guckt's euch an."}, {"id": 184, "start": 2393.0, "end": 2405.0, "text": "Responsive as fuck ist das. Boah, ist das nice. Siehste, deswegen mache ich das hier on stream."}, {"id": 185, "start": 2405.0, "end": 2408.0, "text": "Dann sehen Sie, wie ein paar Leute da die Ahnung haben von der ganzen Geschichte."}, {"id": 186, "start": 2408.0, "end": 2413.0, "text": "So, und jetzt, Serious Max, jetzt muss ich mir nur noch erklären, was das macht."}, {"id": 187, "start": 2413.0, "end": 2425.0, "text": "Okay, Repeat, Repeat, kann ich mir irgendwie, ne, wobei, ich hab nicht mal, was macht Repeat?"}, {"id": 188, "start": 2425.0, "end": 2439.0, "text": "Was? Ich hab keine Ahnung, was das macht, aber es funktioniert."}, {"id": 189, "start": 2439.0, "end": 2458.0, "text": "04D. Ach, du hast das auch noch, Stack Overflow Copy Paste. Naja, gut, das kann ich auch."}, {"id": 190, "start": 2458.0, "end": 2473.0, "text": "Okay, ich wollte ein Settings Icon machen. Okay, ganz, ganz wichtig, wir brauchen ein passendes Emoji für dieses Settings Icon."}, {"id": 191, "start": 2473.0, "end": 2488.0, "text": "Warum ein Emoji, da will ich keine Image Fonts einbinden muss. So, oh, das ist ein super, das ist ein super Settings Emoji hier."}, {"id": 192, "start": 2488.0, "end": 2503.0, "text": "Ne, das sieht scheiße aus. Einfach nur der Hammer vielleicht. Ne, sieht auch kacke aus. Der Hammer, ja, der Hammer ist gut."}, {"id": 193, "start": 2503.0, "end": 2509.0, "text": "Moment, warum ist das jetzt falsch rum? Ach so, weil das eine so rum und das andere so rum wäre, das ist klar."}, {"id": 194, "start": 2509.0, "end": 2522.0, "text": "Settings Icon. Zahnrad, ja, hab ich auch schon gedacht, aber, also es gibt hier irgendwo ein Zahnrad, aber das sieht auch kacke aus, guck mal."}, {"id": 195, "start": 2522.0, "end": 2545.0, "text": "Oder, warte mal. Ach, so schlecht sieht es gar nicht aus. Kockers. So, Zahnrad ist outtale, aber so muss das sein."}, {"id": 196, "start": 2545.0, "end": 2552.0, "text": "So, wie kriege ich jetzt den Abstand dazwischen hin? Also, ich will jetzt, dass der Abstand zwischen dem und dem nicht so groß ist."}, {"id": 197, "start": 2552.0, "end": 2557.0, "text": "Übrigens, jetzt, jetzt wird, also, jetzt, jetzt mal eine Frage an die richtig krassen."}, {"id": 198, "start": 2557.0, "end": 2576.0, "text": "Das Kockers GIF, ja, das, das muss ich, das muss ich wirklich noch ganz, das muss man sein. Ernsthaft, Mann. Das da."}, {"id": 199, "start": 2576.0, "end": 2593.0, "text": "Kockers GIF, F11 oder so, machen wir das. Kockers. So, das muss da rein. Moment, wo ist es? Desktop Memes."}, {"id": 200, "start": 2593.0, "end": 2606.0, "text": "Kockers. Habe ich F11 schon? Oh, nee, F11 habe ich schon. Dann ist es jetzt F12. Mehr, mehr, mehr Shortcuts habe ich auch gar nicht."}, {"id": 201, "start": 2606.0, "end": 2615.0, "text": "F12 habe ich noch nicht, ne? Kockers, da ist es. Kockers."}, {"id": 202, "start": 2615.0, "end": 2625.0, "text": "Aber man sieht schon, dass es relativ einfach da was hinzuzufügen und dass es auch im Web-Interface erscheint."}, {"id": 203, "start": 2625.0, "end": 2631.0, "text": "Und mit F12 funktioniert es auch."}, {"id": 204, "start": 2631.0, "end": 2645.0, "text": "Okay, als, als Settings-Symbol, nee, nee, nee. So, und jetzt, jetzt ist die Frage, also mal angenommen."}, {"id": 205, "start": 2645.0, "end": 2651.0, "text": "Man kann jetzt ja auch irgendwie mit, ja, die Software ist richtig sophisticated."}, {"id": 206, "start": 2651.0, "end": 2662.0, "text": "Du musst dir mal angucken hier, wie das automatisch hinzugeedet hat sich im Web-Interface, als ich den Ordner gezogen habe. Sehr, sehr nice."}, {"id": 207, "start": 2662.0, "end": 2671.0, "text": "Easy Money, wobei, Moment, ich kriege da kein Geld für."}, {"id": 208, "start": 2671.0, "end": 2677.0, "text": "Ich lasse mich immer so leicht ablenken, wenn ich am Stream bin. Jetzt habe ich schon wieder vergessen, was ich machen wollte."}, {"id": 209, "start": 2677.0, "end": 2683.0, "text": "Ja, genau. Man kann doch jetzt irgendwie, und ich habe es gesehen, im Chat sind auch ein paar, die wissen anscheinend, was sie machen."}, {"id": 210, "start": 2683.0, "end": 2686.0, "text": "Im Gegensatz zu mir, was JavaScript angeht."}, {"id": 211, "start": 2686.0, "end": 2691.0, "text": "In JavaScript kann man doch, äh, in CSS kann man doch jetzt irgendwelche Animationen machen."}, {"id": 212, "start": 2691.0, "end": 2705.0, "text": "Kann ich jetzt dieses Zahnrad, kann ich das irgendwie drehen lassen? Geht das? Mit CSS-Animation?"}, {"id": 213, "start": 2705.0, "end": 2715.0, "text": "Also zu was weiß ich, wenn ich dem Ding jetzt irgendwie mal eine ID gebe von irgendwie, äh, Animation-Test oder irgendwie sowas."}, {"id": 214, "start": 2715.0, "end": 2726.0, "text": "So. Klar geht das, aha, ja, wie geht das? Ähm, so, probieren wir mal aus."}, {"id": 215, "start": 2726.0, "end": 2748.0, "text": "Transform, Rotate, aha. Ich will allerdings nur das Bild rotaten lassen und nicht den Button."}, {"id": 216, "start": 2748.0, "end": 2757.0, "text": "Wie haben wir das genannt? Animation? Okay, probieren wir das jetzt mal aus. Also wie geht das? Wie könnte man das jetzt animieren lassen?"}, {"id": 217, "start": 2757.0, "end": 2764.0, "text": "Transform, Rotate, einfach so? Nee, nee, okay, das wäre zu einfach."}, {"id": 218, "start": 2764.0, "end": 2780.0, "text": "Ah ja, einfach das Zahnrad in ein Span oder, oder, oder, ah ja, stimmt, stimmt, das ist natürlich stimmt. Wir müssen das ja nicht dem ganzen, ganzen Button das, das geben. Ja, das stimmt, das ist, das ist gut."}, {"id": 219, "start": 2780.0, "end": 2792.0, "text": "So, genau."}, {"id": 220, "start": 2792.0, "end": 2800.0, "text": "Okay, ähm, da muss ich jetzt mal suchen, wie das geht."}, {"id": 221, "start": 2800.0, "end": 2829.0, "text": "Rotate Animation, Stack Overflow, beste. Animation, Spin Linear Infinite, beste. Stack Overflow, beste. Geht nicht. Geht nicht. Achso, geht immer noch nicht."}, {"id": 222, "start": 2829.0, "end": 2836.0, "text": "Ha."}, {"id": 223, "start": 2836.0, "end": 2843.0, "text": "Geht auch nicht, warum nicht?"}, {"id": 224, "start": 2843.0, "end": 2846.0, "text": "Warum geht das nicht?"}, {"id": 225, "start": 2846.0, "end": 2855.0, "text": "Alter, was ist das für Musik, das ist ja nervig."}, {"id": 226, "start": 2855.0, "end": 2864.0, "text": "Das hört, das hört sich an als, als, als hängt irgendwie ein Lego-Motor oder sowas. Kennt ihr das noch von früher? Hatte ich auch mal einen Lego-Motor?"}, {"id": 227, "start": 2864.0, "end": 2886.0, "text": "Die Dinger haben sich ungefähr so angehört, wenn man sie zu sehr belastet hat."}, {"id": 228, "start": 2886.0, "end": 2901.0, "text": "So. Okay, ich muss mal gucken, ob das jetzt dieses Ding überhaupt annimmt, diese Animation, wenn man müsste eigentlich, ne."}, {"id": 229, "start": 2901.0, "end": 2905.0, "text": "Können wir mal ausbilden, ob das jetzt annimmt irgendwie, keine Ahnung."}, {"id": 230, "start": 2905.0, "end": 2919.0, "text": "Background, Color, irgendwie so. Ja, da nimmt das. Okay, das funktioniert nicht. Warum, warum geht das nicht?"}, {"id": 231, "start": 2919.0, "end": 2927.0, "text": "Eventuell noch Display Inline-Plug, okay. Ich mach das einfach, ich mach das, was du sagst."}, {"id": 232, "start": 2927.0, "end": 2941.0, "text": "Nope. Nein, zu einfach ist es nicht. CSS-Tricks, oh, gleich mit einem Code-Pen-Link. Ach so."}, {"id": 233, "start": 2941.0, "end": 2968.0, "text": "Ja, im Moment der Rotate-Image, wir wollen ja ein Zeichen rotaten, so. Okay, ich copy-paste das jetzt mal von der anderen, von der anderen Seite, ob das hierfür auch funktioniert."}, {"id": 234, "start": 2968.0, "end": 2993.0, "text": "Ah, Koggers, funktioniert. Warum das andere nicht funktioniert, verstehe ich allerdings nicht."}, {"id": 235, "start": 2993.0, "end": 3022.0, "text": "Ja, warum das, warum das, das rotiert nicht in der Mitte, ja, das ist auch, irgendwie rotiert das, aber das Bild ist wahrscheinlich nicht ganz gerade, was da rotiert oder so."}, {"id": 236, "start": 3022.0, "end": 3038.0, "text": "Keine Ahnung. Ja, fancy Zeugs, warum sollte man da irgendwie, jetzt machen wir das Ganze noch ein bisschen schneller, noch ein bisschen schneller."}, {"id": 237, "start": 3038.0, "end": 3057.0, "text": "Bam. Okay, das ist vielleicht ein bisschen zu schnell. Es ist aber nicht ganz gerade."}, {"id": 238, "start": 3057.0, "end": 3074.0, "text": "Moment, ich will jetzt, ich, das, CSS-Rotate-Infinite, das kann doch nicht so schwer sein. Endless Rotation Animation, okay, wie geht das?"}, {"id": 239, "start": 3074.0, "end": 3088.0, "text": "Man muss da echt, man muss da echt so eine Rotation, aber das haben wir ja, haben wir ja angegeben. Alter, die Musik geht mir mega offen, sag."}, {"id": 240, "start": 3088.0, "end": 3111.0, "text": "Das muss doch irgendwie funktionieren. Ah, der, okay, nice."}, {"id": 241, "start": 3111.0, "end": 3125.0, "text": "Ich copypaste das jetzt einfach mal, was er hier macht. Ansonsten kann ich auch erstmal damit leben. Ach nee, Moment, du meinst zusätzlich, ne?"}, {"id": 242, "start": 3125.0, "end": 3147.0, "text": "Nun ja. Übrigens, das ist gar nicht so unsinnig, ne? Mit diesem, also warum ich das drehen lassen will, das kann ich euch jetzt auch mal verraten, was ich eigentlich vorhabe."}, {"id": 243, "start": 3147.0, "end": 3156.0, "text": "Span Alignment, okay, ja, das ist eine gute Idee. Kann man nicht einfach so Keyframes machen?"}, {"id": 244, "start": 3156.0, "end": 3160.0, "text": "Also warum ich will, dass ich das dreht, das kann ich jetzt mal revealen, warum ich das eigentlich machen will."}, {"id": 245, "start": 3160.0, "end": 3169.0, "text": "Also ich will, dass das zwei Funktionen hat, dieses Icon hier oben. Und zwar einmal, wenn man draufklickt, also noch ist es halt der Button wie hier, das ist ein bisschen kacke."}, {"id": 246, "start": 3169.0, "end": 3180.0, "text": "Wenn man draufklickt, kommt man in das Settings-Menü. Ach, in die Animation muss das rein, okay. Ich hab doch keine Ahnung."}, {"id": 247, "start": 3180.0, "end": 3194.0, "text": "Ist das jetzt gerade? Nee. Was? Die Animation rein? Wie geht das? So? So?"}, {"id": 248, "start": 3194.0, "end": 3210.0, "text": "Ich weiß nicht, was ich machen muss. Aber Span Alignment, also warum ich will, dass ich das dreht, ist, ich will, dass das anzeigt, wenn ein Upload, weil eigentlich wollen wir heute ein Upload programmieren für das Ding, dass ich neue Memes uploaden kann."}, {"id": 249, "start": 3210.0, "end": 3226.0, "text": "Vom zweiten Rechner aus oder vom Smartphone aus oder so. Und ich will, dass es sich dreht, solange der Upload läuft und sie nicht mehr dreht, sobald es nicht mehr läuft. Das ist richtig big brain."}, {"id": 250, "start": 3226.0, "end": 3246.0, "text": "Okay, aber Alignment, das ist eine gute Idee, das können wir machen. Span Alignment hier. Ach so, du meinst hier."}, {"id": 251, "start": 3246.0, "end": 3262.0, "text": "Nee, Textalign. Nee."}, {"id": 252, "start": 3262.0, "end": 3287.0, "text": "Und das muss mit bei den Webkit transformen. Ach so. Also das muss da dahinter oder was?"}, {"id": 253, "start": 3287.0, "end": 3297.0, "text": "Ich hab keine Ahnung, wie das aussehen muss. CSS, Alter."}, {"id": 254, "start": 3297.0, "end": 3304.0, "text": "Ach, ach, da unten dran. Ach hier. Alter Leute."}, {"id": 255, "start": 3304.0, "end": 3317.0, "text": "Wow, das ist krass. So viel besser."}, {"id": 256, "start": 3317.0, "end": 3328.0, "text": "Okay, jetzt verstehe ich sogar, was du meinst. Jetzt verstehe ich, dass man das hier einfach anpassen kann, wenn es nicht gerade ist."}, {"id": 257, "start": 3328.0, "end": 3341.0, "text": "Okay, ja, ich hab's verstanden. Ich hab's verstanden."}, {"id": 258, "start": 3341.0, "end": 3351.0, "text": "Ich gehe mal davon aus, dass es einfach nicht gerade ist."}, {"id": 259, "start": 3351.0, "end": 3359.0, "text": "Also ich vermute mal, dass es nicht... Doch, das ist genau in der Mitte."}, {"id": 260, "start": 3359.0, "end": 3367.0, "text": "Nee, ist es nicht. Guckt mal. Seht ihr das? Das ist ein bisschen zu weit oben."}, {"id": 261, "start": 3367.0, "end": 3377.0, "text": "Guckt mal."}, {"id": 262, "start": 3377.0, "end": 3384.0, "text": "Sieht es nur für mich so aus oder ist es bei euch auch so, dass das oben, dass das Bild einfach nicht ganz gerade ist?"}, {"id": 263, "start": 3384.0, "end": 3397.0, "text": "Das Bild hat links und rechts. Also das Bild ist 20, irgendwas mal 20. Ist kein Wunder, dass es nicht richtig dreht."}, {"id": 264, "start": 3397.0, "end": 3417.0, "text": "Kann man das hier anpassen? Irgendwie darf ich sagen."}, {"id": 265, "start": 3417.0, "end": 3437.0, "text": "Okay, das probieren wir jetzt mal aus. Mit so einem Scheiß verschwendet man immer die meiste Zeit, die man hat."}, {"id": 266, "start": 3437.0, "end": 3448.0, "text": "Okay, also das heißt... Okay, im Button, im Button. Das können wir probieren. Also wir machen jetzt Button. Button."}, {"id": 267, "start": 3448.0, "end": 3458.0, "text": "Style. Probieren wir mal aus. Button, Style. Und dann müssen wir das irgendwie alignen."}, {"id": 268, "start": 3458.0, "end": 3469.0, "text": "Oh, jetzt kommen die krassen Tipps am Start. Display Flex, Justify Center, Align Center. Für den Button, ne?"}, {"id": 269, "start": 3469.0, "end": 3481.0, "text": "Also nicht für die Animation, sondern für den Button. Also für den da. Oder?"}, {"id": 270, "start": 3481.0, "end": 3489.0, "text": "Fast. Haha, fast."}, {"id": 271, "start": 3489.0, "end": 3501.0, "text": "Das Span muss man style. Okay, also nicht den Button."}, {"id": 272, "start": 3501.0, "end": 3511.0, "text": "Das sieht schon deutlich besser aus jetzt. Oder? Kommt es nur mir so vor? Es ist zwar nicht ganz gerade, aber ich finde es ist... Es ist gerade."}, {"id": 273, "start": 3511.0, "end": 3520.0, "text": "Bisschen gerade als vorher. Ich glaube, da kann man im Prinzip nichts machen. Das Icon ist einfach nicht gerade. Guckt es euch doch mal an hier."}, {"id": 274, "start": 3520.0, "end": 3527.0, "text": "Seht ihr das nicht? Das ist einfach weiter oben als unten rechts. Das ist einfach nicht gerade."}, {"id": 275, "start": 3527.0, "end": 3543.0, "text": "Was? Justify Center? Okay, Moment."}, {"id": 276, "start": 3543.0, "end": 3563.0, "text": "Moment, habe ich jetzt irgendwie ein bisschen zu viel copy pasted hier? Ah ja. Ne, nicht wirklich. Scheiß drauf. Wir halten uns jetzt viel zu lange an diesem hässlichen Zahnrad auf."}, {"id": 277, "start": 3563.0, "end": 3581.0, "text": "Also falls einer eine gute Idee hat. Ja, das stimmt schon. Wahrscheinlich muss man das wirklich transformen. Aber ganz ehrlich, wir können es noch mal kurz probieren."}, {"id": 278, "start": 3581.0, "end": 3595.0, "text": "Anderes Icon. Warum rotate das jetzt eigentlich nicht mal?"}, {"id": 279, "start": 3595.0, "end": 3614.0, "text": "Oh, Hä? Warum muss ich eigentlich Display Inline Block machen, dass es überhaupt rotatet?"}, {"id": 280, "start": 3614.0, "end": 3628.0, "text": "Was auch immer das macht."}, {"id": 281, "start": 3628.0, "end": 3647.0, "text": "Das gucke ich mir mal an. Aber damit kann ich jetzt erst mal leben, so wie es ist. Es sollte sich ja gar nicht dauerhaft drehen. Sollte sich ja gar nicht dauerhaft drehen. Also wir haben hier Klaas. Koggers."}, {"id": 282, "start": 3647.0, "end": 3663.0, "text": "Und wird also so viel Zeit mit irgendeinem blödsinnigen Kram verschwendet."}, {"id": 283, "start": 3663.0, "end": 3678.0, "text": "Okay, die Klaas kommt jetzt weg. Jetzt einfach nur gucken, wie das funktioniert hat."}, {"id": 284, "start": 3678.0, "end": 3693.0, "text": "Okay, also lass mich mal überlegen. Ich will jetzt track and dropen. Jetzt wird es kompliziert. Also was ich machen will ist, ich will ein Item hier drauf track and dropen dürfen."}, {"id": 285, "start": 3693.0, "end": 3709.0, "text": "Das habe ich schon mal gemacht. Also von der Idee her weiß ich, wie das geht. Allerdings weiß ich nicht, wie das in Vue.js geht. Aber ich weiß nicht mehr genau, wie das funktioniert."}, {"id": 286, "start": 3709.0, "end": 3723.0, "text": "Von der Idee her, ich bastel jetzt erstmal was und mal gucken, ob das funktioniert. Also als erstes müssen wir erstmal hier sowas wie on track enter track leave brauchen."}, {"id": 287, "start": 3723.0, "end": 3734.0, "text": "Also ich werde das so machen. Ich habe mir das ja im Vorfeld schon mal überlegt. Wenn hier irgendjemand was rein zieht."}, {"id": 288, "start": 3734.0, "end": 3744.0, "text": "Was ist denn Patrick? Was ist eigentlich WM-Finale? Ich wollte heute ausnahmsweise mal auf Fußball gucken. Es ist doch glaube ich erst um 17 Uhr, oder?"}, {"id": 289, "start": 3744.0, "end": 3765.0, "text": "Jaja, 17 Uhr. Okay. Dauer noch. Eigentlich guter Stream. Und uneigentlich. Ist auch noch gut. Ich hoffe es wird zumindest."}, {"id": 290, "start": 3765.0, "end": 3776.0, "text": "Okay. Also ich bastel jetzt erstmal in der Hoffnung, dass das irgendwie funktioniert. Also wir brauchen sowas wie track. Weil das ist ja Vue. Das heißt wir machen das jetzt mit einem add davor."}, {"id": 291, "start": 3776.0, "end": 3786.0, "text": "Weil die Tutorials das so sagen. Track over. Also das heißt wir brauchen jetzt die Events. Track enter und track over."}, {"id": 292, "start": 3786.0, "end": 3798.0, "text": "Also sprich, sobald hier was reingezogen wird, löst das aus und sobald es drüber bewegt wird, löst das aus. So. Da machen wir jetzt eine Funktion dafür, die hier aufgerufen wird."}, {"id": 293, "start": 3798.0, "end": 3813.0, "text": "Und zwar hier. Die nennen wir einfach irgendwie track. So. Und das Ding kriegt einen Event. Weil es kriegt alles in JavaScript einen Event. Kann man sich gar nicht dagegen wehren."}, {"id": 294, "start": 3813.0, "end": 3820.0, "text": "Track. Und jetzt gucken wir mal, ob das funktioniert, wenn ich da was reinziehe. Ob das dann ausgelöst wird, das Event."}, {"id": 295, "start": 3820.0, "end": 3835.0, "text": "Habe ich da Vue.js gehört? Ja, wir sind im Trend. Wir gehen mit der Zeit. Wir machen das jetzt mit Vue.js. Wir machen kein Raw DOM Manipulation 300 Zeilen Index JS mehr."}, {"id": 296, "start": 3835.0, "end": 3846.0, "text": "Wir machen das jetzt ordentlich. Coggers log Event. Gucken wir mal, ob das Event auslöst."}, {"id": 297, "start": 3846.0, "end": 3856.0, "text": "Konsole öffnen. Event löst aus. Guckt. Ich ziehe es drüber. Track enter. Track enter. Funktioniert."}, {"id": 298, "start": 3856.0, "end": 3870.0, "text": "So. Und wie gesagt, nachdem ich wenig Frontends Zeug mache, weiß ich nicht, d.h. bevor ihr jetzt sagt, ok, der Max, der macht das so, so ist das gut, guckt euch lieber nochmal an anderen Stellen an, wie das richtig funktioniert."}, {"id": 299, "start": 3870.0, "end": 3886.0, "text": "Aber von der Idee her werde ich jetzt so machen, sobald Track enter bzw. Track over ist, blende ich hier so einen Overlay ein. So ein Fullscreen Overlay, wo dann drauf steht, give your Memes oder irgendwie sowas."}, {"id": 300, "start": 3886.0, "end": 3896.0, "text": "Und wenn man das dann loslässt, dann uploadet er das zum Server. D.h. wir müssen auch noch auf der Serverseite programmieren, dass er Uploads entgegennimmt."}, {"id": 301, "start": 3896.0, "end": 3912.0, "text": "Musste aber noch alles außer GIFs Image filtern. Ja, richtig, richtig. Ich filte einfach alles, was nicht mit meinem Type Image anfängt."}, {"id": 302, "start": 3912.0, "end": 3926.0, "text": "Trollprogramm. Das ist kein Trollprogramm. Also die Idee ist ja dahinter gewesen. Ich habe ja selbst sowas gesucht für meinen Stream. Oh, serious Max, das ist eine super Idee."}, {"id": 303, "start": 3926.0, "end": 3950.0, "text": "Wir machen C9 GIF Energy. Den da, den machen wir. Der kommt da als Text dann rein. Das kommt dann als Text da rein, das ist gut, das ist nice."}, {"id": 304, "start": 3950.0, "end": 3958.0, "text": "Das kopiere ich mir hier mal rein, damit ich es nicht vergesse."}, {"id": 305, "start": 3958.0, "end": 3980.0, "text": "Okay, also wenn Track, also Track, okay, okay. Da brauchen wir noch irgendwas, wo wir uns das merken, ob ein Trackvorgang läuft. Also sowas wie, keine Ahnung, Track Active."}, {"id": 306, "start": 3980.0, "end": 3998.0, "text": "Ich bastel jetzt einfach nur irgendwas grob hin, sowas von der Idee her hinkommen müsste. Okay, Track Enter, Track Offer. Das heißt wir brauchen jetzt noch ein GIF, ein GIF, was ich dann einplende."}, {"id": 307, "start": 3998.0, "end": 4012.0, "text": "So, dann sagen wir, if, wenn Track Active, dann plenden wir das Ganze ein. Mal gucken, ob das funktioniert, wenn das nicht Active ist."}, {"id": 308, "start": 4012.0, "end": 4028.0, "text": "Achso, das ist jetzt dahinter. Okay, dann nennen wir das jetzt mal ID. Das Ding brauchen wir noch CSS Styles, Track Overlay."}, {"id": 309, "start": 4028.0, "end": 4050.0, "text": "So, CSS Styles, Coggers, ganz wichtig, Track Overlay. So, und dann kriegt das Ganze hier eine Höhe von, wir werden mal gucken, ob das anzeigt, und eine Höhe von 500 Pixel."}, {"id": 310, "start": 4050.0, "end": 4070.0, "text": "Da ist es, okay. Dann haben wir Background, Background Color ist, jetzt, wir machen das erstmal fürs Dark Seam, Background Color ist Dark."}, {"id": 311, "start": 4070.0, "end": 4081.0, "text": "Und dann lassen wir das einfach weg und sagen jetzt einfach nur Opacity, also, dass man durchgucken kann, ist 09. Das funktioniert nicht."}, {"id": 312, "start": 4081.0, "end": 4101.0, "text": "Achso, Moment, ich muss das ja als Overlay machen. Das heißt, ich muss jetzt noch sagen, Position Fixed. Nee, fuck. Ach, du Scheiße, wie ging das nochmal? Ich will das ja als Overlay haben. Ich will ja, dass das nicht, ach du Scheiße, wie ging das hier Fixed?"}, {"id": 313, "start": 4101.0, "end": 4125.0, "text": "Float, nein. Display Flex, was Display Flex Fixed? Nee. Ach, fuck, wie ging das jetzt nochmal? Ähm, dass das als Overlay angezeigt wird."}, {"id": 314, "start": 4125.0, "end": 4145.0, "text": "Ist das vielleicht im Hintergrund irgendwie? Nee. Absolut, absolut, ja genau. Nee. Warte mal, was mache ich denn hier jetzt verkehrt? Ähm, warte mal, also von der Idee her, ich will es ja immer, ich will es ja immer an der gleichen, an der gleichen Stelle anzeigen lassen."}, {"id": 315, "start": 4145.0, "end": 4164.0, "text": "Also wir brauchen, wir brauchen schon sowas wie, ach, ich weiß, was wir machen müssen. Wir sagen Fixed und dann müssen wir nämlich noch sagen, Top, wo, wohin, müssen wir sagen, Left. Oder auch nicht."}, {"id": 316, "start": 4164.0, "end": 4191.0, "text": "Warte mal. Warum zeigt es denn jetzt nicht an? Hä?"}, {"id": 317, "start": 4191.0, "end": 4217.0, "text": "Warte mal, was? Moment, das zeigt es doch an, oder? Oder nicht?"}, {"id": 318, "start": 4217.0, "end": 4240.0, "text": "Was mache ich denn jetzt verkehrt? Okay, was, warum zeigt das den Scheiß nicht an?"}, {"id": 319, "start": 4240.0, "end": 4258.0, "text": "Absolut, okay. Moment, das ist, ich hab doch, ich hab mich doch hier irgendwo garantiert verschrieben."}, {"id": 320, "start": 4258.0, "end": 4281.0, "text": "Wirst du ein Video machen, wenn das Tool fertig ist? Weiß ich nicht, genau. Okay, von der Idee her ist es doch da. Warte mal, irgendwas, irgendwo habe ich gerade einen Denkfehler, das kann ja nicht so, kann ja nicht so schwierig sein."}, {"id": 321, "start": 4281.0, "end": 4294.0, "text": "Also, das Ding muss doch Position Fixed. Hä?"}, {"id": 322, "start": 4294.0, "end": 4317.0, "text": "Track Overlay, ich hab mich auch nicht verschrieben, ne? Was, was mache ich denn jetzt hier verkehrt? Das kann doch nicht sein. Schieben wir das mal woanders hin. Man sagt nicht egal, wo das ist. Du mein, das ist ein Overlay, was absolut platziert ist."}, {"id": 323, "start": 4317.0, "end": 4329.0, "text": "Schreiben wir mal was rein."}, {"id": 324, "start": 4329.0, "end": 4350.0, "text": "Aber wirklich, wo ist denn dieses kack Overlay jetzt? Hä? Ich check's noch. Warum, warum wird das nicht angezeigt?"}, {"id": 325, "start": 4350.0, "end": 4365.0, "text": "Oh, ich krieg links geschickt, wie es richtig geht. How to CSS Overlay. Okay, gucken wir uns jetzt zusammen an. How to CSS Overlay."}, {"id": 326, "start": 4365.0, "end": 4384.0, "text": "Ja, hab ich doch. Es ist doch fast genau das gleiche, was ich da gemacht hab. Doch, hier mehr oder weniger. Okay, Z-Index 2, meinetwegen."}, {"id": 327, "start": 4384.0, "end": 4398.0, "text": "Ich check's nicht, warum wird das Overlay nicht angezeigt?"}, {"id": 328, "start": 4398.0, "end": 4415.0, "text": "Ich bin jetzt grad echt. Nee, nee, nee, sehbar, aber es ist ja, ich hab hier überhaupt keine Bedingungen irgendwie drinne. Ja, Displan, ja Displan None will ich ja auch nicht. Ich will's ja displanen."}, {"id": 329, "start": 4415.0, "end": 4429.0, "text": "Wenn ich sag, hidden by default. Ich will's ja nicht heiden by default. Ich will's ja anzeigen by default."}, {"id": 330, "start": 4429.0, "end": 4445.0, "text": "Ich bin verwirrt. Ach, ich, könnte das daran liegen, dass ich, warte mal. Ha! Ich hatte kein Background."}, {"id": 331, "start": 4445.0, "end": 4470.0, "text": "Lull! Da muss er erstmal drauf kommen. Meine Fresse, ey. Richtig Omega-Lull. Alter! Das hat mich jetzt geschockt, ey."}, {"id": 332, "start": 4470.0, "end": 4482.0, "text": "Nice. Okay, okay, okay. Weiter geht's, weiter geht's. Wir wollen das in Dark. Overlay. Jetzt können wir das machen, was ich eigentlich machen wollte."}, {"id": 333, "start": 4482.0, "end": 4492.0, "text": "Und zwar sagen, durchsichtig. Genau. Das will ich als Overlay haben. So, und da kommt jetzt noch ein Text rein."}, {"id": 334, "start": 4492.0, "end": 4501.0, "text": "Alter, CSS, JavaScript. Ich krieg echt die Krise, ey. Vor allem kann mir mal jemand erklären, warum erbt denn jetzt bitte schön nicht das"}, {"id": 335, "start": 4501.0, "end": 4522.0, "text": "Diff-Background-Color von Diff außen rum. Aus welchen Gründen ist das jetzt so? Kann das jemand erklären? Give memes. Give memes."}, {"id": 336, "start": 4522.0, "end": 4537.0, "text": "Okay, so. Und da machen wir jetzt noch Schriftgröße. Da haben wir noch Text-Align. Da haben wir noch Center. So."}, {"id": 337, "start": 4537.0, "end": 4548.0, "text": "Und, ähm, das ist Trick 17. Das hab ich mir mal gemerkt. Mit der Zeilenhöhe kann man das hier irgendwie auch noch vertikal zentrieren,"}, {"id": 338, "start": 4548.0, "end": 4553.0, "text": "weil ich weiß, ehrlich gesagt, aus dem Kopf nicht, wie man Text vertikal richtig zentriert in der Mitte. Wie macht man das eigentlich?"}, {"id": 339, "start": 4553.0, "end": 4563.0, "text": "So. Give memes. Dann sagen wir jetzt noch, äh, Font-Size. 50. Mal 50. Okay, vielleicht bisschen, bisschen viel. 40."}, {"id": 340, "start": 4563.0, "end": 4578.0, "text": "Ein bisschen mehr Platz. So, schön. Es ist nicht sonderlich responsive, ja. Aber das passt schon. Vielleicht machen wir das noch ein Ticken weniger durchsichtig."}, {"id": 341, "start": 4578.0, "end": 4596.0, "text": "Und noch ein bisschen mehr. Nee, das ist okay. Das ist gut so. So. Okay. Ähm. So, und das zeigen wir nur an. If this track active."}, {"id": 342, "start": 4596.0, "end": 4609.0, "text": "Okay. Dann testen wir mal, ob das funktioniert. Von der Idee her. Also, das bedeutet, wenn ich jetzt was reinziehe. Und das ist das Schöne an Viewchairs,"}, {"id": 343, "start": 4609.0, "end": 4617.0, "text": "was ich sofort zu schätzen gelernt hab. Quasi schon während ich das Tutorial geguckt hab. Das bindet in beide Richtungen."}, {"id": 344, "start": 4617.0, "end": 4627.0, "text": "Also sprich, ähm, oder besser gesagt, wenn ich jetzt sage hier, ähm, wo ist es denn jetzt hier? Ich sag hier, das wird nur angezeigt, wenn track active."}, {"id": 345, "start": 4627.0, "end": 4634.0, "text": "Das heißt, wenn ich jetzt hier drinne irgendwo halt das hier auf True setze, dann rendert das automatisch rein. Das heißt, ich muss nichts machen."}, {"id": 346, "start": 4634.0, "end": 4647.0, "text": "Nichts extra. So. Wir testen es jetzt einfach mal ganz billig, sagt track active. Das ist natürlich nicht so der Weisheitsletzter Schluss. Aber wenn ich jetzt was reinziehe, geht das Overlay hin. Sehr nice. Aber es geht noch nicht wieder weg."}, {"id": 347, "start": 4647.0, "end": 4660.0, "text": "Das heißt, das müssen wir auch noch machen. So. Also jetzt gucken wir mal. Wenn Event. Ähm. Ich hab keine Ahnung, auf was ich checken kann."}, {"id": 348, "start": 4660.0, "end": 4676.0, "text": "Event. Gucken wir uns mal das Event an, was da gefeuert wird. Kogas. So. Ähm. Event. Hat das irgendwie so was wie ein Type oder sowas?"}, {"id": 349, "start": 4676.0, "end": 4701.0, "text": "Type. Track over. Ok. Also wenn. Gucken wir mal, ob das so funktioniert. Wenn Event. Type. Track over. Oder Event. Type. Gleich. Track enter."}, {"id": 350, "start": 4701.0, "end": 4725.0, "text": "Dann ist es active. Wobei, das können wir einfacher schreiben. So. Dann ist es active. Genau. So. Und jetzt müssen wir noch sagen."}, {"id": 351, "start": 4725.0, "end": 4735.0, "text": "Und jetzt müssen wir noch registrieren, dass Track. Track. Oder Drop. Oder was auch immer für ein Event genau geworfen wird."}, {"id": 352, "start": 4735.0, "end": 4755.0, "text": "Wenn man das. Wenn man das. Ach nee. Wir müssen. Es gibt ja zwei Fälle. Es gibt entweder. Es wird getropped. Oder es wird rausgezogen wieder. Wenn es wieder rausgezogen wird, müssen wir hier sagen. Ähm. Leave."}, {"id": 353, "start": 4755.0, "end": 4777.0, "text": "Frag mich nicht, warum wir das alles in der gleichen Funktion machen, aber das ist jetzt erstmal ziemlich einfach. So. Eats."}, {"id": 354, "start": 4777.0, "end": 4795.0, "text": "Funktioniert. Wobei. Es buggt. Guck mal. Es buggt. Wenn man schnell. Wenn man schnell reintrop, buggt es. Habt ihr es gesehen? Weil es mehrfach auslöst dann."}, {"id": 355, "start": 4795.0, "end": 4821.0, "text": "Oh, das ist doof. Dann machen wir es anders. Wir machen es anders. Ha. Viel besser. Track. Leave. Binden wir nicht hier drauf, sondern. Track. Leave. Binden. Funktioniert das überhaupt? Äh. Mal gucken. Track. Leave. Binden wir hier drauf. Ha. Easy."}, {"id": 356, "start": 4821.0, "end": 4837.0, "text": "Es gibt auch keine Bugs mehr. Oh, das ist doch. Das ist doch mega nice, oder? So. Und jetzt. Okay. So. Und jetzt brauchen wir. Jetzt müssen wir noch hier uns das Event für drop registrieren."}, {"id": 357, "start": 4837.0, "end": 4859.0, "text": "Drop. Das heißt wahrscheinlich einfach nur Drop. On. Drop. Ja. Drop. Track. Oh, mega nice. Ja. Richtig nice. So. Warum auch immer wir jetzt unser Drop Event auf Track binden, aber das ist. Ich meine. Das ist JavaScript."}, {"id": 358, "start": 4867.0, "end": 4887.0, "text": "Kannst mal richtig einrücken hier. So. Okay. Und jetzt müssen wir mal gucken, wenn das Event Type wahrscheinlich Drop ist. Vielleicht heißt es einfach nur Drop. Gehe ich mal von aus."}, {"id": 359, "start": 4887.0, "end": 4902.0, "text": "Dann geben wir mal was aus. So. Drop. Moment. Ach. Moment. Ja. Moment. Ah. Scheiße. Ich muss dem Ding jetzt erst mal sagen, dass die. Dass die Standardaktion, die rausführt, nicht, nicht gemacht werden soll."}, {"id": 360, "start": 4902.0, "end": 4922.0, "text": "Drag. Drop. JavaScript. Default. Action. Prevent Default. Klingt gut. Google Foo ist echt strong heute. Wir finden heute alles auf Anhieb."}, {"id": 361, "start": 4922.0, "end": 4935.0, "text": "Ah. Ich muss F muss noch weg. Lohnen muss man in dem Framework die Methoden wirklich alle in ein Objekt packen. Man kann das irgendwie. Man kann das wohl auch irgendwie splitten."}, {"id": 362, "start": 4935.0, "end": 4946.0, "text": "Also man kann irgendwie auch sagen, man macht den Skript Anteil in ein eigenes File und den Template Anteil und irgendwie sowas. Aber wir machen das alles alleine. Ich meine, es ist ja noch sehr übersichtlich."}, {"id": 363, "start": 4946.0, "end": 4959.0, "text": "Sind ja 70 Zeilen. Das ist ja nichts. Und ich finde insgesamt, auch wenn JavaScript an sich immer ziemlich hässlich ist, das finde ich sogar recht gut lesbar."}, {"id": 364, "start": 4959.0, "end": 4969.0, "text": "Unterschied zwischen Java und JavaScript sind zwei komplett unterschiedliche Programmersprachen. Nur weil die ähnlich heißen, haben die überhaupt nichts miteinander zu tun."}, {"id": 365, "start": 4969.0, "end": 4986.0, "text": "JavaScript ist das Ding, was du im Browser hast, beziehungsweise Node.js. Also JavaScript meistens V8. Also du hast ja im Prinzip, JavaScript gibt es im Prinzip in, also von den Implementierungen her eigentlich drei große."}, {"id": 366, "start": 4986.0, "end": 5000.0, "text": "Es gibt noch ein paar andere, aber eigentlich JavaScript hast du drei große. Du hast Chakra, du hast heute wie heißt die Firefox Implementierung, irgendwas mit Monkey glaube ich und du hast V8."}, {"id": 367, "start": 5000.0, "end": 5015.0, "text": "V8 ist mit Abstand das am verbreitetsten. Das ist das aus Chrome und aus Node.js und das was eigentlich fast jeder verwendet. Chakra ist das von Microsoft Edge."}, {"id": 368, "start": 5015.0, "end": 5028.0, "text": "Genau. Und Java ist halt eine komplett andere Programmersprache von Sun, äh von Oracle. Sun ist ja nicht mehr, hat es ja ausgesunt."}, {"id": 369, "start": 5028.0, "end": 5037.0, "text": "Ich soll es erloschen bei Sun. 5 Milliarden Jahre zu früh, aber Sun ist Geschichte."}, {"id": 370, "start": 5037.0, "end": 5051.0, "text": "Event-Default. Ich muss das gerade nochmal kurz stoppen. Ich muss noch hier das, äh, Steuerung F löschen, weil ich das zum Suchen brauche, das ziemlich doof ist."}, {"id": 371, "start": 5051.0, "end": 5058.0, "text": "Event-Prevent-Default. Das hört sich gut an."}, {"id": 372, "start": 5058.0, "end": 5068.0, "text": "Gibt es eine Programmiersprache, mit der man ins Programmieren einsteigen möchte? Ja, da habe ich ein paar Empfehlungen für. Es kommt drauf an, was du machen willst."}, {"id": 373, "start": 5068.0, "end": 5073.0, "text": "Also, bzw. nicht so sehr, nicht so sehr was sagen wir mal, ne, das war alles blöd."}, {"id": 374, "start": 5073.0, "end": 5094.0, "text": "Ähm, erstmal natürlich schon was du machen willst, aber wo du, auf welcher Plattform du unterwegs bist. Das ist ähm eine wichtige Entscheidung. Also sprich bist du unter Windows unterwegs und willst, sagen wir mal, mit Windows-Programmen anfangen, dann finde ich es zum einsteigen.net und C-Sharp das beste."}, {"id": 375, "start": 5094.0, "end": 5112.0, "text": "Dazu gibt es auch so viele Tutorial-Videos und Bücher kostenlose und Stack-Overflow-Einträge und alles. Also unter Windows kann man nicht, äh, also da führt eigentlich kein Weg an.net vorbei und C-Sharp, wenn man unter Windows anfangen will."}, {"id": 376, "start": 5112.0, "end": 5125.0, "text": "Ansonsten, ähm, weitere Sachen zum Einstieg finde ich ganz gut, so mal ganz allgemein, sind, äh, Python und Ruby. Einfach weil es, äh, somantisch, finde ich, sehr, sehr schöne, beides schöne Sprachen sind."}, {"id": 377, "start": 5125.0, "end": 5145.0, "text": "Zwar komplett anders, ja, Python ist eindeutig das ordentliche, aber Ruby ist, äh, relativ nah an, also an der natürlichen Sprache dran, wie man Ruby programmieren kann. Und das, das, ja, das vierte im Bunde ist eindeutig JavaScript, wenn du Web-Geschichten machen willst."}, {"id": 378, "start": 5145.0, "end": 5163.0, "text": "Und eigentlich ist das, sind diese, diese vier Sachen. Lassen wir mal Ruby, lassen wir mal Ruby weg. Wobei Ruby nicht schlecht ist, weil viele, viele der aktuellen, moderner Tools kommen von der Idee her so ein bisschen aus der Ruby-Ecke."}, {"id": 379, "start": 5163.0, "end": 5180.0, "text": "Auch wenn Ruby schon ziemlich, also die besten Tage hinter sich hat, vor allem Rails, ja, ähm, aber viele Ideen, also auch die ganzen, so wie die Web-Frameworks heute funktionieren und wie die, wie die ganzen Test-Tools und so funktionieren, das ist sehr stark von Ruby-Sachen inspiriert."}, {"id": 380, "start": 5180.0, "end": 5194.0, "text": "Ähm, aber eigentlich, wenn, wenn du, wenn du, ähm,.NET, also wenn du C-Sharp kannst und JavaScript und vielleicht noch Python, wenn du das in Kombination hast, du kannst eigentlich alles machen. Du kannst wirklich, es gibt nichts, was du nicht machen kannst."}, {"id": 381, "start": 5194.0, "end": 5212.0, "text": "Ähm, alles. Du kannst alles, Unity kannst du C-Sharp programmieren. Du kannst alles machen. Wenn du die drei Sachen kennst, ist, ist perfekt. Und natürlich gibt's immer noch, muss man sich immer weiterbilden. Das gibt's jetzt Go ist angesagt. Dann gibt's jetzt noch Flutter. Kennt, kennt ihr Flutter? Das ist von Google jetzt was Neues für, für UIs."}, {"id": 382, "start": 5212.0, "end": 5227.0, "text": "Ähm, aber wenn die drei Sachen hast, da kannst du wirklich, da fehlt dir nichts, ja? Und mit was du davon anfängst, ist eigentlich egal. Ich würd's davon abhängig machen, auf welcher Plattform ich bin und ähm, was ich, was ich machen will."}, {"id": 383, "start": 5227.0, "end": 5253.0, "text": "Sprich bist du unter Windows und willst Windows-Programme machen, dann würd ich mit.NET anfangen und C-Sharp. Willst du Web-Geschichten machen, egal wo, dann mit JavaScript und, ähm, bist du vielleicht unter Mac oder Linux oder so unterwegs und willst, ähm, da irgendwas machen bzw. äh, in Verbindung für, für JavaScript Web-Geschichten mit Python lernen."}, {"id": 384, "start": 5253.0, "end": 5267.0, "text": "Es ist, nimmt sich eigentlich nix großartig mit was du anfängst. Mein persönlicher Favorit zum Anfang ist, weil die meisten Leute sind unter Windows und so Windows-Programme sind auch immer ne schöne Sache zum Üben, ist mit.NET und C-Sharp anzufangen."}, {"id": 385, "start": 5267.0, "end": 5283.0, "text": "Du kannst, du kommst im Prinzip, aber angenommen, du lernst das jetzt und hast dann, lernt es spät und du willst das irgendwann mal auch beruflich machen und lernst das dann bei der richtigen Firma, du müsstest theoretisch nie wieder was anderes lernen, wenn die Firma das macht und das sich noch hält."}, {"id": 386, "start": 5283.0, "end": 5304.0, "text": "Aber eigentlich will das kein Programmierer, also keiner den ich kenne und da wirklich was taugt, ja, und die wollen jetzt in der Regel lernen die Leute freiwillig neue Sachen, weil es es interessiert. So, genug geschwätzt."}, {"id": 387, "start": 5304.0, "end": 5321.0, "text": "Okay, PreventDefault, haben wir gesagt, ne, muss man machen. PreventDefault. Habe ich die Frage auch beantwortet damit? Ich weiß nicht mehr wer sie gefragt hat, aber ich hoffe das hat jetzt irgendwie Sinn ergeben, was ich vor mir gegeben habe."}, {"id": 388, "start": 5321.0, "end": 5340.0, "text": "Ha, funktioniert, guckt. Nice. Also der Upload funktioniert nicht, aber rein und raus funktioniert und beim loslassen funktioniert es jetzt auch. Das ist schon mal, das ist schon mal richtig, das ist schon echt extrem Korgas gerade."}, {"id": 389, "start": 5351.0, "end": 5371.0, "text": "Die Musik eher."}, {"id": 390, "start": 5371.0, "end": 5387.0, "text": "Okay, so, also wir können jetzt Bilder reintrecken, droppen, sehr schön. Jetzt müssen wir noch gucken, dass der Scheiß geuploadet wird. So, ifEventDrop, also sprich, der Typ hat das Bild reingezogen und hat es auch losgelassen."}, {"id": 391, "start": 5387.0, "end": 5406.0, "text": "Das war eine sehr gute Ahnung, das ist schön. Bin ja froh, wenn das was bringt, was ich so erzähle. Okay."}, {"id": 392, "start": 5406.0, "end": 5417.0, "text": "Wenn das EventDrop ist, also sprich, der Typ hat die Bilder losgelassen, dann muss ich mir mal das Event angucken, was da jetzt eigentlich reinkommt. Zack."}, {"id": 393, "start": 5417.0, "end": 5437.0, "text": "EventType, kann man das ein bisschen kürzer machen hier ohne, jawoll, dass ihr auch was seht. EventType ist Drop. Nice. Desmond."}, {"id": 394, "start": 5437.0, "end": 5460.0, "text": "Nee, Desmond, das kann ich nicht aussprechen, ich sag mal Desmond. Also, ich finde die Motivation, das ist falsch rum. Man braucht was, was man machen will, dann lernt sich die Sprache und das Drumherum quasi dabei bzw. von alleine."}, {"id": 395, "start": 5460.0, "end": 5467.0, "text": "Also, wenn man sagt, man lernt jetzt eine Sprache und wenn man die Sprache kann, dann mach ich was damit, dann hat man nicht die Motivation, das zu lernen."}, {"id": 396, "start": 5467.0, "end": 5479.0, "text": "Du musst, als erstes muss stehen, dass du, also, das erste, was man machen muss, man braucht eine Idee, was man machen will und dann sucht man sich das, was dafür passt und setzt das damit um."}, {"id": 397, "start": 5479.0, "end": 5488.0, "text": "Dann hat man auch keine Motivationsprobleme, weil man ja als Ziel hat, dass man was Spezielles machen will. Wenn man einfach nur was lernt, um danach was mitzumachen, wird man es nicht lernen."}, {"id": 398, "start": 5488.0, "end": 5498.0, "text": "Also, du brauchst, du brauchst irgendeinen Aufhänger. Also, zu sagen, ich will jetzt ein, keine Ahnung, ein Meme Tool programmieren."}, {"id": 399, "start": 5498.0, "end": 5502.0, "text": "Was brauch ich dazu? Ich brauch irgendwie ein Backend-Geschichte und ich brauch Javascript."}, {"id": 400, "start": 5502.0, "end": 5512.0, "text": "So. Und ich hatte hier vor auch keine Ahnung von Vue.js oder sonst was, paar Tutorials angeguckt, weil dementsprechend auch die Motivation da war, weil ich das machen will und eats as fuck."}, {"id": 401, "start": 5512.0, "end": 5525.0, "text": "So. Okay, also, Trangle-Trop. Wenn das Event-Trop ist, dann... Moment."}, {"id": 402, "start": 5525.0, "end": 5537.0, "text": "Jetzt hab ich hier eine halbe Stunde reincopy-pasted. Also, wenn das Event-Trop ist, was ist denn da alles so drinnen?"}, {"id": 403, "start": 5537.0, "end": 5547.0, "text": "IsTrusted, bla, bla, bla, Path. Wo krieg ich denn jetzt die Files her? Ich meine, muss ja irgendwo stehen, welche Files getracked and dropped wurden."}, {"id": 404, "start": 5547.0, "end": 5554.0, "text": "Track-Overlay, Two Element, bla, bla, bla. Wo stehen denn jetzt die Files drinnen?"}, {"id": 405, "start": 5554.0, "end": 5573.0, "text": "Datatransfer. Oh, das klingt gut. Datatransfer-FileList. FileList ist 0. Warum ist denn die FileList 0?"}, {"id": 406, "start": 5573.0, "end": 5597.0, "text": "Ich glaube, das buggt rum im Browser, die Anzeige. Aber FileList klingt gut. Also sprich, Files ist Event-Datatransfer-Files."}, {"id": 407, "start": 5597.0, "end": 5609.0, "text": "Ähm, da machen wir mal ne Schleife drüber und lassen uns mal die Files... Ups. Alter. JavaScript. In File..."}, {"id": 408, "start": 5609.0, "end": 5626.0, "text": "Übrigens, ist ein JavaScript auch übelst verwirrend, ne? Dass es for each, for off und for in gibt und so. But why? Weil JavaScript. File."}, {"id": 409, "start": 5626.0, "end": 5642.0, "text": "Coggers, da ist es. F12, Coggers. File, FileName. F12, Coggers. Ok, das heißt, hier haben wir die Files drinnen."}, {"id": 410, "start": 5642.0, "end": 5656.0, "text": "Ok. Oh fuck, wie schicke ich denn das jetzt zu meinem Server? Äh, wie schicke ich das jetzt zu meinem Server? Ich brauch, ich brauch nen..."}, {"id": 411, "start": 5656.0, "end": 5670.0, "text": "ViewHTTPPost. Wie macht man das? ViewResource. Das klingt gut. SendPostRequest. Weil ich muss jetzt ja, also von der Idee her, ne, was ich jetzt vorhabe,"}, {"id": 412, "start": 5670.0, "end": 5679.0, "text": "ob das funktioniert oder was ganz anderes. Also, wenn irgendjemand ein Bild hier reinzieht und loslässt, dann wird das hier aufgerufen."}, {"id": 413, "start": 5679.0, "end": 5688.0, "text": "Ich, ähm, hol mir die Dateinamen raus. Beziehungsweise, wahrscheinlich kann man das auch irgendwie einlesen hier drüber, muss ich da mal gucken."}, {"id": 414, "start": 5688.0, "end": 5696.0, "text": "Ähm, ich hol mir die Dateinamen raus, was gedroppt wurde, weil ich mein, es kann ja auch sein, dass irgendwie einer drei Sachen droppt oder so."}, {"id": 415, "start": 5696.0, "end": 5706.0, "text": "Und jetzt muss ich die irgendwie zum Server schicken. Das heißt, wir müssen jetzt zwei Sachen machen. Ich muss, ähm, auf dem, auf dem Server muss ich einstellen,"}, {"id": 416, "start": 5706.0, "end": 5717.0, "text": "muss ich noch was, müssen wir hier im Backend noch basteln, dass ich überhaupt das annehme. Aber bevor ich das mache, will ich erstmal im Frontend einstellen,"}, {"id": 417, "start": 5717.0, "end": 5728.0, "text": "dass es überhaupt zum Server hinschickt. Moin, Elina, Elinas, was ein S ausmachen kann. Das S macht Grill oder nicht Grill aus."}, {"id": 418, "start": 5728.0, "end": 5734.0, "text": "Ähm, genau, und dann schickt das zum Server. Das muss ich dem jetzt irgendwie beibringen. Wie macht man ein Postrequest aus Vue.js?"}, {"id": 419, "start": 5734.0, "end": 5750.0, "text": "Beziehungsweise, wie macht man überhaupt im Browser das? Geht das nicht mit Fetch? Fetch ist doch irgendwie ein neuer, neuer Special API."}, {"id": 420, "start": 5750.0, "end": 5763.0, "text": "Axios? Nee, das ist echt, ich will irgendwas eingebautes nehmen. Das gibt es, das habe ich letztendlich nicht mehr gelesen, es gibt so ein neuer, neue HTTP API im Browser."}, {"id": 421, "start": 5763.0, "end": 5782.0, "text": "Hä? Ah, hier oben. Fetch? MethodPost?"}, {"id": 422, "start": 5782.0, "end": 5802.0, "text": "Ähm, warte mal, da gibt es doch bestimmt irgendetwas, warte mal. Ich habe doch das da. Das ist irgendwie ein bisschen für Vue.js da. Das ist doch viel, viel nicer."}, {"id": 423, "start": 5802.0, "end": 5814.0, "text": "Ja, so. Oh, das ist schön. Das ist nice. Das ist schick, sowas hier. Einfach nur blablabla. Anstatt, anstatt, anstatt get kann man hier bestimmt auch post machen. Das ist schön. Das nehmen wir."}, {"id": 424, "start": 5814.0, "end": 5824.0, "text": "Da müssen wir uns nicht mit hier irgendwie, ähm, merkwürdig in APIs rumquälen. Vue.Resource nehmen wir, Vue.Resource."}, {"id": 425, "start": 5824.0, "end": 5832.0, "text": "Packen wir das mal als Skript rein zum Testen nur. Danach laden wir das runter und schieben. Aber wir können es auch gleich runterladen."}, {"id": 426, "start": 5832.0, "end": 5856.0, "text": "Aber gleich runter. Ladest du das am besten jetzt runter? Lol. Scheiß drauf. Ich will jetzt erstmal ausbringen, ob das funktioniert. Danach laden wir das runter."}, {"id": 427, "start": 5856.0, "end": 5880.0, "text": "So, ähm, wo ist es denn hier? Skript. So, und jetzt kann ich hier sagen, this things, rttp, oder wie ging das jetzt? Post, post, url, ok."}, {"id": 428, "start": 5880.0, "end": 5900.0, "text": "Post. Hat er ein Beispiel für ein Post? Post. Ich denke, dass wir Dinge mit Postrequest machen können. Und sonst kannst du das überhaupt nicht gebrauchen."}, {"id": 429, "start": 5900.0, "end": 5914.0, "text": "Fetch ist simpler. Ok, ja, kann auch sein. Also, ja gut, Fetch ist wirklich simpel. Ja, das stimmt schon. Guck mal, das ist eats as fuck eigentlich."}, {"id": 430, "start": 5914.0, "end": 5921.0, "text": "Ich mein, du musst ja nichts machen. Du sagst die World, wo du hin willst. Ich mach das jetzt mal mit Vue.Resource und danach stellen wir das auf Fetch um."}, {"id": 431, "start": 5921.0, "end": 5940.0, "text": "Also hier, so, das will ich. Das will ich haben. So, also, Post machen wir api slash upload. Ähm, das muss ich noch anlegen, das gibt's auf Serverseite noch nicht."}, {"id": 432, "start": 5940.0, "end": 5957.0, "text": "Diese Seite. So, senden tun wir. Fuck, was sende ich denn da? Die Files? Nee, das kann nicht sein. Config haben wir nicht. Und jetzt machen wir Trick 17, ich sehe, das ist so ein Promise Zeug, da können wir Await verwenden."}, {"id": 433, "start": 5957.0, "end": 5977.0, "text": "So, als alter C-Sharp-Fan. Ist mir, ist mir das hier eine viel lieber Syntax. What? Ist mir die Syntax so viel lieber? Moment."}, {"id": 434, "start": 5977.0, "end": 5992.0, "text": "Await is only, ach so, Async Functions. Ok. Async. Ja, ach gut. Upload Files. Files kann ich so, das geht so nicht. Garantiert geht das so nicht. Aber wir können mal gucken, was passiert."}, {"id": 435, "start": 5992.0, "end": 6003.0, "text": "Restart. Also wir laden das jetzt zu unserem Server hoch, hier unter dieser Uhr. Allerdings gibt's das auf Serverseite noch gar nicht. Dementsprechend kann das nicht funktionieren."}, {"id": 436, "start": 6003.0, "end": 6032.0, "text": "So, method not allowed. Das ist klar, mein Server sagt, gibt es nicht. Aber es funktioniert prinzipiell."}, {"id": 437, "start": 6032.0, "end": 6044.0, "text": "Also das, das klappt doch. Kann man, kann man eigentlich sowas hier machen? Also jetzt haben wir eine Frage an die JavaScript-Kanäle."}, {"id": 438, "start": 6044.0, "end": 6068.0, "text": "Also angenommen, ich benutze hier Await. Was, was kann ich ihm denn sagen, was er im Fehlerfall machen soll? Also ich sag jetzt hier Await Result und was sag ich ihm auf, was sag ich ihm on Error?"}, {"id": 439, "start": 6068.0, "end": 6088.0, "text": "Try Catch. Ich weiß nicht, ob sowas gibt. Keine Ahnung. Await Promise Error. Wie macht man das? How to write?"}, {"id": 440, "start": 6088.0, "end": 6105.0, "text": "Noob. Ja, richtig. Reject. Reject. Aha. Interessant. Reject. Gucken wir uns das mal an. Reject. Reject."}, {"id": 441, "start": 6105.0, "end": 6127.0, "text": "Ah ja. Okay, also sprich, geht das, geht das dann so? Reject. Äh. Keine Ahnung. Kein Chimmer."}, {"id": 442, "start": 6127.0, "end": 6143.0, "text": "Try Catch? Nein, nein, nein, nein."}, {"id": 443, "start": 6143.0, "end": 6156.0, "text": "Reject. Ja, mach ich doch."}, {"id": 444, "start": 6156.0, "end": 6175.0, "text": "Wir gehen einfach davon aus, dass es keinen Fehler gibt. Ja, ich bin, ich bin geneigt dazu, das zu machen, ja."}, {"id": 445, "start": 6175.0, "end": 6180.0, "text": "Reject is not a function. Was mach ich denn verkehrt?"}, {"id": 446, "start": 6180.0, "end": 6196.0, "text": "Oder ist das gar kein Promise? Aber wenn es kein Promise wäre, könnte ich es doch gar nicht Awaiten."}, {"id": 447, "start": 6196.0, "end": 6214.0, "text": "When, when we use Async and Await, we write it because... But, but... Alter, warum ist das in JavaScript alles so kompliziert?"}, {"id": 448, "start": 6214.0, "end": 6230.0, "text": "Egal. Es gibt keine Fehlerfälle. Es gibt keine. Es gibt keine Fehler. Easy. Wir ignorieren es einfach, dass es Fehler gibt."}, {"id": 449, "start": 6230.0, "end": 6244.0, "text": "Ach so. Punkt Catch ist es. Punkt Catch. Ha. Nee. Ach fick dich, keine Ahnung."}, {"id": 450, "start": 6244.0, "end": 6258.0, "text": "Lol. Was weiß ich wie der Scheiß funktioniert. Es gibt keine Fehler. Fehler outdated, overrated, debated. Brauchen wir nicht."}, {"id": 451, "start": 6258.0, "end": 6263.0, "text": "Ja, ja doch. Aber ich will es ja eigentlich mit Await machen. Also, dass ich schreiben kann irgendwie."}, {"id": 452, "start": 6263.0, "end": 6274.0, "text": "Wenn sonst was, sowieso ist klar. Aber warum kann ich nicht Await und Error oder irgendwie sowas. Also, quasi Await da drauf und wenn Fehler dann... Ach, keine Ahnung."}, {"id": 453, "start": 6274.0, "end": 6285.0, "text": "Ich hab das Promise Prinzip noch nicht verstanden. Das ist richtig. Das ist korrekt. Da kann ich nichts dagegen sagen. Das ist so. Await debated."}, {"id": 454, "start": 6285.0, "end": 6293.0, "text": "Jetzt gucken wir uns dann klar hin. Jetzt will ich erstmal den Upload hinkriegen. Das ist aber richtig, Ibims Mary. Ich hab das Promise Prinzip wirklich nicht verstanden."}, {"id": 455, "start": 6293.0, "end": 6307.0, "text": "Ich hab allgemein wenig verstanden, weil es um JavaScript geht. So. Result. Okay Result ist dann... Moment. Ist das Result? Ist in dem Result dann vielleicht irgendwie das?"}, {"id": 456, "start": 6307.0, "end": 6332.0, "text": "Was ist drinnen? Also Saito, wenn du irgendwas hast, im Zweifel machst du auf Pastebin oder so. Aber ich lasse es jetzt erstmal. Ich will jetzt erstmal gucken, dass es mit dem Upload funktioniert."}, {"id": 457, "start": 6332.0, "end": 6342.0, "text": "Okay. Also, wenn ich es jetzt hier reintrack und droppe, dann versucht ihr es zum Server zu posten. Gut. Nice. Das heißt, als nächstes müssen wir uns auf der Serverseite einstellen."}, {"id": 458, "start": 6342.0, "end": 6354.0, "text": "Mit einer ordentlichen Programmiersprache, dass er das entgegennimmt. Da geben wir uns einen AP-Controller, der noch nicht allzu viel macht, außer bei Index irgendwie ein sinnloses JSON zurück zu liefern."}, {"id": 459, "start": 6354.0, "end": 6377.0, "text": "Das heißt, das können wir uns auch gleich schon mal schenken. So. Oder wir schreiben das einfach um. So. Das Ding haben wir genannt Upload. Upload. Upload. Mega Upload. Mega."}, {"id": 460, "start": 6377.0, "end": 6393.0, "text": "Wir brauchen gleich noch mal den Mega Upload Song, oder? Leute, was sagt ihr? Bist du eigentlich auch schon so hyped auf die Black Ops 4 Beta? Du weißt gar nicht, dass es eine Black Ops 4 Beta gibt. Gibt es eine Black Ops 4 Beta?"}, {"id": 461, "start": 6393.0, "end": 6418.0, "text": "Open Beta für August angekündigt. Oh mein Gott. Black Ops 4 Beta. Mit Granaten. Mit Noobtube Grill. Warum? Warum? Also nicht warum. Ist das überhaupt ein Grill? Ich weiß nicht. Aber warum Noobtube? Warum sehen wir schon den Noobtube auf dem... Warum?"}, {"id": 462, "start": 6418.0, "end": 6437.0, "text": "Wenn du als BWLerin sitzt und keine Ahnung hast, was passiert. Ja, aber das ist doch als BWLer normal, oder? Omega Lul. Also ich weiß nicht, ob ich so gehypt bin auf Black Ops. Keine Ahnung. Dreck."}, {"id": 463, "start": 6437.0, "end": 6458.0, "text": "Also wenn die Beta kostenlos ist, dann werde ich mir das wahrscheinlich mal angucken. Ah, nee, nee, nee. Okay, also. Wir müssen dem Ding jetzt irgendwie beibringen. Paste Bin. Oh, das Saito. Das Saito blickt durch."}, {"id": 464, "start": 6458.0, "end": 6471.0, "text": "Await Promise Function Catch Error. Das habe ich ausprobiert eben. Das hat nicht funktioniert, weil ich probiere es jetzt nochmal aus."}, {"id": 465, "start": 6471.0, "end": 6494.0, "text": "Ich probiere es nochmal aus. So. Wo habe ich es denn hier? Da. Also. Okay, wir probieren es jetzt nochmal aus."}, {"id": 466, "start": 6494.0, "end": 6507.0, "text": "Ach, ich habe es wieder verkackt. Ich habe wieder auf den Kopf gedrückt, obwohl ich nicht auf den Kopf drücken darf."}, {"id": 467, "start": 6507.0, "end": 6516.0, "text": "Das hat jetzt zwar keiner verstanden, was ich meine, aber ich habe es verstanden. Das reicht. So. Weil es geht kaputt, wenn ich jetzt zweimal starte."}, {"id": 468, "start": 6516.0, "end": 6529.0, "text": "So. Also. Angeblich geht das so, schreibt das Saito. Das bedeutet. Await Blablabla. Falsch Catch. Das habe ich eben. Ach so. Ah. Muss man das dahinter schreiben?"}, {"id": 469, "start": 6529.0, "end": 6545.0, "text": "So was hier. Achtung Leute. Gucken, ob das jetzt funktioniert. Bam. Ja. Ja. Das funktioniert."}, {"id": 470, "start": 6545.0, "end": 6570.0, "text": "Coggers Leute. Nice. Error Handling in 2K18. Ah. Mein Chat ist halt einfach der beste. Mein Chat weiß halt Bescheid."}, {"id": 471, "start": 6570.0, "end": 6585.0, "text": "Das sieht überall hässlich aus. Egal, wo ich es hinschiebe. So. Nee. So. Nee. Sieht ja egal, wo ich es hinschiebe. Kacke aus."}, {"id": 472, "start": 6585.0, "end": 6605.0, "text": "Wir lassen es da hinten dran hängen. Ok. Sehr schön. Sehr, sehr nice. So. Jetzt müssen wir unseren AP Controller. So. Ja. Ja, warum nicht? Ja, stimmt. Sieht doch ganz hübsch aus."}, {"id": 473, "start": 6605.0, "end": 6620.0, "text": "Ok. So. Jetzt müssen wir uns dem Server irgendwie beibringen, dass er die Upload-Geschichte entgegen nimmt. Und dazu muss ich, weil meine Standard-Routen komplett fail sind, die werfe ich einfach mal alle raus."}, {"id": 474, "start": 6620.0, "end": 6641.0, "text": "Sonst reagiert das überhaupt nicht auf Upload. So. Dann sagt man eben hier, für welche Route er zuständig ist. Route. Und zwar ist er zuständig für slash ap slash upload."}, {"id": 475, "start": 6641.0, "end": 6654.0, "text": "Das ist das. Also sprich, nur so zur Erklärung, wenn man jetzt sagt, ich rufe auf meinem Server auf, also quasi sowas hier, ap slash upload."}, {"id": 476, "start": 6654.0, "end": 6671.0, "text": "So. Dann muss er ja wissen, welchen Code er letztendlich aufruft dahinter. Und das sagt man hiermit. Ok. Upload. Und das Ganze ist ein HTTP-Post. HTTP-Post."}, {"id": 477, "start": 6671.0, "end": 6684.0, "text": "Kein Get, sondern ein Post. Weil wir wollen ja was schicken. Also wir wollen ja was zum Server schicken. Wir wollen nichts abrufen. Da wäre es ein Get. Wir wollen was posten. Zum Server. So. Upload."}, {"id": 478, "start": 6684.0, "end": 6704.0, "text": "Dann müssen wir eben natürlich auch noch sagen, was wir haben. Ok. Scheiß. Wie macht man, ich bin echt jetzt überfragt. Wie macht man denn jetzt einen Image-Upload? Wie macht man das jetzt richtig? Datei-Uploads in ASP.NET Core. Also wir sind heute wirklich Weltmeister im Googeln."}, {"id": 479, "start": 6704.0, "end": 6724.0, "text": "Highform-File. Post. Ok, die schreiben das ein bisschen anders, aber das ist wurscht letztendlich. Ok, wir kriegen eine Liste mit Files. Das ist von der Idee her auch logisch, weil ich kann ja mehrere Dateien markieren und hochladen."}, {"id": 480, "start": 6724.0, "end": 6744.0, "text": "Ok. Eine Stunde geht Fußball aus. Alter Fußball. Also ich glaube ich werde es mir heute echt mal geben. Ich glaube ich gebe mir heute mal eine Runde Fußball. So Files. Files kann ich mal angucken. So."}, {"id": 481, "start": 6744.0, "end": 6758.0, "text": "Also brauchen wir im Endeffekt das hier. Lists. Muss man erstmal einbinden."}, {"id": 482, "start": 6758.0, "end": 6776.0, "text": "Fußball. Doch. Normalerweise bin ich richtiger Informatiker, was Fußball angeht. Ich gucke nie Fußball. Ich gucke nie Fußball. Ich habe aber auch früher nie Fußball geguckt. Was ich früher gerne geguckt habe ist, wahrscheinlich werde ich jetzt sagen, wie kann man sowas gucken."}, {"id": 483, "start": 6776.0, "end": 6794.0, "text": "Ich habe immer gerne Tour de France und sowas geguckt. Als ich noch ein bisschen jünger war. Als ich in Ulrich noch am Start war und sowas. Da habe ich immer Opa zusammen geguckt immer. So Rundfahrzeugs."}, {"id": 484, "start": 6794.0, "end": 6812.0, "text": "Upload Files. Ich habe keine Ahnung ob das funktioniert. Ok. Wir geben jetzt mal 200 zurück. 200 ist immer gut. 200. Easy."}, {"id": 485, "start": 6812.0, "end": 6828.0, "text": "Und jetzt lasse ich mir mal ausgeben, falls das in irgendeiner Form funktionieren sollte, ist es beim Programmieren eigentlich normal, dass man fast 95% der Zeit auf Stack Overflow ist oder Sachen googelt. Ja."}, {"id": 486, "start": 6828.0, "end": 6848.0, "text": "Nicht falsch verstehen. Das gibt es nicht falsch verstehen. Ist so. Ist so. Ist so. Wenn 75% mal reichen. Wenn du was neues lernst, sind es wahrscheinlich sogar 90%."}, {"id": 487, "start": 6848.0, "end": 6872.0, "text": "So. Ob das jetzt funktioniert? Ich glaube ja nicht, aber probieren wir mal aus. Vielleicht sollte man eine Konsolenausgabe einstellen."}, {"id": 488, "start": 6872.0, "end": 6891.0, "text": "Danke, dann kommst du wieder. Also du musst dir nicht blöd vorkommen, wenn du googelst. Das ist vollkommen normal. Das ist das Normalste der Welt. Stack Overflow gucken, googeln. Ist das JavaScript? Das ist C-Sharp. Das ist JavaScript."}, {"id": 489, "start": 6891.0, "end": 6913.0, "text": "So. Jetzt bin ich ja mal gespannt, ob das jetzt irgendwie funktioniert. Ok. Ich track and drop jetzt mal ein Bild. Oh. Not acceptable. Warum nicht? Moment."}, {"id": 490, "start": 6913.0, "end": 6924.0, "text": "Ach so. Ja, weil das das falsche Format ist, in dem ich das schicke."}, {"id": 491, "start": 6924.0, "end": 6951.0, "text": "Wir haben Leute vor Google programmiert. Sehr viel langsamer. Sehr viel langsamer und für jeden Scheiß das Rad neu erfinden. Arbeitest du mit ASP.NET? Ja, das ist ASP.NET Core 2.1? 2.0? Ich glaube 2.0."}, {"id": 492, "start": 6951.0, "end": 6959.0, "text": "Es ist ja auch klar, dass das nicht funktioniert, weil das Format nicht stimmt, in dem ich das schicke. Das Format ist fail. Ich kann nicht einfach die Files da dran hängen."}, {"id": 493, "start": 6959.0, "end": 6987.0, "text": "Da muss ich, siehste? Google. Upload. Files. JavaScript. I form data. Ok. Form data. Das heißt ich, achja gut, ich hängs aktuell einfach nur als dieses komische File Objekt dran, was ich kriege. Ich muss das als Form data posten. Also quasi wie, wenn ich das in so einem File select Dialog drin hätte."}, {"id": 494, "start": 6987.0, "end": 7012.0, "text": "Ja. Form data append. Append. Append user file. File input elements file. Input. Ok, wir haben aber kein Input. Aber wir haben eine Files Liste. Das machen wir jetzt einfach mal so. Wir machen das so. Jetzt wird einfach mal ganz eiskalt wieder copy pasted."}, {"id": 495, "start": 7012.0, "end": 7040.0, "text": "So. Files. Also Form data. Eine Schleife über das ganze. File. Nein. File. Of files. Und dann sagen wir Form data append. File."}, {"id": 496, "start": 7040.0, "end": 7053.0, "text": "Und jetzt gucken wir, ob das Scheiß funktioniert. Ups. Was hab ich jetzt gemacht? Ah, ich hab F5 gedrückt. Das war keine gute Idee."}, {"id": 497, "start": 7053.0, "end": 7082.0, "text": "Wie wurde eigentlich der erste Compiler kompiliert? Gar nicht. Achso. File. Files. Irgendwie so. Files. Ja. Ja. Ja. Ob das jetzt klappt. Ich bin skeptisch."}, {"id": 498, "start": 7082.0, "end": 7108.0, "text": "Fuck. Ha. Ah, Moment. Vielleicht soll ich auch das Richtige pasten. No happy meal, mein. So. Not acceptable."}, {"id": 499, "start": 7108.0, "end": 7133.0, "text": "Ha. Was mach ich denn jetzt falsch? Was mach ich jetzt falsch?"}, {"id": 500, "start": 7133.0, "end": 7148.0, "text": "Hm. Warum klappt das jetzt nicht? Was mach ich denn falsch?"}, {"id": 501, "start": 7148.0, "end": 7173.0, "text": "Hm. Happy upload. Ist in meinem Controller irgendwas falsch?"}, {"id": 502, "start": 7173.0, "end": 7189.0, "text": "Ah. Muss das da hin? Mit oder ohne Slash? Ah, bin ich mir nicht so sicher."}, {"id": 503, "start": 7189.0, "end": 7206.0, "text": "Okay. Probieren wir es nochmal aus, ob ich mich da vielleicht irgendwie verschrieben hab. Aus Versehen. Ach. Fuck. Was ist denn das Problem jetzt, Alter? Wo ist das Problem?"}, {"id": 504, "start": 7206.0, "end": 7222.0, "text": "Was? Warum spackt es denn jetzt rum? Was mach ich denn falsch hier? File upload. Ha."}, {"id": 505, "start": 7222.0, "end": 7241.0, "text": "Hm."}, {"id": 506, "start": 7241.0, "end": 7255.0, "text": "Was ist daran denn jetzt bitteschön falsch?"}, {"id": 507, "start": 7255.0, "end": 7284.0, "text": "Was? Was ist daran jetzt verkehrt?"}, {"id": 508, "start": 7284.0, "end": 7293.0, "text": "Not acceptable. Hab ich irgendwie zu viel Zeug deaktiviert oder was?"}, {"id": 509, "start": 7293.0, "end": 7320.0, "text": "Schauen wir mal. Schalten wir alles an."}, {"id": 510, "start": 7320.0, "end": 7328.0, "text": "Ha. Ich hab irgendwas war nicht aktiviert, was aktiviert sein musste. Okay. Was auch immer. Was auch immer. Sehr, sehr nice."}, {"id": 511, "start": 7328.0, "end": 7351.0, "text": "Okay. Das funktioniert. Das funktioniert. Also das Upload funktioniert. Jetzt müssen wir nur noch gucken, wie ich auf Serverseite dieses Bild irgendwie speichere. Funktioniert. Sehr, sehr nice."}, {"id": 512, "start": 7351.0, "end": 7368.0, "text": "Okay."}, {"id": 513, "start": 7368.0, "end": 7384.0, "text": "Okay."}, {"id": 514, "start": 7384.0, "end": 7404.0, "text": "Aber der Upload klappt. So, jetzt muss ich nur noch gucken, wie man das Bild irgendwie speichert. So, das Result brauchen wir nicht."}, {"id": 515, "start": 7404.0, "end": 7418.0, "text": "Okay, dann speichern wir den Kram jetzt mal. Ach nee, wir müssen auch noch hier eine Sache einbauen und zwar, dass wir nur."}, {"id": 516, "start": 7418.0, "end": 7433.0, "text": "Wir akzeptieren nur Images. Richtig. Wir akzeptieren nur Images. Und das müssen wir Serverseitig und Kleinseitig machen, weil ich mein, Kleinseitig kann jeder, jeder machen, was er will."}, {"id": 517, "start": 7433.0, "end": 7438.0, "text": "Beziehungsweise."}, {"id": 518, "start": 7438.0, "end": 7447.0, "text": "Eigentlich können wir drauf scheißen, wir machen das nur Serverseitig. Wenn irgendwie einer so doof ist und lädt da Scheiße hoch, dann nehmen wir es einfach Serverseitig nicht an."}, {"id": 519, "start": 7447.0, "end": 7463.0, "text": "So, also for each, File in Files, File Type, Content Type. So, Content Type ist dann wahrscheinlich so was wie Image slash PNG und sowas."}, {"id": 520, "start": 7463.0, "end": 7478.0, "text": "Startet muss starten mit Image. Ansonsten wollen wir es gar nicht."}, {"id": 521, "start": 7478.0, "end": 7496.0, "text": "Das machen wir hier mit Link, dann ist das viel schöner. Select, F, Content Type starts with Image."}, {"id": 522, "start": 7496.0, "end": 7515.0, "text": "Das heißt, wir nehmen jetzt nur die Bilder, die auch mit Image starten. Und nu."}, {"id": 523, "start": 7515.0, "end": 7526.0, "text": "So, und nun speichern wir das irgendwo. Also, File, was gibt es denn da alles so?"}, {"id": 524, "start": 7526.0, "end": 7553.0, "text": "Objekt. Objekt, das muss iPhone-File sein. Objekt, the fuck? Wegen dem Select oder was?"}, {"id": 525, "start": 7553.0, "end": 7568.0, "text": "Ja, wegen dem Select, was auch immer. Das War ist eigentlich nur so eine taktische Geschichte. Also guck, wenn ich über das War gehe, der weiß, dass das ein iPhone-File ist."}, {"id": 526, "start": 7568.0, "end": 7588.0, "text": "Also, so oder so ist genau das gleiche. Das ist einfach nur kürzer. Also, War ist in sich nicht wahr. Ich habe auch, ehrlich gesagt habe ich keine Ahnung. Also, War ist quasi nicht, ist quasi halt einfach nur für Variable anlegen, nicht, dass der Typ Variabel wäre."}, {"id": 527, "start": 7588.0, "end": 7602.0, "text": "Ja klar, ich kann es danach wieder casten, aber warum weiß er das nicht, dass es ein iPhone-File ist? Was soll das sonst sein? Das ist eine List auf iPhone-File. Keine Ahnung, da war mir das If drin."}, {"id": 528, "start": 7602.0, "end": 7623.0, "text": "War ist nicht wahr. Content-Type, Start, das schreiben wir jetzt gleich zum zwanzigsten Mal. Image, so. Wenn das, wenn das ein Image, wir machen das einfach so, wenn das, wenn das ein Image ist, dann..."}, {"id": 529, "start": 7623.0, "end": 7644.0, "text": "Ach, Wear, nicht Select. Ach, ja, WTF, klar, natürlich. Oh Mann. Ja, klar ist es Wear, nicht Select. Oh Mann. Das ist zu viel, zu viel Sprachen, Müschtmasch. Da blickst du aber durch."}, {"id": 530, "start": 7644.0, "end": 7659.0, "text": "Ich glaube, in Javascript ist Select, oder was, in Javascript war es Filter? Ja, genau. In C-Sharp ist War quasi einfach nur syntaktisch. Das ist immer fest."}, {"id": 531, "start": 7659.0, "end": 7678.0, "text": "Deswegen, nur mal so zu erklären, ich kann sagen War, Plup ist eins, allerdings was da nicht geht ist das hier. In Javascript wird das funktionieren, dass ich quasi erstmal sage Plup ist eins und danach ist es in String irgendwas, geht aber in C-Sharp nicht."}, {"id": 532, "start": 7678.0, "end": 7698.0, "text": "Weil, sobald das Ding einmal angelegt ist, sieht man auch hier, dass es in 32 und das ist, bis dieser Scope hier fertig ist, ist es immer in 32. Javascript ist Filter, ok. Moin Informatiker, underscore, Formatikorps."}, {"id": 533, "start": 7698.0, "end": 7715.0, "text": "Ok, also File, blablabla, Plup. So, und nun will ich das Ding einfach mal irgendwo serverseitig wo hin speichern, einfach nur damit ich weiß, ob das funktioniert mit dem Upload."}, {"id": 534, "start": 7715.0, "end": 7740.0, "text": "Copy2, oh nice, da ist schon alles eingebaut. Also ich mag ohne Scheiß die, man kann auf Microsoft viel rumhalten, aber die.NET, das ist ja nicht mal die.NET Standard Library, halt die ganzen offiziellen.NET Libraries, die sind alle super durchdacht, das macht Spaß damit rumzubasteln, das ist einfach schon alles dabei."}, {"id": 535, "start": 7740.0, "end": 7759.0, "text": "File, Copy2, ok, was jetzt hier noch fehlt ist File, Copy2 und dann da Teilnahme, da muss ich jetzt halt selbst machen, also dass ich da irgendwie sowas sage wie Using, File, Dot, File, Reader, File, File, File, Stream, ne, warte mal."}, {"id": 536, "start": 7759.0, "end": 7778.0, "text": "File, was gibt es denn File, ich weiß nicht, achso, weil es doppelt belegt ist, lull. File, File, Stream, Stream, Stream gleich, File, Stream, File, Stream müssen wir importieren, zack."}, {"id": 537, "start": 7778.0, "end": 7799.0, "text": "So und zwar File, Stream für File, File Name, ok, dann speicher das jetzt einfach im aktuellen Verzeichnis, wo es läuft, das Bild, das ist ja ok."}, {"id": 538, "start": 7799.0, "end": 7819.0, "text": "Mode, Create, ok, so und dann sage ich File, Copy2, das ist halt wirklich Eats, Stream und dann sollte, also von der Idee her sollte ich jetzt ein Bild,"}, {"id": 539, "start": 7819.0, "end": 7829.0, "text": "no happy meal for you habe ich gehört, aber hat er nicht Berufung nochmal eingelegt, dass er nicht ausgeliefert wird."}, {"id": 540, "start": 7829.0, "end": 7851.0, "text": "So also von der Idee her, ich track and drop jetzt ins Webinterface ein Bild und dann erscheint das hier."}, {"id": 541, "start": 7851.0, "end": 7878.0, "text": "Bam, easy clap, funktioniert, Bilder Upload klappt."}, {"id": 542, "start": 7878.0, "end": 7892.0, "text": "Sogar ziemlich easy, das war, also das war jetzt wirklich nicht schwer."}, {"id": 543, "start": 7892.0, "end": 7914.0, "text": "Ja, das ist geil, wie gut das funktioniert. Moin, Mango United Gaming, das war jetzt wirklich einfach, viel einfacher als ich mir das vorgestellt habe."}, {"id": 544, "start": 7914.0, "end": 7924.0, "text": "Ok, weiter im Text, also wir haben jetzt noch 40 Minuten Zeit bis Fußball losgeht, dann machen wir das mal."}, {"id": 545, "start": 7924.0, "end": 7932.0, "text": "Also wir schaffen es jetzt Bilder hochzuladen, das heißt wir wollen ja eigentlich nicht die Bilder hochladen in irgendwie ein Verzeichnis,"}, {"id": 546, "start": 7932.0, "end": 7952.0, "text": "sondern in das Memeverzeichnis, dass es dann da erscheint, das heißt ich muss jetzt erstmal mir ein Memelippo besorgen, wo ich mir den Fad hole."}, {"id": 547, "start": 7952.0, "end": 7969.0, "text": "So, das muss man noch hier injecten, dass es funktioniert. Magic, mehr muss man dazu nicht sagen, also sprich dadurch, dass ich das jetzt hier beim Anlegen von dem Server eingegeben habe,"}, {"id": 548, "start": 7969.0, "end": 7985.0, "text": "kann ich jetzt das Repo auch auf Magic Art und Weise irgendwie hier verwenden, weil Magic, so und jetzt heißt ich kopiere das Ganze jetzt in Tag, also der Fad,"}, {"id": 549, "start": 7985.0, "end": 8009.0, "text": "der Fad, wo das Bild hin muss, ist PathCombine und zwar mein Meme-Ordner, der da plus Filename von dem hochgeladenen Image und dann kopiere ich das dahin."}, {"id": 550, "start": 8009.0, "end": 8023.0, "text": "So, wenn das jetzt alles funktioniert, dann sollte jetzt folgendes passieren, ich track and drop jetzt quasi hier in den Meme rein, wenn man irgendein 20 noch nicht drinne hat,"}, {"id": 551, "start": 8023.0, "end": 8040.0, "text": "so das da zum Beispiel, ich track and drop das hier jetzt rein und dann, das müssen wir mal Vollbild machen, dass man es sieht und dann lädt er das zum Server hoch, also ich ziehe das hier rein,"}, {"id": 552, "start": 8040.0, "end": 8054.0, "text": "dann kommt das Upload auf Alley, ich lasse den Maus, ich lasse jetzt los, dann lädt das zum Server hoch und fügt es hinzu. Das hat nicht funktioniert."}, {"id": 553, "start": 8054.0, "end": 8075.0, "text": "Warum nicht? Moment, warum hat das nicht funktioniert?"}, {"id": 554, "start": 8075.0, "end": 8093.0, "text": "Warum hat das nicht funktioniert? Ah, weil ich, oh ich noob, guck mal, ich habe den Ort nicht eingetragen, der hat es jetzt wieder, guck mal, da hat es jetzt wieder in dem Verzeichnis von vorher gespeichert."}, {"id": 555, "start": 8093.0, "end": 8108.0, "text": "Ah, da ist es, da soll es ja gar nicht hin. Ja, Spatzgranate, hast du recht, das war eher Spatzbremse hier gerade, dass es nicht funktioniert."}, {"id": 556, "start": 8108.0, "end": 8125.0, "text": "So, nu aber, ok, nochmal. Warum kann, ich muss mich jetzt mal kurz über Windows nochmal auskotzen, warum kann der Windows Explorer keine Tabs?"}, {"id": 557, "start": 8125.0, "end": 8139.0, "text": "Ich meine, WTF Microsoft, warum? Guck mal, im Windows Explorer spätestens, wenn man vier so Dinger, drei so Dinger auf, du blickst nicht mehr durch, du hast keine Ahnung, warum kann dieses Scheiß Ding keine Tabs? Ich verstehe es nicht. So, easy."}, {"id": 558, "start": 8139.0, "end": 8165.0, "text": "Ha! Bam! Oh, ich habe es irgendwie kaputt gemacht. Ah, ok, das muss ich noch ausschalten, dass es nur für externe Bilder geht und nicht für eigene Bilder. Aber es hat funktioniert."}, {"id": 559, "start": 8165.0, "end": 8176.0, "text": "Wird die App dann immer über den Browser angesprochen? Ja gut, die App an sich hat ja kein User Interface. Die App an sich funktioniert ja über Shortcuts, wie die hier siehst."}, {"id": 560, "start": 8176.0, "end": 8198.0, "text": "Also, das da. Also, da hast du Shortcuts an deinem Streaming Rechner. Das Web Interface ist ja dafür gedacht, dass man das vom zweiten Rechner oder vom Smartphone oder Tablet bedienen kann. Und das ist, wenn man sich das mal überlegt, auch die einzig sinnvolle Variante, eine Oberfläche zu machen für ein Tool, was quasi im Hintergrund sein soll während dem Streamen."}, {"id": 561, "start": 8198.0, "end": 8216.0, "text": "Deswegen ist die einzige Oberfläche, die es gibt, halt Web Interface, weil es die einzig sinnvolle Sache ist an der Stelle. Aber man hat gesehen, Track & Drop funktioniert sehr nice."}, {"id": 562, "start": 8216.0, "end": 8237.0, "text": "Ja, Stream Deck Integration machen wir noch. Allerdings ist meins, finde ich, ich finde mein Tool ist besser in einem Punkt als Stream Deck, deutlich besser. Und zwar der Streamer sieht selbst, was er anzeigt. Und das ist der hauptsächliche Grund, warum ich das Ganze überhaupt programmiert habe."}, {"id": 563, "start": 8237.0, "end": 8252.0, "text": "Das Problem nämlich mit Shortcuts in OBS und Stream Deck und sowas ist, das ist quasi per OBS Plugin. Also, der rendert das in OBS rein, aber du selbst siehst es nicht. Das heißt, wenn ich jetzt einen Shortcut habe im OBS und blende das hier ein."}, {"id": 564, "start": 8252.0, "end": 8270.0, "text": "Ich blende irgendwas ein in OBS über einen Shortcut. Dann lasse ich es eine halbe Stunde eingeblendet, weil ich es selbst nicht sehe. Und außerdem haben wir ja noch super Features wie Kogas schnell und Kogas langsam. Das ist witzig, weil ich habe ja eingebaut, dass man Bilder drehen kann und sowas."}, {"id": 565, "start": 8270.0, "end": 8287.0, "text": "Und wenn man jetzt einen lustigen Effekt ergibt, wenn man hier Lull Shake macht. Wenn der Streamer das nicht selbst sehen will, dann würde ich das nicht verwenden. Aber das war ja gerade auch die Aufhängung bei mir. Ich wollte es ja gerade sehen."}, {"id": 566, "start": 8287.0, "end": 8305.0, "text": "Ja, ein X-Button zum entfernen braucht auch noch Max. Das ist richtig. Das können wir jetzt eigentlich auch noch machen. Das probieren wir jetzt mal aus, ob wir das noch hinkriegen. Nee, nee, nee, machen wir nicht. Wir müssen unsere krassen Animationen hier oben noch machen, während Upload ist."}, {"id": 567, "start": 8305.0, "end": 8319.0, "text": "Das witzige ist, dass man jetzt quasi Kogas, weil es sich ja schon dreht, wenn ich die Drehanimation mache, dreht sich schneller. Hyper Kogas ist das dann."}, {"id": 568, "start": 8319.0, "end": 8346.0, "text": "Guck, das hier, das ist normal Kogas. Das ist Hyper Kogas. Kannst du aber, was, kannst du ja aber eigentlich noch einbinden? Rendern für eine Videoquelle, aber nicht für einen selbst. Was meinst du?"}, {"id": 569, "start": 8346.0, "end": 8357.0, "text": "Das verstehe ich jetzt nicht. Was, Rendern für eine Videoquelle, aber nicht für einen selbst?"}, {"id": 570, "start": 8357.0, "end": 8379.0, "text": "Du meinst, dass man das dann nur ins OBS rein kriegt? Na gut, aber wenn ich es doch nur im OBS machen will, dann kann ich ja auch OBS Shortcuts verwenden. Und das ins OBS rein zu kriegen, ist ein größerer Akt, da müsste man... Nee, das geht nicht."}, {"id": 571, "start": 8379.0, "end": 8393.0, "text": "Weil aktuell seht ihr es ja im Stream, weil OBS mein Screen crappt."}, {"id": 572, "start": 8393.0, "end": 8412.0, "text": "OBS crappt den Stream. Also mein Screen und deswegen sieht man es ja. Ich muss es selbst sehen, dass OBS das auch sieht."}, {"id": 573, "start": 8412.0, "end": 8430.0, "text": "Wenn ich das nur in OBS... Man kann es allerdings auch nicht mit Fullscreen crappt machen, weil man sieht es ja hier. Das Programm hat ja hier ein Hauptfenster, sprich das kann ich auch mit OBS crappen, wenn ich es haben will."}, {"id": 574, "start": 8430.0, "end": 8448.0, "text": "Aber das nur ins OBS reinrendern ist ziemlich kompliziert. Das müsste man dann mit irgendeinem OBS Plugin oder sowas machen. Nee, das übersteigt meine OBS Skills."}, {"id": 575, "start": 8448.0, "end": 8464.0, "text": "Ist es nicht möglich per Browser Source in OBS das einfach auf einer Seite anzeigen zu lassen? Das ist eine gute Idee, doch..."}, {"id": 576, "start": 8464.0, "end": 8479.0, "text": "Das mit Browser Source ist eine... Das mit Browser Source ist eine gute Idee. Geht das dann auch bei Game Stream? Das geht bei allem."}, {"id": 577, "start": 8479.0, "end": 8487.0, "text": "Das geht bei allem was dein Bildschirm aufnimmt. Das hat nichts mit OBS oder so zu tun. Weil du siehst es ja selbst und weil du es selbst siehst kannst du mit allem aufnehmen."}, {"id": 578, "start": 8487.0, "end": 8502.0, "text": "Aber das mit Browser Source finde ich jetzt eine gute Idee. Das könnte man noch einbauen, dass der quasi das ausgibt auf irgendeiner Seite oder so."}, {"id": 579, "start": 8502.0, "end": 8513.0, "text": "Ja, das geht. Dass man beispielsweise hier noch so ein Output tappt. Das könnte man machen. Mit Browser Source könnte funktionieren."}, {"id": 580, "start": 8513.0, "end": 8524.0, "text": "So, aber jetzt müssen wir noch unser Rädchen hier oben zum Spinnen kriegen. Wenn der Upload läuft. Echt mal guck mal, das ist doch keine Usability hier Windows."}, {"id": 581, "start": 8524.0, "end": 8530.0, "text": "Da blickst du doch nicht durch. Windows. Zu Windows kann ich nur sagen..."}, {"id": 582, "start": 8530.0, "end": 8549.0, "text": "Omega Little. Omega Little. Omega Little."}, {"id": 583, "start": 8549.0, "end": 8558.0, "text": "Fidget Spinner als Settings Symbol. Wenn du denn den Emoji Fidget Spinner hast, dann geht das."}, {"id": 584, "start": 8558.0, "end": 8570.0, "text": "Ok, Track and Drop funktioniert. Sehr schön."}, {"id": 585, "start": 8570.0, "end": 8592.0, "text": "Black Dare. Doch, du musst einfach beides Captchern. Also entweder captcherst du deinen kompletten Monitor. Dann ist natürlich immer drauf. Oder du stellst dem OBS halt ein, dass du quasi dein Bild, dass du dein Game captcherst."}, {"id": 586, "start": 8592.0, "end": 8600.0, "text": "Plus jetzt halt zum Beispiel. Kannst doch hier sagen..."}, {"id": 587, "start": 8600.0, "end": 8605.0, "text": "Irgendwie Window Capture. Wo geht denn das Scheiß hier?"}, {"id": 588, "start": 8605.0, "end": 8612.0, "text": "Window Capture."}, {"id": 589, "start": 8612.0, "end": 8616.0, "text": "Ok, dann muss ich Game Capture machen. Irgendwie."}, {"id": 590, "start": 8616.0, "end": 8622.0, "text": "Also es funktioniert prinzipiell. Du musst dann einfach im OBS einstellen, dass du das Fenster auch noch captcherst."}, {"id": 591, "start": 8622.0, "end": 8627.0, "text": "Wenn man es richtig macht."}, {"id": 592, "start": 8627.0, "end": 8642.0, "text": "Wobei ich mich frage, warum das das nicht Captchern kann."}, {"id": 593, "start": 8642.0, "end": 8654.0, "text": "Also mir ist nicht ganz klar, warum sich das jetzt nicht Captchern lässt. Es müsste sich eigentlich ohne Probleme Captchern lassen. Aber von der Idee her funktioniert das."}, {"id": 594, "start": 8654.0, "end": 8658.0, "text": "Warum lässt es sich denn nicht Captchern?"}, {"id": 595, "start": 8658.0, "end": 8660.0, "text": "Hä?"}, {"id": 596, "start": 8660.0, "end": 8666.0, "text": "Achso."}, {"id": 597, "start": 8666.0, "end": 8668.0, "text": "Ja, wahrscheinlich weil ich das..."}, {"id": 598, "start": 8668.0, "end": 8669.0, "text": "Hä?"}, {"id": 599, "start": 8669.0, "end": 8676.0, "text": "Also ich weiß ehrlich gesagt nicht, warum sich das gerade nicht Captchern lässt. Bin ich überfragt."}, {"id": 600, "start": 8676.0, "end": 8686.0, "text": "Aber von der Idee her sollte sich das in OBS auch Captchern lassen. Dann kannst du beides Captchern und gut ist."}, {"id": 601, "start": 8686.0, "end": 8689.0, "text": "Muss ich mal gucken, warum das OBS nicht Captchern kann."}, {"id": 602, "start": 8689.0, "end": 8705.0, "text": "Da machst du nämlich einfach Window, Window Captcher und musst es halt nochmal ein Overlay im OBS machen. Ich bin jetzt aber echt..."}, {"id": 603, "start": 8705.0, "end": 8710.0, "text": "Ich hab keine Ahnung, warum das denn funktioniert."}, {"id": 604, "start": 8710.0, "end": 8720.0, "text": "Ich bin jetzt echt überfragt, warum das das hier nicht Captchert. Keine Ahnung."}, {"id": 605, "start": 8720.0, "end": 8732.0, "text": "Ist auch egal. Ich hab eh immer Full Display. Und das muss ich mir mal angucken, warum es das nicht Captchert."}, {"id": 606, "start": 8732.0, "end": 8745.0, "text": "Alter, es gibt einen Fidget Spinner Emoji. Allen Ernstes, ja? Ist das wirklich jetzt... Ach du Scheiße. Warum?"}, {"id": 607, "start": 8745.0, "end": 8754.0, "text": "Also von allen Emojis diese... Aber sieht kacke aus, guck mal. Sieht scheiße aus. Fidget Spinner Emoji."}, {"id": 608, "start": 8754.0, "end": 8765.0, "text": "Das sieht des Kogas doch besser aus."}, {"id": 609, "start": 8765.0, "end": 8770.0, "text": "Ja, Promise. Ich hab es aber gerade angezeigt. Aber wie gesagt, keine Ahnung, warum das nicht funktioniert."}, {"id": 610, "start": 8770.0, "end": 8774.0, "text": "Das muss ich mal ausprobieren. Vielleicht muss man OBS auch nochmal neu starten, nachdem man das Programm gestartet hat."}, {"id": 611, "start": 8774.0, "end": 8783.0, "text": "Oder irgendwie sowas. Aber es müsste gehen, weil es ist prinzipiell ein ganz normales Fenster, wie jedes andere Fenster auch."}, {"id": 612, "start": 8783.0, "end": 8791.0, "text": "NvEng ist doch voll der schlechte Codierer. Mit gleicher Bitrate sieht NvEng schlechter aus."}, {"id": 613, "start": 8791.0, "end": 8796.0, "text": "Aber es macht halt keine Last auf dem System, was dann wieder ganz gut ist."}, {"id": 614, "start": 8796.0, "end": 8802.0, "text": "Und mittlerweile kann man ja auf Twitch mit ein bisschen höherer Bitrate streamen. Da geht das eigentlich schon."}, {"id": 615, "start": 8802.0, "end": 8808.0, "text": "Moin, xAzerbaidscher an."}, {"id": 616, "start": 8808.0, "end": 8813.0, "text": "So, wir wollten das spinnen lassen, wenn Upload an ist."}, {"id": 617, "start": 8813.0, "end": 8816.0, "text": "Das müssen wir jetzt noch machen."}, {"id": 618, "start": 8816.0, "end": 8819.0, "text": "Wir haben noch eine halbe Stunde Zeit."}, {"id": 619, "start": 8819.0, "end": 8824.0, "text": "Also, Drag Over."}, {"id": 620, "start": 8824.0, "end": 8827.0, "text": "Also wir brauchen noch eine neue Variable."}, {"id": 621, "start": 8827.0, "end": 8832.0, "text": "Drag Active. Wir müssen sowas wie Is Uploading oder sowas machen."}, {"id": 622, "start": 8832.0, "end": 8840.0, "text": "False. Is Uploading."}, {"id": 623, "start": 8840.0, "end": 8851.0, "text": "So, und wenn Is Uploading, dann wollen wir sowas hier machen."}, {"id": 624, "start": 8851.0, "end": 8866.0, "text": "Wenn das hoch lädt, dann setzen wir hier unser Kogas Class."}, {"id": 625, "start": 8866.0, "end": 8872.0, "text": "So, und von der Idee her, wenn Is Uploaded, soll sich das drehen."}, {"id": 626, "start": 8872.0, "end": 8875.0, "text": "Funktioniert. Also, Ich hab's jetzt mal negiert."}, {"id": 627, "start": 8875.0, "end": 8881.0, "text": "Also wenn Is Uploaded, das heißt, das muss ich jetzt hier drinnen noch setzen."}, {"id": 628, "start": 8881.0, "end": 8884.0, "text": "Das finde ich an View geil. Das ist mega einfach."}, {"id": 629, "start": 8884.0, "end": 8891.0, "text": "Wie gesagt, ich hab mir ein paar Tutorials angeguckt und flutscht."}, {"id": 630, "start": 8891.0, "end": 8905.0, "text": "So, im Prinzip sag ich hier einfach, also sag ich hier davor schon, sag ich hier, Is Uploading."}, {"id": 631, "start": 8905.0, "end": 8916.0, "text": "Und wenn das fertig ist, so."}, {"id": 632, "start": 8916.0, "end": 8928.0, "text": "So, und von der Idee her, wenn Ich jetzt was hochlade, sollte sich das drehen."}, {"id": 633, "start": 8928.0, "end": 8936.0, "text": "Probieren wir mal aus."}, {"id": 634, "start": 8936.0, "end": 8948.0, "text": "Ja, habt ihr's gesehen?"}, {"id": 635, "start": 8948.0, "end": 8966.0, "text": "Warum geht das jetzt nicht nochmal?"}, {"id": 636, "start": 8966.0, "end": 8975.0, "text": "Ach doch, der ist nur einfach zu schnell."}, {"id": 637, "start": 8975.0, "end": 8979.0, "text": "Ja guck, wenn ich mehr hochlade, dann geht's auch."}, {"id": 638, "start": 8979.0, "end": 8981.0, "text": "Seht ihr's?"}, {"id": 639, "start": 8981.0, "end": 8994.0, "text": "Also wenn wir da jetzt was Großes hochladen würden, dann geht das."}, {"id": 640, "start": 8994.0, "end": 8997.0, "text": "Ich mein, es sieht ganz schön räudig aus, wie das humpelt, ja."}, {"id": 641, "start": 8997.0, "end": 9000.0, "text": "Haben wir hier irgendwas Größeres, was ich hochladen kann?"}, {"id": 642, "start": 9000.0, "end": 9003.0, "text": "Ich werf's ja Server-seitig eh weg."}, {"id": 643, "start": 9003.0, "end": 9008.0, "text": "Ah, ich guck nochmal, werf ich Server-seitig weg?"}, {"id": 644, "start": 9008.0, "end": 9011.0, "text": "Ja, genau, ich werf Server-seitig weg."}, {"id": 645, "start": 9011.0, "end": 9016.0, "text": "Haben wir noch ein bisschen was Größeres hier, was ich uploaden kann?"}, {"id": 646, "start": 9016.0, "end": 9021.0, "text": "Aufnahme zu Meltdown, Aufnahme zu Antivirus, ja."}, {"id": 647, "start": 9021.0, "end": 9026.0, "text": "Ja guck, das lädt ein bisschen länger hoch."}, {"id": 648, "start": 9026.0, "end": 9041.0, "text": "Der hat gesagt, gibt's nicht, mach ich nicht."}, {"id": 649, "start": 9041.0, "end": 9045.0, "text": "Und der hat's halt gecasht, der Browser, deswegen geht das jetzt so schnell."}, {"id": 650, "start": 9045.0, "end": 9050.0, "text": "Aber es funktioniert, wir können das übrigens ganz einfach simulieren,"}, {"id": 651, "start": 9050.0, "end": 9058.0, "text": "wenn der Upload etwas länger dauert."}, {"id": 652, "start": 9058.0, "end": 9073.0, "text": "Können wir einfach simulieren?"}, {"id": 653, "start": 9073.0, "end": 9079.0, "text": "Ach Quatsch, wir simulieren jetzt einfach mal, wenn's wieder etwas länger dauert."}, {"id": 654, "start": 9079.0, "end": 9093.0, "text": "Der Upload dauert jetzt 5 Sekunden auf Server-Seite."}, {"id": 655, "start": 9093.0, "end": 9118.0, "text": "Guckt, solang der Upload läuft, Coggarts vor sich hin."}, {"id": 656, "start": 9118.0, "end": 9124.0, "text": "Der ist sehr nice, ich bin begeistert."}, {"id": 657, "start": 9124.0, "end": 9127.0, "text": "Oder in DevTools einstellen, ja, aber so ging's jetzt auch."}, {"id": 658, "start": 9127.0, "end": 9132.0, "text": "Man hat ja gesehen, dass das prinzipiell geht."}, {"id": 659, "start": 9132.0, "end": 9141.0, "text": "Was mir natürlich nicht gefällt, ist, dass es so eiert."}, {"id": 660, "start": 9141.0, "end": 9153.0, "text": "Ich mach jetzt das Fidget Spinner Emoji."}, {"id": 661, "start": 9153.0, "end": 9155.0, "text": "Fidget Spinner."}, {"id": 662, "start": 9155.0, "end": 9165.0, "text": "So, und wir stellen jetzt mal ein, dass das immer rotiert, auch ohne Upload."}, {"id": 663, "start": 9165.0, "end": 9172.0, "text": "Das sieht so richtig kacke aus."}, {"id": 664, "start": 9172.0, "end": 9174.0, "text": "So, da waren wir die."}, {"id": 665, "start": 9174.0, "end": 9178.0, "text": "Wir müssen jetzt eh gleich Schluss machen, weil hier klein 17 Uhr ist."}, {"id": 666, "start": 9178.0, "end": 9198.0, "text": "Das Poise machen wir noch ein bisschen fancy."}, {"id": 667, "start": 9198.0, "end": 9204.0, "text": "Das sieht übelst kacke aus."}, {"id": 668, "start": 9204.0, "end": 9211.0, "text": "Das sieht übelst kacke aus, der Fidget Spinner."}, {"id": 669, "start": 9211.0, "end": 9226.0, "text": "Und so ganz rund ist der auch nicht, oder?"}, {"id": 670, "start": 9226.0, "end": 9238.0, "text": "Da bleib ich lieber mal hier bei meinem Coggarts, auch wenn das irgendwie ein bisschen humpelt."}, {"id": 671, "start": 9238.0, "end": 9240.0, "text": "Ja, dann ist da noch was."}, {"id": 672, "start": 9240.0, "end": 9243.0, "text": "Wie kriege ich denn den Button da jetzt irgendwie rüber?"}, {"id": 673, "start": 9243.0, "end": 9245.0, "text": "Wir machen das jetzt noch ein bisschen hübscher."}, {"id": 674, "start": 9245.0, "end": 9253.0, "text": "Wie kriege ich denn den Button da irgendwie rüber jetzt?"}, {"id": 675, "start": 9253.0, "end": 9265.0, "text": "Dann machen wir noch mal ein eigenes Diff drum."}, {"id": 676, "start": 9265.0, "end": 9269.0, "text": "Ha, nice."}, {"id": 677, "start": 9269.0, "end": 9272.0, "text": "Jetzt hängt es aneinander."}, {"id": 678, "start": 9272.0, "end": 9286.0, "text": "Da machen wir jetzt noch ein Padding dabei und Margin auf der rechten Seite, den Button."}, {"id": 679, "start": 9286.0, "end": 9292.0, "text": "15 Pixel, ja."}, {"id": 680, "start": 9292.0, "end": 9294.0, "text": "Ist doch ganz nice."}, {"id": 681, "start": 9294.0, "end": 9301.0, "text": "Kann mir mal jemand erklären, warum die Buttons jetzt vertauscht sind?"}, {"id": 682, "start": 9301.0, "end": 9312.0, "text": "Warum sind die jetzt vertauscht die Buttons, nur weil ich einen Diff drum gemacht habe?"}, {"id": 683, "start": 9312.0, "end": 9315.0, "text": "Ach so."}, {"id": 684, "start": 9315.0, "end": 9321.0, "text": "Deswegen, ja."}, {"id": 685, "start": 9321.0, "end": 9322.0, "text": "Transform Origin Property."}, {"id": 686, "start": 9322.0, "end": 9327.0, "text": "Ja, sowas in der Richtung haben wir vorhin schon probiert, dass wir hier irgendwie noch"}, {"id": 687, "start": 9327.0, "end": 9331.0, "text": "irgendwie Translate oder irgendwie sowas gemacht haben."}, {"id": 688, "start": 9331.0, "end": 9340.0, "text": "Oder wie wird das jetzt?"}, {"id": 689, "start": 9340.0, "end": 9349.0, "text": "Ja, irgendwie sowas haben wir vorhin schon ausprobiert, aber ja."}, {"id": 690, "start": 9349.0, "end": 9362.0, "text": "Das ist eklig."}, {"id": 691, "start": 9362.0, "end": 9363.0, "text": "Was macht denn Translate 3D?"}, {"id": 692, "start": 9363.0, "end": 9364.0, "text": "Keine Ahnung."}, {"id": 693, "start": 9364.0, "end": 9371.0, "text": "Aber das sieht doch, ich meine, man muss sagen, ich meine, ihr erinnert euch vielleicht"}, {"id": 694, "start": 9371.0, "end": 9379.0, "text": "auch daran, wie räudig der erste Versuch vom Web-Interface ausgesehen hat."}, {"id": 695, "start": 9379.0, "end": 9381.0, "text": "Vielleicht macht jemand einen Pull-Request."}, {"id": 696, "start": 9381.0, "end": 9382.0, "text": "Ja, genau, stimmt."}, {"id": 697, "start": 9382.0, "end": 9390.0, "text": "Also Leute, wenn ihr da gute Ideen für habt oder noch ein paar Sachen einbauen wollt,"}, {"id": 698, "start": 9390.0, "end": 9392.0, "text": "also Pull-Requests sind immer willkommen."}, {"id": 699, "start": 9392.0, "end": 9395.0, "text": "Ich habe hier auch noch ein paar auf, die sind leider schon ein bisschen älter, beziehen"}, {"id": 700, "start": 9395.0, "end": 9405.0, "text": "sich aber auf das quasi dieses unsichtbare WPF-Fenster, wo man Rotationen sowas so einstellen"}, {"id": 701, "start": 9405.0, "end": 9406.0, "text": "kann."}, {"id": 702, "start": 9406.0, "end": 9409.0, "text": "Das heißt, das stand jetzt noch nicht auf dem Programm in letzter Zeit, dass ich daran"}, {"id": 703, "start": 9409.0, "end": 9410.0, "text": "weiter gebastelt habe."}, {"id": 704, "start": 9410.0, "end": 9415.0, "text": "Aber wenn ihr da noch was habt, ihr könnt gerne alle Pull-Requests aufmachen, die ihr"}, {"id": 705, "start": 9415.0, "end": 9416.0, "text": "wollt."}, {"id": 706, "start": 9416.0, "end": 9418.0, "text": "Wir haben auch ein paar gemercht letztens schon."}, {"id": 707, "start": 9418.0, "end": 9429.0, "text": "Aber hier vom Auskern Fuchs das letzte Mal, genau, vom Max hier, der sich die Buttons hier"}, {"id": 708, "start": 9429.0, "end": 9430.0, "text": "ausgedacht hat."}, {"id": 709, "start": 9430.0, "end": 9444.0, "text": "Aber ich muss sagen, es ist doch echt schick geworden."}, {"id": 710, "start": 9444.0, "end": 9449.0, "text": "Jetzt kann man hier oben suchen, sucht man nach POG, findet man die beiden Dinger, ist"}, {"id": 711, "start": 9449.0, "end": 9450.0, "text": "ja ganz logisch."}, {"id": 712, "start": 9450.0, "end": 9454.0, "text": "Drückt man Enter, zeigt er das erste an."}, {"id": 713, "start": 9454.0, "end": 9460.0, "text": "Das ist übrigens doof, dass der jetzt das Diff so breit macht."}, {"id": 714, "start": 9460.0, "end": 9464.0, "text": "Der macht das Diff so breit, weil wir super responsive sind."}, {"id": 715, "start": 9464.0, "end": 9468.2, "text": "Wobei eigentlich finde ich gar nicht so schlecht, dass er das komplett anzeigt."}, {"id": 716, "start": 9468.2, "end": 9482.76, "text": "Monka Shake können wir hier auch simulieren."}, {"id": 717, "start": 9482.76, "end": 9496.6, "text": "Sieht man das eigentlich im Webinterface, sieht man das im Stream richtig?"}, {"id": 718, "start": 9496.6, "end": 9498.6, "text": "Warte mal, das muss ich mir jetzt mal angucken, Leute."}, {"id": 719, "start": 9498.6, "end": 9501.6, "text": "Ich muss mir jetzt mal meinen eigenen Stream angucken."}, {"id": 720, "start": 9501.6, "end": 9512.6, "text": "So, sieht man das?"}, {"id": 721, "start": 9512.6, "end": 9525.6, "text": "Ja, man sieht das, Monka Shake."}, {"id": 722, "start": 9525.6, "end": 9537.6, "text": "Ja, übrigens, der Sebaro hat ein Archiv gebaut."}, {"id": 723, "start": 9537.6, "end": 9549.6, "text": "Äh, nee, der Sebaro hat ein Archiv gebaut, das heißt, falls ihr irgendwas gesehen habt,"}, {"id": 724, "start": 9549.6, "end": 9554.12, "text": "mal in einem älteren Stream und es ist auf Twitch nicht mehr da, weil Twitch löscht"}, {"id": 725, "start": 9554.12, "end": 9555.6, "text": "es ja nach einer Zeit."}, {"id": 726, "start": 9555.6, "end": 9562.6, "text": "Und wenn die Seite dann eben mal fertig geladen ist, es gibt maxfps.tv und es gibt wubblos.tv,"}, {"id": 727, "start": 9562.6, "end": 9565.6, "text": "kann man hier im Archiv gucken, hat der Sebaro gebaut."}, {"id": 728, "start": 9565.6, "end": 9571.6, "text": "Das sind alle Streams seit September dabei."}, {"id": 729, "start": 9571.6, "end": 9599.6, "text": "So, das nächste, was wir machen, ist, dass wir jetzt noch ein kleines Video machen, das"}, {"id": 730, "start": 9599.6, "end": 9609.2, "text": "ist, also im nächsten Stream, wahrscheinlich morgen, weil es wird mal Zeit, wir stellen"}, {"id": 731, "start": 9609.2, "end": 9610.2, "text": "das um."}, {"id": 732, "start": 9610.2, "end": 9615.84, "text": "Und das ist das einzige, was ich noch machen will, bevor ich quasi so mal die erste Version"}, {"id": 733, "start": 9615.84, "end": 9622.44, "text": "von dem Ding hochlade, die jeder benutzen kann, also die erste nicht-ultra-alpha-test-Version,"}, {"id": 734, "start": 9622.44, "end": 9635.08, "text": "und zwar, ich will das Umstellen von einem Ordner, wo alles drin ist, auf einen Ordner"}, {"id": 735, "start": 9635.08, "end": 9640.6, "text": "plus eine Lightdb, wo man dann auch ein paar Sachen drin speichern kann, weil aktuell ist"}, {"id": 736, "start": 9640.6, "end": 9646.04, "text": "es ja so, ich habe keine Möglichkeit, irgendwo Settings zu speichern, also den Shortcut kann"}, {"id": 737, "start": 9646.04, "end": 9652.8, "text": "ich hier quasi mit diesem komischen Hack, quasi Shortcut-Dateinahme reinbauen."}, {"id": 738, "start": 9652.8, "end": 9662.56, "text": "Ein Auto-Updater, Max, das machen wir auch noch, stimmt, stimmt, die zwei Sachen, stimmt,"}, {"id": 739, "start": 9662.56, "end": 9664.84, "text": "muss ich mal kleiner aufschreiben, weil die zwei Sachen, da weiß ich auch schon, wie"}, {"id": 740, "start": 9664.84, "end": 9665.84, "text": "wir das machen."}, {"id": 741, "start": 9665.84, "end": 9673.64, "text": "Also ein Auto-Updater braucht es nicht, es braucht einen Updater, mal gucken, also sprich,"}, {"id": 742, "start": 9673.64, "end": 9677.24, "text": "wir sind ja unter Windows, da wird ja alles runtergeladen und von Hand installiert, das"}, {"id": 743, "start": 9677.24, "end": 9680.72, "text": "heißt, wir brauchen einen Updater, ich mache es einfach so, dass das Ding nachguckt, ob"}, {"id": 744, "start": 9680.72, "end": 9685.36, "text": "es eine neue Version gibt, und dann sagt es hier, hallo, neue Version ist verfügbar,"}, {"id": 745, "start": 9685.36, "end": 9690.72, "text": "das ist dann relativ simpel, so und wir stellen das um von eben nur diesem Ordner, wo die"}, {"id": 746, "start": 9690.72, "end": 9701.76, "text": "Bilder drin liegen, auf eine Lightdb mit, ja, wo man dann sich ein paar Sachen drin merken"}, {"id": 747, "start": 9701.76, "end": 9706.04, "text": "kann, zum Beispiel, dass man dann, wenn man mal genommen hat, hat es da 50 Bilder drin"}, {"id": 748, "start": 9706.04, "end": 9709.48, "text": "und man möchte ein paar favorisieren, dass die immer oben stehen und sowas, ich habe"}, {"id": 749, "start": 9709.48, "end": 9714.44, "text": "aktuell keine Möglichkeit, irgendwo zusätzliche Infos zu speichern, oder Settings, dass ich"}, {"id": 750, "start": 9714.44, "end": 9721.28, "text": "nicht Ctrl-B haben will für das Bild, sondern vielleicht Alt-B oder so, ich habe keine Möglichkeit,"}, {"id": 751, "start": 9721.28, "end": 9725.08, "text": "Settings zu speichern, das heißt, da machen wir noch eine Lightdb drunter, die Bilder bleiben"}, {"id": 752, "start": 9725.08, "end": 9728.92, "text": "weiterhin im File-System liegen, weil die machen wir garantiert nicht in die Datenbank"}, {"id": 753, "start": 9728.92, "end": 9738.0, "text": "rein, und das mache ich noch, und dann hauen wir die erste Version raus hier, vielleicht"}, {"id": 754, "start": 9738.0, "end": 9746.68, "text": "morgen schon, mal gucken, wann kann das jeder verwenden, das ist halt ein Tool, was aus"}, {"id": 755, "start": 9746.68, "end": 9754.72, "text": "dem, was ich brauche für ein Stream, entstanden ist, und ihr habt ja quasi alles mitverfolgt,"}, {"id": 756, "start": 9754.72, "end": 9764.16, "text": "von Anfang an, konntet ihr das ja quasi mitverfolgen, wie das entstanden ist, dieses Tool, und was"}, {"id": 757, "start": 9764.16, "end": 9767.88, "text": "ist so eine Frage jetzt, für die, die seit Anfang an dabei sind, die ersten Sachen,"}, {"id": 758, "start": 9767.88, "end": 9772.92, "text": "wo ich rumgewurstet habe hier, das ist schon ganz gut geworden mittlerweile, von den ersten"}, {"id": 759, "start": 9772.92, "end": 9777.92, "text": "Anfängen, wo wir es gerade mal hingekriegt haben, irgendwie mit Fehlermeldung noch Bilder"}, {"id": 760, "start": 9777.92, "end": 9785.4, "text": "anzuzeigen, zu einem Web-Interface, wo man drinnen suchen kann, dass alles quasi Echtzeit"}, {"id": 761, "start": 9785.4, "end": 9792.24, "text": "geupdatet wird, wenn ich das anzeige, plus, dass ich sogar noch Text-to-Speech abspielen"}, {"id": 762, "start": 9792.24, "end": 9796.64, "text": "kann, und das sogar automatisch wieder deaktiviert, wenn das fertig abgespielt ist und sowas."}, {"id": 763, "start": 9796.64, "end": 9813.32, "text": "Ach ja, und dass wir Memes löschen können, das muss man auch noch einbauen, das wird"}, {"id": 764, "start": 9813.32, "end": 9819.24, "text": "aber ein bisschen schwer, ohne dass ich diese Datenbank-Geschichte eingebaut habe, weil"}, {"id": 765, "start": 9819.24, "end": 9827.24, "text": "aktuell ist es ja so, es ist entweder auf dem File-System da oder nicht, und wenn ich"}, {"id": 766, "start": 9827.24, "end": 9832.28, "text": "ein Bild hier quasi anzeige, kann ich es nicht löschen, und selbst wenn ich das nächste"}, {"id": 767, "start": 9832.28, "end": 9837.32, "text": "Bild anzeige, kann ich das davor nicht löschen, weil das noch offen im Cache ist, das heißt,"}, {"id": 768, "start": 9837.32, "end": 9839.6, "text": "da muss ich die Light-DB noch dazwischenladen."}, {"id": 769, "start": 9839.6, "end": 9845.72, "text": "Und dann bauen wir ein, dass wir noch Memes löschen können, genau, die drei Sachen machen"}, {"id": 770, "start": 9845.72, "end": 9855.04, "text": "wir Updater, Light-DB und Memes löschen, sondern ich glaube, ich werde das Ganze hier"}, {"id": 771, "start": 9855.04, "end": 9870.0, "text": "rein verpacken, das ist so ein Setup-Creator für Windows-Zeug, allerdings ohne großartigen"}, {"id": 772, "start": 9870.0, "end": 9875.68, "text": "Installer, also das klickt man einfach an und dann startet das und kopiert es dann in"}, {"id": 773, "start": 9875.68, "end": 9882.44, "text": "App-Folder, in App-Data oder so hin, das ist super simpel und hat dann Updater dabei,"}, {"id": 774, "start": 9882.44, "end": 9885.76, "text": "also sprich, das kann einem dann sagen, hier, guck mal, gibt eine neue Version und kann"}, {"id": 775, "start": 9885.76, "end": 9890.44, "text": "sich das auch runterladen und sowas, und die Installation wird auch nicht schwerer, einfach"}, {"id": 776, "start": 9890.44, "end": 9896.64, "text": "runterladen, anklicken, gut ist, übrigens, muss ich hier nochmal zeigen, wo man sich"}, {"id": 777, "start": 9896.64, "end": 9900.56, "text": "nicht so sehr verwirren lassen kann, darf es, ich habe hier schonmal eine Testversion gepusht"}, {"id": 778, "start": 9900.56, "end": 9906.0, "text": "letzte Woche, die sieht aber noch viel, viel, allein schon zwischen der ersten Version,"}, {"id": 779, "start": 9906.0, "end": 9910.64, "text": "die ich gepusht habe und jetzt sind schon Welten dazwischen, nur mal um das zu zeigen,"}, {"id": 780, "start": 9910.64, "end": 9918.08, "text": "wenn man das runterlädt, dann ist mindestens der Meinung, weil diese Datei noch nicht"}, {"id": 781, "start": 9918.08, "end": 9929.52, "text": "oft genug runtergeladen wurde und ich glaube, Chrome meckert schon, oh nein, mittlerweile"}, {"id": 782, "start": 9929.52, "end": 9937.36, "text": "nicht mehr, oder, doch, genau, dann ist Windows ja der Meinung, oh, das ist eine, von einem"}, {"id": 783, "start": 9937.36, "end": 9942.52, "text": "Unknown Publisher runtergeladene Datei, oh mein Gott, da muss man einmal bestätigen"}, {"id": 784, "start": 9942.52, "end": 9947.04, "text": "und das geht nach einer Zeit wieder weg, jetzt gucken wir uns nochmal ganz schnell an, wie"}, {"id": 785, "start": 9947.04, "end": 9966.68, "text": "das Programm vor einer Woche ausgesehen hat, weil es war noch ein bisschen anders,"}, {"id": 786, "start": 9966.68, "end": 9973.24, "text": "ich weiß gar nicht mehr, wie ich den Scheiß aufrufen musste, habe ich sie irgendwie reingeschrieben,"}, {"id": 787, "start": 9973.24, "end": 9984.16, "text": "ah hier, so, so musste man das damals noch aufrufen, ok, noch nichts, nichts, ok, wartet"}, {"id": 788, "start": 9984.16, "end": 9990.36, "text": "mal, Downloads, Memes, ziehen wir mal was rein, ich glaube, das hat damals schon funktioniert,"}, {"id": 789, "start": 9990.36, "end": 9999.52, "text": "ja, so sah die Oberfläche letzte Woche noch aus, ihr seht den Unterschied, oder, das"}, {"id": 790, "start": 9999.52, "end": 10011.24, "text": "ist schon ein Unterschied, das da, oder das da, ja und unser Theme-Switcher und sowas,"}, {"id": 791, "start": 10011.24, "end": 10017.36, "text": "sehr, sehr nice, für die Epilepsischen Anfälle, guckt mal, seht ihr das hier, wie das Symbol"}, {"id": 792, "start": 10017.36, "end": 10028.16, "text": "invertiert wird, weiß, schwarz, weiß, schwarz, je nach Theme, das ist richtig, das ist massiv"}, {"id": 793, "start": 10028.16, "end": 10043.6, "text": "poggers, achso, es läuft ja gar nicht mehr, kann es auch nicht angehen, ja ja, Omega Lone,"}, {"id": 794, "start": 10043.6, "end": 10067.48, "text": "ja, so siehts aus, graues Symbol wäre schöner, wo, was für ein graues Symbol hat Omega Lone,"}, {"id": 795, "start": 10067.48, "end": 10088.4, "text": "eh, achso, ich habe Brüssel Studio zugemacht, Code zugemacht, da kann es natürlich nicht"}, {"id": 796, "start": 10088.4, "end": 10102.96, "text": "funktionieren, grau anstatt schwarz, ja, da muss ich mal gucken, wie das geht, weil, das"}, {"id": 797, "start": 10102.96, "end": 10110.76, "text": "ist ziemlich primitiv, wie ich das mache, das ist ein SVG, ich sag einfach invert, vielleicht"}, {"id": 798, "start": 10110.76, "end": 10127.68, "text": "kann man sagen, probieren wir mal aus, invert 80%, ja, guckt daher, grau, ja gut, das andersrum"}, {"id": 799, "start": 10127.68, "end": 10146.24, "text": "geht da natürlich nicht, weil, weil das ursprüngliche Symbol ist schwarz, kann man das in CSS, kann"}, {"id": 800, "start": 10146.24, "end": 10158.32, "text": "man SVG, color changen, geht das, das wird mich mal interessieren, was ist das für komische"}, {"id": 801, "start": 10158.32, "end": 10186.68, "text": "Symbol, das geht nicht, ne, echt, wie, fill, fill, aha, aha, interessant, interessant, Poggers,"}, {"id": 802, "start": 10186.68, "end": 10210.8, "text": "fill und dann, fuck, was zum Teufel mache ich da eigentlich gerade, ja, 65, 50 mal, gleich"}, {"id": 803, "start": 10210.8, "end": 10224.56, "text": "los, achso, fill, fill, fill, color, color, color, was, what the fuck, geht das so, ups,"}, {"id": 804, "start": 10224.56, "end": 10241.6, "text": "ob ich das jetzt richtig kopiert, Moment, was kopiere ich da, okay, keine Ahnung, wie"}, {"id": 805, "start": 10241.6, "end": 10249.24, "text": "es funktioniert, das kriegen wir doch alles raus, wie lautet das jetzt überhaupt gerade,"}, {"id": 806, "start": 10249.24, "end": 10258.44, "text": "ne, aus irgendwelchen Gründen reloaden wir das nicht, aber ist auch egal, wir machen"}, {"id": 807, "start": 10258.44, "end": 10263.36, "text": "Schluss, ich hoffe euch hat es gefallen, morgen geht es weiter, morgen machen wir noch die"}, {"id": 808, "start": 10263.36, "end": 10266.68, "text": "letzten drei Punkte, dass wir den Grams dann endlich mal, dass wir endlich mal eine Version"}, {"id": 809, "start": 10266.68, "end": 10290.16, "text": "raushauen können, ich hoffe euch hat es gefallen, macht es gut, bis denn, tschüss."}]}