{"text": "Twitch Chat. All these emotes, wondering how to spell that. Now we're older, everyone's moved on, but I remember Twitch Chat from those days that are gone. Twitch emotes from long ago made you feel you're not alone. Kappa Pogchamp, Kipo Forehead, Bible Thumb, Twitch emotes. I remember Typing Dance Games, Forehead, Swift, Rage, PJ Salt and Failfish. Life was easy, spamming all the time, TOS was nowhere, so everyone's feeling fine. Twitch emotes from long ago made you feel you're not alone. Kappa Pogchamp, Kipo Forehead, Bible Thumb, Twitch emotes. Still hear his bark in the morning hour, he calls me. His doggy emote reminds me of a time far away. Looking at a chat, I get a feeling that I miss emotes from yesterday, yesterday. Twitch emotes from long ago made you feel you're not alone. Pog is Pogchamp, Kappa is Kappa, Bible Thumb, Twitch emotes. Excellent, ich muss noch kurz meine LED Fensterleiste anmachen, für mehr Weihnachtsstelts Twitch emotes. So, wunderbar. Chris Stonehenge, 14 Monate, das ist ja quasi schon richtig. Musste sie mal oder erst mal finden. Ich habe schon 14 Monate Sub. Massive Subscription. Was ist das eigentlich für ein komisches Bild? Ach, das ist hier ein Vectorbild oder warum ist das so klein? Dabei ist es ohne Vergrößerung. Ach, das ist das, das komplett auf den Bildschirm passt oder so. Das ist Chrome, Pepega, Bildschirmskalierung. Hast du Pac-Man irgendwie noch konfiguriert? Ich bekomme nicht diese Vorschläge zur Installation, wenn ich Pac-Man minus SS, was für eine, was für eine, was für Vorschläge meinst du mit Pac-Man minus SS? Ach, du meinst die, die ich kriege? Ja genau, das ist kein Pac-Man. Ich muss die VME starten. Also Leute, was ich mir für den Stream hier heute überlegt habe, ist folgendes. Nachdem ich ja im letzten Stream irgendwie schon so viele Leute gesagt habe, oh ja, das ist was, was wir unbedingt für Weihnachten kaufen könnte, also als Geschenk, habe ich mir gedacht, ich gucke mal ein bisschen rum und ich habe mir eine Liste gemacht mit allen Sachen, die mir so eingefallen sind, die man technik-, naja, muss nicht unbedingt technikinteressiert sein, aber sag mal so Informatikkurs und Bustlords. Und alles, was irgendwie damit verwandt ist, schenken kann. So, du meinst das hier, oder? LulHD suchen wir mal. Okay, das ist natürlich so ein Twitch-Chat. Du meinst diese Vorschläge hier? Nee, das ist nicht mit Pac-Man. Das ist J. Ich mach mal kurz den ganzen Kram zu. Das brauchen wir heute nicht. Das brauchen wir heute nicht. Den können wir auch zumachen. Auch zu. Auch zu. FireFox starten wir mal. Oh, FireFox Lightseam. Moment, meine Leute, wartet mal kurz. Okay, das sieht zwar kacke aus mit dem Google-Logo, aber immerhin. Lightseam, das halte ich nicht lang aus. Mein Browser ist schon light genug hier außen drum herum. Konnte man nicht mal, konnte man FireFox nicht irgendwie schön stylen außen drum herum? FireFox-Themes, gab es da nicht irgendwie? Also früher konnte man FireFox auf jeden Fall extrem exzellent stylen. Ich weiß nicht, wie das heute ist, ehrlich gesagt. Okay, dann sollen wir das hier jetzt, Install-Theme, nochmal so zum Vergleichen gucken. Jaja, Add. Naja. Aber das Menü ist ja immer noch ungestylt. Das ist übelst failed. Sagen wir mal, macht das nur die Leiste da oben oder was? Also Amazon lässt uns ja schon mal keine Ruhe, ne? Amazon lässt uns ja mal wirklich keine Ruhe. Es vergeht keinen Tag, wo Blitzangebote sind. So, also zum Beispiel, ich zeige euch mal, was ich mir so überlegt habe, in welche Richtung das Ganze geht. Zum Beispiel, was im letzten Stream total gut angekommen ist, war meine Abisolierzange. Und da haben ganz viele im Chat gesagt, mindestens vier, fünf Leute insgesamt. So, nice, jetzt habe ich was für Weihnachten. Und da bin ich auf die Idee gekommen, dass man mal so einen Stream machen kann, wo ich alles mal zeige, was ich denke, was man gut Informatikers und Bastlors mal schenken kann. Im Gegenzug wäre es natürlich nice, wenn ihr mich auf die Idee bringt, was ich sonst noch kaufen kann. Aber, ähm, tja. Was? Rechtsklick oben auf die Leiste? Anpassen? Customize? Ah, das ist schon so hell. Ah, yes. Ja, ok, ok, ok. Aber so ist auf jeden Fall deutlich angenehmer. Dann deinstalliere ich dieses Theme wieder. Wie deinstalliert man das jetzt überhaupt? Hab ich noch nie gemacht. Wie, wie, wie aninstalliert man das jetzt? References? Das ist natürlich nett. Hier, Extensions. Ah, das ist wieder das richtige Big Brain Musik gerade am Start. Ah, yes. Mario Galaxy Walzer Exquisite. Lädst du deine Streams irgendwo hoch oder wo? Ähm, genau da. Der hat schon gepostet. Du musst auf, ich bin mir nicht sicher, es geht eins von beiden, geht nicht. Oh, Sebaro, die Seite ist kaputt. Lull. Bei mir gelädt die Seite nicht. Lädt die bei euch? Bei mir ist Watt und Archief kaputt. Aber, du kannst, äh, du kannst auf Wupplors.tv gehen. Du kannst da hingehen. Und dann gehste da oben auf Archief. Und dann funktioniert's. Das muss man dem Sebaro mal sagen, wenn er wieder da ist. RIP. Das ist wahrscheinlich irgendeine Cloudflare-Foreboarding-Geschichte, die den Serverumzug nicht überlebt hat. Nee, das funktioniert. Das funktioniert, Leute. Ich hab's doch gerade selbst gemacht. Guck mal hier, das funktioniert. Ihr geht auf Wupplors. Die Seite ist zwar hardcore langsam gerade, aber sie funktioniert. Ähm, dann geht ihr auf Archief. Übersicht. Zack, seid ihr immer schief drin. So wie das sein muss. Ja, das ist das Google Drive Archief. Da müsst ihr jetzt euch erst mal hier searchen. Den Titel vom jeweiligen Stream raussuchen. Guck mal hier, wie viele Streams ich schon gemacht hab. Seht ihr das mal hier? Das ist für komische Dateien. Hat der Sebaro da sein Hentai Zeug drin? Oder was ist da? Irgendwo versteckt. Ach nee, das sind die, das sind irgendwelche Clips. Okay, keine Ahnung. Macht nichts. Ich muss das nicht so genau wissen. Yep. Bester Streamtitel überhaupt hier gewesen. Yep, Aubergine. Yep, Aubergine. Github hat jetzt auch einen Dark Mode. Ja, so langsam, aber sicher kriegen alle Seiten irgendwie einen Dark Mode. Amazon sieht halt mit Dark Mode ein bisschen, ja, wie sieht Kaga aus. Aber alle mal besser, als wenn ich mich jetzt hier erplinden lasse vom Monitor. Oh nee, darf man nicht mehr sagen auf Twitch. Fuck, schon wieder das Wort verwendet. Nee, nee, nee. Ich bezahle das gar nicht der Sebaro macht das. So, also, deswegen, ich hab mir eine richtig lange Liste gemacht. Ich hab mein Amazon und sonstige Sachen durchgeguckt und auch mal bei mir im Schrank und alles Mögliche, was man, wie gesagt Informatikor ist oder generell Bastlern, Technik interessiert oder so mal, schenken kann, was nicht so teuer ist. Wohlgemerkt, es sind bestimmt die ein oder anderen Sachen drin, die auch ein bisschen mehr ist. Was ist mit meinen Reflings? Was soll mit meinen Reflings sein? Die Reflings gehen auf Twitch und auf Twitter und überall, wo es Reflings sind, gehen die. Ich hab halt so wenig Reflings. Ich hab jetzt, theoretisch hätte ich jetzt eigentlich für Maximum Geldabgreifaction hätte ich eigentlich für jedes Produkt oder ich hätte eine Liste machen müssen. Max-Weihnachtsgeschenktipps. Leute, ihr habt mich auf die Idee gemacht. Ich mach morgen ein Video. Top, frag mich nicht. Top 10, Top 15 der besten Weihnachtsgeschenke für Informatiker und Technikleute. Irgendwie sowas. Dann ein bisschen clickbaity. Müssen wir das machen. Und dann mach ich ne Liste mit Reflings und dann gibt's Easy Money. Und wenn einem das gefällt und ich irgendeinem geholfen hab, freu ich mich natürlich auch über Twitch Prime Subs. So, also, wie gesagt, ich hab mal alles mögliche in Sachen durchgeguckt und mir sind ein paar Sachen eingefallen und ich hab auch ein paar Sachen gefunden, wo ich denke, dass das wahrscheinlich den meisten Leuten, die sich so ein bisschen für Technik Sachen interessieren, gefallen wird. Wohlgemerkt, natürlich, ich mein, ihr kennt die Leute am besten und das eignen sich auch nicht alles für alles, ja. Man, jeder hat so ein bisschen unterschiedliche Vorlieben. Ein paar Sachen sind halt auch relativ speziell, aber wenn sich einer für interessiert, dann findet er das bestimmt nice. Schon Git auf Deutsch gesehen. Nö, braucht man das? Git hat doch standardmäßig ne deutsche Übersetzung, die ist aber scheiße. Tägliche Kommunikation. Und was ist hier los? Warum geht es hier nicht? Warum geht der Darkreader hier nicht auf GitHub? Ah, weil ich's ausgemacht hab. Exzellent. Ich brauch Darkseam gerade. Und ich bin hier noch eingeloggt? Warum bin ich hier noch eingeloggt? Zeig ich vielleicht Sachen, die ich gar nicht zeigen will? Das ist nicht meine Seite, Pasi. Die ist nicht mir. Die gehört doch nicht bei mir. Nur nicht bei die Domain ist mir. Was? Git auf Deutsch. Es folgt ein zweiter Bild. In it. Eröffnen. Oh ne, das darf ich bei uns den Leuten auf der Arbeit nicht zeigen. Also, nicht die normalen Leute auf der Arbeit, die auch in Git was machen. Aber wenn ich das der falschen Stonks Führungskraft zeige, da sind so ein paar Leute dabei, die stehen drauf, alles einzudeutschen. Auf der anderen Seite haben wir auch genug, die müssen das besonders agile und trendy Englisch machen. Aber wir haben manche, die stehen total auf Eindeutschen. Wenn ich denen sage, hier guck mal, hier Git auf Deutsch, da kommen die noch auf die Idee. Die sagen dann so, aha, wir brauchen unbedingt neue Policy. Alles, was im offiziellen Schriftverkehr verwendet wird, soll gefällig auf Deutsch sein. Und dann edit man nicht, sondern fügt hinzu oder man beschuldigt, man zieht. Ich pullen würde ich sogar, könnte man pullen nicht, nicht, äh, untersetzen mit, mit, äh, runterholen? Nein, vergisst's. Aber trifft's eigentlich ganz gut, die Übersetzung, oder? Pullen. Runterziehen. Runterziehen eigentlich. Schieben. Ja, nachmachen. Oh man, was ein Schwachsinn. Braucht dann sowas, aber die Idee ist gut. Okay, so, also kommen wir mal, kommen wir mal zu den Weihnachtsgeschenken. Und by the way, es ist keine Windows-Lizenz dabei. Wobei Windows-Lizenzen ja mittlerweile fast umsonst sind. Hab ich euch erzählt, ich hab mir eine VMware-16-Lizenz gekauft. Bye, haltet euch fest. Bye, oh fuck, wie hießen die? Ich glaub Software-Kong oder so. Hier, Software-Kong. Ich hab mir eine VMware-16-Lizenz gekauft. Boah, nee, nee, nee, nee. Sowas hier. Software-Kong. Hat funktioniert. Ich weiß nicht, ich weiß nicht, ob sie funktioniert. Äh, ich hab noch nicht installiert, das hier ist noch vor einmal 15, glaub. Aber ich bin mal gespannt. Ich hab mir gedacht, komm, 20 Euro, Koffer bei Software-Kong, was. Ich weiß nicht, ob die läuft. Software-Kong. Klingt, findet ihr nicht auch, dass Software-Kong schon ziemlich seriös klingt? Vorurteile von VMware gegenüber VirtualBox. Es ist alles ein bisschen mehr polished als bei VirtualBox. Du kannst zum größten Teil alles mit VirtualBox zwar machen, aber es ist angenehmer mit VMware. Ich weiß gar nicht, wie es mit Snapshots aussieht. Kann VirtualBox ordentliche Snapshots? Bestimmt. Jaja, doch klar können die das. Aber wie gesagt, mir gefällt VMware Workstation besser. Du kannst es auch mit VirtualBox machen. Der Vorteil von VirtualBox ist eher im Detail. Zum Beispiel, wenn du irgendwelche 3D Sachen oder generell beschleunigte Sachen verwenden möchtest, 2D, 3D beschleunigte Sachen in der VM, dann ist die Chance, dass es mit VMware deutlich höher geht als mit VirtualBox. Die haben ja mittlerweile sogar OpenGL 3 noch was Unterstützung und sogar DirectX 11, glaube ich, oder sogar Initial 12. Cyber-Magenta-Thursday bei der Telekom. So, also, bevor wir jetzt lang rumschwitzen, ich zeige euch mal ein paar Sachen, weil ich habe wirklich ziemlich viel aufgeschrieben. Ja, Nazana finde ich auch, dass VMware ein bisschen flotter, mehr flutscht. Kommt mir auch so vor. Excellent. Ah, der Super Mario Galaxy Soundtrack ist nice. So, dass es nicht zu laut ist. Nee, passt genau. Also, dann fangen wir mal an. Also, wie gesagt, das ist das, was mich auf die Idee gekommen hat. Kannst du die Liste im Discord posten? Ja, sobald ich morgen ein Video gemacht habe und eine RefLink-Liste habe. Das muss ein paar Klicks mal mitmachen. Wie gesagt, ich mache morgen ein Video und Tom, da ist das dann drinnen mit Reflinks und allem. Ja, aber sag mal so, meine Erfahrungs-Dinger mit den Sachen gibt es halt nur hier im Stream. Da kann ich ja nicht morgen zu jedem Item irgendwie 10 Minuten was erzählen. Wolltest du nicht eigentlich jeden Tag im Dezember ein Video machen? Nee, wie kommst du darauf? Also, Flo690, ich weiß nicht, woher soll ich das wissen. Du kannst ja sogar, zumal das Ding auch noch gute Bewertungen hat, das kannst du doch überhaupt nicht wissen, die Seite sieht seriös aus. Das ist das gleiche, wie wenn du, und ich würde jetzt den auch mal gar nicht unterstellen, dass die da irgendwelche merkwürdigen, aus irgendwelchen merkwürdigen Quellen da ihre Keys haben. Ist ja genauso, wenn du irgendwelche Streams anguckst von Seiten, die halt legit aussehen, da kann auch dir keiner irgendwie nachsagen, dass du gesagt hast, ja du hättest wissen müssen, dass das irgendwie illegales Zeug ist. Weiß nicht, ob es da schon Fälle gibt, wo dir was passiert. Wo dir natürlich was passieren kann, das ist wieder was ganz anderes, wenn du das irgendwie gewerbsmäßig nutzt oder so, das könnte natürlich sein. Also, wenn du dann irgendwie 100 Lizenzen kaufst und dann irgendwelche Business-Dinger, das kann es vielleicht sein, aber wenn ich mir dann privat einen Vmw Key kaufe, da geht da kein Hahn danach. Dann kommt das Staubsaugen am Einkauf-Video, das funktioniert nicht, da läuft kein Java drauf, gescheit. So, also, kommen wir uns mal ein paar Sachen an. Exzellent. Wie gesagt, so, also, Java im Docker, na, das ändert da wahrscheinlich auch nichts dran. Ich glaube, Docker krieg ich schon ordentlich installiert. So, also, wie gesagt, das ist die eine Sache, da bin ich letztens, also im letzten Stream auf die Idee gekommen, dieses Video hier zu machen, weil einige Leute gesagt haben, hier das finden sie eine gute Sache. Und ich kann euch sagen, ich persönlich finde das Ding super. Es gibt sicherlich noch andere abisolierte Zangen, die auch ganz gut sind. Kann ich jetzt nicht beurteilen. Es gibt beispielsweise noch irgendwie eine Multistrip von Knipex und sowas. Kann ich nicht so sagen, sind bestimmt auch nicht schlecht. Ich hab dieses Teil hier schon seit drei Jahren oder so. Und die gibt es auch gerade sogar, guck mal, die gibt es auch gerade bei Amazon sogar noch zu kaufen. Und für 11,30 Euro, ganz ehrlich, wenn einer sowas noch nicht hat und jemand gerne bastelt, dann ist das eines der besten Geschenke, die ihr machen könnt. Ich könnte mir vorstellen, vielen ist gar nicht so klar, dass sowas gibt. Ich hab das auch nur mehr oder weniger durch Zufall beim rumgucken auf Amazon als Empfehlung gesehen. Hab ich mir gedacht, jawohl, genau sowas brauch ich. Alter, kommt mal, ohne Mist, 11,30 und derjenige, dem ihr das schenkt oder vielleicht kauft ihr es euch selbst, wenn ihr sowas von mich habt, der wird sich auf jeden Fall freuen. Das ist absolut Pock. Und wie gesagt, ich hab das schon seit zwei, drei Jahren. Ich weiß nicht wie lange genau. Und es funktioniert wunderbar. Wo es nicht gut funktioniert, muss man sagen, ist wenn ihr ganz dicke Kabel habt. Also bei sowas hier ist das alles noch vollkommen okay. Aber wenn ihr dann irgendwelche ganz fetten Stromkabel habt, die, wir können ja mal gucken, guck mal, das geht bis sechs Millimeter. Da wird es aber schon echt eng. Also ich hab das mal probiert für so einen, fragt mich nicht, ich kenn mich mit Kabelbezeichnung nicht aus, nicht für so ein ganz fettes Stromkabel, für so ein mittelfettes Stromkabel und da hat es das schon ziemlich auseinandergerissen. Also dafür ist es nicht so gut. Also wie gesagt, die Außenisolierung. Innen drinnen wieder überhaupt kein Problem. Aber ansonsten ist das Ding super. Und generell so fette Kabel verwendet man ja auch nicht, wenn man daheim irgendwas macht und vor allem wenn man irgendwas bastelt. Da verwendet man ja immer kleinere Kabel, wozu sollte man super große, fette Dinger da nehmen. Also 95% was ich so mach, kann ich damit ohne Probleme abisolieren. Und ansonsten muss ich halt diese Außenhülle mit was anderem abschneiden und innen drinnen kannst du dann wieder mit dem Ding das machen. Das hat auch einen Vorteil im Vergleich zu dem ganzen manuell zu machen, wenn man das damit abisoliert. Das ist immer gleich lang. Also hier kann man, hier seht ihr das ja, hier kann man einstellen wie lang das Ganze werden soll. Und dann macht ihr das Kabel da vorne rein. Und dann macht ihr es auf, macht es rein und dann zack zack. Und dann ist das alles immer gleich lang. Ist wirklich sehr nice. Kann ich jedem nur empfehlen das Ding. Und ich hab das jetzt auch schon im Chat ein paar Leute gesehen, die auch sagen sie haben das und finden das gut. Wartet mal Leute mein Kabel reibt wieder am Reißverschluss. Das ist echt scheiße. Das macht so dumme, so nervige Geräusche im Stream dann. Ich machs jetzt, ich machs jetzt einfach mal um den Hals auf der anderen Seite runter. Jetzt ist das nicht so, ja jetzt ist es besser. Ich habe hier noch dieses eine Rode Mikrofon, was ich mir so an den Pulli klemmen kann. Und das wollte ich eigentlich auch mal ausprobieren, aber da muss ich erstmal gucken wie ich das anschließt. So, also das war das erste. Machen wir weiter. Ähm, auch noch direkt vom letzten Stream. Jakob0403, Twitch Prime, Dankeschön für den Sub. Exzellent. Das stimmt, an engeren Stellen, Kilfe kann man damit nichts machen. Ja, also in welche Gehäuse rein oder so, wenn das nicht rausgeht, ist das damit ein bisschen schwierig. Weil das hat ja schon gewisse Größe, ne. Wieso kosten zwei mehr als einzeln, ne, weil Amazon, das kann ich dir nicht sagen. Wie findest du Proxmox ganz brauchbar? Ich hab da aber keinen Anwendungszweck bei mir daheim für. Ich hab's schon im Stream mal ausprobiert. Ist auf jeden Fall besser geworden in den letzten paar Versionen. So, nächste. Ähm, da zeig ich euch jetzt nochmal stellvertretend was, weil das kam im letzten Stream auch. Ich hab zum Basteln so eine Silikon-Arbeitsmatte. Sowas da. Ich glaub das ist sogar die, die ich hab hier. Entweder die hier oder die hier. So Dinger sind auch äußerst praktisch. PFSense und OpenSense. Ich hatte immer OpenSense, aber ich hab keins von beiden mehr. Für Netzwerkkabel funktioniert es auch. Ja, für Netzwerkkabel funktioniert es. Also für die inneren Netzwerkkabel funktioniert es ohne Probleme. Für die äußeren Netzwerkkabel funktioniert es auch noch. Aber, also größer darf es nicht mehr sein. Das ist schon nicht mehr so hundertprozentig sauber bei Netzwerkkabel. Aber es geht. Kannst du machen mit. Aber viel fetter als so ein normales Netzwerkkabel darf es nicht sein. So. Also, das ist auch eine Sache, die ich nur empfehlen kann. Für alle die basteln und das irgendwie auf dem Küchentisch machen oder früher hab ich mich immer auf die Erde gesetzt und auf den Teppich das gemacht. Das lief dann mal so weit, dass ich irgendwann mit der Ferse mal in so einen Jumper-Wire-Pin gedreht bin. Da hab ich, weiß ich jetzt noch, ich bin auf dem Stuhl, hab ich mich so vorgerollt, so an den Rechner rangezogen mit dem Fuß und auf einmal hab ich so gemerkt an meiner Ferse. Und es hat halt so ein Geräusch gemacht, so richtig so. Und da hat sich halt so ein, da hat sich halt so ein Pin hier. Genau. So ein Pin hatte ich dann in der Ferse stecken. Das war nicht so angenehm. Dünne Kupferlitze klappt damit auch. Ja, du kannst ja gucken. Also, die sagen ja, es geht von 0,2 mm bis 6 mm. Also wenn du ganz, ganz, ganz Furzelkabel hast, dann wahrscheinlich nicht. Aber wie gesagt, bei mir geht 95% alles damit. Das hat wehgetan. Und seitdem bastel ich nicht mehr auf der Erde. Und da kann ich so eine Silikonmatte nur empfehlen, weil das Zeug da ist absoluter Crap. Ich hoffe, das ist nicht dabei. Das braucht nämlich kein, kein Mensch. Das wichtigste ist die Matte. Und da kann man rumgucken auf Amazon, was da so passt. Da gibt es zig, tausend Matten in dieser Richtung mit Fächern einfach nur glatt und sonst was. Das da kann glatt ein Mousepad sein. So und das ist nützlich. Erstens, weil das Zeug da drauf nicht so rutscht. Diese Fächer da oben. Ich muss euch ehrlich sagen, ich verwende sie nie. Wenn mal jemand ist oder wenn man jemand beschenken will, der da total ordentlich ist, dann freut er sich vielleicht darüber. Ich verwende die Dinge eigentlich nicht oder zumindest ganz selten. Man kann, was echt ein nicer Hack ist, man kann, wenn man die Unterlage immer auf den gleichen Tisch oder so legt, man kann da auch Magnete drunter machen. Also muss man dann selbst machen. Magnete drunter kleben zum Beispiel, wenn man will, dass man manche Sachen da besser dran befestigen kann. Ist auch eine Idee wert. Habe ich mal in einem Video gesehen, finde ich es eigentlich eine gute Idee. Und wenn so ein Magnet dran pappt, dass es dann nicht mehr so wackelt. Aber insgesamt ist das halt gut. Erstens, das Zeug rutscht da drauf nicht so. Es hat ein bisschen einen Rand, das Zeug fällt nicht runter. Und das hält auch mal den Lötkolben aus, so Teile. Ich weiß jetzt nicht, ob da irgendwas, genau, für die Wärme bis zu 500 Grad standhalten. Also, ich habe meinen Lötkolben, normalerweise, so die Lötstation steht standardmäßig auf 380 Grad. Und ich habe es im letzten Stream dran gehalten, da ist nichts passiert. Ich würde es nicht lange dran halten, weil das auch für den Lötkolben nicht gerade toll ist. Aber der Mathe hat es nichts gemacht. So. Aha. Ja. Oder man ist der Lockpicking-Lawyer, dann guckt man die Tür noch scharf an, dann geht sie auf. Nee, der Gamer Alex, das hält die Mathe aus. Guck mal, die schreien 500 Grad. Du stellst deine Lötkolben nicht auf 500 Grad. Ich weiß gar nicht, ob ich meine überhaupt, was maximale Temperatur ist. Ich guck mal, was die maximale Temperatur von meiner Lötstation ist. 450, guck mal. Ich kann sie maximal auf 450 stellen. Das ist schon ganz schön viel. Das braucht man eigentlich nicht. Das hält die aus. Wie gesagt, lang würde ich sie eh nicht machen, das verhält das Marke der Lötkolben auch nicht sonderlich. Aber sag mal so, wenn das die Haltmarke irgendwie runterfällt oder aus der Hand fällt, dann ist das kein Problem, das hält das aus. Das stinkt noch nicht mal großartig. Muss ich gleich wieder wegmachen. Max, bist du noch DevOps-Engineer beruflich? Ja, bin ich noch. Aktuell bin ich daheim, weil ich Urlaub hab bis Januar. Aber danach wieder. Genau. Exzellent. So, also das ist das nächste. Kann ich mir gesagt auch nur Wermstens empfehlen, im wahrsten Sinne des Wortes. 380 ist schon ziemlich viel, ja. Ich hab den auch nur auf 380 stehen, weil das Default auf 380 eingestellt war. Nee, wahrscheinlich ist es sogar besser, wenn ich es ein bisschen runter machen würde, aber es war Default eingestellt und ich hab mir gedacht, ja. Scheiß drauf. Okay, das ist natürlich was anderes, wenn Jellystar sagt, er verwendet nur pleifreies, hab ich noch nie verwendet, by the way, er verwendet nur pleifreies Lötzinn. Dann ist das wieder was anderes. Pleifreies Lötzinn fließt schlechter und braucht deutlich mehr Temperatur, dass es ordentlich flüssig gemacht werden kann. Ja, dann kann ich dann, ja, logisch. Aber ich hab so 0815 Lötzinn, das ist glaube ich, was ist das, 30% Plei, 70% Zinn und in der Mitte ist irgendwie so ein bisschen Harz oder sowas drin. Aber ohne das Harz geht es nicht, das fließt nicht gescheit sonst. Okay, also nächstes. Auch eine Sache, die wir letztens, Flussmittel, genau, das ist doch irgendwie so eine Art Harz, was da drin ist. So, auch eine Sache, die für jeden Bastler, unabhängig davon, ob er das für Stromkabel fände oder für irgendwelche anderen Sachen, was für jeden Bastler Poggers ist und was die wenigsten Bastler, die nicht gerade Elektriker sind, kennen, kauft ihn ein Vago-Klemmen-Set. 201. Kauft ihn irgendwie ein Set davon. Das sind absolute Poggers-Klemmen. Poggers-Klemmen, Alter. Poggers-Klemmen. So, irgendwas, was bei euch der Geldbeutel hergibt. Aber so ein Set hat den Vorteil, dass man eben für alle Eventualitäten da ein bisschen was dabei hat. Das ist hier so ein bisschen klein für den Preis. Ich würde wahrscheinlich irgendwie sowas hier nehmen. Ich würde wahrscheinlich irgendwie sowas hier nehmen. Das ist, glaube ich, so mehr oder weniger auch das, was ich mir gekauft habe. Du hast einen Set Zweier, du hast einen Set Dreier und du hast einen Set, glaube ich, Fünfer. Es gibt, glaube ich, noch Vierer und gibt es noch Sechser? Ich weiß es nicht. Aber das ist okay. Man muss es ja nicht übertreiben. Und die Dinger sind wirklich nice. Also die Dinger sind wirklich nice und jeder Bastler freut sich darüber, auch wenn er nicht weiß, dass es das gibt. Was ist der Vorteil von solchen zu normalen Lüsterklemmen? Du musst nicht schrauben. Du musst nicht schrauben. Wahrscheinlich ist der Kontakt ein bisschen besser. Und sie eignen sich halt auch für Kabel, die aus mehreren kleinen Kabeln bestehen. Also Lüsterklemmen eignen sich ja, glaube ich, nur für starre Kabel. Also da, wo halt ein durchgängiges Kupferding ist. Weil wenn du in Lüsterklemmen normale Litzenkabel machst, also diese ganz, diese elastischen Kabel, die bestehen ja unter der Isolierung aus vielen kleinen Äderchen, dann hast du bei Lüsterklemmen das Problem, dass wenn du die Schraube hinein machst, dass du dann die Schraube quasi nur auf eine Stelle drückst und die restlichen kleinen Kupfer-Äderchen gehen halt drum herum. Da hast du kaum Kontakt. Im Zweifelsfall kannst du wahrscheinlich sogar anfangen zu brennen, wenn der Kontakt zu schlecht ist. Also es ist angenehmer und es ist halt praktisch. Flo690, die schreiben selbst auf ihrer Seite, dass du das für beides verwenden kannst. Du kannst das verwenden für starre Kabel und für, guck, das haben die sogar bei sich auf der Seite stehen. This is Manjaro Linux and i3 WM as Window Manager. Guck, die schreiben sogar auf ihrer Seite, dass es geht für Litzenkabel und durchgängige Kabel. Ah, yes. Exzellent. Exquisite, ja. Irgendwann mach ich ein komplettes Englisch-Video. Komplett nur in Englisch. Guck hier. Man kann die schon für alles, beide verwenden. Was es ja eigentlich noch besser macht. So. Also das ist auch was, wo uns jeder Bastler drüber freuen wird. Kann man nur empfehlen. Und so ein Set halt hat den Vorteil, weil man weiß ja im Vorfeld nicht, was man braucht. Man denkt meistens, man kommt mit 1, 3er aus und dann braucht man doch mal 5. Aber für die meisten Sachen reicht das auch. Ja, Jelly ist da richtig. Bin mir nicht sicher, ob die hier auch noch bis 4mm gehen, aber du scheinst dich damit auszukennen. Ich glaub dir das jetzt. Aber für das, was man normalerweise, hier, genau, da steht es doch. Was man normalerweise daheim bei Bastler Aktionen macht. Paar LED-Strips zusammen. Passt das alles wunderbar. Ja. Also das kann ich auch nur jedem Bastler ans Herz legen, sich sowas zu kaufen. Dann nochmal ganz schnell, weil ihr wisst, dass ich ein großer Fan von bin, aber es nicht so teuer ist. Die LED-Strips mach ich nicht. Oder mach ich die LED-Strips? Ich mach mal die LED-Strips mit in die Liste morgen. Ich glaub, das kommt ganz gut an. Eine Sache, wo ihr wisst, bin ich Fan von. Ich will es jetzt nicht zu sehr zelebrieren. Vera Tool-Check Plus. Freut sich jeder Bastler drüber. Moment, wo ist er? Oh, gibt es den gerade gar nicht? Ist der gar nicht lieferbar gerade? Kennst du die Dinger? Nein. Kenn ich nicht. Es gibt gar keinen Tool-Check Plus. Was ist hier? Also das hier ist es, aber die gibt es gar nicht zu kaufen. Erhältlich bei diesen Anbietern. Tja. Das ist sehr beliebt zu Weihnachten, wie es aussieht. Müsst ihr mal rumgucken. Normalerweise ist der nämlich eine ganze Ecke günstiger. Irgendwas um 50 Euro oder so. Teilweise gibt es den angeboten sogar noch billiger. Ja, hier. So, guckt hier 43. Das ist zum Beispiel echt ganz nett vom Preis her. Und ich will jetzt nicht zu lange drauf rumreiten, weil ihr wisst, dass ich das Ding super finde. Wenn einer ein bisschen ordentliches Werkzeug braucht, vielleicht ist auch einer gerade mal umgezogen oder hat seine erste Wohnung oder sowas in der Richtung. Das Ding ist super Universal-Lösung. Da hast du alles dabei. Du hast so die gängigen Nüsse. Du hast so die meisten Bits, bis auf so Spezial-Bits. Dafür kommen wir gleich zu. Du hast so einen kleinen Schraubendreher, den kannst du ein bisschen verlängern. Und du hast so eine Mini-Metall-Ratsche plus Bithalter. Also man hat echt alles dabei. Wenn man jetzt nicht gerade Reifen wechseln will am Auto, kann man damit alles schraubemäßig machen, was man so im Haushalt machen will. Und weil es gerade schon einer im Chat geschrieben hat, wenn man ausgefallene Sachen hat, dann bietet sich auch so ein Ding hier an. Das ist allerdings nicht dieses Set. Dieses Set ist der Preis echt nicht wert. Das normale iFixit-Set mit den Bits kostet 34 Euro und dieses Pro-Ding. Also diese billige Dinger sind keine 30 Euro obendrauf noch mal wert. Das ist so ein Anti-Start, wie heißt das Ding? ESD-Armband. Dann irgendwelche komischen Zahnarzt-Instrumente, wo ich die erste schon im Stream verbogen habe. Billigste Zahnen. Also, nee, brauchen wir nicht. Also ich würde sowas hier kaufen, wenn man die seltenen Bits braucht. Also qualitativ ist der Tool-Check Plus komplett andere Liga als das Ding. Wenn du bei den Bits hier ein bisschen fest drehst, ist auch mal vielleicht nicht ne Ecke ab, aber sind nicht mehr so ganz gerade. Also wenn man Sachen reparieren will oder wenn man öfters so ausgefallene Sachen braucht, zum Beispiel wenn man China-Steckdosen aufmachen will oder China-Geräte oder irgendwas, dann bietet sich als Ergänzung so ein iFixit-Ding an. Das hat nämlich auch den Vorteil, hier oben ist ein Adapter dabei, rechts oben hier in der Ecke, der da. Damit könnt ihr alle diese Bits auch im Tool-Check Plus benutzen. Und dann ist wieder gut. Nehmt ihr das Ding, macht den Bit rein, ihr macht den Bit rein und... Moment, ich zeig's euch mal. Ihr macht den Bit, ihr macht hier diesen Adapter-Bit rein und dann könnt ihr das auch entweder in der Ratsche verwenden oder hier in dem Schraubendreher. So. Und dann zeig ich euch noch mal meinen persönlichen Liebling, aber das hab ich euch letztens schon gezeigt, deswegen nur mal ganz kurz. Was ich echt gern hab, was so mein Lieblings-Set von Vera ist, ist dieses Vera-Zyklop-Elektriker-Set. Das kostet aber noch ne ganze Ecke mehr, das kann ich nicht wirklich als Weihnachtsgeschenk empfehlen. Das da. Es sei denn, ihr wollt einen für 90 Euro was schenken. Das benutze ich ehrlich gesagt am liebsten, da hast du auch so die gängigen Sachen dabei, inklusive der wirklich ordentlichen Ratsche. Gut, den Phasen-Prüfer braucht man nicht. So die gängigen Größen, wo man mal einen Maul-Schlüssel plaudert, ist auch, ich glaube, 10 und 13. Und hier kannst du quasi mit diesem Handteil, kannst du hier die einzelnen Dinger durchwechseln, was man gerade so braucht. Und da hat man natürlich schon ein bisschen mehr Kraft und ein bisschen mehr Reichweite als mit dem Tool-Check Plus. Das ist so mein persönliches Lieblings-Set, aber das ist ein bisschen teuer für Weihnachten. Deswegen. Das da ist so als Einstiegsding wirklich nice. Zeig mal das Fein-Mechanik-Dreherset von Vera. Das wollte ich mir auch mal kaufen, aber hab ich nicht gewacht. Das da, das ist natürlich auch ganz schön teuer, ne? Das ist ganz schön teuer, aber sicherlich bestimmt nice. Kann ich aber nichts zu sagen, hab ich nicht. Wollte ich mir mal kaufen, hab ich mir auch gedacht, ey, ich hab schon genug Dinger, die ich dafür verwenden kann. Wenn was kaputt geht, kann ich es mir immer noch kaufen. Ich brauch nicht, ich muss mir nicht, ich muss mal ein bisschen davon wegkommen. Das hab ich mir auch so vorgenommen und das hab ich auch für dieses Jahr schon, schon hatte ich mir das immer wieder vorgenommen, dass ich mir nicht so viel sinnloses Zeug mehr kaufe, einfach weil ich es haben will. Vielleicht kann sich eine eine oder andere mit internifizieren. Ich hab mir in der Vergangenheit viel zu viel sinnloses Zeug gekauft, was ich nicht brauche, einfach weil ich es haben wollte. Genau. Also das ist beides ganz nett und gerade das hier kann man auch mal als Weihnachtsgeschenk machen. Genau, so viel zu diesen Werkzeug Sachen. Wie gesagt, das ist, was ich mir aufgeschrieben habe, ist komplett durch Querbeet. Dann noch was für alle Informatikors unter uns. Wer Spaß am Programmieren hat und ein bisschen C-Sharp programmiert, dem kann ich nur dieses Buch hier, meiner Meinung nach das beste C-Sharp Buch, was es gibt für Leute, die die Sprache schon können. C-Sharp in Action. Bestes Buch. Wo ist das denn? Nee, nicht in Action, in Depth mein ich, nicht in Action. In Action heißen die Dinger nur bei den anderen immer, vergiss das hier mein ich. C-Sharp in Depth. Legendary Stack Overflow Mensch am Start. In Depth, nicht in Action. Das ist meiner Meinung nach das beste C-Sharp Buch zum vertiefen. Ja, das ist, finde ich das beste Buch. In der Richtung. Der Kerl hat glaube ich die meisten Stack Overflow Punkte von allen. Man kann es auch als Hörbuch sich anhören. Ok, was auch immer. Jetzt ist Amazon RIP. Ja, ihr könnt auch mal gucken, ob ihr das irgendwo günstiger kriegt. Aber gerade für Leute, die schon ein bisschen C-Sharp kennen, finde ich das super. Geh nochmal zurück, wohin? Da hin? Windows Forms in Action, da ist ja irgend so ein, äh, warum ist da so ein Crossbow Dude drauf? Rx in Action. Taps und Java zu lernen, nein, da bin ich der Falsche für, keine Ahnung. Kennst du die Sprache Beef? Hab ich eben schon mal was zu gesehen, ja. Such nochmals die Sharp in Depth. Hab ich? Also mal gucken, dass man die neueste Edition kriegt. Tipps von Zero aus C-Sharp zu lernen. Ja, und zwar, das ist das beste Buch zum verschenken. Leben mit einem großen Penis Rat und Weisheit für Männer, die außerordentlich gut ausgestattet sind. Ah ja, ok, das ist natürlich was, das muss man unbedingt wissen. Das ist das Gegenteil von Big Brain, Big Cock. Ich glaube selten in Kombinationen. Naja, aber wie gesagt, das Buch, finde ich, ist eine super Geschichte für Leute, die schon ein bisschen C-Sharp kennen, sich dafür interessieren. So, Einstieg in C-Sharp, ganz ehrlich, nach wie vor, finde ich, muss man dafür kein Geld ausgeben. Man kann erstmal anfangen mit dem C-Sharp Open Book von Reinwerk heißen sie mittlerweile. Früher hieß es immer Galileo. Das hier, das ist zum Einstieg immer noch gut. Die Seite sieht nur so scheiße aus, weil ich Dark Reader auf hab. Das ist zum Einstieg wirklich gut. Allerdings, es lohnt sich nur bis Kapitel 16. Den Rest brauchst du nicht. Was für Geschenke hast du bisher so gefunden? Ich finde keine Geschenke, ich zeig euch Geschenke, die man nehmen kann für Leute, die sich ein bisschen mit Technik interessieren. Also, bis Kapitel 16, dann kennste die schon mal ganz gut aus. Und ansonsten, Stack Overflow, YouTube Tutorials, GitHub, Code von anderen Lesen. Microsoft hat auch ziemlich gute Casts, Webcasts mittlerweile dazu. Kennst du ein gutes Cobalt-Poof für uns? Nee, erst mal Händewaschen. Ich weiß, dass ich an Weihnachten ein bisschen Cobalt programmieren muss für den Stream. So, nächste Sache, wo ich mir denke, das ist auch eine ganz nette Geschichte. Ein NFC-Starter-Set. Ich hab das hier, gerade wenn man ein iPhone hat, also ein neueres iPhone. Bei Android ist das ja schon länger verbreitet. Oder ein halbwegs aktuelles Android-Tablet mit einem NFC-Reader drin. Und weil es ja nicht nur ein NFC-Reader ist, es ist ja auch immer Automat, ein NFC-Writer. Dann kann man sehr viel mit NFC-Tags machen. Und die meisten Leute verwenden das Zeug überhaupt nicht. Bestes Stream-Dec, ganz einfach, mein eigenes. Mein eigenes Stream-Dec ist das beste Stream-Dec. Mein Stream-Dec ist das beste. Wer hat schon in seinem Stream-Dec eine koreanische Text-to-Speech-Engine drin? Oder kann sowas hier? Willst du in naher Zukunft nochmal einen Battlefield 3 geben? Ja, ich denke schon. Ich hab irgendeine uralte Version auf GitHub, aber die würde ich nicht verwenden. So, ähm... Staubsauger-Roboter, ja, da hab ich... Die sind so teuer, die guten. Da würde ich keinem was empfehlen zu Weihnachten. Das ist ganz schön, ganz schön viel. Ja, genau, also wie gesagt, NFC-Tags bieten sich an. Viele Leute haben mittlerweile Handys mit NFC-Reader, NFC-Writer drauf, aber verwenden sie für nichts. Dabei kann man damit wirklich coole Geschichten machen. Zum Beispiel, ich hab das so gemacht bei mir. Ich hab nebenbei ein Bett einliegen, wenn ich das Handy da drauflege. Trigger, ich meine, Max geht ins Bett, Automatisierung. Und was ich auch ganz cool finde, beispielsweise, wenn ich im Klo bin, dann hab ich in der Tonne, wo das Klopapier drin liegt, hab ich auch einen NFC-Tag. Wenn ich da mein Handy dranhalte, geht der Heizlüfter an, dass es mir nicht an der Arsch friert. Na gut, der Arsch friert es mir eventuell schon, weil der ist ja im Klo, aber das ist drumherum nicht friert, ihr wisst, was ich meine. Das Ganze sieht dann so aus, ich hab das ja auch letztens mal auf Twitter gepostet. Hier, NFC-Tags, da sieht man das Ganze. Oh, Alter, ich bin blind hier, ich seh nichts. Genau, guck, da ist der Lüfter. Jetzt ist Twitter kaputt. Doch, das Klo ist beheizt. Das Wasser ist beheizt, die Klobrille nicht. Genau, da hängt der NFC-Tag. Das iPhone hat auch einen Writer eingebaut. Die können eigentlich alle Texts Writen und Readen. So, da ist der NFC-Tag, Handy dran, Shortcut, das ist halt die App von iOS, die dafür zuständig ist, Detektet und zack, geht der Heizer an. Habt ihr das gesehen? Zack, wieder aus und zack, wieder an. Und das Ganze funktioniert nur, weil ich hier hinten... Alter, Twitter, please. Das Videoplayer-Feature von Twitter ist schon ganz schön schlecht. Ja, hier hinten hab ich halt so eine Steckdose, die ich übers WLAN ausschalten kann, was halt übers iPhone dann getriggert wird, über meine Heimautomatisierung. Aber man kann auch andere Sachen machen. Man kann beispielsweise, wenn man in die Tür reinkommt, irgendwas einschalten. Oder wenn man irgendwas hat, wo man... Oder Nachrichten verschicken oder sonst was. Oder wenn man rausgeht, dass man irgendwie noch mal einen Report bekommt, was vielleicht noch offen ist oder so. Damit kann man quasi Sachen triggern wie mit einem Knopf, nur dass man keinen Knopf braucht, das ein Bruchteil von einem Knopf kostet, und man damit halt richtig coole Sachen machen kann. So, und Leute, die gerne, also die Technik interessiert sind, die gerne ein bisschen basteln, ist das eine super Geschichte. Zumal es hier ein komplettes Set gibt. Das gibt's bestimmt auch noch viel billiger. Also du hast alle möglichen Sachen dabei. Du hast ein paar Karten dabei, du hast ein paar Sachen zum Aufkleben dabei. Du hast ein paar magnetische Sachen dabei. Du hast ein paar Sachen zum Umhängen oder dranhängen oder sonst was. Noch ein paar magnetische. Wunderbar. Also ein NFC-Techset kann man immer mal gut verschenken und damit kann man auch viel machen. Kann man die eigentlich auch mit Fritz-Deck-Steck-Dosen kombinieren? Wie stellst du dir das vor? Also was zum Beispiel? Nochmal wegen Battlefield 3, das gibt es ja aktuell. Jaja, ich hab's ja vor zwei Tagen oder so im Stream gespielt, richtig die Noobs gebashed wieder, obwohl ich selbst schon eben nicht mehr gespielt hab. Der 1.07, das gibt's bis zum Januar, gibt's das auf Twitch Prime kostenlos. Ich mein, wenn du dein Fritz-Deck in der Heimautomatisierung drin hast, dann kannst du natürlich das kombinieren. Das ist ja gerade der Sinn davon, wenn du so ein Heimautomatisierungssystem verwendest, wie Home Assistant zum Beispiel, da machst du dann ein Fritz-Deck-Gedöns rein und sonstige Sachen. Du kannst auch mit dem NFC-Tag deine Heizung triggern oder so. Gar kein Problem, das funktioniert. Genau, dann noch eine Idee. Da will ich euch jetzt nichts Spezielles vorschlagen. Wo man dran denken muss, ist, aktuell gerade für Leute, die in technischen Berufen arbeiten, die werden zum größten ein Homeoffice machen. Und die meisten, zumindest kenn ich das von meinen Kollegen auf der Arbeit, haben einfach eine scheiß Webcam oder gar keine Webcam. Das heißt, wenn ihr da einem einen gefällt, die halten das auch nicht für notwendig, wenn ihr da jemanden einen Gefallen tun wollt, kauft ihm eine Webcam. Kann auch irgendeine billig logitärische Webcam sein. Muss nix, muss nix, muss nix Gescheites sein. Irgendwas, was lieferbar ist. Also hier nix, nix für, das ist viel zu teuer. Irgendwas anderes, irgendwie so billig, billig logitärisch crap. Es ist allemal besser, als wenn die Leute diese komischen Dinger verwenden, die teilweise im Notebook eingebaut sind und so einen Scheißwinkel haben, dass du ihnen halb in die Nase guckst. Also ich machs anders. Ich machs anders. Ich nehm immer mein iPhone und stell das hier neben an den zweiten Monitor, so unten drauf, und mach das anders. Natürlich dann richtig gute Qualität. Aber so eine einzelne Webcam ist für die meisten Leute, denke ich, nicht verkehrt. Ja, ich würd da auch nicht übertrieben viel für ausgeben. So. Und wie gesagt, ich kenn's von meinen Kollegen auf der Arbeit. Informatik-Kurs sind ja prinzipiell faul. Und man sagt auch mal ganz schnell, braucht man nicht, aber in Wirklichkeit freut sich jeder trotzdem, wenn er eine Webcam hat. Kinect V2, oh, das ist ein riesen Ding. So. Und weil der Chat das unbedingt sehen wollte, ja, man kann einem vielleicht auch zu Weihnachten LED-Strips schenken, wenn jemand wirklich auf Beleuchtung und Heimautomatisierung und Bastelkram in der Richtung steht. Kann man machen. Da würde ich euch aber empfehlen, nicht die billigsten Strips zu nehmen, wenn ihr sie einem schenken wollt, der bastelt. Also ich hab zum Beispiel einmal die hier, aber die finde ich sind gar nicht so gut. Das sind die, die ich beispielsweise hier jetzt am Fenster hab. Aber wenn ihr einem was Gutes tun wollt, der gerne bastelt, unter anderem mit LED-Strips, und normalerweise würde ich es gar nicht hier reinnehmen, weil LED-Strips sind zwar sehr Spezielles, aber der Chat wollte es, ja, kann ich euch als LED-Strips die hier empfehlen. Die sind eigentlich deutlich besser, weil das sind RGB-W-Sticks 5V. Also sprich, natürlich seit der Tüte, der Chat ist immer schuld. War das schon jemals anders? Das Gute an denen ist, die haben wie gesagt 4 LEDs drinnen. Die haben rot, grün, blau und eine weiße LED drin. Das heißt, sie kriegt schönere Farben hin und komplett hell, braucht auch nicht so viel Strom und dementsprechend brauchen wir doch kein riesiges, fettes Netzteil. Also wenn ich einen LED-Strip verschenken wollte, was ich nicht machen würde, ehrlich gesagt, aber als der Chat wissen wollte, dann würde ich so einen hier nehmen. Kannst du was überfehlen, dass ich über den Winter meine Heizung überwachen kann? Du willst mich debaten, meine Heizungsüberwachung zu zeigen, kann das sein? Ich weiß nicht, ob ich euch schon mal meine Überwachung gezeigt habe von der Heizung, wo man sich zum Beispiel angucken kann, wann der Brenner brennt in der Heizung, wie warm die Abgase von der Heizung sind, wie die Pumpe pumpt, welche Temperatur der Kessel hat, ob es einen Fehler gibt, was die Wassertemperatur sagt. Ja, weiß ich, ob ich euch das schon mal gezeigt habe, ich glaube, das habe ich euch noch nie gezeigt. Jetzt habt ihr es auch mal gesehen. Und nein, es geht nicht mit jeder Heizung, weil ihr erstmal was braucht, was eure Heizung auslesen kann. Was hältst du davon als Webcam? Wahrscheinlich nichts, weil die Blackmagic-Sachen halt übelst teuer sind, ne? Ja, genau, war klar, dass sowas kommt. Was ist das eigentlich für Big Brain Musik gerade? Ach nee, das ist immer noch Mario Galaxy, ne? Ach, das ist Bowser, das ist das Bowser-Level. Kannst du einen Lötkolben empfehlen? Ja, kann ich, aber der ist nicht für Weihnachtsgeschenke geeignet, weil der ist ein bisschen teuer. Es sei denn, du hast zu viel Kohle, willst du dann was wirklich Gutes schenken? Dann kann ich das Ding empfehlen, das ist Massive Pock. Das ist richtig gut, das Teil. Aber ist vielleicht jetzt nicht so im Budget für Weihnachtsgeschenke. Mit welcher App kann man das iPhone als Webcam benutzen? Gibt es ein paar? So, musst du mal rumgucken, so einfach mal nach iPhone App RTSP, wenn du es im OBS verwenden willst oder in irgendeinem Player. Ansonsten, in Teams brauchst du das gar nicht, in Teams kannst du einfach in ein Meeting mit zwei Geräten joinen und dann brauchst du es nicht, dann stellst du das iPhone unten hin, joins in Teams Meeting und am Desktop mit dem Headset joins du ins Meeting. Ok, so, kommen wir mal zurück. Auch eine Sache, die mir sicherlich Bastlern gefällt ist, zumindest Bastlern, die ein bisschen, und gerade im Gaming Bereich ist RGB-Beleuchtung auch voll angesagt, als RGB-Klübieren, wobei es sind ja keine Klübieren, als RGB-LED-Lampen kann ich die Dinger hier empfehlen, allerdings vielleicht nicht unbedingt bei Amazon kaufen, die sind ein bisschen teuer. Das ist die teuerste von denen, ich meine, 55 Euro für so eine Lampe ist schon ein bisschen übertrieben, aber die Dinger sind auch wirklich gut. Du hast RGB-Beleuchtung, könnt ihr mal gucken, die gibt es noch für einen Zehner bestimmt billiger, irgendwo auch im Angebot, da habt ihr 1200 Lumen, also das ist relativ hell für so eine Lampe, also heller also die 0815 Lampe, die man an der Decke hat auf jeden Fall. Ihr könnt sie übers WLAN verwenden, ihr könnt sie in die meisten Heimautomatisierungssysteme einbieten, wie gesagt RGB und Weiß drinne, und eignet sich halt dadurch ganz gut für Bastler, weil du es in die meisten Systeme einbinden kannst. Und gerade wenn man Bastler und Gamer ist und vielleicht auch noch ein bisschen auf RGB steht, sei es jetzt mit RGB-Tastaturbeleuchtung, Grafikkarte, sonst was, ist es natürlich nochmal extra nice, wenn man dann passend dazu auch noch die RGB-Beleuchtung machen kann. Und da kann ich die Dinger hier eigentlich empfehlen. Es gibt noch die bisschen übertriebene Variante, es gibt noch die Plus-LED, die hat noch ein Infrarot dabei, falls man irgendwie eine Kamera hat mit Nachtsicht, aber haben die meisten Leute ja nicht. Reldys kann ich dir nicht sagen, habe ich nicht, habe ich keinen von beiden. Also was ist das für eine Question, zeige ich mal her. Ist es theoretisch möglich, an seine normale Türstellung, an das Kabel vom Aufmachen der Haustür ein Arduino anzuschließen und damit... Das ist theoretisch möglich, kommt auf die Anlage an, kommt drauf an, welche Spannung da drauf ist. Gehen tut das, ja bestimmt, kommt halt drauf an. Meistens sind es 12 Volt bei diesem Türzeug. Ja, du kannst bei Home Assistant direkt gucken. Also die Frage ist, ob man irgendwie erkennt, welche Geräte gut mit der Heimautomatisierungsgeschichte zusammen funktionieren. Also du kannst hier direkt bei Home Assistant gucken, was die Native unterstützen. Und wenn das da drin ist, dann ist die Chance doch wirklich hoch, dass es funktioniert. Wenn du irgendwelche Sachen über MQTT oder sonst wie verwendest, musst du gucken. Und gerade beim Flashen von China-Geräten ist das immer so ein bisschen tagesabhängig. Weil die machen manchmal aktuelle Firmwares drauf und dann geht es wieder nicht. Und so, da muss man halt gerade gucken, was da angesagt ist. Da kann man jetzt nichts pauschal empfehlen. So, und für TASMOTA gibt es diese Liste. TASMOTA ist Custom-Firmware für China-Geräte. Da kannst du hier gucken, was da unterstützt wird. Da stehen auch die meisten der Geräte drin, die wir hier schon mal im Stream drin hatten. Zum Beispiel die berühmte Kogi-Gesteckdosenleiste ist da auch drin. Mit den passenden Settings für TASMOTA. Aber da würde ich auch von Absehen sowas zu Weihnachten verschenken, weil man eben nicht weiß, ob es sich aktuell noch flashen lässt. Und ich will keine China-Clouds-Sachen verschenken oder empfehlen. Es gibt, das ist, da baitet Elgato ein bisschen. Es gibt mittlerweile auch eine App von Elgato, wenn sich Epoch kennt, das ist G-Bait, Elgato hat das Ding nur gekauft. Was meint ihr, warum das Ding Epoch-Cam heißt? Das ist überhaupt kein Elgato-like Name. Und ich habe das auch schon mal vor einer Weile ausprobiert. Die App, als sie noch nicht Elgato war. Und ich glaube, die wird auch noch immer unter anderem Label irgendwo vertrieben. Oder vielleicht sind das alte Versionen oder sonst was. Also das ist keine wirkliche, die haben die nur dazu gekauft. Die gibt es schon eine Weile. Und es scheint auch ganz okay zu funktionieren. Was mir daran halt nicht gefallen hat, ist, warum ich sie nicht verwendet habe, ist, weil du entweder USB an den Computer anschließen musst oder irgendwelche Custom-Triber installieren musst auf deinem Rechner, dass du das ansprechen kannst. Du kannst es aber auch dann über NDI, glaube ich, in OBS machen. Aber ich wollte einfach eine App haben, die ganz normal meine iPhone-Kamera als RTSP bereitstellt. Verstehe ich gar nicht, warum es da nicht mehr gibt. Senderweise Amnesia. Keine Ahnung. Ist das das Neue? Ist das das, was vor irgendwie einem Monat rausgekommen ist? Ich habe noch nicht mal das erste Amnesia gespielt. So, also machen wir mal weiter. Wie gesagt, NFC-Tags habe ich. LED-Lampen haben wir uns auch schon angeguckt. Ja, eine Sache, die ich auch persönlich ganz furchtbar praktisch finde, muss ich noch mal kurz gucken. Ich habe mir irgendwo den Namen kopiert, dass ich es wiederfinde. Diese Dinger hier. Moment. Die da. Und was davon? Ist poggers praktisch, der Kram. Das ist auf der einen Seite Klebeband und auf der anderen Seite ein Reißverschluss. Nee, Matt wie sagt mir nichts. Das ist wirklich enorm praktisch und da freut sich garantiert auch jeder Bastler drüber. Ich habe da schon so viele Sachen dran gepappt irgendwo. Ich habe beispielsweise zwei Schränke für Werkzeuge im Flur stehen und die Sachen, die ein bisschen größer sind in eigenen Boxen habe ich jetzt so gemacht. Der eine Schrank ist ein bisschen kleiner als der andere. Da habe ich hier an die Seite beispielsweise für die Box für den Dremel habe ich hier so zwei Dinger dran gemacht. Einen an die Box, also zwei an die Box, zwei an den Schrank. Und jetzt kann ich das Ding quasi hochkant an den Schrank pappen. Steht natürlich unten immer noch auf. Steht hochkant, nimmt kaum Platz weg und ist relativ fest und kann man einfach wieder abmachen. Die Dinger sind enorm praktisch und da freut sich garantiert jeder Bastler drüber. Wie in jedem Haus hat eine Pflicht. What the fuck, es gibt auf Amazon so viel Crap. Ja, also das ist wirklich nice. Gibt es in unterschiedlichster Ausführung, gibt es auch noch ein bisschen länger. Gibt es auch als Band zum Rollen. Ich habe davon, ich habe da einen ganzen Sack voll. Ich habe mir mal irgendwie so ein paar Packs davon gekauft. Ich glaube diese standartmäßig irgendwie 20 oder so bei, ne 10 Stück sind dabei. Ich habe mir mal irgendwie ein paar Packs gekauft. Ich habe jetzt wirklich so einen ganzen kleinen Sack voll mit diesen Dingern und ich brauche immer mal wieder welche und wenn man sie braucht und man hat sie griffbereit, freut man sich, ist super und kostet nicht viel. Ganz ehrlich, 588, ihr könnt gucken, es gibt es bestimmt noch ein bisschen billiger. Ist ein super Geschenk und geht auch nicht so großartig ins Geld, freut man sich drüber und kann man immer gut gebrauchen. So, next. Oh, ist die Musik vorbei. Nein, war wieder von vorne. Die sind wirklich praktisch. Da gibt es so die üblichen Sachen, die man auch immer empfehlen kann für Technikleute. Da will ich jetzt aber nichts spezielles zeigen. Klar, es gibt noch zig USB Adapter. Es gibt beispielsweise USB Adapter, die auf Mini-USB, auf USB-C und auf Lightning gehen. Sowas ist auch ganz nützlich. Die quasi 3 in 1 sind. Sowas ist ganz nützlich. Dann gibt es auch diese Sachen mit Magnet vorne. Da habe ich auch eine für mein Tablet zum Aufladen, aber ganz ehrlich, ich fand die am Anfang richtig cool, weil du konntest halt den Auflader drin lassen und musstest den Auflader nie anstöpseln, sondern konntest einfach das ranklippen ans Tablet. Aber mittlerweile stört es mich, weil man nichts anderes mehr in den Auflader reinbekommt. Also ihr seht ja, was ein bescheuertes Bild, Alter. Also da sind magnetische Kabel. Du lässt dieses Teil immer im Gerät stecken und dann kannst du magnetisch hier die Sachen dran machen. Fand ich immer ursprünglich sehr nice. Mittlerweile stört es mich, weil du hast halt permanent... Achso, ich benutze das eh nur zum Aufladen. Du hast halt permanent dieses Teil hier im Tablet oder im Smartphone stecken und du kannst dann nicht, wenn du mal am Rechner bist oder auf der Arbeit bist oder woanders bist, mal schnell ein anderes Kabel dran machen und musst immer das hier rauspulen und gucken, dass du es nicht verlierst. Ist nicht so geil, wie ich es ursprünglich fand. So, aber was tatsächlich immer praktisch ist, sind solche Dinger hier. Also USB auf Mikro-USB, USB-C und Lightning. Sowas kann man immer gebrauchen. Kostet auch nicht viel und man freut sich garantiert drüber, wenn man es braucht. So, da gibt es natürlich noch so Sachen wie Noise-Canceling-Kopfhörer, wo man sich gerade aktuell drüber freut, aber das ist ein bisschen teurer, das würde ich auch nicht empfehlen. Alsein, man hat viel Kohle und will einem irgendwas für 200 Euro schenken. So, dann noch eine Sache zu Werkzeuge. Ähm, das Ding ist immer mal wieder im Angebot bei Amazon, bestimmt auch zu Weihnachten irgendwann mal, dass der kleine Bosch Akkuschraube mit Zubehör, du kriegst quasi die üblichen, kriegst ein Bitset dabei, Holz- und Metallbohrer, Holz- und Steinbohrer sind es glaube ich, sonst war es nicht. Zwei Akkus, auch wenn man hier nur ein Akku sieht, normalerweise sind es zwei Akkus. Ladegerät und das Ding ist wirklich nice. Also, das habe ich auch jetzt schon über ein Jahr und ich habe damit schon Löcher in die Wand gebohrt, Löcher in Holz gebohrt, sogar mal Löcher in ein Loch in einen Baum gebohrt, frag mich nicht warum, aber ich habe ein Loch in einen Baum gebohrt. Hat keinen tieferen Sinn gehabt. Ähm, zig Dinger geschraubt, gemacht, also der ist wirklich gut. Und man sollte sich davon den 12 Volt gar nicht so abschrecken lassen, wer denkt, dass man damit nicht viel machen kann, soll sich mal auf YouTube so ein paar Tests davon angucken, da hat man wirklich ordentlich Wumms dahinter, auch wenn da nur 12 Volt drauf steht. Und der Vorteil ist, diese 12 Volt Akkus kann man auch für viele andere Sachen von Bosch verwenden, wenn man dann eben Bosch mag, also sprich, wenn jetzt jemand einer schon, was weiß ich, das ganze Makita Akkuset hat oder Milwaukee oder sonst was, dann lohnt sich jetzt natürlich nicht, dem dann einen Bosch 12 Volt Akkuschrauber zu schenken, weil wahrscheinlich hat er das auch schon. So, ähm, was auch ganz nützlich ist, wenn man das hat, die haben auch so einen 12 Volt Licht, finde ich auch sehr praktisch, das Ding hier glaube ich, also wenn ihr jemand habt, der schon 12 Volt Akkus von Bosch hat, finde ich das hier auch echt nützlich, das macht saumäßig hell, funktioniert mit dem gleichen Akku wie der 12 Volt Akkuschrauber, also mit den ganz normalen Bosch Akkuschrauber Akkus und ist praktisch, also man kann das entweder auf die Seite legen, man kann es hinstellen auf dem Akku, man kann es auf die Seite legen in zwei verschiedene Kippstufen und hier oben hat man noch einen Haken dran, wenn man es mag, ja, ähm, manch einer wird sagen, kostet mehr zu viel für eine Licht. Kann ich den Akku für meine USB, nein, das kannst du nicht machen, oder hast du eine 12 Volt USB, dann kannst du viel Adapter bauen. Das Problem immer beim Akkuschrauber, wenn wir ihn brauchen, ist er leer, ja, das Gute ist daran, diese Akkus halten ziemlich lang, weiß ich, was die für eine Entladung haben, aber die halten wirklich ordentlich, ich hab den jetzt teilweise mal ein halbes Jahr rumliegen gehabt, nicht verwendet und dann war der Akku immer noch okay und du hast bei diesem Standard Set hast du zwei Akkus dabei, weiß nicht, ob das beim Amazon Set dabei ist, bei dem Set, was ich mir gekauft habe, auf jeden Fall zwei Akkus dabei und ich würde das auch nur kaufen mit zwei Akkus, sonst sackts. Das ist nice. Marc LDM, acht Monate, Dankeschön für den Sub. Massive Subcription hier. Ich hoffe, ich hab nicht so viele Subs übersehen, weil ich war gerade ziemlich vertieft in Amazon. Cool, wir sprechen Amazon, Amazon aus und wir sprechen auch Ubuntu, nicht Ubuntu aus, sondern Jubantu und Jira nicht Jira, sondern Jira und Git-Jit und ja, wir sind ja auch nicht agil, sondern agile. Okay, ich hab nix übersehen. Jetzt erst mal zwei Minuten dummes Zeug gelabert, okay, wo können wir weitermachen? Also das finde ich ist auch eine ganz gute Kombination, der, und Router natürlich, nicht Router, Router, Router, der Akkuschrauber ist natürlich ein bisschen teuer, aber wie gesagt, so eine Lampe zum Beispiel, wenn man jemanden kennt, der schon die Bosch 12V Akkus hat, ist das mit der Lampe ganz nice. UniFi Access Points sind an sich ein super Geschenk, aber eigentlich viel zu teuer. Das sind zwar mit die besten für den Heimbereich, so mit die besten Access Points, aber mal ganz im Ernst, 146 Euro für Weihnachtsgeschenk ist schon eine Hausnummer, da muss man jemand schon ganz besonders mögen oder zu viel Geld haben. Aber die Dinger sind immer Pock. Gerade, gerade, ähm, neues UniFi Update ist unschrecklich, ich hab schon ein halbes Jahr nicht mehr geupdatet, funktioniert alles wunderbar. Holt euch die APAC, was für ein Ding, klingt eher nach MikroTik vom Namen her. Ah, das sind die Alten, ja das sind die Alten, genau, da hab ich einen von, ich hab einen davon und einen Nano, der Unterschied war glaube ich, dass der Nano mehr 5GHz Antennen hat oder irgendwas in der Richtung, ich krieg's nicht mehr zusammen aus dem Kopf. Was die sind im Angebot? Aber die Dinger sind wirklich nett, gerade vielleicht wenn man sogar jemand hat, der schon eins, zwei davon hat und irgendwie noch sagt, ich werd ja so gerne auch auf der Terrasse WLAN und wenn man den dann sehr mag, kann man ihn vielleicht einschenken, die Dinger sind auf jeden Fall gut. UniFi Lite, oh guck mal, die kenn ich noch gar nicht, zeig mal her. Ach ja. Da ist ein PoE Adapter dabei. Dann ist es tatsächlich ganz nett, ich hab da halt keine Erfahrungswerte drinne, kann ich nicht sagen, aber wie gesagt, ich hab einen, ich hab einen, ich hab einen, ich hab einen, kann ich nicht sagen, aber wie gesagt, ich hab einen AC Pro und einen Nano HD und sind beide super. Was ich ja persönlich am AC Pro ziemlich gut fand, ist, dass der einen zweiten Netzwerkanschluss hat zum Durchreichen. Ja, also, gucken wir mal ob es davon ein Bild gibt, sieht aus wie ein Feuermelder. Ja, dementsprechend, man sollte die auch an der Decke installieren. Ja, guck mal. Der AC Pro, der hat zwei Netzwerkanschluss unten. Der Nano HD hat das auch nicht. Das fand ich ehrlich gesagt ganz nützlich, weil du kannst dann hier beispielsweise machst du dann dein, nennst du mal, Uplink rein, auch mit PoE und allem und hier kannst du noch beispielsweise Raspberry Pi oder so anschließen. So hab ich das unten bei mir im Zimmer liegen. Da liegt der Access Point und daneben ein Raspberry Pi, der sogar noch über das USB versorgt wird. Allerdings, das würde ich nicht machen, weil der USB Port dafür überhaupt nicht gedacht ist. Der liefert auch ein bisschen zu wenig Strom, der Raspberry Pi ist schon die ganze Zeit am schreien und den sollte ich mal woanders reinstabseln. Ja, und ich hab gesagt, wie gesagt, das liegt bei mir rum. Ihr solltet die auch nicht auf den Boden legen oder auf den Tisch legen oder so. Die werden nicht umsonst immer an der Decke gezeigt. Die Dinger sind auch von der, wie das abstrahlt von der Charakteristik, die sind eigentlich dafür gedacht, dass man sie an die Decke macht. Es funktioniert aber, wenn man sie hinstellt auch, aber besser funktionieren sie, wenn sie an der Decke sind. Und das Kabel hängt dann von der Decke her, da kannst du dir ja mal überlegen, was du machst dagegen. Ich mein, ein bisschen gewisse, gewisse Kreativität, wenn man sich so was hinbaut, den besten Ort zu finden, sollte man schon haben, bevor man sich sowas kauft. Ich meine, entweder hast du schon was durch die Decke laufen, wo du das von abmachen kannst, oder machst dich an die Decke, stellst dich irgendwo hin, hast vielleicht irgendwo einen Kabelkanal, gibt es ja verschiedenste Möglichkeiten. Aber wie gesagt, die sagen selbst, die sind für die Installation an der Decke gemacht. Ich hab sie aus dem Grund auch nicht bei mir an der Decke, weil ich keinen Bock hab, durch die Zwischendecke ein Kabel zu legen. Bin ich zu faul für. Aber wie gesagt, ein bisschen Kreativität braucht man da schon, wie man das am besten anbringt und wo man gerade dabei ist. Dann freut man sich, wenn man sich den Bosch 12V Akkuschrauber gekauft hat, bei Amazon, den ich vorher gezeigt hab, dann kann man das nämlich auch wunderbar installieren. Oder jedem x-beliebigen anderen Akkuschrauber geht natürlich auch. Chaotix, Twitch Prime, Dankeschön, Massive Subscriptions hier heute. Ich bin ja schon gesponsert bei allem, wenn man das so will. Von Vera, von Bosch und sonst wie. Nee, ich verdiene nichts davon. Es wird doch mal Zeit, dass ich gesponsert werde. Ich sollte dafür eigentlich was verdienen. So, und jetzt nächste Sache ist, ich hab schon ganz oft gesagt, aber das könnt ihr wirklich machen für jemand, der kein Tablet hat, vielleicht auch für jemand, der keine Tablet hat, vielleicht auch für jemand, der keine Tablet hat, vielleicht auch für jemand, der schon ein bisschen älter ist und das nicht so den Bezug zu hat, aber wo ihr denkt, ey, meine Oma sollte sich unbedingt mal mit einem Tablet ein bisschen rumspielen oder so, dann kauft ihr einen Fire HD 8, wenn es billig sein soll, und entamazonifiziert das. Ihr müsst abwarten, bis es billiger ist. Es ist gerade zu teuer. Ihr müsst auf die Angebote an Weihnachten warten. Da kostet es nämlich nur 50 Euro. Ihr wartet, bis das Fire HD 8 50 Euro kostet. Dann kauft ihr das eurer Oma und löscht alles von Amazon mit der passenden Software dazu. Und dann hat die Oma preisleistungsmäßig das beste Android Tablet, was es gibt. Ich meine, für 50 Euro, das Fire HD 8 ist mit Sicherheit nicht schnell im Vergleich zu anderen Tablets. Das scheißt gegen jedes iPad selbstverständlich ab. Aber für 50 Euro im Angebot, muss man sich mal überlegen, kriegt ihr einen Tablet, was man benutzen kann. Mehr kann man ja für 50 Euro auch echt nicht erwarten. Und dann kauft ihr das. Und ihr müsst auf jeden Fall warten, bis das im Angebot ist, dass es wieder 50 Euro kostet. Ansonsten lohnt sich das nicht. Ja, mal abwarten, mal abwarten, was da noch kommt. Mit Amazon Smart Plug. Was denn? Warum? Iiiih, es wird ja immer schlimmer. Also für den Preis lohnt es sich halt gar nicht. Aber es kostet halt manchmal nur 50 Euro, wenn Amazon wieder ihr Zeug verkauft. Und dafür lohnt es sich richtig. Beste. Also preisleistungsmäßig ist das Fire HD 8, wenn es im Angebot ist, das beste Tablet, was ihr kaufen könnt. Und ihr müsst halt da vorher ein bisschen Amazon Zeug von drunter machen. Sonst funktioniert es nicht. Hast du eine Empfehlung für ein günstiges Nas oder würdest du dafür eher einen Raspberry Pi? Nein, auf gar keinen Fall. Gar kein Fall. Raspberry Pi sackt. Besser als das HD 10 preisleistungsmäßig auf jeden Fall. Und für die Oma auch ein bisschen handlicher. Allerdings mag die Oma vielleicht auch große Schrift. Und wenn ihr zu Weihnachten ein Angebot für, wenn ihr den Fire HD 10 bekommt für 85 Euro, ist das auch super. So, gerade zum Einstieg ist es halt die Sache, wenn man nicht so genau weiß, möchte man jetzt viel Geld geben oder nicht. Ist es mal nicht verkehrt. Empfehlung für Nass habe ich nicht. Kein Nass, kein Fertig Nass bei mir, weiß, kann ich nichts zu sagen. Aber wahrscheinlich kannst du jedes sein Knowledge, die Dinge kaufen. Die Dinge funktionieren wohl ganz gut. Aber einen Raspberry Pi würde ich auf keinen Fall empfehlen. Der Raspberry Pi ist einfach nicht gemacht für Nass. Die haben leider an der Krypto-Extension für die CPU gespart. Wahrscheinlich ist die entweder nicht eingebaut oder nicht lizenziert. Dementsprechend kannst du einen Raspberry Pi Nass komplett vergessen mit Verschlüsselung. Und einen Nass ohne Verschlüsselung zu betreiben ist ein bisschen doof, weil da kannst du deine Festplatten beispielsweise gar nicht wegschmeißen. So ohne weiteres. Da musst du deine Festplatten quasi erst mit Anstöpsel, deine Festplatten leeren. Will man ja eigentlich nicht. Also wenn man einen Nass hat, sollte man das schon voll verschlüsseln können. Und auch per Performant voll verschlüsseln können. Ansonsten ist die, ja es ist nicht angenehm. Nee habe ich nicht. So. Ja. Dann noch eine andere Sache, die es leider gerade nicht mehr bei Amazon gibt, aber die wirklich nice ist für Leute, die ein bisschen basteln. Und Leute, die ein bisschen basteln, die freuen sich über sowas. Ein Switch-Bot. Weiß nicht, ob ich euch das schon mal gezeigt habe. Ich habe mir mal zwei Stück bestellt, als es die bei Amazon gab. Die Dinger sind richtig nice. Gibt es da kein Video von? Ich zeige es euch mal. Die Dinger sind richtig nice. Genau, hier sieht man es. Guck, habt ihr es gesehen? Moment. Habt ihr gesehen, was das Ding macht? Das ist ein Schalter, den man den Remote-Schalter schaltet. Hallo, Alter, Twitch. Nee, YouTube, was macht ihr da? Guckt mal. Seht ihr das? Ein Schalter, den den Remote-Schalter schaltet. Richtig poggert das Teil. Ja, und man kann es sogar umgedreht machen. Hier sind so kleine Pads, die er hier auch gerade zeigt. Damit kann man das dann umgedreht schalten. Also quasi, wenn es wo dran geht und du willst es wieder raus machen, den Schalter, geht auch. Dann kann man so ein Pad hier dran machen. Ja, die Dinger sind richtig geil. Und jeder, der bastelt, freut sich über sowas. Leider gibt es die gerade nicht bei Amazon. Guckt, man sieht es hier vielleicht nochmal. Achtung. Hallo. Ja, auf, zeig uns nochmal, wie es schaltert. Alter, was macht ihr denn da? 30 Milliarden Videos anstatt es einfach mal kurz das Ding zeigen. Hier, jetzt hier sieht man es gut. Guckt euch das mal an. Das ist richtig pogg. Okay, die übertreiben es jetzt ein bisschen hier gerade. Aber so funktioniert das. Das ist ein Schalter, der andere Schalter schaltet. Dafür lohnt es sich nicht. Und ich weiß auch ehrlich gesagt nicht, wie lange die Batterie hält, aber es ist eine super leise Spielerei. Und die sind auch gar nicht so teuer. Ich habe die, glaube ich, für 20 Euro oder so bestellt damals. Was kosten die mittlerweile? Ja, 24 Euro. Ja, da freut sich auch jeder Bastler darüber. Die sind cool. Das ist gar nicht mal so einfach selber zu bauen. Na ja, wenn es einem nicht wert ist, dann nicht. Das ist WLAN. Und so mal WLAN. Man kann die offizielle WLAN verwenden zum Bedienen oder man integriert in seine Heimautomatisierung, was auch problemlos geht. Switchboard, Home Assistant, Switchboard Plattform, zack, funktioniert. So, das ist auch so ein Ding, was ich empfehlen kann. Freut sich jeder, der bastelt darüber. Und es ist eigentlich ein richtig nicees Gadget. Und für 24 Euro liegt es auch noch im Rahmen für Weihnachtsgeschenke. So, das nächste, auch eine Sache, wo kaum einer weiß, dass er das haben will. Aber er will es haben und zwar Micro SD von Samsung Endurance. So, wer beispielsweise einen Raspberry Pi hat oder meinetwegen auch Photos oder sonst was macht, ich weiß nicht. Aber gerade für Raspberry Pies, die Dinger sind Poggers, weil ich habe schon so viele normalen kack billig Micro SDs geschrottet, weil die einfach Müll sind, weil das Schlechteste vom Schlechtesten verbaut ist. Holt so ein Ding und ihr kriegt es nicht kaputt. Gerade wenn man jemanden hat, der beispielsweise ein paar Raspberry Pies drin hat, das da ist das Ding, was man rein machen sollte. 32G Samsung Endurance Micro SD Karte. Also, wenn ihr jemanden kennt oder jemand seid oder wie auch immer, der bastelt und ab und zu mal Micro SD Karten braucht, holt das Ding. Das kostet zwar ein bisschen mehr wie normale Micro SD Karten, aber das kriegt ihr nicht kaputtgeschrieben. Und das ist wirklich Endurance. Das funktioniert. Und kaum einer weiß, dass es irgendwie extra special haltbare Micro SD Karten gibt. Denkt immer man muss da mit diesen billig Kingston Dinger rumhantieren für 250, die nach zwei Monaten kaputt sind. Also, die sind leist. Ja, dann auch noch ein Ding, was auch. Ups, ich stehe gerade mit dem Stuhl auf meinem Kopfhörer. Warte mal, das ist jetzt nicht so. Low-Brain-Champ. So. Dann eine Sache, die auch immer praktisch ist. USB auf SATA Adapter. Da müsst ihr mal gucken. Das kann auch was billiges sein. Warum ich das sage mit USB auf SATA Adapter ist, mittlerweile hat jeder daheim SSDs rumfliegen, weil SSDs sind schon jetzt bestimmt zehn Jahre am Start. Und die ersten paar SSDs, die sich die Leute gekauft haben, teilweise mit 32G oder so, die sind mittlerweile ausgemustert. Und weil wir es gerade von besonders haltbaren Micro SD Karten hatten. USB-Sticks sind das Schlimmste, was es gibt. USB-Sticks, ich weiß nicht, was die Hersteller drin verbauen, aber wirklich findet mal USB-Sticks, die zuverlässig sind. Also sprich, wo du dich auch darauf verlassen kannst, dass der nächste, den du dir kaufst von der gleichen Serie, wieder was taugt. Also USB-Sticks sind zum größten Teil absoluter Müll und es gibt nichts besseres als USB-Sticks wie eine alte ausgemusterte SSD. Ist einfach so. Dagegen kackt jeder USB-Stick ab. Und das Beste, was man sich da kaufen kann, ist einen billigen SATA auf USB-Adapter. Und man hat zu den besten USB-Sticks, den es gibt. Weil ausgemusterte SSDs hat mittlerweile jeder daheim liegen. Oder fast jeder. Ich weiß nicht, Chat, Chat, ich weiß nicht, wie es bei euch aussieht. Aber ich habe beispielsweise hier noch alte 32G-SSDs, die ich mittlerweile exklusiv als USB-Sticks verwende. Ich habe hier alte ausgemusterte 32G-SSDs, die ich mittlerweile hier exklusiv als USB-Sticks verwende. Und die sind auch voll AliExpress. Das ist China Zeug. Also wenn ihr Zeit habt, könnt ihr die bei AliExpress bestellen. Allerdings wird es dann zu Weihnachten, je nachdem, ein bisschen mehr. Und gerade dafür ist das eigentlich das Beste, was man machen kann oder was man einem holen kann. Jeder hat ausgemusterte SSDs. SATA auf USB. Ich habe übrigens auch von AliExpress bestellt. Ich habe irgendwie mal einen 5er-Pack oder so bei AliExpress bestellt. Das Beste hätte ich mir schon viel früher kaufen sollen. Aufhören mit USB-Sticks rum zu hantieren. Ja, so. Weiter weg, wo wir gerade dabei sind. Ich würde euch nicht empfehlen, ich weiß, dass viele sowas gerne machen, aber ich würde es euch nicht empfehlen. Ich würde euch nicht empfehlen, wenn ihr nicht selbst aus dieser Richtung seid oder wenn ihr nicht sehr genau Ahnung habt, was einer will. Es gibt jede Menge lustige, in Anführungsstrichen, Informatiker-T-Shirts oder Technik-Sachen. Es gibt für jeden Beruf eigentlich irgendwie so ein bisschen witzige T-Shirts. Aber ich kann euch sagen, die meisten Sachen sind ultra cringe und würde ich nicht anziehen. Also wenn ihr Noob seid in dem Bereich, schenkt irgendwie einem Technik-Interessierten oder Informatiker kein lustiges Informatiker-T-Shirt. Wenn ihr selbst in der Materie drin seid, könnt ihr es probieren, wobei ihr dann den Humor treffen müsst von dem jeweiligen Typ. Ist nicht so einfach. Was ich find's witzig, weil ich hab mir letztens hier so ein MonkaS-T-Shirt gekauft. Sowas hier. Das könnt ihr aber auch nicht jedem schenken, ja. Aber das fand ich beispielweise ganz witzig. Das ist auch gut, das gefällt mir auch hier. Das hier gefällt mir auch. Gag wie Emote-Langarm-Shirt. Aber wie gesagt, das ist echt Geschmackssache und je nachdem wie blöd die Sprüche sind. Ihr wisst ja, ein Admin schläft nicht, er ruht. PainsChamp. Also er ruht. Nur für den Fall, der diesen super krassen Witz nicht verstanden hat. PainsChamp. Richtig krasser PainsChamp, oder? Ja. Ja und es gibt sich, es gibt sich so Sprüche in dieser Richtung, die sind nicht lustig. Das heißt, ich würd ehrlich gesagt davon abraten, Leuten so T-Shirts zu schenken. Außer ihr kennt den halt gut oder seid selbst aus dem Bereich und findet das gleiche lustig oder so. So, dann hätt ich noch was für Bastler. Noch zwei Sachen für Bastler. Eine Sache, die man nie genug haben kann, sind Jumperkabel. Und zwar da am besten gleich das Dreier-Set. Nämlich das Dreier-Set mit drei verschiedenen Sorten. Das da zum Beispiel. Davon kann man nie genug haben. Also jeder, der ein bisschen Technik-Grams bastelt, der wird's wahrscheinlich ähnlich sehen. Die Dinger hast du nie genug und im Zweifelsfall findest du sie nicht. Der Chat, es bringt nix, wenn wir hier irgendwelche AliExpress-Vergleiche machen. Wir wollen ja Sachen haben, die noch vor Weihnachten ankommen. Dass die Dinger billiger bei AliExpress sind und dass die Dinger wahrscheinlich auch aus China kommen, müssen wir nicht drüber reden. Aber bringt's jetzt ja nett. Aber gerade die Kombination hier, du hast einmal die mit Pins auf beiden Seiten, Pins auf einer Seite und auf der anderen Seite Stecker und hier zweimal Stecker. Wunderbar. Kann man nie genug von haben. Und ist mit um die fünf Euro, das hier ist tatsächlich ein bisschen viel, auch wunderbar. Da kann man die Leute mit erfreuen, weil davon kann man nie genug haben. Und jetzt noch ein Geschenk, was ich wirklich richtig praktisch finde. Für die Ordnung daheim und ist noch nicht mal unbedingt jetzt für Bastler und Techniker, also im Speziellen, kann jeder eigentlich gut gebrauchen und zwar ein Label Drucker. Sowas da zum Beispiel. Kannste alles mögliche mit anfangen. Was weiß ich. Was auch immer. Das ist Reis beschriften oder so. Also wenn man beispielsweise irgendwelche Schubladen hat, ich habe beispielsweise im Flur in den Schränken ein paar Schubladen, wo ich mein Zeug, Kleinkram drinne habe. Da habe ich dann auch auf der Schublade drauf stehen, so ein Etikett. Man kann sie um Netzwerkkabel beispielsweise wickeln, dass man was drauf sieht. Oder nicht wickeln, so einmal drum legen und zusammen packen. Man kann das bei kleinen Jumperkabel drum herum machen, dass man sagt, ok, das hier ist Crown, das hier ist VCC, das hier ist Pin 1, Pin 2. Die kann man echt für alles brauchen. Ja. Das ist für so ziemlich jeden eine super Geschichte. Gibt eigentlich kaum einen, der das net gebrauchen kann. Sieht antik aus, ja. Ist aber neu, funktioniert gut und kostet nicht viel und hat den Vorteil, dass die Sachen, die man jetzt kauft, dass die mit Papierzeug funktionieren. Die waren früher noch Plastik, also Plastiklabel. Mittlerweile sind das zumindest standardmäßig Papierlabel, was dann auch die Umweltschützer freut. Die gibt es bestimmt aber auch, wenn man das haben will, mit Kunststoff. Aber standardmäßig sind die mittlerweile mit Papier. Das heißt, da kann man sich dann auch auf der sicheren Seite fühlen. Nicht, dass man das einem schenkt oder sagt, sowas verwende ich nicht, ich bin keine Umweltsau. Das weiß ich ja nicht. Keine Ahnung, aber zumindest sind die standardmäßig mit Papier und dann kann sich da keiner aufregen. Es muss auch übrigens nicht der sein, es gibt da zig verschiedene andere, die man sich auch noch holen kann. Den habe ich und ganz ehrlich, 25 Euro sind wirklich super investiert für so einen Label-Trucker. Das nächste, was ich mir aufgeschrieben habe, ist eigentlich relativ offensichtlich. Und zwar jeder Bastler, der noch keinen Raspberry Pi hat, der sollte eigentlich einen haben. Das heißt, wenn ihr jemand seid, der ein bisschen basteln will, noch nicht so richtig angefangen hat, noch keinen Raspberry Pi, es habt ihr jemanden kennt, Raspberry Pi muss immer sein. Ohne Raspberry Pi ist nervig. Also auch viele kleine Sachen, die man so macht, braucht man den als Hilfsmittel. Meinen Staubsauger habe ich damit geflasht zum Beispiel. Und ihr wisst, ich erzähle keinen Scheiß, ich habe euch dann den Staubsauger geflasht gezeigt, sogar das Web-Interface. Meinen Staubsauger habe ich damit geflasht, Steckdosenleisten habe ich damit geflasht, Sachen im WLAN mitgeschnitten, alle möglichen Sachen. Also ein Raspberry Pi ist so ein komplett rundes, rund um Paket, was man braucht. Staubsauger, Web-Interface, ja, hier guck. Exzellent, da ist das Web-Interface. Da ist die Karte von meinem Wohnzimmer. Ja, so muss das sein. So, und wenn ihr noch keinen Raspberry Pi habt oder denjenigen, den ihr beschenken wollt, der hat schon einen, dann ist ein zweiter auch nicht verkehrt, weil Raspberry Pi ist auch so was. Es ist vielleicht nicht ganz so schlimm wie SD-Karten, also du kannst irgendwann schon genug Raspberry Pies haben, aber du hast, also es dauert eine Weile, bis man wirklich genug hat. Wo kaufst du Amazon? Wo kaufst du deinen Raspberry Pi? Ich kauf das meistens da oder bei, oder da. Aber ich denke mal, preislich nimmt sich das gerade jetzt gar nicht so viel. Zero auch wunderbar, ja. 4G, das dürfte ja sein, indem wir bei Amazon auch ausgewählt haben, oder? Oh, guck mal, nee, da ist bei Amazon auch der 4G, okay, passt. Da nimmt sich nichts, da kann man es auch bei Amazon kaufen. Ich würde vorschlagen beim Raspberry Pi 4, das ist überall das gleiche, also ich würde vorschlagen, wenn man sich einen Raspberry Pi 4 kauft oder wenn man einem einen Raspberry Pi 4 schenken will, dann, ich würde zur 4GB Variante tendieren. Erstens, dass es mehr als es beim 3er gibt, also was ja einer der Gründe für einen Raspberry Pi 4 ist, und zweitens ist die 8GB Variante, finde ich, oversized. Also es gibt nicht viel, wo man wirklich 8GB für braucht, und das kostet auch dementsprechend mehr, ja, also man braucht es nicht wirklich. Also 8GB ist eigentlich nicht notwendig. Natürlich, Ausnahmen bestätigen die Regeln, es gibt sicherlich ein paar Anwendungen, wo man davon bestimmt profitiert, aber normalerweise scheitert es nicht am RAM. Und 4GB ist, finde ich, ein ganz gutes Mittelmaß, ja. Und wenn ihr ein bisschen weniger ausgeben wollt, könnt ihr entweder das 2GB Modell nehmen, das ist aber auch gar nicht so viel günstiger, oder aber, wenn einer wirklich noch gar nichts hat, dem könnt ihr auch einen Raspberry Pi 3 schenken, das kostet dann nochmal eine Ecke weniger, hat noch ein bisschen weniger RAM, ja, aber der RAM ist meistens nicht das, was jetzt irgendwie großartig stört bei dem, was man da macht. Und für 33€ ist das auch eine nette Geschichte, wenn man nicht mehr ausgeben will. Also wenn man noch gar nichts hat und einsteigen will und möglichst preisleistungsmäßig gut dabei sein will, würde ich zum 3er greifen, tatsächlich, ja. Wenn du einen Raspberry Pi Desktop bauen willst, ja, das ist ein Raspberry Pi Desktop, Desktop bauen aber auch nur irgendwelche Tryhards, die damit da nichts machen, sondern einfach nur sagen wollen, ich habe einen Raspberry Pi 3 Desktop, Raspberry Pi Desktop. Nass, nass, für nass ist ein Raspberry Pi eh schlecht. Also selbst ein Pi 4 ist als nass, finde ich, was für mich nicht zu gebrauchen. Die hätten man nicht bei der Hardware Krypto-Extension sparen sollen für die CPU, dann wäre es brauchbar. Ja, da würde ich tatsächlich lieber einen Odroid nehmen, wie der Sirius Maxx schreibt, genau, wenn ich einen nass bauen will. Oder man nimmt wirklich, also wenn man einen nass bauen will, wenn man wirklich selbst sich eins zusammen basteln möchte, dann nimmt man eben eine Low-Power-Intel-Plattform. Irgend so eine Low-Power-X86-Plattform kann durchaus auch was sein, wo CPU und Mainboard schon verlötet ist. Irgend so ein Low-End-Vierkern-Ding, das hat kaum Strom, auch nicht so viel mehr als ein Raspberry Pi, 4-5 Watt mehr und hat deutlich mehr Power und ist x86, macht weniger Probleme, hat Krypto-Extensions, flutscht, hat mehr SATA-Anschlüsse, sogar ein PC-Express, nicht ganz so klein, aber da kommt es beim Nass drauf an. Ja, genau. So sieht es aus. Wo wir gerade beim Thema Raspberry Pi sind, wenn ihr schon Leute habt, kennt, die Raspberry Pi haben und damit auch ganz gut am Basteln sind, kauft ihnen, gerade wenn es ein Raspberry Pi 4 ist, kauft ihnen ein ordentliches Raspberry Pi 4 Case. Zum Beispiel ist das Flirck-Case, ist ganz nett, ist ein komplettes Aluminium-Gehäuse, was die Abwärme vom Raspberry Pi ganz gut managt. Der Raspberry Pi 4 wird nämlich relativ warm, oder wenn man zu viel Geld hat, kann man auch sowas kaufen. Die sind auch ganz gut. Aber ich finde das hier cool. Ja, und kommt auch noch vor Weihnachten. So ein ordentliches Case ist nicht verkehrt. Den Intel NUC würde ich nicht kaufen, weil ein Intel NUC keinen PC-Express hat. Also wenn ich mir einen x86 kaufe, dann würde ich tatsächlich einen Low-Power-Intel-Plattform kaufen, der kein NUC ist für einen Nass, weil so PC-Express-Anschluss macht die ganze Sache nochmal eine ganze Ecke flexibler. Du hast die Option auf weitere SATA-Anschlüsse zum Beispiel oder vielleicht sogar einen RAID-Adapter oder eine Netzwerkkarte, wenn dir Gigabit nicht reicht. Deswegen, ich bin da kein Fan von einem NUC. NUC hat zu wenig Anschlüsse für Nass. Hast du einen Tipp für sichere Steckdosen-Leisten? Ich habe einen Tipp für China-Steckdosen-Leisten, die sich flaschen lassen, aber ich glaube, das ist nicht das, was du haben willst. 3D-Drucker ist auch was, was sich sicherlich zu Weihnachten anbietet. Die Sache ist nur die, die sind halt ein bisschen teuer. Also sehr beliebt zum Einstieg ist dieses Ding als 3D-Drucker. Das ist eigentlich so der Einstiegs-3D-Drucker schlechthin, mit dem fast jeder angefangen hat als Einstieg. Aber das geht dann schon ein bisschen ins Geld. Wenn ihr da in China guckt, ist es billiger. Allerdings könnte es ein bisschen eng werden, die Sachen aus China zu bestellen. Ah, so viel billiger ist es aus China gar nicht mehr. Nee, das landet nicht beim Zoll. Das bestellen wir hier. EU-Priority-Mail, alles gut, passt. Guck mal, das kommt sogar aus Spanien, dann ist mit Zoll eh nix. Aber eBay ist sacked. Ich habe auch einen i3-Mega-S für irgendwie um die 200 oder so. Das ist auch poggers, das Teil. Ich habe ja fast den Fehler gemacht, mir den 1000 Euro 3D-Drucker als Einstieg zu kaufen, obwohl ich es gut, dass ich nicht gemacht habe. Ich drucke im Endeffekt nicht so viel und das Geld kann man besser investieren. Aber 3D-Drucker sind halt ein bisschen teure Angelegenheit für Weihnachten. So, dann habe ich mir noch ein paar Sachen aufgeschrieben, die ich auch ganz nützlich finde. Ach so, ja, du kannst natürlich einen Case von Raspberry Pi selbst drucken, aber das bringt dir natürlich nix, wenn ein Raspberry Pi zu warm wird, weil gute Wärmeableitung hat das 3D-gedruckte Zeug natürlich nicht. Wenn du dir so ein fertiges Aluminiumgehäuse kaufst, ist ja schon eine andere Hausnummer als ein 3D-gedrucktes Case. Aber wenn man einfach nur einen Case braucht, dann kann man sich das auch ohne Probleme selbst drucken. Der Killfilm willst wissen. Genau, dann eine Sache, die ich sage jetzt nochmal so ganz allgemein, auch eine Sache, die jeder braucht, vor allem Leute, die Smartphones, Tablets und sowas dabei haben, ist irgendeine ordentliche Powerbank. Da zeige ich jetzt nichts. 50.000, das scheint mir viel zu sein. Ob das wirklich 50.000 mAh sind? So ein kleines Ding? Kann ich mir ehrlich gesagt nicht vorstellen. 20.000 vielleicht, ja. Also ich habe beispielsweise als Powerbank sowas mit Solar-Panel, sowas hier, sowas irgendwie, sowas in der Richtung hatte ich mir mal gekauft und das ist eigentlich ganz nützlich. Zum Nachladen logischerweise nur im Sommer, aber da kannst du, also mit dem Ding, also mit so einem ähnlichen, das ist nicht das, was ich habe, aber mein sieht fast genauso aus, mit dem Ding kannst du ein iPhone schon so 3-4 Mal laden oder so. Mein iPhone hat ja auch einen ordentlichen Akku, was hat denn das iPhone X, was habe ich denn, XR, XS? Ich kann mir das immer nicht merken. XR habe ich, genau. Was hat denn das für ein Akku? SirAppleLot? Ok, 3000, ok. Ungefähr 3000. Ja, dann kannst du das, keine Ahnung, 4-5 Mal mit laden oder so. Aber eine ordentliche Powerbank, ohne Scheiß, ist eines der wichtigsten Sachen, die es gibt. Warum eigentlich ein iPhone? Ganz einfach, weil ich mir das iPhone nicht selbst kaufen muss. Warum soll ich mir ein Smartphone holen, was ich selbst kaufen muss, wenn ich 1000€ Smartphones umkriege? Das muss nett sein. Darf man fragen, was dich vom iPhone überzeugt, obwohl du ja nicht der Folge als Apple-Jünger bist? Ja, weil ich nichts dafür bezahlen muss. Firmen, Handy, Privatnutzen? Ja, genau. So sieht es aus. Ich habe so viele Apple- und Android-Geräte, ich mache da auch keinen großen Unterschied, trotz dazwischen. Also ich bin dafür und ich bin der Meinung, das ist eigentlich das Beste, was man machen kann. Keine Seite zu sehr fanboyen, sondern immer das kaufen oder das nehmen, was für den jeweiligen Anwendungszweck am besten ist. Meiner Mutter habe ich zum Beispiel auch ein iPad geschenkt und ein iPhone SE, weil die Technik noob ist. Ich hatte davor Android-Tablets und mit den Android-Tablets ist die gar nicht wirklich gut klargekommen. Ich habe hier auch ein paar Jahre davor schon ein bisschen besseres Asus-Android-Tablet damals gekauft. Mit dem war ich überhaupt nicht zufrieden. Außerdem haben die den Support nach einem halben Jahr eingestellt, richtige kleine, weiß nicht, ob ich da jetzt das passende Mode für habe. Egal. Zumindest hat das gesackt. Android-Tablets sind painstabber. Ich finde, da haben die auch ein bisschen den Anschluss verloren. Und jetzt hat es ein iPad und ein iPhone und ist damit happy. Und ich verwende beispielsweise einen Fire HD 8. Ich verwende einfach so abends im Bett, um ein bisschen YouTube zu gucken. Dafür reicht es. Ansonsten habe ich mein iPhone XR, dann habe ich noch ein iPhone 6, ein altes. Geht ja aber immer noch gut. Ich habe mittlerweile insgesamt, glaube ich, 13 Tablets oder 13 solcher Gadget-Dinger, also sprich Apple und Android-Geräte zusammen. Da hat sich die letzten Jahre oder 14, ich glaube 14 sind es mittlerweile, hat sich die letzten Jahre schon ein bisschen was angesammelt, ja. Dementsprechend, ich denke, ich habe da schon mittlerweile so weit den Überblick, da ich sagen kann, ich weiß, wo die Schwächen und die Stärken von den jeweiligen Plattformen sind. Zum Beispiel ist es für mich ganz offensichtlich und ich finde, das ist auch gar nicht was, wo man, warum sich die Fanboys, ehrlich gesagt, streiten müssen. Also meiner Ansicht nach, der Riesenvorteil von Android ist customizable. Also sprich, du kannst bei Android fast alles irgendwie, irgendwo einstellen. Du hast Apps, die ganz viel merkwürdige Dinge im System machen können. Du hast so abgedrehte Sachen wie Tasker zum Beispiel, sowas wäre undenkbar unter iOS. Tasker unter iOS, es gibt Shortcuts, aber Shortcuts ist meilenweit von dem entfernt, was du auch an quasi tieferer Systemintegration, was du mit Tasker machen kannst. Also alles, was um customizable Sachen geht, um Customization, Automatisierung und eben da, wo du sehr detailliert Sachen anpassen musst, dass das macht, was du willst, ist Android viel, viel besser als als iOS. Dafür, wenn man die Sache einfach nur als Noob benutzen will, ist halt das Apple Pling Pling auch ganz nett. Und ich, jetzt kommt, jetzt kommt, finde ich eine Sache, wo man, wo man tatsächlich drüber diskutieren kann, aber ich finde, dass die Apps im iOS App Store im Durchschnitt die bessere Qualität haben, als die Apps aus dem Google Play Store. Dafür hast du auch total viele merkwürdige Dinge bei Apple, also, also, preislich jetzt am Start, wo man sich fragt, okay, ist es das jetzt wirklich wert, dass ich da irgendwie so eine kacke App hab, die es bei Android umsonst gibt und tut, was ich mache und bei der gleichen App im App Store soll ich 7,99 bezahlen, ja gut. Aber ich glaube, das liegt auch ein bisschen daran, dass Apple pingeliger ist, was Usability und einheitliches Look and Feel angeht als Google. Aber im Durchschnitt würde ich schon sagen, ist die Qualität der iOS Apps besser. Dafür hast du mit der Umgedreht bei Android Sachen, die gibt's unter iOS gar nicht. Gerade was ist, sowas wie Tasker zum Beispiel, das ist nicht, das geht schlicht und ergreifend nicht unter iOS, das funktioniert nicht. Das ist technisch nicht möglich, sowas unter iOS zu bauen. Da fehlt Apps auch, der Zugriff auf Betriebssystem Funktion, die es halt einfach nicht gibt. Dazu kommt, dass Apple halt Apple ist und der Meinung ist, sie wissen vieles besser. Was dann auch dazu führt, dass Apple manchmal andere Dinge macht wie die restliche Welt. Zum Beispiel haben sie mit Safari mittlerweile finde ich hoffnungslos den Anschluss verloren an moderne Webgeschichten. Der PWA Support von Safari ist der Witz, da funktioniert fast nichts. Dann haben sie auch noch merkwürdige Vorgaben. Ich weiß nicht, ob ihr das wisst, deswegen sage ich es jetzt mal. Wenn ihr unter iOS Chrome verwendet, Firefox verwendet oder Safari verwendet, macht gar keinen Unterschied. Zumindest nicht, was die Webinhalte angeht, weil es ist alles Safari. Unter iOS ist alles Safari, auch wenn Chrome dran steht oder Firefox. Apple erlaubt keine andere Browser Engine auf iOS als Safari. Das einzige, was die Hersteller machen können ist, sie können halt Safari nehmen und da drum ein paar Buttons bauen, dass es so aussieht wie Chrome. Aber unter iOS ist jeder Browser Safari. Mal ganz davon abgesehen, eventuell haben es vielleicht ein paar weniger bekannte Apps geschafft, ein paar nicht Safari Browser in den App Store zu schmuggeln, keine Ahnung. Aber die normalen Browser und die Apps, die Apple ordentlich reviewt hat, sind Safari. Und ja, deswegen ist Chrome auch so scheiße auf dem iPad. Auch Tor. Alles, was Browser ist. Alles, was Browser ist. Ich weiß nicht, wie der Tor Browser das macht, ehrlich gesagt. Ja, aber Apple erlaubt das nicht. Du kannst nur Safari verwenden. Und das Problem dabei ist, dass der echte Apple Safari, also sprich das Ding, was ihr als Safari anklickt, dass das mehr darf als die anderen Sachen. Also wenn ihr zum Beispiel irgendwelche Echtzeit WebRTC Geschichten machen wollt oder so, die funktionieren manchmal nur richtig im Safari, im richtig echten Safari. Und nicht, wenn ihr das auf ein Homescreen hinzufügt, wo das dann quasi als Safari WebView gestartet wird. Deswegen sag ich auch, die haben, was moderne Web Sachen angeht, ziemlich den Anschluss verloren. Also Chrome und auch Firefox, wobei Firefox ja eh ein bisschen reingeschissen hat seit ein paar Versionen, aber auch Firefox, wenn es darum geht moderne Web Sachen zu unterstützen, sind die meilenweit, also wirklich halbe Erdumrundung vor Apple. Die unterstützen teilweise, die fangen teilweise an, in Safari Dinge zu unterstützen, die die kein Chrome schon drei Jahre. Und dann machen sie beispielsweise so Sachen wie Homescreen Launcher für Web Apps, machen sie ganz anders als die restliche Welt und sowas. Also was Web Sachen angeht, ist Apple halt eklig. Ich vermute aber auch, dass es nicht Unfähigkeit von Apple, sondern, genau das was Prometheus übrigens gerade schreibt, das wollte ich gerade sagen, ich glaube nicht, dass es Unfähigkeit ist von Apple, ich glaube da ist auch ein bisschen Taktik dabei, weil überlegt euch mal, wenn du eine PWA machen kannst, also quasi PWA ist eine App, ist eine Appseite, die man zu seinem Startbildschirm auf dem Handy hinzufügen kann und die mehr oder weniger funktioniert wie eine Store App. So und nachdem PWA mittlerweile sogar Pop-ups können, also Dings Notifications, Notify Pop-ups können, ich glaube ohne Android teilweise sogar Zugriff auf Telefoniefunktionen, glaube ich, gehen und wenn Apple das unterstützt, ist es halt schiss, dass die Leute sagen, ok, warum sollen wir diese Sache als App Store bringen, als App Store App bringen, wenn wir sie auch als PWA verteilen können und dann keine 30% Gewinn an Apple abgeben müssen. Also ich denke mal, dass Apple auch ein bisschen Taktisch da unterwegs ist, aber es ist nicht der Zutritt nervig, dass Apple so weit hinten dran ist, was Support für moderne Web-Sachen angeht. Ja ok, ich mache jetzt nochmal schnell noch ein paar Sachen, die ich mir aufgeschrieben habe, die ich auch praktisch finde, dann ist auch gleich 22 Uhr, gehe ich auch demnächst mal ins Bett. Genau, also eine Sache, wo ich auch nie gedacht hätte, dass man sowas braucht, aber seitdem ich es habe, extrem praktisch, ist es ein Mess-Schieber. Sowas da, hier. Ich würde vielleicht nicht den allerbilligsten China-Crab nehmen, da weiß ich nicht, wie genau er ist. Äh, Tom, keine Ahnung, warum nicht, ja. Ich glaube, die meisten Firmen haben Apple-Firmengeräte, weil eben die Entscheidungsträger in der Regel eher Apple als Android verwenden. Ja, aber spätestens seit ich einen 3D-Drucker habe, muss ich sagen, enorm praktisches Ding, weil da muss man ab und zu mal was ausmessen. Zum Beispiel, ich habe so einen Minisieb gedruckt für die Regenrinne und da muss ich die Regenrinne nehmen. Und da ist sowas natürlich nützlich. So, und es ist eigentlich fast egal, was ihr da kauft, vielleicht nicht der allerbilligste, ist aber auf jeden Fall auch ein super Geschenk für Technik-Technik-Interessierte. Welche 3D-Software hast du? Ich habe dieses Auto-Cut, wie hieß das dann, dieses webbasierte Auto-Cut Lite da verwendet, ich weiß gar nicht, wie das heißt. Das heißt Auto-Cut Lite, das heißt, wie ist das denn, webbased, das war von Auto-Cut, klaut das? Das war es, nix, kost. Das hieß aber nicht Auto-Cut, das war von Auto-Cut, das hieß aber nicht Auto-Cut. Ich weiß nicht. Ich würde es dir sagen, was Tinker-Cut, nie. Es war irgendwas im Browser, es war was von Auto-Cut, es hieß nicht Auto-Cut, es war eindeutig für so Noobs gemacht wie mich. Du konntest da glaube ich nur Kugeln, Würfeln, Dreiecke und Gedöns hinzufügen, musstest dann zurecht schneiden. Fusion, ja, ja, ja, ja, genau das da. Siehst du mal, der Chat, der Chat ist wieder Big Brain. Der Chat ist wieder Big Brain. Sowas hier war das, glaube ich. Ja, ich glaube das war das. Das kommt mir bekannt vor. Haben die ihr Logo geändert? Haben die, haben die ihr Logo geändert? Die Logo geändert? Das Logo habe ich anders in Erinnerung. Oder war es doch was anderes? Ich weiß es nicht mehr. Das habe ich gemacht, keine Ahnung, zwei, drei Monate nachdem ich den 3D-Drucker gekauft habe, ist es auch schon wieder ein bisschen her. Nee, dann war es nicht Fusion, dann war es nicht Fusion. Ich glaube Fusion habe ich mir damals angeguckt und habe festgestellt, ich bin zu dumm für. Ich glaube das war es. Ich habe irgendwas ganz Simples verwendet. Da konntest du nur irgendwie Kugeln, Dreiecke und Vier-Ecke rein machen und die schneiden. Mehr konntest du nicht. Hast du eigentlich schon mal was mit Point Cloud Geschichten gemacht? Was ist Point Cloud? War das, was, Tinker Cat? Ah nee, Tinker Cat. War das das? Ich muss mir das Bild angucken. Ja, das könnte es, nee. Das mit dem Würfel kommt mir schon mal bekannt vor. Zumindest habe ich richtig verkackt. Ich musste das fünfmal drucken oder so, bis es gepasst hat. Richtig verschissen. Zumindest ich habe, wir waren aber gerade beim Messschieber. Da war ich froh, dass ich sowas zum Ausmessen hatte. Und wie gesagt, ich würde nicht gerade den allerbilligsten kaufen hier. Sowas kann man schon kaufen und man weiß es eigentlich gar nicht, wie sehr man sowas gerne hätte. Vor allem wenn man öfters mal Sachen selbst ausdrückt oder abschneiden muss oder sowas. Auch enorm praktisches Ding. Was illegal, nee, nicht illegal ist. Was kann ich denn aussprechen? Regenbogen Einhornpony. Ach Lila, ich bin schon zu low brain. Ich bin zu spät. Das Lila Regenbogen Einhornpony hat mir Prime subscribt. Massive Subscription. Dankeschön. So. Nice. Genau. Der ist auch sehr praktisch. Egal welcher. Gerade für Buster toll. Und auch in diesem Bereich hier, wenn man sich hier guckt, irgendwas von neun bis zwanzig Euro. Ist auch wunderbar für Weihnachtsgeschenk. Kann man eigentlich nichts großartig falsch machen. So. Und dann noch eine Sache. Ich hab zwar noch ein paar Sachen mehr, aber wir belassen sie auch bald bei. Aber eine Sache muss jetzt nochmal los werden. Hat jetzt nichts mit Informatiker und Bastler zu tun. Must have. Die originale australische hot and spicy Barbecue Soße. Kokona Style. Genau die hier. Die braucht man. Die ist Massive Pock. Ist ein bisschen scharf. Ist auch hot and spicy. Aber meiner Ansicht nach die beste Barbecue Soße für so gegrilltes Zeug, was man so zu Hause macht, wo man jetzt nicht irgendwelche super abgedrehten Whiskey Barbecue Special Soße haben will, wo man einfach nur wirklich gute, bisschen scharfe Barbecue Soße haben will. Das da. Poggers. Die Barbecue Pit Boys. Oder irgendwie sowas. Oh yes. Das würden die Barbecue Pit Boys sagen. Zwölf Unzen ist es, wiegt es übrigens? Das sind Freedom Units wieder. Zwölf Unzen. Ok, zwölf Unzen zu Gramm. 340 Gramm. Das war zu kompliziert. Das müssen zwölf Unzen sein. Ja, die muss, die muss. Auch super Geschenk. Beste Barbecue Soße. Beste so nur nach 15 Barbecue Soße, die man für alles verwenden kann, die es gibt. Meiner Ansicht nach natürlich. Und mit 10 Euro kann man da nichts falsch machen. Beste. Top Weihnachtsgeschenk. Exzellent. Enthält Senf. Weiß nicht was es enthält. Ist mir auch wurscht. Schmeckt gut. Link. Da. Sucht danach auf Amazon. Ich habe noch keine Reflinks. Reflinks gibt es erst morgen, wenn ich das Video zugemacht habe. So und ich hätte noch eine Sache hätte ich noch. Eine Sache hätte ich noch und zwar. Wenn man in einer Umgebung ist, die ein bisschen Krach macht und man trotzdem ordentlich schlafen will oder weil man Haustiere hat, die einem manchmal auf den Sack gehen und man will einfach seine Ruhe haben. Ohrstöpsel, aber nicht irgendwelche Ohrstöpsel, sondern Alpine Sleepsoft Ohrstöpsel. Ist mit Sicherheit vom Preis ja auch ein gutes Weihnachtsgeschenk und zwar. Die sind besonders elastisch und man kann damit auf der Seite liegen und merkt nicht, dass sie im Ohr sind oder kaum, dass sie im Ohr sind. Bricht macht man ins Ohr, legt sich ganz normal hin auf die Seite, aufs Kopfkissen und man hat keinen Drücken im Ohr. Das ist übrigens auch super Weihnachtsgeschenk für eure Mutter oder Oma, Opa, Vater, sonst was. Ganz top. Kannst du eigentlich jedem schenken, der in irgendeiner Umgebung wohnt, wo es nachts nicht so ruhig ist. Ich hab die am Start und manchmal geht mir meine Katz nachts auf den Keks. Meistens geh ich dann mal aufs Klo, wenn die an der Tür ist und nervt, aber wenn die das dritte Mal nachts an der Tür nervt, dann zieh ich mir einfach das Ding ins Ohr, mach zack und dann hör ich nix mehr. Und dann ist Ruhe. Beste. Also auch Universalgeschenk geht für alles. Die Katze ist free, ich bin nicht free, ich bin im Zimmer. Die Katze ist quasi überall und ich bin bei mir im Schlafzimmer, aber ich lass die Katze nachts in den Schlafzimmer rein, weil die Katze mir dann nachts auf den Keks geht, die läuft dann auf mir rum und macht Dinger und sonst wie und ich will pennen in Ruhe. Morgens lass ich die manchmal rein. Wecker, ich brauch keinen Wecker. Ich werd nicht vom Wecker wach. Ich brauch keinen Wecker. Ich werd ohne Wecker wach. Ich bin glaub ich die Letzten und das ist jetzt nicht übertrieben. Die letzten 10 Jahre bin ich vielleicht, ich will jetzt nicht untertreiben, aber auch nicht so sehr übertreiben. Ich sag mal, letzten 10 Jahre bin ich vielleicht 5 Mal nicht von alleine aufgewacht. Ja, der Gamer Alex, so ist bei mir auch. Ich wach immer auf, bevor der Wecker klingelt. Immer. Wie gesagt, vielleicht 5 Mal in den letzten 10 Jahren oder so. Wie lange schläfst du ungefähr immer? Es kommt drauf an. Also wenn ich auf die Arbeit nach Frankfurt hinfahre, dann geh ich meistens so 22, 22, 30 ins Bett. So wie jetzt ungefähr. Ich geh jetzt auch nicht gleich ins Bett. Ich mach jetzt hier Stream aus und guck noch ein bisschen Video und dann geh ich pennen. So und dann geh ich so 22, 22, 30 pennen und dann steh ich 5 und 45 auf und zieh mich an, geh zum Zug, fahre zum Südbahnhof in Frankfurt. Vom Südbahnhof laufe ich dann zum Millie-Brandplatz, so ungefähr in die Ecke. Ich will jetzt nicht so genau spoilern, wo wir sind. Das mach ich absichtlich, dass ich morgens mal eine halbe Stunde mich bewegen kann, wenn du den restlichen Tag wieder gar nicht bewegst. Also ich könnte gerne eine halbe Stunde früher auf der Arbeit noch sein oder eine halbe Stunde später wegfahren. So und dann bin ich so ungefähr um 7 Uhr auf der Arbeit und dann geh ich 15, 30, geh ich heim. Dann bin ich dann, dann laufe ich wieder zum Südbahnhof zurück. Dann bin ich 16, 30 daheim. Also 5, 45 aufstehen, 16, 30 bin ich wieder daheim. So und jetzt, wo ich Homeoffice hab, ist das natürlich deutlich angenehmer. Da penne ich so ungefähr immer 37 und Arbeit ist ungefähr bis 16, 30. Was natürlich enorm poggers ist, dass man sich den Heimweg halt spart und den Hinweg bei Homeoffice. Das ist finde ich eigentlich das Beste an Homeoffice überhaupt. Weil die ganze verschenkte Fahrzeit, also die ganze Fahrzeit ist halt einfach komplett verschenkt, verschenkte Zeit, ne. Die glaube ich jeder gerne sparen würde. Zumal man hätte auch nichts sinnvolles macht. Man sitzt da halt sinnlos rum und regt sich über die Bahn auf, die dann teilweise nicht kommt. Also das nervigste an jedem Arbeitstag ist ehrlich gesagt das Hin und Zurückfahren mit der Bahn. Und es wäre mit dem Auto auch nicht weniger nervig, vor allem mit meinem Auto nicht. Ihr kennt hier mein Massive High End Auto. Wie viele Stunden musst du pro Woche arbeiten? Ich arbeite 30 Stunden glaube ich. Ich glaube 30 Stunden arbeite ich. Ich glaube 30 Stunden, ja. Aber ich arbeite auch nicht jeden Tag. Also ich arbeite nicht die ganze Woche. Was verdienst du so falls du... Also erstens genau kann ich es euch nicht sagen aus zwei Gründen. Wahrscheinlich darf ich nicht und ich weiß es nicht. Aber was ich dir sagen kann ist oder was wir uns hier im Stream Show angeguckt haben, wir sind im Tarifvertrag, in diesem ARK-Tarifvertrag. Wie heißen die? Wie heißen die? Ah. Niemals mit Versicherung. Hier, ARKV Ferz, ja. So. Und ich bin Stufe 6 und schon über 12 Jahre dabei. Da kannst du das auch mal selbst ausrechnen. Was da jetzt für Bonus noch oben drauf kommt, kann ich dir nicht sagen. Erstens weiß ich und zweitens weiß ich nicht ob ich es sagen darf. Aber das was da drin steht ist schon mal zumindest das Mindeste. Und das Ganze gibt es dann 14 Mal, weil 14 Monatsgehälter. Ja. Da kannst du dir zumindest das untere Ende, kannst du dir daraus zusammenreimen. Nimmst das was da drin steht, für ich glaube Stufe 6 ist es. Für die höchsten Jahre und das mal 14 dann hast du die untere Grenze. Plus Twitch-Money. Ja ich verdiene glücklicherweise noch ein bisschen aus anderen Quellen. Übrigens das Finanzamt hat, ich hatte meinen Steuerberater heute Morgen, hat er eine E-Mail geschrieben, das Finanzamt möchte von ihm Unterlagen von 2015 bis 2016. Bin ich froh, dass ich einen Steuerberater habe? Weil ganz im Ernst, ich würde doch im Leben keine Unterlagen von 2015, 2016 mehr finden. Zum Glück, zum Glück geht das alles mit Steuerberater. Ich habe den Versuch zu erreichen, aber da war heute ein ganz Tag irgendwie unterwegs, muss den morgen nochmal anrufen, was das jetzt, was die jetzt eigentlich genau rollen. Ich denke das ist irgendwelche routinemäßigen Sachen zum nachgucken. Das soll mein Steuerberater mal machen, dafür kriegt er ja Geld. Ja das stimmt, YouTube-Money ist jetzt ja quasi nicht existent aktuell. Ich weiß nicht was die machen wollen. Es ist ja so, dass das Finanzamt gar nicht alle Sachen bekommt vom Steuerberater, sondern nur so eine Übersicht glaube ich und wenn die das dann im Detail haben wollen, kann er das denen irgendwie geben. Ich weiß nicht wie das genau funktioniert, ist mir auch wurscht, ich muss mich damit nicht beschäftigen, dafür kriegt mein Steuerberater Geld, dass er sich damit beschäftigt. Wieso ist sein Stream so gelb in der Tasklist? Das kann ich dir nicht sagen. Ach so, weil es Updates hat wahrscheinlich. SCBA 42, 12 Monate, Dankeschön für 12 Monate. Huge Hypersubscription hier. Ganzes Jahr schon hier am Start, nice. Richtig Coggers, ja. Also Leute, ich hoffe es war was dabei für euch bei meinen Weihnachtsvorschlägen, morgen mache ich dazu noch ein Video. Jetzt so die gute Zeit ein bisschen Weihnachts Clickbait zu betreiben. Haben wir irgendeinen, den wir hosten können, zeige ich mal her. Ich hauste ja sonst nie welche, weil kaum jemand online ist. Der Krieger ist on mit Among Us, das gucke ich aber eh nicht. So, der Solution war vorhin on, aber der ist jetzt wieder off. The Lost ist auch nicht da, wen haben wir da von den Deutschen hier noch? Nö, keiner da. Was, Alter, vier Games ist on? Echt? Ey, ist er gar nicht, jebaitet mich hier. Knossi, genau, wir hosten Knossi, der braucht es natürlich auch unbedingt. Nee, ist keiner da. Also Leute, sehen wir uns wahrscheinlich, ich weiß nicht ob ich es morgen hinkriege, zu Streamsorn. Also wir sehen uns dann, machts gut, bis denn, see you.", "segments": [{"id": 1, "start": 0.0, "end": 13.76, "text": "Twitch Chat. All these emotes, wondering how to spell that. Now we're older, everyone's moved on,"}, {"id": 2, "start": 13.76, "end": 26.4, "text": "but I remember Twitch Chat from those days that are gone. Twitch emotes from long ago made you feel"}, {"id": 3, "start": 26.4, "end": 48.24, "text": "you're not alone. Kappa Pogchamp, Kipo Forehead, Bible Thumb, Twitch emotes. I remember Typing Dance"}, {"id": 4, "start": 48.24, "end": 64.8, "text": "Games, Forehead, Swift, Rage, PJ Salt and Failfish. Life was easy, spamming all the time, TOS was nowhere,"}, {"id": 5, "start": 64.8, "end": 81.92, "text": "so everyone's feeling fine. Twitch emotes from long ago made you feel you're not alone. Kappa Pogchamp,"}, {"id": 6, "start": 81.92, "end": 96.96, "text": "Kipo Forehead, Bible Thumb, Twitch emotes. Still hear his bark in the morning hour, he calls me."}, {"id": 7, "start": 96.96, "end": 113.68, "text": "His doggy emote reminds me of a time far away. Looking at a chat, I get a feeling that I miss emotes from yesterday, yesterday."}, {"id": 8, "start": 113.68, "end": 135.12, "text": "Twitch emotes from long ago made you feel you're not alone. Pog is Pogchamp, Kappa is Kappa, Bible Thumb, Twitch emotes."}, {"id": 9, "start": 135.12, "end": 146.64, "text": "Excellent, ich muss noch kurz meine LED Fensterleiste anmachen, für mehr Weihnachtsstelts Twitch emotes."}, {"id": 10, "start": 146.64, "end": 173.52, "text": "So, wunderbar. Chris Stonehenge, 14 Monate, das ist ja quasi schon richtig. Musste sie mal oder erst mal finden."}, {"id": 11, "start": 173.52, "end": 184.96, "text": "Ich habe schon 14 Monate Sub. Massive Subscription. Was ist das eigentlich für ein komisches Bild?"}, {"id": 12, "start": 184.96, "end": 192.96, "text": "Ach, das ist hier ein Vectorbild oder warum ist das so klein? Dabei ist es ohne Vergrößerung."}, {"id": 13, "start": 192.96, "end": 201.44, "text": "Ach, das ist das, das komplett auf den Bildschirm passt oder so. Das ist Chrome, Pepega, Bildschirmskalierung."}, {"id": 14, "start": 201.44, "end": 221.44, "text": "Hast du Pac-Man irgendwie noch konfiguriert? Ich bekomme nicht diese Vorschläge zur Installation, wenn ich Pac-Man minus SS, was für eine, was für eine, was für Vorschläge meinst du mit Pac-Man minus SS?"}, {"id": 15, "start": 221.44, "end": 233.44, "text": "Ach, du meinst die, die ich kriege? Ja genau, das ist kein Pac-Man. Ich muss die VME starten."}, {"id": 16, "start": 233.44, "end": 263.36, "text": "Also Leute, was ich mir für den Stream hier heute überlegt habe, ist folgendes. Nachdem ich ja im letzten Stream irgendwie schon so viele Leute gesagt habe, oh ja, das ist was, was wir unbedingt für Weihnachten kaufen könnte, also als Geschenk, habe ich mir gedacht, ich gucke mal ein bisschen rum und ich habe mir eine Liste gemacht mit allen Sachen, die mir so eingefallen sind, die man technik-, naja, muss nicht unbedingt technikinteressiert sein, aber sag mal so Informatikkurs und Bustlords."}, {"id": 17, "start": 263.36, "end": 286.32, "text": "Und alles, was irgendwie damit verwandt ist, schenken kann. So, du meinst das hier, oder? LulHD suchen wir mal. Okay, das ist natürlich so ein Twitch-Chat. Du meinst diese Vorschläge hier? Nee, das ist nicht mit Pac-Man. Das ist J."}, {"id": 18, "start": 286.32, "end": 300.32, "text": "Ich mach mal kurz den ganzen Kram zu. Das brauchen wir heute nicht. Das brauchen wir heute nicht. Den können wir auch zumachen. Auch zu. Auch zu."}, {"id": 19, "start": 300.32, "end": 318.32, "text": "FireFox starten wir mal. Oh, FireFox Lightseam. Moment, meine Leute, wartet mal kurz. Okay, das sieht zwar kacke aus mit dem Google-Logo, aber immerhin. Lightseam, das halte ich nicht lang aus. Mein Browser ist schon light genug hier außen drum herum."}, {"id": 20, "start": 318.32, "end": 336.32, "text": "Konnte man nicht mal, konnte man FireFox nicht irgendwie schön stylen außen drum herum? FireFox-Themes, gab es da nicht irgendwie? Also früher konnte man FireFox auf jeden Fall extrem exzellent stylen. Ich weiß nicht, wie das heute ist, ehrlich gesagt."}, {"id": 21, "start": 336.32, "end": 357.32, "text": "Okay, dann sollen wir das hier jetzt, Install-Theme, nochmal so zum Vergleichen gucken. Jaja, Add. Naja."}, {"id": 22, "start": 357.32, "end": 374.32, "text": "Aber das Menü ist ja immer noch ungestylt. Das ist übelst failed. Sagen wir mal, macht das nur die Leiste da oben oder was?"}, {"id": 23, "start": 374.32, "end": 389.32, "text": "Also Amazon lässt uns ja schon mal keine Ruhe, ne? Amazon lässt uns ja mal wirklich keine Ruhe. Es vergeht keinen Tag, wo Blitzangebote sind. So, also zum Beispiel, ich zeige euch mal, was ich mir so überlegt habe, in welche Richtung das Ganze geht."}, {"id": 24, "start": 389.32, "end": 405.32, "text": "Zum Beispiel, was im letzten Stream total gut angekommen ist, war meine Abisolierzange. Und da haben ganz viele im Chat gesagt, mindestens vier, fünf Leute insgesamt."}, {"id": 25, "start": 405.32, "end": 422.32, "text": "So, nice, jetzt habe ich was für Weihnachten. Und da bin ich auf die Idee gekommen, dass man mal so einen Stream machen kann, wo ich alles mal zeige, was ich denke, was man gut Informatikers und Bastlors mal schenken kann."}, {"id": 26, "start": 422.32, "end": 430.32, "text": "Im Gegenzug wäre es natürlich nice, wenn ihr mich auf die Idee bringt, was ich sonst noch kaufen kann. Aber, ähm, tja."}, {"id": 27, "start": 430.32, "end": 436.32, "text": "Was? Rechtsklick oben auf die Leiste? Anpassen? Customize?"}, {"id": 28, "start": 436.32, "end": 462.32, "text": "Ah, das ist schon so hell. Ah, yes. Ja, ok, ok, ok. Aber so ist auf jeden Fall deutlich angenehmer. Dann deinstalliere ich dieses Theme wieder. Wie deinstalliert man das jetzt überhaupt? Hab ich noch nie gemacht."}, {"id": 29, "start": 462.32, "end": 484.32, "text": "Wie, wie, wie aninstalliert man das jetzt? References? Das ist natürlich nett. Hier, Extensions."}, {"id": 30, "start": 484.32, "end": 502.32, "text": "Ah, das ist wieder das richtige Big Brain Musik gerade am Start. Ah, yes. Mario Galaxy Walzer Exquisite."}, {"id": 31, "start": 502.32, "end": 516.32, "text": "Lädst du deine Streams irgendwo hoch oder wo? Ähm, genau da. Der hat schon gepostet. Du musst auf, ich bin mir nicht sicher, es geht eins von beiden, geht nicht."}, {"id": 32, "start": 516.32, "end": 536.32, "text": "Oh, Sebaro, die Seite ist kaputt. Lull. Bei mir gelädt die Seite nicht. Lädt die bei euch? Bei mir ist Watt und Archief kaputt. Aber, du kannst, äh, du kannst auf Wupplors.tv gehen."}, {"id": 33, "start": 536.32, "end": 548.32, "text": "Du kannst da hingehen. Und dann gehste da oben auf Archief. Und dann funktioniert's. Das muss man dem Sebaro mal sagen, wenn er wieder da ist."}, {"id": 34, "start": 548.32, "end": 560.32, "text": "RIP. Das ist wahrscheinlich irgendeine Cloudflare-Foreboarding-Geschichte, die den Serverumzug nicht überlebt hat."}, {"id": 35, "start": 560.32, "end": 570.32, "text": "Nee, das funktioniert. Das funktioniert, Leute. Ich hab's doch gerade selbst gemacht. Guck mal hier, das funktioniert. Ihr geht auf Wupplors."}, {"id": 36, "start": 570.32, "end": 582.32, "text": "Die Seite ist zwar hardcore langsam gerade, aber sie funktioniert. Ähm, dann geht ihr auf Archief. Übersicht. Zack, seid ihr immer schief drin."}, {"id": 37, "start": 582.32, "end": 590.32, "text": "So wie das sein muss. Ja, das ist das Google Drive Archief. Da müsst ihr jetzt euch erst mal hier searchen. Den Titel vom jeweiligen Stream raussuchen."}, {"id": 38, "start": 590.32, "end": 598.32, "text": "Guck mal hier, wie viele Streams ich schon gemacht hab. Seht ihr das mal hier?"}, {"id": 39, "start": 598.32, "end": 614.32, "text": "Das ist für komische Dateien. Hat der Sebaro da sein Hentai Zeug drin? Oder was ist da? Irgendwo versteckt. Ach nee, das sind die, das sind irgendwelche Clips."}, {"id": 40, "start": 614.32, "end": 632.32, "text": "Okay, keine Ahnung. Macht nichts. Ich muss das nicht so genau wissen. Yep. Bester Streamtitel überhaupt hier gewesen. Yep, Aubergine."}, {"id": 41, "start": 632.32, "end": 647.32, "text": "Yep, Aubergine. Github hat jetzt auch einen Dark Mode. Ja, so langsam, aber sicher kriegen alle Seiten irgendwie einen Dark Mode."}, {"id": 42, "start": 647.32, "end": 666.32, "text": "Amazon sieht halt mit Dark Mode ein bisschen, ja, wie sieht Kaga aus. Aber alle mal besser, als wenn ich mich jetzt hier erplinden lasse vom Monitor."}, {"id": 43, "start": 666.32, "end": 680.32, "text": "Oh nee, darf man nicht mehr sagen auf Twitch. Fuck, schon wieder das Wort verwendet. Nee, nee, nee."}, {"id": 44, "start": 680.32, "end": 706.32, "text": "Ich bezahle das gar nicht der Sebaro macht das. So, also, deswegen, ich hab mir eine richtig lange Liste gemacht. Ich hab mein Amazon und sonstige Sachen durchgeguckt und auch mal bei mir im Schrank und alles Mögliche, was man, wie gesagt Informatikor ist oder generell Bastlern, Technik interessiert oder so mal, schenken kann, was nicht so teuer ist."}, {"id": 45, "start": 706.32, "end": 716.32, "text": "Wohlgemerkt, es sind bestimmt die ein oder anderen Sachen drin, die auch ein bisschen mehr ist. Was ist mit meinen Reflings? Was soll mit meinen Reflings sein?"}, {"id": 46, "start": 716.32, "end": 737.32, "text": "Die Reflings gehen auf Twitch und auf Twitter und überall, wo es Reflings sind, gehen die. Ich hab halt so wenig Reflings. Ich hab jetzt, theoretisch hätte ich jetzt eigentlich für Maximum Geldabgreifaction hätte ich eigentlich für jedes Produkt oder ich hätte eine Liste machen müssen."}, {"id": 47, "start": 737.32, "end": 756.32, "text": "Max-Weihnachtsgeschenktipps. Leute, ihr habt mich auf die Idee gemacht. Ich mach morgen ein Video. Top, frag mich nicht. Top 10, Top 15 der besten Weihnachtsgeschenke für Informatiker und Technikleute. Irgendwie sowas."}, {"id": 48, "start": 756.32, "end": 770.32, "text": "Dann ein bisschen clickbaity. Müssen wir das machen. Und dann mach ich ne Liste mit Reflings und dann gibt's Easy Money."}, {"id": 49, "start": 770.32, "end": 795.32, "text": "Und wenn einem das gefällt und ich irgendeinem geholfen hab, freu ich mich natürlich auch über Twitch Prime Subs. So, also, wie gesagt, ich hab mal alles mögliche in Sachen durchgeguckt und mir sind ein paar Sachen eingefallen und ich hab auch ein paar Sachen gefunden, wo ich denke, dass das wahrscheinlich den meisten Leuten, die sich so ein bisschen für Technik Sachen interessieren, gefallen wird."}, {"id": 50, "start": 795.32, "end": 812.32, "text": "Wohlgemerkt, natürlich, ich mein, ihr kennt die Leute am besten und das eignen sich auch nicht alles für alles, ja. Man, jeder hat so ein bisschen unterschiedliche Vorlieben. Ein paar Sachen sind halt auch relativ speziell, aber wenn sich einer für interessiert, dann findet er das bestimmt nice."}, {"id": 51, "start": 812.32, "end": 826.32, "text": "Schon Git auf Deutsch gesehen. Nö, braucht man das? Git hat doch standardmäßig ne deutsche Übersetzung, die ist aber scheiße."}, {"id": 52, "start": 826.32, "end": 834.32, "text": "Tägliche Kommunikation."}, {"id": 53, "start": 834.32, "end": 844.32, "text": "Und was ist hier los?"}, {"id": 54, "start": 844.32, "end": 854.32, "text": "Warum geht es hier nicht? Warum geht der Darkreader hier nicht auf GitHub? Ah, weil ich's ausgemacht hab. Exzellent."}, {"id": 55, "start": 854.32, "end": 870.32, "text": "Ich brauch Darkseam gerade. Und ich bin hier noch eingeloggt? Warum bin ich hier noch eingeloggt? Zeig ich vielleicht Sachen, die ich gar nicht zeigen will? Das ist nicht meine Seite, Pasi."}, {"id": 56, "start": 870.32, "end": 884.32, "text": "Die ist nicht mir. Die gehört doch nicht bei mir. Nur nicht bei die Domain ist mir. Was? Git auf Deutsch. Es folgt ein zweiter Bild. In it. Eröffnen."}, {"id": 57, "start": 884.32, "end": 891.32, "text": "Oh ne, das darf ich bei uns den Leuten auf der Arbeit nicht zeigen. Also, nicht die normalen Leute auf der Arbeit, die auch in Git was machen."}, {"id": 58, "start": 891.32, "end": 904.32, "text": "Aber wenn ich das der falschen Stonks Führungskraft zeige, da sind so ein paar Leute dabei, die stehen drauf, alles einzudeutschen. Auf der anderen Seite haben wir auch genug, die müssen das besonders agile und trendy Englisch machen."}, {"id": 59, "start": 904.32, "end": 913.32, "text": "Aber wir haben manche, die stehen total auf Eindeutschen. Wenn ich denen sage, hier guck mal, hier Git auf Deutsch, da kommen die noch auf die Idee."}, {"id": 60, "start": 913.32, "end": 925.32, "text": "Die sagen dann so, aha, wir brauchen unbedingt neue Policy. Alles, was im offiziellen Schriftverkehr verwendet wird, soll gefällig auf Deutsch sein. Und dann edit man nicht, sondern fügt hinzu oder man beschuldigt, man zieht."}, {"id": 61, "start": 925.32, "end": 948.32, "text": "Ich pullen würde ich sogar, könnte man pullen nicht, nicht, äh, untersetzen mit, mit, äh, runterholen? Nein, vergisst's. Aber trifft's eigentlich ganz gut, die Übersetzung, oder? Pullen. Runterziehen. Runterziehen eigentlich. Schieben. Ja, nachmachen. Oh man, was ein Schwachsinn."}, {"id": 62, "start": 948.32, "end": 962.32, "text": "Braucht dann sowas, aber die Idee ist gut. Okay, so, also kommen wir mal, kommen wir mal zu den Weihnachtsgeschenken. Und by the way, es ist keine Windows-Lizenz dabei."}, {"id": 63, "start": 962.32, "end": 986.32, "text": "Wobei Windows-Lizenzen ja mittlerweile fast umsonst sind. Hab ich euch erzählt, ich hab mir eine VMware-16-Lizenz gekauft. Bye, haltet euch fest. Bye, oh fuck, wie hießen die? Ich glaub Software-Kong oder so."}, {"id": 64, "start": 986.32, "end": 1001.32, "text": "Hier, Software-Kong. Ich hab mir eine VMware-16-Lizenz gekauft. Boah, nee, nee, nee, nee. Sowas hier. Software-Kong."}, {"id": 65, "start": 1001.32, "end": 1016.32, "text": "Hat funktioniert. Ich weiß nicht, ich weiß nicht, ob sie funktioniert. Äh, ich hab noch nicht installiert, das hier ist noch vor einmal 15, glaub."}, {"id": 66, "start": 1016.32, "end": 1034.32, "text": "Aber ich bin mal gespannt. Ich hab mir gedacht, komm, 20 Euro, Koffer bei Software-Kong, was. Ich weiß nicht, ob die läuft. Software-Kong. Klingt, findet ihr nicht auch, dass Software-Kong schon ziemlich seriös klingt?"}, {"id": 67, "start": 1034.32, "end": 1055.32, "text": "Vorurteile von VMware gegenüber VirtualBox. Es ist alles ein bisschen mehr polished als bei VirtualBox. Du kannst zum größten Teil alles mit VirtualBox zwar machen, aber es ist angenehmer mit VMware."}, {"id": 68, "start": 1055.32, "end": 1066.32, "text": "Ich weiß gar nicht, wie es mit Snapshots aussieht. Kann VirtualBox ordentliche Snapshots? Bestimmt. Jaja, doch klar können die das."}, {"id": 69, "start": 1066.32, "end": 1094.32, "text": "Aber wie gesagt, mir gefällt VMware Workstation besser. Du kannst es auch mit VirtualBox machen. Der Vorteil von VirtualBox ist eher im Detail. Zum Beispiel, wenn du irgendwelche 3D Sachen oder generell beschleunigte Sachen verwenden möchtest, 2D, 3D beschleunigte Sachen in der VM, dann ist die Chance, dass es mit VMware deutlich höher geht als mit VirtualBox."}, {"id": 70, "start": 1094.32, "end": 1103.32, "text": "Die haben ja mittlerweile sogar OpenGL 3 noch was Unterstützung und sogar DirectX 11, glaube ich, oder sogar Initial 12."}, {"id": 71, "start": 1110.32, "end": 1122.32, "text": "Cyber-Magenta-Thursday bei der Telekom. So, also, bevor wir jetzt lang rumschwitzen, ich zeige euch mal ein paar Sachen, weil ich habe wirklich ziemlich viel aufgeschrieben."}, {"id": 72, "start": 1122.32, "end": 1135.32, "text": "Ja, Nazana finde ich auch, dass VMware ein bisschen flotter, mehr flutscht. Kommt mir auch so vor."}, {"id": 73, "start": 1135.32, "end": 1156.32, "text": "Excellent. Ah, der Super Mario Galaxy Soundtrack ist nice. So, dass es nicht zu laut ist. Nee, passt genau. Also, dann fangen wir mal an."}, {"id": 74, "start": 1156.32, "end": 1167.32, "text": "Also, wie gesagt, das ist das, was mich auf die Idee gekommen hat. Kannst du die Liste im Discord posten? Ja, sobald ich morgen ein Video gemacht habe und eine RefLink-Liste habe."}, {"id": 75, "start": 1174.32, "end": 1177.32, "text": "Das muss ein paar Klicks mal mitmachen."}, {"id": 76, "start": 1177.32, "end": 1194.32, "text": "Wie gesagt, ich mache morgen ein Video und Tom, da ist das dann drinnen mit Reflinks und allem. Ja, aber sag mal so, meine Erfahrungs-Dinger mit den Sachen gibt es halt nur hier im Stream."}, {"id": 77, "start": 1194.32, "end": 1207.32, "text": "Da kann ich ja nicht morgen zu jedem Item irgendwie 10 Minuten was erzählen. Wolltest du nicht eigentlich jeden Tag im Dezember ein Video machen? Nee, wie kommst du darauf?"}, {"id": 78, "start": 1224.32, "end": 1243.32, "text": "Also, Flo690, ich weiß nicht, woher soll ich das wissen. Du kannst ja sogar, zumal das Ding auch noch gute Bewertungen hat, das kannst du doch überhaupt nicht wissen, die Seite sieht seriös aus."}, {"id": 79, "start": 1243.32, "end": 1254.32, "text": "Das ist das gleiche, wie wenn du, und ich würde jetzt den auch mal gar nicht unterstellen, dass die da irgendwelche merkwürdigen, aus irgendwelchen merkwürdigen Quellen da ihre Keys haben."}, {"id": 80, "start": 1254.32, "end": 1275.32, "text": "Ist ja genauso, wenn du irgendwelche Streams anguckst von Seiten, die halt legit aussehen, da kann auch dir keiner irgendwie nachsagen, dass du gesagt hast, ja du hättest wissen müssen, dass das irgendwie illegales Zeug ist."}, {"id": 81, "start": 1275.32, "end": 1289.32, "text": "Weiß nicht, ob es da schon Fälle gibt, wo dir was passiert. Wo dir natürlich was passieren kann, das ist wieder was ganz anderes, wenn du das irgendwie gewerbsmäßig nutzt oder so, das könnte natürlich sein."}, {"id": 82, "start": 1289.32, "end": 1302.32, "text": "Also, wenn du dann irgendwie 100 Lizenzen kaufst und dann irgendwelche Business-Dinger, das kann es vielleicht sein, aber wenn ich mir dann privat einen Vmw Key kaufe, da geht da kein Hahn danach."}, {"id": 83, "start": 1302.32, "end": 1318.32, "text": "Dann kommt das Staubsaugen am Einkauf-Video, das funktioniert nicht, da läuft kein Java drauf, gescheit."}, {"id": 84, "start": 1318.32, "end": 1330.32, "text": "So, also, kommen wir uns mal ein paar Sachen an. Exzellent. Wie gesagt, so, also, Java im Docker, na, das ändert da wahrscheinlich auch nichts dran. Ich glaube, Docker krieg ich schon ordentlich installiert."}, {"id": 85, "start": 1330.32, "end": 1342.32, "text": "So, also, wie gesagt, das ist die eine Sache, da bin ich letztens, also im letzten Stream auf die Idee gekommen, dieses Video hier zu machen, weil einige Leute gesagt haben, hier das finden sie eine gute Sache."}, {"id": 86, "start": 1342.32, "end": 1353.32, "text": "Und ich kann euch sagen, ich persönlich finde das Ding super. Es gibt sicherlich noch andere abisolierte Zangen, die auch ganz gut sind. Kann ich jetzt nicht beurteilen."}, {"id": 87, "start": 1353.32, "end": 1364.32, "text": "Es gibt beispielsweise noch irgendwie eine Multistrip von Knipex und sowas. Kann ich nicht so sagen, sind bestimmt auch nicht schlecht. Ich hab dieses Teil hier schon seit drei Jahren oder so."}, {"id": 88, "start": 1364.32, "end": 1382.32, "text": "Und die gibt es auch gerade sogar, guck mal, die gibt es auch gerade bei Amazon sogar noch zu kaufen. Und für 11,30 Euro, ganz ehrlich, wenn einer sowas noch nicht hat und jemand gerne bastelt, dann ist das eines der besten Geschenke, die ihr machen könnt."}, {"id": 89, "start": 1382.32, "end": 1390.32, "text": "Ich könnte mir vorstellen, vielen ist gar nicht so klar, dass sowas gibt. Ich hab das auch nur mehr oder weniger durch Zufall beim rumgucken auf Amazon als Empfehlung gesehen."}, {"id": 90, "start": 1390.32, "end": 1403.32, "text": "Hab ich mir gedacht, jawohl, genau sowas brauch ich. Alter, kommt mal, ohne Mist, 11,30 und derjenige, dem ihr das schenkt oder vielleicht kauft ihr es euch selbst, wenn ihr sowas von mich habt, der wird sich auf jeden Fall freuen."}, {"id": 91, "start": 1403.32, "end": 1418.32, "text": "Das ist absolut Pock. Und wie gesagt, ich hab das schon seit zwei, drei Jahren. Ich weiß nicht wie lange genau. Und es funktioniert wunderbar. Wo es nicht gut funktioniert, muss man sagen, ist wenn ihr ganz dicke Kabel habt."}, {"id": 92, "start": 1418.32, "end": 1434.32, "text": "Also bei sowas hier ist das alles noch vollkommen okay. Aber wenn ihr dann irgendwelche ganz fetten Stromkabel habt, die, wir können ja mal gucken, guck mal, das geht bis sechs Millimeter."}, {"id": 93, "start": 1434.32, "end": 1449.32, "text": "Da wird es aber schon echt eng. Also ich hab das mal probiert für so einen, fragt mich nicht, ich kenn mich mit Kabelbezeichnung nicht aus, nicht für so ein ganz fettes Stromkabel, für so ein mittelfettes Stromkabel und da hat es das schon ziemlich auseinandergerissen."}, {"id": 94, "start": 1449.32, "end": 1464.32, "text": "Also dafür ist es nicht so gut. Also wie gesagt, die Außenisolierung. Innen drinnen wieder überhaupt kein Problem. Aber ansonsten ist das Ding super. Und generell so fette Kabel verwendet man ja auch nicht, wenn man daheim irgendwas macht und vor allem wenn man irgendwas bastelt."}, {"id": 95, "start": 1464.32, "end": 1483.32, "text": "Da verwendet man ja immer kleinere Kabel, wozu sollte man super große, fette Dinger da nehmen. Also 95% was ich so mach, kann ich damit ohne Probleme abisolieren. Und ansonsten muss ich halt diese Außenhülle mit was anderem abschneiden und innen drinnen kannst du dann wieder mit dem Ding das machen."}, {"id": 96, "start": 1483.32, "end": 1497.32, "text": "Das hat auch einen Vorteil im Vergleich zu dem ganzen manuell zu machen, wenn man das damit abisoliert. Das ist immer gleich lang. Also hier kann man, hier seht ihr das ja, hier kann man einstellen wie lang das Ganze werden soll."}, {"id": 97, "start": 1497.32, "end": 1514.32, "text": "Und dann macht ihr das Kabel da vorne rein. Und dann macht ihr es auf, macht es rein und dann zack zack. Und dann ist das alles immer gleich lang. Ist wirklich sehr nice. Kann ich jedem nur empfehlen das Ding."}, {"id": 98, "start": 1514.32, "end": 1531.32, "text": "Und ich hab das jetzt auch schon im Chat ein paar Leute gesehen, die auch sagen sie haben das und finden das gut. Wartet mal Leute mein Kabel reibt wieder am Reißverschluss. Das ist echt scheiße. Das macht so dumme, so nervige Geräusche im Stream dann."}, {"id": 99, "start": 1531.32, "end": 1546.32, "text": "Ich machs jetzt, ich machs jetzt einfach mal um den Hals auf der anderen Seite runter. Jetzt ist das nicht so, ja jetzt ist es besser. Ich habe hier noch dieses eine Rode Mikrofon, was ich mir so an den Pulli klemmen kann."}, {"id": 100, "start": 1546.32, "end": 1556.32, "text": "Und das wollte ich eigentlich auch mal ausprobieren, aber da muss ich erstmal gucken wie ich das anschließt. So, also das war das erste. Machen wir weiter."}, {"id": 101, "start": 1556.32, "end": 1567.32, "text": "Ähm, auch noch direkt vom letzten Stream. Jakob0403, Twitch Prime, Dankeschön für den Sub. Exzellent."}, {"id": 102, "start": 1567.32, "end": 1582.32, "text": "Das stimmt, an engeren Stellen, Kilfe kann man damit nichts machen. Ja, also in welche Gehäuse rein oder so, wenn das nicht rausgeht, ist das damit ein bisschen schwierig. Weil das hat ja schon gewisse Größe, ne."}, {"id": 103, "start": 1582.32, "end": 1592.32, "text": "Wieso kosten zwei mehr als einzeln, ne, weil Amazon, das kann ich dir nicht sagen."}, {"id": 104, "start": 1592.32, "end": 1603.32, "text": "Wie findest du Proxmox ganz brauchbar? Ich hab da aber keinen Anwendungszweck bei mir daheim für. Ich hab's schon im Stream mal ausprobiert. Ist auf jeden Fall besser geworden in den letzten paar Versionen."}, {"id": 105, "start": 1603.32, "end": 1616.32, "text": "So, nächste. Ähm, da zeig ich euch jetzt nochmal stellvertretend was, weil das kam im letzten Stream auch. Ich hab zum Basteln so eine Silikon-Arbeitsmatte."}, {"id": 106, "start": 1616.32, "end": 1623.32, "text": "Sowas da. Ich glaub das ist sogar die, die ich hab hier. Entweder die hier oder die hier. So Dinger sind auch äußerst praktisch."}, {"id": 107, "start": 1623.32, "end": 1633.32, "text": "PFSense und OpenSense. Ich hatte immer OpenSense, aber ich hab keins von beiden mehr. Für Netzwerkkabel funktioniert es auch. Ja, für Netzwerkkabel funktioniert es."}, {"id": 108, "start": 1633.32, "end": 1646.32, "text": "Also für die inneren Netzwerkkabel funktioniert es ohne Probleme. Für die äußeren Netzwerkkabel funktioniert es auch noch. Aber, also größer darf es nicht mehr sein."}, {"id": 109, "start": 1646.32, "end": 1662.32, "text": "Das ist schon nicht mehr so hundertprozentig sauber bei Netzwerkkabel. Aber es geht. Kannst du machen mit. Aber viel fetter als so ein normales Netzwerkkabel darf es nicht sein."}, {"id": 110, "start": 1662.32, "end": 1677.32, "text": "So. Also, das ist auch eine Sache, die ich nur empfehlen kann. Für alle die basteln und das irgendwie auf dem Küchentisch machen oder früher hab ich mich immer auf die Erde gesetzt und auf den Teppich das gemacht."}, {"id": 111, "start": 1677.32, "end": 1694.32, "text": "Das lief dann mal so weit, dass ich irgendwann mit der Ferse mal in so einen Jumper-Wire-Pin gedreht bin. Da hab ich, weiß ich jetzt noch, ich bin auf dem Stuhl, hab ich mich so vorgerollt, so an den Rechner rangezogen mit dem Fuß und auf einmal hab ich so gemerkt an meiner Ferse."}, {"id": 112, "start": 1694.32, "end": 1712.32, "text": "Und es hat halt so ein Geräusch gemacht, so richtig so. Und da hat sich halt so ein, da hat sich halt so ein Pin hier. Genau. So ein Pin hatte ich dann in der Ferse stecken. Das war nicht so angenehm."}, {"id": 113, "start": 1712.32, "end": 1728.32, "text": "Dünne Kupferlitze klappt damit auch. Ja, du kannst ja gucken. Also, die sagen ja, es geht von 0,2 mm bis 6 mm. Also wenn du ganz, ganz, ganz Furzelkabel hast, dann wahrscheinlich nicht. Aber wie gesagt, bei mir geht 95% alles damit."}, {"id": 114, "start": 1728.32, "end": 1742.32, "text": "Das hat wehgetan. Und seitdem bastel ich nicht mehr auf der Erde. Und da kann ich so eine Silikonmatte nur empfehlen, weil das Zeug da ist absoluter Crap. Ich hoffe, das ist nicht dabei."}, {"id": 115, "start": 1742.32, "end": 1762.32, "text": "Das braucht nämlich kein, kein Mensch. Das wichtigste ist die Matte. Und da kann man rumgucken auf Amazon, was da so passt. Da gibt es zig, tausend Matten in dieser Richtung mit Fächern einfach nur glatt und sonst was. Das da kann glatt ein Mousepad sein."}, {"id": 116, "start": 1762.32, "end": 1786.32, "text": "So und das ist nützlich. Erstens, weil das Zeug da drauf nicht so rutscht. Diese Fächer da oben. Ich muss euch ehrlich sagen, ich verwende sie nie. Wenn mal jemand ist oder wenn man jemand beschenken will, der da total ordentlich ist, dann freut er sich vielleicht darüber. Ich verwende die Dinge eigentlich nicht oder zumindest ganz selten."}, {"id": 117, "start": 1786.32, "end": 1801.32, "text": "Man kann, was echt ein nicer Hack ist, man kann, wenn man die Unterlage immer auf den gleichen Tisch oder so legt, man kann da auch Magnete drunter machen. Also muss man dann selbst machen."}, {"id": 118, "start": 1801.32, "end": 1817.32, "text": "Magnete drunter kleben zum Beispiel, wenn man will, dass man manche Sachen da besser dran befestigen kann. Ist auch eine Idee wert. Habe ich mal in einem Video gesehen, finde ich es eigentlich eine gute Idee. Und wenn so ein Magnet dran pappt, dass es dann nicht mehr so wackelt. Aber insgesamt ist das halt gut."}, {"id": 119, "start": 1817.32, "end": 1846.32, "text": "Erstens, das Zeug rutscht da drauf nicht so. Es hat ein bisschen einen Rand, das Zeug fällt nicht runter. Und das hält auch mal den Lötkolben aus, so Teile. Ich weiß jetzt nicht, ob da irgendwas, genau, für die Wärme bis zu 500 Grad standhalten. Also, ich habe meinen Lötkolben, normalerweise, so die Lötstation steht standardmäßig auf 380 Grad. Und ich habe es im letzten Stream dran gehalten, da ist nichts passiert. Ich würde es nicht lange dran halten, weil das auch für den Lötkolben nicht gerade toll ist. Aber der Mathe hat es nichts gemacht."}, {"id": 120, "start": 1846.32, "end": 1860.32, "text": "So."}, {"id": 121, "start": 1860.32, "end": 1889.32, "text": "Aha. Ja. Oder man ist der Lockpicking-Lawyer, dann guckt man die Tür noch scharf an, dann geht sie auf. Nee, der Gamer Alex, das hält die Mathe aus. Guck mal, die schreien 500 Grad. Du stellst deine Lötkolben nicht auf 500 Grad. Ich weiß gar nicht, ob ich meine überhaupt, was maximale Temperatur ist. Ich guck mal, was die maximale Temperatur von meiner Lötstation ist."}, {"id": 122, "start": 1889.32, "end": 1906.32, "text": "450, guck mal. Ich kann sie maximal auf 450 stellen. Das ist schon ganz schön viel. Das braucht man eigentlich nicht. Das hält die aus. Wie gesagt, lang würde ich sie eh nicht machen, das verhält das Marke der Lötkolben auch nicht sonderlich."}, {"id": 123, "start": 1906.32, "end": 1920.32, "text": "Aber sag mal so, wenn das die Haltmarke irgendwie runterfällt oder aus der Hand fällt, dann ist das kein Problem, das hält das aus. Das stinkt noch nicht mal großartig. Muss ich gleich wieder wegmachen."}, {"id": 124, "start": 1920.32, "end": 1937.32, "text": "Max, bist du noch DevOps-Engineer beruflich? Ja, bin ich noch. Aktuell bin ich daheim, weil ich Urlaub hab bis Januar. Aber danach wieder. Genau. Exzellent."}, {"id": 125, "start": 1937.32, "end": 1954.32, "text": "So, also das ist das nächste. Kann ich mir gesagt auch nur Wermstens empfehlen, im wahrsten Sinne des Wortes. 380 ist schon ziemlich viel, ja. Ich hab den auch nur auf 380 stehen, weil das Default auf 380 eingestellt war."}, {"id": 126, "start": 1954.32, "end": 1967.32, "text": "Nee, wahrscheinlich ist es sogar besser, wenn ich es ein bisschen runter machen würde, aber es war Default eingestellt und ich hab mir gedacht, ja. Scheiß drauf."}, {"id": 127, "start": 1967.32, "end": 1984.32, "text": "Okay, das ist natürlich was anderes, wenn Jellystar sagt, er verwendet nur pleifreies, hab ich noch nie verwendet, by the way, er verwendet nur pleifreies Lötzinn. Dann ist das wieder was anderes."}, {"id": 128, "start": 1984.32, "end": 1997.32, "text": "Pleifreies Lötzinn fließt schlechter und braucht deutlich mehr Temperatur, dass es ordentlich flüssig gemacht werden kann. Ja, dann kann ich dann, ja, logisch."}, {"id": 129, "start": 1997.32, "end": 2018.32, "text": "Aber ich hab so 0815 Lötzinn, das ist glaube ich, was ist das, 30% Plei, 70% Zinn und in der Mitte ist irgendwie so ein bisschen Harz oder sowas drin. Aber ohne das Harz geht es nicht, das fließt nicht gescheit sonst."}, {"id": 130, "start": 2018.32, "end": 2027.32, "text": "Okay, also nächstes. Auch eine Sache, die wir letztens, Flussmittel, genau, das ist doch irgendwie so eine Art Harz, was da drin ist."}, {"id": 131, "start": 2027.32, "end": 2052.32, "text": "So, auch eine Sache, die für jeden Bastler, unabhängig davon, ob er das für Stromkabel fände oder für irgendwelche anderen Sachen, was für jeden Bastler Poggers ist und was die wenigsten Bastler, die nicht gerade Elektriker sind, kennen, kauft ihn ein Vago-Klemmen-Set."}, {"id": 132, "start": 2052.32, "end": 2069.32, "text": "201. Kauft ihn irgendwie ein Set davon. Das sind absolute Poggers-Klemmen. Poggers-Klemmen, Alter. Poggers-Klemmen."}, {"id": 133, "start": 2069.32, "end": 2082.32, "text": "So, irgendwas, was bei euch der Geldbeutel hergibt. Aber so ein Set hat den Vorteil, dass man eben für alle Eventualitäten da ein bisschen was dabei hat."}, {"id": 134, "start": 2082.32, "end": 2100.32, "text": "Das ist hier so ein bisschen klein für den Preis. Ich würde wahrscheinlich irgendwie sowas hier nehmen. Ich würde wahrscheinlich irgendwie sowas hier nehmen. Das ist, glaube ich, so mehr oder weniger auch das, was ich mir gekauft habe. Du hast einen Set Zweier, du hast einen Set Dreier und du hast einen Set, glaube ich, Fünfer."}, {"id": 135, "start": 2100.32, "end": 2118.32, "text": "Es gibt, glaube ich, noch Vierer und gibt es noch Sechser? Ich weiß es nicht. Aber das ist okay. Man muss es ja nicht übertreiben. Und die Dinger sind wirklich nice."}, {"id": 136, "start": 2118.32, "end": 2126.32, "text": "Also die Dinger sind wirklich nice und jeder Bastler freut sich darüber, auch wenn er nicht weiß, dass es das gibt."}, {"id": 137, "start": 2126.32, "end": 2133.32, "text": "Was ist der Vorteil von solchen zu normalen Lüsterklemmen? Du musst nicht schrauben. Du musst nicht schrauben. Wahrscheinlich ist der Kontakt ein bisschen besser."}, {"id": 138, "start": 2133.32, "end": 2144.32, "text": "Und sie eignen sich halt auch für Kabel, die aus mehreren kleinen Kabeln bestehen. Also Lüsterklemmen eignen sich ja, glaube ich, nur für starre Kabel. Also da, wo halt ein durchgängiges Kupferding ist."}, {"id": 139, "start": 2144.32, "end": 2168.32, "text": "Weil wenn du in Lüsterklemmen normale Litzenkabel machst, also diese ganz, diese elastischen Kabel, die bestehen ja unter der Isolierung aus vielen kleinen Äderchen, dann hast du bei Lüsterklemmen das Problem, dass wenn du die Schraube hinein machst, dass du dann die Schraube quasi nur auf eine Stelle drückst und die restlichen kleinen Kupfer-Äderchen gehen halt drum herum."}, {"id": 140, "start": 2168.32, "end": 2188.32, "text": "Da hast du kaum Kontakt. Im Zweifelsfall kannst du wahrscheinlich sogar anfangen zu brennen, wenn der Kontakt zu schlecht ist. Also es ist angenehmer und es ist halt praktisch."}, {"id": 141, "start": 2188.32, "end": 2203.32, "text": "Flo690, die schreiben selbst auf ihrer Seite, dass du das für beides verwenden kannst. Du kannst das verwenden für starre Kabel und für, guck, das haben die sogar bei sich auf der Seite stehen."}, {"id": 142, "start": 2203.32, "end": 2221.32, "text": "This is Manjaro Linux and i3 WM as Window Manager. Guck, die schreiben sogar auf ihrer Seite, dass es geht für Litzenkabel und durchgängige Kabel."}, {"id": 143, "start": 2221.32, "end": 2241.32, "text": "Ah, yes. Exzellent. Exquisite, ja. Irgendwann mach ich ein komplettes Englisch-Video. Komplett nur in Englisch. Guck hier. Man kann die schon für alles, beide verwenden."}, {"id": 144, "start": 2241.32, "end": 2257.32, "text": "Was es ja eigentlich noch besser macht. So. Also das ist auch was, wo uns jeder Bastler drüber freuen wird. Kann man nur empfehlen. Und so ein Set halt hat den Vorteil, weil man weiß ja im Vorfeld nicht, was man braucht."}, {"id": 145, "start": 2257.32, "end": 2272.32, "text": "Man denkt meistens, man kommt mit 1, 3er aus und dann braucht man doch mal 5. Aber für die meisten Sachen reicht das auch."}, {"id": 146, "start": 2272.32, "end": 2287.32, "text": "Ja, Jelly ist da richtig. Bin mir nicht sicher, ob die hier auch noch bis 4mm gehen, aber du scheinst dich damit auszukennen. Ich glaub dir das jetzt. Aber für das, was man normalerweise, hier, genau, da steht es doch."}, {"id": 147, "start": 2287.32, "end": 2304.32, "text": "Was man normalerweise daheim bei Bastler Aktionen macht. Paar LED-Strips zusammen. Passt das alles wunderbar. Ja. Also das kann ich auch nur jedem Bastler ans Herz legen, sich sowas zu kaufen."}, {"id": 148, "start": 2304.32, "end": 2318.32, "text": "Dann nochmal ganz schnell, weil ihr wisst, dass ich ein großer Fan von bin, aber es nicht so teuer ist. Die LED-Strips mach ich nicht. Oder mach ich die LED-Strips? Ich mach mal die LED-Strips mit in die Liste morgen. Ich glaub, das kommt ganz gut an."}, {"id": 149, "start": 2318.32, "end": 2341.32, "text": "Eine Sache, wo ihr wisst, bin ich Fan von. Ich will es jetzt nicht zu sehr zelebrieren. Vera Tool-Check Plus. Freut sich jeder Bastler drüber. Moment, wo ist er? Oh, gibt es den gerade gar nicht? Ist der gar nicht lieferbar gerade?"}, {"id": 150, "start": 2341.32, "end": 2361.32, "text": "Kennst du die Dinger? Nein. Kenn ich nicht. Es gibt gar keinen Tool-Check Plus. Was ist hier? Also das hier ist es, aber die gibt es gar nicht zu kaufen. Erhältlich bei diesen Anbietern. Tja."}, {"id": 151, "start": 2361.32, "end": 2375.32, "text": "Das ist sehr beliebt zu Weihnachten, wie es aussieht. Müsst ihr mal rumgucken. Normalerweise ist der nämlich eine ganze Ecke günstiger. Irgendwas um 50 Euro oder so. Teilweise gibt es den angeboten sogar noch billiger."}, {"id": 152, "start": 2375.32, "end": 2401.32, "text": "Ja, hier. So, guckt hier 43. Das ist zum Beispiel echt ganz nett vom Preis her. Und ich will jetzt nicht zu lange drauf rumreiten, weil ihr wisst, dass ich das Ding super finde. Wenn einer ein bisschen ordentliches Werkzeug braucht, vielleicht ist auch einer gerade mal umgezogen oder hat seine erste Wohnung oder sowas in der Richtung. Das Ding ist super Universal-Lösung."}, {"id": 153, "start": 2401.32, "end": 2420.32, "text": "Da hast du alles dabei. Du hast so die gängigen Nüsse. Du hast so die meisten Bits, bis auf so Spezial-Bits. Dafür kommen wir gleich zu. Du hast so einen kleinen Schraubendreher, den kannst du ein bisschen verlängern. Und du hast so eine Mini-Metall-Ratsche plus Bithalter."}, {"id": 154, "start": 2420.32, "end": 2440.32, "text": "Also man hat echt alles dabei. Wenn man jetzt nicht gerade Reifen wechseln will am Auto, kann man damit alles schraubemäßig machen, was man so im Haushalt machen will. Und weil es gerade schon einer im Chat geschrieben hat, wenn man ausgefallene Sachen hat, dann bietet sich auch so ein Ding hier an."}, {"id": 155, "start": 2440.32, "end": 2456.32, "text": "Das ist allerdings nicht dieses Set. Dieses Set ist der Preis echt nicht wert. Das normale iFixit-Set mit den Bits kostet 34 Euro und dieses Pro-Ding. Also diese billige Dinger sind keine 30 Euro obendrauf noch mal wert."}, {"id": 156, "start": 2456.32, "end": 2471.32, "text": "Das ist so ein Anti-Start, wie heißt das Ding? ESD-Armband. Dann irgendwelche komischen Zahnarzt-Instrumente, wo ich die erste schon im Stream verbogen habe. Billigste Zahnen. Also, nee, brauchen wir nicht."}, {"id": 157, "start": 2471.32, "end": 2491.32, "text": "Also ich würde sowas hier kaufen, wenn man die seltenen Bits braucht. Also qualitativ ist der Tool-Check Plus komplett andere Liga als das Ding. Wenn du bei den Bits hier ein bisschen fest drehst, ist auch mal vielleicht nicht ne Ecke ab, aber sind nicht mehr so ganz gerade."}, {"id": 158, "start": 2491.32, "end": 2509.32, "text": "Also wenn man Sachen reparieren will oder wenn man öfters so ausgefallene Sachen braucht, zum Beispiel wenn man China-Steckdosen aufmachen will oder China-Geräte oder irgendwas, dann bietet sich als Ergänzung so ein iFixit-Ding an."}, {"id": 159, "start": 2509.32, "end": 2523.32, "text": "Das hat nämlich auch den Vorteil, hier oben ist ein Adapter dabei, rechts oben hier in der Ecke, der da. Damit könnt ihr alle diese Bits auch im Tool-Check Plus benutzen. Und dann ist wieder gut."}, {"id": 160, "start": 2523.32, "end": 2544.32, "text": "Nehmt ihr das Ding, macht den Bit rein, ihr macht den Bit rein und... Moment, ich zeig's euch mal. Ihr macht den Bit, ihr macht hier diesen Adapter-Bit rein und dann könnt ihr das auch entweder in der Ratsche verwenden oder hier in dem Schraubendreher."}, {"id": 161, "start": 2553.32, "end": 2560.32, "text": "So. Und dann zeig ich euch noch mal meinen persönlichen Liebling, aber das hab ich euch letztens schon gezeigt, deswegen nur mal ganz kurz."}, {"id": 162, "start": 2560.32, "end": 2573.32, "text": "Was ich echt gern hab, was so mein Lieblings-Set von Vera ist, ist dieses Vera-Zyklop-Elektriker-Set. Das kostet aber noch ne ganze Ecke mehr, das kann ich nicht wirklich als Weihnachtsgeschenk empfehlen."}, {"id": 163, "start": 2573.32, "end": 2586.32, "text": "Das da. Es sei denn, ihr wollt einen für 90 Euro was schenken. Das benutze ich ehrlich gesagt am liebsten, da hast du auch so die gängigen Sachen dabei, inklusive der wirklich ordentlichen Ratsche."}, {"id": 164, "start": 2586.32, "end": 2601.32, "text": "Gut, den Phasen-Prüfer braucht man nicht. So die gängigen Größen, wo man mal einen Maul-Schlüssel plaudert, ist auch, ich glaube, 10 und 13. Und hier kannst du quasi mit diesem Handteil, kannst du hier die einzelnen Dinger durchwechseln, was man gerade so braucht."}, {"id": 165, "start": 2601.32, "end": 2611.32, "text": "Und da hat man natürlich schon ein bisschen mehr Kraft und ein bisschen mehr Reichweite als mit dem Tool-Check Plus. Das ist so mein persönliches Lieblings-Set, aber das ist ein bisschen teuer für Weihnachten. Deswegen."}, {"id": 166, "start": 2611.32, "end": 2615.32, "text": "Das da ist so als Einstiegsding wirklich nice."}, {"id": 167, "start": 2615.32, "end": 2633.32, "text": "Zeig mal das Fein-Mechanik-Dreherset von Vera. Das wollte ich mir auch mal kaufen, aber hab ich nicht gewacht. Das da, das ist natürlich auch ganz schön teuer, ne?"}, {"id": 168, "start": 2633.32, "end": 2647.32, "text": "Das ist ganz schön teuer, aber sicherlich bestimmt nice. Kann ich aber nichts zu sagen, hab ich nicht. Wollte ich mir mal kaufen, hab ich mir auch gedacht, ey, ich hab schon genug Dinger, die ich dafür verwenden kann."}, {"id": 169, "start": 2647.32, "end": 2661.32, "text": "Wenn was kaputt geht, kann ich es mir immer noch kaufen. Ich brauch nicht, ich muss mir nicht, ich muss mal ein bisschen davon wegkommen. Das hab ich mir auch so vorgenommen und das hab ich auch für dieses Jahr schon, schon hatte ich mir das immer wieder vorgenommen, dass ich mir nicht so viel sinnloses Zeug mehr kaufe, einfach weil ich es haben will."}, {"id": 170, "start": 2661.32, "end": 2665.32, "text": "Vielleicht kann sich eine eine oder andere mit internifizieren."}, {"id": 171, "start": 2668.32, "end": 2675.32, "text": "Ich hab mir in der Vergangenheit viel zu viel sinnloses Zeug gekauft, was ich nicht brauche, einfach weil ich es haben wollte."}, {"id": 172, "start": 2675.32, "end": 2677.32, "text": "Genau."}, {"id": 173, "start": 2677.32, "end": 2683.32, "text": "Also das ist beides ganz nett und gerade das hier kann man auch mal als Weihnachtsgeschenk machen."}, {"id": 174, "start": 2683.32, "end": 2697.32, "text": "Genau, so viel zu diesen Werkzeug Sachen. Wie gesagt, das ist, was ich mir aufgeschrieben habe, ist komplett durch Querbeet."}, {"id": 175, "start": 2697.32, "end": 2701.32, "text": "Dann noch was für alle Informatikors unter uns."}, {"id": 176, "start": 2701.32, "end": 2713.32, "text": "Wer Spaß am Programmieren hat und ein bisschen C-Sharp programmiert, dem kann ich nur dieses Buch hier, meiner Meinung nach das beste C-Sharp Buch, was es gibt für Leute, die die Sprache schon können."}, {"id": 177, "start": 2713.32, "end": 2716.32, "text": "C-Sharp in Action."}, {"id": 178, "start": 2716.32, "end": 2718.32, "text": "Bestes Buch."}, {"id": 179, "start": 2720.32, "end": 2727.32, "text": "Wo ist das denn? Nee, nicht in Action, in Depth mein ich, nicht in Action. In Action heißen die Dinger nur bei den anderen immer, vergiss das hier mein ich."}, {"id": 180, "start": 2727.32, "end": 2729.32, "text": "C-Sharp in Depth."}, {"id": 181, "start": 2729.32, "end": 2735.32, "text": "Legendary Stack Overflow Mensch am Start."}, {"id": 182, "start": 2735.32, "end": 2739.32, "text": "In Depth, nicht in Action."}, {"id": 183, "start": 2739.32, "end": 2743.32, "text": "Das ist meiner Meinung nach das beste C-Sharp Buch zum vertiefen."}, {"id": 184, "start": 2743.32, "end": 2747.32, "text": "Ja, das ist, finde ich das beste Buch."}, {"id": 185, "start": 2747.32, "end": 2749.32, "text": "In der Richtung."}, {"id": 186, "start": 2749.32, "end": 2754.32, "text": "Der Kerl hat glaube ich die meisten Stack Overflow Punkte von allen."}, {"id": 187, "start": 2754.32, "end": 2761.32, "text": "Man kann es auch als Hörbuch sich anhören."}, {"id": 188, "start": 2761.32, "end": 2768.32, "text": "Ok, was auch immer."}, {"id": 189, "start": 2768.32, "end": 2773.32, "text": "Jetzt ist Amazon RIP."}, {"id": 190, "start": 2773.32, "end": 2778.32, "text": "Ja, ihr könnt auch mal gucken, ob ihr das irgendwo günstiger kriegt."}, {"id": 191, "start": 2778.32, "end": 2792.32, "text": "Aber gerade für Leute, die schon ein bisschen C-Sharp kennen, finde ich das super."}, {"id": 192, "start": 2792.32, "end": 2808.32, "text": "Geh nochmal zurück, wohin? Da hin?"}, {"id": 193, "start": 2808.32, "end": 2816.32, "text": "Windows Forms in Action, da ist ja irgend so ein, äh, warum ist da so ein Crossbow Dude drauf?"}, {"id": 194, "start": 2816.32, "end": 2819.32, "text": "Rx in Action."}, {"id": 195, "start": 2819.32, "end": 2823.32, "text": "Taps und Java zu lernen, nein, da bin ich der Falsche für, keine Ahnung."}, {"id": 196, "start": 2823.32, "end": 2830.32, "text": "Kennst du die Sprache Beef? Hab ich eben schon mal was zu gesehen, ja."}, {"id": 197, "start": 2830.32, "end": 2833.32, "text": "Such nochmals die Sharp in Depth."}, {"id": 198, "start": 2833.32, "end": 2845.32, "text": "Hab ich?"}, {"id": 199, "start": 2845.32, "end": 2850.32, "text": "Also mal gucken, dass man die neueste Edition kriegt."}, {"id": 200, "start": 2850.32, "end": 2853.32, "text": "Tipps von Zero aus C-Sharp zu lernen."}, {"id": 201, "start": 2853.32, "end": 2859.32, "text": "Ja, und zwar, das ist das beste Buch zum verschenken."}, {"id": 202, "start": 2859.32, "end": 2864.32, "text": "Leben mit einem großen Penis Rat und Weisheit für Männer, die außerordentlich gut ausgestattet sind."}, {"id": 203, "start": 2864.32, "end": 2874.32, "text": "Ah ja, ok, das ist natürlich was, das muss man unbedingt wissen."}, {"id": 204, "start": 2874.32, "end": 2882.32, "text": "Das ist das Gegenteil von Big Brain, Big Cock."}, {"id": 205, "start": 2882.32, "end": 2887.32, "text": "Ich glaube selten in Kombinationen."}, {"id": 206, "start": 2887.32, "end": 2892.32, "text": "Naja, aber wie gesagt, das Buch, finde ich, ist eine super Geschichte für Leute, die schon ein bisschen C-Sharp kennen, sich dafür interessieren."}, {"id": 207, "start": 2892.32, "end": 2900.32, "text": "So, Einstieg in C-Sharp, ganz ehrlich, nach wie vor, finde ich, muss man dafür kein Geld ausgeben."}, {"id": 208, "start": 2900.32, "end": 2908.32, "text": "Man kann erstmal anfangen mit dem C-Sharp Open Book von Reinwerk heißen sie mittlerweile."}, {"id": 209, "start": 2908.32, "end": 2911.32, "text": "Früher hieß es immer Galileo."}, {"id": 210, "start": 2911.32, "end": 2914.32, "text": "Das hier, das ist zum Einstieg immer noch gut."}, {"id": 211, "start": 2914.32, "end": 2920.32, "text": "Die Seite sieht nur so scheiße aus, weil ich Dark Reader auf hab."}, {"id": 212, "start": 2920.32, "end": 2922.32, "text": "Das ist zum Einstieg wirklich gut."}, {"id": 213, "start": 2922.32, "end": 2937.32, "text": "Allerdings, es lohnt sich nur bis Kapitel 16."}, {"id": 214, "start": 2937.32, "end": 2940.32, "text": "Den Rest brauchst du nicht."}, {"id": 215, "start": 2940.32, "end": 2942.32, "text": "Was für Geschenke hast du bisher so gefunden?"}, {"id": 216, "start": 2942.32, "end": 2948.32, "text": "Ich finde keine Geschenke, ich zeig euch Geschenke, die man nehmen kann für Leute, die sich ein bisschen mit Technik interessieren."}, {"id": 217, "start": 2948.32, "end": 2953.32, "text": "Also, bis Kapitel 16, dann kennste die schon mal ganz gut aus."}, {"id": 218, "start": 2953.32, "end": 2963.32, "text": "Und ansonsten, Stack Overflow, YouTube Tutorials, GitHub, Code von anderen Lesen."}, {"id": 219, "start": 2963.32, "end": 2970.32, "text": "Microsoft hat auch ziemlich gute Casts, Webcasts mittlerweile dazu."}, {"id": 220, "start": 2970.32, "end": 2973.32, "text": "Kennst du ein gutes Cobalt-Poof für uns?"}, {"id": 221, "start": 2973.32, "end": 2976.32, "text": "Nee, erst mal Händewaschen."}, {"id": 222, "start": 2976.32, "end": 2981.32, "text": "Ich weiß, dass ich an Weihnachten ein bisschen Cobalt programmieren muss für den Stream."}, {"id": 223, "start": 2981.32, "end": 2988.32, "text": "So, nächste Sache, wo ich mir denke, das ist auch eine ganz nette Geschichte."}, {"id": 224, "start": 2988.32, "end": 2990.32, "text": "Ein NFC-Starter-Set."}, {"id": 225, "start": 2990.32, "end": 2997.32, "text": "Ich hab das hier, gerade wenn man ein iPhone hat, also ein neueres iPhone."}, {"id": 226, "start": 2997.32, "end": 3000.32, "text": "Bei Android ist das ja schon länger verbreitet."}, {"id": 227, "start": 3000.32, "end": 3007.32, "text": "Oder ein halbwegs aktuelles Android-Tablet mit einem NFC-Reader drin."}, {"id": 228, "start": 3007.32, "end": 3012.32, "text": "Und weil es ja nicht nur ein NFC-Reader ist, es ist ja auch immer Automat, ein NFC-Writer."}, {"id": 229, "start": 3012.32, "end": 3017.32, "text": "Dann kann man sehr viel mit NFC-Tags machen."}, {"id": 230, "start": 3017.32, "end": 3021.32, "text": "Und die meisten Leute verwenden das Zeug überhaupt nicht."}, {"id": 231, "start": 3021.32, "end": 3027.32, "text": "Bestes Stream-Dec, ganz einfach, mein eigenes."}, {"id": 232, "start": 3027.32, "end": 3046.32, "text": "Mein eigenes Stream-Dec ist das beste Stream-Dec."}, {"id": 233, "start": 3046.32, "end": 3056.32, "text": "Mein Stream-Dec ist das beste."}, {"id": 234, "start": 3056.32, "end": 3064.32, "text": "Wer hat schon in seinem Stream-Dec eine koreanische Text-to-Speech-Engine drin?"}, {"id": 235, "start": 3064.32, "end": 3068.32, "text": "Oder kann sowas hier?"}, {"id": 236, "start": 3068.32, "end": 3070.32, "text": "Willst du in naher Zukunft nochmal einen Battlefield 3 geben?"}, {"id": 237, "start": 3070.32, "end": 3073.32, "text": "Ja, ich denke schon."}, {"id": 238, "start": 3073.32, "end": 3081.32, "text": "Ich hab irgendeine uralte Version auf GitHub, aber die würde ich nicht verwenden."}, {"id": 239, "start": 3081.32, "end": 3087.32, "text": "So, ähm..."}, {"id": 240, "start": 3087.32, "end": 3091.32, "text": "Staubsauger-Roboter, ja, da hab ich..."}, {"id": 241, "start": 3091.32, "end": 3093.32, "text": "Die sind so teuer, die guten."}, {"id": 242, "start": 3093.32, "end": 3095.32, "text": "Da würde ich keinem was empfehlen zu Weihnachten."}, {"id": 243, "start": 3095.32, "end": 3096.32, "text": "Das ist ganz schön, ganz schön viel."}, {"id": 244, "start": 3096.32, "end": 3100.32, "text": "Ja, genau, also wie gesagt, NFC-Tags bieten sich an."}, {"id": 245, "start": 3100.32, "end": 3105.32, "text": "Viele Leute haben mittlerweile Handys mit NFC-Reader, NFC-Writer drauf, aber verwenden sie für nichts."}, {"id": 246, "start": 3105.32, "end": 3108.32, "text": "Dabei kann man damit wirklich coole Geschichten machen."}, {"id": 247, "start": 3108.32, "end": 3111.32, "text": "Zum Beispiel, ich hab das so gemacht bei mir."}, {"id": 248, "start": 3111.32, "end": 3115.32, "text": "Ich hab nebenbei ein Bett einliegen, wenn ich das Handy da drauflege."}, {"id": 249, "start": 3115.32, "end": 3119.32, "text": "Trigger, ich meine, Max geht ins Bett, Automatisierung."}, {"id": 250, "start": 3119.32, "end": 3122.32, "text": "Und was ich auch ganz cool finde, beispielsweise, wenn ich im Klo bin,"}, {"id": 251, "start": 3122.32, "end": 3126.32, "text": "dann hab ich in der Tonne, wo das Klopapier drin liegt, hab ich auch einen NFC-Tag."}, {"id": 252, "start": 3126.32, "end": 3130.32, "text": "Wenn ich da mein Handy dranhalte, geht der Heizlüfter an, dass es mir nicht an der Arsch friert."}, {"id": 253, "start": 3130.32, "end": 3134.32, "text": "Na gut, der Arsch friert es mir eventuell schon, weil der ist ja im Klo,"}, {"id": 254, "start": 3134.32, "end": 3138.32, "text": "aber das ist drumherum nicht friert, ihr wisst, was ich meine."}, {"id": 255, "start": 3138.32, "end": 3143.32, "text": "Das Ganze sieht dann so aus, ich hab das ja auch letztens mal auf Twitter gepostet."}, {"id": 256, "start": 3145.32, "end": 3147.32, "text": "Hier, NFC-Tags, da sieht man das Ganze."}, {"id": 257, "start": 3147.32, "end": 3150.32, "text": "Oh, Alter, ich bin blind hier, ich seh nichts."}, {"id": 258, "start": 3150.32, "end": 3153.32, "text": "Genau, guck, da ist der Lüfter."}, {"id": 259, "start": 3154.32, "end": 3156.32, "text": "Jetzt ist Twitter kaputt."}, {"id": 260, "start": 3157.32, "end": 3159.32, "text": "Doch, das Klo ist beheizt."}, {"id": 261, "start": 3159.32, "end": 3161.32, "text": "Das Wasser ist beheizt, die Klobrille nicht."}, {"id": 262, "start": 3161.32, "end": 3164.32, "text": "Genau, da hängt der NFC-Tag."}, {"id": 263, "start": 3166.32, "end": 3168.32, "text": "Das iPhone hat auch einen Writer eingebaut."}, {"id": 264, "start": 3168.32, "end": 3172.32, "text": "Die können eigentlich alle Texts Writen und Readen."}, {"id": 265, "start": 3172.32, "end": 3176.32, "text": "So, da ist der NFC-Tag, Handy dran,"}, {"id": 266, "start": 3178.32, "end": 3181.32, "text": "Shortcut, das ist halt die App von iOS, die dafür zuständig ist,"}, {"id": 267, "start": 3181.32, "end": 3185.32, "text": "Detektet und zack, geht der Heizer an. Habt ihr das gesehen?"}, {"id": 268, "start": 3185.32, "end": 3189.32, "text": "Zack, wieder aus und zack, wieder an."}, {"id": 269, "start": 3189.32, "end": 3192.32, "text": "Und das Ganze funktioniert nur, weil ich hier hinten..."}, {"id": 270, "start": 3195.32, "end": 3197.32, "text": "Alter, Twitter, please."}, {"id": 271, "start": 3200.32, "end": 3203.32, "text": "Das Videoplayer-Feature von Twitter ist schon ganz schön schlecht."}, {"id": 272, "start": 3204.32, "end": 3207.32, "text": "Ja, hier hinten hab ich halt so eine Steckdose, die ich übers WLAN ausschalten kann,"}, {"id": 273, "start": 3207.32, "end": 3211.32, "text": "was halt übers iPhone dann getriggert wird, über meine Heimautomatisierung."}, {"id": 274, "start": 3211.32, "end": 3213.32, "text": "Aber man kann auch andere Sachen machen."}, {"id": 275, "start": 3213.32, "end": 3218.32, "text": "Man kann beispielsweise, wenn man in die Tür reinkommt, irgendwas einschalten."}, {"id": 276, "start": 3218.32, "end": 3220.32, "text": "Oder wenn man irgendwas hat, wo man..."}, {"id": 277, "start": 3220.32, "end": 3222.32, "text": "Oder Nachrichten verschicken oder sonst was."}, {"id": 278, "start": 3222.32, "end": 3225.32, "text": "Oder wenn man rausgeht, dass man irgendwie noch mal einen Report bekommt,"}, {"id": 279, "start": 3225.32, "end": 3227.32, "text": "was vielleicht noch offen ist oder so."}, {"id": 280, "start": 3228.32, "end": 3232.32, "text": "Damit kann man quasi Sachen triggern wie mit einem Knopf,"}, {"id": 281, "start": 3232.32, "end": 3235.32, "text": "nur dass man keinen Knopf braucht, das ein Bruchteil von einem Knopf kostet,"}, {"id": 282, "start": 3235.32, "end": 3239.32, "text": "und man damit halt richtig coole Sachen machen kann."}, {"id": 283, "start": 3239.32, "end": 3242.32, "text": "So, und Leute, die gerne, also die Technik interessiert sind,"}, {"id": 284, "start": 3242.32, "end": 3248.32, "text": "die gerne ein bisschen basteln, ist das eine super Geschichte."}, {"id": 285, "start": 3250.32, "end": 3252.32, "text": "Zumal es hier ein komplettes Set gibt."}, {"id": 286, "start": 3252.32, "end": 3254.32, "text": "Das gibt's bestimmt auch noch viel billiger."}, {"id": 287, "start": 3254.32, "end": 3256.32, "text": "Also du hast alle möglichen Sachen dabei."}, {"id": 288, "start": 3256.32, "end": 3259.32, "text": "Du hast ein paar Karten dabei, du hast ein paar Sachen zum Aufkleben dabei."}, {"id": 289, "start": 3259.32, "end": 3261.32, "text": "Du hast ein paar magnetische Sachen dabei."}, {"id": 290, "start": 3261.32, "end": 3264.32, "text": "Du hast ein paar Sachen zum Umhängen oder dranhängen oder sonst was."}, {"id": 291, "start": 3264.32, "end": 3266.32, "text": "Noch ein paar magnetische. Wunderbar."}, {"id": 292, "start": 3266.32, "end": 3269.32, "text": "Also ein NFC-Techset kann man immer mal gut verschenken"}, {"id": 293, "start": 3269.32, "end": 3272.32, "text": "und damit kann man auch viel machen."}, {"id": 294, "start": 3272.32, "end": 3277.32, "text": "Kann man die eigentlich auch mit Fritz-Deck-Steck-Dosen kombinieren?"}, {"id": 295, "start": 3279.32, "end": 3282.32, "text": "Wie stellst du dir das vor?"}, {"id": 296, "start": 3282.32, "end": 3285.32, "text": "Also was zum Beispiel?"}, {"id": 297, "start": 3285.32, "end": 3287.32, "text": "Nochmal wegen Battlefield 3, das gibt es ja aktuell."}, {"id": 298, "start": 3287.32, "end": 3290.32, "text": "Jaja, ich hab's ja vor zwei Tagen oder so im Stream gespielt,"}, {"id": 299, "start": 3290.32, "end": 3292.32, "text": "richtig die Noobs gebashed wieder,"}, {"id": 300, "start": 3292.32, "end": 3296.32, "text": "obwohl ich selbst schon eben nicht mehr gespielt hab."}, {"id": 301, "start": 3296.32, "end": 3299.32, "text": "Der 1.07, das gibt's bis zum Januar,"}, {"id": 302, "start": 3299.32, "end": 3302.32, "text": "gibt's das auf Twitch Prime kostenlos."}, {"id": 303, "start": 3308.32, "end": 3313.32, "text": "Ich mein, wenn du dein Fritz-Deck in der Heimautomatisierung drin hast,"}, {"id": 304, "start": 3313.32, "end": 3315.32, "text": "dann kannst du natürlich das kombinieren."}, {"id": 305, "start": 3315.32, "end": 3317.32, "text": "Das ist ja gerade der Sinn davon,"}, {"id": 306, "start": 3317.32, "end": 3319.32, "text": "wenn du so ein Heimautomatisierungssystem verwendest,"}, {"id": 307, "start": 3319.32, "end": 3321.32, "text": "wie Home Assistant zum Beispiel,"}, {"id": 308, "start": 3321.32, "end": 3325.32, "text": "da machst du dann ein Fritz-Deck-Gedöns rein und sonstige Sachen."}, {"id": 309, "start": 3325.32, "end": 3328.32, "text": "Du kannst auch mit dem NFC-Tag deine Heizung triggern oder so."}, {"id": 310, "start": 3328.32, "end": 3330.32, "text": "Gar kein Problem, das funktioniert."}, {"id": 311, "start": 3337.32, "end": 3340.32, "text": "Genau, dann noch eine Idee."}, {"id": 312, "start": 3340.32, "end": 3343.32, "text": "Da will ich euch jetzt nichts Spezielles vorschlagen."}, {"id": 313, "start": 3343.32, "end": 3345.32, "text": "Wo man dran denken muss, ist,"}, {"id": 314, "start": 3345.32, "end": 3348.32, "text": "aktuell gerade für Leute, die in technischen Berufen arbeiten,"}, {"id": 315, "start": 3348.32, "end": 3350.32, "text": "die werden zum größten ein Homeoffice machen."}, {"id": 316, "start": 3350.32, "end": 3354.32, "text": "Und die meisten, zumindest kenn ich das von meinen Kollegen auf der Arbeit,"}, {"id": 317, "start": 3354.32, "end": 3358.32, "text": "haben einfach eine scheiß Webcam oder gar keine Webcam."}, {"id": 318, "start": 3358.32, "end": 3360.32, "text": "Das heißt, wenn ihr da einem einen gefällt,"}, {"id": 319, "start": 3360.32, "end": 3362.32, "text": "die halten das auch nicht für notwendig,"}, {"id": 320, "start": 3362.32, "end": 3364.32, "text": "wenn ihr da jemanden einen Gefallen tun wollt,"}, {"id": 321, "start": 3364.32, "end": 3367.32, "text": "kauft ihm eine Webcam."}, {"id": 322, "start": 3367.32, "end": 3370.32, "text": "Kann auch irgendeine billig logitärische Webcam sein."}, {"id": 323, "start": 3370.32, "end": 3373.32, "text": "Muss nix, muss nix, muss nix Gescheites sein."}, {"id": 324, "start": 3373.32, "end": 3375.32, "text": "Irgendwas, was lieferbar ist."}, {"id": 325, "start": 3375.32, "end": 3377.32, "text": "Also hier nix, nix für, das ist viel zu teuer."}, {"id": 326, "start": 3377.32, "end": 3380.32, "text": "Irgendwas anderes, irgendwie so billig, billig logitärisch crap."}, {"id": 327, "start": 3380.32, "end": 3385.32, "text": "Es ist allemal besser, als wenn die Leute diese komischen Dinger verwenden,"}, {"id": 328, "start": 3385.32, "end": 3388.32, "text": "die teilweise im Notebook eingebaut sind und so einen Scheißwinkel haben,"}, {"id": 329, "start": 3388.32, "end": 3390.32, "text": "dass du ihnen halb in die Nase guckst."}, {"id": 330, "start": 3390.32, "end": 3394.32, "text": "Also ich machs anders."}, {"id": 331, "start": 3394.32, "end": 3396.32, "text": "Ich machs anders."}, {"id": 332, "start": 3396.32, "end": 3402.32, "text": "Ich nehm immer mein iPhone und stell das hier neben an den zweiten Monitor,"}, {"id": 333, "start": 3402.32, "end": 3404.32, "text": "so unten drauf, und mach das anders."}, {"id": 334, "start": 3404.32, "end": 3408.32, "text": "Natürlich dann richtig gute Qualität."}, {"id": 335, "start": 3408.32, "end": 3424.32, "text": "Aber so eine einzelne Webcam ist für die meisten Leute, denke ich, nicht verkehrt."}, {"id": 336, "start": 3424.32, "end": 3431.32, "text": "Ja, ich würd da auch nicht übertrieben viel für ausgeben."}, {"id": 337, "start": 3431.32, "end": 3437.32, "text": "So. Und wie gesagt, ich kenn's von meinen Kollegen auf der Arbeit."}, {"id": 338, "start": 3437.32, "end": 3440.32, "text": "Informatik-Kurs sind ja prinzipiell faul."}, {"id": 339, "start": 3440.32, "end": 3443.32, "text": "Und man sagt auch mal ganz schnell, braucht man nicht,"}, {"id": 340, "start": 3443.32, "end": 3449.32, "text": "aber in Wirklichkeit freut sich jeder trotzdem, wenn er eine Webcam hat."}, {"id": 341, "start": 3449.32, "end": 3453.32, "text": "Kinect V2, oh, das ist ein riesen Ding."}, {"id": 342, "start": 3453.32, "end": 3457.32, "text": "So. Und weil der Chat das unbedingt sehen wollte,"}, {"id": 343, "start": 3457.32, "end": 3461.32, "text": "ja, man kann einem vielleicht auch zu Weihnachten LED-Strips schenken,"}, {"id": 344, "start": 3461.32, "end": 3465.32, "text": "wenn jemand wirklich auf Beleuchtung und Heimautomatisierung"}, {"id": 345, "start": 3465.32, "end": 3469.32, "text": "und Bastelkram in der Richtung steht."}, {"id": 346, "start": 3469.32, "end": 3471.32, "text": "Kann man machen."}, {"id": 347, "start": 3471.32, "end": 3476.32, "text": "Da würde ich euch aber empfehlen, nicht die billigsten Strips zu nehmen,"}, {"id": 348, "start": 3476.32, "end": 3479.32, "text": "wenn ihr sie einem schenken wollt, der bastelt."}, {"id": 349, "start": 3479.32, "end": 3484.32, "text": "Also ich hab zum Beispiel einmal die hier, aber die finde ich sind gar nicht so gut."}, {"id": 350, "start": 3484.32, "end": 3489.32, "text": "Das sind die, die ich beispielsweise hier jetzt am Fenster hab."}, {"id": 351, "start": 3489.32, "end": 3497.32, "text": "Aber wenn ihr einem was Gutes tun wollt, der gerne bastelt, unter anderem mit LED-Strips,"}, {"id": 352, "start": 3497.32, "end": 3502.32, "text": "und normalerweise würde ich es gar nicht hier reinnehmen,"}, {"id": 353, "start": 3502.32, "end": 3506.32, "text": "weil LED-Strips sind zwar sehr Spezielles, aber der Chat wollte es, ja,"}, {"id": 354, "start": 3506.32, "end": 3509.32, "text": "kann ich euch als LED-Strips die hier empfehlen."}, {"id": 355, "start": 3509.32, "end": 3520.32, "text": "Die sind eigentlich deutlich besser, weil das sind RGB-W-Sticks 5V."}, {"id": 356, "start": 3520.32, "end": 3525.32, "text": "Also sprich, natürlich seit der Tüte, der Chat ist immer schuld."}, {"id": 357, "start": 3525.32, "end": 3528.32, "text": "War das schon jemals anders?"}, {"id": 358, "start": 3528.32, "end": 3533.32, "text": "Das Gute an denen ist, die haben wie gesagt 4 LEDs drinnen."}, {"id": 359, "start": 3533.32, "end": 3536.32, "text": "Die haben rot, grün, blau und eine weiße LED drin."}, {"id": 360, "start": 3536.32, "end": 3539.32, "text": "Das heißt, sie kriegt schönere Farben hin und komplett hell,"}, {"id": 361, "start": 3539.32, "end": 3545.32, "text": "braucht auch nicht so viel Strom und dementsprechend brauchen wir doch kein riesiges, fettes Netzteil."}, {"id": 362, "start": 3545.32, "end": 3552.32, "text": "Also wenn ich einen LED-Strip verschenken wollte, was ich nicht machen würde, ehrlich gesagt,"}, {"id": 363, "start": 3552.32, "end": 3561.32, "text": "aber als der Chat wissen wollte, dann würde ich so einen hier nehmen."}, {"id": 364, "start": 3561.32, "end": 3566.32, "text": "Kannst du was überfehlen, dass ich über den Winter meine Heizung überwachen kann?"}, {"id": 365, "start": 3566.32, "end": 3571.32, "text": "Du willst mich debaten, meine Heizungsüberwachung zu zeigen, kann das sein?"}, {"id": 366, "start": 3571.32, "end": 3576.32, "text": "Ich weiß nicht, ob ich euch schon mal meine Überwachung gezeigt habe von der Heizung,"}, {"id": 367, "start": 3576.32, "end": 3580.32, "text": "wo man sich zum Beispiel angucken kann, wann der Brenner brennt in der Heizung,"}, {"id": 368, "start": 3580.32, "end": 3584.32, "text": "wie warm die Abgase von der Heizung sind, wie die Pumpe pumpt,"}, {"id": 369, "start": 3584.32, "end": 3589.32, "text": "welche Temperatur der Kessel hat, ob es einen Fehler gibt, was die Wassertemperatur sagt."}, {"id": 370, "start": 3589.32, "end": 3593.32, "text": "Ja, weiß ich, ob ich euch das schon mal gezeigt habe, ich glaube, das habe ich euch noch nie gezeigt."}, {"id": 371, "start": 3593.32, "end": 3596.32, "text": "Jetzt habt ihr es auch mal gesehen."}, {"id": 372, "start": 3596.32, "end": 3605.32, "text": "Und nein, es geht nicht mit jeder Heizung, weil ihr erstmal was braucht, was eure Heizung auslesen kann."}, {"id": 373, "start": 3605.32, "end": 3608.32, "text": "Was hältst du davon als Webcam?"}, {"id": 374, "start": 3608.32, "end": 3612.32, "text": "Wahrscheinlich nichts, weil die Blackmagic-Sachen halt übelst teuer sind, ne?"}, {"id": 375, "start": 3612.32, "end": 3623.32, "text": "Ja, genau, war klar, dass sowas kommt."}, {"id": 376, "start": 3623.32, "end": 3626.32, "text": "Was ist das eigentlich für Big Brain Musik gerade?"}, {"id": 377, "start": 3626.32, "end": 3631.32, "text": "Ach nee, das ist immer noch Mario Galaxy, ne?"}, {"id": 378, "start": 3631.32, "end": 3634.32, "text": "Ach, das ist Bowser, das ist das Bowser-Level."}, {"id": 379, "start": 3634.32, "end": 3640.32, "text": "Kannst du einen Lötkolben empfehlen? Ja, kann ich, aber der ist nicht für Weihnachtsgeschenke geeignet,"}, {"id": 380, "start": 3640.32, "end": 3642.32, "text": "weil der ist ein bisschen teuer."}, {"id": 381, "start": 3642.32, "end": 3648.32, "text": "Es sei denn, du hast zu viel Kohle, willst du dann was wirklich Gutes schenken?"}, {"id": 382, "start": 3648.32, "end": 3655.32, "text": "Dann kann ich das Ding empfehlen, das ist Massive Pock."}, {"id": 383, "start": 3655.32, "end": 3658.32, "text": "Das ist richtig gut, das Teil."}, {"id": 384, "start": 3658.32, "end": 3680.32, "text": "Aber ist vielleicht jetzt nicht so im Budget für Weihnachtsgeschenke."}, {"id": 385, "start": 3680.32, "end": 3682.32, "text": "Mit welcher App kann man das iPhone als Webcam benutzen?"}, {"id": 386, "start": 3682.32, "end": 3688.32, "text": "Gibt es ein paar?"}, {"id": 387, "start": 3688.32, "end": 3693.32, "text": "So, musst du mal rumgucken, so einfach mal nach iPhone App RTSP,"}, {"id": 388, "start": 3693.32, "end": 3696.32, "text": "wenn du es im OBS verwenden willst oder in irgendeinem Player."}, {"id": 389, "start": 3696.32, "end": 3699.32, "text": "Ansonsten, in Teams brauchst du das gar nicht,"}, {"id": 390, "start": 3699.32, "end": 3703.32, "text": "in Teams kannst du einfach in ein Meeting mit zwei Geräten joinen"}, {"id": 391, "start": 3703.32, "end": 3704.32, "text": "und dann brauchst du es nicht,"}, {"id": 392, "start": 3704.32, "end": 3715.32, "text": "dann stellst du das iPhone unten hin, joins in Teams Meeting und am Desktop mit dem Headset joins du ins Meeting."}, {"id": 393, "start": 3715.32, "end": 3719.32, "text": "Ok, so, kommen wir mal zurück."}, {"id": 394, "start": 3719.32, "end": 3724.32, "text": "Auch eine Sache, die mir sicherlich Bastlern gefällt ist,"}, {"id": 395, "start": 3724.32, "end": 3731.32, "text": "zumindest Bastlern, die ein bisschen, und gerade im Gaming Bereich ist RGB-Beleuchtung auch voll angesagt,"}, {"id": 396, "start": 3731.32, "end": 3739.32, "text": "als RGB-Klübieren, wobei es sind ja keine Klübieren, als RGB-LED-Lampen kann ich die Dinger hier empfehlen,"}, {"id": 397, "start": 3739.32, "end": 3744.32, "text": "allerdings vielleicht nicht unbedingt bei Amazon kaufen, die sind ein bisschen teuer."}, {"id": 398, "start": 3744.32, "end": 3748.32, "text": "Das ist die teuerste von denen, ich meine, 55 Euro für so eine Lampe ist schon ein bisschen übertrieben,"}, {"id": 399, "start": 3748.32, "end": 3750.32, "text": "aber die Dinger sind auch wirklich gut."}, {"id": 400, "start": 3750.32, "end": 3754.32, "text": "Du hast RGB-Beleuchtung, könnt ihr mal gucken, die gibt es noch für einen Zehner bestimmt billiger,"}, {"id": 401, "start": 3754.32, "end": 3760.32, "text": "irgendwo auch im Angebot, da habt ihr 1200 Lumen, also das ist relativ hell für so eine Lampe,"}, {"id": 402, "start": 3760.32, "end": 3764.32, "text": "also heller also die 0815 Lampe, die man an der Decke hat auf jeden Fall."}, {"id": 403, "start": 3764.32, "end": 3769.32, "text": "Ihr könnt sie übers WLAN verwenden, ihr könnt sie in die meisten Heimautomatisierungssysteme einbieten,"}, {"id": 404, "start": 3769.32, "end": 3773.32, "text": "wie gesagt RGB und Weiß drinne,"}, {"id": 405, "start": 3776.32, "end": 3781.32, "text": "und eignet sich halt dadurch ganz gut für Bastler, weil du es in die meisten Systeme einbinden kannst."}, {"id": 406, "start": 3781.32, "end": 3787.32, "text": "Und gerade wenn man Bastler und Gamer ist und vielleicht auch noch ein bisschen auf RGB steht,"}, {"id": 407, "start": 3787.32, "end": 3793.32, "text": "sei es jetzt mit RGB-Tastaturbeleuchtung, Grafikkarte, sonst was, ist es natürlich nochmal extra nice,"}, {"id": 408, "start": 3793.32, "end": 3797.32, "text": "wenn man dann passend dazu auch noch die RGB-Beleuchtung machen kann."}, {"id": 409, "start": 3797.32, "end": 3800.32, "text": "Und da kann ich die Dinger hier eigentlich empfehlen."}, {"id": 410, "start": 3800.32, "end": 3804.32, "text": "Es gibt noch die bisschen übertriebene Variante, es gibt noch die Plus-LED,"}, {"id": 411, "start": 3804.32, "end": 3812.32, "text": "die hat noch ein Infrarot dabei, falls man irgendwie eine Kamera hat mit Nachtsicht, aber haben die meisten Leute ja nicht."}, {"id": 412, "start": 3812.32, "end": 3819.32, "text": "Reldys kann ich dir nicht sagen, habe ich nicht, habe ich keinen von beiden."}, {"id": 413, "start": 3819.32, "end": 3824.32, "text": "Also was ist das für eine Question, zeige ich mal her."}, {"id": 414, "start": 3824.32, "end": 3832.32, "text": "Ist es theoretisch möglich, an seine normale Türstellung, an das Kabel vom Aufmachen der Haustür ein Arduino anzuschließen und damit..."}, {"id": 415, "start": 3832.32, "end": 3839.32, "text": "Das ist theoretisch möglich, kommt auf die Anlage an, kommt drauf an, welche Spannung da drauf ist."}, {"id": 416, "start": 3839.32, "end": 3844.32, "text": "Gehen tut das, ja bestimmt, kommt halt drauf an."}, {"id": 417, "start": 3844.32, "end": 3849.32, "text": "Meistens sind es 12 Volt bei diesem Türzeug."}, {"id": 418, "start": 3854.32, "end": 3858.32, "text": "Ja, du kannst bei Home Assistant direkt gucken."}, {"id": 419, "start": 3858.32, "end": 3869.32, "text": "Also die Frage ist, ob man irgendwie erkennt, welche Geräte gut mit der Heimautomatisierungsgeschichte zusammen funktionieren."}, {"id": 420, "start": 3869.32, "end": 3874.32, "text": "Also du kannst hier direkt bei Home Assistant gucken, was die Native unterstützen."}, {"id": 421, "start": 3874.32, "end": 3879.32, "text": "Und wenn das da drin ist, dann ist die Chance doch wirklich hoch, dass es funktioniert."}, {"id": 422, "start": 3879.32, "end": 3885.32, "text": "Wenn du irgendwelche Sachen über MQTT oder sonst wie verwendest, musst du gucken."}, {"id": 423, "start": 3885.32, "end": 3890.32, "text": "Und gerade beim Flashen von China-Geräten ist das immer so ein bisschen tagesabhängig."}, {"id": 424, "start": 3890.32, "end": 3894.32, "text": "Weil die machen manchmal aktuelle Firmwares drauf und dann geht es wieder nicht."}, {"id": 425, "start": 3894.32, "end": 3897.32, "text": "Und so, da muss man halt gerade gucken, was da angesagt ist."}, {"id": 426, "start": 3897.32, "end": 3901.32, "text": "Da kann man jetzt nichts pauschal empfehlen."}, {"id": 427, "start": 3901.32, "end": 3907.32, "text": "So, und für TASMOTA gibt es diese Liste."}, {"id": 428, "start": 3907.32, "end": 3911.32, "text": "TASMOTA ist Custom-Firmware für China-Geräte."}, {"id": 429, "start": 3911.32, "end": 3915.32, "text": "Da kannst du hier gucken, was da unterstützt wird."}, {"id": 430, "start": 3915.32, "end": 3919.32, "text": "Da stehen auch die meisten der Geräte drin, die wir hier schon mal im Stream drin hatten."}, {"id": 431, "start": 3919.32, "end": 3925.32, "text": "Zum Beispiel die berühmte Kogi-Gesteckdosenleiste ist da auch drin."}, {"id": 432, "start": 3925.32, "end": 3931.32, "text": "Mit den passenden Settings für TASMOTA."}, {"id": 433, "start": 3931.32, "end": 3935.32, "text": "Aber da würde ich auch von Absehen sowas zu Weihnachten verschenken,"}, {"id": 434, "start": 3935.32, "end": 3938.32, "text": "weil man eben nicht weiß, ob es sich aktuell noch flashen lässt."}, {"id": 435, "start": 3938.32, "end": 3942.32, "text": "Und ich will keine China-Clouds-Sachen verschenken oder empfehlen."}, {"id": 436, "start": 3957.32, "end": 3962.32, "text": "Es gibt, das ist, da baitet Elgato ein bisschen."}, {"id": 437, "start": 3962.32, "end": 3966.32, "text": "Es gibt mittlerweile auch eine App von Elgato, wenn sich Epoch kennt,"}, {"id": 438, "start": 3966.32, "end": 3970.32, "text": "das ist G-Bait, Elgato hat das Ding nur gekauft."}, {"id": 439, "start": 3970.32, "end": 3972.32, "text": "Was meint ihr, warum das Ding Epoch-Cam heißt?"}, {"id": 440, "start": 3972.32, "end": 3974.32, "text": "Das ist überhaupt kein Elgato-like Name."}, {"id": 441, "start": 3974.32, "end": 3977.32, "text": "Und ich habe das auch schon mal vor einer Weile ausprobiert."}, {"id": 442, "start": 3977.32, "end": 3980.32, "text": "Die App, als sie noch nicht Elgato war."}, {"id": 443, "start": 3980.32, "end": 3984.32, "text": "Und ich glaube, die wird auch noch immer unter anderem Label irgendwo vertrieben."}, {"id": 444, "start": 3984.32, "end": 3987.32, "text": "Oder vielleicht sind das alte Versionen oder sonst was."}, {"id": 445, "start": 3987.32, "end": 3990.32, "text": "Also das ist keine wirkliche, die haben die nur dazu gekauft."}, {"id": 446, "start": 3990.32, "end": 3991.32, "text": "Die gibt es schon eine Weile."}, {"id": 447, "start": 3991.32, "end": 3996.32, "text": "Und es scheint auch ganz okay zu funktionieren."}, {"id": 448, "start": 3999.32, "end": 4002.32, "text": "Was mir daran halt nicht gefallen hat, ist, warum ich sie nicht verwendet habe,"}, {"id": 449, "start": 4002.32, "end": 4006.32, "text": "ist, weil du entweder USB an den Computer anschließen musst"}, {"id": 450, "start": 4006.32, "end": 4009.32, "text": "oder irgendwelche Custom-Triber installieren musst auf deinem Rechner,"}, {"id": 451, "start": 4009.32, "end": 4011.32, "text": "dass du das ansprechen kannst."}, {"id": 452, "start": 4011.32, "end": 4014.32, "text": "Du kannst es aber auch dann über NDI, glaube ich, in OBS machen."}, {"id": 453, "start": 4014.32, "end": 4017.32, "text": "Aber ich wollte einfach eine App haben,"}, {"id": 454, "start": 4017.32, "end": 4021.32, "text": "die ganz normal meine iPhone-Kamera als RTSP bereitstellt."}, {"id": 455, "start": 4021.32, "end": 4024.32, "text": "Verstehe ich gar nicht, warum es da nicht mehr gibt."}, {"id": 456, "start": 4025.32, "end": 4027.32, "text": "Senderweise Amnesia."}, {"id": 457, "start": 4029.32, "end": 4030.32, "text": "Keine Ahnung."}, {"id": 458, "start": 4030.32, "end": 4031.32, "text": "Ist das das Neue?"}, {"id": 459, "start": 4031.32, "end": 4034.32, "text": "Ist das das, was vor irgendwie einem Monat rausgekommen ist?"}, {"id": 460, "start": 4034.32, "end": 4038.32, "text": "Ich habe noch nicht mal das erste Amnesia gespielt."}, {"id": 461, "start": 4042.32, "end": 4044.32, "text": "So, also machen wir mal weiter."}, {"id": 462, "start": 4044.32, "end": 4046.32, "text": "Wie gesagt, NFC-Tags habe ich."}, {"id": 463, "start": 4046.32, "end": 4049.32, "text": "LED-Lampen haben wir uns auch schon angeguckt."}, {"id": 464, "start": 4053.32, "end": 4057.32, "text": "Ja, eine Sache, die ich auch persönlich ganz furchtbar praktisch finde,"}, {"id": 465, "start": 4057.32, "end": 4059.32, "text": "muss ich noch mal kurz gucken."}, {"id": 466, "start": 4059.32, "end": 4062.32, "text": "Ich habe mir irgendwo den Namen kopiert, dass ich es wiederfinde."}, {"id": 467, "start": 4068.32, "end": 4070.32, "text": "Diese Dinger hier. Moment."}, {"id": 468, "start": 4073.32, "end": 4074.32, "text": "Die da."}, {"id": 469, "start": 4074.32, "end": 4076.32, "text": "Und was davon?"}, {"id": 470, "start": 4076.32, "end": 4079.32, "text": "Ist poggers praktisch, der Kram."}, {"id": 471, "start": 4079.32, "end": 4087.32, "text": "Das ist auf der einen Seite Klebeband und auf der anderen Seite ein Reißverschluss."}, {"id": 472, "start": 4097.32, "end": 4099.32, "text": "Nee, Matt wie sagt mir nichts."}, {"id": 473, "start": 4099.32, "end": 4103.32, "text": "Das ist wirklich enorm praktisch und da freut sich garantiert auch jeder"}, {"id": 474, "start": 4103.32, "end": 4105.32, "text": "Bastler drüber."}, {"id": 475, "start": 4105.32, "end": 4108.32, "text": "Ich habe da schon so viele Sachen dran gepappt irgendwo."}, {"id": 476, "start": 4108.32, "end": 4114.32, "text": "Ich habe beispielsweise zwei Schränke für Werkzeuge im Flur stehen und die Sachen,"}, {"id": 477, "start": 4114.32, "end": 4117.32, "text": "die ein bisschen größer sind in eigenen Boxen habe ich jetzt so gemacht."}, {"id": 478, "start": 4117.32, "end": 4119.32, "text": "Der eine Schrank ist ein bisschen kleiner als der andere."}, {"id": 479, "start": 4119.32, "end": 4123.32, "text": "Da habe ich hier an die Seite beispielsweise für die Box für den Dremel habe ich hier"}, {"id": 480, "start": 4123.32, "end": 4124.32, "text": "so zwei Dinger dran gemacht."}, {"id": 481, "start": 4124.32, "end": 4128.32, "text": "Einen an die Box, also zwei an die Box, zwei an den Schrank."}, {"id": 482, "start": 4128.32, "end": 4130.32, "text": "Und jetzt kann ich das Ding quasi hochkant an den Schrank pappen."}, {"id": 483, "start": 4130.32, "end": 4132.32, "text": "Steht natürlich unten immer noch auf."}, {"id": 484, "start": 4132.32, "end": 4135.32, "text": "Steht hochkant, nimmt kaum Platz weg und ist relativ fest und kann man einfach wieder"}, {"id": 485, "start": 4135.32, "end": 4136.32, "text": "abmachen."}, {"id": 486, "start": 4136.32, "end": 4141.32, "text": "Die Dinger sind enorm praktisch und da freut sich garantiert jeder Bastler drüber."}, {"id": 487, "start": 4149.32, "end": 4151.32, "text": "Wie in jedem Haus hat eine Pflicht."}, {"id": 488, "start": 4156.32, "end": 4159.32, "text": "What the fuck, es gibt auf Amazon so viel Crap."}, {"id": 489, "start": 4159.32, "end": 4164.32, "text": "Ja, also das ist wirklich nice."}, {"id": 490, "start": 4164.32, "end": 4168.32, "text": "Gibt es in unterschiedlichster Ausführung, gibt es auch noch ein bisschen länger."}, {"id": 491, "start": 4168.32, "end": 4170.32, "text": "Gibt es auch als Band zum Rollen."}, {"id": 492, "start": 4170.32, "end": 4172.32, "text": "Ich habe davon, ich habe da einen ganzen Sack voll."}, {"id": 493, "start": 4172.32, "end": 4174.32, "text": "Ich habe mir mal irgendwie so ein paar Packs davon gekauft."}, {"id": 494, "start": 4174.32, "end": 4178.32, "text": "Ich glaube diese standartmäßig irgendwie 20 oder so bei, ne 10 Stück sind dabei."}, {"id": 495, "start": 4178.32, "end": 4180.32, "text": "Ich habe mir mal irgendwie ein paar Packs gekauft."}, {"id": 496, "start": 4180.32, "end": 4184.32, "text": "Ich habe jetzt wirklich so einen ganzen kleinen Sack voll mit diesen Dingern und ich brauche"}, {"id": 497, "start": 4184.32, "end": 4188.32, "text": "immer mal wieder welche und wenn man sie braucht und man hat sie griffbereit, freut"}, {"id": 498, "start": 4188.32, "end": 4190.32, "text": "man sich, ist super und kostet nicht viel."}, {"id": 499, "start": 4190.32, "end": 4194.32, "text": "Ganz ehrlich, 588, ihr könnt gucken, es gibt es bestimmt noch ein bisschen billiger."}, {"id": 500, "start": 4196.32, "end": 4199.32, "text": "Ist ein super Geschenk und geht auch nicht so großartig ins Geld, freut man sich drüber"}, {"id": 501, "start": 4199.32, "end": 4201.32, "text": "und kann man immer gut gebrauchen."}, {"id": 502, "start": 4205.32, "end": 4206.32, "text": "So, next."}, {"id": 503, "start": 4207.32, "end": 4208.32, "text": "Oh, ist die Musik vorbei."}, {"id": 504, "start": 4211.32, "end": 4213.32, "text": "Nein, war wieder von vorne."}, {"id": 505, "start": 4215.32, "end": 4216.32, "text": "Die sind wirklich praktisch."}, {"id": 506, "start": 4216.32, "end": 4223.32, "text": "Da gibt es so die üblichen Sachen, die man auch immer empfehlen kann für Technikleute."}, {"id": 507, "start": 4223.32, "end": 4225.32, "text": "Da will ich jetzt aber nichts spezielles zeigen."}, {"id": 508, "start": 4225.32, "end": 4227.32, "text": "Klar, es gibt noch zig USB Adapter."}, {"id": 509, "start": 4227.32, "end": 4234.32, "text": "Es gibt beispielsweise USB Adapter, die auf Mini-USB, auf USB-C und auf Lightning gehen."}, {"id": 510, "start": 4234.32, "end": 4236.32, "text": "Sowas ist auch ganz nützlich."}, {"id": 511, "start": 4241.32, "end": 4243.32, "text": "Die quasi 3 in 1 sind."}, {"id": 512, "start": 4243.32, "end": 4245.32, "text": "Sowas ist ganz nützlich."}, {"id": 513, "start": 4245.32, "end": 4247.32, "text": "Dann gibt es auch diese Sachen mit Magnet vorne."}, {"id": 514, "start": 4247.32, "end": 4251.32, "text": "Da habe ich auch eine für mein Tablet zum Aufladen, aber ganz ehrlich, ich fand die"}, {"id": 515, "start": 4251.32, "end": 4255.32, "text": "am Anfang richtig cool, weil du konntest halt den Auflader drin lassen und musstest den"}, {"id": 516, "start": 4255.32, "end": 4260.32, "text": "Auflader nie anstöpseln, sondern konntest einfach das ranklippen ans Tablet."}, {"id": 517, "start": 4260.32, "end": 4266.32, "text": "Aber mittlerweile stört es mich, weil man nichts anderes mehr in den Auflader reinbekommt."}, {"id": 518, "start": 4268.32, "end": 4271.32, "text": "Also ihr seht ja, was ein bescheuertes Bild, Alter."}, {"id": 519, "start": 4271.32, "end": 4273.32, "text": "Also da sind magnetische Kabel."}, {"id": 520, "start": 4273.32, "end": 4278.32, "text": "Du lässt dieses Teil immer im Gerät stecken und dann kannst du magnetisch hier die Sachen"}, {"id": 521, "start": 4278.32, "end": 4279.32, "text": "dran machen."}, {"id": 522, "start": 4279.32, "end": 4282.32, "text": "Fand ich immer ursprünglich sehr nice."}, {"id": 523, "start": 4282.32, "end": 4287.32, "text": "Mittlerweile stört es mich, weil du hast halt permanent..."}, {"id": 524, "start": 4290.32, "end": 4292.32, "text": "Achso, ich benutze das eh nur zum Aufladen."}, {"id": 525, "start": 4293.32, "end": 4298.32, "text": "Du hast halt permanent dieses Teil hier im Tablet oder im Smartphone stecken und du kannst"}, {"id": 526, "start": 4298.32, "end": 4302.32, "text": "dann nicht, wenn du mal am Rechner bist oder auf der Arbeit bist oder woanders bist, mal"}, {"id": 527, "start": 4302.32, "end": 4305.32, "text": "schnell ein anderes Kabel dran machen und musst immer das hier rauspulen und gucken,"}, {"id": 528, "start": 4305.32, "end": 4306.32, "text": "dass du es nicht verlierst."}, {"id": 529, "start": 4306.32, "end": 4309.32, "text": "Ist nicht so geil, wie ich es ursprünglich fand."}, {"id": 530, "start": 4309.32, "end": 4313.32, "text": "So, aber was tatsächlich immer praktisch ist, sind solche Dinger hier."}, {"id": 531, "start": 4315.32, "end": 4319.32, "text": "Also USB auf Mikro-USB, USB-C und Lightning."}, {"id": 532, "start": 4319.32, "end": 4321.32, "text": "Sowas kann man immer gebrauchen."}, {"id": 533, "start": 4321.32, "end": 4328.32, "text": "Kostet auch nicht viel und man freut sich garantiert drüber, wenn man es braucht."}, {"id": 534, "start": 4328.32, "end": 4333.32, "text": "So, da gibt es natürlich noch so Sachen wie Noise-Canceling-Kopfhörer, wo man sich gerade"}, {"id": 535, "start": 4333.32, "end": 4337.32, "text": "aktuell drüber freut, aber das ist ein bisschen teurer, das würde ich auch nicht empfehlen."}, {"id": 536, "start": 4339.32, "end": 4342.32, "text": "Alsein, man hat viel Kohle und will einem irgendwas für 200 Euro schenken."}, {"id": 537, "start": 4344.32, "end": 4347.32, "text": "So, dann noch eine Sache zu Werkzeuge."}, {"id": 538, "start": 4347.32, "end": 4354.32, "text": "Ähm, das Ding ist immer mal wieder im Angebot bei Amazon, bestimmt auch zu Weihnachten irgendwann"}, {"id": 539, "start": 4354.32, "end": 4363.32, "text": "mal, dass der kleine Bosch Akkuschraube mit Zubehör, du kriegst quasi die üblichen,"}, {"id": 540, "start": 4363.32, "end": 4368.32, "text": "kriegst ein Bitset dabei, Holz- und Metallbohrer, Holz- und Steinbohrer sind es glaube ich,"}, {"id": 541, "start": 4368.32, "end": 4371.32, "text": "sonst war es nicht."}, {"id": 542, "start": 4371.32, "end": 4375.32, "text": "Zwei Akkus, auch wenn man hier nur ein Akku sieht, normalerweise sind es zwei Akkus."}, {"id": 543, "start": 4375.32, "end": 4378.32, "text": "Ladegerät und das Ding ist wirklich nice."}, {"id": 544, "start": 4379.32, "end": 4384.32, "text": "Also, das habe ich auch jetzt schon über ein Jahr und ich habe damit schon Löcher in"}, {"id": 545, "start": 4384.32, "end": 4389.32, "text": "die Wand gebohrt, Löcher in Holz gebohrt, sogar mal Löcher in ein Loch in einen Baum"}, {"id": 546, "start": 4389.32, "end": 4392.32, "text": "gebohrt, frag mich nicht warum, aber ich habe ein Loch in einen Baum gebohrt."}, {"id": 547, "start": 4397.32, "end": 4399.32, "text": "Hat keinen tieferen Sinn gehabt."}, {"id": 548, "start": 4399.32, "end": 4404.32, "text": "Ähm, zig Dinger geschraubt, gemacht, also der ist wirklich gut."}, {"id": 549, "start": 4406.32, "end": 4411.32, "text": "Und man sollte sich davon den 12 Volt gar nicht so abschrecken lassen, wer denkt, dass"}, {"id": 550, "start": 4411.32, "end": 4419.32, "text": "man damit nicht viel machen kann, soll sich mal auf YouTube so ein paar Tests davon angucken,"}, {"id": 551, "start": 4419.32, "end": 4425.32, "text": "da hat man wirklich ordentlich Wumms dahinter, auch wenn da nur 12 Volt drauf steht."}, {"id": 552, "start": 4425.32, "end": 4434.32, "text": "Und der Vorteil ist, diese 12 Volt Akkus kann man auch für viele andere Sachen von Bosch"}, {"id": 553, "start": 4434.32, "end": 4440.32, "text": "verwenden, wenn man dann eben Bosch mag, also sprich, wenn jetzt jemand einer schon,"}, {"id": 554, "start": 4440.32, "end": 4445.32, "text": "was weiß ich, das ganze Makita Akkuset hat oder Milwaukee oder sonst was, dann lohnt"}, {"id": 555, "start": 4445.32, "end": 4450.32, "text": "sich jetzt natürlich nicht, dem dann einen Bosch 12 Volt Akkuschrauber zu schenken, weil"}, {"id": 556, "start": 4450.32, "end": 4455.32, "text": "wahrscheinlich hat er das auch schon."}, {"id": 557, "start": 4458.32, "end": 4467.32, "text": "So, ähm, was auch ganz nützlich ist, wenn man das hat, die haben auch so einen 12 Volt"}, {"id": 558, "start": 4467.32, "end": 4477.32, "text": "Licht, finde ich auch sehr praktisch, das Ding hier glaube ich, also wenn ihr jemand"}, {"id": 559, "start": 4477.32, "end": 4484.32, "text": "habt, der schon 12 Volt Akkus von Bosch hat, finde ich das hier auch echt nützlich, das"}, {"id": 560, "start": 4484.32, "end": 4490.32, "text": "macht saumäßig hell, funktioniert mit dem gleichen Akku wie der 12 Volt Akkuschrauber,"}, {"id": 561, "start": 4490.32, "end": 4498.32, "text": "also mit den ganz normalen Bosch Akkuschrauber Akkus und ist praktisch, also man kann das"}, {"id": 562, "start": 4498.32, "end": 4501.32, "text": "entweder auf die Seite legen, man kann es hinstellen auf dem Akku, man kann es auf die"}, {"id": 563, "start": 4501.32, "end": 4506.32, "text": "Seite legen in zwei verschiedene Kippstufen und hier oben hat man noch einen Haken dran,"}, {"id": 564, "start": 4506.32, "end": 4511.32, "text": "wenn man es mag, ja, ähm, manch einer wird sagen, kostet mehr zu viel für eine Licht."}, {"id": 565, "start": 4522.32, "end": 4528.32, "text": "Kann ich den Akku für meine USB, nein, das kannst du nicht machen, oder hast du eine"}, {"id": 566, "start": 4528.32, "end": 4536.32, "text": "12 Volt USB, dann kannst du viel Adapter bauen."}, {"id": 567, "start": 4540.32, "end": 4544.32, "text": "Das Problem immer beim Akkuschrauber, wenn wir ihn brauchen, ist er leer, ja, das Gute"}, {"id": 568, "start": 4544.32, "end": 4551.32, "text": "ist daran, diese Akkus halten ziemlich lang, weiß ich, was die für eine Entladung haben,"}, {"id": 569, "start": 4551.32, "end": 4555.32, "text": "aber die halten wirklich ordentlich, ich hab den jetzt teilweise mal ein halbes Jahr rumliegen"}, {"id": 570, "start": 4555.32, "end": 4560.32, "text": "gehabt, nicht verwendet und dann war der Akku immer noch okay und du hast bei diesem Standard"}, {"id": 571, "start": 4560.32, "end": 4567.32, "text": "Set hast du zwei Akkus dabei, weiß nicht, ob das beim Amazon Set dabei ist, bei dem"}, {"id": 572, "start": 4567.32, "end": 4572.32, "text": "Set, was ich mir gekauft habe, auf jeden Fall zwei Akkus dabei und ich würde das auch"}, {"id": 573, "start": 4572.32, "end": 4575.32, "text": "nur kaufen mit zwei Akkus, sonst sackts."}, {"id": 574, "start": 4578.32, "end": 4579.32, "text": "Das ist nice."}, {"id": 575, "start": 4579.32, "end": 4585.32, "text": "Marc LDM, acht Monate, Dankeschön für den Sub."}, {"id": 576, "start": 4588.32, "end": 4591.32, "text": "Massive Subcription hier."}, {"id": 577, "start": 4592.32, "end": 4603.32, "text": "Ich hoffe, ich hab nicht so viele Subs übersehen, weil ich war gerade ziemlich vertieft in Amazon."}, {"id": 578, "start": 4603.32, "end": 4608.32, "text": "Cool, wir sprechen Amazon, Amazon aus und wir sprechen auch Ubuntu, nicht Ubuntu aus,"}, {"id": 579, "start": 4608.32, "end": 4616.32, "text": "sondern Jubantu und Jira nicht Jira, sondern Jira und Git-Jit und ja, wir sind ja auch"}, {"id": 580, "start": 4616.32, "end": 4618.32, "text": "nicht agil, sondern agile."}, {"id": 581, "start": 4619.32, "end": 4621.32, "text": "Okay, ich hab nix übersehen."}, {"id": 582, "start": 4622.32, "end": 4626.32, "text": "Jetzt erst mal zwei Minuten dummes Zeug gelabert, okay, wo können wir weitermachen?"}, {"id": 583, "start": 4626.32, "end": 4631.32, "text": "Also das finde ich ist auch eine ganz gute Kombination, der, und Router natürlich, nicht"}, {"id": 584, "start": 4631.32, "end": 4637.32, "text": "Router, Router, Router, der Akkuschrauber ist natürlich ein bisschen teuer, aber wie gesagt,"}, {"id": 585, "start": 4637.32, "end": 4642.32, "text": "so eine Lampe zum Beispiel, wenn man jemanden kennt, der schon die Bosch 12V Akkus hat,"}, {"id": 586, "start": 4642.32, "end": 4644.32, "text": "ist das mit der Lampe ganz nice."}, {"id": 587, "start": 4645.32, "end": 4650.32, "text": "UniFi Access Points sind an sich ein super Geschenk, aber eigentlich viel zu teuer."}, {"id": 588, "start": 4654.32, "end": 4658.32, "text": "Das sind zwar mit die besten für den Heimbereich, so mit die besten Access Points, aber mal"}, {"id": 589, "start": 4658.32, "end": 4664.32, "text": "ganz im Ernst, 146 Euro für Weihnachtsgeschenk ist schon eine Hausnummer, da muss man jemand"}, {"id": 590, "start": 4664.32, "end": 4667.32, "text": "schon ganz besonders mögen oder zu viel Geld haben."}, {"id": 591, "start": 4669.32, "end": 4670.32, "text": "Aber die Dinger sind immer Pock."}, {"id": 592, "start": 4671.32, "end": 4677.32, "text": "Gerade, gerade, ähm, neues UniFi Update ist unschrecklich, ich hab schon ein halbes Jahr"}, {"id": 593, "start": 4677.32, "end": 4679.32, "text": "nicht mehr geupdatet, funktioniert alles wunderbar."}, {"id": 594, "start": 4680.32, "end": 4686.32, "text": "Holt euch die APAC, was für ein Ding, klingt eher nach MikroTik vom Namen her."}, {"id": 595, "start": 4686.32, "end": 4694.32, "text": "Ah, das sind die Alten, ja das sind die Alten, genau, da hab ich einen von, ich hab einen"}, {"id": 596, "start": 4694.32, "end": 4699.32, "text": "davon und einen Nano, der Unterschied war glaube ich, dass der Nano mehr 5GHz Antennen hat"}, {"id": 597, "start": 4699.32, "end": 4704.32, "text": "oder irgendwas in der Richtung, ich krieg's nicht mehr zusammen aus dem Kopf."}, {"id": 598, "start": 4704.32, "end": 4719.32, "text": "Was die sind im Angebot? Aber die Dinger sind wirklich nett, gerade vielleicht wenn man"}, {"id": 599, "start": 4719.32, "end": 4725.32, "text": "sogar jemand hat, der schon eins, zwei davon hat und irgendwie noch sagt, ich werd ja so"}, {"id": 600, "start": 4725.32, "end": 4731.32, "text": "gerne auch auf der Terrasse WLAN und wenn man den dann sehr mag, kann man ihn vielleicht"}, {"id": 601, "start": 4731.32, "end": 4734.32, "text": "einschenken, die Dinger sind auf jeden Fall gut."}, {"id": 602, "start": 4743.32, "end": 4747.32, "text": "UniFi Lite, oh guck mal, die kenn ich noch gar nicht, zeig mal her."}, {"id": 603, "start": 4752.32, "end": 4753.32, "text": "Ach ja."}, {"id": 604, "start": 4753.32, "end": 4755.32, "text": "Da ist ein PoE Adapter dabei."}, {"id": 605, "start": 4765.32, "end": 4771.32, "text": "Dann ist es tatsächlich ganz nett, ich hab da halt keine Erfahrungswerte drinne, kann"}, {"id": 606, "start": 4771.32, "end": 4778.32, "text": "ich nicht sagen, aber wie gesagt, ich hab einen, ich hab einen, ich hab einen, ich hab"}, {"id": 607, "start": 4778.32, "end": 4786.32, "text": "einen, kann ich nicht sagen, aber wie gesagt, ich hab einen AC Pro und einen Nano HD und"}, {"id": 608, "start": 4786.32, "end": 4794.32, "text": "sind beide super. Was ich ja persönlich am AC Pro ziemlich gut fand, ist, dass der einen"}, {"id": 609, "start": 4794.32, "end": 4805.32, "text": "zweiten Netzwerkanschluss hat zum Durchreichen. Ja, also, gucken wir mal ob es davon ein Bild"}, {"id": 610, "start": 4805.32, "end": 4809.32, "text": "gibt, sieht aus wie ein Feuermelder. Ja, dementsprechend, man sollte die auch an der Decke installieren."}, {"id": 611, "start": 4809.32, "end": 4816.32, "text": "Ja, guck mal. Der AC Pro, der hat zwei Netzwerkanschluss unten. Der Nano HD hat das auch nicht."}, {"id": 612, "start": 4816.32, "end": 4822.32, "text": "Das fand ich ehrlich gesagt ganz nützlich, weil du kannst dann hier beispielsweise machst"}, {"id": 613, "start": 4822.32, "end": 4829.32, "text": "du dann dein, nennst du mal, Uplink rein, auch mit PoE und allem und hier kannst du"}, {"id": 614, "start": 4829.32, "end": 4833.32, "text": "noch beispielsweise Raspberry Pi oder so anschließen. So hab ich das unten bei mir im"}, {"id": 615, "start": 4833.32, "end": 4837.32, "text": "Zimmer liegen. Da liegt der Access Point und daneben ein Raspberry Pi, der sogar noch über"}, {"id": 616, "start": 4837.32, "end": 4841.32, "text": "das USB versorgt wird. Allerdings, das würde ich nicht machen, weil der USB Port dafür"}, {"id": 617, "start": 4841.32, "end": 4844.32, "text": "überhaupt nicht gedacht ist. Der liefert auch ein bisschen zu wenig Strom, der Raspberry"}, {"id": 618, "start": 4844.32, "end": 4849.32, "text": "Pi ist schon die ganze Zeit am schreien und den sollte ich mal woanders reinstabseln."}, {"id": 619, "start": 4849.32, "end": 4857.32, "text": "Ja, und ich hab gesagt, wie gesagt, das liegt bei mir rum. Ihr solltet die auch nicht auf"}, {"id": 620, "start": 4857.32, "end": 4861.32, "text": "den Boden legen oder auf den Tisch legen oder so. Die werden nicht umsonst immer an der"}, {"id": 621, "start": 4861.32, "end": 4866.32, "text": "Decke gezeigt. Die Dinger sind auch von der, wie das abstrahlt von der Charakteristik,"}, {"id": 622, "start": 4866.32, "end": 4871.32, "text": "die sind eigentlich dafür gedacht, dass man sie an die Decke macht. Es funktioniert aber,"}, {"id": 623, "start": 4871.32, "end": 4876.32, "text": "wenn man sie hinstellt auch, aber besser funktionieren sie, wenn sie an der Decke sind."}, {"id": 624, "start": 4876.32, "end": 4881.32, "text": "Und das Kabel hängt dann von der Decke her, da kannst du dir ja mal überlegen, was du"}, {"id": 625, "start": 4881.32, "end": 4887.32, "text": "machst dagegen. Ich mein, ein bisschen gewisse, gewisse Kreativität, wenn man sich so was"}, {"id": 626, "start": 4887.32, "end": 4892.32, "text": "hinbaut, den besten Ort zu finden, sollte man schon haben, bevor man sich sowas kauft."}, {"id": 627, "start": 4892.32, "end": 4897.32, "text": "Ich meine, entweder hast du schon was durch die Decke laufen, wo du das von abmachen kannst,"}, {"id": 628, "start": 4897.32, "end": 4902.32, "text": "oder machst dich an die Decke, stellst dich irgendwo hin, hast vielleicht irgendwo einen"}, {"id": 629, "start": 4902.32, "end": 4909.32, "text": "Kabelkanal, gibt es ja verschiedenste Möglichkeiten. Aber wie gesagt, die sagen selbst, die sind"}, {"id": 630, "start": 4909.32, "end": 4913.32, "text": "für die Installation an der Decke gemacht. Ich hab sie aus dem Grund auch nicht bei mir"}, {"id": 631, "start": 4913.32, "end": 4918.32, "text": "an der Decke, weil ich keinen Bock hab, durch die Zwischendecke ein Kabel zu legen."}, {"id": 632, "start": 4921.32, "end": 4923.32, "text": "Bin ich zu faul für."}, {"id": 633, "start": 4929.32, "end": 4933.32, "text": "Aber wie gesagt, ein bisschen Kreativität braucht man da schon, wie man das am besten"}, {"id": 634, "start": 4933.32, "end": 4939.32, "text": "anbringt und wo man gerade dabei ist. Dann freut man sich, wenn man sich den Bosch 12V"}, {"id": 635, "start": 4939.32, "end": 4943.32, "text": "Akkuschrauber gekauft hat, bei Amazon, den ich vorher gezeigt hab, dann kann man das"}, {"id": 636, "start": 4943.32, "end": 4947.32, "text": "nämlich auch wunderbar installieren. Oder jedem x-beliebigen anderen Akkuschrauber geht"}, {"id": 637, "start": 4947.32, "end": 4948.32, "text": "natürlich auch."}, {"id": 638, "start": 4958.32, "end": 4962.32, "text": "Chaotix, Twitch Prime, Dankeschön, Massive Subscriptions hier heute."}, {"id": 639, "start": 4962.32, "end": 4967.32, "text": "Ich bin ja schon gesponsert bei allem, wenn man das so will. Von Vera, von Bosch und sonst"}, {"id": 640, "start": 4967.32, "end": 4971.32, "text": "wie. Nee, ich verdiene nichts davon. Es wird doch mal Zeit, dass ich gesponsert werde."}, {"id": 641, "start": 4971.32, "end": 4977.32, "text": "Ich sollte dafür eigentlich was verdienen. So, und jetzt nächste Sache ist, ich hab schon"}, {"id": 642, "start": 4977.32, "end": 4983.32, "text": "ganz oft gesagt, aber das könnt ihr wirklich machen für jemand, der kein Tablet hat, vielleicht"}, {"id": 643, "start": 4983.32, "end": 4988.32, "text": "auch für jemand, der keine Tablet hat, vielleicht auch für jemand, der keine Tablet hat, vielleicht"}, {"id": 644, "start": 4988.32, "end": 4992.32, "text": "auch für jemand, der schon ein bisschen älter ist und das nicht so den Bezug zu hat, aber"}, {"id": 645, "start": 4992.32, "end": 4996.32, "text": "wo ihr denkt, ey, meine Oma sollte sich unbedingt mal mit einem Tablet ein bisschen rumspielen"}, {"id": 646, "start": 4996.32, "end": 5005.32, "text": "oder so, dann kauft ihr einen Fire HD 8, wenn es billig sein soll, und entamazonifiziert"}, {"id": 647, "start": 5005.32, "end": 5009.32, "text": "das. Ihr müsst abwarten, bis es billiger ist. Es ist gerade zu teuer. Ihr müsst auf die"}, {"id": 648, "start": 5009.32, "end": 5014.32, "text": "Angebote an Weihnachten warten. Da kostet es nämlich nur 50 Euro. Ihr wartet, bis das"}, {"id": 649, "start": 5014.32, "end": 5024.32, "text": "Fire HD 8 50 Euro kostet. Dann kauft ihr das eurer Oma und löscht alles von Amazon mit"}, {"id": 650, "start": 5024.32, "end": 5036.32, "text": "der passenden Software dazu. Und dann hat die Oma preisleistungsmäßig das beste Android"}, {"id": 651, "start": 5036.32, "end": 5045.32, "text": "Tablet, was es gibt. Ich meine, für 50 Euro, das Fire HD 8 ist mit Sicherheit nicht schnell"}, {"id": 652, "start": 5045.32, "end": 5052.32, "text": "im Vergleich zu anderen Tablets. Das scheißt gegen jedes iPad selbstverständlich ab. Aber"}, {"id": 653, "start": 5052.32, "end": 5058.32, "text": "für 50 Euro im Angebot, muss man sich mal überlegen, kriegt ihr einen Tablet, was man"}, {"id": 654, "start": 5058.32, "end": 5063.32, "text": "benutzen kann. Mehr kann man ja für 50 Euro auch echt nicht erwarten. Und dann kauft"}, {"id": 655, "start": 5063.32, "end": 5072.32, "text": "ihr das. Und ihr müsst auf jeden Fall warten, bis das im Angebot ist, dass es wieder 50"}, {"id": 656, "start": 5072.32, "end": 5085.32, "text": "Euro kostet. Ansonsten lohnt sich das nicht. Ja, mal abwarten, mal abwarten, was da noch"}, {"id": 657, "start": 5085.32, "end": 5100.32, "text": "kommt. Mit Amazon Smart Plug. Was denn? Warum? Iiiih, es wird ja immer schlimmer. Also für"}, {"id": 658, "start": 5100.32, "end": 5105.32, "text": "den Preis lohnt es sich halt gar nicht. Aber es kostet halt manchmal nur 50 Euro, wenn"}, {"id": 659, "start": 5105.32, "end": 5111.32, "text": "Amazon wieder ihr Zeug verkauft. Und dafür lohnt es sich richtig. Beste. Also preisleistungsmäßig"}, {"id": 660, "start": 5111.32, "end": 5119.32, "text": "ist das Fire HD 8, wenn es im Angebot ist, das beste Tablet, was ihr kaufen könnt. Und"}, {"id": 661, "start": 5119.32, "end": 5125.32, "text": "ihr müsst halt da vorher ein bisschen Amazon Zeug von drunter machen. Sonst funktioniert"}, {"id": 662, "start": 5125.32, "end": 5131.32, "text": "es nicht. Hast du eine Empfehlung für ein günstiges Nas oder würdest du dafür eher"}, {"id": 663, "start": 5131.32, "end": 5136.32, "text": "einen Raspberry Pi? Nein, auf gar keinen Fall. Gar kein Fall. Raspberry Pi sackt. Besser"}, {"id": 664, "start": 5136.32, "end": 5142.32, "text": "als das HD 10 preisleistungsmäßig auf jeden Fall. Und für die Oma auch ein bisschen handlicher."}, {"id": 665, "start": 5142.32, "end": 5147.32, "text": "Allerdings mag die Oma vielleicht auch große Schrift. Und wenn ihr zu Weihnachten ein Angebot"}, {"id": 666, "start": 5147.32, "end": 5155.32, "text": "für, wenn ihr den Fire HD 10 bekommt für 85 Euro, ist das auch super. So, gerade zum"}, {"id": 667, "start": 5155.32, "end": 5160.32, "text": "Einstieg ist es halt die Sache, wenn man nicht so genau weiß, möchte man jetzt viel Geld"}, {"id": 668, "start": 5160.32, "end": 5170.32, "text": "geben oder nicht. Ist es mal nicht verkehrt. Empfehlung für Nass habe ich nicht. Kein Nass,"}, {"id": 669, "start": 5170.32, "end": 5175.32, "text": "kein Fertig Nass bei mir, weiß, kann ich nichts zu sagen. Aber wahrscheinlich kannst du jedes"}, {"id": 670, "start": 5175.32, "end": 5180.32, "text": "sein Knowledge, die Dinge kaufen. Die Dinge funktionieren wohl ganz gut. Aber einen Raspberry"}, {"id": 671, "start": 5180.32, "end": 5183.32, "text": "Pi würde ich auf keinen Fall empfehlen. Der Raspberry Pi ist einfach nicht gemacht für"}, {"id": 672, "start": 5183.32, "end": 5192.32, "text": "Nass. Die haben leider an der Krypto-Extension für die CPU gespart. Wahrscheinlich ist die"}, {"id": 673, "start": 5192.32, "end": 5196.32, "text": "entweder nicht eingebaut oder nicht lizenziert. Dementsprechend kannst du einen Raspberry"}, {"id": 674, "start": 5196.32, "end": 5203.32, "text": "Pi Nass komplett vergessen mit Verschlüsselung. Und einen Nass ohne Verschlüsselung zu betreiben"}, {"id": 675, "start": 5203.32, "end": 5207.32, "text": "ist ein bisschen doof, weil da kannst du deine Festplatten beispielsweise gar nicht wegschmeißen."}, {"id": 676, "start": 5207.32, "end": 5211.32, "text": "So ohne weiteres. Da musst du deine Festplatten quasi erst mit Anstöpsel, deine Festplatten"}, {"id": 677, "start": 5211.32, "end": 5215.32, "text": "leeren. Will man ja eigentlich nicht. Also wenn man einen Nass hat, sollte man das schon"}, {"id": 678, "start": 5215.32, "end": 5220.32, "text": "voll verschlüsseln können. Und auch per Performant voll verschlüsseln können. Ansonsten ist"}, {"id": 679, "start": 5220.32, "end": 5238.32, "text": "die, ja es ist nicht angenehm. Nee habe ich nicht. So. Ja. Dann noch eine andere Sache,"}, {"id": 680, "start": 5238.32, "end": 5242.32, "text": "die es leider gerade nicht mehr bei Amazon gibt, aber die wirklich nice ist für Leute,"}, {"id": 681, "start": 5242.32, "end": 5247.32, "text": "die ein bisschen basteln. Und Leute, die ein bisschen basteln, die freuen sich über sowas."}, {"id": 682, "start": 5247.32, "end": 5251.32, "text": "Ein Switch-Bot. Weiß nicht, ob ich euch das schon mal gezeigt habe. Ich habe mir mal zwei"}, {"id": 683, "start": 5251.32, "end": 5259.32, "text": "Stück bestellt, als es die bei Amazon gab. Die Dinger sind richtig nice. Gibt es da"}, {"id": 684, "start": 5259.32, "end": 5273.32, "text": "kein Video von? Ich zeige es euch mal. Die Dinger sind richtig nice. Genau, hier sieht"}, {"id": 685, "start": 5273.32, "end": 5281.32, "text": "man es. Guck, habt ihr es gesehen? Moment. Habt ihr gesehen, was das Ding macht? Das ist"}, {"id": 686, "start": 5281.32, "end": 5289.32, "text": "ein Schalter, den man den Remote-Schalter schaltet. Hallo, Alter, Twitch. Nee, YouTube, was macht"}, {"id": 687, "start": 5289.32, "end": 5300.32, "text": "ihr da? Guckt mal. Seht ihr das? Ein Schalter, den den Remote-Schalter schaltet. Richtig"}, {"id": 688, "start": 5300.32, "end": 5310.32, "text": "poggert das Teil. Ja, und man kann es sogar umgedreht machen. Hier sind so kleine Pads,"}, {"id": 689, "start": 5310.32, "end": 5316.32, "text": "die er hier auch gerade zeigt. Damit kann man das dann umgedreht schalten. Also quasi,"}, {"id": 690, "start": 5316.32, "end": 5321.32, "text": "wenn es wo dran geht und du willst es wieder raus machen, den Schalter, geht auch. Dann"}, {"id": 691, "start": 5321.32, "end": 5328.32, "text": "kann man so ein Pad hier dran machen. Ja, die Dinger sind richtig geil. Und jeder, der"}, {"id": 692, "start": 5328.32, "end": 5332.32, "text": "bastelt, freut sich über sowas. Leider gibt es die gerade nicht bei Amazon. Guckt, man"}, {"id": 693, "start": 5332.32, "end": 5343.32, "text": "sieht es hier vielleicht nochmal. Achtung. Hallo. Ja, auf, zeig uns nochmal, wie es schaltert."}, {"id": 694, "start": 5343.32, "end": 5357.32, "text": "Alter, was macht ihr denn da? 30 Milliarden Videos anstatt es einfach mal kurz das Ding"}, {"id": 695, "start": 5357.32, "end": 5363.32, "text": "zeigen. Hier, jetzt hier sieht man es gut. Guckt euch das mal an. Das ist richtig pogg."}, {"id": 696, "start": 5363.32, "end": 5369.32, "text": "Okay, die übertreiben es jetzt ein bisschen hier gerade. Aber so funktioniert das. Das"}, {"id": 697, "start": 5369.32, "end": 5374.32, "text": "ist ein Schalter, der andere Schalter schaltet. Dafür lohnt es sich nicht. Und ich weiß auch"}, {"id": 698, "start": 5374.32, "end": 5378.32, "text": "ehrlich gesagt nicht, wie lange die Batterie hält, aber es ist eine super leise Spielerei."}, {"id": 699, "start": 5378.32, "end": 5382.32, "text": "Und die sind auch gar nicht so teuer. Ich habe die, glaube ich, für 20 Euro oder so"}, {"id": 700, "start": 5382.32, "end": 5397.32, "text": "bestellt damals. Was kosten die mittlerweile? Ja, 24 Euro. Ja, da freut sich auch jeder Bastler"}, {"id": 701, "start": 5397.32, "end": 5415.32, "text": "darüber. Die sind cool. Das ist gar nicht mal so einfach selber zu bauen. Na ja, wenn"}, {"id": 702, "start": 5415.32, "end": 5425.32, "text": "es einem nicht wert ist, dann nicht. Das ist WLAN. Und so mal WLAN. Man kann die offizielle"}, {"id": 703, "start": 5425.32, "end": 5431.32, "text": "WLAN verwenden zum Bedienen oder man integriert in seine Heimautomatisierung, was auch problemlos"}, {"id": 704, "start": 5431.32, "end": 5448.32, "text": "geht. Switchboard, Home Assistant, Switchboard Plattform, zack, funktioniert. So, das ist"}, {"id": 705, "start": 5448.32, "end": 5451.32, "text": "auch so ein Ding, was ich empfehlen kann. Freut sich jeder, der bastelt darüber. Und"}, {"id": 706, "start": 5451.32, "end": 5456.32, "text": "es ist eigentlich ein richtig nicees Gadget. Und für 24 Euro liegt es auch noch im Rahmen"}, {"id": 707, "start": 5456.32, "end": 5462.32, "text": "für Weihnachtsgeschenke. So, das nächste, auch eine Sache, wo kaum einer weiß, dass"}, {"id": 708, "start": 5462.32, "end": 5475.32, "text": "er das haben will. Aber er will es haben und zwar Micro SD von Samsung Endurance. So, wer"}, {"id": 709, "start": 5475.32, "end": 5480.32, "text": "beispielsweise einen Raspberry Pi hat oder meinetwegen auch Photos oder sonst was macht,"}, {"id": 710, "start": 5480.32, "end": 5486.32, "text": "ich weiß nicht. Aber gerade für Raspberry Pies, die Dinger sind Poggers, weil ich habe"}, {"id": 711, "start": 5486.32, "end": 5495.32, "text": "schon so viele normalen kack billig Micro SDs geschrottet, weil die einfach Müll sind,"}, {"id": 712, "start": 5495.32, "end": 5501.32, "text": "weil das Schlechteste vom Schlechtesten verbaut ist. Holt so ein Ding und ihr kriegt es nicht"}, {"id": 713, "start": 5501.32, "end": 5508.32, "text": "kaputt. Gerade wenn man jemanden hat, der beispielsweise ein paar Raspberry Pies drin"}, {"id": 714, "start": 5508.32, "end": 5519.32, "text": "hat, das da ist das Ding, was man rein machen sollte. 32G Samsung Endurance Micro SD Karte."}, {"id": 715, "start": 5519.32, "end": 5524.32, "text": "Also, wenn ihr jemanden kennt oder jemand seid oder wie auch immer, der bastelt und"}, {"id": 716, "start": 5524.32, "end": 5528.32, "text": "ab und zu mal Micro SD Karten braucht, holt das Ding. Das kostet zwar ein bisschen mehr"}, {"id": 717, "start": 5528.32, "end": 5534.32, "text": "wie normale Micro SD Karten, aber das kriegt ihr nicht kaputtgeschrieben. Und das ist"}, {"id": 718, "start": 5534.32, "end": 5542.32, "text": "wirklich Endurance. Das funktioniert. Und kaum einer weiß, dass es irgendwie extra"}, {"id": 719, "start": 5542.32, "end": 5548.32, "text": "special haltbare Micro SD Karten gibt. Denkt immer man muss da mit diesen billig Kingston"}, {"id": 720, "start": 5548.32, "end": 5567.32, "text": "Dinger rumhantieren für 250, die nach zwei Monaten kaputt sind. Also, die sind leist."}, {"id": 721, "start": 5567.32, "end": 5574.32, "text": "Ja, dann auch noch ein Ding, was auch. Ups, ich stehe gerade mit dem Stuhl auf meinem"}, {"id": 722, "start": 5574.32, "end": 5582.32, "text": "Kopfhörer. Warte mal, das ist jetzt nicht so. Low-Brain-Champ. So. Dann eine Sache, die"}, {"id": 723, "start": 5582.32, "end": 5589.32, "text": "auch immer praktisch ist. USB auf SATA Adapter. Da müsst ihr mal gucken. Das kann auch was"}, {"id": 724, "start": 5589.32, "end": 5595.32, "text": "billiges sein. Warum ich das sage mit USB auf SATA Adapter ist, mittlerweile hat jeder"}, {"id": 725, "start": 5595.32, "end": 5603.32, "text": "daheim SSDs rumfliegen, weil SSDs sind schon jetzt bestimmt zehn Jahre am Start. Und"}, {"id": 726, "start": 5603.32, "end": 5608.32, "text": "die ersten paar SSDs, die sich die Leute gekauft haben, teilweise mit 32G oder so, die sind"}, {"id": 727, "start": 5608.32, "end": 5616.32, "text": "mittlerweile ausgemustert. Und weil wir es gerade von besonders haltbaren Micro SD Karten"}, {"id": 728, "start": 5616.32, "end": 5622.32, "text": "hatten. USB-Sticks sind das Schlimmste, was es gibt. USB-Sticks, ich weiß nicht, was"}, {"id": 729, "start": 5622.32, "end": 5632.32, "text": "die Hersteller drin verbauen, aber wirklich findet mal USB-Sticks, die zuverlässig sind."}, {"id": 730, "start": 5632.32, "end": 5638.32, "text": "Also sprich, wo du dich auch darauf verlassen kannst, dass der nächste, den du dir kaufst"}, {"id": 731, "start": 5638.32, "end": 5642.32, "text": "von der gleichen Serie, wieder was taugt. Also USB-Sticks sind zum größten Teil absoluter"}, {"id": 732, "start": 5642.32, "end": 5648.32, "text": "Müll und es gibt nichts besseres als USB-Sticks wie eine alte ausgemusterte SSD. Ist einfach"}, {"id": 733, "start": 5648.32, "end": 5655.32, "text": "so. Dagegen kackt jeder USB-Stick ab. Und das Beste, was man sich da kaufen kann, ist"}, {"id": 734, "start": 5655.32, "end": 5665.32, "text": "einen billigen SATA auf USB-Adapter. Und man hat zu den besten USB-Sticks, den es gibt."}, {"id": 735, "start": 5665.32, "end": 5671.32, "text": "Weil ausgemusterte SSDs hat mittlerweile jeder daheim liegen. Oder fast jeder. Ich weiß"}, {"id": 736, "start": 5671.32, "end": 5678.32, "text": "nicht, Chat, Chat, ich weiß nicht, wie es bei euch aussieht. Aber ich habe beispielsweise"}, {"id": 737, "start": 5678.32, "end": 5684.32, "text": "hier noch alte 32G-SSDs, die ich mittlerweile exklusiv als USB-Sticks verwende. Ich habe"}, {"id": 738, "start": 5684.32, "end": 5696.32, "text": "hier alte ausgemusterte 32G-SSDs, die ich mittlerweile hier exklusiv als USB-Sticks verwende. Und"}, {"id": 739, "start": 5696.32, "end": 5701.32, "text": "die sind auch voll AliExpress. Das ist China Zeug. Also wenn ihr Zeit habt, könnt ihr die"}, {"id": 740, "start": 5701.32, "end": 5706.32, "text": "bei AliExpress bestellen. Allerdings wird es dann zu Weihnachten, je nachdem, ein bisschen"}, {"id": 741, "start": 5706.32, "end": 5718.32, "text": "mehr. Und gerade dafür ist das eigentlich das Beste, was man machen kann oder was man"}, {"id": 742, "start": 5718.32, "end": 5727.32, "text": "einem holen kann. Jeder hat ausgemusterte SSDs. SATA auf USB. Ich habe übrigens auch von"}, {"id": 743, "start": 5727.32, "end": 5731.32, "text": "AliExpress bestellt. Ich habe irgendwie mal einen 5er-Pack oder so bei AliExpress bestellt."}, {"id": 744, "start": 5731.32, "end": 5736.32, "text": "Das Beste hätte ich mir schon viel früher kaufen sollen. Aufhören mit USB-Sticks rum"}, {"id": 745, "start": 5736.32, "end": 5749.32, "text": "zu hantieren. Ja, so. Weiter weg, wo wir gerade dabei sind. Ich würde euch nicht empfehlen,"}, {"id": 746, "start": 5749.32, "end": 5752.32, "text": "ich weiß, dass viele sowas gerne machen, aber ich würde es euch nicht empfehlen. Ich würde"}, {"id": 747, "start": 5752.32, "end": 5762.32, "text": "euch nicht empfehlen, wenn ihr nicht selbst aus dieser Richtung seid oder wenn ihr nicht"}, {"id": 748, "start": 5762.32, "end": 5768.32, "text": "sehr genau Ahnung habt, was einer will. Es gibt jede Menge lustige, in Anführungsstrichen,"}, {"id": 749, "start": 5768.32, "end": 5773.32, "text": "Informatiker-T-Shirts oder Technik-Sachen. Es gibt für jeden Beruf eigentlich irgendwie"}, {"id": 750, "start": 5773.32, "end": 5778.32, "text": "so ein bisschen witzige T-Shirts. Aber ich kann euch sagen, die meisten Sachen sind ultra"}, {"id": 751, "start": 5778.32, "end": 5787.32, "text": "cringe und würde ich nicht anziehen. Also wenn ihr Noob seid in dem Bereich, schenkt"}, {"id": 752, "start": 5787.32, "end": 5792.32, "text": "irgendwie einem Technik-Interessierten oder Informatiker kein lustiges Informatiker-T-Shirt."}, {"id": 753, "start": 5792.32, "end": 5797.32, "text": "Wenn ihr selbst in der Materie drin seid, könnt ihr es probieren, wobei ihr dann den"}, {"id": 754, "start": 5797.32, "end": 5803.32, "text": "Humor treffen müsst von dem jeweiligen Typ. Ist nicht so einfach. Was ich find's witzig,"}, {"id": 755, "start": 5803.32, "end": 5812.32, "text": "weil ich hab mir letztens hier so ein MonkaS-T-Shirt gekauft. Sowas hier. Das könnt ihr aber auch"}, {"id": 756, "start": 5812.32, "end": 5823.32, "text": "nicht jedem schenken, ja. Aber das fand ich beispielweise ganz witzig. Das ist auch gut,"}, {"id": 757, "start": 5823.32, "end": 5835.32, "text": "das gefällt mir auch hier. Das hier gefällt mir auch. Gag wie Emote-Langarm-Shirt. Aber"}, {"id": 758, "start": 5835.32, "end": 5842.32, "text": "wie gesagt, das ist echt Geschmackssache und je nachdem wie blöd die Sprüche sind. Ihr"}, {"id": 759, "start": 5842.32, "end": 5851.32, "text": "wisst ja, ein Admin schläft nicht, er ruht. PainsChamp. Also er ruht. Nur für den Fall,"}, {"id": 760, "start": 5851.32, "end": 5863.32, "text": "der diesen super krassen Witz nicht verstanden hat. PainsChamp. Richtig krasser PainsChamp,"}, {"id": 761, "start": 5863.32, "end": 5891.32, "text": "oder? Ja. Ja und es gibt sich, es gibt sich so Sprüche in dieser Richtung, die sind nicht"}, {"id": 762, "start": 5891.32, "end": 5896.32, "text": "lustig. Das heißt, ich würd ehrlich gesagt davon abraten, Leuten so T-Shirts zu schenken."}, {"id": 763, "start": 5896.32, "end": 5910.32, "text": "Außer ihr kennt den halt gut oder seid selbst aus dem Bereich und findet das gleiche lustig"}, {"id": 764, "start": 5910.32, "end": 5915.32, "text": "oder so. So, dann hätt ich noch was für Bastler. Noch zwei Sachen für Bastler. Eine Sache,"}, {"id": 765, "start": 5915.32, "end": 5922.32, "text": "die man nie genug haben kann, sind Jumperkabel. Und zwar da am besten gleich das Dreier-Set."}, {"id": 766, "start": 5922.32, "end": 5930.32, "text": "Nämlich das Dreier-Set mit drei verschiedenen Sorten. Das da zum Beispiel. Davon kann man"}, {"id": 767, "start": 5930.32, "end": 5936.32, "text": "nie genug haben. Also jeder, der ein bisschen Technik-Grams bastelt, der wird's wahrscheinlich"}, {"id": 768, "start": 5936.32, "end": 5941.32, "text": "ähnlich sehen. Die Dinger hast du nie genug und im Zweifelsfall findest du sie nicht."}, {"id": 769, "start": 5941.32, "end": 5947.32, "text": "Der Chat, es bringt nix, wenn wir hier irgendwelche AliExpress-Vergleiche machen. Wir wollen ja"}, {"id": 770, "start": 5947.32, "end": 5952.32, "text": "Sachen haben, die noch vor Weihnachten ankommen. Dass die Dinger billiger bei AliExpress sind"}, {"id": 771, "start": 5952.32, "end": 5956.32, "text": "und dass die Dinger wahrscheinlich auch aus China kommen, müssen wir nicht drüber reden."}, {"id": 772, "start": 5956.32, "end": 5962.32, "text": "Aber bringt's jetzt ja nett. Aber gerade die Kombination hier, du hast einmal die mit Pins"}, {"id": 773, "start": 5962.32, "end": 5965.32, "text": "auf beiden Seiten, Pins auf einer Seite und auf der anderen Seite Stecker und hier zweimal"}, {"id": 774, "start": 5965.32, "end": 5972.32, "text": "Stecker. Wunderbar. Kann man nie genug von haben. Und ist mit um die fünf Euro, das hier"}, {"id": 775, "start": 5972.32, "end": 5978.32, "text": "ist tatsächlich ein bisschen viel, auch wunderbar. Da kann man die Leute mit erfreuen, weil davon"}, {"id": 776, "start": 5978.32, "end": 5984.32, "text": "kann man nie genug haben. Und jetzt noch ein Geschenk, was ich wirklich richtig praktisch"}, {"id": 777, "start": 5984.32, "end": 5994.32, "text": "finde. Für die Ordnung daheim und ist noch nicht mal unbedingt jetzt für Bastler und"}, {"id": 778, "start": 5994.32, "end": 6001.32, "text": "Techniker, also im Speziellen, kann jeder eigentlich gut gebrauchen und zwar ein Label"}, {"id": 779, "start": 6001.32, "end": 6013.32, "text": "Drucker. Sowas da zum Beispiel. Kannste alles mögliche mit anfangen. Was weiß ich. Was"}, {"id": 780, "start": 6013.32, "end": 6023.32, "text": "auch immer. Das ist Reis beschriften oder so. Also wenn man beispielsweise irgendwelche"}, {"id": 781, "start": 6023.32, "end": 6026.32, "text": "Schubladen hat, ich habe beispielsweise im Flur in den Schränken ein paar Schubladen,"}, {"id": 782, "start": 6026.32, "end": 6033.32, "text": "wo ich mein Zeug, Kleinkram drinne habe. Da habe ich dann auch auf der Schublade drauf"}, {"id": 783, "start": 6033.32, "end": 6043.32, "text": "stehen, so ein Etikett. Man kann sie um Netzwerkkabel beispielsweise wickeln, dass man was drauf"}, {"id": 784, "start": 6043.32, "end": 6049.32, "text": "sieht. Oder nicht wickeln, so einmal drum legen und zusammen packen. Man kann das bei"}, {"id": 785, "start": 6049.32, "end": 6054.32, "text": "kleinen Jumperkabel drum herum machen, dass man sagt, ok, das hier ist Crown, das hier"}, {"id": 786, "start": 6054.32, "end": 6067.32, "text": "ist VCC, das hier ist Pin 1, Pin 2. Die kann man echt für alles brauchen. Ja. Das ist"}, {"id": 787, "start": 6067.32, "end": 6074.32, "text": "für so ziemlich jeden eine super Geschichte. Gibt eigentlich kaum einen, der das net gebrauchen"}, {"id": 788, "start": 6074.32, "end": 6089.32, "text": "kann. Sieht antik aus, ja. Ist aber neu, funktioniert gut und kostet nicht viel und"}, {"id": 789, "start": 6089.32, "end": 6095.32, "text": "hat den Vorteil, dass die Sachen, die man jetzt kauft, dass die mit Papierzeug funktionieren."}, {"id": 790, "start": 6095.32, "end": 6103.32, "text": "Die waren früher noch Plastik, also Plastiklabel. Mittlerweile sind das zumindest standardmäßig"}, {"id": 791, "start": 6103.32, "end": 6111.32, "text": "Papierlabel, was dann auch die Umweltschützer freut. Die gibt es bestimmt aber auch, wenn"}, {"id": 792, "start": 6111.32, "end": 6119.32, "text": "man das haben will, mit Kunststoff. Aber standardmäßig sind die mittlerweile mit Papier. Das heißt,"}, {"id": 793, "start": 6119.32, "end": 6125.32, "text": "da kann man sich dann auch auf der sicheren Seite fühlen. Nicht, dass man das einem schenkt"}, {"id": 794, "start": 6125.32, "end": 6130.32, "text": "oder sagt, sowas verwende ich nicht, ich bin keine Umweltsau. Das weiß ich ja nicht."}, {"id": 795, "start": 6130.32, "end": 6135.32, "text": "Keine Ahnung, aber zumindest sind die standardmäßig mit Papier und dann kann sich da keiner aufregen."}, {"id": 796, "start": 6135.32, "end": 6141.32, "text": "Es muss auch übrigens nicht der sein, es gibt da zig verschiedene andere, die man sich"}, {"id": 797, "start": 6141.32, "end": 6146.32, "text": "auch noch holen kann. Den habe ich und ganz ehrlich, 25 Euro sind wirklich super investiert"}, {"id": 798, "start": 6146.32, "end": 6162.32, "text": "für so einen Label-Trucker. Das nächste, was ich mir aufgeschrieben habe, ist eigentlich"}, {"id": 799, "start": 6162.32, "end": 6169.32, "text": "relativ offensichtlich. Und zwar jeder Bastler, der noch keinen Raspberry Pi hat, der sollte"}, {"id": 800, "start": 6169.32, "end": 6176.32, "text": "eigentlich einen haben. Das heißt, wenn ihr jemand seid, der ein bisschen basteln will,"}, {"id": 801, "start": 6176.32, "end": 6179.32, "text": "noch nicht so richtig angefangen hat, noch keinen Raspberry Pi, es habt ihr jemanden"}, {"id": 802, "start": 6179.32, "end": 6187.32, "text": "kennt, Raspberry Pi muss immer sein. Ohne Raspberry Pi ist nervig. Also auch viele kleine"}, {"id": 803, "start": 6187.32, "end": 6191.32, "text": "Sachen, die man so macht, braucht man den als Hilfsmittel. Meinen Staubsauger habe"}, {"id": 804, "start": 6191.32, "end": 6196.32, "text": "ich damit geflasht zum Beispiel. Und ihr wisst, ich erzähle keinen Scheiß, ich habe euch"}, {"id": 805, "start": 6196.32, "end": 6202.32, "text": "dann den Staubsauger geflasht gezeigt, sogar das Web-Interface. Meinen Staubsauger habe"}, {"id": 806, "start": 6202.32, "end": 6209.32, "text": "ich damit geflasht, Steckdosenleisten habe ich damit geflasht, Sachen im WLAN mitgeschnitten,"}, {"id": 807, "start": 6209.32, "end": 6217.32, "text": "alle möglichen Sachen. Also ein Raspberry Pi ist so ein komplett rundes, rund um Paket,"}, {"id": 808, "start": 6217.32, "end": 6225.32, "text": "was man braucht. Staubsauger, Web-Interface, ja, hier guck. Exzellent, da ist das Web-Interface."}, {"id": 809, "start": 6225.32, "end": 6240.32, "text": "Da ist die Karte von meinem Wohnzimmer. Ja, so muss das sein. So, und wenn ihr noch keinen"}, {"id": 810, "start": 6240.32, "end": 6246.32, "text": "Raspberry Pi habt oder denjenigen, den ihr beschenken wollt, der hat schon einen, dann"}, {"id": 811, "start": 6246.32, "end": 6252.32, "text": "ist ein zweiter auch nicht verkehrt, weil Raspberry Pi ist auch so was. Es ist vielleicht nicht"}, {"id": 812, "start": 6252.32, "end": 6256.32, "text": "ganz so schlimm wie SD-Karten, also du kannst irgendwann schon genug Raspberry Pies haben,"}, {"id": 813, "start": 6256.32, "end": 6264.32, "text": "aber du hast, also es dauert eine Weile, bis man wirklich genug hat. Wo kaufst du Amazon?"}, {"id": 814, "start": 6264.32, "end": 6275.32, "text": "Wo kaufst du deinen Raspberry Pi? Ich kauf das meistens da oder bei, oder da. Aber ich"}, {"id": 815, "start": 6275.32, "end": 6289.32, "text": "denke mal, preislich nimmt sich das gerade jetzt gar nicht so viel. Zero auch wunderbar,"}, {"id": 816, "start": 6289.32, "end": 6297.32, "text": "ja. 4G, das dürfte ja sein, indem wir bei Amazon auch ausgewählt haben,"}, {"id": 817, "start": 6297.32, "end": 6310.32, "text": "oder? Oh, guck mal, nee, da ist bei Amazon auch der 4G, okay, passt. Da nimmt sich nichts,"}, {"id": 818, "start": 6310.32, "end": 6317.32, "text": "da kann man es auch bei Amazon kaufen. Ich würde vorschlagen beim Raspberry Pi 4, das"}, {"id": 819, "start": 6317.32, "end": 6321.32, "text": "ist überall das gleiche, also ich würde vorschlagen, wenn man sich einen Raspberry Pi 4 kauft oder"}, {"id": 820, "start": 6321.32, "end": 6329.32, "text": "wenn man einem einen Raspberry Pi 4 schenken will, dann, ich würde zur 4GB Variante tendieren."}, {"id": 821, "start": 6329.32, "end": 6336.32, "text": "Erstens, dass es mehr als es beim 3er gibt, also was ja einer der Gründe für einen Raspberry"}, {"id": 822, "start": 6336.32, "end": 6346.32, "text": "Pi 4 ist, und zweitens ist die 8GB Variante, finde ich, oversized. Also es gibt nicht viel,"}, {"id": 823, "start": 6346.32, "end": 6354.32, "text": "wo man wirklich 8GB für braucht, und das kostet auch dementsprechend mehr, ja, also man braucht"}, {"id": 824, "start": 6354.32, "end": 6363.32, "text": "es nicht wirklich. Also 8GB ist eigentlich nicht notwendig. Natürlich, Ausnahmen bestätigen"}, {"id": 825, "start": 6363.32, "end": 6369.32, "text": "die Regeln, es gibt sicherlich ein paar Anwendungen, wo man davon bestimmt profitiert, aber normalerweise"}, {"id": 826, "start": 6369.32, "end": 6374.32, "text": "scheitert es nicht am RAM. Und 4GB ist, finde ich, ein ganz gutes Mittelmaß, ja. Und wenn"}, {"id": 827, "start": 6374.32, "end": 6383.32, "text": "ihr ein bisschen weniger ausgeben wollt, könnt ihr entweder das 2GB Modell nehmen, das ist"}, {"id": 828, "start": 6383.32, "end": 6388.32, "text": "aber auch gar nicht so viel günstiger, oder aber, wenn einer wirklich noch gar nichts"}, {"id": 829, "start": 6388.32, "end": 6394.32, "text": "hat, dem könnt ihr auch einen Raspberry Pi 3 schenken, das kostet dann nochmal eine"}, {"id": 830, "start": 6394.32, "end": 6403.32, "text": "Ecke weniger, hat noch ein bisschen weniger RAM, ja, aber der RAM ist meistens nicht das,"}, {"id": 831, "start": 6403.32, "end": 6409.32, "text": "was jetzt irgendwie großartig stört bei dem, was man da macht. Und für 33€ ist das auch"}, {"id": 832, "start": 6409.32, "end": 6417.32, "text": "eine nette Geschichte, wenn man nicht mehr ausgeben will. Also wenn man noch gar nichts"}, {"id": 833, "start": 6417.32, "end": 6424.32, "text": "hat und einsteigen will und möglichst preisleistungsmäßig gut dabei sein will, würde ich zum 3er greifen,"}, {"id": 834, "start": 6424.32, "end": 6434.32, "text": "tatsächlich, ja. Wenn du einen Raspberry Pi Desktop bauen willst, ja, das ist ein Raspberry"}, {"id": 835, "start": 6434.32, "end": 6440.32, "text": "Pi Desktop, Desktop bauen aber auch nur irgendwelche Tryhards, die damit da nichts"}, {"id": 836, "start": 6440.32, "end": 6443.32, "text": "machen, sondern einfach nur sagen wollen, ich habe einen Raspberry Pi 3 Desktop, Raspberry"}, {"id": 837, "start": 6443.32, "end": 6458.32, "text": "Pi Desktop. Nass, nass, für nass ist ein Raspberry Pi eh schlecht. Also selbst ein"}, {"id": 838, "start": 6458.32, "end": 6466.32, "text": "Pi 4 ist als nass, finde ich, was für mich nicht zu gebrauchen. Die hätten man nicht"}, {"id": 839, "start": 6466.32, "end": 6472.32, "text": "bei der Hardware Krypto-Extension sparen sollen für die CPU, dann wäre es brauchbar. Ja,"}, {"id": 840, "start": 6472.32, "end": 6476.32, "text": "da würde ich tatsächlich lieber einen Odroid nehmen, wie der Sirius Maxx schreibt, genau,"}, {"id": 841, "start": 6476.32, "end": 6481.32, "text": "wenn ich einen nass bauen will. Oder man nimmt wirklich, also wenn man einen nass bauen"}, {"id": 842, "start": 6481.32, "end": 6487.32, "text": "will, wenn man wirklich selbst sich eins zusammen basteln möchte, dann nimmt man eben eine"}, {"id": 843, "start": 6487.32, "end": 6492.32, "text": "Low-Power-Intel-Plattform. Irgend so eine Low-Power-X86-Plattform kann durchaus auch"}, {"id": 844, "start": 6492.32, "end": 6500.32, "text": "was sein, wo CPU und Mainboard schon verlötet ist. Irgend so ein Low-End-Vierkern-Ding, das"}, {"id": 845, "start": 6500.32, "end": 6510.32, "text": "hat kaum Strom, auch nicht so viel mehr als ein Raspberry Pi, 4-5 Watt mehr und hat deutlich"}, {"id": 846, "start": 6510.32, "end": 6517.32, "text": "mehr Power und ist x86, macht weniger Probleme, hat Krypto-Extensions, flutscht, hat mehr"}, {"id": 847, "start": 6517.32, "end": 6522.32, "text": "SATA-Anschlüsse, sogar ein PC-Express, nicht ganz so klein, aber da kommt es beim Nass"}, {"id": 848, "start": 6522.32, "end": 6536.32, "text": "drauf an. Ja, genau. So sieht es aus. Wo wir gerade beim Thema Raspberry Pi sind, wenn"}, {"id": 849, "start": 6536.32, "end": 6542.32, "text": "ihr schon Leute habt, kennt, die Raspberry Pi haben und damit auch ganz gut am Basteln"}, {"id": 850, "start": 6542.32, "end": 6547.32, "text": "sind, kauft ihnen, gerade wenn es ein Raspberry Pi 4 ist, kauft ihnen ein ordentliches Raspberry"}, {"id": 851, "start": 6547.32, "end": 6558.32, "text": "Pi 4 Case. Zum Beispiel ist das Flirck-Case, ist ganz nett, ist ein komplettes Aluminium-Gehäuse,"}, {"id": 852, "start": 6558.32, "end": 6567.32, "text": "was die Abwärme vom Raspberry Pi ganz gut managt. Der Raspberry Pi 4 wird nämlich relativ"}, {"id": 853, "start": 6567.32, "end": 6577.32, "text": "warm, oder wenn man zu viel Geld hat, kann man auch sowas kaufen. Die sind auch ganz"}, {"id": 854, "start": 6577.32, "end": 6597.32, "text": "gut. Aber ich finde das hier cool. Ja, und kommt auch noch vor Weihnachten. So ein ordentliches"}, {"id": 855, "start": 6597.32, "end": 6606.32, "text": "Case ist nicht verkehrt. Den Intel NUC würde ich nicht kaufen, weil ein Intel NUC keinen"}, {"id": 856, "start": 6606.32, "end": 6611.32, "text": "PC-Express hat. Also wenn ich mir einen x86 kaufe, dann würde ich tatsächlich einen"}, {"id": 857, "start": 6611.32, "end": 6617.32, "text": "Low-Power-Intel-Plattform kaufen, der kein NUC ist für einen Nass, weil so PC-Express-Anschluss"}, {"id": 858, "start": 6617.32, "end": 6623.32, "text": "macht die ganze Sache nochmal eine ganze Ecke flexibler. Du hast die Option auf weitere"}, {"id": 859, "start": 6623.32, "end": 6628.32, "text": "SATA-Anschlüsse zum Beispiel oder vielleicht sogar einen RAID-Adapter oder eine Netzwerkkarte,"}, {"id": 860, "start": 6628.32, "end": 6633.32, "text": "wenn dir Gigabit nicht reicht. Deswegen, ich bin da kein Fan von einem NUC. NUC hat"}, {"id": 861, "start": 6633.32, "end": 6642.32, "text": "zu wenig Anschlüsse für Nass. Hast du einen Tipp für sichere Steckdosen-Leisten? Ich"}, {"id": 862, "start": 6642.32, "end": 6646.32, "text": "habe einen Tipp für China-Steckdosen-Leisten, die sich flaschen lassen, aber ich glaube,"}, {"id": 863, "start": 6646.32, "end": 6657.32, "text": "das ist nicht das, was du haben willst. 3D-Drucker ist auch was, was sich sicherlich zu Weihnachten"}, {"id": 864, "start": 6657.32, "end": 6661.32, "text": "anbietet. Die Sache ist nur die, die sind halt ein bisschen teuer. Also sehr beliebt"}, {"id": 865, "start": 6661.32, "end": 6667.32, "text": "zum Einstieg ist dieses Ding als 3D-Drucker. Das ist eigentlich so der Einstiegs-3D-Drucker"}, {"id": 866, "start": 6667.32, "end": 6676.32, "text": "schlechthin, mit dem fast jeder angefangen hat als Einstieg. Aber das geht dann schon"}, {"id": 867, "start": 6676.32, "end": 6682.32, "text": "ein bisschen ins Geld. Wenn ihr da in China guckt, ist es billiger. Allerdings könnte"}, {"id": 868, "start": 6682.32, "end": 6692.32, "text": "es ein bisschen eng werden, die Sachen aus China zu bestellen. Ah, so viel billiger"}, {"id": 869, "start": 6692.32, "end": 6705.32, "text": "ist es aus China gar nicht mehr. Nee, das landet nicht beim Zoll. Das bestellen wir"}, {"id": 870, "start": 6705.32, "end": 6713.32, "text": "hier. EU-Priority-Mail, alles gut, passt. Guck mal, das kommt sogar aus Spanien, dann"}, {"id": 871, "start": 6713.32, "end": 6723.32, "text": "ist mit Zoll eh nix. Aber eBay ist sacked. Ich habe auch einen i3-Mega-S für irgendwie"}, {"id": 872, "start": 6723.32, "end": 6731.32, "text": "um die 200 oder so. Das ist auch poggers, das Teil. Ich habe ja fast den Fehler gemacht,"}, {"id": 873, "start": 6731.32, "end": 6735.32, "text": "mir den 1000 Euro 3D-Drucker als Einstieg zu kaufen, obwohl ich es gut, dass ich nicht"}, {"id": 874, "start": 6735.32, "end": 6740.32, "text": "gemacht habe. Ich drucke im Endeffekt nicht so viel und das Geld kann man besser investieren."}, {"id": 875, "start": 6740.32, "end": 6748.32, "text": "Aber 3D-Drucker sind halt ein bisschen teure Angelegenheit für Weihnachten. So, dann habe"}, {"id": 876, "start": 6748.32, "end": 6755.32, "text": "ich mir noch ein paar Sachen aufgeschrieben, die ich auch ganz nützlich finde. Ach so,"}, {"id": 877, "start": 6755.32, "end": 6760.32, "text": "ja, du kannst natürlich einen Case von Raspberry Pi selbst drucken, aber das bringt dir natürlich"}, {"id": 878, "start": 6760.32, "end": 6765.32, "text": "nix, wenn ein Raspberry Pi zu warm wird, weil gute Wärmeableitung hat das 3D-gedruckte"}, {"id": 879, "start": 6765.32, "end": 6770.32, "text": "Zeug natürlich nicht. Wenn du dir so ein fertiges Aluminiumgehäuse kaufst, ist ja schon"}, {"id": 880, "start": 6770.32, "end": 6775.32, "text": "eine andere Hausnummer als ein 3D-gedrucktes Case. Aber wenn man einfach nur einen Case"}, {"id": 881, "start": 6775.32, "end": 6784.32, "text": "braucht, dann kann man sich das auch ohne Probleme selbst drucken. Der Killfilm willst"}, {"id": 882, "start": 6784.32, "end": 6791.32, "text": "wissen. Genau, dann eine Sache, die ich sage jetzt nochmal so ganz allgemein, auch eine"}, {"id": 883, "start": 6791.32, "end": 6798.32, "text": "Sache, die jeder braucht, vor allem Leute, die Smartphones, Tablets und sowas dabei haben,"}, {"id": 884, "start": 6798.32, "end": 6803.32, "text": "ist irgendeine ordentliche Powerbank. Da zeige ich jetzt nichts. 50.000, das scheint mir"}, {"id": 885, "start": 6803.32, "end": 6820.32, "text": "viel zu sein. Ob das wirklich 50.000 mAh sind? So ein kleines Ding? Kann ich mir ehrlich gesagt"}, {"id": 886, "start": 6820.32, "end": 6831.32, "text": "nicht vorstellen. 20.000 vielleicht, ja. Also ich habe beispielsweise als Powerbank sowas"}, {"id": 887, "start": 6831.32, "end": 6839.32, "text": "mit Solar-Panel, sowas hier, sowas irgendwie, sowas in der Richtung hatte ich mir mal gekauft"}, {"id": 888, "start": 6839.32, "end": 6848.32, "text": "und das ist eigentlich ganz nützlich. Zum Nachladen logischerweise nur im Sommer, aber"}, {"id": 889, "start": 6848.32, "end": 6853.32, "text": "da kannst du, also mit dem Ding, also mit so einem ähnlichen, das ist nicht das, was"}, {"id": 890, "start": 6853.32, "end": 6858.32, "text": "ich habe, aber mein sieht fast genauso aus, mit dem Ding kannst du ein iPhone schon so"}, {"id": 891, "start": 6858.32, "end": 6867.32, "text": "3-4 Mal laden oder so. Mein iPhone hat ja auch einen ordentlichen Akku, was hat denn das"}, {"id": 892, "start": 6867.32, "end": 6874.32, "text": "iPhone X, was habe ich denn, XR, XS? Ich kann mir das immer nicht merken. XR habe ich, genau."}, {"id": 893, "start": 6874.32, "end": 6900.32, "text": "Was hat denn das für ein Akku? SirAppleLot? Ok, 3000, ok. Ungefähr 3000. Ja, dann kannst"}, {"id": 894, "start": 6900.32, "end": 6913.32, "text": "du das, keine Ahnung, 4-5 Mal mit laden oder so. Aber eine ordentliche Powerbank, ohne Scheiß,"}, {"id": 895, "start": 6913.32, "end": 6918.32, "text": "ist eines der wichtigsten Sachen, die es gibt. Warum eigentlich ein iPhone? Ganz einfach,"}, {"id": 896, "start": 6918.32, "end": 6925.32, "text": "weil ich mir das iPhone nicht selbst kaufen muss. Warum soll ich mir ein Smartphone holen,"}, {"id": 897, "start": 6925.32, "end": 6937.32, "text": "was ich selbst kaufen muss, wenn ich 1000€ Smartphones umkriege? Das muss nett sein."}, {"id": 898, "start": 6937.32, "end": 6941.32, "text": "Darf man fragen, was dich vom iPhone überzeugt, obwohl du ja nicht der Folge als Apple-Jünger"}, {"id": 899, "start": 6941.32, "end": 6951.32, "text": "bist? Ja, weil ich nichts dafür bezahlen muss. Firmen, Handy, Privatnutzen? Ja, genau. So"}, {"id": 900, "start": 6951.32, "end": 6959.32, "text": "sieht es aus. Ich habe so viele Apple- und Android-Geräte, ich mache da auch keinen großen"}, {"id": 901, "start": 6959.32, "end": 6965.32, "text": "Unterschied, trotz dazwischen. Also ich bin dafür und ich bin der Meinung, das ist eigentlich"}, {"id": 902, "start": 6965.32, "end": 6973.32, "text": "das Beste, was man machen kann. Keine Seite zu sehr fanboyen, sondern immer das kaufen"}, {"id": 903, "start": 6973.32, "end": 6978.32, "text": "oder das nehmen, was für den jeweiligen Anwendungszweck am besten ist. Meiner Mutter habe ich zum"}, {"id": 904, "start": 6978.32, "end": 6987.32, "text": "Beispiel auch ein iPad geschenkt und ein iPhone SE, weil die Technik noob ist. Ich hatte davor"}, {"id": 905, "start": 6987.32, "end": 6992.32, "text": "Android-Tablets und mit den Android-Tablets ist die gar nicht wirklich gut klargekommen."}, {"id": 906, "start": 6992.32, "end": 6996.32, "text": "Ich habe hier auch ein paar Jahre davor schon ein bisschen besseres Asus-Android-Tablet"}, {"id": 907, "start": 6996.32, "end": 7000.32, "text": "damals gekauft. Mit dem war ich überhaupt nicht zufrieden. Außerdem haben die den Support"}, {"id": 908, "start": 7000.32, "end": 7006.32, "text": "nach einem halben Jahr eingestellt, richtige kleine, weiß nicht, ob ich da jetzt das passende"}, {"id": 909, "start": 7006.32, "end": 7017.32, "text": "Mode für habe. Egal. Zumindest hat das gesackt. Android-Tablets sind painstabber. Ich finde,"}, {"id": 910, "start": 7017.32, "end": 7023.32, "text": "da haben die auch ein bisschen den Anschluss verloren. Und jetzt hat es ein iPad und ein"}, {"id": 911, "start": 7023.32, "end": 7032.32, "text": "iPhone und ist damit happy. Und ich verwende beispielsweise einen Fire HD 8. Ich verwende"}, {"id": 912, "start": 7032.32, "end": 7036.32, "text": "einfach so abends im Bett, um ein bisschen YouTube zu gucken. Dafür reicht es. Ansonsten"}, {"id": 913, "start": 7036.32, "end": 7041.32, "text": "habe ich mein iPhone XR, dann habe ich noch ein iPhone 6, ein altes. Geht ja aber immer"}, {"id": 914, "start": 7041.32, "end": 7054.32, "text": "noch gut. Ich habe mittlerweile insgesamt, glaube ich, 13 Tablets oder 13 solcher Gadget-Dinger,"}, {"id": 915, "start": 7054.32, "end": 7060.32, "text": "also sprich Apple und Android-Geräte zusammen. Da hat sich die letzten Jahre oder 14, ich"}, {"id": 916, "start": 7060.32, "end": 7064.32, "text": "glaube 14 sind es mittlerweile, hat sich die letzten Jahre schon ein bisschen was angesammelt,"}, {"id": 917, "start": 7064.32, "end": 7071.32, "text": "ja. Dementsprechend, ich denke, ich habe da schon mittlerweile so weit den Überblick,"}, {"id": 918, "start": 7071.32, "end": 7075.32, "text": "da ich sagen kann, ich weiß, wo die Schwächen und die Stärken von den jeweiligen Plattformen"}, {"id": 919, "start": 7075.32, "end": 7081.32, "text": "sind. Zum Beispiel ist es für mich ganz offensichtlich und ich finde, das ist auch gar nicht was,"}, {"id": 920, "start": 7081.32, "end": 7087.32, "text": "wo man, warum sich die Fanboys, ehrlich gesagt, streiten müssen. Also meiner Ansicht nach,"}, {"id": 921, "start": 7087.32, "end": 7095.32, "text": "der Riesenvorteil von Android ist customizable. Also sprich, du kannst bei Android fast alles"}, {"id": 922, "start": 7095.32, "end": 7101.32, "text": "irgendwie, irgendwo einstellen. Du hast Apps, die ganz viel merkwürdige Dinge im System"}, {"id": 923, "start": 7101.32, "end": 7106.32, "text": "machen können. Du hast so abgedrehte Sachen wie Tasker zum Beispiel, sowas wäre undenkbar"}, {"id": 924, "start": 7106.32, "end": 7112.32, "text": "unter iOS. Tasker unter iOS, es gibt Shortcuts, aber Shortcuts ist meilenweit von dem entfernt,"}, {"id": 925, "start": 7112.32, "end": 7117.32, "text": "was du auch an quasi tieferer Systemintegration, was du mit Tasker machen kannst. Also alles,"}, {"id": 926, "start": 7117.32, "end": 7129.32, "text": "was um customizable Sachen geht, um Customization, Automatisierung und eben da, wo du sehr detailliert"}, {"id": 927, "start": 7129.32, "end": 7135.32, "text": "Sachen anpassen musst, dass das macht, was du willst, ist Android viel, viel besser als"}, {"id": 928, "start": 7135.32, "end": 7147.32, "text": "als iOS. Dafür, wenn man die Sache einfach nur als Noob benutzen will, ist halt das Apple"}, {"id": 929, "start": 7147.32, "end": 7154.32, "text": "Pling Pling auch ganz nett. Und ich, jetzt kommt, jetzt kommt, finde ich eine Sache,"}, {"id": 930, "start": 7154.32, "end": 7161.32, "text": "wo man, wo man tatsächlich drüber diskutieren kann, aber ich finde, dass die Apps im iOS"}, {"id": 931, "start": 7161.32, "end": 7168.32, "text": "App Store im Durchschnitt die bessere Qualität haben, als die Apps aus dem Google Play Store."}, {"id": 932, "start": 7168.32, "end": 7176.32, "text": "Dafür hast du auch total viele merkwürdige Dinge bei Apple, also, also, preislich jetzt"}, {"id": 933, "start": 7176.32, "end": 7182.32, "text": "am Start, wo man sich fragt, okay, ist es das jetzt wirklich wert, dass ich da irgendwie"}, {"id": 934, "start": 7182.32, "end": 7186.32, "text": "so eine kacke App hab, die es bei Android umsonst gibt und tut, was ich mache und bei"}, {"id": 935, "start": 7186.32, "end": 7194.32, "text": "der gleichen App im App Store soll ich 7,99 bezahlen, ja gut. Aber ich glaube, das liegt"}, {"id": 936, "start": 7194.32, "end": 7201.32, "text": "auch ein bisschen daran, dass Apple pingeliger ist, was Usability und einheitliches Look"}, {"id": 937, "start": 7201.32, "end": 7207.32, "text": "and Feel angeht als Google. Aber im Durchschnitt würde ich schon sagen, ist die Qualität"}, {"id": 938, "start": 7207.32, "end": 7214.32, "text": "der iOS Apps besser. Dafür hast du mit der Umgedreht bei Android Sachen, die gibt's"}, {"id": 939, "start": 7214.32, "end": 7219.32, "text": "unter iOS gar nicht. Gerade was ist, sowas wie Tasker zum Beispiel, das ist nicht, das"}, {"id": 940, "start": 7219.32, "end": 7227.32, "text": "geht schlicht und ergreifend nicht unter iOS, das funktioniert nicht. Das ist technisch"}, {"id": 941, "start": 7227.32, "end": 7234.32, "text": "nicht möglich, sowas unter iOS zu bauen. Da fehlt Apps auch, der Zugriff auf Betriebssystem"}, {"id": 942, "start": 7234.32, "end": 7239.32, "text": "Funktion, die es halt einfach nicht gibt. Dazu kommt, dass Apple halt Apple ist und"}, {"id": 943, "start": 7239.32, "end": 7245.32, "text": "der Meinung ist, sie wissen vieles besser. Was dann auch dazu führt, dass Apple manchmal"}, {"id": 944, "start": 7245.32, "end": 7251.32, "text": "andere Dinge macht wie die restliche Welt. Zum Beispiel haben sie mit Safari mittlerweile"}, {"id": 945, "start": 7251.32, "end": 7257.32, "text": "finde ich hoffnungslos den Anschluss verloren an moderne Webgeschichten. Der PWA Support"}, {"id": 946, "start": 7257.32, "end": 7268.32, "text": "von Safari ist der Witz, da funktioniert fast nichts. Dann haben sie auch noch merkwürdige"}, {"id": 947, "start": 7268.32, "end": 7281.32, "text": "Vorgaben. Ich weiß nicht, ob ihr das wisst, deswegen sage ich es jetzt mal. Wenn ihr unter"}, {"id": 948, "start": 7281.32, "end": 7288.32, "text": "iOS Chrome verwendet, Firefox verwendet oder Safari verwendet, macht gar keinen Unterschied."}, {"id": 949, "start": 7288.32, "end": 7296.32, "text": "Zumindest nicht, was die Webinhalte angeht, weil es ist alles Safari. Unter iOS ist alles"}, {"id": 950, "start": 7296.32, "end": 7303.32, "text": "Safari, auch wenn Chrome dran steht oder Firefox. Apple erlaubt keine andere Browser Engine"}, {"id": 951, "start": 7303.32, "end": 7311.32, "text": "auf iOS als Safari. Das einzige, was die Hersteller machen können ist, sie können halt Safari"}, {"id": 952, "start": 7311.32, "end": 7321.32, "text": "nehmen und da drum ein paar Buttons bauen, dass es so aussieht wie Chrome. Aber unter"}, {"id": 953, "start": 7321.32, "end": 7336.32, "text": "iOS ist jeder Browser Safari. Mal ganz davon abgesehen, eventuell haben es vielleicht ein"}, {"id": 954, "start": 7336.32, "end": 7343.32, "text": "paar weniger bekannte Apps geschafft, ein paar nicht Safari Browser in den App Store"}, {"id": 955, "start": 7343.32, "end": 7351.32, "text": "zu schmuggeln, keine Ahnung. Aber die normalen Browser und die Apps, die Apple ordentlich"}, {"id": 956, "start": 7351.32, "end": 7357.32, "text": "reviewt hat, sind Safari. Und ja, deswegen ist Chrome auch so scheiße auf dem iPad."}, {"id": 957, "start": 7357.32, "end": 7365.32, "text": "Auch Tor. Alles, was Browser ist. Alles, was Browser ist. Ich weiß nicht, wie der Tor"}, {"id": 958, "start": 7365.32, "end": 7380.32, "text": "Browser das macht, ehrlich gesagt. Ja, aber Apple erlaubt das nicht. Du kannst nur Safari"}, {"id": 959, "start": 7380.32, "end": 7389.32, "text": "verwenden. Und das Problem dabei ist, dass der echte Apple Safari, also sprich das Ding,"}, {"id": 960, "start": 7389.32, "end": 7396.32, "text": "was ihr als Safari anklickt, dass das mehr darf als die anderen Sachen. Also wenn ihr"}, {"id": 961, "start": 7396.32, "end": 7405.32, "text": "zum Beispiel irgendwelche Echtzeit WebRTC Geschichten machen wollt oder so, die funktionieren"}, {"id": 962, "start": 7405.32, "end": 7413.32, "text": "manchmal nur richtig im Safari, im richtig echten Safari. Und nicht, wenn ihr das auf"}, {"id": 963, "start": 7413.32, "end": 7419.32, "text": "ein Homescreen hinzufügt, wo das dann quasi als Safari WebView gestartet wird. Deswegen"}, {"id": 964, "start": 7419.32, "end": 7424.32, "text": "sag ich auch, die haben, was moderne Web Sachen angeht, ziemlich den Anschluss verloren. Also"}, {"id": 965, "start": 7424.32, "end": 7431.32, "text": "Chrome und auch Firefox, wobei Firefox ja eh ein bisschen reingeschissen hat seit ein paar"}, {"id": 966, "start": 7431.32, "end": 7438.32, "text": "Versionen, aber auch Firefox, wenn es darum geht moderne Web Sachen zu unterstützen, sind"}, {"id": 967, "start": 7438.32, "end": 7445.32, "text": "die meilenweit, also wirklich halbe Erdumrundung vor Apple. Die unterstützen teilweise, die"}, {"id": 968, "start": 7445.32, "end": 7451.32, "text": "fangen teilweise an, in Safari Dinge zu unterstützen, die die kein Chrome schon drei Jahre. Und"}, {"id": 969, "start": 7451.32, "end": 7456.32, "text": "dann machen sie beispielsweise so Sachen wie Homescreen Launcher für Web Apps, machen"}, {"id": 970, "start": 7456.32, "end": 7461.32, "text": "sie ganz anders als die restliche Welt und sowas. Also was Web Sachen angeht, ist Apple"}, {"id": 971, "start": 7461.32, "end": 7473.32, "text": "halt eklig. Ich vermute aber auch, dass es nicht Unfähigkeit von Apple, sondern, genau"}, {"id": 972, "start": 7473.32, "end": 7477.32, "text": "das was Prometheus übrigens gerade schreibt, das wollte ich gerade sagen, ich glaube nicht,"}, {"id": 973, "start": 7477.32, "end": 7481.32, "text": "dass es Unfähigkeit ist von Apple, ich glaube da ist auch ein bisschen Taktik dabei, weil"}, {"id": 974, "start": 7481.32, "end": 7487.32, "text": "überlegt euch mal, wenn du eine PWA machen kannst, also quasi PWA ist eine App, ist eine"}, {"id": 975, "start": 7487.32, "end": 7492.32, "text": "Appseite, die man zu seinem Startbildschirm auf dem Handy hinzufügen kann und die mehr"}, {"id": 976, "start": 7492.32, "end": 7501.32, "text": "oder weniger funktioniert wie eine Store App. So und nachdem PWA mittlerweile sogar Pop-ups"}, {"id": 977, "start": 7501.32, "end": 7508.32, "text": "können, also Dings Notifications, Notify Pop-ups können, ich glaube ohne Android teilweise"}, {"id": 978, "start": 7508.32, "end": 7516.32, "text": "sogar Zugriff auf Telefoniefunktionen, glaube ich, gehen und wenn Apple das unterstützt,"}, {"id": 979, "start": 7516.32, "end": 7523.32, "text": "ist es halt schiss, dass die Leute sagen, ok, warum sollen wir diese Sache als App Store"}, {"id": 980, "start": 7523.32, "end": 7529.32, "text": "bringen, als App Store App bringen, wenn wir sie auch als PWA verteilen können und dann"}, {"id": 981, "start": 7529.32, "end": 7534.32, "text": "keine 30% Gewinn an Apple abgeben müssen. Also ich denke mal, dass Apple auch ein bisschen"}, {"id": 982, "start": 7534.32, "end": 7539.32, "text": "Taktisch da unterwegs ist, aber es ist nicht der Zutritt nervig, dass Apple so weit hinten"}, {"id": 983, "start": 7539.32, "end": 7548.32, "text": "dran ist, was Support für moderne Web-Sachen angeht. Ja ok, ich mache jetzt nochmal schnell"}, {"id": 984, "start": 7548.32, "end": 7551.32, "text": "noch ein paar Sachen, die ich mir aufgeschrieben habe, die ich auch praktisch finde, dann ist"}, {"id": 985, "start": 7551.32, "end": 7562.32, "text": "auch gleich 22 Uhr, gehe ich auch demnächst mal ins Bett. Genau, also eine Sache, wo ich"}, {"id": 986, "start": 7562.32, "end": 7566.32, "text": "auch nie gedacht hätte, dass man sowas braucht, aber seitdem ich es habe, extrem praktisch,"}, {"id": 987, "start": 7566.32, "end": 7574.32, "text": "ist es ein Mess-Schieber. Sowas da, hier. Ich würde vielleicht nicht den allerbilligsten"}, {"id": 988, "start": 7574.32, "end": 7584.32, "text": "China-Crab nehmen, da weiß ich nicht, wie genau er ist. Äh, Tom, keine Ahnung, warum"}, {"id": 989, "start": 7584.32, "end": 7593.32, "text": "nicht, ja. Ich glaube, die meisten Firmen haben Apple-Firmengeräte, weil eben die Entscheidungsträger"}, {"id": 990, "start": 7593.32, "end": 7600.32, "text": "in der Regel eher Apple als Android verwenden. Ja, aber spätestens seit ich einen 3D-Drucker"}, {"id": 991, "start": 7600.32, "end": 7608.32, "text": "habe, muss ich sagen, enorm praktisches Ding, weil da muss man ab und zu mal was ausmessen."}, {"id": 992, "start": 7608.32, "end": 7616.32, "text": "Zum Beispiel, ich habe so einen Minisieb gedruckt für die Regenrinne und da muss ich die Regenrinne"}, {"id": 993, "start": 7616.32, "end": 7625.32, "text": "nehmen. Und da ist sowas natürlich nützlich. So, und es ist eigentlich fast egal, was ihr"}, {"id": 994, "start": 7625.32, "end": 7632.32, "text": "da kauft, vielleicht nicht der allerbilligste, ist aber auf jeden Fall auch ein super Geschenk"}, {"id": 995, "start": 7632.32, "end": 7639.32, "text": "für Technik-Technik-Interessierte. Welche 3D-Software hast du? Ich habe dieses Auto-Cut, wie"}, {"id": 996, "start": 7639.32, "end": 7646.32, "text": "hieß das dann, dieses webbasierte Auto-Cut Lite da verwendet, ich weiß gar nicht, wie"}, {"id": 997, "start": 7646.32, "end": 7655.32, "text": "das heißt. Das heißt Auto-Cut Lite, das heißt, wie ist das denn, webbased, das war von Auto-Cut,"}, {"id": 998, "start": 7655.32, "end": 7664.32, "text": "klaut das? Das war es, nix, kost. Das hieß aber nicht Auto-Cut, das war von Auto-Cut,"}, {"id": 999, "start": 7664.32, "end": 7671.32, "text": "das hieß aber nicht Auto-Cut. Ich weiß nicht. Ich würde es dir sagen, was Tinker-Cut, nie."}, {"id": 1000, "start": 7671.32, "end": 7675.32, "text": "Es war irgendwas im Browser, es war was von Auto-Cut, es hieß nicht Auto-Cut, es war"}, {"id": 1001, "start": 7675.32, "end": 7679.32, "text": "eindeutig für so Noobs gemacht wie mich. Du konntest da glaube ich nur Kugeln, Würfeln,"}, {"id": 1002, "start": 7679.32, "end": 7684.32, "text": "Dreiecke und Gedöns hinzufügen, musstest dann zurecht schneiden. Fusion, ja, ja, ja,"}, {"id": 1003, "start": 7684.32, "end": 7690.32, "text": "ja, genau das da. Siehst du mal, der Chat, der Chat ist wieder Big Brain. Der Chat ist"}, {"id": 1004, "start": 7690.32, "end": 7694.32, "text": "wieder Big Brain. Sowas hier war das, glaube ich. Ja, ich glaube das war das. Das kommt"}, {"id": 1005, "start": 7694.32, "end": 7699.32, "text": "mir bekannt vor. Haben die ihr Logo geändert? Haben die, haben die ihr Logo geändert?"}, {"id": 1006, "start": 7699.32, "end": 7724.32, "text": "Die Logo geändert? Das Logo habe ich anders in Erinnerung. Oder war es doch was anderes?"}, {"id": 1007, "start": 7724.32, "end": 7729.32, "text": "Ich weiß es nicht mehr. Das habe ich gemacht, keine Ahnung, zwei, drei Monate nachdem ich"}, {"id": 1008, "start": 7729.32, "end": 7735.32, "text": "den 3D-Drucker gekauft habe, ist es auch schon wieder ein bisschen her. Nee, dann war es"}, {"id": 1009, "start": 7735.32, "end": 7739.32, "text": "nicht Fusion, dann war es nicht Fusion. Ich glaube Fusion habe ich mir damals angeguckt"}, {"id": 1010, "start": 7739.32, "end": 7744.32, "text": "und habe festgestellt, ich bin zu dumm für. Ich glaube das war es. Ich habe irgendwas"}, {"id": 1011, "start": 7744.32, "end": 7748.32, "text": "ganz Simples verwendet. Da konntest du nur irgendwie Kugeln, Dreiecke und Vier-Ecke"}, {"id": 1012, "start": 7748.32, "end": 7754.32, "text": "rein machen und die schneiden. Mehr konntest du nicht. Hast du eigentlich schon mal was"}, {"id": 1013, "start": 7754.32, "end": 7761.32, "text": "mit Point Cloud Geschichten gemacht? Was ist Point Cloud? War das, was, Tinker Cat?"}, {"id": 1014, "start": 7761.32, "end": 7770.32, "text": "Ah nee, Tinker Cat. War das das? Ich muss mir das Bild angucken. Ja, das könnte es,"}, {"id": 1015, "start": 7770.32, "end": 7782.32, "text": "nee. Das mit dem Würfel kommt mir schon mal bekannt vor. Zumindest habe ich richtig"}, {"id": 1016, "start": 7782.32, "end": 7787.32, "text": "verkackt. Ich musste das fünfmal drucken oder so, bis es gepasst hat. Richtig"}, {"id": 1017, "start": 7787.32, "end": 7796.32, "text": "verschissen. Zumindest ich habe, wir waren aber gerade beim Messschieber. Da war ich"}, {"id": 1018, "start": 7796.32, "end": 7799.32, "text": "froh, dass ich sowas zum Ausmessen hatte. Und wie gesagt, ich würde nicht gerade den"}, {"id": 1019, "start": 7799.32, "end": 7805.32, "text": "allerbilligsten kaufen hier. Sowas kann man schon kaufen und man weiß es eigentlich"}, {"id": 1020, "start": 7805.32, "end": 7811.32, "text": "gar nicht, wie sehr man sowas gerne hätte. Vor allem wenn man öfters mal Sachen"}, {"id": 1021, "start": 7811.32, "end": 7819.32, "text": "selbst ausdrückt oder abschneiden muss oder sowas. Auch enorm praktisches Ding."}, {"id": 1022, "start": 7819.32, "end": 7829.32, "text": "Was illegal, nee, nicht illegal ist. Was kann ich denn aussprechen? Regenbogen Einhornpony."}, {"id": 1023, "start": 7829.32, "end": 7839.32, "text": "Ach Lila, ich bin schon zu low brain. Ich bin zu spät. Das Lila Regenbogen Einhornpony"}, {"id": 1024, "start": 7839.32, "end": 7851.32, "text": "hat mir Prime subscribt. Massive Subscription. Dankeschön. So. Nice. Genau. Der ist auch"}, {"id": 1025, "start": 7851.32, "end": 7857.32, "text": "sehr praktisch. Egal welcher. Gerade für Buster toll. Und auch in diesem Bereich hier,"}, {"id": 1026, "start": 7857.32, "end": 7861.32, "text": "wenn man sich hier guckt, irgendwas von neun bis zwanzig Euro. Ist auch wunderbar für"}, {"id": 1027, "start": 7861.32, "end": 7866.32, "text": "Weihnachtsgeschenk. Kann man eigentlich nichts großartig falsch machen. So. Und dann"}, {"id": 1028, "start": 7866.32, "end": 7873.32, "text": "noch eine Sache. Ich hab zwar noch ein paar Sachen mehr, aber wir belassen sie auch bald"}, {"id": 1029, "start": 7873.32, "end": 7877.32, "text": "bei. Aber eine Sache muss jetzt nochmal los werden. Hat jetzt nichts mit Informatiker"}, {"id": 1030, "start": 7877.32, "end": 7887.32, "text": "und Bastler zu tun. Must have. Die originale australische hot and spicy Barbecue Soße."}, {"id": 1031, "start": 7887.32, "end": 7901.32, "text": "Kokona Style. Genau die hier. Die braucht man. Die ist Massive Pock. Ist ein bisschen"}, {"id": 1032, "start": 7901.32, "end": 7908.32, "text": "scharf. Ist auch hot and spicy. Aber meiner Ansicht nach die beste Barbecue Soße für"}, {"id": 1033, "start": 7908.32, "end": 7912.32, "text": "so gegrilltes Zeug, was man so zu Hause macht, wo man jetzt nicht irgendwelche super abgedrehten"}, {"id": 1034, "start": 7912.32, "end": 7918.32, "text": "Whiskey Barbecue Special Soße haben will, wo man einfach nur wirklich gute, bisschen"}, {"id": 1035, "start": 7918.32, "end": 7927.32, "text": "scharfe Barbecue Soße haben will. Das da. Poggers. Die Barbecue Pit Boys. Oder irgendwie"}, {"id": 1036, "start": 7927.32, "end": 7935.32, "text": "sowas. Oh yes. Das würden die Barbecue Pit Boys sagen. Zwölf Unzen ist es, wiegt es"}, {"id": 1037, "start": 7935.32, "end": 7950.32, "text": "übrigens? Das sind Freedom Units wieder. Zwölf Unzen. Ok, zwölf Unzen zu Gramm. 340"}, {"id": 1038, "start": 7950.32, "end": 7962.32, "text": "Gramm. Das war zu kompliziert. Das müssen zwölf Unzen sein. Ja, die muss, die muss."}, {"id": 1039, "start": 7962.32, "end": 7967.32, "text": "Auch super Geschenk. Beste Barbecue Soße. Beste so nur nach 15 Barbecue Soße, die man"}, {"id": 1040, "start": 7967.32, "end": 7972.32, "text": "für alles verwenden kann, die es gibt. Meiner Ansicht nach natürlich. Und mit 10 Euro kann"}, {"id": 1041, "start": 7972.32, "end": 7984.32, "text": "man da nichts falsch machen. Beste. Top Weihnachtsgeschenk. Exzellent. Enthält Senf."}, {"id": 1042, "start": 7984.32, "end": 7990.32, "text": "Weiß nicht was es enthält. Ist mir auch wurscht. Schmeckt gut. Link. Da. Sucht danach auf Amazon."}, {"id": 1043, "start": 7990.32, "end": 7995.32, "text": "Ich habe noch keine Reflinks. Reflinks gibt es erst morgen, wenn ich das Video zugemacht"}, {"id": 1044, "start": 7995.32, "end": 8006.32, "text": "habe. So und ich hätte noch eine Sache hätte ich noch. Eine Sache hätte ich noch und zwar."}, {"id": 1045, "start": 8006.32, "end": 8013.32, "text": "Wenn man in einer Umgebung ist, die ein bisschen Krach macht und man trotzdem ordentlich schlafen"}, {"id": 1046, "start": 8013.32, "end": 8017.32, "text": "will oder weil man Haustiere hat, die einem manchmal auf den Sack gehen und man will"}, {"id": 1047, "start": 8017.32, "end": 8030.32, "text": "einfach seine Ruhe haben. Ohrstöpsel, aber nicht irgendwelche Ohrstöpsel, sondern Alpine"}, {"id": 1048, "start": 8030.32, "end": 8036.32, "text": "Sleepsoft Ohrstöpsel. Ist mit Sicherheit vom Preis ja auch ein gutes Weihnachtsgeschenk"}, {"id": 1049, "start": 8036.32, "end": 8042.32, "text": "und zwar. Die sind besonders elastisch und man kann damit auf der Seite liegen und merkt"}, {"id": 1050, "start": 8042.32, "end": 8048.32, "text": "nicht, dass sie im Ohr sind oder kaum, dass sie im Ohr sind. Bricht macht man ins Ohr,"}, {"id": 1051, "start": 8048.32, "end": 8054.32, "text": "legt sich ganz normal hin auf die Seite, aufs Kopfkissen und man hat keinen Drücken im Ohr."}, {"id": 1052, "start": 8054.32, "end": 8059.32, "text": "Das ist übrigens auch super Weihnachtsgeschenk für eure Mutter oder Oma, Opa, Vater, sonst"}, {"id": 1053, "start": 8059.32, "end": 8067.32, "text": "was. Ganz top. Kannst du eigentlich jedem schenken, der in irgendeiner Umgebung wohnt,"}, {"id": 1054, "start": 8067.32, "end": 8072.32, "text": "wo es nachts nicht so ruhig ist. Ich hab die am Start und manchmal geht mir meine Katz"}, {"id": 1055, "start": 8072.32, "end": 8077.32, "text": "nachts auf den Keks. Meistens geh ich dann mal aufs Klo, wenn die an der Tür ist und"}, {"id": 1056, "start": 8077.32, "end": 8081.32, "text": "nervt, aber wenn die das dritte Mal nachts an der Tür nervt, dann zieh ich mir einfach"}, {"id": 1057, "start": 8081.32, "end": 8091.32, "text": "das Ding ins Ohr, mach zack und dann hör ich nix mehr. Und dann ist Ruhe. Beste. Also"}, {"id": 1058, "start": 8091.32, "end": 8101.32, "text": "auch Universalgeschenk geht für alles. Die Katze ist free, ich bin nicht free, ich bin"}, {"id": 1059, "start": 8101.32, "end": 8106.32, "text": "im Zimmer. Die Katze ist quasi überall und ich bin bei mir im Schlafzimmer, aber ich"}, {"id": 1060, "start": 8106.32, "end": 8110.32, "text": "lass die Katze nachts in den Schlafzimmer rein, weil die Katze mir dann nachts auf den"}, {"id": 1061, "start": 8110.32, "end": 8114.32, "text": "Keks geht, die läuft dann auf mir rum und macht Dinger und sonst wie und ich will pennen"}, {"id": 1062, "start": 8114.32, "end": 8120.32, "text": "in Ruhe. Morgens lass ich die manchmal rein. Wecker, ich brauch keinen Wecker. Ich werd"}, {"id": 1063, "start": 8120.32, "end": 8130.32, "text": "nicht vom Wecker wach. Ich brauch keinen Wecker. Ich werd ohne Wecker wach. Ich bin"}, {"id": 1064, "start": 8130.32, "end": 8133.32, "text": "glaub ich die Letzten und das ist jetzt nicht übertrieben. Die letzten 10 Jahre bin ich"}, {"id": 1065, "start": 8133.32, "end": 8140.32, "text": "vielleicht, ich will jetzt nicht untertreiben, aber auch nicht so sehr übertreiben. Ich"}, {"id": 1066, "start": 8140.32, "end": 8152.32, "text": "sag mal, letzten 10 Jahre bin ich vielleicht 5 Mal nicht von alleine aufgewacht. Ja, der"}, {"id": 1067, "start": 8152.32, "end": 8159.32, "text": "Gamer Alex, so ist bei mir auch. Ich wach immer auf, bevor der Wecker klingelt. Immer."}, {"id": 1068, "start": 8159.32, "end": 8167.32, "text": "Wie gesagt, vielleicht 5 Mal in den letzten 10 Jahren oder so. Wie lange schläfst du"}, {"id": 1069, "start": 8167.32, "end": 8171.32, "text": "ungefähr immer? Es kommt drauf an. Also wenn ich auf die Arbeit nach Frankfurt hinfahre,"}, {"id": 1070, "start": 8171.32, "end": 8180.32, "text": "dann geh ich meistens so 22, 22, 30 ins Bett. So wie jetzt ungefähr. Ich geh jetzt auch"}, {"id": 1071, "start": 8180.32, "end": 8183.32, "text": "nicht gleich ins Bett. Ich mach jetzt hier Stream aus und guck noch ein bisschen Video"}, {"id": 1072, "start": 8183.32, "end": 8190.32, "text": "und dann geh ich pennen. So und dann geh ich so 22, 22, 30 pennen und dann steh ich 5"}, {"id": 1073, "start": 8190.32, "end": 8201.32, "text": "und 45 auf und zieh mich an, geh zum Zug, fahre zum Südbahnhof in Frankfurt. Vom Südbahnhof"}, {"id": 1074, "start": 8201.32, "end": 8205.32, "text": "laufe ich dann zum Millie-Brandplatz, so ungefähr in die Ecke. Ich will jetzt nicht so genau"}, {"id": 1075, "start": 8205.32, "end": 8212.32, "text": "spoilern, wo wir sind. Das mach ich absichtlich, dass ich morgens mal eine halbe Stunde mich"}, {"id": 1076, "start": 8212.32, "end": 8217.32, "text": "bewegen kann, wenn du den restlichen Tag wieder gar nicht bewegst. Also ich könnte gerne"}, {"id": 1077, "start": 8217.32, "end": 8221.32, "text": "eine halbe Stunde früher auf der Arbeit noch sein oder eine halbe Stunde später wegfahren."}, {"id": 1078, "start": 8221.32, "end": 8227.32, "text": "So und dann bin ich so ungefähr um 7 Uhr auf der Arbeit und dann geh ich 15, 30, geh"}, {"id": 1079, "start": 8227.32, "end": 8233.32, "text": "ich heim. Dann bin ich dann, dann laufe ich wieder zum Südbahnhof zurück. Dann bin"}, {"id": 1080, "start": 8233.32, "end": 8249.32, "text": "ich 16, 30 daheim. Also 5, 45 aufstehen, 16, 30 bin ich wieder daheim. So und jetzt,"}, {"id": 1081, "start": 8249.32, "end": 8255.32, "text": "wo ich Homeoffice hab, ist das natürlich deutlich angenehmer. Da penne ich so ungefähr immer"}, {"id": 1082, "start": 8255.32, "end": 8267.32, "text": "37 und Arbeit ist ungefähr bis 16, 30. Was natürlich enorm poggers ist, dass man sich"}, {"id": 1083, "start": 8267.32, "end": 8271.32, "text": "den Heimweg halt spart und den Hinweg bei Homeoffice. Das ist finde ich eigentlich das"}, {"id": 1084, "start": 8271.32, "end": 8286.32, "text": "Beste an Homeoffice überhaupt. Weil die ganze verschenkte Fahrzeit, also die ganze Fahrzeit"}, {"id": 1085, "start": 8286.32, "end": 8296.32, "text": "ist halt einfach komplett verschenkt, verschenkte Zeit, ne. Die glaube ich jeder gerne sparen"}, {"id": 1086, "start": 8296.32, "end": 8304.32, "text": "würde. Zumal man hätte auch nichts sinnvolles macht. Man sitzt da halt sinnlos rum und regt"}, {"id": 1087, "start": 8304.32, "end": 8310.32, "text": "sich über die Bahn auf, die dann teilweise nicht kommt. Also das nervigste an jedem Arbeitstag"}, {"id": 1088, "start": 8310.32, "end": 8318.32, "text": "ist ehrlich gesagt das Hin und Zurückfahren mit der Bahn. Und es wäre mit dem Auto auch"}, {"id": 1089, "start": 8318.32, "end": 8324.32, "text": "nicht weniger nervig, vor allem mit meinem Auto nicht. Ihr kennt hier mein Massive High"}, {"id": 1090, "start": 8324.32, "end": 8336.32, "text": "End Auto. Wie viele Stunden musst du pro Woche arbeiten? Ich arbeite 30 Stunden glaube"}, {"id": 1091, "start": 8336.32, "end": 8350.32, "text": "ich. Ich glaube 30 Stunden arbeite ich. Ich glaube 30 Stunden, ja. Aber ich arbeite auch"}, {"id": 1092, "start": 8350.32, "end": 8360.32, "text": "nicht jeden Tag. Also ich arbeite nicht die ganze Woche. Was verdienst du so falls du..."}, {"id": 1093, "start": 8360.32, "end": 8364.32, "text": "Also erstens genau kann ich es euch nicht sagen aus zwei Gründen. Wahrscheinlich darf ich"}, {"id": 1094, "start": 8364.32, "end": 8371.32, "text": "nicht und ich weiß es nicht. Aber was ich dir sagen kann ist oder was wir uns hier im Stream"}, {"id": 1095, "start": 8371.32, "end": 8389.32, "text": "Show angeguckt haben, wir sind im Tarifvertrag, in diesem ARK-Tarifvertrag. Wie heißen die?"}, {"id": 1096, "start": 8389.32, "end": 8412.32, "text": "Wie heißen die? Ah. Niemals mit Versicherung. Hier, ARKV Ferz, ja. So. Und ich bin Stufe 6"}, {"id": 1097, "start": 8412.32, "end": 8416.32, "text": "und schon über 12 Jahre dabei. Da kannst du das auch mal selbst ausrechnen. Was da jetzt"}, {"id": 1098, "start": 8416.32, "end": 8420.32, "text": "für Bonus noch oben drauf kommt, kann ich dir nicht sagen. Erstens weiß ich und zweitens"}, {"id": 1099, "start": 8420.32, "end": 8426.32, "text": "weiß ich nicht ob ich es sagen darf. Aber das was da drin steht ist schon mal zumindest"}, {"id": 1100, "start": 8426.32, "end": 8438.32, "text": "das Mindeste. Und das Ganze gibt es dann 14 Mal, weil 14 Monatsgehälter. Ja. Da kannst"}, {"id": 1101, "start": 8438.32, "end": 8443.32, "text": "du dir zumindest das untere Ende, kannst du dir daraus zusammenreimen. Nimmst das was"}, {"id": 1102, "start": 8443.32, "end": 8452.32, "text": "da drin steht, für ich glaube Stufe 6 ist es. Für die höchsten Jahre und das mal 14"}, {"id": 1103, "start": 8452.32, "end": 8462.32, "text": "dann hast du die untere Grenze. Plus Twitch-Money. Ja ich verdiene glücklicherweise noch ein"}, {"id": 1104, "start": 8462.32, "end": 8468.32, "text": "bisschen aus anderen Quellen. Übrigens das Finanzamt hat, ich hatte meinen Steuerberater"}, {"id": 1105, "start": 8468.32, "end": 8474.32, "text": "heute Morgen, hat er eine E-Mail geschrieben, das Finanzamt möchte von ihm Unterlagen von"}, {"id": 1106, "start": 8474.32, "end": 8480.32, "text": "2015 bis 2016. Bin ich froh, dass ich einen Steuerberater habe? Weil ganz im Ernst, ich"}, {"id": 1107, "start": 8480.32, "end": 8489.32, "text": "würde doch im Leben keine Unterlagen von 2015, 2016 mehr finden. Zum Glück, zum Glück"}, {"id": 1108, "start": 8489.32, "end": 8499.32, "text": "geht das alles mit Steuerberater. Ich habe den Versuch zu erreichen, aber da war heute"}, {"id": 1109, "start": 8499.32, "end": 8502.32, "text": "ein ganz Tag irgendwie unterwegs, muss den morgen nochmal anrufen, was das jetzt, was"}, {"id": 1110, "start": 8502.32, "end": 8510.32, "text": "die jetzt eigentlich genau rollen. Ich denke das ist irgendwelche routinemäßigen Sachen"}, {"id": 1111, "start": 8510.32, "end": 8524.32, "text": "zum nachgucken. Das soll mein Steuerberater mal machen, dafür kriegt er ja Geld. Ja das"}, {"id": 1112, "start": 8524.32, "end": 8535.32, "text": "stimmt, YouTube-Money ist jetzt ja quasi nicht existent aktuell. Ich weiß nicht was die"}, {"id": 1113, "start": 8535.32, "end": 8544.32, "text": "machen wollen. Es ist ja so, dass das Finanzamt gar nicht alle Sachen bekommt vom Steuerberater,"}, {"id": 1114, "start": 8544.32, "end": 8548.32, "text": "sondern nur so eine Übersicht glaube ich und wenn die das dann im Detail haben wollen,"}, {"id": 1115, "start": 8548.32, "end": 8553.32, "text": "kann er das denen irgendwie geben. Ich weiß nicht wie das genau funktioniert, ist mir"}, {"id": 1116, "start": 8553.32, "end": 8558.32, "text": "auch wurscht, ich muss mich damit nicht beschäftigen, dafür kriegt mein Steuerberater Geld, dass"}, {"id": 1117, "start": 8558.32, "end": 8569.32, "text": "er sich damit beschäftigt. Wieso ist sein Stream so gelb in der Tasklist? Das kann ich"}, {"id": 1118, "start": 8569.32, "end": 8579.32, "text": "dir nicht sagen. Ach so, weil es Updates hat wahrscheinlich. SCBA 42, 12 Monate, Dankeschön"}, {"id": 1119, "start": 8579.32, "end": 8592.32, "text": "für 12 Monate. Huge Hypersubscription hier. Ganzes Jahr schon hier am Start, nice. Richtig"}, {"id": 1120, "start": 8592.32, "end": 8601.32, "text": "Coggers, ja. Also Leute, ich hoffe es war was dabei für euch bei meinen Weihnachtsvorschlägen,"}, {"id": 1121, "start": 8601.32, "end": 8609.32, "text": "morgen mache ich dazu noch ein Video. Jetzt so die gute Zeit ein bisschen Weihnachts Clickbait"}, {"id": 1122, "start": 8609.32, "end": 8615.32, "text": "zu betreiben. Haben wir irgendeinen, den wir hosten können, zeige ich mal her. Ich hauste"}, {"id": 1123, "start": 8615.32, "end": 8626.32, "text": "ja sonst nie welche, weil kaum jemand online ist. Der Krieger ist on mit Among Us, das gucke"}, {"id": 1124, "start": 8626.32, "end": 8636.32, "text": "ich aber eh nicht. So, der Solution war vorhin on, aber der ist jetzt wieder off. The Lost"}, {"id": 1125, "start": 8636.32, "end": 8654.32, "text": "ist auch nicht da, wen haben wir da von den Deutschen hier noch? Nö, keiner da. Was,"}, {"id": 1126, "start": 8654.32, "end": 8670.32, "text": "Alter, vier Games ist on? Echt? Ey, ist er gar nicht, jebaitet mich hier. Knossi, genau,"}, {"id": 1127, "start": 8670.32, "end": 8686.32, "text": "wir hosten Knossi, der braucht es natürlich auch unbedingt. Nee, ist keiner da. Also Leute,"}, {"id": 1128, "start": 8686.32, "end": 8694.32, "text": "sehen wir uns wahrscheinlich, ich weiß nicht ob ich es morgen hinkriege, zu Streamsorn."}, {"id": 1129, "start": 8694.32, "end": 8702.32, "text": "Also wir sehen uns dann, machts gut, bis denn, see you."}]}