{"text": "Genau. So, auf geht's! OBS updaten? Warum? Warum? Warum? Genau, alles gut. Wenn ich das updaten, funktioniert wahrscheinlich wieder das Auferlein nicht richtig oder sonst was. Gibt schon V26, ja mir doch egal. Wer interessiert's? Der Kram funzt. Äh, irgendwie hat Twitch nicht gecheckt, dass der Stream on ist, kann das sein? Angeblich sagt Twitch Null Zuschauer. Twitch gerade kaputt oder so? Oder braucht Twitch für die Notifications einfach ne Weile? Warten wir's mal ab, bis Twitch das ganze kapiert gecheckt hat. Null Zuschauer, ja sagt Twitch, oh jetzt sind's 10, jetzt sind's 10. Mal gucken, ich warte, ich warte noch 15, 15, es geht aufwärts, Stonks, Stonkstime Leute. Nö, da tut sich bei mir immer noch nix, Twitch braucht ein bisschen, ja das ist nicht so schnell. Oh nee, die Yoshi-Musik ist mir auch zu anstrengend, das halt ich nicht, das halt ich nicht durch. Turbo 3400, Twitch Prime, Massive IQ für den Chat wieder, Big Brain Subs, ein bisschen Mario Kart Musik, jawoll, exellent, wunderbar, aber Twitch hat's immer noch nicht gecheckt, also wirklich, dass der Stream on ist oder, bei mir ist es jetzt 30 Zuschauer, ich mein es steigt langsam, jetzt geht's wieder rund, Twitch weiß nicht so genau was los ist gerade glaube ich. Aber die Discord Notification Leute sind schon wieder am Start oder, wie habt ihr's gefunden? Discord Notification, 42, okay es geht aufwärts Leute, es geht aufwärts. Stonkstime Discord, ja dachte ich mir, siehste, nur Discord Notification, Rest ist nicht verschickt. Grad kam Twitch, ja wie gesagt, Twitch ist heute lahm im Notification verschicken, bald haben wir 69 Zuschauer, so, also, es müssen relativ viele Twitch Notifications oder sowas an haben, weil normalerweise merke ich das, wenn ich anschalte, ich hab mittlerweile gefühlt 100 Zuschauer nach 3 Minuten, also es geht immer übelst los instant, ja, ich merk das sofort, wenn da irgendwie was delayed ist, ja, so, also Leute, der weltweit fortschrittlichste Adblocker, so, so ist fast so, weiß ich nicht, probier mal heute mal aus, soll ich euch mal sagen, big brain time heute gehabt, was hast du vor, wir gucken uns heute mal P-Hole, Pi-Hole, wie auch immer man das genau aussprache, nicht Pi-Hole, okay, ich weiß, wie man das ausspricht. So, also, mal gucken, ich bin auch mal gespannt, wie gut das die vor, genau, ich bin mal gespannt, wie einfach die das einem machen, da was ordentliches auszuwählen, ich hab den ganzen Kram vor 2, 3 Jahren, ich hab das jetzt mal eine Weile verwendet, aber irgendwie hat es mir da nicht mehr so wirklich zugesagt, zumal ich eh in meinem Browser immer einen Adblocker drin hab und IOS Apps kannst du damit eh nix großartig blocken, zumindest auf die wo es ankommt, ja, ne, der Kommentator 16 Monate, Hyper Subscription, excellent, excellent, Leute, oh, oh, das wollte ich gar nicht drücken, Tainser, 21 Monate, so viel IQ für den Chatterplatz, der fasst der Kopf, komm, ein Sub geht noch, 94% Scam Train, einer muss sich noch scammen lassen, ihr habt 4 Minuten Zeit um euch scammen zu lassen von Twitch, warum kann man damit nichts in IOS Apps blocken, weil die meisten Apps, so wie Twitch und YouTube, mittlerweile relativ clever sind und den Content und die Ads vom gleichen Server ausliefern, das heißt du kannst nicht mehr unterscheiden zwischen Content den du sehen willst und Werbung, deswegen ist es auch für Werbeblocker mittlerweile, die im Browser integriert sind und quasi sogar noch sehen können was auf der Seite passiert, auch unglaublich schwer den Kram noch ordentlich zu blocken, nice, Lego 7 Monate, excellent, Subscription, huge, da Muscle 1, 2, 3, danke für die Subs hier, so, deswegen funktioniert das nicht so richtig, auf Android hast du beispielsweise so eine gemoderte YouTube App, also auf Android hast du sowas, die blocken die Werbung auf YouTube, weil es eine modifizierte App ist, du selbst kannst da relativ wenig dran machen bei YouTube und Twitch, wo es was bringt ist, wenn du z.B. im Safari surfst oder wenn du irgendwelche random App Notifications in Apps hast oder so, ja da kann das was bringen, aber für die Dinger wo man das eigentlich zum größten Teil bräuchte ist es schwierig bis nicht mehr möglich, ja, ja und das Problem was ist auf iOS, wie gesagt hier hast du zum Beispiel für Android hast du zum Beispiel eine gemoderte YouTube App, die Werbung filtert, die haben dann quasi so eine Art Adblocker drinnen beziehungsweise Sachen die das remove, ist ok, funktioniert gut, Problem ist unter iOS kannst du das nicht machen, unter iOS kriegst du Sachen prinzipiell nur aus dem Apple Store, gar keine Chance was anderes zu installieren, außer du moddest das ganze Ding, was auch immer schwieriger und immer weniger praktikabel wird und ansonsten sorgen die halt dafür, dadurch dass es nur die offizielle App gibt aus dem offiziellen Store, du hast gelitten, du kannst dagegen auch nichts machen mit irgendeinem Proxy dazwischen oder so, weil das eh alles komplett verschlüsselt ist, also du kannst da auch jetzt wenn du sagst, hey ich geh jetzt über ein Proxy der irgendwie was rausfiltert, geht auch nicht, also die sind da schon relativ clever mittlerweile, bei YouTube, also du hast da eigentlich keine Chance groß was zu blocken auf iOS, auf iOS kauft ihr YouTube Premium, ja ich wollte mir ja mein Indian YouTube Premium kaufen für 2 Euro oder so, tatsächlich ja, hatte ich echt vor, barfiver, vielleicht gibt es da YouTube Prime barfiver, ich wollte jetzt für irgendwas noch was sagen, warte mal, das habe ich gerade schon beantwortet mit den iOS Apps, der Kommentator 16 Monate, ich weiß nicht ob ich es gesehen habe, da habe ich schon für den Satz, exzellent, ich habe keine Ahnung ob die unterschiedliche Sachen machen, guck mir das jetzt zum ersten Mal an, Edgard hatte ich noch nie installiert, Piehorn hatte ich mal vor 2 oder 3 Jahren, irgendwie finde ich das nicht, irgendwas wollte ich noch gerade beantworten, na gut also, achso Insomniac Dude fragt hier, wenn ich nur eine Lienungs-VM auf Windows haben will, brauche ich den Vmware Player oder, ja nicht zwangsläufig, es gibt ein paar Varianten, ich meine du kannst den Vmware Player nehmen, den kennst du ja schon, der ist glaube ich komplett kostenlos, dann kannst du den Vmware Player Plus nehmen, der kostet ein bisschen was, du kannst aber auch Vmware Workstation nehmen und ganz ehrlich, ich würde dir empfehlen Vmware Workstation zu nehmen, dadurch dass du damit auch Snapshots und, was war denn der Unterschied, muss ich mal kurz gucken, also es hat schon seinen Sinn, Pembu, haben die da nicht einfach eine, warum hat Vmware nicht einfach einen Vergleich dazwischen, gibt es da irgendeinen Unterschied dazwischen, also ich glaube Snapshots, was zum, was ist das für eine Kackseide, das Ding suche ich, warum ist die Seite schwarz, ich will keine Message liefen, geh mal nicht auf den Sack, zeig mir die Seite, so, Snapshots, ich glaube du kannst keine Snapshots machen mit Vmware oder, Snapshots, genau, Snapshots ist eins der geilsten Sachen, wenn du Vms verwendest, also ich würde dir empfehlen, kauf dir Vmware Workstation, also ich hab mir zum Beispiel den Key hier gekauft, ich mach mal kurz meine Vm an, ich hab mir den Key hier gekauft beim Software Kong, weiß nicht ob es die noch gibt und ob die mittlerweile nicht, oh was ist jetzt los, das ist schlecht Leute, Vm ist kaputt, e ist, warum, Volum, da ist es doch, Vms, oh, Hetzler, ich hab noch nicht Mails geguckt, kennst du Tails, ne, nein, du kannst das Netzwerk Paket nicht filtern, das ist alles verschlüsselt, was ich von diesem Video halte, kann ich nachher gucken, Leute ich hab ein Problem, ich muss jetzt erstmal kurz den, nein, nein, nein, nein, Take ownership bringt nichts, das hab ich schon öfters gehabt, das Problem, was soll überhaupt mit Hetzler los, ne, warum, was soll los gewesen sein, guck mal, ne, das ist kaputt, das ist ein Bug, den hab ich schon ein paarmal gehabt, wenn du das anklickst, dann mag der nicht, Take ownership geht auch nicht, das ist irgendwie abgekackt, so, wie krieg ich denn das jetzt gefixt, ohne dass ich mein PC neu starten muss, vor allem ja, kann ich das hier neu starten, vor allem Workstation Server, jawoll, also das muss ich als Admin machen, service, Admin, excellent, highly secret password, Forever Workstation Server, restart, ne, ne, ne, Hyper V bringt dir nichts in dem Fall, nicht wenn du das so benutzen willst, wie ich das hier, wie ich das verwende, mit easy hin und her switchen und resize und Geräte vorwarten und sonst was, Hyper V kann das zwar alles irgendwie auch ein bisschen, aber bei weitem nicht so komfortabel, wie das mit Forever Workstation funktioniert, Virtual Box kannst du auch nehmen, geht das jetzt, Postchamp, alter was ist das für ein kack ok, wir googeln mal danach, Forever Workstation, Take ownership failed, unable to take ownership of my VMs, also ich kann neu starten, dann gehts, das weiß ich, was, lock directory, ok, ok, Moment, Moment, Postchamp, Postchamp, lock directory, also, das heißt ich gehe jetzt, e, VMs, guck mal da, der Porgas ist gelockt, wenn ich das lösche ist es dann so, ich hoffe ich machs jetzt nicht kaputt, loggers, loggers ist das, operation loggers ist das, hey, jetzt weiß ich auch wie man den Kram fixt, easy, dazu kann ich nur sagen, easy, was hab ich denn hier, hab ich test oder hab ich max, ich kann mir meinen account nicht merken, ich lock mich so selten ein, ich hab das Ding immer als Standby, also gut, jetzt zum eigentlichen Thema zurück, was du machen kannst, wenn du das so verwenden willst, wie ich hier mit Desktop switchen und easy Linux und Builders, Build skalieren und sowas alles schön sag ich, ich würde dir vor allem Workstation empfehlen, du kannst das mit Player auch machen, du kannst das auch mit VirtualBox oder meinetwegen auch mit Hyper-V oder sonst was machen, aber ganz ehrlich mit Workstation ist das am geschmeidigsten und die Möglichkeit Snapshots zu machen ist eines der besten Features überhaupt, Max grüßt, danke schön für vier Monate Subscriptions, HiIQ für den Chat wieder und ich hab mir das gekauft, das ist das was ich zeigen wollte, ich hab mir das hier gekauft, Vagrant ist auch ganz cool hier, aber Vagrant ist quasi nur ein Verskriptungsding für VirtualBox, so ich hab mir das hier gekauft, da kriegste für 22.90 hoch vertrauenswürdige Seite Software Kong, die aber anscheinend nicht geradet wurde von der Polizei oder sowas, was da letztens mit Lizenzen waren, das heißt, die scheinen wohl legit zu sein, da kannst du 22.90 für eine Workstation Pro 16 Lizenz bezahlen, easy, ansonsten bezahlst du glaube ich 160 Euro oder sowas oder 200, ja, Software kaufen 24, ok das klingt auch äußerst vertrauenserweckend, ok 200 Euro, ja also kauft ihr das bei Software Kong, ja dass man Keys irgendwo anders findet ist mir auch bewusst, aber dafür mache ich hier im Stream keine Werbung und kann euch natürlich nur abraten das zu machen, das ist mir sonst zu Hacker-Man hier, genau wie ich das mache, ich hab halt Windows als Host und Windows mit drei Desktops und halt hier auf dem zweiten Desktop immer meine Linux-VM, auch mit 1, 2, 3, 4, 5, 6, 7, 8, 9 theoretisch verschiedenen Desktops, so machen wir den ganzen Shit mal zu, das brauchen wir ja nicht, das ist halt sehr praktisch, geht der Preischamp eigentlich noch, kurz checken, läuft der noch, sieht so aus, alles klar, easy, der Preischamp hat übrigens, weil mich heute einer gefragt hat, ca. 5000 Besucher am Tag, ist gar nicht so schlecht, sind die off, ok, ok Leute, toll, bevor wir anfangen, DHL ist so scheiße, ich hab mein DHL ist scheiße Videojahr gelöscht, so ich mach mal hier auf, ich lad den Kram hier in der VM, wobei, nee, ich lad nicht in der VM runter, warum, die sind so kacke, hier guck mal, aber ich hab jetzt was unternommen dagegen, also ich hab ja, so sieht mein Sendeverfolgungslauf aus, das liegt seit dem 18., ist es einen Tag vorher, ist es vom Flieger aus den USA eingekommen, und seit dann, Zollevent, Zollevent, Zollevent, was übrigens immer nur eine Minute dauert, ich weiß gar nicht, was die da ehrlich gesagt machen wollen in einer Minute, Paket einmal 360 in die Luft kreisel, kreisel, snipen und dann wieder hinlegen oder so, keine Ahnung, immer genau eine Minute braucht das hier, exquisite, oh die haben so zwei Minuten gebraucht, hier brauchen sie zwei, oh die sind schneller geworden, guck mal, Prozessoptimierung bei DHL, von zwei Minuten, eine Effizienzsteigerung um 100%, exzellent Stonks, so, und so ist es halt, ja, und also was ich jetzt schon gemacht hab, ich hab bei denen angerufen, die hatten gar keinen Plan, was Sache ist, ich sollte Dokumente hochladen, ich hab Dokumente hochgeladen, nichts passiert, Dokumente hochgeladen, hab ich hier schon, hab ich den Mail bekommen, ich soll nochmal Dokumente hochladen, okay, dann hat eine von DHL angerufen und hat gesagt, ja ich hab eigentlich auch keine Ahnung, was los ist, aber sie können die Dokumente ja nochmal hochladen, und dann hoffen, das hatte ich wörtwörtlich gesagt, ja, und dann hoffen, dass es jetzt funktioniert, sie sieht da auch nichts, sie weiß auch nichts, sie hat eigentlich gesagt, gar keine Ahnung, sie weiß noch nicht mal, von welchem Absender das Paket kommt, kein Witz jetzt, die wusste nicht, um welches Paket es geht, die ruft mich von DHL an, okay, und da hab ich die Dokumente, hab ich dann nochmal hochgeladen, also ich hab unten unten eine Mail geschickt davor noch, also ich hab eine Mail geschickt, zweimal Dokumente durchgeladen, zweimal telefoniert mit den Dudes, wohlgemerkt, ich hab 35 Euro bezahlt für Zoll und extra Zollhandling für DHL, also da ist Zoll schon dabei, ich hab extra bezahlt, dass die sich darum kümmern, ich musste 5 mal selbst aktiv werden, es passiert immer noch nix, so, und was ich heute gemacht hab, ich hatte heute keinen Bock mehr, ähm, weil bei DHL tut sich nichts, ich hab einmal noch ein bisschen wütend getwittert, meisten und die wissen, dass sie Scheiße gebaut haben, weil normalerweise beschwichtigt einen sonst die Twittersupportleute immer, so, und was ich heute gemacht hab, ich hab an Hersteller geschrieben oder an Shop geschrieben, ein zweites Mal, so nach dem Motto, dass es very sad ist, was DHL macht, und, ähm, sollten die es irgendwann mal hinkriegen, die mir diese, diese, dieses Shipment, äh, zuzustellen, und es wagen extra Geld zu fordern für ihren Service, noch oben drauf, was ich schon bezahlt hab, dann werd ich die Annahme verweigern und dann geht das direkt wieder an euch zurück, ähm, und ich hab ihnen auch dabei geschrieben, ich weiß, ihr könnt nix dafür, eure, ich, ich hab ja das Shipment-Paperwork gesehen von denen, also alles super, äh, steht auch alles drauf eigentlich, was die missen müssen, alles, alles top, ich weiß, ihr könnt nix dafür, tut mir leid, aber was soll ich machen, ich will, da, ich bezahl dafür nix extra, so, und das hat dem Shop überhaupt nicht gefallen, dass ich gesagt hab, ich verweigere die Annahme, excellent simply delivered, genau, das hat dem Shop nicht gefallen, als ich gesagt hab, ich werd die Annahme verweigern, ver-verständlich, ja, nicht, dass ich dann irgendwie nur einen Paypal-Case oder so aufmache, und, ähm, darauf hin hat der Shop dann geschrieben, äh, äh, dass sie sich mit DHL, dass, dass sie DHL nochmal kontaktieren, mal gucken, mal gucken, Pains-Champ, richtiger Pains-Champ, so, ich lad schon mal hier den ganzen Kram runter, äh, Leute, Achtung, Flashbang, boah, install, ja, ich will einfach, calculate, ach, Moment, Moment, Moment, man musste das doch in nem, ach, guck mal, man kann es, man kann es, stimmt, es gibt nen Docker-Install, hat, hat Edgard auch nen Docker-Install? Hab ich noch nie installiert, hab ich gar nicht gesehen, wie das funktioniert, download, ne, das kann man downloaden, wow, wow, äh, Windows-Access, äh, ja, by the way, by the way, soll ich euch, soll ich euch, soll ich euch nochmal das beste, beste Feature vom Windows-Defender zeigen? Ich hab mich ja, ich hab mich ja letztens schon drüber ausgelassen, wie lustig ich das finde, dass wir Windows-Defender mittlerweile auf vielen Linux-Servern auf meiner Arbeit haben, by the way, ich weiß, dass es nicht Windows-Defender heißt, sondern es heißt Microsoft Advanced Threat Protection. So, und äh, wir haben jetzt ne neue Version bei uns installiert von dem Windows-Defender, also der sau viel CPU-Zeit frisst und sonst was, aber jetzt kommt der Hit, die haben so ne, ähm, Report-Funktion im Windows-Defender jetzt, die könnt ihr analysieren quasi das System, auf dem sie laufen und, äh, schicken dann einen Report, ob das System gefährdet ist oder nicht und das ist die typische Windows-Scheiße, auf die ich schon seit Jahren keinen Bock mehr hab, ne, nur im Enterprise-Umfeld jetzt, weil das erste, was dieser Windows, nein, der Microsoft, die Microsoft Advanced Threat Protection, was die gemacht hat, ah ne, es heißt Microsoft Defender for Endpoint jetzt, ach, scheiß drauf, weil, wisst ihr, wisst ihr, was das Ding gemacht hat? Das Ding hat erstmal auf nem stinknormalen Samba Linux Fileserver 130 Exploits reported. 130 Exploits angeblich auf unseren Linux-Servern. Ne, ne, nicht 1, 2, 3, nein, 130. So, und wenn man sich dann anguckt, was das Ding anmeckert, ist komplett lächerlich, ja, irgendein Dienst hat verschiedene Dateien geöffnet gleichzeitig. Ja, no shit, das ist ein Fileserver, da passiert sowas manchmal. Das soll vorkommen, hab ich gehört, auf nem Fileserver, dass mehrere Dateien gleich, mehrere Filehandles gleichzeitig offen sind. Mag sein, ja. Der Fehler ist wahrscheinlich bitte Windows-Fileserver installieren, dann gehts besser. Und ich hab dann im, ich sag jetzt mal im Ticket drauf geantwortet, das fand aber glaub ich dann manche Leute nicht so witzig, hab ich geschrieben, der einzige Exploit auf den Servern ist der Windows Defender, aber, ich glaub, wenn es die falschen Leute sind, die finden das nicht so witzig. Weil die haben sich ja Microsoft krasse, teure Microsoft Consultants gekauft, die viel Geld kosten und gesagt haben, wir brauchen Windows Defender. Okay, also was, AtGuardHome brauch ich. Wie? What the fuck? Gibt's da nen ISO, gibt's da nen Docker-Repo irgendwie offiziell? Hier auf den GitHub. Docs, ah, exquisite, da, das brauch ich. Ja, dann installier ich den in irgendeiner, ja, dann ist doch einfach, dann brauch ich doch nicht mal ne neue VM, dann kann ich einfach hier, kann ich hier einfach zwei Container starten und wir können's ausprobieren, dann muss ich gar keine extra VM machen. Okay, probier das Ganze mal aus. Bring's mal kurz nochmal schnell hier drüber scrollen, ob ich irgendwas übersehen hab. Ja, hab ich gesehen. Genau, das ist der Grund, warum ich immer Buchstaben kopiere da. Mal gucken, was ich dazu sage. Weiß gar nicht, was ich dazu erzählt hab. Weiß gar nicht, was ich dazu erzählt hab. Weiß gar nicht, was ich dazu erzählt hab. Weiß gar nicht, was ich dazu erzählt hab. Weiß gar nicht, was ich dazu erzählt hab. Wir haben ein Ausrufezeichen, was wir heute machen. Wahnsinn. Hab ich schon mal gesehen, hab ich noch nicht ausprobiert, ne. Ja, ist bei mir auch grad so, ne. Weiß nicht, was die für Schmerzen haben. Ja, so sieht's aus. Übrigens, soll ich euch nochmal richtige Big Brain Action erzählen. Und zwar, wir haben einen Dienstleister, oder man könnte heute sagen, einen, was gibt's denn, Dienstleistung as a Service? Gibt's sowas? Halt, ein Anbieter, der für uns einen Spamfilter-Service bereitstellt auf der Arbeit. Service as a Service, ja. Und die haben so ein bisschen komische Philosophie. Und zwar, ich suche mir mal kurz den Dogger-Container hier raus und dann ist gut, Dogger install, da steht's doch schon, also. So, und die haben so ein bisschen komische Philosophie. Und zwar, sind das so groß alles, Alter, weil ich die für so fett gestellt hab. Okay, genau, das erzähl ich jetzt nochmal schnell. Also, die haben ein bisschen komische Philosophie. Und zwar, wenn die Mails als Spam erkennen, dann, und also normalerweise ist das so, du kriegst dann als Benutzer die Möglichkeit, das freizugeben. Das ist dann halt so ganz standardmäßig, ne. Dann klickst du da drauf und kannst das freigeben. Aber, wir haben ja ein paar Service-Mail-Adressen-Accounts, wo öfters mal Spam landet, unter anderem mal auch ab und zu mal wichtige Sachen kommen. Das heißt, man hat sich jetzt überlegt, okay, unser Spam-Anbieter sagt, der hat nämlich keinerlei API-Zugriff auf diese Sache mit Spam-Filter. Also, du kannst da nicht über den Skript einfach an bestimmte E-Mail-Adressen einfach alles freigeben. Ich weiß nicht, warum wir so einen komischen Anbieter verwenden, der die Basics-Sachen nicht kann, der die Basics nicht gemacht hat, aber so einen Anbieter haben wir. Und jetzt kommt Big-Brain-Time. Sie haben sich jetzt gedacht, okay, entweder wechseln wir den Anbieter oder unser 24-7-Support soll sich einfach einmal in der Stunde einloggen im Web-Interface vom Spam-Anbieter und auf alles freigeben klicken. Ich meine, so kann man die Leute natürlich auch beschäftigen. Man muss dazu sagen, das ist natürlich keine sonderlich beliebte Arbeit, aber es ist anscheinend billiger, als sich einen neuen Spam-Anbieter zu suchen. So, und jetzt kommt Absolute-Magic-Big-Brain-Moment. Wir haben uns heute überlegt, ob man den Kram nicht irgendwie automatisieren kann. Ist nicht so einfach. Wie gesagt, die haben keine API und das Web-Interface sieht aus wie ein altes Bootstrap und ist auch nicht schön zu klicken. Aber das größte Problem dabei ist, das Web-Interface hat Zwei-Faktor-Authentifizierung und zwar für Zwei-Faktor-Authentifizierung nur global für alles an oder aus. Also sprich, man kann nicht sagen, hey, wir haben einen Service-Account, in Anführungsstrichen, für den starten wir Zwei-Faktor-Authentifizierung aus. Nein, du kannst bloß für alle Zwei-Faktor-Authentifizierung ausschalten oder für alle Zwei-Faktor-Authentifizierung an. Wie gesagt, frag mich nicht, warum wir so einen Kack-Anbieter haben, aber es ist so. Und, ähm, oh ein Ricksle, das ist toll. Wir sind nicht die Einzigen, die sowas machen anscheinend. Das sagt man richtig. Ups, ähm, so also richtig, richtig, richtig dumm, richtig dumm. So, und was ich jetzt gemacht hab heute mit einem Kollegen zusammen ist, wir haben gesagt, okay, die, die, äh, debaten uns nicht und wisst ihr, was wir, was wir gemacht haben? Richtig, richtiger Big-Prain-Moment. Ich glaub, das da. Äh, ich hab ne, ich hab ne Zwei-Faktor-Authentifizierungs-Library gefunden für.NET. Ähm, die hab ich für einen Anfang verwendet, aber die ging nicht. Bin ich jetzt blöd? Wo ist es denn? Wo ist denn die Library, die ich verwendet hab? Hm. Wir tun jetzt einfach mal so, als hätt ich die verwendet. Die hab ich probiert, die ging nicht. So, und was ich jetzt, also, was ich jetzt gemacht hab, ist folgendes. Und ich finde, das ist echt Massive-Big-Prain-Move. Also, wir haben einen neuen Account gemacht beim Spam-Anbieter mit nem sicheren Passwort. Und wir haben uns eingeloggt, bis man dann Zwei-Faktor-Authentifizierungen, äh, einrichten musste. So, dann hab ich folgendes gemacht. Aus dem QR-Code für die Zwei-Faktor-Authentifizierungen, den QR-Code kannst du einscannen und QR-Code analysieren lassen. Aus dem QR-Code hab ich, ähm, das, das Secret rausgeholt. Ich weiß, ihr wisst hier, wie diese Authentificator-Sachen überhaupt funktionieren, oder soll ich das mal erklären? Das ist total simpel. Also, egal, ob's Microsoft Authentificator oder Google Authentificator ist, die funktionieren alle ähnlich. So. Zumindest, zumindest hab ich den, das Secret aus dem QR-Code rausgeholt. Und das Secret hab ich mir dann gespeichert. Und mit einer.NET-Library generiere ich mir quasi ein eigenes Authentificator, ein eigenes Token, was immer gültig ist, wenn ich mich einloggen will. Das heißt, ich kann Zwei-Faktor-Authentifizierungen machen aus einem Programm, der auch den Browser fernsteuert, ohne dass ich eine App brauche. Also, ich erklär euch mal, wie das Ganze funktioniert. Also, wenn ihr so eine Zwei-Faktor-Authentifizierungen, äh, ich brauch mal dieses Bild, was der Typ eben hatte, mit dem QR-Code. Genau, also das kennt ihr ja. Wenn ihr euch bei irgendeinem Anbieter, wenn ihr anklickt, Zwei-Faktor-Authentifizierungen anklicken, also wenn ihr bei irgendeinem Anbieter Zwei-Faktor-Authentifizierungen anklickt, dann kriegt ihr ja meistens so ein QR-Code. Manche, die richtig oldschool sind, haben noch den Key direkt als, äh, als Zahl oder als Text auf der Seite. Also, entweder bekommt ihr, wenn ihr Zwei-Faktor-Authentifizierungen für einen Authenticator einrichtet, dann kriegt ihr entweder so ein QR-Code, oder aber unter dem QR-Code steht nochmal so ein geheimer Schlüssel. So, was jetzt, wie diese ganze, ähm, Time-Based, Time-Based, wie heißt der nochmal? Time, what the fuck, was ist das? Time. Genau, also wie diese ganzen OTP, Time-Based, was heißt das? Time-Based, Time-Based One-Time Password. Also, das ist das, was alle Authentificator verwenden. Also, es ist jetzt egal, ob Microsoft-Authentificator, Google-Authentificator, Blizzard-Battle-Net-Authentificator, die einzigen, die was eigenes machen, ist Steam, die funktionieren tatsächlich nur mit dem Steam-Steam-Authentificator, aber es gibt genug mittlerweile, die mehrere Sachen können, aber in der Regel verwenden die dieses T-OTP. So, und was die Dinger machen, ist ganz einfach. Wenn ihr diesen Code scannt, passiert Folgendes. In diesem Code steht ein, ich weiß nicht, 10-stelliger, 10-stelliger Base 32, fragt mich nicht, warum es Base 32 ist, äh, ein irgendwie 10-stelliger Base 32-encodeder geheimer Schlüssel drin. So, also stellt euch vor, da steht ein Passwort drinne in diesem QR-Code. So, dieses Passwort merkt sich eure Authentificator-App und dieses Passwort merkt sich der Service. Und das einzige, was die Authentificator-App macht, ist, anhand der aktuellen Uhrzeit, UTC meistens, also dass man nicht mit Zeitzonen Probleme hat, anhand dieses geheimen Schlüssels und der aktuellen Uhrzeit berechnet das einen Talken für euch. Deswegen sind diese Talken auch plus 30 Sekunden gültig oder eine Minute oder 15 Sekunden, je nachdem, wie das eingestellt ist und dann wechselt das. Und das machen einfach, auf beiden Seiten passiert das. Also eure Authentificator-App macht das und der Service macht das. Ihr habt ja euch einmal gesyncht mit einem geheimen Passwort über diesen QR-Code und dementsprechend können eure Authentificator-App und das Service unabhängig voneinander mit Hilfe der aktuellen Uhrzeit das gleiche Talken berechnen. Und dann gebt ihr das Talken ein, der Service macht im Hintergrund das gleiche und wenn die Talken gleich sind, dann geht's weiter. Also die Dinge sind wirklich unglaublich simpel, wie diese Authentificator-Dinger auch funktionieren. Habt ihr das verstanden? Also das ist nichts kompliziertes. Und das kann man natürlich auch machen, wenn man sich nämlich das initiales Secret, was in diesem QR-Code steht, wenn man das eben nicht einfach nur scannt und in der Authentificator-App macht, sondern wenn man sich das initiales Secret einfach kopiert und in eine OTP-Implementierung steckt, die im Prinzip das gleiche macht, was die Authentificator-App macht, kann man ohne Probleme kleinzeitig so ein Passwort berechnen. Heißt, wenn man die Uhrzeit umstellt und das Internet ausschaltet, funktioniert es nicht mehr richtig. Also das Internet kannst du ausschalten, das ist erstmal egal, aber wenn die Uhrzeit nicht stimmt, dann geht das nicht mehr. Es ist aber die Frage, welche Uhrzeit das Ding nimmt. Ob es die lokale Uhrzeit vom System nimmt, ob das selbst eine NTP-Implementierung hat oder sonst was. Aber ja, wenn deine Uhrzeit nicht stimmt, dann geht das nicht mehr. Ist übrigens, by the way, das ist bei ganz vielen Authentifizierungs-Sachen so. Zertifikate sind nicht mehr gültig, SSH-Logins gehen nicht mehr, wenn eure Zertifizierung, eure Uhrzeit nicht stimmt. Also Uhrzeit ist generell bei vielen Security-Sachen ganz wichtiger Faktor. Genau, du kannst auch mit Keypass das machen, wobei halt die Sache die ist. Ich mache das nicht im Keypass, weil es heißt ja nicht umsonst Zwei-Faktor-Authentifizierung. Der Sinn ist ja, dass man die Information nicht auf dem gleichen Gerät hat. Also sprich, wenn ich einen Passwort-Manager habe und darin meine und mein OTP-Secret speichere und meine Passwörter, dann hat man einen Angreifer, der meine Passwörter und meine Keypass-Datenbank aus dem RAM abgreift, beides um sich einzuloggen. Also dann kann man sich OTP auch sparen. Deswegen, das heißt Zwei-Faktor. Also entweder man macht das über einen USB-Stick, über ein Handy oder was auch immer, aber auf dem gleichen Rechner ist schon ein bisschen doof. Ist natürlich angenehmer, aber ist ein bisschen doof. So, so funktioniert das. Und was wir jetzt gemacht haben ist, ich habe das hier genommen. Das ist ein Chrome. Ein Headless-Chrome, also ein Chrome ohne das er angezeigt wird. Im Hintergrund generiere ich mir einen OTP-Token und das heißt, ich kann mich jetzt bei diesem Spam-Einbieter mit einem Headless-Browser einloggen, inklusive Zwei-Faktor-Authentifizierung, weil ich es so tue, als hätte ich eine Authentifizierte App und kann dann dort Clicks im Web-Interface simulieren, die Spam-Mails freigibt und alles nur das, weil der Anbieter keine API haben will. Übrigens wisst ihr was die geilste Ausrede des Anbieters ist, warum sie keine API haben? Die ist so bescheuert. Die Ausrede des Anbieters ist es, wir haben intern dazu einen Feature-Request offen. Das ist so nicht mal eine Ausrede, das ist einfach nur, das ist einfach nur was darauf gesagt, das ist noch nicht mal eine Ausrede, das ist keine Antwort, das ist nix. So nach dem Motto, so nach dem Motto, Feuerwehr bei mir brennt, könnt ihr vorbeikommen, wir haben intern dazu einen Feature-Request eröffnet. Also, ich weiß nicht. Bescheuerte Antwort, äh. Ok, jetzt installieren wir uns mal ein Pie-Hole im Docker-Stels. Wisst ihr was ich, wisst ihr was für Anleitungen ich mag? Anleitungen, wo nicht alles auf einmal dasteht, sondern Quickstart, wo dann aber auch einfach nur ein Docker-Commando dasteht. Gut, ich meine, ich kann es im Docker-Compose machen, das ist auch in Ordnung. DNS-Stels. So, Set-Paste, zack, bumm. So, kann man das so stehen lassen? 53, 67, 80, 443, ich hoffe mal das ist frei. Time Zone, America, Chicago, nein. Europa? Berlin sind wir. Volumes, äh, etc. CDN-Spa. Das sollte der anlegen. Äh, ich will keinen DHCP machen, wie, äh, wie mache ich einen DHCP aus, der soll keinen DHCP machen. Ok, das kommt weg, das kommt weg, ich will bloß nicht, dass das Ding bei mir lokal anfängt, DHCP zu machen, ich glaube es geht los. Stimmt, Port 67 entfernen, hast du recht, ist eigentlich noch besser. Recommended, but not required, ok, ich mache Port 67 weg, hast du recht, ist eigentlich die beste, beste Variante, ok. Docker-Compose, ab. Ok, schauen wir mal. Oh, jetzt? Ist jetzt gestartet? Ok, das ist gut. Docker-PS, sagt mir Port 80, ok, das heißt, ich kann jetzt auf localhost Port 80? Ah, jetzt exquisite, da ist es. Achtung, Flashbang, ah ne, flasht gar nicht so sehr. Ach so, ah, jetzt atmen, doch Flashbang. Ok, nice, Login, äh, Piehole, Default, Login, wahrscheinlich Piehole oder so. Steht im Log? Da, das hätte man jetzt auch ein bisschen, das hätte man auch ein bisschen prominenter schreiben können, oder? Ich mein, das liest doch keiner. Das hätte man das nicht auch ein fett mal ausprinden können, fünfmal hintereinander mit rot oder so. Ok, Login, excellent, da sind wir. Total Queries, ich hab meine Bedenken, dass da überhaupt irgendwas gequereert wurde. Ok, ich hab das vor Jahren mal auf gehabt, das wichtigste, hat das ein Dark Theme? Hat das ein Dark Theme, ich brauch ein Dark Theme. Wo, wo ist das Dark Theme? Ja, hat es, Styling. Was, Peter? Rechts? Ach da, ok. Ah, yes, so ist das schön, jawoll, so ist das. Ja, da kann ich mit leben. Auch keine Cacona-Einheiten eingestellt, alles gut. So ist das nice, so ist das schön. So, jetzt muss ich mich erstmal ein bisschen, beste Hostname überhaupt, jetzt muss ich mich erstmal ein bisschen zurechtfinden. Wie gesagt, ich hatte das vor zwei, drei Jahren mal am Start, ich hab da glaube ich damals gar nichts großartig konfiguriert, außer ein paar Blocklisten irgendwie hinzugefügt. Ich weiß aber gar nicht mehr, wie das genau ging. Ok, lasst uns mal das ganze Kram angucken. Dashboard-Querylog, passt. Long-Temp-Data, gutes, mehr oder weniger egal, Whiteless-Blacklist, ok, da kann man Hardcoded Sachen reinschreiben, Group-Management ist für mich jetzt erstmal relativ egal. Lasst mich mal raten, ist das hier für DHCP? Ah, hier kann man spezielle Sachen auflösen lassen, ok, das ist nicht verkehrt. Hier gibt's List, ok, Tools, man musste irgendwie die List noch updaten, das war zumindest das letzte Mal so. Update, ahja, genau. Ok, ich glaub das war's, ich glaub mehr musste man, mehr muss man nicht machen. Zeigt mal hier, was stehen hier noch im Getting Started drin? Jaja, blablabla, ne, ich glaub mehr musste man gar nicht machen, ne? Gut, ich mein mehr kann man ja auch nicht wirklich machen. Ah, Ad-Lists hier, please use, stimmt das war früher in den Settings. Ok, standardmäßig gibt's nur diese Liste hier anscheinend, Steve, das Steve, alles klar. So Leute, jetzt um das zu testen, brauchen wir mal ne Seite mit richtig fett Werbung und ich mach mal ne Ad-Blocker aus, also, new private window, ich glaub da ist der Ad-Blocker sogar schon aus, build.de hat viel. Ok, wie sieht das standardmäßig aus? Oh, was? Ernsthaft? Die wollen mir ernsthaft erzählen? Ich darf kein Private Mode anmachen? Spiegel, ok. Ich brauch Werbung, ich brauch Werbung Leute. Accept. Ok Leute, ich hab keine Werbung, ist vielleicht mein Ad-Blocker, ah ne, ah, yes, perfekt, alles voller Werbung. So sieht das Internet also normalerweise aus, aha, aha. Was blocker.com testen sie ihren Ad-Blocker? Da krieg ich bestimmt Porn-Popups jetzt, ok, also das passt schon, Spiegel testen wir jetzt mal. Neue Liebe in Hanau, IP-Tracking, so, so. So viel verdient ein Arzt in Hanau, wunderbar. Meine IP sagt wahrscheinlich ich bin in Hanau. Dänemark impft schneller als wir, wie schaffen die das? Die verkacken es halt nicht total. Dänemark gibt im Vergleich zu uns auch richtig viel Kohle aus für ihr Gesundheitssystem und wollen das das gut ist. Ich hab mal nen dänischen Arbeitskollege, für die war das schon absolutes Drama, wenn die quasi nicht in ihrem Quetschendorf ein Krankenhaus haben. Du musst vielleicht noch, was muss ich machen? Du musst vielleicht noch Traffic von allen Interfaces zulassen. Probier ich mal. Settings, DNS. An die Upstream DNS. Custom DNS Server. Ah das ist gut, da kann ich auch meinen eigenen DNS eintragen, kanns weiterleiten, ist auch gut. Listen on all Interfaces. Machen wir einfach mal. Ok, dann stellen wir das mal um. Edit. Gucken ob dann die Werbung weg ist. Ich hab ewig kein DNS mehr von Hand eingestellt, wie macht man das überhaupt hier? Device, IPv4 Settings wahrscheinlich. Aha. DNS Server. Localhost. Hallo? Ich darf nix eintragen. Äh? Was soll der denn den Hausname für den DNS auflösen? Hausdatei zum Beispiel. So, und jetzt ist die Werbung noch da oder ist die Werbung weg? Chat, was mein dir? Werbung noch da oder Werbung weg? Ich muss wahrscheinlich den Cognito Modus nochmal zumachen, nochmal neu aufmachen. Ok, DNS Auflösung geht nicht. DNS Auflösung geht nicht. Warum? Das muss vergleichbar sein. Ich hab mich verschrieben. Hast du überhaupt nen Upstream DNS eingestellt? Ja, es ist standardmäßig ist der Google DNS eingestellt. Ok, vielleicht muss ich das Pyhontas den Pion mal neu starten. Wir können mal gucken, was hat denn das Ding? Was hat denn das Ding standardmäßig für Netzwerkmodus? Das forwarded, ne? Blocked Fastport, das können wir mal gucken, das ist ne gute Idee. Port 53. Schauen wir mal. Docker Proxy, nö. Ok, ich sag euch was wir machen. Mal gucken, da hilft das was. Schauen, mal gucken, ob es jetzt funktioniert. Aber es sieht schon erstmal gut aus. Ich mein, ich kann es auch auf dem Raspberry installieren oder in der eigenen OEM mal gucken, aber das müsste noch so eigentlich auch funktionieren. Ich könnte einfach Network Mode auf Dings machen auf Host, dann gibt es auf keinen Fall mehr Probleme. So, dick. Ah, yes, jetzt funktioniert es. Ah, lock? Doch, lock-lost geht. Ok, gut, Auflösung und Funst, alles gut. Öffnen, Spiegel.de. Ach, nicht Siegel. So, und Werbung weg oder Werbung nicht weg? Nope, Werbung nicht weg. Ok, vielleicht hat er das dann doch irgendwie noch gecashed oder so. Ah, guck mal, hier ist weg jetzt. Nimm DBL, ich will erstmal gucken, wie der Kram out of the box funktioniert. Hab ich hier noch irgendeinen Adblocker an? Die Bild sagt uns das ja. Ach, nee, genau. Plugins? Nee, ich hab keinen Adblocker an. Extensions? Ich hab noch nicht mal einen Adblocker überhaupt installiert im Chrome. Ok, das lag wohl irgendwie daran. Dann refreshen wir Firefox nochmal. Wir refreshen Firefox nochmal ohne Cache und lassen das neu machen. Spiegel und da ist Werbung, alles klar. Moment, Inspect Element, Network. Wo war denn der Knopf? Disable Cache, bester Knopf. Warum funktioniert es im Firefox nicht? Und Firefox DNS? Oh, hat der? Ach, ernsthaft? Boah, meine Güte, Firefox. Was muss ich ausstellen? Alter, damit hab ich mich ja noch nie beschäftigt. Wahrscheinlich hier irgendwie. Ach so, man hat DNS. Nein, hat er nicht. Hat er nicht. Warum geht das im Firefox jetzt nicht? Das leuchtet mir nicht an. In meinem Chrome funktioniert es ja. Ok, äh, nee. Ok, wir machen jetzt mal was anderes. Ich stell mal hier ein, dass der komplett... Du kannst es nicht explizit einstellen. Oder kannst du im Firefox explizit einen DNS einstellen. Kannst da normalerweise Proxys und sowas einstellen, aber DNS kannst du da normalerweise nicht einstellen. Nee. Na, da bin ich jetzt mal gespannt. Ghost Rider, wo geht denn das? Also, wenn ich da ist, ist der ganz schön fail. Also, mich würd's wundern, wenn man den DNS einstellen kann. Also, du kannst Proxys und so geduldens immer einstellen, aber DNS eigentlich... Ja, über About-Config vielleicht. Aber warum geht denn das jetzt nicht? Ok, ich hab ne andere Idee. Hast du die DNS-Tabelle gelöscht aus dem Cache vom Host? Ja, muss ich ja. Der Chrome hat ja auch keine Ads. Ich prob... Wir machen jetzt was anderes. Wir machen jetzt was anderes. Ich stell den Docker-Container so ein, dass der am Host-Interface lauscht. Ich weiß es aber aus dem Kopf gar nicht mehr, glaub ich es ging. Ich glaub so. Network, Host und da kann ich von meinem Windows-Rechner aus drauf. Der Netzaufer HTTPS geht ja, das will ich ja grade nicht machen. So. Docker, Compose, Down. Ok, ne, wie ging das? War's Network-Mode? Doch, hast recht, war Network-Mode. Kann man das immer aus dem Kopf nicht merken. Du kannst zum Beispiel den Cloudflare-DNS einstellen. Was soll ich mit dem Cloudflare-DNS? Der Chat wird ja so krass am Backseiten, Alter. Oh. Achja, das funktioniert nicht. Du hast da aber den Firefox noch offen, also nicht den Kognitor. Äh, seh mal gleich, seh mal gleich. W, du machst DHCP an, Piehall, ich sag's dir. Hör mal bloß auf. So. Das heißt, jetzt kann ich den hier umstellen. Achso, hm. Ich will meinen Host nicht umstellen, wenn ich meinen Host umstelle, das sackt. Ok, der plockt aber was. Ok, Leute, ich mach einfach Firefox nochmal komplett zu. Firefox. Private Window. Macht der Firefox im Private Window vielleicht immer, immer, äh, HTTPS, DNS oder so? Ah. Ah, das sieht besser aus. Ok, nice, das funktioniert, sehr gut. Werbung ist weg. Werbung down. Achso, Adblocker aktiv, ich hab mir meinen Adblocker hier an, lull. Ok, wie sieht's ohne aus? Ah, ohne ist die Erwerbung auch weg. Guck mal, funktioniert, funktioniert. Adblock, Adblock ist, Adblock ist aus. Nice. Funktioniert. Ok, ok, das war relativ easy. Das ist relativ easy gewesen. Äh, bei der Gelegenheit, ich mach das mal wieder aus. Meinst du, das ist gecashed? Aber zumindest. Oh nee. Ich hab, ich hab in meinem Wim, äh, Androhistorie speichern nicht aktiv. Oh. Na gut, lull. Aber ich hab, äh, aber ich hab die Datei noch, dann müssen wir das noch einmal anpassen und dann ist gut. Berlin, äh, äh, Europa slash Berlin. Das konnte man ja standardmäßig so lassen, wie es aussieht. Ok. So, schauen wir mal. Disable cache. Nee. DHCP ist jetzt an, warum ist auf einmal der DHCP an? Äh, der macht standardmäßig keinen DHCP. Das wäre, das wäre ziemlich kacke, wenn der standardmäßig DHCP machen würde. Also, ich hab den Port nicht geblockt mit DHCP. Ja, aber ich glaube gar nicht, dass DHCP standardmäßig an ist. Oder ist DHCP standardmäßig an? Genau, wenn man in den Einstellungen aktivieren muss, dann ist alles gut. Alles safe. Saved. Ok, das scheint zu funktionieren. Äh, ich mach Firefox nochmal zu, machs nochmal auf. Übrigens, Heise hat mich gescampt mit dem Heise Plus Abo. Ich wollte mir, ohne Scheiß, ich hab, ich, ich wollte einen, ich wollte einen Heise Plus Artikel lesen. Also, hier die da. Also hab ich gesagt, ok, ich mach einen Probe Abo. Du kannst einen Probe Abo machen, wenn du CT-Abon entpissen. Ich hab das angeklickt und es hat nicht funktioniert. Ich hab's nochmal angeklickt, es hat nicht funktioniert. Dann hatte ich zwei Heise Plus Bestellungen in meinem, meinem, äh, meiner Bestellhistorie auf einmal drinne. Zwei Stück für einen Account, wie auch immer das gehen soll. Und ich wollte den Artikel eigentlich gleich lesen. So, und die haben zwei Tage gebraucht, mich für einen Abo, für einen Heise Plus Abo freizuschalten. Und nachdem wir das geschafft haben, hab ich mir gedacht, nee, eigentlich hab ich da gar keinen Bock drauf und wollte das kündigen. Da bin ich in die Account-Abo-Settings gegangen und, ähm, habe versucht es zu kündigen. Da war, es war, es gab keinen Button. Es gab keinen Button, das zu kündigen. Ich hab, ich hab unter Abos, hab ich mein CT-Abo stehen und untendrunter hab ich Heise Plus stehen, aber ohne Abo, ohne, ohne Kündigungsknopf. Also hab ich mir gedacht, okay, ähm, dann ist das wohl ein Probe-Abo und es gibt kein zusätzliches Abo, ja. Und heute haben sie mir geschrieben, ich hab jetzt ein Abo von Ende März bis, äh, Ende, bis Ende März 2022 für 39 Euro. Wollt ihr mich, wollt ihr mich verarschen? Wollt ihr mich rollen? Oder was? Abo-Champ. Das war richtig Sauerei. Rollt, ja. So, zumindest, die sind auch geplockt. Klappt? Nein, 39 Euro im Jahr. Ich sag doch bis 2022. Okay, hier ist alles geplockt. Funst. Was hat denn Herr Knu wieder verbrochen? Hä? Moment. Der ist doch schon zu, der ist doch gar nicht mehr in der Free Software Foundation. Was haben sie denn jetzt schon wieder für Probleme? Ach nee, der ist wieder da oder was? Alter, blickst, blickst immer durch. Uplock ist, oh nee, Uplock ist, Moment, ich muss das disablen. Äh, äh, Manage Extensions. Kann man die Dinge eigentlich komplett ausschalten? Alles klar, zack. Noch mal neu starten. Nice. Aber Leute, Ads sind weg. Alles gut, passt. Easy, easy ad, easy live. Hi, es ist auch ad-frei. Was natürlich nicht ad-frei sein wird, ist sowas wie YouTube. Da, das ist, das muss ich was zu sagen, weil das ein wichtiges Thema ist. Also, äh, der Gausschreiber schreibt gerade in meinem Ausbildungsbetrieb zerbricht gerade, äh, die ganze Abteilung kommt vom Adminrennen, so schnell du kannst, lull. Also, je nachdem in welchem Jahr du bist, ich würde meine Ausbildung auf jeden Fall erstmal fertig machen. Danach kann man immer noch gucken. Und, äh, wenn die Abteilung zerbricht, ich mein, es gibt sicherlich da auch noch andere Stellen, wo du bist, IT Leute brauchen wir auch immer. Und ich kann an der Stelle bloß mal mein Video empfehlen. Ähm, geht zwar jetzt nicht exakt um das, aber es geht auch um ein Laden, der sich immer weiter ins schlechte Ende entwickelt hat. Das, äh, das da. Okay, das ist ein Plants vs. Zombies Video drunter, aber, äh, darum ging's, ja. Und, äh, das war, da ging's nämlich auch um den Betrieb, wo ich meine Ausbildung gemacht hab. Und wie, wie der immer schlechter geworden ist, bis dahin, dass ich irgendwann gesagt hab, ich hab keinen Bock mehr. Ausbildung ist in zwei Monaten zu Ende, ja. Naja, oder, ich mein, du musst ja nicht unbedingt was anderes finden, ich weiß ja nicht, wie das heißt, ob die Firma pleite ist oder so jetzt, ne, dann bleibt dir nix anderes übrig. Aber nur weil da, weil's da in der einen Gruppe Stunk gibt, es gibt ja, wenn der Laden was taugt, kann's ja durchaus sein, dass es da noch andere Stellen gibt, die interessant sind, ja. Genau, jetzt wollte ich nämlich mal YouTube testen. Und, äh, Twitch, aber Twitch kannst du vergessen. Was kannst du für Terminals empfehlen? Äh, IBM Z-Series, beste. Am besten Cobalt Only. Ne, also mein Lieblingsterminal ist nach wie vor Knob. What? Festgewachsene Wirbelsäule. Also, wenn man wirklich eine festgewachsene Wirbelsäule hat, ist, glaub ich, das Schlechteste, was man machen kann, einfach mal dran rumreißen. Das tut nur weh und ist sicherlich auch, äh, schlecht. Aber gut, YouTube, YouTube-Videos. Ähm, was wollte ich jetzt zeigen? Ich wollte gucken, ob YouTube geht. So, wir gucken einfach mal, ob mal in meinen eigenen Videos jetzt die Werbung weg ist. Zeig mal her. Aber das ist klar, also, es ist wirklich, es ist wirklich unglaublich schwierig, auf YouTube mittlerweile Werbung zu plocken, ne. Also, wie gesagt, auf Spiegel geht's, auf Heise geht's, auf RP Online, was einer vorhin gesagt hat, da geht das alles halbwegs mit Adploggen. Ähm, bis auf die ein oder anderen Sachen vielleicht, aber im Großen und Ganzen geht's. Aber YouTube ist mittlerweile wirklich, wirklich clever. Die liefern die Werbung von den gleichen, äh, Servern aus, äh, wie den Content. Das kannst du wahrscheinlich nur mit sehr viel, äh, Tricksen und regelmäßig Listenupdaten fixen, ja. So, gucken wir mal, wie es, wie es auf Twitch aussieht. Auf Twitch will ich natürlich die Werbung nicht plocken. Will ich euch auch nicht empfehlen, weil, da krieg ich ja weniger Geld. Ich hab Uplog aus, gerade zum Testen, ja. Ja, deswegen hab ich ja auch, mit dem Browser Addons ist ja klar, aber das richtig geile, wozu man das ja brauchen könnte, ist, äh, über Mobile-Apps und das geht halt gerade mit den iOS-Apps nicht richtig. Ja. Ich mag von KDE fast nix. Ich, du musst mal an die Videos gucken, ich hab total oft meine Arme geleakt in letzter Zeit. Die, äh, die, die, die Wots, guck mal. Ich hab hier total viele Arm-Leaks drinne. Bild.de noch mal testen. Ja, sie ist auch Werbung weg. Der Corona-Fakten-Check und das von der Bild, genau. Mein Gott, das ist so scheiße. Ah. Ich hab nen Adblocker, du hast dir Youtube-Premium gekauft, wahrscheinlich, er hat. Da kann ich dir nur empfehlen, kauf dir Youtube-Premium in Indien, dann kostet es nur zwei Euro. So, nice. Also, das Ding funktioniert relativ gut, muss ich sagen. Für so die Standard-Surf-Dinger ist das gar nicht mal übel, ja. So, was kann man da jetzt noch großartig sinnvolle Sachen einstellen? Das muss ich mir jetzt nochmal angucken. Ich muss sagen, also fürs Setup kriegt das Ding von mir echt volle Punktzahl, weil mal ganz im Ernst, viel simpler kann das Setup doch eigentlich nicht sein, oder? Golem-Werbung. No fucks ever given. Ah. Das ist anscheinend auch nicht alles geblockt, aber einiges. Okay, irgendjemand hat ne neue Blockliste gepostet vorhin, die ich mal ausprobieren soll, das mach ich jetzt. Ist derjenige noch da, dann füg ich die neue Liste mal zu hier. Was ist das? Kann doch keiner aussprechen. Normal, dass sich da nichts tut? Ah, das ist einfach. Oh fuck, Alter, was ist, boah, was ist das für ne Liste? Okay, also fügen wir die mal hinzu. Ähm. Ja, huh. Keg-Wait. Add. Hinzugefügt. Und jetzt muss man wahrscheinlich noch in die Settings gehen und, äh, updaten, oder? Oder macht er das automatisch? Was ist das? Also, so wie ich es jetzt gemacht hab, oder? Mehr muss man, mehr muss man wahrscheinlich nicht. Ach, hier macht er doch, Target. Da steht's doch sogar. Ja, Spider, so ist es. Aber, das nicht machen ist ja auch keine Alternative, oder? Okay, noch mal. Postchamp? Postchamp? Ah. Werbung scheint weg zu sein. Ah, ja, ja. Excellent. Ja gut, was soll das Internet in der aktuellen Zeit auch sonst machen? Die können froh sein, dass Fortran nicht wieder neue, äh, Pepe-Hass-Symbole in die Welt, äh, verbreitet, ja? Die sollen froh sein, wenn das Internet nur Memes und nur Memes macht. Ja, und die Chinesen sollen mal gucken, dass ihr Aliexpress-Lieferungen wieder ankommt. Hast du Regex? Wie hast du Regex? Was ist das für eine Frage? Hast du Regex? Ich hab Regex. Ich hab ganz viel Regex. Das ist so, wie wenn einer fragt, hast du Emote. Ach, hast du Regex? Ob ich Regex hasse? Nee. Was jetzt? Ich bin verwirrt, ne? Ach nein, ich hab keine Regex-Filter. Ich hab keine Regex-Filter. Nein, hab ich nicht. Was letzte Regex? Ich hab die Fault-Settings und ne extra Liste vom Chat hinzugefügt. Das muss reichen. So, jetzt gucken wir mal, ob YouTube, was YouTube jetzt sagt. Ok. Ok, das ist vergesstes. Ok, aber ich muss ehrlich sagen, das Setup finde ich gut gemacht. Das ist wirklich easy. So, mich würde jetzt tatsächlich noch interessieren, ob, ähm, Regex funktioniert allerdings nicht der Regex, den der Chain-Lore meint, sondern Regex für DNS-Auflösung. Das muss ich mal ausprobieren. Äh, weil aktuell ist es so, wenn ich, wenn ich, ähm, keine Ahnung, äh, Wiki mal auflöse von meiner Domain, hier lokal. Äh, ich hab mich vertippt. Dann kann er das nicht auflösen. So, alles klar. Ähm, ich würde jetzt gern gucken, ob ich Wildcard, Wildcard-DNS anlegen kann. Das hab ich nämlich sowas gesehen. Das wäre ganz praktisch, weil aktuell verwende ich den DNS von meinem MikroTik-Router und da muss ich jede einzelne Domain von mir lokal extra eintragen. Das nervt mich. So, äh, Group Management, Domains. Hier, Domain to be added. Regex. Ist das jetzt für DNS-Auflösung oder ist das, oder ist das zum Domain-Filtern? Nee, das ist zum Filtern, weil sonst müsste man eine IP angeben. Ach, add to blacklist, add to whitelist, das ist zum Filtern. Okay, dann funktioniert das damit schon mal nicht, was ich mir gedacht hab. Ah, yes. Unter local DNS. Ah, guck mal da. DNS-Records. Kann der? Hä, der kann keine, der kann keine, ähm, also ich kann da nicht sowas machen wie, oder? Geht das? Punkt, keine Ahnung, eins eins, testen wir jetzt mal. Ah, muss man mal gucken. Du musst DHCP einschalten. Nee, warum? So. Ja, ich weiß, dass man das potenziell mit DNS-Mask machen kann, das weiß ich. Ich will nicht domain-spezifisch weiterleiten, ich will wirklich alle Dinger standardmäßig auflösen auf eine IP. Intern. Lokale DNS-Records, ja gut, ähm, es bringt mir ja trotzdem nix, weil ich kann ja eh nicht das eintragen, was ich eintragen will, was ziemlich sackt. Guck, der versucht das gleiche hier. Also ich weiß, dass es, jaja, ich weiß, dass das geht mit DNS-Mask, das weiß ich. Ja, ich will nicht den DNS vom Router verwenden. In meinem Router muss ich ja auch jede Domain-Einzel eintragen, das will ich ja nicht. Ich wollte das als Ersatz dafür vielleicht verwenden. Nein, chat, ppega chat gerade, was ist denn hier los? Das bringt mir doch nix, wenn ich das weiterleite, da muss ich ja weiter jede einzelne Domain eintragen. Ich wollte ne Wildcard-DNS-Eintrag machen, dass alle zukünftigen Domains, die ich mir ausstelle für meine interne Domain, ähm, automatisch auf einen Server aufgelöst werden. Tja, ok, das geht nicht. Mal gucken, ob Edgar das kann. Nicht spoilern, Leute, nicht spoilern, ob das das, ob die das können. So, geht, geht vielleicht sowas, dass ich das für vorne weglasse. Must be valid. Ja, ok. Ja, das ist Alias, so. Ne. Ohne Punkt vorne dran. Ich bin mir jetzt nicht so sicher, ob der Chat mich trollen will, weil ich mich gerade mit dem Chat beschwert hab oder nicht. Mir ist klar, dass es ohne Punkt dran funktioniert, aber dann macht er nicht das, was ich haben will. Dann löst er nämlich exakt diese Domain mit dieser IP auf, aber ich will ja Wildcard, alles, was es jemals gibt für diese Domain oder jegliche Anfrage für jegliche Subdomain davon auf die gleiche IP auflösen. Der Mikrotik Router kann das zum Teil leider nicht gut, sodass man das nicht gescheit verwenden kann. Aber ansonsten muss ich sagen, die Setup ist echt super gemacht. Also da kann man sich nicht beschweren, das ist total easy, das kriegt jeder hin. Und auch ohne, dass man sich irgendwie Guides durchlesen muss, ist es total naheliegend. Listen eintragen, DNS umstellen, fertig, easy. Ja ja, mit dem anderen DNS geht das, der DNS Mask kann das. Also du kannst das, ich könnte ja auch DNS Mask Config selbst eintragen, das geht schon, aber ich hätt's halt lieber, wenn das in einem Webinterface drin ist. Okay, also dann schalten das mal wieder aus. Und jetzt probieren wir das andere Teil aus. Delete, DRCP, save, bam, zack. Okay, mein Heizungs-Dashboard ist exzellent. Mein Heizungs-Dashboard, oh nee. Hallo, muss ich jetzt erstmal mal enable, disable, da ist wieder eine... Mein Heizungs-Dashboard ist poggers. Bestes Dashboard, ja. Wassertemperatur, Fehlerstatus, Kessel-Temperatur, Brennerstatus, Abgas-Temperatur, Pumpenaktivität. Ich weiß mehr über meine Heizung als der Hersteller selbst. Ist das ein Grafana-Theme? Das ist ein Darkreader-Theme und das ist das Standard Grafana-Theme, ja. Ja, ich glaub die haben mittlerweile einen Darkmode-Standard-Messig drinne. Kannste auswählen. So, okay, also. Machen wir hier mal wieder zu und machen erstmal auf die Stelle mal wieder U-Block an und gucken, ob wieder alles weg ist. Ah. Okay, wunderbar, alles blockt. Sehr gut. Okay, also das hat schon mal funktioniert. So, und jetzt installieren wir, würde ich sagen. Ich glaub, das kann ich löschen, das will ich nicht nochmal ausprobieren. Was hast du für eine Smart Home-Zentrale? Ich benutze Home Assistant, das da. Ich würde es euch ja auch öfters mal zeigen, aber ich hab immer Angst, dass ich irgendwas leake. Okay, RM, DNS-Stells. Da ist er weg. MKDier-DNS-Stells. So, und jetzt das Ganze für Edgard. Edgard-GitHub, wo haben wir da nochmal das Docker-Repo gehabt? Da. Official-Docker-Image, getting started. Okay, die wollen das nicht mit Compose machen. Docker-Run. Haben die ein Compose-Example? Nope. Dann machen wir es so, wie die es geschrieben haben. Also, was haben wir denn hier? Port 853. Was ist das für ein Port? Ist das DNSSEC, oder was ist das? DNS-Over-HTTPS. Das ist der russische Backdoor-Port, glaube ich, eher, ja. Gut, DHCP mache ich mal aus Sicherheitsgründen mal wieder weg. Ich hab keinen Bock, dass ich lokal irgendwie Alps vergebe. Okay, Port 3000, Port 80, Port 53. Das klingt sinnvoll. My Own Work-Dier. Nee, nee, nee, nee. Conf-Dier, nicht irgendwo sonst. Okay, Pass-Run. Bam. Oh. Was? Ach so. Das nicht Punkt-Slash. Moment, muss man bei Docker komplett einen Full-Qualified-Path angeben, ich glaube schon. Geht das jetzt? Moment, wo hat er jetzt die Ordner angelegt? Moment, wo sind die Ordner jetzt? Hat er jetzt irgendwie? Faktier oder so? Der hat ein eigenes Volume gemacht. Es ist mir egal, soll mir eigentlich recht sein? Volume LS. Ah, hier. Exzellent, passt. Okay, gut. Dann ist alles gut. Also, gucken wir uns das Ganze mal an. Wir müssen wahrscheinlich auf Port 3000, wahrscheinlich. Vermute ich mal. Ne? 80? Nee. Ich sollte aber eigentlich mit Localhost da drauf rauskommen. Localhost. RTPS. Ah! Moment, hab ich... Es läuft auch sonst nix. Äh. Okay, add gut. Erstmal gucken, welchen Port muss ich denn? Port? Also, wo steht's denn hier? Pull Docker-Image, bla bla bla. Aha. Warum ist das komplett broken jetzt? Würdest du dann P-Hole behalten? Ja, mal gucken, wie das andere ist. Also, angeblich ist das alles gestartet, aber es gibt keine Connection. Vielleicht sind das irgendwelche Docker-Problems? Ne, ich reboot jetzt nicht, ich mach Netzwerk-Modus und Gutes. Ah ne, dann macht er ja DHCP. Äh. Okay. Äh, Moment, wie ging das jetzt nochmal? Network? Network? Network-Host. Ach so, dann muss man die Port-Weiterleitung raus machen, ne? Ah. Jaja. Okay. Netz-Stat. Port 3000, alles klar. Und was anderes nicht, oder was? Wie? Sollte da nicht auch noch was anderes listen? Aber Port 3000 sollte jetzt funktionieren. Aha. Da sind wir. Oh, Flashbang. Manage Extensions, mal wieder aus. Okay, zeig mir also. Getting started. Next. Listen Interfaces. Ja, das reicht. Port 80. DNS-Server, all interfaces. Ja, komm. All interfaces. Mach mir bloß kein DHCP an, ey. Das ist ein hübsches Interface, das erkenne ich gleich an den Buttons. Was ist denn das für ein Button? Ist das Bootstrap? BTN-Success, BTN-Secondary, BTN-LG, klingt irgendwie ein bisschen Bootstrap-like. Username. CACW. 1, 2, 3, 4, 5, 6. Besser. Next. Configure ... Moment, was will der von mir? Ach so, das ist wie ich das einstelle. Ja, wie ich das einstelle, das kriege ich auch so hin. Open Dashboard. Jawoll. CACW. 1, 2, 3, 4, 4, 5, 6. Jawoll. Dark Mode ausmachen. Okay. Sieht recht fancy aus, muss ich sagen. Settings, DNS-Settings. Wir stellen jetzt erstmal mal den DNS nochmal um. Edit. So, DNS-Settings auf lokaler Horst. Save. Oops. Save. Voll connecten. So, mal gucken, ob es prinzipiell geht jetzt. Ja, geht. So, also. Okay, er hat schonmal die Hälfte geploggt. Was ist, wenn ich hier jetzt irgendwie hingehe? Ist es dann auch standardmäßig weg? Komm mal, der Timeout ist jetzt grad bei den Domains unten. Was dazu führen kann, dass irgendwelche Seiten hängen. Das ist übrigens das Problem, was ich ursprünglich mal hatte mit Piehole, dass die Seiten immer getimt aus sind unten, weil es sich auflösen kann und teilweise manche Seiten, so wie jetzt hier auf Spiegel, auch ewig hängen dran. Okay, aber sind zumindest standardmäßig schonmal alle ads back. Das ist schonmal gut. Aber guck mal, die Seiten hängen ewig und laden ewig rum. Das sackt. Okay, also was kann man hier alles einstellen? Hier wird erstmal schon das halbe Internet geploggt. 430% wird schonmal das halbe Internet geploggt. So muss das sein. So, das Dashboard sieht recht fancy aus. Facebook kommt, wird geploggt. Das zu Recht. Das UI sieht nach Scam aus. Warum? Am Moment, Facebook wurde nicht geploggt. Top Query Domains, Top Block Domains. Okay, also, Blocked by Filters. Okay, was kann man hier? AdGuard, DNS, Default, Malware Domain List. Soll ich einfach mal alles anhaken? Nee, wir gucken erstmal, wie die standardmäßig so sind. YouTube geht bestimmt immer noch. Jaja, nee, nee, YouTube geht nicht. Die geben sich auch sehr viel Mühe, dass es nicht geht. Guck mal, jetzt hängts. Das ist übrigens ein Grund, warum ich diese ganzen AdBlocker, diese DNS AdBlocker runtergeschmissen hab, weil die Seiten teilweise eklig hingen damit. Was für ein DNS benutzt AdGuard? Ich vermute auch mal DNS Mask, oder? Weiß nicht, was die intern verwenden. Ich hab keine Ahnung. Was eigenes wird es nicht sein. Niemand macht DNS selbst. Warum? So, also gehen wir mal in die Settings rein. Was kann man da alles Schönes einstellen? So, General Settings, Block Domains, 24 schon updaten. Leute, ich muss mal den, jetzt das wichtigste, wo ist Darkseam? Darkseam. Wo geht das? Haben die sowas? Ich brauch, ich brauch Darkseam. Gibt's nicht? Oh, hat's schon durchgefallen bei mir. Okay, Block Domains, Filters, alle 24 Stunden ist okay. Use Browsing Security Websites. Enforce Safe Search. Bury Logs, okay, das brauchen wir nicht. Was kann man sonst noch einstellen? DNS Settings, Upstream DNS. Ah, der Balanced über verschiedene DNS. Okay, kann man machen. Kann man machen? Wo kommt man denn hier raus, wenn man das abruft? Unable to Pass Request. Geil. Und was nimmt er da standardmäßig? Was steht da dahinter? Ich mein, es wäre schon interessant zu wissen, was er letztendlich für DNSer nimmt. Oder ist das, ist das DNS über HTTPS, was der DNS über HTTPS nimmt? Damit. Query one server at a time. Okay. Ach, hier, guckt mal. HTTPS, Encrypted DNS over HTTPS. Alles klar, okay, passt. Und das sind die DNSer, die er braucht, um das da selbst zu resolven. Alles klar, verstehe. Test Server, DNS Server Configuration Rate Limit. Ich finde die Default Settings sind durchaus cool, cool gemacht, ja. Die hätte ich jetzt so nicht mit gerechnet. Ah, Blocking Mode. Default Respond. Respond Refused Code. Kann man mal ausprobieren, vielleicht lag es da nicht mehr rum. Oder vielleicht laden die Seiten da nicht drei Stunden, wenn sie was nicht auflösen können. Guck hier, seht ihr das da unten? Probieren wir mal, was passiert jetzt, wenn ich das umstelle auf Refused Save? Erinnert sich nix. Cache Size, disallowed Domains, allowed Domains. Okay, klingt alles gut. Defaulten ist immer ganz sinnvoll. Encryption Settings. Boah, nee, das muss ich mir jetzt noch alles angucken. Ah, man kann fürs Webinterface Zertifikate vergeben und sowas wahrscheinlich. Nice. Configure Devices Connected to Edgar. Ne, brauchen wir hier nicht. Clients Runtime. Der Router ist am Start hier. So, Filter. Ja gut, da kann man jetzt ausfüllen, was der haben will. Okay, kann man, kann der für mich Custom DNS Auflösung machen? Nee, gell, das kann er, das kann er nicht. Nee, das geht anscheinend nicht. Was? Use the Filter Tab, Custom Filter Rules. Aha, okay. Kann man da auch Regexen? Jetzt, okay, jetzt bin ich mal gespannt. Okay, also, löst nicht auf. Okay, das wird wahrscheinlich nicht funktionieren. Nee, was? Ne, natürlich nicht. Kann man da Regexen? Guck mal hier, Regex Block Access to Domains Matching. So, und jetzt ist die Frage, ob man da auch was da vorschreiben kann? Ne, das wäre auch zu einfach, wenn das funktioniert. Unblock Access. Gut, ne, so einfach funktioniert das schon mal, ne? Ne, das funktioniert nicht. Okay, Haus. Gibt es schon ein Resultat? Es hat mich jetzt beides noch nicht so hundertprozentig überzeugt. Was? Rewrite? DNS Rewrite. Woah, what the fuck? Was zum? Ach, zu scheiße, wie soll das denn? MonkaX, Alter, was? Okay, das ist Big Brain Time, Alter. Regex. Das ist Big Brain Time, wie kriege ich das hin? Okay, ich will nicht blocken, ich will Custom Auflösung machen. As Filter, DNS Rewrites. Add DNS Rewrite. Okay, Enter, Domain, Name or Wildcard. Ah, das ist cool. Okay, Moment, ich mach mal kurz das wieder weg, was ich hier getrieben hab. Ja, genau. Das ist cool. Ja, genau das will ich haben. Das ist Poggers. Jawoll. Genau das brauch ich. So, und jetzt ist die Frage, kann man das ordnen? Kann ich jetzt zum Beispiel sagen, okay, aber ich will eine Ausnahme, die soll auf 10 oder keine Ahnung, auf 5.5 gehen. Ah, Moment, was mach ich dafür? Mist. Hey, nice. Na, ja, das ist cool. Ja, das ist cool. Okay, das bringt mir was, weil, alles mal zu erklären, warum, ich hab das so, ich hab mir diese Domain irgendwann mal gekauft für 5 Euro im Jahr und die verwende ich lokal. So, und damit das funktioniert, mach ich Let's Encrypt Zertifikate. Das hat der P-Hall doch auch nö. Konntest du nicht machen. Nein, konntest keine Wildcard Weiterleitung machen. Hat er gesagt, ist ungültig. So, ja, aber das ist cool. Genau, also, und ich hol mir dann über Let's Encrypt und DNS, ja, ist das DNS Challenge, hol ich mir für alle meinen lokalen Hosts Zertifikate. So, das heißt, in der Regel ist es so, dass die mehr oder weniger alle auf meiner Kiste mit, wo 90% der Dienste drauf sind, laufen, wo auch eine Reverseproxy drauf ist, der die Zertifikate macht. Aber, manchmal kommt's vor, dass ich doch noch die einen oder anderen Sachen habe. Ja, dann vielleicht einfach nur für Namensauflösungen, nicht mit DNS. Also sprich, standardmäßig soll, die IPs gibt's übrigens nicht, bei mir lokal. Standardmäßig soll alles auf die Kiste mit Reverseproxy gehen, bis auf Ausnahme, das ist genau das, was ich brauch. Das ist echt nice. Das ist schon mal ne Sache, das überzeugt mich. Das ist was, was beispielsweise der DNS in, der Billig-DNS in dem Mikrotik-Router, den ich grad hab, nicht richtig hinbekommt. Der kann zwar auch Regex, aber hat Probleme mit der Reihenfolge hier. Das ist cool. Das gefällt mir. Das sammelt auf jeden Fall schon mal richtig Pluspunkte. Leute, ich Flashbang euch mal kurz. Mal mal das Interface angucken, wie das ausschaut. So, das ist cool. Was haben wir sonst noch? DNS Blocklists kann man auswählen, Cloudlists, DNS Rewrites, Custom Filtering Rules. Okay, damit ist wirklich nur gemeint. Blocked Service. Ah, guck mal, man kann sogar sagen, Alter, ihr piss dich Immigur oder so und Skype und... Ich muss sagen, das UI gefällt mir besser. Die machen auch kein DHCP und so gedönst. Die konzentrieren sich wirklich nur auf DNS-Geschichten, was ich eigentlich ganz gut finde. Oder, ach doch, das macht doch DHCP. Was passiert jetzt? Hä? Ach so, weil es ein Docker ist. Ja, dann bringt mir das ja gar nichts. Aber das ist eine coole Sache. Das ist nice. Das gefällt mir. Ah, und hier hast du so die Standard-DHCP-Verwaltungsgeschichten. Also, DHCP lasse ich auf meinem Router drauf, weil ich will jetzt nicht DHCP freischalten dann überall da hin und dass es funktioniert. Und dann brauch ich auch ein DHCP-Relay und sonstige Geschichten. Nee, nee, das bleibt auf meinem Router drauf. DHCP macht das schon ganz gut. Aber das gefällt mir. Ich muss euch ehrlich sagen, so schwer zu sagen, mein Bauchgefühl irgendwie gefällt mir AdGuard besser. Wer steckt denn da dahinter? Nicht, dass da jetzt die China-Chinesen am Start sind oder so. WeChat. AdGuard Software Limited. Okay, die kommen aus England wahrscheinlich, wenn es die Limited ist. Würde ich mal vermuten. Der AdBlock. Früher war AdBlock Plus das Beste, bis sie dann irgendwann ihren Kram, ich weiß nicht ob die, wurde AdBlock Plus verkauft oder haben die irgendwann angefangen käuflich, sich quasi Ausnahmen käuflich zu machen oder so. Zumindest ist AdBlock Plus total aus der Mode gekommen. Wo kommen die denn her? Limited klingt immer nach England. Oder nach UK muss man ja eigentlich sagen. Kontaktieren sie uns. Moskau. Die Cokomodazins. Okay, ich sag mal, das macht es jetzt nicht unbedingt so viel vertrauenswürdiger. Hatten die nicht auch ein Malware im Addon? Ernsthaft? Ah ne, du meinst AdBlock. Du meinst AdBlock Plus, ne? Ja, die waren ganz, ganz merkwürdig dran. Es gibt einen Addon für Home Assistant, genau, ja das ist richtig, aber das werde ich nicht benutzen. Wieso macht so eine Firma sowas Open Source nutzbar in Docker? Wahrscheinlich um Vertrauen in das Produkt zu schaffen. Weil ganz im Ernst, viele Leute sind heute, zumindest technisch interessierte Leute, und an das hier richtet sich das ja. Die sind misstrauisch, wenn da aus Russland irgendwie einer mit Closed Source DNS Server herkommt, da wäre ich auch misstrauisch. Oder mit Closed Source DNS Manager, das ist ja kein eigener DNS Server wahrscheinlich. Ich weiß nicht, was die verwenden. Ich hoffe mal nicht Bind oder so, oder anbauen vielleicht. Es gibt da zig Varianten. So, und jetzt können wir mal gucken, was die verkaufen, mit was die Geld verdienen. Edgard V., natürlich. Achso, ich hab's ja ausgeschaltet und meine, ja ist gut. Hallo? Okay, was auch immer es macht, ich weiß es nicht. Aber es funktioniert jetzt wieder. So, und natürlich verdienen die da auch wieder mit so komischen, mit komischen Gedönsgeld, wie VPN und sonst was. Ich denke mal, das ist einmal um Vertrauen zu schaffen, dass die Leute das überhaupt verwenden. Deswegen machen die das Open Source und bieten's kostenlos an. Dann haben die zusätzliche andere Services, mit denen man Geld verdienen kann. Und was haben sie sonst noch? Und das Ganze gibt's wohl auch in irgendeiner käuflichen Variante. Edgard DNS, was ist das? Ach, man kann quasi den in DNS direkt verwenden. Okay, ne, das muss auch nicht sein. Was verwenden die für den DNS? Edgard anbauend, ist es denn anbauend? Was? Okay, wir gucken jetzt mal. Github, Edgard. Mich interessiert, was die für einen DNS unten drunter verwenden. Na gut, das hier ist ja nur das Web Interface, da sieht man das dann. Natürlich. Haben die denn eigenen DNS in Go? Kann das sein? Nein, nein, ich meine nicht, welchen DNS-Server der als Upstream verwenden. Ich meine, welchen DNS-Server die intern verwenden. Welche Software verwenden die, um eine DNS-Anfrage zu responden und zu plocken und zu machen? Also DNS-Mast ist es bei PyHole. Die müssen den eigenen DNS haben. Wie soll das Ding mir auf DNS-Anfragen antworten, wenn sie keinen DNS haben? Das muss irgendeine Art von DNS-Software drin sein, damit das funktioniert. So wie auf der Fritzbox auch ein DNS-Server läuft. Das ist komplett, das ist komplett Go, hm? Client, guck mal. Die haben einen eigenen DNS-Server in Go. Find ich eigentlich gar nicht verkehrt. Ich meine, die machen ja nur, nennen wir es mal, nur neueres Standardzeug. Ich könnte mir vorstellen, da ist ein DNS-Server relativ übersichtlich, weil die sind Oldschool-Sachen. Gerade Bind, Bind kann ja alles. Also, ich weiß nicht, hatte schon mal die Aeron musste Bind konfigurieren. Hattet ihr schon mal den Spaß, musste Bind, Bind-Zonen-Konfig so was machen. Was, schau dir mal, Master, ein, du meinst den Branch, eh, Internal-DNS-Forward. Anbaut und Bind sind dann DNS-Server, die lokal bei dir laufen. Ja, im Prinzip, auf der Fritzbox wird wahrscheinlich auch ein DNS-Mask laufen, unter der Haube. Du kannst ja bei dir auch, du trägst deine Fritzbox als DNS ein, die Fritzbox leitet das weiter, aber dieses Weiterleiten, das muss ja irgendeine Software machen. Und, ich weiß nicht, was die Fritzbox, FritzOS, ob die DNS-Mask, was die verwenden, keine Ahnung. Oh, das ist ne gute Idee. Nmap, Nmap-Dingserkennung, ja. Aber das ist echt, das ist echt was Eigenes, guck mal, ich muss, ich muss gar nicht gucken, das ist echt was Eigenes in Go. Ich mein, wir können's mal ausprobieren. Ah ne, ich hab's schon gestoppt. Draht ich's einfach wieder. Okay, da löst er auf. Was muss man machen? Nmap, Minus, ich glaub dir jetzt einfach mal, dass das so stimmt. Und das kann ich mir mal nicht merken, wie diese Analysegeschichte von Nmap funktioniert, also mit welchem Kommando. Ah ne, umgedreht, Minus NSV. Konnte man das einfach so machen? Ne, wie ging das jetzt? Musste man nicht an Minus P machen oder sowas? Ne, äh, ach, zu scheiße. Nmap-Sündags, alter. Es war Minus Klein P, ist es. Aha. Oh, der wird wohl nicht gerne gescannt, hä? Okay, schauen wir mal, was da rauskommt. Okay, ähm, die haben aber echt, wie's aussieht, was komplett Eigenes in Go, was DNS macht. Das finde ich, das macht's mir eigentlich recht sympathisch, weil, wisst ihr, was das Coole daran ist? Wenn die da irgendwie ein wild zusammengefrickeltes Docker-Image hätten, mit sich Sachen nachinstalliert und so. Hier kannst du dir echt den kompletten Sourcecode angucken und das schafft schon ein gewisses Vertrauen in den Laden, dass die keine versteckten Dinger machen. Eigentlich eine gute Idee. Also, ich finde die Idee, das neu zu basteln, so gar nicht mal so schlecht. Okay, der Endwap hat keinen Bock. Nice, nice. Also, ich muss euch ehrlich sagen, also, ich hab ja vor einer Weile schon mal, vor Jahren, mal Pie-Haul am Start gehabt, das fand ich ganz okay, aber Seiten haben dann irgendwann lahm geladen, weil die DNS-Sachen getimautet haben und, äh, da hab ich's wieder abgeschafft, zumal das mit iOS-Apps eh nicht richtig funktioniert. Gerade, ob bei denen dies ankommt. Aber ich muss sagen, Edgard hat zwar prinzipiell die gleichen Probleme, aber hat ein paar zusätzliche Sachen, die ich ziemlich gut finde. Wie zum Beispiel, dass man Wildcard-DNS-Einträge machen kann und sowas. Ähm, also im Web-Interface, ne, dass man das mit DNS-Masken in der Konflikt machen kann, ist mir auch klar. Das finde ich ehrlich gesagt ganz cool. Ich glaub, das probier ich echt mal bei mir lokal aus. Ja, ich glaub, das probier ich echt bei mir mal lokal aus. So, scrollen wir mal runter, was hab ich übersehen? Äh, ziemlich viele, auch hier im Stream. Aber ehrlich gesagt hab ich das hauptsächlich genommen, weil das angenehm zu gucken ist, Plants vs. Zombies Gameplay bei mir auf YouTube. Und, äh, weil ich ein bisschen längeres Gameplay gebraucht hab. Ja, gibt's ja auf iOS nicht, das ist ja das Problem. Nein, hab ich nicht gemacht. Oh, ich bin ja wieder richtig hinten dran. Ja, aber da muss ich selbst die Konflikt machen, da hab ich ja keinen Bock drauf. Ich weiß, dass man das theoretisch machen kann. Ich könnte mir einfach auf meiner Ubuntu-Kiste einen Container mit dem DNS-Server drauf hinstellen und das selbst machen, aber ich find's halt praktischer. Das machst du alle Schaltjahre mal, wenn du jedes Mal neue die Syntax angucken musst, das über ein Webinterface zu machen. Ich denke schon, warum soll das nicht gehen? Das hängt ja vom Dienst ab, nicht vom Raspberry Pi. Das hatten wir ja alles schon. Hatten wir alles schon. Du meinst, du meinst, die chinesische Volkspartei, irgendwie hat's mir das in letzter Zeit angetan, irgendwie China so dumm auszusprechen, obwohl ich das selbst total bescheuert finde und ich Leute auslache, die China sagen anstatt China. Meine neue Lieblingskombination von Wörtern ist die China-Chinesen. Das fand ich echt interessant zu sehen, dass sie das komplett in Go nachprogrammiert haben, die DNS-Geschichte. Hey Max, machst du das Ganze auf einem extra Board? Normalerweise schon, aber zum Testen hab ich das jetzt in meiner Linux-VM hier gemacht. Guck da, hier. Ah, Linux-VM. Linux-VM mit Docker-Stells drauf. Da haben wir ein Prometheus drauf, kann ich mich gar nicht mehr dran erinnern. Und Grafana, was hat man damit mal gemacht? Keine Ahnung. Woah. Alter, was hab ich denn hier für 30 Billiarde, boah. Warum hab ich hier so viele 50 Billiarde Images drauf? Egal, lassen wir alles drauf. Lul. So. Oh, ich hab ein verbotenes Emote verwendet, Leute. Zulul gibt's ja nicht mehr. Ich hab's doch in meinem Emote-Board drinne. Monka Toss Zulul, Alter. Black Gefaceder Total Biscuit. Jetzt hier, Anzeige ist raus. Anzeige ist instant weg. NextDNS, nee, das sagt mir nix. Okay, das, wenn ich so Titel schon lese, okay, das muss ich jetzt mal angucken, was ist das? NextDNS. Wie bloggst du jetzt auf iOS-Geräten? Ja, gar nicht so richtig. Vor allem in YouTube und Twitch nicht, weil die nicht wollen und man auf iOS recht wenig dagegen machen kann. Weil OpenWRT, PFSense und OpenSense, ich hatte jahrelang OpenSense laufen, hab ich jetzt aber nicht mehr am Start. OpenWRT hatte ich auch mal vor Urzeiten mal auf, ich glaub, einem alten TP-Link. Nee, nicht TP-Link. Dingsnet. Wo läuft Lidl oder so, wie das jetzt OpenWRT, wo läuft das besonders gut drauf? Linksys, Linksys mein ich, nicht TP-Link. Linksys, hatte ich das mal auf einem uralten, auf so einem Ding, auf so einem uralten Teil hatte ich das mal laufen vor, vor Jahren. OpenWRT. Da war jetzt glaub ich noch die Idee WRT. Da hab ich lange nichts mal mitgemacht. OpenSense ist tatsächlich echt nice, aber warum ich das umgestellt hab, ist, ich hatte alles auf dieser, da muss ich jetzt das alte Serverraum Video mal zeigen. Nicht das hier auch nicht, das hier auch nicht. Wo ist mein Serverraum? Das ist das neue. Wo ist das alte? Wo ist das alte? Das da, das da mein ich. Genau, ich hatte ja damals alles auf meiner 4HE-Kiste laufen, Internetzugang, Heimautomatisierung, blablabla, und das war mir schlicht und ergreifend, da hatte ich übrigens auch einen TP-Link Access Point, das ist auch schon 3 Jahre her, mittlerweile, nee, 4 Jahre her. Das ist mittlerweile also ein bisschen ausgebaut, aber auf dieser Kiste hatte ich jetzt alles laufen und unter anderem OpenSense für Internetzugang, das war mir aber zu viel SinglePoint of Failure. Ich mein, das war eine ultrafette Kiste, die ist heute noch ziemlich gut. Das ist ein OctaCore Cell Xeon drin, 3x 10TB Platten und so, also das geht durchaus, das war 2007 da, das hat richtig Kohle gekostet, das ist heute immer noch ganz gut das Teil, aber ist jetzt nicht mehr im Einsatz, hat einfach nur unnötig Strom gefressen und ich hab kaum was damit gemacht. Ja, und ich hab das jetzt alles ein bisschen aufgesplittet, also sprich, Internetzugang mache ich über einen Mikrotik-Router, VoIP-Gedöns lasse ich die Fritzbox machen, weil dafür ist die RST ganz gut, ich hab da noch dieses doofes Unity Media Modem davor zwangsweise, schon überlegt, ob ich nicht einfach mal da anrufen soll und sag ich will eigenen Router verwenden, dann hab ich die ganzen Unify Access Points noch dazu für WLAN, also es ist viel weniger SinglePoint of Failure als früher bei mir, deswegen hab ich das alles von dieser, ne das ist kein, das ist ein Gen Pro Gehäuse, kein SilverSong, Gen Pro, das könnte sogar sein, ja das ist es, das ist echt cooles Gehäuse für die, für den, ich muss gucken, dass er das jetzt ein bisschen billiger bekommt, für die Heimanwendung, weil die haben sogar Staubfilter und sowas dabei, also der verwendet jetzt anscheinend keinen, aber das ist tatsächlich ganz gut gemacht, ja und das hab ich alles ein bisschen entzerrt und seitdem lebe ich deutlich entspannter, wenn mal was kaputt geht, ja, ich mein, ich konnte, als ich noch den ganzen Geschiss hier drauf, ich konnte meine Rolle nicht hoch und runter machen, wenn das einfach mal ausgefallen, also ausfallen sollte, ja und drüben Fernseher gucken, DVBC war da auch noch drüben, alles mögliche, wenn das Ding aus war, ging einfach im ganzen Haus gar nichts mehr, das war halt kacke, deswegen hab ich das alles ein bisschen auseinandergezogen, jetzt lebe ich deutlich entspannter, so und ich hab letztens ein Update gemacht zu meinem Serverraum, da war ich aber gerade beim Umbauen, da liegen die ganzen Sachen noch wild rum, die sind jetzt alle eingebaut, ich hab letztens auf Twitter auch mal ein Bild gepostet von, übrigens erstmal der Werkzeug-Flex, erstmal der Werkzeug-Flex, Werkzeug-Flex, ganz unauffällig, ganz unauffällig, einfach mal ein Bild Werkzeug-Flex gemacht, warum ich das jetzt 3 Stunden zeige, keine Ahnung, wahrscheinlich weil ich mein Werkzeug geil finde, keine Ahnung, warum ich das so lange gezeigt hab, so und, ah ne, das sieht man gar nicht, also jetzt siehts nämlich folgendermaßen aus, jetzt ist es viel besser, jetzt siehts so aus, bisschen anders jetzt noch, aber schon besser, hat sich Hetzner gemeldet, ja, ja, ja, aber ich hab noch nicht geantwortet, ich hab es auch erst vor 2 Tagen oder so gesehen, ich war jetzt andere Antworten da sofort drauf, aber ich hatte irgendwie letzte Tage nicht so viel Muße, mich um Büsse-Sachen zu kümmern, ja, so, so schaut es jetzt aus, ich hab es noch ein bisschen umsortiert, ja, ich hab beispielsweise das Drucker-Zubehör hier noch so dran gemacht, also diese Spachtel zum 3D-Drucker abschaben und sowas, hier oben ist auch nicht dieser Raspberry Pi mehr drauf, hier oben ist ein anderer Pi drauf für Octo-Pi und auch mit Gehäuse und die Kamera ist auch nicht mehr drauf, da hab ich jetzt meine einzig verbliebene Uni-Fi-Kamera hingestellt, hier vorne, die das aufnimmt, passt schon aber im Großen und Ganzen, das sieht immer noch so aus, bin ich echt froh, dass ich das umgebaut hab, ich hab mich da 2 Jahre vor gedrückt und hab es letztendlich gemacht, also passt echt gut und diese Werkzeug-Wand zu kaufen war eine super Idee, weil ich hab alles griffbereit jetzt und ich freu mich jedes Mal, wenn ich das aufmach und denk mir, Max, du hast mittlerweile richtig geiles Werkzeug-Sortiment, so, dann erstmal ne Runde vor meiner Werkzeug-Wand Salami gemacht und dann kann ich die Tür wieder zumachen, also deswegen bin ich froh, dass ich die Werkzeug-Wand gebaut hab, das ist immer wieder ein netter Anblick, wenn ich da rein gucke, ja, so, äh, bist du mit dem Drucker zufrieden? Ja, das ist ein, ähm, Anycubic E3 Mega S, der ist relativ günstig, gibt's auch aktuell noch, find ich ok, ja, aber wobei es halt mittlerweile durchaus bessere Drucker gibt, da ist es leistungsmäßig jetzt nach den 3 Jahren oder wie lange ich den hab, 2,5 Jahren oder so, ähm, oder 2 Jahre, 2 Jahre hab ich den glaub ich, ich würd mich mal schlau machen, was es da gibt, also nicht einfach nur kaufen, weil ich den hab, also ich bin für China, China ist das Beste, China sagt ja keiner, China und China auch net, ich kenn eigentlich nur China oder China, ja, Tale Scale, ja, mach ich gleich, die hatten mal extra Geräte extra für WRT ohne WRT Support, hä, ok, nice, weißt du warum manchmal PF Sense bei der CP einfach nicht antwortet, manche, nein, ich würde sagen es liegt vielleicht nicht an PF Sense, sondern je nach deinem Setup, sei es vielleicht ist es eine VM oder sonst wie, vielleicht am Netzwerk, an der Netzwerkanbindung, oder der Broadcast kommt nicht an, oder pff, keine Ahnung, kann ja alles sein, wie schalten die das eigentlich genau für eigene Router frei, kann man das Coax Kabel nicht einfach an zum Beispiel eine Fritzbox klemmen, doch, doch, kannst du machen, aber du hast das Passwort nicht, du brauchst die Zugangsdaten, oder aber die müssen deine Mac freischalten, ich weiß nicht wie die das genau handhaben, ich hab das noch nie gemacht, also es gibt zwei Möglichkeiten, woran das hängen kann, entweder die müssen die Mac freischalten für, ähm, da, Kelmo wolltest du das gerade echt in den Chat posten, ähm, genau, also entweder müssen die Mac von deiner Fritzbox explizit freischalten als das Endgerät, oder du brauchst irgendwelche Custom Zugangsdaten, die du da eintragen musst, deswegen, du kannst das anstöpseln, aber das geht erstmal nicht, äh, das sieht wie irgendein, ich hab keine Ahnung was sein soll, alter wer hat denn das schon wieder geschrieben, das ist ja Poggers, wer hat, wer hat, welcher, welcher Big Brain Mod hat, hat denn die Zusammenfassung für heute geschrieben, das ist ja mal richtig nice, guckt euch das mal an, wir haben jetzt sogar eine Zusammenfassung im Stream, was, was rausgekommen ist, das ist ja excellent, excellent, Stripes war's ja huge, guck mal wir haben so eine ganze Beschreibung was heute rausgekommen ist, richtig Next Level Mods, ja, oh, haben die nicht ursprünglich gesagt, es ist, es ist nichts passiert, dort wo die Rechner standen, hat's nicht gebrannt, haben die doch ursprünglich gesagt, oder, hat sich, hat sich dann wieder, hat sich das dann wieder geändert, Leute soll ich mal in die Mails rein gucken, ob Hetzner noch was geschrieben hat, wenn schon, haben die, haben die nur geschrieben, Max hast du unsere Mails nicht bekommen, weil ich nicht geantwortet hab jetzt die letzten Tage, aber ich bin immer noch scharf drauf was mit Hetznern zu machen, ich guck mal schnell, ob die geantwortet haben, nochmal, wahrscheinlich nicht, hoffe ich mal, weil ansonsten warten die drauf, dass ich antworte, nee, nee, zu Glück nicht, ansonsten eine dumme Werbung, die ESL schreibt, sie will meinen Account löschen, okay, oh, oh, der Shop hat jetzt auch DHL kontaktiert, ich hab euch doch gesagt, ich hab den Shop angeschrieben, wo ich das bestellt hab, wo es so langsam geht, die haben mir grad geantwortet, die haben jetzt auch DHL kontaktiert und DHL hat sie auch hingehalten, DHL hat sie auch hingehalten mit der Antwort, ähm, sie müssen sich erst an Leipzig wenden für mehr Details, alles klar, DHL ist echt CACW, die ESL hat deinen Account gelöscht, okay, nee, bei mir haben sie jetzt angedroht, wenn ich nicht irgendwas mache, wird der gelöscht, das ist mir egal, können den ruhig löschen, okay, dann muss ich morgen unbedingt mit Hetznern antworten, dass sie das nächste Woche sehen, so, also das sollte ich mir jetzt angucken, was ist das, DNS Next, Next DNS Protects you from all kind of security, Schretz, äh, Blocks and Stracks, Pricing, Moment, ist das, ist das DNS, seh ich das richtig, ist das DNS Blocker as a Service, also quasi, irgendeine Software, die bei denen in der Cloud läuft, die für mich DNS Blocking macht, das verwende ich nicht, sowas verwende ich nicht, okay, ich weiß nicht, also, da hab ich ja gar keine Ahnung, was die machen, auf der anderen Seite schlimmer als Google tracken wirds nicht sein, aber was hat es jetzt, was hat es jetzt genau mit Firewall zu tun, ich mein es kann keine Firewall sein, wenn ich dazu erstmal ins Internet dahin muss, ich glaub die haben einfach nur das Wort hingeschrieben, weil es sich cool liest, das hat mit Firewall überhaupt nichts zu tun, steht einfach nur Firewall da, okay, nice, so, was soll ich mir jetzt noch angucken, tailscale, most secure way to use WireGuard, zwei Factor Authentifizierung, okay, das kostet ja was, das ist jetzt VPN as a Service oder wie, oder wie funzt das, ist das zum selbst, ist das zum selbst installieren, oder wie funktioniert das, muss ich dann quasi mich von meinem iPhone zu tailscale verbinden und tailscale verbindet sich zu meinem Server daheim oder wie, das ist mir jetzt nicht so ganz ersichtlich, ja anscheinend, ah nee, ja doch anscheinend, oder sehe ich das richtig, okay, so ganz werde ich aus der Sache nicht schlau, aber VPN as a Service ist ein bisschen schwierig ehrlich gesagt, ich mein, da müsste ich denen ja Zugang zu meiner Infrastruktur geben, dass die das dann verbinden können, hm, wir können uns das ruhig im Stream mal angucken, das muss ich ja nicht zu einem internen Server machen, das reicht ja, wenn ich das zu, ähm, irgendeiner Hetzner 2,50 Euro Kiste mache, können wir das ruhig mal ausprobieren, im Stream, mir sind aber ehrlich gesagt Services immer schon zu spekt, bei denen ich nicht direkt auf den ersten Blick sehe, was die eigentlich genau machen und wie es funktioniert, also Top Level Übersicht, wie es funktioniert und Zero Tier habe ich schon mal gesehen, Zero Tier ist aber doch auch was, was du selbst insta, ach nee Moment, das verwechsel ich jetzt, so, es ist spät Leute, ja, sah so aus, ja, ich habe das demote nur für euch hinzugefügt, was ich unbedingt wollte Chat, oh das, was, DHL Express hat bei mir auch übelst reingeschissen, unsere Post, Hamachi, Alter, gibt's das noch, Moment, das muss ich jetzt mal nachgucken, Hamachi, gibt's das noch, lock me in Hamachi, buy lock me in, what, das kostet jetzt was, egal, das war früher, das war früher der Shit, das hat man, hat man damals, also früher immer verwendet, es war damals aber auch schon äußerst zweifelhaft, was da Sache ist, unsere Poste Sendung wollten sie nicht rausgehen, natürlich zurück und, oh Gott, die sind teilweise echt unfähig, wir sind in Deutschland bei allem, so überbürokratisch ey, Massive Preise, ja, aber richtig Massive waren die, ja ist so, könnt ihr euch so viel lustig machen wie ihr wollt, das juckt mich nicht, wupp old, subs haben wieder den Vorteil, die haben die richtigen Emotes, äh, die haben schon die richtigen Emotes dafür, ah, yes, genau, ich finde diesen Spruch so geil von den Excellent Simply Delivered, es, es, es ist ja weder Excellent noch ist es Simply und noch ist es Delivered, es ist gar nichts von allem dem, was DHL gerade macht, nix, nix davon, oh, ich muss mein, mein, mein, mein Adblock Addon wieder einschalten, äh, findet ihr auch dieses, die Firefox Navigation Übertriebens Paints Champ seit, seit circa 40 Versionen, seit Version glaub 58 oder wo sie das gemacht haben, die ist so, die ist so eklig geworden mittlerweile, ich will nicht sagen, dass die von Chrome viel besser ist, aber ich komm mit diesem, noch ein bisschen klassischerem Menü, in Chrome tatsächlich besser zurecht als mit, als mit diesem, diesem, ich find hier nix, ich find hier wirklich, ah, das ist so, oh, richtig schrecklich, äh, 59 war das, ja, genau, das ist grausam. Firefox, finde ich, hat eh ein bisschen seine Zielgruppe aus den Augen verloren, Firefox waren immer so die Technik, sagen wir mal, so interessierte Leute und die Technikgeeks und, ähm, du konntest auch mit Addons übelst viel abgedrehte Sachen machen und mit glaub 58 auch, mit dieser oder 48, ich weiß nicht, haben sie ja die, die alte Plugin Schnittstelle eingestellt und viele Plugins wurden auch nie wieder geupdatet, der alte, das alte NoScript in der Art und Weise gab es danach nie wieder, mittlerweile gehts wieder halbwegs, einfach alt mal tappen, ach du meinst das hier oben, das, das kenn ich, das kenn ich, das kenn ich, aber das ist trotzdem, das sieht das allein aus, dass das auch schon wieder immer so schwierig zugänglich ist, ja, aber da fehlen glaub ich sogar, ich hab da letztens was gesucht, dass die updaten dieses Menü hier oben nicht mehr, da fehlen sogar einige Sachen, die du nur über die anderen Sachen, äh, über dieses andere Zeug da erreichen kannst. Chrome hat alles weggefickt, ja, äh, sie haben Chrome alles wegficken lassen, muss man auch dazu sagen, die haben sich ein bisschen verzettelt bei Firefox, erstmal mal Firefox US, dann äh, stellen wirs wieder ein, dann sagen wir Thunderbird gehört nicht mehr zu uns, dann doch wieder, dann machen wir irgendwie Mozilla Sync und schaffens wieder ab, dann machen wir irgendwie einen LinkShare Service und schaffen den auch wieder ab, ähm, dann verschlimmt das, wenn wir laufen an irgendwie der Bedienbarkeit von unserem Browser rum, schaffen Browser Plugin Schnittstellen ab, also es ist, ich weiß nicht was Mozilla macht, aber einer der sich auf jeden Fall lohnt, der Mozilla Chef, der bezahlt sich auf jeden Fall jährlich dicke Millionen, also der machts richtig, Firefox sendt, ja, ja seh ich auch so, Mailclines zacken alle, aber Thunderbird geht noch, geht noch ganz gut. Gibts das noch? Okay. Aber die haben was abgeschafft in der Richtung, weil ich kann mich noch dran erinnern, dass es Diskussionen damals bei OwnCloud gab, ob man das nicht supporten soll, dass man quasi Firefox sunken kann zu seinem eigenen Nextcloud Server und, ähm, das wurde dann, da wurde dann irgendwie nie was draus, weil Firefox gesagt hat, gibt es nicht mehr, aber vielleicht ist auch irgendwas anderes, ja, aber trotzdem, ich finde Firefox, ich benutze ja auch hier scheinbar nicht Firefox, äh, ich finde Firefox hat eine Sache, die ist besser als in Chrome und das ist nach wie vor dieses, äh, das da links, äh, das Ding, wie heißt denn das, ähm, die Adressleiste, ne, wie nennt man das, die, Awesome Bar heißt es bei Firefox, jetzt bin ich wieder drauf gekommen, genau, die Awesome Bar heißt das bei denen, das ist immer noch besser als bei Chrome, weil das Ding auch History und sonstige Favoriten und alles möglich durchsucht, da findest du teilweise Seiten, da warst du vor 10 Jahren mal drauf, deswegen, ich, ich hab meine Firefox History über die letzten 5 Rechnergenerationen immer mitgenommen, gerade deswegen. Ich hab nen Lese, Lesezeichen zum Hosten für Nextcloud, hieß das glaub ich, es ist aber auch ein bisschen Paynes Champ und ich verwende es zumindest, ich, ich verwende das zumindest ab und zu für manche, für manche Sachen zum Sünden, ja, aber ich bin zu dem Schluss gekommen, dem ich ewig lang gesucht hab, wie ich Bookmarks sunken kann, dass Bookmarks sunken eigentlich überhaupt nicht wichtig ist, ich verwende die meisten Sachen zu 99% an dem gleichen Rechner daheim, mit dem gleichen Browser und ich brauch überhaupt keine Bookmarks zu sunken, Bookmarks sunken ist eigentlich total offerrated, mobile brauch ich die ganzen Bookmarks nicht, da hab ich andere, ja, also, ich sunke keine Bookmarks mehr, ich hab das mal versucht mit Flocus da, mit dem Nextcloud Ding, ja, wie ist Edgard Pai heute ausgegangen, wir haben jetzt sogar nen Kommando dafür, wie das ausgegangen ist, ich hab aber vergessen wie das Kommando heißt, das Aufruf, das Ausrufezeichen DNS, Chat, ihr müsst mir helfen, wie war das Kommando, ah, yes, DNS Blocker, genau, da steht es wie es ausgegangen ist, also mir hat Edgard tatsächlich ein bisschen besser gefallen, kommt aber auf den Anwendungsfall an, also es gibt sicherlich Konstellationen, dann ist Paihole das bessere, vor allem wenn man schon ne Weile am Laufen hat und damit zufrieden ist, gibt es keinen Grund umzusteigen, so Chat, lass mal ganz kurz gucken, ist da Frazier am Start oder so, ob man kurz wenig hosten kann, Hopp, Visual Studios streamt, das irritiert mich immer, wenn ne IDE am Stream ist auf Twitch, Semper Video, die haben wir das letzte Mal schon gehostet, ich war das letzte Mal nicht im Stream danach, nachdem wir den gehostet haben, hat er den Host überhaupt mitbekommen, der war so vertieft im Erzählen, hat er mitbekommen, nach 15 Minuten, ok, ah verstehe, verstehe, der hat mich nur interessiert, ich hausse den auch ohne, dass da hier großartige, ich hausse da auch Leute ohne, dass die großartige Sache zur Kenntnis nehmen müssen oder so, hat mich nur interessiert, weil der war so vertieft im Erzählen, Martin, ja nice, dass du es hierher geschafft hast, aber ich wollte jetzt gerade aufgehen, haustest du noch mal, heute hauste ich keinen, heute geh ich off, ich bin müde, wobei, zeig mal her, das können wir noch schnell machen, das können wir noch schnell noch machen, aber den hausten wir nochmal, ups, Twitch, was macht er denn heute, weiß jemand wie alt Semper Video ist, das wird mich echt interessieren, bei mir sagen die Leute ja immer, ich höre mich nicht an wie 36, und bei ihm hätte ich von Anfang an gesagt, er ist älter, keine Ahnung, ok, ich höre, wir raiden den jetzt, exzellent, ok Leute, ihr könnt ja mal eine Runde rum spammen, also Leute, wir sehen uns, machts gut, bis denn, see you,", "segments": [{"id": 1, "start": 0.0, "end": 1.96, "text": "Genau."}, {"id": 2, "start": 60.0, "end": 70.6, "text": "So, auf geht's!"}, {"id": 3, "start": 70.6, "end": 80.36, "text": "OBS updaten?"}, {"id": 4, "start": 80.36, "end": 81.36, "text": "Warum?"}, {"id": 5, "start": 81.36, "end": 82.36, "text": "Warum?"}, {"id": 6, "start": 82.36, "end": 83.36, "text": "Warum?"}, {"id": 7, "start": 83.36, "end": 84.36, "text": "Genau, alles gut."}, {"id": 8, "start": 84.36, "end": 92.08, "text": "Wenn ich das updaten, funktioniert wahrscheinlich wieder das Auferlein nicht richtig oder sonst"}, {"id": 9, "start": 92.08, "end": 93.08, "text": "was."}, {"id": 10, "start": 93.08, "end": 95.08, "text": "Gibt schon V26, ja mir doch egal."}, {"id": 11, "start": 95.08, "end": 98.56, "text": "Wer interessiert's?"}, {"id": 12, "start": 98.56, "end": 99.56, "text": "Der Kram funzt."}, {"id": 13, "start": 99.56, "end": 112.2, "text": "Äh, irgendwie hat Twitch nicht gecheckt, dass der Stream on ist, kann das sein?"}, {"id": 14, "start": 112.2, "end": 117.52, "text": "Angeblich sagt Twitch Null Zuschauer."}, {"id": 15, "start": 117.52, "end": 122.36, "text": "Twitch gerade kaputt oder so?"}, {"id": 16, "start": 122.36, "end": 125.64, "text": "Oder braucht Twitch für die Notifications einfach ne Weile?"}, {"id": 17, "start": 125.64, "end": 129.84, "text": "Warten wir's mal ab, bis Twitch das ganze kapiert gecheckt hat."}, {"id": 18, "start": 129.84, "end": 135.28, "text": "Null Zuschauer, ja sagt Twitch, oh jetzt sind's 10, jetzt sind's 10."}, {"id": 19, "start": 135.28, "end": 140.68, "text": "Mal gucken, ich warte, ich warte noch 15, 15, es geht aufwärts, Stonks, Stonkstime Leute."}, {"id": 20, "start": 140.68, "end": 152.32, "text": "Nö, da tut sich bei mir immer noch nix, Twitch braucht ein bisschen, ja das ist nicht so"}, {"id": 21, "start": 152.32, "end": 153.32, "text": "schnell."}, {"id": 22, "start": 153.32, "end": 166.64, "text": "Oh nee, die Yoshi-Musik ist mir auch zu anstrengend, das halt ich nicht, das halt ich nicht durch."}, {"id": 23, "start": 166.64, "end": 175.0, "text": "Turbo 3400, Twitch Prime, Massive IQ für den Chat wieder, Big Brain Subs, ein bisschen"}, {"id": 24, "start": 175.0, "end": 187.4, "text": "Mario Kart Musik, jawoll, exellent, wunderbar, aber Twitch hat's immer noch nicht gecheckt,"}, {"id": 25, "start": 187.4, "end": 198.32, "text": "also wirklich, dass der Stream on ist oder, bei mir ist es jetzt 30 Zuschauer, ich mein"}, {"id": 26, "start": 198.32, "end": 202.72, "text": "es steigt langsam, jetzt geht's wieder rund, Twitch weiß nicht so genau was los ist gerade"}, {"id": 27, "start": 202.72, "end": 203.72, "text": "glaube ich."}, {"id": 28, "start": 203.72, "end": 208.8, "text": "Aber die Discord Notification Leute sind schon wieder am Start oder, wie habt ihr's"}, {"id": 29, "start": 208.8, "end": 209.8, "text": "gefunden?"}, {"id": 30, "start": 209.8, "end": 214.24, "text": "Discord Notification, 42, okay es geht aufwärts Leute, es geht aufwärts."}, {"id": 31, "start": 214.24, "end": 221.96, "text": "Stonkstime Discord, ja dachte ich mir, siehste, nur Discord Notification, Rest ist nicht verschickt."}, {"id": 32, "start": 221.96, "end": 238.88, "text": "Grad kam Twitch, ja wie gesagt, Twitch ist heute lahm im Notification verschicken, bald"}, {"id": 33, "start": 238.88, "end": 249.68, "text": "haben wir 69 Zuschauer, so, also, es müssen relativ viele Twitch Notifications oder sowas"}, {"id": 34, "start": 249.68, "end": 254.52, "text": "an haben, weil normalerweise merke ich das, wenn ich anschalte, ich hab mittlerweile gefühlt"}, {"id": 35, "start": 254.52, "end": 260.56, "text": "100 Zuschauer nach 3 Minuten, also es geht immer übelst los instant, ja, ich merk das"}, {"id": 36, "start": 260.56, "end": 272.04, "text": "sofort, wenn da irgendwie was delayed ist, ja, so, also Leute, der weltweit fortschrittlichste"}, {"id": 37, "start": 272.04, "end": 276.28, "text": "Adblocker, so, so ist fast so, weiß ich nicht, probier mal heute mal aus, soll ich euch mal"}, {"id": 38, "start": 276.28, "end": 282.56, "text": "sagen, big brain time heute gehabt, was hast du vor, wir gucken uns heute mal P-Hole, Pi-Hole,"}, {"id": 39, "start": 282.56, "end": 303.2, "text": "wie auch immer man das genau aussprache, nicht Pi-Hole, okay, ich weiß, wie man das ausspricht."}, {"id": 40, "start": 303.2, "end": 313.08, "text": "So, also, mal gucken, ich bin auch mal gespannt, wie gut das die vor, genau, ich bin mal gespannt,"}, {"id": 41, "start": 313.08, "end": 317.68, "text": "wie einfach die das einem machen, da was ordentliches auszuwählen, ich hab den ganzen Kram vor"}, {"id": 42, "start": 317.68, "end": 323.56, "text": "2, 3 Jahren, ich hab das jetzt mal eine Weile verwendet, aber irgendwie hat es mir da nicht"}, {"id": 43, "start": 323.56, "end": 327.52, "text": "mehr so wirklich zugesagt, zumal ich eh in meinem Browser immer einen Adblocker drin"}, {"id": 44, "start": 327.52, "end": 336.04, "text": "hab und IOS Apps kannst du damit eh nix großartig blocken, zumindest auf die wo es ankommt,"}, {"id": 45, "start": 336.04, "end": 348.04, "text": "ja, ne, der Kommentator 16 Monate, Hyper Subscription, excellent, excellent, Leute, oh, oh, das wollte"}, {"id": 46, "start": 348.04, "end": 361.64, "text": "ich gar nicht drücken, Tainser, 21 Monate, so viel IQ für den Chatterplatz, der fasst"}, {"id": 47, "start": 361.64, "end": 372.44, "text": "der Kopf, komm, ein Sub geht noch, 94% Scam Train, einer muss sich noch scammen lassen,"}, {"id": 48, "start": 372.44, "end": 377.96, "text": "ihr habt 4 Minuten Zeit um euch scammen zu lassen von Twitch, warum kann man damit nichts"}, {"id": 49, "start": 377.96, "end": 388.28, "text": "in IOS Apps blocken, weil die meisten Apps, so wie Twitch und YouTube, mittlerweile relativ"}, {"id": 50, "start": 388.28, "end": 397.56, "text": "clever sind und den Content und die Ads vom gleichen Server ausliefern, das heißt du"}, {"id": 51, "start": 397.56, "end": 403.28, "text": "kannst nicht mehr unterscheiden zwischen Content den du sehen willst und Werbung, deswegen"}, {"id": 52, "start": 403.28, "end": 407.18, "text": "ist es auch für Werbeblocker mittlerweile, die im Browser integriert sind und quasi"}, {"id": 53, "start": 407.18, "end": 411.52, "text": "sogar noch sehen können was auf der Seite passiert, auch unglaublich schwer den Kram"}, {"id": 54, "start": 411.52, "end": 420.44, "text": "noch ordentlich zu blocken, nice, Lego 7 Monate, excellent, Subscription, huge, da Muscle 1,"}, {"id": 55, "start": 420.44, "end": 430.12, "text": "2, 3, danke für die Subs hier, so, deswegen funktioniert das nicht so richtig, auf Android"}, {"id": 56, "start": 430.12, "end": 445.92, "text": "hast du beispielsweise so eine gemoderte YouTube App, also auf Android hast du sowas, die blocken"}, {"id": 57, "start": 445.92, "end": 450.92, "text": "die Werbung auf YouTube, weil es eine modifizierte App ist, du selbst kannst da relativ wenig"}, {"id": 58, "start": 450.92, "end": 461.2, "text": "dran machen bei YouTube und Twitch, wo es was bringt ist, wenn du z.B. im Safari surfst"}, {"id": 59, "start": 461.2, "end": 468.16, "text": "oder wenn du irgendwelche random App Notifications in Apps hast oder so, ja da kann das was"}, {"id": 60, "start": 468.16, "end": 473.28, "text": "bringen, aber für die Dinger wo man das eigentlich zum größten Teil bräuchte ist es schwierig"}, {"id": 61, "start": 473.28, "end": 484.8, "text": "bis nicht mehr möglich, ja, ja und das Problem was ist auf iOS, wie gesagt hier hast du"}, {"id": 62, "start": 484.8, "end": 488.92, "text": "zum Beispiel für Android hast du zum Beispiel eine gemoderte YouTube App, die Werbung filtert,"}, {"id": 63, "start": 488.92, "end": 491.72, "text": "die haben dann quasi so eine Art Adblocker drinnen beziehungsweise Sachen die das remove,"}, {"id": 64, "start": 491.72, "end": 496.92, "text": "ist ok, funktioniert gut, Problem ist unter iOS kannst du das nicht machen, unter iOS"}, {"id": 65, "start": 496.92, "end": 500.2, "text": "kriegst du Sachen prinzipiell nur aus dem Apple Store, gar keine Chance was anderes"}, {"id": 66, "start": 500.2, "end": 503.92, "text": "zu installieren, außer du moddest das ganze Ding, was auch immer schwieriger und immer"}, {"id": 67, "start": 503.92, "end": 509.8, "text": "weniger praktikabel wird und ansonsten sorgen die halt dafür, dadurch dass es nur die offizielle"}, {"id": 68, "start": 509.8, "end": 514.76, "text": "App gibt aus dem offiziellen Store, du hast gelitten, du kannst dagegen auch nichts machen"}, {"id": 69, "start": 514.76, "end": 520.24, "text": "mit irgendeinem Proxy dazwischen oder so, weil das eh alles komplett verschlüsselt ist,"}, {"id": 70, "start": 520.24, "end": 524.0, "text": "also du kannst da auch jetzt wenn du sagst, hey ich geh jetzt über ein Proxy der irgendwie"}, {"id": 71, "start": 524.0, "end": 530.16, "text": "was rausfiltert, geht auch nicht, also die sind da schon relativ clever mittlerweile, bei"}, {"id": 72, "start": 530.16, "end": 535.48, "text": "YouTube, also du hast da eigentlich keine Chance groß was zu blocken auf iOS, auf iOS"}, {"id": 73, "start": 535.48, "end": 539.24, "text": "kauft ihr YouTube Premium, ja ich wollte mir ja mein Indian YouTube Premium kaufen für"}, {"id": 74, "start": 539.24, "end": 549.64, "text": "2 Euro oder so, tatsächlich ja, hatte ich echt vor, barfiver, vielleicht gibt es da"}, {"id": 75, "start": 549.64, "end": 569.48, "text": "YouTube Prime barfiver, ich wollte jetzt für irgendwas noch was sagen, warte mal, das"}, {"id": 76, "start": 569.48, "end": 574.32, "text": "habe ich gerade schon beantwortet mit den iOS Apps, der Kommentator 16 Monate, ich weiß"}, {"id": 77, "start": 574.32, "end": 584.64, "text": "nicht ob ich es gesehen habe, da habe ich schon für den Satz, exzellent, ich habe keine"}, {"id": 78, "start": 584.64, "end": 588.92, "text": "Ahnung ob die unterschiedliche Sachen machen, guck mir das jetzt zum ersten Mal an, Edgard"}, {"id": 79, "start": 588.92, "end": 596.04, "text": "hatte ich noch nie installiert, Piehorn hatte ich mal vor 2 oder 3 Jahren, irgendwie finde"}, {"id": 80, "start": 596.04, "end": 607.16, "text": "ich das nicht, irgendwas wollte ich noch gerade beantworten, na gut also, achso Insomniac"}, {"id": 81, "start": 607.16, "end": 619.0, "text": "Dude fragt hier, wenn ich nur eine Lienungs-VM auf Windows haben will, brauche ich den Vmware"}, {"id": 82, "start": 619.0, "end": 623.6, "text": "Player oder, ja nicht zwangsläufig, es gibt ein paar Varianten, ich meine du kannst den"}, {"id": 83, "start": 623.6, "end": 630.56, "text": "Vmware Player nehmen, den kennst du ja schon, der ist glaube ich komplett kostenlos, dann"}, {"id": 84, "start": 630.56, "end": 634.72, "text": "kannst du den Vmware Player Plus nehmen, der kostet ein bisschen was, du kannst aber auch"}, {"id": 85, "start": 634.72, "end": 639.2, "text": "Vmware Workstation nehmen und ganz ehrlich, ich würde dir empfehlen Vmware Workstation"}, {"id": 86, "start": 639.2, "end": 646.6, "text": "zu nehmen, dadurch dass du damit auch Snapshots und, was war denn der Unterschied, muss ich"}, {"id": 87, "start": 646.6, "end": 658.24, "text": "mal kurz gucken, also es hat schon seinen Sinn, Pembu, haben die da nicht einfach eine, warum"}, {"id": 88, "start": 658.24, "end": 668.32, "text": "hat Vmware nicht einfach einen Vergleich dazwischen, gibt es da irgendeinen Unterschied dazwischen,"}, {"id": 89, "start": 668.32, "end": 682.08, "text": "also ich glaube Snapshots, was zum, was ist das für eine Kackseide, das Ding suche ich,"}, {"id": 90, "start": 682.08, "end": 687.44, "text": "warum ist die Seite schwarz, ich will keine Message liefen, geh mal nicht auf den Sack,"}, {"id": 91, "start": 687.44, "end": 698.08, "text": "zeig mir die Seite, so, Snapshots, ich glaube du kannst keine Snapshots machen mit Vmware"}, {"id": 92, "start": 698.08, "end": 706.56, "text": "oder, Snapshots, genau, Snapshots ist eins der geilsten Sachen, wenn du Vms verwendest,"}, {"id": 93, "start": 706.56, "end": 711.8, "text": "also ich würde dir empfehlen, kauf dir Vmware Workstation, also ich hab mir zum Beispiel"}, {"id": 94, "start": 711.8, "end": 716.36, "text": "den Key hier gekauft, ich mach mal kurz meine Vm an, ich hab mir den Key hier gekauft beim"}, {"id": 95, "start": 716.36, "end": 723.84, "text": "Software Kong, weiß nicht ob es die noch gibt und ob die mittlerweile nicht, oh was ist jetzt"}, {"id": 96, "start": 723.84, "end": 744.72, "text": "los, das ist schlecht Leute, Vm ist kaputt, e ist, warum, Volum, da ist es doch, Vms,"}, {"id": 97, "start": 744.72, "end": 769.78, "text": "oh, Hetzler, ich hab noch nicht Mails geguckt, kennst du Tails, ne, nein, du kannst das Netzwerk"}, {"id": 98, "start": 769.78, "end": 786.44, "text": "Paket nicht filtern, das ist alles verschlüsselt, was ich von diesem Video halte, kann ich nachher"}, {"id": 99, "start": 786.44, "end": 790.72, "text": "gucken, Leute ich hab ein Problem, ich muss jetzt erstmal kurz den, nein, nein, nein,"}, {"id": 100, "start": 790.72, "end": 795.32, "text": "nein, Take ownership bringt nichts, das hab ich schon öfters gehabt, das Problem, was"}, {"id": 101, "start": 795.32, "end": 799.08, "text": "soll überhaupt mit Hetzler los, ne, warum, was soll los gewesen sein, guck mal, ne, das"}, {"id": 102, "start": 799.08, "end": 804.52, "text": "ist kaputt, das ist ein Bug, den hab ich schon ein paarmal gehabt, wenn du das anklickst,"}, {"id": 103, "start": 804.52, "end": 812.92, "text": "dann mag der nicht, Take ownership geht auch nicht, das ist irgendwie abgekackt, so, wie"}, {"id": 104, "start": 812.92, "end": 818.24, "text": "krieg ich denn das jetzt gefixt, ohne dass ich mein PC neu starten muss, vor allem ja,"}, {"id": 105, "start": 818.24, "end": 824.48, "text": "kann ich das hier neu starten, vor allem Workstation Server, jawoll, also das muss ich als Admin"}, {"id": 106, "start": 824.48, "end": 836.04, "text": "machen, service, Admin, excellent, highly secret password, Forever Workstation Server, restart,"}, {"id": 107, "start": 836.04, "end": 843.72, "text": "ne, ne, ne, Hyper V bringt dir nichts in dem Fall, nicht wenn du das so benutzen willst,"}, {"id": 108, "start": 843.72, "end": 852.28, "text": "wie ich das hier, wie ich das verwende, mit easy hin und her switchen und resize und Geräte"}, {"id": 109, "start": 852.28, "end": 856.28, "text": "vorwarten und sonst was, Hyper V kann das zwar alles irgendwie auch ein bisschen, aber"}, {"id": 110, "start": 856.28, "end": 864.52, "text": "bei weitem nicht so komfortabel, wie das mit Forever Workstation funktioniert, Virtual"}, {"id": 111, "start": 864.52, "end": 872.84, "text": "Box kannst du auch nehmen, geht das jetzt, Postchamp, alter was ist das für ein kack"}, {"id": 112, "start": 872.84, "end": 885.44, "text": "ok, wir googeln mal danach, Forever Workstation, Take ownership failed, unable to take ownership"}, {"id": 113, "start": 885.44, "end": 899.76, "text": "of my VMs, also ich kann neu starten, dann gehts, das weiß ich, was, lock directory,"}, {"id": 114, "start": 899.76, "end": 912.24, "text": "ok, ok, Moment, Moment, Postchamp, Postchamp, lock directory, also, das heißt ich gehe"}, {"id": 115, "start": 912.24, "end": 930.0, "text": "jetzt, e, VMs, guck mal da, der Porgas ist gelockt, wenn ich das lösche ist es dann"}, {"id": 116, "start": 930.0, "end": 943.28, "text": "so, ich hoffe ich machs jetzt nicht kaputt, loggers, loggers ist das, operation loggers"}, {"id": 117, "start": 943.28, "end": 968.08, "text": "ist das, hey, jetzt weiß ich auch wie man den Kram fixt, easy, dazu kann ich nur sagen,"}, {"id": 118, "start": 968.08, "end": 979.56, "text": "easy, was hab ich denn hier, hab ich test oder hab ich max, ich kann mir meinen account nicht"}, {"id": 119, "start": 979.56, "end": 984.96, "text": "merken, ich lock mich so selten ein, ich hab das Ding immer als Standby, also gut, jetzt"}, {"id": 120, "start": 984.96, "end": 987.84, "text": "zum eigentlichen Thema zurück, was du machen kannst, wenn du das so verwenden willst, wie"}, {"id": 121, "start": 987.84, "end": 993.2, "text": "ich hier mit Desktop switchen und easy Linux und Builders, Build skalieren und sowas alles"}, {"id": 122, "start": 993.2, "end": 999.04, "text": "schön sag ich, ich würde dir vor allem Workstation empfehlen, du kannst das mit Player auch machen,"}, {"id": 123, "start": 999.04, "end": 1003.36, "text": "du kannst das auch mit VirtualBox oder meinetwegen auch mit Hyper-V oder sonst was machen, aber"}, {"id": 124, "start": 1003.36, "end": 1008.12, "text": "ganz ehrlich mit Workstation ist das am geschmeidigsten und die Möglichkeit Snapshots zu machen"}, {"id": 125, "start": 1008.12, "end": 1012.28, "text": "ist eines der besten Features überhaupt, Max grüßt, danke schön für vier Monate"}, {"id": 126, "start": 1012.28, "end": 1020.48, "text": "Subscriptions, HiIQ für den Chat wieder und ich hab mir das gekauft, das ist das was"}, {"id": 127, "start": 1020.48, "end": 1025.64, "text": "ich zeigen wollte, ich hab mir das hier gekauft, Vagrant ist auch ganz cool hier, aber Vagrant"}, {"id": 128, "start": 1025.64, "end": 1031.96, "text": "ist quasi nur ein Verskriptungsding für VirtualBox, so ich hab mir das hier gekauft, da kriegste"}, {"id": 129, "start": 1031.96, "end": 1041.64, "text": "für 22.90 hoch vertrauenswürdige Seite Software Kong, die aber anscheinend nicht geradet wurde"}, {"id": 130, "start": 1041.64, "end": 1045.88, "text": "von der Polizei oder sowas, was da letztens mit Lizenzen waren, das heißt, die scheinen"}, {"id": 131, "start": 1045.88, "end": 1053.2, "text": "wohl legit zu sein, da kannst du 22.90 für eine Workstation Pro 16 Lizenz bezahlen, easy,"}, {"id": 132, "start": 1053.2, "end": 1065.48, "text": "ansonsten bezahlst du glaube ich 160 Euro oder sowas oder 200, ja, Software kaufen 24,"}, {"id": 133, "start": 1065.48, "end": 1070.76, "text": "ok das klingt auch äußerst vertrauenserweckend, ok 200 Euro, ja also kauft ihr das bei Software"}, {"id": 134, "start": 1070.76, "end": 1080.4, "text": "Kong, ja dass man Keys irgendwo anders findet ist mir auch bewusst, aber dafür mache ich"}, {"id": 135, "start": 1080.4, "end": 1086.56, "text": "hier im Stream keine Werbung und kann euch natürlich nur abraten das zu machen, das ist"}, {"id": 136, "start": 1086.56, "end": 1096.96, "text": "mir sonst zu Hacker-Man hier, genau wie ich das mache, ich hab halt Windows als Host und"}, {"id": 137, "start": 1096.96, "end": 1101.48, "text": "Windows mit drei Desktops und halt hier auf dem zweiten Desktop immer meine Linux-VM,"}, {"id": 138, "start": 1101.48, "end": 1107.88, "text": "auch mit 1, 2, 3, 4, 5, 6, 7, 8, 9 theoretisch verschiedenen Desktops, so machen wir den"}, {"id": 139, "start": 1107.88, "end": 1113.36, "text": "ganzen Shit mal zu, das brauchen wir ja nicht, das ist halt sehr praktisch, geht der Preischamp"}, {"id": 140, "start": 1113.36, "end": 1125.08, "text": "eigentlich noch, kurz checken, läuft der noch, sieht so aus, alles klar, easy, der Preischamp"}, {"id": 141, "start": 1125.08, "end": 1132.36, "text": "hat übrigens, weil mich heute einer gefragt hat, ca. 5000 Besucher am Tag, ist gar nicht"}, {"id": 142, "start": 1132.36, "end": 1146.92, "text": "so schlecht, sind die off, ok, ok Leute, toll, bevor wir anfangen, DHL ist so scheiße, ich"}, {"id": 143, "start": 1146.92, "end": 1152.8, "text": "hab mein DHL ist scheiße Videojahr gelöscht, so ich mach mal hier auf, ich lad den Kram"}, {"id": 144, "start": 1152.8, "end": 1159.08, "text": "hier in der VM, wobei, nee, ich lad nicht in der VM runter, warum, die sind so kacke,"}, {"id": 145, "start": 1159.08, "end": 1170.68, "text": "hier guck mal, aber ich hab jetzt was unternommen dagegen, also ich hab ja, so sieht mein Sendeverfolgungslauf"}, {"id": 146, "start": 1170.68, "end": 1177.36, "text": "aus, das liegt seit dem 18., ist es einen Tag vorher, ist es vom Flieger aus den USA"}, {"id": 147, "start": 1177.36, "end": 1183.48, "text": "eingekommen, und seit dann, Zollevent, Zollevent, Zollevent, was übrigens immer nur eine Minute"}, {"id": 148, "start": 1183.48, "end": 1186.8, "text": "dauert, ich weiß gar nicht, was die da ehrlich gesagt machen wollen in einer Minute, Paket"}, {"id": 149, "start": 1186.8, "end": 1191.84, "text": "einmal 360 in die Luft kreisel, kreisel, snipen und dann wieder hinlegen oder so, keine Ahnung,"}, {"id": 150, "start": 1191.84, "end": 1196.28, "text": "immer genau eine Minute braucht das hier, exquisite, oh die haben so zwei Minuten gebraucht, hier"}, {"id": 151, "start": 1196.28, "end": 1201.6, "text": "brauchen sie zwei, oh die sind schneller geworden, guck mal, Prozessoptimierung bei DHL, von zwei"}, {"id": 152, "start": 1201.6, "end": 1216.44, "text": "Minuten, eine Effizienzsteigerung um 100%, exzellent Stonks, so, und so ist es halt, ja,"}, {"id": 153, "start": 1216.44, "end": 1218.72, "text": "und also was ich jetzt schon gemacht hab, ich hab bei denen angerufen, die hatten gar"}, {"id": 154, "start": 1218.72, "end": 1225.12, "text": "keinen Plan, was Sache ist, ich sollte Dokumente hochladen, ich hab Dokumente hochgeladen,"}, {"id": 155, "start": 1225.12, "end": 1230.2, "text": "nichts passiert, Dokumente hochgeladen, hab ich hier schon, hab ich den Mail bekommen,"}, {"id": 156, "start": 1230.2, "end": 1236.12, "text": "ich soll nochmal Dokumente hochladen, okay, dann hat eine von DHL angerufen und hat gesagt,"}, {"id": 157, "start": 1236.12, "end": 1240.04, "text": "ja ich hab eigentlich auch keine Ahnung, was los ist, aber sie können die Dokumente ja"}, {"id": 158, "start": 1240.04, "end": 1246.72, "text": "nochmal hochladen, und dann hoffen, das hatte ich wörtwörtlich gesagt, ja, und dann hoffen,"}, {"id": 159, "start": 1246.72, "end": 1250.64, "text": "dass es jetzt funktioniert, sie sieht da auch nichts, sie weiß auch nichts, sie hat"}, {"id": 160, "start": 1250.64, "end": 1252.8, "text": "eigentlich gesagt, gar keine Ahnung, sie weiß noch nicht mal, von welchem Absender"}, {"id": 161, "start": 1252.8, "end": 1257.6, "text": "das Paket kommt, kein Witz jetzt, die wusste nicht, um welches Paket es geht, die ruft"}, {"id": 162, "start": 1257.6, "end": 1266.76, "text": "mich von DHL an, okay, und da hab ich die Dokumente, hab ich dann nochmal hochgeladen,"}, {"id": 163, "start": 1266.76, "end": 1270.04, "text": "also ich hab unten unten eine Mail geschickt davor noch, also ich hab eine Mail geschickt,"}, {"id": 164, "start": 1270.04, "end": 1274.68, "text": "zweimal Dokumente durchgeladen, zweimal telefoniert mit den Dudes, wohlgemerkt, ich hab 35 Euro"}, {"id": 165, "start": 1274.68, "end": 1280.0, "text": "bezahlt für Zoll und extra Zollhandling für DHL, also da ist Zoll schon dabei, ich hab"}, {"id": 166, "start": 1280.0, "end": 1283.36, "text": "extra bezahlt, dass die sich darum kümmern, ich musste 5 mal selbst aktiv werden, es passiert"}, {"id": 167, "start": 1283.36, "end": 1288.68, "text": "immer noch nix, so, und was ich heute gemacht hab, ich hatte heute keinen Bock mehr, ähm,"}, {"id": 168, "start": 1288.68, "end": 1292.32, "text": "weil bei DHL tut sich nichts, ich hab einmal noch ein bisschen wütend getwittert, meisten"}, {"id": 169, "start": 1292.32, "end": 1295.68, "text": "und die wissen, dass sie Scheiße gebaut haben, weil normalerweise beschwichtigt einen"}, {"id": 170, "start": 1295.68, "end": 1303.16, "text": "sonst die Twittersupportleute immer, so, und was ich heute gemacht hab, ich hab an Hersteller"}, {"id": 171, "start": 1303.16, "end": 1309.4, "text": "geschrieben oder an Shop geschrieben, ein zweites Mal, so nach dem Motto, dass es very"}, {"id": 172, "start": 1309.4, "end": 1314.96, "text": "sad ist, was DHL macht, und, ähm, sollten die es irgendwann mal hinkriegen, die mir"}, {"id": 173, "start": 1314.96, "end": 1323.2, "text": "diese, diese, dieses Shipment, äh, zuzustellen, und es wagen extra Geld zu fordern für ihren"}, {"id": 174, "start": 1323.2, "end": 1327.24, "text": "Service, noch oben drauf, was ich schon bezahlt hab, dann werd ich die Annahme verweigern"}, {"id": 175, "start": 1327.24, "end": 1331.44, "text": "und dann geht das direkt wieder an euch zurück, ähm, und ich hab ihnen auch dabei geschrieben,"}, {"id": 176, "start": 1331.44, "end": 1337.4, "text": "ich weiß, ihr könnt nix dafür, eure, ich, ich hab ja das Shipment-Paperwork gesehen"}, {"id": 177, "start": 1337.4, "end": 1342.4, "text": "von denen, also alles super, äh, steht auch alles drauf eigentlich, was die missen müssen,"}, {"id": 178, "start": 1342.4, "end": 1346.04, "text": "alles, alles top, ich weiß, ihr könnt nix dafür, tut mir leid, aber was soll ich machen,"}, {"id": 179, "start": 1346.04, "end": 1351.76, "text": "ich will, da, ich bezahl dafür nix extra, so, und das hat dem Shop überhaupt nicht gefallen,"}, {"id": 180, "start": 1351.76, "end": 1356.24, "text": "dass ich gesagt hab, ich verweigere die Annahme, excellent simply delivered, genau, das hat"}, {"id": 181, "start": 1356.24, "end": 1360.36, "text": "dem Shop nicht gefallen, als ich gesagt hab, ich werd die Annahme verweigern, ver-verständlich,"}, {"id": 182, "start": 1360.36, "end": 1367.36, "text": "ja, nicht, dass ich dann irgendwie nur einen Paypal-Case oder so aufmache, und, ähm, darauf"}, {"id": 183, "start": 1367.36, "end": 1372.24, "text": "hin hat der Shop dann geschrieben, äh, äh, dass sie sich mit DHL, dass, dass sie DHL"}, {"id": 184, "start": 1372.24, "end": 1378.88, "text": "nochmal kontaktieren, mal gucken, mal gucken, Pains-Champ, richtiger Pains-Champ, so, ich"}, {"id": 185, "start": 1378.88, "end": 1388.12, "text": "lad schon mal hier den ganzen Kram runter, äh, Leute, Achtung, Flashbang, boah, install,"}, {"id": 186, "start": 1388.12, "end": 1396.12, "text": "ja, ich will einfach, calculate, ach, Moment, Moment, Moment, man musste das doch in nem,"}, {"id": 187, "start": 1396.12, "end": 1401.68, "text": "ach, guck mal, man kann es, man kann es, stimmt, es gibt nen Docker-Install, hat, hat Edgard"}, {"id": 188, "start": 1401.68, "end": 1405.48, "text": "auch nen Docker-Install? Hab ich noch nie installiert, hab ich gar nicht gesehen, wie"}, {"id": 189, "start": 1405.48, "end": 1414.56, "text": "das funktioniert, download, ne, das kann man downloaden, wow, wow, äh, Windows-Access,"}, {"id": 190, "start": 1414.56, "end": 1431.8, "text": "äh, ja, by the way, by the way, soll ich euch, soll ich euch, soll ich euch nochmal"}, {"id": 191, "start": 1431.8, "end": 1436.76, "text": "das beste, beste Feature vom Windows-Defender zeigen? Ich hab mich ja, ich hab mich ja letztens"}, {"id": 192, "start": 1436.76, "end": 1440.4, "text": "schon drüber ausgelassen, wie lustig ich das finde, dass wir Windows-Defender mittlerweile"}, {"id": 193, "start": 1440.4, "end": 1443.68, "text": "auf vielen Linux-Servern auf meiner Arbeit haben, by the way, ich weiß, dass es nicht"}, {"id": 194, "start": 1443.68, "end": 1453.76, "text": "Windows-Defender heißt, sondern es heißt Microsoft Advanced Threat Protection. So,"}, {"id": 195, "start": 1453.76, "end": 1458.32, "text": "und äh, wir haben jetzt ne neue Version bei uns installiert von dem Windows-Defender,"}, {"id": 196, "start": 1458.32, "end": 1463.44, "text": "also der sau viel CPU-Zeit frisst und sonst was, aber jetzt kommt der Hit, die haben so"}, {"id": 197, "start": 1463.44, "end": 1469.92, "text": "ne, ähm, Report-Funktion im Windows-Defender jetzt, die könnt ihr analysieren quasi das"}, {"id": 198, "start": 1469.92, "end": 1476.6, "text": "System, auf dem sie laufen und, äh, schicken dann einen Report, ob das System gefährdet"}, {"id": 199, "start": 1476.6, "end": 1481.48, "text": "ist oder nicht und das ist die typische Windows-Scheiße, auf die ich schon seit Jahren keinen Bock"}, {"id": 200, "start": 1481.48, "end": 1486.64, "text": "mehr hab, ne, nur im Enterprise-Umfeld jetzt, weil das erste, was dieser Windows, nein,"}, {"id": 201, "start": 1486.64, "end": 1491.96, "text": "der Microsoft, die Microsoft Advanced Threat Protection, was die gemacht hat, ah ne, es"}, {"id": 202, "start": 1491.96, "end": 1495.96, "text": "heißt Microsoft Defender for Endpoint jetzt, ach, scheiß drauf, weil, wisst ihr, wisst"}, {"id": 203, "start": 1495.96, "end": 1500.12, "text": "ihr, was das Ding gemacht hat? Das Ding hat erstmal auf nem stinknormalen Samba Linux"}, {"id": 204, "start": 1500.12, "end": 1516.68, "text": "Fileserver 130 Exploits reported. 130 Exploits angeblich auf unseren Linux-Servern. Ne, ne,"}, {"id": 205, "start": 1516.68, "end": 1524.4, "text": "nicht 1, 2, 3, nein, 130. So, und wenn man sich dann anguckt, was das Ding anmeckert,"}, {"id": 206, "start": 1524.4, "end": 1530.0, "text": "ist komplett lächerlich, ja, irgendein Dienst hat verschiedene Dateien geöffnet gleichzeitig."}, {"id": 207, "start": 1530.0, "end": 1537.72, "text": "Ja, no shit, das ist ein Fileserver, da passiert sowas manchmal. Das soll vorkommen, hab ich"}, {"id": 208, "start": 1537.72, "end": 1542.0, "text": "gehört, auf nem Fileserver, dass mehrere Dateien gleich, mehrere Filehandles gleichzeitig"}, {"id": 209, "start": 1542.0, "end": 1547.52, "text": "offen sind. Mag sein, ja. Der Fehler ist wahrscheinlich bitte Windows-Fileserver installieren, dann"}, {"id": 210, "start": 1547.52, "end": 1556.28, "text": "gehts besser. Und ich hab dann im, ich sag jetzt mal im Ticket drauf geantwortet, das"}, {"id": 211, "start": 1556.28, "end": 1561.24, "text": "fand aber glaub ich dann manche Leute nicht so witzig, hab ich geschrieben, der einzige"}, {"id": 212, "start": 1561.24, "end": 1566.76, "text": "Exploit auf den Servern ist der Windows Defender, aber, ich glaub, wenn es die falschen Leute"}, {"id": 213, "start": 1566.76, "end": 1571.96, "text": "sind, die finden das nicht so witzig. Weil die haben sich ja Microsoft krasse, teure"}, {"id": 214, "start": 1571.96, "end": 1578.08, "text": "Microsoft Consultants gekauft, die viel Geld kosten und gesagt haben, wir brauchen Windows"}, {"id": 215, "start": 1578.08, "end": 1601.88, "text": "Defender. Okay, also was, AtGuardHome brauch ich. Wie? What the fuck? Gibt's da nen ISO,"}, {"id": 216, "start": 1601.88, "end": 1619.16, "text": "gibt's da nen Docker-Repo irgendwie offiziell? Hier auf den GitHub. Docs, ah, exquisite,"}, {"id": 217, "start": 1619.16, "end": 1636.6, "text": "da, das brauch ich. Ja, dann installier ich den in irgendeiner, ja, dann ist doch einfach,"}, {"id": 218, "start": 1636.6, "end": 1641.64, "text": "dann brauch ich doch nicht mal ne neue VM, dann kann ich einfach hier, kann ich hier"}, {"id": 219, "start": 1641.64, "end": 1644.92, "text": "einfach zwei Container starten und wir können's ausprobieren, dann muss ich gar keine extra"}, {"id": 220, "start": 1644.92, "end": 1652.48, "text": "VM machen. Okay, probier das Ganze mal aus. Bring's mal kurz nochmal schnell hier drüber"}, {"id": 221, "start": 1652.48, "end": 1656.88, "text": "scrollen, ob ich irgendwas übersehen hab. Ja, hab ich gesehen. Genau, das ist der Grund,"}, {"id": 222, "start": 1656.88, "end": 1664.64, "text": "warum ich immer Buchstaben kopiere da. Mal gucken, was ich dazu sage. Weiß gar nicht,"}, {"id": 223, "start": 1664.64, "end": 1669.64, "text": "was ich dazu erzählt hab. Weiß gar nicht, was ich dazu erzählt hab. Weiß gar nicht,"}, {"id": 224, "start": 1669.64, "end": 1674.64, "text": "was ich dazu erzählt hab. Weiß gar nicht, was ich dazu erzählt hab. Weiß gar nicht,"}, {"id": 225, "start": 1674.64, "end": 1703.48, "text": "was ich dazu erzählt hab. Wir haben ein Ausrufezeichen, was wir heute machen. Wahnsinn. Hab ich schon"}, {"id": 226, "start": 1703.48, "end": 1714.64, "text": "mal gesehen, hab ich noch nicht ausprobiert, ne. Ja, ist bei mir auch grad so, ne. Weiß"}, {"id": 227, "start": 1714.64, "end": 1724.64, "text": "nicht, was die für Schmerzen haben. Ja, so sieht's aus. Übrigens, soll ich euch nochmal"}, {"id": 228, "start": 1724.64, "end": 1734.08, "text": "richtige Big Brain Action erzählen. Und zwar, wir haben einen Dienstleister, oder man könnte"}, {"id": 229, "start": 1734.08, "end": 1742.12, "text": "heute sagen, einen, was gibt's denn, Dienstleistung as a Service? Gibt's sowas? Halt, ein Anbieter,"}, {"id": 230, "start": 1742.12, "end": 1753.2, "text": "der für uns einen Spamfilter-Service bereitstellt auf der Arbeit. Service as a Service, ja."}, {"id": 231, "start": 1753.2, "end": 1766.08, "text": "Und die haben so ein bisschen komische Philosophie. Und zwar, ich suche mir mal kurz den Dogger-Container"}, {"id": 232, "start": 1766.08, "end": 1772.16, "text": "hier raus und dann ist gut, Dogger install, da steht's doch schon, also. So, und die haben"}, {"id": 233, "start": 1772.16, "end": 1778.8, "text": "so ein bisschen komische Philosophie. Und zwar, sind das so groß alles, Alter, weil ich die"}, {"id": 234, "start": 1778.8, "end": 1783.4, "text": "für so fett gestellt hab. Okay, genau, das erzähl ich jetzt nochmal schnell. Also, die"}, {"id": 235, "start": 1783.4, "end": 1790.72, "text": "haben ein bisschen komische Philosophie. Und zwar, wenn die Mails als Spam erkennen, dann,"}, {"id": 236, "start": 1790.72, "end": 1795.68, "text": "und also normalerweise ist das so, du kriegst dann als Benutzer die Möglichkeit, das freizugeben."}, {"id": 237, "start": 1795.68, "end": 1800.64, "text": "Das ist dann halt so ganz standardmäßig, ne. Dann klickst du da drauf und kannst das"}, {"id": 238, "start": 1800.64, "end": 1808.56, "text": "freigeben. Aber, wir haben ja ein paar Service-Mail-Adressen-Accounts, wo öfters mal Spam landet, unter anderem"}, {"id": 239, "start": 1808.56, "end": 1812.96, "text": "mal auch ab und zu mal wichtige Sachen kommen. Das heißt, man hat sich jetzt überlegt,"}, {"id": 240, "start": 1812.96, "end": 1821.04, "text": "okay, unser Spam-Anbieter sagt, der hat nämlich keinerlei API-Zugriff auf diese Sache mit"}, {"id": 241, "start": 1821.04, "end": 1824.96, "text": "Spam-Filter. Also, du kannst da nicht über den Skript einfach an bestimmte E-Mail-Adressen"}, {"id": 242, "start": 1824.96, "end": 1828.76, "text": "einfach alles freigeben. Ich weiß nicht, warum wir so einen komischen Anbieter verwenden,"}, {"id": 243, "start": 1828.76, "end": 1832.16, "text": "der die Basics-Sachen nicht kann, der die Basics nicht gemacht hat, aber so einen Anbieter"}, {"id": 244, "start": 1832.16, "end": 1838.44, "text": "haben wir. Und jetzt kommt Big-Brain-Time. Sie haben sich jetzt gedacht, okay, entweder"}, {"id": 245, "start": 1838.44, "end": 1847.12, "text": "wechseln wir den Anbieter oder unser 24-7-Support soll sich einfach einmal in der Stunde einloggen"}, {"id": 246, "start": 1847.12, "end": 1853.04, "text": "im Web-Interface vom Spam-Anbieter und auf alles freigeben klicken. Ich meine, so kann"}, {"id": 247, "start": 1853.04, "end": 1856.68, "text": "man die Leute natürlich auch beschäftigen. Man muss dazu sagen, das ist natürlich keine"}, {"id": 248, "start": 1856.68, "end": 1859.88, "text": "sonderlich beliebte Arbeit, aber es ist anscheinend billiger, als sich einen neuen Spam-Anbieter"}, {"id": 249, "start": 1859.88, "end": 1868.88, "text": "zu suchen. So, und jetzt kommt Absolute-Magic-Big-Brain-Moment. Wir haben uns heute überlegt, ob man"}, {"id": 250, "start": 1868.88, "end": 1872.72, "text": "den Kram nicht irgendwie automatisieren kann. Ist nicht so einfach. Wie gesagt, die haben"}, {"id": 251, "start": 1872.72, "end": 1879.48, "text": "keine API und das Web-Interface sieht aus wie ein altes Bootstrap und ist auch nicht"}, {"id": 252, "start": 1879.48, "end": 1889.2, "text": "schön zu klicken. Aber das größte Problem dabei ist, das Web-Interface hat Zwei-Faktor-Authentifizierung"}, {"id": 253, "start": 1889.2, "end": 1896.24, "text": "und zwar für Zwei-Faktor-Authentifizierung nur global für alles an oder aus. Also sprich,"}, {"id": 254, "start": 1896.24, "end": 1900.24, "text": "man kann nicht sagen, hey, wir haben einen Service-Account, in Anführungsstrichen, für"}, {"id": 255, "start": 1900.24, "end": 1904.72, "text": "den starten wir Zwei-Faktor-Authentifizierung aus. Nein, du kannst bloß für alle Zwei-Faktor-Authentifizierung"}, {"id": 256, "start": 1904.72, "end": 1909.2, "text": "ausschalten oder für alle Zwei-Faktor-Authentifizierung an. Wie gesagt, frag mich nicht, warum wir"}, {"id": 257, "start": 1909.2, "end": 1917.12, "text": "so einen Kack-Anbieter haben, aber es ist so. Und, ähm, oh ein Ricksle, das ist toll."}, {"id": 258, "start": 1917.12, "end": 1925.44, "text": "Wir sind nicht die Einzigen, die sowas machen anscheinend. Das sagt man richtig. Ups, ähm,"}, {"id": 259, "start": 1925.44, "end": 1930.76, "text": "so also richtig, richtig, richtig dumm, richtig dumm. So, und was ich jetzt gemacht hab heute"}, {"id": 260, "start": 1930.76, "end": 1938.32, "text": "mit einem Kollegen zusammen ist, wir haben gesagt, okay, die, die, äh, debaten uns"}, {"id": 261, "start": 1938.32, "end": 1947.52, "text": "nicht und wisst ihr, was wir, was wir gemacht haben? Richtig, richtiger Big-Prain-Moment."}, {"id": 262, "start": 1947.52, "end": 1971.52, "text": "Ich glaub, das da. Äh, ich hab ne, ich hab ne Zwei-Faktor-Authentifizierungs-Library"}, {"id": 263, "start": 1971.52, "end": 1978.88, "text": "gefunden für.NET. Ähm, die hab ich für einen Anfang verwendet, aber die ging nicht."}, {"id": 264, "start": 1978.88, "end": 1982.16, "text": "Bin ich jetzt blöd? Wo ist es denn? Wo ist denn die Library, die ich verwendet hab?"}, {"id": 265, "start": 1982.16, "end": 1987.12, "text": "Hm. Wir tun jetzt einfach mal so, als hätt ich die verwendet. Die hab ich probiert, die"}, {"id": 266, "start": 1987.12, "end": 1991.12, "text": "ging nicht. So, und was ich jetzt, also, was ich jetzt gemacht hab, ist folgendes. Und"}, {"id": 267, "start": 1991.12, "end": 1996.16, "text": "ich finde, das ist echt Massive-Big-Prain-Move. Also, wir haben einen neuen Account gemacht"}, {"id": 268, "start": 1996.16, "end": 2003.84, "text": "beim Spam-Anbieter mit nem sicheren Passwort. Und wir haben uns eingeloggt, bis man dann"}, {"id": 269, "start": 2003.84, "end": 2011.4, "text": "Zwei-Faktor-Authentifizierungen, äh, einrichten musste. So, dann hab ich folgendes gemacht."}, {"id": 270, "start": 2011.4, "end": 2017.56, "text": "Aus dem QR-Code für die Zwei-Faktor-Authentifizierungen, den QR-Code kannst du einscannen und QR-Code"}, {"id": 271, "start": 2017.56, "end": 2025.0, "text": "analysieren lassen. Aus dem QR-Code hab ich, ähm, das, das Secret rausgeholt. Ich weiß,"}, {"id": 272, "start": 2025.0, "end": 2028.24, "text": "ihr wisst hier, wie diese Authentificator-Sachen überhaupt funktionieren, oder soll ich das"}, {"id": 273, "start": 2028.24, "end": 2033.68, "text": "mal erklären? Das ist total simpel. Also, egal, ob's Microsoft Authentificator oder"}, {"id": 274, "start": 2033.68, "end": 2038.36, "text": "Google Authentificator ist, die funktionieren alle ähnlich. So. Zumindest, zumindest hab"}, {"id": 275, "start": 2038.36, "end": 2044.96, "text": "ich den, das Secret aus dem QR-Code rausgeholt. Und das Secret hab ich mir dann gespeichert."}, {"id": 276, "start": 2044.96, "end": 2050.88, "text": "Und mit einer.NET-Library generiere ich mir quasi ein eigenes Authentificator, ein eigenes"}, {"id": 277, "start": 2050.88, "end": 2055.32, "text": "Token, was immer gültig ist, wenn ich mich einloggen will. Das heißt, ich kann Zwei-Faktor-Authentifizierungen"}, {"id": 278, "start": 2055.32, "end": 2059.44, "text": "machen aus einem Programm, der auch den Browser fernsteuert, ohne dass ich eine App brauche."}, {"id": 279, "start": 2059.44, "end": 2064.32, "text": "Also, ich erklär euch mal, wie das Ganze funktioniert. Also, wenn ihr so eine Zwei-Faktor-Authentifizierungen,"}, {"id": 280, "start": 2064.32, "end": 2069.72, "text": "äh, ich brauch mal dieses Bild, was der Typ eben hatte, mit dem QR-Code. Genau, also"}, {"id": 281, "start": 2069.72, "end": 2073.84, "text": "das kennt ihr ja. Wenn ihr euch bei irgendeinem Anbieter, wenn ihr anklickt, Zwei-Faktor-Authentifizierungen"}, {"id": 282, "start": 2073.84, "end": 2077.68, "text": "anklicken, also wenn ihr bei irgendeinem Anbieter Zwei-Faktor-Authentifizierungen anklickt,"}, {"id": 283, "start": 2077.68, "end": 2086.52, "text": "dann kriegt ihr ja meistens so ein QR-Code. Manche, die richtig oldschool sind, haben"}, {"id": 284, "start": 2086.52, "end": 2097.08, "text": "noch den Key direkt als, äh, als Zahl oder als Text auf der Seite. Also, entweder bekommt"}, {"id": 285, "start": 2097.08, "end": 2100.8, "text": "ihr, wenn ihr Zwei-Faktor-Authentifizierungen für einen Authenticator einrichtet, dann"}, {"id": 286, "start": 2100.8, "end": 2105.92, "text": "kriegt ihr entweder so ein QR-Code, oder aber unter dem QR-Code steht nochmal so ein geheimer"}, {"id": 287, "start": 2105.92, "end": 2112.36, "text": "Schlüssel. So, was jetzt, wie diese ganze, ähm, Time-Based, Time-Based, wie heißt der"}, {"id": 288, "start": 2112.36, "end": 2127.32, "text": "nochmal? Time, what the fuck, was ist das? Time. Genau, also wie diese ganzen OTP, Time-Based,"}, {"id": 289, "start": 2127.32, "end": 2134.84, "text": "was heißt das? Time-Based, Time-Based One-Time Password. Also, das ist das, was alle Authentificator"}, {"id": 290, "start": 2134.84, "end": 2141.72, "text": "verwenden. Also, es ist jetzt egal, ob Microsoft-Authentificator, Google-Authentificator, Blizzard-Battle-Net-Authentificator,"}, {"id": 291, "start": 2141.72, "end": 2146.44, "text": "die einzigen, die was eigenes machen, ist Steam, die funktionieren tatsächlich nur"}, {"id": 292, "start": 2146.44, "end": 2149.92, "text": "mit dem Steam-Steam-Authentificator, aber es gibt genug mittlerweile, die mehrere Sachen"}, {"id": 293, "start": 2149.92, "end": 2157.56, "text": "können, aber in der Regel verwenden die dieses T-OTP. So, und was die Dinger machen, ist"}, {"id": 294, "start": 2157.56, "end": 2165.4, "text": "ganz einfach. Wenn ihr diesen Code scannt, passiert Folgendes. In diesem Code steht ein,"}, {"id": 295, "start": 2165.4, "end": 2172.6, "text": "ich weiß nicht, 10-stelliger, 10-stelliger Base 32, fragt mich nicht, warum es Base 32"}, {"id": 296, "start": 2172.6, "end": 2180.2, "text": "ist, äh, ein irgendwie 10-stelliger Base 32-encodeder geheimer Schlüssel drin. So, also stellt"}, {"id": 297, "start": 2180.2, "end": 2186.28, "text": "euch vor, da steht ein Passwort drinne in diesem QR-Code. So, dieses Passwort merkt"}, {"id": 298, "start": 2186.28, "end": 2192.32, "text": "sich eure Authentificator-App und dieses Passwort merkt sich der Service. Und das einzige, was"}, {"id": 299, "start": 2192.32, "end": 2198.2, "text": "die Authentificator-App macht, ist, anhand der aktuellen Uhrzeit, UTC meistens, also"}, {"id": 300, "start": 2198.2, "end": 2203.0, "text": "dass man nicht mit Zeitzonen Probleme hat, anhand dieses geheimen Schlüssels und der"}, {"id": 301, "start": 2203.0, "end": 2209.84, "text": "aktuellen Uhrzeit berechnet das einen Talken für euch. Deswegen sind diese Talken auch"}, {"id": 302, "start": 2209.84, "end": 2214.84, "text": "plus 30 Sekunden gültig oder eine Minute oder 15 Sekunden, je nachdem, wie das eingestellt"}, {"id": 303, "start": 2214.84, "end": 2221.38, "text": "ist und dann wechselt das. Und das machen einfach, auf beiden Seiten passiert das. Also"}, {"id": 304, "start": 2221.38, "end": 2226.6, "text": "eure Authentificator-App macht das und der Service macht das. Ihr habt ja euch einmal"}, {"id": 305, "start": 2226.6, "end": 2231.88, "text": "gesyncht mit einem geheimen Passwort über diesen QR-Code und dementsprechend können"}, {"id": 306, "start": 2231.88, "end": 2237.2, "text": "eure Authentificator-App und das Service unabhängig voneinander mit Hilfe der aktuellen Uhrzeit"}, {"id": 307, "start": 2237.2, "end": 2242.56, "text": "das gleiche Talken berechnen. Und dann gebt ihr das Talken ein, der Service macht im Hintergrund"}, {"id": 308, "start": 2242.56, "end": 2248.6, "text": "das gleiche und wenn die Talken gleich sind, dann geht's weiter. Also die Dinge sind wirklich"}, {"id": 309, "start": 2248.6, "end": 2256.92, "text": "unglaublich simpel, wie diese Authentificator-Dinger auch funktionieren. Habt ihr das verstanden?"}, {"id": 310, "start": 2256.92, "end": 2261.4, "text": "Also das ist nichts kompliziertes. Und das kann man natürlich auch machen, wenn man"}, {"id": 311, "start": 2261.4, "end": 2266.8, "text": "sich nämlich das initiales Secret, was in diesem QR-Code steht, wenn man das eben nicht"}, {"id": 312, "start": 2266.8, "end": 2271.68, "text": "einfach nur scannt und in der Authentificator-App macht, sondern wenn man sich das initiales"}, {"id": 313, "start": 2271.68, "end": 2280.44, "text": "Secret einfach kopiert und in eine OTP-Implementierung steckt, die im Prinzip das gleiche macht,"}, {"id": 314, "start": 2280.44, "end": 2287.48, "text": "was die Authentificator-App macht, kann man ohne Probleme kleinzeitig so ein Passwort"}, {"id": 315, "start": 2287.48, "end": 2293.48, "text": "berechnen. Heißt, wenn man die Uhrzeit umstellt und das Internet ausschaltet, funktioniert"}, {"id": 316, "start": 2293.48, "end": 2297.52, "text": "es nicht mehr richtig. Also das Internet kannst du ausschalten, das ist erstmal egal, aber"}, {"id": 317, "start": 2297.52, "end": 2303.64, "text": "wenn die Uhrzeit nicht stimmt, dann geht das nicht mehr. Es ist aber die Frage, welche"}, {"id": 318, "start": 2303.64, "end": 2308.84, "text": "Uhrzeit das Ding nimmt. Ob es die lokale Uhrzeit vom System nimmt, ob das selbst eine NTP-Implementierung"}, {"id": 319, "start": 2308.84, "end": 2314.2, "text": "hat oder sonst was. Aber ja, wenn deine Uhrzeit nicht stimmt, dann geht das nicht mehr. Ist"}, {"id": 320, "start": 2314.2, "end": 2319.36, "text": "übrigens, by the way, das ist bei ganz vielen Authentifizierungs-Sachen so. Zertifikate"}, {"id": 321, "start": 2319.36, "end": 2324.2, "text": "sind nicht mehr gültig, SSH-Logins gehen nicht mehr, wenn eure Zertifizierung, eure Uhrzeit"}, {"id": 322, "start": 2324.2, "end": 2328.12, "text": "nicht stimmt. Also Uhrzeit ist generell bei vielen Security-Sachen ganz wichtiger Faktor."}, {"id": 323, "start": 2328.12, "end": 2336.36, "text": "Genau, du kannst auch mit Keypass das machen, wobei halt die Sache die ist. Ich mache das"}, {"id": 324, "start": 2336.36, "end": 2340.76, "text": "nicht im Keypass, weil es heißt ja nicht umsonst Zwei-Faktor-Authentifizierung. Der Sinn ist"}, {"id": 325, "start": 2340.76, "end": 2344.32, "text": "ja, dass man die Information nicht auf dem gleichen Gerät hat. Also sprich, wenn ich"}, {"id": 326, "start": 2344.32, "end": 2351.0, "text": "einen Passwort-Manager habe und darin meine und mein OTP-Secret speichere und meine Passwörter,"}, {"id": 327, "start": 2351.0, "end": 2357.12, "text": "dann hat man einen Angreifer, der meine Passwörter und meine Keypass-Datenbank aus dem RAM abgreift,"}, {"id": 328, "start": 2357.12, "end": 2363.76, "text": "beides um sich einzuloggen. Also dann kann man sich OTP auch sparen. Deswegen, das heißt"}, {"id": 329, "start": 2363.76, "end": 2367.48, "text": "Zwei-Faktor. Also entweder man macht das über einen USB-Stick, über ein Handy oder"}, {"id": 330, "start": 2367.48, "end": 2370.32, "text": "was auch immer, aber auf dem gleichen Rechner ist schon ein bisschen doof. Ist natürlich"}, {"id": 331, "start": 2370.32, "end": 2375.24, "text": "angenehmer, aber ist ein bisschen doof. So, so funktioniert das. Und was wir jetzt gemacht"}, {"id": 332, "start": 2375.24, "end": 2385.68, "text": "haben ist, ich habe das hier genommen. Das ist ein Chrome. Ein Headless-Chrome, also"}, {"id": 333, "start": 2385.68, "end": 2394.08, "text": "ein Chrome ohne das er angezeigt wird. Im Hintergrund generiere ich mir einen OTP-Token und das heißt,"}, {"id": 334, "start": 2394.08, "end": 2400.04, "text": "ich kann mich jetzt bei diesem Spam-Einbieter mit einem Headless-Browser einloggen, inklusive"}, {"id": 335, "start": 2400.04, "end": 2404.12, "text": "Zwei-Faktor-Authentifizierung, weil ich es so tue, als hätte ich eine Authentifizierte"}, {"id": 336, "start": 2404.12, "end": 2410.04, "text": "App und kann dann dort Clicks im Web-Interface simulieren, die Spam-Mails freigibt und alles"}, {"id": 337, "start": 2410.04, "end": 2418.76, "text": "nur das, weil der Anbieter keine API haben will. Übrigens wisst ihr was die geilste"}, {"id": 338, "start": 2418.76, "end": 2427.88, "text": "Ausrede des Anbieters ist, warum sie keine API haben? Die ist so bescheuert. Die Ausrede"}, {"id": 339, "start": 2427.88, "end": 2434.08, "text": "des Anbieters ist es, wir haben intern dazu einen Feature-Request offen. Das ist so nicht"}, {"id": 340, "start": 2434.08, "end": 2438.32, "text": "mal eine Ausrede, das ist einfach nur, das ist einfach nur was darauf gesagt, das ist"}, {"id": 341, "start": 2438.32, "end": 2446.24, "text": "noch nicht mal eine Ausrede, das ist keine Antwort, das ist nix. So nach dem Motto, so"}, {"id": 342, "start": 2446.24, "end": 2450.36, "text": "nach dem Motto, Feuerwehr bei mir brennt, könnt ihr vorbeikommen, wir haben intern"}, {"id": 343, "start": 2450.36, "end": 2459.52, "text": "dazu einen Feature-Request eröffnet. Also, ich weiß nicht. Bescheuerte Antwort, äh."}, {"id": 344, "start": 2459.52, "end": 2468.32, "text": "Ok, jetzt installieren wir uns mal ein Pie-Hole im Docker-Stels. Wisst ihr was ich, wisst"}, {"id": 345, "start": 2468.32, "end": 2474.16, "text": "ihr was für Anleitungen ich mag? Anleitungen, wo nicht alles auf einmal dasteht, sondern"}, {"id": 346, "start": 2474.16, "end": 2478.76, "text": "Quickstart, wo dann aber auch einfach nur ein Docker-Commando dasteht. Gut, ich meine,"}, {"id": 347, "start": 2478.76, "end": 2494.92, "text": "ich kann es im Docker-Compose machen, das ist auch in Ordnung. DNS-Stels. So, Set-Paste,"}, {"id": 348, "start": 2494.92, "end": 2505.2, "text": "zack, bumm. So, kann man das so stehen lassen? 53, 67, 80, 443, ich hoffe mal das ist frei."}, {"id": 349, "start": 2505.2, "end": 2524.08, "text": "Time Zone, America, Chicago, nein. Europa? Berlin sind wir. Volumes, äh, etc. CDN-Spa."}, {"id": 350, "start": 2524.08, "end": 2532.76, "text": "Das sollte der anlegen. Äh, ich will keinen DHCP machen, wie, äh, wie mache ich einen"}, {"id": 351, "start": 2532.76, "end": 2541.36, "text": "DHCP aus, der soll keinen DHCP machen. Ok, das kommt weg, das kommt weg, ich will bloß"}, {"id": 352, "start": 2541.36, "end": 2547.96, "text": "nicht, dass das Ding bei mir lokal anfängt, DHCP zu machen, ich glaube es geht los. Stimmt,"}, {"id": 353, "start": 2547.96, "end": 2554.16, "text": "Port 67 entfernen, hast du recht, ist eigentlich noch besser. Recommended, but not required,"}, {"id": 354, "start": 2554.16, "end": 2559.2, "text": "ok, ich mache Port 67 weg, hast du recht, ist eigentlich die beste, beste Variante,"}, {"id": 355, "start": 2559.2, "end": 2588.56, "text": "ok. Docker-Compose, ab. Ok, schauen wir mal. Oh, jetzt? Ist jetzt gestartet? Ok, das ist"}, {"id": 356, "start": 2588.56, "end": 2595.92, "text": "gut. Docker-PS, sagt mir Port 80, ok, das heißt, ich kann jetzt auf localhost Port 80?"}, {"id": 357, "start": 2595.92, "end": 2608.48, "text": "Ah, jetzt exquisite, da ist es. Achtung, Flashbang, ah ne, flasht gar nicht so sehr. Ach so, ah,"}, {"id": 358, "start": 2608.48, "end": 2620.64, "text": "jetzt atmen, doch Flashbang. Ok, nice, Login, äh, Piehole, Default, Login, wahrscheinlich"}, {"id": 359, "start": 2620.64, "end": 2644.76, "text": "Piehole oder so. Steht im Log? Da, das hätte man jetzt auch ein bisschen, das hätte man"}, {"id": 360, "start": 2644.76, "end": 2651.0, "text": "auch ein bisschen prominenter schreiben können, oder? Ich mein, das liest doch keiner. Das"}, {"id": 361, "start": 2651.0, "end": 2655.48, "text": "hätte man das nicht auch ein fett mal ausprinden können, fünfmal hintereinander mit rot oder"}, {"id": 362, "start": 2655.48, "end": 2664.04, "text": "so. Ok, Login, excellent, da sind wir. Total Queries, ich hab meine Bedenken, dass da überhaupt"}, {"id": 363, "start": 2664.04, "end": 2670.84, "text": "irgendwas gequereert wurde. Ok, ich hab das vor Jahren mal auf gehabt, das wichtigste,"}, {"id": 364, "start": 2670.84, "end": 2682.04, "text": "hat das ein Dark Theme? Hat das ein Dark Theme, ich brauch ein Dark Theme. Wo, wo ist das Dark"}, {"id": 365, "start": 2682.04, "end": 2707.56, "text": "Theme? Ja, hat es, Styling. Was, Peter? Rechts? Ach da, ok. Ah, yes, so ist das schön, jawoll,"}, {"id": 366, "start": 2707.56, "end": 2718.4, "text": "so ist das. Ja, da kann ich mit leben. Auch keine Cacona-Einheiten eingestellt, alles gut."}, {"id": 367, "start": 2718.4, "end": 2724.88, "text": "So ist das nice, so ist das schön. So, jetzt muss ich mich erstmal ein bisschen, beste"}, {"id": 368, "start": 2724.88, "end": 2727.64, "text": "Hostname überhaupt, jetzt muss ich mich erstmal ein bisschen zurechtfinden. Wie gesagt, ich"}, {"id": 369, "start": 2727.64, "end": 2732.52, "text": "hatte das vor zwei, drei Jahren mal am Start, ich hab da glaube ich damals gar nichts großartig"}, {"id": 370, "start": 2732.52, "end": 2739.48, "text": "konfiguriert, außer ein paar Blocklisten irgendwie hinzugefügt. Ich weiß aber gar"}, {"id": 371, "start": 2739.48, "end": 2747.16, "text": "nicht mehr, wie das genau ging. Ok, lasst uns mal das ganze Kram angucken. Dashboard-Querylog,"}, {"id": 372, "start": 2747.16, "end": 2753.04, "text": "passt. Long-Temp-Data, gutes, mehr oder weniger egal, Whiteless-Blacklist, ok, da kann man"}, {"id": 373, "start": 2753.04, "end": 2760.6, "text": "Hardcoded Sachen reinschreiben, Group-Management ist für mich jetzt erstmal relativ egal."}, {"id": 374, "start": 2760.6, "end": 2776.8, "text": "Lasst mich mal raten, ist das hier für DHCP? Ah, hier kann man spezielle Sachen auflösen"}, {"id": 375, "start": 2776.8, "end": 2791.44, "text": "lassen, ok, das ist nicht verkehrt. Hier gibt's List, ok, Tools, man musste irgendwie die"}, {"id": 376, "start": 2791.44, "end": 2801.76, "text": "List noch updaten, das war zumindest das letzte Mal so. Update, ahja, genau. Ok, ich glaub"}, {"id": 377, "start": 2801.76, "end": 2805.88, "text": "das war's, ich glaub mehr musste man, mehr muss man nicht machen. Zeigt mal hier, was"}, {"id": 378, "start": 2805.88, "end": 2821.52, "text": "stehen hier noch im Getting Started drin? Jaja, blablabla, ne, ich glaub mehr musste"}, {"id": 379, "start": 2821.52, "end": 2832.16, "text": "man gar nicht machen, ne? Gut, ich mein mehr kann man ja auch nicht wirklich machen. Ah,"}, {"id": 380, "start": 2832.16, "end": 2840.04, "text": "Ad-Lists hier, please use, stimmt das war früher in den Settings. Ok, standardmäßig"}, {"id": 381, "start": 2840.04, "end": 2848.0, "text": "gibt's nur diese Liste hier anscheinend, Steve, das Steve, alles klar. So Leute, jetzt um"}, {"id": 382, "start": 2848.0, "end": 2854.88, "text": "das zu testen, brauchen wir mal ne Seite mit richtig fett Werbung und ich mach mal ne Ad-Blocker"}, {"id": 383, "start": 2854.88, "end": 2863.8, "text": "aus, also, new private window, ich glaub da ist der Ad-Blocker sogar schon aus, build.de"}, {"id": 384, "start": 2863.8, "end": 2891.08, "text": "hat viel. Ok, wie sieht das standardmäßig aus? Oh, was? Ernsthaft? Die wollen mir"}, {"id": 385, "start": 2891.08, "end": 2900.6, "text": "ernsthaft erzählen? Ich darf kein Private Mode anmachen? Spiegel, ok. Ich brauch Werbung,"}, {"id": 386, "start": 2900.6, "end": 2910.68, "text": "ich brauch Werbung Leute. Accept. Ok Leute, ich hab keine Werbung, ist vielleicht mein"}, {"id": 387, "start": 2910.68, "end": 2917.44, "text": "Ad-Blocker, ah ne, ah, yes, perfekt, alles voller Werbung. So sieht das Internet also"}, {"id": 388, "start": 2917.44, "end": 2933.76, "text": "normalerweise aus, aha, aha. Was blocker.com testen sie ihren Ad-Blocker? Da krieg ich"}, {"id": 389, "start": 2933.76, "end": 2940.0, "text": "bestimmt Porn-Popups jetzt, ok, also das passt schon, Spiegel testen wir jetzt mal. Neue"}, {"id": 390, "start": 2940.0, "end": 2954.08, "text": "Liebe in Hanau, IP-Tracking, so, so. So viel verdient ein Arzt in Hanau, wunderbar. Meine"}, {"id": 391, "start": 2954.08, "end": 2960.92, "text": "IP sagt wahrscheinlich ich bin in Hanau. Dänemark impft schneller als wir, wie schaffen die"}, {"id": 392, "start": 2960.92, "end": 2968.76, "text": "das? Die verkacken es halt nicht total. Dänemark gibt im Vergleich zu uns auch richtig viel"}, {"id": 393, "start": 2968.76, "end": 2974.4, "text": "Kohle aus für ihr Gesundheitssystem und wollen das das gut ist. Ich hab mal nen dänischen"}, {"id": 394, "start": 2974.4, "end": 2983.16, "text": "Arbeitskollege, für die war das schon absolutes Drama, wenn die quasi nicht in ihrem Quetschendorf"}, {"id": 395, "start": 2983.16, "end": 2990.52, "text": "ein Krankenhaus haben. Du musst vielleicht noch, was muss ich machen? Du musst vielleicht"}, {"id": 396, "start": 2990.52, "end": 3002.8, "text": "noch Traffic von allen Interfaces zulassen. Probier ich mal. Settings, DNS. An die Upstream"}, {"id": 397, "start": 3002.8, "end": 3010.16, "text": "DNS. Custom DNS Server. Ah das ist gut, da kann ich auch meinen eigenen DNS eintragen,"}, {"id": 398, "start": 3010.16, "end": 3021.64, "text": "kanns weiterleiten, ist auch gut. Listen on all Interfaces. Machen wir einfach mal. Ok,"}, {"id": 399, "start": 3021.64, "end": 3029.68, "text": "dann stellen wir das mal um. Edit. Gucken ob dann die Werbung weg ist. Ich hab ewig"}, {"id": 400, "start": 3029.68, "end": 3036.8, "text": "kein DNS mehr von Hand eingestellt, wie macht man das überhaupt hier? Device, IPv4 Settings"}, {"id": 401, "start": 3036.8, "end": 3066.12, "text": "wahrscheinlich. Aha. DNS Server. Localhost. Hallo? Ich darf nix eintragen. Äh? Was"}, {"id": 402, "start": 3066.12, "end": 3091.44, "text": "soll der denn den Hausname für den DNS auflösen? Hausdatei zum Beispiel. So, und jetzt ist"}, {"id": 403, "start": 3091.44, "end": 3096.84, "text": "die Werbung noch da oder ist die Werbung weg? Chat, was mein dir? Werbung noch da oder Werbung"}, {"id": 404, "start": 3096.84, "end": 3122.44, "text": "weg? Ich muss wahrscheinlich den Cognito Modus nochmal zumachen, nochmal neu aufmachen."}, {"id": 405, "start": 3122.44, "end": 3142.32, "text": "Ok, DNS Auflösung geht nicht. DNS Auflösung geht nicht. Warum? Das muss vergleichbar"}, {"id": 406, "start": 3142.32, "end": 3169.2, "text": "sein. Ich hab mich verschrieben. Hast du überhaupt nen Upstream DNS eingestellt? Ja, es ist standardmäßig"}, {"id": 407, "start": 3169.2, "end": 3189.04, "text": "ist der Google DNS eingestellt. Ok, vielleicht muss ich das Pyhontas den Pion mal neu starten."}, {"id": 408, "start": 3189.04, "end": 3207.44, "text": "Wir können mal gucken, was hat denn das Ding? Was hat denn das Ding standardmäßig für"}, {"id": 409, "start": 3207.44, "end": 3218.72, "text": "Netzwerkmodus? Das forwarded, ne? Blocked Fastport, das können wir mal gucken, das ist ne gute"}, {"id": 410, "start": 3218.72, "end": 3244.56, "text": "Idee. Port 53. Schauen wir mal. Docker Proxy, nö. Ok, ich sag euch was wir machen. Mal gucken,"}, {"id": 411, "start": 3244.56, "end": 3262.4, "text": "da hilft das was. Schauen, mal gucken, ob es jetzt funktioniert. Aber es sieht schon erstmal"}, {"id": 412, "start": 3262.4, "end": 3266.96, "text": "gut aus. Ich mein, ich kann es auch auf dem Raspberry installieren oder in der eigenen"}, {"id": 413, "start": 3266.96, "end": 3276.6, "text": "OEM mal gucken, aber das müsste noch so eigentlich auch funktionieren. Ich könnte einfach Network"}, {"id": 414, "start": 3276.6, "end": 3284.8, "text": "Mode auf Dings machen auf Host, dann gibt es auf keinen Fall mehr Probleme. So, dick."}, {"id": 415, "start": 3284.8, "end": 3299.2, "text": "Ah, yes, jetzt funktioniert es. Ah, lock? Doch, lock-lost geht. Ok, gut, Auflösung"}, {"id": 416, "start": 3299.2, "end": 3317.92, "text": "und Funst, alles gut. Öffnen, Spiegel.de. Ach, nicht Siegel. So, und Werbung weg oder"}, {"id": 417, "start": 3317.92, "end": 3331.56, "text": "Werbung nicht weg? Nope, Werbung nicht weg. Ok, vielleicht hat er das dann doch irgendwie"}, {"id": 418, "start": 3331.56, "end": 3356.52, "text": "noch gecashed oder so. Ah, guck mal, hier ist weg jetzt. Nimm DBL, ich will erstmal"}, {"id": 419, "start": 3356.52, "end": 3362.36, "text": "gucken, wie der Kram out of the box funktioniert. Hab ich hier noch irgendeinen Adblocker an?"}, {"id": 420, "start": 3362.36, "end": 3367.24, "text": "Die Bild sagt uns das ja. Ach, nee, genau. Plugins? Nee, ich hab keinen Adblocker an."}, {"id": 421, "start": 3367.24, "end": 3375.64, "text": "Extensions? Ich hab noch nicht mal einen Adblocker überhaupt installiert im Chrome. Ok, das"}, {"id": 422, "start": 3375.64, "end": 3381.72, "text": "lag wohl irgendwie daran. Dann refreshen wir Firefox nochmal. Wir refreshen Firefox nochmal"}, {"id": 423, "start": 3381.72, "end": 3394.68, "text": "ohne Cache und lassen das neu machen. Spiegel und da ist Werbung, alles klar. Moment, Inspect"}, {"id": 424, "start": 3394.68, "end": 3409.72, "text": "Element, Network. Wo war denn der Knopf? Disable Cache, bester Knopf. Warum funktioniert"}, {"id": 425, "start": 3409.72, "end": 3437.72, "text": "es im Firefox nicht?"}, {"id": 426, "start": 3437.72, "end": 3449.2, "text": "Und Firefox DNS? Oh, hat der? Ach, ernsthaft? Boah, meine Güte, Firefox. Was muss ich ausstellen?"}, {"id": 427, "start": 3449.2, "end": 3452.88, "text": "Alter, damit hab ich mich ja noch nie beschäftigt. Wahrscheinlich hier irgendwie. Ach so, man"}, {"id": 428, "start": 3452.88, "end": 3475.24, "text": "hat DNS. Nein, hat er nicht. Hat er nicht. Warum geht das im Firefox jetzt nicht? Das"}, {"id": 429, "start": 3475.24, "end": 3485.88, "text": "leuchtet mir nicht an. In meinem Chrome funktioniert es ja. Ok, äh, nee. Ok, wir machen jetzt"}, {"id": 430, "start": 3485.88, "end": 3496.36, "text": "mal was anderes. Ich stell mal hier ein, dass der komplett... Du kannst es nicht explizit"}, {"id": 431, "start": 3496.36, "end": 3501.72, "text": "einstellen. Oder kannst du im Firefox explizit einen DNS einstellen. Kannst da normalerweise"}, {"id": 432, "start": 3501.72, "end": 3509.24, "text": "Proxys und sowas einstellen, aber DNS kannst du da normalerweise nicht einstellen. Nee."}, {"id": 433, "start": 3509.24, "end": 3528.16, "text": "Na, da bin ich jetzt mal gespannt. Ghost Rider, wo geht denn das? Also, wenn ich da ist, ist"}, {"id": 434, "start": 3528.16, "end": 3534.32, "text": "der ganz schön fail. Also, mich würd's wundern, wenn man den DNS einstellen kann. Also, du"}, {"id": 435, "start": 3534.32, "end": 3541.0, "text": "kannst Proxys und so geduldens immer einstellen, aber DNS eigentlich... Ja, über About-Config"}, {"id": 436, "start": 3541.0, "end": 3547.48, "text": "vielleicht. Aber warum geht denn das jetzt nicht? Ok, ich hab ne andere Idee. Hast du"}, {"id": 437, "start": 3547.48, "end": 3552.28, "text": "die DNS-Tabelle gelöscht aus dem Cache vom Host? Ja, muss ich ja. Der Chrome hat ja auch"}, {"id": 438, "start": 3552.28, "end": 3558.72, "text": "keine Ads. Ich prob... Wir machen jetzt was anderes. Wir machen jetzt was anderes. Ich"}, {"id": 439, "start": 3558.72, "end": 3566.28, "text": "stell den Docker-Container so ein, dass der am Host-Interface lauscht. Ich weiß es aber"}, {"id": 440, "start": 3566.28, "end": 3572.12, "text": "aus dem Kopf gar nicht mehr, glaub ich es ging. Ich glaub so. Network, Host und da kann"}, {"id": 441, "start": 3572.12, "end": 3577.6, "text": "ich von meinem Windows-Rechner aus drauf. Der Netzaufer HTTPS geht ja, das will ich"}, {"id": 442, "start": 3577.6, "end": 3588.6, "text": "ja grade nicht machen. So. Docker, Compose, Down. Ok, ne, wie ging das? War's Network-Mode?"}, {"id": 443, "start": 3588.6, "end": 3598.52, "text": "Doch, hast recht, war Network-Mode. Kann man das immer aus dem Kopf nicht merken. Du kannst"}, {"id": 444, "start": 3598.52, "end": 3604.16, "text": "zum Beispiel den Cloudflare-DNS einstellen. Was soll ich mit dem Cloudflare-DNS? Der"}, {"id": 445, "start": 3604.16, "end": 3614.92, "text": "Chat wird ja so krass am Backseiten, Alter. Oh. Achja, das funktioniert nicht. Du hast"}, {"id": 446, "start": 3614.92, "end": 3618.92, "text": "da aber den Firefox noch offen, also nicht den Kognitor. Äh, seh mal gleich, seh mal"}, {"id": 447, "start": 3618.92, "end": 3636.24, "text": "gleich. W, du machst DHCP an, Piehall, ich sag's dir. Hör mal bloß auf. So. Das heißt,"}, {"id": 448, "start": 3636.24, "end": 3643.16, "text": "jetzt kann ich den hier umstellen. Achso, hm. Ich will meinen Host nicht umstellen,"}, {"id": 449, "start": 3643.16, "end": 3652.2, "text": "wenn ich meinen Host umstelle, das sackt. Ok, der plockt aber was. Ok, Leute, ich mach"}, {"id": 450, "start": 3652.2, "end": 3661.88, "text": "einfach Firefox nochmal komplett zu. Firefox. Private Window. Macht der Firefox im Private"}, {"id": 451, "start": 3661.88, "end": 3677.64, "text": "Window vielleicht immer, immer, äh, HTTPS, DNS oder so? Ah. Ah, das sieht besser aus."}, {"id": 452, "start": 3677.64, "end": 3691.12, "text": "Ok, nice, das funktioniert, sehr gut. Werbung ist weg. Werbung down. Achso, Adblocker aktiv,"}, {"id": 453, "start": 3691.12, "end": 3700.56, "text": "ich hab mir meinen Adblocker hier an, lull. Ok, wie sieht's ohne aus? Ah, ohne ist die"}, {"id": 454, "start": 3700.56, "end": 3707.36, "text": "Erwerbung auch weg. Guck mal, funktioniert, funktioniert. Adblock, Adblock ist, Adblock"}, {"id": 455, "start": 3707.36, "end": 3716.0, "text": "ist aus. Nice. Funktioniert. Ok, ok, das war relativ easy. Das ist relativ easy gewesen."}, {"id": 456, "start": 3716.0, "end": 3724.32, "text": "Äh, bei der Gelegenheit, ich mach das mal wieder aus. Meinst du, das ist gecashed?"}, {"id": 457, "start": 3724.32, "end": 3734.08, "text": "Aber zumindest. Oh nee. Ich hab, ich hab in meinem Wim, äh, Androhistorie speichern"}, {"id": 458, "start": 3734.08, "end": 3749.12, "text": "nicht aktiv. Oh. Na gut, lull. Aber ich hab, äh, aber ich hab die Datei noch, dann müssen"}, {"id": 459, "start": 3749.12, "end": 3759.2, "text": "wir das noch einmal anpassen und dann ist gut. Berlin, äh, äh, Europa slash Berlin. Das"}, {"id": 460, "start": 3759.2, "end": 3783.52, "text": "konnte man ja standardmäßig so lassen, wie es aussieht. Ok. So, schauen wir mal. Disable"}, {"id": 461, "start": 3783.52, "end": 3791.84, "text": "cache. Nee. DHCP ist jetzt an, warum ist auf einmal der DHCP an? Äh, der macht standardmäßig"}, {"id": 462, "start": 3791.84, "end": 3795.44, "text": "keinen DHCP. Das wäre, das wäre ziemlich kacke, wenn der standardmäßig DHCP machen"}, {"id": 463, "start": 3795.44, "end": 3802.32, "text": "würde. Also, ich hab den Port nicht geblockt mit DHCP. Ja, aber ich glaube gar nicht,"}, {"id": 464, "start": 3802.32, "end": 3812.08, "text": "dass DHCP standardmäßig an ist. Oder ist DHCP standardmäßig an? Genau, wenn man"}, {"id": 465, "start": 3812.08, "end": 3818.08, "text": "in den Einstellungen aktivieren muss, dann ist alles gut. Alles safe. Saved. Ok, das"}, {"id": 466, "start": 3818.08, "end": 3826.96, "text": "scheint zu funktionieren. Äh, ich mach Firefox nochmal zu, machs nochmal auf. Übrigens,"}, {"id": 467, "start": 3826.96, "end": 3830.96, "text": "Heise hat mich gescampt mit dem Heise Plus Abo. Ich wollte mir, ohne Scheiß, ich hab,"}, {"id": 468, "start": 3830.96, "end": 3836.96, "text": "ich, ich wollte einen, ich wollte einen Heise Plus Artikel lesen. Also, hier die da. Also"}, {"id": 469, "start": 3836.96, "end": 3840.64, "text": "hab ich gesagt, ok, ich mach einen Probe Abo. Du kannst einen Probe Abo machen, wenn du"}, {"id": 470, "start": 3840.64, "end": 3847.92, "text": "CT-Abon entpissen. Ich hab das angeklickt und es hat nicht funktioniert. Ich hab's nochmal"}, {"id": 471, "start": 3847.92, "end": 3851.44, "text": "angeklickt, es hat nicht funktioniert. Dann hatte ich zwei Heise Plus Bestellungen in"}, {"id": 472, "start": 3851.44, "end": 3856.2, "text": "meinem, meinem, äh, meiner Bestellhistorie auf einmal drinne. Zwei Stück für einen Account,"}, {"id": 473, "start": 3856.2, "end": 3860.4, "text": "wie auch immer das gehen soll. Und ich wollte den Artikel eigentlich gleich lesen. So, und"}, {"id": 474, "start": 3860.4, "end": 3865.04, "text": "die haben zwei Tage gebraucht, mich für einen Abo, für einen Heise Plus Abo freizuschalten."}, {"id": 475, "start": 3865.04, "end": 3868.28, "text": "Und nachdem wir das geschafft haben, hab ich mir gedacht, nee, eigentlich hab ich da gar"}, {"id": 476, "start": 3868.28, "end": 3875.48, "text": "keinen Bock drauf und wollte das kündigen. Da bin ich in die Account-Abo-Settings gegangen"}, {"id": 477, "start": 3875.48, "end": 3885.64, "text": "und, ähm, habe versucht es zu kündigen. Da war, es war, es gab keinen Button. Es gab"}, {"id": 478, "start": 3885.64, "end": 3892.88, "text": "keinen Button, das zu kündigen. Ich hab, ich hab unter Abos, hab ich mein CT-Abo stehen"}, {"id": 479, "start": 3892.88, "end": 3897.48, "text": "und untendrunter hab ich Heise Plus stehen, aber ohne Abo, ohne, ohne Kündigungsknopf."}, {"id": 480, "start": 3897.48, "end": 3902.04, "text": "Also hab ich mir gedacht, okay, ähm, dann ist das wohl ein Probe-Abo und es gibt kein"}, {"id": 481, "start": 3902.04, "end": 3905.8, "text": "zusätzliches Abo, ja. Und heute haben sie mir geschrieben, ich hab jetzt ein Abo von"}, {"id": 482, "start": 3905.8, "end": 3913.52, "text": "Ende März bis, äh, Ende, bis Ende März 2022 für 39 Euro. Wollt ihr mich, wollt ihr"}, {"id": 483, "start": 3913.52, "end": 3922.12, "text": "mich verarschen? Wollt ihr mich rollen? Oder was? Abo-Champ. Das war richtig Sauerei."}, {"id": 484, "start": 3922.12, "end": 3933.6, "text": "Rollt, ja. So, zumindest, die sind auch geplockt. Klappt? Nein, 39 Euro im Jahr. Ich sag doch"}, {"id": 485, "start": 3933.6, "end": 3944.36, "text": "bis 2022. Okay, hier ist alles geplockt. Funst. Was hat denn Herr Knu wieder verbrochen?"}, {"id": 486, "start": 3944.36, "end": 3955.2, "text": "Hä? Moment. Der ist doch schon zu, der ist doch gar nicht mehr in der Free Software Foundation."}, {"id": 487, "start": 3955.2, "end": 3958.24, "text": "Was haben sie denn jetzt schon wieder für Probleme? Ach nee, der ist wieder da oder"}, {"id": 488, "start": 3958.24, "end": 3973.52, "text": "was? Alter, blickst, blickst immer durch. Uplock ist, oh nee, Uplock ist, Moment, ich"}, {"id": 489, "start": 3973.52, "end": 3978.2, "text": "muss das disablen. Äh, äh, Manage Extensions. Kann man die Dinge eigentlich komplett ausschalten?"}, {"id": 490, "start": 3978.2, "end": 3991.96, "text": "Alles klar, zack. Noch mal neu starten. Nice. Aber Leute, Ads sind weg. Alles gut, passt."}, {"id": 491, "start": 3991.96, "end": 3997.88, "text": "Easy, easy ad, easy live. Hi, es ist auch ad-frei. Was natürlich nicht ad-frei sein wird, ist"}, {"id": 492, "start": 3997.88, "end": 4014.12, "text": "sowas wie YouTube. Da, das ist, das muss ich was zu sagen, weil das ein wichtiges Thema"}, {"id": 493, "start": 4014.12, "end": 4017.6, "text": "ist. Also, äh, der Gausschreiber schreibt gerade in meinem Ausbildungsbetrieb zerbricht"}, {"id": 494, "start": 4017.6, "end": 4022.68, "text": "gerade, äh, die ganze Abteilung kommt vom Adminrennen, so schnell du kannst, lull. Also,"}, {"id": 495, "start": 4022.68, "end": 4025.72, "text": "je nachdem in welchem Jahr du bist, ich würde meine Ausbildung auf jeden Fall erstmal fertig"}, {"id": 496, "start": 4025.72, "end": 4031.32, "text": "machen. Danach kann man immer noch gucken. Und, äh, wenn die Abteilung zerbricht, ich"}, {"id": 497, "start": 4031.32, "end": 4035.52, "text": "mein, es gibt sicherlich da auch noch andere Stellen, wo du bist, IT Leute brauchen wir"}, {"id": 498, "start": 4035.52, "end": 4040.92, "text": "auch immer. Und ich kann an der Stelle bloß mal mein Video empfehlen. Ähm, geht zwar"}, {"id": 499, "start": 4040.92, "end": 4046.6, "text": "jetzt nicht exakt um das, aber es geht auch um ein Laden, der sich immer weiter ins schlechte"}, {"id": 500, "start": 4046.6, "end": 4056.24, "text": "Ende entwickelt hat. Das, äh, das da. Okay, das ist ein Plants vs. Zombies Video drunter,"}, {"id": 501, "start": 4056.24, "end": 4061.6, "text": "aber, äh, darum ging's, ja. Und, äh, das war, da ging's nämlich auch um den Betrieb,"}, {"id": 502, "start": 4061.6, "end": 4068.64, "text": "wo ich meine Ausbildung gemacht hab. Und wie, wie der immer schlechter geworden ist, bis"}, {"id": 503, "start": 4068.64, "end": 4073.36, "text": "dahin, dass ich irgendwann gesagt hab, ich hab keinen Bock mehr. Ausbildung ist in zwei"}, {"id": 504, "start": 4073.36, "end": 4078.16, "text": "Monaten zu Ende, ja. Naja, oder, ich mein, du musst ja nicht unbedingt was anderes finden,"}, {"id": 505, "start": 4078.16, "end": 4081.68, "text": "ich weiß ja nicht, wie das heißt, ob die Firma pleite ist oder so jetzt, ne, dann bleibt"}, {"id": 506, "start": 4081.68, "end": 4086.8, "text": "dir nix anderes übrig. Aber nur weil da, weil's da in der einen Gruppe Stunk gibt, es gibt"}, {"id": 507, "start": 4086.8, "end": 4091.04, "text": "ja, wenn der Laden was taugt, kann's ja durchaus sein, dass es da noch andere Stellen gibt,"}, {"id": 508, "start": 4091.04, "end": 4103.2, "text": "die interessant sind, ja. Genau, jetzt wollte ich nämlich mal YouTube"}, {"id": 509, "start": 4103.2, "end": 4108.92, "text": "testen. Und, äh, Twitch, aber Twitch kannst du vergessen. Was kannst du für Terminals"}, {"id": 510, "start": 4108.92, "end": 4117.12, "text": "empfehlen? Äh, IBM Z-Series, beste. Am besten Cobalt Only. Ne, also mein Lieblingsterminal"}, {"id": 511, "start": 4117.12, "end": 4128.24, "text": "ist nach wie vor Knob. What? Festgewachsene Wirbelsäule. Also, wenn man wirklich eine"}, {"id": 512, "start": 4128.24, "end": 4132.56, "text": "festgewachsene Wirbelsäule hat, ist, glaub ich, das Schlechteste, was man machen kann,"}, {"id": 513, "start": 4132.56, "end": 4140.56, "text": "einfach mal dran rumreißen. Das tut nur weh und ist sicherlich auch, äh, schlecht. Aber"}, {"id": 514, "start": 4140.56, "end": 4151.24, "text": "gut, YouTube, YouTube-Videos. Ähm, was wollte ich jetzt zeigen? Ich wollte gucken, ob YouTube"}, {"id": 515, "start": 4151.24, "end": 4155.44, "text": "geht. So, wir gucken einfach mal, ob mal in meinen eigenen Videos jetzt die Werbung weg"}, {"id": 516, "start": 4155.44, "end": 4165.2, "text": "ist. Zeig mal her. Aber das ist klar, also, es ist wirklich, es ist wirklich unglaublich"}, {"id": 517, "start": 4165.2, "end": 4172.64, "text": "schwierig, auf YouTube mittlerweile Werbung zu plocken, ne. Also, wie gesagt, auf Spiegel"}, {"id": 518, "start": 4172.64, "end": 4178.0, "text": "geht's, auf Heise geht's, auf RP Online, was einer vorhin gesagt hat, da geht das alles"}, {"id": 519, "start": 4178.0, "end": 4184.24, "text": "halbwegs mit Adploggen. Ähm, bis auf die ein oder anderen Sachen vielleicht, aber im"}, {"id": 520, "start": 4184.24, "end": 4188.64, "text": "Großen und Ganzen geht's. Aber YouTube ist mittlerweile wirklich, wirklich clever. Die"}, {"id": 521, "start": 4188.64, "end": 4194.48, "text": "liefern die Werbung von den gleichen, äh, Servern aus, äh, wie den Content. Das kannst"}, {"id": 522, "start": 4194.48, "end": 4202.2, "text": "du wahrscheinlich nur mit sehr viel, äh, Tricksen und regelmäßig Listenupdaten fixen,"}, {"id": 523, "start": 4202.2, "end": 4209.48, "text": "ja. So, gucken wir mal, wie es, wie es auf Twitch aussieht. Auf Twitch will ich natürlich"}, {"id": 524, "start": 4209.48, "end": 4214.2, "text": "die Werbung nicht plocken. Will ich euch auch nicht empfehlen, weil, da krieg ich ja weniger"}, {"id": 525, "start": 4214.2, "end": 4227.96, "text": "Geld. Ich hab Uplog aus, gerade zum Testen, ja. Ja, deswegen hab ich ja auch, mit dem Browser"}, {"id": 526, "start": 4227.96, "end": 4234.04, "text": "Addons ist ja klar, aber das richtig geile, wozu man das ja brauchen könnte, ist, äh,"}, {"id": 527, "start": 4234.04, "end": 4245.64, "text": "über Mobile-Apps und das geht halt gerade mit den iOS-Apps nicht richtig. Ja. Ich mag"}, {"id": 528, "start": 4245.64, "end": 4253.04, "text": "von KDE fast nix. Ich, du musst mal an die Videos gucken, ich hab total oft meine Arme"}, {"id": 529, "start": 4253.04, "end": 4260.04, "text": "geleakt in letzter Zeit. Die, äh, die, die, die Wots, guck mal. Ich hab hier total viele"}, {"id": 530, "start": 4260.04, "end": 4284.32, "text": "Arm-Leaks drinne. Bild.de noch mal testen. Ja, sie ist auch Werbung weg. Der Corona-Fakten-Check"}, {"id": 531, "start": 4284.32, "end": 4310.96, "text": "und das von der Bild, genau. Mein Gott, das ist so scheiße. Ah. Ich hab nen Adblocker,"}, {"id": 532, "start": 4310.96, "end": 4315.36, "text": "du hast dir Youtube-Premium gekauft, wahrscheinlich, er hat. Da kann ich dir nur empfehlen, kauf"}, {"id": 533, "start": 4315.36, "end": 4324.4, "text": "dir Youtube-Premium in Indien, dann kostet es nur zwei Euro. So, nice. Also, das Ding"}, {"id": 534, "start": 4324.4, "end": 4328.4, "text": "funktioniert relativ gut, muss ich sagen. Für so die Standard-Surf-Dinger ist das gar"}, {"id": 535, "start": 4328.4, "end": 4336.2, "text": "nicht mal übel, ja. So, was kann man da jetzt noch großartig sinnvolle Sachen einstellen?"}, {"id": 536, "start": 4336.2, "end": 4340.44, "text": "Das muss ich mir jetzt nochmal angucken. Ich muss sagen, also fürs Setup kriegt das Ding"}, {"id": 537, "start": 4340.44, "end": 4345.28, "text": "von mir echt volle Punktzahl, weil mal ganz im Ernst, viel simpler kann das Setup doch"}, {"id": 538, "start": 4345.28, "end": 4363.68, "text": "eigentlich nicht sein, oder? Golem-Werbung. No fucks ever given. Ah. Das ist anscheinend"}, {"id": 539, "start": 4363.68, "end": 4373.28, "text": "auch nicht alles geblockt, aber einiges. Okay, irgendjemand hat ne neue Blockliste gepostet"}, {"id": 540, "start": 4373.28, "end": 4381.24, "text": "vorhin, die ich mal ausprobieren soll, das mach ich jetzt. Ist derjenige noch da, dann"}, {"id": 541, "start": 4381.24, "end": 4388.2, "text": "füg ich die neue Liste mal zu hier. Was ist das? Kann doch keiner aussprechen."}, {"id": 542, "start": 4388.2, "end": 4401.72, "text": "Normal, dass sich da nichts tut? Ah, das ist einfach. Oh fuck, Alter, was ist, boah, was"}, {"id": 543, "start": 4401.72, "end": 4429.52, "text": "ist das für ne Liste? Okay, also fügen wir die mal hinzu. Ähm. Ja, huh. Keg-Wait."}, {"id": 544, "start": 4429.52, "end": 4440.96, "text": "Add. Hinzugefügt. Und jetzt muss man wahrscheinlich noch in die Settings gehen und, äh, updaten,"}, {"id": 545, "start": 4440.96, "end": 4458.68, "text": "oder? Oder macht er das automatisch? Was ist das? Also, so wie ich es jetzt gemacht"}, {"id": 546, "start": 4458.68, "end": 4462.2, "text": "hab, oder? Mehr muss man, mehr muss man wahrscheinlich nicht. Ach, hier macht er doch, Target. Da"}, {"id": 547, "start": 4462.2, "end": 4474.24, "text": "steht's doch sogar. Ja, Spider, so ist es. Aber, das nicht machen ist ja auch keine Alternative,"}, {"id": 548, "start": 4474.24, "end": 4488.12, "text": "oder? Okay, noch mal. Postchamp? Postchamp? Ah. Werbung scheint weg zu sein. Ah, ja,"}, {"id": 549, "start": 4488.12, "end": 4497.08, "text": "ja. Excellent. Ja gut, was soll das Internet in der aktuellen Zeit auch sonst machen?"}, {"id": 550, "start": 4497.08, "end": 4503.68, "text": "Die können froh sein, dass Fortran nicht wieder neue, äh, Pepe-Hass-Symbole in die"}, {"id": 551, "start": 4503.68, "end": 4508.68, "text": "Welt, äh, verbreitet, ja? Die sollen froh sein, wenn das Internet nur Memes und nur"}, {"id": 552, "start": 4508.68, "end": 4518.96, "text": "Memes macht. Ja, und die Chinesen sollen mal gucken, dass ihr Aliexpress-Lieferungen"}, {"id": 553, "start": 4518.96, "end": 4533.28, "text": "wieder ankommt. Hast du Regex? Wie hast du Regex? Was ist das für eine Frage? Hast"}, {"id": 554, "start": 4533.28, "end": 4545.44, "text": "du Regex? Ich hab Regex. Ich hab ganz viel Regex. Das ist so, wie wenn einer fragt,"}, {"id": 555, "start": 4545.44, "end": 4567.0, "text": "hast du Emote. Ach, hast du Regex? Ob ich Regex hasse? Nee. Was jetzt? Ich bin verwirrt,"}, {"id": 556, "start": 4567.0, "end": 4579.08, "text": "ne? Ach nein, ich hab keine Regex-Filter. Ich hab keine Regex-Filter. Nein, hab ich"}, {"id": 557, "start": 4579.08, "end": 4591.2, "text": "nicht. Was letzte Regex? Ich hab die Fault-Settings und ne extra Liste vom Chat hinzugefügt."}, {"id": 558, "start": 4591.2, "end": 4605.44, "text": "Das muss reichen. So, jetzt gucken wir mal, ob YouTube, was YouTube jetzt sagt. Ok. Ok,"}, {"id": 559, "start": 4605.44, "end": 4614.0, "text": "das ist vergesstes. Ok, aber ich muss ehrlich sagen, das Setup finde ich gut gemacht. Das"}, {"id": 560, "start": 4614.0, "end": 4620.96, "text": "ist wirklich easy. So, mich würde jetzt tatsächlich noch interessieren, ob, ähm, Regex funktioniert"}, {"id": 561, "start": 4620.96, "end": 4627.4, "text": "allerdings nicht der Regex, den der Chain-Lore meint, sondern Regex für DNS-Auflösung."}, {"id": 562, "start": 4627.4, "end": 4635.44, "text": "Das muss ich mal ausprobieren. Äh, weil aktuell ist es so, wenn ich, wenn ich, ähm, keine"}, {"id": 563, "start": 4635.44, "end": 4646.8, "text": "Ahnung, äh, Wiki mal auflöse von meiner Domain, hier lokal. Äh, ich hab mich vertippt. Dann"}, {"id": 564, "start": 4646.8, "end": 4651.36, "text": "kann er das nicht auflösen. So, alles klar. Ähm, ich würde jetzt gern gucken, ob ich"}, {"id": 565, "start": 4651.36, "end": 4656.16, "text": "Wildcard, Wildcard-DNS anlegen kann. Das hab ich nämlich sowas gesehen. Das wäre ganz"}, {"id": 566, "start": 4656.16, "end": 4661.28, "text": "praktisch, weil aktuell verwende ich den DNS von meinem MikroTik-Router und da muss"}, {"id": 567, "start": 4661.28, "end": 4668.12, "text": "ich jede einzelne Domain von mir lokal extra eintragen. Das nervt mich. So, äh, Group"}, {"id": 568, "start": 4668.12, "end": 4678.2, "text": "Management, Domains. Hier, Domain to be added. Regex. Ist das jetzt für DNS-Auflösung oder"}, {"id": 569, "start": 4678.2, "end": 4686.52, "text": "ist das, oder ist das zum Domain-Filtern? Nee, das ist zum Filtern, weil sonst müsste"}, {"id": 570, "start": 4686.52, "end": 4698.16, "text": "man eine IP angeben. Ach, add to blacklist, add to whitelist, das ist zum Filtern. Okay,"}, {"id": 571, "start": 4698.16, "end": 4706.92, "text": "dann funktioniert das damit schon mal nicht, was ich mir gedacht hab. Ah, yes. Unter local"}, {"id": 572, "start": 4706.92, "end": 4718.68, "text": "DNS. Ah, guck mal da. DNS-Records. Kann der? Hä, der kann keine, der kann keine, ähm,"}, {"id": 573, "start": 4718.68, "end": 4726.6, "text": "also ich kann da nicht sowas machen wie, oder? Geht das? Punkt, keine Ahnung, eins eins,"}, {"id": 574, "start": 4726.6, "end": 4752.52, "text": "testen wir jetzt mal. Ah, muss man mal gucken. Du musst DHCP einschalten. Nee, warum? So."}, {"id": 575, "start": 4752.52, "end": 4765.88, "text": "Ja, ich weiß, dass man das potenziell mit DNS-Mask machen kann, das weiß ich. Ich will"}, {"id": 576, "start": 4765.88, "end": 4773.68, "text": "nicht domain-spezifisch weiterleiten, ich will wirklich alle Dinger standardmäßig auflösen"}, {"id": 577, "start": 4773.68, "end": 4790.2, "text": "auf eine IP. Intern. Lokale DNS-Records, ja gut, ähm, es bringt mir ja trotzdem nix,"}, {"id": 578, "start": 4790.2, "end": 4794.88, "text": "weil ich kann ja eh nicht das eintragen, was ich eintragen will, was ziemlich sackt."}, {"id": 579, "start": 4794.88, "end": 4812.2, "text": "Guck, der versucht das gleiche hier. Also ich weiß, dass es, jaja, ich weiß, dass das"}, {"id": 580, "start": 4812.2, "end": 4819.76, "text": "geht mit DNS-Mask, das weiß ich. Ja, ich will nicht den DNS vom Router verwenden. In"}, {"id": 581, "start": 4819.76, "end": 4823.72, "text": "meinem Router muss ich ja auch jede Domain-Einzel eintragen, das will ich ja nicht. Ich wollte"}, {"id": 582, "start": 4823.72, "end": 4830.32, "text": "das als Ersatz dafür vielleicht verwenden. Nein, chat, ppega chat gerade, was ist denn"}, {"id": 583, "start": 4830.32, "end": 4837.24, "text": "hier los? Das bringt mir doch nix, wenn ich das weiterleite, da muss ich ja weiter jede"}, {"id": 584, "start": 4837.24, "end": 4844.08, "text": "einzelne Domain eintragen. Ich wollte ne Wildcard-DNS-Eintrag machen, dass alle zukünftigen Domains,"}, {"id": 585, "start": 4844.08, "end": 4850.48, "text": "die ich mir ausstelle für meine interne Domain, ähm, automatisch auf einen Server aufgelöst"}, {"id": 586, "start": 4850.48, "end": 4860.84, "text": "werden. Tja, ok, das geht nicht. Mal gucken, ob Edgar das kann. Nicht spoilern, Leute,"}, {"id": 587, "start": 4860.84, "end": 4866.04, "text": "nicht spoilern, ob das das, ob die das können. So, geht, geht vielleicht sowas, dass ich"}, {"id": 588, "start": 4866.04, "end": 4890.8, "text": "das für vorne weglasse. Must be valid. Ja, ok. Ja, das ist Alias, so. Ne. Ohne Punkt"}, {"id": 589, "start": 4890.8, "end": 4898.8, "text": "vorne dran. Ich bin mir jetzt nicht so sicher, ob der Chat mich trollen will, weil ich mich"}, {"id": 590, "start": 4898.8, "end": 4905.72, "text": "gerade mit dem Chat beschwert hab oder nicht. Mir ist klar, dass es ohne Punkt dran funktioniert,"}, {"id": 591, "start": 4905.72, "end": 4912.76, "text": "aber dann macht er nicht das, was ich haben will. Dann löst er nämlich exakt diese Domain"}, {"id": 592, "start": 4912.76, "end": 4918.84, "text": "mit dieser IP auf, aber ich will ja Wildcard, alles, was es jemals gibt für diese Domain"}, {"id": 593, "start": 4918.84, "end": 4927.2, "text": "oder jegliche Anfrage für jegliche Subdomain davon auf die gleiche IP auflösen. Der Mikrotik"}, {"id": 594, "start": 4927.2, "end": 4933.4, "text": "Router kann das zum Teil leider nicht gut, sodass man das nicht gescheit verwenden kann."}, {"id": 595, "start": 4933.4, "end": 4949.84, "text": "Aber ansonsten muss ich sagen, die Setup ist echt super gemacht. Also da kann man sich"}, {"id": 596, "start": 4949.84, "end": 4955.28, "text": "nicht beschweren, das ist total easy, das kriegt jeder hin. Und auch ohne, dass man"}, {"id": 597, "start": 4955.28, "end": 4960.12, "text": "sich irgendwie Guides durchlesen muss, ist es total naheliegend. Listen eintragen, DNS"}, {"id": 598, "start": 4960.12, "end": 4973.0, "text": "umstellen, fertig, easy. Ja ja, mit dem anderen DNS geht das, der DNS Mask kann das. Also"}, {"id": 599, "start": 4973.0, "end": 4980.2, "text": "du kannst das, ich könnte ja auch DNS Mask Config selbst eintragen, das geht schon, aber"}, {"id": 600, "start": 4980.2, "end": 4984.28, "text": "ich hätt's halt lieber, wenn das in einem Webinterface drin ist. Okay, also dann schalten"}, {"id": 601, "start": 4984.28, "end": 4994.88, "text": "das mal wieder aus. Und jetzt probieren wir das andere Teil aus. Delete, DRCP, save, bam,"}, {"id": 602, "start": 4994.88, "end": 5009.24, "text": "zack. Okay, mein Heizungs-Dashboard ist exzellent. Mein Heizungs-Dashboard, oh nee. Hallo, muss"}, {"id": 603, "start": 5009.24, "end": 5017.92, "text": "ich jetzt erstmal mal enable, disable, da ist wieder eine... Mein Heizungs-Dashboard"}, {"id": 604, "start": 5017.92, "end": 5030.64, "text": "ist poggers. Bestes Dashboard, ja. Wassertemperatur, Fehlerstatus, Kessel-Temperatur, Brennerstatus,"}, {"id": 605, "start": 5030.64, "end": 5039.64, "text": "Abgas-Temperatur, Pumpenaktivität. Ich weiß mehr über meine Heizung als der Hersteller"}, {"id": 606, "start": 5039.64, "end": 5051.2, "text": "selbst. Ist das ein Grafana-Theme? Das ist ein Darkreader-Theme und das ist das Standard"}, {"id": 607, "start": 5051.2, "end": 5055.92, "text": "Grafana-Theme, ja. Ja, ich glaub die haben mittlerweile einen Darkmode-Standard-Messig"}, {"id": 608, "start": 5055.92, "end": 5065.92, "text": "drinne. Kannste auswählen. So, okay, also. Machen wir hier mal wieder zu und machen erstmal"}, {"id": 609, "start": 5065.92, "end": 5085.12, "text": "auf die Stelle mal wieder U-Block an und gucken, ob wieder alles weg ist. Ah. Okay, wunderbar,"}, {"id": 610, "start": 5085.12, "end": 5091.48, "text": "alles blockt. Sehr gut. Okay, also das hat schon mal funktioniert. So, und jetzt installieren"}, {"id": 611, "start": 5091.48, "end": 5097.4, "text": "wir, würde ich sagen. Ich glaub, das kann ich löschen, das will ich nicht nochmal ausprobieren."}, {"id": 612, "start": 5097.4, "end": 5111.24, "text": "Was hast du für eine Smart Home-Zentrale? Ich benutze Home Assistant, das da. Ich würde"}, {"id": 613, "start": 5111.24, "end": 5116.96, "text": "es euch ja auch öfters mal zeigen, aber ich hab immer Angst, dass ich irgendwas leake."}, {"id": 614, "start": 5116.96, "end": 5137.2, "text": "Okay, RM, DNS-Stells. Da ist er weg. MKDier-DNS-Stells. So, und jetzt das Ganze für Edgard. Edgard-GitHub,"}, {"id": 615, "start": 5137.2, "end": 5152.28, "text": "wo haben wir da nochmal das Docker-Repo gehabt? Da. Official-Docker-Image, getting started."}, {"id": 616, "start": 5152.28, "end": 5167.72, "text": "Okay, die wollen das nicht mit Compose machen. Docker-Run. Haben die ein Compose-Example?"}, {"id": 617, "start": 5167.72, "end": 5176.08, "text": "Nope. Dann machen wir es so, wie die es geschrieben haben. Also, was haben wir denn hier? Port"}, {"id": 618, "start": 5176.08, "end": 5198.52, "text": "853. Was ist das für ein Port? Ist das DNSSEC, oder was ist das? DNS-Over-HTTPS. Das ist"}, {"id": 619, "start": 5198.52, "end": 5206.0, "text": "der russische Backdoor-Port, glaube ich, eher, ja. Gut, DHCP mache ich mal aus Sicherheitsgründen"}, {"id": 620, "start": 5206.0, "end": 5212.68, "text": "mal wieder weg. Ich hab keinen Bock, dass ich lokal irgendwie Alps vergebe. Okay, Port 3000,"}, {"id": 621, "start": 5212.68, "end": 5223.08, "text": "Port 80, Port 53. Das klingt sinnvoll. My Own Work-Dier. Nee, nee, nee, nee. Conf-Dier,"}, {"id": 622, "start": 5223.08, "end": 5248.04, "text": "nicht irgendwo sonst. Okay, Pass-Run. Bam. Oh. Was? Ach so. Das nicht Punkt-Slash. Moment,"}, {"id": 623, "start": 5248.04, "end": 5255.4, "text": "muss man bei Docker komplett einen Full-Qualified-Path angeben, ich glaube schon. Geht das jetzt?"}, {"id": 624, "start": 5255.4, "end": 5275.2, "text": "Moment, wo hat er jetzt die Ordner angelegt? Moment, wo sind die Ordner jetzt? Hat er jetzt"}, {"id": 625, "start": 5275.2, "end": 5286.12, "text": "irgendwie? Faktier oder so? Der hat ein eigenes Volume gemacht. Es ist mir egal, soll mir"}, {"id": 626, "start": 5286.12, "end": 5298.56, "text": "eigentlich recht sein? Volume LS. Ah, hier. Exzellent, passt. Okay, gut. Dann ist alles"}, {"id": 627, "start": 5298.56, "end": 5307.04, "text": "gut. Also, gucken wir uns das Ganze mal an. Wir müssen wahrscheinlich auf Port 3000, wahrscheinlich."}, {"id": 628, "start": 5307.04, "end": 5327.0, "text": "Vermute ich mal. Ne? 80? Nee. Ich sollte aber eigentlich mit Localhost da drauf rauskommen."}, {"id": 629, "start": 5327.0, "end": 5356.88, "text": "Localhost. RTPS. Ah! Moment, hab ich... Es läuft auch sonst nix. Äh. Okay, add"}, {"id": 630, "start": 5356.88, "end": 5372.48, "text": "gut. Erstmal gucken, welchen Port muss ich denn? Port? Also, wo steht's denn hier? Pull"}, {"id": 631, "start": 5372.48, "end": 5389.76, "text": "Docker-Image, bla bla bla. Aha. Warum ist das komplett broken jetzt? Würdest du dann"}, {"id": 632, "start": 5389.76, "end": 5398.88, "text": "P-Hole behalten? Ja, mal gucken, wie das andere ist. Also, angeblich ist das alles gestartet,"}, {"id": 633, "start": 5398.88, "end": 5409.56, "text": "aber es gibt keine Connection. Vielleicht sind das irgendwelche Docker-Problems? Ne, ich"}, {"id": 634, "start": 5409.56, "end": 5429.2, "text": "reboot jetzt nicht, ich mach Netzwerk-Modus und Gutes. Ah ne, dann macht er ja DHCP. Äh."}, {"id": 635, "start": 5429.2, "end": 5436.68, "text": "Okay. Äh, Moment, wie ging das jetzt nochmal? Network? Network? Network-Host. Ach so, dann"}, {"id": 636, "start": 5436.68, "end": 5461.56, "text": "muss man die Port-Weiterleitung raus machen, ne? Ah. Jaja. Okay. Netz-Stat. Port 3000,"}, {"id": 637, "start": 5461.56, "end": 5472.0, "text": "alles klar. Und was anderes nicht, oder was? Wie? Sollte da nicht auch noch was anderes"}, {"id": 638, "start": 5472.0, "end": 5486.76, "text": "listen? Aber Port 3000 sollte jetzt funktionieren. Aha. Da sind wir. Oh, Flashbang. Manage Extensions,"}, {"id": 639, "start": 5486.76, "end": 5496.36, "text": "mal wieder aus. Okay, zeig mir also. Getting started. Next. Listen Interfaces. Ja, das"}, {"id": 640, "start": 5496.36, "end": 5504.24, "text": "reicht. Port 80. DNS-Server, all interfaces. Ja, komm. All interfaces. Mach mir bloß"}, {"id": 641, "start": 5504.24, "end": 5510.88, "text": "kein DHCP an, ey. Das ist ein hübsches Interface, das erkenne ich gleich an den Buttons. Was"}, {"id": 642, "start": 5510.88, "end": 5519.52, "text": "ist denn das für ein Button? Ist das Bootstrap? BTN-Success, BTN-Secondary, BTN-LG, klingt"}, {"id": 643, "start": 5519.52, "end": 5543.0, "text": "irgendwie ein bisschen Bootstrap-like. Username. CACW. 1, 2, 3, 4, 5, 6. Besser. Next. Configure"}, {"id": 644, "start": 5543.0, "end": 5552.8, "text": "... Moment, was will der von mir? Ach so, das ist wie ich das einstelle. Ja, wie ich"}, {"id": 645, "start": 5552.8, "end": 5559.16, "text": "das einstelle, das kriege ich auch so hin. Open Dashboard. Jawoll. CACW. 1, 2, 3, 4,"}, {"id": 646, "start": 5559.16, "end": 5573.04, "text": "4, 5, 6. Jawoll. Dark Mode ausmachen. Okay. Sieht recht fancy aus, muss ich sagen. Settings,"}, {"id": 647, "start": 5573.04, "end": 5579.56, "text": "DNS-Settings. Wir stellen jetzt erstmal mal den DNS nochmal um. Edit. So, DNS-Settings"}, {"id": 648, "start": 5579.56, "end": 5590.28, "text": "auf lokaler Horst. Save. Oops. Save. Voll connecten. So, mal gucken, ob es prinzipiell"}, {"id": 649, "start": 5590.28, "end": 5601.16, "text": "geht jetzt. Ja, geht. So, also. Okay, er hat schonmal die Hälfte geploggt. Was ist, wenn"}, {"id": 650, "start": 5601.16, "end": 5603.4, "text": "ich hier jetzt irgendwie hingehe? Ist es dann auch standardmäßig weg?"}, {"id": 651, "start": 5603.4, "end": 5621.04, "text": "Komm mal, der Timeout ist jetzt grad bei den Domains unten. Was dazu führen kann, dass"}, {"id": 652, "start": 5621.04, "end": 5624.28, "text": "irgendwelche Seiten hängen. Das ist übrigens das Problem, was ich ursprünglich mal hatte"}, {"id": 653, "start": 5624.28, "end": 5630.52, "text": "mit Piehole, dass die Seiten immer getimt aus sind unten, weil es sich auflösen kann"}, {"id": 654, "start": 5630.52, "end": 5634.52, "text": "und teilweise manche Seiten, so wie jetzt hier auf Spiegel, auch ewig hängen dran."}, {"id": 655, "start": 5634.52, "end": 5646.84, "text": "Okay, aber sind zumindest standardmäßig schonmal alle ads back. Das ist schonmal gut."}, {"id": 656, "start": 5646.84, "end": 5656.68, "text": "Aber guck mal, die Seiten hängen ewig und laden ewig rum. Das sackt. Okay, also was"}, {"id": 657, "start": 5656.68, "end": 5661.0, "text": "kann man hier alles einstellen? Hier wird erstmal schon das halbe Internet geploggt."}, {"id": 658, "start": 5661.0, "end": 5667.96, "text": "430% wird schonmal das halbe Internet geploggt. So muss das sein. So, das Dashboard sieht"}, {"id": 659, "start": 5667.96, "end": 5683.56, "text": "recht fancy aus. Facebook kommt, wird geploggt. Das zu Recht. Das UI sieht nach Scam aus."}, {"id": 660, "start": 5683.56, "end": 5698.36, "text": "Warum? Am Moment, Facebook wurde nicht geploggt. Top Query Domains, Top Block Domains. Okay,"}, {"id": 661, "start": 5698.36, "end": 5707.32, "text": "also, Blocked by Filters. Okay, was kann man hier? AdGuard, DNS, Default, Malware Domain"}, {"id": 662, "start": 5707.32, "end": 5714.68, "text": "List. Soll ich einfach mal alles anhaken? Nee, wir gucken erstmal, wie die standardmäßig"}, {"id": 663, "start": 5714.68, "end": 5721.32, "text": "so sind. YouTube geht bestimmt immer noch. Jaja, nee, nee, YouTube geht nicht. Die geben"}, {"id": 664, "start": 5721.32, "end": 5727.0, "text": "sich auch sehr viel Mühe, dass es nicht geht. Guck mal, jetzt hängts. Das ist übrigens"}, {"id": 665, "start": 5727.0, "end": 5731.08, "text": "ein Grund, warum ich diese ganzen AdBlocker, diese DNS AdBlocker runtergeschmissen hab,"}, {"id": 666, "start": 5731.08, "end": 5743.28, "text": "weil die Seiten teilweise eklig hingen damit. Was für ein DNS benutzt AdGuard? Ich vermute"}, {"id": 667, "start": 5743.28, "end": 5762.16, "text": "auch mal DNS Mask, oder? Weiß nicht, was die intern verwenden. Ich hab keine Ahnung."}, {"id": 668, "start": 5762.16, "end": 5768.96, "text": "Was eigenes wird es nicht sein. Niemand macht DNS selbst. Warum? So, also gehen wir mal"}, {"id": 669, "start": 5768.96, "end": 5772.6, "text": "in die Settings rein. Was kann man da alles Schönes einstellen? So, General Settings,"}, {"id": 670, "start": 5772.6, "end": 5777.32, "text": "Block Domains, 24 schon updaten. Leute, ich muss mal den, jetzt das wichtigste, wo ist"}, {"id": 671, "start": 5777.32, "end": 5787.0, "text": "Darkseam? Darkseam. Wo geht das? Haben die sowas? Ich brauch, ich brauch Darkseam. Gibt's"}, {"id": 672, "start": 5787.0, "end": 5798.28, "text": "nicht? Oh, hat's schon durchgefallen bei mir. Okay, Block Domains, Filters, alle 24 Stunden"}, {"id": 673, "start": 5798.28, "end": 5817.72, "text": "ist okay. Use Browsing Security Websites. Enforce Safe Search. Bury Logs, okay, das"}, {"id": 674, "start": 5817.72, "end": 5831.76, "text": "brauchen wir nicht. Was kann man sonst noch einstellen? DNS Settings, Upstream DNS. Ah,"}, {"id": 675, "start": 5831.76, "end": 5841.16, "text": "der Balanced über verschiedene DNS. Okay, kann man machen. Kann man machen? Wo kommt"}, {"id": 676, "start": 5841.16, "end": 5853.92, "text": "man denn hier raus, wenn man das abruft? Unable to Pass Request. Geil. Und was nimmt er da"}, {"id": 677, "start": 5853.92, "end": 5859.56, "text": "standardmäßig? Was steht da dahinter? Ich mein, es wäre schon interessant zu wissen,"}, {"id": 678, "start": 5859.56, "end": 5871.56, "text": "was er letztendlich für DNSer nimmt. Oder ist das, ist das DNS über HTTPS, was der"}, {"id": 679, "start": 5871.56, "end": 5891.4, "text": "DNS über HTTPS nimmt? Damit. Query one server at a time. Okay. Ach, hier, guckt mal. HTTPS,"}, {"id": 680, "start": 5891.4, "end": 5901.56, "text": "Encrypted DNS over HTTPS. Alles klar, okay, passt. Und das sind die DNSer, die er braucht,"}, {"id": 681, "start": 5901.56, "end": 5908.48, "text": "um das da selbst zu resolven. Alles klar, verstehe. Test Server, DNS Server Configuration Rate"}, {"id": 682, "start": 5908.48, "end": 5915.56, "text": "Limit. Ich finde die Default Settings sind durchaus cool, cool gemacht, ja. Die hätte"}, {"id": 683, "start": 5915.56, "end": 5928.44, "text": "ich jetzt so nicht mit gerechnet. Ah, Blocking Mode. Default Respond. Respond Refused Code."}, {"id": 684, "start": 5928.44, "end": 5940.28, "text": "Kann man mal ausprobieren, vielleicht lag es da nicht mehr rum. Oder vielleicht laden"}, {"id": 685, "start": 5940.28, "end": 5943.8, "text": "die Seiten da nicht drei Stunden, wenn sie was nicht auflösen können. Guck hier, seht"}, {"id": 686, "start": 5943.8, "end": 5949.64, "text": "ihr das da unten? Probieren wir mal, was passiert jetzt, wenn ich das umstelle auf Refused Save?"}, {"id": 687, "start": 5949.64, "end": 5968.6, "text": "Erinnert sich nix. Cache Size, disallowed Domains, allowed Domains. Okay, klingt alles"}, {"id": 688, "start": 5968.6, "end": 5974.12, "text": "gut. Defaulten ist immer ganz sinnvoll. Encryption Settings. Boah, nee, das muss ich mir jetzt"}, {"id": 689, "start": 5974.12, "end": 5978.52, "text": "noch alles angucken. Ah, man kann fürs Webinterface Zertifikate vergeben und sowas wahrscheinlich."}, {"id": 690, "start": 5978.52, "end": 5987.36, "text": "Nice. Configure Devices Connected to Edgar. Ne, brauchen wir hier nicht. Clients Runtime."}, {"id": 691, "start": 5987.36, "end": 6004.96, "text": "Der Router ist am Start hier. So, Filter. Ja gut, da kann man jetzt ausfüllen, was der"}, {"id": 692, "start": 6004.96, "end": 6010.2, "text": "haben will. Okay, kann man, kann der für mich Custom DNS Auflösung machen? Nee, gell,"}, {"id": 693, "start": 6010.2, "end": 6031.6, "text": "das kann er, das kann er nicht. Nee, das geht anscheinend nicht. Was? Use the Filter Tab,"}, {"id": 694, "start": 6031.6, "end": 6050.08, "text": "Custom Filter Rules. Aha, okay. Kann man da auch Regexen? Jetzt, okay, jetzt bin ich mal"}, {"id": 695, "start": 6050.08, "end": 6068.44, "text": "gespannt. Okay, also, löst nicht auf. Okay, das wird wahrscheinlich nicht funktionieren."}, {"id": 696, "start": 6068.44, "end": 6079.56, "text": "Nee, was? Ne, natürlich nicht. Kann man da Regexen? Guck mal hier, Regex Block Access"}, {"id": 697, "start": 6079.56, "end": 6085.36, "text": "to Domains Matching. So, und jetzt ist die Frage, ob man da auch was da vorschreiben"}, {"id": 698, "start": 6085.36, "end": 6106.84, "text": "kann? Ne, das wäre auch zu einfach, wenn das funktioniert. Unblock Access. Gut, ne, so"}, {"id": 699, "start": 6106.84, "end": 6116.36, "text": "einfach funktioniert das schon mal, ne? Ne, das funktioniert nicht. Okay, Haus. Gibt es"}, {"id": 700, "start": 6116.36, "end": 6121.6, "text": "schon ein Resultat? Es hat mich jetzt beides noch nicht so hundertprozentig überzeugt."}, {"id": 701, "start": 6121.6, "end": 6145.72, "text": "Was? Rewrite? DNS Rewrite. Woah, what the fuck? Was zum? Ach, zu scheiße, wie soll das denn?"}, {"id": 702, "start": 6145.72, "end": 6163.32, "text": "MonkaX, Alter, was? Okay, das ist Big Brain Time, Alter. Regex. Das ist Big Brain Time,"}, {"id": 703, "start": 6163.32, "end": 6170.08, "text": "wie kriege ich das hin? Okay, ich will nicht blocken, ich will Custom Auflösung machen."}, {"id": 704, "start": 6170.08, "end": 6191.0, "text": "As Filter, DNS Rewrites. Add DNS Rewrite. Okay, Enter, Domain, Name or Wildcard. Ah,"}, {"id": 705, "start": 6191.0, "end": 6196.96, "text": "das ist cool. Okay, Moment, ich mach mal kurz das wieder weg, was ich hier getrieben hab."}, {"id": 706, "start": 6196.96, "end": 6209.52, "text": "Ja, genau. Das ist cool. Ja, genau das will ich haben. Das ist Poggers. Jawoll. Genau das"}, {"id": 707, "start": 6209.52, "end": 6213.48, "text": "brauch ich. So, und jetzt ist die Frage, kann man das ordnen? Kann ich jetzt zum Beispiel"}, {"id": 708, "start": 6213.48, "end": 6222.56, "text": "sagen, okay, aber ich will eine Ausnahme, die soll auf 10 oder keine Ahnung, auf 5.5"}, {"id": 709, "start": 6222.56, "end": 6238.84, "text": "gehen. Ah, Moment, was mach ich dafür? Mist. Hey, nice. Na, ja, das ist cool. Ja, das ist"}, {"id": 710, "start": 6238.84, "end": 6243.4, "text": "cool. Okay, das bringt mir was, weil, alles mal zu erklären, warum, ich hab das so, ich"}, {"id": 711, "start": 6243.4, "end": 6248.24, "text": "hab mir diese Domain irgendwann mal gekauft für 5 Euro im Jahr und die verwende ich lokal."}, {"id": 712, "start": 6248.24, "end": 6254.68, "text": "So, und damit das funktioniert, mach ich Let's Encrypt Zertifikate. Das hat der P-Hall doch"}, {"id": 713, "start": 6254.68, "end": 6260.32, "text": "auch nö. Konntest du nicht machen. Nein, konntest keine Wildcard Weiterleitung machen."}, {"id": 714, "start": 6260.32, "end": 6289.68, "text": "Hat er gesagt, ist ungültig. So, ja, aber das ist cool. Genau, also, und ich hol mir"}, {"id": 715, "start": 6289.68, "end": 6296.28, "text": "dann über Let's Encrypt und DNS, ja, ist das DNS Challenge, hol ich mir für alle meinen"}, {"id": 716, "start": 6296.28, "end": 6305.12, "text": "lokalen Hosts Zertifikate. So, das heißt, in der Regel ist es so, dass die mehr oder"}, {"id": 717, "start": 6305.12, "end": 6310.76, "text": "weniger alle auf meiner Kiste mit, wo 90% der Dienste drauf sind, laufen, wo auch eine"}, {"id": 718, "start": 6310.76, "end": 6315.56, "text": "Reverseproxy drauf ist, der die Zertifikate macht. Aber, manchmal kommt's vor, dass ich"}, {"id": 719, "start": 6315.56, "end": 6320.12, "text": "doch noch die einen oder anderen Sachen habe. Ja, dann vielleicht einfach nur für Namensauflösungen,"}, {"id": 720, "start": 6320.12, "end": 6324.24, "text": "nicht mit DNS. Also sprich, standardmäßig soll, die IPs gibt's übrigens nicht, bei"}, {"id": 721, "start": 6324.24, "end": 6329.76, "text": "mir lokal. Standardmäßig soll alles auf die Kiste mit Reverseproxy gehen, bis auf Ausnahme,"}, {"id": 722, "start": 6329.76, "end": 6334.32, "text": "das ist genau das, was ich brauch. Das ist echt nice. Das ist schon mal ne Sache, das"}, {"id": 723, "start": 6334.32, "end": 6342.24, "text": "überzeugt mich. Das ist was, was beispielsweise der DNS in, der Billig-DNS in dem Mikrotik-Router,"}, {"id": 724, "start": 6342.24, "end": 6346.28, "text": "den ich grad hab, nicht richtig hinbekommt. Der kann zwar auch Regex, aber hat Probleme"}, {"id": 725, "start": 6346.28, "end": 6350.88, "text": "mit der Reihenfolge hier. Das ist cool. Das gefällt mir. Das sammelt auf jeden Fall schon"}, {"id": 726, "start": 6350.88, "end": 6360.16, "text": "mal richtig Pluspunkte. Leute, ich Flashbang euch mal kurz. Mal mal das Interface angucken,"}, {"id": 727, "start": 6360.16, "end": 6370.32, "text": "wie das ausschaut. So, das ist cool. Was haben wir sonst noch? DNS Blocklists kann man auswählen,"}, {"id": 728, "start": 6370.32, "end": 6379.36, "text": "Cloudlists, DNS Rewrites, Custom Filtering Rules. Okay, damit ist wirklich nur gemeint."}, {"id": 729, "start": 6379.36, "end": 6387.12, "text": "Blocked Service. Ah, guck mal, man kann sogar sagen, Alter, ihr piss dich Immigur oder so"}, {"id": 730, "start": 6387.12, "end": 6397.48, "text": "und Skype und... Ich muss sagen, das UI gefällt mir besser. Die machen auch kein DHCP und"}, {"id": 731, "start": 6397.48, "end": 6402.08, "text": "so gedönst. Die konzentrieren sich wirklich nur auf DNS-Geschichten, was ich eigentlich"}, {"id": 732, "start": 6402.08, "end": 6429.0, "text": "ganz gut finde. Oder, ach doch, das macht doch DHCP. Was passiert jetzt? Hä? Ach so,"}, {"id": 733, "start": 6429.0, "end": 6436.68, "text": "weil es ein Docker ist. Ja, dann bringt mir das ja gar nichts. Aber das ist eine coole"}, {"id": 734, "start": 6436.68, "end": 6443.64, "text": "Sache. Das ist nice. Das gefällt mir. Ah, und hier hast du so die Standard-DHCP-Verwaltungsgeschichten."}, {"id": 735, "start": 6443.64, "end": 6451.4, "text": "Also, DHCP lasse ich auf meinem Router drauf, weil ich will jetzt nicht DHCP freischalten"}, {"id": 736, "start": 6451.4, "end": 6459.16, "text": "dann überall da hin und dass es funktioniert. Und dann brauch ich auch ein DHCP-Relay und"}, {"id": 737, "start": 6459.16, "end": 6461.48, "text": "sonstige Geschichten. Nee, nee, das bleibt auf meinem Router drauf. DHCP macht das schon"}, {"id": 738, "start": 6461.48, "end": 6469.76, "text": "ganz gut. Aber das gefällt mir. Ich muss euch ehrlich sagen, so schwer zu sagen, mein Bauchgefühl"}, {"id": 739, "start": 6469.76, "end": 6477.72, "text": "irgendwie gefällt mir AdGuard besser. Wer steckt denn da dahinter? Nicht, dass da jetzt"}, {"id": 740, "start": 6477.72, "end": 6496.92, "text": "die China-Chinesen am Start sind oder so. WeChat. AdGuard Software Limited. Okay, die"}, {"id": 741, "start": 6496.92, "end": 6500.56, "text": "kommen aus England wahrscheinlich, wenn es die Limited ist. Würde ich mal vermuten."}, {"id": 742, "start": 6500.56, "end": 6510.56, "text": "Der AdBlock. Früher war AdBlock Plus das Beste, bis sie dann irgendwann ihren Kram, ich weiß"}, {"id": 743, "start": 6510.56, "end": 6516.4, "text": "nicht ob die, wurde AdBlock Plus verkauft oder haben die irgendwann angefangen käuflich,"}, {"id": 744, "start": 6516.4, "end": 6521.64, "text": "sich quasi Ausnahmen käuflich zu machen oder so. Zumindest ist AdBlock Plus total aus der"}, {"id": 745, "start": 6521.64, "end": 6536.08, "text": "Mode gekommen. Wo kommen die denn her? Limited klingt immer nach England. Oder nach UK muss"}, {"id": 746, "start": 6536.08, "end": 6557.4, "text": "man ja eigentlich sagen. Kontaktieren sie uns. Moskau. Die Cokomodazins. Okay, ich sag"}, {"id": 747, "start": 6557.4, "end": 6567.88, "text": "mal, das macht es jetzt nicht unbedingt so viel vertrauenswürdiger. Hatten die nicht"}, {"id": 748, "start": 6567.88, "end": 6573.84, "text": "auch ein Malware im Addon? Ernsthaft? Ah ne, du meinst AdBlock. Du meinst AdBlock Plus,"}, {"id": 749, "start": 6573.84, "end": 6581.68, "text": "ne? Ja, die waren ganz, ganz merkwürdig dran. Es gibt einen Addon für Home Assistant, genau,"}, {"id": 750, "start": 6581.68, "end": 6595.84, "text": "ja das ist richtig, aber das werde ich nicht benutzen. Wieso macht so eine Firma sowas"}, {"id": 751, "start": 6595.84, "end": 6600.44, "text": "Open Source nutzbar in Docker? Wahrscheinlich um Vertrauen in das Produkt zu schaffen."}, {"id": 752, "start": 6600.44, "end": 6604.92, "text": "Weil ganz im Ernst, viele Leute sind heute, zumindest technisch interessierte Leute, und"}, {"id": 753, "start": 6604.92, "end": 6610.28, "text": "an das hier richtet sich das ja. Die sind misstrauisch, wenn da aus Russland irgendwie"}, {"id": 754, "start": 6610.28, "end": 6617.12, "text": "einer mit Closed Source DNS Server herkommt, da wäre ich auch misstrauisch. Oder mit Closed"}, {"id": 755, "start": 6617.12, "end": 6620.32, "text": "Source DNS Manager, das ist ja kein eigener DNS Server wahrscheinlich. Ich weiß nicht,"}, {"id": 756, "start": 6620.32, "end": 6625.6, "text": "was die verwenden. Ich hoffe mal nicht Bind oder so, oder anbauen vielleicht. Es gibt"}, {"id": 757, "start": 6625.6, "end": 6629.16, "text": "da zig Varianten. So, und jetzt können wir mal gucken, was die verkaufen, mit was die"}, {"id": 758, "start": 6629.16, "end": 6637.56, "text": "Geld verdienen. Edgard V., natürlich. Achso, ich hab's ja ausgeschaltet und meine, ja"}, {"id": 759, "start": 6637.56, "end": 6654.88, "text": "ist gut. Hallo? Okay, was auch immer es macht, ich weiß es nicht. Aber es funktioniert jetzt"}, {"id": 760, "start": 6654.88, "end": 6667.2, "text": "wieder. So, und natürlich verdienen die da auch wieder mit so komischen, mit komischen"}, {"id": 761, "start": 6667.2, "end": 6671.84, "text": "Gedönsgeld, wie VPN und sonst was. Ich denke mal, das ist einmal um Vertrauen zu schaffen,"}, {"id": 762, "start": 6671.84, "end": 6675.6, "text": "dass die Leute das überhaupt verwenden. Deswegen machen die das Open Source und bieten's kostenlos"}, {"id": 763, "start": 6675.6, "end": 6681.64, "text": "an. Dann haben die zusätzliche andere Services, mit denen man Geld verdienen kann. Und was"}, {"id": 764, "start": 6681.64, "end": 6687.72, "text": "haben sie sonst noch? Und das Ganze gibt's wohl auch in irgendeiner käuflichen Variante."}, {"id": 765, "start": 6687.72, "end": 6703.76, "text": "Edgard DNS, was ist das? Ach, man kann quasi den in DNS direkt verwenden. Okay, ne, das"}, {"id": 766, "start": 6703.76, "end": 6712.84, "text": "muss auch nicht sein. Was verwenden die für den DNS? Edgard anbauend, ist es denn anbauend?"}, {"id": 767, "start": 6712.84, "end": 6728.2, "text": "Was? Okay, wir gucken jetzt mal. Github, Edgard. Mich interessiert, was die für einen DNS"}, {"id": 768, "start": 6728.2, "end": 6736.96, "text": "unten drunter verwenden. Na gut, das hier ist ja nur das Web Interface, da sieht man"}, {"id": 769, "start": 6736.96, "end": 6749.28, "text": "das dann. Natürlich. Haben die denn eigenen DNS in Go? Kann das sein? Nein, nein, ich"}, {"id": 770, "start": 6749.28, "end": 6752.72, "text": "meine nicht, welchen DNS-Server der als Upstream verwenden. Ich meine, welchen DNS-Server die"}, {"id": 771, "start": 6752.72, "end": 6760.68, "text": "intern verwenden. Welche Software verwenden die, um eine DNS-Anfrage zu responden und"}, {"id": 772, "start": 6760.68, "end": 6772.48, "text": "zu plocken und zu machen? Also DNS-Mast ist es bei PyHole. Die müssen den eigenen DNS"}, {"id": 773, "start": 6772.48, "end": 6777.28, "text": "haben. Wie soll das Ding mir auf DNS-Anfragen antworten, wenn sie keinen DNS haben? Das"}, {"id": 774, "start": 6777.28, "end": 6787.28, "text": "muss irgendeine Art von DNS-Software drin sein, damit das funktioniert. So wie auf der Fritzbox"}, {"id": 775, "start": 6787.28, "end": 6796.16, "text": "auch ein DNS-Server läuft. Das ist komplett, das ist komplett Go, hm? Client, guck mal."}, {"id": 776, "start": 6796.16, "end": 6812.48, "text": "Die haben einen eigenen DNS-Server in Go. Find ich eigentlich gar nicht verkehrt. Ich"}, {"id": 777, "start": 6812.48, "end": 6820.16, "text": "meine, die machen ja nur, nennen wir es mal, nur neueres Standardzeug. Ich könnte mir"}, {"id": 778, "start": 6820.16, "end": 6824.32, "text": "vorstellen, da ist ein DNS-Server relativ übersichtlich, weil die sind Oldschool-Sachen."}, {"id": 779, "start": 6824.32, "end": 6829.76, "text": "Gerade Bind, Bind kann ja alles. Also, ich weiß nicht, hatte schon mal die Aeron musste"}, {"id": 780, "start": 6829.76, "end": 6836.92, "text": "Bind konfigurieren. Hattet ihr schon mal den Spaß, musste Bind, Bind-Zonen-Konfig so was"}, {"id": 781, "start": 6836.92, "end": 6854.4, "text": "machen. Was, schau dir mal, Master, ein, du meinst den Branch, eh, Internal-DNS-Forward."}, {"id": 782, "start": 6854.4, "end": 6859.72, "text": "Anbaut und Bind sind dann DNS-Server, die lokal bei dir laufen. Ja, im Prinzip, auf"}, {"id": 783, "start": 6859.72, "end": 6864.8, "text": "der Fritzbox wird wahrscheinlich auch ein DNS-Mask laufen, unter der Haube. Du kannst"}, {"id": 784, "start": 6864.8, "end": 6869.76, "text": "ja bei dir auch, du trägst deine Fritzbox als DNS ein, die Fritzbox leitet das weiter,"}, {"id": 785, "start": 6869.76, "end": 6873.88, "text": "aber dieses Weiterleiten, das muss ja irgendeine Software machen. Und, ich weiß nicht, was"}, {"id": 786, "start": 6873.88, "end": 6882.48, "text": "die Fritzbox, FritzOS, ob die DNS-Mask, was die verwenden, keine Ahnung. Oh, das ist"}, {"id": 787, "start": 6882.48, "end": 6890.56, "text": "ne gute Idee. Nmap, Nmap-Dingserkennung, ja. Aber das ist echt, das ist echt was Eigenes,"}, {"id": 788, "start": 6890.56, "end": 6901.28, "text": "guck mal, ich muss, ich muss gar nicht gucken, das ist echt was Eigenes in Go. Ich mein,"}, {"id": 789, "start": 6901.28, "end": 6906.08, "text": "wir können's mal ausprobieren. Ah ne, ich hab's schon gestoppt. Draht ich's einfach"}, {"id": 790, "start": 6906.08, "end": 6920.72, "text": "wieder. Okay, da löst er auf. Was muss man machen? Nmap, Minus, ich glaub dir jetzt einfach"}, {"id": 791, "start": 6920.72, "end": 6928.84, "text": "mal, dass das so stimmt. Und das kann ich mir mal nicht merken, wie diese Analysegeschichte"}, {"id": 792, "start": 6928.84, "end": 6939.84, "text": "von Nmap funktioniert, also mit welchem Kommando. Ah ne, umgedreht, Minus NSV. Konnte man das"}, {"id": 793, "start": 6939.84, "end": 6949.04, "text": "einfach so machen? Ne, wie ging das jetzt? Musste man nicht an Minus P machen oder sowas?"}, {"id": 794, "start": 6949.04, "end": 6974.8, "text": "Ne, äh, ach, zu scheiße. Nmap-Sündags, alter. Es war Minus Klein P, ist es. Aha. Oh, der"}, {"id": 795, "start": 6974.8, "end": 6990.48, "text": "wird wohl nicht gerne gescannt, hä? Okay, schauen wir mal, was da rauskommt. Okay, ähm,"}, {"id": 796, "start": 6990.48, "end": 6995.44, "text": "die haben aber echt, wie's aussieht, was komplett Eigenes in Go, was DNS macht. Das"}, {"id": 797, "start": 6995.44, "end": 6999.92, "text": "finde ich, das macht's mir eigentlich recht sympathisch, weil, wisst ihr, was das Coole"}, {"id": 798, "start": 6999.92, "end": 7006.48, "text": "daran ist? Wenn die da irgendwie ein wild zusammengefrickeltes Docker-Image hätten,"}, {"id": 799, "start": 7006.48, "end": 7011.08, "text": "mit sich Sachen nachinstalliert und so. Hier kannst du dir echt den kompletten Sourcecode"}, {"id": 800, "start": 7011.08, "end": 7018.56, "text": "angucken und das schafft schon ein gewisses Vertrauen in den Laden, dass die keine versteckten"}, {"id": 801, "start": 7018.56, "end": 7024.32, "text": "Dinger machen. Eigentlich eine gute Idee. Also, ich finde die Idee, das neu zu basteln,"}, {"id": 802, "start": 7024.32, "end": 7031.6, "text": "so gar nicht mal so schlecht. Okay, der Endwap hat keinen Bock. Nice, nice. Also, ich muss"}, {"id": 803, "start": 7031.6, "end": 7037.56, "text": "euch ehrlich sagen, also, ich hab ja vor einer Weile schon mal, vor Jahren, mal Pie-Haul"}, {"id": 804, "start": 7037.56, "end": 7042.44, "text": "am Start gehabt, das fand ich ganz okay, aber Seiten haben dann irgendwann lahm geladen,"}, {"id": 805, "start": 7042.44, "end": 7047.04, "text": "weil die DNS-Sachen getimautet haben und, äh, da hab ich's wieder abgeschafft, zumal"}, {"id": 806, "start": 7047.04, "end": 7051.88, "text": "das mit iOS-Apps eh nicht richtig funktioniert. Gerade, ob bei denen dies ankommt. Aber ich"}, {"id": 807, "start": 7051.88, "end": 7056.64, "text": "muss sagen, Edgard hat zwar prinzipiell die gleichen Probleme, aber hat ein paar zusätzliche"}, {"id": 808, "start": 7056.64, "end": 7060.24, "text": "Sachen, die ich ziemlich gut finde. Wie zum Beispiel, dass man Wildcard-DNS-Einträge"}, {"id": 809, "start": 7060.24, "end": 7065.36, "text": "machen kann und sowas. Ähm, also im Web-Interface, ne, dass man das mit DNS-Masken in der Konflikt"}, {"id": 810, "start": 7065.36, "end": 7069.76, "text": "machen kann, ist mir auch klar. Das finde ich ehrlich gesagt ganz cool. Ich glaub, das"}, {"id": 811, "start": 7069.76, "end": 7076.0, "text": "probier ich echt mal bei mir lokal aus. Ja, ich glaub, das probier ich echt bei mir mal"}, {"id": 812, "start": 7076.0, "end": 7083.08, "text": "lokal aus. So, scrollen wir mal runter, was hab ich übersehen? Äh, ziemlich viele, auch"}, {"id": 813, "start": 7083.08, "end": 7087.84, "text": "hier im Stream. Aber ehrlich gesagt hab ich das hauptsächlich genommen, weil das angenehm"}, {"id": 814, "start": 7087.84, "end": 7095.84, "text": "zu gucken ist, Plants vs. Zombies Gameplay bei mir auf YouTube. Und, äh, weil ich ein"}, {"id": 815, "start": 7095.84, "end": 7103.72, "text": "bisschen längeres Gameplay gebraucht hab. Ja, gibt's ja auf iOS nicht, das ist ja das"}, {"id": 816, "start": 7103.72, "end": 7125.68, "text": "Problem. Nein, hab ich nicht gemacht. Oh, ich bin ja wieder richtig hinten dran. Ja,"}, {"id": 817, "start": 7125.68, "end": 7128.28, "text": "aber da muss ich selbst die Konflikt machen, da hab ich ja keinen Bock drauf. Ich weiß,"}, {"id": 818, "start": 7128.28, "end": 7131.96, "text": "dass man das theoretisch machen kann. Ich könnte mir einfach auf meiner Ubuntu-Kiste"}, {"id": 819, "start": 7131.96, "end": 7134.72, "text": "einen Container mit dem DNS-Server drauf hinstellen und das selbst machen, aber ich"}, {"id": 820, "start": 7134.72, "end": 7138.68, "text": "find's halt praktischer. Das machst du alle Schaltjahre mal, wenn du jedes Mal neue die"}, {"id": 821, "start": 7138.68, "end": 7147.32, "text": "Syntax angucken musst, das über ein Webinterface zu machen. Ich denke schon, warum soll das"}, {"id": 822, "start": 7147.32, "end": 7172.4, "text": "nicht gehen? Das hängt ja vom Dienst ab, nicht vom Raspberry Pi. Das hatten wir ja"}, {"id": 823, "start": 7172.4, "end": 7184.68, "text": "alles schon. Hatten wir alles schon. Du meinst, du meinst, die chinesische Volkspartei, irgendwie"}, {"id": 824, "start": 7184.68, "end": 7189.92, "text": "hat's mir das in letzter Zeit angetan, irgendwie China so dumm auszusprechen, obwohl ich das"}, {"id": 825, "start": 7189.92, "end": 7197.2, "text": "selbst total bescheuert finde und ich Leute auslache, die China sagen anstatt China. Meine"}, {"id": 826, "start": 7197.2, "end": 7208.84, "text": "neue Lieblingskombination von Wörtern ist die China-Chinesen. Das fand ich echt interessant"}, {"id": 827, "start": 7208.84, "end": 7216.56, "text": "zu sehen, dass sie das komplett in Go nachprogrammiert haben, die DNS-Geschichte. Hey Max, machst"}, {"id": 828, "start": 7216.56, "end": 7224.16, "text": "du das Ganze auf einem extra Board? Normalerweise schon, aber zum Testen hab ich das jetzt in"}, {"id": 829, "start": 7224.16, "end": 7230.72, "text": "meiner Linux-VM hier gemacht. Guck da, hier. Ah, Linux-VM. Linux-VM mit Docker-Stells drauf."}, {"id": 830, "start": 7230.72, "end": 7239.12, "text": "Da haben wir ein Prometheus drauf, kann ich mich gar nicht mehr dran erinnern. Und Grafana,"}, {"id": 831, "start": 7239.12, "end": 7249.36, "text": "was hat man damit mal gemacht? Keine Ahnung. Woah. Alter, was hab ich denn hier für 30"}, {"id": 832, "start": 7249.36, "end": 7254.24, "text": "Billiarde, boah. Warum hab ich hier so viele 50 Billiarde Images drauf? Egal, lassen wir"}, {"id": 833, "start": 7254.24, "end": 7262.88, "text": "alles drauf. Lul. So. Oh, ich hab ein verbotenes Emote verwendet, Leute. Zulul gibt's ja nicht"}, {"id": 834, "start": 7262.88, "end": 7271.84, "text": "mehr. Ich hab's doch in meinem Emote-Board drinne. Monka Toss Zulul, Alter. Black Gefaceder"}, {"id": 835, "start": 7271.84, "end": 7293.44, "text": "Total Biscuit. Jetzt hier, Anzeige ist raus. Anzeige ist instant weg. NextDNS, nee, das"}, {"id": 836, "start": 7293.44, "end": 7299.56, "text": "sagt mir nix. Okay, das, wenn ich so Titel schon lese, okay, das muss ich jetzt mal angucken,"}, {"id": 837, "start": 7299.56, "end": 7307.4, "text": "was ist das? NextDNS. Wie bloggst du jetzt auf iOS-Geräten? Ja, gar nicht so richtig."}, {"id": 838, "start": 7307.4, "end": 7312.08, "text": "Vor allem in YouTube und Twitch nicht, weil die nicht wollen und man auf iOS recht wenig"}, {"id": 839, "start": 7312.08, "end": 7318.36, "text": "dagegen machen kann. Weil OpenWRT, PFSense und OpenSense, ich hatte jahrelang OpenSense"}, {"id": 840, "start": 7318.36, "end": 7325.68, "text": "laufen, hab ich jetzt aber nicht mehr am Start. OpenWRT hatte ich auch mal vor Urzeiten mal"}, {"id": 841, "start": 7325.68, "end": 7337.36, "text": "auf, ich glaub, einem alten TP-Link. Nee, nicht TP-Link. Dingsnet. Wo läuft Lidl oder"}, {"id": 842, "start": 7337.36, "end": 7342.64, "text": "so, wie das jetzt OpenWRT, wo läuft das besonders gut drauf? Linksys, Linksys mein ich, nicht"}, {"id": 843, "start": 7342.64, "end": 7355.96, "text": "TP-Link. Linksys, hatte ich das mal auf einem uralten, auf so einem Ding, auf so einem uralten"}, {"id": 844, "start": 7355.96, "end": 7361.56, "text": "Teil hatte ich das mal laufen vor, vor Jahren. OpenWRT. Da war jetzt glaub ich noch die"}, {"id": 845, "start": 7361.56, "end": 7373.72, "text": "Idee WRT. Da hab ich lange nichts mal mitgemacht. OpenSense ist tatsächlich echt nice, aber"}, {"id": 846, "start": 7373.72, "end": 7379.08, "text": "warum ich das umgestellt hab, ist, ich hatte alles auf dieser, da muss ich jetzt das alte"}, {"id": 847, "start": 7379.08, "end": 7392.72, "text": "Serverraum Video mal zeigen. Nicht das hier auch nicht, das hier auch nicht. Wo ist mein"}, {"id": 848, "start": 7392.72, "end": 7414.12, "text": "Serverraum? Das ist das neue. Wo ist das alte? Wo ist das alte? Das da, das da mein ich."}, {"id": 849, "start": 7414.12, "end": 7419.48, "text": "Genau, ich hatte ja damals alles auf meiner 4HE-Kiste laufen, Internetzugang, Heimautomatisierung,"}, {"id": 850, "start": 7419.48, "end": 7423.28, "text": "blablabla, und das war mir schlicht und ergreifend, da hatte ich übrigens auch einen TP-Link"}, {"id": 851, "start": 7423.28, "end": 7430.08, "text": "Access Point, das ist auch schon 3 Jahre her, mittlerweile, nee, 4 Jahre her. Das ist mittlerweile"}, {"id": 852, "start": 7430.08, "end": 7433.44, "text": "also ein bisschen ausgebaut, aber auf dieser Kiste hatte ich jetzt alles laufen und unter"}, {"id": 853, "start": 7433.44, "end": 7440.12, "text": "anderem OpenSense für Internetzugang, das war mir aber zu viel SinglePoint of Failure."}, {"id": 854, "start": 7440.12, "end": 7447.2, "text": "Ich mein, das war eine ultrafette Kiste, die ist heute noch ziemlich gut. Das ist ein OctaCore"}, {"id": 855, "start": 7447.2, "end": 7456.72, "text": "Cell Xeon drin, 3x 10TB Platten und so, also das geht durchaus, das war 2007 da, das hat"}, {"id": 856, "start": 7456.72, "end": 7461.96, "text": "richtig Kohle gekostet, das ist heute immer noch ganz gut das Teil, aber ist jetzt nicht"}, {"id": 857, "start": 7461.96, "end": 7466.84, "text": "mehr im Einsatz, hat einfach nur unnötig Strom gefressen und ich hab kaum was damit"}, {"id": 858, "start": 7466.84, "end": 7474.72, "text": "gemacht. Ja, und ich hab das jetzt alles ein bisschen"}, {"id": 859, "start": 7474.72, "end": 7480.92, "text": "aufgesplittet, also sprich, Internetzugang mache ich über einen Mikrotik-Router, VoIP-Gedöns"}, {"id": 860, "start": 7480.92, "end": 7485.32, "text": "lasse ich die Fritzbox machen, weil dafür ist die RST ganz gut, ich hab da noch dieses"}, {"id": 861, "start": 7485.32, "end": 7490.92, "text": "doofes Unity Media Modem davor zwangsweise, schon überlegt, ob ich nicht einfach mal"}, {"id": 862, "start": 7490.92, "end": 7499.52, "text": "da anrufen soll und sag ich will eigenen Router verwenden, dann hab ich die ganzen Unify Access"}, {"id": 863, "start": 7499.52, "end": 7504.4, "text": "Points noch dazu für WLAN, also es ist viel weniger SinglePoint of Failure als früher"}, {"id": 864, "start": 7504.4, "end": 7509.4, "text": "bei mir, deswegen hab ich das alles von dieser, ne das ist kein, das ist ein Gen Pro Gehäuse,"}, {"id": 865, "start": 7509.4, "end": 7520.24, "text": "kein SilverSong, Gen Pro, das könnte sogar sein, ja das ist es, das ist echt cooles"}, {"id": 866, "start": 7520.24, "end": 7523.84, "text": "Gehäuse für die, für den, ich muss gucken, dass er das jetzt ein bisschen billiger bekommt,"}, {"id": 867, "start": 7523.84, "end": 7528.4, "text": "für die Heimanwendung, weil die haben sogar Staubfilter und sowas dabei, also der verwendet"}, {"id": 868, "start": 7528.4, "end": 7536.52, "text": "jetzt anscheinend keinen, aber das ist tatsächlich ganz gut gemacht, ja und das hab ich alles"}, {"id": 869, "start": 7536.52, "end": 7540.52, "text": "ein bisschen entzerrt und seitdem lebe ich deutlich entspannter, wenn mal was kaputt"}, {"id": 870, "start": 7540.52, "end": 7545.0, "text": "geht, ja, ich mein, ich konnte, als ich noch den ganzen Geschiss hier drauf, ich konnte"}, {"id": 871, "start": 7545.0, "end": 7549.16, "text": "meine Rolle nicht hoch und runter machen, wenn das einfach mal ausgefallen, also ausfallen"}, {"id": 872, "start": 7549.16, "end": 7558.52, "text": "sollte, ja und drüben Fernseher gucken, DVBC war da auch noch drüben, alles mögliche,"}, {"id": 873, "start": 7558.52, "end": 7563.72, "text": "wenn das Ding aus war, ging einfach im ganzen Haus gar nichts mehr, das war halt kacke,"}, {"id": 874, "start": 7563.72, "end": 7572.36, "text": "deswegen hab ich das alles ein bisschen auseinandergezogen, jetzt lebe ich deutlich entspannter, so und"}, {"id": 875, "start": 7572.36, "end": 7579.12, "text": "ich hab letztens ein Update gemacht zu meinem Serverraum, da war ich aber gerade beim Umbauen,"}, {"id": 876, "start": 7579.12, "end": 7582.88, "text": "da liegen die ganzen Sachen noch wild rum, die sind jetzt alle eingebaut, ich hab letztens"}, {"id": 877, "start": 7582.88, "end": 7589.08, "text": "auf Twitter auch mal ein Bild gepostet von, übrigens erstmal der Werkzeug-Flex, erstmal"}, {"id": 878, "start": 7589.08, "end": 7596.8, "text": "der Werkzeug-Flex, Werkzeug-Flex, ganz unauffällig, ganz unauffällig, einfach mal ein Bild Werkzeug-Flex"}, {"id": 879, "start": 7596.8, "end": 7604.4, "text": "gemacht, warum ich das jetzt 3 Stunden zeige, keine Ahnung, wahrscheinlich weil ich mein"}, {"id": 880, "start": 7604.4, "end": 7614.4, "text": "Werkzeug geil finde, keine Ahnung, warum ich das so lange gezeigt hab, so und, ah ne, das"}, {"id": 881, "start": 7614.4, "end": 7619.56, "text": "sieht man gar nicht, also jetzt siehts nämlich folgendermaßen aus, jetzt ist es viel besser,"}, {"id": 882, "start": 7619.56, "end": 7639.8, "text": "jetzt siehts so aus, bisschen anders jetzt noch, aber schon besser, hat sich Hetzner"}, {"id": 883, "start": 7639.8, "end": 7644.48, "text": "gemeldet, ja, ja, ja, aber ich hab noch nicht geantwortet, ich hab es auch erst vor 2 Tagen"}, {"id": 884, "start": 7644.48, "end": 7650.04, "text": "oder so gesehen, ich war jetzt andere Antworten da sofort drauf, aber ich hatte irgendwie"}, {"id": 885, "start": 7650.04, "end": 7659.08, "text": "letzte Tage nicht so viel Muße, mich um Büsse-Sachen zu kümmern, ja, so, so schaut es jetzt aus,"}, {"id": 886, "start": 7659.08, "end": 7663.28, "text": "ich hab es noch ein bisschen umsortiert, ja, ich hab beispielsweise das Drucker-Zubehör"}, {"id": 887, "start": 7663.28, "end": 7671.8, "text": "hier noch so dran gemacht, also diese Spachtel zum 3D-Drucker abschaben und sowas, hier oben"}, {"id": 888, "start": 7671.8, "end": 7680.08, "text": "ist auch nicht dieser Raspberry Pi mehr drauf, hier oben ist ein anderer Pi drauf für Octo-Pi"}, {"id": 889, "start": 7680.08, "end": 7685.2, "text": "und auch mit Gehäuse und die Kamera ist auch nicht mehr drauf, da hab ich jetzt meine einzig"}, {"id": 890, "start": 7685.2, "end": 7689.4, "text": "verbliebene Uni-Fi-Kamera hingestellt, hier vorne, die das aufnimmt, passt schon aber"}, {"id": 891, "start": 7689.4, "end": 7693.76, "text": "im Großen und Ganzen, das sieht immer noch so aus, bin ich echt froh, dass ich das umgebaut"}, {"id": 892, "start": 7693.76, "end": 7698.68, "text": "hab, ich hab mich da 2 Jahre vor gedrückt und hab es letztendlich gemacht, also passt"}, {"id": 893, "start": 7698.68, "end": 7704.68, "text": "echt gut und diese Werkzeug-Wand zu kaufen war eine super Idee, weil ich hab alles griffbereit"}, {"id": 894, "start": 7704.68, "end": 7711.04, "text": "jetzt und ich freu mich jedes Mal, wenn ich das aufmach und denk mir, Max, du hast mittlerweile"}, {"id": 895, "start": 7711.04, "end": 7716.08, "text": "richtig geiles Werkzeug-Sortiment, so, dann erstmal ne Runde vor meiner Werkzeug-Wand"}, {"id": 896, "start": 7716.08, "end": 7721.92, "text": "Salami gemacht und dann kann ich die Tür wieder zumachen, also deswegen bin ich froh,"}, {"id": 897, "start": 7721.92, "end": 7726.84, "text": "dass ich die Werkzeug-Wand gebaut hab, das ist immer wieder ein netter Anblick, wenn"}, {"id": 898, "start": 7726.84, "end": 7738.8, "text": "ich da rein gucke, ja, so, äh, bist du mit dem Drucker zufrieden?"}, {"id": 899, "start": 7738.8, "end": 7749.6, "text": "Ja, das ist ein, ähm, Anycubic E3 Mega S, der ist relativ günstig, gibt's auch aktuell"}, {"id": 900, "start": 7749.6, "end": 7754.64, "text": "noch, find ich ok, ja, aber wobei es halt mittlerweile durchaus bessere Drucker gibt,"}, {"id": 901, "start": 7754.64, "end": 7758.84, "text": "da ist es leistungsmäßig jetzt nach den 3 Jahren oder wie lange ich den hab, 2,5 Jahren"}, {"id": 902, "start": 7758.84, "end": 7765.96, "text": "oder so, ähm, oder 2 Jahre, 2 Jahre hab ich den glaub ich, ich würd mich mal schlau"}, {"id": 903, "start": 7765.96, "end": 7773.72, "text": "machen, was es da gibt, also nicht einfach nur kaufen, weil ich den hab, also ich bin"}, {"id": 904, "start": 7773.72, "end": 7780.68, "text": "für China, China ist das Beste, China sagt ja keiner, China und China auch net, ich kenn"}, {"id": 905, "start": 7780.68, "end": 7794.64, "text": "eigentlich nur China oder China, ja, Tale Scale, ja, mach ich gleich, die hatten mal"}, {"id": 906, "start": 7794.64, "end": 7803.96, "text": "extra Geräte extra für WRT ohne WRT Support, hä, ok, nice, weißt du warum manchmal PF"}, {"id": 907, "start": 7803.96, "end": 7809.84, "text": "Sense bei der CP einfach nicht antwortet, manche, nein, ich würde sagen es liegt vielleicht"}, {"id": 908, "start": 7809.84, "end": 7814.04, "text": "nicht an PF Sense, sondern je nach deinem Setup, sei es vielleicht ist es eine VM oder"}, {"id": 909, "start": 7814.04, "end": 7823.64, "text": "sonst wie, vielleicht am Netzwerk, an der Netzwerkanbindung, oder der Broadcast kommt"}, {"id": 910, "start": 7823.64, "end": 7830.6, "text": "nicht an, oder pff, keine Ahnung, kann ja alles sein, wie schalten die das eigentlich"}, {"id": 911, "start": 7830.6, "end": 7835.96, "text": "genau für eigene Router frei, kann man das Coax Kabel nicht einfach an zum Beispiel"}, {"id": 912, "start": 7835.96, "end": 7839.84, "text": "eine Fritzbox klemmen, doch, doch, kannst du machen, aber du hast das Passwort nicht,"}, {"id": 913, "start": 7839.84, "end": 7844.08, "text": "du brauchst die Zugangsdaten, oder aber die müssen deine Mac freischalten, ich weiß"}, {"id": 914, "start": 7844.08, "end": 7849.04, "text": "nicht wie die das genau handhaben, ich hab das noch nie gemacht, also es gibt zwei Möglichkeiten,"}, {"id": 915, "start": 7849.04, "end": 7858.04, "text": "woran das hängen kann, entweder die müssen die Mac freischalten für, ähm, da, Kelmo"}, {"id": 916, "start": 7858.04, "end": 7869.56, "text": "wolltest du das gerade echt in den Chat posten, ähm, genau, also entweder müssen die Mac"}, {"id": 917, "start": 7869.56, "end": 7874.08, "text": "von deiner Fritzbox explizit freischalten als das Endgerät, oder du brauchst irgendwelche"}, {"id": 918, "start": 7874.08, "end": 7877.8, "text": "Custom Zugangsdaten, die du da eintragen musst, deswegen, du kannst das anstöpseln,"}, {"id": 919, "start": 7877.8, "end": 7889.12, "text": "aber das geht erstmal nicht, äh, das sieht wie irgendein, ich hab keine Ahnung was sein"}, {"id": 920, "start": 7889.12, "end": 7898.12, "text": "soll, alter wer hat denn das schon wieder geschrieben, das ist ja Poggers, wer hat,"}, {"id": 921, "start": 7898.12, "end": 7905.92, "text": "wer hat, welcher, welcher Big Brain Mod hat, hat denn die Zusammenfassung für heute geschrieben,"}, {"id": 922, "start": 7905.92, "end": 7912.84, "text": "das ist ja mal richtig nice, guckt euch das mal an, wir haben jetzt sogar eine Zusammenfassung"}, {"id": 923, "start": 7912.84, "end": 7933.24, "text": "im Stream, was, was rausgekommen ist, das ist ja excellent, excellent, Stripes war's"}, {"id": 924, "start": 7933.24, "end": 7947.0, "text": "ja huge, guck mal wir haben so eine ganze Beschreibung was heute rausgekommen ist, richtig"}, {"id": 925, "start": 7947.0, "end": 7961.12, "text": "Next Level Mods, ja, oh, haben die nicht ursprünglich gesagt, es ist, es ist nichts passiert, dort"}, {"id": 926, "start": 7961.12, "end": 7965.28, "text": "wo die Rechner standen, hat's nicht gebrannt, haben die doch ursprünglich gesagt, oder,"}, {"id": 927, "start": 7965.28, "end": 7972.24, "text": "hat sich, hat sich dann wieder, hat sich das dann wieder geändert, Leute soll ich mal in"}, {"id": 928, "start": 7972.24, "end": 7976.8, "text": "die Mails rein gucken, ob Hetzner noch was geschrieben hat, wenn schon, haben die, haben"}, {"id": 929, "start": 7976.8, "end": 7980.16, "text": "die nur geschrieben, Max hast du unsere Mails nicht bekommen, weil ich nicht geantwortet"}, {"id": 930, "start": 7980.16, "end": 7989.36, "text": "hab jetzt die letzten Tage, aber ich bin immer noch scharf drauf was mit Hetznern zu machen,"}, {"id": 931, "start": 7989.36, "end": 7995.16, "text": "ich guck mal schnell, ob die geantwortet haben, nochmal, wahrscheinlich nicht, hoffe ich mal,"}, {"id": 932, "start": 7995.16, "end": 8022.32, "text": "weil ansonsten warten die drauf, dass ich antworte, nee, nee, zu Glück nicht, ansonsten"}, {"id": 933, "start": 8022.32, "end": 8038.4, "text": "eine dumme Werbung, die ESL schreibt, sie will meinen Account löschen, okay, oh, oh,"}, {"id": 934, "start": 8038.4, "end": 8045.48, "text": "der Shop hat jetzt auch DHL kontaktiert, ich hab euch doch gesagt, ich hab den Shop angeschrieben,"}, {"id": 935, "start": 8045.48, "end": 8048.32, "text": "wo ich das bestellt hab, wo es so langsam geht, die haben mir grad geantwortet, die"}, {"id": 936, "start": 8048.32, "end": 8056.04, "text": "haben jetzt auch DHL kontaktiert und DHL hat sie auch hingehalten, DHL hat sie auch hingehalten"}, {"id": 937, "start": 8056.04, "end": 8062.44, "text": "mit der Antwort, ähm, sie müssen sich erst an Leipzig wenden für mehr Details, alles"}, {"id": 938, "start": 8062.44, "end": 8076.24, "text": "klar, DHL ist echt CACW, die ESL hat deinen Account gelöscht, okay, nee, bei mir haben"}, {"id": 939, "start": 8076.24, "end": 8080.64, "text": "sie jetzt angedroht, wenn ich nicht irgendwas mache, wird der gelöscht, das ist mir egal,"}, {"id": 940, "start": 8080.64, "end": 8085.36, "text": "können den ruhig löschen, okay, dann muss ich morgen unbedingt mit Hetznern antworten,"}, {"id": 941, "start": 8085.36, "end": 8088.12, "text": "dass sie das nächste Woche sehen, so, also das sollte ich mir jetzt angucken, was ist"}, {"id": 942, "start": 8088.12, "end": 8095.32, "text": "das, DNS Next, Next DNS Protects you from all kind of security, Schretz, äh, Blocks"}, {"id": 943, "start": 8095.32, "end": 8106.44, "text": "and Stracks, Pricing, Moment, ist das, ist das DNS, seh ich das richtig, ist das DNS"}, {"id": 944, "start": 8106.44, "end": 8113.44, "text": "Blocker as a Service, also quasi, irgendeine Software, die bei denen in der Cloud läuft,"}, {"id": 945, "start": 8113.44, "end": 8122.72, "text": "die für mich DNS Blocking macht, das verwende ich nicht, sowas verwende ich nicht, okay,"}, {"id": 946, "start": 8122.72, "end": 8135.52, "text": "ich weiß nicht, also, da hab ich ja gar keine Ahnung, was die machen, auf der anderen Seite"}, {"id": 947, "start": 8135.52, "end": 8142.16, "text": "schlimmer als Google tracken wirds nicht sein, aber was hat es jetzt, was hat es jetzt genau"}, {"id": 948, "start": 8142.16, "end": 8147.88, "text": "mit Firewall zu tun, ich mein es kann keine Firewall sein, wenn ich dazu erstmal ins Internet"}, {"id": 949, "start": 8147.88, "end": 8152.76, "text": "dahin muss, ich glaub die haben einfach nur das Wort hingeschrieben, weil es sich cool"}, {"id": 950, "start": 8152.76, "end": 8171.28, "text": "liest, das hat mit Firewall überhaupt nichts zu tun, steht einfach nur Firewall da, okay,"}, {"id": 951, "start": 8171.28, "end": 8180.72, "text": "nice, so, was soll ich mir jetzt noch angucken, tailscale, most secure way to use WireGuard,"}, {"id": 952, "start": 8180.72, "end": 8193.92, "text": "zwei Factor Authentifizierung, okay, das kostet ja was, das ist jetzt VPN as a Service oder"}, {"id": 953, "start": 8193.92, "end": 8201.88, "text": "wie, oder wie funzt das, ist das zum selbst, ist das zum selbst installieren, oder wie"}, {"id": 954, "start": 8201.88, "end": 8208.4, "text": "funktioniert das, muss ich dann quasi mich von meinem iPhone zu tailscale verbinden und"}, {"id": 955, "start": 8208.4, "end": 8215.84, "text": "tailscale verbindet sich zu meinem Server daheim oder wie, das ist mir jetzt nicht so"}, {"id": 956, "start": 8215.84, "end": 8244.04, "text": "ganz ersichtlich, ja anscheinend, ah nee, ja doch anscheinend, oder sehe ich das richtig,"}, {"id": 957, "start": 8244.04, "end": 8258.16, "text": "okay, so ganz werde ich aus der Sache nicht schlau, aber VPN as a Service ist ein bisschen"}, {"id": 958, "start": 8258.16, "end": 8262.2, "text": "schwierig ehrlich gesagt, ich mein, da müsste ich denen ja Zugang zu meiner Infrastruktur"}, {"id": 959, "start": 8262.2, "end": 8271.68, "text": "geben, dass die das dann verbinden können, hm, wir können uns das ruhig im Stream mal"}, {"id": 960, "start": 8271.68, "end": 8275.16, "text": "angucken, das muss ich ja nicht zu einem internen Server machen, das reicht ja, wenn ich das"}, {"id": 961, "start": 8275.16, "end": 8286.0, "text": "zu, ähm, irgendeiner Hetzner 2,50 Euro Kiste mache, können wir das ruhig mal ausprobieren,"}, {"id": 962, "start": 8286.0, "end": 8292.16, "text": "im Stream, mir sind aber ehrlich gesagt Services immer schon zu spekt, bei denen ich nicht"}, {"id": 963, "start": 8292.16, "end": 8296.68, "text": "direkt auf den ersten Blick sehe, was die eigentlich genau machen und wie es funktioniert,"}, {"id": 964, "start": 8296.68, "end": 8309.12, "text": "also Top Level Übersicht, wie es funktioniert und Zero Tier habe ich schon mal gesehen,"}, {"id": 965, "start": 8309.12, "end": 8312.8, "text": "Zero Tier ist aber doch auch was, was du selbst insta, ach nee Moment, das verwechsel ich"}, {"id": 966, "start": 8312.8, "end": 8336.48, "text": "jetzt, so, es ist spät Leute, ja, sah so aus, ja, ich habe das demote nur für euch hinzugefügt,"}, {"id": 967, "start": 8336.48, "end": 8346.52, "text": "was ich unbedingt wollte Chat, oh das, was, DHL Express hat bei mir auch übelst reingeschissen,"}, {"id": 968, "start": 8346.52, "end": 8352.44, "text": "unsere Post, Hamachi, Alter, gibt's das noch, Moment, das muss ich jetzt mal nachgucken,"}, {"id": 969, "start": 8352.44, "end": 8380.92, "text": "Hamachi, gibt's das noch, lock me in Hamachi, buy lock me in, what, das kostet jetzt was,"}, {"id": 970, "start": 8380.92, "end": 8385.64, "text": "egal, das war früher, das war früher der Shit, das hat man, hat man damals, also früher"}, {"id": 971, "start": 8385.64, "end": 8399.48, "text": "immer verwendet, es war damals aber auch schon äußerst zweifelhaft, was da Sache ist, unsere"}, {"id": 972, "start": 8399.48, "end": 8403.88, "text": "Poste Sendung wollten sie nicht rausgehen, natürlich zurück und, oh Gott, die sind teilweise"}, {"id": 973, "start": 8403.88, "end": 8416.2, "text": "echt unfähig, wir sind in Deutschland bei allem, so überbürokratisch ey, Massive Preise,"}, {"id": 974, "start": 8416.2, "end": 8422.32, "text": "ja, aber richtig Massive waren die, ja ist so, könnt ihr euch so viel lustig machen wie"}, {"id": 975, "start": 8422.32, "end": 8431.16, "text": "ihr wollt, das juckt mich nicht, wupp old, subs haben wieder den Vorteil, die haben die"}, {"id": 976, "start": 8431.16, "end": 8449.48, "text": "richtigen Emotes, äh, die haben schon die richtigen Emotes dafür, ah, yes, genau, ich"}, {"id": 977, "start": 8449.48, "end": 8454.56, "text": "finde diesen Spruch so geil von den Excellent Simply Delivered, es, es, es ist ja weder"}, {"id": 978, "start": 8454.56, "end": 8459.44, "text": "Excellent noch ist es Simply und noch ist es Delivered, es ist gar nichts von allem dem,"}, {"id": 979, "start": 8459.44, "end": 8466.72, "text": "was DHL gerade macht, nix, nix davon, oh, ich muss mein, mein, mein, mein Adblock Addon"}, {"id": 980, "start": 8466.72, "end": 8476.56, "text": "wieder einschalten, äh, findet ihr auch dieses, die Firefox Navigation Übertriebens Paints"}, {"id": 981, "start": 8476.56, "end": 8483.64, "text": "Champ seit, seit circa 40 Versionen, seit Version glaub 58 oder wo sie das gemacht"}, {"id": 982, "start": 8483.64, "end": 8488.44, "text": "haben, die ist so, die ist so eklig geworden mittlerweile, ich will nicht sagen, dass die"}, {"id": 983, "start": 8488.44, "end": 8492.44, "text": "von Chrome viel besser ist, aber ich komm mit diesem, noch ein bisschen klassischerem"}, {"id": 984, "start": 8492.44, "end": 8498.04, "text": "Menü, in Chrome tatsächlich besser zurecht als mit, als mit diesem, diesem, ich find"}, {"id": 985, "start": 8498.04, "end": 8508.6, "text": "hier nix, ich find hier wirklich, ah, das ist so, oh, richtig schrecklich, äh, 59 war"}, {"id": 986, "start": 8508.6, "end": 8520.44, "text": "das, ja, genau, das ist grausam. Firefox, finde ich, hat eh ein bisschen seine Zielgruppe"}, {"id": 987, "start": 8520.44, "end": 8525.6, "text": "aus den Augen verloren, Firefox waren immer so die Technik, sagen wir mal, so interessierte"}, {"id": 988, "start": 8525.6, "end": 8530.96, "text": "Leute und die Technikgeeks und, ähm, du konntest auch mit Addons übelst viel abgedrehte"}, {"id": 989, "start": 8530.96, "end": 8535.52, "text": "Sachen machen und mit glaub 58 auch, mit dieser oder 48, ich weiß nicht, haben sie"}, {"id": 990, "start": 8535.52, "end": 8540.88, "text": "ja die, die alte Plugin Schnittstelle eingestellt und viele Plugins wurden auch nie wieder geupdatet,"}, {"id": 991, "start": 8540.88, "end": 8546.16, "text": "der alte, das alte NoScript in der Art und Weise gab es danach nie wieder, mittlerweile"}, {"id": 992, "start": 8546.16, "end": 8554.64, "text": "gehts wieder halbwegs, einfach alt mal tappen, ach du meinst das hier oben, das, das kenn"}, {"id": 993, "start": 8554.64, "end": 8560.8, "text": "ich, das kenn ich, das kenn ich, aber das ist trotzdem, das sieht das allein aus, dass"}, {"id": 994, "start": 8560.8, "end": 8565.04, "text": "das auch schon wieder immer so schwierig zugänglich ist, ja, aber da fehlen glaub ich sogar,"}, {"id": 995, "start": 8565.04, "end": 8569.0, "text": "ich hab da letztens was gesucht, dass die updaten dieses Menü hier oben nicht mehr,"}, {"id": 996, "start": 8569.0, "end": 8573.68, "text": "da fehlen sogar einige Sachen, die du nur über die anderen Sachen, äh, über dieses"}, {"id": 997, "start": 8573.68, "end": 8589.36, "text": "andere Zeug da erreichen kannst. Chrome hat alles weggefickt, ja, äh, sie haben"}, {"id": 998, "start": 8589.36, "end": 8592.96, "text": "Chrome alles wegficken lassen, muss man auch dazu sagen, die haben sich ein bisschen verzettelt"}, {"id": 999, "start": 8592.96, "end": 8599.32, "text": "bei Firefox, erstmal mal Firefox US, dann äh, stellen wirs wieder ein, dann sagen wir"}, {"id": 1000, "start": 8599.32, "end": 8602.48, "text": "Thunderbird gehört nicht mehr zu uns, dann doch wieder, dann machen wir irgendwie Mozilla"}, {"id": 1001, "start": 8602.48, "end": 8606.0, "text": "Sync und schaffens wieder ab, dann machen wir irgendwie einen LinkShare Service und schaffen"}, {"id": 1002, "start": 8606.0, "end": 8610.32, "text": "den auch wieder ab, ähm, dann verschlimmt das, wenn wir laufen an irgendwie der Bedienbarkeit"}, {"id": 1003, "start": 8610.32, "end": 8615.52, "text": "von unserem Browser rum, schaffen Browser Plugin Schnittstellen ab, also es ist, ich"}, {"id": 1004, "start": 8615.52, "end": 8620.48, "text": "weiß nicht was Mozilla macht, aber einer der sich auf jeden Fall lohnt, der Mozilla"}, {"id": 1005, "start": 8620.48, "end": 8627.48, "text": "Chef, der bezahlt sich auf jeden Fall jährlich dicke Millionen, also der machts richtig, Firefox"}, {"id": 1006, "start": 8627.48, "end": 8634.08, "text": "sendt, ja, ja seh ich auch so, Mailclines zacken alle, aber Thunderbird geht noch, geht"}, {"id": 1007, "start": 8634.08, "end": 8650.4, "text": "noch ganz gut. Gibts das noch? Okay. Aber die haben was abgeschafft in der Richtung,"}, {"id": 1008, "start": 8650.4, "end": 8655.28, "text": "weil ich kann mich noch dran erinnern, dass es Diskussionen damals bei OwnCloud gab, ob"}, {"id": 1009, "start": 8655.28, "end": 8660.92, "text": "man das nicht supporten soll, dass man quasi Firefox sunken kann zu seinem eigenen Nextcloud"}, {"id": 1010, "start": 8660.92, "end": 8668.4, "text": "Server und, ähm, das wurde dann, da wurde dann irgendwie nie was draus, weil Firefox"}, {"id": 1011, "start": 8668.4, "end": 8684.16, "text": "gesagt hat, gibt es nicht mehr, aber vielleicht ist auch irgendwas anderes, ja, aber trotzdem,"}, {"id": 1012, "start": 8684.16, "end": 8688.44, "text": "ich finde Firefox, ich benutze ja auch hier scheinbar nicht Firefox, äh, ich finde Firefox"}, {"id": 1013, "start": 8688.44, "end": 8694.36, "text": "hat eine Sache, die ist besser als in Chrome und das ist nach wie vor dieses, äh, das"}, {"id": 1014, "start": 8694.36, "end": 8701.72, "text": "da links, äh, das Ding, wie heißt denn das, ähm, die Adressleiste, ne, wie nennt man"}, {"id": 1015, "start": 8701.72, "end": 8707.56, "text": "das, die, Awesome Bar heißt es bei Firefox, jetzt bin ich wieder drauf gekommen, genau,"}, {"id": 1016, "start": 8707.56, "end": 8711.6, "text": "die Awesome Bar heißt das bei denen, das ist immer noch besser als bei Chrome, weil das"}, {"id": 1017, "start": 8711.6, "end": 8716.52, "text": "Ding auch History und sonstige Favoriten und alles möglich durchsucht, da findest du teilweise"}, {"id": 1018, "start": 8716.52, "end": 8721.2, "text": "Seiten, da warst du vor 10 Jahren mal drauf, deswegen, ich, ich hab meine Firefox History"}, {"id": 1019, "start": 8721.2, "end": 8725.76, "text": "über die letzten 5 Rechnergenerationen immer mitgenommen, gerade deswegen."}, {"id": 1020, "start": 8725.76, "end": 8737.72, "text": "Ich hab nen Lese, Lesezeichen zum Hosten für Nextcloud, hieß das glaub ich, es ist aber"}, {"id": 1021, "start": 8737.72, "end": 8743.52, "text": "auch ein bisschen Paynes Champ und ich verwende es zumindest, ich, ich verwende das zumindest"}, {"id": 1022, "start": 8743.52, "end": 8747.6, "text": "ab und zu für manche, für manche Sachen zum Sünden, ja, aber ich bin zu dem Schluss gekommen,"}, {"id": 1023, "start": 8747.6, "end": 8751.56, "text": "dem ich ewig lang gesucht hab, wie ich Bookmarks sunken kann, dass Bookmarks sunken eigentlich"}, {"id": 1024, "start": 8751.56, "end": 8757.68, "text": "überhaupt nicht wichtig ist, ich verwende die meisten Sachen zu 99% an dem gleichen"}, {"id": 1025, "start": 8757.68, "end": 8762.48, "text": "Rechner daheim, mit dem gleichen Browser und ich brauch überhaupt keine Bookmarks"}, {"id": 1026, "start": 8762.48, "end": 8767.6, "text": "zu sunken, Bookmarks sunken ist eigentlich total offerrated, mobile brauch ich die ganzen"}, {"id": 1027, "start": 8767.6, "end": 8777.88, "text": "Bookmarks nicht, da hab ich andere, ja, also, ich sunke keine Bookmarks mehr, ich hab das"}, {"id": 1028, "start": 8777.88, "end": 8784.2, "text": "mal versucht mit Flocus da, mit dem Nextcloud Ding, ja, wie ist Edgard Pai heute ausgegangen,"}, {"id": 1029, "start": 8784.2, "end": 8788.16, "text": "wir haben jetzt sogar nen Kommando dafür, wie das ausgegangen ist, ich hab aber vergessen"}, {"id": 1030, "start": 8788.16, "end": 8794.4, "text": "wie das Kommando heißt, das Aufruf, das Ausrufezeichen DNS, Chat, ihr müsst mir helfen, wie war"}, {"id": 1031, "start": 8794.4, "end": 8811.2, "text": "das Kommando, ah, yes, DNS Blocker, genau, da steht es wie es ausgegangen ist, also mir"}, {"id": 1032, "start": 8811.2, "end": 8818.32, "text": "hat Edgard tatsächlich ein bisschen besser gefallen, kommt aber auf den Anwendungsfall"}, {"id": 1033, "start": 8818.32, "end": 8827.08, "text": "an, also es gibt sicherlich Konstellationen, dann ist Paihole das bessere, vor allem wenn"}, {"id": 1034, "start": 8827.08, "end": 8830.32, "text": "man schon ne Weile am Laufen hat und damit zufrieden ist, gibt es keinen Grund umzusteigen,"}, {"id": 1035, "start": 8830.32, "end": 8844.56, "text": "so Chat, lass mal ganz kurz gucken, ist da Frazier am Start oder so, ob man kurz wenig"}, {"id": 1036, "start": 8844.56, "end": 8856.8, "text": "hosten kann, Hopp, Visual Studios streamt, das irritiert mich immer, wenn ne IDE am Stream"}, {"id": 1037, "start": 8856.8, "end": 8867.24, "text": "ist auf Twitch, Semper Video, die haben wir das letzte Mal schon gehostet, ich war das"}, {"id": 1038, "start": 8867.24, "end": 8871.32, "text": "letzte Mal nicht im Stream danach, nachdem wir den gehostet haben, hat er den Host überhaupt"}, {"id": 1039, "start": 8871.32, "end": 8895.6, "text": "mitbekommen, der war so vertieft im Erzählen, hat er mitbekommen, nach 15 Minuten, ok, ah"}, {"id": 1040, "start": 8895.6, "end": 8901.6, "text": "verstehe, verstehe, der hat mich nur interessiert, ich hausse den auch ohne, dass da hier großartige,"}, {"id": 1041, "start": 8901.6, "end": 8905.44, "text": "ich hausse da auch Leute ohne, dass die großartige Sache zur Kenntnis nehmen müssen oder so,"}, {"id": 1042, "start": 8905.44, "end": 8911.44, "text": "hat mich nur interessiert, weil der war so vertieft im Erzählen, Martin, ja nice, dass"}, {"id": 1043, "start": 8911.44, "end": 8915.68, "text": "du es hierher geschafft hast, aber ich wollte jetzt gerade aufgehen, haustest du noch mal,"}, {"id": 1044, "start": 8915.68, "end": 8927.48, "text": "heute hauste ich keinen, heute geh ich off, ich bin müde, wobei, zeig mal her, das können"}, {"id": 1045, "start": 8927.48, "end": 8930.76, "text": "wir noch schnell machen, das können wir noch schnell noch machen, aber den hausten wir"}, {"id": 1046, "start": 8930.76, "end": 8956.36, "text": "nochmal, ups, Twitch, was macht er denn heute, weiß jemand wie alt Semper Video ist, das"}, {"id": 1047, "start": 8956.36, "end": 8961.2, "text": "wird mich echt interessieren, bei mir sagen die Leute ja immer, ich höre mich nicht an"}, {"id": 1048, "start": 8961.2, "end": 8979.44, "text": "wie 36, und bei ihm hätte ich von Anfang an gesagt, er ist älter, keine Ahnung, ok,"}, {"id": 1049, "start": 8979.44, "end": 8990.2, "text": "ich höre, wir raiden den jetzt, exzellent, ok Leute, ihr könnt ja mal eine Runde rum"}, {"id": 1050, "start": 8990.2, "end": 9011.36, "text": "spammen, also Leute, wir sehen uns, machts gut, bis denn, see you,"}]}