{"text": "Da sind wir und ich hoffe, dass der Stream 48 FPS hat, hoffentlich stimmt das jetzt was, ja wunderbar. Moment, stopp der Chat geht nicht, geht der Chat? Alter lahm geht der Chat, mal testen, der Chat geht nicht, Chat ist broken, jetzt geht der Chat, perfekt, ich wäre auch gern zu Hause zu sorgen. Ja, IRL ne. Ich habs mir auch überlegt, aber ich hatte kein Bock, außerdem wisst ihr ja, ich habs nicht so mit großen, mit sozialen Events mit vielen Leuten. So die große Preisfrage ist, was wir heute Abend machen, ich hab keine Ahnung, also, entweder grind ich meine BDO-Dailys jetzt erstmal, dass so viele jetzt überhaupt da sind, ist schon wieder geil. Gibt noch mehr No-Life-Leute wie ich. Moment, den Eax kann ich jetzt gerade mal anschreiben, ob wir nachher Placements machen wollen in Overwatch. Moment, das gucken wir jetzt gerade mal. Wir gucken gerade mal. Die Blizzard App, heißt die jetzt wieder Blizzard App oder Battle.net App? Das ist geil, die heißt wieder Battle.net App, ne? Leute, ich muss mal kurz meinen Browser-Tab refreshen, so ich seh jetzt kurz nicht, wenn ihr was im Chat schreibt. Ja, jetzt sollte es eigentlich wieder gehen. Ja. Gucken wir doch mal. Mal sehen wir doch gerade mal aus. Ich starte das Game mal schnell. Window-Capture, nein. Hallo? Warum geht das nicht? Eigentlich möchte ich jetzt... Ah, Moment, Moment, man macht kein Window-Capture, man muss Game-Capture machen, weil OBS sagt, das muss so sein. Ja, das funktioniert jetzt auch. Ok, wir gucken jetzt mal, ist denn die neue Season schon on, weil dann können wir auch die Placements machen, wenn ich den Eax dazu kriege, Placements zu machen. Ne, das hat... 3 Stunden ist zu lang. Also wir können jetzt ja schlecht 3 Stunden hier einfach nur da sitzen. Voodoo-Cloud muss arbeiten. Meinst du jetzt? Meinst du jetzt oder morgen? Morgen ist doch Feiertag. I'll be your Ukraine. Ok, also die Overwatch-Season ist nicht live. Dann mache ich mal BDO an und crying einfach mal ein bisschen, bis wir eine Ahnung haben, was wir machen können. Also wir haben auch noch zur Auswahl, dass wir entweder, also entweder, zwei Sachen, die zur Auswahl stehen, Moment, ich logg mich jetzt erst mal kurz ein. Zwei Sachen, die zur Auswahl stehen, sind entweder ich mache mal ein BDO, mein BDO daily grind, 300 Basis killen, 300 Centaurs killen, 300 Cuttreys killen oder irgendwie sowas. Vielleicht mache ich das. Oder wir spielen Plants vs. Zombies fertig, also das erste Tower-Defense-Spiel. Da sind wir jetzt ja quasi im letzten Drittel angekommen, also ich mache jetzt erstmal ein BDO an. Oder aber, was wir auch machen können, was wir auch machen können ist, wir gucken uns Katzenvideos an. Wir gucken uns Katzenvideos an, easy, oder? BDO ist eigentlich offen, BDO sollte jetzt angezeigt werden. BDO wieder angezeigt. Wir können uns Katzenvideos angucken, wir gucken uns jetzt, süße Katze ist sehr anhänglich, wir gucken uns jetzt an. Oh, die ist aber echt süß. Oh, was die für Geräusche macht. Oh, oh, kleines Katzi. Ah, ist das ein süßes Katzilein. Joa. Die will nicht weg. Ach, ist das niedlich. Kleines, feines Katzi. Ja, so muss das sein. Vor allem wenn es heute so knallt. Haben sie wieder Schiss. So, ich glaube nicht, dass wir uns den ganzen Abend Katzenvideos angucken wollen, oder? Erstmal den Viztacht einlocken. Deine Schicht beginnt um 23 Uhr. Ich arbeite in der Rezeption in einem 5-Sterne-Hotel. Ah, um 7.30 Uhr habe ich dann Feierabend. Das ist natürlich eine Scheißzeit. So, jetzt rennen wir erstmal zurück in irgendeine Stadt. Wir rennen jetzt zurück zu unserem Gaul und reiten mal zu unserem Richtung Craning-Spot hoch. Silvester in Black Desert. Ja, ich weiß es nicht. Also, wie gesagt, es steht so aus, weil entweder gucken wir uns Katzenvideos anspielen im Video, oder wir spielen Plants vs. Zombies fertig. Na, oder wir könnten Viewer Games in Overwatch machen. Das geht natürlich auch. Das geht natürlich auch. Moment, Evoli, weißt du, wie man Pols machen kann? Was heißt das? Pols? Pool? Pol, oder? Eine Abstimmung. Also, wir haben zur Auswahl Katzenvideos, wobei das nicht wirklich ernst gemeint ist, aber das können wir mal reinschreiben. Also, zur Auswahl stehen für die Abstimmung Katzenvideos. Das gewinnt jetzt wahrscheinlich, wenn ich das mit reinschreibe. Egal, das schreiben wir mit rein. Katzenvideos, Overwatch Custom Matches, also oder, bzw. Viewer Games, BDO, oder BDO Daily Mob Grind, oder Plants vs. Zombies. Kampagne fertig machen. So, ich mach mal einen Poll. Ne, ich mach schon. Straw Poll, oder wie das ging. So, gucken, dass ich jetzt nicht in irgendwelche Mops reinrenne. Oh, ich mach mal, ich mach mal eine Abstimmung. Also, was wollen wir? Ach, Overwatch, wie schreibt das? Viewer Games. Black Desert Daily Mob Grind, oder aber Plants vs. Zombies. Kampagne fertig. Das wird allerdings nicht bis 24 Uhr ausreichen, Plants vs. Zombies Kampagne. Generell, es muss ja nichts davon werden, bis 24 Uhr auslassen, man kann ja mehrere Sachen machen. Ok, Poll. So, einmal abstimmen, please. Wir könnten auch ganz, ganz abgedrehte Sachen machen. Katzenvideos auf der einen Seite und Plants vs. Zombies auf der anderen. So, ich reite jetzt aber erstmal hoch, ich muss hier eh weg. Welches Food ist denn hier dran? Wir müssen eh irgendwo rein, da ist es auf jeden Fall nicht schlecht, bei einer alten Nova zu reiten. Dass wir den Katzenvideos, wie gesagt, das ist nicht wirklich ernst gemeint, ne? Es war ja klar, dass die Katzenvideos gewinnt. Hast du keine EAS-Umbroker Korthüllen? Doch, Korthüllen habe ich noch. Ich warte mal in den Reacts, ob er mitspielen will, falls wir Overwatch machen. Brings die Quali ein bisschen besser sein, hoffe ich. Ich habe jetzt auf 48 FPS runtergestellt und Slower auf Medium. Encoding Zeit, also es müsste jetzt ein bisschen besser aussehen ohne zu ruckeln als gestern. Um Null über Placements? Ja, ich weiß, wir können nicht vorher Placements machen. Okay, also es ist bis jetzt ziemlich exakt gleich Stand zwischen Overwatch Custom Games und Plants vs. Zombies Kampagne und gefolgt von BDO. Gewonnen haben natürlich die Katzenvideos, das heißt wir müssen uns jetzt noch mindestens mal nebenbei ein, zwei süße Katzenvideos angucken. Dann würde ich vorschlagen, spielen wir jetzt erstmal Plants vs. Zombies fertig. Wir spielen erstmal Plants vs. Zombies fertig und danach machen wir Overwatch Games, da können wir uns nämlich aufwärmen für Null über Placements. Okay, jetzt haben wir die Plants vs. Zombies Kampagne und Plants vs. Zombies Kampagne. Reb, Rebdoka, was wolltest du denn haben? So, oh ne, oh jetzt wirds grausam wieder. Jetzt müssen wir mal Plants vs. Zombies erstmal wieder einstellen, dass man das Game richtig sieht. Okay, euer, ich ahne wieder Schlemmes. Ich ahne ganz Schlemmes. Okay, dann versuch ich das jetzt mal zu crabben. Geht nicht. Okay, das wolltest du wahrscheinlich wieder mit Game Capture machen. Das ist echt immer kompliziert, so ganzen Kackgames zu crabben. Kann das sein, dass Plants vs. Zombies wieder nicht erkannt wird oder was? Oh, jetzt ist wieder, der OBS Struggle ist wieder real. Das müssen wir jetzt erstmal wieder einstellen, aber ich weiß ja noch wie es funktioniert hat. Moment, Moment, ich hab die hier noch drin, Window Capture. Nein, das sind die Katzenvideos. Geht doch. So, jetzt müssen wir das Game leider wieder ganz eklig verschieben. So, easy. Okay, BDO muss ich jetzt, ich muss jetzt erstmal in BDO noch, ich muss jetzt erstmal in BDO noch, wir müssen jetzt zumindest noch hoch reiten, sonst sitz ich hier am Arsch der Welt. Wir müssen jetzt noch mal kurz hier hin reiten, dann können wir weitermachen. Stretched. Ja, es geht nicht anders, das Game ist 4 zu 3. Ich frag mich wie das auf der, so und während ich reite gucken wir uns noch Katzenvideos an. Oh, die ist aber auch echt süß. So ein kleines, feines Katzi. Jetzt drück doch mal Shift Mensch, warum soll ich Shift drücken? Hä? What? What Alter? Was? Shift? So, nächstes, was haben wir sonst noch für Katzenvideos zur, zu was haben wir sonst noch für Katzenvideos zur Auswahl hier? Dann rennt mein Pferd schneller, ich kann jetzt aber nicht auf YouTube gucken und mein Pferd schneller rennen lassen, das funktioniert nicht. Ich mach jetzt das, was laut Abstimmung am meisten gewünscht wurde und das sind auf einmal jetzt BDO Dailygrind. What the fuck? Wollt ihr mich rollen oder was? Eben war Plants vs. Zombies Kampagne noch erster, noch erster und jetzt ist BDO Mob Dailygrind und Overwatch Custom Games vorne. Was machen wir denn jetzt? Wo kann man hier abstimmen? Ja Moment, Schicks noch mal. So. Also Leute, ich gebe euch jetzt noch mal 5 Minuten Zeit zum abstimmen. In der Zeit gucken wir Katzenvideos und ich reite mit dem Pferd zum Grinding Spot und was dann oben ist, machen wir gefolgt vom anderen. Es sei dann, es sei dann Overwatch und Plants vs. Zombies liegen relativ nah beieinander, dann würde ich sagen, machen wir Overwatch zum Aufwärmen für die neue Season Richtung Null Uhr. Evoli hat, was ist das für ein Video? Katze? Ok, Moment Evoli, jetzt gucken wir uns jetzt an. BTF, was ist das? Das ist doch nachvertont, oder? Ich kann gerade kein Chat lesen, ich muss gerade 3 sagen, gleichzeitig nachkommen. Krass. Ich mach mal, ich mach mal die Musik aus, dass man das hört. Das ist doch krass. Aber noch mal, ich weiß nicht, ob ihr das gehört habt. Das klingt, als will einer so fake rülpsen. Das ist ja so Leute, die es nicht können richtig, die hören es schon auch so an. Wenn ihr wisst, was ich meine, das ist aber hart. Ich hätte erst gedacht, das ist bearbeitet oder so. Was kann man sonst noch für Katzenvideos zu bieten? Revo? Das hört sich an wie einer, ich finde das hört sich voll an wie einer, der versucht so, wisst ihr früher war es doch besonders cool, wenn man so, wenn man quasi so künstlich rülpsen konnte. Da fanden sie sich alle geil, wenn sie es kommen. Und die Leute, die es nicht konnten, also inklusive mir, ich habe mir das nie beigebracht, weil es irgendwie ziemlich sinnloser Skill ist, die haben dann auch einfach gemacht, weil sie es nicht hingekriegt haben. So, was sagt ihr jetzt? Also wir haben noch bis 35 Zeit abzustimmen, was wir machen sollen. Okay, das ist aber alles so ziemlich ähnlich. Das Problem dabei ist, wenn das so total aufgesplittet ist, wenn ich jetzt das eine mache, ist es nicht, was ein Drittel der Leute will. Wenn ich das andere mache, ist es nicht, was ein Drittel der Leute will. Was auf jeden Fall ein Viertel der Leute will ist Katzenvideos. Streamst du bis nächstes Jahr durch oder gehst du kurz vor 24 Uhr auf. Also ich glaube nicht, dass ich auf gehe. Also ich streame durch bis nächstes Jahr, allerdings wahrscheinlich nicht bis irgendwie morgen früh oder so. So, was haben wir sonst noch? Ich weiß nicht, ich finde Katzenbaby-Videos gar nicht so toll. Ich gucke am liebsten ehrlich gesagt Videos von ausgewachsenen Katzen. So dieses Oh alle Katzenbabys sind so süß ist auch das Problem, dass sich Leute immer mehr Katzenbabys kaufen und sie irgendwann ins Tierheim bringen, weil sie ja feststellen, dass Katzenbabys auch mal groß werden. Dann lieber so eine oder? Die ist doch wirklich süß hier. Die sieht fast ein bisschen aus wie Katz-FPS plus komplett halt, also vom Kopf her, plus wie komplett andere Farbe. Lul Katzenvideos, ja. Ja ich muss erstmal zum Grinding Spot. So was haben wir sonst noch hier? Katze fährt alleine S-Bahn. Die haben damit doch keine Schmerzen. Ach das ist ja nicht mal ein Video, das ist ja dumm. So lange die Katze in Ruhe lässt, ist es dennoch wurscht. Die legt sich dann da hin, denkt easy life. Hier wird in der S-Bahn gelegen, was juckt mich der Rest drumherum? Wenn man süße Katze eingibt, gibt es nur Babykatzen auf YouTube. Das finde ich so bescheuert. Ich gucke mir viel lieber auch im... singt, nein das ist bestimmt dummes Video. Leichter Clickbait Titel würde ich mal sagen. Die ist niedlich. Was haben wir sonst noch hier zu bieten? Die meisten funny Katz-Kompilations finde ich nämlich auch überhaupt nicht funny. Ich finde vieles generell nicht funny. Kennt ihr diese Videos, die im Titel haben irgendwie do not oder du schaffst es nicht nicht zu lachen oder so diese Videos, wo dann irgendwie mit 10 Minuten Video wetten du schaffst es, du hältst es nicht durch nicht zu lachen und sowas. Und ich weiß schon quasi am Anfang des Videos, dass das eigentlich total lustig ist. So okay, Abstimmung vorbei. Auf dem ersten Platz ist BDO Custom Games, auf dem zweiten Platz ist Overwatch Custom Games, auf dem zweiten Platz BDO Daily Mob Crimes und Plants vs. Zombie Kampagne. Allerdings ist alles so um die 30% rum. Eine 31%, andere 24%. Deswegen würde ich sagen, machen wir einfach alles. Ich meine wir haben noch 2,5 Stunden Zeit, das geht. Ich werde jetzt, wenn ich gerade schon dabei bin, wir machen Daily Catry Crime Quest, das ist easy, das geht schnell. Und dann muss ich mal gucken, wenn der Eax da ist, machen wir Custom Games. Eax, woher soll ich wissen, was du machen sollst, wenn dein Game ruckelt? So, okay, mal gucken, ob er dabei ist, mal schauen. Ist das Black Desert Online? Ja, ich stelle das mal auch kurz um, weil so in RL ist nicht wirklich richtig. Hat bei euch die Stream Kategorie aktualisiert? Hat bei euch die Stream Kategorie aktualisiert? Also ich hatte es jetzt eigentlich umgestellt auf Black Desert. Irgendwie hat es keinen Bock. Okay dann Bug Twitch, da muss man das wahrscheinlich über das Dashboard machen. Ich mache es über das Dashboard, über das Dashboard geht es immer. Twitch ist fast genauso kaputt wie ich, er tut mittlerweile immer sowas. Ähm, Black Desert Online, Informationen aktualisieren. So, jetzt sollte es aber geupdatet haben. Ne, vielleicht braucht das kurz. Was ist da schon wieder kaputt? Twitch, please. Was, YouTube funktioniert doch super. YouTube funktioniert super zum angucken, aber das YouTube, also dieses, dieses, wie nennt es sich, Creation Center oder so, äh, Creator Studio, das ist ganz grausam. Das gibt mittlerweile sogar intern zwei verschiedene Versionen, die man verwenden kann und dem einen geht das und dem anderen geht das noch nicht, also, Google, ja. Okay, Informationen aktualisieren, Dashboard, easy, live. So, jetzt steht es bei mir auf Black Desert, aber, ah jetzt, jetzt hat es umgestellt, Leute, ne? Hat es bei euch auch umgestellt? Jetzt ist, jetzt ist richtig. Jetzt steht es auf BDO. So, nice. Jetzt, jetzt hat es umgestellt. Twitch, ich hab das jetzt dreimal gemacht, dreimal exakt das gleiche, aber Twitch hat es, nope, kein Bock. Wie ist dein Familienname in BDO? Äh, Wubbel, was denkst du hier? Äh, Wubbel. Ähm, was denn? Ah, Evoliso Videoswitch blöd hat irgendwie einer seine Katze in die Badewanne gesetzt. Oder ihr gefällt's, aber ich find die guckt nicht so, als dass ihr gefällt. Ähm, was sagst du dazu, dass YouTube, nein, was sagst du dazu, dass Amazon auch einen YouTube rausbringen möchte? Ähm, ich find das nicht schlecht. Also, der letzte Versuch, übrigens, erinnert ihr euch noch, erinnert ihr euch noch, ist ja noch nicht lange her, an YouNow, erinnert sich da noch jemand dran? Wir kommen, Moment, das gucken wir uns jetzt noch mal kurz zusammen an. Das müssen wir, Leute, das müssen wir uns jetzt noch mal zusammen kurz angucken. YouNow, erinnert sich da noch jemand dran? War vor ein paar Monaten mal voll gehypt, kurzzeitig. YouNow, äh, wupps. So, YouNow. So, und jetzt zeige ich euch mal das Beste. YouNow, jetzt steht das natürlich da oben nicht mehr da. Ähm, oh, da ist es schon. Also, YouNow wird geschlossen. YouNow, also, noch vor ein paar Monaten. Nee, warte mal, wie hieß das noch? Hieß es nicht YouNow? Oh, ich hab's, doch, hieß doch YouNow, oder, was vor ein paar Monaten voll angesagt war. Oh, fuck, oder verwechsel ich das jetzt gerade? Moment, das kann sein, dass ich das jetzt verwechsel. Wit-WitMe meine ich, WitMe, nicht YouNow, WitMe, WitMe meine ich. Ach, so, äh, WitMe, genau. So, und, ähm, das Beste ist, dass WitMe, WitMe ist down. Das war also quasi vor ein paar Monaten noch der übelste Hype, und jetzt ist WitMe weg. Ja, Fabian, ich hab das schon vor eineinhalb Monaten oder so mal getwittert als ich gelesen hab, aber jetzt wollen wir, dass man das mitkriegt. So, und deswegen, und das war ja eigentlich nur jetzt zur Überleitung, warum ich das, ähm, um dazu was zu sagen, ob, äh, ob Amazon, also was ich dazu sage, ob Amazon denn jetzt in YouTube aufmacht oder wie ich das finde, ich finde das gut, denn ich bin nicht mit allem einverstanden, wie das YouTube handelt. Ob das Amazon besser macht oder schlechter macht, so, das muss ich dann alles noch zeigen, aber ich glaube, dass Amazon eigentlich so ziemlich der einzige Laden ist, der sowas machen könnte, was zu YouTube auch nur annähernd konkurrenzfähig sein kann. Ich trau das sonst eigentlich keinem anderen Laden so richtig zu. So, und, wenn man davon ausgeht, dass Amazon, quasi ein YouTube, ein FireTube oder wie auch immer, das bei denen heißen mag, ja, Amazon macht ja bei allem, muss ja bei allem Fire sein, deswegen wird FireTube hier eigentlich irgendwie mal ein ganz lustiger Name dafür, ähm, dann geh ich mal von aus, dass da am Endeffekt die Leute auch nur davon profitieren können, weil, geh mal mal von aus, es gibt zwei Seiten, es gibt zwei große Seiten, wenn man in Zukunft ausgeblickt, dann ist das jetzt für die Viewer nicht so das große Problem. Ich denke mal, das wird sich dann schon so etablieren, dass spezielle Sachen eben auf YouTube mehr sind und auf Amazon andere. Ich glaube jetzt nicht, dass es quasi, ähm, dann auf YouTube große Gaming-Channels und auf Amazon große Gaming-Channels, dass da quasi 50% Gaming auf YouTube passiert und 50% Gaming auf, auf, äh, auf Amazon FireTube oder wie auch immer das heißt, das glaube ich nicht. Ich geh mal davon aus, dass ich das dann so ein bisschen, dass, dass ich dann die Creators halt quasi für ihre Sachen das Beste raussuchen lasse. Könnte dann sein, dass beispielsweise auf YouTube weiterhin dieser ganze Prank und, und, äh, was weiß ich jetzt hier, Prank, Weinen, Dingsbums, Stumpfsinn läuft und vielleicht noch Gaming und sonst was. Es könnte natürlich sein, dass ich dann auf Amazon ein bisschen anderer Content durchsetze, dass es dann vielleicht nicht Gaming ist, dass dann irgendwelche, äh, sagen wir mal Wissenschafts-Channels oder so sagen, hey, da bietet uns Amazon dann jetzt das bessere Umfeld für. Könnte ja, könnte ja sein, ne. Also könnte ich mir auch, könnte ich mir auch wirklich gut vorstellen. Ähm, oder umgedreht, mal gucken. Wovon ich ausgehe ist, ich mach mal ein bisschen lauter, wovon ich ausgehe ist, dass wenn Amazon sowas starten wird, dass sie dann auch versuchen werden, dass sie dann auch versuchen werden ein paar bekannte Leute zu sich zu kriegen. Wobei man sich da fragen muss, ist das sinnvoll? Das versuchen ja viele, vielleicht macht das Amazon auch ganz anders, wenn ich mir das so überlege. Also viele, viele Seiten sowas wie, was gibt's da, was gab's denn da alles hier, ähm, Afrika, äh, äh, ähm, Azubu, äh, Hitbox owned und Gedöns, also viele dieser Seiten, Hitbox auch im deutschen Raum, haben ja versucht, quasi bekannte Leute zu ihnen zu kriegen. Wie hießen die Seite, auf der Faker früher gestreamt hat, der LOL-Faker, war das, war das, ähm, war das Azubu oder war das Afrika? Keine Ahnung, ich weiß es nicht. Zumindest hatte der wohl mit Sicherheit einen guten Vertrag, äh, hatte aber kaum Viewer im Vergleich zu dem auf Twitch. Auf Twitch hat er dann gestreamt, mit, mit, wie viel, weiß ich, wie viele Leute auf Twitch zugeguckt haben, bei ihm irgendwie 100.000 oder so total viel, also richtig massiv viel und, ähm, das heißt, es ist die Frage, ob es überhaupt sinnvoll ist, wenn man versucht von einer schon bestehenden Plattform, wo diese Leute ja eben auch ihre Fans haben. Ich mein, in PewDiePie, wenn der jetzt bei Amazon am Start ist, dann hat er halt, dann nimmt er ja nicht instanz eine komplette Fanbase mit, die ihn einfach nur auf YouTube verfolgt. Das klappt ja dann nicht. So, ich muss übrigens erstmal Quests abholen, für, äh, Monster killen, bevor ich hier anfange Monster zu killen. So, ähm, deswegen glaube ich fast, dass das bessere wäre, Moment, äh, Fabian, wo steht denn der komische NPC, der ist irgendwo hier oben auf dem Berg, ne? Falls du grad da bist. Hi, Eax. Ähm, deswegen glaube ich, dass es besser wäre, Amazon würde komplett drauf scheißen, was, ähm, was es für Leute auf YouTube gibt, sondern sich ihre eigenen Talente heranzüchten. Gehen wir mal zu Anne. Ich geh mal, ich hoffe mal, eine Quest gibt's hier oben, Daily Quests. Chimpanzee hat zum Beispiel Hitbox Hard supported. Ich gehe davon aus, der hauptsächliche Grund wird gewesen sein, weil Hitbox Hard ihn supportet hat. Weil ansonsten, ansonsten gibt es ja, also wenn man da keine Anreize bekommt von der jeweiligen Plattform, gibt es ja überhaupt keinen Anlass, auf einer Plattform zu streamen, wo du prinzipiell weniger Leute erreicht. Das ist ja mal absolut unsinnig, also aus Content-Creatorsicht. Es ist absolut unsicht, unsinnig, total widersinnig, eine Plattform zu wählen, zu supporten, wo es weniger Viewer gibt. Das ist total beknackt. So, das heißt, wenn man das macht, kann das nur daran liegen, dass man eben gute Konditionen mit dem Laden hat. Oder einem eben, wie man das bei manchen CSGO-Wettseiten gehört hat, an der Laden gehört. Äh, wie komme ich denn da jetzt überhaupt drauf? Ich stelle es mir da jetzt irgendwie rauf, das passt schon. Easy, easy life. Ich komme da bestimmt irgendwie rauf. Hier, so, der da mal hoch. Ich bin Wizard, habe Teleport, da ist überhaupt kein Ding. Ach nee, hier neben geht es ja hoch, sieht man ja. So, das heißt, wenn man mit so einen Laden dann gute Konditionen hat, dann klar, dass man das da macht. Aber ich glaube, es ist nicht der richtige Ansatz, sich Talente von anderen schon bestehenden Seiten abzuwärmen. Ich glaube für Amazon wäre der bessere Ansatz, quasi selbst Talente zu erzeugen bei ihnen, die bekannt werden. Weil es ist immer schwierig, es ist wirklich schwierig. Mal angenommen, du hast jetzt, ich sehe es ja im Endeffekt jetzt hier auf Twitch, wobei ich gleich sagen muss, ich finde das eigentlich gut. Wie komme ich denn hier hoch hier? Ich sehe es ja hier auf Twitch. Wenn man jetzt eine Fanbase hat, auf einer Seite, wie YouTube, da kannst du noch so oft was ankündigen oder erwähnen. Es gibt viele Leute, die folgen einfach YouTube, die folgen dem YouTube-Feed, wer was macht und gucken sich das an. Allerdings, wenn du dann in einem Video irgendwie sagst, ja, könnte man bei Twitch vorbeigucken oder so, da denken sie sich, ach so, eigentlich interessiert es mich nicht. Also quasi so komplette Fanbases zu transferieren von einer zu anderen Plattformen, das geht, also komplett, das geht eigentlich gar nicht. Daily, jawoll. Easy Daily. Defeat Catreys, 600 Stück. Okay, dann machen wir jetzt 600 Catreys und danach machen wir Overwatch Viewer Games. Weil Overwatch Viewer Games direkt vor Black Desert Mob Riot kommt. 600 Catreys dauert aber schon ein paar Minütchen noch. So, deswegen denke ich, also ich finde es gut, dass Amazon sowas wagen will und ich glaube Amazon ist der einzige Laden, der YouTube irgendwie Konkurrenz machen könnte und ich glaube, dass sowohl für die Zuschauer als auch für die Content Creator es nicht schlecht ist, wenn es mehrere Plattformen gibt. Ich glaube, also ich kenne keinen, ich will nicht sagen, dass es das nicht gibt, ich kenne eigentlich keinen Content Creator, der YouTube an sich so vom Handling her und so, also sowohl vom Handling her von der Seite als auch, wie das so, wie das für die Leute selbst ist, so wirklich geil findet. Du kannst mit YouTube nicht reden, vielleicht außer du bist PewDiePie, aber erinnert ihr euch noch daran als, wie hieß er, Ray William Johnson, als der Problem mit YouTube hatte und sich auch darüber aufgeregt hat, dass er nicht reden kann mit YouTube und es total schwierig ist, da zu kommunizieren und sowas und ich will auch sagen, der war zum damaligen Zeitpunkt der größte YouTuber, wenn der nicht mit denen in Kontakt kommen kann. Ja, hallo. So, also das kenne ich eigentlich keinen, der das geil findet. Und da könnte Amazon natürlich punkten und für die Zuschauer ist es natürlich auch nicht schlecht, wenn es ein bisschen Konkurrenz gibt, weil es gibt so viel gutes Zeug, was im Prank und was ist denn eigentlich gerade so alles im Trend, keine Ahnung, Prank und YouTube Shit Deutschland total untergeht. Wenn das auf einer anderen Plattform dann besser zur Geltung kommen würde, finden sich vielleicht auch ganz andere Leute, die dort gucken. Also ich sehe da schon Potenzial drin. Wie gesagt, ich denke, Amazon ist der einzige Laden, dem ich es zutrauen würde, sowas auf die Beine zu stellen, weil man sieht das ja an WitMe, selbst WitMe hatte ein bisschen Hype, aber du machst, du ziehst nicht einfach einen YouTube-Konkurrent auf, ohne Milliarden im Hintergrund zu haben. Für Technik, für Bewerben, für alles und Amazon hat halt Kohle. WitMe hatte keine Kohle, außerdem fand ich die WitMe-Seite auch nicht sonderlich tolle. Und es reicht ja auch nicht einfach, YouTube zu kopieren. Es bringt ja nichts, wenn man YouTube kopiert und im Endeffekt ein schlechteres YouTube macht, nochmal. Und dann auch ohne Geld so. Ja, also so sehe ich das mit Amazon und ihrer Videoplattform. Ich weiß nicht, gibt es dazu schon nähere Details? Ich bash jetzt den Boss erstmal. Gibt es dazu schon nähere Details, was sie eigentlich machen wollen? Ja, Amazon könnte das, klar könnte Amazon dadurch punkten, X-Silent LP, dass sie eben die Leute bezahlen, bei ihnen Content zu machen, aber ich finde, man hat das gesehen bei Azubu und den anderen Dingern, dass es nicht unbedingt das Beste ist, quasi bestehende Content-Creators zu holen, sondern man sollte bessere, neue Aushängeschilder für die eigenen Plattformen sich selbst erschaffen. Das Einzige, wie das funktionieren kann, quasi, nennen wir es mal YouTube-Konkurrent, wenn wir uns mal Twitch nehmen, heranzutüchten, ohne dass man Milliarden im Hintergrund hat wie Amazon. Wir dürfen nicht vergessen, dass Twitch mittlerweile auch zu Amazon gehört, das heißt Amazon ja in dem Bereich schon Erfahrung gesammelt hat mittlerweile und jetzt auch kein Unbekannter mehr ist, geht, wenn man sowas macht wie Gaming, also quasi auf eine Sache zugeschnitten, wie Twitch und das halt eben ziemlich gut macht, quasi kaum ordentlich Konkurrenz hat und YouTube jahrelang diesen Zweig links liegen lässt. Das Game Streaming bzw. Stream an sich war ja jahrelang bei YouTube überhaupt kein Thema und jetzt YouTube Live finde ich im Vergleich zu Twitch kacke, um ehrlich zu sein. Und das sage ich als hauptsächlich der YouTube Creator, der auf YouTube jetzt wahrscheinlich anstatt mit 89 Zuschauern wahrscheinlich mit 890 Zuschauern rumklebsen würde, wenn ich auf YouTube streamen würde. Aber ich finde Twitch ist einfach die eindeutig bessere Plattform, wenn es um Game Streaming geht. Das einzige, was Google hat gegenüber Twitch ist der meiner Meinung nach bessere Player und dass man halt vor und zurück kann, aber das könnten die mit Twitch, das könnten die bei Twitch garantiert auch so machen, dass du innerhalb von einem Video, also innerhalb von einem Livestream vor und zurück spulen könntest. Ich gehe davon aus, dass macht Twitch absichtlich nicht, weil du kannst ja immer noch in die Watts gehen und gucken, was macht Twitch absichtlich nicht, dass es so einen Charakter von Live hat. Das ist ja auch eine Sache, wovon Twitch letztendlich lebt, von diesem Live-Gefühl, von dem Chat, der dabei ist, dass du eben nicht sagst, ich gucke anonym mir jetzt diesen Stream an oder diesen Content an, sondern ich gucke mir den eben mit vielen Gleichgesinnten, gucke ich mir jetzt live diesen Content an. Man sieht auch schon, wie halbherzig das auf YouTube umgesetzt ist. Es gibt einen Live-Chat, allerdings wenn ich zurück spule in YouTube und dann im Chat was schreibe, quasi auf ein Ereignis, dann wird es im Live-Chat angezeigt, was natürlich übelst verwirrend ist für einen, der eine halbe Stunde hinten dran ist, auf YouTube im Player und dann im Chat was schreiben Leute sehen, ist die quasi live zuschauen. Das ist wieder so eines der 100 Sachen, die an YouTube nicht richtig durchdacht sind. Wenn ihr wollt, kann ich mich da ein bisschen länger zu auslassen, weil da gibt es echt viel dazu zu sagen. Ich habe mitbekommen, dass Dezember der beste YouTube-Monat ist. Dieser Inscope21 und seine Kollegen haben diesen Monat alle täglich in einem Video gemacht und gegenseitig verlinkt. Denkst du das war pure Gewinnmaximierung? Ich weiß beim Nico nicht, inwieweit er sich um die Sachen noch selbst kümmert oder da irgendwelche Management und Agenturen und Sachen dahinter sind, keine Ahnung. Es spielt bestimmt zum Teil mit rein und ich glaube auch, dass der Nico mittlerweile nicht der gleiche Nico ist wie noch vor ein paar Jahren. Aber für mich ist der Nico der originale deutsche Lifestyle-Channel. Alle anderen sind quasi Inscope-Fakes. Und der Nico an sich, da kann man eigentlich überhaupt nichts Negatives zu sagen. Zumindest den Nico, den ich kenne von vor ein paar Jahren noch. Über den kannst du echt nichts Negatives sagen. Und selbst wenn es Gewinnmaximierung ist, was sehr gut sein kann, solange der Konten den Zuschauern gefällt, ist es ja im Prinzip für beide gut. Kriegen die Leute mehr von ihrem Konten, der ihnen gefällt und man kriegt mal Kohle. Der Nico guckt hin und wieder noch meine, wie er ich weiß, hat er mir mal geschrieben. Find ich übrigens geil. Es gibt ja ein paar Leute, die kenn ich noch aus den Zeiten, wo sie nicht so groß waren. Und beim Nico kann ich mich halt noch dran erinnern, dass er schon immer Videos in der Richtung machen wollte. Er wusste das bloß nicht. Er wollte noch nie diese Standard-Call of Duty-Gameplay-Geschichten machen. Er wollte schon immer ein bisschen abgedrehte Dinge machen. Also was ist abgedrehte Dinge? Wo er sich selbst ein bisschen inszenieren kann und ein bisschen Blödsinn labern. Das kann er ja auch gut. Ein bisschen lustiges Zeug machen. Und der war schon ziemlich unglücklich zu der Zeit, wo er gedacht hat, es kommt nur gut an, wenn man seriöse Call of Duty-Videos macht. Das hat ihm nicht gefallen. Und deswegen ist es für mich auch so der originale Lifestyle-Channel überhaupt. Der macht nämlich wirklich das, weil er das gut findet und weil ihm das gefällt. Der macht nicht jetzt irgendwie, ich muss jetzt krassen Fitness und krassen Lifestyle und sonst was machen. Der wollte das im Prinzip schon immer machen. Er wusste bloß nicht genau, was es ist. Bis er es dann irgendwann rausgekriegt hat. Der Nico ist ja kein, ich mache Gameplay-Videos und werde jetzt zum Fitness-Channel und zum Lifestyle-Channel einfach nur, weil ich weiß, man kann damit mehr Kohle machen oder bessere Sachen verdienen. Nein, der hat das gemacht, weil er das andere eigentlich ursprünglich gar nicht mal so wirklich machen wollte. Schon immer was anderes. Zwingt zum Nico kann ich echt nichts negatives sagen. Zum Danny übrigens auch nicht, auch wenn den Danny viele nicht mögen. Ich meine, der Content vom Danny ist jetzt nicht unbedingt das, was ich mir angucke, um neue Synapsen im Gehirn zu bilden. Oder neue Verknüpfungen im Gehirn zu bilden. Aber da sagt er über ihn als Person X aus und es gefällt vielen Leuten. Das ist einfach auch Fakt. Oh, Eax, das ist nice. Das ist sehr nice. Easy Drop. Ja Eax, wie sieht es aus? Bist du gleich dabei? Viewer Games? Overwatch? Machen wir nämlich ein paar Viewer Games und recken quasi den Blattchat. Wobei die Hälfte wahrscheinlich besser ist als ich. Und je nachdem, wie fit ich bin, machen wir dann noch Placements um 0 Uhr. Was haltet ihr von dem Plan? Aber jetzt erstmal hier noch ein bisschen BDO-Quiet. Ich hab nicht gesagt Platt-Chat. Ich hab gesagt Platt-Chat. Das sagt man bei Overwatch so. Which chat in Overwatch ist automatisch Platt-Chat. Du weißt ja auch Don't write in chat if you are not high elo. 2000 plus. Das ist halt Overwatch-Meme gelaber. Catree Bash. Ähm, ja, um nochmal auf die Sache zurück zu kommen, dass Dezember der erfolgreichste Monat ist. Also Dezember ist definitiv der Monat, wo man am meisten Kohle machen kann. Das liegt an mehreren Faktoren. Zum einen, weil die Standard-Essence-Einnahmen im Dezember am höchsten sind. Und warum sind die Standard-Essence-Einnahmen im Dezember am höchsten? Weil halt alle Werbung machen wollen im Dezember für ihren Scheiß. Und dementsprechend, wenn alle Werbung machen wollen zur gleichen Zeit, ist es teurer. So. Und das gleiche gilt natürlich auch für alle Affiliate-Geschichten und Amazon. Bei Amazon kriegt man zwar nicht mehr, allerdings kaufen die Leute natürlich im Dezember mehr. Weil Weihnachten ist. Das ist im Prinzip eigentlich relativ logisch. Ähm, also ich hab kurz vor Weihnachten, also irgendwie 21 oder so mal geguckt. Ich kann das jetzt ja mal revealen. Und wenn ich jetzt, ich kann es euch nicht mehr genauer auf Offensiv sagen. Allerdings, und ich hab im Dezember auch viele Videos gemacht, ähm, waren die Einnahmen bei Amazon rein über Adlink. Irgendwo um wie 600 Euro. So. In dem Dreh. Ich müsste mal gucken, wie es jetzt ist. Wahrscheinlich dadurch, dass noch nicht alle Sachen von Weihnachten, ähm, durch waren, wahrscheinlich sogar noch ein bisschen höher. Und das einfach nur durch Amazon, äh, Raffling-Geschichten. Die keinem was kosten, außer Amazon. Also man sieht schon, dass Dezember da ein krasser Monat ist in der Richtung. Und das, obwohl ich das ganze Jahr über kaum was gemacht hab. Also ich kann mich noch an, äh, so irgendwie, weil man so 2013, 14 oder so erinnern, da war das im Dezember noch ne ganze Ecke mehr. Dezember ist der beste Monat. Oh man, ich, ich Kreisel-Kreinde war falsch. Hier muss ich hoch. Nee, ich hätte eigentlich da drüben hoch gemusst. Also nicht mal die Rotation kann er richtig fahren hier. Hab ich noch irgendwas übersehen? Im Chat jetzt, die letzte Zeit? Falls ich irgendwas überlesen hab, ähm, wenn ihr noch was wissen wollt, schreibt es einfach nochmal im Chat. Ich guck jetzt nochmal kurz. Mops, perfesst euch mal. Denkst du nicht, es wäre besser Twitch einfach zu erweitern mit Amazon, äh, FireTube oder wie auch immer es heißt. Ähm, hm. Ich glaube nicht, dass es so sinnvoll ist an Twitch jetzt noch mehr anzubauen als diese Game-Streaming-Geschichte, weil Twitch ist schon sehr eigen. Also Twitch, Twitch, allein schon der Twitch-Chat, ja, die Emo's und das Rumge-Meme und so, ähm, ist, ist sehr eigen. Und ich glaube, das ist für normale Viewer zu abgedreht, dass sie das lustig finden. Und das heißt entweder haben normale Viewer keinen Bock auf Twitch, sich das halt Sachen anzugucken, oder Twitch wird quasi verändert dafür, dass es den anderen Zuschauern besser gefällt. Und das ist beides was ich eigentlich kacke finde. Twitch soll so bleiben. Übrigens, ne, noch ein Grund warum ich denke, dass Amazon da der beste ist in YouTube-Konkurrenz zu machen. Viele Services, nachdem sie übernommen wurden von größeren Läden, haben sich meiner Ansicht nach zum negativen entwickelt. Und bis auf ein paar Sachen kann man bei Twitch eigentlich sagen, ist es besser geworden, seit Amazon Twitch hat. Ich mein, allein schon, dass es jetzt eine Chat-Aufzeichnung in VODs gibt. Und solche Dinger. Oh, nice, da können wir snipen. Das snipen wir gleich noch. 22.18. Ey, die sind, es, wisst ihr was, wir machen jetzt den easiest done the snipe of our life, machen wir jetzt. Alle, alle real life noobs, ja, sind auf irgendwie Silvester-Partys und sonst was und fühlen sich immer so richtig geil und überlegen, weil es ja also die krassen Checker sind. Und müssen wir sie natürlich auch bei jeder Gelegenheit erzählen. Und sonst snipen wir ihnen jetzt geil die Dande weg hier. Die real life noobs, naja. Umso älter man wird, habe ich das Gefühl, umso weniger Bock hat man auf real life Zeug. Wobei ich große, wobei ich Ansammlungen oder größere Ansammlungen von vielen Leuten, vor allem von vielen Leuten, die ich nicht kenne, noch nie gerne, noch nie gemacht hab. Weil da sind halt meistens immer so die übelsten Spasten dabei, ey. Leute, die man kennt, weiß vor allem, was Sache ist, ja. Vor allem, wenn es dann irgendwie so eine Veranstaltung ist, wo jeder dann irgendwelche Bekannten mitbringt und so. Und dann hast du dann Leute, die kennst nicht und sitzt dann den ganzen Abend mit denen da rum und musst dann irgendwie so voll auf funny machen oder die versuchen auf lustig und sonst was zu machen und die meisten Leute sind dann übelst Spaß. Oder ich bin einer und komm einfach mit den meisten Leuten nicht da. Das kann natürlich auch sein, ja. Katzen sind schon ganz nervös, also meine Katze hat es überhaupt nicht gejuckt. Meine Katze hat, also Katze, Dings hier unten, die du unten links siehst, die hat das überhaupt nicht gejuckt, Silvester. Die hat in der Ecke gelegen, hat gepennt und hat sogar sich auf, das war geil, ich glaube es gibt keine Katze, die sonst macht, die wollte sogar aus dem Fenster gucken. Ich hab die dann auf den Arm genommen und da haben wir uns ans Fenster gestellt, runtergeguckt. Manchmal hat sie, manchmal wollte sie dann weg, als quasi direkt vor dem Fenster irgendwie was in die Luft geflogen ist so. Aber ansonsten, da fand ich das übelst geil, die hat dann voll interessiert rausgeguckt, die hat so, was ist das hier oben, die Uhrzeit, boah, geil, was ist hier los. Auf jeden Fall müssen wir umloggen, 15, 15 müssen wir umlegen. Voller Stereotyp Gamer, ich hab kein Problem mit. Ohne aber, das ist ja auch immer eine Sache, wo ich denke, ich glaube es ist andersrum, ich glaube es ist andersrum. Generell glaube ich, ist es bei vielen Sachen, wo man so sagt, oh voll Stereotyp das oder voll der sowieso, ist es eigentlich andersrum. Leute sind halt so wie Leute sind und suchen sich deswegen Sachen raus, was am besten zu ihnen passt. Also ich glaube es ist nicht so, dass man sagen kann, oh scheiß Gamer, alle irgendwie sozial kriegen sie nichts auf die Reihe, sondern ich glaube Leute, die nicht sonderlich sozial sind, spielen gerne Games who never post. Aber den ganzen krassen Real Life Silvester Stelzer, den schnappen wir jetzt die Dande weg. Und dann kaufen wir uns Feuerwerk und schreiben Get Shrecked an den Himmel. Übrigens, laut YouTube Kommentaren bin ich mittlerweile voll der Nazi, muss ich mir heute sagen lassen. Vor allem ich, ja. Ich war ja schon alles ja. Ich hatte mal so paar rechte Spasten da, die mich übelst beleidigt haben, weil ich Jude bin oder so, haben sie erzählt. Also ich weiß nicht, wie sie auf die Idee gekommen sind, aber sie waren der Meinung, ich bin Jude und müssen mich jetzt übelst beleidigen. Erinnert sich vielleicht der Fabian noch dran? Fabian, erinnerst du dich da noch dran? An Max Flame Account, kennst du den Scheiß noch? Falls du da bist, kannst du dich da noch dran erinnern? Und das Schlimme war, da gab es erst einen und dann kam immer mehr. Die haben dann in die Kommentare geschrieben, ich habe gehört, Max ist Jude, deswegen habe ich mich jetzt hier angemeldet, um ihn irgendwie zu beleidigen. So richtig, richtig hängen geblieben. So und zumindest jetzt ist wieder was ganz besonderes, jetzt bin ich ganz schlimm, Nazi und rechts. Warum? Weil ich den Begriff Social Justice Warrior benutzt habe. Und dieser Begriff, der ist ja schon sowas von Nazi und instant rechts, instant rechtsextrem. Also manche Leute haben echt nichts besseres zu tun, als sich den ganzen Tag über irgendwas zu empören. Ich verstehe die Leute nicht, die haben alle kein Leben, die haben alle echt nichts besseres zu tun einfach irgendwie. Und das witzige ist, wenn man mal in die Wikipedia Seiten reinguckt zu eben diesem Begriff, sieht man, dass das in vielen Bereichen mittlerweile eigentlich ein recht gebräuchlicher Ausdruck ist, der quasi abwertend verwendet wird über Leute, die sich gerne über Themen empören in Richtung multikulturelle Geschichten und Feminismus und sowas in der Richtung. Und genau darum ging es ja in dem Video auch, nämlich um schwarze Frauen in der Wehrmacht in Call of Duty. Also, naja. Aber so schnell ist man laut YouTube Comments schon ein Nazi. Da kann man halt nichts machen. Aber was ich gut finde, dass die meisten Leute noch ein bisschen was im Kopf haben und gar nicht so eingehen auf so ein Scheiß. Die ganzen Koreaner kommen jetzt hier online, sehe ich gerade. Ich habe ja viele koreanische Overwatch-Pros und ein paar koreanische Streamer hier auf Benachrichtigung, auf Twitch. Irgendwie kommen die ganzen Koreaner jetzt an, weil die Koreaner ist doch schon neuer seit 8 Stunden oder so. 14 Stunden sind die doch, sind die glaube ich vorne dran. Ach ja, und der allergrößte Witz bei diesem Video war ja noch, dass ich diesen Begriff eigentlich gar nicht gebraucht habe. Ich habe das ja nur wiedergegeben, was jemand anderes in einem Interview gesagt hat. Das war ja noch der größte Witz da dran, das habe ich noch gar nicht erzählt, was die komplette Diskussion darüber schon wieder total überflüssig macht. Ne, ne, im Januar sind die Chinesen. Die Koreaner haben glaube ich, oder? Keine Chinesen. Ich muss umloggen, ich muss dann das Snipe machen. Mal vor nach Korea oder Japan zu reisen, ja würde ich gern. Aber allein habe ich da keinen Bock drauf. Sollte ich mal eine Freundin finden, in nächster Zeit wieder, mit der ich es länger aushalte und die mit mir, dann würde ich auch gerne mit ihr mal nach Island fahren bzw. nach Korea. Island und Korea sind beide so zwei Sachen, die ich gerne mal hin würde. Allerdings nicht allein, das wird zu doof. Ach ja, und bitte einen, die sich nicht aufregt, wenn ich Let's Player in auf Twitter folge. Oh man, es gibt Sachen, das, naja. Und was ist mit Japan? Also ehrlich gesagt, lieber Korea. Südkorea und Island. Max und Frisur in Korea, ja. Falsche Richtung. Hoffentlich bin ich nicht zu spät. Es wird geschneibt. 360 Marketplace Scope. Habt ihr gesehen, was das für eine Dande war? Das war eine ganz normale Un-Enchantete, oder? Also die hier war das. Keine Un-Enchantete, oder? Habt ihr das gesehen? Ich habe das vergessen oder nicht richtig realisiert. Welche Let's Playerin bist du da gefolgt? Ich weiß das. Keine Ahnung. Wer war das? Ich glaube Honeyball oder so. Total bescheuert, hat sich aufgeregt. Ich würde ja der Let's Playerin nur folgen, dass ich ihr heimlich Messages schreiben kann. Das ist so abgedreht. Das kann ich mir ohne so voll Cringe gar nicht aussprechen. So Fremdscheme ist das eigentlich. Bloß dass das nicht Fremdscheme war. Die Velia-Musik ist beste im Hintergrund. Epische Musik an. Ist ein Spedio so laut genug gewesen? Oder soll Spedio noch ein bisschen lauter machen? Hast du außer deiner Katze noch andere Haustiere bzw. möchtest du noch welche haben? Ja ich will mir wieder eine Katze holen. Aus dem Tierheim. Ich war schon im Tierheim vor einem Monat oder so ungefähr. Und da gibt es ja so viele. Am liebsten würde ich alle mitnehmen, aber ich muss mich ja zurückhalten. Außerdem muss ich noch warten bis das Hoftor oben zugemacht ist, dass die Katze nicht durch kann. Meine Letze war einfach zu alt, die konnte da nicht mehr durch und die hatte auch keinen Bock. Oder aber zwei Katzen, wenn sie sich halt schon kennen. Dann würde ich auch zwei nehmen, weil das einfach ein bisschen spannender für die Katze ist. Holst du zwei diesmal? Wenn es sich ergibt, also ich werde gucken, welche Katzen gerade im Tierheim sind. Genug Platz und für zwei ist überhaupt kein Problem. Also ich würde bevorzugt zwei nehmen, wenn es halt welche sind, die schon zusammen gehören und halt zusammen vermittelt werden. Dann würde ich gerne zwei nehmen, aber ich würde auch eine Einzel nehmen, wenn es halt eine ist, die alleine sein will. Und ich würde am liebsten wieder eine bisschen ältere Katze nehmen, einfach weil es ein bisschen getillter ist. Ich meine, ich muss jetzt nicht unbedingt wieder 14-15 sein, weil ich meine, ich habe es jetzt ja bei der letzten Katze gesehen. Das Problem ist einfach, wenn die Katzen schon so alt sind, das ist halt, man mag ja seine Katze auch, allerdings wenn Katzen schon 14-15 sind, dann ist halt die Chance, dass sie jetzt nicht mehr so viel älter werden, halt nicht so klein. Der Google-Rückblick ist besser als YouTube-Rewind. Was ist denn da so drinnen? Ist das irgendwas Google-bezogenes oder was so Weltgeschehen-bezogenes? Oh, dann das Snipe. Achtung Leute, alle sind zu Silvesterfeiern und jetzt lohnt es sich, dass ich da bin und snipen kann. Easy-Snipe. Easy-Easy-Snipe. Give energy, easy-Snipe. Obwohl, Energy ist zu spät, bis ihr das seht, ist es eh schon fertig. Achtung, Achtung. Der Result-Flick kommt jetzt hier. Fuck. Scheiße, das wäre jetzt auch zu geil gewesen, oder? Hätte ich die gesniped, hätte Fabian heute Abend auch entschaden müssen. Mein zweiter Rechner, wo ich den Chat anzeige, kackt gerade voll ab. Ähm, ich muss gerade mal an die andere Maus rüber. Was ist denn da los? Äh, Moment, geht doch. Funktioniert doch alles. Hä? Ist mein Maus-Sharing-Ding abgekackt. Moment. Mal neu starten. Ich mein, ich muss brauchen zwei Monitors, das ist ganz für den Arsch. Ah, geht wieder. Gut, alles klar. Ja, blim, blim. Okay. Ja, kriegt sich wieder ein Kack-Programm. Du, du, du, du, du, du. Du, du, du, du. Du, du, du, du, du, du, du. Ich glaub, Video kann ich noch einen Ticken lauter machen, ne? Zweiter Rechner von Chat, ne, der zweite Rechner ist, ähm, Stream-Vorschau und halt mit Chat, Discord, ähm, Donation-Ticker, Follow- und Hosting-Ticker und wenn ich irgendwas nachgucken will, wo ich halt nicht will, dass man es ums Stream sieht. Und das ist ja der zweite Rechner, den ich nicht dafür gekauft hab, das ist der Rechner, den ich hatte vor dem, jetzt. Du, du, du, du, du, du, du, du, du. So Leute, wir sind jetzt gerade so schön beim Cryanten dabei. Ich würd sagen, ich mach auch gerade noch mal die Basi-Quests, ist ja auch nicht so weit weg. Ähm, Eax, bist du schon da? Wegen, wegen Viewer-Games? Er ist grad afk. Ok, wenn der Eax wieder da ist, fangen wir mit Overwatch-Games ein, aber vorher machen wir noch die, den Daily-Cryant fertig. So wie ich die kenne, ist er gerade aufgestanden oder so. Ich muss mal kurz Discord schreiben. So, wir gehen jetzt mal hier zum, wo sind denn die Basis noch mal? Hier neben irgendwo. Ja, Zen Tower machen wir jetzt, auch gut. Hey Basi, wir machen Basi-Spot. Ähm, aber Leute, wenn wir, wenn wir Overwatch-Viewer-Games machen, spielen wir ordentlich, ne? Also wir können vielleicht am Anfang irgendwie so ein paar, paar witzige Fun-Game-Modes machen, so hier unendlich Ultimate-Charge oder irgendwie sowas, aber danach, ich mein, weil's halt eben im Rank so selten vorkommt, spielen wir ordentlich Overwatch, ok? Also ordentliche Team-Coms. Wir können uns höchstens darauf einigen, dass wir Junkrat und Mercy bannen. Da wäre ich sogar dafür. Wir können, wir können sagen, wir spielen ordentliches, äh, Competitive Overwatch jetzt zusammen. Allerdings, wir bannen Junkrat und Mercy. Was, Speicher-Lag, WTF? Was ist da los? Äh, eher, aber reicht's, wenn du das Game neu startest oder? Weil Speicher-Lag hat ich so extrem ist, dass es nach 10-15 Minuten abkackt, hatte ich in Overwatch eigentlich noch nie. Ja, Hanzo kannst du gerne picken, wenn's passt. Es, also, es ist es darf jeder mitspielen. Also, es ist mir egal, ob, äh, Porsche oder GM oder Top 500 oder Overwatch-League-Spieler. Ähm, ist mir wurscht. Allerdings ausgeglichen. Also, wir müssen gucken, dass wir ungefähr beide Teams immer, Moment, was ist hier los? Dass wir beide Teams ungefähr ähnlich äh, ausstatten mit Leuten, weil sonst wird das nix. Gehen wir mal zum Rahm, äh, zum Rahim. Gehen wir zum Rahim. Aber wir spielen gescheit, Leute. Leute, ich bin schon fertig. So, ich soll Basis bashen, ne? Basis soll ich bashen, mach ich. So, und jetzt laden wir erstmal den Krempel hier rein vom Country-Spot, wenn ich wieder in Space hab. Gibt es in BDO einen Server, auf dem sich viele Deutsche niedergelassen haben, quasi wie Shiva in Final Fantasy XIV? Ich dachte Odin war der deutsche Server in Final Fantasy. Ähm, es gibt in BDO zwar unterschiedliche Channels, aber es gibt einen großen Server. Also, das kann jeder mit jedem spielen. D.h., am besten ist, dementsprechend gibt es natürlich auch viele deutsche Gilden und ich vermute mal auch viele Gilden mit, also viele deutsche Gilden mit vielen Spielern. Aber hab ich keine Ahnung von. Du hast zwar hier Channels, es gab mal unterschiedliche Server, aber das ist mittlerweile alles ein großer Cluster. Ja, ja, das stimmt, aber seit wann ist das denn? Seit deinem neuen Monitor, oder wie? Also, wir spielen jetzt, aber bei Viewer Games machst du mit, oder? Max, programmierst du manchmal einfach irgendwas, einfach weil du Spaß machst, oder programmierst du sogar Dinge für den Haushalt? Ich mach, klar, weil es bald Spaß macht. Klar, viele Sachen machen Spaß, die braucht man nicht unbedingt. Klar, das ist auch das, was man am besten lernt. Also, wenn man sich irgendein Projekt ausdenkt, wo man sich denkt, ich würde es gerne machen, bzw. ist was, was ich vielleicht anders machen, das haben wir da jetzt gekriegt, anders machen würde als schon bestehende Software, dann hat man wenigstens ein Ziel vor Augen, das ist dann einfacher. Ach, du hast wieder Windows 7. Ich glaube, der ist ganz gut. Easy Basi Bash. Ich sehe immer, wie OP der Wizard ist. Ich kenne ja, ich gucke ja beim Friseur immer zu, wenn er Basis klein ist, ich habe das Gefühl, der braucht mit dem Ranger länger. Und das, obwohl er viel besser equipped ist, als Schwimmbiss hat. Das ist auch lustig. Sollte vielleicht jetzt nicht Chat gucken werden, wenn ich hier mobs rumspringen. Haben wir die Quest fertig? Wo müssen wir jetzt hin? Direkt hier oben, ok. Huge AoE spells, massive, massive res, massive. Oder wie immer gesagt, Big Slam. Wenn ergeblich sind hier Mobs, die ich killen muss. Aber irgendwie... Sind ja keine Mobs, die ich killen muss. Wo sind denn die Mobs, die ich killen muss? Vielleicht nicht hier unten, sondern irgendwo hier oben. Gucken wir mal. Wo sind die kleinen Mobs, die gebashed werden müssen? Hier oben nicht. Wo sind die Mobs? Muss ja hier irgendwo sein. Ist das richtig? Moment. Oh, ich bin noch hier richtig? Hä? Ich bläste jetzt einfach mal weiter, Mobs. Wo sind denn die Codraws? Wo sind die Codraws? Hier oben verstellst es irgendwo. Gucken wir mal hier oben. Sind hier oben welche? Nee. Hey, ich hab neu angefangen und finde, dass der Riese... Der Riese sieht ziemlich cool aus. Ja, das stimmt. Ich hab auch einen Riesen. Allerdings ist er nur 56. Und ist mein AFK-Angelheld. Der Berser, der Bersi, der ist im PvP, ist da ziemlich gut. Also ich bin, wie gesagt, übelster Noob in dem Game. Aber Bersi ist one on one, das weiß ich, eines der besten Klassen, die es gibt im BDO. Weil du halt saumäßig viel CC-Attacks hast. Okay, Ejax, sag einfach Bescheid, wenn du ready bist, dann fangen wir mit Overwatch an. Wo sind die kack Mobs? BDO, please. Also BDO müssen wir hier unten hin. Moment. Ach hier können wir auch hin? Okay, dann gehen wir hier hin. Wenn hier nix ist, bashen wir die Mobs da oben. Jetzt müssen wir da hin, da war aber doch eh auch eben nix. Alter, was ist denn hier los? Was sind denn die Mobs? Auf YouTube wären jetzt schon die ersten Leute, die sich wieder aufgeregt hätten, weil ich gesagt habe, Möpse anstatt Mobs. Das ist ja voll abwertend wieder. So, hier ist nix. Okay, dann gehen wir halt da hin. Manapods verkleiden, das braucht der Wizard halt glücklicherweise nicht. Bin ich auch froh, dass der Wizard so drankunabhängig ist. Ich glaube, ich habe vor drei Monaten nur das letzte Mal Tränken gekauft, die habe ich immer noch. Moin Schaskei. Also bei mir dauert es noch ungefähr eineinhalb Stunden. Moment. Hä? Das war doch gar nicht der Spot, den wir eben angeklickt haben. Ach nee, da hoch geht es auch noch. Cryton, jawoll. Das Beste. Alles bashen. Ist das was für Diablo-Spieler? Also wenn du auf das Mob-Killen von Diablo stehst, dann auf jeden Fall, das mit dem Loot funktioniert ein bisschen anders als im Diablo. Die Mobs geben hier zum größten Teil keinen Loot, den du direkt als Ausrüstung verwenden kannst, sondern Gegenstände, die Geld bringen. Und von den Gegenständen, die Geld bringen, kannst du dir dann wiederum deine Ausrüstung verbessern, indem du halt craftest oder hier halt gleich das bessere Zeug kaufst. Da ist sowas zum Bashen. Ähm, guck mal, hier sind so komische Kopras, die muss ich Bashen. Und wie kriege ich denn die Kopras von Steinen wieder? Wobei, nee. Das sind... Vielleicht, ich glaube, ich lese den Questtext gleich nochmal. Nö. Eigentlich soll ich nur hier irgendwas bashen, aber irgendwie ist hier nix. What the fuck, Alter, what the fuck. Basht mal die Basis da oben jetzt noch. Bam! Bei der Gelegenheit könnte man auch mal unseren Daily XP Buff ziehen. Daily Exp. Hab ich jedenfalls vorhin überlesen, wo es um YouTube und Amazon und sowas ging? Oh, Skill-Punkte. Nice, die muss man klar als Abholen. Weil nicht, dass ich nachher wieder jemand beschwere. Ich gucke nicht in den Chat. Aber ich gucke die ganze Zeit in den Chat. Aber manchmal kann es passieren, dass ich irgendwas übersehe. Ich finde schon, das ist was für Diablo-Spieler ist. Ähm. Würdest du sagen, dein YouTube-Channel war eine der besten Entscheidungen deines Lebens? Meinst du damit anzufangen? Ah, ja. Ja. Also muss ich gar nicht viel groß drum rumlabern. Kann man glaube ich ganz einfach verantworten. Auch wenn ich da am Anfang natürlich nicht dran gedacht habe. Das ist ja bei den meisten Sachen so. Bei den meisten Sachen, die sich im Nachhinein besonders geil rausstellen, hat man das nicht geplant oder so. Die wenigsten Sachen sind voll durchdacht und kalkuliert. Außer Hansos Scatter Arrow. Der ist natürlich immer kalkuliert. Okay, ich bin mal wieder zu dumm, Quest-Objective zu finden. Ah, so ist das halt bei mir, ne? Wir wechseln. Wir wechseln das einfach mal in den Channel. Wahrscheinlich sind hier alle Mops schon tot. Aber wenn du was suchst, wie Diablo-Spiel Pass of Exile. Also wenn es hier vor allem um diesen Nude-Aspekt dabei geht, dann Spiel Pass of Exile. Wenn es hier ums Mops-Passion geht und wenn es eher Richtung MMO gehen soll, dann ist BDO das beste, was du zurzeit machen kannst. Aber wenn es hier um Loot und Monster-Kloppen geht, also das Loot wie Diablo, dann eindeutig Pass of Exile. Das ist das beste, was es gibt in der Richtung. Seit Jahren schon. Du brauchst sinnlose, okay, die sind um den Tempel rum. Dann ist ja mal die Anzeige der Spots wieder richtig geil. BDO-Quests. Da, da ist eine. Bashen. Das kleine Kackzeug. Guck mal, hier sind alte BDO-A. Die Anzeige von den Quest-Objectives ist ja mal wieder sowas von fail. Ich meine, hier sind ganz viele, ja. Und an den Stellen. Guck mal, wo ich bin. Hier bin ich. Und angeblich da, da, da und da ist die Quest. Well played BDO. Beziehungsweise Pearl Abyss Kakao. Dann da. So, Quest fertig. Easy. Oh Mann, ist das bescheuert gewesen. Ich bin genau da gewesen, wo das Licht hingeautorunnt ist. Sogar drei verschiedenen Spots. Ups. Oh, da gibt es Combat Points. Okay, ich muss Basis bashen. Easy. Dafür bin ich eigentlich gekommen zum Basis-Baschen. Moment, das sind auch Basis, die sehen gar nicht so aus. Na, wenn BDO das meint, dass das Basis sind. Du spielst jetzt einfach mal alles an, was dir über den Weg läuft. Das kann nicht schaden. Also, sich ein bisschen umzugucken, weil man gerade so kein Main-Game hat, ist immer gut. Ich mache es anders. Ich gucke mir die Games an und habe dann immer das Gefühl, ich finde 90 Prozent scheiße und fange dann erst gar nicht mit an zu spielen. Das ist auch nicht der beste Ansatz. Musik intensifies. So Leute, sobald ich die Basis kaputt habe, loggen wir auf Overwatch um. Dann sind wir nämlich auch gut eingespielt, wenn die neue Season losgeht. Der Eaxe ist noch off. Eaxe, bist du off? XQC online spielt gerade Minecraft. Weißt du, so schlimm ist es schon um die Overwatch Pros, wenn Overwatch nicht on ist, also beziehungsweise die Season-Pause ist. Man merkt auch, dass es auf 24 Uhr zugeht. Leute werden weniger. Bashing. Habt ihr eigentlich was im Steam Winter Sale gekauft? Also, was ich gekauft habe, habt ihr ja gesehen. Hab ich ja im Stream, haben uns ja angeguckt, was es so gibt. Habt ihr euch irgendwas gekauft? Und wenn ja, was? Das ist voll uneffektiv, ich brauche mehr Basis. Bayonetta, okay. Stimmt, das gibt es jetzt auch auf dem PC, ne? Spell Force 3, okay. Kann man das jetzt spielen mittlerweile? Bei Release war das ja in fragwürdigem Zustand. BR4 Premium, okay. BR4 ist zu einem richtig guten Game geworden jetzt. Nach der ganzen Zeit. Da sieht man mal, dass man eben auch aus, sagen wir mal, Fails am Anfang, wenn man sich darum kümmert und dann noch ein bisschen Zeit rein steckt und Leute dran setzt, denen das nicht komplett egal ist, immer noch ein gutes Game draus machen kann. Hat man ja auch an Rainbow Six gesehen. Rainbow Six am Anfang, richtiger Fail vor allem, überhaupt nicht gut angekommen. Und jetzt, verkauft, millionenfach verkauft und die Leute finden es auch geil. Also, wenn man nicht einfach durch was raushaut und danach den Support einstellt und sich nicht mehr darum kümmert, kann man auch, wenn es am Anfang nicht so geil ist, noch was Geiles draus machen. Prey und Alex. Das neue Prey wollte ich auch noch spielen. Es gibt viele Sachen dieses Jahr, die ich noch spielen wollte. Auch mal zur Abwechslung wieder das neue Assassin's Creed, was ja wirklich gut sein soll. Ich hätte im Leben nicht dran gedacht, dass ich noch mal, quasi, mich drauf freue, einen Assassin's Creed zu spielen. Für mich ist der Ezio ja immer noch der eins schwere Assassin's Creed Held. Ezio ist der. Ezio Auditore. Da, da Firenze oder so. Da Firenze. Wieso ist deine Waffe nicht ultimate? Ist sie. Guck, da. Endlich ordentlich viele Basis hier. Der Eaxe ist wieder da. Okay. Jetzt muss er bloß noch wieder ins Stream kommen, dann können wir zur Overwatch wechseln. Das ist aber gut, dann habe ich auch die Quest fertig. Top. Perfekt. Habe ich meinen schönen Daily-Cryant-Exp-Contribution-Points gemacht. Also, nur mal um sicher zu gehen, dass wir jetzt auch gleich, wenn wir Viewer-Games machen, Overwatch genug Leute haben. Wer würde mitmachen? Oder wer will mitmachen? Weil wenn wir kein Game voll kriegen, dann werde ich bis die Season anfängt noch weitercryingen. Werden wir mit Overwatch spielen. Aber wohlgemerkt ordentlich Overwatch. Also mit ordentlicher Comp. Das Einzige, was wir machen können, ist, wir können Junkrat und Mercy rausbauen. Was mich auch interessieren wird, schreibt nochmal bitte euren Rang dabei, weil ich so ungefähr sehe, wie die Verteilung ist. So, jetzt abgeben. Fertig. Auf kleiner Vizarte. Vizarde. Wegfindung. Beste. Mick ist erforderlich, es wäre ganz gut. Muss aber nicht die beste Quali sein. Aber Mick wäre schon nicht schlecht. Wir wollen das hier ordentlich spielen. Overwatch ist einfach Teamwork-Game. Es ist so ein riesen Unterschied. Das werdet ihr jetzt auch hier gleich sehen. Es ist ein riesen Unterschied, ob man Overwatch im Rank spielt oder jetzt sogar hier, wo wir noch nie zusammen gespielt haben, wenn alle Leute wenigstens an einem Schrank ziehen wollen. Eax, bist du wieder da? Es fehlen immer noch Skillpoints. Okay, Eax, probieren wir es mal aus jetzt. Probieren wir es mal aus. Okay, ich ändere das Gamer auf Overwatch. Das Mob-Pack mache ich noch kaputt. Dann locken wir um. Also Leute, kriegen wir insgesamt, wie viel brauchen wir? 12, 10. Kriegen wir 10 Leute zusammen, die mit spielen wollen, ja? Und so wie ich das sehe, so in dem Dreh Gold bis Diamond wahrscheinlich die meisten. Weil wir auch ein paar Master-Spieler haben. Okay, machen wir. Dann locken wir um. Das Game ändern. Overwatch. So hat sich das Game geändert. Immer noch nicht. Ich glaube, Twitch braucht einfach eine Weile, bis sich das Game ändert. Es ist einfach nicht so schnell. So, hat es jetzt geswitcht auf Overwatch? Oder bugged es wieder? Äh. Capture es mal wieder auf Overwatch, richtig? Hammer gleich. Okay, Game Capture. Overwatch. Jawoll, da ist es. Gut, machen wir Custom Game auf. In der Hoffnung, dass es jetzt umgestellt hat auf Overwatch. Ja, hat umgestellt auf Overwatch. Perfekt. Bei meinem Handy steht immer noch IRL. IRL sollte es schon längst nach BDO gewechselt haben und jetzt nach, jetzt denke ich es hier nach Overwatch. Aber man weiß ja nicht so genau, was da. Gut, wie geht denn das? Mir fällt auf, ich hab jetzt seit Monaten kein Custom Game aufgemacht. Play. Game Browser. Create. Oder geht das noch irgendwie anders? Müssen wir mal schauen, nicht? Ja, zwei Stunden bis zur nächsten Season. Nee, kann er nur da drüber gehen. So, Settings lassen wir Standard. Heroes. Das Einzige, was wir, was wir mal verbieten, ist Mercy. Da hab ich echt keinen Bock drauf. Obbei eigentlich müssen wir das nicht verbieten. Ich sag das einfach. Keine Mercy. Easy. Test, Test. In-Game Sound geht auch. So Leute, ich stell das jetzt hier auf. Ach, man kann das über den Nightbot ändern. Das ist gut, das ist sehr nice. Also, wir machen jetzt hier Max Führer Games. Ach, Moment. Settings. Das kann man bestimmt noch in Competitive umstellen. Hab das noch nie gemacht mit dem neuen Menü. Standard 6x6. Competitive. Ja. So, also das Game, das heißt jetzt Max Führer Games. Und ich stell das jetzt ein auf, dass jeder joinen kann. Geht das so? Mach ich das richtig? Ja. Bäm. Erster schon am Start. Moment. Anubis? Nein, nein, nein. Wir fangen nicht mit ner Kackmap an. Geh weg. Wir fangen an mit, mit welcher Map wollen wir anfangen Leute? Komm, King's Roar Winter. King's Roar ist gute Map. Eaxe hier. Options, Sound, Voice. Hallo? Hallo, hallo? Keine Ahnung, ob das jetzt funktioniert. Leute, sollte ich euch, sagt ihr irgendwas? Sollte ich euch jetzt hören? Okay, ich versuch mal mein Voice Chat irgendwie zum Laufen zu kriegen, das spackt. Hallo, hallo? Ah, funktioniert. Sehr gut. Hallo? Thomas? Thomas? Also eh, ich höre nicht, das ist schon mal gut, das weiß ich, prinzipiell funktioniert es. Alles klar. Ja, das ist, das ist schlecht. Ich mein, es war Weihnachten, hätte es ja mal langsam, aber sicher mal eins besorgen können. Leute, ich würde sagen, bei irgendeinem Musikshop für Schlagzeug oder so. Nee, es gibt für Schlagzeug so Switches zum irgendwelche Teile an und ausschalten, die kann man dann, kann man stimmend an den PC anschließen. So Leute, also wir brauchen noch ein paar, die mitspielen, sonst müssen wir wieder Mobcrime machen. Also wer noch will, auf gehts. Ich muss jetzt mal gucken, was wir hier für Ränge haben, so ungefähr. Gold? Diamond? Okay. Smurf? Gut, ich war. Platin? Na, gucken wir mal nicht, dass es zu unverwehrt. Diamond? Plat, okay. Und? Auch wahrscheinlich Smurf oder so, nee. Kein mit dem Level eher nicht. Oder eher mit dem Level eigentlich auch nicht. Also ich werde es jetzt erstmal so lassen, einfach so wie die Leute reingekommen sind. Wenn es jetzt total unbalanced ist, dann fliegt es wieder raus. Und wir machen jetzt mal die epische Musik aus. Und ich glaube, ich mach meine Push-to-Talk-Activation ein bisschen niedriger. Geht das überhaupt? Ja, glaube ich gar nicht. War gut. Da nicht. So, einen brauchen wir noch. Mach ich die Musik wieder an, bis einer drin ist. Gibt es eigentlich einen Community-Discord oder TS? Nee, gibt es noch nicht. Das will ich seit Monaten schon machen. Seit Monaten. Aber irgendwie, kriege ich das nicht gebacken. Ich habe zwar schon einen Discord erstellt, schon ewig her. Aber noch nichts großartig eingerichtet. Außer halt einen Channel, wo man Videos aufnehmen kann. Also die letzten paar Videos, die ich mit anderen Leuten aufgenommen habe, haben wir alle über Discord aufgenommen. Also Leute, wie gesagt, einer fehlt noch. Dann können wir anfangen. Also wer noch mitspielen will? Ich meine, es haben immerhin vorhin irgendwie 20 Leute oder so. Nee, 12. 17 Leute Custom-Games gewonnen. Also, muss weiter. 6 vs. 5. Das könnte man theoretisch machen, wenn wir die besseren Leute haben. Dann spielen wir 5 gegen... Wenn wir die besseren Leute haben, spielen wir 5 gegen 6. Ich glaube, wir haben die besseren Leute. Wollen wir 6 gegen 5 spielen? Wir haben die besseren Leute laut Stats. Sagt keiner was. Also wir müssen uns natürlich umdrehen. Max, kann man gleich noch rein? Du kannst jetzt rein. Ein Platz ist noch frei. Es ist voll. Okay, easy. Auf geht's. So, Musik ausmachen. Ich glaube, die Lautstärke ist gut. Ich glaube, ich kann sogar Overwatch Tickenleiser machen. So, du bist Mercy, man. Na ja. Da haben wir jetzt echt Zeit. Max, ach, check, check, check, check. Max, ach, Chat-Overlay ist ja noch an. Ja, ja, ja. Moment, mach ich weg. Jetzt ist es weg. So, äh, jetzt. Erste Runde. Auf dem Platt haben wir die deutlich besseren Leute. Ein bisschen Warmspiel für neue Season. Auf geht's. Ich hoffe, die geht auch direkt 24 Uhr los. Du besitzt nicht mehr das Game. Also Overwatch ist ein richtig, richtig geiles Game. Das einzige Problem ist, dass der Rank Mode einfach so komplett verschissen ist. Hanzo am Start. Moment, hört mich überhaupt jemand? Hallo? Hallo, hallo? Ach, nice. Aber keiner was sagt. Ich glaube, die kommen links rum. Die haben eine Widow unten, Hanzo. Oh, nice, Schild. Ey, komm, geht doch eigentlich. Jetzt müssen wir mal ein bisschen draufdrücken hier. Der Hanzo springt sich da ein ab. Welche Grafikanstelle verwendest du? Low, Low. Achtung, Achtung jetzt. Der wird jetzt, der wird geregt. Ich brauche Heal. Oh, nice, Schild. Ich spiele auf Low-Grafics. Okay, ich glaube, die Teams sind nicht ganz fair. Da müssen wir nach der Runde was machen. Aber die Zarya ist auf Deck, das muss man sagen. Hinter uns. Oh, Shrecked. Max schon mal Overwatch an der Konsole gespielt? Ja, beim Kaboom habe ich schon mal Overwatch an der Konsole gespielt. Und ich habe festgestellt, dass Torb das OPste aller Zeiten ist auf der Konsole. Back. Just come back. Komm, komm zurück. Jetzt müssen wir auf unseren Reinhardt warten. Wir müssen auf den Reinhardt warten. Oh, die Zarya ist übelst overextendert. Meine Hooks sind ja die besten. Ich meine, wie oft hat der Hanzo eigentlich alt hier? Okay, back. Ich glaube, der Reaper ist oben. Lass weiter, zurück, zurück. Wir müssen auf unseren Tank warten. Nicht sterben, nicht sterben. Okay, Reinhardt vor und Ruff. Huge. Merci. Ja. Zurück. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Zurück. Der Reaper, der sieht so aus, als geht er rechts rum und flankt. Könnt ich mir gut vorstellen. Müssen wir gleich aufpassen. Ihr seid übelst leise. Ich muss mal gucken, wie ich euch lauter kriege. Oh, oh. Danke für die Waffe. Perfekt. Ah. Zurück. Super grob. Ja, das ist, auf der Waffe ist relativ schwierig zu spectaten, wenn man das nicht spielt. Ja, regroupen. Regroupen und dann direkt drauf. Haben wir eine Mei ult? Ja, wir können direkt mit der Mei ult, können wir die schön nochmal vor dem Spot. Rauf, rauf, rauf, rauf, rauf, rauf, rauf, rauf. Na ja, ausprobiert. Die Spieler zwar was anderes, was haben die hier? Einen. Nein, nein, nein, nein, nein. Null. Fail. Fail! Hahaha! Wo ist denn der Soldier? Oder der Hanzo? Oh Gott! Hab ich die gefressen? Hab ich sie gefressen? Jawoll! Jawoll! Zarya gefressen, so muss das sein. 420 pro gameplay, naja, naja. So, volle Pole drauf, in your face. Ähm, hast du eventuell Tipps für Junkrat? Nein. Außer, dass Junkrat zur Zeit eines der nervigsten europäischen Helden ist im ganzen Game. Also Junkrat spielen aktuell ist keine schlechte Idee. Aber ich finde den Held, also mir macht der Held keinen Spaß zu spielen, muss ich ehrlich sagen. Es macht auch keinen Spaß gegen ihn zu spielen. Und ich finde Junkrats einfach nur dumm, wie er zur Zeit ist. Aber halt, übelst, übelst gut, ja. Eigentlich spiele ich am liebsten Support und wenn es danach geht, Lucian und Ana. Leider ist Ana gerade nicht so wirklich gut dabei. Jetzt spielen die Junkrat, kann gut sein. Also es wäre sinnvoll für die Junkrat zu spielen, auf jeden Fall. Wobei wir ganz gut direkt auf den Spot können. Ich meine, wir haben hier zwei Dive-Tanks plus ein Genji, also das geht schon. Übrigens Leute, wir können Deutsch reden, weil es sind alle Deutsch. Ich hoffe, dass da einer mitkommt. Nein, fuck! Fuck, ich hätte beinahe eine Bombe gehabt. Ah, wo sind denn alle? Fuck, ich hätte beinahe eine Bombe gehabt. Ah, wo sind denn alle? Alle daunen. Ich spiele ja keinen Junkrat. Ich hätte es auch gewundert, dass sie keinen Junkrat spielen hätte, hätte ich gedacht. Haha! Leute, Leute! Wo sind denn alle hin, auf einmal? Ich glaube, die Junkraten sind hier. Ich glaube, die Junkraten sind hier. Ich glaube, die Junkraten sind hier. Ich glaube, die Junkraten sind hier. Ich glaube, die Junkraten sind hier. Ich glaube, die Junkraten sind hier. Ich glaube, die Junkraten sind hier. Ich glaube, die Junkraten sind hier. Wo sind denn alle hin, auf einmal? III Rotock, links. Left, sein. Ich dachte, du hast das Gamely installiert. Done, hatte ich, hatte ich. cal Do yesterday Das letzte Mal wird er gespielt Above Woah Hanzo Das Game sieht unbalanced aus Ich fand im Attack ging es eigentlich jetzt schon Danach mussten wir ein bisschen durchswitchen Bam Jetzt wird schon mal ein bisschen durch Nein nein das ist noch nicht Season 8 Season 8 geht erst in einer Stunde los Da hat er gelasert Egal Kann ich jetzt? Weiß jemand, wenn ich jetzt Leafgame mache, kommen wir dann wieder in die Lobby? Achso, kommen wir in die Lobby So, wen haben wir denn hier am Start? Den ersten Mal, move, zack Kann er mitmachen So, ähm, wie movet man denn jetzt Leute? Wen moveen wir jetzt mal hier? Divine war ganz gut Wir müssen das mal ein bisschen ausbalancen Ähm, ich glaube Wir switchen mal So, was für eine Map wollen wir jetzt spielen? Wir spielen jetzt Maps Wir spielen jetzt Attacke und Intuzipi, Hanamura, wirklich, wollen wir wirklich Hanamura spielen, ja? Okay, spielen wir Hanamura 2Cp in 2k 17, 2k 17, 2k 18, lol So, wen haben wir denn hier sonst noch? Diamond Ja, dann switchen wir mal, wir switchen einen von uns Switchen wir mal Divine, switchen wir mal mit ihm Und Ansonsten war der Rest eigentlich Diamond, das müsste eigentlich Probieren wir es auch so Also direkt passend zum neuen Jahr, der neue Season, also wenn das, wenn das sich deckt mit der Zeit, wo wir eben nachgeguckt haben Ich würde schon sagen, da stand doch vorhin 2 Stunden, da war es 22 Uhr, wo wir geguckt haben 21, das müsste eigentlich genau, genau losgehen um 24 Uhr Wicked scheint echt auf Mei zu stehen in Defense, haben wir irgendwas, was ordentlich bisschen bisschen Damage macht? So richtig, wir haben Genji, der gerne abgehen, na klar wir haben Xen, der macht auch Damage, aber die Mei muss halt rechte Klicks treffen, gucken wir mal Schauen wir mal, wie das läuft Crouch spam, wie die Pros Klicks alle weg genau Wir sind gut, oder? Aizuu Gucken wir mal, wo die Fahrer lang kommt Ding Ding Ding Ding Ding Ding Ding, wo sind die Fahrer? Jetzt ist keiner mit gepusht, lol Und ich konnte kein Schild mehr setzen, fuck Wir haben ne Mercy, egal, egal, die kriegen wir so auf den Sack gerade Nice, nice Ich bin gleich wieder da Alle, immer mein Bongos am Start So, komm mit rein So, komm mit rein Ok, das Twitchen hat alleine nicht allzu viel gebracht, jetzt müssen wir glaube ich noch ein bisschen anders durchwechseln Wie spricht man einen Twitch-Namen aus, kannst du Wupplos sagen Einmal Lucio, immer Lucio Im Herz zumindest, Herz93 Ich mag eigentlich alle Supports, bis auf Mercy, den musst du halt spielen Ich mag auch alle Tanks, bloß mit DPS bin ich jetzt erst nicht so gut, außerdem gefallen mir Genji und Tracer vom Playstyle her gar nicht Ist einfach nicht meins Dummfist auch nicht Ich bin eigentlich eher Off-Tank-Support-Main Aber Lucio bester Ich hoffe es kommt ein Patch, der Mercy mal wieder auf den Boden der Tatsachen zurückholt Und das wieder Lucio, Ana, Lucio, Ana bester Support Vor allem Ana, Ana ist wenigstens eine der Helden in dem Spiel, wo es noch einen Unterschied macht, ob du es gut spielst oder nicht Nicht so wie bei Mercy, wo das, naja, ich will nicht sagen, dass es keinen Unterschied macht Aber es ist halt, naja, Mercy halt Ist immer nur Schützenpacken Jo, jo E-Junkrat Zu spät We wait for Genji, then go Das war so nicht geplant glaube ich Eine gute Attacke, rekt Das war gut, jetzt haben sie sich auf mich konzentriert, es war zwar nicht so geplant, aber rekt Schreckt Ana Damage Buff war unnötig, ja finde ich auch Das Problem ist ja einfach, dass Mercy so OP ist Wir sind schneller wieder da Volle Pulle Was geht mit der Widow ab ey, die will es aber wissen Die Widow will es echt wissen Das, was wir uns jetzt angucken Ein wenig einseitig Ich glaube wir müssen noch mal ein bisschen Spieler switchen Das war jetzt auch nicht so balanced Das ist schwierig, das ist schwierig, wenn man Leute quasi aus allen Aus allen Ratings dabei hat Das ist schwierig, echt schwierig Also wenn noch jemand mitspielen will Dann gucken wir, dass wir das jetzt mal ordentlich verteilen Ana rage quitten, ja würde ich ja auch Aber es ist verdammt schwierig das fair hinzukriegen Ich habe jetzt extra schon geguckt, dass wir noch einen Master rüber switchen Und wir quasi einen Gold zu uns nehmen Was es dann vom Rang her ungefähr gleich macht Aber es hat nicht gereicht So Balanced Blizzard bestimmt noch seine competitive Games Das Gefühl habe ich auch Wir haben Gold Gold Plat Diamond glaube ich Was für eine Map wollen wir Was war Xilent nochmal Ja gut, der war Season 3 auch Highmaster Ich schätze eine Map aus Eichenwalde Moment Ich muss mal wieder auswählen Eichenwald So Es ist wirklich saumäßig schwierig das zu balancen Wir haben halt alles dabei Es ist halt im Prinzip von Gold bis Top 500 Dachte du hast Overwatch deinstalliert Hatte ich auch ja Hi Kios Sprechen wir das überhaupt so aus Kios? So wie der Laden der Zeugs verkauft Wie geht es Kats FPS ist nicht mehr unter uns Wenn du genau was wissen willst kannst du bei mir auf YouTube das letzte Video angucken aus dem Garten Easy Clap Ich habe das Gefühl meine Voice Activation funktioniert überhaupt nicht richtig Was Kios Kios Verstehe Versteht ihr den Voice Chat Ingame? Für mich ist der übelst leise Und ich weiß nicht so genau warum Hallo, heal please Nope Fuck Du bist all ich bin leise Also von meinem Voice ist top Es leuchtet blau Also Ingame Sound müsste eigentlich okay sein und ich müsste okay sein oder? Das einzige was ein bisschen leise ist bei mir ist der Voice von den Leuten Kann mich nicht umdrehen Vielleicht wenn ich mich umdrehe Vielleicht gleich Ingame ist zu leise okay Ingame kann ich gleich lauter machen Okay Achtung Leute Ich gucke mal ob ich etwas lauter machen kann Okay Game müsste jetzt lauter sein Besser Moment Der hat Earth Shatter, der hat garantiert Earth Shatter Das war ein nicer Charge Ist der Soldier tot? Fuck Übelst überforderung pur gerade alles Reinhard Ja Reinhard ist halt nicht so unbedingt jetzt beim Aussehen gestellt Fuck Krasser Shatter Ist jetzt Ingame ordentlich von der Lautstärke her Ist Ingame Sound okay Ja ist okay Fuh Weil das ziemlich gut ist da kann der Soldier immer so viel reißen Fuck Alter recken sie uns aber 10% mehr ich weiß nicht was mit meiner Soundcloud Stärke heute los ist Okay Watt Soll ich mich verarschen Kill mich please One fight Don't die just fight nochmal Achtung Hilfe Also mehr ging gerade echt nicht Nice 23 51 Overwatch ja ja so muss das sein Fuck dich Reinhard C9 Hab ich irgendwie gerade meine Das ist aber übelst kaputt bei dir das ist ganz merkwürdig Grip Vor allem in defense jetzt No hab ich öberst Es oder da ist er wieder klar kommt der Hanzo Skatter wieso machst du deine Boxen nicht auf? ich weiß nicht, ich mach die Winterboxen immer auf Hanzo Skatter Hanzo das wirst du ja überrannt ich kann aber meine Boxen gleich aufmachen ich muss kurz nach der Runde dann mal 5 Minuten AFK und dann so weit 24 Uhr und so Nope Regroup ich versteck mich bei Jon mein Gott, Volker-Mord schreckt der Hanzo Skatter Nope ich kann ja nicht alleine vor Alter, mach doch mal ein bisschen Damage auf den McCree der McCree muss sterben ausgekaubeut das war Pre-Ulted die Kravathans schon fast nein, da kann man sie nicht dahinter verstecken uns fehlt das Schild habe ich das Gefühl, es fehlt so ein bisschen die Stabilität Alter die Vols aber, wie sie jetzt Fuck, ich kann jetzt nicht switchen, das ist gacke Simple Geometry Sieh nahe So, das ist noch nicht neue Season, nein, nein, das ist Führer Games, hier neue Season ist jetzt gleich so ok, nice, da haben wir jetzt Schluss mit Führer Games und dann machen wir Moment, Minuten, seh ich das richtig oder Sekunden oder dauert die neue Season noch die neue Season dauert noch da fuck, ich bleib mal kurz afk, gleich Führer so Leute, ich wünsche euch alles Gute für 2018 übertreibt sie mit irgendwelchen Vorsätzen nicht weil die halten ihr wahrscheinlich eh nicht ein mein Mikro, mein, mein, RZ Spack, Moment so, jetzt ist besser ja, übertreibt sie mit den Vorsätzen nicht und werde Top 500, easy alles Gute Leute so, mein Problem ist jetzt, ich dachte es geht jetzt die neue Season los, aber sie geht gar nicht los, perfekt das heißt, wir können es ja noch mal probieren wollen wir noch ein paar Games machen zusammen, also ich mein wir haben noch eine Stunde Zeit, ne aber Placements mach ich erst morgen also wenn das erst um 1 Uhr nachts los geht, ist mir das zu spät heute da spielen wir ja bis 4 Uhr nachts oder 5 Uhr ist es vielleicht noch offen ist es ein Fake Max Viewer Game ich glaub das ist ein Fake Max Viewer Game gewesen ok, dann machen wir jetzt ein LUL in 2k18 also, verscheiden wir Leute LUL in 2k18 auf gehts kommen wir einfach noch ein paar Matches zusammen kriegen wenn wir noch ein paar Matches zusammen kriegen dann spielen wir noch ne Runde Rx anschreiben, äh Rx bist du noch im Stream? leider hat mich die neue Season gebaitet ich dachte die geht jetzt los der Valverde ist auch am Start, nice hört ihrs im Hintergrund übrigens? ich mach mal kurz Leute, ich mach mal Fenster auf ziehen wir uns mal die volle Silvester Experience 2k18 rein da gehts ab so, genug Real Life, fertig hat sich ausgerelifed das reicht jetzt auch für Real Life heute ja, ich find auch genug real Feuerwerk in 2k18 jetzt drehen sie aber richtig auf da draußen das geht nicht Leute, das ist nicht möglich ich mach jetzt Rollarten runter so viel Real Life, Feuerwerk und ne, das geht nicht wir brauchen jetzt irgendwie passende Musik was macht man da? was 99 Übels angesagt hat, war natürlich Final Countdown das war 99 der Shit, also es ist zwar schon viel älter aber 99 zu 2000, ey, rauf und runter gelaufen das muss sein das muss echt sein 50 Milliarden so, einer fehlt noch jetzt fang ich auch schon mit XD an also, Übels ausrasten wir dabei was bei dir zündet eine Autos an? wenn man wirklich eine Autos anzündet, würde ich jetzt mal schon die Polizei rufen ehrlich gesagt oh, jetzt haben wir den ultra krassen GM Genji Main als Gegner ok, auf gehts, go go ahja Leute, immer noch keine Mercy, ne? egal, egal, Posse, wurscht äh, Defend ja, ja, ja, das mach ich, mach ich auch geil, ne? das ist Blizzard Logik ein Stream von Max und eben bei Football, besten Silvester Football, ok das muss ja zur Musik passen was ist das denn? BTF, ey die haben uns zerrissen, schreckt kommen wir nochmal drauf? der Winston, Winston Main kommt jetzt äh, suche Gegner die kann sich ja komplett voll leechen das war so nicht geplant jetzt haben wir kein Schild, fuhu, kein richtiges Schild hat er Gears, Shattered? nice gucken, wo die lang kommen perfekt wo ist denn der Reaper? das war auch hier ein bisschen wasted und gerade bin ich froh, dass wir ohne Mercy spielen das ist einfach der Shit können wir gleich gehen? oh, es lieb Retrub Tracer ist direkt auf Main nein, nein, nein, nein Reinhard was in beiden Teams? ich hab gleich Ulti, ich kann aber noch nicht rein dafuck E-Ax, E-Ax, mach so platt das Schlimme ist noch zuzuschauen, ja das stimmt ne, nix mehr die sind aber echt tough, die sind aber echt geil auf mich die sind echt mega geil auf mich was haben wir denn, wir haben eine D.Va, wir haben eine Ana das kann ganz gut klappen jetzt das Problem, dass ich Zarya schon wieder einmal ewig nicht gespielt habe ein bisschen style oh, oh, oh das hat uns jetzt zerrissen aber es ist relativ balanced, 29 Sekunden ist okay was haben wir denn jetzt gescheit, ich würde ja normalerweise sagen Winston das ist ganz okay, total gemischt von den Ranks diesmal ist wirklich, das hast du ja selten, von Bronze bis Top 500, alles dabei E-Ax ist Top 500 also unsere Ana achja Meurer Orbs geben ja keinen Charge habe ich ja vergessen auf Jump wo ist die fucking Widow da oben da darfst du nicht zu lange rumfackeln ich kann da nicht als einziger rein, das geht noch nicht jetzt werden sie geschreckt so muss das sein weggeboxt von Zarya in 2k18 die Leute in Gameboy Chat ist so leise braune Schild ich muss zu unserem Winston Winston Winston ja auf rein rein rein rein ich kann halt alleine rein wo ist denn der Winston jetzt, weg fuck die Schild ist gleichzeitig gedrückt, Loops Zarya man muss direkt, muss sich direkt rumtrennen was machen vor allem wenn vorne nichts ist oh die Balls geben jetzt was komm ich muss dir Schild geben alter card wat ok das war jetzt vielleicht ein bisschen übertrieben die Craft fu was haben wir da Prost Neues, ja wünsche ich euch auch ein Prost Neues ich muss das wieder um Spies Kill, jawoll der Batman ist raus was ist der da gestorben back back back muss ich die wieder auf schieb weiter weg weg weg weg was haben wir wo ist, Braune Schild Schild Schild nein nein nein nein nein so nicht so nicht Meuer ist so cancer zu hitten ey jawoll ein Scherz Zarya ganz gut funktioniert ich bin gerade dabei mich ein bisschen auf das Game zu konzentrieren aber wisst ihr was man hier an schön sieht dass es egal ist erstmal was du für einen Rank hast du musst im Team spielen wollen das war jetzt mit Sicherheit nicht die Vollendung des Teamplays gucken dass ich mal unseren Chat lauter kriegt das ist doch der Witz der First Agonix ich weiß nicht wie das geht ich weiß nicht wie das geht Alter müsste ein Fight halten oder zwei ja Torb ist als der mage mal gucken geht ja erst in halb stunde los mal so wenig spielen ich fühle mich mit den meisten hellen übelst unsicher gerade das ist der wahnsinn deswegen ist gut dass wir hier so ein bisschen matches spielen wo es im Endeffekt Komplex geht ein Stückchen zurück klar wenn die kommen zurück ein bisschen rein zurück immer noch halb da müssen wir mit mehreren leuten da hin du kommst nicht weg scheiße es war überhaupt es war überhaupt nicht notwendig dahinter zu gehen 0 3D was RIP Ears warum so ich muss mal gucken wie ich den Voice Chat lauter krieg alles laut Fuck geschrien hast du okay es geht mit der Musik jetzt ab spielt mal king of the hill ja das können wir machen es geht mit der ersten es geht mit der ersten es geht mit der ersten Okay, jetzt habt ihr wenigstens auch ein Bronze-Silber-Spieler, da ist das wieder ein bisschen fairer. Wieso? Wir haben auch ein Bronze-Spieler, das ist überhaupt kein Ding. Ja, jetzt bist du wieder da. Ja, wünsche ich dir auch, Yoni-Backslash. Das ist super, was geheim zu halten, wenn man in den Chat schreibt und ich streame. Was hört sich besser an? 2K 16 oder 2K 18? 2K 17. Eigentlich hört sich dieses ganze 2K irgendwie fast richtig hängen geblieben an. Aber ich hab mich da mittlerweile so dran gewöhnt. Na dann, rufen wir ihn mal. Easy, kannste mitspielen. Kein Bock oder was? Null. Was war denn das? So, auf geht's. Ja, du bist wieder da, oder? Ich vermute mal. Ich geh mal davon aus, dass du wieder da bist. Hoffentlich mal zumindest. Da ist er doch, easy. Jetzt kannst du mal wieder meine Lucio-Skills hier rausholen. Mega, kein Mei, bitte. Das ist voll 2016. Das ist Beta. Ja, ja, die Wand ist voll Evolution-mäßig. EA-like. Es ist jetzt übrigens, ist der Chat lauter? Das ist der äußerst gewöhnungsbedürftige Teamkomp, die wir hier haben. Man versteht die Leute jetzt, oh, immerhin. Ja, ich hab das gefunden. Irgendwie stand das auf 3%. Hinter dir, Anna, hinter dir. Ich hab Schiss. Ich kann wenig dagegen machen gerade, wir müssen drauf. Der steht da noch drin. Ich brauch Heal, Max. Ja, ich komm hinter. Die sind viel zu gesplattet. Die sind mega gesplattet. Wir sind auf dem Spot. Schieß dem Pferd in den Arsch. Was? Tschüss. Huge Play. Nee, Doomfist, so nicht. Wie um alles in der Welt haben wir das gewonnen. Huge Plays. Da waren aber ein paar ganz gute Lucio Plays dabei. Lucio flutscht noch. Er ist kein Healer. Hab ich das Gefühl, oder wird die Musik immer lauter gerade? Ich hab das Gefühl, ich hab das Gefühl, ich hab das Gefühl. Ich hab das Gefühl, ich hab das Gefühl, ich hab das Gefühl, ich hab das Gefühl. Ich hab das Gefühl, ich hab das Gefühl, ich hab das Gefühl, ich hab das Gefühl. Ich hab das Gefühl, ich hab das Gefühl. Nein. Deswegen ist Lucio nice. Ich hab gleich Ulf hier. Spot. Massive G-Baited. Ich war's nett. Alter, das ist ja echt mal anstrengend. Das war aber echt ein Lucio-Gameplay, was man eigentlich aufnehmen könnte. Ich teilweise hatte da ein paar nice Sachen. Ding. Ding. Oder auch nicht. Was war denn jetzt für eine Map? Da mohten Max Eiskalt für sich selber, ja. Ich wusste, ich wusste einfach, er hat so den Fingern gejoggt. Das kann man machen. Yoshi wäre ich auch für. Sie sollten sich mal, sie sollten sich endlich mal ihren Scheiß zusammenkriegen und Demoman Peak in Overwatch einbauen. Ich bin so fort dabei. Ich spiele bestimmt Genji. Ich habe jetzt gestream sniped. Warum spielst du nicht mehr mit deinem Main? Weil ich es seit Season 3 nicht mehr gespielt habe. Ich dachte mir, ich mache meinen einfachen neuen Account, weil ich das Game eh wieder zu großen Teilen, zumindest auf halbwegs anständigem Level wieder lernen muss. Neuer Account. Ist das das mit der Brücke, das ist das mit der Brücke. Da ist Reinhardt vielleicht. Da wäre so eine D.Va besser, weil Reinhardt fliegt mir hier ganz gerne mal runter gegen die Fahrer. Ja, genau wie es dir eher gesagt, so ist es. Oder doch keine Fahrer oder doch nicht. Schadenquats. Keine, da geht gerade nicht viel. Er wünscht dir auch Kommenze. Kommenze? Common Sense. Kommenze. Kommenze hast du mir auch nicht gehört. Regroupen. Regrouporn. Pusht rein, pusht rein. Ist hier noch was? Nicht overextenden. Ah ja, chill, chill, chill. Willst du reinspringen, Mann? Ja. Double Allpower. Komm zu mir, wenn du hier brauchst. Next XQC hier. Irgendwas lebt. Ich glaube, pushen die links? Etwas. Ja. Nein, die müssen pumpen. Der hat Earth Shatter, der kokt schon so. Haha. Nein, nein, nein. Das sei auf dem... Asphania. Gold Damage. Gold Damage, Leute. Gold. Tristan Place. Egal, ob Nano boostet oder nicht. Ja, Yoshi, manchmal rage man einfach. Sag noch mal bitte, ich hab's nicht verstanden. Ich guck mal. Könnte sein, dass der geswitcht hat. Lass mal gucken. Wir haben den Shunk. Die lauschen im Stream, das kannst du nicht machen. Das nie, der Streamsnipe ist real, ja. Heimlich lauschen. Irgendwas puffen. Ihr müsst aus dem Chalk raus. Geht aus dem Chalk raus, geht einfach. Tracer swebt hinten bei mir. Ich war ein bisschen zu schnell, sorry. Ich kann euch im Chalk wieder heilen. Ja, ja, ich komm wieder weg. Lass die mal poschen, ich bin oben. Geht aus dem Chalk weg, bitte. Der Creel, rechte Seite, allein. Villain. Fuck. Der hat mir mitpushen müssen, hat alle mitpushen müssen. Nein, halb. Der holt es hier. Tanks links, tanks links. Ich hab gedacht, ich kann aus der Tür rauskicken. Das hat nicht funktioniert. Hundert pro. Sleeps. Der Gengu ist da tot. Irgendwie sind die Matches lustigerweise nicht so knapp, wie ich gedacht hätte. Jetzt kommt es, jetzt kommt es. Okay, machen wir noch eins. Man hätte ja sagen können, dass jetzt alle gleich Placements suchen wollen. Also ich mach die Placements morgen. Also Jax, falls du gerade Stream guckst, bis hier heute, kannst du keine Placements mehr gebacken. Jetzt ist er raus, okay. Naja, wenn er lief, dann kann ich ihn auch nicht ins andere Team switchen. Ah, nice, okay, easy. Was haben wir jetzt noch für ein Land gekriegt? Einen... einen Diamond Player. Map machen wir. Spielen wir jetzt mal. Dorado, Dorado. Beste Map. Also von den Rängen her sollte es relativ ausgeglichen sein. Das Gegner hat Master, Master Diamonds. Wir haben Bronze, Master. Okay, ja gut, wir haben den Jax. Da, der rechte alle. Wie die Musik abgeht. So, das jetzt. Hast du eigentlich Plants vs. Zombies gefinished? Nein. Ich hab BDO gekreint. Warum gucken mir eigentlich 100 Leute zu jetzt schon die ganze Zeit? Also, irgendwie gibt es noch mehr No-Life-Leute, habe ich das Gefühl. Yoshi, du guckst, seit du 13 bist. Ja gut, ja gut, klar. Natürlich kann es schon sein. Ja, easy. Lass mal runter. Äh. Alles, alles... verreckt. Was haben die denn? Was kann ich denn spielen? Nein, wir, wir contesten eh nicht nochmal. Moment, wir haben einen Reinhardt jetzt? Hatten wir schon die ganze Zeit einen Reinhardt? Hatten wir schon die ganze Zeit einen Reinhardt? Das ist ziemlich bescheuert, dass ich Orissa genommen habe. Ich muss noch ein Stückchen an die Ecke. Jetzt haben wir das Schild des Todes hier am Start. Ein Stückchen zurück. Lass nicht direkt am... Ich kann nicht mehr reden. Mein Chat ist weg. Mein Voice-Chat geht nicht mehr. Hört ihr mich noch? Leute, hört ihr mich noch? Ja, ihr hört mich noch. Ich kann mich jetzt so... Hört mich noch auf das Game-Concept. Hört mich noch auf das Game-Concept. Ja, ja, ja, mich, okay. Ohne Voice ist das echt doof. Ohne Voice ist das echt doof. Ich hab mich mal verpisst. Ist aber nice geplockt, haben wir den in Reinhardt. Oh oh, zu viel und scheiß Position. Moment, was ist denn mit meinem scheiß Mikro los? Geht jetzt Voice wieder? Voice? Hallo? Voice? Stopp. Okay, wenn wir den Reinhardt haben... Egal, Orissa funktioniert gut. Checks nicht? Ist jetzt mein Voice kaputt? Aber wir können schon noch ein bisschen stallen, easy. Oh, ich hab Ulti, Brinkens vor sechs. Es ist keiner im Team. Hä? Hallo? Ah, WTF? Was war denn das für ein Scheiß? Voice-Bun. Reaper flankt links oben. Reaper kommt wieder links. Scheiße. Können wir das noch mal kontestieren? Das passt schon einfach schön. Oh, nice picks, nice picks. Echo pickt den. Done. da wo hinsten will er es aber wissen sehr riesenherzig sagt mal leute jetzt mal was ganz was anderes war eine ganz andere frage an euch guckt jemand von euch speedruns oder speedrun jemand selbst zufällig getting over it, ganz random frage ich gebe es zu aber ich würde gerne ein getting over it speedrun zeigen und irgendwie ist es schwierig da an deutsche runner ranzukommen oder zu finden die irgendwie auch eine zeit haben die nicht zehnmal langsamer ist wie die besten getting over it speedruns das ist übelst geil guckt euch guckt euch das mal an, das ist mega geil, sag mal heute sieht das stream gut aus oder fällt mir gerade so auf so 720p 48 fps ich finde es echt scharf und es ruckelt nichts, sieht top aus warum spielst du nicht mehr mit deiner main weil ich bis season 3 quasi ich habe ja nur bis season 3 gespielt also ich habe seit season 3 nicht mehr gespielt nachdem ich das game auf so ein bisschen höherem level wieder komplett neu lernen muss habe ich mir gedacht mach mal einen neuen account, dann kannst du es in ruhe üben ja getting over it speedruns sind nur einmal interessant für dich das wäre optimal für ein video ja schon da ich habe das mal für einen sicheren fire strike verwendet schreckt machst du die placement matcher sein das sind noch viewer games noch since viewer games ja massi massi cheat huge chatter huge massive shut down 240hz monitor ist gut vielleicht vielleicht lasse ich mich doch mal chebaten und holen wir ein was war ich da ich drinne na gut aufhauen wird schon recht haben ja meine massi ja aber selbst die massi retten sie gerade nicht achte achte achte oh jetzt hat er mich gebatet du willst die consultant karriere ich spiele Okay Leute, ich bin fertig für heute, war sehr nice, schöner No-Live-Stream. Also Leute, wir waren aus, war ein sehr schöner Stream. Hab Bock gemacht und je nachdem was ihr jetzt auch macht, viel Spaß dabei und wir sehen uns, alles klar, bis morgen, tschüss. Tschüss, tschüss, tschüss, tschüss, tschüss. Tschüss, tschüss, tschüss. Das war's für heute. Das war's für heute.", "segments": [{"id": 1, "start": 0.0, "end": 25.64, "text": "Da sind wir und ich hoffe, dass der Stream 48 FPS hat, hoffentlich stimmt das jetzt"}, {"id": 2, "start": 25.64, "end": 40.76, "text": "was, ja wunderbar. Moment, stopp der Chat geht nicht, geht der Chat? Alter lahm geht"}, {"id": 3, "start": 40.76, "end": 65.44, "text": "der Chat, mal testen, der Chat geht nicht, Chat ist broken, jetzt geht der Chat, perfekt,"}, {"id": 4, "start": 65.44, "end": 80.12, "text": "ich wäre auch gern zu Hause zu sorgen. Ja, IRL ne. Ich habs mir auch überlegt, aber"}, {"id": 5, "start": 80.12, "end": 85.64, "text": "ich hatte kein Bock, außerdem wisst ihr ja, ich habs nicht so mit großen, mit sozialen"}, {"id": 6, "start": 85.64, "end": 93.08, "text": "Events mit vielen Leuten. So die große Preisfrage ist, was wir heute Abend machen, ich hab keine"}, {"id": 7, "start": 93.08, "end": 103.48, "text": "Ahnung, also, entweder grind ich meine BDO-Dailys jetzt erstmal, dass so viele jetzt überhaupt"}, {"id": 8, "start": 103.48, "end": 127.36, "text": "da sind, ist schon wieder geil. Gibt noch mehr No-Life-Leute wie ich. Moment, den Eax"}, {"id": 9, "start": 127.36, "end": 134.12, "text": "kann ich jetzt gerade mal anschreiben, ob wir nachher Placements machen wollen in Overwatch."}, {"id": 10, "start": 134.12, "end": 146.4, "text": "Moment, das gucken wir jetzt gerade mal. Wir gucken gerade mal. Die Blizzard App, heißt"}, {"id": 11, "start": 146.4, "end": 151.56, "text": "die jetzt wieder Blizzard App oder Battle.net App? Das ist geil, die heißt wieder Battle.net"}, {"id": 12, "start": 151.56, "end": 157.72, "text": "App, ne? Leute, ich muss mal kurz meinen Browser-Tab refreshen, so ich seh jetzt kurz nicht,"}, {"id": 13, "start": 157.72, "end": 167.24, "text": "wenn ihr was im Chat schreibt. Ja, jetzt sollte es eigentlich wieder gehen. Ja. Gucken wir"}, {"id": 14, "start": 167.24, "end": 176.12, "text": "doch mal. Mal sehen wir doch gerade mal aus. Ich starte das Game mal schnell. Window-Capture,"}, {"id": 15, "start": 176.12, "end": 193.04, "text": "nein. Hallo? Warum geht das nicht? Eigentlich möchte ich jetzt... Ah, Moment, Moment, man"}, {"id": 16, "start": 193.04, "end": 203.72, "text": "macht kein Window-Capture, man muss Game-Capture machen, weil OBS sagt, das muss so sein. Ja,"}, {"id": 17, "start": 203.72, "end": 209.16, "text": "das funktioniert jetzt auch. Ok, wir gucken jetzt mal, ist denn die neue Season schon"}, {"id": 18, "start": 209.16, "end": 212.48, "text": "on, weil dann können wir auch die Placements machen, wenn ich den Eax dazu kriege, Placements"}, {"id": 19, "start": 212.48, "end": 237.68, "text": "zu machen. Ne, das hat... 3 Stunden ist zu lang. Also wir können jetzt ja schlecht 3 Stunden"}, {"id": 20, "start": 237.68, "end": 250.28, "text": "hier einfach nur da sitzen. Voodoo-Cloud muss arbeiten. Meinst du jetzt? Meinst du jetzt"}, {"id": 21, "start": 250.28, "end": 261.0, "text": "oder morgen? Morgen ist doch Feiertag. I'll be your Ukraine. Ok, also die Overwatch-Season"}, {"id": 22, "start": 261.0, "end": 272.88, "text": "ist nicht live. Dann mache ich mal BDO an und crying einfach mal ein bisschen, bis wir"}, {"id": 23, "start": 272.88, "end": 278.92, "text": "eine Ahnung haben, was wir machen können. Also wir haben auch noch zur Auswahl, dass"}, {"id": 24, "start": 278.92, "end": 282.36, "text": "wir entweder, also entweder, zwei Sachen, die zur Auswahl stehen, Moment, ich logg mich"}, {"id": 25, "start": 282.36, "end": 289.36, "text": "jetzt erst mal kurz ein. Zwei Sachen, die zur Auswahl stehen, sind entweder ich mache"}, {"id": 26, "start": 289.36, "end": 296.64, "text": "mal ein BDO, mein BDO daily grind, 300 Basis killen, 300 Centaurs killen, 300 Cuttreys killen"}, {"id": 27, "start": 296.64, "end": 306.8, "text": "oder irgendwie sowas. Vielleicht mache ich das. Oder wir spielen Plants vs. Zombies fertig,"}, {"id": 28, "start": 306.8, "end": 312.12, "text": "also das erste Tower-Defense-Spiel. Da sind wir jetzt ja quasi im letzten Drittel angekommen,"}, {"id": 29, "start": 312.12, "end": 319.24, "text": "also ich mache jetzt erstmal ein BDO an. Oder aber, was wir auch machen können, was wir auch"}, {"id": 30, "start": 319.24, "end": 329.24, "text": "machen können ist, wir gucken uns Katzenvideos an. Wir gucken uns Katzenvideos an, easy, oder?"}, {"id": 31, "start": 329.24, "end": 344.32, "text": "BDO ist eigentlich offen, BDO sollte jetzt angezeigt werden. BDO wieder angezeigt. Wir"}, {"id": 32, "start": 344.32, "end": 349.4, "text": "können uns Katzenvideos angucken, wir gucken uns jetzt, süße Katze ist sehr anhänglich,"}, {"id": 33, "start": 349.4, "end": 360.44, "text": "wir gucken uns jetzt an. Oh, die ist aber echt süß. Oh, was die für Geräusche macht."}, {"id": 34, "start": 360.44, "end": 389.88, "text": "Oh, oh, kleines Katzi. Ah, ist das ein süßes Katzilein. Joa. Die will nicht weg."}, {"id": 35, "start": 389.88, "end": 408.16, "text": "Ach, ist das niedlich. Kleines, feines Katzi. Ja, so muss das sein. Vor allem wenn es heute"}, {"id": 36, "start": 408.16, "end": 421.12, "text": "so knallt. Haben sie wieder Schiss. So, ich glaube nicht, dass wir uns den ganzen Abend"}, {"id": 37, "start": 421.12, "end": 446.32, "text": "Katzenvideos angucken wollen, oder? Erstmal den Viztacht einlocken. Deine Schicht beginnt"}, {"id": 38, "start": 446.32, "end": 452.96, "text": "um 23 Uhr. Ich arbeite in der Rezeption in einem 5-Sterne-Hotel. Ah, um 7.30 Uhr habe"}, {"id": 39, "start": 452.96, "end": 458.76, "text": "ich dann Feierabend. Das ist natürlich eine Scheißzeit. So, jetzt rennen wir erstmal"}, {"id": 40, "start": 458.76, "end": 464.28, "text": "zurück in irgendeine Stadt. Wir rennen jetzt zurück zu unserem Gaul und reiten mal zu unserem"}, {"id": 41, "start": 464.28, "end": 471.28, "text": "Richtung Craning-Spot hoch. Silvester in Black Desert. Ja, ich weiß es nicht. Also,"}, {"id": 42, "start": 471.28, "end": 476.2, "text": "wie gesagt, es steht so aus, weil entweder gucken wir uns Katzenvideos anspielen im Video,"}, {"id": 43, "start": 476.2, "end": 494.04, "text": "oder wir spielen Plants vs. Zombies fertig. Na, oder wir könnten Viewer Games in Overwatch"}, {"id": 44, "start": 494.04, "end": 501.92, "text": "machen. Das geht natürlich auch. Das geht natürlich auch. Moment, Evoli, weißt du,"}, {"id": 45, "start": 501.92, "end": 511.68, "text": "wie man Pols machen kann? Was heißt das? Pols? Pool? Pol, oder? Eine Abstimmung. Also,"}, {"id": 46, "start": 511.68, "end": 515.08, "text": "wir haben zur Auswahl Katzenvideos, wobei das nicht wirklich ernst gemeint ist, aber"}, {"id": 47, "start": 515.08, "end": 522.68, "text": "das können wir mal reinschreiben. Also, zur Auswahl stehen für die Abstimmung Katzenvideos."}, {"id": 48, "start": 522.68, "end": 525.72, "text": "Das gewinnt jetzt wahrscheinlich, wenn ich das mit reinschreibe. Egal, das schreiben"}, {"id": 49, "start": 525.72, "end": 537.08, "text": "wir mit rein. Katzenvideos, Overwatch Custom Matches, also oder, bzw. Viewer Games, BDO,"}, {"id": 50, "start": 537.08, "end": 554.56, "text": "oder BDO Daily Mob Grind, oder Plants vs. Zombies. Kampagne fertig machen. So, ich mach"}, {"id": 51, "start": 554.56, "end": 562.6, "text": "mal einen Poll. Ne, ich mach schon. Straw Poll, oder wie das ging. So, gucken, dass ich"}, {"id": 52, "start": 562.6, "end": 570.52, "text": "jetzt nicht in irgendwelche Mops reinrenne. Oh, ich mach mal, ich mach mal eine Abstimmung."}, {"id": 53, "start": 570.52, "end": 600.16, "text": "Also, was wollen wir? Ach, Overwatch, wie schreibt das? Viewer Games. Black Desert Daily"}, {"id": 54, "start": 600.16, "end": 616.68, "text": "Mob Grind, oder aber Plants vs. Zombies. Kampagne fertig. Das wird allerdings nicht"}, {"id": 55, "start": 616.68, "end": 620.8, "text": "bis 24 Uhr ausreichen, Plants vs. Zombies Kampagne. Generell, es muss ja nichts davon"}, {"id": 56, "start": 620.8, "end": 646.88, "text": "werden, bis 24 Uhr auslassen, man kann ja mehrere Sachen machen. Ok, Poll. So, einmal"}, {"id": 57, "start": 646.88, "end": 655.4, "text": "abstimmen, please. Wir könnten auch ganz, ganz abgedrehte Sachen machen. Katzenvideos"}, {"id": 58, "start": 655.4, "end": 661.28, "text": "auf der einen Seite und Plants vs. Zombies auf der anderen. So, ich reite jetzt aber"}, {"id": 59, "start": 661.28, "end": 677.4, "text": "erstmal hoch, ich muss hier eh weg. Welches Food ist denn hier dran? Wir müssen eh irgendwo"}, {"id": 60, "start": 677.4, "end": 693.68, "text": "rein, da ist es auf jeden Fall nicht schlecht, bei einer alten Nova zu reiten. Dass wir den"}, {"id": 61, "start": 693.68, "end": 706.92, "text": "Katzenvideos, wie gesagt, das ist nicht wirklich ernst gemeint, ne? Es war ja klar, dass die"}, {"id": 62, "start": 706.92, "end": 724.16, "text": "Katzenvideos gewinnt. Hast du keine EAS-Umbroker Korthüllen? Doch, Korthüllen habe ich noch."}, {"id": 63, "start": 724.16, "end": 749.68, "text": "Ich warte mal in den Reacts, ob er mitspielen will, falls wir Overwatch machen. Brings die"}, {"id": 64, "start": 749.68, "end": 774.8, "text": "Quali ein bisschen besser sein, hoffe ich. Ich habe jetzt auf 48 FPS runtergestellt und"}, {"id": 65, "start": 774.8, "end": 781.92, "text": "Slower auf Medium. Encoding Zeit, also es müsste jetzt ein bisschen besser aussehen"}, {"id": 66, "start": 781.92, "end": 790.36, "text": "ohne zu ruckeln als gestern. Um Null über Placements? Ja, ich weiß, wir können nicht"}, {"id": 67, "start": 790.36, "end": 816.6, "text": "vorher Placements machen. Okay, also es ist bis jetzt ziemlich exakt gleich Stand zwischen"}, {"id": 68, "start": 816.6, "end": 827.64, "text": "Overwatch Custom Games und Plants vs. Zombies Kampagne und gefolgt von BDO. Gewonnen haben"}, {"id": 69, "start": 827.64, "end": 833.92, "text": "natürlich die Katzenvideos, das heißt wir müssen uns jetzt noch mindestens mal nebenbei"}, {"id": 70, "start": 833.92, "end": 838.96, "text": "ein, zwei süße Katzenvideos angucken. Dann würde ich vorschlagen, spielen wir jetzt"}, {"id": 71, "start": 838.96, "end": 848.04, "text": "erstmal Plants vs. Zombies fertig. Wir spielen erstmal Plants vs. Zombies fertig und danach"}, {"id": 72, "start": 848.04, "end": 869.44, "text": "machen wir Overwatch Games, da können wir uns nämlich aufwärmen für Null über Placements."}, {"id": 73, "start": 869.44, "end": 886.28, "text": "Okay, jetzt haben wir die Plants vs. Zombies Kampagne und Plants vs. Zombies Kampagne."}, {"id": 74, "start": 886.28, "end": 900.32, "text": "Reb, Rebdoka, was wolltest du denn haben? So, oh ne, oh jetzt wirds grausam wieder. Jetzt"}, {"id": 75, "start": 900.32, "end": 909.48, "text": "müssen wir mal Plants vs. Zombies erstmal wieder einstellen, dass man das Game richtig"}, {"id": 76, "start": 909.48, "end": 933.8, "text": "sieht. Okay, euer, ich ahne wieder Schlemmes. Ich ahne ganz Schlemmes. Okay, dann versuch"}, {"id": 77, "start": 933.8, "end": 945.48, "text": "ich das jetzt mal zu crabben. Geht nicht. Okay, das wolltest du wahrscheinlich wieder"}, {"id": 78, "start": 945.48, "end": 956.32, "text": "mit Game Capture machen. Das ist echt immer kompliziert, so ganzen Kackgames zu crabben."}, {"id": 79, "start": 956.32, "end": 975.52, "text": "Kann das sein, dass Plants vs. Zombies wieder nicht erkannt wird oder was? Oh, jetzt ist"}, {"id": 80, "start": 975.52, "end": 984.72, "text": "wieder, der OBS Struggle ist wieder real. Das müssen wir jetzt erstmal wieder einstellen,"}, {"id": 81, "start": 984.72, "end": 989.28, "text": "aber ich weiß ja noch wie es funktioniert hat. Moment, Moment, ich hab die hier noch"}, {"id": 82, "start": 989.28, "end": 1011.32, "text": "drin, Window Capture. Nein, das sind die Katzenvideos. Geht doch. So, jetzt müssen wir das Game leider"}, {"id": 83, "start": 1011.32, "end": 1032.52, "text": "wieder ganz eklig verschieben. So, easy. Okay, BDO muss ich jetzt, ich muss jetzt erstmal"}, {"id": 84, "start": 1032.52, "end": 1039.72, "text": "in BDO noch, ich muss jetzt erstmal in BDO noch, wir müssen jetzt zumindest noch hoch"}, {"id": 85, "start": 1039.72, "end": 1043.28, "text": "reiten, sonst sitz ich hier am Arsch der Welt. Wir müssen jetzt noch mal kurz hier hin reiten,"}, {"id": 86, "start": 1043.28, "end": 1052.24, "text": "dann können wir weitermachen. Stretched. Ja, es geht nicht anders, das Game ist 4 zu 3."}, {"id": 87, "start": 1052.24, "end": 1058.32, "text": "Ich frag mich wie das auf der, so und während ich reite gucken wir uns noch Katzenvideos"}, {"id": 88, "start": 1058.32, "end": 1073.76, "text": "an. Oh, die ist aber auch echt süß."}, {"id": 89, "start": 1073.76, "end": 1097.04, "text": "So ein kleines, feines Katzi. Jetzt drück doch mal Shift Mensch, warum soll ich Shift"}, {"id": 90, "start": 1097.04, "end": 1122.24, "text": "drücken? Hä? What? What Alter? Was? Shift? So, nächstes, was haben wir sonst noch für"}, {"id": 91, "start": 1122.24, "end": 1128.04, "text": "Katzenvideos zur, zu was haben wir sonst noch für Katzenvideos zur Auswahl hier? Dann"}, {"id": 92, "start": 1128.04, "end": 1131.72, "text": "rennt mein Pferd schneller, ich kann jetzt aber nicht auf YouTube gucken und mein Pferd"}, {"id": 93, "start": 1131.72, "end": 1137.76, "text": "schneller rennen lassen, das funktioniert nicht. Ich mach jetzt das, was laut Abstimmung"}, {"id": 94, "start": 1137.76, "end": 1145.44, "text": "am meisten gewünscht wurde und das sind auf einmal jetzt BDO Dailygrind. What the fuck?"}, {"id": 95, "start": 1145.44, "end": 1152.16, "text": "Wollt ihr mich rollen oder was? Eben war Plants vs. Zombies Kampagne noch erster, noch erster"}, {"id": 96, "start": 1152.16, "end": 1168.32, "text": "und jetzt ist BDO Mob Dailygrind und Overwatch Custom Games vorne. Was machen wir denn jetzt?"}, {"id": 97, "start": 1168.32, "end": 1192.04, "text": "Wo kann man hier abstimmen? Ja Moment, Schicks noch mal. So. Also Leute, ich gebe euch jetzt"}, {"id": 98, "start": 1192.04, "end": 1196.48, "text": "noch mal 5 Minuten Zeit zum abstimmen. In der Zeit gucken wir Katzenvideos und ich reite"}, {"id": 99, "start": 1196.48, "end": 1202.52, "text": "mit dem Pferd zum Grinding Spot und was dann oben ist, machen wir gefolgt vom anderen."}, {"id": 100, "start": 1202.52, "end": 1207.32, "text": "Es sei dann, es sei dann Overwatch und Plants vs. Zombies liegen relativ nah beieinander,"}, {"id": 101, "start": 1207.32, "end": 1210.92, "text": "dann würde ich sagen, machen wir Overwatch zum Aufwärmen für die neue Season Richtung"}, {"id": 102, "start": 1210.92, "end": 1233.92, "text": "Null Uhr. Evoli hat, was ist das für ein Video? Katze? Ok, Moment Evoli, jetzt gucken wir"}, {"id": 103, "start": 1233.92, "end": 1252.08, "text": "uns jetzt an. BTF, was ist das? Das ist doch nachvertont, oder?"}, {"id": 104, "start": 1252.08, "end": 1277.8, "text": "Ich kann gerade kein Chat lesen, ich muss gerade 3 sagen, gleichzeitig nachkommen. Krass."}, {"id": 105, "start": 1277.8, "end": 1295.48, "text": "Ich mach mal, ich mach mal die Musik aus, dass man das hört. Das ist doch krass. Aber"}, {"id": 106, "start": 1295.48, "end": 1317.56, "text": "noch mal, ich weiß nicht, ob ihr das gehört habt. Das klingt, als will einer so fake rülpsen."}, {"id": 107, "start": 1317.56, "end": 1325.36, "text": "Das ist ja so Leute, die es nicht können richtig, die hören es schon auch so an. Wenn"}, {"id": 108, "start": 1325.36, "end": 1336.08, "text": "ihr wisst, was ich meine, das ist aber hart. Ich hätte erst gedacht, das ist bearbeitet"}, {"id": 109, "start": 1336.08, "end": 1343.6, "text": "oder so. Was kann man sonst noch für Katzenvideos zu bieten? Revo? Das hört sich an wie einer,"}, {"id": 110, "start": 1343.6, "end": 1346.56, "text": "ich finde das hört sich voll an wie einer, der versucht so, wisst ihr früher war es"}, {"id": 111, "start": 1346.56, "end": 1350.8, "text": "doch besonders cool, wenn man so, wenn man quasi so künstlich rülpsen konnte. Da fanden"}, {"id": 112, "start": 1350.8, "end": 1354.72, "text": "sie sich alle geil, wenn sie es kommen. Und die Leute, die es nicht konnten, also inklusive"}, {"id": 113, "start": 1354.72, "end": 1358.56, "text": "mir, ich habe mir das nie beigebracht, weil es irgendwie ziemlich sinnloser Skill ist,"}, {"id": 114, "start": 1358.56, "end": 1372.88, "text": "die haben dann auch einfach gemacht, weil sie es nicht hingekriegt haben. So, was sagt"}, {"id": 115, "start": 1372.88, "end": 1392.64, "text": "ihr jetzt? Also wir haben noch bis 35 Zeit abzustimmen, was wir machen sollen. Okay,"}, {"id": 116, "start": 1392.64, "end": 1403.36, "text": "das ist aber alles so ziemlich ähnlich. Das Problem dabei ist, wenn das so total aufgesplittet"}, {"id": 117, "start": 1403.36, "end": 1410.12, "text": "ist, wenn ich jetzt das eine mache, ist es nicht, was ein Drittel der Leute will. Wenn"}, {"id": 118, "start": 1410.12, "end": 1414.68, "text": "ich das andere mache, ist es nicht, was ein Drittel der Leute will. Was auf jeden Fall"}, {"id": 119, "start": 1414.68, "end": 1419.64, "text": "ein Viertel der Leute will ist Katzenvideos. Streamst du bis nächstes Jahr durch oder"}, {"id": 120, "start": 1419.64, "end": 1424.4, "text": "gehst du kurz vor 24 Uhr auf. Also ich glaube nicht, dass ich auf gehe. Also ich streame"}, {"id": 121, "start": 1424.4, "end": 1428.64, "text": "durch bis nächstes Jahr, allerdings wahrscheinlich nicht bis irgendwie morgen früh oder so."}, {"id": 122, "start": 1428.64, "end": 1438.2, "text": "So, was haben wir sonst noch? Ich weiß nicht, ich finde Katzenbaby-Videos gar nicht so"}, {"id": 123, "start": 1438.2, "end": 1443.96, "text": "toll. Ich gucke am liebsten ehrlich gesagt Videos von ausgewachsenen Katzen. So dieses"}, {"id": 124, "start": 1443.96, "end": 1448.56, "text": "Oh alle Katzenbabys sind so süß ist auch das Problem, dass sich Leute immer mehr Katzenbabys"}, {"id": 125, "start": 1448.56, "end": 1452.32, "text": "kaufen und sie irgendwann ins Tierheim bringen, weil sie ja feststellen, dass Katzenbabys"}, {"id": 126, "start": 1452.32, "end": 1461.12, "text": "auch mal groß werden. Dann lieber so eine oder? Die ist doch wirklich süß hier. Die"}, {"id": 127, "start": 1461.12, "end": 1466.08, "text": "sieht fast ein bisschen aus wie Katz-FPS plus komplett halt, also vom Kopf her, plus wie"}, {"id": 128, "start": 1466.08, "end": 1481.04, "text": "komplett andere Farbe. Lul Katzenvideos, ja. Ja ich muss erstmal zum Grinding Spot. So"}, {"id": 129, "start": 1481.04, "end": 1487.52, "text": "was haben wir sonst noch hier? Katze fährt alleine S-Bahn. Die haben damit doch keine"}, {"id": 130, "start": 1487.52, "end": 1491.92, "text": "Schmerzen. Ach das ist ja nicht mal ein Video, das ist ja dumm. So lange die Katze in Ruhe"}, {"id": 131, "start": 1491.92, "end": 1496.24, "text": "lässt, ist es dennoch wurscht. Die legt sich dann da hin, denkt easy life. Hier wird in"}, {"id": 132, "start": 1496.24, "end": 1501.76, "text": "der S-Bahn gelegen, was juckt mich der Rest drumherum? Wenn man süße Katze eingibt, gibt"}, {"id": 133, "start": 1501.76, "end": 1506.08, "text": "es nur Babykatzen auf YouTube. Das finde ich so bescheuert. Ich gucke mir viel lieber"}, {"id": 134, "start": 1506.08, "end": 1517.56, "text": "auch im... singt, nein das ist bestimmt dummes Video. Leichter Clickbait Titel würde ich"}, {"id": 135, "start": 1517.56, "end": 1536.16, "text": "mal sagen. Die ist niedlich. Was haben wir sonst noch hier zu bieten? Die meisten funny"}, {"id": 136, "start": 1536.16, "end": 1541.48, "text": "Katz-Kompilations finde ich nämlich auch überhaupt nicht funny. Ich finde vieles"}, {"id": 137, "start": 1541.48, "end": 1552.04, "text": "generell nicht funny. Kennt ihr diese Videos, die im Titel haben irgendwie do not oder du"}, {"id": 138, "start": 1552.04, "end": 1559.0, "text": "schaffst es nicht nicht zu lachen oder so diese Videos, wo dann irgendwie mit 10 Minuten"}, {"id": 139, "start": 1559.0, "end": 1565.6, "text": "Video wetten du schaffst es, du hältst es nicht durch nicht zu lachen und sowas. Und"}, {"id": 140, "start": 1565.6, "end": 1586.16, "text": "ich weiß schon quasi am Anfang des Videos, dass das eigentlich total lustig ist. So okay,"}, {"id": 141, "start": 1586.16, "end": 1591.4, "text": "Abstimmung vorbei. Auf dem ersten Platz ist BDO Custom Games, auf dem zweiten Platz ist"}, {"id": 142, "start": 1591.4, "end": 1598.6, "text": "Overwatch Custom Games, auf dem zweiten Platz BDO Daily Mob Crimes und Plants vs. Zombie"}, {"id": 143, "start": 1598.6, "end": 1607.92, "text": "Kampagne. Allerdings ist alles so um die 30% rum. Eine 31%, andere 24%. Deswegen würde"}, {"id": 144, "start": 1607.92, "end": 1613.08, "text": "ich sagen, machen wir einfach alles. Ich meine wir haben noch 2,5 Stunden Zeit, das geht."}, {"id": 145, "start": 1613.08, "end": 1631.4, "text": "Ich werde jetzt, wenn ich gerade schon dabei bin, wir machen Daily Catry Crime Quest, das"}, {"id": 146, "start": 1631.4, "end": 1642.44, "text": "ist easy, das geht schnell. Und dann muss ich mal gucken, wenn der Eax da ist, machen"}, {"id": 147, "start": 1642.44, "end": 1660.36, "text": "wir Custom Games. Eax, woher soll ich wissen, was du machen sollst, wenn dein Game ruckelt?"}, {"id": 148, "start": 1660.36, "end": 1688.36, "text": "So, okay, mal gucken, ob er dabei ist, mal schauen. Ist das Black Desert Online? Ja,"}, {"id": 149, "start": 1688.36, "end": 1704.6, "text": "ich stelle das mal auch kurz um, weil so in RL ist nicht wirklich richtig. Hat bei euch"}, {"id": 150, "start": 1704.6, "end": 1722.76, "text": "die Stream Kategorie aktualisiert? Hat bei euch die Stream Kategorie aktualisiert? Also"}, {"id": 151, "start": 1722.76, "end": 1737.4, "text": "ich hatte es jetzt eigentlich umgestellt auf Black Desert. Irgendwie hat es keinen Bock."}, {"id": 152, "start": 1737.4, "end": 1740.76, "text": "Okay dann Bug Twitch, da muss man das wahrscheinlich über das Dashboard machen. Ich mache es über"}, {"id": 153, "start": 1740.76, "end": 1745.32, "text": "das Dashboard, über das Dashboard geht es immer. Twitch ist fast genauso kaputt wie"}, {"id": 154, "start": 1745.32, "end": 1761.4, "text": "ich, er tut mittlerweile immer sowas. Ähm, Black Desert Online, Informationen aktualisieren."}, {"id": 155, "start": 1761.4, "end": 1771.16, "text": "So, jetzt sollte es aber geupdatet haben. Ne, vielleicht braucht das kurz. Was ist da"}, {"id": 156, "start": 1771.16, "end": 1785.08, "text": "schon wieder kaputt? Twitch, please. Was, YouTube funktioniert doch super. YouTube funktioniert"}, {"id": 157, "start": 1785.08, "end": 1790.48, "text": "super zum angucken, aber das YouTube, also dieses, dieses, wie nennt es sich, Creation"}, {"id": 158, "start": 1790.48, "end": 1796.68, "text": "Center oder so, äh, Creator Studio, das ist ganz grausam. Das gibt mittlerweile sogar"}, {"id": 159, "start": 1796.68, "end": 1800.96, "text": "intern zwei verschiedene Versionen, die man verwenden kann und dem einen geht das und"}, {"id": 160, "start": 1800.96, "end": 1818.48, "text": "dem anderen geht das noch nicht, also, Google, ja. Okay, Informationen aktualisieren, Dashboard,"}, {"id": 161, "start": 1818.48, "end": 1829.0, "text": "easy, live. So, jetzt steht es bei mir auf Black Desert, aber, ah jetzt, jetzt hat es"}, {"id": 162, "start": 1829.0, "end": 1834.08, "text": "umgestellt, Leute, ne? Hat es bei euch auch umgestellt? Jetzt ist, jetzt ist richtig."}, {"id": 163, "start": 1834.08, "end": 1845.08, "text": "Jetzt steht es auf BDO. So, nice. Jetzt, jetzt hat es umgestellt. Twitch, ich hab das jetzt"}, {"id": 164, "start": 1845.08, "end": 1852.0, "text": "dreimal gemacht, dreimal exakt das gleiche, aber Twitch hat es, nope, kein Bock. Wie"}, {"id": 165, "start": 1852.0, "end": 1868.52, "text": "ist dein Familienname in BDO? Äh, Wubbel, was denkst du hier? Äh, Wubbel. Ähm, was"}, {"id": 166, "start": 1868.52, "end": 1881.64, "text": "denn? Ah, Evoliso Videoswitch blöd hat irgendwie einer seine Katze in die Badewanne gesetzt."}, {"id": 167, "start": 1881.64, "end": 1888.96, "text": "Oder ihr gefällt's, aber ich find die guckt nicht so, als dass ihr gefällt. Ähm, was"}, {"id": 168, "start": 1888.96, "end": 1893.84, "text": "sagst du dazu, dass YouTube, nein, was sagst du dazu, dass Amazon auch einen YouTube rausbringen"}, {"id": 169, "start": 1893.84, "end": 1900.16, "text": "möchte? Ähm, ich find das nicht schlecht. Also, der letzte Versuch, übrigens, erinnert"}, {"id": 170, "start": 1900.16, "end": 1905.76, "text": "ihr euch noch, erinnert ihr euch noch, ist ja noch nicht lange her, an YouNow, erinnert"}, {"id": 171, "start": 1905.76, "end": 1909.56, "text": "sich da noch jemand dran? Wir kommen, Moment, das gucken wir uns jetzt noch mal kurz zusammen"}, {"id": 172, "start": 1909.56, "end": 1913.0, "text": "an. Das müssen wir, Leute, das müssen wir uns jetzt noch mal zusammen kurz angucken."}, {"id": 173, "start": 1913.0, "end": 1919.4, "text": "YouNow, erinnert sich da noch jemand dran? War vor ein paar Monaten mal voll gehypt, kurzzeitig."}, {"id": 174, "start": 1919.4, "end": 1940.36, "text": "YouNow, äh, wupps. So, YouNow. So, und jetzt zeige ich euch mal das Beste. YouNow, jetzt"}, {"id": 175, "start": 1940.36, "end": 1954.6, "text": "steht das natürlich da oben nicht mehr da. Ähm, oh, da ist es schon. Also, YouNow wird"}, {"id": 176, "start": 1954.6, "end": 1964.84, "text": "geschlossen. YouNow, also, noch vor ein paar Monaten. Nee, warte mal, wie hieß das noch?"}, {"id": 177, "start": 1964.84, "end": 1968.12, "text": "Hieß es nicht YouNow? Oh, ich hab's, doch, hieß doch YouNow, oder, was vor ein paar"}, {"id": 178, "start": 1968.12, "end": 1972.32, "text": "Monaten voll angesagt war. Oh, fuck, oder verwechsel ich das jetzt gerade? Moment, das"}, {"id": 179, "start": 1972.32, "end": 1977.36, "text": "kann sein, dass ich das jetzt verwechsel. Wit-WitMe meine ich, WitMe, nicht YouNow, WitMe, WitMe"}, {"id": 180, "start": 1977.36, "end": 1993.6, "text": "meine ich. Ach, so, äh, WitMe, genau. So, und, ähm, das Beste ist, dass WitMe, WitMe"}, {"id": 181, "start": 1993.6, "end": 2001.12, "text": "ist down. Das war also quasi vor ein paar Monaten noch der übelste Hype, und jetzt"}, {"id": 182, "start": 2001.12, "end": 2007.8, "text": "ist WitMe weg. Ja, Fabian, ich hab das schon vor eineinhalb Monaten oder so mal getwittert"}, {"id": 183, "start": 2007.8, "end": 2012.32, "text": "als ich gelesen hab, aber jetzt wollen wir, dass man das mitkriegt. So, und deswegen,"}, {"id": 184, "start": 2012.32, "end": 2018.76, "text": "und das war ja eigentlich nur jetzt zur Überleitung, warum ich das, ähm, um dazu was zu sagen,"}, {"id": 185, "start": 2018.76, "end": 2024.44, "text": "ob, äh, ob Amazon, also was ich dazu sage, ob Amazon denn jetzt in YouTube aufmacht oder"}, {"id": 186, "start": 2024.44, "end": 2032.28, "text": "wie ich das finde, ich finde das gut, denn ich bin nicht mit allem einverstanden, wie"}, {"id": 187, "start": 2032.28, "end": 2036.68, "text": "das YouTube handelt. Ob das Amazon besser macht oder schlechter macht, so, das muss"}, {"id": 188, "start": 2036.68, "end": 2043.88, "text": "ich dann alles noch zeigen, aber ich glaube, dass Amazon eigentlich so ziemlich der einzige"}, {"id": 189, "start": 2043.88, "end": 2054.68, "text": "Laden ist, der sowas machen könnte, was zu YouTube auch nur annähernd konkurrenzfähig"}, {"id": 190, "start": 2054.68, "end": 2064.48, "text": "sein kann. Ich trau das sonst eigentlich keinem anderen Laden so richtig zu. So, und, wenn"}, {"id": 191, "start": 2064.48, "end": 2071.28, "text": "man davon ausgeht, dass Amazon, quasi ein YouTube, ein FireTube oder wie auch immer,"}, {"id": 192, "start": 2071.28, "end": 2077.2, "text": "das bei denen heißen mag, ja, Amazon macht ja bei allem, muss ja bei allem Fire sein,"}, {"id": 193, "start": 2077.2, "end": 2084.72, "text": "deswegen wird FireTube hier eigentlich irgendwie mal ein ganz lustiger Name dafür, ähm, dann"}, {"id": 194, "start": 2084.72, "end": 2089.44, "text": "geh ich mal von aus, dass da am Endeffekt die Leute auch nur davon profitieren können,"}, {"id": 195, "start": 2089.44, "end": 2096.88, "text": "weil, geh mal mal von aus, es gibt zwei Seiten, es gibt zwei große Seiten, wenn man in Zukunft"}, {"id": 196, "start": 2096.88, "end": 2105.0, "text": "ausgeblickt, dann ist das jetzt für die Viewer nicht so das große Problem. Ich denke mal,"}, {"id": 197, "start": 2105.0, "end": 2109.84, "text": "das wird sich dann schon so etablieren, dass spezielle Sachen eben auf YouTube mehr sind"}, {"id": 198, "start": 2109.84, "end": 2116.4, "text": "und auf Amazon andere. Ich glaube jetzt nicht, dass es quasi, ähm, dann auf YouTube große"}, {"id": 199, "start": 2116.4, "end": 2121.92, "text": "Gaming-Channels und auf Amazon große Gaming-Channels, dass da quasi 50% Gaming auf YouTube passiert"}, {"id": 200, "start": 2121.92, "end": 2127.72, "text": "und 50% Gaming auf, auf, äh, auf Amazon FireTube oder wie auch immer das heißt, das glaube"}, {"id": 201, "start": 2127.72, "end": 2134.0, "text": "ich nicht. Ich geh mal davon aus, dass ich das dann so ein bisschen, dass, dass ich dann"}, {"id": 202, "start": 2134.0, "end": 2138.4, "text": "die Creators halt quasi für ihre Sachen das Beste raussuchen lasse. Könnte dann sein,"}, {"id": 203, "start": 2138.4, "end": 2144.72, "text": "dass beispielsweise auf YouTube weiterhin dieser ganze Prank und, und, äh, was weiß"}, {"id": 204, "start": 2144.72, "end": 2150.44, "text": "ich jetzt hier, Prank, Weinen, Dingsbums, Stumpfsinn läuft und vielleicht noch Gaming"}, {"id": 205, "start": 2150.44, "end": 2154.12, "text": "und sonst was. Es könnte natürlich sein, dass ich dann auf Amazon ein bisschen anderer"}, {"id": 206, "start": 2154.12, "end": 2157.56, "text": "Content durchsetze, dass es dann vielleicht nicht Gaming ist, dass dann irgendwelche,"}, {"id": 207, "start": 2157.56, "end": 2163.2, "text": "äh, sagen wir mal Wissenschafts-Channels oder so sagen, hey, da bietet uns Amazon dann"}, {"id": 208, "start": 2163.2, "end": 2167.56, "text": "jetzt das bessere Umfeld für. Könnte ja, könnte ja sein, ne. Also könnte ich mir auch,"}, {"id": 209, "start": 2167.56, "end": 2172.4, "text": "könnte ich mir auch wirklich gut vorstellen. Ähm, oder umgedreht, mal gucken. Wovon ich"}, {"id": 210, "start": 2172.4, "end": 2178.64, "text": "ausgehe ist, ich mach mal ein bisschen lauter, wovon ich ausgehe ist, dass wenn Amazon sowas"}, {"id": 211, "start": 2178.64, "end": 2187.56, "text": "starten wird, dass sie dann auch versuchen werden, dass sie dann auch versuchen werden"}, {"id": 212, "start": 2187.56, "end": 2193.6, "text": "ein paar bekannte Leute zu sich zu kriegen. Wobei man sich da fragen muss, ist das sinnvoll?"}, {"id": 213, "start": 2193.6, "end": 2196.8, "text": "Das versuchen ja viele, vielleicht macht das Amazon auch ganz anders, wenn ich mir das"}, {"id": 214, "start": 2196.8, "end": 2201.16, "text": "so überlege. Also viele, viele Seiten sowas wie, was gibt's da, was gab's denn da alles"}, {"id": 215, "start": 2201.16, "end": 2211.32, "text": "hier, ähm, Afrika, äh, äh, ähm, Azubu, äh, Hitbox owned und Gedöns, also viele dieser"}, {"id": 216, "start": 2211.32, "end": 2217.72, "text": "Seiten, Hitbox auch im deutschen Raum, haben ja versucht, quasi bekannte Leute zu ihnen"}, {"id": 217, "start": 2217.72, "end": 2222.44, "text": "zu kriegen. Wie hießen die Seite, auf der Faker früher gestreamt hat, der LOL-Faker,"}, {"id": 218, "start": 2222.44, "end": 2228.72, "text": "war das, war das, ähm, war das Azubu oder war das Afrika? Keine Ahnung, ich weiß es"}, {"id": 219, "start": 2228.72, "end": 2234.6, "text": "nicht. Zumindest hatte der wohl mit Sicherheit einen guten Vertrag, äh, hatte aber kaum"}, {"id": 220, "start": 2234.6, "end": 2239.68, "text": "Viewer im Vergleich zu dem auf Twitch. Auf Twitch hat er dann gestreamt, mit, mit, wie"}, {"id": 221, "start": 2239.68, "end": 2244.36, "text": "viel, weiß ich, wie viele Leute auf Twitch zugeguckt haben, bei ihm irgendwie 100.000"}, {"id": 222, "start": 2244.36, "end": 2251.92, "text": "oder so total viel, also richtig massiv viel und, ähm, das heißt, es ist die Frage, ob"}, {"id": 223, "start": 2251.92, "end": 2256.44, "text": "es überhaupt sinnvoll ist, wenn man versucht von einer schon bestehenden Plattform, wo"}, {"id": 224, "start": 2256.44, "end": 2261.16, "text": "diese Leute ja eben auch ihre Fans haben. Ich mein, in PewDiePie, wenn der jetzt bei"}, {"id": 225, "start": 2261.16, "end": 2265.4, "text": "Amazon am Start ist, dann hat er halt, dann nimmt er ja nicht instanz eine komplette Fanbase"}, {"id": 226, "start": 2265.4, "end": 2269.28, "text": "mit, die ihn einfach nur auf YouTube verfolgt. Das klappt ja dann nicht. So, ich muss übrigens"}, {"id": 227, "start": 2269.28, "end": 2272.88, "text": "erstmal Quests abholen, für, äh, Monster killen, bevor ich hier anfange Monster zu"}, {"id": 228, "start": 2272.88, "end": 2280.08, "text": "killen. So, ähm, deswegen glaube ich fast, dass das bessere wäre, Moment, äh, Fabian,"}, {"id": 229, "start": 2280.08, "end": 2284.4, "text": "wo steht denn der komische NPC, der ist irgendwo hier oben auf dem Berg, ne? Falls du grad"}, {"id": 230, "start": 2284.4, "end": 2289.72, "text": "da bist. Hi, Eax. Ähm, deswegen glaube ich, dass es besser wäre, Amazon würde komplett"}, {"id": 231, "start": 2289.72, "end": 2296.24, "text": "drauf scheißen, was, ähm, was es für Leute auf YouTube gibt, sondern sich ihre eigenen"}, {"id": 232, "start": 2296.24, "end": 2311.24, "text": "Talente heranzüchten. Gehen wir mal zu Anne. Ich geh mal, ich hoffe mal, eine Quest gibt's"}, {"id": 233, "start": 2311.24, "end": 2319.84, "text": "hier oben, Daily Quests. Chimpanzee hat zum Beispiel Hitbox Hard supported. Ich gehe"}, {"id": 234, "start": 2319.84, "end": 2323.76, "text": "davon aus, der hauptsächliche Grund wird gewesen sein, weil Hitbox Hard ihn supportet"}, {"id": 235, "start": 2323.76, "end": 2331.08, "text": "hat. Weil ansonsten, ansonsten gibt es ja, also wenn man da keine Anreize bekommt von"}, {"id": 236, "start": 2331.08, "end": 2336.76, "text": "der jeweiligen Plattform, gibt es ja überhaupt keinen Anlass, auf einer Plattform zu streamen,"}, {"id": 237, "start": 2336.76, "end": 2342.92, "text": "wo du prinzipiell weniger Leute erreicht. Das ist ja mal absolut unsinnig, also aus"}, {"id": 238, "start": 2342.92, "end": 2348.32, "text": "Content-Creatorsicht. Es ist absolut unsicht, unsinnig, total widersinnig, eine Plattform"}, {"id": 239, "start": 2348.32, "end": 2356.08, "text": "zu wählen, zu supporten, wo es weniger Viewer gibt. Das ist total beknackt. So, das heißt,"}, {"id": 240, "start": 2356.08, "end": 2360.2, "text": "wenn man das macht, kann das nur daran liegen, dass man eben gute Konditionen mit dem Laden"}, {"id": 241, "start": 2360.2, "end": 2365.04, "text": "hat. Oder einem eben, wie man das bei manchen CSGO-Wettseiten gehört hat, an der Laden"}, {"id": 242, "start": 2365.04, "end": 2374.68, "text": "gehört. Äh, wie komme ich denn da jetzt überhaupt drauf? Ich stelle es mir da jetzt"}, {"id": 243, "start": 2374.68, "end": 2379.64, "text": "irgendwie rauf, das passt schon. Easy, easy life. Ich komme da bestimmt irgendwie rauf."}, {"id": 244, "start": 2379.64, "end": 2385.68, "text": "Hier, so, der da mal hoch. Ich bin Wizard, habe Teleport, da ist überhaupt kein Ding."}, {"id": 245, "start": 2385.68, "end": 2391.32, "text": "Ach nee, hier neben geht es ja hoch, sieht man ja. So, das heißt, wenn man mit so einen"}, {"id": 246, "start": 2391.32, "end": 2396.44, "text": "Laden dann gute Konditionen hat, dann klar, dass man das da macht. Aber ich glaube, es"}, {"id": 247, "start": 2396.44, "end": 2401.28, "text": "ist nicht der richtige Ansatz, sich Talente von anderen schon bestehenden Seiten abzuwärmen."}, {"id": 248, "start": 2401.28, "end": 2407.84, "text": "Ich glaube für Amazon wäre der bessere Ansatz, quasi selbst Talente zu erzeugen bei ihnen,"}, {"id": 249, "start": 2407.84, "end": 2412.16, "text": "die bekannt werden. Weil es ist immer schwierig, es ist wirklich schwierig. Mal angenommen,"}, {"id": 250, "start": 2412.16, "end": 2417.12, "text": "du hast jetzt, ich sehe es ja im Endeffekt jetzt hier auf Twitch, wobei ich gleich sagen"}, {"id": 251, "start": 2417.12, "end": 2422.92, "text": "muss, ich finde das eigentlich gut. Wie komme ich denn hier hoch hier? Ich sehe es ja hier"}, {"id": 252, "start": 2422.92, "end": 2429.08, "text": "auf Twitch. Wenn man jetzt eine Fanbase hat, auf einer Seite, wie YouTube, da kannst du"}, {"id": 253, "start": 2429.08, "end": 2434.12, "text": "noch so oft was ankündigen oder erwähnen. Es gibt viele Leute, die folgen einfach YouTube,"}, {"id": 254, "start": 2434.12, "end": 2439.84, "text": "die folgen dem YouTube-Feed, wer was macht und gucken sich das an. Allerdings, wenn"}, {"id": 255, "start": 2439.84, "end": 2443.0, "text": "du dann in einem Video irgendwie sagst, ja, könnte man bei Twitch vorbeigucken oder so,"}, {"id": 256, "start": 2443.0, "end": 2448.92, "text": "da denken sie sich, ach so, eigentlich interessiert es mich nicht. Also quasi so komplette Fanbases"}, {"id": 257, "start": 2448.92, "end": 2452.92, "text": "zu transferieren von einer zu anderen Plattformen, das geht, also komplett, das geht eigentlich"}, {"id": 258, "start": 2452.92, "end": 2463.92, "text": "gar nicht. Daily, jawoll. Easy Daily. Defeat Catreys, 600 Stück. Okay, dann machen wir"}, {"id": 259, "start": 2463.92, "end": 2471.8, "text": "jetzt 600 Catreys und danach machen wir Overwatch Viewer Games. Weil Overwatch Viewer Games"}, {"id": 260, "start": 2471.8, "end": 2478.48, "text": "direkt vor Black Desert Mob Riot kommt. 600 Catreys dauert aber schon ein paar Minütchen"}, {"id": 261, "start": 2478.48, "end": 2485.52, "text": "noch. So, deswegen denke ich, also ich finde es gut, dass Amazon sowas wagen will und"}, {"id": 262, "start": 2485.52, "end": 2491.28, "text": "ich glaube Amazon ist der einzige Laden, der YouTube irgendwie Konkurrenz machen könnte"}, {"id": 263, "start": 2491.28, "end": 2497.8, "text": "und ich glaube, dass sowohl für die Zuschauer als auch für die Content Creator es nicht"}, {"id": 264, "start": 2497.8, "end": 2502.08, "text": "schlecht ist, wenn es mehrere Plattformen gibt. Ich glaube, also ich kenne keinen, ich"}, {"id": 265, "start": 2502.08, "end": 2506.84, "text": "will nicht sagen, dass es das nicht gibt, ich kenne eigentlich keinen Content Creator,"}, {"id": 266, "start": 2506.84, "end": 2511.04, "text": "der YouTube an sich so vom Handling her und so, also sowohl vom Handling her von der Seite"}, {"id": 267, "start": 2511.04, "end": 2520.8, "text": "als auch, wie das so, wie das für die Leute selbst ist, so wirklich geil findet. Du kannst"}, {"id": 268, "start": 2520.8, "end": 2525.24, "text": "mit YouTube nicht reden, vielleicht außer du bist PewDiePie, aber erinnert ihr euch"}, {"id": 269, "start": 2525.24, "end": 2534.16, "text": "noch daran als, wie hieß er, Ray William Johnson, als der Problem mit YouTube hatte"}, {"id": 270, "start": 2534.16, "end": 2537.68, "text": "und sich auch darüber aufgeregt hat, dass er nicht reden kann mit YouTube und es total"}, {"id": 271, "start": 2537.68, "end": 2541.48, "text": "schwierig ist, da zu kommunizieren und sowas und ich will auch sagen, der war zum damaligen"}, {"id": 272, "start": 2541.48, "end": 2545.8, "text": "Zeitpunkt der größte YouTuber, wenn der nicht mit denen in Kontakt kommen kann. Ja,"}, {"id": 273, "start": 2545.8, "end": 2552.52, "text": "hallo. So, also das kenne ich eigentlich keinen, der das geil findet. Und da könnte Amazon"}, {"id": 274, "start": 2552.52, "end": 2557.24, "text": "natürlich punkten und für die Zuschauer ist es natürlich auch nicht schlecht, wenn es"}, {"id": 275, "start": 2557.24, "end": 2564.68, "text": "ein bisschen Konkurrenz gibt, weil es gibt so viel gutes Zeug, was im Prank und was ist"}, {"id": 276, "start": 2564.68, "end": 2569.32, "text": "denn eigentlich gerade so alles im Trend, keine Ahnung, Prank und YouTube Shit Deutschland"}, {"id": 277, "start": 2569.32, "end": 2578.12, "text": "total untergeht. Wenn das auf einer anderen Plattform dann besser zur Geltung kommen würde,"}, {"id": 278, "start": 2578.12, "end": 2584.0, "text": "finden sich vielleicht auch ganz andere Leute, die dort gucken. Also ich sehe da schon Potenzial"}, {"id": 279, "start": 2584.0, "end": 2589.0, "text": "drin. Wie gesagt, ich denke, Amazon ist der einzige Laden, dem ich es zutrauen würde,"}, {"id": 280, "start": 2589.0, "end": 2593.2, "text": "sowas auf die Beine zu stellen, weil man sieht das ja an WitMe, selbst WitMe hatte ein bisschen"}, {"id": 281, "start": 2593.2, "end": 2600.8, "text": "Hype, aber du machst, du ziehst nicht einfach einen YouTube-Konkurrent auf, ohne Milliarden"}, {"id": 282, "start": 2600.8, "end": 2608.4, "text": "im Hintergrund zu haben. Für Technik, für Bewerben, für alles und Amazon hat halt Kohle."}, {"id": 283, "start": 2608.4, "end": 2611.12, "text": "WitMe hatte keine Kohle, außerdem fand ich die WitMe-Seite auch nicht sonderlich tolle."}, {"id": 284, "start": 2611.12, "end": 2621.52, "text": "Und es reicht ja auch nicht einfach, YouTube zu kopieren. Es bringt ja nichts, wenn man"}, {"id": 285, "start": 2621.52, "end": 2629.92, "text": "YouTube kopiert und im Endeffekt ein schlechteres YouTube macht, nochmal. Und dann auch ohne"}, {"id": 286, "start": 2629.92, "end": 2643.44, "text": "Geld so. Ja, also so sehe ich das mit Amazon und ihrer Videoplattform. Ich weiß nicht,"}, {"id": 287, "start": 2643.44, "end": 2655.48, "text": "gibt es dazu schon nähere Details? Ich bash jetzt den Boss erstmal. Gibt es dazu schon"}, {"id": 288, "start": 2655.48, "end": 2665.72, "text": "nähere Details, was sie eigentlich machen wollen? Ja, Amazon könnte das, klar könnte"}, {"id": 289, "start": 2665.72, "end": 2670.96, "text": "Amazon dadurch punkten, X-Silent LP, dass sie eben die Leute bezahlen, bei ihnen Content"}, {"id": 290, "start": 2670.96, "end": 2676.32, "text": "zu machen, aber ich finde, man hat das gesehen bei Azubu und den anderen Dingern, dass es"}, {"id": 291, "start": 2676.32, "end": 2684.84, "text": "nicht unbedingt das Beste ist, quasi bestehende Content-Creators zu holen, sondern man sollte"}, {"id": 292, "start": 2684.84, "end": 2693.72, "text": "bessere, neue Aushängeschilder für die eigenen Plattformen sich selbst erschaffen. Das Einzige,"}, {"id": 293, "start": 2693.72, "end": 2700.4, "text": "wie das funktionieren kann, quasi, nennen wir es mal YouTube-Konkurrent, wenn wir uns"}, {"id": 294, "start": 2700.4, "end": 2705.6, "text": "mal Twitch nehmen, heranzutüchten, ohne dass man Milliarden im Hintergrund hat wie Amazon."}, {"id": 295, "start": 2705.6, "end": 2709.12, "text": "Wir dürfen nicht vergessen, dass Twitch mittlerweile auch zu Amazon gehört, das heißt Amazon ja"}, {"id": 296, "start": 2709.12, "end": 2713.8, "text": "in dem Bereich schon Erfahrung gesammelt hat mittlerweile und jetzt auch kein Unbekannter"}, {"id": 297, "start": 2713.8, "end": 2720.52, "text": "mehr ist, geht, wenn man sowas macht wie Gaming, also quasi auf eine Sache zugeschnitten,"}, {"id": 298, "start": 2720.52, "end": 2725.32, "text": "wie Twitch und das halt eben ziemlich gut macht, quasi kaum ordentlich Konkurrenz hat"}, {"id": 299, "start": 2725.32, "end": 2732.4, "text": "und YouTube jahrelang diesen Zweig links liegen lässt. Das Game Streaming bzw. Stream an sich"}, {"id": 300, "start": 2732.4, "end": 2737.48, "text": "war ja jahrelang bei YouTube überhaupt kein Thema und jetzt YouTube Live finde ich im"}, {"id": 301, "start": 2737.48, "end": 2743.88, "text": "Vergleich zu Twitch kacke, um ehrlich zu sein. Und das sage ich als hauptsächlich"}, {"id": 302, "start": 2743.88, "end": 2748.08, "text": "der YouTube Creator, der auf YouTube jetzt wahrscheinlich anstatt mit 89 Zuschauern"}, {"id": 303, "start": 2748.08, "end": 2752.84, "text": "wahrscheinlich mit 890 Zuschauern rumklebsen würde, wenn ich auf YouTube streamen würde."}, {"id": 304, "start": 2752.84, "end": 2757.6, "text": "Aber ich finde Twitch ist einfach die eindeutig bessere Plattform, wenn es um Game Streaming"}, {"id": 305, "start": 2757.6, "end": 2769.64, "text": "geht. Das einzige, was Google hat gegenüber Twitch ist der meiner Meinung nach bessere"}, {"id": 306, "start": 2769.64, "end": 2774.72, "text": "Player und dass man halt vor und zurück kann, aber das könnten die mit Twitch, das könnten"}, {"id": 307, "start": 2774.72, "end": 2779.32, "text": "die bei Twitch garantiert auch so machen, dass du innerhalb von einem Video, also innerhalb"}, {"id": 308, "start": 2779.32, "end": 2782.72, "text": "von einem Livestream vor und zurück spulen könntest. Ich gehe davon aus, dass macht"}, {"id": 309, "start": 2782.72, "end": 2785.84, "text": "Twitch absichtlich nicht, weil du kannst ja immer noch in die Watts gehen und gucken,"}, {"id": 310, "start": 2785.84, "end": 2790.56, "text": "was macht Twitch absichtlich nicht, dass es so einen Charakter von Live hat. Das ist ja"}, {"id": 311, "start": 2790.56, "end": 2795.28, "text": "auch eine Sache, wovon Twitch letztendlich lebt, von diesem Live-Gefühl, von dem Chat,"}, {"id": 312, "start": 2795.28, "end": 2800.76, "text": "der dabei ist, dass du eben nicht sagst, ich gucke anonym mir jetzt diesen Stream an oder"}, {"id": 313, "start": 2800.76, "end": 2805.44, "text": "diesen Content an, sondern ich gucke mir den eben mit vielen Gleichgesinnten, gucke ich"}, {"id": 314, "start": 2805.44, "end": 2810.24, "text": "mir jetzt live diesen Content an. Man sieht auch schon, wie halbherzig das auf YouTube"}, {"id": 315, "start": 2810.24, "end": 2816.2, "text": "umgesetzt ist. Es gibt einen Live-Chat, allerdings wenn ich zurück spule in YouTube und dann"}, {"id": 316, "start": 2816.2, "end": 2822.0, "text": "im Chat was schreibe, quasi auf ein Ereignis, dann wird es im Live-Chat angezeigt, was natürlich"}, {"id": 317, "start": 2822.0, "end": 2826.64, "text": "übelst verwirrend ist für einen, der eine halbe Stunde hinten dran ist, auf YouTube"}, {"id": 318, "start": 2826.64, "end": 2832.16, "text": "im Player und dann im Chat was schreiben Leute sehen, ist die quasi live zuschauen. Das"}, {"id": 319, "start": 2832.16, "end": 2836.44, "text": "ist wieder so eines der 100 Sachen, die an YouTube nicht richtig durchdacht sind."}, {"id": 320, "start": 2836.44, "end": 2847.12, "text": "Wenn ihr wollt, kann ich mich da ein bisschen länger zu auslassen, weil da gibt es echt"}, {"id": 321, "start": 2847.12, "end": 2855.68, "text": "viel dazu zu sagen. Ich habe mitbekommen, dass Dezember der beste YouTube-Monat ist."}, {"id": 322, "start": 2855.68, "end": 2859.6, "text": "Dieser Inscope21 und seine Kollegen haben diesen Monat alle täglich in einem Video gemacht"}, {"id": 323, "start": 2859.6, "end": 2864.76, "text": "und gegenseitig verlinkt. Denkst du das war pure Gewinnmaximierung? Ich weiß beim Nico"}, {"id": 324, "start": 2864.76, "end": 2869.6, "text": "nicht, inwieweit er sich um die Sachen noch selbst kümmert oder da irgendwelche Management"}, {"id": 325, "start": 2869.6, "end": 2879.08, "text": "und Agenturen und Sachen dahinter sind, keine Ahnung. Es spielt bestimmt zum Teil mit rein"}, {"id": 326, "start": 2879.08, "end": 2884.0, "text": "und ich glaube auch, dass der Nico mittlerweile nicht der gleiche Nico ist wie noch vor ein"}, {"id": 327, "start": 2884.0, "end": 2893.44, "text": "paar Jahren. Aber für mich ist der Nico der originale deutsche Lifestyle-Channel. Alle"}, {"id": 328, "start": 2893.44, "end": 2900.96, "text": "anderen sind quasi Inscope-Fakes. Und der Nico an sich, da kann man eigentlich überhaupt"}, {"id": 329, "start": 2900.96, "end": 2907.92, "text": "nichts Negatives zu sagen. Zumindest den Nico, den ich kenne von vor ein paar Jahren noch."}, {"id": 330, "start": 2907.92, "end": 2921.96, "text": "Über den kannst du echt nichts Negatives sagen. Und selbst wenn es Gewinnmaximierung ist,"}, {"id": 331, "start": 2921.96, "end": 2927.48, "text": "was sehr gut sein kann, solange der Konten den Zuschauern gefällt, ist es ja im Prinzip"}, {"id": 332, "start": 2927.48, "end": 2932.4, "text": "für beide gut. Kriegen die Leute mehr von ihrem Konten, der ihnen gefällt und man kriegt"}, {"id": 333, "start": 2932.4, "end": 2939.68, "text": "mal Kohle. Der Nico guckt hin und wieder noch meine, wie er ich weiß, hat er mir mal geschrieben."}, {"id": 334, "start": 2939.68, "end": 2947.44, "text": "Find ich übrigens geil. Es gibt ja ein paar Leute, die kenn ich noch aus den Zeiten,"}, {"id": 335, "start": 2947.44, "end": 2950.76, "text": "wo sie nicht so groß waren. Und beim Nico kann ich mich halt noch dran erinnern, dass"}, {"id": 336, "start": 2950.76, "end": 2957.04, "text": "er schon immer Videos in der Richtung machen wollte. Er wusste das bloß nicht. Er wollte"}, {"id": 337, "start": 2957.04, "end": 2964.92, "text": "noch nie diese Standard-Call of Duty-Gameplay-Geschichten machen. Er wollte schon immer ein bisschen"}, {"id": 338, "start": 2964.92, "end": 2971.96, "text": "abgedrehte Dinge machen. Also was ist abgedrehte Dinge? Wo er sich selbst ein bisschen inszenieren"}, {"id": 339, "start": 2971.96, "end": 2978.24, "text": "kann und ein bisschen Blödsinn labern. Das kann er ja auch gut. Ein bisschen lustiges"}, {"id": 340, "start": 2978.24, "end": 2984.92, "text": "Zeug machen. Und der war schon ziemlich unglücklich zu der Zeit, wo er gedacht hat, es kommt nur"}, {"id": 341, "start": 2984.92, "end": 2990.12, "text": "gut an, wenn man seriöse Call of Duty-Videos macht. Das hat ihm nicht gefallen. Und deswegen"}, {"id": 342, "start": 2990.12, "end": 2997.08, "text": "ist es für mich auch so der originale Lifestyle-Channel überhaupt. Der macht nämlich wirklich das,"}, {"id": 343, "start": 2997.08, "end": 3001.12, "text": "weil er das gut findet und weil ihm das gefällt. Der macht nicht jetzt irgendwie, ich muss"}, {"id": 344, "start": 3001.12, "end": 3005.08, "text": "jetzt krassen Fitness und krassen Lifestyle und sonst was machen. Der wollte das im Prinzip"}, {"id": 345, "start": 3005.08, "end": 3009.28, "text": "schon immer machen. Er wusste bloß nicht genau, was es ist. Bis er es dann irgendwann"}, {"id": 346, "start": 3009.28, "end": 3017.36, "text": "rausgekriegt hat. Der Nico ist ja kein, ich mache Gameplay-Videos und werde jetzt zum"}, {"id": 347, "start": 3017.36, "end": 3021.76, "text": "Fitness-Channel und zum Lifestyle-Channel einfach nur, weil ich weiß, man kann damit"}, {"id": 348, "start": 3021.76, "end": 3026.2, "text": "mehr Kohle machen oder bessere Sachen verdienen. Nein, der hat das gemacht, weil er das andere"}, {"id": 349, "start": 3026.2, "end": 3030.08, "text": "eigentlich ursprünglich gar nicht mal so wirklich machen wollte. Schon immer was anderes."}, {"id": 350, "start": 3030.08, "end": 3041.24, "text": "Zwingt zum Nico kann ich echt nichts negatives sagen. Zum Danny übrigens auch nicht, auch"}, {"id": 351, "start": 3041.24, "end": 3050.72, "text": "wenn den Danny viele nicht mögen. Ich meine, der Content vom Danny ist jetzt nicht unbedingt"}, {"id": 352, "start": 3050.72, "end": 3058.64, "text": "das, was ich mir angucke, um neue Synapsen im Gehirn zu bilden. Oder neue Verknüpfungen"}, {"id": 353, "start": 3058.64, "end": 3067.52, "text": "im Gehirn zu bilden. Aber da sagt er über ihn als Person X aus und es gefällt vielen"}, {"id": 354, "start": 3067.52, "end": 3079.04, "text": "Leuten. Das ist einfach auch Fakt. Oh, Eax, das ist nice. Das ist sehr nice. Easy Drop."}, {"id": 355, "start": 3079.04, "end": 3084.88, "text": "Ja Eax, wie sieht es aus? Bist du gleich dabei? Viewer Games? Overwatch? Machen wir nämlich"}, {"id": 356, "start": 3084.88, "end": 3098.52, "text": "ein paar Viewer Games und recken quasi den Blattchat. Wobei die Hälfte wahrscheinlich"}, {"id": 357, "start": 3098.52, "end": 3107.64, "text": "besser ist als ich. Und je nachdem, wie fit ich bin, machen wir dann noch Placements"}, {"id": 358, "start": 3107.64, "end": 3121.56, "text": "um 0 Uhr. Was haltet ihr von dem Plan? Aber jetzt erstmal hier noch ein bisschen BDO-Quiet."}, {"id": 359, "start": 3121.56, "end": 3131.04, "text": "Ich hab nicht gesagt Platt-Chat. Ich hab gesagt Platt-Chat. Das sagt man bei Overwatch so."}, {"id": 360, "start": 3131.04, "end": 3141.28, "text": "Which chat in Overwatch ist automatisch Platt-Chat. Du weißt ja auch Don't write in chat if you"}, {"id": 361, "start": 3141.28, "end": 3163.76, "text": "are not high elo. 2000 plus. Das ist halt Overwatch-Meme gelaber. Catree Bash. Ähm,"}, {"id": 362, "start": 3163.76, "end": 3177.28, "text": "ja, um nochmal auf die Sache zurück zu kommen, dass Dezember der erfolgreichste Monat ist."}, {"id": 363, "start": 3177.28, "end": 3182.6, "text": "Also Dezember ist definitiv der Monat, wo man am meisten Kohle machen kann. Das liegt"}, {"id": 364, "start": 3182.6, "end": 3191.64, "text": "an mehreren Faktoren. Zum einen, weil die Standard-Essence-Einnahmen im Dezember am"}, {"id": 365, "start": 3191.64, "end": 3198.0, "text": "höchsten sind. Und warum sind die Standard-Essence-Einnahmen im Dezember am höchsten? Weil halt alle Werbung"}, {"id": 366, "start": 3198.0, "end": 3203.08, "text": "machen wollen im Dezember für ihren Scheiß. Und dementsprechend, wenn alle Werbung machen"}, {"id": 367, "start": 3203.08, "end": 3209.36, "text": "wollen zur gleichen Zeit, ist es teurer. So. Und das gleiche gilt natürlich auch für"}, {"id": 368, "start": 3209.36, "end": 3213.96, "text": "alle Affiliate-Geschichten und Amazon. Bei Amazon kriegt man zwar nicht mehr, allerdings"}, {"id": 369, "start": 3213.96, "end": 3221.92, "text": "kaufen die Leute natürlich im Dezember mehr. Weil Weihnachten ist. Das ist im Prinzip"}, {"id": 370, "start": 3221.92, "end": 3227.56, "text": "eigentlich relativ logisch. Ähm, also ich hab kurz vor Weihnachten, also irgendwie"}, {"id": 371, "start": 3227.56, "end": 3233.28, "text": "21 oder so mal geguckt. Ich kann das jetzt ja mal revealen. Und wenn ich jetzt, ich kann"}, {"id": 372, "start": 3233.28, "end": 3237.48, "text": "es euch nicht mehr genauer auf Offensiv sagen. Allerdings, und ich hab im Dezember auch"}, {"id": 373, "start": 3237.48, "end": 3243.12, "text": "viele Videos gemacht, ähm, waren die Einnahmen bei Amazon rein über Adlink. Irgendwo um"}, {"id": 374, "start": 3243.12, "end": 3248.88, "text": "wie 600 Euro. So. In dem Dreh. Ich müsste mal gucken, wie es jetzt ist. Wahrscheinlich"}, {"id": 375, "start": 3248.88, "end": 3253.88, "text": "dadurch, dass noch nicht alle Sachen von Weihnachten, ähm, durch waren, wahrscheinlich sogar noch"}, {"id": 376, "start": 3253.88, "end": 3263.12, "text": "ein bisschen höher. Und das einfach nur durch Amazon, äh, Raffling-Geschichten. Die keinem"}, {"id": 377, "start": 3263.12, "end": 3273.68, "text": "was kosten, außer Amazon. Also man sieht schon, dass Dezember da ein krasser Monat ist"}, {"id": 378, "start": 3273.68, "end": 3279.4, "text": "in der Richtung. Und das, obwohl ich das ganze Jahr über kaum was gemacht hab. Also ich"}, {"id": 379, "start": 3279.4, "end": 3284.08, "text": "kann mich noch an, äh, so irgendwie, weil man so 2013, 14 oder so erinnern, da war das"}, {"id": 380, "start": 3284.08, "end": 3311.64, "text": "im Dezember noch ne ganze Ecke mehr. Dezember ist der beste Monat. Oh man, ich, ich Kreisel-Kreinde"}, {"id": 381, "start": 3311.64, "end": 3319.12, "text": "war falsch. Hier muss ich hoch. Nee, ich hätte eigentlich da drüben hoch gemusst."}, {"id": 382, "start": 3319.12, "end": 3328.52, "text": "Also nicht mal die Rotation kann er richtig fahren hier. Hab ich noch irgendwas übersehen?"}, {"id": 383, "start": 3328.52, "end": 3338.08, "text": "Im Chat jetzt, die letzte Zeit? Falls ich irgendwas überlesen hab, ähm, wenn ihr noch"}, {"id": 384, "start": 3338.08, "end": 3349.0, "text": "was wissen wollt, schreibt es einfach nochmal im Chat. Ich guck jetzt nochmal kurz. Mops,"}, {"id": 385, "start": 3349.0, "end": 3362.52, "text": "perfesst euch mal. Denkst du nicht, es wäre besser Twitch einfach zu erweitern mit Amazon,"}, {"id": 386, "start": 3362.52, "end": 3374.92, "text": "äh, FireTube oder wie auch immer es heißt. Ähm, hm. Ich glaube nicht, dass es so sinnvoll"}, {"id": 387, "start": 3374.92, "end": 3380.04, "text": "ist an Twitch jetzt noch mehr anzubauen als diese Game-Streaming-Geschichte, weil Twitch"}, {"id": 388, "start": 3380.04, "end": 3386.8, "text": "ist schon sehr eigen. Also Twitch, Twitch, allein schon der Twitch-Chat, ja, die Emo's"}, {"id": 389, "start": 3386.8, "end": 3395.92, "text": "und das Rumge-Meme und so, ähm, ist, ist sehr eigen. Und ich glaube, das ist für normale"}, {"id": 390, "start": 3395.92, "end": 3401.72, "text": "Viewer zu abgedreht, dass sie das lustig finden. Und das heißt entweder haben normale Viewer"}, {"id": 391, "start": 3401.72, "end": 3410.88, "text": "keinen Bock auf Twitch, sich das halt Sachen anzugucken, oder Twitch wird quasi verändert"}, {"id": 392, "start": 3410.88, "end": 3415.88, "text": "dafür, dass es den anderen Zuschauern besser gefällt. Und das ist beides was ich eigentlich"}, {"id": 393, "start": 3415.88, "end": 3421.76, "text": "kacke finde. Twitch soll so bleiben. Übrigens, ne, noch ein Grund warum ich denke, dass Amazon"}, {"id": 394, "start": 3421.76, "end": 3428.0, "text": "da der beste ist in YouTube-Konkurrenz zu machen. Viele Services, nachdem sie übernommen wurden"}, {"id": 395, "start": 3428.0, "end": 3435.24, "text": "von größeren Läden, haben sich meiner Ansicht nach zum negativen entwickelt. Und bis auf"}, {"id": 396, "start": 3435.24, "end": 3439.4, "text": "ein paar Sachen kann man bei Twitch eigentlich sagen, ist es besser geworden, seit Amazon"}, {"id": 397, "start": 3439.4, "end": 3448.52, "text": "Twitch hat. Ich mein, allein schon, dass es jetzt eine Chat-Aufzeichnung in VODs gibt."}, {"id": 398, "start": 3448.52, "end": 3457.56, "text": "Und solche Dinger. Oh, nice, da können wir snipen. Das snipen wir gleich noch. 22.18."}, {"id": 399, "start": 3457.56, "end": 3466.28, "text": "Ey, die sind, es, wisst ihr was, wir machen jetzt den easiest done the snipe of our life,"}, {"id": 400, "start": 3466.28, "end": 3472.44, "text": "machen wir jetzt. Alle, alle real life noobs, ja, sind auf irgendwie Silvester-Partys und"}, {"id": 401, "start": 3472.44, "end": 3477.0, "text": "sonst was und fühlen sich immer so richtig geil und überlegen, weil es ja also die krassen"}, {"id": 402, "start": 3477.0, "end": 3483.12, "text": "Checker sind. Und müssen wir sie natürlich auch bei jeder Gelegenheit erzählen. Und"}, {"id": 403, "start": 3483.12, "end": 3504.4, "text": "sonst snipen wir ihnen jetzt geil die Dande weg hier. Die real life noobs, naja. Umso älter"}, {"id": 404, "start": 3504.4, "end": 3515.12, "text": "man wird, habe ich das Gefühl, umso weniger Bock hat man auf real life Zeug. Wobei ich"}, {"id": 405, "start": 3515.12, "end": 3520.12, "text": "große, wobei ich Ansammlungen oder größere Ansammlungen von vielen Leuten, vor allem"}, {"id": 406, "start": 3520.12, "end": 3527.0, "text": "von vielen Leuten, die ich nicht kenne, noch nie gerne, noch nie gemacht hab. Weil da sind"}, {"id": 407, "start": 3527.0, "end": 3533.08, "text": "halt meistens immer so die übelsten Spasten dabei, ey. Leute, die man kennt, weiß vor"}, {"id": 408, "start": 3533.08, "end": 3537.56, "text": "allem, was Sache ist, ja. Vor allem, wenn es dann irgendwie so eine Veranstaltung ist,"}, {"id": 409, "start": 3537.56, "end": 3541.48, "text": "wo jeder dann irgendwelche Bekannten mitbringt und so. Und dann hast du dann Leute, die kennst"}, {"id": 410, "start": 3541.48, "end": 3546.32, "text": "nicht und sitzt dann den ganzen Abend mit denen da rum und musst dann irgendwie so voll"}, {"id": 411, "start": 3546.32, "end": 3550.8, "text": "auf funny machen oder die versuchen auf lustig und sonst was zu machen und die meisten Leute"}, {"id": 412, "start": 3550.8, "end": 3556.52, "text": "sind dann übelst Spaß. Oder ich bin einer und komm einfach mit den meisten Leuten nicht"}, {"id": 413, "start": 3556.52, "end": 3565.72, "text": "da. Das kann natürlich auch sein, ja. Katzen sind schon ganz nervös, also meine Katze hat"}, {"id": 414, "start": 3565.72, "end": 3574.56, "text": "es überhaupt nicht gejuckt. Meine Katze hat, also Katze, Dings hier unten, die du unten"}, {"id": 415, "start": 3574.56, "end": 3579.12, "text": "links siehst, die hat das überhaupt nicht gejuckt, Silvester. Die hat in der Ecke gelegen,"}, {"id": 416, "start": 3579.12, "end": 3583.92, "text": "hat gepennt und hat sogar sich auf, das war geil, ich glaube es gibt keine Katze, die"}, {"id": 417, "start": 3583.92, "end": 3587.32, "text": "sonst macht, die wollte sogar aus dem Fenster gucken. Ich hab die dann auf den Arm genommen"}, {"id": 418, "start": 3587.32, "end": 3590.88, "text": "und da haben wir uns ans Fenster gestellt, runtergeguckt. Manchmal hat sie, manchmal"}, {"id": 419, "start": 3590.88, "end": 3595.16, "text": "wollte sie dann weg, als quasi direkt vor dem Fenster irgendwie was in die Luft geflogen"}, {"id": 420, "start": 3595.16, "end": 3599.6, "text": "ist so. Aber ansonsten, da fand ich das übelst geil, die hat dann voll interessiert rausgeguckt,"}, {"id": 421, "start": 3599.6, "end": 3609.12, "text": "die hat so, was ist das hier oben, die Uhrzeit, boah, geil, was ist hier los. Auf jeden Fall"}, {"id": 422, "start": 3609.12, "end": 3615.76, "text": "müssen wir umloggen, 15, 15 müssen wir umlegen. Voller Stereotyp Gamer, ich hab kein Problem"}, {"id": 423, "start": 3615.76, "end": 3626.08, "text": "mit. Ohne aber, das ist ja auch immer eine Sache, wo ich denke, ich glaube es ist andersrum,"}, {"id": 424, "start": 3626.08, "end": 3632.56, "text": "ich glaube es ist andersrum. Generell glaube ich, ist es bei vielen Sachen, wo man so sagt,"}, {"id": 425, "start": 3632.56, "end": 3640.08, "text": "oh voll Stereotyp das oder voll der sowieso, ist es eigentlich andersrum. Leute sind halt"}, {"id": 426, "start": 3640.08, "end": 3647.8, "text": "so wie Leute sind und suchen sich deswegen Sachen raus, was am besten zu ihnen passt."}, {"id": 427, "start": 3647.8, "end": 3653.2, "text": "Also ich glaube es ist nicht so, dass man sagen kann, oh scheiß Gamer, alle irgendwie"}, {"id": 428, "start": 3653.2, "end": 3656.96, "text": "sozial kriegen sie nichts auf die Reihe, sondern ich glaube Leute, die nicht sonderlich sozial"}, {"id": 429, "start": 3656.96, "end": 3670.48, "text": "sind, spielen gerne Games who never post. Aber den ganzen krassen Real Life Silvester"}, {"id": 430, "start": 3670.48, "end": 3681.64, "text": "Stelzer, den schnappen wir jetzt die Dande weg. Und dann kaufen wir uns Feuerwerk und"}, {"id": 431, "start": 3681.64, "end": 3698.76, "text": "schreiben Get Shrecked an den Himmel. Übrigens, laut YouTube Kommentaren bin ich mittlerweile"}, {"id": 432, "start": 3698.76, "end": 3707.28, "text": "voll der Nazi, muss ich mir heute sagen lassen. Vor allem ich, ja. Ich war ja schon alles"}, {"id": 433, "start": 3707.28, "end": 3717.24, "text": "ja. Ich hatte mal so paar rechte Spasten da, die mich übelst beleidigt haben, weil ich"}, {"id": 434, "start": 3717.24, "end": 3722.04, "text": "Jude bin oder so, haben sie erzählt. Also ich weiß nicht, wie sie auf die Idee gekommen"}, {"id": 435, "start": 3722.04, "end": 3726.28, "text": "sind, aber sie waren der Meinung, ich bin Jude und müssen mich jetzt übelst beleidigen."}, {"id": 436, "start": 3726.28, "end": 3730.0, "text": "Erinnert sich vielleicht der Fabian noch dran? Fabian, erinnerst du dich da noch dran? An"}, {"id": 437, "start": 3730.0, "end": 3737.6, "text": "Max Flame Account, kennst du den Scheiß noch? Falls du da bist, kannst du dich da noch dran"}, {"id": 438, "start": 3737.6, "end": 3745.76, "text": "erinnern? Und das Schlimme war, da gab es erst einen und dann kam immer mehr. Die haben"}, {"id": 439, "start": 3745.76, "end": 3749.52, "text": "dann in die Kommentare geschrieben, ich habe gehört, Max ist Jude, deswegen habe ich mich"}, {"id": 440, "start": 3749.52, "end": 3754.16, "text": "jetzt hier angemeldet, um ihn irgendwie zu beleidigen. So richtig, richtig hängen geblieben."}, {"id": 441, "start": 3754.16, "end": 3760.44, "text": "So und zumindest jetzt ist wieder was ganz besonderes, jetzt bin ich ganz schlimm, Nazi"}, {"id": 442, "start": 3760.44, "end": 3766.76, "text": "und rechts. Warum? Weil ich den Begriff Social Justice Warrior benutzt habe. Und dieser Begriff,"}, {"id": 443, "start": 3766.76, "end": 3775.56, "text": "der ist ja schon sowas von Nazi und instant rechts, instant rechtsextrem. Also manche"}, {"id": 444, "start": 3775.56, "end": 3779.08, "text": "Leute haben echt nichts besseres zu tun, als sich den ganzen Tag über irgendwas zu empören."}, {"id": 445, "start": 3779.08, "end": 3790.96, "text": "Ich verstehe die Leute nicht, die haben alle kein Leben, die haben alle echt nichts besseres"}, {"id": 446, "start": 3790.96, "end": 3802.76, "text": "zu tun einfach irgendwie. Und das witzige ist, wenn man mal in die Wikipedia Seiten"}, {"id": 447, "start": 3802.76, "end": 3811.84, "text": "reinguckt zu eben diesem Begriff, sieht man, dass das in vielen Bereichen mittlerweile"}, {"id": 448, "start": 3811.84, "end": 3818.8, "text": "eigentlich ein recht gebräuchlicher Ausdruck ist, der quasi abwertend verwendet wird über"}, {"id": 449, "start": 3818.8, "end": 3825.52, "text": "Leute, die sich gerne über Themen empören in Richtung multikulturelle Geschichten und"}, {"id": 450, "start": 3825.52, "end": 3830.68, "text": "Feminismus und sowas in der Richtung. Und genau darum ging es ja in dem Video auch, nämlich"}, {"id": 451, "start": 3830.68, "end": 3840.08, "text": "um schwarze Frauen in der Wehrmacht in Call of Duty. Also, naja. Aber so schnell ist man"}, {"id": 452, "start": 3840.08, "end": 3847.6, "text": "laut YouTube Comments schon ein Nazi. Da kann man halt nichts machen. Aber was ich gut finde,"}, {"id": 453, "start": 3847.6, "end": 3853.8, "text": "dass die meisten Leute noch ein bisschen was im Kopf haben und gar nicht so eingehen auf"}, {"id": 454, "start": 3853.8, "end": 3874.4, "text": "so ein Scheiß. Die ganzen Koreaner kommen jetzt hier online, sehe ich gerade. Ich habe"}, {"id": 455, "start": 3874.4, "end": 3881.04, "text": "ja viele koreanische Overwatch-Pros und ein paar koreanische Streamer hier auf Benachrichtigung,"}, {"id": 456, "start": 3881.04, "end": 3887.04, "text": "auf Twitch. Irgendwie kommen die ganzen Koreaner jetzt an, weil die Koreaner ist doch schon"}, {"id": 457, "start": 3887.04, "end": 3892.76, "text": "neuer seit 8 Stunden oder so. 14 Stunden sind die doch, sind die glaube ich vorne dran."}, {"id": 458, "start": 3892.76, "end": 3907.68, "text": "Ach ja, und der allergrößte Witz bei diesem Video war ja noch, dass ich diesen Begriff"}, {"id": 459, "start": 3907.68, "end": 3913.76, "text": "eigentlich gar nicht gebraucht habe. Ich habe das ja nur wiedergegeben, was jemand anderes"}, {"id": 460, "start": 3913.76, "end": 3917.8, "text": "in einem Interview gesagt hat. Das war ja noch der größte Witz da dran, das habe ich"}, {"id": 461, "start": 3917.8, "end": 3921.44, "text": "noch gar nicht erzählt, was die komplette Diskussion darüber schon wieder total überflüssig"}, {"id": 462, "start": 3921.44, "end": 3931.12, "text": "macht. Ne, ne, im Januar sind die Chinesen. Die Koreaner haben glaube ich, oder? Keine"}, {"id": 463, "start": 3931.12, "end": 3937.76, "text": "Chinesen. Ich muss umloggen, ich muss dann das Snipe machen. Mal vor nach Korea oder Japan"}, {"id": 464, "start": 3937.76, "end": 3947.04, "text": "zu reisen, ja würde ich gern. Aber allein habe ich da keinen Bock drauf. Sollte ich"}, {"id": 465, "start": 3947.04, "end": 3953.6, "text": "mal eine Freundin finden, in nächster Zeit wieder, mit der ich es länger aushalte und"}, {"id": 466, "start": 3953.6, "end": 3959.68, "text": "die mit mir, dann würde ich auch gerne mit ihr mal nach Island fahren bzw. nach Korea."}, {"id": 467, "start": 3959.68, "end": 3963.0, "text": "Island und Korea sind beide so zwei Sachen, die ich gerne mal hin würde. Allerdings"}, {"id": 468, "start": 3963.0, "end": 3976.64, "text": "nicht allein, das wird zu doof. Ach ja, und bitte einen, die sich nicht aufregt, wenn"}, {"id": 469, "start": 3976.64, "end": 3991.04, "text": "ich Let's Player in auf Twitter folge. Oh man, es gibt Sachen, das, naja. Und was ist"}, {"id": 470, "start": 3991.04, "end": 4013.76, "text": "mit Japan? Also ehrlich gesagt, lieber Korea. Südkorea und Island. Max und Frisur in Korea,"}, {"id": 471, "start": 4013.76, "end": 4027.96, "text": "ja. Falsche Richtung. Hoffentlich bin ich nicht zu spät. Es wird geschneibt. 360 Marketplace"}, {"id": 472, "start": 4027.96, "end": 4042.88, "text": "Scope. Habt ihr gesehen, was das für eine Dande war? Das war eine ganz normale Un-Enchantete,"}, {"id": 473, "start": 4042.88, "end": 4056.52, "text": "oder? Also die hier war das. Keine Un-Enchantete, oder? Habt ihr das gesehen? Ich habe das vergessen"}, {"id": 474, "start": 4056.52, "end": 4073.44, "text": "oder nicht richtig realisiert. Welche Let's Playerin bist du da gefolgt? Ich weiß das."}, {"id": 475, "start": 4073.44, "end": 4078.2, "text": "Keine Ahnung. Wer war das? Ich glaube Honeyball oder so. Total bescheuert, hat sich aufgeregt."}, {"id": 476, "start": 4078.2, "end": 4083.12, "text": "Ich würde ja der Let's Playerin nur folgen, dass ich ihr heimlich Messages schreiben kann."}, {"id": 477, "start": 4083.12, "end": 4098.12, "text": "Das ist so abgedreht. Das kann ich mir ohne so voll Cringe gar nicht aussprechen. So Fremdscheme"}, {"id": 478, "start": 4098.12, "end": 4113.76, "text": "ist das eigentlich. Bloß dass das nicht Fremdscheme war. Die Velia-Musik ist beste im Hintergrund."}, {"id": 479, "start": 4128.12, "end": 4148.84, "text": "Epische Musik an. Ist ein Spedio so laut genug gewesen? Oder soll Spedio noch ein bisschen"}, {"id": 480, "start": 4148.84, "end": 4156.36, "text": "lauter machen? Hast du außer deiner Katze noch andere Haustiere bzw. möchtest du noch"}, {"id": 481, "start": 4156.36, "end": 4162.04, "text": "welche haben? Ja ich will mir wieder eine Katze holen. Aus dem Tierheim. Ich war schon"}, {"id": 482, "start": 4162.04, "end": 4168.08, "text": "im Tierheim vor einem Monat oder so ungefähr. Und da gibt es ja so viele. Am liebsten würde"}, {"id": 483, "start": 4168.08, "end": 4173.8, "text": "ich alle mitnehmen, aber ich muss mich ja zurückhalten. Außerdem muss ich noch warten"}, {"id": 484, "start": 4173.8, "end": 4182.36, "text": "bis das Hoftor oben zugemacht ist, dass die Katze nicht durch kann. Meine Letze war einfach"}, {"id": 485, "start": 4182.36, "end": 4193.72, "text": "zu alt, die konnte da nicht mehr durch und die hatte auch keinen Bock. Oder aber zwei"}, {"id": 486, "start": 4193.72, "end": 4201.6, "text": "Katzen, wenn sie sich halt schon kennen. Dann würde ich auch zwei nehmen, weil das einfach"}, {"id": 487, "start": 4201.6, "end": 4218.36, "text": "ein bisschen spannender für die Katze ist. Holst du zwei diesmal? Wenn es sich ergibt,"}, {"id": 488, "start": 4218.36, "end": 4226.4, "text": "also ich werde gucken, welche Katzen gerade im Tierheim sind. Genug Platz und für zwei"}, {"id": 489, "start": 4226.4, "end": 4232.96, "text": "ist überhaupt kein Problem. Also ich würde bevorzugt zwei nehmen, wenn es halt welche"}, {"id": 490, "start": 4232.96, "end": 4238.04, "text": "sind, die schon zusammen gehören und halt zusammen vermittelt werden. Dann würde ich"}, {"id": 491, "start": 4238.04, "end": 4243.6, "text": "gerne zwei nehmen, aber ich würde auch eine Einzel nehmen, wenn es halt eine ist, die alleine"}, {"id": 492, "start": 4243.6, "end": 4250.28, "text": "sein will. Und ich würde am liebsten wieder eine bisschen ältere Katze nehmen, einfach"}, {"id": 493, "start": 4250.28, "end": 4257.36, "text": "weil es ein bisschen getillter ist. Ich meine, ich muss jetzt nicht unbedingt wieder 14-15"}, {"id": 494, "start": 4257.36, "end": 4264.76, "text": "sein, weil ich meine, ich habe es jetzt ja bei der letzten Katze gesehen. Das Problem"}, {"id": 495, "start": 4264.76, "end": 4269.36, "text": "ist einfach, wenn die Katzen schon so alt sind, das ist halt, man mag ja seine Katze"}, {"id": 496, "start": 4269.36, "end": 4275.04, "text": "auch, allerdings wenn Katzen schon 14-15 sind, dann ist halt die Chance, dass sie jetzt nicht"}, {"id": 497, "start": 4275.04, "end": 4288.6, "text": "mehr so viel älter werden, halt nicht so klein. Der Google-Rückblick ist besser als"}, {"id": 498, "start": 4288.6, "end": 4294.04, "text": "YouTube-Rewind. Was ist denn da so drinnen? Ist das irgendwas Google-bezogenes oder was"}, {"id": 499, "start": 4294.04, "end": 4304.56, "text": "so Weltgeschehen-bezogenes? Oh, dann das Snipe. Achtung Leute, alle sind zu Silvesterfeiern"}, {"id": 500, "start": 4304.56, "end": 4315.64, "text": "und jetzt lohnt es sich, dass ich da bin und snipen kann. Easy-Snipe. Easy-Easy-Snipe."}, {"id": 501, "start": 4315.64, "end": 4320.08, "text": "Give energy, easy-Snipe. Obwohl, Energy ist zu spät, bis ihr das seht, ist es eh schon"}, {"id": 502, "start": 4320.08, "end": 4336.52, "text": "fertig. Achtung, Achtung. Der Result-Flick kommt jetzt hier. Fuck. Scheiße, das wäre"}, {"id": 503, "start": 4336.52, "end": 4346.6, "text": "jetzt auch zu geil gewesen, oder? Hätte ich die gesniped, hätte Fabian heute Abend"}, {"id": 504, "start": 4346.6, "end": 4374.8, "text": "auch entschaden müssen. Mein zweiter Rechner, wo ich den Chat anzeige, kackt gerade voll"}, {"id": 505, "start": 4374.8, "end": 4385.64, "text": "ab. Ähm, ich muss gerade mal an die andere Maus rüber. Was ist denn da los? Äh, Moment,"}, {"id": 506, "start": 4385.64, "end": 4395.28, "text": "geht doch. Funktioniert doch alles. Hä? Ist mein Maus-Sharing-Ding abgekackt. Moment."}, {"id": 507, "start": 4395.28, "end": 4408.8, "text": "Mal neu starten. Ich mein, ich muss brauchen zwei Monitors, das ist ganz für den Arsch."}, {"id": 508, "start": 4408.8, "end": 4426.28, "text": "Ah, geht wieder. Gut, alles klar. Ja, blim, blim. Okay. Ja, kriegt sich wieder ein Kack-Programm."}, {"id": 509, "start": 4426.28, "end": 4446.16, "text": "Du, du, du, du, du, du. Du, du, du, du. Du, du, du, du, du, du, du. Ich glaub, Video"}, {"id": 510, "start": 4446.16, "end": 4465.76, "text": "kann ich noch einen Ticken lauter machen, ne? Zweiter Rechner von Chat, ne, der zweite Rechner"}, {"id": 511, "start": 4465.76, "end": 4476.0, "text": "ist, ähm, Stream-Vorschau und halt mit Chat, Discord, ähm, Donation-Ticker, Follow- und"}, {"id": 512, "start": 4476.0, "end": 4482.08, "text": "Hosting-Ticker und wenn ich irgendwas nachgucken will, wo ich halt nicht will, dass man es"}, {"id": 513, "start": 4482.08, "end": 4488.72, "text": "ums Stream sieht. Und das ist ja der zweite Rechner, den ich nicht dafür gekauft hab,"}, {"id": 514, "start": 4488.72, "end": 4500.16, "text": "das ist der Rechner, den ich hatte vor dem, jetzt. Du, du, du, du, du, du, du, du, du."}, {"id": 515, "start": 4500.16, "end": 4510.12, "text": "So Leute, wir sind jetzt gerade so schön beim Cryanten dabei. Ich würd sagen, ich mach"}, {"id": 516, "start": 4510.12, "end": 4519.92, "text": "auch gerade noch mal die Basi-Quests, ist ja auch nicht so weit weg. Ähm, Eax, bist"}, {"id": 517, "start": 4519.92, "end": 4542.68, "text": "du schon da? Wegen, wegen Viewer-Games? Er ist grad afk. Ok, wenn der Eax wieder da"}, {"id": 518, "start": 4542.68, "end": 4547.6, "text": "ist, fangen wir mit Overwatch-Games ein, aber vorher machen wir noch die, den Daily-Cryant"}, {"id": 519, "start": 4547.6, "end": 4560.88, "text": "fertig. So wie ich die kenne, ist er gerade aufgestanden oder so. Ich muss mal kurz Discord"}, {"id": 520, "start": 4560.88, "end": 4566.76, "text": "schreiben. So, wir gehen jetzt mal hier zum, wo sind denn die Basis noch mal? Hier neben"}, {"id": 521, "start": 4566.76, "end": 4595.44, "text": "irgendwo. Ja, Zen Tower machen wir jetzt, auch gut. Hey Basi, wir machen Basi-Spot. Ähm,"}, {"id": 522, "start": 4595.44, "end": 4601.72, "text": "aber Leute, wenn wir, wenn wir Overwatch-Viewer-Games machen, spielen wir ordentlich, ne? Also wir"}, {"id": 523, "start": 4601.72, "end": 4606.72, "text": "können vielleicht am Anfang irgendwie so ein paar, paar witzige Fun-Game-Modes machen,"}, {"id": 524, "start": 4606.72, "end": 4611.52, "text": "so hier unendlich Ultimate-Charge oder irgendwie sowas, aber danach, ich mein, weil's halt"}, {"id": 525, "start": 4611.52, "end": 4617.84, "text": "eben im Rank so selten vorkommt, spielen wir ordentlich Overwatch, ok? Also ordentliche"}, {"id": 526, "start": 4617.84, "end": 4622.88, "text": "Team-Coms. Wir können uns höchstens darauf einigen, dass wir Junkrat und Mercy bannen."}, {"id": 527, "start": 4622.88, "end": 4628.04, "text": "Da wäre ich sogar dafür. Wir können, wir können sagen, wir spielen ordentliches, äh,"}, {"id": 528, "start": 4628.04, "end": 4640.6, "text": "Competitive Overwatch jetzt zusammen. Allerdings, wir bannen Junkrat und Mercy. Was, Speicher-Lag,"}, {"id": 529, "start": 4640.6, "end": 4649.28, "text": "WTF? Was ist da los? Äh, eher, aber reicht's, wenn du das Game neu startest oder? Weil"}, {"id": 530, "start": 4649.28, "end": 4655.0, "text": "Speicher-Lag hat ich so extrem ist, dass es nach 10-15 Minuten abkackt, hatte ich in Overwatch"}, {"id": 531, "start": 4655.0, "end": 4684.96, "text": "eigentlich noch nie. Ja, Hanzo kannst du gerne picken, wenn's passt. Es, also, es ist"}, {"id": 532, "start": 4684.96, "end": 4694.76, "text": "es darf jeder mitspielen. Also, es ist mir egal, ob, äh, Porsche oder GM oder Top 500"}, {"id": 533, "start": 4694.76, "end": 4703.84, "text": "oder Overwatch-League-Spieler. Ähm, ist mir wurscht. Allerdings ausgeglichen. Also,"}, {"id": 534, "start": 4703.84, "end": 4709.36, "text": "wir müssen gucken, dass wir ungefähr beide Teams immer, Moment, was ist hier los? Dass"}, {"id": 535, "start": 4709.36, "end": 4718.24, "text": "wir beide Teams ungefähr ähnlich äh, ausstatten mit Leuten, weil sonst wird das nix. Gehen"}, {"id": 536, "start": 4718.24, "end": 4730.48, "text": "wir mal zum Rahm, äh, zum Rahim. Gehen wir zum Rahim. Aber wir spielen gescheit, Leute."}, {"id": 537, "start": 4730.48, "end": 4758.28, "text": "Leute, ich bin schon fertig. So, ich soll Basis bashen, ne?"}, {"id": 538, "start": 4758.28, "end": 4784.08, "text": "Basis soll ich bashen, mach ich. So, und jetzt laden wir erstmal den Krempel hier"}, {"id": 539, "start": 4784.08, "end": 4797.4, "text": "rein vom Country-Spot, wenn ich wieder in Space hab. Gibt es in BDO einen Server, auf dem"}, {"id": 540, "start": 4797.4, "end": 4801.96, "text": "sich viele Deutsche niedergelassen haben, quasi wie Shiva in Final Fantasy XIV? Ich"}, {"id": 541, "start": 4801.96, "end": 4808.76, "text": "dachte Odin war der deutsche Server in Final Fantasy. Ähm, es gibt in BDO zwar unterschiedliche"}, {"id": 542, "start": 4808.76, "end": 4819.44, "text": "Channels, aber es gibt einen großen Server. Also, das kann jeder mit jedem spielen. D.h.,"}, {"id": 543, "start": 4819.44, "end": 4822.84, "text": "am besten ist, dementsprechend gibt es natürlich auch viele deutsche Gilden und ich vermute"}, {"id": 544, "start": 4822.84, "end": 4829.0, "text": "mal auch viele Gilden mit, also viele deutsche Gilden mit vielen Spielern. Aber hab ich keine"}, {"id": 545, "start": 4829.0, "end": 4835.72, "text": "Ahnung von. Du hast zwar hier Channels, es gab mal unterschiedliche Server, aber das"}, {"id": 546, "start": 4835.72, "end": 4844.88, "text": "ist mittlerweile alles ein großer Cluster. Ja, ja, das stimmt, aber seit wann ist das"}, {"id": 547, "start": 4844.88, "end": 4851.48, "text": "denn? Seit deinem neuen Monitor, oder wie? Also, wir spielen jetzt, aber bei Viewer Games"}, {"id": 548, "start": 4851.48, "end": 4864.84, "text": "machst du mit, oder? Max, programmierst du manchmal einfach irgendwas, einfach weil du"}, {"id": 549, "start": 4864.84, "end": 4870.52, "text": "Spaß machst, oder programmierst du sogar Dinge für den Haushalt? Ich mach, klar, weil"}, {"id": 550, "start": 4870.52, "end": 4877.6, "text": "es bald Spaß macht. Klar, viele Sachen machen Spaß, die braucht man nicht unbedingt. Klar,"}, {"id": 551, "start": 4877.6, "end": 4881.88, "text": "das ist auch das, was man am besten lernt. Also, wenn man sich irgendein Projekt ausdenkt,"}, {"id": 552, "start": 4881.88, "end": 4887.76, "text": "wo man sich denkt, ich würde es gerne machen, bzw. ist was, was ich vielleicht anders machen,"}, {"id": 553, "start": 4887.76, "end": 4896.2, "text": "das haben wir da jetzt gekriegt, anders machen würde als schon bestehende Software, dann"}, {"id": 554, "start": 4896.2, "end": 4907.76, "text": "hat man wenigstens ein Ziel vor Augen, das ist dann einfacher. Ach, du hast wieder Windows"}, {"id": 555, "start": 4907.76, "end": 4933.6, "text": "7. Ich glaube, der ist ganz gut. Easy Basi Bash. Ich sehe immer, wie OP der Wizard ist."}, {"id": 556, "start": 4933.6, "end": 4938.44, "text": "Ich kenne ja, ich gucke ja beim Friseur immer zu, wenn er Basis klein ist, ich habe das"}, {"id": 557, "start": 4938.44, "end": 4942.32, "text": "Gefühl, der braucht mit dem Ranger länger. Und das, obwohl er viel besser equipped ist,"}, {"id": 558, "start": 4942.32, "end": 4961.52, "text": "als Schwimmbiss hat. Das ist auch lustig. Sollte vielleicht jetzt nicht Chat gucken werden,"}, {"id": 559, "start": 4961.52, "end": 4969.32, "text": "wenn ich hier mobs rumspringen. Haben wir die Quest fertig? Wo müssen wir jetzt hin?"}, {"id": 560, "start": 4969.32, "end": 4978.84, "text": "Direkt hier oben, ok. Huge AoE spells, massive, massive res, massive. Oder wie immer gesagt,"}, {"id": 561, "start": 4978.84, "end": 4999.24, "text": "Big Slam."}, {"id": 562, "start": 4999.24, "end": 5025.88, "text": "Wenn ergeblich sind hier Mobs, die ich killen muss. Aber irgendwie..."}, {"id": 563, "start": 5025.88, "end": 5037.64, "text": "Sind ja keine Mobs, die ich killen muss. Wo sind denn die Mobs, die ich killen muss?"}, {"id": 564, "start": 5037.64, "end": 5052.12, "text": "Vielleicht nicht hier unten, sondern irgendwo hier oben. Gucken wir mal. Wo sind die kleinen"}, {"id": 565, "start": 5052.12, "end": 5060.64, "text": "Mobs, die gebashed werden müssen? Hier oben nicht. Wo sind die Mobs? Muss ja hier irgendwo"}, {"id": 566, "start": 5060.64, "end": 5089.92, "text": "sein. Ist das richtig? Moment. Oh, ich bin noch hier richtig? Hä? Ich bläste jetzt einfach"}, {"id": 567, "start": 5089.92, "end": 5115.2, "text": "mal weiter, Mobs. Wo sind denn die Codraws? Wo sind die Codraws? Hier oben verstellst"}, {"id": 568, "start": 5115.2, "end": 5126.32, "text": "es irgendwo. Gucken wir mal hier oben. Sind hier oben welche? Nee. Hey, ich hab neu angefangen"}, {"id": 569, "start": 5126.32, "end": 5130.56, "text": "und finde, dass der Riese... Der Riese sieht ziemlich cool aus. Ja, das stimmt. Ich hab"}, {"id": 570, "start": 5130.56, "end": 5141.84, "text": "auch einen Riesen. Allerdings ist er nur 56. Und ist mein AFK-Angelheld. Der Berser,"}, {"id": 571, "start": 5141.84, "end": 5149.36, "text": "der Bersi, der ist im PvP, ist da ziemlich gut. Also ich bin, wie gesagt, übelster Noob"}, {"id": 572, "start": 5149.36, "end": 5155.12, "text": "in dem Game. Aber Bersi ist one on one, das weiß ich, eines der besten Klassen, die es"}, {"id": 573, "start": 5155.12, "end": 5170.04, "text": "gibt im BDO. Weil du halt saumäßig viel CC-Attacks hast. Okay, Ejax, sag einfach Bescheid, wenn"}, {"id": 574, "start": 5170.04, "end": 5194.4, "text": "du ready bist, dann fangen wir mit Overwatch an. Wo sind die kack Mobs? BDO, please. Also"}, {"id": 575, "start": 5194.4, "end": 5205.52, "text": "BDO müssen wir hier unten hin. Moment. Ach hier können wir auch hin? Okay, dann gehen"}, {"id": 576, "start": 5205.52, "end": 5232.0, "text": "wir hier hin. Wenn hier nix ist, bashen wir die Mobs da oben. Jetzt müssen wir da hin,"}, {"id": 577, "start": 5232.0, "end": 5252.16, "text": "da war aber doch eh auch eben nix. Alter, was ist denn hier los? Was sind denn die Mobs?"}, {"id": 578, "start": 5252.16, "end": 5255.68, "text": "Auf YouTube wären jetzt schon die ersten Leute, die sich wieder aufgeregt hätten, weil ich"}, {"id": 579, "start": 5255.68, "end": 5285.6, "text": "gesagt habe, Möpse anstatt Mobs. Das ist ja voll abwertend wieder. So, hier ist nix."}, {"id": 580, "start": 5285.6, "end": 5294.52, "text": "Okay, dann gehen wir halt da hin. Manapods verkleiden, das braucht der Wizard halt glücklicherweise"}, {"id": 581, "start": 5294.52, "end": 5310.72, "text": "nicht. Bin ich auch froh, dass der Wizard so drankunabhängig ist. Ich glaube, ich habe"}, {"id": 582, "start": 5310.72, "end": 5319.12, "text": "vor drei Monaten nur das letzte Mal Tränken gekauft, die habe ich immer noch. Moin Schaskei."}, {"id": 583, "start": 5319.12, "end": 5329.96, "text": "Also bei mir dauert es noch ungefähr eineinhalb Stunden. Moment. Hä? Das war doch gar nicht"}, {"id": 584, "start": 5329.96, "end": 5350.56, "text": "der Spot, den wir eben angeklickt haben. Ach nee, da hoch geht es auch noch. Cryton, jawoll."}, {"id": 585, "start": 5350.56, "end": 5378.64, "text": "Das Beste. Alles bashen. Ist das was für Diablo-Spieler?"}, {"id": 586, "start": 5378.64, "end": 5387.28, "text": "Also wenn du auf das Mob-Killen von Diablo stehst, dann auf jeden Fall, das mit dem Loot"}, {"id": 587, "start": 5387.28, "end": 5392.6, "text": "funktioniert ein bisschen anders als im Diablo. Die Mobs geben hier zum größten Teil keinen"}, {"id": 588, "start": 5392.6, "end": 5396.56, "text": "Loot, den du direkt als Ausrüstung verwenden kannst, sondern Gegenstände, die Geld bringen."}, {"id": 589, "start": 5396.56, "end": 5400.36, "text": "Und von den Gegenständen, die Geld bringen, kannst du dir dann wiederum deine Ausrüstung"}, {"id": 590, "start": 5400.36, "end": 5415.6, "text": "verbessern, indem du halt craftest oder hier halt gleich das bessere Zeug kaufst. Da ist"}, {"id": 591, "start": 5415.6, "end": 5427.36, "text": "sowas zum Bashen. Ähm, guck mal, hier sind so komische Kopras, die muss ich Bashen. Und"}, {"id": 592, "start": 5427.36, "end": 5435.24, "text": "wie kriege ich denn die Kopras von Steinen wieder? Wobei, nee. Das sind... Vielleicht,"}, {"id": 593, "start": 5435.24, "end": 5450.04, "text": "ich glaube, ich lese den Questtext gleich nochmal. Nö. Eigentlich soll ich nur hier"}, {"id": 594, "start": 5450.04, "end": 5457.64, "text": "irgendwas bashen, aber irgendwie ist hier nix. What the fuck, Alter, what the fuck. Basht"}, {"id": 595, "start": 5457.64, "end": 5467.56, "text": "mal die Basis da oben jetzt noch. Bam! Bei der Gelegenheit könnte man auch mal unseren"}, {"id": 596, "start": 5467.56, "end": 5492.44, "text": "Daily XP Buff ziehen. Daily Exp. Hab ich jedenfalls vorhin überlesen, wo es um YouTube und Amazon"}, {"id": 597, "start": 5492.44, "end": 5501.48, "text": "und sowas ging? Oh, Skill-Punkte. Nice, die muss man klar als Abholen. Weil nicht, dass"}, {"id": 598, "start": 5501.48, "end": 5508.76, "text": "ich nachher wieder jemand beschwere. Ich gucke nicht in den Chat. Aber ich gucke die ganze"}, {"id": 599, "start": 5508.76, "end": 5519.92, "text": "Zeit in den Chat. Aber manchmal kann es passieren, dass ich irgendwas übersehe. Ich finde schon,"}, {"id": 600, "start": 5519.92, "end": 5536.52, "text": "das ist was für Diablo-Spieler ist. Ähm. Würdest du sagen, dein YouTube-Channel war"}, {"id": 601, "start": 5536.52, "end": 5545.36, "text": "eine der besten Entscheidungen deines Lebens? Meinst du damit anzufangen? Ah, ja. Ja. Also"}, {"id": 602, "start": 5545.36, "end": 5549.92, "text": "muss ich gar nicht viel groß drum rumlabern. Kann man glaube ich ganz einfach verantworten."}, {"id": 603, "start": 5549.92, "end": 5555.68, "text": "Auch wenn ich da am Anfang natürlich nicht dran gedacht habe. Das ist ja bei den meisten"}, {"id": 604, "start": 5555.68, "end": 5559.76, "text": "Sachen so. Bei den meisten Sachen, die sich im Nachhinein besonders geil rausstellen, hat"}, {"id": 605, "start": 5559.76, "end": 5565.08, "text": "man das nicht geplant oder so. Die wenigsten Sachen sind voll durchdacht und kalkuliert."}, {"id": 606, "start": 5565.08, "end": 5575.72, "text": "Außer Hansos Scatter Arrow. Der ist natürlich immer kalkuliert. Okay, ich bin mal wieder"}, {"id": 607, "start": 5575.72, "end": 5582.84, "text": "zu dumm, Quest-Objective zu finden. Ah, so ist das halt bei mir, ne?"}, {"id": 608, "start": 5582.84, "end": 5603.44, "text": "Wir wechseln. Wir wechseln das einfach mal in den Channel. Wahrscheinlich sind hier"}, {"id": 609, "start": 5603.44, "end": 5622.08, "text": "alle Mops schon tot. Aber wenn du was suchst, wie Diablo-Spiel Pass of Exile. Also wenn"}, {"id": 610, "start": 5622.08, "end": 5629.04, "text": "es hier vor allem um diesen Nude-Aspekt dabei geht, dann Spiel Pass of Exile. Wenn es hier"}, {"id": 611, "start": 5629.04, "end": 5635.16, "text": "ums Mops-Passion geht und wenn es eher Richtung MMO gehen soll, dann ist BDO das beste, was"}, {"id": 612, "start": 5635.16, "end": 5642.08, "text": "du zurzeit machen kannst. Aber wenn es hier um Loot und Monster-Kloppen geht, also das"}, {"id": 613, "start": 5642.08, "end": 5650.56, "text": "Loot wie Diablo, dann eindeutig Pass of Exile. Das ist das beste, was es gibt in der Richtung."}, {"id": 614, "start": 5650.56, "end": 5670.64, "text": "Seit Jahren schon. Du brauchst sinnlose, okay, die sind um den Tempel rum. Dann ist ja mal"}, {"id": 615, "start": 5670.64, "end": 5699.68, "text": "die Anzeige der Spots wieder richtig geil. BDO-Quests. Da, da ist eine. Bashen. Das kleine"}, {"id": 616, "start": 5699.68, "end": 5704.16, "text": "Kackzeug. Guck mal, hier sind alte BDO-A. Die Anzeige von den Quest-Objectives ist ja"}, {"id": 617, "start": 5704.16, "end": 5711.48, "text": "mal wieder sowas von fail. Ich meine, hier sind ganz viele, ja. Und an den Stellen. Guck"}, {"id": 618, "start": 5711.48, "end": 5722.68, "text": "mal, wo ich bin. Hier bin ich. Und angeblich da, da, da und da ist die Quest. Well played"}, {"id": 619, "start": 5722.68, "end": 5736.92, "text": "BDO. Beziehungsweise Pearl Abyss Kakao. Dann da. So, Quest fertig. Easy. Oh Mann, ist das"}, {"id": 620, "start": 5736.92, "end": 5757.64, "text": "bescheuert gewesen. Ich bin genau da gewesen, wo das Licht hingeautorunnt ist. Sogar drei"}, {"id": 621, "start": 5757.64, "end": 5784.92, "text": "verschiedenen Spots. Ups. Oh, da gibt es Combat Points. Okay, ich muss Basis bashen. Easy."}, {"id": 622, "start": 5784.92, "end": 5794.88, "text": "Dafür bin ich eigentlich gekommen zum Basis-Baschen. Moment, das sind auch Basis, die sehen gar"}, {"id": 623, "start": 5794.88, "end": 5807.28, "text": "nicht so aus. Na, wenn BDO das meint, dass das Basis sind. Du spielst jetzt einfach mal"}, {"id": 624, "start": 5807.28, "end": 5814.04, "text": "alles an, was dir über den Weg läuft. Das kann nicht schaden. Also, sich ein bisschen"}, {"id": 625, "start": 5814.04, "end": 5820.28, "text": "umzugucken, weil man gerade so kein Main-Game hat, ist immer gut. Ich mache es anders."}, {"id": 626, "start": 5820.28, "end": 5823.72, "text": "Ich gucke mir die Games an und habe dann immer das Gefühl, ich finde 90 Prozent scheiße"}, {"id": 627, "start": 5823.72, "end": 5840.48, "text": "und fange dann erst gar nicht mit an zu spielen. Das ist auch nicht der beste Ansatz. Musik"}, {"id": 628, "start": 5840.48, "end": 5866.2, "text": "intensifies. So Leute, sobald ich die Basis kaputt habe, loggen wir auf Overwatch um."}, {"id": 629, "start": 5866.2, "end": 5885.96, "text": "Dann sind wir nämlich auch gut eingespielt, wenn die neue Season losgeht. Der Eaxe ist"}, {"id": 630, "start": 5885.96, "end": 5896.4, "text": "noch off. Eaxe, bist du off? XQC online spielt gerade Minecraft. Weißt du, so schlimm ist"}, {"id": 631, "start": 5896.4, "end": 5903.0, "text": "es schon um die Overwatch Pros, wenn Overwatch nicht on ist, also beziehungsweise die Season-Pause"}, {"id": 632, "start": 5903.0, "end": 5925.16, "text": "ist. Man merkt auch, dass es auf 24 Uhr zugeht. Leute werden weniger. Bashing."}, {"id": 633, "start": 4925.98, "end": 5942.04, "text": "Habt ihr eigentlich was im Steam Winter Sale gekauft? Also, was ich gekauft"}, {"id": 634, "start": 5942.04, "end": 5947.8, "text": "habe, habt ihr ja gesehen. Hab ich ja im Stream, haben uns ja angeguckt, was es so gibt. Habt"}, {"id": 635, "start": 5947.8, "end": 5971.0, "text": "ihr euch irgendwas gekauft? Und wenn ja, was? Das ist voll uneffektiv, ich brauche mehr"}, {"id": 636, "start": 5971.0, "end": 5989.0, "text": "Basis. Bayonetta, okay. Stimmt, das gibt es jetzt auch auf dem PC, ne? Spell Force 3,"}, {"id": 637, "start": 5989.0, "end": 6002.0, "text": "okay. Kann man das jetzt spielen mittlerweile? Bei Release war das ja in fragwürdigem Zustand."}, {"id": 638, "start": 6002.0, "end": 6011.72, "text": "BR4 Premium, okay. BR4 ist zu einem richtig guten Game geworden jetzt. Nach der ganzen"}, {"id": 639, "start": 6011.72, "end": 6018.08, "text": "Zeit. Da sieht man mal, dass man eben auch aus, sagen wir mal, Fails am Anfang, wenn"}, {"id": 640, "start": 6018.08, "end": 6023.08, "text": "man sich darum kümmert und dann noch ein bisschen Zeit rein steckt und Leute dran setzt, denen"}, {"id": 641, "start": 6023.08, "end": 6026.64, "text": "das nicht komplett egal ist, immer noch ein gutes Game draus machen kann. Hat man ja auch"}, {"id": 642, "start": 6026.64, "end": 6032.88, "text": "an Rainbow Six gesehen. Rainbow Six am Anfang, richtiger Fail vor allem, überhaupt nicht"}, {"id": 643, "start": 6032.88, "end": 6039.92, "text": "gut angekommen. Und jetzt, verkauft, millionenfach verkauft und die Leute finden es auch geil."}, {"id": 644, "start": 6039.92, "end": 6051.56, "text": "Also, wenn man nicht einfach durch was raushaut und danach den Support einstellt und sich"}, {"id": 645, "start": 6051.56, "end": 6055.04, "text": "nicht mehr darum kümmert, kann man auch, wenn es am Anfang nicht so geil ist, noch was"}, {"id": 646, "start": 6055.04, "end": 6062.92, "text": "Geiles draus machen. Prey und Alex. Das neue Prey wollte ich auch noch spielen. Es gibt"}, {"id": 647, "start": 6062.92, "end": 6066.92, "text": "viele Sachen dieses Jahr, die ich noch spielen wollte. Auch mal zur Abwechslung wieder das"}, {"id": 648, "start": 6066.92, "end": 6071.48, "text": "neue Assassin's Creed, was ja wirklich gut sein soll. Ich hätte im Leben nicht dran"}, {"id": 649, "start": 6071.48, "end": 6076.76, "text": "gedacht, dass ich noch mal, quasi, mich drauf freue, einen Assassin's Creed zu spielen."}, {"id": 650, "start": 6076.76, "end": 6086.52, "text": "Für mich ist der Ezio ja immer noch der eins schwere Assassin's Creed Held. Ezio"}, {"id": 651, "start": 6086.52, "end": 6102.44, "text": "ist der. Ezio Auditore. Da, da Firenze oder so. Da Firenze. Wieso ist deine Waffe nicht"}, {"id": 652, "start": 6102.44, "end": 6130.6, "text": "ultimate? Ist sie. Guck, da. Endlich ordentlich viele Basis hier."}, {"id": 653, "start": 6130.6, "end": 6140.6, "text": "Der Eaxe ist wieder da. Okay. Jetzt muss er bloß noch wieder ins Stream kommen, dann"}, {"id": 654, "start": 6140.6, "end": 6149.12, "text": "können wir zur Overwatch wechseln. Das ist aber gut, dann habe ich auch die Quest fertig."}, {"id": 655, "start": 6149.12, "end": 6168.12, "text": "Top. Perfekt. Habe ich meinen schönen Daily-Cryant-Exp-Contribution-Points gemacht. Also, nur mal um sicher zu gehen,"}, {"id": 656, "start": 6168.12, "end": 6173.56, "text": "dass wir jetzt auch gleich, wenn wir Viewer-Games machen, Overwatch genug Leute haben. Wer würde"}, {"id": 657, "start": 6173.56, "end": 6180.36, "text": "mitmachen? Oder wer will mitmachen? Weil wenn wir kein Game voll kriegen, dann werde ich"}, {"id": 658, "start": 6180.36, "end": 6190.0, "text": "bis die Season anfängt noch weitercryingen. Werden wir mit Overwatch spielen. Aber wohlgemerkt"}, {"id": 659, "start": 6190.0, "end": 6195.72, "text": "ordentlich Overwatch. Also mit ordentlicher Comp. Das Einzige, was wir machen können,"}, {"id": 660, "start": 6195.72, "end": 6204.84, "text": "ist, wir können Junkrat und Mercy rausbauen. Was mich auch interessieren wird, schreibt"}, {"id": 661, "start": 6204.84, "end": 6213.96, "text": "nochmal bitte euren Rang dabei, weil ich so ungefähr sehe, wie die Verteilung ist. So,"}, {"id": 662, "start": 6213.96, "end": 6243.2, "text": "jetzt abgeben. Fertig. Auf kleiner Vizarte. Vizarde. Wegfindung. Beste. Mick ist erforderlich,"}, {"id": 663, "start": 6243.2, "end": 6252.16, "text": "es wäre ganz gut. Muss aber nicht die beste Quali sein. Aber Mick wäre schon nicht schlecht."}, {"id": 664, "start": 6252.16, "end": 6264.16, "text": "Wir wollen das hier ordentlich spielen. Overwatch ist einfach Teamwork-Game. Es ist so ein riesen"}, {"id": 665, "start": 6264.16, "end": 6267.64, "text": "Unterschied. Das werdet ihr jetzt auch hier gleich sehen. Es ist ein riesen Unterschied,"}, {"id": 666, "start": 6267.64, "end": 6272.56, "text": "ob man Overwatch im Rank spielt oder jetzt sogar hier, wo wir noch nie zusammen gespielt"}, {"id": 667, "start": 6272.56, "end": 6286.76, "text": "haben, wenn alle Leute wenigstens an einem Schrank ziehen wollen. Eax, bist du wieder"}, {"id": 668, "start": 6286.76, "end": 6306.0, "text": "da? Es fehlen immer noch Skillpoints."}, {"id": 669, "start": 6306.0, "end": 6323.24, "text": "Okay, Eax, probieren wir es mal aus jetzt. Probieren wir es mal aus. Okay, ich ändere"}, {"id": 670, "start": 6323.24, "end": 6343.76, "text": "das Gamer auf Overwatch. Das Mob-Pack mache ich noch kaputt. Dann locken wir um. Also"}, {"id": 671, "start": 6343.76, "end": 6348.92, "text": "Leute, kriegen wir insgesamt, wie viel brauchen wir? 12, 10. Kriegen wir 10 Leute zusammen,"}, {"id": 672, "start": 6348.92, "end": 6355.92, "text": "die mit spielen wollen, ja? Und so wie ich das sehe, so in dem Dreh Gold bis Diamond"}, {"id": 673, "start": 6355.92, "end": 6365.6, "text": "wahrscheinlich die meisten. Weil wir auch ein paar Master-Spieler haben. Okay, machen"}, {"id": 674, "start": 6365.6, "end": 6393.52, "text": "wir. Dann locken wir um. Das Game ändern. Overwatch. So hat sich das Game geändert."}, {"id": 675, "start": 6393.52, "end": 6399.24, "text": "Immer noch nicht. Ich glaube, Twitch braucht einfach eine Weile, bis sich das Game ändert."}, {"id": 676, "start": 6399.24, "end": 6423.16, "text": "Es ist einfach nicht so schnell. So, hat es jetzt geswitcht auf Overwatch? Oder bugged"}, {"id": 677, "start": 6423.16, "end": 6452.6, "text": "es wieder? Äh. Capture es mal wieder auf Overwatch, richtig? Hammer gleich. Okay,"}, {"id": 678, "start": 6452.6, "end": 6475.16, "text": "Game Capture. Overwatch. Jawoll, da ist es. Gut, machen wir Custom Game auf. In der Hoffnung,"}, {"id": 679, "start": 6475.16, "end": 6482.96, "text": "dass es jetzt umgestellt hat auf Overwatch. Ja, hat umgestellt auf Overwatch. Perfekt."}, {"id": 680, "start": 6482.96, "end": 6488.4, "text": "Bei meinem Handy steht immer noch IRL. IRL sollte es schon längst nach BDO gewechselt"}, {"id": 681, "start": 6488.4, "end": 6493.4, "text": "haben und jetzt nach, jetzt denke ich es hier nach Overwatch. Aber man weiß ja nicht so"}, {"id": 682, "start": 6493.4, "end": 6501.96, "text": "genau, was da. Gut, wie geht denn das? Mir fällt auf, ich hab jetzt seit Monaten kein"}, {"id": 683, "start": 6501.96, "end": 6514.84, "text": "Custom Game aufgemacht. Play. Game Browser. Create. Oder geht das noch irgendwie anders?"}, {"id": 684, "start": 6514.84, "end": 6533.52, "text": "Müssen wir mal schauen, nicht? Ja, zwei Stunden bis zur nächsten Season. Nee, kann"}, {"id": 685, "start": 6533.52, "end": 6554.8, "text": "er nur da drüber gehen. So, Settings lassen wir Standard. Heroes. Das Einzige, was wir,"}, {"id": 686, "start": 6554.8, "end": 6561.36, "text": "was wir mal verbieten, ist Mercy. Da hab ich echt keinen Bock drauf. Obbei eigentlich"}, {"id": 687, "start": 6561.36, "end": 6569.76, "text": "müssen wir das nicht verbieten. Ich sag das einfach. Keine Mercy. Easy. Test, Test. In-Game"}, {"id": 688, "start": 6569.76, "end": 6580.6, "text": "Sound geht auch. So Leute, ich stell das jetzt hier auf. Ach, man kann das über den Nightbot"}, {"id": 689, "start": 6580.6, "end": 6592.84, "text": "ändern. Das ist gut, das ist sehr nice. Also, wir machen jetzt hier Max Führer Games."}, {"id": 690, "start": 6592.84, "end": 6603.52, "text": "Ach, Moment. Settings. Das kann man bestimmt noch in Competitive umstellen. Hab das noch"}, {"id": 691, "start": 6603.52, "end": 6617.12, "text": "nie gemacht mit dem neuen Menü. Standard 6x6. Competitive. Ja. So, also das Game, das heißt"}, {"id": 692, "start": 6617.12, "end": 6630.88, "text": "jetzt Max Führer Games. Und ich stell das jetzt ein auf, dass jeder joinen kann. Geht"}, {"id": 693, "start": 6630.88, "end": 6655.28, "text": "das so? Mach ich das richtig? Ja. Bäm. Erster schon am Start. Moment. Anubis? Nein, nein,"}, {"id": 694, "start": 6655.28, "end": 6666.8, "text": "nein. Wir fangen nicht mit ner Kackmap an. Geh weg. Wir fangen an mit, mit welcher Map"}, {"id": 695, "start": 6666.8, "end": 6687.2, "text": "wollen wir anfangen Leute? Komm, King's Roar Winter. King's Roar ist gute Map. Eaxe"}, {"id": 696, "start": 6687.2, "end": 6712.8, "text": "hier. Options, Sound, Voice. Hallo? Hallo, hallo? Keine Ahnung, ob das jetzt funktioniert."}, {"id": 697, "start": 6712.8, "end": 6734.96, "text": "Leute, sollte ich euch, sagt ihr irgendwas? Sollte ich euch jetzt hören? Okay, ich versuch"}, {"id": 698, "start": 6734.96, "end": 6750.4, "text": "mal mein Voice Chat irgendwie zum Laufen zu kriegen, das spackt. Hallo, hallo? Ah, funktioniert."}, {"id": 699, "start": 6750.4, "end": 6769.28, "text": "Sehr gut. Hallo? Thomas? Thomas? Also eh, ich höre nicht, das ist schon mal gut, das"}, {"id": 700, "start": 6769.28, "end": 6782.16, "text": "weiß ich, prinzipiell funktioniert es. Alles klar. Ja, das ist, das ist schlecht. Ich mein,"}, {"id": 701, "start": 6782.16, "end": 6790.96, "text": "es war Weihnachten, hätte es ja mal langsam, aber sicher mal eins besorgen können. Leute,"}, {"id": 702, "start": 6790.96, "end": 6802.56, "text": "ich würde sagen, bei irgendeinem Musikshop für Schlagzeug oder so. Nee, es gibt für"}, {"id": 703, "start": 6802.56, "end": 6806.48, "text": "Schlagzeug so Switches zum irgendwelche Teile an und ausschalten, die kann man dann, kann"}, {"id": 704, "start": 6806.48, "end": 6811.44, "text": "man stimmend an den PC anschließen. So Leute, also wir brauchen noch ein paar, die mitspielen,"}, {"id": 705, "start": 6811.44, "end": 6824.88, "text": "sonst müssen wir wieder Mobcrime machen. Also wer noch will, auf gehts. Ich muss jetzt"}, {"id": 706, "start": 6824.88, "end": 6841.68, "text": "mal gucken, was wir hier für Ränge haben, so ungefähr. Gold? Diamond? Okay. Smurf?"}, {"id": 707, "start": 6841.68, "end": 6859.12, "text": "Gut, ich war. Platin? Na, gucken wir mal nicht, dass es zu unverwehrt. Diamond? Plat, okay."}, {"id": 708, "start": 6859.12, "end": 6867.8, "text": "Und? Auch wahrscheinlich Smurf oder so, nee. Kein mit dem Level eher nicht. Oder eher"}, {"id": 709, "start": 6867.8, "end": 6874.76, "text": "mit dem Level eigentlich auch nicht. Also ich werde es jetzt erstmal so lassen, einfach"}, {"id": 710, "start": 6874.76, "end": 6879.08, "text": "so wie die Leute reingekommen sind. Wenn es jetzt total unbalanced ist, dann fliegt es"}, {"id": 711, "start": 6879.08, "end": 6891.2, "text": "wieder raus. Und wir machen jetzt mal die epische Musik aus. Und ich glaube, ich mach meine"}, {"id": 712, "start": 6891.2, "end": 6908.0, "text": "Push-to-Talk-Activation ein bisschen niedriger. Geht das überhaupt? Ja, glaube ich gar nicht."}, {"id": 713, "start": 6908.0, "end": 6930.12, "text": "War gut. Da nicht. So, einen brauchen wir noch. Mach ich die Musik wieder an, bis einer drin"}, {"id": 714, "start": 6930.12, "end": 6941.16, "text": "ist. Gibt es eigentlich einen Community-Discord oder TS? Nee, gibt es noch nicht. Das will"}, {"id": 715, "start": 6941.16, "end": 6968.36, "text": "ich seit Monaten schon machen. Seit Monaten. Aber irgendwie, kriege ich das nicht gebacken."}, {"id": 716, "start": 6968.36, "end": 6974.84, "text": "Ich habe zwar schon einen Discord erstellt, schon ewig her. Aber noch nichts großartig"}, {"id": 717, "start": 6974.84, "end": 6980.8, "text": "eingerichtet. Außer halt einen Channel, wo man Videos aufnehmen kann. Also die letzten"}, {"id": 718, "start": 6980.8, "end": 6984.32, "text": "paar Videos, die ich mit anderen Leuten aufgenommen habe, haben wir alle über Discord aufgenommen."}, {"id": 719, "start": 6984.32, "end": 6993.28, "text": "Also Leute, wie gesagt, einer fehlt noch. Dann können wir anfangen. Also wer noch mitspielen"}, {"id": 720, "start": 6993.28, "end": 7003.08, "text": "will? Ich meine, es haben immerhin vorhin irgendwie 20 Leute oder so. Nee, 12. 17 Leute"}, {"id": 721, "start": 7003.08, "end": 7014.04, "text": "Custom-Games gewonnen. Also, muss weiter. 6 vs. 5. Das könnte man theoretisch machen,"}, {"id": 722, "start": 7014.04, "end": 7021.56, "text": "wenn wir die besseren Leute haben. Dann spielen wir 5 gegen... Wenn wir die besseren Leute"}, {"id": 723, "start": 7021.56, "end": 7034.88, "text": "haben, spielen wir 5 gegen 6. Ich glaube, wir haben die besseren Leute. Wollen wir 6"}, {"id": 724, "start": 7034.88, "end": 7053.72, "text": "gegen 5 spielen? Wir haben die besseren Leute laut Stats. Sagt keiner was. Also wir müssen"}, {"id": 725, "start": 7053.72, "end": 7067.68, "text": "uns natürlich umdrehen. Max, kann man gleich noch rein? Du kannst jetzt rein. Ein Platz"}, {"id": 726, "start": 7067.68, "end": 7087.96, "text": "ist noch frei. Es ist voll. Okay, easy. Auf geht's. So, Musik ausmachen. Ich glaube,"}, {"id": 727, "start": 7087.96, "end": 7098.0, "text": "die Lautstärke ist gut. Ich glaube, ich kann sogar Overwatch Tickenleiser machen. So,"}, {"id": 728, "start": 7117.96, "end": 7146.16, "text": "du bist Mercy, man. Na ja. Da haben wir jetzt echt Zeit. Max, ach, check, check, check,"}, {"id": 729, "start": 7146.16, "end": 7156.64, "text": "check. Max, ach, Chat-Overlay ist ja noch an. Ja, ja, ja. Moment, mach ich weg. Jetzt"}, {"id": 730, "start": 7156.64, "end": 7179.92, "text": "ist es weg. So, äh, jetzt. Erste Runde. Auf dem Platt haben wir die deutlich besseren"}, {"id": 731, "start": 7179.92, "end": 7186.52, "text": "Leute. Ein bisschen Warmspiel für neue Season. Auf geht's. Ich hoffe, die geht auch direkt"}, {"id": 732, "start": 7186.52, "end": 7194.96, "text": "24 Uhr los. Du besitzt nicht mehr das Game. Also Overwatch ist ein richtig, richtig geiles"}, {"id": 733, "start": 7194.96, "end": 7202.12, "text": "Game. Das einzige Problem ist, dass der Rank Mode einfach so komplett verschissen ist."}, {"id": 734, "start": 7202.12, "end": 7212.16, "text": "Hanzo am Start. Moment, hört mich überhaupt jemand? Hallo? Hallo, hallo? Ach, nice. Aber"}, {"id": 735, "start": 7212.16, "end": 7233.44, "text": "keiner was sagt. Ich glaube, die kommen links rum."}, {"id": 736, "start": 7233.44, "end": 7262.92, "text": "Die haben eine Widow unten, Hanzo. Oh, nice, Schild. Ey, komm, geht doch eigentlich. Jetzt"}, {"id": 737, "start": 7262.92, "end": 7276.44, "text": "müssen wir mal ein bisschen draufdrücken hier. Der Hanzo springt sich da ein ab. Welche"}, {"id": 738, "start": 7276.44, "end": 7296.28, "text": "Grafikanstelle verwendest du? Low, Low. Achtung, Achtung jetzt. Der wird jetzt, der wird geregt."}, {"id": 739, "start": 7296.28, "end": 7323.04, "text": "Ich brauche Heal. Oh, nice, Schild. Ich spiele auf Low-Grafics. Okay, ich glaube, die Teams"}, {"id": 740, "start": 7323.04, "end": 7330.28, "text": "sind nicht ganz fair. Da müssen wir nach der Runde was machen. Aber die Zarya ist auf"}, {"id": 741, "start": 7330.28, "end": 7356.68, "text": "Deck, das muss man sagen. Hinter uns. Oh, Shrecked."}, {"id": 742, "start": 7356.68, "end": 7367.0, "text": "Max schon mal Overwatch an der Konsole gespielt? Ja, beim Kaboom habe ich schon mal Overwatch"}, {"id": 743, "start": 7367.0, "end": 7371.84, "text": "an der Konsole gespielt. Und ich habe festgestellt, dass Torb das OPste aller Zeiten ist auf der"}, {"id": 744, "start": 7371.84, "end": 7392.76, "text": "Konsole. Back. Just come back. Komm, komm zurück. Jetzt müssen wir auf unseren Reinhardt"}, {"id": 745, "start": 7392.76, "end": 7419.84, "text": "warten. Wir müssen auf den Reinhardt warten. Oh, die Zarya ist übelst overextendert. Meine"}, {"id": 746, "start": 7419.84, "end": 7434.64, "text": "Hooks sind ja die besten. Ich meine, wie oft hat der Hanzo eigentlich"}, {"id": 747, "start": 7434.64, "end": 7448.16, "text": "alt hier? Okay, back. Ich glaube, der Reaper ist oben. Lass weiter, zurück, zurück. Wir"}, {"id": 748, "start": 7448.16, "end": 7459.12, "text": "müssen auf unseren Tank warten. Nicht sterben, nicht sterben. Okay, Reinhardt vor und Ruff."}, {"id": 749, "start": 7459.12, "end": 7487.48, "text": "Huge. Merci. Ja. Zurück. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay."}, {"id": 750, "start": 7487.48, "end": 7497.28, "text": "Okay. Zurück. Der Reaper, der sieht so aus, als geht er rechts rum und flankt. Könnt"}, {"id": 751, "start": 7497.28, "end": 7509.44, "text": "ich mir gut vorstellen. Müssen wir gleich aufpassen. Ihr seid übelst leise. Ich muss"}, {"id": 752, "start": 7509.44, "end": 7529.6, "text": "mal gucken, wie ich euch lauter kriege. Oh, oh."}, {"id": 753, "start": 7529.6, "end": 7552.2, "text": "Danke für die Waffe. Perfekt. Ah. Zurück. Super grob. Ja, das ist, auf der Waffe ist"}, {"id": 754, "start": 7552.2, "end": 7565.84, "text": "relativ schwierig zu spectaten, wenn man das nicht spielt. Ja, regroupen. Regroupen und"}, {"id": 755, "start": 7565.84, "end": 7569.96, "text": "dann direkt drauf. Haben wir eine Mei ult? Ja, wir können direkt mit der Mei ult, können"}, {"id": 756, "start": 7569.96, "end": 7586.4, "text": "wir die schön nochmal vor dem Spot. Rauf, rauf, rauf, rauf, rauf, rauf, rauf, rauf."}, {"id": 757, "start": 7586.4, "end": 7603.56, "text": "Na ja, ausprobiert. Die Spieler zwar was anderes, was haben die hier?"}, {"id": 758, "start": 7603.56, "end": 7628.04, "text": "Einen. Nein, nein, nein, nein, nein. Null. Fail."}, {"id": 759, "start": 7628.04, "end": 7629.04, "text": "Fail!"}, {"id": 760, "start": 7629.04, "end": 7651.04, "text": "Hahaha!"}, {"id": 761, "start": 7660.04, "end": 7663.04, "text": "Wo ist denn der Soldier? Oder der Hanzo?"}, {"id": 762, "start": 7676.04, "end": 7677.04, "text": "Oh Gott!"}, {"id": 763, "start": 7682.04, "end": 7684.04, "text": "Hab ich die gefressen? Hab ich sie gefressen?"}, {"id": 764, "start": 7684.04, "end": 7685.04, "text": "Jawoll!"}, {"id": 765, "start": 7685.04, "end": 7686.04, "text": "Jawoll!"}, {"id": 766, "start": 7686.04, "end": 7689.04, "text": "Zarya gefressen, so muss das sein."}, {"id": 767, "start": 7692.04, "end": 7695.04, "text": "420 pro gameplay, naja, naja."}, {"id": 768, "start": 7695.04, "end": 7722.04, "text": "So, volle Pole drauf, in your face."}, {"id": 769, "start": 7725.04, "end": 7734.04, "text": "Ähm, hast du eventuell Tipps für Junkrat? Nein."}, {"id": 770, "start": 7734.04, "end": 7742.04, "text": "Außer, dass Junkrat zur Zeit eines der nervigsten europäischen Helden ist im ganzen Game."}, {"id": 771, "start": 7742.04, "end": 7745.04, "text": "Also Junkrat spielen aktuell ist keine schlechte Idee."}, {"id": 772, "start": 7745.04, "end": 7751.04, "text": "Aber ich finde den Held, also mir macht der Held keinen Spaß zu spielen, muss ich ehrlich sagen."}, {"id": 773, "start": 7751.04, "end": 7753.04, "text": "Es macht auch keinen Spaß gegen ihn zu spielen."}, {"id": 774, "start": 7753.04, "end": 7757.04, "text": "Und ich finde Junkrats einfach nur dumm, wie er zur Zeit ist."}, {"id": 775, "start": 7757.04, "end": 7759.04, "text": "Aber halt, übelst, übelst gut, ja."}, {"id": 776, "start": 7764.04, "end": 7767.04, "text": "Eigentlich spiele ich am liebsten Support und wenn es danach geht, Lucian und Ana."}, {"id": 777, "start": 7767.04, "end": 7771.04, "text": "Leider ist Ana gerade nicht so wirklich gut dabei."}, {"id": 778, "start": 7779.04, "end": 7781.04, "text": "Jetzt spielen die Junkrat, kann gut sein."}, {"id": 779, "start": 7781.04, "end": 7785.04, "text": "Also es wäre sinnvoll für die Junkrat zu spielen, auf jeden Fall."}, {"id": 780, "start": 7785.04, "end": 7789.04, "text": "Wobei wir ganz gut direkt auf den Spot können."}, {"id": 781, "start": 7789.04, "end": 7792.04, "text": "Ich meine, wir haben hier zwei Dive-Tanks plus ein Genji, also das geht schon."}, {"id": 782, "start": 7792.04, "end": 7808.04, "text": "Übrigens Leute, wir können Deutsch reden, weil es sind alle Deutsch."}, {"id": 783, "start": 7808.04, "end": 7812.04, "text": "Ich hoffe, dass da einer mitkommt."}, {"id": 784, "start": 7812.04, "end": 7818.04, "text": "Nein, fuck!"}, {"id": 785, "start": 7842.04, "end": 7846.04, "text": "Fuck, ich hätte beinahe eine Bombe gehabt."}, {"id": 786, "start": 7846.04, "end": 7848.04, "text": "Ah, wo sind denn alle?"}, {"id": 787, "start": 7866.04, "end": 7868.04, "text": "Fuck, ich hätte beinahe eine Bombe gehabt."}, {"id": 788, "start": 7868.04, "end": 7870.04, "text": "Ah, wo sind denn alle?"}, {"id": 789, "start": 7872.04, "end": 7874.04, "text": "Alle daunen."}, {"id": 790, "start": 7874.04, "end": 7894.04, "text": "Ich spiele ja keinen Junkrat."}, {"id": 791, "start": 7904.04, "end": 7916.04, "text": "Ich hätte es auch gewundert, dass sie keinen Junkrat spielen hätte, hätte ich gedacht."}, {"id": 792, "start": 7916.04, "end": 7918.04, "text": "Haha!"}, {"id": 793, "start": 7922.04, "end": 7924.04, "text": "Leute, Leute!"}, {"id": 794, "start": 7924.04, "end": 7926.04, "text": "Wo sind denn alle hin, auf einmal?"}, {"id": 795, "start": 7932.04, "end": 7934.04, "text": "Ich glaube, die Junkraten sind hier."}, {"id": 796, "start": 7934.04, "end": 7936.04, "text": "Ich glaube, die Junkraten sind hier."}, {"id": 797, "start": 7936.04, "end": 7938.04, "text": "Ich glaube, die Junkraten sind hier."}, {"id": 798, "start": 7938.04, "end": 7940.04, "text": "Ich glaube, die Junkraten sind hier."}, {"id": 799, "start": 7940.04, "end": 7946.04, "text": "Ich glaube, die Junkraten sind hier."}, {"id": 800, "start": 7946.04, "end": 7948.04, "text": "Ich glaube, die Junkraten sind hier."}, {"id": 801, "start": 7948.04, "end": 7950.04, "text": "Ich glaube, die Junkraten sind hier."}, {"id": 802, "start": 7950.04, "end": 7952.04, "text": "Ich glaube, die Junkraten sind hier."}, {"id": 803, "start": 7954.04, "end": 7956.04, "text": "Wo sind denn alle hin, auf einmal?"}, {"id": 804, "start": 7956.04, "end": 7956.34, "text": "III"}, {"id": 805, "start": 7962.04, "end": 7964.04, "text": "Rotock, links."}, {"id": 806, "start": 7964.04, "end": 7968.04, "text": "Left, sein."}, {"id": 807, "start": 7976.04, "end": 7978.04, "text": "Ich dachte, du hast das Gamely installiert."}, {"id": 808, "start": 7978.04, "end": 7980.04, "text": "Done, hatte ich, hatte ich."}, {"id": 809, "start": 7982.04, "end": 7984.04, "text": "cal Do yesterday"}, {"id": 810, "start": 7984.04, "end": 7986.04, "text": "Das letzte Mal wird er gespielt"}, {"id": 811, "start": 7987.28, "end": 7987.78, "text": "Above"}, {"id": 812, "start": 7995.0, "end": 7995.5, "text": "Woah"}, {"id": 813, "start": 7995.5, "end": 8017.5, "text": "Hanzo"}, {"id": 814, "start": 8017.5, "end": 8019.5, "text": "Das Game sieht unbalanced aus"}, {"id": 815, "start": 8019.5, "end": 8026.5, "text": "Ich fand im Attack ging es eigentlich jetzt schon"}, {"id": 816, "start": 8026.5, "end": 8042.5, "text": "Danach mussten wir ein bisschen durchswitchen"}, {"id": 817, "start": 8042.5, "end": 8056.5, "text": "Bam"}, {"id": 818, "start": 8056.5, "end": 8058.5, "text": "Jetzt wird schon mal ein bisschen durch"}, {"id": 819, "start": 8058.5, "end": 8060.5, "text": "Nein nein das ist noch nicht Season 8"}, {"id": 820, "start": 8060.5, "end": 8070.5, "text": "Season 8 geht erst in einer Stunde los"}, {"id": 821, "start": 8070.5, "end": 8084.5, "text": "Da hat er gelasert"}, {"id": 822, "start": 8084.5, "end": 8098.5, "text": "Egal"}, {"id": 823, "start": 8098.5, "end": 8102.5, "text": "Kann ich jetzt? Weiß jemand, wenn ich jetzt Leafgame mache, kommen wir dann wieder in die Lobby?"}, {"id": 824, "start": 8102.5, "end": 8106.5, "text": "Achso, kommen wir in die Lobby"}, {"id": 825, "start": 8106.5, "end": 8112.5, "text": "So, wen haben wir denn hier am Start?"}, {"id": 826, "start": 8112.5, "end": 8118.5, "text": "Den ersten Mal, move, zack"}, {"id": 827, "start": 8118.5, "end": 8119.5, "text": "Kann er mitmachen"}, {"id": 828, "start": 8119.5, "end": 8126.5, "text": "So, ähm, wie movet man denn jetzt Leute?"}, {"id": 829, "start": 8126.5, "end": 8132.5, "text": "Wen moveen wir jetzt mal hier? Divine war ganz gut"}, {"id": 830, "start": 8132.5, "end": 8140.5, "text": "Wir müssen das mal ein bisschen ausbalancen"}, {"id": 831, "start": 8140.5, "end": 8143.5, "text": "Ähm, ich glaube"}, {"id": 832, "start": 8143.5, "end": 8152.5, "text": "Wir switchen mal"}, {"id": 833, "start": 8152.5, "end": 8161.5, "text": "So, was für eine Map wollen wir jetzt spielen? Wir spielen jetzt Maps"}, {"id": 834, "start": 8161.5, "end": 8184.5, "text": "Wir spielen jetzt Attacke und Intuzipi, Hanamura, wirklich, wollen wir wirklich Hanamura spielen, ja?"}, {"id": 835, "start": 8184.5, "end": 8201.5, "text": "Okay, spielen wir Hanamura"}, {"id": 836, "start": 8201.5, "end": 8215.5, "text": "2Cp in 2k 17, 2k 17, 2k 18, lol"}, {"id": 837, "start": 8215.5, "end": 8219.5, "text": "So, wen haben wir denn hier sonst noch?"}, {"id": 838, "start": 8219.5, "end": 8231.5, "text": "Diamond"}, {"id": 839, "start": 8231.5, "end": 8241.5, "text": "Ja, dann switchen wir mal, wir switchen einen von uns"}, {"id": 840, "start": 8241.5, "end": 8249.5, "text": "Switchen wir mal Divine, switchen wir mal mit ihm"}, {"id": 841, "start": 8249.5, "end": 8264.5, "text": "Und"}, {"id": 842, "start": 8264.5, "end": 8272.5, "text": "Ansonsten war der Rest eigentlich Diamond, das müsste eigentlich"}, {"id": 843, "start": 8272.5, "end": 8297.5, "text": "Probieren wir es auch so"}, {"id": 844, "start": 8297.5, "end": 8307.5, "text": "Also direkt passend zum neuen Jahr, der neue Season, also wenn das, wenn das sich deckt mit der Zeit, wo wir eben nachgeguckt haben"}, {"id": 845, "start": 8307.5, "end": 8314.5, "text": "Ich würde schon sagen, da stand doch vorhin 2 Stunden, da war es 22 Uhr, wo wir geguckt haben"}, {"id": 846, "start": 8314.5, "end": 8328.5, "text": "21, das müsste eigentlich genau, genau losgehen um 24 Uhr"}, {"id": 847, "start": 8328.5, "end": 8344.5, "text": "Wicked scheint echt auf Mei zu stehen in Defense, haben wir irgendwas, was ordentlich bisschen bisschen Damage macht?"}, {"id": 848, "start": 8344.5, "end": 8358.5, "text": "So richtig, wir haben Genji, der gerne abgehen, na klar wir haben Xen, der macht auch Damage, aber die Mei muss halt rechte Klicks treffen, gucken wir mal"}, {"id": 849, "start": 8358.5, "end": 8373.5, "text": "Schauen wir mal, wie das läuft"}, {"id": 850, "start": 8373.5, "end": 8377.5, "text": "Crouch spam, wie die Pros"}, {"id": 851, "start": 8377.5, "end": 8401.5, "text": "Klicks alle weg genau"}, {"id": 852, "start": 8401.5, "end": 8405.5, "text": "Wir sind gut, oder?"}, {"id": 853, "start": 8405.5, "end": 8434.5, "text": "Aizuu"}, {"id": 854, "start": 8434.5, "end": 8455.5, "text": "Gucken wir mal, wo die Fahrer lang kommt"}, {"id": 855, "start": 8455.5, "end": 8463.5, "text": "Ding Ding Ding Ding Ding Ding Ding, wo sind die Fahrer?"}, {"id": 856, "start": 8463.5, "end": 8470.5, "text": "Jetzt ist keiner mit gepusht, lol"}, {"id": 857, "start": 8470.5, "end": 8473.5, "text": "Und ich konnte kein Schild mehr setzen, fuck"}, {"id": 858, "start": 8473.5, "end": 8480.5, "text": "Wir haben ne Mercy, egal, egal, die kriegen wir so auf den Sack gerade"}, {"id": 859, "start": 8480.5, "end": 8488.5, "text": "Nice, nice"}, {"id": 860, "start": 8488.5, "end": 8496.5, "text": "Ich bin gleich wieder da"}, {"id": 861, "start": 8496.5, "end": 8525.5, "text": "Alle, immer mein"}, {"id": 862, "start": 8525.5, "end": 8552.5, "text": "Bongos am Start"}, {"id": 863, "start": 8552.5, "end": 8580.5, "text": "So, komm mit rein"}, {"id": 864, "start": 8580.5, "end": 8607.5, "text": "So, komm mit rein"}, {"id": 865, "start": 8607.5, "end": 8630.5, "text": "Ok, das Twitchen hat alleine nicht allzu viel gebracht, jetzt müssen wir glaube ich noch ein bisschen anders durchwechseln"}, {"id": 866, "start": 8630.5, "end": 8637.5, "text": "Wie spricht man einen Twitch-Namen aus, kannst du Wupplos sagen"}, {"id": 867, "start": 8637.5, "end": 8647.5, "text": "Einmal Lucio, immer Lucio"}, {"id": 868, "start": 8647.5, "end": 8665.5, "text": "Im Herz zumindest, Herz93"}, {"id": 869, "start": 8665.5, "end": 8671.5, "text": "Ich mag eigentlich alle Supports, bis auf Mercy, den musst du halt spielen"}, {"id": 870, "start": 8671.5, "end": 8681.5, "text": "Ich mag auch alle Tanks, bloß mit DPS bin ich jetzt erst nicht so gut, außerdem gefallen mir Genji und Tracer vom Playstyle her gar nicht"}, {"id": 871, "start": 8681.5, "end": 8686.5, "text": "Ist einfach nicht meins"}, {"id": 872, "start": 8686.5, "end": 8689.5, "text": "Dummfist auch nicht"}, {"id": 873, "start": 8689.5, "end": 8698.5, "text": "Ich bin eigentlich eher Off-Tank-Support-Main"}, {"id": 874, "start": 8698.5, "end": 8701.5, "text": "Aber Lucio bester"}, {"id": 875, "start": 8701.5, "end": 8709.5, "text": "Ich hoffe es kommt ein Patch, der Mercy mal wieder auf den Boden der Tatsachen zurückholt"}, {"id": 876, "start": 8709.5, "end": 8713.5, "text": "Und das wieder Lucio, Ana, Lucio, Ana bester Support"}, {"id": 877, "start": 8713.5, "end": 8721.5, "text": "Vor allem Ana, Ana ist wenigstens eine der Helden in dem Spiel, wo es noch einen Unterschied macht, ob du es gut spielst oder nicht"}, {"id": 878, "start": 8721.5, "end": 8727.5, "text": "Nicht so wie bei Mercy, wo das, naja, ich will nicht sagen, dass es keinen Unterschied macht"}, {"id": 879, "start": 8727.5, "end": 8731.5, "text": "Aber es ist halt, naja, Mercy halt"}, {"id": 880, "start": 8731.5, "end": 8733.5, "text": "Ist immer nur Schützenpacken"}, {"id": 881, "start": 8733.5, "end": 8740.5, "text": "Jo, jo"}, {"id": 882, "start": 8740.5, "end": 8748.5, "text": "E-Junkrat"}, {"id": 883, "start": 8748.5, "end": 8756.5, "text": "Zu spät"}, {"id": 884, "start": 8756.5, "end": 8769.5, "text": "We wait for Genji, then go"}, {"id": 885, "start": 8769.5, "end": 8785.5, "text": "Das war so nicht geplant glaube ich"}, {"id": 886, "start": 8785.5, "end": 8799.5, "text": "Eine gute Attacke, rekt"}, {"id": 887, "start": 8799.5, "end": 8805.5, "text": "Das war gut, jetzt haben sie sich auf mich konzentriert, es war zwar nicht so geplant, aber rekt"}, {"id": 888, "start": 8805.5, "end": 8808.5, "text": "Schreckt"}, {"id": 889, "start": 8808.5, "end": 8812.5, "text": "Ana Damage Buff war unnötig, ja finde ich auch"}, {"id": 890, "start": 8812.5, "end": 8821.5, "text": "Das Problem ist ja einfach, dass Mercy so OP ist"}, {"id": 891, "start": 8821.5, "end": 8826.5, "text": "Wir sind schneller wieder da"}, {"id": 892, "start": 8826.5, "end": 8852.5, "text": "Volle Pulle"}, {"id": 893, "start": 8852.5, "end": 8862.5, "text": "Was geht mit der Widow ab ey, die will es aber wissen"}, {"id": 894, "start": 8862.5, "end": 8868.5, "text": "Die Widow will es echt wissen"}, {"id": 895, "start": 8868.5, "end": 8875.5, "text": "Das, was wir uns jetzt angucken"}, {"id": 896, "start": 8875.5, "end": 8890.5, "text": "Ein wenig einseitig"}, {"id": 897, "start": 8890.5, "end": 8898.5, "text": "Ich glaube wir müssen noch mal ein bisschen Spieler switchen"}, {"id": 898, "start": 8898.5, "end": 8905.5, "text": "Das war jetzt auch nicht so balanced"}, {"id": 899, "start": 8905.5, "end": 8914.5, "text": "Das ist schwierig, das ist schwierig, wenn man Leute quasi aus allen"}, {"id": 900, "start": 8914.5, "end": 8919.5, "text": "Aus allen Ratings dabei hat"}, {"id": 901, "start": 8919.5, "end": 8921.5, "text": "Das ist schwierig, echt schwierig"}, {"id": 902, "start": 8921.5, "end": 8931.5, "text": "Also wenn noch jemand mitspielen will"}, {"id": 903, "start": 8931.5, "end": 8934.5, "text": "Dann gucken wir, dass wir das jetzt mal ordentlich verteilen"}, {"id": 904, "start": 8934.5, "end": 8936.5, "text": "Ana rage quitten, ja würde ich ja auch"}, {"id": 905, "start": 8936.5, "end": 8938.5, "text": "Aber es ist verdammt schwierig das fair hinzukriegen"}, {"id": 906, "start": 8938.5, "end": 8941.5, "text": "Ich habe jetzt extra schon geguckt, dass wir noch einen Master rüber switchen"}, {"id": 907, "start": 8941.5, "end": 8944.5, "text": "Und wir quasi einen Gold zu uns nehmen"}, {"id": 908, "start": 8944.5, "end": 8953.5, "text": "Was es dann vom Rang her ungefähr gleich macht"}, {"id": 909, "start": 8953.5, "end": 8961.5, "text": "Aber es hat nicht gereicht"}, {"id": 910, "start": 8961.5, "end": 8967.5, "text": "So Balanced Blizzard bestimmt noch seine competitive Games"}, {"id": 911, "start": 8967.5, "end": 8977.5, "text": "Das Gefühl habe ich auch"}, {"id": 912, "start": 8977.5, "end": 9002.5, "text": "Wir haben Gold Gold Plat Diamond glaube ich"}, {"id": 913, "start": 9002.5, "end": 9024.5, "text": "Was für eine Map wollen wir"}, {"id": 914, "start": 9024.5, "end": 9034.5, "text": "Was war Xilent nochmal"}, {"id": 915, "start": 9034.5, "end": 9042.5, "text": "Ja gut, der war Season 3 auch Highmaster"}, {"id": 916, "start": 9042.5, "end": 9045.5, "text": "Ich schätze eine Map aus"}, {"id": 917, "start": 9045.5, "end": 9050.5, "text": "Eichenwalde"}, {"id": 918, "start": 9050.5, "end": 9053.5, "text": "Moment"}, {"id": 919, "start": 9053.5, "end": 9056.5, "text": "Ich muss mal wieder auswählen"}, {"id": 920, "start": 9056.5, "end": 9076.5, "text": "Eichenwald"}, {"id": 921, "start": 9076.5, "end": 9091.5, "text": "So"}, {"id": 922, "start": 9091.5, "end": 9094.5, "text": "Es ist wirklich saumäßig schwierig das zu balancen"}, {"id": 923, "start": 9094.5, "end": 9096.5, "text": "Wir haben halt alles dabei"}, {"id": 924, "start": 9096.5, "end": 9106.5, "text": "Es ist halt im Prinzip von Gold bis Top 500"}, {"id": 925, "start": 9106.5, "end": 9108.5, "text": "Dachte du hast Overwatch deinstalliert"}, {"id": 926, "start": 9108.5, "end": 9115.5, "text": "Hatte ich auch ja"}, {"id": 927, "start": 9115.5, "end": 9117.5, "text": "Hi Kios"}, {"id": 928, "start": 9117.5, "end": 9119.5, "text": "Sprechen wir das überhaupt so aus Kios?"}, {"id": 929, "start": 9119.5, "end": 9123.5, "text": "So wie der Laden der Zeugs verkauft"}, {"id": 930, "start": 9123.5, "end": 9128.5, "text": "Wie geht es Kats FPS ist nicht mehr unter uns"}, {"id": 931, "start": 9128.5, "end": 9141.5, "text": "Wenn du genau was wissen willst kannst du bei mir auf YouTube das letzte Video angucken aus dem Garten"}, {"id": 932, "start": 9141.5, "end": 9146.5, "text": "Easy Clap"}, {"id": 933, "start": 9146.5, "end": 9159.5, "text": "Ich habe das Gefühl meine Voice Activation funktioniert überhaupt nicht richtig"}, {"id": 934, "start": 9159.5, "end": 9163.5, "text": "Was Kios"}, {"id": 935, "start": 9163.5, "end": 9166.5, "text": "Kios"}, {"id": 936, "start": 9166.5, "end": 9172.5, "text": "Verstehe"}, {"id": 937, "start": 9172.5, "end": 9177.5, "text": "Versteht ihr den Voice Chat Ingame? Für mich ist der übelst leise"}, {"id": 938, "start": 9177.5, "end": 9181.5, "text": "Und ich weiß nicht so genau warum"}, {"id": 939, "start": 9181.5, "end": 9197.5, "text": "Hallo, heal please"}, {"id": 940, "start": 9197.5, "end": 9209.5, "text": "Nope"}, {"id": 941, "start": 9209.5, "end": 9213.5, "text": "Fuck"}, {"id": 942, "start": 9213.5, "end": 9216.5, "text": "Du bist all ich bin leise"}, {"id": 943, "start": 9216.5, "end": 9231.5, "text": "Also von meinem Voice ist top"}, {"id": 944, "start": 9231.5, "end": 9241.5, "text": "Es leuchtet blau"}, {"id": 945, "start": 9241.5, "end": 9246.5, "text": "Also Ingame Sound müsste eigentlich okay sein und ich müsste okay sein oder?"}, {"id": 946, "start": 9246.5, "end": 9258.5, "text": "Das einzige was ein bisschen leise ist bei mir ist der Voice von den Leuten"}, {"id": 947, "start": 9258.5, "end": 9260.5, "text": "Kann mich nicht umdrehen"}, {"id": 948, "start": 9260.5, "end": 9274.5, "text": "Vielleicht wenn ich mich umdrehe"}, {"id": 949, "start": 9274.5, "end": 9291.5, "text": "Vielleicht gleich"}, {"id": 950, "start": 9291.5, "end": 9302.5, "text": "Ingame ist zu leise okay Ingame kann ich gleich lauter machen"}, {"id": 951, "start": 9302.5, "end": 9330.5, "text": "Okay"}, {"id": 952, "start": 9330.5, "end": 9341.5, "text": "Achtung Leute"}, {"id": 953, "start": 9341.5, "end": 9349.5, "text": "Ich gucke mal ob ich etwas lauter machen kann"}, {"id": 954, "start": 9349.5, "end": 9357.5, "text": "Okay Game müsste jetzt lauter sein"}, {"id": 955, "start": 9357.5, "end": 9373.5, "text": "Besser"}, {"id": 956, "start": 9373.5, "end": 9382.5, "text": "Moment"}, {"id": 957, "start": 9382.5, "end": 9389.5, "text": "Der hat Earth Shatter, der hat garantiert Earth Shatter"}, {"id": 958, "start": 9389.5, "end": 9404.5, "text": "Das war ein nicer Charge"}, {"id": 959, "start": 9404.5, "end": 9429.5, "text": "Ist der Soldier tot?"}, {"id": 960, "start": 9429.5, "end": 9435.5, "text": "Fuck"}, {"id": 961, "start": 9435.5, "end": 9445.5, "text": "Übelst überforderung pur gerade alles Reinhard"}, {"id": 962, "start": 9445.5, "end": 9458.5, "text": "Ja Reinhard ist halt nicht so unbedingt jetzt beim Aussehen gestellt"}, {"id": 963, "start": 9458.5, "end": 9461.5, "text": "Fuck"}, {"id": 964, "start": 9461.5, "end": 9464.5, "text": "Krasser Shatter"}, {"id": 965, "start": 9464.5, "end": 9473.5, "text": "Ist jetzt Ingame ordentlich von der Lautstärke her"}, {"id": 966, "start": 9473.5, "end": 9489.5, "text": "Ist Ingame Sound okay"}, {"id": 967, "start": 9489.5, "end": 9506.5, "text": "Ja ist okay"}, {"id": 968, "start": 9506.5, "end": 9520.5, "text": "Fuh"}, {"id": 969, "start": 9520.5, "end": 9549.5, "text": "Weil das ziemlich gut ist da kann der Soldier immer so viel reißen"}, {"id": 970, "start": 9549.5, "end": 9553.5, "text": "Fuck"}, {"id": 971, "start": 9553.5, "end": 9560.5, "text": "Alter recken sie uns aber"}, {"id": 972, "start": 9560.5, "end": 9576.5, "text": "10% mehr ich weiß nicht was mit meiner Soundcloud Stärke heute los ist"}, {"id": 973, "start": 9576.5, "end": 9605.5, "text": "Okay"}, {"id": 974, "start": 9605.5, "end": 9607.5, "text": "Watt"}, {"id": 975, "start": 9607.5, "end": 9611.5, "text": "Soll ich mich verarschen"}, {"id": 976, "start": 9611.5, "end": 9615.5, "text": "Kill mich please"}, {"id": 977, "start": 9615.5, "end": 9620.5, "text": "One fight"}, {"id": 978, "start": 9620.5, "end": 9632.5, "text": "Don't die just fight nochmal"}, {"id": 979, "start": 9632.5, "end": 9648.5, "text": "Achtung"}, {"id": 980, "start": 9648.5, "end": 9656.5, "text": "Hilfe"}, {"id": 981, "start": 9656.5, "end": 9667.5, "text": "Also mehr ging gerade echt nicht"}, {"id": 982, "start": 9667.5, "end": 9674.5, "text": "Nice"}, {"id": 983, "start": 9674.5, "end": 9690.5, "text": "23 51 Overwatch ja ja so muss das sein"}, {"id": 984, "start": 9690.5, "end": 9710.5, "text": "Fuck dich Reinhard"}, {"id": 985, "start": 9710.5, "end": 9731.5, "text": "C9"}, {"id": 986, "start": 9731.5, "end": 9747.5, "text": "Hab ich irgendwie gerade meine"}, {"id": 987, "start": 9747.5, "end": 9757.5, "text": "Das ist aber übelst kaputt bei dir das ist ganz merkwürdig"}, {"id": 988, "start": 9757.5, "end": 9766.5, "text": "Grip"}, {"id": 989, "start": 9766.5, "end": 9775.5, "text": "Vor allem in defense jetzt"}, {"id": 990, "start": 9775.5, "end": 9791.5, "text": "No hab ich öberst"}, {"id": 991, "start": 9791.5, "end": 9798.5, "text": "Es oder"}, {"id": 992, "start": 9798.5, "end": 9805.5, "text": "da ist er wieder"}, {"id": 993, "start": 9808.18, "end": 9815.18, "text": "klar"}, {"id": 994, "start": 9815.18, "end": 9822.18, "text": "kommt der Hanzo"}, {"id": 995, "start": 9829.26, "end": 9834.62, "text": "Skatter"}, {"id": 996, "start": 9834.62, "end": 9838.94, "text": "wieso machst du deine Boxen nicht auf?"}, {"id": 997, "start": 9838.94, "end": 9845.94, "text": "ich weiß nicht, ich mach die Winterboxen immer auf"}, {"id": 998, "start": 9849.9, "end": 9856.9, "text": "Hanzo"}, {"id": 999, "start": 9856.9, "end": 9863.9, "text": "Skatter"}, {"id": 1000, "start": 9863.9, "end": 9870.9, "text": "Hanzo"}, {"id": 1001, "start": 9881.98, "end": 9888.98, "text": "das wirst du ja überrannt"}, {"id": 1002, "start": 9888.98, "end": 9895.98, "text": "ich kann aber meine Boxen gleich aufmachen"}, {"id": 1003, "start": 9898.86, "end": 9903.86, "text": "ich muss kurz nach der Runde dann mal 5 Minuten AFK und dann"}, {"id": 1004, "start": 9903.86, "end": 9907.86, "text": "so weit 24 Uhr und so"}, {"id": 1005, "start": 9907.86, "end": 9909.66, "text": "Nope"}, {"id": 1006, "start": 9909.66, "end": 9914.18, "text": "Regroup"}, {"id": 1007, "start": 9914.18, "end": 9916.86, "text": "ich versteck mich bei Jon"}, {"id": 1008, "start": 9916.86, "end": 9923.86, "text": "mein Gott, Volker-Mord"}, {"id": 1009, "start": 9940.14, "end": 9943.9, "text": "schreckt"}, {"id": 1010, "start": 9943.9, "end": 9949.9, "text": "der Hanzo"}, {"id": 1011, "start": 9949.9, "end": 9956.9, "text": "Skatter"}, {"id": 1012, "start": 9979.9, "end": 9986.22, "text": "Nope"}, {"id": 1013, "start": 9986.22, "end": 9993.22, "text": "ich kann ja nicht alleine vor"}, {"id": 1014, "start": 9996.42, "end": 10000.5, "text": "Alter, mach doch mal ein bisschen Damage auf den McCree"}, {"id": 1015, "start": 10000.5, "end": 10003.26, "text": "der McCree muss sterben"}, {"id": 1016, "start": 10003.26, "end": 10010.26, "text": "ausgekaubeut"}, {"id": 1017, "start": 10011.58, "end": 10013.94, "text": "das war"}, {"id": 1018, "start": 10013.94, "end": 10016.02, "text": "Pre-Ulted"}, {"id": 1019, "start": 10016.02, "end": 10023.02, "text": "die Kravathans schon fast"}, {"id": 1020, "start": 10023.02, "end": 10030.02, "text": "nein, da kann man sie nicht dahinter verstecken"}, {"id": 1021, "start": 10033.98, "end": 10037.3, "text": "uns fehlt das Schild"}, {"id": 1022, "start": 10037.3, "end": 10060.3, "text": "habe ich das Gefühl, es fehlt so ein bisschen die Stabilität"}, {"id": 1023, "start": 10060.3, "end": 10062.74, "text": "Alter"}, {"id": 1024, "start": 10062.74, "end": 10069.74, "text": "die Vols aber, wie sie jetzt"}, {"id": 1025, "start": 10070.3, "end": 10077.3, "text": "Fuck, ich kann jetzt nicht switchen, das ist gacke"}, {"id": 1026, "start": 10077.3, "end": 10084.3, "text": "Simple Geometry"}, {"id": 1027, "start": 10084.3, "end": 10091.3, "text": "Sieh nahe"}, {"id": 1028, "start": 10091.3, "end": 10112.3, "text": "So, das ist noch nicht neue Season, nein, nein, das ist Führer Games, hier neue Season ist jetzt gleich"}, {"id": 1029, "start": 10121.3, "end": 10128.3, "text": "so"}, {"id": 1030, "start": 10135.02, "end": 10140.9, "text": "ok, nice, da haben wir jetzt Schluss mit Führer Games und dann machen wir"}, {"id": 1031, "start": 10140.9, "end": 10144.22, "text": "Moment, Minuten, seh ich das richtig"}, {"id": 1032, "start": 10144.22, "end": 10145.22, "text": "oder Sekunden"}, {"id": 1033, "start": 10145.22, "end": 10152.22, "text": "oder dauert die neue Season noch"}, {"id": 1034, "start": 10152.22, "end": 10153.7, "text": "die neue Season dauert noch"}, {"id": 1035, "start": 10153.7, "end": 10176.7, "text": "da fuck, ich bleib mal kurz afk, gleich Führer"}, {"id": 1036, "start": 10183.7, "end": 10213.22, "text": "so Leute, ich wünsche euch alles Gute für 2018"}, {"id": 1037, "start": 10213.22, "end": 10218.22, "text": "übertreibt sie mit irgendwelchen Vorsätzen nicht"}, {"id": 1038, "start": 10218.22, "end": 10221.22, "text": "weil die halten ihr wahrscheinlich eh nicht ein"}, {"id": 1039, "start": 10221.22, "end": 10238.22, "text": "mein Mikro, mein, mein, RZ Spack, Moment"}, {"id": 1040, "start": 10238.22, "end": 10240.22, "text": "so, jetzt ist besser"}, {"id": 1041, "start": 10240.22, "end": 10243.22, "text": "ja, übertreibt sie mit den Vorsätzen nicht"}, {"id": 1042, "start": 10243.22, "end": 10248.22, "text": "und werde Top 500, easy"}, {"id": 1043, "start": 10248.22, "end": 10254.22, "text": "alles Gute Leute"}, {"id": 1044, "start": 10254.22, "end": 10262.22, "text": "so, mein Problem ist jetzt, ich dachte es geht jetzt die neue Season los, aber sie geht gar nicht los, perfekt"}, {"id": 1045, "start": 10262.22, "end": 10275.22, "text": "das heißt, wir können es ja noch mal probieren"}, {"id": 1046, "start": 10275.22, "end": 10280.22, "text": "wollen wir noch ein paar Games machen zusammen, also ich mein wir haben noch eine Stunde Zeit, ne"}, {"id": 1047, "start": 10280.22, "end": 10282.22, "text": "aber Placements mach ich erst morgen"}, {"id": 1048, "start": 10282.22, "end": 10285.22, "text": "also wenn das erst um 1 Uhr nachts los geht, ist mir das zu spät heute"}, {"id": 1049, "start": 10285.22, "end": 10295.22, "text": "da spielen wir ja bis 4 Uhr nachts oder 5 Uhr"}, {"id": 1050, "start": 10295.22, "end": 10308.22, "text": "ist es vielleicht noch offen"}, {"id": 1051, "start": 10308.22, "end": 10315.22, "text": "ist es ein Fake Max Viewer Game"}, {"id": 1052, "start": 10315.22, "end": 10323.22, "text": "ich glaub das ist ein Fake Max Viewer Game gewesen"}, {"id": 1053, "start": 10323.22, "end": 10332.22, "text": "ok, dann machen wir jetzt ein LUL in 2k18"}, {"id": 1054, "start": 10332.22, "end": 10335.22, "text": "also, verscheiden wir Leute LUL in 2k18"}, {"id": 1055, "start": 10335.22, "end": 10343.22, "text": "auf gehts"}, {"id": 1056, "start": 10343.22, "end": 10345.22, "text": "kommen wir einfach noch ein paar Matches zusammen kriegen"}, {"id": 1057, "start": 10345.22, "end": 10350.22, "text": "wenn wir noch ein paar Matches zusammen kriegen"}, {"id": 1058, "start": 10350.22, "end": 10355.22, "text": "dann spielen wir noch ne Runde"}, {"id": 1059, "start": 10355.22, "end": 10382.22, "text": "Rx anschreiben, äh Rx bist du noch im Stream?"}, {"id": 1060, "start": 10382.22, "end": 10385.22, "text": "leider hat mich die neue Season gebaitet"}, {"id": 1061, "start": 10385.22, "end": 10414.22, "text": "ich dachte die geht jetzt los"}, {"id": 1062, "start": 10414.22, "end": 10442.22, "text": "der Valverde ist auch am Start, nice"}, {"id": 1063, "start": 10442.22, "end": 10445.22, "text": "hört ihrs im Hintergrund übrigens?"}, {"id": 1064, "start": 10445.22, "end": 10452.22, "text": "ich mach mal kurz Leute, ich mach mal Fenster auf"}, {"id": 1065, "start": 10452.22, "end": 10461.22, "text": "ziehen wir uns mal die volle Silvester Experience 2k18 rein"}, {"id": 1066, "start": 10461.22, "end": 10468.22, "text": "da gehts ab"}, {"id": 1067, "start": 10468.22, "end": 10475.22, "text": "so, genug Real Life, fertig"}, {"id": 1068, "start": 10475.22, "end": 10487.22, "text": "hat sich ausgerelifed"}, {"id": 1069, "start": 10487.22, "end": 10500.22, "text": "das reicht jetzt auch für Real Life heute"}, {"id": 1070, "start": 10500.22, "end": 10528.22, "text": "ja, ich find auch genug real"}, {"id": 1071, "start": 10528.22, "end": 10543.22, "text": "Feuerwerk in 2k18"}, {"id": 1072, "start": 10543.22, "end": 10545.22, "text": "jetzt drehen sie aber richtig auf da draußen"}, {"id": 1073, "start": 10545.22, "end": 10548.22, "text": "das geht nicht Leute, das ist nicht möglich"}, {"id": 1074, "start": 10548.22, "end": 10550.22, "text": "ich mach jetzt Rollarten runter"}, {"id": 1075, "start": 10550.22, "end": 10560.22, "text": "so viel Real Life, Feuerwerk und ne, das geht nicht"}, {"id": 1076, "start": 10560.22, "end": 10564.22, "text": "wir brauchen jetzt irgendwie passende Musik"}, {"id": 1077, "start": 10564.22, "end": 10573.22, "text": "was macht man da?"}, {"id": 1078, "start": 10573.22, "end": 10585.22, "text": "was 99 Übels angesagt hat, war natürlich Final Countdown"}, {"id": 1079, "start": 10585.22, "end": 10590.22, "text": "das war 99 der Shit, also es ist zwar schon viel älter"}, {"id": 1080, "start": 10590.22, "end": 10607.22, "text": "aber 99 zu 2000, ey, rauf und runter gelaufen"}, {"id": 1081, "start": 10607.22, "end": 10616.22, "text": "das muss sein"}, {"id": 1082, "start": 10616.22, "end": 10629.22, "text": "das muss echt sein"}, {"id": 1083, "start": 10629.22, "end": 10636.22, "text": "50 Milliarden"}, {"id": 1084, "start": 10636.22, "end": 10641.22, "text": "so, einer fehlt noch"}, {"id": 1085, "start": 10641.22, "end": 10645.22, "text": "jetzt fang ich auch schon mit XD an"}, {"id": 1086, "start": 10645.22, "end": 10653.22, "text": "also, Übels ausrasten wir dabei"}, {"id": 1087, "start": 10653.22, "end": 10659.22, "text": "was bei dir zündet eine Autos an?"}, {"id": 1088, "start": 10659.22, "end": 10663.22, "text": "wenn man wirklich eine Autos anzündet, würde ich jetzt mal schon die Polizei rufen"}, {"id": 1089, "start": 10663.22, "end": 10676.22, "text": "ehrlich gesagt"}, {"id": 1090, "start": 10676.22, "end": 10683.22, "text": "oh, jetzt haben wir den ultra krassen GM Genji Main als Gegner"}, {"id": 1091, "start": 10683.22, "end": 10706.22, "text": "ok, auf gehts, go go"}, {"id": 1092, "start": 10706.22, "end": 10722.22, "text": "ahja Leute, immer noch keine Mercy, ne?"}, {"id": 1093, "start": 10722.22, "end": 10736.22, "text": "egal, egal, Posse, wurscht"}, {"id": 1094, "start": 10736.22, "end": 10755.22, "text": "äh, Defend"}, {"id": 1095, "start": 10755.22, "end": 10762.22, "text": "ja, ja, ja, das mach ich, mach ich"}, {"id": 1096, "start": 10762.22, "end": 10776.22, "text": "auch geil, ne? das ist Blizzard Logik"}, {"id": 1097, "start": 10776.22, "end": 10778.22, "text": "ein Stream von Max und eben bei Football, besten Silvester"}, {"id": 1098, "start": 10778.22, "end": 10796.22, "text": "Football, ok"}, {"id": 1099, "start": 10796.22, "end": 10812.22, "text": "das muss ja zur Musik passen"}, {"id": 1100, "start": 10812.22, "end": 10840.22, "text": "was ist das denn?"}, {"id": 1101, "start": 10840.22, "end": 10849.22, "text": "BTF, ey"}, {"id": 1102, "start": 10849.22, "end": 10861.22, "text": "die haben uns zerrissen, schreckt"}, {"id": 1103, "start": 10861.22, "end": 10866.22, "text": "kommen wir nochmal drauf?"}, {"id": 1104, "start": 10866.22, "end": 10890.22, "text": "der Winston, Winston Main kommt jetzt"}, {"id": 1105, "start": 10890.22, "end": 10903.22, "text": "äh, suche Gegner"}, {"id": 1106, "start": 10903.22, "end": 10905.22, "text": "die kann sich ja komplett voll leechen"}, {"id": 1107, "start": 10905.22, "end": 10913.22, "text": "das war so nicht geplant"}, {"id": 1108, "start": 10913.22, "end": 10918.22, "text": "jetzt haben wir kein Schild, fuhu, kein richtiges Schild"}, {"id": 1109, "start": 10918.22, "end": 10921.22, "text": "hat er Gears, Shattered?"}, {"id": 1110, "start": 10921.22, "end": 10924.22, "text": "nice"}, {"id": 1111, "start": 10924.22, "end": 10930.22, "text": "gucken, wo die lang kommen"}, {"id": 1112, "start": 10930.22, "end": 10944.22, "text": "perfekt"}, {"id": 1113, "start": 10944.22, "end": 10961.22, "text": "wo ist denn der Reaper?"}, {"id": 1114, "start": 10961.22, "end": 10983.22, "text": "das war auch hier ein bisschen wasted und gerade"}, {"id": 1115, "start": 10983.22, "end": 10989.22, "text": "bin ich froh, dass wir ohne Mercy spielen"}, {"id": 1116, "start": 10989.22, "end": 10998.22, "text": "das ist einfach der Shit"}, {"id": 1117, "start": 10998.22, "end": 11005.22, "text": "können wir gleich gehen?"}, {"id": 1118, "start": 11005.22, "end": 11022.22, "text": "oh, es lieb"}, {"id": 1119, "start": 11022.22, "end": 11034.22, "text": "Retrub"}, {"id": 1120, "start": 11034.22, "end": 11042.22, "text": "Tracer ist direkt auf Main"}, {"id": 1121, "start": 11042.22, "end": 11065.22, "text": "nein, nein, nein, nein Reinhard"}, {"id": 1122, "start": 11065.22, "end": 11081.22, "text": "was in beiden Teams?"}, {"id": 1123, "start": 11081.22, "end": 11093.22, "text": "ich hab gleich Ulti, ich kann aber noch nicht rein"}, {"id": 1124, "start": 11093.22, "end": 11102.22, "text": "dafuck"}, {"id": 1125, "start": 11102.22, "end": 11111.22, "text": "E-Ax, E-Ax, mach so platt"}, {"id": 1126, "start": 11111.22, "end": 11130.22, "text": "das Schlimme ist noch zuzuschauen, ja das stimmt"}, {"id": 1127, "start": 11130.22, "end": 11156.22, "text": "ne, nix mehr"}, {"id": 1128, "start": 11156.22, "end": 11166.22, "text": "die sind aber echt tough, die sind aber echt geil auf mich"}, {"id": 1129, "start": 11166.22, "end": 11175.22, "text": "die sind echt mega geil auf mich"}, {"id": 1130, "start": 11175.22, "end": 11188.22, "text": "was haben wir denn, wir haben eine D.Va, wir haben eine Ana"}, {"id": 1131, "start": 11188.22, "end": 11191.22, "text": "das kann ganz gut klappen jetzt"}, {"id": 1132, "start": 11191.22, "end": 11206.22, "text": "das Problem, dass ich Zarya schon wieder einmal ewig nicht gespielt habe"}, {"id": 1133, "start": 11206.22, "end": 11224.22, "text": "ein bisschen style"}, {"id": 1134, "start": 11224.22, "end": 11250.22, "text": "oh, oh, oh"}, {"id": 1135, "start": 11250.22, "end": 11257.22, "text": "das hat uns jetzt zerrissen"}, {"id": 1136, "start": 11257.22, "end": 11275.22, "text": "aber es ist relativ balanced, 29 Sekunden ist okay"}, {"id": 1137, "start": 11275.22, "end": 11301.22, "text": "was haben wir denn jetzt gescheit, ich würde ja normalerweise sagen Winston"}, {"id": 1138, "start": 11301.22, "end": 11323.22, "text": "das ist ganz okay, total gemischt von den Ranks"}, {"id": 1139, "start": 11323.22, "end": 11352.22, "text": "diesmal ist wirklich, das hast du ja selten, von Bronze bis Top 500, alles dabei"}, {"id": 1140, "start": 11352.22, "end": 11366.22, "text": "E-Ax ist Top 500"}, {"id": 1141, "start": 11366.22, "end": 11373.22, "text": "also unsere Ana"}, {"id": 1142, "start": 11373.22, "end": 11382.22, "text": "achja Meurer Orbs geben ja keinen Charge habe ich ja vergessen"}, {"id": 1143, "start": 11382.22, "end": 11396.22, "text": "auf Jump"}, {"id": 1144, "start": 11396.22, "end": 11416.22, "text": "wo ist die fucking Widow da oben"}, {"id": 1145, "start": 11416.22, "end": 11429.22, "text": "da darfst du nicht zu lange rumfackeln"}, {"id": 1146, "start": 11429.22, "end": 11446.22, "text": "ich kann da nicht als einziger rein, das geht noch nicht"}, {"id": 1147, "start": 11446.22, "end": 11456.22, "text": "jetzt werden sie geschreckt"}, {"id": 1148, "start": 11456.22, "end": 11463.22, "text": "so muss das sein"}, {"id": 1149, "start": 11463.22, "end": 11480.22, "text": "weggeboxt von Zarya in 2k18"}, {"id": 1150, "start": 11480.22, "end": 11494.22, "text": "die Leute in Gameboy Chat ist so leise"}, {"id": 1151, "start": 11494.22, "end": 11502.22, "text": "braune Schild"}, {"id": 1152, "start": 11502.22, "end": 11505.22, "text": "ich muss zu unserem Winston Winston Winston"}, {"id": 1153, "start": 11505.22, "end": 11508.22, "text": "ja auf rein rein rein rein"}, {"id": 1154, "start": 11508.22, "end": 11514.22, "text": "ich kann halt alleine rein"}, {"id": 1155, "start": 11514.22, "end": 11525.22, "text": "wo ist denn der Winston jetzt, weg"}, {"id": 1156, "start": 11525.22, "end": 11538.22, "text": "fuck die Schild ist gleichzeitig gedrückt, Loops Zarya"}, {"id": 1157, "start": 11538.22, "end": 11540.22, "text": "man muss direkt, muss sich direkt rumtrennen was machen"}, {"id": 1158, "start": 11540.22, "end": 11553.22, "text": "vor allem wenn vorne nichts ist"}, {"id": 1159, "start": 11553.22, "end": 11561.22, "text": "oh die Balls geben jetzt was"}, {"id": 1160, "start": 11561.22, "end": 11570.22, "text": "komm ich muss dir Schild geben alter"}, {"id": 1161, "start": 11570.22, "end": 11587.22, "text": "card"}, {"id": 1162, "start": 11587.22, "end": 11597.22, "text": "wat"}, {"id": 1163, "start": 11597.22, "end": 11604.22, "text": "ok das war jetzt vielleicht ein bisschen übertrieben die Craft"}, {"id": 1164, "start": 11604.22, "end": 11615.22, "text": "fu was haben wir da"}, {"id": 1165, "start": 11615.22, "end": 11627.22, "text": "Prost Neues, ja wünsche ich euch auch ein"}, {"id": 1166, "start": 11627.22, "end": 11648.22, "text": "Prost Neues"}, {"id": 1167, "start": 11648.22, "end": 11673.22, "text": "ich muss das wieder um"}, {"id": 1168, "start": 11673.22, "end": 11691.22, "text": "Spies Kill, jawoll"}, {"id": 1169, "start": 11691.22, "end": 11698.22, "text": "der Batman ist raus"}, {"id": 1170, "start": 11698.22, "end": 11712.22, "text": "was ist der da gestorben"}, {"id": 1171, "start": 11712.22, "end": 11741.22, "text": "back back back"}, {"id": 1172, "start": 11741.22, "end": 11756.22, "text": "muss ich die wieder auf"}, {"id": 1173, "start": 11756.22, "end": 11771.22, "text": "schieb weiter"}, {"id": 1174, "start": 11771.22, "end": 11790.22, "text": "weg weg weg weg"}, {"id": 1175, "start": 11790.22, "end": 11818.22, "text": "was haben wir wo ist, Braune Schild Schild Schild"}, {"id": 1176, "start": 11818.22, "end": 11846.22, "text": "nein nein nein nein nein"}, {"id": 1177, "start": 11846.22, "end": 11853.22, "text": "so nicht so nicht"}, {"id": 1178, "start": 11853.22, "end": 11862.22, "text": "Meuer ist so cancer zu hitten ey"}, {"id": 1179, "start": 11862.22, "end": 11888.22, "text": "jawoll"}, {"id": 1180, "start": 11888.22, "end": 11915.22, "text": "ein Scherz Zarya ganz gut funktioniert"}, {"id": 1181, "start": 11915.22, "end": 11923.22, "text": "ich bin gerade dabei mich ein bisschen auf das Game zu konzentrieren"}, {"id": 1182, "start": 11923.22, "end": 11931.22, "text": "aber wisst ihr was man hier an schön sieht dass es egal ist erstmal was du für einen Rank hast"}, {"id": 1183, "start": 11931.22, "end": 11937.22, "text": "du musst im Team spielen wollen das war jetzt mit Sicherheit nicht die Vollendung des Teamplays"}, {"id": 1184, "start": 11937.22, "end": 11949.22, "text": "gucken dass ich mal unseren Chat lauter kriegt das ist doch der Witz der First Agonix"}, {"id": 1185, "start": 11949.22, "end": 11975.22, "text": "ich weiß nicht wie das geht"}, {"id": 1186, "start": 11975.22, "end": 12001.22, "text": "ich weiß nicht wie das geht"}, {"id": 1187, "start": 12001.22, "end": 12015.22, "text": "Alter"}, {"id": 1188, "start": 12015.22, "end": 12035.22, "text": "müsste ein Fight halten oder zwei"}, {"id": 1189, "start": 12035.22, "end": 12046.22, "text": "ja Torb ist"}, {"id": 1190, "start": 12046.22, "end": 12063.22, "text": "als der mage"}, {"id": 1191, "start": 12063.22, "end": 12083.22, "text": "mal gucken geht ja erst in halb stunde los"}, {"id": 1192, "start": 12083.22, "end": 12100.22, "text": "mal so wenig spielen ich fühle mich mit den meisten hellen übelst unsicher gerade das ist der wahnsinn deswegen ist gut dass wir hier so ein bisschen matches spielen wo es im Endeffekt Komplex geht"}, {"id": 1193, "start": 12100.22, "end": 12118.22, "text": "ein Stückchen zurück klar wenn die kommen"}, {"id": 1194, "start": 12118.22, "end": 12128.22, "text": "zurück ein bisschen rein"}, {"id": 1195, "start": 12128.22, "end": 12131.22, "text": "zurück"}, {"id": 1196, "start": 12131.22, "end": 12133.22, "text": "immer noch halb"}, {"id": 1197, "start": 12133.22, "end": 12137.22, "text": "da müssen wir mit mehreren leuten da hin"}, {"id": 1198, "start": 12137.22, "end": 12148.22, "text": "du kommst nicht weg"}, {"id": 1199, "start": 12148.22, "end": 12161.22, "text": "scheiße"}, {"id": 1200, "start": 12161.22, "end": 12177.22, "text": "es war überhaupt es war überhaupt nicht notwendig dahinter zu gehen"}, {"id": 1201, "start": 12177.22, "end": 12179.22, "text": "0 3D"}, {"id": 1202, "start": 12179.22, "end": 12195.22, "text": "was RIP Ears warum"}, {"id": 1203, "start": 12195.22, "end": 12207.22, "text": "so ich muss mal gucken wie ich den Voice Chat lauter krieg"}, {"id": 1204, "start": 12207.22, "end": 12226.22, "text": "alles laut Fuck geschrien hast du okay"}, {"id": 1205, "start": 12226.22, "end": 12249.22, "text": "es geht mit der Musik jetzt ab"}, {"id": 1206, "start": 12249.22, "end": 12270.22, "text": "spielt mal king of the hill ja das können wir machen"}, {"id": 1207, "start": 12270.22, "end": 12282.22, "text": "es geht mit der ersten"}, {"id": 1208, "start": 12282.22, "end": 12309.22, "text": "es geht mit der ersten"}, {"id": 1209, "start": 12309.22, "end": 12337.22, "text": "es geht mit der ersten"}, {"id": 1210, "start": 12337.22, "end": 12343.22, "text": "Okay, jetzt habt ihr wenigstens auch ein Bronze-Silber-Spieler, da ist das wieder ein bisschen fairer."}, {"id": 1211, "start": 12343.22, "end": 12362.22, "text": "Wieso? Wir haben auch ein Bronze-Spieler, das ist überhaupt kein Ding."}, {"id": 1212, "start": 12373.22, "end": 12398.22, "text": "Ja, jetzt bist du wieder da."}, {"id": 1213, "start": 12398.22, "end": 12415.22, "text": "Ja, wünsche ich dir auch, Yoni-Backslash."}, {"id": 1214, "start": 12415.22, "end": 12438.22, "text": "Das ist super, was geheim zu halten, wenn man in den Chat schreibt und ich streame."}, {"id": 1215, "start": 12445.22, "end": 12474.22, "text": "Was hört sich besser an?"}, {"id": 1216, "start": 12474.22, "end": 12477.22, "text": "2K 16 oder 2K 18?"}, {"id": 1217, "start": 12477.22, "end": 12481.22, "text": "2K 17."}, {"id": 1218, "start": 12481.22, "end": 12489.22, "text": "Eigentlich hört sich dieses ganze 2K irgendwie fast richtig hängen geblieben an."}, {"id": 1219, "start": 12489.22, "end": 12492.22, "text": "Aber ich hab mich da mittlerweile so dran gewöhnt."}, {"id": 1220, "start": 12492.22, "end": 12500.22, "text": "Na dann, rufen wir ihn mal. Easy, kannste mitspielen."}, {"id": 1221, "start": 12500.22, "end": 12507.22, "text": "Kein Bock oder was? Null."}, {"id": 1222, "start": 12507.22, "end": 12528.22, "text": "Was war denn das?"}, {"id": 1223, "start": 12528.22, "end": 12547.22, "text": "So, auf geht's."}, {"id": 1224, "start": 12547.22, "end": 12555.22, "text": "Ja, du bist wieder da, oder? Ich vermute mal."}, {"id": 1225, "start": 12555.22, "end": 12560.22, "text": "Ich geh mal davon aus, dass du wieder da bist."}, {"id": 1226, "start": 12560.22, "end": 12564.22, "text": "Hoffentlich mal zumindest."}, {"id": 1227, "start": 12564.22, "end": 12567.22, "text": "Da ist er doch, easy."}, {"id": 1228, "start": 12567.22, "end": 12577.22, "text": "Jetzt kannst du mal wieder meine Lucio-Skills hier rausholen."}, {"id": 1229, "start": 12577.22, "end": 12581.22, "text": "Mega, kein Mei, bitte."}, {"id": 1230, "start": 12581.22, "end": 12585.22, "text": "Das ist voll 2016."}, {"id": 1231, "start": 12585.22, "end": 12601.22, "text": "Das ist Beta."}, {"id": 1232, "start": 12601.22, "end": 12615.22, "text": "Ja, ja, die Wand ist voll Evolution-mäßig. EA-like."}, {"id": 1233, "start": 12615.22, "end": 12626.22, "text": "Es ist jetzt übrigens, ist der Chat lauter?"}, {"id": 1234, "start": 12626.22, "end": 12641.22, "text": "Das ist der äußerst gewöhnungsbedürftige Teamkomp, die wir hier haben."}, {"id": 1235, "start": 12641.22, "end": 12644.22, "text": "Man versteht die Leute jetzt, oh, immerhin."}, {"id": 1236, "start": 12644.22, "end": 12654.22, "text": "Ja, ich hab das gefunden. Irgendwie stand das auf 3%."}, {"id": 1237, "start": 12654.22, "end": 12677.22, "text": "Hinter dir, Anna, hinter dir."}, {"id": 1238, "start": 12677.22, "end": 12692.22, "text": "Ich hab Schiss."}, {"id": 1239, "start": 12692.22, "end": 12719.22, "text": "Ich kann wenig dagegen machen gerade, wir müssen drauf."}, {"id": 1240, "start": 12719.22, "end": 12732.22, "text": "Der steht da noch drin."}, {"id": 1241, "start": 12732.22, "end": 12734.22, "text": "Ich brauch Heal, Max."}, {"id": 1242, "start": 12734.22, "end": 12742.22, "text": "Ja, ich komm hinter."}, {"id": 1243, "start": 12742.22, "end": 12751.22, "text": "Die sind viel zu gesplattet."}, {"id": 1244, "start": 12751.22, "end": 12765.22, "text": "Die sind mega gesplattet."}, {"id": 1245, "start": 12765.22, "end": 12789.22, "text": "Wir sind auf dem Spot."}, {"id": 1246, "start": 12789.22, "end": 12791.22, "text": "Schieß dem Pferd in den Arsch."}, {"id": 1247, "start": 12791.22, "end": 12795.22, "text": "Was?"}, {"id": 1248, "start": 12795.22, "end": 12797.22, "text": "Tschüss."}, {"id": 1249, "start": 12797.22, "end": 12803.22, "text": "Huge Play."}, {"id": 1250, "start": 12803.22, "end": 12822.22, "text": "Nee, Doomfist, so nicht."}, {"id": 1251, "start": 12822.22, "end": 12848.22, "text": "Wie um alles in der Welt haben wir das gewonnen."}, {"id": 1252, "start": 12848.22, "end": 12858.22, "text": "Huge Plays."}, {"id": 1253, "start": 12858.22, "end": 12862.22, "text": "Da waren aber ein paar ganz gute Lucio Plays dabei."}, {"id": 1254, "start": 12862.22, "end": 12873.22, "text": "Lucio flutscht noch."}, {"id": 1255, "start": 12873.22, "end": 12892.22, "text": "Er ist kein Healer."}, {"id": 1256, "start": 12892.22, "end": 12919.22, "text": "Hab ich das Gefühl, oder wird die Musik immer lauter gerade?"}, {"id": 1257, "start": 12919.22, "end": 12943.22, "text": "Ich hab das Gefühl, ich hab das Gefühl, ich hab das Gefühl."}, {"id": 1258, "start": 12943.22, "end": 12970.22, "text": "Ich hab das Gefühl, ich hab das Gefühl, ich hab das Gefühl, ich hab das Gefühl."}, {"id": 1259, "start": 12970.22, "end": 12989.22, "text": "Ich hab das Gefühl, ich hab das Gefühl, ich hab das Gefühl, ich hab das Gefühl."}, {"id": 1260, "start": 12989.22, "end": 13001.22, "text": "Ich hab das Gefühl, ich hab das Gefühl."}, {"id": 1261, "start": 13001.22, "end": 13020.22, "text": "Nein."}, {"id": 1262, "start": 13020.22, "end": 13024.22, "text": "Deswegen ist Lucio nice."}, {"id": 1263, "start": 13024.22, "end": 13049.22, "text": "Ich hab gleich Ulf hier."}, {"id": 1264, "start": 13049.22, "end": 13074.22, "text": "Spot."}, {"id": 1265, "start": 13074.22, "end": 13077.22, "text": "Massive G-Baited."}, {"id": 1266, "start": 13077.22, "end": 13104.22, "text": "Ich war's nett."}, {"id": 1267, "start": 13104.22, "end": 13132.22, "text": "Alter, das ist ja echt mal anstrengend."}, {"id": 1268, "start": 13132.22, "end": 13135.22, "text": "Das war aber echt ein Lucio-Gameplay, was man eigentlich aufnehmen könnte."}, {"id": 1269, "start": 13135.22, "end": 13148.22, "text": "Ich teilweise hatte da ein paar nice Sachen."}, {"id": 1270, "start": 13148.22, "end": 13151.22, "text": "Ding. Ding."}, {"id": 1271, "start": 13151.22, "end": 13157.22, "text": "Oder auch nicht."}, {"id": 1272, "start": 13157.22, "end": 13184.22, "text": "Was war denn jetzt für eine Map?"}, {"id": 1273, "start": 13184.22, "end": 13198.22, "text": "Da mohten Max Eiskalt für sich selber, ja."}, {"id": 1274, "start": 13198.22, "end": 13214.22, "text": "Ich wusste, ich wusste einfach, er hat so den Fingern gejoggt."}, {"id": 1275, "start": 13214.22, "end": 13229.22, "text": "Das kann man machen."}, {"id": 1276, "start": 13229.22, "end": 13231.22, "text": "Yoshi wäre ich auch für."}, {"id": 1277, "start": 13231.22, "end": 13239.22, "text": "Sie sollten sich mal, sie sollten sich endlich mal ihren Scheiß zusammenkriegen und Demoman Peak in Overwatch einbauen."}, {"id": 1278, "start": 13239.22, "end": 13259.22, "text": "Ich bin so fort dabei."}, {"id": 1279, "start": 13259.22, "end": 13265.22, "text": "Ich spiele bestimmt Genji."}, {"id": 1280, "start": 13265.22, "end": 13274.22, "text": "Ich habe jetzt gestream sniped."}, {"id": 1281, "start": 13274.22, "end": 13276.22, "text": "Warum spielst du nicht mehr mit deinem Main?"}, {"id": 1282, "start": 13276.22, "end": 13279.22, "text": "Weil ich es seit Season 3 nicht mehr gespielt habe."}, {"id": 1283, "start": 13279.22, "end": 13290.22, "text": "Ich dachte mir, ich mache meinen einfachen neuen Account, weil ich das Game eh wieder zu großen Teilen, zumindest auf halbwegs anständigem Level wieder lernen muss."}, {"id": 1284, "start": 13290.22, "end": 13293.22, "text": "Neuer Account."}, {"id": 1285, "start": 13293.22, "end": 13296.22, "text": "Ist das das mit der Brücke, das ist das mit der Brücke."}, {"id": 1286, "start": 13296.22, "end": 13300.22, "text": "Da ist Reinhardt vielleicht."}, {"id": 1287, "start": 13300.22, "end": 13306.22, "text": "Da wäre so eine D.Va besser, weil Reinhardt fliegt mir hier ganz gerne mal runter gegen die Fahrer."}, {"id": 1288, "start": 13306.22, "end": 13315.22, "text": "Ja, genau wie es dir eher gesagt, so ist es."}, {"id": 1289, "start": 13315.22, "end": 13342.22, "text": "Oder doch keine Fahrer oder doch nicht."}, {"id": 1290, "start": 13342.22, "end": 13345.22, "text": "Schadenquats."}, {"id": 1291, "start": 13345.22, "end": 13348.22, "text": "Keine, da geht gerade nicht viel."}, {"id": 1292, "start": 13348.22, "end": 13350.22, "text": "Er wünscht dir auch Kommenze."}, {"id": 1293, "start": 13350.22, "end": 13351.22, "text": "Kommenze?"}, {"id": 1294, "start": 13351.22, "end": 13352.22, "text": "Common Sense."}, {"id": 1295, "start": 13352.22, "end": 13353.22, "text": "Kommenze."}, {"id": 1296, "start": 13353.22, "end": 13358.22, "text": "Kommenze hast du mir auch nicht gehört."}, {"id": 1297, "start": 13358.22, "end": 13366.22, "text": "Regroupen."}, {"id": 1298, "start": 13366.22, "end": 13369.22, "text": "Regrouporn."}, {"id": 1299, "start": 13369.22, "end": 13390.22, "text": "Pusht rein, pusht rein."}, {"id": 1300, "start": 13390.22, "end": 13396.22, "text": "Ist hier noch was?"}, {"id": 1301, "start": 13396.22, "end": 13398.22, "text": "Nicht overextenden."}, {"id": 1302, "start": 13398.22, "end": 13412.22, "text": "Ah ja, chill, chill, chill."}, {"id": 1303, "start": 13412.22, "end": 13413.22, "text": "Willst du reinspringen, Mann?"}, {"id": 1304, "start": 13413.22, "end": 13417.22, "text": "Ja."}, {"id": 1305, "start": 13417.22, "end": 13431.22, "text": "Double Allpower."}, {"id": 1306, "start": 13431.22, "end": 13441.22, "text": "Komm zu mir, wenn du hier brauchst."}, {"id": 1307, "start": 13441.22, "end": 13457.22, "text": "Next XQC hier."}, {"id": 1308, "start": 13457.22, "end": 13460.22, "text": "Irgendwas lebt."}, {"id": 1309, "start": 13460.22, "end": 13462.22, "text": "Ich glaube, pushen die links?"}, {"id": 1310, "start": 13462.22, "end": 13464.22, "text": "Etwas."}, {"id": 1311, "start": 13464.22, "end": 13472.22, "text": "Ja."}, {"id": 1312, "start": 13472.22, "end": 13475.22, "text": "Nein, die müssen pumpen."}, {"id": 1313, "start": 13475.22, "end": 13483.22, "text": "Der hat Earth Shatter, der kokt schon so."}, {"id": 1314, "start": 13483.22, "end": 13500.22, "text": "Haha."}, {"id": 1315, "start": 13500.22, "end": 13505.22, "text": "Nein, nein, nein."}, {"id": 1316, "start": 13505.22, "end": 13514.22, "text": "Das sei auf dem..."}, {"id": 1317, "start": 13514.22, "end": 13516.22, "text": "Asphania."}, {"id": 1318, "start": 13516.22, "end": 13517.22, "text": "Gold Damage."}, {"id": 1319, "start": 13517.22, "end": 13518.22, "text": "Gold Damage, Leute."}, {"id": 1320, "start": 13518.22, "end": 13519.22, "text": "Gold."}, {"id": 1321, "start": 13519.22, "end": 13535.22, "text": "Tristan Place."}, {"id": 1322, "start": 13535.22, "end": 13540.22, "text": "Egal, ob Nano boostet oder nicht."}, {"id": 1323, "start": 13540.22, "end": 13544.22, "text": "Ja, Yoshi, manchmal rage man einfach."}, {"id": 1324, "start": 13544.22, "end": 13553.22, "text": "Sag noch mal bitte, ich hab's nicht verstanden."}, {"id": 1325, "start": 13553.22, "end": 13554.22, "text": "Ich guck mal."}, {"id": 1326, "start": 13554.22, "end": 13555.22, "text": "Könnte sein, dass der geswitcht hat."}, {"id": 1327, "start": 13555.22, "end": 13558.22, "text": "Lass mal gucken."}, {"id": 1328, "start": 13558.22, "end": 13562.22, "text": "Wir haben den Shunk."}, {"id": 1329, "start": 13562.22, "end": 13565.22, "text": "Die lauschen im Stream, das kannst du nicht machen."}, {"id": 1330, "start": 13565.22, "end": 13568.22, "text": "Das nie, der Streamsnipe ist real, ja."}, {"id": 1331, "start": 13568.22, "end": 13571.22, "text": "Heimlich lauschen."}, {"id": 1332, "start": 13571.22, "end": 13573.22, "text": "Irgendwas puffen."}, {"id": 1333, "start": 13573.22, "end": 13576.22, "text": "Ihr müsst aus dem Chalk raus."}, {"id": 1334, "start": 13576.22, "end": 13585.22, "text": "Geht aus dem Chalk raus, geht einfach."}, {"id": 1335, "start": 13585.22, "end": 13591.22, "text": "Tracer swebt hinten bei mir."}, {"id": 1336, "start": 13591.22, "end": 13602.22, "text": "Ich war ein bisschen zu schnell, sorry."}, {"id": 1337, "start": 13602.22, "end": 13604.22, "text": "Ich kann euch im Chalk wieder heilen."}, {"id": 1338, "start": 13604.22, "end": 13614.22, "text": "Ja, ja, ich komm wieder weg."}, {"id": 1339, "start": 13614.22, "end": 13616.22, "text": "Lass die mal poschen, ich bin oben."}, {"id": 1340, "start": 13616.22, "end": 13624.22, "text": "Geht aus dem Chalk weg, bitte."}, {"id": 1341, "start": 13624.22, "end": 13637.22, "text": "Der Creel, rechte Seite, allein."}, {"id": 1342, "start": 13637.22, "end": 13646.22, "text": "Villain."}, {"id": 1343, "start": 13646.22, "end": 13648.22, "text": "Fuck."}, {"id": 1344, "start": 13648.22, "end": 13651.22, "text": "Der hat mir mitpushen müssen, hat alle mitpushen müssen."}, {"id": 1345, "start": 13651.22, "end": 13662.22, "text": "Nein, halb."}, {"id": 1346, "start": 13662.22, "end": 13677.22, "text": "Der holt es hier."}, {"id": 1347, "start": 13677.22, "end": 13692.22, "text": "Tanks links, tanks links."}, {"id": 1348, "start": 13692.22, "end": 13698.22, "text": "Ich hab gedacht, ich kann aus der Tür rauskicken."}, {"id": 1349, "start": 13698.22, "end": 13702.22, "text": "Das hat nicht funktioniert."}, {"id": 1350, "start": 13702.22, "end": 13717.22, "text": "Hundert pro."}, {"id": 1351, "start": 13717.22, "end": 13726.22, "text": "Sleeps."}, {"id": 1352, "start": 13726.22, "end": 13736.22, "text": "Der Gengu ist da tot."}, {"id": 1353, "start": 13736.22, "end": 13744.22, "text": "Irgendwie sind die Matches lustigerweise nicht so knapp, wie ich gedacht hätte."}, {"id": 1354, "start": 13744.22, "end": 13763.22, "text": "Jetzt kommt es, jetzt kommt es."}, {"id": 1355, "start": 13763.22, "end": 13770.22, "text": "Okay, machen wir noch eins."}, {"id": 1356, "start": 13770.22, "end": 13774.22, "text": "Man hätte ja sagen können, dass jetzt alle gleich Placements suchen wollen."}, {"id": 1357, "start": 13774.22, "end": 13776.22, "text": "Also ich mach die Placements morgen."}, {"id": 1358, "start": 13776.22, "end": 13780.22, "text": "Also Jax, falls du gerade Stream guckst, bis hier heute,"}, {"id": 1359, "start": 13780.22, "end": 13794.22, "text": "kannst du keine Placements mehr gebacken."}, {"id": 1360, "start": 13794.22, "end": 13802.22, "text": "Jetzt ist er raus, okay."}, {"id": 1361, "start": 13802.22, "end": 13806.22, "text": "Naja, wenn er lief, dann kann ich ihn auch nicht ins andere Team switchen."}, {"id": 1362, "start": 13806.22, "end": 13808.22, "text": "Ah, nice, okay, easy."}, {"id": 1363, "start": 13808.22, "end": 13814.22, "text": "Was haben wir jetzt noch für ein Land gekriegt?"}, {"id": 1364, "start": 13814.22, "end": 13817.22, "text": "Einen..."}, {"id": 1365, "start": 13817.22, "end": 13822.22, "text": "einen Diamond Player."}, {"id": 1366, "start": 13822.22, "end": 13824.22, "text": "Map machen wir."}, {"id": 1367, "start": 13824.22, "end": 13827.22, "text": "Spielen wir jetzt mal."}, {"id": 1368, "start": 13827.22, "end": 13829.22, "text": "Dorado, Dorado."}, {"id": 1369, "start": 13829.22, "end": 13855.22, "text": "Beste Map."}, {"id": 1370, "start": 13855.22, "end": 13858.22, "text": "Also von den Rängen her sollte es relativ ausgeglichen sein."}, {"id": 1371, "start": 13858.22, "end": 13861.22, "text": "Das Gegner hat Master, Master Diamonds."}, {"id": 1372, "start": 13861.22, "end": 13864.22, "text": "Wir haben Bronze, Master."}, {"id": 1373, "start": 13864.22, "end": 13865.22, "text": "Okay, ja gut, wir haben den Jax."}, {"id": 1374, "start": 13865.22, "end": 13874.22, "text": "Da, der rechte alle."}, {"id": 1375, "start": 13874.22, "end": 13878.22, "text": "Wie die Musik abgeht."}, {"id": 1376, "start": 13878.22, "end": 13893.22, "text": "So, das jetzt."}, {"id": 1377, "start": 13893.22, "end": 13896.22, "text": "Hast du eigentlich Plants vs. Zombies gefinished?"}, {"id": 1378, "start": 13896.22, "end": 13903.22, "text": "Nein."}, {"id": 1379, "start": 13903.22, "end": 13905.22, "text": "Ich hab BDO gekreint."}, {"id": 1380, "start": 13905.22, "end": 13910.22, "text": "Warum gucken mir eigentlich 100 Leute zu jetzt schon die ganze Zeit?"}, {"id": 1381, "start": 13910.22, "end": 13934.22, "text": "Also, irgendwie gibt es noch mehr No-Life-Leute, habe ich das Gefühl."}, {"id": 1382, "start": 13934.22, "end": 13948.22, "text": "Yoshi, du guckst, seit du 13 bist."}, {"id": 1383, "start": 13948.22, "end": 13950.22, "text": "Ja gut, ja gut, klar."}, {"id": 1384, "start": 13950.22, "end": 13952.22, "text": "Natürlich kann es schon sein."}, {"id": 1385, "start": 13952.22, "end": 13968.22, "text": "Ja, easy."}, {"id": 1386, "start": 13968.22, "end": 13986.22, "text": "Lass mal runter."}, {"id": 1387, "start": 13986.22, "end": 13989.22, "text": "Äh."}, {"id": 1388, "start": 13989.22, "end": 13991.22, "text": "Alles, alles..."}, {"id": 1389, "start": 13991.22, "end": 13995.22, "text": "verreckt."}, {"id": 1390, "start": 13995.22, "end": 14003.22, "text": "Was haben die denn? Was kann ich denn spielen?"}, {"id": 1391, "start": 14003.22, "end": 14007.22, "text": "Nein, wir, wir contesten eh nicht nochmal."}, {"id": 1392, "start": 14007.22, "end": 14008.22, "text": "Moment, wir haben einen Reinhardt jetzt?"}, {"id": 1393, "start": 14008.22, "end": 14010.22, "text": "Hatten wir schon die ganze Zeit einen Reinhardt?"}, {"id": 1394, "start": 14010.22, "end": 14011.22, "text": "Hatten wir schon die ganze Zeit einen Reinhardt?"}, {"id": 1395, "start": 14011.22, "end": 14016.22, "text": "Das ist ziemlich bescheuert, dass ich Orissa genommen habe."}, {"id": 1396, "start": 14016.22, "end": 14045.22, "text": "Ich muss noch ein Stückchen an die Ecke."}, {"id": 1397, "start": 14045.22, "end": 14052.22, "text": "Jetzt haben wir das Schild des Todes hier am Start."}, {"id": 1398, "start": 14052.22, "end": 14054.22, "text": "Ein Stückchen zurück."}, {"id": 1399, "start": 14054.22, "end": 14056.22, "text": "Lass nicht direkt am..."}, {"id": 1400, "start": 14056.22, "end": 14058.22, "text": "Ich kann nicht mehr reden."}, {"id": 1401, "start": 14058.22, "end": 14063.22, "text": "Mein Chat ist weg."}, {"id": 1402, "start": 14063.22, "end": 14065.22, "text": "Mein Voice-Chat geht nicht mehr."}, {"id": 1403, "start": 14065.22, "end": 14066.22, "text": "Hört ihr mich noch?"}, {"id": 1404, "start": 14066.22, "end": 14072.22, "text": "Leute, hört ihr mich noch?"}, {"id": 1405, "start": 14072.22, "end": 14089.22, "text": "Ja, ihr hört mich noch."}, {"id": 1406, "start": 14089.22, "end": 14090.22, "text": "Ich kann mich jetzt so..."}, {"id": 1407, "start": 14090.22, "end": 14101.22, "text": "Hört mich noch auf das Game-Concept."}, {"id": 1408, "start": 14101.22, "end": 14102.22, "text": "Hört mich noch auf das Game-Concept."}, {"id": 1409, "start": 14102.22, "end": 14119.22, "text": "Ja, ja, ja, mich, okay."}, {"id": 1410, "start": 14119.22, "end": 14124.22, "text": "Ohne Voice ist das echt doof."}, {"id": 1411, "start": 14124.22, "end": 14151.22, "text": "Ohne Voice ist das echt doof."}, {"id": 1412, "start": 14151.22, "end": 14166.22, "text": "Ich hab mich mal verpisst."}, {"id": 1413, "start": 14166.22, "end": 14191.22, "text": "Ist aber nice geplockt, haben wir den in Reinhardt."}, {"id": 1414, "start": 14191.22, "end": 14219.22, "text": "Oh oh, zu viel und scheiß Position."}, {"id": 1415, "start": 14219.22, "end": 14228.22, "text": "Moment, was ist denn mit meinem scheiß Mikro los?"}, {"id": 1416, "start": 14228.22, "end": 14231.22, "text": "Geht jetzt Voice wieder?"}, {"id": 1417, "start": 14231.22, "end": 14232.22, "text": "Voice?"}, {"id": 1418, "start": 14232.22, "end": 14233.22, "text": "Hallo?"}, {"id": 1419, "start": 14233.22, "end": 14234.22, "text": "Voice?"}, {"id": 1420, "start": 14234.22, "end": 14235.22, "text": "Stopp."}, {"id": 1421, "start": 14235.22, "end": 14239.22, "text": "Okay, wenn wir den Reinhardt haben..."}, {"id": 1422, "start": 14239.22, "end": 14244.22, "text": "Egal, Orissa funktioniert gut."}, {"id": 1423, "start": 14244.22, "end": 14245.22, "text": "Checks nicht?"}, {"id": 1424, "start": 14245.22, "end": 14263.22, "text": "Ist jetzt mein Voice kaputt?"}, {"id": 1425, "start": 14263.22, "end": 14287.22, "text": "Aber wir können schon noch ein bisschen stallen, easy."}, {"id": 1426, "start": 14287.22, "end": 14300.22, "text": "Oh, ich hab Ulti, Brinkens vor sechs."}, {"id": 1427, "start": 14300.22, "end": 14301.22, "text": "Es ist keiner im Team."}, {"id": 1428, "start": 14301.22, "end": 14302.22, "text": "Hä?"}, {"id": 1429, "start": 14302.22, "end": 14303.22, "text": "Hallo?"}, {"id": 1430, "start": 14303.22, "end": 14304.22, "text": "Ah, WTF?"}, {"id": 1431, "start": 14304.22, "end": 14315.22, "text": "Was war denn das für ein Scheiß?"}, {"id": 1432, "start": 14315.22, "end": 14325.22, "text": "Voice-Bun."}, {"id": 1433, "start": 14325.22, "end": 14353.22, "text": "Reaper flankt links oben."}, {"id": 1434, "start": 14353.22, "end": 14377.22, "text": "Reaper kommt wieder links."}, {"id": 1435, "start": 14377.22, "end": 14384.22, "text": "Scheiße."}, {"id": 1436, "start": 14384.22, "end": 14395.22, "text": "Können wir das noch mal kontestieren?"}, {"id": 1437, "start": 14395.22, "end": 14396.22, "text": "Das passt schon einfach schön."}, {"id": 1438, "start": 14396.22, "end": 14408.22, "text": "Oh, nice picks, nice picks."}, {"id": 1439, "start": 14408.22, "end": 14430.22, "text": "Echo pickt den."}, {"id": 1440, "start": 14430.22, "end": 14434.22, "text": "Done."}, {"id": 1441, "start": 14434.22, "end": 14439.66, "text": "da wo hinsten will er es aber wissen"}, {"id": 1442, "start": 14439.66, "end": 14450.34, "text": "sehr riesenherzig"}, {"id": 1443, "start": 14450.34, "end": 14459.82, "text": "sagt mal leute jetzt mal was ganz was anderes war eine ganz andere frage an euch"}, {"id": 1444, "start": 14459.82, "end": 14467.1, "text": "guckt jemand von euch speedruns oder speedrun jemand selbst zufällig"}, {"id": 1445, "start": 14467.1, "end": 14476.78, "text": "getting over it, ganz random frage ich gebe es zu aber ich würde gerne ein getting over it speedrun zeigen"}, {"id": 1446, "start": 14476.78, "end": 14482.74, "text": "und irgendwie ist es schwierig da an deutsche runner ranzukommen oder zu finden"}, {"id": 1447, "start": 14482.74, "end": 14491.94, "text": "die irgendwie auch eine zeit haben die nicht zehnmal langsamer ist wie die"}, {"id": 1448, "start": 14491.94, "end": 14512.78, "text": "besten getting over it speedruns das ist übelst geil guckt euch guckt euch das"}, {"id": 1449, "start": 14512.78, "end": 14523.66, "text": "mal an, das ist mega geil, sag mal heute sieht das stream gut aus oder fällt mir gerade so auf so 720p 48 fps"}, {"id": 1450, "start": 14523.66, "end": 14533.82, "text": "ich finde es echt scharf und es ruckelt nichts, sieht top aus warum spielst du nicht mehr mit deiner main"}, {"id": 1451, "start": 14533.82, "end": 14540.26, "text": "weil ich bis season 3 quasi ich habe ja nur bis season 3 gespielt also ich habe seit season 3 nicht"}, {"id": 1452, "start": 14540.26, "end": 14544.98, "text": "mehr gespielt nachdem ich das game auf so ein bisschen höherem level wieder komplett neu lernen muss"}, {"id": 1453, "start": 14544.98, "end": 14554.14, "text": "habe ich mir gedacht mach mal einen neuen account, dann kannst du es in ruhe üben"}, {"id": 1454, "start": 14554.14, "end": 14559.5, "text": "ja getting over it speedruns sind nur einmal interessant für dich das wäre optimal für ein video"}, {"id": 1455, "start": 14559.5, "end": 14581.1, "text": "ja schon da"}, {"id": 1456, "start": 14581.1, "end": 14606.42, "text": "ich habe das mal für einen sicheren fire strike verwendet"}, {"id": 1457, "start": 14606.42, "end": 14629.54, "text": "schreckt"}, {"id": 1458, "start": 14629.54, "end": 14640.58, "text": "machst du die placement matcher sein das sind noch viewer games noch since viewer games"}, {"id": 1459, "start": 14640.58, "end": 14663.14, "text": "ja massi massi cheat"}, {"id": 1460, "start": 14663.14, "end": 14684.02, "text": "huge chatter huge massive shut down"}, {"id": 1461, "start": 14693.14, "end": 14712.3, "text": "240hz monitor ist gut vielleicht vielleicht lasse ich mich doch mal chebaten und holen wir ein"}, {"id": 1462, "start": 14723.14, "end": 14736.3, "text": "was war ich da ich drinne na gut aufhauen wird schon recht haben"}, {"id": 1463, "start": 14736.3, "end": 14747.46, "text": "ja meine massi ja aber selbst die massi retten sie gerade nicht"}, {"id": 1464, "start": 14766.3, "end": 14778.26, "text": "achte achte achte"}, {"id": 1465, "start": 14796.3, "end": 14804.26, "text": "oh jetzt hat er mich gebatet"}, {"id": 1466, "start": 14804.26, "end": 14826.62, "text": "du willst die consultant karriere ich spiele"}, {"id": 1467, "start": 14826.62, "end": 14851.02, "text": "Okay Leute, ich bin fertig für heute, war sehr nice, schöner No-Live-Stream."}, {"id": 1468, "start": 14851.02, "end": 14880.46, "text": "Also Leute, wir waren aus, war ein sehr schöner Stream."}, {"id": 1469, "start": 14880.46, "end": 14898.14, "text": "Hab Bock gemacht und je nachdem was ihr jetzt auch macht, viel Spaß dabei und wir sehen"}, {"id": 1470, "start": 14898.14, "end": 14915.22, "text": "uns, alles klar, bis morgen, tschüss."}, {"id": 1471, "start": 14928.14, "end": 14951.02, "text": "Tschüss, tschüss, tschüss, tschüss, tschüss."}, {"id": 1472, "start": 15018.14, "end": 15036.1, "text": "Tschüss, tschüss, tschüss."}, {"id": 1473, "start": 15036.1, "end": 15038.1, "text": "Das war's für heute."}, {"id": 1474, "start": 15038.1, "end": 15063.1, "text": "Das war's für heute."}]}