{"text": "Das war's für heute, bis zum nächsten Mal, tschüss, tschüss, tschüss, tschüss, tschüss. So, da bin ich, auf geht's. Erstmal den Papagei ausplanten. So. Da war noch was zu essen hier hingestellt. Mal kurz muten demnächst und mal reinhauen. So, los geht's. Cod. Sprich C-O-D. Das weiß ich noch früher in den Videos, so geil, die Leute immer, Max, das spricht man nicht Cod aus, das spricht man C-O-D aus. Was, Sachen machst du, ja. Moin Eax, was hast du dir gegönnt, äh, zwei Brötchen, nichts Totes. Ähm, ich hab einfach nur Black Screen gerade im Bild. Und Spiel reagiert nicht. Das geht ja gut los, yeah. Tja. Das Game noch mal ausmachen. Also auch wenn es bei euch im Stream so aussieht, als würde da irgendwas passieren im Hintergrund, da passiert nichts. Mein Bildschirm ist komplett schwarz. Also ich darf noch nicht mal den Task Manager mal aufmachen. Hallo. Ey, ich krieg die Krise, dieser PC-Port, das fuckt mich so ab. Das Game ist schwarz. Und ich kann nicht mal mehr in Task Manager. Also ich kann nicht mehr in Task Manager. Ich kann nicht mehr in Task Manager. Ich kann nicht mehr in Task Manager. Und ich kann nicht mal mehr in Task Manager. Also ich kann in die Windows, in die Windows-Leiste, ja. Boah, das nervt, ey. Ich wusste gar nicht, dass man, dass ein Programm überhaupt den Task Manager ausblenden darf. Na toll, Uni, was mach ich jetzt? Steam, Steam macht Geräusche. Steam klingelt. Mein, mein Steam klingelt. Warum klingelt? Alter, was ist mit meinem Steam los? Cebaro sagt, das legt 100% am Kopierschutz, das kann schon sein. Tja, wasch denn jetzt? Alter, mich nervt das so krass, ey. Warum ist das so kaputt? So, wie kann man User switchen in Windows 10? Dann geht das bestimmt wieder. So. Alter, das nervt. So, ich lock nochmal aus, dann lock ich wieder ein.", "segments": [{"id": 1, "start": 30.0, "end": 37.0, "text": "Das war's für heute, bis zum nächsten Mal, tschüss, tschüss, tschüss, tschüss, tschüss."}, {"id": 2, "start": 120.0, "end": 148.2, "text": "So, da bin ich, auf geht's."}, {"id": 3, "start": 151.0, "end": 153.0, "text": "Erstmal den Papagei ausplanten."}, {"id": 4, "start": 163.0, "end": 164.0, "text": "So."}, {"id": 5, "start": 166.0, "end": 168.0, "text": "Da war noch was zu essen hier hingestellt."}, {"id": 6, "start": 170.0, "end": 174.0, "text": "Mal kurz muten demnächst und mal reinhauen."}, {"id": 7, "start": 174.0, "end": 179.0, "text": "So, los geht's."}, {"id": 8, "start": 180.0, "end": 181.0, "text": "Cod."}, {"id": 9, "start": 182.0, "end": 184.0, "text": "Sprich C-O-D."}, {"id": 10, "start": 185.0, "end": 192.0, "text": "Das weiß ich noch früher in den Videos, so geil, die Leute immer, Max, das spricht man nicht Cod aus, das spricht man C-O-D aus."}, {"id": 11, "start": 194.0, "end": 196.0, "text": "Was, Sachen machst du, ja."}, {"id": 12, "start": 196.0, "end": 207.0, "text": "Moin Eax, was hast du dir gegönnt, äh, zwei Brötchen, nichts Totes."}, {"id": 13, "start": 210.0, "end": 213.0, "text": "Ähm, ich hab einfach nur Black Screen gerade im Bild."}, {"id": 14, "start": 217.0, "end": 218.0, "text": "Und Spiel reagiert nicht."}, {"id": 15, "start": 219.0, "end": 221.0, "text": "Das geht ja gut los, yeah."}, {"id": 16, "start": 221.0, "end": 223.0, "text": "Tja."}, {"id": 17, "start": 224.0, "end": 226.0, "text": "Das Game noch mal ausmachen."}, {"id": 18, "start": 230.0, "end": 234.0, "text": "Also auch wenn es bei euch im Stream so aussieht, als würde da irgendwas passieren im Hintergrund, da passiert nichts."}, {"id": 19, "start": 235.0, "end": 237.0, "text": "Mein Bildschirm ist komplett schwarz."}, {"id": 20, "start": 241.0, "end": 244.0, "text": "Also ich darf noch nicht mal den Task Manager mal aufmachen."}, {"id": 21, "start": 244.0, "end": 246.0, "text": "Hallo."}, {"id": 22, "start": 248.0, "end": 252.0, "text": "Ey, ich krieg die Krise, dieser PC-Port, das fuckt mich so ab."}, {"id": 23, "start": 257.0, "end": 259.0, "text": "Das Game ist schwarz."}, {"id": 24, "start": 260.0, "end": 262.0, "text": "Und ich kann nicht mal mehr in Task Manager."}, {"id": 25, "start": 263.0, "end": 265.0, "text": "Also ich kann nicht mehr in Task Manager."}, {"id": 26, "start": 266.0, "end": 268.0, "text": "Ich kann nicht mehr in Task Manager."}, {"id": 27, "start": 269.0, "end": 271.0, "text": "Ich kann nicht mehr in Task Manager."}, {"id": 28, "start": 271.0, "end": 273.0, "text": "Und ich kann nicht mal mehr in Task Manager."}, {"id": 29, "start": 274.0, "end": 276.0, "text": "Also ich kann in die Windows, in die Windows-Leiste, ja."}, {"id": 30, "start": 280.0, "end": 282.0, "text": "Boah, das nervt, ey."}, {"id": 31, "start": 282.0, "end": 294.0, "text": "Ich wusste gar nicht, dass man, dass ein Programm überhaupt den Task Manager ausblenden darf."}, {"id": 32, "start": 301.0, "end": 303.0, "text": "Na toll, Uni, was mach ich jetzt?"}, {"id": 33, "start": 308.0, "end": 310.0, "text": "Steam, Steam macht Geräusche."}, {"id": 34, "start": 310.0, "end": 311.0, "text": "Steam klingelt."}, {"id": 35, "start": 312.0, "end": 315.0, "text": "Mein, mein Steam klingelt. Warum klingelt? Alter, was ist mit meinem Steam los?"}, {"id": 36, "start": 318.0, "end": 321.0, "text": "Cebaro sagt, das legt 100% am Kopierschutz, das kann schon sein."}, {"id": 37, "start": 324.0, "end": 326.0, "text": "Tja, wasch denn jetzt?"}, {"id": 38, "start": 326.0, "end": 336.0, "text": "Alter, mich nervt das so krass, ey. Warum ist das so kaputt?"}, {"id": 39, "start": 336.0, "end": 351.0, "text": "So, wie kann man User switchen in Windows 10? Dann geht das bestimmt wieder."}, {"id": 40, "start": 367.0, "end": 369.0, "text": "So."}, {"id": 41, "start": 369.0, "end": 392.0, "text": "Alter, das nervt. So, ich lock nochmal aus, dann lock ich wieder ein."}]}