{"text": "So, weiter gehts. Muss grad mal alles anmachen, dauert kurz noch. Gut, ich muss mal kurz was checken. Excellent. Okay, also exquisite, bin wieder am Start. Quizzet, bin wieder am Start. Also wir machen heute weiter, da wo wir gestern aufgehört haben und als allererstes brauche ich zum testen eine lokale Home Assistant Installation. Oh ja und wie ich C++ mag. Moin Patrick, auch am Start. Ist der Preis-Champ mit C++ erstellt? Das glaubst du doch selbst nicht. Warum sollte ich mir denn das antun? Das wäre ja Folter. Ich hab das ja nicht gemacht. Ich hab das ja nicht gemacht, um mich irgendwie zu quälen. Leute, ich habe ein gutes Feature in C++ gefunden heute morgen. Stellt euch mal vor, ich habe ein Feature in C++ gefunden, was mir gefällt. Was heißt gefällt? Was ich nicht total scheiße finde. Ich zeig's euch gleich. Ich zeig's euch gleich. Ich zeig's euch gleich. Muss grad nochmal schnell was anderes gucken. Ist die VM an? Genau. Leute, euch fällt vielleicht auf, die Quali ist besser. Guckt mal, die Qualität ist besser. Warte mal, ich will die Steuerelemente ausmachen. Woran könnte das liegen, dass die Qualität besser ist? Genau, ich programmier nur noch mit If-Schleifen. So, also. Es ist jetzt 1080p die Auflösung. Nicht mehr. Die letzten Tage waren nur 720p. Die Sache ist nur die, damit das iPhone das kann, muss ich den Codec auf... Ups, Moment. Ich muss den Codec... Ich muss VP8 verwenden und VP8 ist auf dem iPhone Software-Encoding. Ich hoffe, der Akku geht nicht leer. Ich guck mal kurz auf meinem USB-Meter, was das iPhone gerade zieht. Ich stöpseln das mal schnell um. Mein iPhone braucht gerade 11 Watt nur für die Kamera. Das Problem ist auch, es ist keine 60 FPS mehr. Es ist eher so was wie 20. Ihr seht's ja glaube ich gerade. Das müssen wir mal ausprühen, was besser ist. Wir müssen mal gucken, ob 1080p 20 FPS besser ist oder 720p 60 oder was das ist. Ja, ja, du kannst hier die einzelnen Frames sehen. Aber das ist nur so auffällig, wenn die Kamera bewegt. Ich kann es wieder ändern. Wir probieren das mal auf. Dafür ist es jetzt 1080p. Das heißt, ihr erkennt zum Beispiel auch, was hier drauf steht. Guckt mal, ihr erkennt was hier drauf steht auf dem Sensor, ohne dass ich ranzoomen muss. Ich meine, das ist auch nicht schlecht. Muss man schon sagen, qualitativ ist es schon besser. Ich war gerade am gucken, ob das iPhone 1080p H264 kann, aber anscheinend kann es das nicht. Das ist wieder typische Apple-Geschichte. Es nervt mich. Die haben sogar einen FAQ-Eintrag, wo drin steht. Nee, besseres iPhone bringt auch nichts. Das können die alle nicht. Guckt, die schreiben hier alle, du kannst das forcen, aber du musst VP8 verwenden. Oder meint ihr, das mit VP8 liegt am Chrome, dass der nicht schneller decoden kann? Wollen wir mal im Firefox ausprobieren? Probieren wir mal im Firefox aus. Vielleicht ist es da besser, aus irgendwelchen Gründen. Ich glaube es ja nicht. Doch, doch, doch. Guckt mal, im Firefox ist viel besser. Seht ihr das? Im Firefox ist viel besser. Dann machen wir doch den Firefox auf. Den Stream mit VLC, nee, das geht über WebRTC, das kannst du in VLC nicht machen. Warum ist es denn in? Das ist tatsächlich, ich meine, jetzt geht es halbwegs, oder? Ich meine, es ist vielleicht nicht so flüssig wie 60, aber es ist durchaus in Ordnung jetzt. Wenn ich jetzt hier irgendwas mache, guck mal, wenn ich irgendwas Normales mache, da fällt euch gar nicht wirklich auf, dass das keine 60 FPS sind, oder? Ist mal ernsthaft, da merkt ihr nichts von, dass wenn ich jetzt hier irgendwie irgendwas mache, dass das nicht 60 FPS sind. Es sind jetzt auf jeden Fall 30 und keine, und keine, was weiß ich, was es vorher war. Das ist ja, okay, und jetzt haben wir, das ist ja geil, jetzt haben wir 1080p und funktionierende Frames, exquisite. Hätte ich nicht, jetzt mal ernsthaft, hättet ihr gedacht, dass es besser läuft im Firefox? Also ich nicht. NDI Plugin für VLC, ernsthaft? Wie, was soll denn das bringen, dass der VLC WebRTC kann? Also bei mir läuft in der Regel die Sache im Chrome besser, aber sieht das jetzt nicht richtig nice aus? Ja, da kann man High Quality Finger Leak machen. Wie ist es im Edge? Das probieren wir jetzt nicht aus. Edge ist, Edge ist, okay, okay, weil ihr es seid, weil ihr es seid, weil ihr es seid. Edge. Ist das auch der, ist das auch der Chrome-based, der Chrome-based Edge? Wo seh ich überhaupt, welchen Edge ich hab? About Edge. Okay, das ist der Chrome. Ups, Edge, probier's den Edge aus. Nee, Hockels seh ich gleich an der, ist ja geil. Das hätt ich echt nett gedacht. Chrome. Okay, jetzt mal im Chromium, jetzt mal im Chromium. Da geht's ja gar nicht, Alter. Okay, gut, dass es im Firefox funktioniert. Bin ich zufrieden mit, alles in Ordnung? Okay, dann, dann, was hat Firefox? Guckt, habt ihr mal gesehen, diese Huge Big Brain Ein- und Ausfade-Animation, ist mir noch nie aufgefallen bis jetzt. Massive. So, ich würd sagen, so lassen wir das den Stream über jetzt. Woodface. EE muss ich nicht probieren. EEA funktioniert nicht. Internet Explorer kann ich bei WebRTC starten. Oh. Paints-Champ geht nicht. Keine EE. Gut, sehr gut, sehr gut. Okay, da können wir, können wir weitermachen. Also, ich recapitulate mal kurz, was wir gestern gemacht haben. Für alle, die nicht dabei waren. Mag ja sicher den einen oder anderen geben. Oh, da bleibt ja nicht Fullscreen, wenn ich Desktop switche. Doch, ne. Bleibt Fullscreen. Okay, gut. Das Gametrain, 94%, gebt euch Ruck, Leute. Einer noch, einer noch. Soulstar. Dankeschön, Twitch Prime Subscriptions hier. IQ++ für den Chat. Ich muss meine E-Modes übrigens verschieben. Muss öfters Sellout machen, hat schon direkt funktioniert. Swear7, Dankeschön, Prime Subscriptions. LSGKX, Twitch Prime, danke für den Sub. Jetzt gerade noch mal von oben nach unten durch, äh, von unten nach oben. Und der Pritzelsnacker, auch am Start, Dankeschön. Mega, huge Subscriptions. Nice. Okay, also ich, ich fasse das noch mal kurz zusammen. So, ich hab so ein Zähler im Keller hängen, also nicht mit sowas drauf. So, aber ich mach so was ähnliches, mach so was ähnliches wie das hier. Guck mal, ich bin nicht der Einzige, der sowas hier macht, bloß, dass die was Fertiges haben. So sieht mein Zähler im Keller aus. Den kennt ja sicherlich noch die ein oder anderen. So, das ist so der Oldschool, der Oldschool-Zähler, der irgendwann mal ausgetauscht wird. Mein zu Raspberry Pi mit Cody als Media Center, als, als Firestick. Naja, Firestick laggt auch ein bisschen, weiß nicht, wie die neuen Firesticks sind. Cody und 3D-Beschleunigung, also 2D-Beschleunigung, je nachdem, wie man sieht, ist halt kacke. Cody ruckelt halt auf dem Raspberry Pi. Wenn du es mal vergleichst mit beispielsweise auf dem Shield-TV. Was hältst du von so einem Ding? Äh. Was hältst du von so einem Ding? Sind ein bisschen billiger, aber läuft weich drauf. Hab ich mir sagen lassen, weiß ich auch noch von Reddit. Wie hast du C++ gelernt? Gar nicht, es gibt keinen auf der Welt, der C++ kann. Nicht mal das C++-Cremium kann das. So, wo sind wir denn stehen geblieben? Ah. Ich muss mein Access-Point wieder anschalten, dass es funktioniert. Fire-TV habe ich das letzte Mal, ich habe mal einen Fire-TV-Stack ausprobiert vor drei Jahren oder so. Da lief im Vergleich zum Shield-TV lief die Oberfläche von Android-TV und Cody auch ruckelig. So genau, also ich fasse das mal kurz zusammen. Also ich habe so einen Zähler und ich habe so einen Zähler. Zwei verschiedene Dinger. So was hier in der Richtung. Ah, nicht ganz. Wartet mal. So was hier habe ich in der Richtung. Muss ich mal kurz groß machen, da ich euch die LED zeigen kann. Ja, so was hier. Ja, ziemlich, ziemlich exakt so sieht es bei mir aus. Ziemlich genau so sieht es bei mir aus im Keller. Also so ein Ding habe ich für den ersten Stock so eine Art in der Geschichte. Ich glaube, das ist eine Seite, die uns zeigen möchte, dass die Dinger in Zukunft durch so einen ausgetauscht werden. Aber das passt. Ich habe so einen hier für den ersten Stock und so einen von den Stadtwerken. Also sprich, der da ist für Gesamt vom Haus und der da ist nur hier oben bei mir im ersten Stock. So und was ich jetzt habe dafür ist folgendes. Ich habe einmal. Ich habe einmal hier einen ESP32 Microcontroller, da ist das alles dran. Einen Case, was irgendwie kaputt ist und sich die ganze Zeit neu startet, was auch immer. Was wir da drauf geflasht haben. Mit dem Display drauf, das brauche ich eigentlich nur zu Debug-Zwecken, dass ich, wenn ich im Keller stehe, unten mal IP sehe und aktuell verstanden den vergleichen kann mit dem Zähler. So und die Sensoren sind zum Auslesen das Wichtige. Also ich habe einmal so einen Sensor, das ist. Guck mal, welche geile Quali das jetzt ist mit dem 1080p Auflöser, oder? Ich müsste mal sagen, viel, viel besser als die letzten Tage. Man erkennt alles sogar richtig gut. Also das ist ein Sensor, der erkennt, wenn es hell wird. Also siehst du, wenn ich den hier abdecke. Siehst du, LED geht aus. Wenn ich den wieder dazu zudecke, ist LED aus. Also der erkennt den Impuls. Also dieser Sensor da erkennt den Impuls, den solche Zähler machen. Die haben nämlich LEDs und alle keine Ahnung 0,8 Wattstunden oder so blinkt er einmal. Also sprich, das kann ich damit erkennen. So und diesen Sensor, den Klassiker mit der Scheibe, den kann ich auf folgende Art und Weise erkennen, nämlich mit dem da. Und zwar der da. iPhone, please. Zoomen. Hallo. Aha, exzellent. Das sind zwei Infrarot-LEDs beziehungsweise ein, das ist nicht okay. Das iPhone hat wieder keinen Bock. So. Also. Jetzt erkennt man es. Also der Sensor, das ist einmal ein Infrarot-LED und einmal ein Empfänger und der erkennt, wenn die Einstrahlung schwächer wird. Also sprich, das funktioniert dann folgendermaßen. Das funktioniert dann folgendermaßen, wenn das hier durchläuft, wenn das Silber ist, dann reflektiert das wunderbar, alles gut. Und ja, das stimmt tatsächlich. Aus diesem Video kann man heutzutage wirklich Fingerabdrücke faken, ja. Das ist kein Witz, wurde schon gemacht, aber ich habe keine House-Security mit Fingerabdrücken, insofern ist es egal. Es geht jetzt mit der Musik ab. Na gut, mein Figen. So. Und das reflektiert wunderbar, wenn das Silberne ist, aber wenn das Rote kommt, das reflektiert nicht ganz so gut und das erkenne ich hier dran. Also ich erkenne an der Einstrahlung von dem Infrarot, sprich, ob das jetzt gerade das Rote durchläuft oder das Silberne. Und wenn das Rote durchläuft, dann weiß ich, aha, einmal hochzählen. Deswegen unter anderem, weil man seinen Fingerabdruck nicht ändern kann, sind Fingerabdrucksensoren kacke. Würde ich finde, finde ich als Security sucked. Oh, ich muss mir dann gleich mal was zu trinken holen, sehe ich gerade. So, so ist das gerade gemacht, sondern was wir gestern angefangen haben ist, das Ganze so weit zu programmieren, dass man die Sensoren verwenden kann. So, und ich leg das jetzt mal wieder hier obendrauf, dass ihr was seht. Dann machen wir wieder da rein. Und den machen wir dahin, dass man sieht, wir testen das hauptsächlich mit dem Sensor hier. Exzellent. Ich versuch das gerade mal so zu machen, dass man das sieht. So sieht man, ne? Sieht man die grüne LED? Ne, die sieht man nicht. So, jetzt exquisite. So, jetzt sieht man nämlich den ganzen Crap und jetzt basteln wir mal weiter. Also was wir heute probieren ist, die Sensoren in meine Home Assistant zu übertragen, was die messen. Und deswegen muss ich jetzt meine Home Assistant in der VR installieren ganz schnell, das geht zackig. Gibt es hier ein fertiges Image. Wir haben hier ein fertiges Image, muss mal kurz gucken, was das gibt. Gibt es ein fertiges Image für VRM. So, und dann ist die Idee, so und dann ist die Idee, dass man den Sensorstand an meine Home Assistant übertragen kann und dort sehe ich dann, wie viel Stromverbrauch ich aktuell habe und ich kann mir daraus auch errechnen, wie viel gerade aktuell im ganzen Haus bzw. im ersten Stock verbraucht wird. Ist jetzt nichts, was man unbedingt haben muss, aber es ist auf jeden Fall eine coole Sache zum Selbstbauen. So, machen wir gleich. Ich installiere mir erstmal schnell den Home Assistant. Brauche ich irgendwie VR? Wo haben die den Kram denn zum Download? OVA? OVA? Hab ich glaube ich noch nie verwendet. Ja, die Shelly Energy Monitor kannst du dir holen. Die musste aber halt um irgendwelche Kabel machen und ich finde es halt insofern ganz cool, das direkt vom Zähler abzulesen. Ach nee, das ist gar nichts mit Klammern um das Kabel. Wie willst du das am kompletten Haus anschließen? Das geht doch gar nicht gescheit, oder? Oder wie funzt das? Wie schließt man das an? Ach, da ist Klammern. Ja, kann man machen. Vm Workstation. Bäm. Store, new vm. Nee, nee, nee. Die neue vm soll erstellt werden. E, Doppelpunkt. Vms. Ha, ha. Oh, wir haben doch schon Home Assistant. Okay, dann machen wir es einfach nochmal. Import. Weil das brauche ich. Ich verwende Home Assistant als mein Heimautomatisierungslösung und ich brauche eine Testinstallation um zu gucken. Heck, wer war's, Chat? Wer ist gewesen? Gibts zu. Wer, wer, wer ist drin von euch, ja? Home Assistant vmwa. Vmdk. Vmdk. Hä? Ach, Moment, das war für ein, das war für ein ESX, was ich da runter geladen hab, ne? Ich muss das hier runterladen anscheinend. Okay, das ist ja auch maximal verwirrend gemacht. Ha. Was auch immer. Vm Workstation. Create new virtual machine, select custom. Gut, das machen wir mal während er runterlädt. Also, new virtual machine, custom. Make it co, jaja, passt. Later. Choose April install later, select Linux. Okay, das ist wahrscheinlich, wahrscheinlich relativ egal, was man davon nimmt. Aber die vm brauchen wir. Das erstellen. So, number of process sources, keine Ahnung, 3 cores, reicht dicke. RAM 40069, ich hab genug. Braucht es eh nur zum testen, das kommt danach wieder weg. Use bridge networking, alles klar, alles klar. Sonst noch irgendwas? Ah, man muss auf EFI umschalten, okay. 20G sollte reichen. Moment, hab ich irgendwas verkehrt gemacht? Ach ne, use an existing virtual disk muss ich machen. Okay, geh nochmal zurück. Use an existing virtual disk. Downloads. Wo ist es? Ach, das ist nochmal gezippt. Meine Güte, äh. Kannste, man kannste Leute auch, man kannste Leute auch schwer machen. Ich meine, die 50 MB hätten es jetzt auch nicht gemacht, oder? Oh, next. Soll ich das, soll ich das? Nee, ist egal. Ja, mein wegen, konvertier, customize, das muss man erstmal anlegen. Jetzt kann ich umstellen auf EFI boot, ich hoffe der Kram funktioniert. Ja, das ist ein firmware image, das wird komprimiert jetzt anders um große Unterschiede machen. Gucken wir mal, was ist der Unterschied? Also, äh, download. Auf, geht zu. Downloads. Oh. Okay, der Unterschied ist 1,6 Gigabyte zu 350 MB. Ich hab nichts gesagt vor 50 MB. Okay, ist ein bisschen unterschiedlich. Warum ist das rot? Gut, ich hab nichts gesagt, alles, alles gut. So, also, so, advanced, umstellen auf EFI boot, und jetzt starten. Äh, was? Oh, I finish install. Boote das jetzt, postchamp. Format Workstation hab ich gekauft, bei SoftwareKong. Vertrauenswürdigste Seite aller Zeiten, ähm, oder was? Admin? Ich weiß das Default Passwort gar nicht mehr, Admin. Root? Gut, war's. Okay. Äh, was hat das Ding jetzt für ne IP gekriegt? Alter, das ist mir zu viel, zu viel Happy Mario, ja so was besser. Die klassische Mario Musik ist mir zu Klassisch Ne was war es root Okay, die musik ist echt auf krampfhaft happy gemacht, wir sehen jetzt was das ding von der ip gekriegt hat network Info ich habe gekriegt 2.139 okay Dann machen wir das mal auf Also was war das 1 2 2 1 6 8 ist klar 2 139 ok so weil das brauchen wir jetzt gleich als mqtt server wo ich war und die ip liegt schon wieder schon wieder drin chat 8 1 2 3 8 1 2 3 Admin Admin admin 1 2 3 4 5 6 1 2 3 4 5 6 great account Ja genau hier sind wir in amsterdam vape nation next Alta was ist das für musik ich krieg ja anfälle die sollen die sollen einfach irgendwas im im hintergrund dudeln lassen und gut ist das wird zu anstrengend Mario Kart happy epic Okay We want to stay locked in yes So in amsterdam ist es partial clouded sehr schön das wollte ich immer mal wissen Gut weil hier werde ich jetzt versuchen meinen strom sensor anzulegen und anzuzeigen In der testinstallation also auf geht's leute Der watt champ ist am start Auch ich muss ja erst wieder von raspberry pi usb weiterleiten weil ich habe so gemacht dass ich euch den kram hier in stream zeigen kann habe ich das an raspberry pi angeschlossen aber entwickeln will ich an meinem desktop pc Das heißt ich muss das kann ich muss den usb anschluss irgendwie weiter leiten an mein pc dass ich flaschen kann Das geht vollendermaßen falls das ding die richtige ip hat muss ich wieder mal nach ada ist es sehr gut USB Usd usb ip bind jawoll was list modprop 1 punkt Kann ich jetzt flaschen list 1 punkt kann ich jetzt flaschen list Ok kann ich jetzt mal gucken ob ich jetzt flaschen kann upload Was für neu ist dass das ist man jaro linux mit i3 als desktop manager oh oh je was jetzt los Die weiß busy was soll das anzeige ist raus hier ist nix busy zu sein Ok jetzt immer bei usb 1 machen wir nicht eben noch bei usb 0 Was auch immer so es flascht jetzt so danach sollte der reboot und den gleichen kram von gestern wieder anzeigen Ich habe den access point ja noch gar nicht gestartet Bosschamp Bosschamp Ach ich habe den access point ja noch gar nicht gestartet Null der kann sich der kann sich nicht verbinden zum access point ich muss den access point erst mal wieder starten dass er sich einloggen kann Ich habe den ich habe den perfekten access point für solche testzwecke leute wenn ihr einen kleinen access point braucht den ihr zu irgendwelchen testprojekten einfach mal an und ausschalten könnt und überall hinstellen könnt Dieses teil das beste das ist furz klein Kann auch nix im endeffekt von antennen und und ich glaube es auch plus maximal 2,4 gigahertz was für diese dinge reicht Aber das ist das ist mini Der map light Guck mal guck mal wie klein das ist der access point Was was ist hier mit delay Was ist hier mit delay Was Ok ich habe keine ah also Was es geht tp link hat auch so ein ja möglich Was ist denn eine b a berufsabschluss nähe so ok passt ding ist geflasht funktioniert Ach bachelor ah ok passt alles klar ding ist geflasht die anzeige da oben ist busy busy kaputt irgendwie Guck mal irgendwie irgendwie rippt die anzeige da oben funktioniert nicht so gut wie ich mir das ausgemalt habe aber passt schon ok also wo sind wir gestern stehen geblieben geht das flaschen noch jawoll serial jawoll geht auch noch ok geht alles da wo wir gestern stehen geblieben sind perfekt Welche strommenge zeigst du auf dem ne von meinem hauszähler wenn ich mal endlich ein solar ding bauen kann dann zeige ich das da in meinem home assistant auch an aber nicht mit dem gerät sondern mit irgendwas anderem Also ok lass mal kurz in mich gehen wo machen wir weiter ich würde sagen wir machen jetzt in home assistant wir machen jetzt mal den test dass wir per mqtt im home assistant den sensor anlegen können weil es funktioniert ja in soweit schon ich kann das ding booten ich kann mich zum wlan connecten ich kann updates hochladen über den browser das muss ich dann nicht per serieller schrittstelle anschließen ist natürlich auch besser Und der guckt dass das wlan aktiv ist der schaut ob der boot aktiv war also der schaut ob der letzte boot geklappt hat wenn nicht krieg ich 45 sekunden zeit neue firmware hochzuladen der zählt den sensor hoch guckt ich zeige euch mal dass das funktioniert Ach ne ich hab hier was anderes eingebaut ok ich sag nix ich lösch das mal ich zeige euch mal dass das prinzipiell funktioniert und malt es aufs display so also was wir jetzt machen müssen ist im home assistant die daten hinschicken Und dazu gibt es so ein spezielles mqtt json protokoll von home assistant wo der automatisch sensoren anlegen kann So dazu muss ich jetzt aber erstmal gucken übrigens wir müssen noch was anderes machen ich bin dumm wir müssen vorher noch was anderes machen der verliert nämlich immer die werte schaut mal wenn ich jetzt das hier hochzählen lasse also ich muss einfach mal hier ausblenden Also er zählt hoch jedes mal wenn licht an und aus geht ich glaube es ist allerdings draußen zu hell als dass ich damit zählen lassen kann ne ist zu hell der ist Richtung fenster gerichtet aber jetzt kann ichs besser zeigen guckt Aus also sprich der zählt der zählt für jedes mal licht lichtimpuls zählter Und zwar jedes mal wenn das licht angeht das ist das wichtige dass er das auch richtig vom zähler erkennen kann wenn das dran hängt ihr seht immer das zählt auch eins hoch die formatierung auf meinem display ist ziemlich broken hab ich gerade festgestellt Okay also das zählen wie gesagt das zählen das funktioniert jetzt muss ich irgendwie gucken wie ich diese gezählten werte zu meinem home assistant schicken kann Dann muss ich erstmal gucken esp32mqtt wie man das macht eins muss man dem hersteller lassen das sind das sind chinesen die dieses board herstellen also den controller den controller den man grad nicht sieht der hier dahinter hängt den da den da den Also nicht das board die ähm die cpu auf dem board ist von chinesen also sprich das da das da der chip china china kram versucht es mal so zu machen dass man es irgendwie erkennt dass hier der controller am start ist ja optimal ne jetzt hängt das sensor davor null Bring ich das irgendwie hingewurstet dass man alles oh es fällt rein nicht reinfallen please umbleiben okay perfekt ah jetzt erkennt man alles exzellent Nein der zählt nicht wenn ich im keller das licht anmache weil ich das ding genau mit dieser vorderen seite an die led pappe und zu geklebt hab mit klebeband da drüber das kriegt das überhaupt nicht mit wenn es zwischt Wenn es drum herum hell wird außerdem kann ich das relativ empfindlich einstellen weil das ziemlich hell wird wenn es direkt dran pappt gut jetzt muss ich dem irgendwie muss irgendwie gucken wie ich mqtt reden kann mit dem esp32 Da muss man zwar offiziellen examples angucken wie es funktioniert okay erstmal 30 billionen sachen included achja genau eine wichtige sachen die wir vorher noch machen nicht vergessen hat und zwar ihr seht ja wenn ich das ding neu warum ist das total verschoben das stimmt doch überhaupt nicht guck mal was zeigt denn da für ein müll auf dem display an der soll auf dem display anzeigen wartet mal das müssen wir müssen erst mal das display fixen wir müssen erst mal das display fixen also display fixen display display clear moment der sollte eigentlich papps ab kleines super ja ich will ja mal gucken wie das mit den eingebauten dingen geht der sollte eigentlich das trisetten und es hat auch gestern auch funktioniert warum steht warum steht kilowatt da oben das muss hinter der zahl stehen okay okay mag mal schauen okay jetzt funktioniert das steht viel zu weit oben what the fuck was zum okay vielleicht wirkt vielleicht täuscht das nein es steht komplett falsch moment das ist was zur what the fuck okay reset reset display warum ist das das ist komplett falsch auf dem display also das obere ist okay aber der andere kram stimmt nicht der andere kram müsste auf der zeile rechts rechts allein stehen warum ist das falsch auf dem display okay jetzt funktioniert es wenn ich das display komplett resette das muss ich jetzt nicht wirklich verstehen oder ich will aber ich will auch das display nicht resetten bei jedem draw wollen die mich rollen oder was kann ich den ernst sein dass jetzt jedes mal das display resetten muss dass das funktioniert weil so soll das eigentlich allein sein guck die zahlen sind rechts oben steht die ip und die uptime das ist eigentlich okay warum ist was hatten jetzt für schmerzen hier mit warum muss ich jedes mal das display resetten anstatt es einfach neu zu malen normalerweise sollte es screen clear tun das muss in die lupe das soll er jede sekunde neu machen das verstehe ich ehrlich gesagt nicht aber ich lasse es erst mal soll ich für mich nicht unnötig lange mit dem display beschäftigen dann resette das halt einmal die sekunde ist mir auch egal okay passt so wenn ich jetzt licht licht an und aus das geht nicht licht an und aus alter das ding ist hartnäckig so jetzt hat er hochgezählt genau guckt das display spakt übelst rum ist das kaputt oder so habt ihr grad gesehen ach nee wisst ihr was auch sein könnte dass es irgendwie probleme hat wenn das ding gleichzeitig wlan überträgt dass das ding irgendwie irgendwelche indifferenzen ihr wisst was ich meine irgendwelche stördinger hat dass es beim übertragen an das display irgendwelche fehler reinkommen in das signal keine ahnung woran das liegt aber es ist auf jeden fall nicht normal dass das zeug auf dem display hin und her springt das ist definitiv nicht normal i am real lunatic twitch prime dankeschön für den sub kann man den code irgendwo kopieren muss man gucken so ok jetzt gucken wir wie man mqtt verwendet also task noch so mqtt das ich nichts vergesse vorher muss man noch gucken werte speichern wie machen wir das weil wenn hier mal der strom weg geht da will ich die werte ja behalten von dem von dem zähler mal angenommen startet einer neu will ich mir die werte die werte irgendwie speichern sondern habe ich was gefunden wie das funktioniert das ding hat also der esp partition der hat auf seinem flash hat er verschiedene speicherabschnitte so sieht so sieht standardmäßig aus nvs das da factory storage und bei mir sieht es so aus die partitionierung ungefähr ungefähr stimmt nicht so ganz also meine partitionierung sieht folgendermaßen aus circa 2 mb für firmen wir circa nie 1, ich sage ungefähr 2 mb einmal für firmen wir ungefähr 2 mb zweimal für firmen wir und 250 kb storage und hier vorne in dieses ram hat man hat man nur 20 20 kilobyte da kann man relativ easy und eben ohne dass es kaputt geht beim stromausfall daten reinschreiben die man bei einem neustart behalten will ist eigentlich ganz nützlich wenn ich das auf dieses filesystem hier hinten schreibe dann hast du das problem das geht kaputt wenn das strom oder wenn das ding crash oder das stromaus geht während er gerade schreibt so deswegen müssen wir schauen dass wir in irgendeiner art und weise die werte speichern können von unserem sensor so die sensorwerte stehen hier drin da stehen die sensor hier stehen die sensorwerte drin und die speichern wir jetzt einfach mal und dazu muss man folgendes inkluden das habe ich mir im vorfeld schon angeguckt wie das wie das funktioniert mal kurz abguck abguck champ machen abguck champ auf dem zweiten bildschirm natürlich mache ich das alles live ich habe mir vorher nix angeguckt leute easy ne abguck champ also was muss ich inkluden preferences und da muss ich folgendes anlegen so und jetzt so und jetzt kann man da sachen reinschreiben also zum beispiel jedes mal wenn ich hier in meiner schleife schleifen action mache dann kann ich hier jedes mal sagen ok das lass mal immer so storage put und in dem fall ist es ein int da muss ich den key vergeben den nennen wir jetzt beispielsweise einmal total energy und da speichern wir das da rein und wir nennen das ganze einmal total und first floor sonst ist zu lang und jetzt speichert er im flash diese zwei variablen werte und ich habe gestern abend noch mal eine halbe stunde gelesen auf der webseite vom hersteller und die sagen das ist diese schreibvorgänge sind resistent gegenüber stromausfälle also entweder ist es drin was vorher drin stand oder das aktuelle drin also sie sind so weit wie es geht atomic diese schreibwerte auf dieses mini storage welches filesystem nimmt man für den flash speicher bei so dingern die default mäßig ist spiffs das da ist standard mäßig das was dabei ist aber spiffs hat das problem wenn ich also ich könnte jetzt auch sagen hier spiffs open irgendeine datei sowas wie keine ahnung sensor data txt file right so das könnte ich auch machen aber das problem ist mal angenommen ich schreibe hier gerade meine sensorwerte rein und der strom geht in dem moment kaputt oder aber das ding crashed oder was auch immer ist dann ist das filesystem korrupt und die atei leer das ist nicht sonderlich resistent so und die das andere diese diese diese dieser kleine speicherbereich vorne wenn man das mit der library reinschreibt dann ist das so weit wie es geht sagt zumindest der hersteller resistent gegen gegen ausfälle ja bringst du es hier unten ist noch falsch ja so das heißt der speicher das da jetzt rein ne macht man man macht den ach ja stimmt das ist auch noch was man macht das man macht den flash speicher nicht kaputt weil die sind nicht doof die chinesen also zumindest die sp 32 konstruktion die sp 32 chinesen die sind nicht doof und zwar was die gemacht haben die haben für diese für diese quasi persistent library haben die das so gemacht dass sie das we're leveling oder we're leveling we're leveling heißt glaube ich vom flash controller dazwischen geschaltet haben also sprich man kann zwar hier nur auf maximal 24 kilobyte zugreifen aber unter der haube wird das über den kompletten vier megabyte flash verteilt das heißt du hast millionen von schreibzyklen bis das ding mal irgendwie anfängt rumzuspacken das heißt du kannst das problemlos jede sekunde schreiben und es geht nichts kaputt ja ihr habt recht wenn es immer die gleiche flash speicher zelle wäre dann dann wäre das ding ziemlich ziemlich schnell im arsch das ist klar da habt ihr da habt ihr schon recht so also wir speichern den kram jetzt doch in den ersten 24 kilobyte speichern wir jetzt zwei variablen von uns mit dem key total mit dem key mit dem key first floor so und es muss ich am anfang jetzt natürlich noch laden weil wenn das ding neu startet sind die werte ja nicht gesetzt sondern es müsste auch relativ relativ easy gehen und zwar kann ich ihm sagen lade mal nicht read was ist es get mit dem key total und schreibt das in die variablen rein und noch besser die haben sich also die chinesen haben sich echt was bei gedacht ich kann sogar einen default value angeben das heißt wenn es das nicht gibt dann setzt er initial das erste mal automatisch null ein also das sind ganz schöne api da haben sie sich wirklich gedanken zugemacht so und jetzt sollte er sich eigentlich die werte merken auch wenn ich neu starte probieren wir mal aus sollte jetzt funktionieren so er uploadet jetzt aktuell ist es drei das wird jetzt einmal noch resetten weil er jetzt firma flasht und neu startet aber dann probieren wir mal aus ob es funktioniert so jetzt sollte der neu starten klar neustart jawoll passt ok es ist auf null jetzt lassen wir mal den sensor ein bisschen hochzählen eins zwei drei ja ich bin ein bisschen zu schnell für die anzeige ok gut so also sechs sechs haben wir jetzt auf unserem sensor stehen so und jetzt resette ich den mal jetzt resette ich den mal und nach dem neustart sollten wieder hier sechs drinne stehen und bei jedem neuen flash wirds auch wieder null ne ne ne ne ne das wird nicht mit dem flash überflashed das ist persistent das müsste ich das müsste ich zusätzlich erasen wenn ich das löschen will das flasht das überflasht dann ich hoffe ich mal zumindest habe ich was kaputt gemacht oh nein ich habe sie überschrieben ich depp ok ich habe nichts gesagt noch mal exzellent sehr gut gemacht top ok vielleicht überflasht das doch das ding resetknopf oder so ne ne die haben keine knöpfe dran an dem teil ok das sind wir wieder probieren wir mal probieren wir mal aus ah komm her eins zwei drei alles kapiert jawoll du hast ja gesagt persistent gegen strom weg das probieren wir jetzt mal aus also persistent gegen strom weg sollte es sein das teste ich jetzt mal ich mach mal strom raus und strom rein dann sollte wieder drei da stehen klein ok habe ich irgendwas falsch gemacht was habe ich verkehrt gemacht das hat nicht funktioniert ah ich hab das wichtigste vergessen null guck mal storage beginn muss ich machen sonst lädt er das ganze gar nicht ok alles klar habe ich nix gesagt keck wait ach jetzt hat er ja wieder mein usb gerät ah jetzt muss ich mein usb gerät wieder neu ok jetzt kann ich wieder uploaden ok das war jetzt bescheuert wenn man das nicht startet dann kann es natürlich auch nicht funktionieren aber lustig dass der keinen fehler geschmissen hat das war dem vollkommen egal das große o in deiner schriftart sieht einfach aus wie ne null ne weil meine null hat ne punkt in der mitte daran erkenne ich das guck sth or rich deswegen habe ich hack mit dem null punkt in der mitte dass man es besser erkennt ok ah guck mal er hat die er hat was geladen er hat was geladen das habe ich gestern nämlich schonmal zum testen draufgeschrieben ich habe gesagt ich copy paste mir das und die werte hat er auf dem storage gefunden das sind die werte die ich gestern mal testweise draufgeschrieben habe also man sieht es funktioniert er hat das er hat das geladen ich kann es euch auch zeigen dass das funktioniert wir zählen jetzt mal ein bisschen hoch so jetzt haben wir ah jetzt haben wir 6 3 1 4 6 3 1 5 sollen jetzt flash ich noch mal und jetzt sollten die werte erhalten bleiben hier 6 3 1 5 sollte jetzt nach dem reboot wiederladen also es ist flash und stromresistent wenn ich das löschen will wenn ich das löschen will muss ich sagen flash erase dann macht er alles weg ok was war 6 3 1 5 ne 6 3 1 5 das display spackt übelst drauf aber wisst ihr was ist mir wurscht solange sich das wieder von alleine fixt ist alles gut so also hat funktioniert erledt den kram vom storage wieder sehr schön so und jetzt muss ich gucken also es war den ersten task den wir erledigt haben jetzt muss ich mal gucken wie man mqtt verwendet mit dem esp 32 und wie gesagt ich will mal gucken was wie die eingebaute mqtt variante aussieht und keine library verwenden mal gucken wie das funktioniert aber vorher brauchen wir ein mqtt server ne brauchen wir nicht wir nehmen den offiziellen im internet mosquito mqtt zum testen demo ja da wird gespammt auf dem server ich sag es euch test test punkt mosquito also mqtt ist ein protokoll das wird gerne in der heimautomatisierung verwendet das ist ein message bus da können server was oder da können können clients was reinschreiben unter einem gewissen key und andere server können das oder andere clients können das subscriben und die bekommen eine nachricht wenn einer was veröffentlicht also sprich wenn ich mich jetzt beispielsweise für interessiere für updates von meinem stromzähler dann subscribe ich mich zu diesen zu dem zu dem topic auf dem quasi neue werte veröffentlicht werden so mosquito sub nein das funktioniert so nicht so sollte es eigentlich funktionieren topic topic oh alter da wird gespammt das ist ein public in public mqtt server da wird gespammt perfekt da können wir auch da können wir auch drauf spammen so jetzt schauen wir mal wie das funktioniert also es sieht schon mal viel komplizierter aus als es wahrscheinlich ist wie funktioniert das ganze denn mqtt app start bla bla bla hier mqtt esp mqtt client handle übrigens der der protokoll name ist das beste mqtt cute chat and any cuties so also client start innets das da brauchen wir okay das war mal im set up und gucken ob alles funktioniert mqtt config aha übrigens das ist auch so eine inkonsistenz die mich nervt an c plus plus das ist die das ist die struct schreibtweise von c die nicht gültig ist in c plus plus total wir warum gibt es da unterschied ist es eigentlich richtiger fail leute ich muss mal kurz was zu trinken holen ich bin gleich wieder da ich hab übelst durst wieder da ne c plus plus ist kein derivat von c plus plus hat mal irgendeiner auf c aufgesetzt und dann hat sich das gefolgt und c plus plus sagt einfach nur viel mehr sagen kann man als programmiersprache nicht so kurz was trinken excellent okay weiter geht's also mqtt cfg hat ok config also cfg funktioniert schon mal nicht weil weil warum weil nicht included wahrscheinlich was muss ich include dass das funktioniert also man muss auch sagen ey das ist der beste china hersteller den ich kenne die haben ordentliche examples ordentliche doko durchdachte sachen also man sieht echt man muss sich da warm anziehen was die chinesen fabrizieren in den nächsten jahren die können auch durchaus gutes zeug basteln mqtt klein musch inkluden okay funktioniert das jetzt ah jetzt ok mqtt cfg so broker nee ah uri okay wie muss man da schreiben haben wir ein beispiel config broker ul okay zeig her config broker alter wie muss ich das schreiben in welcher in welcher schreibweise ich gehe mal davon aus dass das hier nicht funktionieren wird oder einfach so mal gucken probieren wir mal aus also mqtt cfg uri uri alles klar so so so jetzt verbinden wir uns zum testserver client init das prominent und klein start so das sollte soweit funktionieren upload das wahrscheinlich nicht wahrscheinlich crash das jetzt aber irgendwo muss ich doch rausfinden haben wir ja ein example für esp entwickler sind echt so ja ist echt so man muss sagen die machen wirklich sehr sehr sinnvolles zeug jetzt haben wir wieder ein beispiel ah da ist ein beispiel guck mal okay mqtt muss davor was ja okay das ding crasht crasht sich ein ab gerade also mqtt doppelpunkt doppel slash jetzt vielleicht moment eigentlich wollte ich eigentlich wollte ich uploaden die musik ist richtig pippe pippe please okay chat gif energy eine runde post post jam ob es funktioniert jetzt eine sache machen wir mal raus leute ich spreche noch mal ich spreche noch mal kurz ab diese anti brick check ist ja gut aber zum testen sagt er gerade das ding soll gefällig crashen serial print ist so wenn alles funktioniert okay haben wir vorhin den delay dass ich irgendwas sehe haben wir mal hier ein bisschen größeres delay serial monitor upload so gucken wir mal ob es jetzt klappt also es sollte ja eigentlich funktionieren wir haben eine config mit der jeweiligen uhr init und start wir machen ja noch gar nix wir machen ja noch gar nix aber laut dem beispiel code laut dem beispiel code ist da nicht so viel was man anders machen kann okay gucken wir mal ja was anderes als konsolen die backplatte da auch grad nicht übrig so okay wifi connect und und wow warum genau ist der jetzt gecrashed das ist doch was willst du hier denn großartig verkehrt machen exception was an das schreiben die immer exception handling ist noch nicht mal aktiviert das steht das steht immer da das ist eine bescheuerte bescheuerte ähm ausdrücksweise das ist noch nicht mehr exception handling an ähm mqtt kleines deswegen ist es wichtig bei dabei wenn ihr auch mal sowas macht dass ihr in der plattform auch ini dass da reinschreibt dann seht ihr nämlich wo was kaputt geht ansonsten seht ihr nur irgendwelche ram offsets und so da bringt man da bringt es eigentlich nix okay leute ich hab keine ahnung warum das abkackt aber github äh wir suchen jetzt einfach mal danach ja genau so machen wir das auch äh okay super weil perfekt das wieder voll gebracht ich hab ich schreibt überhaupt keine message ich verwende diesen den hier doch gar nicht muss ich den port angeben vielleicht muss ich den kann das sein dass ich den port angeben muss den port äh oder der nimmt bestimmt standard port guru meditation ja genau das krieg ich auch ja okay man alle das gleiche genau das so sieht übrigens so standardfehlermeldung aus wenn ihr das debug nicht eingeschaltet also vergleicht mal das hier was er bekommt als Fehlermeldung und vergleicht mal das was ich bekomme ich bekomme wirklich was wo was halbwegs sinnvolles drin steht was du will need to null or fill out all parameters of the struct ach wie moment eine neue struct anlegen nullt das nicht warum kann ich dann überhaupt was reinschreiben wenn es nicht valid ist was ich da angelegt hab ja null warum machen die das in c++ so leicht sich ähm kann man so oder so ja aber warum kann ich überhaupt was reinschreiben wenn das wenn das kein kein kein valid struct ist warum machen die so kompliziert verstehe nicht also mein man könnte ja die fälle wo man sich vertun kann so bauen dass man sich nicht vertun kann äh hallo writing ja writing postchamp fertig writen please okay okay ich flasche einfach noch mal das ist irgendwie abgekackt ist das irgendwie abgeschissen oder was ist das einfach neu starten das überraschend ist wie oft einfach neu starten funktioniert okay das war es ernsthaft anscheinend ist aber so auch valid warum okay c++ kenner warum ist das und das möglich und was ist der unterschied pass mal auf jetzt bin ich gespannt ob das geht das ist ein null initializer und was ist das im prinzip macht beides das gleiche oder wie ist das man kann die null auch ernsthaft ok es wird ja immer abgedrehter so geht auch ok es kompiliert schon mal ist ja schlimmer als unter windows manche dinger das flaschen geht langsam ganz schön lahm hier mal gucken das funktioniert auch also sehe ich das richtig die haben es wirklich geschafft dreimal was einzubauen was das gleiche macht aber man anders schreiben kann man kann so schreiben man kann so schreiben man kann so schreiben kann man denn auch so schreiben also kann man auch schreiben was die stelle immer ausdenken ist der wahnsinn ok ok also jetzt jetzt publishen wir was jetzt publishen was wir publishen ach so moment client ist ja hier nicht nicht verfügbar client dann mache ich hier dann mache ich hier mal eine schleife das ganze published weil es kommt da zwar nie raus aber es mir doch egal so der published jetzt alle sekunde in topic cute chat eins publish der keck weight und was ist das hier hinten länge if set to zero length will be calculated from payload ok das ist gut das will ich behalten q s ja und das da retain null ok passt ok wenn alles funktioniert dann sollten wir jetzt keck weight jede sekunde publishen auf den offiziellen server und zwar unter cute cute chat slash eins und dann müssen wir wahrscheinlich sowas hier hinten dran machen alter direkt zugestaltet platzmanier es ist c++ was willst du machen zwar ist es mir geht das ist echt eine komplette zugrundung die ich frage ok woher der c++ in der wahl sagt kirk weight wir publishen wunderbar bitte hast c++ ich zeig dir mal was moment wo hab ich's denn moment keck weight findet ihr nicht auch dass das eine wunderbare synthax ist das toll oder das muss man raus das muss man machen wenn man raus bekommen will welches tausender trend zeichen in dem standard länder setting verwendet werden warum eigentlich bei the way ich hab mal eine frage ich habe eine frage an die c++ kenner warum kann ich eigentlich nicht sowas machen war das war das zu wie soll ich sagen zu naheliegend oder was für das c++ krimium haben die sich gedacht so so geht das nicht das ist das nein das ist das ist nicht ok das müssen wir so machen es ist kompliziert genug ich verstehe ich verstehe es echt nicht ich weiß nicht die ok leute ich habe euch ja vorher gesagt es gibt ein gutes es gibt es gibt ein gutes c++ feature was ich was ich entdeckt habe kennt ihr oder kennt ihr das von python ich bin ich der große python programmierer aber das kenne ich das heißt ich gehe mal davon aus deswegen kennt ihr das auch also in python kannst ja sowas hier machen string gleich 1 2 3 1 2 3 so und hier drinnen kannst du stringmäßig schreiben in python was du willst unter anderem auch weitere quotes das juckt dir nicht also sprich alles zwischen diesen drei quotes ist wird wird quasi wörtlich interpretiert genau und das geht in c++ jetzt auch habe ich heute gelernt guck mal genau das war es travor recht sagt man kann jetzt sagen still gleich aber die synthax ist auch wieder geil man hätte man hätte die python synthax nehmen können alles wäre gut gewesen aber nein nein nein nein nein nein man muss machen er dann ein beliebiges trennzeichen beliebigen beliebiges trennzeichen machen ich glaube man muss ich glaube man muss quoten dann kann man muss man klammern dann muss man noch mal ein beliebiges trennzeichen machen und quoten so und alles was ich jetzt in diesen klammern schreibe wird quasi so wie ich es geschrieben habe interpretiert ohne ohne dass es kämpfen muss was natürlich schon leicht hässlich ist ja man könnte natürlich bad war ja ich weiß auch nicht man könnte natürlich die python synthax nachstellen imitieren so würde auch funktionieren wobei ich halt mich frage warum hat man nicht einfach drei quotes genommen und gut wars nee nee das ist egal du kannst auch du kannst auch b nehmen als trennzeichen ist auch vollkommen ok kannst auch b du kannst auch sagen zum beispiel was ich eigentlich ganz nice bin du kannst auch sagen sowas hier jason zum beispiel und da drinne kannst du dann jason string schreiben also du kannst hier alles schreiben was du willst aber hier drinne kannst du dann dein keck weight schreiben zum beispiel weil für was steht jason eigentlich genau das was doch wieder schreibt ja ja was gibt objekte ich glaube da wäre ich auch noch so drauf gekommen aber mal ganz im ernst also das ist auch schon wieder und unglaublich painst schämpig gelöst bei der way wir publishen übrigens immer noch keck weight jede sekunde auf den offiziellen mosquito test server ich frage mich sind die haben die haben die haben die zu viel wie nennt man das so viel zu viel ehre so ich weiß dass die sagen können im c++ gremium wir übernehmen was aus anderen sprachen was gut funktioniert also sprich warum entscheidet man sich dagegen einfach so eine etablierte syntax aus einer programmier sprache zu nehmen die man gut lesen kann und macht sowas vielleicht hatten sie ihre gründe keine habt ihr schon die essungen weight habt ihr schon die essungen weight geschichte den c++ gesehen das ist auch maximal verwirrend gemacht ob es ist das falsche okay das stimmt das stimmt ja das liegt dann hast du das problem mit rückwärts kompatible okay dann verstehe ich warum sie das gemacht haben aber man hätte einfach den erda vorschreiben können und gut wäre man hätte man hätte beispielsweise sagen können okay man man man macht einfach nen default delimiter weil das hier darf man ja machen ja das hier darf man ja machen man könnte einfach sagen man macht den default delimiter und den kann man manchmal überschreiben aber da hätte man nicht so komisches zeug gebracht guckt euch das hier mal an hier also c++ ist nicht lesbar richtig so also wir wir publishen was ist denn jetzt eine eine was pepo fett okay also das funktioniert ich würde sagen wir legen jetzt mal ein home assistant was wir jetzt an über diesen mqtt server damit das ganze ein bisschen schöner wird rappen wir das mal also die dinger hier brauchen wir okay lass mich lass mal kurz in mich gehen wir machen jetzt big brain c++ class mal gucken ob ich das auf die reihe krieg nur noch mal testweise ja also class das heißt jetzt eats mqtt beste so das kommt weg wollen wir alles inline destructor brauchen wir auch nicht so in unseren constructor kommt was ich auch nicht verstehe ist warum man das teilweise inline schreiben kann und teilweise nicht ich überlege gerade wie man das jetzt machen wir können ok ok ich war ich ich weiß wie was man also client string broker user falls man das brauchen user ist standardmäßig leer password ist auch standardmäßig leer jetzt kommt kasser abstraktions champ jetzt so copy pasten wir hier mal das rein mqt clients das ist konfig uri so das da ist da waren auch private variables für das lager das schreibe einfach in eine dritte datei dass uns das nicht mehr so nervt hier so dann weisen wir das mal zu also broker ist broke hallo auto auto complete please user ist user pw ist pw ok so das da ist dann in dem fall broker so und dann brauchen wir noch für usernamen und password wie heißt das user warum leckten das so rum user pw password ist übrigens auch so ein ding wo man sich voll ne micro python hat ganz andere probleme zum beispiel dass die ganz viele treiber libraries fehlen ne ne micro python in dem fall tatsächlich auch nicht wirklich besser finde ich man kann sich übrigens in c++ auch übelst leicht ins bein schießen und zwar das das geht kaputt das ist erlaubt weil in dem fall schreibe ich den string hier erstmal in ein globales globale variable von meiner klasse rein und davon hole ich mir dann den pointer und wenn ich hier direkt den pointer für nehme dann ist er nicht mehr gültig wenn es hier unten ankommt das kackt ab da muss man auch dran denken weil weil ja so also broker pass pass pass so klein start das klingt auch schon mal sinnvoll was wir hier gebaut haben so und ja machen wir jetzt eine neue methode drin void publish publish string topic message ok mal gucken ob mein geräpper funktioniert klein start so dann machen wir noch ein flack startet falls am moment ich sollte da vielleicht auch mal was da vorschreiben dass das funktioniert so und jetzt gucken wir wenn der mqtt klein gestern nicht warum erkennt er das jetzt wieder das ist das problem moment moment mein ich bin ich bin falsch ich bin falsch ich hab mich vertan ich hab mich verguckt so startet wenn es nicht startet ist dann will ich den kleinen start ich will das nur einmal machen weil sonst geht es garantiert kaputt so dann ich starte true wunderbar und dann publish ich das delay kann wieder raus ok so unsere rapper künste gucken wir mal ob es funktioniert das lagern wir jetzt erstmal aus warte mal habe ich sowas nicht schon habe ich nicht sowas schon mal gemacht warte mal ich bilde mir ein das habe ich doch vielleicht habe ich bloß nicht rüber kopiert na gut so jetzt schauen wir mal ob das funktioniert was ich da gebastelt habe also löschen wir den kram erst mal wieder habe ich schon weggemacht ok die musik ist aktuell youtube hier das da happy mario kart musik das ist irgendwie f0 musik würde ich sagen klingt klingt äußerst nach f0 ok also dann legen wir das jetzt mal an wie habe ich das genannt eats eats mqtt an die helper heißt das helper eats was ist mit meinem intellisens los kann da mal ein bisschen zu potte kommen hier eats mqtt so an was muss ich da eh mein intellisens ist mega im arsch ok leute ich starte mal neu da geht es wahrscheinlich besser reboot hilft immer bei allem jetzt geht schnell lustig so string user passwort brauche man nicht mqtt test ich habe könnten jetzt auch super wir können auch super etwa hallo ich will da drauf klicken wir könnten auch super advanced sein und sagen ist mal gucken ob das kann broker starts with mqtt dann setze ich das da vor dass das wäre ja mal massive big brain das das wäre auch mal was da kann ich das hier nämlich weglassen huge so ob das jetzt funktioniert weil ich da gebaut habe unterstrich was wo ah nee nee nee nee nicht nicht underscore das ist an der stelle hier noch ok es weiß ich ja erst später dann zu das ist schon noch das ok das ist in ordnung so dann gucken wir mal ob das jetzt funktioniert was ich da gebaut habe da wird das nämlich gleich ein bisschen ordentlicher hier so setup ist alles in ordnung brauchen wir nichts machen in der loop in der loop machen wir das jetzt also mqtt publish hier publishen topic wie habe ich das genannt gut topic cute chat eins publishen wir jetzt die message 0w jede sekunde hoffentlich crash das jetzt nicht gleich was habe ich übersehen ja klar brauche auch noch wenn der klein muss da oben hin wenn klein händel klein händel klein händel muss dahin machst du den chatbot nein ich lese mal strom zähler aus klein händel so jetzt muss das funktionieren die konfig vielleicht auch also underscore startet die konfig ich würde das erwarten die kopierter sehen wir gleich wir sehen wenn es krascht du hast ein twitch bot gebaut mit javascript exzellent so wenn es krascht geht es nicht wenn es geht dann geht es ohne zu kraschen das exzellent logik das flaschen ist mittlerweile echt schon lahm ok mein dir ob mein dir es funktioniert post jam das skaliert diagonal ip ok ist nicht gecrashed das ist schon mal ein gutes zeichen keck weit jawoll funktioniert ne moment ich bräuchte ich publishe hardcoded ok das kann er nicht funktionieren aber aber es wird funktionieren und übrigens das topic habe ich auch nicht verwendet ich kann nur ok ok ok ok die library dieses esp zeugs ist eigentlich alles so in in bis auf bis auf manche sachen und den arduino aufsatz der ist nicht so warum verwendest du hier c++ als programmiersprache weil ich das ding hier programmieren das was da hängt diesen microcontroller das geht nur sinnvoll in c++ es gibt nur micropiles implementierung das da aber ganz andere probleme mit und die rast implementierung ist experimental ja erzählen erzählen das mit dem mit der mit der klammer geschichte ich das will ich vielleicht vielleicht haben die sich ja wenigstens was bei gedacht schön finde ich trotzdem nicht aber ich mein sie haben sich immerhin vielleicht aber gedanken zugemacht so funktioniert das ganze doch schon mal ein bisschen übersichtlicher gemacht nice soll jetzt muss ich es noch schaffen im home assistant den sensor anzulegen ah jetzt minimieren wir den kramer wie viel versteht ihr ich checke gar nichts das bin ich mal gespannt was was ab abstimmung teilweise alles den größten teil was ist denn los wie es haben nur zehn leute mitgemacht bei der abstimmung das aber das aber wenig hätte ich gedacht normalerweise machen da immer mehr mit die meisten leute sind brain exploded ja normalerweise machen da irgendwie achtschleuder oder somit bei den anderen ist das ist das gehirn schon ausgestiegen ich habe die umfrage übrigens auch nicht gesehen ich habe die umfrage erst gesehen als sie fertig war die hat die hat wirklich richtig angezeigt nur dass die abstimmung beendet ist ok also wie legen wir jetzt in home assistant in home assistant einen neuen sensor ich weiß prinzipiell wie das funktioniert ich habe das schon mal gemacht aber so ganz sicher bin ich mir nicht aber ich kann irgendwo in meinem shit repo gucken du kannst ruhig noch mal die abstimmung machen ein bisschen länger laufen lassen dann gucke ich live mit hier discovery da steht es irgendwo drinne was man für topics senden muss genau so kann man sensoren anlegen also wie gesagt das ist meine meine testinstallation vom home assistant und hier in den developer tools sieht man was alles für geräte drin angelegt sind ist auch nicht viel weil es eine testinstallation ist ich versuche jetzt mal meinen strom sensor anzulegen und dann machen wir mal ein schöne da haben wir hier mal so schöne übersichtskarte mit wie nennt man das so druckanzeige wie war nicht wie warm wie viel das gerade verbraucht und so gucken wir mal so also das muss ich jetzt hinschicken sensor binary sensor ok das haben sie kacke formatiert also ich muss das hier das hier muss ich jetzt übermitteln dass es funktioniert die musik passt richtig gut ja ist nice umfrage läuft noch mal ok also zeigt mal her jetzt sehe ich die umfrage auch vorher wurden die mir nur angezeigt als die fertig war können wir hier alle mal eine runde dran beteiligen ich finde es witzig dass die meisten leute halbwegs durchblicken aber ein paar gar nichts checken und trotzdem gucken was übrigens sehr nice finde mich würde interessieren von jemand der gar nichts checkt guckt ihr das weil ihr was checken wollt oder weil es entspannend findet oder weil ihr mir gerne zuhört bei irgendwelchen dinge die ich mache oder das ist übrigens sehr gut jemand der nicht weiß was c++ ist der hat sich sehr viel ärger im leben erspart das würde ich auch bevorzugen nicht nicht zu wissen was c++ ist das könnte ich nämlich einfach sagen ok wir konnten gleich mal rein wenn die umfrage fertig ist zu erlauben uns dankeschön fünf monat subscription war das der icq sound der msn sound jetzt kommt die erklärung also wenn du das wenn du die geschweifler nicht schreibt wird generell nur der speicher reservierte ob das objekt ist nicht initialisiert warum kann ich denn aber dann was reinschreiben also sprich sagen wir mal so dass es internen zeiger auf den speicherbereich war einfach random sachen drin stehen und der zeiger auf den speicherbereich ist gültig aber da drin nix das ist c++ im prove in c++ muss die funktionssignale mit dem auf funktionsaufruf beidem ja das kenne ich das kenne ich aber warum gibt es klammer auf klammer zu klammer auf null klammer zu gleichheitszeichen dazwischen und ohne gleichheitszeichen das ganze noch mal backwards compatibility ja das kann sein ok das hier muss ich jetzt übertragen also ich kopiere mir das mal rein das heißt wenn ich den sensor in home assistant anlegen will dann müssen wir diesen krempel hier übertragen also schau mal mal schau mal mal mqtt wo sind wir hab ich das gelöscht also also mqtt publish publish so also wow was von ks ok das ist der das ist das topic ziegenkäse twitch bleiben für den sub und vorher auch noch irgendjemand den ich nicht gesehen habe jeder soll lauren zog den habe ich gesehen als für die ganzen subs ok also das ist denn das ist das erste was wir hinschicken müssen das ist das topic sprech das mal um dass das kleiner erkennen also mqtt publish wir haben jetzt ja gelernt dass das funktioniert das ist das topic ok dass das check ich noch das ist easy topic so und jetzt string message jetzt können wir gleich die super tolle neue c++ syntax verwenden und zwar wie war die noch mal so geht das jetzt auch aha verstehe audi feier plubus dankeschön für den für den prime sub so und da muss man jetzt den kram übertragen also die weiß glas temperature nein ich will die weiß glas energie haben wir machen das meine neue zeile dann sieht es vielleicht ein bisschen schöner aus wie formatier ich das jetzt sinnvoll das sieht das sieht trotzdem kacke aus so vielleicht nee ok ich schreibe das jetzt einfach mal so rein die weiß glas die weiß dass ich weiß dass das energie ist ich kann das nämlich einfach mal abgucken ok sensor ist watt champ watt champ total energie config ok so wie gehts jetzt weiter name achso name muss ich hier unten auch machen ok comma ach moment das ist ein jason objekt da müssen da müssen schweifte klammern drum herum boah das ist ja eklig so und was muss ich jetzt machen state topic nee name muss ich vergeben ok wie heißt das ding name heißt so wieder key watt champ total energie muss man die stärken die quotes nicht eskäpen nee das hier ist neues string literal syntax habe ich heute auch gelernt das ist neu wenn man das nimmt dann muss man das nicht mehr eskäpen dafür kann man auch nichts einsetzen in drinnen green style vier monate dankeschön für den sub der go live fünf monat jetzt fliegen die subs aber ihr habt hier nice nice huge iq für den chat wieder danke leute für die ganzen subscriptions dazu kann ich nur sagen hier hypersubscriber ok watt champ total energie und nun state topic state topic state topic ist anscheinend das gleiche wie das hier nur hinten mit state dran denn wir sollten es doch mal umbrechen kann man das vielleicht irgendwie so machen warte ich versuche es mal irgendwie halbwegs leserlich zu formatieren so ok ich glaube es ist zwar nicht wirklich schön aber man kann es irgendwie halbwegs lesen jetzt du meinst die klammern hier und hier nee das so ein stand schon da finde ich ok mehr braucht man jetzt nicht value template ist egal so das sollte jetzt funktionieren ich ich lade das mal hoch ach moment wir müssen den broker noch einstellen lull ne ich mach beides also ich ich lese den ich lese den stromzähler aus daraus kann ich mir ich kann mir für den den verbrauch den verbrauch kann ich direkt auslesen aber wie viel der aktuell gerade energie brauche kann ich mir da auch ausrechnen weil ich weiß ja in welchem abstand sagen wir mal die letzten zweimal gezählt wurde und wie viel pro tick also ich weiß dass keine ahnung ein tick ist 0,8 wattstunden und ich weiß es gab jetzt die letzten fünf ticks über eineinhalb minuten da kann ich mir auch ausrechnen so über den daumen gepeilt was er aktuell gerade gerade braucht habe ich aber nicht gemacht ich will jetzt erstmal gucken dass ich mir den sensor in meiner heim automatisierung anlegen legen kann ok also wenn ich jetzt alles richtig gemacht habe dann sollte der ich muss auch ich muss auch zu meinem mqtt server schicken dann sollte jetzt ein sensor anlegen dazu muss ich erst mal den mqtt server hier drauf überhaupt starten so config integrations wie ging das noch mal mqtt ne moment wo addon store mqtt das war mqtt broker installieren zack install config logins home assistant mqtt addon broker addon logins wie mache ich noch mal da verschiedene sonst ist sonst kann man sich da anonym anmelden oder logins kann ich so was sagen wie admin muss man kurz gucken wie die syntax richtig ist wie geht das jetzt logins hier logins ach so das ist wie das hat documentation ernsthaft logins optional ach hier null ok ich habe nichts gesagt usernamen admin 123456 beste beste save alles klar warum ist das wieder weg wollen ich veräppeln jetzt ging es oder was ist admin 123456 standardmäßig schon drin warum ist das fack ist das grad facking broken kann das sein oder muss man das quaten ok ich lasse es jetzt einfach so alles klar start ja ja warning ist gut passt ok sab checken wir mal ob das jetzt funktioniert kann man kann man jetzt subscribe ach so ja user user admin password 123456 ok scheint zu funktionieren ok wir lauschen aber jetzt versuchen wir die ganzen kram mal zu publishen ktt also user haben wir gesagt jetzt können wir auch gleich gucken ob die anmeldung funktioniert admin 123456 beste beste passport kombination überhaupt nimmt er den standard account das wusste ich nicht nee das ist gut das ist nicht gut ich will den standard account passport ändern können ohne dass ich also jetzt in dem fall schon aber ich will den standard account passport ändern können ohne dass ich meine ganze mqt mqt geräte anfassen will ok also dann schauen wir mal ob der das schafft dahin zu connecten admin 123456 und er publish dieses topic ok wenn es alles funktioniert sollte ich jetzt den sensor haben der watt champ total energy heißt und wir gucken mal ob das funktioniert wir gehen mal in die logs vom system der meckert nämlich rum wenn wenn man eine message die er nicht pasen kann normalerweise kann man hier oben logs auswählen warum geht das nicht ich glaube man muss erst advanced mode einschalten ne advanced mode für die big brain leute unter uns wir gehen uns nicht mit dem normalen normalen modus irgendwie irgendwie ab oh chocked nee das was anderes oder 1840 hat das jetzt funktioniert oder nicht ok ok es kam an es kam an es sieht auch in irgendeine art und weise wie gültig ist jason aus was ich da gepostet habe so der spur nach zumindest so habe ich jetzt den sensor da war eine dark theme einstellung ja machen wir jetzt gleich ja nee aber hier ok haben wir jetzt in watt champ das hat nicht funktioniert aber er hat nicht gemeckert oder ok ich lasse ihn einfach publishen in der loop dann sehe ich öfters wenn es ein fehler gibt ich habe garantiert irgendwo ein fehler hier in meiner jason syntax drin braucht es ein abschließendes comma oder nicht nee oder brauchst ich glaube es darf sogar gar kein abschließendes comma haben ich glaube die meisten fressen das aber ganz korrekterweise dürfte es das nicht so legt jetzt den sensor an system ach ich kann nur ich habe ja gar nicht die integration an die das die das einbindet configure enable discovery ich habe ja noch gar nicht eingeschaltet dass er das überhaupt macht submit finish system options ok passt und jetzt die wellopper tools nicht da aber ich meine published schön schön am publishen moment aber das topic stimmt doch stimmt das topic ja das topic stimmt ok discover das jetzt oder nicht er meckert zumindest schon mal nicht rum er sollte eigentlich den sensor watt champ total energy haben ich glaube ich restarte einfach noch mal ich restarte configuration server restart schadet nichts restart hilft restart geht immer das sieht jetzt schon so aus als müssten funktionieren von der sündags her die weißglas namestay topic ich habe die ganze zeit eine pizza neben mir stehen da und ich komme nicht zum essen kam jetzt zumindest hier noch fertig machen weil er wieder da notifications new devices discover check out ja ich weiß pizza ist kalt ok das juckt den nicht dass er das discovert warum nicht alles auf einem rechner weil ich das schlechter wieder runter krieg ok dann discovert das nicht warum nicht developer tools ok was was habe ich was was vergesse ich was habe ich verkehrt gemacht mqt discovery home assistant was habe ich was habe ich verkehrt gemacht if discover ich gucke jetzt einfach mal kurz in mein in meine richtigen home assistant weil da habe ich das eingeschaltet und das discover funktioniert integration konfigurieren da ist auch nichts nichts konfigured und im mqtt add-on ist auch nix konfiguriert also das von der idee her müsste das jetzt eigentlich funktionieren homos slash home assistant sensor watsch im total energy konfig aber es juckt hier nicht guckt mal schnell in meine konfig rein ob ich da irgendwas drin stehen habe ich habe nix großartiges dafür konfiguriert das weiß ich noch also sensor sensor nene nene nix nix nix nix drin das ist ein falsches system zum ausprobieren aber das müsste doch jetzt gehen? Okay wir gucken mal in die Logs. New Client Connected. ESP, da ist er. Ich meine er publisht ja auch. Okay keine Ahnung was der für Schmerzen hat ehrlich gesagt. Das müsste normalerweise funktionieren. In die Log steht auch nichts drin, dass es irgendwie nicht funktionieren würde. Ja gut funktioniert nicht, weiß nicht warum. Hab ich den Slash, muss ich den Slash am Anfang machen? Das kann sein dass man den, du hast recht vielleicht muss man den Slash nicht machen. Aber dann muss das Date Topic, das Date Topic müsste dann auch ohne Slash, also slashless sein quasi. Okay schauen wir mal. Kompost Champ jetzt muss es funktionieren. Auf gib, gib Gas. Okay er published, er published nicht. Moment ich hab, ich bin ja subscribed auf mit dem Slash davor. Okay gucken wir mal im Home Assistant was der jetzt sagt. Nix. Der Wattchamp, da ist er. Hat funktioniert. Der Wattchamp ist am Start. Sensor Wattchamp vor 33 Sekunden. Also Datenübertragung funktioniert. So und jetzt muss ich gucken wie ich dort Daten reingeschrieben bekomme. Der Wattchamp. Okay dann das da wird nicht in die Loop Verlage, das machen wir einmalig am Anfang. Create Home Assistant Sensors if not already present. Wenn sie präsent sind passiert einfach nix. Der Wattchamp ja. Aber schön ist dieses String Literal Suntags auch nett oder? Könnt man es vielleicht doch so machen? So viel, jetzt mal ernsthaft so viel schöner ist es auch nett oder? Aber wir könnten es vielleicht so machen. Um ehrlich zu sein sagt es auch. Ich lasse, ich lasse es jetzt einfach so. Ich mein immerhin, immerhin besser. Also wir brauchen den, wir brauchen den Wattchamp Total Energy. Wir brauchen den Wattchamp First Floor Energy. Ich mein wir könnten aus Total Energy minus First Floor Energy auch ausrechnen, was dann übrig bleibt, was das Erdgeschoss verbrauchen müsste. Können wir auch machen. Also quasi Wattchamp irgendwie Ground Floor Energy. Ich hoffe ich hab nix vergessen. Gibt bestimmt komisches Pre-Processing Zeug, um Jason direkt im Code zu schreiben. Garantiert, garantiert. Wo sind jetzt die Gifted Subs für den Big Brain Chat? Ja wir brauchen noch mehr Subs, dass der Chat noch schlauer wird. Also Any Primers am Start. Wenn ihr noch Prime übrig habt und euch das Stream gefällt. Der IQ muss Increased werden. Weil ihr wisst ja jeder Sub ist IQ++ für den Chat. Auf gehts. Nice. Ami Levin Bro. Vier Monate dankeschön für den Sub. Rebuild King dankeschön für den Sub. Code Need Application. Woodface. Das muss weg. Aber die Message ist überall anders. Ich mein ja ok das Topic und ne. Ich mein man kanns auch übertreiben oder. Mal schauen ob ich jetzt den Wattchamp. Guck mal. First Floor Energy Wattchamp. Ground Floor Energy Wattchamp. Total Energy Wattchamp. So das heißt ich kann jetzt schon mal. Wir löschen den ganzen Scheiß mal in meinem Dashboard. Braucht keiner mehr. So. Add. Eine Gautsche. Wattchamp. Ist noch. Achso ich hab noch kein State gesetzt. Ok. Wie setz ich State. Oder Flashbang ist echt krass. Moment Leute ich muss den Flashbang mal kurz weg machen. Ich hab ich hab nix ich hab nix dagegen. Flashbang. Second Payload. Das muss man jetzt machen. State. So und das müssen wir das nächste Mal in der Loop senden. Ok. Wahrscheinlich brauchen wir das gar nicht alles oder. Einfach nur einfach nur ein Stage. Ich glaub das brauchen wir gar nicht alles. Wir nehmen einfach nur das State Topic und Publishen das. Ok nehmen wir mal die drei Dinger. Niki das müsste standardmäßig gehen. Das geht. Du klickst hier oben drauf. Wählst aus was dein Maximum an Preis ist oder lässt es auf unendlich und dann benachrichtigt es sich immer. Und wenn du dann hier draufklickst und Notifications erlaubt erlaubst dann kriegst du ne ne also keine Pusht dann kriegst du so ne Android Notification. Auf deinem Phone. Android nicht auf dem iPhone ja ja ja. Nur auf Android auf iOS geht das nicht. Du musst ja Notifications erlauben. Windows Phone. Wenn wenn die die Notification App hier unterstützen geht das auch. Ja wenn Notifications nicht erlaubt sind dann geht es nicht. Aber das geht ich hab's auf meinem Android Tablet ausprobiert. Ok also wir brauchen jetzt State Topic. Moment das ist falsch was ich mir kopiert hab. State Topic. State also im Prinzip brauchen wir das da. State. State. Und jetzt wollen wir doch einfach nur in State übertragen. Copy Paste Champ na klar. Kann man da jetzt einfach nen Jason Wert schicken sowas. Probieren wir jetzt mal. So jetzt schickt er Null aber so funktionieren. Mindestens Value. Mal gucken. Ich mein Valid Jason müsste das sein oder? Wie schicken die das denn überhaupt in State? Hier Value Jason ne. Was das? Ne das ist Value Template das ist was anderes. State Payload Temperature Humidity. Nö ich glaube das geht. Schauen wir mal. Ok ok er publish das schon mal. Ne du hast recht. Der Value den will ich nicht haben. Ah wartet mal vielleicht ist es viel einfacher. Vielleicht gar kein Jason vielleicht einfach nur Null. Vielleicht einfach nur Null. Ich mein das ist ja ne Valid MQTT Message ne String mit Null. Da bin ich jetzt mal gespannt. So wenn das geflasht hat was sagt der übrigens ab in der History jetzt. Unknown Null. Ne das ist nicht numeric das mag er wahrscheinlich nicht. Ok auf. So gleich sollte es hoffentlich auf Null wechseln. Null. Exzellent. Kann ich jetzt mein nicest Dashboard machen? Wattchamp Total Energy da steht es schon. Bashen alter Bashen. So das ist Wattchamp Total Energy. Nehmen wir es mal. Gesamt Verbrauch. Exquisite deutsches Web Interface. Ich mein es ist Null und Maximum. Naja Maximum keine Ahnung. Wobei das ist ne dumme das ist ne dumme Anzeige für Gesamtverbrauch weil das wird ja immer mehr. Das wird das wird ja immer ne. Das wird ja immer mehr das ist eigentlich eigentlich so ne. So ein Ding bescheuert weil es gibt ja nicht von wie viel. Was bietet sich denn da an? Haben die den Craft oder so? History Craft? Die hatten doch jetzt so ne neue Craft Card. Hab ich doch letztens gesehen die haben doch jetzt so ne neue Craft Card gehabt. Durch den so das kann man sich ja alles ausrechnen. Ok wir machen jetzt erstmal Wattchamp Total Energy. Gesamtverbrauch Null. Ok. Unit. Ok. Das wird schonmal funktionieren. Die hatten irgendwo nen Craft. Ich hab's genau gesehen. Sensor Card? Ja. Ach Sensor Card heißt das. Klar. Was denn sonst? Sensor Card. Wattchamp Total Energy. Genau. Schau aus. Ok. Ok probieren wir das mal aus. Wir faken wir faken das jetzt einfach. Gesamtverbrauch. Wir faken das jetzt einfach. Gesamtverbrauch. Wir faken das jetzt einfach und rechnen das ein bisschen hoch. Duplicate Card. Das ist Total. Das ist First Floor. Erster Stock. Duplicate Card. Erdgeschoss. Schreib mal Erdgeschoss mit SS. Erdgeschoss. Ok. Ok. Nice. So und jetzt schreiben wir dann mal irgendwie random. Weil aktuell ist es ja nur Null. Aktuell ist es ja nur Null. Aber dann wirst du jetzt natürlich was realistisches reinschreiben. Also was ist realistisch. Wie macht man random? C++. Random. Random please. Rant. Rant. Wobei das in Arduino glaube ich auch eingebaut. Rant. Rant. Gib Rant. Was macht das standardmäßig? In Rant? Zwischen? Rant Max. Was haben wir da sonst noch random? W math. Was? Ok ich hätte nicht gedacht dass es so kompliziert ist. Rant. Kann ich nicht einfach sagen random zwischen A und B? Arduino random. Ok random. Min Max. Ok passt doch. Random zwischen. Oops. Random zwischen A und B. Dann machen wir hier First. Plus gleich. Ok ne das machen wir mal standardmäßig ein bisschen kleiner. Ok. So und jetzt übertragen wir hier Total Energy. First Floor. Ah Moment. Das funktioniert ja so nicht. Das möchte ja einen String und kein Int. Aber das können wir machen. Und jetzt rechnen wir Total Minus First Floor ergibt Erdgeschoss. Ok und jetzt überschreiben wir das hier einfach mal. Und lassen anstatt Message auch noch eine Int wenn man einfach eine Zahl übergeben will. Topic. Und jetzt Moment. Message. Keine Ahnung. String. Einfach passen lassen als String. Ok nice. Upload. So und er sollte jetzt random so tun. Dann krieg ich aber nen Standard String. Ich brauch hier nen Arduino String. So der sollte jetzt so tun als Mister irgendwas und das übertragen an den Home Assistant. Hast du nicht drei Etagen? Ne ich hab nur zwei Stromzähler. Also einen wo die oberen Sachen angeschlossen sind und einen fürs Gesamte. Also kann ich quasi nur aus oben minus Gesamt vermuten dass der Rest Erdgeschoss ist. So 100 Pro ist es nicht. Ok. Er überträgt die Dinge. Das ist schon mal gut. Bam. Guckt euch das mal an. Exzellent. Ich mein es wäre ganz schön viel ganz schön schneller Verbrauch. Ganz schön teure Geschichte. Für was willst du das auslesen? Na daraus kann ich mir jetzt errechnen. Die Werte sind gerade random generiert. Später kommen die von dem Sensor hier der da hängt. So daraus kann ich mir jetzt ja auch ausrechnen was aktueller Verbrauch ist. Indem ich einfach sag die letzten Messungen ein Tick ist so und so viel. Aber das ist schon mal nice. Guck mal hier das geht sogar. Also wie gesagt die Werte sind gerade noch total fake aber man kriegt das zumindest schon mal rein das ist cool. Ich will das ausnehmen nachschauen wähle ich ab und zu trotzdem. Ich will einfach sehen was drauf steht wie viel ich verbraucht habe ohne in den Keller zu gehen und was aktuell gerade alles zieht. Das ist nett anzuschauen ja. Warum geht das btw runter? Sollte das nicht hochgehen? Was könnte man sich jetzt da noch daraus ausrechnen? Also den aktuellen wie heißt das Leistung könnte ich mir noch ausrechnen also quasi geteilt durch Stunden. Geteilt durch Stunden geteilt durch 1000 dann kriege ich den Watt raus. Die Kosten oh das ist eine geile Idee. Das ist eine geile Idee. Das ist eine coole Idee. Wenn ich den Strompreis weiß kann ich ausrechnen was es gerade kostet am Tag und Prediction ja. Das ist eine coole Idee. Chat ich mag euch ihr seid big brain. Bester Chat. Richtig gute Idee. Btw was sagt uns dieser Graf da unten eigentlich? Auf was kann man das noch tanken lassen? Na gut es geht halt hoch. Was ist das für eine Bescheide? Kann ich sagen 1? Ok jetzt gehts halt volle Pulle rauf ja. Ok ich könnte mir jetzt natürlich noch fake mäßig. Jetzt wirds mir zu exquisite. Also was ich jetzt machen könnte. Also das rechnet pro Sekunde gerade aus. Aber wir tun einfach mal so als wären das echte Sensor Werte. Es können ja gar keine echten Sensor Werte sein. Der Sensor hängt gerade auf meinem Basteltisch hier nebendran. Wie könnte ich denn jetzt. Wie errechne ich denn jetzt am besten die aktuelle Leistung in Watt. Also ich mein das hier ist der Wert in Kilowattstunden. Das heißt das ist Kilowatt mal Stunde. Das bedeutet im Endeffekt ich muss das ganze teilen durch Stunde. Allerdings muss ich dazu wissen. Oh ne das wird zu big brain jetzt da kommt das macht man hier nicht mit. Ok aktuell ist es einfach. Aktuell ist es einfach. Aktuell ist es jede Sekunde. Aktuell ist es jede Sekunde. Das heißt ich müsste das jetzt nicht einfach. Durch 6 durch ne was 3600 ja. Müsste ich das nicht einfach teilen durch 3600. Also in dem Fall ist es jetzt einfach weil es immer im Abstand von einer Sekunde kommt. In Wirklichkeit kommt es ja im Abstand von 2 Sekunden 5 Sekunden je nachdem wie gerade der Verbrauch ist. Also ich müsste mir nicht nur merken. Wann ich den Wert dass ich den Wert habe sondern ich müsste mir auch noch merken. Die die die die nen Timestamp. Und dann müsste ich sagen wir mal sagen die letzten 10 Timestamps. Rechne ich aus wie ne. Wisst ihr wie ich mein. Die letzten 10 Timestamps würde ich dann ausrechnen. Hoch auf ne Stunde. Und das würde dadurch teilen. Macht noch tüsslich was wie ein Tacho. Jaja das kann ich machen aber ich muss das erst mal ausrechnen. Ich meine die einfachste Variante wäre doch. Also nur mal von den Zeitmärkten wenn die Schleife losgeht dann. Aktueller Wert. Minus. Minus letzter Wert. Aber willst du das echt auf dem ESP machen. Warum nicht. Der langweilt sich ja. So aktuell. Ok also. Letzte Zeit. Minus. Letzte. Zeit. Oder. Letzter. Timestamp. Dann rechne ich aktueller Wert minus letzter Wert. Muss die Intelligenz im ESP sein. Eigentlich nicht aber es ist doch nice. Dann muss ich in meinem Home Assistant configuration. Das wird einfach so eingeliefert und umgutes. Mal umgedreht was spricht denn dagegen das die Intelligenz im ESP ist. Warte mal hat Home Assistant nicht schon sowas eingebautes. Energy Sensor vielleicht können die das schon für mich machen. Aha. Ok dann mache ich das nicht im ESP dann kann man das anscheinend im Home Assistant direkt machen. Ah die haben schon was eingebaut was das macht für mich. Ah yes. Ok das geht natürlich auch. Cycle. Daily. Weekly. Monthly. Yearly. Viertelstündlich. Ok. Ok. Das probiere ich mal aus. Home Assistant. Addon. Ich brauchte Special Studio Addon da ich was editieren kann. Ja Nikki sowas in der Richtung dachte ich mir auch. Du hast es aber auf den Punkt gebracht. Aber ich probiere das jetzt mal aus in Home Assistant auszurechnen. Das klingt mir erstmal tatsächlich sogar sinnvoller. Ne der Flash nutzt sich nicht ab ich mein ich muss eh den letzten Wert immer speichern. Dass ich es recovern kann. Oder aber ich übertrag einfach nur immer den letzten Tick. Ich übertrag einfach immer nur den letzten Tick mit Timestamp und der Home Assistant rechnet. Muss ich mir mal überlegen was was sinnvoller ist. Aber ich probiere das jetzt mal hier mit aus. Configuration. Show inside bar. Jawoll. Oh White Seam. Oh Hilfe Hilfe. Oh jetzt jetzt jetzt jetzt jetzt. Anstrengend. Knapp. Knapp. Flashbängt. Also was brauche ich? Source. So wie heißt mein Energy? Wie ist das? Sensor Wattchamp Total Energy. Sensor Wattchamp Total Energy Source. Monthly. Nein ein Viertel stündlich. Wo habe ich den jetzt gefunden? Ach komm mal mal stündlich. Check config. Gültig. Restart. Brüchelst du die Code im Browser. Das schöne ist du hast dann alles in deinem Home Assistant drin und musst dann nicht irgendwelche externen Tools nehmen. So Utility Meter gibt es da für eine Karte. Cards. Aber man kann sogar man kann sogar Verbrauch Kosten direkt ausrechnen lassen oder so. Okay. Okay das heißt ich habe jetzt habe ich jetzt hier einen Utility Meter drin. Wie das Code ist ein Browser. Da wird man ja eigentlich oft genug dran erinnert. Also das ganze Look in Field schreit halt irgendwie Browser. Wo ist der Sensor? Ah. Nee das hier ist. Ah guckt mal wenn ich den Home Assistant neu starte dann ist das Anlegen der Sensoren gar nicht dabei. Das heißt das muss ich auch in der Schleife machen. Sonst ist es danach weg. Da muss immer wieder die Sensoren pro Schleife neu anlegen. Weil ansonsten sind die Dinger nach dem Home Assistant Restart fort. Okay es ist aktuell Null. Logisch. Weil Sensor Wattchamp überhaupt nicht existiert. Aber gleich wird Sensor Wattchamp wieder angelegt. Und zwar. Ja C. Arduino ist halt C++. Das ESP EDF ist reines C. Aber da muss man sehr viel selbst machen. Okay Sensor Energy. Friendly Name Energy. Holy. Okay. Okay. Okay. Okay. So und was genau macht das Ding jetzt? Äh. Hä? Okay das check ich. Alter die Flashbang-Seite. Für was ist das jetzt genau da? Den Sinn verstehe ich nicht. Das berechnet den stündlichen Verbrauch? Vielleicht? Keine Ahnung wenn ich ehrlich bin. Den Sinn erschließt sich mir gerade nicht so wirklich. Okay das. Das check ich nicht. Ja ich hab meine Pizza noch am Start. Okay da verstehe ich nicht so genau was der Sinn davon ist jetzt ehrlich gesagt. Wahrscheinlich der resetet sich pro Stunde dann immer wieder. Oder der lernt das jetzt und zeigt dann den Durchschnittsverbrauch pro Stunde an. Also ich kann mir dann quasi irgendwann einen Craft angucken. Mit Durchschnittsverbrauch pro Stunde oder sowas. Ach hier last reset collecting. Wahrscheinlich zeigt er mir das dann pro Stunde verteilt irgendwie an. Pizza Pepperoni Wurst. Find ich meine Anzeige viel geiler. Ganz schön teurer Spaß gerade. Ich war das Ding verbraucht pro Sekunde. Also randomize zwischen einem und dreihundert. Ne zwischen zwei und 350 Kilowattstunden pro Sekunde. Es ist vielleicht doch ein bisschen unrealistisch was mein random gerade da macht aber. Gut vielleicht hab ich meinen Keller voller Miner. Weiß man es dann. Was was ist denn diese Tarif Geschichte. Oder Tarif. Ach so. Ok ein Beispiel wäre da schon mal irgendwie sinnvoll. Peak off. Ach so ok das Ding zählt und resetet sich dann automatisch wieder. Das heißt er zeigt mir an ob welchen Tarif ich gerade verwende. Aber da rechnen für mich nix aus. Was ist denn die DSM. Was ist was was holländisches. Ach man kann mehrere Sachen zählen oder wie. Ok aber das erschließt sich immer noch nicht so immer noch sich so genau ich mein. Ok was man damit machen kann ist halt man hat eine schöne Statistik wie viel man im Monat verbraucht hat. Ok meinetwegen. Wie kann man denn Home Assistant Persist MQTT Sensor. Ich weiß wie ich die Persisten kann die MQTT Sensoren. Ich muss einfach nur sagen hier dass der die im MQTT Server speichern soll die Messages hier ich muss ihm sagen. Retain eins. Dann speichert er sich immer nehme ich immer die letzte Message und das überlebt den Neustart. Das probiere ich jetzt mal aus ob das klappt. Weil ansonsten sind die nach dem Neustart immer weg. Und dann gehe ich meine Pizza essen Leute. Aber die Idee dass man das man noch die Kosten anzeigen kann finde ich echt nice. Publisher noch. Er Publisher noch. Und ihr seht er hat sich die Werte gespeichert vom letzten Mal. So und jetzt Restart ich mal Home Assistant und gucke ob der Kram dann da bleibt. Server. Restart. By the way normalerweise habe ich das Hessisches H-Addon. Und ich mache zu mir Commando Zeit. Zu hell. Zu hell. Ist er wieder da? Nice. Ok guck mal jetzt hat er sich es gemerkt. Alles klar ok. Ja im Grafana Welt kann ich es auch anzeigen. Aber so eine Übersicht Grafana anzeigen ist bei mir easy weil ich habe einfach die Prometheus die Prometheus Integration bei Home Assistant an. Da kann ich direkt die Sachen da auslesen. Beispielsweise für Batteriestand guck mal. Dashboards. Guck da sehe ich den Batteriestand von meinen Fenstersensor und Dingern. Die sind fast alle voll außer der Eingangstürsensor der ist bei 27% fast leer. Ich guck mal ob ich im nächsten Stream mein Home Assistant zeigen kann. In der Hoffnung vielleicht nicht zu viel Leake. Ja aber das finde ich nice hier. Das hat was. Das kannst du machen. Ich finde es aber schöner die Sensoren ins Home Assistant zu schreiben und die aus dem Grafana auszulesen als nochmal eine extra Datenbank parallel zu haben. Aber gibt es verschiedene Ansätze. Ok ich weiß nicht ob ich das ausrechnen jetzt noch machen will. Aber nur mal so von der Idee her chat. Wenn ich jetzt ausrechnen will. Wie viel Leistung ich gerade brauche. Dann könnte ich doch so was machen. Nur mal von der Idee her. Sagt mir mal ob ich falsch lege. Ich speicher mir hier quasi. Keine Ahnung. Long oder was ist Millis. Unsigned long. Keine Ahnung. Last. Und jetzt würde ich dann sagen aktuelle Zeit minus letzte Zeit. Das sind dann quasi die Millisekunden die es zwischen zwei Messvorgängen gebraucht hat. Weil das ist so sehr über den Daumen gepeilt dann. Ich müsste das eigentlich schon samplen über die letzten 10 Messvorgänge oder so dass es ungefähr genau ist. Mal gucken. Also das sind die Millisekunden. So und jetzt müsste ich die Millisekunden hochrechnen auf eine Stunde oder. Also quasi. Oh nee Moment jetzt ist mein Brain. Das ist jetzt ist mein Genie. So das ist das letzte. So und das ist der aktuelle Wert. Das ist der aktuelle ich das ist der aktuelle Wert. So das heißt. Das heißt dass der. Das heißt dass der aktuelle Wert minus der letzte Wert. Wobei nee. Moment es ergibt keinen Sinn es ergibt keinen Sinn es ergibt keinen Sinn. Das hier ist immer gleich. Das das ergibt nämlich keinen Sinn was ich hier mache. Der gemessene Wert pro Tick ist immer gleich bei den echten Sensoren. Also bei diesen Zählern ist es immer ist es immer gleich. Also sprich. Eine Umdrehung ist immer gleich viel. Und ein Plinken ist auch immer gleich viel. Die Dauer macht es aus. Also das was ich hier mit dem random mache ergibt eigentlich überhaupt keinen Sinn. Ich will eigentlich nicht. Das kann ich das kann ich mir das kann ich mir eigentlich komplett sparen. Das kann ich mir komplett sparen. Es ist nicht random. Ich sag mal ich sag jetzt einfach mal es sind immer es sind in dem Fall immer plus zwei. Und in dem Fall hier halt keine Ahnung plus eins ist egal. So weil so ist das bei dem echten bei dem echten Meter ja auch. Es ist immer der gleiche Wert wenn es wenn es hoch zählt. So aber die Zeit. So ich weiß jetzt wie lange es zwischen zwei Ticks gedauert hat. Nämlich aktuelle Zeit minus letzte Zeit in Millisekunden. Und jetzt kann ich doch. Warte mal was ist denn jetzt wenn ich. Ich bin. Muss ich das jetzt auf 3600 rechnen. Aber dass der Gesamt Verbrauch das bringt mir nichts. Ich muss den. Okay es sind immer zwei. Es ist immer zwei. Kein Ticks ist gegen zwei. So. Das sind jetzt zwei. Was auch immer. Da haben wir mal zum Beispiel. Das wäre jetzt. Was es eigentlich keinen Sinn ergibt weil es ist eher. Es geht eher in Richtung null Komma irgendwas. Also sagen wir mal so wir lassen mal das mit dem. Das kann ich mir aus ausdenken. So und und. Das da muss ich jetzt in Stunde umrechnen. Also sprich. Millisekunde. Geteilt. Doch. Nö. Warte mal tau. Ah. Pick Brain. Slow Brain eher. Eher. Oye. Oye Brain. Alter. Also sprich. Das was da drin steht sind so und so viele Stunden. Durch tausend. Warte mal. Also 20. 20 Millisekunden durch tausend 0 Komma 0 2 Sekunden. Das kommt doch hin oder. Ja. Doch. Durch tausend 0 Komma 0 2 Sekunden. Ok. Durch. 60. Sind Minuten. Gibt das irgendwie Sinn. Durch 60 sind Minuten. Und nochmal durch und nochmal durch 60 sind Stunden. Oder. Also im Prinzip. So. Aber das haben wir als Float. F Float. Kann das kann das. Kann ich das so machen. Papiert er das dann. Ok das müsste doch eigentlich so stimmen oder. Und jetzt sind das. Jetzt ist das quasi. Die Millisekunden in einer Stunde. Nee. Wisst ihr was viel besser ist. Nee nee nee. Wisst ihr was viel besser ist. Ich rechne nicht die Millisekunden in Stunden um. Ich rechne die Ticks in Millisekunden um. Dann ist es viel genauer. Glaub ich zumindest. Quickmaps. Also quasi. Also quasi Ticks. Also keine Ahnung. Also ich rechne das jetzt quasi um in Watt Millisekunden. Gibt es diese Einheit überhaupt. Alter. Gibt es Watt Millisekunden. Auto. Ich weiß nicht genauer. Also. Das ist jetzt pro Stunde. Das heißt das rechne ich jetzt auch durch 1000. Ich mache doch im Prinzip genau das gleiche wie hier oder. So. Das sind. Das sind. Watt mal Millisekunden. Also Watt Millisekunden. Wie viel Thread kann das Teil 2. Also du kannst beliebig viele machen aber 2 2 beliebig viele weiß ich nicht. Wahrscheinlich 128 oder so. Aber. Was soll ich jetzt sagen. Du kannst nur 2 Stück gleichzeitig ausführen. So. Genau. Watt Millisekunden sind das dann. Und jetzt. Alla mein. Mein. Mein. Current ist zu. Ok. Das sind. Millisekunden. Das heißt wenn ich jetzt weiß. Das war zwischen dem aktuellen Tick und dem letzten Tick. So. Aktuellen Tick und im letzten Tick. Habe ich. So viel. Millisekunden verbraucht. Und das Teile ich jetzt durch die Millisekunden hier oben nochmal, weil dann bin ich bei wat übrig oder? Denn wenn ich das jetzt teile durch die Millisekunden, dann habe ich eigentlich das raus, die aktuelle Leistung oder? Oder? Gibt das Sinn? Okay das müsste jetzt immer konstant sein, weil es immer pro Sekunde ist der Tick. Wir machen das jetzt mal anders, wir machen das jetzt mal anders, wir machen das random, das random machen wir in das Delay und zwar zwischen einer Sekunde und 15 Sekunden. So, weil jetzt müsste das anders sein und last muss ich da noch setzen, last muss ich noch setzen hier nach, also wollen wir so now, boah exquisite, exquisite shit, so now, beim ersten Mal stimmt es halt nicht, aber gut egal, was ist dein Lieblingsemote? Und jetzt muss ich last setzen auf, für den nächsten Durchgang, für den nächsten Durchgang. Okay, Print, MS, 7 bang, danke schön für den Zapp, ich mein 2000 Kilowatt pro Tick ist halt vielleicht ein bisschen, 2 Kilowatt pro Tick ist vielleicht ein bisschen viel. Ich glaube die Zähler ticken alle 0,8 Watt, Wattstunde, aber wir können aber gucken, ob da jetzt was sinnvolles rauskommt, Upload, ähm, Zähler, LED, warte mal hier steht es doch immer drauf, guck mal, hier 75 Umdrehungen pro Kilowattstunde und hier Impuls, 1000 Impulse pro Kilowattstunde macht der hier, äh, äh, wie die Daten abgerufen werden über 2 Sensoren, guck mal, also ich zeig sie mal an dem Bild, das ist besser, hier einmal per Infrarot-LED und hier per äh, Lichtsensor, also sprich, die LED auslesen kann man, kann man damit, du siehst ja auch wenn ich die, das Ding ist lichtempfindlich hier vorne, wenn ich das zu halte geht das Licht aus und es zählt ja auch ein bisschen hoch dann, allerdings backt es gerade rum, weil ich so auch hoch zähle, äh, ich zähle auch so hoch, das kommt sich gerade ein bisschen in die Quere und, ähm, für den Oldschool-Zähler, wo hab ichs hin Leute, hier das da, das da verwende ich für den, für den Oldschool-Zähler, das macht folgendes, das ist Infrarot-LED und ein Empfänger und der erkennt, wie viel Licht einfällt und bei diesen alten Sensoren ist es halt so, wenn die Scheibe normal ist oder rot ist, dann reflektiert das unterschiedlich viel von dieser Infrarot-LED zurück und handdessen kann ich erkennen, ob gerade das rote Ding durchläuft oder nicht. Also die Infrarot-LED leucht drauf, der Empfänger empfängt das und anhand der Menge, ich bin mir jetzt nicht sicher, ich vermute mal, dass das, ähm, silberne mehr reflektiert als das rote, anhand dessen kann ich jetzt auslesen. Ok Leute, also unsere Rechnung funktioniert nicht, das erste klappt, also sprich das da funktioniert, aber das funktioniert nicht, warum nicht, ah, aber warum sind die null, die sollten nicht null sein, die sollten nicht null sein, ist das ein Int, Moment, ist das ein Int, nee, 2000 durch 1000, durch 60, das ist doch nicht null, ah, Moment, das ist null, komm mal, aber rundet der das irgendwie, das kann, wie ging der Scheiß nochmal, wie konnte man ihm das nochmal sagen, ich will das als Float machen, war das nicht mit F, uuh, warte mal, ich hab das hier oben doch verwendet, nee, ah, uuh geht, L für long vielleicht, das muss ich doch bestimmt nicht, bestimmt nicht so machen, oder, normalerweise reicht, wenn eins davon ein Float ist, dass er das, dass er das als, als, äh, Komma stellt berechnet, vielleicht ist auch einfach nur das Printline zu dumm, ah, Moment, Moment, Moment, Float, Float durch den unsigned long, es sollte doch eigentlich in der Lage sein, wisst ihr was, wir casten das jetzt nochmal, man weiß ja nie, Upload, da muss jetzt irgendwas rauskommen, das garantiert nicht null, er bootet, exquisite booten, bringt so schön, nice, dass so viele bei so niche Dingern auch mit am Start sind, null, wo ist das Problem, warum ist das null, das ergibt doch keinen Sinn, ja 0,0, rundet das irgendwie, so wir stringformaten das, würde das irgendwie, das wäre aber ganz schön fail, wir nehmen die FMT Library, die sollte das besser hinkriegen, gehen wir jetzt einfach, wir lassen das FMT formatieren und dann, so mal gucken, ah, da kommen wir der Sache schon näher, 0,005557, by the way, eigentlich kann ich das einmalig ausrechnen und immer, immer wieder verwenden, oder, das ändert sich ja nicht, weil ich guck mal, bei dem, bei dem Tick hier, nennen wir mal das Ding, würden wir mal theoretisch den da nehmen, ne, der hat pro Tick, ne was, 10.000 Impulse pro Kilowattstunde, das heißt 10 Impulse pro Wattstunde, Moment, sind das, sind das, sind das dann 10 Impulse pro Wattstunde, oder, weil ich mein durch 1000 und hinten durch 1000, 10 Impulse pro Wattstunde, das heißt dann was, ein Impuls pro 0,1 Wattstunde, ne, einfach Komma verschieben, oder, also sprich, pro Tick sind es 0,1, 0,1 Wattstunde, ne, ist das eigentlich richtig so, also das sind dann 100, sind das 100 milli Wattstunde, ok, jetzt kommen, jetzt kommen deutlich realistischere Bereiche, würde ich sagen, so nicht, als hätte ich meinen Keller voller Miner, also wahrscheinlich sind das dann hier, ne und, wow, wow, wow, wow, wow, wow, ok, 2,77, 2,77 kann ich rechnen, oder, ich mein, das ist jetzt 2,778 und irgendwie noch dann 8, 8 Nullen oder so, ne, Moment, was heißt das in dem Fall, hoch, ne, hoch minus 0,8 sind das, 2,77 hoch minus 8, ne, also Nullen vorne dran, oder, ey, warum kann es der Google Calculator nicht, warum, warum eigentlich 0,8, warum nicht einfach nur hoch minus 8, also 0,, habe ich jetzt richtig gerechnet, 0,00028211081 Wattmillisekunden, alles klar, meine Fresse, was Zeug, da kann ich mir den Kram sparen hier oben und, das muss ich jetzt sein lassen, das muss ich jetzt da lassen, ok, nein, habe ich was falsch gemacht, ah, nicht hoch, sondern minus, mal 10, ach ja, ja, ja, ja, genau, genau, mal 10 hoch minus 8, ja, ich weiß, ich will wissen, was das für eine Zahl ist, Alter, so, wir machen das jetzt mit der Quickmaps-Suchmaschine, Alter, so, so, siehst du, so ist das gut, hallo, copy, paste, Kleintext, nice, ok, bei mir war das einfach um 1000 Nuller verkehrt, ja, Moment, passt das überhaupt in den fucking Float rein, das ist ein Double, ne, das reicht, das passt in den Float überhaupt nicht rein, na gut, ein Double durch den Float sollte ein Double ergeben, oder, ja, so, und jetzt geben wir mal das Ganze aus, mein Verbrauch in Watt, so, stimmt es jetzt, was ich hier mache, so, was ich jetzt ausgebe, ist mein Verbrauch in Watt zwischen, also gesampelt quasi auf diese zwei Werte, so, auf den letzten Wert und aktuellen Wert, ok, mal gucken, ich mein, das ergibt jetzt keinen Sinn, weil es halt random ist, von einer Sekunde bis, also, ich verbrauche irgendwas zwischen fünf und acht Watt, was heißt ich verbrauche, meine Geräte brauchen gerade, dass sie laufen so viel, weil Watt ist ja quasi Energie pro Sekunde, ne, also quasi, ursprünglich mal sowas wie Joule pro Sekunde, so ganz klassisch, ja, so, das kommt doch von den Werten her recht gut hin, Watt ist kontinuierlich, Watt ist eine einfache Schreibweise für Energie pro Sekunde, was ist der Stand vom Projekt, wir rechnen gerade den Stromverbrauch aus, Big Brain Muffs, Alter, exzellent, ähm, das ist aber falsch, hab ich das falsch rum gerechnet, weil das ist doch jetzt tatsächlich ein bisschen, sehr wenig, hoch minus zwölf, Quickmuffs, ah Leute, fertig Quickmuffs, ich hab Hunger, ich fress jetzt meine Pizza, so, exzellent, soll ich Stream ausmachen oder wollen wir noch Runde Barbecue Pit Boys gucken oder irgendwie sowas, hallo, möchtest du nicht ausgehen, wo muss es denn ausgehen, ah, geh aus, ok, ich brauch Fressstells Video, ah, yes, also, was haben wir hier, Bacon Egg, Chicken Pig Cheese Wrap, hell yeah, Kouda Time, ah, yes, die Musik im Hintergrund, so, ich futter jetzt meine Pizza nebenbei, Leute, ich hab übeles Hunger, ist schon kalt, Moment Leute, der hat ne neue Marete, was ist mit dem denn los, der hat doch drei Jahre lang oder so, diese alte, ungeschärfte Marete verwendet, die nie was geschnitten hat, ich schneiße Kouda Time, ich hab Hunger, ich fress jetzt meine Pizza nebenbei, Leute, ich hab übeles Hunger, ich fress jetzt meine Pizza nebenbei, Leute, ich fress jetzt meine Pizza nebenbei, Leute, ich fress jetzt meine Pizza nebenbei, Leute, ich fress jetzt meine Pizza nebenbei, Leute, ich fress jetzt meine Pizza nebenbei, Leute, ich fress jetzt meine Pizza nebenbei, Leute, ich fress jetzt meine Pizza nebenbei, Leute, ich fress jetzt meine Pizza nebenbei, Leute, Was ist, was ist Poultry Powder? Makes no sense. Dota, neun Monate Dankeschön für den Sub. Exquisite Subscription. Ups, falscher Irgendein Curry? Das sieht eher nach Senf aus. Nee, Mustard, sag er doch, Mustard. Das ist Senf. Das vorher ist irgendeine Curry-Pulver oder so. Was ist denn? Was? Er hat ja grad gesagt, da ist Pferd drin. Oh, ist keiner auf mein Chibate reingefallen. Andere Leute machen da nen Sandwich drum, die machen Hähnchenbrust drum. Kann man machen. Through the Miracle of Time. Kommt jetzt gleich. Through the Miracle of Time auf Sachs. Okay, nein, heute nicht, heute nicht. Cocktasty. Guck mal, da hat er ne Wurstgrille. Ich finde das geil. Seit Anfang dieser Videos hat er dieses gleiche Lachen drauf. Ich kann das gar nicht nachmachen. Immer das gleiche, aber das ist so Markenzeichen schon. Warum genau hat er gerade mit dem Messer in das Mehl gehauen? Warum? Hat er das abgeklopft, das Mehl. Um Dominanz zu zeigen, genau. Boah, da sind ja 3 Liter Panade dran. Was ich persönlich äußerst nice finde. Mir schmeckt bei panierten Sachen die Panade meistens am besten. Der frittiert wird das gleich noch. Wir dürfen nicht von ausgehen, dass das nur normal gebraten wird. Das kommt erst mal in 3 Liter Öl rein oder so. So wenig Öl? Was ist denn mit denen los? Das erweckt ja schon den Anschein, gesund zu sein. Das ist ja viel zu wenig Öl. Ich hätte das eigentlich gedacht, er macht die Pfanne voll. Man muss die Schnur nicht wieder raus bekommen. Die Schnur ist so weich gefrittiert, die kann man einfach mitessen. Ich lasse C++ jetzt im Tiefel, weil ich gucke das jetzt wieder an meine Pizza und gehe ich eh demnächst auf. Das ganze Dorf damit zu füttern wird vielleicht auch ein bisschen knapp. Moment, das ist noch gar nicht fertig. Das kommt jetzt erst noch mal 2 Stunden in den Ofen rein. Und jetzt Pay-per-Fat-Modus aktivieren. Ganz ehrlich, ich würde das ohne die Soße essen und mal probieren. Wisst ihr was ich dabei machen würde? Ich würde das Teil nehmen, bisschen Hot Sauce und Fettich. Das obendrüber bräuchte ich gar nicht. Ich sehe da eine Wurst. Das Ding ist so groß mit dem ganzen Teller. Ich finde dieses Acting auch immer so übertrieben. Ist der Stromauslöser fertig? Na ja, wo ist meine Hand? Erzählt aktuell, erzählt aber noch nicht das Richtige. Was haben wir sonst noch zu bieten? Okay, das scheitert bei mir schon mal, dass ich keine Papronis oder was ist denn das überhaupt gewesen? Paprika oder wie die das immer geil aussprechen, Paprika im Garten haben. Wir haben hier Eier, Tomaten, Olivenöl, hier ein Ging, hier haben wir frische Bratten und du wirst es brauchen, und wir werden unsere SPG benutzen. Also, das erste was wir tun, ist ein wenig Öl drauf zu nehmen und es auf den Kast-Iron-Pan zu legen. Das hier ist einer dieser fanciösen Kast-Iron-Pans, aber du kannst auch einen normalen 10-Inch-Black-Iron-Pan oder Kast-Iron-Pan benutzen oder was du hast. Und dann wollen wir die Seiten des Jigs oder des Molls ölen. Und jetzt wirst du ordentlichen Porkbelly-Bacon oder Streaky-Bacon nehmen, für diejenigen, die es streaky nennen, und wir wenden den Jig oder den Moll mit dem Bacon. Und wir machen einen Kast-Iron-Pan, so zu sprechen. Jetzt kann man sehen, dass die Supreme-Parte hier auskippt, oder? Also, du bleibst das hier auf und nimmst ein paar halbe Stück und... Erstmal Bacon-Stabeln. Kann sich noch einer an die alten Epic Mealtime-Videos erinnern? Bacon-Strips, Bacon-Strips, Bacon-Strips und Bacon-Strips. Mittlerweile guck ich den Kram nicht mehr. Das war früher nice, irgendwann ist da die Luft raus. Was gibt das denn? Das gibt im Endeffekt Rührei in Bacon, oder wie? Da ist ein paar drin. Dann nehmen wir ein paar Zwiebeln Chili-Papier. Und natürlich ist das eine Prüfung des Pitmasters, aber es ist eine Supreme, also nimm dir einen deiner Lieblings-Chili-Papier und lege ihn ein bisschen drin. So. Und wo genau... Warum kann ich nicht... Warum kann ich nicht das Ei und den Bacon in die Pfanne machen und braten? Ich meine, das sieht danach da nicht so cool aus. Erstmal alles komplett mit Haut geschnitten. Mit Schale. Warte! So, Pizza weg. Pizza leer geföttert. Okay, ich gucke jetzt noch mal, was da rauskommt. Geht das Programmieren jetzt weiter? Ich bin mir noch nicht ganz sicher, ob ich weitermache. Die Rechnung musst du auf Mal statt Geteilt ändern, okay. Mach ich. Moment, das Video ist erst halb fertig, da kommt noch was. Aha. Barbecue Soße. Die Sound-Effekte sind so geil. Also das ist für mich der Inbegriff von Kokona-Essen, dieser Channel, aber ich gucke es immer wieder gern an. Ich gucke es seit Jahren schon. Ich habe noch nichts davon nachgemacht oder gegessen. Das sieht aber echt gut aus. Das sieht echt gut aus. Das muss man mal sagen, das sieht wirklich nice aus. Pocktasty. Die Brotscheiben sind ein wenig ungleich geschnitten und schepp. Die Bacon? Ne, keine Ahnung. Die Musik. Ah, jawoll, da muss ich ordentlich Fett-Mayonnaise drauf, jawoll, so geht's. Ich habe keine Ahnung, was ein BLT ist. Boah, Alter, wer soll denn das ins Maul kriegen? Wer soll das essen? Ach du Scheiße, what the fuck? Es sieht geil aus, aber das kann doch keiner essen. Erstmal Kiefer ausgeregt. Also reinhauen würde ich es mir jetzt trotzdem. Ein bisschen heiß, ein bisschen heiß. So wirklich glücklich sieht er nicht aus damit, oder? Erstmal wegspülen. Ach, ich guck die gerne. Ich guck die gerne. Kekona-Style. Oh Leute, es hat rebooted, seht ihr das? Es ist gecrashed. Es ist gecrashed, was ist da los? Es hängt in der Bootschleife und ist kaputt. Es startet nicht mehr. Overflow, vielleicht. Ich bin mir aber nicht so ganz sicher, warum. Finger League, OMG. Vielleicht ist es wirklich overflowed. Aber RIP. Achso, ich muss wieder. Geräte. Oh, das crasht? Direkt? Reconnect? Ah, ich weiß warum das crasht. Ich hab mir den Exis-Point rausgestöpselt gerade. Wenn ich den Exis-Point rausstöpselt, geht natürlich das W-Lan nicht und dann startet es sich neu bis das W-Lan wieder geht. Das erklärt es natürlich, alles klar. Ok Leute, ein äußerst nicer Stream. Und wir sehen uns. Heute war richtig viel angesagt. Morgens Aufwachen Stream, jetzt Progress Stream. Bis dann, machts gut, wir sehen uns, CU.", "segments": [{"id": 1, "start": 0.0, "end": 19.88, "text": "So, weiter gehts."}, {"id": 2, "start": 19.88, "end": 39.64, "text": "Muss grad mal alles anmachen, dauert kurz noch."}, {"id": 3, "start": 39.64, "end": 50.4, "text": "Gut, ich muss mal kurz was checken."}, {"id": 4, "start": 50.4, "end": 53.64, "text": "Excellent."}, {"id": 5, "start": 53.64, "end": 67.92, "text": "Okay, also exquisite, bin wieder am Start."}, {"id": 6, "start": 67.92, "end": 74.84, "text": "Quizzet, bin wieder am Start. Also wir machen heute weiter, da wo wir gestern aufgehört haben und als"}, {"id": 7, "start": 74.84, "end": 82.84, "text": "allererstes brauche ich zum testen eine lokale Home Assistant Installation. Oh ja und wie ich C++"}, {"id": 8, "start": 82.84, "end": 93.92, "text": "mag. Moin Patrick, auch am Start. Ist der Preis-Champ mit C++ erstellt? Das glaubst du doch selbst"}, {"id": 9, "start": 93.92, "end": 106.0, "text": "nicht. Warum sollte ich mir denn das antun? Das wäre ja Folter. Ich hab das ja nicht gemacht."}, {"id": 10, "start": 106.0, "end": 117.48, "text": "Ich hab das ja nicht gemacht, um mich irgendwie zu quälen. Leute, ich habe ein gutes Feature in"}, {"id": 11, "start": 117.48, "end": 123.4, "text": "C++ gefunden heute morgen. Stellt euch mal vor, ich habe ein Feature in C++ gefunden, was mir gefällt."}, {"id": 12, "start": 123.4, "end": 132.44, "text": "Was heißt gefällt? Was ich nicht total scheiße finde. Ich zeig's euch gleich. Ich zeig's euch"}, {"id": 13, "start": 132.44, "end": 147.56, "text": "gleich. Ich zeig's euch gleich. Muss grad nochmal schnell was anderes gucken. Ist die VM an? Genau."}, {"id": 14, "start": 147.56, "end": 156.6, "text": "Leute, euch fällt vielleicht auf, die Quali ist besser. Guckt mal, die Qualität ist besser."}, {"id": 15, "start": 156.6, "end": 162.96, "text": "Warte mal, ich will die Steuerelemente ausmachen. Woran könnte das liegen, dass die Qualität besser"}, {"id": 16, "start": 162.96, "end": 174.4, "text": "ist? Genau, ich programmier nur noch mit If-Schleifen. So, also. Es ist jetzt 1080p die"}, {"id": 17, "start": 174.4, "end": 185.36, "text": "Auflösung. Nicht mehr. Die letzten Tage waren nur 720p. Die Sache ist nur die, damit das iPhone das"}, {"id": 18, "start": 185.36, "end": 193.48, "text": "kann, muss ich den Codec auf... Ups, Moment. Ich muss den Codec... Ich muss VP8 verwenden und VP8"}, {"id": 19, "start": 193.48, "end": 199.0, "text": "ist auf dem iPhone Software-Encoding. Ich hoffe, der Akku geht nicht leer. Ich guck mal kurz auf"}, {"id": 20, "start": 199.0, "end": 211.2, "text": "meinem USB-Meter, was das iPhone gerade zieht. Ich stöpseln das mal schnell um. Mein iPhone braucht"}, {"id": 21, "start": 211.2, "end": 223.6, "text": "gerade 11 Watt nur für die Kamera. Das Problem ist auch, es ist keine 60 FPS mehr. Es ist eher"}, {"id": 22, "start": 223.6, "end": 227.44, "text": "so was wie 20. Ihr seht's ja glaube ich gerade. Das müssen wir mal ausprühen, was besser ist."}, {"id": 23, "start": 227.44, "end": 239.72, "text": "Wir müssen mal gucken, ob 1080p 20 FPS besser ist oder 720p 60 oder was das ist. Ja, ja,"}, {"id": 24, "start": 239.72, "end": 242.96, "text": "du kannst hier die einzelnen Frames sehen. Aber das ist nur so auffällig, wenn die Kamera bewegt."}, {"id": 25, "start": 242.96, "end": 247.8, "text": "Ich kann es wieder ändern. Wir probieren das mal auf. Dafür ist es jetzt 1080p. Das heißt,"}, {"id": 26, "start": 247.8, "end": 253.6, "text": "ihr erkennt zum Beispiel auch, was hier drauf steht. Guckt mal, ihr erkennt was hier drauf steht auf dem"}, {"id": 27, "start": 253.6, "end": 263.64, "text": "Sensor, ohne dass ich ranzoomen muss. Ich meine, das ist auch nicht schlecht. Muss man schon sagen,"}, {"id": 28, "start": 263.64, "end": 275.88, "text": "qualitativ ist es schon besser. Ich war gerade am gucken, ob das iPhone 1080p H264 kann,"}, {"id": 29, "start": 275.88, "end": 281.24, "text": "aber anscheinend kann es das nicht. Das ist wieder typische Apple-Geschichte."}, {"id": 30, "start": 281.24, "end": 307.84, "text": "Es nervt mich. Die haben sogar einen FAQ-Eintrag, wo drin steht. Nee,"}, {"id": 31, "start": 307.84, "end": 318.52, "text": "besseres iPhone bringt auch nichts. Das können die alle nicht. Guckt,"}, {"id": 32, "start": 318.52, "end": 328.4, "text": "die schreiben hier alle, du kannst das forcen, aber du musst VP8 verwenden. Oder meint ihr,"}, {"id": 33, "start": 328.4, "end": 333.36, "text": "das mit VP8 liegt am Chrome, dass der nicht schneller decoden kann? Wollen wir mal"}, {"id": 34, "start": 333.36, "end": 337.92, "text": "im Firefox ausprobieren? Probieren wir mal im Firefox aus. Vielleicht ist es da besser,"}, {"id": 35, "start": 337.92, "end": 351.24, "text": "aus irgendwelchen Gründen. Ich glaube es ja nicht. Doch, doch, doch. Guckt mal,"}, {"id": 36, "start": 351.24, "end": 366.72, "text": "im Firefox ist viel besser. Seht ihr das? Im Firefox ist viel besser. Dann machen wir doch"}, {"id": 37, "start": 366.72, "end": 376.24, "text": "den Firefox auf. Den Stream mit VLC, nee, das geht über WebRTC, das kannst du in VLC nicht"}, {"id": 38, "start": 376.24, "end": 391.2, "text": "machen. Warum ist es denn in? Das ist tatsächlich, ich meine, jetzt geht es halbwegs, oder? Ich"}, {"id": 39, "start": 391.2, "end": 397.48, "text": "meine, es ist vielleicht nicht so flüssig wie 60, aber es ist durchaus in Ordnung jetzt. Wenn"}, {"id": 40, "start": 397.48, "end": 401.88, "text": "ich jetzt hier irgendwas mache, guck mal, wenn ich irgendwas Normales mache, da fällt euch gar"}, {"id": 41, "start": 401.88, "end": 407.84, "text": "nicht wirklich auf, dass das keine 60 FPS sind, oder? Ist mal ernsthaft, da merkt ihr nichts von,"}, {"id": 42, "start": 407.84, "end": 415.52, "text": "dass wenn ich jetzt hier irgendwie irgendwas mache, dass das nicht 60 FPS sind. Es sind jetzt auf"}, {"id": 43, "start": 415.52, "end": 423.48, "text": "jeden Fall 30 und keine, und keine, was weiß ich, was es vorher war. Das ist ja, okay, und jetzt"}, {"id": 44, "start": 423.48, "end": 430.92, "text": "haben wir, das ist ja geil, jetzt haben wir 1080p und funktionierende Frames, exquisite. Hätte ich"}, {"id": 45, "start": 430.92, "end": 435.08, "text": "nicht, jetzt mal ernsthaft, hättet ihr gedacht, dass es besser läuft im Firefox? Also ich nicht."}, {"id": 46, "start": 435.08, "end": 450.08, "text": "NDI Plugin für VLC, ernsthaft? Wie, was soll denn das bringen, dass der VLC WebRTC kann?"}, {"id": 47, "start": 450.08, "end": 470.12, "text": "Also bei mir läuft in der Regel die Sache im Chrome besser, aber sieht das jetzt nicht"}, {"id": 48, "start": 470.12, "end": 482.24, "text": "richtig nice aus? Ja, da kann man High Quality Finger Leak machen. Wie ist es im Edge? Das"}, {"id": 49, "start": 482.24, "end": 486.64, "text": "probieren wir jetzt nicht aus. Edge ist, Edge ist, okay, okay, weil ihr es seid, weil ihr es seid,"}, {"id": 50, "start": 486.64, "end": 498.12, "text": "weil ihr es seid. Edge. Ist das auch der, ist das auch der Chrome-based, der Chrome-based Edge? Wo"}, {"id": 51, "start": 498.12, "end": 507.04, "text": "seh ich überhaupt, welchen Edge ich hab? About Edge. Okay, das ist der Chrome. Ups, Edge, probier's"}, {"id": 52, "start": 507.04, "end": 518.0, "text": "den Edge aus. Nee, Hockels seh ich gleich an der, ist ja geil. Das hätt ich echt nett gedacht."}, {"id": 53, "start": 518.0, "end": 540.08, "text": "Chrome. Okay, jetzt mal im Chromium, jetzt mal im Chromium. Da geht's ja gar nicht, Alter. Okay,"}, {"id": 54, "start": 540.08, "end": 550.72, "text": "gut, dass es im Firefox funktioniert. Bin ich zufrieden mit, alles in Ordnung? Okay, dann,"}, {"id": 55, "start": 550.72, "end": 557.2, "text": "dann, was hat Firefox? Guckt, habt ihr mal gesehen, diese Huge Big Brain Ein- und Ausfade-Animation,"}, {"id": 56, "start": 557.2, "end": 567.4, "text": "ist mir noch nie aufgefallen bis jetzt. Massive. So, ich würd sagen, so lassen wir das den Stream"}, {"id": 57, "start": 567.4, "end": 577.12, "text": "über jetzt. Woodface. EE muss ich nicht probieren. EEA funktioniert nicht. Internet Explorer kann"}, {"id": 58, "start": 577.12, "end": 601.32, "text": "ich bei WebRTC starten. Oh. Paints-Champ geht nicht. Keine EE. Gut, sehr gut, sehr gut. Okay,"}, {"id": 59, "start": 601.32, "end": 609.2, "text": "da können wir, können wir weitermachen. Also, ich recapitulate mal kurz, was wir gestern gemacht"}, {"id": 60, "start": 609.2, "end": 615.56, "text": "haben. Für alle, die nicht dabei waren. Mag ja sicher den einen oder anderen geben. Oh,"}, {"id": 61, "start": 615.56, "end": 625.04, "text": "da bleibt ja nicht Fullscreen, wenn ich Desktop switche. Doch, ne. Bleibt Fullscreen. Okay,"}, {"id": 62, "start": 625.04, "end": 633.96, "text": "gut. Das Gametrain, 94%, gebt euch Ruck, Leute. Einer noch, einer noch. Soulstar. Dankeschön,"}, {"id": 63, "start": 633.96, "end": 640.48, "text": "Twitch Prime Subscriptions hier. IQ++ für den Chat. Ich muss meine E-Modes übrigens verschieben."}, {"id": 64, "start": 640.48, "end": 646.6, "text": "Muss öfters Sellout machen, hat schon direkt funktioniert. Swear7, Dankeschön, Prime"}, {"id": 65, "start": 646.6, "end": 658.36, "text": "Subscriptions. LSGKX, Twitch Prime, danke für den Sub. Jetzt gerade noch mal von oben nach"}, {"id": 66, "start": 658.36, "end": 665.84, "text": "unten durch, äh, von unten nach oben. Und der Pritzelsnacker, auch am Start, Dankeschön."}, {"id": 67, "start": 665.84, "end": 674.52, "text": "Mega, huge Subscriptions. Nice. Okay, also ich, ich fasse das noch mal kurz zusammen. So,"}, {"id": 68, "start": 674.52, "end": 678.12, "text": "ich hab so ein Zähler im Keller hängen, also nicht mit sowas drauf. So, aber ich mach so"}, {"id": 69, "start": 678.12, "end": 682.24, "text": "was ähnliches, mach so was ähnliches wie das hier. Guck mal, ich bin nicht der Einzige,"}, {"id": 70, "start": 682.24, "end": 690.28, "text": "der sowas hier macht, bloß, dass die was Fertiges haben. So sieht mein Zähler im Keller aus. Den"}, {"id": 71, "start": 690.28, "end": 695.16, "text": "kennt ja sicherlich noch die ein oder anderen. So, das ist so der Oldschool, der Oldschool-Zähler,"}, {"id": 72, "start": 695.16, "end": 699.6, "text": "der irgendwann mal ausgetauscht wird. Mein zu Raspberry Pi mit Cody als Media Center,"}, {"id": 73, "start": 699.6, "end": 704.6, "text": "als, als Firestick. Naja, Firestick laggt auch ein bisschen, weiß nicht, wie die neuen Firesticks"}, {"id": 74, "start": 704.6, "end": 710.32, "text": "sind. Cody und 3D-Beschleunigung, also 2D-Beschleunigung, je nachdem, wie man sieht,"}, {"id": 75, "start": 710.32, "end": 715.12, "text": "ist halt kacke. Cody ruckelt halt auf dem Raspberry Pi. Wenn du es mal vergleichst mit"}, {"id": 76, "start": 715.12, "end": 725.2, "text": "beispielsweise auf dem Shield-TV. Was hältst du von so einem Ding? Äh. Was hältst du von so einem"}, {"id": 77, "start": 725.2, "end": 734.6, "text": "Ding? Sind ein bisschen billiger, aber läuft weich drauf. Hab ich mir sagen lassen, weiß ich auch"}, {"id": 78, "start": 734.6, "end": 741.72, "text": "noch von Reddit. Wie hast du C++ gelernt? Gar nicht, es gibt keinen auf der Welt, der C++ kann."}, {"id": 79, "start": 741.72, "end": 758.12, "text": "Nicht mal das C++-Cremium kann das. So, wo sind wir denn stehen geblieben? Ah. Ich muss mein"}, {"id": 80, "start": 758.12, "end": 763.4, "text": "Access-Point wieder anschalten, dass es funktioniert. Fire-TV habe ich das letzte Mal,"}, {"id": 81, "start": 763.4, "end": 767.64, "text": "ich habe mal einen Fire-TV-Stack ausprobiert vor drei Jahren oder so. Da lief im Vergleich zum"}, {"id": 82, "start": 767.64, "end": 775.08, "text": "Shield-TV lief die Oberfläche von Android-TV und Cody auch ruckelig. So genau, also ich fasse"}, {"id": 83, "start": 775.08, "end": 780.08, "text": "das mal kurz zusammen. Also ich habe so einen Zähler und ich habe so einen Zähler. Zwei"}, {"id": 84, "start": 780.08, "end": 798.56, "text": "verschiedene Dinger. So was hier in der Richtung. Ah, nicht ganz. Wartet mal. So was hier habe ich"}, {"id": 85, "start": 798.56, "end": 804.92, "text": "in der Richtung. Muss ich mal kurz groß machen, da ich euch die LED zeigen kann. Ja, so was hier."}, {"id": 86, "start": 804.92, "end": 810.92, "text": "Ja, ziemlich, ziemlich exakt so sieht es bei mir aus. Ziemlich genau so sieht es bei mir aus im"}, {"id": 87, "start": 810.92, "end": 817.92, "text": "Keller. Also so ein Ding habe ich für den ersten Stock so eine Art in der Geschichte. Ich glaube,"}, {"id": 88, "start": 817.92, "end": 821.96, "text": "das ist eine Seite, die uns zeigen möchte, dass die Dinger in Zukunft durch so einen ausgetauscht"}, {"id": 89, "start": 821.96, "end": 826.68, "text": "werden. Aber das passt. Ich habe so einen hier für den ersten Stock und so einen von den Stadtwerken."}, {"id": 90, "start": 826.68, "end": 832.32, "text": "Also sprich, der da ist für Gesamt vom Haus und der da ist nur hier oben bei mir im ersten Stock."}, {"id": 91, "start": 832.32, "end": 842.32, "text": "So und was ich jetzt habe dafür ist folgendes. Ich habe einmal. Ich habe einmal hier einen ESP32"}, {"id": 92, "start": 842.32, "end": 847.44, "text": "Microcontroller, da ist das alles dran. Einen Case, was irgendwie kaputt ist und sich die ganze"}, {"id": 93, "start": 847.44, "end": 852.96, "text": "Zeit neu startet, was auch immer. Was wir da drauf geflasht haben. Mit dem Display drauf,"}, {"id": 94, "start": 852.96, "end": 855.64, "text": "das brauche ich eigentlich nur zu Debug-Zwecken, dass ich, wenn ich im Keller stehe, unten mal"}, {"id": 95, "start": 855.64, "end": 861.04, "text": "IP sehe und aktuell verstanden den vergleichen kann mit dem Zähler. So und die Sensoren sind zum"}, {"id": 96, "start": 861.04, "end": 867.84, "text": "Auslesen das Wichtige. Also ich habe einmal so einen Sensor, das ist. Guck mal, welche geile"}, {"id": 97, "start": 867.84, "end": 873.52, "text": "Quali das jetzt ist mit dem 1080p Auflöser, oder? Ich müsste mal sagen, viel, viel besser als die"}, {"id": 98, "start": 873.52, "end": 881.52, "text": "letzten Tage. Man erkennt alles sogar richtig gut. Also das ist ein Sensor, der erkennt, wenn es hell"}, {"id": 99, "start": 881.52, "end": 887.72, "text": "wird. Also siehst du, wenn ich den hier abdecke. Siehst du, LED geht aus. Wenn ich den wieder"}, {"id": 100, "start": 887.72, "end": 895.44, "text": "dazu zudecke, ist LED aus. Also der erkennt den Impuls. Also dieser Sensor da erkennt den Impuls,"}, {"id": 101, "start": 895.44, "end": 903.48, "text": "den solche Zähler machen. Die haben nämlich LEDs und alle keine Ahnung 0,8 Wattstunden oder so"}, {"id": 102, "start": 903.48, "end": 910.64, "text": "blinkt er einmal. Also sprich, das kann ich damit erkennen. So und diesen Sensor, den Klassiker mit"}, {"id": 103, "start": 910.64, "end": 928.96, "text": "der Scheibe, den kann ich auf folgende Art und Weise erkennen, nämlich mit dem da. Und zwar der"}, {"id": 104, "start": 928.96, "end": 941.44, "text": "da. iPhone, please. Zoomen. Hallo. Aha, exzellent. Das sind zwei Infrarot-LEDs beziehungsweise ein,"}, {"id": 105, "start": 941.44, "end": 953.56, "text": "das ist nicht okay. Das iPhone hat wieder keinen Bock. So. Also. Jetzt erkennt man es. Also der"}, {"id": 106, "start": 953.56, "end": 958.88, "text": "Sensor, das ist einmal ein Infrarot-LED und einmal ein Empfänger und der erkennt, wenn die"}, {"id": 107, "start": 958.88, "end": 966.8, "text": "Einstrahlung schwächer wird. Also sprich, das funktioniert dann folgendermaßen. Das funktioniert"}, {"id": 108, "start": 966.8, "end": 974.2, "text": "dann folgendermaßen, wenn das hier durchläuft, wenn das Silber ist, dann reflektiert das wunderbar,"}, {"id": 109, "start": 974.2, "end": 980.52, "text": "alles gut. Und ja, das stimmt tatsächlich. Aus diesem Video kann man heutzutage wirklich"}, {"id": 110, "start": 980.52, "end": 985.24, "text": "Fingerabdrücke faken, ja. Das ist kein Witz, wurde schon gemacht, aber ich habe keine"}, {"id": 111, "start": 985.24, "end": 995.04, "text": "House-Security mit Fingerabdrücken, insofern ist es egal. Es geht jetzt mit der Musik ab. Na gut,"}, {"id": 112, "start": 995.04, "end": 1002.92, "text": "mein Figen. So. Und das reflektiert wunderbar, wenn das Silberne ist, aber wenn das Rote kommt,"}, {"id": 113, "start": 1002.92, "end": 1008.72, "text": "das reflektiert nicht ganz so gut und das erkenne ich hier dran. Also ich erkenne an der Einstrahlung"}, {"id": 114, "start": 1008.72, "end": 1013.24, "text": "von dem Infrarot, sprich, ob das jetzt gerade das Rote durchläuft oder das Silberne. Und wenn das"}, {"id": 115, "start": 1013.24, "end": 1026.36, "text": "Rote durchläuft, dann weiß ich, aha, einmal hochzählen. Deswegen unter anderem, weil man"}, {"id": 116, "start": 1026.36, "end": 1030.36, "text": "seinen Fingerabdruck nicht ändern kann, sind Fingerabdrucksensoren kacke. Würde ich finde,"}, {"id": 117, "start": 1030.36, "end": 1034.2, "text": "finde ich als Security sucked. Oh, ich muss mir dann gleich mal was zu trinken holen, sehe ich"}, {"id": 118, "start": 1034.2, "end": 1039.08, "text": "gerade. So, so ist das gerade gemacht, sondern was wir gestern angefangen haben ist, das Ganze so"}, {"id": 119, "start": 1039.08, "end": 1044.76, "text": "weit zu programmieren, dass man die Sensoren verwenden kann. So, und ich leg das jetzt mal"}, {"id": 120, "start": 1044.76, "end": 1051.64, "text": "wieder hier obendrauf, dass ihr was seht. Dann machen wir wieder da rein. Und den machen wir dahin,"}, {"id": 121, "start": 1051.64, "end": 1061.92, "text": "dass man sieht, wir testen das hauptsächlich mit dem Sensor hier. Exzellent. Ich versuch das gerade"}, {"id": 122, "start": 1061.92, "end": 1066.72, "text": "mal so zu machen, dass man das sieht. So sieht man, ne? Sieht man die grüne LED? Ne, die sieht man"}, {"id": 123, "start": 1066.72, "end": 1074.0, "text": "nicht. So, jetzt exquisite. So, jetzt sieht man nämlich den ganzen Crap und jetzt basteln wir mal"}, {"id": 124, "start": 1074.0, "end": 1081.92, "text": "weiter. Also was wir heute probieren ist, die Sensoren in meine Home Assistant zu übertragen,"}, {"id": 125, "start": 1081.92, "end": 1088.6, "text": "was die messen. Und deswegen muss ich jetzt meine Home Assistant in der VR installieren ganz schnell,"}, {"id": 126, "start": 1088.6, "end": 1099.0, "text": "das geht zackig. Gibt es hier ein fertiges Image. Wir haben hier ein fertiges Image,"}, {"id": 127, "start": 1099.0, "end": 1109.08, "text": "muss mal kurz gucken, was das gibt. Gibt es ein fertiges Image für VRM. So, und dann ist die Idee,"}, {"id": 128, "start": 1109.08, "end": 1122.76, "text": "so und dann ist die Idee, dass man den Sensorstand an meine Home Assistant übertragen kann und dort"}, {"id": 129, "start": 1122.76, "end": 1127.04, "text": "sehe ich dann, wie viel Stromverbrauch ich aktuell habe und ich kann mir daraus auch errechnen,"}, {"id": 130, "start": 1127.04, "end": 1132.48, "text": "wie viel gerade aktuell im ganzen Haus bzw. im ersten Stock verbraucht wird. Ist jetzt nichts,"}, {"id": 131, "start": 1132.48, "end": 1140.92, "text": "was man unbedingt haben muss, aber es ist auf jeden Fall eine coole Sache zum Selbstbauen. So, machen wir gleich. Ich"}, {"id": 132, "start": 1140.92, "end": 1148.0, "text": "installiere mir erstmal schnell den Home Assistant. Brauche ich irgendwie VR? Wo haben die den Kram denn zum"}, {"id": 133, "start": 1148.0, "end": 1177.76, "text": "Download? OVA? OVA? Hab ich glaube ich noch nie verwendet. Ja, die Shelly Energy Monitor"}, {"id": 134, "start": 1177.76, "end": 1184.8, "text": "kannst du dir holen. Die musste aber halt um irgendwelche Kabel machen und ich finde es halt"}, {"id": 135, "start": 1184.8, "end": 1190.24, "text": "insofern ganz cool, das direkt vom Zähler abzulesen. Ach nee, das ist gar nichts mit"}, {"id": 136, "start": 1190.24, "end": 1196.04, "text": "Klammern um das Kabel. Wie willst du das am kompletten Haus anschließen? Das geht doch gar"}, {"id": 137, "start": 1196.04, "end": 1205.48, "text": "nicht gescheit, oder? Oder wie funzt das? Wie schließt man das an? Ach, da ist Klammern. Ja,"}, {"id": 138, "start": 1205.48, "end": 1221.04, "text": "kann man machen. Vm Workstation. Bäm. Store, new vm. Nee, nee, nee. Die neue vm soll erstellt"}, {"id": 139, "start": 1221.04, "end": 1237.36, "text": "werden. E, Doppelpunkt. Vms. Ha, ha. Oh, wir haben doch schon Home Assistant. Okay, dann machen wir es einfach nochmal. Import. Weil das brauche ich. Ich verwende Home Assistant als"}, {"id": 140, "start": 1237.36, "end": 1252.36, "text": "mein Heimautomatisierungslösung und ich brauche eine Testinstallation um zu gucken. Heck, wer war's,"}, {"id": 141, "start": 1252.36, "end": 1271.04, "text": "Chat? Wer ist gewesen? Gibts zu. Wer, wer, wer ist drin von euch, ja? Home Assistant vmwa."}, {"id": 142, "start": 1271.04, "end": 1300.92, "text": "Vmdk. Vmdk. Hä? Ach, Moment, das war für ein, das war für ein ESX, was ich da runter"}, {"id": 143, "start": 1300.92, "end": 1306.68, "text": "geladen hab, ne? Ich muss das hier runterladen anscheinend. Okay, das ist ja auch maximal verwirrend gemacht."}, {"id": 144, "start": 1306.68, "end": 1320.92, "text": "Ha. Was auch immer. Vm Workstation. Create new virtual machine, select custom. Gut, das machen wir mal"}, {"id": 145, "start": 1320.92, "end": 1338.56, "text": "während er runterlädt. Also, new virtual machine, custom. Make it co, jaja, passt. Later. Choose April install later, select Linux. Okay, das ist wahrscheinlich,"}, {"id": 146, "start": 1338.56, "end": 1357.72, "text": "wahrscheinlich relativ egal, was man davon nimmt. Aber die vm brauchen wir. Das erstellen. So,"}, {"id": 147, "start": 1357.72, "end": 1365.2, "text": "number of process sources, keine Ahnung, 3 cores, reicht dicke. RAM 40069, ich hab genug. Braucht"}, {"id": 148, "start": 1365.2, "end": 1370.84, "text": "es eh nur zum testen, das kommt danach wieder weg. Use bridge networking, alles klar, alles klar."}, {"id": 149, "start": 1370.84, "end": 1385.8, "text": "Sonst noch irgendwas? Ah, man muss auf EFI umschalten, okay. 20G sollte reichen. Moment,"}, {"id": 150, "start": 1385.8, "end": 1391.12, "text": "hab ich irgendwas verkehrt gemacht? Ach ne, use an existing virtual disk muss ich machen. Okay,"}, {"id": 151, "start": 1391.12, "end": 1404.72, "text": "geh nochmal zurück. Use an existing virtual disk. Downloads. Wo ist es? Ach, das ist nochmal gezippt."}, {"id": 152, "start": 1404.72, "end": 1416.12, "text": "Meine Güte, äh. Kannste, man kannste Leute auch, man kannste Leute auch schwer machen. Ich meine,"}, {"id": 153, "start": 1416.12, "end": 1430.84, "text": "die 50 MB hätten es jetzt auch nicht gemacht, oder? Oh, next. Soll ich das, soll ich das? Nee,"}, {"id": 154, "start": 1430.84, "end": 1443.48, "text": "ist egal. Ja, mein wegen, konvertier, customize, das muss man erstmal anlegen. Jetzt kann ich"}, {"id": 155, "start": 1443.48, "end": 1449.72, "text": "umstellen auf EFI boot, ich hoffe der Kram funktioniert. Ja, das ist ein firmware image,"}, {"id": 156, "start": 1449.72, "end": 1453.16, "text": "das wird komprimiert jetzt anders um große Unterschiede machen. Gucken wir mal, was ist der"}, {"id": 157, "start": 1453.16, "end": 1469.52, "text": "Unterschied? Also, äh, download. Auf, geht zu. Downloads. Oh. Okay, der Unterschied ist 1,6"}, {"id": 158, "start": 1469.52, "end": 1477.4, "text": "Gigabyte zu 350 MB. Ich hab nichts gesagt vor 50 MB. Okay, ist ein bisschen unterschiedlich."}, {"id": 159, "start": 1477.4, "end": 1488.6, "text": "Warum ist das rot? Gut, ich hab nichts gesagt, alles, alles gut. So, also, so, advanced,"}, {"id": 160, "start": 1488.6, "end": 1503.92, "text": "umstellen auf EFI boot, und jetzt starten. Äh, was? Oh, I finish install. Boote das jetzt,"}, {"id": 161, "start": 1503.92, "end": 1521.64, "text": "postchamp. Format Workstation hab ich gekauft, bei SoftwareKong. Vertrauenswürdigste Seite aller Zeiten, ähm, oder was?"}, {"id": 162, "start": 1521.64, "end": 1534.56, "text": "Admin? Ich weiß das Default Passwort gar nicht mehr, Admin. Root? Gut, war's. Okay. Äh, was hat das Ding jetzt für ne IP gekriegt?"}, {"id": 163, "start": 1534.56, "end": 1546.34, "text": "Alter, das ist mir zu viel, zu viel Happy Mario, ja so was besser. Die klassische Mario Musik ist mir zu"}, {"id": 164, "start": 1546.34, "end": 1548.34, "text": "Klassisch"}, {"id": 165, "start": 1549.02, "end": 1551.02, "text": "Ne was war es root"}, {"id": 166, "start": 1553.54, "end": 1559.26, "text": "Okay, die musik ist echt auf krampfhaft happy gemacht, wir sehen jetzt was das ding von der ip gekriegt hat network"}, {"id": 167, "start": 1561.3, "end": 1563.9, "text": "Info ich habe gekriegt"}, {"id": 168, "start": 1567.14, "end": 1569.14, "text": "2.139 okay"}, {"id": 169, "start": 1569.14, "end": 1574.98, "text": "Dann machen wir das mal auf"}, {"id": 170, "start": 1577.22, "end": 1580.14, "text": "Also was war das 1 2 2 1 6 8 ist klar 2"}, {"id": 171, "start": 1581.62, "end": 1589.42, "text": "139 ok so weil das brauchen wir jetzt gleich als mqtt server wo ich war und die ip liegt schon wieder schon wieder drin chat"}, {"id": 172, "start": 1589.42, "end": 1593.5, "text": "8 1 2 3"}, {"id": 173, "start": 1596.3, "end": 1598.3, "text": "8 1 2 3"}, {"id": 174, "start": 1599.18, "end": 1600.58, "text": "Admin"}, {"id": 175, "start": 1600.58, "end": 1603.96, "text": "Admin admin 1 2 3 4 5 6 1 2 3 4 5 6"}, {"id": 176, "start": 1604.66, "end": 1606.66, "text": "great account"}, {"id": 177, "start": 1606.7, "end": 1610.54, "text": "Ja genau hier sind wir in amsterdam vape nation next"}, {"id": 178, "start": 1610.54, "end": 1619.14, "text": "Alta was ist das für musik ich krieg ja anfälle die sollen die sollen einfach irgendwas im im hintergrund dudeln lassen und gut ist"}, {"id": 179, "start": 1619.78, "end": 1621.78, "text": "das wird zu anstrengend"}, {"id": 180, "start": 1622.18, "end": 1624.18, "text": "Mario Kart happy epic"}, {"id": 181, "start": 1628.46, "end": 1630.46, "text": "Okay"}, {"id": 182, "start": 1634.7, "end": 1636.7, "text": "We want to stay locked in yes"}, {"id": 183, "start": 1636.7, "end": 1641.18, "text": "So in amsterdam ist es partial clouded sehr schön das wollte ich immer mal wissen"}, {"id": 184, "start": 1642.82, "end": 1647.02, "text": "Gut weil hier werde ich jetzt versuchen meinen strom sensor anzulegen und anzuzeigen"}, {"id": 185, "start": 1648.7, "end": 1651.74, "text": "In der testinstallation also auf geht's leute"}, {"id": 186, "start": 1653.98, "end": 1655.98, "text": "Der watt champ ist am start"}, {"id": 187, "start": 1656.78, "end": 1662.58, "text": "Auch ich muss ja erst wieder von raspberry pi usb weiterleiten weil ich habe so gemacht dass ich euch den kram hier in"}, {"id": 188, "start": 1662.58, "end": 1667.14, "text": "stream zeigen kann habe ich das an raspberry pi angeschlossen aber entwickeln will ich an meinem desktop pc"}, {"id": 189, "start": 1667.86, "end": 1674.54, "text": "Das heißt ich muss das kann ich muss den usb anschluss irgendwie weiter leiten an mein pc dass ich flaschen kann"}, {"id": 190, "start": 1679.18, "end": 1685.46, "text": "Das geht vollendermaßen falls das ding die richtige ip hat muss ich wieder mal nach ada ist es sehr gut"}, {"id": 191, "start": 1686.98, "end": 1688.98, "text": "USB"}, {"id": 192, "start": 1688.98, "end": 1696.94, "text": "Usd usb ip bind jawoll was list modprop"}, {"id": 193, "start": 1702.5, "end": 1704.5, "text": "1 punkt"}, {"id": 194, "start": 1706.5, "end": 1708.5, "text": "Kann ich jetzt flaschen"}, {"id": 195, "start": 1709.22, "end": 1711.22, "text": "list"}, {"id": 196, "start": 1711.22, "end": 1717.78, "text": "1 punkt kann ich jetzt flaschen list"}, {"id": 197, "start": 1722.78, "end": 1726.46, "text": "Ok kann ich jetzt mal gucken ob ich jetzt flaschen kann upload"}, {"id": 198, "start": 1731.38, "end": 1736.92, "text": "Was für neu ist dass das ist man jaro linux mit i3 als desktop manager oh oh je was jetzt los"}, {"id": 199, "start": 1736.92, "end": 1745.88, "text": "Die weiß busy was soll das anzeige ist raus hier ist nix busy zu sein"}, {"id": 200, "start": 1748.04, "end": 1751.64, "text": "Ok jetzt immer bei usb 1 machen wir nicht eben noch bei usb 0"}, {"id": 201, "start": 1753.2, "end": 1759.36, "text": "Was auch immer so es flascht jetzt so danach sollte der reboot und den gleichen kram von gestern wieder anzeigen"}, {"id": 202, "start": 1759.36, "end": 1761.36, "text": "Ich habe den access point ja noch gar nicht gestartet"}, {"id": 203, "start": 1765.8, "end": 1767.8, "text": "Bosschamp"}, {"id": 204, "start": 1770.28, "end": 1772.28, "text": "Bosschamp"}, {"id": 205, "start": 1772.68, "end": 1775.24, "text": "Ach ich habe den access point ja noch gar nicht gestartet"}, {"id": 206, "start": 1775.24, "end": 1800.2, "text": "Null der kann sich der kann sich nicht verbinden zum access point ich muss den access point erst mal wieder starten dass er sich einloggen kann"}, {"id": 207, "start": 1800.2, "end": 1811.48, "text": "Ich habe den ich habe den perfekten access point für solche testzwecke leute wenn ihr einen kleinen access point braucht den ihr zu irgendwelchen testprojekten einfach mal an und ausschalten könnt und überall hinstellen könnt"}, {"id": 208, "start": 1817.48, "end": 1820.08, "text": "Dieses teil das beste das ist furz klein"}, {"id": 209, "start": 1820.6, "end": 1827.36, "text": "Kann auch nix im endeffekt von antennen und und ich glaube es auch plus maximal 2,4 gigahertz was für diese dinge reicht"}, {"id": 210, "start": 1827.36, "end": 1829.92, "text": "Aber das ist das ist mini"}, {"id": 211, "start": 1831.56, "end": 1834.0, "text": "Der map light"}, {"id": 212, "start": 1837.32, "end": 1840.12, "text": "Guck mal guck mal wie klein das ist der access point"}, {"id": 213, "start": 1845.4, "end": 1847.4, "text": "Was was ist hier mit delay"}, {"id": 214, "start": 1847.4, "end": 1852.4, "text": "Was ist hier mit delay"}, {"id": 215, "start": 1853.08, "end": 1855.08, "text": "Was"}, {"id": 216, "start": 1859.0, "end": 1861.0, "text": "Ok ich habe keine ah also"}, {"id": 217, "start": 1862.28, "end": 1867.12, "text": "Was es geht tp link hat auch so ein ja möglich"}, {"id": 218, "start": 1867.12, "end": 1879.76, "text": "Was ist denn eine b a berufsabschluss nähe so ok passt ding ist geflasht funktioniert"}, {"id": 219, "start": 1879.76, "end": 1891.96, "text": "Ach bachelor ah ok passt alles klar ding ist geflasht die anzeige da oben ist busy busy kaputt irgendwie"}, {"id": 220, "start": 1891.96, "end": 1915.4, "text": "Guck mal irgendwie irgendwie rippt die anzeige da oben funktioniert nicht so gut wie ich mir das ausgemalt habe aber passt schon ok also wo sind wir gestern stehen geblieben geht das flaschen noch jawoll serial jawoll geht auch noch ok geht alles da wo wir gestern stehen geblieben sind perfekt"}, {"id": 221, "start": 1915.4, "end": 1928.64, "text": "Welche strommenge zeigst du auf dem ne von meinem hauszähler wenn ich mal endlich ein solar ding bauen kann dann zeige ich das da in meinem home assistant auch an aber nicht mit dem gerät sondern mit irgendwas anderem"}, {"id": 222, "start": 1928.64, "end": 1955.28, "text": "Also ok lass mal kurz in mich gehen wo machen wir weiter ich würde sagen wir machen jetzt in home assistant wir machen jetzt mal den test dass wir per mqtt im home assistant den sensor anlegen können weil es funktioniert ja in soweit schon ich kann das ding booten ich kann mich zum wlan connecten ich kann updates hochladen über den browser das muss ich dann nicht per serieller schrittstelle anschließen ist natürlich auch besser"}, {"id": 223, "start": 1955.28, "end": 1976.24, "text": "Und der guckt dass das wlan aktiv ist der schaut ob der boot aktiv war also der schaut ob der letzte boot geklappt hat wenn nicht krieg ich 45 sekunden zeit neue firmware hochzuladen der zählt den sensor hoch guckt ich zeige euch mal dass das funktioniert"}, {"id": 224, "start": 1976.24, "end": 2000.16, "text": "Ach ne ich hab hier was anderes eingebaut ok ich sag nix ich lösch das mal ich zeige euch mal dass das prinzipiell funktioniert und malt es aufs display so also was wir jetzt machen müssen ist im home assistant die daten hinschicken"}, {"id": 225, "start": 2000.16, "end": 2023.52, "text": "Und dazu gibt es so ein spezielles mqtt json protokoll von home assistant wo der automatisch sensoren anlegen kann"}, {"id": 226, "start": 2023.52, "end": 2036.64, "text": "So dazu muss ich jetzt aber erstmal gucken übrigens wir müssen noch was anderes machen ich bin dumm wir müssen vorher noch was anderes machen der verliert nämlich immer die werte schaut mal wenn ich jetzt das hier hochzählen lasse also ich muss einfach mal hier ausblenden"}, {"id": 227, "start": 2036.64, "end": 2060.96, "text": "Also er zählt hoch jedes mal wenn licht an und aus geht ich glaube es ist allerdings draußen zu hell als dass ich damit zählen lassen kann ne ist zu hell der ist Richtung fenster gerichtet aber jetzt kann ichs besser zeigen guckt"}, {"id": 228, "start": 2060.96, "end": 2082.0, "text": "Aus also sprich der zählt der zählt für jedes mal licht lichtimpuls zählter"}, {"id": 229, "start": 2082.0, "end": 2104.16, "text": "Und zwar jedes mal wenn das licht angeht das ist das wichtige dass er das auch richtig vom zähler erkennen kann wenn das dran hängt ihr seht immer das zählt auch eins hoch die formatierung auf meinem display ist ziemlich broken hab ich gerade festgestellt"}, {"id": 230, "start": 2104.16, "end": 2117.28, "text": "Okay also das zählen wie gesagt das zählen das funktioniert jetzt muss ich irgendwie gucken wie ich diese gezählten werte zu meinem home assistant schicken kann"}, {"id": 231, "start": 2117.28, "end": 2136.16, "text": "Dann muss ich erstmal gucken esp32mqtt wie man das macht eins muss man dem hersteller lassen das sind das sind chinesen die dieses board herstellen also den controller den controller den man grad nicht sieht der hier dahinter hängt den da den da den"}, {"id": 232, "start": 2136.16, "end": 2162.4, "text": "Also nicht das board die ähm die cpu auf dem board ist von chinesen also sprich das da das da der chip china china kram versucht es mal so zu machen dass man es irgendwie erkennt dass hier der controller am start ist ja optimal ne jetzt hängt das sensor davor null"}, {"id": 233, "start": 2162.4, "end": 2175.28, "text": "Bring ich das irgendwie hingewurstet dass man alles oh es fällt rein nicht reinfallen please umbleiben okay perfekt ah jetzt erkennt man alles exzellent"}, {"id": 234, "start": 2175.28, "end": 2205.2, "text": "Nein der zählt nicht wenn ich im keller das licht anmache weil ich das ding genau mit dieser vorderen seite an die led pappe und zu geklebt hab mit klebeband da drüber das kriegt das überhaupt nicht mit wenn es zwischt"}, {"id": 235, "start": 2205.2, "end": 2222.96, "text": "Wenn es drum herum hell wird außerdem kann ich das relativ empfindlich einstellen weil das ziemlich hell wird wenn es direkt dran pappt gut jetzt muss ich dem irgendwie muss irgendwie gucken wie ich mqtt reden kann mit dem esp32"}, {"id": 236, "start": 2222.96, "end": 2252.88, "text": "Da muss man zwar offiziellen examples angucken wie es funktioniert okay erstmal 30 billionen sachen included achja genau eine wichtige sachen die wir vorher noch machen nicht vergessen hat und zwar ihr seht ja wenn ich das ding neu warum ist das total verschoben das stimmt doch überhaupt nicht guck mal was zeigt denn da für ein müll auf dem display an der soll auf dem display anzeigen wartet mal das müssen wir müssen erst mal das display fixen wir müssen erst mal das display fixen also display fixen"}, {"id": 237, "start": 2252.88, "end": 2266.64, "text": "display display clear moment der sollte eigentlich papps ab kleines super ja ich will ja mal gucken wie das mit den eingebauten dingen geht der sollte eigentlich das"}, {"id": 238, "start": 2266.64, "end": 2294.88, "text": "trisetten und es hat auch gestern auch funktioniert warum steht warum steht kilowatt da oben das muss hinter der zahl stehen okay okay mag mal schauen okay jetzt funktioniert das steht viel zu weit oben what the fuck"}, {"id": 239, "start": 2294.88, "end": 2301.44, "text": "was zum"}, {"id": 240, "start": 2301.44, "end": 2308.2, "text": "okay vielleicht wirkt vielleicht täuscht das"}, {"id": 241, "start": 2308.2, "end": 2332.44, "text": "nein es steht komplett falsch moment das ist was zur what the fuck okay reset reset display warum ist das das ist komplett falsch auf dem display also das obere ist okay aber der andere kram stimmt nicht der andere kram"}, {"id": 242, "start": 2332.44, "end": 2358.88, "text": "müsste auf der zeile rechts rechts allein stehen warum ist das falsch auf dem display"}, {"id": 243, "start": 2358.88, "end": 2381.84, "text": "okay jetzt funktioniert es wenn ich das display komplett resette das muss ich jetzt nicht wirklich verstehen oder ich will aber ich will auch das display nicht resetten bei jedem draw wollen die mich rollen oder was"}, {"id": 244, "start": 2381.84, "end": 2399.08, "text": "kann ich den ernst sein dass jetzt jedes mal das display resetten muss dass das funktioniert weil so soll das eigentlich allein sein guck die zahlen sind rechts oben steht die ip und die uptime das ist eigentlich okay warum ist was hatten"}, {"id": 245, "start": 2399.08, "end": 2428.48, "text": "jetzt für schmerzen hier mit warum muss ich jedes mal das display resetten anstatt es einfach neu zu malen normalerweise sollte es screen clear tun das muss in die lupe das soll er jede sekunde neu machen das verstehe ich ehrlich gesagt nicht aber ich lasse es"}, {"id": 246, "start": 2428.48, "end": 2456.88, "text": "erst mal soll ich für mich nicht unnötig lange mit dem display beschäftigen dann resette das halt einmal die sekunde ist mir auch egal okay passt so wenn ich jetzt licht licht an und aus das geht nicht licht an und aus alter das ding ist hartnäckig so jetzt hat er hochgezählt genau guckt"}, {"id": 247, "start": 2456.88, "end": 2480.84, "text": "das display spakt übelst rum ist das kaputt oder so habt ihr grad gesehen ach nee wisst ihr was auch sein könnte dass es irgendwie probleme hat wenn das ding gleichzeitig wlan überträgt dass das ding irgendwie irgendwelche indifferenzen"}, {"id": 248, "start": 2480.84, "end": 2500.52, "text": "ihr wisst was ich meine irgendwelche stördinger hat dass es beim übertragen an das display irgendwelche fehler reinkommen in das signal keine ahnung woran das liegt aber es ist auf jeden fall nicht normal dass das zeug auf dem display hin und her springt das ist definitiv nicht normal i am real lunatic twitch prime dankeschön für den sub"}, {"id": 249, "start": 2500.52, "end": 2530.16, "text": "kann man den code irgendwo kopieren muss man gucken so ok jetzt gucken wir wie man mqtt verwendet also task noch so mqtt das ich nichts vergesse vorher muss man noch gucken werte speichern wie machen wir das weil wenn hier mal der strom weg geht da will ich die werte ja behalten von dem von dem zähler mal angenommen startet einer neu will ich mir die werte die werte irgendwie speichern"}, {"id": 250, "start": 2530.16, "end": 2560.12, "text": "sondern habe ich was gefunden wie das funktioniert das ding hat also der esp partition der hat auf seinem flash hat er verschiedene speicherabschnitte so sieht so sieht standardmäßig aus nvs das da factory storage und bei mir sieht es so aus die partitionierung ungefähr ungefähr stimmt nicht so ganz also meine partitionierung sieht folgendermaßen aus"}, {"id": 251, "start": 2560.12, "end": 2585.08, "text": "circa 2 mb für firmen wir circa nie 1, ich sage ungefähr 2 mb einmal für firmen wir ungefähr 2 mb zweimal für firmen wir und 250 kb storage und hier vorne in dieses ram hat man hat man nur 20 20 kilobyte da kann man relativ easy und eben ohne dass es kaputt geht beim stromausfall"}, {"id": 252, "start": 2585.08, "end": 2602.36, "text": "daten reinschreiben die man bei einem neustart behalten will ist eigentlich ganz nützlich wenn ich das auf dieses filesystem hier hinten schreibe dann hast du das problem das geht kaputt wenn das strom oder wenn das ding crash oder das stromaus geht während er gerade schreibt"}, {"id": 253, "start": 2602.36, "end": 2628.24, "text": "so deswegen müssen wir schauen dass wir in irgendeiner art und weise die werte speichern können von unserem sensor so die sensorwerte stehen hier drin da stehen die sensor hier stehen die sensorwerte drin und die speichern wir jetzt einfach mal und dazu muss man folgendes inkluden das habe ich mir im vorfeld schon angeguckt wie das wie das funktioniert"}, {"id": 254, "start": 2628.24, "end": 2651.92, "text": "mal kurz abguck abguck champ machen abguck champ auf dem zweiten bildschirm natürlich mache ich das alles live ich habe mir vorher nix angeguckt leute easy ne abguck champ also was muss ich inkluden preferences und da muss ich folgendes anlegen"}, {"id": 255, "start": 2651.92, "end": 2680.92, "text": "so und jetzt so und jetzt kann man da sachen reinschreiben also zum beispiel jedes mal wenn ich hier in meiner schleife schleifen action mache dann kann ich hier jedes mal sagen ok das lass mal immer so storage put"}, {"id": 256, "start": 2680.92, "end": 2694.0, "text": "und in dem fall ist es ein int da muss ich den key vergeben den nennen wir jetzt beispielsweise einmal total energy und da speichern wir das da rein und wir nennen das ganze einmal"}, {"id": 257, "start": 2694.0, "end": 2714.76, "text": "total und first floor sonst ist zu lang und jetzt speichert er im flash diese zwei variablen werte und ich habe gestern abend noch mal eine halbe stunde gelesen auf der webseite vom hersteller und die sagen das ist diese schreibvorgänge sind resistent"}, {"id": 258, "start": 2714.76, "end": 2725.2, "text": "gegenüber stromausfälle also entweder ist es drin was vorher drin stand oder das aktuelle drin also sie sind so weit wie es geht atomic diese schreibwerte auf dieses mini storage welches"}, {"id": 259, "start": 2725.2, "end": 2744.76, "text": "filesystem nimmt man für den flash speicher bei so dingern die default mäßig ist spiffs das da ist standard mäßig das was dabei ist aber spiffs hat das problem wenn ich also ich könnte jetzt auch sagen hier spiffs open"}, {"id": 260, "start": 2744.76, "end": 2764.16, "text": "irgendeine datei sowas wie keine ahnung sensor data txt file right so das könnte ich auch machen aber das problem ist mal angenommen ich schreibe hier gerade meine sensorwerte rein und der strom geht in dem moment kaputt oder aber das ding"}, {"id": 261, "start": 2764.16, "end": 2784.48, "text": "crashed oder was auch immer ist dann ist das filesystem korrupt und die atei leer das ist nicht sonderlich resistent so und die das andere diese diese diese dieser kleine speicherbereich vorne wenn man das mit der library"}, {"id": 262, "start": 2784.48, "end": 2799.6, "text": "reinschreibt dann ist das so weit wie es geht sagt zumindest der hersteller resistent gegen gegen ausfälle ja bringst du es hier unten ist noch falsch ja so das heißt der speicher das da jetzt rein ne macht man man macht den ach ja stimmt das ist auch"}, {"id": 263, "start": 2799.6, "end": 2816.32, "text": "noch was man macht das man macht den flash speicher nicht kaputt weil die sind nicht doof die chinesen also zumindest die sp 32 konstruktion die sp 32 chinesen die sind nicht doof und zwar was die"}, {"id": 264, "start": 2816.32, "end": 2833.6, "text": "gemacht haben die haben für diese für diese quasi persistent library haben die das so gemacht dass sie das we're leveling oder we're leveling we're leveling heißt glaube ich vom flash"}, {"id": 265, "start": 2833.6, "end": 2850.64, "text": "controller dazwischen geschaltet haben also sprich man kann zwar hier nur auf maximal 24 kilobyte zugreifen aber unter der haube wird das über den kompletten vier megabyte flash verteilt das heißt du hast"}, {"id": 266, "start": 2850.64, "end": 2866.72, "text": "millionen von schreibzyklen bis das ding mal irgendwie anfängt rumzuspacken das heißt du kannst das problemlos jede sekunde schreiben und es geht nichts kaputt ja ihr habt recht wenn es immer die gleiche flash"}, {"id": 267, "start": 2866.72, "end": 2887.76, "text": "speicher zelle wäre dann dann wäre das ding ziemlich ziemlich schnell im arsch das ist klar da habt ihr da habt ihr schon recht"}, {"id": 268, "start": 2887.76, "end": 2900.0, "text": "so also wir speichern den kram jetzt doch in den ersten 24 kilobyte speichern wir jetzt zwei variablen von uns mit dem key total mit dem key mit dem key first floor so und es muss"}, {"id": 269, "start": 2900.0, "end": 2918.96, "text": "ich am anfang jetzt natürlich noch laden weil wenn das ding neu startet sind die werte ja nicht gesetzt sondern es müsste auch relativ relativ easy gehen und zwar kann ich ihm sagen lade mal nicht read was ist es get"}, {"id": 270, "start": 2918.96, "end": 2936.24, "text": "mit dem key total und schreibt das in die variablen rein und noch besser die haben sich also die chinesen haben sich echt was bei gedacht ich kann sogar einen default value angeben das heißt wenn es das nicht gibt"}, {"id": 271, "start": 2936.24, "end": 2965.68, "text": "dann setzt er initial das erste mal automatisch null ein also das sind ganz schöne api da haben sie sich wirklich gedanken zugemacht so und jetzt sollte er sich eigentlich die werte merken auch wenn ich neu starte probieren wir mal aus sollte jetzt funktionieren so er uploadet jetzt aktuell ist es drei das wird jetzt einmal noch resetten weil er jetzt firma flasht und neu startet aber dann probieren wir mal aus ob es funktioniert"}, {"id": 272, "start": 2965.68, "end": 2994.56, "text": "so jetzt sollte der neu starten klar neustart jawoll passt ok es ist auf null jetzt lassen wir mal den sensor ein bisschen hochzählen eins zwei drei ja ich bin ein bisschen zu schnell für die anzeige ok gut"}, {"id": 273, "start": 2994.56, "end": 3022.88, "text": "so also sechs sechs haben wir jetzt auf unserem sensor stehen so und jetzt resette ich den mal jetzt resette ich den mal und nach dem neustart sollten wieder hier sechs drinne stehen und bei jedem neuen flash wirds auch wieder null ne ne ne ne ne das wird nicht mit dem flash überflashed das ist persistent das müsste ich das müsste ich zusätzlich erasen wenn ich das löschen will"}, {"id": 274, "start": 3022.88, "end": 3052.8, "text": "das flasht das überflasht dann ich hoffe ich mal zumindest habe ich was kaputt gemacht oh nein ich habe sie überschrieben ich depp ok ich habe nichts gesagt noch mal exzellent sehr gut gemacht top ok vielleicht überflasht"}, {"id": 275, "start": 3052.8, "end": 3082.08, "text": "das doch das ding resetknopf oder so ne ne die haben keine knöpfe dran an dem teil ok das sind wir wieder probieren wir mal probieren wir mal aus ah komm her eins"}, {"id": 276, "start": 3082.08, "end": 3102.96, "text": "zwei drei alles kapiert jawoll du hast ja gesagt persistent gegen strom weg das probieren wir jetzt mal aus also persistent gegen strom weg sollte es sein das teste ich jetzt mal ich mach mal strom raus und strom rein dann sollte wieder drei da stehen klein"}, {"id": 277, "start": 3102.96, "end": 3132.08, "text": "ok habe ich irgendwas falsch gemacht was habe ich verkehrt gemacht das hat nicht funktioniert ah ich hab das wichtigste vergessen"}, {"id": 278, "start": 3132.08, "end": 3161.52, "text": "null guck mal storage beginn muss ich machen sonst lädt er das ganze gar nicht ok alles klar habe ich nix gesagt keck wait ach jetzt hat er ja wieder mein usb gerät ah jetzt muss ich mein usb gerät wieder neu"}, {"id": 279, "start": 3161.52, "end": 3174.64, "text": "ok jetzt kann ich wieder uploaden ok das war jetzt bescheuert wenn man das nicht startet dann kann es natürlich auch nicht funktionieren aber lustig dass der keinen fehler geschmissen hat das war dem vollkommen egal"}, {"id": 280, "start": 3174.64, "end": 3202.24, "text": "das große o in deiner schriftart sieht einfach aus wie ne null ne weil meine null hat ne punkt in der mitte daran erkenne ich das guck sth or rich deswegen habe ich hack mit dem null punkt in der mitte dass man es besser erkennt ok ah"}, {"id": 281, "start": 3202.24, "end": 3222.88, "text": "guck mal er hat die er hat was geladen er hat was geladen das habe ich gestern nämlich schonmal zum testen draufgeschrieben ich habe gesagt ich copy paste mir das und die werte hat er auf dem storage gefunden das sind die werte die ich gestern mal testweise draufgeschrieben habe also man sieht es funktioniert"}, {"id": 282, "start": 3222.88, "end": 3237.92, "text": "er hat das er hat das geladen ich kann es euch auch zeigen dass das funktioniert wir zählen jetzt mal ein bisschen hoch so jetzt haben wir"}, {"id": 283, "start": 3237.92, "end": 3264.48, "text": "ah jetzt haben wir 6 3 1 4 6 3 1 5 sollen jetzt flash ich noch mal und jetzt sollten die werte erhalten bleiben hier 6 3 1 5 sollte jetzt nach dem reboot wiederladen also es ist flash und stromresistent wenn ich das löschen will"}, {"id": 284, "start": 3264.48, "end": 3290.24, "text": "wenn ich das löschen will muss ich sagen flash erase dann macht er alles weg ok was war 6 3 1 5 ne 6 3 1 5 das display spackt übelst drauf aber wisst ihr was ist mir wurscht solange sich das wieder von alleine fixt ist alles gut so also hat funktioniert erledt den kram vom storage wieder sehr schön"}, {"id": 285, "start": 3290.24, "end": 3319.36, "text": "so und jetzt muss ich gucken also es war den ersten task den wir erledigt haben jetzt muss ich mal gucken wie man mqtt verwendet mit dem esp 32 und wie gesagt ich will mal gucken was wie die eingebaute mqtt variante aussieht und keine library verwenden mal gucken wie das funktioniert aber vorher brauchen wir ein mqtt server ne brauchen wir nicht wir nehmen den offiziellen im internet mosquito mqtt zum testen"}, {"id": 286, "start": 3319.36, "end": 3322.88, "text": "demo"}, {"id": 287, "start": 3322.88, "end": 3333.2, "text": "ja da wird gespammt auf dem server ich sag es euch test test punkt mosquito"}, {"id": 288, "start": 3333.2, "end": 3363.2, "text": "also mqtt ist ein protokoll das wird gerne in der heimautomatisierung verwendet das ist ein message bus da können server was oder da können können clients was reinschreiben unter einem gewissen key und andere server können das oder andere clients können das subscriben und die bekommen eine nachricht wenn einer was veröffentlicht also sprich wenn ich mich jetzt beispielsweise für interessiere für updates von meinem stromzähler dann subscribe ich mich zu diesen"}, {"id": 289, "start": 3363.2, "end": 3388.72, "text": "zu dem zu dem topic auf dem quasi neue werte veröffentlicht werden so mosquito sub nein das funktioniert so nicht so sollte es eigentlich funktionieren topic topic"}, {"id": 290, "start": 3388.72, "end": 3401.6, "text": "oh alter da wird gespammt das ist ein public in public mqtt server da wird gespammt perfekt da können wir auch da können wir auch drauf spammen"}, {"id": 291, "start": 3401.6, "end": 3416.56, "text": "so jetzt schauen wir mal wie das funktioniert also es sieht schon mal viel komplizierter aus als es wahrscheinlich ist wie funktioniert das ganze denn mqtt"}, {"id": 292, "start": 3416.56, "end": 3432.8, "text": "app start bla bla bla hier mqtt esp mqtt client handle übrigens der der protokoll name ist das beste mqtt"}, {"id": 293, "start": 3432.8, "end": 3445.04, "text": "cute chat and any cuties so also client start innets das da brauchen wir"}, {"id": 294, "start": 3445.04, "end": 3472.16, "text": "okay das war mal im set up und gucken ob alles funktioniert mqtt config aha übrigens das ist auch so eine inkonsistenz die mich nervt an c plus plus das ist die das ist die struct schreibtweise von c die nicht gültig ist in c plus plus"}, {"id": 295, "start": 3472.16, "end": 3484.8, "text": "total wir warum gibt es da unterschied ist es eigentlich richtiger fail leute ich muss mal kurz was zu trinken holen ich bin gleich wieder da ich hab übelst durst"}, {"id": 296, "start": 3562.16, "end": 3581.6, "text": "wieder da ne c plus plus ist kein derivat von c plus plus hat mal irgendeiner auf c aufgesetzt und dann hat sich das gefolgt und c plus plus sagt einfach nur viel mehr sagen kann man als programmiersprache nicht"}, {"id": 297, "start": 3581.6, "end": 3609.44, "text": "so kurz was trinken excellent okay weiter geht's also mqtt cfg hat ok config also"}, {"id": 298, "start": 3609.44, "end": 3638.24, "text": "cfg funktioniert schon mal nicht weil weil warum weil nicht included wahrscheinlich was muss ich include dass das funktioniert also man muss auch sagen ey das ist der beste china hersteller den ich kenne die haben ordentliche examples ordentliche doko durchdachte sachen also man sieht echt man muss sich da warm anziehen was die chinesen fabrizieren in den nächsten jahren die können auch durchaus gutes zeug basteln"}, {"id": 299, "start": 3638.24, "end": 3666.32, "text": "mqtt klein musch inkluden okay funktioniert das jetzt ah jetzt ok mqtt cfg so broker nee ah uri okay wie muss man da schreiben haben wir ein beispiel"}, {"id": 300, "start": 3666.32, "end": 3694.32, "text": "config broker ul okay zeig her config broker alter wie muss ich das schreiben in welcher in welcher schreibweise ich gehe mal davon aus dass das hier nicht funktionieren wird oder einfach so mal gucken probieren wir mal aus also mqtt cfg uri uri alles klar so"}, {"id": 301, "start": 3694.32, "end": 3722.64, "text": "so so jetzt verbinden wir uns zum testserver client init das prominent und klein start so das sollte soweit funktionieren upload das wahrscheinlich nicht wahrscheinlich crash das jetzt aber irgendwo muss ich doch rausfinden"}, {"id": 302, "start": 3722.64, "end": 3732.64, "text": "haben wir ja ein example für"}, {"id": 303, "start": 3732.64, "end": 3756.16, "text": "esp entwickler sind echt so ja ist echt so man muss sagen die machen wirklich sehr sehr sinnvolles zeug"}, {"id": 304, "start": 3756.16, "end": 3764.32, "text": "jetzt haben wir wieder ein beispiel ah da ist ein beispiel guck mal"}, {"id": 305, "start": 3764.32, "end": 3794.24, "text": "okay mqtt muss davor was ja okay das ding crasht crasht sich ein ab gerade also mqtt doppelpunkt doppel slash jetzt vielleicht moment eigentlich wollte ich eigentlich wollte ich uploaden"}, {"id": 306, "start": 3794.24, "end": 3804.88, "text": "die musik ist richtig pippe pippe please"}, {"id": 307, "start": 3804.88, "end": 3814.08, "text": "okay chat gif energy eine runde post post jam ob es funktioniert"}, {"id": 308, "start": 3814.08, "end": 3829.12, "text": "jetzt eine sache machen wir mal raus leute ich spreche noch mal ich spreche noch mal kurz ab diese anti brick check ist ja gut aber zum testen sagt er gerade das ding soll gefällig crashen serial print"}, {"id": 309, "start": 3829.12, "end": 3850.88, "text": "ist so wenn alles funktioniert okay haben wir vorhin den delay dass ich irgendwas sehe haben wir mal hier ein bisschen größeres delay serial monitor upload so gucken wir mal ob es jetzt klappt also es sollte ja eigentlich funktionieren wir haben eine config mit der jeweiligen uhr"}, {"id": 310, "start": 3850.88, "end": 3863.2, "text": "init und start wir machen ja noch gar nix wir machen ja noch gar nix aber laut dem beispiel code"}, {"id": 311, "start": 3863.2, "end": 3872.64, "text": "laut dem beispiel code ist da nicht so viel was man anders machen kann"}, {"id": 312, "start": 3872.64, "end": 3883.12, "text": "okay gucken wir mal ja was anderes als konsolen die backplatte da auch grad nicht übrig so okay wifi connect und und wow"}, {"id": 313, "start": 3883.12, "end": 3906.56, "text": "warum genau ist der jetzt gecrashed"}, {"id": 314, "start": 3906.56, "end": 3925.12, "text": "das ist doch was willst du hier denn großartig verkehrt machen"}, {"id": 315, "start": 3925.12, "end": 3937.84, "text": "exception was an das schreiben die immer exception handling ist noch nicht mal aktiviert das steht das steht immer da das ist eine bescheuerte bescheuerte ähm ausdrücksweise"}, {"id": 316, "start": 3937.84, "end": 3946.64, "text": "das ist noch nicht mehr exception handling an ähm mqtt kleines"}, {"id": 317, "start": 3946.64, "end": 3960.48, "text": "deswegen ist es wichtig bei dabei wenn ihr auch mal sowas macht dass ihr in der plattform auch ini dass da reinschreibt dann seht ihr nämlich wo was kaputt geht ansonsten seht ihr nur irgendwelche ram offsets und so da bringt man da bringt es eigentlich nix"}, {"id": 318, "start": 3960.48, "end": 3985.44, "text": "okay leute ich hab keine ahnung warum das abkackt aber github äh"}, {"id": 319, "start": 3985.44, "end": 4008.8, "text": "wir suchen jetzt einfach mal danach ja genau so machen wir das auch"}, {"id": 320, "start": 4008.8, "end": 4025.52, "text": "äh okay super weil perfekt das wieder voll gebracht ich hab ich schreibt überhaupt keine message"}, {"id": 321, "start": 4025.52, "end": 4045.76, "text": "ich verwende diesen den hier doch gar nicht muss ich den port angeben vielleicht muss ich den kann das sein dass ich den port angeben muss"}, {"id": 322, "start": 4045.76, "end": 4075.36, "text": "den port äh oder der nimmt bestimmt standard port guru meditation ja genau das krieg ich auch ja okay man alle das gleiche genau das so sieht übrigens so standardfehlermeldung aus wenn ihr das debug nicht eingeschaltet also vergleicht mal das hier was er bekommt als Fehlermeldung und vergleicht mal das was ich bekomme ich bekomme wirklich was wo was halbwegs sinnvolles drin steht"}, {"id": 323, "start": 4075.36, "end": 4099.28, "text": "was du will need to null or fill out all parameters of the struct ach wie moment eine neue struct anlegen nullt das nicht warum kann ich dann überhaupt was reinschreiben wenn es nicht valid ist was ich da angelegt hab"}, {"id": 324, "start": 4099.28, "end": 4128.56, "text": "ja null warum machen die das in c++ so leicht sich ähm kann man so oder so"}, {"id": 325, "start": 4128.56, "end": 4155.12, "text": "ja aber warum kann ich überhaupt was reinschreiben wenn das wenn das kein kein kein valid struct ist warum machen die so kompliziert verstehe nicht also mein man könnte ja die fälle wo man sich vertun kann so bauen dass man sich nicht vertun kann"}, {"id": 326, "start": 4155.12, "end": 4172.96, "text": "äh hallo writing ja"}, {"id": 327, "start": 4172.96, "end": 4193.04, "text": "writing postchamp fertig writen please"}, {"id": 328, "start": 4193.04, "end": 4210.88, "text": "okay okay ich flasche einfach noch mal"}, {"id": 329, "start": 4210.88, "end": 4229.44, "text": "das ist irgendwie abgekackt"}, {"id": 330, "start": 4229.44, "end": 4254.24, "text": "ist das irgendwie abgeschissen oder was"}, {"id": 331, "start": 4254.24, "end": 4272.8, "text": "ist das einfach neu starten das überraschend ist wie oft einfach neu starten funktioniert"}, {"id": 332, "start": 4272.8, "end": 4301.68, "text": "okay das war es ernsthaft anscheinend ist aber so auch valid warum okay c++ kenner warum ist das und das möglich und was ist der unterschied"}, {"id": 333, "start": 4301.68, "end": 4327.92, "text": "pass mal auf jetzt bin ich gespannt ob das geht das ist ein null initializer und was ist das"}, {"id": 334, "start": 4327.92, "end": 4336.56, "text": "im prinzip macht beides das gleiche oder wie"}, {"id": 335, "start": 4336.56, "end": 4363.24, "text": "ist das"}, {"id": 336, "start": 4363.24, "end": 4374.16, "text": "man kann die null auch ernsthaft ok es wird ja immer abgedrehter so geht auch"}, {"id": 337, "start": 4374.16, "end": 4378.32, "text": "ok es kompiliert schon mal"}, {"id": 338, "start": 4378.32, "end": 4385.0, "text": "ist ja schlimmer als unter windows manche dinger"}, {"id": 339, "start": 4385.0, "end": 4393.24, "text": "das flaschen geht langsam ganz schön lahm"}, {"id": 340, "start": 4393.24, "end": 4399.68, "text": "hier mal gucken"}, {"id": 341, "start": 4399.68, "end": 4409.44, "text": "das funktioniert auch also sehe ich das richtig die haben es wirklich geschafft"}, {"id": 342, "start": 4409.44, "end": 4414.44, "text": "dreimal was einzubauen was das gleiche macht aber man anders schreiben kann man kann so schreiben"}, {"id": 343, "start": 4414.44, "end": 4417.96, "text": "man kann so schreiben man kann so schreiben kann man denn auch so schreiben"}, {"id": 344, "start": 4417.96, "end": 4425.28, "text": "also kann man auch schreiben"}, {"id": 345, "start": 4425.28, "end": 4438.24, "text": "was die stelle immer ausdenken ist der wahnsinn ok ok also jetzt jetzt publishen wir was jetzt"}, {"id": 346, "start": 4438.24, "end": 4443.92, "text": "publishen was wir publishen ach so moment client ist ja hier nicht nicht verfügbar"}, {"id": 347, "start": 4443.92, "end": 4448.84, "text": "client dann mache ich hier dann mache ich hier mal eine schleife das ganze published"}, {"id": 348, "start": 4448.84, "end": 4457.84, "text": "weil es kommt da zwar nie raus aber es mir doch egal so der published jetzt alle sekunde"}, {"id": 349, "start": 4457.84, "end": 4474.36, "text": "in topic cute chat eins publish der keck weight und was ist das hier hinten länge if set to"}, {"id": 350, "start": 4474.36, "end": 4481.72, "text": "zero length will be calculated from payload ok das ist gut das will ich behalten q s"}, {"id": 351, "start": 4481.72, "end": 4497.32, "text": "ja und das da retain null ok passt ok wenn alles funktioniert dann sollten wir jetzt"}, {"id": 352, "start": 4497.32, "end": 4506.04, "text": "keck weight jede sekunde publishen auf den offiziellen server und zwar unter cute cute"}, {"id": 353, "start": 4506.04, "end": 4517.08, "text": "chat slash eins und dann müssen wir wahrscheinlich sowas hier hinten dran machen alter direkt"}, {"id": 354, "start": 4517.08, "end": 4524.12, "text": "zugestaltet platzmanier es ist c++ was willst du machen zwar ist es mir geht das ist echt"}, {"id": 355, "start": 4524.12, "end": 4539.84, "text": "eine komplette zugrundung die ich frage ok woher der c++ in der wahl sagt kirk weight"}, {"id": 356, "start": 4539.84, "end": 4560.44, "text": "wir publishen wunderbar bitte hast c++ ich zeig dir mal was moment wo hab ich's denn"}, {"id": 357, "start": 4560.44, "end": 4580.56, "text": "moment keck weight findet ihr nicht auch dass das eine wunderbare synthax ist das toll"}, {"id": 358, "start": 4580.56, "end": 4593.92, "text": "oder das muss man raus das muss man machen wenn man raus bekommen will welches tausender"}, {"id": 359, "start": 4593.92, "end": 4604.08, "text": "trend zeichen in dem standard länder setting verwendet werden warum eigentlich bei the"}, {"id": 360, "start": 4604.08, "end": 4608.72, "text": "way ich hab mal eine frage ich habe eine frage an die c++ kenner warum kann ich eigentlich"}, {"id": 361, "start": 4608.72, "end": 4624.48, "text": "nicht sowas machen war das war das zu wie soll ich sagen zu naheliegend oder was für"}, {"id": 362, "start": 4624.48, "end": 4632.04, "text": "das c++ krimium haben die sich gedacht so so geht das nicht das ist das nein das ist"}, {"id": 363, "start": 4632.04, "end": 4641.08, "text": "das ist nicht ok das müssen wir so machen es ist kompliziert genug ich verstehe ich"}, {"id": 364, "start": 4641.08, "end": 4647.52, "text": "verstehe es echt nicht ich weiß nicht die ok leute ich habe euch ja vorher gesagt es"}, {"id": 365, "start": 4647.52, "end": 4654.12, "text": "gibt ein gutes es gibt es gibt ein gutes c++ feature was ich was ich entdeckt habe kennt"}, {"id": 366, "start": 4654.12, "end": 4659.16, "text": "ihr oder kennt ihr das von python ich bin ich der große python programmierer aber das"}, {"id": 367, "start": 4659.16, "end": 4665.84, "text": "kenne ich das heißt ich gehe mal davon aus deswegen kennt ihr das auch also in python"}, {"id": 368, "start": 4665.84, "end": 4675.32, "text": "kannst ja sowas hier machen string gleich 1 2 3 1 2 3 so und hier drinnen kannst du"}, {"id": 369, "start": 4675.32, "end": 4679.8, "text": "stringmäßig schreiben in python was du willst unter anderem auch weitere quotes das juckt"}, {"id": 370, "start": 4679.8, "end": 4686.44, "text": "dir nicht also sprich alles zwischen diesen drei quotes ist wird wird quasi wörtlich"}, {"id": 371, "start": 4686.44, "end": 4692.28, "text": "interpretiert genau und das geht in c++ jetzt auch habe ich heute gelernt guck mal genau"}, {"id": 372, "start": 4692.28, "end": 4696.64, "text": "das war es travor recht sagt man kann jetzt sagen still gleich aber die synthax ist auch"}, {"id": 373, "start": 4696.64, "end": 4700.88, "text": "wieder geil man hätte man hätte die python synthax nehmen können alles wäre gut gewesen"}, {"id": 374, "start": 4700.88, "end": 4709.12, "text": "aber nein nein nein nein nein nein man muss machen er dann ein beliebiges trennzeichen"}, {"id": 375, "start": 4709.12, "end": 4716.08, "text": "beliebigen beliebiges trennzeichen machen ich glaube man muss ich glaube man muss quoten"}, {"id": 376, "start": 4716.08, "end": 4720.76, "text": "dann kann man muss man klammern dann muss man noch mal ein beliebiges trennzeichen machen"}, {"id": 377, "start": 4720.76, "end": 4728.0, "text": "und quoten so und alles was ich jetzt in diesen klammern schreibe wird quasi so wie ich es"}, {"id": 378, "start": 4728.0, "end": 4736.0, "text": "geschrieben habe interpretiert ohne ohne dass es kämpfen muss was natürlich schon leicht"}, {"id": 379, "start": 4736.0, "end": 4742.76, "text": "hässlich ist ja man könnte natürlich bad war ja ich weiß auch nicht man könnte natürlich"}, {"id": 380, "start": 4742.76, "end": 4753.96, "text": "die python synthax nachstellen imitieren so würde auch funktionieren wobei ich halt mich"}, {"id": 381, "start": 4753.96, "end": 4764.02, "text": "frage warum hat man nicht einfach drei quotes genommen und gut wars nee nee das ist egal"}, {"id": 382, "start": 4764.02, "end": 4768.4, "text": "du kannst auch du kannst auch b nehmen als trennzeichen ist auch vollkommen ok kannst"}, {"id": 383, "start": 4768.4, "end": 4772.8, "text": "auch b du kannst auch sagen zum beispiel was ich eigentlich ganz nice bin du kannst auch"}, {"id": 384, "start": 4772.8, "end": 4778.36, "text": "sagen sowas hier jason zum beispiel und da drinne kannst du dann jason string schreiben"}, {"id": 385, "start": 4778.36, "end": 4783.64, "text": "also du kannst hier alles schreiben was du willst aber hier drinne kannst du dann dein"}, {"id": 386, "start": 4783.64, "end": 4797.08, "text": "keck weight schreiben zum beispiel weil für was steht jason eigentlich genau das was"}, {"id": 387, "start": 4797.08, "end": 4801.12, "text": "doch wieder schreibt ja ja was gibt objekte ich glaube da wäre ich auch noch so drauf"}, {"id": 388, "start": 4801.12, "end": 4807.6, "text": "gekommen aber mal ganz im ernst also das ist auch schon wieder und unglaublich painst"}, {"id": 389, "start": 4807.6, "end": 4813.52, "text": "schämpig gelöst bei der way wir publishen übrigens immer noch keck weight jede sekunde"}, {"id": 390, "start": 4813.52, "end": 4822.52, "text": "auf den offiziellen mosquito test server ich frage mich sind die haben die haben die haben"}, {"id": 391, "start": 4822.52, "end": 4829.24, "text": "die zu viel wie nennt man das so viel zu viel ehre so ich weiß dass die sagen können im"}, {"id": 392, "start": 4829.24, "end": 4836.36, "text": "c++ gremium wir übernehmen was aus anderen sprachen was gut funktioniert also sprich"}, {"id": 393, "start": 4836.36, "end": 4841.0, "text": "warum entscheidet man sich dagegen einfach so eine etablierte syntax aus einer programmier"}, {"id": 394, "start": 4841.0, "end": 4848.52, "text": "sprache zu nehmen die man gut lesen kann und macht sowas vielleicht hatten sie ihre gründe"}, {"id": 395, "start": 4848.52, "end": 4859.16, "text": "keine habt ihr schon die essungen weight habt ihr schon die essungen weight geschichte"}, {"id": 396, "start": 4859.16, "end": 4883.24, "text": "den c++ gesehen das ist auch maximal verwirrend gemacht ob es ist das falsche"}, {"id": 397, "start": 4883.24, "end": 4887.88, "text": "okay das stimmt das stimmt ja das liegt dann hast du das problem mit rückwärts kompatible"}, {"id": 398, "start": 4887.88, "end": 4892.48, "text": "okay dann verstehe ich warum sie das gemacht haben aber man hätte einfach den erda vorschreiben"}, {"id": 399, "start": 4892.48, "end": 4898.32, "text": "können und gut wäre man hätte man hätte beispielsweise sagen können okay man man"}, {"id": 400, "start": 4898.32, "end": 4904.12, "text": "man macht einfach nen default delimiter weil das hier darf man ja machen ja das hier darf"}, {"id": 401, "start": 4904.12, "end": 4909.92, "text": "man ja machen man könnte einfach sagen man macht den default delimiter und den kann"}, {"id": 402, "start": 4909.92, "end": 4913.04, "text": "man manchmal überschreiben aber da hätte man nicht so komisches zeug gebracht guckt"}, {"id": 403, "start": 4913.04, "end": 4931.6, "text": "euch das hier mal an hier also c++ ist nicht lesbar richtig"}, {"id": 404, "start": 4931.6, "end": 4949.76, "text": "so also wir wir publishen was ist denn jetzt eine eine was pepo fett"}, {"id": 405, "start": 4949.76, "end": 4955.6, "text": "okay also das funktioniert ich würde sagen wir legen jetzt mal ein home assistant was"}, {"id": 406, "start": 4955.6, "end": 4963.08, "text": "wir jetzt an über diesen mqtt server damit das ganze ein bisschen schöner wird rappen"}, {"id": 407, "start": 4963.08, "end": 4971.64, "text": "wir das mal also die dinger hier brauchen wir okay lass mich lass mal kurz in mich gehen"}, {"id": 408, "start": 4971.64, "end": 4977.8, "text": "wir machen jetzt big brain c++ class mal gucken ob ich das auf die reihe krieg nur noch mal"}, {"id": 409, "start": 4977.8, "end": 4993.96, "text": "testweise ja also class das heißt jetzt eats mqtt beste so das kommt weg wollen wir alles"}, {"id": 410, "start": 4993.96, "end": 5001.8, "text": "inline destructor brauchen wir auch nicht so in unseren constructor kommt was ich auch"}, {"id": 411, "start": 5001.8, "end": 5004.92, "text": "nicht verstehe ist warum man das teilweise inline schreiben kann und teilweise nicht"}, {"id": 412, "start": 5004.92, "end": 5018.16, "text": "ich überlege gerade wie man das jetzt machen wir können"}, {"id": 413, "start": 5018.16, "end": 5034.96, "text": "ok ok ich war ich ich weiß wie was man also client string broker user falls man das brauchen"}, {"id": 414, "start": 5034.96, "end": 5043.56, "text": "user ist standardmäßig leer password ist auch standardmäßig leer jetzt kommt kasser"}, {"id": 415, "start": 5043.56, "end": 5052.32, "text": "abstraktions champ jetzt so copy pasten wir hier mal das rein mqt clients das ist konfig"}, {"id": 416, "start": 5052.32, "end": 5070.72, "text": "uri so das da ist da waren auch private variables für das lager das schreibe einfach in eine"}, {"id": 417, "start": 5070.72, "end": 5076.0, "text": "dritte datei dass uns das nicht mehr so nervt hier so dann weisen wir das mal zu also broker"}, {"id": 418, "start": 5076.0, "end": 5090.84, "text": "ist broke hallo auto auto complete please user ist user pw ist pw ok so das da ist dann"}, {"id": 419, "start": 5090.84, "end": 5101.04, "text": "in dem fall broker so und dann brauchen wir noch für usernamen und password wie heißt"}, {"id": 420, "start": 5101.04, "end": 5106.96, "text": "das user warum leckten das so rum user pw password"}, {"id": 421, "start": 5106.96, "end": 5127.36, "text": "ist übrigens auch so ein ding wo man sich voll"}, {"id": 422, "start": 5127.36, "end": 5131.2, "text": "ne micro python hat ganz andere probleme zum beispiel dass die ganz viele treiber libraries"}, {"id": 423, "start": 5131.2, "end": 5137.32, "text": "fehlen ne ne micro python in dem fall tatsächlich auch nicht wirklich besser finde ich man kann"}, {"id": 424, "start": 5137.32, "end": 5144.88, "text": "sich übrigens in c++ auch übelst leicht ins bein schießen und zwar das das geht kaputt"}, {"id": 425, "start": 5144.88, "end": 5152.44, "text": "das ist erlaubt weil in dem fall schreibe ich den string hier erstmal in ein globales"}, {"id": 426, "start": 5152.44, "end": 5157.84, "text": "globale variable von meiner klasse rein und davon hole ich mir dann den pointer und wenn"}, {"id": 427, "start": 5157.84, "end": 5162.4, "text": "ich hier direkt den pointer für nehme dann ist er nicht mehr gültig wenn es hier unten"}, {"id": 428, "start": 5162.4, "end": 5170.64, "text": "ankommt das kackt ab da muss man auch dran denken weil weil ja so also broker pass pass"}, {"id": 429, "start": 5170.64, "end": 5177.08, "text": "pass so klein start das klingt auch schon mal sinnvoll was wir hier gebaut haben so"}, {"id": 430, "start": 5177.08, "end": 5189.48, "text": "und ja machen wir jetzt eine neue methode drin void publish publish string topic message"}, {"id": 431, "start": 5189.48, "end": 5201.0, "text": "ok mal gucken ob mein geräpper funktioniert klein start so dann machen wir noch ein flack"}, {"id": 432, "start": 5201.0, "end": 5209.96, "text": "startet falls am moment ich sollte da vielleicht auch mal was da vorschreiben dass das funktioniert"}, {"id": 433, "start": 5209.96, "end": 5221.64, "text": "so und jetzt gucken wir wenn der mqtt klein gestern nicht warum erkennt er das jetzt wieder"}, {"id": 434, "start": 5221.64, "end": 5230.4, "text": "das ist das problem moment moment mein ich bin ich bin falsch ich bin falsch ich hab"}, {"id": 435, "start": 5230.4, "end": 5245.04, "text": "mich vertan ich hab mich verguckt so startet wenn es nicht startet ist dann will ich den"}, {"id": 436, "start": 5245.04, "end": 5249.4, "text": "kleinen start ich will das nur einmal machen weil sonst geht es garantiert kaputt so dann"}, {"id": 437, "start": 5249.4, "end": 5259.2, "text": "ich starte true wunderbar und dann publish ich das delay kann wieder raus ok so unsere"}, {"id": 438, "start": 5259.2, "end": 5268.2, "text": "rapper künste gucken wir mal ob es funktioniert das lagern wir jetzt erstmal aus warte mal"}, {"id": 439, "start": 5268.2, "end": 5281.76, "text": "habe ich sowas nicht schon habe ich nicht sowas schon mal gemacht warte mal ich bilde"}, {"id": 440, "start": 5281.76, "end": 5295.84, "text": "mir ein das habe ich doch vielleicht habe ich bloß nicht rüber kopiert na gut so jetzt"}, {"id": 441, "start": 5295.84, "end": 5302.24, "text": "schauen wir mal ob das funktioniert was ich da gebastelt habe also löschen wir den kram"}, {"id": 442, "start": 5302.24, "end": 5314.04, "text": "erst mal wieder habe ich schon weggemacht ok die musik ist aktuell youtube hier das"}, {"id": 443, "start": 5314.04, "end": 5319.48, "text": "da happy mario kart musik das ist irgendwie f0 musik würde ich sagen klingt klingt äußerst"}, {"id": 444, "start": 5319.48, "end": 5329.32, "text": "nach f0 ok also dann legen wir das jetzt mal an wie habe ich das genannt eats eats mqtt"}, {"id": 445, "start": 5329.32, "end": 5334.52, "text": "an die helper heißt das helper eats was ist mit meinem intellisens los kann da mal ein"}, {"id": 446, "start": 5334.52, "end": 5342.64, "text": "bisschen zu potte kommen hier eats mqtt so an was muss ich da eh mein intellisens ist"}, {"id": 447, "start": 5342.64, "end": 5349.4, "text": "mega im arsch ok leute ich starte mal neu da geht es wahrscheinlich besser reboot hilft"}, {"id": 448, "start": 5349.4, "end": 5364.08, "text": "immer bei allem jetzt geht schnell lustig so string user passwort brauche man nicht mqtt"}, {"id": 449, "start": 5364.08, "end": 5373.96, "text": "test ich habe könnten jetzt auch super wir können auch super etwa hallo ich will da drauf"}, {"id": 450, "start": 5373.96, "end": 5381.76, "text": "klicken wir könnten auch super advanced sein und sagen ist mal gucken ob das kann broker"}, {"id": 451, "start": 5381.76, "end": 5399.4, "text": "starts with mqtt dann setze ich das da vor dass das wäre ja mal massive big brain das"}, {"id": 452, "start": 5399.4, "end": 5408.24, "text": "das wäre auch mal was da kann ich das hier nämlich weglassen huge so ob das jetzt funktioniert"}, {"id": 453, "start": 5408.24, "end": 5420.52, "text": "weil ich da gebaut habe unterstrich was wo ah nee nee nee nee nicht nicht underscore"}, {"id": 454, "start": 5420.52, "end": 5424.16, "text": "das ist an der stelle hier noch ok es weiß ich ja erst später dann zu das ist schon"}, {"id": 455, "start": 5424.16, "end": 5431.04, "text": "noch das ok das ist in ordnung so dann gucken wir mal ob das jetzt funktioniert was ich"}, {"id": 456, "start": 5431.04, "end": 5437.84, "text": "da gebaut habe da wird das nämlich gleich ein bisschen ordentlicher hier so setup ist"}, {"id": 457, "start": 5437.84, "end": 5442.04, "text": "alles in ordnung brauchen wir nichts machen in der loop in der loop machen wir das jetzt"}, {"id": 458, "start": 5442.04, "end": 5453.96, "text": "also mqtt publish hier publishen topic wie habe ich das genannt gut topic cute chat"}, {"id": 459, "start": 5453.96, "end": 5465.12, "text": "eins publishen wir jetzt die message 0w jede sekunde hoffentlich crash das jetzt nicht"}, {"id": 460, "start": 5465.12, "end": 5479.6, "text": "gleich was habe ich übersehen ja klar brauche auch noch wenn der klein muss da oben hin"}, {"id": 461, "start": 5479.6, "end": 5488.6, "text": "wenn klein händel klein händel klein händel muss dahin machst du den chatbot nein ich"}, {"id": 462, "start": 5488.6, "end": 5506.6, "text": "lese mal strom zähler aus klein händel so jetzt muss das funktionieren die konfig vielleicht"}, {"id": 463, "start": 5506.6, "end": 5516.0, "text": "auch also underscore startet die konfig ich würde das erwarten die kopierter sehen wir"}, {"id": 464, "start": 5516.0, "end": 5521.64, "text": "gleich wir sehen wenn es krascht du hast ein twitch bot gebaut mit javascript exzellent"}, {"id": 465, "start": 5521.64, "end": 5529.44, "text": "so wenn es krascht geht es nicht wenn es geht dann geht es ohne zu kraschen das exzellent"}, {"id": 466, "start": 5529.44, "end": 5542.12, "text": "logik das flaschen ist mittlerweile echt schon lahm ok mein dir ob mein dir es funktioniert"}, {"id": 467, "start": 5542.12, "end": 5560.32, "text": "post jam das skaliert diagonal ip ok ist nicht gecrashed das ist schon mal ein gutes zeichen"}, {"id": 468, "start": 5560.32, "end": 5574.44, "text": "keck weit jawoll funktioniert ne moment ich bräuchte ich publishe hardcoded ok das kann"}, {"id": 469, "start": 5574.44, "end": 5586.04, "text": "er nicht funktionieren aber aber es wird funktionieren und übrigens das topic habe ich auch nicht"}, {"id": 470, "start": 5586.04, "end": 5614.24, "text": "verwendet ich kann nur ok ok ok ok die library dieses esp zeugs ist eigentlich alles so in"}, {"id": 471, "start": 5614.24, "end": 5622.92, "text": "in bis auf bis auf manche sachen und den arduino aufsatz der ist nicht so warum verwendest du"}, {"id": 472, "start": 5622.92, "end": 5627.64, "text": "hier c++ als programmiersprache weil ich das ding hier programmieren das was da hängt"}, {"id": 473, "start": 5627.64, "end": 5632.52, "text": "diesen microcontroller das geht nur sinnvoll in c++ es gibt nur micropiles implementierung"}, {"id": 474, "start": 5632.52, "end": 5641.48, "text": "das da aber ganz andere probleme mit und die rast implementierung ist experimental ja erzählen"}, {"id": 475, "start": 5641.48, "end": 5646.0, "text": "erzählen das mit dem mit der mit der klammer geschichte ich das will ich vielleicht vielleicht"}, {"id": 476, "start": 5646.0, "end": 5649.52, "text": "haben die sich ja wenigstens was bei gedacht schön finde ich trotzdem nicht aber ich mein"}, {"id": 477, "start": 5649.52, "end": 5658.4, "text": "sie haben sich immerhin vielleicht aber gedanken zugemacht so funktioniert das ganze doch"}, {"id": 478, "start": 5658.4, "end": 5666.92, "text": "schon mal ein bisschen übersichtlicher gemacht nice soll jetzt muss ich es noch schaffen"}, {"id": 479, "start": 5666.92, "end": 5676.76, "text": "im home assistant den sensor anzulegen ah jetzt minimieren wir den kramer wie viel versteht"}, {"id": 480, "start": 5676.76, "end": 5684.58, "text": "ihr ich checke gar nichts das bin ich mal gespannt was was ab abstimmung teilweise alles"}, {"id": 481, "start": 5684.58, "end": 5691.68, "text": "den größten teil was ist denn los wie es haben nur zehn leute mitgemacht bei der abstimmung"}, {"id": 482, "start": 5691.68, "end": 5701.92, "text": "das aber das aber wenig hätte ich gedacht normalerweise machen da immer mehr mit die"}, {"id": 483, "start": 5701.92, "end": 5707.68, "text": "meisten leute sind brain exploded ja normalerweise machen da irgendwie achtschleuder oder somit"}, {"id": 484, "start": 5707.68, "end": 5714.12, "text": "bei den anderen ist das ist das gehirn schon ausgestiegen ich habe die umfrage übrigens"}, {"id": 485, "start": 5714.12, "end": 5725.52, "text": "auch nicht gesehen ich habe die umfrage erst gesehen als sie fertig war die hat die hat"}, {"id": 486, "start": 5725.52, "end": 5731.92, "text": "wirklich richtig angezeigt nur dass die abstimmung beendet ist ok also wie legen wir jetzt in"}, {"id": 487, "start": 5731.92, "end": 5736.96, "text": "home assistant in home assistant einen neuen sensor ich weiß prinzipiell wie das funktioniert"}, {"id": 488, "start": 5736.96, "end": 5742.96, "text": "ich habe das schon mal gemacht aber so ganz sicher bin ich mir nicht aber ich kann irgendwo"}, {"id": 489, "start": 5742.96, "end": 5749.76, "text": "in meinem shit repo gucken du kannst ruhig noch mal die abstimmung machen ein bisschen"}, {"id": 490, "start": 5749.76, "end": 5757.36, "text": "länger laufen lassen dann gucke ich live mit hier discovery da steht es irgendwo drinne"}, {"id": 491, "start": 5757.36, "end": 5763.84, "text": "was man für topics senden muss genau so kann man sensoren anlegen also wie gesagt das ist"}, {"id": 492, "start": 5763.84, "end": 5770.08, "text": "meine meine testinstallation vom home assistant und hier in den developer tools sieht man"}, {"id": 493, "start": 5770.08, "end": 5774.08, "text": "was alles für geräte drin angelegt sind ist auch nicht viel weil es eine testinstallation"}, {"id": 494, "start": 5774.08, "end": 5780.16, "text": "ist ich versuche jetzt mal meinen strom sensor anzulegen und dann machen wir mal ein schöne"}, {"id": 495, "start": 5780.16, "end": 5796.56, "text": "da haben wir hier mal so schöne übersichtskarte mit wie nennt man das so druckanzeige wie"}, {"id": 496, "start": 5796.56, "end": 5804.04, "text": "war nicht wie warm wie viel das gerade verbraucht und so gucken wir mal so also das muss ich"}, {"id": 497, "start": 5804.04, "end": 5813.88, "text": "jetzt hinschicken sensor binary sensor ok das haben sie kacke formatiert also ich muss"}, {"id": 498, "start": 5813.88, "end": 5818.76, "text": "das hier das hier muss ich jetzt übermitteln dass es funktioniert die musik passt richtig"}, {"id": 499, "start": 5818.76, "end": 5833.56, "text": "gut ja ist nice umfrage läuft noch mal ok also zeigt mal her"}, {"id": 500, "start": 5833.56, "end": 5836.4, "text": "jetzt sehe ich die umfrage auch vorher wurden die mir nur angezeigt als die fertig war"}, {"id": 501, "start": 5836.4, "end": 5851.56, "text": "können wir hier alle mal eine runde dran beteiligen ich finde es witzig dass die meisten"}, {"id": 502, "start": 5851.56, "end": 5854.68, "text": "leute halbwegs durchblicken aber ein paar gar nichts checken und trotzdem gucken was"}, {"id": 503, "start": 5854.68, "end": 5861.12, "text": "übrigens sehr nice finde mich würde interessieren von jemand der gar nichts checkt guckt ihr"}, {"id": 504, "start": 5861.12, "end": 5864.48, "text": "das weil ihr was checken wollt oder weil es entspannend findet oder weil ihr mir gerne"}, {"id": 505, "start": 5864.48, "end": 5871.4, "text": "zuhört bei irgendwelchen dinge die ich mache oder das ist übrigens sehr gut jemand der"}, {"id": 506, "start": 5871.4, "end": 5876.92, "text": "nicht weiß was c++ ist der hat sich sehr viel ärger im leben erspart das würde ich"}, {"id": 507, "start": 5876.92, "end": 5884.0, "text": "auch bevorzugen nicht nicht zu wissen was c++ ist das könnte ich nämlich einfach sagen"}, {"id": 508, "start": 5884.0, "end": 5900.76, "text": "ok wir konnten gleich mal rein wenn die umfrage fertig ist"}, {"id": 509, "start": 5900.76, "end": 5917.72, "text": "zu erlauben uns dankeschön fünf monat subscription war das der icq sound der msn sound"}, {"id": 510, "start": 5917.72, "end": 5930.88, "text": "jetzt kommt die erklärung also wenn du das wenn du die geschweifler nicht schreibt wird"}, {"id": 511, "start": 5930.88, "end": 5935.24, "text": "generell nur der speicher reservierte ob das objekt ist nicht initialisiert warum kann"}, {"id": 512, "start": 5935.24, "end": 5945.2, "text": "ich denn aber dann was reinschreiben also sprich sagen wir mal so dass es internen"}, {"id": 513, "start": 5945.2, "end": 5950.16, "text": "zeiger auf den speicherbereich war einfach random sachen drin stehen und der zeiger auf"}, {"id": 514, "start": 5950.16, "end": 5958.72, "text": "den speicherbereich ist gültig aber da drin nix das ist c++ im prove in c++ muss die funktionssignale"}, {"id": 515, "start": 5958.72, "end": 5966.76, "text": "mit dem auf funktionsaufruf beidem ja das kenne ich das kenne ich aber warum gibt es"}, {"id": 516, "start": 5966.76, "end": 5972.08, "text": "klammer auf klammer zu klammer auf null klammer zu gleichheitszeichen dazwischen und ohne"}, {"id": 517, "start": 5972.08, "end": 5985.6, "text": "gleichheitszeichen das ganze noch mal"}, {"id": 518, "start": 5985.6, "end": 5990.04, "text": "backwards compatibility ja das kann sein ok das hier muss ich jetzt übertragen also"}, {"id": 519, "start": 5990.04, "end": 5995.74, "text": "ich kopiere mir das mal rein das heißt wenn ich den sensor in home assistant anlegen will"}, {"id": 520, "start": 5995.74, "end": 6005.32, "text": "dann müssen wir diesen krempel hier übertragen also schau mal mal schau mal mal mqtt wo sind"}, {"id": 521, "start": 6005.32, "end": 6025.6, "text": "wir hab ich das gelöscht also also mqtt publish publish so also wow was von ks ok das ist"}, {"id": 522, "start": 6025.6, "end": 6032.88, "text": "der das ist das topic ziegenkäse twitch bleiben für den sub und vorher auch noch irgendjemand"}, {"id": 523, "start": 6032.88, "end": 6035.64, "text": "den ich nicht gesehen habe jeder soll lauren zog den habe ich gesehen als für die ganzen"}, {"id": 524, "start": 6035.64, "end": 6054.32, "text": "subs ok also das ist denn das ist das erste was wir hinschicken müssen das ist das topic"}, {"id": 525, "start": 6054.32, "end": 6062.4, "text": "sprech das mal um dass das kleiner erkennen also mqtt publish wir haben jetzt ja gelernt"}, {"id": 526, "start": 6062.4, "end": 6068.84, "text": "dass das funktioniert das ist das topic ok dass das check ich noch das ist easy topic"}, {"id": 527, "start": 6068.84, "end": 6077.04, "text": "so und jetzt string message jetzt können wir gleich die super tolle neue c++ syntax verwenden"}, {"id": 528, "start": 6077.04, "end": 6097.84, "text": "und zwar wie war die noch mal so geht das jetzt auch aha verstehe audi feier plubus"}, {"id": 529, "start": 6097.84, "end": 6101.6, "text": "dankeschön für den für den prime sub so und da muss man jetzt den kram übertragen"}, {"id": 530, "start": 6101.6, "end": 6109.12, "text": "also die weiß glas temperature nein ich will die weiß glas energie haben wir machen das"}, {"id": 531, "start": 6109.12, "end": 6114.16, "text": "meine neue zeile dann sieht es vielleicht ein bisschen schöner aus wie formatier ich"}, {"id": 532, "start": 6114.16, "end": 6127.04, "text": "das jetzt sinnvoll das sieht das sieht trotzdem kacke aus so vielleicht nee ok ich schreibe"}, {"id": 533, "start": 6127.04, "end": 6135.0, "text": "das jetzt einfach mal so rein die weiß glas die weiß dass ich weiß dass das energie ist"}, {"id": 534, "start": 6135.0, "end": 6151.8, "text": "ich kann das nämlich einfach mal abgucken ok sensor ist watt champ watt champ total"}, {"id": 535, "start": 6151.8, "end": 6161.68, "text": "energie config ok so wie gehts jetzt weiter name achso name muss ich hier unten auch machen"}, {"id": 536, "start": 6161.68, "end": 6169.28, "text": "ok comma ach moment das ist ein jason objekt da müssen da müssen schweifte klammern"}, {"id": 537, "start": 6169.28, "end": 6178.96, "text": "drum herum boah das ist ja eklig so und was muss ich jetzt machen state topic nee name"}, {"id": 538, "start": 6178.96, "end": 6191.08, "text": "muss ich vergeben ok wie heißt das ding name heißt so wieder key watt champ total energie"}, {"id": 539, "start": 6191.08, "end": 6197.36, "text": "muss man die stärken die quotes nicht eskäpen nee das hier ist neues string literal syntax"}, {"id": 540, "start": 6197.36, "end": 6202.6, "text": "habe ich heute auch gelernt das ist neu wenn man das nimmt dann muss man das nicht mehr"}, {"id": 541, "start": 6202.6, "end": 6208.52, "text": "eskäpen dafür kann man auch nichts einsetzen in drinnen green style vier monate dankeschön"}, {"id": 542, "start": 6208.52, "end": 6213.2, "text": "für den sub der go live fünf monat jetzt fliegen die subs aber ihr habt hier nice nice"}, {"id": 543, "start": 6213.2, "end": 6219.6, "text": "huge iq für den chat wieder danke leute für die ganzen subscriptions dazu kann ich nur sagen"}, {"id": 544, "start": 6219.6, "end": 6244.76, "text": "hier hypersubscriber ok watt champ total energie und nun state topic state topic state topic"}, {"id": 545, "start": 6244.76, "end": 6253.16, "text": "ist anscheinend das gleiche wie das hier nur hinten mit state dran denn wir sollten es"}, {"id": 546, "start": 6253.16, "end": 6262.12, "text": "doch mal umbrechen kann man das vielleicht irgendwie so machen warte ich versuche es"}, {"id": 547, "start": 6262.12, "end": 6275.92, "text": "mal irgendwie halbwegs leserlich zu formatieren"}, {"id": 548, "start": 6275.92, "end": 6293.44, "text": "so ok ich glaube es ist zwar nicht wirklich schön aber man kann es irgendwie halbwegs"}, {"id": 549, "start": 6293.44, "end": 6306.16, "text": "lesen jetzt du meinst die klammern hier und hier nee das so ein stand schon da finde"}, {"id": 550, "start": 6306.16, "end": 6317.04, "text": "ich ok mehr braucht man jetzt nicht value template ist egal so das sollte jetzt funktionieren"}, {"id": 551, "start": 6317.04, "end": 6328.68, "text": "ich ich lade das mal hoch ach moment wir müssen den broker noch einstellen lull ne ich mach"}, {"id": 552, "start": 6328.68, "end": 6333.72, "text": "beides also ich ich lese den ich lese den stromzähler aus daraus kann ich mir ich kann"}, {"id": 553, "start": 6333.72, "end": 6340.64, "text": "mir für den den verbrauch den verbrauch kann ich direkt auslesen aber wie viel der aktuell"}, {"id": 554, "start": 6340.64, "end": 6348.2, "text": "gerade energie brauche kann ich mir da auch ausrechnen weil ich weiß ja in welchem abstand"}, {"id": 555, "start": 6348.2, "end": 6353.6, "text": "sagen wir mal die letzten zweimal gezählt wurde und wie viel pro tick also ich weiß"}, {"id": 556, "start": 6353.6, "end": 6358.84, "text": "dass keine ahnung ein tick ist 0,8 wattstunden und ich weiß es gab jetzt die letzten fünf"}, {"id": 557, "start": 6358.84, "end": 6363.36, "text": "ticks über eineinhalb minuten da kann ich mir auch ausrechnen so über den daumen gepeilt"}, {"id": 558, "start": 6363.36, "end": 6368.6, "text": "was er aktuell gerade gerade braucht habe ich aber nicht gemacht ich will jetzt erstmal"}, {"id": 559, "start": 6368.6, "end": 6373.2, "text": "gucken dass ich mir den sensor in meiner heim automatisierung anlegen legen kann ok also"}, {"id": 560, "start": 6373.2, "end": 6381.44, "text": "wenn ich jetzt alles richtig gemacht habe dann sollte der ich muss auch ich muss auch"}, {"id": 561, "start": 6381.44, "end": 6387.0, "text": "zu meinem mqtt server schicken dann sollte jetzt ein sensor anlegen dazu muss ich erst"}, {"id": 562, "start": 6387.0, "end": 6393.08, "text": "mal den mqtt server hier drauf überhaupt starten so config integrations wie ging das"}, {"id": 563, "start": 6393.08, "end": 6410.68, "text": "noch mal mqtt ne moment wo addon store mqtt das war mqtt broker installieren zack install"}, {"id": 564, "start": 6410.68, "end": 6436.08, "text": "config logins home assistant mqtt addon broker addon logins wie mache ich noch mal da verschiedene"}, {"id": 565, "start": 6436.08, "end": 6444.72, "text": "sonst ist sonst kann man sich da anonym anmelden oder logins kann ich so was sagen wie admin"}, {"id": 566, "start": 6444.72, "end": 6458.84, "text": "muss man kurz gucken wie die syntax richtig ist wie geht das jetzt logins hier logins"}, {"id": 567, "start": 6458.84, "end": 6467.72, "text": "ach so das ist wie das hat documentation ernsthaft logins optional ach hier null ok ich habe nichts"}, {"id": 568, "start": 6467.72, "end": 6496.84, "text": "gesagt usernamen admin 123456 beste beste save alles klar warum ist das wieder weg wollen"}, {"id": 569, "start": 6496.84, "end": 6510.4, "text": "ich veräppeln"}, {"id": 570, "start": 6510.4, "end": 6519.32, "text": "jetzt ging es oder was ist admin 123456 standardmäßig schon drin warum ist das fack ist das grad"}, {"id": 571, "start": 6519.32, "end": 6528.92, "text": "facking broken kann das sein oder muss man das quaten ok ich lasse es jetzt einfach so"}, {"id": 572, "start": 6528.92, "end": 6546.44, "text": "alles klar start ja ja warning ist gut passt ok sab checken wir mal ob das jetzt funktioniert"}, {"id": 573, "start": 6546.44, "end": 6558.6, "text": "kann man kann man jetzt subscribe ach so ja user user admin password 123456 ok scheint"}, {"id": 574, "start": 6558.6, "end": 6564.04, "text": "zu funktionieren ok wir lauschen aber jetzt versuchen wir die ganzen kram mal zu publishen"}, {"id": 575, "start": 6564.04, "end": 6568.64, "text": "ktt also user haben wir gesagt jetzt können wir auch gleich gucken ob die anmeldung funktioniert"}, {"id": 576, "start": 6568.64, "end": 6578.96, "text": "admin 123456 beste beste passport kombination überhaupt nimmt er den standard account das"}, {"id": 577, "start": 6578.96, "end": 6583.12, "text": "wusste ich nicht nee das ist gut das ist nicht gut ich will den standard account passport"}, {"id": 578, "start": 6583.12, "end": 6587.12, "text": "ändern können ohne dass ich also jetzt in dem fall schon aber ich will den standard"}, {"id": 579, "start": 6587.12, "end": 6591.48, "text": "account passport ändern können ohne dass ich meine ganze mqt mqt geräte anfassen will"}, {"id": 580, "start": 6591.48, "end": 6611.32, "text": "ok also dann schauen wir mal ob der das schafft dahin zu connecten admin 123456 und er publish"}, {"id": 581, "start": 6611.32, "end": 6617.88, "text": "dieses topic ok wenn es alles funktioniert sollte ich jetzt den sensor haben der watt"}, {"id": 582, "start": 6617.88, "end": 6625.16, "text": "champ total energy heißt und wir gucken mal ob das funktioniert wir gehen mal in die"}, {"id": 583, "start": 6625.16, "end": 6632.48, "text": "logs vom system der meckert nämlich rum wenn wenn man eine message die er nicht pasen"}, {"id": 584, "start": 6632.48, "end": 6643.8, "text": "kann normalerweise kann man hier oben logs auswählen warum geht das nicht ich glaube"}, {"id": 585, "start": 6643.8, "end": 6650.36, "text": "man muss erst advanced mode einschalten ne advanced mode für die big brain leute unter"}, {"id": 586, "start": 6650.36, "end": 6662.6, "text": "uns wir gehen uns nicht mit dem normalen normalen modus irgendwie irgendwie ab oh chocked nee"}, {"id": 587, "start": 6662.6, "end": 6677.0, "text": "das was anderes oder 1840 hat das jetzt funktioniert oder nicht ok ok es kam an es kam an es sieht"}, {"id": 588, "start": 6677.0, "end": 6683.2, "text": "auch in irgendeine art und weise wie gültig ist jason aus was ich da gepostet habe so"}, {"id": 589, "start": 6683.2, "end": 6691.32, "text": "der spur nach zumindest so habe ich jetzt den sensor da war eine dark theme einstellung"}, {"id": 590, "start": 6691.32, "end": 6715.68, "text": "ja machen wir jetzt gleich ja nee aber hier ok haben wir jetzt in watt champ"}, {"id": 591, "start": 6715.68, "end": 6726.56, "text": "das hat nicht funktioniert aber er hat nicht gemeckert oder ok ich lasse ihn einfach publishen"}, {"id": 592, "start": 6726.56, "end": 6733.52, "text": "in der loop dann sehe ich öfters wenn es ein fehler gibt ich habe garantiert irgendwo"}, {"id": 593, "start": 6733.52, "end": 6738.2, "text": "ein fehler hier in meiner jason syntax drin braucht es ein abschließendes comma oder"}, {"id": 594, "start": 6738.2, "end": 6751.64, "text": "nicht nee oder brauchst ich glaube es darf sogar gar kein abschließendes comma haben"}, {"id": 595, "start": 6751.64, "end": 6761.36, "text": "ich glaube die meisten fressen das aber ganz korrekterweise dürfte es das nicht so legt"}, {"id": 596, "start": 6761.36, "end": 6774.88, "text": "jetzt den sensor an system ach ich kann nur ich habe ja gar nicht die integration an"}, {"id": 597, "start": 6774.88, "end": 6782.92, "text": "die das die das einbindet configure enable discovery ich habe ja noch gar nicht eingeschaltet"}, {"id": 598, "start": 6782.92, "end": 6799.08, "text": "dass er das überhaupt macht submit finish system options ok passt und jetzt die wellopper"}, {"id": 599, "start": 6799.08, "end": 6826.16, "text": "tools nicht da aber ich meine published schön schön am publishen moment aber das topic"}, {"id": 600, "start": 6826.16, "end": 6843.44, "text": "stimmt doch stimmt das topic ja das topic stimmt ok discover das jetzt oder nicht er"}, {"id": 601, "start": 6843.44, "end": 6856.28, "text": "meckert zumindest schon mal nicht rum"}, {"id": 602, "start": 6856.28, "end": 6862.76, "text": "er sollte eigentlich den sensor watt champ total energy haben ich glaube ich restarte"}, {"id": 603, "start": 6862.76, "end": 6883.52, "text": "einfach noch mal ich restarte configuration server restart schadet nichts restart hilft"}, {"id": 604, "start": 6883.52, "end": 6897.24, "text": "restart geht immer das sieht jetzt schon so aus als müssten funktionieren von der sündags"}, {"id": 605, "start": 6897.24, "end": 6904.96, "text": "her die weißglas namestay topic ich habe die ganze zeit eine pizza neben mir stehen"}, {"id": 606, "start": 6904.96, "end": 6913.96, "text": "da und ich komme nicht zum essen kam jetzt zumindest hier noch fertig machen weil er"}, {"id": 607, "start": 6913.96, "end": 6931.48, "text": "wieder da notifications new devices discover check out ja ich weiß pizza ist kalt ok das"}, {"id": 608, "start": 6931.48, "end": 6940.2, "text": "juckt den nicht dass er das discovert warum nicht alles auf einem rechner weil ich das"}, {"id": 609, "start": 6940.2, "end": 6948.76, "text": "schlechter wieder runter krieg ok dann discovert das nicht warum nicht developer tools ok was"}, {"id": 610, "start": 6948.76, "end": 6956.88, "text": "was habe ich was was vergesse ich was habe ich verkehrt gemacht mqt discovery home assistant"}, {"id": 611, "start": 6956.88, "end": 6966.08, "text": "was habe ich was habe ich verkehrt gemacht if discover ich gucke jetzt einfach mal kurz"}, {"id": 612, "start": 6966.08, "end": 6971.56, "text": "in mein in meine richtigen home assistant weil da habe ich das eingeschaltet und das"}, {"id": 613, "start": 6971.56, "end": 6982.68, "text": "discover funktioniert integration konfigurieren da ist auch nichts nichts konfigured und im"}, {"id": 614, "start": 6982.68, "end": 7001.12, "text": "mqtt add-on ist auch nix konfiguriert also das von der idee her müsste das jetzt eigentlich"}, {"id": 615, "start": 7001.12, "end": 7015.52, "text": "funktionieren homos slash home assistant sensor watsch im total energy konfig aber es juckt"}, {"id": 616, "start": 7015.52, "end": 7035.68, "text": "hier nicht guckt mal schnell in meine konfig rein ob ich da irgendwas drin stehen habe ich"}, {"id": 617, "start": 7035.68, "end": 7043.04, "text": "habe nix großartiges dafür konfiguriert das weiß ich noch also sensor sensor nene nene"}, {"id": 618, "start": 7043.04, "end": 7058.52, "text": "nix nix nix nix drin das ist ein falsches system zum ausprobieren aber das müsste doch"}, {"id": 619, "start": 7058.52, "end": 7076.7, "text": "jetzt gehen? Okay wir gucken mal in die Logs. New Client Connected. ESP, da ist er. Ich"}, {"id": 620, "start": 7076.7, "end": 7091.12, "text": "meine er publisht ja auch. Okay keine Ahnung was der für Schmerzen hat ehrlich gesagt. Das"}, {"id": 621, "start": 7091.12, "end": 7099.44, "text": "müsste normalerweise funktionieren. In die Log steht auch nichts drin, dass es irgendwie nicht"}, {"id": 622, "start": 7099.44, "end": 7117.36, "text": "funktionieren würde. Ja gut funktioniert nicht, weiß nicht warum. Hab ich den Slash, muss ich den"}, {"id": 623, "start": 7117.36, "end": 7125.68, "text": "Slash am Anfang machen? Das kann sein dass man den, du hast recht vielleicht muss man den Slash"}, {"id": 624, "start": 7125.68, "end": 7136.54, "text": "nicht machen. Aber dann muss das Date Topic, das Date Topic müsste dann auch ohne Slash,"}, {"id": 625, "start": 7136.54, "end": 7151.48, "text": "also slashless sein quasi. Okay schauen wir mal. Kompost Champ jetzt muss es funktionieren."}, {"id": 626, "start": 7151.48, "end": 7158.76, "text": "Auf gib, gib Gas."}, {"id": 627, "start": 7158.76, "end": 7183.32, "text": "Okay er published, er published nicht."}, {"id": 628, "start": 7188.76, "end": 7198.04, "text": "Moment ich hab, ich bin ja subscribed auf mit dem Slash davor. Okay gucken wir mal im Home"}, {"id": 629, "start": 7198.04, "end": 7207.6, "text": "Assistant was der jetzt sagt. Nix. Der Wattchamp, da ist er. Hat funktioniert. Der Wattchamp ist"}, {"id": 630, "start": 7207.6, "end": 7215.24, "text": "am Start. Sensor Wattchamp vor 33 Sekunden. Also Datenübertragung funktioniert. So und jetzt muss"}, {"id": 631, "start": 7215.24, "end": 7221.96, "text": "ich gucken wie ich dort Daten reingeschrieben bekomme. Der Wattchamp. Okay dann das da wird"}, {"id": 632, "start": 7221.96, "end": 7232.28, "text": "nicht in die Loop Verlage, das machen wir einmalig am Anfang. Create Home Assistant Sensors if not"}, {"id": 633, "start": 7232.28, "end": 7242.76, "text": "already present. Wenn sie präsent sind passiert einfach nix. Der Wattchamp ja. Aber schön ist"}, {"id": 634, "start": 7242.76, "end": 7254.12, "text": "dieses String Literal Suntags auch nett oder? Könnt man es vielleicht doch so machen? So viel,"}, {"id": 635, "start": 7254.12, "end": 7259.08, "text": "jetzt mal ernsthaft so viel schöner ist es auch nett oder? Aber wir könnten es vielleicht so"}, {"id": 636, "start": 7259.08, "end": 7277.76, "text": "machen. Um ehrlich zu sein sagt es auch. Ich lasse, ich lasse es jetzt einfach so. Ich mein"}, {"id": 637, "start": 7277.76, "end": 7283.92, "text": "immerhin, immerhin besser. Also wir brauchen den, wir brauchen den Wattchamp Total Energy."}, {"id": 638, "start": 7283.92, "end": 7304.4, "text": "Wir brauchen den Wattchamp First Floor Energy. Ich mein wir könnten aus Total Energy minus"}, {"id": 639, "start": 7304.4, "end": 7311.72, "text": "First Floor Energy auch ausrechnen, was dann übrig bleibt, was das Erdgeschoss verbrauchen müsste."}, {"id": 640, "start": 7311.72, "end": 7333.64, "text": "Können wir auch machen. Also quasi Wattchamp irgendwie Ground Floor Energy. Ich hoffe ich"}, {"id": 641, "start": 7333.64, "end": 7341.84, "text": "hab nix vergessen. Gibt bestimmt komisches Pre-Processing Zeug, um Jason direkt im Code"}, {"id": 642, "start": 7341.84, "end": 7349.8, "text": "zu schreiben. Garantiert, garantiert. Wo sind jetzt die Gifted Subs für den Big Brain Chat?"}, {"id": 643, "start": 7349.8, "end": 7356.48, "text": "Ja wir brauchen noch mehr Subs, dass der Chat noch schlauer wird. Also Any Primers am Start."}, {"id": 644, "start": 7356.48, "end": 7362.08, "text": "Wenn ihr noch Prime übrig habt und euch das Stream gefällt. Der IQ muss Increased werden."}, {"id": 645, "start": 7362.08, "end": 7375.88, "text": "Weil ihr wisst ja jeder Sub ist IQ++ für den Chat. Auf gehts. Nice. Ami Levin Bro. Vier"}, {"id": 646, "start": 7375.88, "end": 7382.32, "text": "Monate dankeschön für den Sub. Rebuild King dankeschön für den Sub. Code Need Application."}, {"id": 647, "start": 7382.32, "end": 7397.4, "text": "Woodface. Das muss weg. Aber die Message ist überall anders. Ich mein ja ok das Topic"}, {"id": 648, "start": 7397.4, "end": 7406.36, "text": "und ne. Ich mein man kanns auch übertreiben oder. Mal schauen ob ich jetzt den Wattchamp."}, {"id": 649, "start": 7406.36, "end": 7412.68, "text": "Guck mal. First Floor Energy Wattchamp. Ground Floor Energy Wattchamp. Total Energy Wattchamp."}, {"id": 650, "start": 7412.68, "end": 7417.28, "text": "So das heißt ich kann jetzt schon mal. Wir löschen den ganzen Scheiß mal in meinem Dashboard."}, {"id": 651, "start": 7417.28, "end": 7431.28, "text": "Braucht keiner mehr. So. Add. Eine Gautsche. Wattchamp. Ist noch. Achso ich hab noch kein"}, {"id": 652, "start": 7431.28, "end": 7438.0, "text": "State gesetzt. Ok. Wie setz ich State. Oder Flashbang ist echt krass. Moment Leute ich"}, {"id": 653, "start": 7438.0, "end": 7449.28, "text": "muss den Flashbang mal kurz weg machen. Ich hab ich hab nix ich hab nix dagegen. Flashbang."}, {"id": 654, "start": 7449.28, "end": 7457.6, "text": "Second Payload. Das muss man jetzt machen. State. So und das müssen wir das nächste"}, {"id": 655, "start": 7457.6, "end": 7477.12, "text": "Mal in der Loop senden. Ok. Wahrscheinlich brauchen wir das gar nicht alles oder. Einfach"}, {"id": 656, "start": 7477.12, "end": 7480.8, "text": "nur einfach nur ein Stage. Ich glaub das brauchen wir gar nicht alles. Wir nehmen einfach nur"}, {"id": 657, "start": 7480.8, "end": 7490.36, "text": "das State Topic und Publishen das. Ok nehmen wir mal die drei Dinger. Niki das müsste"}, {"id": 658, "start": 7490.36, "end": 7502.52, "text": "standardmäßig gehen. Das geht. Du klickst hier oben drauf. Wählst aus was dein Maximum"}, {"id": 659, "start": 7502.52, "end": 7507.44, "text": "an Preis ist oder lässt es auf unendlich und dann benachrichtigt es sich immer. Und wenn"}, {"id": 660, "start": 7507.44, "end": 7513.92, "text": "du dann hier draufklickst und Notifications erlaubt erlaubst dann kriegst du ne ne also"}, {"id": 661, "start": 7513.92, "end": 7526.6, "text": "keine Pusht dann kriegst du so ne Android Notification. Auf deinem Phone. Android nicht"}, {"id": 662, "start": 7526.6, "end": 7537.12, "text": "auf dem iPhone ja ja ja. Nur auf Android auf iOS geht das nicht. Du musst ja Notifications"}, {"id": 663, "start": 7537.12, "end": 7546.32, "text": "erlauben. Windows Phone. Wenn wenn die die Notification App hier unterstützen geht das"}, {"id": 664, "start": 7546.32, "end": 7562.84, "text": "auch. Ja wenn Notifications nicht erlaubt sind dann geht es nicht. Aber das geht ich"}, {"id": 665, "start": 7562.84, "end": 7571.72, "text": "hab's auf meinem Android Tablet ausprobiert. Ok also wir brauchen jetzt State Topic. Moment"}, {"id": 666, "start": 7571.72, "end": 7576.56, "text": "das ist falsch was ich mir kopiert hab. State Topic. State also im Prinzip brauchen wir"}, {"id": 667, "start": 7576.56, "end": 7596.88, "text": "das da. State. State. Und jetzt wollen wir doch einfach nur"}, {"id": 668, "start": 7596.88, "end": 7608.52, "text": "in State übertragen. Copy Paste Champ na klar. Kann man da jetzt einfach nen Jason Wert schicken"}, {"id": 669, "start": 7608.52, "end": 7631.8, "text": "sowas. Probieren wir jetzt mal. So jetzt schickt er Null aber so funktionieren. Mindestens"}, {"id": 670, "start": 7631.8, "end": 7645.6, "text": "Value. Mal gucken. Ich mein Valid Jason müsste das sein oder? Wie schicken die das denn überhaupt"}, {"id": 671, "start": 7645.6, "end": 7655.64, "text": "in State? Hier Value Jason ne. Was das? Ne das ist Value Template das ist was anderes."}, {"id": 672, "start": 7655.64, "end": 7667.76, "text": "State Payload Temperature Humidity. Nö ich glaube das geht. Schauen wir mal. Ok ok er"}, {"id": 673, "start": 7667.76, "end": 7689.04, "text": "publish das schon mal. Ne du hast recht. Der Value den will ich nicht haben. Ah wartet"}, {"id": 674, "start": 7689.04, "end": 7698.04, "text": "mal vielleicht ist es viel einfacher. Vielleicht gar kein Jason vielleicht einfach nur Null."}, {"id": 675, "start": 7698.04, "end": 7706.2, "text": "Vielleicht einfach nur Null. Ich mein das ist ja ne Valid MQTT Message ne String mit"}, {"id": 676, "start": 7706.2, "end": 7724.0, "text": "Null. Da bin ich jetzt mal gespannt. So wenn das geflasht hat was sagt der übrigens"}, {"id": 677, "start": 7724.0, "end": 7736.84, "text": "ab in der History jetzt. Unknown Null. Ne das ist nicht numeric das mag er wahrscheinlich"}, {"id": 678, "start": 7736.84, "end": 7745.96, "text": "nicht. Ok auf. So gleich sollte es hoffentlich auf Null wechseln. Null. Exzellent. Kann"}, {"id": 679, "start": 7745.96, "end": 7758.2, "text": "ich jetzt mein nicest Dashboard machen? Wattchamp Total Energy da steht es schon. Bashen alter"}, {"id": 680, "start": 7758.2, "end": 7767.44, "text": "Bashen. So das ist Wattchamp Total Energy. Nehmen wir es mal. Gesamt Verbrauch. Exquisite"}, {"id": 681, "start": 7767.44, "end": 7780.04, "text": "deutsches Web Interface. Ich mein es ist Null und Maximum. Naja Maximum keine Ahnung. Wobei"}, {"id": 682, "start": 7780.04, "end": 7787.6, "text": "das ist ne dumme das ist ne dumme Anzeige für Gesamtverbrauch weil das wird ja immer mehr."}, {"id": 683, "start": 7787.6, "end": 7791.84, "text": "Das wird das wird ja immer ne. Das wird ja immer mehr das ist eigentlich eigentlich"}, {"id": 684, "start": 7791.84, "end": 7796.96, "text": "so ne. So ein Ding bescheuert weil es gibt ja nicht von wie viel. Was bietet sich denn"}, {"id": 685, "start": 7796.96, "end": 7807.36, "text": "da an? Haben die den Craft oder so? History Craft? Die hatten doch jetzt so ne neue Craft"}, {"id": 686, "start": 7807.36, "end": 7819.0, "text": "Card. Hab ich doch letztens gesehen die haben doch jetzt so ne neue Craft Card gehabt. Durch"}, {"id": 687, "start": 7819.0, "end": 7827.12, "text": "den so das kann man sich ja alles ausrechnen. Ok wir machen jetzt erstmal Wattchamp Total"}, {"id": 688, "start": 7827.12, "end": 7844.44, "text": "Energy. Gesamtverbrauch Null. Ok. Unit. Ok. Das wird schonmal funktionieren. Die hatten"}, {"id": 689, "start": 7844.44, "end": 7855.48, "text": "irgendwo nen Craft. Ich hab's genau gesehen. Sensor Card? Ja. Ach Sensor Card heißt das."}, {"id": 690, "start": 7855.48, "end": 7877.2, "text": "Klar. Was denn sonst? Sensor Card. Wattchamp Total Energy. Genau. Schau aus. Ok. Ok probieren"}, {"id": 691, "start": 7877.2, "end": 7882.08, "text": "wir das mal aus. Wir faken wir faken das jetzt einfach. Gesamtverbrauch. Wir faken das jetzt"}, {"id": 692, "start": 7882.08, "end": 7889.48, "text": "einfach. Gesamtverbrauch. Wir faken das jetzt einfach und rechnen das ein bisschen hoch."}, {"id": 693, "start": 7889.48, "end": 7912.92, "text": "Duplicate Card. Das ist Total. Das ist First Floor. Erster Stock. Duplicate Card. Erdgeschoss."}, {"id": 694, "start": 7912.92, "end": 7928.04, "text": "Schreib mal Erdgeschoss mit SS. Erdgeschoss. Ok. Ok. Nice. So und jetzt schreiben wir dann"}, {"id": 695, "start": 7928.04, "end": 7935.32, "text": "mal irgendwie random. Weil aktuell ist es ja nur Null. Aktuell ist es ja nur Null."}, {"id": 696, "start": 7935.32, "end": 7939.68, "text": "Aber dann wirst du jetzt natürlich was realistisches reinschreiben. Also was ist realistisch. Wie"}, {"id": 697, "start": 7939.68, "end": 7946.6, "text": "macht man random? C++. Random. Random please. Rant. Rant. Wobei das in Arduino glaube ich"}, {"id": 698, "start": 7946.6, "end": 7960.32, "text": "auch eingebaut. Rant. Rant. Gib Rant. Was macht das standardmäßig? In Rant? Zwischen?"}, {"id": 699, "start": 7960.32, "end": 7989.88, "text": "Rant Max. Was haben wir da sonst noch random? W math. Was? Ok ich hätte nicht gedacht"}, {"id": 700, "start": 7989.88, "end": 7996.44, "text": "dass es so kompliziert ist. Rant. Kann ich nicht einfach sagen random zwischen A und"}, {"id": 701, "start": 7996.44, "end": 8025.32, "text": "B? Arduino random. Ok random. Min Max. Ok passt doch. Random zwischen. Oops. Random zwischen"}, {"id": 702, "start": 8025.32, "end": 8039.72, "text": "A und B. Dann machen wir hier First. Plus gleich. Ok ne das machen wir mal standardmäßig"}, {"id": 703, "start": 8039.72, "end": 8055.24, "text": "ein bisschen kleiner. Ok. So und jetzt übertragen wir hier Total Energy. First Floor. Ah Moment."}, {"id": 704, "start": 8055.24, "end": 8062.04, "text": "Das funktioniert ja so nicht. Das möchte ja einen String und kein Int. Aber das können"}, {"id": 705, "start": 8062.04, "end": 8071.6, "text": "wir machen. Und jetzt rechnen wir Total Minus First Floor ergibt Erdgeschoss. Ok und jetzt"}, {"id": 706, "start": 8071.6, "end": 8077.28, "text": "überschreiben wir das hier einfach mal. Und lassen anstatt Message auch noch eine Int"}, {"id": 707, "start": 8077.28, "end": 8096.56, "text": "wenn man einfach eine Zahl übergeben will. Topic. Und jetzt Moment. Message. Keine Ahnung."}, {"id": 708, "start": 8096.56, "end": 8103.36, "text": "String. Einfach passen lassen als String. Ok nice. Upload. So und er sollte jetzt random"}, {"id": 709, "start": 8103.36, "end": 8111.04, "text": "so tun. Dann krieg ich aber nen Standard String. Ich brauch hier nen Arduino String."}, {"id": 710, "start": 8111.04, "end": 8123.24, "text": "So der sollte jetzt so tun als Mister irgendwas und das übertragen an den Home Assistant."}, {"id": 711, "start": 8123.24, "end": 8128.8, "text": "Hast du nicht drei Etagen? Ne ich hab nur zwei Stromzähler. Also einen wo die oberen"}, {"id": 712, "start": 8128.8, "end": 8134.0, "text": "Sachen angeschlossen sind und einen fürs Gesamte. Also kann ich quasi nur aus oben"}, {"id": 713, "start": 8134.0, "end": 8146.04, "text": "minus Gesamt vermuten dass der Rest Erdgeschoss ist. So 100 Pro ist es nicht. Ok. Er überträgt"}, {"id": 714, "start": 8146.04, "end": 8166.96, "text": "die Dinge. Das ist schon mal gut. Bam. Guckt euch das mal an. Exzellent. Ich mein es wäre"}, {"id": 715, "start": 8166.96, "end": 8176.8, "text": "ganz schön viel ganz schön schneller Verbrauch. Ganz schön teure Geschichte. Für was willst"}, {"id": 716, "start": 8176.8, "end": 8185.92, "text": "du das auslesen? Na daraus kann ich mir jetzt errechnen. Die Werte sind gerade random generiert."}, {"id": 717, "start": 8185.92, "end": 8193.96, "text": "Später kommen die von dem Sensor hier der da hängt. So daraus kann ich mir jetzt ja"}, {"id": 718, "start": 8193.96, "end": 8200.52, "text": "auch ausrechnen was aktueller Verbrauch ist. Indem ich einfach sag die letzten Messungen"}, {"id": 719, "start": 8200.52, "end": 8222.88, "text": "ein Tick ist so und so viel. Aber das ist schon mal nice. Guck mal hier das geht sogar."}, {"id": 720, "start": 8222.88, "end": 8227.24, "text": "Also wie gesagt die Werte sind gerade noch total fake aber man kriegt das zumindest"}, {"id": 721, "start": 8227.24, "end": 8240.84, "text": "schon mal rein das ist cool. Ich will das ausnehmen nachschauen wähle ich ab und zu"}, {"id": 722, "start": 8240.84, "end": 8245.44, "text": "trotzdem. Ich will einfach sehen was drauf steht wie viel ich verbraucht habe ohne in"}, {"id": 723, "start": 8245.44, "end": 8257.52, "text": "den Keller zu gehen und was aktuell gerade alles zieht. Das ist nett anzuschauen ja."}, {"id": 724, "start": 8257.52, "end": 8263.72, "text": "Warum geht das btw runter? Sollte das nicht hochgehen? Was könnte man sich jetzt da noch"}, {"id": 725, "start": 8263.72, "end": 8279.6, "text": "daraus ausrechnen? Also den aktuellen wie heißt das Leistung könnte ich mir noch ausrechnen"}, {"id": 726, "start": 8279.6, "end": 8288.92, "text": "also quasi geteilt durch Stunden. Geteilt durch Stunden geteilt durch 1000 dann kriege"}, {"id": 727, "start": 8288.92, "end": 8298.92, "text": "ich den Watt raus. Die Kosten oh das ist eine geile Idee. Das ist eine geile Idee. Das ist"}, {"id": 728, "start": 8298.92, "end": 8303.84, "text": "eine coole Idee. Wenn ich den Strompreis weiß kann ich ausrechnen was es gerade kostet"}, {"id": 729, "start": 8303.84, "end": 8315.16, "text": "am Tag und Prediction ja. Das ist eine coole Idee. Chat ich mag euch ihr seid big brain."}, {"id": 730, "start": 8315.16, "end": 8333.88, "text": "Bester Chat. Richtig gute Idee. Btw was sagt uns dieser Graf da unten eigentlich? Auf was"}, {"id": 731, "start": 8333.88, "end": 8361.72, "text": "kann man das noch tanken lassen? Na gut es geht halt hoch. Was ist das für eine Bescheide?"}, {"id": 732, "start": 8361.72, "end": 8373.16, "text": "Kann ich sagen 1? Ok jetzt gehts halt volle Pulle rauf ja. Ok ich könnte mir jetzt natürlich"}, {"id": 733, "start": 8373.16, "end": 8391.68, "text": "noch fake mäßig. Jetzt wirds mir zu exquisite. Also was ich jetzt machen könnte. Also das"}, {"id": 734, "start": 8391.68, "end": 8398.28, "text": "rechnet pro Sekunde gerade aus. Aber wir tun einfach mal so als wären das echte Sensor"}, {"id": 735, "start": 8398.28, "end": 8402.8, "text": "Werte. Es können ja gar keine echten Sensor Werte sein. Der Sensor hängt gerade auf meinem"}, {"id": 736, "start": 8402.8, "end": 8408.88, "text": "Basteltisch hier nebendran. Wie könnte ich denn jetzt. Wie errechne ich denn jetzt am"}, {"id": 737, "start": 8408.88, "end": 8416.88, "text": "besten die aktuelle Leistung in Watt. Also ich mein das hier ist der Wert in Kilowattstunden."}, {"id": 738, "start": 8416.88, "end": 8422.68, "text": "Das heißt das ist Kilowatt mal Stunde. Das bedeutet im Endeffekt ich muss das ganze"}, {"id": 739, "start": 8422.68, "end": 8430.0, "text": "teilen durch Stunde. Allerdings muss ich dazu wissen. Oh ne das wird zu big brain jetzt"}, {"id": 740, "start": 8430.0, "end": 8438.92, "text": "da kommt das macht man hier nicht mit. Ok aktuell ist es einfach. Aktuell ist es einfach. Aktuell"}, {"id": 741, "start": 8438.92, "end": 8445.76, "text": "ist es jede Sekunde. Aktuell ist es jede Sekunde. Das heißt ich müsste das jetzt nicht einfach."}, {"id": 742, "start": 8445.76, "end": 8460.0, "text": "Durch 6 durch ne was 3600 ja. Müsste ich das nicht einfach teilen durch 3600. Also in dem"}, {"id": 743, "start": 8460.0, "end": 8463.96, "text": "Fall ist es jetzt einfach weil es immer im Abstand von einer Sekunde kommt. In Wirklichkeit"}, {"id": 744, "start": 8463.96, "end": 8468.76, "text": "kommt es ja im Abstand von 2 Sekunden 5 Sekunden je nachdem wie gerade der Verbrauch ist. Also"}, {"id": 745, "start": 8468.76, "end": 8475.76, "text": "ich müsste mir nicht nur merken. Wann ich den Wert dass ich den Wert habe sondern ich"}, {"id": 746, "start": 8475.76, "end": 8481.8, "text": "müsste mir auch noch merken. Die die die die nen Timestamp. Und dann müsste ich sagen"}, {"id": 747, "start": 8481.8, "end": 8491.04, "text": "wir mal sagen die letzten 10 Timestamps. Rechne ich aus wie ne. Wisst ihr wie ich mein. Die"}, {"id": 748, "start": 8491.04, "end": 8498.2, "text": "letzten 10 Timestamps würde ich dann ausrechnen. Hoch auf ne Stunde. Und das würde dadurch"}, {"id": 749, "start": 8498.2, "end": 8506.8, "text": "teilen. Macht noch tüsslich was wie ein Tacho. Jaja das kann ich machen aber ich muss"}, {"id": 750, "start": 8506.8, "end": 8521.2, "text": "das erst mal ausrechnen. Ich meine die einfachste Variante wäre doch. Also nur mal von den Zeitmärkten"}, {"id": 751, "start": 8521.2, "end": 8535.44, "text": "wenn die Schleife losgeht dann. Aktueller Wert. Minus. Minus letzter Wert. Aber willst du"}, {"id": 752, "start": 8535.44, "end": 8548.04, "text": "das echt auf dem ESP machen. Warum nicht. Der langweilt sich ja. So aktuell. Ok also."}, {"id": 753, "start": 8548.04, "end": 8557.84, "text": "Letzte Zeit. Minus. Letzte. Zeit. Oder. Letzter. Timestamp. Dann rechne ich aktueller Wert"}, {"id": 754, "start": 8557.84, "end": 8565.64, "text": "minus letzter Wert. Muss die Intelligenz im ESP sein. Eigentlich nicht aber es ist doch"}, {"id": 755, "start": 8565.64, "end": 8570.12, "text": "nice. Dann muss ich in meinem Home Assistant configuration. Das wird einfach so eingeliefert"}, {"id": 756, "start": 8570.12, "end": 8578.6, "text": "und umgutes. Mal umgedreht was spricht denn dagegen das die Intelligenz im ESP ist. Warte"}, {"id": 757, "start": 8578.6, "end": 8583.84, "text": "mal hat Home Assistant nicht schon sowas eingebautes. Energy Sensor vielleicht können die das schon"}, {"id": 758, "start": 8583.84, "end": 8603.18, "text": "für mich machen. Aha. Ok dann mache ich das nicht im ESP dann kann man das anscheinend"}, {"id": 759, "start": 8603.18, "end": 8611.96, "text": "im Home Assistant direkt machen. Ah die haben schon was eingebaut was das macht für mich."}, {"id": 760, "start": 8611.96, "end": 8636.32, "text": "Ah yes. Ok das geht natürlich auch. Cycle. Daily. Weekly. Monthly. Yearly. Viertelstündlich."}, {"id": 761, "start": 8636.32, "end": 8646.4, "text": "Ok. Ok. Das probiere ich mal aus. Home Assistant. Addon. Ich brauchte Special Studio Addon da"}, {"id": 762, "start": 8646.4, "end": 8656.68, "text": "ich was editieren kann. Ja Nikki sowas in der Richtung dachte ich mir auch. Du hast"}, {"id": 763, "start": 8656.68, "end": 8666.32, "text": "es aber auf den Punkt gebracht. Aber ich probiere das jetzt mal aus in Home Assistant auszurechnen."}, {"id": 764, "start": 8666.32, "end": 8679.96, "text": "Das klingt mir erstmal tatsächlich sogar sinnvoller. Ne der Flash nutzt sich nicht ab ich mein"}, {"id": 765, "start": 8679.96, "end": 8686.12, "text": "ich muss eh den letzten Wert immer speichern. Dass ich es recovern kann. Oder aber ich übertrag"}, {"id": 766, "start": 8686.12, "end": 8693.92, "text": "einfach nur immer den letzten Tick. Ich übertrag einfach immer nur den letzten Tick mit Timestamp"}, {"id": 767, "start": 8693.92, "end": 8704.92, "text": "und der Home Assistant rechnet. Muss ich mir mal überlegen was was sinnvoller ist. Aber"}, {"id": 768, "start": 8704.92, "end": 8728.04, "text": "ich probiere das jetzt mal hier mit aus. Configuration. Show inside bar. Jawoll. Oh White Seam. Oh Hilfe"}, {"id": 769, "start": 8728.04, "end": 8741.4, "text": "Hilfe. Oh jetzt jetzt jetzt jetzt jetzt. Anstrengend. Knapp. Knapp. Flashbängt. Also was brauche"}, {"id": 770, "start": 8741.4, "end": 8755.08, "text": "ich? Source. So wie heißt mein Energy? Wie ist das? Sensor Wattchamp Total Energy."}, {"id": 771, "start": 8755.08, "end": 8770.76, "text": "Sensor Wattchamp Total Energy Source. Monthly. Nein ein Viertel stündlich. Wo habe ich"}, {"id": 772, "start": 8770.76, "end": 8793.64, "text": "den jetzt gefunden? Ach komm mal mal stündlich. Check config. Gültig. Restart. Brüchelst du"}, {"id": 773, "start": 8793.64, "end": 8798.12, "text": "die Code im Browser. Das schöne ist du hast dann alles in deinem Home Assistant drin und"}, {"id": 774, "start": 8798.12, "end": 8802.72, "text": "musst dann nicht irgendwelche externen Tools nehmen. So Utility Meter gibt es da für eine"}, {"id": 775, "start": 8802.72, "end": 8825.88, "text": "Karte. Cards. Aber man kann sogar man kann sogar Verbrauch Kosten direkt ausrechnen lassen"}, {"id": 776, "start": 8825.88, "end": 8834.16, "text": "oder so. Okay. Okay das heißt ich habe jetzt habe ich jetzt hier einen Utility Meter drin."}, {"id": 777, "start": 8834.16, "end": 8843.2, "text": "Wie das Code ist ein Browser. Da wird man ja eigentlich oft genug dran erinnert. Also"}, {"id": 778, "start": 8843.2, "end": 8862.76, "text": "das ganze Look in Field schreit halt irgendwie Browser. Wo ist der Sensor? Ah. Nee das hier"}, {"id": 779, "start": 8862.76, "end": 8870.44, "text": "ist. Ah guckt mal wenn ich den Home Assistant neu starte dann ist das Anlegen der Sensoren"}, {"id": 780, "start": 8870.44, "end": 8886.52, "text": "gar nicht dabei. Das heißt das muss ich auch in der Schleife machen. Sonst ist es danach"}, {"id": 781, "start": 8886.52, "end": 8900.12, "text": "weg. Da muss immer wieder die Sensoren pro Schleife neu anlegen. Weil ansonsten sind"}, {"id": 782, "start": 8900.12, "end": 8905.44, "text": "die Dinger nach dem Home Assistant Restart fort. Okay es ist aktuell Null. Logisch."}, {"id": 783, "start": 8905.44, "end": 8913.44, "text": "Weil Sensor Wattchamp überhaupt nicht existiert. Aber gleich wird Sensor Wattchamp wieder angelegt."}, {"id": 784, "start": 8913.44, "end": 8923.0, "text": "Und zwar. Ja C. Arduino ist halt C++. Das ESP EDF ist reines C. Aber da muss man sehr"}, {"id": 785, "start": 8923.0, "end": 8952.16, "text": "viel selbst machen. Okay Sensor Energy. Friendly Name Energy. Holy. Okay. Okay. Okay. Okay."}, {"id": 786, "start": 8952.16, "end": 8955.44, "text": "So und was genau macht das Ding jetzt?"}, {"id": 787, "start": 8982.16, "end": 9000.4, "text": "Äh. Hä? Okay das check ich. Alter die Flashbang-Seite. Für was ist das jetzt genau da? Den Sinn"}, {"id": 788, "start": 9000.4, "end": 9010.08, "text": "verstehe ich nicht. Das berechnet den stündlichen Verbrauch? Vielleicht? Keine Ahnung wenn ich"}, {"id": 789, "start": 9010.08, "end": 9036.68, "text": "ehrlich bin. Den Sinn erschließt sich mir gerade nicht so wirklich. Okay das. Das check"}, {"id": 790, "start": 9036.68, "end": 9055.48, "text": "ich nicht. Ja ich hab meine Pizza noch am Start. Okay da verstehe ich nicht so genau was der Sinn"}, {"id": 791, "start": 9055.48, "end": 9062.28, "text": "davon ist jetzt ehrlich gesagt. Wahrscheinlich der resetet sich pro Stunde dann immer wieder."}, {"id": 792, "start": 9062.28, "end": 9071.84, "text": "Oder der lernt das jetzt und zeigt dann den Durchschnittsverbrauch pro Stunde an. Also ich"}, {"id": 793, "start": 9071.84, "end": 9077.04, "text": "kann mir dann quasi irgendwann einen Craft angucken. Mit Durchschnittsverbrauch pro Stunde"}, {"id": 794, "start": 9077.04, "end": 9082.84, "text": "oder sowas. Ach hier last reset collecting. Wahrscheinlich zeigt er mir das dann pro Stunde"}, {"id": 795, "start": 9082.84, "end": 9094.96, "text": "verteilt irgendwie an. Pizza Pepperoni Wurst. Find ich meine Anzeige viel geiler. Ganz schön"}, {"id": 796, "start": 9094.96, "end": 9103.56, "text": "teurer Spaß gerade. Ich war das Ding verbraucht pro Sekunde. Also randomize zwischen einem und"}, {"id": 797, "start": 9103.56, "end": 9116.04, "text": "dreihundert. Ne zwischen zwei und 350 Kilowattstunden pro Sekunde. Es ist vielleicht doch ein bisschen"}, {"id": 798, "start": 9116.04, "end": 9122.08, "text": "unrealistisch was mein random gerade da macht aber. Gut vielleicht hab ich meinen Keller"}, {"id": 799, "start": 9122.08, "end": 9149.92, "text": "voller Miner. Weiß man es dann. Was was ist denn diese Tarif Geschichte. Oder Tarif."}, {"id": 800, "start": 9149.92, "end": 9172.68, "text": "Ach so. Ok ein Beispiel wäre da schon mal irgendwie sinnvoll. Peak off. Ach so ok das"}, {"id": 801, "start": 9172.68, "end": 9187.44, "text": "Ding zählt und resetet sich dann automatisch wieder. Das heißt er zeigt mir an ob welchen"}, {"id": 802, "start": 9187.44, "end": 9204.76, "text": "Tarif ich gerade verwende. Aber da rechnen für mich nix aus. Was ist denn die DSM. Was"}, {"id": 803, "start": 9204.76, "end": 9230.48, "text": "ist was was holländisches. Ach man kann mehrere Sachen zählen oder wie."}, {"id": 804, "start": 9230.48, "end": 9246.04, "text": "Ok aber das erschließt sich immer noch nicht so immer noch sich so genau ich mein. Ok"}, {"id": 805, "start": 9246.04, "end": 9250.04, "text": "was man damit machen kann ist halt man hat eine schöne Statistik wie viel man im Monat"}, {"id": 806, "start": 9250.04, "end": 9263.12, "text": "verbraucht hat. Ok meinetwegen. Wie kann man denn Home Assistant Persist MQTT Sensor."}, {"id": 807, "start": 9263.12, "end": 9273.36, "text": "Ich weiß wie ich die Persisten kann die MQTT Sensoren. Ich muss einfach nur sagen hier"}, {"id": 808, "start": 9273.36, "end": 9280.72, "text": "dass der die im MQTT Server speichern soll die Messages hier ich muss ihm sagen. Retain"}, {"id": 809, "start": 9280.72, "end": 9292.4, "text": "eins. Dann speichert er sich immer nehme ich immer die letzte Message und das überlebt"}, {"id": 810, "start": 9292.4, "end": 9300.64, "text": "den Neustart. Das probiere ich jetzt mal aus ob das klappt. Weil ansonsten sind die nach"}, {"id": 811, "start": 9300.64, "end": 9311.4, "text": "dem Neustart immer weg. Und dann gehe ich meine Pizza essen Leute. Aber die Idee dass"}, {"id": 812, "start": 9311.4, "end": 9332.76, "text": "man das man noch die Kosten anzeigen kann finde ich echt nice. Publisher noch. Er Publisher"}, {"id": 813, "start": 9332.76, "end": 9339.72, "text": "noch. Und ihr seht er hat sich die Werte gespeichert vom letzten Mal. So und jetzt"}, {"id": 814, "start": 9339.72, "end": 9347.88, "text": "Restart ich mal Home Assistant und gucke ob der Kram dann da bleibt. Server. Restart."}, {"id": 815, "start": 9347.88, "end": 9357.48, "text": "By the way normalerweise habe ich das Hessisches H-Addon. Und ich mache zu mir Commando Zeit."}, {"id": 816, "start": 9357.48, "end": 9368.52, "text": "Zu hell. Zu hell. Ist er wieder da? Nice. Ok guck mal jetzt hat er sich es gemerkt."}, {"id": 817, "start": 9368.52, "end": 9393.04, "text": "Alles klar ok. Ja im Grafana Welt kann ich es auch anzeigen. Aber so eine Übersicht Grafana"}, {"id": 818, "start": 9393.04, "end": 9397.56, "text": "anzeigen ist bei mir easy weil ich habe einfach die Prometheus die Prometheus Integration"}, {"id": 819, "start": 9397.56, "end": 9401.72, "text": "bei Home Assistant an. Da kann ich direkt die Sachen da auslesen. Beispielsweise für"}, {"id": 820, "start": 9401.72, "end": 9426.92, "text": "Batteriestand guck mal. Dashboards. Guck da sehe ich den Batteriestand von meinen Fenstersensor"}, {"id": 821, "start": 9426.92, "end": 9436.8, "text": "und Dingern. Die sind fast alle voll außer der Eingangstürsensor der ist bei 27% fast"}, {"id": 822, "start": 9436.8, "end": 9445.68, "text": "leer. Ich guck mal ob ich im nächsten Stream mein Home Assistant zeigen kann. In der Hoffnung"}, {"id": 823, "start": 9445.68, "end": 9462.78, "text": "vielleicht nicht zu viel Leake. Ja aber das finde ich nice hier. Das hat was. Das kannst"}, {"id": 824, "start": 9462.78, "end": 9466.28, "text": "du machen. Ich finde es aber schöner die Sensoren ins Home Assistant zu schreiben"}, {"id": 825, "start": 9466.28, "end": 9470.8, "text": "und die aus dem Grafana auszulesen als nochmal eine extra Datenbank parallel zu haben. Aber"}, {"id": 826, "start": 9470.8, "end": 9490.04, "text": "gibt es verschiedene Ansätze. Ok ich weiß nicht ob ich das ausrechnen jetzt noch machen"}, {"id": 827, "start": 9490.04, "end": 9496.4, "text": "will. Aber nur mal so von der Idee her chat. Wenn ich jetzt ausrechnen will. Wie viel Leistung"}, {"id": 828, "start": 9496.4, "end": 9502.6, "text": "ich gerade brauche. Dann könnte ich doch so was machen. Nur mal von der Idee her. Sagt"}, {"id": 829, "start": 9502.6, "end": 9510.16, "text": "mir mal ob ich falsch lege. Ich speicher mir hier quasi. Keine Ahnung. Long oder was ist"}, {"id": 830, "start": 9510.16, "end": 9533.44, "text": "Millis. Unsigned long. Keine Ahnung. Last. Und jetzt würde ich dann sagen aktuelle Zeit"}, {"id": 831, "start": 9533.44, "end": 9541.0, "text": "minus letzte Zeit. Das sind dann quasi die Millisekunden die es zwischen zwei Messvorgängen"}, {"id": 832, "start": 9541.0, "end": 9548.04, "text": "gebraucht hat. Weil das ist so sehr über den Daumen gepeilt dann. Ich müsste das eigentlich"}, {"id": 833, "start": 9548.04, "end": 9554.84, "text": "schon samplen über die letzten 10 Messvorgänge oder so dass es ungefähr genau ist. Mal gucken."}, {"id": 834, "start": 9554.84, "end": 9563.32, "text": "Also das sind die Millisekunden. So und jetzt müsste ich die Millisekunden hochrechnen auf"}, {"id": 835, "start": 9563.32, "end": 9589.76, "text": "eine Stunde oder. Also quasi. Oh nee Moment jetzt ist mein Brain. Das ist jetzt ist mein"}, {"id": 836, "start": 9589.76, "end": 9601.36, "text": "Genie. So das ist das letzte. So und das ist der aktuelle Wert. Das ist der aktuelle ich"}, {"id": 837, "start": 9601.36, "end": 9621.52, "text": "das ist der aktuelle Wert. So das heißt. Das heißt dass der. Das heißt dass der aktuelle"}, {"id": 838, "start": 9621.52, "end": 9632.76, "text": "Wert minus der letzte Wert. Wobei nee. Moment es ergibt keinen Sinn es ergibt keinen Sinn"}, {"id": 839, "start": 9632.76, "end": 9638.84, "text": "es ergibt keinen Sinn. Das hier ist immer gleich. Das das ergibt nämlich keinen Sinn"}, {"id": 840, "start": 9638.84, "end": 9644.48, "text": "was ich hier mache. Der gemessene Wert pro Tick ist immer gleich bei den echten Sensoren."}, {"id": 841, "start": 9644.48, "end": 9654.56, "text": "Also bei diesen Zählern ist es immer ist es immer gleich. Also sprich. Eine Umdrehung"}, {"id": 842, "start": 9654.56, "end": 9662.88, "text": "ist immer gleich viel. Und ein Plinken ist auch immer gleich viel. Die Dauer macht es"}, {"id": 843, "start": 9662.88, "end": 9666.56, "text": "aus. Also das was ich hier mit dem random mache ergibt eigentlich überhaupt keinen"}, {"id": 844, "start": 9666.56, "end": 9671.2, "text": "Sinn. Ich will eigentlich nicht. Das kann ich das kann ich mir das kann ich mir eigentlich"}, {"id": 845, "start": 9671.2, "end": 9675.76, "text": "komplett sparen. Das kann ich mir komplett sparen. Es ist nicht random. Ich sag mal ich"}, {"id": 846, "start": 9675.76, "end": 9680.6, "text": "sag jetzt einfach mal es sind immer es sind in dem Fall immer plus zwei. Und in dem Fall"}, {"id": 847, "start": 9680.6, "end": 9684.84, "text": "hier halt keine Ahnung plus eins ist egal. So weil so ist das bei dem echten bei dem"}, {"id": 848, "start": 9684.84, "end": 9692.76, "text": "echten Meter ja auch. Es ist immer der gleiche Wert wenn es wenn es hoch zählt. So aber"}, {"id": 849, "start": 9692.76, "end": 9697.96, "text": "die Zeit. So ich weiß jetzt wie lange es zwischen zwei Ticks gedauert hat. Nämlich"}, {"id": 850, "start": 9697.96, "end": 9715.44, "text": "aktuelle Zeit minus letzte Zeit in Millisekunden. Und jetzt kann ich doch. Warte mal was ist"}, {"id": 851, "start": 9715.44, "end": 9727.04, "text": "denn jetzt wenn ich. Ich bin. Muss ich das jetzt auf 3600 rechnen. Aber dass der Gesamt"}, {"id": 852, "start": 9727.04, "end": 9734.68, "text": "Verbrauch das bringt mir nichts. Ich muss den. Okay es sind immer zwei. Es ist immer"}, {"id": 853, "start": 9734.68, "end": 9743.96, "text": "zwei. Kein Ticks ist gegen zwei. So. Das sind jetzt zwei. Was auch immer. Da haben wir"}, {"id": 854, "start": 9743.96, "end": 9749.56, "text": "mal zum Beispiel. Das wäre jetzt. Was es eigentlich keinen Sinn ergibt weil es ist"}, {"id": 855, "start": 9749.56, "end": 9754.44, "text": "eher. Es geht eher in Richtung null Komma irgendwas. Also sagen wir mal so wir lassen"}, {"id": 856, "start": 9754.44, "end": 9769.04, "text": "mal das mit dem. Das kann ich mir aus ausdenken. So und und. Das da muss ich jetzt in Stunde"}, {"id": 857, "start": 9769.04, "end": 9793.92, "text": "umrechnen. Also sprich. Millisekunde. Geteilt. Doch. Nö. Warte mal tau. Ah. Pick Brain."}, {"id": 858, "start": 9793.92, "end": 9803.96, "text": "Slow Brain eher. Eher. Oye. Oye Brain. Alter. Also sprich. Das was da drin steht sind so"}, {"id": 859, "start": 9803.96, "end": 9812.32, "text": "und so viele Stunden. Durch tausend. Warte mal. Also 20. 20 Millisekunden durch tausend"}, {"id": 860, "start": 9812.32, "end": 9828.04, "text": "0 Komma 0 2 Sekunden. Das kommt doch hin oder. Ja. Doch. Durch tausend 0 Komma 0 2 Sekunden."}, {"id": 861, "start": 9828.04, "end": 9847.48, "text": "Ok. Durch. 60. Sind Minuten. Gibt das irgendwie Sinn. Durch 60 sind Minuten. Und nochmal"}, {"id": 862, "start": 9847.48, "end": 9865.72, "text": "durch und nochmal durch 60 sind Stunden. Oder. Also im Prinzip. So. Aber das haben wir als"}, {"id": 863, "start": 9865.72, "end": 9882.36, "text": "Float. F Float. Kann das kann das. Kann ich das so machen. Papiert er das dann. Ok das"}, {"id": 864, "start": 9882.36, "end": 9889.76, "text": "müsste doch eigentlich so stimmen oder. Und jetzt sind das. Jetzt ist das quasi. Die Millisekunden"}, {"id": 865, "start": 9889.76, "end": 9897.72, "text": "in einer Stunde. Nee. Wisst ihr was viel besser ist. Nee nee nee. Wisst ihr was viel"}, {"id": 866, "start": 9897.72, "end": 9904.76, "text": "besser ist. Ich rechne nicht die Millisekunden in Stunden um. Ich rechne die Ticks in Millisekunden"}, {"id": 867, "start": 9904.76, "end": 9920.84, "text": "um. Dann ist es viel genauer. Glaub ich zumindest. Quickmaps. Also quasi. Also quasi Ticks. Also"}, {"id": 868, "start": 9920.84, "end": 9927.64, "text": "keine Ahnung. Also ich rechne das jetzt quasi um in Watt Millisekunden. Gibt es diese Einheit"}, {"id": 869, "start": 9927.64, "end": 9949.68, "text": "überhaupt. Alter. Gibt es Watt Millisekunden. Auto. Ich weiß nicht genauer. Also. Das ist"}, {"id": 870, "start": 9949.68, "end": 9957.32, "text": "jetzt pro Stunde. Das heißt das rechne ich jetzt auch durch 1000. Ich mache doch im Prinzip"}, {"id": 871, "start": 9957.32, "end": 9977.04, "text": "genau das gleiche wie hier oder. So. Das sind. Das sind. Watt mal Millisekunden. Also Watt"}, {"id": 872, "start": 9977.04, "end": 9983.4, "text": "Millisekunden. Wie viel Thread kann das Teil 2. Also du kannst beliebig viele machen aber"}, {"id": 873, "start": 9983.4, "end": 9996.48, "text": "2 2 beliebig viele weiß ich nicht. Wahrscheinlich 128 oder so. Aber. Was soll ich jetzt sagen."}, {"id": 874, "start": 9996.48, "end": 10008.64, "text": "Du kannst nur 2 Stück gleichzeitig ausführen. So. Genau. Watt Millisekunden sind das dann."}, {"id": 875, "start": 10008.64, "end": 10016.64, "text": "Und jetzt. Alla mein. Mein. Mein. Current ist zu. Ok. Das sind. Millisekunden. Das heißt"}, {"id": 876, "start": 10016.64, "end": 10025.16, "text": "wenn ich jetzt weiß. Das war zwischen dem aktuellen Tick und dem letzten Tick. So."}, {"id": 877, "start": 10025.16, "end": 10037.8, "text": "Aktuellen Tick und im letzten Tick. Habe ich. So viel. Millisekunden verbraucht. Und das"}, {"id": 878, "start": 10037.8, "end": 10045.32, "text": "Teile ich jetzt durch die Millisekunden hier oben nochmal, weil dann bin ich bei wat übrig"}, {"id": 879, "start": 10045.32, "end": 10046.32, "text": "oder?"}, {"id": 880, "start": 10046.32, "end": 10057.28, "text": "Denn wenn ich das jetzt teile durch die Millisekunden, dann habe ich eigentlich das raus, die aktuelle"}, {"id": 881, "start": 10057.28, "end": 10058.28, "text": "Leistung oder?"}, {"id": 882, "start": 10058.28, "end": 10059.28, "text": "Oder?"}, {"id": 883, "start": 10059.28, "end": 10077.32, "text": "Gibt das Sinn?"}, {"id": 884, "start": 10077.32, "end": 10081.2, "text": "Okay das müsste jetzt immer konstant sein, weil es immer pro Sekunde ist der Tick."}, {"id": 885, "start": 10081.2, "end": 10085.88, "text": "Wir machen das jetzt mal anders, wir machen das jetzt mal anders, wir machen das random,"}, {"id": 886, "start": 10085.88, "end": 10096.44, "text": "das random machen wir in das Delay und zwar zwischen einer Sekunde und 15 Sekunden."}, {"id": 887, "start": 10096.44, "end": 10113.8, "text": "So, weil jetzt müsste das anders sein und last muss ich da noch setzen, last muss ich"}, {"id": 888, "start": 10113.8, "end": 10126.72, "text": "noch setzen hier nach, also wollen wir so now, boah exquisite, exquisite shit, so now, beim"}, {"id": 889, "start": 10126.72, "end": 10131.32, "text": "ersten Mal stimmt es halt nicht, aber gut egal, was ist dein Lieblingsemote?"}, {"id": 890, "start": 10131.32, "end": 10146.12, "text": "Und jetzt muss ich last setzen auf, für den nächsten Durchgang, für den nächsten Durchgang."}, {"id": 891, "start": 10146.12, "end": 10167.52, "text": "Okay, Print, MS, 7 bang, danke schön für den Zapp, ich mein 2000 Kilowatt pro Tick ist"}, {"id": 892, "start": 10167.52, "end": 10171.88, "text": "halt vielleicht ein bisschen, 2 Kilowatt pro Tick ist vielleicht ein bisschen viel."}, {"id": 893, "start": 10171.88, "end": 10182.52, "text": "Ich glaube die Zähler ticken alle 0,8 Watt, Wattstunde, aber wir können aber gucken,"}, {"id": 894, "start": 10182.52, "end": 10201.84, "text": "ob da jetzt was sinnvolles rauskommt, Upload, ähm, Zähler, LED, warte mal hier steht"}, {"id": 895, "start": 10201.84, "end": 10217.52, "text": "es doch immer drauf, guck mal, hier 75 Umdrehungen pro Kilowattstunde und hier Impuls, 1000 Impulse"}, {"id": 896, "start": 10217.52, "end": 10238.24, "text": "pro Kilowattstunde macht der hier, äh, äh, wie die Daten abgerufen werden über 2 Sensoren,"}, {"id": 897, "start": 10238.24, "end": 10246.28, "text": "guck mal, also ich zeig sie mal an dem Bild, das ist besser, hier einmal per Infrarot-LED"}, {"id": 898, "start": 10246.28, "end": 10254.16, "text": "und hier per äh, Lichtsensor, also sprich, die LED auslesen kann man, kann man damit,"}, {"id": 899, "start": 10254.16, "end": 10260.36, "text": "du siehst ja auch wenn ich die, das Ding ist lichtempfindlich hier vorne, wenn ich das"}, {"id": 900, "start": 10260.36, "end": 10265.32, "text": "zu halte geht das Licht aus und es zählt ja auch ein bisschen hoch dann, allerdings backt"}, {"id": 901, "start": 10265.32, "end": 10274.04, "text": "es gerade rum, weil ich so auch hoch zähle, äh, ich zähle auch so hoch, das kommt sich"}, {"id": 902, "start": 10274.04, "end": 10284.12, "text": "gerade ein bisschen in die Quere und, ähm, für den Oldschool-Zähler, wo hab ichs hin"}, {"id": 903, "start": 10284.12, "end": 10291.56, "text": "Leute, hier das da, das da verwende ich für den, für den Oldschool-Zähler, das macht"}, {"id": 904, "start": 10291.56, "end": 10300.24, "text": "folgendes, das ist Infrarot-LED und ein Empfänger und der erkennt, wie viel Licht einfällt"}, {"id": 905, "start": 10300.24, "end": 10309.4, "text": "und bei diesen alten Sensoren ist es halt so, wenn die Scheibe normal ist oder rot ist,"}, {"id": 906, "start": 10309.4, "end": 10313.96, "text": "dann reflektiert das unterschiedlich viel von dieser Infrarot-LED zurück und handdessen"}, {"id": 907, "start": 10313.96, "end": 10317.72, "text": "kann ich erkennen, ob gerade das rote Ding durchläuft oder nicht."}, {"id": 908, "start": 10317.72, "end": 10328.68, "text": "Also die Infrarot-LED leucht drauf, der Empfänger empfängt das und anhand der Menge, ich bin"}, {"id": 909, "start": 10328.68, "end": 10333.24, "text": "mir jetzt nicht sicher, ich vermute mal, dass das, ähm, silberne mehr reflektiert als das"}, {"id": 910, "start": 10333.24, "end": 10337.52, "text": "rote, anhand dessen kann ich jetzt auslesen."}, {"id": 911, "start": 10337.52, "end": 10356.08, "text": "Ok Leute, also unsere Rechnung funktioniert nicht, das erste klappt, also sprich das da"}, {"id": 912, "start": 10356.08, "end": 10371.96, "text": "funktioniert, aber das funktioniert nicht, warum nicht, ah, aber warum sind die null,"}, {"id": 913, "start": 10371.96, "end": 10382.48, "text": "die sollten nicht null sein, die sollten nicht null sein, ist das ein Int, Moment, ist das"}, {"id": 914, "start": 10382.48, "end": 10398.6, "text": "ein Int, nee, 2000 durch 1000, durch 60, das ist doch nicht null, ah, Moment, das ist null,"}, {"id": 915, "start": 10398.6, "end": 10414.08, "text": "komm mal, aber rundet der das irgendwie, das kann, wie ging der Scheiß nochmal, wie konnte"}, {"id": 916, "start": 10414.08, "end": 10421.68, "text": "man ihm das nochmal sagen, ich will das als Float machen, war das nicht mit F, uuh, warte"}, {"id": 917, "start": 10421.68, "end": 10445.36, "text": "mal, ich hab das hier oben doch verwendet, nee, ah, uuh geht, L für long vielleicht,"}, {"id": 918, "start": 10445.36, "end": 10456.84, "text": "das muss ich doch bestimmt nicht, bestimmt nicht so machen, oder, normalerweise reicht,"}, {"id": 919, "start": 10456.84, "end": 10464.84, "text": "wenn eins davon ein Float ist, dass er das, dass er das als, als, äh, Komma stellt berechnet,"}, {"id": 920, "start": 10464.84, "end": 10473.76, "text": "vielleicht ist auch einfach nur das Printline zu dumm, ah, Moment, Moment, Moment, Float,"}, {"id": 921, "start": 10473.76, "end": 10480.72, "text": "Float durch den unsigned long, es sollte doch eigentlich in der Lage sein, wisst ihr was,"}, {"id": 922, "start": 10480.72, "end": 10493.4, "text": "wir casten das jetzt nochmal, man weiß ja nie, Upload, da muss jetzt irgendwas rauskommen,"}, {"id": 923, "start": 10493.4, "end": 10519.36, "text": "das garantiert nicht null, er bootet, exquisite booten, bringt so schön, nice, dass so viele"}, {"id": 924, "start": 10519.36, "end": 10536.52, "text": "bei so niche Dingern auch mit am Start sind, null, wo ist das Problem, warum ist das null,"}, {"id": 925, "start": 10536.52, "end": 10552.96, "text": "das ergibt doch keinen Sinn, ja 0,0, rundet das irgendwie, so wir stringformaten das,"}, {"id": 926, "start": 10552.96, "end": 10569.56, "text": "würde das irgendwie, das wäre aber ganz schön fail, wir nehmen die FMT Library, die sollte"}, {"id": 927, "start": 10569.56, "end": 10584.04, "text": "das besser hinkriegen, gehen wir jetzt einfach, wir lassen das FMT formatieren und dann, so"}, {"id": 928, "start": 10584.04, "end": 10603.8, "text": "mal gucken, ah, da kommen wir der Sache schon näher, 0,005557, by the way, eigentlich kann"}, {"id": 929, "start": 10603.8, "end": 10609.32, "text": "ich das einmalig ausrechnen und immer, immer wieder verwenden, oder, das ändert sich ja"}, {"id": 930, "start": 10609.32, "end": 10614.36, "text": "nicht, weil ich guck mal, bei dem, bei dem Tick hier, nennen wir mal das Ding, würden"}, {"id": 931, "start": 10614.36, "end": 10631.4, "text": "wir mal theoretisch den da nehmen, ne, der hat pro Tick, ne was, 10.000 Impulse pro Kilowattstunde,"}, {"id": 932, "start": 10631.4, "end": 10641.52, "text": "das heißt 10 Impulse pro Wattstunde, Moment, sind das, sind das, sind das dann 10 Impulse"}, {"id": 933, "start": 10641.52, "end": 10659.88, "text": "pro Wattstunde, oder, weil ich mein durch 1000 und hinten durch 1000, 10 Impulse pro"}, {"id": 934, "start": 10659.88, "end": 10674.76, "text": "Wattstunde, das heißt dann was, ein Impuls pro 0,1 Wattstunde, ne, einfach Komma verschieben,"}, {"id": 935, "start": 10674.76, "end": 10698.56, "text": "oder, also sprich, pro Tick sind es 0,1, 0,1 Wattstunde, ne, ist das eigentlich richtig"}, {"id": 936, "start": 10698.56, "end": 10715.12, "text": "so, also das sind dann 100, sind das 100 milli Wattstunde, ok, jetzt kommen, jetzt kommen"}, {"id": 937, "start": 10715.12, "end": 10720.0, "text": "deutlich realistischere Bereiche, würde ich sagen, so nicht, als hätte ich meinen Keller"}, {"id": 938, "start": 10720.0, "end": 10743.88, "text": "voller Miner, also wahrscheinlich sind das dann hier, ne und, wow, wow, wow, wow, wow,"}, {"id": 939, "start": 10743.88, "end": 10771.24, "text": "wow, ok, 2,77, 2,77 kann ich rechnen, oder, ich mein, das ist jetzt 2,778 und irgendwie"}, {"id": 940, "start": 10771.24, "end": 10788.12, "text": "noch dann 8, 8 Nullen oder so, ne, Moment, was heißt das in dem Fall, hoch, ne, hoch"}, {"id": 941, "start": 10788.12, "end": 10807.72, "text": "minus 0,8 sind das, 2,77 hoch minus 8, ne, also Nullen vorne dran, oder, ey, warum kann"}, {"id": 942, "start": 10807.72, "end": 10815.0, "text": "es der Google Calculator nicht, warum, warum eigentlich 0,8, warum nicht einfach nur hoch"}, {"id": 943, "start": 10815.0, "end": 10841.16, "text": "minus 8, also 0,, habe ich jetzt richtig gerechnet, 0,00028211081 Wattmillisekunden, alles klar,"}, {"id": 944, "start": 10841.16, "end": 10850.36, "text": "meine Fresse, was Zeug, da kann ich mir den Kram sparen hier oben und, das muss ich jetzt"}, {"id": 945, "start": 10850.36, "end": 10859.08, "text": "sein lassen, das muss ich jetzt da lassen, ok, nein, habe ich was falsch gemacht, ah,"}, {"id": 946, "start": 10859.08, "end": 10882.04, "text": "nicht hoch, sondern minus, mal 10, ach ja, ja, ja, ja, genau, genau, mal 10 hoch minus"}, {"id": 947, "start": 10882.04, "end": 10899.64, "text": "8, ja, ich weiß, ich will wissen, was das für eine Zahl ist, Alter, so, wir machen"}, {"id": 948, "start": 10899.64, "end": 10912.76, "text": "das jetzt mit der Quickmaps-Suchmaschine, Alter, so, so, siehst du, so ist das gut,"}, {"id": 949, "start": 10912.76, "end": 10923.24, "text": "hallo, copy, paste, Kleintext, nice, ok, bei mir war das einfach um 1000 Nuller verkehrt,"}, {"id": 950, "start": 10923.24, "end": 10933.08, "text": "ja, Moment, passt das überhaupt in den fucking Float rein, das ist ein Double, ne, das reicht,"}, {"id": 951, "start": 10933.08, "end": 10943.84, "text": "das passt in den Float überhaupt nicht rein, na gut, ein Double durch den Float sollte"}, {"id": 952, "start": 10943.84, "end": 10954.2, "text": "ein Double ergeben, oder, ja, so, und jetzt geben wir mal das Ganze aus, mein Verbrauch"}, {"id": 953, "start": 10954.2, "end": 10963.2, "text": "in Watt, so, stimmt es jetzt, was ich hier mache, so, was ich jetzt ausgebe, ist mein"}, {"id": 954, "start": 10963.2, "end": 10974.28, "text": "Verbrauch in Watt zwischen, also gesampelt quasi auf diese zwei Werte, so, auf den letzten"}, {"id": 955, "start": 10974.28, "end": 10982.4, "text": "Wert und aktuellen Wert, ok, mal gucken, ich mein, das ergibt jetzt keinen Sinn, weil"}, {"id": 956, "start": 10982.4, "end": 10995.16, "text": "es halt random ist, von einer Sekunde bis, also, ich verbrauche irgendwas zwischen fünf"}, {"id": 957, "start": 10995.16, "end": 11003.12, "text": "und acht Watt, was heißt ich verbrauche, meine Geräte brauchen gerade, dass sie laufen"}, {"id": 958, "start": 11003.12, "end": 11009.76, "text": "so viel, weil Watt ist ja quasi Energie pro Sekunde, ne, also quasi, ursprünglich mal"}, {"id": 959, "start": 11009.76, "end": 11022.4, "text": "sowas wie Joule pro Sekunde, so ganz klassisch, ja, so, das kommt doch von den Werten her"}, {"id": 960, "start": 11022.4, "end": 11031.52, "text": "recht gut hin, Watt ist kontinuierlich, Watt ist eine einfache Schreibweise für Energie"}, {"id": 961, "start": 11031.52, "end": 11050.28, "text": "pro Sekunde, was ist der Stand vom Projekt, wir rechnen gerade den Stromverbrauch aus,"}, {"id": 962, "start": 11050.28, "end": 11077.04, "text": "Big Brain Muffs, Alter, exzellent, ähm, das ist aber falsch, hab ich das falsch rum gerechnet,"}, {"id": 963, "start": 11077.04, "end": 11088.12, "text": "weil das ist doch jetzt tatsächlich ein bisschen, sehr wenig, hoch minus zwölf, Quickmuffs,"}, {"id": 964, "start": 11088.12, "end": 11093.32, "text": "ah Leute, fertig Quickmuffs, ich hab Hunger, ich fress jetzt meine Pizza, so, exzellent,"}, {"id": 965, "start": 11093.32, "end": 11098.64, "text": "soll ich Stream ausmachen oder wollen wir noch Runde Barbecue Pit Boys gucken oder irgendwie"}, {"id": 966, "start": 11098.64, "end": 11128.0, "text": "sowas, hallo, möchtest du nicht ausgehen, wo muss es denn ausgehen, ah, geh aus, ok,"}, {"id": 967, "start": 11128.0, "end": 11147.2, "text": "ich brauch Fressstells Video, ah, yes, also, was haben wir hier, Bacon Egg, Chicken Pig"}, {"id": 968, "start": 11147.2, "end": 11170.68, "text": "Cheese Wrap, hell yeah, Kouda Time, ah, yes, die Musik im Hintergrund, so, ich futter jetzt"}, {"id": 969, "start": 11170.68, "end": 11191.24, "text": "meine Pizza nebenbei, Leute, ich hab übeles Hunger, ist schon kalt, Moment Leute, der hat"}, {"id": 970, "start": 11191.24, "end": 11197.32, "text": "ne neue Marete, was ist mit dem denn los, der hat doch drei Jahre lang oder so, diese"}, {"id": 971, "start": 11197.32, "end": 11207.08, "text": "alte, ungeschärfte Marete verwendet, die nie was geschnitten hat, ich schneiße Kouda"}, {"id": 972, "start": 11207.08, "end": 11228.04, "text": "Time, ich hab Hunger, ich fress jetzt meine Pizza nebenbei, Leute, ich hab übeles Hunger,"}, {"id": 973, "start": 11228.04, "end": 11245.52, "text": "ich fress jetzt meine Pizza nebenbei, Leute, ich fress jetzt meine Pizza nebenbei, Leute,"}, {"id": 974, "start": 11245.52, "end": 11265.12, "text": "ich fress jetzt meine Pizza nebenbei, Leute, ich fress jetzt meine Pizza nebenbei, Leute,"}, {"id": 975, "start": 11265.12, "end": 11279.68, "text": "ich fress jetzt meine Pizza nebenbei, Leute, ich fress jetzt meine Pizza nebenbei, Leute,"}, {"id": 976, "start": 11279.68, "end": 11296.92, "text": "ich fress jetzt meine Pizza nebenbei, Leute, ich fress jetzt meine Pizza nebenbei, Leute,"}, {"id": 977, "start": 11296.92, "end": 11298.92, "text": "Was ist, was ist Poultry Powder?"}, {"id": 978, "start": 11299.72, "end": 11304.68, "text": "Makes no sense. Dota, neun Monate Dankeschön für den Sub. Exquisite Subscription."}, {"id": 979, "start": 11305.56, "end": 11307.56, "text": "Ups, falscher"}, {"id": 980, "start": 11307.96, "end": 11310.92, "text": "Irgendein Curry? Das sieht eher nach Senf aus."}, {"id": 981, "start": 11313.08, "end": 11316.2, "text": "Nee, Mustard, sag er doch, Mustard. Das ist Senf."}, {"id": 982, "start": 11316.2, "end": 11324.76, "text": "Das vorher ist irgendeine Curry-Pulver oder so. Was ist denn?"}, {"id": 983, "start": 11324.76, "end": 11342.04, "text": "Was? Er hat ja grad gesagt, da ist Pferd drin."}, {"id": 984, "start": 11342.04, "end": 11365.56, "text": "Oh, ist keiner auf mein Chibate reingefallen."}, {"id": 985, "start": 11365.56, "end": 11390.52, "text": "Andere Leute machen da nen Sandwich drum, die machen Hähnchenbrust drum. Kann man machen."}, {"id": 986, "start": 11390.52, "end": 11396.52, "text": "Through the Miracle of Time. Kommt jetzt gleich."}, {"id": 987, "start": 11396.52, "end": 11400.52, "text": "Through the Miracle of Time auf Sachs."}, {"id": 988, "start": 11400.52, "end": 11414.52, "text": "Okay, nein, heute nicht, heute nicht."}, {"id": 989, "start": 11414.52, "end": 11430.52, "text": "Cocktasty."}, {"id": 990, "start": 11430.52, "end": 11456.52, "text": "Guck mal, da hat er ne Wurstgrille."}, {"id": 991, "start": 11456.52, "end": 11466.52, "text": "Ich finde das geil. Seit Anfang dieser Videos hat er dieses gleiche Lachen drauf."}, {"id": 992, "start": 11466.52, "end": 11472.52, "text": "Ich kann das gar nicht nachmachen."}, {"id": 993, "start": 11472.52, "end": 11496.52, "text": "Immer das gleiche, aber das ist so Markenzeichen schon."}, {"id": 994, "start": 11496.52, "end": 11506.52, "text": "Warum genau hat er gerade mit dem Messer in das Mehl gehauen?"}, {"id": 995, "start": 11506.52, "end": 11510.52, "text": "Warum?"}, {"id": 996, "start": 11510.52, "end": 11518.52, "text": "Hat er das abgeklopft, das Mehl."}, {"id": 997, "start": 11518.52, "end": 11540.52, "text": "Um Dominanz zu zeigen, genau."}, {"id": 998, "start": 11540.52, "end": 11562.52, "text": "Boah, da sind ja 3 Liter Panade dran."}, {"id": 999, "start": 11562.52, "end": 11566.52, "text": "Was ich persönlich äußerst nice finde."}, {"id": 1000, "start": 11566.52, "end": 11594.52, "text": "Mir schmeckt bei panierten Sachen die Panade meistens am besten."}, {"id": 1001, "start": 11594.52, "end": 11610.52, "text": "Der frittiert wird das gleich noch. Wir dürfen nicht von ausgehen, dass das nur normal gebraten wird."}, {"id": 1002, "start": 11610.52, "end": 11636.52, "text": "Das kommt erst mal in 3 Liter Öl rein oder so."}, {"id": 1003, "start": 11636.52, "end": 11648.52, "text": "So wenig Öl? Was ist denn mit denen los? Das erweckt ja schon den Anschein, gesund zu sein."}, {"id": 1004, "start": 11648.52, "end": 11664.52, "text": "Das ist ja viel zu wenig Öl. Ich hätte das eigentlich gedacht, er macht die Pfanne voll."}, {"id": 1005, "start": 11664.52, "end": 11674.52, "text": "Man muss die Schnur nicht wieder raus bekommen. Die Schnur ist so weich gefrittiert, die kann man einfach mitessen."}, {"id": 1006, "start": 11674.52, "end": 11702.52, "text": "Ich lasse C++ jetzt im Tiefel, weil ich gucke das jetzt wieder an meine Pizza und gehe ich eh demnächst auf."}, {"id": 1007, "start": 11702.52, "end": 11730.52, "text": "Das ganze Dorf damit zu füttern wird vielleicht auch ein bisschen knapp."}, {"id": 1008, "start": 11730.52, "end": 11758.52, "text": "Moment, das ist noch gar nicht fertig. Das kommt jetzt erst noch mal 2 Stunden in den Ofen rein."}, {"id": 1009, "start": 11758.52, "end": 11778.52, "text": "Und jetzt Pay-per-Fat-Modus aktivieren."}, {"id": 1010, "start": 11778.52, "end": 11788.52, "text": "Ganz ehrlich, ich würde das ohne die Soße essen und mal probieren. Wisst ihr was ich dabei machen würde? Ich würde das Teil nehmen, bisschen Hot Sauce und Fettich."}, {"id": 1011, "start": 11788.52, "end": 11804.52, "text": "Das obendrüber bräuchte ich gar nicht."}, {"id": 1012, "start": 11804.52, "end": 11830.52, "text": "Ich sehe da eine Wurst. Das Ding ist so groß mit dem ganzen Teller."}, {"id": 1013, "start": 11830.52, "end": 11856.52, "text": "Ich finde dieses Acting auch immer so übertrieben."}, {"id": 1014, "start": 11856.52, "end": 11874.52, "text": "Ist der Stromauslöser fertig? Na ja, wo ist meine Hand? Erzählt aktuell, erzählt aber noch nicht das Richtige."}, {"id": 1015, "start": 11874.52, "end": 11898.52, "text": "Was haben wir sonst noch zu bieten?"}, {"id": 1016, "start": 11898.52, "end": 11920.52, "text": "Okay, das scheitert bei mir schon mal, dass ich keine Papronis oder was ist denn das überhaupt gewesen? Paprika oder wie die das immer geil aussprechen, Paprika im Garten haben."}, {"id": 1017, "start": 11920.52, "end": 11936.52, "text": "Wir haben hier Eier, Tomaten, Olivenöl, hier ein Ging, hier haben wir frische Bratten und du wirst es brauchen, und wir werden unsere SPG benutzen."}, {"id": 1018, "start": 11936.52, "end": 11954.52, "text": "Also, das erste was wir tun, ist ein wenig Öl drauf zu nehmen und es auf den Kast-Iron-Pan zu legen. Das hier ist einer dieser fanciösen Kast-Iron-Pans, aber du kannst auch einen normalen 10-Inch-Black-Iron-Pan oder Kast-Iron-Pan benutzen oder was du hast."}, {"id": 1019, "start": 11954.52, "end": 11978.52, "text": "Und dann wollen wir die Seiten des Jigs oder des Molls ölen. Und jetzt wirst du ordentlichen Porkbelly-Bacon oder Streaky-Bacon nehmen, für diejenigen, die es streaky nennen, und wir wenden den Jig oder den Moll mit dem Bacon."}, {"id": 1020, "start": 11978.52, "end": 11986.52, "text": "Und wir machen einen Kast-Iron-Pan, so zu sprechen. Jetzt kann man sehen, dass die Supreme-Parte hier auskippt, oder?"}, {"id": 1021, "start": 11986.52, "end": 11990.52, "text": "Also, du bleibst das hier auf und nimmst ein paar halbe Stück und..."}, {"id": 1022, "start": 11990.52, "end": 12008.52, "text": "Erstmal Bacon-Stabeln. Kann sich noch einer an die alten Epic Mealtime-Videos erinnern? Bacon-Strips, Bacon-Strips, Bacon-Strips und Bacon-Strips. Mittlerweile guck ich den Kram nicht mehr. Das war früher nice, irgendwann ist da die Luft raus."}, {"id": 1023, "start": 12008.52, "end": 12024.52, "text": "Was gibt das denn? Das gibt im Endeffekt Rührei in Bacon, oder wie?"}, {"id": 1024, "start": 12024.52, "end": 12040.52, "text": "Da ist ein paar drin. Dann nehmen wir ein paar Zwiebeln Chili-Papier. Und natürlich ist das eine Prüfung des Pitmasters, aber es ist eine Supreme, also nimm dir einen deiner Lieblings-Chili-Papier und lege ihn ein bisschen drin."}, {"id": 1025, "start": 12040.52, "end": 12043.52, "text": "So."}, {"id": 1026, "start": 12043.52, "end": 12049.52, "text": "Und wo genau... Warum kann ich nicht... Warum kann ich nicht das Ei und den Bacon in die Pfanne machen und braten?"}, {"id": 1027, "start": 12049.52, "end": 12052.52, "text": "Ich meine, das sieht danach da nicht so cool aus."}, {"id": 1028, "start": 12052.52, "end": 12074.52, "text": "Erstmal alles komplett mit Haut geschnitten. Mit Schale."}, {"id": 1029, "start": 12074.52, "end": 12082.52, "text": "Warte!"}, {"id": 1030, "start": 12104.52, "end": 12119.52, "text": "So, Pizza weg. Pizza leer geföttert."}, {"id": 1031, "start": 12135.52, "end": 12150.52, "text": "Okay, ich gucke jetzt noch mal, was da rauskommt. Geht das Programmieren jetzt weiter? Ich bin mir noch nicht ganz sicher, ob ich weitermache."}, {"id": 1032, "start": 12150.52, "end": 12164.52, "text": "Die Rechnung musst du auf Mal statt Geteilt ändern, okay. Mach ich."}, {"id": 1033, "start": 12180.52, "end": 12205.52, "text": "Moment, das Video ist erst halb fertig, da kommt noch was."}, {"id": 1034, "start": 12205.52, "end": 12224.52, "text": "Aha. Barbecue Soße."}, {"id": 1035, "start": 12224.52, "end": 12239.52, "text": "Die Sound-Effekte sind so geil."}, {"id": 1036, "start": 12239.52, "end": 12249.52, "text": "Also das ist für mich der Inbegriff von Kokona-Essen, dieser Channel, aber ich gucke es immer wieder gern an. Ich gucke es seit Jahren schon."}, {"id": 1037, "start": 12249.52, "end": 12254.52, "text": "Ich habe noch nichts davon nachgemacht oder gegessen."}, {"id": 1038, "start": 12254.52, "end": 12265.52, "text": "Das sieht aber echt gut aus. Das sieht echt gut aus. Das muss man mal sagen, das sieht wirklich nice aus."}, {"id": 1039, "start": 12265.52, "end": 12280.52, "text": "Pocktasty."}, {"id": 1040, "start": 12280.52, "end": 12295.52, "text": "Die Brotscheiben sind ein wenig ungleich geschnitten und schepp."}, {"id": 1041, "start": 12295.52, "end": 12316.52, "text": "Die Bacon? Ne, keine Ahnung."}, {"id": 1042, "start": 12316.52, "end": 12338.52, "text": "Die Musik."}, {"id": 1043, "start": 12338.52, "end": 12363.52, "text": "Ah, jawoll, da muss ich ordentlich Fett-Mayonnaise drauf, jawoll, so geht's."}, {"id": 1044, "start": 12363.52, "end": 12381.52, "text": "Ich habe keine Ahnung, was ein BLT ist. Boah, Alter, wer soll denn das ins Maul kriegen?"}, {"id": 1045, "start": 12381.52, "end": 12393.52, "text": "Wer soll das essen? Ach du Scheiße, what the fuck?"}, {"id": 1046, "start": 12393.52, "end": 12415.52, "text": "Es sieht geil aus, aber das kann doch keiner essen. Erstmal Kiefer ausgeregt."}, {"id": 1047, "start": 12415.52, "end": 12429.52, "text": "Also reinhauen würde ich es mir jetzt trotzdem. Ein bisschen heiß, ein bisschen heiß."}, {"id": 1048, "start": 12429.52, "end": 12436.52, "text": "So wirklich glücklich sieht er nicht aus damit, oder?"}, {"id": 1049, "start": 12436.52, "end": 12450.52, "text": "Erstmal wegspülen."}, {"id": 1050, "start": 12450.52, "end": 12457.52, "text": "Ach, ich guck die gerne. Ich guck die gerne. Kekona-Style."}, {"id": 1051, "start": 12457.52, "end": 12472.52, "text": "Oh Leute, es hat rebooted, seht ihr das? Es ist gecrashed. Es ist gecrashed, was ist da los?"}, {"id": 1052, "start": 12472.52, "end": 12479.52, "text": "Es hängt in der Bootschleife und ist kaputt."}, {"id": 1053, "start": 12479.52, "end": 12489.52, "text": "Es startet nicht mehr. Overflow, vielleicht."}, {"id": 1054, "start": 12489.52, "end": 12502.52, "text": "Ich bin mir aber nicht so ganz sicher, warum. Finger League, OMG."}, {"id": 1055, "start": 12502.52, "end": 12517.52, "text": "Vielleicht ist es wirklich overflowed. Aber RIP."}, {"id": 1056, "start": 12517.52, "end": 12530.52, "text": "Achso, ich muss wieder. Geräte."}, {"id": 1057, "start": 12530.52, "end": 12542.52, "text": "Oh, das crasht? Direkt? Reconnect?"}, {"id": 1058, "start": 12542.52, "end": 12550.52, "text": "Ah, ich weiß warum das crasht. Ich hab mir den Exis-Point rausgestöpselt gerade."}, {"id": 1059, "start": 12550.52, "end": 12556.52, "text": "Wenn ich den Exis-Point rausstöpselt, geht natürlich das W-Lan nicht und dann startet es sich neu bis das W-Lan wieder geht."}, {"id": 1060, "start": 12556.52, "end": 12560.52, "text": "Das erklärt es natürlich, alles klar."}, {"id": 1061, "start": 12560.52, "end": 12576.52, "text": "Ok Leute, ein äußerst nicer Stream."}, {"id": 1062, "start": 12576.52, "end": 12585.52, "text": "Und wir sehen uns. Heute war richtig viel angesagt. Morgens Aufwachen Stream, jetzt Progress Stream."}, {"id": 1063, "start": 12585.52, "end": 12590.52, "text": "Bis dann, machts gut, wir sehen uns, CU."}]}