{"text": "Salaida!Salaida!Salaida!Salaida!So Leute, da bin ich, ne ich hab mir noch keine Emotes machen lassen.Ich hab mir noch gar nichts machen lassen, ich hab keine Subscriber-Batch, ich hab keineEmotes und das Schlimme ist, warte mal, Kabi muss mal kurz die Klappe halten, das Schlimmeist, ich check auch die Einstellungen nicht, wo ich was hoch lade, ich muss mir das echtin Ruhe nochmal angucken.Ich brauch, ich brauch einen guten, oh jetzt kommen die, jetzt kommen die, die Subs, jadanke Leute.Ähm, es gibt doch jetzt, wie heißt es, Fiverr oder Fiverr, da kann man sich irgendwelcheLeute mieten, die für ein Emotes machen, ne aber ich werde mir auf Twitter mal, ichwerde mal auf Twitter ein bisschen gucken, wer das so ist und wie gesagt, ich will auch,ich will auch nicht, dass irgendwie einer für mich Zeugs umsonst macht, aber das solltedementsprechend aber halt auch auf was tauchen, auf was taugen, warum ist so ein PP-Gabbotnicht an?Jaja, continue, Fiverr, heißt es Fiverr, heißt es Fiverr, ich weiß es nicht, Fiverr,also ich hab keine Ahnung, was wir heute machen, ich bin jetzt einfach nochmal on gekommen,gekommen, weil ich gerade gesehen habe, dass die Twitch-Partnerbewerbung angenommen wurde. Aber erst mal die ganzen Grams hier starten.Vielleicht vom letzten Mal noch ein paar Fragen auf haben.Ich müsstezumindest Sub-Benachrichtigungen und so Gedöns schon eingeschaltet haben, hoffe ich mal.Nice, ja doch, ist eingeschaltet. Ich sehe es, ShircoSky.Ah, ist doch cool. Ich bin echt froh, dass das geklappt hat. Danke für die ganzen Subs. Übrigens auch danke für die ganzen Subs schon, die es gegeben hat, bevor ich überhaupt online gekommen bin mit dem Stream.Noch mehr, jetzt geht es aber ab.KS. Twitch Prime. Stimmt, jetzt kann ich ja den Twitch-Cast-Corian auch danken bei dir für den Sub. Jetzt kann ich ja den Twitch Prime-Sellout machen, Leute.Habt ihr schon euren Amazon-Account mit Twitch verknüpft?Ja, ich, normalerweise hätte ich gesagt, dann könnt ihr euch Twitch kostenlos angucken und einen Streamer eurer Wahl kostenlos abonnieren im Monat.Allerdings hat sich Amazon letztes Jahr überlegt, es gibt keine Werbung, äh, es gibt wieder Werbung, auch für Prime, Leute.Das heißt, aktuell bringt das eigentlich nur, ich glaube, irgendwelche kostenlose Drops, die ich nicht verwende, und man kann kostenlos den Streamer seiner Wahl unterstützen.Das ist auch das Einzige, was ich persönlich mit meiner Twitch-Prime-Geschichte mache.Ähm, die ganzen, ich weiß nicht, wie es bei euch ist, aber die ganzen anderen Twitch-Prime-Sachen nehme ich eigentlich gar nicht in Anspruch.Ich hab zig, zig hunderte Einträge hier, dass ich irgendwelche Loot-Geschichten unlockt habe, dass ich, ich glaube, ich hab bisher noch nicht eine Sache eingelöst, aber so kann ja jeder machen, wie er will, ne?Ähm, ja, und jetzt an der Stelle mal gesagt, ich bin froh über jeden Sub, aber er sollte sich natürlich nach wie vor keiner irgendwie gezwungen fühlen.Ich komm auch ohne Twitch-Subs über die Runden, ja, kein Problem, aber ich find's natürlich schön, und was ich, was ich fast nur schöner finde ist,und das muss ich jetzt an der Stelle auch mal loswerden, weil jetzt, wo ich Partner bin, kann ich den richtigen Sellout starten.Ähm, dass so viele Leute immer bei den Streams am Start sind, ähm, das ist ja schon ein ziemliches, wen haben wir jetzt?Philipp Hü, danke für den Sub, ähm, wo war ich gerade stehen geblieben?Genau, ich wollte die übliche Subscriber-Einschreiben-Action loslassen, und zwar, ich find's wirklich schön, dass immer so viele Leute am Start sind, weil ich weiß, dass das hier an sich ein ziemliches Nischenthema ist, ja?Vor allem auf Twitch, so, Streams, die sich, oder generell, es ist auch auf YouTube so, Videos und, und Content, der sich wirklich mit Technik ein bisschen tiefer greift und beschäftigt, ist rar, gibt's nicht so viel.Es gibt ganz viele Technik-Channels, die sich Technik-Channels nennen, und die machen dann im Endeffekt sowas wie Smartphone-Reviews, oder zeigen vielleicht mal das Einrichten von irgendeinem, von irgendeinem WLAN-Repeater-Router, oder hast du nicht gesehen?Aber, was wir hier machen, ist ja schon, meistens zumindest, ne Runde Advanster, und, deswegen find ich das gerade so schön, dass so viele Leute am Start sind, und was ich auch cool finde, dass hier doch der Anteil an Leuten, die sich dafür interessieren, und vor allem auch, die sich in verschiedenen Themenbereichen auskennen, kommt mir zumindest relativ hoch vor.Das find ich sehr nice, ja nice, äh, danke SeriousMax, aber das ist wirklich cool, Morgengemüse, Dankeschön für den Sub, Twitch Prime, Matt, kann ich dir Recht geben, ähm, ich find's auch ein bisschen merkwürdig, wenn man sagt, ich bin Technik, die sagen ja nicht, ich bin Technik-Experte, aber ich finde, ein richtiger Technik-Channel,ich weiß nicht, ob man das Technik nennen kann, wenn man sich zum größten Teil mit Swat vor uns beschäftigt, das ist jetzt nichts gegen die Channels und die Leute an sich, da gibt's auch wirklich nette Leute, aber, mit Technik hat's aus meiner Sicht nicht so viel zu tun.Endlich kann man suppen, ja, seit 5 Minuten.Demnächst gibt's übrigens auch, ich muss mir echt Gedanken machen, was ich als Subscriber-Batch mache, vielleicht machen wir ein paar Keks-Krümmel oder irgendwie sowas, ich hab nur wirklich keine Ahnung, also wir müssen uns mal aufschreiben, was wir noch machen müssen, also, wichtig, was müssen wir machen, wir brauchen eine Subscriber-Batch, ich kann die gar nicht mehr schreiben, Subscriber, hat man,hat man, hat man einen Lehrer bei mir an der Schule, kann ich mich noch dran erinnern, habe ich an der Berufsschule, übelster, übelster Fail, hat er mal irgendwas vorgelesen und auf einmal hat er irgendwas die ganze Zeit erzählt von Subscriberin, bis ich dann irgendwann, was meint er eigentlich, meint er abonnieren, und dann hat er gesagt, ja, ich hab noch nie jemand gehört, der ernsthaft Subscriber mit Subscriberin übersetzt hat, und ich hab gedacht, es war so,aber der war, der war seiner Zeit voraus, der,Dis-Abo,gibt's nen Subcounter, ähm, ich würde selbst keine gucken, wie viele Subs ich hab,ich hab keine Ahnung, wo ich das überhaupt nachgucken kann,ich hab, ich muss, ich, wie gesagt, ich hab dieses, dieses Twitch-Onboarding,ich hab mich vor 5 Minuten oder 10 Minuten fertiggemacht, ich hab wirklich absolut keinen blassen Schimmer,Streamlabs, ja, bestimmt, allerdings würde ich gerne, ja, ich war in Frankfurt auf der Hochschule,allerdings würde ich selbst gerne mal erst mal checken, wo ich das überhaupt sehe,das seh ich garantiert irgendwo in den Account-Settings, aber ich hab keine Ahnung,dann lass uns zusammen rausfinden, das geht nicht, da müssen sich die Account-Settings hier aufm,aufm Stream aufmachen, und da sieht man auch noch mehr von, äh, Adresse zu Kontonummer und zu,Adre-, und, und, und, und Name, Adress, all mögliche, das geht nicht,als wären sich nur die Subs gegiftet, ein nicer Schachzug,KioKoll, danke für den Sub,Casino Capitalist, danke für den Sub, jetzt geht's aber ab hier, meine Güte,ich hab jetzt ja schon innerhalb von, noch mehr, ach du Scheiße, ich hab jetzt ja schon,keine Ahnung, Laupertin auch bei dir, danke für den Sub, ähm, ich hab jetzt innerhalb von 10Minuten oder so 15 Subs oder was gekriegt, easy, da fällt mir nix anderes ein, da gibt's,Flixcoder auch am Start, dankeschön, ähm, also lass uns überlegen, was wir brauchen,ich brauch ne Subscriber-Batch, ich brauch, ich, ich weiß gar nicht,wie viele Emotes man zum Start kriegt, wahrscheinlich eins oder so, oder fünf,oder ich weiß gar nicht, muss ich gar nicht gucken, Ray, das ist ne gute Frage,da sag ich gleich was zu, ähm, da sag ich gleich was zu, Technik-Channels auf YouTube,ich find, gibt ein paar, gibt ein paar ganz gute, so Abseits von Linux Tech-Tipps,man sagen muss, Linux Tech-Tipps, ich würd den schon als Technik-Channel durchgehen lassen,allerdings ist das eigentlich hauptsächlich ein Entertainment-Channel, ich mein, ganz ehrlich,ähm, wer find das nicht lustig, wenn sie sich in den Intel-Server hinstellen und versuchen mitihren Füßen die CPUs anzudrücken, dass der Server startet, aber, ähm, wirklich mit Technikhat das nicht viel zu tun, äh, äh, äh, Linux Technik, nicht Linux, Alter.Was passiert eigentlich, wenn einer jetzt 100 Subs giften würde, wenn nur 80 Leute im Chat sind?Naja, in Anbelang der Tatsache, dass du dir die Subs irgendwelchen Leuten giften musst,funktioniert das nur so lange, wie Leute da sind.Es sei nur Gift des Subs, Leute, die nicht da sind. Hallo, Quallog. Also, Emoji brauchen wir,da muss ich mir unbedingt, äh, einen Artist suchen, einen, der das machen kann, wie ich mir dasvorstelle, bzw. der vielleicht auch ein paar Ideen hat, wie man's machen könnte, weil ich da beisolchen kreativen Sachen, was künstlerische Sachen angeht, nicht so, nicht so das Händchen für hab.Was bringt es, einen Sub gekiftet zu bekommen? Du bist ganz normaler Sub. Das ist ein richtigerSub, äh, nur, dass du ihn nicht selbst bezahlen musst. Also, optimal, um die Grills zu beeindrucken.So sieht's aus.Leider kann man seinen Prime-Sub, glaub ich, nicht giften. Macht die Ecke von einem Keks,der, macht die Ecke von dem Keks, die fehlt als Sub-Icon. Das ist ne richtig coole Idee.Gibt's hier im Chat eigentlich Grills? Es gibt generell im Internet keine Grills.Das ist, das ist nur Gerücht. Wupplotzmonka-Emote. Ja, da müssen wir mal gucken. Ich hab, wie gesagt,ich hab echt keine Ahnung, wie das funktioniert. Also, wir brauchen Emotes. Wir brauchen noch dieneuen FFZ-Emotes. Geht eigentlich POC mittlerweile. Der Rüpel, danke für den Sub. Ähm, können wirmal ausprobieren, ob POC als Emote mittlerweile funktioniert. Ich hab's vorhin FFZ-mäßig eingetragen.Ja, funktioniert. Ja, sehr schön. Ähm, jetzt mal so außer der Reihe. Normalerweise erzähl ich janicht so Zeug, aber, aber zur Feier des Tages, weil gerade jemand gefragt hat, ob Grills in dem Chatsind. Ähm, hotte Grills natürlich. Ähm, dachte ich mir, ich könnte mal eine, eine Real-Life Story zumBesten geben, was damit was zu tun hat. Und online Grills, in Kombination. Ist ja nicht so oft Themabei mir. Und es könnte sogar sein, dass ich das schon mal erzählt hab, weil das war so ein, ähm,einschneidendes Erlebnis, wo ich die Welt nicht mehr verstanden hab. Wo fang ich denn jetzt am besten an?Ähm, also ich bin mittlerweile, ich wusste, ich wusste vielleicht ein bisschen weiter ausholen. Ähm,ich hab mittlerweile echt so meine Bedenken, was das anbelangt, wenn man Mädels irgendwie überdas Internet kennenlernt. Weil ich hab die Erfahrung gemacht, ich, ich verallgemeiner das jetzt nicht,ja. Ähm, dass Mädels, die online sehr aktiv sind und da auch, ja wie sagt man so, online auf derSuche sind, ja. Oder sich vielleicht auch an die ein oder andere Leute ranwerfen online. Dass diesie oftmals nicht mal so alle haben. Und dazu will ich euch jetzt mal eine Sache erzählen. Vor fünfJahren oder so, schon ewig her, also da, wo ich auf YouTube noch ein bisschen Videos gemacht hab,ähm, war ich auch mal in Kontakt mit so jemand. Und das, ich muss jetzt gucken, wie ich das jetzterzählen soll. Zumindest an sich war das gar nicht schlecht. Die war an sich, an sich hab ich mich auchgut mit ihr verstanden. Die war nett, die sah auch relativ gut aus. Und an sich haben wir uns echtganz gut verstanden. Und ich hab mir die ganze Zeit so gedacht, irgendwas, irgendwas ist da merkwürdig.Irgendwas, irgendwas stimmt da nicht. Sie hat erzählt, sie ist 21 und ähm, oder ich hab mirirgendwie so gedacht, so nach zwei Wochen, irgendwie, irgendwas stimmt da nicht. Hab ich gesagt, ey, okay,ähm, wie siehts dann aus, lass uns mal, lass uns noch mal treffen. Und eine Sache, die ich damalsnicht, nicht so genau gecheckt habe, aber die eigentlich heute voll offensichtlich ist,ist, dass sie sich immer neue Ausreden ausgedacht hat, warum man sich nicht treffen kann. Abertrotzdem, auf der anderen Seite, die übelste Flirt-Action online gestartet hat, die ganze Zeit.Und ich, ich hab's halt, ich hab's halt irgendwie nicht gecheckt. Das, das, das Gipfelte dann darin,dass wir, wir kannten uns nicht wirklich, ja. Nur online. Aber wie gesagt, sie hat die ultra,ultra Flirt-Action online gestartet. Und auch mit Bildern und allem. Und das war, war die auch,also das war jetzt nicht irgendwelche Fake-Geschichten oder so. Und auch teilweisefür Dinger, was sie für Dinger geschrieben hat, ey. So irgendwie so nach dem Motto, ey, gleich,gleich geht's ab, ja. Und, und die Krönung der Sache war dann, dass sie dann irgendwann angefangen hat,schon online irgendwie Drama zu machen. Und so war zum Beispiel, da bin ich auf Twitter,da bin ich, ähm, bin ich einer Let's-Playerin gefolgt. Gefolgt, auf Twitter wohlgemerkt, ja.Sonst nix. Und da hat die einen riesen Aufriss gemacht. Warum ich irgendwelchen anderen Mädelsauf Twitter folge, das mach ich doch nur, dass ich, ähm, heimlich mit denen schreiben kann.Da hab ich mir schon gedacht, Alter, jetzt, jetzt wird's aber echt abgedreht irgendwie.Und, ähm, naja, Ende vom Lied war, das hat nicht funktioniert, aber, ähm, also, dass man ein Dramamacht, weil man einer Let's-Playerin auf Twitter folgt, ist schon echt abgedreht. Ich will jetztauch nicht zu, nicht zu sehr ins Detail gehen, weil, da gab's dann schon noch ein paar Sachen,die für alle Seiten nicht so, äh, wo ich, wo man nicht will, dass sie jeder weiß, ja, aber,aber das mit Let's-Playerin folgen auf Twitter war schon, war schon echt so ein Highlight, wo ichmir gedacht hab, die Mädels online, die spinnen alle ein bisschen. Was macht sie heute? Ich glaub,die arbeitet bei irgendeinem Amt. Ich glaub, beim Umweltamt oder so war das. Stadt sag ich jetzt nicht.Junge, dein Desktop, Wirechamp. Warum? Doch, perfekt. Ich mein, was will man denn mehr als Desktop haben?Wenn ich einem männlichen Let's-Player gefolgt werde, ja, dann, ja, man weiß ja nie. Außerdemist es ja in der heutigen Zeit nur wirklich keine Chance, äh, keine Schande. Übrigens,ich muss erst mal gucken, falls ich irgendwelche Subs verpasst hab, muss ich jetzt mal nachschauen,wo ich das überhaupt sehe auf Streamlabs, Streamlabs, wo es Subs gegeben hat. Subs,wen haben wir als letztes? Vor vier Minuten, ähm, Spread the Beast hat an T-Max Electronicsgegiftet. Dankeschön für den Sub. Ah, man sieht den Unterschied, ob Tier 1 oder Prime. Aha.Ich entdeckte es jetzt auch zum ersten Mal. Die Icons, ne, das ist, ähm, ist halt Streaming-Account.Ich ziehe halt einfach alles, was ich irgendwie hier im Stream mache, auf den Desktop und lassees dann da rumgabbeln, ja. Was war denn das jetzt? Was war das? Bits, ah, vier Bits, wieviel sind das, vier Bits? Also, huge, huge Bits Donation, Poggers, keine Ahnung, wieviele das sind, aber, sehr, sehr nice. Was sind denn? Vier Bits, ein Cent, äh, nein,vier, vier Cent, ein Bit, ein Cent. Pog. Huge Pog. Ja, Leute, ähm, ich weiß jetztgar nicht so genau, was ich eigentlich, ah, total, Dankeschön für den Sub. Ich mussmir jetzt irgendwelche, äh, Subsprüche ausdenken, dass ich nicht immer die gleichen Sachensagen muss. Eat Platz 1, Spread Beasts, oh, jetzt gibt's sogar, gibt's sogar lila Bits.Ich muss euch jetzt mal was sagen, ähm, diese ganze Cheering-Geschichte und so, die istnatürlich sehr nice, weil Easy Money und Easy Life und, äh, und so, aber ich persönlichbin jemand, der hat die ganzen Bit-Geschichten und, und Top-Bit-Donator per Plugin ausgeblendetauf anderen Channels. Weil das immer was vom, vom Chat wegnimmt und das nervt mich. Vielleichtsollten wir mal Kirby ausmachen, was anderes anmachen. Ähm, übrigens, irgendjemand hatauch gerade gefragt, was ich so für, ähm, Technik-Channels auf, auf YouTube empfehlenwürde. Äh, also mir fallen, mir fallen jetzt aus dem Kopf zwei Stück ein, die ich richtiggut finde. Das eine ist ein bisschen was seriöses, das andere eher nicht. Also, wen, wen ichrichtig gut finde, ist, ähm, den Schweizer. Wenn's um, äh, so Micro-Controller-Geschichtegeht, guck ich mir den echt gerne an. Der hat, äh, viele interessante Tutorials. Ähm,es ist nicht alles was, manche Sachen wie PoE und so, brauch ich, juckt mich nicht sowirklich. Ähm, aber das ist richtig gut, wenn man sich für Micro-Controller-Kram interessiert.Kann ich echt empfehlen. Auch wenn er, wenn er seine neueste China-Post auspackt, ist richtiggut. Da lernt man nämlich auch, ähm, die ein oder anderen Geräte kennen. Hat er auchso den typischen Schweizer Akzent. Ja, du musst dir mal sein Intro anhören. Hat er.Hat er. Der sagt sogar, äh, am Anfang, was mit seinem Schweizer Akzent. So, und dermit Abstand unterhaltsamste, so, Elektronik-Technik-Kanal ist der hier. Der hier. Das ist der beste.Das ist der beste, ey. Also, also, man muss dazu sagen, der hat, der ist jetzt nicht irgendwieunbekannt oder so, 2,6 Millionen Abos. Ich glaube aber, das ist ein Channel, der wärein Deutschland nicht erfolgreich. Ich glaube, das ist ein Channel, der wäre in Deutschlandnicht erfolgreich. Ähm, der ist zu anspruchsvoll und lustig gleichermaßen. Das kapiert, glaubeich, so, dass, ähm, nur nach 15 Let's-Player-Gucker in Deutschland nicht. Ähm, aber das ist,das ist wirklich lustig. Der schockt sich so gefühlt zehnmal pro Video. Und der hateine der besten Erklärungen, die ich je gesehen hab, zum Thema Stromwiderstand, Leitungswiderstandund wie das alles zusammenhängt, die ich je gesehen hab. So gut erklärt und lustigdabei, übelst huge. Noch mehr Bits, 500 Bits, krasser Scheiß, ja. 500 Cent, 5 Euro,krass, nice, danke, huge brain. So, das sind, das sind so die zwei, ähm, das sind so diezwei Channels, die mir jetzt spontan einfallen, die ich eigentlich, wo ich jedes Video gucke,wo ich schon quasi darauf warte, dass sie ein neues Video machen. Ähm, es gibt, esgibt noch mehr, aber da müssen wir mal Gedanken zu machen. Also, das sind aber die ersten,die mir direkt einfallen. Klatzt du auch wie andere auf deinen Bauch, wenn jemand zappt?Nee. Warum soll ich auf meinen Bauch klatschen? Ich meine, ich, ich hätte potenziell genugBauch, um da drauf zu klatschen, wenn jemand zappt. Ben Eater ist auch cool, ähm, ja,stimmt, der ist mir jetzt gar nicht eingefallen. Vor allem die Grafikkartenvideos waren sehrnice. Warum, vor allem, warum sollte man auf seinen Bauch klatschen? The Hook ist auchein guter Job. Ja, ist das nice. Sehr, sehr schön. Ähm, gucken wir mal, ob mein Toolwieder verbugt ist heute. Drunk Stream bei 100er Subgoal. Ja, an Silvester vielleicht.Gab's während deiner YouTube-Karriere eigentlich richtige, also so richtig, so richtig quasiwie Fanboys nur als Grills eigentlich nur eins. Und nicht die, die ich gerade eben erzählthab, eigentlich nur eins. Aber ich bin jetzt nicht derjenige, der irgendwie, ähm, mitseinen Videos hier die Scharen von, von Hotten-Fan-Grills anzieht, ja. Dazu fehlt natürlichauch, dass ich nicht vor der Kamera rumspringe, weil da weiß ja gar keiner, was Sache ist,ja. Hast du irgendwas mit Informatik oder Elektrotechnik studiert? Nein, hab ich nichtstudiert. Ich hab vor über 10 Jahren, 15 Jahren, fast, 15 Jahren, die Ausbildung gemachtzur Empfang informatischer Systemintegration. Damals, so in grauer Vorzeit. Ja, ihr wisst,wie mein Klo aussieht, das ist richtig. Wie alt ich bin? Nächsten Monat, im August,bin ich 35. 35, ja. Tja, OKS, ja. Ich weiß, ich würd mich selbst auch nicht als 35 sehen.Hab das falsche geklickt. Ich seh, also bei mir im Kopf bin ich höchstens, höchstenspaarundzwanzig. Ich würd mich auch nicht als 35 sehen. Also wenn ich an mein Alter denk,bin ich nie an 35. Geht dem Fabian übrigens auch so. Aber siehst du, wie Fabian auch 20Jahre jünger aus, als du bist? Nee, nicht ganz. Bei Fabian ist es extrem. Der Fabiansieht ja wirklich aus wie, keine Ahnung, 23 oder so. Bei mir ist das Problem, dass ichin der Mitte schon relativ wenig Haare hab. Also ich seh tatsächlich schon ein bisschenälter aus. Also ich hab keine Platz, aber man sieht halt auch schon, dass da nicht mehrnicht bei all zu viel ist hinten, ja. Also es ist übrigens, ähm, sehr, sehr, sehrziemlich verbreitet, glaub ich, dass heute Leute schon mit teilweise 25 anfangen, ähm,quasi auf dem Kopf weniger Haare zu kriegen. Liegt bestimmt an der ganzen Handy-Strahlung.Bist 24, bist grau, ja, ja. Kennst du die Seite Apollo in Realtime? Ja, das kenn ich,das kenn ich. Ja, Moonmon hat auch so wenig Haare, das stimmt. Leute, ich hab keinen Plan,was ich heute machen soll, ne. Ich hab einfach jetzt nur Streben angemacht, weil ich mirgedacht hab, wenn ich jetzt, wenn ich schon Twitch Prime, oder wenn ich schon Partnerfreigeschaltet wurde heute. Da mach ich jetzt einfach Streben an. Übrigens, ähm, für alle,die vielleicht auch ein bisschen an Overwatch interessiert sind, habt ihr gesehen, dasses einen neuen Patch gibt, also auf dem PTR, einen neuen Patch mit endlich, endlich, äh,Role Queue, separaten Placements für die unterschiedlichen Rollen, oder auch ganz guteBalancing-Anpassungen. Das könnte, es ist ja nicht so, als dass, dass das Leute, wiesie, also, ich sag das seit zwei Jahren schon, oder mehr oder weniger seit Release, dassman sowas braucht. Genauso wie ich seit Release gesagt hab, man braucht einen Spectator-Modus.Allerdings, ich bin ja nicht der Einzige, warum sollten die auf mich hören, ähm, dassagen so ziemlich alle anderen Leute, die sich intensiv mit dem Spiel beschäftigt haben,auch schon seit Jahren. Und jetzt, als Blizzard endlich geschafft, das könnte sogar so weitgehen, dass ich mir echt mal wieder, ähm, Overwatch antue, allerdings erstmal nichtim Stream. Overwatch hatte keinen Spectator-Modus, nein, nein. Overwatch wurde als übelste E-Sport-Geschichtegehypt, auch mit Overwatch League und allem, hatte aber bis vor kurzem keinen Spectator-Modus.Ja, ich weiß nicht, wenn ein Game E-Sport ready sein kann, wenn es keinen Spectator gibt.Einen schönen Panzer-Ei. Sub ist raus. Kann man nicht beim Subscriben irgendeine Nachrichtangeben, die dann angezeigt wird? Oder geht das nur bei Bits? Ach, nur beim Resub. Ah,das ist natürlich huge. Das ist Big Brain von Twitch. Das verleiht die Leute natürlichzum Resub, ne? Gerüchtet zu Overwatch 2 mitbekommen. Ah, da bin ich, da bin ich nichtso, das glaube ich nicht so, dass in nächster Zeit Overwatch 2 rauskommt.Jeden Tag Sellout-Stream, ja. Hast du doch irgendwas rumliegen, das du flashen kannst?Ja, habe ich, denn vorgestern oder so ist eine neue Firmware rausgekommen für, ist dasDing so? Kann man nicht merken, wie das heißt. Das ist so ein grausamer Name, das da. Vorein paar Tagen, vor zwei Tagen oder so, ist endlich Version 0.4 von der Custom-Filmwarefür meinen Staubsauger erschienen. Und ich dachte mir, da können wir uns viel meinenStaubsauger wieder flashen. Ja, Staubsauger-Flashen. Machs gut Patrick, bis denn.Ist das eigentlich ein Mod für die Original-Firmware oder kompletter Recode? Das ist ein Mod fürdie Original-Firmware. Allerdings haben sie halt den ganzen China-Cloud-Kram rausgebaut.Die haben das ziemlich clever gemacht. Die Firmware ist halt so programmiert, das kenneich, das kenne ich, das habe ich letztens auch geguckt. Muss ich sagen, ich fand esjetzt nicht so lustig, weil ich kann über irgendwelche Ragdoll-Animationen von Spielenirgendwie nicht mehr lachen. Davon hat man zu viel schon gesehen. Ja, die haben das relativclever gemacht hier mit der Firmware. Die haben die Original-Version genommen oder dienehmen die Original-Version von der offiziellen Staubsauger-Firmware und wiegen die Requestin die China-Cloud quasi lokal auf den Web-Server um, der von ihnen ist. Also im Prinzip istdas hier mehr oder weniger die Original-Firmware, bloß dass die, die haben eine Firewall draufgehauen, dass das Ding nicht mehr mit China reden kann und sie biegen quasi, es hat geradegeklingelt, ja, ja. Und die biegen dann alle Request um auf den lokalen Web-Server unddie Firmware denkt, sie reden mit der China-Cloud, in Wirklichkeit redet sie lokal mit dem Web-Serverhier. Das ist eigentlich ziemlich clever gemacht. Könntest du das nicht auch über den Routermachen, oh sorry Leute, der Router, und den Server bloß nachbauen. Klar, du kannst auchden Raspberry irgendwo hinstellen, das drauf laufen lassen. Die haben es halt so gemacht,dass alles auf einem Gerät läuft. BeatBot, ja, ja, könntest du wahrscheinlich machen,aber ich meine, es ist ja ganz praktisch, wenn alles auf einem Gerät läuft. Aber ja,das würde wahrscheinlich auch so funktionieren. Ich weiß allerdings nicht, nee, ich glaube,ganz wird es nicht funktionieren, du brauchst so ein paar Firewall in Regel, die Requestblocken, die auf feste IPs gehen. Davoco, so sieht es aus. Siehst du mal, was ich fürden Streben alles hier wieder für Verluste erleide. Ups. Dann müsste man den Staubsaugernicht mehr routen. Und das ist richtig. Dafür hast du dann immer noch China Spyware drauf.Es ist kein Akt, den Staubsauger zu routen. Es ist nicht schwierig. Das machen wir morgendann im Stream. Morgen wird Staubsauger geroutet. Heute können wir das nicht mehr machen, weilda muss ich erstmal die Ladestation unter dem Schrank ausbauen. Ich habe das Kabel unterdem Schrank durch, hinter dem Schrank hoch an die Steckdosen, da muss ich erst wiederauf die Erde rumkriechen, bis ich das rauskriege, da habe ich heute keinen Bock. Das machenwir morgen. Morgen wird Staubsauger geflasht. Die Bits sind aktiviert. Ja, falls ich irgendwieübersehe, Leute, wenn es hier irgendwie Huge Donation oder Bits oder sonst was gibt undich übersehe es, dann spampt mich wieder voll. Weil manchmal bin ich so am Schwätzen, dannhöre ich auch irgendwelche Sounds nicht. Da muss ich jetzt immer mal ein Auge auf Streamlabshalten. In welcher Kategorie streame ich eigentlich gerade? Oh, Raiddy Germany habe ich übersehen.Ich gucke mal, ob ich das sehe in Steamlabs. Nö. Doch, ein Bit. Kappa 1. Kappa 1, 2, 3.Golden Kappa Check. Science and Technology. Leute, Golden Kappa Check. Ich weiß gar nicht,ob es das überhaupt noch gibt. Das ist bestimmt Voraussetzung, dass man Twitch-Partner ist,dass man Golden Kappa kriegt. Bist du eigentlich der einzige deutsche Partner in Science andTechnology? Glaube ich nicht. Aber ich finde es so geil, dass wir eigentlich der größteStream immer sind in Science and Technology. Einfach so, das ist halt schon nice. Die anderensind aber halt auch nicht so gut. Gibt bestimmt gute. Ich gucke an sich relativ wenig. Wisstihr, was ich auf Twitch aktuell ein bisschen blöd finde? Die hatten mal so eine Community-Übersichteingeführt, wo das ganze gruppiert war nach Speedrunning oder nach Roleplay oder sonstwas nach Dungeons and Dragons oder irgendwas in der Richtung. Das haben sie jetzt abgeschafft.Ich weiß, es gibt jetzt Tags, aber ich fand das so viel einfacher, Channels zu finden,die man noch nicht kennt, aber die einem gefallen. Weil ich bin jemand, der guckt auch Leute,die Spiele spielen, die er nicht spielt. Ich gucke zum Beispiel auch öfters mal irgendwelcheApex-Streams, obwohl ich das Game noch nicht einmal installiert hatte. Einfach so, weilich da gerne zugucke. Meistens finde ich die Leute allerdings dann nicht über Apex,weil wenn du auf die Kategorie gehst, hast du erstmal alles voll mit Streams mit irgendwie2000, 1000 plus Zuschauern, aber vielleicht gefällt dir ja der Stream mit 300 besser.Also ich finde es allgemein schwierig gerade neue Streamer zu entdecken, die mir gefallen.Das fand ich mit den Communities ganz gut und finde ich jetzt mit den Tags nicht so gutgelöst. Ne, das normale Sub ist nicht Verlängerung.Jedoch, du kannst das ankreuzen. Aber ich habe meine Subs immer ohne Verlängerung gemacht.Ich will natürlich jetzt nicht sagen, dass ihr eure Subs ohne Verlängerung machen sollt.Also Subs mit Verlängerung ist natürlich das beste, was es überhaupt gibt. Da könntihr nicht vergessen zu suppen. Aber ich habe meine Subs immer ohne Verlängerung.Du hast mich spontan entdeckt. Das finde ich nice. Was ich an sich auch wirklich coolfinde, ist, dass mittlerweile relativ viele Leute hier sind, die eben nicht über YouTubegekommen sind. Ja, das kann sein, dass das automatisch drin war. Aber man kann es aufjeden Fall auch machen, dass es nicht automatisch ist. Ja, das finde ich wirklich nice. Es sindmittlerweile viele Leute, Stammzuschauer da, die es eben nicht über YouTube kennen. Wasauch der Grund ist, warum ich mich nicht so genannt habe wie auf YouTube. Ja, natürlichsind viele hier von YouTube. Aber es gibt auch viele, die sind nicht von YouTube. Haha,Reilly, das ist natürlich geil. Wolltest du gleich mal den Imposer hier... Imposer? Heißtes Imposer? Imposter? Imposter? Imposer? Wie heißt denn das? Englische Vokabel in 2K19.Könntest du dir vorstellen, Technikvideos für YouTube zu machen? Eine sehr gute Frage,die ich mir vorgelegt habe. Ich habe mir nämlich schon Anfang des Jahres, oder eigentlichDezember letzten Jahres, überlegt, was kannst du auf YouTube machen, was dir selber gefällt,was den Leuten auch gefällt, ohne dass du jetzt quasi einen neuen Channel machen musstund ohne dass du den alten Kram komplett über Bord schmeißen musst. Dann bin ich zu demSchluss gekommen. Ich könnte tatsächlich mehr Technikvideos machen. Ich bin mir nicht ganzsicher, in welcher Art und Weise. Ich werde weiterhin, wenn es Games gibt, die mich interessieren,was machen und auch weiterhin Labervideos zu allen aktuellen Themen. Allerdings würdeich gerne Technikvideos machen. Ohne mich jetzt direkt vor die Kamera zu setzen, allerdingsauch mit Kamera, um was zu zeigen. Aber ich meine, bei Technikvideos ist das nicht so wild.Da machst du die Kamera schräg hinter dich und zeigst es halt auf dem Tisch. Da mussich noch gucken, wie ich das mache. Da muss ich mir hier eine Ecke hinstellen. Da mussich mir irgendwie eine Ecke einrichten mit Tisch. Vielleicht einen Queenscreen dahinter,dass man auch mal einen schönen Hintergrund machen kann. Noch ordentlicher Beleuchtung.Und genau, so machen wir das. Dann flashen wir Katja Krasavitz das Vibrator. Das istdiese Idee, ey. Alter. Das wird bestimmt sowas von steil gehen. Dann müssen wir Clickbait-Überschriftmachen. Computer-Nerd entdeckt geheimen Trick. YouTuber hassen ihn dafür. Irgendwie sowasin der Richtung. Max-Tech-Tipps. Naja, das wäre fast schon ein bisschen zu kopiert.Aber von der Idee her, würde ich da schon gerne mehr Videos machen. Weil es gibt, ichhab's ja am Anfang schon mal gesagt, es gibt relativ viele Videos, die sich im Chrome mitTechnik beschäftigen auf YouTube. Ich hab allerdings den Eindruck, dass es da oftmals,wie soll ich das sagen, das kratzt an der Oberfläche. Allerdings auch, weil das gewolltist. Ich will den meisten Leuten gar nicht mal unterstellen, dass ich es nicht bessermachen kann. Die meisten YouTube-Zuschauer wollen das ja auch gar nicht großartig detailliertwissen. Oder aber es werden nur Smartphones gezeigt oder Tablets gezeigt. Oder was auchbei den Technik-Channels in letzter Zeit voll im Trend ist, da zeigen wir irgendwiedie Handys und danach, da zeigen wir Autos und sowas auf einmal, wo ich mir denke, okay,das hätte ich jetzt eigentlich auf solchen Channels nicht vermutet. Aber Autos werdetihr bei mir wahrscheinlich nicht sehen, ihr wisst, dass das nicht wirklich mein Themaist. Aber ich werde wahrscheinlich versuchen, also wenn es so hinhaut, wie ich mir das vorgestellthab, danke Roffel1436 Twitch Prime. Übrigens Leute, wer ist sein Amazon-Account? Sein AmazonPrime-Account noch nicht mit Twitch verknüpft hat, das ist seit, glaube ich, zwei Jahrenmöglich. Man bekommt kostenlose Drops dafür in seinen Twitch-Account und man kann denStreamer seiner Wahl kostenlos einmal im Monat mit einem Twitch Prime-Sub unterstützen. Sellout-Modusactivated. Danke für die Subs. Le Kickpuncher, Tynesaur, jetzt, oh, oh, der Sellout hautrein, jetzt geht's ja Schlag auf Schlag hier. Redest du eigentlich wirklich über TwitchPrime oder spielst du das Snippet nur mit dem Meme-Tool ab? Das müsste ich echt machen,ich müsste mal so meinen besten, meinen bestmöglichen Sellout aufnehmen und den einfach immer wiederabspielen. Wie gesagt Leute, heute gibt's einfach nur, machen wir einfach nur ein bisschenLaberstream, wenn ihr irgendwelche Fragen habt, ich könnte mich im Prinzip fragen,was ihr wollt, aber, oder Technik, sonst was, ist mir egal, ihr könnt mich alles möglichheute fragen. Wir machen noch ein bisschen Laberstream und morgen flashen wir dann denStaubsauger. Brauchst du noch ein Twitch Prime-Logo fürs Meme-Tool? Stimmt, brauche ich, das kannich ja immer einplanten, wenn ich meinen stündlichen Sellout mache. Was wollte icheben noch sagen? Technik-Videos auf YouTube, genau. Wie gesagt, würde ich wirklich gernemachen und wenn das so klappt, wie ich mir das Ganze vorgestellt hab, dann will ich dasso machen, dass das schon einen relativ guten Detailgrad hat, dass man auch was mit anfangenkann. Zum Beispiel, würde ich gerne mal ein Video drüber machen, wie man, wenn man zumBeispiel, für sein Heimnetzwerk, wie man zum Beispiel sein Heimnetzwerk einrichtensollte, rein von der Einteilung her, dass es eben sicher ist und bequem zu nutzen fürein internes Netz, für WLAN, für einen Gäste-WLAN, für einen China-WLAN, ich weiß nicht,wie es anders nennen soll, für einen Heimautomatisierungs-WLAN und auch was da so ein bisschen dahintersteckt,warum man manche Sachen macht. Es gibt ja Leute, die sind heute immer noch der Meinung,dass es eine gute Idee ist, wenn man in seinem Router DMZ anklickt und es gibt immer nochLeute, die denken, dass DMZ tatsächlich bedeutet, man leitet alle Ports auf die PS4 weiter.Das ist wirklich Pepehands an der Stelle. Das hat damit überhaupt nichts zu tun. Null.Noch nicht mal der Name hat auch nur ansatzweise was damit zu tun. Aber es gibt immer nochLeute, die sind der Meinung, DMZ gleich, ich leite alle meine Ports weiter auf die PS4.Ridi DMZ steht für Demilitarized Zone. Ich weiß gar nicht, wozu. Zumindest was damit gemeintes ist, du hast ein eigenes Netzwerk, wo von außen zugegriffen werden kann, wo von interndrauf zugegriffen werden kann. Allerdings, wo von selber, für die Kisten, die da drinstehen, nicht intern drauf zugegriffen werden kann. Demilitarized Zone. Genau. Gibt es inzwei Varianten, wie man das Ganze machen kann. Es gibt, wenn das hier der Router ist, unddas hier ist der Router, das hier ist das Internet, das ist das Internet der Netzwerk, dann istdie eine Sache, die man ganz gerne macht für eine DMZ, ist, dass man die quasi als eigenesNetz hier daneben stellt, dass man hier daneben stellt. Das ist ganz unsicher Internet, dasist ganz sicher intern das Netzwerk und zugegriffen werden darf von da nach da, von da nach da,von da nach da, meistens zumindest, muss nicht unbedingt sein. Allerdings, es darfnicht hier zugegriffen werden. Das ist nicht erlaubt. Das benutzt man dafür, wenn manzum Beispiel eine Minecraft Server anbieten will, wenn man Minecraft Server bei sich daheimhinstellen will, oder eine Website hosten will, oder vielleicht einen VPN braucht, oder sowas,alles mögliche kann man das verwenden. VPN braucht man noch ein bisschen wer, Firewall,oder eine andere Beischaltung dann. Die zweite Variante sowas zu machen ist folgendes, alsohier ist der Router in der Mitte, und die zweite Variante sowas zu machen ist, Eingangsrouter,wir nennen das mal Eingangs-Firewall, interne Firewall, hier ist Internet, hier ist intern,und da ist die DMZ. Das ist eigentlich fast schon die klassischere Variante, da brauchstdu halt zwei Router, beziehungsweise, eigentlich brauchst du zwei Firewalls für Router, müssensie unbedingt sein. Also eine Router allein bringt dir nichts, du brauchst auf jeden FallFirewalls dazwischen. Also eine Router brauchst du, weil das sind unterschiedliche Netze,das ist auch eine Variante, das zu machen. Dann machst du Portweiterleitung, machstdu Portweiterleitung von hier nach hier, die dürfen auch raus, wie gesagt meistens, unddu machst Firewall-Freischaltung hier dazwischen. Und alles was von hier kommt, darf dann halthier nicht weiter. Das ist die andere Variante sowas zu machen. Ja, und es denken heute Leutenoch, dass DMZ bedeutet, man leitet alle Ports auf die Playstation weiter oder sowas. Dasist ein unglaublicher Fail, das hab ich vor acht Jahren auf YouTube schon erzählt, unddie Leute glauben das immer noch. Paint ist beste. Weitere Softwaregeheimtipps, oh ja,kann ich machen. Beatbrod fragt, du, warte mal, ich zeig das mal hier in meinem, dafürhaben wir das doch. Beatbrod fragt, du meintest ja man kann fragen was man will. Ich habemit meinem Raspberry Pi ein Netzwerk zu WLAN-Brücke gebaut. Allein ist schon mal huge brain. Jetztkann sich der Pi nicht mehr ins Internet verbinden, aber ich kann mich über LAN auf den Pi verbinden.Außerdem kann beim booten DHCP, DHCP, achso, DHCP Klein, nicht gestartet werden. Hastkeine Idee woran das liegen kann. Es kommt ein bisschen drauf an wie du das gebaut hast.Also ich vermute mal, dass das folgendermaßen funktioniert, dass der Raspberry sich im Klein-Modusins WLAN verbindet und du das dann gepridged hast. Also du lässt den Raspberry sich insWLAN einwählen. Ne, Sebaro, ich glaube nicht, ich glaube er hat was anderes gebaut. Du hastden Raspberry sich per WLAN als Client am Access Point anmelden lassen und hast danndein ETH0 mit WLAN gepridged, oder? Der Raspberry ist am LAN dran. Achso, also hast du doch einAccess Point gebaut. Achso. Das sind unterschiedliche Netze, hoffe ich mal, oder? Willst du das gleicheNetz da und da haben, oder willst du unterschiedliche Netze haben? Du willst unterschiedliche Netzehaben, dann musst du auf jeden Fall schon mal einstellen, dass das IP Traffic weitergeleitetwird aus dem Kernel aktivieren, dass das funktioniert und ja, wenn du die gleichen Netze haben willst,musst du das pritschen. Wenn das das gleiche Netz sein soll, musst du das pritschen. Oderweiß ich gar nicht, doch der Raspberry kann das. Also das ist einfach, ich habe mich nochnie gebaut mit einem Raspberry, ich vermute mal das dürfte relativ einfach sein. Du sagstdeinem WLAN, du willst das Ganze im Access Point Modus betreiben und dann müsstest dueinfach dein Netzwerk mit dem WLAN pritschen und dann ist gut. Habe ich noch nie gebaut,aber was ich dir empfehlen kann ist, bau das Ganze nicht selbst, sondern verwende, es gibtnämlich ein Projekt, was dein Raspberry Pi zum Access Point macht. Verwende das hier.Verwende einfach das hier, das macht das für dich. Das hier kenne ich nicht, was der daausgespuckt hat. Verwende einfach das hier. Dann hast du nämlich gleich noch ein schönesWebinterface dazu und das macht dein Raspberry Pi zum Access Point. Man kann das selbstbauen, aber ich meine, man muss ja nicht unbedingt, es sei denn, man interessiert sich dafür,wie es technisch umgesetzt wird, das ist kein Ding, klar. Aber wenn man einfach nur will,dass es funktioniert, dann würde ich sowas nehmen. Und das richtig schöne daran ist,du kannst halt hier die komplette Config einstellen, du kannst das Ding als Repeater verwenden,als Access Point verwenden, als was auch immer, sogar als rein klein kannst du dasGanze verwenden, kannst updaten über das Webinterface, du hast sogar noch DHCP drauflaufen. Dann nimm das hier, das ist schön, das ist gut. Und hat auch richtig schönesHexworth-Themen, wenn man das will. Das ist gut. Allerdings finde ich den Raspberry ansich jetzt nicht unbedingt der beste Access Point, liegt allerdings schon daran, dass dasDing nur eine On-Board-Antenne hat. Kann man den Pi eigentlich auch als Mesh-Deviceeinbinden? Warum nicht? Ich habe noch keine Gedanken zugemacht.Was ist denn der Unterschied zwischen einem Container und einer VM? Da muss ich mal gucken,da gibt es bestimmt schöne Bildchen zu. Ich suche mir mal ein schönes Bildchen raus unddann kann ich was zu erzählen. Das sind grundsätzlich zwei komplett unterschiedliche Dinge.Das scheint mir ein ganz sinnvolles, das scheint mir ein ganz gutes Bild zu sein. Allerdingsso wirklich schön zum erklären. Ist es nicht? Also ganz einfach gesagt, wir müssen uns dreiFälle angucken. Man lässt einen Prozess direkt auf dem Host laufen, man lässt einen Prozessim Container laufen oder man lässt einen Prozess in einer VM laufen. Es gibt zwischen den erstenbeiden Fällen kaum einen Unterschied. Wenn du deinen Prozess in einem Container ausführst,ist das im Prinzip exakt das gleiche, wie du führst deinen Prozess auf dem Host aus.Außer, dass es im Container ein paar Sandbox Maßnahmen gibt, die den Prozess vorgaukeln,dass er manche Sachen sieht und nicht sieht, die er sehen würde, würdest du ihn direktauf dem Host ausführen. Der Container hat exakt den gleichen Container wie der Host,das heißt du kannst den Containern beispielsweise auch keine Container-Module nachladen odersowas in der Richtung. Im Prinzip ist ein Container nichts weiteres wie ein bisschenkernel Sandbox, wie ein bisschen Software Sandbox um einen Prozess. Fertig. Es gibtkeinen Unterschied so richtig zwischen einem containerisierten Prozess und zwischen einemProzess, den du direkt auf dem Host ausführst. Ganz im Unterschied zu einer VM. Eine VM istkomplett virtualisierte, quasi emulierte Hardware. Das einzige was da halbwegs echtdrin ist in einer VM ist die CPU und das auch nur aus Performance Gründen. Die Grafikkartedie die VM sieht, ist eine komplette Grafikkarte nachgebaut in Software. Die Soundkarte isteine komplette Soundkarte nachgebaut in Software, die dann unten drunter von der Virtualisierungssoftwareirgendwie auf das Hostgerät gemapt wird, aber das sieht die VM nicht. Du kannst auchin der VM eine komplett andere CPU vorgaukeln. Du kannst beispielsweise nicht so ohne weiteresauf Geräte zugreifen, die im Host drin sind von der VM. VM ist quasi ein komplett emulierter,virtualisierter Rechner und das Betriebssystem da drin sieht auch nur das. Das Betriebssystemin der VM ist eine komplett eigenständige Installation mit eigenständigem Kernel undallem und hat auch keine Ahnung auf welchem Host sie drauf läuft. Der Container schon.Der Container ist kein eigenes Betriebssystem, keine eigenständige Installation. Es ist einfachnur ein bisschen gesandboxter, bisschen besser gesandboxter Prozess auf dem Host drauf.Ist es bei Containern im Vergleich zur VM leichter auszubrechen? Ja auf jeden Fall.Haben wir das verstanden, Void, Danny? Flow690, danke für den Sub. Ich glaube, du hast jetztgesehen, die anderen habe ich alle. Es ist huge Pog. Ich habe jetzt schon, also wennich das hier so sehe, das ist so krass, man hat hier in Steamlabs so eine Historie mitden letzten Subs. Ich habe so viele Subs schon heute gekriegt, danke euch, dass das mehrist als die erste Vorschau-Seite von Steamlabs überhaupt anzeigen kann. Also ich kann jamal gucken, wieviel die Seite anzeigen kann. 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,14, 15, 16, 17, 18, 19, 20, 21 kann maximal die Steamlabs-Seite anzeigen hier und dasheißt, es sind sogar noch mehr. Richtig krasser Shit. Void, Danny, wozu du den Container überhauptbrauchst? Das ist eigentlich relativ einfach erklärt, wenn du nicht die Vollvirtualisierungvon der VM brauchst, also sprich, wenn du nicht darauf angewiesen bist, dass dein,oder ich muss, vergiss das, ich muss anders anfangen. Wenn dein Hausbetriebssystem ausreichtfür das, was du ausführen möchtest, wenn der alles hat, was du ausführen willst undwenn du keine speziellen weiteren Sicherheitsanforderungen hast, die eine VM notwendig machen, würdeich einfach immer den Container nehmen. Zum Beispiel hast du einen Linux-Host und möchtestWindows-Software ausführen, dann geht das nicht den Containern, weil Windows ist eineigenes Betriebssystem. Da musst du voll virtualisieren, VM und Windows drin installieren,in der VM. Windows denkt dann, es läuft auf einem eigenen Rechner und ist zufrieden. Wenndu beispielsweise einen FreeBSD ausführen willst, also auch wieder ein anderes Betriebssystem,dann musst du das in der VM machen. Du kannst keine FreeBSD-Sachen direkt unter Linus ausführen.Ich weiß, dass es da theoretisch Sachen gibt, aber erstmal nicht. Sprich, wenn du Programmefür andere Betriebssysteme ausführen willst, dann brauchst du eine komplett eigene VM.Ist ja irgendwie logisch. Oder wenn du sagst, ich will meine Software besonders gut abschotten,isolieren, dann brauchst du auch eine VM. Wir hatten doch eben das Thema DMZ. Ich habemeinen Host irgendwo stehen mit Linux drauf und möchte jetzt einen Minecraft-Server anbieten.Da mache ich auf meinem Router eine DMZ an, mache Firewall-Freischaltung. Den Minecraft-Serverwürde ich nie im Leben als Container laufen lassen. Warum nicht? Weil der Minecraft-Serverdann quasi direkt auf dem Host laufen würde mit ein bisschen Sandbox drumherum. Und ichmöchte ja ein eigenes Netz für meine DMZ haben, was sicherheitstechnisch abgeschottetist vom Rest. Und nachdem der Host-Rechner nicht in der DMZ steht, sondern wahrscheinlichin dem Management-Netz oder vielleicht sogar bei mir intern, mache ich da eine VM und macheda den Minecraft-Server drin. Und dann bin ich relativ sicher, weil ja der Minecraft-Serverin der eigenen VM läuft. Das heißt selbst, wenn irgendjemand, irgendeine krasse Hexermeinen Minecraft-Server hackt in der DMZ, weil er kann da von außen drauf zugreifen,ist das erstmal kein Problem für den Host unten drunter. Also ich würde eine VM immerdann nehmen, wenn es securitymäßig erforderlich ist oder wenn ich Sachen ausführen will,die ich nicht auf meinem Host ausführen kann. Eben zum Beispiel, weil es ein anderes Betriebssystemist oder spezielle Kernel-Module braucht. Irgendwas, wo der Host halt nicht dafür geeignetist. Kommt man eigentlich aus einer VM raus, also realistisch gesehen? Theoretisch schonpraktisch nicht. Waren wir was anderes, Open Hub oder Home Assistant? Home Assistant, ausdem Grund, weil es finde ich das bessere Web-Interface hat, es in Python ist und nicht Java.Was ist denn mehr für Multithreading geeignet, wenn man einen Single Thread Service laufenlassen will? Also meinst du, was ist mehr geeignet, Container oder VM? In der Regel,wenn es wirklich auf rohe Performance ankommt, um jeden Prozent Punkt, dann Container, allerdingssind die Unterschiede rein CPU-mäßig zwischen dem Container und der VM. Es ist jetzt nichtso, dass das doppelt so schnell wäre oder so. Das ist nicht so großartig. Der großeUnterschied zwischen Container und VM, würde ich sagen, liegt hauptsächlich im RAM-Verbrauchund im Speicher-Verbrauch an sich. Container braucht keinen Speicher, braucht kaum extraRAM, so gut wie nichts. Oder vor allem schon. Meine VM muss ein komplettes Betriebssystemlaufen lassen, allein schon. Deswegen braucht es mehr RAM. Ne, VM hatte ich nie. So, Pepegahat das Wort aufgemacht. Haben wir beantwortet. Spackt mein Tool. Ah ne, der Beatbrot hatdas gerade eben wirklich gefragt. Kubernetes ist wieder ein bisschen anders, an einer anderenStelle angesetzt. Kubernetes ist an sich keine Virtualisierungslösung und auch keine Container-Softwarean sich. Das ist ein Container-Management-Suite. Was sagen die eigentlich selbst zu sich?Ja, genau. Es ist ein Open-Source-System zur automatisierten Bereitstellung, Skalierungund Verwaltung von Container-Anwendungen. Was du damit machen kannst, ist zum Beispielmal angenommen, du hostest irgendwas. Die selber sagen immer orchestrieren. Ich findeauch orchestrieren ist erstmal ein bisschen ein doofes Wort, aber das trifft es tatsächlichganz gut, weil es geht darum, dass du, wenn man sich mal so ein Orchester vorstellt, esgeht schon eher bei Kubernetes um das Dirigieren von Containern, als um das einfache, ich erstellemir einen Docker-File und starte einen Container. Ja doch, das trifft es eigentlich ganz gut.Kubernetes dirigiert das Ganze eher. Du hast dann schon verschiedene Files, die die Konfigvon einem Container beschreiben. Allerdings, wofür Kubernetes zum Beispiel, ja, stelldir vor, du hostest irgendwas und Kubernetes ist auch nicht das Einzige. Aber stell dirvor, du hostest irgendwas. Du hast eine Web-Anwendung und du hast diese Web-Anwendung auf Kuberneteslaufen. Was du damit zum Beispiel machen kannst, ist, du kannst wunderbar skalieren, je nachdem, wie viele Benutzer darauf zugreifen. Was natürlich besonders toll ist, wenn dudeine Anwendung gar nicht mal bei dir laufen lässt, sondern vielleicht in Azure oder beiGoogle oder bei Amazon. Das ist natürlich besonders cool, weil du willst natürlichnicht bei Amazon 50 Notes kaufen für eine Anwendung nachts um drei, wo keiner draufzugreift. Aber du möchtest vielleicht, wenn irgendeine News-Site über deine Anwendungberichtet hat, möchtest du vielleicht ja auch alle Nutzer, die dann auf einmal aufdeine Seite aufmerksam werden, möchtest du dir die ja vielleicht alle auch abfackelnkönnen. Und dann kannst du dynamisch skalieren lassen, indem du einfach noch 20 neue Containerhochfährst. Alter, Flow690, was ist jetzt los? Huge! Der Flow690 verschenkt 1, 2, 3,4, 5, 6 Abos und zwar an PC Lustig, an Shadow 00, an Quay 1, an Capasco und an allen Calypto.Flow690 wird das random ausgewählt oder wie funktioniert das, wenn man giftet? Muss mandie Leute von Hand auswählen? Ich hab noch nie gegiftet. X-Shadow-Ghost, danke fürden Sub. Ach du hast gerade gefragt, ab wann man suppen kann, ab vor seit einer Stundeoder so. Ach kann man beides machen, ok. Huge! Pock! Ultra nice. Fulltime Streamer, wenn.Aber wenn mit 3000 Euro im Monat bezahlst. Dann Fulltime Streamer, easy. Leute, wir habenuns, wir haben uns letztens bald aus Spaß auf der Arbeit tatsächlich überlegt, ob wiruns nicht SysAdminTV Domain registrieren können oder Twitch-Account erstellen und da habenwir festgestellt, das geht nicht, weil du nichts erstellen darfst mit TV drinnen. Sonst hättenwir hier, nein, wir hätten nie von der Arbeit gestreamt, Blödsinn. Aber wir haben es ausSpaß überlegt, ob das nicht sogar möglich wäre. Rekfress, danke für den Sub. Ok,vielleicht, ich mach mal kurz, warum hab ich, warum haben meine Follower eigentlich denPapagei, den Papagei als, als Emote und Subs haben den Zombie. Noch mehr Subs, das istja huge heute. Hawks, danke für den Twitch-Prime-Sub. Huge Prime aller Leute heute hier. Ähm,BeatBot, das hab ich mir sogar schon mal aufgeschrieben, das hab ich vor einzubauen. Er schreibt, mankönnte ja mal nen Bot bauen, der dem Chat erlaubt Memes vor Memetool zu triggern. Habich mir schon überlegt, gibt es übrigens schon fix und fertig, ne, müsste man eigentlichgar nicht einbauen in das Tool, aber das hab ich mir schon aufgeschrieben, als das eingebautwird. Max, verkaufst du Badewasser? Ja, demnächst geh ich in den kompletten Sellout-Modus über,da wird alles verkauft. Badewasser, benutzte Socken, alles. Alles wird verkauft. Dreck vonder Tastatur, Krümel aus der Tastatur, ähm, keine Ahnung. Abgekratztes Zeugs vom Handy,alles, man kann heute mit allem Geld verdienen. Haar, ich war gerade beim Friseur. Vor dreiStunden war ich beim Friseur, hätt ich mal mitnehmen sollen. Keks, Krümel, alles, Essensreste,das wird jetzt ausgeschlachtet bis zum Letzten. Wann kommt das Gentoo Walkthrough, wenn ichanfange Gentoo zu verwenden? Wohnt der Friseur nicht im Osten? Doch, ich war nicht beim Friseur,ich war nur beim Friseur. Kennste die Hornbach Werbung mit den Asiaten? Ne. Ähm, ich musserst mal gucken, wie ich in Steamlabs einstellen kann, dass meine Subscriptions den Papageibekommen. Moment, wir testen das jetzt mal. Kommt jetzt der Papagei? Haar, hat es nichtgespeichert, haar? Hat es das nicht gespeichert? Will das der Papagei kommt, wenn einer subscribt?Save. Haar, ich weiß warum nicht. Leute, ich muss euch kurz ausmachen. Der Link stimmtnicht. Der Link stimmt nicht. Jetzt stimmt der Link. Mal ausprobieren, ob es jetzt funktioniert.Haar. Heute nur Laberstellts, heute nur Laberstellts, ich hab nix geplant. Morgen wird der Staubsaugergeflasht. Wobei wir bräuchten auch ein besseres Subgif. Ah Leute, ich muss mir was überlegen.Was könnte man als schönes? Was könnte man als schönes Subgif nehmen? Ich probier malwas aus. Follows, Subscription, Upload, Select, Save. Ok, um, ob es jetzt funktioniert? TestSubscription, Moment. Ah, so ist es doch schon besser, oder? Da gibt es bei Follows den normalenParrot und bei Sub gibt es dann den Party Parrot. Hast du den Link gesehen? Nee, hastdu den Link? Meinung zu Windows Sandbox. Ist das jetzt irgendwas neues, was ich noch nichtkenne? Oder ist das die übliche Geschichte mit MP Engine, Virenscanner, oder ist daswas Neues, Tynesaw? Wenn das was ganz Neues ist, dann sagt es mir nichts. Dann hab iches mir so nicht angeguckt. Die Subcatch Idee, du machst ein virtuelles Tamagotchi in dieEcke und es wird nur gefüttert, wenn gesubbt wird. Subt, keiner droht es zu sterben. Oh,huge. Das ist hier Leute, man. Das muss ich mir aufhören. Das programmieren wir im Streamdann. Das programmieren wir im Stream. Der Keks muss gefüttert werden, sonst geht derimmer mehr kaputt.Alter, ist der Hornbachclip abartig. Was heißt denn bitte schön Flashen, neue Softwareauf dem Gerät drauf kopieren. Neue Software auf dem Gerät drauf kopieren. Hast du denLink gesehen? Ja, hab ich. Was für einen Switch oder allgemeinen Hardware würdest duempfehlen? Genau, was für einen Switch oder allgemeinen Hardware? Ich muss jetzt mal kurzschauen. Ich hab immer noch OBS im Bild. Ups, fail. Okay, jetzt hab ich den Chat wiederruntergescrollt. Das ist gerade zu viel. Genau, ich wollte das hier vom Horx. Also, was füreinen Switch oder allgemeinen Hardware würdest du empfehlen, wenn man sich LAN in sein Zimmerlegen möchte? Und damit man auch mal ein wenig rumspielen kann. Router besitze ich bzw.meine Eltern eine Fritzbox. Was meint ihr mit rumspielen? So ein bisschen Netzwerkkramsausprobieren und lernen. Also für Netzwerkkrams zum Lernen, wenn man sich dafür interessiert,kann ich eigentlich auch nur das wiederholen, weil ich sonst immer wiederhole, holt euchMikrotik Sachen. Mikrotik Sachen sind günstig, verbrauchen wenig Strom, haben ordentlichePerformance für das Geld und sind an sich ziemlich gute Hardware. Holt ihr was kleinesvon Mikrotik? Ich meine, du brauchst eigentlich ja nicht wirklich einen Switch. Wenn du nurden Rechter anschließen willst, kannst du auch direkt eine Fritzbox machen. Wenn dunoch mehrere Geräte hast, dann lohnt sich das natürlich. Dann würde ich was von Mikrotiknehmen. Da würde ich hier irgendwie zum Beispiel den da. Das ist jetzt kein reiner Switch,das ist eigentlich ein Router mit einem 5-Port-Switch. Ist aber sowohl von der Hardware, die drinnenist gut, das Betriebssystem, was drauf ist, ist super umfangreich. Also wenn man netzwerkmäßigwas lernen will, sind die Dinge sehr gut. Und kostet auch nicht so viel. Die Lite-Variantekostet 50 Euro, der eine kostet 70 Euro. Das ist natürlich viel mehr als du brauchstletztendlich. Geht eigentlich mit der Musik gerade ab. Es sind im Endeffekt mehr Sachenals du brauchst, hat der Gigabit, klar. Es sind letztendlich mehr Leistungen als du brauchst,ja. Aber du kannst auch mal ein bisschen rumspielen mit unterschiedlichen Netzen, mit WLANs undso. Das ist halt mit einem, also unterschiedliche Netzen und Routen ist halt mit einem reinenSwitch. Also mit einem reinen Switch geht es gar nicht. Hast du einen ein bisschen modernerenSwitch, geht es aber. Die mögen alles andere als Switchen meistens nicht, performanstechnisch.Und hier kannst du also zum Ausprobieren finde ich generell auch zum Netzwerkzeug lernen,ist das das beste Gerät was es gibt, wenn es erschwinglich sein soll und man es auchsinnvoll einsetzen will. Man kann sich auch alte Cisco-Dinger kaufen, wenn es einem wirklichum die Hardcore-Netzwerkgeschichte rein zum Lernen geht. Das Problem ist allerdings,dass die Cisco-Dinger, die alten, nur zum Lernen taugen. Die will man sich nicht daheimhinstellen. Die sind laut, die verbrauchen viel Strom und oftmals sind die auch von derPerformance her so letztes Jahr tausend, dass die oftmals nur 10.000 haben. Oder aber wennsie schon moderner sind, dann sind sie ziemlich teuer auch gebraucht. Das heißt, ich findeman kann mit dieser MikroTik-Geschichte kann man wirklich nichts verkehrt machen. Das istder beste Übungsrouter, von dem man auch was hat. Und fünf Ports reichen einem normalerweiseja auch. Und die Ports sind nicht einfach nur per CPU geswitcht, da ist auch ein Hardware-Switchdrin, also man hat auch ordentliche Switching-Performance. Huge Sub! Jetzt muss ich erstmal warten bisda steht wer es ist. Wer ist es? Melodize! Nice! Danke für den Sub! Twitch Prime! Sojetzt muss ich erstmal in mein Tool gucken, was ich da wieder alles übersehen habe. Dankefür's Zuschauen, es war sehr schön. Also wirst du auf jeden Fall viel Spaß dran haben. Du hastden, den ich empfohlen habe, bestellt. Dir habe ich nicht den Hex PoE empfohlen, dir habeich den 24-Port, den CRS 8-2, CRS 3-2-8, 3-2-6 empfohlen, ne? Was war bisher das beste Videoaus deinem Discord? Boah, weiß ich nicht gerade. Kam mit Windows 10 Build 1903 oder so, isteine VM die mit Windows mitgeliefert wird, ist bei der deutschen Sprache derzeit einbisschen RIP, keine Ahnung wie wir es mit... Was gibts das? Sandbox? Wie heißt das? Wasmuss ich ausführen? Windows, Sandbox, hab ich noch nie gehört. Windows Sandbox aktivieren.Deskmodder.de klingt schon mal super vertrauenswürdig, die Seite. Ok, wie verwendet man das? Systemsteuerung,Suche, Einstellungen, Apps, was? Ach man muss das über Features hinzufügen machen. Ok,machen wir mal. Sandbox, ne, äh, Feature, add, turn on Windows Feature, oh ne jetzt istOBS wieder kaputt, ne? Moment Leute, OBS geht wieder. Geht OBS wieder? Ja, geht wieder.Sandbox, ach was muss man suchen? Programme und Features. Windows Sandbox heißt das auchnoch. Windows Sandbox, enable dependency required to run Windows Sandbox Scenarios.Ähm, wisst ihr ob man neu starten muss nach der Installation? Wenn man neu starten mussmache ich es lieber in der VM, wobei eine VM in der VM, das wird wahrscheinlich in derWindows nicht richtig funktionieren. Ja muss man das scheiße, da kann ich das nicht ausprobieren.Ne, wir können zwar mit nested Virtualisierung ausprobieren in VM, da bin ich mal gespanntob das funktioniert. Leute, das probieren wir jetzt mal aus. Wir virtualisieren Windowsin Windows in Windows. Was sind die richtige VM? Das da, das da, das da. Ich glaube dashier. Wie viele VMs in einer VM hast du schon mal aufgesetzt? Ich hab mal ESX in VM inWorkstation installiert und dann in ESX. Wait, warte mal. Warte mal, ne ne ne, wie war das?Genau, und dann in ESX in Linux, das hat funktioniert. Ähm, was ich auch mal gemacht hab, ich habeinen Windows Server installiert unter VMware Workstation und darin dann, ähm, und darindann Hyper-V und darin dann noch ein Windows, weil ich testen wollte wie das mit RemoteDesktop 3D Beschleunigung mittlerweile ist. Hat natürlich nicht richtig funktioniert.Ist das nicht ein bisschen viel RAM? Naja, wenn man nichts macht braucht der Kram auchnicht so viel RAM. Okay, dann probieren wir das jetzt mal aus. Da ist noch der Kram vomletzten Mal offen. Close, close, close, close, on KS. Okay, wir machen, wir machen die Firewallmal wieder on. Probieren wir mal aus. Wir probieren das jetzt mal aus. Feature, Feature,add, sehen wir das, add Feature und dann Windows Sandbox. Was? No Virtualization Capabilities.Dann müssen wir Windows mal ausschalten. Jetzt mal den Big Brain Play überhaupt. Wirschalten Windows aus und schalten Nested Virtualisierung ein. Wenn ich mich dran erinnernkönnte wo das geht, da. Äh, den Rest virtualisieren wir mal nicht. Und jetzt können wir auchin der VM VMs anlegen. Big Brain. Inception, ja. Stripes, es ist überhaupt kein Ding.Kann jeder hier auch zugucken, sich einbringen und ohne, ohne zusammen. Ja, das ist überhauptkein Ding. Subskribieren. Okay, mal gucken ob es jetzt funktioniert. Add Feature. Findetihr das eigentlich auch so lächerlich? Für alle denen das schon aufgefallen ist, dassman unter Windows standardmäßig kein Telnet hat, sondern dass man um Telnet zu installierensagen muss Turn Windows Features on und off Telnet Client. Was macht Intel VTD eigentlich?Das ist ja eben die Hardware Virtualisierung. Guck hier, Bam, Sandbox kann installiert werden.Der Sebaro. Der Sebaro. Stripes 007. Der Sebaro ist schon echt ein netter Typ, ne?Restart. Jawoll. Übrigens, jetzt wo wir gerade bei Telnet sind, habe ich euch eigentlichdas hier schon gezeigt. Machen wir mal Vorlesung aus. Habe ich euch das hier schon gezeigt.Telnet. Parrot. Live. Gibt es gar nicht mehr. Gibt es es nicht mehr. Das gibt es nichtmehr. Das gibt es nicht mehr. Try it. Mit Curl. Ach, mit Curl ging es nicht mit Telnetauch. Hey, da ist es. Man musste es Curl und nicht Telneten. Da ist er. Ich dachte manmusste es Telneten, aber man musste es Curl und das reicht. Man musste es Curl und dasist auch so ein total beknackter Satz. Okay, ähm, was macht unsere Windows in WindowsInstallationen? Ah, ist neu gestartet. Nur als Vorwarnung, wenn dein Windows jemalsals Sprache was anderes als Englisch hatte, wird das nicht funktionieren. Nein, hat eszum Glück nicht. Towerblinken, Lights, NL. Keine Ahnung, ob es das noch gibt. Okay undwie geht es jetzt weiter? Sandbox. Windows Sandbox, da ist es. Yes. Und jetzt? Nee,ich habe gerade die Seite aufgemacht, die ist 40404. 404 oder ist es DNS? Not found.Nee, da ist 40404. Da probiere ich das mal aus kurz. Was macht das jetzt noch was? Machtdas jetzt noch was?Und du? Ach doch, gibt es noch. Ach, das ist das ASCII Star Wars. Ähm, wer hat esgeschrieben? Das ist das ASCII Star Wars. Genau, ja, das kenne ich noch. Kann es sein,dass die Nested vor allem nicht mehr Hardware beschleunigt, virtualisiert? Ja, höchstwahrscheinlichnicht. Also mit ordentlicher Oberflächen beschleunigt. Guckt mal Leute, Windows in Windows, ichmeine es ist lahm as fuck. Ihr seht es ja hier. Aber ich meine, das ist mal Meta, oder? Windowsin Windows in Windows. Niko Rock, Twitch Prime, Dankeschön. Gibt sogar den Party Parrothier. Na das, ich glaube, das ist weltweite Twitch Premiere. Windows in Windows in Windows.Live auf Twitch. Das gab es noch nie. Was kann man da drin jetzt machen? Einfach irgendwasausprobieren und dann wieder wegwerfen oder wie? Jetzt wird es ganz hart. Jetzt wird esganz hart. Edge aufmachen. Und dann mache ich meinen Stream auf da drinnen. Das istNext Level Shit. Windows in Windows in Windows. Und dann den Stream selbst angucken. Oderdas Oh Homeworld, das ist eine gute Idee. Oder darin, Leute, Next Level Shit. Darininstallieren wir jetzt WSL. In WSL installieren wir Wine. Und mit Wine machen wir Notepadauf. Das probieren wir mal aus, oder? Was sagt ihr dazu? Das müssen wir ausprobieren.Twitch Mason abonniert Stufe 1. Dankeschön. Geht Wine in WSL? Ich habe ehrlich gesagtkeine Ahnung. Boah, ist das lahm. Lahm as fuck, Alter. Wine in WSL. Ich weiß keine Ahnung,ob das funktioniert. Running Wine in WSL. Geht nicht. Time to unsequit on top. Könnenwir auch machen. Welcome to Edge. Geh weg. Cortana. Oder was auch immer. Geh weg. RaspAP hat super funktioniert. Danke für den Tipp. Bitteschön. Nice. Funktioniert. Boah,ist das langsam. Boah, ist das langsam. Boah, das kann man nicht benutzen. Okay. Okay, Leute.Twitch. Wo blort es? As zu wenig RAM, wahrscheinlich. Stimmt vielleicht. Das kann tatsächlichsein, dass ich der VM zu wenig RAM gegeben habe. Wie viel RAM hat die VM? Wie viel RAM?Die können auch ein bisschen mehr RAM verkraften. Die können auch ein bisschen mehr RAM verkraften,die VM. Hier. Ich habe doch gerade oben reingelegt. Woop. Lords. Kann es sein, dass es da nichtdrinnen tippt? Ich glaube, ich glaube, jetzt ist es vorbei. Ich glaube, jetzt ist es vorbei.Jetzt ist Schluss. Toll. Das mag nicht mehr. Das mag nicht mehr. Das ist es vorbei. Okay,wir probieren nochmal was. Wir probieren nochmal was. Power off. Suspend. Wir geben dem Dingjetzt nochmal mehr RAM. Ich will gucken, ob das funktioniert. Wir geben dem Ding jetztnochmal mehr RAM. Wir geben dem jetzt 8. Wir geben dem Ding jetzt 8G RAM. 2 CPUs. Das sollteeigentlich reichen, oder? 2 CPUs. 3. 3 CPUs. Kommt, Leute. Der Rest muss zum Streamen reichen.Der restliche Kern muss für OBS reichen. Nicht 4. Ruggels. Die Grafikkarte. Sound. Sound.Mach mal raus. Printer. Mach mal raus. Alles, was ich brauche, mach mal raus. Display. 1G.Fuck. Okay. Gut. Start. Ach, Moment. Ich habe ja 6 Kerne. Omega 0. Warum weiß Twitch Chatbesser, wie viele CPU-Kerne ich habe, als ich selbst? Wie kann das sein? Warum weiß dasTwitch Chat besser? Ich habe 6 Kerne. Stimmt. Passiert ja nicht. Stimmt. Twitch Chat hatmein PC-Kaufvideo gesehen. Es ist aber nicht nur, ihr habt nicht nur mein Kaufvideo gesehen.Twitch Chat ist ja auch hier, ist ja auch automatisch bei mir immer Q-Chat. Und Q-Chat kennt sichaus. Q-A-F-Chat. Okay, es ist schon mal eine ganze Ecke schneller hier in der VM jetzt.Okay, Sandbox. Yes. Okay, gucken wir mal in der VM zu, was da passiert. Performance.Er ist bei weitem nicht so ausgelastet wie vorher. Gleich Smokersmoke angesagt. Ich sage es euch.Vielleicht kackts ab. Was Sandbox, der da eigentlich so lange rum? Er stellt da jedesMal ein neues Windows-Image, wenn ich die Sandbox starte. Rauchmelder am Start, ja.In jedem Raum 10 Jahre C-Wave Rauchmelder. Inklusive über C-Wave testbare Batteriestand.Hast du die 7 nicht auf 5 GHz laufen? Die erkennen bloß 3,7. Ja, anscheinend läufter auch nur auf 3,7 Grad. Gucken wir mal auf dem Host. Host Performance. 4,9. Die VM erkenntes. Vmg Bailet. VM will es nicht starten. Tja Max, Electronics. Hast du das Fenster aufgehabt?Was ist hier los? Wir haben gerade Windows in Windows in Windows virtualisiert. Ram wirdwieder teurer. Da muss ich jetzt nochmal einkaufen. Ich brauche noch. Also, so. Nochmal so 16G kannich gebrauchen. Hat es eben auch so lange gedauert bis es gestartet ist? War das ebenauch so langsam? Ich meine, der macht ja gar nichts. 3x Kerne, 3x langsam. Das klingtlogisch, ja. Da tut sich ja gar nichts. Wisst ihr was? Mal gucken wie die Ram-Auslastungauf dem Host ist. Naja, da geht noch was. 4,9 von 16G, was willst du denn? Ach nee,sogar nur 14,3 von 16G. Was brauchst du denn so viel RAM? Siehst du, für VM, inner VMund noch VMs nebenbei laufen lassen. Mehr RAM, außerdem ist mehr RAM nie verkehrt.Also, ich hätte schon gerne 32G drinne. Ich habe damals halt kein 32G gekauft, weil dasauch teuer war. Das hat 280 Euro gekostet, als ich den Rechner geholt habe. Aber ichhabe auch so brain dead wieder irgendwelche komischen RGB-Rams geholt. So lange hat esdas erste Mal nicht gedauert, Leute. So lange hat es nicht gedauert. Guck mal, wie man 33%CPU-Last erzeugen kann, wenn man einfach nur den Desktop markiert. Windows, lul. 33% CPU-Lastdurch Desktop markieren. Schafft es erst mal unter irgendeinem anderen Betriebssystem.Guckt euch hier. Wenn ich das in einem Auslastungs-Graf in einem Linux-Server sehen würde, würdeich sagen, den Java-Prozess hat sich aufgehängt oder so. Aber nein, unter Windows ist das einfachdie Maus auf dem Desktop bewegt. Ich glaube, das startet nicht. Ich gucke mal gerade, wieviel der RAM kosten würde, wenn ich mir jetzt noch, wir haben zwar letztens geguckt, aberich habe es schon wieder vergessen. Also, wenn ich mir jetzt noch mal meinen RAM kaufenwürde, dann müsste ich bezahlen. Erst mal gucken, wie mein RAM überhaupt hieß. Wieheißt mein RAM? EESGIL. Hier, da. Da. Amal-Speicher. GIF. DDR4. DDR4 mit Beleuchtung, genau. Trident,die tatsächlich unter nur mit Beleuchtung. Ne, wir machen das jetzt anders. Wir suchennach Zugriffszeiten. Was haben wir hier? CL14. Hä? Wie kann man da nach suchen? Ich habeschon wieder vergessen, wie haben wir denn danach gesucht? Also, es ist auf jeden Fall3200er RAM. RGB. Da. Ist er das? Ne. Das ist er auch nicht. Wo ist mein RAM? Wo ist meinRAM? Da. CL141434. 16er Kit. Das da müsste das sein. Was genau ist der Unterschied zwischenden zwei Dingern? Erkennt da irgendwie einer den Unterschied? Außer, dass der X hintendran steht, aber die Timings sind doch alle gleich. Nur, dass der mit X 10€ mehr kostet.Hab ich denn für ein RAM? Hab ich mit X oder ohne X? Erkennt man von hier nicht, ne? Dochhier. Hier, jetzt hab ich rangezoomt. Erkennt man nicht. Das X steht für besser. Ich habden Geizhals-Link in der Beschreibung. Da guck an. Ich hab den da. Ohne X. Ich habden ohne X, Leute. Ohne X. Gegen das Preisentwicklung öffnen und dann auf alles, ne? Ja, hierhabe ich den Rechner irgendwie geholt, wo es übelst teuer war. Notebooks billiger. Ichfinde den Shop eigentlich ganz gut, habe schon öfters was bestellt. Ich glaube, es wirdmal Zeit für noch 16GB RAM. Ich glaube, es wird Zeit, Leute. Was macht eigentlich unsereWindows-VM? Ich glaube, das geht nicht mehr. Ich glaube, das ist kaputt, Leute. Ich glaube,jetzt ist RIP. Das geht nicht mehr. Windows-VM ist kaputt. Danke für den Sub. XFATAL1337.Richtig Elite. Einfach Windows-Taktik stoppen starten. Hast du mal die Sendbox außen wiedereingestellt? Gerade eben. Zur Hydrant. Powerstart. Party Parrot. Danke für den Sub. Sind nochandere Mods da? Gute Frage, Sebaro. Wenn nicht... Wenn nicht, müsste ich mich mal ernsthaftüberlegen, ob wir nicht vielleicht noch irgendjemanden modden. Notebooks billiger. Was sagt der MaxElectronics?Er sagt, Notebooks billiger ist mega low. Laptop zurück schicken müssen und die habenvier Monate gebraucht, um es überhaupt zu merken und es erst weiter bearbeitet, alsich mit einem Anwalt gekommen bin. Frist setzen. Immer Frist setzen. Immer Frist setzen. Dakönnen die sich nicht rausreden. Leute, ich glaube, das ist tatsächlich das typischeMicrosoft Phänomen. Es geht beim ersten Mal und danach geht es nicht mehr. Da kann ichnichts machen. Diese News. Diese News immer, ey. Das Edge-Icon stimmt. Das ist irgendwieso. Das ist Mini-Edge. Mini-Edge. Mal angenommen. Jetzt mal ganz doofe Frage. So, ich als Win-Ausdruck.Mal angenommen, ich habe die Edge-Verknüpfung aus Versehen gelöscht. Wie kriege ich dieEdge-Verknüpfung wieder hin? Edge. So? Nee. Pin. Suchfeld. Edge. Und dann? Nee. Rechtsklick.Edge start und rechtsklick in die Taskleiste. Und dann? Und dann? Wie mache ich eine Verknüpfungauf den Desktop? Okay. Shift. Shift, rechtsklick in der Taskleiste und dann im Ordner eröffnendas Edge-Icon erstellen. Shift, rechtsklick. Du musst die App ans Startmenü anheften.Okay, okay. Aber im Startmenü geht es auch nicht. Guck. Edge. Okay. Pin from start. Edge-Browser.Ah. Alter, ist das umständlich. Warum ist sowas einfach so kompliziert? Und warum kannich es darüber ziehen und darüber nicht? Kann ich es darüber ziehen? Auch nicht. Hä?Alter Windows. Ist das jetzt wirklich den hier ernst, oder? Tja Leute, ich würde mirwirklich gerne die VM angucken. Die Windows Sandbox. Aber ich glaube wir haben zu vielRAM jetzt. Okay, wir machen das anders. Wir machen das anders. Das ist bestimmt kaputt.Das ist bestimmt kaputt, weil wir dir, weil wir dir zu viele CPUs gegeben haben. Alsowir geben dem Ding jetzt wieder weniger CPUs und wir geben dem, dem, dem bloß, bloß6GB RAM. Dann geht es bestimmt. Und da sagt Max, mehr RAM ist immer gut. Was kann ichdafür, wenn Windows 10 in der Meinung ist, mehr RAM ist schlecht. Vielleicht ist daskaputt, weil du die VM gekillt hast, während die Sandbox lief. Okay, wäre auch WindowsLogik, ja. Ich könnte, ich könnte das Feature nochmal deinstallieren und wieder installieren,jetzt gehts dann. Okay. Sandbox. Yes. Jetzt macht er was. Jetzt macht er was. Ohne ScheißLeute, vorhin hat er nix gemacht. Jetzt macht er was. Das Edge. Jetzt gehts. Ernsthaft.Windows. Haha, so schlecht. Windows Logik. 4 CPU Kerne, 8GB RAM. Ne, das geht nicht.2 CPU Kerne, 6GB RAM. Ah, jetzt funktionierts. Okay, jetzt aber. Edge. Voll am Limit hier,voll am Limit. For real, warum geht das Scheiß nicht? Weil Windows, das ist ja das Problem,was ich mit Windows hab. Es ist nicht nachvollziehbar, warum was geht und warum nicht. Okay. WoopLords Twitch. Jetzt sucht er bestimmt in Bing oder so Dinger. Sucht er in Bing? Jetztvor allem installieren nochmal, nestet Virtualisierung. Woop, warum, macht er jetzt was? Warum machter jetzt einfach Bing auf ohne die Ergebnisse? Okay. Hallo? Ich würde da gerne was tippendrinne jetzt. Denied. Oh jetzt gehts. Jetzt gehts. Moment, geh weg. Ah, Windows, please,lass mich einfach was tippen. Clocks HD ist jetzt auch am Start. Twitch Prime, Dankeschön.Serhietrant war auch vor 8 Minuten schon am Start. Hab ich denn schon vorgelesen? Ichkann nicht. Wenn nicht, schade dir auch nix. Woop Lords Twitch. Ich fahr das Ding jetztgleich runter und starte es nochmal neu. Scheint sehr performant zu sein, die Sandbox. Naja,man darf nicht vergessen, es ist Windows in Windows in Windows. Es ist Windows, es istVMWare, es ist Windows in VMWare und dann nestet Virtualisiert Sandbox. Felix Tegi,subscribed. Dankeschön. Guys. Twitch, nestet Virtualisiert. Das ist Next Level, oder? KomplettNext Level. Okay, dann wollen wir es nochmal ausprobieren. Soll ich es nochmal runterfahrenund ordentlich Shutdown machen und dann nochmal 4 Kerne und 8G geben. Jetzt noch Linux Subsystemund X Server. Ja, ich hab ja schon vorgeschlagen. Da ist er. Der Stream Leute. Der Stream. NestedVirtualisiert. Nested Virtualisiert. Unter Windows, in Windows, unter Windows. Ich mein,es lässt sich nicht wirklich bedienen. Es hat ungefähr 0,2 FPS. So ungefähr ist esso schnell, denke ich mal. Sogar der Taskmanager laggt. Hallo, Warforce 420. Sogar der. Ichglaube, ich hab auf dem Rechner noch nie so hohe CPU-Auslastung gesehen, ey. Ich wusstegar nicht, dass der Graph überhaupt komplett blau sein kann. Okay, wir fahren es ordentlichrunter. Ja, wir fahren es ordentlich. Was passiert eigentlich, wenn man das hier zuklickt? Einfachzuklickt. Was passiert dann? Geht es dann kaputt? Ja, es freest. Es freest erstmal.Windows. Es muss ja die Windows typischen Sachen beibehalten. Erstmal freezen. Ja,ich bin mir sicher. Okay, richtig mal ordentlichen Shutdown, Leute. Ordentlichen Shutdown. Dergibt die CPU gar nicht mehr her. Das ist jetzt. Auch wieder komische Musik, wo sie reden.Geh weg. Okay, jetzt Shutdown. Bam. Simulation einer Simulation einer Simulation, ja. Werweiß? Vielleicht sind wir auch nur alle Bestandteile einer Simulation. Vielleicht gibt es uns allegar nicht. Vielleicht sind wir alle bloß in einer ausreichend komplex simulierten VM.Okay, gucken wir mal, ob es jetzt funktioniert. Und die Frage der Fragen ist ja, sollten wires schaffen, man denkt mal an Sims 4, also an Sims 40, sollten wir es schaffen eine Simulationunserer Welt zu erschaffen, stellen wir damit nicht quasi auch in Frage, ob es uns überhauptgibt. Weil wenn wir das schaffen, uns zu simulieren, wer sagt uns denn dann, dass uns nicht schonlängst jemand simuliert hat? Oh. Jetzt wird es ja esoterisch, ja. Das stimmt. Leute,jetzt müssen wir uns mal belegen. Was meint ihr? Geht es jetzt oder geht es jetzt nicht?Also wir haben es ja vorhin schon mal probiert. Sandbox ging, mehr RAM, mehr CPU, Sandboxging nicht. Jetzt ordentlich rebooted, wieder mehr RAM, mehr CPU, also quasi das, was eseher besser machen würde. Ich tippe auch darauf, dass es nicht geht. Aber wir sehenes ja schon gleich an der CPU-Auslastung, ob es geht oder nicht geht. Es geht nicht.Es geht nicht. Tipp. Oder doch? Nein. Gebaidet. Ich frag mich, hat es hier was gemacht? Hatsich das gerade bewegt? Gibt es seit heute eine neue Windows-Version? Nee, seit Apriloder so. Das ist echt eine Wit, das ist echt Windows-Logik. Die verstehe ich nicht. Warum?Warum geht das mit 6 GB RAM und 2 CPU-Kernen, aber es geht nicht mit 8 GB RAM und 4 CPU-Kernen?Warum? Ich habe eine Idee. Wir machen jetzt Massive Play. Wir verarschen Windows jetzt.Wir machen es jetzt anders. Wir machen jetzt nicht eine CPU mit 4 Kern, wir machen jetzt2 CPUs mit 2 Kern. Jetzt ist vorbei. Jetzt kann es sich nicht mehr wehren. Und, und,Moment Leute, und, und wir machen nicht 8 GB RAM, sondern, sondern, Achtung, wir machen7996 MB RAM. Jetzt geht's, sag's euch Leute, jetzt geht's. Macht doch in QEMO, wir könnennoch ein bisschen weiter Nested virtualisieren. Okay Leute, Predictions, geht oder geht nicht?Na, 5050, ja. Mein Bauchgefühl sagt mir, und ihr wisst, ich hab da, da hab ich genugdavon, weil mein Bauchgefühl sagt, es geht. Geht anscheinend nicht. Wir wissen ja, dasist direkt auf Anschlag mit CPU-Auslastung. Okay, ich geb's auf Leute, ich versteh dieWindows-Logik nicht. Ich glaube, man kann an dieser Stelle auch nicht von Windows-Logiksprechen. Das ist eher Windows-Debating oder so. Was ist dein Ziel? Mein Ziel ist eigentlichheute nur sinnlos zu streamen, weil ich Partner geworden bin. Und ich versuch gerade Windowsunter Windows zu virtualisieren und darin Windows zu betreiben. Und das funktioniertallerdings lustigerweise nur mit 2 Kern und 6 GB RAM. Wenn ich 4 Kerne und 8 GB RAM gebe,geht's auf einmal nicht mehr. Und wir haben alle keinen Plastenschimmer, woran das liegt.Übrigens Leute, hab ich euch schon erzählt, dass wenn ihr einen Amazon Prime-Account habt,dass ihr den kostenlos mit Twitch verbinden könnt und ihr bekommt dafür kostenlose zusätzlicheLootboxen oder wie auch immer das genau heißt auf Twitch und ihr könnt den Streamer eurerWahl einmal im Monat kostenlos mit einem Sub unterstützen. So sieht's aus. Nur Leute mitBig Prane machen das. Jetzt machen wir mal was ganz Abgedrehtes. 3 CPU-Kerne. 3 Kerne,gibt's sonst nirgendswo. Aber unter Windows geht das wahrscheinlich. Probier mal nochweniger Kerne, damit noch weniger Kerne geht's, das wissen wir ja. Wie sehen 3 Kerne im Taskmanageraus? Gute Frage, kann man's angucken. So sehen 3 Kerne aus. 3. Ok, gucken wir mal, ob'sfunktioniert. Die Musik geht fort. Das geht auch nicht. Ok, anscheinend ist Windows derMeinung, das darf nur unter 2 CPU-Kernen funktionieren. Ich hab keine Ahnung warum. Weil. Äh ich machjetzt aus, ich mach jetzt Windows aus, hab jetzt kein Bock mehr. Also wir wissen, dasses prinzipiell funktioniert, allerdings nur in schlechter Performance, weil Windows unsnicht mehr Performance erlaubt. Oh, hab ich so viele Desktops auf. Ich blick nicht mehrdurch, zu viele Desktops. Würdest du einen Bann von Lootboxen befürworten, Belkin hatteja schon verboten. Ähm, also ich bin nicht dafür, ich bin selten dafür, irgendwas komplettzu verbieten. Aber ich finde im Falle Lootboxen, also ich hab kein Problem mit das Lootboxenim Game sind, es ist die Frage immer, wie's eingesetzt wird. Und vor allem bei MobileGames und jetzt natürlich auch neuerdings, ich mein Battlefront war jetzt ein prominentesBeispiel für, dient es ja im Prinzip dazu, die Leute zu verarschen. Ja, mit extra langenGrindzeiten im Hauptgame, teilweise mit ultra kleiner Loot-Chance von irgendeinem Heldoder von irgendwas. Ich find's an sich gar nicht so schlimm, wenn's Lootboxen gibt,aber man sollte, es muss klar erkenntlich sein, ähm, erstens natürlich was man rausbekommen kann und wie wahrscheinlich das Ganze ist, dass man was bekommt. Und was ichauch prinzipiell nicht schlecht finden würde, wenn Spiele, die quasi so nen Glücksfaktordrinnen haben, erst ab einem gewissen Alter freigegeben werden, egal wie der Inhalt vomSpiel ist. Allerdings ist halt die Frage, ob das überhaupt irgendwelche Auswirkungenhat, ne. Weil ganz ehrlich, wer von uns hat bis 18 gewartet, um Spiele mit 18 zu spielen?Oder wer hat, wer von uns hat gewartet, bis 16 zum Spiele ab 16 zu spielen?Max Nutztmann Jaro mit i3 WM, ja da hat der Nightbot Recht. Was sagt eigentlich mal PepegaBoard, was wir noch für Fragen haben? Wir haben viele Fragen, aber vom letzten Strebennach. Oh, ich habe meine, Leute, ich noob, ich hab meinen Linux VM ausgeschaltet. Jetzthat das Pepega Board nicht mal mitgeloggt, was der Chat gefragt hat. Also falls ihr inden letzten 20 Minuten irgendwas gefragt habt im Chat, und ich hab's noch nicht beantwortet,dann müsst ihr das gleich, wenn ich das Board gestartet habe, nochmal posten. Moment, aberjetzt noch nicht, jetzt noch nicht. Ja, richtiger Fail, Leute, gleich Disabo, gleich Disabo.So, jetzt ist wieder gestartet, jetzt könnt ihr noch mal fragen, falls es noch was gab.Okay, das hatten wir, das hatten wir auch. Und löschen wir mal von unten.So viele Nachrichten. Mein Tool ist irgendwie kaputt, das zeigt nicht alles an. Ach, ichglaube, ich weiß woran das liegt. Ich glaube, ich habe ein Limit von nur 50, nur ein Limitvon nur 50 Fragen drinne. Fail. Programming Noob. Wirkt euch das mal an, wie viele Sachenda eigentlich drinne sind. Womit wird die Sandbox eigentlich virtualisiert? Ich denkemal, das Hyper-V. Was hast du dir bei Electro Boom anguckt? Ichhabe nur den Channel gezeigt, weil irgendjemand vorhin gefragt hat, was gute Technik-Channelssind. Habe ich zwei Channels gezeigt, dabei einer davon. Den gucke ich halt wirklichgern, der ist sehr nice. Also, wie viele Fragen hier drin sind. Also, das ist von vor 5 Streamsoder so, weil ich wieder nicht gelöscht habe. Der grillt sich doch immer selber, ja genau.Willst du auch Gaming-Streams machen? Ja klar, spätestens, wenn Bad Company 3 rauskommt,geht es wieder ab. Gibt es eigentlich was Neues? Gibt es was Neues? Nein, gibt es nicht.Ich glaube, im deutschen Bereich bist du aber auch der kompetenteste und interessantesteStreamer. Ich habe kein passendes Emote dafür. Würde ich das Herzchen-Emote machen. DieKompetenz ist ja eh nur gefaked, ich hoffe, das ist euch allen klar. Ich tue eigentlichnur so, als kenne ich mich damit aus. Denkst du eher an Tutorials oder News-Gelaber fürYouTube? News-Gelaber eigentlich eher nicht. Außer, dass es wirklich bedeutsam ist. Ja,so das kann man beliebig weiterspinnen. Oh Patrick, ja ich weiß, was du meinst, wiehieß das Ding dann? Das ist so ultra low-level Zeug gewesen, also quasi fast noch unter USB,also wo du quasi auch Tastatureingaben faken kannst, wo man nicht mal erkennt, dass dieTaste abgedrückt wurde. Das hast du bestimmt noch im Discount, ich weiß gerade nicht mehr,wie das Ding hieß. Hast du schon was geplant, wann der Stream morgen startet? Na ja, morgenist Samstag, wahrscheinlich Mittag oder Nachmittag. Der ohne Kohle, tatsächlich, das gibt echtLeute, die das geguckt haben, nice. Dabei, ich hätte mir über das Video viel mehr Gedankenmachen müssen, da gibt es noch viel mehr coole Sachen. Übrigens, die Idee des Tageshat derjenige gewonnen, also nicht, dass es dafür was zu gewinnen gibt, aber die besteIdee heute im Stream fand ich diese Sache mit dem Keks, den man füttern muss untenim Stream. Das können wir wirklich selbst programmieren, sowas, da muss ich allerdingsnoch einen Grafik-FX-Mensch finden, der die passenden Kekse machen kann dafür. Na ja,die brauchen einen halb zerkrümelten Keks, den löchrigen Keks, den Keks, der gut draufist. Wozu brauchst du denn eine mini WLAN-Kamera? Kannst du gute Access Points empfehlen? Ja,den Pro Access Point von Ubiquiti ist ziemlich gut. Hat zwar auch seine Macken, vor allem,dass man diesen komischen Controller für braucht, das kann ein ordentliches Webinterfacehaben, aber der reine Access Point davon ist ziemlich gut. Flo690, ich habe den Reboot-Clipmal einem auf der Arbeit gezeigt, der konnte sich das Ganze auch nicht erklären. Das Einzige,was wir uns zusammenreimen konnten, ist, dass diejenigen, die das Image gebaut haben, inder History-Reboot drin stehen hatten und ich es irgendwie geschafft habe, mit meinem Rumgeklickund gemachte vorher noch einen Pfeil nach oben, eine Escape-Sequenz oder so drin zu haben,keine Ahnung, kann sich keiner erklären. Warten wir schon?Wie viele kannst du eigentlich haben? Ich weiß es nicht. Ich habe auch keine Ahnung,wo ich Sub-Batches und irgendwas hochlade. Ich muss erstmal gucken. Weißt du oder jemandim Chat, wie man eine Weile schlafen kann mit einem Tastendruckband in Steuerung C, alsoLinux-Shell. Und halte mal Steuerung C ein bisschen gedrückt, das braucht man kurz.Kannst du mir eine LXC-Frage mal antworten? Klar, schieß los.Mal eine Frage zur LXC. Kann man Container beim Startup automatisch einen anderen DNS-Serverin der Resolve-Conf setzen? Derzeit nimmt er den vom Haus, der ist aber nicht vom Containererreichbar. Du kannst mit LXD, also mit diesem Ubuntu Zeug, kannst du Parameter für jedeVM überschreiben. Muss man nachgucken, ob es die Möglichkeit gibt, den DNS zu überschreiben,das weiß ich nicht. Also nicht aus dem Kopf. Ja, das könnte ich sein, genau. Ja, das wardas. Wie viele Subs hast du schon? Ich weiß noch nicht mal, wo der Sub-Counter steht, dawürde ich nachgucken. Aber ich tippe mal so auf 35 oder so. Also huge.Alles, wir haben alles.Xe-Marsel, nice, Dankeschön, Twitch Prime. Poggers. Okay Leute, es ist 21.20, ichhabe noch nichts gefuttert heute Abend. Ich werde erst mal was essen gehen. Wir guckenmal, wen wir hosten können. Es war schön, dass ihr spontan wieder alle mit am Startgewesen seid. Das war jetzt ja relativ spontan das Ganze. Eigentlich wollte ich erst morgenmit dem Staubsauger streamen. Morgen, Nachmittag, Mittag, Nachmittag, Abend, so, irgendwie,in dem Dreh, ich weiß noch nicht genau, wann es losgeht, flashen wir meinen Staubsaugermit neuer Firmware und gucken, wie das Ganze funktioniert. Wann geht es los? Ich weißnoch nicht ganz genau. Ich denke mal, wahrscheinlich so 16 Uhr oder sowas. Flashen wir den Staubsaugerund gucken mal, was die neue Firmware taugt. Ich habe mir schon kurz den Changelog angeguckt,es sind ein paar gute Sachen dabei. So, jetzt schauen wir mal, wen wir hosten können.Inside das Universum. Was ist das? Das ist Universum, der meint das Wort wörtlich. Dasist Big Brain Stream. Java, den haben wir letztens gehostet schon. Let's develop UnityCreator Kit. Der hat schon mal einen niedlichen Avatar, das gefällt mir. Entspanntes Fivum.Fivum, was ist das? Was ist das für eine Sprache? Ich würde sagen, auf den erstenBlick hätte ich gesagt, JavaScript, aber dann doch wieder nicht. Was ist das für eineSprache? Ist das Lua? Nee. Ah, das ist die GTA Mode. Was ist das für eine Sprache? Könntedoch Lua sein, oder? Wenn es ein Modtool ist, dann ist Lua gar nicht so unwahrscheinlich.Okay, wir sind uns einig, es muss Lua sein. Android Flutter App. Spring Boot. Java. 3DDrucker Schach. Dieser Stream, der ist fast 24-7 gefühlt online. Jedes Mal, wenn wirgucken, ist der online und der hat im Stream die Kamera von seinem 3D Drucker. Was machtder hier? Ist der nackig? Ähm, den wollen wir hosten. Sagtmir, ich muss ehrlich sagen, spontan sagt mir gar nichts so richtig zu. Schau mal beiJust Chatting. Just Chatting auf Deutsch. Grillz, Grillz. Grillz. So viele Grillz mittlerweile.Huge. Sollten wir gerade explizit sagen, nein, machen wir nicht. Guck einfach, wenn manso hosten kann, ob irgendjemand dabei ist, den ich vielleicht kenne, oder irgendetwas,was mich so direkt anspricht vom Titel her. Aber krass, wie viele Mädels mittlerweilestreamen, oder? Und nicht eine, nicht eine Boobcam, oder? Sehe ich das richtig? Sachengibt's eher. Da war PC-Build? 18 plus. PC-Build. Warum ist das 18 plus? Okay, wo ist, wo istder Dude? Muss ich mir jetzt mal angucken kurz. Nicht, dass der wieder ohne Hose wiederandere da im Stream setzt. Sind das zwei? Das sind zwei, oder? Dual Build. PC, PC-Building-Simulator. Stimmt, warum ist er vier Stunden am bauen? Ah fuck. What why? Ah vier Stundenmindersinstallation. Kann das sein, dass er sich einfach nur angeguckt hat? Nee. AchLeute, keine Ahnung, wen ich hosten soll. Sagt mir heute, sagt mir heute überhauptnichts zu. Wir machen dann jetzt einfach so Schluss. Morgen sehen wir uns mit dem Staubsauger,der geflasht wird. Und ich guck jetzt mal, ob ich noch irgendwelche Subs verpasst hab.Nope. Also Leute, danke für die ganzen Subs heute, auch für die ganzen Follows und dasshier wieder so viele Leute wart, die einfach nur sinnlos beim Schwätzen zugeguckt haben.Wir sehen uns morgen, machts gut. See you.", "segments": [{"id": 1, "start": 0.0, "end": 1.0, "text": "Salaida!"}, {"id": 2, "start": 1.0, "end": 2.0, "text": "Salaida!"}, {"id": 3, "start": 2.0, "end": 3.0, "text": "Salaida!"}, {"id": 4, "start": 3.0, "end": 4.0, "text": "Salaida!"}, {"id": 5, "start": 4.0, "end": 33.96, "text": "So Leute, da bin ich, ne ich hab mir noch keine Emotes machen lassen."}, {"id": 6, "start": 33.96, "end": 38.12, "text": "Ich hab mir noch gar nichts machen lassen, ich hab keine Subscriber-Batch, ich hab keine"}, {"id": 7, "start": 38.12, "end": 46.4, "text": "Emotes und das Schlimme ist, warte mal, Kabi muss mal kurz die Klappe halten, das Schlimme"}, {"id": 8, "start": 46.4, "end": 52.52, "text": "ist, ich check auch die Einstellungen nicht, wo ich was hoch lade, ich muss mir das echt"}, {"id": 9, "start": 52.52, "end": 53.52, "text": "in Ruhe nochmal angucken."}, {"id": 10, "start": 53.52, "end": 65.16, "text": "Ich brauch, ich brauch einen guten, oh jetzt kommen die, jetzt kommen die, die Subs, ja"}, {"id": 11, "start": 65.16, "end": 66.16, "text": "danke Leute."}, {"id": 12, "start": 66.16, "end": 71.84, "text": "Ähm, es gibt doch jetzt, wie heißt es, Fiverr oder Fiverr, da kann man sich irgendwelche"}, {"id": 13, "start": 71.84, "end": 76.16, "text": "Leute mieten, die für ein Emotes machen, ne aber ich werde mir auf Twitter mal, ich"}, {"id": 14, "start": 76.16, "end": 80.76, "text": "werde mal auf Twitter ein bisschen gucken, wer das so ist und wie gesagt, ich will auch,"}, {"id": 15, "start": 80.76, "end": 84.52, "text": "ich will auch nicht, dass irgendwie einer für mich Zeugs umsonst macht, aber das sollte"}, {"id": 16, "start": 84.52, "end": 91.0, "text": "dementsprechend aber halt auch auf was tauchen, auf was taugen, warum ist so ein PP-Gabbot"}, {"id": 17, "start": 91.0, "end": 92.0, "text": "nicht an?"}, {"id": 18, "start": 92.0, "end": 105.08, "text": "Jaja, continue, Fiverr, heißt es Fiverr, heißt es Fiverr, ich weiß es nicht, Fiverr,"}, {"id": 19, "start": 105.08, "end": 129.36, "text": "also ich hab keine Ahnung, was wir heute machen, ich bin jetzt einfach nochmal on gekommen,"}, {"id": 20, "start": 129.36, "end": 135.62, "text": "gekommen, weil ich gerade gesehen habe, dass die Twitch-Partnerbewerbung angenommen wurde. Aber erst mal die ganzen Grams hier starten."}, {"id": 21, "start": 136.88, "end": 138.88, "text": "Vielleicht vom letzten Mal noch ein paar Fragen auf haben."}, {"id": 22, "start": 139.76, "end": 141.76, "text": "Ich müsste"}, {"id": 23, "start": 143.36, "end": 147.96, "text": "zumindest Sub-Benachrichtigungen und so Gedöns schon eingeschaltet haben, hoffe ich mal."}, {"id": 24, "start": 149.56, "end": 152.56, "text": "Nice, ja doch, ist eingeschaltet. Ich sehe es, ShircoSky."}, {"id": 25, "start": 152.56, "end": 163.0, "text": "Ah, ist doch cool. Ich bin echt froh, dass das geklappt hat. Danke für die ganzen Subs. Übrigens auch danke für die ganzen Subs schon, die es gegeben hat, bevor ich überhaupt online gekommen bin mit dem Stream."}, {"id": 26, "start": 163.88, "end": 165.88, "text": "Noch mehr, jetzt geht es aber ab."}, {"id": 27, "start": 167.24, "end": 176.92, "text": "KS. Twitch Prime. Stimmt, jetzt kann ich ja den Twitch-Cast-Corian auch danken bei dir für den Sub. Jetzt kann ich ja den Twitch Prime-Sellout machen, Leute."}, {"id": 28, "start": 177.2, "end": 180.76, "text": "Habt ihr schon euren Amazon-Account mit Twitch verknüpft?"}, {"id": 29, "start": 180.76, "end": 188.04, "text": "Ja, ich, normalerweise hätte ich gesagt, dann könnt ihr euch Twitch kostenlos angucken und einen Streamer eurer Wahl kostenlos abonnieren im Monat."}, {"id": 30, "start": 188.04, "end": 194.76, "text": "Allerdings hat sich Amazon letztes Jahr überlegt, es gibt keine Werbung, äh, es gibt wieder Werbung, auch für Prime, Leute."}, {"id": 31, "start": 194.76, "end": 203.96, "text": "Das heißt, aktuell bringt das eigentlich nur, ich glaube, irgendwelche kostenlose Drops, die ich nicht verwende, und man kann kostenlos den Streamer seiner Wahl unterstützen."}, {"id": 32, "start": 203.96, "end": 209.32, "text": "Das ist auch das Einzige, was ich persönlich mit meiner Twitch-Prime-Geschichte mache."}, {"id": 33, "start": 209.32, "end": 216.12, "text": "Ähm, die ganzen, ich weiß nicht, wie es bei euch ist, aber die ganzen anderen Twitch-Prime-Sachen nehme ich eigentlich gar nicht in Anspruch."}, {"id": 34, "start": 216.12, "end": 230.36, "text": "Ich hab zig, zig hunderte Einträge hier, dass ich irgendwelche Loot-Geschichten unlockt habe, dass ich, ich glaube, ich hab bisher noch nicht eine Sache eingelöst, aber so kann ja jeder machen, wie er will, ne?"}, {"id": 35, "start": 230.36, "end": 242.28, "text": "Ähm, ja, und jetzt an der Stelle mal gesagt, ich bin froh über jeden Sub, aber er sollte sich natürlich nach wie vor keiner irgendwie gezwungen fühlen."}, {"id": 36, "start": 242.28, "end": 251.24, "text": "Ich komm auch ohne Twitch-Subs über die Runden, ja, kein Problem, aber ich find's natürlich schön, und was ich, was ich fast nur schöner finde ist,"}, {"id": 37, "start": 251.24, "end": 255.24, "text": "und das muss ich jetzt an der Stelle auch mal loswerden, weil jetzt, wo ich Partner bin, kann ich den richtigen Sellout starten."}, {"id": 38, "start": 255.24, "end": 262.92, "text": "Ähm, dass so viele Leute immer bei den Streams am Start sind, ähm, das ist ja schon ein ziemliches, wen haben wir jetzt?"}, {"id": 39, "start": 262.92, "end": 269.64, "text": "Philipp Hü, danke für den Sub, ähm, wo war ich gerade stehen geblieben?"}, {"id": 40, "start": 269.64, "end": 282.68, "text": "Genau, ich wollte die übliche Subscriber-Einschreiben-Action loslassen, und zwar, ich find's wirklich schön, dass immer so viele Leute am Start sind, weil ich weiß, dass das hier an sich ein ziemliches Nischenthema ist, ja?"}, {"id": 41, "start": 282.68, "end": 294.2, "text": "Vor allem auf Twitch, so, Streams, die sich, oder generell, es ist auch auf YouTube so, Videos und, und Content, der sich wirklich mit Technik ein bisschen tiefer greift und beschäftigt, ist rar, gibt's nicht so viel."}, {"id": 42, "start": 294.2, "end": 308.92, "text": "Es gibt ganz viele Technik-Channels, die sich Technik-Channels nennen, und die machen dann im Endeffekt sowas wie Smartphone-Reviews, oder zeigen vielleicht mal das Einrichten von irgendeinem, von irgendeinem WLAN-Repeater-Router, oder hast du nicht gesehen?"}, {"id": 43, "start": 308.92, "end": 338.6, "text": "Aber, was wir hier machen, ist ja schon, meistens zumindest, ne Runde Advanster, und, deswegen find ich das gerade so schön, dass so viele Leute am Start sind, und was ich auch cool finde, dass hier doch der Anteil an Leuten, die sich dafür interessieren, und vor allem auch, die sich in verschiedenen Themenbereichen auskennen, kommt mir zumindest relativ hoch vor."}, {"id": 44, "start": 338.6, "end": 368.04, "text": "Das find ich sehr nice, ja nice, äh, danke SeriousMax, aber das ist wirklich cool, Morgengemüse, Dankeschön für den Sub, Twitch Prime, Matt, kann ich dir Recht geben, ähm, ich find's auch ein bisschen merkwürdig, wenn man sagt, ich bin Technik, die sagen ja nicht, ich bin Technik-Experte, aber ich finde, ein richtiger Technik-Channel,"}, {"id": 45, "start": 368.04, "end": 380.92, "text": "ich weiß nicht, ob man das Technik nennen kann, wenn man sich zum größten Teil mit Swat vor uns beschäftigt, das ist jetzt nichts gegen die Channels und die Leute an sich, da gibt's auch wirklich nette Leute, aber, mit Technik hat's aus meiner Sicht nicht so viel zu tun."}, {"id": 46, "start": 380.92, "end": 383.72, "text": "Endlich kann man suppen, ja, seit 5 Minuten."}, {"id": 47, "start": 383.72, "end": 413.16, "text": "Demnächst gibt's übrigens auch, ich muss mir echt Gedanken machen, was ich als Subscriber-Batch mache, vielleicht machen wir ein paar Keks-Krümmel oder irgendwie sowas, ich hab nur wirklich keine Ahnung, also wir müssen uns mal aufschreiben, was wir noch machen müssen, also, wichtig, was müssen wir machen, wir brauchen eine Subscriber-Batch, ich kann die gar nicht mehr schreiben, Subscriber, hat man,"}, {"id": 48, "start": 413.16, "end": 442.6, "text": "hat man, hat man einen Lehrer bei mir an der Schule, kann ich mich noch dran erinnern, habe ich an der Berufsschule, übelster, übelster Fail, hat er mal irgendwas vorgelesen und auf einmal hat er irgendwas die ganze Zeit erzählt von Subscriberin, bis ich dann irgendwann, was meint er eigentlich, meint er abonnieren, und dann hat er gesagt, ja, ich hab noch nie jemand gehört, der ernsthaft Subscriber mit Subscriberin übersetzt hat, und ich hab gedacht, es war so,"}, {"id": 49, "start": 442.6, "end": 445.64, "text": "aber der war, der war seiner Zeit voraus, der,"}, {"id": 50, "start": 447.64, "end": 448.76, "text": "Dis-Abo,"}, {"id": 51, "start": 453.8, "end": 459.0, "text": "gibt's nen Subcounter, ähm, ich würde selbst keine gucken, wie viele Subs ich hab,"}, {"id": 52, "start": 459.88, "end": 463.08, "text": "ich hab keine Ahnung, wo ich das überhaupt nachgucken kann,"}, {"id": 53, "start": 464.76, "end": 469.32, "text": "ich hab, ich muss, ich, wie gesagt, ich hab dieses, dieses Twitch-Onboarding,"}, {"id": 54, "start": 469.32, "end": 474.84, "text": "ich hab mich vor 5 Minuten oder 10 Minuten fertiggemacht, ich hab wirklich absolut keinen blassen Schimmer,"}, {"id": 55, "start": 480.36, "end": 485.16, "text": "Streamlabs, ja, bestimmt, allerdings würde ich gerne, ja, ich war in Frankfurt auf der Hochschule,"}, {"id": 56, "start": 485.16, "end": 489.96, "text": "allerdings würde ich selbst gerne mal erst mal checken, wo ich das überhaupt sehe,"}, {"id": 57, "start": 489.96, "end": 493.96, "text": "das seh ich garantiert irgendwo in den Account-Settings, aber ich hab keine Ahnung,"}, {"id": 58, "start": 493.96, "end": 498.68, "text": "dann lass uns zusammen rausfinden, das geht nicht, da müssen sich die Account-Settings hier aufm,"}, {"id": 59, "start": 498.68, "end": 506.04, "text": "aufm Stream aufmachen, und da sieht man auch noch mehr von, äh, Adresse zu Kontonummer und zu,"}, {"id": 60, "start": 506.04, "end": 510.28, "text": "Adre-, und, und, und, und Name, Adress, all mögliche, das geht nicht,"}, {"id": 61, "start": 513.4, "end": 517.72, "text": "als wären sich nur die Subs gegiftet, ein nicer Schachzug,"}, {"id": 62, "start": 517.72, "end": 523.48, "text": "KioKoll, danke für den Sub,"}, {"id": 63, "start": 548.04, "end": 553.16, "text": "Casino Capitalist, danke für den Sub, jetzt geht's aber ab hier, meine Güte,"}, {"id": 64, "start": 553.16, "end": 559.56, "text": "ich hab jetzt ja schon innerhalb von, noch mehr, ach du Scheiße, ich hab jetzt ja schon,"}, {"id": 65, "start": 559.56, "end": 566.2, "text": "keine Ahnung, Laupertin auch bei dir, danke für den Sub, ähm, ich hab jetzt innerhalb von 10"}, {"id": 66, "start": 566.2, "end": 571.72, "text": "Minuten oder so 15 Subs oder was gekriegt, easy, da fällt mir nix anderes ein, da gibt's,"}, {"id": 67, "start": 571.72, "end": 579.4, "text": "Flixcoder auch am Start, dankeschön, ähm, also lass uns überlegen, was wir brauchen,"}, {"id": 68, "start": 579.4, "end": 584.04, "text": "ich brauch ne Subscriber-Batch, ich brauch, ich, ich weiß gar nicht,"}, {"id": 69, "start": 584.04, "end": 588.12, "text": "wie viele Emotes man zum Start kriegt, wahrscheinlich eins oder so, oder fünf,"}, {"id": 70, "start": 588.12, "end": 592.92, "text": "oder ich weiß gar nicht, muss ich gar nicht gucken, Ray, das ist ne gute Frage,"}, {"id": 71, "start": 592.92, "end": 598.44, "text": "da sag ich gleich was zu, ähm, da sag ich gleich was zu, Technik-Channels auf YouTube,"}, {"id": 72, "start": 598.44, "end": 602.36, "text": "ich find, gibt ein paar, gibt ein paar ganz gute, so Abseits von Linux Tech-Tipps,"}, {"id": 73, "start": 602.36, "end": 608.52, "text": "man sagen muss, Linux Tech-Tipps, ich würd den schon als Technik-Channel durchgehen lassen,"}, {"id": 74, "start": 608.52, "end": 613.56, "text": "allerdings ist das eigentlich hauptsächlich ein Entertainment-Channel, ich mein, ganz ehrlich,"}, {"id": 75, "start": 613.56, "end": 619.4, "text": "ähm, wer find das nicht lustig, wenn sie sich in den Intel-Server hinstellen und versuchen mit"}, {"id": 76, "start": 619.4, "end": 624.68, "text": "ihren Füßen die CPUs anzudrücken, dass der Server startet, aber, ähm, wirklich mit Technik"}, {"id": 77, "start": 624.68, "end": 628.6, "text": "hat das nicht viel zu tun, äh, äh, äh, Linux Technik, nicht Linux, Alter."}, {"id": 78, "start": 637.08, "end": 641.32, "text": "Was passiert eigentlich, wenn einer jetzt 100 Subs giften würde, wenn nur 80 Leute im Chat sind?"}, {"id": 79, "start": 641.32, "end": 646.44, "text": "Naja, in Anbelang der Tatsache, dass du dir die Subs irgendwelchen Leuten giften musst,"}, {"id": 80, "start": 646.44, "end": 649.16, "text": "funktioniert das nur so lange, wie Leute da sind."}, {"id": 81, "start": 649.16, "end": 655.96, "text": "Es sei nur Gift des Subs, Leute, die nicht da sind. Hallo, Quallog. Also, Emoji brauchen wir,"}, {"id": 82, "start": 655.96, "end": 665.96, "text": "da muss ich mir unbedingt, äh, einen Artist suchen, einen, der das machen kann, wie ich mir das"}, {"id": 83, "start": 665.96, "end": 672.84, "text": "vorstelle, bzw. der vielleicht auch ein paar Ideen hat, wie man's machen könnte, weil ich da bei"}, {"id": 84, "start": 672.84, "end": 679.64, "text": "solchen kreativen Sachen, was künstlerische Sachen angeht, nicht so, nicht so das Händchen für hab."}, {"id": 85, "start": 681.64, "end": 687.08, "text": "Was bringt es, einen Sub gekiftet zu bekommen? Du bist ganz normaler Sub. Das ist ein richtiger"}, {"id": 86, "start": 687.08, "end": 693.4, "text": "Sub, äh, nur, dass du ihn nicht selbst bezahlen musst. Also, optimal, um die Grills zu beeindrucken."}, {"id": 87, "start": 696.04, "end": 697.24, "text": "So sieht's aus."}, {"id": 88, "start": 697.24, "end": 704.84, "text": "Leider kann man seinen Prime-Sub, glaub ich, nicht giften. Macht die Ecke von einem Keks,"}, {"id": 89, "start": 704.84, "end": 727.8, "text": "der, macht die Ecke von dem Keks, die fehlt als Sub-Icon. Das ist ne richtig coole Idee."}, {"id": 90, "start": 727.8, "end": 731.48, "text": "Gibt's hier im Chat eigentlich Grills? Es gibt generell im Internet keine Grills."}, {"id": 91, "start": 731.48, "end": 739.4, "text": "Das ist, das ist nur Gerücht. Wupplotzmonka-Emote. Ja, da müssen wir mal gucken. Ich hab, wie gesagt,"}, {"id": 92, "start": 739.4, "end": 743.32, "text": "ich hab echt keine Ahnung, wie das funktioniert. Also, wir brauchen Emotes. Wir brauchen noch die"}, {"id": 93, "start": 743.32, "end": 750.92, "text": "neuen FFZ-Emotes. Geht eigentlich POC mittlerweile. Der Rüpel, danke für den Sub. Ähm, können wir"}, {"id": 94, "start": 750.92, "end": 755.4, "text": "mal ausprobieren, ob POC als Emote mittlerweile funktioniert. Ich hab's vorhin FFZ-mäßig eingetragen."}, {"id": 95, "start": 755.4, "end": 761.96, "text": "Ja, funktioniert. Ja, sehr schön. Ähm, jetzt mal so außer der Reihe. Normalerweise erzähl ich ja"}, {"id": 96, "start": 761.96, "end": 767.72, "text": "nicht so Zeug, aber, aber zur Feier des Tages, weil gerade jemand gefragt hat, ob Grills in dem Chat"}, {"id": 97, "start": 767.72, "end": 775.48, "text": "sind. Ähm, hotte Grills natürlich. Ähm, dachte ich mir, ich könnte mal eine, eine Real-Life Story zum"}, {"id": 98, "start": 775.48, "end": 783.72, "text": "Besten geben, was damit was zu tun hat. Und online Grills, in Kombination. Ist ja nicht so oft Thema"}, {"id": 99, "start": 783.72, "end": 788.84, "text": "bei mir. Und es könnte sogar sein, dass ich das schon mal erzählt hab, weil das war so ein, ähm,"}, {"id": 100, "start": 790.2, "end": 795.8, "text": "einschneidendes Erlebnis, wo ich die Welt nicht mehr verstanden hab. Wo fang ich denn jetzt am besten an?"}, {"id": 101, "start": 797.0, "end": 803.8, "text": "Ähm, also ich bin mittlerweile, ich wusste, ich wusste vielleicht ein bisschen weiter ausholen. Ähm,"}, {"id": 102, "start": 805.8, "end": 811.64, "text": "ich hab mittlerweile echt so meine Bedenken, was das anbelangt, wenn man Mädels irgendwie über"}, {"id": 103, "start": 811.64, "end": 816.12, "text": "das Internet kennenlernt. Weil ich hab die Erfahrung gemacht, ich, ich verallgemeiner das jetzt nicht,"}, {"id": 104, "start": 816.12, "end": 829.88, "text": "ja. Ähm, dass Mädels, die online sehr aktiv sind und da auch, ja wie sagt man so, online auf der"}, {"id": 105, "start": 829.88, "end": 835.32, "text": "Suche sind, ja. Oder sich vielleicht auch an die ein oder andere Leute ranwerfen online. Dass die"}, {"id": 106, "start": 835.32, "end": 841.08, "text": "sie oftmals nicht mal so alle haben. Und dazu will ich euch jetzt mal eine Sache erzählen. Vor fünf"}, {"id": 107, "start": 841.08, "end": 846.04, "text": "Jahren oder so, schon ewig her, also da, wo ich auf YouTube noch ein bisschen Videos gemacht hab,"}, {"id": 108, "start": 847.24, "end": 858.76, "text": "ähm, war ich auch mal in Kontakt mit so jemand. Und das, ich muss jetzt gucken, wie ich das jetzt"}, {"id": 109, "start": 858.76, "end": 864.12, "text": "erzählen soll. Zumindest an sich war das gar nicht schlecht. Die war an sich, an sich hab ich mich auch"}, {"id": 110, "start": 864.12, "end": 871.24, "text": "gut mit ihr verstanden. Die war nett, die sah auch relativ gut aus. Und an sich haben wir uns echt"}, {"id": 111, "start": 871.24, "end": 879.8, "text": "ganz gut verstanden. Und ich hab mir die ganze Zeit so gedacht, irgendwas, irgendwas ist da merkwürdig."}, {"id": 112, "start": 879.8, "end": 887.96, "text": "Irgendwas, irgendwas stimmt da nicht. Sie hat erzählt, sie ist 21 und ähm, oder ich hab mir"}, {"id": 113, "start": 887.96, "end": 894.6, "text": "irgendwie so gedacht, so nach zwei Wochen, irgendwie, irgendwas stimmt da nicht. Hab ich gesagt, ey, okay,"}, {"id": 114, "start": 894.6, "end": 902.44, "text": "ähm, wie siehts dann aus, lass uns mal, lass uns noch mal treffen. Und eine Sache, die ich damals"}, {"id": 115, "start": 902.44, "end": 906.52, "text": "nicht, nicht so genau gecheckt habe, aber die eigentlich heute voll offensichtlich ist,"}, {"id": 116, "start": 907.56, "end": 913.56, "text": "ist, dass sie sich immer neue Ausreden ausgedacht hat, warum man sich nicht treffen kann. Aber"}, {"id": 117, "start": 913.56, "end": 918.28, "text": "trotzdem, auf der anderen Seite, die übelste Flirt-Action online gestartet hat, die ganze Zeit."}, {"id": 118, "start": 919.96, "end": 926.36, "text": "Und ich, ich hab's halt, ich hab's halt irgendwie nicht gecheckt. Das, das, das Gipfelte dann darin,"}, {"id": 119, "start": 926.36, "end": 931.48, "text": "dass wir, wir kannten uns nicht wirklich, ja. Nur online. Aber wie gesagt, sie hat die ultra,"}, {"id": 120, "start": 931.48, "end": 937.24, "text": "ultra Flirt-Action online gestartet. Und auch mit Bildern und allem. Und das war, war die auch,"}, {"id": 121, "start": 937.24, "end": 940.52, "text": "also das war jetzt nicht irgendwelche Fake-Geschichten oder so. Und auch teilweise"}, {"id": 122, "start": 940.52, "end": 945.16, "text": "für Dinger, was sie für Dinger geschrieben hat, ey. So irgendwie so nach dem Motto, ey, gleich,"}, {"id": 123, "start": 946.04, "end": 952.52, "text": "gleich geht's ab, ja. Und, und die Krönung der Sache war dann, dass sie dann irgendwann angefangen hat,"}, {"id": 124, "start": 953.32, "end": 958.6, "text": "schon online irgendwie Drama zu machen. Und so war zum Beispiel, da bin ich auf Twitter,"}, {"id": 125, "start": 960.04, "end": 967.56, "text": "da bin ich, ähm, bin ich einer Let's-Playerin gefolgt. Gefolgt, auf Twitter wohlgemerkt, ja."}, {"id": 126, "start": 967.56, "end": 973.64, "text": "Sonst nix. Und da hat die einen riesen Aufriss gemacht. Warum ich irgendwelchen anderen Mädels"}, {"id": 127, "start": 973.64, "end": 978.48, "text": "auf Twitter folge, das mach ich doch nur, dass ich, ähm, heimlich mit denen schreiben kann."}, {"id": 128, "start": 978.48, "end": 986.28, "text": "Da hab ich mir schon gedacht, Alter, jetzt, jetzt wird's aber echt abgedreht irgendwie."}, {"id": 129, "start": 986.28, "end": 998.88, "text": "Und, ähm, naja, Ende vom Lied war, das hat nicht funktioniert, aber, ähm, also, dass man ein Drama"}, {"id": 130, "start": 998.88, "end": 1004.64, "text": "macht, weil man einer Let's-Playerin auf Twitter folgt, ist schon echt abgedreht. Ich will jetzt"}, {"id": 131, "start": 1004.64, "end": 1009.68, "text": "auch nicht zu, nicht zu sehr ins Detail gehen, weil, da gab's dann schon noch ein paar Sachen,"}, {"id": 132, "start": 1009.68, "end": 1015.6, "text": "die für alle Seiten nicht so, äh, wo ich, wo man nicht will, dass sie jeder weiß, ja, aber,"}, {"id": 133, "start": 1015.6, "end": 1021.84, "text": "aber das mit Let's-Playerin folgen auf Twitter war schon, war schon echt so ein Highlight, wo ich"}, {"id": 134, "start": 1021.84, "end": 1029.88, "text": "mir gedacht hab, die Mädels online, die spinnen alle ein bisschen. Was macht sie heute? Ich glaub,"}, {"id": 135, "start": 1029.88, "end": 1049.2, "text": "die arbeitet bei irgendeinem Amt. Ich glaub, beim Umweltamt oder so war das. Stadt sag ich jetzt nicht."}, {"id": 136, "start": 1049.2, "end": 1056.88, "text": "Junge, dein Desktop, Wirechamp. Warum? Doch, perfekt. Ich mein, was will man denn mehr als Desktop haben?"}, {"id": 137, "start": 1056.88, "end": 1066.44, "text": "Wenn ich einem männlichen Let's-Player gefolgt werde, ja, dann, ja, man weiß ja nie. Außerdem"}, {"id": 138, "start": 1066.44, "end": 1070.32, "text": "ist es ja in der heutigen Zeit nur wirklich keine Chance, äh, keine Schande. Übrigens,"}, {"id": 139, "start": 1070.32, "end": 1072.76, "text": "ich muss erst mal gucken, falls ich irgendwelche Subs verpasst hab, muss ich jetzt mal nachschauen,"}, {"id": 140, "start": 1072.76, "end": 1079.28, "text": "wo ich das überhaupt sehe auf Streamlabs, Streamlabs, wo es Subs gegeben hat. Subs,"}, {"id": 141, "start": 1079.28, "end": 1086.92, "text": "wen haben wir als letztes? Vor vier Minuten, ähm, Spread the Beast hat an T-Max Electronics"}, {"id": 142, "start": 1086.92, "end": 1093.04, "text": "gegiftet. Dankeschön für den Sub. Ah, man sieht den Unterschied, ob Tier 1 oder Prime. Aha."}, {"id": 143, "start": 1093.04, "end": 1113.84, "text": "Ich entdeckte es jetzt auch zum ersten Mal. Die Icons, ne, das ist, ähm, ist halt Streaming-Account."}, {"id": 144, "start": 1113.84, "end": 1117.24, "text": "Ich ziehe halt einfach alles, was ich irgendwie hier im Stream mache, auf den Desktop und lasse"}, {"id": 145, "start": 1117.24, "end": 1131.64, "text": "es dann da rumgabbeln, ja. Was war denn das jetzt? Was war das? Bits, ah, vier Bits, wie"}, {"id": 146, "start": 1131.64, "end": 1138.8, "text": "viel sind das, vier Bits? Also, huge, huge Bits Donation, Poggers, keine Ahnung, wie"}, {"id": 147, "start": 1138.8, "end": 1148.0, "text": "viele das sind, aber, sehr, sehr nice. Was sind denn? Vier Bits, ein Cent, äh, nein,"}, {"id": 148, "start": 1148.0, "end": 1170.04, "text": "vier, vier Cent, ein Bit, ein Cent. Pog. Huge Pog. Ja, Leute, ähm, ich weiß jetzt"}, {"id": 149, "start": 1170.04, "end": 1174.84, "text": "gar nicht so genau, was ich eigentlich, ah, total, Dankeschön für den Sub. Ich muss"}, {"id": 150, "start": 1174.84, "end": 1179.16, "text": "mir jetzt irgendwelche, äh, Subsprüche ausdenken, dass ich nicht immer die gleichen Sachen"}, {"id": 151, "start": 1179.16, "end": 1186.28, "text": "sagen muss. Eat Platz 1, Spread Beasts, oh, jetzt gibt's sogar, gibt's sogar lila Bits."}, {"id": 152, "start": 1186.28, "end": 1195.44, "text": "Ich muss euch jetzt mal was sagen, ähm, diese ganze Cheering-Geschichte und so, die ist"}, {"id": 153, "start": 1195.44, "end": 1204.24, "text": "natürlich sehr nice, weil Easy Money und Easy Life und, äh, und so, aber ich persönlich"}, {"id": 154, "start": 1204.24, "end": 1212.32, "text": "bin jemand, der hat die ganzen Bit-Geschichten und, und Top-Bit-Donator per Plugin ausgeblendet"}, {"id": 155, "start": 1212.32, "end": 1223.96, "text": "auf anderen Channels. Weil das immer was vom, vom Chat wegnimmt und das nervt mich. Vielleicht"}, {"id": 156, "start": 1223.96, "end": 1229.84, "text": "sollten wir mal Kirby ausmachen, was anderes anmachen. Ähm, übrigens, irgendjemand hat"}, {"id": 157, "start": 1229.84, "end": 1237.44, "text": "auch gerade gefragt, was ich so für, ähm, Technik-Channels auf, auf YouTube empfehlen"}, {"id": 158, "start": 1237.44, "end": 1242.0, "text": "würde. Äh, also mir fallen, mir fallen jetzt aus dem Kopf zwei Stück ein, die ich richtig"}, {"id": 159, "start": 1242.0, "end": 1248.12, "text": "gut finde. Das eine ist ein bisschen was seriöses, das andere eher nicht. Also, wen, wen ich"}, {"id": 160, "start": 1248.12, "end": 1259.92, "text": "richtig gut finde, ist, ähm, den Schweizer. Wenn's um, äh, so Micro-Controller-Geschichte"}, {"id": 161, "start": 1259.92, "end": 1268.8, "text": "geht, guck ich mir den echt gerne an. Der hat, äh, viele interessante Tutorials. Ähm,"}, {"id": 162, "start": 1268.8, "end": 1272.24, "text": "es ist nicht alles was, manche Sachen wie PoE und so, brauch ich, juckt mich nicht so"}, {"id": 163, "start": 1272.24, "end": 1279.28, "text": "wirklich. Ähm, aber das ist richtig gut, wenn man sich für Micro-Controller-Kram interessiert."}, {"id": 164, "start": 1279.28, "end": 1283.76, "text": "Kann ich echt empfehlen. Auch wenn er, wenn er seine neueste China-Post auspackt, ist richtig"}, {"id": 165, "start": 1283.76, "end": 1288.92, "text": "gut. Da lernt man nämlich auch, ähm, die ein oder anderen Geräte kennen. Hat er auch"}, {"id": 166, "start": 1288.92, "end": 1294.2, "text": "so den typischen Schweizer Akzent. Ja, du musst dir mal sein Intro anhören. Hat er."}, {"id": 167, "start": 1294.2, "end": 1300.24, "text": "Hat er. Der sagt sogar, äh, am Anfang, was mit seinem Schweizer Akzent. So, und der"}, {"id": 168, "start": 1300.24, "end": 1311.44, "text": "mit Abstand unterhaltsamste, so, Elektronik-Technik-Kanal ist der hier. Der hier. Das ist der beste."}, {"id": 169, "start": 1311.44, "end": 1320.2, "text": "Das ist der beste, ey. Also, also, man muss dazu sagen, der hat, der ist jetzt nicht irgendwie"}, {"id": 170, "start": 1320.2, "end": 1323.92, "text": "unbekannt oder so, 2,6 Millionen Abos. Ich glaube aber, das ist ein Channel, der wäre"}, {"id": 171, "start": 1323.92, "end": 1327.48, "text": "in Deutschland nicht erfolgreich. Ich glaube, das ist ein Channel, der wäre in Deutschland"}, {"id": 172, "start": 1327.48, "end": 1334.88, "text": "nicht erfolgreich. Ähm, der ist zu anspruchsvoll und lustig gleichermaßen. Das kapiert, glaube"}, {"id": 173, "start": 1334.88, "end": 1343.52, "text": "ich, so, dass, ähm, nur nach 15 Let's-Player-Gucker in Deutschland nicht. Ähm, aber das ist,"}, {"id": 174, "start": 1343.52, "end": 1350.16, "text": "das ist wirklich lustig. Der schockt sich so gefühlt zehnmal pro Video. Und der hat"}, {"id": 175, "start": 1350.16, "end": 1356.84, "text": "eine der besten Erklärungen, die ich je gesehen hab, zum Thema Stromwiderstand, Leitungswiderstand"}, {"id": 176, "start": 1356.84, "end": 1363.12, "text": "und wie das alles zusammenhängt, die ich je gesehen hab. So gut erklärt und lustig"}, {"id": 177, "start": 1363.12, "end": 1372.28, "text": "dabei, übelst huge. Noch mehr Bits, 500 Bits, krasser Scheiß, ja. 500 Cent, 5 Euro,"}, {"id": 178, "start": 1372.28, "end": 1385.48, "text": "krass, nice, danke, huge brain. So, das sind, das sind so die zwei, ähm, das sind so die"}, {"id": 179, "start": 1385.48, "end": 1390.6, "text": "zwei Channels, die mir jetzt spontan einfallen, die ich eigentlich, wo ich jedes Video gucke,"}, {"id": 180, "start": 1390.6, "end": 1396.88, "text": "wo ich schon quasi darauf warte, dass sie ein neues Video machen. Ähm, es gibt, es"}, {"id": 181, "start": 1396.88, "end": 1400.04, "text": "gibt noch mehr, aber da müssen wir mal Gedanken zu machen. Also, das sind aber die ersten,"}, {"id": 182, "start": 1400.04, "end": 1405.88, "text": "die mir direkt einfallen. Klatzt du auch wie andere auf deinen Bauch, wenn jemand zappt?"}, {"id": 183, "start": 1405.88, "end": 1413.32, "text": "Nee. Warum soll ich auf meinen Bauch klatschen? Ich meine, ich, ich hätte potenziell genug"}, {"id": 184, "start": 1413.32, "end": 1419.76, "text": "Bauch, um da drauf zu klatschen, wenn jemand zappt. Ben Eater ist auch cool, ähm, ja,"}, {"id": 185, "start": 1419.76, "end": 1424.0, "text": "stimmt, der ist mir jetzt gar nicht eingefallen. Vor allem die Grafikkartenvideos waren sehr"}, {"id": 186, "start": 1424.0, "end": 1439.72, "text": "nice. Warum, vor allem, warum sollte man auf seinen Bauch klatschen? The Hook ist auch"}, {"id": 187, "start": 1439.72, "end": 1459.68, "text": "ein guter Job. Ja, ist das nice. Sehr, sehr schön. Ähm, gucken wir mal, ob mein Tool"}, {"id": 188, "start": 1459.68, "end": 1465.64, "text": "wieder verbugt ist heute. Drunk Stream bei 100er Subgoal. Ja, an Silvester vielleicht."}, {"id": 189, "start": 1465.64, "end": 1475.64, "text": "Gab's während deiner YouTube-Karriere eigentlich richtige, also so richtig, so richtig quasi"}, {"id": 190, "start": 1475.64, "end": 1485.88, "text": "wie Fanboys nur als Grills eigentlich nur eins. Und nicht die, die ich gerade eben erzählt"}, {"id": 191, "start": 1485.88, "end": 1493.72, "text": "hab, eigentlich nur eins. Aber ich bin jetzt nicht derjenige, der irgendwie, ähm, mit"}, {"id": 192, "start": 1493.72, "end": 1499.28, "text": "seinen Videos hier die Scharen von, von Hotten-Fan-Grills anzieht, ja. Dazu fehlt natürlich"}, {"id": 193, "start": 1499.28, "end": 1507.84, "text": "auch, dass ich nicht vor der Kamera rumspringe, weil da weiß ja gar keiner, was Sache ist,"}, {"id": 194, "start": 1507.84, "end": 1513.72, "text": "ja. Hast du irgendwas mit Informatik oder Elektrotechnik studiert? Nein, hab ich nicht"}, {"id": 195, "start": 1513.72, "end": 1522.44, "text": "studiert. Ich hab vor über 10 Jahren, 15 Jahren, fast, 15 Jahren, die Ausbildung gemacht"}, {"id": 196, "start": 1522.44, "end": 1537.84, "text": "zur Empfang informatischer Systemintegration. Damals, so in grauer Vorzeit. Ja, ihr wisst,"}, {"id": 197, "start": 1537.84, "end": 1556.28, "text": "wie mein Klo aussieht, das ist richtig. Wie alt ich bin? Nächsten Monat, im August,"}, {"id": 198, "start": 1556.28, "end": 1583.08, "text": "bin ich 35. 35, ja. Tja, OKS, ja. Ich weiß, ich würd mich selbst auch nicht als 35 sehen."}, {"id": 199, "start": 1583.08, "end": 1596.08, "text": "Hab das falsche geklickt. Ich seh, also bei mir im Kopf bin ich höchstens, höchstens"}, {"id": 200, "start": 1596.08, "end": 1601.84, "text": "paarundzwanzig. Ich würd mich auch nicht als 35 sehen. Also wenn ich an mein Alter denk,"}, {"id": 201, "start": 1601.84, "end": 1613.52, "text": "bin ich nie an 35. Geht dem Fabian übrigens auch so. Aber siehst du, wie Fabian auch 20"}, {"id": 202, "start": 1613.52, "end": 1617.8, "text": "Jahre jünger aus, als du bist? Nee, nicht ganz. Bei Fabian ist es extrem. Der Fabian"}, {"id": 203, "start": 1617.8, "end": 1625.2, "text": "sieht ja wirklich aus wie, keine Ahnung, 23 oder so. Bei mir ist das Problem, dass ich"}, {"id": 204, "start": 1625.2, "end": 1628.96, "text": "in der Mitte schon relativ wenig Haare hab. Also ich seh tatsächlich schon ein bisschen"}, {"id": 205, "start": 1628.96, "end": 1633.68, "text": "älter aus. Also ich hab keine Platz, aber man sieht halt auch schon, dass da nicht mehr"}, {"id": 206, "start": 1633.68, "end": 1663.64, "text": "nicht bei all zu viel ist hinten, ja. Also es ist übrigens, ähm, sehr, sehr, sehr"}, {"id": 207, "start": 1663.64, "end": 1670.96, "text": "ziemlich verbreitet, glaub ich, dass heute Leute schon mit teilweise 25 anfangen, ähm,"}, {"id": 208, "start": 1670.96, "end": 1676.12, "text": "quasi auf dem Kopf weniger Haare zu kriegen. Liegt bestimmt an der ganzen Handy-Strahlung."}, {"id": 209, "start": 1676.12, "end": 1698.2, "text": "Bist 24, bist grau, ja, ja. Kennst du die Seite Apollo in Realtime? Ja, das kenn ich,"}, {"id": 210, "start": 1698.2, "end": 1712.84, "text": "das kenn ich. Ja, Moonmon hat auch so wenig Haare, das stimmt. Leute, ich hab keinen Plan,"}, {"id": 211, "start": 1712.84, "end": 1717.04, "text": "was ich heute machen soll, ne. Ich hab einfach jetzt nur Streben angemacht, weil ich mir"}, {"id": 212, "start": 1717.04, "end": 1722.0, "text": "gedacht hab, wenn ich jetzt, wenn ich schon Twitch Prime, oder wenn ich schon Partner"}, {"id": 213, "start": 1722.0, "end": 1728.28, "text": "freigeschaltet wurde heute. Da mach ich jetzt einfach Streben an. Übrigens, ähm, für alle,"}, {"id": 214, "start": 1728.28, "end": 1731.72, "text": "die vielleicht auch ein bisschen an Overwatch interessiert sind, habt ihr gesehen, dass"}, {"id": 215, "start": 1731.72, "end": 1738.0, "text": "es einen neuen Patch gibt, also auf dem PTR, einen neuen Patch mit endlich, endlich, äh,"}, {"id": 216, "start": 1738.0, "end": 1744.4, "text": "Role Queue, separaten Placements für die unterschiedlichen Rollen, oder auch ganz gute"}, {"id": 217, "start": 1744.4, "end": 1750.04, "text": "Balancing-Anpassungen. Das könnte, es ist ja nicht so, als dass, dass das Leute, wie"}, {"id": 218, "start": 1750.04, "end": 1754.4, "text": "sie, also, ich sag das seit zwei Jahren schon, oder mehr oder weniger seit Release, dass"}, {"id": 219, "start": 1754.4, "end": 1758.92, "text": "man sowas braucht. Genauso wie ich seit Release gesagt hab, man braucht einen Spectator-Modus."}, {"id": 220, "start": 1758.92, "end": 1763.04, "text": "Allerdings, ich bin ja nicht der Einzige, warum sollten die auf mich hören, ähm, das"}, {"id": 221, "start": 1763.04, "end": 1766.56, "text": "sagen so ziemlich alle anderen Leute, die sich intensiv mit dem Spiel beschäftigt haben,"}, {"id": 222, "start": 1766.56, "end": 1774.0, "text": "auch schon seit Jahren. Und jetzt, als Blizzard endlich geschafft, das könnte sogar so weit"}, {"id": 223, "start": 1774.0, "end": 1778.28, "text": "gehen, dass ich mir echt mal wieder, ähm, Overwatch antue, allerdings erstmal nicht"}, {"id": 224, "start": 1778.28, "end": 1786.84, "text": "im Stream. Overwatch hatte keinen Spectator-Modus, nein, nein. Overwatch wurde als übelste E-Sport-Geschichte"}, {"id": 225, "start": 1786.84, "end": 1791.6, "text": "gehypt, auch mit Overwatch League und allem, hatte aber bis vor kurzem keinen Spectator-Modus."}, {"id": 226, "start": 1791.6, "end": 1798.2, "text": "Ja, ich weiß nicht, wenn ein Game E-Sport ready sein kann, wenn es keinen Spectator gibt."}, {"id": 227, "start": 1798.2, "end": 1808.44, "text": "Einen schönen Panzer-Ei. Sub ist raus. Kann man nicht beim Subscriben irgendeine Nachricht"}, {"id": 228, "start": 1808.44, "end": 1824.2, "text": "angeben, die dann angezeigt wird? Oder geht das nur bei Bits? Ach, nur beim Resub. Ah,"}, {"id": 229, "start": 1824.2, "end": 1829.56, "text": "das ist natürlich huge. Das ist Big Brain von Twitch. Das verleiht die Leute natürlich"}, {"id": 230, "start": 1829.56, "end": 1839.76, "text": "zum Resub, ne? Gerüchtet zu Overwatch 2 mitbekommen. Ah, da bin ich, da bin ich nicht"}, {"id": 231, "start": 1839.76, "end": 1844.72, "text": "so, das glaube ich nicht so, dass in nächster Zeit Overwatch 2 rauskommt."}, {"id": 232, "start": 1844.72, "end": 1867.92, "text": "Jeden Tag Sellout-Stream, ja. Hast du doch irgendwas rumliegen, das du flashen kannst?"}, {"id": 233, "start": 1867.92, "end": 1880.24, "text": "Ja, habe ich, denn vorgestern oder so ist eine neue Firmware rausgekommen für, ist das"}, {"id": 234, "start": 1880.24, "end": 1894.76, "text": "Ding so? Kann man nicht merken, wie das heißt. Das ist so ein grausamer Name, das da. Vor"}, {"id": 235, "start": 1894.76, "end": 1903.4, "text": "ein paar Tagen, vor zwei Tagen oder so, ist endlich Version 0.4 von der Custom-Filmware"}, {"id": 236, "start": 1903.4, "end": 1913.16, "text": "für meinen Staubsauger erschienen. Und ich dachte mir, da können wir uns viel meinen"}, {"id": 237, "start": 1913.16, "end": 1938.08, "text": "Staubsauger wieder flashen. Ja, Staubsauger-Flashen. Machs gut Patrick, bis denn."}, {"id": 238, "start": 1943.16, "end": 1956.6, "text": "Ist das eigentlich ein Mod für die Original-Firmware oder kompletter Recode? Das ist ein Mod für"}, {"id": 239, "start": 1956.6, "end": 1966.76, "text": "die Original-Firmware. Allerdings haben sie halt den ganzen China-Cloud-Kram rausgebaut."}, {"id": 240, "start": 1966.76, "end": 1976.84, "text": "Die haben das ziemlich clever gemacht. Die Firmware ist halt so programmiert, das kenne"}, {"id": 241, "start": 1976.84, "end": 1984.16, "text": "ich, das kenne ich, das habe ich letztens auch geguckt. Muss ich sagen, ich fand es"}, {"id": 242, "start": 1984.16, "end": 1992.28, "text": "jetzt nicht so lustig, weil ich kann über irgendwelche Ragdoll-Animationen von Spielen"}, {"id": 243, "start": 1992.28, "end": 2003.64, "text": "irgendwie nicht mehr lachen. Davon hat man zu viel schon gesehen. Ja, die haben das relativ"}, {"id": 244, "start": 2003.64, "end": 2011.8, "text": "clever gemacht hier mit der Firmware. Die haben die Original-Version genommen oder die"}, {"id": 245, "start": 2011.8, "end": 2019.16, "text": "nehmen die Original-Version von der offiziellen Staubsauger-Firmware und wiegen die Request"}, {"id": 246, "start": 2019.16, "end": 2023.96, "text": "in die China-Cloud quasi lokal auf den Web-Server um, der von ihnen ist. Also im Prinzip ist"}, {"id": 247, "start": 2023.96, "end": 2030.08, "text": "das hier mehr oder weniger die Original-Firmware, bloß dass die, die haben eine Firewall drauf"}, {"id": 248, "start": 2030.08, "end": 2034.76, "text": "gehauen, dass das Ding nicht mehr mit China reden kann und sie biegen quasi, es hat gerade"}, {"id": 249, "start": 2034.76, "end": 2044.6, "text": "geklingelt, ja, ja. Und die biegen dann alle Request um auf den lokalen Web-Server und"}, {"id": 250, "start": 2044.6, "end": 2049.76, "text": "die Firmware denkt, sie reden mit der China-Cloud, in Wirklichkeit redet sie lokal mit dem Web-Server"}, {"id": 251, "start": 2049.76, "end": 2064.04, "text": "hier. Das ist eigentlich ziemlich clever gemacht. Könntest du das nicht auch über den Router"}, {"id": 252, "start": 2064.04, "end": 2074.2, "text": "machen, oh sorry Leute, der Router, und den Server bloß nachbauen. Klar, du kannst auch"}, {"id": 253, "start": 2074.2, "end": 2077.52, "text": "den Raspberry irgendwo hinstellen, das drauf laufen lassen. Die haben es halt so gemacht,"}, {"id": 254, "start": 2077.52, "end": 2084.68, "text": "dass alles auf einem Gerät läuft. BeatBot, ja, ja, könntest du wahrscheinlich machen,"}, {"id": 255, "start": 2084.68, "end": 2089.16, "text": "aber ich meine, es ist ja ganz praktisch, wenn alles auf einem Gerät läuft. Aber ja,"}, {"id": 256, "start": 2089.16, "end": 2093.6, "text": "das würde wahrscheinlich auch so funktionieren. Ich weiß allerdings nicht, nee, ich glaube,"}, {"id": 257, "start": 2093.6, "end": 2097.16, "text": "ganz wird es nicht funktionieren, du brauchst so ein paar Firewall in Regel, die Request"}, {"id": 258, "start": 2097.16, "end": 2106.0, "text": "blocken, die auf feste IPs gehen. Davoco, so sieht es aus. Siehst du mal, was ich für"}, {"id": 259, "start": 2106.0, "end": 2116.52, "text": "den Streben alles hier wieder für Verluste erleide. Ups. Dann müsste man den Staubsauger"}, {"id": 260, "start": 2116.52, "end": 2127.92, "text": "nicht mehr routen. Und das ist richtig. Dafür hast du dann immer noch China Spyware drauf."}, {"id": 261, "start": 2127.92, "end": 2132.96, "text": "Es ist kein Akt, den Staubsauger zu routen. Es ist nicht schwierig. Das machen wir morgen"}, {"id": 262, "start": 2132.96, "end": 2145.52, "text": "dann im Stream. Morgen wird Staubsauger geroutet. Heute können wir das nicht mehr machen, weil"}, {"id": 263, "start": 2145.52, "end": 2152.32, "text": "da muss ich erstmal die Ladestation unter dem Schrank ausbauen. Ich habe das Kabel unter"}, {"id": 264, "start": 2152.32, "end": 2154.96, "text": "dem Schrank durch, hinter dem Schrank hoch an die Steckdosen, da muss ich erst wieder"}, {"id": 265, "start": 2154.96, "end": 2157.96, "text": "auf die Erde rumkriechen, bis ich das rauskriege, da habe ich heute keinen Bock. Das machen"}, {"id": 266, "start": 2157.96, "end": 2167.44, "text": "wir morgen. Morgen wird Staubsauger geflasht. Die Bits sind aktiviert. Ja, falls ich irgendwie"}, {"id": 267, "start": 2167.44, "end": 2173.32, "text": "übersehe, Leute, wenn es hier irgendwie Huge Donation oder Bits oder sonst was gibt und"}, {"id": 268, "start": 2173.32, "end": 2180.56, "text": "ich übersehe es, dann spampt mich wieder voll. Weil manchmal bin ich so am Schwätzen, dann"}, {"id": 269, "start": 2180.56, "end": 2188.24, "text": "höre ich auch irgendwelche Sounds nicht. Da muss ich jetzt immer mal ein Auge auf Streamlabs"}, {"id": 270, "start": 2188.24, "end": 2198.48, "text": "halten. In welcher Kategorie streame ich eigentlich gerade? Oh, Raiddy Germany habe ich übersehen."}, {"id": 271, "start": 2198.48, "end": 2213.84, "text": "Ich gucke mal, ob ich das sehe in Steamlabs. Nö. Doch, ein Bit. Kappa 1. Kappa 1, 2, 3."}, {"id": 272, "start": 2213.84, "end": 2221.12, "text": "Golden Kappa Check. Science and Technology. Leute, Golden Kappa Check. Ich weiß gar nicht,"}, {"id": 273, "start": 2221.12, "end": 2234.36, "text": "ob es das überhaupt noch gibt. Das ist bestimmt Voraussetzung, dass man Twitch-Partner ist,"}, {"id": 274, "start": 2234.36, "end": 2241.6, "text": "dass man Golden Kappa kriegt. Bist du eigentlich der einzige deutsche Partner in Science and"}, {"id": 275, "start": 2241.6, "end": 2246.64, "text": "Technology? Glaube ich nicht. Aber ich finde es so geil, dass wir eigentlich der größte"}, {"id": 276, "start": 2246.64, "end": 2267.84, "text": "Stream immer sind in Science and Technology. Einfach so, das ist halt schon nice. Die anderen"}, {"id": 277, "start": 2267.84, "end": 2274.88, "text": "sind aber halt auch nicht so gut. Gibt bestimmt gute. Ich gucke an sich relativ wenig. Wisst"}, {"id": 278, "start": 2274.88, "end": 2282.36, "text": "ihr, was ich auf Twitch aktuell ein bisschen blöd finde? Die hatten mal so eine Community-Übersicht"}, {"id": 279, "start": 2282.36, "end": 2290.8, "text": "eingeführt, wo das ganze gruppiert war nach Speedrunning oder nach Roleplay oder sonst"}, {"id": 280, "start": 2290.8, "end": 2295.72, "text": "was nach Dungeons and Dragons oder irgendwas in der Richtung. Das haben sie jetzt abgeschafft."}, {"id": 281, "start": 2295.72, "end": 2305.08, "text": "Ich weiß, es gibt jetzt Tags, aber ich fand das so viel einfacher, Channels zu finden,"}, {"id": 282, "start": 2305.08, "end": 2314.0, "text": "die man noch nicht kennt, aber die einem gefallen. Weil ich bin jemand, der guckt auch Leute,"}, {"id": 283, "start": 2314.0, "end": 2318.4, "text": "die Spiele spielen, die er nicht spielt. Ich gucke zum Beispiel auch öfters mal irgendwelche"}, {"id": 284, "start": 2318.4, "end": 2326.0, "text": "Apex-Streams, obwohl ich das Game noch nicht einmal installiert hatte. Einfach so, weil"}, {"id": 285, "start": 2326.0, "end": 2331.36, "text": "ich da gerne zugucke. Meistens finde ich die Leute allerdings dann nicht über Apex,"}, {"id": 286, "start": 2331.36, "end": 2338.0, "text": "weil wenn du auf die Kategorie gehst, hast du erstmal alles voll mit Streams mit irgendwie"}, {"id": 287, "start": 2338.0, "end": 2343.2, "text": "2000, 1000 plus Zuschauern, aber vielleicht gefällt dir ja der Stream mit 300 besser."}, {"id": 288, "start": 2343.2, "end": 2350.4, "text": "Also ich finde es allgemein schwierig gerade neue Streamer zu entdecken, die mir gefallen."}, {"id": 289, "start": 2350.4, "end": 2358.28, "text": "Das fand ich mit den Communities ganz gut und finde ich jetzt mit den Tags nicht so gut"}, {"id": 290, "start": 2358.28, "end": 2364.4, "text": "gelöst. Ne, das normale Sub ist nicht Verlängerung."}, {"id": 291, "start": 2364.4, "end": 2371.44, "text": "Jedoch, du kannst das ankreuzen. Aber ich habe meine Subs immer ohne Verlängerung gemacht."}, {"id": 292, "start": 2371.44, "end": 2373.96, "text": "Ich will natürlich jetzt nicht sagen, dass ihr eure Subs ohne Verlängerung machen sollt."}, {"id": 293, "start": 2373.96, "end": 2378.08, "text": "Also Subs mit Verlängerung ist natürlich das beste, was es überhaupt gibt. Da könnt"}, {"id": 294, "start": 2378.08, "end": 2382.48, "text": "ihr nicht vergessen zu suppen. Aber ich habe meine Subs immer ohne Verlängerung."}, {"id": 295, "start": 2382.48, "end": 2392.32, "text": "Du hast mich spontan entdeckt. Das finde ich nice. Was ich an sich auch wirklich cool"}, {"id": 296, "start": 2392.32, "end": 2396.84, "text": "finde, ist, dass mittlerweile relativ viele Leute hier sind, die eben nicht über YouTube"}, {"id": 297, "start": 2396.84, "end": 2406.84, "text": "gekommen sind. Ja, das kann sein, dass das automatisch drin war. Aber man kann es auf"}, {"id": 298, "start": 2406.84, "end": 2420.0, "text": "jeden Fall auch machen, dass es nicht automatisch ist. Ja, das finde ich wirklich nice. Es sind"}, {"id": 299, "start": 2420.0, "end": 2427.84, "text": "mittlerweile viele Leute, Stammzuschauer da, die es eben nicht über YouTube kennen. Was"}, {"id": 300, "start": 2427.84, "end": 2435.28, "text": "auch der Grund ist, warum ich mich nicht so genannt habe wie auf YouTube. Ja, natürlich"}, {"id": 301, "start": 2435.28, "end": 2442.4, "text": "sind viele hier von YouTube. Aber es gibt auch viele, die sind nicht von YouTube. Haha,"}, {"id": 302, "start": 2442.4, "end": 2451.56, "text": "Reilly, das ist natürlich geil. Wolltest du gleich mal den Imposer hier... Imposer? Heißt"}, {"id": 303, "start": 2451.56, "end": 2462.56, "text": "es Imposer? Imposter? Imposter? Imposer? Wie heißt denn das? Englische Vokabel in 2K19."}, {"id": 304, "start": 2462.56, "end": 2466.48, "text": "Könntest du dir vorstellen, Technikvideos für YouTube zu machen? Eine sehr gute Frage,"}, {"id": 305, "start": 2466.48, "end": 2478.24, "text": "die ich mir vorgelegt habe. Ich habe mir nämlich schon Anfang des Jahres, oder eigentlich"}, {"id": 306, "start": 2478.24, "end": 2484.88, "text": "Dezember letzten Jahres, überlegt, was kannst du auf YouTube machen, was dir selber gefällt,"}, {"id": 307, "start": 2484.88, "end": 2490.2, "text": "was den Leuten auch gefällt, ohne dass du jetzt quasi einen neuen Channel machen musst"}, {"id": 308, "start": 2490.2, "end": 2496.64, "text": "und ohne dass du den alten Kram komplett über Bord schmeißen musst. Dann bin ich zu dem"}, {"id": 309, "start": 2496.64, "end": 2501.44, "text": "Schluss gekommen. Ich könnte tatsächlich mehr Technikvideos machen. Ich bin mir nicht ganz"}, {"id": 310, "start": 2501.44, "end": 2506.64, "text": "sicher, in welcher Art und Weise. Ich werde weiterhin, wenn es Games gibt, die mich interessieren,"}, {"id": 311, "start": 2506.64, "end": 2511.2, "text": "was machen und auch weiterhin Labervideos zu allen aktuellen Themen. Allerdings würde"}, {"id": 312, "start": 2511.2, "end": 2514.8, "text": "ich gerne Technikvideos machen. Ohne mich jetzt direkt vor die Kamera zu setzen, allerdings"}, {"id": 313, "start": 2514.8, "end": 2520.08, "text": "auch mit Kamera, um was zu zeigen. Aber ich meine, bei Technikvideos ist das nicht so wild."}, {"id": 314, "start": 2520.08, "end": 2525.36, "text": "Da machst du die Kamera schräg hinter dich und zeigst es halt auf dem Tisch. Da muss"}, {"id": 315, "start": 2525.36, "end": 2528.64, "text": "ich noch gucken, wie ich das mache. Da muss ich mir hier eine Ecke hinstellen. Da muss"}, {"id": 316, "start": 2528.64, "end": 2532.68, "text": "ich mir irgendwie eine Ecke einrichten mit Tisch. Vielleicht einen Queenscreen dahinter,"}, {"id": 317, "start": 2532.68, "end": 2536.68, "text": "dass man auch mal einen schönen Hintergrund machen kann. Noch ordentlicher Beleuchtung."}, {"id": 318, "start": 2536.68, "end": 2544.84, "text": "Und genau, so machen wir das. Dann flashen wir Katja Krasavitz das Vibrator. Das ist"}, {"id": 319, "start": 2544.84, "end": 2561.44, "text": "diese Idee, ey. Alter. Das wird bestimmt sowas von steil gehen. Dann müssen wir Clickbait-Überschrift"}, {"id": 320, "start": 2561.44, "end": 2576.2, "text": "machen. Computer-Nerd entdeckt geheimen Trick. YouTuber hassen ihn dafür. Irgendwie sowas"}, {"id": 321, "start": 2576.2, "end": 2585.28, "text": "in der Richtung. Max-Tech-Tipps. Naja, das wäre fast schon ein bisschen zu kopiert."}, {"id": 322, "start": 2585.28, "end": 2594.88, "text": "Aber von der Idee her, würde ich da schon gerne mehr Videos machen. Weil es gibt, ich"}, {"id": 323, "start": 2594.88, "end": 2600.72, "text": "hab's ja am Anfang schon mal gesagt, es gibt relativ viele Videos, die sich im Chrome mit"}, {"id": 324, "start": 2600.72, "end": 2608.16, "text": "Technik beschäftigen auf YouTube. Ich hab allerdings den Eindruck, dass es da oftmals,"}, {"id": 325, "start": 2608.16, "end": 2615.16, "text": "wie soll ich das sagen, das kratzt an der Oberfläche. Allerdings auch, weil das gewollt"}, {"id": 326, "start": 2615.16, "end": 2618.72, "text": "ist. Ich will den meisten Leuten gar nicht mal unterstellen, dass ich es nicht besser"}, {"id": 327, "start": 2618.72, "end": 2624.92, "text": "machen kann. Die meisten YouTube-Zuschauer wollen das ja auch gar nicht großartig detailliert"}, {"id": 328, "start": 2624.92, "end": 2629.84, "text": "wissen. Oder aber es werden nur Smartphones gezeigt oder Tablets gezeigt. Oder was auch"}, {"id": 329, "start": 2629.84, "end": 2634.12, "text": "bei den Technik-Channels in letzter Zeit voll im Trend ist, da zeigen wir irgendwie"}, {"id": 330, "start": 2634.12, "end": 2638.4, "text": "die Handys und danach, da zeigen wir Autos und sowas auf einmal, wo ich mir denke, okay,"}, {"id": 331, "start": 2638.4, "end": 2641.8, "text": "das hätte ich jetzt eigentlich auf solchen Channels nicht vermutet. Aber Autos werdet"}, {"id": 332, "start": 2641.8, "end": 2647.92, "text": "ihr bei mir wahrscheinlich nicht sehen, ihr wisst, dass das nicht wirklich mein Thema"}, {"id": 333, "start": 2647.92, "end": 2653.72, "text": "ist. Aber ich werde wahrscheinlich versuchen, also wenn es so hinhaut, wie ich mir das vorgestellt"}, {"id": 334, "start": 2653.72, "end": 2662.88, "text": "hab, danke Roffel1436 Twitch Prime. Übrigens Leute, wer ist sein Amazon-Account? Sein Amazon"}, {"id": 335, "start": 2662.88, "end": 2667.96, "text": "Prime-Account noch nicht mit Twitch verknüpft hat, das ist seit, glaube ich, zwei Jahren"}, {"id": 336, "start": 2667.96, "end": 2673.72, "text": "möglich. Man bekommt kostenlose Drops dafür in seinen Twitch-Account und man kann den"}, {"id": 337, "start": 2673.72, "end": 2681.24, "text": "Streamer seiner Wahl kostenlos einmal im Monat mit einem Twitch Prime-Sub unterstützen. Sellout-Modus"}, {"id": 338, "start": 2681.24, "end": 2690.88, "text": "activated. Danke für die Subs. Le Kickpuncher, Tynesaur, jetzt, oh, oh, der Sellout haut"}, {"id": 339, "start": 2690.88, "end": 2711.16, "text": "rein, jetzt geht's ja Schlag auf Schlag hier. Redest du eigentlich wirklich über Twitch"}, {"id": 340, "start": 2711.16, "end": 2715.24, "text": "Prime oder spielst du das Snippet nur mit dem Meme-Tool ab? Das müsste ich echt machen,"}, {"id": 341, "start": 2715.24, "end": 2721.76, "text": "ich müsste mal so meinen besten, meinen bestmöglichen Sellout aufnehmen und den einfach immer wieder"}, {"id": 342, "start": 2721.76, "end": 2730.24, "text": "abspielen. Wie gesagt Leute, heute gibt's einfach nur, machen wir einfach nur ein bisschen"}, {"id": 343, "start": 2730.24, "end": 2734.72, "text": "Laberstream, wenn ihr irgendwelche Fragen habt, ich könnte mich im Prinzip fragen,"}, {"id": 344, "start": 2734.72, "end": 2739.28, "text": "was ihr wollt, aber, oder Technik, sonst was, ist mir egal, ihr könnt mich alles möglich"}, {"id": 345, "start": 2739.28, "end": 2743.44, "text": "heute fragen. Wir machen noch ein bisschen Laberstream und morgen flashen wir dann den"}, {"id": 346, "start": 2743.44, "end": 2750.72, "text": "Staubsauger. Brauchst du noch ein Twitch Prime-Logo fürs Meme-Tool? Stimmt, brauche ich, das kann"}, {"id": 347, "start": 2750.72, "end": 2754.72, "text": "ich ja immer einplanten, wenn ich meinen stündlichen Sellout mache. Was wollte ich"}, {"id": 348, "start": 2754.72, "end": 2759.4, "text": "eben noch sagen? Technik-Videos auf YouTube, genau. Wie gesagt, würde ich wirklich gerne"}, {"id": 349, "start": 2759.4, "end": 2764.48, "text": "machen und wenn das so klappt, wie ich mir das Ganze vorgestellt hab, dann will ich das"}, {"id": 350, "start": 2764.48, "end": 2774.92, "text": "so machen, dass das schon einen relativ guten Detailgrad hat, dass man auch was mit anfangen"}, {"id": 351, "start": 2774.92, "end": 2780.04, "text": "kann. Zum Beispiel, würde ich gerne mal ein Video drüber machen, wie man, wenn man zum"}, {"id": 352, "start": 2780.04, "end": 2786.52, "text": "Beispiel, für sein Heimnetzwerk, wie man zum Beispiel sein Heimnetzwerk einrichten"}, {"id": 353, "start": 2786.52, "end": 2793.08, "text": "sollte, rein von der Einteilung her, dass es eben sicher ist und bequem zu nutzen für"}, {"id": 354, "start": 2793.08, "end": 2801.2, "text": "ein internes Netz, für WLAN, für einen Gäste-WLAN, für einen China-WLAN, ich weiß nicht,"}, {"id": 355, "start": 2801.2, "end": 2808.72, "text": "wie es anders nennen soll, für einen Heimautomatisierungs-WLAN und auch was da so ein bisschen dahintersteckt,"}, {"id": 356, "start": 2808.72, "end": 2814.48, "text": "warum man manche Sachen macht. Es gibt ja Leute, die sind heute immer noch der Meinung,"}, {"id": 357, "start": 2814.48, "end": 2821.24, "text": "dass es eine gute Idee ist, wenn man in seinem Router DMZ anklickt und es gibt immer noch"}, {"id": 358, "start": 2821.24, "end": 2827.44, "text": "Leute, die denken, dass DMZ tatsächlich bedeutet, man leitet alle Ports auf die PS4 weiter."}, {"id": 359, "start": 2827.44, "end": 2835.88, "text": "Das ist wirklich Pepehands an der Stelle. Das hat damit überhaupt nichts zu tun. Null."}, {"id": 360, "start": 2835.88, "end": 2840.36, "text": "Noch nicht mal der Name hat auch nur ansatzweise was damit zu tun. Aber es gibt immer noch"}, {"id": 361, "start": 2840.36, "end": 2844.76, "text": "Leute, die sind der Meinung, DMZ gleich, ich leite alle meine Ports weiter auf die PS4."}, {"id": 362, "start": 2844.76, "end": 2860.0, "text": "Ridi DMZ steht für Demilitarized Zone. Ich weiß gar nicht, wozu. Zumindest was damit gemeint"}, {"id": 363, "start": 2860.0, "end": 2873.2, "text": "es ist, du hast ein eigenes Netzwerk, wo von außen zugegriffen werden kann, wo von intern"}, {"id": 364, "start": 2873.2, "end": 2880.36, "text": "drauf zugegriffen werden kann. Allerdings, wo von selber, für die Kisten, die da drin"}, {"id": 365, "start": 2880.36, "end": 2895.92, "text": "stehen, nicht intern drauf zugegriffen werden kann. Demilitarized Zone. Genau. Gibt es in"}, {"id": 366, "start": 2895.92, "end": 2910.12, "text": "zwei Varianten, wie man das Ganze machen kann. Es gibt, wenn das hier der Router ist, und"}, {"id": 367, "start": 2910.12, "end": 2927.28, "text": "das hier ist der Router, das hier ist das Internet, das ist das Internet der Netzwerk, dann ist"}, {"id": 368, "start": 2927.28, "end": 2934.24, "text": "die eine Sache, die man ganz gerne macht für eine DMZ, ist, dass man die quasi als eigenes"}, {"id": 369, "start": 2934.24, "end": 2944.68, "text": "Netz hier daneben stellt, dass man hier daneben stellt. Das ist ganz unsicher Internet, das"}, {"id": 370, "start": 2944.68, "end": 2954.16, "text": "ist ganz sicher intern das Netzwerk und zugegriffen werden darf von da nach da, von da nach da,"}, {"id": 371, "start": 2954.16, "end": 2960.68, "text": "von da nach da, meistens zumindest, muss nicht unbedingt sein. Allerdings, es darf"}, {"id": 372, "start": 2960.68, "end": 2968.08, "text": "nicht hier zugegriffen werden. Das ist nicht erlaubt. Das benutzt man dafür, wenn man"}, {"id": 373, "start": 2968.08, "end": 2972.04, "text": "zum Beispiel eine Minecraft Server anbieten will, wenn man Minecraft Server bei sich daheim"}, {"id": 374, "start": 2972.04, "end": 2980.52, "text": "hinstellen will, oder eine Website hosten will, oder vielleicht einen VPN braucht, oder sowas,"}, {"id": 375, "start": 2980.52, "end": 2983.76, "text": "alles mögliche kann man das verwenden. VPN braucht man noch ein bisschen wer, Firewall,"}, {"id": 376, "start": 2983.76, "end": 2991.64, "text": "oder eine andere Beischaltung dann. Die zweite Variante sowas zu machen ist folgendes, also"}, {"id": 377, "start": 2991.64, "end": 3002.24, "text": "hier ist der Router in der Mitte, und die zweite Variante sowas zu machen ist, Eingangsrouter,"}, {"id": 378, "start": 3002.24, "end": 3019.6, "text": "wir nennen das mal Eingangs-Firewall, interne Firewall, hier ist Internet, hier ist intern,"}, {"id": 379, "start": 3019.6, "end": 3028.96, "text": "und da ist die DMZ. Das ist eigentlich fast schon die klassischere Variante, da brauchst"}, {"id": 380, "start": 3028.96, "end": 3033.12, "text": "du halt zwei Router, beziehungsweise, eigentlich brauchst du zwei Firewalls für Router, müssen"}, {"id": 381, "start": 3033.12, "end": 3039.48, "text": "sie unbedingt sein. Also eine Router allein bringt dir nichts, du brauchst auf jeden Fall"}, {"id": 382, "start": 3039.48, "end": 3044.72, "text": "Firewalls dazwischen. Also eine Router brauchst du, weil das sind unterschiedliche Netze,"}, {"id": 383, "start": 3044.72, "end": 3050.08, "text": "das ist auch eine Variante, das zu machen. Dann machst du Portweiterleitung, machst"}, {"id": 384, "start": 3050.08, "end": 3057.88, "text": "du Portweiterleitung von hier nach hier, die dürfen auch raus, wie gesagt meistens, und"}, {"id": 385, "start": 3057.88, "end": 3065.12, "text": "du machst Firewall-Freischaltung hier dazwischen. Und alles was von hier kommt, darf dann halt"}, {"id": 386, "start": 3065.12, "end": 3075.48, "text": "hier nicht weiter. Das ist die andere Variante sowas zu machen. Ja, und es denken heute Leute"}, {"id": 387, "start": 3075.48, "end": 3083.84, "text": "noch, dass DMZ bedeutet, man leitet alle Ports auf die Playstation weiter oder sowas. Das"}, {"id": 388, "start": 3083.84, "end": 3088.72, "text": "ist ein unglaublicher Fail, das hab ich vor acht Jahren auf YouTube schon erzählt, und"}, {"id": 389, "start": 3088.72, "end": 3095.4, "text": "die Leute glauben das immer noch. Paint ist beste. Weitere Softwaregeheimtipps, oh ja,"}, {"id": 390, "start": 3095.4, "end": 3101.76, "text": "kann ich machen. Beatbrod fragt, du, warte mal, ich zeig das mal hier in meinem, dafür"}, {"id": 391, "start": 3101.76, "end": 3109.68, "text": "haben wir das doch. Beatbrod fragt, du meintest ja man kann fragen was man will. Ich habe"}, {"id": 392, "start": 3109.68, "end": 3120.04, "text": "mit meinem Raspberry Pi ein Netzwerk zu WLAN-Brücke gebaut. Allein ist schon mal huge brain. Jetzt"}, {"id": 393, "start": 3120.04, "end": 3126.72, "text": "kann sich der Pi nicht mehr ins Internet verbinden, aber ich kann mich über LAN auf den Pi verbinden."}, {"id": 394, "start": 3126.72, "end": 3135.28, "text": "Außerdem kann beim booten DHCP, DHCP, achso, DHCP Klein, nicht gestartet werden. Hast"}, {"id": 395, "start": 3135.28, "end": 3142.16, "text": "keine Idee woran das liegen kann. Es kommt ein bisschen drauf an wie du das gebaut hast."}, {"id": 396, "start": 3142.16, "end": 3160.24, "text": "Also ich vermute mal, dass das folgendermaßen funktioniert, dass der Raspberry sich im Klein-Modus"}, {"id": 397, "start": 3160.24, "end": 3171.68, "text": "ins WLAN verbindet und du das dann gepridged hast. Also du lässt den Raspberry sich ins"}, {"id": 398, "start": 3171.68, "end": 3180.24, "text": "WLAN einwählen. Ne, Sebaro, ich glaube nicht, ich glaube er hat was anderes gebaut. Du hast"}, {"id": 399, "start": 3180.24, "end": 3185.88, "text": "den Raspberry sich per WLAN als Client am Access Point anmelden lassen und hast dann"}, {"id": 400, "start": 3185.88, "end": 3199.08, "text": "dein ETH0 mit WLAN gepridged, oder? Der Raspberry ist am LAN dran. Achso, also hast du doch ein"}, {"id": 401, "start": 3199.08, "end": 3213.16, "text": "Access Point gebaut. Achso. Das sind unterschiedliche Netze, hoffe ich mal, oder? Willst du das gleiche"}, {"id": 402, "start": 3213.16, "end": 3224.36, "text": "Netz da und da haben, oder willst du unterschiedliche Netze haben? Du willst unterschiedliche Netze"}, {"id": 403, "start": 3224.36, "end": 3231.88, "text": "haben, dann musst du auf jeden Fall schon mal einstellen, dass das IP Traffic weitergeleitet"}, {"id": 404, "start": 3231.88, "end": 3242.08, "text": "wird aus dem Kernel aktivieren, dass das funktioniert und ja, wenn du die gleichen Netze haben willst,"}, {"id": 405, "start": 3242.08, "end": 3251.0, "text": "musst du das pritschen. Wenn das das gleiche Netz sein soll, musst du das pritschen. Oder"}, {"id": 406, "start": 3251.0, "end": 3261.04, "text": "weiß ich gar nicht, doch der Raspberry kann das. Also das ist einfach, ich habe mich noch"}, {"id": 407, "start": 3261.04, "end": 3266.24, "text": "nie gebaut mit einem Raspberry, ich vermute mal das dürfte relativ einfach sein. Du sagst"}, {"id": 408, "start": 3266.24, "end": 3275.08, "text": "deinem WLAN, du willst das Ganze im Access Point Modus betreiben und dann müsstest du"}, {"id": 409, "start": 3275.08, "end": 3279.2, "text": "einfach dein Netzwerk mit dem WLAN pritschen und dann ist gut. Habe ich noch nie gebaut,"}, {"id": 410, "start": 3279.2, "end": 3288.48, "text": "aber was ich dir empfehlen kann ist, bau das Ganze nicht selbst, sondern verwende, es gibt"}, {"id": 411, "start": 3288.48, "end": 3307.2, "text": "nämlich ein Projekt, was dein Raspberry Pi zum Access Point macht. Verwende das hier."}, {"id": 412, "start": 3307.2, "end": 3312.24, "text": "Verwende einfach das hier, das macht das für dich. Das hier kenne ich nicht, was der da"}, {"id": 413, "start": 3312.24, "end": 3317.28, "text": "ausgespuckt hat. Verwende einfach das hier. Dann hast du nämlich gleich noch ein schönes"}, {"id": 414, "start": 3317.28, "end": 3323.8, "text": "Webinterface dazu und das macht dein Raspberry Pi zum Access Point. Man kann das selbst"}, {"id": 415, "start": 3323.8, "end": 3329.24, "text": "bauen, aber ich meine, man muss ja nicht unbedingt, es sei denn, man interessiert sich dafür,"}, {"id": 416, "start": 3329.24, "end": 3335.16, "text": "wie es technisch umgesetzt wird, das ist kein Ding, klar. Aber wenn man einfach nur will,"}, {"id": 417, "start": 3335.16, "end": 3339.0, "text": "dass es funktioniert, dann würde ich sowas nehmen. Und das richtig schöne daran ist,"}, {"id": 418, "start": 3339.0, "end": 3341.92, "text": "du kannst halt hier die komplette Config einstellen, du kannst das Ding als Repeater verwenden,"}, {"id": 419, "start": 3341.92, "end": 3346.72, "text": "als Access Point verwenden, als was auch immer, sogar als rein klein kannst du das"}, {"id": 420, "start": 3346.72, "end": 3350.6, "text": "Ganze verwenden, kannst updaten über das Webinterface, du hast sogar noch DHCP drauf"}, {"id": 421, "start": 3350.6, "end": 3359.56, "text": "laufen. Dann nimm das hier, das ist schön, das ist gut. Und hat auch richtig schönes"}, {"id": 422, "start": 3359.56, "end": 3369.6, "text": "Hexworth-Themen, wenn man das will. Das ist gut. Allerdings finde ich den Raspberry an"}, {"id": 423, "start": 3369.6, "end": 3376.24, "text": "sich jetzt nicht unbedingt der beste Access Point, liegt allerdings schon daran, dass das"}, {"id": 424, "start": 3376.24, "end": 3384.08, "text": "Ding nur eine On-Board-Antenne hat. Kann man den Pi eigentlich auch als Mesh-Device"}, {"id": 425, "start": 3384.08, "end": 3391.88, "text": "einbinden? Warum nicht? Ich habe noch keine Gedanken zugemacht."}, {"id": 426, "start": 3391.88, "end": 3408.2, "text": "Was ist denn der Unterschied zwischen einem Container und einer VM? Da muss ich mal gucken,"}, {"id": 427, "start": 3408.2, "end": 3411.04, "text": "da gibt es bestimmt schöne Bildchen zu. Ich suche mir mal ein schönes Bildchen raus und"}, {"id": 428, "start": 3411.04, "end": 3424.4, "text": "dann kann ich was zu erzählen. Das sind grundsätzlich zwei komplett unterschiedliche Dinge."}, {"id": 429, "start": 3424.4, "end": 3429.2, "text": "Das scheint mir ein ganz sinnvolles, das scheint mir ein ganz gutes Bild zu sein. Allerdings"}, {"id": 430, "start": 3429.2, "end": 3443.52, "text": "so wirklich schön zum erklären. Ist es nicht? Also ganz einfach gesagt, wir müssen uns drei"}, {"id": 431, "start": 3443.52, "end": 3453.16, "text": "Fälle angucken. Man lässt einen Prozess direkt auf dem Host laufen, man lässt einen Prozess"}, {"id": 432, "start": 3453.16, "end": 3463.44, "text": "im Container laufen oder man lässt einen Prozess in einer VM laufen. Es gibt zwischen den ersten"}, {"id": 433, "start": 3463.44, "end": 3468.88, "text": "beiden Fällen kaum einen Unterschied. Wenn du deinen Prozess in einem Container ausführst,"}, {"id": 434, "start": 3468.88, "end": 3475.72, "text": "ist das im Prinzip exakt das gleiche, wie du führst deinen Prozess auf dem Host aus."}, {"id": 435, "start": 3475.72, "end": 3487.64, "text": "Außer, dass es im Container ein paar Sandbox Maßnahmen gibt, die den Prozess vorgaukeln,"}, {"id": 436, "start": 3487.64, "end": 3492.52, "text": "dass er manche Sachen sieht und nicht sieht, die er sehen würde, würdest du ihn direkt"}, {"id": 437, "start": 3492.52, "end": 3499.12, "text": "auf dem Host ausführen. Der Container hat exakt den gleichen Container wie der Host,"}, {"id": 438, "start": 3499.12, "end": 3502.44, "text": "das heißt du kannst den Containern beispielsweise auch keine Container-Module nachladen oder"}, {"id": 439, "start": 3502.44, "end": 3508.6, "text": "sowas in der Richtung. Im Prinzip ist ein Container nichts weiteres wie ein bisschen"}, {"id": 440, "start": 3508.6, "end": 3516.56, "text": "kernel Sandbox, wie ein bisschen Software Sandbox um einen Prozess. Fertig. Es gibt"}, {"id": 441, "start": 3516.56, "end": 3521.2, "text": "keinen Unterschied so richtig zwischen einem containerisierten Prozess und zwischen einem"}, {"id": 442, "start": 3521.2, "end": 3531.36, "text": "Prozess, den du direkt auf dem Host ausführst. Ganz im Unterschied zu einer VM. Eine VM ist"}, {"id": 443, "start": 3531.36, "end": 3538.16, "text": "komplett virtualisierte, quasi emulierte Hardware. Das einzige was da halbwegs echt"}, {"id": 444, "start": 3538.16, "end": 3544.0, "text": "drin ist in einer VM ist die CPU und das auch nur aus Performance Gründen. Die Grafikkarte"}, {"id": 445, "start": 3544.0, "end": 3549.56, "text": "die die VM sieht, ist eine komplette Grafikkarte nachgebaut in Software. Die Soundkarte ist"}, {"id": 446, "start": 3549.56, "end": 3554.6, "text": "eine komplette Soundkarte nachgebaut in Software, die dann unten drunter von der Virtualisierungssoftware"}, {"id": 447, "start": 3554.6, "end": 3561.44, "text": "irgendwie auf das Hostgerät gemapt wird, aber das sieht die VM nicht. Du kannst auch"}, {"id": 448, "start": 3561.44, "end": 3571.88, "text": "in der VM eine komplett andere CPU vorgaukeln. Du kannst beispielsweise nicht so ohne weiteres"}, {"id": 449, "start": 3571.88, "end": 3579.56, "text": "auf Geräte zugreifen, die im Host drin sind von der VM. VM ist quasi ein komplett emulierter,"}, {"id": 450, "start": 3579.56, "end": 3585.72, "text": "virtualisierter Rechner und das Betriebssystem da drin sieht auch nur das. Das Betriebssystem"}, {"id": 451, "start": 3585.72, "end": 3590.72, "text": "in der VM ist eine komplett eigenständige Installation mit eigenständigem Kernel und"}, {"id": 452, "start": 3590.72, "end": 3596.48, "text": "allem und hat auch keine Ahnung auf welchem Host sie drauf läuft. Der Container schon."}, {"id": 453, "start": 3596.48, "end": 3601.16, "text": "Der Container ist kein eigenes Betriebssystem, keine eigenständige Installation. Es ist einfach"}, {"id": 454, "start": 3601.16, "end": 3614.52, "text": "nur ein bisschen gesandboxter, bisschen besser gesandboxter Prozess auf dem Host drauf."}, {"id": 455, "start": 3614.52, "end": 3618.76, "text": "Ist es bei Containern im Vergleich zur VM leichter auszubrechen? Ja auf jeden Fall."}, {"id": 456, "start": 3618.76, "end": 3636.84, "text": "Haben wir das verstanden, Void, Danny? Flow690, danke für den Sub. Ich glaube, du hast jetzt"}, {"id": 457, "start": 3636.84, "end": 3649.4, "text": "gesehen, die anderen habe ich alle. Es ist huge Pog. Ich habe jetzt schon, also wenn"}, {"id": 458, "start": 3649.4, "end": 3659.44, "text": "ich das hier so sehe, das ist so krass, man hat hier in Steamlabs so eine Historie mit"}, {"id": 459, "start": 3659.44, "end": 3667.68, "text": "den letzten Subs. Ich habe so viele Subs schon heute gekriegt, danke euch, dass das mehr"}, {"id": 460, "start": 3667.68, "end": 3674.84, "text": "ist als die erste Vorschau-Seite von Steamlabs überhaupt anzeigen kann. Also ich kann ja"}, {"id": 461, "start": 3674.84, "end": 3682.16, "text": "mal gucken, wieviel die Seite anzeigen kann. 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,"}, {"id": 462, "start": 3682.16, "end": 3691.48, "text": "14, 15, 16, 17, 18, 19, 20, 21 kann maximal die Steamlabs-Seite anzeigen hier und das"}, {"id": 463, "start": 3691.48, "end": 3706.56, "text": "heißt, es sind sogar noch mehr. Richtig krasser Shit. Void, Danny, wozu du den Container überhaupt"}, {"id": 464, "start": 3706.56, "end": 3715.16, "text": "brauchst? Das ist eigentlich relativ einfach erklärt, wenn du nicht die Vollvirtualisierung"}, {"id": 465, "start": 3715.16, "end": 3720.4, "text": "von der VM brauchst, also sprich, wenn du nicht darauf angewiesen bist, dass dein,"}, {"id": 466, "start": 3720.4, "end": 3728.32, "text": "oder ich muss, vergiss das, ich muss anders anfangen. Wenn dein Hausbetriebssystem ausreicht"}, {"id": 467, "start": 3728.32, "end": 3732.8, "text": "für das, was du ausführen möchtest, wenn der alles hat, was du ausführen willst und"}, {"id": 468, "start": 3732.8, "end": 3737.36, "text": "wenn du keine speziellen weiteren Sicherheitsanforderungen hast, die eine VM notwendig machen, würde"}, {"id": 469, "start": 3737.36, "end": 3743.32, "text": "ich einfach immer den Container nehmen. Zum Beispiel hast du einen Linux-Host und möchtest"}, {"id": 470, "start": 3743.32, "end": 3748.76, "text": "Windows-Software ausführen, dann geht das nicht den Containern, weil Windows ist ein"}, {"id": 471, "start": 3748.76, "end": 3754.52, "text": "eigenes Betriebssystem. Da musst du voll virtualisieren, VM und Windows drin installieren,"}, {"id": 472, "start": 3754.52, "end": 3761.08, "text": "in der VM. Windows denkt dann, es läuft auf einem eigenen Rechner und ist zufrieden. Wenn"}, {"id": 473, "start": 3761.08, "end": 3765.68, "text": "du beispielsweise einen FreeBSD ausführen willst, also auch wieder ein anderes Betriebssystem,"}, {"id": 474, "start": 3765.68, "end": 3771.48, "text": "dann musst du das in der VM machen. Du kannst keine FreeBSD-Sachen direkt unter Linus ausführen."}, {"id": 475, "start": 3771.48, "end": 3780.44, "text": "Ich weiß, dass es da theoretisch Sachen gibt, aber erstmal nicht. Sprich, wenn du Programme"}, {"id": 476, "start": 3780.44, "end": 3784.48, "text": "für andere Betriebssysteme ausführen willst, dann brauchst du eine komplett eigene VM."}, {"id": 477, "start": 3784.48, "end": 3791.24, "text": "Ist ja irgendwie logisch. Oder wenn du sagst, ich will meine Software besonders gut abschotten,"}, {"id": 478, "start": 3791.24, "end": 3800.04, "text": "isolieren, dann brauchst du auch eine VM. Wir hatten doch eben das Thema DMZ. Ich habe"}, {"id": 479, "start": 3800.04, "end": 3806.16, "text": "meinen Host irgendwo stehen mit Linux drauf und möchte jetzt einen Minecraft-Server anbieten."}, {"id": 480, "start": 3806.16, "end": 3813.64, "text": "Da mache ich auf meinem Router eine DMZ an, mache Firewall-Freischaltung. Den Minecraft-Server"}, {"id": 481, "start": 3813.64, "end": 3820.6, "text": "würde ich nie im Leben als Container laufen lassen. Warum nicht? Weil der Minecraft-Server"}, {"id": 482, "start": 3820.6, "end": 3826.88, "text": "dann quasi direkt auf dem Host laufen würde mit ein bisschen Sandbox drumherum. Und ich"}, {"id": 483, "start": 3826.88, "end": 3832.76, "text": "möchte ja ein eigenes Netz für meine DMZ haben, was sicherheitstechnisch abgeschottet"}, {"id": 484, "start": 3832.76, "end": 3838.64, "text": "ist vom Rest. Und nachdem der Host-Rechner nicht in der DMZ steht, sondern wahrscheinlich"}, {"id": 485, "start": 3838.64, "end": 3846.48, "text": "in dem Management-Netz oder vielleicht sogar bei mir intern, mache ich da eine VM und mache"}, {"id": 486, "start": 3846.48, "end": 3853.48, "text": "da den Minecraft-Server drin. Und dann bin ich relativ sicher, weil ja der Minecraft-Server"}, {"id": 487, "start": 3853.48, "end": 3858.8, "text": "in der eigenen VM läuft. Das heißt selbst, wenn irgendjemand, irgendeine krasse Hexer"}, {"id": 488, "start": 3858.8, "end": 3862.92, "text": "meinen Minecraft-Server hackt in der DMZ, weil er kann da von außen drauf zugreifen,"}, {"id": 489, "start": 3862.92, "end": 3872.72, "text": "ist das erstmal kein Problem für den Host unten drunter. Also ich würde eine VM immer"}, {"id": 490, "start": 3872.72, "end": 3880.0, "text": "dann nehmen, wenn es securitymäßig erforderlich ist oder wenn ich Sachen ausführen will,"}, {"id": 491, "start": 3880.0, "end": 3884.08, "text": "die ich nicht auf meinem Host ausführen kann. Eben zum Beispiel, weil es ein anderes Betriebssystem"}, {"id": 492, "start": 3884.08, "end": 3888.52, "text": "ist oder spezielle Kernel-Module braucht. Irgendwas, wo der Host halt nicht dafür geeignet"}, {"id": 493, "start": 3888.52, "end": 3896.12, "text": "ist. Kommt man eigentlich aus einer VM raus, also realistisch gesehen? Theoretisch schon"}, {"id": 494, "start": 3896.12, "end": 3904.6, "text": "praktisch nicht. Waren wir was anderes, Open Hub oder Home Assistant? Home Assistant, aus"}, {"id": 495, "start": 3904.6, "end": 3911.36, "text": "dem Grund, weil es finde ich das bessere Web-Interface hat, es in Python ist und nicht Java."}, {"id": 496, "start": 3911.36, "end": 3923.12, "text": "Was ist denn mehr für Multithreading geeignet, wenn man einen Single Thread Service laufen"}, {"id": 497, "start": 3923.12, "end": 3930.2, "text": "lassen will? Also meinst du, was ist mehr geeignet, Container oder VM? In der Regel,"}, {"id": 498, "start": 3930.2, "end": 3940.84, "text": "wenn es wirklich auf rohe Performance ankommt, um jeden Prozent Punkt, dann Container, allerdings"}, {"id": 499, "start": 3940.84, "end": 3946.52, "text": "sind die Unterschiede rein CPU-mäßig zwischen dem Container und der VM. Es ist jetzt nicht"}, {"id": 500, "start": 3946.52, "end": 3952.84, "text": "so, dass das doppelt so schnell wäre oder so. Das ist nicht so großartig. Der große"}, {"id": 501, "start": 3952.84, "end": 3959.08, "text": "Unterschied zwischen Container und VM, würde ich sagen, liegt hauptsächlich im RAM-Verbrauch"}, {"id": 502, "start": 3959.08, "end": 3963.44, "text": "und im Speicher-Verbrauch an sich. Container braucht keinen Speicher, braucht kaum extra"}, {"id": 503, "start": 3963.44, "end": 3969.56, "text": "RAM, so gut wie nichts. Oder vor allem schon. Meine VM muss ein komplettes Betriebssystem"}, {"id": 504, "start": 3969.56, "end": 3985.12, "text": "laufen lassen, allein schon. Deswegen braucht es mehr RAM. Ne, VM hatte ich nie. So, Pepega"}, {"id": 505, "start": 3985.12, "end": 4000.44, "text": "hat das Wort aufgemacht. Haben wir beantwortet. Spackt mein Tool. Ah ne, der Beatbrot hat"}, {"id": 506, "start": 4000.44, "end": 4007.52, "text": "das gerade eben wirklich gefragt. Kubernetes ist wieder ein bisschen anders, an einer anderen"}, {"id": 507, "start": 4007.52, "end": 4018.96, "text": "Stelle angesetzt. Kubernetes ist an sich keine Virtualisierungslösung und auch keine Container-Software"}, {"id": 508, "start": 4018.96, "end": 4032.6, "text": "an sich. Das ist ein Container-Management-Suite. Was sagen die eigentlich selbst zu sich?"}, {"id": 509, "start": 4032.6, "end": 4044.64, "text": "Ja, genau. Es ist ein Open-Source-System zur automatisierten Bereitstellung, Skalierung"}, {"id": 510, "start": 4044.64, "end": 4049.0, "text": "und Verwaltung von Container-Anwendungen. Was du damit machen kannst, ist zum Beispiel"}, {"id": 511, "start": 4049.0, "end": 4062.6, "text": "mal angenommen, du hostest irgendwas. Die selber sagen immer orchestrieren. Ich finde"}, {"id": 512, "start": 4062.6, "end": 4066.52, "text": "auch orchestrieren ist erstmal ein bisschen ein doofes Wort, aber das trifft es tatsächlich"}, {"id": 513, "start": 4066.52, "end": 4074.48, "text": "ganz gut, weil es geht darum, dass du, wenn man sich mal so ein Orchester vorstellt, es"}, {"id": 514, "start": 4074.48, "end": 4083.48, "text": "geht schon eher bei Kubernetes um das Dirigieren von Containern, als um das einfache, ich erstelle"}, {"id": 515, "start": 4083.48, "end": 4091.0, "text": "mir einen Docker-File und starte einen Container. Ja doch, das trifft es eigentlich ganz gut."}, {"id": 516, "start": 4091.0, "end": 4098.76, "text": "Kubernetes dirigiert das Ganze eher. Du hast dann schon verschiedene Files, die die Konfig"}, {"id": 517, "start": 4098.76, "end": 4102.4, "text": "von einem Container beschreiben. Allerdings, wofür Kubernetes zum Beispiel, ja, stell"}, {"id": 518, "start": 4102.4, "end": 4106.24, "text": "dir vor, du hostest irgendwas und Kubernetes ist auch nicht das Einzige. Aber stell dir"}, {"id": 519, "start": 4106.24, "end": 4115.4, "text": "vor, du hostest irgendwas. Du hast eine Web-Anwendung und du hast diese Web-Anwendung auf Kubernetes"}, {"id": 520, "start": 4115.4, "end": 4122.16, "text": "laufen. Was du damit zum Beispiel machen kannst, ist, du kannst wunderbar skalieren, je nach"}, {"id": 521, "start": 4122.16, "end": 4128.88, "text": "dem, wie viele Benutzer darauf zugreifen. Was natürlich besonders toll ist, wenn du"}, {"id": 522, "start": 4128.88, "end": 4135.68, "text": "deine Anwendung gar nicht mal bei dir laufen lässt, sondern vielleicht in Azure oder bei"}, {"id": 523, "start": 4135.68, "end": 4141.96, "text": "Google oder bei Amazon. Das ist natürlich besonders cool, weil du willst natürlich"}, {"id": 524, "start": 4141.96, "end": 4152.5, "text": "nicht bei Amazon 50 Notes kaufen für eine Anwendung nachts um drei, wo keiner drauf"}, {"id": 525, "start": 4152.5, "end": 4159.12, "text": "zugreift. Aber du möchtest vielleicht, wenn irgendeine News-Site über deine Anwendung"}, {"id": 526, "start": 4159.12, "end": 4163.52, "text": "berichtet hat, möchtest du vielleicht ja auch alle Nutzer, die dann auf einmal auf"}, {"id": 527, "start": 4163.52, "end": 4169.56, "text": "deine Seite aufmerksam werden, möchtest du dir die ja vielleicht alle auch abfackeln"}, {"id": 528, "start": 4169.56, "end": 4173.48, "text": "können. Und dann kannst du dynamisch skalieren lassen, indem du einfach noch 20 neue Container"}, {"id": 529, "start": 4173.48, "end": 4189.16, "text": "hochfährst. Alter, Flow690, was ist jetzt los? Huge! Der Flow690 verschenkt 1, 2, 3,"}, {"id": 530, "start": 4189.16, "end": 4204.64, "text": "4, 5, 6 Abos und zwar an PC Lustig, an Shadow 00, an Quay 1, an Capasco und an allen Calypto."}, {"id": 531, "start": 4204.64, "end": 4209.92, "text": "Flow690 wird das random ausgewählt oder wie funktioniert das, wenn man giftet? Muss man"}, {"id": 532, "start": 4209.92, "end": 4219.68, "text": "die Leute von Hand auswählen? Ich hab noch nie gegiftet. X-Shadow-Ghost, danke für"}, {"id": 533, "start": 4219.68, "end": 4224.8, "text": "den Sub. Ach du hast gerade gefragt, ab wann man suppen kann, ab vor seit einer Stunde"}, {"id": 534, "start": 4224.8, "end": 4254.0, "text": "oder so. Ach kann man beides machen, ok. Huge! Pock! Ultra nice. Fulltime Streamer, wenn."}, {"id": 535, "start": 4254.0, "end": 4274.4, "text": "Aber wenn mit 3000 Euro im Monat bezahlst. Dann Fulltime Streamer, easy. Leute, wir haben"}, {"id": 536, "start": 4274.4, "end": 4281.52, "text": "uns, wir haben uns letztens bald aus Spaß auf der Arbeit tatsächlich überlegt, ob wir"}, {"id": 537, "start": 4281.52, "end": 4290.64, "text": "uns nicht SysAdminTV Domain registrieren können oder Twitch-Account erstellen und da haben"}, {"id": 538, "start": 4290.64, "end": 4297.44, "text": "wir festgestellt, das geht nicht, weil du nichts erstellen darfst mit TV drinnen. Sonst hätten"}, {"id": 539, "start": 4297.44, "end": 4304.28, "text": "wir hier, nein, wir hätten nie von der Arbeit gestreamt, Blödsinn. Aber wir haben es aus"}, {"id": 540, "start": 4304.28, "end": 4310.96, "text": "Spaß überlegt, ob das nicht sogar möglich wäre. Rekfress, danke für den Sub. Ok,"}, {"id": 541, "start": 4310.96, "end": 4320.4, "text": "vielleicht, ich mach mal kurz, warum hab ich, warum haben meine Follower eigentlich den"}, {"id": 542, "start": 4320.4, "end": 4330.84, "text": "Papagei, den Papagei als, als Emote und Subs haben den Zombie. Noch mehr Subs, das ist"}, {"id": 543, "start": 4330.84, "end": 4338.76, "text": "ja huge heute. Hawks, danke für den Twitch-Prime-Sub. Huge Prime aller Leute heute hier. Ähm,"}, {"id": 544, "start": 4338.76, "end": 4346.28, "text": "BeatBot, das hab ich mir sogar schon mal aufgeschrieben, das hab ich vor einzubauen. Er schreibt, man"}, {"id": 545, "start": 4346.28, "end": 4350.44, "text": "könnte ja mal nen Bot bauen, der dem Chat erlaubt Memes vor Memetool zu triggern. Hab"}, {"id": 546, "start": 4350.44, "end": 4353.52, "text": "ich mir schon überlegt, gibt es übrigens schon fix und fertig, ne, müsste man eigentlich"}, {"id": 547, "start": 4353.52, "end": 4359.64, "text": "gar nicht einbauen in das Tool, aber das hab ich mir schon aufgeschrieben, als das eingebaut"}, {"id": 548, "start": 4359.64, "end": 4365.28, "text": "wird. Max, verkaufst du Badewasser? Ja, demnächst geh ich in den kompletten Sellout-Modus über,"}, {"id": 549, "start": 4365.28, "end": 4386.76, "text": "da wird alles verkauft. Badewasser, benutzte Socken, alles. Alles wird verkauft. Dreck von"}, {"id": 550, "start": 4386.76, "end": 4397.68, "text": "der Tastatur, Krümel aus der Tastatur, ähm, keine Ahnung. Abgekratztes Zeugs vom Handy,"}, {"id": 551, "start": 4397.68, "end": 4406.76, "text": "alles, man kann heute mit allem Geld verdienen. Haar, ich war gerade beim Friseur. Vor drei"}, {"id": 552, "start": 4406.76, "end": 4413.68, "text": "Stunden war ich beim Friseur, hätt ich mal mitnehmen sollen. Keks, Krümel, alles, Essensreste,"}, {"id": 553, "start": 4413.68, "end": 4423.72, "text": "das wird jetzt ausgeschlachtet bis zum Letzten. Wann kommt das Gentoo Walkthrough, wenn ich"}, {"id": 554, "start": 4423.72, "end": 4429.04, "text": "anfange Gentoo zu verwenden? Wohnt der Friseur nicht im Osten? Doch, ich war nicht beim Friseur,"}, {"id": 555, "start": 4429.04, "end": 4440.08, "text": "ich war nur beim Friseur. Kennste die Hornbach Werbung mit den Asiaten? Ne. Ähm, ich muss"}, {"id": 556, "start": 4440.08, "end": 4451.0, "text": "erst mal gucken, wie ich in Steamlabs einstellen kann, dass meine Subscriptions den Papagei"}, {"id": 557, "start": 4451.0, "end": 4479.64, "text": "bekommen. Moment, wir testen das jetzt mal. Kommt jetzt der Papagei? Haar, hat es nicht"}, {"id": 558, "start": 4479.64, "end": 4495.4, "text": "gespeichert, haar? Hat es das nicht gespeichert? Will das der Papagei kommt, wenn einer subscribt?"}, {"id": 559, "start": 4495.4, "end": 4511.8, "text": "Save. Haar, ich weiß warum nicht. Leute, ich muss euch kurz ausmachen. Der Link stimmt"}, {"id": 560, "start": 4511.8, "end": 4532.12, "text": "nicht. Der Link stimmt nicht. Jetzt stimmt der Link. Mal ausprobieren, ob es jetzt funktioniert."}, {"id": 561, "start": 4532.12, "end": 4545.52, "text": "Haar. Heute nur Laberstellts, heute nur Laberstellts, ich hab nix geplant. Morgen wird der Staubsauger"}, {"id": 562, "start": 4545.52, "end": 4567.68, "text": "geflasht. Wobei wir bräuchten auch ein besseres Subgif. Ah Leute, ich muss mir was überlegen."}, {"id": 563, "start": 4567.68, "end": 4595.32, "text": "Was könnte man als schönes? Was könnte man als schönes Subgif nehmen? Ich probier mal"}, {"id": 564, "start": 4595.32, "end": 4623.8, "text": "was aus. Follows, Subscription, Upload, Select, Save. Ok, um, ob es jetzt funktioniert? Test"}, {"id": 565, "start": 4623.8, "end": 4632.88, "text": "Subscription, Moment. Ah, so ist es doch schon besser, oder? Da gibt es bei Follows den normalen"}, {"id": 566, "start": 4632.88, "end": 4640.2, "text": "Parrot und bei Sub gibt es dann den Party Parrot. Hast du den Link gesehen? Nee, hast"}, {"id": 567, "start": 4640.2, "end": 4653.96, "text": "du den Link? Meinung zu Windows Sandbox. Ist das jetzt irgendwas neues, was ich noch nicht"}, {"id": 568, "start": 4653.96, "end": 4660.04, "text": "kenne? Oder ist das die übliche Geschichte mit MP Engine, Virenscanner, oder ist das"}, {"id": 569, "start": 4660.04, "end": 4664.04, "text": "was Neues, Tynesaw? Wenn das was ganz Neues ist, dann sagt es mir nichts. Dann hab ich"}, {"id": 570, "start": 4664.04, "end": 4670.72, "text": "es mir so nicht angeguckt. Die Subcatch Idee, du machst ein virtuelles Tamagotchi in die"}, {"id": 571, "start": 4670.72, "end": 4676.92, "text": "Ecke und es wird nur gefüttert, wenn gesubbt wird. Subt, keiner droht es zu sterben. Oh,"}, {"id": 572, "start": 4676.92, "end": 4684.08, "text": "huge. Das ist hier Leute, man. Das muss ich mir aufhören. Das programmieren wir im Stream"}, {"id": 573, "start": 4684.08, "end": 4689.64, "text": "dann. Das programmieren wir im Stream. Der Keks muss gefüttert werden, sonst geht der"}, {"id": 574, "start": 4689.64, "end": 4696.64, "text": "immer mehr kaputt."}, {"id": 575, "start": 4749.64, "end": 4773.0, "text": "Alter, ist der Hornbachclip abartig. Was heißt denn bitte schön Flashen, neue Software"}, {"id": 576, "start": 4773.0, "end": 4780.36, "text": "auf dem Gerät drauf kopieren. Neue Software auf dem Gerät drauf kopieren. Hast du den"}, {"id": 577, "start": 4780.36, "end": 4785.24, "text": "Link gesehen? Ja, hab ich. Was für einen Switch oder allgemeinen Hardware würdest du"}, {"id": 578, "start": 4785.24, "end": 4804.48, "text": "empfehlen? Genau, was für einen Switch oder allgemeinen Hardware? Ich muss jetzt mal kurz"}, {"id": 579, "start": 4804.48, "end": 4818.6, "text": "schauen. Ich hab immer noch OBS im Bild. Ups, fail. Okay, jetzt hab ich den Chat wieder"}, {"id": 580, "start": 4818.6, "end": 4825.68, "text": "runtergescrollt. Das ist gerade zu viel. Genau, ich wollte das hier vom Horx. Also, was für"}, {"id": 581, "start": 4825.68, "end": 4830.28, "text": "einen Switch oder allgemeinen Hardware würdest du empfehlen, wenn man sich LAN in sein Zimmer"}, {"id": 582, "start": 4830.28, "end": 4838.2, "text": "legen möchte? Und damit man auch mal ein wenig rumspielen kann. Router besitze ich bzw."}, {"id": 583, "start": 4838.2, "end": 4845.8, "text": "meine Eltern eine Fritzbox. Was meint ihr mit rumspielen? So ein bisschen Netzwerkkrams"}, {"id": 584, "start": 4845.8, "end": 4859.8, "text": "ausprobieren und lernen. Also für Netzwerkkrams zum Lernen, wenn man sich dafür interessiert,"}, {"id": 585, "start": 4859.8, "end": 4864.68, "text": "kann ich eigentlich auch nur das wiederholen, weil ich sonst immer wiederhole, holt euch"}, {"id": 586, "start": 4864.68, "end": 4870.16, "text": "Mikrotik Sachen. Mikrotik Sachen sind günstig, verbrauchen wenig Strom, haben ordentliche"}, {"id": 587, "start": 4870.16, "end": 4883.04, "text": "Performance für das Geld und sind an sich ziemlich gute Hardware. Holt ihr was kleines"}, {"id": 588, "start": 4883.04, "end": 4889.92, "text": "von Mikrotik? Ich meine, du brauchst eigentlich ja nicht wirklich einen Switch. Wenn du nur"}, {"id": 589, "start": 4889.92, "end": 4892.84, "text": "den Rechter anschließen willst, kannst du auch direkt eine Fritzbox machen. Wenn du"}, {"id": 590, "start": 4892.84, "end": 4897.64, "text": "noch mehrere Geräte hast, dann lohnt sich das natürlich. Dann würde ich was von Mikrotik"}, {"id": 591, "start": 4897.64, "end": 4903.76, "text": "nehmen. Da würde ich hier irgendwie zum Beispiel den da. Das ist jetzt kein reiner Switch,"}, {"id": 592, "start": 4903.76, "end": 4914.48, "text": "das ist eigentlich ein Router mit einem 5-Port-Switch. Ist aber sowohl von der Hardware, die drinnen"}, {"id": 593, "start": 4914.48, "end": 4920.32, "text": "ist gut, das Betriebssystem, was drauf ist, ist super umfangreich. Also wenn man netzwerkmäßig"}, {"id": 594, "start": 4920.32, "end": 4929.44, "text": "was lernen will, sind die Dinge sehr gut. Und kostet auch nicht so viel. Die Lite-Variante"}, {"id": 595, "start": 4929.44, "end": 4934.24, "text": "kostet 50 Euro, der eine kostet 70 Euro. Das ist natürlich viel mehr als du brauchst"}, {"id": 596, "start": 4934.24, "end": 4943.16, "text": "letztendlich. Geht eigentlich mit der Musik gerade ab. Es sind im Endeffekt mehr Sachen"}, {"id": 597, "start": 4943.16, "end": 4950.08, "text": "als du brauchst, hat der Gigabit, klar. Es sind letztendlich mehr Leistungen als du brauchst,"}, {"id": 598, "start": 4950.08, "end": 4955.76, "text": "ja. Aber du kannst auch mal ein bisschen rumspielen mit unterschiedlichen Netzen, mit WLANs und"}, {"id": 599, "start": 4955.76, "end": 4959.88, "text": "so. Das ist halt mit einem, also unterschiedliche Netzen und Routen ist halt mit einem reinen"}, {"id": 600, "start": 4959.88, "end": 4967.12, "text": "Switch. Also mit einem reinen Switch geht es gar nicht. Hast du einen ein bisschen moderneren"}, {"id": 601, "start": 4967.12, "end": 4974.0, "text": "Switch, geht es aber. Die mögen alles andere als Switchen meistens nicht, performanstechnisch."}, {"id": 602, "start": 4974.0, "end": 4978.88, "text": "Und hier kannst du also zum Ausprobieren finde ich generell auch zum Netzwerkzeug lernen,"}, {"id": 603, "start": 4978.88, "end": 4984.0, "text": "ist das das beste Gerät was es gibt, wenn es erschwinglich sein soll und man es auch"}, {"id": 604, "start": 4984.0, "end": 4989.66, "text": "sinnvoll einsetzen will. Man kann sich auch alte Cisco-Dinger kaufen, wenn es einem wirklich"}, {"id": 605, "start": 4989.66, "end": 4995.56, "text": "um die Hardcore-Netzwerkgeschichte rein zum Lernen geht. Das Problem ist allerdings,"}, {"id": 606, "start": 4995.56, "end": 5002.84, "text": "dass die Cisco-Dinger, die alten, nur zum Lernen taugen. Die will man sich nicht daheim"}, {"id": 607, "start": 5002.84, "end": 5007.52, "text": "hinstellen. Die sind laut, die verbrauchen viel Strom und oftmals sind die auch von der"}, {"id": 608, "start": 5007.52, "end": 5014.12, "text": "Performance her so letztes Jahr tausend, dass die oftmals nur 10.000 haben. Oder aber wenn"}, {"id": 609, "start": 5014.12, "end": 5018.72, "text": "sie schon moderner sind, dann sind sie ziemlich teuer auch gebraucht. Das heißt, ich finde"}, {"id": 610, "start": 5018.72, "end": 5022.4, "text": "man kann mit dieser MikroTik-Geschichte kann man wirklich nichts verkehrt machen. Das ist"}, {"id": 611, "start": 5022.4, "end": 5031.08, "text": "der beste Übungsrouter, von dem man auch was hat. Und fünf Ports reichen einem normalerweise"}, {"id": 612, "start": 5031.08, "end": 5039.04, "text": "ja auch. Und die Ports sind nicht einfach nur per CPU geswitcht, da ist auch ein Hardware-Switch"}, {"id": 613, "start": 5039.04, "end": 5048.36, "text": "drin, also man hat auch ordentliche Switching-Performance. Huge Sub! Jetzt muss ich erstmal warten bis"}, {"id": 614, "start": 5048.36, "end": 5064.88, "text": "da steht wer es ist. Wer ist es? Melodize! Nice! Danke für den Sub! Twitch Prime! So"}, {"id": 615, "start": 5064.88, "end": 5072.08, "text": "jetzt muss ich erstmal in mein Tool gucken, was ich da wieder alles übersehen habe. Danke"}, {"id": 616, "start": 5072.08, "end": 5078.52, "text": "für's Zuschauen, es war sehr schön. Also wirst du auf jeden Fall viel Spaß dran haben. Du hast"}, {"id": 617, "start": 5078.52, "end": 5081.92, "text": "den, den ich empfohlen habe, bestellt. Dir habe ich nicht den Hex PoE empfohlen, dir habe"}, {"id": 618, "start": 5081.92, "end": 5110.64, "text": "ich den 24-Port, den CRS 8-2, CRS 3-2-8, 3-2-6 empfohlen, ne? Was war bisher das beste Video"}, {"id": 619, "start": 5110.64, "end": 5118.64, "text": "aus deinem Discord? Boah, weiß ich nicht gerade. Kam mit Windows 10 Build 1903 oder so, ist"}, {"id": 620, "start": 5118.64, "end": 5122.68, "text": "eine VM die mit Windows mitgeliefert wird, ist bei der deutschen Sprache derzeit ein"}, {"id": 621, "start": 5122.68, "end": 5128.36, "text": "bisschen RIP, keine Ahnung wie wir es mit... Was gibts das? Sandbox? Wie heißt das? Was"}, {"id": 622, "start": 5128.36, "end": 5137.92, "text": "muss ich ausführen? Windows, Sandbox, hab ich noch nie gehört. Windows Sandbox aktivieren."}, {"id": 623, "start": 5137.92, "end": 5155.88, "text": "Deskmodder.de klingt schon mal super vertrauenswürdig, die Seite. Ok, wie verwendet man das? Systemsteuerung,"}, {"id": 624, "start": 5155.88, "end": 5168.48, "text": "Suche, Einstellungen, Apps, was? Ach man muss das über Features hinzufügen machen. Ok,"}, {"id": 625, "start": 5168.48, "end": 5182.68, "text": "machen wir mal. Sandbox, ne, äh, Feature, add, turn on Windows Feature, oh ne jetzt ist"}, {"id": 626, "start": 5182.68, "end": 5197.52, "text": "OBS wieder kaputt, ne? Moment Leute, OBS geht wieder. Geht OBS wieder? Ja, geht wieder."}, {"id": 627, "start": 5197.52, "end": 5215.36, "text": "Sandbox, ach was muss man suchen? Programme und Features. Windows Sandbox heißt das auch"}, {"id": 628, "start": 5215.36, "end": 5222.0, "text": "noch. Windows Sandbox, enable dependency required to run Windows Sandbox Scenarios."}, {"id": 629, "start": 5222.0, "end": 5228.48, "text": "Ähm, wisst ihr ob man neu starten muss nach der Installation? Wenn man neu starten muss"}, {"id": 630, "start": 5228.48, "end": 5231.88, "text": "mache ich es lieber in der VM, wobei eine VM in der VM, das wird wahrscheinlich in der"}, {"id": 631, "start": 5231.88, "end": 5235.76, "text": "Windows nicht richtig funktionieren. Ja muss man das scheiße, da kann ich das nicht ausprobieren."}, {"id": 632, "start": 5235.76, "end": 5246.36, "text": "Ne, wir können zwar mit nested Virtualisierung ausprobieren in VM, da bin ich mal gespannt"}, {"id": 633, "start": 5246.36, "end": 5252.08, "text": "ob das funktioniert. Leute, das probieren wir jetzt mal aus. Wir virtualisieren Windows"}, {"id": 634, "start": 5252.08, "end": 5269.64, "text": "in Windows in Windows. Was sind die richtige VM? Das da, das da, das da. Ich glaube das"}, {"id": 635, "start": 5269.64, "end": 5278.8, "text": "hier. Wie viele VMs in einer VM hast du schon mal aufgesetzt? Ich hab mal ESX in VM in"}, {"id": 636, "start": 5278.8, "end": 5287.48, "text": "Workstation installiert und dann in ESX. Wait, warte mal. Warte mal, ne ne ne, wie war das?"}, {"id": 637, "start": 5287.48, "end": 5298.64, "text": "Genau, und dann in ESX in Linux, das hat funktioniert. Ähm, was ich auch mal gemacht hab, ich hab"}, {"id": 638, "start": 5298.64, "end": 5306.24, "text": "einen Windows Server installiert unter VMware Workstation und darin dann, ähm, und darin"}, {"id": 639, "start": 5306.24, "end": 5312.36, "text": "dann Hyper-V und darin dann noch ein Windows, weil ich testen wollte wie das mit Remote"}, {"id": 640, "start": 5312.36, "end": 5315.8, "text": "Desktop 3D Beschleunigung mittlerweile ist. Hat natürlich nicht richtig funktioniert."}, {"id": 641, "start": 5315.8, "end": 5320.48, "text": "Ist das nicht ein bisschen viel RAM? Naja, wenn man nichts macht braucht der Kram auch"}, {"id": 642, "start": 5320.48, "end": 5326.32, "text": "nicht so viel RAM. Okay, dann probieren wir das jetzt mal aus. Da ist noch der Kram vom"}, {"id": 643, "start": 5326.32, "end": 5334.92, "text": "letzten Mal offen. Close, close, close, close, on KS. Okay, wir machen, wir machen die Firewall"}, {"id": 644, "start": 5334.92, "end": 5340.92, "text": "mal wieder on. Probieren wir mal aus. Wir probieren das jetzt mal aus. Feature, Feature,"}, {"id": 645, "start": 5340.92, "end": 5353.6, "text": "add, sehen wir das, add Feature und dann Windows Sandbox. Was? No Virtualization Capabilities."}, {"id": 646, "start": 5353.6, "end": 5359.88, "text": "Dann müssen wir Windows mal ausschalten. Jetzt mal den Big Brain Play überhaupt. Wir"}, {"id": 647, "start": 5359.88, "end": 5367.84, "text": "schalten Windows aus und schalten Nested Virtualisierung ein. Wenn ich mich dran erinnern"}, {"id": 648, "start": 5367.84, "end": 5377.44, "text": "könnte wo das geht, da. Äh, den Rest virtualisieren wir mal nicht. Und jetzt können wir auch"}, {"id": 649, "start": 5377.44, "end": 5401.56, "text": "in der VM VMs anlegen. Big Brain. Inception, ja. Stripes, es ist überhaupt kein Ding."}, {"id": 650, "start": 5401.56, "end": 5412.8, "text": "Kann jeder hier auch zugucken, sich einbringen und ohne, ohne zusammen. Ja, das ist überhaupt"}, {"id": 651, "start": 5412.8, "end": 5426.68, "text": "kein Ding. Subskribieren. Okay, mal gucken ob es jetzt funktioniert. Add Feature. Findet"}, {"id": 652, "start": 5426.68, "end": 5430.16, "text": "ihr das eigentlich auch so lächerlich? Für alle denen das schon aufgefallen ist, dass"}, {"id": 653, "start": 5430.16, "end": 5435.28, "text": "man unter Windows standardmäßig kein Telnet hat, sondern dass man um Telnet zu installieren"}, {"id": 654, "start": 5435.28, "end": 5449.52, "text": "sagen muss Turn Windows Features on und off Telnet Client. Was macht Intel VTD eigentlich?"}, {"id": 655, "start": 5449.52, "end": 5454.24, "text": "Das ist ja eben die Hardware Virtualisierung. Guck hier, Bam, Sandbox kann installiert werden."}, {"id": 656, "start": 5454.24, "end": 5468.56, "text": "Der Sebaro. Der Sebaro. Stripes 007. Der Sebaro ist schon echt ein netter Typ, ne?"}, {"id": 657, "start": 5468.56, "end": 5491.04, "text": "Restart. Jawoll. Übrigens, jetzt wo wir gerade bei Telnet sind, habe ich euch eigentlich"}, {"id": 658, "start": 5491.04, "end": 5495.24, "text": "das hier schon gezeigt. Machen wir mal Vorlesung aus. Habe ich euch das hier schon gezeigt."}, {"id": 659, "start": 5495.24, "end": 5509.08, "text": "Telnet. Parrot. Live. Gibt es gar nicht mehr. Gibt es es nicht mehr. Das gibt es nicht"}, {"id": 660, "start": 5509.08, "end": 5537.24, "text": "mehr. Das gibt es nicht mehr. Try it. Mit Curl. Ach, mit Curl ging es nicht mit Telnet"}, {"id": 661, "start": 5537.24, "end": 5556.24, "text": "auch. Hey, da ist es. Man musste es Curl und nicht Telneten. Da ist er. Ich dachte man"}, {"id": 662, "start": 5556.24, "end": 5560.28, "text": "musste es Telneten, aber man musste es Curl und das reicht. Man musste es Curl und das"}, {"id": 663, "start": 5560.28, "end": 5567.64, "text": "ist auch so ein total beknackter Satz. Okay, ähm, was macht unsere Windows in Windows"}, {"id": 664, "start": 5567.64, "end": 5586.12, "text": "Installationen? Ah, ist neu gestartet. Nur als Vorwarnung, wenn dein Windows jemals"}, {"id": 665, "start": 5586.12, "end": 5589.52, "text": "als Sprache was anderes als Englisch hatte, wird das nicht funktionieren. Nein, hat es"}, {"id": 666, "start": 5589.52, "end": 5614.44, "text": "zum Glück nicht. Towerblinken, Lights, NL. Keine Ahnung, ob es das noch gibt. Okay und"}, {"id": 667, "start": 5614.44, "end": 5636.04, "text": "wie geht es jetzt weiter? Sandbox. Windows Sandbox, da ist es. Yes. Und jetzt? Nee,"}, {"id": 668, "start": 5636.04, "end": 5645.36, "text": "ich habe gerade die Seite aufgemacht, die ist 40404. 404 oder ist es DNS? Not found."}, {"id": 669, "start": 5645.36, "end": 5665.4, "text": "Nee, da ist 40404. Da probiere ich das mal aus kurz. Was macht das jetzt noch was? Macht"}, {"id": 670, "start": 5665.4, "end": 5689.92, "text": "das jetzt noch was?"}, {"id": 671, "start": 5689.92, "end": 5711.84, "text": "Und du? Ach doch, gibt es noch. Ach, das ist das ASCII Star Wars. Ähm, wer hat es"}, {"id": 672, "start": 5711.84, "end": 5724.92, "text": "geschrieben? Das ist das ASCII Star Wars. Genau, ja, das kenne ich noch. Kann es sein,"}, {"id": 673, "start": 5724.92, "end": 5728.72, "text": "dass die Nested vor allem nicht mehr Hardware beschleunigt, virtualisiert? Ja, höchstwahrscheinlich"}, {"id": 674, "start": 5728.72, "end": 5735.56, "text": "nicht. Also mit ordentlicher Oberflächen beschleunigt. Guckt mal Leute, Windows in Windows, ich"}, {"id": 675, "start": 5735.56, "end": 5747.28, "text": "meine es ist lahm as fuck. Ihr seht es ja hier. Aber ich meine, das ist mal Meta, oder? Windows"}, {"id": 676, "start": 5747.28, "end": 5761.68, "text": "in Windows in Windows. Niko Rock, Twitch Prime, Dankeschön. Gibt sogar den Party Parrot"}, {"id": 677, "start": 5761.68, "end": 5770.32, "text": "hier. Na das, ich glaube, das ist weltweite Twitch Premiere. Windows in Windows in Windows."}, {"id": 678, "start": 5770.32, "end": 5777.92, "text": "Live auf Twitch. Das gab es noch nie. Was kann man da drin jetzt machen? Einfach irgendwas"}, {"id": 679, "start": 5777.92, "end": 5783.12, "text": "ausprobieren und dann wieder wegwerfen oder wie? Jetzt wird es ganz hart. Jetzt wird es"}, {"id": 680, "start": 5783.12, "end": 5792.2, "text": "ganz hart. Edge aufmachen. Und dann mache ich meinen Stream auf da drinnen. Das ist"}, {"id": 681, "start": 5792.2, "end": 5806.4, "text": "Next Level Shit. Windows in Windows in Windows. Und dann den Stream selbst angucken. Oder"}, {"id": 682, "start": 5806.4, "end": 5813.48, "text": "das Oh Homeworld, das ist eine gute Idee. Oder darin, Leute, Next Level Shit. Darin"}, {"id": 683, "start": 5813.48, "end": 5819.64, "text": "installieren wir jetzt WSL. In WSL installieren wir Wine. Und mit Wine machen wir Notepad"}, {"id": 684, "start": 5819.64, "end": 5823.64, "text": "auf. Das probieren wir mal aus, oder? Was sagt ihr dazu? Das müssen wir ausprobieren."}, {"id": 685, "start": 5823.64, "end": 5833.28, "text": "Twitch Mason abonniert Stufe 1. Dankeschön. Geht Wine in WSL? Ich habe ehrlich gesagt"}, {"id": 686, "start": 5833.28, "end": 5842.72, "text": "keine Ahnung. Boah, ist das lahm. Lahm as fuck, Alter. Wine in WSL. Ich weiß keine Ahnung,"}, {"id": 687, "start": 5842.72, "end": 5851.2, "text": "ob das funktioniert. Running Wine in WSL. Geht nicht. Time to unsequit on top. Können"}, {"id": 688, "start": 5851.2, "end": 5868.4, "text": "wir auch machen. Welcome to Edge. Geh weg. Cortana. Oder was auch immer. Geh weg. Rasp"}, {"id": 689, "start": 5868.4, "end": 5874.2, "text": "AP hat super funktioniert. Danke für den Tipp. Bitteschön. Nice. Funktioniert. Boah,"}, {"id": 690, "start": 5874.2, "end": 5885.84, "text": "ist das langsam. Boah, ist das langsam. Boah, das kann man nicht benutzen. Okay. Okay, Leute."}, {"id": 691, "start": 5885.84, "end": 5894.56, "text": "Twitch. Wo blort es? As zu wenig RAM, wahrscheinlich. Stimmt vielleicht. Das kann tatsächlich"}, {"id": 692, "start": 5894.56, "end": 5903.44, "text": "sein, dass ich der VM zu wenig RAM gegeben habe. Wie viel RAM hat die VM? Wie viel RAM?"}, {"id": 693, "start": 5903.44, "end": 5916.96, "text": "Die können auch ein bisschen mehr RAM verkraften. Die können auch ein bisschen mehr RAM verkraften,"}, {"id": 694, "start": 5916.96, "end": 5926.96, "text": "die VM. Hier. Ich habe doch gerade oben reingelegt. Woop. Lords. Kann es sein, dass es da nicht"}, {"id": 695, "start": 5926.96, "end": 5937.08, "text": "drinnen tippt? Ich glaube, ich glaube, jetzt ist es vorbei. Ich glaube, jetzt ist es vorbei."}, {"id": 696, "start": 5937.08, "end": 5950.44, "text": "Jetzt ist Schluss. Toll. Das mag nicht mehr. Das mag nicht mehr. Das ist es vorbei. Okay,"}, {"id": 697, "start": 5950.44, "end": 5962.36, "text": "wir probieren nochmal was. Wir probieren nochmal was. Power off. Suspend. Wir geben dem Ding"}, {"id": 698, "start": 5962.36, "end": 5965.28, "text": "jetzt nochmal mehr RAM. Ich will gucken, ob das funktioniert. Wir geben dem Ding jetzt"}, {"id": 699, "start": 5965.28, "end": 5978.88, "text": "nochmal mehr RAM. Wir geben dem jetzt 8. Wir geben dem Ding jetzt 8G RAM. 2 CPUs. Das sollte"}, {"id": 700, "start": 5978.88, "end": 5986.32, "text": "eigentlich reichen, oder? 2 CPUs. 3. 3 CPUs. Kommt, Leute. Der Rest muss zum Streamen reichen."}, {"id": 701, "start": 5986.32, "end": 6000.04, "text": "Der restliche Kern muss für OBS reichen. Nicht 4. Ruggels. Die Grafikkarte. Sound. Sound."}, {"id": 702, "start": 6000.04, "end": 6012.12, "text": "Mach mal raus. Printer. Mach mal raus. Alles, was ich brauche, mach mal raus. Display. 1G."}, {"id": 703, "start": 6012.12, "end": 6024.0, "text": "Fuck. Okay. Gut. Start. Ach, Moment. Ich habe ja 6 Kerne. Omega 0. Warum weiß Twitch Chat"}, {"id": 704, "start": 6024.0, "end": 6035.12, "text": "besser, wie viele CPU-Kerne ich habe, als ich selbst? Wie kann das sein? Warum weiß das"}, {"id": 705, "start": 6035.12, "end": 6047.04, "text": "Twitch Chat besser? Ich habe 6 Kerne. Stimmt. Passiert ja nicht. Stimmt. Twitch Chat hat"}, {"id": 706, "start": 6047.04, "end": 6053.12, "text": "mein PC-Kaufvideo gesehen. Es ist aber nicht nur, ihr habt nicht nur mein Kaufvideo gesehen."}, {"id": 707, "start": 6053.12, "end": 6057.72, "text": "Twitch Chat ist ja auch hier, ist ja auch automatisch bei mir immer Q-Chat. Und Q-Chat kennt sich"}, {"id": 708, "start": 6057.72, "end": 6073.76, "text": "aus. Q-A-F-Chat. Okay, es ist schon mal eine ganze Ecke schneller hier in der VM jetzt."}, {"id": 709, "start": 6073.76, "end": 6088.76, "text": "Okay, Sandbox. Yes. Okay, gucken wir mal in der VM zu, was da passiert. Performance."}, {"id": 710, "start": 6088.76, "end": 6103.76, "text": "Er ist bei weitem nicht so ausgelastet wie vorher. Gleich Smokersmoke angesagt. Ich sage es euch."}, {"id": 711, "start": 6103.76, "end": 6112.36, "text": "Vielleicht kackts ab. Was Sandbox, der da eigentlich so lange rum? Er stellt da jedes"}, {"id": 712, "start": 6112.36, "end": 6120.36, "text": "Mal ein neues Windows-Image, wenn ich die Sandbox starte. Rauchmelder am Start, ja."}, {"id": 713, "start": 6120.36, "end": 6131.88, "text": "In jedem Raum 10 Jahre C-Wave Rauchmelder. Inklusive über C-Wave testbare Batteriestand."}, {"id": 714, "start": 6131.88, "end": 6140.6, "text": "Hast du die 7 nicht auf 5 GHz laufen? Die erkennen bloß 3,7. Ja, anscheinend läuft"}, {"id": 715, "start": 6140.6, "end": 6149.4, "text": "er auch nur auf 3,7 Grad. Gucken wir mal auf dem Host. Host Performance. 4,9. Die VM erkennt"}, {"id": 716, "start": 6149.4, "end": 6177.88, "text": "es. Vmg Bailet. VM will es nicht starten. Tja Max, Electronics. Hast du das Fenster aufgehabt?"}, {"id": 717, "start": 6177.88, "end": 6188.36, "text": "Was ist hier los? Wir haben gerade Windows in Windows in Windows virtualisiert. Ram wird"}, {"id": 718, "start": 6188.36, "end": 6208.24, "text": "wieder teurer. Da muss ich jetzt nochmal einkaufen. Ich brauche noch. Also, so. Nochmal so 16G kann"}, {"id": 719, "start": 6208.24, "end": 6215.76, "text": "ich gebrauchen. Hat es eben auch so lange gedauert bis es gestartet ist? War das eben"}, {"id": 720, "start": 6215.76, "end": 6238.64, "text": "auch so langsam? Ich meine, der macht ja gar nichts. 3x Kerne, 3x langsam. Das klingt"}, {"id": 721, "start": 6238.64, "end": 6255.56, "text": "logisch, ja. Da tut sich ja gar nichts. Wisst ihr was? Mal gucken wie die Ram-Auslastung"}, {"id": 722, "start": 6255.56, "end": 6269.4, "text": "auf dem Host ist. Naja, da geht noch was. 4,9 von 16G, was willst du denn? Ach nee,"}, {"id": 723, "start": 6269.4, "end": 6279.36, "text": "sogar nur 14,3 von 16G. Was brauchst du denn so viel RAM? Siehst du, für VM, inner VM"}, {"id": 724, "start": 6279.36, "end": 6286.04, "text": "und noch VMs nebenbei laufen lassen. Mehr RAM, außerdem ist mehr RAM nie verkehrt."}, {"id": 725, "start": 6286.04, "end": 6291.48, "text": "Also, ich hätte schon gerne 32G drinne. Ich habe damals halt kein 32G gekauft, weil das"}, {"id": 726, "start": 6291.48, "end": 6296.24, "text": "auch teuer war. Das hat 280 Euro gekostet, als ich den Rechner geholt habe. Aber ich"}, {"id": 727, "start": 6296.24, "end": 6303.12, "text": "habe auch so brain dead wieder irgendwelche komischen RGB-Rams geholt. So lange hat es"}, {"id": 728, "start": 6303.12, "end": 6309.88, "text": "das erste Mal nicht gedauert, Leute. So lange hat es nicht gedauert. Guck mal, wie man 33%"}, {"id": 729, "start": 6309.88, "end": 6318.08, "text": "CPU-Last erzeugen kann, wenn man einfach nur den Desktop markiert. Windows, lul. 33% CPU-Last"}, {"id": 730, "start": 6318.08, "end": 6335.88, "text": "durch Desktop markieren. Schafft es erst mal unter irgendeinem anderen Betriebssystem."}, {"id": 731, "start": 6335.88, "end": 6341.52, "text": "Guckt euch hier. Wenn ich das in einem Auslastungs-Graf in einem Linux-Server sehen würde, würde"}, {"id": 732, "start": 6341.52, "end": 6345.64, "text": "ich sagen, den Java-Prozess hat sich aufgehängt oder so. Aber nein, unter Windows ist das einfach"}, {"id": 733, "start": 6345.64, "end": 6358.0, "text": "die Maus auf dem Desktop bewegt. Ich glaube, das startet nicht. Ich gucke mal gerade, wie"}, {"id": 734, "start": 6358.0, "end": 6361.56, "text": "viel der RAM kosten würde, wenn ich mir jetzt noch, wir haben zwar letztens geguckt, aber"}, {"id": 735, "start": 6361.56, "end": 6366.2, "text": "ich habe es schon wieder vergessen. Also, wenn ich mir jetzt noch mal meinen RAM kaufen"}, {"id": 736, "start": 6366.2, "end": 6383.92, "text": "würde, dann müsste ich bezahlen. Erst mal gucken, wie mein RAM überhaupt hieß. Wie"}, {"id": 737, "start": 6383.92, "end": 6407.36, "text": "heißt mein RAM? EESGIL. Hier, da. Da. Amal-Speicher. GIF. DDR4. DDR4 mit Beleuchtung, genau. Trident,"}, {"id": 738, "start": 6407.36, "end": 6424.08, "text": "die tatsächlich unter nur mit Beleuchtung. Ne, wir machen das jetzt anders. Wir suchen"}, {"id": 739, "start": 6424.08, "end": 6436.08, "text": "nach Zugriffszeiten. Was haben wir hier? CL14. Hä? Wie kann man da nach suchen? Ich habe"}, {"id": 740, "start": 6436.08, "end": 6438.76, "text": "schon wieder vergessen, wie haben wir denn danach gesucht? Also, es ist auf jeden Fall"}, {"id": 741, "start": 6438.76, "end": 6467.48, "text": "3200er RAM. RGB. Da. Ist er das? Ne. Das ist er auch nicht. Wo ist mein RAM? Wo ist mein"}, {"id": 742, "start": 6467.48, "end": 6491.28, "text": "RAM? Da. CL141434. 16er Kit. Das da müsste das sein. Was genau ist der Unterschied zwischen"}, {"id": 743, "start": 6491.28, "end": 6498.8, "text": "den zwei Dingern? Erkennt da irgendwie einer den Unterschied? Außer, dass der X hinten"}, {"id": 744, "start": 6498.8, "end": 6505.64, "text": "dran steht, aber die Timings sind doch alle gleich. Nur, dass der mit X 10€ mehr kostet."}, {"id": 745, "start": 6505.64, "end": 6526.08, "text": "Hab ich denn für ein RAM? Hab ich mit X oder ohne X? Erkennt man von hier nicht, ne? Doch"}, {"id": 746, "start": 6526.08, "end": 6541.6, "text": "hier. Hier, jetzt hab ich rangezoomt. Erkennt man nicht. Das X steht für besser. Ich hab"}, {"id": 747, "start": 6541.6, "end": 6551.2, "text": "den Geizhals-Link in der Beschreibung. Da guck an. Ich hab den da. Ohne X. Ich hab"}, {"id": 748, "start": 6551.2, "end": 6566.76, "text": "den ohne X, Leute. Ohne X. Gegen das Preisentwicklung öffnen und dann auf alles, ne? Ja, hier"}, {"id": 749, "start": 6566.76, "end": 6572.88, "text": "habe ich den Rechner irgendwie geholt, wo es übelst teuer war. Notebooks billiger. Ich"}, {"id": 750, "start": 6572.88, "end": 6577.68, "text": "finde den Shop eigentlich ganz gut, habe schon öfters was bestellt. Ich glaube, es wird"}, {"id": 751, "start": 6577.68, "end": 6591.96, "text": "mal Zeit für noch 16GB RAM. Ich glaube, es wird Zeit, Leute. Was macht eigentlich unsere"}, {"id": 752, "start": 6591.96, "end": 6596.92, "text": "Windows-VM? Ich glaube, das geht nicht mehr. Ich glaube, das ist kaputt, Leute. Ich glaube,"}, {"id": 753, "start": 6596.92, "end": 6611.92, "text": "jetzt ist RIP. Das geht nicht mehr. Windows-VM ist kaputt. Danke für den Sub. XFATAL1337."}, {"id": 754, "start": 6611.92, "end": 6629.76, "text": "Richtig Elite. Einfach Windows-Taktik stoppen starten. Hast du mal die Sendbox außen wieder"}, {"id": 755, "start": 6629.76, "end": 6638.08, "text": "eingestellt? Gerade eben. Zur Hydrant. Powerstart. Party Parrot. Danke für den Sub. Sind noch"}, {"id": 756, "start": 6638.08, "end": 6653.88, "text": "andere Mods da? Gute Frage, Sebaro. Wenn nicht... Wenn nicht, müsste ich mich mal ernsthaft"}, {"id": 757, "start": 6653.88, "end": 6667.92, "text": "überlegen, ob wir nicht vielleicht noch irgendjemanden modden. Notebooks billiger. Was sagt der MaxElectronics?"}, {"id": 758, "start": 6667.92, "end": 6673.76, "text": "Er sagt, Notebooks billiger ist mega low. Laptop zurück schicken müssen und die haben"}, {"id": 759, "start": 6673.76, "end": 6677.32, "text": "vier Monate gebraucht, um es überhaupt zu merken und es erst weiter bearbeitet, als"}, {"id": 760, "start": 6677.32, "end": 6695.76, "text": "ich mit einem Anwalt gekommen bin. Frist setzen. Immer Frist setzen. Immer Frist setzen. Da"}, {"id": 761, "start": 6695.76, "end": 6702.36, "text": "können die sich nicht rausreden. Leute, ich glaube, das ist tatsächlich das typische"}, {"id": 762, "start": 6702.36, "end": 6714.32, "text": "Microsoft Phänomen. Es geht beim ersten Mal und danach geht es nicht mehr. Da kann ich"}, {"id": 763, "start": 6714.32, "end": 6732.76, "text": "nichts machen. Diese News. Diese News immer, ey. Das Edge-Icon stimmt. Das ist irgendwie"}, {"id": 764, "start": 6732.76, "end": 6752.4, "text": "so. Das ist Mini-Edge. Mini-Edge. Mal angenommen. Jetzt mal ganz doofe Frage. So, ich als Win-Ausdruck."}, {"id": 765, "start": 6752.4, "end": 6758.76, "text": "Mal angenommen, ich habe die Edge-Verknüpfung aus Versehen gelöscht. Wie kriege ich die"}, {"id": 766, "start": 6758.76, "end": 6781.6, "text": "Edge-Verknüpfung wieder hin? Edge. So? Nee. Pin. Suchfeld. Edge. Und dann? Nee. Rechtsklick."}, {"id": 767, "start": 6781.6, "end": 6794.0, "text": "Edge start und rechtsklick in die Taskleiste. Und dann? Und dann? Wie mache ich eine Verknüpfung"}, {"id": 768, "start": 6794.0, "end": 6814.24, "text": "auf den Desktop? Okay. Shift. Shift, rechtsklick in der Taskleiste und dann im Ordner eröffnen"}, {"id": 769, "start": 6814.24, "end": 6837.2, "text": "das Edge-Icon erstellen. Shift, rechtsklick. Du musst die App ans Startmenü anheften."}, {"id": 770, "start": 6837.2, "end": 6847.56, "text": "Okay, okay. Aber im Startmenü geht es auch nicht. Guck. Edge. Okay. Pin from start. Edge-Browser."}, {"id": 771, "start": 6847.56, "end": 6863.48, "text": "Ah. Alter, ist das umständlich. Warum ist sowas einfach so kompliziert? Und warum kann"}, {"id": 772, "start": 6863.48, "end": 6876.64, "text": "ich es darüber ziehen und darüber nicht? Kann ich es darüber ziehen? Auch nicht. Hä?"}, {"id": 773, "start": 6876.64, "end": 6890.44, "text": "Alter Windows. Ist das jetzt wirklich den hier ernst, oder? Tja Leute, ich würde mir"}, {"id": 774, "start": 6890.44, "end": 6897.76, "text": "wirklich gerne die VM angucken. Die Windows Sandbox. Aber ich glaube wir haben zu viel"}, {"id": 775, "start": 6897.76, "end": 6904.28, "text": "RAM jetzt. Okay, wir machen das anders. Wir machen das anders. Das ist bestimmt kaputt."}, {"id": 776, "start": 6904.28, "end": 6910.0, "text": "Das ist bestimmt kaputt, weil wir dir, weil wir dir zu viele CPUs gegeben haben. Also"}, {"id": 777, "start": 6910.0, "end": 6916.16, "text": "wir geben dem Ding jetzt wieder weniger CPUs und wir geben dem, dem, dem bloß, bloß"}, {"id": 778, "start": 6916.16, "end": 6927.8, "text": "6GB RAM. Dann geht es bestimmt. Und da sagt Max, mehr RAM ist immer gut. Was kann ich"}, {"id": 779, "start": 6927.8, "end": 6937.56, "text": "dafür, wenn Windows 10 in der Meinung ist, mehr RAM ist schlecht. Vielleicht ist das"}, {"id": 780, "start": 6937.56, "end": 6942.16, "text": "kaputt, weil du die VM gekillt hast, während die Sandbox lief. Okay, wäre auch Windows"}, {"id": 781, "start": 6942.16, "end": 6949.52, "text": "Logik, ja. Ich könnte, ich könnte das Feature nochmal deinstallieren und wieder installieren,"}, {"id": 782, "start": 6949.52, "end": 6974.44, "text": "jetzt gehts dann. Okay. Sandbox. Yes. Jetzt macht er was. Jetzt macht er was. Ohne Scheiß"}, {"id": 783, "start": 6974.44, "end": 6980.2, "text": "Leute, vorhin hat er nix gemacht. Jetzt macht er was. Das Edge. Jetzt gehts. Ernsthaft."}, {"id": 784, "start": 6980.2, "end": 6997.36, "text": "Windows. Haha, so schlecht. Windows Logik. 4 CPU Kerne, 8GB RAM. Ne, das geht nicht."}, {"id": 785, "start": 6997.36, "end": 7018.4, "text": "2 CPU Kerne, 6GB RAM. Ah, jetzt funktionierts. Okay, jetzt aber. Edge. Voll am Limit hier,"}, {"id": 786, "start": 7018.4, "end": 7025.68, "text": "voll am Limit. For real, warum geht das Scheiß nicht? Weil Windows, das ist ja das Problem,"}, {"id": 787, "start": 7025.68, "end": 7032.44, "text": "was ich mit Windows hab. Es ist nicht nachvollziehbar, warum was geht und warum nicht. Okay. Woop"}, {"id": 788, "start": 7032.44, "end": 7044.84, "text": "Lords Twitch. Jetzt sucht er bestimmt in Bing oder so Dinger. Sucht er in Bing? Jetzt"}, {"id": 789, "start": 7044.84, "end": 7056.76, "text": "vor allem installieren nochmal, nestet Virtualisierung. Woop, warum, macht er jetzt was? Warum macht"}, {"id": 790, "start": 7056.76, "end": 7066.52, "text": "er jetzt einfach Bing auf ohne die Ergebnisse? Okay. Hallo? Ich würde da gerne was tippen"}, {"id": 791, "start": 7066.52, "end": 7073.72, "text": "drinne jetzt. Denied. Oh jetzt gehts. Jetzt gehts. Moment, geh weg. Ah, Windows, please,"}, {"id": 792, "start": 7073.72, "end": 7089.92, "text": "lass mich einfach was tippen. Clocks HD ist jetzt auch am Start. Twitch Prime, Dankeschön."}, {"id": 793, "start": 7089.92, "end": 7094.16, "text": "Serhietrant war auch vor 8 Minuten schon am Start. Hab ich denn schon vorgelesen? Ich"}, {"id": 794, "start": 7094.16, "end": 7101.08, "text": "kann nicht. Wenn nicht, schade dir auch nix. Woop Lords Twitch. Ich fahr das Ding jetzt"}, {"id": 795, "start": 7101.08, "end": 7108.12, "text": "gleich runter und starte es nochmal neu. Scheint sehr performant zu sein, die Sandbox. Naja,"}, {"id": 796, "start": 7108.12, "end": 7113.28, "text": "man darf nicht vergessen, es ist Windows in Windows in Windows. Es ist Windows, es ist"}, {"id": 797, "start": 7113.28, "end": 7120.04, "text": "VMWare, es ist Windows in VMWare und dann nestet Virtualisiert Sandbox. Felix Tegi,"}, {"id": 798, "start": 7120.04, "end": 7142.08, "text": "subscribed. Dankeschön. Guys. Twitch, nestet Virtualisiert. Das ist Next Level, oder? Komplett"}, {"id": 799, "start": 7142.08, "end": 7151.92, "text": "Next Level. Okay, dann wollen wir es nochmal ausprobieren. Soll ich es nochmal runterfahren"}, {"id": 800, "start": 7151.92, "end": 7165.32, "text": "und ordentlich Shutdown machen und dann nochmal 4 Kerne und 8G geben. Jetzt noch Linux Subsystem"}, {"id": 801, "start": 7165.32, "end": 7174.52, "text": "und X Server. Ja, ich hab ja schon vorgeschlagen. Da ist er. Der Stream Leute. Der Stream. Nested"}, {"id": 802, "start": 7174.52, "end": 7185.72, "text": "Virtualisiert. Nested Virtualisiert. Unter Windows, in Windows, unter Windows. Ich mein,"}, {"id": 803, "start": 7185.72, "end": 7194.2, "text": "es lässt sich nicht wirklich bedienen. Es hat ungefähr 0,2 FPS. So ungefähr ist es"}, {"id": 804, "start": 7194.2, "end": 7205.44, "text": "so schnell, denke ich mal. Sogar der Taskmanager laggt. Hallo, Warforce 420. Sogar der. Ich"}, {"id": 805, "start": 7205.44, "end": 7214.36, "text": "glaube, ich hab auf dem Rechner noch nie so hohe CPU-Auslastung gesehen, ey. Ich wusste"}, {"id": 806, "start": 7214.36, "end": 7221.08, "text": "gar nicht, dass der Graph überhaupt komplett blau sein kann. Okay, wir fahren es ordentlich"}, {"id": 807, "start": 7221.08, "end": 7225.44, "text": "runter. Ja, wir fahren es ordentlich. Was passiert eigentlich, wenn man das hier zuklickt? Einfach"}, {"id": 808, "start": 7225.44, "end": 7231.76, "text": "zuklickt. Was passiert dann? Geht es dann kaputt? Ja, es freest. Es freest erstmal."}, {"id": 809, "start": 7231.76, "end": 7245.6, "text": "Windows. Es muss ja die Windows typischen Sachen beibehalten. Erstmal freezen. Ja,"}, {"id": 810, "start": 7245.6, "end": 7253.28, "text": "ich bin mir sicher. Okay, richtig mal ordentlichen Shutdown, Leute. Ordentlichen Shutdown. Der"}, {"id": 811, "start": 7253.28, "end": 7262.56, "text": "gibt die CPU gar nicht mehr her. Das ist jetzt. Auch wieder komische Musik, wo sie reden."}, {"id": 812, "start": 7262.56, "end": 7288.0, "text": "Geh weg. Okay, jetzt Shutdown. Bam. Simulation einer Simulation einer Simulation, ja. Wer"}, {"id": 813, "start": 7288.0, "end": 7295.44, "text": "weiß? Vielleicht sind wir auch nur alle Bestandteile einer Simulation. Vielleicht gibt es uns alle"}, {"id": 814, "start": 7295.44, "end": 7302.4, "text": "gar nicht. Vielleicht sind wir alle bloß in einer ausreichend komplex simulierten VM."}, {"id": 815, "start": 7302.4, "end": 7314.36, "text": "Okay, gucken wir mal, ob es jetzt funktioniert. Und die Frage der Fragen ist ja, sollten wir"}, {"id": 816, "start": 7314.36, "end": 7325.32, "text": "es schaffen, man denkt mal an Sims 4, also an Sims 40, sollten wir es schaffen eine Simulation"}, {"id": 817, "start": 7325.32, "end": 7331.52, "text": "unserer Welt zu erschaffen, stellen wir damit nicht quasi auch in Frage, ob es uns überhaupt"}, {"id": 818, "start": 7331.52, "end": 7340.68, "text": "gibt. Weil wenn wir das schaffen, uns zu simulieren, wer sagt uns denn dann, dass uns nicht schon"}, {"id": 819, "start": 7340.68, "end": 7356.56, "text": "längst jemand simuliert hat? Oh. Jetzt wird es ja esoterisch, ja. Das stimmt. Leute,"}, {"id": 820, "start": 7356.56, "end": 7361.4, "text": "jetzt müssen wir uns mal belegen. Was meint ihr? Geht es jetzt oder geht es jetzt nicht?"}, {"id": 821, "start": 7361.4, "end": 7367.96, "text": "Also wir haben es ja vorhin schon mal probiert. Sandbox ging, mehr RAM, mehr CPU, Sandbox"}, {"id": 822, "start": 7367.96, "end": 7374.28, "text": "ging nicht. Jetzt ordentlich rebooted, wieder mehr RAM, mehr CPU, also quasi das, was es"}, {"id": 823, "start": 7374.28, "end": 7385.4, "text": "eher besser machen würde. Ich tippe auch darauf, dass es nicht geht. Aber wir sehen"}, {"id": 824, "start": 7385.4, "end": 7391.92, "text": "es ja schon gleich an der CPU-Auslastung, ob es geht oder nicht geht. Es geht nicht."}, {"id": 825, "start": 7391.92, "end": 7409.48, "text": "Es geht nicht. Tipp. Oder doch? Nein. Gebaidet. Ich frag mich, hat es hier was gemacht? Hat"}, {"id": 826, "start": 7409.48, "end": 7419.2, "text": "sich das gerade bewegt? Gibt es seit heute eine neue Windows-Version? Nee, seit April"}, {"id": 827, "start": 7419.2, "end": 7434.12, "text": "oder so. Das ist echt eine Wit, das ist echt Windows-Logik. Die verstehe ich nicht. Warum?"}, {"id": 828, "start": 7434.12, "end": 7444.64, "text": "Warum geht das mit 6 GB RAM und 2 CPU-Kernen, aber es geht nicht mit 8 GB RAM und 4 CPU-Kernen?"}, {"id": 829, "start": 7444.64, "end": 7456.72, "text": "Warum? Ich habe eine Idee. Wir machen jetzt Massive Play. Wir verarschen Windows jetzt."}, {"id": 830, "start": 7456.72, "end": 7466.12, "text": "Wir machen es jetzt anders. Wir machen jetzt nicht eine CPU mit 4 Kern, wir machen jetzt"}, {"id": 831, "start": 7466.12, "end": 7475.32, "text": "2 CPUs mit 2 Kern. Jetzt ist vorbei. Jetzt kann es sich nicht mehr wehren. Und, und,"}, {"id": 832, "start": 7475.32, "end": 7493.32, "text": "Moment Leute, und, und wir machen nicht 8 GB RAM, sondern, sondern, Achtung, wir machen"}, {"id": 833, "start": 7493.32, "end": 7502.0, "text": "7996 MB RAM. Jetzt geht's, sag's euch Leute, jetzt geht's. Macht doch in QEMO, wir können"}, {"id": 834, "start": 7502.0, "end": 7530.84, "text": "noch ein bisschen weiter Nested virtualisieren. Okay Leute, Predictions, geht oder geht nicht?"}, {"id": 835, "start": 7530.84, "end": 7554.32, "text": "Na, 5050, ja. Mein Bauchgefühl sagt mir, und ihr wisst, ich hab da, da hab ich genug"}, {"id": 836, "start": 7554.32, "end": 7577.28, "text": "davon, weil mein Bauchgefühl sagt, es geht. Geht anscheinend nicht. Wir wissen ja, das"}, {"id": 837, "start": 7577.28, "end": 7590.4, "text": "ist direkt auf Anschlag mit CPU-Auslastung. Okay, ich geb's auf Leute, ich versteh die"}, {"id": 838, "start": 7590.4, "end": 7595.72, "text": "Windows-Logik nicht. Ich glaube, man kann an dieser Stelle auch nicht von Windows-Logik"}, {"id": 839, "start": 7595.72, "end": 7607.6, "text": "sprechen. Das ist eher Windows-Debating oder so. Was ist dein Ziel? Mein Ziel ist eigentlich"}, {"id": 840, "start": 7607.6, "end": 7614.16, "text": "heute nur sinnlos zu streamen, weil ich Partner geworden bin. Und ich versuch gerade Windows"}, {"id": 841, "start": 7614.16, "end": 7620.6, "text": "unter Windows zu virtualisieren und darin Windows zu betreiben. Und das funktioniert"}, {"id": 842, "start": 7620.6, "end": 7627.24, "text": "allerdings lustigerweise nur mit 2 Kern und 6 GB RAM. Wenn ich 4 Kerne und 8 GB RAM gebe,"}, {"id": 843, "start": 7627.24, "end": 7631.08, "text": "geht's auf einmal nicht mehr. Und wir haben alle keinen Plastenschimmer, woran das liegt."}, {"id": 844, "start": 7631.08, "end": 7643.32, "text": "Übrigens Leute, hab ich euch schon erzählt, dass wenn ihr einen Amazon Prime-Account habt,"}, {"id": 845, "start": 7643.32, "end": 7648.64, "text": "dass ihr den kostenlos mit Twitch verbinden könnt und ihr bekommt dafür kostenlose zusätzliche"}, {"id": 846, "start": 7648.64, "end": 7652.88, "text": "Lootboxen oder wie auch immer das genau heißt auf Twitch und ihr könnt den Streamer eurer"}, {"id": 847, "start": 7652.88, "end": 7661.36, "text": "Wahl einmal im Monat kostenlos mit einem Sub unterstützen. So sieht's aus. Nur Leute mit"}, {"id": 848, "start": 7661.36, "end": 7682.4, "text": "Big Prane machen das. Jetzt machen wir mal was ganz Abgedrehtes. 3 CPU-Kerne. 3 Kerne,"}, {"id": 849, "start": 7682.4, "end": 7692.96, "text": "gibt's sonst nirgendswo. Aber unter Windows geht das wahrscheinlich. Probier mal noch"}, {"id": 850, "start": 7692.96, "end": 7712.84, "text": "weniger Kerne, damit noch weniger Kerne geht's, das wissen wir ja. Wie sehen 3 Kerne im Taskmanager"}, {"id": 851, "start": 7712.84, "end": 7734.24, "text": "aus? Gute Frage, kann man's angucken. So sehen 3 Kerne aus. 3. Ok, gucken wir mal, ob's"}, {"id": 852, "start": 7734.24, "end": 7760.96, "text": "funktioniert. Die Musik geht fort. Das geht auch nicht. Ok, anscheinend ist Windows der"}, {"id": 853, "start": 7760.96, "end": 7787.64, "text": "Meinung, das darf nur unter 2 CPU-Kernen funktionieren. Ich hab keine Ahnung warum. Weil. Äh ich mach"}, {"id": 854, "start": 7787.64, "end": 7790.96, "text": "jetzt aus, ich mach jetzt Windows aus, hab jetzt kein Bock mehr. Also wir wissen, dass"}, {"id": 855, "start": 7790.96, "end": 7794.04, "text": "es prinzipiell funktioniert, allerdings nur in schlechter Performance, weil Windows uns"}, {"id": 856, "start": 7794.04, "end": 7802.24, "text": "nicht mehr Performance erlaubt. Oh, hab ich so viele Desktops auf. Ich blick nicht mehr"}, {"id": 857, "start": 7802.24, "end": 7818.24, "text": "durch, zu viele Desktops. Würdest du einen Bann von Lootboxen befürworten, Belkin hatte"}, {"id": 858, "start": 7818.24, "end": 7826.72, "text": "ja schon verboten. Ähm, also ich bin nicht dafür, ich bin selten dafür, irgendwas komplett"}, {"id": 859, "start": 7826.72, "end": 7834.16, "text": "zu verbieten. Aber ich finde im Falle Lootboxen, also ich hab kein Problem mit das Lootboxen"}, {"id": 860, "start": 7834.16, "end": 7839.52, "text": "im Game sind, es ist die Frage immer, wie's eingesetzt wird. Und vor allem bei Mobile"}, {"id": 861, "start": 7839.52, "end": 7843.24, "text": "Games und jetzt natürlich auch neuerdings, ich mein Battlefront war jetzt ein prominentes"}, {"id": 862, "start": 7843.24, "end": 7849.64, "text": "Beispiel für, dient es ja im Prinzip dazu, die Leute zu verarschen. Ja, mit extra langen"}, {"id": 863, "start": 7849.64, "end": 7855.48, "text": "Grindzeiten im Hauptgame, teilweise mit ultra kleiner Loot-Chance von irgendeinem Held"}, {"id": 864, "start": 7855.48, "end": 7861.08, "text": "oder von irgendwas. Ich find's an sich gar nicht so schlimm, wenn's Lootboxen gibt,"}, {"id": 865, "start": 7861.08, "end": 7872.4, "text": "aber man sollte, es muss klar erkenntlich sein, ähm, erstens natürlich was man raus"}, {"id": 866, "start": 7872.4, "end": 7880.64, "text": "bekommen kann und wie wahrscheinlich das Ganze ist, dass man was bekommt. Und was ich"}, {"id": 867, "start": 7880.64, "end": 7887.44, "text": "auch prinzipiell nicht schlecht finden würde, wenn Spiele, die quasi so nen Glücksfaktor"}, {"id": 868, "start": 7887.44, "end": 7894.92, "text": "drinnen haben, erst ab einem gewissen Alter freigegeben werden, egal wie der Inhalt vom"}, {"id": 869, "start": 7894.92, "end": 7901.04, "text": "Spiel ist. Allerdings ist halt die Frage, ob das überhaupt irgendwelche Auswirkungen"}, {"id": 870, "start": 7901.04, "end": 7906.68, "text": "hat, ne. Weil ganz ehrlich, wer von uns hat bis 18 gewartet, um Spiele mit 18 zu spielen?"}, {"id": 871, "start": 7906.68, "end": 7911.52, "text": "Oder wer hat, wer von uns hat gewartet, bis 16 zum Spiele ab 16 zu spielen?"}, {"id": 872, "start": 7911.52, "end": 7927.56, "text": "Max Nutztmann Jaro mit i3 WM, ja da hat der Nightbot Recht. Was sagt eigentlich mal Pepega"}, {"id": 873, "start": 7927.56, "end": 7930.8, "text": "Board, was wir noch für Fragen haben? Wir haben viele Fragen, aber vom letzten Streben"}, {"id": 874, "start": 7930.8, "end": 7938.88, "text": "nach. Oh, ich habe meine, Leute, ich noob, ich hab meinen Linux VM ausgeschaltet. Jetzt"}, {"id": 875, "start": 7938.88, "end": 7944.52, "text": "hat das Pepega Board nicht mal mitgeloggt, was der Chat gefragt hat. Also falls ihr in"}, {"id": 876, "start": 7944.52, "end": 7950.4, "text": "den letzten 20 Minuten irgendwas gefragt habt im Chat, und ich hab's noch nicht beantwortet,"}, {"id": 877, "start": 7950.4, "end": 7955.56, "text": "dann müsst ihr das gleich, wenn ich das Board gestartet habe, nochmal posten. Moment, aber"}, {"id": 878, "start": 7955.56, "end": 7961.4, "text": "jetzt noch nicht, jetzt noch nicht. Ja, richtiger Fail, Leute, gleich Disabo, gleich Disabo."}, {"id": 879, "start": 7961.4, "end": 7969.56, "text": "So, jetzt ist wieder gestartet, jetzt könnt ihr noch mal fragen, falls es noch was gab."}, {"id": 880, "start": 7969.56, "end": 7997.36, "text": "Okay, das hatten wir, das hatten wir auch. Und löschen wir mal von unten."}, {"id": 881, "start": 7997.36, "end": 8017.8, "text": "So viele Nachrichten. Mein Tool ist irgendwie kaputt, das zeigt nicht alles an. Ach, ich"}, {"id": 882, "start": 8017.8, "end": 8023.36, "text": "glaube, ich weiß woran das liegt. Ich glaube, ich habe ein Limit von nur 50, nur ein Limit"}, {"id": 883, "start": 8023.36, "end": 8042.92, "text": "von nur 50 Fragen drinne. Fail. Programming Noob. Wirkt euch das mal an, wie viele Sachen"}, {"id": 884, "start": 8042.92, "end": 8048.52, "text": "da eigentlich drinne sind. Womit wird die Sandbox eigentlich virtualisiert? Ich denke"}, {"id": 885, "start": 8048.52, "end": 8057.6, "text": "mal, das Hyper-V. Was hast du dir bei Electro Boom anguckt? Ich"}, {"id": 886, "start": 8057.6, "end": 8062.68, "text": "habe nur den Channel gezeigt, weil irgendjemand vorhin gefragt hat, was gute Technik-Channels"}, {"id": 887, "start": 8062.68, "end": 8070.08, "text": "sind. Habe ich zwei Channels gezeigt, dabei einer davon. Den gucke ich halt wirklich"}, {"id": 888, "start": 8070.08, "end": 8078.56, "text": "gern, der ist sehr nice. Also, wie viele Fragen hier drin sind. Also, das ist von vor 5 Streams"}, {"id": 889, "start": 8078.56, "end": 8089.32, "text": "oder so, weil ich wieder nicht gelöscht habe. Der grillt sich doch immer selber, ja genau."}, {"id": 890, "start": 8089.32, "end": 8096.84, "text": "Willst du auch Gaming-Streams machen? Ja klar, spätestens, wenn Bad Company 3 rauskommt,"}, {"id": 891, "start": 8096.84, "end": 8114.44, "text": "geht es wieder ab. Gibt es eigentlich was Neues? Gibt es was Neues? Nein, gibt es nicht."}, {"id": 892, "start": 8114.44, "end": 8135.2, "text": "Ich glaube, im deutschen Bereich bist du aber auch der kompetenteste und interessanteste"}, {"id": 893, "start": 8135.2, "end": 8155.08, "text": "Streamer. Ich habe kein passendes Emote dafür. Würde ich das Herzchen-Emote machen. Die"}, {"id": 894, "start": 8155.08, "end": 8161.32, "text": "Kompetenz ist ja eh nur gefaked, ich hoffe, das ist euch allen klar. Ich tue eigentlich"}, {"id": 895, "start": 8161.32, "end": 8170.32, "text": "nur so, als kenne ich mich damit aus. Denkst du eher an Tutorials oder News-Gelaber für"}, {"id": 896, "start": 8170.32, "end": 8181.92, "text": "YouTube? News-Gelaber eigentlich eher nicht. Außer, dass es wirklich bedeutsam ist. Ja,"}, {"id": 897, "start": 8181.92, "end": 8191.76, "text": "so das kann man beliebig weiterspinnen. Oh Patrick, ja ich weiß, was du meinst, wie"}, {"id": 898, "start": 8191.76, "end": 8204.72, "text": "hieß das Ding dann? Das ist so ultra low-level Zeug gewesen, also quasi fast noch unter USB,"}, {"id": 899, "start": 8204.72, "end": 8210.92, "text": "also wo du quasi auch Tastatureingaben faken kannst, wo man nicht mal erkennt, dass die"}, {"id": 900, "start": 8210.92, "end": 8217.2, "text": "Taste abgedrückt wurde. Das hast du bestimmt noch im Discount, ich weiß gerade nicht mehr,"}, {"id": 901, "start": 8217.2, "end": 8231.68, "text": "wie das Ding hieß. Hast du schon was geplant, wann der Stream morgen startet? Na ja, morgen"}, {"id": 902, "start": 8231.68, "end": 8259.0, "text": "ist Samstag, wahrscheinlich Mittag oder Nachmittag. Der ohne Kohle, tatsächlich, das gibt echt"}, {"id": 903, "start": 8259.0, "end": 8264.28, "text": "Leute, die das geguckt haben, nice. Dabei, ich hätte mir über das Video viel mehr Gedanken"}, {"id": 904, "start": 8264.28, "end": 8271.36, "text": "machen müssen, da gibt es noch viel mehr coole Sachen. Übrigens, die Idee des Tages"}, {"id": 905, "start": 8271.36, "end": 8275.84, "text": "hat derjenige gewonnen, also nicht, dass es dafür was zu gewinnen gibt, aber die beste"}, {"id": 906, "start": 8275.84, "end": 8280.48, "text": "Idee heute im Stream fand ich diese Sache mit dem Keks, den man füttern muss unten"}, {"id": 907, "start": 8280.48, "end": 8287.36, "text": "im Stream. Das können wir wirklich selbst programmieren, sowas, da muss ich allerdings"}, {"id": 908, "start": 8287.36, "end": 8299.64, "text": "noch einen Grafik-FX-Mensch finden, der die passenden Kekse machen kann dafür. Na ja,"}, {"id": 909, "start": 8299.64, "end": 8324.48, "text": "die brauchen einen halb zerkrümelten Keks, den löchrigen Keks, den Keks, der gut drauf"}, {"id": 910, "start": 8324.48, "end": 8340.8, "text": "ist. Wozu brauchst du denn eine mini WLAN-Kamera? Kannst du gute Access Points empfehlen? Ja,"}, {"id": 911, "start": 8340.8, "end": 8347.44, "text": "den Pro Access Point von Ubiquiti ist ziemlich gut. Hat zwar auch seine Macken, vor allem,"}, {"id": 912, "start": 8347.44, "end": 8351.32, "text": "dass man diesen komischen Controller für braucht, das kann ein ordentliches Webinterface"}, {"id": 913, "start": 8351.32, "end": 8370.12, "text": "haben, aber der reine Access Point davon ist ziemlich gut. Flo690, ich habe den Reboot-Clip"}, {"id": 914, "start": 8370.12, "end": 8376.44, "text": "mal einem auf der Arbeit gezeigt, der konnte sich das Ganze auch nicht erklären. Das Einzige,"}, {"id": 915, "start": 8376.44, "end": 8384.2, "text": "was wir uns zusammenreimen konnten, ist, dass diejenigen, die das Image gebaut haben, in"}, {"id": 916, "start": 8384.2, "end": 8389.52, "text": "der History-Reboot drin stehen hatten und ich es irgendwie geschafft habe, mit meinem Rumgeklick"}, {"id": 917, "start": 8389.52, "end": 8397.12, "text": "und gemachte vorher noch einen Pfeil nach oben, eine Escape-Sequenz oder so drin zu haben,"}, {"id": 918, "start": 8397.12, "end": 8421.08, "text": "keine Ahnung, kann sich keiner erklären. Warten wir schon?"}, {"id": 919, "start": 8421.08, "end": 8438.04, "text": "Wie viele kannst du eigentlich haben? Ich weiß es nicht. Ich habe auch keine Ahnung,"}, {"id": 920, "start": 8438.04, "end": 8453.04, "text": "wo ich Sub-Batches und irgendwas hochlade. Ich muss erstmal gucken. Weißt du oder jemand"}, {"id": 921, "start": 8453.04, "end": 8458.84, "text": "im Chat, wie man eine Weile schlafen kann mit einem Tastendruckband in Steuerung C, also"}, {"id": 922, "start": 8458.84, "end": 8468.44, "text": "Linux-Shell. Und halte mal Steuerung C ein bisschen gedrückt, das braucht man kurz."}, {"id": 923, "start": 8468.44, "end": 8471.2, "text": "Kannst du mir eine LXC-Frage mal antworten? Klar, schieß los."}, {"id": 924, "start": 8471.2, "end": 8485.48, "text": "Mal eine Frage zur LXC. Kann man Container beim Startup automatisch einen anderen DNS-Server"}, {"id": 925, "start": 8485.48, "end": 8490.44, "text": "in der Resolve-Conf setzen? Derzeit nimmt er den vom Haus, der ist aber nicht vom Container"}, {"id": 926, "start": 8490.44, "end": 8497.56, "text": "erreichbar. Du kannst mit LXD, also mit diesem Ubuntu Zeug, kannst du Parameter für jede"}, {"id": 927, "start": 8497.56, "end": 8502.04, "text": "VM überschreiben. Muss man nachgucken, ob es die Möglichkeit gibt, den DNS zu überschreiben,"}, {"id": 928, "start": 8502.04, "end": 8509.2, "text": "das weiß ich nicht. Also nicht aus dem Kopf. Ja, das könnte ich sein, genau. Ja, das war"}, {"id": 929, "start": 8509.2, "end": 8517.72, "text": "das. Wie viele Subs hast du schon? Ich weiß noch nicht mal, wo der Sub-Counter steht, da"}, {"id": 930, "start": 8517.72, "end": 8529.08, "text": "würde ich nachgucken. Aber ich tippe mal so auf 35 oder so. Also huge."}, {"id": 931, "start": 8529.08, "end": 8546.36, "text": "Alles, wir haben alles."}, {"id": 932, "start": 7556.94, "end": 8575.24, "text": "Xe-Marsel, nice, Dankeschön, Twitch Prime. Poggers. Okay Leute, es ist 21.20, ich"}, {"id": 933, "start": 8575.24, "end": 8581.76, "text": "habe noch nichts gefuttert heute Abend. Ich werde erst mal was essen gehen. Wir gucken"}, {"id": 934, "start": 8581.76, "end": 8586.24, "text": "mal, wen wir hosten können. Es war schön, dass ihr spontan wieder alle mit am Start"}, {"id": 935, "start": 8586.24, "end": 8590.84, "text": "gewesen seid. Das war jetzt ja relativ spontan das Ganze. Eigentlich wollte ich erst morgen"}, {"id": 936, "start": 8590.84, "end": 8599.92, "text": "mit dem Staubsauger streamen. Morgen, Nachmittag, Mittag, Nachmittag, Abend, so, irgendwie,"}, {"id": 937, "start": 8599.92, "end": 8604.44, "text": "in dem Dreh, ich weiß noch nicht genau, wann es losgeht, flashen wir meinen Staubsauger"}, {"id": 938, "start": 8604.44, "end": 8610.76, "text": "mit neuer Firmware und gucken, wie das Ganze funktioniert. Wann geht es los? Ich weiß"}, {"id": 939, "start": 8610.76, "end": 8620.24, "text": "noch nicht ganz genau. Ich denke mal, wahrscheinlich so 16 Uhr oder sowas. Flashen wir den Staubsauger"}, {"id": 940, "start": 8620.24, "end": 8626.76, "text": "und gucken mal, was die neue Firmware taugt. Ich habe mir schon kurz den Changelog angeguckt,"}, {"id": 941, "start": 8626.76, "end": 8631.68, "text": "es sind ein paar gute Sachen dabei. So, jetzt schauen wir mal, wen wir hosten können."}, {"id": 942, "start": 8631.68, "end": 8649.36, "text": "Inside das Universum. Was ist das? Das ist Universum, der meint das Wort wörtlich. Das"}, {"id": 943, "start": 8649.36, "end": 8658.88, "text": "ist Big Brain Stream. Java, den haben wir letztens gehostet schon. Let's develop Unity"}, {"id": 944, "start": 8658.88, "end": 8670.32, "text": "Creator Kit. Der hat schon mal einen niedlichen Avatar, das gefällt mir. Entspanntes Fivum."}, {"id": 945, "start": 8670.32, "end": 8682.52, "text": "Fivum, was ist das? Was ist das für eine Sprache? Ich würde sagen, auf den ersten"}, {"id": 946, "start": 8682.52, "end": 8693.88, "text": "Blick hätte ich gesagt, JavaScript, aber dann doch wieder nicht. Was ist das für eine"}, {"id": 947, "start": 8693.88, "end": 8712.28, "text": "Sprache? Ist das Lua? Nee. Ah, das ist die GTA Mode. Was ist das für eine Sprache? Könnte"}, {"id": 948, "start": 8712.28, "end": 8729.68, "text": "doch Lua sein, oder? Wenn es ein Modtool ist, dann ist Lua gar nicht so unwahrscheinlich."}, {"id": 949, "start": 8729.68, "end": 8752.08, "text": "Okay, wir sind uns einig, es muss Lua sein. Android Flutter App. Spring Boot. Java. 3D"}, {"id": 950, "start": 8752.08, "end": 8757.48, "text": "Drucker Schach. Dieser Stream, der ist fast 24-7 gefühlt online. Jedes Mal, wenn wir"}, {"id": 951, "start": 8757.48, "end": 8770.36, "text": "gucken, ist der online und der hat im Stream die Kamera von seinem 3D Drucker. Was macht"}, {"id": 952, "start": 8770.36, "end": 8800.28, "text": "der hier? Ist der nackig? Ähm, den wollen wir hosten. Sagt"}, {"id": 953, "start": 8800.28, "end": 8804.68, "text": "mir, ich muss ehrlich sagen, spontan sagt mir gar nichts so richtig zu. Schau mal bei"}, {"id": 954, "start": 8804.68, "end": 8826.76, "text": "Just Chatting. Just Chatting auf Deutsch. Grillz, Grillz. Grillz. So viele Grillz mittlerweile."}, {"id": 955, "start": 8826.76, "end": 8840.04, "text": "Huge. Sollten wir gerade explizit sagen, nein, machen wir nicht. Guck einfach, wenn man"}, {"id": 956, "start": 8840.04, "end": 8844.12, "text": "so hosten kann, ob irgendjemand dabei ist, den ich vielleicht kenne, oder irgendetwas,"}, {"id": 957, "start": 8844.12, "end": 8855.2, "text": "was mich so direkt anspricht vom Titel her. Aber krass, wie viele Mädels mittlerweile"}, {"id": 958, "start": 8855.2, "end": 8869.2, "text": "streamen, oder? Und nicht eine, nicht eine Boobcam, oder? Sehe ich das richtig? Sachen"}, {"id": 959, "start": 8869.2, "end": 8893.24, "text": "gibt's eher. Da war PC-Build? 18 plus. PC-Build. Warum ist das 18 plus? Okay, wo ist, wo ist"}, {"id": 960, "start": 8893.24, "end": 8898.76, "text": "der Dude? Muss ich mir jetzt mal angucken kurz. Nicht, dass der wieder ohne Hose wieder"}, {"id": 961, "start": 8898.76, "end": 8925.16, "text": "andere da im Stream setzt. Sind das zwei? Das sind zwei, oder? Dual Build. PC, PC-Building-"}, {"id": 962, "start": 8925.16, "end": 8951.56, "text": "Simulator. Stimmt, warum ist er vier Stunden am bauen? Ah fuck. What why? Ah vier Stunden"}, {"id": 963, "start": 8951.56, "end": 8967.2, "text": "mindersinstallation. Kann das sein, dass er sich einfach nur angeguckt hat? Nee. Ach"}, {"id": 964, "start": 8967.2, "end": 8972.4, "text": "Leute, keine Ahnung, wen ich hosten soll. Sagt mir heute, sagt mir heute überhaupt"}, {"id": 965, "start": 8972.4, "end": 8976.84, "text": "nichts zu. Wir machen dann jetzt einfach so Schluss. Morgen sehen wir uns mit dem Staubsauger,"}, {"id": 966, "start": 8976.84, "end": 8985.6, "text": "der geflasht wird. Und ich guck jetzt mal, ob ich noch irgendwelche Subs verpasst hab."}, {"id": 967, "start": 8985.6, "end": 8992.24, "text": "Nope. Also Leute, danke für die ganzen Subs heute, auch für die ganzen Follows und dass"}, {"id": 968, "start": 8992.24, "end": 8996.08, "text": "hier wieder so viele Leute wart, die einfach nur sinnlos beim Schwätzen zugeguckt haben."}, {"id": 969, "start": 8996.08, "end": 9007.84, "text": "Wir sehen uns morgen, machts gut. See you."}]}