{"text": "Das war's für heute, bis zum nächsten Mal, tschüss, tschüss, tschüss, tschüss, tschüss.Das war's für heute, bis zum nächsten Mal, tschüss, tschüss.So Leute, ich bin am Start.Moin. Moment. Ich höre mich doppelt.Ah, ich habe meine Vorschau an. Bescheuert, wenn man seine Vorschau nicht muteet, ne?Und man könnte auch eigentlich sagen, es ist absolutely next level.Ja, die Standortanzeigen sind voll für den Arsch. Die stimmen nicht.Ich zeige euch aber auch gleich, warum nicht. Das ist nämlich Absicht.Weil das sind Tracking-Nummern, die ich hier drin stehen habe, die mir freundlicherweise von Stream-Zuschauern gesponsort wurden,dass ich meine eigene Adresse nicht reinschreiben muss, sobald man die Adresse eh nicht sieht.Man sieht ja bloß die Direktion hier an der Stelle.Bin ich lauter als sonst? Oder ist mein Ohr heute irgendwie empfindlicher?Ne, ich würde sogar so weit gehen und sagen, ich bin leiser als sonst.Ich leise als sonst?Das war eine Lautstärketest. Der ist eigentlich wie immer.Ich glaube, mein Ohr ist empfindlicher.Das wäre aber auch gut, weil ich habe schon, wie gesagt, seit eineinhalb Wochen Halsweh.Und ich war gestern mal beim Doktor und er hat mir was aufgeschrieben zum Hals- und alles sauber abbauen irgendwie.Irgendwelche Schleimlösungsdinger.Wahrscheinlich löst das wirklich. Deswegen höre ich jetzt auch wieder viel besser.Honka Smoke.Also, ich zeige euch mal ein bisschen was zu den Leuten, die im Stream dabei waren.Die kennen das ja schon.Ich brauche ein paar Leute, die es ausprobieren wollen.Und zwar, was man als aktuell machen kann, ist, ich zeige euch das Ganze mal.Ich warte nochmal kurz, bis der Stream richtig angelaufen ist.Twitch hat es ja noch nicht so ganz gecheckt.T-Max Electronics.Twitch Prime. Dankeschön.Ich habe sogar extra eine ReadMe eingebügt mit Screenshots.Also, ich erzähle nochmal den Sinn und Zweck dahinter.Weil, wie gesagt, Versandtracker-Apps gibt es wie Sand am Meer.Allerdings ist meine eine Special-Versandtracker-App.Man sieht es hier in der Oberfläche nicht, aber ich kann es euch gleich mal im Backend zeigen.Das ist eine Versandtracker-App, die euer E-Mail-Postfach durchsuchen kann nach Tracking-Nummern.Und sie dann automatisch trackt.Natürlich könnt ihr den Kram auch selbst hinzufügen. Ist kein Ding. Funktioniert.Aber das Sinn und Zweck ist, dass eure Sache von alleine trackt.We29Corn. Twitch Prime. Dankeschön.Das ist keine Android-App. Die App gibt es...Ich nenne das nur App, weil jeder heute, der cool sein will, sein Programm App nennt.Das gibt es überhaupt nicht für mobile. Aber es läuft auch.Also, du kannst das Frontend auf mobile verwenden.Also, aktuell gibt es das Ganze hier für Windows, Linux und für Linux und Raspberry.Magst du eine Tracking-Nummer von mir?Erwarte noch ein Paket heute. Ja, gib mal her.Was ist es denn?Also, aktuell unterstütze ich...DAL Hermes, DPD UPS.Amazon ist fake.Zur Zeit. Wenn man Amazon eingibt.Ich hatte noch keine Nerven, die Amazon-Webseite zu parsen.Die Tracking-Amazon-Seite zu parsen.Kein allzu großer Akt, aber es ist nervig.Ah, sorry Leute. Amazon. Amazon natürlich.Mac OS kann ich ohne Probleme generieren.Das ist eine Web-App. Das sind zwei Sachen.Das ist eine Web-App. Für das Frontend.Das heißt, du kannst es auch ohne Probleme auf dem Tablet benutzen.Allerdings das Backend. Also, da wo das alles am Ende drauf läuft.Die Verknüpfung GitHub-Release ist kaputt.Echt?Ja, das ist das.NET Core.Ups. Ups.Was macht die Verknüpfung überhaupt da?Die Verknüpfung zeigt bestimmt noch auf meinen Ordner, oder?Egal, du kannst einfach in den Publish-Ordner reingehen und das Ding starten.Ich zeige euch das Ganze mal.Mac OS kann ich einfach generieren.Wie gesagt, ich habe das heute Morgen nur mal fertig gemacht, weil es gammelt bei mir schon ewig rum.Und ich habe es jetzt erstmal ein bisschen aufgeräumt und so in den Zustand gebracht, dass man es überhaupt ausprobieren kann.Ja. Also, takt. Wir können es mal ausprobieren.Geht mal die Nummer. Geht mal die Nummer.Dann probieren wir es mal, ob er das tracken kann.Ja.Bei DHL haben wir noch ein bisschen das Problem, dass ich einen AP-Key habe, der nur für 250 Aufrufe am Tag geht.Und das ist wahrscheinlich bei ein paar Leuten die DHL-Abfragen sofort erreicht.Dann gibt es einen Fehler.Amazon ist fake.Wenn ich Amazon etwas eingebe, dann sagt er...Moment, der sollte sich demnächst aktualisieren.Amazon-Tracking not supported.Jebaited. Ich habe mir gedacht, ich lasse es mal drin stehen, dass es besser aussieht.Aber sobald ich Zeit und Musel dazu habe, die Amazon-Tracking-Seite zu passen, dann funktioniert das auch.Okay. Gucken wir mal, ob das von Azotuck funktioniert.DHL. Nee, was hast du gesagt? DPD ist es.Tracking.So. DPD.Mal gucken, ob es funktioniert. Mal gucken. Jetzt bin ich mal gespannt, ob das klappt.Loading. Er loadet ganz schön lange.Ha! Delivered. Neu Ulm. Guck da.Stimmt das? Azotuck, wohnst du in Neu Ulm?Ich habe etwas aus Aschaffenburg bestellt.Und es ist in Neu Ulm angekommen.Und richtig, richtig high-end.Pull-Request erlaubt. Er wünscht...Im Prinzip schon, aber das ist teilweise so...Also, kannst du gerne machen.Aber es ist teilweise sehr hässlich.Ich habe es einfach zusammengewurstet, dass es jemand anderes außer ich verwenden kann.Die Suche ist noch gar nicht implementiert.Die hat einfach nur einen Button.Die gelöschten Sachen hier im Papierkorb angucken macht auch noch nichts, wenn man draufklickt.Das einzige, was aktuell funktioniert, ist Dark Light Theme und adden.Das Wichtigste ist schon mal da.So, jetzt gucken wir uns mal die Map an, was der Azotuck bestellt hat.Wir sehen... Wow.Was ist das?Warum hat er bei Aschaffenburg nichts hingeschrieben?Was ist da kaputt?Warum ist da kein Icon?Das ist schon erster...Das ist immer so.Den ersten Kontakt mit der Realität hält das Ganze eh nie stand.Ja, macht das Rollspeedport.Aktuell ist das Frontend eine riesen HTML-Sattel.Ein bisschen kaputt, also man prinzipiell geht es.Das ist Aschaffenburg, aber warum ist da kein Icon an der Stelle?Ist wenigstens der LKW gefahren?Habt ihr geguckt, ist der LKW gefahren?Ich hoffe mal, der LKW ist gefahren.Wartet mal.Ja, okay, der Truck fährt schon mal.Das ist schon mal was.In welchem Ort erfinde ich deine Unit-Tests?Hier, guck, ich zeig's dir.Tests gibt's hier.Huge.Huge-Tests.Das ist ja auf den Street-Maps, ja.Also was mich jetzt erstmal interessieren würde ist,ob es bei euch tut, und zwar zwei Sachen.Zwei Sachen, ob es bei euch tut.Einmal, ob das auf Windows, Linux, vielleicht an einem Raspberry,ob das läuft.Das nächste ist, ob ihr was tracken könnt,manuell hinzufügen über das Web-Interface.Und danach, das ist ja das Neue, das geht ja schon seit ein paar Wochen.Das haben wir ja sogar noch zusammen im Stream gemacht.Aber was jetzt neu ist, zeig's euch mal.Man kann jetzt, es gibt eine Config-Datei.Die liegt hier so rum.Die findet ihr da.Direkt im Hauptverzeichnis gibt's eine hier drinnen.Also besser gesagt, wenn ihr das runterladet,direkt beim Entpacken in dem Verzeichnis.So schlecht ist der Code gar nicht, bis aufs HTML.Ich bin selbst nicht ganz damit zufrieden.Viele Sachen sind einfach so gemacht, dass sie erst mal gehen.Und das Frontend ist halt ein riesiges, zusammengewurstetes Ding.Ihr findet hier eine Config-Json-Datei.Und da könnt ihr eintragen eure Default-Location,die ihr immer nimmt, wenn das Paket auf zugestellt istund der Zustellungsschritt nicht erfasst ist beim Anbieter.DHL und ein paar Anbieter machen das so.Die schreiben unterwegs, wo das Paket landet.Die schreiben hier unterwegs Zeugs.Allerdings, hier, guck mal, DHL zum Beispiel.Die schreiben hier, bla, zugestellt, Hannover.Die Sendung wurde zugestellt.Das ergibt ja keinen Sinn, dass sie in Hannover istund morgen in Frankfurt.Wenn der Zugestelltschritt keine Standortinformation enthältvom Anbieter, wie das bei DHL ist,dann sucht er nach dieser Default-Location von euch,die ihr eingetragen habt.Das heißt, es wäre sinnvoll, wenn man hier einfachden Ort einträgt, wo man seine Pakete hin bestellt.Ihr könnt im Prinzip wählen, was ihr wollt.Das ist wichtig, dass er in den E-Mails erkennt,ob das an euch ist.GLS kann ich auch mit reinnehmen,wenn die sich einfach treppen lassen.Das erste Verwender hier für das Tracking,das was Sinnvolles dasteht,an der Stelle, wo der Anbieter nichts einträgt.Der Name wird beim E-Mails-Scan verwendet.Ich zeige euch gleich, wie das mit dem E-Mails-Scan funktioniert.Der muss ja irgendwie festmachen,wenn er E-Mails durchsucht,ob das eine E-Mail an euch ist,beziehungsweise ob das ein paar Kriterien erfüllt,dass es überhaupt eine E-Mail von einem Shop ist mit Versandnummer.Das ist das nächste Feature.Die zwei Sachen wäre schön,wenn sie ein paar Leute finden würden,die das testen können.Das erste ist manuell hinzufügenund testen, ob das funktioniert mit dem Tracking.Ihr könnt euch den Source Code vorher angucken,ihr könnt es auch selbst übersetzen,wenn ihr denkt, ich habe da einen Keylogger eingebaut.Das ist alles offen auf GitHub.Da ist kein Keylogger drin.Und hier kann man seinen...Ich habe es bisher nur mit GMX getestet.Ich würde interessieren, ob das mit anderen funktioniert.Schweizer Post...Ihr müsst mal gucken, wenn die eine Tracking-AP habenoder man die einfach parsen kann.Und hier kann manden Server von seinem E-Mail-Provider angeben,sein Login und sein Passwort.Und dann geht der in das E-Mail-Postfachund guckt, ob er Versandbestätigung findet.Das ist der eigentliche Knackpunkt,warum ich das Ding programmiert habe.Dann geht er in das E-Mail-Postfach.Aktuell geht nur IMAP.Ich weiß nicht, wer heute noch POP3 verwendet.Dann geht er in das E-Mail-Postfachund scannt initial die letzten 60 Tagenach Versandbestätigung durch.Ab dann nur noch ab dem letzten Scan-Zeitpunkt.Fügt alles, was er findet,bei euch dann hinzu in den Tracker.Und das würde mich interessieren, ob das funktioniert.Ich habe es bei mir mit GMX getestet.Funktioniert bei mir ohne Probleme.Erkennt DHL-Mails, erkennt Amazon-Mails.Aber ich weiß halt nicht, wie es mit anderen E-Mail-Anbietern ist.Moin, erstmal Kopf vor Mann.Wir haben ja Kaffee mit Salz.Huge, zwei Monate. Dankeschön.Hast du das programmiert, Max?Ja, habe ich.Ich habe noch ein paar Problos hier.Ich zeige euch mal, wie das mit dem E-Mail-Tracker funktioniert.Weil das letzte Mal, welche gefragt haben.Das ist eigentlich ziemlich simpel.Es gibt hier eine Klasse IMAP-Mail-Scanner.Der holt sich aus den Settingsden Server raus.Also das hier, der holt sich den Server raus.Der holt sich den Usernamen und das Passwort für das E-Mail-Postfach raus.Dann lockt er sich ein.Ich will mal einen Ticken größer.Hallo?Nee, da wird es fett.Das reicht, so kann man es auch lesen.Dann lockt er sich ein im E-Mail-Postfach.Ich stelle das Ganze absichtlich mal auf Read-Only.Nicht, dass ich irgendwie Bullshit baue und Leute E-Mails lösche oder so.Wir wollen ja kein Risiko eingehen.Wie gesagt, das ist alles Alpha.Bei mir geht nichts kaputt und ich habe es auch programmiert,dass eigentlich nichts kaputt gehen kann.Aber ich würde es jetzt nicht unbedingt verwenden,gegen etwas, was wahnsinnig wichtig ist.Bis das ein bisschen besser getestet ist.Dann holt er sich alle E-Mails,die nach dem Datum von LastScan eingeliefert wurden.Also LastScan ist standardmäßig nicht 60, 30 Tage.Danach setzt er es auf aktuell minus 5 Minuten,falls er ein bisschen länger zum Verarbeiten braucht.Dann sucht er in eurer E-Mail in eurer Inbox nach den Mails der letzten 30 Tageund ordnet die nach dem Datum,falls das irgendwie nicht richtig zurückkommt.Und dann passt er die E-Mail durch nach ein paar Requexes.Zum Beispiel, so sieht eine DHL-Trackingnummer aus im Requex.So sieht eine OPS-Trackingnummer aus.So sieht Amazon-Trackingnummer aus, DPD und Hermos.Allerdings ist das nicht ganz so praktisch.Weil beim Ausführen was nicht geklappt zu haben.Wahrscheinlich mache ich was falsch.Oh, Danny, was hast du gemacht?Ach so, ja.Das Windows-Ding hat BeatBroad gerade schon festgestellt.Habe ich gefailed.Wir installieren das jetzt gleich.Wir laden uns das jetzt gleich mal zusammen runter und probieren das aus.Sehr nett, dass ich euch mal zeigen kann, wie es funktioniert.Softbubble, Twitch Prime, Dankeschön.Ich habe den Link verkehrt gemacht hier in der Windows.Ich habe falsch verlinkt.Ich habe es verkackt.Ich will es nicht nochmal hochladen jetzt.Dann wackelt dann ruckelt der Stream.Also ihr müsst euch, wenn ihr Windows habt, einfach das hier runterladen.Den Win64-Zip und dann mal auspacken.Ich mache mal kurz aus.Einfach entpacken, das Ganze.Was entpackt der denn in drei Stunden?Ich habe eine NVMe SSD.Ein 50 MB oder so.Und da ist ein Link drin.Damit ist eigentlich gedacht, das Ganze zu starten.Ich habe den Link kaputt gemacht.Der Link ist kaputt.Ich habe gefällt.Ich habe einen absoluten Link, wie der letzte Kacknoob, reingeschrieben.Und nachdem es bei euch kein C++ User Stream gibt, funktioniert der Link nicht.Bei mir funktioniert der Link.Bei euch funktioniert der Link nicht.Deswegen müsst ihr in den Publish-Ordner reingehen und dort den Versand-Tracksaw starten.Wenn ihr den Versand-Tracksaw startet, dann...Achso.Ja, das ist Windows Schutz, wenn man Sachen neu runterlädt.Wenn man Sachen neu runterlädt, dann möchte Windows erst ein paar Mal bestätigt haben,dass es nichts Kritisches ist.Da muss man einfach sagen, ja, ich will es trotzdem laufen lassen.Und dann geht's.Wenn ihr es dann gestartet habt, geht ihr einfach mit einem Browser auf Localhost, Port 5000.Und da ist dann der Versand-Tracker.Nutzt du das englische Tastatur-Layout?Nee.Das ist englische, englische Sprache und deutsche Tastatur-Layout.Ja, da kann man nichts gegen machen.Sobald was neu ist und Windows will erst mal so 50, 60 Statistiken sammeln, ob ein Programm schädlich ist oder nicht.Das Problem hat generell jede Software aktuell.Wenn es eine neue Version gibt, warnt Windows immer, so die ersten ein, zwei Tage davor auszuführen.Aber ihr müsst euch ja nicht runterladen.Ihr könnt euch einfach den Saucecode runterladen und selbst kompilieren.Das ist in Virtual Studio einmal klicken oder mit der.NET-Kommandozeile ein Befehl ausführen.So bei Easy.Kann ich dir meine Kreditkant-Informationen auch so geben?Na klar, immer her damit.Am besten Discord, PN.Was ist da oben eigentlich?Ach so, das ist CSS und das ist C-Sharp.Also es besteht aus 67,9% C-Sharp und aus 32,1% HTML, CSS.Das sieht fast calculated aus, oder?Zwei Drittel, ein Drittel.Amazon, haben wir jetzt Amazon?Hab ich gerade gesagt, Amazon ist noch ein bisschen kaputt.Oh.Ach so, ich hab's wieder ausgemacht.Ich mach's nochmal wieder an.Amazon funktioniert noch nicht.Amazon hatte ich noch nicht Zeit und musste die Amazon-Webseite zu parsen.Aber was lustigerweise ganz gut funktioniert ist, dass sich mittlerweile das Frontend und alles selbst aktualisiert.Man kann das auch ohne Probleme an mehreren Rechnern aufhaben und das kommt sich nicht ins Gehege oder so.Ah, und wenn sowas hier, wenn ihr was dann wegschmeißen wollt, einfach anklicken und auf den Mülleimer, dann ist wieder weg.Ja, so ist das.Funktioniert ja was. Und wie gesagt, die zwei Sachen wären wirklich nice, wenn ihr das testen konntet.Einmal, ob das manuelle tracken funktioniert.Und bei dem anderen, ob das mit dem E-Mail-Scan funktioniert.E-Mail-Postfach gelöscht, ist klar. Ist klar. Debated.Das kann gar kein E-Mail-Postfach löschen, das Ding.Was ist das Tick-Tick? Das ist alle 5 Sekunden das Scannen für Updates.Alter, wie mich der Chechi baitet. Das ist nicht lustig.Weißt du, was das für eine Fehlermeldung bei VmWare-Users, Rapper, GTK, das ist nur ein Warning. Das ist glaube ich nicht schlimm.Das ist so eine typische Linux-Bla-Bla-Fehlermeldung, die man ignorieren kann.E-Mail-Account-Passwort geändert, toll.Was kommt als nächstes? Nacktbilder von einer Freundin auf Instagram geleakt, oder was? Was macht das Programm angeblich als nächstes noch?Ich wollte ja gerade noch fertig zeigen, wie der E-Mail-Scanner funktioniert.Ups, das ist das falsche.Achso, Shingekuro, das ist wirklich eine echte Fehlermeldung.Ich habe doch letztens einen Stream gemacht, wo ich auch Probleme hatte, VmWare-Tools zu installieren. Ich habe es doch dann hingeklickt, nach 20 Minuten oder so.Ich weiß nicht mehr, was da war. Hab einen Fehler gefunden, her damit. Das Ding hat bestimmt noch einige Fehler.Das E-Mail-Scannen ist eigentlich ziemlich simpel. Er holt sich einfach die E-Mails der letzten 5 Minuten, nachdem er initial gescannt hat.Er sortiert die nach Datum oder Uhrzeit und guckt, ob da drin euer Name vorkommt. Das ist das Wichtige, deswegen müsst ihr hier euer Name eintragen.Alle Shops schreiben ja in ihren Versandbestätigungen immerhin, sehr geehrter Herr XY, Ihre Sendung wurde versandt mit DHL und Trackingnummer.Deswegen gucke ich erstmal, ob der Text von der E-Mail euren Namen enthält. Wenn er euren Namen enthält, ist es schon mal gut, dann geht es weiter.Danach guckt er, ob das auf eine DHL Trackingnummer matcht in der E-Mail.Wenn es auf eine DHL Trackingnummer matcht, dann guckt er, ob DHL selbst in der E-Mail vorkommt. Einfach mal so eine random lange Nummer in der E-Mail haben, die aussieht wie eine Trackingnummer, kommt ja öfters vor.Dann generiert er einen neuen Eintrag, wenn er etwas gefunden hat. Bei mir klappt das ziemlich gut mittlerweile, es kommen kaum E-Mails durch, die keine echten Versandbestätigungen sind.Das war der erste Pull-Request am Start. Oder auch nicht? Ach Quatsch, habe ich verklickt.Split-HTML-CSS, ja das machen wir.Was hast du gemacht?Na gut, das passt schon, das wird schon funktionieren. Du musst bloß im HTML gucken, dass es richtig verlinkt ist.Wo ist das HTML? HTML? Ach da, ups.Hast du die neuen Files verlinkt? Im HTML, das sehe ich jetzt nicht.Außer, dass du die Sachen rausgeschmissen hast.Das ist so hässliches HTML-Gefrickel.Hast du Alternate ausprobiert? Nee, habe ich nicht.Also wenn Alternate nur sehr geehrter Kunde in sehr geehrter Kunde schreibt und in der ganzen E-Mail nicht irgendwo dein Name auftaucht, dann funktioniert es wahrscheinlich nicht.Nein, mein, irgendwas muss ich festmachen.Wäre es nicht auch möglich, nach Absand der E-Mail zu prüfen? Ja, doch, doch. Aber wenn sich das als sinnvoll rausstellt, kann man das machen.Die Sache ist bloß die, dass viele Leute eben nicht von DHL direkt die Nachricht kriegen, wenn was unterwegs ist, sondern halt vom Shop.Also kann man alles machen. Das ist jetzt relativ rudimentär gelöst hier mit, er guckt nach Name, er guckt nach Versand und er guckt nach einem Regex von der Nummer.Hat es denn jemand schon ausprobiert jetzt mit dem normalen Tracking, ob das funktioniert bei ihm?Also ich glaube, BeatBrot hat es ausprobiert und der Void Danny hat es ausprobiert.Oder nach Sendungsshipping suchen? Ja, das ist doof. Also kann man machen, wenn sich das als sinnvoll rausstellt.Also die Sendungsshipping, doof, das ist irgendwie sehr sprachenabhängig alles. Am besten wäre es, wenn das gut funktioniert, ohne dass man irgendwelche Sachen übersetzen müsste.Hast du heute frei? Nein, ich bin krankgeschrieben gewesen gestern und heute, weil ich Halsweh habe.Ich habe am Anfang des Streams erzählt und ich nehme jetzt seit gestern so komische lösungsanti-bakterielles Zeug, was er mir verschrieben hat.Und es ist auch schon besser. Also das scheint echt gut zu funktionieren.Alternant schreibt nur sehr geehrter Kunde, Transoflex, nee Transoflex kann es nicht. Also Transoflex kann es nicht.Kann es nicht nach den Tracking-Uhrs checken. Also HTML-E-Mail pars ich nicht. Ich gucke mir nur den reinen Text von der E-Mail an.Und ja, das mit der Tracking-Uhr, das kann man machen. Das muss ich sogar bei Amazon so machen.Ist aber eine gute Idee mit den Tracking-Uhrs. Weil die meisten schicken nämlich direkt einen Link mit. Ich muss mir das mal aufschreiben.Weil die meisten schicken ja nämlich immer direkt einen Link mit, so nach dem Motto, hier können sie ihre Sendung verfolgen.Da könnte man sich mal gucken, wie die Tracking-Uhrs aufgebaut sind. Einfach zusätzlich schauen, so nach dem Motto, enthält das Ding eine Tracking-Nummer,eine Name und DHL oder enthält es einen Tracking-Link von DHL oder sowas in der Richtung.Das muss halt ein bisschen fuzzy sein das Ganze, weil es eben jeder Shop minimal anders macht.Deswegen ist das Ganze auch ein bisschen komplizierter. Kannst du das einmal auf deinem Pi installieren?Ich habe einen Raspberry-Pie-Bild, du kannst das hier ausprobieren. Aber jetzt extra einen Raspberry-Pie anschließen habe ich keinen. Wobei, wartet mal, wo habe ich den? Ich habe doch hier einen liegen irgendwo.Wollen wir das mal kurz auf den Raspberry-Pie drauf machen? Können wir machen, mal gucken. Oh, huge brain Leute, ich habe noch was vergessen. Ich habe noch was vergessen, wisst ihr was mir gerade einfällt?Ich zeige es euch mal, was mir gerade einfällt. Der Lausch plus Local Host, wenn er startet, wenn er startet, wow. Achso, es läuft, nee.Already in use, warum? Achso, weil ich schon laufen habe. Ich kann nur. Der Lausch nur Local Host, der Lausch noch nicht global bei euch auf dem Rechner, aber das war auch Absicht am Anfang.Ich dachte erst, ich bin total bescheuert, aber das habe ich absichtlich erst mal gelassen, dass man nicht irgendwie was komplett, was man gar nicht auf die Idee kommt, was komplett ungetestetes irgendwie den Port aufzumachen.Ja, das fand ich nicht so sinnvoll. Ich meine, es kann eigentlich nichts drinnen sein, was irgendwie gefährlich ist, weil ich meine, da stehen im schlimmsten Fall Versandnummern von einem Paket drinnen.Es gibt sensitivere Infos, aber das muss trotzdem nicht sein für die allererste. Das ist sogar Absicht, dass das nur...Ich will es nicht wissen, wie viele Leute das auf irgendeinem Server installieren. Keine Ahnung, ich finde es erst mal sinnvoll, dass die erste Variante wirklich nur Local Host lauscht, aber ich kann es trotzdem mal auf dem Raspberry installieren.Ich meine, ich kann einfach Ports weiterleiten vom Raspberry, dann ist es ja wie lokal. Können wir machen, also wenn ihr wollt, können wir es ruhig mal auf dem Raspberry installieren.Wenn es auf VM war, müssen wir mal in der Linux VM starten und ich muss meinen Raspberry anschließen. Riem VM anmachen. Wo ist der Switchport?Also was relativ einfach möglich ist, aktuell haben wir hier Raspberry Pi, Linux, normales Linux und Windows. Was relativ einfach möglich ist noch, ist...Also Windows geht alles, also alles ab Windows XP ist das glaube ich so, nee, alles ab Windows 7 geht, jegliches x8664 Linux geht, seit uraltkernel funktioniert einfach, macOS geht und das war's.Also macOS wäre noch relativ simpel hinzuzufügen. Mac, Mac könnte man noch, könnte man noch easy machen.Läuft das auch auf dem Staubsauger? Da ist ein AV7 drinne, ja. Das müsste, das müsste auf dem Staubsauger laufen. Wollen wir mal schauen, ob das auf dem Staubsauger läuft.Einfach mal so just for fun. Wobei da fehlen garantiert irgendwelche Libraries, dass das auf dem Staubsauger läuft. Wir gucken mal, ob es auf dem Staubsauger läuft. Wir probieren es mal aus.Kommen wir mal, ob es auf dem Staubsauger läuft. Ich muss erstmal bei ein Ordner gehen, wo ein bisschen Speicherplatz drauf ist.Ok, wo haben wir hier ein bisschen Speicherplatz auf dem Staubsauger? MNT, used, MNT, data haben wir ein bisschen Platz. M, MK, dear, track store, track store.Ok, downloaden wir es mal. Ups, warum hat er das nicht kopiert? Ich glaube nicht, dass es auf dem Staubsauger läuft, so ohne weiteres, ganz ehrlich. Ih, habe ich das Curl drauf?Dann muss ich es runterladen. Und dann auf den Staubsauger, SCP, auch ok. MK, dear, track store. Was ist mein Staubsauger? MNT, wo muss man hin? MNT, track store.Das SSH vom Staubsauger spackt rum. Mensch, dass ein Staubsauger keinen Weg gehabt hat, das ist schon Sauerei für mich. MNT, data. Oh, die Autovervollständigung über SSH vom Staubsauger ist ja, ist ja huge langsam. Guckt euch das mal an.Das dauert ja ewig. Ok, track store. Ja, das ist autocomplete. Kannste machen, wenn du dein SSH Key auf dem jeweiligen System hast, kannst du Autovervollständigung auch über SSH. So, es kopiert auf den Staubsauger.Na komm, immerhin 2 MB die Sekunde auf den Staubsauger. Für das, dass wir gerade was auf den Staubsauger SCPen, ist die Verbindung noch halbwegs geschwind. Kann man nicht meckern.Ist SCP nicht eh langsam gegenüber SSR? SCP ist ja im Prinzip SSH. Du kannst auch so tun, als statt SCP kannst du einfach SSH nehmen, was reinpipen und dort mit Cat in der Datei umleiten. Kommt aufs gleiche raus.Also ja, wahrscheinlich ist SCP ein bisschen langsamer, weil es auch extra Sachen macht, aber sind wir auch die einfachste Variante was rüber zu kopieren, eigentlich auch die schnellste. So, ok, schauen wir mal.Schauen wir mal, ob es auf dem Staubsauger läuft. Hast du schon viel mit Python gemacht? Zeltchengrenzen? Nicht so wahnsinnig viel. Ok, ist wirklich das Anzip drauf? Oh nee. Alter.XFZV? Nee, äh, Z. Aber das ist Gzip, das ist was anderes.War Extractor da jetzt? Der Extractor hat nicht. Hat er Staubsauger wegen des Abgett? Ja, hat er.Äh, ich glaube, der kann das nicht entzippen. Muss es nochmal löschen. Und ich muss es erstmal, oh, das ist ja doof.Traxor. Traxor. Oh, jetzt moveen wir das da hin, gehen nach Traxor rein und jetzt unzipen wir das, wir müssen die Dateien einzeln übertragen auf den Staubsauger.Warum dann nicht Abgett install, weil ich nix an den Paketen von meinem Staubsauger rumspielen will.Mal gucken, wie schnell das jetzt geht. Oder ob das jetzt 3000, den Strich Minus nicht vergesst, ist eigentlich egal.Du kannst eigentlich machen, tarxfz. Du brauchst eigentlich keinen Minus. Der ist da ja schlau genug.Ok, du kannst unprojentarxfzv und dann irgendwas blub angeben. Dann sagt er, normalerweise hier die Datei ist kein gzip.Das geht, also brauchst du beim tar. Mittlerweile brauchst du keinen Minus mehr. Es geht also.Die Musik ist schlimm, das ist so random. Hast du anderen Vorschlag? Das ist schon übelstes gedudeln, ne?Oh guck mal, er hat es kopiert auf den Staubsauger. Oh, es ist langsam.Ok, schauen wir mal. Plus x versandt traxor. Scheiße, das läuft auf dem Staubsauger.Der kack läuft auf dem Staubsauger. Ach du kacke. Ach du scheiße.Ich hätte gar nicht damit gerechnet, dass das Ding auf dem Staubsauger einfach so startet. Genial. Das läuft auf dem Staubsauger.Der Paket Tracker läuft auf dem Staubsauger. Läuft das auch mit Amazon? Das ist geplant, dass es mit Amazon läuft.Du kannst auch schon Amazon auswählen und eintragen. Allerdings wird dir dann sagen, es ist noch nicht unterstützt.Das mache ich aber im nächsten, nächsten, nächsten. Vielleicht kriege ich das sogar dieses Wochenende noch hin.Ich muss die Amazon-Tracking-Seite pasen, dass das richtig funktioniert. Auf dem Staubsauger.Ok, Leute. Dass wir es ausprobieren können, muss ich es aber nochmal löschen.Dass wir es ausprobieren können, muss ich es aber nochmal löschen und die Url hinzufügen, dass ich von extern drauf zugreifen kann.Oder wir machen irgendeine SSH-Port-Weiterleitung. Oh, das können wir auch machen. Jetzt wird es voll abgedreht, Leute.Also wir starten den Versand-Tracker auf dem Staubsauger. Dann sagen wir SSH minus Local, Port 5000,Weiterleiten auf den Staubsauger, Port 5000 auf dem Staubsauger und jetzt das Ganze auf den Staubsauger redirecten.Mal gucken, ob das funktioniert.Localhost 5000. Funktioniert! Der Versand-Tracker auf dem Staubsauger. Dass das hier Localhost steht, stimmt nicht. Das ist Localhost auf dem Staubsauger. Ich habe es weitergeleitet.Wir sind auf dem Staubsauger, Leute. Gucken wir mal, ob es funktioniert. Aber das wird jetzt crashen oder abkacken oder irgendwas wird passieren,weil, bin ich mal gespannt, weil, das hier oben ist die Ausgabe auf dem Staubsauger, weil der Staubsauger hat keinen Internetzugang.Ach so, Moment. Amazon ist natürlich doof. Amazon liefert Hardcoded zurück, dass Tracking nicht supported ist. Aber seht ihr mal, wie schnell das auf dem Staubsauger läuft?Habt ihr es mal aufgefallen? Das funktioniert richtig, richtig gut. DHL wird er jetzt meckern oder DHL wird er abkacken oder irgendwas wird passieren,weil der Staubsauger keinen Internetzugriff hat. Mal gucken, mal gucken, was passiert. Mal gucken, was passiert, wenn das Ding keinen Internetzugriff hat.Ich meine, abkacken sollte er nicht. Er sollte timeouten nach 5 Minuten oder so und sagen Fehler. Warum lässt du deinen Staubsauger nicht ins Internet? Der muss da rein.Mein Staubsauger ist in extra China. Oh, naja, gut, Namensauflösung geht nicht. Namensauflösung geht nicht. Okay, ja, gut, kann man nichts machen.Namensauflösung geht nicht. Ist okay, er ist im China-WLAN, er darf nirgends wohin. Leute, ganz ehrlich, ich hätte im Leben nicht gedacht, dass mein Programm auf meinem Staubsauger läuft.Das ist doch der Witz. Geil, oder? Was ist das für ein Staubsauger? Das ist ein Xiaomi Roborock S50. Der da. So einer ist das.Man spricht das Xiaomi aus, oder? Also man spricht das garantiert nicht Xiaomi aus. Oder wenn es Chinesisch ist, wahrscheinlich Xiaomi oder irgendwie so. Ich weiß nicht.Aber ich bin echt begeistert. Ich meine, er kann nicht ins Internet, wie man hier sieht, der Staubsauger. Der Staubsauger kann nicht ins Internet, deswegen kann er auch keine DHL-Verbindungsdaten abrufen.Aber guck mal, das komplette Webinterface funktioniert. Anlegen von Sendungen funktioniert, löschen von Sendungen funktioniert. Ich meine, abrufen von Sendungsinformationen funktioniert natürlich nicht, weil der Staubsauger, wie gesagt, nicht ins Internet kann.Aber ihr müsst zugeben, oder? Ihr seid auch ein bisschen überrascht, dass es auf dem Staubsauger läuft, oder? Müsst ihr zugeben.Kitkakashi1990, Dankeschön für den Sub. Gut, dass er nicht ins Netz kann. Ja, das ist absichtlich. Perfekt, zack, erstmal löschen alles, aufs Staubsauger die Sache beenden.Und ich lösche das mal wieder vom Staubsauger, weil das frisst, glaube ich, 124 MB einfach sinnlos auf der 2 GB SSD vom Staubsauger. Ich glaube, wir löschen es mal einfach wieder.Aber es ist echter Wahnsinn, oder? Es ist wirklich sehr nice, dass mein Versandtracker auf dem Staubsauger läuft. Woher kommt eigentlich dieses Anime mit? Meinst du das hier?Oder meinst du das hier? Die kann auch mehr sagen. Die kann auch sagen, Cute Chat zum Beispiel. Oder, also meine persönlichen Lieblingsaussprache ist ja das hier. Das ist immer noch die beste Variante.Ist das normal, dass sich.NET Core fast eine Minute zum Kompilieren gönnt? Tauert das bei dir so lang?Das Initial, es kann sein, wenn es das allererste ist, was du kompilierst, unabhängig vom Projekt, kann das sein, dass es das erste Mal so lange dauert. Aber ansonsten sollte das eigentlich schneller gehen. Können wir mal ausprobieren. Ich kann mal gucken, wie lang es bei mir vor sich hin. Compilesort. Übrigens die falsche App, in der ich gerade bin. Ja, da will ich hin.Ich kann mal gucken, wie schnell das Compilesort bei mir..NET, habe ich überhaupt installiert hier?Minusminusversion. Also.NET, Publish, MinusR, Win, x64, Minusminusselfcontained. Hab ich noch was vergessen?Na ok, ich gebe zu, es kompiliert ganz schön lahm. Also es könnte durchaus schneller sein.Ah, hat auch funktioniert. Ging doch halbwegs schnell. Achso Release Mode sollte ich noch rein machen. Wie ging das? Minus C, Release? Ja guck, die weitere Sachen, die man kompiliert, gehen immer viel schneller.Ja nice. Also Leute, jetzt haben wir ein paar sinnlose Sachen ausprobiert, die meine Software auf dem Staubsauger laufen zu lassen. Hat funktioniert. Sieht man mal, wie portabel der Kram mittlerweile ist.Hat irgendeiner noch ausprobiert? Machst du den Code öffentlich? Der ist öffentlich. Auf GitHub, kannst du den angucken. Da hast du den ganzen Sourcecode drauf und du hast hier unter Release die aktuelle Version.Also ich sag's nochmal, die Windows Version, die es hier gibt, die Win x64, da hab ich den übelsten Noobfehler überhaupt gemacht. Der ist aber super einfach zu fixen.Wenn ihr das runterladet, die Windows Version, wenn ihr die Windows Version runterladet und entpackt, dann kommt dieser Ordner hier raus und da ist ein Link drin und ein Shortcut um das Programm zu starten.Wenn ihr den Shortcut nicht in einen relativen Pfad reingeklatscht habt, sondern einfach einen Shortcut erstellt habt, der auf meinen Pfad hier zeigt. Das ist Fail. Der startet nicht. Sondern ihr müsst hier in diesen Publish Ordner rein und dort die Versandtrack zur Exo starten. Dann klappt das Ganze.Also wer hat's denn jetzt schon ausprobiert? BeatBot hat's schon ausprobiert, ne? Ich bräuchte schon mal ein paar Leute, die zumindest mal die Basic Funktionen ausprobieren. Und wenn die Basic Funktionen tun, dann noch das E-Mail scannen.Also aus nichts probiert, ok.Wo bekomme ich das her? Hier. Ah, auf dem Github Link. Der Eichler. Die Win-64-Zip brauchst du.Das Ding einfach nur DPD geht. Ah, das ist gut zu hören. Packt das Ding einfach nur die verschiedenen Infos zusammen oder kann das mehr? Das, was ein Versandtracker kann, plus, und das ist der Grund, warum ich's gemacht hab, das kann dein E-Mail Postfach durchsuchen nach neuen Trackingnummern.Also es gibt ganz viele Versandtracking-Apps, die sowas hier können, aber was mir halt extrem auf den Sack geht, ist bei den ganzen Versandtracking-Apps, dass du bei allen Versandtracking-Apps das hier machen musst. Funktioniert, getestet. Ah, nice, sogar Unternehmungsgetestet.Bei allen Versandtracking-Apps musst du den Kram manuell hinzufügen. Und bei mir ist es so, du kannst den Kram natürlich manuell hinzufügen oder du gibst deine E-Mail an, gibst dein E-Mail-Postfach an und er durchsucht dein E-Mail-Postfach für dich nach neuen Trackingnummern und trackt die dann.Das ist eigentlich der Grund, warum ich das gemacht hab, weil ich hab keinen Bock, alles, was ich bestelle, von Hand in den Tracker einzubauen. Ich will, dass es das aus den E-Mails selbst rausscannt.Und der nächste Schritt ist, wenn das funktioniert, dann wird... Parcel Track kann das aber auch aus den E-Mails, ich weiß. Parcel Track kannst du allerdings nicht selbst bei dir hosten, sondern musst einem externen Anbieter vertrauen, da wo du keine Ahnung hast, was die machen mit deinen E-Mails.Das ist auch der Grund, Parcel Track ist nicht schlecht, Parcel Track war auch mit oder weniger so ein bisschen die Inspiration dafür, das zu machen, weil ich hab geguckt, was es alles gibt, hab Parcel Track gefunden, hab festgestellt, dass das vom grundsätzlichen her so ist, wie das ich haben will, allerdings manche Sachen haben mir nicht gefallen und dass man es halt nicht selbst betreiben kann, nervt mich.Kann man mehrere E-Mail-Adressen eintragen, aktuell kann man nur eine E-Mail-Adresse eintragen, funktioniert bei mir sehr schön. Hat zufällig schon jemand mit der E-Mail-Funktion probiert?Also aktuell kann man nur eine E-Mail eintragen, funktioniert folgendermaßen, hier gibt es eine Config.Json-Datei, wenn ihr die aufmacht, wo ist mein VS Code?Wie deploye ich das denn? Einfach runterladen, entpacken und starten. Oh, da gibt es eine Config.Json, da kann man eintragen, ich hab's am Anfang schon mal erzählt, aber jetzt sind mehr Leute da, da kann man eintragen, einmal seine Standard-Location, wo man immer Pakete hinschickt, das benutzt ihr, wenn der Paket-Dienstleister beim Zugestellt nichts vermerkt, in welchem Ort das war, dann euer Name, oder es muss nicht euer Name sein, es muss irgendwas sein,von eurem E-Mail-Account, es sollte irgendwas sein, was in E-Mails vorkommt, was einen Shop reinschreibt, in der Regel der Name. Kann Vorname, Nachname sein, nur Nachname ist egal, einfach irgendwas, wo man E-Mails noch mal zusätzlich checken kann, ob die auch an euch sind.So, und hier könnt ihr euren E-Mail-I-Map-Server eintragen, von eurem E-Mail-Anbieter, Passwort und E-Mail-Account, und wenn ihr das dann startet, sucht das Ding eure, die letzten 30 Tage, von eurem E-Mail-Postfach und fügt es automatisch hinzu zum Tracking.DPS-Tracking funktioniert nicht. Warum nicht? Der DPS, was? Was ist denn DPS? Was ist DPD, ne? Gib mir mal die Nummer, warum funktioniert DPD-Tracking? Ich hab hier selbst mal DPD-Pakete drin.Wäre es nicht einfacher gewesen, die C-Sharp-Settings zu benutzen? Doch, wäre es, und ich will auch in Zukunft gar keine Chastain-Settings-Datei mehr haben, sondern einfach hier oben den Settings-Knopf, wo man das über das Web-Interface machen kann.Aber das war jetzt das Einfachste, das hab ich heute Morgen noch auf die Schnelle reingewurstet, die Chastain-Settings-Datei. Die ist auch, die ist wirklich super simple implementiert, und zwar App-Settings.Das macht nichts anderes, als einfach aus dem Verzeichnis, wo es gestartet wurde, die Sachen auszulesen und hier reinzuschreiben. Es ist einfach, dass es geht.E-Mail-Passwort als Klientext in der Taste zu schreiben ist aber ganz schön böse. Ja, das gebe ich dir recht, das ist doof. Aber das ist wie gesagt einfach nur zum Testen, ob es funktioniert.Ich hab da aber auch selbst schon mal ein Passwort reingeschrieben, da kommt ja keiner dran, außer jemand hack-sort euren Rechner.In Zukunft werde ich das so machen, entweder, also ich habe mir zwar zwei Varianten überlegt, wie ich das machen könnte, entweder schreibe ich das mit in die SQLite-Datenbank.Das verschlüsselt zwar nicht, aber ist zumindest nicht auf den ersten Blick so, springt nicht mehr so ins Gesicht.Aber die schönere Variante wäre natürlich, wenn es das mit irgendeinem Key ablegen würde. Und die noch schönere Variante wäre, dass du quasi einmal beim Start von der App irgendwas eingeben musst und dass er das zum Entschlüssel nimmt.Du kannst doch in die Secret-Json speichern. Na gut, die Secrets-Json-Datei wird hier auch nicht mehr Secret, nur weil sie Secrets-Json heißt.Jeder im Zugriff auf den Rechner könnte es trotzdem lesen.Also ich glaube die beste Variante wäre, dass man einmalig einen Key vergibt am Anfang, mit dem man dann die E-Mail-Passworter verschlüsselt lokal und den musst du halt einmalig beim Starten der App im Passwort eingeben.Das ist so wie bei Thunderbird. Wenn du bei Thunderbird Passwörter für E-Mails speicherst, fragt er dich ja auch, willst du das nicht mit einem Masterkey sichern. So werde ich das wahrscheinlich auch machen.Ich mache in der Regel immer das, wo ich selbst am wenigsten Bauchweh mit habe.Nutze dafür dann Argon 2, nö. Ich benutze dafür AES 128 oder AES 268. Irgendetwas, was standardmäßig dabei ist.Irgendwelche eigenen Kryptosachen zu rerollen ist aber ganz bescheuert.Hier eine DPD-Nummer. Okay, soll ich mal ausprobieren, ob es funktioniert?Comment braucht man übrigens nicht, kann man weglassen.Kann ich dir die Tracking-ID irgendwie privat senden? Ja, aber das Problem ist, ich würde es dann hier im Stream ausprobieren, das bringt ja nichts, dann sieht man die Tracking-ID trotzdem.Ich glaube das ist keine so gute Idee.Wenn ich das mit den E-Mails mache, komme ich nicht mal ins Web-Interfere. Ernsthaft? Habe ich irgendwas kaputt gemacht mit den E-Mails vorhin noch?Delivered.Anröchte.Was denn?Leute, wie findet ihr die Truck-Animation? Ich finde den immer noch nice.Achso, du musst neu starten. Du musst neu starten, wenn du in die Conflict-Chasing was eingetragen hast.Ich mag die Animation hier mit dir.Manchmal backt das ein bisschen mit dem LKW, warum auch Aschaffenburg nicht drin steht.Das funktioniert auch manchmal.Manchmal backt der LKW noch ein bisschen.Jetzt kann ich das mit dem E-Mails scanen.Das ist das Web-Interface nicht mehr.Das Web-Interface sollte von Scannen E-Mails aber überhaupt nicht beeinflusst werden.Soweit in der Theorie.Das ist ein eigener Thread fürs E-Mails-Scan.Das probiere ich jetzt mal aus.Ich trage hier jetzt mal einen Mist ein, den es nicht gibt.Dann starten wir das Ganze mal.Schauen wir mal, was passiert.Achso, das gibt es nicht.Ich muss bei irgendeinem E-Mapserver eintragen, den es gibt in GMX.Warum juckt den das überhaupt?Ja, ich weiß warum.Guck mal, Leute.Wobei eigentlich ist es ganz gut, dass der mit einer Exception abkackt.Du musst gucken, ob der X-Wert vom Ende größer ist als der vom Start.Und dann den Truck flippen.Hä, warum?Der Truck ist doch okay.Oder wo spackt der Truck rum?Das sieht doch immer gut aus.Der fährt nicht rückwärts.Oder wo meinst du jetzt?Hab jetzt die Konfig durch die Alterssätze, nun geht es wieder.Das ist doch auch mit Mail.Wenn deine E-Mail-Zugangsdaten stimmen, dann funktioniert es und kackt auch nicht ab.Dass er eine Exception wirft, ist eigentlich okay, wenn das nicht funktioniert.Es wäre bescheuert zu starten und nichts zu sagen.Stellt euch mal vor, da würde starten und nicht irgendwie abkacken mit einer Exception,dass die E-Mail-Adresse nicht stimmt.Dann wirst ja kein Mensch, dass die E-Mail-Adresse falsch ist.Bei mir nicht, okay.Warum geht das mit der E-Mail nicht?Also bei mir mit GMX funktioniert es bei mir.Das doofe ist, ich habe keinen IMAP Server zum Testen hier, wo ich jetzt was eingeben könnte.Hm.Also ich habe es vorhin ausprobiert mit GMX.Also so ungefähr.So müsste das dann aussehen, wenn man es richtig einträgt.Also den IMAP Server eintragen.Machst du schnell einen Google-Trash-Account.Man kann nicht schnell einen Google-Trash-Account machen,weil um mittlerweile um Google-Accounts zu machen, braucht man eine gültige Telefonnummer.Was, Gmail geht nicht?Okay, warte mal.Also wenn er Scanning-Mails sagt, funktioniert das prinzipiell.Er findet vielleicht einfach nichts.Ja, man braucht eine Telefonnummer, um einen Google-Account zu erstellen.Dafür könnt ihr ja mal ausprobieren.Er holt sich tatsächlich die Mails.Ja, der Eichstader funktioniert doch, oder?Findet Amazon.Jo.10-Minute-Mails, haben die IMAP?Haben die IMAP?Die zeigt er nur im Serverlog an, okay.Nee, IMAP bei Google muss einfach funktionieren.Kennt jemand einen Wegwerf IMAP Server?Haben wir ganz oft gefragt.Kennt jemand einen Wegwerf IMAP Server?Flash-Mail-IMAP, gibt es sowas?Das Problem ist,das Problem ist,mit Google-Account kann man nicht so einfach einrichten.Da braucht man eine Telefonnummer mittlerweile.Guck, pass auf.Create First Name.Max Last Name.Username.Omega, null, wupp.Passwort.Ich sag euch das Passwort jetzt nicht.Passwort.Guck, Telefonnummer.Du brauchst mittlerweile bei Google eine Telefonnummer.Das ist übelst räunig.Ach, so meinst du das wie Fitrainerin.Das stimmt, ja.Der Truck hat keinerlei Logik dahinter.Da hast du recht.Jetzt weiß ich was.Ja, das könnte man tatsächlich noch machen.So quasi, wenn das Ziel rechts ist,dann den Truck umdrehen.Optional?Wo steht das, dass das optional ist?Ja, das ist bla.Optional, bla.1, 1990, Gender.Ah, Custom.Ich bin ein...Ich bin eine M2 NVMe SSD.Chat, da dürft ihr nichts drüber sagen.Sonst ist die Anzeige raus.Please refer to me as other.Wie, mehr Auswahl gibt's nicht?Alter, ich muss gleich zum Gleichberechtigungsbeauftragten gehen.Okay, und ihr meint, die E-Mail, das wäre optional, okay?Dann schauen wir mal, ob das Ganze optional ist.Ich mach das Ganze noch mal kurz zurückgängig.Max Wublords.Omega Lul Wub.Wub.Passwort.Oh, Moment.Omega Lul Wub.Next.Phone number, never.Aber wir speichern mal, sonst vergesse ich das noch.Okay, ja, 01, 1990, Gender, Mail.Ich mach mir das mal ein bisschen kürzer.Next.What?Ach so.91, ja, okay.Privacy.Ja.Ja.Ja.Ach, das geht echt jetzt so einfach ohne Telefonnummer mittlerweile?Ich musste das letzte Mal, ich kann mich noch ganz genau dran erinnern, ich musste eine Telefonnummer angeben.Die wollten das dann irgendwie verifizieren.Easy.So einfach funktioniert das.Okay.So, dann tragen wir den Kram jetzt hier mal ein.Äh, ja.Account ist omega lul wub at gmail.com.Passwort verrate ich euch nicht.Server ist, ja, was sind der IMAP Server von Google?Was sind der IMAP Server von gmail?IMAP.IMAP.Ja.IMAP, gmail.Aber jetzt muss ich euch kurz ausmachen und das Passwort eintragen.So.Ups, da hab ich meinen Elgato angeschaltet anstatt mein Display.So, und jetzt gucken wir mal, ob das funktioniert.Scanning Emails.Das sieht, das sieht auch gut aus.So, und jetzt faken wir mal, jetzt faken wir mal eine Amazon E-Mail oder irgendeine E-Mail.Faken wir jetzt mal.Und gucken, ob das, ob er das findet.Okay.Compose.Wieder hat keine Autoverfolgerung Google Mail.Omega lul wub at gmail.com.Subject, keine Ahnung, ihre Bestellung wurde versandt.Jetzt muss ich mir mal eine Sendennummer raussuchen hier.Oh, aber eine DPD, eine DPD Nummer hab ich hier gefunden.Moment.Das Webinterface geht wirklich nicht mehr.Was hab ich da ver...Hä, warum geht das Webinterface nicht mehr, wenn die E-Mails funktionieren?The fuck?Das hab ich doch vorhin ausprobiert.Was soll denn da jetzt bitteschön verkehrt sein dran?MonkaS Smoke.Okay, okay.Mal gucken, mal gucken.Der Background Scanner, den brauchen wir.Ich glaub, ich hab eine Idee, woran das liegt.Ich weiß, woran das liegt.Da dran liegt das.Das ist das letzte, was ich vorhin noch geändert hab.Jetzt geht's.Fail.Okay.Also, Alpha 1 muss ich gleich nochmal neu hochladen.Das ist ganz schön im Arsch, durch diese Einwendungen, die ich noch gemacht hab.Okay, jetzt probieren wir, ob das Ganze funktioniert.Ich lösch mal den Kram, der gerade drin ist.Also, da wissen wir, dass es funktioniert.Jetzt kommt's.Ja, funktioniert.Ja, das ist, wie gesagt, ich hab's ja gerade selbst festgestellt,dass es nicht funktioniert, das Webfront, wenn das E-Mail-Zeug funktioniert.Bei einer Packstation kommt immer Frankfurter Main als Endpunkt.Das liegt daran, weil im... Moment.Ich kann jetzt...Oh Leute, jetzt hätte ich fast die Config aufgemacht.Hätte eben am Passwort gesehen.Weil in der Config musst du deinen Ort eintragen, wo du die Sachen hinschickst.Das Problem ist, da kann ich nichts machen.Manche Versanddienstleister übertragen keinen Standort.Und ich mach's jetzt so, wenn kein Standort beim zugestellt Event drin ist,trägt er den default Standort ein, der in der Config-Datei steht.Rafa1704, Dankeschön für den Sub.Was ist das für Crap-Musik gerade?Piss dich, Alter.Okay, probieren wir mal aus, ob das mit der E-Mail funktioniert.Wenn das funktioniert, lad ich noch mal eine neue Version hoch,wo der Link gefixt ist und wo die E-Mail-Geschichte gefixt ist.Voll verkackt.Okay, der Versand-Tracksor ist auf, machen wir hier, zack.Ihre Bestellung wurde versandt.Versand? Versand.Blablabla, hallo Maximilian Omega-Lull.Ihre Bestellung ist unterwegs.Unterwegs mit DPD.Was weiß ich, Tracking gibt's hier.Okay, jetzt gucken wir mal, ob das funktioniert.Send.Warten wir noch mal 30 Sekunden, bis er die E-Mails scannt.Wir müssen jetzt warten, bis er die E-Mails scannt,um zu wissen, ob es funktioniert.Ah, G-Mail, DPD, bam.Gleich aktualisiert sich das Web-Frontend.Come on, bruh, Web-Frontend.Warum geht das nicht?Alter, ich hab das heute ausprobiert, das geht.Was ist das denn?Er hat's doch sogar erkannt.DPD, G-Mail, er hat's doch erkannt.Okay, das müssen wir jetzt mal ausprobieren, woran das liegt.Hab ich denn hier...Ich hab auf den letzten Drücker wieder Dinger gemacht.Die haben's jetzt kaputt gemacht, wahrscheinlich.Oh, scanne E-Mails.Found, er hat's doch sogar gefunden.Ah, ha, ich weiß, woran es liegt.Es hat alles funktioniert, Leute.Es hat alles funktioniert.Wisst ihr, warum es nicht geht?Wer hat Big Brain und weiß, warum es nicht geht?Es hat alles funktioniert.Wenn die Trackingnummer manuell eingetragen wird, sagt er, gibt's nicht.Und wenn sie aus der E-Mail kommt, zeigt das gar nicht an.Okay, es weiß keiner, warum es nicht funktioniert.Es ist auch klar, woher.Die Sache ist die.Ich lösche, wenn ich Sachen lösche.Ich habe hier oben die Möglichkeit, dass man auf den Papierkorb gehen kann.Und man kriegt die gelöschten Sachen angezeigt.Und wenn wir uns jetzt mal die Datenbank angucken...Ich kann euch zeigen, warum es nicht gibt.Die Tracking gibt's noch.Ja, genau, der Prick, der weiß Bescheid.Das Problem ist, dass in der Datenbank diese Trackingnummer noch drin steht.Äh, guck da.Irgendeine davon, die hier, war das, glaube ich, gerade.Und sobald es die Trackingnummer schon gibt,trackt er die Trackingnummer nicht noch mal.Das will man ja normalerweise auch gar nicht.Also es funktioniert alles.Funktioniert alles.Alles gut.So, und jetzt aber nur um zu zeigen, dass es jetzt auch wirklich funktioniert ist.Oh.Wo ist jetzt das Problem?Willst du mich rollen oder was?Ah.Ähm.So, nur um zu zeigen, dass es auch wirklich funktioniert.Wir nehmen die E-Mail jetzt noch mal und fordern die an uns selber.Und ändern die Trackingnummer.Wo kann man eintreten?Wir ändern die Trackingnummer.Und zwar eine andere Trackingnummer, die ich noch nicht verwendet hab.Dann funktioniert's nämlich auch.Ersatz-Trackingnummer.Flo, was ist denn das?Das ist aber nicht DPD.Das sieht eher nach DHL aus, oder?Mit DHL unterwegs.Send.Okay, also wir warten, bis er wieder die E-Mails abruft.Er sollte zumindest in den E-Mails jetzt checken, dass DPD und DHL drin ist.Aha.Die Hosenlosen-Org.Da ist er.Bäm.Irgendjemand anderes spammt mich voll.Das ist schon im Spam-Ordner gelandet hier wahrscheinlich.Oder wer zum Teufel ist?Die Hosenlosen-Org.Ach so.Ah, cool.Warum fügt der den hier ein?Die DHL-Nummer hat er erkannt.Ist die gleiche?Was?Hier ist eine andere.Hat er die jetzt nicht erkannt oder habe ich die schon mal...Die habe ich auch schon mal verwendet, oder heute?Nee?Hä?Okay, das braucht noch gewisse Optimierungen, so wie es aussieht.Warum hat er die jetzt nicht erkannt?Wir machen jetzt mal was.Wisst ihr was?Scheiß drauf.Wir beenden das nochmal.Wir löschen mal die Tracksaw-Datenbank.Irgendeiner von euch hat es weitergeleitet hier gerade.Info, die Hosenlosen.Wer auch immer das ist.Jetzt ist es grün auf einmal.Ach, guckt hat funktioniert.Die andere wollte ich irgendwie ausgründen.Die Domain einfach noch keine Ahnung.Ich gucke jetzt nicht nach, was da...Von wem ist sie denn?Wir hatten die E-Mail geschickt.Von dir?Ah, nice.Guck, funktioniert alles.Wenn man den ganzen Mist nicht schon vorher drinne hat.Da hat sich die Sachen jetzt aus dem E-Mail-Postfach geholt.Hat hier die Hosenlosen, Neu Ulm.Ja klar, die hatten wir doch vorher auch schon mal drinne.Deswegen hat es nicht funktioniert.Neu Ulm, Aschaffenburg.Irgendwie hat er Probleme mit Aschaffenburg als Marker anzuzeigen.Gmail ist hier drinne und funktioniert.Also das automatische Erkennen aus dem E-Mail-Postfach klappt.Ja, jetzt brauche ich nur noch...Jetzt müssen wir nur noch eine neue Version basteln.Die nicht kaputt ist.Dass es noch ein paar Leute mehr ausprobieren können.Kann man dann auch mehrere E-Mails angeben?Aktuell geht das nicht.Da hatte ich heute Morgen keinen Bock mehr das einzubauen.Aber das brauche ich in Zukunft ein.Dass du mehrere E-Mails angeben kannst.Das ist übrigens absichtlich, dass das weg ist.Weil ich jetzt die Config-Datei aufmache und mein Passwort raus schmeiße, bevor ich es uploade.Big Brain.So.Irgendwann liegt da noch was, ja.Kannst du das Passwort nicht ins Git Ignore machen?Nee, das wäre irgendwie beknackt, weil das Git Ignore muss ja auch kommitten.Okay, ich mache mal...Wir machen mal eine neue Version.Git Status.Oh, habe ich hier überhaupt...Habe ich hier überhaupt mein Zeug drinne?Git Config User Name.Wo bloß? Ja, okay.E-Mail.Wo bloß? Okay.Alles klar, ich habe das Richtige drin.Sehr schön.Habe ich das verpasst?Ja, ich mache jetzt eine neue Version, die die Sachen fixt.Wie die Sachen mit den E-Mails fixt.Du hattest recht, das buggt rum das Web-Interface, wenn man E-Mail-Sachen einschaltet.Deswegen haben wir das jetzt gefixt.Ach so, Redi.Ja, das konnte man tatsächlich machen.Die ist einmalig drinne und danach wird es Ignored.Der Patch ist nicht delayed.Jetzt müssen wir erstmal den Season Pass verkaufen.Okay.Publish.Wir machen mal nur die Windows-Version.Und nun gehen wir mal hier hin.Bin, Release, Headcore, Windows, x64.Machen wir hier den Krempl mal aus.Ist er aus?Und wir starten es mal.Mal gucken, ob es hier funktioniert.Ja, okay, sehr schön.Sehr gut.Dann löschen wir mal den ganzen Crap.Ich muss mir da mal irgendwas Gescheites zum Deployen überlegen.Habe ich jetzt übrigens gerade gelöscht.Das ist übelst verwirrend hier, die ganzen Ordner.Den Publish-Ordner brauchen wir.Publish-Ordner brauchen wir.Und jetzt brauchen wir den Versand-Tracksore.Da machen wir einen neuen Shortcut.Hier oben drüber.Und jetzt müssen wir den Shortcut anpassen.Wie macht man das unter Windows eigentlich?Ich habe das immer im Leben noch nicht.Ich verwende nie Shortcuts unter Windows.Wie macht man das jetzt eigentlich?Target.Kann man da irgendwie relative Pfade angeben?Also irgendwie sowas da?Geht das unter Windows?Kann man nicht?Ja, wie macht man dann überhaupt eine richtige Verknüpfung?Unter Windows, wenn man das nicht relativ machen kann?Gar nicht, oder wie?Das wäre beklagt.Relative Path ShortcutRelative Shortcut Path to ExcelWindows Shortcuts do not use relative path.Was ist denn das für ein Blödsinn?Ja gut, dann machen wir halt keinen.Auch okay.Da muss man halt den Versand-Tracksore hier drinnen starten, den kein Mensch findet.Da müssen wir es so machen, Leute.In Zukunft wird das eh anders gemacht.In Zukunft gibt es das einfach als Single-Exe, die man einfach nur noch starten muss und gut ist.Der nächste Link hat was zu Shortcuts USB.Was? Wo?Was ist das mit USB?Nee, ich mache da kein CMD-Skript oder so.Bist du blind? Da steht nichts mit USB, sonst würde mein Browser das ja finden.Oder auch nicht?Bomsackt.Ach da.Da steht ja auch nichts USB.Ach guck.Ach guck. Geht das also doch?Okay, Versand-Tracksore, Shortcut, zack, zack.Okay, und jetzt?Und jetzt einfach nur so?Nö. Gebaidet. Gebaidet. Funktioniert nicht.Oder muss ich sagen Versand-Tracksore-Exe?Nee.Hä?Kann man hier relativ pass nehmen?Windows kann das nicht. Windows suckt.Übelster Crap. Warum kann Windows kein Relati... Das ist übelster Fail-Crap-Kacke da immer.Warum sollte man auch relative Links brauchen, ja?Relative Links. Warum... Alter, Windows.Wonka-Win.Mal Klima-Alarm kurz anschmeißen.Okay, so. Ich uploade mal die neue Version. Die, die jetzt funktioniert für Windows.Äh, ach so.Ich bin gar nicht eingeloggt.Äh. Sign in.Wo bloß? Äh, Moment. Muss ich mal kurz mein Keypass-Passport aufmachen.Passport save.Github.Zack. Nix geleakt.Alles save.Äh, Versand-Tracksore.Release.Edit.So. Dann schmeißen wir das jetzt weg.Das ist nämlich das Kaputten, ne?Und uploaden das Neue.So. Ich hoffe, der Stream ruckelt nicht dabei jetzt.Wenn der uploadet.Ah, Keypass. Keypass Beste.Äh, ich muss mal gucken, ob ich nicht irgendwelche...Äh, Subs vergessen hab. Wen haben wir denn? Rafa1704.Weiß ich, ob ich nicht vorgelesen hab, aber wenn nicht, Dankeschön für den Sub.Sinom472. Dankeschön.Hitkashii, den hatten wir schon. Softbubble hatten wir auch schon.Reslekt.N Row.Okay, hoffentlich läuft das besser während der Upload funktioniert, während der Uploadläuft. Okay, der Upload ist eh gleich fertig. Was ist denn, wenn in der E-Mail nicht steht,womit das verschickt wird, sondern gleich so ein Tracking-Link geschickt wird? Naja,wenn in dem Tracking-Link selbst nicht der Name des Anbieters vorkommt, dann funktioniertes nicht. Aber ich glaube, es gibt doch kein Tracking-Link, wo nicht DHL, DPD oder so drinnenvorkommt. Also es muss irgendwo in der E-Mail stehen. Es muss gar nicht durch Leerzeichengetrennt sein oder irgendwas. Es muss nur irgendwo in der E-Mail vorkommen, irgendwoim Text von der E-Mail. Der Upload ist wahnsinnig geschwind, ne? Ist dort auch die Tracking-Nummervorhanden? Ja, ich hoffe mal. Also er muss Tracking-Nummer finden und Name vom Versanddienstleisterfinden. Ansonsten wären die False-Positives viel zu hoch. Ansonsten würde er ja jedeE-Mail als Tracking-E-Mail einstufen. Bin ich der Einzige, der in einem Dorf ein 200Emmet Upload hat? 200 Emmet ist nice. Ich habe nächste Woche 400 Down 40 Up. Ich binda gewechselt von der Telekom. Bei Telekom hätte ich 250 Down 100 Up bekommen können,aber Unity Media ist das bessere Gesamtpaket bei mir. Da habe ich gebacken. Come on, brah.Die neue Winners-Version ist am Start. Jetzt mit gefixtem E-Mail abfragen. Jetzt kannich wieder hochstellen. Wer nochmal testen möchte, jetzt bei der neuen Version funktioniertauch das E-Mail-Zeug irgendwie kaputt. Deswegen ist es wichtig, den Kram zu testen. Am bestentestet man den Kram, auch wenn er noch komplett unfertig ist. In der Regel überlebt das dieerste Begegnung mit der Realität nie, was man so gebastelt hat. Nie. Egal, was du machst.Deswegen ist es immer nicht verkehrt, den Kram so früh wie es geht. Sobald es basicFunktionalität hat, den Kram einfach mal von irgendjemanden testen zu lassen, der esnicht selbst programmiert hat oder nicht mit programmiert hat. Ich würde es normalerweisenicht auf einem Twitch-Stream machen. Ich würde es normalerweise mit ein, zwei Leutenmachen, die ich kenne, weil es ist viel einfacher so etwas zu debuggen dann auch vor Ort. Aberjetzt in dem Fall. Ja guck mal, meine Tests sind schon ganz schön ausgereift hier. Ichhabe ein Projekt, das nennt sich Tests und da drinnen gibt es null Tests. So wie beimir auch. Ich würde mal behaupten, dass sie Standard. Außerdem, wozu braucht man Tests,wenn man Write-Line-Debug-Messages hat. Hat wer eine Idee, was das sein könnte, wenn ichbei meinen zwei Monitoren mit Displayport anschließe und dann einen der Monitore kurzausschalte, wieder einschalte, wandert kurz der Desktop komplett von dem einen auf denanderen Bildschirm. Das ist bestimmt irgendein Windows-Crap. Wahrscheinlich, weil bei Windowsder Desktop immer auf dem rechten Bildschirm angezeigt wird oder so. Und wenn das danneinmal switcht, dann checkt das kurz nicht. Das ist wahrscheinlich irgendein typischerWindows-Mist, an dem man nichts ändern kann. Aber Leute, ich bin schon mal echt froh,dass so viele ausprobiert haben. Ich meine, es haben einige mittlerweile den, ich weißnicht, wie viele es jetzt wirklich ausprobiert haben, aber vorneweg 10 Stück, den Kram ausprobiert,dass es überhaupt trackt und ein paar auch, dass die E-Mails kaputt sind, allerdingsdie E-Mails jetzt gehen sollten. Es ist schon mal schön zu wissen, dass es geht. Also beimir findet er nichts. Aber läuft es bei dir jetzt wenigstens? Er findet nichts. Kann manan sich selbst die E-Mails schicken? Ja. Wie alt sind denn die E-Mails? Hast du innerhalbder letzten 30 Tage eine Versandbeschätigung bekommen? Entweder von, wo eine Versandbeschätigungbekommen oder irgendeine Mail bekommen, wo DPD, DHL oder Hermes drinsteht, ohne einegültige Trackingnummer? Der guckt standardmäßig nur die letzten 30 Tage. Das könnte dichauch noch konfigurierbar machen, in welchem Zeitraum er initial scannt. OBS oder Streamlabs,immer das Offizielle. Ich sehe den Sinn nicht davon, den Streamlabs-Ding zu verwenden. Außerdass es ein bisschen schöner vorkonfiguriert ist. Den Portnet kannst du auch noch nichteinstellen. Du kannst noch nichts machen. Du kannst es auch nicht mal komplett globallauschen lassen. Du kannst wirklich nur Basic-Funktionalitäten gerade ausprobieren. Deswegen habe ich heuteauch mal den Stream gemacht dazu. Ich will einfach nur mal gucken, ob das, wisst ihrdas Problem ist? Bei einem selbst kann das wunderbar funktionieren und sobald es jemandanderes ausprobiert, funktioniert es nicht. Deswegen wollte ich einfach mal wissen, obes jetzt auch bei anderen funktioniert als bei mir oder scheint ja der Fall zu sein.Deswegen ist das ja auch 001alpha1. Deine letzte Bestellung ist zwei Monate her. Vorbautedir einfach eine Bestellungs-E-Mail. Vorbaute dir selbst eine Bestellungs-E-Mail. Dann istdie von heute. Aber Leute, ohne Scheiß, dass es auf meinem Staubsauger läuft, ist schonmega geil. Das muss man echt sagen. Das hat mich verdammt überrascht, das hat mich wirklichextrem überrascht, dass ich das Ding auf meinen Staubsauger kopiert habe, gestartet habe undes ging. Es ging einfach. Die DHL-Mail von Mittwoch findet ihr nicht getestet, auch wennaus... Hast du die Config-Datei angepasst und dein Name reingeschrieben oder steht danoch Max drinne in der Config-Datei? Wozu braucht ein Staubsauger ein US? Ja, weil es ein Smart-Staubsaugerist. Wann kommt Minecraft auf den Staubsauger? Ich muss gucken, ob das Ding einen USB-Stickoder eine USB-Festplatte erkennt. Hab ich noch nicht gemacht. Einmal mit Vorname, einmalmit Nachname. Steht... Und in der E-Mail steht auch der Name drin? Komisch. Wie gesagt,ich habe es ja gerade bei mir ausprobiert. Mit Gmail tut das ja. Ich baue für dieseE-Mail-Scan-Sachen noch ein bisschen nützlichere Debug-Ausgaben ein. Erkennt er die E-Maildenn in der Konsole? Hast du das gesehen? Erkennt er in der Konsole? Also kommt das hier?Kommt diese Shipment-Found oder sowas? Aber an sich sollte das funktionieren. Ich habees ja gerade nochmal mit Gmail ausprobiert. Mir fällt halt nichts besseres ein, wie mandas festmachen könnte an den E-Mails. Wie gesagt, aktuell guckt er halt nach. Enthältdas den Regex für eine DHL-Trackingnummer? Er zeigt der Konsole nichts an, hat das Logvon meinem E-Mail-Server offen, die Verbindung wartet, er aufruft die E-Mails ab. Aber imTrack soll er nicht angezeigt werden. Dann matcht irgendwas nicht. Von welchem... Wasist das drinne? Was ist das? DPD, DHL? Ja, Amazon Tracking ist schon vorhanden im GUI,aber Tracking noch nicht. Der sollte, seh was ich nochmal mache. Wir bauen hier nochmaleine Debug-Ausgabe ein, wo das Subject drinne steht von der Mail, dass man sieht, dass erdie Mail abgerufen hat vom Server. Er findet nix. Das ist echt merkwürdig. Hast du zufälligdie Sendungsnummer schon mal von Hand eingefügt davor? Ja, Amazon Tracking baue ich noch.Amazon Tracking will ich ja auch selbst hauptsächlich. Also es ist eines der Gründe, warum ich dasgemacht habe, weil keiner unterstützt richtiges Amazon Tracking. Und Amazon Tracking ist auchkacke. Amazon hat keinerlei AP für ihr Tracking. Du musst komplett dir den Mist aus dem Tracking-Linkaus der HTML-Seite, die generiert wird über den Tracking-Link, musst du dir den Mistrausparsen. Das ist richtiger Crap. Aber Tracking Amazon nicht nur von den APs derTransportdienste. Nee, nee. Amazon hat mittlerweile selbst Amazon Logistics. Die fahren selbstaus. Du verwendest ALL. Wo denn? Was meinste? Vielleicht hat er die Sendungsnummer zweimaldrinne. Wo mache ich was? Scanner found. Ach hier. Jaja, klar, das kann schon sein.Wenn er die schon mal drinne hat, funktioniert es nicht. Deswegen meinte ich ja eben hast,ob die Nummer vorher schon mal hinzugefügt wurde oder so. Dann sollte sie zumindesteinmal im Web-Interface stehen. Also das habe ich absichtlich eingebaut, dass er nichtSachen doppeltrackt. Ähm, finde trotzdem nicht, die Sendungsnummer geht aber. Dannmüssen wir das nächste Mal nochmal ausprobieren, wenn ich ein bisschen mehr Debug-Ausgabeneingebaut habe, dass ich genau sehe, worab er bei dir abkackt. Reptile Hunter, TwitchPrime, Dankeschön. Warte, warte, ob du das... Klar, wenn du das kannst, du kannst das klonenvon GitHub. Du brauchst allerdings, äh, noch, weil, weil, ähm, DotNightcore 3 noch nichtdraußen ist, du brauchst Visual Studio 2019 Preview und du brauchst DotNightcore Preview,DotNightcore 3 Preview. In ein paar Monaten hat sich das erledigt, weil dann ist DotNightcore3 offiziell. Ich weiß gar nicht, wann ist eigentlich DotNightcore 3 Release? ReleaseDate, dauert noch nicht mal lang, ne? Haben die gesagt, wann das kommt? Final? Das istrichtig Bleeding Edge. September, ja, also in einem Monat, in einem Monat, spätestensin einem Monat, braucht man halt diese Preview-Varianten nicht mehr. Aber ich baue noch ein bisschenmehr Debug-Ausgaben ein, dass man das, dass man das besser nachvollziehen kann. Aber,ja, danke fürs Testen schon mal. Also wir haben ja schon viele Sachen gefunden jetzt.Ohje. Habe ich noch nie verwendet, muss man mal ausprobieren. Auf GitHub, äh, achso,warte mal. Achso, äh. Gucken, dass da nichts leake oder so? Ne, habe ich noch nicht. Binauch bescheuert. A-M, was haben wir denn gemacht? Fixed Background Mail Scanning. Broken WebInterweb Frontend Hanging Task. Zack. So schreibt man eine halbwegs ordentliche Comment-Message.Nicht, dass man sie jetzt in der Stelle brauchen würde. Jetzt. Was haben wir da jetzt gemacht?Genau, eigentlich haben wir nur den Mist da rausgeschmissen. Wohohohoho. Hui. Hat sichnicht viel getan. Push, pushen wir das Ganze mal. Geht. Push. Master. Bam. Yes. Ich habemeinen Key hier nicht drinnen. Ok. Dann füge ich mal meinen Key hinzu. Wo ist denn der Keyda? Der Windows. Richtig, wo da der Key leckt. So. Idee. RSA. Pop. Dann füge ich den Kramnochmal kurz im GitHub hinzu. Profile. Profile. SSH-Keys. New SSH-Key. Zack. Ok, mal gucken,ob ich jetzt pushen darf. Ah, ich habe meinen ReadMe noch nicht gepullt. Jetzt kann icheuch mal einen krassen Git-Hexor-Trick anzeigen. Die Sache ist jetzt nämlich die, wenn manjetzt einfach pullt, dann macht er ein ganz super hässliches Merch-Commit. Weil ich lokalein neues Comment habe und niemals ein neues Comment mache. Das sehe ich auf der Arbeittotal oft, dass Leute diese sinnlosen Merch-Commits haben. Merch-Master in Master. Das ist vollfür den Arsch. Brauchen wir nicht. Man gibt einfach an Git-Pull-Origin-Minus-Rebase undes sollte in dem Fall ja keine Konflikte geben und man hat das Problem nicht. Und jetztkann ich das Ganze pushen und alles ist gut. Und wir haben kein sinnloses Merch-Commit erzeugt.Ich habe Fahr-Informatik in System-Integration gelernt. Ja, richtig. So. Jetzt sollte dieneue Variante eigentlich... Ja. Der Code ist oben. Jingle-Kuro. Du kannst... Ja, guckstdem an. Also würde mich interessieren, warum es bei dir rumspackt. Was da nicht passt.Ach so. Haben wir einen Mod am Start? Könnten wir das Git-Ausrufezeichen ändern zu dem neuenTrack-Tractor? Wobei, ich glaube, meine Mods arbeiten noch alle. Kann das sein? Okay,keine Mods. Das hätte ich jetzt mal nicht so laut sagen sollen.Ja, stimmt. Wir machen einfach Ausrufezeichen-Git hier zu Wubblors und dann kann man ja gucken.Ja. Das finde ich eine gute Idee. Ja, also Leute, vielen Dank fürs Testen. Hat schonmal einiges gebracht. Wenn ihr Verbesserungsvorschläge habt, haut es rein. Ihr müsst auch nichtauf Englisch schreiben oder so. Das Projekt juckt eh kein Mensch auf GitHub. Ihr könntdas auf Englisch oder auf Deutsch schreiben, wie ihr wollt. Egal. Der Eichler. Das überlegeich mir. Das ist eigentlich gar keine schlechte Idee. Weil du bist so oft da und bisher istmir auch noch nichts Negatives aufgefallen. Ich glaube, ich mach den Eichler. Ich lassenoch mal durch den Kopf gehen. Aber ich glaube, der Eichler wird neuer Mod. Ich muss mir dasmal durch den Kopf gehen lassen. Weil eigentlich haben wir normalerweise genug Mods da. Wirhaben doch einen Mod da. Max, weißt du, wie das funktioniert mit den Kommands editierenüber den Chat? Könnte man Ausrufezeichen Git auf mein Hauptgit ändern anstatt auf Frisilull?Was verdient man hier als Mod? Ganz viel Cute Chat. Ja, wie gesagt Leute, danke fürs Testen.Eigentlich war es das Inhaltsmäßig schon. Ich wollte eigentlich nur mal ausprobieren,ob es nicht nur bei mir funktioniert, ob es auch woanders funktioniert. Zwei Stundenwaren wir am Start. Neues Video gibt es heute nicht. Morgen gibt es neues Video. Wir gucken,dass ich keine Prime Subs vergessen habe und auch keinen normalen Subs. Den Reptile Hunterhatten wir schon, glaube ich. The Easy Killer. Ich weiß nicht, ob ich das schon vorgelesenhabe, aber wenn nicht, danke schön. Ich habe mir ja überlegt, man müsste so einen BigBrain Overlay machen, der quasi pro Sub immer ein bisschen dicker wird. Also der fängt dannquasi immer so an. Der fängt dann jeden Stream fängt er so an und bei jedem Sub wirder dann so ein Stückchen größer, bis er dann irgendwann so fett ist. Aber der wirdab und zu mal eingeplant, sonst ist es zu nervig. Und was auch eine letztens mal eine geile Ideehat, dass man hier irgendwie so was kleines einblendet, was man irgendwie füttern muss.Und ich will noch überlegen, wie. Ich will es nicht mit Subs und Bits machen, das istzu sellout. Man kann ihn auch mit Chatnachrichten füttern oder so. Irgendwas, was man fütternkann und was dann Dinger tut auf dem Bildschirm. Auf mein Gitterprofil. Auf dasnormale Gitterprofil. Von da kann man weiter gucken. Schau dir mal High an. Wozu, was istdas? Das Projekt läuft schon mal sehr nice. Klappt der Checker auch mit Bestellung vonAmoreli oder Ice.de, wenn die über. Ach okay, jetzt weiß ich was. Ich habe gerade mal nebenbeiein Google Ding so, jetzt weiß ich was das ist. Die Sache ist die, das funktioniertja prinzipiell mit allem, solange es eben DHL, DPD, Hermes oder UPS ist. Oder Amazon.Was wäre deine Maximum Sellout Taktik? Keine Ahnung. Noch keine habe ich mir noch nichtsüberlegt. Für meine Maximum Sellout Taktik wäre, für 200 gegiftete Subs kriegt man Modund für 1000 gegiftete Subs kriegt man ein Custom ASMR Video. Wupplull.Fügt mal meinen Gyros mal hinzu. Hat dein Gyros mal eine Online-AP, wo mantracken kann, wo dein Gyros ist? Das fände ich nämlich eine super nice Idee, aber ichvermute mal hat er nicht. Was Lul, der Follower hat er gefollowed. Somebodytouched my Spaghetti. Ja, es gibt User-Names auf Twitch. Ach komm mal, der Patrick istda. Du Spaß, Alter. Du Vogel, Mann, du Vogel. Ja, und für 100, für 1337 Subs dürft ihrmal auf mein Hightech-Klo gehen. Unabhängig davon, dass man sich für das Geld schon selbstein Hightech-Klo kaufen könnte, aber wer will das nicht? Easy. Ja, Mod-freie Zeit istvorbei. Jetzt sind die Mods am Start. Also Leute, wer es ausprobieren möchte, kannes gerne ausprobieren. Ihr wisst ja, ich habe es euch ja gezeigt, hier unter Release,einfach die aktuelle Windows-Version mal ziehen und ausprobieren. Wer selbst ein bisschendrin rumbasteln will, kann sich das Git repo klonen. Ihr braucht dafür allerdings dasaktuelle Visual Studio 2019 Preview für.NET Core 3 und ein aktuelles.NET Core 3 Preview.Hast du eins mit Sprühwasser? Ja, aber nicht ganz so übertrieben wie die Japaner. Alsoich habe keine Möglichkeit, Sounds abzuspielen oder sowas. Ja, danke schön für die ganzenTests. Ich werde jetzt Schluss machen und noch eine Runde versuchen, ob ich noch malein paar Lobbies finde auf der Xbox in Black Ops 1. Aber das mache ich nicht Onstream,weil Onstream rege ich mich immer mehr auf als Offstream, wenn die Games sucken. Okay,wie fühlt sich das an und wie wird es wieder trocken? Trocken wird es entweder mit einemFöhn, das hat einen Föhn eingebaut. Allerdings finde ich das nicht so geil, das dauert solange. In der Regel wird es einfach trocken mit Klopapier. Warum streamst du nicht Gameplay?Weil heute Programming Stream angesagt war, bzw. Programmed Testing Stream. Wie hartist das Strahlen? Kannst du einstellen in 7 verschiedenen Stufen. Von soft bis hart.Also Bursi, da ist für jeden etwas dabei. Hast du das Klo selbst eingebaut? Nee. Dasist total, für das Klo brauchst du einen Stromanschluss, einen Wasseranschluss undeinen Lüftungsanschluss. Ist nicht etwa so, dass man einfach ein Klo anschließt ans Wasserund gut ist. Strom, Wasser, Luftanzugang braucht der Klo, dass er funktioniert. Lüftung,er hat auch eine Lüftung drin, das stinkt im Klo. Kannst du dein Klo flaschen? Ich weißdas nicht ganz gemeint ist, aber ich habe danach gesucht, ob das möglich ist. Gibtnichts dafür. Der ist leider einen Ticken zu alt. Da sind noch keine 0815 China Microcontrollerdrin, sondern irgendwas von denen selbst gewurstetes. Das beste ist, das Wasser im Klo kann mansogar anwärmen lassen. Ich meine, ihr habt es doch schon mal gesehen. Klo, FPS, wo istes? Ah, da ist es doch. Hier ist noch das Klo. Da ist es. Hier ist die Fernbedienungvom Klo. Die kann man hier unten noch mal ausklappen, da sind dann mehr Optionen nochdrin. Da kann man Föhn einschalten, Lüftung einschalten, Wärme einschalten, Strahlintensitäteinschalten, Strahlwinkel, Abzugsstärke. Und so sieht es dann aus, wenn man den Hinternabgesprüht kriegt. Jaja, ich weiß, ich habe mich gespiegelt. Ich habe mich total verhofftgespiegelt in dem Video. Guck mal hier, da guckt er. Da guckt er raus. Da ist er. Daist er. Genau, Killer Tors. Dafür ist das da. Leider man steht drauf. Okay Leute, ichwar Schluss. Danke fürs Testen. Was kostet so eine Toilette? Ich weiß nicht mehr, wieviel es genau gekostet hat. War nicht ganz billig. Ich gucke mal, ob es irgendetwas gibt,was ich nicht hosten könnte. Leider keiner on. Da stelle ich Follower. Ach, der Cyrusist auch dabei. Wow, wow juckt mich denn so. Ich hoffe, es hat euch gefallen. Wir sehenuns, machts gut, bis denn. Tschüss.", "segments": [{"id": 1, "start": 0.0, "end": 7.0, "text": "Das war's für heute, bis zum nächsten Mal, tschüss, tschüss, tschüss, tschüss, tschüss."}, {"id": 2, "start": 30.0, "end": 35.0, "text": "Das war's für heute, bis zum nächsten Mal, tschüss, tschüss."}, {"id": 3, "start": 60.0, "end": 87.0, "text": "So Leute, ich bin am Start."}, {"id": 4, "start": 87.0, "end": 94.0, "text": "Moin. Moment. Ich höre mich doppelt."}, {"id": 5, "start": 94.0, "end": 99.0, "text": "Ah, ich habe meine Vorschau an. Bescheuert, wenn man seine Vorschau nicht muteet, ne?"}, {"id": 6, "start": 99.0, "end": 103.0, "text": "Und man könnte auch eigentlich sagen, es ist absolutely next level."}, {"id": 7, "start": 103.0, "end": 106.0, "text": "Ja, die Standortanzeigen sind voll für den Arsch. Die stimmen nicht."}, {"id": 8, "start": 106.0, "end": 111.0, "text": "Ich zeige euch aber auch gleich, warum nicht. Das ist nämlich Absicht."}, {"id": 9, "start": 111.0, "end": 120.0, "text": "Weil das sind Tracking-Nummern, die ich hier drin stehen habe, die mir freundlicherweise von Stream-Zuschauern gesponsort wurden,"}, {"id": 10, "start": 120.0, "end": 124.0, "text": "dass ich meine eigene Adresse nicht reinschreiben muss, sobald man die Adresse eh nicht sieht."}, {"id": 11, "start": 124.0, "end": 129.0, "text": "Man sieht ja bloß die Direktion hier an der Stelle."}, {"id": 12, "start": 129.0, "end": 136.0, "text": "Bin ich lauter als sonst? Oder ist mein Ohr heute irgendwie empfindlicher?"}, {"id": 13, "start": 136.0, "end": 141.0, "text": "Ne, ich würde sogar so weit gehen und sagen, ich bin leiser als sonst."}, {"id": 14, "start": 141.0, "end": 145.0, "text": "Ich leise als sonst?"}, {"id": 15, "start": 145.0, "end": 149.0, "text": "Das war eine Lautstärketest. Der ist eigentlich wie immer."}, {"id": 16, "start": 149.0, "end": 152.0, "text": "Ich glaube, mein Ohr ist empfindlicher."}, {"id": 17, "start": 152.0, "end": 156.0, "text": "Das wäre aber auch gut, weil ich habe schon, wie gesagt, seit eineinhalb Wochen Halsweh."}, {"id": 18, "start": 156.0, "end": 165.0, "text": "Und ich war gestern mal beim Doktor und er hat mir was aufgeschrieben zum Hals- und alles sauber abbauen irgendwie."}, {"id": 19, "start": 165.0, "end": 170.0, "text": "Irgendwelche Schleimlösungsdinger."}, {"id": 20, "start": 170.0, "end": 176.0, "text": "Wahrscheinlich löst das wirklich. Deswegen höre ich jetzt auch wieder viel besser."}, {"id": 21, "start": 176.0, "end": 181.0, "text": "Honka Smoke."}, {"id": 22, "start": 181.0, "end": 186.0, "text": "Also, ich zeige euch mal ein bisschen was zu den Leuten, die im Stream dabei waren."}, {"id": 23, "start": 186.0, "end": 193.0, "text": "Die kennen das ja schon."}, {"id": 24, "start": 193.0, "end": 196.0, "text": "Ich brauche ein paar Leute, die es ausprobieren wollen."}, {"id": 25, "start": 196.0, "end": 204.0, "text": "Und zwar, was man als aktuell machen kann, ist, ich zeige euch das Ganze mal."}, {"id": 26, "start": 204.0, "end": 207.0, "text": "Ich warte nochmal kurz, bis der Stream richtig angelaufen ist."}, {"id": 27, "start": 207.0, "end": 211.0, "text": "Twitch hat es ja noch nicht so ganz gecheckt."}, {"id": 28, "start": 211.0, "end": 213.0, "text": "T-Max Electronics."}, {"id": 29, "start": 213.0, "end": 220.0, "text": "Twitch Prime. Dankeschön."}, {"id": 30, "start": 220.0, "end": 233.0, "text": "Ich habe sogar extra eine ReadMe eingebügt mit Screenshots."}, {"id": 31, "start": 233.0, "end": 236.0, "text": "Also, ich erzähle nochmal den Sinn und Zweck dahinter."}, {"id": 32, "start": 236.0, "end": 241.0, "text": "Weil, wie gesagt, Versandtracker-Apps gibt es wie Sand am Meer."}, {"id": 33, "start": 241.0, "end": 244.0, "text": "Allerdings ist meine eine Special-Versandtracker-App."}, {"id": 34, "start": 244.0, "end": 252.0, "text": "Man sieht es hier in der Oberfläche nicht, aber ich kann es euch gleich mal im Backend zeigen."}, {"id": 35, "start": 252.0, "end": 259.0, "text": "Das ist eine Versandtracker-App, die euer E-Mail-Postfach durchsuchen kann nach Tracking-Nummern."}, {"id": 36, "start": 259.0, "end": 261.0, "text": "Und sie dann automatisch trackt."}, {"id": 37, "start": 261.0, "end": 265.0, "text": "Natürlich könnt ihr den Kram auch selbst hinzufügen. Ist kein Ding. Funktioniert."}, {"id": 38, "start": 265.0, "end": 273.0, "text": "Aber das Sinn und Zweck ist, dass eure Sache von alleine trackt."}, {"id": 39, "start": 273.0, "end": 281.0, "text": "We29Corn. Twitch Prime. Dankeschön."}, {"id": 40, "start": 281.0, "end": 284.0, "text": "Das ist keine Android-App. Die App gibt es..."}, {"id": 41, "start": 284.0, "end": 289.0, "text": "Ich nenne das nur App, weil jeder heute, der cool sein will, sein Programm App nennt."}, {"id": 42, "start": 289.0, "end": 291.0, "text": "Das gibt es überhaupt nicht für mobile. Aber es läuft auch."}, {"id": 43, "start": 291.0, "end": 293.0, "text": "Also, du kannst das Frontend auf mobile verwenden."}, {"id": 44, "start": 293.0, "end": 302.0, "text": "Also, aktuell gibt es das Ganze hier für Windows, Linux und für Linux und Raspberry."}, {"id": 45, "start": 302.0, "end": 304.0, "text": "Magst du eine Tracking-Nummer von mir?"}, {"id": 46, "start": 304.0, "end": 306.0, "text": "Erwarte noch ein Paket heute. Ja, gib mal her."}, {"id": 47, "start": 306.0, "end": 308.0, "text": "Was ist es denn?"}, {"id": 48, "start": 308.0, "end": 313.0, "text": "Also, aktuell unterstütze ich..."}, {"id": 49, "start": 313.0, "end": 315.0, "text": "DAL Hermes, DPD UPS."}, {"id": 50, "start": 315.0, "end": 319.0, "text": "Amazon ist fake."}, {"id": 51, "start": 319.0, "end": 321.0, "text": "Zur Zeit. Wenn man Amazon eingibt."}, {"id": 52, "start": 321.0, "end": 327.0, "text": "Ich hatte noch keine Nerven, die Amazon-Webseite zu parsen."}, {"id": 53, "start": 327.0, "end": 331.0, "text": "Die Tracking-Amazon-Seite zu parsen."}, {"id": 54, "start": 331.0, "end": 334.0, "text": "Kein allzu großer Akt, aber es ist nervig."}, {"id": 55, "start": 334.0, "end": 337.0, "text": "Ah, sorry Leute. Amazon. Amazon natürlich."}, {"id": 56, "start": 337.0, "end": 342.0, "text": "Mac OS kann ich ohne Probleme generieren."}, {"id": 57, "start": 342.0, "end": 344.0, "text": "Das ist eine Web-App. Das sind zwei Sachen."}, {"id": 58, "start": 344.0, "end": 346.0, "text": "Das ist eine Web-App. Für das Frontend."}, {"id": 59, "start": 346.0, "end": 351.0, "text": "Das heißt, du kannst es auch ohne Probleme auf dem Tablet benutzen."}, {"id": 60, "start": 351.0, "end": 359.0, "text": "Allerdings das Backend. Also, da wo das alles am Ende drauf läuft."}, {"id": 61, "start": 359.0, "end": 361.0, "text": "Die Verknüpfung GitHub-Release ist kaputt."}, {"id": 62, "start": 361.0, "end": 365.0, "text": "Echt?"}, {"id": 63, "start": 365.0, "end": 368.0, "text": "Ja, das ist das.NET Core."}, {"id": 64, "start": 368.0, "end": 370.0, "text": "Ups. Ups."}, {"id": 65, "start": 370.0, "end": 372.0, "text": "Was macht die Verknüpfung überhaupt da?"}, {"id": 66, "start": 372.0, "end": 377.0, "text": "Die Verknüpfung zeigt bestimmt noch auf meinen Ordner, oder?"}, {"id": 67, "start": 377.0, "end": 381.0, "text": "Egal, du kannst einfach in den Publish-Ordner reingehen und das Ding starten."}, {"id": 68, "start": 381.0, "end": 383.0, "text": "Ich zeige euch das Ganze mal."}, {"id": 69, "start": 383.0, "end": 385.0, "text": "Mac OS kann ich einfach generieren."}, {"id": 70, "start": 385.0, "end": 389.0, "text": "Wie gesagt, ich habe das heute Morgen nur mal fertig gemacht, weil es gammelt bei mir schon ewig rum."}, {"id": 71, "start": 389.0, "end": 398.0, "text": "Und ich habe es jetzt erstmal ein bisschen aufgeräumt und so in den Zustand gebracht, dass man es überhaupt ausprobieren kann."}, {"id": 72, "start": 398.0, "end": 400.0, "text": "Ja. Also, takt. Wir können es mal ausprobieren."}, {"id": 73, "start": 400.0, "end": 401.0, "text": "Geht mal die Nummer. Geht mal die Nummer."}, {"id": 74, "start": 401.0, "end": 405.0, "text": "Dann probieren wir es mal, ob er das tracken kann."}, {"id": 75, "start": 405.0, "end": 407.0, "text": "Ja."}, {"id": 76, "start": 407.0, "end": 413.0, "text": "Bei DHL haben wir noch ein bisschen das Problem, dass ich einen AP-Key habe, der nur für 250 Aufrufe am Tag geht."}, {"id": 77, "start": 413.0, "end": 418.0, "text": "Und das ist wahrscheinlich bei ein paar Leuten die DHL-Abfragen sofort erreicht."}, {"id": 78, "start": 418.0, "end": 419.0, "text": "Dann gibt es einen Fehler."}, {"id": 79, "start": 419.0, "end": 421.0, "text": "Amazon ist fake."}, {"id": 80, "start": 421.0, "end": 426.0, "text": "Wenn ich Amazon etwas eingebe, dann sagt er..."}, {"id": 81, "start": 426.0, "end": 429.0, "text": "Moment, der sollte sich demnächst aktualisieren."}, {"id": 82, "start": 429.0, "end": 433.0, "text": "Amazon-Tracking not supported."}, {"id": 83, "start": 433.0, "end": 436.0, "text": "Jebaited. Ich habe mir gedacht, ich lasse es mal drin stehen, dass es besser aussieht."}, {"id": 84, "start": 436.0, "end": 441.0, "text": "Aber sobald ich Zeit und Musel dazu habe, die Amazon-Tracking-Seite zu passen, dann funktioniert das auch."}, {"id": 85, "start": 441.0, "end": 445.0, "text": "Okay. Gucken wir mal, ob das von Azotuck funktioniert."}, {"id": 86, "start": 445.0, "end": 448.0, "text": "DHL. Nee, was hast du gesagt? DPD ist es."}, {"id": 87, "start": 448.0, "end": 451.0, "text": "Tracking."}, {"id": 88, "start": 451.0, "end": 453.0, "text": "So. DPD."}, {"id": 89, "start": 453.0, "end": 460.0, "text": "Mal gucken, ob es funktioniert. Mal gucken. Jetzt bin ich mal gespannt, ob das klappt."}, {"id": 90, "start": 460.0, "end": 462.0, "text": "Loading. Er loadet ganz schön lange."}, {"id": 91, "start": 462.0, "end": 465.0, "text": "Ha! Delivered. Neu Ulm. Guck da."}, {"id": 92, "start": 465.0, "end": 469.0, "text": "Stimmt das? Azotuck, wohnst du in Neu Ulm?"}, {"id": 93, "start": 469.0, "end": 471.0, "text": "Ich habe etwas aus Aschaffenburg bestellt."}, {"id": 94, "start": 471.0, "end": 473.0, "text": "Und es ist in Neu Ulm angekommen."}, {"id": 95, "start": 473.0, "end": 476.0, "text": "Und richtig, richtig high-end."}, {"id": 96, "start": 476.0, "end": 478.0, "text": "Pull-Request erlaubt. Er wünscht..."}, {"id": 97, "start": 478.0, "end": 480.0, "text": "Im Prinzip schon, aber das ist teilweise so..."}, {"id": 98, "start": 480.0, "end": 482.0, "text": "Also, kannst du gerne machen."}, {"id": 99, "start": 482.0, "end": 484.0, "text": "Aber es ist teilweise sehr hässlich."}, {"id": 100, "start": 484.0, "end": 489.0, "text": "Ich habe es einfach zusammengewurstet, dass es jemand anderes außer ich verwenden kann."}, {"id": 101, "start": 489.0, "end": 491.0, "text": "Die Suche ist noch gar nicht implementiert."}, {"id": 102, "start": 491.0, "end": 493.0, "text": "Die hat einfach nur einen Button."}, {"id": 103, "start": 493.0, "end": 500.0, "text": "Die gelöschten Sachen hier im Papierkorb angucken macht auch noch nichts, wenn man draufklickt."}, {"id": 104, "start": 500.0, "end": 503.0, "text": "Das einzige, was aktuell funktioniert, ist Dark Light Theme und adden."}, {"id": 105, "start": 503.0, "end": 506.0, "text": "Das Wichtigste ist schon mal da."}, {"id": 106, "start": 506.0, "end": 509.0, "text": "So, jetzt gucken wir uns mal die Map an, was der Azotuck bestellt hat."}, {"id": 107, "start": 509.0, "end": 511.0, "text": "Wir sehen... Wow."}, {"id": 108, "start": 511.0, "end": 517.0, "text": "Was ist das?"}, {"id": 109, "start": 517.0, "end": 520.0, "text": "Warum hat er bei Aschaffenburg nichts hingeschrieben?"}, {"id": 110, "start": 520.0, "end": 524.0, "text": "Was ist da kaputt?"}, {"id": 111, "start": 524.0, "end": 526.0, "text": "Warum ist da kein Icon?"}, {"id": 112, "start": 526.0, "end": 528.0, "text": "Das ist schon erster..."}, {"id": 113, "start": 528.0, "end": 529.0, "text": "Das ist immer so."}, {"id": 114, "start": 529.0, "end": 541.0, "text": "Den ersten Kontakt mit der Realität hält das Ganze eh nie stand."}, {"id": 115, "start": 541.0, "end": 543.0, "text": "Ja, macht das Rollspeedport."}, {"id": 116, "start": 543.0, "end": 546.0, "text": "Aktuell ist das Frontend eine riesen HTML-Sattel."}, {"id": 117, "start": 546.0, "end": 548.0, "text": "Ein bisschen kaputt, also man prinzipiell geht es."}, {"id": 118, "start": 548.0, "end": 552.0, "text": "Das ist Aschaffenburg, aber warum ist da kein Icon an der Stelle?"}, {"id": 119, "start": 552.0, "end": 554.0, "text": "Ist wenigstens der LKW gefahren?"}, {"id": 120, "start": 554.0, "end": 556.0, "text": "Habt ihr geguckt, ist der LKW gefahren?"}, {"id": 121, "start": 556.0, "end": 558.0, "text": "Ich hoffe mal, der LKW ist gefahren."}, {"id": 122, "start": 558.0, "end": 560.0, "text": "Wartet mal."}, {"id": 123, "start": 560.0, "end": 562.0, "text": "Ja, okay, der Truck fährt schon mal."}, {"id": 124, "start": 562.0, "end": 564.0, "text": "Das ist schon mal was."}, {"id": 125, "start": 564.0, "end": 566.0, "text": "In welchem Ort erfinde ich deine Unit-Tests?"}, {"id": 126, "start": 566.0, "end": 569.0, "text": "Hier, guck, ich zeig's dir."}, {"id": 127, "start": 569.0, "end": 574.0, "text": "Tests gibt's hier."}, {"id": 128, "start": 574.0, "end": 585.0, "text": "Huge."}, {"id": 129, "start": 585.0, "end": 590.0, "text": "Huge-Tests."}, {"id": 130, "start": 590.0, "end": 594.0, "text": "Das ist ja auf den Street-Maps, ja."}, {"id": 131, "start": 594.0, "end": 597.0, "text": "Also was mich jetzt erstmal interessieren würde ist,"}, {"id": 132, "start": 597.0, "end": 600.0, "text": "ob es bei euch tut, und zwar zwei Sachen."}, {"id": 133, "start": 600.0, "end": 602.0, "text": "Zwei Sachen, ob es bei euch tut."}, {"id": 134, "start": 602.0, "end": 605.0, "text": "Einmal, ob das auf Windows, Linux, vielleicht an einem Raspberry,"}, {"id": 135, "start": 605.0, "end": 607.0, "text": "ob das läuft."}, {"id": 136, "start": 607.0, "end": 610.0, "text": "Das nächste ist, ob ihr was tracken könnt,"}, {"id": 137, "start": 610.0, "end": 613.0, "text": "manuell hinzufügen über das Web-Interface."}, {"id": 138, "start": 613.0, "end": 617.0, "text": "Und danach, das ist ja das Neue, das geht ja schon seit ein paar Wochen."}, {"id": 139, "start": 617.0, "end": 621.0, "text": "Das haben wir ja sogar noch zusammen im Stream gemacht."}, {"id": 140, "start": 621.0, "end": 624.0, "text": "Aber was jetzt neu ist, zeig's euch mal."}, {"id": 141, "start": 624.0, "end": 628.0, "text": "Man kann jetzt, es gibt eine Config-Datei."}, {"id": 142, "start": 628.0, "end": 633.0, "text": "Die liegt hier so rum."}, {"id": 143, "start": 633.0, "end": 635.0, "text": "Die findet ihr da."}, {"id": 144, "start": 635.0, "end": 638.0, "text": "Direkt im Hauptverzeichnis gibt's eine hier drinnen."}, {"id": 145, "start": 638.0, "end": 640.0, "text": "Also besser gesagt, wenn ihr das runterladet,"}, {"id": 146, "start": 640.0, "end": 643.0, "text": "direkt beim Entpacken in dem Verzeichnis."}, {"id": 147, "start": 643.0, "end": 646.0, "text": "So schlecht ist der Code gar nicht, bis aufs HTML."}, {"id": 148, "start": 646.0, "end": 649.0, "text": "Ich bin selbst nicht ganz damit zufrieden."}, {"id": 149, "start": 649.0, "end": 653.0, "text": "Viele Sachen sind einfach so gemacht, dass sie erst mal gehen."}, {"id": 150, "start": 653.0, "end": 656.0, "text": "Und das Frontend ist halt ein riesiges, zusammengewurstetes Ding."}, {"id": 151, "start": 656.0, "end": 659.0, "text": "Ihr findet hier eine Config-Json-Datei."}, {"id": 152, "start": 659.0, "end": 662.0, "text": "Und da könnt ihr eintragen eure Default-Location,"}, {"id": 153, "start": 662.0, "end": 666.0, "text": "die ihr immer nimmt, wenn das Paket auf zugestellt ist"}, {"id": 154, "start": 666.0, "end": 672.0, "text": "und der Zustellungsschritt nicht erfasst ist beim Anbieter."}, {"id": 155, "start": 672.0, "end": 676.0, "text": "DHL und ein paar Anbieter machen das so."}, {"id": 156, "start": 676.0, "end": 679.0, "text": "Die schreiben unterwegs, wo das Paket landet."}, {"id": 157, "start": 679.0, "end": 681.0, "text": "Die schreiben hier unterwegs Zeugs."}, {"id": 158, "start": 681.0, "end": 686.0, "text": "Allerdings, hier, guck mal, DHL zum Beispiel."}, {"id": 159, "start": 686.0, "end": 689.0, "text": "Die schreiben hier, bla, zugestellt, Hannover."}, {"id": 160, "start": 689.0, "end": 691.0, "text": "Die Sendung wurde zugestellt."}, {"id": 161, "start": 691.0, "end": 693.0, "text": "Das ergibt ja keinen Sinn, dass sie in Hannover ist"}, {"id": 162, "start": 693.0, "end": 695.0, "text": "und morgen in Frankfurt."}, {"id": 163, "start": 695.0, "end": 700.0, "text": "Wenn der Zugestelltschritt keine Standortinformation enthält"}, {"id": 164, "start": 700.0, "end": 702.0, "text": "vom Anbieter, wie das bei DHL ist,"}, {"id": 165, "start": 702.0, "end": 706.0, "text": "dann sucht er nach dieser Default-Location von euch,"}, {"id": 166, "start": 706.0, "end": 708.0, "text": "die ihr eingetragen habt."}, {"id": 167, "start": 708.0, "end": 711.0, "text": "Das heißt, es wäre sinnvoll, wenn man hier einfach"}, {"id": 168, "start": 711.0, "end": 714.0, "text": "den Ort einträgt, wo man seine Pakete hin bestellt."}, {"id": 169, "start": 714.0, "end": 718.0, "text": "Ihr könnt im Prinzip wählen, was ihr wollt."}, {"id": 170, "start": 718.0, "end": 722.0, "text": "Das ist wichtig, dass er in den E-Mails erkennt,"}, {"id": 171, "start": 722.0, "end": 725.0, "text": "ob das an euch ist."}, {"id": 172, "start": 725.0, "end": 727.0, "text": "GLS kann ich auch mit reinnehmen,"}, {"id": 173, "start": 727.0, "end": 729.0, "text": "wenn die sich einfach treppen lassen."}, {"id": 174, "start": 729.0, "end": 733.0, "text": "Das erste Verwender hier für das Tracking,"}, {"id": 175, "start": 733.0, "end": 735.0, "text": "das was Sinnvolles dasteht,"}, {"id": 176, "start": 735.0, "end": 739.0, "text": "an der Stelle, wo der Anbieter nichts einträgt."}, {"id": 177, "start": 739.0, "end": 743.0, "text": "Der Name wird beim E-Mails-Scan verwendet."}, {"id": 178, "start": 743.0, "end": 747.0, "text": "Ich zeige euch gleich, wie das mit dem E-Mails-Scan funktioniert."}, {"id": 179, "start": 747.0, "end": 750.0, "text": "Der muss ja irgendwie festmachen,"}, {"id": 180, "start": 750.0, "end": 755.0, "text": "wenn er E-Mails durchsucht,"}, {"id": 181, "start": 755.0, "end": 757.0, "text": "ob das eine E-Mail an euch ist,"}, {"id": 182, "start": 757.0, "end": 761.0, "text": "beziehungsweise ob das ein paar Kriterien erfüllt,"}, {"id": 183, "start": 761.0, "end": 765.0, "text": "dass es überhaupt eine E-Mail von einem Shop ist mit Versandnummer."}, {"id": 184, "start": 765.0, "end": 767.0, "text": "Das ist das nächste Feature."}, {"id": 185, "start": 767.0, "end": 769.0, "text": "Die zwei Sachen wäre schön,"}, {"id": 186, "start": 769.0, "end": 771.0, "text": "wenn sie ein paar Leute finden würden,"}, {"id": 187, "start": 771.0, "end": 773.0, "text": "die das testen können."}, {"id": 188, "start": 773.0, "end": 775.0, "text": "Das erste ist manuell hinzufügen"}, {"id": 189, "start": 775.0, "end": 778.0, "text": "und testen, ob das funktioniert mit dem Tracking."}, {"id": 190, "start": 778.0, "end": 780.0, "text": "Ihr könnt euch den Source Code vorher angucken,"}, {"id": 191, "start": 780.0, "end": 782.0, "text": "ihr könnt es auch selbst übersetzen,"}, {"id": 192, "start": 782.0, "end": 785.0, "text": "wenn ihr denkt, ich habe da einen Keylogger eingebaut."}, {"id": 193, "start": 785.0, "end": 787.0, "text": "Das ist alles offen auf GitHub."}, {"id": 194, "start": 787.0, "end": 790.0, "text": "Da ist kein Keylogger drin."}, {"id": 195, "start": 790.0, "end": 792.0, "text": "Und hier kann man seinen..."}, {"id": 196, "start": 792.0, "end": 795.0, "text": "Ich habe es bisher nur mit GMX getestet."}, {"id": 197, "start": 795.0, "end": 798.0, "text": "Ich würde interessieren, ob das mit anderen funktioniert."}, {"id": 198, "start": 798.0, "end": 800.0, "text": "Schweizer Post..."}, {"id": 199, "start": 800.0, "end": 802.0, "text": "Ihr müsst mal gucken, wenn die eine Tracking-AP haben"}, {"id": 200, "start": 802.0, "end": 804.0, "text": "oder man die einfach parsen kann."}, {"id": 201, "start": 804.0, "end": 807.0, "text": "Und hier kann man"}, {"id": 202, "start": 807.0, "end": 811.0, "text": "den Server von seinem E-Mail-Provider angeben,"}, {"id": 203, "start": 811.0, "end": 814.0, "text": "sein Login und sein Passwort."}, {"id": 204, "start": 814.0, "end": 817.0, "text": "Und dann geht der in das E-Mail-Postfach"}, {"id": 205, "start": 817.0, "end": 819.0, "text": "und guckt, ob er Versandbestätigung findet."}, {"id": 206, "start": 819.0, "end": 821.0, "text": "Das ist der eigentliche Knackpunkt,"}, {"id": 207, "start": 821.0, "end": 823.0, "text": "warum ich das Ding programmiert habe."}, {"id": 208, "start": 823.0, "end": 825.0, "text": "Dann geht er in das E-Mail-Postfach."}, {"id": 209, "start": 825.0, "end": 827.0, "text": "Aktuell geht nur IMAP."}, {"id": 210, "start": 827.0, "end": 830.0, "text": "Ich weiß nicht, wer heute noch POP3 verwendet."}, {"id": 211, "start": 830.0, "end": 833.0, "text": "Dann geht er in das E-Mail-Postfach"}, {"id": 212, "start": 833.0, "end": 839.0, "text": "und scannt initial die letzten 60 Tage"}, {"id": 213, "start": 839.0, "end": 842.0, "text": "nach Versandbestätigung durch."}, {"id": 214, "start": 842.0, "end": 847.0, "text": "Ab dann nur noch ab dem letzten Scan-Zeitpunkt."}, {"id": 215, "start": 847.0, "end": 849.0, "text": "Fügt alles, was er findet,"}, {"id": 216, "start": 849.0, "end": 852.0, "text": "bei euch dann hinzu in den Tracker."}, {"id": 217, "start": 852.0, "end": 854.0, "text": "Und das würde mich interessieren, ob das funktioniert."}, {"id": 218, "start": 854.0, "end": 856.0, "text": "Ich habe es bei mir mit GMX getestet."}, {"id": 219, "start": 856.0, "end": 858.0, "text": "Funktioniert bei mir ohne Probleme."}, {"id": 220, "start": 858.0, "end": 861.0, "text": "Erkennt DHL-Mails, erkennt Amazon-Mails."}, {"id": 221, "start": 861.0, "end": 864.0, "text": "Aber ich weiß halt nicht, wie es mit anderen E-Mail-Anbietern ist."}, {"id": 222, "start": 867.0, "end": 868.0, "text": "Moin, erstmal Kopf vor Mann."}, {"id": 223, "start": 868.0, "end": 869.0, "text": "Wir haben ja Kaffee mit Salz."}, {"id": 224, "start": 869.0, "end": 871.0, "text": "Huge, zwei Monate. Dankeschön."}, {"id": 225, "start": 873.0, "end": 874.0, "text": "Hast du das programmiert, Max?"}, {"id": 226, "start": 874.0, "end": 876.0, "text": "Ja, habe ich."}, {"id": 227, "start": 876.0, "end": 878.0, "text": "Ich habe noch ein paar Problos hier."}, {"id": 228, "start": 880.0, "end": 882.0, "text": "Ich zeige euch mal, wie das mit dem E-Mail-Tracker funktioniert."}, {"id": 229, "start": 882.0, "end": 884.0, "text": "Weil das letzte Mal, welche gefragt haben."}, {"id": 230, "start": 887.0, "end": 889.0, "text": "Das ist eigentlich ziemlich simpel."}, {"id": 231, "start": 889.0, "end": 894.0, "text": "Es gibt hier eine Klasse IMAP-Mail-Scanner."}, {"id": 232, "start": 894.0, "end": 898.0, "text": "Der holt sich aus den Settings"}, {"id": 233, "start": 898.0, "end": 901.0, "text": "den Server raus."}, {"id": 234, "start": 901.0, "end": 903.0, "text": "Also das hier, der holt sich den Server raus."}, {"id": 235, "start": 903.0, "end": 909.0, "text": "Der holt sich den Usernamen und das Passwort für das E-Mail-Postfach raus."}, {"id": 236, "start": 909.0, "end": 911.0, "text": "Dann lockt er sich ein."}, {"id": 237, "start": 911.0, "end": 913.0, "text": "Ich will mal einen Ticken größer."}, {"id": 238, "start": 913.0, "end": 915.0, "text": "Hallo?"}, {"id": 239, "start": 917.0, "end": 918.0, "text": "Nee, da wird es fett."}, {"id": 240, "start": 918.0, "end": 919.0, "text": "Das reicht, so kann man es auch lesen."}, {"id": 241, "start": 919.0, "end": 921.0, "text": "Dann lockt er sich ein im E-Mail-Postfach."}, {"id": 242, "start": 921.0, "end": 925.0, "text": "Ich stelle das Ganze absichtlich mal auf Read-Only."}, {"id": 243, "start": 925.0, "end": 929.0, "text": "Nicht, dass ich irgendwie Bullshit baue und Leute E-Mails lösche oder so."}, {"id": 244, "start": 929.0, "end": 932.0, "text": "Wir wollen ja kein Risiko eingehen."}, {"id": 245, "start": 932.0, "end": 935.0, "text": "Wie gesagt, das ist alles Alpha."}, {"id": 246, "start": 935.0, "end": 938.0, "text": "Bei mir geht nichts kaputt und ich habe es auch programmiert,"}, {"id": 247, "start": 938.0, "end": 940.0, "text": "dass eigentlich nichts kaputt gehen kann."}, {"id": 248, "start": 940.0, "end": 942.0, "text": "Aber ich würde es jetzt nicht unbedingt verwenden,"}, {"id": 249, "start": 942.0, "end": 946.0, "text": "gegen etwas, was wahnsinnig wichtig ist."}, {"id": 250, "start": 946.0, "end": 948.0, "text": "Bis das ein bisschen besser getestet ist."}, {"id": 251, "start": 952.0, "end": 955.0, "text": "Dann holt er sich alle E-Mails,"}, {"id": 252, "start": 955.0, "end": 960.0, "text": "die nach dem Datum von LastScan eingeliefert wurden."}, {"id": 253, "start": 960.0, "end": 963.0, "text": "Also LastScan ist standardmäßig nicht 60, 30 Tage."}, {"id": 254, "start": 963.0, "end": 966.0, "text": "Danach setzt er es auf aktuell minus 5 Minuten,"}, {"id": 255, "start": 966.0, "end": 968.0, "text": "falls er ein bisschen länger zum Verarbeiten braucht."}, {"id": 256, "start": 968.0, "end": 974.0, "text": "Dann sucht er in eurer E-Mail in eurer Inbox nach den Mails der letzten 30 Tage"}, {"id": 257, "start": 974.0, "end": 979.0, "text": "und ordnet die nach dem Datum,"}, {"id": 258, "start": 979.0, "end": 981.0, "text": "falls das irgendwie nicht richtig zurückkommt."}, {"id": 259, "start": 981.0, "end": 988.0, "text": "Und dann passt er die E-Mail durch nach ein paar Requexes."}, {"id": 260, "start": 988.0, "end": 993.0, "text": "Zum Beispiel, so sieht eine DHL-Trackingnummer aus im Requex."}, {"id": 261, "start": 993.0, "end": 995.0, "text": "So sieht eine OPS-Trackingnummer aus."}, {"id": 262, "start": 995.0, "end": 999.0, "text": "So sieht Amazon-Trackingnummer aus, DPD und Hermos."}, {"id": 263, "start": 999.0, "end": 1002.0, "text": "Allerdings ist das nicht ganz so praktisch."}, {"id": 264, "start": 1002.0, "end": 1005.0, "text": "Weil beim Ausführen was nicht geklappt zu haben."}, {"id": 265, "start": 1005.0, "end": 1006.0, "text": "Wahrscheinlich mache ich was falsch."}, {"id": 266, "start": 1006.0, "end": 1007.0, "text": "Oh, Danny, was hast du gemacht?"}, {"id": 267, "start": 1007.0, "end": 1008.0, "text": "Ach so, ja."}, {"id": 268, "start": 1008.0, "end": 1012.0, "text": "Das Windows-Ding hat BeatBroad gerade schon festgestellt."}, {"id": 269, "start": 1012.0, "end": 1013.0, "text": "Habe ich gefailed."}, {"id": 270, "start": 1013.0, "end": 1015.0, "text": "Wir installieren das jetzt gleich."}, {"id": 271, "start": 1015.0, "end": 1018.0, "text": "Wir laden uns das jetzt gleich mal zusammen runter und probieren das aus."}, {"id": 272, "start": 1018.0, "end": 1021.0, "text": "Sehr nett, dass ich euch mal zeigen kann, wie es funktioniert."}, {"id": 273, "start": 1021.0, "end": 1023.0, "text": "Softbubble, Twitch Prime, Dankeschön."}, {"id": 274, "start": 1023.0, "end": 1030.0, "text": "Ich habe den Link verkehrt gemacht hier in der Windows."}, {"id": 275, "start": 1030.0, "end": 1031.0, "text": "Ich habe falsch verlinkt."}, {"id": 276, "start": 1031.0, "end": 1033.0, "text": "Ich habe es verkackt."}, {"id": 277, "start": 1033.0, "end": 1035.0, "text": "Ich will es nicht nochmal hochladen jetzt."}, {"id": 278, "start": 1035.0, "end": 1037.0, "text": "Dann wackelt dann ruckelt der Stream."}, {"id": 279, "start": 1037.0, "end": 1041.0, "text": "Also ihr müsst euch, wenn ihr Windows habt, einfach das hier runterladen."}, {"id": 280, "start": 1041.0, "end": 1048.0, "text": "Den Win64-Zip und dann mal auspacken."}, {"id": 281, "start": 1048.0, "end": 1053.0, "text": "Ich mache mal kurz aus."}, {"id": 282, "start": 1053.0, "end": 1057.0, "text": "Einfach entpacken, das Ganze."}, {"id": 283, "start": 1057.0, "end": 1061.0, "text": "Was entpackt der denn in drei Stunden?"}, {"id": 284, "start": 1061.0, "end": 1064.0, "text": "Ich habe eine NVMe SSD."}, {"id": 285, "start": 1064.0, "end": 1066.0, "text": "Ein 50 MB oder so."}, {"id": 286, "start": 1066.0, "end": 1067.0, "text": "Und da ist ein Link drin."}, {"id": 287, "start": 1067.0, "end": 1070.0, "text": "Damit ist eigentlich gedacht, das Ganze zu starten."}, {"id": 288, "start": 1070.0, "end": 1074.0, "text": "Ich habe den Link kaputt gemacht."}, {"id": 289, "start": 1074.0, "end": 1077.0, "text": "Der Link ist kaputt."}, {"id": 290, "start": 1077.0, "end": 1078.0, "text": "Ich habe gefällt."}, {"id": 291, "start": 1078.0, "end": 1081.0, "text": "Ich habe einen absoluten Link, wie der letzte Kacknoob, reingeschrieben."}, {"id": 292, "start": 1081.0, "end": 1089.0, "text": "Und nachdem es bei euch kein C++ User Stream gibt, funktioniert der Link nicht."}, {"id": 293, "start": 1089.0, "end": 1090.0, "text": "Bei mir funktioniert der Link."}, {"id": 294, "start": 1090.0, "end": 1092.0, "text": "Bei euch funktioniert der Link nicht."}, {"id": 295, "start": 1092.0, "end": 1098.0, "text": "Deswegen müsst ihr in den Publish-Ordner reingehen und dort den Versand-Tracksaw starten."}, {"id": 296, "start": 1098.0, "end": 1101.0, "text": "Wenn ihr den Versand-Tracksaw startet, dann..."}, {"id": 297, "start": 1101.0, "end": 1102.0, "text": "Achso."}, {"id": 298, "start": 1102.0, "end": 1107.0, "text": "Ja, das ist Windows Schutz, wenn man Sachen neu runterlädt."}, {"id": 299, "start": 1107.0, "end": 1111.0, "text": "Wenn man Sachen neu runterlädt, dann möchte Windows erst ein paar Mal bestätigt haben,"}, {"id": 300, "start": 1111.0, "end": 1114.0, "text": "dass es nichts Kritisches ist."}, {"id": 301, "start": 1114.0, "end": 1119.0, "text": "Da muss man einfach sagen, ja, ich will es trotzdem laufen lassen."}, {"id": 302, "start": 1119.0, "end": 1122.0, "text": "Und dann geht's."}, {"id": 303, "start": 1122.0, "end": 1129.0, "text": "Wenn ihr es dann gestartet habt, geht ihr einfach mit einem Browser auf Localhost, Port 5000."}, {"id": 304, "start": 1129.0, "end": 1135.0, "text": "Und da ist dann der Versand-Tracker."}, {"id": 305, "start": 1135.0, "end": 1137.0, "text": "Nutzt du das englische Tastatur-Layout?"}, {"id": 306, "start": 1137.0, "end": 1138.0, "text": "Nee."}, {"id": 307, "start": 1138.0, "end": 1144.0, "text": "Das ist englische, englische Sprache und deutsche Tastatur-Layout."}, {"id": 308, "start": 1144.0, "end": 1146.0, "text": "Ja, da kann man nichts gegen machen."}, {"id": 309, "start": 1146.0, "end": 1156.0, "text": "Sobald was neu ist und Windows will erst mal so 50, 60 Statistiken sammeln, ob ein Programm schädlich ist oder nicht."}, {"id": 310, "start": 1156.0, "end": 1161.0, "text": "Das Problem hat generell jede Software aktuell."}, {"id": 311, "start": 1161.0, "end": 1166.0, "text": "Wenn es eine neue Version gibt, warnt Windows immer, so die ersten ein, zwei Tage davor auszuführen."}, {"id": 312, "start": 1166.0, "end": 1168.0, "text": "Aber ihr müsst euch ja nicht runterladen."}, {"id": 313, "start": 1168.0, "end": 1174.0, "text": "Ihr könnt euch einfach den Saucecode runterladen und selbst kompilieren."}, {"id": 314, "start": 1174.0, "end": 1179.0, "text": "Das ist in Virtual Studio einmal klicken oder mit der.NET-Kommandozeile ein Befehl ausführen."}, {"id": 315, "start": 1179.0, "end": 1185.0, "text": "So bei Easy."}, {"id": 316, "start": 1185.0, "end": 1187.0, "text": "Kann ich dir meine Kreditkant-Informationen auch so geben?"}, {"id": 317, "start": 1187.0, "end": 1188.0, "text": "Na klar, immer her damit."}, {"id": 318, "start": 1188.0, "end": 1191.0, "text": "Am besten Discord, PN."}, {"id": 319, "start": 1191.0, "end": 1192.0, "text": "Was ist da oben eigentlich?"}, {"id": 320, "start": 1192.0, "end": 1197.0, "text": "Ach so, das ist CSS und das ist C-Sharp."}, {"id": 321, "start": 1197.0, "end": 1209.0, "text": "Also es besteht aus 67,9% C-Sharp und aus 32,1% HTML, CSS."}, {"id": 322, "start": 1209.0, "end": 1213.0, "text": "Das sieht fast calculated aus, oder?"}, {"id": 323, "start": 1213.0, "end": 1217.0, "text": "Zwei Drittel, ein Drittel."}, {"id": 324, "start": 1217.0, "end": 1219.0, "text": "Amazon, haben wir jetzt Amazon?"}, {"id": 325, "start": 1219.0, "end": 1222.0, "text": "Hab ich gerade gesagt, Amazon ist noch ein bisschen kaputt."}, {"id": 326, "start": 1222.0, "end": 1226.0, "text": "Oh."}, {"id": 327, "start": 1226.0, "end": 1230.0, "text": "Ach so, ich hab's wieder ausgemacht."}, {"id": 328, "start": 1230.0, "end": 1236.0, "text": "Ich mach's nochmal wieder an."}, {"id": 329, "start": 1236.0, "end": 1238.0, "text": "Amazon funktioniert noch nicht."}, {"id": 330, "start": 1238.0, "end": 1244.0, "text": "Amazon hatte ich noch nicht Zeit und musste die Amazon-Webseite zu parsen."}, {"id": 331, "start": 1244.0, "end": 1250.0, "text": "Aber was lustigerweise ganz gut funktioniert ist, dass sich mittlerweile das Frontend und alles selbst aktualisiert."}, {"id": 332, "start": 1250.0, "end": 1257.0, "text": "Man kann das auch ohne Probleme an mehreren Rechnern aufhaben und das kommt sich nicht ins Gehege oder so."}, {"id": 333, "start": 1257.0, "end": 1275.0, "text": "Ah, und wenn sowas hier, wenn ihr was dann wegschmeißen wollt, einfach anklicken und auf den Mülleimer, dann ist wieder weg."}, {"id": 334, "start": 1275.0, "end": 1276.0, "text": "Ja, so ist das."}, {"id": 335, "start": 1276.0, "end": 1282.0, "text": "Funktioniert ja was. Und wie gesagt, die zwei Sachen wären wirklich nice, wenn ihr das testen konntet."}, {"id": 336, "start": 1282.0, "end": 1288.0, "text": "Einmal, ob das manuelle tracken funktioniert."}, {"id": 337, "start": 1288.0, "end": 1292.0, "text": "Und bei dem anderen, ob das mit dem E-Mail-Scan funktioniert."}, {"id": 338, "start": 1292.0, "end": 1298.0, "text": "E-Mail-Postfach gelöscht, ist klar. Ist klar. Debated."}, {"id": 339, "start": 1298.0, "end": 1307.0, "text": "Das kann gar kein E-Mail-Postfach löschen, das Ding."}, {"id": 340, "start": 1307.0, "end": 1324.0, "text": "Was ist das Tick-Tick? Das ist alle 5 Sekunden das Scannen für Updates."}, {"id": 341, "start": 1324.0, "end": 1340.0, "text": "Alter, wie mich der Chechi baitet. Das ist nicht lustig."}, {"id": 342, "start": 1340.0, "end": 1354.0, "text": "Weißt du, was das für eine Fehlermeldung bei VmWare-Users, Rapper, GTK, das ist nur ein Warning. Das ist glaube ich nicht schlimm."}, {"id": 343, "start": 1354.0, "end": 1359.0, "text": "Das ist so eine typische Linux-Bla-Bla-Fehlermeldung, die man ignorieren kann."}, {"id": 344, "start": 1359.0, "end": 1361.0, "text": "E-Mail-Account-Passwort geändert, toll."}, {"id": 345, "start": 1361.0, "end": 1385.0, "text": "Was kommt als nächstes? Nacktbilder von einer Freundin auf Instagram geleakt, oder was? Was macht das Programm angeblich als nächstes noch?"}, {"id": 346, "start": 1385.0, "end": 1400.0, "text": "Ich wollte ja gerade noch fertig zeigen, wie der E-Mail-Scanner funktioniert."}, {"id": 347, "start": 1400.0, "end": 1415.0, "text": "Ups, das ist das falsche."}, {"id": 348, "start": 1415.0, "end": 1423.0, "text": "Achso, Shingekuro, das ist wirklich eine echte Fehlermeldung."}, {"id": 349, "start": 1423.0, "end": 1432.0, "text": "Ich habe doch letztens einen Stream gemacht, wo ich auch Probleme hatte, VmWare-Tools zu installieren. Ich habe es doch dann hingeklickt, nach 20 Minuten oder so."}, {"id": 350, "start": 1432.0, "end": 1439.0, "text": "Ich weiß nicht mehr, was da war. Hab einen Fehler gefunden, her damit. Das Ding hat bestimmt noch einige Fehler."}, {"id": 351, "start": 1439.0, "end": 1448.0, "text": "Das E-Mail-Scannen ist eigentlich ziemlich simpel. Er holt sich einfach die E-Mails der letzten 5 Minuten, nachdem er initial gescannt hat."}, {"id": 352, "start": 1448.0, "end": 1457.0, "text": "Er sortiert die nach Datum oder Uhrzeit und guckt, ob da drin euer Name vorkommt. Das ist das Wichtige, deswegen müsst ihr hier euer Name eintragen."}, {"id": 353, "start": 1457.0, "end": 1481.0, "text": "Alle Shops schreiben ja in ihren Versandbestätigungen immerhin, sehr geehrter Herr XY, Ihre Sendung wurde versandt mit DHL und Trackingnummer."}, {"id": 354, "start": 1481.0, "end": 1489.0, "text": "Deswegen gucke ich erstmal, ob der Text von der E-Mail euren Namen enthält. Wenn er euren Namen enthält, ist es schon mal gut, dann geht es weiter."}, {"id": 355, "start": 1489.0, "end": 1497.0, "text": "Danach guckt er, ob das auf eine DHL Trackingnummer matcht in der E-Mail."}, {"id": 356, "start": 1497.0, "end": 1512.0, "text": "Wenn es auf eine DHL Trackingnummer matcht, dann guckt er, ob DHL selbst in der E-Mail vorkommt. Einfach mal so eine random lange Nummer in der E-Mail haben, die aussieht wie eine Trackingnummer, kommt ja öfters vor."}, {"id": 357, "start": 1512.0, "end": 1533.0, "text": "Dann generiert er einen neuen Eintrag, wenn er etwas gefunden hat. Bei mir klappt das ziemlich gut mittlerweile, es kommen kaum E-Mails durch, die keine echten Versandbestätigungen sind."}, {"id": 358, "start": 1543.0, "end": 1550.0, "text": "Das war der erste Pull-Request am Start. Oder auch nicht? Ach Quatsch, habe ich verklickt."}, {"id": 359, "start": 1550.0, "end": 1560.0, "text": "Split-HTML-CSS, ja das machen wir."}, {"id": 360, "start": 1560.0, "end": 1564.0, "text": "Was hast du gemacht?"}, {"id": 361, "start": 1564.0, "end": 1582.0, "text": "Na gut, das passt schon, das wird schon funktionieren. Du musst bloß im HTML gucken, dass es richtig verlinkt ist."}, {"id": 362, "start": 1582.0, "end": 1592.0, "text": "Wo ist das HTML? HTML? Ach da, ups."}, {"id": 363, "start": 1592.0, "end": 1598.0, "text": "Hast du die neuen Files verlinkt? Im HTML, das sehe ich jetzt nicht."}, {"id": 364, "start": 1598.0, "end": 1605.0, "text": "Außer, dass du die Sachen rausgeschmissen hast."}, {"id": 365, "start": 1605.0, "end": 1611.0, "text": "Das ist so hässliches HTML-Gefrickel."}, {"id": 366, "start": 1611.0, "end": 1620.0, "text": "Hast du Alternate ausprobiert? Nee, habe ich nicht."}, {"id": 367, "start": 1620.0, "end": 1630.0, "text": "Also wenn Alternate nur sehr geehrter Kunde in sehr geehrter Kunde schreibt und in der ganzen E-Mail nicht irgendwo dein Name auftaucht, dann funktioniert es wahrscheinlich nicht."}, {"id": 368, "start": 1630.0, "end": 1634.0, "text": "Nein, mein, irgendwas muss ich festmachen."}, {"id": 369, "start": 1634.0, "end": 1643.0, "text": "Wäre es nicht auch möglich, nach Absand der E-Mail zu prüfen? Ja, doch, doch. Aber wenn sich das als sinnvoll rausstellt, kann man das machen."}, {"id": 370, "start": 1643.0, "end": 1662.0, "text": "Die Sache ist bloß die, dass viele Leute eben nicht von DHL direkt die Nachricht kriegen, wenn was unterwegs ist, sondern halt vom Shop."}, {"id": 371, "start": 1662.0, "end": 1673.0, "text": "Also kann man alles machen. Das ist jetzt relativ rudimentär gelöst hier mit, er guckt nach Name, er guckt nach Versand und er guckt nach einem Regex von der Nummer."}, {"id": 372, "start": 1673.0, "end": 1682.0, "text": "Hat es denn jemand schon ausprobiert jetzt mit dem normalen Tracking, ob das funktioniert bei ihm?"}, {"id": 373, "start": 1682.0, "end": 1693.0, "text": "Also ich glaube, BeatBrot hat es ausprobiert und der Void Danny hat es ausprobiert."}, {"id": 374, "start": 1693.0, "end": 1700.0, "text": "Oder nach Sendungsshipping suchen? Ja, das ist doof. Also kann man machen, wenn sich das als sinnvoll rausstellt."}, {"id": 375, "start": 1700.0, "end": 1716.0, "text": "Also die Sendungsshipping, doof, das ist irgendwie sehr sprachenabhängig alles. Am besten wäre es, wenn das gut funktioniert, ohne dass man irgendwelche Sachen übersetzen müsste."}, {"id": 376, "start": 1716.0, "end": 1723.0, "text": "Hast du heute frei? Nein, ich bin krankgeschrieben gewesen gestern und heute, weil ich Halsweh habe."}, {"id": 377, "start": 1723.0, "end": 1733.0, "text": "Ich habe am Anfang des Streams erzählt und ich nehme jetzt seit gestern so komische lösungsanti-bakterielles Zeug, was er mir verschrieben hat."}, {"id": 378, "start": 1733.0, "end": 1738.0, "text": "Und es ist auch schon besser. Also das scheint echt gut zu funktionieren."}, {"id": 379, "start": 1738.0, "end": 1751.0, "text": "Alternant schreibt nur sehr geehrter Kunde, Transoflex, nee Transoflex kann es nicht. Also Transoflex kann es nicht."}, {"id": 380, "start": 1751.0, "end": 1760.0, "text": "Kann es nicht nach den Tracking-Uhrs checken. Also HTML-E-Mail pars ich nicht. Ich gucke mir nur den reinen Text von der E-Mail an."}, {"id": 381, "start": 1760.0, "end": 1771.0, "text": "Und ja, das mit der Tracking-Uhr, das kann man machen. Das muss ich sogar bei Amazon so machen."}, {"id": 382, "start": 1771.0, "end": 1781.0, "text": "Ist aber eine gute Idee mit den Tracking-Uhrs. Weil die meisten schicken nämlich direkt einen Link mit. Ich muss mir das mal aufschreiben."}, {"id": 383, "start": 1781.0, "end": 1785.0, "text": "Weil die meisten schicken ja nämlich immer direkt einen Link mit, so nach dem Motto, hier können sie ihre Sendung verfolgen."}, {"id": 384, "start": 1785.0, "end": 1793.0, "text": "Da könnte man sich mal gucken, wie die Tracking-Uhrs aufgebaut sind. Einfach zusätzlich schauen, so nach dem Motto, enthält das Ding eine Tracking-Nummer,"}, {"id": 385, "start": 1793.0, "end": 1801.0, "text": "eine Name und DHL oder enthält es einen Tracking-Link von DHL oder sowas in der Richtung."}, {"id": 386, "start": 1801.0, "end": 1809.0, "text": "Das muss halt ein bisschen fuzzy sein das Ganze, weil es eben jeder Shop minimal anders macht."}, {"id": 387, "start": 1809.0, "end": 1823.0, "text": "Deswegen ist das Ganze auch ein bisschen komplizierter. Kannst du das einmal auf deinem Pi installieren?"}, {"id": 388, "start": 1823.0, "end": 1839.0, "text": "Ich habe einen Raspberry-Pie-Bild, du kannst das hier ausprobieren. Aber jetzt extra einen Raspberry-Pie anschließen habe ich keinen. Wobei, wartet mal, wo habe ich den? Ich habe doch hier einen liegen irgendwo."}, {"id": 389, "start": 1839.0, "end": 1853.0, "text": "Wollen wir das mal kurz auf den Raspberry-Pie drauf machen? Können wir machen, mal gucken. Oh, huge brain Leute, ich habe noch was vergessen. Ich habe noch was vergessen, wisst ihr was mir gerade einfällt?"}, {"id": 390, "start": 1853.0, "end": 1873.0, "text": "Ich zeige es euch mal, was mir gerade einfällt. Der Lausch plus Local Host, wenn er startet, wenn er startet, wow. Achso, es läuft, nee."}, {"id": 391, "start": 1873.0, "end": 1887.0, "text": "Already in use, warum? Achso, weil ich schon laufen habe. Ich kann nur. Der Lausch nur Local Host, der Lausch noch nicht global bei euch auf dem Rechner, aber das war auch Absicht am Anfang."}, {"id": 392, "start": 1887.0, "end": 1903.0, "text": "Ich dachte erst, ich bin total bescheuert, aber das habe ich absichtlich erst mal gelassen, dass man nicht irgendwie was komplett, was man gar nicht auf die Idee kommt, was komplett ungetestetes irgendwie den Port aufzumachen."}, {"id": 393, "start": 1903.0, "end": 1917.0, "text": "Ja, das fand ich nicht so sinnvoll. Ich meine, es kann eigentlich nichts drinnen sein, was irgendwie gefährlich ist, weil ich meine, da stehen im schlimmsten Fall Versandnummern von einem Paket drinnen."}, {"id": 394, "start": 1917.0, "end": 1929.0, "text": "Es gibt sensitivere Infos, aber das muss trotzdem nicht sein für die allererste. Das ist sogar Absicht, dass das nur..."}, {"id": 395, "start": 1929.0, "end": 1939.0, "text": "Ich will es nicht wissen, wie viele Leute das auf irgendeinem Server installieren. Keine Ahnung, ich finde es erst mal sinnvoll, dass die erste Variante wirklich nur Local Host lauscht, aber ich kann es trotzdem mal auf dem Raspberry installieren."}, {"id": 396, "start": 1939.0, "end": 1947.0, "text": "Ich meine, ich kann einfach Ports weiterleiten vom Raspberry, dann ist es ja wie lokal. Können wir machen, also wenn ihr wollt, können wir es ruhig mal auf dem Raspberry installieren."}, {"id": 397, "start": 1947.0, "end": 1961.0, "text": "Wenn es auf VM war, müssen wir mal in der Linux VM starten und ich muss meinen Raspberry anschließen. Riem VM anmachen. Wo ist der Switchport?"}, {"id": 398, "start": 1961.0, "end": 1980.0, "text": "Also was relativ einfach möglich ist, aktuell haben wir hier Raspberry Pi, Linux, normales Linux und Windows. Was relativ einfach möglich ist noch, ist..."}, {"id": 399, "start": 1980.0, "end": 2001.0, "text": "Also Windows geht alles, also alles ab Windows XP ist das glaube ich so, nee, alles ab Windows 7 geht, jegliches x8664 Linux geht, seit uraltkernel funktioniert einfach, macOS geht und das war's."}, {"id": 400, "start": 2001.0, "end": 2014.0, "text": "Also macOS wäre noch relativ simpel hinzuzufügen. Mac, Mac könnte man noch, könnte man noch easy machen."}, {"id": 401, "start": 2014.0, "end": 2035.0, "text": "Läuft das auch auf dem Staubsauger? Da ist ein AV7 drinne, ja. Das müsste, das müsste auf dem Staubsauger laufen. Wollen wir mal schauen, ob das auf dem Staubsauger läuft."}, {"id": 402, "start": 2035.0, "end": 2055.0, "text": "Einfach mal so just for fun. Wobei da fehlen garantiert irgendwelche Libraries, dass das auf dem Staubsauger läuft. Wir gucken mal, ob es auf dem Staubsauger läuft. Wir probieren es mal aus."}, {"id": 403, "start": 2055.0, "end": 2069.0, "text": "Kommen wir mal, ob es auf dem Staubsauger läuft. Ich muss erstmal bei ein Ordner gehen, wo ein bisschen Speicherplatz drauf ist."}, {"id": 404, "start": 2069.0, "end": 2086.0, "text": "Ok, wo haben wir hier ein bisschen Speicherplatz auf dem Staubsauger? MNT, used, MNT, data haben wir ein bisschen Platz. M, MK, dear, track store, track store."}, {"id": 405, "start": 2086.0, "end": 2100.0, "text": "Ok, downloaden wir es mal. Ups, warum hat er das nicht kopiert? Ich glaube nicht, dass es auf dem Staubsauger läuft, so ohne weiteres, ganz ehrlich. Ih, habe ich das Curl drauf?"}, {"id": 406, "start": 2100.0, "end": 2125.0, "text": "Dann muss ich es runterladen. Und dann auf den Staubsauger, SCP, auch ok. MK, dear, track store. Was ist mein Staubsauger? MNT, wo muss man hin? MNT, track store."}, {"id": 407, "start": 2125.0, "end": 2147.0, "text": "Das SSH vom Staubsauger spackt rum. Mensch, dass ein Staubsauger keinen Weg gehabt hat, das ist schon Sauerei für mich. MNT, data. Oh, die Autovervollständigung über SSH vom Staubsauger ist ja, ist ja huge langsam. Guckt euch das mal an."}, {"id": 408, "start": 2147.0, "end": 2167.0, "text": "Das dauert ja ewig. Ok, track store. Ja, das ist autocomplete. Kannste machen, wenn du dein SSH Key auf dem jeweiligen System hast, kannst du Autovervollständigung auch über SSH. So, es kopiert auf den Staubsauger."}, {"id": 409, "start": 2167.0, "end": 2182.0, "text": "Na komm, immerhin 2 MB die Sekunde auf den Staubsauger. Für das, dass wir gerade was auf den Staubsauger SCPen, ist die Verbindung noch halbwegs geschwind. Kann man nicht meckern."}, {"id": 410, "start": 2182.0, "end": 2200.0, "text": "Ist SCP nicht eh langsam gegenüber SSR? SCP ist ja im Prinzip SSH. Du kannst auch so tun, als statt SCP kannst du einfach SSH nehmen, was reinpipen und dort mit Cat in der Datei umleiten. Kommt aufs gleiche raus."}, {"id": 411, "start": 2200.0, "end": 2214.0, "text": "Also ja, wahrscheinlich ist SCP ein bisschen langsamer, weil es auch extra Sachen macht, aber sind wir auch die einfachste Variante was rüber zu kopieren, eigentlich auch die schnellste. So, ok, schauen wir mal."}, {"id": 412, "start": 2214.0, "end": 2230.0, "text": "Schauen wir mal, ob es auf dem Staubsauger läuft. Hast du schon viel mit Python gemacht? Zeltchengrenzen? Nicht so wahnsinnig viel. Ok, ist wirklich das Anzip drauf? Oh nee. Alter."}, {"id": 413, "start": 2230.0, "end": 2244.0, "text": "XFZV? Nee, äh, Z. Aber das ist Gzip, das ist was anderes."}, {"id": 414, "start": 2244.0, "end": 2267.0, "text": "War Extractor da jetzt? Der Extractor hat nicht. Hat er Staubsauger wegen des Abgett? Ja, hat er."}, {"id": 415, "start": 2267.0, "end": 2277.0, "text": "Äh, ich glaube, der kann das nicht entzippen. Muss es nochmal löschen. Und ich muss es erstmal, oh, das ist ja doof."}, {"id": 416, "start": 2277.0, "end": 2293.0, "text": "Traxor. Traxor. Oh, jetzt moveen wir das da hin, gehen nach Traxor rein und jetzt unzipen wir das, wir müssen die Dateien einzeln übertragen auf den Staubsauger."}, {"id": 417, "start": 2293.0, "end": 2313.0, "text": "Warum dann nicht Abgett install, weil ich nix an den Paketen von meinem Staubsauger rumspielen will."}, {"id": 418, "start": 2313.0, "end": 2326.0, "text": "Mal gucken, wie schnell das jetzt geht. Oder ob das jetzt 3000, den Strich Minus nicht vergesst, ist eigentlich egal."}, {"id": 419, "start": 2326.0, "end": 2334.0, "text": "Du kannst eigentlich machen, tarxfz. Du brauchst eigentlich keinen Minus. Der ist da ja schlau genug."}, {"id": 420, "start": 2334.0, "end": 2343.0, "text": "Ok, du kannst unprojentarxfzv und dann irgendwas blub angeben. Dann sagt er, normalerweise hier die Datei ist kein gzip."}, {"id": 421, "start": 2343.0, "end": 2350.0, "text": "Das geht, also brauchst du beim tar. Mittlerweile brauchst du keinen Minus mehr. Es geht also."}, {"id": 422, "start": 2350.0, "end": 2365.0, "text": "Die Musik ist schlimm, das ist so random. Hast du anderen Vorschlag? Das ist schon übelstes gedudeln, ne?"}, {"id": 423, "start": 2365.0, "end": 2381.0, "text": "Oh guck mal, er hat es kopiert auf den Staubsauger. Oh, es ist langsam."}, {"id": 424, "start": 2381.0, "end": 2407.0, "text": "Ok, schauen wir mal. Plus x versandt traxor. Scheiße, das läuft auf dem Staubsauger."}, {"id": 425, "start": 2407.0, "end": 2425.0, "text": "Der kack läuft auf dem Staubsauger. Ach du kacke. Ach du scheiße."}, {"id": 426, "start": 2425.0, "end": 2438.0, "text": "Ich hätte gar nicht damit gerechnet, dass das Ding auf dem Staubsauger einfach so startet. Genial. Das läuft auf dem Staubsauger."}, {"id": 427, "start": 2438.0, "end": 2448.0, "text": "Der Paket Tracker läuft auf dem Staubsauger. Läuft das auch mit Amazon? Das ist geplant, dass es mit Amazon läuft."}, {"id": 428, "start": 2448.0, "end": 2455.0, "text": "Du kannst auch schon Amazon auswählen und eintragen. Allerdings wird dir dann sagen, es ist noch nicht unterstützt."}, {"id": 429, "start": 2455.0, "end": 2460.0, "text": "Das mache ich aber im nächsten, nächsten, nächsten. Vielleicht kriege ich das sogar dieses Wochenende noch hin."}, {"id": 430, "start": 2460.0, "end": 2472.0, "text": "Ich muss die Amazon-Tracking-Seite pasen, dass das richtig funktioniert. Auf dem Staubsauger."}, {"id": 431, "start": 2472.0, "end": 2479.0, "text": "Ok, Leute. Dass wir es ausprobieren können, muss ich es aber nochmal löschen."}, {"id": 432, "start": 2479.0, "end": 2486.0, "text": "Dass wir es ausprobieren können, muss ich es aber nochmal löschen und die Url hinzufügen, dass ich von extern drauf zugreifen kann."}, {"id": 433, "start": 2486.0, "end": 2495.0, "text": "Oder wir machen irgendeine SSH-Port-Weiterleitung. Oh, das können wir auch machen. Jetzt wird es voll abgedreht, Leute."}, {"id": 434, "start": 2495.0, "end": 2505.0, "text": "Also wir starten den Versand-Tracker auf dem Staubsauger. Dann sagen wir SSH minus Local, Port 5000,"}, {"id": 435, "start": 2505.0, "end": 2532.0, "text": "Weiterleiten auf den Staubsauger, Port 5000 auf dem Staubsauger und jetzt das Ganze auf den Staubsauger redirecten."}, {"id": 436, "start": 2532.0, "end": 2543.0, "text": "Mal gucken, ob das funktioniert."}, {"id": 437, "start": 2543.0, "end": 2567.0, "text": "Localhost 5000. Funktioniert! Der Versand-Tracker auf dem Staubsauger. Dass das hier Localhost steht, stimmt nicht. Das ist Localhost auf dem Staubsauger. Ich habe es weitergeleitet."}, {"id": 438, "start": 2567.0, "end": 2576.0, "text": "Wir sind auf dem Staubsauger, Leute. Gucken wir mal, ob es funktioniert. Aber das wird jetzt crashen oder abkacken oder irgendwas wird passieren,"}, {"id": 439, "start": 2576.0, "end": 2584.0, "text": "weil, bin ich mal gespannt, weil, das hier oben ist die Ausgabe auf dem Staubsauger, weil der Staubsauger hat keinen Internetzugang."}, {"id": 440, "start": 2584.0, "end": 2597.0, "text": "Ach so, Moment. Amazon ist natürlich doof. Amazon liefert Hardcoded zurück, dass Tracking nicht supported ist. Aber seht ihr mal, wie schnell das auf dem Staubsauger läuft?"}, {"id": 441, "start": 2597.0, "end": 2605.0, "text": "Habt ihr es mal aufgefallen? Das funktioniert richtig, richtig gut. DHL wird er jetzt meckern oder DHL wird er abkacken oder irgendwas wird passieren,"}, {"id": 442, "start": 2605.0, "end": 2614.0, "text": "weil der Staubsauger keinen Internetzugriff hat. Mal gucken, mal gucken, was passiert. Mal gucken, was passiert, wenn das Ding keinen Internetzugriff hat."}, {"id": 443, "start": 2614.0, "end": 2625.0, "text": "Ich meine, abkacken sollte er nicht. Er sollte timeouten nach 5 Minuten oder so und sagen Fehler. Warum lässt du deinen Staubsauger nicht ins Internet? Der muss da rein."}, {"id": 444, "start": 2625.0, "end": 2641.0, "text": "Mein Staubsauger ist in extra China. Oh, naja, gut, Namensauflösung geht nicht. Namensauflösung geht nicht. Okay, ja, gut, kann man nichts machen."}, {"id": 445, "start": 2641.0, "end": 2656.0, "text": "Namensauflösung geht nicht. Ist okay, er ist im China-WLAN, er darf nirgends wohin. Leute, ganz ehrlich, ich hätte im Leben nicht gedacht, dass mein Programm auf meinem Staubsauger läuft."}, {"id": 446, "start": 2656.0, "end": 2681.0, "text": "Das ist doch der Witz. Geil, oder? Was ist das für ein Staubsauger? Das ist ein Xiaomi Roborock S50. Der da. So einer ist das."}, {"id": 447, "start": 2681.0, "end": 2702.0, "text": "Man spricht das Xiaomi aus, oder? Also man spricht das garantiert nicht Xiaomi aus. Oder wenn es Chinesisch ist, wahrscheinlich Xiaomi oder irgendwie so. Ich weiß nicht."}, {"id": 448, "start": 2702.0, "end": 2714.0, "text": "Aber ich bin echt begeistert. Ich meine, er kann nicht ins Internet, wie man hier sieht, der Staubsauger. Der Staubsauger kann nicht ins Internet, deswegen kann er auch keine DHL-Verbindungsdaten abrufen."}, {"id": 449, "start": 2714.0, "end": 2728.0, "text": "Aber guck mal, das komplette Webinterface funktioniert. Anlegen von Sendungen funktioniert, löschen von Sendungen funktioniert. Ich meine, abrufen von Sendungsinformationen funktioniert natürlich nicht, weil der Staubsauger, wie gesagt, nicht ins Internet kann."}, {"id": 450, "start": 2728.0, "end": 2748.0, "text": "Aber ihr müsst zugeben, oder? Ihr seid auch ein bisschen überrascht, dass es auf dem Staubsauger läuft, oder? Müsst ihr zugeben."}, {"id": 451, "start": 2748.0, "end": 2770.0, "text": "Kitkakashi1990, Dankeschön für den Sub. Gut, dass er nicht ins Netz kann. Ja, das ist absichtlich. Perfekt, zack, erstmal löschen alles, aufs Staubsauger die Sache beenden."}, {"id": 452, "start": 2770.0, "end": 2796.0, "text": "Und ich lösche das mal wieder vom Staubsauger, weil das frisst, glaube ich, 124 MB einfach sinnlos auf der 2 GB SSD vom Staubsauger. Ich glaube, wir löschen es mal einfach wieder."}, {"id": 453, "start": 2796.0, "end": 2814.0, "text": "Aber es ist echter Wahnsinn, oder? Es ist wirklich sehr nice, dass mein Versandtracker auf dem Staubsauger läuft. Woher kommt eigentlich dieses Anime mit? Meinst du das hier?"}, {"id": 454, "start": 2814.0, "end": 2843.0, "text": "Oder meinst du das hier? Die kann auch mehr sagen. Die kann auch sagen, Cute Chat zum Beispiel. Oder, also meine persönlichen Lieblingsaussprache ist ja das hier. Das ist immer noch die beste Variante."}, {"id": 455, "start": 2843.0, "end": 2852.0, "text": "Ist das normal, dass sich.NET Core fast eine Minute zum Kompilieren gönnt? Tauert das bei dir so lang?"}, {"id": 456, "start": 2852.0, "end": 2881.0, "text": "Das Initial, es kann sein, wenn es das allererste ist, was du kompilierst, unabhängig vom Projekt, kann das sein, dass es das erste Mal so lange dauert. Aber ansonsten sollte das eigentlich schneller gehen. Können wir mal ausprobieren. Ich kann mal gucken, wie lang es bei mir vor sich hin. Compilesort. Übrigens die falsche App, in der ich gerade bin. Ja, da will ich hin."}, {"id": 457, "start": 2881.0, "end": 2894.0, "text": "Ich kann mal gucken, wie schnell das Compilesort bei mir..NET, habe ich überhaupt installiert hier?"}, {"id": 458, "start": 2894.0, "end": 2921.0, "text": "Minusminusversion. Also.NET, Publish, MinusR, Win, x64, Minusminusselfcontained. Hab ich noch was vergessen?"}, {"id": 459, "start": 2921.0, "end": 2936.0, "text": "Na ok, ich gebe zu, es kompiliert ganz schön lahm. Also es könnte durchaus schneller sein."}, {"id": 460, "start": 2936.0, "end": 2957.0, "text": "Ah, hat auch funktioniert. Ging doch halbwegs schnell. Achso Release Mode sollte ich noch rein machen. Wie ging das? Minus C, Release? Ja guck, die weitere Sachen, die man kompiliert, gehen immer viel schneller."}, {"id": 461, "start": 2957.0, "end": 2970.0, "text": "Ja nice. Also Leute, jetzt haben wir ein paar sinnlose Sachen ausprobiert, die meine Software auf dem Staubsauger laufen zu lassen. Hat funktioniert. Sieht man mal, wie portabel der Kram mittlerweile ist."}, {"id": 462, "start": 2970.0, "end": 2992.0, "text": "Hat irgendeiner noch ausprobiert? Machst du den Code öffentlich? Der ist öffentlich. Auf GitHub, kannst du den angucken. Da hast du den ganzen Sourcecode drauf und du hast hier unter Release die aktuelle Version."}, {"id": 463, "start": 2992.0, "end": 3007.0, "text": "Also ich sag's nochmal, die Windows Version, die es hier gibt, die Win x64, da hab ich den übelsten Noobfehler überhaupt gemacht. Der ist aber super einfach zu fixen."}, {"id": 464, "start": 3007.0, "end": 3022.0, "text": "Wenn ihr das runterladet, die Windows Version, wenn ihr die Windows Version runterladet und entpackt, dann kommt dieser Ordner hier raus und da ist ein Link drin und ein Shortcut um das Programm zu starten."}, {"id": 465, "start": 3022.0, "end": 3042.0, "text": "Wenn ihr den Shortcut nicht in einen relativen Pfad reingeklatscht habt, sondern einfach einen Shortcut erstellt habt, der auf meinen Pfad hier zeigt. Das ist Fail. Der startet nicht. Sondern ihr müsst hier in diesen Publish Ordner rein und dort die Versandtrack zur Exo starten. Dann klappt das Ganze."}, {"id": 466, "start": 3042.0, "end": 3065.0, "text": "Also wer hat's denn jetzt schon ausprobiert? BeatBot hat's schon ausprobiert, ne? Ich bräuchte schon mal ein paar Leute, die zumindest mal die Basic Funktionen ausprobieren. Und wenn die Basic Funktionen tun, dann noch das E-Mail scannen."}, {"id": 467, "start": 3065.0, "end": 3086.0, "text": "Also aus nichts probiert, ok."}, {"id": 468, "start": 3086.0, "end": 3102.0, "text": "Wo bekomme ich das her? Hier. Ah, auf dem Github Link. Der Eichler. Die Win-64-Zip brauchst du."}, {"id": 469, "start": 3102.0, "end": 3119.0, "text": "Das Ding einfach nur DPD geht. Ah, das ist gut zu hören. Packt das Ding einfach nur die verschiedenen Infos zusammen oder kann das mehr? Das, was ein Versandtracker kann, plus, und das ist der Grund, warum ich's gemacht hab, das kann dein E-Mail Postfach durchsuchen nach neuen Trackingnummern."}, {"id": 470, "start": 3119.0, "end": 3134.0, "text": "Also es gibt ganz viele Versandtracking-Apps, die sowas hier können, aber was mir halt extrem auf den Sack geht, ist bei den ganzen Versandtracking-Apps, dass du bei allen Versandtracking-Apps das hier machen musst. Funktioniert, getestet. Ah, nice, sogar Unternehmungsgetestet."}, {"id": 471, "start": 3134.0, "end": 3154.0, "text": "Bei allen Versandtracking-Apps musst du den Kram manuell hinzufügen. Und bei mir ist es so, du kannst den Kram natürlich manuell hinzufügen oder du gibst deine E-Mail an, gibst dein E-Mail-Postfach an und er durchsucht dein E-Mail-Postfach für dich nach neuen Trackingnummern und trackt die dann."}, {"id": 472, "start": 3154.0, "end": 3169.0, "text": "Das ist eigentlich der Grund, warum ich das gemacht hab, weil ich hab keinen Bock, alles, was ich bestelle, von Hand in den Tracker einzubauen. Ich will, dass es das aus den E-Mails selbst rausscannt."}, {"id": 473, "start": 3169.0, "end": 3189.0, "text": "Und der nächste Schritt ist, wenn das funktioniert, dann wird... Parcel Track kann das aber auch aus den E-Mails, ich weiß. Parcel Track kannst du allerdings nicht selbst bei dir hosten, sondern musst einem externen Anbieter vertrauen, da wo du keine Ahnung hast, was die machen mit deinen E-Mails."}, {"id": 474, "start": 3189.0, "end": 3212.0, "text": "Das ist auch der Grund, Parcel Track ist nicht schlecht, Parcel Track war auch mit oder weniger so ein bisschen die Inspiration dafür, das zu machen, weil ich hab geguckt, was es alles gibt, hab Parcel Track gefunden, hab festgestellt, dass das vom grundsätzlichen her so ist, wie das ich haben will, allerdings manche Sachen haben mir nicht gefallen und dass man es halt nicht selbst betreiben kann, nervt mich."}, {"id": 475, "start": 3212.0, "end": 3225.0, "text": "Kann man mehrere E-Mail-Adressen eintragen, aktuell kann man nur eine E-Mail-Adresse eintragen, funktioniert bei mir sehr schön. Hat zufällig schon jemand mit der E-Mail-Funktion probiert?"}, {"id": 476, "start": 3225.0, "end": 3242.0, "text": "Also aktuell kann man nur eine E-Mail eintragen, funktioniert folgendermaßen, hier gibt es eine Config.Json-Datei, wenn ihr die aufmacht, wo ist mein VS Code?"}, {"id": 477, "start": 3242.0, "end": 3270.0, "text": "Wie deploye ich das denn? Einfach runterladen, entpacken und starten. Oh, da gibt es eine Config.Json, da kann man eintragen, ich hab's am Anfang schon mal erzählt, aber jetzt sind mehr Leute da, da kann man eintragen, einmal seine Standard-Location, wo man immer Pakete hinschickt, das benutzt ihr, wenn der Paket-Dienstleister beim Zugestellt nichts vermerkt, in welchem Ort das war, dann euer Name, oder es muss nicht euer Name sein, es muss irgendwas sein,"}, {"id": 478, "start": 3270.0, "end": 3288.0, "text": "von eurem E-Mail-Account, es sollte irgendwas sein, was in E-Mails vorkommt, was einen Shop reinschreibt, in der Regel der Name. Kann Vorname, Nachname sein, nur Nachname ist egal, einfach irgendwas, wo man E-Mails noch mal zusätzlich checken kann, ob die auch an euch sind."}, {"id": 479, "start": 3288.0, "end": 3308.0, "text": "So, und hier könnt ihr euren E-Mail-I-Map-Server eintragen, von eurem E-Mail-Anbieter, Passwort und E-Mail-Account, und wenn ihr das dann startet, sucht das Ding eure, die letzten 30 Tage, von eurem E-Mail-Postfach und fügt es automatisch hinzu zum Tracking."}, {"id": 480, "start": 3308.0, "end": 3323.0, "text": "DPS-Tracking funktioniert nicht. Warum nicht? Der DPS, was? Was ist denn DPS? Was ist DPD, ne? Gib mir mal die Nummer, warum funktioniert DPD-Tracking? Ich hab hier selbst mal DPD-Pakete drin."}, {"id": 481, "start": 3323.0, "end": 3345.0, "text": "Wäre es nicht einfacher gewesen, die C-Sharp-Settings zu benutzen? Doch, wäre es, und ich will auch in Zukunft gar keine Chastain-Settings-Datei mehr haben, sondern einfach hier oben den Settings-Knopf, wo man das über das Web-Interface machen kann."}, {"id": 482, "start": 3345.0, "end": 3360.0, "text": "Aber das war jetzt das Einfachste, das hab ich heute Morgen noch auf die Schnelle reingewurstet, die Chastain-Settings-Datei. Die ist auch, die ist wirklich super simple implementiert, und zwar App-Settings."}, {"id": 483, "start": 3360.0, "end": 3375.0, "text": "Das macht nichts anderes, als einfach aus dem Verzeichnis, wo es gestartet wurde, die Sachen auszulesen und hier reinzuschreiben. Es ist einfach, dass es geht."}, {"id": 484, "start": 3375.0, "end": 3388.0, "text": "E-Mail-Passwort als Klientext in der Taste zu schreiben ist aber ganz schön böse. Ja, das gebe ich dir recht, das ist doof. Aber das ist wie gesagt einfach nur zum Testen, ob es funktioniert."}, {"id": 485, "start": 3388.0, "end": 3395.0, "text": "Ich hab da aber auch selbst schon mal ein Passwort reingeschrieben, da kommt ja keiner dran, außer jemand hack-sort euren Rechner."}, {"id": 486, "start": 3395.0, "end": 3405.0, "text": "In Zukunft werde ich das so machen, entweder, also ich habe mir zwar zwei Varianten überlegt, wie ich das machen könnte, entweder schreibe ich das mit in die SQLite-Datenbank."}, {"id": 487, "start": 3405.0, "end": 3411.0, "text": "Das verschlüsselt zwar nicht, aber ist zumindest nicht auf den ersten Blick so, springt nicht mehr so ins Gesicht."}, {"id": 488, "start": 3411.0, "end": 3438.0, "text": "Aber die schönere Variante wäre natürlich, wenn es das mit irgendeinem Key ablegen würde. Und die noch schönere Variante wäre, dass du quasi einmal beim Start von der App irgendwas eingeben musst und dass er das zum Entschlüssel nimmt."}, {"id": 489, "start": 3438.0, "end": 3447.0, "text": "Du kannst doch in die Secret-Json speichern. Na gut, die Secrets-Json-Datei wird hier auch nicht mehr Secret, nur weil sie Secrets-Json heißt."}, {"id": 490, "start": 3447.0, "end": 3451.0, "text": "Jeder im Zugriff auf den Rechner könnte es trotzdem lesen."}, {"id": 491, "start": 3451.0, "end": 3466.0, "text": "Also ich glaube die beste Variante wäre, dass man einmalig einen Key vergibt am Anfang, mit dem man dann die E-Mail-Passworter verschlüsselt lokal und den musst du halt einmalig beim Starten der App im Passwort eingeben."}, {"id": 492, "start": 3466.0, "end": 3479.0, "text": "Das ist so wie bei Thunderbird. Wenn du bei Thunderbird Passwörter für E-Mails speicherst, fragt er dich ja auch, willst du das nicht mit einem Masterkey sichern. So werde ich das wahrscheinlich auch machen."}, {"id": 493, "start": 3479.0, "end": 3487.0, "text": "Ich mache in der Regel immer das, wo ich selbst am wenigsten Bauchweh mit habe."}, {"id": 494, "start": 3487.0, "end": 3503.0, "text": "Nutze dafür dann Argon 2, nö. Ich benutze dafür AES 128 oder AES 268. Irgendetwas, was standardmäßig dabei ist."}, {"id": 495, "start": 3503.0, "end": 3507.0, "text": "Irgendwelche eigenen Kryptosachen zu rerollen ist aber ganz bescheuert."}, {"id": 496, "start": 3507.0, "end": 3514.0, "text": "Hier eine DPD-Nummer. Okay, soll ich mal ausprobieren, ob es funktioniert?"}, {"id": 497, "start": 3514.0, "end": 3519.0, "text": "Comment braucht man übrigens nicht, kann man weglassen."}, {"id": 498, "start": 3519.0, "end": 3528.0, "text": "Kann ich dir die Tracking-ID irgendwie privat senden? Ja, aber das Problem ist, ich würde es dann hier im Stream ausprobieren, das bringt ja nichts, dann sieht man die Tracking-ID trotzdem."}, {"id": 499, "start": 3528.0, "end": 3535.0, "text": "Ich glaube das ist keine so gute Idee."}, {"id": 500, "start": 3535.0, "end": 3544.0, "text": "Wenn ich das mit den E-Mails mache, komme ich nicht mal ins Web-Interfere. Ernsthaft? Habe ich irgendwas kaputt gemacht mit den E-Mails vorhin noch?"}, {"id": 501, "start": 3544.0, "end": 3548.0, "text": "Delivered."}, {"id": 502, "start": 3548.0, "end": 3552.0, "text": "Anröchte."}, {"id": 503, "start": 3552.0, "end": 3556.0, "text": "Was denn?"}, {"id": 504, "start": 3556.0, "end": 3566.0, "text": "Leute, wie findet ihr die Truck-Animation? Ich finde den immer noch nice."}, {"id": 505, "start": 3566.0, "end": 3575.0, "text": "Achso, du musst neu starten. Du musst neu starten, wenn du in die Conflict-Chasing was eingetragen hast."}, {"id": 506, "start": 3575.0, "end": 3580.0, "text": "Ich mag die Animation hier mit dir."}, {"id": 507, "start": 3580.0, "end": 3590.0, "text": "Manchmal backt das ein bisschen mit dem LKW, warum auch Aschaffenburg nicht drin steht."}, {"id": 508, "start": 3590.0, "end": 3596.0, "text": "Das funktioniert auch manchmal."}, {"id": 509, "start": 3596.0, "end": 3604.0, "text": "Manchmal backt der LKW noch ein bisschen."}, {"id": 510, "start": 3604.0, "end": 3611.0, "text": "Jetzt kann ich das mit dem E-Mails scanen."}, {"id": 511, "start": 3611.0, "end": 3615.0, "text": "Das ist das Web-Interface nicht mehr."}, {"id": 512, "start": 3615.0, "end": 3619.0, "text": "Das Web-Interface sollte von Scannen E-Mails aber überhaupt nicht beeinflusst werden."}, {"id": 513, "start": 3619.0, "end": 3621.0, "text": "Soweit in der Theorie."}, {"id": 514, "start": 3621.0, "end": 3627.0, "text": "Das ist ein eigener Thread fürs E-Mails-Scan."}, {"id": 515, "start": 3627.0, "end": 3630.0, "text": "Das probiere ich jetzt mal aus."}, {"id": 516, "start": 3630.0, "end": 3633.0, "text": "Ich trage hier jetzt mal einen Mist ein, den es nicht gibt."}, {"id": 517, "start": 3633.0, "end": 3638.0, "text": "Dann starten wir das Ganze mal."}, {"id": 518, "start": 3638.0, "end": 3643.0, "text": "Schauen wir mal, was passiert."}, {"id": 519, "start": 3643.0, "end": 3647.0, "text": "Achso, das gibt es nicht."}, {"id": 520, "start": 3647.0, "end": 3661.0, "text": "Ich muss bei irgendeinem E-Mapserver eintragen, den es gibt in GMX."}, {"id": 521, "start": 3661.0, "end": 3667.0, "text": "Warum juckt den das überhaupt?"}, {"id": 522, "start": 3667.0, "end": 3670.0, "text": "Ja, ich weiß warum."}, {"id": 523, "start": 3670.0, "end": 3673.0, "text": "Guck mal, Leute."}, {"id": 524, "start": 3673.0, "end": 3682.0, "text": "Wobei eigentlich ist es ganz gut, dass der mit einer Exception abkackt."}, {"id": 525, "start": 3682.0, "end": 3688.0, "text": "Du musst gucken, ob der X-Wert vom Ende größer ist als der vom Start."}, {"id": 526, "start": 3688.0, "end": 3691.0, "text": "Und dann den Truck flippen."}, {"id": 527, "start": 3691.0, "end": 3697.0, "text": "Hä, warum?"}, {"id": 528, "start": 3697.0, "end": 3699.0, "text": "Der Truck ist doch okay."}, {"id": 529, "start": 3699.0, "end": 3702.0, "text": "Oder wo spackt der Truck rum?"}, {"id": 530, "start": 3702.0, "end": 3704.0, "text": "Das sieht doch immer gut aus."}, {"id": 531, "start": 3704.0, "end": 3706.0, "text": "Der fährt nicht rückwärts."}, {"id": 532, "start": 3706.0, "end": 3714.0, "text": "Oder wo meinst du jetzt?"}, {"id": 533, "start": 3714.0, "end": 3717.0, "text": "Hab jetzt die Konfig durch die Alterssätze, nun geht es wieder."}, {"id": 534, "start": 3717.0, "end": 3720.0, "text": "Das ist doch auch mit Mail."}, {"id": 535, "start": 3720.0, "end": 3726.0, "text": "Wenn deine E-Mail-Zugangsdaten stimmen, dann funktioniert es und kackt auch nicht ab."}, {"id": 536, "start": 3726.0, "end": 3729.0, "text": "Dass er eine Exception wirft, ist eigentlich okay, wenn das nicht funktioniert."}, {"id": 537, "start": 3729.0, "end": 3732.0, "text": "Es wäre bescheuert zu starten und nichts zu sagen."}, {"id": 538, "start": 3732.0, "end": 3737.0, "text": "Stellt euch mal vor, da würde starten und nicht irgendwie abkacken mit einer Exception,"}, {"id": 539, "start": 3737.0, "end": 3739.0, "text": "dass die E-Mail-Adresse nicht stimmt."}, {"id": 540, "start": 3739.0, "end": 3743.0, "text": "Dann wirst ja kein Mensch, dass die E-Mail-Adresse falsch ist."}, {"id": 541, "start": 3743.0, "end": 3747.0, "text": "Bei mir nicht, okay."}, {"id": 542, "start": 3747.0, "end": 3754.0, "text": "Warum geht das mit der E-Mail nicht?"}, {"id": 543, "start": 3754.0, "end": 3758.0, "text": "Also bei mir mit GMX funktioniert es bei mir."}, {"id": 544, "start": 3758.0, "end": 3769.0, "text": "Das doofe ist, ich habe keinen IMAP Server zum Testen hier, wo ich jetzt was eingeben könnte."}, {"id": 545, "start": 3769.0, "end": 3772.0, "text": "Hm."}, {"id": 546, "start": 3772.0, "end": 3776.0, "text": "Also ich habe es vorhin ausprobiert mit GMX."}, {"id": 547, "start": 3776.0, "end": 3780.0, "text": "Also so ungefähr."}, {"id": 548, "start": 3780.0, "end": 3786.0, "text": "So müsste das dann aussehen, wenn man es richtig einträgt."}, {"id": 549, "start": 3786.0, "end": 3790.0, "text": "Also den IMAP Server eintragen."}, {"id": 550, "start": 3790.0, "end": 3792.0, "text": "Machst du schnell einen Google-Trash-Account."}, {"id": 551, "start": 3792.0, "end": 3794.0, "text": "Man kann nicht schnell einen Google-Trash-Account machen,"}, {"id": 552, "start": 3794.0, "end": 3802.0, "text": "weil um mittlerweile um Google-Accounts zu machen, braucht man eine gültige Telefonnummer."}, {"id": 553, "start": 3802.0, "end": 3803.0, "text": "Was, Gmail geht nicht?"}, {"id": 554, "start": 3803.0, "end": 3807.0, "text": "Okay, warte mal."}, {"id": 555, "start": 3807.0, "end": 3810.0, "text": "Also wenn er Scanning-Mails sagt, funktioniert das prinzipiell."}, {"id": 556, "start": 3810.0, "end": 3812.0, "text": "Er findet vielleicht einfach nichts."}, {"id": 557, "start": 3812.0, "end": 3816.0, "text": "Ja, man braucht eine Telefonnummer, um einen Google-Account zu erstellen."}, {"id": 558, "start": 3816.0, "end": 3819.0, "text": "Dafür könnt ihr ja mal ausprobieren."}, {"id": 559, "start": 3819.0, "end": 3824.0, "text": "Er holt sich tatsächlich die Mails."}, {"id": 560, "start": 3824.0, "end": 3828.0, "text": "Ja, der Eichstader funktioniert doch, oder?"}, {"id": 561, "start": 3828.0, "end": 3830.0, "text": "Findet Amazon."}, {"id": 562, "start": 3830.0, "end": 3837.0, "text": "Jo."}, {"id": 563, "start": 3837.0, "end": 3841.0, "text": "10-Minute-Mails, haben die IMAP?"}, {"id": 564, "start": 3841.0, "end": 3848.0, "text": "Haben die IMAP?"}, {"id": 565, "start": 3848.0, "end": 3853.0, "text": "Die zeigt er nur im Serverlog an, okay."}, {"id": 566, "start": 3853.0, "end": 3857.0, "text": "Nee, IMAP bei Google muss einfach funktionieren."}, {"id": 567, "start": 3857.0, "end": 3862.0, "text": "Kennt jemand einen Wegwerf IMAP Server?"}, {"id": 568, "start": 3862.0, "end": 3869.0, "text": "Haben wir ganz oft gefragt."}, {"id": 569, "start": 3869.0, "end": 3877.0, "text": "Kennt jemand einen Wegwerf IMAP Server?"}, {"id": 570, "start": 3877.0, "end": 3891.0, "text": "Flash-Mail-IMAP, gibt es sowas?"}, {"id": 571, "start": 3891.0, "end": 3893.0, "text": "Das Problem ist,"}, {"id": 572, "start": 3893.0, "end": 3894.0, "text": "das Problem ist,"}, {"id": 573, "start": 3894.0, "end": 3896.0, "text": "mit Google-Account kann man nicht so einfach einrichten."}, {"id": 574, "start": 3896.0, "end": 3898.0, "text": "Da braucht man eine Telefonnummer mittlerweile."}, {"id": 575, "start": 3898.0, "end": 3899.0, "text": "Guck, pass auf."}, {"id": 576, "start": 3899.0, "end": 3901.0, "text": "Create First Name."}, {"id": 577, "start": 3901.0, "end": 3905.0, "text": "Max Last Name."}, {"id": 578, "start": 3905.0, "end": 3907.0, "text": "Username."}, {"id": 579, "start": 3907.0, "end": 3910.0, "text": "Omega, null, wupp."}, {"id": 580, "start": 3910.0, "end": 3913.0, "text": "Passwort."}, {"id": 581, "start": 3913.0, "end": 3919.0, "text": "Ich sag euch das Passwort jetzt nicht."}, {"id": 582, "start": 3919.0, "end": 3924.0, "text": "Passwort."}, {"id": 583, "start": 3924.0, "end": 3926.0, "text": "Guck, Telefonnummer."}, {"id": 584, "start": 3926.0, "end": 3928.0, "text": "Du brauchst mittlerweile bei Google eine Telefonnummer."}, {"id": 585, "start": 3928.0, "end": 3942.0, "text": "Das ist übelst räunig."}, {"id": 586, "start": 3942.0, "end": 3944.0, "text": "Ach, so meinst du das wie Fitrainerin."}, {"id": 587, "start": 3944.0, "end": 3945.0, "text": "Das stimmt, ja."}, {"id": 588, "start": 3945.0, "end": 3948.0, "text": "Der Truck hat keinerlei Logik dahinter."}, {"id": 589, "start": 3948.0, "end": 3949.0, "text": "Da hast du recht."}, {"id": 590, "start": 3949.0, "end": 3950.0, "text": "Jetzt weiß ich was."}, {"id": 591, "start": 3950.0, "end": 3952.0, "text": "Ja, das könnte man tatsächlich noch machen."}, {"id": 592, "start": 3952.0, "end": 3955.0, "text": "So quasi, wenn das Ziel rechts ist,"}, {"id": 593, "start": 3955.0, "end": 3959.0, "text": "dann den Truck umdrehen."}, {"id": 594, "start": 3959.0, "end": 3962.0, "text": "Optional?"}, {"id": 595, "start": 3962.0, "end": 3967.0, "text": "Wo steht das, dass das optional ist?"}, {"id": 596, "start": 3967.0, "end": 3969.0, "text": "Ja, das ist bla."}, {"id": 597, "start": 3969.0, "end": 3972.0, "text": "Optional, bla."}, {"id": 598, "start": 3972.0, "end": 3976.0, "text": "1, 1990, Gender."}, {"id": 599, "start": 3976.0, "end": 3981.0, "text": "Ah, Custom."}, {"id": 600, "start": 3981.0, "end": 3985.0, "text": "Ich bin ein..."}, {"id": 601, "start": 3985.0, "end": 3992.0, "text": "Ich bin eine M2 NVMe SSD."}, {"id": 602, "start": 3992.0, "end": 3996.0, "text": "Chat, da dürft ihr nichts drüber sagen."}, {"id": 603, "start": 3996.0, "end": 3999.0, "text": "Sonst ist die Anzeige raus."}, {"id": 604, "start": 3999.0, "end": 4003.0, "text": "Please refer to me as other."}, {"id": 605, "start": 4003.0, "end": 4006.0, "text": "Wie, mehr Auswahl gibt's nicht?"}, {"id": 606, "start": 4006.0, "end": 4028.0, "text": "Alter, ich muss gleich zum Gleichberechtigungsbeauftragten gehen."}, {"id": 607, "start": 4028.0, "end": 4033.0, "text": "Okay, und ihr meint, die E-Mail, das wäre optional, okay?"}, {"id": 608, "start": 4033.0, "end": 4036.0, "text": "Dann schauen wir mal, ob das Ganze optional ist."}, {"id": 609, "start": 4036.0, "end": 4038.0, "text": "Ich mach das Ganze noch mal kurz zurückgängig."}, {"id": 610, "start": 4038.0, "end": 4041.0, "text": "Max Wublords."}, {"id": 611, "start": 4041.0, "end": 4045.0, "text": "Omega Lul Wub."}, {"id": 612, "start": 4045.0, "end": 4047.0, "text": "Wub."}, {"id": 613, "start": 4047.0, "end": 4049.0, "text": "Passwort."}, {"id": 614, "start": 4049.0, "end": 4050.0, "text": "Oh, Moment."}, {"id": 615, "start": 4050.0, "end": 4053.0, "text": "Omega Lul Wub."}, {"id": 616, "start": 4053.0, "end": 4056.0, "text": "Next."}, {"id": 617, "start": 4056.0, "end": 4058.0, "text": "Phone number, never."}, {"id": 618, "start": 4058.0, "end": 4061.0, "text": "Aber wir speichern mal, sonst vergesse ich das noch."}, {"id": 619, "start": 4061.0, "end": 4066.0, "text": "Okay, ja, 01, 1990, Gender, Mail."}, {"id": 620, "start": 4066.0, "end": 4067.0, "text": "Ich mach mir das mal ein bisschen kürzer."}, {"id": 621, "start": 4067.0, "end": 4068.0, "text": "Next."}, {"id": 622, "start": 4068.0, "end": 4069.0, "text": "What?"}, {"id": 623, "start": 4069.0, "end": 4070.0, "text": "Ach so."}, {"id": 624, "start": 4070.0, "end": 4071.0, "text": "91, ja, okay."}, {"id": 625, "start": 4071.0, "end": 4072.0, "text": "Privacy."}, {"id": 626, "start": 4072.0, "end": 4073.0, "text": "Ja."}, {"id": 627, "start": 4073.0, "end": 4074.0, "text": "Ja."}, {"id": 628, "start": 4074.0, "end": 4075.0, "text": "Ja."}, {"id": 629, "start": 4075.0, "end": 4084.0, "text": "Ach, das geht echt jetzt so einfach ohne Telefonnummer mittlerweile?"}, {"id": 630, "start": 4084.0, "end": 4090.0, "text": "Ich musste das letzte Mal, ich kann mich noch ganz genau dran erinnern, ich musste eine Telefonnummer angeben."}, {"id": 631, "start": 4090.0, "end": 4096.0, "text": "Die wollten das dann irgendwie verifizieren."}, {"id": 632, "start": 4096.0, "end": 4097.0, "text": "Easy."}, {"id": 633, "start": 4097.0, "end": 4100.0, "text": "So einfach funktioniert das."}, {"id": 634, "start": 4100.0, "end": 4101.0, "text": "Okay."}, {"id": 635, "start": 4101.0, "end": 4106.0, "text": "So, dann tragen wir den Kram jetzt hier mal ein."}, {"id": 636, "start": 4106.0, "end": 4109.0, "text": "Äh, ja."}, {"id": 637, "start": 4109.0, "end": 4116.0, "text": "Account ist omega lul wub at gmail.com."}, {"id": 638, "start": 4116.0, "end": 4118.0, "text": "Passwort verrate ich euch nicht."}, {"id": 639, "start": 4118.0, "end": 4121.0, "text": "Server ist, ja, was sind der IMAP Server von Google?"}, {"id": 640, "start": 4121.0, "end": 4124.0, "text": "Was sind der IMAP Server von gmail?"}, {"id": 641, "start": 4124.0, "end": 4127.0, "text": "IMAP."}, {"id": 642, "start": 4127.0, "end": 4129.0, "text": "IMAP."}, {"id": 643, "start": 4129.0, "end": 4131.0, "text": "Ja."}, {"id": 644, "start": 4131.0, "end": 4133.0, "text": "IMAP, gmail."}, {"id": 645, "start": 4133.0, "end": 4145.0, "text": "Aber jetzt muss ich euch kurz ausmachen und das Passwort eintragen."}, {"id": 646, "start": 4145.0, "end": 4148.0, "text": "So."}, {"id": 647, "start": 4148.0, "end": 4155.0, "text": "Ups, da hab ich meinen Elgato angeschaltet anstatt mein Display."}, {"id": 648, "start": 4155.0, "end": 4160.0, "text": "So, und jetzt gucken wir mal, ob das funktioniert."}, {"id": 649, "start": 4160.0, "end": 4168.0, "text": "Scanning Emails."}, {"id": 650, "start": 4168.0, "end": 4170.0, "text": "Das sieht, das sieht auch gut aus."}, {"id": 651, "start": 4170.0, "end": 4175.0, "text": "So, und jetzt faken wir mal, jetzt faken wir mal eine Amazon E-Mail oder irgendeine E-Mail."}, {"id": 652, "start": 4175.0, "end": 4177.0, "text": "Faken wir jetzt mal."}, {"id": 653, "start": 4177.0, "end": 4183.0, "text": "Und gucken, ob das, ob er das findet."}, {"id": 654, "start": 4183.0, "end": 4184.0, "text": "Okay."}, {"id": 655, "start": 4184.0, "end": 4187.0, "text": "Compose."}, {"id": 656, "start": 4187.0, "end": 4191.0, "text": "Wieder hat keine Autoverfolgerung Google Mail."}, {"id": 657, "start": 4191.0, "end": 4197.0, "text": "Omega lul wub at gmail.com."}, {"id": 658, "start": 4197.0, "end": 4206.0, "text": "Subject, keine Ahnung, ihre Bestellung wurde versandt."}, {"id": 659, "start": 4206.0, "end": 4217.0, "text": "Jetzt muss ich mir mal eine Sendennummer raussuchen hier."}, {"id": 660, "start": 4217.0, "end": 4230.0, "text": "Oh, aber eine DPD, eine DPD Nummer hab ich hier gefunden."}, {"id": 661, "start": 4230.0, "end": 4232.0, "text": "Moment."}, {"id": 662, "start": 4232.0, "end": 4240.0, "text": "Das Webinterface geht wirklich nicht mehr."}, {"id": 663, "start": 4240.0, "end": 4241.0, "text": "Was hab ich da ver..."}, {"id": 664, "start": 4241.0, "end": 4244.0, "text": "Hä, warum geht das Webinterface nicht mehr, wenn die E-Mails funktionieren?"}, {"id": 665, "start": 4244.0, "end": 4247.0, "text": "The fuck?"}, {"id": 666, "start": 4247.0, "end": 4251.0, "text": "Das hab ich doch vorhin ausprobiert."}, {"id": 667, "start": 4251.0, "end": 4258.0, "text": "Was soll denn da jetzt bitteschön verkehrt sein dran?"}, {"id": 668, "start": 4258.0, "end": 4262.0, "text": "MonkaS Smoke."}, {"id": 669, "start": 4262.0, "end": 4264.0, "text": "Okay, okay."}, {"id": 670, "start": 4264.0, "end": 4267.0, "text": "Mal gucken, mal gucken."}, {"id": 671, "start": 4267.0, "end": 4274.0, "text": "Der Background Scanner, den brauchen wir."}, {"id": 672, "start": 4274.0, "end": 4278.0, "text": "Ich glaub, ich hab eine Idee, woran das liegt."}, {"id": 673, "start": 4278.0, "end": 4282.0, "text": "Ich weiß, woran das liegt."}, {"id": 674, "start": 4282.0, "end": 4283.0, "text": "Da dran liegt das."}, {"id": 675, "start": 4283.0, "end": 4289.0, "text": "Das ist das letzte, was ich vorhin noch geändert hab."}, {"id": 676, "start": 4289.0, "end": 4291.0, "text": "Jetzt geht's."}, {"id": 677, "start": 4291.0, "end": 4293.0, "text": "Fail."}, {"id": 678, "start": 4293.0, "end": 4296.0, "text": "Okay."}, {"id": 679, "start": 4296.0, "end": 4298.0, "text": "Also, Alpha 1 muss ich gleich nochmal neu hochladen."}, {"id": 680, "start": 4298.0, "end": 4304.0, "text": "Das ist ganz schön im Arsch, durch diese Einwendungen, die ich noch gemacht hab."}, {"id": 681, "start": 4304.0, "end": 4308.0, "text": "Okay, jetzt probieren wir, ob das Ganze funktioniert."}, {"id": 682, "start": 4308.0, "end": 4312.0, "text": "Ich lösch mal den Kram, der gerade drin ist."}, {"id": 683, "start": 4312.0, "end": 4317.0, "text": "Also, da wissen wir, dass es funktioniert."}, {"id": 684, "start": 4317.0, "end": 4327.0, "text": "Jetzt kommt's."}, {"id": 685, "start": 4327.0, "end": 4330.0, "text": "Ja, funktioniert."}, {"id": 686, "start": 4330.0, "end": 4334.0, "text": "Ja, das ist, wie gesagt, ich hab's ja gerade selbst festgestellt,"}, {"id": 687, "start": 4334.0, "end": 4340.0, "text": "dass es nicht funktioniert, das Webfront, wenn das E-Mail-Zeug funktioniert."}, {"id": 688, "start": 4340.0, "end": 4343.0, "text": "Bei einer Packstation kommt immer Frankfurter Main als Endpunkt."}, {"id": 689, "start": 4343.0, "end": 4349.0, "text": "Das liegt daran, weil im... Moment."}, {"id": 690, "start": 4349.0, "end": 4350.0, "text": "Ich kann jetzt..."}, {"id": 691, "start": 4350.0, "end": 4352.0, "text": "Oh Leute, jetzt hätte ich fast die Config aufgemacht."}, {"id": 692, "start": 4352.0, "end": 4355.0, "text": "Hätte eben am Passwort gesehen."}, {"id": 693, "start": 4355.0, "end": 4358.0, "text": "Weil in der Config musst du deinen Ort eintragen, wo du die Sachen hinschickst."}, {"id": 694, "start": 4358.0, "end": 4363.0, "text": "Das Problem ist, da kann ich nichts machen."}, {"id": 695, "start": 4363.0, "end": 4368.0, "text": "Manche Versanddienstleister übertragen keinen Standort."}, {"id": 696, "start": 4368.0, "end": 4373.0, "text": "Und ich mach's jetzt so, wenn kein Standort beim zugestellt Event drin ist,"}, {"id": 697, "start": 4373.0, "end": 4382.0, "text": "trägt er den default Standort ein, der in der Config-Datei steht."}, {"id": 698, "start": 4382.0, "end": 4391.0, "text": "Rafa1704, Dankeschön für den Sub."}, {"id": 699, "start": 4391.0, "end": 4399.0, "text": "Was ist das für Crap-Musik gerade?"}, {"id": 700, "start": 4399.0, "end": 4413.0, "text": "Piss dich, Alter."}, {"id": 701, "start": 4413.0, "end": 4415.0, "text": "Okay, probieren wir mal aus, ob das mit der E-Mail funktioniert."}, {"id": 702, "start": 4415.0, "end": 4419.0, "text": "Wenn das funktioniert, lad ich noch mal eine neue Version hoch,"}, {"id": 703, "start": 4419.0, "end": 4426.0, "text": "wo der Link gefixt ist und wo die E-Mail-Geschichte gefixt ist."}, {"id": 704, "start": 4426.0, "end": 4430.0, "text": "Voll verkackt."}, {"id": 705, "start": 4430.0, "end": 4436.0, "text": "Okay, der Versand-Tracksor ist auf, machen wir hier, zack."}, {"id": 706, "start": 4436.0, "end": 4439.0, "text": "Ihre Bestellung wurde versandt."}, {"id": 707, "start": 4439.0, "end": 4445.0, "text": "Versand? Versand."}, {"id": 708, "start": 4445.0, "end": 4451.0, "text": "Blablabla, hallo Maximilian Omega-Lull."}, {"id": 709, "start": 4451.0, "end": 4459.0, "text": "Ihre Bestellung ist unterwegs."}, {"id": 710, "start": 4459.0, "end": 4467.0, "text": "Unterwegs mit DPD."}, {"id": 711, "start": 4467.0, "end": 4473.0, "text": "Was weiß ich, Tracking gibt's hier."}, {"id": 712, "start": 4473.0, "end": 4478.0, "text": "Okay, jetzt gucken wir mal, ob das funktioniert."}, {"id": 713, "start": 4478.0, "end": 4483.0, "text": "Send."}, {"id": 714, "start": 4483.0, "end": 4489.0, "text": "Warten wir noch mal 30 Sekunden, bis er die E-Mails scannt."}, {"id": 715, "start": 4489.0, "end": 4492.0, "text": "Wir müssen jetzt warten, bis er die E-Mails scannt,"}, {"id": 716, "start": 4492.0, "end": 4500.0, "text": "um zu wissen, ob es funktioniert."}, {"id": 717, "start": 4500.0, "end": 4504.0, "text": "Ah, G-Mail, DPD, bam."}, {"id": 718, "start": 4504.0, "end": 4509.0, "text": "Gleich aktualisiert sich das Web-Frontend."}, {"id": 719, "start": 4509.0, "end": 4530.0, "text": "Come on, bruh, Web-Frontend."}, {"id": 720, "start": 4530.0, "end": 4533.0, "text": "Warum geht das nicht?"}, {"id": 721, "start": 4533.0, "end": 4538.0, "text": "Alter, ich hab das heute ausprobiert, das geht."}, {"id": 722, "start": 4538.0, "end": 4541.0, "text": "Was ist das denn?"}, {"id": 723, "start": 4541.0, "end": 4545.0, "text": "Er hat's doch sogar erkannt."}, {"id": 724, "start": 4545.0, "end": 4554.0, "text": "DPD, G-Mail, er hat's doch erkannt."}, {"id": 725, "start": 4554.0, "end": 4557.0, "text": "Okay, das müssen wir jetzt mal ausprobieren, woran das liegt."}, {"id": 726, "start": 4557.0, "end": 4559.0, "text": "Hab ich denn hier..."}, {"id": 727, "start": 4559.0, "end": 4562.0, "text": "Ich hab auf den letzten Drücker wieder Dinger gemacht."}, {"id": 728, "start": 4562.0, "end": 4567.0, "text": "Die haben's jetzt kaputt gemacht, wahrscheinlich."}, {"id": 729, "start": 4567.0, "end": 4569.0, "text": "Oh, scanne E-Mails."}, {"id": 730, "start": 4569.0, "end": 4574.0, "text": "Found, er hat's doch sogar gefunden."}, {"id": 731, "start": 4574.0, "end": 4576.0, "text": "Ah, ha, ich weiß, woran es liegt."}, {"id": 732, "start": 4576.0, "end": 4578.0, "text": "Es hat alles funktioniert, Leute."}, {"id": 733, "start": 4578.0, "end": 4582.0, "text": "Es hat alles funktioniert."}, {"id": 734, "start": 4582.0, "end": 4586.0, "text": "Wisst ihr, warum es nicht geht?"}, {"id": 735, "start": 4586.0, "end": 4589.0, "text": "Wer hat Big Brain und weiß, warum es nicht geht?"}, {"id": 736, "start": 4589.0, "end": 4593.0, "text": "Es hat alles funktioniert."}, {"id": 737, "start": 4593.0, "end": 4598.0, "text": "Wenn die Trackingnummer manuell eingetragen wird, sagt er, gibt's nicht."}, {"id": 738, "start": 4598.0, "end": 4602.0, "text": "Und wenn sie aus der E-Mail kommt, zeigt das gar nicht an."}, {"id": 739, "start": 4602.0, "end": 4604.0, "text": "Okay, es weiß keiner, warum es nicht funktioniert."}, {"id": 740, "start": 4604.0, "end": 4605.0, "text": "Es ist auch klar, woher."}, {"id": 741, "start": 4605.0, "end": 4607.0, "text": "Die Sache ist die."}, {"id": 742, "start": 4607.0, "end": 4610.0, "text": "Ich lösche, wenn ich Sachen lösche."}, {"id": 743, "start": 4610.0, "end": 4614.0, "text": "Ich habe hier oben die Möglichkeit, dass man auf den Papierkorb gehen kann."}, {"id": 744, "start": 4614.0, "end": 4617.0, "text": "Und man kriegt die gelöschten Sachen angezeigt."}, {"id": 745, "start": 4617.0, "end": 4620.0, "text": "Und wenn wir uns jetzt mal die Datenbank angucken..."}, {"id": 746, "start": 4620.0, "end": 4622.0, "text": "Ich kann euch zeigen, warum es nicht gibt."}, {"id": 747, "start": 4622.0, "end": 4624.0, "text": "Die Tracking gibt's noch."}, {"id": 748, "start": 4624.0, "end": 4628.0, "text": "Ja, genau, der Prick, der weiß Bescheid."}, {"id": 749, "start": 4628.0, "end": 4635.0, "text": "Das Problem ist, dass in der Datenbank diese Trackingnummer noch drin steht."}, {"id": 750, "start": 4635.0, "end": 4639.0, "text": "Äh, guck da."}, {"id": 751, "start": 4639.0, "end": 4643.0, "text": "Irgendeine davon, die hier, war das, glaube ich, gerade."}, {"id": 752, "start": 4643.0, "end": 4646.0, "text": "Und sobald es die Trackingnummer schon gibt,"}, {"id": 753, "start": 4646.0, "end": 4648.0, "text": "trackt er die Trackingnummer nicht noch mal."}, {"id": 754, "start": 4648.0, "end": 4652.0, "text": "Das will man ja normalerweise auch gar nicht."}, {"id": 755, "start": 4652.0, "end": 4654.0, "text": "Also es funktioniert alles."}, {"id": 756, "start": 4654.0, "end": 4657.0, "text": "Funktioniert alles."}, {"id": 757, "start": 4657.0, "end": 4658.0, "text": "Alles gut."}, {"id": 758, "start": 4658.0, "end": 4661.0, "text": "So, und jetzt aber nur um zu zeigen, dass es jetzt auch wirklich funktioniert ist."}, {"id": 759, "start": 4661.0, "end": 4667.0, "text": "Oh."}, {"id": 760, "start": 4667.0, "end": 4669.0, "text": "Wo ist jetzt das Problem?"}, {"id": 761, "start": 4669.0, "end": 4673.0, "text": "Willst du mich rollen oder was?"}, {"id": 762, "start": 4673.0, "end": 4674.0, "text": "Ah."}, {"id": 763, "start": 4674.0, "end": 4675.0, "text": "Ähm."}, {"id": 764, "start": 4675.0, "end": 4677.0, "text": "So, nur um zu zeigen, dass es auch wirklich funktioniert."}, {"id": 765, "start": 4677.0, "end": 4686.0, "text": "Wir nehmen die E-Mail jetzt noch mal und fordern die an uns selber."}, {"id": 766, "start": 4686.0, "end": 4695.0, "text": "Und ändern die Trackingnummer."}, {"id": 767, "start": 4695.0, "end": 4696.0, "text": "Wo kann man eintreten?"}, {"id": 768, "start": 4696.0, "end": 4698.0, "text": "Wir ändern die Trackingnummer."}, {"id": 769, "start": 4698.0, "end": 4701.0, "text": "Und zwar eine andere Trackingnummer, die ich noch nicht verwendet hab."}, {"id": 770, "start": 4701.0, "end": 4703.0, "text": "Dann funktioniert's nämlich auch."}, {"id": 771, "start": 4703.0, "end": 4705.0, "text": "Ersatz-Trackingnummer."}, {"id": 772, "start": 4705.0, "end": 4707.0, "text": "Flo, was ist denn das?"}, {"id": 773, "start": 4707.0, "end": 4708.0, "text": "Das ist aber nicht DPD."}, {"id": 774, "start": 4708.0, "end": 4718.0, "text": "Das sieht eher nach DHL aus, oder?"}, {"id": 775, "start": 4718.0, "end": 4721.0, "text": "Mit DHL unterwegs."}, {"id": 776, "start": 4721.0, "end": 4728.0, "text": "Send."}, {"id": 777, "start": 4728.0, "end": 4730.0, "text": "Okay, also wir warten, bis er wieder die E-Mails abruft."}, {"id": 778, "start": 4730.0, "end": 4734.0, "text": "Er sollte zumindest in den E-Mails jetzt checken, dass DPD und DHL drin ist."}, {"id": 779, "start": 4734.0, "end": 4736.0, "text": "Aha."}, {"id": 780, "start": 4736.0, "end": 4739.0, "text": "Die Hosenlosen-Org."}, {"id": 781, "start": 4739.0, "end": 4740.0, "text": "Da ist er."}, {"id": 782, "start": 4740.0, "end": 4744.0, "text": "Bäm."}, {"id": 783, "start": 4744.0, "end": 4752.0, "text": "Irgendjemand anderes spammt mich voll."}, {"id": 784, "start": 4752.0, "end": 4760.0, "text": "Das ist schon im Spam-Ordner gelandet hier wahrscheinlich."}, {"id": 785, "start": 4760.0, "end": 4763.0, "text": "Oder wer zum Teufel ist?"}, {"id": 786, "start": 4763.0, "end": 4779.0, "text": "Die Hosenlosen-Org."}, {"id": 787, "start": 4779.0, "end": 4781.0, "text": "Ach so."}, {"id": 788, "start": 4781.0, "end": 4785.0, "text": "Ah, cool."}, {"id": 789, "start": 4785.0, "end": 4795.0, "text": "Warum fügt der den hier ein?"}, {"id": 790, "start": 4795.0, "end": 4803.0, "text": "Die DHL-Nummer hat er erkannt."}, {"id": 791, "start": 4803.0, "end": 4805.0, "text": "Ist die gleiche?"}, {"id": 792, "start": 4805.0, "end": 4810.0, "text": "Was?"}, {"id": 793, "start": 4810.0, "end": 4813.0, "text": "Hier ist eine andere."}, {"id": 794, "start": 4813.0, "end": 4815.0, "text": "Hat er die jetzt nicht erkannt oder habe ich die schon mal..."}, {"id": 795, "start": 4815.0, "end": 4818.0, "text": "Die habe ich auch schon mal verwendet, oder heute?"}, {"id": 796, "start": 4818.0, "end": 4819.0, "text": "Nee?"}, {"id": 797, "start": 4819.0, "end": 4821.0, "text": "Hä?"}, {"id": 798, "start": 4821.0, "end": 4828.0, "text": "Okay, das braucht noch gewisse Optimierungen, so wie es aussieht."}, {"id": 799, "start": 4828.0, "end": 4829.0, "text": "Warum hat er die jetzt nicht erkannt?"}, {"id": 800, "start": 4829.0, "end": 4830.0, "text": "Wir machen jetzt mal was."}, {"id": 801, "start": 4830.0, "end": 4831.0, "text": "Wisst ihr was?"}, {"id": 802, "start": 4831.0, "end": 4832.0, "text": "Scheiß drauf."}, {"id": 803, "start": 4832.0, "end": 4833.0, "text": "Wir beenden das nochmal."}, {"id": 804, "start": 4833.0, "end": 4846.0, "text": "Wir löschen mal die Tracksaw-Datenbank."}, {"id": 805, "start": 4846.0, "end": 4850.0, "text": "Irgendeiner von euch hat es weitergeleitet hier gerade."}, {"id": 806, "start": 4850.0, "end": 4853.0, "text": "Info, die Hosenlosen."}, {"id": 807, "start": 4853.0, "end": 4859.0, "text": "Wer auch immer das ist."}, {"id": 808, "start": 4859.0, "end": 4866.0, "text": "Jetzt ist es grün auf einmal."}, {"id": 809, "start": 4866.0, "end": 4874.0, "text": "Ach, guckt hat funktioniert."}, {"id": 810, "start": 4874.0, "end": 4877.0, "text": "Die andere wollte ich irgendwie ausgründen."}, {"id": 811, "start": 4877.0, "end": 4880.0, "text": "Die Domain einfach noch keine Ahnung."}, {"id": 812, "start": 4880.0, "end": 4882.0, "text": "Ich gucke jetzt nicht nach, was da..."}, {"id": 813, "start": 4882.0, "end": 4883.0, "text": "Von wem ist sie denn?"}, {"id": 814, "start": 4883.0, "end": 4885.0, "text": "Wir hatten die E-Mail geschickt."}, {"id": 815, "start": 4885.0, "end": 4886.0, "text": "Von dir?"}, {"id": 816, "start": 4886.0, "end": 4887.0, "text": "Ah, nice."}, {"id": 817, "start": 4887.0, "end": 4888.0, "text": "Guck, funktioniert alles."}, {"id": 818, "start": 4888.0, "end": 4892.0, "text": "Wenn man den ganzen Mist nicht schon vorher drinne hat."}, {"id": 819, "start": 4892.0, "end": 4895.0, "text": "Da hat sich die Sachen jetzt aus dem E-Mail-Postfach geholt."}, {"id": 820, "start": 4895.0, "end": 4898.0, "text": "Hat hier die Hosenlosen, Neu Ulm."}, {"id": 821, "start": 4898.0, "end": 4901.0, "text": "Ja klar, die hatten wir doch vorher auch schon mal drinne."}, {"id": 822, "start": 4901.0, "end": 4904.0, "text": "Deswegen hat es nicht funktioniert."}, {"id": 823, "start": 4904.0, "end": 4906.0, "text": "Neu Ulm, Aschaffenburg."}, {"id": 824, "start": 4906.0, "end": 4910.0, "text": "Irgendwie hat er Probleme mit Aschaffenburg als Marker anzuzeigen."}, {"id": 825, "start": 4910.0, "end": 4916.0, "text": "Gmail ist hier drinne und funktioniert."}, {"id": 826, "start": 4916.0, "end": 4920.0, "text": "Also das automatische Erkennen aus dem E-Mail-Postfach klappt."}, {"id": 827, "start": 4920.0, "end": 4925.0, "text": "Ja, jetzt brauche ich nur noch..."}, {"id": 828, "start": 4925.0, "end": 4927.0, "text": "Jetzt müssen wir nur noch eine neue Version basteln."}, {"id": 829, "start": 4927.0, "end": 4929.0, "text": "Die nicht kaputt ist."}, {"id": 830, "start": 4929.0, "end": 4931.0, "text": "Dass es noch ein paar Leute mehr ausprobieren können."}, {"id": 831, "start": 4931.0, "end": 4934.0, "text": "Kann man dann auch mehrere E-Mails angeben?"}, {"id": 832, "start": 4934.0, "end": 4935.0, "text": "Aktuell geht das nicht."}, {"id": 833, "start": 4935.0, "end": 4939.0, "text": "Da hatte ich heute Morgen keinen Bock mehr das einzubauen."}, {"id": 834, "start": 4939.0, "end": 4941.0, "text": "Aber das brauche ich in Zukunft ein."}, {"id": 835, "start": 4941.0, "end": 4942.0, "text": "Dass du mehrere E-Mails angeben kannst."}, {"id": 836, "start": 4942.0, "end": 4946.0, "text": "Das ist übrigens absichtlich, dass das weg ist."}, {"id": 837, "start": 4946.0, "end": 4953.0, "text": "Weil ich jetzt die Config-Datei aufmache und mein Passwort raus schmeiße, bevor ich es uploade."}, {"id": 838, "start": 4953.0, "end": 4981.0, "text": "Big Brain."}, {"id": 839, "start": 4981.0, "end": 4983.0, "text": "So."}, {"id": 840, "start": 4983.0, "end": 4986.0, "text": "Irgendwann liegt da noch was, ja."}, {"id": 841, "start": 4986.0, "end": 4988.0, "text": "Kannst du das Passwort nicht ins Git Ignore machen?"}, {"id": 842, "start": 4988.0, "end": 4991.0, "text": "Nee, das wäre irgendwie beknackt, weil das Git Ignore muss ja auch kommitten."}, {"id": 843, "start": 4991.0, "end": 4993.0, "text": "Okay, ich mache mal..."}, {"id": 844, "start": 4993.0, "end": 4997.0, "text": "Wir machen mal eine neue Version."}, {"id": 845, "start": 4997.0, "end": 4998.0, "text": "Git Status."}, {"id": 846, "start": 4998.0, "end": 5002.0, "text": "Oh, habe ich hier überhaupt..."}, {"id": 847, "start": 5002.0, "end": 5005.0, "text": "Habe ich hier überhaupt mein Zeug drinne?"}, {"id": 848, "start": 5005.0, "end": 5010.0, "text": "Git Config User Name."}, {"id": 849, "start": 5010.0, "end": 5012.0, "text": "Wo bloß? Ja, okay."}, {"id": 850, "start": 5012.0, "end": 5013.0, "text": "E-Mail."}, {"id": 851, "start": 5013.0, "end": 5014.0, "text": "Wo bloß? Okay."}, {"id": 852, "start": 5014.0, "end": 5016.0, "text": "Alles klar, ich habe das Richtige drin."}, {"id": 853, "start": 5016.0, "end": 5017.0, "text": "Sehr schön."}, {"id": 854, "start": 5017.0, "end": 5018.0, "text": "Habe ich das verpasst?"}, {"id": 855, "start": 5018.0, "end": 5024.0, "text": "Ja, ich mache jetzt eine neue Version, die die Sachen fixt."}, {"id": 856, "start": 5024.0, "end": 5027.0, "text": "Wie die Sachen mit den E-Mails fixt."}, {"id": 857, "start": 5027.0, "end": 5035.0, "text": "Du hattest recht, das buggt rum das Web-Interface, wenn man E-Mail-Sachen einschaltet."}, {"id": 858, "start": 5035.0, "end": 5042.0, "text": "Deswegen haben wir das jetzt gefixt."}, {"id": 859, "start": 5042.0, "end": 5043.0, "text": "Ach so, Redi."}, {"id": 860, "start": 5043.0, "end": 5045.0, "text": "Ja, das konnte man tatsächlich machen."}, {"id": 861, "start": 5045.0, "end": 5050.0, "text": "Die ist einmalig drinne und danach wird es Ignored."}, {"id": 862, "start": 5050.0, "end": 5051.0, "text": "Der Patch ist nicht delayed."}, {"id": 863, "start": 5051.0, "end": 5056.0, "text": "Jetzt müssen wir erstmal den Season Pass verkaufen."}, {"id": 864, "start": 5056.0, "end": 5057.0, "text": "Okay."}, {"id": 865, "start": 5057.0, "end": 5058.0, "text": "Publish."}, {"id": 866, "start": 5058.0, "end": 5072.0, "text": "Wir machen mal nur die Windows-Version."}, {"id": 867, "start": 5072.0, "end": 5074.0, "text": "Und nun gehen wir mal hier hin."}, {"id": 868, "start": 5074.0, "end": 5080.0, "text": "Bin, Release, Headcore, Windows, x64."}, {"id": 869, "start": 5080.0, "end": 5082.0, "text": "Machen wir hier den Krempl mal aus."}, {"id": 870, "start": 5082.0, "end": 5084.0, "text": "Ist er aus?"}, {"id": 871, "start": 5084.0, "end": 5086.0, "text": "Und wir starten es mal."}, {"id": 872, "start": 5086.0, "end": 5088.0, "text": "Mal gucken, ob es hier funktioniert."}, {"id": 873, "start": 5088.0, "end": 5092.0, "text": "Ja, okay, sehr schön."}, {"id": 874, "start": 5092.0, "end": 5094.0, "text": "Sehr gut."}, {"id": 875, "start": 5094.0, "end": 5097.0, "text": "Dann löschen wir mal den ganzen Crap."}, {"id": 876, "start": 5097.0, "end": 5102.0, "text": "Ich muss mir da mal irgendwas Gescheites zum Deployen überlegen."}, {"id": 877, "start": 5102.0, "end": 5109.0, "text": "Habe ich jetzt übrigens gerade gelöscht."}, {"id": 878, "start": 5109.0, "end": 5114.0, "text": "Das ist übelst verwirrend hier, die ganzen Ordner."}, {"id": 879, "start": 5114.0, "end": 5121.0, "text": "Den Publish-Ordner brauchen wir."}, {"id": 880, "start": 5121.0, "end": 5123.0, "text": "Publish-Ordner brauchen wir."}, {"id": 881, "start": 5123.0, "end": 5126.0, "text": "Und jetzt brauchen wir den Versand-Tracksore."}, {"id": 882, "start": 5126.0, "end": 5129.0, "text": "Da machen wir einen neuen Shortcut."}, {"id": 883, "start": 5129.0, "end": 5130.0, "text": "Hier oben drüber."}, {"id": 884, "start": 5130.0, "end": 5132.0, "text": "Und jetzt müssen wir den Shortcut anpassen."}, {"id": 885, "start": 5132.0, "end": 5133.0, "text": "Wie macht man das unter Windows eigentlich?"}, {"id": 886, "start": 5133.0, "end": 5135.0, "text": "Ich habe das immer im Leben noch nicht."}, {"id": 887, "start": 5135.0, "end": 5136.0, "text": "Ich verwende nie Shortcuts unter Windows."}, {"id": 888, "start": 5136.0, "end": 5138.0, "text": "Wie macht man das jetzt eigentlich?"}, {"id": 889, "start": 5138.0, "end": 5139.0, "text": "Target."}, {"id": 890, "start": 5139.0, "end": 5144.0, "text": "Kann man da irgendwie relative Pfade angeben?"}, {"id": 891, "start": 5144.0, "end": 5147.0, "text": "Also irgendwie sowas da?"}, {"id": 892, "start": 5147.0, "end": 5154.0, "text": "Geht das unter Windows?"}, {"id": 893, "start": 5154.0, "end": 5157.0, "text": "Kann man nicht?"}, {"id": 894, "start": 5157.0, "end": 5161.0, "text": "Ja, wie macht man dann überhaupt eine richtige Verknüpfung?"}, {"id": 895, "start": 5161.0, "end": 5166.0, "text": "Unter Windows, wenn man das nicht relativ machen kann?"}, {"id": 896, "start": 5166.0, "end": 5168.0, "text": "Gar nicht, oder wie?"}, {"id": 897, "start": 5168.0, "end": 5177.0, "text": "Das wäre beklagt."}, {"id": 898, "start": 5177.0, "end": 5185.0, "text": "Relative Path Shortcut"}, {"id": 899, "start": 5185.0, "end": 5191.0, "text": "Relative Shortcut Path to Excel"}, {"id": 900, "start": 5191.0, "end": 5196.0, "text": "Windows Shortcuts do not use relative path."}, {"id": 901, "start": 5196.0, "end": 5206.0, "text": "Was ist denn das für ein Blödsinn?"}, {"id": 902, "start": 5206.0, "end": 5209.0, "text": "Ja gut, dann machen wir halt keinen."}, {"id": 903, "start": 5209.0, "end": 5212.0, "text": "Auch okay."}, {"id": 904, "start": 5212.0, "end": 5217.0, "text": "Da muss man halt den Versand-Tracksore hier drinnen starten, den kein Mensch findet."}, {"id": 905, "start": 5217.0, "end": 5221.0, "text": "Da müssen wir es so machen, Leute."}, {"id": 906, "start": 5221.0, "end": 5223.0, "text": "In Zukunft wird das eh anders gemacht."}, {"id": 907, "start": 5223.0, "end": 5236.0, "text": "In Zukunft gibt es das einfach als Single-Exe, die man einfach nur noch starten muss und gut ist."}, {"id": 908, "start": 5236.0, "end": 5240.0, "text": "Der nächste Link hat was zu Shortcuts USB."}, {"id": 909, "start": 5240.0, "end": 5243.0, "text": "Was? Wo?"}, {"id": 910, "start": 5243.0, "end": 5252.0, "text": "Was ist das mit USB?"}, {"id": 911, "start": 5252.0, "end": 5261.0, "text": "Nee, ich mache da kein CMD-Skript oder so."}, {"id": 912, "start": 5261.0, "end": 5265.0, "text": "Bist du blind? Da steht nichts mit USB, sonst würde mein Browser das ja finden."}, {"id": 913, "start": 5265.0, "end": 5267.0, "text": "Oder auch nicht?"}, {"id": 914, "start": 5267.0, "end": 5275.0, "text": "Bomsackt."}, {"id": 915, "start": 5275.0, "end": 5277.0, "text": "Ach da."}, {"id": 916, "start": 5277.0, "end": 5287.0, "text": "Da steht ja auch nichts USB."}, {"id": 917, "start": 5287.0, "end": 5295.0, "text": "Ach guck."}, {"id": 918, "start": 5295.0, "end": 5305.0, "text": "Ach guck. Geht das also doch?"}, {"id": 919, "start": 5305.0, "end": 5318.0, "text": "Okay, Versand-Tracksore, Shortcut, zack, zack."}, {"id": 920, "start": 5318.0, "end": 5322.0, "text": "Okay, und jetzt?"}, {"id": 921, "start": 5322.0, "end": 5327.0, "text": "Und jetzt einfach nur so?"}, {"id": 922, "start": 5327.0, "end": 5337.0, "text": "Nö. Gebaidet. Gebaidet. Funktioniert nicht."}, {"id": 923, "start": 5337.0, "end": 5342.0, "text": "Oder muss ich sagen Versand-Tracksore-Exe?"}, {"id": 924, "start": 5342.0, "end": 5345.0, "text": "Nee."}, {"id": 925, "start": 5345.0, "end": 5349.0, "text": "Hä?"}, {"id": 926, "start": 5349.0, "end": 5368.0, "text": "Kann man hier relativ pass nehmen?"}, {"id": 927, "start": 5368.0, "end": 5372.0, "text": "Windows kann das nicht. Windows suckt."}, {"id": 928, "start": 5372.0, "end": 5383.0, "text": "Übelster Crap. Warum kann Windows kein Relati... Das ist übelster Fail-Crap-Kacke da immer."}, {"id": 929, "start": 5383.0, "end": 5387.0, "text": "Warum sollte man auch relative Links brauchen, ja?"}, {"id": 930, "start": 5387.0, "end": 5393.0, "text": "Relative Links. Warum... Alter, Windows."}, {"id": 931, "start": 5393.0, "end": 5399.0, "text": "Wonka-Win."}, {"id": 932, "start": 5399.0, "end": 5405.0, "text": "Mal Klima-Alarm kurz anschmeißen."}, {"id": 933, "start": 5405.0, "end": 5414.0, "text": "Okay, so. Ich uploade mal die neue Version. Die, die jetzt funktioniert für Windows."}, {"id": 934, "start": 5414.0, "end": 5416.0, "text": "Äh, ach so."}, {"id": 935, "start": 5416.0, "end": 5419.0, "text": "Ich bin gar nicht eingeloggt."}, {"id": 936, "start": 5419.0, "end": 5422.0, "text": "Äh. Sign in."}, {"id": 937, "start": 5422.0, "end": 5429.0, "text": "Wo bloß? Äh, Moment. Muss ich mal kurz mein Keypass-Passport aufmachen."}, {"id": 938, "start": 5429.0, "end": 5432.0, "text": "Passport save."}, {"id": 939, "start": 5432.0, "end": 5441.0, "text": "Github."}, {"id": 940, "start": 5441.0, "end": 5444.0, "text": "Zack. Nix geleakt."}, {"id": 941, "start": 5444.0, "end": 5450.0, "text": "Alles save."}, {"id": 942, "start": 5450.0, "end": 5453.0, "text": "Äh, Versand-Tracksore."}, {"id": 943, "start": 5453.0, "end": 5456.0, "text": "Release."}, {"id": 944, "start": 5456.0, "end": 5458.0, "text": "Edit."}, {"id": 945, "start": 5458.0, "end": 5462.0, "text": "So. Dann schmeißen wir das jetzt weg."}, {"id": 946, "start": 5462.0, "end": 5466.0, "text": "Das ist nämlich das Kaputten, ne?"}, {"id": 947, "start": 5466.0, "end": 5479.0, "text": "Und uploaden das Neue."}, {"id": 948, "start": 5479.0, "end": 5482.0, "text": "So. Ich hoffe, der Stream ruckelt nicht dabei jetzt."}, {"id": 949, "start": 5482.0, "end": 5487.0, "text": "Wenn der uploadet."}, {"id": 950, "start": 5487.0, "end": 5492.0, "text": "Ah, Keypass. Keypass Beste."}, {"id": 951, "start": 5492.0, "end": 5495.0, "text": "Äh, ich muss mal gucken, ob ich nicht irgendwelche..."}, {"id": 952, "start": 5495.0, "end": 5498.0, "text": "Äh, Subs vergessen hab. Wen haben wir denn? Rafa1704."}, {"id": 953, "start": 5498.0, "end": 5502.0, "text": "Weiß ich, ob ich nicht vorgelesen hab, aber wenn nicht, Dankeschön für den Sub."}, {"id": 954, "start": 5502.0, "end": 5506.0, "text": "Sinom472. Dankeschön."}, {"id": 955, "start": 5506.0, "end": 5519.0, "text": "Hitkashii, den hatten wir schon. Softbubble hatten wir auch schon."}, {"id": 956, "start": 5519.0, "end": 5548.0, "text": "Reslekt."}, {"id": 957, "start": 5548.0, "end": 5563.0, "text": "N Row."}, {"id": 958, "start": 5563.0, "end": 5588.32, "text": "Okay, hoffentlich läuft das besser während der Upload funktioniert, während der Upload"}, {"id": 959, "start": 5588.32, "end": 5604.08, "text": "läuft. Okay, der Upload ist eh gleich fertig. Was ist denn, wenn in der E-Mail nicht steht,"}, {"id": 960, "start": 5604.08, "end": 5607.2, "text": "womit das verschickt wird, sondern gleich so ein Tracking-Link geschickt wird? Naja,"}, {"id": 961, "start": 5607.2, "end": 5611.76, "text": "wenn in dem Tracking-Link selbst nicht der Name des Anbieters vorkommt, dann funktioniert"}, {"id": 962, "start": 5611.76, "end": 5616.28, "text": "es nicht. Aber ich glaube, es gibt doch kein Tracking-Link, wo nicht DHL, DPD oder so drinnen"}, {"id": 963, "start": 5616.28, "end": 5621.4, "text": "vorkommt. Also es muss irgendwo in der E-Mail stehen. Es muss gar nicht durch Leerzeichen"}, {"id": 964, "start": 5621.4, "end": 5624.92, "text": "getrennt sein oder irgendwas. Es muss nur irgendwo in der E-Mail vorkommen, irgendwo"}, {"id": 965, "start": 5624.92, "end": 5638.6, "text": "im Text von der E-Mail. Der Upload ist wahnsinnig geschwind, ne? Ist dort auch die Tracking-Nummer"}, {"id": 966, "start": 5638.6, "end": 5647.4, "text": "vorhanden? Ja, ich hoffe mal. Also er muss Tracking-Nummer finden und Name vom Versanddienstleister"}, {"id": 967, "start": 5647.4, "end": 5652.28, "text": "finden. Ansonsten wären die False-Positives viel zu hoch. Ansonsten würde er ja jede"}, {"id": 968, "start": 5652.28, "end": 5666.32, "text": "E-Mail als Tracking-E-Mail einstufen. Bin ich der Einzige, der in einem Dorf ein 200"}, {"id": 969, "start": 5666.32, "end": 5672.52, "text": "Emmet Upload hat? 200 Emmet ist nice. Ich habe nächste Woche 400 Down 40 Up. Ich bin"}, {"id": 970, "start": 5672.52, "end": 5677.92, "text": "da gewechselt von der Telekom. Bei Telekom hätte ich 250 Down 100 Up bekommen können,"}, {"id": 971, "start": 5677.92, "end": 5691.68, "text": "aber Unity Media ist das bessere Gesamtpaket bei mir. Da habe ich gebacken. Come on, brah."}, {"id": 972, "start": 5691.68, "end": 5712.28, "text": "Die neue Winners-Version ist am Start. Jetzt mit gefixtem E-Mail abfragen. Jetzt kann"}, {"id": 973, "start": 5712.28, "end": 5734.88, "text": "ich wieder hochstellen. Wer nochmal testen möchte, jetzt bei der neuen Version funktioniert"}, {"id": 974, "start": 5734.88, "end": 5741.76, "text": "auch das E-Mail-Zeug irgendwie kaputt. Deswegen ist es wichtig, den Kram zu testen. Am besten"}, {"id": 975, "start": 5741.76, "end": 5749.24, "text": "testet man den Kram, auch wenn er noch komplett unfertig ist. In der Regel überlebt das die"}, {"id": 976, "start": 5749.24, "end": 5756.44, "text": "erste Begegnung mit der Realität nie, was man so gebastelt hat. Nie. Egal, was du machst."}, {"id": 977, "start": 5756.44, "end": 5760.6, "text": "Deswegen ist es immer nicht verkehrt, den Kram so früh wie es geht. Sobald es basic"}, {"id": 978, "start": 5760.6, "end": 5764.48, "text": "Funktionalität hat, den Kram einfach mal von irgendjemanden testen zu lassen, der es"}, {"id": 979, "start": 5764.48, "end": 5770.8, "text": "nicht selbst programmiert hat oder nicht mit programmiert hat. Ich würde es normalerweise"}, {"id": 980, "start": 5770.8, "end": 5774.32, "text": "nicht auf einem Twitch-Stream machen. Ich würde es normalerweise mit ein, zwei Leuten"}, {"id": 981, "start": 5774.32, "end": 5780.04, "text": "machen, die ich kenne, weil es ist viel einfacher so etwas zu debuggen dann auch vor Ort. Aber"}, {"id": 982, "start": 5780.04, "end": 5801.16, "text": "jetzt in dem Fall. Ja guck mal, meine Tests sind schon ganz schön ausgereift hier. Ich"}, {"id": 983, "start": 5801.16, "end": 5822.72, "text": "habe ein Projekt, das nennt sich Tests und da drinnen gibt es null Tests. So wie bei"}, {"id": 984, "start": 5822.72, "end": 5827.04, "text": "mir auch. Ich würde mal behaupten, dass sie Standard. Außerdem, wozu braucht man Tests,"}, {"id": 985, "start": 5827.04, "end": 5846.36, "text": "wenn man Write-Line-Debug-Messages hat. Hat wer eine Idee, was das sein könnte, wenn ich"}, {"id": 986, "start": 5846.36, "end": 5851.76, "text": "bei meinen zwei Monitoren mit Displayport anschließe und dann einen der Monitore kurz"}, {"id": 987, "start": 5851.76, "end": 5854.88, "text": "ausschalte, wieder einschalte, wandert kurz der Desktop komplett von dem einen auf den"}, {"id": 988, "start": 5854.88, "end": 5861.16, "text": "anderen Bildschirm. Das ist bestimmt irgendein Windows-Crap. Wahrscheinlich, weil bei Windows"}, {"id": 989, "start": 5861.16, "end": 5866.16, "text": "der Desktop immer auf dem rechten Bildschirm angezeigt wird oder so. Und wenn das dann"}, {"id": 990, "start": 5866.16, "end": 5870.0, "text": "einmal switcht, dann checkt das kurz nicht. Das ist wahrscheinlich irgendein typischer"}, {"id": 991, "start": 5870.0, "end": 5880.2, "text": "Windows-Mist, an dem man nichts ändern kann. Aber Leute, ich bin schon mal echt froh,"}, {"id": 992, "start": 5880.2, "end": 5887.32, "text": "dass so viele ausprobiert haben. Ich meine, es haben einige mittlerweile den, ich weiß"}, {"id": 993, "start": 5887.32, "end": 5891.04, "text": "nicht, wie viele es jetzt wirklich ausprobiert haben, aber vorneweg 10 Stück, den Kram ausprobiert,"}, {"id": 994, "start": 5891.04, "end": 5895.16, "text": "dass es überhaupt trackt und ein paar auch, dass die E-Mails kaputt sind, allerdings"}, {"id": 995, "start": 5895.16, "end": 5907.28, "text": "die E-Mails jetzt gehen sollten. Es ist schon mal schön zu wissen, dass es geht. Also bei"}, {"id": 996, "start": 5907.28, "end": 5935.56, "text": "mir findet er nichts. Aber läuft es bei dir jetzt wenigstens? Er findet nichts. Kann man"}, {"id": 997, "start": 5935.56, "end": 5941.24, "text": "an sich selbst die E-Mails schicken? Ja. Wie alt sind denn die E-Mails? Hast du innerhalb"}, {"id": 998, "start": 5941.24, "end": 5949.32, "text": "der letzten 30 Tage eine Versandbeschätigung bekommen? Entweder von, wo eine Versandbeschätigung"}, {"id": 999, "start": 5949.32, "end": 5954.12, "text": "bekommen oder irgendeine Mail bekommen, wo DPD, DHL oder Hermes drinsteht, ohne eine"}, {"id": 1000, "start": 5954.12, "end": 5961.12, "text": "gültige Trackingnummer? Der guckt standardmäßig nur die letzten 30 Tage. Das könnte dich"}, {"id": 1001, "start": 5961.12, "end": 5967.84, "text": "auch noch konfigurierbar machen, in welchem Zeitraum er initial scannt. OBS oder Streamlabs,"}, {"id": 1002, "start": 5967.84, "end": 5973.04, "text": "immer das Offizielle. Ich sehe den Sinn nicht davon, den Streamlabs-Ding zu verwenden. Außer"}, {"id": 1003, "start": 5973.04, "end": 5978.76, "text": "dass es ein bisschen schöner vorkonfiguriert ist. Den Portnet kannst du auch noch nicht"}, {"id": 1004, "start": 5978.76, "end": 5981.8, "text": "einstellen. Du kannst noch nichts machen. Du kannst es auch nicht mal komplett global"}, {"id": 1005, "start": 5981.8, "end": 5989.68, "text": "lauschen lassen. Du kannst wirklich nur Basic-Funktionalitäten gerade ausprobieren. Deswegen habe ich heute"}, {"id": 1006, "start": 5989.68, "end": 5995.2, "text": "auch mal den Stream gemacht dazu. Ich will einfach nur mal gucken, ob das, wisst ihr"}, {"id": 1007, "start": 5995.2, "end": 5998.76, "text": "das Problem ist? Bei einem selbst kann das wunderbar funktionieren und sobald es jemand"}, {"id": 1008, "start": 5998.76, "end": 6001.84, "text": "anderes ausprobiert, funktioniert es nicht. Deswegen wollte ich einfach mal wissen, ob"}, {"id": 1009, "start": 6001.84, "end": 6005.4, "text": "es jetzt auch bei anderen funktioniert als bei mir oder scheint ja der Fall zu sein."}, {"id": 1010, "start": 6005.4, "end": 6015.12, "text": "Deswegen ist das ja auch 001alpha1. Deine letzte Bestellung ist zwei Monate her. Vorbaute"}, {"id": 1011, "start": 6015.12, "end": 6023.6, "text": "dir einfach eine Bestellungs-E-Mail. Vorbaute dir selbst eine Bestellungs-E-Mail. Dann ist"}, {"id": 1012, "start": 6023.6, "end": 6033.04, "text": "die von heute. Aber Leute, ohne Scheiß, dass es auf meinem Staubsauger läuft, ist schon"}, {"id": 1013, "start": 6033.04, "end": 6042.32, "text": "mega geil. Das muss man echt sagen. Das hat mich verdammt überrascht, das hat mich wirklich"}, {"id": 1014, "start": 6042.32, "end": 6046.44, "text": "extrem überrascht, dass ich das Ding auf meinen Staubsauger kopiert habe, gestartet habe und"}, {"id": 1015, "start": 6046.44, "end": 6054.52, "text": "es ging. Es ging einfach. Die DHL-Mail von Mittwoch findet ihr nicht getestet, auch wenn"}, {"id": 1016, "start": 6054.52, "end": 6059.32, "text": "aus... Hast du die Config-Datei angepasst und dein Name reingeschrieben oder steht da"}, {"id": 1017, "start": 6059.32, "end": 6070.68, "text": "noch Max drinne in der Config-Datei? Wozu braucht ein Staubsauger ein US? Ja, weil es ein Smart-Staubsauger"}, {"id": 1018, "start": 6070.68, "end": 6078.0, "text": "ist. Wann kommt Minecraft auf den Staubsauger? Ich muss gucken, ob das Ding einen USB-Stick"}, {"id": 1019, "start": 6078.0, "end": 6093.44, "text": "oder eine USB-Festplatte erkennt. Hab ich noch nicht gemacht. Einmal mit Vorname, einmal"}, {"id": 1020, "start": 6093.44, "end": 6100.12, "text": "mit Nachname. Steht... Und in der E-Mail steht auch der Name drin? Komisch. Wie gesagt,"}, {"id": 1021, "start": 6100.12, "end": 6105.84, "text": "ich habe es ja gerade bei mir ausprobiert. Mit Gmail tut das ja. Ich baue für diese"}, {"id": 1022, "start": 6105.84, "end": 6114.76, "text": "E-Mail-Scan-Sachen noch ein bisschen nützlichere Debug-Ausgaben ein. Erkennt er die E-Mail"}, {"id": 1023, "start": 6114.76, "end": 6124.08, "text": "denn in der Konsole? Hast du das gesehen? Erkennt er in der Konsole? Also kommt das hier?"}, {"id": 1024, "start": 6124.08, "end": 6148.24, "text": "Kommt diese Shipment-Found oder sowas? Aber an sich sollte das funktionieren. Ich habe"}, {"id": 1025, "start": 6148.24, "end": 6162.08, "text": "es ja gerade nochmal mit Gmail ausprobiert. Mir fällt halt nichts besseres ein, wie man"}, {"id": 1026, "start": 6162.08, "end": 6168.4, "text": "das festmachen könnte an den E-Mails. Wie gesagt, aktuell guckt er halt nach. Enthält"}, {"id": 1027, "start": 6168.4, "end": 6175.12, "text": "das den Regex für eine DHL-Trackingnummer? Er zeigt der Konsole nichts an, hat das Log"}, {"id": 1028, "start": 6175.12, "end": 6178.52, "text": "von meinem E-Mail-Server offen, die Verbindung wartet, er aufruft die E-Mails ab. Aber im"}, {"id": 1029, "start": 6178.52, "end": 6184.96, "text": "Track soll er nicht angezeigt werden. Dann matcht irgendwas nicht. Von welchem... Was"}, {"id": 1030, "start": 6184.96, "end": 6200.72, "text": "ist das drinne? Was ist das? DPD, DHL? Ja, Amazon Tracking ist schon vorhanden im GUI,"}, {"id": 1031, "start": 6200.72, "end": 6218.32, "text": "aber Tracking noch nicht. Der sollte, seh was ich nochmal mache. Wir bauen hier nochmal"}, {"id": 1032, "start": 6218.32, "end": 6234.32, "text": "eine Debug-Ausgabe ein, wo das Subject drinne steht von der Mail, dass man sieht, dass er"}, {"id": 1033, "start": 6234.32, "end": 6251.56, "text": "die Mail abgerufen hat vom Server. Er findet nix. Das ist echt merkwürdig. Hast du zufällig"}, {"id": 1034, "start": 6251.56, "end": 6278.92, "text": "die Sendungsnummer schon mal von Hand eingefügt davor? Ja, Amazon Tracking baue ich noch."}, {"id": 1035, "start": 6278.92, "end": 6282.84, "text": "Amazon Tracking will ich ja auch selbst hauptsächlich. Also es ist eines der Gründe, warum ich das"}, {"id": 1036, "start": 6282.84, "end": 6290.04, "text": "gemacht habe, weil keiner unterstützt richtiges Amazon Tracking. Und Amazon Tracking ist auch"}, {"id": 1037, "start": 6290.04, "end": 6297.56, "text": "kacke. Amazon hat keinerlei AP für ihr Tracking. Du musst komplett dir den Mist aus dem Tracking-Link"}, {"id": 1038, "start": 6297.56, "end": 6301.24, "text": "aus der HTML-Seite, die generiert wird über den Tracking-Link, musst du dir den Mist"}, {"id": 1039, "start": 6301.24, "end": 6328.64, "text": "rausparsen. Das ist richtiger Crap. Aber Tracking Amazon nicht nur von den APs der"}, {"id": 1040, "start": 6328.64, "end": 6333.44, "text": "Transportdienste. Nee, nee. Amazon hat mittlerweile selbst Amazon Logistics. Die fahren selbst"}, {"id": 1041, "start": 6333.44, "end": 6341.4, "text": "aus. Du verwendest ALL. Wo denn? Was meinste? Vielleicht hat er die Sendungsnummer zweimal"}, {"id": 1042, "start": 6341.4, "end": 6368.96, "text": "drinne. Wo mache ich was? Scanner found. Ach hier. Jaja, klar, das kann schon sein."}, {"id": 1043, "start": 6368.96, "end": 6374.92, "text": "Wenn er die schon mal drinne hat, funktioniert es nicht. Deswegen meinte ich ja eben hast,"}, {"id": 1044, "start": 6374.92, "end": 6379.8, "text": "ob die Nummer vorher schon mal hinzugefügt wurde oder so. Dann sollte sie zumindest"}, {"id": 1045, "start": 6379.8, "end": 6384.28, "text": "einmal im Web-Interface stehen. Also das habe ich absichtlich eingebaut, dass er nicht"}, {"id": 1046, "start": 6384.28, "end": 6397.12, "text": "Sachen doppeltrackt. Ähm, finde trotzdem nicht, die Sendungsnummer geht aber. Dann"}, {"id": 1047, "start": 6397.12, "end": 6400.32, "text": "müssen wir das nächste Mal nochmal ausprobieren, wenn ich ein bisschen mehr Debug-Ausgaben"}, {"id": 1048, "start": 6400.32, "end": 6415.36, "text": "eingebaut habe, dass ich genau sehe, worab er bei dir abkackt. Reptile Hunter, Twitch"}, {"id": 1049, "start": 6415.36, "end": 6433.68, "text": "Prime, Dankeschön. Warte, warte, ob du das... Klar, wenn du das kannst, du kannst das klonen"}, {"id": 1050, "start": 6433.68, "end": 6441.32, "text": "von GitHub. Du brauchst allerdings, äh, noch, weil, weil, ähm, DotNightcore 3 noch nicht"}, {"id": 1051, "start": 6441.32, "end": 6448.2, "text": "draußen ist, du brauchst Visual Studio 2019 Preview und du brauchst DotNightcore Preview,"}, {"id": 1052, "start": 6448.2, "end": 6453.84, "text": "DotNightcore 3 Preview. In ein paar Monaten hat sich das erledigt, weil dann ist DotNightcore"}, {"id": 1053, "start": 6453.84, "end": 6458.72, "text": "3 offiziell. Ich weiß gar nicht, wann ist eigentlich DotNightcore 3 Release? Release"}, {"id": 1054, "start": 6458.72, "end": 6472.36, "text": "Date, dauert noch nicht mal lang, ne? Haben die gesagt, wann das kommt? Final? Das ist"}, {"id": 1055, "start": 6472.36, "end": 6478.36, "text": "richtig Bleeding Edge. September, ja, also in einem Monat, in einem Monat, spätestens"}, {"id": 1056, "start": 6478.36, "end": 6485.36, "text": "in einem Monat, braucht man halt diese Preview-Varianten nicht mehr. Aber ich baue noch ein bisschen"}, {"id": 1057, "start": 6485.36, "end": 6489.92, "text": "mehr Debug-Ausgaben ein, dass man das, dass man das besser nachvollziehen kann. Aber,"}, {"id": 1058, "start": 6489.92, "end": 6493.6, "text": "ja, danke fürs Testen schon mal. Also wir haben ja schon viele Sachen gefunden jetzt."}, {"id": 1059, "start": 6493.6, "end": 6517.16, "text": "Ohje. Habe ich noch nie verwendet, muss man mal ausprobieren. Auf GitHub, äh, achso,"}, {"id": 1060, "start": 6517.16, "end": 6534.6, "text": "warte mal. Achso, äh. Gucken, dass da nichts leake oder so? Ne, habe ich noch nicht. Bin"}, {"id": 1061, "start": 6534.6, "end": 6548.36, "text": "auch bescheuert. A-M, was haben wir denn gemacht? Fixed Background Mail Scanning. Broken Web"}, {"id": 1062, "start": 6548.36, "end": 6560.92, "text": "Interweb Frontend Hanging Task. Zack. So schreibt man eine halbwegs ordentliche Comment-Message."}, {"id": 1063, "start": 6560.92, "end": 6568.36, "text": "Nicht, dass man sie jetzt in der Stelle brauchen würde. Jetzt. Was haben wir da jetzt gemacht?"}, {"id": 1064, "start": 6568.36, "end": 6580.0, "text": "Genau, eigentlich haben wir nur den Mist da rausgeschmissen. Wohohohoho. Hui. Hat sich"}, {"id": 1065, "start": 6580.0, "end": 6597.04, "text": "nicht viel getan. Push, pushen wir das Ganze mal. Geht. Push. Master. Bam. Yes. Ich habe"}, {"id": 1066, "start": 6597.04, "end": 6613.56, "text": "meinen Key hier nicht drinnen. Ok. Dann füge ich mal meinen Key hinzu. Wo ist denn der Key"}, {"id": 1067, "start": 6613.56, "end": 6627.32, "text": "da? Der Windows. Richtig, wo da der Key leckt. So. Idee. RSA. Pop. Dann füge ich den Kram"}, {"id": 1068, "start": 6627.32, "end": 6649.0, "text": "nochmal kurz im GitHub hinzu. Profile. Profile. SSH-Keys. New SSH-Key. Zack. Ok, mal gucken,"}, {"id": 1069, "start": 6649.0, "end": 6660.64, "text": "ob ich jetzt pushen darf. Ah, ich habe meinen ReadMe noch nicht gepullt. Jetzt kann ich"}, {"id": 1070, "start": 6660.64, "end": 6665.92, "text": "euch mal einen krassen Git-Hexor-Trick anzeigen. Die Sache ist jetzt nämlich die, wenn man"}, {"id": 1071, "start": 6665.92, "end": 6673.28, "text": "jetzt einfach pullt, dann macht er ein ganz super hässliches Merch-Commit. Weil ich lokal"}, {"id": 1072, "start": 6673.28, "end": 6676.32, "text": "ein neues Comment habe und niemals ein neues Comment mache. Das sehe ich auf der Arbeit"}, {"id": 1073, "start": 6676.32, "end": 6682.96, "text": "total oft, dass Leute diese sinnlosen Merch-Commits haben. Merch-Master in Master. Das ist voll"}, {"id": 1074, "start": 6682.96, "end": 6689.84, "text": "für den Arsch. Brauchen wir nicht. Man gibt einfach an Git-Pull-Origin-Minus-Rebase und"}, {"id": 1075, "start": 6689.84, "end": 6696.84, "text": "es sollte in dem Fall ja keine Konflikte geben und man hat das Problem nicht. Und jetzt"}, {"id": 1076, "start": 6696.84, "end": 6701.32, "text": "kann ich das Ganze pushen und alles ist gut. Und wir haben kein sinnloses Merch-Commit erzeugt."}, {"id": 1077, "start": 6701.32, "end": 6712.92, "text": "Ich habe Fahr-Informatik in System-Integration gelernt. Ja, richtig. So. Jetzt sollte die"}, {"id": 1078, "start": 6712.92, "end": 6723.4, "text": "neue Variante eigentlich... Ja. Der Code ist oben. Jingle-Kuro. Du kannst... Ja, guckst"}, {"id": 1079, "start": 6723.4, "end": 6731.56, "text": "dem an. Also würde mich interessieren, warum es bei dir rumspackt. Was da nicht passt."}, {"id": 1080, "start": 6731.56, "end": 6740.64, "text": "Ach so. Haben wir einen Mod am Start? Könnten wir das Git-Ausrufezeichen ändern zu dem neuen"}, {"id": 1081, "start": 6740.64, "end": 6753.96, "text": "Track-Tractor? Wobei, ich glaube, meine Mods arbeiten noch alle. Kann das sein? Okay,"}, {"id": 1082, "start": 6753.96, "end": 6756.12, "text": "keine Mods. Das hätte ich jetzt mal nicht so laut sagen sollen."}, {"id": 1083, "start": 6756.12, "end": 6780.12, "text": "Ja, stimmt. Wir machen einfach Ausrufezeichen-Git hier zu Wubblors und dann kann man ja gucken."}, {"id": 1084, "start": 6780.12, "end": 6791.68, "text": "Ja. Das finde ich eine gute Idee. Ja, also Leute, vielen Dank fürs Testen. Hat schon"}, {"id": 1085, "start": 6791.68, "end": 6798.0, "text": "mal einiges gebracht. Wenn ihr Verbesserungsvorschläge habt, haut es rein. Ihr müsst auch nicht"}, {"id": 1086, "start": 6798.0, "end": 6802.44, "text": "auf Englisch schreiben oder so. Das Projekt juckt eh kein Mensch auf GitHub. Ihr könnt"}, {"id": 1087, "start": 6802.44, "end": 6816.76, "text": "das auf Englisch oder auf Deutsch schreiben, wie ihr wollt. Egal. Der Eichler. Das überlege"}, {"id": 1088, "start": 6816.76, "end": 6823.0, "text": "ich mir. Das ist eigentlich gar keine schlechte Idee. Weil du bist so oft da und bisher ist"}, {"id": 1089, "start": 6823.0, "end": 6828.76, "text": "mir auch noch nichts Negatives aufgefallen. Ich glaube, ich mach den Eichler. Ich lasse"}, {"id": 1090, "start": 6828.76, "end": 6839.28, "text": "noch mal durch den Kopf gehen. Aber ich glaube, der Eichler wird neuer Mod. Ich muss mir das"}, {"id": 1091, "start": 6839.28, "end": 6852.28, "text": "mal durch den Kopf gehen lassen. Weil eigentlich haben wir normalerweise genug Mods da. Wir"}, {"id": 1092, "start": 6852.28, "end": 6855.8, "text": "haben doch einen Mod da. Max, weißt du, wie das funktioniert mit den Kommands editieren"}, {"id": 1093, "start": 6855.8, "end": 6865.64, "text": "über den Chat? Könnte man Ausrufezeichen Git auf mein Hauptgit ändern anstatt auf Frisilull?"}, {"id": 1094, "start": 6865.64, "end": 6883.32, "text": "Was verdient man hier als Mod? Ganz viel Cute Chat. Ja, wie gesagt Leute, danke fürs Testen."}, {"id": 1095, "start": 6883.32, "end": 6886.88, "text": "Eigentlich war es das Inhaltsmäßig schon. Ich wollte eigentlich nur mal ausprobieren,"}, {"id": 1096, "start": 6886.88, "end": 6893.32, "text": "ob es nicht nur bei mir funktioniert, ob es auch woanders funktioniert. Zwei Stunden"}, {"id": 1097, "start": 6893.32, "end": 6901.0, "text": "waren wir am Start. Neues Video gibt es heute nicht. Morgen gibt es neues Video. Wir gucken,"}, {"id": 1098, "start": 6901.0, "end": 6905.96, "text": "dass ich keine Prime Subs vergessen habe und auch keinen normalen Subs. Den Reptile Hunter"}, {"id": 1099, "start": 6905.96, "end": 6909.8, "text": "hatten wir schon, glaube ich. The Easy Killer. Ich weiß nicht, ob ich das schon vorgelesen"}, {"id": 1100, "start": 6909.8, "end": 6921.48, "text": "habe, aber wenn nicht, danke schön. Ich habe mir ja überlegt, man müsste so einen Big"}, {"id": 1101, "start": 6921.48, "end": 6931.68, "text": "Brain Overlay machen, der quasi pro Sub immer ein bisschen dicker wird. Also der fängt dann"}, {"id": 1102, "start": 6931.68, "end": 6939.64, "text": "quasi immer so an. Der fängt dann jeden Stream fängt er so an und bei jedem Sub wird"}, {"id": 1103, "start": 6939.64, "end": 6945.84, "text": "er dann so ein Stückchen größer, bis er dann irgendwann so fett ist. Aber der wird"}, {"id": 1104, "start": 6945.84, "end": 6973.68, "text": "ab und zu mal eingeplant, sonst ist es zu nervig. Und was auch eine letztens mal eine geile Idee"}, {"id": 1105, "start": 6973.68, "end": 6977.84, "text": "hat, dass man hier irgendwie so was kleines einblendet, was man irgendwie füttern muss."}, {"id": 1106, "start": 6977.84, "end": 6982.88, "text": "Und ich will noch überlegen, wie. Ich will es nicht mit Subs und Bits machen, das ist"}, {"id": 1107, "start": 6982.88, "end": 6988.56, "text": "zu sellout. Man kann ihn auch mit Chatnachrichten füttern oder so. Irgendwas, was man füttern"}, {"id": 1108, "start": 6988.56, "end": 7003.64, "text": "kann und was dann Dinger tut auf dem Bildschirm. Auf mein Gitterprofil. Auf das"}, {"id": 1109, "start": 7003.64, "end": 7015.6, "text": "normale Gitterprofil. Von da kann man weiter gucken. Schau dir mal High an. Wozu, was ist"}, {"id": 1110, "start": 7015.6, "end": 7033.8, "text": "das? Das Projekt läuft schon mal sehr nice. Klappt der Checker auch mit Bestellung von"}, {"id": 1111, "start": 7033.8, "end": 7043.68, "text": "Amoreli oder Ice.de, wenn die über. Ach okay, jetzt weiß ich was. Ich habe gerade mal nebenbei"}, {"id": 1112, "start": 7043.68, "end": 7049.32, "text": "ein Google Ding so, jetzt weiß ich was das ist. Die Sache ist die, das funktioniert"}, {"id": 1113, "start": 7049.32, "end": 7065.2, "text": "ja prinzipiell mit allem, solange es eben DHL, DPD, Hermes oder UPS ist. Oder Amazon."}, {"id": 1114, "start": 7065.2, "end": 7088.88, "text": "Was wäre deine Maximum Sellout Taktik? Keine Ahnung. Noch keine habe ich mir noch nichts"}, {"id": 1115, "start": 7088.88, "end": 7100.32, "text": "überlegt. Für meine Maximum Sellout Taktik wäre, für 200 gegiftete Subs kriegt man Mod"}, {"id": 1116, "start": 7100.32, "end": 7122.4, "text": "und für 1000 gegiftete Subs kriegt man ein Custom ASMR Video. Wupplull."}, {"id": 1117, "start": 6123.3, "end": 7141.88, "text": "Fügt mal meinen Gyros mal hinzu. Hat dein Gyros mal eine Online-AP, wo man"}, {"id": 1118, "start": 7141.88, "end": 7148.28, "text": "tracken kann, wo dein Gyros ist? Das fände ich nämlich eine super nice Idee, aber ich"}, {"id": 1119, "start": 7148.28, "end": 7178.12, "text": "vermute mal hat er nicht. Was Lul, der Follower hat er gefollowed. Somebody"}, {"id": 1120, "start": 7178.12, "end": 7190.32, "text": "touched my Spaghetti. Ja, es gibt User-Names auf Twitch. Ach komm mal, der Patrick ist"}, {"id": 1121, "start": 7190.32, "end": 7204.08, "text": "da. Du Spaß, Alter. Du Vogel, Mann, du Vogel. Ja, und für 100, für 1337 Subs dürft ihr"}, {"id": 1122, "start": 7204.08, "end": 7208.44, "text": "mal auf mein Hightech-Klo gehen. Unabhängig davon, dass man sich für das Geld schon selbst"}, {"id": 1123, "start": 7208.44, "end": 7218.48, "text": "ein Hightech-Klo kaufen könnte, aber wer will das nicht? Easy. Ja, Mod-freie Zeit ist"}, {"id": 1124, "start": 7218.48, "end": 7226.28, "text": "vorbei. Jetzt sind die Mods am Start. Also Leute, wer es ausprobieren möchte, kann"}, {"id": 1125, "start": 7226.28, "end": 7229.64, "text": "es gerne ausprobieren. Ihr wisst ja, ich habe es euch ja gezeigt, hier unter Release,"}, {"id": 1126, "start": 7229.64, "end": 7234.56, "text": "einfach die aktuelle Windows-Version mal ziehen und ausprobieren. Wer selbst ein bisschen"}, {"id": 1127, "start": 7234.56, "end": 7239.36, "text": "drin rumbasteln will, kann sich das Git repo klonen. Ihr braucht dafür allerdings das"}, {"id": 1128, "start": 7239.36, "end": 7250.68, "text": "aktuelle Visual Studio 2019 Preview für.NET Core 3 und ein aktuelles.NET Core 3 Preview."}, {"id": 1129, "start": 7250.68, "end": 7255.72, "text": "Hast du eins mit Sprühwasser? Ja, aber nicht ganz so übertrieben wie die Japaner. Also"}, {"id": 1130, "start": 7255.72, "end": 7264.88, "text": "ich habe keine Möglichkeit, Sounds abzuspielen oder sowas. Ja, danke schön für die ganzen"}, {"id": 1131, "start": 7264.88, "end": 7272.28, "text": "Tests. Ich werde jetzt Schluss machen und noch eine Runde versuchen, ob ich noch mal"}, {"id": 1132, "start": 7272.28, "end": 7279.36, "text": "ein paar Lobbies finde auf der Xbox in Black Ops 1. Aber das mache ich nicht Onstream,"}, {"id": 1133, "start": 7279.36, "end": 7292.08, "text": "weil Onstream rege ich mich immer mehr auf als Offstream, wenn die Games sucken. Okay,"}, {"id": 1134, "start": 7292.08, "end": 7296.6, "text": "wie fühlt sich das an und wie wird es wieder trocken? Trocken wird es entweder mit einem"}, {"id": 1135, "start": 7296.6, "end": 7300.16, "text": "Föhn, das hat einen Föhn eingebaut. Allerdings finde ich das nicht so geil, das dauert so"}, {"id": 1136, "start": 7300.16, "end": 7314.08, "text": "lange. In der Regel wird es einfach trocken mit Klopapier. Warum streamst du nicht Gameplay?"}, {"id": 1137, "start": 7314.08, "end": 7322.88, "text": "Weil heute Programming Stream angesagt war, bzw. Programmed Testing Stream. Wie hart"}, {"id": 1138, "start": 7322.88, "end": 7339.48, "text": "ist das Strahlen? Kannst du einstellen in 7 verschiedenen Stufen. Von soft bis hart."}, {"id": 1139, "start": 7339.48, "end": 7355.88, "text": "Also Bursi, da ist für jeden etwas dabei. Hast du das Klo selbst eingebaut? Nee. Das"}, {"id": 1140, "start": 7355.88, "end": 7362.36, "text": "ist total, für das Klo brauchst du einen Stromanschluss, einen Wasseranschluss und"}, {"id": 1141, "start": 7362.36, "end": 7367.92, "text": "einen Lüftungsanschluss. Ist nicht etwa so, dass man einfach ein Klo anschließt ans Wasser"}, {"id": 1142, "start": 7367.92, "end": 7373.2, "text": "und gut ist. Strom, Wasser, Luftanzugang braucht der Klo, dass er funktioniert. Lüftung,"}, {"id": 1143, "start": 7373.2, "end": 7379.04, "text": "er hat auch eine Lüftung drin, das stinkt im Klo. Kannst du dein Klo flaschen? Ich weiß"}, {"id": 1144, "start": 7379.04, "end": 7383.64, "text": "das nicht ganz gemeint ist, aber ich habe danach gesucht, ob das möglich ist. Gibt"}, {"id": 1145, "start": 7383.64, "end": 7391.64, "text": "nichts dafür. Der ist leider einen Ticken zu alt. Da sind noch keine 0815 China Microcontroller"}, {"id": 1146, "start": 7391.64, "end": 7404.4, "text": "drin, sondern irgendwas von denen selbst gewurstetes. Das beste ist, das Wasser im Klo kann man"}, {"id": 1147, "start": 7404.4, "end": 7411.32, "text": "sogar anwärmen lassen. Ich meine, ihr habt es doch schon mal gesehen. Klo, FPS, wo ist"}, {"id": 1148, "start": 7411.32, "end": 7427.44, "text": "es? Ah, da ist es doch. Hier ist noch das Klo. Da ist es. Hier ist die Fernbedienung"}, {"id": 1149, "start": 7427.44, "end": 7433.28, "text": "vom Klo. Die kann man hier unten noch mal ausklappen, da sind dann mehr Optionen noch"}, {"id": 1150, "start": 7433.28, "end": 7443.36, "text": "drin. Da kann man Föhn einschalten, Lüftung einschalten, Wärme einschalten, Strahlintensität"}, {"id": 1151, "start": 7443.36, "end": 7456.76, "text": "einschalten, Strahlwinkel, Abzugsstärke. Und so sieht es dann aus, wenn man den Hintern"}, {"id": 1152, "start": 7456.76, "end": 7465.92, "text": "abgesprüht kriegt. Jaja, ich weiß, ich habe mich gespiegelt. Ich habe mich total verhofft"}, {"id": 1153, "start": 7465.92, "end": 7470.28, "text": "gespiegelt in dem Video. Guck mal hier, da guckt er. Da guckt er raus. Da ist er. Da"}, {"id": 1154, "start": 7470.28, "end": 7493.48, "text": "ist er. Genau, Killer Tors. Dafür ist das da. Leider man steht drauf. Okay Leute, ich"}, {"id": 1155, "start": 7493.48, "end": 7500.88, "text": "war Schluss. Danke fürs Testen. Was kostet so eine Toilette? Ich weiß nicht mehr, wie"}, {"id": 1156, "start": 7500.88, "end": 7508.52, "text": "viel es genau gekostet hat. War nicht ganz billig. Ich gucke mal, ob es irgendetwas gibt,"}, {"id": 1157, "start": 7508.52, "end": 7524.8, "text": "was ich nicht hosten könnte. Leider keiner on. Da stelle ich Follower. Ach, der Cyrus"}, {"id": 1158, "start": 7524.8, "end": 7536.52, "text": "ist auch dabei. Wow, wow juckt mich denn so. Ich hoffe, es hat euch gefallen. Wir sehen"}, {"id": 1159, "start": 7536.52, "end": 7541.36, "text": "uns, machts gut, bis denn. Tschüss."}]}