{"text": "Alter, was ist denn hier, wo ist, wo ist denn hier das Problem? Wo ist denn hier das Problem? Call of Duty, please! Wo ist denn hier das Problem? Okay, mein Gott, was, was ist das für ein Problem? Ich lösche jetzt den ganzen Mist hier mal aus, denn nicht, der ausgibt, der ehe ausgeblasen. Dann besser. Das laggt! Warum? Call of Duty, warum? Das, das lasst ihn nicht mal ansatzweise in den Rechner aus. Der langweilt sich, der macht nichts, OBS braucht fünf Prozent. Ernsthaft jetzt, was ist das? Ich weiß was, Leute, wir machen Trick 17. Wir machen jetzt huge, wir machen huge Trick. Ich stelle das jetzt auf 48 FPS runter, den Unterschied siehst du eh nicht großartig. Und dann hoffe ich, dass es funktioniert.", "segments": [{"id": 1, "start": 0.0, "end": 20.04, "text": "Alter, was ist denn hier, wo ist, wo ist denn hier das Problem?"}, {"id": 2, "start": 20.04, "end": 24.88, "text": "Wo ist denn hier das Problem?"}, {"id": 3, "start": 24.88, "end": 27.24, "text": "Call of Duty, please!"}, {"id": 4, "start": 27.24, "end": 30.28, "text": "Wo ist denn hier das Problem?"}, {"id": 5, "start": 30.28, "end": 33.88, "text": "Okay, mein Gott, was, was ist das für ein Problem?"}, {"id": 6, "start": 33.88, "end": 40.4, "text": "Ich lösche jetzt den ganzen Mist hier mal aus, denn nicht, der ausgibt, der ehe ausgeblasen."}, {"id": 7, "start": 40.4, "end": 48.8, "text": "Dann besser."}, {"id": 8, "start": 48.8, "end": 53.32, "text": "Das laggt!"}, {"id": 9, "start": 53.32, "end": 54.4, "text": "Warum?"}, {"id": 10, "start": 54.4, "end": 56.8, "text": "Call of Duty, warum?"}, {"id": 11, "start": 56.8, "end": 62.76, "text": "Das, das lasst ihn nicht mal ansatzweise in den Rechner aus."}, {"id": 12, "start": 62.76, "end": 74.44, "text": "Der langweilt sich, der macht nichts, OBS braucht fünf Prozent."}, {"id": 13, "start": 74.44, "end": 78.84, "text": "Ernsthaft jetzt, was ist das?"}, {"id": 14, "start": 78.84, "end": 82.64, "text": "Ich weiß was, Leute, wir machen Trick 17."}, {"id": 15, "start": 82.64, "end": 85.96, "text": "Wir machen jetzt huge, wir machen huge Trick."}, {"id": 16, "start": 85.96, "end": 93.84, "text": "Ich stelle das jetzt auf 48 FPS runter, den Unterschied siehst du eh nicht großartig."}, {"id": 17, "start": 93.84, "end": 122.8, "text": "Und dann hoffe ich, dass es funktioniert."}]}