{"text": "So, da sind wir am Start. Es dauert noch, mal gucken, es dauert noch eine halbe Stunde ungefähr, dann geht's los. Wir müssen doch mal kurz schauen, wie wir uns den Stream überhaupt angucken. Also ich denke mal am besten dürft ihr über VLC sein. Ja, das müsste qualimäßig ziemlich gut sein. Ich guck mir das gerade mal in der Vorschau an. Ja, das sieht gut aus. Kann man sich nicht beschweren. Wenn jetzt noch, also mal gucken, wie das ist, wenn das Sound losgeht. Ob das passt? Ah, das wird schon passen. Das passt schon. Erinnert mich mal dran, dass ich den Chat ausplanen will und die Musik ausmache, sobald es losgeht. Wie hast du das mit VLC gemacht? Ähm, Moment, zeige ich dir. Du installierst jetzt Streamlink. Du installierst dir Streamlink. Das da. Beziehungsweise lädst dir das Binary runter. Und dann startest du Streamlink. Und Streamlink extrahiert quasi aus Twitch den Stream und öffnet es mit VLC. Das ist praktisch. Ich will aber keinen Anstift dazu, das zu machen, denn ich gehe mal davon aus, damit umgeht man auch die Werbung. Und wenn ihr jemanden gern guckt, spricht ja nichts dagegen, den auch so weit wie es geht zu unterstützen, wenn euch das ganze gefällt. Mich kann man übrigens nirgendswo unterstützen. Ich hab ja nichts. Doch ihr könnt mir für Paypal donaten. Aber ich hab ja keinen Sub-Button, keinen Patreon-Account, keinen sonst was. Ihr könnt höchstens über meine Amazon-Reflinks irgendwas kaufen. Aber ich bin ja da auch überhaupt nicht scharf drauf. Moin, der Nilsson ist auch am Start. So, was machen wir denn jetzt noch? Eine halbe Stunde bevor es losgeht. Wir schauen uns Pizze Master Race Memes an. Was hat das hier Baro da geschickt? Ohje, was ist das? Was ist ein kreativer Titel? Über Battlefield spekulieren. Achso, ja die Bingo-Karte, die kann ich euch zeigen. Die zeige ich euch. Ich Restream, also, naja, was heißt Restreamen. Ich greife den von Twitch ab, also ich kriege von EA keinen Stream oder sowas. Das wär's ja auch noch. Ja, also ich Restream das. Ne, ne, du musst den Stream nicht selbst aufmachen. Wir gucken uns, wir gucken uns den an, wir gucken uns den zusammen an hier. Da, da. Wow, es geht schon los. Da können wir uns mal gucken wie die Lautstärke ist. Wie ist die Lautstärke? Bisschen laut, oder? Ok, das Geschwätze müssen wir uns noch nicht angucken, oder? Das ist im Endeffekt ja auch nur Leute, die keinen Plan haben, die Interviewed werden jetzt. Die bzw. genauso wenig Plan haben wie wir. So, was wollte ich zeigen? Achja, das Bullshit-Bingo-Board. Also ich hab mir mal was aus den Fingern gesorgt. Ich hab jetzt überlegt, was könnte denn heute Abend, was könnte dran kommen, ja? Also was, wo ich drauf wetten könnte, dass das in irgendeiner Form kommt, ist das Erste. YouTuber bzw. irgendein C-Promi, der auf der Bühne steht und was zu dem Game erzählt und dass er das schon immer gespielt hat, oder dass er da schon immer ein Fan von ist und absolut begeistert ist und sich jetzt so wahnsinnig freut, dass er mal mitarbeiten kann an irgendeinem, an irgendeinem, wisst ihr ja, ne? Dass das kommt, das kommt garantiert, garantiert. Irgendein YouTuber C-Promi wäre 100% sinnloses Mobile-Game, kann ich auch fast wetten, dass da irgendwas kommt. Muss, ähm, Battle Royale, mich würd's wundern, wenn das nicht in irgendeiner Art und Weise kommt. So, also im Prinzip sind das ja alles Sachen, die bei EA alles nicht sehr unwahrscheinlich ist, ne? Vor allem das hier Pay2Win als Nicht-Pay2Win getarnt. Die haben ja aus Battlefront 2 und dem ganzen Zeug und Lootboxen, die haben ja schon ein bisschen draus gelernt, die machen jetzt Pay2Win, die machen jetzt beziehungsweise oder Lootboxen, allerdings halt, ohne das Lootboxen zu nennen. Denn mal gucken, was ihnen da einfällt bei der ganzen Sache. Äh, was, es fehlt Immersive Gameplay? Naja, ich hab hier sowas reingeschrieben wie aneinander rein von Superlative. The most amazing best ever of all time, haste dich gesehen. So, Free2Play kommt vielleicht auch irgendwas. Äh, Football, der muss, das ist immer eine EA. Wo du den E3-Stream angucken kannst. Twitch, EA. Ähm, dass irgendein Auto auf der Bühne, auf die Bühne kommt, wie letztes Jahr kann ich mir auch gut vorstellen. Indie-Devs, die nicht Indie sind, könnte ich auch fast wetten, dass da irgendwie sowas kommt. Wisst ihr, so nach dem Motto, wir, ähm, nehmen uns ein Studio und davon halt nicht alle, sondern nur vier Leute und sagen, das sind ja, das sind Indie-Devs. Wisst ihr, das ist so, wie wenn man sagen würde, Hearthstone, Hearthstone wurde von Indie-Devs gemacht, einfach nur weil Blizzard nicht die komplette Manpower dran gesetzt hat, bloß irgendwie acht Leute oder so. Das machen, das machen die Leute allgemein relativ gerne. Und das hier, das werden wir auch viel haben bei, bei EA. Ähm, vor allem, vor allem im Sport-Teil werden wir, werden wir ganz viel haben. Ähm, aber das machen sie ja generell gerne, so nach dem Motto, wir lieben Indie-Devs und wir haben, wir haben ja auch ganz viele tolle Förderprogramme und dann guckt man mal nach, wozu die gehören. Das sind überhaupt keine Indie-Devs. So, äh, Battlefield 5 wird irgendwas kommen und irgendwas von War Simulator und äh, Authentisch und sonst was erzählen sie. Wie lange das ganze dauert, weiß ich nicht. Wahrscheinlich, wahrscheinlich geht er, boah, es gibt ja schon In-Game-Footage. Das kommt garantiert auch. Aber wie gesagt, es geht noch nicht los. Wir können jetzt einmal gucken, wie so die Lautstärke passt das so. Lautstärke vom Stream zu Lautstärke von mir, ist das, ist das okay? Football-Resident und Sleeper. Auf welches Spiel freust du dich am meisten auf der, auf der EA-Play? Sims 5. Madden NFL Overdrive, ist das denn dir allein schon der Name? Dann könnte ich, dann könnte ich jetzt allein schon hier mal ankreuzen, so. Madden NFL Overdrive Mobile. Ja, was, ja was denn jetzt? Das ist geil. Es schreiben zwei Leute direkt nebeneinander. Stream etwas leiser, würde ich sagen. Stream ist ein bisschen leiser. Ja, was? Was denn jetzt? Also, neue Star Wars-Game weiß man nicht, könnte gut sein. Basketball, wahrscheinlich. Fußball mit Sicherheit. Cringe, mit, garantiert. Customization, können wir drauf wetten. Irgendein merkwürdiger Need for Speed Trailer, wo sich die Leute fragen so nach dem Auto, warum muss Need for Speed so komisch sein? Dann wieder natürlich die üblichen Geschichten, dass man angeblich das live gespieltes Real In-Game-Footage-Gameplay sieht, wo man sich immer streiten kann, ob das überhaupt, vor allem ob das real ist und ob das in-game und live ist schon was ganz was anderes. Das kommt wahrscheinlich auch, dass irgendwie ein Sportler irgendeinen Football oder einen Golfer oder einen UFC-Typ oder einen, keine Ahnung, irgendeiner, den wir wahrscheinlich nicht kennen, auf der Bühne stehen wird und erzählt von seinem Leben so nach dem Motto, wie geil er das findet, quasi, er hat als kleines Kind schon immer noch von geträumt, mal in FIFA dabei, was, ja, klar halt. Dann gibt es wahrscheinlich irgendwelche UFC-Golf-Geschichten, ganz, schläfst du ein. Also mit Sims war übrigens nicht ganz gemein gerade, ne? Natürlich freue ich mich am meisten auf Battlefield V, mal gucken was da, was da gezeigt wird. Eventuell gibt es ja wieder Sims mit irgendwelchen Tieren dabei, weil sie sonst nichts zu zeigen haben. Exclusive für irgendwas wird es auch auf jeden Fall als Exclusive ohne Ende. So, das, da bin ich mal gespannt, dass, also, die zwei Sachen gehören so irgendwie zusammen. Weil, ich könnte mir gut vorstellen, dass sie quasi ein bisschen Battlefront 2 loben, so nach dem Motto, dank eurem grandiosen Feedback konnten wir unser gutes Spiel noch viel besser machen, so wie ihr es euch schon immer gewünscht habt und haben jetzt die beste Star Wars Experience aller Zeiten. Na, ihr wisst ja sowas in der Richtung, kann ich mir gut vorstellen. Und die besten Fans haben wir natürlich auch, weil sie DLCs wird es geben und schlechte Musik wird es auch jede Menge geben. Und sei es nur das neue Battlefield-Theme, wenn es wieder so ein komisches Dubstep-Mischmasch ist. Den Buzzword-Counter, brauchen wir noch den Buzzword-Counter? Ja, wir haben schon so viele Counters und so viel Zeug. Vielleicht beleben sie Dead Space wieder? Ich finde, Dead Space kann ruhig Dead Game bleiben. Das erste Dead Space war wirklich ein super Game, vor allem von der Atmosphäre. Dead Space 2 war doof und Dead Space 3 war angeblich gar nicht so doof, aber ich bin nicht bis zu dem Teil gekommen, wo es anfängt nicht doof zu sein. So, 20 Minuten noch. Oh mein Gott, man kriegt Notifications, wenn einer gescord hat. Madden Mobile. So, ich habe jetzt ein bisschen lauter gemacht. Sagt mir mal, ob das jetzt besser ist. Du hast so voll wie auf der Gamescom. Die labern allgemein relativ leise gerade. Das wird später noch lauter werden. Das wird später noch lauter werden, wenn die auf der Bühne stehen. Wie kann man Twitch über VLC gucken? Du installierst dir Streamlink und er grabt das dann von Twitch. Allerdings, wenn dir der Streamer gefällt, guckst trotzdem am besten über die App oder über den Browser. Da profitiert der Streamer mehr davon. Wenn du sagst, ich scheiße da drauf, dann guckst du über VLC. Ich mach das eigentlich nur, wenn ich irgendwas aufnehmen will über Streamlink. Ansonsten, du hast eigentlich auch keinen Chat. Deswegen, für mich gehört Chat. Was ist da los? 12, by the way. Der war eben mit dem Alter, der darf wahrscheinlich noch gar nicht auf die Bühne ohne Erlaubnis von Mutter und Vater. Ja, guck das mal an. Alter, der ist 12 oder so. Habt ihr den Ragequit gesehen? Kennt ihr das Ragequit Video? Dauernd auf, dauernd auf, dauernd auf 18 Minuten. Kennt ihr das FIFA Ragequit Video? Ups. Nein. Guck mal, ob ich das finde. Ja. Das ist... Das ist das nicht. Ja, das ist es, guck mal. Ragequit, das ist irgendein FIFA-Turnier. Das ist irgendein FIFA-Turnier, ne? Und... Ich mach mal an. So. Und es gibt wohl in FIFA so irgendwie, wie ich das gelesen hab, so die absolute No-Skill-Mechanik, dass du quasi, wenn du vorne liegst, einfach das Game stallst ohne Ende. Du passt dir einfach nur noch den Ball hin und her und das Game kann damit nicht umgehen. Das heißt, der, der jetzt hier führt, der fuckt den halt voll ab, weil er quasi... Ich weiß nicht, ob das ein Glitch ist, ja. Und das pisst den halt übelst an und gleich kommt der Ragequit. Mitten im Turnier, mitten im Turnier, ne? Die Runde läuft noch mitten im Turnier. Ragequit, verpisst euch. Habt keinen Bock mehr. Ich mein, das... Ey, in welchem Turnier siehst du so was, ja? Und vor allem, warum ist das Ding, die Mechanik in dem Game? The fuck? So. Und wo wir gerade dabei sind, kennt ihr den... Kennt ihr das StarCraft-Turnier, wo der Typ mit dem Fuß spielt? Ich mein, wir haben noch 15 Minuten Zeit, wir können uns noch ein bisschen Zeug angucken. Kennt ihr das StarCraft-Turnier? Das ist auch irgendein Turnier, ja? Der spielt mit dem Fuß. Das ist so geil. Das ist einfach mal komplett Expanding Brain, ja? Das ist next level. Absolute next level. Das geht... In Wirklichkeit geht das noch viel länger, ne? Das geht irgendwie 37 Minuten. Der spielt dann auch irgendwie mit... irgendwie umgedreht und irgendwie... Ach, ganz... Der macht die ganze Zeit so komisches Zeug und zieht den halt übelst ab. Kannste Null rotieren lassen? Na klar, siehste doch hier, guck. Null, 3D Netz kann ich sogar den da machen. Das ist Turmspringer, Null. Oh, das Serious Max, nice, nice. Der Serious Max hat die Bullshit-Bingo-Karte. Ich poste das nochmal. Die Bullshit-Bingo... Haben wir eigentlich irgendwelche Mods? Der Sebaro war doch eben da, ne? Haben wir irgendwelche Mods? Könntest du das hier vom Serious Max mal als Ausrufezeichen Bingo Link oder irgendwie sowas einrichten? So, wir dürfen den Anfang nicht verpassen. Grills. Wir dürfen den Anfang nicht verpassen. Wir haben noch 13 Minuten Zeit. Sebaro ist futtern. Keine Mods. Oh, ich ahne Schlimmes. Da muss ich jetzt glaube ich irgendeinen... Wer macht hier einen guten Eindruck? Der Serious Max, den hab ich schon öfters gesehen. Der macht einen guten Eindruck. Der wird jetzt gemoddet. Der wird jetzt gemoddet. Den hab ich schon öfters gesehen hier. Und wenn du plötzlich was wirst, endmodet. So. Weil ohne Mods geht's hier nicht. So. Aber das war... Ist da geil, oder? Das ist wirklich Next Level Shit und Hymn, das Starcraft im Fuß spielt. Magst du mal die Low Latency Option aktivieren? Wo aktiviert man dann die Low Latency Option? Jetzt kommen sie hier mit Message Delete. Das hast du aber geschickt gemacht. Du hast ja noch Deutsch geschrieben. Nachricht gelöscht. Ja, ist klar. So einfach könnt ihr mich nicht debaten. Ich bin Master was Twitch Chat angeht. Ich hab eine eigene Textdatei mit Twitch Chat, Copypasta und Memes. Die ist mittlerweile, ich guck mal kurz rein, ich zeig die euch nicht. Weil das ist ja meine Geheimwaffe. Die ist 183 Zeilen lang. Meine Twitch Chat Copypasta Memes Datei. Das heißt Twitch Chat, da können wir mich nicht verarschen. So, 10 Minuten noch. Sims. Mir fällt mir dazu nicht ein. Dashboard Settings Channel. Nee, ich kann, wenn ich jetzt Low Latency anmache, dann startet sich das Team wahrscheinlich neu. Ich guck mal wie viel Latency ich hab. Ich guck mal in meiner Vorschau. So. 1, 2, 3, 4, 5, 6, 8, 9, 10. 10 Sekunden damit. Damit kann man doch leben, oder? 9,21. Das ist zu wenig. Ja Streamsnipe. Achtung, wenn ich gleich gesniped werde. 99,9 Sekunden. Ich glaube mit dem Delay können wir leben. Ich will jetzt nix, ich will jetzt nix an den Settings rumspielen und dann kackt das Stream ab. Ich mein uns bei so ner, also wenn es jetzt irgendwie Gameplay wäre oder irgendwie so quasi Chat Plays Overwatch oder irgendwie sowas, dann wäre die Latenz natürlich wichtig, aber wenn wir uns ne Pressekonferenz angucken, ob die jetzt 9,9 Sekunden später ist oder nicht, ist egal. Wieso spielen die im Stehen? Wahrscheinlich können die sich keine Stühle leisten. Und vielleicht ist es nicht hip genug zu sitzen. Wer ist, kennt man die? Boah. Ich mach die jetzt mal wieder aus. Ich ahne Schlimmes schon, das wird, das wird grausam gleich. So wir müssen, genau, unser Bullshit-Pingo ist offen, wir haben schon, zack wunderbar, alles vorbereitet, wir können direkt loslegen. Falls ich irgendwas vergesse Leute ne, spammt mich im Chat voll, dass ich dran denke hier Bullshit-Pingo auszufüllen. Also EA schlachtet ja alles aus, aber Sims ist da schon wirklich ganz oben mit dabei. Was ist mit Anthem? Ja, ich geh mal davon aus, dass ich mir das da kommt auch was. EA Leute, interviewen EA Leute, wie toll EA Produkte sind. Äh, Patrick, was? Was? What? Ich versteh's nicht. Ich bin mal gespannt, ob sie was zu Battlefield eSport erzählen. Ich hab das absichtlich mal hier rausgelassen, weil es EA eSport technisch noch nicht so richtig auf die Reihe gekriegt hat, was Battlefield sowas anbelangt. Sie erzählen das zwar öfters mal, aber sie machen ja nichts wirklich, weil Incursions, ist Incursions. Battlefield eSport, was ist das ja? Sie haben irgendwie ja vor ner Weile erzählt, sie haben eine eSport Division oder sowas gegründet. Davon hab ich noch nix mitgekriegt, was sie tolles macht, die eSport Division. Hallo Troidezer. Also das können wir safe abhaken heute, das können wir safe abhaken. Kann man die Stream-Quali ändern? Ja, sollte eigentlich gehen. Das hat er manchmal, dass das bei mir nicht einzustellen geht. Manchmal geht das dann nach ner Zeit und manchmal geht's auch nicht. Lustigerweise hatte ich gestern mit exakt den, wirklich exakt den gleichen Settings, hatte ich Optionen. Das liegt aber wahrscheinlich daran, also gar nicht an mir, sondern einfach wie viele Leute gerade streamen und wen halt Twitch für wichtig hält, dass man halt Rechenleistung bei ihnen kriegt. Und ich bin anscheinend wichtig genug und dann, versteh ich ja auch, ich mein ich bin weder Partner, ich bring Twitch, oder bin noch Apple-Direct, noch Partner oder sonst was, ich bringe Twitch nichts an Geld, gar nix. Ich koste ja nur was, deswegen sind sie wahrscheinlich der Meinung, alle anderen sind wichtiger, Optionen zu kriegen. Aber ist okay, versteh ich. Oh, gleich geht's los. So ungefähr so die Lautstärke denke ich, mal wird's auch im Stream sein. Geht doch, oder? Typ versteht man doch gut. Oder soll ich noch nen Ticken lauter machen? Ich kann ja immer noch lauter machen. Soll es nicht passen. Einen Tick lauter. Wir warten bis es losgeht, dann mach ich lauter. Sobald es losgeht. Die Musik ist nice. Ich weiß nicht wo ich schau, ob bei Max oder bei P-Suite was passiert ist. Ich weiß nicht wo ich schaue, aber ich schaue, ob bei Max oder bei P-Suite was passiert ist. Ich weiß nicht wo ich schaue, aber ich schaue, ob bei Max oder bei P-Suite was passiert ist. Ich weiß nicht wo ich schaue, aber ich schaue, ob bei Max oder bei P-Suite was passiert ist. Ich weiß nicht wo ich schaue, aber ich schaue, ob bei Max oder bei P-Suite was passiert ist. Ich weiß nicht wo ich schaue, aber ich schaue, ob bei Max oder bei P-Suite was passiert ist. Ich weiß nicht wo ich schaue, aber ich schaue, ob bei Max oder bei P-Suite Wir hatten keine Mods, wir haben Mods gebraucht Und er hat im letzten Team schon immer einen guten Eindruck gemacht Guck mal der Josen ist da Wie im Tool Und mehr Mods können nichts schaden Ich hatte ja bisher glaube ich nur drei Oder so Was? Hanzo? Simple Geometry Hat er gerade was von Hanzo erzählt? Hat sich zumindest so angehört Oder so ähnlich Hanzo Ja lass mal inside headen Hanzo 12 übrigens Hanzo Hanzo Ich hab keine Ahnung wer das ist Zu leise? Ist okay? Oder soll ich lauter machen? Hanzo Da bin ich gespannt Hanzo Wir können eigentlich schon mit Cringe anfangen abzuhaken oder? Merkt euch mal was wir anhaken mussten Hanzo Customization können wir auch schon abhaken Hanzo Das sieht schon geil aus Hanzo Was sagt mir das Bild jetzt? Hanzo Aber definitiv irgendwas Leute ihr habt irgendwas Ich wusste es, ich wusste es abhaken Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo Hanzo", "segments": [{"id": 1, "start": 30.0, "end": 47.6, "text": "So, da sind wir am Start. Es dauert noch, mal gucken, es dauert noch eine halbe Stunde"}, {"id": 2, "start": 47.6, "end": 53.12, "text": "ungefähr, dann geht's los. Wir müssen doch mal kurz schauen, wie wir uns den Stream überhaupt"}, {"id": 3, "start": 53.12, "end": 68.44, "text": "angucken. Also ich denke mal am besten dürft ihr über VLC sein. Ja, das müsste qualimäßig"}, {"id": 4, "start": 68.44, "end": 75.4, "text": "ziemlich gut sein. Ich guck mir das gerade mal in der Vorschau an. Ja, das sieht gut"}, {"id": 5, "start": 75.4, "end": 80.92, "text": "aus. Kann man sich nicht beschweren. Wenn jetzt noch, also mal gucken, wie das ist,"}, {"id": 6, "start": 80.92, "end": 89.36, "text": "wenn das Sound losgeht. Ob das passt? Ah, das wird schon passen. Das passt schon. Erinnert"}, {"id": 7, "start": 89.36, "end": 93.12, "text": "mich mal dran, dass ich den Chat ausplanen will und die Musik ausmache, sobald es losgeht."}, {"id": 8, "start": 93.12, "end": 104.84, "text": "Wie hast du das mit VLC gemacht? Ähm, Moment, zeige ich dir. Du installierst jetzt Streamlink."}, {"id": 9, "start": 104.84, "end": 117.92, "text": "Du installierst dir Streamlink. Das da. Beziehungsweise lädst dir das Binary runter. Und dann startest"}, {"id": 10, "start": 117.92, "end": 127.88, "text": "du Streamlink. Und Streamlink extrahiert quasi aus Twitch den Stream und öffnet es mit VLC."}, {"id": 11, "start": 127.88, "end": 138.4, "text": "Das ist praktisch. Ich will aber keinen Anstift dazu, das zu machen, denn ich gehe mal davon"}, {"id": 12, "start": 138.4, "end": 144.96, "text": "aus, damit umgeht man auch die Werbung. Und wenn ihr jemanden gern guckt, spricht ja nichts"}, {"id": 13, "start": 144.96, "end": 151.84, "text": "dagegen, den auch so weit wie es geht zu unterstützen, wenn euch das ganze gefällt. Mich kann man"}, {"id": 14, "start": 151.84, "end": 156.88, "text": "übrigens nirgendswo unterstützen. Ich hab ja nichts. Doch ihr könnt mir für Paypal"}, {"id": 15, "start": 156.88, "end": 163.88, "text": "donaten. Aber ich hab ja keinen Sub-Button, keinen Patreon-Account, keinen sonst was."}, {"id": 16, "start": 163.88, "end": 169.28, "text": "Ihr könnt höchstens über meine Amazon-Reflinks irgendwas kaufen. Aber ich bin ja da auch überhaupt"}, {"id": 17, "start": 169.28, "end": 176.12, "text": "nicht scharf drauf. Moin, der Nilsson ist auch am Start. So, was machen wir denn jetzt"}, {"id": 18, "start": 176.12, "end": 190.56, "text": "noch? Eine halbe Stunde bevor es losgeht. Wir schauen uns Pizze Master Race Memes an."}, {"id": 19, "start": 190.56, "end": 216.04, "text": "Was hat das hier Baro da geschickt? Ohje, was ist das? Was ist ein kreativer Titel?"}, {"id": 20, "start": 216.04, "end": 225.68, "text": "Über Battlefield spekulieren. Achso, ja die Bingo-Karte, die kann ich euch zeigen. Die"}, {"id": 21, "start": 225.68, "end": 237.0, "text": "zeige ich euch. Ich Restream, also, naja, was heißt Restreamen. Ich greife den von Twitch"}, {"id": 22, "start": 237.0, "end": 243.08, "text": "ab, also ich kriege von EA keinen Stream oder sowas. Das wär's ja auch noch. Ja, also"}, {"id": 23, "start": 243.08, "end": 247.0, "text": "ich Restream das. Ne, ne, du musst den Stream nicht selbst aufmachen. Wir gucken uns, wir"}, {"id": 24, "start": 247.0, "end": 256.4, "text": "gucken uns den an, wir gucken uns den zusammen an hier. Da, da. Wow, es geht schon los. Da"}, {"id": 25, "start": 256.4, "end": 260.68, "text": "können wir uns mal gucken wie die Lautstärke ist. Wie ist die Lautstärke? Bisschen laut,"}, {"id": 26, "start": 260.68, "end": 282.24, "text": "oder? Ok, das Geschwätze müssen wir uns noch nicht angucken, oder? Das ist im Endeffekt"}, {"id": 27, "start": 282.24, "end": 285.96, "text": "ja auch nur Leute, die keinen Plan haben, die Interviewed werden jetzt. Die bzw. genauso"}, {"id": 28, "start": 285.96, "end": 301.0, "text": "wenig Plan haben wie wir. So, was wollte ich zeigen? Achja, das Bullshit-Bingo-Board. Also"}, {"id": 29, "start": 301.0, "end": 305.0, "text": "ich hab mir mal was aus den Fingern gesorgt. Ich hab jetzt überlegt, was könnte denn"}, {"id": 30, "start": 305.0, "end": 313.4, "text": "heute Abend, was könnte dran kommen, ja? Also was, wo ich drauf wetten könnte, dass"}, {"id": 31, "start": 313.4, "end": 319.44, "text": "das in irgendeiner Form kommt, ist das Erste. YouTuber bzw. irgendein C-Promi, der auf"}, {"id": 32, "start": 319.44, "end": 324.76, "text": "der Bühne steht und was zu dem Game erzählt und dass er das schon immer gespielt hat,"}, {"id": 33, "start": 324.76, "end": 329.24, "text": "oder dass er da schon immer ein Fan von ist und absolut begeistert ist und sich jetzt"}, {"id": 34, "start": 329.24, "end": 334.04, "text": "so wahnsinnig freut, dass er mal mitarbeiten kann an irgendeinem, an irgendeinem, wisst"}, {"id": 35, "start": 334.04, "end": 339.68, "text": "ihr ja, ne? Dass das kommt, das kommt garantiert, garantiert. Irgendein YouTuber C-Promi wäre"}, {"id": 36, "start": 339.68, "end": 349.32, "text": "100% sinnloses Mobile-Game, kann ich auch fast wetten, dass da irgendwas kommt. Muss,"}, {"id": 37, "start": 349.32, "end": 355.88, "text": "ähm, Battle Royale, mich würd's wundern, wenn das nicht in irgendeiner Art und Weise"}, {"id": 38, "start": 355.88, "end": 364.44, "text": "kommt. So, also im Prinzip sind das ja alles Sachen, die bei EA alles nicht sehr unwahrscheinlich"}, {"id": 39, "start": 364.44, "end": 370.64, "text": "ist, ne? Vor allem das hier Pay2Win als Nicht-Pay2Win getarnt. Die haben ja aus Battlefront 2 und"}, {"id": 40, "start": 370.64, "end": 374.2, "text": "dem ganzen Zeug und Lootboxen, die haben ja schon ein bisschen draus gelernt, die machen"}, {"id": 41, "start": 374.2, "end": 378.08, "text": "jetzt Pay2Win, die machen jetzt beziehungsweise oder Lootboxen, allerdings halt, ohne das Lootboxen"}, {"id": 42, "start": 378.08, "end": 384.08, "text": "zu nennen. Denn mal gucken, was ihnen da einfällt bei der ganzen Sache. Äh, was, es fehlt Immersive"}, {"id": 43, "start": 384.08, "end": 389.8, "text": "Gameplay? Naja, ich hab hier sowas reingeschrieben wie aneinander rein von Superlative. The most"}, {"id": 44, "start": 389.8, "end": 396.08, "text": "amazing best ever of all time, haste dich gesehen. So, Free2Play kommt vielleicht auch"}, {"id": 45, "start": 396.08, "end": 405.8, "text": "irgendwas. Äh, Football, der muss, das ist immer eine EA. Wo du den E3-Stream angucken"}, {"id": 46, "start": 405.8, "end": 416.68, "text": "kannst. Twitch, EA. Ähm, dass irgendein Auto auf der Bühne, auf die Bühne kommt, wie"}, {"id": 47, "start": 416.68, "end": 422.24, "text": "letztes Jahr kann ich mir auch gut vorstellen. Indie-Devs, die nicht Indie sind, könnte"}, {"id": 48, "start": 422.24, "end": 427.96, "text": "ich auch fast wetten, dass da irgendwie sowas kommt. Wisst ihr, so nach dem Motto, wir, ähm,"}, {"id": 49, "start": 427.96, "end": 432.8, "text": "nehmen uns ein Studio und davon halt nicht alle, sondern nur vier Leute und sagen, das"}, {"id": 50, "start": 432.8, "end": 437.44, "text": "sind ja, das sind Indie-Devs. Wisst ihr, das ist so, wie wenn man sagen würde, Hearthstone,"}, {"id": 51, "start": 437.44, "end": 441.68, "text": "Hearthstone wurde von Indie-Devs gemacht, einfach nur weil Blizzard nicht die komplette"}, {"id": 52, "start": 441.68, "end": 446.8, "text": "Manpower dran gesetzt hat, bloß irgendwie acht Leute oder so. Das machen, das machen"}, {"id": 53, "start": 446.8, "end": 451.2, "text": "die Leute allgemein relativ gerne. Und das hier, das werden wir auch viel haben bei,"}, {"id": 54, "start": 451.2, "end": 455.28, "text": "bei EA. Ähm, vor allem, vor allem im Sport-Teil werden wir, werden wir ganz viel haben."}, {"id": 55, "start": 455.28, "end": 467.12, "text": "Ähm, aber das machen sie ja generell gerne, so nach dem Motto, wir lieben Indie-Devs"}, {"id": 56, "start": 467.12, "end": 470.68, "text": "und wir haben, wir haben ja auch ganz viele tolle Förderprogramme und dann guckt man"}, {"id": 57, "start": 470.68, "end": 480.28, "text": "mal nach, wozu die gehören. Das sind überhaupt keine Indie-Devs. So, äh, Battlefield 5 wird"}, {"id": 58, "start": 480.28, "end": 485.44, "text": "irgendwas kommen und irgendwas von War Simulator und äh, Authentisch und sonst was erzählen"}, {"id": 59, "start": 485.44, "end": 492.84, "text": "sie. Wie lange das ganze dauert, weiß ich nicht. Wahrscheinlich, wahrscheinlich geht"}, {"id": 60, "start": 492.84, "end": 505.72, "text": "er, boah, es gibt ja schon In-Game-Footage. Das kommt garantiert auch. Aber wie gesagt,"}, {"id": 61, "start": 505.72, "end": 512.72, "text": "es geht noch nicht los. Wir können jetzt einmal gucken, wie so die Lautstärke passt"}, {"id": 62, "start": 512.72, "end": 519.16, "text": "das so. Lautstärke vom Stream zu Lautstärke von mir, ist das, ist das okay? Football-Resident"}, {"id": 63, "start": 519.16, "end": 526.6, "text": "und Sleeper. Auf welches Spiel freust du dich am meisten auf der, auf der EA-Play? Sims"}, {"id": 64, "start": 526.6, "end": 540.52, "text": "5. Madden NFL Overdrive, ist das denn dir allein schon der Name? Dann könnte ich, dann"}, {"id": 65, "start": 540.52, "end": 551.4, "text": "könnte ich jetzt allein schon hier mal ankreuzen, so. Madden NFL Overdrive Mobile. Ja, was,"}, {"id": 66, "start": 551.4, "end": 555.36, "text": "ja was denn jetzt? Das ist geil. Es schreiben zwei Leute direkt nebeneinander. Stream etwas"}, {"id": 67, "start": 555.36, "end": 565.28, "text": "leiser, würde ich sagen. Stream ist ein bisschen leiser. Ja, was? Was denn jetzt? Also, neue"}, {"id": 68, "start": 565.28, "end": 570.64, "text": "Star Wars-Game weiß man nicht, könnte gut sein. Basketball, wahrscheinlich. Fußball"}, {"id": 69, "start": 570.64, "end": 577.8, "text": "mit Sicherheit. Cringe, mit, garantiert. Customization, können wir drauf wetten. Irgendein merkwürdiger"}, {"id": 70, "start": 577.8, "end": 581.44, "text": "Need for Speed Trailer, wo sich die Leute fragen so nach dem Auto, warum muss Need"}, {"id": 71, "start": 581.44, "end": 585.84, "text": "for Speed so komisch sein? Dann wieder natürlich die üblichen Geschichten, dass man angeblich"}, {"id": 72, "start": 585.84, "end": 592.12, "text": "das live gespieltes Real In-Game-Footage-Gameplay sieht, wo man sich immer streiten kann, ob"}, {"id": 73, "start": 592.12, "end": 595.92, "text": "das überhaupt, vor allem ob das real ist und ob das in-game und live ist schon was ganz"}, {"id": 74, "start": 595.92, "end": 611.44, "text": "was anderes. Das kommt wahrscheinlich auch, dass irgendwie ein Sportler irgendeinen Football"}, {"id": 75, "start": 611.44, "end": 618.2, "text": "oder einen Golfer oder einen UFC-Typ oder einen, keine Ahnung, irgendeiner, den wir"}, {"id": 76, "start": 618.2, "end": 621.92, "text": "wahrscheinlich nicht kennen, auf der Bühne stehen wird und erzählt von seinem Leben so"}, {"id": 77, "start": 621.92, "end": 625.68, "text": "nach dem Motto, wie geil er das findet, quasi, er hat als kleines Kind schon immer noch"}, {"id": 78, "start": 625.68, "end": 630.92, "text": "von geträumt, mal in FIFA dabei, was, ja, klar halt. Dann gibt es wahrscheinlich irgendwelche"}, {"id": 79, "start": 630.92, "end": 636.68, "text": "UFC-Golf-Geschichten, ganz, schläfst du ein. Also mit Sims war übrigens nicht ganz gemein"}, {"id": 80, "start": 636.68, "end": 640.0, "text": "gerade, ne? Natürlich freue ich mich am meisten auf Battlefield V, mal gucken was da, was"}, {"id": 81, "start": 640.0, "end": 644.88, "text": "da gezeigt wird. Eventuell gibt es ja wieder Sims mit irgendwelchen Tieren dabei, weil"}, {"id": 82, "start": 644.88, "end": 649.2, "text": "sie sonst nichts zu zeigen haben. Exclusive für irgendwas wird es auch auf jeden Fall"}, {"id": 83, "start": 649.2, "end": 656.24, "text": "als Exclusive ohne Ende. So, das, da bin ich mal gespannt, dass, also, die zwei Sachen"}, {"id": 84, "start": 656.24, "end": 660.4, "text": "gehören so irgendwie zusammen. Weil, ich könnte mir gut vorstellen, dass sie quasi"}, {"id": 85, "start": 660.4, "end": 665.6, "text": "ein bisschen Battlefront 2 loben, so nach dem Motto, dank eurem grandiosen Feedback konnten"}, {"id": 86, "start": 665.6, "end": 669.4, "text": "wir unser gutes Spiel noch viel besser machen, so wie ihr es euch schon immer gewünscht"}, {"id": 87, "start": 669.4, "end": 674.44, "text": "habt und haben jetzt die beste Star Wars Experience aller Zeiten. Na, ihr wisst ja sowas in der"}, {"id": 88, "start": 674.44, "end": 678.4, "text": "Richtung, kann ich mir gut vorstellen. Und die besten Fans haben wir natürlich auch,"}, {"id": 89, "start": 678.4, "end": 682.04, "text": "weil sie DLCs wird es geben und schlechte Musik wird es auch jede Menge geben. Und sei"}, {"id": 90, "start": 682.04, "end": 686.0, "text": "es nur das neue Battlefield-Theme, wenn es wieder so ein komisches Dubstep-Mischmasch"}, {"id": 91, "start": 686.0, "end": 695.16, "text": "ist. Den Buzzword-Counter, brauchen wir noch den Buzzword-Counter? Ja, wir haben schon"}, {"id": 92, "start": 695.16, "end": 711.0, "text": "so viele Counters und so viel Zeug. Vielleicht beleben sie Dead Space wieder? Ich finde,"}, {"id": 93, "start": 711.0, "end": 717.84, "text": "Dead Space kann ruhig Dead Game bleiben. Das erste Dead Space war wirklich ein super Game,"}, {"id": 94, "start": 717.84, "end": 725.0, "text": "vor allem von der Atmosphäre. Dead Space 2 war doof und Dead Space 3 war angeblich gar"}, {"id": 95, "start": 725.0, "end": 728.12, "text": "nicht so doof, aber ich bin nicht bis zu dem Teil gekommen, wo es anfängt nicht doof"}, {"id": 96, "start": 728.12, "end": 752.24, "text": "zu sein. So, 20 Minuten noch. Oh mein Gott, man kriegt Notifications, wenn einer gescord"}, {"id": 97, "start": 752.24, "end": 758.08, "text": "hat. Madden Mobile. So, ich habe jetzt ein bisschen lauter gemacht. Sagt mir mal, ob"}, {"id": 98, "start": 758.08, "end": 774.96, "text": "das jetzt besser ist. Du hast so voll wie auf der Gamescom. Die labern allgemein relativ"}, {"id": 99, "start": 774.96, "end": 787.16, "text": "leise gerade. Das wird später noch lauter werden. Das wird später noch lauter werden,"}, {"id": 100, "start": 787.16, "end": 806.24, "text": "wenn die auf der Bühne stehen. Wie kann man Twitch über VLC gucken? Du installierst"}, {"id": 101, "start": 806.24, "end": 817.36, "text": "dir Streamlink und er grabt das dann von Twitch. Allerdings, wenn dir der Streamer gefällt,"}, {"id": 102, "start": 817.36, "end": 822.56, "text": "guckst trotzdem am besten über die App oder über den Browser. Da profitiert der Streamer"}, {"id": 103, "start": 822.56, "end": 830.4, "text": "mehr davon. Wenn du sagst, ich scheiße da drauf, dann guckst du über VLC. Ich mach"}, {"id": 104, "start": 830.4, "end": 835.52, "text": "das eigentlich nur, wenn ich irgendwas aufnehmen will über Streamlink. Ansonsten, du hast"}, {"id": 105, "start": 835.52, "end": 848.32, "text": "eigentlich auch keinen Chat. Deswegen, für mich gehört Chat. Was ist da los? 12, by"}, {"id": 106, "start": 848.32, "end": 853.88, "text": "the way. Der war eben mit dem Alter, der darf wahrscheinlich noch gar nicht auf die Bühne"}, {"id": 107, "start": 853.88, "end": 870.48, "text": "ohne Erlaubnis von Mutter und Vater. Ja, guck das mal an. Alter, der ist 12 oder so. Habt"}, {"id": 108, "start": 870.48, "end": 883.48, "text": "ihr den Ragequit gesehen? Kennt ihr das Ragequit Video? Dauernd auf, dauernd auf, dauernd"}, {"id": 109, "start": 883.48, "end": 902.72, "text": "auf 18 Minuten. Kennt ihr das FIFA Ragequit Video? Ups. Nein. Guck mal, ob ich das finde."}, {"id": 110, "start": 902.72, "end": 932.32, "text": "Ja. Das ist... Das ist das nicht. Ja, das ist es, guck mal. Ragequit, das ist irgendein"}, {"id": 111, "start": 932.32, "end": 945.44, "text": "FIFA-Turnier. Das ist irgendein FIFA-Turnier, ne? Und... Ich mach mal an. So. Und es gibt"}, {"id": 112, "start": 945.44, "end": 951.08, "text": "wohl in FIFA so irgendwie, wie ich das gelesen hab, so die absolute No-Skill-Mechanik, dass"}, {"id": 113, "start": 951.08, "end": 955.52, "text": "du quasi, wenn du vorne liegst, einfach das Game stallst ohne Ende. Du passt dir einfach"}, {"id": 114, "start": 955.52, "end": 959.48, "text": "nur noch den Ball hin und her und das Game kann damit nicht umgehen. Das heißt, der,"}, {"id": 115, "start": 959.48, "end": 965.08, "text": "der jetzt hier führt, der fuckt den halt voll ab, weil er quasi... Ich weiß nicht, ob das"}, {"id": 116, "start": 965.08, "end": 973.08, "text": "ein Glitch ist, ja. Und das pisst den halt übelst an und gleich kommt der Ragequit."}, {"id": 117, "start": 973.08, "end": 993.28, "text": "Mitten im Turnier, mitten im Turnier, ne? Die Runde läuft noch mitten im Turnier. Ragequit,"}, {"id": 118, "start": 993.28, "end": 998.72, "text": "verpisst euch. Habt keinen Bock mehr. Ich mein, das... Ey, in welchem Turnier siehst du so"}, {"id": 119, "start": 998.72, "end": 1024.12, "text": "was, ja? Und vor allem, warum ist das Ding, die Mechanik in dem Game? The fuck? So. Und"}, {"id": 120, "start": 1024.12, "end": 1031.08, "text": "wo wir gerade dabei sind, kennt ihr den... Kennt ihr das StarCraft-Turnier, wo der Typ"}, {"id": 121, "start": 1031.08, "end": 1038.24, "text": "mit dem Fuß spielt? Ich mein, wir haben noch 15 Minuten Zeit, wir können uns noch ein bisschen"}, {"id": 122, "start": 1038.24, "end": 1059.28, "text": "Zeug angucken. Kennt ihr das StarCraft-Turnier? Das ist auch irgendein Turnier, ja? Der spielt"}, {"id": 123, "start": 1059.28, "end": 1088.12, "text": "mit dem Fuß. Das ist so geil. Das ist einfach mal komplett Expanding Brain, ja? Das ist"}, {"id": 124, "start": 1088.12, "end": 1098.84, "text": "next level. Absolute next level. Das geht... In Wirklichkeit geht das noch viel länger,"}, {"id": 125, "start": 1098.84, "end": 1103.84, "text": "ne? Das geht irgendwie 37 Minuten. Der spielt dann auch irgendwie mit... irgendwie umgedreht"}, {"id": 126, "start": 1103.84, "end": 1108.0, "text": "und irgendwie... Ach, ganz... Der macht die ganze Zeit so komisches Zeug und zieht den"}, {"id": 127, "start": 1108.0, "end": 1115.44, "text": "halt übelst ab. Kannste Null rotieren lassen? Na klar, siehste doch hier, guck. Null, 3D"}, {"id": 128, "start": 1115.44, "end": 1137.2, "text": "Netz kann ich sogar den da machen. Das ist Turmspringer, Null. Oh, das Serious Max, nice,"}, {"id": 129, "start": 1137.2, "end": 1147.8, "text": "nice. Der Serious Max hat die Bullshit-Bingo-Karte. Ich poste das nochmal. Die Bullshit-Bingo..."}, {"id": 130, "start": 1147.8, "end": 1152.4, "text": "Haben wir eigentlich irgendwelche Mods? Der Sebaro war doch eben da, ne? Haben wir irgendwelche"}, {"id": 131, "start": 1152.4, "end": 1159.0, "text": "Mods? Könntest du das hier vom Serious Max mal als Ausrufezeichen Bingo Link oder irgendwie"}, {"id": 132, "start": 1159.0, "end": 1170.76, "text": "sowas einrichten? So, wir dürfen den Anfang nicht verpassen. Grills. Wir dürfen den Anfang"}, {"id": 133, "start": 1170.76, "end": 1179.04, "text": "nicht verpassen. Wir haben noch 13 Minuten Zeit. Sebaro ist futtern. Keine Mods. Oh, ich ahne"}, {"id": 134, "start": 1179.04, "end": 1190.4, "text": "Schlimmes. Da muss ich jetzt glaube ich irgendeinen... Wer macht hier einen guten Eindruck? Der"}, {"id": 135, "start": 1190.4, "end": 1193.36, "text": "Serious Max, den hab ich schon öfters gesehen. Der macht einen guten Eindruck. Der wird jetzt"}, {"id": 136, "start": 1193.36, "end": 1209.92, "text": "gemoddet. Der wird jetzt gemoddet. Den hab ich schon öfters gesehen hier. Und wenn du"}, {"id": 137, "start": 1209.92, "end": 1233.52, "text": "plötzlich was wirst, endmodet. So. Weil ohne Mods geht's hier nicht. So. Aber das war..."}, {"id": 138, "start": 1233.52, "end": 1246.8, "text": "Ist da geil, oder? Das ist wirklich Next Level Shit und Hymn, das Starcraft im Fuß spielt."}, {"id": 139, "start": 1246.8, "end": 1251.68, "text": "Magst du mal die Low Latency Option aktivieren? Wo aktiviert man dann die Low Latency Option?"}, {"id": 140, "start": 1251.68, "end": 1262.6, "text": "Jetzt kommen sie hier mit Message Delete. Das hast du aber geschickt gemacht. Du hast"}, {"id": 141, "start": 1262.6, "end": 1268.32, "text": "ja noch Deutsch geschrieben. Nachricht gelöscht. Ja, ist klar. So einfach könnt ihr mich nicht"}, {"id": 142, "start": 1268.32, "end": 1273.84, "text": "debaten. Ich bin Master was Twitch Chat angeht. Ich hab eine eigene Textdatei mit Twitch"}, {"id": 143, "start": 1273.84, "end": 1278.12, "text": "Chat, Copypasta und Memes. Die ist mittlerweile, ich guck mal kurz rein, ich zeig die euch"}, {"id": 144, "start": 1278.12, "end": 1287.12, "text": "nicht. Weil das ist ja meine Geheimwaffe. Die ist 183 Zeilen lang. Meine Twitch Chat"}, {"id": 145, "start": 1287.12, "end": 1312.64, "text": "Copypasta Memes Datei. Das heißt Twitch Chat, da können wir mich nicht verarschen. So, 10"}, {"id": 146, "start": 1312.64, "end": 1324.24, "text": "Minuten noch. Sims. Mir fällt mir dazu nicht ein. Dashboard Settings Channel. Nee, ich"}, {"id": 147, "start": 1324.24, "end": 1330.24, "text": "kann, wenn ich jetzt Low Latency anmache, dann startet sich das Team wahrscheinlich"}, {"id": 148, "start": 1330.24, "end": 1339.44, "text": "neu. Ich guck mal wie viel Latency ich hab. Ich guck mal in meiner Vorschau. So. 1, 2,"}, {"id": 149, "start": 1339.44, "end": 1357.8, "text": "3, 4, 5, 6, 8, 9, 10. 10 Sekunden damit. Damit kann man doch leben, oder? 9,21."}, {"id": 150, "start": 1357.8, "end": 1381.12, "text": "Das ist zu wenig. Ja Streamsnipe. Achtung, wenn ich gleich gesniped werde."}, {"id": 151, "start": 1381.12, "end": 1399.84, "text": "99,9 Sekunden. Ich glaube mit dem Delay können wir leben. Ich will jetzt nix, ich will jetzt"}, {"id": 152, "start": 1399.84, "end": 1404.44, "text": "nix an den Settings rumspielen und dann kackt das Stream ab. Ich mein uns bei so ner, also"}, {"id": 153, "start": 1404.44, "end": 1411.32, "text": "wenn es jetzt irgendwie Gameplay wäre oder irgendwie so quasi Chat Plays Overwatch oder"}, {"id": 154, "start": 1411.32, "end": 1414.88, "text": "irgendwie sowas, dann wäre die Latenz natürlich wichtig, aber wenn wir uns ne Pressekonferenz"}, {"id": 155, "start": 1414.88, "end": 1421.44, "text": "angucken, ob die jetzt 9,9 Sekunden später ist oder nicht, ist egal. Wieso spielen die"}, {"id": 156, "start": 1421.44, "end": 1429.92, "text": "im Stehen? Wahrscheinlich können die sich keine Stühle leisten. Und vielleicht ist es nicht"}, {"id": 157, "start": 1429.92, "end": 1459.88, "text": "hip genug zu sitzen. Wer ist, kennt man die? Boah. Ich mach die"}, {"id": 158, "start": 1459.88, "end": 1469.92, "text": "jetzt mal wieder aus. Ich ahne Schlimmes schon, das wird, das wird"}, {"id": 159, "start": 1469.92, "end": 1477.6, "text": "grausam gleich. So wir müssen, genau, unser Bullshit-Pingo ist offen, wir haben schon,"}, {"id": 160, "start": 1477.6, "end": 1482.68, "text": "zack wunderbar, alles vorbereitet, wir können direkt loslegen. Falls ich irgendwas vergesse"}, {"id": 161, "start": 1482.68, "end": 1492.12, "text": "Leute ne, spammt mich im Chat voll, dass ich dran denke hier Bullshit-Pingo auszufüllen."}, {"id": 162, "start": 1492.12, "end": 1503.0, "text": "Also EA schlachtet ja alles aus, aber Sims ist da schon wirklich ganz oben mit dabei."}, {"id": 163, "start": 1503.0, "end": 1532.96, "text": "Was ist mit Anthem? Ja, ich geh mal davon aus, dass ich mir das"}, {"id": 164, "start": 1532.96, "end": 1544.84, "text": "da kommt auch was. EA Leute, interviewen EA Leute, wie toll EA"}, {"id": 165, "start": 1544.84, "end": 1572.44, "text": "Produkte sind. Äh, Patrick, was? Was? What? Ich versteh's nicht. Ich bin mal gespannt,"}, {"id": 166, "start": 1572.44, "end": 1578.2, "text": "ob sie was zu Battlefield eSport erzählen. Ich hab das absichtlich mal hier rausgelassen,"}, {"id": 167, "start": 1578.2, "end": 1583.56, "text": "weil es EA eSport technisch noch nicht so richtig auf die Reihe gekriegt hat, was Battlefield"}, {"id": 168, "start": 1583.56, "end": 1589.96, "text": "sowas anbelangt. Sie erzählen das zwar öfters mal, aber sie machen ja nichts wirklich, weil"}, {"id": 169, "start": 1589.96, "end": 1607.48, "text": "Incursions, ist Incursions. Battlefield eSport, was ist das ja? Sie haben irgendwie ja vor"}, {"id": 170, "start": 1607.48, "end": 1614.8, "text": "ner Weile erzählt, sie haben eine eSport Division oder sowas gegründet. Davon hab ich noch"}, {"id": 171, "start": 1614.8, "end": 1632.08, "text": "nix mitgekriegt, was sie tolles macht, die eSport Division. Hallo Troidezer. Also das"}, {"id": 172, "start": 1632.08, "end": 1645.44, "text": "können wir safe abhaken heute, das können wir safe abhaken. Kann man die Stream-Quali"}, {"id": 173, "start": 1645.44, "end": 1653.36, "text": "ändern? Ja, sollte eigentlich gehen. Das hat er manchmal, dass das bei mir nicht einzustellen"}, {"id": 174, "start": 1653.36, "end": 1659.24, "text": "geht. Manchmal geht das dann nach ner Zeit und manchmal geht's auch nicht. Lustigerweise"}, {"id": 175, "start": 1659.24, "end": 1669.24, "text": "hatte ich gestern mit exakt den, wirklich exakt den gleichen Settings, hatte ich Optionen."}, {"id": 176, "start": 1669.24, "end": 1673.68, "text": "Das liegt aber wahrscheinlich daran, also gar nicht an mir, sondern einfach wie viele"}, {"id": 177, "start": 1673.68, "end": 1682.48, "text": "Leute gerade streamen und wen halt Twitch für wichtig hält, dass man halt Rechenleistung"}, {"id": 178, "start": 1682.48, "end": 1685.92, "text": "bei ihnen kriegt. Und ich bin anscheinend wichtig genug und dann, versteh ich ja auch,"}, {"id": 179, "start": 1685.92, "end": 1690.12, "text": "ich mein ich bin weder Partner, ich bring Twitch, oder bin noch Apple-Direct, noch Partner"}, {"id": 180, "start": 1690.12, "end": 1696.92, "text": "oder sonst was, ich bringe Twitch nichts an Geld, gar nix. Ich koste ja nur was, deswegen"}, {"id": 181, "start": 1696.92, "end": 1701.28, "text": "sind sie wahrscheinlich der Meinung, alle anderen sind wichtiger, Optionen zu kriegen."}, {"id": 182, "start": 1701.28, "end": 1713.32, "text": "Aber ist okay, versteh ich. Oh, gleich geht's los. So ungefähr so die Lautstärke denke"}, {"id": 183, "start": 1713.32, "end": 1726.72, "text": "ich, mal wird's auch im Stream sein. Geht doch, oder? Typ versteht man doch gut. Oder"}, {"id": 184, "start": 1726.72, "end": 1743.28, "text": "soll ich noch nen Ticken lauter machen? Ich kann ja immer noch lauter machen. Soll"}, {"id": 185, "start": 1743.28, "end": 1749.96, "text": "es nicht passen. Einen Tick lauter. Wir warten bis es losgeht, dann mach ich lauter. Sobald"}, {"id": 186, "start": 1749.96, "end": 1773.04, "text": "es losgeht. Die Musik ist nice. Ich weiß nicht wo ich schau, ob bei Max oder bei P-Suite"}, {"id": 187, "start": 1773.04, "end": 1788.48, "text": "was passiert ist. Ich weiß nicht wo ich schaue, aber ich schaue, ob bei Max oder bei P-Suite"}, {"id": 188, "start": 1788.48, "end": 1799.36, "text": "was passiert ist. Ich weiß nicht wo ich schaue, aber ich schaue, ob bei Max oder bei P-Suite"}, {"id": 189, "start": 1799.36, "end": 1812.88, "text": "was passiert ist. Ich weiß nicht wo ich schaue, aber ich schaue, ob bei Max oder bei P-Suite"}, {"id": 190, "start": 1812.88, "end": 1827.32, "text": "was passiert ist. Ich weiß nicht wo ich schaue, aber ich schaue, ob bei Max oder bei P-Suite"}, {"id": 191, "start": 1827.32, "end": 1839.76, "text": "was passiert ist. Ich weiß nicht wo ich schaue, aber ich schaue, ob bei Max oder bei P-Suite"}, {"id": 192, "start": 1839.76, "end": 1853.16, "text": "was passiert ist. Ich weiß nicht wo ich schaue, aber ich schaue, ob bei Max oder bei P-Suite"}, {"id": 193, "start": 1853.16, "end": 1855.16, "text": "Wir hatten keine Mods, wir haben Mods gebraucht"}, {"id": 194, "start": 1855.16, "end": 1859.16, "text": "Und er hat im letzten Team schon immer einen guten Eindruck gemacht"}, {"id": 195, "start": 1859.16, "end": 1861.16, "text": "Guck mal der Josen ist da"}, {"id": 196, "start": 1861.16, "end": 1863.16, "text": "Wie im Tool"}, {"id": 197, "start": 1865.16, "end": 1867.16, "text": "Und mehr Mods können nichts schaden"}, {"id": 198, "start": 1867.16, "end": 1869.16, "text": "Ich hatte ja bisher glaube ich nur drei"}, {"id": 199, "start": 1869.16, "end": 1871.16, "text": "Oder so"}, {"id": 200, "start": 1871.16, "end": 1883.16, "text": "Was? Hanzo?"}, {"id": 201, "start": 1883.16, "end": 1885.16, "text": "Simple Geometry"}, {"id": 202, "start": 1885.16, "end": 1887.16, "text": "Hat er gerade was von Hanzo erzählt?"}, {"id": 203, "start": 1887.16, "end": 1889.16, "text": "Hat sich zumindest so angehört"}, {"id": 204, "start": 1893.16, "end": 1895.16, "text": "Oder so ähnlich"}, {"id": 205, "start": 1895.16, "end": 1905.16, "text": "Hanzo"}, {"id": 206, "start": 1905.16, "end": 1933.16, "text": "Ja lass mal inside headen"}, {"id": 207, "start": 1933.16, "end": 1947.16, "text": "Hanzo"}, {"id": 208, "start": 1947.16, "end": 1949.16, "text": "12 übrigens"}, {"id": 209, "start": 1949.16, "end": 1969.16, "text": "Hanzo"}, {"id": 210, "start": 1969.16, "end": 1995.16, "text": "Hanzo"}, {"id": 211, "start": 1995.16, "end": 2017.16, "text": "Ich hab keine Ahnung wer das ist"}, {"id": 212, "start": 2017.16, "end": 2019.16, "text": "Zu leise? Ist okay?"}, {"id": 213, "start": 2019.16, "end": 2047.16, "text": "Oder soll ich lauter machen?"}, {"id": 214, "start": 2047.16, "end": 2073.16, "text": "Hanzo"}, {"id": 215, "start": 2073.16, "end": 2075.16, "text": "Da bin ich gespannt"}, {"id": 216, "start": 2075.16, "end": 2093.16, "text": "Hanzo"}, {"id": 217, "start": 2093.16, "end": 2099.16, "text": "Wir können eigentlich schon mit Cringe anfangen abzuhaken oder?"}, {"id": 218, "start": 2099.16, "end": 2115.16, "text": "Merkt euch mal was wir anhaken mussten"}, {"id": 219, "start": 2115.16, "end": 2129.16, "text": "Hanzo"}, {"id": 220, "start": 2145.16, "end": 2151.16, "text": "Customization können wir auch schon abhaken"}, {"id": 221, "start": 2151.16, "end": 2177.16, "text": "Hanzo"}, {"id": 222, "start": 2177.16, "end": 2205.16, "text": "Das sieht schon geil aus"}, {"id": 223, "start": 2205.16, "end": 2231.16, "text": "Hanzo"}, {"id": 224, "start": 2231.16, "end": 2249.16, "text": "Was sagt mir das Bild jetzt?"}, {"id": 225, "start": 2249.16, "end": 2269.16, "text": "Hanzo"}, {"id": 226, "start": 2269.16, "end": 2285.16, "text": "Aber definitiv irgendwas Leute ihr habt irgendwas"}, {"id": 227, "start": 2285.16, "end": 2297.16, "text": "Ich wusste es, ich wusste es abhaken"}, {"id": 228, "start": 2297.16, "end": 2309.16, "text": "Hanzo"}, {"id": 229, "start": 2309.16, "end": 2337.16, "text": "Hanzo"}, {"id": 230, "start": 2337.16, "end": 2347.16, "text": "Hanzo"}, {"id": 231, "start": 2347.16, "end": 2371.16, "text": "Hanzo"}, {"id": 232, "start": 2371.16, "end": 2395.16, "text": "Hanzo"}, {"id": 233, "start": 2395.16, "end": 2409.16, "text": "Hanzo"}, {"id": 234, "start": 2409.16, "end": 2423.16, "text": "Hanzo"}, {"id": 235, "start": 2423.16, "end": 2439.16, "text": "Hanzo"}, {"id": 236, "start": 2439.16, "end": 2451.16, "text": "Hanzo"}, {"id": 237, "start": 2451.16, "end": 2461.16, "text": "Hanzo"}, {"id": 238, "start": 2461.16, "end": 2471.16, "text": "Hanzo"}, {"id": 239, "start": 2471.16, "end": 2481.16, "text": "Hanzo"}, {"id": 240, "start": 2481.16, "end": 2501.16, "text": "Hanzo"}, {"id": 241, "start": 2501.16, "end": 2511.16, "text": "Hanzo"}, {"id": 242, "start": 2511.16, "end": 2535.16, "text": "Hanzo"}, {"id": 243, "start": 2535.16, "end": 2555.16, "text": "Hanzo"}, {"id": 244, "start": 2555.16, "end": 2565.16, "text": "Hanzo"}, {"id": 245, "start": 2565.16, "end": 2585.16, "text": "Hanzo"}, {"id": 246, "start": 2585.16, "end": 2595.16, "text": "Hanzo"}, {"id": 247, "start": 2595.16, "end": 2615.16, "text": "Hanzo"}, {"id": 248, "start": 2615.16, "end": 2625.16, "text": "Hanzo"}, {"id": 249, "start": 2625.16, "end": 2645.16, "text": "Hanzo"}, {"id": 250, "start": 2645.16, "end": 2655.16, "text": "Hanzo"}, {"id": 251, "start": 2655.16, "end": 2665.16, "text": "Hanzo"}, {"id": 252, "start": 2665.16, "end": 2675.16, "text": "Hanzo"}, {"id": 253, "start": 2695.16, "end": 2705.16, "text": "Hanzo"}, {"id": 254, "start": 2705.16, "end": 2715.16, "text": "Hanzo"}, {"id": 255, "start": 2715.16, "end": 2725.16, "text": "Hanzo"}, {"id": 256, "start": 2725.16, "end": 2735.16, "text": "Hanzo"}, {"id": 257, "start": 2735.16, "end": 2745.16, "text": "Hanzo"}, {"id": 258, "start": 2745.16, "end": 2755.16, "text": "Hanzo"}, {"id": 259, "start": 2755.16, "end": 2765.16, "text": "Hanzo"}, {"id": 260, "start": 2785.16, "end": 2795.16, "text": "Hanzo"}, {"id": 261, "start": 2795.16, "end": 2805.16, "text": "Hanzo"}, {"id": 262, "start": 2805.16, "end": 2815.16, "text": "Hanzo"}, {"id": 263, "start": 2815.16, "end": 2825.16, "text": "Hanzo"}, {"id": 264, "start": 2825.16, "end": 2835.16, "text": "Hanzo"}, {"id": 265, "start": 2835.16, "end": 2845.16, "text": "Hanzo"}, {"id": 266, "start": 2845.16, "end": 2855.16, "text": "Hanzo"}, {"id": 267, "start": 2855.16, "end": 2875.16, "text": "Hanzo"}, {"id": 268, "start": 2875.16, "end": 2885.16, "text": "Hanzo"}, {"id": 269, "start": 2885.16, "end": 2905.16, "text": "Hanzo"}, {"id": 270, "start": 2905.16, "end": 2915.16, "text": "Hanzo"}, {"id": 271, "start": 2935.16, "end": 2945.16, "text": "Hanzo"}, {"id": 272, "start": 2945.16, "end": 2955.16, "text": "Hanzo"}, {"id": 273, "start": 2955.16, "end": 2965.16, "text": "Hanzo"}, {"id": 274, "start": 2965.16, "end": 2985.16, "text": "Hanzo"}, {"id": 275, "start": 2985.16, "end": 2995.16, "text": "Hanzo"}, {"id": 276, "start": 3015.16, "end": 3025.16, "text": "Hanzo"}, {"id": 277, "start": 3025.16, "end": 3035.16, "text": "Hanzo"}, {"id": 278, "start": 3035.16, "end": 3045.16, "text": "Hanzo"}, {"id": 279, "start": 3065.16, "end": 3075.16, "text": "Hanzo"}, {"id": 280, "start": 3075.16, "end": 3099.16, "text": "Hanzo"}, {"id": 281, "start": 3099.16, "end": 3109.16, "text": "Hanzo"}, {"id": 282, "start": 3109.16, "end": 3129.16, "text": "Hanzo"}, {"id": 283, "start": 3129.16, "end": 3139.16, "text": "Hanzo"}, {"id": 284, "start": 3139.16, "end": 3159.16, "text": "Hanzo"}, {"id": 285, "start": 3159.16, "end": 3169.16, "text": "Hanzo"}, {"id": 286, "start": 3169.16, "end": 3189.16, "text": "Hanzo"}, {"id": 287, "start": 3189.16, "end": 3199.16, "text": "Hanzo"}, {"id": 288, "start": 3199.16, "end": 3223.16, "text": "Hanzo"}, {"id": 289, "start": 3223.16, "end": 3233.16, "text": "Hanzo"}, {"id": 290, "start": 3233.16, "end": 3257.16, "text": "Hanzo"}, {"id": 291, "start": 3257.16, "end": 3267.16, "text": "Hanzo"}, {"id": 292, "start": 3267.16, "end": 3277.16, "text": "Hanzo"}, {"id": 293, "start": 3277.16, "end": 3287.16, "text": "Hanzo"}, {"id": 294, "start": 3287.16, "end": 3307.16, "text": "Hanzo"}, {"id": 295, "start": 3307.16, "end": 3317.16, "text": "Hanzo"}, {"id": 296, "start": 3337.16, "end": 3347.16, "text": "Hanzo"}, {"id": 297, "start": 3347.16, "end": 3357.16, "text": "Hanzo"}, {"id": 298, "start": 3357.16, "end": 3367.16, "text": "Hanzo"}, {"id": 299, "start": 3367.16, "end": 3391.16, "text": "Hanzo"}, {"id": 300, "start": 3391.16, "end": 3401.16, "text": "Hanzo"}, {"id": 301, "start": 3401.16, "end": 3411.16, "text": "Hanzo"}, {"id": 302, "start": 3411.16, "end": 3421.16, "text": "Hanzo"}, {"id": 303, "start": 3421.16, "end": 3445.16, "text": "Hanzo"}, {"id": 304, "start": 3445.16, "end": 3455.16, "text": "Hanzo"}, {"id": 305, "start": 3455.16, "end": 3475.16, "text": "Hanzo"}, {"id": 306, "start": 3475.16, "end": 3485.16, "text": "Hanzo"}, {"id": 307, "start": 3505.16, "end": 3515.16, "text": "Hanzo"}, {"id": 308, "start": 3515.16, "end": 3535.16, "text": "Hanzo"}, {"id": 309, "start": 3535.16, "end": 3545.16, "text": "Hanzo"}, {"id": 310, "start": 3565.16, "end": 3575.16, "text": "Hanzo"}, {"id": 311, "start": 3575.16, "end": 3595.16, "text": "Hanzo"}, {"id": 312, "start": 3595.16, "end": 3605.16, "text": "Hanzo"}, {"id": 313, "start": 3605.16, "end": 3629.16, "text": "Hanzo"}, {"id": 314, "start": 3629.16, "end": 3639.16, "text": "Hanzo"}, {"id": 315, "start": 3659.16, "end": 3669.16, "text": "Hanzo"}, {"id": 316, "start": 3689.16, "end": 3699.16, "text": "Hanzo"}, {"id": 317, "start": 3699.16, "end": 3723.16, "text": "Hanzo"}, {"id": 318, "start": 3723.16, "end": 3733.16, "text": "Hanzo"}, {"id": 319, "start": 3753.16, "end": 3763.16, "text": "Hanzo"}, {"id": 320, "start": 3763.16, "end": 3773.16, "text": "Hanzo"}, {"id": 321, "start": 3773.16, "end": 3783.16, "text": "Hanzo"}, {"id": 322, "start": 3783.16, "end": 3803.16, "text": "Hanzo"}, {"id": 323, "start": 3803.16, "end": 3813.16, "text": "Hanzo"}, {"id": 324, "start": 3813.16, "end": 3837.16, "text": "Hanzo"}, {"id": 325, "start": 3837.16, "end": 3847.16, "text": "Hanzo"}, {"id": 326, "start": 3847.16, "end": 3867.16, "text": "Hanzo"}, {"id": 327, "start": 3867.16, "end": 3877.16, "text": "Hanzo"}, {"id": 328, "start": 3897.16, "end": 3907.16, "text": "Hanzo"}, {"id": 329, "start": 3907.16, "end": 3927.16, "text": "Hanzo"}, {"id": 330, "start": 3927.16, "end": 3937.16, "text": "Hanzo"}, {"id": 331, "start": 3937.16, "end": 3957.16, "text": "Hanzo"}, {"id": 332, "start": 3957.16, "end": 3967.16, "text": "Hanzo"}, {"id": 333, "start": 3987.16, "end": 3997.16, "text": "Hanzo"}, {"id": 334, "start": 4017.16, "end": 4027.16, "text": "Hanzo"}, {"id": 335, "start": 4027.16, "end": 4037.16, "text": "Hanzo"}, {"id": 336, "start": 4037.16, "end": 4047.16, "text": "Hanzo"}, {"id": 337, "start": 4047.16, "end": 4067.16, "text": "Hanzo"}, {"id": 338, "start": 4067.16, "end": 4077.16, "text": "Hanzo"}, {"id": 339, "start": 4097.16, "end": 4107.16, "text": "Hanzo"}, {"id": 340, "start": 4127.16, "end": 4137.16, "text": "Hanzo"}, {"id": 341, "start": 4137.16, "end": 4147.16, "text": "Hanzo"}, {"id": 342, "start": 4147.16, "end": 4157.16, "text": "Hanzo"}, {"id": 343, "start": 4157.16, "end": 4177.16, "text": "Hanzo"}, {"id": 344, "start": 4177.16, "end": 4187.16, "text": "Hanzo"}, {"id": 345, "start": 4207.16, "end": 4217.16, "text": "Hanzo"}, {"id": 346, "start": 4237.16, "end": 4247.16, "text": "Hanzo"}, {"id": 347, "start": 4247.16, "end": 4271.16, "text": "Hanzo"}, {"id": 348, "start": 4271.16, "end": 4281.16, "text": "Hanzo"}, {"id": 349, "start": 4281.16, "end": 4305.16, "text": "Hanzo"}, {"id": 350, "start": 4305.16, "end": 4315.16, "text": "Hanzo"}, {"id": 351, "start": 4315.16, "end": 4339.16, "text": "Hanzo"}, {"id": 352, "start": 4339.16, "end": 4349.16, "text": "Hanzo"}, {"id": 353, "start": 4349.16, "end": 4359.16, "text": "Hanzo"}, {"id": 354, "start": 4359.16, "end": 4369.16, "text": "Hanzo"}, {"id": 355, "start": 4369.16, "end": 4389.16, "text": "Hanzo"}, {"id": 356, "start": 4389.16, "end": 4399.16, "text": "Hanzo"}, {"id": 357, "start": 4399.16, "end": 4419.16, "text": "Hanzo"}, {"id": 358, "start": 4419.16, "end": 4429.16, "text": "Hanzo"}, {"id": 359, "start": 4429.16, "end": 4449.16, "text": "Hanzo"}, {"id": 360, "start": 4449.16, "end": 4459.16, "text": "Hanzo"}, {"id": 361, "start": 4459.16, "end": 4483.16, "text": "Hanzo"}, {"id": 362, "start": 4483.16, "end": 4493.16, "text": "Hanzo"}, {"id": 363, "start": 4493.16, "end": 4517.16, "text": "Hanzo"}, {"id": 364, "start": 4517.16, "end": 4527.16, "text": "Hanzo"}, {"id": 365, "start": 4527.16, "end": 4547.16, "text": "Hanzo"}, {"id": 366, "start": 4547.16, "end": 4557.16, "text": "Hanzo"}, {"id": 367, "start": 4557.16, "end": 4577.16, "text": "Hanzo"}, {"id": 368, "start": 4577.16, "end": 4587.16, "text": "Hanzo"}, {"id": 369, "start": 4587.16, "end": 4611.16, "text": "Hanzo"}, {"id": 370, "start": 4611.16, "end": 4621.16, "text": "Hanzo"}, {"id": 371, "start": 4621.16, "end": 4641.16, "text": "Hanzo"}, {"id": 372, "start": 4641.16, "end": 4651.16, "text": "Hanzo"}, {"id": 373, "start": 4651.16, "end": 4671.16, "text": "Hanzo"}, {"id": 374, "start": 4671.16, "end": 4681.16, "text": "Hanzo"}, {"id": 375, "start": 4681.16, "end": 4701.16, "text": "Hanzo"}, {"id": 376, "start": 4701.16, "end": 4711.16, "text": "Hanzo"}, {"id": 377, "start": 4731.16, "end": 4741.16, "text": "Hanzo"}, {"id": 378, "start": 4741.16, "end": 4761.16, "text": "Hanzo"}, {"id": 379, "start": 4761.16, "end": 4771.16, "text": "Hanzo"}, {"id": 380, "start": 4771.16, "end": 4795.16, "text": "Hanzo"}, {"id": 381, "start": 4795.16, "end": 4805.16, "text": "Hanzo"}, {"id": 382, "start": 4805.16, "end": 4815.16, "text": "Hanzo"}, {"id": 383, "start": 4815.16, "end": 4825.16, "text": "Hanzo"}, {"id": 384, "start": 4825.16, "end": 4845.16, "text": "Hanzo"}, {"id": 385, "start": 4845.16, "end": 4855.16, "text": "Hanzo"}, {"id": 386, "start": 4855.16, "end": 4879.16, "text": "Hanzo"}, {"id": 387, "start": 4879.16, "end": 4889.16, "text": "Hanzo"}, {"id": 388, "start": 4889.16, "end": 4909.16, "text": "Hanzo"}, {"id": 389, "start": 4909.16, "end": 4919.16, "text": "Hanzo"}, {"id": 390, "start": 4939.16, "end": 4949.16, "text": "Hanzo"}, {"id": 391, "start": 4949.16, "end": 4969.16, "text": "Hanzo"}, {"id": 392, "start": 4969.16, "end": 4979.16, "text": "Hanzo"}, {"id": 393, "start": 4979.16, "end": 4999.16, "text": "Hanzo"}, {"id": 394, "start": 4999.16, "end": 5009.16, "text": "Hanzo"}, {"id": 395, "start": 5009.16, "end": 5033.16, "text": "Hanzo"}, {"id": 396, "start": 5033.16, "end": 5043.16, "text": "Hanzo"}, {"id": 397, "start": 5043.16, "end": 5063.16, "text": "Hanzo"}, {"id": 398, "start": 5063.16, "end": 5073.16, "text": "Hanzo"}, {"id": 399, "start": 5073.16, "end": 5093.16, "text": "Hanzo"}, {"id": 400, "start": 5093.16, "end": 5103.16, "text": "Hanzo"}, {"id": 401, "start": 5103.16, "end": 5123.16, "text": "Hanzo"}, {"id": 402, "start": 5123.16, "end": 5133.16, "text": "Hanzo"}, {"id": 403, "start": 5133.16, "end": 5157.16, "text": "Hanzo"}, {"id": 404, "start": 5157.16, "end": 5167.16, "text": "Hanzo"}, {"id": 405, "start": 5167.16, "end": 5177.16, "text": "Hanzo"}, {"id": 406, "start": 5177.16, "end": 5187.16, "text": "Hanzo"}, {"id": 407, "start": 5187.16, "end": 5211.16, "text": "Hanzo"}, {"id": 408, "start": 5211.16, "end": 5221.16, "text": "Hanzo"}, {"id": 409, "start": 5221.16, "end": 5231.16, "text": "Hanzo"}, {"id": 410, "start": 5231.16, "end": 5241.16, "text": "Hanzo"}, {"id": 411, "start": 5261.16, "end": 5271.16, "text": "Hanzo"}, {"id": 412, "start": 5291.16, "end": 5301.16, "text": "Hanzo"}, {"id": 413, "start": 5301.16, "end": 5311.16, "text": "Hanzo"}, {"id": 414, "start": 5311.16, "end": 5321.16, "text": "Hanzo"}, {"id": 415, "start": 5321.16, "end": 5341.16, "text": "Hanzo"}, {"id": 416, "start": 5341.16, "end": 5351.16, "text": "Hanzo"}, {"id": 417, "start": 5371.16, "end": 5381.16, "text": "Hanzo"}, {"id": 418, "start": 5401.16, "end": 5411.16, "text": "Hanzo"}, {"id": 419, "start": 5411.16, "end": 5421.16, "text": "Hanzo"}, {"id": 420, "start": 5421.16, "end": 5431.16, "text": "Hanzo"}, {"id": 421, "start": 5431.16, "end": 5451.16, "text": "Hanzo"}, {"id": 422, "start": 5451.16, "end": 5461.16, "text": "Hanzo"}, {"id": 423, "start": 5461.16, "end": 5481.16, "text": "Hanzo"}, {"id": 424, "start": 5481.16, "end": 5491.16, "text": "Hanzo"}, {"id": 425, "start": 5491.16, "end": 5511.16, "text": "Hanzo"}, {"id": 426, "start": 5511.16, "end": 5521.16, "text": "Hanzo"}, {"id": 427, "start": 5521.16, "end": 5541.16, "text": "Hanzo"}, {"id": 428, "start": 5541.16, "end": 5551.16, "text": "Hanzo"}, {"id": 429, "start": 5571.16, "end": 5581.16, "text": "Hanzo"}, {"id": 430, "start": 5581.16, "end": 5601.16, "text": "Hanzo"}, {"id": 431, "start": 5601.16, "end": 5611.16, "text": "Hanzo"}, {"id": 432, "start": 5631.16, "end": 5641.16, "text": "Hanzo"}, {"id": 433, "start": 5661.16, "end": 5671.16, "text": "Hanzo"}, {"id": 434, "start": 5671.16, "end": 5691.16, "text": "Hanzo"}, {"id": 435, "start": 5691.16, "end": 5701.16, "text": "Hanzo"}, {"id": 436, "start": 5721.16, "end": 5731.16, "text": "Hanzo"}, {"id": 437, "start": 5731.16, "end": 5751.16, "text": "Hanzo"}, {"id": 438, "start": 5751.16, "end": 5761.16, "text": "Hanzo"}, {"id": 439, "start": 5781.16, "end": 5791.16, "text": "Hanzo"}, {"id": 440, "start": 5791.16, "end": 5811.16, "text": "Hanzo"}, {"id": 441, "start": 5811.16, "end": 5821.16, "text": "Hanzo"}, {"id": 442, "start": 5841.16, "end": 5851.16, "text": "Hanzo"}, {"id": 443, "start": 5851.16, "end": 5861.16, "text": "Hanzo"}, {"id": 444, "start": 5861.16, "end": 5871.16, "text": "Hanzo"}, {"id": 445, "start": 5871.16, "end": 5881.16, "text": "Hanzo"}, {"id": 446, "start": 5881.16, "end": 5891.16, "text": "Hanzo"}, {"id": 447, "start": 5891.16, "end": 5915.16, "text": "Hanzo"}, {"id": 448, "start": 5915.16, "end": 5925.16, "text": "Hanzo"}, {"id": 449, "start": 5925.16, "end": 5935.16, "text": "Hanzo"}, {"id": 450, "start": 5935.16, "end": 5945.16, "text": "Hanzo"}, {"id": 451, "start": 5945.16, "end": 5965.16, "text": "Hanzo"}, {"id": 452, "start": 5965.16, "end": 5975.16, "text": "Hanzo"}, {"id": 453, "start": 5975.16, "end": 5995.16, "text": "Hanzo"}, {"id": 454, "start": 5995.16, "end": 6005.16, "text": "Hanzo"}, {"id": 455, "start": 6005.16, "end": 6029.16, "text": "Hanzo"}, {"id": 456, "start": 6029.16, "end": 6039.16, "text": "Hanzo"}, {"id": 457, "start": 6039.16, "end": 6063.16, "text": "Hanzo"}, {"id": 458, "start": 6063.16, "end": 6073.16, "text": "Hanzo"}, {"id": 459, "start": 6073.16, "end": 6083.16, "text": "Hanzo"}, {"id": 460, "start": 6083.16, "end": 6093.16, "text": "Hanzo"}, {"id": 461, "start": 6093.16, "end": 6103.16, "text": "Hanzo"}, {"id": 462, "start": 6103.16, "end": 6113.16, "text": "Hanzo"}, {"id": 463, "start": 6113.16, "end": 6133.16, "text": "Hanzo"}, {"id": 464, "start": 6133.16, "end": 6143.16, "text": "Hanzo"}, {"id": 465, "start": 6163.16, "end": 6173.16, "text": "Hanzo"}, {"id": 466, "start": 6173.16, "end": 6183.16, "text": "Hanzo"}, {"id": 467, "start": 6183.16, "end": 6193.16, "text": "Hanzo"}, {"id": 468, "start": 6193.16, "end": 6213.16, "text": "Hanzo"}, {"id": 469, "start": 6213.16, "end": 6223.16, "text": "Hanzo"}, {"id": 470, "start": 6243.16, "end": 6253.16, "text": "Hanzo"}, {"id": 471, "start": 6253.16, "end": 6273.16, "text": "Hanzo"}, {"id": 472, "start": 6273.16, "end": 6283.16, "text": "Hanzo"}, {"id": 473, "start": 6303.16, "end": 6313.16, "text": "Hanzo"}, {"id": 474, "start": 6333.16, "end": 6343.16, "text": "Hanzo"}, {"id": 475, "start": 6343.16, "end": 6367.16, "text": "Hanzo"}, {"id": 476, "start": 6367.16, "end": 6377.16, "text": "Hanzo"}, {"id": 477, "start": 6377.16, "end": 6401.16, "text": "Hanzo"}, {"id": 478, "start": 6401.16, "end": 6411.16, "text": "Hanzo"}, {"id": 479, "start": 6411.16, "end": 6435.16, "text": "Hanzo"}, {"id": 480, "start": 6435.16, "end": 6445.16, "text": "Hanzo"}]}