{"text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal.So, ich bin am Start. Was geht?Die ganze On-Screen-Liste ausmachen hier.Mal gucken, ob uns das Spiel heute nicht gebadet.Soll ich euch mal sagen, was richtig... Ich bin zu laut.Also wahrscheinlich nicht bei euch, sondern bei mir im Ohr bin ich zu laut.Das muss ich gerade mal umstellen. Blablabla. Jetzt bin ich zu leise. Blablabla. Blablabla. Ja, so ist das schön.Jetzt wollte ich Ihnen jetzt sagen, wisst ihr was? Das Game hat zum runterladen 104 Gigabyte.Stellt euch das mal vor. 104 Gigabyte, das ist... Was haben die denn da gemacht?Hostet man da irgendwie die Private Cloud von... Wie heißt der Typ von Activision, Bobby, irgendwas?Was machen die mit 100? Meinen die im Hintergrund irgendwelche Bitcoins auf unseren Rechner?Oder was machen die 104? Wobei, das braucht nicht besonders viel Speicherplatz, ne?Aber 104 Gigabyte, was ist denn da drin?104 Gigabyte kannst du wahrscheinlich die letzten drei Battlefields zusammen runterladen.Inklusive aller DLCs. Ich verstehe das nicht.So, ganz wichtig, was wir jetzt am Anfang mal machen, müssen wir mal in die Settings gucken.Und ich muss mal ein bisschen rein und raus tappen, weil ihr erinnert euch vielleicht noch an die Beta.In der Beta ist das Spiel immer abgekackt, wenn man rein und raus getappt ist.Das war halt richtig am PC Master Race Port wieder gewesen, das Ganze.Sind die Menüs eigentlich mittlerweile besser am PC?Nein, die Menüs sind immer noch genauso scheiße wie in der Beta.Jetzt haben mir wieder Leute unter meinem Video geschrieben, ne?So nach dem Motto, Max, du hast den Sinn einer Beta nicht verstanden.Das ist deine Beta, da muss noch nicht alles funktionieren.Naja, ich dachte, er sagt jetzt mal nichts zu.Aber man sieht, es hat sich zumindest im Punkte Menü nichts geändert.Die Dinger hier kann man immer noch nicht, man kann die Menüs immer noch nicht richtig mit dem Mausrad navigieren.Man kann die Settings hier, Brightness, kann man immer noch nicht mit dem Mausrad adjusten.Ich muss das jetzt einfach auf Englisch, ich weiß nicht, warum ich das jetzt... muss das jetzt sein.So, ganz wichtig, die Colorblind Filter Intensity.Die ist unglaublich wichtig, dass die eingeblendet wird, wenn der Colorblind Modus aus ist.Ganz wichtig, super.Blut natürlich an, Minimap lassen wir auch an.Motion Blur ist der Teufel in jedem Game.Motion Blur muss weg.Äh, nein.Was gibt es sonst noch für Settings?Ist die Lautstärke eigentlich so okay, wenn ich...Wir warten mal bis in Game.Guck mal, es gibt einen Foff Slider, den gibt es immer noch, den darf man natürlich nicht mit der Maus bewegen.Aber mit den Pfeiltasten, das ist okay.Moment, wie viel Foff geht? 95 Foff.Gucken wir, wie das aussieht in Game gleich.Screen Refresh Rate, nee nee 144, bitte schön.Maximum FPS, äh, warum gibt es überhaupt kein Maximum bei FPS?Also, naja.Aber okay, mit 150 kann ich leben.In Overwatch ist bei 300 FPS auch Schluss, das ist okay.Äh, wie sync? Aus.Blut natürlich an, Max will Gewalt sehen.Äh, wisst ihr? Nee.Das liegt gar nicht mal daran, weil ich Gewalt sehen will.Sondern, weil, je nachdem wie das implementiert ist, Blut quasi so was wie ein Hitmarker ist.So, was gibt es hier sonst noch zum Einstellen?Window, ganz wichtig, ohne HDR Output.Gut, da könnte ich es an Fernseh streamen, das brauch ich jetzt nicht.Weil mein Monitor hat noch kein HDR.Aber ich hoffe mal, dass ich in Zukunft Monitore durchsetzen......ähm, werden mit HDR.Ich wünsche mir, ja, und ich hab gesehen, dass glaube ich, äh, Asus und...Was war denn das sonst noch für ein Monitorhersteller?Acer, glaube ich, oder so.Die haben was in der Richtung angekündigt.Sowas in der Richtung von wegen 4K 144Hz oder 240Hz HDR Monitor.Natürlich wird das Ganze nicht mit 4K 240Hz plus HDR laufen.Weil ich glaube, es ist noch keine Anschlussmöglichkeit gefunden, was diese Bandbreite übertragen könnte.Aber das will man ja auch gar nicht.Das will man ja auch gar nicht.Man will, und das ist das, das habe ich damals mal mit einem von, von, von......einem von Asus erzählt, der wusste gar nicht.Der hat gar nicht, glaube ich, richtig verstanden, warum ich einen 144Hz 4K Monitor wollte.Bis ich ihm dann mal erklärt habe, ich will das nicht zum Spielen.Ich will 4K für den Desktopbetrieb und 1080p at 144Hz für Spiele.Da ist ihm das dann eingeläutert und ich dachte, das ist ja eigentlich so, das ist gar nicht so schlecht.Naja, gut, genug gelabert. Was gibt es hier sonst noch so einzustellen?Ich finde es immer schön, dass die Sachen so toll benannt sind.Pre-T2X Resolution.Ich will eigentlich nichts absampeln.Moment, ich will nichts absampeln.Was?Keine Ahnung.Post-Processing wollen wir eigentlich in der Regel gar nicht haben.Ich will ordentliches...Ähm...Ich lasse es jetzt einfach mal so.Das wollen wir nicht.Off, geht es off? Jawoll.Wir wollen, dass alles scharf ist, überall.Guck ich mir vielleicht, wenn es nicht gut läuft, gucke ich mir das vielleicht nach an.Ich spiele übrigens noch nicht auf meinem neuen Rechner.Warum lacht er so?Ich spiele noch nicht auf meinem neuen Rechner, ich spiele noch auf meinem alten Rechner.Mein alter Rechner ist auch schnell genug.Sehen 1080p auf einem 4K-Monitor genauso aus wie auf einem normalen 1080p-Monitor.Naja, du musst, wenn es ein richtiger 4K-Monitor ist, musst du das natürlich schon upscalen.Weil es ist halt ein 4K-Panel dann.Aber wenn es der Monitor gut macht, wirst du da nicht viel Unterschied sehen.Zeigt bei euch der Stream 720p mit 60 FPS an?Oder habe ich da irgendwas an den Einstellungen verkackt?Sollte aber.Gucken wir uns das Ganze mal an.Und in der Hoffnung, das Spiel kackt nicht mal so viel ab wie in der Beta.Es ist gefriest.Naja, jetzt geht's.Ja genau, Keeper of Fate, der gute alte Rechner mit 1080 Ti.Seht ihr FPS im Stream?Ich habe FPS von Steam eingeblendet und Overlay.Jaja, komm, geh weg.Ich will mir das nicht angucken.FPS sichtbar, ok, sehr schön.Ach, man sieht jetzt auf einmal beide FPS, ok.So, mal gucken, was haben wir uns in der Beta ausgesucht?Sind wir zum Grill?Nee, das war die Schneiper-Truppe, die wollten wir nicht.Oh nee, die Franzosen wollten wir auch nicht.Ich glaube, wir haben Airborne genommen, das letzte Mal.Airborne Grill.Das waren die mit der OP-Shotgun, die Franzosen.Mir gehen die Videos jetzt schon offen.Ich muss mal die Musik im Browser hinten aufmachen, das Spiel hat genug Sound.So, wir nehmen jetzt einfach, wir nehmen wieder Airborne, letztendlich hat das ja jetzt nicht so einen großen Unterschied gemacht.Was ich ganz cool fand, sind, dass halt jede Division so ein extra Perk-Progression-System hatte.Was halt zeigen die das hier wenigstens an?F2, Press F2, See Division Rewards.Ich drücke übrigens gerade F2 und ihr seht, es passiert nichts.Das ist natürlich gut gemacht, wenn es einen Knopf gibt, der nichts macht.Komm, wir nehmen wieder Airborne.Das war doch ganz cool, bisschen mit SMG aus der Hüfte einfach mal quer über die ganze Map ballern.Ja, wir joinen jetzt, wir joinen den.Das kennen wir aus der Beta, dann passt das.Welcome.Was?One Days?Gibt es was?Your Division Loadouts are the most critical Element.Ja, das vor allem sind meine Loadouts mit Lootboxen das critical Element für Activision.Ja, ich weiß, wie das funktioniert.Komm, Game, lass mich das doch ausblenden.Übrigens, ich gucke mir gerade die Vorschau vom Stream an.Ich sehe bei mir 0 FPS anzeigen.Wie könnt ihr meine FPS sehen?Und ich sehe meine FPS.Moment, mein Stream hat geleckt.Auch gut, vergesse.Ich habe nichts gesagt.Machen wir heute ein Lootboxen auf?Ja, wir machen ein Lootboxen auf, sobald ich Lootboxen habe.Aber ich glaube, ich habe noch kein Lootboxen.Ich weiß nicht mal, wo man Lootboxen sieht.Wo sieht man denn Lootboxen überhaupt?Ah, einen Store gibt es natürlich auch.Das ist sehr schön.Das Season Pass, was bringt denn das Season Pass?Zeig mal her.Scrollt erstmal irgendwie so, dass man...Hallo?Ich kann...Man kann das nicht scrollen, übrigens.PC, Port, FTW.Aber...You're first.Was?Ah, ich muss einen Übungs-Match machen.Okay, ich muss einen Übungs-Match.Soll ich mal einen Übungs-Match?Ja.Oh, neue Map.Den kennen wir noch nicht aus der Beta.Lootbox auf Linkstream, ja.Zombie Mode.Ja, Zombie Mode will ich mir mal angucken.Ich habe mal vor einer Weileauf Twitter ein paar Leute angeschrieben,die...Also laut...Laut den Rekorden und so,die richtig gut sein müssenin Zombie Modus.Und ich werde mal versuchen, die zusammenzukriegen,dass die mir das mal erklären können, wie man ordentlich Zombie Modus spielt.Oh, boah!Die Sensitivity, was ist da los?Was? Ach...Was ist denn das?Ja, stellen wir nach der Runde um.Zumindest können wir mal...Morgen oder so werde ich dann mit vomneuen Rechner aus streamen.What? Ah, da oben drauf.Morgen stream ich dann vom neuen Rechner aus.Dann können wir mal gucken, wasdie CPU ausmachtbei dem Game. Weil letztendlichpasst die Lautstärkeso zu meinem Gelaber und...Und in-gameSound.Boah, was?Boah!Mal gespawntund instant down.Ja,grandios. Äh, ich muss mich erst maleingewöhnen. Gegen was für welchespielen wir hier eigentlich? Ok, wir haben drei Leveleinser, die absolut nichts geschissen bekommenund Gegner, die wissen,was abgeht. Guck mal,da oben ist schon...Da unten ist was.Was auch immer.Der Typ, der kommt jetzt gleich hier rum.Achtung.Lol. Fuck, was warnoch mal hinlegen? Aha.Der Typ steht da hinten.Dachte ich zumindest.Oh, meine Sensitivity, die istmega fail.Das ist wirklichkrass fail. Äh, ich kannüberhaupt nicht zielen.Wir bleiben hier jetzt drinnen. Der kommthier jetzt rüber, der kommt hier jetzt rüber.What?Schon drei Stunden vorherprefire, hat nix passiert.Äh, Granate, Granatewar G.Äh, was auch immer er damacht.Alter, meine Sensitivity, ich kann so nicht zielen, das istnicht möglich gerade. Wirklich,das geht nicht.Den flanken wir jetzt. Flankerino.Fallsder überhaupt noch da ist.Oh nee, die habenernsthaft, die haben immer nochdie Ping-Balken anstattne Anzeige.Das versteh ich nicht.Nee, Settings machen wir nach derRunde. Ich muss mich erstmal wieder ein bisschen allgemein an dasGame gewöhnen.Ich versteh nicht, warum macht manPing-Balken? Ping-Balken ist einfachbeknackt.Und ich hab Input-Lag.Guck, ich drück sprintenoder sprint, sprinten.Warte.Kann man hier hoch?Sehr nice.Jetzt wissen die natürlich, dass ich hierrumrenne.Da unten, da unten sind schon Gegner am Start.Ich frag mich halt,warum macht man Ping-Anzeigen?Also,habt ihr es gerade gesehen, ich hab das Game gelieft angeblich,aber ich müsste noch drin sein. Warum macht manPing-Anzeigen? Also, warum macht manPing-Balken anstatt die richtige Ping-Anzeige?Das einzige, wie ich mir sowas erklärenkann, ist, dassman was verstecken will. Und dieFrage ist, was will man verstecken?Weil, eins hab ich zumindest in derBeta gelernt,anscheinend läuft dasGame wirklich auf echten Servern.Ich hab's am Anfang auch nicht für möglich gehalten, wir hattenauch eine Host-Migration, aber esgibt wohl irgendwie so ein Hybrid-System,dass man zu 90%oder 95% aufordentlichen Servern rauskommtund zu 5%, wenn es gerade keine gibtoder kein Slot frei ist oder was auch immer,dann halt auf irgendeinem P2Pgehostenden Kacke.Warum macht man Ping? Also,warum macht man Ping-Balken? Warum macht man...Man hat hier eigentlich nichts zu verbergen.So, jetzt muss ich erstmal Sense umstellen.Ich lese gleich Chat,ich muss mir erstmal das bisschen hieranschauen. So,als...Maus-Settings...Hat noch irgendeiner eine grobeAhnung, was ich hatte in der Beta?Wahrscheinlich nicht.Und dass man...Machen wir mal so.Gibt es irgendjemand, der horizontalund vertik, alsoso und so eine andere Maus-Sensehat?Ach guck mal, da Fanto ist da.Und wie findest du das Spiel?Du hast ja wahrscheinlich schon vor Releasebekommen und gespielt und hastschon ein paar Tage auf dem Bucke. Was sagst duzu dem Game? Bis jetzt?Moment.Wir spielen jetzt auch ein paar Runden, Team Deathmatch,ich muss mich erst wieder mal dran gewöhnen.Und dann machen wirLootboxen auf amStrand.Ok, also ich sehe ganz vieleFragen im Chat. Ihr werdetnicht glauben, ich hab grad auf meinem zweiten RechnerTwitch laufen in MicrosoftEdge. OhneBeta Twitch TV, ohne alles. Das heißtich seh jetzt weder 0.3Dals Emote, noch alle anderenGIF Emotes und die Fragen sich auchnicht richtig Highlighted.Ok,den Typen müssen wir schon malmuten.Was wohl?Demutet man doch.Ach geil, man kann da drauf klicken,als man gemutet hat. Sehr nice.So, Chat,was hab ich? Oh, die kenn ich, die Map.PingBalken in 2k17,ja, das versteh ich net.Komm, wir gucken, ob die Shotkanoch so OP ist wie in der Beta.Nee, ich hab den Singleplayer hab ich noch nicht ausprobiert.Ach, am PC gibt's auch keine,keine, keine, ich sag mal,hab ich da grad in der Erde gesteckt, kann das sein?Ich dachte auf45 FPS?What?Das war in der Beta ja noch besser.45 FPS, ernsthaft?Oh, wir müssenOP Brandmunition laden.OP Brandmunition, jetzt ist meine Sensviel zu niedrig.54 FPS?OPOP ShotgunAchtung, da kommt was,da kommt was.Das ruckelt, das ruckeltübelst.Das ruckelt mega, was ist da los?Das hat voll nicht framed und ich seh's ja oben.1080 Ti reicht nicht,nee.Auf der Map ist Shotgun doof für.Guck mal wie, Alter!Die Maus!Ich, das,ihr müsstet meine, die Maus in der Hand haben.Das ist, das fühlt sich anwie als würde ichmeinen eigenen Maus zeigen,zu mir streamen im Hauptmenü hier.Das zieht total hinterher.Seht ihr, ich treff die Buttons nicht.Boah!Das ist hart.Guck mal,das ist ganz wichtig.Ich muss die Sens wieder hochstellen.Komm her.das ruckelt ja totalmal bisschen mehr das ruckelt das ruckelt mehr als in der betadas ruckelt richtig krass was ist ich habe nichts laufen im hintergrund also das hat in der betanoch nicht so geruckelt ob sich amd mit dem video ich habe noch nicht mal irgendwas amdmäßiges im rechner das ist übelst input lag gerade was da los das war in der beta nochnicht das fühlt sich total schwammig an gerade das fühlt sich mehr das fühlt sich kann eskann es gar nicht richtig beschreiben das fühlt sich total schwammig an und die framesind auch ziemlich niedrig und es ruckelt das was ist denn hier kaputt gerade die mauszieht ich glaube ich starte das game danach mal neu also hier im hauptsatz acht und 35 fps immenü das ist ja obsas das ist genau das ist wie wenn ich über über stream spielen würde dasist wie wenn ich über einen zweiten monitor in stream gucke und damit meine maus navigiere ganzganz komisch keine ahnung was stelle ich jetzt mal um 90 kann ich irgendwas ausstellen oder soich war meine 1080 te kann schlecht zu schlecht sein für das spieles ist jetzt besser näher 37 und warum spawn ich hinter demdas ist nicht spielbar das springt von 35 fps auf 96 das kann ich nicht spielenalso und der typ hat ein paar probleme wie es aussieht also ich habe mich wirklichdarauf gefreut heute zu spielen weil mir die beta doch für den call of dutyverhältnismäßig also von den der letzten jahre verhältnismäßig viel spaß gemacht hat und ichhabe die habt ihr gesehen ich habe dir sogar viel gespielt und nichts in der beta hat sich soschwammig angefühlt wie das gerade ich kann gucken wir das ist auf 38 fps 38 fps du merkstes wenn 37 du merkst es wenn du um die ecke rum geht jetzt ist die maus schön flüssig unddu gehst um die ecke rum und die maus leckt das ist nicht spielbar was ist denn da los ichhabe sogar eben gerade noch mit noch das neue nvidia das neue update installiert das allesgut läuft also ich hoffe dass alles gut läuft aber ich starte ich starte spiel jetzt mal neumach mal ambient occlusion und anti lasing aus mache ich man darf leider bei der kill cam nichtraus das ärgert mich jetzt ärgert mich echt dass es so schlecht läuft ist es um die konsolenexperience auf den pc zu bringen oder was ich möchte seht ihr das habt ihr gesehen wie die mausgestartet hat und ich übrigens beim menü ist weg jetzt ist es wieder da ok nee ich muss dasgame mal kurz neu starten das ist das ist definitiv nicht normal und vorher machen wir noch halloich möchte doch nicht quitten spiel spiel ich will nicht quitten ich will noch was einstellennein ich darf nicht ich muss jetzt quitten ich darf nicht das quitten beenden ok da mache ichjetzt noch mal neu und guck ob es besser läuft na ich weiß nicht das finde ich jetzt wie ziemlichscheiße und die beta lief ja verhältnismäßig gut muss man sagen ich meine so performancemonster war es jetzt nicht so graphics gibt's warum gibt's eigentlich keine presets da wirdeinfach mal alles auf alles auf low alles auf low schalten ok das haben wir ja alles schon weitgenug untergestellt pre load shadows ein langer level loading wollen wir den schatten haben wir ausblar haben wir untergestellt shadows machen wir noch mal aus ist ja nicht so dass ich nicht diebeste grafikkarte hätte dies zur zeit gibt oder so auf alles auf alles auf auf das darf ich nichtausschalten das war auch aus ich finde das sieht besser aus mit oft sonst sieht es einfach nurweichgezeichnet aus so ja code 1 das geht du ich habe auch nur multiplayer installiertkomm wir lassen ihn jetzt wir lassen jetzt preloaden ich habe genug ram wo war das prepreload ich finde es nicht war das damit preload irgendwo stand da was mit preload shadershader preload hier longer level load to eliminate eigentlich ist es egal ob daslevel länger lädt es dauerte in ein paar sekunden bis es losgeht ok gucken wir mal ob es jetzt besserläuft ne ne das geht ohne vpn echt heiko und also es gab glaube ich heute einen neuen nvidiatreiber ich habe ich habe irgendwas heute morgen gelesen neuer nvidia treiber für extra fürcall of duty und wenn es wenn es mit dem treiber extra für call of duty der rausgekommen istschlechter läuft als mit dem treiber davor dann weiß ich nicht was kaputt istkurz licht anmachen ihr sagt dunkeles ist leider ein bisschen ich habe mich echt gefreut drauf ich wollte also ist ja wie ichmir das vorgestellt habe ich dachte mir so das spiel lebt auf dem pc wahrscheinlich nurungefähr einen monat ich spiele es jetzt einfach mal zwei drei wochen durch quasi und danach istdas spiel entweder tot oder cheater verseucht und wenn nicht dann wäre ich echt überraschtwird sogar noch länger spiel wenn es dann auch spaß macht aber eigentlich hatte ich jetzt vorich spiele das game jetzt einfach mal komplett durch quasi irgendwie bis bis max level probierenmal alles aus steckt da ordentlich viel zeit was ist mit meiner maus los sieht ihr das meinemaus meine maus hat aussetzer bei niedrigen fps zahlen und wenn das im ladebildschirm schonist wird mich nicht wundern wenn das ingame auch so ist so und das ärgert mich jetzt das läuftbesser 170 fps da damit da komme ich mit klar damit mit 155 fps komme ich klar auch wenn dietextur aussieht wie ich wollte gerade sagen wie von end 64 game aber die textur und beidem end 64 game sahen besser aus go go die map kenne ich schonkommen die hier man man muft langsamer habe ich das gefühlt wisst ihr ob die was gemachthaben so ein move movement geschwindigkeit und und und hüpfen und so haben die da wassagen gemacht hat irgendjemand patch patches gelesen hast du tschüss den schießung anich habe kein schießen kann könnte ich anmachen aber was war das die flanke jetzt flankeder wird sich freuen mit seinem spawn jetzt man läuft lang ich wusste dass du um dieecke kommst kacke noob seht ihr mit 200 fps läuft es auch viel besser meine sense stimmtaber immer noch nicht ich mache mal wieder auf 200 ich habe die sense jetzt auf dem wasich am anfang hatte nein die sense ist nicht auf das was ich vorher hatte vorher habeich einmal mousepad 2 zu 60s gemacht jetzt mache ich einmal mousepad 1 zu 60 obwohl beider sense das gleiche steht meine maus dpi kann ich gar nicht umstellen ohne die mausumdrehen zu müssen mach mal raum aus input aus meinst du das ist irgendwie ein ding dassdas kaputt ist mache ich mache ich mache ich mache input aus mache ich gleich sobaldhier die gegner weg sind es fühlt sich aber trotz 160 fps fühlt sich noch ein bisschenkomisch an vielleicht muss man sich erst dran gewöhnen kann man hierdurch schießen ichweiß es fühlt sich komisch an also ich hatte es vorhin auf 2 und jetzt ist es mir zu schnelljetzt habe ich es wieder auf 2 und es ist mir zu langsam und vorher habe ich auf 2 fastguck mal ich fange an der rolle an ich bin quasi an der rolle mit einmal übers mousepadund vorher habe ich zwei war ich zweimal ums mousepad rum vielleicht war das aber einfachauch nur wegen niedrigen fps wie ist das game so kann ich auch nicht sagen ich habe esgerade auf die reihe gekriegt die einstellung so zu setzen dass ich das game überhaupt spielenkann so jetzt aber mal jetzt gehts los mal kurz warten bis den head klitschen momentdie kommen von hinten kann sein dass die von hinten kommen kommen rauf wo sind gegnerund er wird gebashed der kotzt jetzt ey das war so ein typischer call of duty ton zackvon der seite in call of duty stirbst du ja selten frontal du stirbst da meist um dieecke oder oder von der seite oder so schneiber schneiber schneiber da kommt gleich einerfreaks getropschottet hier jumpschott ist der neue dropschott gleich mal skaff anschließenhier skaff maus am pc gleich gleich kommt die skaff maus am pc dann ist dann ist Schlussmit lustig skaff maus und fps freaks auf die maus das ist eh das total unterschätztpro gamer in aller welt schwören auf fps freaks auf der maus ihr wisst das bloß nichtich hatte glaube ich gelb streaks hätte vielleicht mal einsetzen soll was sind was sind fps freakshalbkorn kennst du es nicht das war der der der heiße aiming hack quasi zu 360 und ps3zeiten fps freaks sind so so aufsätze aufsätze für die analog sticks dann sind die analogsticks länger und man bildet sich ein man trifft damit besser oder ist schneller undsowas in der richtung ich meine die steigerung davon ist ja mit maus kann man besser ebenals mit dem controller mit fps freaks auf dem controller kann man besser eben als ohnefps freaks das heißt die logische folge schluss folgung daraus ist maus mit fps freaks istnoch besser was hat max gemacht dass er mehr fps hat erst mal ist es jetzt eine anderemap darf man nicht vergessen vielleicht ist die map einfach nur scheiße gewesen optimiertund ich hab fast ich hab alles ausgestellt was es so gibt deswegen sind die grafik hierauch jetzt ziemlich beschissen aus alle typen gleich und die helme ohne textur aber es läuftgut so ich habe bestimmt ganz viele fragen und sachen überlesen im chat ich gucke ichgucke noch mal durch schnell holt sie das neue battlefront nein hol ich bin ich diebeta hat mich total enttäuscht ich war schon kein fan vom letzten battlefront remake aberdas war somit eines der unspaßigsten multiplayer spiele die ich je gespielt habe battlefrontslats also die beta vom letzteneine sache haben sie gefixt definitiv man hat nicht mehr 20 sekunden input lag nachdemman raus getappt ist man muss sich überlegen das war ein ding in der betane man hatte 1015 20 sekunden input lag nachdem man raus getappt ist wenn das spiel nicht gecrashedist das ist besser das ist definitiv besser jetzt ich weiß ich weiß nicht wo es langgeht aber hier kommt bestimmt gleich was ich hör was ich hör was achte eckencamp eckencampkrasse eckencamp ich hör da drinnen was jetzt ist die sense obwohl die sense sich nichtgeändert hat ist die jetzt höher als vorher äh niedriger als vorher ganz merkwürdigkomm her komm raus treff nixhi evuran was ein fps freak das hab ich doch gar nicht erklärt das sind so so aufsätzeauf controller mit denen man besser aimtja die sense ist gefühlt auf jeder map anders ganz merkwürdig jetzt kann auch sein dassich mich nur einbilde aber ich bin da normalerweise recht empfindlich was so settingsänderunganbelangt achtung trick 17mit der granate geguckt weg weg geguckt habe ich ihndas teile geht weiter weg da kämpft facepalm geht schon los es geht schon los warum holtsie dir keine aufträge sind verschenkte münzen ich wusste nicht mal dass es so was wie aufträgeüberhaupt gibt halloder kämpft bestimmt noch da ne macht er nicht ich will das ding wieder haben ich willmal damit was kennen das von da nix kommtweiß nicht woher da was gekommen ist natürlich von der seite von wo sonst die waffe ist gutich hab also ich weiß noch in der beta war die shotgun ziemlich gut mit der brand munitionnicht zu sagen op die eine sniper war extrem gut das ding hier aus der hüfte war auchziemlich guterst mal dran gewöhnen wo hier gegner herkommen und wo nicht schneiber max pass auf pass aufjetzt werden sie ich glaube ich glaube sie jetzt hat er gut geklappt was natürlich istwenn zwei auch bei den kies dort so teuer ich habe heute mal geguckt was so ein key kostetwar aber 49 euro und es war die russin version also sprich da wurde nur in uns bekistan kassastansting dunges kahn und russland spielen kannst und das dafür war sniper revenge schlägtmich jetzt hin und bleibt hier sitzen halte ich eh nicht durch sowas hinter mir was warnahe kampf f was war nahe kampf mittlere fc keine ahnung was nahe kampf ist bamm geschnipptjetzt pass auf outplayed outplayed outplayed das geht doch also ich sag euch jetzt istes viel besser als mit den settings am anfang ich weiß leider nicht welches der settingses jetzt ausgemacht hat von 37 fps auf 215 sammar kannst du sterbenja so ist das halt so ist das halt damals habe ich auchnoch zehn stunden gefühlt am tag gespielt wenn ich das jetzt hier machen sollte alswirklich ein paar stunden wieder reinhauen hat man auch finde ich schon in der beta gesehendann geht man immer noch ganz gut ab und wenn man die maps kennt und solche sachen natürlicher will mich flanken das war ein anderer diesmal meine letzte nachricht ja mache ich mal hochscrollen deine mouse sensitivity ist abhängig von dein fps cap mal auf 104 meinst du wumoment leute leute es geht los es geht los das gleiche was wir in der beta schon dieganze zeit hatten moment press f paid respect leute ich mache mir mal ein window capturefür fehler dass ihr das auch gleich gleich in voller pracht genießen könnt sobald soist das doch schön da guckt er schon ja guckt da guckt er der siehts der siehts ein unrecavablewir können uns jetzt mal ein spaß machen draus machen und das ausprobieren das wisster so das gucken wir uns jetzt anwas bedeutet diese fehlermeldung wo wo finde ich das jetzt überhaupt aus ein bisschenklein so ok wo für klick klick und support wo ist support das steht da das steht ichsoll call of duty kommen gehen und auf support klicken wo ist das support gibt's nicht ichkann ja mal schreiben support support not found so shop anmelden mitmachen kundendienstkundendienst ok die wissen dass ok die fehlermeldung ist auf englisch das ist auf deutsch warumist die seite überhaupt auf deutsch nein nein ok weiß nicht wie die us wahrscheinlichus na gut ok kundendienst mobile seiten auf desktop in 2k17 gebadet sind wir richtiggebadet wie komm ich habe den kundendienst wie geht das ich kann die navigation das seitenicht ah ja ok so moment jetzt ist das viel zu groß hier resetnein ich will doch nur wissen was die fehlermeldung help help us nein mal ernsthaft wenn ich wirklichprob wenn ich wirklich hilfe bräuchte zu diesem fehler ich hätte keine ahnung beim bestenwill nicht wo ich hätte wirklich keine ahnung wo ich gucken wüsste improving lag and ingame performance oh das ist interessant es gibt gelaber so standard zeug also komm scheißdrauf wir spielen jetzt weiter war ja eher auch was gedacht start play aber das gehtschon geht schon wirklich sehr gut los did not quit properly das ist korrekt aber wirwollen kein safe mode anmachen das game erkennt wenigstens dass es gecrasht ist ok weiterim text das ist witzig klick und support du klickst an support das ist nichts in der nähewas irgendwie so aussieht als kannst du dir helfen support kommt die maus die maus supportkommt nächsten monat als dlc als loot box kommt das support wenn du glück hast wenndu glück hast siehst du den support aus der loot box aber ich mache das jetzt mal waseveli geschrieben hat das ist eine gute idee mal die fps auf 144 cap graphics siehst dudas wegen dass so muss das sein einstellungsorgie das ist die wahre pc master race so aufträgegibt es angeblich hat jemand im chat geschrieben denn wenn ich die aufträge nicht mache dannverschenke ich münzen und loot boxen aber die große complete orders get rewarded machich werde gemacht was möchtest probiert geht nicht toll hast du auch das gefühl dass diesens sich irgendwie je nach map unterscheidet dass die sens trotz der gleichen einstellungin game anders ist und dass es fast schon irgendwie an den fps zu hängen scheint wiehoch die sensitiver die von der maus ist jetzt geil jetzt ist wieder keine ahnung ich checkes nicht ach das ist gar ach das ist nicht der spiel modus headquarters das ist diesemap für loot boxen andré hat einen schönen text zu textur losen helm ok warte mal or dasavailable press f ich glaube dass mit dem press f meinen die nicht als witz das meinendie also nein hallo ich drücke f oh supply jobs jawoll die kriegen loot boxen wir müssendas geht es laut es geht leider nicht anders jetzt das geht leider nicht anderses ist nicht möglich wir müssen jetzt loot boxen aufmachen kam aber schnell so was gibtes ein grüner skin für den sekundäre raketenwerfer calling card calling card ist das das namensschildwas eingeblendet wird wenn man wenn man gekillt wird von jemandem no way emote kamen nächtessupply drop auf gehts bämba bämb schlag auf schlag gehts hier epic legendary zero in callingchaos so wir holen jetzt unsere aufträge ab pick up orders from major howard f ist abermuss gedrückt halten warum ganz toll ja next so hier kann man sich kann man sich jetztwahrscheinlich aussuchen was man haben will das machen wir das probieren wir mal aus späterwarmetsch rifle kills schaufel kills rifle kills rifle kills können wir auch machen 25matches das werden wir die woche auch hinkriegen 500 500 kills sagen wir mal so sagen wir malwir machen 15 pro game das ist jetzt schon wenn man eingespielt ist sogar noch relativwenig ja das geht auch 25 kills in tdm das werden wir früher oder später kriegen achman kann das man muss sich das gar nicht aussuchen man kann einfach alles annehmen ach nee okkann man auch machen da finde ich gar nicht schlecht dass sowas als erstes drinne istdas ist das finde ich nicht schlecht das regt wahrscheinlich die leute dazu an dass siesich die spielmodi mal angucken man kann ja auch aus dieser hub welt so pick up payrollda dahin machen wir noch was gibt es da payroll ok ach das ist deswegen haben die alle dentexturlosen helm auf das ist nicht das ist gar kein texturlose helm das ist der betahelm double xp go go ach so das kann man alles abpicken ok kapiertgut ok das ist tutorial das kann das kennen wir noch aus der beta man konnte ja jetzthier auf was ah xp muss ok ja ich weiß noch wie das funktioniertkönnt ihr euch noch dran erinnern wo ich später gespielt habe und an dem letzten tagwo ich gespielt habe versucht habe noch akimbo pistols zu kriegen und dann festgestellt habedass akimbo pistols der letzte scheiße ok gut dann gehen wir wieder in game reinund was hat das noch mit einem ego shooter zu tun ja es ist offensichtlich den ego shooterman shootet aus der ego perspektive also eins kann man call of duty nicht vorwerfen dasses kein ego shooter ist sah geradeaus wie das offizielle mmo bringt seltsam bringendie nicht auf ideen das ist die op shotgun map da müssen wir leider shotgun spielenjetzt aber man sieht wie gut das mit der maus funktioniertweil heute ist das ja auch nicht mehr so einfach gibt es ja nicht einfach nur fast persen shooteroder sowas heute ist das dann ein roguelike persen fps strategy multiplayer moba tile basedaction pack sonst war es shooter zu viel geschwätzt brand munition probiere ich jetzt gerade malaus wie das mit brand munition ist deswegen habe ich jetzt erstmal auch die shotgun wirwissen ob das immer noch so man ist langsamer man ist es kommt mir vor als man langsamerals in der beta was was aber nichts heißen muss ich habe jetzt das spiel auch eine weilemal gespielt seit der beta hallo konnte man da nicht raus da kommt von links was linkeseiteechtwar schon wieder um die ecke aber wir haben killstreak immerhin brand munition richtigwas ist nicht gestorbenjetzt aber das shotgun flickdachte es ist irgendwo hinter der wand wo war das dennok gehen wir auf die andere seitewir müssen jetzt das team das match gewinnen dass wir mission abschließenist mega op der scheiß feuer schaden gibt es immer noch nichtok ok ich glaube es ist nicht mehr ganz so op wie in der beta in der beta werden gestorbenmit der brand munition jetztwo sind die gegner links irgendwo da drinjetzt kommen sie von hinten ja ich habe also mir kommt auch so vor alswurde die brand munition genau was auch gut ist das war total sinnlos brand munition inder beta also total sinnlos opwas das sehr hässlich das dingman verliert die brand munition wenn man das wenn man das nur aufhebtalso achtung outplayedam besten war wir gerade die shotgun weggelegt hatten über das geländer geklettert istok man darf nicht mehr treffen also siehst du schon beim ersten mission erfüllt900 IQ playmp40 schnell feuer und großes magazin auf gehtshängt läuft aber nochok was kann man einstellendie püppisch gibt's wieder mp40prestige ernsthaft es gibt prestige waffenich hasse zu prestige in call of dutyihr mal da doch gerade geschrieben er spielt immer mp40 hast du schon prestigesprach sprain prey aus der hüftewie viele hacker bist du schon begegnet noch keinspieler erst seit einer halben stunde oder so maus legt wiederspielst du guitar hero nein nicht mehr es gibt überhaupt kein aktuelles gibt eswieder aktuelles guitar hero das war im multiplayer hat war das wirklichspassig von früher max das ist 90 von 90 von mir von kammer nicht machen waswarum ist man von nicht mehr das game hat man von einfach geändert ja sieht auchbesser aus also der pc fort scheint hallo spieler hoch scheint noch so das ein oderandere problem zu haben wahrscheinlich sparen sie jetzt so die call of duty liveshotgun wollte ich jetzt nicht unbedingt aufheben und wo kommt hier ein gegnerist es schweiber oder frasier guckt so und haben wir was sagst du zu dem gelbenbauer paar roten spielen man muss hoch hi crowd ist nicht der heutigen gegnerkein bock das war mir klar hallo wie funktioniert die map explain please jamacht es fühlt es fühlt sich auch ziemlich was ist von klang hier die besteübersetzung grob irgendwie an zäge träge träge ja das klobisch klobisch genauja klobisch ist klobisch trifft das gefühl hat in der beta noch nicht abervielleicht liegt es einfach daran die habe ich auch länger gespieltachtung krieg 17 900 IQ doch nicht weil ich habe nicht mal die granate geworfenbei dem das aber unfa dedicated service an all platforms ist das hier okay manmuss in das schiff rein schiff rein ist op weil hier unten ist mit einemkonnten es fressenmerkst du irgendwelche spürbar verbessern gegen mit der beta am anfanghabe ich verschlechterung gemerkt das spiel lief überhaupt nicht richtigjetzt habe ich einfach alles ausgestellt alles ausgeschaltet jetzt geht es aberes fühlt sich klobiger an irgendwie als in der beta aber das kann auch einfachnoch sein dass ich nicht gewöhnt nicht mehrgewöhnt binna ist das ein remake von hijack ich finde es hat gewisse ähnlichkeiten jaaber es ist es ist es ist irgendwie geräumiger in schiff in drinnen alsofight jacked wo geht es hier überhaupt langgeht es hier vorne raus ich will nicht team chates ist sehr schlecht wir schauen wo hier einer sport wo was herkommtdu rennst mit tausend sachen durch die map das doch gutist auch da das doch gut umso schneller das geht das fof macht aber auch einbisschen schneller das doch gut dass man schnell rennt movement muss meineransicht nach in einem guten game immer gegen camp action gewinnen ob das hierder fall ist bezweifle ich aber solltemax spielt gar nicht so schlecht ich sage total aber es ja auch die erstenpaar runden also wenn das spiel wirklich spaß macht und wir das relativintensiv spielen bis das spiel tot ist oder von heckern verseucht da werde ichbestimmt auch wieder die eine oder andere ziemlich gute gameplay hinlegen hoffeich war in der beta schon ein paar richtig gut dabei da kommt was da kommt was dakommt was lull recht nachladen der kommt jetzt durch gleich sag es euch derkommt jetzt durch also sind sehr inkonsistent muss ich sagen mal bises über den gegner drauf mal bis sie drüber dahinter vielleicht fehlt mireinfach noch bisschen routine in dem gelb muss ja nicht alles an der senzliegen kann auch einfach sein dass scheiße ziele das nächste gott für diefontrager theoretisch moment jetzt müssen wir wissen müssen wir müssen mitdas nächste gott müsste wieder von toriak sein ja also sprich das letztewar plege ob es drei oder auch ich kann sit salut okay macht das letzte vontoriak war plege ob es drei das hier davor infinite warfare war das weiß ichdavor war plege ob es drei und davor war advanced warfaredu hast den anfang verpasst am anfang habe ich das gelb übelst geflämt weiles auch beschissen lief ich hatte 37 fps37 mit der 1080 t 37 fpsdas war die map die so geruckelt hat am anfang gucken wir mal die gustav kanonekann sich doch gerade bei gustav kann sich noch einer an den an diesen karlgustav raketenwerfer aus bed company 2 erinnern der ursprung von no rpg undinf bring the war to them and bring it hard wir bringen ist hart random natecross im app klappt bestimmt easy ist recht das nicht sauber gemapt habenein paar gegner zur abwechslung denkst alle gegner sind weg instant aber amstartchaos das also 100 mit 100 fps kann man spielener koll auf duty zauen übrigens der typische koll auf duty zauenkoll auf duty ich brauche ja was anderes er ist am cheese hier nicht so der bringerstg gibt es hier nichtich weiß auch nicht wie ich meine ich will mich hinlegengehen wir nach hochja es war ein anderesHalt mal wieder!Ich weiß halt, wo die gegen her kommen.Oh, oh, oh.. Das ist schlecht, Artillerie.Die setzt ja bestimmt in die Mitte, wenn er clever ist.Ja.Oh, Bombe!Runter, runter, runter, runter!Und ich bin schon runter gesprungen!Aber der Typ ist mir hinterher gesprungenDie Aufträge muss man dem Headquarter abgeben, okay?Mach ich gleichZieht wenig Schuss das Ding, hä?Hallo- Moin!Da hat er die Arme geschlagen, jetzt!Oh, Call of Duty Tode!Wie viel halten die Dinger aus?Oh, da liegt ein Sniper, Achtung!Nein! Nein! Was hebst du meinen Sniper auf?Ich wollte den 900 IQ-Play machenSingleplayer muss ich mir auch anguckenDa bin ich mal gespannt, was sie da draus gemacht habenIch mein, Zweiter Weltkrieg ist ja schonWas Shooter angeht, ziemlich abgenutztDurch die ganzen Spiele, die rausgekommen sind früherAber es ist jetzt schon eine Weile herUnd es gibt immer noch genug Sachen, die man erzählen kannDa bin ich wirklich gespannt draufHat jemand von euch schon den Singleplayer gespielt?Komm raus, kommt raus!Ich weiß, dass ihr da raus kommt jetztWeg!Weg, bitte!Was?!WTF!WTF, ey!Was ist das?Auf 5-7, echt gutDie...Sag mal!Können die immer nicht von beiden Seiten kommen?Der will mich flankenKackeIch weiß nicht, wo ich langlaufen sollOkay, ich mach das...Ich spiele das alles viel zu aggressivHier muss man stelsenIch hab auf die FPS geguckt, anstatt auf den GegnerIch hab auf die FPS geguckt, anstatt auf den GegnerIch hab auf die FPS geguckt, anstatt auf den GegnerKomisches ZeugAh, das war das DingGeht einander mit der Shotgun rumDen holen wir uns hier obenZu vieleDas gibt's nicht sonst noch zur AuswahlWas kann denn das Teil?Oh ja, das war...NeeDas ist ja...Bisschen fettHeute ist ja nächstes Mal fettDas ist mir ja sickIch würd gern was sehenIch würd gern was sehenOh, SniperDas wird geschneibtMoment, was?Domo-MapMuss die Map sein, kann nicht an mir liegenWie ist ein Luftanhalten überhaupt gewesen?Shift, oder?Macht er aber nichtGeht vielleicht mit dem Visier nichtDie Map ist aber echt bisschen langatmischUnd ich weiß nicht, was ich machen sollZumindest hier nicht in die Mitte rennenWarum? Warum renn ich in die Mitte? Das ist total überknacktMoment, jetzt sind sie hinter unsDie sind hier hinter uns gekommenIch check's nichtWo sind die Gegner?Kann man hier raussnipern? NeinIch muss sagenSo den Flauder-Map hab ich nicht... gar nicht rausImmerhin einen weggeschneibtUnd wir haben gewonnenJa, hat äh, kann sein, dass ich jetzt im Chatüberlesen hab, hat jemand den Singleplayer gespielt?Und lohnt sich das?Nein, Comstar, MW Remastered hab ich nicht gespieltAh, Random Lootbox, wie in CSEin Rank-TokenWas macht das?Weiß ich nichtWas macht das?Was macht das?Was macht das?Was macht das?Was macht das?Was macht das?Was macht das?Was macht das?Ein Rank-TokenWas macht das, weiß man nichtOrders, soWind.iedm, das haben wir abgeschlossen, dann geben wir das mal abWarum man jetzt natürlich zum abgeben wieder in diesen komischen Hub strand muss, spielst du auf Max Settings Max? Nein.Ich hatte am Anfang relativ hohe Settings und ich hatte 37 FPS auf einer 1080 Ti.Jetzt habe ich Low bis Normal Settings.Und es läuft.Also was soll ich machen?Ich habe eigentlich überhaupt keinen Bock auf diese Kommission.Der Schatten sieht gut aus hier.Der Schatten sieht richtig gut aus.Und vor allem, warum ist da überhaupt Schatten?Ist das schon released? Ja.Ah ok, hier kann man sich dann Skins und so geben. Es könnte mir eigentlich kaum was egaler sein, um ehrlich zu sein.Skicker fragt, wird das Spiel mit einem i7 7700 und einer GTX 1070 vernünftig laufen? Ja.Garantiert.Allerdings nicht auf High, weil auf High läuft es auf einer 1080 Ti nicht gut.Das läuft schon.Von rechts kommt was?Schreckt. In the ass schreckt.Ich höre was von hinten. Also hier durch gefällt mir nicht.Gehe mal lieber durchs Haus.Du kommst doch bestimmt hier rein jetzt.Da ist er doch.Treppe campen, das sind Shooter. Treppe campen geht immer.Wir können mit unserer SMG nicht anstinken.Schreckt.Oh da kommt was rein.Ich weiß nicht von wo die kommen, von wo kommen die überhaupt?Von oben, ich bin von oben drauf gesprungen.Das hat keinen Sinn, das zu contesten mit der SMG.Was, bitte hilf.Der Health Rack ist ziemlich langsam.Max Reaktionszeit steigt, das stimmt.Das liegt aber hauptsächlich daran, dass ich die Maps nicht kenne.Ich habe keine Ahnung, wo die Gegner herkommen können.Das ist eigentlich das, was die Reaktionszeit von jedem steigert, wenn er weiß, auf was er sich einstellen muss.Das weißt du halt nur, wenn du die Map kennst.Der steht da oben am Fenster und wartet.Dann gehen wir jetzt hier lang und bashen den Typ, der da gleich lang kommt.Was, ich konnte mich nicht weiter drehen. Ich konnte mich nicht drehen, weil ich gegen die Wand gelegen habe.Das wusste ich gar nicht, dass das ein Ding ist.Das heißt, man kann sich nicht drehen.Okay, man kann sich nicht drehen.Ich bleib mir hier dahinter stehen.Max hat schon mal den War-Modus gespielt, nur in der Beta.Call of Duty Tode, laufend von der Seite.Der war gut in der Beta, ich fand den gut.Der hatte einige Probleme.Der ist unter uns, kommt hier hoch irgendwie.Ich verstehe die Call of Duty Tode oftmals nicht.Man sieht den Gegner eine Millisekunde und ist tot.Und er hat mich schon drei Stunden da oben stehen sehen.Aber wenn man die Maps kennen, dann geht das alles viel besser.Oh, die muss ich ausprobieren.Die waren gerade fünf, geil.Von außen war einer.Komm her.Was ist das?Okay, Häusercamp geht.Was ist übrigens Nahkampf?X? Nein, X ist Waffeankung.CS abklatscht, ey.Richtig.Mehr CS abklatscht kann es ja nicht sein.Lohnt sich das Spiel? Weiß ich noch nicht.Ich frage an, wie hackerverseucht das Ganze wird.Und solche Dinger.Wo sind denn Gegner?Ich muss weg.Bombe, Bombe. Nein.Bombe, Bombe.Bombe.Nein.Ich habe eine Bombe und die Rolle ist vorbei.Na toll.Sind wir mal nett, so wie sich das gehört.Ich würde warten.Wenn man das nicht gleich spielen will, dann würde ich warten.Dann würde ich mir das mal eine Woche angucken.Auf Streams und mal ein bisschen schauen.Was ist im offiziellen Forum los?Was wird geflammt und sich dann entscheiden, ob man es haben will?Wie ist die Spielerbasis auf dem PC?Wie viele Leute spielen das überhaupt?Und wie viele Hacker?Mir fällt es immer schwer, diese Leute Hacker zu nennen.Wie einfach wird es sein, so etwas für das Spiel herzustellen?In der Beta gab es schon am ersten Tag welche.Davon ist es abhängig, wie gut das Ganze funktionieren wird.Ob sich das lohnt.Oder alternativ, man sagt, euch interessiert nur das Singleplayer.Dann würde ich mir einfach mal einen Test durchlesen, ob das einen anspricht.Was Tommy, 14k Spieler online im Moment auf dem PC?Das ist ja nichts.Das ist nichts.Es ist wirklich nichts, 14k.Ah, das ist die Beta-Map.PC-Cod halt null.Das liegt an Activision beziehungsweise Entwicklerstudios und Activision zusammen.Das auf dem PC gut zu machen.Wenn das Spiel gut wäre auf dem PC, also guter Port, guter Support und Sachen, die es ausmachen.Wenn das alles gut wäre, dann hat es vielleicht am Anfang auch gut 14k.Würde aber steigen, weil das Spiel einfach gut ist.Und gute Spiele setzen sich mit der Zeit, meistens zumindest dann, auch halbwegs durch.Aber wenn das Spiel halt suckt.Dann nicht, ne?Warum ist der Typ tot?Schneiberkacke, ey.Was hat so ganze Sniper in einem Close-Quarter-Szenario zu suchen?Ich verstehe das nicht.Schon die ersten OP-Waffen aufgetaucht, keine Ahnung.In der Beta gab es einige.Oh, ich habe eine Donation, danke.Ich schau gleich rein.Falls nicht, flamet mich.Und sagt, ich soll reingucken.Was ist denn hier los?Na, super.Donation, danke für die Donation.Und zwar von...Das Zebaro hat donatet.Schon wieder.Du donatest immer so viel.Ich hoffe, du weißt.Ich freue mich da drüber.Aber du musst nicht donaten, ne?Du bist schon Mord und kümmerst dich um den Chat.Ich finde das natürlich super, wenn du donatest.Was hat er geschrieben?RIP an die Leute, die erst frei ab 18 haben.Lull.Eineinhalb Stunden verpasst feels Batman.Sind die FPS in Ultrasettings?Nein, nein, nein, nein, nein, nein, nein.Die FPS sind nicht in Ultrasettings.Renterrechner gut mit Gameplus-Stream.Ja, das läuft gut, aber die Settings sind low.Die Settings sind low.Weil vorher hatte ich 37 FPS.Ungelogen als, ne?Ihr habt es gesehen, 37 FPS.Perfekt.Suche einen Gegner.Werfen wir mal irgendwie so random, was?Hä?What?Okay.Okay.Haben sie die Waffe einfach schlechter gemacht als bei der Beta?Kommt es vor als Kriegsstamm, wenn nichts mehr droht?Außer wenn der Gegner nicht in meine Richtung guckt.Ich weiß nicht, was Nahkampf ist.Ich muss jetzt mal auf V, B, C, F.Was ist, was ist?Coup.Probier mal.Coup, Coup könnte Nahkampf sein vielleicht.Coup.Coup ist Nahkampf.Jawoll.Da schnippt er sich ein.Die Balken sind noch da, Tommy.Alles beim alten.Also alles beschissen, was das angeht.Ping-Balken.So lächerlich.Wirklich so lächerlich.Hinter mir.Fuck.Great hiding spots.Ja.Great hiding spots gibt es hier auch wieder viele.Ich hab Schiss rauszugehen.Krieg ich auf den Sack.Was?Warum steht er hier nicht?Ich hab ein halbes Magazin draufgeschossen in die Richtung.Also ich glaube, dass ich würde sagen, das ist so wie man das vermutet hat.Es sind Server im Einsatz.Ganz normale.Gehostet.Also nicht mit P2P.Aber wenn es keine gibt, gibt es halt P2P mit Horseman Crash und dem ganzen Kacke.Aber es ist selten.Spray and pray.Es wird gesprüht und gebetet.Aber ich hab das Gefühl, aus der Hüfte trifft man schlechter.Das wird es auch erklären.Warum ist in der Beta übelst abgehend das Setup mit dieser Shotgun?So dumm, ich wollte extra hinter die Wand laufen.Jetzt bin ich rausgelaufen.Ich hab das selbst gekauft.Ich hatte keine Lust, irgendjemand anzuschreiben, ob ich das Spiel kriege oder so.Ich hab draufgeschossen.Komm, wir gewinnen jetzt.Wir gewinnen jetzt.Jawoll.Ich hab das selbst gekauft.Wie gesagt, ich hatte keine Lust, jemanden anzuschreiben.Ich weiß auch aktuell gar nicht, wer bei Activision jetzt da der Ansprechpartner ist für sowas.Früher war es der Cloud, aber der ist ja bei NVIDIA mittlerweile.Und ich weiß nicht, ob er mittlerweile gewechselt ist oder immer noch bei NVIDIA.Zumindest ist das nicht mehr.Und ich glaube, sein Nachfolger ist es auch schon nicht mehr.Also ich hätte gar keine Ahnung, wer nicht anschreiben sollte wegen sowas.Hat dieses Cod Goldwaffen bestimmt?Ja, Sam Fischer.Ich sage auch gerade richtig.Du musst erstmal wieder halbwegs in das Spiel reinkommen.Während der Beta lief das richtig gut.Kann man was Neues ausrüsten?Ah.Moment, es gibt nichts mehr was aus der Hüfte verbessert, oder sehe ich das richtig?Heißt das richtig?Es gab doch in der Beta noch ein Attachment für SMGs, was das aus der Hüfte schießen verbessert hat.Oder bin ich jetzt total wir im Kopf?Ah nee, da war es doch.Da war es doch.Ich habe es einfach nur nicht gesehen.Ich habe aber noch geklickt, mal gucken, ob das jetzt gezählt hat.Ja kommst du, das finale Game läuft nicht so gut.Ah, das ist die Beta Map.Was?Was?Ich war doch schon längst wieder um die Ecke.Das ist typischer Call of Duty Tod gewesen.Typischer Call of Duty Tod war das.Und die Waffe macht auch über Range weniger Damage.Also die war in der Beta richtig gut hier.Nee, die Waffe ist irgendwie doof.Max Foff, wollen wir mal erinnern, dass das Foff wieder gesettet hat?Das ist Max Foff.Die Gegner kommen bestimmt hier lang, mal hinter mir.Irgendwie kriege ich gegen jede andere Waffe auf den Sack.Das Spiel läuft ganz gut mit Low Settings.Mit der 1080 Ti auf Low Settings, dann läuft es ganz gut.Moment.Wie habe ich den Typ eben gekillt?Also in der Beta war ich deutlich besser.Das war klar, der war angehattert.Der denkt, er kann mich flanken.Nö.Den juckt es einfach nicht.Den kehrt es nicht.Wir gehen mal nicht lang, wir versuchen die jetzt hier zu bashen.Das war mir zu viel egal.Wie können die mich immer killen, wenn ich sie nicht sehe?Das sind die typischen Call of Duty Tote.Das war einfach dumm von mir.Wir gewinnen, warum auch immer, wir gewinnen die Runden immer easy.An mir liegt es definitiv nicht.Was war das denn?Samulon.Das kannst du schon auf Key Seiten kaufen.Allerdings, wenn du dir dort die günstigste Version kaufst,kriegst du die Version für Russland.Was hier wahrscheinlich auch nicht viel bringt.Ich habe es ja schon ausgerüstet gehabt.Was haben wir jetzt für Pugs?Das ist alles jetzt nicht so geil.Das ist eine eigene Klasse.Spiel mal andere Waffen.Wo sieht man noch mal die Pugs von der jeweiligen Division?Also das Ding war in der Beta ganz gut.Hier muss man ganz schön viel leveln dafür.Und das SDG 44 war auch ziemlich gut.Wenn ich das mit Prestige unlock habe, habe ich es nach Prestige immer noch.Vermute ich jetzt einfach mal.Oh, das ist der Tomahawk-Ersatz.Das war nichts geklärt mit der Pistole.Falls der E-Ax am Start ist, irgendwann die Tage spielen wir mal ein bisschen War.Was gibt es denn die MP40?Ich habe schon gelesen, wenn man Prestige hat, muss man dann erst Prestige und dann noch ein gewisses Level erreichen,oder kriegt man die quasi mit dem ersten Prestige automatisch.Also ich Prestige jetzt quasi Airborne und dann kriege ich die MP40.Oder wie ist das?Oh, wieder Beta-Map.Warum das Spiel jetzt allerdings 104 GB groß ist, habe ich immer noch nicht verstanden.Mit dem ersten Prestige, also ich drücke auf Prestige und dann kriege ich MP40.Ah, Prestige in einem der Kids werde ich ja wahrscheinlich hinkriegen.Moment, hier lang zu laufen ist bescheuert für meine Waffe.Muss ja auch ein bisschen Gedanken machen.Ah, fuck.Vor allem, dass der direkt an meinem Teammate vorbeigelaufen ist.F-Intel wieder upload wäre das Todesjahr, ist es.Also ich weiß nicht, was man machen muss, das ist ein Game 100, 104 musste man auf der Zunge zergehen,104 GB, krasser Shit.Jetzt gehen wir dem ab.Call of Duty Tode, wo du guckst, immer von der Seite.Du musst nicht 104 GB downloaden, zu installieren ist es 104 GB.Das downloaden musst du nur 75 GB.Okay, kipp mich um.Nur, nur 74 GB.Was ist das?Die fallen nicht um, was ist denn da los?Oh, das war ver-aimed jetzt.Wie sind die Hacks?Ich hab noch keinen gesehen.Bis jetzt, das wird aber nicht lange dauern.Ich dachte mir, dass du da lang kommst.Nee, da geh ich jetzt nicht lang, da ist so voll.Gehen wir mal in der Mitte gucken.Links geht was.Hinter uns, BTF.Gefährlich.Gehen da jetzt mal durch.Das Gefühl ist, manchmal schießt das Zeug mit Papierkugeln.Drei, vier Hitmarker, das ist mir doch egal, da schieß ich einfach weiter.Du hast auf Hackerseiten schon den ersten Hack gesehen.Was machst du denn auf diesen Seiten, was man fragen darf?Würde mich ja mal interessieren, das ist wahrscheinlich rein zu Recherchezwecken.Oder?Bestimmt rein zu Recherchezwecken.Die Runde geht ganz gut.Aber wir verlieren.Papierkugeln wieder.Wir hatten auch die gleiche Waffe.Out Dynamics.Naja, ich reg mich da mittlerweile, also Balancing technisch bei Call of Duty aufregend.Klar, ich kann mich da auch aufregend, wobei hier durchzugehen ist das bescheuert, wenndie auf Position sind.Damage technisch reg ich mich natürlich auch auf, aber in Call of Duty steige ich michda nimmer so rein.Bei Overwatch könnte ich mich aufregend, weil das Game so unglaublich viel Potential hat.Und halt einige Sachen nicht so funktionieren.Wie ich mir das vorstelle.What the fuck.Es geht mit dem Typ ab.Mithilf.Komm wir gewinnen das jetzt.Leute, gewinnen.Fuck, verloren.Gleich Blizzcon.Mal gucken was da vorgestellt wird.Aber eins finde ich, was ich wenigstens, Gott sei Dank jetzt Ihnen mal aufgefallenist, dass man in Overwatch im Hauptmenü darauf hinweisen sollte, dass World Cup ist.Ich verstehe nicht, wie man dieses Potential bisher verschenkt hat, dass man nicht daraufhingewiesen hat.Quasi im Spiel.Hier gerade läuft ein von uns gesponsertes, von uns ins Leben gerufenes großes Turnier.Du musstest irgendwie Glück haben und alle 5-6 verschiedenen Overwatch Twitch Kanäleabonniert haben und das war ganz werkwürdig gemacht.So als hätte Blizzard keine Ahnung, wie man es macht, aber Blizzard müsste es eigentlichwissen.Was auch immer.Ja, Overwatch World Cup werde ich auch nachher gucken.Das müsste demnächst losgehen.Mal kurz schauen.Overwatch World Cup in einer Stunde, 1 Stunde 30, UK vs. England gegen Schweden.So rum.United Kingdom gegen Schweden.Danach, Kanada, Australien.Danach, China, Frankreich.Danach, Südkorea, USA, aber das ist erst in 6 Stunden.Ich werde wahrscheinlich schon pennen.Ratet mal, wer gerade noch bei Twitch online gegangen ist nach 3000 Jahren.Sebao.Wer könnte das sein?Wenn du das so sagst, jemand, den ich auch kenne.Ach, gibt's denn auch noch?Gibt's denn auch noch?Ich hab mal letztens bei ihm auf dem YouTube-Channel geguckt.War irgendwie ein halbes Jahr oder so und nichts mal hochgeladen.Also fast wie bei mir.Wie sie sich alle damals über ihn aufgedeckt haben.Oh, so schlimm und bla und sonst was.Ups, was mach ich denn da eigentlich?Was?Hä?Ich bin gesprungen hinter meinem Team-Mate?Okay, ja, was auch immer.Was ist eigentlich aus dem Friseur geworden?Der Friseur war vorher sogar im Chat.Die Waffe macht dir gar keinen Schaden.Der Friseur war vorhin sogar im Chat, dem geht's gut.Was ist das?Thompson mit...Oh, das ist cool.Das ist cool, das Ding.Oh, oh, ich hab ihn reloadet.Warum reload ich auch mit einem vorderen Gegner?Ja, Dynamix, das war klassischer Call of Duty-Tod wieder.Wir hatten heute schon ganz viele klassische Call of Duty-Tode.Was den Call of Duty auch noch mal gut hinkriegen ist,dass sich die eigene Waffe anfühlt wie Watterbällchen.Und die Gegnerwaffen mit Bam-Bom hinten.Und um die Ecke sterben. Um die Ecke sterben ist auch ganz wichtig.Ja, und außerdem, stimmt, außerdem streamt der Friseur gerade selber.Das wäre fast eine gute Granate gewesen.Den outplayen wir jetzt, den Typ. Outplay.Outplayed.NA-Nade, aber die wäre geil gewesen, wenn sie geklappt hätte.Übrigens sagen wir von den ganzen, voll aus.Das Ding macht keinen Damage?Was ist das?50, 15k Spieler am PC, lol, ja.Der Farmer, der geht voll auf in Black Desert Online.Ja, aber voll.Ich hab's probiert, ich hab's probiert anzufassen.Was mach ich da eigentlich?Ich hab's probiert, aber irgendwie, irgendwie packt mich BDO nicht.Donation, danke für die Donation. Ich guck gleich rein.Nachdem wir jetzt vielleicht mal von 5, 6 runterkommen.Hab ich nicht gesehen, kann ich jetzt auch Donat...Oh meine Fresse, ey, was mach ich?Ich bin heute einfach nur komplett...Gehirn-AFK, ey.Sehe meine Donations nicht mehr.Warum seh ich meine...Warum seh ich meine Donations nicht mehr? Manchmal ist Twitch komisch.Ich guck gleich.Achtung, Schneiber.Ja, ja, ich get it to cover, ich bin in cover.Ich camp hier jetzt einfach.Easy.Ich dachte, die ist meine Waffe.Kommt rein.Kommt noch einer, kommt noch einer.Achtung, Achtung, den bombe ich jetzt raus von der anderen Seite.Nein, er hat mich, er hat mich gekillt.Siehste, kaum mal ein bisschen konzentriert, schon die Gegner gereckt.Nicht so viel schwätzen, mehr konzentrieren.War das last stand oder was war das?Der lag so komisch auf der Erde.Von wo kommt was, von hinten?Von hinten, von vorne?Ich weiß es nicht genau, ich muss jetzt mal ein bisschen aufpassen.Von drüben?Von hinten?Da sind überall um mich herum Leute.Ich check nicht von welcher Seite was kommt.Links?Ich wollte nackt, ich wollte mehlen.Aber was gut ist, man hat nicht mehr diesen Sprung beim Nahkampf.Das ist sehr gut.So, Donation, mein Dashboard.Nochmal vom Sebaro mit F.Für die Aufrechtung der Asiatischen Feinkostenlehnen in Frankfurt null.Danke.Ja wenn es danach geht, habe ich ja schon das halbe Bahnhofsviertel gerettet quasi.Wie oft ich da schon Asia all you can eat futtern war, das kannst du nicht mehr zählen.Das war das hässliche Ding, was den kompletten Bildschirm voll gemacht hat.So kann man dem Ding jetzt was ordentliches ausrüsten.Ich fand ehrlich gesagt die Landside gar nicht so schlecht.Steady Amp, Steady Amp brauche ich dann wenn es so weit ist.Habe ich neues?Kein neues Park.Hallo Kienic20.Der Eax schaut zu.Eax wie sieht es aus, hast du das Game?Wollen wir morgen oder so mal bisschen War spielen?Weil das glaube ich kann man alleine nicht gescheit spielen.So, was auch immer wichtig war in Call of Duty, so langsam aber sicher komme ich da wieder rein.Man musste sich einfach eine gute Eröffnung für das Team Deathmatch auf jeder Map merken.Also quasi so, wo geht die erste Granate hin, wo ist ein guter Default Weg.Auf der Map tendiere ich entweder rechts oder gleich ins Haus.Stopp ins Haus kommt mir sinnvoller vor.Ich muss bloß gucken zu welcher Zeitpunkt wer ankommt auf der Map von welcher Seite.Von hinten, genau jetzt gehen wir nämlich direkt durch ins Haus von hinten.Zack direkt, falls da noch einer hoch will.Jetzt gehen wir in die Mitte falls einer die Treppe hoch will.Gucken von wo was kommt, von hinten.So jetzt kommt wahrscheinlich gleich was von links.Rechts, rechts, ich hör was von links, sind meine, da war was.Wir nehmen mal was mit Range kurz, dass wir besser aus dem Fenster ballern können.Ist nix da, da kommt bestimmt gleich Wasser, komm, komm her.Erwischt, hinten, hinten, hinten kommt er.Sehst du, kaum mal ordentlich gespielt, schon gibt es auch Smog.Ich sehe keine Gegner, gleich Rakete rein.Links, rechts, rechts, rechts, rechts, rechts.Den holen wir, den holen wir, der weiß nicht, dass wir da sind.Erwischt.Na 9-0 jetzt muss er mal Pogchamp hier in Chat, 9-0 jetzt geht es ab.Ich muss mal weg, bisschen aus, bisschen Sicherheit.Bisschen in Sicherheit.So, so, so ist alles gut.Weil in die Mitte durch ist wahrscheinlich...Was?Da kommt die Moab, da ist die Moab Leute.Da ist die Moab.Da ist die Moab, pass auf hier, gleich schlägt sie ein.Bäm, die Moab.Was? Ich wusste, dass der da hinten ist, aber nicht wo.GG Eats.VTF, was ist hier los? Spawnst, kriegst...Hier ist einer.Warte, Bällchenwaffe.Oh, da oben am Fenster, da kann ich nicht contesten in der Mitte.Gehen wir mal gucken, wie wir in das Haus kommen.Das einfachste...Fuck, fuck, fuck, bomb wird nicht zu mir.Wow, knapp.Bässe dürfte eigentlich hier rein sein.Mann, das bin doch ich.Okay, woran ist der gestorbener Typ?Achtung, Trick 17, Leute.Fuck.Fuck, na gut, ich war angehitten, was soll ich machen?Die Fallschirmjäger fand ich in der Beta schlecht.Die waren viel größer als die Hunde, die konntest du total leicht abknallen.Oh Gott, ey.Call of Duty Tode, von hinten immer.17-4, jetzt läuft's.Die...Warte, Bällchen.Warte, Bällchen.Okay, ich hab ihn bei ihm gar nicht getroffen.Verstehen.Seems legit.Achtung, wir gehen jetzt ans Fenster.Schießen da raus, weil da drüben steht einer, garantiert.Nett.Aber gleich.Guck, da ist schon der erste reingegangen.Na gut, ich war zu sehr angehitten, ich hätte mich hinlegen müssen und hoffen, dass dernicht trifft.Okay, das sollten wir nicht mal verlieren.Ey, wie ist Call of Duty so anstrengend?Da ist ein Kopf, siehst du den nicht?Da ist ein Kopf.Doch, er hat ihn gesehen.Ich kann acht Stunden Battlefield 3 oder 4 oder so spielen, juckt mich nicht.Irgendwie zwei Stunden Call of Duty gespielt, voll kaputt.Gut, aber ich hab auch da acht Stunden, naja, nicht ganz.Sechs Stunden gearbeitet.Ja, also die M1 hat einen guten Eindruck gemacht, so nach dem Motto, tappt schnell, two-shottedGegner.Mir fällt auch noch ein, woran das liegen kann, dass ich irgendwie so ein bisschen wackelig,wackelig aime.Das liegt daran, dass ich gerade wieder im Stehen an meinem high-end, high-tech, hoch-höhenverstellbarenSchreibtisch spiele.Und im Stehen ohne Auflage für den Arm ist halt ziemlich wackelig.Kannst du schon sagen, ob das Spiel sich lohnt?Ne.Das Spiel an sich macht Spaß.Das hat mir auch in der Beta Spaß gemacht.Man hat lange Zeit wieder in Call of Duty.Ich mein, wahrscheinlich haben sich sogar hier auch schon ein paar gewundert, warum ichdenn so oft Call of Duty gestreamt hab in der Beta.Ich spiele heute im Stehen oder den, ja.Das Problem ist, Call of Duty auf dem PC ist gar nicht mal so sehr die Frage macht Spaß,sondern gibt es noch, wie viele Spieler gibt es noch in einem Monat, sagen wir mal?Und wie sieht es mit Cheatern aus?Damit steht und fällt das.Sollte sich das wirklich jetzt rausstellen, dass das Spiel über lange Zeit, der Schattenda, lull, was denn das, dass das wirklich cheaterfrei läuft und gut läuft und alles.Also, und wenn sie das Spiel auch noch gut supporten auf dem PC, auch ein paar Patchesbringt und sowas, hey, ich glaube, die Chancen stehen nicht schlecht, dass dann sogar dieSpielerzahlen theoretisch steigen könnten.Call of Duty Tod, typischer Call of Duty Tod wieder.Aber die Spielerzahlen werden wahrscheinlich nicht steigen.Na, ich spiel nicht immer im Stehen, weil kein jemand gefragt hat.Ich spiel nur manchmal.Warte, Bällchen!Call of Duty Tod.Warte, Bällchen!Gefolgt von Call of Duty Tod.So, noch was anderes hier kommt.Damn, Shotgun.Also, ich spiele es nicht immer im Stehen, doch manchmal.Erstens, wenn ich schon so einen krassen Schreibtisch habe, muss ich das ausnutzen.Zweitens, ist das für den Rücken angenehmer.Dauerfeuerabbrei, das ist Call of Duty.Was denn sonst?Haben wir schon einen Kill gemacht.Oh!Sehr gut, sehr gut.Okay.Ich muss mal recken.Na gut.Da konnte ich jetzt von der Seite nichts dagegen machen.Das Teil ist zu OP.Also, haben es abgeschwächt.Es ist nicht mehr so OP wie in der Beta.Ich habe das Gefühl, die Range ist nicht mehr so groß.Also, wo das zuverlässig die Leute killt.Und ich habe auch das Gefühl, aber das kann sein, dass sie mich das täuscht.Dass das Feuer langsamer killt.Moment.Der Typ war hinter mir.Die Schreie, ja.Was machen die neue Max-FPS in 8700K?Ich spiele noch auf dem alten Rechner.Reckt.900 IQ Play.900 IQ Play.Fast.Ejax, hast du es vorher mitgekriegt?Oder vielleicht hast du was schon geschrieben?Hast du morgen Lust, ein paar Runden auf neuen Modus zu spielen?Besser am Start.Nice, dann spielen wir morgen.Ich glaube, so richtig lange Killstreaks sind mir da ganz schwer.Warum habe ich keine Granate?Hab ich keine Granate?Doch, hab ich. Was ist das?Was ist das?Flare oder so?Von hinten kommt was?Call of Duty, tot.Das Spiel ist generell, was sowas angeht, aus Serialitätskontroll.Die Frauen für die Wehrmacht an der Front.Was ist denn das?Das ist der Thompson mit Trommelvisier.Das war im World War Richtig geil.Du musst in der Ecke campen, Sentries aufstellen und Schilde.Du meinst wie der Typ auf dieser, wo ich mal ein Video gemacht habe,auf der Black Ops 2 Schiffs Map.Gibt es Sentries als Killstreaks?Killstreaks müssen wir uns mal angucken, genau.Das funktioniert nicht.Killstreaks müssen wir uns mal angucken.Was haben wir denn so? Recon?Artillery? Bomb?Counter-SUAV?Fighter Pilot.Was macht der denn?Was macht denn der Fighter Pilot?Und warum muss ich Prestige Tokens dafür verwenden?Nee, dann...Dann lese ich mir erstmal durch, was das Ding überhaupt macht und gucke mir ein paar Videos an.Sam Fischer, das ist nicht die Standardklasse.Das gibt überhaupt keine Standardklasse, die das hat.Die Kampagne muss ich mir auch mal angucken.Ich bin mal wirklich gespannt drauf, was sie draus gemacht haben.Wir bringen es hart, jetzt wird weggecockt.Wie gut ist das Spiel? Kommt es wirklich an den ersten Teil ran?Call of Duty 1? Ja gut, Call of Duty 1 ist das C-End ja.Watt? Call of Duty 1 ist sehr in die Arche gekommen, das würde ich jetzt auch nicht unbedingt spielen.Ansonsten macht es Spaß, aber es ist halt Call of Duty auf dem PC, das muss einem klar sein.Das heißt, man weiß nicht, wie das aussieht in ein paar Tagen, Wochen.Wie das aussieht mit Cheater und solchen Sachen.Achtung, Yolo, Yolo.Oh, Call of Duty Tod, jedes Mal, jedes Mal aus einer anderen Richtung.Ja, Kampagne gucke ich mir dann morgen mal an.Ich muss auch gleich was futtern.In der Beta meinst du doch, wirst du nicht mehr spielen?Tja, es interessiert mich, was ich in der Beta gesagt habe.Es interessiert mich, was ich in der Beta gesagt habe.Das ist ja auch schließlich meine Kohle, kann ich ausgeben, für was ich will.Hier hinten ist schlecht, mit meiner SMG rum zu laufen, das ist einfach zu lange Range.Alter!Oh, was ist das? Das sieht über Range ganz gut aus.Ich habe keine Ahnung, was das ist, das sieht abgrundtief hässlich aus.Was ist das?LMG, hä?Outplayed, Outplayed.Was? Was? Ich glaube, ich habe vorbei geschossen, oder? Ich glaube, ich habe schlicht und ergreifend vorbei geschossen.Ich glaube, ich habe schlicht und ergreifend vorbei geschossen, aber jetzt vorbei geschossen.Oh, was geht hier oben ab? Wo bin ich hier überhaupt?Habt ihr gesehen, ich habe noch einen Nahkampf reingedrückt.Panic Knife hätte jetzt gekotzt, da hätte ich nämlich One-Shotted.Was?Alter, warum höre ich den nicht? Den hätte ich doch hören müssen.Ich habe das schneller klettern mittlerweile.Da lasse ich mich nicht drauf ein.Der verfolgt mich bestimmt, der ist bestimmt hinterher.Was war denn der erste Treffer bitte? Hitmarker.Call of Duty Wand. Darf man nicht drüber. Das Knie hoch.Der ist hinter mir.Dauerfeuer Abenteuer.Jetzt geht es ab.Na gut, das waren zu viele.Die Kopfhörer. So, hallo. Ich rufe den Defeat an.Eigentlich muss ich jetzt den Schreibtisch runterfahren.Ich glaube ich mache jetzt Schluss, gehe was futtern und dann gucke ich mir Overwatch World Cup an.Ich habe doch eben geguckt. In einer Stunde fängt das an.competitive Overwatch gucke ich nach wie vorher gerne. Und ich reg mich beim zugucken auf, das ist schlimm.Ich reg mich beim zugucken so sehr auf über das Game, so wenn ich mir 2CP angucken muss zum Beispiel, da kriege ich Anfälle.2CP kriege ich Anfälle. Vor allem wenn es so diese typischen Fights gibt, die nur durch irgendeine Kacke gewonnen werden.Weil Overtime oder weil das erste Team versucht hat den ersten Punkt gut zu defenden und dafür Ultimates eingesetzt hat.Das ist ja ein 2CP so bescheuert gemacht. Du versuchst den ersten Punkt gut zu verteidigen und wirst dafür bestraft auf den zweiten Punkt.Das ist total, ich weiß nicht was Blizzard da designt hat. Und vor allem scheint Blizzard auch wirklich sehr stur zu sein was das angeht.Und er kennt einfach nicht an, dass 2CP ein scheiß Modus ist. Max hast du schon die Placements gemacht? Nein.Werde ich auch nicht. Bis ich das Rankingsystem von Overwatch nicht ändert in irgendwas Spielbares.Ich reg mich da nur noch drüber auf, zumal das Game einfach so viel Potenzial hat und sie verkacken es.Es kann doch nicht sein, dass Mercy, Wontrick, Skrills im Grandmaster-Rum schwirren zuhauf.So mein Problem ist nicht, dass das Skrills sind, sondern dass das Mercy, Wontrick Leute sind.Overwatch ist ein Game, das skilltechnisch nicht rein über den einzelnen Held, sondern die Overwatch-Helden haben jetzt alle für sich gesehen.Genji Tracer gibt es schon ein paar, die eine gewisse Tiefe haben, aber die meisten Helden haben nicht die Tiefe und nicht das hohe Skillcap, was man jetzt sagen könnte.Wie das jetzt in CS oder so ist, da macht es einfach die Menge aus der Helden, die man gut spielen kann.Kann man irgendwie, keine Ahnung, Saria, Genji, Tracer gut spielen? Das ist nicht einfach, die alle 3 richtig gut spielen zu können.Komm raus!Von hinten, von hinten, den holen wir, den holen wir von hinten, der wird geschreckt.Du bist nicht mehr da. Jetzt kommt von rechts was? Was? Okay, du denkst, dass ich weg bin, du denkst das. Ich bin aber nicht weg.Okay, Wartebällchen, wir bräuchten echt so ein Hashtag-Wartebällchen, Wartebällchen und noch angehitted.Wo hatte auch viel Potenzial, sagt der Sampfischer. Ja, aber Wo hat sein Potenzial schon genutzt, zumindest die ersten 3 Expansions.Irgendwann ist aus allem die Luft raus. Da kann man auch noch so viele Addons bringen. Irgendwann ist die Luft raus.Was soll ich denn hier noch machen? Was ist das hier wieder? Der war übelst zerstört.Ich habe schon alles gemacht, was ich machen konnte gegen die 2. Oh, Schneiber. Jetzt werden sie geschnippt.Ich werde es jetzt so krass schneibern. Ich weiß gar nicht, wo sie sind.Suche Gegner. Wo sind denn Gegner?Warte, von hinten. Alter, ich will Rage quitten. Wie kann ich Rage quitten?Wtf 104GB, wofür denn bitte? Das frage ich mich auch. Warum 104GB? Verstehe ich nicht. Ich muss jetzt Rage quitten.Ist die Maus besser als in der Beta? Also am Anfang war die Maus viel schlechter. Aber nachdem ich jetzt Grafik Settings alles ausgestellt habe, was es so gibt.Und das mit der 1080Ci lief es gut. Das was wir eben gespielt haben war die Map, auf der wir angefangen haben. Und da hatte ich 37 FPS. Eben hatte ich 140 oder so.So. Ja, Low-Quality. Nur dann läuft es richtig. So, morgen geht es weiter. Dann bin ich ausgeschlafen und ich hoffe, dann läuft es auch wieder ein bisschen besser.Weil auf den Sack zu kriegen macht keinen Spaß. Kennt jeder wahrscheinlich. Wie lange war ich jetzt eigentlich on? 3 Stunden. Alles klar Leute.Ich gehe jetzt was essen. Dann gucke ich Overwatch World Cup. Und wir sehen uns morgen. Machts gut. Bis zum nächsten Mal. Tschüss.Das war's für heute. Bis zum nächsten Mal. Tschüss.Das war's für heute. Tschüss.Das war's für heute. Tschüss.", "segments": [{"id": 1, "start": 60.0, "end": 67.0, "text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal."}, {"id": 2, "start": 90.0, "end": 104.0, "text": "So, ich bin am Start. Was geht?"}, {"id": 3, "start": 104.0, "end": 110.0, "text": "Die ganze On-Screen-Liste ausmachen hier."}, {"id": 4, "start": 110.0, "end": 117.0, "text": "Mal gucken, ob uns das Spiel heute nicht gebadet."}, {"id": 5, "start": 117.0, "end": 125.0, "text": "Soll ich euch mal sagen, was richtig... Ich bin zu laut."}, {"id": 6, "start": 125.0, "end": 130.0, "text": "Also wahrscheinlich nicht bei euch, sondern bei mir im Ohr bin ich zu laut."}, {"id": 7, "start": 130.0, "end": 137.0, "text": "Das muss ich gerade mal umstellen. Blablabla. Jetzt bin ich zu leise. Blablabla. Blablabla. Ja, so ist das schön."}, {"id": 8, "start": 137.0, "end": 148.0, "text": "Jetzt wollte ich Ihnen jetzt sagen, wisst ihr was? Das Game hat zum runterladen 104 Gigabyte."}, {"id": 9, "start": 148.0, "end": 157.0, "text": "Stellt euch das mal vor. 104 Gigabyte, das ist... Was haben die denn da gemacht?"}, {"id": 10, "start": 157.0, "end": 167.0, "text": "Hostet man da irgendwie die Private Cloud von... Wie heißt der Typ von Activision, Bobby, irgendwas?"}, {"id": 11, "start": 167.0, "end": 172.0, "text": "Was machen die mit 100? Meinen die im Hintergrund irgendwelche Bitcoins auf unseren Rechner?"}, {"id": 12, "start": 172.0, "end": 177.0, "text": "Oder was machen die 104? Wobei, das braucht nicht besonders viel Speicherplatz, ne?"}, {"id": 13, "start": 177.0, "end": 183.0, "text": "Aber 104 Gigabyte, was ist denn da drin?"}, {"id": 14, "start": 183.0, "end": 187.0, "text": "104 Gigabyte kannst du wahrscheinlich die letzten drei Battlefields zusammen runterladen."}, {"id": 15, "start": 187.0, "end": 193.0, "text": "Inklusive aller DLCs. Ich verstehe das nicht."}, {"id": 16, "start": 193.0, "end": 197.0, "text": "So, ganz wichtig, was wir jetzt am Anfang mal machen, müssen wir mal in die Settings gucken."}, {"id": 17, "start": 197.0, "end": 203.0, "text": "Und ich muss mal ein bisschen rein und raus tappen, weil ihr erinnert euch vielleicht noch an die Beta."}, {"id": 18, "start": 203.0, "end": 207.0, "text": "In der Beta ist das Spiel immer abgekackt, wenn man rein und raus getappt ist."}, {"id": 19, "start": 207.0, "end": 213.0, "text": "Das war halt richtig am PC Master Race Port wieder gewesen, das Ganze."}, {"id": 20, "start": 213.0, "end": 216.0, "text": "Sind die Menüs eigentlich mittlerweile besser am PC?"}, {"id": 21, "start": 216.0, "end": 219.0, "text": "Nein, die Menüs sind immer noch genauso scheiße wie in der Beta."}, {"id": 22, "start": 219.0, "end": 222.0, "text": "Jetzt haben mir wieder Leute unter meinem Video geschrieben, ne?"}, {"id": 23, "start": 222.0, "end": 225.0, "text": "So nach dem Motto, Max, du hast den Sinn einer Beta nicht verstanden."}, {"id": 24, "start": 225.0, "end": 229.0, "text": "Das ist deine Beta, da muss noch nicht alles funktionieren."}, {"id": 25, "start": 229.0, "end": 236.0, "text": "Naja, ich dachte, er sagt jetzt mal nichts zu."}, {"id": 26, "start": 236.0, "end": 239.0, "text": "Aber man sieht, es hat sich zumindest im Punkte Menü nichts geändert."}, {"id": 27, "start": 239.0, "end": 244.0, "text": "Die Dinger hier kann man immer noch nicht, man kann die Menüs immer noch nicht richtig mit dem Mausrad navigieren."}, {"id": 28, "start": 244.0, "end": 251.0, "text": "Man kann die Settings hier, Brightness, kann man immer noch nicht mit dem Mausrad adjusten."}, {"id": 29, "start": 251.0, "end": 255.0, "text": "Ich muss das jetzt einfach auf Englisch, ich weiß nicht, warum ich das jetzt... muss das jetzt sein."}, {"id": 30, "start": 255.0, "end": 260.0, "text": "So, ganz wichtig, die Colorblind Filter Intensity."}, {"id": 31, "start": 260.0, "end": 264.0, "text": "Die ist unglaublich wichtig, dass die eingeblendet wird, wenn der Colorblind Modus aus ist."}, {"id": 32, "start": 264.0, "end": 267.0, "text": "Ganz wichtig, super."}, {"id": 33, "start": 267.0, "end": 270.0, "text": "Blut natürlich an, Minimap lassen wir auch an."}, {"id": 34, "start": 270.0, "end": 273.0, "text": "Motion Blur ist der Teufel in jedem Game."}, {"id": 35, "start": 273.0, "end": 278.0, "text": "Motion Blur muss weg."}, {"id": 36, "start": 278.0, "end": 282.0, "text": "Äh, nein."}, {"id": 37, "start": 282.0, "end": 287.0, "text": "Was gibt es sonst noch für Settings?"}, {"id": 38, "start": 287.0, "end": 290.0, "text": "Ist die Lautstärke eigentlich so okay, wenn ich..."}, {"id": 39, "start": 290.0, "end": 294.0, "text": "Wir warten mal bis in Game."}, {"id": 40, "start": 294.0, "end": 298.0, "text": "Guck mal, es gibt einen Foff Slider, den gibt es immer noch, den darf man natürlich nicht mit der Maus bewegen."}, {"id": 41, "start": 298.0, "end": 301.0, "text": "Aber mit den Pfeiltasten, das ist okay."}, {"id": 42, "start": 301.0, "end": 305.0, "text": "Moment, wie viel Foff geht? 95 Foff."}, {"id": 43, "start": 305.0, "end": 307.0, "text": "Gucken wir, wie das aussieht in Game gleich."}, {"id": 44, "start": 307.0, "end": 312.0, "text": "Screen Refresh Rate, nee nee 144, bitte schön."}, {"id": 45, "start": 312.0, "end": 318.0, "text": "Maximum FPS, äh, warum gibt es überhaupt kein Maximum bei FPS?"}, {"id": 46, "start": 318.0, "end": 320.0, "text": "Also, naja."}, {"id": 47, "start": 320.0, "end": 322.0, "text": "Aber okay, mit 150 kann ich leben."}, {"id": 48, "start": 322.0, "end": 325.0, "text": "In Overwatch ist bei 300 FPS auch Schluss, das ist okay."}, {"id": 49, "start": 325.0, "end": 331.0, "text": "Äh, wie sync? Aus."}, {"id": 50, "start": 331.0, "end": 333.0, "text": "Blut natürlich an, Max will Gewalt sehen."}, {"id": 51, "start": 333.0, "end": 335.0, "text": "Äh, wisst ihr? Nee."}, {"id": 52, "start": 335.0, "end": 338.0, "text": "Das liegt gar nicht mal daran, weil ich Gewalt sehen will."}, {"id": 53, "start": 338.0, "end": 344.0, "text": "Sondern, weil, je nachdem wie das implementiert ist, Blut quasi so was wie ein Hitmarker ist."}, {"id": 54, "start": 344.0, "end": 346.0, "text": "So, was gibt es hier sonst noch zum Einstellen?"}, {"id": 55, "start": 346.0, "end": 349.0, "text": "Window, ganz wichtig, ohne HDR Output."}, {"id": 56, "start": 349.0, "end": 352.0, "text": "Gut, da könnte ich es an Fernseh streamen, das brauch ich jetzt nicht."}, {"id": 57, "start": 352.0, "end": 354.0, "text": "Weil mein Monitor hat noch kein HDR."}, {"id": 58, "start": 354.0, "end": 358.0, "text": "Aber ich hoffe mal, dass ich in Zukunft Monitore durchsetzen..."}, {"id": 59, "start": 358.0, "end": 361.0, "text": "...ähm, werden mit HDR."}, {"id": 60, "start": 361.0, "end": 366.0, "text": "Ich wünsche mir, ja, und ich hab gesehen, dass glaube ich, äh, Asus und..."}, {"id": 61, "start": 366.0, "end": 368.0, "text": "Was war denn das sonst noch für ein Monitorhersteller?"}, {"id": 62, "start": 368.0, "end": 370.0, "text": "Acer, glaube ich, oder so."}, {"id": 63, "start": 370.0, "end": 372.0, "text": "Die haben was in der Richtung angekündigt."}, {"id": 64, "start": 372.0, "end": 381.0, "text": "Sowas in der Richtung von wegen 4K 144Hz oder 240Hz HDR Monitor."}, {"id": 65, "start": 381.0, "end": 387.0, "text": "Natürlich wird das Ganze nicht mit 4K 240Hz plus HDR laufen."}, {"id": 66, "start": 387.0, "end": 391.0, "text": "Weil ich glaube, es ist noch keine Anschlussmöglichkeit gefunden, was diese Bandbreite übertragen könnte."}, {"id": 67, "start": 391.0, "end": 393.0, "text": "Aber das will man ja auch gar nicht."}, {"id": 68, "start": 393.0, "end": 395.0, "text": "Das will man ja auch gar nicht."}, {"id": 69, "start": 395.0, "end": 399.0, "text": "Man will, und das ist das, das habe ich damals mal mit einem von, von, von..."}, {"id": 70, "start": 399.0, "end": 402.0, "text": "...einem von Asus erzählt, der wusste gar nicht."}, {"id": 71, "start": 402.0, "end": 409.0, "text": "Der hat gar nicht, glaube ich, richtig verstanden, warum ich einen 144Hz 4K Monitor wollte."}, {"id": 72, "start": 409.0, "end": 411.0, "text": "Bis ich ihm dann mal erklärt habe, ich will das nicht zum Spielen."}, {"id": 73, "start": 411.0, "end": 417.0, "text": "Ich will 4K für den Desktopbetrieb und 1080p at 144Hz für Spiele."}, {"id": 74, "start": 417.0, "end": 421.0, "text": "Da ist ihm das dann eingeläutert und ich dachte, das ist ja eigentlich so, das ist gar nicht so schlecht."}, {"id": 75, "start": 421.0, "end": 425.0, "text": "Naja, gut, genug gelabert. Was gibt es hier sonst noch so einzustellen?"}, {"id": 76, "start": 425.0, "end": 427.0, "text": "Ich finde es immer schön, dass die Sachen so toll benannt sind."}, {"id": 77, "start": 427.0, "end": 433.0, "text": "Pre-T2X Resolution."}, {"id": 78, "start": 433.0, "end": 438.0, "text": "Ich will eigentlich nichts absampeln."}, {"id": 79, "start": 438.0, "end": 446.0, "text": "Moment, ich will nichts absampeln."}, {"id": 80, "start": 446.0, "end": 448.0, "text": "Was?"}, {"id": 81, "start": 448.0, "end": 450.0, "text": "Keine Ahnung."}, {"id": 82, "start": 450.0, "end": 455.0, "text": "Post-Processing wollen wir eigentlich in der Regel gar nicht haben."}, {"id": 83, "start": 455.0, "end": 462.0, "text": "Ich will ordentliches..."}, {"id": 84, "start": 462.0, "end": 465.0, "text": "Ähm..."}, {"id": 85, "start": 465.0, "end": 469.0, "text": "Ich lasse es jetzt einfach mal so."}, {"id": 86, "start": 469.0, "end": 472.0, "text": "Das wollen wir nicht."}, {"id": 87, "start": 472.0, "end": 474.0, "text": "Off, geht es off? Jawoll."}, {"id": 88, "start": 474.0, "end": 478.0, "text": "Wir wollen, dass alles scharf ist, überall."}, {"id": 89, "start": 478.0, "end": 482.0, "text": "Guck ich mir vielleicht, wenn es nicht gut läuft, gucke ich mir das vielleicht nach an."}, {"id": 90, "start": 482.0, "end": 487.0, "text": "Ich spiele übrigens noch nicht auf meinem neuen Rechner."}, {"id": 91, "start": 487.0, "end": 490.0, "text": "Warum lacht er so?"}, {"id": 92, "start": 490.0, "end": 493.0, "text": "Ich spiele noch nicht auf meinem neuen Rechner, ich spiele noch auf meinem alten Rechner."}, {"id": 93, "start": 493.0, "end": 498.0, "text": "Mein alter Rechner ist auch schnell genug."}, {"id": 94, "start": 498.0, "end": 505.0, "text": "Sehen 1080p auf einem 4K-Monitor genauso aus wie auf einem normalen 1080p-Monitor."}, {"id": 95, "start": 505.0, "end": 511.0, "text": "Naja, du musst, wenn es ein richtiger 4K-Monitor ist, musst du das natürlich schon upscalen."}, {"id": 96, "start": 511.0, "end": 513.0, "text": "Weil es ist halt ein 4K-Panel dann."}, {"id": 97, "start": 513.0, "end": 518.0, "text": "Aber wenn es der Monitor gut macht, wirst du da nicht viel Unterschied sehen."}, {"id": 98, "start": 518.0, "end": 524.0, "text": "Zeigt bei euch der Stream 720p mit 60 FPS an?"}, {"id": 99, "start": 524.0, "end": 528.0, "text": "Oder habe ich da irgendwas an den Einstellungen verkackt?"}, {"id": 100, "start": 528.0, "end": 532.0, "text": "Sollte aber."}, {"id": 101, "start": 532.0, "end": 535.0, "text": "Gucken wir uns das Ganze mal an."}, {"id": 102, "start": 535.0, "end": 541.0, "text": "Und in der Hoffnung, das Spiel kackt nicht mal so viel ab wie in der Beta."}, {"id": 103, "start": 541.0, "end": 544.0, "text": "Es ist gefriest."}, {"id": 104, "start": 544.0, "end": 548.0, "text": "Naja, jetzt geht's."}, {"id": 105, "start": 548.0, "end": 559.0, "text": "Ja genau, Keeper of Fate, der gute alte Rechner mit 1080 Ti."}, {"id": 106, "start": 559.0, "end": 563.0, "text": "Seht ihr FPS im Stream?"}, {"id": 107, "start": 563.0, "end": 571.0, "text": "Ich habe FPS von Steam eingeblendet und Overlay."}, {"id": 108, "start": 571.0, "end": 575.0, "text": "Jaja, komm, geh weg."}, {"id": 109, "start": 575.0, "end": 582.0, "text": "Ich will mir das nicht angucken."}, {"id": 110, "start": 582.0, "end": 589.0, "text": "FPS sichtbar, ok, sehr schön."}, {"id": 111, "start": 589.0, "end": 604.0, "text": "Ach, man sieht jetzt auf einmal beide FPS, ok."}, {"id": 112, "start": 604.0, "end": 609.0, "text": "So, mal gucken, was haben wir uns in der Beta ausgesucht?"}, {"id": 113, "start": 609.0, "end": 613.0, "text": "Sind wir zum Grill?"}, {"id": 114, "start": 613.0, "end": 617.0, "text": "Nee, das war die Schneiper-Truppe, die wollten wir nicht."}, {"id": 115, "start": 617.0, "end": 619.0, "text": "Oh nee, die Franzosen wollten wir auch nicht."}, {"id": 116, "start": 619.0, "end": 624.0, "text": "Ich glaube, wir haben Airborne genommen, das letzte Mal."}, {"id": 117, "start": 624.0, "end": 628.0, "text": "Airborne Grill."}, {"id": 118, "start": 628.0, "end": 633.0, "text": "Das waren die mit der OP-Shotgun, die Franzosen."}, {"id": 119, "start": 633.0, "end": 637.0, "text": "Mir gehen die Videos jetzt schon offen."}, {"id": 120, "start": 637.0, "end": 642.0, "text": "Ich muss mal die Musik im Browser hinten aufmachen, das Spiel hat genug Sound."}, {"id": 121, "start": 642.0, "end": 650.0, "text": "So, wir nehmen jetzt einfach, wir nehmen wieder Airborne, letztendlich hat das ja jetzt nicht so einen großen Unterschied gemacht."}, {"id": 122, "start": 650.0, "end": 658.0, "text": "Was ich ganz cool fand, sind, dass halt jede Division so ein extra Perk-Progression-System hatte."}, {"id": 123, "start": 658.0, "end": 662.0, "text": "Was halt zeigen die das hier wenigstens an?"}, {"id": 124, "start": 662.0, "end": 665.0, "text": "F2, Press F2, See Division Rewards."}, {"id": 125, "start": 665.0, "end": 672.0, "text": "Ich drücke übrigens gerade F2 und ihr seht, es passiert nichts."}, {"id": 126, "start": 672.0, "end": 678.0, "text": "Das ist natürlich gut gemacht, wenn es einen Knopf gibt, der nichts macht."}, {"id": 127, "start": 678.0, "end": 680.0, "text": "Komm, wir nehmen wieder Airborne."}, {"id": 128, "start": 680.0, "end": 698.0, "text": "Das war doch ganz cool, bisschen mit SMG aus der Hüfte einfach mal quer über die ganze Map ballern."}, {"id": 129, "start": 698.0, "end": 700.0, "text": "Ja, wir joinen jetzt, wir joinen den."}, {"id": 130, "start": 700.0, "end": 702.0, "text": "Das kennen wir aus der Beta, dann passt das."}, {"id": 131, "start": 702.0, "end": 705.0, "text": "Welcome."}, {"id": 132, "start": 705.0, "end": 707.0, "text": "Was?"}, {"id": 133, "start": 707.0, "end": 709.0, "text": "One Days?"}, {"id": 134, "start": 709.0, "end": 711.0, "text": "Gibt es was?"}, {"id": 135, "start": 711.0, "end": 715.0, "text": "Your Division Loadouts are the most critical Element."}, {"id": 136, "start": 715.0, "end": 721.0, "text": "Ja, das vor allem sind meine Loadouts mit Lootboxen das critical Element für Activision."}, {"id": 137, "start": 721.0, "end": 723.0, "text": "Ja, ich weiß, wie das funktioniert."}, {"id": 138, "start": 723.0, "end": 729.0, "text": "Komm, Game, lass mich das doch ausblenden."}, {"id": 139, "start": 729.0, "end": 733.0, "text": "Übrigens, ich gucke mir gerade die Vorschau vom Stream an."}, {"id": 140, "start": 733.0, "end": 735.0, "text": "Ich sehe bei mir 0 FPS anzeigen."}, {"id": 141, "start": 735.0, "end": 737.0, "text": "Wie könnt ihr meine FPS sehen?"}, {"id": 142, "start": 737.0, "end": 739.0, "text": "Und ich sehe meine FPS."}, {"id": 143, "start": 739.0, "end": 741.0, "text": "Moment, mein Stream hat geleckt."}, {"id": 144, "start": 741.0, "end": 744.0, "text": "Auch gut, vergesse."}, {"id": 145, "start": 744.0, "end": 747.0, "text": "Ich habe nichts gesagt."}, {"id": 146, "start": 747.0, "end": 749.0, "text": "Machen wir heute ein Lootboxen auf?"}, {"id": 147, "start": 749.0, "end": 751.0, "text": "Ja, wir machen ein Lootboxen auf, sobald ich Lootboxen habe."}, {"id": 148, "start": 751.0, "end": 753.0, "text": "Aber ich glaube, ich habe noch kein Lootboxen."}, {"id": 149, "start": 753.0, "end": 755.0, "text": "Ich weiß nicht mal, wo man Lootboxen sieht."}, {"id": 150, "start": 755.0, "end": 757.0, "text": "Wo sieht man denn Lootboxen überhaupt?"}, {"id": 151, "start": 757.0, "end": 759.0, "text": "Ah, einen Store gibt es natürlich auch."}, {"id": 152, "start": 759.0, "end": 761.0, "text": "Das ist sehr schön."}, {"id": 153, "start": 761.0, "end": 763.0, "text": "Das Season Pass, was bringt denn das Season Pass?"}, {"id": 154, "start": 763.0, "end": 765.0, "text": "Zeig mal her."}, {"id": 155, "start": 765.0, "end": 767.0, "text": "Scrollt erstmal irgendwie so, dass man..."}, {"id": 156, "start": 767.0, "end": 769.0, "text": "Hallo?"}, {"id": 157, "start": 771.0, "end": 773.0, "text": "Ich kann..."}, {"id": 158, "start": 773.0, "end": 775.0, "text": "Man kann das nicht scrollen, übrigens."}, {"id": 159, "start": 775.0, "end": 777.0, "text": "PC, Port, FTW."}, {"id": 160, "start": 777.0, "end": 779.0, "text": "Aber..."}, {"id": 161, "start": 779.0, "end": 781.0, "text": "You're first."}, {"id": 162, "start": 781.0, "end": 783.0, "text": "Was?"}, {"id": 163, "start": 783.0, "end": 785.0, "text": "Ah, ich muss einen Übungs-Match machen."}, {"id": 164, "start": 785.0, "end": 787.0, "text": "Okay, ich muss einen Übungs-Match."}, {"id": 165, "start": 787.0, "end": 789.0, "text": "Soll ich mal einen Übungs-Match?"}, {"id": 166, "start": 789.0, "end": 791.0, "text": "Ja."}, {"id": 167, "start": 791.0, "end": 793.0, "text": "Oh, neue Map."}, {"id": 168, "start": 793.0, "end": 795.0, "text": "Den kennen wir noch nicht aus der Beta."}, {"id": 169, "start": 797.0, "end": 799.0, "text": "Lootbox auf Linkstream, ja."}, {"id": 170, "start": 799.0, "end": 801.0, "text": "Zombie Mode."}, {"id": 171, "start": 801.0, "end": 803.0, "text": "Ja, Zombie Mode will ich mir mal angucken."}, {"id": 172, "start": 803.0, "end": 805.0, "text": "Ich habe mal vor einer Weile"}, {"id": 173, "start": 805.0, "end": 807.0, "text": "auf Twitter ein paar Leute angeschrieben,"}, {"id": 174, "start": 807.0, "end": 809.0, "text": "die..."}, {"id": 175, "start": 809.0, "end": 811.0, "text": "Also laut..."}, {"id": 176, "start": 811.0, "end": 813.0, "text": "Laut den Rekorden und so,"}, {"id": 177, "start": 813.0, "end": 815.0, "text": "die richtig gut sein müssen"}, {"id": 178, "start": 815.0, "end": 817.0, "text": "in Zombie Modus."}, {"id": 179, "start": 817.0, "end": 819.0, "text": "Und ich werde mal versuchen, die zusammenzukriegen,"}, {"id": 180, "start": 819.0, "end": 821.0, "text": "dass die mir das mal erklären können, wie man ordentlich Zombie Modus spielt."}, {"id": 181, "start": 821.0, "end": 823.0, "text": "Oh, boah!"}, {"id": 182, "start": 823.0, "end": 825.0, "text": "Die Sensitivity, was ist da los?"}, {"id": 183, "start": 825.0, "end": 827.0, "text": "Was? Ach..."}, {"id": 184, "start": 827.0, "end": 829.0, "text": "Was ist denn das?"}, {"id": 185, "start": 831.0, "end": 833.0, "text": "Ja, stellen wir nach der Runde um."}, {"id": 186, "start": 837.0, "end": 839.0, "text": "Zumindest können wir mal..."}, {"id": 187, "start": 839.0, "end": 841.0, "text": "Morgen oder so werde ich dann mit vom"}, {"id": 188, "start": 841.0, "end": 843.0, "text": "neuen Rechner aus streamen."}, {"id": 189, "start": 843.0, "end": 845.0, "text": "What? Ah, da oben drauf."}, {"id": 190, "start": 845.0, "end": 847.0, "text": "Morgen stream ich dann vom neuen Rechner aus."}, {"id": 191, "start": 847.0, "end": 849.0, "text": "Dann können wir mal gucken, was"}, {"id": 192, "start": 849.0, "end": 851.0, "text": "die CPU ausmacht"}, {"id": 193, "start": 851.0, "end": 853.0, "text": "bei dem Game. Weil letztendlich"}, {"id": 194, "start": 853.0, "end": 855.0, "text": "passt die Lautstärke"}, {"id": 195, "start": 855.0, "end": 857.0, "text": "so zu meinem Gelaber und..."}, {"id": 196, "start": 857.0, "end": 859.0, "text": "Und in-game"}, {"id": 197, "start": 859.0, "end": 861.0, "text": "Sound."}, {"id": 198, "start": 861.0, "end": 863.0, "text": "Boah, was?"}, {"id": 199, "start": 863.0, "end": 865.0, "text": "Boah!"}, {"id": 200, "start": 865.0, "end": 867.0, "text": "Mal gespawnt"}, {"id": 201, "start": 867.0, "end": 869.0, "text": "und instant down."}, {"id": 202, "start": 869.0, "end": 871.0, "text": "Ja,"}, {"id": 203, "start": 871.0, "end": 873.0, "text": "grandios. Äh, ich muss mich erst mal"}, {"id": 204, "start": 873.0, "end": 875.0, "text": "eingewöhnen. Gegen was für welche"}, {"id": 205, "start": 875.0, "end": 877.0, "text": "spielen wir hier eigentlich? Ok, wir haben drei Level"}, {"id": 206, "start": 877.0, "end": 879.0, "text": "einser, die absolut nichts geschissen bekommen"}, {"id": 207, "start": 879.0, "end": 881.0, "text": "und Gegner, die wissen,"}, {"id": 208, "start": 881.0, "end": 883.0, "text": "was abgeht. Guck mal,"}, {"id": 209, "start": 883.0, "end": 885.0, "text": "da oben ist schon..."}, {"id": 210, "start": 889.0, "end": 891.0, "text": "Da unten ist was."}, {"id": 211, "start": 893.0, "end": 895.0, "text": "Was auch immer."}, {"id": 212, "start": 895.0, "end": 897.0, "text": "Der Typ, der kommt jetzt gleich hier rum."}, {"id": 213, "start": 897.0, "end": 899.0, "text": "Achtung."}, {"id": 214, "start": 899.0, "end": 901.0, "text": "Lol. Fuck, was war"}, {"id": 215, "start": 901.0, "end": 903.0, "text": "noch mal hinlegen? Aha."}, {"id": 216, "start": 903.0, "end": 905.0, "text": "Der Typ steht da hinten."}, {"id": 217, "start": 905.0, "end": 907.0, "text": "Dachte ich zumindest."}, {"id": 218, "start": 907.0, "end": 909.0, "text": "Oh, meine Sensitivity, die ist"}, {"id": 219, "start": 909.0, "end": 911.0, "text": "mega fail."}, {"id": 220, "start": 911.0, "end": 913.0, "text": "Das ist wirklich"}, {"id": 221, "start": 913.0, "end": 915.0, "text": "krass fail. Äh, ich kann"}, {"id": 222, "start": 915.0, "end": 917.0, "text": "überhaupt nicht zielen."}, {"id": 223, "start": 919.0, "end": 921.0, "text": "Wir bleiben hier jetzt drinnen. Der kommt"}, {"id": 224, "start": 921.0, "end": 923.0, "text": "hier jetzt rüber, der kommt hier jetzt rüber."}, {"id": 225, "start": 923.0, "end": 925.0, "text": "What?"}, {"id": 226, "start": 927.0, "end": 929.0, "text": "Schon drei Stunden vorher"}, {"id": 227, "start": 929.0, "end": 931.0, "text": "prefire, hat nix passiert."}, {"id": 228, "start": 931.0, "end": 933.0, "text": "Äh, Granate, Granate"}, {"id": 229, "start": 933.0, "end": 935.0, "text": "war G."}, {"id": 230, "start": 939.0, "end": 941.0, "text": "Äh, was auch immer er da"}, {"id": 231, "start": 941.0, "end": 943.0, "text": "macht."}, {"id": 232, "start": 951.0, "end": 953.0, "text": "Alter, meine Sensitivity, ich kann so nicht zielen, das ist"}, {"id": 233, "start": 953.0, "end": 955.0, "text": "nicht möglich gerade. Wirklich,"}, {"id": 234, "start": 955.0, "end": 957.0, "text": "das geht nicht."}, {"id": 235, "start": 957.0, "end": 959.0, "text": "Den flanken wir jetzt. Flankerino."}, {"id": 236, "start": 959.0, "end": 961.0, "text": "Falls"}, {"id": 237, "start": 961.0, "end": 963.0, "text": "der überhaupt noch da ist."}, {"id": 238, "start": 967.0, "end": 969.0, "text": "Oh nee, die haben"}, {"id": 239, "start": 969.0, "end": 971.0, "text": "ernsthaft, die haben immer noch"}, {"id": 240, "start": 971.0, "end": 973.0, "text": "die Ping-Balken anstatt"}, {"id": 241, "start": 973.0, "end": 975.0, "text": "ne Anzeige."}, {"id": 242, "start": 975.0, "end": 977.0, "text": "Das versteh ich nicht."}, {"id": 243, "start": 977.0, "end": 979.0, "text": "Nee, Settings machen wir nach der"}, {"id": 244, "start": 979.0, "end": 981.0, "text": "Runde. Ich muss mich erstmal wieder ein bisschen allgemein an das"}, {"id": 245, "start": 981.0, "end": 983.0, "text": "Game gewöhnen."}, {"id": 246, "start": 983.0, "end": 985.0, "text": "Ich versteh nicht, warum macht man"}, {"id": 247, "start": 985.0, "end": 987.0, "text": "Ping-Balken? Ping-Balken ist einfach"}, {"id": 248, "start": 987.0, "end": 989.0, "text": "beknackt."}, {"id": 249, "start": 989.0, "end": 991.0, "text": "Und ich hab Input-Lag."}, {"id": 250, "start": 991.0, "end": 993.0, "text": "Guck, ich drück sprinten"}, {"id": 251, "start": 993.0, "end": 995.0, "text": "oder sprint, sprinten."}, {"id": 252, "start": 995.0, "end": 997.0, "text": "Warte."}, {"id": 253, "start": 997.0, "end": 999.0, "text": "Kann man hier hoch?"}, {"id": 254, "start": 999.0, "end": 1001.0, "text": "Sehr nice."}, {"id": 255, "start": 1009.0, "end": 1011.0, "text": "Jetzt wissen die natürlich, dass ich hier"}, {"id": 256, "start": 1011.0, "end": 1013.0, "text": "rumrenne."}, {"id": 257, "start": 1013.0, "end": 1017.0, "text": "Da unten, da unten sind schon Gegner am Start."}, {"id": 258, "start": 1029.0, "end": 1031.0, "text": "Ich frag mich halt,"}, {"id": 259, "start": 1031.0, "end": 1033.0, "text": "warum macht man Ping-Anzeigen?"}, {"id": 260, "start": 1033.0, "end": 1035.0, "text": "Also,"}, {"id": 261, "start": 1035.0, "end": 1037.0, "text": "habt ihr es gerade gesehen, ich hab das Game gelieft angeblich,"}, {"id": 262, "start": 1037.0, "end": 1039.0, "text": "aber ich müsste noch drin sein. Warum macht man"}, {"id": 263, "start": 1039.0, "end": 1041.0, "text": "Ping-Anzeigen? Also, warum macht man"}, {"id": 264, "start": 1041.0, "end": 1043.0, "text": "Ping-Balken anstatt die richtige Ping-Anzeige?"}, {"id": 265, "start": 1043.0, "end": 1045.0, "text": "Das einzige, wie ich mir sowas erklären"}, {"id": 266, "start": 1045.0, "end": 1047.0, "text": "kann, ist, dass"}, {"id": 267, "start": 1047.0, "end": 1049.0, "text": "man was verstecken will. Und die"}, {"id": 268, "start": 1049.0, "end": 1051.0, "text": "Frage ist, was will man verstecken?"}, {"id": 269, "start": 1051.0, "end": 1053.0, "text": "Weil, eins hab ich zumindest in der"}, {"id": 270, "start": 1053.0, "end": 1055.0, "text": "Beta gelernt,"}, {"id": 271, "start": 1055.0, "end": 1057.0, "text": "anscheinend läuft das"}, {"id": 272, "start": 1057.0, "end": 1059.0, "text": "Game wirklich auf echten Servern."}, {"id": 273, "start": 1059.0, "end": 1061.0, "text": "Ich hab's am Anfang auch nicht für möglich gehalten, wir hatten"}, {"id": 274, "start": 1061.0, "end": 1063.0, "text": "auch eine Host-Migration, aber es"}, {"id": 275, "start": 1063.0, "end": 1065.0, "text": "gibt wohl irgendwie so ein Hybrid-System,"}, {"id": 276, "start": 1065.0, "end": 1067.0, "text": "dass man zu 90%"}, {"id": 277, "start": 1067.0, "end": 1069.0, "text": "oder 95% auf"}, {"id": 278, "start": 1069.0, "end": 1071.0, "text": "ordentlichen Servern rauskommt"}, {"id": 279, "start": 1071.0, "end": 1073.0, "text": "und zu 5%, wenn es gerade keine gibt"}, {"id": 280, "start": 1073.0, "end": 1075.0, "text": "oder kein Slot frei ist oder was auch immer,"}, {"id": 281, "start": 1075.0, "end": 1077.0, "text": "dann halt auf irgendeinem P2P"}, {"id": 282, "start": 1077.0, "end": 1079.0, "text": "gehostenden Kacke."}, {"id": 283, "start": 1079.0, "end": 1081.0, "text": "Warum macht man Ping? Also,"}, {"id": 284, "start": 1081.0, "end": 1083.0, "text": "warum macht man Ping-Balken? Warum macht man..."}, {"id": 285, "start": 1083.0, "end": 1085.0, "text": "Man hat hier eigentlich nichts zu verbergen."}, {"id": 286, "start": 1089.0, "end": 1091.0, "text": "So, jetzt muss ich erstmal Sense umstellen."}, {"id": 287, "start": 1091.0, "end": 1093.0, "text": "Ich lese gleich Chat,"}, {"id": 288, "start": 1093.0, "end": 1095.0, "text": "ich muss mir erstmal das bisschen hier"}, {"id": 289, "start": 1095.0, "end": 1097.0, "text": "anschauen. So,"}, {"id": 290, "start": 1097.0, "end": 1099.0, "text": "als..."}, {"id": 291, "start": 1099.0, "end": 1101.0, "text": "Maus-Settings..."}, {"id": 292, "start": 1101.0, "end": 1103.0, "text": "Hat noch irgendeiner eine grobe"}, {"id": 293, "start": 1103.0, "end": 1105.0, "text": "Ahnung, was ich hatte in der Beta?"}, {"id": 294, "start": 1107.0, "end": 1109.0, "text": "Wahrscheinlich nicht."}, {"id": 295, "start": 1113.0, "end": 1115.0, "text": "Und dass man..."}, {"id": 296, "start": 1117.0, "end": 1119.0, "text": "Machen wir mal so."}, {"id": 297, "start": 1119.0, "end": 1121.0, "text": "Gibt es irgendjemand, der horizontal"}, {"id": 298, "start": 1121.0, "end": 1123.0, "text": "und vertik, also"}, {"id": 299, "start": 1123.0, "end": 1125.0, "text": "so und so eine andere Maus-Sense"}, {"id": 300, "start": 1125.0, "end": 1127.0, "text": "hat?"}, {"id": 301, "start": 1127.0, "end": 1129.0, "text": "Ach guck mal, da Fanto ist da."}, {"id": 302, "start": 1129.0, "end": 1131.0, "text": "Und wie findest du das Spiel?"}, {"id": 303, "start": 1131.0, "end": 1133.0, "text": "Du hast ja wahrscheinlich schon vor Release"}, {"id": 304, "start": 1133.0, "end": 1135.0, "text": "bekommen und gespielt und hast"}, {"id": 305, "start": 1135.0, "end": 1137.0, "text": "schon ein paar Tage auf dem Bucke. Was sagst du"}, {"id": 306, "start": 1137.0, "end": 1139.0, "text": "zu dem Game? Bis jetzt?"}, {"id": 307, "start": 1143.0, "end": 1145.0, "text": "Moment."}, {"id": 308, "start": 1149.0, "end": 1151.0, "text": "Wir spielen jetzt auch ein paar Runden, Team Deathmatch,"}, {"id": 309, "start": 1151.0, "end": 1153.0, "text": "ich muss mich erst wieder mal dran gewöhnen."}, {"id": 310, "start": 1153.0, "end": 1155.0, "text": "Und dann machen wir"}, {"id": 311, "start": 1155.0, "end": 1157.0, "text": "Lootboxen auf am"}, {"id": 312, "start": 1157.0, "end": 1159.0, "text": "Strand."}, {"id": 313, "start": 1159.0, "end": 1161.0, "text": "Ok, also ich sehe ganz viele"}, {"id": 314, "start": 1161.0, "end": 1163.0, "text": "Fragen im Chat. Ihr werdet"}, {"id": 315, "start": 1163.0, "end": 1165.0, "text": "nicht glauben, ich hab grad auf meinem zweiten Rechner"}, {"id": 316, "start": 1165.0, "end": 1167.0, "text": "Twitch laufen in Microsoft"}, {"id": 317, "start": 1167.0, "end": 1169.0, "text": "Edge. Ohne"}, {"id": 318, "start": 1169.0, "end": 1171.0, "text": "Beta Twitch TV, ohne alles. Das heißt"}, {"id": 319, "start": 1171.0, "end": 1173.0, "text": "ich seh jetzt weder 0.3D"}, {"id": 320, "start": 1173.0, "end": 1175.0, "text": "als Emote, noch alle anderen"}, {"id": 321, "start": 1175.0, "end": 1177.0, "text": "GIF Emotes und die Fragen sich auch"}, {"id": 322, "start": 1177.0, "end": 1179.0, "text": "nicht richtig Highlighted."}, {"id": 323, "start": 1179.0, "end": 1181.0, "text": "Ok,"}, {"id": 324, "start": 1181.0, "end": 1183.0, "text": "den Typen müssen wir schon mal"}, {"id": 325, "start": 1183.0, "end": 1185.0, "text": "muten."}, {"id": 326, "start": 1185.0, "end": 1187.0, "text": "Was wohl?"}, {"id": 327, "start": 1189.0, "end": 1191.0, "text": "Demutet man doch."}, {"id": 328, "start": 1191.0, "end": 1193.0, "text": "Ach geil, man kann da drauf klicken,"}, {"id": 329, "start": 1193.0, "end": 1195.0, "text": "als man gemutet hat. Sehr nice."}, {"id": 330, "start": 1195.0, "end": 1197.0, "text": "So, Chat,"}, {"id": 331, "start": 1197.0, "end": 1199.0, "text": "was hab ich? Oh, die kenn ich, die Map."}, {"id": 332, "start": 1201.0, "end": 1203.0, "text": "Ping"}, {"id": 333, "start": 1203.0, "end": 1205.0, "text": "Balken in 2k17,"}, {"id": 334, "start": 1205.0, "end": 1209.0, "text": "ja, das versteh ich net."}, {"id": 335, "start": 1217.0, "end": 1219.0, "text": "Komm, wir gucken, ob die Shotka"}, {"id": 336, "start": 1219.0, "end": 1221.0, "text": "noch so OP ist wie in der Beta."}, {"id": 337, "start": 1225.0, "end": 1227.0, "text": "Nee, ich hab den Singleplayer hab ich noch nicht ausprobiert."}, {"id": 338, "start": 1231.0, "end": 1233.0, "text": "Ach, am PC gibt's auch keine,"}, {"id": 339, "start": 1233.0, "end": 1235.0, "text": "keine, keine, ich sag mal,"}, {"id": 340, "start": 1235.0, "end": 1237.0, "text": "hab ich da grad in der Erde gesteckt, kann das sein?"}, {"id": 341, "start": 1237.0, "end": 1239.0, "text": "Ich dachte auf"}, {"id": 342, "start": 1239.0, "end": 1241.0, "text": "45 FPS?"}, {"id": 343, "start": 1241.0, "end": 1243.0, "text": "What?"}, {"id": 344, "start": 1243.0, "end": 1245.0, "text": "Das war in der Beta ja noch besser."}, {"id": 345, "start": 1245.0, "end": 1247.0, "text": "45 FPS, ernsthaft?"}, {"id": 346, "start": 1247.0, "end": 1249.0, "text": "Oh, wir müssen"}, {"id": 347, "start": 1249.0, "end": 1251.0, "text": "OP Brandmunition laden."}, {"id": 348, "start": 1253.0, "end": 1255.0, "text": "OP Brandmunition, jetzt ist meine Sens"}, {"id": 349, "start": 1255.0, "end": 1257.0, "text": "viel zu niedrig."}, {"id": 350, "start": 1257.0, "end": 1259.0, "text": "54 FPS?"}, {"id": 351, "start": 1259.0, "end": 1261.0, "text": "OP"}, {"id": 352, "start": 1263.0, "end": 1265.0, "text": "OP Shotgun"}, {"id": 353, "start": 1267.0, "end": 1269.0, "text": "Achtung, da kommt was,"}, {"id": 354, "start": 1269.0, "end": 1271.0, "text": "da kommt was."}, {"id": 355, "start": 1275.0, "end": 1277.0, "text": "Das ruckelt, das ruckelt"}, {"id": 356, "start": 1277.0, "end": 1279.0, "text": "übelst."}, {"id": 357, "start": 1281.0, "end": 1283.0, "text": "Das ruckelt mega, was ist da los?"}, {"id": 358, "start": 1283.0, "end": 1287.0, "text": "Das hat voll nicht framed und ich seh's ja oben."}, {"id": 359, "start": 1289.0, "end": 1291.0, "text": "1080 Ti reicht nicht,"}, {"id": 360, "start": 1291.0, "end": 1293.0, "text": "nee."}, {"id": 361, "start": 1293.0, "end": 1295.0, "text": "Auf der Map ist Shotgun doof für."}, {"id": 362, "start": 1295.0, "end": 1297.0, "text": "Guck mal wie, Alter!"}, {"id": 363, "start": 1297.0, "end": 1299.0, "text": "Die Maus!"}, {"id": 364, "start": 1299.0, "end": 1301.0, "text": "Ich, das,"}, {"id": 365, "start": 1301.0, "end": 1303.0, "text": "ihr müsstet meine, die Maus in der Hand haben."}, {"id": 366, "start": 1303.0, "end": 1305.0, "text": "Das ist, das fühlt sich an"}, {"id": 367, "start": 1305.0, "end": 1307.0, "text": "wie als würde ich"}, {"id": 368, "start": 1307.0, "end": 1309.0, "text": "meinen eigenen Maus zeigen,"}, {"id": 369, "start": 1309.0, "end": 1311.0, "text": "zu mir streamen im Hauptmenü hier."}, {"id": 370, "start": 1311.0, "end": 1313.0, "text": "Das zieht total hinterher."}, {"id": 371, "start": 1317.0, "end": 1319.0, "text": "Seht ihr, ich treff die Buttons nicht."}, {"id": 372, "start": 1319.0, "end": 1321.0, "text": "Boah!"}, {"id": 373, "start": 1321.0, "end": 1323.0, "text": "Das ist hart."}, {"id": 374, "start": 1323.0, "end": 1325.0, "text": "Guck mal,"}, {"id": 375, "start": 1327.0, "end": 1329.0, "text": "das ist ganz wichtig."}, {"id": 376, "start": 1339.0, "end": 1341.0, "text": "Ich muss die Sens wieder hochstellen."}, {"id": 377, "start": 1343.0, "end": 1345.0, "text": "Komm her."}, {"id": 378, "start": 1345.0, "end": 1363.8, "text": "das ruckelt ja total"}, {"id": 379, "start": 1363.8, "end": 1379.92, "text": "mal bisschen mehr das ruckelt das ruckelt mehr als in der beta"}, {"id": 380, "start": 1379.92, "end": 1402.72, "text": "das ruckelt richtig krass was ist ich habe nichts laufen im hintergrund also das hat in der beta"}, {"id": 381, "start": 1402.72, "end": 1414.24, "text": "noch nicht so geruckelt ob sich amd mit dem video ich habe noch nicht mal irgendwas amd"}, {"id": 382, "start": 1414.24, "end": 1428.24, "text": "mäßiges im rechner das ist übelst input lag gerade was da los das war in der beta noch"}, {"id": 383, "start": 1428.24, "end": 1442.16, "text": "nicht das fühlt sich total schwammig an gerade das fühlt sich mehr das fühlt sich kann es"}, {"id": 384, "start": 1442.16, "end": 1453.68, "text": "kann es gar nicht richtig beschreiben das fühlt sich total schwammig an und die frame"}, {"id": 385, "start": 1453.68, "end": 1466.92, "text": "sind auch ziemlich niedrig und es ruckelt das was ist denn hier kaputt gerade die maus"}, {"id": 386, "start": 1466.92, "end": 1477.96, "text": "zieht ich glaube ich starte das game danach mal neu also hier im hauptsatz acht und 35 fps im"}, {"id": 387, "start": 1477.96, "end": 1488.36, "text": "menü das ist ja obsas das ist genau das ist wie wenn ich über über stream spielen würde das"}, {"id": 388, "start": 1488.36, "end": 1493.6, "text": "ist wie wenn ich über einen zweiten monitor in stream gucke und damit meine maus navigiere ganz"}, {"id": 389, "start": 1493.6, "end": 1522.6, "text": "ganz komisch keine ahnung was stelle ich jetzt mal um 90 kann ich irgendwas ausstellen oder so"}, {"id": 390, "start": 1522.6, "end": 1538.56, "text": "ich war meine 1080 te kann schlecht zu schlecht sein für das spiel"}, {"id": 391, "start": 1538.56, "end": 1559.4, "text": "es ist jetzt besser näher 37 und warum spawn ich hinter dem"}, {"id": 392, "start": 1568.56, "end": 1591.44, "text": "das ist nicht spielbar das springt von 35 fps auf 96 das kann ich nicht spielen"}, {"id": 393, "start": 1598.56, "end": 1612.16, "text": "also und der typ hat ein paar probleme wie es aussieht also ich habe mich wirklich"}, {"id": 394, "start": 1612.16, "end": 1615.92, "text": "darauf gefreut heute zu spielen weil mir die beta doch für den call of duty"}, {"id": 395, "start": 1615.92, "end": 1621.24, "text": "verhältnismäßig also von den der letzten jahre verhältnismäßig viel spaß gemacht hat und ich"}, {"id": 396, "start": 1621.24, "end": 1626.76, "text": "habe die habt ihr gesehen ich habe dir sogar viel gespielt und nichts in der beta hat sich so"}, {"id": 397, "start": 1626.76, "end": 1646.84, "text": "schwammig angefühlt wie das gerade ich kann gucken wir das ist auf 38 fps 38 fps du merkst"}, {"id": 398, "start": 1646.84, "end": 1652.04, "text": "es wenn 37 du merkst es wenn du um die ecke rum geht jetzt ist die maus schön flüssig und"}, {"id": 399, "start": 1652.04, "end": 1661.32, "text": "du gehst um die ecke rum und die maus leckt das ist nicht spielbar was ist denn da los ich"}, {"id": 400, "start": 1661.32, "end": 1668.52, "text": "habe sogar eben gerade noch mit noch das neue nvidia das neue update installiert das alles"}, {"id": 401, "start": 1668.52, "end": 1676.84, "text": "gut läuft also ich hoffe dass alles gut läuft aber ich starte ich starte spiel jetzt mal neu"}, {"id": 402, "start": 1676.84, "end": 1684.36, "text": "mach mal ambient occlusion und anti lasing aus mache ich man darf leider bei der kill cam nicht"}, {"id": 403, "start": 1684.36, "end": 1694.12, "text": "raus das ärgert mich jetzt ärgert mich echt dass es so schlecht läuft ist es um die konsolen"}, {"id": 404, "start": 1694.12, "end": 1706.48, "text": "experience auf den pc zu bringen oder was ich möchte seht ihr das habt ihr gesehen wie die maus"}, {"id": 405, "start": 1706.48, "end": 1719.24, "text": "gestartet hat und ich übrigens beim menü ist weg jetzt ist es wieder da ok nee ich muss das"}, {"id": 406, "start": 1719.24, "end": 1727.72, "text": "game mal kurz neu starten das ist das ist definitiv nicht normal und vorher machen wir noch hallo"}, {"id": 407, "start": 1727.72, "end": 1737.12, "text": "ich möchte doch nicht quitten spiel spiel ich will nicht quitten ich will noch was einstellen"}, {"id": 408, "start": 1737.12, "end": 1748.52, "text": "nein ich darf nicht ich muss jetzt quitten ich darf nicht das quitten beenden ok da mache ich"}, {"id": 409, "start": 1748.52, "end": 1771.72, "text": "jetzt noch mal neu und guck ob es besser läuft na ich weiß nicht das finde ich jetzt wie ziemlich"}, {"id": 410, "start": 1771.72, "end": 1781.44, "text": "scheiße und die beta lief ja verhältnismäßig gut muss man sagen ich meine so performance"}, {"id": 411, "start": 1781.44, "end": 1787.24, "text": "monster war es jetzt nicht so graphics gibt's warum gibt's eigentlich keine presets da wird"}, {"id": 412, "start": 1787.24, "end": 1806.68, "text": "einfach mal alles auf alles auf low alles auf low schalten ok das haben wir ja alles schon weit"}, {"id": 413, "start": 1806.68, "end": 1817.0, "text": "genug untergestellt pre load shadows ein langer level loading wollen wir den schatten haben wir aus"}, {"id": 414, "start": 1817.0, "end": 1824.72, "text": "blar haben wir untergestellt shadows machen wir noch mal aus ist ja nicht so dass ich nicht die"}, {"id": 415, "start": 1824.72, "end": 1838.76, "text": "beste grafikkarte hätte dies zur zeit gibt oder so auf alles auf alles auf auf das darf ich nicht"}, {"id": 416, "start": 1838.76, "end": 1853.12, "text": "ausschalten das war auch aus ich finde das sieht besser aus mit oft sonst sieht es einfach nur"}, {"id": 417, "start": 1853.12, "end": 1863.08, "text": "weichgezeichnet aus so ja code 1 das geht du ich habe auch nur multiplayer installiert"}, {"id": 418, "start": 1863.08, "end": 1873.24, "text": "komm wir lassen ihn jetzt wir lassen jetzt preloaden ich habe genug ram wo war das pre"}, {"id": 419, "start": 1873.24, "end": 1891.6, "text": "preload ich finde es nicht war das damit preload irgendwo stand da was mit preload shader"}, {"id": 420, "start": 1891.6, "end": 1902.72, "text": "shader preload hier longer level load to eliminate eigentlich ist es egal ob das"}, {"id": 421, "start": 1902.72, "end": 1909.48, "text": "level länger lädt es dauerte in ein paar sekunden bis es losgeht ok gucken wir mal ob es jetzt besser"}, {"id": 422, "start": 1909.48, "end": 1922.84, "text": "läuft ne ne das geht ohne vpn echt heiko und also es gab glaube ich heute einen neuen nvidia"}, {"id": 423, "start": 1922.84, "end": 1929.64, "text": "treiber ich habe ich habe irgendwas heute morgen gelesen neuer nvidia treiber für extra für"}, {"id": 424, "start": 1929.64, "end": 1934.8, "text": "call of duty und wenn es wenn es mit dem treiber extra für call of duty der rausgekommen ist"}, {"id": 425, "start": 1934.8, "end": 1941.64, "text": "schlechter läuft als mit dem treiber davor dann weiß ich nicht was kaputt ist"}, {"id": 426, "start": 1941.64, "end": 1949.04, "text": "kurz licht anmachen ihr sagt dunkel"}, {"id": 427, "start": 1949.04, "end": 1963.0, "text": "es ist leider ein bisschen ich habe mich echt gefreut drauf ich wollte also ist ja wie ich"}, {"id": 428, "start": 1963.0, "end": 1967.68, "text": "mir das vorgestellt habe ich dachte mir so das spiel lebt auf dem pc wahrscheinlich nur"}, {"id": 429, "start": 1967.68, "end": 1976.88, "text": "ungefähr einen monat ich spiele es jetzt einfach mal zwei drei wochen durch quasi und danach ist"}, {"id": 430, "start": 1976.88, "end": 1985.2, "text": "das spiel entweder tot oder cheater verseucht und wenn nicht dann wäre ich echt überrascht"}, {"id": 431, "start": 1985.2, "end": 1989.64, "text": "wird sogar noch länger spiel wenn es dann auch spaß macht aber eigentlich hatte ich jetzt vor"}, {"id": 432, "start": 1989.64, "end": 1994.8, "text": "ich spiele das game jetzt einfach mal komplett durch quasi irgendwie bis bis max level probieren"}, {"id": 433, "start": 1994.8, "end": 2002.48, "text": "mal alles aus steckt da ordentlich viel zeit was ist mit meiner maus los sieht ihr das meine"}, {"id": 434, "start": 2002.48, "end": 2007.48, "text": "maus meine maus hat aussetzer bei niedrigen fps zahlen und wenn das im ladebildschirm schon"}, {"id": 435, "start": 2007.48, "end": 2020.84, "text": "ist wird mich nicht wundern wenn das ingame auch so ist so und das ärgert mich jetzt das läuft"}, {"id": 436, "start": 2020.84, "end": 2033.8, "text": "besser 170 fps da damit da komme ich mit klar damit mit 155 fps komme ich klar auch wenn die"}, {"id": 437, "start": 2033.8, "end": 2039.2, "text": "textur aussieht wie ich wollte gerade sagen wie von end 64 game aber die textur und bei"}, {"id": 438, "start": 2039.2, "end": 2050.04, "text": "dem end 64 game sahen besser aus go go die map kenne ich schon"}, {"id": 439, "start": 2050.04, "end": 2062.12, "text": "kommen die hier man man muft langsamer habe ich das gefühlt wisst ihr ob die was gemacht"}, {"id": 440, "start": 2062.12, "end": 2072.04, "text": "haben so ein move movement geschwindigkeit und und und hüpfen und so haben die da was"}, {"id": 441, "start": 2072.04, "end": 2084.72, "text": "sagen gemacht hat irgendjemand patch patches gelesen hast du tschüss den schießung an"}, {"id": 442, "start": 2084.72, "end": 2102.8, "text": "ich habe kein schießen kann könnte ich anmachen aber was war das die flanke jetzt flanke"}, {"id": 443, "start": 2102.8, "end": 2130.84, "text": "der wird sich freuen mit seinem spawn jetzt man läuft lang ich wusste dass du um die"}, {"id": 444, "start": 2130.84, "end": 2140.68, "text": "ecke kommst kacke noob seht ihr mit 200 fps läuft es auch viel besser meine sense stimmt"}, {"id": 445, "start": 2140.68, "end": 2154.68, "text": "aber immer noch nicht ich mache mal wieder auf 200 ich habe die sense jetzt auf dem was"}, {"id": 446, "start": 2154.68, "end": 2168.88, "text": "ich am anfang hatte nein die sense ist nicht auf das was ich vorher hatte vorher habe"}, {"id": 447, "start": 2168.88, "end": 2176.92, "text": "ich einmal mousepad 2 zu 60s gemacht jetzt mache ich einmal mousepad 1 zu 60 obwohl bei"}, {"id": 448, "start": 2176.92, "end": 2186.76, "text": "der sense das gleiche steht meine maus dpi kann ich gar nicht umstellen ohne die maus"}, {"id": 449, "start": 2186.76, "end": 2195.96, "text": "umdrehen zu müssen mach mal raum aus input aus meinst du das ist irgendwie ein ding dass"}, {"id": 450, "start": 2195.96, "end": 2207.8, "text": "das kaputt ist mache ich mache ich mache ich mache input aus mache ich gleich sobald"}, {"id": 451, "start": 2207.8, "end": 2224.68, "text": "hier die gegner weg sind es fühlt sich aber trotz 160 fps fühlt sich noch ein bisschen"}, {"id": 452, "start": 2224.68, "end": 2241.8, "text": "komisch an vielleicht muss man sich erst dran gewöhnen kann man hierdurch schießen ich"}, {"id": 453, "start": 2241.8, "end": 2249.92, "text": "weiß es fühlt sich komisch an also ich hatte es vorhin auf 2 und jetzt ist es mir zu schnell"}, {"id": 454, "start": 2249.92, "end": 2256.24, "text": "jetzt habe ich es wieder auf 2 und es ist mir zu langsam und vorher habe ich auf 2 fast"}, {"id": 455, "start": 2256.24, "end": 2261.32, "text": "guck mal ich fange an der rolle an ich bin quasi an der rolle mit einmal übers mousepad"}, {"id": 456, "start": 2261.32, "end": 2266.04, "text": "und vorher habe ich zwei war ich zweimal ums mousepad rum vielleicht war das aber einfach"}, {"id": 457, "start": 2266.04, "end": 2271.48, "text": "auch nur wegen niedrigen fps wie ist das game so kann ich auch nicht sagen ich habe es"}, {"id": 458, "start": 2271.48, "end": 2275.32, "text": "gerade auf die reihe gekriegt die einstellung so zu setzen dass ich das game überhaupt spielen"}, {"id": 459, "start": 2275.32, "end": 2297.96, "text": "kann so jetzt aber mal jetzt gehts los mal kurz warten bis den head klitschen moment"}, {"id": 460, "start": 2297.96, "end": 2307.84, "text": "die kommen von hinten kann sein dass die von hinten kommen kommen rauf wo sind gegner"}, {"id": 461, "start": 2307.84, "end": 2315.4, "text": "und er wird gebashed der kotzt jetzt ey das war so ein typischer call of duty ton zack"}, {"id": 462, "start": 2315.4, "end": 2321.16, "text": "von der seite in call of duty stirbst du ja selten frontal du stirbst da meist um die"}, {"id": 463, "start": 2321.16, "end": 2348.24, "text": "ecke oder oder von der seite oder so schneiber schneiber schneiber da kommt gleich einer"}, {"id": 464, "start": 2348.24, "end": 2354.8, "text": "freaks getropschottet hier jumpschott ist der neue dropschott gleich mal skaff anschließen"}, {"id": 465, "start": 2354.8, "end": 2365.68, "text": "hier skaff maus am pc gleich gleich kommt die skaff maus am pc dann ist dann ist Schluss"}, {"id": 466, "start": 2365.68, "end": 2375.8, "text": "mit lustig skaff maus und fps freaks auf die maus das ist eh das total unterschätzt"}, {"id": 467, "start": 2375.8, "end": 2381.36, "text": "pro gamer in aller welt schwören auf fps freaks auf der maus ihr wisst das bloß nicht"}, {"id": 468, "start": 2381.36, "end": 2411.12, "text": "ich hatte glaube ich gelb streaks hätte vielleicht mal einsetzen soll was sind was sind fps freaks"}, {"id": 469, "start": 2411.12, "end": 2421.72, "text": "halbkorn kennst du es nicht das war der der der heiße aiming hack quasi zu 360 und ps3"}, {"id": 470, "start": 2421.72, "end": 2431.92, "text": "zeiten fps freaks sind so so aufsätze aufsätze für die analog sticks dann sind die analog"}, {"id": 471, "start": 2431.92, "end": 2437.88, "text": "sticks länger und man bildet sich ein man trifft damit besser oder ist schneller und"}, {"id": 472, "start": 2437.88, "end": 2444.04, "text": "sowas in der richtung ich meine die steigerung davon ist ja mit maus kann man besser eben"}, {"id": 473, "start": 2444.04, "end": 2450.08, "text": "als mit dem controller mit fps freaks auf dem controller kann man besser eben als ohne"}, {"id": 474, "start": 2450.08, "end": 2456.6, "text": "fps freaks das heißt die logische folge schluss folgung daraus ist maus mit fps freaks ist"}, {"id": 475, "start": 2456.6, "end": 2467.08, "text": "noch besser was hat max gemacht dass er mehr fps hat erst mal ist es jetzt eine andere"}, {"id": 476, "start": 2467.08, "end": 2476.48, "text": "map darf man nicht vergessen vielleicht ist die map einfach nur scheiße gewesen optimiert"}, {"id": 477, "start": 2476.48, "end": 2482.92, "text": "und ich hab fast ich hab alles ausgestellt was es so gibt deswegen sind die grafik hier"}, {"id": 478, "start": 2482.92, "end": 2493.56, "text": "auch jetzt ziemlich beschissen aus alle typen gleich und die helme ohne textur aber es läuft"}, {"id": 479, "start": 2493.56, "end": 2503.16, "text": "gut so ich habe bestimmt ganz viele fragen und sachen überlesen im chat ich gucke ich"}, {"id": 480, "start": 2503.16, "end": 2512.28, "text": "gucke noch mal durch schnell holt sie das neue battlefront nein hol ich bin ich die"}, {"id": 481, "start": 2512.28, "end": 2518.36, "text": "beta hat mich total enttäuscht ich war schon kein fan vom letzten battlefront remake aber"}, {"id": 482, "start": 2518.36, "end": 2523.12, "text": "das war somit eines der unspaßigsten multiplayer spiele die ich je gespielt habe battlefront"}, {"id": 483, "start": 2523.12, "end": 2539.64, "text": "slats also die beta vom letzten"}, {"id": 484, "start": 2539.64, "end": 2547.2, "text": "eine sache haben sie gefixt definitiv man hat nicht mehr 20 sekunden input lag nachdem"}, {"id": 485, "start": 2547.2, "end": 2553.88, "text": "man raus getappt ist man muss sich überlegen das war ein ding in der betane man hatte 10"}, {"id": 486, "start": 2553.88, "end": 2557.32, "text": "15 20 sekunden input lag nachdem man raus getappt ist wenn das spiel nicht gecrashed"}, {"id": 487, "start": 2557.32, "end": 2567.2, "text": "ist das ist besser das ist definitiv besser jetzt ich weiß ich weiß nicht wo es lang"}, {"id": 488, "start": 2567.2, "end": 2577.4, "text": "geht aber hier kommt bestimmt gleich was ich hör was ich hör was achte eckencamp eckencamp"}, {"id": 489, "start": 2577.4, "end": 2586.72, "text": "krasse eckencamp ich hör da drinnen was jetzt ist die sense obwohl die sense sich nicht"}, {"id": 490, "start": 2586.72, "end": 2590.84, "text": "geändert hat ist die jetzt höher als vorher äh niedriger als vorher ganz merkwürdig"}, {"id": 491, "start": 2590.84, "end": 2600.6, "text": "komm her komm raus treff nix"}, {"id": 492, "start": 2600.6, "end": 2611.32, "text": "hi evuran was ein fps freak das hab ich doch gar nicht erklärt das sind so so aufsätze"}, {"id": 493, "start": 2611.32, "end": 2613.68, "text": "auf controller mit denen man besser aimt"}, {"id": 494, "start": 2613.68, "end": 2621.04, "text": "ja die sense ist gefühlt auf jeder map anders ganz merkwürdig jetzt kann auch sein dass"}, {"id": 495, "start": 2621.04, "end": 2625.76, "text": "ich mich nur einbilde aber ich bin da normalerweise recht empfindlich was so settingsänderung"}, {"id": 496, "start": 2625.76, "end": 2628.68, "text": "anbelangt achtung trick 17"}, {"id": 497, "start": 2628.68, "end": 2647.88, "text": "mit der granate geguckt weg weg geguckt habe ich ihn"}, {"id": 498, "start": 2647.88, "end": 2669.84, "text": "das teile geht weiter weg da kämpft facepalm geht schon los es geht schon los warum holt"}, {"id": 499, "start": 2669.84, "end": 2673.92, "text": "sie dir keine aufträge sind verschenkte münzen ich wusste nicht mal dass es so was wie aufträge"}, {"id": 500, "start": 2673.92, "end": 2679.44, "text": "überhaupt gibt hallo"}, {"id": 501, "start": 2679.44, "end": 2687.76, "text": "der kämpft bestimmt noch da ne macht er nicht ich will das ding wieder haben ich will"}, {"id": 502, "start": 2687.76, "end": 2711.8, "text": "mal damit was kennen das von da nix kommt"}, {"id": 503, "start": 2711.8, "end": 2724.48, "text": "weiß nicht woher da was gekommen ist natürlich von der seite von wo sonst die waffe ist gut"}, {"id": 504, "start": 2724.48, "end": 2731.12, "text": "ich hab also ich weiß noch in der beta war die shotgun ziemlich gut mit der brand munition"}, {"id": 505, "start": 2731.12, "end": 2738.72, "text": "nicht zu sagen op die eine sniper war extrem gut das ding hier aus der hüfte war auch"}, {"id": 506, "start": 2738.72, "end": 2748.72, "text": "ziemlich gut"}, {"id": 507, "start": 2748.72, "end": 2756.68, "text": "erst mal dran gewöhnen wo hier gegner herkommen und wo nicht schneiber max pass auf pass auf"}, {"id": 508, "start": 2756.68, "end": 2775.84, "text": "jetzt werden sie ich glaube ich glaube sie jetzt hat er gut geklappt was natürlich ist"}, {"id": 509, "start": 2775.84, "end": 2788.04, "text": "wenn zwei auch bei den kies dort so teuer ich habe heute mal geguckt was so ein key kostet"}, {"id": 510, "start": 2788.04, "end": 2796.36, "text": "war aber 49 euro und es war die russin version also sprich da wurde nur in uns bekistan kassastan"}, {"id": 511, "start": 2796.36, "end": 2810.52, "text": "sting dunges kahn und russland spielen kannst und das dafür war sniper revenge schlägt"}, {"id": 512, "start": 2810.52, "end": 2822.64, "text": "mich jetzt hin und bleibt hier sitzen halte ich eh nicht durch sowas hinter mir was war"}, {"id": 513, "start": 2822.64, "end": 2844.2, "text": "nahe kampf f was war nahe kampf mittlere fc keine ahnung was nahe kampf ist bamm geschnippt"}, {"id": 514, "start": 2844.2, "end": 2863.88, "text": "jetzt pass auf outplayed outplayed outplayed das geht doch also ich sag euch jetzt ist"}, {"id": 515, "start": 2863.88, "end": 2868.48, "text": "es viel besser als mit den settings am anfang ich weiß leider nicht welches der settings"}, {"id": 516, "start": 2868.48, "end": 2878.52, "text": "es jetzt ausgemacht hat von 37 fps auf 215 sammar kannst du sterben"}, {"id": 517, "start": 2898.48, "end": 2928.46, "text": "ja so ist das halt so ist das halt damals habe ich auch"}, {"id": 518, "start": 2928.46, "end": 2940.48, "text": "noch zehn stunden gefühlt am tag gespielt wenn ich das jetzt hier machen sollte als"}, {"id": 519, "start": 2940.48, "end": 2945.16, "text": "wirklich ein paar stunden wieder reinhauen hat man auch finde ich schon in der beta gesehen"}, {"id": 520, "start": 2945.16, "end": 2951.04, "text": "dann geht man immer noch ganz gut ab und wenn man die maps kennt und solche sachen natürlich"}, {"id": 521, "start": 2951.04, "end": 2969.48, "text": "er will mich flanken das war ein anderer diesmal meine letzte nachricht ja mache ich mal hoch"}, {"id": 522, "start": 2969.48, "end": 2981.88, "text": "scrollen deine mouse sensitivity ist abhängig von dein fps cap mal auf 104 meinst du wu"}, {"id": 523, "start": 2981.88, "end": 2987.2, "text": "moment leute leute es geht los es geht los das gleiche was wir in der beta schon die"}, {"id": 524, "start": 2987.2, "end": 3006.12, "text": "ganze zeit hatten moment press f paid respect leute ich mache mir mal ein window capture"}, {"id": 525, "start": 3006.12, "end": 3017.76, "text": "für fehler dass ihr das auch gleich gleich in voller pracht genießen könnt sobald so"}, {"id": 526, "start": 3017.76, "end": 3039.12, "text": "ist das doch schön da guckt er schon ja guckt da guckt er der siehts der siehts ein unrecavable"}, {"id": 527, "start": 3039.12, "end": 3054.76, "text": "wir können uns jetzt mal ein spaß machen draus machen und das ausprobieren das wisst"}, {"id": 528, "start": 3054.76, "end": 3082.84, "text": "er so das gucken wir uns jetzt an"}, {"id": 529, "start": 3082.84, "end": 3090.16, "text": "was bedeutet diese fehlermeldung wo wo finde ich das jetzt überhaupt aus ein bisschen"}, {"id": 530, "start": 3090.16, "end": 3105.96, "text": "klein so ok wo für klick klick und support wo ist support das steht da das steht ich"}, {"id": 531, "start": 3105.96, "end": 3118.96, "text": "soll call of duty kommen gehen und auf support klicken wo ist das support gibt's nicht ich"}, {"id": 532, "start": 3118.96, "end": 3133.44, "text": "kann ja mal schreiben support support not found so shop anmelden mitmachen kundendienst"}, {"id": 533, "start": 3133.44, "end": 3138.88, "text": "kundendienst ok die wissen dass ok die fehlermeldung ist auf englisch das ist auf deutsch warum"}, {"id": 534, "start": 3138.88, "end": 3150.44, "text": "ist die seite überhaupt auf deutsch nein nein ok weiß nicht wie die us wahrscheinlich"}, {"id": 535, "start": 3150.44, "end": 3170.44, "text": "us na gut ok kundendienst mobile seiten auf desktop in 2k17 gebadet sind wir richtig"}, {"id": 536, "start": 3170.44, "end": 3182.08, "text": "gebadet wie komm ich habe den kundendienst wie geht das ich kann die navigation das seite"}, {"id": 537, "start": 3182.08, "end": 3209.8, "text": "nicht ah ja ok so moment jetzt ist das viel zu groß hier reset"}, {"id": 538, "start": 3209.8, "end": 3220.0, "text": "nein ich will doch nur wissen was die fehlermeldung help help us nein mal ernsthaft wenn ich wirklich"}, {"id": 539, "start": 3220.0, "end": 3230.56, "text": "prob wenn ich wirklich hilfe bräuchte zu diesem fehler ich hätte keine ahnung beim besten"}, {"id": 540, "start": 3230.56, "end": 3245.48, "text": "will nicht wo ich hätte wirklich keine ahnung wo ich gucken wüsste improving lag and in"}, {"id": 541, "start": 3245.48, "end": 3256.2, "text": "game performance oh das ist interessant es gibt gelaber so standard zeug also komm scheiß"}, {"id": 542, "start": 3256.2, "end": 3270.48, "text": "drauf wir spielen jetzt weiter war ja eher auch was gedacht start play aber das geht"}, {"id": 543, "start": 3270.48, "end": 3286.68, "text": "schon geht schon wirklich sehr gut los did not quit properly das ist korrekt aber wir"}, {"id": 544, "start": 3286.68, "end": 3297.48, "text": "wollen kein safe mode anmachen das game erkennt wenigstens dass es gecrasht ist ok weiter"}, {"id": 545, "start": 3297.48, "end": 3307.52, "text": "im text das ist witzig klick und support du klickst an support das ist nichts in der nähe"}, {"id": 546, "start": 3307.52, "end": 3316.8, "text": "was irgendwie so aussieht als kannst du dir helfen support kommt die maus die maus support"}, {"id": 547, "start": 3316.8, "end": 3322.56, "text": "kommt nächsten monat als dlc als loot box kommt das support wenn du glück hast wenn"}, {"id": 548, "start": 3322.56, "end": 3328.12, "text": "du glück hast siehst du den support aus der loot box aber ich mache das jetzt mal was"}, {"id": 549, "start": 3328.12, "end": 3337.92, "text": "eveli geschrieben hat das ist eine gute idee mal die fps auf 144 cap graphics siehst du"}, {"id": 550, "start": 3337.92, "end": 3351.84, "text": "das wegen dass so muss das sein einstellungsorgie das ist die wahre pc master race so aufträge"}, {"id": 551, "start": 3351.84, "end": 3360.48, "text": "gibt es angeblich hat jemand im chat geschrieben denn wenn ich die aufträge nicht mache dann"}, {"id": 552, "start": 3360.48, "end": 3369.76, "text": "verschenke ich münzen und loot boxen aber die große complete orders get rewarded mach"}, {"id": 553, "start": 3369.76, "end": 3381.76, "text": "ich werde gemacht was möchtest probiert geht nicht toll hast du auch das gefühl dass die"}, {"id": 554, "start": 3381.76, "end": 3387.96, "text": "sens sich irgendwie je nach map unterscheidet dass die sens trotz der gleichen einstellung"}, {"id": 555, "start": 3387.96, "end": 3394.52, "text": "in game anders ist und dass es fast schon irgendwie an den fps zu hängen scheint wie"}, {"id": 556, "start": 3394.52, "end": 3404.72, "text": "hoch die sensitiver die von der maus ist jetzt geil jetzt ist wieder keine ahnung ich check"}, {"id": 557, "start": 3404.72, "end": 3415.72, "text": "es nicht ach das ist gar ach das ist nicht der spiel modus headquarters das ist diese"}, {"id": 558, "start": 3415.72, "end": 3425.24, "text": "map für loot boxen andré hat einen schönen text zu textur losen helm ok warte mal or das"}, {"id": 559, "start": 3425.24, "end": 3435.4, "text": "available press f ich glaube dass mit dem press f meinen die nicht als witz das meinen"}, {"id": 560, "start": 3435.4, "end": 3455.24, "text": "die also nein hallo ich drücke f oh supply jobs jawoll die kriegen loot boxen wir müssen"}, {"id": 561, "start": 3455.24, "end": 3461.68, "text": "das geht es laut es geht leider nicht anders jetzt das geht leider nicht anders"}, {"id": 562, "start": 3461.68, "end": 3474.2, "text": "es ist nicht möglich wir müssen jetzt loot boxen aufmachen kam aber schnell so was gibt"}, {"id": 563, "start": 3474.2, "end": 3494.72, "text": "es ein grüner skin für den sekundäre raketenwerfer calling card calling card ist das das namensschild"}, {"id": 564, "start": 3494.72, "end": 3506.56, "text": "was eingeblendet wird wenn man wenn man gekillt wird von jemandem no way emote kamen nächtes"}, {"id": 565, "start": 3506.56, "end": 3526.56, "text": "supply drop auf gehts bämba bämb schlag auf schlag gehts hier epic legendary zero in calling"}, {"id": 566, "start": 3526.56, "end": 3542.24, "text": "chaos so wir holen jetzt unsere aufträge ab pick up orders from major howard f ist aber"}, {"id": 567, "start": 3542.24, "end": 3554.68, "text": "muss gedrückt halten warum ganz toll ja next so hier kann man sich kann man sich jetzt"}, {"id": 568, "start": 3554.68, "end": 3573.72, "text": "wahrscheinlich aussuchen was man haben will das machen wir das probieren wir mal aus später"}, {"id": 569, "start": 3573.72, "end": 3585.8, "text": "warmetsch rifle kills schaufel kills rifle kills rifle kills können wir auch machen 25"}, {"id": 570, "start": 3585.8, "end": 3593.92, "text": "matches das werden wir die woche auch hinkriegen 500 500 kills sagen wir mal so sagen wir mal"}, {"id": 571, "start": 3593.92, "end": 3597.76, "text": "wir machen 15 pro game das ist jetzt schon wenn man eingespielt ist sogar noch relativ"}, {"id": 572, "start": 3597.76, "end": 3607.64, "text": "wenig ja das geht auch 25 kills in tdm das werden wir früher oder später kriegen ach"}, {"id": 573, "start": 3607.64, "end": 3618.6, "text": "man kann das man muss sich das gar nicht aussuchen man kann einfach alles annehmen ach nee ok"}, {"id": 574, "start": 3618.6, "end": 3629.04, "text": "kann man auch machen da finde ich gar nicht schlecht dass sowas als erstes drinne ist"}, {"id": 575, "start": 3629.04, "end": 3635.4, "text": "das ist das finde ich nicht schlecht das regt wahrscheinlich die leute dazu an dass sie"}, {"id": 576, "start": 3635.4, "end": 3649.48, "text": "sich die spielmodi mal angucken man kann ja auch aus dieser hub welt so pick up payroll"}, {"id": 577, "start": 3649.48, "end": 3679.12, "text": "da dahin machen wir noch was gibt es da payroll ok ach das ist deswegen haben die alle den"}, {"id": 578, "start": 3679.12, "end": 3685.28, "text": "texturlosen helm auf das ist nicht das ist gar kein texturlose helm das ist der beta"}, {"id": 579, "start": 3685.28, "end": 3715.0, "text": "helm double xp go go ach so das kann man alles abpicken ok kapiert"}, {"id": 580, "start": 3715.0, "end": 3725.76, "text": "gut ok das ist tutorial das kann das kennen wir noch aus der beta man konnte ja jetzt"}, {"id": 581, "start": 3725.76, "end": 3752.72, "text": "hier auf was ah xp muss ok ja ich weiß noch wie das funktioniert"}, {"id": 582, "start": 3752.72, "end": 3757.12, "text": "könnt ihr euch noch dran erinnern wo ich später gespielt habe und an dem letzten tag"}, {"id": 583, "start": 3757.12, "end": 3761.0, "text": "wo ich gespielt habe versucht habe noch akimbo pistols zu kriegen und dann festgestellt habe"}, {"id": 584, "start": 3761.0, "end": 3778.8, "text": "dass akimbo pistols der letzte scheiße ok gut dann gehen wir wieder in game rein"}, {"id": 585, "start": 3778.8, "end": 3797.84, "text": "und was hat das noch mit einem ego shooter zu tun ja es ist offensichtlich den ego shooter"}, {"id": 586, "start": 3797.84, "end": 3803.28, "text": "man shootet aus der ego perspektive also eins kann man call of duty nicht vorwerfen dass"}, {"id": 587, "start": 3803.28, "end": 3818.56, "text": "es kein ego shooter ist sah geradeaus wie das offizielle mmo bringt seltsam bringen"}, {"id": 588, "start": 3818.56, "end": 3825.2, "text": "die nicht auf ideen das ist die op shotgun map da müssen wir leider shotgun spielen"}, {"id": 589, "start": 3825.2, "end": 3842.04, "text": "jetzt aber man sieht wie gut das mit der maus funktioniert"}, {"id": 590, "start": 3842.04, "end": 3847.92, "text": "weil heute ist das ja auch nicht mehr so einfach gibt es ja nicht einfach nur fast persen shooter"}, {"id": 591, "start": 3847.92, "end": 3864.92, "text": "oder sowas heute ist das dann ein roguelike persen fps strategy multiplayer moba tile based"}, {"id": 592, "start": 3864.92, "end": 3877.4, "text": "action pack sonst war es shooter zu viel geschwätzt brand munition probiere ich jetzt gerade mal"}, {"id": 593, "start": 3877.4, "end": 3882.44, "text": "aus wie das mit brand munition ist deswegen habe ich jetzt erstmal auch die shotgun wir"}, {"id": 594, "start": 3882.44, "end": 3887.2, "text": "wissen ob das immer noch so man ist langsamer man ist es kommt mir vor als man langsamer"}, {"id": 595, "start": 3887.2, "end": 3890.92, "text": "als in der beta was was aber nichts heißen muss ich habe jetzt das spiel auch eine weile"}, {"id": 596, "start": 3890.92, "end": 3919.16, "text": "mal gespielt seit der beta hallo konnte man da nicht raus da kommt von links was linke"}, {"id": 597, "start": 3919.16, "end": 3932.48, "text": "seite"}, {"id": 598, "start": 3932.48, "end": 3956.92, "text": "echt"}, {"id": 599, "start": 3956.92, "end": 3983.36, "text": "war schon wieder um die ecke aber wir haben killstreak immerhin brand munition richtig"}, {"id": 600, "start": 3983.36, "end": 4006.28, "text": "was ist nicht gestorben"}, {"id": 601, "start": 4006.28, "end": 4025.6, "text": "jetzt aber das shotgun flick"}, {"id": 602, "start": 4025.6, "end": 4028.44, "text": "dachte es ist irgendwo hinter der wand wo war das denn"}, {"id": 603, "start": 4028.44, "end": 4042.04, "text": "ok gehen wir auf die andere seite"}, {"id": 604, "start": 4042.04, "end": 4045.4, "text": "wir müssen jetzt das team das match gewinnen dass wir mission abschließen"}, {"id": 605, "start": 4045.4, "end": 4058.44, "text": "ist mega op der scheiß feuer schaden gibt es immer noch nicht"}, {"id": 606, "start": 4058.44, "end": 4071.2, "text": "ok ok ich glaube es ist nicht mehr ganz so op wie in der beta in der beta werden gestorben"}, {"id": 607, "start": 4071.2, "end": 4093.36, "text": "mit der brand munition jetzt"}, {"id": 608, "start": 4093.36, "end": 4122.52, "text": "wo sind die gegner links irgendwo da drin"}, {"id": 609, "start": 4122.52, "end": 4138.2, "text": "jetzt kommen sie von hinten ja ich habe also mir kommt auch so vor als"}, {"id": 610, "start": 4138.2, "end": 4142.4, "text": "wurde die brand munition genau was auch gut ist das war total sinnlos brand munition in"}, {"id": 611, "start": 4142.4, "end": 4157.68, "text": "der beta also total sinnlos op"}, {"id": 612, "start": 4157.68, "end": 4168.88, "text": "was das sehr hässlich das ding"}, {"id": 613, "start": 4168.88, "end": 4175.84, "text": "man verliert die brand munition wenn man das wenn man das nur aufhebt"}, {"id": 614, "start": 4175.84, "end": 4199.92, "text": "also achtung outplayed"}, {"id": 615, "start": 4199.92, "end": 4210.96, "text": "am besten war wir gerade die shotgun weggelegt hatten über das geländer geklettert ist"}, {"id": 616, "start": 4210.96, "end": 4215.28, "text": "ok man darf nicht mehr treffen also siehst du schon beim ersten mission erfüllt"}, {"id": 617, "start": 4215.28, "end": 4220.84, "text": "900 IQ play"}, {"id": 618, "start": 4220.84, "end": 4236.24, "text": "mp40 schnell feuer und großes magazin auf gehts"}, {"id": 619, "start": 4236.24, "end": 4261.44, "text": "hängt läuft aber noch"}, {"id": 620, "start": 4261.44, "end": 4268.92, "text": "ok was kann man einstellen"}, {"id": 621, "start": 4268.92, "end": 4274.32, "text": "die püppisch gibt's wieder mp40"}, {"id": 622, "start": 4274.32, "end": 4277.2, "text": "prestige ernsthaft es gibt prestige waffen"}, {"id": 623, "start": 4277.2, "end": 4284.64, "text": "ich hasse zu prestige in call of duty"}, {"id": 624, "start": 4284.64, "end": 4293.72, "text": "ihr mal da doch gerade geschrieben er spielt immer mp40 hast du schon prestige"}, {"id": 625, "start": 4293.72, "end": 4304.92, "text": "sprach sprain prey aus der hüfte"}, {"id": 626, "start": 4304.92, "end": 4309.12, "text": "wie viele hacker bist du schon begegnet noch kein"}, {"id": 627, "start": 4309.12, "end": 4320.24, "text": "spieler erst seit einer halben stunde oder so maus legt wieder"}, {"id": 628, "start": 4320.24, "end": 4323.56, "text": "spielst du guitar hero nein nicht mehr es gibt überhaupt kein aktuelles gibt es"}, {"id": 629, "start": 4323.56, "end": 4327.88, "text": "wieder aktuelles guitar hero das war im multiplayer hat war das wirklich"}, {"id": 630, "start": 4327.88, "end": 4339.28, "text": "spassig von früher max das ist 90 von 90 von mir von kammer nicht machen was"}, {"id": 631, "start": 4339.28, "end": 4353.72, "text": "warum ist man von nicht mehr das game hat man von einfach geändert ja sieht auch"}, {"id": 632, "start": 4353.72, "end": 4368.36, "text": "besser aus also der pc fort scheint hallo spieler hoch scheint noch so das ein oder"}, {"id": 633, "start": 4368.36, "end": 4384.0, "text": "andere problem zu haben wahrscheinlich sparen sie jetzt so die call of duty live"}, {"id": 634, "start": 4384.0, "end": 4400.44, "text": "shotgun wollte ich jetzt nicht unbedingt aufheben und wo kommt hier ein gegner"}, {"id": 635, "start": 4400.44, "end": 4406.76, "text": "ist es schweiber oder frasier guckt so und haben wir was sagst du zu dem gelben"}, {"id": 636, "start": 4406.76, "end": 4425.64, "text": "bauer paar roten spielen man muss hoch hi crowd ist nicht der heutigen gegner"}, {"id": 637, "start": 4425.64, "end": 4445.08, "text": "kein bock das war mir klar hallo wie funktioniert die map explain please ja"}, {"id": 638, "start": 4445.08, "end": 4451.32, "text": "macht es fühlt es fühlt sich auch ziemlich was ist von klang hier die beste"}, {"id": 639, "start": 4451.32, "end": 4473.48, "text": "übersetzung grob irgendwie an zäge träge träge ja das klobisch klobisch genau"}, {"id": 640, "start": 4473.48, "end": 4480.52, "text": "ja klobisch ist klobisch trifft das gefühl hat in der beta noch nicht aber"}, {"id": 641, "start": 4480.52, "end": 4482.68, "text": "vielleicht liegt es einfach daran die habe ich auch länger gespielt"}, {"id": 642, "start": 4482.68, "end": 4494.36, "text": "achtung krieg 17 900 IQ doch nicht weil ich habe nicht mal die granate geworfen"}, {"id": 643, "start": 4494.36, "end": 4516.36, "text": "bei dem das aber unfa dedicated service an all platforms ist das hier okay man"}, {"id": 644, "start": 4516.36, "end": 4519.6, "text": "muss in das schiff rein schiff rein ist op weil hier unten ist mit einem"}, {"id": 645, "start": 4519.6, "end": 4529.68, "text": "konnten es fressen"}, {"id": 646, "start": 4529.68, "end": 4533.08, "text": "merkst du irgendwelche spürbar verbessern gegen mit der beta am anfang"}, {"id": 647, "start": 4533.08, "end": 4536.12, "text": "habe ich verschlechterung gemerkt das spiel lief überhaupt nicht richtig"}, {"id": 648, "start": 4536.12, "end": 4544.12, "text": "jetzt habe ich einfach alles ausgestellt alles ausgeschaltet jetzt geht es aber"}, {"id": 649, "start": 4544.12, "end": 4548.4, "text": "es fühlt sich klobiger an irgendwie als in der beta aber das kann auch einfach"}, {"id": 650, "start": 4548.4, "end": 4551.76, "text": "noch sein dass ich nicht gewöhnt nicht mehr"}, {"id": 651, "start": 4551.76, "end": 4554.16, "text": "gewöhnt bin"}, {"id": 652, "start": 4555.64, "end": 4562.04, "text": "na ist das ein remake von hijack ich finde es hat gewisse ähnlichkeiten ja"}, {"id": 653, "start": 4562.04, "end": 4567.12, "text": "aber es ist es ist es ist irgendwie geräumiger in schiff in drinnen also"}, {"id": 654, "start": 4567.12, "end": 4583.56, "text": "fight jacked wo geht es hier überhaupt lang"}, {"id": 655, "start": 4583.56, "end": 4598.64, "text": "geht es hier vorne raus ich will nicht team chat"}, {"id": 656, "start": 4598.64, "end": 4609.28, "text": "es ist sehr schlecht wir schauen wo hier einer sport wo was herkommt"}, {"id": 657, "start": 4609.28, "end": 4632.04, "text": "du rennst mit tausend sachen durch die map das doch gut"}, {"id": 658, "start": 4632.04, "end": 4637.16, "text": "ist auch da das doch gut umso schneller das geht das fof macht aber auch ein"}, {"id": 659, "start": 4637.16, "end": 4645.24, "text": "bisschen schneller das doch gut dass man schnell rennt movement muss meiner"}, {"id": 660, "start": 4645.24, "end": 4650.96, "text": "ansicht nach in einem guten game immer gegen camp action gewinnen ob das hier"}, {"id": 661, "start": 4650.96, "end": 4656.48, "text": "der fall ist bezweifle ich aber sollte"}, {"id": 662, "start": 4657.16, "end": 4664.12, "text": "max spielt gar nicht so schlecht ich sage total aber es ja auch die ersten"}, {"id": 663, "start": 4664.12, "end": 4668.6, "text": "paar runden also wenn das spiel wirklich spaß macht und wir das relativ"}, {"id": 664, "start": 4668.6, "end": 4673.48, "text": "intensiv spielen bis das spiel tot ist oder von heckern verseucht da werde ich"}, {"id": 665, "start": 4673.48, "end": 4677.2, "text": "bestimmt auch wieder die eine oder andere ziemlich gute gameplay hinlegen hoffe"}, {"id": 666, "start": 4677.2, "end": 4693.84, "text": "ich war in der beta schon ein paar richtig gut dabei da kommt was da kommt was da"}, {"id": 667, "start": 4693.84, "end": 4707.48, "text": "kommt was lull recht nachladen der kommt jetzt durch gleich sag es euch der"}, {"id": 668, "start": 4707.48, "end": 4718.2, "text": "kommt jetzt durch also sind sehr inkonsistent muss ich sagen mal bis"}, {"id": 669, "start": 4718.2, "end": 4723.72, "text": "es über den gegner drauf mal bis sie drüber dahinter vielleicht fehlt mir"}, {"id": 670, "start": 4723.72, "end": 4728.88, "text": "einfach noch bisschen routine in dem gelb muss ja nicht alles an der senz"}, {"id": 671, "start": 4728.88, "end": 4735.24, "text": "liegen kann auch einfach sein dass scheiße ziele das nächste gott für die"}, {"id": 672, "start": 4735.24, "end": 4743.84, "text": "fontrager theoretisch moment jetzt müssen wir wissen müssen wir müssen mit"}, {"id": 673, "start": 4743.84, "end": 4758.08, "text": "das nächste gott müsste wieder von toriak sein ja also sprich das letzte"}, {"id": 674, "start": 4758.08, "end": 4780.4, "text": "war plege ob es drei oder auch ich kann sit salut okay macht das letzte von"}, {"id": 675, "start": 4780.4, "end": 4788.92, "text": "toriak war plege ob es drei das hier davor infinite warfare war das weiß ich"}, {"id": 676, "start": 4791.08, "end": 4795.96, "text": "davor war plege ob es drei und davor war advanced warfare"}, {"id": 677, "start": 4795.96, "end": 4811.92, "text": "du hast den anfang verpasst am anfang habe ich das gelb übelst geflämt weil"}, {"id": 678, "start": 4811.92, "end": 4815.84, "text": "es auch beschissen lief ich hatte 37 fps"}, {"id": 679, "start": 4815.84, "end": 4823.48, "text": "37 mit der 1080 t 37 fps"}, {"id": 680, "start": 4823.48, "end": 4848.68, "text": "das war die map die so geruckelt hat am anfang gucken wir mal die gustav kanone"}, {"id": 681, "start": 4848.68, "end": 4858.76, "text": "kann sich doch gerade bei gustav kann sich noch einer an den an diesen karl"}, {"id": 682, "start": 4858.76, "end": 4865.28, "text": "gustav raketenwerfer aus bed company 2 erinnern der ursprung von no rpg und"}, {"id": 683, "start": 4865.28, "end": 4878.2, "text": "inf bring the war to them and bring it hard wir bringen ist hart random nate"}, {"id": 684, "start": 4878.2, "end": 4903.64, "text": "cross im app klappt bestimmt easy ist recht das nicht sauber gemapt haben"}, {"id": 685, "start": 4903.64, "end": 4912.2, "text": "ein paar gegner zur abwechslung denkst alle gegner sind weg instant aber am"}, {"id": 686, "start": 4912.2, "end": 4914.64, "text": "start"}, {"id": 687, "start": 4915.28, "end": 4920.48, "text": "chaos das also 100 mit 100 fps kann man spielen"}, {"id": 688, "start": 4920.72, "end": 4928.48, "text": "er koll auf duty zauen übrigens der typische koll auf duty zauen"}, {"id": 689, "start": 4928.48, "end": 4936.28, "text": "koll auf duty ich brauche ja was anderes er ist am cheese hier nicht so der bringer"}, {"id": 690, "start": 4936.28, "end": 4940.32, "text": "stg gibt es hier nicht"}, {"id": 691, "start": 4940.32, "end": 4954.88, "text": "ich weiß auch nicht wie ich meine ich will mich hinlegen"}, {"id": 692, "start": 4954.88, "end": 4960.16, "text": "gehen wir nach hoch"}, {"id": 693, "start": 4960.16, "end": 4979.18, "text": "ja es war ein anderes"}, {"id": 694, "start": 4979.18, "end": 4981.18, "text": "Halt mal wieder!"}, {"id": 695, "start": 4983.18, "end": 4985.18, "text": "Ich weiß halt, wo die gegen her kommen."}, {"id": 696, "start": 4989.18, "end": 4991.18, "text": "Oh, oh, oh.. Das ist schlecht, Artillerie."}, {"id": 697, "start": 4993.18, "end": 4995.18, "text": "Die setzt ja bestimmt in die Mitte, wenn er clever ist."}, {"id": 698, "start": 4995.18, "end": 4997.18, "text": "Ja."}, {"id": 699, "start": 4997.18, "end": 4999.18, "text": "Oh, Bombe!"}, {"id": 700, "start": 4999.18, "end": 5001.18, "text": "Runter, runter, runter, runter!"}, {"id": 701, "start": 5005.18, "end": 5007.18, "text": "Und ich bin schon runter gesprungen!"}, {"id": 702, "start": 5007.18, "end": 5009.18, "text": "Aber der Typ ist mir hinterher gesprungen"}, {"id": 703, "start": 5012.26, "end": 5014.26, "text": "Die Aufträge muss man dem Headquarter abgeben, okay?"}, {"id": 704, "start": 5018.68, "end": 5019.42, "text": "Mach ich gleich"}, {"id": 705, "start": 5021.82, "end": 5023.32, "text": "Zieht wenig Schuss das Ding, hä?"}, {"id": 706, "start": 5024.02, "end": 5024.8, "text": "Hallo- Moin!"}, {"id": 707, "start": 5024.8, "end": 5040.8, "text": "Da hat er die Arme geschlagen, jetzt!"}, {"id": 708, "start": 5040.8, "end": 5055.8, "text": "Oh, Call of Duty Tode!"}, {"id": 709, "start": 5055.8, "end": 5068.8, "text": "Wie viel halten die Dinger aus?"}, {"id": 710, "start": 5068.8, "end": 5070.8, "text": "Oh, da liegt ein Sniper, Achtung!"}, {"id": 711, "start": 5070.8, "end": 5072.8, "text": "Nein! Nein! Was hebst du meinen Sniper auf?"}, {"id": 712, "start": 5072.8, "end": 5076.8, "text": "Ich wollte den 900 IQ-Play machen"}, {"id": 713, "start": 5082.8, "end": 5084.8, "text": "Singleplayer muss ich mir auch angucken"}, {"id": 714, "start": 5084.8, "end": 5086.8, "text": "Da bin ich mal gespannt, was sie da draus gemacht haben"}, {"id": 715, "start": 5086.8, "end": 5088.8, "text": "Ich mein, Zweiter Weltkrieg ist ja schon"}, {"id": 716, "start": 5088.8, "end": 5091.8, "text": "Was Shooter angeht, ziemlich abgenutzt"}, {"id": 717, "start": 5091.8, "end": 5093.8, "text": "Durch die ganzen Spiele, die rausgekommen sind früher"}, {"id": 718, "start": 5093.8, "end": 5095.8, "text": "Aber es ist jetzt schon eine Weile her"}, {"id": 719, "start": 5095.8, "end": 5097.8, "text": "Und es gibt immer noch genug Sachen, die man erzählen kann"}, {"id": 720, "start": 5097.8, "end": 5099.8, "text": "Da bin ich wirklich gespannt drauf"}, {"id": 721, "start": 5099.8, "end": 5101.8, "text": "Hat jemand von euch schon den Singleplayer gespielt?"}, {"id": 722, "start": 5107.8, "end": 5108.8, "text": "Komm raus, kommt raus!"}, {"id": 723, "start": 5108.8, "end": 5110.8, "text": "Ich weiß, dass ihr da raus kommt jetzt"}, {"id": 724, "start": 5110.8, "end": 5111.8, "text": "Weg!"}, {"id": 725, "start": 5111.8, "end": 5112.8, "text": "Weg, bitte!"}, {"id": 726, "start": 5116.8, "end": 5117.8, "text": "Was?!"}, {"id": 727, "start": 5122.8, "end": 5123.8, "text": "WTF!"}, {"id": 728, "start": 5123.8, "end": 5125.8, "text": "WTF, ey!"}, {"id": 729, "start": 5127.8, "end": 5128.8, "text": "Was ist das?"}, {"id": 730, "start": 5131.8, "end": 5133.8, "text": "Auf 5-7, echt gut"}, {"id": 731, "start": 5145.8, "end": 5146.8, "text": "Die..."}, {"id": 732, "start": 5146.8, "end": 5147.8, "text": "Sag mal!"}, {"id": 733, "start": 5147.8, "end": 5153.8, "text": "Können die immer nicht von beiden Seiten kommen?"}, {"id": 734, "start": 5153.8, "end": 5155.8, "text": "Der will mich flanken"}, {"id": 735, "start": 5163.8, "end": 5164.8, "text": "Kacke"}, {"id": 736, "start": 5168.8, "end": 5171.8, "text": "Ich weiß nicht, wo ich langlaufen soll"}, {"id": 737, "start": 5171.8, "end": 5173.8, "text": "Okay, ich mach das..."}, {"id": 738, "start": 5173.8, "end": 5175.8, "text": "Ich spiele das alles viel zu aggressiv"}, {"id": 739, "start": 5176.8, "end": 5178.8, "text": "Hier muss man stelsen"}, {"id": 740, "start": 5191.8, "end": 5194.8, "text": "Ich hab auf die FPS geguckt, anstatt auf den Gegner"}, {"id": 741, "start": 5194.8, "end": 5196.8, "text": "Ich hab auf die FPS geguckt, anstatt auf den Gegner"}, {"id": 742, "start": 5196.8, "end": 5198.8, "text": "Ich hab auf die FPS geguckt, anstatt auf den Gegner"}, {"id": 743, "start": 5198.8, "end": 5201.8, "text": "Komisches Zeug"}, {"id": 744, "start": 5201.8, "end": 5229.8, "text": "Ah, das war das Ding"}, {"id": 745, "start": 5229.8, "end": 5231.8, "text": "Geht einander mit der Shotgun rum"}, {"id": 746, "start": 5241.8, "end": 5243.8, "text": "Den holen wir uns hier oben"}, {"id": 747, "start": 5253.8, "end": 5254.8, "text": "Zu viele"}, {"id": 748, "start": 5255.8, "end": 5257.8, "text": "Das gibt's nicht sonst noch zur Auswahl"}, {"id": 749, "start": 5257.8, "end": 5259.8, "text": "Was kann denn das Teil?"}, {"id": 750, "start": 5260.8, "end": 5262.8, "text": "Oh ja, das war..."}, {"id": 751, "start": 5263.8, "end": 5264.8, "text": "Nee"}, {"id": 752, "start": 5265.8, "end": 5266.8, "text": "Das ist ja..."}, {"id": 753, "start": 5266.8, "end": 5267.8, "text": "Bisschen fett"}, {"id": 754, "start": 5270.8, "end": 5271.8, "text": "Heute ist ja nächstes Mal fett"}, {"id": 755, "start": 5271.8, "end": 5272.8, "text": "Das ist mir ja sick"}, {"id": 756, "start": 5276.8, "end": 5278.8, "text": "Ich würd gern was sehen"}, {"id": 757, "start": 5282.8, "end": 5283.8, "text": "Ich würd gern was sehen"}, {"id": 758, "start": 5283.8, "end": 5284.8, "text": "Oh, Sniper"}, {"id": 759, "start": 5284.8, "end": 5287.8, "text": "Das wird geschneibt"}, {"id": 760, "start": 5288.8, "end": 5290.8, "text": "Moment, was?"}, {"id": 761, "start": 5295.8, "end": 5297.8, "text": "Domo-Map"}, {"id": 762, "start": 5297.8, "end": 5307.8, "text": "Muss die Map sein, kann nicht an mir liegen"}, {"id": 763, "start": 5315.8, "end": 5317.8, "text": "Wie ist ein Luftanhalten überhaupt gewesen?"}, {"id": 764, "start": 5317.8, "end": 5318.8, "text": "Shift, oder?"}, {"id": 765, "start": 5318.8, "end": 5319.8, "text": "Macht er aber nicht"}, {"id": 766, "start": 5319.8, "end": 5335.8, "text": "Geht vielleicht mit dem Visier nicht"}, {"id": 767, "start": 5335.8, "end": 5341.8, "text": "Die Map ist aber echt bisschen langatmisch"}, {"id": 768, "start": 5341.8, "end": 5345.8, "text": "Und ich weiß nicht, was ich machen soll"}, {"id": 769, "start": 5345.8, "end": 5347.8, "text": "Zumindest hier nicht in die Mitte rennen"}, {"id": 770, "start": 5347.8, "end": 5349.8, "text": "Warum? Warum renn ich in die Mitte? Das ist total überknackt"}, {"id": 771, "start": 5359.8, "end": 5360.8, "text": "Moment, jetzt sind sie hinter uns"}, {"id": 772, "start": 5360.8, "end": 5361.8, "text": "Die sind hier hinter uns gekommen"}, {"id": 773, "start": 5367.8, "end": 5368.8, "text": "Ich check's nicht"}, {"id": 774, "start": 5369.8, "end": 5370.8, "text": "Wo sind die Gegner?"}, {"id": 775, "start": 5370.8, "end": 5372.8, "text": "Kann man hier raussnipern? Nein"}, {"id": 776, "start": 5385.8, "end": 5386.8, "text": "Ich muss sagen"}, {"id": 777, "start": 5387.8, "end": 5390.8, "text": "So den Flauder-Map hab ich nicht... gar nicht raus"}, {"id": 778, "start": 5390.8, "end": 5395.8, "text": "Immerhin einen weggeschneibt"}, {"id": 779, "start": 5395.8, "end": 5396.8, "text": "Und wir haben gewonnen"}, {"id": 780, "start": 5410.8, "end": 5416.8, "text": "Ja, hat äh, kann sein, dass ich jetzt im Chat"}, {"id": 781, "start": 5416.8, "end": 5420.8, "text": "überlesen hab, hat jemand den Singleplayer gespielt?"}, {"id": 782, "start": 5420.8, "end": 5422.8, "text": "Und lohnt sich das?"}, {"id": 783, "start": 5424.8, "end": 5428.8, "text": "Nein, Comstar, MW Remastered hab ich nicht gespielt"}, {"id": 784, "start": 5428.8, "end": 5440.8, "text": "Ah, Random Lootbox, wie in CS"}, {"id": 785, "start": 5440.8, "end": 5442.8, "text": "Ein Rank-Token"}, {"id": 786, "start": 5442.8, "end": 5444.8, "text": "Was macht das?"}, {"id": 787, "start": 5444.8, "end": 5445.8, "text": "Weiß ich nicht"}, {"id": 788, "start": 5445.8, "end": 5446.8, "text": "Was macht das?"}, {"id": 789, "start": 5446.8, "end": 5447.8, "text": "Was macht das?"}, {"id": 790, "start": 5447.8, "end": 5448.8, "text": "Was macht das?"}, {"id": 791, "start": 5448.8, "end": 5449.8, "text": "Was macht das?"}, {"id": 792, "start": 5449.8, "end": 5450.8, "text": "Was macht das?"}, {"id": 793, "start": 5450.8, "end": 5451.8, "text": "Was macht das?"}, {"id": 794, "start": 5451.8, "end": 5452.8, "text": "Was macht das?"}, {"id": 795, "start": 5452.8, "end": 5453.8, "text": "Was macht das?"}, {"id": 796, "start": 5453.8, "end": 5458.8, "text": "Ein Rank-Token"}, {"id": 797, "start": 5458.8, "end": 5461.8, "text": "Was macht das, weiß man nicht"}, {"id": 798, "start": 5469.8, "end": 5471.8, "text": "Orders, so"}, {"id": 799, "start": 5471.8, "end": 5474.8, "text": "Wind.iedm, das haben wir abgeschlossen, dann geben wir das mal ab"}, {"id": 800, "start": 5474.8, "end": 5484.8, "text": "Warum man jetzt natürlich zum abgeben wieder in diesen komischen Hub strand muss, spielst du auf Max Settings Max? Nein."}, {"id": 801, "start": 5484.8, "end": 5494.8, "text": "Ich hatte am Anfang relativ hohe Settings und ich hatte 37 FPS auf einer 1080 Ti."}, {"id": 802, "start": 5494.8, "end": 5500.8, "text": "Jetzt habe ich Low bis Normal Settings."}, {"id": 803, "start": 5500.8, "end": 5504.8, "text": "Und es läuft."}, {"id": 804, "start": 5504.8, "end": 5524.8, "text": "Also was soll ich machen?"}, {"id": 805, "start": 5524.8, "end": 5530.8, "text": "Ich habe eigentlich überhaupt keinen Bock auf diese Kommission."}, {"id": 806, "start": 5530.8, "end": 5534.8, "text": "Der Schatten sieht gut aus hier."}, {"id": 807, "start": 5534.8, "end": 5540.8, "text": "Der Schatten sieht richtig gut aus."}, {"id": 808, "start": 5540.8, "end": 5548.8, "text": "Und vor allem, warum ist da überhaupt Schatten?"}, {"id": 809, "start": 5548.8, "end": 5564.8, "text": "Ist das schon released? Ja."}, {"id": 810, "start": 5564.8, "end": 5586.8, "text": "Ah ok, hier kann man sich dann Skins und so geben. Es könnte mir eigentlich kaum was egaler sein, um ehrlich zu sein."}, {"id": 811, "start": 5586.8, "end": 5596.8, "text": "Skicker fragt, wird das Spiel mit einem i7 7700 und einer GTX 1070 vernünftig laufen? Ja."}, {"id": 812, "start": 5596.8, "end": 5600.8, "text": "Garantiert."}, {"id": 813, "start": 5600.8, "end": 5610.8, "text": "Allerdings nicht auf High, weil auf High läuft es auf einer 1080 Ti nicht gut."}, {"id": 814, "start": 5610.8, "end": 5620.8, "text": "Das läuft schon."}, {"id": 815, "start": 5620.8, "end": 5628.8, "text": "Von rechts kommt was?"}, {"id": 816, "start": 5628.8, "end": 5642.8, "text": "Schreckt. In the ass schreckt."}, {"id": 817, "start": 5642.8, "end": 5646.8, "text": "Ich höre was von hinten. Also hier durch gefällt mir nicht."}, {"id": 818, "start": 5646.8, "end": 5654.8, "text": "Gehe mal lieber durchs Haus."}, {"id": 819, "start": 5654.8, "end": 5658.8, "text": "Du kommst doch bestimmt hier rein jetzt."}, {"id": 820, "start": 5658.8, "end": 5666.8, "text": "Da ist er doch."}, {"id": 821, "start": 5666.8, "end": 5678.8, "text": "Treppe campen, das sind Shooter. Treppe campen geht immer."}, {"id": 822, "start": 5678.8, "end": 5684.8, "text": "Wir können mit unserer SMG nicht anstinken."}, {"id": 823, "start": 5684.8, "end": 5688.8, "text": "Schreckt."}, {"id": 824, "start": 5688.8, "end": 5692.8, "text": "Oh da kommt was rein."}, {"id": 825, "start": 5692.8, "end": 5700.8, "text": "Ich weiß nicht von wo die kommen, von wo kommen die überhaupt?"}, {"id": 826, "start": 5700.8, "end": 5728.8, "text": "Von oben, ich bin von oben drauf gesprungen."}, {"id": 827, "start": 5728.8, "end": 5734.8, "text": "Das hat keinen Sinn, das zu contesten mit der SMG."}, {"id": 828, "start": 5734.8, "end": 5744.8, "text": "Was, bitte hilf."}, {"id": 829, "start": 5744.8, "end": 5770.8, "text": "Der Health Rack ist ziemlich langsam."}, {"id": 830, "start": 5770.8, "end": 5774.8, "text": "Max Reaktionszeit steigt, das stimmt."}, {"id": 831, "start": 5774.8, "end": 5776.8, "text": "Das liegt aber hauptsächlich daran, dass ich die Maps nicht kenne."}, {"id": 832, "start": 5776.8, "end": 5778.8, "text": "Ich habe keine Ahnung, wo die Gegner herkommen können."}, {"id": 833, "start": 5778.8, "end": 5786.8, "text": "Das ist eigentlich das, was die Reaktionszeit von jedem steigert, wenn er weiß, auf was er sich einstellen muss."}, {"id": 834, "start": 5786.8, "end": 5796.8, "text": "Das weißt du halt nur, wenn du die Map kennst."}, {"id": 835, "start": 5796.8, "end": 5804.8, "text": "Der steht da oben am Fenster und wartet."}, {"id": 836, "start": 5804.8, "end": 5814.8, "text": "Dann gehen wir jetzt hier lang und bashen den Typ, der da gleich lang kommt."}, {"id": 837, "start": 5814.8, "end": 5820.8, "text": "Was, ich konnte mich nicht weiter drehen. Ich konnte mich nicht drehen, weil ich gegen die Wand gelegen habe."}, {"id": 838, "start": 5820.8, "end": 5822.8, "text": "Das wusste ich gar nicht, dass das ein Ding ist."}, {"id": 839, "start": 5822.8, "end": 5828.8, "text": "Das heißt, man kann sich nicht drehen."}, {"id": 840, "start": 5828.8, "end": 5831.8, "text": "Okay, man kann sich nicht drehen."}, {"id": 841, "start": 5831.8, "end": 5834.8, "text": "Ich bleib mir hier dahinter stehen."}, {"id": 842, "start": 5834.8, "end": 5840.8, "text": "Max hat schon mal den War-Modus gespielt, nur in der Beta."}, {"id": 843, "start": 5840.8, "end": 5850.8, "text": "Call of Duty Tode, laufend von der Seite."}, {"id": 844, "start": 5850.8, "end": 5854.8, "text": "Der war gut in der Beta, ich fand den gut."}, {"id": 845, "start": 5854.8, "end": 5878.8, "text": "Der hatte einige Probleme."}, {"id": 846, "start": 5878.8, "end": 5887.8, "text": "Der ist unter uns, kommt hier hoch irgendwie."}, {"id": 847, "start": 5887.8, "end": 5890.8, "text": "Ich verstehe die Call of Duty Tode oftmals nicht."}, {"id": 848, "start": 5890.8, "end": 5893.8, "text": "Man sieht den Gegner eine Millisekunde und ist tot."}, {"id": 849, "start": 5893.8, "end": 5900.8, "text": "Und er hat mich schon drei Stunden da oben stehen sehen."}, {"id": 850, "start": 5900.8, "end": 5906.8, "text": "Aber wenn man die Maps kennen, dann geht das alles viel besser."}, {"id": 851, "start": 5906.8, "end": 5909.8, "text": "Oh, die muss ich ausprobieren."}, {"id": 852, "start": 5909.8, "end": 5938.8, "text": "Die waren gerade fünf, geil."}, {"id": 853, "start": 5938.8, "end": 5957.8, "text": "Von außen war einer."}, {"id": 854, "start": 5957.8, "end": 5967.8, "text": "Komm her."}, {"id": 855, "start": 5967.8, "end": 5970.8, "text": "Was ist das?"}, {"id": 856, "start": 5970.8, "end": 5973.8, "text": "Okay, Häusercamp geht."}, {"id": 857, "start": 5973.8, "end": 5975.8, "text": "Was ist übrigens Nahkampf?"}, {"id": 858, "start": 5975.8, "end": 5977.8, "text": "X? Nein, X ist Waffeankung."}, {"id": 859, "start": 5977.8, "end": 5979.8, "text": "CS abklatscht, ey."}, {"id": 860, "start": 5979.8, "end": 5981.8, "text": "Richtig."}, {"id": 861, "start": 5981.8, "end": 5988.8, "text": "Mehr CS abklatscht kann es ja nicht sein."}, {"id": 862, "start": 5988.8, "end": 5992.8, "text": "Lohnt sich das Spiel? Weiß ich noch nicht."}, {"id": 863, "start": 5992.8, "end": 5999.8, "text": "Ich frage an, wie hackerverseucht das Ganze wird."}, {"id": 864, "start": 5999.8, "end": 6001.8, "text": "Und solche Dinger."}, {"id": 865, "start": 6001.8, "end": 6021.8, "text": "Wo sind denn Gegner?"}, {"id": 866, "start": 6021.8, "end": 6029.8, "text": "Ich muss weg."}, {"id": 867, "start": 6029.8, "end": 6033.8, "text": "Bombe, Bombe. Nein."}, {"id": 868, "start": 6033.8, "end": 6036.8, "text": "Bombe, Bombe."}, {"id": 869, "start": 6036.8, "end": 6038.8, "text": "Bombe."}, {"id": 870, "start": 6038.8, "end": 6040.8, "text": "Nein."}, {"id": 871, "start": 6040.8, "end": 6043.8, "text": "Ich habe eine Bombe und die Rolle ist vorbei."}, {"id": 872, "start": 6043.8, "end": 6048.8, "text": "Na toll."}, {"id": 873, "start": 6048.8, "end": 6062.8, "text": "Sind wir mal nett, so wie sich das gehört."}, {"id": 874, "start": 6062.8, "end": 6063.8, "text": "Ich würde warten."}, {"id": 875, "start": 6063.8, "end": 6066.8, "text": "Wenn man das nicht gleich spielen will, dann würde ich warten."}, {"id": 876, "start": 6066.8, "end": 6069.8, "text": "Dann würde ich mir das mal eine Woche angucken."}, {"id": 877, "start": 6069.8, "end": 6072.8, "text": "Auf Streams und mal ein bisschen schauen."}, {"id": 878, "start": 6072.8, "end": 6074.8, "text": "Was ist im offiziellen Forum los?"}, {"id": 879, "start": 6074.8, "end": 6086.8, "text": "Was wird geflammt und sich dann entscheiden, ob man es haben will?"}, {"id": 880, "start": 6086.8, "end": 6091.8, "text": "Wie ist die Spielerbasis auf dem PC?"}, {"id": 881, "start": 6091.8, "end": 6093.8, "text": "Wie viele Leute spielen das überhaupt?"}, {"id": 882, "start": 6093.8, "end": 6098.8, "text": "Und wie viele Hacker?"}, {"id": 883, "start": 6098.8, "end": 6106.8, "text": "Mir fällt es immer schwer, diese Leute Hacker zu nennen."}, {"id": 884, "start": 6106.8, "end": 6110.8, "text": "Wie einfach wird es sein, so etwas für das Spiel herzustellen?"}, {"id": 885, "start": 6110.8, "end": 6117.8, "text": "In der Beta gab es schon am ersten Tag welche."}, {"id": 886, "start": 6117.8, "end": 6119.8, "text": "Davon ist es abhängig, wie gut das Ganze funktionieren wird."}, {"id": 887, "start": 6119.8, "end": 6121.8, "text": "Ob sich das lohnt."}, {"id": 888, "start": 6121.8, "end": 6126.8, "text": "Oder alternativ, man sagt, euch interessiert nur das Singleplayer."}, {"id": 889, "start": 6126.8, "end": 6131.8, "text": "Dann würde ich mir einfach mal einen Test durchlesen, ob das einen anspricht."}, {"id": 890, "start": 6131.8, "end": 6136.8, "text": "Was Tommy, 14k Spieler online im Moment auf dem PC?"}, {"id": 891, "start": 6136.8, "end": 6140.8, "text": "Das ist ja nichts."}, {"id": 892, "start": 6140.8, "end": 6151.8, "text": "Das ist nichts."}, {"id": 893, "start": 6151.8, "end": 6159.8, "text": "Es ist wirklich nichts, 14k."}, {"id": 894, "start": 6159.8, "end": 6162.8, "text": "Ah, das ist die Beta-Map."}, {"id": 895, "start": 6162.8, "end": 6165.8, "text": "PC-Cod halt null."}, {"id": 896, "start": 6165.8, "end": 6169.8, "text": "Das liegt an Activision beziehungsweise Entwicklerstudios und Activision zusammen."}, {"id": 897, "start": 6169.8, "end": 6172.8, "text": "Das auf dem PC gut zu machen."}, {"id": 898, "start": 6172.8, "end": 6178.8, "text": "Wenn das Spiel gut wäre auf dem PC, also guter Port, guter Support und Sachen, die es ausmachen."}, {"id": 899, "start": 6178.8, "end": 6182.8, "text": "Wenn das alles gut wäre, dann hat es vielleicht am Anfang auch gut 14k."}, {"id": 900, "start": 6182.8, "end": 6184.8, "text": "Würde aber steigen, weil das Spiel einfach gut ist."}, {"id": 901, "start": 6184.8, "end": 6191.8, "text": "Und gute Spiele setzen sich mit der Zeit, meistens zumindest dann, auch halbwegs durch."}, {"id": 902, "start": 6191.8, "end": 6197.8, "text": "Aber wenn das Spiel halt suckt."}, {"id": 903, "start": 6197.8, "end": 6200.8, "text": "Dann nicht, ne?"}, {"id": 904, "start": 6200.8, "end": 6223.8, "text": "Warum ist der Typ tot?"}, {"id": 905, "start": 6223.8, "end": 6231.8, "text": "Schneiberkacke, ey."}, {"id": 906, "start": 6231.8, "end": 6235.8, "text": "Was hat so ganze Sniper in einem Close-Quarter-Szenario zu suchen?"}, {"id": 907, "start": 6235.8, "end": 6237.8, "text": "Ich verstehe das nicht."}, {"id": 908, "start": 6237.8, "end": 6239.8, "text": "Schon die ersten OP-Waffen aufgetaucht, keine Ahnung."}, {"id": 909, "start": 6239.8, "end": 6267.8, "text": "In der Beta gab es einige."}, {"id": 910, "start": 6267.8, "end": 6269.8, "text": "Oh, ich habe eine Donation, danke."}, {"id": 911, "start": 6269.8, "end": 6276.8, "text": "Ich schau gleich rein."}, {"id": 912, "start": 6276.8, "end": 6279.8, "text": "Falls nicht, flamet mich."}, {"id": 913, "start": 6279.8, "end": 6283.8, "text": "Und sagt, ich soll reingucken."}, {"id": 914, "start": 6283.8, "end": 6294.8, "text": "Was ist denn hier los?"}, {"id": 915, "start": 6294.8, "end": 6295.8, "text": "Na, super."}, {"id": 916, "start": 6295.8, "end": 6297.8, "text": "Donation, danke für die Donation."}, {"id": 917, "start": 6297.8, "end": 6304.8, "text": "Und zwar von..."}, {"id": 918, "start": 6304.8, "end": 6307.8, "text": "Das Zebaro hat donatet."}, {"id": 919, "start": 6307.8, "end": 6308.8, "text": "Schon wieder."}, {"id": 920, "start": 6308.8, "end": 6310.8, "text": "Du donatest immer so viel."}, {"id": 921, "start": 6310.8, "end": 6312.8, "text": "Ich hoffe, du weißt."}, {"id": 922, "start": 6312.8, "end": 6314.8, "text": "Ich freue mich da drüber."}, {"id": 923, "start": 6314.8, "end": 6318.8, "text": "Aber du musst nicht donaten, ne?"}, {"id": 924, "start": 6318.8, "end": 6321.8, "text": "Du bist schon Mord und kümmerst dich um den Chat."}, {"id": 925, "start": 6321.8, "end": 6324.8, "text": "Ich finde das natürlich super, wenn du donatest."}, {"id": 926, "start": 6324.8, "end": 6325.8, "text": "Was hat er geschrieben?"}, {"id": 927, "start": 6325.8, "end": 6328.8, "text": "RIP an die Leute, die erst frei ab 18 haben."}, {"id": 928, "start": 6328.8, "end": 6329.8, "text": "Lull."}, {"id": 929, "start": 6329.8, "end": 6331.8, "text": "Eineinhalb Stunden verpasst feels Batman."}, {"id": 930, "start": 6331.8, "end": 6332.8, "text": "Sind die FPS in Ultrasettings?"}, {"id": 931, "start": 6332.8, "end": 6334.8, "text": "Nein, nein, nein, nein, nein, nein, nein."}, {"id": 932, "start": 6334.8, "end": 6337.8, "text": "Die FPS sind nicht in Ultrasettings."}, {"id": 933, "start": 6337.8, "end": 6339.8, "text": "Renterrechner gut mit Gameplus-Stream."}, {"id": 934, "start": 6339.8, "end": 6344.8, "text": "Ja, das läuft gut, aber die Settings sind low."}, {"id": 935, "start": 6344.8, "end": 6346.8, "text": "Die Settings sind low."}, {"id": 936, "start": 6346.8, "end": 6349.8, "text": "Weil vorher hatte ich 37 FPS."}, {"id": 937, "start": 6349.8, "end": 6350.8, "text": "Ungelogen als, ne?"}, {"id": 938, "start": 6350.8, "end": 6352.8, "text": "Ihr habt es gesehen, 37 FPS."}, {"id": 939, "start": 6352.8, "end": 6354.8, "text": "Perfekt."}, {"id": 940, "start": 6362.8, "end": 6364.8, "text": "Suche einen Gegner."}, {"id": 941, "start": 6364.8, "end": 6367.8, "text": "Werfen wir mal irgendwie so random, was?"}, {"id": 942, "start": 6367.8, "end": 6369.8, "text": "Hä?"}, {"id": 943, "start": 6369.8, "end": 6371.8, "text": "What?"}, {"id": 944, "start": 6375.8, "end": 6377.8, "text": "Okay."}, {"id": 945, "start": 6377.8, "end": 6379.8, "text": "Okay."}, {"id": 946, "start": 6382.8, "end": 6386.8, "text": "Haben sie die Waffe einfach schlechter gemacht als bei der Beta?"}, {"id": 947, "start": 6386.8, "end": 6391.8, "text": "Kommt es vor als Kriegsstamm, wenn nichts mehr droht?"}, {"id": 948, "start": 6391.8, "end": 6395.8, "text": "Außer wenn der Gegner nicht in meine Richtung guckt."}, {"id": 949, "start": 6403.8, "end": 6405.8, "text": "Ich weiß nicht, was Nahkampf ist."}, {"id": 950, "start": 6405.8, "end": 6409.8, "text": "Ich muss jetzt mal auf V, B, C, F."}, {"id": 951, "start": 6419.8, "end": 6421.8, "text": "Was ist, was ist?"}, {"id": 952, "start": 6421.8, "end": 6422.8, "text": "Coup."}, {"id": 953, "start": 6422.8, "end": 6423.8, "text": "Probier mal."}, {"id": 954, "start": 6423.8, "end": 6426.8, "text": "Coup, Coup könnte Nahkampf sein vielleicht."}, {"id": 955, "start": 6426.8, "end": 6427.8, "text": "Coup."}, {"id": 956, "start": 6427.8, "end": 6428.8, "text": "Coup ist Nahkampf."}, {"id": 957, "start": 6428.8, "end": 6438.8, "text": "Jawoll."}, {"id": 958, "start": 6438.8, "end": 6442.8, "text": "Da schnippt er sich ein."}, {"id": 959, "start": 6442.8, "end": 6444.8, "text": "Die Balken sind noch da, Tommy."}, {"id": 960, "start": 6444.8, "end": 6446.8, "text": "Alles beim alten."}, {"id": 961, "start": 6446.8, "end": 6450.8, "text": "Also alles beschissen, was das angeht."}, {"id": 962, "start": 6450.8, "end": 6452.8, "text": "Ping-Balken."}, {"id": 963, "start": 6452.8, "end": 6453.8, "text": "So lächerlich."}, {"id": 964, "start": 6453.8, "end": 6458.8, "text": "Wirklich so lächerlich."}, {"id": 965, "start": 6458.8, "end": 6460.8, "text": "Hinter mir."}, {"id": 966, "start": 6460.8, "end": 6470.8, "text": "Fuck."}, {"id": 967, "start": 6470.8, "end": 6471.8, "text": "Great hiding spots."}, {"id": 968, "start": 6471.8, "end": 6472.8, "text": "Ja."}, {"id": 969, "start": 6472.8, "end": 6481.8, "text": "Great hiding spots gibt es hier auch wieder viele."}, {"id": 970, "start": 6481.8, "end": 6483.8, "text": "Ich hab Schiss rauszugehen."}, {"id": 971, "start": 6483.8, "end": 6489.8, "text": "Krieg ich auf den Sack."}, {"id": 972, "start": 6489.8, "end": 6496.8, "text": "Was?"}, {"id": 973, "start": 6496.8, "end": 6497.8, "text": "Warum steht er hier nicht?"}, {"id": 974, "start": 6497.8, "end": 6503.8, "text": "Ich hab ein halbes Magazin draufgeschossen in die Richtung."}, {"id": 975, "start": 6503.8, "end": 6508.8, "text": "Also ich glaube, dass ich würde sagen, das ist so wie man das vermutet hat."}, {"id": 976, "start": 6508.8, "end": 6511.8, "text": "Es sind Server im Einsatz."}, {"id": 977, "start": 6511.8, "end": 6514.8, "text": "Ganz normale."}, {"id": 978, "start": 6514.8, "end": 6515.8, "text": "Gehostet."}, {"id": 979, "start": 6515.8, "end": 6519.8, "text": "Also nicht mit P2P."}, {"id": 980, "start": 6519.8, "end": 6529.8, "text": "Aber wenn es keine gibt, gibt es halt P2P mit Horseman Crash und dem ganzen Kacke."}, {"id": 981, "start": 6529.8, "end": 6537.8, "text": "Aber es ist selten."}, {"id": 982, "start": 6537.8, "end": 6539.8, "text": "Spray and pray."}, {"id": 983, "start": 6539.8, "end": 6544.8, "text": "Es wird gesprüht und gebetet."}, {"id": 984, "start": 6544.8, "end": 6547.8, "text": "Aber ich hab das Gefühl, aus der Hüfte trifft man schlechter."}, {"id": 985, "start": 6547.8, "end": 6548.8, "text": "Das wird es auch erklären."}, {"id": 986, "start": 6548.8, "end": 6552.8, "text": "Warum ist in der Beta übelst abgehend das Setup mit dieser Shotgun?"}, {"id": 987, "start": 6552.8, "end": 6575.8, "text": "So dumm, ich wollte extra hinter die Wand laufen."}, {"id": 988, "start": 6575.8, "end": 6576.8, "text": "Jetzt bin ich rausgelaufen."}, {"id": 989, "start": 6576.8, "end": 6580.8, "text": "Ich hab das selbst gekauft."}, {"id": 990, "start": 6580.8, "end": 6583.8, "text": "Ich hatte keine Lust, irgendjemand anzuschreiben, ob ich das Spiel kriege oder so."}, {"id": 991, "start": 6583.8, "end": 6585.8, "text": "Ich hab draufgeschossen."}, {"id": 992, "start": 6585.8, "end": 6589.8, "text": "Komm, wir gewinnen jetzt."}, {"id": 993, "start": 6589.8, "end": 6590.8, "text": "Wir gewinnen jetzt."}, {"id": 994, "start": 6590.8, "end": 6598.8, "text": "Jawoll."}, {"id": 995, "start": 6598.8, "end": 6600.8, "text": "Ich hab das selbst gekauft."}, {"id": 996, "start": 6600.8, "end": 6603.8, "text": "Wie gesagt, ich hatte keine Lust, jemanden anzuschreiben."}, {"id": 997, "start": 6603.8, "end": 6615.8, "text": "Ich weiß auch aktuell gar nicht, wer bei Activision jetzt da der Ansprechpartner ist für sowas."}, {"id": 998, "start": 6615.8, "end": 6625.8, "text": "Früher war es der Cloud, aber der ist ja bei NVIDIA mittlerweile."}, {"id": 999, "start": 6625.8, "end": 6633.8, "text": "Und ich weiß nicht, ob er mittlerweile gewechselt ist oder immer noch bei NVIDIA."}, {"id": 1000, "start": 6633.8, "end": 6636.8, "text": "Zumindest ist das nicht mehr."}, {"id": 1001, "start": 6636.8, "end": 6638.8, "text": "Und ich glaube, sein Nachfolger ist es auch schon nicht mehr."}, {"id": 1002, "start": 6638.8, "end": 6644.8, "text": "Also ich hätte gar keine Ahnung, wer nicht anschreiben sollte wegen sowas."}, {"id": 1003, "start": 6644.8, "end": 6652.8, "text": "Hat dieses Cod Goldwaffen bestimmt?"}, {"id": 1004, "start": 6652.8, "end": 6655.8, "text": "Ja, Sam Fischer."}, {"id": 1005, "start": 6655.8, "end": 6658.8, "text": "Ich sage auch gerade richtig."}, {"id": 1006, "start": 6658.8, "end": 6661.8, "text": "Du musst erstmal wieder halbwegs in das Spiel reinkommen."}, {"id": 1007, "start": 6661.8, "end": 6669.8, "text": "Während der Beta lief das richtig gut."}, {"id": 1008, "start": 6669.8, "end": 6680.8, "text": "Kann man was Neues ausrüsten?"}, {"id": 1009, "start": 6680.8, "end": 6691.8, "text": "Ah."}, {"id": 1010, "start": 6691.8, "end": 6705.8, "text": "Moment, es gibt nichts mehr was aus der Hüfte verbessert, oder sehe ich das richtig?"}, {"id": 1011, "start": 6705.8, "end": 6706.8, "text": "Heißt das richtig?"}, {"id": 1012, "start": 6706.8, "end": 6712.8, "text": "Es gab doch in der Beta noch ein Attachment für SMGs, was das aus der Hüfte schießen verbessert hat."}, {"id": 1013, "start": 6712.8, "end": 6718.8, "text": "Oder bin ich jetzt total wir im Kopf?"}, {"id": 1014, "start": 6718.8, "end": 6721.8, "text": "Ah nee, da war es doch."}, {"id": 1015, "start": 6721.8, "end": 6723.8, "text": "Da war es doch."}, {"id": 1016, "start": 6723.8, "end": 6727.8, "text": "Ich habe es einfach nur nicht gesehen."}, {"id": 1017, "start": 6727.8, "end": 6735.8, "text": "Ich habe aber noch geklickt, mal gucken, ob das jetzt gezählt hat."}, {"id": 1018, "start": 6735.8, "end": 6741.8, "text": "Ja kommst du, das finale Game läuft nicht so gut."}, {"id": 1019, "start": 6741.8, "end": 6763.8, "text": "Ah, das ist die Beta Map."}, {"id": 1020, "start": 6763.8, "end": 6773.8, "text": "Was?"}, {"id": 1021, "start": 6773.8, "end": 6774.8, "text": "Was?"}, {"id": 1022, "start": 6774.8, "end": 6776.8, "text": "Ich war doch schon längst wieder um die Ecke."}, {"id": 1023, "start": 6776.8, "end": 6779.8, "text": "Das ist typischer Call of Duty Tod gewesen."}, {"id": 1024, "start": 6779.8, "end": 6807.8, "text": "Typischer Call of Duty Tod war das."}, {"id": 1025, "start": 6807.8, "end": 6809.8, "text": "Und die Waffe macht auch über Range weniger Damage."}, {"id": 1026, "start": 6809.8, "end": 6829.8, "text": "Also die war in der Beta richtig gut hier."}, {"id": 1027, "start": 6829.8, "end": 6832.8, "text": "Nee, die Waffe ist irgendwie doof."}, {"id": 1028, "start": 6832.8, "end": 6841.8, "text": "Max Foff, wollen wir mal erinnern, dass das Foff wieder gesettet hat?"}, {"id": 1029, "start": 6841.8, "end": 6867.8, "text": "Das ist Max Foff."}, {"id": 1030, "start": 6867.8, "end": 6885.8, "text": "Die Gegner kommen bestimmt hier lang, mal hinter mir."}, {"id": 1031, "start": 6885.8, "end": 6889.8, "text": "Irgendwie kriege ich gegen jede andere Waffe auf den Sack."}, {"id": 1032, "start": 6889.8, "end": 6891.8, "text": "Das Spiel läuft ganz gut mit Low Settings."}, {"id": 1033, "start": 6891.8, "end": 6903.8, "text": "Mit der 1080 Ti auf Low Settings, dann läuft es ganz gut."}, {"id": 1034, "start": 6903.8, "end": 6906.8, "text": "Moment."}, {"id": 1035, "start": 6906.8, "end": 6917.8, "text": "Wie habe ich den Typ eben gekillt?"}, {"id": 1036, "start": 6917.8, "end": 6939.8, "text": "Also in der Beta war ich deutlich besser."}, {"id": 1037, "start": 6939.8, "end": 6959.8, "text": "Das war klar, der war angehattert."}, {"id": 1038, "start": 6959.8, "end": 6972.8, "text": "Der denkt, er kann mich flanken."}, {"id": 1039, "start": 6972.8, "end": 6974.8, "text": "Nö."}, {"id": 1040, "start": 6974.8, "end": 6976.8, "text": "Den juckt es einfach nicht."}, {"id": 1041, "start": 6976.8, "end": 6979.8, "text": "Den kehrt es nicht."}, {"id": 1042, "start": 6979.8, "end": 7007.8, "text": "Wir gehen mal nicht lang, wir versuchen die jetzt hier zu bashen."}, {"id": 1043, "start": 7007.8, "end": 7034.8, "text": "Das war mir zu viel egal."}, {"id": 1044, "start": 7034.8, "end": 7049.8, "text": "Wie können die mich immer killen, wenn ich sie nicht sehe?"}, {"id": 1045, "start": 7049.8, "end": 7053.8, "text": "Das sind die typischen Call of Duty Tote."}, {"id": 1046, "start": 7053.8, "end": 7061.8, "text": "Das war einfach dumm von mir."}, {"id": 1047, "start": 7061.8, "end": 7065.8, "text": "Wir gewinnen, warum auch immer, wir gewinnen die Runden immer easy."}, {"id": 1048, "start": 7065.8, "end": 7079.8, "text": "An mir liegt es definitiv nicht."}, {"id": 1049, "start": 7079.8, "end": 7090.8, "text": "Was war das denn?"}, {"id": 1050, "start": 7090.8, "end": 7091.8, "text": "Samulon."}, {"id": 1051, "start": 7091.8, "end": 7093.8, "text": "Das kannst du schon auf Key Seiten kaufen."}, {"id": 1052, "start": 7093.8, "end": 7098.8, "text": "Allerdings, wenn du dir dort die günstigste Version kaufst,"}, {"id": 1053, "start": 7098.8, "end": 7103.8, "text": "kriegst du die Version für Russland."}, {"id": 1054, "start": 7103.8, "end": 7111.8, "text": "Was hier wahrscheinlich auch nicht viel bringt."}, {"id": 1055, "start": 7111.8, "end": 7121.8, "text": "Ich habe es ja schon ausgerüstet gehabt."}, {"id": 1056, "start": 7121.8, "end": 7132.8, "text": "Was haben wir jetzt für Pugs?"}, {"id": 1057, "start": 7132.8, "end": 7144.8, "text": "Das ist alles jetzt nicht so geil."}, {"id": 1058, "start": 7144.8, "end": 7153.8, "text": "Das ist eine eigene Klasse."}, {"id": 1059, "start": 7153.8, "end": 7157.8, "text": "Spiel mal andere Waffen."}, {"id": 1060, "start": 7157.8, "end": 7178.8, "text": "Wo sieht man noch mal die Pugs von der jeweiligen Division?"}, {"id": 1061, "start": 7178.8, "end": 7187.8, "text": "Also das Ding war in der Beta ganz gut."}, {"id": 1062, "start": 7187.8, "end": 7193.8, "text": "Hier muss man ganz schön viel leveln dafür."}, {"id": 1063, "start": 7193.8, "end": 7198.8, "text": "Und das SDG 44 war auch ziemlich gut."}, {"id": 1064, "start": 7198.8, "end": 7227.8, "text": "Wenn ich das mit Prestige unlock habe, habe ich es nach Prestige immer noch."}, {"id": 1065, "start": 7227.8, "end": 7246.8, "text": "Vermute ich jetzt einfach mal."}, {"id": 1066, "start": 7246.8, "end": 7271.8, "text": "Oh, das ist der Tomahawk-Ersatz."}, {"id": 1067, "start": 7271.8, "end": 7287.8, "text": "Das war nichts geklärt mit der Pistole."}, {"id": 1068, "start": 7287.8, "end": 7296.8, "text": "Falls der E-Ax am Start ist, irgendwann die Tage spielen wir mal ein bisschen War."}, {"id": 1069, "start": 7296.8, "end": 7301.8, "text": "Was gibt es denn die MP40?"}, {"id": 1070, "start": 7301.8, "end": 7307.8, "text": "Ich habe schon gelesen, wenn man Prestige hat, muss man dann erst Prestige und dann noch ein gewisses Level erreichen,"}, {"id": 1071, "start": 7307.8, "end": 7311.8, "text": "oder kriegt man die quasi mit dem ersten Prestige automatisch."}, {"id": 1072, "start": 7311.8, "end": 7325.8, "text": "Also ich Prestige jetzt quasi Airborne und dann kriege ich die MP40."}, {"id": 1073, "start": 7325.8, "end": 7330.8, "text": "Oder wie ist das?"}, {"id": 1074, "start": 7330.8, "end": 7340.8, "text": "Oh, wieder Beta-Map."}, {"id": 1075, "start": 7340.8, "end": 7349.8, "text": "Warum das Spiel jetzt allerdings 104 GB groß ist, habe ich immer noch nicht verstanden."}, {"id": 1076, "start": 7349.8, "end": 7355.8, "text": "Mit dem ersten Prestige, also ich drücke auf Prestige und dann kriege ich MP40."}, {"id": 1077, "start": 7355.8, "end": 7369.8, "text": "Ah, Prestige in einem der Kids werde ich ja wahrscheinlich hinkriegen."}, {"id": 1078, "start": 7369.8, "end": 7372.8, "text": "Moment, hier lang zu laufen ist bescheuert für meine Waffe."}, {"id": 1079, "start": 7372.8, "end": 7384.8, "text": "Muss ja auch ein bisschen Gedanken machen."}, {"id": 1080, "start": 7384.8, "end": 7386.8, "text": "Ah, fuck."}, {"id": 1081, "start": 7386.8, "end": 7392.8, "text": "Vor allem, dass der direkt an meinem Teammate vorbeigelaufen ist."}, {"id": 1082, "start": 7392.8, "end": 7394.8, "text": "F-Intel wieder upload wäre das Todesjahr, ist es."}, {"id": 1083, "start": 7394.8, "end": 7399.8, "text": "Also ich weiß nicht, was man machen muss, das ist ein Game 100, 104 musste man auf der Zunge zergehen,"}, {"id": 1084, "start": 7399.8, "end": 7417.8, "text": "104 GB, krasser Shit."}, {"id": 1085, "start": 7417.8, "end": 7431.8, "text": "Jetzt gehen wir dem ab."}, {"id": 1086, "start": 7431.8, "end": 7438.8, "text": "Call of Duty Tode, wo du guckst, immer von der Seite."}, {"id": 1087, "start": 7438.8, "end": 7442.8, "text": "Du musst nicht 104 GB downloaden, zu installieren ist es 104 GB."}, {"id": 1088, "start": 7442.8, "end": 7452.8, "text": "Das downloaden musst du nur 75 GB."}, {"id": 1089, "start": 7452.8, "end": 7454.8, "text": "Okay, kipp mich um."}, {"id": 1090, "start": 7454.8, "end": 7468.8, "text": "Nur, nur 74 GB."}, {"id": 1091, "start": 7468.8, "end": 7472.8, "text": "Was ist das?"}, {"id": 1092, "start": 7472.8, "end": 7494.8, "text": "Die fallen nicht um, was ist denn da los?"}, {"id": 1093, "start": 7494.8, "end": 7516.8, "text": "Oh, das war ver-aimed jetzt."}, {"id": 1094, "start": 7516.8, "end": 7518.8, "text": "Wie sind die Hacks?"}, {"id": 1095, "start": 7518.8, "end": 7522.8, "text": "Ich hab noch keinen gesehen."}, {"id": 1096, "start": 7522.8, "end": 7533.8, "text": "Bis jetzt, das wird aber nicht lange dauern."}, {"id": 1097, "start": 7533.8, "end": 7560.8, "text": "Ich dachte mir, dass du da lang kommst."}, {"id": 1098, "start": 7560.8, "end": 7563.8, "text": "Nee, da geh ich jetzt nicht lang, da ist so voll."}, {"id": 1099, "start": 7563.8, "end": 7567.8, "text": "Gehen wir mal in der Mitte gucken."}, {"id": 1100, "start": 7567.8, "end": 7574.8, "text": "Links geht was."}, {"id": 1101, "start": 7574.8, "end": 7582.8, "text": "Hinter uns, BTF."}, {"id": 1102, "start": 7582.8, "end": 7592.8, "text": "Gefährlich."}, {"id": 1103, "start": 7592.8, "end": 7605.8, "text": "Gehen da jetzt mal durch."}, {"id": 1104, "start": 7605.8, "end": 7609.8, "text": "Das Gefühl ist, manchmal schießt das Zeug mit Papierkugeln."}, {"id": 1105, "start": 7609.8, "end": 7635.8, "text": "Drei, vier Hitmarker, das ist mir doch egal, da schieß ich einfach weiter."}, {"id": 1106, "start": 7635.8, "end": 7638.8, "text": "Du hast auf Hackerseiten schon den ersten Hack gesehen."}, {"id": 1107, "start": 7638.8, "end": 7645.8, "text": "Was machst du denn auf diesen Seiten, was man fragen darf?"}, {"id": 1108, "start": 7645.8, "end": 7652.8, "text": "Würde mich ja mal interessieren, das ist wahrscheinlich rein zu Recherchezwecken."}, {"id": 1109, "start": 7652.8, "end": 7655.8, "text": "Oder?"}, {"id": 1110, "start": 7655.8, "end": 7669.8, "text": "Bestimmt rein zu Recherchezwecken."}, {"id": 1111, "start": 7669.8, "end": 7674.8, "text": "Die Runde geht ganz gut."}, {"id": 1112, "start": 7674.8, "end": 7679.8, "text": "Aber wir verlieren."}, {"id": 1113, "start": 7679.8, "end": 7682.8, "text": "Papierkugeln wieder."}, {"id": 1114, "start": 7682.8, "end": 7689.8, "text": "Wir hatten auch die gleiche Waffe."}, {"id": 1115, "start": 7689.8, "end": 7690.8, "text": "Out Dynamics."}, {"id": 1116, "start": 7690.8, "end": 7695.8, "text": "Naja, ich reg mich da mittlerweile, also Balancing technisch bei Call of Duty aufregend."}, {"id": 1117, "start": 7695.8, "end": 7698.8, "text": "Klar, ich kann mich da auch aufregend, wobei hier durchzugehen ist das bescheuert, wenn"}, {"id": 1118, "start": 7698.8, "end": 7699.8, "text": "die auf Position sind."}, {"id": 1119, "start": 7699.8, "end": 7704.8, "text": "Damage technisch reg ich mich natürlich auch auf, aber in Call of Duty steige ich mich"}, {"id": 1120, "start": 7704.8, "end": 7705.8, "text": "da nimmer so rein."}, {"id": 1121, "start": 7705.8, "end": 7711.8, "text": "Bei Overwatch könnte ich mich aufregend, weil das Game so unglaublich viel Potential hat."}, {"id": 1122, "start": 7711.8, "end": 7713.8, "text": "Und halt einige Sachen nicht so funktionieren."}, {"id": 1123, "start": 7713.8, "end": 7718.8, "text": "Wie ich mir das vorstelle."}, {"id": 1124, "start": 7718.8, "end": 7719.8, "text": "What the fuck."}, {"id": 1125, "start": 7719.8, "end": 7726.8, "text": "Es geht mit dem Typ ab."}, {"id": 1126, "start": 7726.8, "end": 7740.8, "text": "Mithilf."}, {"id": 1127, "start": 7740.8, "end": 7741.8, "text": "Komm wir gewinnen das jetzt."}, {"id": 1128, "start": 7741.8, "end": 7742.8, "text": "Leute, gewinnen."}, {"id": 1129, "start": 7742.8, "end": 7743.8, "text": "Fuck, verloren."}, {"id": 1130, "start": 7743.8, "end": 7744.8, "text": "Gleich Blizzcon."}, {"id": 1131, "start": 7744.8, "end": 7745.8, "text": "Mal gucken was da vorgestellt wird."}, {"id": 1132, "start": 7745.8, "end": 7761.8, "text": "Aber eins finde ich, was ich wenigstens, Gott sei Dank jetzt Ihnen mal aufgefallen"}, {"id": 1133, "start": 7761.8, "end": 7767.8, "text": "ist, dass man in Overwatch im Hauptmenü darauf hinweisen sollte, dass World Cup ist."}, {"id": 1134, "start": 7767.8, "end": 7774.8, "text": "Ich verstehe nicht, wie man dieses Potential bisher verschenkt hat, dass man nicht darauf"}, {"id": 1135, "start": 7774.8, "end": 7775.8, "text": "hingewiesen hat."}, {"id": 1136, "start": 7775.8, "end": 7776.8, "text": "Quasi im Spiel."}, {"id": 1137, "start": 7776.8, "end": 7781.8, "text": "Hier gerade läuft ein von uns gesponsertes, von uns ins Leben gerufenes großes Turnier."}, {"id": 1138, "start": 7781.8, "end": 7789.2, "text": "Du musstest irgendwie Glück haben und alle 5-6 verschiedenen Overwatch Twitch Kanäle"}, {"id": 1139, "start": 7789.2, "end": 7791.8, "text": "abonniert haben und das war ganz werkwürdig gemacht."}, {"id": 1140, "start": 7791.8, "end": 7795.8, "text": "So als hätte Blizzard keine Ahnung, wie man es macht, aber Blizzard müsste es eigentlich"}, {"id": 1141, "start": 7795.8, "end": 7796.8, "text": "wissen."}, {"id": 1142, "start": 7796.8, "end": 7800.8, "text": "Was auch immer."}, {"id": 1143, "start": 7800.8, "end": 7805.8, "text": "Ja, Overwatch World Cup werde ich auch nachher gucken."}, {"id": 1144, "start": 7805.8, "end": 7807.8, "text": "Das müsste demnächst losgehen."}, {"id": 1145, "start": 7807.8, "end": 7814.8, "text": "Mal kurz schauen."}, {"id": 1146, "start": 7814.8, "end": 7828.8, "text": "Overwatch World Cup in einer Stunde, 1 Stunde 30, UK vs. England gegen Schweden."}, {"id": 1147, "start": 7828.8, "end": 7829.8, "text": "So rum."}, {"id": 1148, "start": 7829.8, "end": 7831.8, "text": "United Kingdom gegen Schweden."}, {"id": 1149, "start": 7831.8, "end": 7833.8, "text": "Danach, Kanada, Australien."}, {"id": 1150, "start": 7833.8, "end": 7835.8, "text": "Danach, China, Frankreich."}, {"id": 1151, "start": 7835.8, "end": 7838.8, "text": "Danach, Südkorea, USA, aber das ist erst in 6 Stunden."}, {"id": 1152, "start": 7838.8, "end": 7846.8, "text": "Ich werde wahrscheinlich schon pennen."}, {"id": 1153, "start": 7846.8, "end": 7856.8, "text": "Ratet mal, wer gerade noch bei Twitch online gegangen ist nach 3000 Jahren."}, {"id": 1154, "start": 7856.8, "end": 7857.8, "text": "Sebao."}, {"id": 1155, "start": 7857.8, "end": 7862.8, "text": "Wer könnte das sein?"}, {"id": 1156, "start": 7862.8, "end": 7864.8, "text": "Wenn du das so sagst, jemand, den ich auch kenne."}, {"id": 1157, "start": 7864.8, "end": 7872.8, "text": "Ach, gibt's denn auch noch?"}, {"id": 1158, "start": 7872.8, "end": 7877.8, "text": "Gibt's denn auch noch?"}, {"id": 1159, "start": 7877.8, "end": 7882.8, "text": "Ich hab mal letztens bei ihm auf dem YouTube-Channel geguckt."}, {"id": 1160, "start": 7882.8, "end": 7885.8, "text": "War irgendwie ein halbes Jahr oder so und nichts mal hochgeladen."}, {"id": 1161, "start": 7885.8, "end": 7888.8, "text": "Also fast wie bei mir."}, {"id": 1162, "start": 7888.8, "end": 7894.8, "text": "Wie sie sich alle damals über ihn aufgedeckt haben."}, {"id": 1163, "start": 7894.8, "end": 7896.8, "text": "Oh, so schlimm und bla und sonst was."}, {"id": 1164, "start": 7896.8, "end": 7904.8, "text": "Ups, was mach ich denn da eigentlich?"}, {"id": 1165, "start": 7904.8, "end": 7906.8, "text": "Was?"}, {"id": 1166, "start": 7906.8, "end": 7908.8, "text": "Hä?"}, {"id": 1167, "start": 7908.8, "end": 7917.8, "text": "Ich bin gesprungen hinter meinem Team-Mate?"}, {"id": 1168, "start": 7917.8, "end": 7923.8, "text": "Okay, ja, was auch immer."}, {"id": 1169, "start": 7923.8, "end": 7927.8, "text": "Was ist eigentlich aus dem Friseur geworden?"}, {"id": 1170, "start": 7927.8, "end": 7929.8, "text": "Der Friseur war vorher sogar im Chat."}, {"id": 1171, "start": 7929.8, "end": 7933.8, "text": "Die Waffe macht dir gar keinen Schaden."}, {"id": 1172, "start": 7933.8, "end": 7936.8, "text": "Der Friseur war vorhin sogar im Chat, dem geht's gut."}, {"id": 1173, "start": 7936.8, "end": 7938.8, "text": "Was ist das?"}, {"id": 1174, "start": 7938.8, "end": 7940.8, "text": "Thompson mit..."}, {"id": 1175, "start": 7940.8, "end": 7942.8, "text": "Oh, das ist cool."}, {"id": 1176, "start": 7942.8, "end": 7944.8, "text": "Das ist cool, das Ding."}, {"id": 1177, "start": 7944.8, "end": 7947.8, "text": "Oh, oh, ich hab ihn reloadet."}, {"id": 1178, "start": 7947.8, "end": 7953.8, "text": "Warum reload ich auch mit einem vorderen Gegner?"}, {"id": 1179, "start": 7953.8, "end": 7955.8, "text": "Ja, Dynamix, das war klassischer Call of Duty-Tod wieder."}, {"id": 1180, "start": 7955.8, "end": 7960.8, "text": "Wir hatten heute schon ganz viele klassische Call of Duty-Tode."}, {"id": 1181, "start": 7960.8, "end": 7962.8, "text": "Was den Call of Duty auch noch mal gut hinkriegen ist,"}, {"id": 1182, "start": 7962.8, "end": 7964.8, "text": "dass sich die eigene Waffe anfühlt wie Watterbällchen."}, {"id": 1183, "start": 7964.8, "end": 7967.8, "text": "Und die Gegnerwaffen mit Bam-Bom hinten."}, {"id": 1184, "start": 7967.8, "end": 7976.8, "text": "Und um die Ecke sterben. Um die Ecke sterben ist auch ganz wichtig."}, {"id": 1185, "start": 7976.8, "end": 7986.8, "text": "Ja, und außerdem, stimmt, außerdem streamt der Friseur gerade selber."}, {"id": 1186, "start": 7986.8, "end": 7997.8, "text": "Das wäre fast eine gute Granate gewesen."}, {"id": 1187, "start": 7997.8, "end": 8005.8, "text": "Den outplayen wir jetzt, den Typ. Outplay."}, {"id": 1188, "start": 8005.8, "end": 8009.8, "text": "Outplayed."}, {"id": 1189, "start": 8009.8, "end": 8025.8, "text": "NA-Nade, aber die wäre geil gewesen, wenn sie geklappt hätte."}, {"id": 1190, "start": 8025.8, "end": 8028.8, "text": "Übrigens sagen wir von den ganzen, voll aus."}, {"id": 1191, "start": 8028.8, "end": 8031.8, "text": "Das Ding macht keinen Damage?"}, {"id": 1192, "start": 8031.8, "end": 8033.8, "text": "Was ist das?"}, {"id": 1193, "start": 8033.8, "end": 8038.8, "text": "50, 15k Spieler am PC, lol, ja."}, {"id": 1194, "start": 8038.8, "end": 8042.8, "text": "Der Farmer, der geht voll auf in Black Desert Online."}, {"id": 1195, "start": 8042.8, "end": 8045.8, "text": "Ja, aber voll."}, {"id": 1196, "start": 8045.8, "end": 8050.8, "text": "Ich hab's probiert, ich hab's probiert anzufassen."}, {"id": 1197, "start": 8050.8, "end": 8052.8, "text": "Was mach ich da eigentlich?"}, {"id": 1198, "start": 8052.8, "end": 8060.8, "text": "Ich hab's probiert, aber irgendwie, irgendwie packt mich BDO nicht."}, {"id": 1199, "start": 8060.8, "end": 8065.8, "text": "Donation, danke für die Donation. Ich guck gleich rein."}, {"id": 1200, "start": 8065.8, "end": 8076.8, "text": "Nachdem wir jetzt vielleicht mal von 5, 6 runterkommen."}, {"id": 1201, "start": 8076.8, "end": 8078.8, "text": "Hab ich nicht gesehen, kann ich jetzt auch Donat..."}, {"id": 1202, "start": 8078.8, "end": 8079.8, "text": "Oh meine Fresse, ey, was mach ich?"}, {"id": 1203, "start": 8079.8, "end": 8081.8, "text": "Ich bin heute einfach nur komplett..."}, {"id": 1204, "start": 8081.8, "end": 8086.8, "text": "Gehirn-AFK, ey."}, {"id": 1205, "start": 8086.8, "end": 8089.8, "text": "Sehe meine Donations nicht mehr."}, {"id": 1206, "start": 8089.8, "end": 8092.8, "text": "Warum seh ich meine..."}, {"id": 1207, "start": 8092.8, "end": 8097.8, "text": "Warum seh ich meine Donations nicht mehr? Manchmal ist Twitch komisch."}, {"id": 1208, "start": 8097.8, "end": 8114.8, "text": "Ich guck gleich."}, {"id": 1209, "start": 8114.8, "end": 8121.8, "text": "Achtung, Schneiber."}, {"id": 1210, "start": 8121.8, "end": 8127.8, "text": "Ja, ja, ich get it to cover, ich bin in cover."}, {"id": 1211, "start": 8127.8, "end": 8132.8, "text": "Ich camp hier jetzt einfach."}, {"id": 1212, "start": 8132.8, "end": 8150.8, "text": "Easy."}, {"id": 1213, "start": 8150.8, "end": 8154.8, "text": "Ich dachte, die ist meine Waffe."}, {"id": 1214, "start": 8154.8, "end": 8160.8, "text": "Kommt rein."}, {"id": 1215, "start": 8160.8, "end": 8172.8, "text": "Kommt noch einer, kommt noch einer."}, {"id": 1216, "start": 8172.8, "end": 8179.8, "text": "Achtung, Achtung, den bombe ich jetzt raus von der anderen Seite."}, {"id": 1217, "start": 8179.8, "end": 8181.8, "text": "Nein, er hat mich, er hat mich gekillt."}, {"id": 1218, "start": 8181.8, "end": 8199.8, "text": "Siehste, kaum mal ein bisschen konzentriert, schon die Gegner gereckt."}, {"id": 1219, "start": 8199.8, "end": 8213.8, "text": "Nicht so viel schwätzen, mehr konzentrieren."}, {"id": 1220, "start": 8213.8, "end": 8215.8, "text": "War das last stand oder was war das?"}, {"id": 1221, "start": 8215.8, "end": 8220.8, "text": "Der lag so komisch auf der Erde."}, {"id": 1222, "start": 8220.8, "end": 8222.8, "text": "Von wo kommt was, von hinten?"}, {"id": 1223, "start": 8222.8, "end": 8226.8, "text": "Von hinten, von vorne?"}, {"id": 1224, "start": 8226.8, "end": 8228.8, "text": "Ich weiß es nicht genau, ich muss jetzt mal ein bisschen aufpassen."}, {"id": 1225, "start": 8228.8, "end": 8230.8, "text": "Von drüben?"}, {"id": 1226, "start": 8230.8, "end": 8231.8, "text": "Von hinten?"}, {"id": 1227, "start": 8231.8, "end": 8233.8, "text": "Da sind überall um mich herum Leute."}, {"id": 1228, "start": 8233.8, "end": 8241.8, "text": "Ich check nicht von welcher Seite was kommt."}, {"id": 1229, "start": 8241.8, "end": 8249.8, "text": "Links?"}, {"id": 1230, "start": 8249.8, "end": 8255.8, "text": "Ich wollte nackt, ich wollte mehlen."}, {"id": 1231, "start": 8255.8, "end": 8259.8, "text": "Aber was gut ist, man hat nicht mehr diesen Sprung beim Nahkampf."}, {"id": 1232, "start": 8259.8, "end": 8261.8, "text": "Das ist sehr gut."}, {"id": 1233, "start": 8261.8, "end": 8269.8, "text": "So, Donation, mein Dashboard."}, {"id": 1234, "start": 8269.8, "end": 8276.8, "text": "Nochmal vom Sebaro mit F."}, {"id": 1235, "start": 8276.8, "end": 8283.8, "text": "Für die Aufrechtung der Asiatischen Feinkostenlehnen in Frankfurt null."}, {"id": 1236, "start": 8283.8, "end": 8284.8, "text": "Danke."}, {"id": 1237, "start": 8284.8, "end": 8289.8, "text": "Ja wenn es danach geht, habe ich ja schon das halbe Bahnhofsviertel gerettet quasi."}, {"id": 1238, "start": 8289.8, "end": 8307.8, "text": "Wie oft ich da schon Asia all you can eat futtern war, das kannst du nicht mehr zählen."}, {"id": 1239, "start": 8307.8, "end": 8318.8, "text": "Das war das hässliche Ding, was den kompletten Bildschirm voll gemacht hat."}, {"id": 1240, "start": 8318.8, "end": 8324.8, "text": "So kann man dem Ding jetzt was ordentliches ausrüsten."}, {"id": 1241, "start": 8324.8, "end": 8335.8, "text": "Ich fand ehrlich gesagt die Landside gar nicht so schlecht."}, {"id": 1242, "start": 8335.8, "end": 8342.8, "text": "Steady Amp, Steady Amp brauche ich dann wenn es so weit ist."}, {"id": 1243, "start": 8342.8, "end": 8347.8, "text": "Habe ich neues?"}, {"id": 1244, "start": 8347.8, "end": 8350.8, "text": "Kein neues Park."}, {"id": 1245, "start": 8350.8, "end": 8353.8, "text": "Hallo Kienic20."}, {"id": 1246, "start": 8353.8, "end": 8362.8, "text": "Der Eax schaut zu."}, {"id": 1247, "start": 8362.8, "end": 8365.8, "text": "Eax wie sieht es aus, hast du das Game?"}, {"id": 1248, "start": 8365.8, "end": 8375.8, "text": "Wollen wir morgen oder so mal bisschen War spielen?"}, {"id": 1249, "start": 8375.8, "end": 8384.8, "text": "Weil das glaube ich kann man alleine nicht gescheit spielen."}, {"id": 1250, "start": 8384.8, "end": 8390.8, "text": "So, was auch immer wichtig war in Call of Duty, so langsam aber sicher komme ich da wieder rein."}, {"id": 1251, "start": 8390.8, "end": 8394.8, "text": "Man musste sich einfach eine gute Eröffnung für das Team Deathmatch auf jeder Map merken."}, {"id": 1252, "start": 8394.8, "end": 8398.8, "text": "Also quasi so, wo geht die erste Granate hin, wo ist ein guter Default Weg."}, {"id": 1253, "start": 8398.8, "end": 8401.8, "text": "Auf der Map tendiere ich entweder rechts oder gleich ins Haus."}, {"id": 1254, "start": 8401.8, "end": 8404.8, "text": "Stopp ins Haus kommt mir sinnvoller vor."}, {"id": 1255, "start": 8404.8, "end": 8410.8, "text": "Ich muss bloß gucken zu welcher Zeitpunkt wer ankommt auf der Map von welcher Seite."}, {"id": 1256, "start": 8410.8, "end": 8414.8, "text": "Von hinten, genau jetzt gehen wir nämlich direkt durch ins Haus von hinten."}, {"id": 1257, "start": 8414.8, "end": 8421.8, "text": "Zack direkt, falls da noch einer hoch will."}, {"id": 1258, "start": 8421.8, "end": 8432.8, "text": "Jetzt gehen wir in die Mitte falls einer die Treppe hoch will."}, {"id": 1259, "start": 8432.8, "end": 8444.8, "text": "Gucken von wo was kommt, von hinten."}, {"id": 1260, "start": 8444.8, "end": 8454.8, "text": "So jetzt kommt wahrscheinlich gleich was von links."}, {"id": 1261, "start": 8454.8, "end": 8463.8, "text": "Rechts, rechts, ich hör was von links, sind meine, da war was."}, {"id": 1262, "start": 8463.8, "end": 8468.8, "text": "Wir nehmen mal was mit Range kurz, dass wir besser aus dem Fenster ballern können."}, {"id": 1263, "start": 8468.8, "end": 8477.8, "text": "Ist nix da, da kommt bestimmt gleich Wasser, komm, komm her."}, {"id": 1264, "start": 8477.8, "end": 8485.8, "text": "Erwischt, hinten, hinten, hinten kommt er."}, {"id": 1265, "start": 8485.8, "end": 8490.8, "text": "Sehst du, kaum mal ordentlich gespielt, schon gibt es auch Smog."}, {"id": 1266, "start": 8490.8, "end": 8493.8, "text": "Ich sehe keine Gegner, gleich Rakete rein."}, {"id": 1267, "start": 8493.8, "end": 8501.8, "text": "Links, rechts, rechts, rechts, rechts, rechts."}, {"id": 1268, "start": 8501.8, "end": 8516.8, "text": "Den holen wir, den holen wir, der weiß nicht, dass wir da sind."}, {"id": 1269, "start": 8516.8, "end": 8518.8, "text": "Erwischt."}, {"id": 1270, "start": 8518.8, "end": 8531.8, "text": "Na 9-0 jetzt muss er mal Pogchamp hier in Chat, 9-0 jetzt geht es ab."}, {"id": 1271, "start": 8531.8, "end": 8534.8, "text": "Ich muss mal weg, bisschen aus, bisschen Sicherheit."}, {"id": 1272, "start": 8534.8, "end": 8543.8, "text": "Bisschen in Sicherheit."}, {"id": 1273, "start": 8543.8, "end": 8548.8, "text": "So, so, so ist alles gut."}, {"id": 1274, "start": 8548.8, "end": 8551.8, "text": "Weil in die Mitte durch ist wahrscheinlich..."}, {"id": 1275, "start": 8551.8, "end": 8568.8, "text": "Was?"}, {"id": 1276, "start": 8568.8, "end": 8571.8, "text": "Da kommt die Moab, da ist die Moab Leute."}, {"id": 1277, "start": 8571.8, "end": 8576.8, "text": "Da ist die Moab."}, {"id": 1278, "start": 8576.8, "end": 8579.8, "text": "Da ist die Moab, pass auf hier, gleich schlägt sie ein."}, {"id": 1279, "start": 8579.8, "end": 8590.8, "text": "Bäm, die Moab."}, {"id": 1280, "start": 8590.8, "end": 8603.8, "text": "Was? Ich wusste, dass der da hinten ist, aber nicht wo."}, {"id": 1281, "start": 8603.8, "end": 8604.8, "text": "GG Eats."}, {"id": 1282, "start": 8604.8, "end": 8610.8, "text": "VTF, was ist hier los? Spawnst, kriegst..."}, {"id": 1283, "start": 8610.8, "end": 8615.8, "text": "Hier ist einer."}, {"id": 1284, "start": 8615.8, "end": 8623.8, "text": "Warte, Bällchenwaffe."}, {"id": 1285, "start": 8623.8, "end": 8633.8, "text": "Oh, da oben am Fenster, da kann ich nicht contesten in der Mitte."}, {"id": 1286, "start": 8633.8, "end": 8638.8, "text": "Gehen wir mal gucken, wie wir in das Haus kommen."}, {"id": 1287, "start": 8638.8, "end": 8639.8, "text": "Das einfachste..."}, {"id": 1288, "start": 8639.8, "end": 8641.8, "text": "Fuck, fuck, fuck, bomb wird nicht zu mir."}, {"id": 1289, "start": 8641.8, "end": 8643.8, "text": "Wow, knapp."}, {"id": 1290, "start": 8643.8, "end": 8653.8, "text": "Bässe dürfte eigentlich hier rein sein."}, {"id": 1291, "start": 8653.8, "end": 8659.8, "text": "Mann, das bin doch ich."}, {"id": 1292, "start": 8659.8, "end": 8674.8, "text": "Okay, woran ist der gestorbener Typ?"}, {"id": 1293, "start": 8674.8, "end": 8676.8, "text": "Achtung, Trick 17, Leute."}, {"id": 1294, "start": 8676.8, "end": 8682.8, "text": "Fuck."}, {"id": 1295, "start": 8682.8, "end": 8687.8, "text": "Fuck, na gut, ich war angehitten, was soll ich machen?"}, {"id": 1296, "start": 8687.8, "end": 8694.8, "text": "Die Fallschirmjäger fand ich in der Beta schlecht."}, {"id": 1297, "start": 8694.8, "end": 8708.8, "text": "Die waren viel größer als die Hunde, die konntest du total leicht abknallen."}, {"id": 1298, "start": 8708.8, "end": 8709.8, "text": "Oh Gott, ey."}, {"id": 1299, "start": 8709.8, "end": 8721.8, "text": "Call of Duty Tode, von hinten immer."}, {"id": 1300, "start": 8721.8, "end": 8731.8, "text": "17-4, jetzt läuft's."}, {"id": 1301, "start": 8731.8, "end": 8732.8, "text": "Die..."}, {"id": 1302, "start": 8732.8, "end": 8733.8, "text": "Warte, Bällchen."}, {"id": 1303, "start": 8733.8, "end": 8738.8, "text": "Warte, Bällchen."}, {"id": 1304, "start": 8738.8, "end": 8740.8, "text": "Okay, ich hab ihn bei ihm gar nicht getroffen."}, {"id": 1305, "start": 8740.8, "end": 8741.8, "text": "Verstehen."}, {"id": 1306, "start": 8741.8, "end": 8760.8, "text": "Seems legit."}, {"id": 1307, "start": 8760.8, "end": 8762.8, "text": "Achtung, wir gehen jetzt ans Fenster."}, {"id": 1308, "start": 8762.8, "end": 8766.8, "text": "Schießen da raus, weil da drüben steht einer, garantiert."}, {"id": 1309, "start": 8766.8, "end": 8768.8, "text": "Nett."}, {"id": 1310, "start": 8768.8, "end": 8770.8, "text": "Aber gleich."}, {"id": 1311, "start": 8770.8, "end": 8787.8, "text": "Guck, da ist schon der erste reingegangen."}, {"id": 1312, "start": 8787.8, "end": 8790.8, "text": "Na gut, ich war zu sehr angehitten, ich hätte mich hinlegen müssen und hoffen, dass der"}, {"id": 1313, "start": 8790.8, "end": 8797.8, "text": "nicht trifft."}, {"id": 1314, "start": 8797.8, "end": 8814.8, "text": "Okay, das sollten wir nicht mal verlieren."}, {"id": 1315, "start": 8814.8, "end": 8819.8, "text": "Ey, wie ist Call of Duty so anstrengend?"}, {"id": 1316, "start": 8819.8, "end": 8821.8, "text": "Da ist ein Kopf, siehst du den nicht?"}, {"id": 1317, "start": 8821.8, "end": 8823.8, "text": "Da ist ein Kopf."}, {"id": 1318, "start": 8823.8, "end": 8831.8, "text": "Doch, er hat ihn gesehen."}, {"id": 1319, "start": 8831.8, "end": 8837.8, "text": "Ich kann acht Stunden Battlefield 3 oder 4 oder so spielen, juckt mich nicht."}, {"id": 1320, "start": 8837.8, "end": 8840.8, "text": "Irgendwie zwei Stunden Call of Duty gespielt, voll kaputt."}, {"id": 1321, "start": 8840.8, "end": 8843.8, "text": "Gut, aber ich hab auch da acht Stunden, naja, nicht ganz."}, {"id": 1322, "start": 8843.8, "end": 8844.8, "text": "Sechs Stunden gearbeitet."}, {"id": 1323, "start": 8844.8, "end": 8851.8, "text": "Ja, also die M1 hat einen guten Eindruck gemacht, so nach dem Motto, tappt schnell, two-shotted"}, {"id": 1324, "start": 8851.8, "end": 8852.8, "text": "Gegner."}, {"id": 1325, "start": 8852.8, "end": 8863.8, "text": "Mir fällt auch noch ein, woran das liegen kann, dass ich irgendwie so ein bisschen wackelig,"}, {"id": 1326, "start": 8863.8, "end": 8864.8, "text": "wackelig aime."}, {"id": 1327, "start": 8864.8, "end": 8872.8, "text": "Das liegt daran, dass ich gerade wieder im Stehen an meinem high-end, high-tech, hoch-höhenverstellbaren"}, {"id": 1328, "start": 8872.8, "end": 8873.8, "text": "Schreibtisch spiele."}, {"id": 1329, "start": 8873.8, "end": 8878.8, "text": "Und im Stehen ohne Auflage für den Arm ist halt ziemlich wackelig."}, {"id": 1330, "start": 8878.8, "end": 8886.8, "text": "Kannst du schon sagen, ob das Spiel sich lohnt?"}, {"id": 1331, "start": 8886.8, "end": 8887.8, "text": "Ne."}, {"id": 1332, "start": 8887.8, "end": 8888.8, "text": "Das Spiel an sich macht Spaß."}, {"id": 1333, "start": 8888.8, "end": 8889.8, "text": "Das hat mir auch in der Beta Spaß gemacht."}, {"id": 1334, "start": 8889.8, "end": 8891.8, "text": "Man hat lange Zeit wieder in Call of Duty."}, {"id": 1335, "start": 8891.8, "end": 8894.8, "text": "Ich mein, wahrscheinlich haben sich sogar hier auch schon ein paar gewundert, warum ich"}, {"id": 1336, "start": 8894.8, "end": 8897.8, "text": "denn so oft Call of Duty gestreamt hab in der Beta."}, {"id": 1337, "start": 8897.8, "end": 8900.8, "text": "Ich spiele heute im Stehen oder den, ja."}, {"id": 1338, "start": 8900.8, "end": 8906.8, "text": "Das Problem ist, Call of Duty auf dem PC ist gar nicht mal so sehr die Frage macht Spaß,"}, {"id": 1339, "start": 8906.8, "end": 8914.8, "text": "sondern gibt es noch, wie viele Spieler gibt es noch in einem Monat, sagen wir mal?"}, {"id": 1340, "start": 8914.8, "end": 8916.8, "text": "Und wie sieht es mit Cheatern aus?"}, {"id": 1341, "start": 8916.8, "end": 8918.8, "text": "Damit steht und fällt das."}, {"id": 1342, "start": 8918.8, "end": 8922.8, "text": "Sollte sich das wirklich jetzt rausstellen, dass das Spiel über lange Zeit, der Schatten"}, {"id": 1343, "start": 8922.8, "end": 8927.8, "text": "da, lull, was denn das, dass das wirklich cheaterfrei läuft und gut läuft und alles."}, {"id": 1344, "start": 8927.8, "end": 8931.8, "text": "Also, und wenn sie das Spiel auch noch gut supporten auf dem PC, auch ein paar Patches"}, {"id": 1345, "start": 8931.8, "end": 8939.8, "text": "bringt und sowas, hey, ich glaube, die Chancen stehen nicht schlecht, dass dann sogar die"}, {"id": 1346, "start": 8939.8, "end": 8942.8, "text": "Spielerzahlen theoretisch steigen könnten."}, {"id": 1347, "start": 8942.8, "end": 8946.8, "text": "Call of Duty Tod, typischer Call of Duty Tod wieder."}, {"id": 1348, "start": 8946.8, "end": 8964.8, "text": "Aber die Spielerzahlen werden wahrscheinlich nicht steigen."}, {"id": 1349, "start": 8964.8, "end": 8968.8, "text": "Na, ich spiel nicht immer im Stehen, weil kein jemand gefragt hat."}, {"id": 1350, "start": 8968.8, "end": 8973.8, "text": "Ich spiel nur manchmal."}, {"id": 1351, "start": 8973.8, "end": 8975.8, "text": "Warte, Bällchen!"}, {"id": 1352, "start": 8975.8, "end": 8976.8, "text": "Call of Duty Tod."}, {"id": 1353, "start": 8976.8, "end": 8977.8, "text": "Warte, Bällchen!"}, {"id": 1354, "start": 8977.8, "end": 8978.8, "text": "Gefolgt von Call of Duty Tod."}, {"id": 1355, "start": 8978.8, "end": 8979.8, "text": "So, noch was anderes hier kommt."}, {"id": 1356, "start": 8979.8, "end": 8980.8, "text": "Damn, Shotgun."}, {"id": 1357, "start": 8980.8, "end": 8987.8, "text": "Also, ich spiele es nicht immer im Stehen, doch manchmal."}, {"id": 1358, "start": 8987.8, "end": 8990.8, "text": "Erstens, wenn ich schon so einen krassen Schreibtisch habe, muss ich das ausnutzen."}, {"id": 1359, "start": 8990.8, "end": 9003.8, "text": "Zweitens, ist das für den Rücken angenehmer."}, {"id": 1360, "start": 9003.8, "end": 9006.8, "text": "Dauerfeuerabbrei, das ist Call of Duty."}, {"id": 1361, "start": 9006.8, "end": 9007.8, "text": "Was denn sonst?"}, {"id": 1362, "start": 9007.8, "end": 9009.8, "text": "Haben wir schon einen Kill gemacht."}, {"id": 1363, "start": 9009.8, "end": 9010.8, "text": "Oh!"}, {"id": 1364, "start": 9010.8, "end": 9011.8, "text": "Sehr gut, sehr gut."}, {"id": 1365, "start": 9011.8, "end": 9034.8, "text": "Okay."}, {"id": 1366, "start": 9034.8, "end": 9045.8, "text": "Ich muss mal recken."}, {"id": 1367, "start": 9045.8, "end": 9050.8, "text": "Na gut."}, {"id": 1368, "start": 9050.8, "end": 9054.8, "text": "Da konnte ich jetzt von der Seite nichts dagegen machen."}, {"id": 1369, "start": 9054.8, "end": 9055.8, "text": "Das Teil ist zu OP."}, {"id": 1370, "start": 9055.8, "end": 9057.8, "text": "Also, haben es abgeschwächt."}, {"id": 1371, "start": 9057.8, "end": 9059.8, "text": "Es ist nicht mehr so OP wie in der Beta."}, {"id": 1372, "start": 9059.8, "end": 9062.8, "text": "Ich habe das Gefühl, die Range ist nicht mehr so groß."}, {"id": 1373, "start": 9062.8, "end": 9065.8, "text": "Also, wo das zuverlässig die Leute killt."}, {"id": 1374, "start": 9065.8, "end": 9075.8, "text": "Und ich habe auch das Gefühl, aber das kann sein, dass sie mich das täuscht."}, {"id": 1375, "start": 9075.8, "end": 9087.8, "text": "Dass das Feuer langsamer killt."}, {"id": 1376, "start": 9087.8, "end": 9095.8, "text": "Moment."}, {"id": 1377, "start": 9095.8, "end": 9099.8, "text": "Der Typ war hinter mir."}, {"id": 1378, "start": 9099.8, "end": 9101.8, "text": "Die Schreie, ja."}, {"id": 1379, "start": 9101.8, "end": 9107.8, "text": "Was machen die neue Max-FPS in 8700K?"}, {"id": 1380, "start": 9107.8, "end": 9116.8, "text": "Ich spiele noch auf dem alten Rechner."}, {"id": 1381, "start": 9116.8, "end": 9119.8, "text": "Reckt."}, {"id": 1382, "start": 9119.8, "end": 9128.8, "text": "900 IQ Play."}, {"id": 1383, "start": 9128.8, "end": 9133.8, "text": "900 IQ Play."}, {"id": 1384, "start": 9133.8, "end": 9139.8, "text": "Fast."}, {"id": 1385, "start": 9139.8, "end": 9142.8, "text": "Ejax, hast du es vorher mitgekriegt?"}, {"id": 1386, "start": 9142.8, "end": 9146.8, "text": "Oder vielleicht hast du was schon geschrieben?"}, {"id": 1387, "start": 9146.8, "end": 9170.8, "text": "Hast du morgen Lust, ein paar Runden auf neuen Modus zu spielen?"}, {"id": 1388, "start": 9170.8, "end": 9172.8, "text": "Besser am Start."}, {"id": 1389, "start": 9172.8, "end": 9178.8, "text": "Nice, dann spielen wir morgen."}, {"id": 1390, "start": 9178.8, "end": 9190.8, "text": "Ich glaube, so richtig lange Killstreaks sind mir da ganz schwer."}, {"id": 1391, "start": 9190.8, "end": 9194.8, "text": "Warum habe ich keine Granate?"}, {"id": 1392, "start": 9194.8, "end": 9197.8, "text": "Hab ich keine Granate?"}, {"id": 1393, "start": 9197.8, "end": 9200.8, "text": "Doch, hab ich. Was ist das?"}, {"id": 1394, "start": 9200.8, "end": 9202.8, "text": "Was ist das?"}, {"id": 1395, "start": 9202.8, "end": 9211.8, "text": "Flare oder so?"}, {"id": 1396, "start": 9211.8, "end": 9226.8, "text": "Von hinten kommt was?"}, {"id": 1397, "start": 9226.8, "end": 9240.8, "text": "Call of Duty, tot."}, {"id": 1398, "start": 9240.8, "end": 9245.8, "text": "Das Spiel ist generell, was sowas angeht, aus Serialitätskontroll."}, {"id": 1399, "start": 9245.8, "end": 9257.8, "text": "Die Frauen für die Wehrmacht an der Front."}, {"id": 1400, "start": 9257.8, "end": 9259.8, "text": "Was ist denn das?"}, {"id": 1401, "start": 9259.8, "end": 9262.8, "text": "Das ist der Thompson mit Trommelvisier."}, {"id": 1402, "start": 9262.8, "end": 9268.8, "text": "Das war im World War Richtig geil."}, {"id": 1403, "start": 9268.8, "end": 9275.8, "text": "Du musst in der Ecke campen, Sentries aufstellen und Schilde."}, {"id": 1404, "start": 9275.8, "end": 9278.8, "text": "Du meinst wie der Typ auf dieser, wo ich mal ein Video gemacht habe,"}, {"id": 1405, "start": 9278.8, "end": 9283.8, "text": "auf der Black Ops 2 Schiffs Map."}, {"id": 1406, "start": 9283.8, "end": 9285.8, "text": "Gibt es Sentries als Killstreaks?"}, {"id": 1407, "start": 9285.8, "end": 9289.8, "text": "Killstreaks müssen wir uns mal angucken, genau."}, {"id": 1408, "start": 9289.8, "end": 9293.8, "text": "Das funktioniert nicht."}, {"id": 1409, "start": 9293.8, "end": 9296.8, "text": "Killstreaks müssen wir uns mal angucken."}, {"id": 1410, "start": 9296.8, "end": 9299.8, "text": "Was haben wir denn so? Recon?"}, {"id": 1411, "start": 9299.8, "end": 9302.8, "text": "Artillery? Bomb?"}, {"id": 1412, "start": 9302.8, "end": 9306.8, "text": "Counter-SUAV?"}, {"id": 1413, "start": 9306.8, "end": 9318.8, "text": "Fighter Pilot."}, {"id": 1414, "start": 9318.8, "end": 9323.8, "text": "Was macht der denn?"}, {"id": 1415, "start": 9323.8, "end": 9326.8, "text": "Was macht denn der Fighter Pilot?"}, {"id": 1416, "start": 9326.8, "end": 9345.8, "text": "Und warum muss ich Prestige Tokens dafür verwenden?"}, {"id": 1417, "start": 9345.8, "end": 9347.8, "text": "Nee, dann..."}, {"id": 1418, "start": 9347.8, "end": 9355.8, "text": "Dann lese ich mir erstmal durch, was das Ding überhaupt macht und gucke mir ein paar Videos an."}, {"id": 1419, "start": 9355.8, "end": 9365.8, "text": "Sam Fischer, das ist nicht die Standardklasse."}, {"id": 1420, "start": 9365.8, "end": 9376.8, "text": "Das gibt überhaupt keine Standardklasse, die das hat."}, {"id": 1421, "start": 9376.8, "end": 9379.8, "text": "Die Kampagne muss ich mir auch mal angucken."}, {"id": 1422, "start": 9379.8, "end": 9387.8, "text": "Ich bin mal wirklich gespannt drauf, was sie draus gemacht haben."}, {"id": 1423, "start": 9387.8, "end": 9391.8, "text": "Wir bringen es hart, jetzt wird weggecockt."}, {"id": 1424, "start": 9391.8, "end": 9395.8, "text": "Wie gut ist das Spiel? Kommt es wirklich an den ersten Teil ran?"}, {"id": 1425, "start": 9395.8, "end": 9401.8, "text": "Call of Duty 1? Ja gut, Call of Duty 1 ist das C-End ja."}, {"id": 1426, "start": 9401.8, "end": 9417.8, "text": "Watt? Call of Duty 1 ist sehr in die Arche gekommen, das würde ich jetzt auch nicht unbedingt spielen."}, {"id": 1427, "start": 9417.8, "end": 9422.8, "text": "Ansonsten macht es Spaß, aber es ist halt Call of Duty auf dem PC, das muss einem klar sein."}, {"id": 1428, "start": 9422.8, "end": 9426.8, "text": "Das heißt, man weiß nicht, wie das aussieht in ein paar Tagen, Wochen."}, {"id": 1429, "start": 9426.8, "end": 9432.8, "text": "Wie das aussieht mit Cheater und solchen Sachen."}, {"id": 1430, "start": 9432.8, "end": 9435.8, "text": "Achtung, Yolo, Yolo."}, {"id": 1431, "start": 9435.8, "end": 9444.8, "text": "Oh, Call of Duty Tod, jedes Mal, jedes Mal aus einer anderen Richtung."}, {"id": 1432, "start": 9444.8, "end": 9448.8, "text": "Ja, Kampagne gucke ich mir dann morgen mal an."}, {"id": 1433, "start": 9448.8, "end": 9456.8, "text": "Ich muss auch gleich was futtern."}, {"id": 1434, "start": 9456.8, "end": 9458.8, "text": "In der Beta meinst du doch, wirst du nicht mehr spielen?"}, {"id": 1435, "start": 9458.8, "end": 9468.8, "text": "Tja, es interessiert mich, was ich in der Beta gesagt habe."}, {"id": 1436, "start": 9468.8, "end": 9473.8, "text": "Es interessiert mich, was ich in der Beta gesagt habe."}, {"id": 1437, "start": 9473.8, "end": 9491.8, "text": "Das ist ja auch schließlich meine Kohle, kann ich ausgeben, für was ich will."}, {"id": 1438, "start": 9491.8, "end": 9496.8, "text": "Hier hinten ist schlecht, mit meiner SMG rum zu laufen, das ist einfach zu lange Range."}, {"id": 1439, "start": 9496.8, "end": 9499.8, "text": "Alter!"}, {"id": 1440, "start": 9499.8, "end": 9502.8, "text": "Oh, was ist das? Das sieht über Range ganz gut aus."}, {"id": 1441, "start": 9502.8, "end": 9507.8, "text": "Ich habe keine Ahnung, was das ist, das sieht abgrundtief hässlich aus."}, {"id": 1442, "start": 9507.8, "end": 9512.8, "text": "Was ist das?"}, {"id": 1443, "start": 9512.8, "end": 9522.8, "text": "LMG, hä?"}, {"id": 1444, "start": 9522.8, "end": 9544.8, "text": "Outplayed, Outplayed."}, {"id": 1445, "start": 9544.8, "end": 9553.8, "text": "Was? Was? Ich glaube, ich habe vorbei geschossen, oder? Ich glaube, ich habe schlicht und ergreifend vorbei geschossen."}, {"id": 1446, "start": 9553.8, "end": 9565.8, "text": "Ich glaube, ich habe schlicht und ergreifend vorbei geschossen, aber jetzt vorbei geschossen."}, {"id": 1447, "start": 9565.8, "end": 9575.8, "text": "Oh, was geht hier oben ab? Wo bin ich hier überhaupt?"}, {"id": 1448, "start": 9575.8, "end": 9581.8, "text": "Habt ihr gesehen, ich habe noch einen Nahkampf reingedrückt."}, {"id": 1449, "start": 9581.8, "end": 9606.8, "text": "Panic Knife hätte jetzt gekotzt, da hätte ich nämlich One-Shotted."}, {"id": 1450, "start": 9606.8, "end": 9614.8, "text": "Was?"}, {"id": 1451, "start": 9614.8, "end": 9629.8, "text": "Alter, warum höre ich den nicht? Den hätte ich doch hören müssen."}, {"id": 1452, "start": 9629.8, "end": 9636.8, "text": "Ich habe das schneller klettern mittlerweile."}, {"id": 1453, "start": 9636.8, "end": 9640.8, "text": "Da lasse ich mich nicht drauf ein."}, {"id": 1454, "start": 9640.8, "end": 9654.8, "text": "Der verfolgt mich bestimmt, der ist bestimmt hinterher."}, {"id": 1455, "start": 9654.8, "end": 9672.8, "text": "Was war denn der erste Treffer bitte? Hitmarker."}, {"id": 1456, "start": 9672.8, "end": 9700.8, "text": "Call of Duty Wand. Darf man nicht drüber. Das Knie hoch."}, {"id": 1457, "start": 9700.8, "end": 9725.8, "text": "Der ist hinter mir."}, {"id": 1458, "start": 9725.8, "end": 9747.8, "text": "Dauerfeuer Abenteuer."}, {"id": 1459, "start": 9747.8, "end": 9756.8, "text": "Jetzt geht es ab."}, {"id": 1460, "start": 9756.8, "end": 9767.8, "text": "Na gut, das waren zu viele."}, {"id": 1461, "start": 9767.8, "end": 9778.8, "text": "Die Kopfhörer. So, hallo. Ich rufe den Defeat an."}, {"id": 1462, "start": 9778.8, "end": 9785.8, "text": "Eigentlich muss ich jetzt den Schreibtisch runterfahren."}, {"id": 1463, "start": 9785.8, "end": 9797.8, "text": "Ich glaube ich mache jetzt Schluss, gehe was futtern und dann gucke ich mir Overwatch World Cup an."}, {"id": 1464, "start": 9797.8, "end": 9819.8, "text": "Ich habe doch eben geguckt. In einer Stunde fängt das an."}, {"id": 1465, "start": 9819.8, "end": 9827.8, "text": "competitive Overwatch gucke ich nach wie vorher gerne. Und ich reg mich beim zugucken auf, das ist schlimm."}, {"id": 1466, "start": 9827.8, "end": 9845.8, "text": "Ich reg mich beim zugucken so sehr auf über das Game, so wenn ich mir 2CP angucken muss zum Beispiel, da kriege ich Anfälle."}, {"id": 1467, "start": 9845.8, "end": 9852.8, "text": "2CP kriege ich Anfälle. Vor allem wenn es so diese typischen Fights gibt, die nur durch irgendeine Kacke gewonnen werden."}, {"id": 1468, "start": 9852.8, "end": 9868.8, "text": "Weil Overtime oder weil das erste Team versucht hat den ersten Punkt gut zu defenden und dafür Ultimates eingesetzt hat."}, {"id": 1469, "start": 9868.8, "end": 9877.8, "text": "Das ist ja ein 2CP so bescheuert gemacht. Du versuchst den ersten Punkt gut zu verteidigen und wirst dafür bestraft auf den zweiten Punkt."}, {"id": 1470, "start": 9877.8, "end": 9885.8, "text": "Das ist total, ich weiß nicht was Blizzard da designt hat. Und vor allem scheint Blizzard auch wirklich sehr stur zu sein was das angeht."}, {"id": 1471, "start": 9885.8, "end": 9894.8, "text": "Und er kennt einfach nicht an, dass 2CP ein scheiß Modus ist. Max hast du schon die Placements gemacht? Nein."}, {"id": 1472, "start": 9894.8, "end": 9901.8, "text": "Werde ich auch nicht. Bis ich das Rankingsystem von Overwatch nicht ändert in irgendwas Spielbares."}, {"id": 1473, "start": 9901.8, "end": 9908.8, "text": "Ich reg mich da nur noch drüber auf, zumal das Game einfach so viel Potenzial hat und sie verkacken es."}, {"id": 1474, "start": 9908.8, "end": 9914.8, "text": "Es kann doch nicht sein, dass Mercy, Wontrick, Skrills im Grandmaster-Rum schwirren zuhauf."}, {"id": 1475, "start": 9914.8, "end": 9921.8, "text": "So mein Problem ist nicht, dass das Skrills sind, sondern dass das Mercy, Wontrick Leute sind."}, {"id": 1476, "start": 9921.8, "end": 9937.8, "text": "Overwatch ist ein Game, das skilltechnisch nicht rein über den einzelnen Held, sondern die Overwatch-Helden haben jetzt alle für sich gesehen."}, {"id": 1477, "start": 9937.8, "end": 9945.8, "text": "Genji Tracer gibt es schon ein paar, die eine gewisse Tiefe haben, aber die meisten Helden haben nicht die Tiefe und nicht das hohe Skillcap, was man jetzt sagen könnte."}, {"id": 1478, "start": 9945.8, "end": 9952.8, "text": "Wie das jetzt in CS oder so ist, da macht es einfach die Menge aus der Helden, die man gut spielen kann."}, {"id": 1479, "start": 9952.8, "end": 9961.8, "text": "Kann man irgendwie, keine Ahnung, Saria, Genji, Tracer gut spielen? Das ist nicht einfach, die alle 3 richtig gut spielen zu können."}, {"id": 1480, "start": 9961.8, "end": 9975.8, "text": "Komm raus!"}, {"id": 1481, "start": 9975.8, "end": 9991.8, "text": "Von hinten, von hinten, den holen wir, den holen wir von hinten, der wird geschreckt."}, {"id": 1482, "start": 9991.8, "end": 10010.8, "text": "Du bist nicht mehr da. Jetzt kommt von rechts was? Was? Okay, du denkst, dass ich weg bin, du denkst das. Ich bin aber nicht weg."}, {"id": 1483, "start": 10010.8, "end": 10022.8, "text": "Okay, Wartebällchen, wir bräuchten echt so ein Hashtag-Wartebällchen, Wartebällchen und noch angehitted."}, {"id": 1484, "start": 10022.8, "end": 10032.8, "text": "Wo hatte auch viel Potenzial, sagt der Sampfischer. Ja, aber Wo hat sein Potenzial schon genutzt, zumindest die ersten 3 Expansions."}, {"id": 1485, "start": 10032.8, "end": 10055.8, "text": "Irgendwann ist aus allem die Luft raus. Da kann man auch noch so viele Addons bringen. Irgendwann ist die Luft raus."}, {"id": 1486, "start": 10055.8, "end": 10067.8, "text": "Was soll ich denn hier noch machen? Was ist das hier wieder? Der war übelst zerstört."}, {"id": 1487, "start": 10067.8, "end": 10093.8, "text": "Ich habe schon alles gemacht, was ich machen konnte gegen die 2. Oh, Schneiber. Jetzt werden sie geschnippt."}, {"id": 1488, "start": 10093.8, "end": 10117.8, "text": "Ich werde es jetzt so krass schneibern. Ich weiß gar nicht, wo sie sind."}, {"id": 1489, "start": 10117.8, "end": 10139.8, "text": "Suche Gegner. Wo sind denn Gegner?"}, {"id": 1490, "start": 10139.8, "end": 10151.8, "text": "Warte, von hinten. Alter, ich will Rage quitten. Wie kann ich Rage quitten?"}, {"id": 1491, "start": 10151.8, "end": 10169.8, "text": "Wtf 104GB, wofür denn bitte? Das frage ich mich auch. Warum 104GB? Verstehe ich nicht. Ich muss jetzt Rage quitten."}, {"id": 1492, "start": 10169.8, "end": 10181.8, "text": "Ist die Maus besser als in der Beta? Also am Anfang war die Maus viel schlechter. Aber nachdem ich jetzt Grafik Settings alles ausgestellt habe, was es so gibt."}, {"id": 1493, "start": 10181.8, "end": 10207.8, "text": "Und das mit der 1080Ci lief es gut. Das was wir eben gespielt haben war die Map, auf der wir angefangen haben. Und da hatte ich 37 FPS. Eben hatte ich 140 oder so."}, {"id": 1494, "start": 10207.8, "end": 10222.8, "text": "So. Ja, Low-Quality. Nur dann läuft es richtig. So, morgen geht es weiter. Dann bin ich ausgeschlafen und ich hoffe, dann läuft es auch wieder ein bisschen besser."}, {"id": 1495, "start": 10222.8, "end": 10237.8, "text": "Weil auf den Sack zu kriegen macht keinen Spaß. Kennt jeder wahrscheinlich. Wie lange war ich jetzt eigentlich on? 3 Stunden. Alles klar Leute."}, {"id": 1496, "start": 10237.8, "end": 10252.8, "text": "Ich gehe jetzt was essen. Dann gucke ich Overwatch World Cup. Und wir sehen uns morgen. Machts gut. Bis zum nächsten Mal. Tschüss."}, {"id": 1497, "start": 10297.8, "end": 10302.8, "text": "Das war's für heute. Bis zum nächsten Mal. Tschüss."}, {"id": 1498, "start": 10327.8, "end": 10332.8, "text": "Das war's für heute. Tschüss."}, {"id": 1499, "start": 10357.8, "end": 10373.8, "text": "Das war's für heute. Tschüss."}]}