{"text": "Game ändernIch muss noch Game ändernWhat the fuckhitscreativeon stream title ändernSo Leute, ich werde jetzt mit dem Fabian noch ein bisschen Bobsgrinden in BDO und daswar es dann.So, ich muss erst mal zum Wault mein Zeug abgeben.Wo ist der Wault, da oben irgendwo?Wo ist der Wault, wo ist der Wault, Storage, wo ist der Storage, ach der ist da unten,da ist der Storage Dude, äh, hier ist der Storage Dude, nee, wo ist der Storage Typ,äh, what the fuck, moin Leute, Lautstärke ok so, ich muss meinem Bot mal sagen er sollnicht mal spammen, he, wo ist, angeblich ist hier ein Storage Typ, aber wo ist der StorageTyp?Tschüss Turme, nee ich komm jetzt, ich komm jetzt zu euch gleich, ich bin da, ich findbloß ein Storage Keeper, ich bin zu Dorf, ja ich hab das oben über die Hilfe, aberirgendwie da wo der hinläuft steht nix.Keine Ahnung wo der Storage Dude ist, ich komm jetzt erst mal zu euch, ja Leute ich redgerade mit dem, also mit dem Frazier, ihr hört ihn aber nicht, weil das ist auf dem anderenSeite, die wollen ihre Ruhe, ähm, jaja das ist Absicht das man nix hat, eigentlich wollenwir hier nur n bisschen Sillos mobs grinden, sonst nix, wo ist denn der Karsten, ja da obenist er, da unten ist er, ich hab nix großartiges mehr halt vorne, ich level jetzt, fuck, ichlevel jetzt n bisschen im Kreis und das wars, dann geh ich pennen, ich bin nämlich so übertriebenvoll gefressen Leute, das könnt ihr euch dann vorstellen, ich kann den Char überhauptnicht mehr, ich hab jetzt bestimmt nen Monat nicht mehr richtig gespielt, aber Wizard mussman eh nix können, Wizard reicht, wenn man einfach 3 verschiedene Knöpfe drückt, wennes gut ist, ja das ist das neue Gebiet, das gibt es seit dieser Woche, so Waldstells,ich kenne meine Spells nicht mal mehr, ich weiß nicht mehr wie meine Spells sind gescheiter,ich hab ja noch so ein AE, ich hab ja noch so ein AE, Feuer AE auf dem Boden, der übelstDamage macht und dann hab ich noch, ich hab noch Rechtsklick, der übelst Damage machtund Linksklick, der übelst Damage macht und Knockdown, der übelst Damage macht, eigentlichmacht alles übelst Damage von Wizard, aber irgendwie hab ich sonst mehr Spells verwendet,das hab ich schon vergessen, ah ich hab erstmal hier mal nen Marderkugel vergessen, ich kann,das ist unmöglich ey, man kann Wizard eigentlich nicht nicht spielen können, das geht nicht,das ist so der typische 3 Buttonschar, ich hab meine Spells vergessen, seitdem ich damal gespielt hab, schade das Pubke nicht so hübsch ist, ja das wär cool oder, wenndie Map da so aussehen würde hier wie BDO, Wizard kann jeder spielen, warte mal was mussich denn hier nehmen noch, das ist doch überhaupt nicht das richtige Food oder, was ich hierhab, was ist denn der Karsten da, au, warum machen das so viel Damage, was war noch malHeal, das war Heal, komm mal hier was der für Damage macht, ich hab irgendwie auchnoch so nen Damage Absorb gehabt und ich weiß nicht mehr wo, schlimm, ah hier brauchstman einen Absorb, stimmt Absorb hier, wo ist er, da Absorb, ich erinnere mich wieder andie Spells zwar langsamer, ja optisch ärgst ist das Spiel wirklich sehr hübsch, ey dassieht wirklich gut aus, kann man nix sagen, ist das Boss oder was, ähm, wo rennt der Karstenschon wieder hin, Karsten rennt immer so verplant rum, da weiß ich überhaupt nicht wie der herlaufensolls da, so was muss ich denn jetzt für'n Food fressen, Uptime, Uptime, Uptime, Uptime,Uptime ist halt 5 Minuten oder so nicht lang, ich level jetzt noch ein paar Runden, danngeh ich pennen, irgendwie stimmt auch meine Food-Leiste nicht, ich muss schon mal kleinermannsein, frag mich wo der Fabian rumrennt, da müsste er halt auch irgendwo sein, ich glaubder PvP't irgendwo wieder vor sich hin, boah bin ich voll gefressen, ey mir tut aber auchweh, so Buff-Food, was brauche ich denn jetzt hier, das Inf ist voll mit irgendeinem Scheiß,welches Buff-Food davon habe ich denn jetzt gebraucht, das hier, Valencia Meal, hab ichValencia Meal gebraucht, was die richtige Buff-Food-Rotation, ich hab das zu lange nicht mehrgespielt, ich glaub Valencia-Food, Valencia-Food-Princivation, also ich muss auf jeden Fall jetzt nochmal,das bringt Casting-Speed, Attack-Speed, was, Attack-Speed, guter muss ich das da fressen,ja, nice, jetzt haben wir jetzt schon mal ein paar ordentliche Buffs, Casting-Speed plus10% läuft aus und das ist dann doch Valencia Meal, wobei das passt, das ist XP-Trank, Rotationist dann XP-Trank, Silandia Meal, Media Meal, ja genau, das passt, das ist ordentliche Pet-Beschwören,langsam aber sicher checke ich auch wieder halbwegs, was ich hier mache, ja, Hans-Karl,du kannst das oben rechts in deinem Profil ausstellen, kannst du jetzt, kannst du einenHaken wegmachen von Beta, dann startet Twitch nicht mehr in der Beta, übrigens hört manüberhaupt was vom Sound, hört ihr irgendwas vom Game-Sound, das ist ganz schön leise,ich höre nämlich selbst kaum was, jetzt müsste es Game-Sound geben, echt, der Hakenkommt immer wieder, das Problem habe ich nicht, hast du Cookies, löschst du irgendwie Cookies,kann das sein?Es gibt ja Leute, die haben so Addons installiert, die die Cookies löschen und sowas, dann kannsich die Seite natürlich nicht merken, wenn der Twitch-TV tut nicht, wenn man auf TwitchBeta ist zur Zeit, das geht nicht, da muss der Beta ausschalten, das ist noch verbugtauf Beta, ich gehe mal davon aus, das wird die nächsten Tage dann funktionieren, hoffeich, weil ich will auch die Beta-Seite von Twitch verwenden, obwohl ich gar nicht weiß,was der großartige Unterschied ist, wisst ihr was der Unterschied ist zwischen normalemTwitch und Beta Twitch, was die da verbessert haben, was ist da jetzt anders?Bisschen Overlay, ok, was Zugang zu neuen Streams, wie darf ich das verstehen?Was meinst du mit Zugang zu neuen Streams?Ach, da ist mir ja vorgeschlagen wird, ok, ich baue mal den richtigen Items an, ich hoffeich habe den voll gefressen, oh, ist das ein Boss, so aus, krass, du kriegst Damage,krass, ok, auf denAlso nein, nicht sonntagsWochenendbuffet, all you can eat essen. Die hatten da irgendwie sechs, sieben verschiedene StationenEinmal so ein Typ, der dir was gegrillt hat, dann ein anderer Typ, der dir, wo das soKonntest, kannst dir selbst Zeug zusammenstellen. Der eine hat so einen Grill geschmissen, auf so eine heiße Platte, der andere hat es in den Wok geschmissen mit Soße dabeiDa hatten sie noch so einen offenen Grill, wo sie Spieße drüber gemacht habenPlus noch irgendwie ein paar andere Stationen, eine Sushi-Station, irgendwie alles mögliche, ey, das sagst du euch. Ich hab, ich habKeine Ahnung, acht Teller oder so gefressen. Also nicht komplett voll, vollgeladene Teller, ne?Aber acht Stück, ich bin doch im ArschHaha, der Gasten hört zu, sag doch. Der Gasten, du hast leider schon verpasst, als ich über dich gelästert hab. Einer ist zu spätJa, er ist auch zu spätAh, ich hab gesagt, der Karsten rennt immer so planlos rum, da kann ich gar nicht hinterher rennenDas ist so zigzag haltIch hoffe, dass sie auf Pflanzerroth in Spanien auch einen guten Asiamann haben, aber ich glaube, dass sie auch auf Pflanzerroth in Spanien auch einen guten Asiamann habenIch hoffe, dass sie auf Pflanzerroth in Spanien auch einen guten Asiamann haben, also ich glaube, Pflanzerroth ist jetzt nicht unbedingt bekannt für gutes Asia-Oil you can eatIch will nicht sagen, dass es das da nicht gibt oder so. Ich glaube, der Fokus liegt auf was anderem.Warum mache ich da eigentlich nicht mal eine E-Dot-Feld rein?Das wäre sonst zu easy mode, als wäre es halt einfach.Der Bot nervt mich.Sebaro, kannst du irgendwie die Spam-Benachrichtigungen zum Battlefield-Server ausschalten?Kannst du das Remote machen? Mit einem Kommando?Oder wenn das nicht geht, mache ich schnell die Bot-Seite auf. Das ist halt schwierig hier mit den Mops.Zumindest nervt der Bot mit dem Battlefield-Server-Spam.Hoffentlich nicht.Vorhin war auf meinem Battlefield-Server noch was los.Also quasi, auch wenn ich nicht mehr drauf war, was mega geil ist.Vielleicht ist der Server ja ab und zu mal bevölkert.Auch wenn ich nicht da bin.Wäre nice, dann könnte man nämlich einfach mal so ein bisschen drauf spielen.Es gibt eh viel zu wenig gute Battlefield 3-Server mit gescheitem Regelset.Oh, was macht er denn hier?Au, krass. Was ist das hier?Da gehe ich nicht rein.Ich will hier kein XP verlieren.Wenn du das hast.Die macht ja richtig Damage, die Möpse.Krasse Möpse.Richtig Damage.Wo ist jetzt mal der Master Chief kommen, unser Owen?Wo ist der Master Chief, wenn man ihn braucht?Cortana habe ich schon, war mir auf dem Rechner.Wo ist der Master Chief?Ja, das ist Call of Duty Beta, was ich hier spiele.Ist neuer.Call of Duty Fantasy Warfare 2.Oh, da ist er down. Der Mob, da geht er, da geht er down.Hab ich hier noch für Kack Loot, alles weg.Ich hab eh kein Geld.1.000 Loot in 2k17.Oh, ich war voll gefressen.Ich könnte mal meinen Damage Buff machen.Oh, das ist nicht mein Damage Buff, das ist mein Damage Buff.Das machen wir übrigens Damage in der Zeit.Guck dir das mal an, das haben sie gereckt.Die Federwölfe.So typische MMO Mob Name.So typische MMO Mob Name, wo ihnen sonst wieder nichts einfällt.Federwölfe.Was ist mit denen los?Warum hat ein Wolf Federn?Oh, ne hier gehts nicht lang.Der hängt da am Stein. Der geile Wizard.Der Mob Sound ist auch wieder mal absolut High Quality.Ah, das ist ein Low Budget Game.Also es ist kein WSP, das übelste Low Budget Game.Und auch ein ziemlich kleines Team.Weil ich weiß nicht, wie es mittlerweile ist.Das merkt man dem Gamer auch an vielen Stellen an.Ja Karsten, stimmt, hast recht.Nur ein paar Webpanel.Ach komm, sonst spammt mein Bot halt alle 10 Minuten.Wir werden es überleben.Wizard Gameplay ist echt spannend, oder?Was sagt ihr? High Octane Gameplay.Karsten, ich heile mal ne Runde.Das Viech lebt hier immer noch.Der Mob Sound.Was war mit den Leuten da von Kakaogames?Wie hieß der Hersteller nochmal? Pearl?Was war mit denen kaputt?Haben die aus einer Sound-Datenbank genau einen Wolf Sound rausgeholt, oder was?Die hat nur einen Wolf Sound, mehr gab es nicht.Kaufe drei Mob Sounds, bekomme einen for free.Was war Alex nochmal? War das das Gothic in der Zukunft?Ich bin gerade ein wenig verwirrt.Es hört sich zwar so an, als wäre ich besoffen oder so, aber das stimmt nicht.Ich bin bloß vollgefressen und so halb im Koma.Ah, das neue Gothic, da bin ich auch mal gespannt drauf.Ich war schon immer eher für Gothic als für Elder Scrolls Games.Die Elder Scrolls Formel ist nicht so meins.Schlimmste war Elder Scrolls Online. Fail Game.Ist immer noch ein deutscher Studio?Ich habe keine Ahnung, wo die mittlerweile sitzen.Könnte aber sein.Hallo D-Striker.Sebaro, du musst Asia All You Can Eat machen.Ja, aber das macht nichts, das Stream Delay ist.Ja, aber das Stream Delay ist nicht lang, nur zehn Sekunden oder so, das geht schon krass.Das ist einfach ein bisschen wie Brain Lag.Kochst du eigentlich auch manchmal selbst oder gehst du eben irgendwie fest?Manchmal koche ich auch was, aber es hält schön krass.Ich habe eigentlich selten Bock, was zu kochen.Meine Mutter kocht mir manchmal was.Das ist dann ganz nice.Aber meistens hole ich mir entweder was zu essen, Lieferdienst.Oder ab und zu mache ich mir immer irgendwie so was.Steh auf, Wissart.Nicht rum stolpern hier.Ab und zu mache ich mir immer irgendwie Spaghetti Polonaise oder so.Dass ich nicht auch ein bisschen was komplizierteres zustande bekomme, das geht schon.Aber ich habe da meistens keinen Bock drauf.Da springt er mit seinem Ranger Grill rum.Der Frazier.Mamutel.Hat er nicht gehört.Ein was für... Moment, wie heißt dieser Mob?Ein was? Ich erkenne sie. Ein Bella-Dona-Elephant.Weiß nicht, was mit den Japanern da kaputt ist bei den Mobnamen.Ein Bella-Dona-Elephant und ein Federwolf.Oh stimmt, Karst, du hast rechts den Koreaner, kein Japaner. Ganz stimmt, habe ich verwechselt. Das ist ja ein koreanisches Game.Guck mal, da sind Gegner, wollen die uns bashen?Jetzt wollen die Typen von uns.Ah, der Fabian schreibt schon, der macht das. Fabian sagt, es pisst euch alle.Oh, ich muss ja über den Chat was drüber planten, fällt mir gerade auf.Fabian flamet die Leute, so muss das sein. Gleich mal Revier markieren hier.Es gibt Flamer, das wird ja geil.Frazier ist der beste Flamer, den es gibt. Ich kenne keiner, der die Leute so gut flamen kann, wie der Fabian.Oder was heißt flamen? Man nennt es ja neuerdings nicht mehr flamen, sondern disrespect.Es ist besser, man flamet heute nicht mehr, heute wird disrespected.Wo ist der Karsten? Soll ich den Mob jetzt alleine bashen?Wegkocken ist immer noch das beste Wort.Oh, jetzt habe ich ja...Karsten, kannst du mal kurz alle Mops bashen gleich, ich muss noch mal Chat Overlay rein machen.Passt, passt, ich habe es schon, ich habe es schon.Bei Flanken muss jemand ins Kopf 120 denken, wieso sagt der das auch?Das passt zum Niko. Das war eine Katze, ja Karsten.Das passt zum Niko, Leute, das passt. Wegflanken, das kann ich mir so richtig vorstellen.Ich kann mir das richtig vorstellen beim Niko.Ja, der Niko, da hat er wieder weggeflankt, das kann ich mir richtig vorstellen.Was sagt der immer? Der hat doch auch so einen Spruch, ich gucke das zu selten.Ich weiß es nicht, was hatte der nochmal für einen Spruch? Keine Ahnung, ich weiß es nicht mehr.Ja, habe ich gesagt, das war das, jetzt ist es wieder eingefallen.Habe ich auch richtig bescheuert, aber eh lustig. Ich mag den Niko.Der Niko ist der einzige Lifestyle Channel, das ist so der originale Lifestyle Channel irgendwie.Auch wenn ich es nicht gucke, aber ich mag den Niko.Ich kann mich noch dran erinnern, wie unglücklich der Niko früher war, weil er gedacht hat,er müsste quasi so seriösere Videos machen, so Call of Duty Zeugs noch damals.Der wollte schon immer so sein abgedrehtes Zeug machen, das wollte er schon damals machen.Er hat einfach nicht gedacht, dass es zieht am Anfang, bis er es dann probiert hat, dann hat es eingeschlagen.Deswegen, ich mag den Niko. Der macht es nicht, der hat es nicht gemacht auf seinem Channel,weil er irgendwie der Ansicht ist, das ist jetzt krasser Lifestyle, das machen alle,das gibt krasse Views, sonst was. Nee, der ist einfach so.Außerdem ist er nicht so ein Spast wie die anderen Lifestyle Typen.Ich check hier übrigens null, was abgeht. Ich charge einfach sinnlos auf irgendwelche Mob Packs vor mir drauf.Baschen, Alter. Moin Fabian, hast du auch den Streamer?Naja, wollte schon, weil du hast gerade in diesem Moment Baschen gesagt, wo ich auch gesagt habe, Baschen.Das Game ruckelt? Warum ruckelt das Game? Fuck.Was ist hier los? Ich habe einen 1008 Chi, da darf bei Definition nichts ruckeln.Das ist unruckelbar.Alles recht krass, das stimmt schon. Aber ich bin gerade nicht mehr so richtig zurechnungsfähig.Das ist unruckelbar mit 1008 Chi und warum ruckelt das?Korea Optimization, null.Ich habe 27 FPS? Das gibt es doch nicht.Das liegt bestimmt noch daran, dass ich vorher Call of Duty gestartet habe auf dem rechten Rechner.Das reicht, wenn es einmal auf dem Rechner gelaufen ist, dann ist Instant RIP.Dann läuft kein Game mehr.Ich meine, ich sollte ja keine 25 FPS haben, 29 FPS. Sollte ja schon ein bisschen mehr haben.Was mache ich denn da?Ja, das stimmt.Das stimmt. Ich meine, das Game sieht schon wirklich hübsch aus, muss man sagen.Danke für die Follows. Ich sehe es gerade leider nicht, wer das gewesen ist.Ich gucke mal, ob ich es gleich in der Vorschau sehe.3k47Einfach nur ein Mopsound für alles.Stimmt, ja. Ich habe es gerade wieder vergessen, dass man nach 24 FPS nichts mehr sieht.Ja, das ist ja richtig.Eigentlich kann mir das gar nicht auffallen, dass es ruckelt gerade. Das geht gar nicht.Das ist nicht möglich.Außerdem habe ich gerade ein Auge zu, dann sehe ich eh nur noch 12.Stimmt so, oder? Ich habe es richtig gerechnet.Ist das die richtige Rechnung?24 FPS durch 2 Augen, das heißt 12.Sogar der Karsten gibt mir recht. Der Karsten kennt sich mit so etwas aus.Er kennt sich besser aus als ihr alle im Chat hier.Der Karsten sagt gerade, das hat auch etwas damit zu tun, wie weit man das Auge zumacht.Das wusste ich noch nicht. Das ist mir jetzt neu gewesen.Ich dachte, solange man das Auge nicht ganz zu hat, zählt es voll. Wenn man es zu hat, zählt es nur noch die halben FPS.Das heißt, wenn ich das Auge nur zur Hälfte zumache, dann habe ich weder 24 noch 12, dann habe ich so 18 oder so etwas.Stimmt das, ja?Ja, ok. Endlich habe ich das mal verstanden.Leute, das ist ein Witz.Ich muss wieder einige nicht checken. Manchen muss man das wirklich auch immer direkt aus Brot schmieren.Karsten gleich Kaboom. Nee, Karsten gleich Masterkrabber. Der einzige wahre Masterkrabber.Der Kaboom heißt Thorsten und nicht Karsten. Aber fast.Ja, Happy Fill. Das kann jetzt jeder behaupten, dass er es verstanden hat.Das kann jetzt jeder behaupten. Aber ich glaube dir, dass wir wollen ja mal nicht so sein.Ich bin so in Fresskoma.Ui, jetzt habe ich 22 FPS. Karsten, wie viele FPS hast du hier? Sag mal, das würde mich interessieren.50? Du hast 50 FPS? Moment. Ist der Tank schon im Arsch oder was?Ok. Karsten ist ein imaginärer Freund, genau.FV. Warum hat der Karsten mehr FPS als ich? Das geht doch gar nicht.Karsten, das dürftest du eigentlich gar nicht ausmachen, großartig. Dafür habe ich eine Grafikkarte, die ist 30 mal besser.Ich wusste gar nicht, dass du streamst, doch. Heute habe ich saumäßig viel gestreamt. Ich habe heute Vormittag gestreamt.Bis 15.30. Und jetzt noch mal. Aber jetzt eigentlich auch nur, weil ich noch nicht pennen kann, weil mein Bauch weh tut von zu viel AC.Ich meine, an OBS kann das ja auch nicht liegen. Das ist ruckel. Ich mache nämlich Grafikkarten-encoding.Das sollte überhaupt keinen Einfluss haben. Bei dir geht nur noch die Beta-Seite.Marvin, kannst du nicht oben rechts auf dein Profil klicken und den Haken wegmachen bei Beta?Das sollte eigentlich gehen. Lass mal die Mammutl-Special hier.Nee, nee, passt schon.Da lädt die Seite nicht komplett. Okay.Ja, ich lasse den Stream über CPU-encoden.OBS sollte bei mir wirklich kaum CPU-Last verursachen.Also keine Ahnung, warum ich hier nur 25 FPS habe gerade.Aber gut, das ist BDO. BDO, das ruckelt halt immer.Ich glaube, das kann gar nicht flüssig laufen, das Game.Highly optimized. 18 FPS.Das kann aber echt nicht sein langsam. Wo sind die Settings hier?Ich meine, viel habe ich schon anerkannt.Ich finde einfach keine günstige Sauerschränke. Ja, aber ich gucke mal bei Musik-Equipment.19 Zoll? Mit welcher Tiefe? Oder nicht 19 Zoll? Was willst du haben?Ich muss jetzt mal einen Task-Manager gucken, was hier so viel... Details.BDO-Verbrauch, CPU-Leistung. Sonst fast nichts.Nur BDO-Verbrauch, CPU-Leistung.Aber ich könnte auch einfach mal diesen komischen Slider hier anmachen,dass Effekte verringert werden bei FPS. Fuck ey, wie viele Mops.Schießnudel, ich habe heute kein MW2 mehr, äh, WF2 mehr gespielt heute Abend, nur heute Morgen.Wo ist denn dieser komische Slider? Wo ist denn der Quality-Slider?60, BÄM. Naja.Ja, wirklich was bringt uns jetzt nicht.Schalten da quasi alle Effekte aus, also wirklich bringt uns das nicht.Schmeiß die Quality mal ein bisschen runter.Quality Low.So, jetzt darf das Game noch laden, das wäre auch nice.Ja, Funky Dough, sag mal was du, was brauchst du denn?Also was willst du für eine... boah das Spiel sieht das scheiße aus ey.Wie tief soll er sein, wie hoch soll er sein?19 Zoll, rund 80 cm tief, um die 20 HE, okay 80 cm, das ist schon volle, fast volle Tiefe.Also genau, da passt alles rein, fast alles.Okay, dass ich das die Qualität runtergestellt habe bringt auch nichts, außer dass das Spiel noch viel beschissener aussieht.Ähm, guck mal bei Audio Schränken, guck mal bei Audio Racks.Ich mein, mein ich ernst jetzt, guck mal bei Audio Racks.Mein Game sagt es ist korrupt und muss neu gestartet werden.Habt ihr gehört?Hallo? Mein Game ist korrupt und muss neu gestartet werden.Ähm, vielleicht hat es deswegen auch so geruckelt.Vielleicht hat es deswegen auch so geruckelt, der Scheiß.Auf gehts.Ja guck mal bei Toman zum Beispiel, bei Toman kannst du mal gucken, was es da für Audio Equipment für Racks gibt.Da gibt es auch welche mit Rollen und sowas.Die sind halt für Audio Equipment gedacht, die sind aber auch 19 Zoll und haben die Löcher an den richtigen Stellen für Schrauben und so.Game ist immer noch korrupt.Fuck, ich glaub ich kann auch nicht mehr spielen.Mein Game sagt jetzt beim Laden, dass es korrupt ist, ich muss ja zuerst mal Scan machen.Das dauert jetzt ewig.Ich hab eine SSD und das backt einfach rum, das ist BDO.Ich glaub nicht, dass meine SSD kaputt geht.So, okay, LHFBDO.Ja, Eax, bei mir kackt alles ab.Ich weiß auch nicht, was da los ist.Aber wenn meine SSD wirklich Defekte hätte, dann hätte ich andere Probleme.Außerdem kackt ja sonst nichts ab.BDO hat das schon öfters mal gehabt.Und, Gott, ist einfach kaputt.Ich glaub ich geh jetzt pennen gleich.Was ist das?Ich hab schon mal nach Epic Music gesucht auf YouTube, das klang nicht so epic.Nee, ich lass die Überprüfung jetzt laufen und dann ist gut.Das ist super entspannend, die Halo-Menü-Musik.Ich bin kein Halo-Fanboy, aber ich spiel das kaum, aber ich find die Menü-Musik ist so entspannend.Ja, fucking Clown, das geht weiter mit dem nächsten Windows-Update.Machen wir das Programm weiter.Ich hab mir nämlich überlegt, wir machen das als Windows-App.Als Universal-Windows-App.Und mit dem neuen Windows-Update wird das viel einfacher und besser.Deswegen warten wir da drauf, das kommt ja schon im Oktober.Also kommt ja in 14 Tagen.Du findest es auch bei Audio-Racks nicht.Moment, ich guck jetzt mal.Ich guck jetzt mal, was bei Tormann bei Racks.Das gucken wir jetzt mal zusammen.Wir suchen jetzt mal für den Funky-Dow ein billiges Rack raus, wo er seinen Server reinstellen kann.Und wir gucken absichtlich nicht nach Server-Racks, sondern nach Studio-Audio-Racks, weil das billiger ist.Das machen wir jetzt, easy.Die Halo-Musik ist so geil.So, ich zoome mal ein bisschen ran, weil die Seite wieder durch die Hälfte ist.So, gucken wir doch mal hier.Wo steht das denn hier, Rack?Divinity 2, wenn ich dazu komme.Wo haben die denn die Racks nochmal stehen?Wo stehen denn die Racks nochmal?Ja, Karsten, wir spielen das zusammen.Das ist ein geiles Game.Guck mal hier, was ist denn das?Tormann E19-Zoll-Racks.Da sieht man doch hier Zeug.Guck mal hier mal, 20er E19-Zoll-Racks.Okay, die sind alle ein bisschen kurz, aber die sind hinten offen.Wenn es dir nichts ausmacht, dass deine Geräte ein bisschen überstehen.Wobei ein 80cm Server würde ich jetzt nicht unbedingt ein 50cm tiefes Rack stecken.Vielleicht ein bisschen unbalanced dann am Ende.Die Racks gehen aber wirklich alle nicht so tief.Na gut, Audio Racks haben halt selten Bedarf auf 80cm Tiefe.Guck mal, in dem Shop habe ich meinen Rack gekauft.Wie hieß das denn?Rack Magic.Da habe ich meinen Rack bestellt, weil das die einzigen waren.Die kleine mit kurzer Einbautiefe hatten.Aber vielleicht haben die ja auch größere.Guck, die haben 44mm Tiefe.Ja, das ist doch was für dich hier, oder?Das ist doch was für dich hier, Funky Dough.Sowas hier in der Richtung.Hier, 12mm und 80cm Tiefe.Höhe 21 He.Farbe Schwarz.Da musst du noch einen Deckel dazu kaufen.Und hier neben so eine Verbindung, sonst ist es zu wackelig.Und dann ist das doch ganz schick.Wenn du jetzt natürlich einen Schrank haben willst, dann sieht es wieder anders aus.Schränke musst du mal gucken, da fällt mir so aus dem Steg nichts ein.Sowas macht ein BDO so.BDO überprüft das Game.Oh, oh, oh, oh, oh.Oh, oh, oh.Was meinst du, Karsten?Das ist eine Schale ohne.Alter, BDO wird mal fertig.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.Oh, oh, oh.nuraber es hört sich halt auch einfach vieles dieserdieser dieser Soundtrackne das heißt es sind kein Soundtrack da gibt es eine eigene Musikrichtung diesediese Trailer Musik dahört sich vieles relativ ähnlich analso oftmals denkt man hey das kenn ich und dabei kennt man das gar nichtdas kenn ich nämlich gar nichthat sich so eingegangen wie was anderesdann noch den obligatorischen FakeLatein Chordeswegen kann man sich auch an dieser Ultra-Epic Musik schnell satt hörenweil es hört sich vielesverdammt ähnlich anso man nehme einfach30 Milliarden Streichinstrumentedann tippt er ab und zu mal auf die Drommelhautund ein Fake Latein Chordoch das kenn ichdas ist nicht Heart of Courage, das ist irgendwas Couragedas ist Heart of Courageaber hört sich ähnlich an2 Steps from Helldas hört sich alles so annicht das Schlechteste, das hört sich einfach alles so ankann jetzt mal dieses Scheiß Overlay hier weggehenhallo Overlay, verpiss dich malich hab Half-Life durchgespielt, mittlerweile Evo-Lehrenich warte jetzt noch, dass die Xen-Levels rauskommen, gibt's da was neues?ja, gibt's was Neues zu Xen-Levels?was weiß das hier Mann?Evo-Klingelteile da vorne, ah ne, das ist ein Discordwir müssen jetzt noch mal kurz was anderes anmachenok, ja Karsten, das passt, dann geh ich auch, ich geh dann auch pennenwenn duwenn du Karsten, wenn du Karsten auf Kamos dannja, Sentinel auf Kod habe ich schonok, ja, das passt, dann geh ich auch, ich geh dann auchok, ja, Sentinel auf Kamos dannok, ja, Sentinel auf Kamos dannDas war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.So geht's los!Das war's für heute!Das war's für heute!Das war's für heute!Das war's für heute!Das war's für heute!Das war's für heute!Das war's für heute!Das war's für heute!Das war's für heute!Das war's für heute!Das war's für heute!Das war's für heute!Das war's für heute!Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heuteDas war's für heuteDas war's für heute.Das war's für heute.Das war's für heute, das war's für heute!Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heuteDas war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Das war's für heute.Schau, ich hab gar keine Starch.Oah, schon fertig.Aha, para ist Geld, okay.Wobei, ein Haftbefehl ist jetzt nicht para.Das ist dann wenn schon para oder so, para.So, was könnte ich jetzt hier nochmal für eine Musik schön zum Ausklang spielen?Was könnte man?Oh!Was zeigt mir denn hier gerade?Oh nee, jetzt hätte ich mal besser nicht angucken sollen.Ich hab gerade gesehen, dass es Gameplay zum neuen Secret of Mana Remake gibt.Und das bestärkt ja schon meine ganzen Befürchtungen zu dem Remake.Was könnte ich denn?Time to say goodbye, das ist eigentlich ein gutes Outro.Ich hab ja schon ein Outro.Hab ich schon ein extrem Outro.So Leute, ich geh jetzt schlafen.Bis zum nächsten Mal, tschüss.Tschüss.Tschüss.Tschüss.", "segments": [{"id": 1, "start": 0.0, "end": 2.0, "text": "Game ändern"}, {"id": 2, "start": 10.8, "end": 12.8, "text": "Ich muss noch Game ändern"}, {"id": 3, "start": 13.68, "end": 15.68, "text": "What the fuck"}, {"id": 4, "start": 15.68, "end": 21.08, "text": "hits"}, {"id": 5, "start": 26.78, "end": 25.68, "text": "creative"}, {"id": 6, "start": 26.58, "end": 28.58, "text": "on stream title ändern"}, {"id": 7, "start": 28.58, "end": 58.54, "text": "So Leute, ich werde jetzt mit dem Fabian noch ein bisschen Bobsgrinden in BDO und das"}, {"id": 8, "start": 58.54, "end": 59.54, "text": "war es dann."}, {"id": 9, "start": 59.54, "end": 69.46, "text": "So, ich muss erst mal zum Wault mein Zeug abgeben."}, {"id": 10, "start": 69.46, "end": 74.02, "text": "Wo ist der Wault, da oben irgendwo?"}, {"id": 11, "start": 74.02, "end": 99.74, "text": "Wo ist der Wault, wo ist der Wault, Storage, wo ist der Storage, ach der ist da unten,"}, {"id": 12, "start": 99.74, "end": 115.26, "text": "da ist der Storage Dude, äh, hier ist der Storage Dude, nee, wo ist der Storage Typ,"}, {"id": 13, "start": 115.26, "end": 134.22, "text": "äh, what the fuck, moin Leute, Lautstärke ok so, ich muss meinem Bot mal sagen er soll"}, {"id": 14, "start": 134.22, "end": 147.74, "text": "nicht mal spammen, he, wo ist, angeblich ist hier ein Storage Typ, aber wo ist der Storage"}, {"id": 15, "start": 147.74, "end": 148.74, "text": "Typ?"}, {"id": 16, "start": 148.74, "end": 159.66, "text": "Tschüss Turme, nee ich komm jetzt, ich komm jetzt zu euch gleich, ich bin da, ich find"}, {"id": 17, "start": 159.66, "end": 168.46, "text": "bloß ein Storage Keeper, ich bin zu Dorf, ja ich hab das oben über die Hilfe, aber"}, {"id": 18, "start": 168.46, "end": 190.62, "text": "irgendwie da wo der hinläuft steht nix."}, {"id": 19, "start": 190.62, "end": 212.22, "text": "Keine Ahnung wo der Storage Dude ist, ich komm jetzt erst mal zu euch, ja Leute ich red"}, {"id": 20, "start": 212.22, "end": 220.9, "text": "gerade mit dem, also mit dem Frazier, ihr hört ihn aber nicht, weil das ist auf dem anderen"}, {"id": 21, "start": 220.9, "end": 246.18, "text": "Seite, die wollen ihre Ruhe, ähm, jaja das ist Absicht das man nix hat, eigentlich wollen"}, {"id": 22, "start": 246.18, "end": 252.7, "text": "wir hier nur n bisschen Sillos mobs grinden, sonst nix, wo ist denn der Karsten, ja da oben"}, {"id": 23, "start": 252.7, "end": 264.82, "text": "ist er, da unten ist er, ich hab nix großartiges mehr halt vorne, ich level jetzt, fuck, ich"}, {"id": 24, "start": 264.82, "end": 280.26, "text": "level jetzt n bisschen im Kreis und das wars, dann geh ich pennen, ich bin nämlich so übertrieben"}, {"id": 25, "start": 280.26, "end": 299.14, "text": "voll gefressen Leute, das könnt ihr euch dann vorstellen, ich kann den Char überhaupt"}, {"id": 26, "start": 299.14, "end": 305.98, "text": "nicht mehr, ich hab jetzt bestimmt nen Monat nicht mehr richtig gespielt, aber Wizard muss"}, {"id": 27, "start": 305.98, "end": 311.7, "text": "man eh nix können, Wizard reicht, wenn man einfach 3 verschiedene Knöpfe drückt, wenn"}, {"id": 28, "start": 311.7, "end": 325.14, "text": "es gut ist, ja das ist das neue Gebiet, das gibt es seit dieser Woche, so Waldstells,"}, {"id": 29, "start": 325.14, "end": 338.5, "text": "ich kenne meine Spells nicht mal mehr, ich weiß nicht mehr wie meine Spells sind gescheiter,"}, {"id": 30, "start": 338.5, "end": 346.26, "text": "ich hab ja noch so ein AE, ich hab ja noch so ein AE, Feuer AE auf dem Boden, der übelst"}, {"id": 31, "start": 346.26, "end": 355.66, "text": "Damage macht und dann hab ich noch, ich hab noch Rechtsklick, der übelst Damage macht"}, {"id": 32, "start": 355.66, "end": 365.86, "text": "und Linksklick, der übelst Damage macht und Knockdown, der übelst Damage macht, eigentlich"}, {"id": 33, "start": 365.86, "end": 382.38, "text": "macht alles übelst Damage von Wizard, aber irgendwie hab ich sonst mehr Spells verwendet,"}, {"id": 34, "start": 382.38, "end": 391.34, "text": "das hab ich schon vergessen, ah ich hab erstmal hier mal nen Marderkugel vergessen, ich kann,"}, {"id": 35, "start": 391.34, "end": 397.14, "text": "das ist unmöglich ey, man kann Wizard eigentlich nicht nicht spielen können, das geht nicht,"}, {"id": 36, "start": 397.14, "end": 401.7, "text": "das ist so der typische 3 Buttonschar, ich hab meine Spells vergessen, seitdem ich da"}, {"id": 37, "start": 401.7, "end": 410.18, "text": "mal gespielt hab, schade das Pubke nicht so hübsch ist, ja das wär cool oder, wenn"}, {"id": 38, "start": 410.18, "end": 422.22, "text": "die Map da so aussehen würde hier wie BDO, Wizard kann jeder spielen, warte mal was muss"}, {"id": 39, "start": 422.22, "end": 428.42, "text": "ich denn hier nehmen noch, das ist doch überhaupt nicht das richtige Food oder, was ich hier"}, {"id": 40, "start": 428.42, "end": 446.86, "text": "hab, was ist denn der Karsten da, au, warum machen das so viel Damage, was war noch mal"}, {"id": 41, "start": 446.86, "end": 454.74, "text": "Heal, das war Heal, komm mal hier was der für Damage macht, ich hab irgendwie auch"}, {"id": 42, "start": 454.74, "end": 474.22, "text": "noch so nen Damage Absorb gehabt und ich weiß nicht mehr wo, schlimm, ah hier brauchst"}, {"id": 43, "start": 474.22, "end": 479.06, "text": "man einen Absorb, stimmt Absorb hier, wo ist er, da Absorb, ich erinnere mich wieder an"}, {"id": 44, "start": 479.06, "end": 501.82, "text": "die Spells zwar langsamer, ja optisch ärgst ist das Spiel wirklich sehr hübsch, ey das"}, {"id": 45, "start": 501.82, "end": 512.18, "text": "sieht wirklich gut aus, kann man nix sagen, ist das Boss oder was, ähm, wo rennt der Karsten"}, {"id": 46, "start": 512.18, "end": 518.06, "text": "schon wieder hin, Karsten rennt immer so verplant rum, da weiß ich überhaupt nicht wie der herlaufen"}, {"id": 47, "start": 518.06, "end": 547.42, "text": "solls da, so was muss ich denn jetzt für'n Food fressen, Uptime, Uptime, Uptime, Uptime,"}, {"id": 48, "start": 547.42, "end": 553.94, "text": "Uptime ist halt 5 Minuten oder so nicht lang, ich level jetzt noch ein paar Runden, dann"}, {"id": 49, "start": 553.94, "end": 578.98, "text": "geh ich pennen, irgendwie stimmt auch meine Food-Leiste nicht, ich muss schon mal kleinermann"}, {"id": 50, "start": 578.98, "end": 587.06, "text": "sein, frag mich wo der Fabian rumrennt, da müsste er halt auch irgendwo sein, ich glaub"}, {"id": 51, "start": 587.06, "end": 594.26, "text": "der PvP't irgendwo wieder vor sich hin, boah bin ich voll gefressen, ey mir tut aber auch"}, {"id": 52, "start": 594.26, "end": 614.02, "text": "weh, so Buff-Food, was brauche ich denn jetzt hier, das Inf ist voll mit irgendeinem Scheiß,"}, {"id": 53, "start": 614.02, "end": 618.46, "text": "welches Buff-Food davon habe ich denn jetzt gebraucht, das hier, Valencia Meal, hab ich"}, {"id": 54, "start": 618.46, "end": 627.9, "text": "Valencia Meal gebraucht, was die richtige Buff-Food-Rotation, ich hab das zu lange nicht mehr"}, {"id": 55, "start": 627.9, "end": 654.7, "text": "gespielt, ich glaub Valencia-Food, Valencia-Food-Princivation, also ich muss auf jeden Fall jetzt nochmal,"}, {"id": 56, "start": 654.7, "end": 659.02, "text": "das bringt Casting-Speed, Attack-Speed, was, Attack-Speed, guter muss ich das da fressen,"}, {"id": 57, "start": 659.02, "end": 679.26, "text": "ja, nice, jetzt haben wir jetzt schon mal ein paar ordentliche Buffs, Casting-Speed plus"}, {"id": 58, "start": 679.26, "end": 693.9, "text": "10% läuft aus und das ist dann doch Valencia Meal, wobei das passt, das ist XP-Trank, Rotation"}, {"id": 59, "start": 693.9, "end": 702.46, "text": "ist dann XP-Trank, Silandia Meal, Media Meal, ja genau, das passt, das ist ordentliche Pet-Beschwören,"}, {"id": 60, "start": 702.46, "end": 716.78, "text": "langsam aber sicher checke ich auch wieder halbwegs, was ich hier mache, ja, Hans-Karl,"}, {"id": 61, "start": 716.78, "end": 719.38, "text": "du kannst das oben rechts in deinem Profil ausstellen, kannst du jetzt, kannst du einen"}, {"id": 62, "start": 719.38, "end": 728.3, "text": "Haken wegmachen von Beta, dann startet Twitch nicht mehr in der Beta, übrigens hört man"}, {"id": 63, "start": 728.3, "end": 732.5, "text": "überhaupt was vom Sound, hört ihr irgendwas vom Game-Sound, das ist ganz schön leise,"}, {"id": 64, "start": 732.5, "end": 756.22, "text": "ich höre nämlich selbst kaum was, jetzt müsste es Game-Sound geben, echt, der Haken"}, {"id": 65, "start": 756.22, "end": 760.38, "text": "kommt immer wieder, das Problem habe ich nicht, hast du Cookies, löschst du irgendwie Cookies,"}, {"id": 66, "start": 760.38, "end": 761.38, "text": "kann das sein?"}, {"id": 67, "start": 761.38, "end": 769.94, "text": "Es gibt ja Leute, die haben so Addons installiert, die die Cookies löschen und sowas, dann kann"}, {"id": 68, "start": 769.94, "end": 779.58, "text": "sich die Seite natürlich nicht merken, wenn der Twitch-TV tut nicht, wenn man auf Twitch"}, {"id": 69, "start": 779.58, "end": 800.18, "text": "Beta ist zur Zeit, das geht nicht, da muss der Beta ausschalten, das ist noch verbugt"}, {"id": 70, "start": 800.18, "end": 806.7, "text": "auf Beta, ich gehe mal davon aus, das wird die nächsten Tage dann funktionieren, hoffe"}, {"id": 71, "start": 806.7, "end": 812.58, "text": "ich, weil ich will auch die Beta-Seite von Twitch verwenden, obwohl ich gar nicht weiß,"}, {"id": 72, "start": 812.58, "end": 816.02, "text": "was der großartige Unterschied ist, wisst ihr was der Unterschied ist zwischen normalem"}, {"id": 73, "start": 816.02, "end": 819.82, "text": "Twitch und Beta Twitch, was die da verbessert haben, was ist da jetzt anders?"}, {"id": 74, "start": 819.82, "end": 844.1, "text": "Bisschen Overlay, ok, was Zugang zu neuen Streams, wie darf ich das verstehen?"}, {"id": 75, "start": 844.1, "end": 866.74, "text": "Was meinst du mit Zugang zu neuen Streams?"}, {"id": 76, "start": 866.74, "end": 889.82, "text": "Ach, da ist mir ja vorgeschlagen wird, ok, ich baue mal den richtigen Items an, ich hoffe"}, {"id": 77, "start": 889.82, "end": 907.66, "text": "ich habe den voll gefressen, oh, ist das ein Boss, so aus, krass, du kriegst Damage,"}, {"id": 78, "start": 907.66, "end": 920.58, "text": "krass, ok, auf den"}, {"id": 79, "start": 920.58, "end": 922.58, "text": "Also nein, nicht sonntags"}, {"id": 80, "start": 923.18, "end": 927.62, "text": "Wochenendbuffet, all you can eat essen. Die hatten da irgendwie sechs, sieben verschiedene Stationen"}, {"id": 81, "start": 928.42, "end": 932.34, "text": "Einmal so ein Typ, der dir was gegrillt hat, dann ein anderer Typ, der dir, wo das so"}, {"id": 82, "start": 932.66, "end": 939.06, "text": "Konntest, kannst dir selbst Zeug zusammenstellen. Der eine hat so einen Grill geschmissen, auf so eine heiße Platte, der andere hat es in den Wok geschmissen mit Soße dabei"}, {"id": 83, "start": 939.34, "end": 942.42, "text": "Da hatten sie noch so einen offenen Grill, wo sie Spieße drüber gemacht haben"}, {"id": 84, "start": 943.22, "end": 949.46, "text": "Plus noch irgendwie ein paar andere Stationen, eine Sushi-Station, irgendwie alles mögliche, ey, das sagst du euch. Ich hab, ich hab"}, {"id": 85, "start": 949.46, "end": 955.1, "text": "Keine Ahnung, acht Teller oder so gefressen. Also nicht komplett voll, vollgeladene Teller, ne?"}, {"id": 86, "start": 955.66, "end": 958.14, "text": "Aber acht Stück, ich bin doch im Arsch"}, {"id": 87, "start": 958.14, "end": 977.46, "text": "Haha, der Gasten hört zu, sag doch. Der Gasten, du hast leider schon verpasst, als ich über dich gelästert hab. Einer ist zu spät"}, {"id": 88, "start": 977.46, "end": 984.46, "text": "Ja, er ist auch zu spät"}, {"id": 89, "start": 984.46, "end": 994.62, "text": "Ah, ich hab gesagt, der Karsten rennt immer so planlos rum, da kann ich gar nicht hinterher rennen"}, {"id": 90, "start": 997.58, "end": 999.58, "text": "Das ist so zigzag halt"}, {"id": 91, "start": 999.58, "end": 1013.66, "text": "Ich hoffe, dass sie auf Pflanzerroth in Spanien auch einen guten Asiamann haben, aber ich glaube, dass sie auch auf Pflanzerroth in Spanien auch einen guten Asiamann haben"}, {"id": 92, "start": 1013.66, "end": 1033.66, "text": "Ich hoffe, dass sie auf Pflanzerroth in Spanien auch einen guten Asiamann haben, also ich glaube, Pflanzerroth ist jetzt nicht unbedingt bekannt für gutes Asia-Oil you can eat"}, {"id": 93, "start": 1033.66, "end": 1040.66, "text": "Ich will nicht sagen, dass es das da nicht gibt oder so. Ich glaube, der Fokus liegt auf was anderem."}, {"id": 94, "start": 1040.66, "end": 1045.66, "text": "Warum mache ich da eigentlich nicht mal eine E-Dot-Feld rein?"}, {"id": 95, "start": 1045.66, "end": 1050.66, "text": "Das wäre sonst zu easy mode, als wäre es halt einfach."}, {"id": 96, "start": 1050.66, "end": 1057.66, "text": "Der Bot nervt mich."}, {"id": 97, "start": 1057.66, "end": 1067.66, "text": "Sebaro, kannst du irgendwie die Spam-Benachrichtigungen zum Battlefield-Server ausschalten?"}, {"id": 98, "start": 1067.66, "end": 1070.66, "text": "Kannst du das Remote machen? Mit einem Kommando?"}, {"id": 99, "start": 1070.66, "end": 1075.66, "text": "Oder wenn das nicht geht, mache ich schnell die Bot-Seite auf. Das ist halt schwierig hier mit den Mops."}, {"id": 100, "start": 1075.66, "end": 1089.66, "text": "Zumindest nervt der Bot mit dem Battlefield-Server-Spam."}, {"id": 101, "start": 1089.66, "end": 1096.66, "text": "Hoffentlich nicht."}, {"id": 102, "start": 1096.66, "end": 1100.66, "text": "Vorhin war auf meinem Battlefield-Server noch was los."}, {"id": 103, "start": 1100.66, "end": 1105.66, "text": "Also quasi, auch wenn ich nicht mehr drauf war, was mega geil ist."}, {"id": 104, "start": 1105.66, "end": 1109.66, "text": "Vielleicht ist der Server ja ab und zu mal bevölkert."}, {"id": 105, "start": 1109.66, "end": 1112.66, "text": "Auch wenn ich nicht da bin."}, {"id": 106, "start": 1112.66, "end": 1115.66, "text": "Wäre nice, dann könnte man nämlich einfach mal so ein bisschen drauf spielen."}, {"id": 107, "start": 1115.66, "end": 1120.66, "text": "Es gibt eh viel zu wenig gute Battlefield 3-Server mit gescheitem Regelset."}, {"id": 108, "start": 1120.66, "end": 1123.66, "text": "Oh, was macht er denn hier?"}, {"id": 109, "start": 1123.66, "end": 1126.66, "text": "Au, krass. Was ist das hier?"}, {"id": 110, "start": 1126.66, "end": 1129.66, "text": "Da gehe ich nicht rein."}, {"id": 111, "start": 1129.66, "end": 1149.66, "text": "Ich will hier kein XP verlieren."}, {"id": 112, "start": 1149.66, "end": 1159.66, "text": "Wenn du das hast."}, {"id": 113, "start": 1159.66, "end": 1167.66, "text": "Die macht ja richtig Damage, die Möpse."}, {"id": 114, "start": 1167.66, "end": 1169.66, "text": "Krasse Möpse."}, {"id": 115, "start": 1169.66, "end": 1171.66, "text": "Richtig Damage."}, {"id": 116, "start": 1171.66, "end": 1175.66, "text": "Wo ist jetzt mal der Master Chief kommen, unser Owen?"}, {"id": 117, "start": 1175.66, "end": 1181.66, "text": "Wo ist der Master Chief, wenn man ihn braucht?"}, {"id": 118, "start": 1181.66, "end": 1184.66, "text": "Cortana habe ich schon, war mir auf dem Rechner."}, {"id": 119, "start": 1184.66, "end": 1188.66, "text": "Wo ist der Master Chief?"}, {"id": 120, "start": 1188.66, "end": 1195.66, "text": "Ja, das ist Call of Duty Beta, was ich hier spiele."}, {"id": 121, "start": 1195.66, "end": 1198.66, "text": "Ist neuer."}, {"id": 122, "start": 1198.66, "end": 1207.66, "text": "Call of Duty Fantasy Warfare 2."}, {"id": 123, "start": 1207.66, "end": 1213.66, "text": "Oh, da ist er down. Der Mob, da geht er, da geht er down."}, {"id": 124, "start": 1213.66, "end": 1217.66, "text": "Hab ich hier noch für Kack Loot, alles weg."}, {"id": 125, "start": 1217.66, "end": 1220.66, "text": "Ich hab eh kein Geld."}, {"id": 126, "start": 1220.66, "end": 1233.66, "text": "1.000 Loot in 2k17."}, {"id": 127, "start": 1233.66, "end": 1244.66, "text": "Oh, ich war voll gefressen."}, {"id": 128, "start": 1244.66, "end": 1246.66, "text": "Ich könnte mal meinen Damage Buff machen."}, {"id": 129, "start": 1246.66, "end": 1250.66, "text": "Oh, das ist nicht mein Damage Buff, das ist mein Damage Buff."}, {"id": 130, "start": 1250.66, "end": 1253.66, "text": "Das machen wir übrigens Damage in der Zeit."}, {"id": 131, "start": 1253.66, "end": 1256.66, "text": "Guck dir das mal an, das haben sie gereckt."}, {"id": 132, "start": 1256.66, "end": 1258.66, "text": "Die Federwölfe."}, {"id": 133, "start": 1258.66, "end": 1261.66, "text": "So typische MMO Mob Name."}, {"id": 134, "start": 1261.66, "end": 1264.66, "text": "So typische MMO Mob Name, wo ihnen sonst wieder nichts einfällt."}, {"id": 135, "start": 1264.66, "end": 1267.66, "text": "Federwölfe."}, {"id": 136, "start": 1267.66, "end": 1271.66, "text": "Was ist mit denen los?"}, {"id": 137, "start": 1271.66, "end": 1286.66, "text": "Warum hat ein Wolf Federn?"}, {"id": 138, "start": 1286.66, "end": 1289.66, "text": "Oh, ne hier gehts nicht lang."}, {"id": 139, "start": 1289.66, "end": 1307.66, "text": "Der hängt da am Stein. Der geile Wizard."}, {"id": 140, "start": 1307.66, "end": 1320.66, "text": "Der Mob Sound ist auch wieder mal absolut High Quality."}, {"id": 141, "start": 1320.66, "end": 1327.66, "text": "Ah, das ist ein Low Budget Game."}, {"id": 142, "start": 1327.66, "end": 1336.66, "text": "Also es ist kein WSP, das übelste Low Budget Game."}, {"id": 143, "start": 1336.66, "end": 1340.66, "text": "Und auch ein ziemlich kleines Team."}, {"id": 144, "start": 1340.66, "end": 1343.66, "text": "Weil ich weiß nicht, wie es mittlerweile ist."}, {"id": 145, "start": 1343.66, "end": 1350.66, "text": "Das merkt man dem Gamer auch an vielen Stellen an."}, {"id": 146, "start": 1350.66, "end": 1358.66, "text": "Ja Karsten, stimmt, hast recht."}, {"id": 147, "start": 1358.66, "end": 1360.66, "text": "Nur ein paar Webpanel."}, {"id": 148, "start": 1360.66, "end": 1366.66, "text": "Ach komm, sonst spammt mein Bot halt alle 10 Minuten."}, {"id": 149, "start": 1366.66, "end": 1382.66, "text": "Wir werden es überleben."}, {"id": 150, "start": 1382.66, "end": 1384.66, "text": "Wizard Gameplay ist echt spannend, oder?"}, {"id": 151, "start": 1384.66, "end": 1393.66, "text": "Was sagt ihr? High Octane Gameplay."}, {"id": 152, "start": 1393.66, "end": 1414.66, "text": "Karsten, ich heile mal ne Runde."}, {"id": 153, "start": 1414.66, "end": 1424.66, "text": "Das Viech lebt hier immer noch."}, {"id": 154, "start": 1424.66, "end": 1427.66, "text": "Der Mob Sound."}, {"id": 155, "start": 1427.66, "end": 1434.66, "text": "Was war mit den Leuten da von Kakaogames?"}, {"id": 156, "start": 1434.66, "end": 1438.66, "text": "Wie hieß der Hersteller nochmal? Pearl?"}, {"id": 157, "start": 1438.66, "end": 1440.66, "text": "Was war mit denen kaputt?"}, {"id": 158, "start": 1440.66, "end": 1459.66, "text": "Haben die aus einer Sound-Datenbank genau einen Wolf Sound rausgeholt, oder was?"}, {"id": 159, "start": 1459.66, "end": 1467.66, "text": "Die hat nur einen Wolf Sound, mehr gab es nicht."}, {"id": 160, "start": 1467.66, "end": 1477.66, "text": "Kaufe drei Mob Sounds, bekomme einen for free."}, {"id": 161, "start": 1477.66, "end": 1485.66, "text": "Was war Alex nochmal? War das das Gothic in der Zukunft?"}, {"id": 162, "start": 1485.66, "end": 1487.66, "text": "Ich bin gerade ein wenig verwirrt."}, {"id": 163, "start": 1487.66, "end": 1491.66, "text": "Es hört sich zwar so an, als wäre ich besoffen oder so, aber das stimmt nicht."}, {"id": 164, "start": 1491.66, "end": 1499.66, "text": "Ich bin bloß vollgefressen und so halb im Koma."}, {"id": 165, "start": 1499.66, "end": 1505.66, "text": "Ah, das neue Gothic, da bin ich auch mal gespannt drauf."}, {"id": 166, "start": 1505.66, "end": 1512.66, "text": "Ich war schon immer eher für Gothic als für Elder Scrolls Games."}, {"id": 167, "start": 1512.66, "end": 1517.66, "text": "Die Elder Scrolls Formel ist nicht so meins."}, {"id": 168, "start": 1517.66, "end": 1524.66, "text": "Schlimmste war Elder Scrolls Online. Fail Game."}, {"id": 169, "start": 1524.66, "end": 1527.66, "text": "Ist immer noch ein deutscher Studio?"}, {"id": 170, "start": 1527.66, "end": 1530.66, "text": "Ich habe keine Ahnung, wo die mittlerweile sitzen."}, {"id": 171, "start": 1530.66, "end": 1533.66, "text": "Könnte aber sein."}, {"id": 172, "start": 1533.66, "end": 1541.66, "text": "Hallo D-Striker."}, {"id": 173, "start": 1541.66, "end": 1552.66, "text": "Sebaro, du musst Asia All You Can Eat machen."}, {"id": 174, "start": 1552.66, "end": 1556.66, "text": "Ja, aber das macht nichts, das Stream Delay ist."}, {"id": 175, "start": 1556.66, "end": 1561.66, "text": "Ja, aber das Stream Delay ist nicht lang, nur zehn Sekunden oder so, das geht schon krass."}, {"id": 176, "start": 1561.66, "end": 1574.66, "text": "Das ist einfach ein bisschen wie Brain Lag."}, {"id": 177, "start": 1574.66, "end": 1577.66, "text": "Kochst du eigentlich auch manchmal selbst oder gehst du eben irgendwie fest?"}, {"id": 178, "start": 1577.66, "end": 1583.66, "text": "Manchmal koche ich auch was, aber es hält schön krass."}, {"id": 179, "start": 1583.66, "end": 1586.66, "text": "Ich habe eigentlich selten Bock, was zu kochen."}, {"id": 180, "start": 1586.66, "end": 1590.66, "text": "Meine Mutter kocht mir manchmal was."}, {"id": 181, "start": 1590.66, "end": 1597.66, "text": "Das ist dann ganz nice."}, {"id": 182, "start": 1597.66, "end": 1601.66, "text": "Aber meistens hole ich mir entweder was zu essen, Lieferdienst."}, {"id": 183, "start": 1601.66, "end": 1604.66, "text": "Oder ab und zu mache ich mir immer irgendwie so was."}, {"id": 184, "start": 1604.66, "end": 1606.66, "text": "Steh auf, Wissart."}, {"id": 185, "start": 1606.66, "end": 1611.66, "text": "Nicht rum stolpern hier."}, {"id": 186, "start": 1611.66, "end": 1615.66, "text": "Ab und zu mache ich mir immer irgendwie Spaghetti Polonaise oder so."}, {"id": 187, "start": 1615.66, "end": 1621.66, "text": "Dass ich nicht auch ein bisschen was komplizierteres zustande bekomme, das geht schon."}, {"id": 188, "start": 1621.66, "end": 1633.66, "text": "Aber ich habe da meistens keinen Bock drauf."}, {"id": 189, "start": 1633.66, "end": 1636.66, "text": "Da springt er mit seinem Ranger Grill rum."}, {"id": 190, "start": 1636.66, "end": 1640.66, "text": "Der Frazier."}, {"id": 191, "start": 1640.66, "end": 1649.66, "text": "Mamutel."}, {"id": 192, "start": 1649.66, "end": 1672.66, "text": "Hat er nicht gehört."}, {"id": 193, "start": 1672.66, "end": 1676.66, "text": "Ein was für... Moment, wie heißt dieser Mob?"}, {"id": 194, "start": 1676.66, "end": 1681.66, "text": "Ein was? Ich erkenne sie. Ein Bella-Dona-Elephant."}, {"id": 195, "start": 1681.66, "end": 1684.66, "text": "Weiß nicht, was mit den Japanern da kaputt ist bei den Mobnamen."}, {"id": 196, "start": 1684.66, "end": 1695.66, "text": "Ein Bella-Dona-Elephant und ein Federwolf."}, {"id": 197, "start": 1695.66, "end": 1714.66, "text": "Oh stimmt, Karst, du hast rechts den Koreaner, kein Japaner. Ganz stimmt, habe ich verwechselt. Das ist ja ein koreanisches Game."}, {"id": 198, "start": 1714.66, "end": 1726.66, "text": "Guck mal, da sind Gegner, wollen die uns bashen?"}, {"id": 199, "start": 1726.66, "end": 1730.66, "text": "Jetzt wollen die Typen von uns."}, {"id": 200, "start": 1730.66, "end": 1748.66, "text": "Ah, der Fabian schreibt schon, der macht das. Fabian sagt, es pisst euch alle."}, {"id": 201, "start": 1748.66, "end": 1763.66, "text": "Oh, ich muss ja über den Chat was drüber planten, fällt mir gerade auf."}, {"id": 202, "start": 1763.66, "end": 1787.66, "text": "Fabian flamet die Leute, so muss das sein. Gleich mal Revier markieren hier."}, {"id": 203, "start": 1787.66, "end": 1793.66, "text": "Es gibt Flamer, das wird ja geil."}, {"id": 204, "start": 1793.66, "end": 1799.66, "text": "Frazier ist der beste Flamer, den es gibt. Ich kenne keiner, der die Leute so gut flamen kann, wie der Fabian."}, {"id": 205, "start": 1799.66, "end": 1805.66, "text": "Oder was heißt flamen? Man nennt es ja neuerdings nicht mehr flamen, sondern disrespect."}, {"id": 206, "start": 1805.66, "end": 1817.66, "text": "Es ist besser, man flamet heute nicht mehr, heute wird disrespected."}, {"id": 207, "start": 1817.66, "end": 1836.66, "text": "Wo ist der Karsten? Soll ich den Mob jetzt alleine bashen?"}, {"id": 208, "start": 1836.66, "end": 1851.66, "text": "Wegkocken ist immer noch das beste Wort."}, {"id": 209, "start": 1851.66, "end": 1871.66, "text": "Oh, jetzt habe ich ja..."}, {"id": 210, "start": 1871.66, "end": 1885.66, "text": "Karsten, kannst du mal kurz alle Mops bashen gleich, ich muss noch mal Chat Overlay rein machen."}, {"id": 211, "start": 1885.66, "end": 1892.66, "text": "Passt, passt, ich habe es schon, ich habe es schon."}, {"id": 212, "start": 1892.66, "end": 1897.66, "text": "Bei Flanken muss jemand ins Kopf 120 denken, wieso sagt der das auch?"}, {"id": 213, "start": 1897.66, "end": 1902.66, "text": "Das passt zum Niko. Das war eine Katze, ja Karsten."}, {"id": 214, "start": 1902.66, "end": 1926.66, "text": "Das passt zum Niko, Leute, das passt. Wegflanken, das kann ich mir so richtig vorstellen."}, {"id": 215, "start": 1926.66, "end": 1945.66, "text": "Ich kann mir das richtig vorstellen beim Niko."}, {"id": 216, "start": 1945.66, "end": 1950.66, "text": "Ja, der Niko, da hat er wieder weggeflankt, das kann ich mir richtig vorstellen."}, {"id": 217, "start": 1950.66, "end": 1967.66, "text": "Was sagt der immer? Der hat doch auch so einen Spruch, ich gucke das zu selten."}, {"id": 218, "start": 1967.66, "end": 1982.66, "text": "Ich weiß es nicht, was hatte der nochmal für einen Spruch? Keine Ahnung, ich weiß es nicht mehr."}, {"id": 219, "start": 1982.66, "end": 1987.66, "text": "Ja, habe ich gesagt, das war das, jetzt ist es wieder eingefallen."}, {"id": 220, "start": 1987.66, "end": 1999.66, "text": "Habe ich auch richtig bescheuert, aber eh lustig. Ich mag den Niko."}, {"id": 221, "start": 1999.66, "end": 2010.66, "text": "Der Niko ist der einzige Lifestyle Channel, das ist so der originale Lifestyle Channel irgendwie."}, {"id": 222, "start": 2010.66, "end": 2017.66, "text": "Auch wenn ich es nicht gucke, aber ich mag den Niko."}, {"id": 223, "start": 2017.66, "end": 2022.66, "text": "Ich kann mich noch dran erinnern, wie unglücklich der Niko früher war, weil er gedacht hat,"}, {"id": 224, "start": 2022.66, "end": 2029.66, "text": "er müsste quasi so seriösere Videos machen, so Call of Duty Zeugs noch damals."}, {"id": 225, "start": 2029.66, "end": 2033.66, "text": "Der wollte schon immer so sein abgedrehtes Zeug machen, das wollte er schon damals machen."}, {"id": 226, "start": 2033.66, "end": 2041.66, "text": "Er hat einfach nicht gedacht, dass es zieht am Anfang, bis er es dann probiert hat, dann hat es eingeschlagen."}, {"id": 227, "start": 2041.66, "end": 2047.66, "text": "Deswegen, ich mag den Niko. Der macht es nicht, der hat es nicht gemacht auf seinem Channel,"}, {"id": 228, "start": 2047.66, "end": 2050.66, "text": "weil er irgendwie der Ansicht ist, das ist jetzt krasser Lifestyle, das machen alle,"}, {"id": 229, "start": 2050.66, "end": 2065.66, "text": "das gibt krasse Views, sonst was. Nee, der ist einfach so."}, {"id": 230, "start": 2065.66, "end": 2088.66, "text": "Außerdem ist er nicht so ein Spast wie die anderen Lifestyle Typen."}, {"id": 231, "start": 2088.66, "end": 2102.66, "text": "Ich check hier übrigens null, was abgeht. Ich charge einfach sinnlos auf irgendwelche Mob Packs vor mir drauf."}, {"id": 232, "start": 2102.66, "end": 2128.66, "text": "Baschen, Alter. Moin Fabian, hast du auch den Streamer?"}, {"id": 233, "start": 2128.66, "end": 2139.66, "text": "Naja, wollte schon, weil du hast gerade in diesem Moment Baschen gesagt, wo ich auch gesagt habe, Baschen."}, {"id": 234, "start": 2139.66, "end": 2143.66, "text": "Das Game ruckelt? Warum ruckelt das Game? Fuck."}, {"id": 235, "start": 2143.66, "end": 2147.66, "text": "Was ist hier los? Ich habe einen 1008 Chi, da darf bei Definition nichts ruckeln."}, {"id": 236, "start": 2147.66, "end": 2151.66, "text": "Das ist unruckelbar."}, {"id": 237, "start": 2151.66, "end": 2155.66, "text": "Alles recht krass, das stimmt schon. Aber ich bin gerade nicht mehr so richtig zurechnungsfähig."}, {"id": 238, "start": 2155.66, "end": 2163.66, "text": "Das ist unruckelbar mit 1008 Chi und warum ruckelt das?"}, {"id": 239, "start": 2163.66, "end": 2167.66, "text": "Korea Optimization, null."}, {"id": 240, "start": 2167.66, "end": 2173.66, "text": "Ich habe 27 FPS? Das gibt es doch nicht."}, {"id": 241, "start": 2173.66, "end": 2178.66, "text": "Das liegt bestimmt noch daran, dass ich vorher Call of Duty gestartet habe auf dem rechten Rechner."}, {"id": 242, "start": 2178.66, "end": 2182.66, "text": "Das reicht, wenn es einmal auf dem Rechner gelaufen ist, dann ist Instant RIP."}, {"id": 243, "start": 2182.66, "end": 2192.66, "text": "Dann läuft kein Game mehr."}, {"id": 244, "start": 2192.66, "end": 2205.66, "text": "Ich meine, ich sollte ja keine 25 FPS haben, 29 FPS. Sollte ja schon ein bisschen mehr haben."}, {"id": 245, "start": 2205.66, "end": 2215.66, "text": "Was mache ich denn da?"}, {"id": 246, "start": 2215.66, "end": 2219.66, "text": "Ja, das stimmt."}, {"id": 247, "start": 2219.66, "end": 2223.66, "text": "Das stimmt. Ich meine, das Game sieht schon wirklich hübsch aus, muss man sagen."}, {"id": 248, "start": 2223.66, "end": 2227.66, "text": "Danke für die Follows. Ich sehe es gerade leider nicht, wer das gewesen ist."}, {"id": 249, "start": 2227.66, "end": 2233.66, "text": "Ich gucke mal, ob ich es gleich in der Vorschau sehe."}, {"id": 250, "start": 2233.66, "end": 2254.66, "text": "3k47"}, {"id": 251, "start": 2254.66, "end": 2260.66, "text": "Einfach nur ein Mopsound für alles."}, {"id": 252, "start": 2260.66, "end": 2267.66, "text": "Stimmt, ja. Ich habe es gerade wieder vergessen, dass man nach 24 FPS nichts mehr sieht."}, {"id": 253, "start": 2267.66, "end": 2271.66, "text": "Ja, das ist ja richtig."}, {"id": 254, "start": 2271.66, "end": 2276.66, "text": "Eigentlich kann mir das gar nicht auffallen, dass es ruckelt gerade. Das geht gar nicht."}, {"id": 255, "start": 2276.66, "end": 2278.66, "text": "Das ist nicht möglich."}, {"id": 256, "start": 2278.66, "end": 2282.66, "text": "Außerdem habe ich gerade ein Auge zu, dann sehe ich eh nur noch 12."}, {"id": 257, "start": 2282.66, "end": 2286.66, "text": "Stimmt so, oder? Ich habe es richtig gerechnet."}, {"id": 258, "start": 2286.66, "end": 2289.66, "text": "Ist das die richtige Rechnung?"}, {"id": 259, "start": 2289.66, "end": 2299.66, "text": "24 FPS durch 2 Augen, das heißt 12."}, {"id": 260, "start": 2299.66, "end": 2308.66, "text": "Sogar der Karsten gibt mir recht. Der Karsten kennt sich mit so etwas aus."}, {"id": 261, "start": 2308.66, "end": 2322.66, "text": "Er kennt sich besser aus als ihr alle im Chat hier."}, {"id": 262, "start": 2322.66, "end": 2326.66, "text": "Der Karsten sagt gerade, das hat auch etwas damit zu tun, wie weit man das Auge zumacht."}, {"id": 263, "start": 2326.66, "end": 2332.66, "text": "Das wusste ich noch nicht. Das ist mir jetzt neu gewesen."}, {"id": 264, "start": 2332.66, "end": 2338.66, "text": "Ich dachte, solange man das Auge nicht ganz zu hat, zählt es voll. Wenn man es zu hat, zählt es nur noch die halben FPS."}, {"id": 265, "start": 2338.66, "end": 2351.66, "text": "Das heißt, wenn ich das Auge nur zur Hälfte zumache, dann habe ich weder 24 noch 12, dann habe ich so 18 oder so etwas."}, {"id": 266, "start": 2351.66, "end": 2357.66, "text": "Stimmt das, ja?"}, {"id": 267, "start": 2357.66, "end": 2371.66, "text": "Ja, ok. Endlich habe ich das mal verstanden."}, {"id": 268, "start": 2371.66, "end": 2377.66, "text": "Leute, das ist ein Witz."}, {"id": 269, "start": 2377.66, "end": 2393.66, "text": "Ich muss wieder einige nicht checken. Manchen muss man das wirklich auch immer direkt aus Brot schmieren."}, {"id": 270, "start": 2393.66, "end": 2399.66, "text": "Karsten gleich Kaboom. Nee, Karsten gleich Masterkrabber. Der einzige wahre Masterkrabber."}, {"id": 271, "start": 2399.66, "end": 2412.66, "text": "Der Kaboom heißt Thorsten und nicht Karsten. Aber fast."}, {"id": 272, "start": 2412.66, "end": 2419.66, "text": "Ja, Happy Fill. Das kann jetzt jeder behaupten, dass er es verstanden hat."}, {"id": 273, "start": 2419.66, "end": 2427.66, "text": "Das kann jetzt jeder behaupten. Aber ich glaube dir, dass wir wollen ja mal nicht so sein."}, {"id": 274, "start": 2427.66, "end": 2438.66, "text": "Ich bin so in Fresskoma."}, {"id": 275, "start": 2438.66, "end": 2467.66, "text": "Ui, jetzt habe ich 22 FPS. Karsten, wie viele FPS hast du hier? Sag mal, das würde mich interessieren."}, {"id": 276, "start": 2467.66, "end": 2485.66, "text": "50? Du hast 50 FPS? Moment. Ist der Tank schon im Arsch oder was?"}, {"id": 277, "start": 2485.66, "end": 2499.66, "text": "Ok. Karsten ist ein imaginärer Freund, genau."}, {"id": 278, "start": 2499.66, "end": 2515.66, "text": "FV. Warum hat der Karsten mehr FPS als ich? Das geht doch gar nicht."}, {"id": 279, "start": 2515.66, "end": 2532.66, "text": "Karsten, das dürftest du eigentlich gar nicht ausmachen, großartig. Dafür habe ich eine Grafikkarte, die ist 30 mal besser."}, {"id": 280, "start": 2532.66, "end": 2540.66, "text": "Ich wusste gar nicht, dass du streamst, doch. Heute habe ich saumäßig viel gestreamt. Ich habe heute Vormittag gestreamt."}, {"id": 281, "start": 2540.66, "end": 2557.66, "text": "Bis 15.30. Und jetzt noch mal. Aber jetzt eigentlich auch nur, weil ich noch nicht pennen kann, weil mein Bauch weh tut von zu viel AC."}, {"id": 282, "start": 2557.66, "end": 2565.66, "text": "Ich meine, an OBS kann das ja auch nicht liegen. Das ist ruckel. Ich mache nämlich Grafikkarten-encoding."}, {"id": 283, "start": 2565.66, "end": 2579.66, "text": "Das sollte überhaupt keinen Einfluss haben. Bei dir geht nur noch die Beta-Seite."}, {"id": 284, "start": 2579.66, "end": 2586.66, "text": "Marvin, kannst du nicht oben rechts auf dein Profil klicken und den Haken wegmachen bei Beta?"}, {"id": 285, "start": 2586.66, "end": 2599.66, "text": "Das sollte eigentlich gehen. Lass mal die Mammutl-Special hier."}, {"id": 286, "start": 2599.66, "end": 2625.66, "text": "Nee, nee, passt schon."}, {"id": 287, "start": 2625.66, "end": 2631.66, "text": "Da lädt die Seite nicht komplett. Okay."}, {"id": 288, "start": 2631.66, "end": 2636.66, "text": "Ja, ich lasse den Stream über CPU-encoden."}, {"id": 289, "start": 2636.66, "end": 2649.66, "text": "OBS sollte bei mir wirklich kaum CPU-Last verursachen."}, {"id": 290, "start": 2649.66, "end": 2656.66, "text": "Also keine Ahnung, warum ich hier nur 25 FPS habe gerade."}, {"id": 291, "start": 2656.66, "end": 2663.66, "text": "Aber gut, das ist BDO. BDO, das ruckelt halt immer."}, {"id": 292, "start": 2663.66, "end": 2672.66, "text": "Ich glaube, das kann gar nicht flüssig laufen, das Game."}, {"id": 293, "start": 2672.66, "end": 2693.66, "text": "Highly optimized. 18 FPS."}, {"id": 294, "start": 2693.66, "end": 2707.66, "text": "Das kann aber echt nicht sein langsam. Wo sind die Settings hier?"}, {"id": 295, "start": 2707.66, "end": 2724.66, "text": "Ich meine, viel habe ich schon anerkannt."}, {"id": 296, "start": 2724.66, "end": 2738.66, "text": "Ich finde einfach keine günstige Sauerschränke. Ja, aber ich gucke mal bei Musik-Equipment."}, {"id": 297, "start": 2738.66, "end": 2760.66, "text": "19 Zoll? Mit welcher Tiefe? Oder nicht 19 Zoll? Was willst du haben?"}, {"id": 298, "start": 2760.66, "end": 2772.66, "text": "Ich muss jetzt mal einen Task-Manager gucken, was hier so viel... Details."}, {"id": 299, "start": 2772.66, "end": 2781.66, "text": "BDO-Verbrauch, CPU-Leistung. Sonst fast nichts."}, {"id": 300, "start": 2781.66, "end": 2790.66, "text": "Nur BDO-Verbrauch, CPU-Leistung."}, {"id": 301, "start": 2790.66, "end": 2794.66, "text": "Aber ich könnte auch einfach mal diesen komischen Slider hier anmachen,"}, {"id": 302, "start": 2794.66, "end": 2801.66, "text": "dass Effekte verringert werden bei FPS. Fuck ey, wie viele Mops."}, {"id": 303, "start": 2801.66, "end": 2813.66, "text": "Schießnudel, ich habe heute kein MW2 mehr, äh, WF2 mehr gespielt heute Abend, nur heute Morgen."}, {"id": 304, "start": 2813.66, "end": 2823.66, "text": "Wo ist denn dieser komische Slider? Wo ist denn der Quality-Slider?"}, {"id": 305, "start": 2823.66, "end": 2838.66, "text": "60, BÄM. Naja."}, {"id": 306, "start": 2838.66, "end": 2853.66, "text": "Ja, wirklich was bringt uns jetzt nicht."}, {"id": 307, "start": 2853.66, "end": 2860.66, "text": "Schalten da quasi alle Effekte aus, also wirklich bringt uns das nicht."}, {"id": 308, "start": 2860.66, "end": 2868.66, "text": "Schmeiß die Quality mal ein bisschen runter."}, {"id": 309, "start": 2868.66, "end": 2878.66, "text": "Quality Low."}, {"id": 310, "start": 2878.66, "end": 2884.66, "text": "So, jetzt darf das Game noch laden, das wäre auch nice."}, {"id": 311, "start": 2884.66, "end": 2893.66, "text": "Ja, Funky Dough, sag mal was du, was brauchst du denn?"}, {"id": 312, "start": 2893.66, "end": 2907.66, "text": "Also was willst du für eine... boah das Spiel sieht das scheiße aus ey."}, {"id": 313, "start": 2907.66, "end": 2909.66, "text": "Wie tief soll er sein, wie hoch soll er sein?"}, {"id": 314, "start": 2909.66, "end": 2920.66, "text": "19 Zoll, rund 80 cm tief, um die 20 HE, okay 80 cm, das ist schon volle, fast volle Tiefe."}, {"id": 315, "start": 2920.66, "end": 2928.66, "text": "Also genau, da passt alles rein, fast alles."}, {"id": 316, "start": 2928.66, "end": 2938.66, "text": "Okay, dass ich das die Qualität runtergestellt habe bringt auch nichts, außer dass das Spiel noch viel beschissener aussieht."}, {"id": 317, "start": 2938.66, "end": 2946.66, "text": "Ähm, guck mal bei Audio Schränken, guck mal bei Audio Racks."}, {"id": 318, "start": 2946.66, "end": 2958.66, "text": "Ich mein, mein ich ernst jetzt, guck mal bei Audio Racks."}, {"id": 319, "start": 2958.66, "end": 2972.66, "text": "Mein Game sagt es ist korrupt und muss neu gestartet werden."}, {"id": 320, "start": 2972.66, "end": 2977.66, "text": "Habt ihr gehört?"}, {"id": 321, "start": 2977.66, "end": 2991.66, "text": "Hallo? Mein Game ist korrupt und muss neu gestartet werden."}, {"id": 322, "start": 2991.66, "end": 3015.66, "text": "Ähm, vielleicht hat es deswegen auch so geruckelt."}, {"id": 323, "start": 3015.66, "end": 3035.66, "text": "Vielleicht hat es deswegen auch so geruckelt, der Scheiß."}, {"id": 324, "start": 3035.66, "end": 3039.66, "text": "Auf gehts."}, {"id": 325, "start": 3039.66, "end": 3046.66, "text": "Ja guck mal bei Toman zum Beispiel, bei Toman kannst du mal gucken, was es da für Audio Equipment für Racks gibt."}, {"id": 326, "start": 3046.66, "end": 3050.66, "text": "Da gibt es auch welche mit Rollen und sowas."}, {"id": 327, "start": 3050.66, "end": 3067.66, "text": "Die sind halt für Audio Equipment gedacht, die sind aber auch 19 Zoll und haben die Löcher an den richtigen Stellen für Schrauben und so."}, {"id": 328, "start": 3067.66, "end": 3071.66, "text": "Game ist immer noch korrupt."}, {"id": 329, "start": 3071.66, "end": 3075.66, "text": "Fuck, ich glaub ich kann auch nicht mehr spielen."}, {"id": 330, "start": 3075.66, "end": 3081.66, "text": "Mein Game sagt jetzt beim Laden, dass es korrupt ist, ich muss ja zuerst mal Scan machen."}, {"id": 331, "start": 3081.66, "end": 3096.66, "text": "Das dauert jetzt ewig."}, {"id": 332, "start": 3096.66, "end": 3100.66, "text": "Ich hab eine SSD und das backt einfach rum, das ist BDO."}, {"id": 333, "start": 3100.66, "end": 3119.66, "text": "Ich glaub nicht, dass meine SSD kaputt geht."}, {"id": 334, "start": 3119.66, "end": 3138.66, "text": "So, okay, LHFBDO."}, {"id": 335, "start": 3138.66, "end": 3148.66, "text": "Ja, Eax, bei mir kackt alles ab."}, {"id": 336, "start": 3148.66, "end": 3151.66, "text": "Ich weiß auch nicht, was da los ist."}, {"id": 337, "start": 3151.66, "end": 3157.66, "text": "Aber wenn meine SSD wirklich Defekte hätte, dann hätte ich andere Probleme."}, {"id": 338, "start": 3157.66, "end": 3159.66, "text": "Außerdem kackt ja sonst nichts ab."}, {"id": 339, "start": 3159.66, "end": 3162.66, "text": "BDO hat das schon öfters mal gehabt."}, {"id": 340, "start": 3162.66, "end": 3170.66, "text": "Und, Gott, ist einfach kaputt."}, {"id": 341, "start": 3170.66, "end": 3193.66, "text": "Ich glaub ich geh jetzt pennen gleich."}, {"id": 342, "start": 3193.66, "end": 3194.66, "text": "Was ist das?"}, {"id": 343, "start": 3194.66, "end": 3209.66, "text": "Ich hab schon mal nach Epic Music gesucht auf YouTube, das klang nicht so epic."}, {"id": 344, "start": 3209.66, "end": 3222.66, "text": "Nee, ich lass die Überprüfung jetzt laufen und dann ist gut."}, {"id": 345, "start": 3222.66, "end": 3225.66, "text": "Das ist super entspannend, die Halo-Menü-Musik."}, {"id": 346, "start": 3225.66, "end": 3242.66, "text": "Ich bin kein Halo-Fanboy, aber ich spiel das kaum, aber ich find die Menü-Musik ist so entspannend."}, {"id": 347, "start": 3242.66, "end": 3249.66, "text": "Ja, fucking Clown, das geht weiter mit dem nächsten Windows-Update."}, {"id": 348, "start": 3249.66, "end": 3252.66, "text": "Machen wir das Programm weiter."}, {"id": 349, "start": 3252.66, "end": 3257.66, "text": "Ich hab mir nämlich überlegt, wir machen das als Windows-App."}, {"id": 350, "start": 3257.66, "end": 3260.66, "text": "Als Universal-Windows-App."}, {"id": 351, "start": 3260.66, "end": 3265.66, "text": "Und mit dem neuen Windows-Update wird das viel einfacher und besser."}, {"id": 352, "start": 3265.66, "end": 3268.66, "text": "Deswegen warten wir da drauf, das kommt ja schon im Oktober."}, {"id": 353, "start": 3268.66, "end": 3278.66, "text": "Also kommt ja in 14 Tagen."}, {"id": 354, "start": 3278.66, "end": 3280.66, "text": "Du findest es auch bei Audio-Racks nicht."}, {"id": 355, "start": 3280.66, "end": 3282.66, "text": "Moment, ich guck jetzt mal."}, {"id": 356, "start": 3282.66, "end": 3286.66, "text": "Ich guck jetzt mal, was bei Tormann bei Racks."}, {"id": 357, "start": 3286.66, "end": 3290.66, "text": "Das gucken wir jetzt mal zusammen."}, {"id": 358, "start": 3290.66, "end": 3302.66, "text": "Wir suchen jetzt mal für den Funky-Dow ein billiges Rack raus, wo er seinen Server reinstellen kann."}, {"id": 359, "start": 3302.66, "end": 3316.66, "text": "Und wir gucken absichtlich nicht nach Server-Racks, sondern nach Studio-Audio-Racks, weil das billiger ist."}, {"id": 360, "start": 3316.66, "end": 3327.66, "text": "Das machen wir jetzt, easy."}, {"id": 361, "start": 3327.66, "end": 3336.66, "text": "Die Halo-Musik ist so geil."}, {"id": 362, "start": 3336.66, "end": 3341.66, "text": "So, ich zoome mal ein bisschen ran, weil die Seite wieder durch die Hälfte ist."}, {"id": 363, "start": 3341.66, "end": 3344.66, "text": "So, gucken wir doch mal hier."}, {"id": 364, "start": 3344.66, "end": 3347.66, "text": "Wo steht das denn hier, Rack?"}, {"id": 365, "start": 3347.66, "end": 3356.66, "text": "Divinity 2, wenn ich dazu komme."}, {"id": 366, "start": 3356.66, "end": 3362.66, "text": "Wo haben die denn die Racks nochmal stehen?"}, {"id": 367, "start": 3362.66, "end": 3375.66, "text": "Wo stehen denn die Racks nochmal?"}, {"id": 368, "start": 3375.66, "end": 3378.66, "text": "Ja, Karsten, wir spielen das zusammen."}, {"id": 369, "start": 3378.66, "end": 3381.66, "text": "Das ist ein geiles Game."}, {"id": 370, "start": 3381.66, "end": 3384.66, "text": "Guck mal hier, was ist denn das?"}, {"id": 371, "start": 3384.66, "end": 3387.66, "text": "Tormann E19-Zoll-Racks."}, {"id": 372, "start": 3387.66, "end": 3391.66, "text": "Da sieht man doch hier Zeug."}, {"id": 373, "start": 3391.66, "end": 3399.66, "text": "Guck mal hier mal, 20er E19-Zoll-Racks."}, {"id": 374, "start": 3399.66, "end": 3405.66, "text": "Okay, die sind alle ein bisschen kurz, aber die sind hinten offen."}, {"id": 375, "start": 3405.66, "end": 3408.66, "text": "Wenn es dir nichts ausmacht, dass deine Geräte ein bisschen überstehen."}, {"id": 376, "start": 3408.66, "end": 3413.66, "text": "Wobei ein 80cm Server würde ich jetzt nicht unbedingt ein 50cm tiefes Rack stecken."}, {"id": 377, "start": 3413.66, "end": 3418.66, "text": "Vielleicht ein bisschen unbalanced dann am Ende."}, {"id": 378, "start": 3418.66, "end": 3421.66, "text": "Die Racks gehen aber wirklich alle nicht so tief."}, {"id": 379, "start": 3421.66, "end": 3429.66, "text": "Na gut, Audio Racks haben halt selten Bedarf auf 80cm Tiefe."}, {"id": 380, "start": 3429.66, "end": 3432.66, "text": "Guck mal, in dem Shop habe ich meinen Rack gekauft."}, {"id": 381, "start": 3432.66, "end": 3434.66, "text": "Wie hieß das denn?"}, {"id": 382, "start": 3434.66, "end": 3438.66, "text": "Rack Magic."}, {"id": 383, "start": 3438.66, "end": 3440.66, "text": "Da habe ich meinen Rack bestellt, weil das die einzigen waren."}, {"id": 384, "start": 3440.66, "end": 3443.66, "text": "Die kleine mit kurzer Einbautiefe hatten."}, {"id": 385, "start": 3443.66, "end": 3448.66, "text": "Aber vielleicht haben die ja auch größere."}, {"id": 386, "start": 3448.66, "end": 3451.66, "text": "Guck, die haben 44mm Tiefe."}, {"id": 387, "start": 3451.66, "end": 3456.66, "text": "Ja, das ist doch was für dich hier, oder?"}, {"id": 388, "start": 3456.66, "end": 3459.66, "text": "Das ist doch was für dich hier, Funky Dough."}, {"id": 389, "start": 3459.66, "end": 3463.66, "text": "Sowas hier in der Richtung."}, {"id": 390, "start": 3463.66, "end": 3470.66, "text": "Hier, 12mm und 80cm Tiefe."}, {"id": 391, "start": 3470.66, "end": 3473.66, "text": "Höhe 21 He."}, {"id": 392, "start": 3473.66, "end": 3474.66, "text": "Farbe Schwarz."}, {"id": 393, "start": 3474.66, "end": 3477.66, "text": "Da musst du noch einen Deckel dazu kaufen."}, {"id": 394, "start": 3477.66, "end": 3483.66, "text": "Und hier neben so eine Verbindung, sonst ist es zu wackelig."}, {"id": 395, "start": 3483.66, "end": 3485.66, "text": "Und dann ist das doch ganz schick."}, {"id": 396, "start": 3485.66, "end": 3492.66, "text": "Wenn du jetzt natürlich einen Schrank haben willst, dann sieht es wieder anders aus."}, {"id": 397, "start": 3492.66, "end": 3501.66, "text": "Schränke musst du mal gucken, da fällt mir so aus dem Steg nichts ein."}, {"id": 398, "start": 3501.66, "end": 3508.66, "text": "Sowas macht ein BDO so."}, {"id": 399, "start": 3508.66, "end": 3519.66, "text": "BDO überprüft das Game."}, {"id": 400, "start": 3519.66, "end": 3533.66, "text": "Oh, oh, oh, oh, oh."}, {"id": 401, "start": 3533.66, "end": 3554.66, "text": "Oh, oh, oh."}, {"id": 402, "start": 3554.66, "end": 3572.66, "text": "Was meinst du, Karsten?"}, {"id": 403, "start": 3572.66, "end": 3595.66, "text": "Das ist eine Schale ohne."}, {"id": 404, "start": 3595.66, "end": 3608.66, "text": "Alter, BDO wird mal fertig."}, {"id": 405, "start": 3608.66, "end": 3627.66, "text": "Oh, oh, oh, oh."}, {"id": 406, "start": 3627.66, "end": 3648.66, "text": "Oh, oh, oh, oh."}, {"id": 407, "start": 3648.66, "end": 3675.66, "text": "Oh, oh, oh, oh."}, {"id": 408, "start": 3675.66, "end": 3702.66, "text": "Oh, oh, oh."}, {"id": 409, "start": 3702.66, "end": 3729.66, "text": "Oh, oh, oh, oh."}, {"id": 410, "start": 3729.66, "end": 3756.66, "text": "Oh, oh, oh, oh."}, {"id": 411, "start": 3756.66, "end": 3773.66, "text": "Oh, oh, oh, oh."}, {"id": 412, "start": 3786.66, "end": 3811.66, "text": "Oh, oh, oh, oh."}, {"id": 413, "start": 3811.66, "end": 3833.66, "text": "Oh, oh, oh, oh."}, {"id": 414, "start": 3833.66, "end": 3855.66, "text": "Oh, oh, oh, oh."}, {"id": 415, "start": 3855.66, "end": 3870.66, "text": "Oh, oh, oh, oh."}, {"id": 416, "start": 3870.66, "end": 3885.66, "text": "Oh, oh, oh, oh."}, {"id": 417, "start": 3885.66, "end": 3900.66, "text": "Oh, oh, oh, oh."}, {"id": 418, "start": 3900.66, "end": 3915.66, "text": "Oh, oh, oh, oh."}, {"id": 419, "start": 3915.66, "end": 3930.66, "text": "Oh, oh, oh, oh."}, {"id": 420, "start": 3930.66, "end": 3945.66, "text": "Oh, oh, oh, oh."}, {"id": 421, "start": 3945.66, "end": 3960.66, "text": "Oh, oh, oh, oh."}, {"id": 422, "start": 3960.66, "end": 3975.66, "text": "Oh, oh, oh, oh."}, {"id": 423, "start": 3975.66, "end": 3990.66, "text": "Oh, oh, oh, oh."}, {"id": 424, "start": 3990.66, "end": 4005.66, "text": "Oh, oh, oh."}, {"id": 425, "start": 4005.66, "end": 4020.66, "text": "Oh, oh, oh."}, {"id": 426, "start": 4020.66, "end": 4035.66, "text": "Oh, oh, oh."}, {"id": 427, "start": 4035.66, "end": 4050.66, "text": "Oh, oh, oh."}, {"id": 428, "start": 4050.66, "end": 4065.66, "text": "Oh, oh, oh."}, {"id": 429, "start": 4065.66, "end": 4080.66, "text": "Oh, oh, oh."}, {"id": 430, "start": 4080.66, "end": 4095.66, "text": "Oh, oh, oh."}, {"id": 431, "start": 4095.66, "end": 4110.66, "text": "Oh, oh, oh."}, {"id": 432, "start": 4110.66, "end": 4125.66, "text": "Oh, oh, oh."}, {"id": 433, "start": 4125.66, "end": 4140.66, "text": "Oh, oh, oh."}, {"id": 434, "start": 4140.66, "end": 4155.66, "text": "Oh, oh, oh."}, {"id": 435, "start": 4155.66, "end": 4170.66, "text": "Oh, oh, oh."}, {"id": 436, "start": 4170.66, "end": 4185.66, "text": "Oh, oh, oh."}, {"id": 437, "start": 4185.66, "end": 4200.66, "text": "Oh, oh, oh."}, {"id": 438, "start": 4200.66, "end": 4215.66, "text": "Oh, oh, oh."}, {"id": 439, "start": 4215.66, "end": 4230.66, "text": "Oh, oh, oh."}, {"id": 440, "start": 4230.66, "end": 4245.66, "text": "Oh, oh, oh."}, {"id": 441, "start": 4245.66, "end": 4260.66, "text": "Oh, oh, oh."}, {"id": 442, "start": 4260.66, "end": 4275.66, "text": "Oh, oh, oh."}, {"id": 443, "start": 4275.66, "end": 4290.66, "text": "Oh, oh, oh."}, {"id": 444, "start": 4290.66, "end": 4305.66, "text": "Oh, oh, oh."}, {"id": 445, "start": 4305.66, "end": 4320.66, "text": "Oh, oh, oh."}, {"id": 446, "start": 4320.66, "end": 4334.66, "text": "Oh, oh, oh."}, {"id": 447, "start": 4334.66, "end": 4349.66, "text": "Oh, oh, oh."}, {"id": 448, "start": 4349.66, "end": 4364.66, "text": "Oh, oh, oh."}, {"id": 449, "start": 4364.66, "end": 4379.66, "text": "Oh, oh, oh."}, {"id": 450, "start": 4379.66, "end": 4394.66, "text": "Oh, oh, oh."}, {"id": 451, "start": 4394.66, "end": 4409.66, "text": "Oh, oh, oh."}, {"id": 452, "start": 4409.66, "end": 4424.66, "text": "Oh, oh, oh."}, {"id": 453, "start": 4424.66, "end": 4439.66, "text": "Oh, oh, oh."}, {"id": 454, "start": 4439.66, "end": 4454.66, "text": "Oh, oh, oh."}, {"id": 455, "start": 4454.66, "end": 4469.66, "text": "Oh, oh, oh."}, {"id": 456, "start": 4469.66, "end": 4497.66, "text": "Oh, oh, oh."}, {"id": 457, "start": 4497.66, "end": 4512.66, "text": "Oh, oh, oh."}, {"id": 458, "start": 4512.66, "end": 4526.66, "text": "Oh, oh, oh."}, {"id": 459, "start": 4526.66, "end": 4553.66, "text": "Oh, oh, oh."}, {"id": 460, "start": 4553.66, "end": 4570.06, "text": "nur"}, {"id": 461, "start": 4570.06, "end": 4574.02, "text": "aber es hört sich halt auch einfach vieles dieser"}, {"id": 462, "start": 4574.02, "end": 4576.22, "text": "dieser dieser Soundtrack"}, {"id": 463, "start": 4576.22, "end": 4579.14, "text": "ne das heißt es sind kein Soundtrack da gibt es eine eigene Musikrichtung diese"}, {"id": 464, "start": 4579.14, "end": 4580.18, "text": "diese Trailer Musik da"}, {"id": 465, "start": 4580.18, "end": 4583.54, "text": "hört sich vieles relativ ähnlich an"}, {"id": 466, "start": 4583.54, "end": 4588.66, "text": "also oftmals denkt man hey das kenn ich und dabei kennt man das gar nicht"}, {"id": 467, "start": 4588.66, "end": 4589.86, "text": "das kenn ich nämlich gar nicht"}, {"id": 468, "start": 4589.86, "end": 4595.4, "text": "hat sich so eingegangen wie was anderes"}, {"id": 469, "start": 4595.4, "end": 4599.18, "text": "dann noch den obligatorischen Fake"}, {"id": 470, "start": 4599.18, "end": 4606.18, "text": "Latein Chor"}, {"id": 471, "start": 4620.42, "end": 4625.54, "text": "deswegen kann man sich auch an dieser Ultra-Epic Musik schnell satt hören"}, {"id": 472, "start": 4625.54, "end": 4627.7, "text": "weil es hört sich vieles"}, {"id": 473, "start": 4627.7, "end": 4631.18, "text": "verdammt ähnlich an"}, {"id": 474, "start": 4631.18, "end": 4633.02, "text": "so man nehme einfach"}, {"id": 475, "start": 4633.02, "end": 4635.88, "text": "30 Milliarden Streichinstrumente"}, {"id": 476, "start": 4635.88, "end": 4638.46, "text": "dann tippt er ab und zu mal auf die Drommelhaut"}, {"id": 477, "start": 4638.46, "end": 4641.94, "text": "und ein Fake Latein Chor"}, {"id": 478, "start": 4641.94, "end": 4644.78, "text": "doch das kenn ich"}, {"id": 479, "start": 4644.78, "end": 4650.34, "text": "das ist nicht Heart of Courage, das ist irgendwas Courage"}, {"id": 480, "start": 4650.34, "end": 4651.94, "text": "das ist Heart of Courage"}, {"id": 481, "start": 4651.94, "end": 4654.62, "text": "aber hört sich ähnlich an"}, {"id": 482, "start": 4654.62, "end": 4660.14, "text": "2 Steps from Hell"}, {"id": 483, "start": 4660.14, "end": 4662.5, "text": "das hört sich alles so an"}, {"id": 484, "start": 4662.5, "end": 4669.5, "text": "nicht das Schlechteste, das hört sich einfach alles so an"}, {"id": 485, "start": 4669.5, "end": 4676.5, "text": "kann jetzt mal dieses Scheiß Overlay hier weggehen"}, {"id": 486, "start": 4676.5, "end": 4693.5, "text": "hallo Overlay, verpiss dich mal"}, {"id": 487, "start": 4706.5, "end": 4719.66, "text": "ich hab Half-Life durchgespielt, mittlerweile Evo-Lehren"}, {"id": 488, "start": 4719.66, "end": 4740.66, "text": "ich warte jetzt noch, dass die Xen-Levels rauskommen, gibt's da was neues?"}, {"id": 489, "start": 4749.66, "end": 4774.66, "text": "ja, gibt's was Neues zu Xen-Levels?"}, {"id": 490, "start": 4774.66, "end": 4781.66, "text": "was weiß das hier Mann?"}, {"id": 491, "start": 4781.66, "end": 4808.66, "text": "Evo-Klingelteile da vorne, ah ne, das ist ein Discord"}, {"id": 492, "start": 4808.66, "end": 4821.66, "text": "wir müssen jetzt noch mal kurz was anderes anmachen"}, {"id": 493, "start": 4821.66, "end": 4830.66, "text": "ok, ja Karsten, das passt, dann geh ich auch, ich geh dann auch pennen"}, {"id": 494, "start": 4830.66, "end": 4833.66, "text": "wenn du"}, {"id": 495, "start": 4833.66, "end": 4851.66, "text": "wenn du Karsten, wenn du Karsten auf Kamos dann"}, {"id": 496, "start": 4851.66, "end": 4863.66, "text": "ja, Sentinel auf Kod habe ich schon"}, {"id": 497, "start": 4942.66, "end": 4949.66, "text": "ok, ja, das passt, dann geh ich auch, ich geh dann auch"}, {"id": 498, "start": 4949.66, "end": 4958.66, "text": "ok, ja, Sentinel auf Kamos dann"}, {"id": 499, "start": 4958.66, "end": 4969.66, "text": "ok, ja, Sentinel auf Kamos dann"}, {"id": 500, "start": 4969.66, "end": 4971.66, "text": "Das war's für heute."}, {"id": 501, "start": 4971.66, "end": 4999.66, "text": "Das war's für heute."}, {"id": 502, "start": 5091.66, "end": 5092.66, "text": "Das war's für heute."}, {"id": 503, "start": 5092.66, "end": 5093.66, "text": "Das war's für heute."}, {"id": 504, "start": 5093.66, "end": 5095.66, "text": "Das war's für heute."}, {"id": 505, "start": 5095.66, "end": 5123.66, "text": "Das war's für heute."}, {"id": 506, "start": 5155.66, "end": 5157.66, "text": "Das war's für heute."}, {"id": 507, "start": 5157.66, "end": 5159.66, "text": "Das war's für heute."}, {"id": 508, "start": 5159.66, "end": 5161.66, "text": "Das war's für heute."}, {"id": 509, "start": 5161.66, "end": 5163.66, "text": "Das war's für heute."}, {"id": 510, "start": 5163.66, "end": 5173.66, "text": "Das war's für heute."}, {"id": 511, "start": 5173.66, "end": 5175.66, "text": "Das war's für heute."}, {"id": 512, "start": 5175.66, "end": 5179.66, "text": "Das war's für heute."}, {"id": 513, "start": 5179.66, "end": 5181.66, "text": "Das war's für heute."}, {"id": 514, "start": 5181.66, "end": 5209.66, "text": "Das war's für heute."}, {"id": 515, "start": 5212.66, "end": 5217.66, "text": "Das war's für heute."}, {"id": 516, "start": 5217.66, "end": 5234.66, "text": "Das war's für heute."}, {"id": 517, "start": 5234.66, "end": 5239.66, "text": "Das war's für heute."}, {"id": 518, "start": 5239.66, "end": 5241.66, "text": "Das war's für heute."}, {"id": 519, "start": 5241.66, "end": 5269.66, "text": "Das war's für heute."}, {"id": 520, "start": 5271.66, "end": 5273.66, "text": "Das war's für heute."}, {"id": 521, "start": 5273.66, "end": 5275.66, "text": "Das war's für heute."}, {"id": 522, "start": 5275.66, "end": 5277.66, "text": "Das war's für heute."}, {"id": 523, "start": 5277.66, "end": 5279.66, "text": "Das war's für heute."}, {"id": 524, "start": 5279.66, "end": 5281.66, "text": "Das war's für heute."}, {"id": 525, "start": 5281.66, "end": 5283.66, "text": "Das war's für heute."}, {"id": 526, "start": 5283.66, "end": 5285.66, "text": "Das war's für heute."}, {"id": 527, "start": 5285.66, "end": 5287.66, "text": "Das war's für heute."}, {"id": 528, "start": 5287.66, "end": 5289.66, "text": "Das war's für heute."}, {"id": 529, "start": 5289.66, "end": 5317.66, "text": "Das war's für heute."}, {"id": 530, "start": 5349.66, "end": 5350.66, "text": "Das war's für heute."}, {"id": 531, "start": 5350.66, "end": 5351.66, "text": "Das war's für heute."}, {"id": 532, "start": 5351.66, "end": 5352.66, "text": "Das war's für heute."}, {"id": 533, "start": 5352.66, "end": 5353.66, "text": "Das war's für heute."}, {"id": 534, "start": 5353.66, "end": 5354.66, "text": "Das war's für heute."}, {"id": 535, "start": 5354.66, "end": 5355.66, "text": "Das war's für heute."}, {"id": 536, "start": 5355.66, "end": 5356.66, "text": "Das war's für heute."}, {"id": 537, "start": 5356.66, "end": 5357.66, "text": "Das war's für heute."}, {"id": 538, "start": 5357.66, "end": 5358.66, "text": "Das war's für heute."}, {"id": 539, "start": 5358.66, "end": 5360.66, "text": "Das war's für heute."}, {"id": 540, "start": 5360.66, "end": 5388.66, "text": "Das war's für heute."}, {"id": 541, "start": 5390.66, "end": 5392.66, "text": "Das war's für heute."}, {"id": 542, "start": 5392.66, "end": 5394.66, "text": "Das war's für heute."}, {"id": 543, "start": 5394.66, "end": 5396.66, "text": "Das war's für heute."}, {"id": 544, "start": 5396.66, "end": 5398.66, "text": "Das war's für heute."}, {"id": 545, "start": 5398.66, "end": 5400.66, "text": "Das war's für heute."}, {"id": 546, "start": 5400.66, "end": 5402.66, "text": "Das war's für heute."}, {"id": 547, "start": 5402.66, "end": 5404.66, "text": "Das war's für heute."}, {"id": 548, "start": 5404.66, "end": 5406.66, "text": "Das war's für heute."}, {"id": 549, "start": 5406.66, "end": 5408.66, "text": "Das war's für heute."}, {"id": 550, "start": 5408.66, "end": 5410.66, "text": "Das war's für heute."}, {"id": 551, "start": 5410.66, "end": 5412.66, "text": "Das war's für heute."}, {"id": 552, "start": 5412.66, "end": 5414.66, "text": "Das war's für heute."}, {"id": 553, "start": 5414.66, "end": 5416.66, "text": "Das war's für heute."}, {"id": 554, "start": 5416.66, "end": 5418.66, "text": "Das war's für heute."}, {"id": 555, "start": 5418.66, "end": 5420.66, "text": "Das war's für heute."}, {"id": 556, "start": 5420.66, "end": 5448.66, "text": "Das war's für heute."}, {"id": 557, "start": 5450.66, "end": 5452.66, "text": "Das war's für heute."}, {"id": 558, "start": 5452.66, "end": 5454.66, "text": "Das war's für heute."}, {"id": 559, "start": 5454.66, "end": 5456.66, "text": "Das war's für heute."}, {"id": 560, "start": 5456.66, "end": 5458.66, "text": "Das war's für heute."}, {"id": 561, "start": 5458.66, "end": 5460.66, "text": "Das war's für heute."}, {"id": 562, "start": 5460.66, "end": 5488.66, "text": "Das war's für heute."}, {"id": 563, "start": 5550.66, "end": 5552.66, "text": "So geht's los!"}, {"id": 564, "start": 5552.66, "end": 5554.66, "text": "Das war's für heute!"}, {"id": 565, "start": 5554.66, "end": 5556.66, "text": "Das war's für heute!"}, {"id": 566, "start": 5556.66, "end": 5558.66, "text": "Das war's für heute!"}, {"id": 567, "start": 5558.66, "end": 5560.66, "text": "Das war's für heute!"}, {"id": 568, "start": 5560.66, "end": 5562.66, "text": "Das war's für heute!"}, {"id": 569, "start": 5562.66, "end": 5564.66, "text": "Das war's für heute!"}, {"id": 570, "start": 5564.66, "end": 5566.66, "text": "Das war's für heute!"}, {"id": 571, "start": 5566.66, "end": 5568.66, "text": "Das war's für heute!"}, {"id": 572, "start": 5568.66, "end": 5570.66, "text": "Das war's für heute!"}, {"id": 573, "start": 5570.66, "end": 5572.66, "text": "Das war's für heute!"}, {"id": 574, "start": 5572.66, "end": 5574.66, "text": "Das war's für heute!"}, {"id": 575, "start": 5574.66, "end": 5576.66, "text": "Das war's für heute!"}, {"id": 576, "start": 5576.66, "end": 5578.66, "text": "Das war's für heute!"}, {"id": 577, "start": 5578.66, "end": 5580.66, "text": "Das war's für heute."}, {"id": 578, "start": 5580.66, "end": 5608.66, "text": "Das war's für heute."}, {"id": 579, "start": 5610.66, "end": 5623.66, "text": "Das war's für heute."}, {"id": 580, "start": 5623.66, "end": 5630.66, "text": "Das war's für heute."}, {"id": 581, "start": 5630.66, "end": 5636.66, "text": "Das war's für heute."}, {"id": 582, "start": 5636.66, "end": 5639.66, "text": "Das war's für heute."}, {"id": 583, "start": 5639.66, "end": 5641.66, "text": "Das war's für heute."}, {"id": 584, "start": 5641.66, "end": 5669.66, "text": "Das war's für heute."}, {"id": 585, "start": 5671.66, "end": 5675.66, "text": "Das war's für heute"}, {"id": 586, "start": 5675.66, "end": 5677.66, "text": "Das war's für heute"}, {"id": 587, "start": 5677.66, "end": 5679.66, "text": "Das war's für heute."}, {"id": 588, "start": 5679.66, "end": 5707.66, "text": "Das war's für heute."}, {"id": 589, "start": 5709.66, "end": 5728.66, "text": "Das war's für heute, das war's für heute!"}, {"id": 590, "start": 5728.66, "end": 5730.66, "text": "Das war's für heute."}, {"id": 591, "start": 5730.66, "end": 5758.66, "text": "Das war's für heute."}, {"id": 592, "start": 5760.66, "end": 5762.66, "text": "Das war's für heute."}, {"id": 593, "start": 5762.66, "end": 5764.66, "text": "Das war's für heute."}, {"id": 594, "start": 5764.66, "end": 5766.66, "text": "Das war's für heute."}, {"id": 595, "start": 5766.66, "end": 5768.66, "text": "Das war's für heute."}, {"id": 596, "start": 5768.66, "end": 5770.66, "text": "Das war's für heute."}, {"id": 597, "start": 5770.66, "end": 5772.66, "text": "Das war's für heute."}, {"id": 598, "start": 5772.66, "end": 5772.14, "text": "Das war's für heute"}, {"id": 599, "start": 5773.14, "end": 5777.14, "text": "Das war's für heute."}, {"id": 600, "start": 5777.14, "end": 5779.14, "text": "Das war's für heute."}, {"id": 601, "start": 5765.14, "end": 5779.14, "text": "Das war's für heute."}, {"id": 602, "start": 5779.14, "end": 5781.14, "text": "Das war's für heute."}, {"id": 603, "start": 5781.14, "end": 5783.14, "text": "Das war's für heute."}, {"id": 604, "start": 5784.14, "end": 5786.14, "text": "Das war's für heute."}, {"id": 605, "start": 5786.14, "end": 5788.14, "text": "Das war's für heute."}, {"id": 606, "start": 5788.14, "end": 5790.14, "text": "Das war's für heute."}, {"id": 607, "start": 5790.14, "end": 5818.14, "text": "Das war's für heute."}, {"id": 608, "start": 5820.14, "end": 5823.14, "text": "Das war's für heute."}, {"id": 609, "start": 5823.14, "end": 5842.14, "text": "Das war's für heute."}, {"id": 610, "start": 5842.14, "end": 5844.14, "text": "Das war's für heute."}, {"id": 611, "start": 5844.14, "end": 5872.14, "text": "Das war's für heute."}, {"id": 612, "start": 5934.14, "end": 5963.14, "text": "Schau, ich hab gar keine Starch."}, {"id": 613, "start": 5963.14, "end": 5967.14, "text": "Oah, schon fertig."}, {"id": 614, "start": 5973.14, "end": 5976.14, "text": "Aha, para ist Geld, okay."}, {"id": 615, "start": 5976.14, "end": 5978.14, "text": "Wobei, ein Haftbefehl ist jetzt nicht para."}, {"id": 616, "start": 5978.14, "end": 5980.14, "text": "Das ist dann wenn schon para oder so, para."}, {"id": 617, "start": 5980.14, "end": 5990.14, "text": "So, was könnte ich jetzt hier nochmal für eine Musik schön zum Ausklang spielen?"}, {"id": 618, "start": 5996.14, "end": 5998.14, "text": "Was könnte man?"}, {"id": 619, "start": 5998.14, "end": 6000.14, "text": "Oh!"}, {"id": 620, "start": 6000.14, "end": 6002.14, "text": "Was zeigt mir denn hier gerade?"}, {"id": 621, "start": 6002.14, "end": 6009.14, "text": "Oh nee, jetzt hätte ich mal besser nicht angucken sollen."}, {"id": 622, "start": 6009.14, "end": 6016.14, "text": "Ich hab gerade gesehen, dass es Gameplay zum neuen Secret of Mana Remake gibt."}, {"id": 623, "start": 6016.14, "end": 6021.14, "text": "Und das bestärkt ja schon meine ganzen Befürchtungen zu dem Remake."}, {"id": 624, "start": 6021.14, "end": 6025.14, "text": "Was könnte ich denn?"}, {"id": 625, "start": 6025.14, "end": 6035.14, "text": "Time to say goodbye, das ist eigentlich ein gutes Outro."}, {"id": 626, "start": 6035.14, "end": 6037.14, "text": "Ich hab ja schon ein Outro."}, {"id": 627, "start": 6037.14, "end": 6041.14, "text": "Hab ich schon ein extrem Outro."}, {"id": 628, "start": 6041.14, "end": 6052.14, "text": "So Leute, ich geh jetzt schlafen."}, {"id": 629, "start": 6052.14, "end": 6072.14, "text": "Bis zum nächsten Mal, tschüss."}, {"id": 630, "start": 6112.14, "end": 6114.14, "text": "Tschüss."}, {"id": 631, "start": 6142.14, "end": 6144.14, "text": "Tschüss."}, {"id": 632, "start": 6172.14, "end": 6174.14, "text": "Tschüss."}]}