{"text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal. So, Leute. Ups, ich sollte mir vielleicht mal den Netzrad auch richtig aufsetzen. Ich bin noch am Start. Ja, also ich meine, im Titel steht zwar Geburtstagstream, das stimmt auch, aber wir werden nichts Besonderes als Geburtstagstream machen. Das Einzige, was ich jetzt noch mal kurz ausprobieren muss, ist, ob mein Weep-TTS auch Qt-Chat sagen kann. Qt-Chat, ach nee. Warum crash das? Warum crash das, wenn ich das umstelle? Das habe ich doch irgendwie kacke programmiert wieder. Grip. Warum crash das, wenn ich, vielleicht habe ich da irgendwie einen Bug, dass ich das zusammenschreiben muss oder so. Also, Qt-Chat, Qt-Chat. Was? Was? Moment, was? Das ist, das passt. Qt-Chat. Qt-Chat. Ja, das ist gut. Qt-Chat. Qt-Chat. Prime. Subscriber. So, rauhe jetzt zu. Zweimal U? Moment, war es so hier? Nee. Nein, das funktioniert nicht. Der Sebaro ist wieder da. Der Qt-Chat hatte ich schon vermisst das letzte Mal, da hat jeder alle fünf Minuten gefragt, wo ist denn der Sebaro. Ja, funktioniert am besten. Ja, Leute. Also, wie gesagt, ich habe es in den Streamtitel geschrieben, Geburtstag und so, aber wir machen heute nichts irgendwie Birthday-mäßiges. Ja, warte mal zu. Irgendwie hat es ihn ein bisschen verschoben, kann das sein? War da nicht eben da? Oh, 500 Bits, Dankeschön. Big Brain-Chat heute wieder. Ja, also, wir machen heute nichts großartig Birthday-mäßiges. Wir basteln weiter an unserer Paketverfolgungs-App. Heute werden wir ein paar Sachen ausprobieren, unter anderem Browser Fernsteuern und Chrome Fernsteuern mit.NET. Und vielleicht probieren wir die UPS-App noch aus. Also, wir probieren heute aus, ob wir es schaffen, aus unserem.NET Programm einen Chrome Fernsteuern, allerdings einen Headless-Chrome, also sprich, genau Desmond, so sieht es aus, der kennt sich aus, der weiß Bescheid. Und da muss natürlich Headless sein, also wir wollen den Chrome ja nicht sehen, das wäre sonst eben ein bisschen langweilig. Hab ich noch nicht gemacht, aus.NET raus, die offizielle Library ist Node. Node.js ist das, das ist das hier. Hat nur 52.000 GitHub-Sterne. Das ist quasi die offizielle, von Chrome API zum Chrome Remote Fernsteuern. Was sagen sie denn selbst? Sie sagen hier Headless-Chrome API, ja genau. Und die gibt es allerdings auch, da gibt es allerdings auch eine.NET Version, habe ich gesehen. Und die probieren wir mal aus, denn für unser Paket-Tracking, Puppeteer Sharp, die wir brauchen, weil um unser Paket-Tracking zu machen, ich meine, wir haben eine API von DHL und wir haben eine API von DPD und wir haben eine API von UPS. Mal gucken, wie gut das funktioniert. Von Hermes haben wir schon mal gar keinen und von Amazon auch nicht. Das heißt, wir werden auf jeden Fall ein paar Webseiten parsen müssen, da kommen wir nicht drum herum. Und ich hätte auch gerne so einen Fallback-Tracking, also sprich, sollten irgendwie die API-Aufrufe aufgebraucht sein für DHL oder sollte DHL oder irgendein anderer Anbieter was an seiner Seite geändert haben, seine API geändert haben, das ist dann, dass man so eine Fallback-Seite für Tracking hat. Und was es dafür gibt, ist hier so eine China, ich glaube, das ist eine China-Seite. Da kann man hier seine Pakete eingeben. Ich suche mal kurz raus, ich hatte das letzte Mal auch welche. Hier zum Beispiel hat mir letztens jemand eine Hermes-Paket-Nummer gegeben und da sagt er Not Found. Hermes, multiple, oder was? DPD? War es gar kein Hermes? Kann der überhaupt Hermes? Hermes? Hermes? Hermes.de? Mal gucken, hat mir letztens im Stream einer zum Test eine Tracking-Nummer von Hermes gegeben. Okay, der trackt sich da kaputt. Dann probieren wir das jetzt nochmal mit DPD aus, ich habe noch ein DPD-Paket hier. DPD, DPD. Ja doch, hier, okay, Hermes Germany. So, und die Seite hätte ich gerne als Fallback und vielleicht verwenden wir die auch für sowas wie Hermes, die halt selbst keine AP anbieten, um Pakete zu verfolgen. Das ist relativ armselig irgendwie, also armselig, Anführungsstrichen, also ich meine, es ist denen ihr gutes Recht zu sagen, sie bieten keine AP an, aber ich meine, warum nicht? Die haben die Tracking-Informationen eh, es ist besser, die bieten offizielle AP an, wie das die Leute mit irgendwie komischen Webseiten und Parsing rumhantieren müssen. Brauchst du noch ein DHL-Sendungscode? Ja, kann ich schaden, kann ich schaden. Kann ich schaden, ich meine, ich brauche viele Testing Codes, aber dann so weit sind auch mal ein paar Testing Codes, wo man hier so einen Zwischenschritt testen kann, übrigens die Sprache müssen wir dann umstellen, nicht auf Deutsch, sondern auf Englisch, falls das funktioniert. Genau, und die Webseite müssen wir irgendwie parsen. Heute Frankfurt Vollsperrung, angeblich war das, weil irgendwelche Leute am Hauptbahnhof, ups, warte, angeblich hat die Polizei Frankfurt gesagt, die Sperrung am Hauptbahnhof war, weil irgendwelche Leute Schließfächer aufgebrochen haben und abgehauen sind. DHL, oh nice, danke. Leute, irgendwelche Schließfächer am Hauptbahnhof aufgebrochen haben, wir können doch gerade mal gucken. Twitter, Polizei, Frankfurt. Und es gab wohl irgendwie, also ich weiß nicht, müssen wir mal lesen. Ich glaube, ich habe gelesen, es gab einen Schusswechsel zwischen Polizei und den Dudes. Nee, die Polizei hat geschossen, also es gab keinen Schusswechsel, sondern wahrscheinlich irgendwelche Warnschüsse, oder um die Typen zu erwischen, keine Ahnung, was auch immer. Das war heute in Frankfurt. Hatten sich an einer Bank am Bahnhof unerlaubt Zugriff auf Schließfächer verschafft, also im Prinzip ein Banküberfall, wenn man es so will. Können Sie mal einen offiziellen Report angucken. Heute Nachmittag gegen 5 Uhr kam es auf der Düsseldorfer Straße, das ist wirklich direkt, das ist die Straße direkt über am Hauptbahnhof, die Düsseldorfer Straße. Das ist das, was quasi angrenzt am Hauptbahnhof. Da ist der Hauptbahnhof und da ist die Düsseldorfer Straße. Das geht wirklich direkt, das ist das, was direkt am Hauptbahnhof vorbeigeht. Irgendwo da haben sie eine Bank überfallen anscheinend. Mehrere Personen hatten sich in der Bank unerlaubt Zugriff auf Schließfächer verschafft und dabei den Alarm ausgerissen. Scheinen jetzt nicht die big brainsten Banküberfall Leute gewesen zu sein. Anschließend flüchten sie in einem Fahrzeug in Richtung Hauptbahnhof. Moment. Da wären sie wahrscheinlich zu Fuß schneller gewesen, das ist ja direkt um die Ecke. Drei Männer wurden mittlerweile festgenommen. Die Fahnung nach weiteren Personen bleibt weiterhin bestehen. Zu Beginn der Flucht kam es zu einer Schussabgabe seitens der Polizei, dabei wurde er zufolge niemand verletzt. Wobei man mal sagen muss, wenn eine Bank überfällt, da muss er mit Rechnen auch verletzt zu werden. Der öffentliche Person war zwischenseitig... Ah ja, das war komplett gesperrt. Komplett durch alles. Also ging gar nichts mehr an der Ecke. Ok, mehr gibt es nicht. Das ist kurz und knackig. Ja, das war heute Banküberfall Frankfurt. Ich sagte doch, in Frankfurt geht es in letzter Zeit übelst ab. Vor allem hast du in Frankfurt immer mehr Gestörte unterwegs. Immer mehr Gestörte, immer mehr Drogenabhängige, vielleicht nicht mehr, aber immer noch auf ausreichendem Niveau. Mehr braucht man davon nicht. Ich glaube nicht, dass ich das auch nur ansatzweise... Also am Hauptbahnhof war eher Oceans 420 angesagt, wenn ich mir die Leute angucke. Ohne 420 hätten sie sich wahrscheinlich gar nicht getraut, den Bank zu überfallen. Zum Glück hat mich mein Chef heimgefahren. Hast du Glück, dass du netten Chef hast. Du bist nicht zufällig 25 weiblich und siehst gut aus. Da würde ich mir Gedanken machen, warum dich dein Chef heimgefahren hat. Aber wenn dich dein Chef einfach so eingefahren hat, ist dein Chef wahrscheinlich einfach nett. Ach, Sebao, das ist praktisch, ja. Ach hier, das Siki, 24 Hermes-Code. Brauchen wir auch noch. Jawoll, schreibe ich mir auf. Dankeschön. Ich kann nur Codes benutzen, die innerhalb der letzten 120 Tage verschickt wurden zum Testen, weil danach schmeißen die ganzen Anbieter ihre Sachen weg. Halbes Kriegsgebiet in Frankfurt. Ohne Scheiß, in letzter Zeit ist da echt was los. Also manchmal hast du echt Bedenken, da lang zu laufen. Vielleicht gefällt es auch deinem Chef in der heutigen Zeit, dass das alles kein Problem war. Aber ich vermute, dass dein Chef einfach nur nett ist. DHL-Code, Triple X. Schreibe ich mir auch noch auf. Also DHL-Tracking habe ich jetzt jede Menge. Woran liegt das denn? Gute Frage, woran das liegt. Also es ist merkwürdig in Frankfurt. Also es ist prinzipiell so viel, also Bahnöfen um Hauptbahnhof und so, ist so viel Bahnsecurity wie noch nie eigentlich unterwegs. Und auch Polizei ist relativ viel in Frankfurt unterwegs. Wir sagen einfach, dass generell die Gewaltbereitschaft der Leute höher ist als früher. Das wird es wahrscheinlich hauptsächlich sein. Ja, Maske 95, das spielt er auf jeden Fall mit rein. Auf jeden Fall. Und was auch mit rein spielt ist, dass sich die Art der Drogen, die sich die Leute am Hauptbahnhof reinhauen geändert hat. Also früher haben die sich, früher hast du dann oftmals einen zwischen zwei Autos sitzen sehen. Der hat sich immer seinen, was war denn das wohl? Heroin oder so auf seiner Fanta-Dose aufgewärmt. Das hast du früher immer gesehen. Ich wusste gar nicht, wozu Fanta-Dosen alles gut sind, bevor ich regelmäßig nach Frankfurt gefahren bin. Da haben die sich früher immer die Dosen aus dem Mülleimer geholt und haben die aufgeschnitten. Und haben sich dann irgendwo in die Ecke gesetzt und quasi auf der Dose umgedreht. Und haben dann so ein Feuerchen unter der Dose gemacht. Das ist dann so ein Mini-Kamin quasi, wenn du das richtig machst in der Dose. Und haben dann oben drauf ihr Zeug gekocht und aufgezogen. So und das, das, das in Anführungsstrichen schöne daran, das war absolut big play. Also was das angeht, waren die echt, waren die echter Fender echt, ne? Ja und das in Anführungsstrichen schöne daran war, dass die nicht aggressiv waren. Die waren, oder selten aggressiv waren, die waren einfach nur fertig mit der Welt. Die haben einfach nur rumgehongen den ganzen Tag. Und das, das Beste, was die irgendwie rausgekriegt haben, wenn du vorbeigelaufen bist, war mal irgendwie... Oder irgendwie sowas, ja? Mehr, mehr ging da im Endeffekt nicht. So und mittlerweile ist, siehst halt kaum noch Leute da, die sich irgendwie Heroin spritzen. Also das Heftigste, was bei, vor ein paar Jahren war mal, da ist bei uns, also direkt schräg gegenüber, auf der Straße weiter vom Hauptbahnhof, ist so ein Wäschesalon. Das ist halt so, weißt du, so mit öffentlichen Waschmaschinen und sowas. Und da standen die halt mittags, während die auf ihre Wäsche gewartet haben, ja ich meine auch Drogenabhängige müssen ihre Wäsche verarschen, standen die dort in der Tür, haben dich angegrinst. Und du hast so gedacht, der guckte aber schon komisch und hast gesehen, da ist eine Spritze im Arm hängen. Das war, diese Anblick, das war für mich so Frankfurt pur, ja? Da ist so, oh fuck, geh weg, ey, was ist da los? Ja und ich glaube, das trägt auch dazu bei, dass es heute, gefühlt zumindest so, wie man das beobachten kann, wenige Heroinabhängige gibt in Frankfurt, sondern die rauchen alle irgendwas. Und ich glaube, das Teufel, was die sich da reinpfeifen heute und was die da heute sich reinhauen, macht die Leute, glaube ich, aggressiver als Heroin. Aber die Polizeistatistik soll wohl sagen, Heroin kommt, hat alles, kann schon sein, kann schon sein. Aber ich sehe sehr, ich sehe viel weniger als früher, welche, die sich was spritzen, sondern die rauchen alle irgendwas und ich glaube, das macht, also das, was auch immer die da rauchen, macht die Leute aggressiver als früher. Das ist bestimmt Krokodil, war Krokodil nicht dieses komische russisch zusammengemischte Hinterhof, Drogenzeug? Wie lange lebst du schon in Frankfurt? Ich lebe ja nicht direkt in Frankfurt, ich wohne ein bisschen, ich wohne ein bisschen nebendran, aber ich fahre schon seit, also ich regelmäßig, auf die Arbeit fahre ich da seit, wo liegen sie da zu, 15? Ah, nicht ganz, 15 Jahre? Nicht ganz, seit 2007 ungefähr. Bisschen früher schon, aber ich bin früher auch immer regelmäßig in Frankfurt gewesen, das ist einfach die größte Stadt in der Nähe, da ist auch im Prinzip immer was los, du kriegst alles Mögliche, also nicht das, was jetzt, wenn ich das so sage, vorher erst eine halbe Stunde, ja fast mein Teil, fast mein Teil. Du kriegst halt alle möglichen Sachen, die du brauchst, sei es von Hardware, oder sei es eigentlich nur was, was Snackerea machen, und ich glaube, es liegt daran, dass die Leute heute aggressiver sind als früher an dem, was sie sich reinhauen. Ich weiß nicht, ob ihr das mitgekriegt habt, vor ein paar Jahren, äh, nicht vor ein paar Jahren, vor ein paar Tagen, das war ja ganz groß in der Presse, da haben sich ja alle darüber ausgelassen, dass ein, mittlerweile weiß man es ja, dass man das jetzt zusammenkriege, ein, jemand aus Eritrea, also aus Afrika, der in der Schweiz gelebt hat, und Illy, also der quasi aus der Schweiz abgehauen ist, weil sie ihn gesucht haben, hatte er in Frankfurt Frau plus Kinder von Zug geschmissen, das ging ja komplett durch die Presse, das haben wahrscheinlich alle mehr oder weniger mitgekriegt, also in Frankfurt ist in letzter Zeit wirklich was los, da geht es echt ab, und was ja auch geil ist, ne, die logische, also die big brain Konsequenz, die sie jetzt daraus ziehen wollen, ist ja, ähm, Barrieren am Bahnsteig aufzustellen, wo ich mir auch gedacht habe, wäre es nicht vielleicht sinnvoller, irgendwie dafür zu sorgen, dass Leute nicht vor den Zug geschmissen werden, anstatt jetzt Barrieren aufzustellen, dass Leute nicht mehr so einfach vor den Zug geworfen werden können, das klingt für mich irgendwie voll abstrusso, wenn ich mir das so, wenn ich mir das so anhör, ja, the fuck, ich hatte noch nie Bedenken, dass mich irgendjemand vor den Zug wirft, so vielleicht jetzt, ja, ja, das ist echt irgendwie verkehrt rum, ja, man sollte doch dafür sorgen, dass das nicht vorkommt und nicht, dass es schwieriger ist, das verstehe ich nicht so genau, also das leuchtet mir nicht ein, Frankfurt ist in Deutschland auch die Stadt, wo viele den American Dream suchen, naja gut, ähm, was Banken angeht, gibt es ja in, gibt es ja nicht viel Vergleichbares in Deutschland oder in Europa, warst du schon mal bei Helter Steine, nein, aber ich habe den letztens gesehen, der ist mir letztens entgegengelaufen, ich dachte mir so, wo will ich zum Südbahnhof, den hast du, den kennst du doch, den hast du schon mal irgendwo gesehen und da habe ich darüber nachgedacht, da habe ich mir gedacht, das war 100% Helter Steine. Ja, das ist baru, das stimmt, das muss ich machen, das mache ich vor dem Stream, wo wir das mit den E-Mails gerne ausprobieren. Clocks Royal Mail will ich eigentlich nicht einbauen zum tracken, naja gut, ich würde sagen, da fangen wir mal an, ähm, Visual Studio aufmachen, achso, wisst ihr was wir auch noch machen könnten, ähm, wir könnten uns auch, ich weiß nicht, ob ihr es schon gesehen habt, also ich habe es nicht gesehen, aber ich habe gesehen, dass es das gibt, wir könnten uns mal ein bisschen Ausschnitt von Modern Warfare Gameplay angucken, da gab es wohl gestern ein Stream, wo sie das gezeigt haben, ich habe mir noch nichts davon angeguckt, gar nichts, ich habe nur auf Twitter gelesen, ich habe nur auf Twitter gelesen, dass es wohl verhältnismäßig gut ausschaut und es keine Minimap gibt. Aber eine Konsolen-App, Konsolen-App geht immer. Volle 3 Stunden angucken, ich kann mir keine 3 Stunden Cod angucken, ich habe schon, ich deinstalliere schon Cod nach 3 Stunden spielen, wobei Video angucken ist nicht so belastend wie selber spielen. So wir sind schon bei Konsolen-App 12, das passt natürlich, wir sind ja hier die Konsolen-App-Helden schlechthin in letzter Zeit. Ups, was mache ich denn da? Press any key to exit. Warum gibt es eigentlich als Makro nicht CR für Konsolen-Readline? Ich weiß, dass ich mir das anlegen kann, aber warum ist das nicht standardmäßig drin, das wäre doch Pock, wenn das dabei wäre. Metallica hat einen Cod-Trailer gemacht? Oder meinst du einen neuen Trailer für irgendwas von Metallica, also jetzt nicht irgendwie was mit Cod was zu tun hat. Metallica ist im Trailer, na gut, die haben ja alles mögliche schon durch. Da gucken wir uns mal an, gucken wir uns mal an, also wenn Metallica im Trailer ist, da müssen wir uns das mal angucken. Cod. Vor 23 Stunden. Pock-Musik. Hoffentlich mache ich es nicht zu laut, äh Moment, das ist gar kein Trailer. Ja das ist eindeutig interessant, aber wo ist... Wo ist der Trailer? Ja, nee. Reveal-Song? Trailer-Song? Ja, der hat einen geflame-Haze. Reveal, okay mal MW Reveal, machen wir mal hier mal. Das da, ha? Sagt mir mal ob das der richtige ist, ich habe da einen Link gepostet. Okay, da ist das der richtige. Also was mich schon mal sehr zuversichtlich macht ist das hier. Guck mal. Ich verwirrte es ja immer noch, dass das einfach nur Modern Warfare heißt. Wo ist der Hund? Wo ist der Hund? Ich hab gehofft der Hund kommt wieder. Da, da, da. Grills auch dabei. Das sieht aus wie Kot. Am wenigsten hat es gute Musik drunter. Nein das ist Enter Sandman, eindeutig. Er fängt ja gar nicht an rumzuschreien. Ah gut. Es hat ein bisschen was von Rainbow Six. Huge singing skills. Juggernaut. Moment. Was, was, was, Operation? Ist das jetzt ein Singleplayer Trailer? Nee Multiplayer. Was stand da eben von Operation? Operation? Also der Name erinnert mich voll an Battlefield. Operation Krasna Raid? Was sonst? Was sonst? Wenn uns nichts mehr einfällt ist mal wieder in Russland Invasion angesagt. Wieviel Granaten konnte der gerade schmeißen? Ah nee nur einer. Der Panzer. Oh das Killstreak. Was heißt das Killstreak? Tank Drop, Killstreak oder sowas. Wie soll das funktionieren? Ach was macht der? Moment. Der steckt im Holz drin oder? Deswegen sieht das auch so merkwürdig aus. Der Trailer ist nice. Das gefällt mir. Ich frag mich wo sie die Sprecher immer herkriegen. Wo haben sie die Sprecher immer her? Die hören sich immer alle exakt gleich an. Jetzt hab ich mich erst über den Sprecher lustig gemacht. Ich muss mir mal Gedanken über den Inhalt machen. Warum muss ich Pre-Orderen um Zugang zur Open Beta zu kriegen? Das ist Activision 900 IQ. Das ist die übliche Geschichte, dass er 2 Tage früher spielen darf. Bringt mir eh nix. Ich will nicht erst auf PS4 spielen. Ich möchte erst auf Xbox spielen, aber am liebsten auf allen Plattformen. Ich kann mit dem Playstation Controller nicht spielen. Ich kann so was wie Uncharted spielen. Meine Hände sind nicht PS-Dualshock-kompatibel. Ich weiß, ich habe einen Xbox auf Playstation Adapter. Ich kann es damit theoretisch spielen. Als spielt irgendjemand, der 18 ist dieses Spiel, 60, 70, 80% Leute, die nicht in dem Alter sind. Ich wollte jetzt ein bisschen Progress machen. Dann haben sie wenigstens mal einen, der ordentlich spielen kann. Die Typen, die sind bei diesem 2-on-2-Modus, das war ja nix. Was sonst? Erstmal 3 Stunden Waffenauswahl. Wann geht es ins Game? Keine Mini-Map. Multi-Per-Premier 6-on-6. Das ist nicht 6-on-6-Domination. Wenn du das Game nicht kennst, ist es für alle gleich. Schraut ist jemand, der das Game 5 Stunden spielt. Und jemand anderes spielt das Game 5 Stunden. Der ist einfach doppelt so gut. Ich habe jetzt extra dafür einen neuen Sound. Moment, das ist gar kein Prime-Subscriber. Egal. Wie spricht man das denn richtig aus? Jetzt wird erstmal der Hardscope rausgeholt. Da ist er schon mal vorbei. Das wäre doch mal was. Ich bin hier in der Science-and-Technology-Kategorie. Und außerdem wollte ich ein bisschen Progress machen. Ich fühle mich gerade in der Lage, ordentlich Progress-Progress zu machen. Ich bin in der Lage, mich konzentrieren zu können. Deswegen müssen wir jetzt mal Progress machen. Da stelle ich mal die Kategorie auf Cod um. Da gucken wir uns morgen mal das Gameplay an. Und ich gebe meinen Senf dazu ab. Aber während wir jetzt anfangen, müssen wir mal hier. Schöne, bessere Qualität als die Uralt-Aufnahmen. Ein übelst nicer Song ist das. Bist du heute 34 geworden? Nein. Das ist eigentlich lustig. Das haben alle was geschrieben. Von wegen hier, feels, birthday, mein Geburtstag, alles gut. Es hat mich keiner gefragt, wie alt ich geworden bin. Außer, dass ihr bei Hoherz... Ich habe 50, 50 habe ich gelesen. 50 hat jemand geschrieben. 34 hat jemand geschrieben. Ich meine, ich habe es schon ein paar Mal im Stream gesagt. 420, 69. Ja, was ist die Sache? Es kann alles sein. Ne, 35. 35 bin ich geworden. 35. Metal, genau. Ein Sub, super, grobi10, Twitch Prime, Dankeschön. Moment, Moment, das hat man jetzt nicht gehört. Wartet mal, ich habe eine Idee, was wir jetzt machen. Das passt nämlich ganz gut. Okay, ich lasse euch meine Singskills sparen. Ich spare euch meine Singskills. Ich kann die meisten All-Metallica-Texte auswendig. Okay, ich kann es noch nicht mehr, komplett auswendig. Ey, das ist ewig her. Wir müssen unbedingt einbauen, dass man verschiedene Größen haben kann. Wir müssen ein bisschen Metallica-Musik mal anmachen. Das piepst, oder? Jetzt hört man es nicht mehr. Doch, das piepst. Was ist das für eine Kackaufnahme? Die sind zu hell. Alter, sind die alt geworden. Das ist von 2009, da waren die noch älter. Super, grobi. Kann ich mich leider nicht daran erinnern. Die zwei Gameplays kann man immer brauchen, wenn ich mal Videos machen würde. Eigentlich bin ich total bescheuert, ich habe doch Amazon Music. Ich kann das direkt anmachen. Das ist ein Rippherz, Wort ist eh Ripp. Es gibt viel zu wenig Leute, die Heavy Metal mögen heutzutage, finde ich. Ich meine, es gibt immer noch viele, es ist ja gratis Wacken hier dieses Wochenende. Wenn mich nicht alles täuscht, dann wird es wieder voll sein. Aber es gibt mit Sicherheit in Deutschland deutlich mehr, die Haftbefehle hören, als Leute, die Metallica hören. Das ist das einzige, was ich von Haftbefehlen gemerkt habe. Mehr kann ich nicht. Muss man auch nicht können. Es ist nicht unbedingt, dass das hervorzuheben wäre, wenn man krasse Haftbefehl Lyrics kann. Ich bin immer noch der Ansicht, da werde ich mich wahrscheinlich nahe zu Metallica-Fans zuziehen. Ich habe das ja früher auch sehr oft gehört. Aber ich finde, was Metallica echt gut getan hätte, wäre ein ordentlicher Sänger. Die Musik ist übelst nice, aber ich kann mit dem Gesang heute überhaupt nichts mehr anfangen. Vor allem, weil er auf allen Aufnahmen, während er singt, macht er immer yeah oder so etwas. Das geht mir voll auf den Sack. Was habe ich Pluton an? So, in was fangen wir an? Ich würde sagen, wir gucken jetzt erstmal, wie man Chrome fernstellen kann, bevor wir das mit der Website ausprobieren. Hallo Tante Micha. Hafti ist schon längst out. Jetzt ist Capital Bra der neueste Scheiß. Habe ich noch nie gehört. Ich habe nur letztens in einem Artikel gelesen, dass Kolega jetzt seine ultra krassen Fanboys mit einem... Wie nennt das? Boss? Alfa-Mentoring oder so. Skamast. Nicht Boss-Transformation. Boss-Transformation ist ja out. Du kannst jetzt bei Kolega irgendwie so nen Mäntel... Wie werde ich auch krasser Alfa-Kurs buchen? Für irgendwie läppische 2K. Oder 2000 im Monat irgendwie. Ist übelst da hängen geblieben auf jeden Fall. Also egal ob 2000 oder 2000 im Monat, das macht es ja auch schon gar nicht mehr auf. Macht es ja auch schon gar nicht mehr aus. Ich meine, auf die Idee kommt... Das kann doch eigentlich nur jemand auf die Idee kommen da mitzumachen, der einfach Hardcore-Kolega-Fan ist. Und so ein bisschen die Kontrolle über sein Leben verloren hat. Jetzt im wörtlichen Sinn. Hat er wegen Backlash aber auch schon wieder abgesagt. Der Mäntel ist von vor einem Tag gewesen und bis dahin ist das auch noch gelaufen. Kennste keine Aufschieberittes? Doch, doch klar, das hat jeder. Jedes Mal wenn ich irgendwas machen muss, gucke ich erst mal 2 Stunden YouTube-Videos bevor ich was mache. Das ist immer so. Also immer wenn es was ist, was ich nicht gerne mache. Also zumindest stand das in diesem Artikel drin, dass du quasi bei diesem geilen Alpha-Mentoring-Programm mitmachen darfst, musstest du erst mal einen Fragebogen ausfüllen. Und in dem Fragebogen wurde natürlich rein zufällig auch abgefragt, wie so deine finanziellen Verhältnisse sind. Und wahrscheinlich haben sie gleich die Leute aussortiert, die gesagt haben, sie haben kein Geld. Übrigens letztens war auf Twitter ein Trend, vor was man Angst hat. Und ich habe geschrieben, es gibt noch mehr, aber man konnte glaube ich maximal 3 Sachen schreiben. Ich habe geschrieben Kinder, Java und Overwatch Ranked. Hätte ich noch mehr schreiben können, aber das trifft es eigentlich ganz gut. Ich wollte nicht, ich meine ich hätte auch komplett Menschen hinschreiben können, ja. Aber Kinder gehen mir besonders auf den Kicks. Vor allem im Zug. Also, Puppetier brauchen wir zum Chrome Fernsteuern. Schauen wir mal wie das geht. Das ist übrigens auch eine schöne Sache. Ich habe mit dem original Node.js Ding, habe ich für die Arme halt mal was gebastelt. Also mit dem original Chrome Fernsteuern. Und zwar ist das so, dass unser Support mehrfach am Tag Spam E-Mails accepten, also Spam E-Mails aus dem Spam Ordner quasi freigeben. Und das ist ganz schön ätzend im Endeffekt. Und da habe ich Chrome genommen, dieses Puppetier für Node.js. Und habe einfach die paar Klicks, die man im Web-Interface macht, nachgebaut in Node.js. Und seitdem funktioniert das wunderbar. Da werden jetzt automatisch einmal in der Stunde alle Spam E-Mails freigegeben. Also prinzipiell weiß ich, wie man das verwendet, so halbwegs. Und es funktioniert echt gut. So, also installieren wir den Kram erstmal. Irgendwie ist es jetzt, nachdem wir da Metallica gehört haben, kann ich mir jetzt gerade irgendwie kein Chillgestappe geben. Das ganze Album ist auf YouTube. Mittlerweile haben sie... Das ist sicherlich nur eine private Sicherheitskopie, die man halt irgendwo offsite speichern musste. Jaja, bla bla bla. Jetzt müssen wir mal ein bisschen zackigere Sachen hören. Glory Hammer, übelst nice. Die haben letztes Jahr noch ein neues Album rausgebracht, aber das da finde ich immer noch besser, das beste von ihnen bisher. Ich muss ein bisschen leiser machen, oder? Geht das so? Ok, Puppetier, wo ist er? Puppetier, scharp. Äh, was ist denn? Ja, da. Was Richtige. Kannst du mal einen VS Code Einführungstream machen? Allerdings gibt es eigentlich nicht viel in Original Studio Code zum Einführen. Äh, das ist ohne Witz. So viel gibt es eigentlich gar nicht. So, Accept. Wofür braucht man CMDR? Ne, brauchen tust du das gar nicht. Also, es ist ganz nützlich, wenn man ein ordentliches Terminal braucht. Weil ich mein, das da ist halt kein ordentliches Terminal. Das ist eher Rudeface. Das war auch so was, das geht nur auf Twitch. Das würde beispielsweise auf Mixer nicht funktionieren, weil da gibt es die E-Modes nicht. Mixer ist jetzt ja die Zeit Ninja, dahin gewechselt ist die zweit Milestone gelotete Entertainment App im letzten, in diesem Jahr oder so. Okay, die meisten Leute sind wirklich keine Heavy Metal Fans. Eben hatte ich irgendwie 105 und jetzt habe ich 80. Einfach mal alle raus, alle weg, alle abgeschaltet. Was kann CMDR mehr und was ist anders? Du kannst ordentlich copy-pasten, du hast ein paar Linux-Commando-Zeilenbefehle, du kannst das Fenster ordentlich resizen, du kannst das Fenster per Shortcuts bedienen, du kannst das ein ordentliches Farbschema geben, was mit CMDR nicht geht. Du kannst verschiedene Shells einstellen, du kannst Tabs haben, du kannst im Prinzip alles machen, was man mit einem ordentlichen Terminal machen kann und was man mit CMDR nicht machen kann. Wobei man sagen muss, CMDR ist so ein bisschen schwammig. Das da, was da läuft, ist eigentlich, also normalerweise muss man das unterscheiden. Es gibt das Terminal-Programm, das ist das Fenster, was den Text darstellt und es gibt eine Shell, die da drin läuft. Bei Windows ist das alles CMD in einem. Was für Shell gibt es denn dann vorinstalliert? PowerShell, CMD und WSL, wenn man WSL installiert hat. Aber ich habe WSL nicht installiert. Bash, ich kann es gar nicht drinnen sagen. Ah ja, die Bash geht Shell, wenn sie installiert ist. ZSH, ja gut, ZSH kannst du unter WSL installieren. Das neue Windows-Terminal geht in die richtige Richtung, aber es ist noch zu langsam. Okay, also wir haben jetzt den Cramper installiert. Da können wir jetzt mal versuchen, Chrome fernzusteuern. Take screenshots, generate, inject, HTML. Wait for function, wait for selector. New page async, ich muss noch kurz gucken, wie der Cramper-Abricht funktioniert, hier dotnet-technisch. Page, await browser. Na gut, wo lege ich browser überhaupt an? Ah hier, ne. Also kann man eine Shell wie SH, ZSH auch auf Windows benutzen? Mit WSL geht das ja. WSL ist ja im Prinzip ein Linux, was unter Windows läuft. Du kannst aber auch einfach, und das ging schon immer, du kannst ja einfach per SSH auf eine Linux-Kiste, ach ja, ein eingebautes SSH hat es übrigens auch, also du kannst ja einfach per SSH auf eine Linux-Kiste verbinden. Aber mit WSL kannst du auch alle möglichen, das ist nur Ubuntu standardmäßig. Wie starte ich da? Da haben die ordentliche Examples, Demos hier. Chart-PDF-Demo. Launch-Option, Headless True. Browser-Fetcher. Ach ja klar, der muss natürlich erstmal die Chrome-Binaries runterladen, das ist logisch. Ubuntu, genau. Hast du das neue Terminal schon angeschaut? Ja, haben wir gemacht. Ach, das haben wir schon vor einem Monat oder so gemacht, als es ganz neu war. Ich habe extra damals eine Windows vor allem installiert, mit der neuesten Windows-Version, nur um das Terminal ausprobieren zu können. Was willst du eigentlich mit Puppetier zaubern? Ich will Pakete verfolgen als Backup zur offiziellen API von den Anbietern. Und vielleicht für Hermes, weil Hermes keine offizielle API hat. Und weil ich generell gucken will, wie man es mit.NET verwendet. Ok, New Browser-Fetcher. Wo soll ich jetzt gleich mal angucken, wie der Kram funktioniert. New Browser-Fetcher. Das machen wir mal. Also, wenn ich das jetzt richtig sehe, downloadet mir das jetzt den neuesten Chrome. Achja. Man kann also übrigens, das ist neu, das ist neu in, ich glaube, seit Siechab 7, ist das neu, dass man in Main, oder 7.3, ich glaube seit Sieben, ich glaube seit Sieben, ist das neu, dass man Main Async machen kann. Das ging, das ging früher nicht. Früher muss, ich mein, du kannst, früher war es auch nicht viel schwieriger. Du hast halt hier irgendwie eine neue Klasse gemacht, mit Tote drin hast du ausgeführt und dann gesagt einfach Wait. Das hat natürlich auch funktioniert. Aber so ist es schöner. Ok, jetzt downloadet er Chrome. Und wie geht es weiter? Async-Launch-Options-Papetier-Browser-Browser-Await-Launch-Options-Async. Ja, machen wir. Geht's. Browser. Wir machen erstmal nicht Headless, wir machen nicht Headless. Ich will, ich will den Chrome ja, ich will den Chrome ja sehen. Options, lass mal weg. So, jetzt startet er in Chrome. Ach, muss man Options angeben? Ok, wenn man Options angeben muss, dann geben wir halt Options an und sagen Headless is false. Aha. Immer noch keine Subs-Emotes. Ja, ich war die ganze Woche an arbeiten, stell dir das vor. Und ich bin sehr unkreativ, was sowas angeht. Und ich hab noch keine Idee so richtig. Und dazu kommt, dass im Discord-Channel leider auch keine ordentlichen Vorschläge drin sind für Emotes, die man machen könnte. Ach, switchen wir mal die Musik mal. Nice. Ok, wir gucken mal, ob das jetzt funktioniert, ob der jetzt in Chrome startet. Der sollte jetzt in Chrome starten. Bei New Page müssen wir vielleicht noch machen. New Page, go Google. Genau. Das machen wir jetzt. Der sollte jetzt, der sollte sich jetzt in Chrome, irgendwie eine minimal, oder halt, irgendeine ausführbare, irgendeine ausführbare Chrome-Version für, für meine Plattform runterladen. Casino-Kapitalist, ja, dann ist Mokathos angesagt, wenn ich da Emotes draus nehme. Der sollte jetzt in Chrome runterladen, der sollte einen Tab aufmachen und eine neue Seite laden, auf Google gehen und dann nichts machen. Gucken wir mal, ob das funktioniert. Downloading Chrome. Dann downloaden wir Chrome. Das muss er nur einmal machen. Das muss er nur das erste Mal machen, danach ist das zwischengespeichert. Bam, da ist er. Chrome is being controlled by automated test software. Da ist er. Ein frischer, ferngesteuerter Chrome. So. PDFs wollen wir nicht generieren. Also, dann probieren wir das Ganze doch mal aus. Dann probieren wir das Ganze doch mal aus. Wir probieren das mal mit einer DHL, mit einer DHL, nein, wir machen das Hermes-Tracking. Wir machen das Hermes-Tracking von eben, da. Das da hinten ist, würde ich sagen, der Anbieter, der das Paket transportiert und das hier vorne ist die, die, die, die, die Paketnummer, Trackingnummer. Warum wird Chrome eigentlich so einfach benutzt, so oft benutzt? Naja, in dem Fall wird Chrome benutzt, weil er einfach fernzusteuern ist und ich weiß gar nicht, ob Firefox was ähnliches hat. Okay, also gehen wir mal auf die Seite. Dann sollte, dann sollte irgendwelches Zeug geladen werden. Mal gucken, ob das jetzt funktioniert. Der sollte jetzt eigentlich die gleiche Seite wieder aufmachen. Ach so, haha, Moment, wir müssen, wir müssen, glaube ich, warten. Der macht die Seite, glaube ich, wieder zu. Wir müssen warten. Go to Page Async. Ich glaube, wir müssen warten. Wir müssen, wir müssen hier theoretisch warten, dass der, als wir zugucken können. Ich meine, das ist jetzt nicht die schönste Art und Weise da zu warten, aber wir müssen, wir müssen erst mal zwei Sekunden warten, dass wir, dass wir sehen, dass, dass, dass der das macht. Ah, funktioniert. Ähm, das ist gut, nice. Was hältst du von Brave Org? Ist der Chromium-Bild? Hab ich noch nicht ausprobiert. Also machen wir hier sowas wie hier Tracking. Tracking ist das da. Dann haben wir noch, äh, äh, äh, Carrier oder so nennen wir das mal. Das ist das da. Also das ist in dem Fall Hermes. Ähm, String Interpolation. Äh, wann hab ich das falsch rumgemacht? Kann man sich mal nicht merken. Moment. Ach, man sollte es vielleicht auch an die richtige Stelle schreiben, dann funktioniert das auch. Ja, das sind so Kleinkram, den übersieht man immer. Und den übersieht irgendwie alle. Also ich kenne keinen, der nicht ab und zu mal so Kram übersieht. Deswegen finde ich die Diskussion, die es immer gibt, darüber, welche, also wie man noch optimierter Text eingibt beim Programmieren, vollkommen überflüssig, weil die meiste Zeit machst du dir eh Gedanken. Was checkst du mal aus? Was soll ich auschecken? Janik the Genius? Wo steht das? Ach hier, Brave Org. Ja, muss ich mir mal angucken. So, ähm. Mal gucken, ob es funktioniert. Jetzt muss die Tracking App wieder aufgehen. Ah, gut, passt. Okay, und nun, jetzt wird es ein bisschen komplizierter. Jetzt müssen wir erstmal auf der Seite checken, wie das Ganze überhaupt funktioniert. Weil es ist jetzt ja so, ich muss jetzt irgendwie aus der Seite rausholen, was für einen Status die Sendung hat. Keiner funktioniert so gut wie Chrome. Ich bin mit Chrome auch wirklich zufrieden. Ich kann mich da über Chrome ehrlich gesagt gar nicht großartig beschweren. Und jetzt sind mal unsere krassen Reverse Engineering Künste gefragt, dass wir rauskriegen, wie die Seite funktioniert. Was übertragen die denn da alles? 30.000 JavaScript und CSS und Gedönszeugs. Okay, wir müssen das mal groß machen. Und wir müssen die Devtools mal irgendwie rechts hin machen, dass man auch ein bisschen was sieht. Okay, noch mal gucken, dass es nix im Cache ist. Aus dem Cache laden, okay. Ähm, so. Also, wir brauchen Track. Da haben wir doch, das sieht doch schon mal interessant aus. JavaScript juckt uns nichts, CSS. Uns jucken Request zum Server, das ist das hier. Ha, nice. Ähm. Was überträgt, was genau übertragen die da? Das ist kryptisches China Zeug, was die da übertragen. Track B704C0. Was zum Teufel machen die da? 0. RET1. Message okay, okay. Also, Text. Ah, okay. Das hier sind die... Sendung wurde zugestellt. Das hier sind die Einzelheiten von... Also, der Progress. Das ist richtig pepega, API. Das ist aber auch keine offizielle von denen, ne? Also, ich meine, das ist jetzt zwar unter Rest AP Track, aber ich wette mit euch, das funktioniert nur, wenn man irgendwelche passenden Cookies gesetzt hat. Also, ich gehe mal davon aus, ich kann jetzt nicht einfach hergehen. Copy. Copy as Curl. Bash. Nice, das funktioniert. Ähm, ich denke mal, ich kann jetzt nicht einfach einen Curl machen. Aha. Okay, vielleicht brauchen wir den Kram mit Chrome gar nicht. Naja, doch. Ja, ich guck mal, ich übersetz. Ich hab mir diese ganzen Cookies gesetzt. Da hab ich keinen Bock, das von Hand zu bauen. Creeps HD. Nice. Danke schön. Stufe 1 Sub. Heute gibt's wenig. Prime Subs. Subscriber hier. Ein nicer Sub. Danke schön. Creeps HD. Wie lange streamst du heute? Kein Schimmer. So, mal gucken, ob der Mist auch ohne Cookies und haste nicht gesehen funktioniert. Ich glaube eher nicht. Nee, guckt. Was? Achso. Ich hab den Header weggemacht. Nee, guckt, das geht nicht. Das funktioniert nur, wenn man die passenden Cookies und irgendwelche Y, Q, Bit gesetzt haben und was auch immer. Irgendein China Cookie. V5 Translate Express. Da ist die Event ID. Keine Ahnung. Da hab ich keinen Bock drauf. Deswegen hab ich mir schon in, nennen wir es mal, weiser Voraussicht überlegt, dass wir das besser mit einem Remote gesteuerten Chrome machen. Weil, wenn wir das mit einem Remote gesteuerten Chrome machen, dann müssen wir diesen ganzen Kram wie Cookies und so nicht von Hand machen. Das macht Chrome für uns. Aber es ist natürlich trotzdem wichtig, dass wir den Aufruf mitkriegen, weil in dem Aufruf, hier, da, steht ja letztendlich drinnen, in JSON, irgendwie in einem komischen Format, aber es steht letztendlich lesbar drinnen, wo sich die Sendung gerade befindet. Das heißt, es ist allemal besser, das aus diesem JSON-Request rauszufuddeln, der gemacht wird, als aus dem HTML, was generiert wird, rauszupasen. Also das HTML-Pasen ist wirklich das allerletzte, was ich machen würde, wenn ich an so Informationen reinkommen will. Weil, das Problem ist, wenn du anfängst, irgendwelche HTML-Sachen zu pasen, das geht morgen schon kaputt. Das ist einfach nicht stabil, HTML-gepase. 200 IQ, ja. Deswegen müssen wir gucken, dass wir irgendwie an diesen JSON-Response rankommen, der gemacht wird, wenn man die Seite aufruft. Das heißt, ich muss jetzt irgendwie mal schauen, wie man sich in die Chrome-Fernsteuerung mit Puppety reinhängen kann, dass man mitbekommt, wenn ein JSON-Request, also wenn ein Post-Request gemacht wird, dass ich da mich reinhucken kann, irgendwie. Keine Ahnung, wie das funktioniert. Müssen wir mal schauen, ob die vielleicht ordentliche... Hier, schau mal. Puppetier-Doc. Das ist ja keine nettspezifische Sache. Ja, das sieht schon besser aus. So, nach was müssen wir da mal suchen? Dankeschön, NobodyQ. FeelsBirthday, man. Boah, nach was könnte man da mal suchen? Irgendwie Hook? Request? Ich will da letztendlich einen Post-Request mitkriegen. Event-Request, Request-Finished. Class-Page. Request-Finished. Das klingt schon mal Request und Request-Finished. Das klingt schon mal ganz praktisch. Wait for request. Class-Request. Set-Request-Interception. Oh, das klingt auch gut. Event-Request-Finished. Emitted when a request finishes successfully. Poggers Englisch wieder. Easy. Willst du nicht eher die Response... Na, ich hoffe mal, dass man die Response lesen kann, wenn man Request macht. Also, wenn dann Request fertig, dann Response davon anzeigen. Weil, aber du hast prinzipiell recht, ich will schon den Response haben. Können wir mal gucken. Vielleicht gibt es sowas wie Response-Finished oder so. Emitted when a response is received. Ja, das ist wahrscheinlich dann noch besser. Das ist tatsächlich dann noch besser. Set-Request-Interception. Nee, das stimmt. Du hast recht. Das ist viel sinnvoller, wenn man nach Response geht. Intercept. Vielleicht gibt es auch Intercept-Response. Intercept. Was machen die hier? Set-Page-Request-Interception-True. Page-On-Request-Intercept-Request. Nee, das wollen wir eher nicht. Response. Ich habe irgendwas von einem Event mit Response gesehen. Okay, probieren wir das mal aus. Page-Response. Hängen wir uns mal an das Event dran. Wir können, wir machen das dann inline mit irgendeinem Lambda, aber erstmal hier gucken, ob wir da irgendwas rauskriegen bei der ganzen Sache. So, Response created. Was kriegen wir denn da? Response. Da ist es doch. From cache, Frame, Headers. Und Visual Studio lagged. Huge Visual Studio lagged. Aber cool, ich muss jetzt neu starten. Weiß nicht, was damit los ist, aber das lagged wie Sau gerade. Läuft irgendein Mist im Hintergrund oder so? Krassen Hexors am Start. Nö, läuft nix im Hintergrund. Na gut, machen wir weiter. Außer VMWare läuft nix. Warum braucht VMWare überhaupt so viel CPU-Last? Oh, ihr seht nix, ne? Ups. Ups, ups, ups. Jetzt. Ja, das ist ein Bug. Ich glaube, das ist ein Bug in OBS. Dass, wenn man diesen Windows Passwort Prompt kriegt, dass man, dass es abkackt, die Bildschirmaufnahme. Warum auch immer. Konsole App 12 waren wir. Was ist los? Freitagabend? Nur 80 Zuschauer? Das bin ich ja gar nicht mehr gewöhnt, ey. Alle hier am Party Parrot machen. From cache, Headers. Alter Header, Digga. Digga, Header. Status Text. Wo ist Body oder sowas? Gibt's da Text? Hier, Text. Text Representation of Body. Text, das wollen wir haben. Await. Text. Okay. Also ich sollte jetzt für jeden Request, den mein ferngesteuerter Chrome macht, eine Ausgabe in dem Terminal kriegen, wo drin steht, was er für, äh, die Response, also quasi jegliche Response von dem, was bei dem Seitenaufbau quasi reinkommt in den Browser. Was soll ich jetzt im, im, in der Kommando-Zeile kriegen? Okay, das ist natürlich ein bisschen was. Und unformatiert ist das natürlich ziemlicher Müll. Wir kriegen jetzt ja alles im Endeffekt. Okay, das müssen wir jetzt, das müssen wir jetzt mal irgendwie filtern. Das müssen wir jetzt mal, das filtern wir jetzt mal, weil das kannste ja komplett vergessen. Wieso machst du alles Essing, um es dann wieder zu Awaiten? Weil ich, weil ich was ausgeben will. Wenn ich was ausgeben will, muss ich Awaiten, bis die Ausgabe da ist. Ah. Was passiert eigentlich, wenn ich das so mache? Ja genau, dann krieg ich einfach nur die Klasse zurück. Das bringt nichts, ich muss da schon Awaiten. Allerdings ist Await in dem Fall kein Sleep. Das ist auch so ne Sache, ich hab das, ich hab ne, ich hab ne Weile gebraucht, bis ich das kapiert hab. Das ist im Prinzip ein Return aus der Funktion und erst wenn es fertig ist, gehts weiter an der Stelle. Also unter der Haube macht er quasi hier nen Return aus der Funktion und das blockt nicht. Der geht einfach aus, hier steht eigentlich ein Return davor noch. So quasi. Return. Und dann ruft er die Funktion wieder auf und dann springt er halt nicht da oben hin, wo Return drin steht, sondern hier unten, wo dann die Response drin ist. Es gibt ein richtig cooles Video zum Thema Async Await hab ich gesehen. Von allen der letzten Build-Konferenzen war das glaube ich. Wie hieß das denn? Irgendwie sowas wie Async Await Mistakes oder so? In der Richtung. War das überhaupt Build? Das war ein ziemlich gutes Video, wo jemand erklärt hat, wie Async Await intern funktioniert. Ja, genau das da. Das da. Das ist ein ziemlich gutes Video, der erklärt, wie das intern funktioniert, wie Async Await, wie das quasi implementiert ist. Und warum es eben nicht blockt oder trotzdem blockt, wenn man es verkehrt benutzt. Ja, warum nicht? Bisschen mehr Action könnte da Musik jetzt auch drin sein. Ok, wir müssen jetzt in dem Response auf jeden Fall mal nach was sinnvollem suchen. Ich hab ne Idee. Ha, ich hab ne Idee. Huge. Big Brain. Also mal gucken, ob das funktioniert. Wir wissen noch, welche Url das Ganze ist. Response. Und zwar können wir gucken. If Response. Und da ist garantiert irgendwie die Url drinnen, die der. Ich will nicht Text Async. Ich will einfach nur Response. Und da ist garantiert irgendwo die Url drinnen. Ist ja gut. Ok, dann brauch ich auch nicht Await. Da ist garantiert irgendwo die Url drinnen. Remote Address. Url. Genau. So, und wenn die Url das hier ist, weil das haben wir doch raus gekriegt eben gerade. Die Url. Wo haben wirs? Irgendwo. Ich hab sie noch kopiert. Wenn das da die Url ist, die aufgerufen wird, nur dann wollen wirs ausgeben. Das können wir doch jetzt schon mal ausbringen, ob das funktioniert. Await. What. Sponsor. Async Text. So und jetzt sollten wir nur von dem hoffentlich richtigen Request die Ausgabe kriegen. Ja. Bam. Funktioniert. Pock. Easy. Richtig easy. Ja. Easy as fuck. Easy as fuck. Und habt euch auch schon ein Mixer-Account gemacht, Leute. Nope. Ich auch nicht. Ich auch nicht. Erinnert ihr euch noch an den... Ich mach mir auch keinen Mixer-Account vorzu. Ninja guck ich eh nicht. Und so. Rest juckt mich auch nicht so wirklich. Könnt ihr euch noch an den E3 Stream von vor ein paar Jahren erinnern, wo die Age of Empires Typen auf Mixer gestreamt haben und ihre Streamproben aus Versehen das Mikrofon eingeschaltet haben? Twitch-Tracker. Okay. Was auch immer. Genau. Das ist der Clip hier. Das haben wir gesehen. Da waren wir im Stream und wollten einfach nur gucken wann geht der Age of Empires Stream los. Ah von der Gamescom. Und auf einmal haben sie ihre Trockenübungen gestreamt. Ich glaube die haben aus Versehen den Stream eingeschaltet und wollten gar nicht. Jetzt ist er wieder aus. Ja da hat man im Hintergrund die Trockenübungen gehört, wo sie geübt haben zu jubeln und sowas bei Ankündigungen. Das war richtig fail. Ninja streamt nicht mehr bei Twitch. Anscheinend nicht. Es gehen irgendwie die Gerüchte um, dass er einen was? 930 Millionen? Ach keine Ahnung. Auf jeden Fall verdammt viel Geld dafür bekommen hat. Exklusiv 6 Jahre für Mixer. Also ich habe keine Ahnung wer das ist. Ich habe keine Ahnung wer das ist, ob das vertrauenswürdig ist. Das ist nicht legit. Das glaube ich nicht. Ich habe das schon mal auf Twitter gelesen, aber ich kann mir das nicht vorstellen. 932 Millionen wäre extrem krass viel für einen Streamer. Ich meine das ist der größte Streamer. Dass es in Millionenhöhe liegt ist klar, aber ich glaube nicht, dass es ernsthaft ist. Das glaube ich nicht. Humor. Das ist Blödsinn. Aber es wird mit Sicherheit in Millionenhöhe liegen. Garantiert. Der wird so krass die Kohle bekommen dafür. Das lohnt sich für ihn. Ich bin mir noch unschlüssig, was das für Auswirkungen haben wird. Ich habe mir da gestern ein bisschen Gedanken zu gemacht. Es gibt ja im Prinzip zwei Sachen wie das Ganze ausgehen kann. Entweder wird Mixer jetzt Konkurrent für Twitch. Das glaube ich allerdings. Das kann ich nicht glauben. Das wird auch Ninja alleine nicht schaffen. Er wird ja ein paar Fans mitbringen, aber ob deswegen Mixer auf einmal ein ernsthafter Twitch Konkurrent wird, ich kann es mir irgendwie nicht vorstellen. Mir gefällt auch Mixer von der Seite her. Es ist genau umgedreht. Mixer bleibt verhältnismäßig unbedeutend und Ninja verliert extrem an Einfluss und Bedeutung. Das ist eigentlich die Sache, wozu ich eher tendiere. Allerdings ist Ninja mittlerweile so groß. Ich weiß gar nicht, ob er überhaupt noch richtig abhängig ist von irgendeiner Plattform. Wahrscheinlich könnte er auf Chatrubate oder so streamen oder er hätte 14.000 Viewer oder so. Keine Ahnung. Das ist wahrscheinlich bei Ninja mittlerweile egal, wo er streamt. Das Sebaro droppt hier wieder die Seiten. Okay, machen wir weiter. Also wenn Response Rest RP Track, dann wollen wir die Response als Text. Klingt irgendwie sinnvoll, oder, was wir da gebastelt haben. Ist der Packet Tracker für was spezifisches? Ja, der ist für OPS, DHL, Hermes, DPD und wenn wir es hinkriegen für Amazon. Aktuell probieren wir gerade den Hermes Stand über diese Tracking Seite abzufragen, weil Hermes keine API bietet. DHL hat eine API, DPD hat eine API, OPS hat eine API. Hermes hat keine API. Was wie sieht es mit China Post aus? Das sollte nicht zu schwer sein. Können wir auch einbauen, aber erstmal will ich die Sachen einbauen, wo ich selbst relativ viele Pakete mitkriege. Wenn man das ordentlich bauen kann man eh weitere Anbieter relativ easy integrieren. Okay, jetzt müssen wir den Kran noch irgendwie parsornen würde ich sagen. So, jetzt haben wir den Text, den Body als String. Das müssen wir jetzt parsen. Wir müssen jetzt das JSON Objekt uns erstmal schnappen. JasonConvert, da machen wir uns vielleicht wirklich eine eigene Klasse für, die wir dann direkt deserialisieren können. Oh, Twitch Prime. Huge. Neradon. Nee, nicht mal Prime. Richtig, richtig, äh, richtiger Sub. Also kein, kein, sondern ein richtiger. Danke schön für Stufe 1. Neradon, Pog. Hey Max, frag mich nicht mehr. Absolut keine Ahnung, was das ist. Ähm, ich bastel eine Software, oder ich probiere, was, ähm, was zu programmieren, was Pakete trackt. Allerdings nicht einfach nur Pakete trackt, sondern dein E-Mail Postfach durchsucht nach gültigen Trackingnummern und dann quasi die selbstständig trackt und dir Bescheid sagt, wann deine Pakete kommen. Das heißt, in Zukunft musst du eigentlich nur gucken, dass du die gleiche E-Mail Adresse verwendest bei allen Online-Shops. Und so ziemlich jeder Online-Shop, den es gibt, verschickt eine Mail, wenn das Ganze verschickt ist. Ich meine sogar Aliexpress macht das. Und in diesen E-Mails steht in der Regel auch immer drinnen, ähm, sehr geehrter Herr XY, ähm, ihre, ihre Sendung wurde verschickt mit DHL und das ist die Trackingnummer. Da steht ja in der Regel immer drin. Ich kenne eigentlich keinen Shop, wo das nicht drin steht. Das heißt, wir machen das in drei Teilen. Ähm, wir scannen einmal die E-Mails nach Trackingnummern. Plus ein paar weitere Sachen, ja. Also wir haben es uns hier letztens aufgeschrieben, wie wir das Ganze machen müssen. Ich kann es dir noch mal kurz zeigen. Äh, haben wir das nicht gespeichert? Kann das sein? Da ich so dämlich war und das nicht zu speichern vom letzten Mal? Das ist äh, ziemlich pepega. Naja, zumindest dann erklär ich das jetzt noch mal. Wir bauen drei Teile. Wir bauen einmal einen Teil, der deine E-Mail scannt und äh, quasi versucht, den Anbieter rauszukriegen und die Trackingnummer rauszukriegen. In Kombination eben noch mit vielleicht deinem Namen, dass nicht so viele E-Mails durchrutschen, die nicht, gar keine Versandnachrichten sind. Danach wird das Ganze getracked. Es gibt nur ein halbwegs hübsches, sofern es meine CSS Skills hergeben. Ähm, Webinterface, wo der Status angezeigt wird und ähm, auch eine MQTT-Benachrichtigung für deine HM-Automatisierung, falls du eine hast und halt eine Notification an. Mal gucken, was wir da unterstützen, wenn ein Paket ankommt. Das Schöne daran ist ja, ich meine, es gibt wie Sand am Meer Programme, die deine Pakete tracken, allerdings nicht automatisch. Du musst immer noch die Nummer einfügen. Ja, und das äh, stelle ich mir eigentlich ganz nice vor. Max schon mal von Pokemon Mini gehört rein. Parcel Track kann das, ich weiß, dass die das können. Ich weiß, dass die das können. Allerdings will ich meine E-Mails nicht an anderen, an externen Anbieter weiterleiten. Wahrscheinlich wird meine App oder mein Programm am Ende auch nie wirklich so gut funktionieren, wie das Parcel Track macht, weil ich meine, die unterstützen was? 85 Anbieter oder so. Also es wird nicht wirklich Konkurrenz dazu sein, aber für Leute, die sich das nicht kaufen wollen, oder die ihre E-Mails nicht an externen Anbieter weiterleiten wollen, oder denen es reicht, wenn sie mit den 0815 Sachen in Deutschland zurechtkommen, also DHL, UPS, DPD, Hermes, Amazon, dann können die, dass die dann auch damit zufrieden sind. Denke ich mal. Okay, jetzt müssen wir den Mist erstmal hier, okay, wir haben es importiert. Ähm, jetzt müssen wir das Ding erstmal als Jason parsen. Was wir da haben. Parse, nämlich den Körper, der Körper wird gepasst und da kriegen wir dann ein Jason Object raus und das können wir mal ausgeben und schauen, ob wir das Richtige gepasst haben. Haben wir. Okay, also wir haben schon mal die China Response, haben wir schon mal, mit ganz merkwürdigen Sachen drinne. Was könnte denn da was sein? Ich bin da jetzt gerade ein bisschen unschlüssig. Z0 haben wir. Die Dinger sind ja auch absolut grausam benannt, ne. Reicht es nicht, sich auf Amazon zu verlassen, wenn du nur bei Amazon bestellst und dir die E-Mails von Amazon reichen, die du kriegst und die Sendeverfolgung in Amazon reicht, das ist okay, dann brauchst du nichts anderes. Allerdings, was man nicht vergessen darf, wirklich eine ordentliche Übersicht. Wenn du nicht gerade die Amazon App aufmachst auf deinem Tablet, hast du nicht. Also wenn du beispielsweise irgendwie eine Heimautomatisierungslösung hast und würdest gerne wissen oder möchtest darauf reagieren, wenn Pakete kommen und irgendwas machen, dann geht das nicht, weil du kriegst das aus Amazon nicht gescheit raus. Oder halt, du kannst halt natürlich die Amazon Seite parsen. Aber so ist es auf jeden Fall praktischer, weil du alle Anbieter drinne hast und alle Shops, alle Shops die E-Mails verschicken. Und jeder Online-Shop verschickt, also kennt ihr einen Online-Shop, der keine E-Mail verschickt, wenn die Sendung auf dem Weg ist? Also mir fällt da keiner ein. Der letzte schlechteste China-Shop oder Inder-Shop bei Banggood verschicken Bestätigungs-E-Mails. Tidesdunkel. Viel Spaß, der Name. Ja, der Name ist recht unvorteilhaft, Banggood, gebe ich zu. Ich weiß auch nicht, was sie sich dabei gedacht haben bei dem Namen von dem Shop, ehrlich gesagt. Warum er seine Seite Banggood nennt. Aber ich mein, die heißt halt nun mal so. Banggood, also. So, was sagt uns dieses Chasen-Objekt? Das ist China-Logik. Ich blicke da erstmal überhaupt nicht durch. Also das da ist wahrscheinlich der aktuelle Stand der Sendung. Das ist zuletzt aktualisiert. B ist Null, C und D sind Lehrer-String. Weil L9 ist Null, L1 ist wahrscheinlich Ziel-Land. Z1. Darf man nur darauf hoffen, dass sich die Namen in diesem Chase nicht ändern. Ja, das stimmt. Aber immer noch besser als HTML-Parsen. Und Z1. Z1 ist ein Array aus den unterschiedlichen Sendungs-Events-Schritten. Also im Prinzip. Beleg gerade. Alter, Donation hab ich schon ewig schon einmal gekriegt. Donation, Mr. Samo hast du denn 2 Euro. Sorry, das passt nicht zum Thema. Glaubst du du spielst wieder Overwatch? Wenn die Rollenwelle rauskommt, hab deine Overwatch-Videos mega gerne geschaut. Ich hab sie sogar schon installiert, weil ich die Role-Q ausprobieren wollte. Und ich dachte mir so, ok, guckst du noch mal ein bisschen auf Twitch, dass du vielleicht wieder so ein bisschen reinkommst. Und das erste, was ich auf Twitch gesehen hab, ist Pussy P. Und hab ich wieder aninstalt. Weil ich schon ganz vergessen hab, wie kacke ich den Modus fand. Also die Hermos-Seite schickt auch ein AP-Request raus nach Shipments Search Tracking-Nummer. Das ist gut zu wissen. Das können wir uns auch noch angucken. Aber die Seite will ich eh als Fallback haben. Also sollte mal irgendwie was von den anderen Trackern nicht funktionieren, ist sie als Fallback wunderbar, weil sie unterstützt einfach alles. Ich hab immer noch so ein bisschen Schwierigkeiten zu checken. Immer noch so ein bisschen Schwierigkeiten zu checken, wie das Ganze aufgebaut ist. Was ist 9-1-2? Z2-6? Ok, wir holen uns erstmal Z0 raus. Wir holen uns erstmal Z0 raus, weil das ist der aktuelle, der zuletzt aktualisierte Eintrag ist das, Z0. Also der aktuelle Stand der Sendung ist Z0. Und ich denke mal, wenn wir einfach regelmäßig abfragen, was wir ja machen, man lässt das ja eh im Hintergrund laufen. So was weiß ich, einmal die Stunde oder keine Ahnung, alle 30 Minuten oder so. Oder einmal am halben Tag, ist ja auch egal, kriegen wir immer den aktuellsten Stand mit, wie es sich aktualisiert. Also eigentlich brauchen wir diese History hier gar nicht. Holen wir uns da mal Z0 raus. Also was brauchen wir? Wir brauchen hier DUT, DUT, Track und dann Z0. Also, probieren wir mal. DUT, Track und dann Z0. Und jetzt sollten wir nur die Daten kriegen, die wir brauchen. Huge Donation. Ich glaube, ich habe irgendwas falsch gemacht, kann das sein? Oh, es hängt, es hängt. Return 0, was habe ich verkehrt gemacht? Ach, nicht Data. DUT. Einfach nur DUT. Donation, Dankeschön. Und zwar, wir haben ja 5 Euro. Demonlord Rimuru. Schau dich schon von Anfang an, alles gut und bleib, wie du bist. Hab ich vor. Leute, auf Klo. Das war's für heute. Bis zum nächsten Mal. Das war's für heute. Bis zum nächsten Mal. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen. Danke fürs Zuschauen.", "segments": [{"id": 1, "start": 150.0, "end": 157.0, "text": "Das war's für heute, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal, bis zum nächsten Mal."}, {"id": 2, "start": 180.0, "end": 195.0, "text": "So, Leute. Ups, ich sollte mir vielleicht mal den Netzrad auch richtig aufsetzen. Ich bin noch am Start."}, {"id": 3, "start": 195.0, "end": 208.0, "text": "Ja, also ich meine, im Titel steht zwar Geburtstagstream, das stimmt auch, aber wir werden nichts Besonderes als Geburtstagstream machen."}, {"id": 4, "start": 208.0, "end": 218.0, "text": "Das Einzige, was ich jetzt noch mal kurz ausprobieren muss, ist, ob mein Weep-TTS auch Qt-Chat sagen kann."}, {"id": 5, "start": 224.0, "end": 233.0, "text": "Qt-Chat, ach nee. Warum crash das? Warum crash das, wenn ich das umstelle? Das habe ich doch irgendwie kacke programmiert wieder."}, {"id": 6, "start": 233.0, "end": 252.0, "text": "Grip. Warum crash das, wenn ich, vielleicht habe ich da irgendwie einen Bug, dass ich das zusammenschreiben muss oder so."}, {"id": 7, "start": 252.0, "end": 280.0, "text": "Also, Qt-Chat, Qt-Chat. Was? Was? Moment, was?"}, {"id": 8, "start": 280.0, "end": 282.0, "text": "Das ist, das passt."}, {"id": 9, "start": 282.0, "end": 310.0, "text": "Qt-Chat. Qt-Chat. Ja, das ist gut. Qt-Chat. Qt-Chat."}, {"id": 10, "start": 312.0, "end": 319.0, "text": "Prime. Subscriber."}, {"id": 11, "start": 319.0, "end": 324.0, "text": "So, rauhe jetzt zu."}, {"id": 12, "start": 324.0, "end": 332.0, "text": "Zweimal U? Moment, war es so hier?"}, {"id": 13, "start": 332.0, "end": 345.0, "text": "Nee."}, {"id": 14, "start": 345.0, "end": 362.0, "text": "Nein, das funktioniert nicht. Der Sebaro ist wieder da. Der Qt-Chat hatte ich schon vermisst das letzte Mal, da hat jeder alle fünf Minuten gefragt, wo ist denn der Sebaro."}, {"id": 15, "start": 362.0, "end": 374.0, "text": "Ja, funktioniert am besten."}, {"id": 16, "start": 374.0, "end": 384.0, "text": "Ja, Leute. Also, wie gesagt, ich habe es in den Streamtitel geschrieben, Geburtstag und so, aber wir machen heute nichts irgendwie"}, {"id": 17, "start": 384.0, "end": 409.0, "text": "Birthday-mäßiges. Ja, warte mal zu. Irgendwie hat es ihn ein bisschen verschoben, kann das sein? War da nicht eben da?"}, {"id": 18, "start": 409.0, "end": 416.0, "text": "Oh, 500 Bits, Dankeschön."}, {"id": 19, "start": 416.0, "end": 422.0, "text": "Big Brain-Chat heute wieder."}, {"id": 20, "start": 422.0, "end": 447.0, "text": "Ja, also, wir machen heute nichts großartig Birthday-mäßiges. Wir basteln weiter an unserer Paketverfolgungs-App. Heute werden wir ein paar Sachen ausprobieren, unter anderem Browser Fernsteuern und Chrome Fernsteuern mit.NET."}, {"id": 21, "start": 447.0, "end": 467.0, "text": "Und vielleicht probieren wir die UPS-App noch aus. Also, wir probieren heute aus, ob wir es schaffen, aus unserem.NET Programm einen Chrome Fernsteuern, allerdings einen Headless-Chrome, also sprich, genau Desmond, so sieht es aus, der kennt sich aus, der weiß Bescheid."}, {"id": 22, "start": 467.0, "end": 483.0, "text": "Und da muss natürlich Headless sein, also wir wollen den Chrome ja nicht sehen, das wäre sonst eben ein bisschen langweilig. Hab ich noch nicht gemacht, aus.NET raus, die offizielle Library ist Node."}, {"id": 23, "start": 483.0, "end": 504.0, "text": "Node.js ist das, das ist das hier. Hat nur 52.000 GitHub-Sterne. Das ist quasi die offizielle, von Chrome API zum Chrome Remote Fernsteuern. Was sagen sie denn selbst? Sie sagen hier Headless-Chrome API, ja genau."}, {"id": 24, "start": 504.0, "end": 530.0, "text": "Und die gibt es allerdings auch, da gibt es allerdings auch eine.NET Version, habe ich gesehen. Und die probieren wir mal aus, denn für unser Paket-Tracking, Puppeteer Sharp, die wir brauchen, weil um unser Paket-Tracking zu machen, ich meine, wir haben eine API von DHL und wir haben eine API von DPD und wir haben eine API von UPS."}, {"id": 25, "start": 530.0, "end": 539.0, "text": "Mal gucken, wie gut das funktioniert. Von Hermes haben wir schon mal gar keinen und von Amazon auch nicht. Das heißt, wir werden auf jeden Fall ein paar Webseiten parsen müssen, da kommen wir nicht drum herum."}, {"id": 26, "start": 539.0, "end": 564.0, "text": "Und ich hätte auch gerne so einen Fallback-Tracking, also sprich, sollten irgendwie die API-Aufrufe aufgebraucht sein für DHL oder sollte DHL oder irgendein anderer Anbieter was an seiner Seite geändert haben, seine API geändert haben, das ist dann, dass man so eine Fallback-Seite für Tracking hat. Und was es dafür gibt, ist hier so eine China, ich glaube, das ist eine China-Seite."}, {"id": 27, "start": 564.0, "end": 578.0, "text": "Da kann man hier seine Pakete eingeben. Ich suche mal kurz raus, ich hatte das letzte Mal auch welche. Hier zum Beispiel hat mir letztens jemand eine Hermes-Paket-Nummer gegeben und da sagt er Not Found."}, {"id": 28, "start": 578.0, "end": 601.0, "text": "Hermes, multiple, oder was? DPD? War es gar kein Hermes? Kann der überhaupt Hermes? Hermes? Hermes? Hermes.de?"}, {"id": 29, "start": 601.0, "end": 613.0, "text": "Mal gucken, hat mir letztens im Stream einer zum Test eine Tracking-Nummer von Hermes gegeben."}, {"id": 30, "start": 613.0, "end": 638.0, "text": "Okay, der trackt sich da kaputt. Dann probieren wir das jetzt nochmal mit DPD aus, ich habe noch ein DPD-Paket hier. DPD, DPD. Ja doch, hier, okay, Hermes Germany. So, und die Seite hätte ich gerne als Fallback und vielleicht verwenden wir die auch für sowas wie Hermes,"}, {"id": 31, "start": 638.0, "end": 651.0, "text": "die halt selbst keine AP anbieten, um Pakete zu verfolgen. Das ist relativ armselig irgendwie, also armselig, Anführungsstrichen, also ich meine, es ist denen ihr gutes Recht zu sagen, sie bieten keine AP an, aber ich meine, warum nicht?"}, {"id": 32, "start": 651.0, "end": 659.0, "text": "Die haben die Tracking-Informationen eh, es ist besser, die bieten offizielle AP an, wie das die Leute mit irgendwie komischen Webseiten und Parsing rumhantieren müssen."}, {"id": 33, "start": 659.0, "end": 669.0, "text": "Brauchst du noch ein DHL-Sendungscode? Ja, kann ich schaden, kann ich schaden. Kann ich schaden, ich meine, ich brauche viele Testing Codes,"}, {"id": 34, "start": 669.0, "end": 683.0, "text": "aber dann so weit sind auch mal ein paar Testing Codes, wo man hier so einen Zwischenschritt testen kann, übrigens die Sprache müssen wir dann umstellen, nicht auf Deutsch, sondern auf Englisch, falls das funktioniert."}, {"id": 35, "start": 683.0, "end": 699.0, "text": "Genau, und die Webseite müssen wir irgendwie parsen. Heute Frankfurt Vollsperrung, angeblich war das, weil irgendwelche Leute am Hauptbahnhof, ups, warte, angeblich hat die Polizei Frankfurt gesagt,"}, {"id": 36, "start": 699.0, "end": 708.0, "text": "die Sperrung am Hauptbahnhof war, weil irgendwelche Leute Schließfächer aufgebrochen haben und abgehauen sind. DHL, oh nice, danke."}, {"id": 37, "start": 708.0, "end": 716.0, "text": "Leute, irgendwelche Schließfächer am Hauptbahnhof aufgebrochen haben, wir können doch gerade mal gucken. Twitter, Polizei, Frankfurt."}, {"id": 38, "start": 716.0, "end": 725.0, "text": "Und es gab wohl irgendwie, also ich weiß nicht, müssen wir mal lesen. Ich glaube, ich habe gelesen, es gab einen Schusswechsel zwischen Polizei und den Dudes."}, {"id": 39, "start": 725.0, "end": 741.0, "text": "Nee, die Polizei hat geschossen, also es gab keinen Schusswechsel, sondern wahrscheinlich irgendwelche Warnschüsse, oder um die Typen zu erwischen, keine Ahnung, was auch immer."}, {"id": 40, "start": 741.0, "end": 755.0, "text": "Das war heute in Frankfurt. Hatten sich an einer Bank am Bahnhof unerlaubt Zugriff auf Schließfächer verschafft, also im Prinzip ein Banküberfall, wenn man es so will."}, {"id": 41, "start": 755.0, "end": 773.0, "text": "Können Sie mal einen offiziellen Report angucken. Heute Nachmittag gegen 5 Uhr kam es auf der Düsseldorfer Straße, das ist wirklich direkt, das ist die Straße direkt über am Hauptbahnhof, die Düsseldorfer Straße."}, {"id": 42, "start": 773.0, "end": 796.0, "text": "Das ist das, was quasi angrenzt am Hauptbahnhof. Da ist der Hauptbahnhof und da ist die Düsseldorfer Straße. Das geht wirklich direkt, das ist das, was direkt am Hauptbahnhof vorbeigeht."}, {"id": 43, "start": 796.0, "end": 810.0, "text": "Irgendwo da haben sie eine Bank überfallen anscheinend. Mehrere Personen hatten sich in der Bank unerlaubt Zugriff auf Schließfächer verschafft und dabei den Alarm ausgerissen."}, {"id": 44, "start": 810.0, "end": 821.0, "text": "Scheinen jetzt nicht die big brainsten Banküberfall Leute gewesen zu sein. Anschließend flüchten sie in einem Fahrzeug in Richtung Hauptbahnhof. Moment."}, {"id": 45, "start": 821.0, "end": 827.0, "text": "Da wären sie wahrscheinlich zu Fuß schneller gewesen, das ist ja direkt um die Ecke."}, {"id": 46, "start": 827.0, "end": 832.0, "text": "Drei Männer wurden mittlerweile festgenommen. Die Fahnung nach weiteren Personen bleibt weiterhin bestehen."}, {"id": 47, "start": 832.0, "end": 838.0, "text": "Zu Beginn der Flucht kam es zu einer Schussabgabe seitens der Polizei, dabei wurde er zufolge niemand verletzt."}, {"id": 48, "start": 838.0, "end": 843.0, "text": "Wobei man mal sagen muss, wenn eine Bank überfällt, da muss er mit Rechnen auch verletzt zu werden."}, {"id": 49, "start": 843.0, "end": 852.0, "text": "Der öffentliche Person war zwischenseitig... Ah ja, das war komplett gesperrt. Komplett durch alles. Also ging gar nichts mehr an der Ecke."}, {"id": 50, "start": 852.0, "end": 858.0, "text": "Ok, mehr gibt es nicht. Das ist kurz und knackig."}, {"id": 51, "start": 858.0, "end": 863.0, "text": "Ja, das war heute Banküberfall Frankfurt. Ich sagte doch, in Frankfurt geht es in letzter Zeit übelst ab."}, {"id": 52, "start": 863.0, "end": 867.0, "text": "Vor allem hast du in Frankfurt immer mehr Gestörte unterwegs."}, {"id": 53, "start": 867.0, "end": 880.0, "text": "Immer mehr Gestörte, immer mehr Drogenabhängige, vielleicht nicht mehr, aber immer noch auf ausreichendem Niveau. Mehr braucht man davon nicht."}, {"id": 54, "start": 880.0, "end": 897.0, "text": "Ich glaube nicht, dass ich das auch nur ansatzweise... Also am Hauptbahnhof war eher Oceans 420 angesagt, wenn ich mir die Leute angucke."}, {"id": 55, "start": 897.0, "end": 905.0, "text": "Ohne 420 hätten sie sich wahrscheinlich gar nicht getraut, den Bank zu überfallen."}, {"id": 56, "start": 905.0, "end": 913.0, "text": "Zum Glück hat mich mein Chef heimgefahren. Hast du Glück, dass du netten Chef hast."}, {"id": 57, "start": 913.0, "end": 920.0, "text": "Du bist nicht zufällig 25 weiblich und siehst gut aus. Da würde ich mir Gedanken machen, warum dich dein Chef heimgefahren hat."}, {"id": 58, "start": 920.0, "end": 930.0, "text": "Aber wenn dich dein Chef einfach so eingefahren hat, ist dein Chef wahrscheinlich einfach nett."}, {"id": 59, "start": 930.0, "end": 944.0, "text": "Ach, Sebao, das ist praktisch, ja."}, {"id": 60, "start": 944.0, "end": 950.0, "text": "Ach hier, das Siki, 24 Hermes-Code. Brauchen wir auch noch. Jawoll, schreibe ich mir auf. Dankeschön."}, {"id": 61, "start": 950.0, "end": 960.0, "text": "Ich kann nur Codes benutzen, die innerhalb der letzten 120 Tage verschickt wurden zum Testen, weil danach schmeißen die ganzen Anbieter ihre Sachen weg."}, {"id": 62, "start": 960.0, "end": 968.0, "text": "Halbes Kriegsgebiet in Frankfurt. Ohne Scheiß, in letzter Zeit ist da echt was los."}, {"id": 63, "start": 968.0, "end": 978.0, "text": "Also manchmal hast du echt Bedenken, da lang zu laufen."}, {"id": 64, "start": 978.0, "end": 988.0, "text": "Vielleicht gefällt es auch deinem Chef in der heutigen Zeit, dass das alles kein Problem war."}, {"id": 65, "start": 988.0, "end": 995.0, "text": "Aber ich vermute, dass dein Chef einfach nur nett ist. DHL-Code, Triple X. Schreibe ich mir auch noch auf."}, {"id": 66, "start": 995.0, "end": 1002.0, "text": "Also DHL-Tracking habe ich jetzt jede Menge. Woran liegt das denn?"}, {"id": 67, "start": 1002.0, "end": 1009.0, "text": "Gute Frage, woran das liegt. Also es ist merkwürdig in Frankfurt."}, {"id": 68, "start": 1009.0, "end": 1022.0, "text": "Also es ist prinzipiell so viel, also Bahnöfen um Hauptbahnhof und so, ist so viel Bahnsecurity wie noch nie eigentlich unterwegs."}, {"id": 69, "start": 1022.0, "end": 1025.0, "text": "Und auch Polizei ist relativ viel in Frankfurt unterwegs."}, {"id": 70, "start": 1025.0, "end": 1034.0, "text": "Wir sagen einfach, dass generell die Gewaltbereitschaft der Leute höher ist als früher."}, {"id": 71, "start": 1034.0, "end": 1039.0, "text": "Das wird es wahrscheinlich hauptsächlich sein."}, {"id": 72, "start": 1039.0, "end": 1045.0, "text": "Ja, Maske 95, das spielt er auf jeden Fall mit rein. Auf jeden Fall."}, {"id": 73, "start": 1045.0, "end": 1052.0, "text": "Und was auch mit rein spielt ist, dass sich die Art der Drogen, die sich die Leute am Hauptbahnhof reinhauen geändert hat."}, {"id": 74, "start": 1052.0, "end": 1056.0, "text": "Also früher haben die sich, früher hast du dann oftmals einen zwischen zwei Autos sitzen sehen."}, {"id": 75, "start": 1056.0, "end": 1064.0, "text": "Der hat sich immer seinen, was war denn das wohl? Heroin oder so auf seiner Fanta-Dose aufgewärmt."}, {"id": 76, "start": 1064.0, "end": 1071.0, "text": "Das hast du früher immer gesehen. Ich wusste gar nicht, wozu Fanta-Dosen alles gut sind, bevor ich regelmäßig nach Frankfurt gefahren bin."}, {"id": 77, "start": 1071.0, "end": 1076.0, "text": "Da haben die sich früher immer die Dosen aus dem Mülleimer geholt und haben die aufgeschnitten."}, {"id": 78, "start": 1076.0, "end": 1080.0, "text": "Und haben sich dann irgendwo in die Ecke gesetzt und quasi auf der Dose umgedreht."}, {"id": 79, "start": 1080.0, "end": 1085.0, "text": "Und haben dann so ein Feuerchen unter der Dose gemacht. Das ist dann so ein Mini-Kamin quasi, wenn du das richtig machst in der Dose."}, {"id": 80, "start": 1085.0, "end": 1089.0, "text": "Und haben dann oben drauf ihr Zeug gekocht und aufgezogen."}, {"id": 81, "start": 1089.0, "end": 1094.0, "text": "So und das, das, das in Anführungsstrichen schöne daran, das war absolut big play."}, {"id": 82, "start": 1094.0, "end": 1097.0, "text": "Also was das angeht, waren die echt, waren die echter Fender echt, ne?"}, {"id": 83, "start": 1101.0, "end": 1106.0, "text": "Ja und das in Anführungsstrichen schöne daran war, dass die nicht aggressiv waren."}, {"id": 84, "start": 1106.0, "end": 1110.0, "text": "Die waren, oder selten aggressiv waren, die waren einfach nur fertig mit der Welt."}, {"id": 85, "start": 1110.0, "end": 1114.0, "text": "Die haben einfach nur rumgehongen den ganzen Tag."}, {"id": 86, "start": 1114.0, "end": 1121.0, "text": "Und das, das Beste, was die irgendwie rausgekriegt haben, wenn du vorbeigelaufen bist, war mal irgendwie..."}, {"id": 87, "start": 1121.0, "end": 1125.0, "text": "Oder irgendwie sowas, ja? Mehr, mehr ging da im Endeffekt nicht."}, {"id": 88, "start": 1125.0, "end": 1130.0, "text": "So und mittlerweile ist, siehst halt kaum noch Leute da, die sich irgendwie Heroin spritzen."}, {"id": 89, "start": 1130.0, "end": 1137.0, "text": "Also das Heftigste, was bei, vor ein paar Jahren war mal, da ist bei uns, also direkt schräg gegenüber,"}, {"id": 90, "start": 1137.0, "end": 1140.0, "text": "auf der Straße weiter vom Hauptbahnhof, ist so ein Wäschesalon."}, {"id": 91, "start": 1140.0, "end": 1143.0, "text": "Das ist halt so, weißt du, so mit öffentlichen Waschmaschinen und sowas."}, {"id": 92, "start": 1143.0, "end": 1150.0, "text": "Und da standen die halt mittags, während die auf ihre Wäsche gewartet haben,"}, {"id": 93, "start": 1150.0, "end": 1153.0, "text": "ja ich meine auch Drogenabhängige müssen ihre Wäsche verarschen,"}, {"id": 94, "start": 1153.0, "end": 1158.0, "text": "standen die dort in der Tür, haben dich angegrinst."}, {"id": 95, "start": 1158.0, "end": 1162.0, "text": "Und du hast so gedacht, der guckte aber schon komisch und hast gesehen, da ist eine Spritze im Arm hängen."}, {"id": 96, "start": 1162.0, "end": 1168.0, "text": "Das war, diese Anblick, das war für mich so Frankfurt pur, ja?"}, {"id": 97, "start": 1168.0, "end": 1172.0, "text": "Da ist so, oh fuck, geh weg, ey, was ist da los?"}, {"id": 98, "start": 1172.0, "end": 1180.0, "text": "Ja und ich glaube, das trägt auch dazu bei, dass es heute, gefühlt zumindest so, wie man das beobachten kann,"}, {"id": 99, "start": 1180.0, "end": 1185.0, "text": "wenige Heroinabhängige gibt in Frankfurt, sondern die rauchen alle irgendwas."}, {"id": 100, "start": 1185.0, "end": 1191.0, "text": "Und ich glaube, das Teufel, was die sich da reinpfeifen heute und was die da heute sich reinhauen,"}, {"id": 101, "start": 1191.0, "end": 1194.0, "text": "macht die Leute, glaube ich, aggressiver als Heroin."}, {"id": 102, "start": 1194.0, "end": 1202.0, "text": "Aber die Polizeistatistik soll wohl sagen, Heroin kommt, hat alles, kann schon sein, kann schon sein."}, {"id": 103, "start": 1202.0, "end": 1206.0, "text": "Aber ich sehe sehr, ich sehe viel weniger als früher, welche, die sich was spritzen,"}, {"id": 104, "start": 1206.0, "end": 1210.0, "text": "sondern die rauchen alle irgendwas und ich glaube, das macht, also das, was auch immer die da rauchen,"}, {"id": 105, "start": 1210.0, "end": 1214.0, "text": "macht die Leute aggressiver als früher."}, {"id": 106, "start": 1214.0, "end": 1220.0, "text": "Das ist bestimmt Krokodil, war Krokodil nicht dieses komische russisch zusammengemischte Hinterhof, Drogenzeug?"}, {"id": 107, "start": 1220.0, "end": 1224.0, "text": "Wie lange lebst du schon in Frankfurt? Ich lebe ja nicht direkt in Frankfurt, ich wohne ein bisschen,"}, {"id": 108, "start": 1224.0, "end": 1230.0, "text": "ich wohne ein bisschen nebendran, aber ich fahre schon seit, also ich regelmäßig,"}, {"id": 109, "start": 1230.0, "end": 1235.0, "text": "auf die Arbeit fahre ich da seit, wo liegen sie da zu, 15?"}, {"id": 110, "start": 1235.0, "end": 1240.0, "text": "Ah, nicht ganz, 15 Jahre?"}, {"id": 111, "start": 1240.0, "end": 1247.0, "text": "Nicht ganz, seit 2007 ungefähr."}, {"id": 112, "start": 1247.0, "end": 1254.0, "text": "Bisschen früher schon, aber ich bin früher auch immer regelmäßig in Frankfurt gewesen,"}, {"id": 113, "start": 1254.0, "end": 1258.0, "text": "das ist einfach die größte Stadt in der Nähe, da ist auch im Prinzip immer was los,"}, {"id": 114, "start": 1258.0, "end": 1263.0, "text": "du kriegst alles Mögliche, also nicht das, was jetzt, wenn ich das so sage,"}, {"id": 115, "start": 1263.0, "end": 1268.0, "text": "vorher erst eine halbe Stunde, ja fast mein Teil, fast mein Teil."}, {"id": 116, "start": 1268.0, "end": 1276.0, "text": "Du kriegst halt alle möglichen Sachen, die du brauchst, sei es von Hardware,"}, {"id": 117, "start": 1276.0, "end": 1280.0, "text": "oder sei es eigentlich nur was, was Snackerea machen,"}, {"id": 118, "start": 1280.0, "end": 1286.0, "text": "und ich glaube, es liegt daran, dass die Leute heute aggressiver sind als früher an dem, was sie sich reinhauen."}, {"id": 119, "start": 1286.0, "end": 1292.0, "text": "Ich weiß nicht, ob ihr das mitgekriegt habt, vor ein paar Jahren,"}, {"id": 120, "start": 1292.0, "end": 1296.0, "text": "äh, nicht vor ein paar Jahren, vor ein paar Tagen, das war ja ganz groß in der Presse,"}, {"id": 121, "start": 1296.0, "end": 1300.0, "text": "da haben sich ja alle darüber ausgelassen, dass ein, mittlerweile weiß man es ja,"}, {"id": 122, "start": 1300.0, "end": 1307.0, "text": "dass man das jetzt zusammenkriege, ein, jemand aus Eritrea, also aus Afrika,"}, {"id": 123, "start": 1307.0, "end": 1314.0, "text": "der in der Schweiz gelebt hat, und Illy, also der quasi aus der Schweiz abgehauen ist,"}, {"id": 124, "start": 1314.0, "end": 1318.0, "text": "weil sie ihn gesucht haben, hatte er in Frankfurt Frau plus Kinder von Zug geschmissen,"}, {"id": 125, "start": 1318.0, "end": 1323.0, "text": "das ging ja komplett durch die Presse, das haben wahrscheinlich alle mehr oder weniger mitgekriegt,"}, {"id": 126, "start": 1323.0, "end": 1328.0, "text": "also in Frankfurt ist in letzter Zeit wirklich was los, da geht es echt ab,"}, {"id": 127, "start": 1328.0, "end": 1336.0, "text": "und was ja auch geil ist, ne, die logische, also die big brain Konsequenz,"}, {"id": 128, "start": 1336.0, "end": 1339.0, "text": "die sie jetzt daraus ziehen wollen, ist ja,"}, {"id": 129, "start": 1339.0, "end": 1344.0, "text": "ähm, Barrieren am Bahnsteig aufzustellen,"}, {"id": 130, "start": 1344.0, "end": 1349.0, "text": "wo ich mir auch gedacht habe, wäre es nicht vielleicht sinnvoller, irgendwie dafür zu sorgen,"}, {"id": 131, "start": 1349.0, "end": 1352.0, "text": "dass Leute nicht vor den Zug geschmissen werden,"}, {"id": 132, "start": 1352.0, "end": 1358.0, "text": "anstatt jetzt Barrieren aufzustellen, dass Leute nicht mehr so einfach vor den Zug geworfen werden können,"}, {"id": 133, "start": 1358.0, "end": 1363.0, "text": "das klingt für mich irgendwie voll abstrusso, wenn ich mir das so, wenn ich mir das so anhör, ja,"}, {"id": 134, "start": 1363.0, "end": 1370.0, "text": "the fuck, ich hatte noch nie Bedenken, dass mich irgendjemand vor den Zug wirft,"}, {"id": 135, "start": 1370.0, "end": 1377.0, "text": "so vielleicht jetzt, ja, ja, das ist echt irgendwie verkehrt rum, ja,"}, {"id": 136, "start": 1377.0, "end": 1385.0, "text": "man sollte doch dafür sorgen, dass das nicht vorkommt und nicht, dass es schwieriger ist,"}, {"id": 137, "start": 1385.0, "end": 1400.0, "text": "das verstehe ich nicht so genau, also das leuchtet mir nicht ein,"}, {"id": 138, "start": 1400.0, "end": 1406.0, "text": "Frankfurt ist in Deutschland auch die Stadt, wo viele den American Dream suchen,"}, {"id": 139, "start": 1406.0, "end": 1422.0, "text": "naja gut, ähm, was Banken angeht, gibt es ja in, gibt es ja nicht viel Vergleichbares in Deutschland oder in Europa,"}, {"id": 140, "start": 1422.0, "end": 1426.0, "text": "warst du schon mal bei Helter Steine, nein, aber ich habe den letztens gesehen,"}, {"id": 141, "start": 1426.0, "end": 1431.0, "text": "der ist mir letztens entgegengelaufen, ich dachte mir so, wo will ich zum Südbahnhof,"}, {"id": 142, "start": 1431.0, "end": 1436.0, "text": "den hast du, den kennst du doch, den hast du schon mal irgendwo gesehen und da habe ich darüber nachgedacht,"}, {"id": 143, "start": 1436.0, "end": 1456.0, "text": "da habe ich mir gedacht, das war 100% Helter Steine."}, {"id": 144, "start": 1456.0, "end": 1474.0, "text": "Ja, das ist baru, das stimmt, das muss ich machen, das mache ich vor dem Stream, wo wir das mit den E-Mails gerne ausprobieren."}, {"id": 145, "start": 1474.0, "end": 1489.0, "text": "Clocks Royal Mail will ich eigentlich nicht einbauen zum tracken, naja gut, ich würde sagen, da fangen wir mal an,"}, {"id": 146, "start": 1489.0, "end": 1497.0, "text": "ähm, Visual Studio aufmachen, achso, wisst ihr was wir auch noch machen könnten,"}, {"id": 147, "start": 1497.0, "end": 1504.0, "text": "ähm, wir könnten uns auch, ich weiß nicht, ob ihr es schon gesehen habt, also ich habe es nicht gesehen, aber ich habe gesehen,"}, {"id": 148, "start": 1504.0, "end": 1510.0, "text": "dass es das gibt, wir könnten uns mal ein bisschen Ausschnitt von Modern Warfare Gameplay angucken,"}, {"id": 149, "start": 1510.0, "end": 1516.0, "text": "da gab es wohl gestern ein Stream, wo sie das gezeigt haben, ich habe mir noch nichts davon angeguckt, gar nichts,"}, {"id": 150, "start": 1516.0, "end": 1524.0, "text": "ich habe nur auf Twitter gelesen, ich habe nur auf Twitter gelesen, dass es wohl verhältnismäßig gut ausschaut und es keine Minimap gibt."}, {"id": 151, "start": 1524.0, "end": 1532.0, "text": "Aber eine Konsolen-App, Konsolen-App geht immer."}, {"id": 152, "start": 1532.0, "end": 1544.0, "text": "Volle 3 Stunden angucken, ich kann mir keine 3 Stunden Cod angucken, ich habe schon, ich deinstalliere schon Cod nach 3 Stunden spielen,"}, {"id": 153, "start": 1544.0, "end": 1555.0, "text": "wobei Video angucken ist nicht so belastend wie selber spielen."}, {"id": 154, "start": 1555.0, "end": 1567.0, "text": "So wir sind schon bei Konsolen-App 12, das passt natürlich, wir sind ja hier die Konsolen-App-Helden schlechthin in letzter Zeit."}, {"id": 155, "start": 1567.0, "end": 1577.0, "text": "Ups, was mache ich denn da? Press any key to exit."}, {"id": 156, "start": 1577.0, "end": 1582.0, "text": "Warum gibt es eigentlich als Makro nicht CR für Konsolen-Readline?"}, {"id": 157, "start": 1582.0, "end": 1593.0, "text": "Ich weiß, dass ich mir das anlegen kann, aber warum ist das nicht standardmäßig drin, das wäre doch Pock, wenn das dabei wäre."}, {"id": 158, "start": 1593.0, "end": 1605.0, "text": "Metallica hat einen Cod-Trailer gemacht? Oder meinst du einen neuen Trailer für irgendwas von Metallica, also jetzt nicht irgendwie was mit Cod was zu tun hat."}, {"id": 159, "start": 1605.0, "end": 1612.0, "text": "Metallica ist im Trailer, na gut, die haben ja alles mögliche schon durch."}, {"id": 160, "start": 1612.0, "end": 1618.0, "text": "Da gucken wir uns mal an, gucken wir uns mal an, also wenn Metallica im Trailer ist, da müssen wir uns das mal angucken."}, {"id": 161, "start": 1618.0, "end": 1623.0, "text": "Cod."}, {"id": 162, "start": 1623.0, "end": 1630.0, "text": "Vor 23 Stunden."}, {"id": 163, "start": 1630.0, "end": 1632.0, "text": "Pock-Musik."}, {"id": 164, "start": 1632.0, "end": 1640.0, "text": "Hoffentlich mache ich es nicht zu laut, äh Moment, das ist gar kein Trailer."}, {"id": 165, "start": 1640.0, "end": 1648.0, "text": "Ja das ist eindeutig interessant, aber wo ist... Wo ist der Trailer?"}, {"id": 166, "start": 1648.0, "end": 1654.0, "text": "Ja, nee. Reveal-Song?"}, {"id": 167, "start": 1654.0, "end": 1660.0, "text": "Trailer-Song?"}, {"id": 168, "start": 1660.0, "end": 1670.0, "text": "Ja, der hat einen geflame-Haze. Reveal, okay mal MW Reveal, machen wir mal hier mal. Das da, ha?"}, {"id": 169, "start": 1670.0, "end": 1676.0, "text": "Sagt mir mal ob das der richtige ist, ich habe da einen Link gepostet."}, {"id": 170, "start": 1676.0, "end": 1687.0, "text": "Okay, da ist das der richtige. Also was mich schon mal sehr zuversichtlich macht ist das hier."}, {"id": 171, "start": 1687.0, "end": 1695.0, "text": "Guck mal."}, {"id": 172, "start": 1695.0, "end": 1703.0, "text": "Ich verwirrte es ja immer noch, dass das einfach nur Modern Warfare heißt."}, {"id": 173, "start": 1703.0, "end": 1721.0, "text": "Wo ist der Hund? Wo ist der Hund? Ich hab gehofft der Hund kommt wieder."}, {"id": 174, "start": 1721.0, "end": 1739.0, "text": "Da, da, da."}, {"id": 175, "start": 1739.0, "end": 1763.0, "text": "Grills auch dabei."}, {"id": 176, "start": 1763.0, "end": 1779.0, "text": "Das sieht aus wie Kot."}, {"id": 177, "start": 1779.0, "end": 1799.0, "text": "Am wenigsten hat es gute Musik drunter. Nein das ist Enter Sandman, eindeutig."}, {"id": 178, "start": 1799.0, "end": 1811.0, "text": "Er fängt ja gar nicht an rumzuschreien. Ah gut. Es hat ein bisschen was von Rainbow Six."}, {"id": 179, "start": 1811.0, "end": 1834.0, "text": "Huge singing skills. Juggernaut. Moment. Was, was, was, Operation? Ist das jetzt ein Singleplayer Trailer? Nee Multiplayer."}, {"id": 180, "start": 1834.0, "end": 1846.0, "text": "Was stand da eben von Operation? Operation? Also der Name erinnert mich voll an Battlefield."}, {"id": 181, "start": 1846.0, "end": 1868.0, "text": "Operation Krasna Raid? Was sonst? Was sonst? Wenn uns nichts mehr einfällt ist mal wieder in Russland Invasion angesagt."}, {"id": 182, "start": 1868.0, "end": 1876.0, "text": "Wieviel Granaten konnte der gerade schmeißen? Ah nee nur einer."}, {"id": 183, "start": 1876.0, "end": 1900.0, "text": "Der Panzer. Oh das Killstreak. Was heißt das Killstreak? Tank Drop, Killstreak oder sowas."}, {"id": 184, "start": 1900.0, "end": 1907.0, "text": "Wie soll das funktionieren? Ach was macht der? Moment."}, {"id": 185, "start": 1907.0, "end": 1926.0, "text": "Der steckt im Holz drin oder? Deswegen sieht das auch so merkwürdig aus."}, {"id": 186, "start": 1926.0, "end": 1946.0, "text": "Der Trailer ist nice. Das gefällt mir. Ich frag mich wo sie die Sprecher immer herkriegen."}, {"id": 187, "start": 1946.0, "end": 1956.0, "text": "Wo haben sie die Sprecher immer her? Die hören sich immer alle exakt gleich an."}, {"id": 188, "start": 1956.0, "end": 1960.0, "text": "Jetzt hab ich mich erst über den Sprecher lustig gemacht. Ich muss mir mal Gedanken über den Inhalt machen."}, {"id": 189, "start": 1960.0, "end": 1978.0, "text": "Warum muss ich Pre-Orderen um Zugang zur Open Beta zu kriegen? Das ist Activision 900 IQ."}, {"id": 190, "start": 1978.0, "end": 2000.0, "text": "Das ist die übliche Geschichte, dass er 2 Tage früher spielen darf. Bringt mir eh nix."}, {"id": 191, "start": 2000.0, "end": 2016.0, "text": "Ich will nicht erst auf PS4 spielen. Ich möchte erst auf Xbox spielen, aber am liebsten auf allen Plattformen."}, {"id": 192, "start": 2016.0, "end": 2030.0, "text": "Ich kann mit dem Playstation Controller nicht spielen. Ich kann so was wie Uncharted spielen."}, {"id": 193, "start": 2030.0, "end": 2054.0, "text": "Meine Hände sind nicht PS-Dualshock-kompatibel. Ich weiß, ich habe einen Xbox auf Playstation Adapter."}, {"id": 194, "start": 2054.0, "end": 2064.0, "text": "Ich kann es damit theoretisch spielen."}, {"id": 195, "start": 2064.0, "end": 2092.0, "text": "Als spielt irgendjemand, der 18 ist dieses Spiel, 60, 70, 80% Leute, die nicht in dem Alter sind."}, {"id": 196, "start": 2092.0, "end": 2102.0, "text": "Ich wollte jetzt ein bisschen Progress machen."}, {"id": 197, "start": 2102.0, "end": 2126.0, "text": "Dann haben sie wenigstens mal einen, der ordentlich spielen kann. Die Typen, die sind bei diesem 2-on-2-Modus, das war ja nix."}, {"id": 198, "start": 2126.0, "end": 2136.0, "text": "Was sonst? Erstmal 3 Stunden Waffenauswahl. Wann geht es ins Game?"}, {"id": 199, "start": 2136.0, "end": 2150.0, "text": "Keine Mini-Map. Multi-Per-Premier 6-on-6. Das ist nicht 6-on-6-Domination."}, {"id": 200, "start": 2150.0, "end": 2160.0, "text": "Wenn du das Game nicht kennst, ist es für alle gleich. Schraut ist jemand, der das Game 5 Stunden spielt."}, {"id": 201, "start": 2160.0, "end": 2170.0, "text": "Und jemand anderes spielt das Game 5 Stunden. Der ist einfach doppelt so gut."}, {"id": 202, "start": 2170.0, "end": 2180.0, "text": "Ich habe jetzt extra dafür einen neuen Sound."}, {"id": 203, "start": 2180.0, "end": 2194.0, "text": "Moment, das ist gar kein Prime-Subscriber. Egal."}, {"id": 204, "start": 2194.0, "end": 2206.0, "text": "Wie spricht man das denn richtig aus?"}, {"id": 205, "start": 2206.0, "end": 2218.0, "text": "Jetzt wird erstmal der Hardscope rausgeholt. Da ist er schon mal vorbei."}, {"id": 206, "start": 2218.0, "end": 2226.0, "text": "Das wäre doch mal was."}, {"id": 207, "start": 2226.0, "end": 2234.0, "text": "Ich bin hier in der Science-and-Technology-Kategorie. Und außerdem wollte ich ein bisschen Progress machen."}, {"id": 208, "start": 2234.0, "end": 2242.0, "text": "Ich fühle mich gerade in der Lage, ordentlich Progress-Progress zu machen."}, {"id": 209, "start": 2242.0, "end": 2248.0, "text": "Ich bin in der Lage, mich konzentrieren zu können. Deswegen müssen wir jetzt mal Progress machen."}, {"id": 210, "start": 2248.0, "end": 2256.0, "text": "Da stelle ich mal die Kategorie auf Cod um. Da gucken wir uns morgen mal das Gameplay an."}, {"id": 211, "start": 2256.0, "end": 2266.0, "text": "Und ich gebe meinen Senf dazu ab. Aber während wir jetzt anfangen, müssen wir mal hier."}, {"id": 212, "start": 2266.0, "end": 2274.0, "text": "Schöne, bessere Qualität als die Uralt-Aufnahmen."}, {"id": 213, "start": 2274.0, "end": 2278.0, "text": "Ein übelst nicer Song ist das."}, {"id": 214, "start": 2278.0, "end": 2282.0, "text": "Bist du heute 34 geworden? Nein. Das ist eigentlich lustig."}, {"id": 215, "start": 2282.0, "end": 2286.0, "text": "Das haben alle was geschrieben. Von wegen hier, feels, birthday, mein Geburtstag, alles gut."}, {"id": 216, "start": 2286.0, "end": 2290.0, "text": "Es hat mich keiner gefragt, wie alt ich geworden bin."}, {"id": 217, "start": 2290.0, "end": 2296.0, "text": "Außer, dass ihr bei Hoherz... Ich habe 50, 50 habe ich gelesen."}, {"id": 218, "start": 2296.0, "end": 2302.0, "text": "50 hat jemand geschrieben."}, {"id": 219, "start": 2302.0, "end": 2306.0, "text": "34 hat jemand geschrieben."}, {"id": 220, "start": 2306.0, "end": 2312.0, "text": "Ich meine, ich habe es schon ein paar Mal im Stream gesagt."}, {"id": 221, "start": 2312.0, "end": 2318.0, "text": "420, 69. Ja, was ist die Sache? Es kann alles sein."}, {"id": 222, "start": 2318.0, "end": 2322.0, "text": "Ne, 35. 35 bin ich geworden."}, {"id": 223, "start": 2322.0, "end": 2350.0, "text": "35."}, {"id": 224, "start": 2350.0, "end": 2366.0, "text": "Metal, genau."}, {"id": 225, "start": 2366.0, "end": 2370.0, "text": "Ein Sub, super, grobi10, Twitch Prime, Dankeschön."}, {"id": 226, "start": 2370.0, "end": 2386.0, "text": "Moment, Moment, das hat man jetzt nicht gehört."}, {"id": 227, "start": 2386.0, "end": 2394.0, "text": "Wartet mal, ich habe eine Idee, was wir jetzt machen."}, {"id": 228, "start": 2394.0, "end": 2400.0, "text": "Das passt nämlich ganz gut."}, {"id": 229, "start": 2400.0, "end": 2428.0, "text": "Okay, ich lasse euch meine Singskills sparen."}, {"id": 230, "start": 2428.0, "end": 2440.0, "text": "Ich spare euch meine Singskills."}, {"id": 231, "start": 2440.0, "end": 2462.0, "text": "Ich kann die meisten All-Metallica-Texte auswendig."}, {"id": 232, "start": 2462.0, "end": 2486.0, "text": "Okay, ich kann es noch nicht mehr, komplett auswendig."}, {"id": 233, "start": 2486.0, "end": 2502.0, "text": "Ey, das ist ewig her."}, {"id": 234, "start": 2502.0, "end": 2516.0, "text": "Wir müssen unbedingt einbauen, dass man verschiedene Größen haben kann."}, {"id": 235, "start": 2516.0, "end": 2530.0, "text": "Wir müssen ein bisschen Metallica-Musik mal anmachen."}, {"id": 236, "start": 2530.0, "end": 2534.0, "text": "Das piepst, oder?"}, {"id": 237, "start": 2534.0, "end": 2538.0, "text": "Jetzt hört man es nicht mehr."}, {"id": 238, "start": 2538.0, "end": 2544.0, "text": "Doch, das piepst. Was ist das für eine Kackaufnahme?"}, {"id": 239, "start": 2544.0, "end": 2568.0, "text": "Die sind zu hell."}, {"id": 240, "start": 2568.0, "end": 2574.0, "text": "Alter, sind die alt geworden."}, {"id": 241, "start": 2574.0, "end": 2584.0, "text": "Das ist von 2009, da waren die noch älter."}, {"id": 242, "start": 2584.0, "end": 2588.0, "text": "Super, grobi. Kann ich mich leider nicht daran erinnern."}, {"id": 243, "start": 2588.0, "end": 2602.0, "text": "Die zwei Gameplays kann man immer brauchen, wenn ich mal Videos machen würde."}, {"id": 244, "start": 2602.0, "end": 2612.0, "text": "Eigentlich bin ich total bescheuert, ich habe doch Amazon Music."}, {"id": 245, "start": 2612.0, "end": 2618.0, "text": "Ich kann das direkt anmachen."}, {"id": 246, "start": 2618.0, "end": 2644.0, "text": "Das ist ein Rippherz, Wort ist eh Ripp."}, {"id": 247, "start": 2644.0, "end": 2650.0, "text": "Es gibt viel zu wenig Leute, die Heavy Metal mögen heutzutage, finde ich."}, {"id": 248, "start": 2650.0, "end": 2654.0, "text": "Ich meine, es gibt immer noch viele, es ist ja gratis Wacken hier dieses Wochenende."}, {"id": 249, "start": 2654.0, "end": 2664.0, "text": "Wenn mich nicht alles täuscht, dann wird es wieder voll sein."}, {"id": 250, "start": 2664.0, "end": 2678.0, "text": "Aber es gibt mit Sicherheit in Deutschland deutlich mehr, die Haftbefehle hören, als Leute, die Metallica hören."}, {"id": 251, "start": 2678.0, "end": 2690.0, "text": "Das ist das einzige, was ich von Haftbefehlen gemerkt habe."}, {"id": 252, "start": 2690.0, "end": 2694.0, "text": "Mehr kann ich nicht."}, {"id": 253, "start": 2694.0, "end": 2696.0, "text": "Muss man auch nicht können."}, {"id": 254, "start": 2696.0, "end": 2710.0, "text": "Es ist nicht unbedingt, dass das hervorzuheben wäre, wenn man krasse Haftbefehl Lyrics kann."}, {"id": 255, "start": 2710.0, "end": 2732.0, "text": "Ich bin immer noch der Ansicht, da werde ich mich wahrscheinlich nahe zu Metallica-Fans zuziehen."}, {"id": 256, "start": 2732.0, "end": 2742.0, "text": "Ich habe das ja früher auch sehr oft gehört."}, {"id": 257, "start": 2742.0, "end": 2748.0, "text": "Aber ich finde, was Metallica echt gut getan hätte, wäre ein ordentlicher Sänger."}, {"id": 258, "start": 2748.0, "end": 2754.0, "text": "Die Musik ist übelst nice, aber ich kann mit dem Gesang heute überhaupt nichts mehr anfangen."}, {"id": 259, "start": 2754.0, "end": 2766.0, "text": "Vor allem, weil er auf allen Aufnahmen, während er singt, macht er immer yeah oder so etwas."}, {"id": 260, "start": 2766.0, "end": 2768.0, "text": "Das geht mir voll auf den Sack."}, {"id": 261, "start": 2768.0, "end": 2780.0, "text": "Was habe ich Pluton an?"}, {"id": 262, "start": 2780.0, "end": 2786.0, "text": "So, in was fangen wir an?"}, {"id": 263, "start": 2786.0, "end": 2792.0, "text": "Ich würde sagen, wir gucken jetzt erstmal, wie man Chrome fernstellen kann, bevor wir das mit der Website ausprobieren."}, {"id": 264, "start": 2792.0, "end": 2796.0, "text": "Hallo Tante Micha."}, {"id": 265, "start": 2796.0, "end": 2802.0, "text": "Hafti ist schon längst out."}, {"id": 266, "start": 2802.0, "end": 2806.0, "text": "Jetzt ist Capital Bra der neueste Scheiß."}, {"id": 267, "start": 2806.0, "end": 2808.0, "text": "Habe ich noch nie gehört."}, {"id": 268, "start": 2808.0, "end": 2822.0, "text": "Ich habe nur letztens in einem Artikel gelesen, dass Kolega jetzt seine ultra krassen Fanboys mit einem..."}, {"id": 269, "start": 2822.0, "end": 2824.0, "text": "Wie nennt das?"}, {"id": 270, "start": 2824.0, "end": 2826.0, "text": "Boss?"}, {"id": 271, "start": 2826.0, "end": 2832.0, "text": "Alfa-Mentoring oder so."}, {"id": 272, "start": 2832.0, "end": 2834.0, "text": "Skamast."}, {"id": 273, "start": 2834.0, "end": 2836.0, "text": "Nicht Boss-Transformation."}, {"id": 274, "start": 2836.0, "end": 2838.0, "text": "Boss-Transformation ist ja out."}, {"id": 275, "start": 2838.0, "end": 2844.0, "text": "Du kannst jetzt bei Kolega irgendwie so nen Mäntel..."}, {"id": 276, "start": 2844.0, "end": 2848.0, "text": "Wie werde ich auch krasser Alfa-Kurs buchen?"}, {"id": 277, "start": 2848.0, "end": 2852.0, "text": "Für irgendwie läppische 2K."}, {"id": 278, "start": 2852.0, "end": 2854.0, "text": "Oder 2000 im Monat irgendwie."}, {"id": 279, "start": 2854.0, "end": 2856.0, "text": "Ist übelst da hängen geblieben auf jeden Fall."}, {"id": 280, "start": 2856.0, "end": 2862.0, "text": "Also egal ob 2000 oder 2000 im Monat, das macht es ja auch schon gar nicht mehr auf."}, {"id": 281, "start": 2862.0, "end": 2864.0, "text": "Macht es ja auch schon gar nicht mehr aus."}, {"id": 282, "start": 2864.0, "end": 2868.0, "text": "Ich meine, auf die Idee kommt..."}, {"id": 283, "start": 2868.0, "end": 2876.0, "text": "Das kann doch eigentlich nur jemand auf die Idee kommen da mitzumachen, der einfach Hardcore-Kolega-Fan ist."}, {"id": 284, "start": 2876.0, "end": 2880.0, "text": "Und so ein bisschen die Kontrolle über sein Leben verloren hat."}, {"id": 285, "start": 2880.0, "end": 2888.0, "text": "Jetzt im wörtlichen Sinn."}, {"id": 286, "start": 2888.0, "end": 2892.0, "text": "Hat er wegen Backlash aber auch schon wieder abgesagt."}, {"id": 287, "start": 2892.0, "end": 2904.0, "text": "Der Mäntel ist von vor einem Tag gewesen und bis dahin ist das auch noch gelaufen."}, {"id": 288, "start": 2904.0, "end": 2906.0, "text": "Kennste keine Aufschieberittes?"}, {"id": 289, "start": 2906.0, "end": 2908.0, "text": "Doch, doch klar, das hat jeder."}, {"id": 290, "start": 2908.0, "end": 2912.0, "text": "Jedes Mal wenn ich irgendwas machen muss, gucke ich erst mal 2 Stunden YouTube-Videos bevor ich was mache."}, {"id": 291, "start": 2912.0, "end": 2914.0, "text": "Das ist immer so."}, {"id": 292, "start": 2914.0, "end": 2920.0, "text": "Also immer wenn es was ist, was ich nicht gerne mache."}, {"id": 293, "start": 2920.0, "end": 2930.0, "text": "Also zumindest stand das in diesem Artikel drin, dass du quasi bei diesem geilen Alpha-Mentoring-Programm mitmachen darfst,"}, {"id": 294, "start": 2930.0, "end": 2934.0, "text": "musstest du erst mal einen Fragebogen ausfüllen."}, {"id": 295, "start": 2934.0, "end": 2942.0, "text": "Und in dem Fragebogen wurde natürlich rein zufällig auch abgefragt, wie so deine finanziellen Verhältnisse sind."}, {"id": 296, "start": 2942.0, "end": 2950.0, "text": "Und wahrscheinlich haben sie gleich die Leute aussortiert, die gesagt haben, sie haben kein Geld."}, {"id": 297, "start": 2950.0, "end": 2956.0, "text": "Übrigens letztens war auf Twitter ein Trend, vor was man Angst hat."}, {"id": 298, "start": 2956.0, "end": 2964.0, "text": "Und ich habe geschrieben, es gibt noch mehr, aber man konnte glaube ich maximal 3 Sachen schreiben."}, {"id": 299, "start": 2964.0, "end": 2968.0, "text": "Ich habe geschrieben Kinder, Java und Overwatch Ranked."}, {"id": 300, "start": 2968.0, "end": 2976.0, "text": "Hätte ich noch mehr schreiben können, aber das trifft es eigentlich ganz gut."}, {"id": 301, "start": 2976.0, "end": 2984.0, "text": "Ich wollte nicht, ich meine ich hätte auch komplett Menschen hinschreiben können, ja."}, {"id": 302, "start": 2984.0, "end": 2988.0, "text": "Aber Kinder gehen mir besonders auf den Kicks."}, {"id": 303, "start": 2988.0, "end": 2996.0, "text": "Vor allem im Zug."}, {"id": 304, "start": 2996.0, "end": 3004.0, "text": "Also, Puppetier brauchen wir zum Chrome Fernsteuern."}, {"id": 305, "start": 3004.0, "end": 3006.0, "text": "Schauen wir mal wie das geht. Das ist übrigens auch eine schöne Sache."}, {"id": 306, "start": 3006.0, "end": 3016.0, "text": "Ich habe mit dem original Node.js Ding, habe ich für die Arme halt mal was gebastelt."}, {"id": 307, "start": 3016.0, "end": 3026.0, "text": "Also mit dem original Chrome Fernsteuern. Und zwar ist das so, dass unser Support"}, {"id": 308, "start": 3026.0, "end": 3038.0, "text": "mehrfach am Tag Spam E-Mails accepten, also Spam E-Mails aus dem Spam Ordner quasi freigeben."}, {"id": 309, "start": 3038.0, "end": 3044.0, "text": "Und das ist ganz schön ätzend im Endeffekt."}, {"id": 310, "start": 3044.0, "end": 3052.0, "text": "Und da habe ich Chrome genommen, dieses Puppetier für Node.js."}, {"id": 311, "start": 3052.0, "end": 3058.0, "text": "Und habe einfach die paar Klicks, die man im Web-Interface macht, nachgebaut in Node.js."}, {"id": 312, "start": 3058.0, "end": 3060.0, "text": "Und seitdem funktioniert das wunderbar."}, {"id": 313, "start": 3060.0, "end": 3066.0, "text": "Da werden jetzt automatisch einmal in der Stunde alle Spam E-Mails freigegeben."}, {"id": 314, "start": 3066.0, "end": 3070.0, "text": "Also prinzipiell weiß ich, wie man das verwendet, so halbwegs."}, {"id": 315, "start": 3070.0, "end": 3074.0, "text": "Und es funktioniert echt gut."}, {"id": 316, "start": 3074.0, "end": 3086.0, "text": "So, also installieren wir den Kram erstmal."}, {"id": 317, "start": 3086.0, "end": 3100.0, "text": "Irgendwie ist es jetzt, nachdem wir da Metallica gehört haben, kann ich mir jetzt gerade irgendwie kein Chillgestappe geben."}, {"id": 318, "start": 3100.0, "end": 3116.0, "text": "Das ganze Album ist auf YouTube."}, {"id": 319, "start": 3116.0, "end": 3124.0, "text": "Mittlerweile haben sie..."}, {"id": 320, "start": 3124.0, "end": 3130.0, "text": "Das ist sicherlich nur eine private Sicherheitskopie, die man halt irgendwo offsite speichern musste."}, {"id": 321, "start": 3130.0, "end": 3138.0, "text": "Jaja, bla bla bla."}, {"id": 322, "start": 3138.0, "end": 3142.0, "text": "Jetzt müssen wir mal ein bisschen zackigere Sachen hören."}, {"id": 323, "start": 3142.0, "end": 3144.0, "text": "Glory Hammer, übelst nice."}, {"id": 324, "start": 3144.0, "end": 3152.0, "text": "Die haben letztes Jahr noch ein neues Album rausgebracht, aber das da finde ich immer noch besser, das beste von ihnen bisher."}, {"id": 325, "start": 3152.0, "end": 3156.0, "text": "Ich muss ein bisschen leiser machen, oder?"}, {"id": 326, "start": 3156.0, "end": 3166.0, "text": "Geht das so?"}, {"id": 327, "start": 3166.0, "end": 3168.0, "text": "Ok, Puppetier, wo ist er?"}, {"id": 328, "start": 3168.0, "end": 3174.0, "text": "Puppetier, scharp."}, {"id": 329, "start": 3174.0, "end": 3186.0, "text": "Äh, was ist denn?"}, {"id": 330, "start": 3186.0, "end": 3192.0, "text": "Ja, da."}, {"id": 331, "start": 3192.0, "end": 3196.0, "text": "Was Richtige."}, {"id": 332, "start": 3196.0, "end": 3202.0, "text": "Kannst du mal einen VS Code Einführungstream machen?"}, {"id": 333, "start": 3202.0, "end": 3210.0, "text": "Allerdings gibt es eigentlich nicht viel in Original Studio Code zum Einführen."}, {"id": 334, "start": 3210.0, "end": 3238.0, "text": "Äh, das ist ohne Witz. So viel gibt es eigentlich gar nicht."}, {"id": 335, "start": 3238.0, "end": 3252.0, "text": "So, Accept."}, {"id": 336, "start": 3252.0, "end": 3256.0, "text": "Wofür braucht man CMDR?"}, {"id": 337, "start": 3256.0, "end": 3258.0, "text": "Ne, brauchen tust du das gar nicht."}, {"id": 338, "start": 3258.0, "end": 3262.0, "text": "Also, es ist ganz nützlich, wenn man ein ordentliches Terminal braucht."}, {"id": 339, "start": 3262.0, "end": 3269.0, "text": "Weil ich mein, das da ist halt kein ordentliches Terminal."}, {"id": 340, "start": 3269.0, "end": 3272.0, "text": "Das ist eher Rudeface."}, {"id": 341, "start": 3272.0, "end": 3275.0, "text": "Das war auch so was, das geht nur auf Twitch."}, {"id": 342, "start": 3275.0, "end": 3281.0, "text": "Das würde beispielsweise auf Mixer nicht funktionieren, weil da gibt es die E-Modes nicht."}, {"id": 343, "start": 3281.0, "end": 3293.0, "text": "Mixer ist jetzt ja die Zeit Ninja, dahin gewechselt ist die zweit Milestone gelotete Entertainment App im letzten, in diesem Jahr oder so."}, {"id": 344, "start": 3293.0, "end": 3319.0, "text": "Okay, die meisten Leute sind wirklich keine Heavy Metal Fans. Eben hatte ich irgendwie 105 und jetzt habe ich 80. Einfach mal alle raus, alle weg, alle abgeschaltet."}, {"id": 345, "start": 3319.0, "end": 3325.0, "text": "Was kann CMDR mehr und was ist anders?"}, {"id": 346, "start": 3325.0, "end": 3339.0, "text": "Du kannst ordentlich copy-pasten, du hast ein paar Linux-Commando-Zeilenbefehle, du kannst das Fenster ordentlich resizen, du kannst das Fenster per Shortcuts bedienen, du kannst das ein ordentliches Farbschema geben, was mit CMDR nicht geht."}, {"id": 347, "start": 3339.0, "end": 3349.0, "text": "Du kannst verschiedene Shells einstellen, du kannst Tabs haben, du kannst im Prinzip alles machen, was man mit einem ordentlichen Terminal machen kann und was man mit CMDR nicht machen kann."}, {"id": 348, "start": 3349.0, "end": 3354.0, "text": "Wobei man sagen muss, CMDR ist so ein bisschen schwammig."}, {"id": 349, "start": 3354.0, "end": 3370.0, "text": "Das da, was da läuft, ist eigentlich, also normalerweise muss man das unterscheiden. Es gibt das Terminal-Programm, das ist das Fenster, was den Text darstellt und es gibt eine Shell, die da drin läuft. Bei Windows ist das alles CMD in einem."}, {"id": 350, "start": 3370.0, "end": 3390.0, "text": "Was für Shell gibt es denn dann vorinstalliert? PowerShell, CMD und WSL, wenn man WSL installiert hat. Aber ich habe WSL nicht installiert."}, {"id": 351, "start": 3390.0, "end": 3408.0, "text": "Bash, ich kann es gar nicht drinnen sagen. Ah ja, die Bash geht Shell, wenn sie installiert ist. ZSH, ja gut, ZSH kannst du unter WSL installieren."}, {"id": 352, "start": 3408.0, "end": 3417.0, "text": "Das neue Windows-Terminal geht in die richtige Richtung, aber es ist noch zu langsam."}, {"id": 353, "start": 3417.0, "end": 3428.0, "text": "Okay, also wir haben jetzt den Cramper installiert. Da können wir jetzt mal versuchen, Chrome fernzusteuern."}, {"id": 354, "start": 3428.0, "end": 3434.0, "text": "Take screenshots, generate, inject, HTML."}, {"id": 355, "start": 3434.0, "end": 3438.0, "text": "Wait for function, wait for selector."}, {"id": 356, "start": 3438.0, "end": 3456.0, "text": "New page async, ich muss noch kurz gucken, wie der Cramper-Abricht funktioniert, hier dotnet-technisch."}, {"id": 357, "start": 3456.0, "end": 3464.0, "text": "Page, await browser."}, {"id": 358, "start": 3464.0, "end": 3482.0, "text": "Na gut, wo lege ich browser überhaupt an? Ah hier, ne."}, {"id": 359, "start": 3482.0, "end": 3495.0, "text": "Also kann man eine Shell wie SH, ZSH auch auf Windows benutzen? Mit WSL geht das ja. WSL ist ja im Prinzip ein Linux, was unter Windows läuft."}, {"id": 360, "start": 3495.0, "end": 3512.0, "text": "Du kannst aber auch einfach, und das ging schon immer, du kannst ja einfach per SSH auf eine Linux-Kiste, ach ja, ein eingebautes SSH hat es übrigens auch, also du kannst ja einfach per SSH auf eine Linux-Kiste verbinden. Aber mit WSL kannst du auch alle möglichen, das ist nur Ubuntu standardmäßig."}, {"id": 361, "start": 3512.0, "end": 3526.0, "text": "Wie starte ich da? Da haben die ordentliche Examples, Demos hier. Chart-PDF-Demo. Launch-Option, Headless True."}, {"id": 362, "start": 3526.0, "end": 3542.0, "text": "Browser-Fetcher. Ach ja klar, der muss natürlich erstmal die Chrome-Binaries runterladen, das ist logisch. Ubuntu, genau."}, {"id": 363, "start": 3542.0, "end": 3556.0, "text": "Hast du das neue Terminal schon angeschaut? Ja, haben wir gemacht. Ach, das haben wir schon vor einem Monat oder so gemacht, als es ganz neu war. Ich habe extra damals eine Windows vor allem installiert, mit der neuesten Windows-Version, nur um das Terminal ausprobieren zu können."}, {"id": 364, "start": 3556.0, "end": 3580.0, "text": "Was willst du eigentlich mit Puppetier zaubern? Ich will Pakete verfolgen als Backup zur offiziellen API von den Anbietern. Und vielleicht für Hermes, weil Hermes keine offizielle API hat. Und weil ich generell gucken will, wie man es mit.NET verwendet."}, {"id": 365, "start": 3580.0, "end": 3599.0, "text": "Ok, New Browser-Fetcher. Wo soll ich jetzt gleich mal angucken, wie der Kram funktioniert. New Browser-Fetcher. Das machen wir mal. Also, wenn ich das jetzt richtig sehe, downloadet mir das jetzt den neuesten Chrome."}, {"id": 366, "start": 3599.0, "end": 3625.0, "text": "Achja. Man kann also übrigens, das ist neu, das ist neu in, ich glaube, seit Siechab 7, ist das neu, dass man in Main, oder 7.3, ich glaube seit Sieben, ich glaube seit Sieben, ist das neu, dass man Main Async machen kann."}, {"id": 367, "start": 3625.0, "end": 3640.0, "text": "Das ging, das ging früher nicht. Früher muss, ich mein, du kannst, früher war es auch nicht viel schwieriger. Du hast halt hier irgendwie eine neue Klasse gemacht, mit Tote drin hast du ausgeführt und dann gesagt einfach Wait."}, {"id": 368, "start": 3640.0, "end": 3655.0, "text": "Das hat natürlich auch funktioniert. Aber so ist es schöner. Ok, jetzt downloadet er Chrome. Und wie geht es weiter? Async-Launch-Options-Papetier-Browser-Browser-Await-Launch-Options-Async."}, {"id": 369, "start": 3655.0, "end": 3673.0, "text": "Ja, machen wir. Geht's. Browser. Wir machen erstmal nicht Headless, wir machen nicht Headless. Ich will, ich will den Chrome ja, ich will den Chrome ja sehen. Options, lass mal weg. So, jetzt startet er in Chrome."}, {"id": 370, "start": 3673.0, "end": 3694.0, "text": "Ach, muss man Options angeben? Ok, wenn man Options angeben muss, dann geben wir halt Options an und sagen Headless is false. Aha."}, {"id": 371, "start": 3694.0, "end": 3707.0, "text": "Immer noch keine Subs-Emotes. Ja, ich war die ganze Woche an arbeiten, stell dir das vor. Und ich bin sehr unkreativ, was sowas angeht. Und ich hab noch keine Idee so richtig."}, {"id": 372, "start": 3707.0, "end": 3720.0, "text": "Und dazu kommt, dass im Discord-Channel leider auch keine ordentlichen Vorschläge drin sind für Emotes, die man machen könnte."}, {"id": 373, "start": 3720.0, "end": 3726.0, "text": "Ach, switchen wir mal die Musik mal."}, {"id": 374, "start": 3726.0, "end": 3735.0, "text": "Nice."}, {"id": 375, "start": 3735.0, "end": 3750.0, "text": "Ok, wir gucken mal, ob das jetzt funktioniert, ob der jetzt in Chrome startet. Der sollte jetzt in Chrome starten. Bei New Page müssen wir vielleicht noch machen. New Page, go Google. Genau. Das machen wir jetzt."}, {"id": 376, "start": 3750.0, "end": 3769.0, "text": "Der sollte jetzt, der sollte sich jetzt in Chrome, irgendwie eine minimal, oder halt, irgendeine ausführbare, irgendeine ausführbare Chrome-Version für, für meine Plattform runterladen. Casino-Kapitalist, ja, dann ist Mokathos angesagt, wenn ich da Emotes draus nehme."}, {"id": 377, "start": 3769.0, "end": 3784.0, "text": "Der sollte jetzt in Chrome runterladen, der sollte einen Tab aufmachen und eine neue Seite laden, auf Google gehen und dann nichts machen. Gucken wir mal, ob das funktioniert."}, {"id": 378, "start": 3784.0, "end": 3800.0, "text": "Downloading Chrome. Dann downloaden wir Chrome. Das muss er nur einmal machen. Das muss er nur das erste Mal machen, danach ist das zwischengespeichert."}, {"id": 379, "start": 3800.0, "end": 3827.0, "text": "Bam, da ist er. Chrome is being controlled by automated test software. Da ist er. Ein frischer, ferngesteuerter Chrome."}, {"id": 380, "start": 3827.0, "end": 3843.0, "text": "So. PDFs wollen wir nicht generieren. Also, dann probieren wir das Ganze doch mal aus."}, {"id": 381, "start": 3843.0, "end": 3862.0, "text": "Dann probieren wir das Ganze doch mal aus. Wir probieren das mal mit einer DHL, mit einer DHL, nein, wir machen das Hermes-Tracking. Wir machen das Hermes-Tracking von eben, da."}, {"id": 382, "start": 3862.0, "end": 3878.0, "text": "Das da hinten ist, würde ich sagen, der Anbieter, der das Paket transportiert und das hier vorne ist die, die, die, die, die Paketnummer, Trackingnummer."}, {"id": 383, "start": 3878.0, "end": 3900.0, "text": "Warum wird Chrome eigentlich so einfach benutzt, so oft benutzt? Naja, in dem Fall wird Chrome benutzt, weil er einfach fernzusteuern ist und ich weiß gar nicht, ob Firefox was ähnliches hat."}, {"id": 384, "start": 3900.0, "end": 3913.0, "text": "Okay, also gehen wir mal auf die Seite. Dann sollte, dann sollte irgendwelches Zeug geladen werden."}, {"id": 385, "start": 3913.0, "end": 3923.0, "text": "Mal gucken, ob das jetzt funktioniert. Der sollte jetzt eigentlich die gleiche Seite wieder aufmachen. Ach so, haha, Moment, wir müssen, wir müssen, glaube ich, warten."}, {"id": 386, "start": 3923.0, "end": 3943.0, "text": "Der macht die Seite, glaube ich, wieder zu. Wir müssen warten. Go to Page Async. Ich glaube, wir müssen warten."}, {"id": 387, "start": 3943.0, "end": 3962.0, "text": "Wir müssen, wir müssen hier theoretisch warten, dass der, als wir zugucken können. Ich meine, das ist jetzt nicht die schönste Art und Weise da zu warten, aber wir müssen, wir müssen erst mal zwei Sekunden warten, dass wir, dass wir sehen, dass, dass, dass der das macht."}, {"id": 388, "start": 3962.0, "end": 3977.0, "text": "Ah, funktioniert. Ähm, das ist gut, nice. Was hältst du von Brave Org? Ist der Chromium-Bild? Hab ich noch nicht ausprobiert."}, {"id": 389, "start": 3977.0, "end": 3992.0, "text": "Also machen wir hier sowas wie hier Tracking. Tracking ist das da. Dann haben wir noch, äh, äh, äh, Carrier oder so nennen wir das mal. Das ist das da. Also das ist in dem Fall Hermes."}, {"id": 390, "start": 3992.0, "end": 4020.0, "text": "Ähm, String Interpolation. Äh, wann hab ich das falsch rumgemacht? Kann man sich mal nicht merken. Moment. Ach, man sollte es vielleicht auch an die richtige Stelle schreiben, dann funktioniert das auch."}, {"id": 391, "start": 4020.0, "end": 4035.0, "text": "Ja, das sind so Kleinkram, den übersieht man immer. Und den übersieht irgendwie alle. Also ich kenne keinen, der nicht ab und zu mal so Kram übersieht."}, {"id": 392, "start": 4035.0, "end": 4058.0, "text": "Deswegen finde ich die Diskussion, die es immer gibt, darüber, welche, also wie man noch optimierter Text eingibt beim Programmieren, vollkommen überflüssig, weil die meiste Zeit machst du dir eh Gedanken."}, {"id": 393, "start": 4058.0, "end": 4072.0, "text": "Was checkst du mal aus? Was soll ich auschecken? Janik the Genius? Wo steht das? Ach hier, Brave Org. Ja, muss ich mir mal angucken."}, {"id": 394, "start": 4072.0, "end": 4099.0, "text": "So, ähm. Mal gucken, ob es funktioniert. Jetzt muss die Tracking App wieder aufgehen. Ah, gut, passt. Okay, und nun, jetzt wird es ein bisschen komplizierter."}, {"id": 395, "start": 4099.0, "end": 4115.0, "text": "Jetzt müssen wir erstmal auf der Seite checken, wie das Ganze überhaupt funktioniert. Weil es ist jetzt ja so, ich muss jetzt irgendwie aus der Seite rausholen, was für einen Status die Sendung hat."}, {"id": 396, "start": 4115.0, "end": 4129.0, "text": "Keiner funktioniert so gut wie Chrome. Ich bin mit Chrome auch wirklich zufrieden. Ich kann mich da über Chrome ehrlich gesagt gar nicht großartig beschweren."}, {"id": 397, "start": 4129.0, "end": 4147.0, "text": "Und jetzt sind mal unsere krassen Reverse Engineering Künste gefragt, dass wir rauskriegen, wie die Seite funktioniert. Was übertragen die denn da alles?"}, {"id": 398, "start": 4147.0, "end": 4162.0, "text": "30.000 JavaScript und CSS und Gedönszeugs. Okay, wir müssen das mal groß machen. Und wir müssen die Devtools mal irgendwie rechts hin machen, dass man auch ein bisschen was sieht."}, {"id": 399, "start": 4162.0, "end": 4184.0, "text": "Okay, noch mal gucken, dass es nix im Cache ist. Aus dem Cache laden, okay. Ähm, so. Also, wir brauchen Track. Da haben wir doch, das sieht doch schon mal interessant aus."}, {"id": 400, "start": 4184.0, "end": 4208.0, "text": "JavaScript juckt uns nichts, CSS. Uns jucken Request zum Server, das ist das hier. Ha, nice. Ähm. Was überträgt, was genau übertragen die da?"}, {"id": 401, "start": 4208.0, "end": 4225.0, "text": "Das ist kryptisches China Zeug, was die da übertragen."}, {"id": 402, "start": 4225.0, "end": 4239.0, "text": "Track B704C0. Was zum Teufel machen die da? 0. RET1. Message okay, okay. Also, Text."}, {"id": 403, "start": 4239.0, "end": 4263.0, "text": "Ah, okay. Das hier sind die... Sendung wurde zugestellt. Das hier sind die Einzelheiten von... Also, der Progress. Das ist richtig pepega, API. Das ist aber auch keine offizielle von denen, ne?"}, {"id": 404, "start": 4263.0, "end": 4270.0, "text": "Also, ich meine, das ist jetzt zwar unter Rest AP Track, aber ich wette mit euch, das funktioniert nur, wenn man irgendwelche passenden Cookies gesetzt hat."}, {"id": 405, "start": 4270.0, "end": 4294.0, "text": "Also, ich gehe mal davon aus, ich kann jetzt nicht einfach hergehen. Copy. Copy as Curl. Bash. Nice, das funktioniert. Ähm, ich denke mal, ich kann jetzt nicht einfach einen Curl machen."}, {"id": 406, "start": 4294.0, "end": 4306.0, "text": "Aha. Okay, vielleicht brauchen wir den Kram mit Chrome gar nicht. Naja, doch. Ja, ich guck mal, ich übersetz. Ich hab mir diese ganzen Cookies gesetzt."}, {"id": 407, "start": 4306.0, "end": 4328.0, "text": "Da hab ich keinen Bock, das von Hand zu bauen. Creeps HD. Nice. Danke schön. Stufe 1 Sub. Heute gibt's wenig. Prime Subs. Subscriber hier."}, {"id": 408, "start": 4328.0, "end": 4346.0, "text": "Ein nicer Sub. Danke schön. Creeps HD. Wie lange streamst du heute? Kein Schimmer. So, mal gucken, ob der Mist auch ohne Cookies und haste nicht gesehen funktioniert."}, {"id": 409, "start": 4346.0, "end": 4362.0, "text": "Ich glaube eher nicht. Nee, guckt. Was? Achso. Ich hab den Header weggemacht. Nee, guckt, das geht nicht."}, {"id": 410, "start": 4362.0, "end": 4378.0, "text": "Das funktioniert nur, wenn man die passenden Cookies und irgendwelche Y, Q, Bit gesetzt haben und was auch immer. Irgendein China Cookie. V5 Translate Express."}, {"id": 411, "start": 4378.0, "end": 4392.0, "text": "Da ist die Event ID. Keine Ahnung. Da hab ich keinen Bock drauf. Deswegen hab ich mir schon in, nennen wir es mal, weiser Voraussicht überlegt, dass wir das besser mit einem Remote gesteuerten Chrome machen."}, {"id": 412, "start": 4392.0, "end": 4402.0, "text": "Weil, wenn wir das mit einem Remote gesteuerten Chrome machen, dann müssen wir diesen ganzen Kram wie Cookies und so nicht von Hand machen. Das macht Chrome für uns."}, {"id": 413, "start": 4402.0, "end": 4426.0, "text": "Aber es ist natürlich trotzdem wichtig, dass wir den Aufruf mitkriegen, weil in dem Aufruf, hier, da, steht ja letztendlich drinnen, in JSON, irgendwie in einem komischen Format, aber es steht letztendlich lesbar drinnen, wo sich die Sendung gerade befindet."}, {"id": 414, "start": 4426.0, "end": 4437.0, "text": "Das heißt, es ist allemal besser, das aus diesem JSON-Request rauszufuddeln, der gemacht wird, als aus dem HTML, was generiert wird, rauszupasen."}, {"id": 415, "start": 4437.0, "end": 4457.0, "text": "Also das HTML-Pasen ist wirklich das allerletzte, was ich machen würde, wenn ich an so Informationen reinkommen will. Weil, das Problem ist, wenn du anfängst, irgendwelche HTML-Sachen zu pasen, das geht morgen schon kaputt. Das ist einfach nicht stabil, HTML-gepase."}, {"id": 416, "start": 4457.0, "end": 4472.0, "text": "200 IQ, ja. Deswegen müssen wir gucken, dass wir irgendwie an diesen JSON-Response rankommen, der gemacht wird, wenn man die Seite aufruft."}, {"id": 417, "start": 4472.0, "end": 4495.0, "text": "Das heißt, ich muss jetzt irgendwie mal schauen, wie man sich in die Chrome-Fernsteuerung mit Puppety reinhängen kann, dass man mitbekommt, wenn ein JSON-Request, also wenn ein Post-Request gemacht wird, dass ich da mich reinhucken kann, irgendwie."}, {"id": 418, "start": 4495.0, "end": 4510.0, "text": "Keine Ahnung, wie das funktioniert. Müssen wir mal schauen, ob die vielleicht ordentliche... Hier, schau mal. Puppetier-Doc. Das ist ja keine nettspezifische Sache."}, {"id": 419, "start": 4510.0, "end": 4525.0, "text": "Ja, das sieht schon besser aus. So, nach was müssen wir da mal suchen? Dankeschön, NobodyQ. FeelsBirthday, man."}, {"id": 420, "start": 4525.0, "end": 4547.0, "text": "Boah, nach was könnte man da mal suchen? Irgendwie Hook? Request? Ich will da letztendlich einen Post-Request mitkriegen. Event-Request, Request-Finished."}, {"id": 421, "start": 4547.0, "end": 4557.0, "text": "Class-Page. Request-Finished. Das klingt schon mal Request und Request-Finished. Das klingt schon mal ganz praktisch."}, {"id": 422, "start": 4557.0, "end": 4571.0, "text": "Wait for request. Class-Request. Set-Request-Interception. Oh, das klingt auch gut."}, {"id": 423, "start": 4571.0, "end": 4583.0, "text": "Event-Request-Finished. Emitted when a request finishes successfully. Poggers Englisch wieder. Easy."}, {"id": 424, "start": 4583.0, "end": 4603.0, "text": "Willst du nicht eher die Response... Na, ich hoffe mal, dass man die Response lesen kann, wenn man Request macht. Also, wenn dann Request fertig, dann Response davon anzeigen. Weil, aber du hast prinzipiell recht, ich will schon den Response haben."}, {"id": 425, "start": 4603.0, "end": 4619.0, "text": "Können wir mal gucken. Vielleicht gibt es sowas wie Response-Finished oder so. Emitted when a response is received. Ja, das ist wahrscheinlich dann noch besser. Das ist tatsächlich dann noch besser."}, {"id": 426, "start": 4619.0, "end": 4635.0, "text": "Set-Request-Interception. Nee, das stimmt. Du hast recht. Das ist viel sinnvoller, wenn man nach Response geht. Intercept. Vielleicht gibt es auch Intercept-Response. Intercept."}, {"id": 427, "start": 4635.0, "end": 4651.0, "text": "Was machen die hier? Set-Page-Request-Interception-True. Page-On-Request-Intercept-Request. Nee, das wollen wir eher nicht. Response. Ich habe irgendwas von einem Event mit Response gesehen. Okay, probieren wir das mal aus."}, {"id": 428, "start": 4651.0, "end": 4667.0, "text": "Page-Response. Hängen wir uns mal an das Event dran. Wir können, wir machen das dann inline mit irgendeinem Lambda, aber erstmal hier gucken, ob wir da irgendwas rauskriegen bei der ganzen Sache."}, {"id": 429, "start": 4667.0, "end": 4683.0, "text": "So, Response created. Was kriegen wir denn da? Response. Da ist es doch. From cache, Frame, Headers. Und Visual Studio lagged. Huge Visual Studio lagged. Aber cool, ich muss jetzt neu starten."}, {"id": 430, "start": 4683.0, "end": 4700.0, "text": "Weiß nicht, was damit los ist, aber das lagged wie Sau gerade. Läuft irgendein Mist im Hintergrund oder so? Krassen Hexors am Start."}, {"id": 431, "start": 4700.0, "end": 4720.0, "text": "Nö, läuft nix im Hintergrund. Na gut, machen wir weiter. Außer VMWare läuft nix. Warum braucht VMWare überhaupt so viel CPU-Last?"}, {"id": 432, "start": 4720.0, "end": 4734.0, "text": "Oh, ihr seht nix, ne? Ups. Ups, ups, ups. Jetzt. Ja, das ist ein Bug. Ich glaube, das ist ein Bug in OBS."}, {"id": 433, "start": 4734.0, "end": 4751.0, "text": "Dass, wenn man diesen Windows Passwort Prompt kriegt, dass man, dass es abkackt, die Bildschirmaufnahme. Warum auch immer. Konsole App 12 waren wir."}, {"id": 434, "start": 4751.0, "end": 4765.0, "text": "Was ist los? Freitagabend? Nur 80 Zuschauer? Das bin ich ja gar nicht mehr gewöhnt, ey. Alle hier am Party Parrot machen. From cache, Headers."}, {"id": 435, "start": 4765.0, "end": 4791.0, "text": "Alter Header, Digga. Digga, Header. Status Text. Wo ist Body oder sowas? Gibt's da Text? Hier, Text. Text Representation of Body. Text, das wollen wir haben."}, {"id": 436, "start": 4791.0, "end": 4816.0, "text": "Await. Text. Okay. Also ich sollte jetzt für jeden Request, den mein ferngesteuerter Chrome macht, eine Ausgabe in dem Terminal kriegen, wo drin steht, was er für, äh, die Response, also quasi jegliche Response von dem, was bei dem Seitenaufbau quasi reinkommt in den Browser."}, {"id": 437, "start": 4816.0, "end": 4832.0, "text": "Was soll ich jetzt im, im, in der Kommando-Zeile kriegen? Okay, das ist natürlich ein bisschen was. Und unformatiert ist das natürlich ziemlicher Müll. Wir kriegen jetzt ja alles im Endeffekt."}, {"id": 438, "start": 4832.0, "end": 4847.0, "text": "Okay, das müssen wir jetzt, das müssen wir jetzt mal irgendwie filtern. Das müssen wir jetzt mal, das filtern wir jetzt mal, weil das kannste ja komplett vergessen. Wieso machst du alles Essing, um es dann wieder zu Awaiten?"}, {"id": 439, "start": 4847.0, "end": 4866.0, "text": "Weil ich, weil ich was ausgeben will. Wenn ich was ausgeben will, muss ich Awaiten, bis die Ausgabe da ist. Ah. Was passiert eigentlich, wenn ich das so mache?"}, {"id": 440, "start": 4866.0, "end": 4879.0, "text": "Ja genau, dann krieg ich einfach nur die Klasse zurück. Das bringt nichts, ich muss da schon Awaiten. Allerdings ist Await in dem Fall kein Sleep. Das ist auch so ne Sache, ich hab das, ich hab ne, ich hab ne Weile gebraucht, bis ich das kapiert hab."}, {"id": 441, "start": 4879.0, "end": 4901.0, "text": "Das ist im Prinzip ein Return aus der Funktion und erst wenn es fertig ist, gehts weiter an der Stelle. Also unter der Haube macht er quasi hier nen Return aus der Funktion und das blockt nicht."}, {"id": 442, "start": 4901.0, "end": 4917.0, "text": "Der geht einfach aus, hier steht eigentlich ein Return davor noch. So quasi. Return. Und dann ruft er die Funktion wieder auf und dann springt er halt nicht da oben hin, wo Return drin steht, sondern hier unten, wo dann die Response drin ist."}, {"id": 443, "start": 4917.0, "end": 4946.0, "text": "Es gibt ein richtig cooles Video zum Thema Async Await hab ich gesehen. Von allen der letzten Build-Konferenzen war das glaube ich. Wie hieß das denn? Irgendwie sowas wie Async Await Mistakes oder so? In der Richtung. War das überhaupt Build? Das war ein ziemlich gutes Video, wo jemand erklärt hat, wie Async Await intern funktioniert."}, {"id": 444, "start": 4946.0, "end": 4971.0, "text": "Ja, genau das da. Das da. Das ist ein ziemlich gutes Video, der erklärt, wie das intern funktioniert, wie Async Await, wie das quasi implementiert ist. Und warum es eben nicht blockt oder trotzdem blockt, wenn man es verkehrt benutzt."}, {"id": 445, "start": 4971.0, "end": 4984.0, "text": "Ja, warum nicht? Bisschen mehr Action könnte da Musik jetzt auch drin sein."}, {"id": 446, "start": 4984.0, "end": 5010.0, "text": "Ok, wir müssen jetzt in dem Response auf jeden Fall mal nach was sinnvollem suchen. Ich hab ne Idee. Ha, ich hab ne Idee. Huge. Big Brain. Also mal gucken, ob das funktioniert. Wir wissen noch, welche Url das Ganze ist."}, {"id": 447, "start": 5010.0, "end": 5030.0, "text": "Response. Und zwar können wir gucken. If Response. Und da ist garantiert irgendwie die Url drinnen, die der. Ich will nicht Text Async. Ich will einfach nur Response. Und da ist garantiert irgendwo die Url drinnen."}, {"id": 448, "start": 5030.0, "end": 5048.0, "text": "Ist ja gut. Ok, dann brauch ich auch nicht Await. Da ist garantiert irgendwo die Url drinnen. Remote Address. Url. Genau. So, und wenn die Url das hier ist, weil das haben wir doch raus gekriegt eben gerade."}, {"id": 449, "start": 5048.0, "end": 5063.0, "text": "Die Url. Wo haben wirs? Irgendwo. Ich hab sie noch kopiert. Wenn das da die Url ist, die aufgerufen wird, nur dann wollen wirs ausgeben. Das können wir doch jetzt schon mal ausbringen, ob das funktioniert."}, {"id": 450, "start": 5063.0, "end": 5091.0, "text": "Await. What. Sponsor. Async Text. So und jetzt sollten wir nur von dem hoffentlich richtigen Request die Ausgabe kriegen. Ja. Bam. Funktioniert. Pock. Easy. Richtig easy. Ja."}, {"id": 451, "start": 5091.0, "end": 5107.0, "text": "Easy as fuck. Easy as fuck. Und habt euch auch schon ein Mixer-Account gemacht, Leute."}, {"id": 452, "start": 5107.0, "end": 5122.0, "text": "Nope. Ich auch nicht. Ich auch nicht. Erinnert ihr euch noch an den... Ich mach mir auch keinen Mixer-Account vorzu. Ninja guck ich eh nicht."}, {"id": 453, "start": 5122.0, "end": 5139.0, "text": "Und so. Rest juckt mich auch nicht so wirklich. Könnt ihr euch noch an den E3 Stream von vor ein paar Jahren erinnern, wo die Age of Empires Typen auf Mixer gestreamt haben und ihre Streamproben aus Versehen das Mikrofon eingeschaltet haben?"}, {"id": 454, "start": 5152.0, "end": 5172.0, "text": "Twitch-Tracker. Okay. Was auch immer. Genau. Das ist der Clip hier."}, {"id": 455, "start": 5172.0, "end": 5186.0, "text": "Das haben wir gesehen. Da waren wir im Stream und wollten einfach nur gucken wann geht der Age of Empires Stream los. Ah von der Gamescom. Und auf einmal haben sie ihre Trockenübungen gestreamt."}, {"id": 456, "start": 5186.0, "end": 5194.0, "text": "Ich glaube die haben aus Versehen den Stream eingeschaltet und wollten gar nicht. Jetzt ist er wieder aus."}, {"id": 457, "start": 5194.0, "end": 5202.0, "text": "Ja da hat man im Hintergrund die Trockenübungen gehört, wo sie geübt haben zu jubeln und sowas bei Ankündigungen. Das war richtig fail."}, {"id": 458, "start": 5202.0, "end": 5231.0, "text": "Ninja streamt nicht mehr bei Twitch. Anscheinend nicht. Es gehen irgendwie die Gerüchte um, dass er einen was? 930 Millionen? Ach keine Ahnung. Auf jeden Fall verdammt viel Geld dafür bekommen hat. Exklusiv 6 Jahre für Mixer."}, {"id": 459, "start": 5231.0, "end": 5247.0, "text": "Also ich habe keine Ahnung wer das ist. Ich habe keine Ahnung wer das ist, ob das vertrauenswürdig ist."}, {"id": 460, "start": 5247.0, "end": 5262.0, "text": "Das ist nicht legit. Das glaube ich nicht. Ich habe das schon mal auf Twitter gelesen, aber ich kann mir das nicht vorstellen. 932 Millionen wäre extrem krass viel für einen Streamer. Ich meine das ist der größte Streamer."}, {"id": 461, "start": 5262.0, "end": 5279.0, "text": "Dass es in Millionenhöhe liegt ist klar, aber ich glaube nicht, dass es ernsthaft ist. Das glaube ich nicht. Humor."}, {"id": 462, "start": 5279.0, "end": 5293.0, "text": "Das ist Blödsinn. Aber es wird mit Sicherheit in Millionenhöhe liegen. Garantiert."}, {"id": 463, "start": 5293.0, "end": 5310.0, "text": "Der wird so krass die Kohle bekommen dafür. Das lohnt sich für ihn. Ich bin mir noch unschlüssig, was das für Auswirkungen haben wird. Ich habe mir da gestern ein bisschen Gedanken zu gemacht."}, {"id": 464, "start": 5310.0, "end": 5325.0, "text": "Es gibt ja im Prinzip zwei Sachen wie das Ganze ausgehen kann. Entweder wird Mixer jetzt Konkurrent für Twitch. Das glaube ich allerdings. Das kann ich nicht glauben. Das wird auch Ninja alleine nicht schaffen."}, {"id": 465, "start": 5325.0, "end": 5340.0, "text": "Er wird ja ein paar Fans mitbringen, aber ob deswegen Mixer auf einmal ein ernsthafter Twitch Konkurrent wird, ich kann es mir irgendwie nicht vorstellen. Mir gefällt auch Mixer von der Seite her."}, {"id": 466, "start": 5340.0, "end": 5355.0, "text": "Es ist genau umgedreht. Mixer bleibt verhältnismäßig unbedeutend und Ninja verliert extrem an Einfluss und Bedeutung. Das ist eigentlich die Sache, wozu ich eher tendiere. Allerdings ist Ninja mittlerweile so groß."}, {"id": 467, "start": 5355.0, "end": 5373.0, "text": "Ich weiß gar nicht, ob er überhaupt noch richtig abhängig ist von irgendeiner Plattform. Wahrscheinlich könnte er auf Chatrubate oder so streamen oder er hätte 14.000 Viewer oder so. Keine Ahnung."}, {"id": 468, "start": 5373.0, "end": 5392.0, "text": "Das ist wahrscheinlich bei Ninja mittlerweile egal, wo er streamt."}, {"id": 469, "start": 5392.0, "end": 5415.0, "text": "Das Sebaro droppt hier wieder die Seiten. Okay, machen wir weiter. Also wenn Response Rest RP Track, dann wollen wir die Response als Text. Klingt irgendwie sinnvoll, oder, was wir da gebastelt haben."}, {"id": 470, "start": 5415.0, "end": 5428.0, "text": "Ist der Packet Tracker für was spezifisches? Ja, der ist für OPS, DHL, Hermes, DPD und wenn wir es hinkriegen für Amazon."}, {"id": 471, "start": 5428.0, "end": 5455.0, "text": "Aktuell probieren wir gerade den Hermes Stand über diese Tracking Seite abzufragen, weil Hermes keine API bietet. DHL hat eine API, DPD hat eine API, OPS hat eine API. Hermes hat keine API."}, {"id": 472, "start": 5455.0, "end": 5465.0, "text": "Was wie sieht es mit China Post aus? Das sollte nicht zu schwer sein. Können wir auch einbauen, aber erstmal will ich die Sachen einbauen, wo ich selbst relativ viele Pakete mitkriege."}, {"id": 473, "start": 5465.0, "end": 5479.0, "text": "Wenn man das ordentlich bauen kann man eh weitere Anbieter relativ easy integrieren."}, {"id": 474, "start": 5479.0, "end": 5496.0, "text": "Okay, jetzt müssen wir den Kran noch irgendwie parsornen würde ich sagen."}, {"id": 475, "start": 5496.0, "end": 5518.0, "text": "So, jetzt haben wir den Text, den Body als String. Das müssen wir jetzt parsen. Wir müssen jetzt das JSON Objekt uns erstmal schnappen."}, {"id": 476, "start": 5518.0, "end": 5526.0, "text": "JasonConvert, da machen wir uns vielleicht wirklich eine eigene Klasse für, die wir dann direkt deserialisieren können."}, {"id": 477, "start": 5526.0, "end": 5554.0, "text": "Oh, Twitch Prime. Huge. Neradon. Nee, nicht mal Prime. Richtig, richtig, äh, richtiger Sub. Also kein, kein, sondern ein richtiger. Danke schön für Stufe 1. Neradon, Pog."}, {"id": 478, "start": 5554.0, "end": 5565.0, "text": "Hey Max, frag mich nicht mehr. Absolut keine Ahnung, was das ist. Ähm, ich bastel eine Software, oder ich probiere, was, ähm, was zu programmieren, was Pakete trackt."}, {"id": 479, "start": 5565.0, "end": 5578.0, "text": "Allerdings nicht einfach nur Pakete trackt, sondern dein E-Mail Postfach durchsucht nach gültigen Trackingnummern und dann quasi die selbstständig trackt und dir Bescheid sagt, wann deine Pakete kommen."}, {"id": 480, "start": 5578.0, "end": 5590.0, "text": "Das heißt, in Zukunft musst du eigentlich nur gucken, dass du die gleiche E-Mail Adresse verwendest bei allen Online-Shops. Und so ziemlich jeder Online-Shop, den es gibt, verschickt eine Mail, wenn das Ganze verschickt ist."}, {"id": 481, "start": 5590.0, "end": 5605.0, "text": "Ich meine sogar Aliexpress macht das. Und in diesen E-Mails steht in der Regel auch immer drinnen, ähm, sehr geehrter Herr XY, ähm, ihre, ihre Sendung wurde verschickt mit DHL und das ist die Trackingnummer."}, {"id": 482, "start": 5605.0, "end": 5615.0, "text": "Da steht ja in der Regel immer drin. Ich kenne eigentlich keinen Shop, wo das nicht drin steht. Das heißt, wir machen das in drei Teilen. Ähm, wir scannen einmal die E-Mails nach Trackingnummern."}, {"id": 483, "start": 5615.0, "end": 5641.0, "text": "Plus ein paar weitere Sachen, ja. Also wir haben es uns hier letztens aufgeschrieben, wie wir das Ganze machen müssen. Ich kann es dir noch mal kurz zeigen. Äh, haben wir das nicht gespeichert? Kann das sein? Da ich so dämlich war und das nicht zu speichern vom letzten Mal?"}, {"id": 484, "start": 5641.0, "end": 5663.0, "text": "Das ist äh, ziemlich pepega. Naja, zumindest dann erklär ich das jetzt noch mal. Wir bauen drei Teile. Wir bauen einmal einen Teil, der deine E-Mail scannt und äh, quasi versucht, den Anbieter rauszukriegen und die Trackingnummer rauszukriegen."}, {"id": 485, "start": 5663.0, "end": 5673.0, "text": "In Kombination eben noch mit vielleicht deinem Namen, dass nicht so viele E-Mails durchrutschen, die nicht, gar keine Versandnachrichten sind. Danach wird das Ganze getracked."}, {"id": 486, "start": 5673.0, "end": 5695.0, "text": "Es gibt nur ein halbwegs hübsches, sofern es meine CSS Skills hergeben. Ähm, Webinterface, wo der Status angezeigt wird und ähm, auch eine MQTT-Benachrichtigung für deine HM-Automatisierung, falls du eine hast und halt eine Notification an. Mal gucken, was wir da unterstützen, wenn ein Paket ankommt."}, {"id": 487, "start": 5695.0, "end": 5710.0, "text": "Das Schöne daran ist ja, ich meine, es gibt wie Sand am Meer Programme, die deine Pakete tracken, allerdings nicht automatisch. Du musst immer noch die Nummer einfügen."}, {"id": 488, "start": 5710.0, "end": 5726.0, "text": "Ja, und das äh, stelle ich mir eigentlich ganz nice vor. Max schon mal von Pokemon Mini gehört rein. Parcel Track kann das, ich weiß, dass die das können. Ich weiß, dass die das können."}, {"id": 489, "start": 5726.0, "end": 5738.0, "text": "Allerdings will ich meine E-Mails nicht an anderen, an externen Anbieter weiterleiten. Wahrscheinlich wird meine App oder mein Programm am Ende auch nie wirklich so gut funktionieren, wie das Parcel Track macht, weil ich meine, die unterstützen was? 85 Anbieter oder so."}, {"id": 490, "start": 5738.0, "end": 5764.0, "text": "Also es wird nicht wirklich Konkurrenz dazu sein, aber für Leute, die sich das nicht kaufen wollen, oder die ihre E-Mails nicht an externen Anbieter weiterleiten wollen, oder denen es reicht, wenn sie mit den 0815 Sachen in Deutschland zurechtkommen, also DHL, UPS, DPD, Hermes, Amazon, dann können die, dass die dann auch damit zufrieden sind. Denke ich mal."}, {"id": 491, "start": 5764.0, "end": 5778.0, "text": "Okay, jetzt müssen wir den Mist erstmal hier, okay, wir haben es importiert. Ähm, jetzt müssen wir das Ding erstmal als Jason parsen. Was wir da haben."}, {"id": 492, "start": 5778.0, "end": 5800.0, "text": "Parse, nämlich den Körper, der Körper wird gepasst und da kriegen wir dann ein Jason Object raus und das können wir mal ausgeben und schauen, ob wir das Richtige gepasst haben."}, {"id": 493, "start": 5800.0, "end": 5812.0, "text": "Haben wir. Okay, also wir haben schon mal die China Response, haben wir schon mal, mit ganz merkwürdigen Sachen drinne. Was könnte denn da was sein? Ich bin da jetzt gerade ein bisschen unschlüssig."}, {"id": 494, "start": 5812.0, "end": 5838.0, "text": "Z0 haben wir. Die Dinger sind ja auch absolut grausam benannt, ne. Reicht es nicht, sich auf Amazon zu verlassen, wenn du nur bei Amazon bestellst und dir die E-Mails von Amazon reichen, die du kriegst und die Sendeverfolgung in Amazon reicht, das ist okay, dann brauchst du nichts anderes."}, {"id": 495, "start": 5838.0, "end": 5847.0, "text": "Allerdings, was man nicht vergessen darf, wirklich eine ordentliche Übersicht. Wenn du nicht gerade die Amazon App aufmachst auf deinem Tablet, hast du nicht."}, {"id": 496, "start": 5847.0, "end": 5859.0, "text": "Also wenn du beispielsweise irgendwie eine Heimautomatisierungslösung hast und würdest gerne wissen oder möchtest darauf reagieren, wenn Pakete kommen und irgendwas machen, dann geht das nicht, weil du kriegst das aus Amazon nicht gescheit raus."}, {"id": 497, "start": 5859.0, "end": 5874.0, "text": "Oder halt, du kannst halt natürlich die Amazon Seite parsen. Aber so ist es auf jeden Fall praktischer, weil du alle Anbieter drinne hast und alle Shops, alle Shops die E-Mails verschicken."}, {"id": 498, "start": 5874.0, "end": 5883.0, "text": "Und jeder Online-Shop verschickt, also kennt ihr einen Online-Shop, der keine E-Mail verschickt, wenn die Sendung auf dem Weg ist? Also mir fällt da keiner ein."}, {"id": 499, "start": 5883.0, "end": 5896.0, "text": "Der letzte schlechteste China-Shop oder Inder-Shop bei Banggood verschicken Bestätigungs-E-Mails."}, {"id": 500, "start": 5896.0, "end": 5921.0, "text": "Tidesdunkel. Viel Spaß, der Name. Ja, der Name ist recht unvorteilhaft, Banggood, gebe ich zu. Ich weiß auch nicht, was sie sich dabei gedacht haben bei dem Namen von dem Shop, ehrlich gesagt."}, {"id": 501, "start": 5921.0, "end": 5950.0, "text": "Warum er seine Seite Banggood nennt. Aber ich mein, die heißt halt nun mal so. Banggood, also."}, {"id": 502, "start": 5950.0, "end": 5966.0, "text": "So, was sagt uns dieses Chasen-Objekt? Das ist China-Logik. Ich blicke da erstmal überhaupt nicht durch. Also das da ist wahrscheinlich der aktuelle Stand der Sendung."}, {"id": 503, "start": 5966.0, "end": 5994.0, "text": "Das ist zuletzt aktualisiert. B ist Null, C und D sind Lehrer-String. Weil L9 ist Null, L1 ist wahrscheinlich Ziel-Land."}, {"id": 504, "start": 5994.0, "end": 6002.0, "text": "Z1."}, {"id": 505, "start": 6002.0, "end": 6015.0, "text": "Darf man nur darauf hoffen, dass sich die Namen in diesem Chase nicht ändern. Ja, das stimmt. Aber immer noch besser als HTML-Parsen."}, {"id": 506, "start": 6015.0, "end": 6031.0, "text": "Und Z1. Z1 ist ein Array aus den unterschiedlichen Sendungs-Events-Schritten."}, {"id": 507, "start": 6031.0, "end": 6048.0, "text": "Also im Prinzip. Beleg gerade. Alter, Donation hab ich schon ewig schon einmal gekriegt."}, {"id": 508, "start": 6048.0, "end": 6056.0, "text": "Donation, Mr. Samo hast du denn 2 Euro. Sorry, das passt nicht zum Thema. Glaubst du du spielst wieder Overwatch?"}, {"id": 509, "start": 6056.0, "end": 6069.0, "text": "Wenn die Rollenwelle rauskommt, hab deine Overwatch-Videos mega gerne geschaut. Ich hab sie sogar schon installiert, weil ich die Role-Q ausprobieren wollte."}, {"id": 510, "start": 6069.0, "end": 6078.0, "text": "Und ich dachte mir so, ok, guckst du noch mal ein bisschen auf Twitch, dass du vielleicht wieder so ein bisschen reinkommst."}, {"id": 511, "start": 6078.0, "end": 6090.0, "text": "Und das erste, was ich auf Twitch gesehen hab, ist Pussy P. Und hab ich wieder aninstalt. Weil ich schon ganz vergessen hab, wie kacke ich den Modus fand."}, {"id": 512, "start": 6090.0, "end": 6102.0, "text": "Also die Hermos-Seite schickt auch ein AP-Request raus nach Shipments Search Tracking-Nummer. Das ist gut zu wissen. Das können wir uns auch noch angucken."}, {"id": 513, "start": 6102.0, "end": 6116.0, "text": "Aber die Seite will ich eh als Fallback haben. Also sollte mal irgendwie was von den anderen Trackern nicht funktionieren, ist sie als Fallback wunderbar, weil sie unterstützt einfach alles."}, {"id": 514, "start": 6116.0, "end": 6133.0, "text": "Ich hab immer noch so ein bisschen Schwierigkeiten zu checken. Immer noch so ein bisschen Schwierigkeiten zu checken, wie das Ganze aufgebaut ist."}, {"id": 515, "start": 6133.0, "end": 6158.0, "text": "Was ist 9-1-2? Z2-6? Ok, wir holen uns erstmal Z0 raus. Wir holen uns erstmal Z0 raus, weil das ist der aktuelle, der zuletzt aktualisierte Eintrag ist das, Z0."}, {"id": 516, "start": 6158.0, "end": 6169.0, "text": "Also der aktuelle Stand der Sendung ist Z0. Und ich denke mal, wenn wir einfach regelmäßig abfragen, was wir ja machen, man lässt das ja eh im Hintergrund laufen."}, {"id": 517, "start": 6169.0, "end": 6180.0, "text": "So was weiß ich, einmal die Stunde oder keine Ahnung, alle 30 Minuten oder so. Oder einmal am halben Tag, ist ja auch egal, kriegen wir immer den aktuellsten Stand mit, wie es sich aktualisiert."}, {"id": 518, "start": 6180.0, "end": 6202.0, "text": "Also eigentlich brauchen wir diese History hier gar nicht. Holen wir uns da mal Z0 raus. Also was brauchen wir? Wir brauchen hier DUT, DUT, Track und dann Z0."}, {"id": 519, "start": 6202.0, "end": 6218.0, "text": "Also, probieren wir mal. DUT, Track und dann Z0. Und jetzt sollten wir nur die Daten kriegen, die wir brauchen."}, {"id": 520, "start": 6218.0, "end": 6239.0, "text": "Huge Donation. Ich glaube, ich habe irgendwas falsch gemacht, kann das sein? Oh, es hängt, es hängt. Return 0, was habe ich verkehrt gemacht?"}, {"id": 521, "start": 6239.0, "end": 6252.0, "text": "Ach, nicht Data. DUT. Einfach nur DUT. Donation, Dankeschön. Und zwar, wir haben ja 5 Euro. Demonlord Rimuru. Schau dich schon von Anfang an, alles gut und bleib, wie du bist."}, {"id": 522, "start": 6252.0, "end": 6270.0, "text": "Hab ich vor. Leute, auf Klo."}, {"id": 523, "start": 6312.0, "end": 6327.0, "text": "Das war's für heute. Bis zum nächsten Mal."}, {"id": 524, "start": 6342.0, "end": 6357.0, "text": "Das war's für heute. Bis zum nächsten Mal."}, {"id": 525, "start": 6372.0, "end": 6387.0, "text": "Danke fürs Zuschauen."}, {"id": 526, "start": 6387.0, "end": 6402.0, "text": "Danke fürs Zuschauen."}, {"id": 527, "start": 6417.0, "end": 6432.0, "text": "Danke fürs Zuschauen."}, {"id": 528, "start": 6432.0, "end": 6447.0, "text": "Danke fürs Zuschauen."}, {"id": 529, "start": 6447.0, "end": 6462.0, "text": "Danke fürs Zuschauen."}, {"id": 530, "start": 6462.0, "end": 6477.0, "text": "Danke fürs Zuschauen."}, {"id": 531, "start": 6477.0, "end": 6492.0, "text": "Danke fürs Zuschauen."}, {"id": 532, "start": 6492.0, "end": 6507.0, "text": "Danke fürs Zuschauen."}, {"id": 533, "start": 6507.0, "end": 6522.0, "text": "Danke fürs Zuschauen."}, {"id": 534, "start": 6522.0, "end": 6537.0, "text": "Danke fürs Zuschauen."}, {"id": 535, "start": 6552.0, "end": 6567.0, "text": "Danke fürs Zuschauen."}, {"id": 536, "start": 6567.0, "end": 6582.0, "text": "Danke fürs Zuschauen."}, {"id": 537, "start": 6582.0, "end": 6597.0, "text": "Danke fürs Zuschauen."}, {"id": 538, "start": 6597.0, "end": 6612.0, "text": "Danke fürs Zuschauen."}, {"id": 539, "start": 6612.0, "end": 6627.0, "text": "Danke fürs Zuschauen."}, {"id": 540, "start": 6627.0, "end": 6642.0, "text": "Danke fürs Zuschauen."}, {"id": 541, "start": 6642.0, "end": 6657.0, "text": "Danke fürs Zuschauen."}, {"id": 542, "start": 6657.0, "end": 6672.0, "text": "Danke fürs Zuschauen."}, {"id": 543, "start": 6672.0, "end": 6687.0, "text": "Danke fürs Zuschauen."}, {"id": 544, "start": 6687.0, "end": 6702.0, "text": "Danke fürs Zuschauen."}, {"id": 545, "start": 6702.0, "end": 6717.0, "text": "Danke fürs Zuschauen."}, {"id": 546, "start": 6717.0, "end": 6732.0, "text": "Danke fürs Zuschauen."}, {"id": 547, "start": 6732.0, "end": 6747.0, "text": "Danke fürs Zuschauen."}, {"id": 548, "start": 6747.0, "end": 6762.0, "text": "Danke fürs Zuschauen."}, {"id": 549, "start": 6762.0, "end": 6777.0, "text": "Danke fürs Zuschauen."}, {"id": 550, "start": 6777.0, "end": 6792.0, "text": "Danke fürs Zuschauen."}, {"id": 551, "start": 6792.0, "end": 6807.0, "text": "Danke fürs Zuschauen."}, {"id": 552, "start": 6807.0, "end": 6822.0, "text": "Danke fürs Zuschauen."}, {"id": 553, "start": 6822.0, "end": 6837.0, "text": "Danke fürs Zuschauen."}, {"id": 554, "start": 6837.0, "end": 6852.0, "text": "Danke fürs Zuschauen."}, {"id": 555, "start": 6852.0, "end": 6867.0, "text": "Danke fürs Zuschauen."}, {"id": 556, "start": 6867.0, "end": 6882.0, "text": "Danke fürs Zuschauen."}, {"id": 557, "start": 6882.0, "end": 6897.0, "text": "Danke fürs Zuschauen."}, {"id": 558, "start": 6897.0, "end": 6912.0, "text": "Danke fürs Zuschauen."}, {"id": 559, "start": 6912.0, "end": 6927.0, "text": "Danke fürs Zuschauen."}, {"id": 560, "start": 6927.0, "end": 6942.0, "text": "Danke fürs Zuschauen."}, {"id": 561, "start": 6942.0, "end": 6957.0, "text": "Danke fürs Zuschauen."}, {"id": 562, "start": 6957.0, "end": 6972.0, "text": "Danke fürs Zuschauen."}, {"id": 563, "start": 6972.0, "end": 6987.0, "text": "Danke fürs Zuschauen."}, {"id": 564, "start": 6987.0, "end": 7002.0, "text": "Danke fürs Zuschauen."}, {"id": 565, "start": 7002.0, "end": 7017.0, "text": "Danke fürs Zuschauen."}, {"id": 566, "start": 7017.0, "end": 7032.0, "text": "Danke fürs Zuschauen."}, {"id": 567, "start": 7032.0, "end": 7047.0, "text": "Danke fürs Zuschauen."}, {"id": 568, "start": 7047.0, "end": 7062.0, "text": "Danke fürs Zuschauen."}, {"id": 569, "start": 7062.0, "end": 7077.0, "text": "Danke fürs Zuschauen."}, {"id": 570, "start": 7077.0, "end": 7092.0, "text": "Danke fürs Zuschauen."}, {"id": 571, "start": 7092.0, "end": 7107.0, "text": "Danke fürs Zuschauen."}, {"id": 572, "start": 7107.0, "end": 7122.0, "text": "Danke fürs Zuschauen."}, {"id": 573, "start": 7122.0, "end": 7137.0, "text": "Danke fürs Zuschauen."}, {"id": 574, "start": 7137.0, "end": 7152.0, "text": "Danke fürs Zuschauen."}, {"id": 575, "start": 7152.0, "end": 7167.0, "text": "Danke fürs Zuschauen."}, {"id": 576, "start": 7167.0, "end": 7182.0, "text": "Danke fürs Zuschauen."}, {"id": 577, "start": 7182.0, "end": 7197.0, "text": "Danke fürs Zuschauen."}, {"id": 578, "start": 7197.0, "end": 7212.0, "text": "Danke fürs Zuschauen."}, {"id": 579, "start": 7212.0, "end": 7227.0, "text": "Danke fürs Zuschauen."}, {"id": 580, "start": 7227.0, "end": 7242.0, "text": "Danke fürs Zuschauen."}, {"id": 581, "start": 7242.0, "end": 7257.0, "text": "Danke fürs Zuschauen."}, {"id": 582, "start": 7257.0, "end": 7272.0, "text": "Danke fürs Zuschauen."}, {"id": 583, "start": 7272.0, "end": 7287.0, "text": "Danke fürs Zuschauen."}, {"id": 584, "start": 7287.0, "end": 7302.0, "text": "Danke fürs Zuschauen."}, {"id": 585, "start": 7302.0, "end": 7317.0, "text": "Danke fürs Zuschauen."}, {"id": 586, "start": 7317.0, "end": 7332.0, "text": "Danke fürs Zuschauen."}, {"id": 587, "start": 7332.0, "end": 7347.0, "text": "Danke fürs Zuschauen."}, {"id": 588, "start": 7347.0, "end": 7362.0, "text": "Danke fürs Zuschauen."}, {"id": 589, "start": 7362.0, "end": 7377.0, "text": "Danke fürs Zuschauen."}, {"id": 590, "start": 7377.0, "end": 7392.0, "text": "Danke fürs Zuschauen."}, {"id": 591, "start": 7392.0, "end": 7407.0, "text": "Danke fürs Zuschauen."}, {"id": 592, "start": 7407.0, "end": 7422.0, "text": "Danke fürs Zuschauen."}, {"id": 593, "start": 7422.0, "end": 7437.0, "text": "Danke fürs Zuschauen."}, {"id": 594, "start": 7437.0, "end": 7452.0, "text": "Danke fürs Zuschauen."}, {"id": 595, "start": 7452.0, "end": 7467.0, "text": "Danke fürs Zuschauen."}, {"id": 596, "start": 7467.0, "end": 7482.0, "text": "Danke fürs Zuschauen."}, {"id": 597, "start": 7482.0, "end": 7497.0, "text": "Danke fürs Zuschauen."}, {"id": 598, "start": 7497.0, "end": 7512.0, "text": "Danke fürs Zuschauen."}, {"id": 599, "start": 7512.0, "end": 7527.0, "text": "Danke fürs Zuschauen."}, {"id": 600, "start": 7527.0, "end": 7542.0, "text": "Danke fürs Zuschauen."}, {"id": 601, "start": 7542.0, "end": 7557.0, "text": "Danke fürs Zuschauen."}, {"id": 602, "start": 7557.0, "end": 7572.0, "text": "Danke fürs Zuschauen."}, {"id": 603, "start": 7572.0, "end": 7587.0, "text": "Danke fürs Zuschauen."}, {"id": 604, "start": 7587.0, "end": 7602.0, "text": "Danke fürs Zuschauen."}, {"id": 605, "start": 7602.0, "end": 7617.0, "text": "Danke fürs Zuschauen."}, {"id": 606, "start": 7617.0, "end": 7632.0, "text": "Danke fürs Zuschauen."}, {"id": 607, "start": 7632.0, "end": 7647.0, "text": "Danke fürs Zuschauen."}, {"id": 608, "start": 7647.0, "end": 7662.0, "text": "Danke fürs Zuschauen."}, {"id": 609, "start": 7662.0, "end": 7677.0, "text": "Danke fürs Zuschauen."}, {"id": 610, "start": 7677.0, "end": 7692.0, "text": "Danke fürs Zuschauen."}, {"id": 611, "start": 7692.0, "end": 7707.0, "text": "Danke fürs Zuschauen."}, {"id": 612, "start": 7707.0, "end": 7722.0, "text": "Danke fürs Zuschauen."}, {"id": 613, "start": 7722.0, "end": 7737.0, "text": "Danke fürs Zuschauen."}, {"id": 614, "start": 7737.0, "end": 7752.0, "text": "Danke fürs Zuschauen."}, {"id": 615, "start": 7752.0, "end": 7767.0, "text": "Danke fürs Zuschauen."}, {"id": 616, "start": 7767.0, "end": 7782.0, "text": "Danke fürs Zuschauen."}, {"id": 617, "start": 7782.0, "end": 7797.0, "text": "Danke fürs Zuschauen."}, {"id": 618, "start": 7797.0, "end": 7812.0, "text": "Danke fürs Zuschauen."}, {"id": 619, "start": 7812.0, "end": 7827.0, "text": "Danke fürs Zuschauen."}, {"id": 620, "start": 7827.0, "end": 7842.0, "text": "Danke fürs Zuschauen."}, {"id": 621, "start": 7842.0, "end": 7857.0, "text": "Danke fürs Zuschauen."}, {"id": 622, "start": 7857.0, "end": 7872.0, "text": "Danke fürs Zuschauen."}, {"id": 623, "start": 7872.0, "end": 7887.0, "text": "Danke fürs Zuschauen."}, {"id": 624, "start": 7887.0, "end": 7902.0, "text": "Danke fürs Zuschauen."}, {"id": 625, "start": 7902.0, "end": 7917.0, "text": "Danke fürs Zuschauen."}, {"id": 626, "start": 7917.0, "end": 7932.0, "text": "Danke fürs Zuschauen."}, {"id": 627, "start": 7932.0, "end": 7947.0, "text": "Danke fürs Zuschauen."}, {"id": 628, "start": 7947.0, "end": 7962.0, "text": "Danke fürs Zuschauen."}, {"id": 629, "start": 7962.0, "end": 7977.0, "text": "Danke fürs Zuschauen."}, {"id": 630, "start": 7977.0, "end": 7992.0, "text": "Danke fürs Zuschauen."}, {"id": 631, "start": 7992.0, "end": 8007.0, "text": "Danke fürs Zuschauen."}, {"id": 632, "start": 8007.0, "end": 8022.0, "text": "Danke fürs Zuschauen."}, {"id": 633, "start": 8022.0, "end": 8037.0, "text": "Danke fürs Zuschauen."}, {"id": 634, "start": 8037.0, "end": 8052.0, "text": "Danke fürs Zuschauen."}, {"id": 635, "start": 8052.0, "end": 8067.0, "text": "Danke fürs Zuschauen."}, {"id": 636, "start": 8067.0, "end": 8082.0, "text": "Danke fürs Zuschauen."}, {"id": 637, "start": 8082.0, "end": 8097.0, "text": "Danke fürs Zuschauen."}, {"id": 638, "start": 8097.0, "end": 8112.0, "text": "Danke fürs Zuschauen."}, {"id": 639, "start": 8112.0, "end": 8127.0, "text": "Danke fürs Zuschauen."}, {"id": 640, "start": 8127.0, "end": 8142.0, "text": "Danke fürs Zuschauen."}, {"id": 641, "start": 8142.0, "end": 8157.0, "text": "Danke fürs Zuschauen."}, {"id": 642, "start": 8157.0, "end": 8172.0, "text": "Danke fürs Zuschauen."}, {"id": 643, "start": 8172.0, "end": 8187.0, "text": "Danke fürs Zuschauen."}, {"id": 644, "start": 8187.0, "end": 8202.0, "text": "Danke fürs Zuschauen."}, {"id": 645, "start": 8202.0, "end": 8217.0, "text": "Danke fürs Zuschauen."}, {"id": 646, "start": 8217.0, "end": 8232.0, "text": "Danke fürs Zuschauen."}, {"id": 647, "start": 8232.0, "end": 8247.0, "text": "Danke fürs Zuschauen."}, {"id": 648, "start": 8247.0, "end": 8262.0, "text": "Danke fürs Zuschauen."}, {"id": 649, "start": 8262.0, "end": 8277.0, "text": "Danke fürs Zuschauen."}, {"id": 650, "start": 8277.0, "end": 8292.0, "text": "Danke fürs Zuschauen."}, {"id": 651, "start": 8292.0, "end": 8307.0, "text": "Danke fürs Zuschauen."}, {"id": 652, "start": 8307.0, "end": 8322.0, "text": "Danke fürs Zuschauen."}, {"id": 653, "start": 8322.0, "end": 8337.0, "text": "Danke fürs Zuschauen."}, {"id": 654, "start": 8337.0, "end": 8352.0, "text": "Danke fürs Zuschauen."}, {"id": 655, "start": 8352.0, "end": 8367.0, "text": "Danke fürs Zuschauen."}, {"id": 656, "start": 8367.0, "end": 8382.0, "text": "Danke fürs Zuschauen."}, {"id": 657, "start": 8382.0, "end": 8397.0, "text": "Danke fürs Zuschauen."}, {"id": 658, "start": 8397.0, "end": 8412.0, "text": "Danke fürs Zuschauen."}, {"id": 659, "start": 8412.0, "end": 8427.0, "text": "Danke fürs Zuschauen."}, {"id": 660, "start": 8427.0, "end": 8442.0, "text": "Danke fürs Zuschauen."}, {"id": 661, "start": 8442.0, "end": 8457.0, "text": "Danke fürs Zuschauen."}, {"id": 662, "start": 8457.0, "end": 8472.0, "text": "Danke fürs Zuschauen."}, {"id": 663, "start": 8472.0, "end": 8487.0, "text": "Danke fürs Zuschauen."}, {"id": 664, "start": 8487.0, "end": 8502.0, "text": "Danke fürs Zuschauen."}, {"id": 665, "start": 8502.0, "end": 8517.0, "text": "Danke fürs Zuschauen."}, {"id": 666, "start": 8517.0, "end": 8532.0, "text": "Danke fürs Zuschauen."}, {"id": 667, "start": 8532.0, "end": 8547.0, "text": "Danke fürs Zuschauen."}, {"id": 668, "start": 8547.0, "end": 8562.0, "text": "Danke fürs Zuschauen."}, {"id": 669, "start": 8562.0, "end": 8577.0, "text": "Danke fürs Zuschauen."}, {"id": 670, "start": 8577.0, "end": 8592.0, "text": "Danke fürs Zuschauen."}, {"id": 671, "start": 8592.0, "end": 8607.0, "text": "Danke fürs Zuschauen."}, {"id": 672, "start": 8607.0, "end": 8622.0, "text": "Danke fürs Zuschauen."}, {"id": 673, "start": 8622.0, "end": 8637.0, "text": "Danke fürs Zuschauen."}, {"id": 674, "start": 8637.0, "end": 8652.0, "text": "Danke fürs Zuschauen."}, {"id": 675, "start": 8652.0, "end": 8667.0, "text": "Danke fürs Zuschauen."}, {"id": 676, "start": 8667.0, "end": 8682.0, "text": "Danke fürs Zuschauen."}, {"id": 677, "start": 8682.0, "end": 8697.0, "text": "Danke fürs Zuschauen."}, {"id": 678, "start": 8697.0, "end": 8712.0, "text": "Danke fürs Zuschauen."}, {"id": 679, "start": 8712.0, "end": 8727.0, "text": "Danke fürs Zuschauen."}, {"id": 680, "start": 8727.0, "end": 8742.0, "text": "Danke fürs Zuschauen."}, {"id": 681, "start": 8742.0, "end": 8757.0, "text": "Danke fürs Zuschauen."}, {"id": 682, "start": 8757.0, "end": 8772.0, "text": "Danke fürs Zuschauen."}, {"id": 683, "start": 8772.0, "end": 8787.0, "text": "Danke fürs Zuschauen."}, {"id": 684, "start": 8787.0, "end": 8802.0, "text": "Danke fürs Zuschauen."}, {"id": 685, "start": 8802.0, "end": 8817.0, "text": "Danke fürs Zuschauen."}, {"id": 686, "start": 8817.0, "end": 8832.0, "text": "Danke fürs Zuschauen."}, {"id": 687, "start": 8832.0, "end": 8847.0, "text": "Danke fürs Zuschauen."}, {"id": 688, "start": 8847.0, "end": 8862.0, "text": "Danke fürs Zuschauen."}, {"id": 689, "start": 8862.0, "end": 8877.0, "text": "Danke fürs Zuschauen."}, {"id": 690, "start": 8877.0, "end": 8892.0, "text": "Danke fürs Zuschauen."}, {"id": 691, "start": 8892.0, "end": 8907.0, "text": "Danke fürs Zuschauen."}, {"id": 692, "start": 8907.0, "end": 8922.0, "text": "Danke fürs Zuschauen."}, {"id": 693, "start": 8922.0, "end": 8937.0, "text": "Danke fürs Zuschauen."}, {"id": 694, "start": 8937.0, "end": 8952.0, "text": "Danke fürs Zuschauen."}, {"id": 695, "start": 8952.0, "end": 8967.0, "text": "Danke fürs Zuschauen."}, {"id": 696, "start": 8967.0, "end": 8982.0, "text": "Danke fürs Zuschauen."}, {"id": 697, "start": 8982.0, "end": 8997.0, "text": "Danke fürs Zuschauen."}, {"id": 698, "start": 8997.0, "end": 9012.0, "text": "Danke fürs Zuschauen."}, {"id": 699, "start": 9012.0, "end": 9027.0, "text": "Danke fürs Zuschauen."}, {"id": 700, "start": 9027.0, "end": 9042.0, "text": "Danke fürs Zuschauen."}, {"id": 701, "start": 9042.0, "end": 9057.0, "text": "Danke fürs Zuschauen."}, {"id": 702, "start": 9057.0, "end": 9072.0, "text": "Danke fürs Zuschauen."}, {"id": 703, "start": 9072.0, "end": 9087.0, "text": "Danke fürs Zuschauen."}, {"id": 704, "start": 9087.0, "end": 9102.0, "text": "Danke fürs Zuschauen."}, {"id": 705, "start": 9102.0, "end": 9117.0, "text": "Danke fürs Zuschauen."}, {"id": 706, "start": 9117.0, "end": 9132.0, "text": "Danke fürs Zuschauen."}, {"id": 707, "start": 9132.0, "end": 9147.0, "text": "Danke fürs Zuschauen."}, {"id": 708, "start": 9147.0, "end": 9162.0, "text": "Danke fürs Zuschauen."}, {"id": 709, "start": 9162.0, "end": 9177.0, "text": "Danke fürs Zuschauen."}, {"id": 710, "start": 9177.0, "end": 9192.0, "text": "Danke fürs Zuschauen."}, {"id": 711, "start": 9192.0, "end": 9207.0, "text": "Danke fürs Zuschauen."}, {"id": 712, "start": 9207.0, "end": 9222.0, "text": "Danke fürs Zuschauen."}, {"id": 713, "start": 9222.0, "end": 9237.0, "text": "Danke fürs Zuschauen."}, {"id": 714, "start": 9237.0, "end": 9252.0, "text": "Danke fürs Zuschauen."}, {"id": 715, "start": 9252.0, "end": 9267.0, "text": "Danke fürs Zuschauen."}, {"id": 716, "start": 9267.0, "end": 9282.0, "text": "Danke fürs Zuschauen."}, {"id": 717, "start": 9282.0, "end": 9297.0, "text": "Danke fürs Zuschauen."}, {"id": 718, "start": 9297.0, "end": 9312.0, "text": "Danke fürs Zuschauen."}, {"id": 719, "start": 9312.0, "end": 9327.0, "text": "Danke fürs Zuschauen."}, {"id": 720, "start": 9327.0, "end": 9342.0, "text": "Danke fürs Zuschauen."}, {"id": 721, "start": 9342.0, "end": 9357.0, "text": "Danke fürs Zuschauen."}, {"id": 722, "start": 9357.0, "end": 9372.0, "text": "Danke fürs Zuschauen."}, {"id": 723, "start": 9372.0, "end": 9387.0, "text": "Danke fürs Zuschauen."}, {"id": 724, "start": 9387.0, "end": 9402.0, "text": "Danke fürs Zuschauen."}, {"id": 725, "start": 9402.0, "end": 9417.0, "text": "Danke fürs Zuschauen."}, {"id": 726, "start": 9417.0, "end": 9432.0, "text": "Danke fürs Zuschauen."}, {"id": 727, "start": 9432.0, "end": 9447.0, "text": "Danke fürs Zuschauen."}, {"id": 728, "start": 9447.0, "end": 9462.0, "text": "Danke fürs Zuschauen."}, {"id": 729, "start": 9462.0, "end": 9477.0, "text": "Danke fürs Zuschauen."}, {"id": 730, "start": 9477.0, "end": 9492.0, "text": "Danke fürs Zuschauen."}, {"id": 731, "start": 9492.0, "end": 9507.0, "text": "Danke fürs Zuschauen."}, {"id": 732, "start": 9507.0, "end": 9522.0, "text": "Danke fürs Zuschauen."}, {"id": 733, "start": 9522.0, "end": 9537.0, "text": "Danke fürs Zuschauen."}, {"id": 734, "start": 9537.0, "end": 9552.0, "text": "Danke fürs Zuschauen."}, {"id": 735, "start": 9552.0, "end": 9567.0, "text": "Danke fürs Zuschauen."}, {"id": 736, "start": 9567.0, "end": 9582.0, "text": "Danke fürs Zuschauen."}, {"id": 737, "start": 9582.0, "end": 9597.0, "text": "Danke fürs Zuschauen."}, {"id": 738, "start": 9597.0, "end": 9612.0, "text": "Danke fürs Zuschauen."}, {"id": 739, "start": 9612.0, "end": 9627.0, "text": "Danke fürs Zuschauen."}, {"id": 740, "start": 9627.0, "end": 9642.0, "text": "Danke fürs Zuschauen."}, {"id": 741, "start": 9642.0, "end": 9657.0, "text": "Danke fürs Zuschauen."}, {"id": 742, "start": 9657.0, "end": 9672.0, "text": "Danke fürs Zuschauen."}, {"id": 743, "start": 9672.0, "end": 9687.0, "text": "Danke fürs Zuschauen."}, {"id": 744, "start": 9687.0, "end": 9702.0, "text": "Danke fürs Zuschauen."}, {"id": 745, "start": 9702.0, "end": 9717.0, "text": "Danke fürs Zuschauen."}, {"id": 746, "start": 9717.0, "end": 9732.0, "text": "Danke fürs Zuschauen."}, {"id": 747, "start": 9732.0, "end": 9747.0, "text": "Danke fürs Zuschauen."}, {"id": 748, "start": 9747.0, "end": 9762.0, "text": "Danke fürs Zuschauen."}, {"id": 749, "start": 9762.0, "end": 9777.0, "text": "Danke fürs Zuschauen."}, {"id": 750, "start": 9777.0, "end": 9792.0, "text": "Danke fürs Zuschauen."}, {"id": 751, "start": 9792.0, "end": 9807.0, "text": "Danke fürs Zuschauen."}, {"id": 752, "start": 9807.0, "end": 9822.0, "text": "Danke fürs Zuschauen."}, {"id": 753, "start": 9822.0, "end": 9837.0, "text": "Danke fürs Zuschauen."}, {"id": 754, "start": 9837.0, "end": 9852.0, "text": "Danke fürs Zuschauen."}, {"id": 755, "start": 9852.0, "end": 9867.0, "text": "Danke fürs Zuschauen."}, {"id": 756, "start": 9867.0, "end": 9882.0, "text": "Danke fürs Zuschauen."}, {"id": 757, "start": 9882.0, "end": 9897.0, "text": "Danke fürs Zuschauen."}, {"id": 758, "start": 9897.0, "end": 9912.0, "text": "Danke fürs Zuschauen."}, {"id": 759, "start": 9912.0, "end": 9927.0, "text": "Danke fürs Zuschauen."}, {"id": 760, "start": 9927.0, "end": 9942.0, "text": "Danke fürs Zuschauen."}, {"id": 761, "start": 9942.0, "end": 9957.0, "text": "Danke fürs Zuschauen."}, {"id": 762, "start": 9957.0, "end": 9972.0, "text": "Danke fürs Zuschauen."}, {"id": 763, "start": 9972.0, "end": 9987.0, "text": "Danke fürs Zuschauen."}, {"id": 764, "start": 9987.0, "end": 10002.0, "text": "Danke fürs Zuschauen."}, {"id": 765, "start": 10002.0, "end": 10017.0, "text": "Danke fürs Zuschauen."}, {"id": 766, "start": 10017.0, "end": 10032.0, "text": "Danke fürs Zuschauen."}, {"id": 767, "start": 10032.0, "end": 10047.0, "text": "Danke fürs Zuschauen."}, {"id": 768, "start": 10047.0, "end": 10062.0, "text": "Danke fürs Zuschauen."}, {"id": 769, "start": 10062.0, "end": 10077.0, "text": "Danke fürs Zuschauen."}, {"id": 770, "start": 10077.0, "end": 10092.0, "text": "Danke fürs Zuschauen."}, {"id": 771, "start": 10092.0, "end": 10107.0, "text": "Danke fürs Zuschauen."}, {"id": 772, "start": 10107.0, "end": 10122.0, "text": "Danke fürs Zuschauen."}, {"id": 773, "start": 10122.0, "end": 10137.0, "text": "Danke fürs Zuschauen."}, {"id": 774, "start": 10137.0, "end": 10152.0, "text": "Danke fürs Zuschauen."}, {"id": 775, "start": 10152.0, "end": 10167.0, "text": "Danke fürs Zuschauen."}, {"id": 776, "start": 10167.0, "end": 10182.0, "text": "Danke fürs Zuschauen."}, {"id": 777, "start": 10182.0, "end": 10197.0, "text": "Danke fürs Zuschauen."}, {"id": 778, "start": 10197.0, "end": 10212.0, "text": "Danke fürs Zuschauen."}, {"id": 779, "start": 10212.0, "end": 10227.0, "text": "Danke fürs Zuschauen."}, {"id": 780, "start": 10227.0, "end": 10242.0, "text": "Danke fürs Zuschauen."}, {"id": 781, "start": 10242.0, "end": 10257.0, "text": "Danke fürs Zuschauen."}, {"id": 782, "start": 10257.0, "end": 10272.0, "text": "Danke fürs Zuschauen."}, {"id": 783, "start": 10272.0, "end": 10287.0, "text": "Danke fürs Zuschauen."}, {"id": 784, "start": 10287.0, "end": 10302.0, "text": "Danke fürs Zuschauen."}, {"id": 785, "start": 10302.0, "end": 10317.0, "text": "Danke fürs Zuschauen."}, {"id": 786, "start": 10317.0, "end": 10332.0, "text": "Danke fürs Zuschauen."}, {"id": 787, "start": 10332.0, "end": 10347.0, "text": "Danke fürs Zuschauen."}, {"id": 788, "start": 10347.0, "end": 10362.0, "text": "Danke fürs Zuschauen."}, {"id": 789, "start": 10362.0, "end": 10377.0, "text": "Danke fürs Zuschauen."}, {"id": 790, "start": 10377.0, "end": 10392.0, "text": "Danke fürs Zuschauen."}, {"id": 791, "start": 10392.0, "end": 10407.0, "text": "Danke fürs Zuschauen."}, {"id": 792, "start": 10407.0, "end": 10422.0, "text": "Danke fürs Zuschauen."}, {"id": 793, "start": 10422.0, "end": 10437.0, "text": "Danke fürs Zuschauen."}, {"id": 794, "start": 10437.0, "end": 10452.0, "text": "Danke fürs Zuschauen."}, {"id": 795, "start": 10452.0, "end": 10467.0, "text": "Danke fürs Zuschauen."}, {"id": 796, "start": 10467.0, "end": 10482.0, "text": "Danke fürs Zuschauen."}, {"id": 797, "start": 10482.0, "end": 10497.0, "text": "Danke fürs Zuschauen."}, {"id": 798, "start": 10497.0, "end": 10512.0, "text": "Danke fürs Zuschauen."}, {"id": 799, "start": 10512.0, "end": 10527.0, "text": "Danke fürs Zuschauen."}, {"id": 800, "start": 10527.0, "end": 10542.0, "text": "Danke fürs Zuschauen."}, {"id": 801, "start": 10542.0, "end": 10557.0, "text": "Danke fürs Zuschauen."}, {"id": 802, "start": 10557.0, "end": 10572.0, "text": "Danke fürs Zuschauen."}, {"id": 803, "start": 10572.0, "end": 10587.0, "text": "Danke fürs Zuschauen."}, {"id": 804, "start": 10587.0, "end": 10602.0, "text": "Danke fürs Zuschauen."}, {"id": 805, "start": 10602.0, "end": 10617.0, "text": "Danke fürs Zuschauen."}, {"id": 806, "start": 10617.0, "end": 10632.0, "text": "Danke fürs Zuschauen."}, {"id": 807, "start": 10632.0, "end": 10647.0, "text": "Danke fürs Zuschauen."}, {"id": 808, "start": 10647.0, "end": 10662.0, "text": "Danke fürs Zuschauen."}, {"id": 809, "start": 10662.0, "end": 10677.0, "text": "Danke fürs Zuschauen."}, {"id": 810, "start": 10677.0, "end": 10692.0, "text": "Danke fürs Zuschauen."}, {"id": 811, "start": 10692.0, "end": 10707.0, "text": "Danke fürs Zuschauen."}, {"id": 812, "start": 10707.0, "end": 10722.0, "text": "Danke fürs Zuschauen."}, {"id": 813, "start": 10722.0, "end": 10737.0, "text": "Danke fürs Zuschauen."}, {"id": 814, "start": 10737.0, "end": 10752.0, "text": "Danke fürs Zuschauen."}, {"id": 815, "start": 10752.0, "end": 10767.0, "text": "Danke fürs Zuschauen."}, {"id": 816, "start": 10767.0, "end": 10782.0, "text": "Danke fürs Zuschauen."}, {"id": 817, "start": 10782.0, "end": 10797.0, "text": "Danke fürs Zuschauen."}, {"id": 818, "start": 10797.0, "end": 10812.0, "text": "Danke fürs Zuschauen."}, {"id": 819, "start": 10812.0, "end": 10827.0, "text": "Danke fürs Zuschauen."}, {"id": 820, "start": 10827.0, "end": 10842.0, "text": "Danke fürs Zuschauen."}, {"id": 821, "start": 10842.0, "end": 10857.0, "text": "Danke fürs Zuschauen."}, {"id": 822, "start": 10857.0, "end": 10872.0, "text": "Danke fürs Zuschauen."}, {"id": 823, "start": 10872.0, "end": 10887.0, "text": "Danke fürs Zuschauen."}, {"id": 824, "start": 10887.0, "end": 10902.0, "text": "Danke fürs Zuschauen."}, {"id": 825, "start": 10902.0, "end": 10917.0, "text": "Danke fürs Zuschauen."}, {"id": 826, "start": 10917.0, "end": 10932.0, "text": "Danke fürs Zuschauen."}, {"id": 827, "start": 10932.0, "end": 10947.0, "text": "Danke fürs Zuschauen."}, {"id": 828, "start": 10947.0, "end": 10962.0, "text": "Danke fürs Zuschauen."}, {"id": 829, "start": 10962.0, "end": 10977.0, "text": "Danke fürs Zuschauen."}, {"id": 830, "start": 10977.0, "end": 10992.0, "text": "Danke fürs Zuschauen."}, {"id": 831, "start": 10992.0, "end": 11007.0, "text": "Danke fürs Zuschauen."}, {"id": 832, "start": 11007.0, "end": 11022.0, "text": "Danke fürs Zuschauen."}, {"id": 833, "start": 11022.0, "end": 11037.0, "text": "Danke fürs Zuschauen."}, {"id": 834, "start": 11037.0, "end": 11052.0, "text": "Danke fürs Zuschauen."}, {"id": 835, "start": 11052.0, "end": 11067.0, "text": "Danke fürs Zuschauen."}, {"id": 836, "start": 11067.0, "end": 11082.0, "text": "Danke fürs Zuschauen."}, {"id": 837, "start": 11082.0, "end": 11097.0, "text": "Danke fürs Zuschauen."}, {"id": 838, "start": 11097.0, "end": 11112.0, "text": "Danke fürs Zuschauen."}, {"id": 839, "start": 11112.0, "end": 11127.0, "text": "Danke fürs Zuschauen."}, {"id": 840, "start": 11127.0, "end": 11142.0, "text": "Danke fürs Zuschauen."}, {"id": 841, "start": 11142.0, "end": 11157.0, "text": "Danke fürs Zuschauen."}, {"id": 842, "start": 11157.0, "end": 11172.0, "text": "Danke fürs Zuschauen."}, {"id": 843, "start": 11172.0, "end": 11187.0, "text": "Danke fürs Zuschauen."}, {"id": 844, "start": 11187.0, "end": 11202.0, "text": "Danke fürs Zuschauen."}, {"id": 845, "start": 11202.0, "end": 11217.0, "text": "Danke fürs Zuschauen."}, {"id": 846, "start": 11217.0, "end": 11232.0, "text": "Danke fürs Zuschauen."}, {"id": 847, "start": 11232.0, "end": 11247.0, "text": "Danke fürs Zuschauen."}, {"id": 848, "start": 11247.0, "end": 11262.0, "text": "Danke fürs Zuschauen."}, {"id": 849, "start": 11262.0, "end": 11277.0, "text": "Danke fürs Zuschauen."}, {"id": 850, "start": 11277.0, "end": 11292.0, "text": "Danke fürs Zuschauen."}, {"id": 851, "start": 11292.0, "end": 11307.0, "text": "Danke fürs Zuschauen."}, {"id": 852, "start": 11307.0, "end": 11322.0, "text": "Danke fürs Zuschauen."}, {"id": 853, "start": 11322.0, "end": 11337.0, "text": "Danke fürs Zuschauen."}, {"id": 854, "start": 11337.0, "end": 11352.0, "text": "Danke fürs Zuschauen."}, {"id": 855, "start": 11352.0, "end": 11367.0, "text": "Danke fürs Zuschauen."}, {"id": 856, "start": 11367.0, "end": 11382.0, "text": "Danke fürs Zuschauen."}, {"id": 857, "start": 11382.0, "end": 11397.0, "text": "Danke fürs Zuschauen."}, {"id": 858, "start": 11397.0, "end": 11412.0, "text": "Danke fürs Zuschauen."}, {"id": 859, "start": 11412.0, "end": 11427.0, "text": "Danke fürs Zuschauen."}, {"id": 860, "start": 11427.0, "end": 11442.0, "text": "Danke fürs Zuschauen."}, {"id": 861, "start": 11442.0, "end": 11457.0, "text": "Danke fürs Zuschauen."}, {"id": 862, "start": 11457.0, "end": 11472.0, "text": "Danke fürs Zuschauen."}, {"id": 863, "start": 11472.0, "end": 11487.0, "text": "Danke fürs Zuschauen."}, {"id": 864, "start": 11487.0, "end": 11502.0, "text": "Danke fürs Zuschauen."}, {"id": 865, "start": 11502.0, "end": 11517.0, "text": "Danke fürs Zuschauen."}, {"id": 866, "start": 11517.0, "end": 11532.0, "text": "Danke fürs Zuschauen."}, {"id": 867, "start": 11532.0, "end": 11547.0, "text": "Danke fürs Zuschauen."}, {"id": 868, "start": 11547.0, "end": 11562.0, "text": "Danke fürs Zuschauen."}, {"id": 869, "start": 11562.0, "end": 11577.0, "text": "Danke fürs Zuschauen."}, {"id": 870, "start": 11577.0, "end": 11592.0, "text": "Danke fürs Zuschauen."}, {"id": 871, "start": 11592.0, "end": 11607.0, "text": "Danke fürs Zuschauen."}, {"id": 872, "start": 11607.0, "end": 11622.0, "text": "Danke fürs Zuschauen."}, {"id": 873, "start": 11622.0, "end": 11637.0, "text": "Danke fürs Zuschauen."}, {"id": 874, "start": 11637.0, "end": 11652.0, "text": "Danke fürs Zuschauen."}, {"id": 875, "start": 11652.0, "end": 11667.0, "text": "Danke fürs Zuschauen."}, {"id": 876, "start": 11667.0, "end": 11682.0, "text": "Danke fürs Zuschauen."}, {"id": 877, "start": 11682.0, "end": 11697.0, "text": "Danke fürs Zuschauen."}, {"id": 878, "start": 11697.0, "end": 11712.0, "text": "Danke fürs Zuschauen."}, {"id": 879, "start": 11712.0, "end": 11727.0, "text": "Danke fürs Zuschauen."}, {"id": 880, "start": 11727.0, "end": 11742.0, "text": "Danke fürs Zuschauen."}, {"id": 881, "start": 11742.0, "end": 11757.0, "text": "Danke fürs Zuschauen."}, {"id": 882, "start": 11757.0, "end": 11772.0, "text": "Danke fürs Zuschauen."}, {"id": 883, "start": 11772.0, "end": 11787.0, "text": "Danke fürs Zuschauen."}, {"id": 884, "start": 11787.0, "end": 11802.0, "text": "Danke fürs Zuschauen."}, {"id": 885, "start": 11802.0, "end": 11817.0, "text": "Danke fürs Zuschauen."}, {"id": 886, "start": 11817.0, "end": 11832.0, "text": "Danke fürs Zuschauen."}, {"id": 887, "start": 11832.0, "end": 11847.0, "text": "Danke fürs Zuschauen."}, {"id": 888, "start": 11847.0, "end": 11862.0, "text": "Danke fürs Zuschauen."}, {"id": 889, "start": 11862.0, "end": 11877.0, "text": "Danke fürs Zuschauen."}, {"id": 890, "start": 11877.0, "end": 11892.0, "text": "Danke fürs Zuschauen."}, {"id": 891, "start": 11892.0, "end": 11907.0, "text": "Danke fürs Zuschauen."}, {"id": 892, "start": 11907.0, "end": 11922.0, "text": "Danke fürs Zuschauen."}, {"id": 893, "start": 11922.0, "end": 11937.0, "text": "Danke fürs Zuschauen."}, {"id": 894, "start": 11937.0, "end": 11952.0, "text": "Danke fürs Zuschauen."}, {"id": 895, "start": 11952.0, "end": 11967.0, "text": "Danke fürs Zuschauen."}, {"id": 896, "start": 11967.0, "end": 11982.0, "text": "Danke fürs Zuschauen."}, {"id": 897, "start": 11982.0, "end": 11997.0, "text": "Danke fürs Zuschauen."}, {"id": 898, "start": 11997.0, "end": 12012.0, "text": "Danke fürs Zuschauen."}, {"id": 899, "start": 12012.0, "end": 12027.0, "text": "Danke fürs Zuschauen."}, {"id": 900, "start": 12027.0, "end": 12042.0, "text": "Danke fürs Zuschauen."}, {"id": 901, "start": 12042.0, "end": 12057.0, "text": "Danke fürs Zuschauen."}, {"id": 902, "start": 12057.0, "end": 12072.0, "text": "Danke fürs Zuschauen."}, {"id": 903, "start": 12072.0, "end": 12087.0, "text": "Danke fürs Zuschauen."}, {"id": 904, "start": 12087.0, "end": 12102.0, "text": "Danke fürs Zuschauen."}, {"id": 905, "start": 12102.0, "end": 12117.0, "text": "Danke fürs Zuschauen."}, {"id": 906, "start": 12117.0, "end": 12132.0, "text": "Danke fürs Zuschauen."}, {"id": 907, "start": 12132.0, "end": 12147.0, "text": "Danke fürs Zuschauen."}, {"id": 908, "start": 12147.0, "end": 12162.0, "text": "Danke fürs Zuschauen."}, {"id": 909, "start": 12162.0, "end": 12177.0, "text": "Danke fürs Zuschauen."}, {"id": 910, "start": 12177.0, "end": 12192.0, "text": "Danke fürs Zuschauen."}, {"id": 911, "start": 12192.0, "end": 12207.0, "text": "Danke fürs Zuschauen."}, {"id": 912, "start": 12207.0, "end": 12222.0, "text": "Danke fürs Zuschauen."}, {"id": 913, "start": 12222.0, "end": 12237.0, "text": "Danke fürs Zuschauen."}, {"id": 914, "start": 12237.0, "end": 12252.0, "text": "Danke fürs Zuschauen."}, {"id": 915, "start": 12252.0, "end": 12267.0, "text": "Danke fürs Zuschauen."}, {"id": 916, "start": 12267.0, "end": 12282.0, "text": "Danke fürs Zuschauen."}, {"id": 917, "start": 12282.0, "end": 12297.0, "text": "Danke fürs Zuschauen."}, {"id": 918, "start": 12297.0, "end": 12312.0, "text": "Danke fürs Zuschauen."}, {"id": 919, "start": 12312.0, "end": 12327.0, "text": "Danke fürs Zuschauen."}, {"id": 920, "start": 12327.0, "end": 12342.0, "text": "Danke fürs Zuschauen."}, {"id": 921, "start": 12342.0, "end": 12357.0, "text": "Danke fürs Zuschauen."}, {"id": 922, "start": 12357.0, "end": 12372.0, "text": "Danke fürs Zuschauen."}, {"id": 923, "start": 12372.0, "end": 12387.0, "text": "Danke fürs Zuschauen."}, {"id": 924, "start": 12387.0, "end": 12402.0, "text": "Danke fürs Zuschauen."}, {"id": 925, "start": 12402.0, "end": 12417.0, "text": "Danke fürs Zuschauen."}, {"id": 926, "start": 12417.0, "end": 12432.0, "text": "Danke fürs Zuschauen."}, {"id": 927, "start": 12432.0, "end": 12447.0, "text": "Danke fürs Zuschauen."}, {"id": 928, "start": 12447.0, "end": 12462.0, "text": "Danke fürs Zuschauen."}, {"id": 929, "start": 12462.0, "end": 12477.0, "text": "Danke fürs Zuschauen."}, {"id": 930, "start": 12477.0, "end": 12492.0, "text": "Danke fürs Zuschauen."}, {"id": 931, "start": 12492.0, "end": 12507.0, "text": "Danke fürs Zuschauen."}, {"id": 932, "start": 12507.0, "end": 12522.0, "text": "Danke fürs Zuschauen."}, {"id": 933, "start": 12522.0, "end": 12537.0, "text": "Danke fürs Zuschauen."}, {"id": 934, "start": 12537.0, "end": 12552.0, "text": "Danke fürs Zuschauen."}, {"id": 935, "start": 12552.0, "end": 12567.0, "text": "Danke fürs Zuschauen."}, {"id": 936, "start": 12567.0, "end": 12582.0, "text": "Danke fürs Zuschauen."}, {"id": 937, "start": 12582.0, "end": 12597.0, "text": "Danke fürs Zuschauen."}, {"id": 938, "start": 12597.0, "end": 12612.0, "text": "Danke fürs Zuschauen."}, {"id": 939, "start": 12612.0, "end": 12627.0, "text": "Danke fürs Zuschauen."}, {"id": 940, "start": 12627.0, "end": 12642.0, "text": "Danke fürs Zuschauen."}, {"id": 941, "start": 12642.0, "end": 12657.0, "text": "Danke fürs Zuschauen."}, {"id": 942, "start": 12657.0, "end": 12672.0, "text": "Danke fürs Zuschauen."}, {"id": 943, "start": 12672.0, "end": 12687.0, "text": "Danke fürs Zuschauen."}, {"id": 944, "start": 12687.0, "end": 12702.0, "text": "Danke fürs Zuschauen."}, {"id": 945, "start": 12702.0, "end": 12717.0, "text": "Danke fürs Zuschauen."}, {"id": 946, "start": 12717.0, "end": 12732.0, "text": "Danke fürs Zuschauen."}, {"id": 947, "start": 12732.0, "end": 12747.0, "text": "Danke fürs Zuschauen."}, {"id": 948, "start": 12747.0, "end": 12762.0, "text": "Danke fürs Zuschauen."}, {"id": 949, "start": 12762.0, "end": 12777.0, "text": "Danke fürs Zuschauen."}, {"id": 950, "start": 12777.0, "end": 12792.0, "text": "Danke fürs Zuschauen."}, {"id": 951, "start": 12792.0, "end": 12807.0, "text": "Danke fürs Zuschauen."}, {"id": 952, "start": 12807.0, "end": 12822.0, "text": "Danke fürs Zuschauen."}, {"id": 953, "start": 12822.0, "end": 12837.0, "text": "Danke fürs Zuschauen."}, {"id": 954, "start": 12837.0, "end": 12852.0, "text": "Danke fürs Zuschauen."}, {"id": 955, "start": 12852.0, "end": 12867.0, "text": "Danke fürs Zuschauen."}, {"id": 956, "start": 12867.0, "end": 12882.0, "text": "Danke fürs Zuschauen."}, {"id": 957, "start": 12882.0, "end": 12897.0, "text": "Danke fürs Zuschauen."}, {"id": 958, "start": 12897.0, "end": 12912.0, "text": "Danke fürs Zuschauen."}, {"id": 959, "start": 12912.0, "end": 12927.0, "text": "Danke fürs Zuschauen."}, {"id": 960, "start": 12927.0, "end": 12942.0, "text": "Danke fürs Zuschauen."}, {"id": 961, "start": 12942.0, "end": 12957.0, "text": "Danke fürs Zuschauen."}, {"id": 962, "start": 12957.0, "end": 12972.0, "text": "Danke fürs Zuschauen."}, {"id": 963, "start": 12972.0, "end": 12987.0, "text": "Danke fürs Zuschauen."}, {"id": 964, "start": 12987.0, "end": 13002.0, "text": "Danke fürs Zuschauen."}, {"id": 965, "start": 13002.0, "end": 13017.0, "text": "Danke fürs Zuschauen."}, {"id": 966, "start": 13017.0, "end": 13032.0, "text": "Danke fürs Zuschauen."}, {"id": 967, "start": 13032.0, "end": 13047.0, "text": "Danke fürs Zuschauen."}, {"id": 968, "start": 13047.0, "end": 13062.0, "text": "Danke fürs Zuschauen."}, {"id": 969, "start": 13062.0, "end": 13077.0, "text": "Danke fürs Zuschauen."}, {"id": 970, "start": 13077.0, "end": 13092.0, "text": "Danke fürs Zuschauen."}, {"id": 971, "start": 13092.0, "end": 13107.0, "text": "Danke fürs Zuschauen."}, {"id": 972, "start": 13107.0, "end": 13122.0, "text": "Danke fürs Zuschauen."}, {"id": 973, "start": 13122.0, "end": 13137.0, "text": "Danke fürs Zuschauen."}, {"id": 974, "start": 13137.0, "end": 13152.0, "text": "Danke fürs Zuschauen."}, {"id": 975, "start": 13152.0, "end": 13167.0, "text": "Danke fürs Zuschauen."}, {"id": 976, "start": 13167.0, "end": 13182.0, "text": "Danke fürs Zuschauen."}, {"id": 977, "start": 13182.0, "end": 13197.0, "text": "Danke fürs Zuschauen."}, {"id": 978, "start": 13197.0, "end": 13212.0, "text": "Danke fürs Zuschauen."}, {"id": 979, "start": 13212.0, "end": 13227.0, "text": "Danke fürs Zuschauen."}, {"id": 980, "start": 13227.0, "end": 13242.0, "text": "Danke fürs Zuschauen."}, {"id": 981, "start": 13242.0, "end": 13257.0, "text": "Danke fürs Zuschauen."}, {"id": 982, "start": 13257.0, "end": 13272.0, "text": "Danke fürs Zuschauen."}, {"id": 983, "start": 13272.0, "end": 13287.0, "text": "Danke fürs Zuschauen."}, {"id": 984, "start": 13287.0, "end": 13302.0, "text": "Danke fürs Zuschauen."}, {"id": 985, "start": 13302.0, "end": 13317.0, "text": "Danke fürs Zuschauen."}, {"id": 986, "start": 13317.0, "end": 13332.0, "text": "Danke fürs Zuschauen."}, {"id": 987, "start": 13332.0, "end": 13347.0, "text": "Danke fürs Zuschauen."}, {"id": 988, "start": 13347.0, "end": 13362.0, "text": "Danke fürs Zuschauen."}, {"id": 989, "start": 13362.0, "end": 13377.0, "text": "Danke fürs Zuschauen."}, {"id": 990, "start": 13377.0, "end": 13392.0, "text": "Danke fürs Zuschauen."}, {"id": 991, "start": 13392.0, "end": 13407.0, "text": "Danke fürs Zuschauen."}, {"id": 992, "start": 13407.0, "end": 13422.0, "text": "Danke fürs Zuschauen."}, {"id": 993, "start": 13422.0, "end": 13437.0, "text": "Danke fürs Zuschauen."}, {"id": 994, "start": 13437.0, "end": 13452.0, "text": "Danke fürs Zuschauen."}, {"id": 995, "start": 13452.0, "end": 13467.0, "text": "Danke fürs Zuschauen."}, {"id": 996, "start": 13467.0, "end": 13482.0, "text": "Danke fürs Zuschauen."}, {"id": 997, "start": 13482.0, "end": 13497.0, "text": "Danke fürs Zuschauen."}, {"id": 998, "start": 13497.0, "end": 13512.0, "text": "Danke fürs Zuschauen."}, {"id": 999, "start": 13512.0, "end": 13527.0, "text": "Danke fürs Zuschauen."}, {"id": 1000, "start": 13527.0, "end": 13542.0, "text": "Danke fürs Zuschauen."}, {"id": 1001, "start": 13542.0, "end": 13557.0, "text": "Danke fürs Zuschauen."}, {"id": 1002, "start": 13557.0, "end": 13572.0, "text": "Danke fürs Zuschauen."}, {"id": 1003, "start": 13572.0, "end": 13587.0, "text": "Danke fürs Zuschauen."}, {"id": 1004, "start": 13587.0, "end": 13602.0, "text": "Danke fürs Zuschauen."}, {"id": 1005, "start": 13602.0, "end": 13617.0, "text": "Danke fürs Zuschauen."}, {"id": 1006, "start": 13617.0, "end": 13632.0, "text": "Danke fürs Zuschauen."}, {"id": 1007, "start": 13632.0, "end": 13647.0, "text": "Danke fürs Zuschauen."}, {"id": 1008, "start": 13647.0, "end": 13662.0, "text": "Danke fürs Zuschauen."}, {"id": 1009, "start": 13662.0, "end": 13677.0, "text": "Danke fürs Zuschauen."}, {"id": 1010, "start": 13677.0, "end": 13692.0, "text": "Danke fürs Zuschauen."}, {"id": 1011, "start": 13692.0, "end": 13707.0, "text": "Danke fürs Zuschauen."}, {"id": 1012, "start": 13707.0, "end": 13722.0, "text": "Danke fürs Zuschauen."}, {"id": 1013, "start": 13722.0, "end": 13737.0, "text": "Danke fürs Zuschauen."}, {"id": 1014, "start": 13737.0, "end": 13752.0, "text": "Danke fürs Zuschauen."}, {"id": 1015, "start": 13752.0, "end": 13767.0, "text": "Danke fürs Zuschauen."}, {"id": 1016, "start": 13767.0, "end": 13782.0, "text": "Danke fürs Zuschauen."}, {"id": 1017, "start": 13782.0, "end": 13797.0, "text": "Danke fürs Zuschauen."}, {"id": 1018, "start": 13797.0, "end": 13812.0, "text": "Danke fürs Zuschauen."}, {"id": 1019, "start": 13812.0, "end": 13827.0, "text": "Danke fürs Zuschauen."}, {"id": 1020, "start": 13827.0, "end": 13842.0, "text": "Danke fürs Zuschauen."}, {"id": 1021, "start": 13842.0, "end": 13857.0, "text": "Danke fürs Zuschauen."}, {"id": 1022, "start": 13857.0, "end": 13872.0, "text": "Danke fürs Zuschauen."}, {"id": 1023, "start": 13872.0, "end": 13887.0, "text": "Danke fürs Zuschauen."}, {"id": 1024, "start": 13887.0, "end": 13902.0, "text": "Danke fürs Zuschauen."}, {"id": 1025, "start": 13902.0, "end": 13917.0, "text": "Danke fürs Zuschauen."}, {"id": 1026, "start": 13917.0, "end": 13932.0, "text": "Danke fürs Zuschauen."}, {"id": 1027, "start": 13932.0, "end": 13947.0, "text": "Danke fürs Zuschauen."}, {"id": 1028, "start": 13947.0, "end": 13962.0, "text": "Danke fürs Zuschauen."}, {"id": 1029, "start": 13962.0, "end": 13977.0, "text": "Danke fürs Zuschauen."}, {"id": 1030, "start": 13977.0, "end": 13992.0, "text": "Danke fürs Zuschauen."}, {"id": 1031, "start": 13992.0, "end": 14007.0, "text": "Danke fürs Zuschauen."}, {"id": 1032, "start": 14007.0, "end": 14022.0, "text": "Danke fürs Zuschauen."}, {"id": 1033, "start": 14022.0, "end": 14037.0, "text": "Danke fürs Zuschauen."}, {"id": 1034, "start": 14037.0, "end": 14052.0, "text": "Danke fürs Zuschauen."}, {"id": 1035, "start": 14052.0, "end": 14067.0, "text": "Danke fürs Zuschauen."}, {"id": 1036, "start": 14067.0, "end": 14082.0, "text": "Danke fürs Zuschauen."}, {"id": 1037, "start": 14082.0, "end": 14097.0, "text": "Danke fürs Zuschauen."}, {"id": 1038, "start": 14097.0, "end": 14112.0, "text": "Danke fürs Zuschauen."}, {"id": 1039, "start": 14112.0, "end": 14127.0, "text": "Danke fürs Zuschauen."}, {"id": 1040, "start": 14127.0, "end": 14142.0, "text": "Danke fürs Zuschauen."}, {"id": 1041, "start": 14142.0, "end": 14157.0, "text": "Danke fürs Zuschauen."}, {"id": 1042, "start": 14157.0, "end": 14172.0, "text": "Danke fürs Zuschauen."}, {"id": 1043, "start": 14172.0, "end": 14187.0, "text": "Danke fürs Zuschauen."}, {"id": 1044, "start": 14187.0, "end": 14202.0, "text": "Danke fürs Zuschauen."}, {"id": 1045, "start": 14202.0, "end": 14217.0, "text": "Danke fürs Zuschauen."}, {"id": 1046, "start": 14217.0, "end": 14232.0, "text": "Danke fürs Zuschauen."}, {"id": 1047, "start": 14232.0, "end": 14247.0, "text": "Danke fürs Zuschauen."}, {"id": 1048, "start": 14247.0, "end": 14262.0, "text": "Danke fürs Zuschauen."}]}