{"text": "Moin Leute, seh schon, die ersten hier in der Abobox gecampt. Ja, ich war die Woche bisschen abgetaucht, ich hab bisschen rumgebastelt an einem Programm in Go. Ich hab noch nie was in Go programmiert vorher und ich muss sagen, ich fand die Go scheiße vorher. Ich finde Go immer noch ziemlich kacke, jetzt nachdem ich ne Woche rumgewurstet hab in Go. Der Phoenix ist am Start, Twitchprime, vier Monate, oh, Blends, Bigbrain, ich wollte grad sagen BigPrime, eigentlich ist es ja BigPrime. BigPrime für Bigbrain, ja zumindest funktioniert mein Go Programm jetzt, Schache ist plus die. Ich hab an irgendeiner Stelle einen Memory Leak und ich hab keine Ahnung warum. Ich mein, das ist ja nicht einfach nur irgendwas Simples in Go, ich muss ja wieder schon gleich das abgedrehte Zeug machen. Und zwar, ich hab ein Go Programm gebastelt, was RTSP Camera Streams nimmt, quasi remaxed und dann im Browser anzeigen kann, ohne Verzögerung oder ohne große Verzögerung mit WebRTC. Das ist quasi Pleading Edge neuester Shit und irgendwie hab ich den FFmpeg an einer Stelle in einem Memory Leak und ich hab keine Ahnung wo das herkommt. Ich hab zwar alles gefreed, aber es ist doch nicht alles gefreed, wie es aussieht. Ich muss mal gucken ob meine Linux VM funktioniert, ja, da ist er doch, perfekt, bei Memory Leak einfach mehr RAM kaufen. Ja, das läuft halt auch im Raspberry Pi 3 und das hat maximal 200, aber normalerweise brauchst du 35 MB, sonst nichts. Normalerweise brauchst du 35 MB, ist das öffentlich, ich kann das veröffentlichen, aber ich muss aber erstmal meine Camera Streams mit Passwörtern rausschmeißen. Also es ist jetzt nicht geheim oder so, mal gucken, ob da kein Passwörter drin ist. Also falls, ich warte noch mal ob ein paar Leute ankommen, vielleicht haben wir ja Big Brain Go Kenner, die Memory Leaks fixen. Wann veröffentlicht du endlich dein Meanboard für 2, wenn es fertig ist? Das ist ja nicht fertig, das buggt beispielsweise rum, wenn ich neue Sachen hinzufüge. Was ich ja auch gerne noch einbauen würde, ist so Basic Animations Support, der nix kann außer den Bild von links nach rechts über den Bildschirm laufen lassen. Oder noch viel geiler, wenn man 2 Bilder hintereinander anzeigen lassen könnte, weil dann könnte man hier den Scheibenwischer davor hin und her laufen lassen. Oder man müsste einen Gift raus machen, da müsste einer mal einen Gift raus machen, was den Scheibenwischer hier einfach nur einmal da und einmal da zeigt, dass man nicht so viel Arbeit hat. Einfach so ein gelobtes Gift mit 2 Sachen, das sieht dann immer besser aus, wenn das da drin steckt. Weil ich ja immer noch der Meinung bin, dass Lull eindeutig größer Keck W ist. Keck W ist so New Generation Twitch. Oldschool Leute verwenden eigentlich sogar Lull mit kleinem U. Erinnert sich noch einer an die Zeiten, als alle Franker Sie geschrieben haben, das benutzt heute kein Mensch mehr. Franker Sie, Franker Sie, Franker Sie, Franker Sie, Franker Sie, das benutzt kein Mensch mehr mittlerweile. Aber, das war Oldschool Twitch. Oder kennt noch jemand, kennt noch Greyface Snowspace, kennt das noch jemand? Greyface Snowspace, man muss ja sagen, gute Titel hat er schon immer, da bist du immer dran interessiert drauf zu klicken, wobei die Videos meistens jetzt vom Inhalt her nicht so meins sind. Greyface Snowspace, genau, so ging das, kann man gleich Greyface Snowspace. Office 3.0 und Windows 10, ja das habe ich mir schon aufgemacht, mal gucken, ob das funktioniert. Ich habe mir übrigens was überlegt, das Windows 98 Video kam ja so gut an, ich mache einen zweiten Teil davon, war jetzt eine Woche abgetaucht, habe auch keine Videos gemacht, das kam ja so gut an, das Windows 98 Video, guckt euch das mal an, das ist ja huge hier, 116.000 Aufrufe. Der Sebaro ist am Start, nice, da kann ich nur dazu sagen, und ich mache dann einen zweiten Teil zu, und zwar probieren wir da mal ein paar olle Windows Sachen aus, so Microsoft Frontpage aus Office 97 und sowas und am Ende des Videos upgraden wir, das ist so als Cliffhanger für noch ein Video, upgraden wir auf Windows ME, so eigentlich eine gute Idee, oder? Erstmal ein bisschen alles täuschen und dann am Ende auf Windows ME upgraden, denn das ist echt big brain. Übrigens habe ich euch erzählt, dass ich es geschafft habe, dass mich mein Hoster gebannt hat, also Hoster, Hoster nicht, die hosten zwar auch, aber ich habe nur meine zwei Domains da, die haben mich gebannt, da habe ich an Support geschrieben, ich habe gesagt, Jungs, ihr habt mich gebannt, da haben sie mich entbannt, jetzt bin ich wieder gebannt, und warum? Ganz einfach, weil ich mir gedacht habe, nein, nein, nein, nicht auf Twitter geflammt, das ist ja nicht MSI, weil ich mir gedacht habe, um Let's Encrypt Zertifikate zu generieren, sagt das, sagt, weiß jeder was Let's Encrypt ist? Let's Encrypt ist ein kostenloser Service, wo man sich gültige SSL, HTTPS Zertifikate generieren lassen kann, und da habe ich mir gedacht, bevor ich jedes mal von Hand Sachen eintrage dort, dass ich mir neue Zertifikate generieren kann, bzw. dass ich irgendwo einen Public Web Server hinstelle, dass ich Zertifikate generieren kann, bin ich jetzt big brain und mache einen Chrome Skript, das ist eine Library mit der man Chrome fernsteuern kann, die ist ganz unbeliebt mit 55.700 Sternen auf GitHub, das ist eigentlich auch super easy, so kann man beispielsweise Sachen, Screenshots von Seiten machen und so was, und da habe ich gedacht, ok, ich mache einfach jetzt ein Puppetieres JavaScript Programm, wo ich einen Headless Chrome fernsteuere, also sprich man sieht dann auch kein Fenster, und ich tue einfach so, als würde ich das manuell machen, und irgendwie habe ich das Skript, also das Skript hat sich dann, das habe ich gestartet, dann ist im Hintergrund ein Chrome aufgegangen, hat dort sich eingeloggt und dann im Endeffekt dort Zeugs eingetragen in DNS, dass ich ein Zertifikat generieren kann, also eigentlich kann es easy, das Problem war nur, während ich das gebastelt habe, das funktioniert ja nicht auf Anhieb, habe ich es ein paar mal zu oft gestartet, und einmal hatte ich wohl auch irgendeinen Bug drinnen, dass es sich irgendwie 800 mal versucht hat einzuloggen, und dann haben sie mich geblockt, haben gesagt, wir haben verdächtige Aktivitäten erkannt von ihrer IP, und jetzt haben wir sie geblockt, ok, habe ich den Support angeschrieben, habe gesagt, ja, ups, war keine Absicht, da haben sie gesagt, ja sie mögen das auch nicht, wenn man ihre Webinterface, quasi Bots, Skript drauf laufen lässt, verstehe ich, kein Anbieter mag das, das hassen alle, alle Anbieter hassen diesen Trick, so, und dann haben sie mich wieder entbandt, ich habe gesagt, es passiert nicht mehr, und jetzt gestern, habe ich, keine Ahnung, 20 Anfragen geschickt oder so, nicht viel, jetzt bin ich wiedergeblockt, wahrscheinlich haben sie mich schon auf so einer verschärften Liste drauf gehabt, nicht 8000, 800, war nur 800, naja, zumindest, Linux 20 years ago, das müssen wir gucken, naja, zumindest habe ich jetzt angeschrieben, dass die mich mal wieder anplocken sollen, weil, haben die kein Captcha drinnen, nö, das wäre, das wäre doof, wenn die Captcha hätten, weil dann kann man es nämlich komplett vergessen, oh, Saps, hier, am Start, Big Prime, Big Brain, Zero, mit 3 Nullen, oder besser gesagt, 3, 1M0 in der Mitte, 3 Monate, Hypers, aber sowas von, den brauche ich übrigens auch noch mal transparent im Hintergrund, der Stellsohr, 3 Monate, wupp wupp, 3 Monate, huge, Pock, und da haben wir, da, Phobie, 3 Monate, ja heute, liegen ja die Abos, excellent Subscribers, ne, die haben kein Captcha drinnen, die sind aber ehrlich gesagt blöd, dass sie kein Captcha drinnen haben, weil hätten sie nämlich ein Captcha drinnen, dann hätte ich das vergessen können, wobei es gibt, es gibt mittlerweile ganz gute Captcha Solving, es gibt mittlerweile, ich weiß gar nicht, wer was es war, was könnte es, ne, das ist das Browser Addon, also es gibt, es gibt mittlerweile ganz gute Bots und KI´s, die Captchas, halbwegs, nicht gut, ja, also wirklich gut funktioniert das ganze nicht, aber die Captchas ansatzweise lösen können, das Addon kenne ich noch gar nicht, was macht das denn, das ist doch ein ganz normales Captcha oder, was macht das Addon, improve your experience with Captchas, das beste Captcha ist eh die ganz neuen, die gar keine Bilder mehr brauchen, die einfach irgendwelche Metadaten einsammeln und dann quasi so tun, als wäre es, könnten sie das da raus erkennen, ja, manche, also ich hab´s auch schon geschafft, vor allem, also bei Captchas, wo ich immer versage, ist, welche Bilder enthalten den Hydrant, kennt ihr das, ja, da, da versage ich immer bei, ja, ich mein, die hier sind jetzt relativ auffällig, ja, aber die haben manchmal Bilder drin, da steht, da steht da hinter Baum noch ein Hydrant und so und das wollen wir dann erkennen, dafür sage ich immer, vor allem sind die, sind ja auch in so, weißt was ich, hier, hier neben steht noch ein Hydrant oder sowas, das kannst du teilweise komplett, komplett vergessen, also beim Feuerhydrant verkacke ich öfters, was auch, was auch Kackcaptcha ist, Captcha, Captcha Storefront, Storefront, das ist auch saumäßig schwierig, weil, ich hab ehrlich gesagt keine Ahnung, was da von Geschäfte sind, ich mein, ey, vielleicht ist da ein Geschäft drin, wo soll ich das wissen, oder das hier, ist das ein Storefront, ist das hier ein Storefront, wahrscheinlich, keine Ahnung, also, Feuerhydrant und, und Store, und, und Geschäfte, da versage ich immer, guck mal, das hier kann auch ein Geschäft sein, und das hier auch, was weiß ich, markieren sie alle Felder mit einem Auto, ja, wobei, also, Feuerhydrant und Storefront, da verkacke ich's immer richtig, ja, Serious Max, das gleiche Problem hab ich auch, ähm, ähm, Graphic Sites, das hier, diese Dinger sind auch Kacke, weil du hast hier manchmal, manchmal Bilder, guck mal, stellt euch mal vor, dieses Schild würde noch ein Stückchen hier reinragen, soll man das Bild jetzt mitmarkieren oder nicht, ja, oder, oder, oder ist, ist das da, ist das Bild da unten, ist da noch ein Traffic Light drauf oder nicht, was ist, was sind die richtigen Felder, das, das, das, das, oder das da noch dabei, ja, also, äh, das ist nicht unbedingt immer so klar, ja, Traffic Light heißt Ampeln, ja, ja, theoretisch, theoretisch, theoretisch müsste es die Stange mitmarkieren, wenn sie die komplette Ampel meinen, aber vielleicht meinen die ja wirklich nur dort, wo die Licht, wo die, wo die Ampeldinger hängen, also, was, Capture Dish, Dishwasher? Capture Dish, Dish, ohje, ohje Leute, anti, das, das männliche Patriarchat macht sich wieder breit hier, aber das ist tatsächlich ganz lustig, aber das Problem ist, dass die Leute heute bei jedem Scheiß gedriggert sind, ja, das gleiche könntest du für Männer machen mit irgendwelchen Klischees, was aber, naja, naja Leute, übrigens, ich habe immer noch meine SSD hier rum liegen, fällt mir gerade auf, weil ich das hier noch offen hatte, ähm, die ich mal endlich einbauen muss, die liegt hier noch, die liegt hier schon, ah, hier, hier ist sie noch da, die 970 Evo habe ich immer noch nicht eingebaut, wenn ich die eingebaut hätte, dann könnte ich auch Call of Duty Modern Warfare und meine VMs auf der SSD installieren, weil COD braucht ja nur 107 Gigabyte, ich weiß, ganz ehrlich, ich habe keine Ahnung, warum dieses Spiel so viel Speicherplatz braucht, echt kein Plan, so Leute, sind jetzt ja ein paar da, haben wir irgendwelche Leute, die sich mit Go und eventuell auch FFmpeg auskönnen und mir sagen können, warum ich eine Memory Leak habe, in dem Programm, was ich gebastelt habe, hm, ich habe keine Ahnung, warum, es ist wahrscheinlich auch absolut nicht, nicht Go Style, ja, ich habe eine Memory Leak, ich kann das ja mal auf GitHub in irgendeinem List hochladen und wer Bock hat, sich das anzugucken, warum ich eine Memory Leak habe, der kann es ja, äh, wer was schreibt, Gist, habe ich überhaupt eingeloggt, nee, gehen wir mal Paste Bin, Paste Bin, Red Dead Redemption 2, ach, da wollte ich mal gucken, warte mal, wir gucken uns mal den Game Star Test an, Gangster, Game Star, wollen wir den Test angucken von der Game Star von Red Dead Redemption 2 auf dem PC, das ist noch nicht gut genug, Rockstar stolpert auf den PC, ja, also, Paste Bin, ich lad mal kurz mein Go Programm hoch und falls irgendjemand sich auskennt und eine Ahnung hat, warum ich da eine Memory Leak in der Verursache, der kann mir Bescheid sagen, ich habe meine Kameras Streams rausgenommen, da ist jetzt bloß noch ein Test Kameras Stream drinne, allerdings dreimal und auch ohne verbundene User hat das Ding eine Memory Leak, also das HTML Frontend muss ich gar nicht hochladen, mal gucken, dass ich da nicht irgendwelche Passwörter drinne hab, wie markiert man den Programm hier als Software, Sündagshilating Go, unlisted, ist ein bisschen länger, aber das eigentlich Interessante, wo das Memory Leak ist, zeige ich euch, ist hier, das sind wenigstens noch Captures die Kammer, mit denen kann man was anfangen, also, Paste das mal, also falls sich irgendjemand daran auslassen möchte, warum ich eine Memory Leak habe, und zwar das eigentliche Memory Leak passiert, glaube ich, das eigentliche Memory Leak passiert hier bei meinem FFmpeg Stuff, und zwar vermute ich mal, dass ich, weil das ist ja C, C Interop, vermute mal, dass ich das hier nicht richtig free, wobei ich das an allen Stellen, die mir bekannt sind free, oder aber, dass ich hier irgendwas nicht free, ich bin mir da aber ehrlich gesagt nicht so ganz sicher, also hier ist die Stelle wo das Memory Leak ist, der Rest ist egal, der Rest ist wurscht, meine Keys habe ich auch nicht mit eingecheckt und sowas, also theoretisch kann man das in Go Copy Pasten und das sollte funktionieren, und man sieht auch gleich, dass es Memory Leak ist, also ich weiß nicht warum, ja und was es macht ist RTSP Streams nehmen und so umwursten, dass man sie sich im Browser angucken kann, tschüss Twitch Prime zwei Monate, nice, big prime, big brain, nice, nice sub, excellent, naja also falls irgendjemand Bock hat sich das mal anzugucken, ich habe echt keinen Plan warum das Memory Leak ist, naja, aber das machen wir jetzt nicht hier an Stream, so gucken wir uns mal den Test von der Gamster an, Threated Dream Damage 2, da bin ich mal angeschaut, was die da zu sagen, warum Go, ja in dem Fall, also wenn es nach mir gegangen wäre Flo hätte ich das natürlich gemacht, aber es ist in Go, weil es nur für Go eine ordentliche WebRTC Library gibt, so und ich will ja, also WebRTC ist ja eigentlich eine Technik wo man von Browser zu Browser Video und Audio macht für irgendwelche Video-Audio-Konferenzen gibt, allerdings möchte ich jetzt nicht WebRTC machen mit einem Browser, sondern mit meinem Server und dem Browser, also das heißt mein Server muss so tun, als dass er eine WebRTC kleint, nein es gibt für.NET Core keine WebRTC Library, vor allem keine die auch unter Linux funktioniert, gibt es nicht, man kann sich ja mal gucken ob du was findest, es gibt ein paar Sachen die sind aber Windows Only und auch ziemlich unfertig, so und nur für Go gibt es ordentliche WebRTC, Web ist auch relativ beliebt, deswegen habe ich mir gedacht komm dann machen wir das ganze in Go und im Prinzip macht es ja nichts anderes, jetzt habe ich übrigens schon zugebracht, im Prinzip macht es ja nichts anderes, wie diese Streams hier zu nehmen, dann in FFmpeg quasi sich dahin zu connecten und dann an den Browser die encoded Pakete zu schicken, also bloß halt ein bisschen WebRTC gedürnt hier unten drunter aber das ist eigentlich egal, das MemoryLeak tritt schon auf wenn man das Programm einfach nur startet, man muss es einfach nur starten und keine Ahnung man guckt sich das ganze mit Top oder so an oder mit Hardtop und man wird sehen, es hat Instant MemoryLeak immer ein paar Kilobyte, also das heißt es muss hier in dieser FFmpeg Verarbeitungsschleife eine MemoryLeak haben und ich habe keine Ahnung warum, mein Packet, das einzige was ich allokiere in der Schleife ist ja im Prinzip das Packet, aber und ich free das auch überall wo die Schleife abbrechen könnte, ja überall wird das gefreet, ich vermute ja das hier ist, dass das hier irgendwie MemoryLeak, allerdings weiß ich nicht warum, weil normalerweise sollte ja eigentlich das da nur ein Zeiger sein auf das C, der Byte Array aus von dem Packet, also sprich wenn ich das Packet free, sollten eigentlich die Bytes auch weg sein soweit von der Idee her, aber ich weiß nicht woran, vielleicht liegt es an dem plus eins, vielleicht müsste ich es ohne plus eins machen, vielleicht ist es doch zu lang, aber dann müsste das eigentlich sich abkacken, ja ich habe keine Ahnung Leute, also falls ihr euch einer mit Go auskennt, tut euch kein Zwang an, sonst in irgendeinem Fall kriege ich das bestimmt noch raus. So jetzt gucken wir uns mal an was die GameStars zu Red Dead Redemption auf dem PC sah, mal gespannt, ob es das lohnt, ihr wisst ja ich bin generell kein Open World, viele Fan, außer der Switcher, zumindest auf der Switch, also der Switcher 3 war so ein Open World Spiel, das fand ich ganz gut, aber vor allem weil es einen roten Faden hatte, aber GTA beispielsweise ist nicht meins, oh ein Dance Game Star, laut genug, im Schlechtem, ja das war nicht schlecht, weil die Systemanforderungen hoch sind und es zum Release bei einigen technischen Probleme gab, besonders mit dem Rockstar Games Launcher, oh Gott jeder braucht so einen Kack extra Launcher, der funktioniert dann aber nicht, weil Rockstar doch will, dass man den hauseigenen Launcher nutzt, warum dann überhaupt bei der Installation einen Shortcut anlegen, egal das ist nur ein kleines Detail, viel schlimmer waren da Abstürze oder Probleme das Spiel überhaupt zum starten zu kriegen, aber wie gesagt das betrifft nur einen kleinen Teil der Spieler und Rockstar hat schnell Updates rausgejagt um die Probleme zu lösen und soweit sich das einschätzen lässt scheinen die Patches bei sehr vielen Betroffenen geholfen zu haben, im Guten ist Red Dead Redemption 2 ein Monster, weil das Spiel sehr umfangreich und optionsreich ist, wobei die rund 60 Stunden lange Singleplayer Kampagne nur der Anfang ist, Nebenaufgaben und Aktivitäten runden das Angebot für Einzelspieler ab, während im Multiplayer noch mal einige Storyaufträge für Koop-Spieler und verschiedene Versus-Modi warten und natürlich eine gigantische Spielwelt in der man sich beim Reiten und Jagen verlieren kann, diese Open World sieht auf dem PC nochmal besser aus als auf den Konsolen, im Vergleich zur Xbox One X Fassung, also der besten verfügbaren Konsolenversion, ist der Sprung auf den PC in Sachen Bildqualität und Details aber sehr überschaubar, wirklich auffällig sind nur etwas bessere Reflektionen auf dem Wasser, die etwas besser... ...nicht darauf entwickelt worden da jetzt irgendwie, die haben jetzt da nichts großartiges super tolles neues eingebaut, ich meine das Fell sieht vielleicht ein bisschen besser aus, wobei, ja, das einzige was halt besser sein wird ist die Auflösung im Endeffekt. Ja das stimmt, das sieht besser aus. Haha, die Gegner sind auch richtig doof oder? So würde ich das natürlich auch machen, wenn ich dann umgeworfen hab, mich erstmal so vor ihn hängen, dass er mir das Schrotgewehr abnehmen kann. ...sind im Vergleich mit der One X Fassung zwar mit der Lupe zu erkennen, fallen im laufenden Spiel, aber nicht wirklich auf, ein herausstechendes neues Grafikfeature, wie damals bei GTA 5, wo es nur auf dem PC dynamische Sch... Aber schöner sieht das doch aus oder ist das einfach, das ist einfach eine andere Tageszeit oder? Ah, oder, weil, sieht einfach anders aus. Grafikfeature, wie damals bei GTA 5, wo es nur auf dem PC dynamische Schatten von Lichtquellen wie Autoscheinwerfern gab, bietet Rockstar für Red Dead Redemption 2 auf dem PC diesmal nicht. Trotzdem gehört das Spiel zu den schönsten, die es derzeit gibt und der geringe Unterschied zur Xbox One X zeigt nur, wie unglaublich gut der Titel schon auf den Konsolen aussah. Der wichtigste grafische Unterschied zwischen Red Dead 2 auf PC und Konsole liegt aber sowieso nicht bei den Details, sondern bei der Frame Rate. Auf dem PC sind natürlich mehr als die gelockten 30 FPS der Konsolenversion möglich, vorausgesetzt, ihr habt die passende Hardware. Denn auch bei den Systemanforderungen ist Red Dead Redemption 2 auf dem PC ein Monster und frisst eure Ressourcen erbarmungslos auf. 4K mit 60 FPS überfordert selbst die beste aktuelle Hardware, so heißt ein In-Evo I9 9009, oder besser gesagt, oder besser gesagt, 1080p am besten mit 100 plus FPS und eine GeForce RTX 2080 Ti. Das klingt jetzt erstmal ziemlich schlimm, ist es aber nicht, denn Red Dead Redemption 2 bietet wie schon GTA 5 auf dem PC eine lange Liste an Einstellungsmöglichkeiten. Der Unterschied zwischen hohen und Ultraeinstellungen macht sich zwar in den FPS bemerkbar, aber nicht wirklich in der Bildqualität. Erst bei mittleren Einstellungen spürt man kleine Qualitätseinbußen mit Ausnahme der Texturqualität, die ihr möglichst hoch eingestellt lassen solltet. Wer in GTA 5 in 1080p und 60 FPS bei maximalen Details spielen kann, sollte Red Dead 2 in dieser Auflösung mindestens mit mittleren, in manchen Bereichen auch mit hohen Einstellungen auf stabile 60 Bilder bringen können. Zumindest in den allermeisten Szenen. Ihr braucht also nicht zwingend die neueste Grafikkarten-Generation von AMD und Nvidia, eine gute Mittelklasse-Karte, beispielsweise eine GeForce GTX 1070, reicht für 1080p 60 Frames und mittlere bis hohe Einstellungen. Also genau das, was man in diesem Hardware-Preissegment bei einem aktuellen Spiel mit so guter Grafik erwarten kann. Trotzdem gilt, wie bei fast allen Spielen, die mit Fokus auf Konsolen entwickelt wurden, dass meist die Grafikkarte den größten Einfluss auf die Performance hat. Ein besserer Prozessor oder mehr RAM bringen hinweg nicht sehr viel. Was sei denn eure 4-Kern-CPI? Vor allem muss man halt sagen, jetzt hätte ich jetzt eigentlich erwartet, dass man klar macht eine Grafikkarte viel aus, weil ich meine, die Grafikkarten in der aktuellen Konsolen-Generation ist halt crap. Aber gerade bei so viel terrenlastigen Open-World-Dingern macht es oftmals auch ein bisschen CPU aus, aber anscheinend nicht. CPU ist noch so alt, dass sie ohne virtuelle Kernverdopplung arbeitet, das betrifft beispielsweise ältere i5-Modelle. Welche Einstellungen nun genau wie viel Performance bei unterschiedlichen Auflösungen bringen, muss jeder Spieler mit seiner individuellen Hardware selbst herausfinden. Die offiziellen Systemanforderungen von Rockstar empfehlen als Minimum ein Intel Core i5 2500 oder einen AMD FX6300 sowie ein 720p mit 25 PS laufen, aber das menschliche Auge sieht ja ähnlich aus. Das sieht aber echt schick aus. Das braucht auch kein Fick, ich habe nicht mal ein 4K-Monitor hier im Arbeitszimmer stehen. Als Orientierungshilfe und zum besseren Anpassen der Spieldetails bietet Red Dead 2 aber einen internen Benchmark. Der simuliert zwar nicht alle möglichen Situationen, ist deshalb noch kein Garant dafür, dass das Spiel tatsächlich immer rund läuft, zum Rumexperimentieren und als Erstanhaltspunkt ist der Benchmark aber sehr nützlich. So schön das übrigens ist, dass man so viel einstellen kann, so ärgerlich ist es, dass die Erklärungen dazu teilweise sehr kryptisch ausfallen und es keine Beispielbilder gibt wie bei den Spielen von Ubisoft. Vor allem die Deutschen, ja, kein Mensch kann sich was unter Blick, Feld, Umgebungsverdeckung was vorstellen. Nahegelegene Volumetrieauflösung. Wir reden hier von der Speerspitze der Spieleentwickler und die haben ja auch ein bisschen Vorbildfunktion. Krass Details, das versteht man wenigstens. Aber drei Punkte sind bei den Grafikoptionen besonders wichtig und hoffentlich für euch auch hilfreich. Erstens stellt das Spiel immer auf Vollbild und nicht auf rahmenloses Fenster. Im richtigen Vollbild lief das Spiel bei unseren Tests nämlich schlagartig besser. Zweitens probiert unbedingt mal beide angebotenen Grafik-Schnittstellen aus, also DirectX 12 und Vulcan. Denn während Vulcan durchaus für höhere durchschnittliche Bildraten sorgen kann, kommt es bei DirectX 12 zu weniger Frameraten-Einbrüchen, zumindest soweit wir das von unseren Hardware-Tests sagen können. Und auch hier gilt, jedes System ist anders, bei PCs gibt es keine immer gleich geltenden Leistungsangaben, nur Annäherungen. Ihr müsst also am Ende stets selbst testen und ein bisschen herumprobieren. Und drittens, den stärksten Einfluss auf die Performance haben Detaileinstellungen, die sich um die Schattendarstellung, Wasserqualität, die Reflektionen und die volumetrische Beleuchtung drehen. Schatten und Gedürntes mache ich eh immer ein bisschen runter, weil es macht auf den ersten Blick meistens keinen großen Unterschied und läuft halt meistens dann auch direkt viel besser. Weiterer wichtiger Punkt übrigens noch, installiert das rund 110 GB große Spiel unbedingt auf eine SSD-Festplatte. Wie groß ist es? Habe ich 10 oder 110? Übrigens noch, installiert das rund 110 GB große Spiel unbedingt auf eine SSD-Festplatte. 110? Alter, warum sind die Games heute alle so groß? Auf eine SSD-Festplatte, das verringert nicht nur die Ladezeit. Mal ganz davon abgesehen, mal ehrlich Leute, das Game hat 110 und Modern Warfare hat auch 110. Festplatten kostet nichts mehr, ja, aber so Games hat man am liebsten auf der SSD. Auch während des Spielens viele störende Ruggler und ladet euch natürlich die neuesten Grafikkartentreiber für eure Hardware herunter. Muss doch mal die neue SSD einbauen. Für einige Spieler war auch der Release von Red Dead Redemption 2 auf dem PC ein bisschen monsterhaft, denn wie schon erwähnt hatte Rockstar Probleme mit dem obligatorischen Rockstar Games Launcher, ein Zusatzprogramm, das ihr installieren müsst, egal wo ihr Red Dead 2 kauft, was ab Dezember dann übrigens auch Steam als Kaufmöglichkeit mit einschließt. Jetzt zum Release gibt es die PC-Version nur über den Epic Store oder halt direkt im Rockstar Games Launcher. Die meisten Bugs des Launchers scheinen aber schon mit ganz schnell nachgereichten Updates gehoben worden zu sein und soweit sich das Feedback im Netz überblicken lässt, ist Red Dead 2 auf dem PC kein zweites GTA 4. Wie bei meinen Gigarbeiten dafür geile Grafik, ich bezweifle, dass das was mit einer zu tun hat. Es gibt also keine flächendeckenden Hardware-Konfigurationen, auf denen das Spiel den Dienst verweigert, was man nicht leicht verboten kann. Ich kann den Scheiß ja auch komprimieren ein bisschen. Ich weiß noch, als die Parteiten voll damals 50 GB Audio installiert haben, weil sie kein Bock hatten ihr Audio zu komprimieren. Eine PC-Testversion vor der Veröffentlichung des Spiels herausgegeben, mit der man das Spiel nicht so einfach machen kann, wie bei den anderen Spielen, die man nicht so einfach machen kann. Aber das Spiel ist nicht so einfach wie bei den anderen Spielen, wobei ein finniger Spieler schon die Doppel-Grafikkarten-Lösung unter Walken mit einem älteren Nvidia-Triver zum Laufen gebracht hat. Allerdings kann es dann zu Grafikfehlern kommen und die Fremdratenausbeute ist auch eher bescheiden. Was es auch nicht offiziell gibt, ist Mod-Support. Es sieht so aus, als würde es bei Red Dead Redemption 2 auf eine ähnliche Situation wie bei GTA 5 hinauslaufen. Die Benutzung ist also auf eigene Gefahr, inklusive Banngefahr für Red Dead Online. Erste Mods gibt es übrigens schon. Aber kommen wir mal zur Steuerung. Mit dem Gamepad funktioniert die am PC natürlich genau. Warum bietet man Schnittstellen für Mods an, aber sagt dann, man darf die Mods nicht verwenden? Das verstehe ich nicht, das habe ich bei GTA auch nicht verstanden. Da muss man wahrscheinlich tiefer in der Materie sein, dass man diesen Big Brain Move kapiert. Wir bieten Schnittstellen an, lassen die Leute Mods machen, aber die Mods darf man nicht verwenden. Hä? Genauso wie auf der Konsole. Dank guter Zielunterstützung ist der schon aus den ersten Red Dead Redemption berühmte Headshot-Flip mit dem Gamepad genauso komfortabel wie das Quick Aim. Weiß ich nicht. Wie machen das die Leute denn dann? Hexen die da irgendwie Beine read das Game, oder wie? Red Dead Redemption wird Red Dead 2 aber erst mit Maus und Tastatur. Und hier hat sich Rockstar wirklich Mühe bei der Umsetzung gegeben. Die Steuerung ist zwar wie schon in der Konsolenversion grundsätzlich etwas überladen und nicht immer konsequent, beispielsweise wie hier, wo wir die Waffe mit einer anderen Taste einsammeln als den Hut, aber besonders die Kämpfe machen ohne automatische Zielhilfen dank voller Mauskontrolle sehr viel Spaß und fühlen sich längst nicht mehr so trinkend wie beim Gamepad an. Also das Spiel ist ja komplett NA-Aim, wenn man es mal so sieht. Verliert Red Dead 2 ein bisschen von seiner grundsätzlichen und für Rockstar-Spiele typischen Trägheit, wenn man es mit Maus und Tastatur spielt. Zudem sorgen viele Einstellungsmöglichkeiten dafür, dass man die Spielerfahrungen sehr nach den eigenen Wünschen und Vorstellungen anpassen kann. Und da sind das freie Neukonfigurieren von Tasten, Field-of-View-Einstellungen und eine Option für eine ruhigere First-Person-Kamera-Darstellung nur der Anfang. Ihr könnt beispielsweise auch festlegen, wie viel und ob ihr überhaupt Zielhilfen haben wollt. Das ist aber schön, dass es relativ viele Optionen gibt, das hat ja bei PC-Umsetzungen oftmals ein bisschen hinten anstehen, die machen dann so 3-4 Alibi-Optionen rein und das war's dann. So wirklich umfangreiche Optionen hast du ja selten, wenn die Spiele zuerst auf der Konsole rausgekommen sind. Glück gibt es auch kein nerviges Tastengehämmer beim Rennen oder Galoppieren. Hier wurden die verschiedenen Geschwindigkeitsoptionen so clever eingebaut, dass man am Ende manchmal nur noch eine Taste gedrückt hält. Auch der Waffenwechsel und das Ausrüstungsmenü funktionieren super mit Maus und Tastatur. Schneller Waffenwechsel läuft übers Mausrad und wenn man tapp gedrückt hält, bleibt das Ausrüstungsmenü geöffnet und man kann in Ruhe hin und her steigen. Ich werd's mir trotzdem nicht holen, wie gesagt, so Games ist einfach nix für mich. Nur ein Detail ist wirklich etwas nervig. Im Inventar muss man doch noch die Pfeiltasten drücken, um zwischen Items hin und her zu wechseln und ihre Beschreibung zu sehen. Wenn man nur mit der Maus draufklickt, wird das Item sofort benutzt, es gibt also keine Maus-Over-Funktion. Hoffentlich patched Rockstar das noch nach. So und jetzt bleiben nur noch die Fragen offen. Welche denn nun die beste Version von Red Dead 2 ist und ob es sich lohnt das Spiel nochmal auf dem PC zu spielen, wenn man die Konsolenfassung schon durch hat. Auch wenn das letztlich natürlich von vielen subjektiven Faktoren abhängt, so ist technisch gesehen die PC-Fassung aktuell die beste Fassung des Spiels, gute Hardware vorausgesetzt. Und wer gerne mit Maus und Tastatur spielt, kommt um diese Version sowieso nicht umher. Insgesamt ist das also trotz einiger Detailschwächen ein wirklich guter PC-Port. Wenn Red Dead 2 mit 60 FPS oder mehr flüssig läuft und man mit Maus und Tastatur flott und bequem steuern kann, wie ist die Main-Story, lohnt sich das? Angenommen man spielt das Spiel jetzt nicht, um großartig 3 Stunden durch die Open World zu reiten und macht nur die Main-Quest. Wohnt sich das dann? Nicht wirklich, oder? Erste Hälfte, okay. Doch, hier ist es sehr gestreckt. 30 FPS. Dazu kann ich nur sagen, wenn sich die Xbox One Leute für 30 FPS feiern. Da können wir mehr bieten. ...mal die PC-Fassung in 60 FPS erlebt hat. Das ist bei Red Dead ganz anders. Wenn man hier auf die Xbox One X zurückwechselt, sorgt die flüssige Bilddarstellung eher für Verwunderung und Respekt vor dem, was Rockstar da schon vor einem Jahr auf die Konsolen gebracht hat. Crossplay oder Cross-Safe zwischen PC, PS4 und Xbox One gibt es übrigens nicht. Ihr könnt also nicht euren Speicherstand von den Konsolen jetzt auf den PC rüber holen oder umgehen. Und genauso wenig könnt ihr Red Dead Online zusammen mit Konsolenspielern erleben. In Sachen inhaltlicher Qualität ist Red Dead 2 natürlich in jedem Fall eine Empfehlung, egal ob auf PC oder Konsole. Ich meine, das Wasser hier, das sieht wirklich cool aus, ja. Vor allem auch mit den Wellen, so wenn man da durchkommt, das ist wirklich cool. Schaut euch mal an, das zieht auch so ein bisschen Wellen hinterher, das ist wirklich hübsch gemacht. Kann man nix sagen. So, das war's zur PC-Version von Red Dead Redemption 2. Wenn ihr mehr über die Story, die Mechaniken und das allgemeine Spiel wissen wollt, schaut euch gerne noch unser klassisches Test-Video zur Konsolen-Version an, da sind alle diese Themen bereits enthalten. Warum? Warum hat diese Brücke, warum hat diese Brücke eine Überdach, also warum ist da ein Dach über der Brücke? Hat doch überhaupt keinen Sinn eigentlich, oder? Davor ist kein Dach, dahinter ist kein Dach, davor ist nichts, dahinter ist nichts. Warum hat die ein Dach? Da sind alle diese Themen bereits enthalten. das ist einfach nicht meins, ja, weiß ich nicht, das Spiel ist bestimmt geil, aber das ist nix für mich. Wie gesagt, das einzige Open-World-Game in letzter Zeit, was mir Spaß gemacht hat, war The Witcher 3. Habt ihr übrigens mal gesehen, wie kacke das Spiel auf der Switch aussieht, so richtig kacke sieht Witcher auf der Switch aus, sieht aus wie ein Gamecube-Spiel. So, jetzt gucken wir jetzt, Microsoft Office 3.0 auf Windows 10, oder wollen wir lieber eine Throwing-Knife-Nuke gucken, oder wollen wir uns Linux angucken von vor 20 Jahren? Ja, ja, Witcher 3 hab ich gespielt, Witcher 3 inklusive The Announcers, das war ein Open-World-Spiel, das hat mir gefallen, das war richtig gut. Aber gerade, weil die Witcher 3 Hauptstory einen so durch die Welt geführt hat, und man konnte natürlich ein bisschen erkunden, aber die Hauptstory war richtig gut und es hat gereicht, wenn man der Hauptstory folgt im Endeffekt. Ich mein, ich weiß eh schon, wie das läuft, der macht 5 Kills, der macht 7 Kills und dann ist Harrier Chopper Gunner am Start, easy. Was denn eigentlich deine Lieblings-YouTuber, kannst du ein paar empfehlen? Es ist immer schwierig es aus dem Kopf zu sagen, ich guck mal gerade auf meine Startseite, wer so empfohlen wird, wen hab ich denn hier so? Ich scroll grad mal durch, da müsst ich mir echt mal Gedanken machen, ich guck wenig irgendwie. Ich guck halt jede Menge Technik, Konferenz-Talks und sowas, aber da guck ich einfach sowas, was mir YouTube empfiehlt, beziehungsweise was so aktuelle Sachen gibt. Ich guck grad da durch, achso, doch, also ein, wo ich immer, ein den ich immer gucke, ist der hier. Den guck ich immer, egal, jedes Video, aber auch so der einzige, wo ich fast jedes Video gucke. Den guck ich immer, was hast du denn da oben für Browser-Plugins, was, wo, da, Duplog, so, so, geben wir halt, da. Achso, also immer wieder... Nach visuals. Selbstballs... Salut, Hégun kann dasivable sein. machen weil wir machen ja eh grad nix. Okay, Throwing Knife Nuke. Emotes. Ja. Emotes. Richtig egal. Ich mach nachher das... Ich mach da echt ein Gift raus. Oder Scheibenwischer so hin und her geht, sodass es geloopt ist. So, gucken wir uns das mal an. Wie gesagt Harrier Chopper Gunner Nuke. Easy. Wieso kein better Twitch TV? Weil FFZ mittlerweile besser ist. Why is this just my life? Can someone explain this to me? Alter, ist ja gut. Fick dich ab. Seit wann hat er denn Intro? Magst du die Videos von Alter viel? Ja, die guck ich auch gern. Hatte man da eins oder zwei? Eins, ne? Ein Messer. Aber mit Scavenger konnte man das auffüllen. Hab ich da gar nicht mehr dran erinnert, richtig? Oder Kitwechsel. Genau, da hat man es auch aufgefüllt bekommen. Harrier Chopper Gunner Instant Nuke. Easy. Hör mal ehrlich, die Nuke in MW2 war zu leicht. Er hat geschossen. Das ist keine Strong Knife Nuke. Was macht die ganzen NoobTube Leute noch in MW2? Das war damals schon dumm und jetzt ist es doppelt dumm zu NoobTube in MW2. Boosten die? Wir haben geboostet. 2018 2019 in MW2 wird geboostet. Alter, was mit den Leuten los? Warum? Erstmal alles Folge. Kennt ihr noch die Typen, die Search and Destroy gespielt haben und den letzten Kill über erst mal drei Stunden gestunt haben, dass sie Last Nice mit der Sniper machen konnten? Er hat selber gekillt. Der Gegner, Alter, ist der dumm. Oh, oh, oh, oh. Wo ist er? WTF? Oh, die Gegner sind so dämlich. Oh, oh, oh, oh, oh, oh. Weißt ihr, was das witzige ist? Es ist 2019 und wir gucken MW2-Videos anstatt MWV-Videos. Okay, schonmal die richtige Richtung und dann killt er sich nicht selbst. Ja, er hat es easy nuked, easy nuked. Das Schwierige in MW2 war ja im Prinzip nur den Harrier-Jopper-Gunner zu kriegen. Die Nukes an sich waren viel zu einfach. Du hattest ja jedes vierte Game oder jedes fünfte Game ein Nuke, wenn du dich wirklich angestrengt hast. Und auch die passenden Lobbies. Oh, jetzt freut er sich. Jetzt müssen wir mal gucken, ob er ein Messer hat. Nur, nur wenn er messert, nur wenn er messert, ist das Valet-Nuke. Jawoll, Valet zählt, akzeptiert. So, und jetzt gucken wir uns an Microsoft Office 3.0, wobei, das haben wir uns das letzte Mal doch schon angeguckt, oder? Linux von 2020, alles KDE. Wir gucken uns jetzt mal Office 3.0 und Windows 10 an. Das erste Ubuntu haben wir uns angeschaut. Stimmt, stimmt. Jibuntu. Einer Rappetler, drei Monate. Nein, schon. Gar kein Prime. Richtig echter, huge Star. Mein Q des Chats ist heute wieder sowas von weit vorne. Nice. Pock. Moment, wo ist eigentlich mein Immort dazu? Und der Grund, warum ich hier auf dieser Seite bin, ist, weil ich euch zeigen möchte, wo ihr circular Wenn wir den Compatibility-Mode erwerben können, werden wir das Windows 985 herunterladen. Ich glaube nicht, dass das funktioniert. Wir müssen eigentlich das NT-Mode herunterladen. Kennen Sie diesen uralt Werbespot für das erste Windows, wo diese Sekretärin dann anfängt zu singen? This is Windows 386. Das ist mega cringe. Damals waren eh alle IT-Werbespots mega cringe. Heute ist es umgedreht. Heute kriegst du auf Twitter immer Werbung. Von irgendwelchen Ölkonzernen und Energieanbietern, irgendwelchen Stromanbietern, die erzählen, dass sie quasi seit Jahrzehnten schon sich dem Umweltschutz verschrieben haben und der sauberste Anbieter ever sind und so viel forschen und so viel tun für den Umweltschutz. Wo ich mir so gedacht habe, das müsst ihr uns jetzt natürlich erzählen, weil ihr so geil seid. Ausgerechnet die. Das ist langweilig, da passiert nichts. Zeichnungsprogramm. Und da sind wir. Oh mein Gott, das funktioniert eigentlich. Microsoft Excel 3.0 von 27 Jahren vorhin hat gerade auf der aktuellsten und größten Version des Windows 10 geöffnet. Ich meine, das ist verrückt. Das ist verrückt. Ich meine, das fact, dass das Ding installiert ist ziemlich beeindruckend, aber das Ding läuft eigentlich. Und es sieht so aus, als würde es hier aufladen. Ich weiß nicht, ob wir uns hier komplett kraschen. Aber ich muss einen großen Schuss an die Autoren der OT-VDM geben, denn sie haben definitiv eine tolle Arbeit gemacht. Es ist tatsächlich Excel, ja. Soll ich euch mal was sagen? Ich habe noch irgendwo eine Office 97 CD. Da müsste man fast mal ausprobieren, ob der Kram noch funktioniert. Gut, nee, geht nicht, ich habe kein CD-Laufwerk mehr. PowerPoint. Das sieht wirklich aus, alles. Okay, zeig mal, ich will jetzt mal. Ja, Word. Das sieht eher aus wie DOS-Programm, aber es ist eindeutig Word, ja. Jetzt brauchen wir PowerPoint. Moment, warte. Das ist jetzt aber nicht mehr, das ist jetzt aber ein aktuelles. Sagt man, dass das so grau aussieht, liegt da neben seinen Zetix, oder? Ah, langweilig ist es mit, langweilig ist es. Dinos dauern zu lange. Schön, dass wir es uns angucken können. Overwatch doch noch nicht, Overwatch 2 doch noch nicht so gut. Okay, das müssen wir jetzt noch mal gucken. Da bin ich mal gespannt, was die Gamestar-Pros, Gamers sagen zu Overwatch 2. Overwatch 2 kriegt endlich den Story-Modus, den ich mir für den ersten Teil schon wünsche seit dem allerersten. Videos von dem kann ich mir meistens nicht angucken. Ich weiß nicht, ich kann nichts dagegen sagen, dass er nicht kompetent wäre oder so. Aber ich werde manchmal übelst getriggert von Leuten, die gewisse Aussprachen haben. Ich weiß nicht, ich komme damit nicht klar, wie er die Sachen ausspricht. Ich kann es nicht erklären. Denken von mir bestimmt auch genug, Leute. Ich kenne ihn ja nicht, ich habe ja da nichts gegen. Ein Enthüllungs-Trailer eigentlich. Und seither mit jeder weiteren fantastischen Renderssequenz. Das ist schließlich ein Blizzard-Spiel. Seit wann erzählen die keine Geschichten? Gut, manche mehr, manche weniger. Aber selbst Hearthstone hatte mehr Singleplayer-Abenteuer als Overwatch. Und Heroes of the Storm nutzt immerhin Figuren, deren Geschichten halt in anderen Blizzard-Spielen mehr als aus... Sag mal, warum sieht Mercy eigentlich immer jünger aus von Video zu Video? Die ist ja laut der Story irgendwie 50 oder so. Findet ihr, dass Mercy aussieht wie 50? Ich meine ernsthaft? ...Nutzt immerhin Figuren, deren Geschichten halt in anderen Blizzard-Spielen mehr als ausführlich erzählt wurden. Bis auf die Overwatch-Charaktere natürlich. Die bekamen zwar gelegentlich mal Archive-Events, in denen wir eine Koop-Mission aus ihrer Hintergrundgeschichte gespielt haben. Aber das war immer nur ein Level. Und die Story wurde nie nach vorne weitergeführt. Höchste Zeit also. Zumal Overwatch mit einem Story-Modus eigentlich das perfekte Shooter-Paket sein könnte. Es ist bereits ein spielmechanisch exzellentes... Aber Brigitte ist eh bestes Overwatch-Grill. Der Ego-Shooter mit fantastischem Design und einem herausragenden Multiplayer. Dazu noch eine Story in klassischer Blizzard-Qualität. Und was will man mehr? Aber für Overwatch 2 hängt noch etwas mehr an seinem Story-Modus. Der muss nämlich beweisen, dass es sich hier überhaupt um eine vollwertige Fortsetzung, ein echtes Overwatch 2 handelt. Nee, ist es nicht. Das haben wir doch schon. Ich weiß genau, Papa Louis, ich glaube das ist auch das, was mir nicht gefällt. Er betont das so komisch. Aber ist Geschmackssache. Das ist kein Overwatch 2 echt. Das haben wir doch schon in demdings bei dem... Wie hieß das? In der Opening-Ceremony gesehen. Ich hab auch gesagt, das ist quasi Overwatch Season 2. Bloß sie wollen es nicht Season 2 nennen, weil dann die Leute wieder ankommen und so... Ah, Blizzard 0 kopiert Fortnite 0 hier, scheiß... Ihr kennt ja die Leute. Das wurde nach der Ankündigung hitzig diskutiert. Oder genauer gesagt schon davor, als das Spiel geleakt wurde. Es sieht schließlich fast identisch wie der erste Teil aus und spielt sich auch sehr ähnlich. So ähnlich sogar, dass Besitzer des original Overwatch direkt zusammen mit Besitzern des zweiten Teils spielen können. Sie kriegen außerdem alle neuen Multiplayer-Inhalte wie den Push-Modus. Was ja erst mal nur lobenswert ist. Aber dann stellt sich doch wirklich die Frage, warum dann überhaupt einen völlig neuen Teil draus machen und keine Erweiterung? Weil es eine Erweiterung ist. Die wollen bloß keine Erweiterung mehr verkaufen, weil sie wahrscheinlich denken... Die Antwort hängt... Verkaufen... Wahrscheinlich denken sie sich, Erweiterungen verkaufen sich nicht so gut. Das ist Season 2 im Endeffekt. Am Story-Modus. Dem großen Flaggschiff-Inhalt von Overwatch 2 und dem wichtigsten Feature, das Besitzer des Originals nicht bekommen. Der muss also richtig knallen. Um rauszufinden, ob er das auch tut, habe ich auf der BlizzCon eine Mission daraus selbst gespielt. Durfte nur nicht aufnehmen, deswegen stammt das hier gezeigte Gameplay aus anderen Quellen. In den Story-Missionen treten vier Helden im Korb an. Welche das sind, gibt die Geschichte vor. In Rio de Janeiro stehen Lucio, Mei, Reinhardt und Tracer zur Wahl. Die spielen sich grundlegend wie im Multiplayer, aber mit zwei Unterschieden. Einerseits haben die Entwickler ein wenig am Balancing geschraubt. Manche für den MP nötigen Einschränkungen braucht es beim gemeinsamen Ballern eben nicht mehr. Tracer zum Beispiel hat etwas mehr Kugeln im Magazin. Andererseits passen wir unsere Figuren selbst mit Talenten an. Ich hab so gehofft, dass das für den Multiplayer kommt. Ich hoffe echt, und ich weiß nicht, ob das schon bestätigt ist oder debunkt quasi, keine Ahnung. Das wäre wichtig für das Game, dass sowas im Multiplayer kommt. Ich mein, klar ist das dann Balancing-mäßig noch schwieriger. Aber ich mein, als hätte das Overwatch irgendwie jemals mit Balancing gehabt. Aktuell ist es in Overwatch halt so, du hast, keine Ahnung, 30 Helden. Davon werden acht gespielt, also sagen wir mal, werden zehn gespielt. Davon fünf quasi oft und manche so gut wie gar nicht. Und es ist halt, also entweder braucht Overwatch auch viel, viel mehr Helden, dass da ein bisschen Variation reinkommt. Und das hier könnte halt dazu führen, dass man die Helden anders spielen kann auf anderen Positionen, als sie eigentlich gedacht sind. Wisst ihr, wisst ihr, wie ich meine? Ich mein, das passt ja immer noch alles zu Tracer irgendwie, das ist jetzt halt nichts anderes. Aber dann kann man, das bringt einfach so viele neue Kombinationen und Variationen rein. Und das ist das, was in Overwatch fehlt. Overwatch ist viel zu fest im Endeffekt. Das ist ja auch das, was irgendwie so ein bisschen, wenn man jetzt mal zu irgendwelchen MOBAs guckt und so, wo du auch Talente hast oder wo du auch verschiedene Item, Level, Geschichten, Skillbäume oder irgendwas hast. Das muss einfach ein bisschen, da muss mehr Variation und mehr Ideen rein irgendwie. Und so, dass man beispielsweise Lucio dann vielleicht auch mal als DPS spielen kann mit den passenden Talenten, der aber halt vielleicht dann nicht so gut ist wie Tracer, aber irgendwas anderes kann, was dann in Kombination wieder super zusammenpasst. Oder ihr überlegt euch mal rein, hat der Hammer werfen kann, irgendwas. Du könntest viel schönere Variationen machen. Und man wird sich nicht davor retten können, dass es irgendwie eins, zwei, höchstens drei Kombis gibt, die OP sind. Das hast du in jedem Game. In jedem Game hast du irgendwie so einen Meta. Also quasi Most Effective Tactics Available, wofür meiner Ansicht nach übrigens Meta steht. Also das, was einfach am besten funktioniert. Das hast du in jedem Game irgendwie. Aber dadurch könntest du irgendwie noch ein bisschen Variation reinbringen. Das war ja in StarCraft 1 zum Beispiel auch so. Lange Zeit galt irgendwie... Was hat er da beispielsweise? Ich überleg gerade, wie war das in StarCraft? Genau, in StarCraft 1 war Zerg zum Beispiel auf Home Level übelst scheiße eine ganze Weile. Also Input war eine ganze Weile, bis dann irgendwann mal einer angefangen hat und hat irgendwie neue Lurker Strategies entwickelt damals. Und ohne Patches waren die auf einmal übelst OP. Und ein bisschen Variation dadurch ist sicherlich nicht verkehrt. Ich glaube, das wäre echt gut für das Game, wenn sowas im Multiplayer kommt. Die Demo zeigte drei Wahlmöglichkeiten zwischen jeweils zwei Fähigkeiten. Einmal auf Level 1, einmal auf Level 10 und einmal auf Level 20. Damit wirkt Tracer zum Beispiel Feinden Schaden rein, wenn sie durch sie durch teleportiert oder löst mit ihrer Pulsbombe eine Kettenreaktion aus. Diese Talente sind durchaus eine schöne Idee, um die Kampagnenmissionen stärker vom Multiplayer-Gameplay abzusetzen und sie so aufzulockern. Aber nicht alle wirken sich jetzt riesig auf die Spielweise des Helden aus. Und nur 6 Stück scheinen mir auch etwas mager. Ich glaube nicht unbedingt, dass sie gewaltigen Wiederspielwert oder Langzeitmotivation schaffen werden. Also da muss schon mehr rein. Und generell, das ist ja auch so eines der größten Probleme, woran Overwatch krankt. Die haben einfach zu wenig Content. Ich meine, mittlerweile geht es. Mittlerweile geht es, ja. Mittlerweile hat man eine ordentliche Anzahl an Maps. Aber davon ist gefühlt die Hälfte 2CP, die jeder Scheiße findet. Inklusive den Pros, die alle am kotzen sind, wenn es bis auf ein paar, die 2CP spielen müssen. Und von den restlichen Maps gibt es auch nur eine Hand voll richtig gute, ja. Zum Beispiel finde ich Kingsrow ist immer noch eines der schönsten Maps, obwohl er von Anfang an drin war. Aber sowas wie Paris oder Dings oder wie heißt das? Oder Rialto oder so. Ey Alter, was ist das für Maps? Coolen Helden-Builds müsste es da einfach noch mehr geben. Wir leveln übrigens nicht während eines Einsatzes auf, sondern verbessern unsere Helden durch sogenannte Helden-Missionen. Das ist ein zweiter Typ an Koop-Mission, den Blizzard noch nicht näher vorgestellt hat. Hier sollen wir anders als in den Story-Einsätzen immer unseren Lieblingshelden spielen können und die Ziele sollen variieren, damit man die Missionen immer wieder angehen kann. Ob das auch so funktioniert, bleibt aber noch abzuwarten. Sicher ist nur schon, dass die so verdienten Talente nur für den PvE gelten. Im Multiplayer würden sie die Balance zerschießen, weil höherstufige Spieler handfeste Vorteile hätten. Auch wenn es ein wenig schade um die Anpassungsmöglichkeit... In Overwatch ist das alles so langsam. Die brauchen ein dreiviertel Jahr oder ein halbes Jahr oder lassen wir ein drittel Jahr für, um irgendwas zu patchen. Dann gibt es eine neue Map mal im halben Jahr. Da muss ein bisschen mehr Dynamik rein in das Ganze. Guckt euch das mal an, wie das zum Beispiel... Hearth of Exile ist jetzt ein doofes Beispiel mit Overwatch zu vergleichen. Aber es gibt ja genug Anbieter, die, ich weiß nicht, wie sie das bei Dota und LoL machen, die können quasi im Wochentakt oder theoretisch im Tagestakt irgendwas patchen. Aber jetzt zurück zu den Story-Missionen. Die Stadt wird von Robotern der Omnic-Extremistengruppe Null Sector angegriffen, die Overwatch-Veteranen unter anderem aus dem Uprising-Event kennen. Lucio tut sich mit der neu reformierten Overwatch zusammen, um die Invasoren aus seiner Heimatstadt zu vertreiben. Spielerisch fällt die Missionen recht. Ich meine, man muss ja auch mal sagen, das ist halt Co-op PvM im Endeffekt. Das ist keine wirkliche Singleplayer-Story in dem Sinn. Das ist im Prinzip Co-op PvM. Ich finde, das hat mit einer strukturierten Story oder Geschichte nichts zu tun, was wir da gerade sehen. Das ist Co-op PvM mit Ranglisten. Wir ballern uns geradewegs durch enge Straßen, die sich regelmäßig zu etwas größeren Arenen auftun. Haben wir dort alle Feinde erledigt, geht's weiter. Versagte Feinde fahren ein paar recht unterschiedliche Kampfmaschinen auf. Von gewöhnlichen Fußtruppen, über nervige kleine Flieger bis zu besonders schweren Max, die wir am besten gemeinsam behaken. Auch optisch bietet das Level durchaus Abwechslung. Mitten in der Mission besteigen wir einen Jet, um das gegnerische Fabrikschiff zu entern und kämpfen fortan in dessen Hangars. Das Missionsziel ist recht simpel. Wir müssen uns einfach zum Ende kämpfen. Dort erwartet uns dann noch ein Showdown, bei dem wir einen Energiekern vernichten müssen, während mehrere Wellen an Gegnern uns aufzuhalten versuchen. Das ist eher so eine, das ist Co-OP4M mit Rangliste im Endeffekt, ja. Das kann natürlich auch sein, aber ich glaube nicht, dass es eine wirkliche Kampagne im eigentlichen Sinn ist, wo du halt so, wo du eine Story hast, wo du mitfiebern kannst, sowas ist es eher nicht. Ich glaube, ich glaube auch eh, dass Blizzard eigentlich überhaupt keine Story für Overwatch hat. Die haben ja nur so ein bisschen Rahmengerüst drum herum. Und es gibt beispielsweise, glaube ich zumindest, ich bin jetzt ja nicht so der ultra Overwatch-Lore-Kennner, ja, es gibt für, es gibt keine sinnvolle Erklärung, warum quasi auf einmal Tracer und Widowmaker zusammenarbeiten sollten, ja. Also man hat die Story im Endeffekt so aufgebaut, dass es quasi gute und böse, wenn was mal, Helden gibt. Aber warum spielen die zusammen? Das ergibt überhaupt keinen Sinn in der Lore. Das alles macht durchaus Spaß, denn Overwatch ist ja einfach ein richtig guter Shooter. Sein flüssiges Gameplay und seine erstklassig designten Helden punkten auch im Story-Modus. Allerdings nicht so sehr wie im Multiplayer. Gegen die tumpen Roboter müssen wir längst nicht so clever spielen wie gegen menschliche Feinde, aber eine Heldin wie Tracer glänzt erst so richtig, wenn wir im rasanten Tanz einen denkenden Feind austricksen. Genau dafür wurde sie ja konzipiert. Das Koop-Missions-Design dagegen wirkt nur... gut, keineswegs schlecht, aber auch nicht herausragend. Es fuhr weder in Sachen Map und Ziele, noch bei den Feinden irgendwie... Maps ist eh, Maps ist eh das eines der größten Probleme von Overwatch, finde ich. Die Maps sind alle so... Es gibt, ohne Finesse irgendwie, ja. Du hast bei den Maps meistens einen Weg, der... Also wenn es hoch kommt, mal einen Weg ohne Flank-Route oder so. Du hast eigentlich einen Weg und jeder Weg in Overwatch ist voll mit Choke-Points. Das ist einfach für einen Arsch die Maps. Also im Prinzip ist es, jede Map in Overwatch ist ein Main-Weg, also eine Hauptroute, komplett voller Choke-Points, wo du durch musst, weil du keine andere Chance hast. Und eventuell mal eine Flank-Route, ja. Das war's dann aber auch. Es gibt einfach deutlich bessere Koop-Shooter, zum Beispiel Borderlands 3 mit seinen deutlich umfangreicheren Talentbäumen. Das ist jetzt vielleicht ein unfaire Vergleich, weil Borderlands 3 dafür keinen kompetitiven Multiplayer hat, aber wie gesagt ist der PvE ja der Grund, warum Overwatch 2 als vollwertiges Sequel angekündigt wird. Und diese Last scheint er mir noch nicht zurecht tragen zu können. Er könnte auch einfach ein DLC-Paket sein und wirkt in seinem Bereich nicht so herausragend, wie es der Multiplayer-Part des Spiels ist. Oder anders gesagt, Overwatch ist einer der besten kompetitiven Shooter, aber Overwatch 2 müsste noch einiges verbessern, um auch einer der besten Koop-Shooter zu werden. Aber in seiner Kerndisziplin kriegt Overwatch dafür eine richtig starke Neuerung. Der neue Push-Modus wirkt richtig vielversprechend und war ebenfalls auf der Messe spielbar. Er ist im Grunde ein Tauziehen. In der Kartenmitte wartet ein Roboter, den beide Teams zur gegnerischen Basis drücken müssen. Die neue Map Toronto bot dabei zahlreiche Möglichkeiten für Flankenangriffe, um den Gegnern in den Rücken zu fallen und sorgte damit für richtig schön wendungsreiche Matches. Auch wenn auch hier gilt, im Kern ist das eben mehr Overwatch. Sehr gutes Overwatch, aber man kann leicht vergessen, dass man hier eigentlich einen zweiten Teil spielt. Selbst so manches jährliche Assassin's Creed oder Call of Duty brachte tiefergehende Veränderungen. Nicht, dass sich gar nichts getan hätte. Die neuen Maps sehen klasse aus. Deswegen habe ich eigentlich auch damit gerechnet, dass Overwatch free to play wird. Zumindest so die Basisvariante irgendwie. Free to play und das, dass es da halt noch verschiedene Varianten gibt, wie sie Geld machen können. Die Helden kriegen allesamt ein neues Design. Reinhardt kämpft jetzt zum Beispiel ohne Helm. Genji hat neue Klamotten. Und Lucio, äh, leuchtende Redlocks? Besitzer des ersten Teils können aber auch all ihre alten Skins und Kosmetics übernehmen. Umgekehrt kommen die neuen Helden wie Sojourn zusammen mit den Maps und Modi auch ins Original. Also alles, was PvP und Balance relevant ist. Was wie gesagt eigentlich eine vorbildliche Politik ist. Sie lässt nur Overwatch 2 als Sequel zurück, dem noch eine richtige Daseinsberechtigung zielt. Ja, das stimmt. Genau das sehe ich auch so. Dass endlich die Geschichte weiter erzählt wird, ist ja eigentlich klasse. Und die bisherigen Zwischensequenzen und Render-Trailer waren auch klar die größte Stärke der gezeigten Mission. Die Welt und die Figuren von Overwatch sind einfach cool. Und ich habe richtig Lust drauf, in diesem Kosmos mal eine schön inszenierte Actionfilm-Story zu erleben. Aber spielerisch hat mir bei der Gezeitenbasis, weil du kannst mit Overwatch 1 und Overwatch 2, ist Crossplay quasi. Die gesamten Missionen noch das gewisse Etwas gefiel, das hier zu etwas wirklich Besonderem macht. Vor allem, wenn der Koop-Part den riesigen Wiederspielwert schaffen will, den Blizzard verspricht. Ich hatte nicht das Gefühl, dass ich diesen Einsatz noch mehrfach mit Spannung wiederholen könnte. Im Gegenteil, er wirkte sogar deutlich schneller abgenutzt als eine Runde Borderlands oder Left 4 Dead. Allerdings haben wir auch noch nicht das komplette Puzzle. Den größten Wiederspielwert sollen die Heldenmissionen bieten und die gab es noch gar nicht zu sehen. Außerdem hat Overwatch 2 noch nicht mal einen Release-Termin. Also wer weiß, was Blizzard noch ändert. Lange wird es nicht mehr dauern. Ich meine, überlegt euch mal, ihr müsst mal, oder guckt mal auf YouTube, äh nicht auf YouTube, auf Twitch. Da sitzen die Leute, die sitzen teilweise 35-40 Minuten in der Queue. Das Spiel braucht dringend neue Multiplayer, das braucht dringend neue Spieler. Aber eins kann ich zumindest schon mal sagen. Wenn Overwatch 2 ein Vollpreisspiel werden sollte, und davon gehe ich ehrlich gesagt aus, das scheint aus unternehmerischer Sicht ja der beste Grund zu sein, es als Sequel statt als Addon zu verkaufen, dann muss Blizzard zu dem bislang gezeigten auf jeden Fall noch eine ordentliche Schippe drauflegen. Kann ich ihm noch Recht geben? Es ist so. Es ist so. Ja, würde ich so unterschreiben. Würde ich echt so unterschreiben. Eigentlich müssten die echt so viel tiefgreifende Änderungen durchführen. Overwatch ist einfach ätzend zu spielen mittlerweile, Multiplayer. Und man kann das nicht alles auf Toxic Community schieben, das Game, das die Leute auch irgendwo da beeinflusst. Nehradon, vier Monate, Prime, ne nicht Prime, richtig, richtig, ohne Prime. Subscriber, Subscriber. Was war denn das? Aug? Ne, oder? Also sie haben als letztes geändert, dass man jetzt als Alternative zu M4 und AK47, dass man jetzt ja auch diese anderen zwei Gewehre spielen kann. Das ist ja schon ein Krieg. Was, Krieg? Okay, ich war... War das nicht irgendwas anderes? Naja, egal. Wobei ich immer noch sagen muss, CS ist für mich eSport technisch das schönste Game zum Angucken. Ich meine, ich spiele zwar kein CS, oder nicht mehr, aber ich guck mir das einfach gerne an. Und das Schöne an CS ist, dass du wirklich laufend irgendwelche Turniere hast, wo halt auch die Guten mitspielen. Ja, ich will nicht wissen, was Fnatic oder Astralis oder was die für ein Pensum haben. Die sind ja quasi heute im 250.000 Euro Turnier und morgen im 250.000 Euro Turnier und übermorgen im 250.000 Euro Turnier. Die spielen echt bam, bam, bam, pausenlos, ja. Und deswegen ist für mich als Zuschauer CS eigentlich das Schönste. Heute LOL World Finals. Oh nee, LOL ist nicht meins. Was macht denn der Auer wieder? Das ist irgendwas, irgendwas, äh, was da gekühlt ist, oder? Wobei, das haben wir schon geguckt, das Zeug von Wish, was Skamars ist. Habt ihr jetzt eigentlich mitgekriegt, dass Riot irgendwie sechs neue Games vorgestellt hat? Irgendwie so ein Overwatch CS abklatscht, ein Kartenspiel, äh, ich hab schon wieder vergessen, was noch, alles. Was? Hä, was? It's... Installing Windows M.E.O.N. XP on Z-Bot 10. Wow, funktioniert, funktioniert wahrscheinlich. Mittlerweile kannst du, Nested Virtualization funktioniert mittlerweile ganz gut. That's every programming tutorial. Das ist fake, oder? Ach nee. Das ist, das ist, das ist ein Fake Tutorial. Ja. Das Kartenspiel, ja. Äh, was haben die noch alles vorgestellt? Fighting Game. Genau, einen Film haben sie vorgestellt, einen Film hatten sie noch. Was haben die noch alles vorgestellt? Irgendwie sechs verschiedene Sachen, total abgedreht, weiß gar nicht, was mit denen los ist, äh. Upgrading von Windows, ETF, was? Hello everybody and welcome back. F***, der Upgraded echt. Ih, das ist Vista! Nee. Wo ist es? War doch eben Vista. Hab ich eben gerade Vista gesehen? Vista? Das ist Vista! Ih! Das ist Vista! Geh fort! Das ist Windows Vista, tatsächlich. Igitt. Das Windows, was nie jemand verwendet hat. Sag mal, der macht nur so olles Zeug, oder? Windows Explorer 1 und Windows 10. Alles 20 Jahre, alles links, Floppy Drive, VMVMVM. Guck mal, da ist auch so ein Video. Die jetzt ja nicht mal Alplali heißt, sondern aus irgendwelchen Kunden Vic, warum auch immer. Ich hab das Gefühl, dass mit Sata nicht Sata gemeint ist. Nicht die Festplatten, also nicht der Plattenschluss auf dem Mainboard. Irgendwie gibt es gerade nichts, was ich noch ko... Ich Shopping. Shop auf der Wii. Der hatte die Wii in Browser? Und das, was die Switch bis heute nicht geschafft hat? Irgendwie gibt es nichts zu gucken. Hast du schon einen alten PC auf Ebay gekauft, Andi? Fuck, ist abgelaufen. Für 10 Euro, das hätte ich mal kaufen sollen, das Ding. Hätte ich ein Video mit altem PC machen können. Retro PC Rechner. Ach so, der Rechner ist leider nicht funktionsfähig, ist ein Pin abgebrochen. Ding, Ikuro, weiter geht's. Vier Monate, huge. Der war eh kaputt, der Rechner. Alter PC. Alter Medium. Warum wollen die alle so viel Geld für alte Rechner? Ich glaub's net. 155 Euro, was ist mit denen los? Leute. Wisst ihr übrigens, was ein iPhone 1 kostet? Wenn's da ab und zu mal welche gibt. Die sind ultra teuer. Ne, aber hier. Apple iPhone First Generation. Das geht never für den Preis weg. Das ist viel zu günstig. Die Dinger sind normalerweise übertrieben teuer. Die iPhone 1 Dinger. Ja, so eher sowas hier. Für sowas alles. Ja gut, 12.000 ist jetzt vielleicht ein bisschen beknackt, ja. Deutsche E-Bayer verstehen E-Bayer nicht. Da ist was dran, du hast recht. Wenn wir jetzt mal beispielsweise hier gucken, da kriegst du die alten PC Sachen für ein Apple und ein Ei. Naja. Moment, das ist aber auch, das sucht immer noch in DE. Das sucht immer noch in Europa. Muss ich das jetzt über ein Proxy machen oder was? Ja, was auch immer. Hat jemand eigentlich schon mal meinen Memory Leak angeguckt und weiß woran's liegt? Hat der eigentlich ein neues Video? Hab ich schon alle geguckt. Pause den Paste Bin noch mal hier. Ich kenn's hier irgendwann aus. Warum ich so einen Memory Leak hab? Einfach nur starten und warten. Weißt schon. Oh ja, da müssen wir mal gucken. Ende 2018 müssten ja dann auch ein paar Deutsche aufploppen. Wusste ich gar nicht, dass der mal auf Twitch so aktiv war. Riot Games, Alter! Hab ich nie geguckt. Ganz ehrlich, ich gucke hier gar keinen von. Gar keinen, nicht einen. Ach, das sind Follower. Ach, Moment. Jaja, ich hab grad grad so viele Subs, könnte sie nie im Leben sein. Das sind Follower, okay. Wir müssen auch gleich mal die meisten Subs gucken. Syndicate ist der Zombie-Typ. Ah, gewesen, ja. Ich glaub, der macht jetzt anderes. War Syndicate nicht der, der mit der Skin-Seite gescampt hat? Oder verwechsel ich das jetzt nicht? Ich glaub, das verwechsel ich. Ich glaub, es war jemand anderes. Ich gucke da von keinem. Ich gucke da von keinem. Ich weiß nicht mehr, wer was ist. Ich weiß nicht mehr, wer was ist. Ich weiß nicht mehr, wer was ist. Wo ist Shroud und sowas? Das ist noch zu früh, ne? Noch zu früh für Shroud. Wir können das am 1,5 Prozent, ja, wir können das wirklich ein bisschen schneller machen. Wartet mal. Boah, viel besser. Also so wirklich viel tun tut sich jetzt ja da grad nicht, ne? Man könnte da eigentlich fast sagen, wir machen es mal auf 2. Das passt, die Musik passt erstaunlich gut zusammen, oder? Die Musik hört sich auf zweifach fast besser an. Jetzt kommt, ok, jetzt kommt CS. Ich gucke da von immer noch nichts. Ich muss ja sagen, die Musik hört sich auf zweifach viel besser an als auf einfach. Aber Riot Games geht schon gut ab, ne? Und 2016 war ja auch so das CSGO Halbjahr. Jetzt geht Summit nochmal ab. Außerdem mag jeder Balken, die hochgehen. Die Musik. Ok, Riot Games hat wieder aufgeholt. Jetzt kommt, jetzt hier, hier, jetzt jetzt Fortnite und Popke. Pass auf. Fortnite und Popke. Und ein bisschen CS. Jetzt kommt Ninja und gleich ist er wieder weg Gleich ist er wieder weg also je nachdem wie lange das geht Der streamt jetzt auf YouTube macht immer noch Gampel scheiß mehr Alter Ninja ging schon gut ab Den einzigen davon den ich mir ab und zu geben kann ist Doktor Disrespect, aber auch nicht lang So gleich ist okay das dauert noch ein paar Monate dann ist Ninja wieder weg Wobei er viele Follower hat er wahrscheinlich immer noch und Shroud ist auch demnächst ist er ja auch auf Mixer habe ich ja ganz vergessen So jetzt müsste Ninja langsam wieder runter gehen Ja jetzt ist er ja rüber zu Dings hier Oh nee ist jetzt fertig fuck ich dachte es geht noch ein paar Monate weiter Gucken wir mal warte mal Switch Ninja wie viele Follower hat er jetzt aktuell Followers 14669 okay das geht nur langsam runter ich würde ja mal interessieren wieviel Viewer im Vergleich zu Shroud und Ninja haben im Vergleich zu Twitch auf Mixer Komm wir lassen es wieder auf zweifach stehen wobei bei Webseiten machen wir machen mal ein bisschen ein bisschen langsamer dass ich was zu sagen kann okay also was haben wir hier AOL das war halt damals voll angesagt AOL, Yahoo, Yahoo hat so verkackt wusstet ihr dass Yahoo zweimal hätte Google kaufen können und sie haben es jedes mal verkackt voll die Boomerseiten aber richtig naja was ist das hier für eine Zeit es ist die Boomerseite die Boomer da hat da waren die Zoomer noch im Bauch wenn überhaupt MSN ja gut ich habe damals immer MSN Call by Call verwendet Geocities wo ist denn MySpace gab es das überhaupt schon MySpace äh egal gucken wir mal AOL ja 2000 ist Monka Shake aber hier da ist es da sind sie jetzt geht's los Amazon war relativ früh schon am Start als reiner Bücherversand damals zumindest in Deutschland Ich habe ehrlich gesagt keine Ahnung was AM Greetings überhaupt ist Infos die Alta Vista war eine Suchmaschine so Pre-Google Suchmaschine Lycos war auch eine Suchmaschine damals Fireball gab es in Deutschland noch der Chat ist über dem Datum easy chat easy live kein Problem Amazon geht ab real player kennt den Scheiß überhaupt noch jemand der real player das habe ich schon wieder sie sind diese Crap Software habe ich überhaupt schon verdrängt wieder das hat man damals gebraucht um manche Sachen abspielen zu können der real player so kack gibt es das überhaupt noch real player nicht real players nicht real real gibt es tatsächlich noch 95 stable release 2019 übrigens Yahoo! wird gleich noch übelst abgehen sage ich euch Yahoo! geht gleich mega ab Yahoo! war in zwischenzeitlich die beliebteste Seite ever ne? about.com kenne ich auch nicht ok amazon und ebay die werden natürlich noch viel mehr abgehen das gibt es halt immer noch habe ich gelesen aber nie Excite war auch glaube ich eine Suchmaschine oder E-Mail anbieter oder sowas Lycos Suchmaschine jetzt achtung leute 2000 2000 Monka Shake Yahoo! geht ja ab google hier hätten sie die chance gehabt google zu kaufen wollten sie nicht oder noch ein bisschen davor die hatten zweimal die chance google zu kommen haben sie nicht gemacht übrigens leute zu dieser zeit war das normal dass da noch keine porn seiten drin waren weil die leute hatten die bandbreite nicht online porn zu gucken die leute haben damals porn haben die sich hauptsächlich bilder angeguckt weil die sind halt so schlecht war oder absolut schlecht aufgelöste videos deswegen waren die ganzen porn seiten damals noch nicht so beliebt warten mal ab warten mal ab bis die leute mehr bandbreite kriegen dann werdet ihr sehen oder gehe ich mal von aus dass dann auch hier so so so pornhub und so mit am start sein wird warum liegt hier stroh alarm also amazon google geht definitiv gleich noch viel viel weiter hoch jahu steigt immer noch gut aber langsam aber sicher irgendwann hier ein paar jahre später hatte ja jahu noch mal die möglichkeit es war ja so dass wenn ich das richtig in der ende ich habe damals drüber gelesen dass die die google gründer dass sie damals zu jahu gegangen sind und ich glaube ich für eine million oder so ihre suchtechnologie an jahu verkaufen wollten und jahu hat gesagt nee wollen wir nicht und da haben sie dann halt irgendwann gesagt haben halt google und irgendwie fünf sechs jahre später hatten sie für irgendwie keine anderen 150 millionen oder so wieder die chance google zu kaufen aber sie wollten wieder nicht und das hat jahu halt voll verkackt wetter.com die schlimmste kacke seit für wetter also komplett folgespämmt mit wer ach nee wetter.com nicht wetter.com ok dann habe ich nichts wikipedia die einzig richtig gute seite hier in der ganzen auflistung der ganzen auflistung jetzt google google geht ab jahu geht runter wenn jahu hat doch immer mal weniger gehung myspace myspace dass die haben es auch verschissen myspace so jetzt wird erstmal google jahu abhängen weil sie es richtig verschissen haben jetzt kommt youtube dabei irgendwann kommt man auf facebook demnächst mal was jetzt hier google gibt alles hol war internetanbieter myspace jandex jandex ist doch ein russisches socialding oder facebook jetzt facebook jetzt sind die zeiten von myspace gezählt moment jahu holt auf warum holt wtf warum jahu holt auf das war mir damals überhaupt nicht bewusst dass es überhaupt mal eine zeit gab wo jahu wieder aufgeholt hat sind das die seite ich habe keine ahnung meint was das war echt so dass 2010 jahu wieder vor google war eigentlich weil es standard suche ja standard suche keine ich habe nie ich habe nie jahu richtig verwendet jetzt jetzt geht google ab ich glaube jetzt haben die auch jetzt jetzt haben die ja auch ihren ganzen kram google mail also google mail google news google google geschiss gestartet und das ging natürlich noch mehr ab beidu das ist hier die chinesische google variante jetzt müssten demnächst auch die ein oder anderen pornseiten bald mal auftauchen live.com hör mal auf aber auch nur weil startseite war bei windows 10 oder so vk vk ist ist russisches social network dritter jawoll endlich mal noch eine zweite gute seite neben wikipedia jetzt jetzt müssten so langsam aber sicher die pornseiten mal rein hier kommen in die statistik weil ansonsten sind die haben sie rausgelassen weil jetzt haben die leute genug bandbreite um sich den kram anzugucken facebook youtube google instagram auch gerade habe ich schon ganz verdrängt grab gibt es ja auch noch twitter youtube instagram facebook amazon ich glaube die haben die pornseiten rausgelassen weil jetzt müssten die definitiv langsam aber sicher mal dabei sein guck mal wie google abgeht er jetzt erst 2017 erst wonach geht das ich habe ehrlich gesagt keine ahnung traffic measured by monthly wizards ok das heißt im endeffekt seiten die viel viel halt hatten haben mehr gezählt sicher dass das porno populärer ist als amazon ja eigentlich schon oder zumindest irgendwelche seiten guck mal aber jetzt hier anfang 2017 da da ist auch hier ist doch das ist ja mal ganz schön spät oder aber man sieht mal es ist alles nichts im vergleich zwischen google und facebook ich habe jetzt gar nicht darauf geachtet facebook ist die letzten jahre rüber runtergegangen bestimmt ja weil weil es eigentlich ist es ist ja bloß cool neun leute sind ja auf instagram oder snapchat google plus hat insta ist facebook was hat facebook gekauft aber google geht halt gut ab aber schon krass oder da sieht man mal ich hätte jetzt ehrlich gesagt damit gerechnet dass hier die die die pornseiten dass sie noch eine ganze ganze ecke weiter vorne sind ja weil es geht ja um traffic und pornseiten machen halt massig traffic guck mal messenger entwicklung gibt es das oh cool jetzt gucken wir doch noch mal an geht nur vier minuten icq aol messenger 98 ja damals hatte ich also jahu messenger hatte ich nie aol messenger habe ich schon mal einen account gemacht fand ich aber doof icq beste hau hau genau icq sound ja icq sause hallo hallo genau was ist denn was den was für den remix lightchain danke schön sup bigbrain bigprime ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix ICQ Remix", "segments": [{"id": 1, "start": 90.0, "end": 102.44, "text": "Moin Leute, seh schon, die ersten hier in der Abobox gecampt."}, {"id": 2, "start": 102.44, "end": 123.4, "text": "Ja, ich war die Woche bisschen abgetaucht, ich hab bisschen rumgebastelt an einem Programm"}, {"id": 3, "start": 123.4, "end": 124.4, "text": "in Go."}, {"id": 4, "start": 124.4, "end": 128.56, "text": "Ich hab noch nie was in Go programmiert vorher und ich muss sagen, ich fand die Go scheiße"}, {"id": 5, "start": 128.56, "end": 129.56, "text": "vorher."}, {"id": 6, "start": 129.56, "end": 146.28, "text": "Ich finde Go immer noch ziemlich kacke, jetzt nachdem ich ne Woche rumgewurstet hab in Go."}, {"id": 7, "start": 146.28, "end": 152.64, "text": "Der Phoenix ist am Start, Twitchprime, vier Monate, oh, Blends, Bigbrain, ich wollte grad"}, {"id": 8, "start": 152.64, "end": 157.68, "text": "sagen BigPrime, eigentlich ist es ja BigPrime."}, {"id": 9, "start": 157.68, "end": 186.88, "text": "BigPrime für Bigbrain, ja zumindest funktioniert mein Go Programm jetzt, Schache ist plus"}, {"id": 10, "start": 186.88, "end": 187.88, "text": "die."}, {"id": 11, "start": 187.88, "end": 191.12, "text": "Ich hab an irgendeiner Stelle einen Memory Leak und ich hab keine Ahnung warum."}, {"id": 12, "start": 191.12, "end": 196.92, "text": "Ich mein, das ist ja nicht einfach nur irgendwas Simples in Go, ich muss ja wieder schon gleich"}, {"id": 13, "start": 196.92, "end": 198.52, "text": "das abgedrehte Zeug machen."}, {"id": 14, "start": 198.52, "end": 210.4, "text": "Und zwar, ich hab ein Go Programm gebastelt, was RTSP Camera Streams nimmt, quasi remaxed"}, {"id": 15, "start": 210.4, "end": 217.2, "text": "und dann im Browser anzeigen kann, ohne Verzögerung oder ohne große Verzögerung mit WebRTC."}, {"id": 16, "start": 217.2, "end": 223.08, "text": "Das ist quasi Pleading Edge neuester Shit und irgendwie hab ich den FFmpeg an einer"}, {"id": 17, "start": 223.08, "end": 225.44, "text": "Stelle in einem Memory Leak und ich hab keine Ahnung wo das herkommt."}, {"id": 18, "start": 225.44, "end": 230.48, "text": "Ich hab zwar alles gefreed, aber es ist doch nicht alles gefreed, wie es aussieht."}, {"id": 19, "start": 230.48, "end": 253.68, "text": "Ich muss mal gucken ob meine Linux VM funktioniert, ja, da ist er doch, perfekt, bei Memory Leak"}, {"id": 20, "start": 253.68, "end": 254.68, "text": "einfach mehr RAM kaufen."}, {"id": 21, "start": 254.68, "end": 261.44, "text": "Ja, das läuft halt auch im Raspberry Pi 3 und das hat maximal 200, aber normalerweise"}, {"id": 22, "start": 261.44, "end": 263.4, "text": "brauchst du 35 MB, sonst nichts."}, {"id": 23, "start": 263.4, "end": 271.28, "text": "Normalerweise brauchst du 35 MB, ist das öffentlich, ich kann das veröffentlichen,"}, {"id": 24, "start": 271.28, "end": 279.56, "text": "aber ich muss aber erstmal meine Camera Streams mit Passwörtern rausschmeißen."}, {"id": 25, "start": 279.56, "end": 293.8, "text": "Also es ist jetzt nicht geheim oder so, mal gucken, ob da kein Passwörter drin ist."}, {"id": 26, "start": 293.8, "end": 298.52, "text": "Also falls, ich warte noch mal ob ein paar Leute ankommen, vielleicht haben wir ja Big"}, {"id": 27, "start": 298.52, "end": 300.68, "text": "Brain Go Kenner, die Memory Leaks fixen."}, {"id": 28, "start": 300.68, "end": 304.76, "text": "Wann veröffentlicht du endlich dein Meanboard für 2, wenn es fertig ist?"}, {"id": 29, "start": 304.76, "end": 308.2, "text": "Das ist ja nicht fertig, das buggt beispielsweise rum, wenn ich neue Sachen hinzufüge."}, {"id": 30, "start": 308.2, "end": 318.96, "text": "Was ich ja auch gerne noch einbauen würde, ist so Basic Animations Support, der nix kann"}, {"id": 31, "start": 318.96, "end": 322.44, "text": "außer den Bild von links nach rechts über den Bildschirm laufen lassen."}, {"id": 32, "start": 322.44, "end": 331.96, "text": "Oder noch viel geiler, wenn man 2 Bilder hintereinander anzeigen lassen könnte, weil dann könnte"}, {"id": 33, "start": 331.96, "end": 334.6, "text": "man hier den Scheibenwischer davor hin und her laufen lassen."}, {"id": 34, "start": 334.6, "end": 343.64, "text": "Oder man müsste einen Gift raus machen, da müsste einer mal einen Gift raus machen,"}, {"id": 35, "start": 343.64, "end": 347.28, "text": "was den Scheibenwischer hier einfach nur einmal da und einmal da zeigt, dass man nicht"}, {"id": 36, "start": 347.28, "end": 348.28, "text": "so viel Arbeit hat."}, {"id": 37, "start": 348.28, "end": 353.24, "text": "Einfach so ein gelobtes Gift mit 2 Sachen, das sieht dann immer besser aus, wenn das"}, {"id": 38, "start": 353.24, "end": 354.24, "text": "da drin steckt."}, {"id": 39, "start": 354.24, "end": 368.64, "text": "Weil ich ja immer noch der Meinung bin, dass Lull eindeutig größer Keck W ist."}, {"id": 40, "start": 368.64, "end": 374.8, "text": "Keck W ist so New Generation Twitch."}, {"id": 41, "start": 374.8, "end": 378.84, "text": "Oldschool Leute verwenden eigentlich sogar Lull mit kleinem U."}, {"id": 42, "start": 378.84, "end": 384.8, "text": "Erinnert sich noch einer an die Zeiten, als alle Franker Sie geschrieben haben, das benutzt"}, {"id": 43, "start": 384.8, "end": 386.04, "text": "heute kein Mensch mehr."}, {"id": 44, "start": 386.04, "end": 392.48, "text": "Franker Sie, Franker Sie, Franker Sie, Franker Sie, Franker Sie, das benutzt kein Mensch"}, {"id": 45, "start": 392.48, "end": 393.48, "text": "mehr mittlerweile."}, {"id": 46, "start": 393.48, "end": 398.48, "text": "Aber, das war Oldschool Twitch."}, {"id": 47, "start": 398.48, "end": 406.36, "text": "Oder kennt noch jemand, kennt noch Greyface Snowspace, kennt das noch jemand?"}, {"id": 48, "start": 406.36, "end": 422.56, "text": "Greyface Snowspace, man muss ja sagen, gute Titel hat er schon immer, da bist du immer"}, {"id": 49, "start": 422.56, "end": 426.76, "text": "dran interessiert drauf zu klicken, wobei die Videos meistens jetzt vom Inhalt her"}, {"id": 50, "start": 426.76, "end": 427.76, "text": "nicht so meins sind."}, {"id": 51, "start": 427.76, "end": 433.2, "text": "Greyface Snowspace, genau, so ging das, kann man gleich Greyface Snowspace."}, {"id": 52, "start": 433.2, "end": 441.2, "text": "Office 3.0 und Windows 10, ja das habe ich mir schon aufgemacht, mal gucken, ob das funktioniert."}, {"id": 53, "start": 441.2, "end": 449.28, "text": "Ich habe mir übrigens was überlegt, das Windows 98 Video kam ja so gut an, ich mache einen"}, {"id": 54, "start": 449.28, "end": 456.52, "text": "zweiten Teil davon, war jetzt eine Woche abgetaucht, habe auch keine Videos gemacht, das kam ja"}, {"id": 55, "start": 456.52, "end": 462.52, "text": "so gut an, das Windows 98 Video, guckt euch das mal an, das ist ja huge hier, 116.000 Aufrufe."}, {"id": 56, "start": 462.52, "end": 475.04, "text": "Der Sebaro ist am Start, nice, da kann ich nur dazu sagen, und ich mache dann einen zweiten"}, {"id": 57, "start": 475.04, "end": 482.84, "text": "Teil zu, und zwar probieren wir da mal ein paar olle Windows Sachen aus, so Microsoft"}, {"id": 58, "start": 482.84, "end": 490.76, "text": "Frontpage aus Office 97 und sowas und am Ende des Videos upgraden wir, das ist so als Cliffhanger"}, {"id": 59, "start": 490.76, "end": 498.68, "text": "für noch ein Video, upgraden wir auf Windows ME, so eigentlich eine gute Idee, oder?"}, {"id": 60, "start": 498.68, "end": 509.2, "text": "Erstmal ein bisschen alles täuschen und dann am Ende auf Windows ME upgraden, denn das"}, {"id": 61, "start": 509.2, "end": 512.08, "text": "ist echt big brain."}, {"id": 62, "start": 512.08, "end": 523.12, "text": "Übrigens habe ich euch erzählt, dass ich es geschafft habe, dass mich mein Hoster gebannt"}, {"id": 63, "start": 523.12, "end": 529.56, "text": "hat, also Hoster, Hoster nicht, die hosten zwar auch, aber ich habe nur meine zwei Domains"}, {"id": 64, "start": 529.56, "end": 539.36, "text": "da, die haben mich gebannt, da habe ich an Support geschrieben, ich habe gesagt, Jungs,"}, {"id": 65, "start": 539.36, "end": 546.24, "text": "ihr habt mich gebannt, da haben sie mich entbannt, jetzt bin ich wieder gebannt, und warum?"}, {"id": 66, "start": 546.24, "end": 550.64, "text": "Ganz einfach, weil ich mir gedacht habe, nein, nein, nein, nicht auf Twitter geflammt, das"}, {"id": 67, "start": 550.64, "end": 558.8, "text": "ist ja nicht MSI, weil ich mir gedacht habe, um Let's Encrypt Zertifikate zu generieren,"}, {"id": 68, "start": 558.8, "end": 561.76, "text": "sagt das, sagt, weiß jeder was Let's Encrypt ist?"}, {"id": 69, "start": 561.76, "end": 567.68, "text": "Let's Encrypt ist ein kostenloser Service, wo man sich gültige SSL, HTTPS Zertifikate"}, {"id": 70, "start": 567.68, "end": 576.72, "text": "generieren lassen kann, und da habe ich mir gedacht, bevor ich jedes mal von Hand Sachen"}, {"id": 71, "start": 576.72, "end": 584.36, "text": "eintrage dort, dass ich mir neue Zertifikate generieren kann, bzw. dass ich irgendwo einen"}, {"id": 72, "start": 584.36, "end": 590.12, "text": "Public Web Server hinstelle, dass ich Zertifikate generieren kann, bin ich jetzt big brain und"}, {"id": 73, "start": 590.12, "end": 598.32, "text": "mache einen Chrome Skript, das ist eine Library mit der man Chrome fernsteuern kann, die ist"}, {"id": 74, "start": 598.32, "end": 607.48, "text": "ganz unbeliebt mit 55.700 Sternen auf GitHub, das ist eigentlich auch super easy, so kann"}, {"id": 75, "start": 607.48, "end": 613.52, "text": "man beispielsweise Sachen, Screenshots von Seiten machen und so was, und da habe ich"}, {"id": 76, "start": 613.52, "end": 621.16, "text": "gedacht, ok, ich mache einfach jetzt ein Puppetieres JavaScript Programm, wo ich einen Headless"}, {"id": 77, "start": 621.16, "end": 624.76, "text": "Chrome fernsteuere, also sprich man sieht dann auch kein Fenster, und ich tue einfach"}, {"id": 78, "start": 624.76, "end": 633.24, "text": "so, als würde ich das manuell machen, und irgendwie habe ich das Skript, also das Skript"}, {"id": 79, "start": 633.24, "end": 637.56, "text": "hat sich dann, das habe ich gestartet, dann ist im Hintergrund ein Chrome aufgegangen,"}, {"id": 80, "start": 637.56, "end": 646.4, "text": "hat dort sich eingeloggt und dann im Endeffekt dort Zeugs eingetragen in DNS, dass ich ein"}, {"id": 81, "start": 646.4, "end": 650.64, "text": "Zertifikat generieren kann, also eigentlich kann es easy, das Problem war nur, während"}, {"id": 82, "start": 650.64, "end": 654.48, "text": "ich das gebastelt habe, das funktioniert ja nicht auf Anhieb, habe ich es ein paar mal"}, {"id": 83, "start": 654.48, "end": 659.08, "text": "zu oft gestartet, und einmal hatte ich wohl auch irgendeinen Bug drinnen, dass es sich"}, {"id": 84, "start": 659.08, "end": 666.36, "text": "irgendwie 800 mal versucht hat einzuloggen, und dann haben sie mich geblockt, haben gesagt,"}, {"id": 85, "start": 666.36, "end": 672.12, "text": "wir haben verdächtige Aktivitäten erkannt von ihrer IP, und jetzt haben wir sie geblockt,"}, {"id": 86, "start": 672.12, "end": 679.52, "text": "ok, habe ich den Support angeschrieben, habe gesagt, ja, ups, war keine Absicht, da haben"}, {"id": 87, "start": 679.52, "end": 687.32, "text": "sie gesagt, ja sie mögen das auch nicht, wenn man ihre Webinterface, quasi Bots, Skript"}, {"id": 88, "start": 687.32, "end": 693.48, "text": "drauf laufen lässt, verstehe ich, kein Anbieter mag das, das hassen alle, alle Anbieter hassen"}, {"id": 89, "start": 693.48, "end": 706.24, "text": "diesen Trick, so, und dann haben sie mich wieder entbandt, ich habe gesagt, es passiert"}, {"id": 90, "start": 706.24, "end": 714.52, "text": "nicht mehr, und jetzt gestern, habe ich, keine Ahnung, 20 Anfragen geschickt oder so, nicht"}, {"id": 91, "start": 714.52, "end": 717.88, "text": "viel, jetzt bin ich wiedergeblockt, wahrscheinlich haben sie mich schon auf so einer verschärften"}, {"id": 92, "start": 717.88, "end": 731.24, "text": "Liste drauf gehabt, nicht 8000, 800, war nur 800, naja, zumindest, Linux 20 years ago,"}, {"id": 93, "start": 731.24, "end": 738.64, "text": "das müssen wir gucken, naja, zumindest habe ich jetzt angeschrieben, dass die mich mal"}, {"id": 94, "start": 738.64, "end": 747.96, "text": "wieder anplocken sollen, weil, haben die kein Captcha drinnen, nö, das wäre, das wäre"}, {"id": 95, "start": 747.96, "end": 750.84, "text": "doof, wenn die Captcha hätten, weil dann kann man es nämlich komplett vergessen, oh, Saps,"}, {"id": 96, "start": 750.84, "end": 758.76, "text": "hier, am Start, Big Prime, Big Brain, Zero, mit 3 Nullen, oder besser gesagt, 3, 1M0"}, {"id": 97, "start": 758.76, "end": 764.28, "text": "in der Mitte, 3 Monate, Hypers, aber sowas von, den brauche ich übrigens auch noch mal"}, {"id": 98, "start": 764.28, "end": 775.24, "text": "transparent im Hintergrund, der Stellsohr, 3 Monate, wupp wupp, 3 Monate, huge, Pock,"}, {"id": 99, "start": 775.24, "end": 781.52, "text": "und da haben wir, da, Phobie, 3 Monate, ja heute, liegen ja die Abos, excellent Subscribers,"}, {"id": 100, "start": 781.52, "end": 789.04, "text": "ne, die haben kein Captcha drinnen, die sind aber ehrlich gesagt blöd, dass sie kein"}, {"id": 101, "start": 789.04, "end": 792.36, "text": "Captcha drinnen haben, weil hätten sie nämlich ein Captcha drinnen, dann hätte ich das vergessen"}, {"id": 102, "start": 792.36, "end": 803.92, "text": "können, wobei es gibt, es gibt mittlerweile ganz gute Captcha Solving, es gibt mittlerweile,"}, {"id": 103, "start": 803.92, "end": 814.68, "text": "ich weiß gar nicht, wer was es war, was könnte es, ne, das ist das Browser Addon, also es"}, {"id": 104, "start": 814.68, "end": 822.64, "text": "gibt, es gibt mittlerweile ganz gute Bots und KI´s, die Captchas, halbwegs, nicht gut,"}, {"id": 105, "start": 822.64, "end": 829.32, "text": "ja, also wirklich gut funktioniert das ganze nicht, aber die Captchas ansatzweise lösen"}, {"id": 106, "start": 829.32, "end": 837.48, "text": "können, das Addon kenne ich noch gar nicht, was macht das denn, das ist doch ein ganz"}, {"id": 107, "start": 837.48, "end": 845.6, "text": "normales Captcha oder, was macht das Addon, improve your experience with Captchas, das"}, {"id": 108, "start": 845.6, "end": 854.4, "text": "beste Captcha ist eh die ganz neuen, die gar keine Bilder mehr brauchen, die einfach irgendwelche"}, {"id": 109, "start": 854.4, "end": 861.04, "text": "Metadaten einsammeln und dann quasi so tun, als wäre es, könnten sie das da raus erkennen,"}, {"id": 110, "start": 861.04, "end": 867.96, "text": "ja, manche, also ich hab´s auch schon geschafft, vor allem, also bei Captchas, wo ich immer"}, {"id": 111, "start": 867.96, "end": 884.32, "text": "versage, ist, welche Bilder enthalten den Hydrant, kennt ihr das, ja, da, da versage"}, {"id": 112, "start": 884.32, "end": 894.92, "text": "ich immer bei, ja, ich mein, die hier sind jetzt relativ auffällig, ja, aber die haben"}, {"id": 113, "start": 894.92, "end": 899.12, "text": "manchmal Bilder drin, da steht, da steht da hinter Baum noch ein Hydrant und so und das"}, {"id": 114, "start": 899.12, "end": 906.0, "text": "wollen wir dann erkennen, dafür sage ich immer, vor allem sind die, sind ja auch in so, weißt"}, {"id": 115, "start": 906.0, "end": 909.96, "text": "was ich, hier, hier neben steht noch ein Hydrant oder sowas, das kannst du teilweise komplett,"}, {"id": 116, "start": 909.96, "end": 917.4, "text": "komplett vergessen, also beim Feuerhydrant verkacke ich öfters, was auch, was auch Kackcaptcha"}, {"id": 117, "start": 917.4, "end": 931.8, "text": "ist, Captcha, Captcha Storefront, Storefront, das ist auch saumäßig schwierig, weil, ich"}, {"id": 118, "start": 931.8, "end": 935.76, "text": "hab ehrlich gesagt keine Ahnung, was da von Geschäfte sind, ich mein, ey, vielleicht"}, {"id": 119, "start": 935.76, "end": 942.0, "text": "ist da ein Geschäft drin, wo soll ich das wissen, oder das hier, ist das ein Storefront,"}, {"id": 120, "start": 942.0, "end": 946.84, "text": "ist das hier ein Storefront, wahrscheinlich, keine Ahnung, also, Feuerhydrant und, und"}, {"id": 121, "start": 946.84, "end": 951.52, "text": "Store, und, und Geschäfte, da versage ich immer, guck mal, das hier kann auch ein Geschäft"}, {"id": 122, "start": 951.52, "end": 958.56, "text": "sein, und das hier auch, was weiß ich, markieren sie alle Felder mit einem Auto, ja, wobei,"}, {"id": 123, "start": 958.56, "end": 966.28, "text": "also, Feuerhydrant und Storefront, da verkacke ich's immer richtig, ja, Serious Max, das"}, {"id": 124, "start": 966.28, "end": 973.68, "text": "gleiche Problem hab ich auch, ähm, ähm, Graphic Sites, das hier, diese Dinger sind"}, {"id": 125, "start": 973.68, "end": 979.72, "text": "auch Kacke, weil du hast hier manchmal, manchmal Bilder, guck mal, stellt euch mal vor, dieses"}, {"id": 126, "start": 979.72, "end": 983.32, "text": "Schild würde noch ein Stückchen hier reinragen, soll man das Bild jetzt mitmarkieren oder"}, {"id": 127, "start": 983.32, "end": 991.08, "text": "nicht, ja, oder, oder, oder ist, ist das da, ist das Bild da unten, ist da noch ein Traffic"}, {"id": 128, "start": 991.08, "end": 999.44, "text": "Light drauf oder nicht, was ist, was sind die richtigen Felder, das, das, das, das, oder"}, {"id": 129, "start": 999.44, "end": 1015.52, "text": "das da noch dabei, ja, also, äh, das ist nicht unbedingt immer so klar, ja, Traffic"}, {"id": 130, "start": 1015.52, "end": 1027.12, "text": "Light heißt Ampeln, ja, ja, theoretisch, theoretisch, theoretisch müsste es die Stange mitmarkieren,"}, {"id": 131, "start": 1027.12, "end": 1030.8, "text": "wenn sie die komplette Ampel meinen, aber vielleicht meinen die ja wirklich nur dort,"}, {"id": 132, "start": 1030.8, "end": 1037.04, "text": "wo die Licht, wo die, wo die Ampeldinger hängen, also, was, Capture Dish, Dishwasher?"}, {"id": 133, "start": 1037.04, "end": 1062.32, "text": "Capture Dish, Dish, ohje, ohje Leute, anti, das, das männliche Patriarchat macht sich"}, {"id": 134, "start": 1062.32, "end": 1072.32, "text": "wieder breit hier, aber das ist tatsächlich ganz lustig, aber das Problem ist, dass die"}, {"id": 135, "start": 1072.32, "end": 1077.44, "text": "Leute heute bei jedem Scheiß gedriggert sind, ja, das gleiche könntest du für Männer machen"}, {"id": 136, "start": 1077.44, "end": 1099.08, "text": "mit irgendwelchen Klischees, was aber, naja, naja Leute, übrigens, ich habe immer noch"}, {"id": 137, "start": 1099.08, "end": 1103.8, "text": "meine SSD hier rum liegen, fällt mir gerade auf, weil ich das hier noch offen hatte, ähm,"}, {"id": 138, "start": 1103.8, "end": 1107.72, "text": "die ich mal endlich einbauen muss, die liegt hier noch, die liegt hier schon, ah, hier,"}, {"id": 139, "start": 1107.72, "end": 1112.88, "text": "hier ist sie noch da, die 970 Evo habe ich immer noch nicht eingebaut, wenn ich die eingebaut"}, {"id": 140, "start": 1112.88, "end": 1120.2, "text": "hätte, dann könnte ich auch Call of Duty Modern Warfare und meine VMs auf der SSD installieren,"}, {"id": 141, "start": 1120.2, "end": 1124.64, "text": "weil COD braucht ja nur 107 Gigabyte, ich weiß, ganz ehrlich, ich habe keine Ahnung, warum"}, {"id": 142, "start": 1124.64, "end": 1130.6, "text": "dieses Spiel so viel Speicherplatz braucht, echt kein Plan, so Leute, sind jetzt ja ein"}, {"id": 143, "start": 1130.6, "end": 1136.36, "text": "paar da, haben wir irgendwelche Leute, die sich mit Go und eventuell auch FFmpeg auskönnen"}, {"id": 144, "start": 1136.36, "end": 1140.96, "text": "und mir sagen können, warum ich eine Memory Leak habe, in dem Programm, was ich gebastelt"}, {"id": 145, "start": 1140.96, "end": 1147.28, "text": "habe, hm, ich habe keine Ahnung, warum, es ist wahrscheinlich auch absolut nicht, nicht"}, {"id": 146, "start": 1147.28, "end": 1160.32, "text": "Go Style, ja, ich habe eine Memory Leak, ich kann das ja mal auf GitHub in irgendeinem"}, {"id": 147, "start": 1160.32, "end": 1165.6, "text": "List hochladen und wer Bock hat, sich das anzugucken, warum ich eine Memory Leak habe,"}, {"id": 148, "start": 1165.6, "end": 1175.64, "text": "der kann es ja, äh, wer was schreibt, Gist, habe ich überhaupt eingeloggt, nee, gehen"}, {"id": 149, "start": 1175.64, "end": 1185.2, "text": "wir mal Paste Bin, Paste Bin, Red Dead Redemption 2, ach, da wollte ich mal gucken, warte mal,"}, {"id": 150, "start": 1185.2, "end": 1195.32, "text": "wir gucken uns mal den Game Star Test an, Gangster, Game Star, wollen wir den Test angucken"}, {"id": 151, "start": 1195.32, "end": 1205.2, "text": "von der Game Star von Red Dead Redemption 2 auf dem PC, das ist noch nicht gut genug,"}, {"id": 152, "start": 1205.2, "end": 1222.52, "text": "Rockstar stolpert auf den PC, ja, also, Paste Bin, ich lad mal kurz mein Go Programm hoch"}, {"id": 153, "start": 1222.52, "end": 1226.32, "text": "und falls irgendjemand sich auskennt und eine Ahnung hat, warum ich da eine Memory Leak"}, {"id": 154, "start": 1226.32, "end": 1235.44, "text": "in der Verursache, der kann mir Bescheid sagen, ich habe meine Kameras Streams rausgenommen,"}, {"id": 155, "start": 1235.44, "end": 1245.8, "text": "da ist jetzt bloß noch ein Test Kameras Stream drinne, allerdings dreimal und auch ohne verbundene"}, {"id": 156, "start": 1245.8, "end": 1250.8, "text": "User hat das Ding eine Memory Leak, also das HTML Frontend muss ich gar nicht hochladen,"}, {"id": 157, "start": 1250.8, "end": 1259.4, "text": "mal gucken, dass ich da nicht irgendwelche Passwörter drinne hab, wie markiert man den"}, {"id": 158, "start": 1259.4, "end": 1280.2, "text": "Programm hier als Software, Sündagshilating Go, unlisted, ist ein bisschen länger, aber"}, {"id": 159, "start": 1280.2, "end": 1290.48, "text": "das eigentlich Interessante, wo das Memory Leak ist, zeige ich euch, ist hier, das sind"}, {"id": 160, "start": 1290.48, "end": 1298.24, "text": "wenigstens noch Captures die Kammer, mit denen kann man was anfangen, also, Paste das mal,"}, {"id": 161, "start": 1298.24, "end": 1303.88, "text": "also falls sich irgendjemand daran auslassen möchte, warum ich eine Memory Leak habe,"}, {"id": 162, "start": 1303.88, "end": 1311.36, "text": "und zwar das eigentliche Memory Leak passiert, glaube ich, das eigentliche Memory Leak passiert"}, {"id": 163, "start": 1311.36, "end": 1322.88, "text": "hier bei meinem FFmpeg Stuff, und zwar vermute ich mal, dass ich, weil das ist ja C, C Interop,"}, {"id": 164, "start": 1322.88, "end": 1327.6, "text": "vermute mal, dass ich das hier nicht richtig free, wobei ich das an allen Stellen, die"}, {"id": 165, "start": 1327.6, "end": 1341.68, "text": "mir bekannt sind free, oder aber, dass ich hier irgendwas nicht free, ich bin mir da"}, {"id": 166, "start": 1341.68, "end": 1345.64, "text": "aber ehrlich gesagt nicht so ganz sicher, also hier ist die Stelle wo das Memory Leak"}, {"id": 167, "start": 1345.64, "end": 1357.84, "text": "ist, der Rest ist egal, der Rest ist wurscht, meine Keys habe ich auch nicht mit eingecheckt"}, {"id": 168, "start": 1357.84, "end": 1364.8, "text": "und sowas, also theoretisch kann man das in Go Copy Pasten und das sollte funktionieren,"}, {"id": 169, "start": 1364.8, "end": 1377.8, "text": "und man sieht auch gleich, dass es Memory Leak ist, also ich weiß nicht warum, ja und"}, {"id": 170, "start": 1377.8, "end": 1385.36, "text": "was es macht ist RTSP Streams nehmen und so umwursten, dass man sie sich im Browser angucken"}, {"id": 171, "start": 1385.36, "end": 1397.2, "text": "kann, tschüss Twitch Prime zwei Monate, nice, big prime, big brain, nice, nice sub, excellent,"}, {"id": 172, "start": 1397.2, "end": 1401.32, "text": "naja also falls irgendjemand Bock hat sich das mal anzugucken, ich habe echt keinen"}, {"id": 173, "start": 1401.32, "end": 1418.0, "text": "Plan warum das Memory Leak ist, naja, aber das machen wir jetzt nicht hier an Stream,"}, {"id": 174, "start": 1418.0, "end": 1423.08, "text": "so gucken wir uns mal den Test von der Gamster an, Threated Dream Damage 2, da bin ich mal"}, {"id": 175, "start": 1423.08, "end": 1431.92, "text": "angeschaut, was die da zu sagen, warum Go, ja in dem Fall, also wenn es nach mir gegangen"}, {"id": 176, "start": 1431.92, "end": 1439.4, "text": "wäre Flo hätte ich das natürlich gemacht, aber es ist in Go, weil es nur für Go eine"}, {"id": 177, "start": 1439.4, "end": 1448.8, "text": "ordentliche WebRTC Library gibt, so und ich will ja, also WebRTC ist ja eigentlich eine"}, {"id": 178, "start": 1448.8, "end": 1454.0, "text": "Technik wo man von Browser zu Browser Video und Audio macht für irgendwelche Video-Audio-Konferenzen"}, {"id": 179, "start": 1454.0, "end": 1460.12, "text": "gibt, allerdings möchte ich jetzt nicht WebRTC machen mit einem Browser, sondern mit meinem"}, {"id": 180, "start": 1460.12, "end": 1464.08, "text": "Server und dem Browser, also das heißt mein Server muss so tun, als dass er eine WebRTC"}, {"id": 181, "start": 1464.08, "end": 1473.12, "text": "kleint, nein es gibt für.NET Core keine WebRTC Library, vor allem keine die auch unter"}, {"id": 182, "start": 1473.12, "end": 1478.96, "text": "Linux funktioniert, gibt es nicht, man kann sich ja mal gucken ob du was findest, es gibt"}, {"id": 183, "start": 1478.96, "end": 1485.04, "text": "ein paar Sachen die sind aber Windows Only und auch ziemlich unfertig, so und nur für"}, {"id": 184, "start": 1485.04, "end": 1489.96, "text": "Go gibt es ordentliche WebRTC, Web ist auch relativ beliebt, deswegen habe ich mir gedacht"}, {"id": 185, "start": 1489.96, "end": 1496.32, "text": "komm dann machen wir das ganze in Go und im Prinzip macht es ja nichts anderes, jetzt"}, {"id": 186, "start": 1496.32, "end": 1504.68, "text": "habe ich übrigens schon zugebracht, im Prinzip macht es ja nichts anderes, wie diese Streams"}, {"id": 187, "start": 1504.68, "end": 1516.76, "text": "hier zu nehmen, dann in FFmpeg quasi sich dahin zu connecten und dann an den Browser"}, {"id": 188, "start": 1516.76, "end": 1523.72, "text": "die encoded Pakete zu schicken, also bloß halt ein bisschen WebRTC gedürnt hier unten"}, {"id": 189, "start": 1523.72, "end": 1527.56, "text": "drunter aber das ist eigentlich egal, das MemoryLeak tritt schon auf wenn man das Programm"}, {"id": 190, "start": 1527.56, "end": 1533.4, "text": "einfach nur startet, man muss es einfach nur starten und keine Ahnung man guckt sich"}, {"id": 191, "start": 1533.4, "end": 1542.68, "text": "das ganze mit Top oder so an oder mit Hardtop und man wird sehen, es hat Instant MemoryLeak"}, {"id": 192, "start": 1542.68, "end": 1547.44, "text": "immer ein paar Kilobyte, also das heißt es muss hier in dieser FFmpeg Verarbeitungsschleife"}, {"id": 193, "start": 1547.44, "end": 1555.2, "text": "eine MemoryLeak haben und ich habe keine Ahnung warum, mein Packet, das einzige was ich allokiere"}, {"id": 194, "start": 1555.2, "end": 1566.36, "text": "in der Schleife ist ja im Prinzip das Packet, aber und ich free das auch überall wo die"}, {"id": 195, "start": 1566.36, "end": 1576.68, "text": "Schleife abbrechen könnte, ja überall wird das gefreet, ich vermute ja das hier ist,"}, {"id": 196, "start": 1576.68, "end": 1582.68, "text": "dass das hier irgendwie MemoryLeak, allerdings weiß ich nicht warum, weil normalerweise sollte"}, {"id": 197, "start": 1582.68, "end": 1593.68, "text": "ja eigentlich das da nur ein Zeiger sein auf das C, der Byte Array aus von dem Packet,"}, {"id": 198, "start": 1593.68, "end": 1598.56, "text": "also sprich wenn ich das Packet free, sollten eigentlich die Bytes auch weg sein soweit"}, {"id": 199, "start": 1598.56, "end": 1603.8, "text": "von der Idee her, aber ich weiß nicht woran, vielleicht liegt es an dem plus eins, vielleicht"}, {"id": 200, "start": 1603.8, "end": 1607.52, "text": "müsste ich es ohne plus eins machen, vielleicht ist es doch zu lang, aber dann müsste das"}, {"id": 201, "start": 1607.52, "end": 1617.0, "text": "eigentlich sich abkacken, ja ich habe keine Ahnung Leute, also falls ihr euch einer mit"}, {"id": 202, "start": 1617.0, "end": 1621.48, "text": "Go auskennt, tut euch kein Zwang an, sonst in irgendeinem Fall kriege ich das bestimmt"}, {"id": 203, "start": 1621.48, "end": 1622.48, "text": "noch raus."}, {"id": 204, "start": 1622.48, "end": 1626.28, "text": "So jetzt gucken wir uns mal an was die GameStars zu Red Dead Redemption auf dem PC sah, mal"}, {"id": 205, "start": 1626.28, "end": 1633.48, "text": "gespannt, ob es das lohnt, ihr wisst ja ich bin generell kein Open World, viele Fan,"}, {"id": 206, "start": 1633.48, "end": 1641.36, "text": "außer der Switcher, zumindest auf der Switch, also der Switcher 3 war so ein Open World"}, {"id": 207, "start": 1641.36, "end": 1651.8, "text": "Spiel, das fand ich ganz gut, aber vor allem weil es einen roten Faden hatte, aber GTA"}, {"id": 208, "start": 1651.8, "end": 1663.44, "text": "beispielsweise ist nicht meins, oh ein Dance Game Star, laut genug, im Schlechtem, ja das"}, {"id": 209, "start": 1663.44, "end": 1668.36, "text": "war nicht schlecht, weil die Systemanforderungen hoch sind und es zum Release bei einigen technischen"}, {"id": 210, "start": 1668.36, "end": 1674.48, "text": "Probleme gab, besonders mit dem Rockstar Games Launcher, oh Gott jeder braucht so einen Kack"}, {"id": 211, "start": 1674.48, "end": 1680.4, "text": "extra Launcher, der funktioniert dann aber nicht, weil Rockstar doch will, dass man den"}, {"id": 212, "start": 1680.4, "end": 1686.4, "text": "hauseigenen Launcher nutzt, warum dann überhaupt bei der Installation einen Shortcut anlegen,"}, {"id": 213, "start": 1686.4, "end": 1691.16, "text": "egal das ist nur ein kleines Detail, viel schlimmer waren da Abstürze oder Probleme"}, {"id": 214, "start": 1691.16, "end": 1695.56, "text": "das Spiel überhaupt zum starten zu kriegen, aber wie gesagt das betrifft nur einen kleinen"}, {"id": 215, "start": 1695.56, "end": 1700.16, "text": "Teil der Spieler und Rockstar hat schnell Updates rausgejagt um die Probleme zu lösen"}, {"id": 216, "start": 1700.16, "end": 1704.4, "text": "und soweit sich das einschätzen lässt scheinen die Patches bei sehr vielen Betroffenen geholfen"}, {"id": 217, "start": 1704.4, "end": 1710.04, "text": "zu haben, im Guten ist Red Dead Redemption 2 ein Monster, weil das Spiel sehr umfangreich"}, {"id": 218, "start": 1710.04, "end": 1715.24, "text": "und optionsreich ist, wobei die rund 60 Stunden lange Singleplayer Kampagne nur der Anfang"}, {"id": 219, "start": 1715.24, "end": 1720.16, "text": "ist, Nebenaufgaben und Aktivitäten runden das Angebot für Einzelspieler ab, während"}, {"id": 220, "start": 1720.16, "end": 1739.0, "text": "im Multiplayer noch mal einige Storyaufträge für Koop-Spieler und"}, {"id": 221, "start": 1739.0, "end": 1743.64, "text": "verschiedene Versus-Modi warten und natürlich eine gigantische Spielwelt in der man sich"}, {"id": 222, "start": 1743.64, "end": 1749.12, "text": "beim Reiten und Jagen verlieren kann, diese Open World sieht auf dem PC nochmal besser"}, {"id": 223, "start": 1749.12, "end": 1754.92, "text": "aus als auf den Konsolen, im Vergleich zur Xbox One X Fassung, also der besten verfügbaren"}, {"id": 224, "start": 1754.92, "end": 1760.56, "text": "Konsolenversion, ist der Sprung auf den PC in Sachen Bildqualität und Details aber sehr"}, {"id": 225, "start": 1760.56, "end": 1765.64, "text": "überschaubar, wirklich auffällig sind nur etwas bessere Reflektionen auf dem Wasser,"}, {"id": 226, "start": 1765.64, "end": 1766.64, "text": "die etwas besser..."}, {"id": 227, "start": 1766.64, "end": 1769.08, "text": "...nicht darauf entwickelt worden da jetzt irgendwie, die haben jetzt da nichts großartiges"}, {"id": 228, "start": 1769.08, "end": 1772.56, "text": "super tolles neues eingebaut, ich meine das Fell sieht vielleicht ein bisschen besser"}, {"id": 229, "start": 1772.56, "end": 1787.12, "text": "aus, wobei, ja, das einzige was halt besser sein wird ist die Auflösung im Endeffekt."}, {"id": 230, "start": 1787.12, "end": 1795.92, "text": "Ja das stimmt, das sieht besser aus."}, {"id": 231, "start": 1795.92, "end": 1816.2, "text": "Haha, die Gegner sind auch richtig doof oder?"}, {"id": 232, "start": 1816.2, "end": 1820.88, "text": "So würde ich das natürlich auch machen, wenn ich dann umgeworfen hab, mich erstmal so vor"}, {"id": 233, "start": 1820.88, "end": 1823.16, "text": "ihn hängen, dass er mir das Schrotgewehr abnehmen kann."}, {"id": 234, "start": 1823.16, "end": 1829.0, "text": "...sind im Vergleich mit der One X Fassung zwar mit der Lupe zu erkennen, fallen im laufenden"}, {"id": 235, "start": 1829.0, "end": 1835.2, "text": "Spiel, aber nicht wirklich auf, ein herausstechendes neues Grafikfeature, wie damals bei GTA 5,"}, {"id": 236, "start": 1835.2, "end": 1837.04, "text": "wo es nur auf dem PC dynamische Sch..."}, {"id": 237, "start": 1837.04, "end": 1842.92, "text": "Aber schöner sieht das doch aus oder ist das einfach, das ist einfach eine andere Tageszeit"}, {"id": 238, "start": 1842.92, "end": 1843.92, "text": "oder?"}, {"id": 239, "start": 1843.92, "end": 1853.6, "text": "Ah, oder, weil, sieht einfach anders aus."}, {"id": 240, "start": 1853.6, "end": 1860.8, "text": "Grafikfeature, wie damals bei GTA 5, wo es nur auf dem PC dynamische Schatten von Lichtquellen"}, {"id": 241, "start": 1860.8, "end": 1865.92, "text": "wie Autoscheinwerfern gab, bietet Rockstar für Red Dead Redemption 2 auf dem PC diesmal"}, {"id": 242, "start": 1865.92, "end": 1866.92, "text": "nicht."}, {"id": 243, "start": 1866.92, "end": 1870.8, "text": "Trotzdem gehört das Spiel zu den schönsten, die es derzeit gibt und der geringe Unterschied"}, {"id": 244, "start": 1870.8, "end": 1875.56, "text": "zur Xbox One X zeigt nur, wie unglaublich gut der Titel schon auf den Konsolen aussah."}, {"id": 245, "start": 1875.56, "end": 1881.4, "text": "Der wichtigste grafische Unterschied zwischen Red Dead 2 auf PC und Konsole liegt aber sowieso"}, {"id": 246, "start": 1881.4, "end": 1887.64, "text": "nicht bei den Details, sondern bei der Frame Rate."}, {"id": 247, "start": 1887.64, "end": 1894.28, "text": "Auf dem PC sind natürlich mehr als die gelockten 30 FPS der Konsolenversion möglich, vorausgesetzt,"}, {"id": 248, "start": 1894.28, "end": 1895.64, "text": "ihr habt die passende Hardware."}, {"id": 249, "start": 1895.64, "end": 1900.76, "text": "Denn auch bei den Systemanforderungen ist Red Dead Redemption 2 auf dem PC ein Monster und"}, {"id": 250, "start": 1900.76, "end": 1903.56, "text": "frisst eure Ressourcen erbarmungslos auf."}, {"id": 251, "start": 1903.56, "end": 1910.4, "text": "4K mit 60 FPS überfordert selbst die beste aktuelle Hardware, so heißt ein In-Evo I9"}, {"id": 252, "start": 1910.4, "end": 1916.96, "text": "9009, oder besser gesagt, oder besser gesagt, 1080p am besten mit 100 plus FPS und eine"}, {"id": 253, "start": 1916.96, "end": 1920.08, "text": "GeForce RTX 2080 Ti."}, {"id": 254, "start": 1920.08, "end": 1924.28, "text": "Das klingt jetzt erstmal ziemlich schlimm, ist es aber nicht, denn Red Dead Redemption"}, {"id": 255, "start": 1924.28, "end": 1939.0, "text": "2 bietet wie schon GTA 5 auf dem PC eine lange Liste an Einstellungsmöglichkeiten."}, {"id": 256, "start": 1939.0, "end": 1944.24, "text": "Der Unterschied zwischen hohen und Ultraeinstellungen macht sich zwar in den FPS bemerkbar, aber"}, {"id": 257, "start": 1944.24, "end": 1946.28, "text": "nicht wirklich in der Bildqualität."}, {"id": 258, "start": 1946.28, "end": 1951.16, "text": "Erst bei mittleren Einstellungen spürt man kleine Qualitätseinbußen mit Ausnahme der"}, {"id": 259, "start": 1951.16, "end": 1955.16, "text": "Texturqualität, die ihr möglichst hoch eingestellt lassen solltet."}, {"id": 260, "start": 1955.16, "end": 1965.32, "text": "Wer in GTA 5 in 1080p und 60 FPS bei maximalen Details spielen kann, sollte Red Dead 2 in"}, {"id": 261, "start": 1965.32, "end": 1970.94, "text": "dieser Auflösung mindestens mit mittleren, in manchen Bereichen auch mit hohen Einstellungen"}, {"id": 262, "start": 1970.94, "end": 1973.6, "text": "auf stabile 60 Bilder bringen können."}, {"id": 263, "start": 1973.6, "end": 1976.0, "text": "Zumindest in den allermeisten Szenen."}, {"id": 264, "start": 1976.0, "end": 1980.28, "text": "Ihr braucht also nicht zwingend die neueste Grafikkarten-Generation von AMD und Nvidia,"}, {"id": 265, "start": 1980.28, "end": 1986.28, "text": "eine gute Mittelklasse-Karte, beispielsweise eine GeForce GTX 1070, reicht für 1080p 60"}, {"id": 266, "start": 1986.28, "end": 1989.4, "text": "Frames und mittlere bis hohe Einstellungen."}, {"id": 267, "start": 1989.4, "end": 1995.54, "text": "Also genau das, was man in diesem Hardware-Preissegment bei einem aktuellen Spiel mit so guter Grafik"}, {"id": 268, "start": 1995.54, "end": 1996.54, "text": "erwarten kann."}, {"id": 269, "start": 1996.54, "end": 2000.96, "text": "Trotzdem gilt, wie bei fast allen Spielen, die mit Fokus auf Konsolen entwickelt wurden,"}, {"id": 270, "start": 2000.96, "end": 2004.84, "text": "dass meist die Grafikkarte den größten Einfluss auf die Performance hat."}, {"id": 271, "start": 2004.84, "end": 2008.76, "text": "Ein besserer Prozessor oder mehr RAM bringen hinweg nicht sehr viel."}, {"id": 272, "start": 2008.76, "end": 2010.4, "text": "Was sei denn eure 4-Kern-CPI?"}, {"id": 273, "start": 2010.4, "end": 2014.12, "text": "Vor allem muss man halt sagen, jetzt hätte ich jetzt eigentlich erwartet, dass man klar"}, {"id": 274, "start": 2014.12, "end": 2017.92, "text": "macht eine Grafikkarte viel aus, weil ich meine, die Grafikkarten in der aktuellen Konsolen-Generation"}, {"id": 275, "start": 2017.92, "end": 2018.92, "text": "ist halt crap."}, {"id": 276, "start": 2018.92, "end": 2027.92, "text": "Aber gerade bei so viel terrenlastigen Open-World-Dingern macht es oftmals auch ein bisschen CPU aus,"}, {"id": 277, "start": 2027.92, "end": 2028.92, "text": "aber anscheinend nicht."}, {"id": 278, "start": 2028.92, "end": 2034.72, "text": "CPU ist noch so alt, dass sie ohne virtuelle Kernverdopplung arbeitet, das betrifft beispielsweise"}, {"id": 279, "start": 2034.72, "end": 2037.08, "text": "ältere i5-Modelle."}, {"id": 280, "start": 2037.08, "end": 2041.8, "text": "Welche Einstellungen nun genau wie viel Performance bei unterschiedlichen Auflösungen bringen,"}, {"id": 281, "start": 2041.8, "end": 2045.52, "text": "muss jeder Spieler mit seiner individuellen Hardware selbst herausfinden."}, {"id": 282, "start": 2045.52, "end": 2051.96, "text": "Die offiziellen Systemanforderungen von Rockstar empfehlen als Minimum ein Intel Core i5 2500"}, {"id": 283, "start": 2051.96, "end": 2060.2, "text": "oder einen AMD FX6300 sowie ein 720p mit 25 PS laufen, aber das menschliche Auge sieht"}, {"id": 284, "start": 2060.2, "end": 2061.2, "text": "ja ähnlich aus."}, {"id": 285, "start": 2061.2, "end": 2068.2, "text": "Das sieht aber echt schick aus."}, {"id": 286, "start": 2068.2, "end": 2090.16, "text": "Das braucht auch kein Fick, ich habe nicht mal ein 4K-Monitor hier im Arbeitszimmer stehen."}, {"id": 287, "start": 2090.16, "end": 2095.64, "text": "Als Orientierungshilfe und zum besseren Anpassen der Spieldetails bietet Red Dead 2 aber einen"}, {"id": 288, "start": 2095.64, "end": 2096.96, "text": "internen Benchmark."}, {"id": 289, "start": 2096.96, "end": 2101.2, "text": "Der simuliert zwar nicht alle möglichen Situationen, ist deshalb noch kein Garant dafür, dass"}, {"id": 290, "start": 2101.2, "end": 2106.56, "text": "das Spiel tatsächlich immer rund läuft, zum Rumexperimentieren und als Erstanhaltspunkt"}, {"id": 291, "start": 2106.56, "end": 2108.2, "text": "ist der Benchmark aber sehr nützlich."}, {"id": 292, "start": 2108.2, "end": 2112.96, "text": "So schön das übrigens ist, dass man so viel einstellen kann, so ärgerlich ist es, dass"}, {"id": 293, "start": 2112.96, "end": 2117.76, "text": "die Erklärungen dazu teilweise sehr kryptisch ausfallen und es keine Beispielbilder gibt"}, {"id": 294, "start": 2117.76, "end": 2119.76, "text": "wie bei den Spielen von Ubisoft."}, {"id": 295, "start": 2119.76, "end": 2129.8, "text": "Vor allem die Deutschen, ja, kein Mensch kann sich was unter Blick, Feld, Umgebungsverdeckung"}, {"id": 296, "start": 2129.8, "end": 2130.8, "text": "was vorstellen."}, {"id": 297, "start": 2130.8, "end": 2141.76, "text": "Nahegelegene Volumetrieauflösung."}, {"id": 298, "start": 2141.76, "end": 2150.0, "text": "Wir reden hier von der Speerspitze der Spieleentwickler und die haben ja auch ein bisschen Vorbildfunktion."}, {"id": 299, "start": 2150.0, "end": 2152.0, "text": "Krass Details, das versteht man wenigstens."}, {"id": 300, "start": 2152.0, "end": 2156.18, "text": "Aber drei Punkte sind bei den Grafikoptionen besonders wichtig und hoffentlich für euch"}, {"id": 301, "start": 2156.18, "end": 2157.18, "text": "auch hilfreich."}, {"id": 302, "start": 2157.18, "end": 2161.44, "text": "Erstens stellt das Spiel immer auf Vollbild und nicht auf rahmenloses Fenster."}, {"id": 303, "start": 2161.44, "end": 2165.4, "text": "Im richtigen Vollbild lief das Spiel bei unseren Tests nämlich schlagartig besser."}, {"id": 304, "start": 2165.4, "end": 2171.4, "text": "Zweitens probiert unbedingt mal beide angebotenen Grafik-Schnittstellen aus, also DirectX 12"}, {"id": 305, "start": 2171.4, "end": 2172.4, "text": "und Vulcan."}, {"id": 306, "start": 2172.4, "end": 2177.28, "text": "Denn während Vulcan durchaus für höhere durchschnittliche Bildraten sorgen kann,"}, {"id": 307, "start": 2177.28, "end": 2183.2, "text": "kommt es bei DirectX 12 zu weniger Frameraten-Einbrüchen, zumindest soweit wir das von unseren Hardware-Tests"}, {"id": 308, "start": 2183.2, "end": 2184.2, "text": "sagen können."}, {"id": 309, "start": 2184.2, "end": 2189.64, "text": "Und auch hier gilt, jedes System ist anders, bei PCs gibt es keine immer gleich geltenden"}, {"id": 310, "start": 2189.64, "end": 2191.88, "text": "Leistungsangaben, nur Annäherungen."}, {"id": 311, "start": 2191.88, "end": 2195.16, "text": "Ihr müsst also am Ende stets selbst testen und ein bisschen herumprobieren."}, {"id": 312, "start": 2195.16, "end": 2200.8, "text": "Und drittens, den stärksten Einfluss auf die Performance haben Detaileinstellungen,"}, {"id": 313, "start": 2200.8, "end": 2206.88, "text": "die sich um die Schattendarstellung, Wasserqualität, die Reflektionen und die volumetrische Beleuchtung"}, {"id": 314, "start": 2206.88, "end": 2207.88, "text": "drehen."}, {"id": 315, "start": 2207.88, "end": 2212.52, "text": "Schatten und Gedürntes mache ich eh immer ein bisschen runter, weil es macht auf den"}, {"id": 316, "start": 2212.52, "end": 2218.48, "text": "ersten Blick meistens keinen großen Unterschied und läuft halt meistens dann auch direkt"}, {"id": 317, "start": 2218.48, "end": 2219.48, "text": "viel besser."}, {"id": 318, "start": 2219.48, "end": 2224.64, "text": "Weiterer wichtiger Punkt übrigens noch, installiert das rund 110 GB große Spiel unbedingt auf"}, {"id": 319, "start": 2224.64, "end": 2225.64, "text": "eine SSD-Festplatte."}, {"id": 320, "start": 2225.64, "end": 2226.64, "text": "Wie groß ist es?"}, {"id": 321, "start": 2226.64, "end": 2229.04, "text": "Habe ich 10 oder 110?"}, {"id": 322, "start": 2229.04, "end": 2232.04, "text": "Übrigens noch, installiert das rund 110 GB große Spiel unbedingt auf eine SSD-Festplatte."}, {"id": 323, "start": 2232.04, "end": 2233.04, "text": "110?"}, {"id": 324, "start": 2233.04, "end": 2235.84, "text": "Alter, warum sind die Games heute alle so groß?"}, {"id": 325, "start": 2235.84, "end": 2241.44, "text": "Auf eine SSD-Festplatte, das verringert nicht nur die Ladezeit."}, {"id": 326, "start": 2241.44, "end": 2246.12, "text": "Mal ganz davon abgesehen, mal ehrlich Leute, das Game hat 110 und Modern Warfare hat auch"}, {"id": 327, "start": 2246.12, "end": 2247.12, "text": "110."}, {"id": 328, "start": 2247.12, "end": 2253.52, "text": "Festplatten kostet nichts mehr, ja, aber so Games hat man am liebsten auf der SSD."}, {"id": 329, "start": 2253.52, "end": 2257.84, "text": "Auch während des Spielens viele störende Ruggler und ladet euch natürlich die neuesten"}, {"id": 330, "start": 2257.84, "end": 2260.64, "text": "Grafikkartentreiber für eure Hardware herunter."}, {"id": 331, "start": 2260.64, "end": 2261.64, "text": "Muss doch mal die neue SSD einbauen."}, {"id": 332, "start": 2261.64, "end": 2265.52, "text": "Für einige Spieler war auch der Release von Red Dead Redemption 2 auf dem PC ein bisschen"}, {"id": 333, "start": 2265.52, "end": 2270.52, "text": "monsterhaft, denn wie schon erwähnt hatte Rockstar Probleme mit dem obligatorischen"}, {"id": 334, "start": 2270.52, "end": 2276.12, "text": "Rockstar Games Launcher, ein Zusatzprogramm, das ihr installieren müsst, egal wo ihr Red"}, {"id": 335, "start": 2276.12, "end": 2282.16, "text": "Dead 2 kauft, was ab Dezember dann übrigens auch Steam als Kaufmöglichkeit mit einschließt."}, {"id": 336, "start": 2282.16, "end": 2288.12, "text": "Jetzt zum Release gibt es die PC-Version nur über den Epic Store oder halt direkt im Rockstar"}, {"id": 337, "start": 2288.12, "end": 2289.12, "text": "Games Launcher."}, {"id": 338, "start": 2289.12, "end": 2293.52, "text": "Die meisten Bugs des Launchers scheinen aber schon mit ganz schnell nachgereichten Updates"}, {"id": 339, "start": 2293.52, "end": 2297.88, "text": "gehoben worden zu sein und soweit sich das Feedback im Netz überblicken lässt, ist Red"}, {"id": 340, "start": 2297.88, "end": 2299.48, "text": "Dead 2 auf dem PC kein zweites GTA 4."}, {"id": 341, "start": 2299.48, "end": 2303.6, "text": "Wie bei meinen Gigarbeiten dafür geile Grafik, ich bezweifle, dass das was mit einer zu"}, {"id": 342, "start": 2303.6, "end": 2304.6, "text": "tun hat."}, {"id": 343, "start": 2304.6, "end": 2306.6, "text": "Es gibt also keine flächendeckenden Hardware-Konfigurationen, auf denen das Spiel den Dienst verweigert,"}, {"id": 344, "start": 2306.6, "end": 2307.6, "text": "was man nicht leicht verboten kann."}, {"id": 345, "start": 2307.6, "end": 2309.04, "text": "Ich kann den Scheiß ja auch komprimieren ein bisschen."}, {"id": 346, "start": 2309.04, "end": 2314.28, "text": "Ich weiß noch, als die Parteiten voll damals 50 GB Audio installiert haben, weil sie kein"}, {"id": 347, "start": 2314.28, "end": 2315.84, "text": "Bock hatten ihr Audio zu komprimieren."}, {"id": 348, "start": 2315.84, "end": 2343.36, "text": "Eine PC-Testversion vor der Veröffentlichung des Spiels herausgegeben, mit der man das"}, {"id": 349, "start": 2343.36, "end": 2350.04, "text": "Spiel nicht so einfach machen kann, wie bei den anderen Spielen, die man nicht so einfach"}, {"id": 350, "start": 2350.04, "end": 2351.04, "text": "machen kann."}, {"id": 351, "start": 2351.04, "end": 2353.04, "text": "Aber das Spiel ist nicht so einfach wie bei den anderen Spielen, wobei ein finniger Spieler"}, {"id": 352, "start": 2353.04, "end": 2354.04, "text": "schon die Doppel-Grafikkarten-Lösung unter Walken mit einem älteren Nvidia-Triver zum"}, {"id": 353, "start": 2354.04, "end": 2355.04, "text": "Laufen gebracht hat."}, {"id": 354, "start": 2355.04, "end": 2356.04, "text": "Allerdings kann es dann zu Grafikfehlern kommen und die Fremdratenausbeute ist auch eher"}, {"id": 355, "start": 2356.04, "end": 2357.04, "text": "bescheiden."}, {"id": 356, "start": 2357.04, "end": 2359.6, "text": "Was es auch nicht offiziell gibt, ist Mod-Support."}, {"id": 357, "start": 2359.6, "end": 2363.16, "text": "Es sieht so aus, als würde es bei Red Dead Redemption 2 auf eine ähnliche Situation"}, {"id": 358, "start": 2363.16, "end": 2365.12, "text": "wie bei GTA 5 hinauslaufen."}, {"id": 359, "start": 2365.12, "end": 2370.04, "text": "Die Benutzung ist also auf eigene Gefahr, inklusive Banngefahr für Red Dead Online."}, {"id": 360, "start": 2370.04, "end": 2372.0, "text": "Erste Mods gibt es übrigens schon."}, {"id": 361, "start": 2372.0, "end": 2374.04, "text": "Aber kommen wir mal zur Steuerung."}, {"id": 362, "start": 2374.04, "end": 2377.04, "text": "Mit dem Gamepad funktioniert die am PC natürlich genau."}, {"id": 363, "start": 2377.04, "end": 2381.96, "text": "Warum bietet man Schnittstellen für Mods an, aber sagt dann, man darf die Mods nicht"}, {"id": 364, "start": 2381.96, "end": 2382.96, "text": "verwenden?"}, {"id": 365, "start": 2382.96, "end": 2385.88, "text": "Das verstehe ich nicht, das habe ich bei GTA auch nicht verstanden."}, {"id": 366, "start": 2385.88, "end": 2390.2, "text": "Da muss man wahrscheinlich tiefer in der Materie sein, dass man diesen Big Brain Move kapiert."}, {"id": 367, "start": 2390.2, "end": 2392.92, "text": "Wir bieten Schnittstellen an, lassen die Leute Mods machen, aber die Mods darf man nicht"}, {"id": 368, "start": 2392.92, "end": 2393.92, "text": "verwenden."}, {"id": 369, "start": 2393.92, "end": 2394.92, "text": "Hä?"}, {"id": 370, "start": 2394.92, "end": 2396.84, "text": "Genauso wie auf der Konsole."}, {"id": 371, "start": 2396.84, "end": 2401.8, "text": "Dank guter Zielunterstützung ist der schon aus den ersten Red Dead Redemption berühmte"}, {"id": 372, "start": 2401.8, "end": 2405.96, "text": "Headshot-Flip mit dem Gamepad genauso komfortabel wie das Quick Aim."}, {"id": 373, "start": 2405.96, "end": 2406.96, "text": "Weiß ich nicht."}, {"id": 374, "start": 2406.96, "end": 2409.08, "text": "Wie machen das die Leute denn dann?"}, {"id": 375, "start": 2409.08, "end": 2411.36, "text": "Hexen die da irgendwie Beine read das Game, oder wie?"}, {"id": 376, "start": 2411.36, "end": 2415.92, "text": "Red Dead Redemption wird Red Dead 2 aber erst mit Maus und Tastatur."}, {"id": 377, "start": 2415.92, "end": 2420.52, "text": "Und hier hat sich Rockstar wirklich Mühe bei der Umsetzung gegeben."}, {"id": 378, "start": 2420.52, "end": 2425.6, "text": "Die Steuerung ist zwar wie schon in der Konsolenversion grundsätzlich etwas überladen und nicht"}, {"id": 379, "start": 2425.6, "end": 2429.12, "text": "immer konsequent, beispielsweise wie hier, wo wir die Waffe mit einer anderen Taste"}, {"id": 380, "start": 2429.12, "end": 2434.28, "text": "einsammeln als den Hut, aber besonders die Kämpfe machen ohne automatische Zielhilfen"}, {"id": 381, "start": 2434.28, "end": 2438.8, "text": "dank voller Mauskontrolle sehr viel Spaß und fühlen sich längst nicht mehr so trinkend"}, {"id": 382, "start": 2438.8, "end": 2439.8, "text": "wie beim Gamepad an."}, {"id": 383, "start": 2439.8, "end": 2443.56, "text": "Also das Spiel ist ja komplett NA-Aim, wenn man es mal so sieht."}, {"id": 384, "start": 2443.56, "end": 2447.88, "text": "Verliert Red Dead 2 ein bisschen von seiner grundsätzlichen und für Rockstar-Spiele typischen"}, {"id": 385, "start": 2447.88, "end": 2451.04, "text": "Trägheit, wenn man es mit Maus und Tastatur spielt."}, {"id": 386, "start": 2451.04, "end": 2455.16, "text": "Zudem sorgen viele Einstellungsmöglichkeiten dafür, dass man die Spielerfahrungen sehr"}, {"id": 387, "start": 2455.16, "end": 2458.24, "text": "nach den eigenen Wünschen und Vorstellungen anpassen kann."}, {"id": 388, "start": 2458.24, "end": 2463.24, "text": "Und da sind das freie Neukonfigurieren von Tasten, Field-of-View-Einstellungen und eine"}, {"id": 389, "start": 2463.24, "end": 2467.8, "text": "Option für eine ruhigere First-Person-Kamera-Darstellung nur der Anfang."}, {"id": 390, "start": 2467.8, "end": 2470.88, "text": "Ihr könnt beispielsweise auch festlegen, wie viel und ob ihr überhaupt Zielhilfen"}, {"id": 391, "start": 2470.88, "end": 2471.88, "text": "haben wollt."}, {"id": 392, "start": 2471.88, "end": 2474.8, "text": "Das ist aber schön, dass es relativ viele Optionen gibt, das hat ja bei PC-Umsetzungen"}, {"id": 393, "start": 2474.8, "end": 2481.6, "text": "oftmals ein bisschen hinten anstehen, die machen dann so 3-4 Alibi-Optionen rein und"}, {"id": 394, "start": 2481.6, "end": 2482.6, "text": "das war's dann."}, {"id": 395, "start": 2482.6, "end": 2486.12, "text": "So wirklich umfangreiche Optionen hast du ja selten, wenn die Spiele zuerst auf der"}, {"id": 396, "start": 2486.12, "end": 2487.12, "text": "Konsole rausgekommen sind."}, {"id": 397, "start": 2487.12, "end": 2491.04, "text": "Glück gibt es auch kein nerviges Tastengehämmer beim Rennen oder Galoppieren."}, {"id": 398, "start": 2491.04, "end": 2495.6, "text": "Hier wurden die verschiedenen Geschwindigkeitsoptionen so clever eingebaut, dass man am Ende manchmal"}, {"id": 399, "start": 2495.6, "end": 2497.48, "text": "nur noch eine Taste gedrückt hält."}, {"id": 400, "start": 2497.48, "end": 2501.96, "text": "Auch der Waffenwechsel und das Ausrüstungsmenü funktionieren super mit Maus und Tastatur."}, {"id": 401, "start": 2501.96, "end": 2505.76, "text": "Schneller Waffenwechsel läuft übers Mausrad und wenn man tapp gedrückt hält, bleibt das"}, {"id": 402, "start": 2505.76, "end": 2508.92, "text": "Ausrüstungsmenü geöffnet und man kann in Ruhe hin und her steigen."}, {"id": 403, "start": 2508.92, "end": 2513.6, "text": "Ich werd's mir trotzdem nicht holen, wie gesagt, so Games ist einfach nix für mich."}, {"id": 404, "start": 2513.6, "end": 2515.88, "text": "Nur ein Detail ist wirklich etwas nervig."}, {"id": 405, "start": 2515.88, "end": 2520.8, "text": "Im Inventar muss man doch noch die Pfeiltasten drücken, um zwischen Items hin und her zu"}, {"id": 406, "start": 2520.8, "end": 2523.24, "text": "wechseln und ihre Beschreibung zu sehen."}, {"id": 407, "start": 2523.24, "end": 2527.48, "text": "Wenn man nur mit der Maus draufklickt, wird das Item sofort benutzt, es gibt also keine"}, {"id": 408, "start": 2527.48, "end": 2529.04, "text": "Maus-Over-Funktion."}, {"id": 409, "start": 2529.04, "end": 2531.52, "text": "Hoffentlich patched Rockstar das noch nach."}, {"id": 410, "start": 2531.52, "end": 2533.68, "text": "So und jetzt bleiben nur noch die Fragen offen."}, {"id": 411, "start": 2533.68, "end": 2538.16, "text": "Welche denn nun die beste Version von Red Dead 2 ist und ob es sich lohnt das Spiel"}, {"id": 412, "start": 2538.16, "end": 2542.72, "text": "nochmal auf dem PC zu spielen, wenn man die Konsolenfassung schon durch hat."}, {"id": 413, "start": 2542.72, "end": 2547.16, "text": "Auch wenn das letztlich natürlich von vielen subjektiven Faktoren abhängt, so ist technisch"}, {"id": 414, "start": 2547.16, "end": 2552.64, "text": "gesehen die PC-Fassung aktuell die beste Fassung des Spiels, gute Hardware vorausgesetzt."}, {"id": 415, "start": 2552.64, "end": 2557.84, "text": "Und wer gerne mit Maus und Tastatur spielt, kommt um diese Version sowieso nicht umher."}, {"id": 416, "start": 2557.84, "end": 2562.84, "text": "Insgesamt ist das also trotz einiger Detailschwächen ein wirklich guter PC-Port."}, {"id": 417, "start": 2562.84, "end": 2567.68, "text": "Wenn Red Dead 2 mit 60 FPS oder mehr flüssig läuft und man mit Maus und Tastatur flott"}, {"id": 418, "start": 2567.68, "end": 2573.04, "text": "und bequem steuern kann, wie ist die Main-Story, lohnt sich das?"}, {"id": 419, "start": 2573.04, "end": 2576.52, "text": "Angenommen man spielt das Spiel jetzt nicht, um großartig 3 Stunden durch die Open World"}, {"id": 420, "start": 2576.52, "end": 2578.16, "text": "zu reiten und macht nur die Main-Quest."}, {"id": 421, "start": 2578.16, "end": 2581.0, "text": "Wohnt sich das dann?"}, {"id": 422, "start": 2581.0, "end": 2582.16, "text": "Nicht wirklich, oder?"}, {"id": 423, "start": 2582.16, "end": 2586.6, "text": "Erste Hälfte, okay."}, {"id": 424, "start": 2586.6, "end": 2598.12, "text": "Doch, hier ist es sehr gestreckt."}, {"id": 425, "start": 2598.12, "end": 2605.8, "text": "30 FPS."}, {"id": 426, "start": 2605.8, "end": 2613.64, "text": "Dazu kann ich nur sagen, wenn sich die Xbox One Leute für 30 FPS feiern."}, {"id": 427, "start": 2613.64, "end": 2617.36, "text": "Da können wir mehr bieten."}, {"id": 428, "start": 2617.36, "end": 2620.88, "text": "...mal die PC-Fassung in 60 FPS erlebt hat."}, {"id": 429, "start": 2620.88, "end": 2622.6, "text": "Das ist bei Red Dead ganz anders."}, {"id": 430, "start": 2622.6, "end": 2627.08, "text": "Wenn man hier auf die Xbox One X zurückwechselt, sorgt die flüssige Bilddarstellung eher"}, {"id": 431, "start": 2627.08, "end": 2631.8, "text": "für Verwunderung und Respekt vor dem, was Rockstar da schon vor einem Jahr auf die Konsolen"}, {"id": 432, "start": 2631.8, "end": 2632.8, "text": "gebracht hat."}, {"id": 433, "start": 2632.8, "end": 2639.32, "text": "Crossplay oder Cross-Safe zwischen PC, PS4 und Xbox One gibt es übrigens nicht."}, {"id": 434, "start": 2639.32, "end": 2643.44, "text": "Ihr könnt also nicht euren Speicherstand von den Konsolen jetzt auf den PC rüber holen"}, {"id": 435, "start": 2643.44, "end": 2644.44, "text": "oder umgehen."}, {"id": 436, "start": 2644.44, "end": 2648.88, "text": "Und genauso wenig könnt ihr Red Dead Online zusammen mit Konsolenspielern erleben."}, {"id": 437, "start": 2648.88, "end": 2653.8, "text": "In Sachen inhaltlicher Qualität ist Red Dead 2 natürlich in jedem Fall eine Empfehlung,"}, {"id": 438, "start": 2653.8, "end": 2655.36, "text": "egal ob auf PC oder Konsole."}, {"id": 439, "start": 2655.36, "end": 2658.8, "text": "Ich meine, das Wasser hier, das sieht wirklich cool aus, ja."}, {"id": 440, "start": 2658.8, "end": 2662.68, "text": "Vor allem auch mit den Wellen, so wenn man da durchkommt, das ist wirklich cool."}, {"id": 441, "start": 2662.68, "end": 2665.52, "text": "Schaut euch mal an, das zieht auch so ein bisschen Wellen hinterher, das ist wirklich"}, {"id": 442, "start": 2665.52, "end": 2666.52, "text": "hübsch gemacht."}, {"id": 443, "start": 2666.52, "end": 2667.52, "text": "Kann man nix sagen."}, {"id": 444, "start": 2667.52, "end": 2672.52, "text": "So, das war's zur PC-Version von Red Dead Redemption 2."}, {"id": 445, "start": 2672.52, "end": 2676.96, "text": "Wenn ihr mehr über die Story, die Mechaniken und das allgemeine Spiel wissen wollt, schaut"}, {"id": 446, "start": 2676.96, "end": 2682.0, "text": "euch gerne noch unser klassisches Test-Video zur Konsolen-Version an, da sind alle diese"}, {"id": 447, "start": 2682.0, "end": 2683.0, "text": "Themen bereits enthalten."}, {"id": 448, "start": 2683.0, "end": 2684.0, "text": "Warum?"}, {"id": 449, "start": 2684.0, "end": 2688.68, "text": "Warum hat diese Brücke, warum hat diese Brücke eine Überdach, also warum ist da ein Dach"}, {"id": 450, "start": 2688.68, "end": 2689.68, "text": "über der Brücke?"}, {"id": 451, "start": 2689.68, "end": 2691.68, "text": "Hat doch überhaupt keinen Sinn eigentlich, oder?"}, {"id": 452, "start": 2691.68, "end": 2695.48, "text": "Davor ist kein Dach, dahinter ist kein Dach, davor ist nichts, dahinter ist nichts."}, {"id": 453, "start": 2695.48, "end": 2698.48, "text": "Warum hat die ein Dach?"}, {"id": 454, "start": 2698.48, "end": 2723.48, "text": "Da sind alle diese Themen bereits enthalten."}, {"id": 455, "start": 1721.42, "end": 2743.92, "text": "das ist einfach nicht meins, ja, weiß ich nicht, das Spiel ist bestimmt geil,"}, {"id": 456, "start": 2743.92, "end": 2744.92, "text": "aber das ist nix für mich."}, {"id": 457, "start": 2744.92, "end": 2750.4, "text": "Wie gesagt, das einzige Open-World-Game in letzter Zeit, was mir Spaß gemacht hat, war"}, {"id": 458, "start": 2750.4, "end": 2751.4, "text": "The Witcher 3."}, {"id": 459, "start": 2751.4, "end": 2757.0, "text": "Habt ihr übrigens mal gesehen, wie kacke das Spiel auf der Switch aussieht, so richtig"}, {"id": 460, "start": 2757.0, "end": 2761.76, "text": "kacke sieht Witcher auf der Switch aus, sieht aus wie ein Gamecube-Spiel."}, {"id": 461, "start": 2761.76, "end": 2779.16, "text": "So, jetzt gucken wir jetzt, Microsoft Office 3.0 auf Windows 10, oder wollen wir lieber"}, {"id": 462, "start": 2779.16, "end": 2786.64, "text": "eine Throwing-Knife-Nuke gucken, oder wollen wir uns Linux angucken von vor 20 Jahren?"}, {"id": 463, "start": 2786.64, "end": 2793.56, "text": "Ja, ja, Witcher 3 hab ich gespielt, Witcher 3 inklusive The Announcers, das war ein Open-World-Spiel,"}, {"id": 464, "start": 2793.56, "end": 2795.16, "text": "das hat mir gefallen, das war richtig gut."}, {"id": 465, "start": 2795.16, "end": 2801.52, "text": "Aber gerade, weil die Witcher 3 Hauptstory einen so durch die Welt geführt hat, und"}, {"id": 466, "start": 2801.52, "end": 2806.12, "text": "man konnte natürlich ein bisschen erkunden, aber die Hauptstory war richtig gut und es"}, {"id": 467, "start": 2806.12, "end": 2808.52, "text": "hat gereicht, wenn man der Hauptstory folgt im Endeffekt."}, {"id": 468, "start": 2808.52, "end": 2826.6, "text": "Ich mein, ich weiß eh schon, wie das läuft, der macht 5 Kills, der macht 7 Kills und dann"}, {"id": 469, "start": 2826.6, "end": 2830.32, "text": "ist Harrier Chopper Gunner am Start, easy."}, {"id": 470, "start": 2830.32, "end": 2834.8, "text": "Was denn eigentlich deine Lieblings-YouTuber, kannst du ein paar empfehlen?"}, {"id": 471, "start": 2834.8, "end": 2843.08, "text": "Es ist immer schwierig es aus dem Kopf zu sagen, ich guck mal gerade auf meine Startseite,"}, {"id": 472, "start": 2843.08, "end": 2846.48, "text": "wer so empfohlen wird, wen hab ich denn hier so?"}, {"id": 473, "start": 2846.48, "end": 2863.84, "text": "Ich scroll grad mal durch, da müsst ich mir echt mal Gedanken machen, ich guck wenig"}, {"id": 474, "start": 2863.84, "end": 2864.84, "text": "irgendwie."}, {"id": 475, "start": 2864.84, "end": 2872.6, "text": "Ich guck halt jede Menge Technik, Konferenz-Talks und sowas, aber da guck ich einfach sowas,"}, {"id": 476, "start": 2872.6, "end": 2875.48, "text": "was mir YouTube empfiehlt, beziehungsweise was so aktuelle Sachen gibt."}, {"id": 477, "start": 2875.48, "end": 2890.24, "text": "Ich guck grad da durch, achso, doch, also ein, wo ich immer, ein den ich immer gucke,"}, {"id": 478, "start": 2890.24, "end": 2891.24, "text": "ist der hier."}, {"id": 479, "start": 2891.24, "end": 2899.24, "text": "Den guck ich immer, egal, jedes Video, aber auch so der einzige, wo ich fast jedes Video"}, {"id": 480, "start": 2899.24, "end": 2900.24, "text": "gucke."}, {"id": 481, "start": 2900.24, "end": 2915.84, "text": "Den guck ich immer, was hast du denn da oben für Browser-Plugins, was, wo, da, Duplog,"}, {"id": 482, "start": 2915.84, "end": 2926.68, "text": "so, so, geben wir halt, da."}, {"id": 483, "start": 2926.68, "end": 2931.6, "text": "Achso, also immer wieder..."}, {"id": 484, "start": 2931.6, "end": 2933.56, "text": "Nach visuals."}, {"id": 485, "start": 2933.56, "end": 2934.98, "text": "Selbstballs..."}, {"id": 486, "start": 2934.98, "end": 2938.7, "text": "Salut, Hégun kann dasivable sein."}, {"id": 487, "start": 2938.7, "end": 2947.7, "text": "machen weil wir machen ja eh grad nix. Okay, Throwing Knife Nuke. Emotes. Ja. Emotes."}, {"id": 488, "start": 2947.7, "end": 2956.38, "text": "Richtig egal. Ich mach nachher das... Ich mach da echt ein Gift raus. Oder Scheibenwischer"}, {"id": 489, "start": 2956.38, "end": 2968.66, "text": "so hin und her geht, sodass es geloopt ist. So, gucken wir uns das mal an. Wie gesagt"}, {"id": 490, "start": 2968.66, "end": 2973.9, "text": "Harrier Chopper Gunner Nuke. Easy. Wieso kein better Twitch TV? Weil FFZ mittlerweile"}, {"id": 491, "start": 2973.9, "end": 2974.9, "text": "besser ist."}, {"id": 492, "start": 2974.9, "end": 2990.38, "text": "Why is this just my life? Can someone explain this to me?"}, {"id": 493, "start": 2990.38, "end": 3003.54, "text": "Alter, ist ja gut. Fick dich ab. Seit wann hat er denn Intro?"}, {"id": 494, "start": 3003.54, "end": 3012.54, "text": "Magst du die Videos von Alter viel? Ja, die guck ich auch gern."}, {"id": 495, "start": 3012.54, "end": 3032.74, "text": "Hatte man da eins oder zwei? Eins, ne? Ein Messer. Aber mit Scavenger konnte man das"}, {"id": 496, "start": 3032.74, "end": 3042.78, "text": "auffüllen. Hab ich da gar nicht mehr dran erinnert, richtig? Oder Kitwechsel. Genau,"}, {"id": 497, "start": 3042.78, "end": 3048.74, "text": "da hat man es auch aufgefüllt bekommen."}, {"id": 498, "start": 3048.74, "end": 3051.9, "text": "Harrier Chopper Gunner Instant Nuke. Easy."}, {"id": 499, "start": 3051.9, "end": 3066.18, "text": "Hör mal ehrlich, die Nuke in MW2 war zu leicht. Er hat geschossen. Das ist keine"}, {"id": 500, "start": 3066.18, "end": 3089.14, "text": "Strong Knife Nuke. Was macht die ganzen NoobTube Leute noch in MW2? Das war damals schon dumm"}, {"id": 501, "start": 3089.14, "end": 3104.46, "text": "und jetzt ist es doppelt dumm zu NoobTube in MW2. Boosten die? Wir haben geboostet. 2018"}, {"id": 502, "start": 3104.46, "end": 3109.02, "text": "2019 in MW2 wird geboostet. Alter, was mit den Leuten los? Warum?"}, {"id": 503, "start": 3109.02, "end": 3138.58, "text": "Erstmal alles Folge. Kennt ihr noch die Typen, die Search and Destroy"}, {"id": 504, "start": 3138.58, "end": 3142.74, "text": "gespielt haben und den letzten Kill über erst mal drei Stunden gestunt haben, dass"}, {"id": 505, "start": 3142.74, "end": 3145.26, "text": "sie Last Nice mit der Sniper machen konnten?"}, {"id": 506, "start": 3145.26, "end": 3171.54, "text": "Er hat selber gekillt. Der Gegner, Alter, ist der dumm."}, {"id": 507, "start": 3171.54, "end": 3183.26, "text": "Oh, oh, oh, oh."}, {"id": 508, "start": 3183.26, "end": 3203.18, "text": "Wo ist er? WTF? Oh, die Gegner sind so dämlich."}, {"id": 509, "start": 3203.18, "end": 3219.7, "text": "Oh, oh, oh, oh, oh, oh."}, {"id": 510, "start": 3219.7, "end": 3239.66, "text": "Weißt ihr, was das witzige ist? Es ist 2019 und wir gucken MW2-Videos anstatt MWV-Videos."}, {"id": 511, "start": 3239.66, "end": 3253.66, "text": "Okay, schonmal die richtige Richtung und dann killt er sich nicht selbst."}, {"id": 512, "start": 3253.66, "end": 3265.52, "text": "Ja, er hat es easy nuked, easy nuked. Das Schwierige in MW2 war ja im Prinzip nur"}, {"id": 513, "start": 3265.52, "end": 3270.94, "text": "den Harrier-Jopper-Gunner zu kriegen. Die Nukes an sich waren viel zu einfach. Du hattest"}, {"id": 514, "start": 3270.94, "end": 3276.9, "text": "ja jedes vierte Game oder jedes fünfte Game ein Nuke, wenn du dich wirklich angestrengt"}, {"id": 515, "start": 3276.9, "end": 3280.34, "text": "hast. Und auch die passenden Lobbies."}, {"id": 516, "start": 3280.34, "end": 3310.1, "text": "Oh, jetzt freut er sich. Jetzt müssen wir mal gucken, ob er ein Messer hat. Nur, nur"}, {"id": 517, "start": 3310.1, "end": 3318.74, "text": "wenn er messert, nur wenn er messert, ist das Valet-Nuke. Jawoll, Valet zählt, akzeptiert."}, {"id": 518, "start": 3318.74, "end": 3333.98, "text": "So, und jetzt gucken wir uns an Microsoft Office 3.0, wobei, das haben wir uns das letzte"}, {"id": 519, "start": 3333.98, "end": 3347.1, "text": "Mal doch schon angeguckt, oder? Linux von 2020, alles KDE. Wir gucken uns jetzt mal"}, {"id": 520, "start": 3347.1, "end": 3349.02, "text": "Office 3.0 und Windows 10 an."}, {"id": 521, "start": 3349.02, "end": 3367.9, "text": "Das erste Ubuntu haben wir uns angeschaut. Stimmt, stimmt. Jibuntu."}, {"id": 522, "start": 3367.9, "end": 3397.66, "text": "Einer Rappetler, drei Monate. Nein, schon. Gar kein Prime. Richtig echter, huge"}, {"id": 523, "start": 3397.66, "end": 3407.18, "text": "Star. Mein Q des Chats ist heute wieder sowas von weit vorne. Nice. Pock. Moment, wo ist"}, {"id": 524, "start": 3407.18, "end": 3408.18, "text": "eigentlich mein Immort dazu?"}, {"id": 525, "start": 3408.18, "end": 3428.54, "text": "Und der Grund, warum ich hier auf dieser Seite bin, ist, weil ich euch zeigen möchte, wo ihr"}, {"id": 526, "start": 3428.54, "end": 3449.8, "text": "circular"}, {"id": 527, "start": 3449.8, "end": 3456.08, "text": "Wenn wir den Compatibility-Mode erwerben können, werden wir das Windows 985 herunterladen."}, {"id": 528, "start": 3456.08, "end": 3457.6, "text": "Ich glaube nicht, dass das funktioniert."}, {"id": 529, "start": 3457.6, "end": 3459.96, "text": "Wir müssen eigentlich das NT-Mode herunterladen."}, {"id": 530, "start": 3459.96, "end": 3466.32, "text": "Kennen Sie diesen uralt Werbespot für das erste Windows, wo diese Sekretärin dann anfängt zu singen?"}, {"id": 531, "start": 3466.32, "end": 3468.32, "text": "This is Windows 386."}, {"id": 532, "start": 3468.32, "end": 3470.32, "text": "Das ist mega cringe."}, {"id": 533, "start": 3470.32, "end": 3474.76, "text": "Damals waren eh alle IT-Werbespots mega cringe."}, {"id": 534, "start": 3474.76, "end": 3476.76, "text": "Heute ist es umgedreht."}, {"id": 535, "start": 3476.76, "end": 3479.76, "text": "Heute kriegst du auf Twitter immer Werbung."}, {"id": 536, "start": 3479.76, "end": 3487.24, "text": "Von irgendwelchen Ölkonzernen und Energieanbietern, irgendwelchen Stromanbietern,"}, {"id": 537, "start": 3487.24, "end": 3494.08, "text": "die erzählen, dass sie quasi seit Jahrzehnten schon sich dem Umweltschutz verschrieben haben"}, {"id": 538, "start": 3494.08, "end": 3499.0, "text": "und der sauberste Anbieter ever sind und so viel forschen und so viel tun für den Umweltschutz."}, {"id": 539, "start": 3499.0, "end": 3504.2, "text": "Wo ich mir so gedacht habe, das müsst ihr uns jetzt natürlich erzählen, weil ihr so geil seid."}, {"id": 540, "start": 3504.2, "end": 3509.84, "text": "Ausgerechnet die."}, {"id": 541, "start": 3509.84, "end": 3534.48, "text": "Das ist langweilig, da passiert nichts."}, {"id": 542, "start": 3534.48, "end": 3538.48, "text": "Zeichnungsprogramm."}, {"id": 543, "start": 3538.48, "end": 3542.48, "text": "Und da sind wir."}, {"id": 544, "start": 3542.48, "end": 3544.48, "text": "Oh mein Gott, das funktioniert eigentlich."}, {"id": 545, "start": 3544.48, "end": 3554.48, "text": "Microsoft Excel 3.0 von 27 Jahren vorhin hat gerade auf der aktuellsten und größten Version des Windows 10 geöffnet."}, {"id": 546, "start": 3554.48, "end": 3557.48, "text": "Ich meine, das ist verrückt."}, {"id": 547, "start": 3557.48, "end": 3559.48, "text": "Das ist verrückt."}, {"id": 548, "start": 3559.48, "end": 3563.48, "text": "Ich meine, das fact, dass das Ding installiert ist ziemlich beeindruckend, aber das Ding läuft eigentlich."}, {"id": 549, "start": 3563.48, "end": 3566.48, "text": "Und es sieht so aus, als würde es hier aufladen."}, {"id": 550, "start": 3566.48, "end": 3569.48, "text": "Ich weiß nicht, ob wir uns hier komplett kraschen."}, {"id": 551, "start": 3569.48, "end": 3572.48, "text": "Aber ich muss einen großen Schuss an die Autoren der OT-VDM geben,"}, {"id": 552, "start": 3572.48, "end": 3574.48, "text": "denn sie haben definitiv eine tolle Arbeit gemacht."}, {"id": 553, "start": 3574.48, "end": 3576.48, "text": "Es ist tatsächlich Excel, ja."}, {"id": 554, "start": 3576.48, "end": 3578.48, "text": "Soll ich euch mal was sagen?"}, {"id": 555, "start": 3578.48, "end": 3581.48, "text": "Ich habe noch irgendwo eine Office 97 CD."}, {"id": 556, "start": 3581.48, "end": 3584.48, "text": "Da müsste man fast mal ausprobieren, ob der Kram noch funktioniert."}, {"id": 557, "start": 3584.48, "end": 3589.48, "text": "Gut, nee, geht nicht, ich habe kein CD-Laufwerk mehr."}, {"id": 558, "start": 3589.48, "end": 3592.48, "text": "PowerPoint."}, {"id": 559, "start": 3592.48, "end": 3596.48, "text": "Das sieht wirklich aus, alles."}, {"id": 560, "start": 3596.48, "end": 3598.48, "text": "Okay, zeig mal, ich will jetzt mal."}, {"id": 561, "start": 3598.48, "end": 3600.48, "text": "Ja, Word."}, {"id": 562, "start": 3600.48, "end": 3614.48, "text": "Das sieht eher aus wie DOS-Programm, aber es ist eindeutig Word, ja."}, {"id": 563, "start": 3614.48, "end": 3616.48, "text": "Jetzt brauchen wir PowerPoint."}, {"id": 564, "start": 3616.48, "end": 3621.48, "text": "Moment, warte."}, {"id": 565, "start": 3621.48, "end": 3629.48, "text": "Das ist jetzt aber nicht mehr, das ist jetzt aber ein aktuelles."}, {"id": 566, "start": 3629.48, "end": 3635.48, "text": "Sagt man, dass das so grau aussieht, liegt da neben seinen Zetix, oder?"}, {"id": 567, "start": 3635.48, "end": 3641.48, "text": "Ah, langweilig ist es mit, langweilig ist es."}, {"id": 568, "start": 3641.48, "end": 3644.48, "text": "Dinos dauern zu lange."}, {"id": 569, "start": 3644.48, "end": 3655.48, "text": "Schön, dass wir es uns angucken können."}, {"id": 570, "start": 3655.48, "end": 3658.48, "text": "Overwatch doch noch nicht, Overwatch 2 doch noch nicht so gut."}, {"id": 571, "start": 3658.48, "end": 3661.48, "text": "Okay, das müssen wir jetzt noch mal gucken."}, {"id": 572, "start": 3661.48, "end": 3672.48, "text": "Da bin ich mal gespannt, was die Gamestar-Pros, Gamers sagen zu Overwatch 2."}, {"id": 573, "start": 3672.48, "end": 3680.48, "text": "Overwatch 2 kriegt endlich den Story-Modus, den ich mir für den ersten Teil schon wünsche seit dem allerersten."}, {"id": 574, "start": 3680.48, "end": 3682.48, "text": "Videos von dem kann ich mir meistens nicht angucken."}, {"id": 575, "start": 3682.48, "end": 3686.48, "text": "Ich weiß nicht, ich kann nichts dagegen sagen, dass er nicht kompetent wäre oder so."}, {"id": 576, "start": 3686.48, "end": 3694.48, "text": "Aber ich werde manchmal übelst getriggert von Leuten, die gewisse Aussprachen haben."}, {"id": 577, "start": 3694.48, "end": 3698.48, "text": "Ich weiß nicht, ich komme damit nicht klar, wie er die Sachen ausspricht."}, {"id": 578, "start": 3698.48, "end": 3700.48, "text": "Ich kann es nicht erklären."}, {"id": 579, "start": 3700.48, "end": 3703.48, "text": "Denken von mir bestimmt auch genug, Leute."}, {"id": 580, "start": 3703.48, "end": 3706.48, "text": "Ich kenne ihn ja nicht, ich habe ja da nichts gegen."}, {"id": 581, "start": 3706.48, "end": 3708.48, "text": "Ein Enthüllungs-Trailer eigentlich."}, {"id": 582, "start": 3708.48, "end": 3712.48, "text": "Und seither mit jeder weiteren fantastischen Renderssequenz."}, {"id": 583, "start": 3712.48, "end": 3715.48, "text": "Das ist schließlich ein Blizzard-Spiel."}, {"id": 584, "start": 3715.48, "end": 3721.48, "text": "Seit wann erzählen die keine Geschichten?"}, {"id": 585, "start": 3721.48, "end": 3724.48, "text": "Gut, manche mehr, manche weniger."}, {"id": 586, "start": 3724.48, "end": 3728.48, "text": "Aber selbst Hearthstone hatte mehr Singleplayer-Abenteuer als Overwatch."}, {"id": 587, "start": 3728.48, "end": 3734.48, "text": "Und Heroes of the Storm nutzt immerhin Figuren, deren Geschichten halt in anderen Blizzard-Spielen mehr als aus..."}, {"id": 588, "start": 3734.48, "end": 3738.48, "text": "Sag mal, warum sieht Mercy eigentlich immer jünger aus von Video zu Video?"}, {"id": 589, "start": 3738.48, "end": 3742.48, "text": "Die ist ja laut der Story irgendwie 50 oder so."}, {"id": 590, "start": 3742.48, "end": 3745.48, "text": "Findet ihr, dass Mercy aussieht wie 50?"}, {"id": 591, "start": 3745.48, "end": 3746.48, "text": "Ich meine ernsthaft?"}, {"id": 592, "start": 3746.48, "end": 3756.48, "text": "...Nutzt immerhin Figuren, deren Geschichten halt in anderen Blizzard-Spielen mehr als ausführlich erzählt wurden."}, {"id": 593, "start": 3756.48, "end": 3759.48, "text": "Bis auf die Overwatch-Charaktere natürlich."}, {"id": 594, "start": 3759.48, "end": 3765.48, "text": "Die bekamen zwar gelegentlich mal Archive-Events, in denen wir eine Koop-Mission aus ihrer Hintergrundgeschichte gespielt haben."}, {"id": 595, "start": 3765.48, "end": 3768.48, "text": "Aber das war immer nur ein Level."}, {"id": 596, "start": 3768.48, "end": 3771.48, "text": "Und die Story wurde nie nach vorne weitergeführt."}, {"id": 597, "start": 3771.48, "end": 3773.48, "text": "Höchste Zeit also."}, {"id": 598, "start": 3773.48, "end": 3778.48, "text": "Zumal Overwatch mit einem Story-Modus eigentlich das perfekte Shooter-Paket sein könnte."}, {"id": 599, "start": 3778.48, "end": 3781.48, "text": "Es ist bereits ein spielmechanisch exzellentes..."}, {"id": 600, "start": 3781.48, "end": 3784.48, "text": "Aber Brigitte ist eh bestes Overwatch-Grill."}, {"id": 601, "start": 3784.48, "end": 3789.48, "text": "Der Ego-Shooter mit fantastischem Design und einem herausragenden Multiplayer."}, {"id": 602, "start": 3789.48, "end": 3792.48, "text": "Dazu noch eine Story in klassischer Blizzard-Qualität."}, {"id": 603, "start": 3792.48, "end": 3794.48, "text": "Und was will man mehr?"}, {"id": 604, "start": 3794.48, "end": 3798.48, "text": "Aber für Overwatch 2 hängt noch etwas mehr an seinem Story-Modus."}, {"id": 605, "start": 3798.48, "end": 3806.48, "text": "Der muss nämlich beweisen, dass es sich hier überhaupt um eine vollwertige Fortsetzung, ein echtes Overwatch 2 handelt."}, {"id": 606, "start": 3806.48, "end": 3807.48, "text": "Nee, ist es nicht."}, {"id": 607, "start": 3807.48, "end": 3808.48, "text": "Das haben wir doch schon."}, {"id": 608, "start": 3808.48, "end": 3812.48, "text": "Ich weiß genau, Papa Louis, ich glaube das ist auch das, was mir nicht gefällt."}, {"id": 609, "start": 3812.48, "end": 3813.48, "text": "Er betont das so komisch."}, {"id": 610, "start": 3813.48, "end": 3816.48, "text": "Aber ist Geschmackssache."}, {"id": 611, "start": 3816.48, "end": 3818.48, "text": "Das ist kein Overwatch 2 echt."}, {"id": 612, "start": 3818.48, "end": 3821.48, "text": "Das haben wir doch schon in demdings bei dem..."}, {"id": 613, "start": 3821.48, "end": 3822.48, "text": "Wie hieß das?"}, {"id": 614, "start": 3822.48, "end": 3824.48, "text": "In der Opening-Ceremony gesehen."}, {"id": 615, "start": 3824.48, "end": 3828.48, "text": "Ich hab auch gesagt, das ist quasi Overwatch Season 2."}, {"id": 616, "start": 3828.48, "end": 3832.48, "text": "Bloß sie wollen es nicht Season 2 nennen, weil dann die Leute wieder ankommen und so..."}, {"id": 617, "start": 3832.48, "end": 3835.48, "text": "Ah, Blizzard 0 kopiert Fortnite 0 hier, scheiß..."}, {"id": 618, "start": 3835.48, "end": 3836.48, "text": "Ihr kennt ja die Leute."}, {"id": 619, "start": 3838.48, "end": 3841.48, "text": "Das wurde nach der Ankündigung hitzig diskutiert."}, {"id": 620, "start": 3841.48, "end": 3845.48, "text": "Oder genauer gesagt schon davor, als das Spiel geleakt wurde."}, {"id": 621, "start": 3845.48, "end": 3850.48, "text": "Es sieht schließlich fast identisch wie der erste Teil aus und spielt sich auch sehr ähnlich."}, {"id": 622, "start": 3850.48, "end": 3857.48, "text": "So ähnlich sogar, dass Besitzer des original Overwatch direkt zusammen mit Besitzern des zweiten Teils spielen können."}, {"id": 623, "start": 3857.48, "end": 3861.48, "text": "Sie kriegen außerdem alle neuen Multiplayer-Inhalte wie den Push-Modus."}, {"id": 624, "start": 3861.48, "end": 3864.48, "text": "Was ja erst mal nur lobenswert ist."}, {"id": 625, "start": 3864.48, "end": 3871.48, "text": "Aber dann stellt sich doch wirklich die Frage, warum dann überhaupt einen völlig neuen Teil draus machen und keine Erweiterung?"}, {"id": 626, "start": 3871.48, "end": 3872.48, "text": "Weil es eine Erweiterung ist."}, {"id": 627, "start": 3872.48, "end": 3874.48, "text": "Die wollen bloß keine Erweiterung mehr verkaufen, weil sie wahrscheinlich denken..."}, {"id": 628, "start": 3874.48, "end": 3875.48, "text": "Die Antwort hängt..."}, {"id": 629, "start": 3875.48, "end": 3876.48, "text": "Verkaufen..."}, {"id": 630, "start": 3876.48, "end": 3878.48, "text": "Wahrscheinlich denken sie sich, Erweiterungen verkaufen sich nicht so gut."}, {"id": 631, "start": 3878.48, "end": 3880.48, "text": "Das ist Season 2 im Endeffekt."}, {"id": 632, "start": 3880.48, "end": 3881.48, "text": "Am Story-Modus."}, {"id": 633, "start": 3881.48, "end": 3888.48, "text": "Dem großen Flaggschiff-Inhalt von Overwatch 2 und dem wichtigsten Feature, das Besitzer des Originals nicht bekommen."}, {"id": 634, "start": 3888.48, "end": 3890.48, "text": "Der muss also richtig knallen."}, {"id": 635, "start": 3890.48, "end": 3896.48, "text": "Um rauszufinden, ob er das auch tut, habe ich auf der BlizzCon eine Mission daraus selbst gespielt."}, {"id": 636, "start": 3896.48, "end": 3901.48, "text": "Durfte nur nicht aufnehmen, deswegen stammt das hier gezeigte Gameplay aus anderen Quellen."}, {"id": 637, "start": 3901.48, "end": 3904.48, "text": "In den Story-Missionen treten vier Helden im Korb an."}, {"id": 638, "start": 3904.48, "end": 3906.48, "text": "Welche das sind, gibt die Geschichte vor."}, {"id": 639, "start": 3906.48, "end": 3910.48, "text": "In Rio de Janeiro stehen Lucio, Mei, Reinhardt und Tracer zur Wahl."}, {"id": 640, "start": 3910.48, "end": 3915.48, "text": "Die spielen sich grundlegend wie im Multiplayer, aber mit zwei Unterschieden."}, {"id": 641, "start": 3915.48, "end": 3918.48, "text": "Einerseits haben die Entwickler ein wenig am Balancing geschraubt."}, {"id": 642, "start": 3918.48, "end": 3923.48, "text": "Manche für den MP nötigen Einschränkungen braucht es beim gemeinsamen Ballern eben nicht mehr."}, {"id": 643, "start": 3923.48, "end": 3926.48, "text": "Tracer zum Beispiel hat etwas mehr Kugeln im Magazin."}, {"id": 644, "start": 3926.48, "end": 3930.48, "text": "Andererseits passen wir unsere Figuren selbst mit Talenten an."}, {"id": 645, "start": 3930.48, "end": 3934.48, "text": "Ich hab so gehofft, dass das für den Multiplayer kommt."}, {"id": 646, "start": 3937.48, "end": 3942.48, "text": "Ich hoffe echt, und ich weiß nicht, ob das schon bestätigt ist oder debunkt quasi, keine Ahnung."}, {"id": 647, "start": 3942.48, "end": 3948.48, "text": "Das wäre wichtig für das Game, dass sowas im Multiplayer kommt."}, {"id": 648, "start": 3948.48, "end": 3952.48, "text": "Ich mein, klar ist das dann Balancing-mäßig noch schwieriger."}, {"id": 649, "start": 3952.48, "end": 3955.48, "text": "Aber ich mein, als hätte das Overwatch irgendwie jemals mit Balancing gehabt."}, {"id": 650, "start": 3955.48, "end": 3960.48, "text": "Aktuell ist es in Overwatch halt so, du hast, keine Ahnung, 30 Helden."}, {"id": 651, "start": 3960.48, "end": 3964.48, "text": "Davon werden acht gespielt, also sagen wir mal, werden zehn gespielt."}, {"id": 652, "start": 3964.48, "end": 3971.48, "text": "Davon fünf quasi oft und manche so gut wie gar nicht."}, {"id": 653, "start": 3971.48, "end": 3976.48, "text": "Und es ist halt, also entweder braucht Overwatch auch viel, viel mehr Helden,"}, {"id": 654, "start": 3976.48, "end": 3980.48, "text": "dass da ein bisschen Variation reinkommt."}, {"id": 655, "start": 3980.48, "end": 3987.48, "text": "Und das hier könnte halt dazu führen, dass man die Helden anders spielen kann"}, {"id": 656, "start": 3987.48, "end": 3992.48, "text": "auf anderen Positionen, als sie eigentlich gedacht sind."}, {"id": 657, "start": 3992.48, "end": 3996.48, "text": "Wisst ihr, wisst ihr, wie ich meine?"}, {"id": 658, "start": 3996.48, "end": 3999.48, "text": "Ich mein, das passt ja immer noch alles zu Tracer irgendwie, das ist jetzt halt nichts anderes."}, {"id": 659, "start": 3999.48, "end": 4003.48, "text": "Aber dann kann man, das bringt einfach so viele neue Kombinationen und Variationen rein."}, {"id": 660, "start": 4003.48, "end": 4006.48, "text": "Und das ist das, was in Overwatch fehlt."}, {"id": 661, "start": 4006.48, "end": 4010.48, "text": "Overwatch ist viel zu fest im Endeffekt."}, {"id": 662, "start": 4010.48, "end": 4013.48, "text": "Das ist ja auch das, was irgendwie so ein bisschen,"}, {"id": 663, "start": 4013.48, "end": 4015.48, "text": "wenn man jetzt mal zu irgendwelchen MOBAs guckt und so,"}, {"id": 664, "start": 4015.48, "end": 4022.48, "text": "wo du auch Talente hast oder wo du auch verschiedene Item, Level, Geschichten, Skillbäume oder irgendwas hast."}, {"id": 665, "start": 4022.48, "end": 4030.48, "text": "Das muss einfach ein bisschen, da muss mehr Variation und mehr Ideen rein irgendwie."}, {"id": 666, "start": 4030.48, "end": 4035.48, "text": "Und so, dass man beispielsweise Lucio dann vielleicht auch mal als DPS spielen kann"}, {"id": 667, "start": 4035.48, "end": 4038.48, "text": "mit den passenden Talenten, der aber halt vielleicht dann nicht so gut ist wie Tracer,"}, {"id": 668, "start": 4038.48, "end": 4042.48, "text": "aber irgendwas anderes kann, was dann in Kombination wieder super zusammenpasst."}, {"id": 669, "start": 4042.48, "end": 4046.48, "text": "Oder ihr überlegt euch mal rein, hat der Hammer werfen kann, irgendwas."}, {"id": 670, "start": 4046.48, "end": 4050.48, "text": "Du könntest viel schönere Variationen machen."}, {"id": 671, "start": 4050.48, "end": 4058.48, "text": "Und man wird sich nicht davor retten können, dass es irgendwie eins, zwei, höchstens drei Kombis gibt, die OP sind."}, {"id": 672, "start": 4058.48, "end": 4059.48, "text": "Das hast du in jedem Game."}, {"id": 673, "start": 4059.48, "end": 4063.48, "text": "In jedem Game hast du irgendwie so einen Meta."}, {"id": 674, "start": 4063.48, "end": 4069.48, "text": "Also quasi Most Effective Tactics Available, wofür meiner Ansicht nach übrigens Meta steht."}, {"id": 675, "start": 4069.48, "end": 4072.48, "text": "Also das, was einfach am besten funktioniert."}, {"id": 676, "start": 4072.48, "end": 4074.48, "text": "Das hast du in jedem Game irgendwie."}, {"id": 677, "start": 4074.48, "end": 4080.48, "text": "Aber dadurch könntest du irgendwie noch ein bisschen Variation reinbringen."}, {"id": 678, "start": 4080.48, "end": 4083.48, "text": "Das war ja in StarCraft 1 zum Beispiel auch so."}, {"id": 679, "start": 4083.48, "end": 4087.48, "text": "Lange Zeit galt irgendwie..."}, {"id": 680, "start": 4087.48, "end": 4091.48, "text": "Was hat er da beispielsweise?"}, {"id": 681, "start": 4091.48, "end": 4095.48, "text": "Ich überleg gerade, wie war das in StarCraft?"}, {"id": 682, "start": 4095.48, "end": 4099.48, "text": "Genau, in StarCraft 1 war Zerg zum Beispiel auf Home Level übelst scheiße eine ganze Weile."}, {"id": 683, "start": 4099.48, "end": 4103.48, "text": "Also Input war eine ganze Weile, bis dann irgendwann mal einer angefangen hat"}, {"id": 684, "start": 4103.48, "end": 4106.48, "text": "und hat irgendwie neue Lurker Strategies entwickelt damals."}, {"id": 685, "start": 4106.48, "end": 4110.48, "text": "Und ohne Patches waren die auf einmal übelst OP."}, {"id": 686, "start": 4110.48, "end": 4114.48, "text": "Und ein bisschen Variation dadurch ist sicherlich nicht verkehrt."}, {"id": 687, "start": 4114.48, "end": 4119.48, "text": "Ich glaube, das wäre echt gut für das Game, wenn sowas im Multiplayer kommt."}, {"id": 688, "start": 4119.48, "end": 4123.48, "text": "Die Demo zeigte drei Wahlmöglichkeiten zwischen jeweils zwei Fähigkeiten."}, {"id": 689, "start": 4123.48, "end": 4127.48, "text": "Einmal auf Level 1, einmal auf Level 10 und einmal auf Level 20."}, {"id": 690, "start": 4127.48, "end": 4132.48, "text": "Damit wirkt Tracer zum Beispiel Feinden Schaden rein, wenn sie durch sie durch teleportiert"}, {"id": 691, "start": 4132.48, "end": 4136.48, "text": "oder löst mit ihrer Pulsbombe eine Kettenreaktion aus."}, {"id": 692, "start": 4136.48, "end": 4142.48, "text": "Diese Talente sind durchaus eine schöne Idee, um die Kampagnenmissionen stärker vom Multiplayer-Gameplay abzusetzen"}, {"id": 693, "start": 4142.48, "end": 4144.48, "text": "und sie so aufzulockern."}, {"id": 694, "start": 4144.48, "end": 4148.48, "text": "Aber nicht alle wirken sich jetzt riesig auf die Spielweise des Helden aus."}, {"id": 695, "start": 4148.48, "end": 4151.48, "text": "Und nur 6 Stück scheinen mir auch etwas mager."}, {"id": 696, "start": 4151.48, "end": 4156.48, "text": "Ich glaube nicht unbedingt, dass sie gewaltigen Wiederspielwert oder Langzeitmotivation schaffen werden."}, {"id": 697, "start": 4156.48, "end": 4159.48, "text": "Also da muss schon mehr rein."}, {"id": 698, "start": 4159.48, "end": 4164.48, "text": "Und generell, das ist ja auch so eines der größten Probleme, woran Overwatch krankt."}, {"id": 699, "start": 4164.48, "end": 4167.48, "text": "Die haben einfach zu wenig Content."}, {"id": 700, "start": 4167.48, "end": 4169.48, "text": "Ich meine, mittlerweile geht es."}, {"id": 701, "start": 4169.48, "end": 4171.48, "text": "Mittlerweile geht es, ja."}, {"id": 702, "start": 4171.48, "end": 4174.48, "text": "Mittlerweile hat man eine ordentliche Anzahl an Maps."}, {"id": 703, "start": 4174.48, "end": 4179.48, "text": "Aber davon ist gefühlt die Hälfte 2CP, die jeder Scheiße findet."}, {"id": 704, "start": 4179.48, "end": 4185.48, "text": "Inklusive den Pros, die alle am kotzen sind, wenn es bis auf ein paar, die 2CP spielen müssen."}, {"id": 705, "start": 4185.48, "end": 4190.48, "text": "Und von den restlichen Maps gibt es auch nur eine Hand voll richtig gute, ja."}, {"id": 706, "start": 4192.48, "end": 4196.48, "text": "Zum Beispiel finde ich Kingsrow ist immer noch eines der schönsten Maps, obwohl er von Anfang an drin war."}, {"id": 707, "start": 4196.48, "end": 4200.48, "text": "Aber sowas wie Paris oder Dings oder wie heißt das?"}, {"id": 708, "start": 4202.48, "end": 4204.48, "text": "Oder Rialto oder so."}, {"id": 709, "start": 4204.48, "end": 4206.48, "text": "Ey Alter, was ist das für Maps?"}, {"id": 710, "start": 4206.48, "end": 4210.48, "text": "Coolen Helden-Builds müsste es da einfach noch mehr geben."}, {"id": 711, "start": 4210.48, "end": 4213.48, "text": "Wir leveln übrigens nicht während eines Einsatzes auf,"}, {"id": 712, "start": 4213.48, "end": 4217.48, "text": "sondern verbessern unsere Helden durch sogenannte Helden-Missionen."}, {"id": 713, "start": 4217.48, "end": 4222.48, "text": "Das ist ein zweiter Typ an Koop-Mission, den Blizzard noch nicht näher vorgestellt hat."}, {"id": 714, "start": 4222.48, "end": 4226.48, "text": "Hier sollen wir anders als in den Story-Einsätzen immer unseren Lieblingshelden spielen können"}, {"id": 715, "start": 4226.48, "end": 4231.48, "text": "und die Ziele sollen variieren, damit man die Missionen immer wieder angehen kann."}, {"id": 716, "start": 4231.48, "end": 4234.48, "text": "Ob das auch so funktioniert, bleibt aber noch abzuwarten."}, {"id": 717, "start": 4234.48, "end": 4239.48, "text": "Sicher ist nur schon, dass die so verdienten Talente nur für den PvE gelten."}, {"id": 718, "start": 4239.48, "end": 4244.48, "text": "Im Multiplayer würden sie die Balance zerschießen, weil höherstufige Spieler handfeste Vorteile hätten."}, {"id": 719, "start": 4244.48, "end": 4247.48, "text": "Auch wenn es ein wenig schade um die Anpassungsmöglichkeit..."}, {"id": 720, "start": 4247.48, "end": 4249.48, "text": "In Overwatch ist das alles so langsam."}, {"id": 721, "start": 4249.48, "end": 4254.48, "text": "Die brauchen ein dreiviertel Jahr oder ein halbes Jahr oder lassen wir ein drittel Jahr für, um irgendwas zu patchen."}, {"id": 722, "start": 4254.48, "end": 4256.48, "text": "Dann gibt es eine neue Map mal im halben Jahr."}, {"id": 723, "start": 4256.48, "end": 4260.48, "text": "Da muss ein bisschen mehr Dynamik rein in das Ganze."}, {"id": 724, "start": 4262.48, "end": 4266.48, "text": "Guckt euch das mal an, wie das zum Beispiel..."}, {"id": 725, "start": 4266.48, "end": 4270.48, "text": "Hearth of Exile ist jetzt ein doofes Beispiel mit Overwatch zu vergleichen."}, {"id": 726, "start": 4270.48, "end": 4274.48, "text": "Aber es gibt ja genug Anbieter, die, ich weiß nicht, wie sie das bei Dota und LoL machen,"}, {"id": 727, "start": 4274.48, "end": 4281.48, "text": "die können quasi im Wochentakt oder theoretisch im Tagestakt irgendwas patchen."}, {"id": 728, "start": 4281.48, "end": 4293.48, "text": "Aber jetzt zurück zu den Story-Missionen."}, {"id": 729, "start": 4293.48, "end": 4297.48, "text": "Die Stadt wird von Robotern der Omnic-Extremistengruppe Null Sector angegriffen,"}, {"id": 730, "start": 4297.48, "end": 4301.48, "text": "die Overwatch-Veteranen unter anderem aus dem Uprising-Event kennen."}, {"id": 731, "start": 4301.48, "end": 4308.48, "text": "Lucio tut sich mit der neu reformierten Overwatch zusammen, um die Invasoren aus seiner Heimatstadt zu vertreiben."}, {"id": 732, "start": 4308.48, "end": 4311.48, "text": "Spielerisch fällt die Missionen recht."}, {"id": 733, "start": 4311.48, "end": 4318.48, "text": "Ich meine, man muss ja auch mal sagen, das ist halt Co-op PvM im Endeffekt."}, {"id": 734, "start": 4318.48, "end": 4322.48, "text": "Das ist keine wirkliche Singleplayer-Story in dem Sinn."}, {"id": 735, "start": 4322.48, "end": 4325.48, "text": "Das ist im Prinzip Co-op PvM."}, {"id": 736, "start": 4325.48, "end": 4332.48, "text": "Ich finde, das hat mit einer strukturierten Story oder Geschichte nichts zu tun, was wir da gerade sehen."}, {"id": 737, "start": 4332.48, "end": 4340.48, "text": "Das ist Co-op PvM mit Ranglisten."}, {"id": 738, "start": 4340.48, "end": 4347.48, "text": "Wir ballern uns geradewegs durch enge Straßen, die sich regelmäßig zu etwas größeren Arenen auftun."}, {"id": 739, "start": 4347.48, "end": 4350.48, "text": "Haben wir dort alle Feinde erledigt, geht's weiter."}, {"id": 740, "start": 4350.48, "end": 4354.48, "text": "Versagte Feinde fahren ein paar recht unterschiedliche Kampfmaschinen auf."}, {"id": 741, "start": 4354.48, "end": 4359.48, "text": "Von gewöhnlichen Fußtruppen, über nervige kleine Flieger"}, {"id": 742, "start": 4359.48, "end": 4364.48, "text": "bis zu besonders schweren Max, die wir am besten gemeinsam behaken."}, {"id": 743, "start": 4364.48, "end": 4367.48, "text": "Auch optisch bietet das Level durchaus Abwechslung."}, {"id": 744, "start": 4367.48, "end": 4371.48, "text": "Mitten in der Mission besteigen wir einen Jet, um das gegnerische Fabrikschiff zu entern"}, {"id": 745, "start": 4371.48, "end": 4374.48, "text": "und kämpfen fortan in dessen Hangars."}, {"id": 746, "start": 4374.48, "end": 4376.48, "text": "Das Missionsziel ist recht simpel."}, {"id": 747, "start": 4376.48, "end": 4378.48, "text": "Wir müssen uns einfach zum Ende kämpfen."}, {"id": 748, "start": 4378.48, "end": 4382.48, "text": "Dort erwartet uns dann noch ein Showdown, bei dem wir einen Energiekern vernichten müssen,"}, {"id": 749, "start": 4382.48, "end": 4388.48, "text": "während mehrere Wellen an Gegnern uns aufzuhalten versuchen."}, {"id": 750, "start": 4388.48, "end": 4392.48, "text": "Das ist eher so eine, das ist Co-OP4M mit Rangliste im Endeffekt, ja."}, {"id": 751, "start": 4392.48, "end": 4397.48, "text": "Das kann natürlich auch sein, aber ich glaube nicht, dass es eine wirkliche Kampagne im eigentlichen Sinn ist,"}, {"id": 752, "start": 4397.48, "end": 4402.48, "text": "wo du halt so, wo du eine Story hast, wo du mitfiebern kannst, sowas ist es eher nicht."}, {"id": 753, "start": 4402.48, "end": 4411.48, "text": "Ich glaube, ich glaube auch eh, dass Blizzard eigentlich überhaupt keine Story für Overwatch hat."}, {"id": 754, "start": 4411.48, "end": 4414.48, "text": "Die haben ja nur so ein bisschen Rahmengerüst drum herum."}, {"id": 755, "start": 4414.48, "end": 4419.48, "text": "Und es gibt beispielsweise, glaube ich zumindest, ich bin jetzt ja nicht so der ultra Overwatch-Lore-Kennner, ja,"}, {"id": 756, "start": 4419.48, "end": 4428.48, "text": "es gibt für, es gibt keine sinnvolle Erklärung, warum quasi auf einmal Tracer und Widowmaker zusammenarbeiten sollten, ja."}, {"id": 757, "start": 4428.48, "end": 4434.48, "text": "Also man hat die Story im Endeffekt so aufgebaut, dass es quasi gute und böse, wenn was mal, Helden gibt."}, {"id": 758, "start": 4434.48, "end": 4438.48, "text": "Aber warum spielen die zusammen? Das ergibt überhaupt keinen Sinn in der Lore."}, {"id": 759, "start": 4438.48, "end": 4443.48, "text": "Das alles macht durchaus Spaß, denn Overwatch ist ja einfach ein richtig guter Shooter."}, {"id": 760, "start": 4443.48, "end": 4448.48, "text": "Sein flüssiges Gameplay und seine erstklassig designten Helden punkten auch im Story-Modus."}, {"id": 761, "start": 4448.48, "end": 4452.48, "text": "Allerdings nicht so sehr wie im Multiplayer."}, {"id": 762, "start": 4452.48, "end": 4457.48, "text": "Gegen die tumpen Roboter müssen wir längst nicht so clever spielen wie gegen menschliche Feinde,"}, {"id": 763, "start": 4457.48, "end": 4463.48, "text": "aber eine Heldin wie Tracer glänzt erst so richtig, wenn wir im rasanten Tanz einen denkenden Feind austricksen."}, {"id": 764, "start": 4463.48, "end": 4469.48, "text": "Genau dafür wurde sie ja konzipiert. Das Koop-Missions-Design dagegen wirkt nur..."}, {"id": 765, "start": 4469.48, "end": 4473.48, "text": "gut, keineswegs schlecht, aber auch nicht herausragend."}, {"id": 766, "start": 4473.48, "end": 4477.48, "text": "Es fuhr weder in Sachen Map und Ziele, noch bei den Feinden irgendwie..."}, {"id": 767, "start": 4477.48, "end": 4481.48, "text": "Maps ist eh, Maps ist eh das eines der größten Probleme von Overwatch, finde ich."}, {"id": 768, "start": 4481.48, "end": 4484.48, "text": "Die Maps sind alle so..."}, {"id": 769, "start": 4484.48, "end": 4488.48, "text": "Es gibt, ohne Finesse irgendwie, ja."}, {"id": 770, "start": 4488.48, "end": 4493.48, "text": "Du hast bei den Maps meistens einen Weg, der..."}, {"id": 771, "start": 4493.48, "end": 4496.48, "text": "Also wenn es hoch kommt, mal einen Weg ohne Flank-Route oder so."}, {"id": 772, "start": 4496.48, "end": 4502.48, "text": "Du hast eigentlich einen Weg und jeder Weg in Overwatch ist voll mit Choke-Points."}, {"id": 773, "start": 4502.48, "end": 4505.48, "text": "Das ist einfach für einen Arsch die Maps."}, {"id": 774, "start": 4508.48, "end": 4514.48, "text": "Also im Prinzip ist es, jede Map in Overwatch ist ein Main-Weg,"}, {"id": 775, "start": 4514.48, "end": 4519.48, "text": "also eine Hauptroute, komplett voller Choke-Points, wo du durch musst, weil du keine andere Chance hast."}, {"id": 776, "start": 4519.48, "end": 4523.48, "text": "Und eventuell mal eine Flank-Route, ja."}, {"id": 777, "start": 4523.48, "end": 4551.48, "text": "Das war's dann aber auch."}, {"id": 778, "start": 4551.48, "end": 4559.48, "text": "Es gibt einfach deutlich bessere Koop-Shooter, zum Beispiel Borderlands 3 mit seinen deutlich umfangreicheren Talentbäumen."}, {"id": 779, "start": 4559.48, "end": 4565.48, "text": "Das ist jetzt vielleicht ein unfaire Vergleich, weil Borderlands 3 dafür keinen kompetitiven Multiplayer hat,"}, {"id": 780, "start": 4565.48, "end": 4571.48, "text": "aber wie gesagt ist der PvE ja der Grund, warum Overwatch 2 als vollwertiges Sequel angekündigt wird."}, {"id": 781, "start": 4571.48, "end": 4575.48, "text": "Und diese Last scheint er mir noch nicht zurecht tragen zu können."}, {"id": 782, "start": 4575.48, "end": 4580.48, "text": "Er könnte auch einfach ein DLC-Paket sein und wirkt in seinem Bereich nicht so herausragend,"}, {"id": 783, "start": 4580.48, "end": 4583.48, "text": "wie es der Multiplayer-Part des Spiels ist."}, {"id": 784, "start": 4583.48, "end": 4587.48, "text": "Oder anders gesagt, Overwatch ist einer der besten kompetitiven Shooter,"}, {"id": 785, "start": 4587.48, "end": 4594.48, "text": "aber Overwatch 2 müsste noch einiges verbessern, um auch einer der besten Koop-Shooter zu werden."}, {"id": 786, "start": 4594.48, "end": 4598.48, "text": "Aber in seiner Kerndisziplin kriegt Overwatch dafür eine richtig starke Neuerung."}, {"id": 787, "start": 4598.48, "end": 4603.48, "text": "Der neue Push-Modus wirkt richtig vielversprechend und war ebenfalls auf der Messe spielbar."}, {"id": 788, "start": 4603.48, "end": 4605.48, "text": "Er ist im Grunde ein Tauziehen."}, {"id": 789, "start": 4605.48, "end": 4610.48, "text": "In der Kartenmitte wartet ein Roboter, den beide Teams zur gegnerischen Basis drücken müssen."}, {"id": 790, "start": 4610.48, "end": 4618.48, "text": "Die neue Map Toronto bot dabei zahlreiche Möglichkeiten für Flankenangriffe,"}, {"id": 791, "start": 4618.48, "end": 4623.48, "text": "um den Gegnern in den Rücken zu fallen und sorgte damit für richtig schön wendungsreiche Matches."}, {"id": 792, "start": 4623.48, "end": 4627.48, "text": "Auch wenn auch hier gilt, im Kern ist das eben mehr Overwatch."}, {"id": 793, "start": 4627.48, "end": 4633.48, "text": "Sehr gutes Overwatch, aber man kann leicht vergessen, dass man hier eigentlich einen zweiten Teil spielt."}, {"id": 794, "start": 4633.48, "end": 4639.48, "text": "Selbst so manches jährliche Assassin's Creed oder Call of Duty brachte tiefergehende Veränderungen."}, {"id": 795, "start": 4639.48, "end": 4643.48, "text": "Nicht, dass sich gar nichts getan hätte. Die neuen Maps sehen klasse aus."}, {"id": 796, "start": 4643.48, "end": 4647.48, "text": "Deswegen habe ich eigentlich auch damit gerechnet, dass Overwatch free to play wird."}, {"id": 797, "start": 4647.48, "end": 4652.48, "text": "Zumindest so die Basisvariante irgendwie."}, {"id": 798, "start": 4652.48, "end": 4657.48, "text": "Free to play und das, dass es da halt noch verschiedene Varianten gibt, wie sie Geld machen können."}, {"id": 799, "start": 4657.48, "end": 4661.48, "text": "Die Helden kriegen allesamt ein neues Design."}, {"id": 800, "start": 4661.48, "end": 4666.48, "text": "Reinhardt kämpft jetzt zum Beispiel ohne Helm. Genji hat neue Klamotten."}, {"id": 801, "start": 4666.48, "end": 4671.48, "text": "Und Lucio, äh, leuchtende Redlocks?"}, {"id": 802, "start": 4671.48, "end": 4676.48, "text": "Besitzer des ersten Teils können aber auch all ihre alten Skins und Kosmetics übernehmen."}, {"id": 803, "start": 4676.48, "end": 4681.48, "text": "Umgekehrt kommen die neuen Helden wie Sojourn zusammen mit den Maps und Modi auch ins Original."}, {"id": 804, "start": 4681.48, "end": 4684.48, "text": "Also alles, was PvP und Balance relevant ist."}, {"id": 805, "start": 4684.48, "end": 4688.48, "text": "Was wie gesagt eigentlich eine vorbildliche Politik ist."}, {"id": 806, "start": 4688.48, "end": 4693.48, "text": "Sie lässt nur Overwatch 2 als Sequel zurück, dem noch eine richtige Daseinsberechtigung zielt."}, {"id": 807, "start": 4693.48, "end": 4695.48, "text": "Ja, das stimmt. Genau das sehe ich auch so."}, {"id": 808, "start": 4695.48, "end": 4698.48, "text": "Dass endlich die Geschichte weiter erzählt wird, ist ja eigentlich klasse."}, {"id": 809, "start": 4698.48, "end": 4704.48, "text": "Und die bisherigen Zwischensequenzen und Render-Trailer waren auch klar die größte Stärke der gezeigten Mission."}, {"id": 810, "start": 4704.48, "end": 4707.48, "text": "Die Welt und die Figuren von Overwatch sind einfach cool."}, {"id": 811, "start": 4707.48, "end": 4712.48, "text": "Und ich habe richtig Lust drauf, in diesem Kosmos mal eine schön inszenierte Actionfilm-Story zu erleben."}, {"id": 812, "start": 4712.48, "end": 4720.48, "text": "Aber spielerisch hat mir bei der Gezeitenbasis, weil du kannst mit Overwatch 1 und Overwatch 2, ist Crossplay quasi."}, {"id": 813, "start": 4720.48, "end": 4725.48, "text": "Die gesamten Missionen noch das gewisse Etwas gefiel, das hier zu etwas wirklich Besonderem macht."}, {"id": 814, "start": 4725.48, "end": 4730.48, "text": "Vor allem, wenn der Koop-Part den riesigen Wiederspielwert schaffen will, den Blizzard verspricht."}, {"id": 815, "start": 4730.48, "end": 4735.48, "text": "Ich hatte nicht das Gefühl, dass ich diesen Einsatz noch mehrfach mit Spannung wiederholen könnte."}, {"id": 816, "start": 4735.48, "end": 4741.48, "text": "Im Gegenteil, er wirkte sogar deutlich schneller abgenutzt als eine Runde Borderlands oder Left 4 Dead."}, {"id": 817, "start": 4741.48, "end": 4744.48, "text": "Allerdings haben wir auch noch nicht das komplette Puzzle."}, {"id": 818, "start": 4744.48, "end": 4749.48, "text": "Den größten Wiederspielwert sollen die Heldenmissionen bieten und die gab es noch gar nicht zu sehen."}, {"id": 819, "start": 4749.48, "end": 4752.48, "text": "Außerdem hat Overwatch 2 noch nicht mal einen Release-Termin."}, {"id": 820, "start": 4752.48, "end": 4755.48, "text": "Also wer weiß, was Blizzard noch ändert."}, {"id": 821, "start": 4755.48, "end": 4757.48, "text": "Lange wird es nicht mehr dauern."}, {"id": 822, "start": 4757.48, "end": 4761.48, "text": "Ich meine, überlegt euch mal, ihr müsst mal, oder guckt mal auf YouTube, äh nicht auf YouTube, auf Twitch."}, {"id": 823, "start": 4761.48, "end": 4765.48, "text": "Da sitzen die Leute, die sitzen teilweise 35-40 Minuten in der Queue."}, {"id": 824, "start": 4765.48, "end": 4769.48, "text": "Das Spiel braucht dringend neue Multiplayer, das braucht dringend neue Spieler."}, {"id": 825, "start": 4769.48, "end": 4772.48, "text": "Aber eins kann ich zumindest schon mal sagen."}, {"id": 826, "start": 4772.48, "end": 4777.48, "text": "Wenn Overwatch 2 ein Vollpreisspiel werden sollte, und davon gehe ich ehrlich gesagt aus,"}, {"id": 827, "start": 4777.48, "end": 4783.48, "text": "das scheint aus unternehmerischer Sicht ja der beste Grund zu sein, es als Sequel statt als Addon zu verkaufen,"}, {"id": 828, "start": 4783.48, "end": 4790.48, "text": "dann muss Blizzard zu dem bislang gezeigten auf jeden Fall noch eine ordentliche Schippe drauflegen."}, {"id": 829, "start": 4795.48, "end": 4797.48, "text": "Kann ich ihm noch Recht geben?"}, {"id": 830, "start": 4797.48, "end": 4799.48, "text": "Es ist so."}, {"id": 831, "start": 4801.48, "end": 4803.48, "text": "Es ist so."}, {"id": 832, "start": 4803.48, "end": 4805.48, "text": "Ja, würde ich so unterschreiben."}, {"id": 833, "start": 4807.48, "end": 4809.48, "text": "Würde ich echt so unterschreiben."}, {"id": 834, "start": 4815.48, "end": 4819.48, "text": "Eigentlich müssten die echt so viel tiefgreifende Änderungen durchführen."}, {"id": 835, "start": 4819.48, "end": 4824.48, "text": "Overwatch ist einfach ätzend zu spielen mittlerweile, Multiplayer."}, {"id": 836, "start": 4824.48, "end": 4831.48, "text": "Und man kann das nicht alles auf Toxic Community schieben, das Game, das die Leute auch irgendwo da beeinflusst."}, {"id": 837, "start": 4831.48, "end": 4837.48, "text": "Nehradon, vier Monate, Prime, ne nicht Prime, richtig, richtig, ohne Prime."}, {"id": 838, "start": 4837.48, "end": 4842.48, "text": "Subscriber, Subscriber."}, {"id": 839, "start": 4898.48, "end": 4900.48, "text": "Was war denn das?"}, {"id": 840, "start": 4900.48, "end": 4902.48, "text": "Aug?"}, {"id": 841, "start": 4902.48, "end": 4904.48, "text": "Ne, oder?"}, {"id": 842, "start": 4904.48, "end": 4908.48, "text": "Also sie haben als letztes geändert, dass man jetzt als Alternative zu M4 und AK47,"}, {"id": 843, "start": 4908.48, "end": 4911.48, "text": "dass man jetzt ja auch diese anderen zwei Gewehre spielen kann."}, {"id": 844, "start": 4911.48, "end": 4913.48, "text": "Das ist ja schon ein Krieg."}, {"id": 845, "start": 4913.48, "end": 4915.48, "text": "Was, Krieg?"}, {"id": 846, "start": 4917.48, "end": 4919.48, "text": "Okay, ich war..."}, {"id": 847, "start": 4919.48, "end": 4921.48, "text": "War das nicht irgendwas anderes?"}, {"id": 848, "start": 4921.48, "end": 4923.48, "text": "Naja, egal."}, {"id": 849, "start": 4923.48, "end": 4929.48, "text": "Wobei ich immer noch sagen muss, CS ist für mich eSport technisch das schönste Game zum Angucken."}, {"id": 850, "start": 4931.48, "end": 4937.48, "text": "Ich meine, ich spiele zwar kein CS, oder nicht mehr, aber ich guck mir das einfach gerne an."}, {"id": 851, "start": 4937.48, "end": 4944.48, "text": "Und das Schöne an CS ist, dass du wirklich laufend irgendwelche Turniere hast, wo halt auch die Guten mitspielen."}, {"id": 852, "start": 4944.48, "end": 4950.48, "text": "Ja, ich will nicht wissen, was Fnatic oder Astralis oder was die für ein Pensum haben."}, {"id": 853, "start": 4950.48, "end": 4958.48, "text": "Die sind ja quasi heute im 250.000 Euro Turnier und morgen im 250.000 Euro Turnier und übermorgen im 250.000 Euro Turnier."}, {"id": 854, "start": 4958.48, "end": 4962.48, "text": "Die spielen echt bam, bam, bam, pausenlos, ja."}, {"id": 855, "start": 4962.48, "end": 4966.48, "text": "Und deswegen ist für mich als Zuschauer CS eigentlich das Schönste."}, {"id": 856, "start": 4966.48, "end": 4968.48, "text": "Heute LOL World Finals."}, {"id": 857, "start": 4968.48, "end": 4986.48, "text": "Oh nee, LOL ist nicht meins."}, {"id": 858, "start": 4986.48, "end": 4995.48, "text": "Was macht denn der Auer wieder?"}, {"id": 859, "start": 4995.48, "end": 5000.48, "text": "Das ist irgendwas, irgendwas, äh, was da gekühlt ist, oder?"}, {"id": 860, "start": 5000.48, "end": 5014.48, "text": "Wobei, das haben wir schon geguckt, das Zeug von Wish, was Skamars ist."}, {"id": 861, "start": 5014.48, "end": 5018.48, "text": "Habt ihr jetzt eigentlich mitgekriegt, dass Riot irgendwie sechs neue Games vorgestellt hat?"}, {"id": 862, "start": 5018.48, "end": 5024.48, "text": "Irgendwie so ein Overwatch CS abklatscht, ein Kartenspiel, äh, ich hab schon wieder vergessen, was noch, alles."}, {"id": 863, "start": 5024.48, "end": 5044.48, "text": "Was?"}, {"id": 864, "start": 5044.48, "end": 5045.48, "text": "Hä, was?"}, {"id": 865, "start": 5045.48, "end": 5046.48, "text": "It's..."}, {"id": 866, "start": 5046.48, "end": 5054.48, "text": "Installing Windows M.E.O.N. XP on Z-Bot 10."}, {"id": 867, "start": 5054.48, "end": 5056.48, "text": "Wow, funktioniert, funktioniert wahrscheinlich."}, {"id": 868, "start": 5056.48, "end": 5061.48, "text": "Mittlerweile kannst du, Nested Virtualization funktioniert mittlerweile ganz gut."}, {"id": 869, "start": 5061.48, "end": 5073.48, "text": "That's every programming tutorial."}, {"id": 870, "start": 5073.48, "end": 5076.48, "text": "Das ist fake, oder?"}, {"id": 871, "start": 5076.48, "end": 5082.48, "text": "Ach nee."}, {"id": 872, "start": 5082.48, "end": 5089.48, "text": "Das ist, das ist, das ist ein Fake Tutorial."}, {"id": 873, "start": 5089.48, "end": 5100.48, "text": "Ja."}, {"id": 874, "start": 5100.48, "end": 5102.48, "text": "Das Kartenspiel, ja."}, {"id": 875, "start": 5102.48, "end": 5104.48, "text": "Äh, was haben die noch alles vorgestellt?"}, {"id": 876, "start": 5104.48, "end": 5105.48, "text": "Fighting Game."}, {"id": 877, "start": 5105.48, "end": 5108.48, "text": "Genau, einen Film haben sie vorgestellt, einen Film hatten sie noch."}, {"id": 878, "start": 5108.48, "end": 5110.48, "text": "Was haben die noch alles vorgestellt?"}, {"id": 879, "start": 5110.48, "end": 5125.48, "text": "Irgendwie sechs verschiedene Sachen, total abgedreht, weiß gar nicht, was mit denen los ist, äh."}, {"id": 880, "start": 5125.48, "end": 5131.48, "text": "Upgrading von Windows, ETF, was?"}, {"id": 881, "start": 5131.48, "end": 5138.48, "text": "Hello everybody and welcome back."}, {"id": 882, "start": 5138.48, "end": 5140.48, "text": "F***, der Upgraded echt."}, {"id": 883, "start": 5140.48, "end": 5142.48, "text": "Ih, das ist Vista!"}, {"id": 884, "start": 5142.48, "end": 5144.48, "text": "Nee."}, {"id": 885, "start": 5144.48, "end": 5145.48, "text": "Wo ist es?"}, {"id": 886, "start": 5145.48, "end": 5146.48, "text": "War doch eben Vista."}, {"id": 887, "start": 5146.48, "end": 5153.48, "text": "Hab ich eben gerade Vista gesehen?"}, {"id": 888, "start": 5153.48, "end": 5155.48, "text": "Vista?"}, {"id": 889, "start": 5155.48, "end": 5156.48, "text": "Das ist Vista!"}, {"id": 890, "start": 5156.48, "end": 5158.48, "text": "Ih!"}, {"id": 891, "start": 5158.48, "end": 5160.48, "text": "Das ist Vista!"}, {"id": 892, "start": 5160.48, "end": 5165.48, "text": "Geh fort!"}, {"id": 893, "start": 5165.48, "end": 5167.48, "text": "Das ist Windows Vista, tatsächlich."}, {"id": 894, "start": 5167.48, "end": 5170.48, "text": "Igitt."}, {"id": 895, "start": 5170.48, "end": 5174.48, "text": "Das Windows, was nie jemand verwendet hat."}, {"id": 896, "start": 5174.48, "end": 5176.48, "text": "Sag mal, der macht nur so olles Zeug, oder?"}, {"id": 897, "start": 5176.48, "end": 5179.48, "text": "Windows Explorer 1 und Windows 10."}, {"id": 898, "start": 5179.48, "end": 5194.48, "text": "Alles 20 Jahre, alles links, Floppy Drive, VMVMVM."}, {"id": 899, "start": 5194.48, "end": 5198.48, "text": "Guck mal, da ist auch so ein Video."}, {"id": 900, "start": 5198.48, "end": 5210.48, "text": "Die jetzt ja nicht mal Alplali heißt, sondern aus irgendwelchen Kunden Vic, warum auch immer."}, {"id": 901, "start": 5210.48, "end": 5214.48, "text": "Ich hab das Gefühl, dass mit Sata nicht Sata gemeint ist."}, {"id": 902, "start": 5214.48, "end": 5228.48, "text": "Nicht die Festplatten, also nicht der Plattenschluss auf dem Mainboard."}, {"id": 903, "start": 5228.48, "end": 5230.48, "text": "Irgendwie gibt es gerade nichts, was ich noch ko..."}, {"id": 904, "start": 5230.48, "end": 5234.48, "text": "Ich Shopping."}, {"id": 905, "start": 5234.48, "end": 5237.48, "text": "Shop auf der Wii."}, {"id": 906, "start": 5237.48, "end": 5250.48, "text": "Der hatte die Wii in Browser? Und das, was die Switch bis heute nicht geschafft hat?"}, {"id": 907, "start": 5250.48, "end": 5254.48, "text": "Irgendwie gibt es nichts zu gucken."}, {"id": 908, "start": 5254.48, "end": 5263.48, "text": "Hast du schon einen alten PC auf Ebay gekauft, Andi?"}, {"id": 909, "start": 5263.48, "end": 5265.48, "text": "Fuck, ist abgelaufen."}, {"id": 910, "start": 5265.48, "end": 5269.48, "text": "Für 10 Euro, das hätte ich mal kaufen sollen, das Ding."}, {"id": 911, "start": 5269.48, "end": 5274.48, "text": "Hätte ich ein Video mit altem PC machen können."}, {"id": 912, "start": 5274.48, "end": 5285.48, "text": "Retro PC Rechner. Ach so, der Rechner ist leider nicht funktionsfähig, ist ein Pin abgebrochen."}, {"id": 913, "start": 5285.48, "end": 5297.48, "text": "Ding, Ikuro, weiter geht's. Vier Monate, huge."}, {"id": 914, "start": 5297.48, "end": 5300.48, "text": "Der war eh kaputt, der Rechner."}, {"id": 915, "start": 5300.48, "end": 5304.48, "text": "Alter PC."}, {"id": 916, "start": 5304.48, "end": 5306.48, "text": "Alter Medium."}, {"id": 917, "start": 5306.48, "end": 5311.48, "text": "Warum wollen die alle so viel Geld für alte Rechner? Ich glaub's net."}, {"id": 918, "start": 5311.48, "end": 5318.48, "text": "155 Euro, was ist mit denen los?"}, {"id": 919, "start": 5318.48, "end": 5321.48, "text": "Leute."}, {"id": 920, "start": 5321.48, "end": 5324.48, "text": "Wisst ihr übrigens, was ein iPhone 1 kostet?"}, {"id": 921, "start": 5324.48, "end": 5338.48, "text": "Wenn's da ab und zu mal welche gibt. Die sind ultra teuer."}, {"id": 922, "start": 5338.48, "end": 5342.48, "text": "Ne, aber hier."}, {"id": 923, "start": 5342.48, "end": 5346.48, "text": "Apple iPhone First Generation."}, {"id": 924, "start": 5346.48, "end": 5357.48, "text": "Das geht never für den Preis weg."}, {"id": 925, "start": 5357.48, "end": 5362.48, "text": "Das ist viel zu günstig. Die Dinger sind normalerweise übertrieben teuer."}, {"id": 926, "start": 5362.48, "end": 5367.48, "text": "Die iPhone 1 Dinger. Ja, so eher sowas hier. Für sowas alles."}, {"id": 927, "start": 5367.48, "end": 5379.48, "text": "Ja gut, 12.000 ist jetzt vielleicht ein bisschen beknackt, ja."}, {"id": 928, "start": 5379.48, "end": 5382.48, "text": "Deutsche E-Bayer verstehen E-Bayer nicht. Da ist was dran, du hast recht."}, {"id": 929, "start": 5382.48, "end": 5392.48, "text": "Wenn wir jetzt mal beispielsweise hier gucken, da kriegst du die alten PC Sachen für ein Apple und ein Ei."}, {"id": 930, "start": 5392.48, "end": 5399.48, "text": "Naja. Moment, das ist aber auch, das sucht immer noch in DE."}, {"id": 931, "start": 5399.48, "end": 5407.48, "text": "Das sucht immer noch in Europa. Muss ich das jetzt über ein Proxy machen oder was?"}, {"id": 932, "start": 5407.48, "end": 5409.48, "text": "Ja, was auch immer."}, {"id": 933, "start": 5409.48, "end": 5414.48, "text": "Hat jemand eigentlich schon mal meinen Memory Leak angeguckt und weiß woran's liegt?"}, {"id": 934, "start": 5414.48, "end": 5422.48, "text": "Hat der eigentlich ein neues Video?"}, {"id": 935, "start": 5422.48, "end": 5429.48, "text": "Hab ich schon alle geguckt."}, {"id": 936, "start": 5429.48, "end": 5435.48, "text": "Pause den Paste Bin noch mal hier."}, {"id": 937, "start": 5435.48, "end": 5439.48, "text": "Ich kenn's hier irgendwann aus. Warum ich so einen Memory Leak hab?"}, {"id": 938, "start": 5439.48, "end": 5443.48, "text": "Einfach nur starten und warten. Weißt schon."}, {"id": 939, "start": 5443.48, "end": 5449.48, "text": "Oh ja, da müssen wir mal gucken."}, {"id": 940, "start": 5449.48, "end": 5465.48, "text": "Ende 2018 müssten ja dann auch ein paar Deutsche aufploppen."}, {"id": 941, "start": 5465.48, "end": 5491.48, "text": "Wusste ich gar nicht, dass der mal auf Twitch so aktiv war. Riot Games, Alter!"}, {"id": 942, "start": 5491.48, "end": 5497.48, "text": "Hab ich nie geguckt."}, {"id": 943, "start": 5497.48, "end": 5500.48, "text": "Ganz ehrlich, ich gucke hier gar keinen von."}, {"id": 944, "start": 5500.48, "end": 5513.48, "text": "Gar keinen, nicht einen."}, {"id": 945, "start": 5513.48, "end": 5516.48, "text": "Ach, das sind Follower. Ach, Moment."}, {"id": 946, "start": 5516.48, "end": 5521.48, "text": "Jaja, ich hab grad grad so viele Subs, könnte sie nie im Leben sein."}, {"id": 947, "start": 5521.48, "end": 5524.48, "text": "Das sind Follower, okay."}, {"id": 948, "start": 5524.48, "end": 5529.48, "text": "Wir müssen auch gleich mal die meisten Subs gucken."}, {"id": 949, "start": 5529.48, "end": 5532.48, "text": "Syndicate ist der Zombie-Typ. Ah, gewesen, ja. Ich glaub, der macht jetzt anderes."}, {"id": 950, "start": 5532.48, "end": 5535.48, "text": "War Syndicate nicht der, der mit der Skin-Seite gescampt hat?"}, {"id": 951, "start": 5535.48, "end": 5545.48, "text": "Oder verwechsel ich das jetzt nicht? Ich glaub, das verwechsel ich. Ich glaub, es war jemand anderes."}, {"id": 952, "start": 5545.48, "end": 5552.48, "text": "Ich gucke da von keinem."}, {"id": 953, "start": 5552.48, "end": 5567.48, "text": "Ich gucke da von keinem. Ich weiß nicht mehr, wer was ist."}, {"id": 954, "start": 5567.48, "end": 5580.48, "text": "Ich weiß nicht mehr, wer was ist."}, {"id": 955, "start": 5580.48, "end": 5602.48, "text": "Ich weiß nicht mehr, wer was ist."}, {"id": 956, "start": 5602.48, "end": 5612.48, "text": "Wo ist Shroud und sowas? Das ist noch zu früh, ne? Noch zu früh für Shroud."}, {"id": 957, "start": 5612.48, "end": 5622.48, "text": "Wir können das am 1,5 Prozent, ja, wir können das wirklich ein bisschen schneller machen."}, {"id": 958, "start": 5622.48, "end": 5629.48, "text": "Wartet mal."}, {"id": 959, "start": 5629.48, "end": 5642.48, "text": "Boah, viel besser."}, {"id": 960, "start": 5642.48, "end": 5651.48, "text": "Also so wirklich viel tun tut sich jetzt ja da grad nicht, ne?"}, {"id": 961, "start": 5651.48, "end": 5664.48, "text": "Man könnte da eigentlich fast sagen, wir machen es mal auf 2."}, {"id": 962, "start": 5664.48, "end": 5673.48, "text": "Das passt, die Musik passt erstaunlich gut zusammen, oder?"}, {"id": 963, "start": 5673.48, "end": 5684.48, "text": "Die Musik hört sich auf zweifach fast besser an."}, {"id": 964, "start": 5684.48, "end": 5689.48, "text": "Jetzt kommt, ok, jetzt kommt CS."}, {"id": 965, "start": 5689.48, "end": 5701.48, "text": "Ich gucke da von immer noch nichts."}, {"id": 966, "start": 5701.48, "end": 5719.48, "text": "Ich muss ja sagen, die Musik hört sich auf zweifach viel besser an als auf einfach."}, {"id": 967, "start": 5719.48, "end": 5722.48, "text": "Aber Riot Games geht schon gut ab, ne?"}, {"id": 968, "start": 5722.48, "end": 5734.48, "text": "Und 2016 war ja auch so das CSGO Halbjahr. Jetzt geht Summit nochmal ab."}, {"id": 969, "start": 5734.48, "end": 5748.48, "text": "Außerdem mag jeder Balken, die hochgehen."}, {"id": 970, "start": 5748.48, "end": 5760.48, "text": "Die Musik."}, {"id": 971, "start": 5760.48, "end": 5771.48, "text": "Ok, Riot Games hat wieder aufgeholt."}, {"id": 972, "start": 5771.48, "end": 5779.48, "text": "Jetzt kommt, jetzt hier, hier, jetzt jetzt Fortnite und Popke."}, {"id": 973, "start": 5779.48, "end": 5783.48, "text": "Pass auf."}, {"id": 974, "start": 5783.48, "end": 5786.48, "text": "Fortnite und Popke."}, {"id": 975, "start": 5786.48, "end": 5796.48, "text": "Und ein bisschen CS."}, {"id": 976, "start": 5796.48, "end": 5798.48, "text": "Jetzt kommt Ninja und gleich ist er wieder weg"}, {"id": 977, "start": 5803.5, "end": 5808.02, "text": "Gleich ist er wieder weg also je nachdem wie lange das geht"}, {"id": 978, "start": 5814.76, "end": 5817.44, "text": "Der streamt jetzt auf YouTube macht immer noch Gampel scheiß mehr"}, {"id": 979, "start": 5817.44, "end": 5823.68, "text": "Alter Ninja ging schon gut ab"}, {"id": 980, "start": 5831.08, "end": 5836.12, "text": "Den einzigen davon den ich mir ab und zu geben kann ist Doktor Disrespect, aber auch nicht lang"}, {"id": 981, "start": 5839.24, "end": 5842.84, "text": "So gleich ist okay das dauert noch ein paar Monate dann ist Ninja wieder weg"}, {"id": 982, "start": 5842.84, "end": 5847.48, "text": "Wobei er viele Follower hat er wahrscheinlich immer noch"}, {"id": 983, "start": 5847.48, "end": 5869.92, "text": "und Shroud ist auch demnächst ist er ja auch auf Mixer habe ich ja ganz vergessen"}, {"id": 984, "start": 5877.48, "end": 5881.44, "text": "So jetzt müsste Ninja langsam wieder runter gehen"}, {"id": 985, "start": 5881.44, "end": 5887.04, "text": "Ja jetzt ist er ja rüber zu Dings hier"}, {"id": 986, "start": 5887.04, "end": 5891.32, "text": "Oh nee ist jetzt fertig fuck ich dachte es geht noch ein paar Monate weiter"}, {"id": 987, "start": 5891.32, "end": 5896.56, "text": "Gucken wir mal warte mal Switch Ninja wie viele Follower hat er jetzt aktuell"}, {"id": 988, "start": 5896.56, "end": 5912.04, "text": "Followers 14669 okay das geht nur langsam runter ich würde ja mal interessieren wieviel Viewer im Vergleich zu"}, {"id": 989, "start": 5912.04, "end": 5927.32, "text": "Shroud und Ninja haben im Vergleich zu Twitch auf Mixer"}, {"id": 990, "start": 5927.32, "end": 5933.36, "text": "Komm wir lassen es wieder auf zweifach stehen wobei bei Webseiten machen wir machen mal ein bisschen ein bisschen langsamer"}, {"id": 991, "start": 5933.36, "end": 5945.28, "text": "dass ich was zu sagen kann okay also was haben wir hier AOL das war halt damals voll angesagt"}, {"id": 992, "start": 5945.28, "end": 5954.96, "text": "AOL, Yahoo, Yahoo hat so verkackt wusstet ihr dass Yahoo zweimal hätte Google kaufen können"}, {"id": 993, "start": 5954.96, "end": 5963.68, "text": "und sie haben es jedes mal verkackt voll die Boomerseiten aber richtig naja was ist das hier"}, {"id": 994, "start": 5963.68, "end": 5968.8, "text": "für eine Zeit es ist die Boomerseite die Boomer da hat da waren die Zoomer noch im Bauch wenn"}, {"id": 995, "start": 5968.8, "end": 5978.92, "text": "überhaupt MSN ja gut ich habe damals immer MSN Call by Call verwendet Geocities wo ist denn"}, {"id": 996, "start": 5978.92, "end": 5987.08, "text": "MySpace gab es das überhaupt schon MySpace äh egal gucken wir mal"}, {"id": 997, "start": 5987.08, "end": 6007.72, "text": "AOL ja 2000 ist Monka Shake aber hier da ist es da sind sie jetzt geht's los Amazon war"}, {"id": 998, "start": 6007.72, "end": 6012.24, "text": "relativ früh schon am Start als reiner Bücherversand damals zumindest in Deutschland"}, {"id": 999, "start": 6012.24, "end": 6019.52, "text": "Ich habe ehrlich gesagt keine Ahnung was AM Greetings überhaupt ist"}, {"id": 1000, "start": 6019.52, "end": 6027.84, "text": "Infos die Alta Vista war eine Suchmaschine so Pre-Google Suchmaschine Lycos war auch eine"}, {"id": 1001, "start": 6027.84, "end": 6035.24, "text": "Suchmaschine damals Fireball gab es in Deutschland noch der Chat ist über dem Datum easy chat easy"}, {"id": 1002, "start": 6035.24, "end": 6049.04, "text": "live kein Problem Amazon geht ab real player kennt den Scheiß überhaupt noch jemand der real"}, {"id": 1003, "start": 6049.04, "end": 6054.12, "text": "player das habe ich schon wieder sie sind diese Crap Software habe ich überhaupt schon verdrängt"}, {"id": 1004, "start": 6054.12, "end": 6060.16, "text": "wieder das hat man damals gebraucht um manche Sachen abspielen zu können der real player so"}, {"id": 1005, "start": 6060.16, "end": 6067.6, "text": "kack gibt es das überhaupt noch real player nicht real players"}, {"id": 1006, "start": 6067.6, "end": 6072.36, "text": "nicht real real"}, {"id": 1007, "start": 6076.96, "end": 6078.04, "text": "gibt es tatsächlich noch"}, {"id": 1008, "start": 6078.04, "end": 6097.08, "text": "95 stable release 2019 übrigens Yahoo! wird gleich noch übelst abgehen sage ich euch Yahoo!"}, {"id": 1009, "start": 6097.08, "end": 6109.76, "text": "geht gleich mega ab Yahoo! war in zwischenzeitlich die beliebteste Seite ever ne? about.com kenne ich"}, {"id": 1010, "start": 6109.76, "end": 6113.08, "text": "auch nicht ok amazon und ebay die werden natürlich noch viel mehr abgehen"}, {"id": 1011, "start": 6116.4, "end": 6121.84, "text": "das gibt es halt immer noch habe ich gelesen aber nie Excite war auch glaube ich eine Suchmaschine"}, {"id": 1012, "start": 6121.84, "end": 6133.52, "text": "oder E-Mail anbieter oder sowas Lycos Suchmaschine jetzt achtung leute 2000 2000 Monka Shake Yahoo!"}, {"id": 1013, "start": 6147.24, "end": 6151.44, "text": "geht ja ab google hier hätten sie die chance gehabt google zu kaufen wollten sie nicht oder"}, {"id": 1014, "start": 6151.44, "end": 6155.36, "text": "noch ein bisschen davor die hatten zweimal die chance google zu kommen haben sie nicht gemacht"}, {"id": 1015, "start": 6155.36, "end": 6166.12, "text": "übrigens leute zu dieser zeit war das normal dass da noch keine porn seiten drin waren weil die"}, {"id": 1016, "start": 6166.12, "end": 6170.64, "text": "leute hatten die bandbreite nicht online porn zu gucken die leute haben damals porn haben die"}, {"id": 1017, "start": 6170.64, "end": 6174.0, "text": "sich hauptsächlich bilder angeguckt weil die sind halt so schlecht war oder absolut schlecht"}, {"id": 1018, "start": 6174.0, "end": 6179.0, "text": "aufgelöste videos deswegen waren die ganzen porn seiten damals noch nicht so beliebt warten"}, {"id": 1019, "start": 6179.0, "end": 6183.92, "text": "mal ab warten mal ab bis die leute mehr bandbreite kriegen dann werdet ihr sehen oder gehe ich mal"}, {"id": 1020, "start": 6183.92, "end": 6188.0, "text": "von aus dass dann auch hier so so so pornhub und so mit am start sein wird"}, {"id": 1021, "start": 6195.24, "end": 6197.72, "text": "warum liegt hier stroh alarm"}, {"id": 1022, "start": 6197.72, "end": 6208.36, "text": "also amazon google geht definitiv gleich noch viel viel weiter hoch"}, {"id": 1023, "start": 6208.36, "end": 6216.08, "text": "jahu steigt immer noch gut aber langsam aber sicher irgendwann hier ein paar jahre später"}, {"id": 1024, "start": 6216.08, "end": 6220.8, "text": "hatte ja jahu noch mal die möglichkeit es war ja so dass wenn ich das richtig in der"}, {"id": 1025, "start": 6220.8, "end": 6226.16, "text": "ende ich habe damals drüber gelesen dass die die google gründer dass sie damals zu jahu"}, {"id": 1026, "start": 6226.16, "end": 6230.52, "text": "gegangen sind und ich glaube ich für eine million oder so ihre suchtechnologie an jahu"}, {"id": 1027, "start": 6230.52, "end": 6236.24, "text": "verkaufen wollten und jahu hat gesagt nee wollen wir nicht und da haben sie dann halt"}, {"id": 1028, "start": 6236.24, "end": 6241.8, "text": "irgendwann gesagt haben halt google und irgendwie fünf sechs jahre später hatten sie für irgendwie"}, {"id": 1029, "start": 6241.8, "end": 6246.0, "text": "keine anderen 150 millionen oder so wieder die chance google zu kaufen aber sie wollten"}, {"id": 1030, "start": 6246.0, "end": 6252.52, "text": "wieder nicht und das hat jahu halt voll verkackt wetter.com die schlimmste kacke seit für wetter"}, {"id": 1031, "start": 6252.52, "end": 6256.96, "text": "also komplett folgespämmt mit wer ach nee wetter.com nicht wetter.com ok dann habe ich"}, {"id": 1032, "start": 6256.96, "end": 6263.12, "text": "nichts wikipedia die einzig richtig gute seite hier in der ganzen auflistung der ganzen auflistung"}, {"id": 1033, "start": 6263.12, "end": 6276.2, "text": "jetzt google google geht ab jahu geht runter wenn jahu hat doch immer mal weniger gehung"}, {"id": 1034, "start": 6276.2, "end": 6288.68, "text": "myspace myspace dass die haben es auch verschissen myspace so jetzt wird erstmal google jahu"}, {"id": 1035, "start": 6288.68, "end": 6294.88, "text": "abhängen weil sie es richtig verschissen haben jetzt kommt youtube dabei irgendwann"}, {"id": 1036, "start": 6294.88, "end": 6301.48, "text": "kommt man auf facebook demnächst mal was jetzt hier google gibt alles hol war internetanbieter"}, {"id": 1037, "start": 6301.48, "end": 6310.44, "text": "myspace jandex jandex ist doch ein russisches socialding oder facebook jetzt facebook jetzt"}, {"id": 1038, "start": 6310.44, "end": 6319.88, "text": "sind die zeiten von myspace gezählt moment jahu holt auf warum holt wtf warum jahu holt"}, {"id": 1039, "start": 6319.88, "end": 6324.88, "text": "auf das war mir damals überhaupt nicht bewusst dass es überhaupt mal eine zeit gab wo jahu"}, {"id": 1040, "start": 6324.88, "end": 6341.88, "text": "wieder aufgeholt hat sind das die seite ich habe keine ahnung meint was das war echt so"}, {"id": 1041, "start": 6341.88, "end": 6349.88, "text": "dass 2010 jahu wieder vor google war eigentlich weil es standard suche ja standard suche keine"}, {"id": 1042, "start": 6349.88, "end": 6358.88, "text": "ich habe nie ich habe nie jahu richtig verwendet jetzt jetzt geht google ab ich glaube jetzt"}, {"id": 1043, "start": 6358.88, "end": 6363.8, "text": "haben die auch jetzt jetzt haben die ja auch ihren ganzen kram google mail also google"}, {"id": 1044, "start": 6363.8, "end": 6370.2, "text": "mail google news google google geschiss gestartet und das ging natürlich noch mehr ab beidu"}, {"id": 1045, "start": 6370.2, "end": 6380.28, "text": "das ist hier die chinesische google variante jetzt müssten demnächst auch die ein oder"}, {"id": 1046, "start": 6380.28, "end": 6388.04, "text": "anderen pornseiten bald mal auftauchen live.com hör mal auf aber auch nur weil startseite"}, {"id": 1047, "start": 6388.04, "end": 6403.0, "text": "war bei windows 10 oder so vk vk ist ist russisches social network dritter jawoll endlich mal"}, {"id": 1048, "start": 6403.0, "end": 6410.64, "text": "noch eine zweite gute seite neben wikipedia jetzt jetzt müssten so langsam aber sicher"}, {"id": 1049, "start": 6410.64, "end": 6414.64, "text": "die pornseiten mal rein hier kommen in die statistik weil ansonsten sind die haben sie"}, {"id": 1050, "start": 6414.64, "end": 6424.96, "text": "rausgelassen weil jetzt haben die leute genug bandbreite um sich den kram anzugucken facebook"}, {"id": 1051, "start": 6424.96, "end": 6429.68, "text": "youtube google instagram auch gerade habe ich schon ganz verdrängt grab gibt es ja auch"}, {"id": 1052, "start": 6429.68, "end": 6449.68, "text": "noch twitter youtube instagram facebook amazon ich glaube die haben die pornseiten rausgelassen"}, {"id": 1053, "start": 6449.68, "end": 6466.52, "text": "weil jetzt müssten die definitiv langsam aber sicher mal dabei sein guck mal wie google"}, {"id": 1054, "start": 6466.52, "end": 6480.28, "text": "abgeht er jetzt erst 2017 erst wonach geht das ich habe ehrlich gesagt keine ahnung"}, {"id": 1055, "start": 6480.28, "end": 6492.72, "text": "traffic measured by monthly wizards ok das heißt im endeffekt seiten die viel viel"}, {"id": 1056, "start": 6492.72, "end": 6502.16, "text": "halt hatten haben mehr gezählt sicher dass das porno populärer ist als amazon ja eigentlich"}, {"id": 1057, "start": 6502.16, "end": 6518.64, "text": "schon oder zumindest irgendwelche seiten guck mal aber jetzt hier anfang 2017 da da ist"}, {"id": 1058, "start": 6518.64, "end": 6530.84, "text": "auch hier ist doch"}, {"id": 1059, "start": 6530.84, "end": 6552.72, "text": "das ist ja mal ganz schön spät oder aber man sieht mal es ist alles nichts im vergleich"}, {"id": 1060, "start": 6552.72, "end": 6573.92, "text": "zwischen google und facebook ich habe jetzt gar nicht darauf geachtet facebook ist die"}, {"id": 1061, "start": 6573.92, "end": 6583.96, "text": "letzten jahre rüber runtergegangen bestimmt ja weil weil es eigentlich ist es ist ja bloß"}, {"id": 1062, "start": 6583.96, "end": 6604.36, "text": "cool neun leute sind ja auf instagram oder snapchat google plus hat insta ist facebook"}, {"id": 1063, "start": 6604.36, "end": 6625.08, "text": "was hat facebook gekauft aber google geht halt gut ab aber schon krass oder da sieht"}, {"id": 1064, "start": 6625.08, "end": 6631.92, "text": "man mal ich hätte jetzt ehrlich gesagt damit gerechnet dass hier die die die pornseiten"}, {"id": 1065, "start": 6631.92, "end": 6637.0, "text": "dass sie noch eine ganze ganze ecke weiter vorne sind ja weil es geht ja um traffic"}, {"id": 1066, "start": 6637.0, "end": 6644.56, "text": "und pornseiten machen halt massig traffic"}, {"id": 1067, "start": 6644.56, "end": 6649.12, "text": "guck mal messenger entwicklung gibt es das oh cool jetzt gucken wir doch noch mal an"}, {"id": 1068, "start": 6649.12, "end": 6658.16, "text": "geht nur vier minuten icq aol messenger 98 ja damals hatte ich also jahu messenger hatte"}, {"id": 1069, "start": 6658.16, "end": 6662.92, "text": "ich nie aol messenger habe ich schon mal einen account gemacht fand ich aber doof icq beste"}, {"id": 1070, "start": 6662.92, "end": 6688.2, "text": "hau hau genau icq sound ja icq sause"}, {"id": 1071, "start": 6688.2, "end": 6695.82, "text": "hallo hallo genau"}, {"id": 1072, "start": 6695.82, "end": 6709.86, "text": "was ist denn was den was für den remix lightchain danke schön sup bigbrain bigprime"}, {"id": 1073, "start": 6709.86, "end": 6711.86, "text": "ICQ Remix"}, {"id": 1074, "start": 6711.86, "end": 6740.86, "text": "ICQ Remix"}, {"id": 1075, "start": 6741.86, "end": 6753.86, "text": "ICQ Remix"}, {"id": 1076, "start": 6753.86, "end": 6757.86, "text": "ICQ Remix"}, {"id": 1077, "start": 6757.86, "end": 6765.86, "text": "ICQ Remix"}, {"id": 1078, "start": 6765.86, "end": 6788.86, "text": "ICQ Remix"}, {"id": 1079, "start": 6788.86, "end": 6803.86, "text": "ICQ Remix"}, {"id": 1080, "start": 6803.86, "end": 6817.86, "text": "ICQ Remix"}, {"id": 1081, "start": 6817.86, "end": 6824.86, "text": "ICQ Remix"}, {"id": 1082, "start": 6824.86, "end": 6831.86, "text": "ICQ Remix"}, {"id": 1083, "start": 6831.86, "end": 6834.86, "text": "ICQ Remix"}, {"id": 1084, "start": 6834.86, "end": 6843.86, "text": "ICQ Remix"}, {"id": 1085, "start": 6843.86, "end": 6850.86, "text": "ICQ Remix"}, {"id": 1086, "start": 6850.86, "end": 6857.86, "text": "ICQ Remix"}, {"id": 1087, "start": 6857.86, "end": 6864.86, "text": "ICQ Remix"}, {"id": 1088, "start": 6864.86, "end": 6872.86, "text": "ICQ Remix"}, {"id": 1089, "start": 6872.86, "end": 6879.86, "text": "ICQ Remix"}, {"id": 1090, "start": 6879.86, "end": 6893.86, "text": "ICQ Remix"}, {"id": 1091, "start": 6893.86, "end": 6908.86, "text": "ICQ Remix"}, {"id": 1092, "start": 6908.86, "end": 6918.86, "text": "ICQ Remix"}, {"id": 1093, "start": 6918.86, "end": 6933.86, "text": "ICQ Remix"}, {"id": 1094, "start": 6933.86, "end": 6947.86, "text": "ICQ Remix"}, {"id": 1095, "start": 6947.86, "end": 6967.86, "text": "ICQ Remix"}, {"id": 1096, "start": 6967.86, "end": 6976.86, "text": "ICQ Remix"}, {"id": 1097, "start": 6976.86, "end": 6983.86, "text": "ICQ Remix"}, {"id": 1098, "start": 6983.86, "end": 6991.86, "text": "ICQ Remix"}, {"id": 1099, "start": 6991.86, "end": 6999.86, "text": "ICQ Remix"}, {"id": 1100, "start": 6999.86, "end": 7006.86, "text": "ICQ Remix"}, {"id": 1101, "start": 7006.86, "end": 7013.86, "text": "ICQ Remix"}, {"id": 1102, "start": 7013.86, "end": 7020.86, "text": "ICQ Remix"}, {"id": 1103, "start": 7020.86, "end": 7030.86, "text": "ICQ Remix"}, {"id": 1104, "start": 7030.86, "end": 7040.86, "text": "ICQ Remix"}, {"id": 1105, "start": 7040.86, "end": 7050.86, "text": "ICQ Remix"}, {"id": 1106, "start": 7050.86, "end": 7060.86, "text": "ICQ Remix"}, {"id": 1107, "start": 7060.86, "end": 7070.86, "text": "ICQ Remix"}, {"id": 1108, "start": 7070.86, "end": 7080.86, "text": "ICQ Remix"}, {"id": 1109, "start": 7080.86, "end": 7090.86, "text": "ICQ Remix"}, {"id": 1110, "start": 7090.86, "end": 7100.86, "text": "ICQ Remix"}, {"id": 1111, "start": 7100.86, "end": 7110.86, "text": "ICQ Remix"}, {"id": 1112, "start": 7110.86, "end": 7120.86, "text": "ICQ Remix"}, {"id": 1113, "start": 7120.86, "end": 7130.86, "text": "ICQ Remix"}, {"id": 1114, "start": 7150.86, "end": 7160.86, "text": "ICQ Remix"}, {"id": 1115, "start": 7160.86, "end": 7170.86, "text": "ICQ Remix"}, {"id": 1116, "start": 7170.86, "end": 7180.86, "text": "ICQ Remix"}, {"id": 1117, "start": 7180.86, "end": 7190.86, "text": "ICQ Remix"}, {"id": 1118, "start": 7190.86, "end": 7200.86, "text": "ICQ Remix"}, {"id": 1119, "start": 7220.86, "end": 7230.86, "text": "ICQ Remix"}, {"id": 1120, "start": 7230.86, "end": 7240.86, "text": "ICQ Remix"}, {"id": 1121, "start": 7240.86, "end": 7250.86, "text": "ICQ Remix"}, {"id": 1122, "start": 7270.86, "end": 7280.86, "text": "ICQ Remix"}, {"id": 1123, "start": 7300.86, "end": 7310.86, "text": "ICQ Remix"}, {"id": 1124, "start": 7310.86, "end": 7320.86, "text": "ICQ Remix"}, {"id": 1125, "start": 7320.86, "end": 7330.86, "text": "ICQ Remix"}, {"id": 1126, "start": 7330.86, "end": 7350.86, "text": "ICQ Remix"}, {"id": 1127, "start": 7350.86, "end": 7360.86, "text": "ICQ Remix"}, {"id": 1128, "start": 7360.86, "end": 7380.86, "text": "ICQ Remix"}, {"id": 1129, "start": 7380.86, "end": 7390.86, "text": "ICQ Remix"}, {"id": 1130, "start": 7390.86, "end": 7410.86, "text": "ICQ Remix"}, {"id": 1131, "start": 7420.86, "end": 7430.86, "text": "ICQ Remix"}, {"id": 1132, "start": 7430.86, "end": 7440.86, "text": "ICQ Remix"}, {"id": 1133, "start": 7440.86, "end": 7450.86, "text": "ICQ Remix"}, {"id": 1134, "start": 7470.86, "end": 7480.86, "text": "ICQ Remix"}, {"id": 1135, "start": 7500.86, "end": 7510.86, "text": "ICQ Remix"}, {"id": 1136, "start": 7530.86, "end": 7540.86, "text": "ICQ Remix"}, {"id": 1137, "start": 7560.86, "end": 7570.86, "text": "ICQ Remix"}, {"id": 1138, "start": 7570.86, "end": 7580.86, "text": "ICQ Remix"}, {"id": 1139, "start": 7580.86, "end": 7590.86, "text": "ICQ Remix"}, {"id": 1140, "start": 7590.86, "end": 7610.86, "text": "ICQ Remix"}, {"id": 1141, "start": 7610.86, "end": 7620.86, "text": "ICQ Remix"}, {"id": 1142, "start": 7640.86, "end": 7650.86, "text": "ICQ Remix"}, {"id": 1143, "start": 7650.86, "end": 7660.86, "text": "ICQ Remix"}, {"id": 1144, "start": 7660.86, "end": 7670.86, "text": "ICQ Remix"}, {"id": 1145, "start": 7690.86, "end": 7700.86, "text": "ICQ Remix"}, {"id": 1146, "start": 7700.86, "end": 7710.86, "text": "ICQ Remix"}, {"id": 1147, "start": 7710.86, "end": 7720.86, "text": "ICQ Remix"}, {"id": 1148, "start": 7740.86, "end": 7750.86, "text": "ICQ Remix"}, {"id": 1149, "start": 7770.86, "end": 7780.86, "text": "ICQ Remix"}, {"id": 1150, "start": 7800.86, "end": 7810.86, "text": "ICQ Remix"}, {"id": 1151, "start": 7830.86, "end": 7840.86, "text": "ICQ Remix"}, {"id": 1152, "start": 7860.86, "end": 7870.86, "text": "ICQ Remix"}, {"id": 1153, "start": 7890.86, "end": 7900.86, "text": "ICQ Remix"}, {"id": 1154, "start": 7920.86, "end": 7930.86, "text": "ICQ Remix"}, {"id": 1155, "start": 7950.86, "end": 7960.86, "text": "ICQ Remix"}]}