{"text": "Ja, ich sag das, richtig? Ich kenne das von den Babysitzen auf Netflix, schau dir das mal an. Netflix, ja. Äh, Comedian auch. Er wird auch als Repräsentant sein. Und dann haben wir... Ey Leute, übel Smokers, ey. ...huge Latte... Es hat gerade quasi, es brennt nix oder so, es hat gerade mitten auf der Straße ein Glitz eingeschlagen und instantly Internet weg. Ich bin in der Real-Welt, ne? Ich hab' Netflix gekillt. Ich hab mir gerade halb in die Hose geschossen, dass irgendwie die Technik hier abgefackelt ist. Let's go, you know how to play the game, right? Let's go, baby, let's go. Ich weiß nicht, ob ihr, habt ihr den Knall im Hintergrund noch gehört? Wahrscheinlich, aber das war gerade, wo Anthem gelaufen ist. Boah. Ey. Das, äh, das hatte ich auch noch net. Das quasi... ...Pletzeinschlag in der Nähe ins Internet weg. Krasser Scheiß. Okay, ähm... Ich würd' mal sagen, es ist fertig, oder? Das Stream ist fertig, ne? Seh ich das richtig? Das ist jetzt quasi so das Programm, was hinten dran kommt. Okay, dann, ähm, dann können wir nochmal unser Bullshit kurz abhaken. Unser Bullshit-Bingo. Also, im Prinzip war ja, es war ja so ziemlich alles dabei. Äh, hatten wir? Hatten wir? Hatten wir? Hatten wir? Äh, free to play? Weiß ich nicht. Football hatten wir. Superlative hatten wir. Cringe hatten wir. Fußball hatten wir. Basketball hatten wir. Nee. Doch. Haben wir Basketball? Star Wars hatten wir. Battlefront 2 Schadensbegrenzung hatten wir. Schlechte Musik DLC hatten wir. Besten Fans hatten wir. Exclusive hatten wir. Ähm, live real in-game Gameplay hatten wir. Sportler auf der Bühne hatten wir. Indie-Devs, die nicht so richtig Indie sind hatten wir. Das war's. Also, komm, also wir haben wirklich, wir haben, ne? Big Brain. Ja, wir haben schon, wir haben schon gut gelegen. Sims hatten wir auch, ja. Also wir haben schon, also wir waren wirklich gut, muss man sagen. Basketball und free to play. So, und jetzt, bevor wir Schluss machen, müssen wir uns noch dieses ganz tolle Game angucken. Also, C&C, wie hieß, wie hieß das, die Live Enhancing Experience? C&C Rivals Play Store. Also, gucken wir uns das Ganze mal an. Nein. Hieß, hieß das Rivals? Da ist es. So. Wie kann man das runterladen? Gar nicht. Ach nee, okay, okay, also. Pre-Alpha-Players may experience, okay, bla, bla, bla. Okay, ja. Pre-Register today. Mobile Games at its best, its finest, ja. Also sprich, wenn wir uns heute registrieren, dann kriegen wir das Early Bird Bundle, wo eine Titan-Unit drinne ist, Diamanten, Credits. Das heißt, es gibt schon mal zwei In-Game-Währungen, was auch ganz besonders toll ist. Sobald sollte das Spiel irgendwann mal launchen. Beste. Beste. Und kostet das jetzt was oder kostet das nichts? Ich bin nicht eingeloggt, keine Ahnung. Ich sehe jetzt gar nicht, wie ich mir das runterladen könnte. Müsste ich jetzt mal auf dem Tablet gucken. Es hat eben einer gefragt, was ich für ein Tablet habe. Keine Ahnung, was zu sagen, ich habe... Also, insgesamt haben wir fünf Tablets, allerdings sind davon bloß drei in Benutzung. Wir haben einen Asus ZenPad. Wir haben ein Nvidia Shield Tablet. Und ein iPad. Die anderen beiden sind ein Nvidia Tegra Sonstwas. Und ein Lenovo Tablet. Das hängt einmal im ersten Stock und einmal im Erdgeschoss als Heimautomatisierungs-Dashboard an der Wand. So, Leute. Eigentlich sind wir jetzt ja schon durch. Meine Stream ist vorbei. Dass bei mir ein Blitz auf der Straße eingeschlagen ist, da konnte ich noch wirklich nichts dran ändern. Ich hoffe, euch hat es gefallen. Wann sind denn die nächsten Pressekonferenzen? Ok, Pressekonferenzen E3, was gibt es denn hier? Was? Ok, was haben wir denn hier so zu bieten? Heute war nur EA. Morgen 22 Uhr ist Microsoft. Wollen wir uns Microsoft angucken morgen? Wollen wir Microsoft gucken? Ich meine, es ist kaum, das von EA ist kaum zu unterbieten. Das war diesmal wirklich unglaublich langweilig. Das einzig bisschen Interessante war am Anfang zu Battlefield. Und dann am Ende zu Anthem. Oder Anthem... Der Rest dazwischen war Resident Sleeper. So, und dann haben wir in der Nacht... In der Nacht von Sonntag auf Montag um 3.30 Uhr Bethesda. Boah, diese Zeiten sind für EU-Zeiten so scheiße. Digital Divorce 5 Uhr. Square Enix könnte man uns angucken. Und Ubisoft 22 Uhr Montag. Das ist doch Mist. Also Microsoft können wir uns angucken. Microsoft morgen machen wir. Und dann würde ich vorschlagen, machen wir das einfach so. Also Bethesda um 3 Uhr nachts, nee, mach ich nicht. Und die anderen, die können wir hier rewatchen oder irgendwie sowas. Mal gucken. Weil ich meine, hier muss ich arbeiten, Dienstags. Kann man eh knicken. 18 Uhr kommen wir ans Nintendo. 18 Uhr Nintendo, das gucken wir uns an. Da bin ich daheim auf jeden Fall. Ubisoft 22 Uhr könnten wir vielleicht machen. Square Enix können wir machen. Und Microsoft können wir machen. Im Prinzip verpassen wir eins plus die beiden. Das sind doch die Shadow Warrior Typen, oder? Ja, das wird bestimmt lustig. Wann ist CD Projekt RED? Gar nicht. Zumindest nicht mit einer eigenen Geschichte. Vielleicht zeigen die ja was von Steam. Wie heißt das? Cyberpunk? Wie heißt das neue Game von dem? Irgendwas mit Punk und Cyberpunk. Vielleicht zeigen sie das ja bei Sony oder Microsoft oder sowas. Man kommt ja auch für PS4 und Xbox und vielleicht zeigen sie das ja hier. Bullshit Bingo für Ubisoft. Bullshit Bingo geht eigentlich bei Activision und EA immer am besten. Activision hat es ja kein Bock. Und EA war dieses Jahr wirklich sehr enttäuschend. Oder sagt mal Leute, wie fandet ihr denn die EA Pressekonferenz? Ja, Resident Sleeper. Ich fand es auch wirklich schwach. Es war nichts, wie gesagt, ernsthaft am Ende dazwischen. Am verwirrendsten fand ich das eine Indie-Game vom deutschen Studio, wo man echt keinen Schimmer hatte, was es eigentlich ist. Habt ihr zufällig den Mesh, den Lost irgendwo erspäht, dem Publikum? Es war langweilig. Warum das Ding Comaten Conquer heißen muss? Ich meine, es ist klar wegen dem Namen, aber guckt mal. Vergleicht mal diesen Crap hier. Das ist doch kein Echtzeitstrategiespiel, wie man sich das vorstellt. Das ist doch Mobile-Kacke. Guckt euch den Cramper hier mal an und dann vergleichen wir das mal, beispielsweise mit, nein, mein Meme-Tool nervt rum, mit Generals. Für mich das beste Comaten Conquer. So, wenn man das hier vergleicht, guckt mal, da gibt es auch Missiles, aber auch noch ein bisschen mehr anderes Zeug. Das ist ein echtes Comaten Conquer. Guckt euch das mal an. Das vergleicht mal den Crap, den Mist hier, das da, damit. MonkaS, was ist das? Das war die Anele-Fraktion hier, kann ich mich noch dran erinnern. Das ist doch nichts. Cash-Crap. Die Webalm-Blendung und das Bullshit-Bingo haben die PK gerettet. Da bin ich ja froh. Ja, das ist schön, dass euch das Stream gefallen hat. Die Pressekonferenz war ja nur ja ziemlich am Mist. Ja, Henyo sehe ich auch so, Generals war das Beste. Ich hoffe, euch hat es gefallen. Wir sehen uns das nächste Mal. Bye, spätestens sehen wir uns morgen 22 Uhr. Wo ist es denn jetzt? Microsoft hier. Morgen 22 Uhr sehen wir uns spätestens wieder zur Microsoft Pressekonferenz und Resident Sleeper da wahrscheinlich auch so vor uns hin. Macht es gut. Bis morgen, tschüss. CU.", "segments": [{"id": 1, "start": 0.0, "end": 4.4, "text": "Ja, ich sag das, richtig? Ich kenne das von den Babysitzen auf Netflix, schau dir das mal an."}, {"id": 2, "start": 4.4, "end": 6.4, "text": "Netflix, ja."}, {"id": 3, "start": 6.4, "end": 9.4, "text": "Äh, Comedian auch. Er wird auch als Repräsentant sein."}, {"id": 4, "start": 9.4, "end": 10.4, "text": "Und dann haben wir..."}, {"id": 5, "start": 10.4, "end": 12.4, "text": "Ey Leute, übel Smokers, ey."}, {"id": 6, "start": 12.4, "end": 14.4, "text": "...huge Latte..."}, {"id": 7, "start": 14.4, "end": 20.9, "text": "Es hat gerade quasi, es brennt nix oder so, es hat gerade mitten auf der Straße ein Glitz eingeschlagen und instantly Internet weg."}, {"id": 8, "start": 20.9, "end": 22.9, "text": "Ich bin in der Real-Welt, ne?"}, {"id": 9, "start": 22.9, "end": 24.9, "text": "Ich hab' Netflix gekillt."}, {"id": 10, "start": 24.9, "end": 28.9, "text": "Ich hab mir gerade halb in die Hose geschossen, dass irgendwie die Technik hier abgefackelt ist."}, {"id": 11, "start": 28.9, "end": 30.9, "text": "Let's go, you know how to play the game, right?"}, {"id": 12, "start": 30.9, "end": 32.9, "text": "Let's go, baby, let's go."}, {"id": 13, "start": 34.9, "end": 37.9, "text": "Ich weiß nicht, ob ihr, habt ihr den Knall im Hintergrund noch gehört?"}, {"id": 14, "start": 37.9, "end": 41.9, "text": "Wahrscheinlich, aber das war gerade, wo Anthem gelaufen ist."}, {"id": 15, "start": 43.9, "end": 45.9, "text": "Boah."}, {"id": 16, "start": 45.9, "end": 47.9, "text": "Ey."}, {"id": 17, "start": 48.9, "end": 50.9, "text": "Das, äh, das hatte ich auch noch net."}, {"id": 18, "start": 50.9, "end": 52.9, "text": "Das quasi..."}, {"id": 19, "start": 52.9, "end": 55.9, "text": "...Pletzeinschlag in der Nähe ins Internet weg."}, {"id": 20, "start": 55.9, "end": 57.9, "text": "Krasser Scheiß."}, {"id": 21, "start": 57.9, "end": 59.9, "text": "Okay, ähm..."}, {"id": 22, "start": 59.9, "end": 62.9, "text": "Ich würd' mal sagen, es ist fertig, oder?"}, {"id": 23, "start": 62.9, "end": 65.9, "text": "Das Stream ist fertig, ne?"}, {"id": 24, "start": 65.9, "end": 67.9, "text": "Seh ich das richtig?"}, {"id": 25, "start": 67.9, "end": 72.9, "text": "Das ist jetzt quasi so das Programm, was hinten dran kommt."}, {"id": 26, "start": 76.9, "end": 81.9, "text": "Okay, dann, ähm, dann können wir nochmal unser Bullshit kurz abhaken."}, {"id": 27, "start": 81.9, "end": 85.9, "text": "Unser Bullshit-Bingo."}, {"id": 28, "start": 93.9, "end": 96.9, "text": "Also, im Prinzip war ja, es war ja so ziemlich alles dabei."}, {"id": 29, "start": 96.9, "end": 101.9, "text": "Äh, hatten wir? Hatten wir? Hatten wir? Hatten wir?"}, {"id": 30, "start": 101.9, "end": 105.9, "text": "Äh, free to play? Weiß ich nicht."}, {"id": 31, "start": 105.9, "end": 107.9, "text": "Football hatten wir."}, {"id": 32, "start": 107.9, "end": 109.9, "text": "Superlative hatten wir."}, {"id": 33, "start": 109.9, "end": 111.9, "text": "Cringe hatten wir."}, {"id": 34, "start": 111.9, "end": 113.9, "text": "Fußball hatten wir."}, {"id": 35, "start": 113.9, "end": 115.9, "text": "Basketball hatten wir."}, {"id": 36, "start": 115.9, "end": 117.9, "text": "Nee."}, {"id": 37, "start": 117.9, "end": 119.9, "text": "Doch."}, {"id": 38, "start": 119.9, "end": 121.9, "text": "Haben wir Basketball?"}, {"id": 39, "start": 121.9, "end": 123.9, "text": "Star Wars hatten wir."}, {"id": 40, "start": 123.9, "end": 126.9, "text": "Battlefront 2 Schadensbegrenzung hatten wir."}, {"id": 41, "start": 126.9, "end": 128.9, "text": "Schlechte Musik DLC hatten wir."}, {"id": 42, "start": 128.9, "end": 130.9, "text": "Besten Fans hatten wir."}, {"id": 43, "start": 130.9, "end": 132.9, "text": "Exclusive hatten wir."}, {"id": 44, "start": 132.9, "end": 135.9, "text": "Ähm, live real in-game Gameplay hatten wir."}, {"id": 45, "start": 135.9, "end": 138.9, "text": "Sportler auf der Bühne hatten wir."}, {"id": 46, "start": 138.9, "end": 141.9, "text": "Indie-Devs, die nicht so richtig Indie sind hatten wir."}, {"id": 47, "start": 141.9, "end": 143.9, "text": "Das war's."}, {"id": 48, "start": 143.9, "end": 146.9, "text": "Also, komm, also wir haben wirklich, wir haben, ne?"}, {"id": 49, "start": 146.9, "end": 147.9, "text": "Big Brain."}, {"id": 50, "start": 147.9, "end": 151.9, "text": "Ja, wir haben schon, wir haben schon gut gelegen."}, {"id": 51, "start": 151.9, "end": 155.9, "text": "Sims hatten wir auch, ja."}, {"id": 52, "start": 155.9, "end": 160.9, "text": "Also wir haben schon, also wir waren wirklich gut, muss man sagen."}, {"id": 53, "start": 164.9, "end": 166.9, "text": "Basketball und free to play."}, {"id": 54, "start": 166.9, "end": 171.9, "text": "So, und jetzt, bevor wir Schluss machen, müssen wir uns noch dieses ganz tolle Game angucken."}, {"id": 55, "start": 171.9, "end": 179.9, "text": "Also, C&C, wie hieß, wie hieß das, die Live Enhancing Experience?"}, {"id": 56, "start": 179.9, "end": 182.9, "text": "C&C Rivals Play Store."}, {"id": 57, "start": 182.9, "end": 187.9, "text": "Also, gucken wir uns das Ganze mal an."}, {"id": 58, "start": 187.9, "end": 189.9, "text": "Nein."}, {"id": 59, "start": 191.9, "end": 194.9, "text": "Hieß, hieß das Rivals?"}, {"id": 60, "start": 194.9, "end": 197.9, "text": "Da ist es."}, {"id": 61, "start": 197.9, "end": 199.9, "text": "So."}, {"id": 62, "start": 201.9, "end": 203.9, "text": "Wie kann man das runterladen?"}, {"id": 63, "start": 203.9, "end": 204.9, "text": "Gar nicht."}, {"id": 64, "start": 204.9, "end": 208.9, "text": "Ach nee, okay, okay, also."}, {"id": 65, "start": 208.9, "end": 212.9, "text": "Pre-Alpha-Players may experience, okay, bla, bla, bla."}, {"id": 66, "start": 212.9, "end": 215.9, "text": "Okay, ja."}, {"id": 67, "start": 217.9, "end": 220.9, "text": "Pre-Register today."}, {"id": 68, "start": 220.9, "end": 230.9, "text": "Mobile Games at its best, its finest, ja."}, {"id": 69, "start": 233.9, "end": 242.9, "text": "Also sprich, wenn wir uns heute registrieren, dann kriegen wir das Early Bird Bundle, wo eine Titan-Unit drinne ist, Diamanten, Credits."}, {"id": 70, "start": 242.9, "end": 246.9, "text": "Das heißt, es gibt schon mal zwei In-Game-Währungen, was auch ganz besonders toll ist."}, {"id": 71, "start": 246.9, "end": 249.9, "text": "Sobald sollte das Spiel irgendwann mal launchen."}, {"id": 72, "start": 249.9, "end": 252.9, "text": "Beste."}, {"id": 73, "start": 254.9, "end": 257.9, "text": "Beste."}, {"id": 74, "start": 257.9, "end": 262.9, "text": "Und kostet das jetzt was oder kostet das nichts?"}, {"id": 75, "start": 262.9, "end": 267.9, "text": "Ich bin nicht eingeloggt, keine Ahnung."}, {"id": 76, "start": 267.9, "end": 271.9, "text": "Ich sehe jetzt gar nicht, wie ich mir das runterladen könnte."}, {"id": 77, "start": 271.9, "end": 273.9, "text": "Müsste ich jetzt mal auf dem Tablet gucken."}, {"id": 78, "start": 273.9, "end": 277.9, "text": "Es hat eben einer gefragt, was ich für ein Tablet habe."}, {"id": 79, "start": 277.9, "end": 282.9, "text": "Keine Ahnung, was zu sagen, ich habe..."}, {"id": 80, "start": 282.9, "end": 292.9, "text": "Also, insgesamt haben wir fünf Tablets, allerdings sind davon bloß drei in Benutzung."}, {"id": 81, "start": 292.9, "end": 297.9, "text": "Wir haben einen Asus ZenPad."}, {"id": 82, "start": 297.9, "end": 300.9, "text": "Wir haben ein Nvidia Shield Tablet."}, {"id": 83, "start": 300.9, "end": 303.9, "text": "Und ein iPad."}, {"id": 84, "start": 303.9, "end": 307.9, "text": "Die anderen beiden sind ein Nvidia Tegra Sonstwas."}, {"id": 85, "start": 307.9, "end": 310.9, "text": "Und ein Lenovo Tablet."}, {"id": 86, "start": 310.9, "end": 323.9, "text": "Das hängt einmal im ersten Stock und einmal im Erdgeschoss als Heimautomatisierungs-Dashboard an der Wand."}, {"id": 87, "start": 323.9, "end": 329.9, "text": "So, Leute."}, {"id": 88, "start": 329.9, "end": 331.9, "text": "Eigentlich sind wir jetzt ja schon durch."}, {"id": 89, "start": 331.9, "end": 333.9, "text": "Meine Stream ist vorbei."}, {"id": 90, "start": 333.9, "end": 342.9, "text": "Dass bei mir ein Blitz auf der Straße eingeschlagen ist, da konnte ich noch wirklich nichts dran ändern."}, {"id": 91, "start": 342.9, "end": 344.9, "text": "Ich hoffe, euch hat es gefallen."}, {"id": 92, "start": 344.9, "end": 362.9, "text": "Wann sind denn die nächsten Pressekonferenzen?"}, {"id": 93, "start": 362.9, "end": 371.9, "text": "Ok, Pressekonferenzen E3, was gibt es denn hier?"}, {"id": 94, "start": 371.9, "end": 379.9, "text": "Was?"}, {"id": 95, "start": 379.9, "end": 384.9, "text": "Ok, was haben wir denn hier so zu bieten?"}, {"id": 96, "start": 384.9, "end": 387.9, "text": "Heute war nur EA."}, {"id": 97, "start": 387.9, "end": 392.9, "text": "Morgen 22 Uhr ist Microsoft."}, {"id": 98, "start": 392.9, "end": 395.9, "text": "Wollen wir uns Microsoft angucken morgen?"}, {"id": 99, "start": 395.9, "end": 397.9, "text": "Wollen wir Microsoft gucken?"}, {"id": 100, "start": 397.9, "end": 401.9, "text": "Ich meine, es ist kaum, das von EA ist kaum zu unterbieten."}, {"id": 101, "start": 401.9, "end": 404.9, "text": "Das war diesmal wirklich unglaublich langweilig."}, {"id": 102, "start": 404.9, "end": 407.9, "text": "Das einzig bisschen Interessante war am Anfang zu Battlefield."}, {"id": 103, "start": 407.9, "end": 409.9, "text": "Und dann am Ende zu Anthem."}, {"id": 104, "start": 409.9, "end": 414.9, "text": "Oder Anthem..."}, {"id": 105, "start": 414.9, "end": 420.9, "text": "Der Rest dazwischen war Resident Sleeper."}, {"id": 106, "start": 420.9, "end": 423.9, "text": "So, und dann haben wir in der Nacht..."}, {"id": 107, "start": 423.9, "end": 427.9, "text": "In der Nacht von Sonntag auf Montag um 3.30 Uhr Bethesda."}, {"id": 108, "start": 427.9, "end": 434.9, "text": "Boah, diese Zeiten sind für EU-Zeiten so scheiße."}, {"id": 109, "start": 434.9, "end": 437.9, "text": "Digital Divorce 5 Uhr."}, {"id": 110, "start": 437.9, "end": 440.9, "text": "Square Enix könnte man uns angucken."}, {"id": 111, "start": 440.9, "end": 443.9, "text": "Und Ubisoft 22 Uhr Montag."}, {"id": 112, "start": 443.9, "end": 451.9, "text": "Das ist doch Mist."}, {"id": 113, "start": 451.9, "end": 453.9, "text": "Also Microsoft können wir uns angucken."}, {"id": 114, "start": 453.9, "end": 459.9, "text": "Microsoft morgen machen wir."}, {"id": 115, "start": 459.9, "end": 463.9, "text": "Und dann würde ich vorschlagen, machen wir das einfach so."}, {"id": 116, "start": 463.9, "end": 466.9, "text": "Also Bethesda um 3 Uhr nachts, nee, mach ich nicht."}, {"id": 117, "start": 466.9, "end": 469.9, "text": "Und die anderen, die können wir hier rewatchen oder irgendwie sowas."}, {"id": 118, "start": 469.9, "end": 471.9, "text": "Mal gucken."}, {"id": 119, "start": 471.9, "end": 474.9, "text": "Weil ich meine, hier muss ich arbeiten, Dienstags."}, {"id": 120, "start": 474.9, "end": 476.9, "text": "Kann man eh knicken."}, {"id": 121, "start": 476.9, "end": 478.9, "text": "18 Uhr kommen wir ans Nintendo."}, {"id": 122, "start": 478.9, "end": 480.9, "text": "18 Uhr Nintendo, das gucken wir uns an."}, {"id": 123, "start": 480.9, "end": 483.9, "text": "Da bin ich daheim auf jeden Fall."}, {"id": 124, "start": 483.9, "end": 486.9, "text": "Ubisoft 22 Uhr könnten wir vielleicht machen."}, {"id": 125, "start": 486.9, "end": 488.9, "text": "Square Enix können wir machen."}, {"id": 126, "start": 488.9, "end": 490.9, "text": "Und Microsoft können wir machen."}, {"id": 127, "start": 490.9, "end": 495.9, "text": "Im Prinzip verpassen wir eins plus die beiden."}, {"id": 128, "start": 495.9, "end": 501.9, "text": "Das sind doch die Shadow Warrior Typen, oder?"}, {"id": 129, "start": 501.9, "end": 505.9, "text": "Ja, das wird bestimmt lustig."}, {"id": 130, "start": 505.9, "end": 507.9, "text": "Wann ist CD Projekt RED? Gar nicht."}, {"id": 131, "start": 507.9, "end": 510.9, "text": "Zumindest nicht mit einer eigenen Geschichte."}, {"id": 132, "start": 510.9, "end": 512.9, "text": "Vielleicht zeigen die ja was von Steam."}, {"id": 133, "start": 512.9, "end": 515.9, "text": "Wie heißt das? Cyberpunk?"}, {"id": 134, "start": 515.9, "end": 517.9, "text": "Wie heißt das neue Game von dem?"}, {"id": 135, "start": 517.9, "end": 523.9, "text": "Irgendwas mit Punk und Cyberpunk."}, {"id": 136, "start": 523.9, "end": 530.9, "text": "Vielleicht zeigen sie das ja bei Sony oder Microsoft oder sowas."}, {"id": 137, "start": 530.9, "end": 533.9, "text": "Man kommt ja auch für PS4 und Xbox und vielleicht zeigen sie das ja hier."}, {"id": 138, "start": 533.9, "end": 540.9, "text": "Bullshit Bingo für Ubisoft."}, {"id": 139, "start": 540.9, "end": 545.9, "text": "Bullshit Bingo geht eigentlich bei Activision und EA immer am besten."}, {"id": 140, "start": 545.9, "end": 547.9, "text": "Activision hat es ja kein Bock."}, {"id": 141, "start": 547.9, "end": 551.9, "text": "Und EA war dieses Jahr wirklich sehr enttäuschend."}, {"id": 142, "start": 551.9, "end": 559.9, "text": "Oder sagt mal Leute, wie fandet ihr denn die EA Pressekonferenz?"}, {"id": 143, "start": 559.9, "end": 582.9, "text": "Ja, Resident Sleeper."}, {"id": 144, "start": 582.9, "end": 584.9, "text": "Ich fand es auch wirklich schwach."}, {"id": 145, "start": 584.9, "end": 589.9, "text": "Es war nichts, wie gesagt, ernsthaft am Ende dazwischen."}, {"id": 146, "start": 589.9, "end": 592.9, "text": "Am verwirrendsten fand ich das eine Indie-Game vom deutschen Studio,"}, {"id": 147, "start": 592.9, "end": 600.9, "text": "wo man echt keinen Schimmer hatte, was es eigentlich ist."}, {"id": 148, "start": 600.9, "end": 608.9, "text": "Habt ihr zufällig den Mesh, den Lost irgendwo erspäht, dem Publikum?"}, {"id": 149, "start": 608.9, "end": 635.9, "text": "Es war langweilig."}, {"id": 150, "start": 635.9, "end": 638.9, "text": "Warum das Ding Comaten Conquer heißen muss?"}, {"id": 151, "start": 638.9, "end": 645.9, "text": "Ich meine, es ist klar wegen dem Namen, aber guckt mal."}, {"id": 152, "start": 645.9, "end": 648.9, "text": "Vergleicht mal diesen Crap hier."}, {"id": 153, "start": 648.9, "end": 652.9, "text": "Das ist doch kein Echtzeitstrategiespiel, wie man sich das vorstellt."}, {"id": 154, "start": 652.9, "end": 655.9, "text": "Das ist doch Mobile-Kacke."}, {"id": 155, "start": 655.9, "end": 658.9, "text": "Guckt euch den Cramper hier mal an und dann vergleichen wir das mal,"}, {"id": 156, "start": 658.9, "end": 667.9, "text": "beispielsweise mit, nein, mein Meme-Tool nervt rum, mit Generals."}, {"id": 157, "start": 667.9, "end": 669.9, "text": "Für mich das beste Comaten Conquer."}, {"id": 158, "start": 669.9, "end": 673.9, "text": "So, wenn man das hier vergleicht, guckt mal, da gibt es auch Missiles,"}, {"id": 159, "start": 673.9, "end": 675.9, "text": "aber auch noch ein bisschen mehr anderes Zeug."}, {"id": 160, "start": 675.9, "end": 678.9, "text": "Das ist ein echtes Comaten Conquer. Guckt euch das mal an."}, {"id": 161, "start": 678.9, "end": 684.9, "text": "Das vergleicht mal den Crap, den Mist hier, das da, damit."}, {"id": 162, "start": 684.9, "end": 697.9, "text": "MonkaS, was ist das?"}, {"id": 163, "start": 697.9, "end": 703.9, "text": "Das war die Anele-Fraktion hier, kann ich mich noch dran erinnern."}, {"id": 164, "start": 703.9, "end": 705.9, "text": "Das ist doch nichts."}, {"id": 165, "start": 705.9, "end": 712.9, "text": "Cash-Crap."}, {"id": 166, "start": 712.9, "end": 714.9, "text": "Die Webalm-Blendung und das Bullshit-Bingo haben die PK gerettet."}, {"id": 167, "start": 714.9, "end": 719.9, "text": "Da bin ich ja froh."}, {"id": 168, "start": 719.9, "end": 723.9, "text": "Ja, das ist schön, dass euch das Stream gefallen hat."}, {"id": 169, "start": 723.9, "end": 731.9, "text": "Die Pressekonferenz war ja nur ja ziemlich am Mist."}, {"id": 170, "start": 731.9, "end": 741.9, "text": "Ja, Henyo sehe ich auch so, Generals war das Beste."}, {"id": 171, "start": 741.9, "end": 743.9, "text": "Ich hoffe, euch hat es gefallen."}, {"id": 172, "start": 743.9, "end": 745.9, "text": "Wir sehen uns das nächste Mal."}, {"id": 173, "start": 745.9, "end": 752.9, "text": "Bye, spätestens sehen wir uns morgen 22 Uhr."}, {"id": 174, "start": 752.9, "end": 754.9, "text": "Wo ist es denn jetzt? Microsoft hier."}, {"id": 175, "start": 754.9, "end": 758.9, "text": "Morgen 22 Uhr sehen wir uns spätestens wieder zur Microsoft Pressekonferenz"}, {"id": 176, "start": 758.9, "end": 767.9, "text": "und Resident Sleeper da wahrscheinlich auch so vor uns hin."}, {"id": 177, "start": 767.9, "end": 768.9, "text": "Macht es gut."}, {"id": 178, "start": 768.9, "end": 773.9, "text": "Bis morgen, tschüss."}, {"id": 179, "start": 773.9, "end": 799.9, "text": "CU."}]}