{"text": "da bin ich relativ spontan ich habe ein bisschen zeug aus ich habe meine steamlibrary durchgeguckt bisschen zeug aus dem angeguckt nämlich festgestellt ichhabe bock auf nix deswegen habe ich einfach mal den stream angemachtja ja ja ja ja cringe kein kein stream heute ich habe auch nix geplant betkebetke ist in betke ist in 145 betke auf origin ja auf origin was machteigentlich wenn es gerade das mal kurz checken das war kurz mal eine gucken wasmeint ihr was ist der was ist der meistbesuchte wenn es so aber ich tippeauf fünf leute kurz checken kurz checkenacht klar dass da nix los istwahrscheinlich ist auch noch ein server mit bots drauf so ja keine ahnung derserver namen habe ich gar nicht gelesen habe ich jetzt gar nicht anguckt wasist das aber was war das war das top mal das monka tostserver namenmost played vr server ja gut mit zehn slotssind wir jetzt eigentlich nicht na ja ich finde das also generell ist und alsoist sinnlos gehyped zu sein eigentlich in der regel immer nicht gut also ichtippe ja drauf dass es schon ein geiles battlefield wird aber das garantiertwieder zwei drei sachen drin sind die richtig abfackenich meine wir wissen nicht wie sich der kram spielt es gibt ja gibt ja bald einebeta oder warte mal wann war die ich habe schon siebte achte newann war mal mal neu war wa du failed bitte an warten das noch malgreyzu battlefield 20 2 42 alles klarWo steht denn der Termin jetzt? September, also irgendwie siebter, siebter neunter oderirgendwie sowas war das, war das glaube ich geleakt mal, naja also spätestens dann wissenwir ob das Game was taucht, das ist so ein bisschen wie, das wird so ein bisschen wiedie Beta von New World jetzt, New World, New Worlds, New World heißt es genau, also alleswas dann kacke sein wird an dem Game, wird bei Release auch noch kacke sein, hör vonausgehen, fand es ja wieder lustig, in meinem Video konnten sich die Leute ja wieder nichteinigen, ob ich das Spiel jetzt zu sehr lobe oder zu schlecht mache, New Worlds, ich musssagen ich hab jetzt gar nicht mehr so großartig gespielt, bei mir war nach Level, keine Ahnung18 oder so, war knapp, war die Luft raus, das Problem ist ich wollte eigentlich spielenbis zuerst, bis zum ersten PvM Raid, hab ich aber nicht gemacht, weil das, also es istja normal, ich hab ja nichts dagegen wenn MMOs Kreiselcrimes sind und ich hab ja auchnichts dagegen wenn MMOs sich irgendwie wiederholen, aber New World war ja im Endeffekt stattQuest Board, klick klick klick, einmal im Kreis laufen, statt Quest Board, klick klickklick, einmal im Kreis laufen, also das war mir dann auch zu dumm, ansonsten hab ich nachwie vor die Vermutung, dass viele Mechaniken in dem Spiel nicht genug Tiefgang bietenauf Dauer, tja, aber mal gucken, es ist auf jeden Fall das einzige was Amazon noch irgendwie,das einzige wie sagt man schon, das einzige Eisen was Amazon noch im Feuer hat, auch totalboomerspruch, nee das ist eigentlich noch im Mittelalterspruch eher, das einzige Eisenwas Amazon noch im Feuer hat, alles andere haben sie verkackt, Herr der Ringe MMO habensie eingestellt, Leute ich sag's euch, ich sag's euch, ich sag's euch wie es ist, Amazonmöchte ja eine Herr der Ringe Serie machen, ich sag euch die wird sacken, ich könnte,ich mach ich nicht, aber ich könnte meinen Arsch drauf verwenden, dass die Serie sackenwird, wann auch immer die rauskommen, man weiß es ja gar nicht, ich glaube wirklichdas Portal gar nicht so der Hammer wird für die meisten Leute, weil es ist halt kein MapEditor, es ist ein Spielmodus Editor, ich weiß nicht ob das reicht wahnsinnig interessanteDinge zu machen, in Overwatch ist das auch eher so ein Gimmick, dass es sowas gibt,man kann natürlich in Portal deutlich mehr machen, als man es in Overwatch Custom Lobbysmachen kann, wie kann man Daten von einer Bluetooth Waage auslesen, du musst ja erstmaldas Protokoll raussuchen, also nicht Bluetooth sondern das Custom oder weiß ich auch wasProtokoll nennt, das Format in dem die Bluetooth Waage Sachen versendet, also wenn die Sachenverschlüsselt sind und der Key nicht öffentlich ist, hast du eh wahrscheinlich gelitten,aber bei den meisten halbwegs verbreiteten Sachen, haben das schon findige Leute ausden Apps extrahiert, ich muss mich mal ordentlich hinsetzen, sonst pinche ich gleich ein, dasheißt du musst erstmal am besten nach dem Typ der Waage suchen, dann guckst du ob esirgendjemand gibt, der schon das Protokoll bzw. das Format der Daten irgendwie rausbekommenhat, wie das verschickt wird und dann nimmst du dir irgendeinen Controller und liest denKram aus, musst du selbst programmieren oder es gibt schon was fertiges, am einfachstenist natürlich mit der offiziellen App von der Waage, aber dann hast du auch die gleichenBeschränkungen und im Zweifelsfall China Cloud, China-Chinesen Cloud am Start, machtda eigentlich Aliexpress und sind da wieder die Versand, sind bei Aliexpress eigentlichjetzt immer endlich die Versandkosten wieder normal, kurz checken, ja natürlich kauf mirschnell ein Auto bei Aliexpress, auf gehts, bam, oh super, das haben, was zum geil solldas sein, was ist das, eine Matratze für den Kofferraum, ok, China Zeug, wird das einResident Sleeper oder Five Head Stream, weiß ich nicht, sind die Versandkosten wieder normal,zeig her, Aliexpress, ich will das nicht kaufen, Chips from Frankreich, ok die Versandkosten,wow, warum ist das auf einmal, Alter, äh, aner stellt es da nicht zurück, warum kannich nur einen bestellen über Safer Shipping, was ist das für Gebate, kostenloser Versand,jawoll, die haben es auch auf einen beschränkt, also man kann echt bei den China-Chinesengrad nicht bestellen, kannst du das Video zum ersten Ausbildungstag vor dem zweitenund achten hochladen, ja ich hab mir überlegt ob ichs am Wochenende mach, also hier so irgendwann,ich muss mal gucken, ich muss aber noch irgendwas anderes hochladen in der Zwischenzeit, dassind ja Videos die jetzt nicht so viele Leute interessiert, das interessiert die Leute dieeine Ausbildung machen oder anfangen, aber insgesamt ist jetzt nicht so viel, einfach5 mal bestellen, ja wenns kostenlos ist kann man das machen, aber die sind nicht doof,die sind nicht doof, gibt es eigentlich, da hab ich lange nicht mehr drauf geguckt aufden Channel, hat er eigentlich neue Battlefield 3 Top Plays, nö, gibt keine mehr, keinerspielt bei Battlefield 3, oh, ich hab gehört, wir haben bei den Olympischen Spielen im Tresur-Reitenwieder gewonnen, meine absolut Lieblingssportart, Tresur-Reiten, ganz ganz spannend, also esgibt glaub ich kaum eine mehr Residenz-Sleeper-Sportart als Tresur-Reiten, nix gegen Tresur-Reiter,weißte es einer von euch macht, aber ich bezweifle es, ja gut, in dem Fall, das stimmt, das stimmt,keine Ahnung, ich hab das doch nicht geguckt, ich hab nur heute zufällig gelesen, dass wirne Medaille gewonnen haben, ist mir auch vollkommen egal, wenn ich ehrlich bin, also Tresur-Reitenkönnte mich kaum weniger interessieren, 20 Jahre Kubernetes-Erfahrung, ja, muss sein,also unter 20 Jahre Kubernetes-Erfahrung würd ich dich auch nicht einstellen, ach, ich weißgar nicht, ich glaub so, ich glaub so, es ist auf jeden Fall anstrengender als vorm Rechnersitzen. Competition, ich frag mich eh, wann es E-Sport gibt bei Olympia. Das OlympischeCS-Turnier, das wär doch mal was, oder? Langsam ist es echt mal an der Zeit, was da teilweisefür merkwürdige Sportarten am Start sind, von denen ich noch nie was gehört hab, undich sag euch, es würde definitiv Aufmerksamkeit bringen, dann habt ihr natürlich wieder dieBoomer-Leute, die sagen, was, das, das ist doch kein Sport, den Scheiß da, den willich mir nicht angucken, so, haste da wieder genug Leute, aber es würde auf jeden FallAufmerksamkeit bringen, also ich würd mir lieber das Olympische CS-Turnier angucken,als Tresur reiten. Gibt's schon relativ lange. Haben wir doch letztens erst gemacht. DieChinesen haben ein Zollproblem, na, eigentlich haben die sich ja da ganz gut drauf vorbereitetmit Warenlager in der EU, oder eben nach Niederlande oder Spanien schicken. Die chinesischen,China-Chinesen, ja. Was hat hier jemand? Ein Link, damit man Azure-Test-Coins bekommt.Ne, ich weiß gar nicht, was Azure-Test-Coins sind. Aber jetzt ein Partnerprogramm, wo manLeute werben kann. Ach, haben wir uns eigentlich schon das, ja, das haben wir uns angeguckt,JetBrains. Das wollte ich mir mit euch aber noch ein bisschen näher angucken, genau, dieAbstimmung von JetBrains zu Programmiersprachen und Verwendung von Betriebssystemen und sowas,das fand ich eigentlich ganz spannend. Die Seite ist irgendwie ein bisschen zu rechtsbündig,oder? Die sollte eigentlich, ich hab den Eindruck, die Seite sollte eigentlich eher ein bisschenmehr zentriert sein. Ach so, gratis testen kannst du bei Azure, na gut, da brauchst dueine neue Handy-Nummer, ja. Mit der neuen Handy-Nummer kannst du deinen Probo-Account machen. Brauchstneuen Accounten und eine Handy-Nummer. Dann kannst du, fragt mich nicht, was da, Basic,100 Euro, Dollar, keine Ahnung. Wollen sie das? Hab ich noch nix von gehört. Die sollenwir alle mal machen. Joa. Habt ihr das eigentlich mitbekommen, dass die Apotheken, ich weiß,das ist jetzt auch schon ein paar Tage halt, wahrscheinlich ist es schon wieder News vongestern, ja, aber habt ihr das mitbekommen mit den Apotheken und dem Corona-Zertifikat,dass alle Apotheken wohl den gleichen Private Key benutzen, um die Zertifikate auszustellen?Und dass es dementsprechend keinen Weg gibt, quasi gefakte Corona-Zertifikate zurückzurufen,das ist, das ist echt typisch Big-Brain-Technik wieder, gut. Was macht eigentlich so der europäischeImpfpass? Gibt's den jetzt und kann man den benutzen? Ist, es ist so ein Geficke. Gatschi-Buzz,also ich hab, ich hab ja erst eine Impfung, aber ich hatte irgendwelche QR-Codes zumScannen. Ach, keine Ahnung. Zweifelsfall nehme ich irgendein Zettel mit. Ja, aber, aber dasbenutzt wahrscheinlich kaum einer oder es gibt irgendwelche Probleme. Hey, wenn derPrivate Key geleakt sein sollte, könnte ich mir einfach selbst das ausstellen. Echt, wasist? Ich habe auf Twitter gelesen von einem, der mit Herzmuskelentzündung ins Krankenhaus,also einen, den ich kenne, mit Herzmuskelentzündung ins Krankenhaus gekommen ist nach der Impfungmit BioNTech. Ja, ist trotzdem Fail. Also macht's ja nicht besser, nur weil's vor dem Launchklammer.Ist halt für, naja, letztendlich, ich erwarte ja da auch schon gar nichts mehr. Ja gut, diehaben's eh verkackt. Also ich krieg meine zweite Impfung am, lass mal gucken, ich glaube,am 23.08. krieg ich, oh Moment. Wie sind die eigentlich auf die dumme Idee gekommen, dassder Pfeil nach oben in den Monat zurückgeht? Total hängen geblieben, Microsoft. Wahrscheinlicham, ich glaube hier, ich glaube am 23.08. Also ich hatte nix, mir hat der Arm ein bisschenwehgetan, also ich hatte gar nix davon. Also gut, es ist natürlich individuell, aber ichkann schon von mir sagen, ich hatte gar nix. Ich hatte ein bisschen Kopfweh und ein bisschen,dass mir der Arm wehgetan hat, wenn ich drauf gelegen hab zwei Tage, aber sonst, ich hatteeigentlich nix. Haut erst bei der zweiten rein, MonkaS, der Chat macht mir aber Mutdrauf, aber eins sag ich euch, eins sag ich euch, ich hab ja den Terminshot, ich lassmich auch impfen, ich find das auch ne wichtige Sache, dass man das macht, aber sollte irgendeinerauf die Idee kommen, mich zwingen zu wollen, dann sag ich ab, das sag ich euch. Wenn irgendjemandwirklich auf die Idee kommt und sich quasi über meinen Kopf hinweg entscheidet, wasich zu tun hab oder zu lassen hab, dann sag ich das ab. Also ihr könnt euch sagen, soviel ihr wollt, wenn irgendjemand sagt, es besteht Pflicht, dass ich das machen mussunter Androhung von Strafe, dann mach ich das nicht. Das seh ich nicht ein. Auch wennich's sinnvoll finde und mich auch freiwillig, ich lass mich freiwillig impfen, keine Probleme,aber nicht unter Androhung von Strafe. Sollte irgendjemand auf die Idee kommen zu sagen,das ist Pflicht, ansonsten musste ich keine Ahnung, Bußgeld bezahlen, dann könnt ihrmich am Arsch lenken. Das seh ich nicht ein. Das ist, mein Körper, das ist meine komplettfreie Entscheidung, das soll's auch bleiben, ich mach's, weil ich's sinnvoll finde, abernicht, weil irgendjemand sagt, ich muss es machen. Ja, ähm, ist das echt so? Ich lassmich, ich, ich, ich lass mir die trotzdem, bäm, 23. Hau, lass ich mir das Ding reinhauen,gut ist. Vielleicht ist es auch 16, ich glaub, es ist, es ist ein Montag im August und, undes ist ein zweistelliger Montag und es ist nicht der, ich glaub, es ist der 23. Ja, genau,beim Armschmerzen hatte ich auch, das war's. Es wird ja sogar empfohlen, dass man die zweitequasi mit was anderem macht. Spackhack, danke schon für 6 Monate, ich hoffe, ich hab keinZap übersehen. Nee, sieht nicht so aus. Wird da teilweise sogar empfohlen, dass maneine andere als zweite Impfung nimmt. Ja, die chinesischen, China-Chinesen haben echtkein Problem mit dem Versand, wie es aussieht. Ich seh schon, bei einigen ging es ab hier.Wie gesagt, ich kenn einen auf Twitter, der musste ins Krankenhaus mit Herzmuskelentzündunghat da geschrieben, das war auch richtig MonkaS. Stonks geht ab, Leute. Okay, also ich sehschon mal, der meiste ist eigentlich kein Problem. Naja. Ich fand's so interessantmit dem Zertifikat bei den Apotheken, so nach dem Motto, warum haben die ein Private Keyfür alles? Keine Ahnung, wer sich das wieder ausgedacht hat. Und übrigens, wisst ihr was,gestern wieder, nee, stimmt nicht. Ja, Mist, Leute, jebaited, das hab ich nicht gesterngemacht. Letzte Woche schon. Was ich letzte Woche wieder verlängert hab, ich hab letzteWoche wieder verlängert, YouTube Premium, aber, aber nicht einfach YouTube Premium,sondern ich hab wieder über Indien bestellt. Guck mal, hier kostet es 12 Euro im Monatund ich hab über Indien bestellt, da kostet es, glaub ich, 340 Indische Rupien. Indische,ich weiß gar nicht, zu Euro, ja, meinetwegen. Da kostet es 3,86 Euro. Und das könnte sogar3 Monate sein. Das könnte sogar 3 Monate sein. Warte mal, Indien YouTube Premium, mal kurzgucken, mal kurz, mal kurz schenken. Naja. Da brauchst du ja nicht My Deals dafür, abervielleicht haben die es mal umgerechnet. Also ich hab das, was irgendwie 340, 340 Rupienkosten. Also ich bezahle dann irgendwie für 3 Monate YouTube Premium, über Indien bezahleich dann irgendwie 350 oder so. Wie funktioniert das? Also da gibt es verschiedene Varianten.Die einfachste Variante ist wahrscheinlich über ein kostenloses VPN, aber ich mach dasimmer so. Ich geh zu Digital Ocean. Das kann man leider nicht über Hetzner machen. Werübrigens 20 Euro Startgut haben für die Hetzner Cloud braucht, weil er mal ein bisschensich mit virtuellen Servern austoben will, Ausrufezeichen Hetzner in den Chat, kriegtihr 20 Euro Startgut haben in meinem Gutscheincode. Aber leider kann man das nicht über die HetznerCloud machen, weil man braucht einen Anbieter, die Server in Indien haben. Und Digital Oceanhat ein Rechenzentrum in Bangalore. Ob da auch Banggood herkommt? So und das heißt man machtsich eine VM, so mach ich das zumindest. Ich hab keinen Bock auf irgendwelche VPN Geschichtenoder sonst was. Ich miete mir einen Server bei Digital Ocean in Bangalore, installieremir auf dem Server einen Firefox, mach den Firefox über X-Forwarding auf, log mich einmit meinem Google Account, kauf YouTube Premium über Paypal und lösche den Server wieder.Das dauert 5 Minuten. Und dann hast du YouTube Premium. Das bezahlst du dann über Paypalin Google im Account und dann hast du für 3,50 Euro YouTube Premium. Guck mal wie teuerder Krempel bei uns ist. Konfigurierst du den Server mit Ansible? Ne, da gibt es nichtszu konfigurieren. Ich lass den so wie es ist, das einzige was ich mache ist Firefox installierenund dann per X-Forwarding drauf, fertig. Nein, lohnt sich nicht. Finde ich, dass sich dasnicht lohnt. Du hast auf dem englischen Layout, gerade wenn du eine englische Tastatur hast,du hast die, von der Beschriftung, du hast Klammern und sowas schon besser platziert,aber ich finde die Umgewöhnung ist nicht wert im Endeffekt. Es gibt ja noch viel abgedrehtereTastaturlayouts zu programmieren. Lohnt sich? Nein, aus deiner Sicht vielleicht, ich sehdas anders. Also ich finde der Aufwand lohnt sich nicht englisches Tastaturlayout zu lernenund zu programmieren. Aber kann jeder machen. Also ich finde es lohnt sich. Wie geht X-Forwarding?Das ist relativ einfach. X-Forwarding geht, achso, ich weiß nicht ob ich euch das zeigenkann. Kann ich euch zeigen, wie X-Forwarding geht. Es ist total einfach. Easy as fuck istX-Forwarding. So. Ich überleg grad, wo connecte ich mich denn mal von hier drauf. Wir könnenCloud-Server anlegen, nur dafür. Ich connecte mich einfach lokal, ist ja egal. So. AlsoX-Forwarding, achso. So. Gut. Also. Du sagst einfach SSH-Y, connectest dich auf den Server,wo du Firefox installiert hast. Und dann sagst du Firefox. Und dann gehts nicht, weil ichX-Forwarding ausgeschaltet hab bei mir lokal. Aber mehr musst du nicht machen. Ich habeinfach die Konfig nicht angepasst, das ist alles. Ich kann auf Raspberry Pi gehen, jastimmt. Äh. Was hab ich denn für ein Pi? Ist das ein Raspberry Pi? Äh. Scheiße. Dasist doch aus dem Kopf jetzt nicht. Was hab ich denn mal für ein Raspberry Pi? Kannstdu dich auch Socksproxy PSSRK? Ja, kannst du auch machen. Äh. Warte mal, erst mal überlegen,was hab ich denn für ein Raspberry Pi hier gerade am Start? Was ist das Ding von derIP? 100? Vielleicht? Ah, das wär ja zu einfach. Ah, ich muss mal kurz in mein DHCP gucken.Zack. Muss mal kurz in mein DHCP. DHCP Server Networks Leases. Hi, was haben wir denn da?Aha, den gibt's nicht. Ach, das ist ja der Vierer. Ah, hier, den da. Perfekt. Für denDrucker. Jawoll. So, verbindst dich auf den Raspberry Pi drauf. Ach, das ist OctoPie.Das ist ein OctoPie standardmäßig für ein Passwort. Kein Schimmer. Meine Güte, äh.Das scheint schwierig zu sein, hier was zu finden. Ok, dann nehm ich den jetzt. Ich habja genug. Ich hab ja genug. Ok, ich hab Key-Authentifizierung und hab kein Key drauf. Leute, ich kann'seuch jetzt nicht zeigen. Ach, das ist ja nicht root, das ist Raspberry, ne? Nee, Pi, Pi-Add.Das ist ja. Ah ja, wunderbar. Ok, Firefox. Ist da Firefox nicht drauf installiert? Chrome?Auch nicht. Na dann. Dann installier ich jetzt einfach. Firefox. Was? Monkeys? Ah, so. Allesklar. Alter. Das ist, das ist gegen mich. Ich kann's euch jetzt nicht zeigen. Das funktioniertnicht. Das mag alles nicht. Will es jetzt auch nicht updaten, weil weiß was der dannalles macht? Yep. Im Prinzip sagst du erst das H-Y. Y ist short, nein. Äh, ja doch,genau, richtig. Also Y ist Abkürzung für X und das macht noch irgendwelche anderenDinger. So, weißt du was? Zeig euch, ich zeig euch, zeig euch das jetzt. Ich zeigeuch das jetzt. Ich mach das jetzt mit Hetzer Server. Login Hetzer. So. Das machen wirjetzt. Nicht DNS. Konsole. New Server. Muss ich mich jetzt erstmal einloggen. Ach, jetztkommt wieder IP League. Fuck. Ich hab kein VPR. Nee, ich zeig's euch nicht. Was hateigentlich mein Raspberry Pi für Schmerzen, dass der hier nicht, nicht, äh, installierenwill, Firefox. Das ist, aber genauso wie ich's euch gezeigt hab, du machst SSH minus Yund dann hast du, ich kann doch mal hier mal, ich mach einfach ETC, SSH, SSHD, config, forwarding.Hier. Da war's doch irgendwo. Hier, allow. Yes. Yes. Restart, SSHD. Ok. SSH, localhost,da machen wir das jetzt so. So, und ich hoffe jetzt funktioniert's, aber Firefox. Jawoll,ja. Der Firefox läuft jetzt nicht bei mir lokal, der Firefox geht jetzt über die SSHVerbindung und er zeigt das Fenster bei mir lokal an. Also dieser Server läuft jetzteigentlich auf dem anderen Rechner und ich hab, ich seh ihn bei mir lokal, so mach ichdas auch. Also sprich, ich hol mir sowas bei Digital Ocean in Indien und verbinde michmit x-forwarding drauf und dann ist gut. Der Kram kostet ja auch nicht viel, weil dierechnen auch, ich glaub sogar minutlich ab. Ja. Pricing. Genau. Ja, da nimmt man einfachirgendwie sowas. Am besten mit 4 CPU-Kernen, das ist ein Browser, das sich halbwegs haltbedient. Ist egal, ob das 40€ im Monat kostet, weil ihr bezahlt. Am Endeffekt, in der Stundeseid ihr locker durch. Es dauert 5 Minuten, wenn man weiß, was man macht. Bei mir aufdem Pi kommt Error-No-Display-Environment-Specified. Hast du dich mit SSH-Y verbunden? Wenn dasnicht geht, installier x-Auth. Das kann sein, dass das fehlt, aber sollte eigentlich nichtfehlen. Muss PSSH-Y drauf. Äh, guck mal, ob x-Auth installiert ist. Hier. Wenn ichinstallier das mal und probier es nochmal. So. Was wir machen? Monk hast dir nix. Ichhab grad 20 Minuten gebraucht für x-Forwarding, weil ich keine Kiste gefunden hab, wo ichdas zeigen konnte. Ja, dann ist ein, dann ist, sobald das da steht, ist eigentlich allesrichtig. Ja, dann musst du, dann guck mal in deine SSH-Config, ob x-Forwarding enabledist. Da muss das drinstehen, x11-Forwarding. Aber wenn nicht. Also wenn das gesetzt ist,dann muss das funktionieren. Das ist eigentlich eines der unkomplizierten Sachen, die es sogibt, x-Forwarding machen. So, und zumindest mach ich dann x-Forwarding über Digital Ocean,Indian, VM und kauf mir Youtube Premium über Indian und bezahl dann 3,50 Euro für 3 Monate.Viel besser als Youtube Premium hier zu kaufen. Easy. Dazu kann man eigentlich nur sagen.So, leider kann man es glaube ich nicht einstellen, dass es automatisch verlängert. Sonst würdeich das nämlich machen. Dann könnte ich mir den Krempel sparen. Wisst ihr, wisst ihrwas Big Brain Time wäre? Richtig Big Brain Time. Wir basteln eine Automatisierung dafür,die mir Youtube Premium kauft. Also man müsste dann, man müsste, man müsste über die DigitalOcean API eine VM erstellen, dann drauf einloggen und dann quasi dort den Browser fernsteuern.Das ist mir aber glaube ich zu viel Aufwand für 5 Minuten klicken. Ja, das ist richtig.Genau. Du musst SSHD noch neu starten, nachdem du die Option gesetzt hast. Aber ansonstenwüsste ich nicht woran das liegen sollte. Warum überhaupt Youtube Premium? Denn zumBeispiel, dass man keine Werbung sich angucken muss auf IOS. Auf IOS kannst du ja leidernichts gegen Werbung machen. Weil Apple sich gedacht hat, es gibt keine alternativen Apps.Nee. Ja, Bedgetime in eineinhalb Stunden. Was meinst du dann? Und ansonsten, ansonstenjuckt mich Youtube Premium eigentlich. Ich hab das nur wegen der Werbung. Bringt nix.Zumindest nicht auf IOS. Oder ich müsste es mal wieder probieren. Hat jemand Pieholeim Einsatz? Und IOS, Youtube geht das mittlerweile wieder? Nee. Nee, dann muss ich es auch nichtausprobieren. Ja, Twitch geht auch nicht. Nee, Apple, also die sind ja da trickreich.Du kannst dich ja da auch nicht irgendwie reinhängen oder so. Auf Android ist das alleskein Problem. Auf Android hast du sowohl für Twitch als auch für Youtube alternativeApps, wo das geht. Leider für Twitch nichts gescheites. Für Youtube gibt es ja ein paar.Easy. Ja, und der IOS hast du halt gelitten. Aber ganz im Ernst, 3,50 Euro für 3 Monate,das kann ich mir grad noch so leisten. Das ist okay. Warum geht eigentlich der Darkreadernicht auf Youtube hier? Und warum ist das so eine Flashbang-Seite von Weiß auf Schwarzund dann wird der Hochscore wieder Weiß? Twitch-Werbung kann man nicht gescheit blocken. Nee. Weißgar nicht, ob das Monkrat Toss ist, wenn man in einem Stream erzählt, wie man Twitch-Werbungblockt. Meint ihr, das ist Toss? Das ist bestimmt Toss. Also ich glaube nicht, dass es gescheitfunktioniert aktuell. Es geht im Zweifelsfall nur mit customized Regex-Block-Regeln oderirgendwelchen neuen Addons, die noch trickreicher sind. Was ist denn das? Sehr cube. Ja, dasgeht aber nur. Das kannst du sideloaden, ne? Das kannst du sideloaden, aber sideloadeteApps musst du ja alle einmal in der Woche neu sideloaden oder sowas. Da war doch wasbei IOS. Wenn du kein offizielles Developer-Zertifikat hast für das Gerät oder für dein Account,das damit verknüpft ist, musst du alle 7 Tage neu sideloaden oder wie ist das nochmal?Also Apple macht es einem echt schwer. Apple macht es einem wirklich schwer mit seinemeigenen Gerät das machen zu können, was man will. Wobei, was als eigenes Gerät? Ich habdas Ding ja immer noch von der Firma gesponsert bekommen. Also da will ich mich mal gar nichtbeschweren. Jetzt ist mal wieder der Zeitpunkt zu erwähnen, weil der Chat das immer so besondersgerne hört. Es gibt außer Safari keine weiteren Browser auf IOS. Chrome und Firefox existierennicht auf IOS, so wie man denkt. Ja, genau, nur Browser. Oh, heute sind Big Brain Leuteam Start. Heute diskutiert keiner. Nein, bei Mac OS ist das nicht so. Bei Mac OS kannstdu noch normale Browser installieren. Aber unter IOS geht das nicht. Wenn du Chrome undFirefox installierst, unter IOS ist das ein Reskin für Safari. Weil Apple sagt, ihr dürftkeine Browser anbieten für unsere Plattform, die nicht im Kern Safari verwenden. Und daswäre ja auch gar nicht so schlimm, wenn Safari nicht so scheiße wäre mit den aktuellen Sachen.Keine Web-Notifications, keine gescheite PWA-Unterstützung, Web-RTC-Zeug, was nicht richtig funktioniert.Safari ist Paints-Champ. Auf dem Desktop nicht ganz so sehr, aber auf IOS richtiger Paints-Champ.Deswegen funktioniert ja auch der Preis-Champ unter Safari nicht komplett. Web-Notifications,guck mal, Web-Notifications funktionieren unter Android hier wunderbar. Unter IOS kannstes vergessen, unter IOS kannst du dich nicht vom Preis-Champ benachrichtigen lassen. UndWeb-Notifications kannst du ja einfach ausschalten oder nur für bestimmte Seiten erlauben, dasist ja nicht das Problem. Also man kann es ja nicht, nur weil manche Sachen nerven, wennman sie blöd einstellt, kann man ja nicht sagen, es ist komplett sinnlos. Doch der Preis-Champist outdated. Ich habe aber keinen Bock mehr am Preis-Champ was zu machen. Du machst, nee,nee, nee, nee, nee, nicht alles. Nicht alles. Ich habe ein paar Raspberry Pi Zeroes, ichhabe ein paar Raspberry Pis und ich habe ein paar ESP32. Ich habe bestimmt auch noch deneinen oder anderen ESP62 irgendwo. Einen Arduino habe ich aber nirgendwo. Meinung zu SystemD. Ist es jetzt die nächste Triggerfrage zu sowie als Nachfolger von Meinung zu C++? Ganzehrlich, ich habe nichts gegen System D. Ein paar Dinger finde ich umständlich. Ich binzum Beispiel kein großartiger Fan Unit-Files versus normale Startup-Skripts. Da konnte manimmer noch ein paar ekliche Dinger drin machen, wenn sie mal notwendig waren. Dann hast dunoch nervige Sachen, dass du... Ich hatte letztens ein Problem mit System D. Kann michaber nicht mal richtig dran erinnern, was war denn das? Ich wollte irgendwas neu startenlassen, weil es hängt. Genau, System D kann keine Health-Checks. Das hat mich letztensgenervt. Also du kannst mit System D keine Health-Checks machen, um zu gucken, zum Beispielob ein Service noch richtig läuft und ihn da neu starten lassen. Klar, man könnte jetztsagen, das ist nicht die Aufgabe von System D, aber System D macht so ziemlich alles,was nicht eigentlich die Aufgabe von einem Init-System ist. Warum sollte System D nichteinen Health-Check haben? Du kannst es nur sehr umständlich machen und manche Sachengehen gar nicht. So ein Health-Check wäre tatsächlich ganz praktisch. Wenn du zum BeispielWeb-Anwendungen hast, die ganz gerne mal hängen bleiben und man System D einfach keine Ahnungeinen Curl machen lassen könnte, einmal die Minute und wenn es fehlt schlägt, fünfmalin Folge neu starten. Die Anwendung wäre ganz praktisch. Komplett daran das andere Themahast du eine bessere Ahnung wie Dual-Boot Windows 11, dann funktioniert, wenn ihr einSecure-Boot benutzen musst. Das geht doch bestimmt auszuhebeln, oder? Also manche Distributionen,also ich weiß, dass Ubuntu sich mal, also Canonical hat mal dran gearbeitet, dass sieUbuntu gebootet bekommen mit Secure-Boot. Ich weiß nicht, wie da der aktuelle Standist, Linux Secure-Boot. Also ich denke mal, man bekommt das zum Laufen. Ich denke manbekommt das zum Laufen. Aber wisst ihr, was man machen könnte? Ich bin mal gespannt,ob das funktioniert. Man könnte einfach sagen, scheiß auf den Windows-Bootloader und lässtKrabb Windows starten, falls das funktioniert. Da gibt es, ich wette mit euch Leute, dieseAnkündigung, die es da jetzt gibt, die meisten Sachen werden wahrscheinlich mit ein paarPatches oder Registry-Einträgen wieder zu deaktivieren sein. Gut, Registry im Bootmanagergebe ich zu, war jetzt vielleicht ein dummer Vergleich, aber das wird alles, mal gucken.Ihr wisst doch, wir sind nicht so heiß gegessen, wie es gekocht wird. Oh, da kommen die richtigenPaint-Champ-Sprüche laufen, oder? Vorher hatte schon Amazon heiße Eisen im Feuer, aberich glaube, das wird nicht so wild, wie es jetzt aktuell aussieht. Nice. Also wie gesagt,ich glaube nicht, wir warten, wir müssen es mal abwarten. Das kann durchaus sein, dassdie sagen, ok, jetzt wo Windows 10 nicht mehr supportet, dass die Leute umschwenken müssen,dann forcieren wir irgendwelche Sachen. Ich bin ja der erste, der sagen würde, er verwendetkein Windows mehr, wenn es gehen würde. Wie gesagt, es gibt halt immer noch genug Dinger,da komme ich an Windows nicht vorbei. So, mein Vegas-Stells funktioniert glaube ichunter, da muss ich mal kurz gucken, WineDB, lass mal kurz gucken, ne, wie ist das, ProtonDB,da stehen glaube ich nur Games drin, mal gucken, ob Vegas mittlerweile, wahrscheinlich nicht,ich würde Vegas aber im Leben auch nicht über Wine verwenden, weil es immer mehr Problemegibt. New Vegas, alles gut, Vegas Pro, Vegas Pro 13, zeig mal her. Läuft, Test Results,Installer works good, na super, da bin ich ja beruhigt, dass der Installer funktioniert.Windows does not work, just not run, wunderbar, perfekt. Garbage, latest rating Garbage,ok, schauen wir mal wieder vorbei. Das ist übrigens auch das, was die ganzen Leute vergessen,die hier immer nur die Spiele anführen, es gibt ja noch viele andere Windows Anwendungen,auch bei Spielen ist das Ganze nicht so rosig, wie das immer hingestellt wird. Ich findees immer lustig, dass Linux-Fans dann mit mir als Linux-Fan drüber diskutieren, aberes gibt doch ein paar Sachen, die sind gerade mit solchen Datenbanken relativ offensichtlichzu widerlegen, dass es eben nicht alles rosig ist. So, also da tut sich nichts hier, Gold,Vegas Pro 11 ist Gold, alles andere ist, Version 5, na super, also vergesst. Wie läuft, wieist denn Affinity, warte mal, da muss ich mal kurz gucken, Affinity Designer, wie läuftdas, Affinity Photo, Affinity Designer, Garbage, das funktioniert ja wunderbar, ja, gut, wunderbar,also alle meine, also zwei der Programme, die ich mit am häufigsten verwende, laufen Garbageeinfach mal. Ich sag nicht, dass ich Photoshop brauche, ich bin zu dumm für Photoshop, daseinzige Modell, mit dem ich klar komme, ist Affinity Designer, das ist für so Kacknoobswie mich wunderbar, wenn man ein bisschen YouTube Thumbnails machen will, Affinity Designer,damit komme ich klar, ne, das ist Mist, gerade so was ist in der VM Mist, gehen tut das bestimmt,aber das ist hakeliger, als es sein muss, ich will ja meinen Workflow nicht total zerstören,ne, das hat keinen Sinn, auch Pass Thru ist mehr Pains Champ, als man möchte eigentlich,ne, vergessen, können wir vergessen, nächstes Jahr ist das Jahr des Linux, ich dachte diesesJahr war schon, oder besser gesagt, 2000, war nicht sogar 2010 das Jahr des Linux Desktop's,ich glaube schon, so als Compiz auf, Leute, ich hab früher unter Ubuntu gedacht, Compiz ist derShit, der Linux auf dem Desktop zum Durchbruch verhelfen wird und das war auch mega geil Compiz,die Würfel, Wobbly Windows und alles, leider gibt es das nicht mehr, die versuchen jetzt irgendwie,die ganze Linux Distribution versuchen, Desktop Linux Zeug so nach Mac aussehen zu lassen,die sollen lieber Effekt Overload Compiz-Stalls machen, wie geiler, ja ich weiß, vieles,vieles kannst du zusätzlich noch machen, aber Compiz war das beste, da sind Fenster abgefackeltbeim zumachen und so, nicht beste, Videos nur noch mit FFmpeg bearbeiten, ja FFmpeg kann zwar viel,ich weiß, dass das eine Kappa HD Message ist, aber FFmpeg kann viel, aber du kannst mit FFmpeg haltnicht ernsthaft Videos bearbeiten, nee, nee, achso, ja, es ist immer noch kaputt, ich habimmer noch nicht ausgetauscht oder dran rumgewackelt, weil aktuell ist Sommer und ich brauch das außerdas warme Wasser eh nicht, Moment, das mach ich jetzt nicht auf, wo gibt es die Spezial-Effektenoch, zeig mal her, ja, genau, genau, diese Dinger, Compiz-Stalls, beste, so muss das sein,Wobbly-Windows, wir sehen du kriegst das bestimmt in der VM so ein schlechtes Performance wie dashat, Wobbly-Windows, jawoll, ja Moment, Videos automatisch schneiden ist das eine, aber Videosbearbeiten, ja, also Overlays machen, Subscribed-Messages einfügen, das machst du mit FFmpeg nicht,Überblend-Effekte an der richtigen Stelle und nee, nee, nee, nee, und welche Videos sollendort überhaupt automatisch geschnitten werden, ich glaube KDE hat da teilweise die Sachen vonCompiz übernommen, aber nicht alles, du musst dir mal die KDE, ich hab jetzt nix wo wir dasvergleichen können, aber guck mal in die KDE-Settings rein, dann guck dir mal in altenScreenshots von Ubuntu, von dem alten Compiz-Manager an, wir sehen du konntest hier grade so übertriebenviel Schwachsinn einstellen, das geht in KDE nicht mehr, die haben ein paar Sachen darausgenommen, ja, so aufzeige ich mal ein paar Effekte, genau, Compiz-Stells, auf gehts,da ist der ganze Kram, genau, das kannst du in KDE nicht alles machen, du hattest so vielabgedrehtes Zeug, Wobbly-Windows, der wichtigste Effekt überhaupt natürlich, ja genau das,der Würfel und so, beste, beste, ja, das geht glaube ich mit KDE auch noch mit dem Würfel,CAC 4D, guck, ja so muss das sein, und dann auch random einstellen, dann auch randomeinstellen, dass du das jedes Mal, wenn du das Fenster auf und zu machst, einen anderenrandomized Effekt nimmst, beste, ja so muss das sein, leider gibt es, es gibt einen Compiz-Fork,aber der so wirklich aktiv entwickelt wird der auch nicht, es ist auf jeden Fall dasbeste gewesen, exzellent, dann 24 Monate Alper-Subscription hier, oder bei den, achso, bei den, bei den,bei was bist du in Führung, bei den gegifteten Subs, Massive, jetzt schauen, im Dashboardkönnen wir ein paar Leute übersehen heute, Mario XCB, Dankeschön, für den Sub hab ichnicht gesehen, der Spack-Hack auch am Start, Korni14, auch subscripted, subscripted, alter,subs, das fällt mir neu, irgendjemand hatte mal in einem Vortrag, da musste ich, da mussteich real life, real life kecken, das weiß ich noch, hat in irgendeinem Vortrag, wollteder Subscriber sagen und hat gemerkt, es ist ein deutscher Vortrag und hat dann gesagt,subscribieren, und da hab ich schon so innerlich, wahrscheinlich nicht nur innerlich, aber denhier gemacht, ja, subscribieren, alter, also das ist vielleicht ein gültiges Wort, keineAhnung, aber auf jeden Fall nichts, was man normalerweise verwendet, subscribieren, allesklar, ja, achja, ich wollte mir mit euch das Developer-Surfer mal in Ruhe angucken von,von Jetplains, genau, also was mich überrascht hat, ist folgendes, das hab ich euch, glaubich, das letzte Mal schon kurz gezeigt, ich mach mal kurz den Dark Mode raus, Achtung,Flashbang, bam, mach mal kurz den Dark Mode rein, nee, nee, ich mach den Dark Mode rein,das hältst du nicht aus, aber du erkennst es nicht richtig, egal, was ich euch zeigenwollte, erkennste, was ich sehr spannend fand, hier drinnen ist das hier, Operating System,auf den entwickelt wird, 61% Windows, wundert mich nicht, ich mein, das ist garantiert multiple,also du konntest garantiert mehrere selekten, sonst kommst du ja nicht über 100%, abertrotzdem, man sieht, dass Windows für technische Sachen einfach kacke ist und die 61% die Windowsverwenden, die machen das wahrscheinlich auch zumindest 30% davon, gar nicht freiwillig,sondern weil ihr Chef der Meinung ist, er arbeitet auch mit Windows, das heißt die Programmierersollen gefälligst auch mit Windows arbeiten, kennt ihr so Leute, die sagen also nach demMotto, also, äh, wenn ich das verwende, dann könnt ihr das auch verwenden, ich hatte damitnoch nie Probleme, das ist doch für euch bestimmt und ihr seid ja Techniker, ihr habt damit dochbestimmt noch weniger Probleme, das sind dann die richtig, richtig 3-Hat Aussagen, bei unsist auch lustig, da wollen sie ja auch mittlerweile immer mal wieder, dass wir Windows Notebookskriegen und ich hab das letzte Mal gefragt, ok, könnt ihr mir Rider installieren undes gibt ein offenes Ticket, das ist seit 3 Monaten offen, bei der, wie heißen die beiuns eigentlich, bei denen die Softwareverwaltung machen, ich hab gesagt, ich hab ganz vieleSachen in C-Sharp, ich brauch eine ordentliche Idee, dass ich da weiter dran programmierenkann, ergänzen kann, Bug fixen kann, sonst Neuentwicklung machen kann, installiert mirmal Rider und die kriegen das seit 3 Monaten nicht hin, also, das könnte natürlich auchan unseren Leuten liegen, ja, was hast du für eine Distribution auf deinem Arbeits-PC,ich hab meinen Jaro i3, im Prinzip hab ich auf der Arbeit das hier, was ich hier auchhab, sieht auch genauso aus, hab ich auch mal das ASCII-Quarium auf zur Entspannung,im Prinzip sieht mein Arbeits-Desktop genauso aus wie hier, ich hab die Konfix ja mal nachGitHub gesüngt vor einer Weile, ist nicht top aktuell, aber im Prinzip kommt es nochhin, was unter anderem steht, ich glaub, das ist nicht aufgeschlüsselt, naja, das sindda wahrscheinlich so Sachen wie Solaris oder sowas, oder, tja, BSD vielleicht, vielleichthat irgendjemand einen BSD, auf dem er entwickelt, warst du nicht Wishlist Studio Code Fan, doch,aber man macht nicht alles in Wishlist Studio Code, es gibt Sachen, die sind in anderenSachen besser aufgehoben, du möchtest zum Beispiel kein Java, Kotlin, C-Sharp odersonst was in Wishlist Studio Code programmieren, auch Go ist nicht so schön, wenn man, obei,Go, doch, Go ist okay, das stimmt, die haben nämlich den eigentlichen Bug gefixt, denich mal vor jahrelang hatte, dass wenn man nämlich Interop mit C macht, dass dann, alsowenn du oben diese C-Go Definition reinschreibst, dann ist nach ein paar Minuten das WishlistStudio Go Plugin abgekackt und hat die Auto-Completion immer funktioniert, ich glaub,das haben sie gefixt, ja, also C-Sharp in Wishlist Studio Code ist nicht schön, esist brauchbar, weil Microsoft halt ihr Standard-Toolzeug da mitbringt, aber es ist nicht, macht nichtviel Spaß, hey, was hältst du vom Framework Laptop, ich weiß nicht, was der FrameworkLaptop ist, ja, aber das finde ich interessant, ich vermute mal, dass das hier BSD ist undklar, man kann, man kann verschiedene Betriebssysteme auswählen, frame.work, was hat denn die Domainwohl gekostet, Framework Laptop ist now shipping, okay, dünner, leichtes Notebook, was istmit was Bestand haben soll, aha, okay, was macht das jetzt aus, Framework Laptop 99 Dollarund das ist vom Preis her absolut in Ordnung, wenn da was Gescheites drin ist, sieht auswie ein Notebook, oben ist eine Kamera oder so und komische Knappen, ah, das ist einer,wo man selbst dran rumbasteln kann, warum genau sollte ich am Notebook selbst rumbasteln,ist das für den Fall der Fehler, dass er kaputt geht und ich ihn reparieren muss oderwas ist der Hintergedanke davon, also was ist der, warum sollte ich mir den kaufen, LinuxSupport, okay, naja, gut, das gibt es ja bei vielen, indirekt, weil halt die Hardware,die drin ist, unterstützt wird, ich finde es viel interessanter, was der Typ geradeHackerman macht, das muss ich mir angucken, ich brauche das Bilding groß, Leute, ImageNewtap, was ist das, Struct, ist das C, sieht man in Clue, ja, das ist C, oder es ist C++,was ja nach C aussieht, ah ne, guck mal da, C tatsächlich, C und nicht C++, das findeich nicht schlecht, da kannst du dir dann auch überlegen, was du da genau reinmachst,ja von der Idee her sicherlich nicht verkehrt, also die Preisfrage ist natürlich, wie schlägtsich das preisleistungstechnisch gegen einen normalen Laptop so in der ähnlichen Liga,klar, es wird wahrscheinlich ein bisschen teurer sein, aber ist die Frage, wie vielteurer, also ich denke mal die meisten Leute sind bereit vielleicht ein Drittel mehr zubezahlen, aber dann ist aber auch die Schmerzgrenze erreicht, ok, wo kann man preordern, also willich nicht ordnen, ich will mal einen zusammenklicken und gucken, was es kostet, ah hier, achso,es gibt die Möglichkeit, dass man ihn fertig geliefert bekommt oder die Einzelteile, ok,sagen wir mal fertig geliefert, wird nicht nach EU geschippt, das macht nichts, ich willnur sehen, was es kostet, Koggers, ey das sieht ein bisschen aus, muss man ihn lassen,sieht ein bisschen aus wie im Apple Store, es ist auch basic, BAM, E7, E6, wer kommtalso 8G Leute, also ich meine damit nicht den Nachfolger von 5G, sondern 8GB, also 8GBist ja outdated, und 256G kommst du ja hinten und vorne nicht hin, aber noch fetter, jawoll,kann man gar nicht, kann man gar nicht selecten, achso, aber ok, Linux Support ist tatsächlichein Vorteil, obwohl es jetzt hier der Vorteil gegenüber, sagen wir, ich gehe in den OnlineShop und order mir das Teil, das habe ich nicht so genau verstanden, es ist einfacherzu reparieren auf jeden Fall, ja aber, du kannst bis zu 6 SSDs nachrüsten, alter, okgehen wir mal zu, hallo, do it yourself Edition, ich glaube, ich habe die Website kaputt gemacht,ja, guck mal, das ist eine Single Page Application, die den Zurückknopf im Browser nicht richtighandelt, direkt geprickt, also was kann man hier auswählen, ok, CPU, das reicht mir ehrlichgesagt, der kleine, 46G, BAM, also, oh, da haben wir irgendwas, WiFi, non pro, pro, ichweiß nicht, was der Unterschied ist, bring your own, wie das geht nicht, doch man, dasist noch beschäftigt, das ist jetzt so schnell, bring your own, storage, ne, ne, ne, ne, ne,Terabyte reicht, aber Terabyte sollte schon sein, ich finde das eigentlich, das, dasmacht, was soll das sagen, ah, das ist Kaution, ne, nicht Kaution, wie nennt man das so, sodassnicht die Leute sinnlos vorbestellen, die gar nicht wollen, der Chat ist vor dem Preis,also, hier Chat, so Anzahlung, ja, scheint mir ganz in Ordnung zu sein, man muss eshalt selbst zusammenbauen, ne, ich bin mal gespannt, was da rauskommt, es gab ja schonein paar Versuche, so modulare Smartphones und sonst was zu machen, hat alles nicht sogut funktioniert, mal gucken, ob es damit was wird, genau, Anzahlung meine ich, ja,nicht Kaution, Kaution ist das, wenn man Monkathos war und in Knast muss und dann temporär wiederraus darf, jetzt, jetzt, zeig mir Twitch den Fallout Channel, ja, was soll ich sagen,ich bin auch dafür, dass Twitch den Channel mir empfiehlt, ihr sollt mal Twitch anschreibenund sagen, jetzt hört mal auf, irgendwie Indie Fox und, wobei, ne, sorry, Indie Foxist ja gebannt, ihr sollt lieber anstatt Poolgrills meinen Stream empfehlen, bin ichauch dafür, können wir machen, ja, finde ich nicht schlecht, macht eigentlich, machteigentlich ganz guten Eindruck, das Teil, Max, Max im HotTube, ja, irgendwann vielleicht,irgendwann HotTube Stream, nach Face Reveal und ihr wisst ja, Face Reveal gibt es baldbei einer Million Abos, auf YouTube, oder auf Twitch ist mir eigentlich egal, eine MillionAbos, wird es eh nicht geben, insofern, easy, Face Reveal war doch schon, noch nie, nochnie, wo ich gesagt hab, Face Reveal, ich wurde schon zufällig ab und zu mal Revealed, ja,aber noch nie, wo ich gesagt hab, Face Reveal, ist der, ist der on, ist der on, nein, istnicht on, eines der alten Unbox, da auch, da auch, jetzt gibt es so viele Sachen, woich schon mal Revealed wurde, auf irgendwelche Events, wo ich mal durchs Bild gelaufen bin,wo es keiner gecheckt hat, dann Unboxing Videos, alles mögliche, so, also genau, das wollteich mir jetzt ja mal mit euch angucken, also JetBrains hat eine Umfrage gemacht, äh, unter31.743 Developers, Developers, Developers, welcher Streamer seht ihr ähnlich, da gibtes eine ganz klare Antwort, wenn ich das Emote finde, Dance Gaming, also ich muss sagen,also wenn ich mir Dance Gaming so angucke und mich so angucke, da ist, das sieht sichdoch schon ziemlich ähnlich, ja, ich, er hat in letzter Zeit ja auch deutlich wenigerHaare bekommen, also ich würde sagen, ich hab sogar noch ein bisschen mehr Haare alsDance Gaming, aber ansonsten finde ich, äh, und vom Bart her muss ich sagen, sieht auchdieses Total Biscuit Bild mir relativ ähnlich, das könnte, also, wenn ich nicht wüsste,dass es Total Biscuit ist, könnte, könnte das auch, könnte ich das auch, wenn die Auflösungschlechter wäre, könnte ich das auch sein. So, also, was wollte ich jetzt sagen, genau,sie haben eine Umfrage gemacht unter ungefähr 32.000 Developer, äh, gut, Countries ist jetzt,ist jetzt wurscht, sind ein paar Sachen drin, die ich echt ganz interessant fahre, das wundertuns glaube ich alle nicht, dass JavaScript die beliebteste Sprache ist, oder wundertuns irgendjemand, sagt irgendjemand, ah, ich hätte eher Cobol erwartet anstatt JavaScript,ich glaube sagt keiner, also ja, das war, es war klar, äh, JavaScript ist die beliebtesteSprache gefolgt, vermute ich mal von Python, weil das ist auch beides saubermäßig beliebt.Das stimmt, ja, die meist, die meist benutzte. Achso, die meisten Leute gezwungen sind.So, äh, Python ist more popular als, als Java, oder Java, wir müssen das ja mal Jira, Java,muss das ja cool aussprechen, ich hab vorhin auch wieder John Ubuntu nicht richtig ausgesprochen,ich meine natürlich Jubantu, so, ähm, okay, Top 5 Languages sind, ah ne, die 5 Top Sprachen,wo Leute gerne ihre Software hin, äh, umprogrammieren würden, also Sprache, wenn sie Sprache wechselnwürden, das ist Go, Kotlin, TypeScript, Python und Rust, gut, Kotlin kann ich verstehen,man macht freiwillig schon was in Java, Java ist halt einfach Paints Champ, wenn ich irgendwasin, auf JVM Basis machen müsste, würde ich das auch auf jeden Fall in Kotlin machen,das einzige, was ich bisher jemals auf JVM gemacht hab, ist, äh, Groovy, aber auch nichtviel, TypeScript kann ich auch verstehen, Python kann ich auch verstehen, Rust ist netypische Sprache, wo jeder sagt, er würde gerne auf Rust umziehen und wenn er dann anfängtauf Rust umzuziehen, äh, umzuziehen, dann denkt er sich dann, ich bin zu dumm für Rustund bleib bei der anderen Sprache, macht keiner, genau, das ist so, Wunsch zur Realität istRust und Go hat auch so seine Dinger, wo viele glaub ich, weiß nicht, äh, zu blauigischrangehen, also Go hat auch Eigenheiten, die, mal gucken wir mal, ob es Generics in Go gibt,dann wird einiges besser, hoffe ich mal, ja, es sind einige Sachen merkwürdig in Go, alsowie gesagt, der fehlende Generic Support ist doof, äh, dann diese, diese, wie soll ichdas beschreiben, so diese Sache mit Error Handling, dass du es eigentlich mit ReturnCode machst, aber dann doch sowas wie Try Catch mit Panic hast, ähm, dass es ganz furchtbareklig ist zu checken, also syntaktisch eklig, ob ein Key in einem Dictionary drin ist inGo, oder ich, vielleicht finde ich ihn auch nur ich hässlich, und eine persönliche Sache,die ich nicht mag an Go, ist, dass Go der Meinung ist, dass Go der Meinung ist, sowasmachen zu müssen, wer hat sich das ausgedacht, das ist nicht Phifat, das ist einfach nurWoodface, ich weiß viele mögen das, viele mögen das, ich mag das nicht, für mich,also das könnte ich mir noch gefallen lassen, das, das, das meinetwegen, meinetwegen so,aber ich persönlich bevorzuge ja den hier, aber ich bin auch jemand, der mag 2 Spacesals Einrückung anstatt 4, Leute was sagt ihr, 4 Spaces oder 2 Spaces? Keine Spaces,äh, also das heißt ihr macht quasi rechtseitige, rechtsbündige Einrückung oder? Ja ob Tapoder Spaces, Tap werte ich mal als 4 Spaces, vom Abstand ungefähr, mir geht es nur umdie Anzeige, also mir ist egal, ob es 2 Spaces oder 4 Spaces sind bei Tap, also Tap würdeich jetzt sagen zählt als 4 Spaces, also mir ist egal ob Spaces oder Tap, mir geht esum den Abstand, ich mag den Abstand von 2 Spaces, genau das ist bei mir auch die Sache,ich mag 2 Spaces, weil wenn du sowas wie C Sharp programmierst, da hattest du langeZeit halt so Sachen wie Namespaces Einrückung, Klasseneinrückung, das ist jetzt alles einbisschen besser geworden in den letzten Sprachen, aber halt noch nicht richtig nice und da kannstdu einfach Einrückung sparen, ja, also ich mag 2 Spaces, so, also das fand ich dannhier eigentlich ganz spannend, sowas sind einfach stehen geblieben, also wie gesagtzu Rust werden sie nie mehr kreieren, haben sie das immer noch vor, ok 3 Spaces ist natürlichdann, warum nicht einfach 1,5 Spaces, wie wäre es eigentlich damit, warum haben wireigentlich schon nicht halbe Einrückung erfunden, ich glaube ich sollte mal den eigenen Editorprogrammieren, ne, ne, Leute wir programmieren einen Wishful Studio Code Addon, keine Ahnungob man das mit dem Addon machen kann, der 1,5 Spaces Einrückung machen kann, es gibt jasogar halbe Leerzeichen, stimmt, es gibt ja Unicode mäßig alles mögliche, so alsoTop Languages, die Entwickler 2021 gelernt haben, JavaScript, Python, TypeScript, JavaGo, ja das wundert mich auch nicht, JavaScript klar, Python auch immer weiter am Aufsteigengerade an der Uni oder eben was Machine Learning angeht, TypeScript auch mit JavaScript, vielefangen ja mit JavaScript an und sagen dann irgendwann, hey ich probiere mal TypeScriptund steige da nie wieder zurück um auf JavaScript, weil im Prinzip ist ja TypeScript, JavaScriptbloß mit mehr, also JavaScript ist gültiges TypeScript, aber TypeScript ist nicht gültigesJavaScript, ja und Go, gut, Go kann ich verstehen, Go hat einfach so unglaublich viele Tutorialsund Sachen, man kommt gut rein, Ruby, Ruby Objective C und Scala, oh, innerhalb der letzten5 Jahre sind die viel unbeliebter geworden, tja, gut Scala kann ich verstehen, Scala,achso, jetzt hat jemand vorhin gefragt, ob sich es lohnt, das englische Tastaturlayoutzu lernen, ja wenn du Scala programmierst, dann lohnt sich das, also Scala besteht jaim Prinzip nur aus Klammern, nicht dass ich das jetzt verwechsel mit Erlang oder so, wartemal, Code Examples, ja doch, es besteht aus ziemlich vielen Klammern, aber wobei gehtda eigentlich, irgendwie hatte ich im Hinterkopf, dass Scala total viele Klammern hat, Lisp,ja Lisp ist ja noch das Allerschlimmste, wisst ihr was das Schlimmste ist an Klammern, Emacsund Lisp, Example, guckt euch das mal an, also wer sich den Shit antut, weiß ich auchnicht, guckt euch das mal an, das meinen die ernst, ja, guckt euch das an, guckt, ja,und das lustige ist, wisst ihr warum die Lisp damals in Emacs eingebaut haben, weildie gesagt haben, ach nee, C verstehen die normalen User ja nicht, die sollen das gefälligstin Lisp programmieren, als wäre der Shit einfacher zu verstehen als C Funktion, unverstissbar,also gut, gut Emacs ist ja eh fast schon in der Bedeutungslosigkeit verschwunden 2021,gibt es noch jemand bei euch, der Emacs verwendet, nee, ok aber das verstehe ich, Ruby ist halttotal aus der Mode gekommen, Ruby ist wie gesagt, ne was sie schafft, meine Lieblingsprogrammiersprache,aber Ruby hat einen riesen Aufstieg gehabt mit Rails und das ist ja die letzten Jahreüber Steinberg abgegangen und Ruby hat es nicht geschafft so wirklich ne eigene, soein herausstechendes Merkmal zu haben, dass die Leute gesagt haben, hey wir verwendenjetzt Ruby anstatt keine Ahnung, Java Skript oder Paaßen, also ich kann es nachvollziehen,wenn Ruby ne super Sprache ist, Ruby 3 kam raus, hat angeblich vieles verbessert, ichhab es bis heute nicht ausprobiert, weil Ruby mittlerweile so unbedeutend ist, ich magzwar Ruby, aber man kann es vergessen mittlerweile, Objective C wundert mich nicht, das war jain der heutigen Zeit, also das war ja in den letzten paar Jahren bis jetzt in die heutigeZeit eigentlich nur auf Apple irgendwie relevant und die haben jetzt, na wie heißt es, Swiftam Start, ich weiß gar nicht wie das ist, ob es immer noch Sachen gibt, die man nichtmit Swift machen kann, wo man Objective C für braucht, aber es ist verschwindend geringauf jeden Fall, gut Skala, ja gut, wer sich das mal gegeben hat weiß ich eh nicht, okfaster scrolling languages ist Paaßen, TypeScript, Kotlin, SQL und Go, Paaßen und TypeScriptwundert mich nicht, Kotlin wundert mich auch nicht, ich würde auf jeden Fall das immervorziehen als Java zu machen, ja ich, zwei Monate Subscription, Dankeschön für denSub, exquisite, Sub, SQL braucht man immer, ja und Go ist halt beliebt, weil Go viele Tutorialshat und viele Leute mit Go halt auch anfangen, das wundert mich auch nicht, dass das drinist, viele Cloud Sachen sind ja auch in Go programmiert, ok, ein Großteil der Leute,die bei einer Umfrage teilgenommen haben, entwickeln Web Anwendung, das Backend fürWeb Anwendung, das finde ich interessant, hätte eigentlich gedacht die meisten Leutesind irgendwie, gut wir sind ja nicht auf Stack Overflow, auf Stack Overflow sind die meistenwahrscheinlich Frontend Java Script Stells, Gkanalshu, Stufe 1, huge Username, oh derHype Train nähert sich Leute, ich sehe es schon, wir werden gleich wieder gescampt vonTwitch, gebated, Scam Train ist unterwegs, Crystal kenne ich, Crystal hat das Problemdas es nicht unter Windows läuft, auch sonst ziemlich in Nischensprache ist, wenn das dasletzte Mal lief das nicht unter Windows, also Programming Languages, was ist besonders beliebt,Java Script wissen wir, HTML, CSS, logisch, jetzt kommen natürlich die ersten wiederSachen, null, warum ist HTML in der Umfrage, aber ich kann es verstehen, das ist halt was,was viele Leute den Tag über machen und scheiß drauf, ob es eine Programmiersprache ist odernicht, wir schreiben es ja sogar selbst, es geht einfach darum, was viele Leute in ihrerIDE so den ganzen Tag machen und da ist HTML, CSS wahrscheinlich vorne dabei, SQL, logisch,wobei ich es immer noch erstaunlich finde, dass so viele Leute SQL von Hand schreiben,wenn man nicht totalen Mist macht mit seinem DB, Mapper, Framework, wie auch immer manes jetzt nennen mag, dann geht es doch eigentlich mittlerweile, ich meine du kannst natürlichauch sagen, wenn du jetzt verwendest EF Core oder sowas, weil wir jetzt gerade bei C Sharpsind, du kannst ja auch dumme Sachen machen, wie erst irgendwie die alle ID's rausholen,dann eine Schleife und dann damit andere Sachen abfragen, anstatt einen Joint zu machen,du kannst Mist bauen, aber ich frage mich woran das liegt, dass so viele Leute nochSQL von Hand programmieren.Was total viele Stellenanzeigen suchen nach Entwickler, HTML, CSS, ja Frontend Sachensind beliebt, aber ich würde halt sagen zukunftsfähig, ich meine klar, du wirst in Zukunft auchWebentwickler brauchen, aber Webentwickler hat so von allen, ist meine Einschätzungnach ja, so die geringsten Geldaussichten, also da gibt es einfach so viele und ich habedie dumme Vermutung, aber das kann sich auch als komplett falsch rausstellen, dass übermittlere Zukunft Webentwickler weniger werden, die man braucht.Ey mal gucken, mal gucken, ich mache eigentlich mittlerweile ganz gerne eben bei ein bisschenJavascript Zeug.So also Java ist das nächste gute Business-Stell, Shellscripting Languages wundert mich jetztauch nicht, vieles ist halt einfach mal schnell in einem Shellscript zusammen gewurstet undum verschiedene Sachen miteinander zu verbinden ist ein Shellscript super, irgendwelche automatischenTeststarten oder irgendwelche Init-Sachen in einem Repo, dass du sagen kannst, hey duhast da einen Checkout-Script oder du hast irgendwie einen Skript, was dir was aufsitzt,das verstehe ich, das ist damit einfach easy gemacht, ein paar Zeilen Shellscript ist meistensfür kleine Sachen einfacher als da jetzt irgendwie Big-Brain-Python-Zeug zu bastelnoder sowas, ist GitLab CE auch Shellscripting, ich vermute mal, dass du da Shellscript ausführenkannst, ansonsten muss ich dir ehrlich sagen, ich habe GitLab CE nie wirklich großartigverwendet, keine Ahnung, Script versus Makefile, ne das kommt drauf an, was man machen will,Makefile finde ich halt schwarze Magie, denn Shellscript hat den Vorteil, dass wenn maneine ordentliche Sprache verwendet, also wir reden jetzt nicht von C++, sondern irgendeineordentliche Sprache, wo du einen ordentlichen Package-Manager dabei hast, wo du ordentlicheFehlermeldungen bekommst und ordentliche Tools dabei hast und ordentliche Configs hast,dann kannst du halt den Shellscript in ein Repo legen, sagen wir für irgendwie Test-Deploymentoder sowas, dann führst du das aus, dann baut er dir das Programm zusammen und schiebtdas per SSH irgendwo hin und startet dann den Service neu, das sind 5 Zeilen Shellscript,das ist easy, kann jeder machen, brauchst dann bloß dein SSH Key an der richtigen Stelle,für sowas ist halt ein Shellscript einfach praktisch, da muss man es nicht übertreiben,klar kann man jetzt wieder sagen, ja wie sieht es aus, eh, continuous delivery, Pipeline,sonst was, wenn ich einfach nur mal was schnell ausprobieren will, manchmal ist ein Shellscript,also die oldschool Variante mit einem Shellscript auf irgendeinen Test-Server was zu kopieren,den Service neu zu starten und dann mal im Browser zu refreshen, die einfache Varianteals da jetzt irgendwelche komischen Big Brain Deployment Pipelines aufzusetzen.C++ ist eine ordentliche Sprache, das habe ich nicht gesagt, ich habe gesagt C++ istkeine ordentliche Sprache, ich habe gesagt eine ordentliche Sprache also nicht C++, C++hat ja nichts, was eine ordentliche Sprache ausmacht, doch das ist eine super Fehlermeldung,das ist die allerbeste, genauso C++ Fehlermeldung finde ich gut, ja, da weißt du Bescheid, aberich will jetzt nicht von C++ anfangen, weil wenn ich von C++ anfange, dann wisst ihrLeute, dann hören wir so schnell nicht mehr auf über C++ zu flamen, C++ in der Schule,ja mein Beileid.Ein schönes Beispiel, komm wo wir jetzt dabei sind, schönes Beispiel, wo ich immer drüberkecken muss ist das hier, ich habe es hier gerade gefunden deswegen, schönes Beispielwo ich immer drüber kecken muss ist folgendes, was tut es, was macht es?Ich weiß mittlerweile geht es einfacher, aber auch erst seit C++ 20 glaube ich, es kompiliert,das funktioniert, das funktioniert wirklich, ihr müsst es nicht wissen was das macht,das ist bescheuert einfach nur so Dinge, also gucken wir mal weiter, es ist obvious, jatotal klar was das macht, das ist genauso obvious was das macht, wie das letzte ffmpegKommando was wir hier haben, ja, also das finde ich auch total obvious, ffprobv error selectstream v0 count packets show entries stream nb read packets of csv gleich p gleich 0 unddann das gif, das finde ich auch total offensichtlich, dass das Kommando so sein muss, also wie könnteman jetzt auch denken, dass das Kommando irgendwie anders aussehen muss, voll obvious halt, wenndu deine eigene Programmiersprache releasen würdest, wie würdest du sie nennen, cute chat,keck++ würde ich es auf gar keinen Fall nennen, ich würde es cute chat, oder, oder, ich würdedarauf setzen, dass die ganzen weebs die Programmiersprache lernen und berühmt machen, ich würde sieirgendwie nennen, meweep, me-spam-mod-bucker-if-ban, cute++, keine Ahnung, ich würde mir wirklichnicht irgendwas big-brainiges ausdenken, keine Ahnung, mir fällt gerade nichts gescheitesein, hentai-sharp, oh das ist eine gute Idee, dann hast du auf jeden Fall schon mal die Benutzergruppegesichert, ja, ayayascript, das finde ich auch nicht schlecht, ok, also, ok, ok, alsoals Shellscripting so leuchtet mir voll und ganz ein, dass das noch beliebt ist, das ganzegefolgt von php, wenn man das da wieder cool aussprechen will, wo lang, da würde ichmir irgendwas überlegen, aber zum Glück muss ich keine Programmiersprache entwickeln,denn meine Programmiersprache hätte garantiert Memory Leaks und ich hoffe nicht, dass irgendwannman da mit einem Auto steuern will oder sowas, dann ist vorbei, so, was haben wir da sonstnoch, gut, php verstehe ich auch, php leuchtet ein, php ist halt immer noch webseitentechnischangesagt und auch wenn viele jetzt sagen, max jetzt übertreibt man nicht, ich muss sagen,das was ich in letzter Zeit, ich habe in letzter Zeit nichts mit php gemacht, aber das letztemal, die letzten paar Sachen, die ich so gesehen habe, auch mal in ein paar Konferenztalksund so von php, mit den passenden Frameworks, ist gar nicht so schlecht, ist echt in Ordnung,aber relax days, komme ich jetzt bei Rick Astley raus, Moment, die sieht aus, als machtdie gleich Yogaübung oder sowas hier vor der Cam, mit dem unbequemen Stuhl, ok, dasist PainsChamp, also schauen wir mal was PainsChamp ist, deine Aufgaben sind, meinst du das Videoist PainsChamp oder die Stellenanzeige ist PainsChamp, Neuentwicklung von Backend Applikationmit PHP Storm, ok, sie verwenden schon mal eine gescheite IDE, da bin ich ja schon malin Ordnung, Analyse der Anforderungen im Fachbereich sowie Anpassung, ok, Arbeiten mit einer MicroserviceArchitektur und sichern, ok, stetiger Austausch mit Frontend Team zur Gewähr, ok, ein bisschenmehr zu dem was man eigentlich macht, wäre vielleicht nicht verkehrt, das Video ist Cringe,ok, gucken wir uns gleich an, damit überzeugst du uns, Fachinformatik, Analyse Entwickler,Bachelor Informat, blablabla, Fortgeschrittene PHP Kenntnisse, Bündnisse, Dockers, Sage,ee, Team Foundation, wer verwendet denn das noch, MonkaS, Team Foundation, Continuous Delivery,Jira, Confluence, MySQL, Symfony, Doctrine, braucht man nicht, ihr wisst, auch guter PHPCode dokumentiert sich selbst, Engagement, Leistungsbereitschaft im Team, die Seite istin Ordnung, ok, das Video ist Cringe, also, Ups, ist es Chebathe, ist es Chebathe, ahne, das ist nicht Chebathe, ich hab gedacht, das ist Chebathe, ich hab gedacht, die wolleneinen verarschen, fast, ok, die sind mir schon mal sympathisch, man darf mit kurzer Hoseam Rechner setzen, Team Zelda, oh Gott, Moment, ich muss mal die Musik kurz ausmachen, äh,da sind wir stehen geblieben, ja, alter, die Musik, das übertreibt es mal nicht, oh,hier ist es kahn Huang, ich meine das ist esJa, es ist super mit den Kollegen im Team, das macht wirklich Spaß.Und auch generell finde ich es schön, dass hier einfach so viel Vertrauen in mich gesetzt wurde,weil ich habe ja als Student hier angefangen, habe meine Abschlussarbeit hier geschrieben,direkt eine Rolle als Teamleiter bekommen. Das war für mich natürlich eine mega Ehre unddas macht einfach Spaß dann. Wahrscheinlich wollte das keiner machen sonst.Generell passiert ja auch gerade die Umstellung auf GitLab im Hintergrund,dass da alles über Docker-Qt da läuft und im Kubernetes und schnicki schnacki.Ich finde das Video nicht schlecht. Also die macht den Eindruck, als weiß sie wovon sie redet undsie labert nicht im Kreis rum. Sobald das dann zeitlich mal passt, ist Relax Day dann auch einfachsehr offen, da diese bessere Lösung umzusetzen und das macht einfach Spaß dann. Da würde ichmich ohne Scheiß nach dem Video, würde ich mir tatsächlich überlegen mich dazu bewerben. Alsomache ich nicht, aber wenn ich jetzt suchen würde, ich fand das wirklich nicht verkehrt.Die labert nicht so sinnlos im Kreis rum. Ich finde es viel cringier, wenn du Leute irgendwoda sitzen hast so nach dem Motto, ich arbeite bei der ABC GmbH und ich bin dann direkt nach meinemStudio hingekommen und ich war so überrascht, was das für ein toller innovativer und modernerArbeitgeber ist. Ich könnte mir keinen schöneren Arbeitsplatz vorstellen bei der ABC GmbH. JederTag ist eine neue Herausforderung. Mein Team ist das Beste. Aber das ist doch vollkommen okaygewesen. Das ist doch nice. Ja also da kann ich mich nichtbestellen. Übrigens, hier hatte ich. Okay es. Mir hatte mir hat es hier vorher wieder. Oh dasdas das sieht das sieht cringeig aus. Allein schon vom Thumbnail her. Also da bin ich mirjetzt nicht so sicher. Zeig mal her. Sagen wir haben die alle irgendwie die gleiche Musik drin.Und warum stehen ihre Azubis random auf dem Parkplatz. Nee machen sie gar nicht. Hi ichbin der Luca. Ich bin 21 Jahre alt und ich absolviere meine Ausbildung bei derGRIESAWA Logistics Group in Bad Zecking als Fachinformatiker für System Integration.Es kam gerade ein Ticket rein. Oh jetzt jetzt Jyra Ticket Leute hier. Es kam gerade ein Ticketrein. Ich bin kurz unten im Serverraum. Okay meistens werden Anfragen von Mitarbeitern inunserem zentralen Ticketsystem verarbeitet. Noch der gute alte Turnschuh Admin. So mag ich das.Von den Mitarbeitern der IT Abteilung verarbeitet. Es besteht aber auch noch die Möglichkeit Anfragenüber Telefon zu stellen. Das heißt man ruft einfach eine zentrale Nummer an und dort. Undda hat jeder Bock drauf Telefonsupport zu machen. Ich werde mit euch. Dann jemandmitte wegen dem Problem melden und mit Leuten kommunizieren. Das ist ja das schlimmste.Top Sound. Okay ich schau mir das mal an. Oh nein Drucker fixen. Hört mal auf.Den muss doch was besseres eingefallen sein um ihreFachinformatiker Ausbildung zu bewerben als Drucker fixen.Und warum hängt da überhaupt so treu Schnee beim Drucker. Mit Kabelmanagement habe ich keineProbleme. Ihr hättet das früher bei uns im Rechenzentrum sehen müssen. Das war auch so.Ja dementsprechend haben wir doch aus Versehen schon mal Wackelkontakte ausgelöst an Servern.Weil egal andere Geschichte vielleicht nicht ganz so schlimm. Aber es war bei uns halt voll.Bei uns hattest du quasi eine komplette Wand. Nur Kabel. Aber warum. Warum steht das nebendem Drucker. Warum ist das nicht mal. Zumindest. Zumindest. Ich glaube da ist sogar Klaas. Daist Klaas davor. Aber ja okay ist egal. Besonders wichtig in der Logistik. Jo was war jetzt mit demDrucker. Grießhaber sind auch die Scanner. Die Scanner spielen eine zentrale Rolle. Weilder Grießhaber Logistik Group. Weil diese Scanner. Scanner. Im ganzen Lager in Gebrauch sind. Heißtdie IT ist doch immer direkt der erste Ansprechpartner wenn mit den Scannern ein Fehlerpassiert. Oder wenn es Probleme gibt allgemein beim Scannen. Oder wenn. Machen viele so. Ichhabe das noch nie gesehen. Drucker im Serverraum. Mit dem Netzwerk. Was ich an meinem Berufsalltagschätze. Ist das mein. Ist das. Ich habe erst gedacht das ist. Ein Mainframe. Aber. Ist esanscheinend nicht. Was ist es denn. Das ist Dell oder. Ist EMC Dell. Ist es ein Storage. Ist es ein Dell Storage. Warte mal. Lass mich mal grad gucken. EMC. Dell EMC VNX Series. Ja das ist der. Das wussteich doch dass mir das bekannt vorkommt. Arbeit sehr abwechslungsreich gestaltet ist. Sowashaben wir auch. Nicht das Ding aber von EMC. Und die IT nicht komplett voneinander getrenntist. Oh jawoll. Die gute alte Konsole. So muss das. So muss das. So mag ich das. Wiezwei Zahnräder ineinander arbeiten und voneinander abhängig sind. Welche Zahnräder arbeitenineinander. Sehr abwechslungsreich gestaltet ist. Und dass die Logistik und die IT nichtkomplett voneinander getrennt ist. Sondern dass beide quasi wie zwei Zahnräder ineinanderarbeiten und voneinander abhängig sind. Damit sie gut funktionieren. Ich frage mal bei meinemKollegen Simon nach. Wie es ihm im Serverraum ergeht. Pass auf Leute. Huge Acting Skillsbestimmt jetzt. Hi. Ja hi Simon. Bist du schon weiter gekommen. Ich frage mich obdie das Video freiwillig gemacht haben. Oder ob man gesagt hat ihr macht jetzt gefälligdas Video. Serverraum. Ja klappt wieder. Der Drucker war noch im falschen V-Lan drin.Oh. Ohne Scheiß auch wenn ich jetzt ein bisschen gemeckert habe. Also vom Inhalt her ist dasgar nicht schlecht. Ich mein jemand der sich für die Ausbildung interessiert wird daswahrscheinlich soll ich viel sagen. Aber das sind genau die Probleme wo ich mir vorstellenkönnte die da tagtäglich auftreten. Warum auch immer der Drucker im falschen V-Landrin ist. Ich mein warum ist er auf einmal heute in einem anderen V-Lan als gestern.Aber gut ich mein das sind Probleme die drehten auf. Und warum druckte er nur schwarz weißwenn er im falschen V-Lan ist. Hi ich bin der Simon 19 Jahre alt und im zweiten Lehrjahrals Fachinformatiker bei Grieshaber. Ich habe damals hier mein Praktikum gemacht und habedanach dann direkt die Ausbildung hier angefangen. Was ich sehr gut finde bei Grieshaber istdass auf die Azubis geachtet wird unter anderem durch der Onboarding Day und durch viele AzubisEvents. Ok das wäre für mich schon mal der Cringe schlechthin wenn ich den OnboardingDay machen muss. Guckt euch das mal an irgendwelche komischen Waldausflüge. Ach du Kajun pleaselass die Leute doch einfach ihre Arbeit machen. Ach du. Also das nicht dass ich was gegendie Schaukel hätte aber ich behaupte mal die Schaukel hätte was gegen mich. Wer weißda mache ich den noch in komischen in komischen Dinger kaputt. In der IT haben wir ein sehrjunges Team und ein sehr familiäres Team. Bei ihm ist das kein Problem. Was mir sehrgefällt an der Spedition ist der Kontakt zu den Kunden und Mitarbeitern. Und durch ebendie Logistik und die Speditionsbranche haben wir oft auf Englisch oder Französisch zutun auch durch die verschiedenen Standorte in den unterschiedlichen Ländern was dasganze einfach noch ein bisschen ausmacht und was dadurch dann eben auch nicht so eintönigwird. Ich glaube es ist gar nicht schlecht das war am Anfang ein bisschen unglücklichdas Video aber ich glaube es kann man durchaus machen. Was auch ein Grund war wieso ich michfür den Beruf entschieden habe weil ohne IT einfach heutzutage gar nichts mehr geht.Das ist ja auch so. Wer mischt diese Videos immer ab? Haben sie Recht? Erstmal Drohnenrundflugin Bad Säckingen. Was? Ich glaube wenn man einmal angefangen hat diese Videos zu guckendann kriegt man immer so Zeug empfohlen. Das hört ja gar nicht mehr auf. Guckt euch malan. YouTube ist jetzt der Meinung ich möchte Feasy Videos empfohlen bekommen hier. Dersieht wenigstens aus wie ich mir so ein Feasy vorstelle. Zudem hätte ich gleich Vertrauenim Support. Da wisst ihr halt Ahnung. So wen haben wir denn sonst noch hier? Nix mehr.Was ist das Azubi? Azubi Fakten. WMX oder BMW? Mal gucken. Mal gucken ob es BMW schafftgescheites Video zu machen. Das Intro ist schon. Das ist so Influencer Style. Das ist so InfluencerStyle. Hallo? Das ist ein Feasy Video. Als nächstes würde ich erwarten da sagt ichbin euch so dankbar für die Abonnenten. Schön dass ihr wieder eingeschaltet habt. Ohne euchwäre ich nichts. Hätte ich jetzt noch drauf gewartet. Also auf gehts. Ach du Kacke. AchMoment. Der ist gar nicht von BMW. Das ist wirklich irgendein Influencer Dude oder was?Wer ist das? Alter wer mischt diese Videos immer ab? Das ist doch nicht euer Ernst. Pepe?Ach Peppa. Chancen vertan. Muss mal kurz gucken wie viele Subs hat der auf Instagram? 6000.Hey Laura ich habe gerade deine Freundin Peppa kennengelernt. Zufälligerweise steht Lauragenau daneben. Arbeitet ihr also mit Robotern? Ja wir programmieren hier beispielsweise auchmit Peppa. Was haben denn Roboter mit Autos zu tun? Die Roboter helfen uns bei den Autoshauptsächlich in der Produktion aber auch hier im IT Bereich. Krass. Sag mal was machtdenn der Arbeit am meisten Spaß? Am meisten gefakt mit dass wir... Jetzt wird was zusammengefakt. Jetzt wird was zusammen gefakt. Bei diesen Fragen kannst du nur gefakt antworten.... wo wir alle zusammen arbeiten. Jeder von uns kann seinen Arbeitsalltag selbst einstellenund gestalten. Da habe ich so meine Zweifel. Das kann überhaupt nicht funktionieren wennjeder machen kann was er will. Und wenn wir beispielsweise mit Peppa programmieren sehenwir am Ende was für ein tolles Ergebnis wir haben. Finde ich wirklich wichtig. Sag malbist du gar nicht an den Fahrzeugen? Selbst wenn man so super agile und agil ist teiltman sich nicht einfach random irgendwie was selbst ein. Da gibt es trotzdem einen Backlogund einen Plan was man macht. Aber Melanie die kann dir weiterhelfen. Alles klar dannwerde ich dich mal besuchen. Danke. Auf gehen wir zu Melanie. Hey Melanie schön dass dudir Zeit genommen hast. Hallo. Du sag mal wo sind wir hier eigentlich? Wir sind hiergerade bei einem Standpunkt von BMW Motorrad. Wo hauptsächlich die IT so geschrieben wirdfür die Handlersysteme. Also quasi die Diagnose wenn ein Motorrad kaputt ist, dass man esansteckt und sagt hey was geht. Da war das Video übersteuert. Weißt du was sie da getriebenhaben? Das ist ziemlich wichtig. Und was sind deine Aufgaben in der Ausbildung? Also ichals Azubi lerne natürlich auch alles mögliche drum rum. Die IT Strategien und alles. Aberder Fokus liegt definitiv auf den verschiedenen Programmiersprachen. Okay was denn? Was fürProgrammiersprachen? Das würde mich ernsthaft wenn ich mich da bewähren würde interessierenum was für Programmiersprachen. Mit dem kann ich mich ganz witzig auf das Motorrad draufschalten. Das heißt wenn ich jetzt zum Beispiel einfach das Licht ändern will. Wow das istja krass. Boah. Und was kannst du noch damit achten? Eigentlich alles was das Herz begehrt.Das ist quasi nur mal zum Testen für den Händler. Hey geht es noch? Geht die Lampenoch? Genau. Das wirkt überhaupt nicht gestellt. Du sag mal mit BMW verbinde ich eigentlichauch Autos. Kannst du mir da auch was zeigen? Klar aber dann solltest du besser zum Adrianogehen. Super mache ich. Danke dir. Also die müssen unbedingt sich mal einen besserenVideo. Also generell diese ganzen Azubi Videos bisher die hatten immer zu leise Stimmen undzu laute Musik. Hey Adriano. Servus Easy. Du ich war schon gerade bei Melanie und sie hatgemeint dass du der Richtige bist wenn es um Autos geht. Na klar doch. Und er heißtEasy? Easy. Jawoll. Kannst du mir verraten was du in deiner Ausbildung so machst? Alsodas erste was ich mache ist ich lerne wie mein Softwarecoach schreibt und das machenwir um Aufgaben die voll von Menschen durchgeführt werden jetzt von Maschinen durchführen zulassen. Das ist automatisch und geht einfach schneller. Das hört sich ziemlich komplizierter.Konkretes Beispiel. Ich habe gerade eine App und programmiert es so dass sie sich selberausführt und diese App kann am Ende mit dem Auto sprechen. Hä? Hä? Was? Nochmal. OhMoment. Das habe ich jetzt nicht verstanden. Was? Nochmal. Nochmal. Das ist automatisch.Moment. Na klar doch. Kannst du mir verraten was du in deiner Ausbildung so machst? Alsodas erste was ich mache ist ich lerne wie mein Softwarecoach schreibt und das machenwir um Aufgaben die voll von Menschen durchgeführt werden jetzt von Maschinen durchführen zulassen. Also er programmiert irgendwelche Bandroboter oder wie oder was? Also sprichtdas was Leute früher am Fließband gemacht haben? Programmiert er jetzt quasi irgendso einen Greifarm der das macht oder sowas? Okay. Das ist automatisch und geht einfachschneller. Das hört sich ziemlich komplizierter. Konkretes Beispiel. Okay. Ich habe geradeeine App und programmiert es so dass sie sich selber ausführt und die. Ach jetzt kapiereich das. Der testet die App beziehungsweise ne der testet die Steuerung für die fürden Kram. Ich glaube jetzt kapiere ich das. Okay. Das ist das ist eine Test App die quasichecken kann ob mit dem Auto alles in Ordnung ist. Also keine Ahnung. Auto ist ist teilweisezusammengebaut. Dann wird das gestartet und das checkt dann ob das Auto nach dem selbstcheck sagt es ist alles okay. Irgendwie sowas in der Richtung. Das habe ich am Anfang echtnicht kapiert. Kann ich mir gar nicht vorstellen. Können wir uns das mal anschauen? Ja klar.Super. Also was kannst du mir jetzt zeigen? Pass mal auf. Hat er gerade gesagt Alter.Vorstellt können wir uns das mal anschauen? Ja klar. Super. Also was kann. Das sagt mandoch heute gar nicht mehr. Das hat man gesagt wo ich jung war. Sind jetzt Boomer neuerdingsschon 20 oder was? Heute hat man gesagt ey Digga. Oder. Ach der sagt also. Ach so. Achich dachte er hat gesagt ich habe gesagt Alter. Digga zeig mal her. Kannst du mir jetzt zeigen?Pass mal auf. Boah jetzt hast du mich aber erschrocken. Ja Hupen machen wir eigentlichnormalerweise nur um das Auto auf dem Parkdeck wenn wir es nicht mehr finden eben wiederzu finden. Aber ich kann zum Beispiel auch aufsperren und zusperren. Heißt jetzt kannstdu mit deinem Handy jeden BMW aufsperren? Ja so einfach ist es nicht. Wir haben natürlicheine Baujahr. Würde ich jetzt auch sagen. Würde ich jetzt auch sagen. Das heißt abeinem bestimmten Baujahr gibt es nur und der Fahrer muss das bestätigen. Das ist echtein nicer Wagen ist aber nicht dein. Da ist aber kein Fahrrad drin. Doch. BMW bekommenwir als Azubis direkt günstige Konditionen so dass wir die Abstart mieten können. Hammerdarf ich mal in der Runde drehen? Ja klar. Ich wusste dass jetzt Musik kommt. Ich habees geahnt. Das war jetzt eine geile Fahrt. Vielen Dank Adriano und vor allem vielen DankBMW für den coolen Tag. Und jetzt nochmal für euch die wichtigste Zeit zu mitschreiben.Ich wollte gerade sagen weil man muss sagen wirklich viel erfahren hat man in dem Videojetzt nicht. Die Ausbildung dauert drei Jahre die ihr allerdings verkürzen könnt. Ausbildungsstartist immer im August oder im September. Bewerben könnt ihr euch allerdings ein Jahr im Voraus.Okay das ist jetzt. Jetzt hätte BMW wahrscheinlich gerne. Aber ich kenne genug die sich nichtein Jahr im Voraus bewerben. Das hätten die alle gerne. Aber das kommt oft genug vordass es die Leute nicht machen. Ja ja ich weiß ich sage ja das hätten die gerne. Aberes kommt oft genug vor dass das nicht praktiziert wird. Okay es kann ja sein dass BMW das macht.Und BMW sagt wenn du es nicht machst dann nehmen wir dich halt nicht. Es ist ja denenihr gutes Recht. Die können ja machen was sie wollen.Okay das heißt das finde ich schon mal ganz gut. Das heißt sie sagen damit nämlich auchwir bilden das aus weil wir das brauchen. Das ist tatsächlich gut in München weißich es nicht. Aber das ist ordentlich ja. 1000 Euro nicht? Nö. Also ehrlich gesagtkeine Ahnung wie es jetzt aktuell ist. Aber 1000 Euro im ersten Ausbildungsjahr klingtrichtig gut. Ich meine worauf wartet ihr noch? Hier ist der Link für alle weiteren Infos.Ich hoffe euch hat das Video gefallen. Bis zum nächsten Mal. Peace. Peace. Okay ichhabe null erfahren wie das bei BMW so ist nach dem Video. Dann fand ich ohne Scheißvon den ganzen Videos die wir bisher geguckt haben heute. Da fand ich die Relax Days eigentlicham besten. Da wo der Chat gesagt hat null Cringe. Das war eigentlich super. Die hateinfach nicht um den heißen Brei herum gelabert. Die hat einfach gesagt wie es ist. Max Silbermannfünf Monate dankeschön für den Sub. Leute habt ihr mal auf die Uhr geguckt. Wisst ihrwas das heißt? Korrekt. Guckt er schläft schon. Also Leute wir sehen uns dann. NächstenStreben. Bis dann war es gut. Outro Musik noch. Bis dann. CU.", "segments": [{"id": 1, "start": 60.0, "end": 89.76, "text": "da bin ich relativ spontan ich habe ein bisschen zeug aus ich habe meine steam"}, {"id": 2, "start": 89.76, "end": 95.76, "text": "library durchgeguckt bisschen zeug aus dem angeguckt nämlich festgestellt ich"}, {"id": 3, "start": 95.76, "end": 98.92, "text": "habe bock auf nix deswegen habe ich einfach mal den stream angemacht"}, {"id": 4, "start": 98.92, "end": 109.28, "text": "ja ja ja ja ja cringe kein kein stream heute ich habe auch nix geplant betke"}, {"id": 5, "start": 109.28, "end": 124.08, "text": "betke ist in betke ist in 145 betke auf origin ja auf origin was macht"}, {"id": 6, "start": 124.08, "end": 128.36, "text": "eigentlich wenn es gerade das mal kurz checken das war kurz mal eine gucken was"}, {"id": 7, "start": 128.36, "end": 134.56, "text": "meint ihr was ist der was ist der meistbesuchte wenn es so aber ich tippe"}, {"id": 8, "start": 134.56, "end": 140.44, "text": "auf fünf leute kurz checken kurz checken"}, {"id": 9, "start": 140.44, "end": 156.96, "text": "acht klar dass da nix los ist"}, {"id": 10, "start": 156.96, "end": 172.04, "text": "wahrscheinlich ist auch noch ein server mit bots drauf so ja keine ahnung der"}, {"id": 11, "start": 172.04, "end": 175.92, "text": "server namen habe ich gar nicht gelesen habe ich jetzt gar nicht anguckt was"}, {"id": 12, "start": 175.92, "end": 181.4, "text": "ist das aber was war das war das top mal das monka tostserver namen"}, {"id": 13, "start": 181.4, "end": 189.8, "text": "most played vr server ja gut mit zehn slots"}, {"id": 14, "start": 196.8, "end": 204.92, "text": "sind wir jetzt eigentlich nicht na ja ich finde das also generell ist und also"}, {"id": 15, "start": 204.92, "end": 211.16, "text": "ist sinnlos gehyped zu sein eigentlich in der regel immer nicht gut also ich"}, {"id": 16, "start": 211.16, "end": 219.16, "text": "tippe ja drauf dass es schon ein geiles battlefield wird aber das garantiert"}, {"id": 17, "start": 219.16, "end": 223.48, "text": "wieder zwei drei sachen drin sind die richtig abfacken"}, {"id": 18, "start": 223.96, "end": 229.04, "text": "ich meine wir wissen nicht wie sich der kram spielt es gibt ja gibt ja bald eine"}, {"id": 19, "start": 229.04, "end": 234.12, "text": "beta oder warte mal wann war die ich habe schon siebte achte ne"}, {"id": 20, "start": 234.12, "end": 241.8, "text": "wann war mal mal neu war wa du failed bitte an warten das noch mal"}, {"id": 21, "start": 241.8, "end": 249.0, "text": "grey"}, {"id": 22, "start": 250.54, "end": 256.68, "text": "zu battlefield 20 2 42 alles klar"}, {"id": 23, "start": 256.68, "end": 273.76, "text": "Wo steht denn der Termin jetzt? September, also irgendwie siebter, siebter neunter oder"}, {"id": 24, "start": 273.76, "end": 281.28, "text": "irgendwie sowas war das, war das glaube ich geleakt mal, naja also spätestens dann wissen"}, {"id": 25, "start": 281.28, "end": 285.84, "text": "wir ob das Game was taucht, das ist so ein bisschen wie, das wird so ein bisschen wie"}, {"id": 26, "start": 285.84, "end": 292.76, "text": "die Beta von New World jetzt, New World, New Worlds, New World heißt es genau, also alles"}, {"id": 27, "start": 292.76, "end": 296.92, "text": "was dann kacke sein wird an dem Game, wird bei Release auch noch kacke sein, hör von"}, {"id": 28, "start": 296.92, "end": 309.44, "text": "ausgehen, fand es ja wieder lustig, in meinem Video konnten sich die Leute ja wieder nicht"}, {"id": 29, "start": 309.44, "end": 318.12, "text": "einigen, ob ich das Spiel jetzt zu sehr lobe oder zu schlecht mache, New Worlds, ich muss"}, {"id": 30, "start": 318.12, "end": 323.64, "text": "sagen ich hab jetzt gar nicht mehr so großartig gespielt, bei mir war nach Level, keine Ahnung"}, {"id": 31, "start": 323.64, "end": 332.76, "text": "18 oder so, war knapp, war die Luft raus, das Problem ist ich wollte eigentlich spielen"}, {"id": 32, "start": 332.76, "end": 341.68, "text": "bis zuerst, bis zum ersten PvM Raid, hab ich aber nicht gemacht, weil das, also es ist"}, {"id": 33, "start": 341.68, "end": 346.2, "text": "ja normal, ich hab ja nichts dagegen wenn MMOs Kreiselcrimes sind und ich hab ja auch"}, {"id": 34, "start": 346.2, "end": 352.4, "text": "nichts dagegen wenn MMOs sich irgendwie wiederholen, aber New World war ja im Endeffekt statt"}, {"id": 35, "start": 352.4, "end": 358.16, "text": "Quest Board, klick klick klick, einmal im Kreis laufen, statt Quest Board, klick klick"}, {"id": 36, "start": 358.16, "end": 366.04, "text": "klick, einmal im Kreis laufen, also das war mir dann auch zu dumm, ansonsten hab ich nach"}, {"id": 37, "start": 366.04, "end": 369.8, "text": "wie vor die Vermutung, dass viele Mechaniken in dem Spiel nicht genug Tiefgang bieten"}, {"id": 38, "start": 369.8, "end": 379.12, "text": "auf Dauer, tja, aber mal gucken, es ist auf jeden Fall das einzige was Amazon noch irgendwie,"}, {"id": 39, "start": 379.12, "end": 383.6, "text": "das einzige wie sagt man schon, das einzige Eisen was Amazon noch im Feuer hat, auch total"}, {"id": 40, "start": 383.6, "end": 389.2, "text": "boomerspruch, nee das ist eigentlich noch im Mittelalterspruch eher, das einzige Eisen"}, {"id": 41, "start": 389.2, "end": 393.8, "text": "was Amazon noch im Feuer hat, alles andere haben sie verkackt, Herr der Ringe MMO haben"}, {"id": 42, "start": 393.8, "end": 400.72, "text": "sie eingestellt, Leute ich sag's euch, ich sag's euch, ich sag's euch wie es ist, Amazon"}, {"id": 43, "start": 400.72, "end": 405.52, "text": "möchte ja eine Herr der Ringe Serie machen, ich sag euch die wird sacken, ich könnte,"}, {"id": 44, "start": 405.52, "end": 410.6, "text": "ich mach ich nicht, aber ich könnte meinen Arsch drauf verwenden, dass die Serie sacken"}, {"id": 45, "start": 410.6, "end": 422.0, "text": "wird, wann auch immer die rauskommen, man weiß es ja gar nicht, ich glaube wirklich"}, {"id": 46, "start": 422.0, "end": 429.16, "text": "das Portal gar nicht so der Hammer wird für die meisten Leute, weil es ist halt kein Map"}, {"id": 47, "start": 429.16, "end": 433.72, "text": "Editor, es ist ein Spielmodus Editor, ich weiß nicht ob das reicht wahnsinnig interessante"}, {"id": 48, "start": 433.72, "end": 438.04, "text": "Dinge zu machen, in Overwatch ist das auch eher so ein Gimmick, dass es sowas gibt,"}, {"id": 49, "start": 438.04, "end": 442.36, "text": "man kann natürlich in Portal deutlich mehr machen, als man es in Overwatch Custom Lobbys"}, {"id": 50, "start": 442.36, "end": 452.04, "text": "machen kann, wie kann man Daten von einer Bluetooth Waage auslesen, du musst ja erstmal"}, {"id": 51, "start": 452.04, "end": 456.64, "text": "das Protokoll raussuchen, also nicht Bluetooth sondern das Custom oder weiß ich auch was"}, {"id": 52, "start": 456.64, "end": 462.16, "text": "Protokoll nennt, das Format in dem die Bluetooth Waage Sachen versendet, also wenn die Sachen"}, {"id": 53, "start": 462.16, "end": 466.48, "text": "verschlüsselt sind und der Key nicht öffentlich ist, hast du eh wahrscheinlich gelitten,"}, {"id": 54, "start": 466.48, "end": 472.96, "text": "aber bei den meisten halbwegs verbreiteten Sachen, haben das schon findige Leute aus"}, {"id": 55, "start": 472.96, "end": 481.24, "text": "den Apps extrahiert, ich muss mich mal ordentlich hinsetzen, sonst pinche ich gleich ein, das"}, {"id": 56, "start": 481.24, "end": 486.08, "text": "heißt du musst erstmal am besten nach dem Typ der Waage suchen, dann guckst du ob es"}, {"id": 57, "start": 486.08, "end": 491.0, "text": "irgendjemand gibt, der schon das Protokoll bzw. das Format der Daten irgendwie rausbekommen"}, {"id": 58, "start": 491.0, "end": 497.08, "text": "hat, wie das verschickt wird und dann nimmst du dir irgendeinen Controller und liest den"}, {"id": 59, "start": 497.08, "end": 503.2, "text": "Kram aus, musst du selbst programmieren oder es gibt schon was fertiges, am einfachsten"}, {"id": 60, "start": 503.2, "end": 507.64, "text": "ist natürlich mit der offiziellen App von der Waage, aber dann hast du auch die gleichen"}, {"id": 61, "start": 507.64, "end": 513.56, "text": "Beschränkungen und im Zweifelsfall China Cloud, China-Chinesen Cloud am Start, macht"}, {"id": 62, "start": 513.56, "end": 517.56, "text": "da eigentlich Aliexpress und sind da wieder die Versand, sind bei Aliexpress eigentlich"}, {"id": 63, "start": 517.56, "end": 526.4, "text": "jetzt immer endlich die Versandkosten wieder normal, kurz checken, ja natürlich kauf mir"}, {"id": 64, "start": 526.4, "end": 536.96, "text": "schnell ein Auto bei Aliexpress, auf gehts, bam, oh super, das haben, was zum geil soll"}, {"id": 65, "start": 536.96, "end": 550.96, "text": "das sein, was ist das, eine Matratze für den Kofferraum, ok, China Zeug, wird das ein"}, {"id": 66, "start": 550.96, "end": 557.72, "text": "Resident Sleeper oder Five Head Stream, weiß ich nicht, sind die Versandkosten wieder normal,"}, {"id": 67, "start": 557.72, "end": 569.08, "text": "zeig her, Aliexpress, ich will das nicht kaufen, Chips from Frankreich, ok die Versandkosten,"}, {"id": 68, "start": 569.08, "end": 588.52, "text": "wow, warum ist das auf einmal, Alter, äh, aner stellt es da nicht zurück, warum kann"}, {"id": 69, "start": 588.52, "end": 601.0, "text": "ich nur einen bestellen über Safer Shipping, was ist das für Gebate, kostenloser Versand,"}, {"id": 70, "start": 601.0, "end": 606.4, "text": "jawoll, die haben es auch auf einen beschränkt, also man kann echt bei den China-Chinesen"}, {"id": 71, "start": 606.4, "end": 611.84, "text": "grad nicht bestellen, kannst du das Video zum ersten Ausbildungstag vor dem zweiten"}, {"id": 72, "start": 611.84, "end": 620.28, "text": "und achten hochladen, ja ich hab mir überlegt ob ichs am Wochenende mach, also hier so irgendwann,"}, {"id": 73, "start": 620.28, "end": 623.76, "text": "ich muss mal gucken, ich muss aber noch irgendwas anderes hochladen in der Zwischenzeit, das"}, {"id": 74, "start": 623.76, "end": 628.16, "text": "sind ja Videos die jetzt nicht so viele Leute interessiert, das interessiert die Leute die"}, {"id": 75, "start": 628.16, "end": 641.16, "text": "eine Ausbildung machen oder anfangen, aber insgesamt ist jetzt nicht so viel, einfach"}, {"id": 76, "start": 641.16, "end": 646.48, "text": "5 mal bestellen, ja wenns kostenlos ist kann man das machen, aber die sind nicht doof,"}, {"id": 77, "start": 646.48, "end": 649.64, "text": "die sind nicht doof, gibt es eigentlich, da hab ich lange nicht mehr drauf geguckt auf"}, {"id": 78, "start": 649.64, "end": 659.28, "text": "den Channel, hat er eigentlich neue Battlefield 3 Top Plays, nö, gibt keine mehr, keiner"}, {"id": 79, "start": 659.28, "end": 669.12, "text": "spielt bei Battlefield 3, oh, ich hab gehört, wir haben bei den Olympischen Spielen im Tresur-Reiten"}, {"id": 80, "start": 669.12, "end": 684.6, "text": "wieder gewonnen, meine absolut Lieblingssportart, Tresur-Reiten, ganz ganz spannend, also es"}, {"id": 81, "start": 684.6, "end": 692.68, "text": "gibt glaub ich kaum eine mehr Residenz-Sleeper-Sportart als Tresur-Reiten, nix gegen Tresur-Reiter,"}, {"id": 82, "start": 692.68, "end": 703.48, "text": "weißte es einer von euch macht, aber ich bezweifle es, ja gut, in dem Fall, das stimmt, das stimmt,"}, {"id": 83, "start": 703.48, "end": 709.4, "text": "keine Ahnung, ich hab das doch nicht geguckt, ich hab nur heute zufällig gelesen, dass wir"}, {"id": 84, "start": 709.4, "end": 714.44, "text": "ne Medaille gewonnen haben, ist mir auch vollkommen egal, wenn ich ehrlich bin, also Tresur-Reiten"}, {"id": 85, "start": 714.44, "end": 723.44, "text": "könnte mich kaum weniger interessieren, 20 Jahre Kubernetes-Erfahrung, ja, muss sein,"}, {"id": 86, "start": 723.44, "end": 731.44, "text": "also unter 20 Jahre Kubernetes-Erfahrung würd ich dich auch nicht einstellen, ach, ich weiß"}, {"id": 87, "start": 731.44, "end": 737.44, "text": "gar nicht, ich glaub so, ich glaub so, es ist auf jeden Fall anstrengender als vorm Rechner"}, {"id": 88, "start": 737.44, "end": 752.44, "text": "sitzen. Competition, ich frag mich eh, wann es E-Sport gibt bei Olympia. Das Olympische"}, {"id": 89, "start": 752.44, "end": 764.24, "text": "CS-Turnier, das wär doch mal was, oder? Langsam ist es echt mal an der Zeit, was da teilweise"}, {"id": 90, "start": 764.24, "end": 768.8, "text": "für merkwürdige Sportarten am Start sind, von denen ich noch nie was gehört hab, und"}, {"id": 91, "start": 768.8, "end": 774.24, "text": "ich sag euch, es würde definitiv Aufmerksamkeit bringen, dann habt ihr natürlich wieder die"}, {"id": 92, "start": 774.24, "end": 779.68, "text": "Boomer-Leute, die sagen, was, das, das ist doch kein Sport, den Scheiß da, den will"}, {"id": 93, "start": 779.68, "end": 783.28, "text": "ich mir nicht angucken, so, haste da wieder genug Leute, aber es würde auf jeden Fall"}, {"id": 94, "start": 783.28, "end": 793.6, "text": "Aufmerksamkeit bringen, also ich würd mir lieber das Olympische CS-Turnier angucken,"}, {"id": 95, "start": 793.6, "end": 814.76, "text": "als Tresur reiten. Gibt's schon relativ lange. Haben wir doch letztens erst gemacht. Die"}, {"id": 96, "start": 814.76, "end": 819.28, "text": "Chinesen haben ein Zollproblem, na, eigentlich haben die sich ja da ganz gut drauf vorbereitet"}, {"id": 97, "start": 819.28, "end": 829.68, "text": "mit Warenlager in der EU, oder eben nach Niederlande oder Spanien schicken. Die chinesischen,"}, {"id": 98, "start": 829.68, "end": 837.28, "text": "China-Chinesen, ja. Was hat hier jemand? Ein Link, damit man Azure-Test-Coins bekommt."}, {"id": 99, "start": 837.28, "end": 848.08, "text": "Ne, ich weiß gar nicht, was Azure-Test-Coins sind. Aber jetzt ein Partnerprogramm, wo man"}, {"id": 100, "start": 848.08, "end": 855.76, "text": "Leute werben kann. Ach, haben wir uns eigentlich schon das, ja, das haben wir uns angeguckt,"}, {"id": 101, "start": 855.76, "end": 862.8, "text": "JetBrains. Das wollte ich mir mit euch aber noch ein bisschen näher angucken, genau, die"}, {"id": 102, "start": 862.8, "end": 869.56, "text": "Abstimmung von JetBrains zu Programmiersprachen und Verwendung von Betriebssystemen und sowas,"}, {"id": 103, "start": 869.56, "end": 878.4, "text": "das fand ich eigentlich ganz spannend. Die Seite ist irgendwie ein bisschen zu rechtsbündig,"}, {"id": 104, "start": 878.4, "end": 882.68, "text": "oder? Die sollte eigentlich, ich hab den Eindruck, die Seite sollte eigentlich eher ein bisschen"}, {"id": 105, "start": 882.68, "end": 893.32, "text": "mehr zentriert sein. Ach so, gratis testen kannst du bei Azure, na gut, da brauchst du"}, {"id": 106, "start": 893.32, "end": 900.08, "text": "eine neue Handy-Nummer, ja. Mit der neuen Handy-Nummer kannst du deinen Probo-Account machen. Brauchst"}, {"id": 107, "start": 900.08, "end": 906.72, "text": "neuen Accounten und eine Handy-Nummer. Dann kannst du, fragt mich nicht, was da, Basic,"}, {"id": 108, "start": 906.72, "end": 921.76, "text": "100 Euro, Dollar, keine Ahnung. Wollen sie das? Hab ich noch nix von gehört. Die sollen"}, {"id": 109, "start": 921.76, "end": 933.64, "text": "wir alle mal machen. Joa. Habt ihr das eigentlich mitbekommen, dass die Apotheken, ich weiß,"}, {"id": 110, "start": 933.64, "end": 937.24, "text": "das ist jetzt auch schon ein paar Tage halt, wahrscheinlich ist es schon wieder News von"}, {"id": 111, "start": 937.24, "end": 943.28, "text": "gestern, ja, aber habt ihr das mitbekommen mit den Apotheken und dem Corona-Zertifikat,"}, {"id": 112, "start": 943.28, "end": 949.8, "text": "dass alle Apotheken wohl den gleichen Private Key benutzen, um die Zertifikate auszustellen?"}, {"id": 113, "start": 949.8, "end": 959.32, "text": "Und dass es dementsprechend keinen Weg gibt, quasi gefakte Corona-Zertifikate zurückzurufen,"}, {"id": 114, "start": 959.32, "end": 969.16, "text": "das ist, das ist echt typisch Big-Brain-Technik wieder, gut. Was macht eigentlich so der europäische"}, {"id": 115, "start": 969.16, "end": 984.88, "text": "Impfpass? Gibt's den jetzt und kann man den benutzen? Ist, es ist so ein Geficke. Gatschi-Buzz,"}, {"id": 116, "start": 984.88, "end": 994.12, "text": "also ich hab, ich hab ja erst eine Impfung, aber ich hatte irgendwelche QR-Codes zum"}, {"id": 117, "start": 994.12, "end": 1008.96, "text": "Scannen. Ach, keine Ahnung. Zweifelsfall nehme ich irgendein Zettel mit. Ja, aber, aber das"}, {"id": 118, "start": 1008.96, "end": 1016.52, "text": "benutzt wahrscheinlich kaum einer oder es gibt irgendwelche Probleme. Hey, wenn der"}, {"id": 119, "start": 1016.52, "end": 1024.32, "text": "Private Key geleakt sein sollte, könnte ich mir einfach selbst das ausstellen. Echt, was"}, {"id": 120, "start": 1024.32, "end": 1032.0, "text": "ist? Ich habe auf Twitter gelesen von einem, der mit Herzmuskelentzündung ins Krankenhaus,"}, {"id": 121, "start": 1032.0, "end": 1035.04, "text": "also einen, den ich kenne, mit Herzmuskelentzündung ins Krankenhaus gekommen ist nach der Impfung"}, {"id": 122, "start": 1035.04, "end": 1047.68, "text": "mit BioNTech. Ja, ist trotzdem Fail. Also macht's ja nicht besser, nur weil's vor dem Launchklammer."}, {"id": 123, "start": 1047.68, "end": 1061.2, "text": "Ist halt für, naja, letztendlich, ich erwarte ja da auch schon gar nichts mehr. Ja gut, die"}, {"id": 124, "start": 1061.2, "end": 1072.68, "text": "haben's eh verkackt. Also ich krieg meine zweite Impfung am, lass mal gucken, ich glaube,"}, {"id": 125, "start": 1072.68, "end": 1081.32, "text": "am 23.08. krieg ich, oh Moment. Wie sind die eigentlich auf die dumme Idee gekommen, dass"}, {"id": 126, "start": 1081.32, "end": 1088.6, "text": "der Pfeil nach oben in den Monat zurückgeht? Total hängen geblieben, Microsoft. Wahrscheinlich"}, {"id": 127, "start": 1088.6, "end": 1098.84, "text": "am, ich glaube hier, ich glaube am 23.08. Also ich hatte nix, mir hat der Arm ein bisschen"}, {"id": 128, "start": 1098.84, "end": 1103.92, "text": "wehgetan, also ich hatte gar nix davon. Also gut, es ist natürlich individuell, aber ich"}, {"id": 129, "start": 1103.92, "end": 1110.56, "text": "kann schon von mir sagen, ich hatte gar nix. Ich hatte ein bisschen Kopfweh und ein bisschen,"}, {"id": 130, "start": 1110.56, "end": 1114.12, "text": "dass mir der Arm wehgetan hat, wenn ich drauf gelegen hab zwei Tage, aber sonst, ich hatte"}, {"id": 131, "start": 1114.12, "end": 1121.64, "text": "eigentlich nix. Haut erst bei der zweiten rein, MonkaS, der Chat macht mir aber Mut"}, {"id": 132, "start": 1121.64, "end": 1127.32, "text": "drauf, aber eins sag ich euch, eins sag ich euch, ich hab ja den Terminshot, ich lass"}, {"id": 133, "start": 1127.32, "end": 1131.44, "text": "mich auch impfen, ich find das auch ne wichtige Sache, dass man das macht, aber sollte irgendeiner"}, {"id": 134, "start": 1131.44, "end": 1137.36, "text": "auf die Idee kommen, mich zwingen zu wollen, dann sag ich ab, das sag ich euch. Wenn irgendjemand"}, {"id": 135, "start": 1137.36, "end": 1141.76, "text": "wirklich auf die Idee kommt und sich quasi über meinen Kopf hinweg entscheidet, was"}, {"id": 136, "start": 1141.76, "end": 1149.76, "text": "ich zu tun hab oder zu lassen hab, dann sag ich das ab. Also ihr könnt euch sagen, so"}, {"id": 137, "start": 1149.76, "end": 1153.32, "text": "viel ihr wollt, wenn irgendjemand sagt, es besteht Pflicht, dass ich das machen muss"}, {"id": 138, "start": 1153.32, "end": 1165.36, "text": "unter Androhung von Strafe, dann mach ich das nicht. Das seh ich nicht ein. Auch wenn"}, {"id": 139, "start": 1165.36, "end": 1170.08, "text": "ich's sinnvoll finde und mich auch freiwillig, ich lass mich freiwillig impfen, keine Probleme,"}, {"id": 140, "start": 1170.08, "end": 1173.64, "text": "aber nicht unter Androhung von Strafe. Sollte irgendjemand auf die Idee kommen zu sagen,"}, {"id": 141, "start": 1173.64, "end": 1176.24, "text": "das ist Pflicht, ansonsten musste ich keine Ahnung, Bußgeld bezahlen, dann könnt ihr"}, {"id": 142, "start": 1176.24, "end": 1181.84, "text": "mich am Arsch lenken. Das seh ich nicht ein. Das ist, mein Körper, das ist meine komplett"}, {"id": 143, "start": 1181.84, "end": 1186.24, "text": "freie Entscheidung, das soll's auch bleiben, ich mach's, weil ich's sinnvoll finde, aber"}, {"id": 144, "start": 1186.24, "end": 1194.8, "text": "nicht, weil irgendjemand sagt, ich muss es machen. Ja, ähm, ist das echt so? Ich lass"}, {"id": 145, "start": 1194.8, "end": 1200.36, "text": "mich, ich, ich, ich lass mir die trotzdem, bäm, 23. Hau, lass ich mir das Ding reinhauen,"}, {"id": 146, "start": 1200.36, "end": 1206.04, "text": "gut ist. Vielleicht ist es auch 16, ich glaub, es ist, es ist ein Montag im August und, und"}, {"id": 147, "start": 1206.04, "end": 1219.8, "text": "es ist ein zweistelliger Montag und es ist nicht der, ich glaub, es ist der 23. Ja, genau,"}, {"id": 148, "start": 1219.8, "end": 1230.28, "text": "beim Armschmerzen hatte ich auch, das war's. Es wird ja sogar empfohlen, dass man die zweite"}, {"id": 149, "start": 1230.28, "end": 1233.84, "text": "quasi mit was anderem macht. Spackhack, danke schon für 6 Monate, ich hoffe, ich hab kein"}, {"id": 150, "start": 1233.84, "end": 1238.68, "text": "Zap übersehen. Nee, sieht nicht so aus. Wird da teilweise sogar empfohlen, dass man"}, {"id": 151, "start": 1238.68, "end": 1248.32, "text": "eine andere als zweite Impfung nimmt. Ja, die chinesischen, China-Chinesen haben echt"}, {"id": 152, "start": 1248.32, "end": 1260.6, "text": "kein Problem mit dem Versand, wie es aussieht. Ich seh schon, bei einigen ging es ab hier."}, {"id": 153, "start": 1260.6, "end": 1264.04, "text": "Wie gesagt, ich kenn einen auf Twitter, der musste ins Krankenhaus mit Herzmuskelentzündung"}, {"id": 154, "start": 1264.04, "end": 1283.56, "text": "hat da geschrieben, das war auch richtig MonkaS. Stonks geht ab, Leute. Okay, also ich seh"}, {"id": 155, "start": 1283.56, "end": 1292.4, "text": "schon mal, der meiste ist eigentlich kein Problem. Naja. Ich fand's so interessant"}, {"id": 156, "start": 1292.4, "end": 1299.24, "text": "mit dem Zertifikat bei den Apotheken, so nach dem Motto, warum haben die ein Private Key"}, {"id": 157, "start": 1299.24, "end": 1304.68, "text": "für alles? Keine Ahnung, wer sich das wieder ausgedacht hat. Und übrigens, wisst ihr was,"}, {"id": 158, "start": 1304.68, "end": 1308.56, "text": "gestern wieder, nee, stimmt nicht. Ja, Mist, Leute, jebaited, das hab ich nicht gestern"}, {"id": 159, "start": 1308.56, "end": 1313.96, "text": "gemacht. Letzte Woche schon. Was ich letzte Woche wieder verlängert hab, ich hab letzte"}, {"id": 160, "start": 1313.96, "end": 1321.16, "text": "Woche wieder verlängert, YouTube Premium, aber, aber nicht einfach YouTube Premium,"}, {"id": 161, "start": 1321.16, "end": 1327.04, "text": "sondern ich hab wieder über Indien bestellt. Guck mal, hier kostet es 12 Euro im Monat"}, {"id": 162, "start": 1327.04, "end": 1333.08, "text": "und ich hab über Indien bestellt, da kostet es, glaub ich, 340 Indische Rupien. Indische,"}, {"id": 163, "start": 1333.08, "end": 1344.12, "text": "ich weiß gar nicht, zu Euro, ja, meinetwegen. Da kostet es 3,86 Euro. Und das könnte sogar"}, {"id": 164, "start": 1344.12, "end": 1355.92, "text": "3 Monate sein. Das könnte sogar 3 Monate sein. Warte mal, Indien YouTube Premium, mal kurz"}, {"id": 165, "start": 1355.92, "end": 1364.6, "text": "gucken, mal kurz, mal kurz schenken. Naja. Da brauchst du ja nicht My Deals dafür, aber"}, {"id": 166, "start": 1364.6, "end": 1372.64, "text": "vielleicht haben die es mal umgerechnet. Also ich hab das, was irgendwie 340, 340 Rupien"}, {"id": 167, "start": 1372.64, "end": 1377.32, "text": "kosten. Also ich bezahle dann irgendwie für 3 Monate YouTube Premium, über Indien bezahle"}, {"id": 168, "start": 1377.32, "end": 1383.56, "text": "ich dann irgendwie 350 oder so. Wie funktioniert das? Also da gibt es verschiedene Varianten."}, {"id": 169, "start": 1383.56, "end": 1387.56, "text": "Die einfachste Variante ist wahrscheinlich über ein kostenloses VPN, aber ich mach das"}, {"id": 170, "start": 1387.56, "end": 1393.44, "text": "immer so. Ich geh zu Digital Ocean. Das kann man leider nicht über Hetzner machen. Wer"}, {"id": 171, "start": 1393.44, "end": 1398.44, "text": "übrigens 20 Euro Startgut haben für die Hetzner Cloud braucht, weil er mal ein bisschen"}, {"id": 172, "start": 1398.44, "end": 1403.44, "text": "sich mit virtuellen Servern austoben will, Ausrufezeichen Hetzner in den Chat, kriegt"}, {"id": 173, "start": 1403.44, "end": 1410.84, "text": "ihr 20 Euro Startgut haben in meinem Gutscheincode. Aber leider kann man das nicht über die Hetzner"}, {"id": 174, "start": 1410.84, "end": 1422.4, "text": "Cloud machen, weil man braucht einen Anbieter, die Server in Indien haben. Und Digital Ocean"}, {"id": 175, "start": 1422.4, "end": 1433.4, "text": "hat ein Rechenzentrum in Bangalore. Ob da auch Banggood herkommt? So und das heißt man macht"}, {"id": 176, "start": 1433.4, "end": 1439.0, "text": "sich eine VM, so mach ich das zumindest. Ich hab keinen Bock auf irgendwelche VPN Geschichten"}, {"id": 177, "start": 1439.0, "end": 1445.6, "text": "oder sonst was. Ich miete mir einen Server bei Digital Ocean in Bangalore, installiere"}, {"id": 178, "start": 1445.6, "end": 1452.28, "text": "mir auf dem Server einen Firefox, mach den Firefox über X-Forwarding auf, log mich ein"}, {"id": 179, "start": 1452.28, "end": 1458.76, "text": "mit meinem Google Account, kauf YouTube Premium über Paypal und lösche den Server wieder."}, {"id": 180, "start": 1458.76, "end": 1471.24, "text": "Das dauert 5 Minuten. Und dann hast du YouTube Premium. Das bezahlst du dann über Paypal"}, {"id": 181, "start": 1471.24, "end": 1484.56, "text": "in Google im Account und dann hast du für 3,50 Euro YouTube Premium. Guck mal wie teuer"}, {"id": 182, "start": 1484.56, "end": 1492.12, "text": "der Krempel bei uns ist. Konfigurierst du den Server mit Ansible? Ne, da gibt es nichts"}, {"id": 183, "start": 1492.12, "end": 1498.0, "text": "zu konfigurieren. Ich lass den so wie es ist, das einzige was ich mache ist Firefox installieren"}, {"id": 184, "start": 1498.0, "end": 1505.44, "text": "und dann per X-Forwarding drauf, fertig. Nein, lohnt sich nicht. Finde ich, dass sich das"}, {"id": 185, "start": 1505.44, "end": 1510.2, "text": "nicht lohnt. Du hast auf dem englischen Layout, gerade wenn du eine englische Tastatur hast,"}, {"id": 186, "start": 1510.2, "end": 1516.4, "text": "du hast die, von der Beschriftung, du hast Klammern und sowas schon besser platziert,"}, {"id": 187, "start": 1516.4, "end": 1524.88, "text": "aber ich finde die Umgewöhnung ist nicht wert im Endeffekt. Es gibt ja noch viel abgedrehtere"}, {"id": 188, "start": 1524.88, "end": 1531.16, "text": "Tastaturlayouts zu programmieren. Lohnt sich? Nein, aus deiner Sicht vielleicht, ich seh"}, {"id": 189, "start": 1531.16, "end": 1535.48, "text": "das anders. Also ich finde der Aufwand lohnt sich nicht englisches Tastaturlayout zu lernen"}, {"id": 190, "start": 1535.48, "end": 1544.92, "text": "und zu programmieren. Aber kann jeder machen. Also ich finde es lohnt sich. Wie geht X-Forwarding?"}, {"id": 191, "start": 1544.92, "end": 1556.64, "text": "Das ist relativ einfach. X-Forwarding geht, achso, ich weiß nicht ob ich euch das zeigen"}, {"id": 192, "start": 1556.64, "end": 1564.88, "text": "kann. Kann ich euch zeigen, wie X-Forwarding geht. Es ist total einfach. Easy as fuck ist"}, {"id": 193, "start": 1564.88, "end": 1584.0, "text": "X-Forwarding. So. Ich überleg grad, wo connecte ich mich denn mal von hier drauf. Wir können"}, {"id": 194, "start": 1584.0, "end": 1593.16, "text": "Cloud-Server anlegen, nur dafür. Ich connecte mich einfach lokal, ist ja egal. So. Also"}, {"id": 195, "start": 1593.16, "end": 1616.24, "text": "X-Forwarding, achso. So. Gut. Also. Du sagst einfach SSH-Y, connectest dich auf den Server,"}, {"id": 196, "start": 1616.24, "end": 1627.0, "text": "wo du Firefox installiert hast. Und dann sagst du Firefox. Und dann gehts nicht, weil ich"}, {"id": 197, "start": 1627.0, "end": 1631.56, "text": "X-Forwarding ausgeschaltet hab bei mir lokal. Aber mehr musst du nicht machen. Ich hab"}, {"id": 198, "start": 1631.56, "end": 1636.4, "text": "einfach die Konfig nicht angepasst, das ist alles. Ich kann auf Raspberry Pi gehen, ja"}, {"id": 199, "start": 1636.4, "end": 1650.64, "text": "stimmt. Äh. Was hab ich denn für ein Pi? Ist das ein Raspberry Pi? Äh. Scheiße. Das"}, {"id": 200, "start": 1650.64, "end": 1659.84, "text": "ist doch aus dem Kopf jetzt nicht. Was hab ich denn mal für ein Raspberry Pi? Kannst"}, {"id": 201, "start": 1659.84, "end": 1665.64, "text": "du dich auch Socksproxy PSSRK? Ja, kannst du auch machen. Äh. Warte mal, erst mal überlegen,"}, {"id": 202, "start": 1665.64, "end": 1668.76, "text": "was hab ich denn für ein Raspberry Pi hier gerade am Start? Was ist das Ding von der"}, {"id": 203, "start": 1668.76, "end": 1675.52, "text": "IP? 100? Vielleicht? Ah, das wär ja zu einfach. Ah, ich muss mal kurz in mein DHCP gucken."}, {"id": 204, "start": 1675.52, "end": 1697.24, "text": "Zack. Muss mal kurz in mein DHCP. DHCP Server Networks Leases. Hi, was haben wir denn da?"}, {"id": 205, "start": 1697.24, "end": 1709.64, "text": "Aha, den gibt's nicht. Ach, das ist ja der Vierer. Ah, hier, den da. Perfekt. Für den"}, {"id": 206, "start": 1709.64, "end": 1720.68, "text": "Drucker. Jawoll. So, verbindst dich auf den Raspberry Pi drauf. Ach, das ist OctoPie."}, {"id": 207, "start": 1720.68, "end": 1726.84, "text": "Das ist ein OctoPie standardmäßig für ein Passwort. Kein Schimmer. Meine Güte, äh."}, {"id": 208, "start": 1726.84, "end": 1732.96, "text": "Das scheint schwierig zu sein, hier was zu finden. Ok, dann nehm ich den jetzt. Ich hab"}, {"id": 209, "start": 1732.96, "end": 1741.88, "text": "ja genug. Ich hab ja genug. Ok, ich hab Key-Authentifizierung und hab kein Key drauf. Leute, ich kann's"}, {"id": 210, "start": 1741.88, "end": 1746.28, "text": "euch jetzt nicht zeigen. Ach, das ist ja nicht root, das ist Raspberry, ne? Nee, Pi, Pi-Add."}, {"id": 211, "start": 1746.28, "end": 1752.44, "text": "Das ist ja. Ah ja, wunderbar. Ok, Firefox. Ist da Firefox nicht drauf installiert? Chrome?"}, {"id": 212, "start": 1752.44, "end": 1768.72, "text": "Auch nicht. Na dann. Dann installier ich jetzt einfach. Firefox. Was? Monkeys? Ah, so. Alles"}, {"id": 213, "start": 1768.72, "end": 1777.04, "text": "klar. Alter. Das ist, das ist gegen mich. Ich kann's euch jetzt nicht zeigen. Das funktioniert"}, {"id": 214, "start": 1777.04, "end": 1781.88, "text": "nicht. Das mag alles nicht. Will es jetzt auch nicht updaten, weil weiß was der dann"}, {"id": 215, "start": 1781.88, "end": 1790.8, "text": "alles macht? Yep. Im Prinzip sagst du erst das H-Y. Y ist short, nein. Äh, ja doch,"}, {"id": 216, "start": 1790.8, "end": 1794.64, "text": "genau, richtig. Also Y ist Abkürzung für X und das macht noch irgendwelche anderen"}, {"id": 217, "start": 1794.64, "end": 1803.48, "text": "Dinger. So, weißt du was? Zeig euch, ich zeig euch, zeig euch das jetzt. Ich zeig"}, {"id": 218, "start": 1803.48, "end": 1811.0, "text": "euch das jetzt. Ich mach das jetzt mit Hetzer Server. Login Hetzer. So. Das machen wir"}, {"id": 219, "start": 1811.0, "end": 1823.24, "text": "jetzt. Nicht DNS. Konsole. New Server. Muss ich mich jetzt erstmal einloggen. Ach, jetzt"}, {"id": 220, "start": 1823.24, "end": 1832.44, "text": "kommt wieder IP League. Fuck. Ich hab kein VPR. Nee, ich zeig's euch nicht. Was hat"}, {"id": 221, "start": 1832.44, "end": 1837.48, "text": "eigentlich mein Raspberry Pi für Schmerzen, dass der hier nicht, nicht, äh, installieren"}, {"id": 222, "start": 1837.48, "end": 1849.52, "text": "will, Firefox. Das ist, aber genauso wie ich's euch gezeigt hab, du machst SSH minus Y"}, {"id": 223, "start": 1849.52, "end": 1858.24, "text": "und dann hast du, ich kann doch mal hier mal, ich mach einfach ETC, SSH, SSHD, config, forwarding."}, {"id": 224, "start": 1858.24, "end": 1878.56, "text": "Hier. Da war's doch irgendwo. Hier, allow. Yes. Yes. Restart, SSHD. Ok. SSH, localhost,"}, {"id": 225, "start": 1878.56, "end": 1883.24, "text": "da machen wir das jetzt so. So, und ich hoffe jetzt funktioniert's, aber Firefox. Jawoll,"}, {"id": 226, "start": 1883.24, "end": 1889.56, "text": "ja. Der Firefox läuft jetzt nicht bei mir lokal, der Firefox geht jetzt über die SSH"}, {"id": 227, "start": 1889.56, "end": 1894.08, "text": "Verbindung und er zeigt das Fenster bei mir lokal an. Also dieser Server läuft jetzt"}, {"id": 228, "start": 1894.08, "end": 1902.84, "text": "eigentlich auf dem anderen Rechner und ich hab, ich seh ihn bei mir lokal, so mach ich"}, {"id": 229, "start": 1902.84, "end": 1910.08, "text": "das auch. Also sprich, ich hol mir sowas bei Digital Ocean in Indien und verbinde mich"}, {"id": 230, "start": 1910.08, "end": 1918.2, "text": "mit x-forwarding drauf und dann ist gut. Der Kram kostet ja auch nicht viel, weil die"}, {"id": 231, "start": 1918.2, "end": 1938.44, "text": "rechnen auch, ich glaub sogar minutlich ab. Ja. Pricing. Genau. Ja, da nimmt man einfach"}, {"id": 232, "start": 1938.44, "end": 1942.36, "text": "irgendwie sowas. Am besten mit 4 CPU-Kernen, das ist ein Browser, das sich halbwegs halt"}, {"id": 233, "start": 1942.36, "end": 1946.84, "text": "bedient. Ist egal, ob das 40€ im Monat kostet, weil ihr bezahlt. Am Endeffekt, in der Stunde"}, {"id": 234, "start": 1946.84, "end": 1951.88, "text": "seid ihr locker durch. Es dauert 5 Minuten, wenn man weiß, was man macht. Bei mir auf"}, {"id": 235, "start": 1951.88, "end": 1964.04, "text": "dem Pi kommt Error-No-Display-Environment-Specified. Hast du dich mit SSH-Y verbunden? Wenn das"}, {"id": 236, "start": 1964.04, "end": 1969.16, "text": "nicht geht, installier x-Auth. Das kann sein, dass das fehlt, aber sollte eigentlich nicht"}, {"id": 237, "start": 1969.16, "end": 1981.92, "text": "fehlen. Muss PSSH-Y drauf. Äh, guck mal, ob x-Auth installiert ist. Hier. Wenn ich"}, {"id": 238, "start": 1981.92, "end": 1991.88, "text": "installier das mal und probier es nochmal. So. Was wir machen? Monk hast dir nix. Ich"}, {"id": 239, "start": 1991.88, "end": 1995.24, "text": "hab grad 20 Minuten gebraucht für x-Forwarding, weil ich keine Kiste gefunden hab, wo ich"}, {"id": 240, "start": 1995.24, "end": 2004.16, "text": "das zeigen konnte. Ja, dann ist ein, dann ist, sobald das da steht, ist eigentlich alles"}, {"id": 241, "start": 2004.16, "end": 2013.88, "text": "richtig. Ja, dann musst du, dann guck mal in deine SSH-Config, ob x-Forwarding enabled"}, {"id": 242, "start": 2013.88, "end": 2021.24, "text": "ist. Da muss das drinstehen, x11-Forwarding. Aber wenn nicht. Also wenn das gesetzt ist,"}, {"id": 243, "start": 2021.24, "end": 2025.64, "text": "dann muss das funktionieren. Das ist eigentlich eines der unkomplizierten Sachen, die es so"}, {"id": 244, "start": 2025.64, "end": 2030.48, "text": "gibt, x-Forwarding machen. So, und zumindest mach ich dann x-Forwarding über Digital Ocean,"}, {"id": 245, "start": 2030.48, "end": 2036.52, "text": "Indian, VM und kauf mir Youtube Premium über Indian und bezahl dann 3,50 Euro für 3 Monate."}, {"id": 246, "start": 2036.52, "end": 2042.56, "text": "Viel besser als Youtube Premium hier zu kaufen. Easy. Dazu kann man eigentlich nur sagen."}, {"id": 247, "start": 2042.56, "end": 2051.8, "text": "So, leider kann man es glaube ich nicht einstellen, dass es automatisch verlängert. Sonst würde"}, {"id": 248, "start": 2051.8, "end": 2055.6, "text": "ich das nämlich machen. Dann könnte ich mir den Krempel sparen. Wisst ihr, wisst ihr"}, {"id": 249, "start": 2055.6, "end": 2061.84, "text": "was Big Brain Time wäre? Richtig Big Brain Time. Wir basteln eine Automatisierung dafür,"}, {"id": 250, "start": 2061.84, "end": 2070.84, "text": "die mir Youtube Premium kauft. Also man müsste dann, man müsste, man müsste über die Digital"}, {"id": 251, "start": 2070.84, "end": 2080.24, "text": "Ocean API eine VM erstellen, dann drauf einloggen und dann quasi dort den Browser fernsteuern."}, {"id": 252, "start": 2080.24, "end": 2097.16, "text": "Das ist mir aber glaube ich zu viel Aufwand für 5 Minuten klicken. Ja, das ist richtig."}, {"id": 253, "start": 2097.16, "end": 2104.84, "text": "Genau. Du musst SSHD noch neu starten, nachdem du die Option gesetzt hast. Aber ansonsten"}, {"id": 254, "start": 2104.84, "end": 2114.76, "text": "wüsste ich nicht woran das liegen sollte. Warum überhaupt Youtube Premium? Denn zum"}, {"id": 255, "start": 2114.76, "end": 2120.08, "text": "Beispiel, dass man keine Werbung sich angucken muss auf IOS. Auf IOS kannst du ja leider"}, {"id": 256, "start": 2120.08, "end": 2127.44, "text": "nichts gegen Werbung machen. Weil Apple sich gedacht hat, es gibt keine alternativen Apps."}, {"id": 257, "start": 2127.44, "end": 2141.4, "text": "Nee. Ja, Bedgetime in eineinhalb Stunden. Was meinst du dann? Und ansonsten, ansonsten"}, {"id": 258, "start": 2141.4, "end": 2146.36, "text": "juckt mich Youtube Premium eigentlich. Ich hab das nur wegen der Werbung. Bringt nix."}, {"id": 259, "start": 2146.36, "end": 2157.6, "text": "Zumindest nicht auf IOS. Oder ich müsste es mal wieder probieren. Hat jemand Piehole"}, {"id": 260, "start": 2157.6, "end": 2172.4, "text": "im Einsatz? Und IOS, Youtube geht das mittlerweile wieder? Nee. Nee, dann muss ich es auch nicht"}, {"id": 261, "start": 2172.4, "end": 2183.88, "text": "ausprobieren. Ja, Twitch geht auch nicht. Nee, Apple, also die sind ja da trickreich."}, {"id": 262, "start": 2183.88, "end": 2190.08, "text": "Du kannst dich ja da auch nicht irgendwie reinhängen oder so. Auf Android ist das alles"}, {"id": 263, "start": 2190.08, "end": 2193.68, "text": "kein Problem. Auf Android hast du sowohl für Twitch als auch für Youtube alternative"}, {"id": 264, "start": 2193.68, "end": 2199.84, "text": "Apps, wo das geht. Leider für Twitch nichts gescheites. Für Youtube gibt es ja ein paar."}, {"id": 265, "start": 2199.84, "end": 2207.72, "text": "Easy. Ja, und der IOS hast du halt gelitten. Aber ganz im Ernst, 3,50 Euro für 3 Monate,"}, {"id": 266, "start": 2207.72, "end": 2213.12, "text": "das kann ich mir grad noch so leisten. Das ist okay. Warum geht eigentlich der Darkreader"}, {"id": 267, "start": 2213.12, "end": 2220.44, "text": "nicht auf Youtube hier? Und warum ist das so eine Flashbang-Seite von Weiß auf Schwarz"}, {"id": 268, "start": 2220.44, "end": 2228.08, "text": "und dann wird der Hochscore wieder Weiß? Twitch-Werbung kann man nicht gescheit blocken. Nee. Weiß"}, {"id": 269, "start": 2228.08, "end": 2231.92, "text": "gar nicht, ob das Monkrat Toss ist, wenn man in einem Stream erzählt, wie man Twitch-Werbung"}, {"id": 270, "start": 2231.92, "end": 2240.48, "text": "blockt. Meint ihr, das ist Toss? Das ist bestimmt Toss. Also ich glaube nicht, dass es gescheit"}, {"id": 271, "start": 2240.48, "end": 2248.92, "text": "funktioniert aktuell. Es geht im Zweifelsfall nur mit customized Regex-Block-Regeln oder"}, {"id": 272, "start": 2248.92, "end": 2267.96, "text": "irgendwelchen neuen Addons, die noch trickreicher sind. Was ist denn das? Sehr cube. Ja, das"}, {"id": 273, "start": 2267.96, "end": 2275.08, "text": "geht aber nur. Das kannst du sideloaden, ne? Das kannst du sideloaden, aber sideloadete"}, {"id": 274, "start": 2275.08, "end": 2279.4, "text": "Apps musst du ja alle einmal in der Woche neu sideloaden oder sowas. Da war doch was"}, {"id": 275, "start": 2279.4, "end": 2284.88, "text": "bei IOS. Wenn du kein offizielles Developer-Zertifikat hast für das Gerät oder für dein Account,"}, {"id": 276, "start": 2284.88, "end": 2289.92, "text": "das damit verknüpft ist, musst du alle 7 Tage neu sideloaden oder wie ist das nochmal?"}, {"id": 277, "start": 2289.92, "end": 2295.28, "text": "Also Apple macht es einem echt schwer. Apple macht es einem wirklich schwer mit seinem"}, {"id": 278, "start": 2295.28, "end": 2299.68, "text": "eigenen Gerät das machen zu können, was man will. Wobei, was als eigenes Gerät? Ich hab"}, {"id": 279, "start": 2299.68, "end": 2303.88, "text": "das Ding ja immer noch von der Firma gesponsert bekommen. Also da will ich mich mal gar nicht"}, {"id": 280, "start": 2303.88, "end": 2310.64, "text": "beschweren. Jetzt ist mal wieder der Zeitpunkt zu erwähnen, weil der Chat das immer so besonders"}, {"id": 281, "start": 2310.64, "end": 2320.12, "text": "gerne hört. Es gibt außer Safari keine weiteren Browser auf IOS. Chrome und Firefox existieren"}, {"id": 282, "start": 2320.12, "end": 2328.56, "text": "nicht auf IOS, so wie man denkt. Ja, genau, nur Browser. Oh, heute sind Big Brain Leute"}, {"id": 283, "start": 2328.56, "end": 2339.68, "text": "am Start. Heute diskutiert keiner. Nein, bei Mac OS ist das nicht so. Bei Mac OS kannst"}, {"id": 284, "start": 2339.68, "end": 2347.48, "text": "du noch normale Browser installieren. Aber unter IOS geht das nicht. Wenn du Chrome und"}, {"id": 285, "start": 2347.48, "end": 2353.74, "text": "Firefox installierst, unter IOS ist das ein Reskin für Safari. Weil Apple sagt, ihr dürft"}, {"id": 286, "start": 2353.74, "end": 2361.52, "text": "keine Browser anbieten für unsere Plattform, die nicht im Kern Safari verwenden. Und das"}, {"id": 287, "start": 2361.52, "end": 2367.88, "text": "wäre ja auch gar nicht so schlimm, wenn Safari nicht so scheiße wäre mit den aktuellen Sachen."}, {"id": 288, "start": 2367.88, "end": 2373.72, "text": "Keine Web-Notifications, keine gescheite PWA-Unterstützung, Web-RTC-Zeug, was nicht richtig funktioniert."}, {"id": 289, "start": 2373.72, "end": 2386.16, "text": "Safari ist Paints-Champ. Auf dem Desktop nicht ganz so sehr, aber auf IOS richtiger Paints-Champ."}, {"id": 290, "start": 2386.16, "end": 2392.96, "text": "Deswegen funktioniert ja auch der Preis-Champ unter Safari nicht komplett. Web-Notifications,"}, {"id": 291, "start": 2392.96, "end": 2400.04, "text": "guck mal, Web-Notifications funktionieren unter Android hier wunderbar. Unter IOS kannst"}, {"id": 292, "start": 2400.04, "end": 2404.48, "text": "es vergessen, unter IOS kannst du dich nicht vom Preis-Champ benachrichtigen lassen. Und"}, {"id": 293, "start": 2404.48, "end": 2408.04, "text": "Web-Notifications kannst du ja einfach ausschalten oder nur für bestimmte Seiten erlauben, das"}, {"id": 294, "start": 2408.04, "end": 2413.04, "text": "ist ja nicht das Problem. Also man kann es ja nicht, nur weil manche Sachen nerven, wenn"}, {"id": 295, "start": 2413.04, "end": 2420.48, "text": "man sie blöd einstellt, kann man ja nicht sagen, es ist komplett sinnlos. Doch der Preis-Champ"}, {"id": 296, "start": 2420.48, "end": 2435.64, "text": "ist outdated. Ich habe aber keinen Bock mehr am Preis-Champ was zu machen. Du machst, nee,"}, {"id": 297, "start": 2435.64, "end": 2441.24, "text": "nee, nee, nee, nee, nicht alles. Nicht alles. Ich habe ein paar Raspberry Pi Zeroes, ich"}, {"id": 298, "start": 2441.24, "end": 2445.36, "text": "habe ein paar Raspberry Pis und ich habe ein paar ESP32. Ich habe bestimmt auch noch den"}, {"id": 299, "start": 2445.36, "end": 2462.0, "text": "einen oder anderen ESP62 irgendwo. Einen Arduino habe ich aber nirgendwo. Meinung zu System"}, {"id": 300, "start": 2462.0, "end": 2468.32, "text": "D. Ist es jetzt die nächste Triggerfrage zu sowie als Nachfolger von Meinung zu C++? Ganz"}, {"id": 301, "start": 2468.32, "end": 2475.2, "text": "ehrlich, ich habe nichts gegen System D. Ein paar Dinger finde ich umständlich. Ich bin"}, {"id": 302, "start": 2475.2, "end": 2481.8, "text": "zum Beispiel kein großartiger Fan Unit-Files versus normale Startup-Skripts. Da konnte man"}, {"id": 303, "start": 2481.8, "end": 2491.68, "text": "immer noch ein paar ekliche Dinger drin machen, wenn sie mal notwendig waren. Dann hast du"}, {"id": 304, "start": 2491.68, "end": 2498.88, "text": "noch nervige Sachen, dass du... Ich hatte letztens ein Problem mit System D. Kann mich"}, {"id": 305, "start": 2498.88, "end": 2502.56, "text": "aber nicht mal richtig dran erinnern, was war denn das? Ich wollte irgendwas neu starten"}, {"id": 306, "start": 2502.56, "end": 2509.36, "text": "lassen, weil es hängt. Genau, System D kann keine Health-Checks. Das hat mich letztens"}, {"id": 307, "start": 2509.36, "end": 2517.44, "text": "genervt. Also du kannst mit System D keine Health-Checks machen, um zu gucken, zum Beispiel"}, {"id": 308, "start": 2517.44, "end": 2520.92, "text": "ob ein Service noch richtig läuft und ihn da neu starten lassen. Klar, man könnte jetzt"}, {"id": 309, "start": 2520.92, "end": 2524.52, "text": "sagen, das ist nicht die Aufgabe von System D, aber System D macht so ziemlich alles,"}, {"id": 310, "start": 2524.52, "end": 2528.6, "text": "was nicht eigentlich die Aufgabe von einem Init-System ist. Warum sollte System D nicht"}, {"id": 311, "start": 2528.6, "end": 2533.76, "text": "einen Health-Check haben? Du kannst es nur sehr umständlich machen und manche Sachen"}, {"id": 312, "start": 2533.76, "end": 2539.84, "text": "gehen gar nicht. So ein Health-Check wäre tatsächlich ganz praktisch. Wenn du zum Beispiel"}, {"id": 313, "start": 2539.84, "end": 2546.56, "text": "Web-Anwendungen hast, die ganz gerne mal hängen bleiben und man System D einfach keine Ahnung"}, {"id": 314, "start": 2546.56, "end": 2550.76, "text": "einen Curl machen lassen könnte, einmal die Minute und wenn es fehlt schlägt, fünfmal"}, {"id": 315, "start": 2550.76, "end": 2555.04, "text": "in Folge neu starten. Die Anwendung wäre ganz praktisch. Komplett daran das andere Thema"}, {"id": 316, "start": 2555.04, "end": 2557.88, "text": "hast du eine bessere Ahnung wie Dual-Boot Windows 11, dann funktioniert, wenn ihr ein"}, {"id": 317, "start": 2557.88, "end": 2567.36, "text": "Secure-Boot benutzen musst. Das geht doch bestimmt auszuhebeln, oder? Also manche Distributionen,"}, {"id": 318, "start": 2567.36, "end": 2578.52, "text": "also ich weiß, dass Ubuntu sich mal, also Canonical hat mal dran gearbeitet, dass sie"}, {"id": 319, "start": 2578.52, "end": 2582.64, "text": "Ubuntu gebootet bekommen mit Secure-Boot. Ich weiß nicht, wie da der aktuelle Stand"}, {"id": 320, "start": 2582.64, "end": 2610.08, "text": "ist, Linux Secure-Boot. Also ich denke mal, man bekommt das zum Laufen. Ich denke man"}, {"id": 321, "start": 2610.08, "end": 2616.4, "text": "bekommt das zum Laufen. Aber wisst ihr, was man machen könnte? Ich bin mal gespannt,"}, {"id": 322, "start": 2616.4, "end": 2621.32, "text": "ob das funktioniert. Man könnte einfach sagen, scheiß auf den Windows-Bootloader und lässt"}, {"id": 323, "start": 2621.32, "end": 2627.4, "text": "Krabb Windows starten, falls das funktioniert. Da gibt es, ich wette mit euch Leute, diese"}, {"id": 324, "start": 2627.4, "end": 2632.28, "text": "Ankündigung, die es da jetzt gibt, die meisten Sachen werden wahrscheinlich mit ein paar"}, {"id": 325, "start": 2632.28, "end": 2639.88, "text": "Patches oder Registry-Einträgen wieder zu deaktivieren sein. Gut, Registry im Bootmanager"}, {"id": 326, "start": 2639.88, "end": 2647.48, "text": "gebe ich zu, war jetzt vielleicht ein dummer Vergleich, aber das wird alles, mal gucken."}, {"id": 327, "start": 2647.48, "end": 2652.32, "text": "Ihr wisst doch, wir sind nicht so heiß gegessen, wie es gekocht wird. Oh, da kommen die richtigen"}, {"id": 328, "start": 2652.32, "end": 2658.56, "text": "Paint-Champ-Sprüche laufen, oder? Vorher hatte schon Amazon heiße Eisen im Feuer, aber"}, {"id": 329, "start": 2658.56, "end": 2678.4, "text": "ich glaube, das wird nicht so wild, wie es jetzt aktuell aussieht. Nice. Also wie gesagt,"}, {"id": 330, "start": 2678.4, "end": 2688.68, "text": "ich glaube nicht, wir warten, wir müssen es mal abwarten. Das kann durchaus sein, dass"}, {"id": 331, "start": 2688.68, "end": 2693.92, "text": "die sagen, ok, jetzt wo Windows 10 nicht mehr supportet, dass die Leute umschwenken müssen,"}, {"id": 332, "start": 2693.92, "end": 2699.6, "text": "dann forcieren wir irgendwelche Sachen. Ich bin ja der erste, der sagen würde, er verwendet"}, {"id": 333, "start": 2699.6, "end": 2707.96, "text": "kein Windows mehr, wenn es gehen würde. Wie gesagt, es gibt halt immer noch genug Dinger,"}, {"id": 334, "start": 2707.96, "end": 2713.96, "text": "da komme ich an Windows nicht vorbei. So, mein Vegas-Stells funktioniert glaube ich"}, {"id": 335, "start": 2713.96, "end": 2721.8, "text": "unter, da muss ich mal kurz gucken, WineDB, lass mal kurz gucken, ne, wie ist das, ProtonDB,"}, {"id": 336, "start": 2721.8, "end": 2725.12, "text": "da stehen glaube ich nur Games drin, mal gucken, ob Vegas mittlerweile, wahrscheinlich nicht,"}, {"id": 337, "start": 2725.12, "end": 2728.64, "text": "ich würde Vegas aber im Leben auch nicht über Wine verwenden, weil es immer mehr Probleme"}, {"id": 338, "start": 2728.64, "end": 2743.28, "text": "gibt. New Vegas, alles gut, Vegas Pro, Vegas Pro 13, zeig mal her. Läuft, Test Results,"}, {"id": 339, "start": 2743.28, "end": 2753.28, "text": "Installer works good, na super, da bin ich ja beruhigt, dass der Installer funktioniert."}, {"id": 340, "start": 2753.28, "end": 2760.68, "text": "Windows does not work, just not run, wunderbar, perfekt. Garbage, latest rating Garbage,"}, {"id": 341, "start": 2760.68, "end": 2765.44, "text": "ok, schauen wir mal wieder vorbei. Das ist übrigens auch das, was die ganzen Leute vergessen,"}, {"id": 342, "start": 2765.44, "end": 2768.92, "text": "die hier immer nur die Spiele anführen, es gibt ja noch viele andere Windows Anwendungen,"}, {"id": 343, "start": 2768.92, "end": 2777.24, "text": "auch bei Spielen ist das Ganze nicht so rosig, wie das immer hingestellt wird. Ich finde"}, {"id": 344, "start": 2777.24, "end": 2782.12, "text": "es immer lustig, dass Linux-Fans dann mit mir als Linux-Fan drüber diskutieren, aber"}, {"id": 345, "start": 2782.12, "end": 2786.12, "text": "es gibt doch ein paar Sachen, die sind gerade mit solchen Datenbanken relativ offensichtlich"}, {"id": 346, "start": 2786.12, "end": 2792.96, "text": "zu widerlegen, dass es eben nicht alles rosig ist. So, also da tut sich nichts hier, Gold,"}, {"id": 347, "start": 2792.96, "end": 2802.36, "text": "Vegas Pro 11 ist Gold, alles andere ist, Version 5, na super, also vergesst. Wie läuft, wie"}, {"id": 348, "start": 2802.36, "end": 2807.4, "text": "ist denn Affinity, warte mal, da muss ich mal kurz gucken, Affinity Designer, wie läuft"}, {"id": 349, "start": 2807.4, "end": 2834.56, "text": "das, Affinity Photo, Affinity Designer, Garbage, das funktioniert ja wunderbar, ja, gut, wunderbar,"}, {"id": 350, "start": 2834.56, "end": 2841.28, "text": "also alle meine, also zwei der Programme, die ich mit am häufigsten verwende, laufen Garbage"}, {"id": 351, "start": 2841.28, "end": 2848.96, "text": "einfach mal. Ich sag nicht, dass ich Photoshop brauche, ich bin zu dumm für Photoshop, das"}, {"id": 352, "start": 2848.96, "end": 2853.68, "text": "einzige Modell, mit dem ich klar komme, ist Affinity Designer, das ist für so Kacknoobs"}, {"id": 353, "start": 2853.68, "end": 2858.96, "text": "wie mich wunderbar, wenn man ein bisschen YouTube Thumbnails machen will, Affinity Designer,"}, {"id": 354, "start": 2858.96, "end": 2869.52, "text": "damit komme ich klar, ne, das ist Mist, gerade so was ist in der VM Mist, gehen tut das bestimmt,"}, {"id": 355, "start": 2869.52, "end": 2874.72, "text": "aber das ist hakeliger, als es sein muss, ich will ja meinen Workflow nicht total zerstören,"}, {"id": 356, "start": 2874.72, "end": 2883.16, "text": "ne, das hat keinen Sinn, auch Pass Thru ist mehr Pains Champ, als man möchte eigentlich,"}, {"id": 357, "start": 2883.16, "end": 2891.6, "text": "ne, vergessen, können wir vergessen, nächstes Jahr ist das Jahr des Linux, ich dachte dieses"}, {"id": 358, "start": 2891.6, "end": 2897.88, "text": "Jahr war schon, oder besser gesagt, 2000, war nicht sogar 2010 das Jahr des Linux Desktop's,"}, {"id": 359, "start": 2897.88, "end": 2906.08, "text": "ich glaube schon, so als Compiz auf, Leute, ich hab früher unter Ubuntu gedacht, Compiz ist der"}, {"id": 360, "start": 2906.08, "end": 2912.72, "text": "Shit, der Linux auf dem Desktop zum Durchbruch verhelfen wird und das war auch mega geil Compiz,"}, {"id": 361, "start": 2912.72, "end": 2920.96, "text": "die Würfel, Wobbly Windows und alles, leider gibt es das nicht mehr, die versuchen jetzt irgendwie,"}, {"id": 362, "start": 2920.96, "end": 2927.12, "text": "die ganze Linux Distribution versuchen, Desktop Linux Zeug so nach Mac aussehen zu lassen,"}, {"id": 363, "start": 2927.12, "end": 2937.4, "text": "die sollen lieber Effekt Overload Compiz-Stalls machen, wie geiler, ja ich weiß, vieles,"}, {"id": 364, "start": 2937.4, "end": 2943.48, "text": "vieles kannst du zusätzlich noch machen, aber Compiz war das beste, da sind Fenster abgefackelt"}, {"id": 365, "start": 2943.48, "end": 2951.92, "text": "beim zumachen und so, nicht beste, Videos nur noch mit FFmpeg bearbeiten, ja FFmpeg kann zwar viel,"}, {"id": 366, "start": 2951.92, "end": 2959.64, "text": "ich weiß, dass das eine Kappa HD Message ist, aber FFmpeg kann viel, aber du kannst mit FFmpeg halt"}, {"id": 367, "start": 2959.64, "end": 2967.6, "text": "nicht ernsthaft Videos bearbeiten, nee, nee, achso, ja, es ist immer noch kaputt, ich hab"}, {"id": 368, "start": 2967.6, "end": 2972.12, "text": "immer noch nicht ausgetauscht oder dran rumgewackelt, weil aktuell ist Sommer und ich brauch das außer"}, {"id": 369, "start": 2972.12, "end": 2980.16, "text": "das warme Wasser eh nicht, Moment, das mach ich jetzt nicht auf, wo gibt es die Spezial-Effekte"}, {"id": 370, "start": 2980.16, "end": 2998.88, "text": "noch, zeig mal her, ja, genau, genau, diese Dinger, Compiz-Stalls, beste, so muss das sein,"}, {"id": 371, "start": 2998.88, "end": 3003.48, "text": "Wobbly-Windows, wir sehen du kriegst das bestimmt in der VM so ein schlechtes Performance wie das"}, {"id": 372, "start": 3003.48, "end": 3014.12, "text": "hat, Wobbly-Windows, jawoll, ja Moment, Videos automatisch schneiden ist das eine, aber Videos"}, {"id": 373, "start": 3014.12, "end": 3021.36, "text": "bearbeiten, ja, also Overlays machen, Subscribed-Messages einfügen, das machst du mit FFmpeg nicht,"}, {"id": 374, "start": 3021.36, "end": 3033.6, "text": "Überblend-Effekte an der richtigen Stelle und nee, nee, nee, nee, und welche Videos sollen"}, {"id": 375, "start": 3033.6, "end": 3041.48, "text": "dort überhaupt automatisch geschnitten werden, ich glaube KDE hat da teilweise die Sachen von"}, {"id": 376, "start": 3041.48, "end": 3046.48, "text": "Compiz übernommen, aber nicht alles, du musst dir mal die KDE, ich hab jetzt nix wo wir das"}, {"id": 377, "start": 3046.48, "end": 3050.04, "text": "vergleichen können, aber guck mal in die KDE-Settings rein, dann guck dir mal in alten"}, {"id": 378, "start": 3050.04, "end": 3060.56, "text": "Screenshots von Ubuntu, von dem alten Compiz-Manager an, wir sehen du konntest hier grade so übertrieben"}, {"id": 379, "start": 3060.56, "end": 3064.48, "text": "viel Schwachsinn einstellen, das geht in KDE nicht mehr, die haben ein paar Sachen daraus"}, {"id": 380, "start": 3064.48, "end": 3080.68, "text": "genommen, ja, so aufzeige ich mal ein paar Effekte, genau, Compiz-Stells, auf gehts,"}, {"id": 381, "start": 3080.68, "end": 3085.44, "text": "da ist der ganze Kram, genau, das kannst du in KDE nicht alles machen, du hattest so viel"}, {"id": 382, "start": 3085.44, "end": 3093.48, "text": "abgedrehtes Zeug, Wobbly-Windows, der wichtigste Effekt überhaupt natürlich, ja genau das,"}, {"id": 383, "start": 3093.48, "end": 3102.92, "text": "der Würfel und so, beste, beste, ja, das geht glaube ich mit KDE auch noch mit dem Würfel,"}, {"id": 384, "start": 3102.92, "end": 3116.32, "text": "CAC 4D, guck, ja so muss das sein, und dann auch random einstellen, dann auch random"}, {"id": 385, "start": 3116.32, "end": 3121.72, "text": "einstellen, dass du das jedes Mal, wenn du das Fenster auf und zu machst, einen anderen"}, {"id": 386, "start": 3121.72, "end": 3140.12, "text": "randomized Effekt nimmst, beste, ja so muss das sein, leider gibt es, es gibt einen Compiz-Fork,"}, {"id": 387, "start": 3140.12, "end": 3144.64, "text": "aber der so wirklich aktiv entwickelt wird der auch nicht, es ist auf jeden Fall das"}, {"id": 388, "start": 3144.64, "end": 3157.6, "text": "beste gewesen, exzellent, dann 24 Monate Alper-Subscription hier, oder bei den, achso, bei den, bei den,"}, {"id": 389, "start": 3157.6, "end": 3168.0, "text": "bei was bist du in Führung, bei den gegifteten Subs, Massive, jetzt schauen, im Dashboard"}, {"id": 390, "start": 3168.0, "end": 3175.68, "text": "können wir ein paar Leute übersehen heute, Mario XCB, Dankeschön, für den Sub hab ich"}, {"id": 391, "start": 3175.68, "end": 3184.64, "text": "nicht gesehen, der Spack-Hack auch am Start, Korni14, auch subscripted, subscripted, alter,"}, {"id": 392, "start": 3184.64, "end": 3193.04, "text": "subs, das fällt mir neu, irgendjemand hatte mal in einem Vortrag, da musste ich, da musste"}, {"id": 393, "start": 3193.04, "end": 3198.24, "text": "ich real life, real life kecken, das weiß ich noch, hat in irgendeinem Vortrag, wollte"}, {"id": 394, "start": 3198.24, "end": 3204.32, "text": "der Subscriber sagen und hat gemerkt, es ist ein deutscher Vortrag und hat dann gesagt,"}, {"id": 395, "start": 3204.32, "end": 3209.36, "text": "subscribieren, und da hab ich schon so innerlich, wahrscheinlich nicht nur innerlich, aber den"}, {"id": 396, "start": 3209.36, "end": 3218.2, "text": "hier gemacht, ja, subscribieren, alter, also das ist vielleicht ein gültiges Wort, keine"}, {"id": 397, "start": 3218.2, "end": 3224.08, "text": "Ahnung, aber auf jeden Fall nichts, was man normalerweise verwendet, subscribieren, alles"}, {"id": 398, "start": 3224.08, "end": 3233.32, "text": "klar, ja, achja, ich wollte mir mit euch das Developer-Surfer mal in Ruhe angucken von,"}, {"id": 399, "start": 3233.32, "end": 3239.08, "text": "von Jetplains, genau, also was mich überrascht hat, ist folgendes, das hab ich euch, glaub"}, {"id": 400, "start": 3239.08, "end": 3242.84, "text": "ich, das letzte Mal schon kurz gezeigt, ich mach mal kurz den Dark Mode raus, Achtung,"}, {"id": 401, "start": 3242.84, "end": 3248.44, "text": "Flashbang, bam, mach mal kurz den Dark Mode rein, nee, nee, ich mach den Dark Mode rein,"}, {"id": 402, "start": 3248.44, "end": 3254.56, "text": "das hältst du nicht aus, aber du erkennst es nicht richtig, egal, was ich euch zeigen"}, {"id": 403, "start": 3254.56, "end": 3261.8, "text": "wollte, erkennste, was ich sehr spannend fand, hier drinnen ist das hier, Operating System,"}, {"id": 404, "start": 3261.8, "end": 3269.08, "text": "auf den entwickelt wird, 61% Windows, wundert mich nicht, ich mein, das ist garantiert multiple,"}, {"id": 405, "start": 3269.08, "end": 3274.84, "text": "also du konntest garantiert mehrere selekten, sonst kommst du ja nicht über 100%, aber"}, {"id": 406, "start": 3274.84, "end": 3283.28, "text": "trotzdem, man sieht, dass Windows für technische Sachen einfach kacke ist und die 61% die Windows"}, {"id": 407, "start": 3283.28, "end": 3289.2, "text": "verwenden, die machen das wahrscheinlich auch zumindest 30% davon, gar nicht freiwillig,"}, {"id": 408, "start": 3289.2, "end": 3293.84, "text": "sondern weil ihr Chef der Meinung ist, er arbeitet auch mit Windows, das heißt die Programmierer"}, {"id": 409, "start": 3293.84, "end": 3299.44, "text": "sollen gefälligst auch mit Windows arbeiten, kennt ihr so Leute, die sagen also nach dem"}, {"id": 410, "start": 3299.44, "end": 3304.8, "text": "Motto, also, äh, wenn ich das verwende, dann könnt ihr das auch verwenden, ich hatte damit"}, {"id": 411, "start": 3304.8, "end": 3309.12, "text": "noch nie Probleme, das ist doch für euch bestimmt und ihr seid ja Techniker, ihr habt damit doch"}, {"id": 412, "start": 3309.12, "end": 3320.08, "text": "bestimmt noch weniger Probleme, das sind dann die richtig, richtig 3-Hat Aussagen, bei uns"}, {"id": 413, "start": 3320.08, "end": 3325.8, "text": "ist auch lustig, da wollen sie ja auch mittlerweile immer mal wieder, dass wir Windows Notebooks"}, {"id": 414, "start": 3325.8, "end": 3332.96, "text": "kriegen und ich hab das letzte Mal gefragt, ok, könnt ihr mir Rider installieren und"}, {"id": 415, "start": 3332.96, "end": 3338.08, "text": "es gibt ein offenes Ticket, das ist seit 3 Monaten offen, bei der, wie heißen die bei"}, {"id": 416, "start": 3338.08, "end": 3343.52, "text": "uns eigentlich, bei denen die Softwareverwaltung machen, ich hab gesagt, ich hab ganz viele"}, {"id": 417, "start": 3343.52, "end": 3347.32, "text": "Sachen in C-Sharp, ich brauch eine ordentliche Idee, dass ich da weiter dran programmieren"}, {"id": 418, "start": 3347.32, "end": 3351.68, "text": "kann, ergänzen kann, Bug fixen kann, sonst Neuentwicklung machen kann, installiert mir"}, {"id": 419, "start": 3351.68, "end": 3357.56, "text": "mal Rider und die kriegen das seit 3 Monaten nicht hin, also, das könnte natürlich auch"}, {"id": 420, "start": 3357.56, "end": 3363.32, "text": "an unseren Leuten liegen, ja, was hast du für eine Distribution auf deinem Arbeits-PC,"}, {"id": 421, "start": 3363.32, "end": 3367.68, "text": "ich hab meinen Jaro i3, im Prinzip hab ich auf der Arbeit das hier, was ich hier auch"}, {"id": 422, "start": 3367.68, "end": 3375.12, "text": "hab, sieht auch genauso aus, hab ich auch mal das ASCII-Quarium auf zur Entspannung,"}, {"id": 423, "start": 3375.12, "end": 3380.08, "text": "im Prinzip sieht mein Arbeits-Desktop genauso aus wie hier, ich hab die Konfix ja mal nach"}, {"id": 424, "start": 3380.08, "end": 3383.2, "text": "GitHub gesüngt vor einer Weile, ist nicht top aktuell, aber im Prinzip kommt es noch"}, {"id": 425, "start": 3383.2, "end": 3398.64, "text": "hin, was unter anderem steht, ich glaub, das ist nicht aufgeschlüsselt, naja, das sind"}, {"id": 426, "start": 3398.64, "end": 3405.36, "text": "da wahrscheinlich so Sachen wie Solaris oder sowas, oder, tja, BSD vielleicht, vielleicht"}, {"id": 427, "start": 3405.36, "end": 3416.84, "text": "hat irgendjemand einen BSD, auf dem er entwickelt, warst du nicht Wishlist Studio Code Fan, doch,"}, {"id": 428, "start": 3416.84, "end": 3423.8, "text": "aber man macht nicht alles in Wishlist Studio Code, es gibt Sachen, die sind in anderen"}, {"id": 429, "start": 3423.8, "end": 3428.72, "text": "Sachen besser aufgehoben, du möchtest zum Beispiel kein Java, Kotlin, C-Sharp oder"}, {"id": 430, "start": 3428.72, "end": 3442.44, "text": "sonst was in Wishlist Studio Code programmieren, auch Go ist nicht so schön, wenn man, obei,"}, {"id": 431, "start": 3442.44, "end": 3446.88, "text": "Go, doch, Go ist okay, das stimmt, die haben nämlich den eigentlichen Bug gefixt, den"}, {"id": 432, "start": 3446.88, "end": 3454.28, "text": "ich mal vor jahrelang hatte, dass wenn man nämlich Interop mit C macht, dass dann, also"}, {"id": 433, "start": 3454.28, "end": 3460.96, "text": "wenn du oben diese C-Go Definition reinschreibst, dann ist nach ein paar Minuten das Wishlist"}, {"id": 434, "start": 3460.96, "end": 3465.92, "text": "Studio Go Plugin abgekackt und hat die Auto-Completion immer funktioniert, ich glaub,"}, {"id": 435, "start": 3465.92, "end": 3474.0, "text": "das haben sie gefixt, ja, also C-Sharp in Wishlist Studio Code ist nicht schön, es"}, {"id": 436, "start": 3474.0, "end": 3479.92, "text": "ist brauchbar, weil Microsoft halt ihr Standard-Toolzeug da mitbringt, aber es ist nicht, macht nicht"}, {"id": 437, "start": 3479.92, "end": 3485.44, "text": "viel Spaß, hey, was hältst du vom Framework Laptop, ich weiß nicht, was der Framework"}, {"id": 438, "start": 3485.44, "end": 3494.08, "text": "Laptop ist, ja, aber das finde ich interessant, ich vermute mal, dass das hier BSD ist und"}, {"id": 439, "start": 3494.08, "end": 3505.72, "text": "klar, man kann, man kann verschiedene Betriebssysteme auswählen, frame.work, was hat denn die Domain"}, {"id": 440, "start": 3505.72, "end": 3524.0, "text": "wohl gekostet, Framework Laptop ist now shipping, okay, dünner, leichtes Notebook, was ist"}, {"id": 441, "start": 3524.0, "end": 3537.64, "text": "mit was Bestand haben soll, aha, okay, was macht das jetzt aus, Framework Laptop 99 Dollar"}, {"id": 442, "start": 3537.64, "end": 3542.16, "text": "und das ist vom Preis her absolut in Ordnung, wenn da was Gescheites drin ist, sieht aus"}, {"id": 443, "start": 3542.16, "end": 3557.92, "text": "wie ein Notebook, oben ist eine Kamera oder so und komische Knappen, ah, das ist einer,"}, {"id": 444, "start": 3557.92, "end": 3563.4, "text": "wo man selbst dran rumbasteln kann, warum genau sollte ich am Notebook selbst rumbasteln,"}, {"id": 445, "start": 3563.4, "end": 3566.36, "text": "ist das für den Fall der Fehler, dass er kaputt geht und ich ihn reparieren muss oder"}, {"id": 446, "start": 3566.36, "end": 3578.92, "text": "was ist der Hintergedanke davon, also was ist der, warum sollte ich mir den kaufen, Linux"}, {"id": 447, "start": 3578.92, "end": 3585.72, "text": "Support, okay, naja, gut, das gibt es ja bei vielen, indirekt, weil halt die Hardware,"}, {"id": 448, "start": 3585.72, "end": 3590.44, "text": "die drin ist, unterstützt wird, ich finde es viel interessanter, was der Typ gerade"}, {"id": 449, "start": 3590.44, "end": 3594.16, "text": "Hackerman macht, das muss ich mir angucken, ich brauche das Bilding groß, Leute, Image"}, {"id": 450, "start": 3594.16, "end": 3606.12, "text": "Newtap, was ist das, Struct, ist das C, sieht man in Clue, ja, das ist C, oder es ist C++,"}, {"id": 451, "start": 3606.12, "end": 3632.04, "text": "was ja nach C aussieht, ah ne, guck mal da, C tatsächlich, C und nicht C++, das finde"}, {"id": 452, "start": 3632.04, "end": 3640.08, "text": "ich nicht schlecht, da kannst du dir dann auch überlegen, was du da genau reinmachst,"}, {"id": 453, "start": 3640.08, "end": 3645.8, "text": "ja von der Idee her sicherlich nicht verkehrt, also die Preisfrage ist natürlich, wie schlägt"}, {"id": 454, "start": 3645.8, "end": 3652.64, "text": "sich das preisleistungstechnisch gegen einen normalen Laptop so in der ähnlichen Liga,"}, {"id": 455, "start": 3652.64, "end": 3657.12, "text": "klar, es wird wahrscheinlich ein bisschen teurer sein, aber ist die Frage, wie viel"}, {"id": 456, "start": 3657.12, "end": 3662.2, "text": "teurer, also ich denke mal die meisten Leute sind bereit vielleicht ein Drittel mehr zu"}, {"id": 457, "start": 3662.2, "end": 3676.0, "text": "bezahlen, aber dann ist aber auch die Schmerzgrenze erreicht, ok, wo kann man preordern, also will"}, {"id": 458, "start": 3676.0, "end": 3687.6, "text": "ich nicht ordnen, ich will mal einen zusammenklicken und gucken, was es kostet, ah hier, achso,"}, {"id": 459, "start": 3687.6, "end": 3691.44, "text": "es gibt die Möglichkeit, dass man ihn fertig geliefert bekommt oder die Einzelteile, ok,"}, {"id": 460, "start": 3691.44, "end": 3696.2, "text": "sagen wir mal fertig geliefert, wird nicht nach EU geschippt, das macht nichts, ich will"}, {"id": 461, "start": 3696.2, "end": 3703.8, "text": "nur sehen, was es kostet, Koggers, ey das sieht ein bisschen aus, muss man ihn lassen,"}, {"id": 462, "start": 3703.8, "end": 3711.24, "text": "sieht ein bisschen aus wie im Apple Store, es ist auch basic, BAM, E7, E6, wer kommt"}, {"id": 463, "start": 3711.24, "end": 3718.68, "text": "also 8G Leute, also ich meine damit nicht den Nachfolger von 5G, sondern 8GB, also 8GB"}, {"id": 464, "start": 3718.68, "end": 3728.68, "text": "ist ja outdated, und 256G kommst du ja hinten und vorne nicht hin, aber noch fetter, jawoll,"}, {"id": 465, "start": 3728.68, "end": 3744.24, "text": "kann man gar nicht, kann man gar nicht selecten, achso, aber ok, Linux Support ist tatsächlich"}, {"id": 466, "start": 3744.24, "end": 3749.88, "text": "ein Vorteil, obwohl es jetzt hier der Vorteil gegenüber, sagen wir, ich gehe in den Online"}, {"id": 467, "start": 3749.88, "end": 3754.72, "text": "Shop und order mir das Teil, das habe ich nicht so genau verstanden, es ist einfacher"}, {"id": 468, "start": 3754.72, "end": 3770.96, "text": "zu reparieren auf jeden Fall, ja aber, du kannst bis zu 6 SSDs nachrüsten, alter, ok"}, {"id": 469, "start": 3770.96, "end": 3793.12, "text": "gehen wir mal zu, hallo, do it yourself Edition, ich glaube, ich habe die Website kaputt gemacht,"}, {"id": 470, "start": 3793.12, "end": 3800.64, "text": "ja, guck mal, das ist eine Single Page Application, die den Zurückknopf im Browser nicht richtig"}, {"id": 471, "start": 3800.64, "end": 3809.52, "text": "handelt, direkt geprickt, also was kann man hier auswählen, ok, CPU, das reicht mir ehrlich"}, {"id": 472, "start": 3809.52, "end": 3824.2, "text": "gesagt, der kleine, 46G, BAM, also, oh, da haben wir irgendwas, WiFi, non pro, pro, ich"}, {"id": 473, "start": 3824.2, "end": 3828.2, "text": "weiß nicht, was der Unterschied ist, bring your own, wie das geht nicht, doch man, das"}, {"id": 474, "start": 3828.2, "end": 3839.32, "text": "ist noch beschäftigt, das ist jetzt so schnell, bring your own, storage, ne, ne, ne, ne, ne,"}, {"id": 475, "start": 3839.32, "end": 3852.92, "text": "Terabyte reicht, aber Terabyte sollte schon sein, ich finde das eigentlich, das, das"}, {"id": 476, "start": 3852.92, "end": 3861.6, "text": "macht, was soll das sagen, ah, das ist Kaution, ne, nicht Kaution, wie nennt man das so, sodass"}, {"id": 477, "start": 3861.6, "end": 3871.04, "text": "nicht die Leute sinnlos vorbestellen, die gar nicht wollen, der Chat ist vor dem Preis,"}, {"id": 478, "start": 3871.04, "end": 3880.04, "text": "also, hier Chat, so Anzahlung, ja, scheint mir ganz in Ordnung zu sein, man muss es"}, {"id": 479, "start": 3880.04, "end": 3887.96, "text": "halt selbst zusammenbauen, ne, ich bin mal gespannt, was da rauskommt, es gab ja schon"}, {"id": 480, "start": 3887.96, "end": 3894.88, "text": "ein paar Versuche, so modulare Smartphones und sonst was zu machen, hat alles nicht so"}, {"id": 481, "start": 3894.88, "end": 3909.48, "text": "gut funktioniert, mal gucken, ob es damit was wird, genau, Anzahlung meine ich, ja,"}, {"id": 482, "start": 3909.48, "end": 3918.4, "text": "nicht Kaution, Kaution ist das, wenn man Monkathos war und in Knast muss und dann temporär wieder"}, {"id": 483, "start": 3918.4, "end": 3930.84, "text": "raus darf, jetzt, jetzt, zeig mir Twitch den Fallout Channel, ja, was soll ich sagen,"}, {"id": 484, "start": 3930.84, "end": 3935.64, "text": "ich bin auch dafür, dass Twitch den Channel mir empfiehlt, ihr sollt mal Twitch anschreiben"}, {"id": 485, "start": 3935.64, "end": 3942.04, "text": "und sagen, jetzt hört mal auf, irgendwie Indie Fox und, wobei, ne, sorry, Indie Fox"}, {"id": 486, "start": 3942.04, "end": 3951.12, "text": "ist ja gebannt, ihr sollt lieber anstatt Poolgrills meinen Stream empfehlen, bin ich"}, {"id": 487, "start": 3951.12, "end": 3965.64, "text": "auch dafür, können wir machen, ja, finde ich nicht schlecht, macht eigentlich, macht"}, {"id": 488, "start": 3965.64, "end": 3983.44, "text": "eigentlich ganz guten Eindruck, das Teil, Max, Max im HotTube, ja, irgendwann vielleicht,"}, {"id": 489, "start": 3983.44, "end": 3988.44, "text": "irgendwann HotTube Stream, nach Face Reveal und ihr wisst ja, Face Reveal gibt es bald"}, {"id": 490, "start": 3988.44, "end": 3995.92, "text": "bei einer Million Abos, auf YouTube, oder auf Twitch ist mir eigentlich egal, eine Million"}, {"id": 491, "start": 3995.92, "end": 4007.08, "text": "Abos, wird es eh nicht geben, insofern, easy, Face Reveal war doch schon, noch nie, noch"}, {"id": 492, "start": 4007.08, "end": 4015.0, "text": "nie, wo ich gesagt hab, Face Reveal, ich wurde schon zufällig ab und zu mal Revealed, ja,"}, {"id": 493, "start": 4015.0, "end": 4021.8, "text": "aber noch nie, wo ich gesagt hab, Face Reveal, ist der, ist der on, ist der on, nein, ist"}, {"id": 494, "start": 4021.8, "end": 4041.48, "text": "nicht on, eines der alten Unbox, da auch, da auch, jetzt gibt es so viele Sachen, wo"}, {"id": 495, "start": 4041.48, "end": 4053.56, "text": "ich schon mal Revealed wurde, auf irgendwelche Events, wo ich mal durchs Bild gelaufen bin,"}, {"id": 496, "start": 4053.56, "end": 4063.76, "text": "wo es keiner gecheckt hat, dann Unboxing Videos, alles mögliche, so, also genau, das wollte"}, {"id": 497, "start": 4063.76, "end": 4071.0, "text": "ich mir jetzt ja mal mit euch angucken, also JetBrains hat eine Umfrage gemacht, äh, unter"}, {"id": 498, "start": 4071.0, "end": 4079.0, "text": "31.743 Developers, Developers, Developers, welcher Streamer seht ihr ähnlich, da gibt"}, {"id": 499, "start": 4079.0, "end": 4088.92, "text": "es eine ganz klare Antwort, wenn ich das Emote finde, Dance Gaming, also ich muss sagen,"}, {"id": 500, "start": 4088.92, "end": 4093.36, "text": "also wenn ich mir Dance Gaming so angucke und mich so angucke, da ist, das sieht sich"}, {"id": 501, "start": 4093.36, "end": 4111.92, "text": "doch schon ziemlich ähnlich, ja, ich, er hat in letzter Zeit ja auch deutlich weniger"}, {"id": 502, "start": 4111.92, "end": 4115.04, "text": "Haare bekommen, also ich würde sagen, ich hab sogar noch ein bisschen mehr Haare als"}, {"id": 503, "start": 4115.04, "end": 4125.36, "text": "Dance Gaming, aber ansonsten finde ich, äh, und vom Bart her muss ich sagen, sieht auch"}, {"id": 504, "start": 4125.36, "end": 4135.64, "text": "dieses Total Biscuit Bild mir relativ ähnlich, das könnte, also, wenn ich nicht wüsste,"}, {"id": 505, "start": 4135.64, "end": 4142.2, "text": "dass es Total Biscuit ist, könnte, könnte das auch, könnte ich das auch, wenn die Auflösung"}, {"id": 506, "start": 4142.2, "end": 4157.08, "text": "schlechter wäre, könnte ich das auch sein. So, also, was wollte ich jetzt sagen, genau,"}, {"id": 507, "start": 4157.08, "end": 4162.0, "text": "sie haben eine Umfrage gemacht unter ungefähr 32.000 Developer, äh, gut, Countries ist jetzt,"}, {"id": 508, "start": 4162.0, "end": 4165.92, "text": "ist jetzt wurscht, sind ein paar Sachen drin, die ich echt ganz interessant fahre, das wundert"}, {"id": 509, "start": 4165.92, "end": 4171.56, "text": "uns glaube ich alle nicht, dass JavaScript die beliebteste Sprache ist, oder wundert"}, {"id": 510, "start": 4171.56, "end": 4175.76, "text": "uns irgendjemand, sagt irgendjemand, ah, ich hätte eher Cobol erwartet anstatt JavaScript,"}, {"id": 511, "start": 4175.76, "end": 4180.96, "text": "ich glaube sagt keiner, also ja, das war, es war klar, äh, JavaScript ist die beliebteste"}, {"id": 512, "start": 4180.96, "end": 4185.28, "text": "Sprache gefolgt, vermute ich mal von Python, weil das ist auch beides saubermäßig beliebt."}, {"id": 513, "start": 4185.28, "end": 4200.72, "text": "Das stimmt, ja, die meist, die meist benutzte. Achso, die meisten Leute gezwungen sind."}, {"id": 514, "start": 4200.72, "end": 4212.0, "text": "So, äh, Python ist more popular als, als Java, oder Java, wir müssen das ja mal Jira, Java,"}, {"id": 515, "start": 4212.0, "end": 4217.48, "text": "muss das ja cool aussprechen, ich hab vorhin auch wieder John Ubuntu nicht richtig ausgesprochen,"}, {"id": 516, "start": 4217.48, "end": 4232.48, "text": "ich meine natürlich Jubantu, so, ähm, okay, Top 5 Languages sind, ah ne, die 5 Top Sprachen,"}, {"id": 517, "start": 4232.48, "end": 4239.16, "text": "wo Leute gerne ihre Software hin, äh, umprogrammieren würden, also Sprache, wenn sie Sprache wechseln"}, {"id": 518, "start": 4239.16, "end": 4243.92, "text": "würden, das ist Go, Kotlin, TypeScript, Python und Rust, gut, Kotlin kann ich verstehen,"}, {"id": 519, "start": 4243.92, "end": 4247.68, "text": "man macht freiwillig schon was in Java, Java ist halt einfach Paints Champ, wenn ich irgendwas"}, {"id": 520, "start": 4247.68, "end": 4251.24, "text": "in, auf JVM Basis machen müsste, würde ich das auch auf jeden Fall in Kotlin machen,"}, {"id": 521, "start": 4251.24, "end": 4257.56, "text": "das einzige, was ich bisher jemals auf JVM gemacht hab, ist, äh, Groovy, aber auch nicht"}, {"id": 522, "start": 4257.56, "end": 4262.04, "text": "viel, TypeScript kann ich auch verstehen, Python kann ich auch verstehen, Rust ist ne"}, {"id": 523, "start": 4262.04, "end": 4266.6, "text": "typische Sprache, wo jeder sagt, er würde gerne auf Rust umziehen und wenn er dann anfängt"}, {"id": 524, "start": 4266.6, "end": 4271.16, "text": "auf Rust umzuziehen, äh, umzuziehen, dann denkt er sich dann, ich bin zu dumm für Rust"}, {"id": 525, "start": 4271.16, "end": 4277.52, "text": "und bleib bei der anderen Sprache, macht keiner, genau, das ist so, Wunsch zur Realität ist"}, {"id": 526, "start": 4277.52, "end": 4285.6, "text": "Rust und Go hat auch so seine Dinger, wo viele glaub ich, weiß nicht, äh, zu blauigisch"}, {"id": 527, "start": 4285.6, "end": 4290.4, "text": "rangehen, also Go hat auch Eigenheiten, die, mal gucken wir mal, ob es Generics in Go gibt,"}, {"id": 528, "start": 4290.4, "end": 4299.92, "text": "dann wird einiges besser, hoffe ich mal, ja, es sind einige Sachen merkwürdig in Go, also"}, {"id": 529, "start": 4299.92, "end": 4307.2, "text": "wie gesagt, der fehlende Generic Support ist doof, äh, dann diese, diese, wie soll ich"}, {"id": 530, "start": 4307.2, "end": 4310.48, "text": "das beschreiben, so diese Sache mit Error Handling, dass du es eigentlich mit Return"}, {"id": 531, "start": 4310.48, "end": 4318.88, "text": "Code machst, aber dann doch sowas wie Try Catch mit Panic hast, ähm, dass es ganz furchtbar"}, {"id": 532, "start": 4318.88, "end": 4324.68, "text": "eklig ist zu checken, also syntaktisch eklig, ob ein Key in einem Dictionary drin ist in"}, {"id": 533, "start": 4324.68, "end": 4330.08, "text": "Go, oder ich, vielleicht finde ich ihn auch nur ich hässlich, und eine persönliche Sache,"}, {"id": 534, "start": 4330.08, "end": 4349.48, "text": "die ich nicht mag an Go, ist, dass Go der Meinung ist, dass Go der Meinung ist, sowas"}, {"id": 535, "start": 4349.48, "end": 4360.24, "text": "machen zu müssen, wer hat sich das ausgedacht, das ist nicht Phifat, das ist einfach nur"}, {"id": 536, "start": 4360.24, "end": 4373.52, "text": "Woodface, ich weiß viele mögen das, viele mögen das, ich mag das nicht, für mich,"}, {"id": 537, "start": 4373.52, "end": 4380.72, "text": "also das könnte ich mir noch gefallen lassen, das, das, das meinetwegen, meinetwegen so,"}, {"id": 538, "start": 4380.72, "end": 4392.76, "text": "aber ich persönlich bevorzuge ja den hier, aber ich bin auch jemand, der mag 2 Spaces"}, {"id": 539, "start": 4392.76, "end": 4405.16, "text": "als Einrückung anstatt 4, Leute was sagt ihr, 4 Spaces oder 2 Spaces? Keine Spaces,"}, {"id": 540, "start": 4405.16, "end": 4415.68, "text": "äh, also das heißt ihr macht quasi rechtseitige, rechtsbündige Einrückung oder? Ja ob Tap"}, {"id": 541, "start": 4415.68, "end": 4426.8, "text": "oder Spaces, Tap werte ich mal als 4 Spaces, vom Abstand ungefähr, mir geht es nur um"}, {"id": 542, "start": 4426.8, "end": 4434.36, "text": "die Anzeige, also mir ist egal, ob es 2 Spaces oder 4 Spaces sind bei Tap, also Tap würde"}, {"id": 543, "start": 4434.36, "end": 4439.2, "text": "ich jetzt sagen zählt als 4 Spaces, also mir ist egal ob Spaces oder Tap, mir geht es"}, {"id": 544, "start": 4439.2, "end": 4444.04, "text": "um den Abstand, ich mag den Abstand von 2 Spaces, genau das ist bei mir auch die Sache,"}, {"id": 545, "start": 4444.04, "end": 4449.24, "text": "ich mag 2 Spaces, weil wenn du sowas wie C Sharp programmierst, da hattest du lange"}, {"id": 546, "start": 4449.24, "end": 4453.24, "text": "Zeit halt so Sachen wie Namespaces Einrückung, Klasseneinrückung, das ist jetzt alles ein"}, {"id": 547, "start": 4453.24, "end": 4459.24, "text": "bisschen besser geworden in den letzten Sprachen, aber halt noch nicht richtig nice und da kannst"}, {"id": 548, "start": 4459.24, "end": 4480.88, "text": "du einfach Einrückung sparen, ja, also ich mag 2 Spaces, so, also das fand ich dann"}, {"id": 549, "start": 4480.88, "end": 4484.16, "text": "hier eigentlich ganz spannend, sowas sind einfach stehen geblieben, also wie gesagt"}, {"id": 550, "start": 4484.16, "end": 4489.72, "text": "zu Rust werden sie nie mehr kreieren, haben sie das immer noch vor, ok 3 Spaces ist natürlich"}, {"id": 551, "start": 4489.72, "end": 4500.36, "text": "dann, warum nicht einfach 1,5 Spaces, wie wäre es eigentlich damit, warum haben wir"}, {"id": 552, "start": 4500.36, "end": 4506.24, "text": "eigentlich schon nicht halbe Einrückung erfunden, ich glaube ich sollte mal den eigenen Editor"}, {"id": 553, "start": 4506.24, "end": 4511.8, "text": "programmieren, ne, ne, Leute wir programmieren einen Wishful Studio Code Addon, keine Ahnung"}, {"id": 554, "start": 4511.8, "end": 4525.04, "text": "ob man das mit dem Addon machen kann, der 1,5 Spaces Einrückung machen kann, es gibt ja"}, {"id": 555, "start": 4525.04, "end": 4537.2, "text": "sogar halbe Leerzeichen, stimmt, es gibt ja Unicode mäßig alles mögliche, so also"}, {"id": 556, "start": 4537.2, "end": 4546.56, "text": "Top Languages, die Entwickler 2021 gelernt haben, JavaScript, Python, TypeScript, Java"}, {"id": 557, "start": 4546.56, "end": 4551.12, "text": "Go, ja das wundert mich auch nicht, JavaScript klar, Python auch immer weiter am Aufsteigen"}, {"id": 558, "start": 4551.12, "end": 4559.28, "text": "gerade an der Uni oder eben was Machine Learning angeht, TypeScript auch mit JavaScript, viele"}, {"id": 559, "start": 4559.28, "end": 4562.48, "text": "fangen ja mit JavaScript an und sagen dann irgendwann, hey ich probiere mal TypeScript"}, {"id": 560, "start": 4562.48, "end": 4566.96, "text": "und steige da nie wieder zurück um auf JavaScript, weil im Prinzip ist ja TypeScript, JavaScript"}, {"id": 561, "start": 4566.96, "end": 4571.68, "text": "bloß mit mehr, also JavaScript ist gültiges TypeScript, aber TypeScript ist nicht gültiges"}, {"id": 562, "start": 4571.68, "end": 4578.64, "text": "JavaScript, ja und Go, gut, Go kann ich verstehen, Go hat einfach so unglaublich viele Tutorials"}, {"id": 563, "start": 4578.64, "end": 4592.6, "text": "und Sachen, man kommt gut rein, Ruby, Ruby Objective C und Scala, oh, innerhalb der letzten"}, {"id": 564, "start": 4592.6, "end": 4600.56, "text": "5 Jahre sind die viel unbeliebter geworden, tja, gut Scala kann ich verstehen, Scala,"}, {"id": 565, "start": 4600.56, "end": 4605.92, "text": "achso, jetzt hat jemand vorhin gefragt, ob sich es lohnt, das englische Tastaturlayout"}, {"id": 566, "start": 4605.92, "end": 4611.96, "text": "zu lernen, ja wenn du Scala programmierst, dann lohnt sich das, also Scala besteht ja"}, {"id": 567, "start": 4611.96, "end": 4619.4, "text": "im Prinzip nur aus Klammern, nicht dass ich das jetzt verwechsel mit Erlang oder so, warte"}, {"id": 568, "start": 4619.4, "end": 4631.32, "text": "mal, Code Examples, ja doch, es besteht aus ziemlich vielen Klammern, aber wobei geht"}, {"id": 569, "start": 4631.32, "end": 4639.28, "text": "da eigentlich, irgendwie hatte ich im Hinterkopf, dass Scala total viele Klammern hat, Lisp,"}, {"id": 570, "start": 4639.28, "end": 4644.6, "text": "ja Lisp ist ja noch das Allerschlimmste, wisst ihr was das Schlimmste ist an Klammern, Emacs"}, {"id": 571, "start": 4644.6, "end": 4649.8, "text": "und Lisp, Example, guckt euch das mal an, also wer sich den Shit antut, weiß ich auch"}, {"id": 572, "start": 4649.8, "end": 4674.52, "text": "nicht, guckt euch das mal an, das meinen die ernst, ja, guckt euch das an, guckt, ja,"}, {"id": 573, "start": 4674.52, "end": 4679.04, "text": "und das lustige ist, wisst ihr warum die Lisp damals in Emacs eingebaut haben, weil"}, {"id": 574, "start": 4679.04, "end": 4683.2, "text": "die gesagt haben, ach nee, C verstehen die normalen User ja nicht, die sollen das gefälligst"}, {"id": 575, "start": 4683.2, "end": 4692.12, "text": "in Lisp programmieren, als wäre der Shit einfacher zu verstehen als C Funktion, unverstissbar,"}, {"id": 576, "start": 4692.12, "end": 4697.72, "text": "also gut, gut Emacs ist ja eh fast schon in der Bedeutungslosigkeit verschwunden 2021,"}, {"id": 577, "start": 4697.72, "end": 4720.44, "text": "gibt es noch jemand bei euch, der Emacs verwendet, nee, ok aber das verstehe ich, Ruby ist halt"}, {"id": 578, "start": 4720.44, "end": 4726.36, "text": "total aus der Mode gekommen, Ruby ist wie gesagt, ne was sie schafft, meine Lieblingsprogrammiersprache,"}, {"id": 579, "start": 4726.36, "end": 4733.08, "text": "aber Ruby hat einen riesen Aufstieg gehabt mit Rails und das ist ja die letzten Jahre"}, {"id": 580, "start": 4733.08, "end": 4742.52, "text": "über Steinberg abgegangen und Ruby hat es nicht geschafft so wirklich ne eigene, so"}, {"id": 581, "start": 4742.52, "end": 4745.52, "text": "ein herausstechendes Merkmal zu haben, dass die Leute gesagt haben, hey wir verwenden"}, {"id": 582, "start": 4745.52, "end": 4755.44, "text": "jetzt Ruby anstatt keine Ahnung, Java Skript oder Paaßen, also ich kann es nachvollziehen,"}, {"id": 583, "start": 4755.44, "end": 4759.6, "text": "wenn Ruby ne super Sprache ist, Ruby 3 kam raus, hat angeblich vieles verbessert, ich"}, {"id": 584, "start": 4759.6, "end": 4763.56, "text": "hab es bis heute nicht ausprobiert, weil Ruby mittlerweile so unbedeutend ist, ich mag"}, {"id": 585, "start": 4763.56, "end": 4768.6, "text": "zwar Ruby, aber man kann es vergessen mittlerweile, Objective C wundert mich nicht, das war ja"}, {"id": 586, "start": 4768.6, "end": 4772.52, "text": "in der heutigen Zeit, also das war ja in den letzten paar Jahren bis jetzt in die heutige"}, {"id": 587, "start": 4772.52, "end": 4778.16, "text": "Zeit eigentlich nur auf Apple irgendwie relevant und die haben jetzt, na wie heißt es, Swift"}, {"id": 588, "start": 4778.16, "end": 4784.0, "text": "am Start, ich weiß gar nicht wie das ist, ob es immer noch Sachen gibt, die man nicht"}, {"id": 589, "start": 4784.0, "end": 4788.56, "text": "mit Swift machen kann, wo man Objective C für braucht, aber es ist verschwindend gering"}, {"id": 590, "start": 4788.56, "end": 4793.24, "text": "auf jeden Fall, gut Skala, ja gut, wer sich das mal gegeben hat weiß ich eh nicht, ok"}, {"id": 591, "start": 4793.24, "end": 4800.12, "text": "faster scrolling languages ist Paaßen, TypeScript, Kotlin, SQL und Go, Paaßen und TypeScript"}, {"id": 592, "start": 4800.12, "end": 4803.6, "text": "wundert mich nicht, Kotlin wundert mich auch nicht, ich würde auf jeden Fall das immer"}, {"id": 593, "start": 4803.6, "end": 4809.4, "text": "vorziehen als Java zu machen, ja ich, zwei Monate Subscription, Dankeschön für den"}, {"id": 594, "start": 4809.4, "end": 4820.08, "text": "Sub, exquisite, Sub, SQL braucht man immer, ja und Go ist halt beliebt, weil Go viele Tutorials"}, {"id": 595, "start": 4820.08, "end": 4824.28, "text": "hat und viele Leute mit Go halt auch anfangen, das wundert mich auch nicht, dass das drin"}, {"id": 596, "start": 4824.28, "end": 4835.64, "text": "ist, viele Cloud Sachen sind ja auch in Go programmiert, ok, ein Großteil der Leute,"}, {"id": 597, "start": 4835.64, "end": 4840.88, "text": "die bei einer Umfrage teilgenommen haben, entwickeln Web Anwendung, das Backend für"}, {"id": 598, "start": 4840.88, "end": 4845.2, "text": "Web Anwendung, das finde ich interessant, hätte eigentlich gedacht die meisten Leute"}, {"id": 599, "start": 4845.2, "end": 4848.56, "text": "sind irgendwie, gut wir sind ja nicht auf Stack Overflow, auf Stack Overflow sind die meisten"}, {"id": 600, "start": 4848.56, "end": 4871.72, "text": "wahrscheinlich Frontend Java Script Stells, Gkanalshu, Stufe 1, huge Username, oh der"}, {"id": 601, "start": 4871.72, "end": 4875.96, "text": "Hype Train nähert sich Leute, ich sehe es schon, wir werden gleich wieder gescampt von"}, {"id": 602, "start": 4875.96, "end": 4886.48, "text": "Twitch, gebated, Scam Train ist unterwegs, Crystal kenne ich, Crystal hat das Problem"}, {"id": 603, "start": 4886.48, "end": 4897.36, "text": "das es nicht unter Windows läuft, auch sonst ziemlich in Nischensprache ist, wenn das das"}, {"id": 604, "start": 4897.36, "end": 4906.12, "text": "letzte Mal lief das nicht unter Windows, also Programming Languages, was ist besonders beliebt,"}, {"id": 605, "start": 4906.12, "end": 4909.96, "text": "Java Script wissen wir, HTML, CSS, logisch, jetzt kommen natürlich die ersten wieder"}, {"id": 606, "start": 4909.96, "end": 4917.24, "text": "Sachen, null, warum ist HTML in der Umfrage, aber ich kann es verstehen, das ist halt was,"}, {"id": 607, "start": 4917.24, "end": 4920.96, "text": "was viele Leute den Tag über machen und scheiß drauf, ob es eine Programmiersprache ist oder"}, {"id": 608, "start": 4920.96, "end": 4924.52, "text": "nicht, wir schreiben es ja sogar selbst, es geht einfach darum, was viele Leute in ihrer"}, {"id": 609, "start": 4924.52, "end": 4932.76, "text": "IDE so den ganzen Tag machen und da ist HTML, CSS wahrscheinlich vorne dabei, SQL, logisch,"}, {"id": 610, "start": 4932.76, "end": 4939.52, "text": "wobei ich es immer noch erstaunlich finde, dass so viele Leute SQL von Hand schreiben,"}, {"id": 611, "start": 4939.52, "end": 4947.16, "text": "wenn man nicht totalen Mist macht mit seinem DB, Mapper, Framework, wie auch immer man"}, {"id": 612, "start": 4947.16, "end": 4956.44, "text": "es jetzt nennen mag, dann geht es doch eigentlich mittlerweile, ich meine du kannst natürlich"}, {"id": 613, "start": 4956.44, "end": 4960.68, "text": "auch sagen, wenn du jetzt verwendest EF Core oder sowas, weil wir jetzt gerade bei C Sharp"}, {"id": 614, "start": 4960.68, "end": 4968.48, "text": "sind, du kannst ja auch dumme Sachen machen, wie erst irgendwie die alle ID's rausholen,"}, {"id": 615, "start": 4968.48, "end": 4973.16, "text": "dann eine Schleife und dann damit andere Sachen abfragen, anstatt einen Joint zu machen,"}, {"id": 616, "start": 4973.16, "end": 4979.44, "text": "du kannst Mist bauen, aber ich frage mich woran das liegt, dass so viele Leute noch"}, {"id": 617, "start": 4979.44, "end": 4983.44, "text": "SQL von Hand programmieren."}, {"id": 618, "start": 4983.44, "end": 4997.32, "text": "Was total viele Stellenanzeigen suchen nach Entwickler, HTML, CSS, ja Frontend Sachen"}, {"id": 619, "start": 4997.32, "end": 5002.2, "text": "sind beliebt, aber ich würde halt sagen zukunftsfähig, ich meine klar, du wirst in Zukunft auch"}, {"id": 620, "start": 5002.2, "end": 5007.84, "text": "Webentwickler brauchen, aber Webentwickler hat so von allen, ist meine Einschätzung"}, {"id": 621, "start": 5007.84, "end": 5017.12, "text": "nach ja, so die geringsten Geldaussichten, also da gibt es einfach so viele und ich habe"}, {"id": 622, "start": 5017.12, "end": 5023.72, "text": "die dumme Vermutung, aber das kann sich auch als komplett falsch rausstellen, dass über"}, {"id": 623, "start": 5023.72, "end": 5027.56, "text": "mittlere Zukunft Webentwickler weniger werden, die man braucht."}, {"id": 624, "start": 5027.56, "end": 5042.84, "text": "Ey mal gucken, mal gucken, ich mache eigentlich mittlerweile ganz gerne eben bei ein bisschen"}, {"id": 625, "start": 5042.84, "end": 5043.84, "text": "Javascript Zeug."}, {"id": 626, "start": 5043.84, "end": 5051.16, "text": "So also Java ist das nächste gute Business-Stell, Shellscripting Languages wundert mich jetzt"}, {"id": 627, "start": 5051.16, "end": 5056.44, "text": "auch nicht, vieles ist halt einfach mal schnell in einem Shellscript zusammen gewurstet und"}, {"id": 628, "start": 5056.44, "end": 5060.88, "text": "um verschiedene Sachen miteinander zu verbinden ist ein Shellscript super, irgendwelche automatischen"}, {"id": 629, "start": 5060.88, "end": 5066.52, "text": "Teststarten oder irgendwelche Init-Sachen in einem Repo, dass du sagen kannst, hey du"}, {"id": 630, "start": 5066.52, "end": 5071.52, "text": "hast da einen Checkout-Script oder du hast irgendwie einen Skript, was dir was aufsitzt,"}, {"id": 631, "start": 5071.52, "end": 5076.12, "text": "das verstehe ich, das ist damit einfach easy gemacht, ein paar Zeilen Shellscript ist meistens"}, {"id": 632, "start": 5076.12, "end": 5081.64, "text": "für kleine Sachen einfacher als da jetzt irgendwie Big-Brain-Python-Zeug zu basteln"}, {"id": 633, "start": 5081.64, "end": 5090.12, "text": "oder sowas, ist GitLab CE auch Shellscripting, ich vermute mal, dass du da Shellscript ausführen"}, {"id": 634, "start": 5090.12, "end": 5095.08, "text": "kannst, ansonsten muss ich dir ehrlich sagen, ich habe GitLab CE nie wirklich großartig"}, {"id": 635, "start": 5095.08, "end": 5104.52, "text": "verwendet, keine Ahnung, Script versus Makefile, ne das kommt drauf an, was man machen will,"}, {"id": 636, "start": 5104.52, "end": 5110.2, "text": "Makefile finde ich halt schwarze Magie, denn Shellscript hat den Vorteil, dass wenn man"}, {"id": 637, "start": 5110.2, "end": 5115.76, "text": "eine ordentliche Sprache verwendet, also wir reden jetzt nicht von C++, sondern irgendeine"}, {"id": 638, "start": 5115.76, "end": 5120.84, "text": "ordentliche Sprache, wo du einen ordentlichen Package-Manager dabei hast, wo du ordentliche"}, {"id": 639, "start": 5120.84, "end": 5125.52, "text": "Fehlermeldungen bekommst und ordentliche Tools dabei hast und ordentliche Configs hast,"}, {"id": 640, "start": 5125.52, "end": 5130.76, "text": "dann kannst du halt den Shellscript in ein Repo legen, sagen wir für irgendwie Test-Deployment"}, {"id": 641, "start": 5130.76, "end": 5135.68, "text": "oder sowas, dann führst du das aus, dann baut er dir das Programm zusammen und schiebt"}, {"id": 642, "start": 5135.68, "end": 5140.32, "text": "das per SSH irgendwo hin und startet dann den Service neu, das sind 5 Zeilen Shellscript,"}, {"id": 643, "start": 5140.32, "end": 5144.44, "text": "das ist easy, kann jeder machen, brauchst dann bloß dein SSH Key an der richtigen Stelle,"}, {"id": 644, "start": 5144.44, "end": 5148.12, "text": "für sowas ist halt ein Shellscript einfach praktisch, da muss man es nicht übertreiben,"}, {"id": 645, "start": 5148.12, "end": 5154.12, "text": "klar kann man jetzt wieder sagen, ja wie sieht es aus, eh, continuous delivery, Pipeline,"}, {"id": 646, "start": 5154.12, "end": 5159.6, "text": "sonst was, wenn ich einfach nur mal was schnell ausprobieren will, manchmal ist ein Shellscript,"}, {"id": 647, "start": 5159.6, "end": 5164.12, "text": "also die oldschool Variante mit einem Shellscript auf irgendeinen Test-Server was zu kopieren,"}, {"id": 648, "start": 5164.12, "end": 5169.48, "text": "den Service neu zu starten und dann mal im Browser zu refreshen, die einfache Variante"}, {"id": 649, "start": 5169.48, "end": 5175.76, "text": "als da jetzt irgendwelche komischen Big Brain Deployment Pipelines aufzusetzen."}, {"id": 650, "start": 5175.76, "end": 5184.64, "text": "C++ ist eine ordentliche Sprache, das habe ich nicht gesagt, ich habe gesagt C++ ist"}, {"id": 651, "start": 5184.64, "end": 5192.28, "text": "keine ordentliche Sprache, ich habe gesagt eine ordentliche Sprache also nicht C++, C++"}, {"id": 652, "start": 5192.28, "end": 5200.84, "text": "hat ja nichts, was eine ordentliche Sprache ausmacht, doch das ist eine super Fehlermeldung,"}, {"id": 653, "start": 5200.84, "end": 5209.72, "text": "das ist die allerbeste, genauso C++ Fehlermeldung finde ich gut, ja, da weißt du Bescheid, aber"}, {"id": 654, "start": 5209.72, "end": 5214.44, "text": "ich will jetzt nicht von C++ anfangen, weil wenn ich von C++ anfange, dann wisst ihr"}, {"id": 655, "start": 5214.44, "end": 5222.2, "text": "Leute, dann hören wir so schnell nicht mehr auf über C++ zu flamen, C++ in der Schule,"}, {"id": 656, "start": 5222.2, "end": 5223.72, "text": "ja mein Beileid."}, {"id": 657, "start": 5223.72, "end": 5234.56, "text": "Ein schönes Beispiel, komm wo wir jetzt dabei sind, schönes Beispiel, wo ich immer drüber"}, {"id": 658, "start": 5234.56, "end": 5239.64, "text": "kecken muss ist das hier, ich habe es hier gerade gefunden deswegen, schönes Beispiel"}, {"id": 659, "start": 5239.64, "end": 5250.32, "text": "wo ich immer drüber kecken muss ist folgendes, was tut es, was macht es?"}, {"id": 660, "start": 5250.32, "end": 5262.96, "text": "Ich weiß mittlerweile geht es einfacher, aber auch erst seit C++ 20 glaube ich, es kompiliert,"}, {"id": 661, "start": 5262.96, "end": 5272.88, "text": "das funktioniert, das funktioniert wirklich, ihr müsst es nicht wissen was das macht,"}, {"id": 662, "start": 5272.88, "end": 5280.92, "text": "das ist bescheuert einfach nur so Dinge, also gucken wir mal weiter, es ist obvious, ja"}, {"id": 663, "start": 5280.92, "end": 5286.76, "text": "total klar was das macht, das ist genauso obvious was das macht, wie das letzte ffmpeg"}, {"id": 664, "start": 5286.76, "end": 5297.76, "text": "Kommando was wir hier haben, ja, also das finde ich auch total obvious, ffprobv error select"}, {"id": 665, "start": 5297.76, "end": 5305.08, "text": "stream v0 count packets show entries stream nb read packets of csv gleich p gleich 0 und"}, {"id": 666, "start": 5305.08, "end": 5311.84, "text": "dann das gif, das finde ich auch total offensichtlich, dass das Kommando so sein muss, also wie könnte"}, {"id": 667, "start": 5311.84, "end": 5321.24, "text": "man jetzt auch denken, dass das Kommando irgendwie anders aussehen muss, voll obvious halt, wenn"}, {"id": 668, "start": 5321.24, "end": 5328.52, "text": "du deine eigene Programmiersprache releasen würdest, wie würdest du sie nennen, cute chat,"}, {"id": 669, "start": 5328.52, "end": 5335.4, "text": "keck++ würde ich es auf gar keinen Fall nennen, ich würde es cute chat, oder, oder, ich würde"}, {"id": 670, "start": 5335.4, "end": 5340.48, "text": "darauf setzen, dass die ganzen weebs die Programmiersprache lernen und berühmt machen, ich würde sie"}, {"id": 671, "start": 5340.48, "end": 5351.2, "text": "irgendwie nennen, meweep, me-spam-mod-bucker-if-ban, cute++, keine Ahnung, ich würde mir wirklich"}, {"id": 672, "start": 5351.2, "end": 5357.92, "text": "nicht irgendwas big-brainiges ausdenken, keine Ahnung, mir fällt gerade nichts gescheites"}, {"id": 673, "start": 5357.92, "end": 5365.16, "text": "ein, hentai-sharp, oh das ist eine gute Idee, dann hast du auf jeden Fall schon mal die Benutzergruppe"}, {"id": 674, "start": 5365.16, "end": 5381.12, "text": "gesichert, ja, ayayascript, das finde ich auch nicht schlecht, ok, also, ok, ok, also"}, {"id": 675, "start": 5381.12, "end": 5386.76, "text": "als Shellscripting so leuchtet mir voll und ganz ein, dass das noch beliebt ist, das ganze"}, {"id": 676, "start": 5386.76, "end": 5403.72, "text": "gefolgt von php, wenn man das da wieder cool aussprechen will, wo lang, da würde ich"}, {"id": 677, "start": 5403.72, "end": 5408.64, "text": "mir irgendwas überlegen, aber zum Glück muss ich keine Programmiersprache entwickeln,"}, {"id": 678, "start": 5408.64, "end": 5413.8, "text": "denn meine Programmiersprache hätte garantiert Memory Leaks und ich hoffe nicht, dass irgendwann"}, {"id": 679, "start": 5413.8, "end": 5420.72, "text": "man da mit einem Auto steuern will oder sowas, dann ist vorbei, so, was haben wir da sonst"}, {"id": 680, "start": 5420.72, "end": 5430.76, "text": "noch, gut, php verstehe ich auch, php leuchtet ein, php ist halt immer noch webseitentechnisch"}, {"id": 681, "start": 5430.76, "end": 5439.2, "text": "angesagt und auch wenn viele jetzt sagen, max jetzt übertreibt man nicht, ich muss sagen,"}, {"id": 682, "start": 5439.2, "end": 5443.28, "text": "das was ich in letzter Zeit, ich habe in letzter Zeit nichts mit php gemacht, aber das letzte"}, {"id": 683, "start": 5443.28, "end": 5447.48, "text": "mal, die letzten paar Sachen, die ich so gesehen habe, auch mal in ein paar Konferenztalks"}, {"id": 684, "start": 5447.48, "end": 5458.04, "text": "und so von php, mit den passenden Frameworks, ist gar nicht so schlecht, ist echt in Ordnung,"}, {"id": 685, "start": 5458.04, "end": 5469.24, "text": "aber relax days, komme ich jetzt bei Rick Astley raus, Moment, die sieht aus, als macht"}, {"id": 686, "start": 5469.24, "end": 5476.28, "text": "die gleich Yogaübung oder sowas hier vor der Cam, mit dem unbequemen Stuhl, ok, das"}, {"id": 687, "start": 5476.28, "end": 5482.6, "text": "ist PainsChamp, also schauen wir mal was PainsChamp ist, deine Aufgaben sind, meinst du das Video"}, {"id": 688, "start": 5482.6, "end": 5490.24, "text": "ist PainsChamp oder die Stellenanzeige ist PainsChamp, Neuentwicklung von Backend Applikation"}, {"id": 689, "start": 5490.24, "end": 5495.92, "text": "mit PHP Storm, ok, sie verwenden schon mal eine gescheite IDE, da bin ich ja schon mal"}, {"id": 690, "start": 5495.92, "end": 5501.84, "text": "in Ordnung, Analyse der Anforderungen im Fachbereich sowie Anpassung, ok, Arbeiten mit einer Microservice"}, {"id": 691, "start": 5501.84, "end": 5507.52, "text": "Architektur und sichern, ok, stetiger Austausch mit Frontend Team zur Gewähr, ok, ein bisschen"}, {"id": 692, "start": 5507.52, "end": 5511.84, "text": "mehr zu dem was man eigentlich macht, wäre vielleicht nicht verkehrt, das Video ist Cringe,"}, {"id": 693, "start": 5511.84, "end": 5515.84, "text": "ok, gucken wir uns gleich an, damit überzeugst du uns, Fachinformatik, Analyse Entwickler,"}, {"id": 694, "start": 5515.84, "end": 5522.32, "text": "Bachelor Informat, blablabla, Fortgeschrittene PHP Kenntnisse, Bündnisse, Dockers, Sage,"}, {"id": 695, "start": 5522.32, "end": 5534.0, "text": "ee, Team Foundation, wer verwendet denn das noch, MonkaS, Team Foundation, Continuous Delivery,"}, {"id": 696, "start": 5534.0, "end": 5542.0, "text": "Jira, Confluence, MySQL, Symfony, Doctrine, braucht man nicht, ihr wisst, auch guter PHP"}, {"id": 697, "start": 5542.0, "end": 5553.36, "text": "Code dokumentiert sich selbst, Engagement, Leistungsbereitschaft im Team, die Seite ist"}, {"id": 698, "start": 5553.36, "end": 5570.04, "text": "in Ordnung, ok, das Video ist Cringe, also, Ups, ist es Chebathe, ist es Chebathe, ah"}, {"id": 699, "start": 5570.04, "end": 5577.2, "text": "ne, das ist nicht Chebathe, ich hab gedacht, das ist Chebathe, ich hab gedacht, die wollen"}, {"id": 700, "start": 5577.2, "end": 5583.28, "text": "einen verarschen, fast, ok, die sind mir schon mal sympathisch, man darf mit kurzer Hose"}, {"id": 701, "start": 5583.28, "end": 5596.92, "text": "am Rechner setzen, Team Zelda, oh Gott, Moment, ich muss mal die Musik kurz ausmachen, äh,"}, {"id": 702, "start": 5596.92, "end": 5618.24, "text": "da sind wir stehen geblieben, ja, alter, die Musik, das übertreibt es mal nicht, oh,"}, {"id": 703, "start": 5618.24, "end": 5643.66, "text": "hier ist es kahn Huang, ich meine das ist es"}, {"id": 704, "start": 5643.66, "end": 5647.46, "text": "Ja, es ist super mit den Kollegen im Team, das macht wirklich Spaß."}, {"id": 705, "start": 5652.46, "end": 5657.26, "text": "Und auch generell finde ich es schön, dass hier einfach so viel Vertrauen in mich gesetzt wurde,"}, {"id": 706, "start": 5657.26, "end": 5660.86, "text": "weil ich habe ja als Student hier angefangen, habe meine Abschlussarbeit hier geschrieben,"}, {"id": 707, "start": 5660.86, "end": 5665.66, "text": "direkt eine Rolle als Teamleiter bekommen. Das war für mich natürlich eine mega Ehre und"}, {"id": 708, "start": 5665.66, "end": 5669.96, "text": "das macht einfach Spaß dann. Wahrscheinlich wollte das keiner machen sonst."}, {"id": 709, "start": 5669.96, "end": 5675.96, "text": "Generell passiert ja auch gerade die Umstellung auf GitLab im Hintergrund,"}, {"id": 710, "start": 5675.96, "end": 5680.26, "text": "dass da alles über Docker-Qt da läuft und im Kubernetes und schnicki schnacki."}, {"id": 711, "start": 5680.26, "end": 5697.66, "text": "Ich finde das Video nicht schlecht. Also die macht den Eindruck, als weiß sie wovon sie redet und"}, {"id": 712, "start": 5697.66, "end": 5702.46, "text": "sie labert nicht im Kreis rum. Sobald das dann zeitlich mal passt, ist Relax Day dann auch einfach"}, {"id": 713, "start": 5702.46, "end": 5707.66, "text": "sehr offen, da diese bessere Lösung umzusetzen und das macht einfach Spaß dann. Da würde ich"}, {"id": 714, "start": 5707.66, "end": 5711.36, "text": "mich ohne Scheiß nach dem Video, würde ich mir tatsächlich überlegen mich dazu bewerben. Also"}, {"id": 715, "start": 5711.36, "end": 5716.54, "text": "mache ich nicht, aber wenn ich jetzt suchen würde, ich fand das wirklich nicht verkehrt."}, {"id": 716, "start": 5716.54, "end": 5721.78, "text": "Die labert nicht so sinnlos im Kreis rum. Ich finde es viel cringier, wenn du Leute irgendwo"}, {"id": 717, "start": 5721.78, "end": 5728.22, "text": "da sitzen hast so nach dem Motto, ich arbeite bei der ABC GmbH und ich bin dann direkt nach meinem"}, {"id": 718, "start": 5728.22, "end": 5733.3, "text": "Studio hingekommen und ich war so überrascht, was das für ein toller innovativer und moderner"}, {"id": 719, "start": 5733.3, "end": 5738.34, "text": "Arbeitgeber ist. Ich könnte mir keinen schöneren Arbeitsplatz vorstellen bei der ABC GmbH. Jeder"}, {"id": 720, "start": 5738.34, "end": 5744.94, "text": "Tag ist eine neue Herausforderung. Mein Team ist das Beste. Aber das ist doch vollkommen okay"}, {"id": 721, "start": 5744.94, "end": 5751.74, "text": "gewesen. Das ist doch nice. Ja also da kann ich mich nicht"}, {"id": 722, "start": 5751.74, "end": 5768.1, "text": "bestellen. Übrigens, hier hatte ich. Okay es. Mir hatte mir hat es hier vorher wieder. Oh das"}, {"id": 723, "start": 5768.1, "end": 5778.3, "text": "das das sieht das sieht cringeig aus. Allein schon vom Thumbnail her. Also da bin ich mir"}, {"id": 724, "start": 5778.3, "end": 5787.58, "text": "jetzt nicht so sicher. Zeig mal her. Sagen wir haben die alle irgendwie die gleiche Musik drin."}, {"id": 725, "start": 5787.58, "end": 5804.94, "text": "Und warum stehen ihre Azubis random auf dem Parkplatz. Nee machen sie gar nicht. Hi ich"}, {"id": 726, "start": 5804.94, "end": 5809.34, "text": "bin der Luca. Ich bin 21 Jahre alt und ich absolviere meine Ausbildung bei der"}, {"id": 727, "start": 5809.34, "end": 5813.38, "text": "GRIESAWA Logistics Group in Bad Zecking als Fachinformatiker für System Integration."}, {"id": 728, "start": 5813.38, "end": 5821.78, "text": "Es kam gerade ein Ticket rein. Oh jetzt jetzt Jyra Ticket Leute hier. Es kam gerade ein Ticket"}, {"id": 729, "start": 5821.78, "end": 5826.58, "text": "rein. Ich bin kurz unten im Serverraum. Okay meistens werden Anfragen von Mitarbeitern in"}, {"id": 730, "start": 5826.58, "end": 5830.22, "text": "unserem zentralen Ticketsystem verarbeitet. Noch der gute alte Turnschuh Admin. So mag ich das."}, {"id": 731, "start": 5830.22, "end": 5835.66, "text": "Von den Mitarbeitern der IT Abteilung verarbeitet. Es besteht aber auch noch die Möglichkeit Anfragen"}, {"id": 732, "start": 5835.66, "end": 5840.5, "text": "über Telefon zu stellen. Das heißt man ruft einfach eine zentrale Nummer an und dort. Und"}, {"id": 733, "start": 5840.5, "end": 5844.26, "text": "da hat jeder Bock drauf Telefonsupport zu machen. Ich werde mit euch. Dann jemand"}, {"id": 734, "start": 5844.26, "end": 5849.5, "text": "mitte wegen dem Problem melden und mit Leuten kommunizieren. Das ist ja das schlimmste."}, {"id": 735, "start": 5849.5, "end": 5860.74, "text": "Top Sound. Okay ich schau mir das mal an. Oh nein Drucker fixen. Hört mal auf."}, {"id": 736, "start": 5863.38, "end": 5866.34, "text": "Den muss doch was besseres eingefallen sein um ihre"}, {"id": 737, "start": 5866.34, "end": 5870.06, "text": "Fachinformatiker Ausbildung zu bewerben als Drucker fixen."}, {"id": 738, "start": 5870.06, "end": 5881.54, "text": "Und warum hängt da überhaupt so treu Schnee beim Drucker. Mit Kabelmanagement habe ich keine"}, {"id": 739, "start": 5881.54, "end": 5887.22, "text": "Probleme. Ihr hättet das früher bei uns im Rechenzentrum sehen müssen. Das war auch so."}, {"id": 740, "start": 5887.22, "end": 5892.94, "text": "Ja dementsprechend haben wir doch aus Versehen schon mal Wackelkontakte ausgelöst an Servern."}, {"id": 741, "start": 5892.94, "end": 5896.7, "text": "Weil egal andere Geschichte vielleicht nicht ganz so schlimm. Aber es war bei uns halt voll."}, {"id": 742, "start": 5896.7, "end": 5903.42, "text": "Bei uns hattest du quasi eine komplette Wand. Nur Kabel. Aber warum. Warum steht das neben"}, {"id": 743, "start": 5903.42, "end": 5909.06, "text": "dem Drucker. Warum ist das nicht mal. Zumindest. Zumindest. Ich glaube da ist sogar Klaas. Da"}, {"id": 744, "start": 5909.06, "end": 5916.82, "text": "ist Klaas davor. Aber ja okay ist egal. Besonders wichtig in der Logistik. Jo was war jetzt mit dem"}, {"id": 745, "start": 5916.82, "end": 5921.82, "text": "Drucker. Grießhaber sind auch die Scanner. Die Scanner spielen eine zentrale Rolle. Weil"}, {"id": 746, "start": 5921.82, "end": 5927.5, "text": "der Grießhaber Logistik Group. Weil diese Scanner. Scanner. Im ganzen Lager in Gebrauch sind. Heißt"}, {"id": 747, "start": 5927.5, "end": 5931.74, "text": "die IT ist doch immer direkt der erste Ansprechpartner wenn mit den Scannern ein Fehler"}, {"id": 748, "start": 5931.74, "end": 5936.42, "text": "passiert. Oder wenn es Probleme gibt allgemein beim Scannen. Oder wenn. Machen viele so. Ich"}, {"id": 749, "start": 5936.42, "end": 5949.18, "text": "habe das noch nie gesehen. Drucker im Serverraum. Mit dem Netzwerk. Was ich an meinem Berufsalltag"}, {"id": 750, "start": 5949.18, "end": 5969.7, "text": "schätze. Ist das mein. Ist das. Ich habe erst gedacht das ist. Ein Mainframe. Aber. Ist es"}, {"id": 751, "start": 5969.7, "end": 5997.86, "text": "anscheinend nicht. Was ist es denn. Das ist Dell oder. Ist EMC Dell. Ist es ein Storage. Ist es ein Dell Storage. Warte mal. Lass mich mal grad gucken. EMC. Dell EMC VNX Series. Ja das ist der. Das wusste"}, {"id": 752, "start": 5997.86, "end": 6004.3, "text": "ich doch dass mir das bekannt vorkommt. Arbeit sehr abwechslungsreich gestaltet ist. Sowas"}, {"id": 753, "start": 6004.3, "end": 6009.94, "text": "haben wir auch. Nicht das Ding aber von EMC. Und die IT nicht komplett voneinander getrennt"}, {"id": 754, "start": 6009.94, "end": 6017.58, "text": "ist. Oh jawoll. Die gute alte Konsole. So muss das. So muss das. So mag ich das. Wie"}, {"id": 755, "start": 6017.58, "end": 6022.82, "text": "zwei Zahnräder ineinander arbeiten und voneinander abhängig sind. Welche Zahnräder arbeiten"}, {"id": 756, "start": 6022.82, "end": 6028.06, "text": "ineinander. Sehr abwechslungsreich gestaltet ist. Und dass die Logistik und die IT nicht"}, {"id": 757, "start": 6028.06, "end": 6032.14, "text": "komplett voneinander getrennt ist. Sondern dass beide quasi wie zwei Zahnräder ineinander"}, {"id": 758, "start": 6032.14, "end": 6037.54, "text": "arbeiten und voneinander abhängig sind. Damit sie gut funktionieren. Ich frage mal bei meinem"}, {"id": 759, "start": 6037.54, "end": 6041.86, "text": "Kollegen Simon nach. Wie es ihm im Serverraum ergeht. Pass auf Leute. Huge Acting Skills"}, {"id": 760, "start": 6041.86, "end": 6051.34, "text": "bestimmt jetzt. Hi. Ja hi Simon. Bist du schon weiter gekommen. Ich frage mich ob"}, {"id": 761, "start": 6051.34, "end": 6058.5, "text": "die das Video freiwillig gemacht haben. Oder ob man gesagt hat ihr macht jetzt gefällig"}, {"id": 762, "start": 6058.5, "end": 6068.66, "text": "das Video. Serverraum. Ja klappt wieder. Der Drucker war noch im falschen V-Lan drin."}, {"id": 763, "start": 6068.66, "end": 6074.66, "text": "Oh. Ohne Scheiß auch wenn ich jetzt ein bisschen gemeckert habe. Also vom Inhalt her ist das"}, {"id": 764, "start": 6074.66, "end": 6079.78, "text": "gar nicht schlecht. Ich mein jemand der sich für die Ausbildung interessiert wird das"}, {"id": 765, "start": 6079.78, "end": 6084.58, "text": "wahrscheinlich soll ich viel sagen. Aber das sind genau die Probleme wo ich mir vorstellen"}, {"id": 766, "start": 6084.58, "end": 6088.82, "text": "könnte die da tagtäglich auftreten. Warum auch immer der Drucker im falschen V-Lan"}, {"id": 767, "start": 6088.82, "end": 6093.62, "text": "drin ist. Ich mein warum ist er auf einmal heute in einem anderen V-Lan als gestern."}, {"id": 768, "start": 6093.62, "end": 6099.3, "text": "Aber gut ich mein das sind Probleme die drehten auf. Und warum druckte er nur schwarz weiß"}, {"id": 769, "start": 6099.3, "end": 6110.26, "text": "wenn er im falschen V-Lan ist. Hi ich bin der Simon 19 Jahre alt und im zweiten Lehrjahr"}, {"id": 770, "start": 6110.26, "end": 6114.62, "text": "als Fachinformatiker bei Grieshaber. Ich habe damals hier mein Praktikum gemacht und habe"}, {"id": 771, "start": 6114.62, "end": 6118.94, "text": "danach dann direkt die Ausbildung hier angefangen. Was ich sehr gut finde bei Grieshaber ist"}, {"id": 772, "start": 6118.94, "end": 6123.46, "text": "dass auf die Azubis geachtet wird unter anderem durch der Onboarding Day und durch viele Azubis"}, {"id": 773, "start": 6123.46, "end": 6128.3, "text": "Events. Ok das wäre für mich schon mal der Cringe schlechthin wenn ich den Onboarding"}, {"id": 774, "start": 6128.3, "end": 6136.3, "text": "Day machen muss. Guckt euch das mal an irgendwelche komischen Waldausflüge. Ach du Kajun please"}, {"id": 775, "start": 6136.3, "end": 6149.06, "text": "lass die Leute doch einfach ihre Arbeit machen. Ach du. Also das nicht dass ich was gegen"}, {"id": 776, "start": 6149.06, "end": 6158.06, "text": "die Schaukel hätte aber ich behaupte mal die Schaukel hätte was gegen mich. Wer weiß"}, {"id": 777, "start": 6158.06, "end": 6167.42, "text": "da mache ich den noch in komischen in komischen Dinger kaputt. In der IT haben wir ein sehr"}, {"id": 778, "start": 6167.42, "end": 6171.86, "text": "junges Team und ein sehr familiäres Team. Bei ihm ist das kein Problem. Was mir sehr"}, {"id": 779, "start": 6171.86, "end": 6176.66, "text": "gefällt an der Spedition ist der Kontakt zu den Kunden und Mitarbeitern. Und durch eben"}, {"id": 780, "start": 6176.66, "end": 6180.62, "text": "die Logistik und die Speditionsbranche haben wir oft auf Englisch oder Französisch zu"}, {"id": 781, "start": 6180.62, "end": 6185.9, "text": "tun auch durch die verschiedenen Standorte in den unterschiedlichen Ländern was das"}, {"id": 782, "start": 6185.9, "end": 6191.34, "text": "ganze einfach noch ein bisschen ausmacht und was dadurch dann eben auch nicht so eintönig"}, {"id": 783, "start": 6191.34, "end": 6194.5, "text": "wird. Ich glaube es ist gar nicht schlecht das war am Anfang ein bisschen unglücklich"}, {"id": 784, "start": 6194.5, "end": 6199.74, "text": "das Video aber ich glaube es kann man durchaus machen. Was auch ein Grund war wieso ich mich"}, {"id": 785, "start": 6199.74, "end": 6203.66, "text": "für den Beruf entschieden habe weil ohne IT einfach heutzutage gar nichts mehr geht."}, {"id": 786, "start": 6203.66, "end": 6225.1, "text": "Das ist ja auch so. Wer mischt diese Videos immer ab? Haben sie Recht? Erstmal Drohnenrundflug"}, {"id": 787, "start": 6225.1, "end": 6237.66, "text": "in Bad Säckingen. Was? Ich glaube wenn man einmal angefangen hat diese Videos zu gucken"}, {"id": 788, "start": 6237.66, "end": 6242.9, "text": "dann kriegt man immer so Zeug empfohlen. Das hört ja gar nicht mehr auf. Guckt euch mal"}, {"id": 789, "start": 6242.9, "end": 6248.38, "text": "an. YouTube ist jetzt der Meinung ich möchte Feasy Videos empfohlen bekommen hier. Der"}, {"id": 790, "start": 6248.38, "end": 6254.3, "text": "sieht wenigstens aus wie ich mir so ein Feasy vorstelle. Zudem hätte ich gleich Vertrauen"}, {"id": 791, "start": 6254.3, "end": 6263.94, "text": "im Support. Da wisst ihr halt Ahnung. So wen haben wir denn sonst noch hier? Nix mehr."}, {"id": 792, "start": 6263.94, "end": 6280.7, "text": "Was ist das Azubi? Azubi Fakten. WMX oder BMW? Mal gucken. Mal gucken ob es BMW schafft"}, {"id": 793, "start": 6280.7, "end": 6302.06, "text": "gescheites Video zu machen. Das Intro ist schon. Das ist so Influencer Style. Das ist so Influencer"}, {"id": 794, "start": 6302.06, "end": 6312.94, "text": "Style. Hallo? Das ist ein Feasy Video. Als nächstes würde ich erwarten da sagt ich"}, {"id": 795, "start": 6312.94, "end": 6319.14, "text": "bin euch so dankbar für die Abonnenten. Schön dass ihr wieder eingeschaltet habt. Ohne euch"}, {"id": 796, "start": 6319.14, "end": 6334.78, "text": "wäre ich nichts. Hätte ich jetzt noch drauf gewartet. Also auf gehts. Ach du Kacke. Ach"}, {"id": 797, "start": 6334.78, "end": 6341.58, "text": "Moment. Der ist gar nicht von BMW. Das ist wirklich irgendein Influencer Dude oder was?"}, {"id": 798, "start": 6341.58, "end": 6370.94, "text": "Wer ist das? Alter wer mischt diese Videos immer ab? Das ist doch nicht euer Ernst. Pepe?"}, {"id": 799, "start": 6370.94, "end": 6394.46, "text": "Ach Peppa. Chancen vertan. Muss mal kurz gucken wie viele Subs hat der auf Instagram? 6000."}, {"id": 800, "start": 6394.46, "end": 6413.7, "text": "Hey Laura ich habe gerade deine Freundin Peppa kennengelernt. Zufälligerweise steht Laura"}, {"id": 801, "start": 6413.7, "end": 6418.14, "text": "genau daneben. Arbeitet ihr also mit Robotern? Ja wir programmieren hier beispielsweise auch"}, {"id": 802, "start": 6418.14, "end": 6422.7, "text": "mit Peppa. Was haben denn Roboter mit Autos zu tun? Die Roboter helfen uns bei den Autos"}, {"id": 803, "start": 6422.7, "end": 6427.18, "text": "hauptsächlich in der Produktion aber auch hier im IT Bereich. Krass. Sag mal was macht"}, {"id": 804, "start": 6427.18, "end": 6430.9, "text": "denn der Arbeit am meisten Spaß? Am meisten gefakt mit dass wir... Jetzt wird was zusammen"}, {"id": 805, "start": 6430.9, "end": 6435.58, "text": "gefakt. Jetzt wird was zusammen gefakt. Bei diesen Fragen kannst du nur gefakt antworten."}, {"id": 806, "start": 6435.58, "end": 6439.86, "text": "... wo wir alle zusammen arbeiten. Jeder von uns kann seinen Arbeitsalltag selbst einstellen"}, {"id": 807, "start": 6439.86, "end": 6445.66, "text": "und gestalten. Da habe ich so meine Zweifel. Das kann überhaupt nicht funktionieren wenn"}, {"id": 808, "start": 6445.66, "end": 6450.18, "text": "jeder machen kann was er will. Und wenn wir beispielsweise mit Peppa programmieren sehen"}, {"id": 809, "start": 6450.18, "end": 6453.7, "text": "wir am Ende was für ein tolles Ergebnis wir haben. Finde ich wirklich wichtig. Sag mal"}, {"id": 810, "start": 6453.7, "end": 6461.22, "text": "bist du gar nicht an den Fahrzeugen? Selbst wenn man so super agile und agil ist teilt"}, {"id": 811, "start": 6461.22, "end": 6466.18, "text": "man sich nicht einfach random irgendwie was selbst ein. Da gibt es trotzdem einen Backlog"}, {"id": 812, "start": 6466.18, "end": 6471.5, "text": "und einen Plan was man macht. Aber Melanie die kann dir weiterhelfen. Alles klar dann"}, {"id": 813, "start": 6471.5, "end": 6475.34, "text": "werde ich dich mal besuchen. Danke. Auf gehen wir zu Melanie. Hey Melanie schön dass du"}, {"id": 814, "start": 6475.34, "end": 6478.86, "text": "dir Zeit genommen hast. Hallo. Du sag mal wo sind wir hier eigentlich? Wir sind hier"}, {"id": 815, "start": 6478.86, "end": 6483.86, "text": "gerade bei einem Standpunkt von BMW Motorrad. Wo hauptsächlich die IT so geschrieben wird"}, {"id": 816, "start": 6483.86, "end": 6488.18, "text": "für die Handlersysteme. Also quasi die Diagnose wenn ein Motorrad kaputt ist, dass man es"}, {"id": 817, "start": 6488.18, "end": 6492.5, "text": "ansteckt und sagt hey was geht. Da war das Video übersteuert. Weißt du was sie da getrieben"}, {"id": 818, "start": 6492.5, "end": 6497.9, "text": "haben? Das ist ziemlich wichtig. Und was sind deine Aufgaben in der Ausbildung? Also ich"}, {"id": 819, "start": 6497.9, "end": 6505.62, "text": "als Azubi lerne natürlich auch alles mögliche drum rum. Die IT Strategien und alles. Aber"}, {"id": 820, "start": 6505.62, "end": 6510.9, "text": "der Fokus liegt definitiv auf den verschiedenen Programmiersprachen. Okay was denn? Was für"}, {"id": 821, "start": 6510.9, "end": 6515.3, "text": "Programmiersprachen? Das würde mich ernsthaft wenn ich mich da bewähren würde interessieren"}, {"id": 822, "start": 6515.3, "end": 6520.38, "text": "um was für Programmiersprachen. Mit dem kann ich mich ganz witzig auf das Motorrad drauf"}, {"id": 823, "start": 6520.38, "end": 6525.5, "text": "schalten. Das heißt wenn ich jetzt zum Beispiel einfach das Licht ändern will. Wow das ist"}, {"id": 824, "start": 6525.5, "end": 6530.42, "text": "ja krass. Boah. Und was kannst du noch damit achten? Eigentlich alles was das Herz begehrt."}, {"id": 825, "start": 6530.42, "end": 6535.94, "text": "Das ist quasi nur mal zum Testen für den Händler. Hey geht es noch? Geht die Lampe"}, {"id": 826, "start": 6535.94, "end": 6540.18, "text": "noch? Genau. Das wirkt überhaupt nicht gestellt. Du sag mal mit BMW verbinde ich eigentlich"}, {"id": 827, "start": 6540.18, "end": 6544.26, "text": "auch Autos. Kannst du mir da auch was zeigen? Klar aber dann solltest du besser zum Adriano"}, {"id": 828, "start": 6544.26, "end": 6552.86, "text": "gehen. Super mache ich. Danke dir. Also die müssen unbedingt sich mal einen besseren"}, {"id": 829, "start": 6552.86, "end": 6558.74, "text": "Video. Also generell diese ganzen Azubi Videos bisher die hatten immer zu leise Stimmen und"}, {"id": 830, "start": 6558.74, "end": 6566.1, "text": "zu laute Musik. Hey Adriano. Servus Easy. Du ich war schon gerade bei Melanie und sie hat"}, {"id": 831, "start": 6566.1, "end": 6569.26, "text": "gemeint dass du der Richtige bist wenn es um Autos geht. Na klar doch. Und er heißt"}, {"id": 832, "start": 6569.26, "end": 6577.06, "text": "Easy? Easy. Jawoll. Kannst du mir verraten was du in deiner Ausbildung so machst? Also"}, {"id": 833, "start": 6577.06, "end": 6580.3, "text": "das erste was ich mache ist ich lerne wie mein Softwarecoach schreibt und das machen"}, {"id": 834, "start": 6580.3, "end": 6583.7, "text": "wir um Aufgaben die voll von Menschen durchgeführt werden jetzt von Maschinen durchführen zu"}, {"id": 835, "start": 6583.7, "end": 6588.54, "text": "lassen. Das ist automatisch und geht einfach schneller. Das hört sich ziemlich komplizierter."}, {"id": 836, "start": 6588.54, "end": 6592.7, "text": "Konkretes Beispiel. Ich habe gerade eine App und programmiert es so dass sie sich selber"}, {"id": 837, "start": 6592.7, "end": 6602.86, "text": "ausführt und diese App kann am Ende mit dem Auto sprechen. Hä? Hä? Was? Nochmal. Oh"}, {"id": 838, "start": 6602.86, "end": 6618.86, "text": "Moment. Das habe ich jetzt nicht verstanden. Was? Nochmal. Nochmal. Das ist automatisch."}, {"id": 839, "start": 6618.86, "end": 6623.38, "text": "Moment. Na klar doch. Kannst du mir verraten was du in deiner Ausbildung so machst? Also"}, {"id": 840, "start": 6623.38, "end": 6626.58, "text": "das erste was ich mache ist ich lerne wie mein Softwarecoach schreibt und das machen"}, {"id": 841, "start": 6626.58, "end": 6630.02, "text": "wir um Aufgaben die voll von Menschen durchgeführt werden jetzt von Maschinen durchführen zu"}, {"id": 842, "start": 6630.02, "end": 6639.74, "text": "lassen. Also er programmiert irgendwelche Bandroboter oder wie oder was? Also spricht"}, {"id": 843, "start": 6639.74, "end": 6644.94, "text": "das was Leute früher am Fließband gemacht haben? Programmiert er jetzt quasi irgend"}, {"id": 844, "start": 6644.94, "end": 6651.74, "text": "so einen Greifarm der das macht oder sowas? Okay. Das ist automatisch und geht einfach"}, {"id": 845, "start": 6651.74, "end": 6656.06, "text": "schneller. Das hört sich ziemlich komplizierter. Konkretes Beispiel. Okay. Ich habe gerade"}, {"id": 846, "start": 6656.06, "end": 6662.38, "text": "eine App und programmiert es so dass sie sich selber ausführt und die. Ach jetzt kapiere"}, {"id": 847, "start": 6662.38, "end": 6673.38, "text": "ich das. Der testet die App beziehungsweise ne der testet die Steuerung für die für"}, {"id": 848, "start": 6673.38, "end": 6690.74, "text": "den Kram. Ich glaube jetzt kapiere ich das. Okay. Das ist das ist eine Test App die quasi"}, {"id": 849, "start": 6690.74, "end": 6696.3, "text": "checken kann ob mit dem Auto alles in Ordnung ist. Also keine Ahnung. Auto ist ist teilweise"}, {"id": 850, "start": 6696.3, "end": 6702.14, "text": "zusammengebaut. Dann wird das gestartet und das checkt dann ob das Auto nach dem selbst"}, {"id": 851, "start": 6702.14, "end": 6707.98, "text": "check sagt es ist alles okay. Irgendwie sowas in der Richtung. Das habe ich am Anfang echt"}, {"id": 852, "start": 6707.98, "end": 6712.42, "text": "nicht kapiert. Kann ich mir gar nicht vorstellen. Können wir uns das mal anschauen? Ja klar."}, {"id": 853, "start": 6712.42, "end": 6717.58, "text": "Super. Also was kannst du mir jetzt zeigen? Pass mal auf. Hat er gerade gesagt Alter."}, {"id": 854, "start": 6717.58, "end": 6724.34, "text": "Vorstellt können wir uns das mal anschauen? Ja klar. Super. Also was kann. Das sagt man"}, {"id": 855, "start": 6724.34, "end": 6730.06, "text": "doch heute gar nicht mehr. Das hat man gesagt wo ich jung war. Sind jetzt Boomer neuerdings"}, {"id": 856, "start": 6730.06, "end": 6740.5, "text": "schon 20 oder was? Heute hat man gesagt ey Digga. Oder. Ach der sagt also. Ach so. Ach"}, {"id": 857, "start": 6740.5, "end": 6749.38, "text": "ich dachte er hat gesagt ich habe gesagt Alter. Digga zeig mal her. Kannst du mir jetzt zeigen?"}, {"id": 858, "start": 6749.38, "end": 6754.42, "text": "Pass mal auf. Boah jetzt hast du mich aber erschrocken. Ja Hupen machen wir eigentlich"}, {"id": 859, "start": 6754.42, "end": 6757.62, "text": "normalerweise nur um das Auto auf dem Parkdeck wenn wir es nicht mehr finden eben wieder"}, {"id": 860, "start": 6757.62, "end": 6760.94, "text": "zu finden. Aber ich kann zum Beispiel auch aufsperren und zusperren. Heißt jetzt kannst"}, {"id": 861, "start": 6760.94, "end": 6764.22, "text": "du mit deinem Handy jeden BMW aufsperren? Ja so einfach ist es nicht. Wir haben natürlich"}, {"id": 862, "start": 6764.22, "end": 6767.66, "text": "eine Baujahr. Würde ich jetzt auch sagen. Würde ich jetzt auch sagen. Das heißt ab"}, {"id": 863, "start": 6767.66, "end": 6770.54, "text": "einem bestimmten Baujahr gibt es nur und der Fahrer muss das bestätigen. Das ist echt"}, {"id": 864, "start": 6770.54, "end": 6776.66, "text": "ein nicer Wagen ist aber nicht dein. Da ist aber kein Fahrrad drin. Doch. BMW bekommen"}, {"id": 865, "start": 6776.66, "end": 6780.26, "text": "wir als Azubis direkt günstige Konditionen so dass wir die Abstart mieten können. Hammer"}, {"id": 866, "start": 6780.26, "end": 6786.22, "text": "darf ich mal in der Runde drehen? Ja klar. Ich wusste dass jetzt Musik kommt. Ich habe"}, {"id": 867, "start": 6786.22, "end": 6797.86, "text": "es geahnt. Das war jetzt eine geile Fahrt. Vielen Dank Adriano und vor allem vielen Dank"}, {"id": 868, "start": 6797.86, "end": 6802.66, "text": "BMW für den coolen Tag. Und jetzt nochmal für euch die wichtigste Zeit zu mitschreiben."}, {"id": 869, "start": 6802.66, "end": 6806.02, "text": "Ich wollte gerade sagen weil man muss sagen wirklich viel erfahren hat man in dem Video"}, {"id": 870, "start": 6806.02, "end": 6811.94, "text": "jetzt nicht. Die Ausbildung dauert drei Jahre die ihr allerdings verkürzen könnt. Ausbildungsstart"}, {"id": 871, "start": 6811.94, "end": 6815.7, "text": "ist immer im August oder im September. Bewerben könnt ihr euch allerdings ein Jahr im Voraus."}, {"id": 872, "start": 6815.7, "end": 6826.62, "text": "Okay das ist jetzt. Jetzt hätte BMW wahrscheinlich gerne. Aber ich kenne genug die sich nicht"}, {"id": 873, "start": 6826.62, "end": 6834.22, "text": "ein Jahr im Voraus bewerben. Das hätten die alle gerne. Aber das kommt oft genug vor"}, {"id": 874, "start": 6834.22, "end": 6843.06, "text": "dass es die Leute nicht machen. Ja ja ich weiß ich sage ja das hätten die gerne. Aber"}, {"id": 875, "start": 6843.06, "end": 6852.42, "text": "es kommt oft genug vor dass das nicht praktiziert wird. Okay es kann ja sein dass BMW das macht."}, {"id": 876, "start": 6852.42, "end": 6857.38, "text": "Und BMW sagt wenn du es nicht machst dann nehmen wir dich halt nicht. Es ist ja denen"}, {"id": 877, "start": 6857.38, "end": 6859.18, "text": "ihr gutes Recht. Die können ja machen was sie wollen."}, {"id": 878, "start": 6859.18, "end": 6879.1, "text": "Okay das heißt das finde ich schon mal ganz gut. Das heißt sie sagen damit nämlich auch"}, {"id": 879, "start": 6879.1, "end": 6885.7, "text": "wir bilden das aus weil wir das brauchen. Das ist tatsächlich gut in München weiß"}, {"id": 880, "start": 6885.7, "end": 6893.58, "text": "ich es nicht. Aber das ist ordentlich ja. 1000 Euro nicht? Nö. Also ehrlich gesagt"}, {"id": 881, "start": 6893.58, "end": 6899.66, "text": "keine Ahnung wie es jetzt aktuell ist. Aber 1000 Euro im ersten Ausbildungsjahr klingt"}, {"id": 882, "start": 6899.66, "end": 6904.58, "text": "richtig gut. Ich meine worauf wartet ihr noch? Hier ist der Link für alle weiteren Infos."}, {"id": 883, "start": 6904.58, "end": 6909.82, "text": "Ich hoffe euch hat das Video gefallen. Bis zum nächsten Mal. Peace. Peace. Okay ich"}, {"id": 884, "start": 6909.82, "end": 6914.62, "text": "habe null erfahren wie das bei BMW so ist nach dem Video. Dann fand ich ohne Scheiß"}, {"id": 885, "start": 6914.62, "end": 6919.46, "text": "von den ganzen Videos die wir bisher geguckt haben heute. Da fand ich die Relax Days eigentlich"}, {"id": 886, "start": 6919.46, "end": 6925.9, "text": "am besten. Da wo der Chat gesagt hat null Cringe. Das war eigentlich super. Die hat"}, {"id": 887, "start": 6925.9, "end": 6933.82, "text": "einfach nicht um den heißen Brei herum gelabert. Die hat einfach gesagt wie es ist. Max Silbermann"}, {"id": 888, "start": 6933.82, "end": 6938.46, "text": "fünf Monate dankeschön für den Sub. Leute habt ihr mal auf die Uhr geguckt. Wisst ihr"}, {"id": 889, "start": 6938.46, "end": 6964.66, "text": "was das heißt? Korrekt. Guckt er schläft schon. Also Leute wir sehen uns dann. Nächsten"}, {"id": 890, "start": 6964.66, "end": 6969.9, "text": "Streben. Bis dann war es gut. Outro Musik noch. Bis dann. CU."}]}