{"text": "So, ich muss erst noch mal einen zweiten Rechner anmachen, also ich sehe noch keinen Chat oder sonst was, weil doch, ich habe hier eine Vorschau. Dann soll ich noch mal einen Streaming Rechner anmachen, sonst sehe ich nämlich überhaupt nichts. Aber ich habe mir gedacht, nachdem Twitch ja eh immer eine ganze Weile braucht bis Notifications rausgehen, dann machen wir das jetzt schon mal an. Passwort vertippt. Ich hoffe jetzt richtig. Ich könnte bis mein Rechner gestartet ist gar nicht auf dem Tablet gucken, was im Chat passiert, falls schon jemand am Start ist. Es ist schon jemand am Start. Und haben wir zufällig Quality Options, das muss ich jetzt noch gerade mal nachgucken hier auf dem Tablet. Ja, das ist ein bisschen der Nachteil, wenn man seine Festplatte voll verschlüsselt hat, was ich als komplett paranoider Informatiker natürlich habe. Dauert es ein bisschen bis die Rechner gestartet sind. Wublox Kanäle, da ist er. Bis ich das im Tablet eingegeben habe, ist mein Rechner auch gestartet. Guck mal, das hat noch nicht mal erkannt, dass ich angeblich online bin. Ah, egal. Jetzt der Rechner eh an. Oh Gott, die Tastatur wieder umstöpseln. Ich kann nur Weihnachtsmusik anmachen. Ist ja schon kurz davor. So, Chrome aufmachen. Jetzt sehe ich gleich was. So, jetzt habe ich auch Chat. Also wenn schon einer da ist, jetzt sehe ich euch, jetzt habe ich Chat. Jetzt haben wir Quality Options. Wir haben Quality Options, Alter. Twitch will es wissen, ey. Da habe ich ja noch weniger Grund, Partner zu werden. Außer Twitch Money. Wenn ich jetzt auch so schon immer Quality Options kriege. All die Musik geht mir auf den Sack, haben wir nicht sonst was. Oh, wir mussten ja noch, ich habe es euch ja gestern versprochen, dass wir Till Lindemann Features Haftbefehl gucken. Da müssen wir jetzt noch durch, ja. Ich weiß nicht so genau, was mich da erwartet. Was ist mit der Maus los? Fuck. Was ist das? So, ich muss jetzt den Sound glaube ich eh ein bisschen lauter machen. Dass man die Kickstarter Videos hört. So, machen wir schon mal ein Spiel auf. Und dann konnte man, wie konnte man den Kram jetzt ordentlich filtern? Das ist, ich finde die Kickstarter Seite ist teilweise ein bisschen sortiert nach, weitere Filter. Man konnte das nämlich sortieren nach Spiele Hardware, nach Spiele Software, nach Offline Spielen und so was. Projekte, Beiträge, sortieren nach, Zufall. Wo ging das denn jetzt noch? Ah, hier. Hardware Videospiele. Spiele. Moment, Videospiele, da. Handyspiele. Igitt, es gibt eine eigene Kategorie für Handyspiele. Ah, man kann keine Tabs aufmachen. Dann fangen wir heute mal an mit Hardware für Videospiele. Und es geht los. Geht schon gut los. Der erste Performance verbesserte Gaming Handschuh. Was nicht alles gibt. Okay. Da gucken wir aber noch mal drüber. Da gucken wir aber noch mal drüber, weil eigentlich, eigentlich will ich ja Videospiele gucken. Hier, also da, die Kategorie. Warte mal, wo ist die wieder? Das ist alles versteckt, hier. Da. Gummis Box. Schauen wir mal. So, ich poste den ganzen Krempel noch mal kurz auf Twitch. Auf Twitter. Die Streammusik kann sich nicht entscheiden. Guck mal, ich hab die schon, ich hab die schon übelst geboostert, die Streammusik, ey. Man weiß nicht, Windows und Sound verträgt sich eh nicht so gut. Ist eigentlich mein Titel richtig? Kickstarter Projekt Refuse Server 2019, ja, das passt. Das passt. Oh nee, ich hab wieder indische Tastatur. Ich wollte grad sagen, warum schreibe ich auf Twitter so merkwürdige Zeichen. Mein Windows stellt sich immer, hier hab ich es mittlerweile gefixt, ne. Aber beim anderen Rechner hab ich teilweise auch immer indische Tastatur eingestellt. Ich weiß nicht warum, nicht dass ich jemals indische Tastatur installiert hätte. So. Tweet ist raus. Was sagen denn die Twitter Trends? Guten Rutsch, äh, sind nicht ein bisschen früh. KronkTV, Biathlon, GZS, äh, was denn alles Trend... Haha, so schlimm. Es trendet der kleine Lord und irgendwie hab ich grad schon wieder gleich Drachenlord gelesen. Nicht dass mich das auch nur ansatzweise interessieren würde, was bei der ganzen Geschichte läuft. Aber, ähm, man sieht's halt oft auf Twitter. Moin Leute. So, ähm, jetzt gucken. Ah, noch was zu trinken am Start. Also ich glaub wir müssen dann eh die Musik ausmachen, weil wir Kickstarter Videos gucken. Also, was geht's denn... Warte, Sekunde. OKS? Oh, ganz wichtig, ganz wichtig. Ich hab ja was, ich hab ja was essenzielles vergessen. Was ganz wichtiges hab ich vergessen zu starten. Ohne geht's ja schon mal gar nicht. Nämlich die Web Application 11. Ohne die Web Application 11 läuft nix hier. Web Application 11, beste. Was hab ich jetzt? Jetzt hab ich auch noch falsch gestartet, die Web Application 11. So, wenn ich jetzt Glück hab, reagiert Visual Studio mal wieder. Und wenn ich Pech hab, wow. Alter, Visual Studio nervt doch nicht so rum. Was ist denn hier los, schon wieder. Ich hab's extra ohne Debugging gestartet, ja. Wenn ich was ohne Debugging starte, Visual Studio, dann erwarte ich... Warum, warum? Alter, was ist das, warum hängen das? Was ist denn da schon wieder los, hä? Unable to connect, tja, das ist eben mein Problem. Dann lass ich Visual Studio halt auf. Da hab ich drauf. Ich darf drauf, nice. Okay, funktioniert alles. Jetzt die Musik abgekackt, zwar zu viel. Oh, ja, wir können übrigens, also wie gesagt, wir können Weihnachtsmusik anmachen, wenn es euch danach ist. Ich hab mir extra was rausgesucht, was nicht so nervig ist. Relaxing, ich glaub, das ist zu relaxing. Aber den hier mal wieder an. Das ist auch schon ganz schön relaxing. Wir brauchen was nicht ganz so relaxing, Hip-Hop-Beats. Nee, das ist zu wir. Christmas-Hip-Hop-Radio. Ich weiß nicht. Wie ist denn so die Lautstärke von dem? Nee, das ist ja auch sehr nervig. Chill-Out-Radio, das klingt doch gut. Ja, gut, ob das jetzt irgendwie über die Kühe fliegen ist mir jetzt nebensächlich. Guck mal, meine Maus ist übelst kaputt. Habt ihr es gesehen? Ich leg hier rein, zieh das hoch und dann... Dann tracken. Die YouTube mal wieder verbackt. Lull. Aber das ist ja nichts Neues. Kann ich sogar wieder ein bisschen leiser machen. Easy. Easy. Ah so, easy. Easy. Was hast du für eine Maus und Tastatur? Nachdem ich die letzten paar Jahre für meine Verhältnisse viele Mäuse ausprobiert habe, bin ich jetzt hängen geblieben bei einer Logitech G403. Die Kabelvariante. Und auf der Arbeit habe ich eine Ducky One Skyline Tastatur. Und daheim habe ich eine Corsair Platinum K95. Und die Software, ich sag's euch, die Software von dieser Tastatur, ich zeig euch das mal, da fallen mir die Haare vorn aus. Allein schon das wieder. Was hat es denn jetzt schon für Probleme? Was genau hat es für Schmerzen? Profiled Conflict. To resolve conflict, click yes. Nee, click save. Das war's jetzt oder was? Also guck mal, das ist auch schon übelslam. Du klickst hier drauf, es braucht eine halbe Stunde bis es geswitcht ist. Ganz ganz schlimm. Also diese Corsair Software ist wirklich grausam. Ganz ganz grausam. Also wirklich wirklich grausam. Aber man kann jetzt natürlich irgendwie diese komischen Lightning Effekte anmachen, die irgendwie nicht an sind. Doch, jetzt sind sie an. Man kann, was ich ganz cool als Effekt finde, ist Puls, war es glaube ich. Ja, da pulst die Tastatur so vor sich hin. Das ist eigentlich ganz nett. Wobei es auch wieder verschenkt ist Potenziales letztendlich. Oh, das hab ich noch nie hochgedreht hier. Oh, da drehst du ja ab bei. Kommst du dir ja vor wie im Krankenwagen. Wobei auch schon ein bisschen hier die Chance verschenkt ist, dass man hier beispielsweise sagen kann, ich will alle farm plus, ich will eine rauslassen. Also die Corsair Software ist wirklich scheiße, muss man echt sagen. Und Advanced gibt lustigerweise weniger Optionen. Guck, das ist die Auswahl für Advanced und das ist die Auswahl für Basic. Easy Advanced. Ich dachte eigentlich immer Advanced ist Basic und mehr. Aber bei Corsair ist das anders. Die Tastatur ist halt richtig cool. Also das Spielen macht hier mit wirklich Spaß. Tippen geht halbwegs, aber ich hab das Gefühl, die Tasten sind ein Millimeter kleiner als bei anderen Tastaturen. Das bringt mich oft aus dem Konzept. Deswegen seht ihr mich in letzter Zeit auch oft zu extrem verdrücken, wenn ich irgendwas schreiben will. Ihr erinnert euch ja noch hier dran. Wenn ich anfangen will, Kinsle, die Konsole. Ja, funktioniert nicht. Und das liegt an der Tastatur. Ja, und auf der Arbeit hab ich mir extra hier noch eine geholt. Und die ist zum Schreiben und vom Gefühl her eigentlich viel nicer. Nämlich die da. Ich glaub das ist aber eine Two oder so, die ich hab. Genau. Die mit Nummer. Ich bin NumBlock-Fan. Ich mag NumBlocks. Die hat auch so schöne Beschichtung oben. Oder generell sind die Tasten bei der aus Plastik, was sich ein bisschen rauer anfühlt. Das macht insgesamt einen besseren Eindruck. Und auf jeden Fall, was man mit beiden Tastaturen kann. Wenn der Eintrecher einen nachts überrascht und man sitzt auch am Rechner, dann kann man ihn mit der Tastatur easy ownen. Die Tastaturen sind wirklich schwer. Die kannst du als Waffe einsetzen. Die sind gefährlich. Beide, beide. Die hat unten auch ein bisschen ein Polster dran. Und die Tasten sind halt bei der hier zum Schreiben und zum Arbeiten richtig cool. Und zum Spielen sind die Tasten hier schon ein bisschen mehr responsive. Das merkt man. Zumindest bild ich mir das ein, dass man das merkt. Aber an sich macht es irgendwie einen billigeren Eindruck, obwohl es teurer ist. Komisch eigentlich. Naja. Gut, da sind wir stehen geblieben. Genau, Kickstarter. Haben wir jetzt schon sortiert, das Ganze. So, wir haben sortiert nach Spielen. Wir haben sortiert nach Hardware. Leute, seid ihr bereit für den World First Performance Enhancing Gaming Glove? Seid ihr bereit für den Handschuh, der eure Performance, euer Aim, eure KD, eure 360 Noscopes und Quickscopes verbessert? Ich mach mal kurz Musik aus. Eigentlich brauchen wir keine Musik, weil wir Kickstarter haben. Gucken wir uns das Ganze mal an. Ihr müsst mir gleich nochmal sagen, ob die Lautstärke okay ist. Also, World First Performance Enhancing Gaming Glove. Video? The gaming industry is growing bigger and bigger every day. Millions of people are using a computer mouse for gaming and encounter the discomfort of high friction against the mouse pad and the lack of stability while maneuvering the mouse. Because of this, gamers around the world are performing worse and suffer from injuries. Moment, was? Moment, Moment. Warte mal, das muss ich mir nochmal hören. The gaming industry is growing bigger and bigger every day. Millions of people are using a computer mouse for gaming and encounter the discomfort of high friction against the mouse pad and the lack of stability while maneuvering the mouse. Because of this, gamers around the world are performing worse and suffer from injuries. Seriously? Ich hatte noch nie, also ich hatte noch nie Injuries dadurch, dass ich mir die Hand am Mousepad aufgerieben hab oder so. Ich bin immer auf einem hohen Niveau und versuche immer, mein Gameplay zu verbessern und mich nicht zu verletzen. Während der letzten 2 Jahre habe ich versucht, eine Lösung zu finden für die Probleme, die die Gamer täglich im Computer haben. Und ich bin so glücklich, die World's First Performance Enhancing Gaming Glove zu zeigen. Das sieht aus wie eine Schiene, wenn man sich den Arm gebrochen hat, ein bisschen. Aber eben die Idee ist gar nicht so blöd. Das ist nicht verkehrt. Wenn es zu waffe ist, kannst du dir auch ein Ei draufbacken. Die Musik? Das sieht aus wie so ein thrombose-Stropf. So was hat mein Opa auch immer. Alter, take my money! Oh, das ist schon richtig übel. Nice, guck mal hier. Der wollte 9.730, so krass kalkuliert, nicht einfach 9.000 oder 10.000. Nein, 9.730. Wobei, das könnte sein der Umrechnungskurs. Ach, das sind Schweden, Schwedische Kronen oder sowas. Auch wenn ich so meine persönlichen Zweifel habe bei solchen Produkten, dass das wirklich immer so geil ist, wie es angepriesen wird. Aber das finde ich nicht schlecht. Ich poste das euch mal rein. Ich finde das nicht schlecht. Ich meine, im schlimmsten Fall bringt es nichts. Was soll denn der Spaß kosten am Ende? Sleeve Early Bird kostet 25 Dollar, das geht doch sogar noch. Oh, da müsst ihr euch aber... Guck mal, und das gibt es schon im Februar. Das kann man becken und dann gucken, was Sache ist. Eigentlich gar nicht. Ich glaube, das werde ich becken nachher. Ich glaube, da gebe ich nachher meine Kohle für aus. Haben wir nicht irgendwie mal ordentliche Hintergrundmusik? Best Zelda Music Compilation. So, alles. Wir machen Zelda-Dings die 20, 20... Die ist übelst nice. Die ist mega nice. Die geht leider nur 45 Minuten. Ach so, ich sollte vielleicht mal ein bisschen lauter machen. Kirby Musik. Oh ja, Kirby Musik, endlich. Hat man schon so lange nicht mehr. Gefühlt schon Monate nicht mehr. Kirby Gummy Race 10 Stunden. Bäm. Endlich wieder. Oh, das ist gut. Das ist gute Hintergrundmusik. Beste. Weiß jemand zufällig, wie man am dümmsten Daten von einem iPhone auf einen OnePlus überträgt? Also am dümmsten wahrscheinlich über irgendeinen Cloudsync oder so. Okay, der Gaming-Sleeve. Ich hab's noch in den Chat gepostet. Oh, das sieht... Ich find's von der Idee her gar nicht so schlecht. Das ist jetzt wirklich meine Gaming-Performance so krass enhanced, wie sie sich das hier erzählen. Ich hab so meine Zweifel dran, aber von der Idee her ist das mal wenigstens was Neues. Und nach den ganzen Gaming-Utensilen, die wir uns in letzter Zeit so angeguckt haben, zum Beispiel Gaming-Tische, die komplett useless waren, dann doch lieber sowas. So. Und man kriegt schon welche Early Bird-Sleeve hier. Hat sich... Die Währung hat sich umgestellt. Warum hat sich die Währung umgestellt? Moment. Ah nee, hier. 25 Dollar gibt's einen. Guck mal, da sind nur noch 6 Stück übrig. Da müssen wir jetzt theoretisch... Können wir das vielleicht in Deutsch... Können wir das nicht mal umrechnen irgendwie? Also nach Deutschland kostet es wie viel? 29 Euro. Okay. Naja. Kann man machen. Gut, nice. Next. Game Attack. Customize your game. What? Professional Controller, Custom... Na, das kommt man uns nicht an. Das ist irgendwie... Was soll das überhaupt sein? Hm? Ach so, man kann irgendwie das gleiche Teil an jetzt irgendwie einen Gamecube-Controller machen. Das soll ein Gamecube-Controller sein. Warum? Warum? Was mache ich damit? Wozu brauche ich das? Weiß ich nicht. Bonus-Tracking da ist wohl. Okay, das ist für Leute, die Offline-Games spielen vielleicht nicht schlecht. So, ähm... Wer braucht so ein Gamebook? Mobile, Playstation, Xbox, Laptop for everybody. Moment, die können nicht einfach Playstation, Xbox-Dinger verkaufen? Es sei denn... Das Ding sieht ja mal mega hässlich aus. Was soll das? Bei Optik eigentlich fast egal. Wobei man einfach Dinge an den tragen kann. Arduino Game Boy. Braucht man eigentlich auch nicht. Nintendo Switch Pro Controller Joystick Fix. Was muss man am... Was muss man daran fixen? Weiß das jemand? Hallo Video? Oh, High Quality. High Quality Render. Ich sehe es schon hier. Was geht? Ohne. Kirby muss mal aus. Ist das echt so? Na gut. Das war der N64-Controller, der ist dick. Da war wirklich crap das Ding. Die Musik? Das braucht doch kein Mensch, oder? Braucht man das? Okay, das ist im Prinzip einfach ein Metallring. Next. Arcana wäre nichts für mich. Oculus Rift. Gibt es mal wieder was? Ach nee, die werde auch mal entgehen. Danach kriegt glaube ich keinen Hahn mehr. Das ist schon wieder voll vorbei. Oh, das muss ich mir einem Kollegen schicken, weil ich weiß nicht ob ich es mal im... Ob ich mal im Stream erzählt habe, aber ein Kollege von mir ist dabei, so eine Arcade-Gaminghalle zu bauen. So mit solchen Dingern hier. Und das muss ich ihm mal zeigen, vielleicht ist das ja was für den. Da muss ich dann irgendwann mal, wenn das Ding fertig ist, muss ich dann auch mal ein bisschen Promotion machen, aber das dauert noch. So, ich glaube, Hardware-Projekte haben wir genug geguckt, da ist jetzt nichts sonderlich Geiles dabei. Der Gaming-Glove war natürlich wieder das Highlight jetzt hier. Kleiner Favorit, ich bin nicht eingeloggt. Ich kann mich jetzt auch hier ausdrücklich einloggen. Okay, gucken wir mal Gaming-Projekte. Was gibt es denn hier? 96 Projekte? Moment. Warum nur 96 Projekte? Ich habe irgendetwas verkehrt sortiert. Spiele. Projekte in Spiele erkunden. Spiele. Das Textartal, die Sortierfunktion ist ganz, ganz merkwürdig. Videospiele. 12.000 Projekte. Okay. Und witzigerweise, die Sucheinstellungen sehen genau gleich aus. Sortiert nach... Was ist denn da? Was meint ihr jetzt am besten? Beliebtheitsortieren oder Erscheinungsdatum? Oder Datum bis Ablauf? Oh, Enddatum. Oh nein, Graphic Novels wieder. Please! Nicht schon wieder! Das letzte Mal hat er halbe Stream aus irgendwelchen... Aja, ja! Wo ist das sein? Immer! Der war eine krasse Weepshit. Sag mal, macht diese Graphic Novel Geschichten, macht das kein großer Hersteller? Weil, das kann doch nicht sein, dass die Dinger so übertrieben beliebt sind. Ich verstehe immer noch nicht... ... warum das hier so unterschiedlich ist, die Kategorie. Zu null! Okay, dann gucken wir uns erstmal diese Seite an, weil die hat hier nur 6 90 Projekte. Und weil wir jetzt halb auch immer... Okay, Team Favorite. Ach, das sind quasi Recomment oder sowas, ne? Weil das Team Favorite Games sind, oder auch nicht? Okay, Leute, seid ihr bereit für den krassen Weepshit? Enddatum. Oho, ganze 480 Euro möchte er haben. Pixel... wie, da gibt es überhaupt kein Weepvideo zu? Bei dem habe ich live und beim anderen nicht? Ja, was ist live überhaupt? Live. Was ist live? A new way of bringing creative projects alive. Moment, sind das Typen, die irgendwie streamen oder so? Ach, das sind die Typen, die live streamen. Das heißt, der Dude hier ist am live streamen. Sehe ich das richtig? Oder auch nicht? Ach, keine Ahnung. Kickstarter. Ja, färben ganz einfach. Okay, das müssen wir uns hier angucken, die haben kein Video. Projekte ohne Videos finde ich doof. Das sieht mir aber nach... So wie es 100.000 Stück auf Kickstarter gibt. So, Winter Wanderer. Science Fiction Travel Action RPG. Gucken wir mal. Die Videos kacken übelst ab, ne? Die brauchen voll lang zum Laden. Oh, schon mal nice Grafik. WTF. Das ist aber ganz schön bauchfrei. Das ist wichtig, hier ist man besonders gut gepanzert. Was, was, was genau gucke ich mir da an? Oh, Band, Band, Monkathos. WTF. Ich weiß ja nicht. Na, ich weiß nicht. Da passiert da noch mal irgendwas. Oh, das ist eher Puzzle. Puzzle, Puzzle. Oh, Fight. Krasser Fight. Bäm, weggeslided. Okay, um was gehts denn eigentlich? Was wollt ihr uns sagen? Wie sie abliest. Okay, um was gehts? Das sah absolut nicht nach Zelda Classic Gameplay aus. Absolut nicht. 2018er Playstation Awards Spanien nominiert. Wenn ich mir angucke, was für die komischen deutschen Gaming Awards da immer nominiert ist, dann heißt es erstmal gar nichts. Okay, ich hab keine Ahnung, was das sein soll. Außer, dass es angeblich Zelda Style ist und... Ja, die anscheinend wohl auch schon mal ein Game gemacht haben. Ich hab keine Ahnung. Nicht meins. Okay, nächst. Ruins to Rumble. Das ist noch mehr Pixels. Wisst ihr, 10 Pixel waren zu viel. Wir sind bei einem Pixel angekommen. Mein Sound ist nicht kaputt. Das hat keinen Sound. Ich werde... Was ist das denn? Ich werde mal den passenden Sound kurz einplatten. Was? Was seh ich da überhaupt? Er kann Baumstämme aneinander bauen oder Holzdinger aneinander und dann schweben sie in der Luft. Und das ist so Terraria Light oder... Pavillion Man. Ja, das können wir machen am Ende des Jahres. Das schreib ich mir mal auf. Okay, ich hab keine Ahnung, was in dem Game gehen soll. Aber es sieht jetzt nicht so exciting aus irgendwie. Das sieht mega langweilig aus. Was machen die da überhaupt? Was geht's da? Frederico. Das ist der von Miracoli. Okay. Er hat einen Ausruf. Hat er eine Quest oder wie? Oder was? Oder warum? Das ist absolut nichts. Okay, keine Ahnung. Ruhige Zuhörer. Für 591 Euro. Easy. Also, wenn ihr das becken wollt, da. Okay, next. Tactic... Tactic... Ach, das Game heißt Tactics. Ich hab's... Der Satz ist einfach. Tactics. A turn-based video game for PC, Mac and Linux. Er möchte 32K haben. Da gucken wir doch mal für was. Kein Video. Vielleicht ein bisschen optimistisch. Sound... Oh, es gibt auch schon ein Battle-Theme. Hauptsache Chor. Das haben die sich doch garantiert aus irgendwelchen Stock-Dingern zusammen gemixt, oder? 100 Pro. Oder es ist von irgendeinem Studio gekauft. Es gibt ja mittlerweile relativ viele Studios, die so Jailer-Musik und Gedöns basteln. Okay, weiter geht's mit... Ich hab erst Rocket Penguin gelesen. Pocket Penguin. Gameboy-Style Adventure. Oh, viel zu laut. Die Musik gefällt mir. Das ist stylish. Irgendwie gefällt mir das. Wobei ich keine Gameboy-Spiele mag, in der Regel. Die Musik geht ab. Ich würde mir den Soundtrack kaufen, nicht das Spiel. Okay, was man in dem Game genau macht, erschließt sich mir nicht so richtig. Das ist auf der einen Seite ein bisschen so Jump'n'Run-mäßig und dann irgendwie so Bomberman. Weiß nicht. Und zwischendurch auf Penguin. Alles klar. Sound hat mir gut gefallen. Die Demo muss ich nicht spielen. Ich glaube nicht, dass mir das Game vom Gameplay her gefällt. Denn ich muss auch dazu sagen, ich bin eigentlich kein großer Fan von Gameboy-Spielen. Ich hatte zwar einen Gameboy und ich hab auch relativ viel Gameboy damals gespielt, aber es war auf dem Gameboy bis vielleicht auf Link's Awakening eigentlich nichts dabei, wo ich jetzt sagen würde, oh, da erinnere ich mich gern dran. Ich war kein großer Pokemon-Fan. Das ist für mich schon mal rausgefallen. Und die anderen Sachen, die es da sogar gab... Ich meine, das Mario auf dem Gameboy war übelster Crap. Also das erste. Das zweite war dann auch schon ganz okay. Noch nicht. Aber das müssen wir nachher machen noch. Ich hab's ja gestern versprochen. Wir gucken uns das an. Okay, weiter. Nee, das hatten wir schon. Okay, Snow Ash Land. 2D-Multiplayer-Top-Down-Shooter-Game. Schon 200 Euro. Du hast eine Musik, wo du denkst, jetzt kommt gleich das übelst geile, was weiß ich, Raumschiff reingeflogen. Irgendwas super Geiles. Und dann fährt dann irgendwie so ein 2D-Panzer rum. Nee, das kann 2D-Panzer. Das ist ein Typ. So quasi Contra von oben. Okay, mit Craft-Elementen. Es braucht jedes Game heute Craft-Elemente. Und Survival-Elemente natürlich auch. Das geht nicht ohne. Oh, diese Immersion. Das sieht jetzt ehrlich gesagt ein bisschen langweilig aus. Ich meine, es gibt ja auch 3 Milliarden Spiele dieser Art jetzt. Das ist schon Resilience-Liefer. Das gefällt mir nicht. Aber sie haben sich mit dem Trainland zumindest so weit Mühe gegeben. Ja, das stimmt. Das hab ich mir auch gerade gedacht. Die Musik passt dazu. Oh, hier wird's gecraftet. Und es werden Wege gecraftet. Hast du schon was zum Epic Store gesagt? Nee. Muss ich mal kurz einladen. Ich find das gut, dass Steam da Konkurrenz kriegt. Und sie geben ja auch mehr an die Entwickler ab. Also ich find das nicht schlecht. Okay, der Trainer haben sich Mühe mitgegeben. Was haben wir als nächstes? Crime? Oh, Weep-Kram wieder. Eine Visual-Novel. So viele. Da gibt's so viele von. Warum gibt's da so viele von? Und warum bockt sie sich ins Gesicht? Man weiß es nicht. Ja. Wir müssen uns eigentlich gar nicht den Trailer angucken. Die sind alle gleich. Die sind alle gleich gefüllt. Nee, ich will mir nicht heute wieder einen ganzen Tag Brischel-Novel-Trailer angucken. High-Quality-Pixel-Art sieht man hier schon mal. Der hat sich auch gedacht, wie der letzte. Warum nicht mal ein Bild mit 10 Pixel machen, wenn die anderen 300 nehmen? Was genau geht da ab? Boah, HD. Moment, diesen Effekt, den müssen wir uns gerade noch mal angucken. Achtung. Ich mein, HD ist vielleicht jetzt auch ein bisschen overrated. So ein bisschen vielleicht. Ich mein, okay, hier konnte man auch irgendwie sagen, er wollte einfach möglichst minimalistisch das machen. Dafür ist es okay. Und hier muss man jetzt sagen, das sieht kacke aus. Das tut mir leid, aber irgendwie. Ach nee, ich weiß nicht. Zum Gameplay kann ich nichts sagen. Moment, was? Er benutzt Visual Studio Community Edition. Da kann man schon mal sagen, er hat sich zumindest das Richtige ausgesucht als Entwicklungsumgebung. ArcadeCon. Moment, das hatten wir das letzte Mal schon. Das ist irgendwie so eine Messe, wo schon ein Euro gespendet wurde. Ein Dollar von 87. Nice. Die Leute scheinen da super scharf drauf zu sein, hinzugehen. Das ist entweder Zombie Survival oder ein Battle Royale Game. Sieht schon irgendwie so aus. 66 Euro von 350.000. Jetzt geht es aber ab hier. Schauen wir mal. What the fuck? Er hat ein paar Presets genommen und in die, äh, nicht Presets, Prefabs genommen. Das war's? What the fuck? DTF? But why? 66 Dollar sind schon gebacked. Moment, das ist ein deutscher Entwickler, oder? Das ist ein deutscher Text. Jetzt fehlt eigentlich noch Battle Royale. Survival, Crafting, Dinosaurier, Battle Royale, Jagdgame. Für den PC werden, welches die Möglichkeit bietet, Strukturen auf der Insel zu bauen. Und das Jagen nach Dinosaurier. Stegosaurus vs. Uttaraptor. Ja, wir haben uns quasi den, was ist denn das, ne, das ist Unreal, wir haben uns den Unreal Editor genommen und ein paar Demo-Dinger drauf gebaut und uns einen Dinosaurier-Model gekauft. Easy clap. Death by Bacon. Es wird immer hochkarätischer, klar, gerade. Immer hochkarätischer heute. 8K für Death by Bacon. Okay, es ist zumindest nicht RPG Maker, das ist schon mal nicht schlecht. Okay, was haben wir hier zu bieten? A Comedy Metrovania Game. Im Weep-Style, jawoll, kein Video, doch. Und der Rock, der wippt aber ganz schön. Alle die Sounds. Alle die Sounds. Das Video hängt nicht, das Game hängt. Genau, gucken wir uns da gerade an. Okay, kommt da noch was? Wir gucken uns jetzt mal die YouTube-Bewertung an, was die Leute da so zu schreiben. Oh, die finden das alle klasse. Ich meine, es sieht zumindest optisch besser aus als die Games vorher, was absolut keine Kunst ist, wenn man sich das hier so zum Beispiel anguckt. Burst Soccer und ein realistisches Fußballspiel. Okay, kein Video, nichts, sehr fein. Resident Evil-like Game. Okay, da muss man gucken. What? Okay, die Italiener sind am Start. Das sind Italiener, oder? Was? Was geht ab? Wie das der Trailer? Oh, jetzt kommt noch was. Krasse Kiai. Aber was ich geil finde, die reden voll überzeugt. Hört euch, das war so. So voll überzeugt, ey. Ich meine, es sieht zumindest optisch nicht ganz so schlimm aus wie der Rest vorher. Die Laufanimation ist schon absolut die Weltklasse, die Laufanimation. Aber man muss jetzt mal dazu sagen. Hätte man sowas vor ein paar Jahren gezeigt, würde man sagen, zumindest technisch haben sie was drauf. Das kann man heute aber gar nicht mehr so sagen, weil du nimmst dir irgendwie einen Unity oder einen Unreal, lädst du dir runter und das Game sieht halt, wenn man halbwegs kompetent ein ordentliches Level baut, das sieht halt gut aus. Dann kaufst du dir aus dem Shop noch ein paar Models und dann sieht das halt einfach ganz gut aus. So einem guten Game macht es das natürlich noch lange nicht. Okay, die wollen einfach mal 100k, easy, clap, 100k, kein Ding. Okay, weiter geht's. Echoes VR. Oh, die sind schon ziemlich, ziemlich weit gebacked. Nein, hab ich nicht. Okay, man sieht alle rumgewackelt schon, das ist ein VR-Game. Mein Ancient Distrier. Das stimmt. Das Interface erinnert mich ein bisschen an Dead Space. Findet ihr das auch? Es soll einen erschrecken. Okay, passiert jetzt noch was? Er stellt sich einen ab. Das war es für den Fabian, das Spiel, da muss man schleichen, da mag es Spiele, wo man schleichen muss. Das ist ein kacke Aiming-System, wie in jedem VR-Spiel, aber du kannst es ja auch irgendwie nicht gescheit machen. Wow, das könnte nicht schlecht sein. Es gibt zu wenig gute VR-Games, wenn das ein gutes VR-Game ist, dann her damit. Auch wenn ich kein VR-Zeug habe. Ist im Chat. Super-Piclet. Kein Video und Tschüss. Hallo, Video? Mehr übersteuern bitte. Wow, das Interface. Also. Es ist 2019. Passt. Ja, gut, nächstes. Okay. Typing faster. Warum laden die Videos heute so lang? Das ist ein Type-Game. Ja gut. Warum nicht? Warum nicht? Okay, ist das ein Spiel, wo man schreiben lernt oder sowas in der Richtung? Ich glaube, das ist ein Game, wo man schreiben lernt. Da fällt mir jetzt nichts in dieser Kategorie ein, das heißt, wenn es gut gemacht ist, warum nicht? Weil ich meine Zweifel habe, dass es halt wirklich motiviert dazu, schreiben zu lernen. Also schnell schreiben oder vielleicht auch blind schreiben oder so. Ich meine, dass es für Kinder gut kann sein. Ich meine, mir fällt kein anderes Spiel dieser Art ein, außer ein paar Browser-Games. Warum nicht? Wenn ihr den pädagogischen Wert darin erkannt habt, dann könnt ihr ja backen. Wir gucken uns jetzt nochmal kurz das Gameplay an. Ich meine, zumindest haben sie mal einen Typ, der Grafik machen kann. Das sieht nicht zu fürchten aus, wie der Rest, den wir vorher geguckt haben. Das sieht schon mal ganz nice aus für das, was es sein soll. Ja, es ist wirklich. Na gut, es ist aber so, WASD kriegt prinzipiell eigentlich jeder Gamer hin. Oh, das ist easy für die Wim-Leute. Easy, kein Problem. Okay, das ist genau so was, was wir gedacht haben. Ein Spiel, wo man Typen übt. Wobei das hier jetzt noch ziemlich easy aussieht. Okay, so spannend ist das jetzt auch nicht. Wie gesagt, ich habe es euch in den Chat gepostet. Ich habe es in den Chat rein eliminiert, wie man so schön sagt. So, jetzt haben wir als nächstes Bavaria. Nein, Bayani Fighting Game, nicht Bavaria. Demo Available. Oh, nice. Okay, das ist ein Fighting Game. Einmal ein hübsches Fighting Game. Also ich finde es vom Styler nicht ganz, ganz, ganz gut. Da steckt bestimmt ein bisschen Arbeit drin. Oh, mit richtigem Soundtrack. Die Frage ist, ob das wirklich, ob der Soundtrack von dem Game ist oder ob da nicht einfach irgendeinen Soundtrack drunter gelegt hat. Wahrscheinlich eher das. Okay, sie fighten sich halt einen ab. Ein Fighting Game. Hallo? Player? Oh, es ist ein Weep-Fighting Game. Ich will eigentlich vorspulen, aber das mag der Browser will nicht. Dann nicht. K-Nino-K-K-P. Ah ja. Okay, 12K wollen sie, die Hälfte ist schon fast gebacked. Was gefällt? Help, Localize oder... Oh, Visual Novel. Ich schau wieder, überall Visual Novels. Oh Mann, immer der Kram, immer der gleiche Kram, ey. Immer der gleiche Kram. Warum gibt es davon so viel auf Kickstarter? Warum gibt es davon so viel auf Kickstarter? Ich verstehe das einfach nicht. The fuck? Jetzt ohne noch was drüber, um die Qualität zu sagen, warum gibt es so viele Visual Novels auf Kickstarter? Das ist ja fast jedes dritte Game. So, das kommt als nächstes. Backlit-2015. Oh, das sieht ja schon mal richtig eindrucksvoll aus. Kept nichts zu, gut. Full-Metal-Plastik. Es sieht schlechter aus als Minecraft und es hat Panzer. Judith, jawoll, jawoll, so fängt meine Demo an. Das hat übrigens keinen Sound, das ist nicht kaputt oder so. Press any key, ja, schön. Oh Moment, wir müssen den Text lesen da unten. Aha. Das ist seine Doktorarbeit oder sowas in der Richtung. Nein, nicht wirklich seine Doktorarbeit, seine Abschlussarbeit. Das ist eine Abschlussarbeit, okay. Ich weiß ja nicht. Wisst ihr, wenn er das komplett selbst gemacht hätte, dann würde ich sagen, Respekt, aber es ist ein Unity-Game. Das heißt, es ist nicht schwer, sowas zu machen. Er hat es ja auch geschrieben als aus dem Asset Store, the fuck? Und es ruckelt wie Sau. Er spielt das Game in der Unity-Umgebung, warum? Der Zirkus-Manager. Varyonix Studio. Das ist jetzt wieder sauer. Zirkus-Manager. Erstmal ein LKW bauen. Das weiß ich mir unter dem Zirkus vorstellen. Als erstes mal ein LKW bauen. Das ist das essentielle zu einem Zirkus, dass man erst mal ein LKW macht. What? Geht das jetzt aber mit Zirkus-Manager los? Nein, jetzt wird ein neuer LKW gemalt. Was? Warum malt er uns LKWs vor? Das Ding heißt Zirkus-Manager. ETF? Kein Zelt? Keine? Nix, ein LKW. Ah, das ist ein LKW, wo du irgendwie Löwen oder so einsperren kannst. Ich weiß halt nicht, was ich mir unter Zirkus-Manager vorstelle. Photoshop kann er, ja das stimmt. Grafik kann er, wenn ich mir das hier angucke. Was man da unten gesehen hat, falls es von ihm ist. Aber was genau hat das jetzt mit einem Zirkus-Manager-Game zu tun? Das stimmt, wenigstens macht er es selbst. Das ist richtig, das kann man bei den meisten Games auf Kickstarter nicht sagen. Die haben Unreal oder Unity runtergeladen, ein paar Assets rein, ein paar Prefibed-Geschichte, fertig. Jetzt will er es wissen. Ich finde, die Ähnlichkeit ist verpuffend, oder? Oder eher die hier? Zirkus-Manager, nice. Also alles, was wir gesehen haben, in dem Trailer hat mit einem Zirkus-Manager nicht alles so viel zu tun, aber zumindest macht er seine Sachen selbst, was ich schon mal gut finde. Deswegen, wenn ihr daran glaubt, Link. Surviving LAN-Bridge. LAN-Alter. Eine Bodentextur. Eine Kiste. Aha, sowas gibt es nicht oft. Das kann gut sein, wenn das gut gemacht ist. Ich meine, das sieht ein bisschen eher so aus wie GTA San Andreas von der Grafik. Oh, ja genau, so sieht es aus, wenn man den Baum fällt. Die Häuser sehen auch alle ziemlich gleich aus. Okay, Leute, ich glaube kaum, dass man so die Häuser gebaut hat in dieser Zeit, oder? Ich meine, hier ist ein Haus, hier oben ist ein Dach, hier sind Fenster und so, und der guckt jetzt quasi in den Dachboden vom anderen rein und kann da rüber klettern, oder was? Was ist da los? Warum fallen die um? Ah, weil solche. Der bräuchte den, wie hieß das Ding, was wir letztens auf Amazon gesehen haben? Den Pest-Rejector bräuchte der. Den Pest-Rejector von Amazon. Das rejectet die Pest, dann passiert nichts mehr. Das Ding ist wirklich Pest-Rejector. Ja, das kann auch was werden, wobei man nicht viel bisher von sieht. Die See of Gionum. Kein Video. Freya and the False Prophecy. Nordische Mythologie, das könnte ja was für mich sein. Ganz viel Blut. Muss man untermauern jetzt. Oh, die Sprung-Sounds. Die Sounds. Da merkt man, dass da Leute dahinter sitzen, die schon mal ein Spiel gemacht haben und auch schon mal Trailer produziert haben. Da sieht wenigstens nach was aus. Ich weiß nicht, ob das Game mich ansprechen wird. Aber zumindest sieht das nicht, nicht so, nicht wie so 0-15 hingerostes Billig-Game aus. Die Sprung-Sounds waren schon hart, oder? Das ist auch so irgendwo. Ich weiß nicht, ob sie das Live beim passenden Anlass rekordet haben. Okay, next. Disabled Gamers. Das ist kein Game, oder? Das ist ein Kanal für, wie heißt das? Zurückgeblieben ist instant der Bann raus. Was heißt das? Wie nennt man das jetzt politisch korrekt heutzutage? Ich weiß nicht, ob die eine Behinderung haben, dass man Entwicklungsstörungen, sowas wie. Ich glaube so irgendwas wie Entwicklungsstörungen oder sowas. Also quasi halb YouTube Deutschland brauchen wir doch gar nicht einen Channel für. Dann gibt es doch genug zumindest in Deutschland für. Da hast du das Gefühl, dass du ziemlich die Hälfte der deutschen YouTube-Channels zurückgeblieben wirst. Das war jetzt gemein, aber es ist so. Ich weiß nicht, keine Ahnung, kann ich sagen. Es hat halt aber in der Gamer-Kategorie eigentlich nichts zu suchen. The Spirit of Christmas. Ein Runner-Game, oder ist das irgendein Mobile-Kack? Ah, gibt es gar nicht. Zu null, da ist er wieder. Anonymous, The Game, soon available. Das sieht nicht so aus, als ist das soon available. Grüner Code, so muss das sein. Moment, was haben wir da im Hintergrund für? Das ist garantiert nicht der Code von seinem Game. Das sieht mir aus wie irgendwo einfach rauskopiert. Das ist ja irgendwie, was weiß ich, Linux Kernel C-Code oder sowas. Immerhin ist das echt ein Kopf, weiß man da doch nicht mal. Was auch immer, keine Ahnung. World War, Blood of Our Fathers. Historisch genau. Das ist das, was Battlefield nicht auf die Reihe gekriegt hat. Da fuck. Alter, die wollen es aber wissen. 11 Millionen. Die wollen wirklich das nächste Battlefield machen. Ich habe so meine Zweifel, ob das was wird. 11 Millionen, das ist schon sehr ambitioniert. Wir haben keinen Trailer. 11 Millionen, ok 12 Millionen eigentlich. Kein Trailer, keine Konzeptbilder, nichts. Voraussichtliche Liebung 2020. Timeline, ok wie sieht es aus? Funding Rates, easy. Ihr habt natürlich kein Problem bis Januar 2019. Habt ihr 12 Millionen, überhaupt kein Ding. Easy, easy. Also easy ist 12 Millionen of my life hier. Das ist überhaupt kein Ding. Ok, wie geht es weiter? Im Februar. Das Core-Team steht, aha. Marketingmaterial, mehr als development-Team. Also sie haben es richtig. Also ich glaube man muss kein Heldseher sein, wenn man da sagt, ich glaube das wird nichts. Was haben wir als nächstes? Die Venia Episode 1, 8 Euro. Kick-Ass-Lauf-Animation. Die Lauf-Animation hat es in sich. Schnippel-Sounds. Der ist einfach gerade aufgeploppt. Ok. Das sieht irgendwie merkwürdig aus. Die Lauf-Animation ist die beste. Optisch sieht es ein bisschen aus wie vom Gamecube. Na ich weiß nicht. Ok, kommt da noch was? 7 Minuten? Die Videos von Kickstarter sind heute ein bisschen langsam. Sag mal hat die keinen Fuß? Nee, die hat den Fuß nur im Kopf. T-Pose, jawoll, beste. Das hat mir jetzt noch gefehlt. Gut. Warum ist das denn ein bisschen Team-Favorite? Was ist eigentlich Team-Favorite? Team-Favorite. Inspired Tea. Ah ja. Final Detonation. Das hatten wir doch das letzte Mal schon. Der hat es einfach nochmal neu gelauncht, oder? Man erkennt nichts. Das hatten wir das letzte Mal schon. Das hat das letzte Mal schon nicht funktioniert. Das hatten wir das letzte Mal schon. Was zum Teufel soll das sein? Genau, das haben wir das letzte Mal schon angeguckt. Dieses komische Ding. Origin of Infestation. Gleichzeitstrategie und Oldschool RPG in einem. Will 60k haben. Das ist sehr early. Das ist untexturiert early. Es war wahrscheinlich zu viel verlangt für einen Kickstarter-Trailer, mal hier ein paar rudimentäre Tricks zu uns rüber zu klatschen. Mega-Physik-Engine. Habt ihr das gesehen? Beste. Wie in echt. Was wollt ihr uns überhaupt zeigen mit dieser Aktion jetzt? Man kann ein Brett hinlegen, es fällt nicht runter und dann kann man drüber laufen. Nice. Garantiert irgendwelche gekauften Models. Ja, das Ding sieht auch schon irgendwie... Ach, ich weiß nicht. Die Dinger, das wird immer schlimmer heute. Oh, sie haben sowas wie Concept Art. Da ist bloß die Frage, ist das ihres? Weiß man ja nicht. Okay, next. Was? Den Kurs, wie man den Unity-Asset-Store benutzt oder was soll das? Irgendeine Anleitung. Travel. Thank you for traveling. Gibt keine... Oh, das ist rein text-based. Oh nee, bitte nicht. Dafür ist es mir zusätzlich 2019 schon. Royal Storm Bowling. Ein Bowling-Game. Ich habe lange drauf gewartet. Irgendwie sehen viele von den Projekten einfach nur aus wie Betrug. Naja, man muss ja sagen, bei den meisten Projekten sieht man ja schon irgendwo, worauf man sich einlässt, wenn man nicht ganz, ganz blind ist. Und das heißt, man kann ja kaum von Betrug sprechen. Die meisten Games sehen schon so aus, als wird es nichts. Wo man richtig skamast wird, zum Beispiel, ist bei einer Hose. Hab ich euch ja schon erzählt. 100 Euro Grip. Skamast wurde ich aber richtig. Was mich aber nicht davon abhält, Kickstarters. Oh, episches. Episches Bowling-Spiel. Bowling mit dem händigen Kopf. Was? Was? Was genau habe ich da jetzt gesehen? Wartet mal. Moment. Es ist ein Ball? Ein Helikopter? Noch mehr Ball? Blaulicht? Kegel? Äh... Was? Alter, wer denkt so was aus? Ok, 0% finanziert nach 13 Tagen. Ich vermute mal, die 400 Euro werden auch nichts werden. Der Markt für Battle Royale Bowling-Spiele ist, glaube ich, nicht vorhanden. Battle Royale Bowling-Spiele. I'm not a monster, first contact. Ok, das sieht zumindest so aus, als hat der jemand drangesetzt, der ein bisschen artistisch begabt ist. Level 260k. Sechs Minuten, das gucken wir uns jetzt nicht komplett an. Skippen wir mal ein bisschen. Er erinnert mich so ein bisschen an Fallout. Oder BioShock. BioShock. Vom, vom, vom, von der Ansage her. Ach, das ist so eine... So ein bisschen wie Dings hier, wie dieses Söldner-Game, was es früher gegeben hat. So Turn-Based-Stells. Und jetzt haben sie zumindest ordentlich gemacht in der Hintergrunde. Was ist denn heute mit den Kickstarter-Videos los? Guckt mal, das buffert sich immer ein ab. Das könnte auch an der Telekom liegen. Selma, ich wurde auch skammast. Ich mein, so ein rundenbasiertes Taktik-Stells-Ding, warum nicht? Ist ja nicht so, dass es da so gute, so viele gibt. Und sie haben, ich weiß nicht, sie sind ein normales Studio. Also keine Skammast-Aktion. Sie haben Leute, die... Sie haben Künstler, sie haben Programmierer und so. Das steht zumindest schon mal auf ganz guten, hat schon mal gute Voraussetzungen. Link, wenn euch das zusagt. Was haben wir als nächstes? A Miscreation. Plattformer with evolution. 4.300 Euro. Boah. Boah, die Musik macht ja eine Ermöse. Wobei die eigentlich ganz nice ist. Das hat ein bisschen was so Kirby-mäßiges. Okay, jetzt wird plattformt, wie man das so kennt. Und irgendwelche... Was genau sind das für Dinger? Hallo, ich wollte da hin zurück. Was, was genau soll das sein? Maiskolben. Bestimmt Maiskolben. Die irgendwas rausspritzen. Warum blieb Zeitmann oder was? Ein Yoshi-Eye. Es läuft. Es läuft. Feuer hat es noch gekrabbelt. Hier ist evolution. Ist evolution nicht, ist evolution. Link. Ja, denke ich auch, es könnte durchaus was sein. Requeam. Requeam. Was? Ride of Tracks. Schau mal hier mit schöner... Ich finde, das sieht irgendwie so aus, als hat der Typ irgendwo Requeam als Schrift gekriegt und hat dann quasi nochmal auf das Bild was drunter geschrieben. Und auch das hier und dann irgendwie so seine Hand reingemacht oder so. Ach so, es ist ein Augmented Reality-Game. Okay, dann ist das ja... Das kennen wir doch. Das gab es doch das letzte Mal auch schon. Und das kann nicht das Gleiche gewesen sein, weil das letzte Mal, wo wir geschaut haben, das war 4. November oder so, das ist schon eine ganze Weile her. Das kennen wir schon. Ich glaube, die haben das einfach nochmal reingestellt. Ja, genau, das war das Game, die einfach random irgendwelche anderen Games als Trailer reingepackt haben. Disney's Cars 3. WTF? Genau, da kann ich mich noch dran erinnern. Die haben einfach irgendwelche Trailer von irgendwelchen anderen Games reingepackt. Disney's Cars 3, weil das auch so viel mit Requeam und Ride of Dragons zu tun hat. Okay, weiter geht's. Let's see. Horror Game. Oh, MonkaS-Time. Wie lange machst du heute noch? Weiß nicht. Voice Acting Top Notch. Freue mich. Das ist das schlechteste Voice Acting. Cringe Voice Acting. Der Rest sieht okay aus. Das Voice Acting war aber wirklich der größte Horror überhaupt. Ich finde das Ingame Zeug für Leute die Horror Games machen sah gar nicht so schlecht aus. Aber das Voice Acting, das ist wirklich der Horror schlechthin. So, was haben wir als nächstes? Super Realistic Autocross. Ich ahne ja schon Schlimmes. Ich habe übrigens, muss ich gerade mal erzählen, ich habe heute ein bisschen weiter gebastelt an das was wir gestern programmiert haben, die Gegensprechanlage. Ich habe da jetzt eine Web Anwendung draus gebastelt, die schon halbwegs auf dem iPhone funktioniert und auf dem Android Tablet und sowas. Kann ich euch die Tage mal zeigen. Haben wir 1998? Was das für... Moment. Was für eine Plattform kommt das? On Steam und Nintendo Switch. Ok. Ja. Ok. Live. Live. Wir können dem Entwickler live zugucken beim... Ok, jetzt müssen wir uns erstmal den Vikings Trailer angucken. Wie ist eigentlich die neue Vikings Staffel? Ich habe schon vor einer Weile aufgehört zu gucken. Ich habe irgendwie bis Staffel 3 geguckt. Was ist das? Das sieht aus wie das billigste Rennspiel aller Zeiten. Vielleicht tue ich den aber auch vollkommen ungerecht jetzt und das ist mega geil. Ist ok, aber sehr viel Gelaber das vorangeht. Ja, das ist auch der Grund warum ich Game of Thrones nicht gut fand. Ich habe Game of Thrones, habe ich auch die ersten zwei Staffeln geguckt. Da ging es finde ich, da fand ich irgendwie, da war das dann auch ganz nice. Aber danach hat sich das so krass im Kreis gedreht immer. Und so ohne Konsequenzen letztendlich irgendwie, so ganz viel Intrigen hier, Intrigen da. Und dann wird es zackig aufgelöst und nichts ist passiert. Vielleicht kratzt irgendwie einer ab. Also Game of Thrones finde ich ist mit so die overrated Serie überhaupt. Ok. Adams ascending. In one word what does Adams ascending mean to you? Was geht mit den Kickstarter Videos heute ab? Die laden überhaupt nicht richtig. Warum genau liegt jetzt auf dem Planet irgendwie eine AK-47 rum? Hat da irgendwie einer mal eine logische Erklärung für? Also die Kickstarter Videos sind halt richtig im Arsch. So nicht normal. Ok gucken wir uns hier nochmal Pre-Alpha Gameplay an. Vielleicht geht es auf YouTube besser. Ja YouTube läuft gut. Lauf Simulator. Weltraumstells rumlaufen. Auch wieder so ein Game, super für den Friseur geeignet. Jetzt fehlen bloß noch Stellselemente. Die größten Verhältnisse sind ein bisschen merkwürdig. Ok aber es sieht zumindest schon mal aus als haben die sich irgendwas bei gedacht. Das kann man ja zu den meisten Games nicht sagen. Also wer das becken möchte. Link. Die haben schon, ja die brauchen noch ein bisschen was. Dass das was wird. 16 Tage verbleibend. Also haben sie noch ein bisschen Zeit bis nächstes Jahr. Der Boss ist back schreibt. Ich verstehe nicht warum in Game of Thrones so viele 16 drin sind. Die braucht kein Mensch. Ja wahrscheinlich. Das war ja die ersten zwei Staffeln war es natürlich auch schon. Aber da hat es zumindest oftmals noch irgendwie so einen Storyzweck gehabt. Aber danach war es einfach nur weil sie gemerkt haben, dass das halt Marketing technisch nicht verkehrt ist. Wenn die Leute darüber labern. Goblin Slayer Game. Moment Moment. Ist Goblin Slayer nicht dieser Goblin Rape Dings. Das gucken wir uns jetzt nicht an. Ist das nicht dieser komische Anime. Wo die Goblins dann irgendwie die Heilerin vergewaltigen oder so. Frag mich nicht woher ich das weiß. Das weiß aber. Be Crip. Weeps. Ach so das ist nur nachgemacht. Dann ist es natürlich. What kind of Game will it be. Ok komm Leute wir müssen. Wir müssen unseren inneren Weep channelen quasi. Moment. Das ist das ist aber. Das ist. Das ist gerippt aus dem Anime. Das ist. Moment. Das ist kein offizielles Game von denen. Die haben doch gar nicht die Lizenz dafür. Verstehe. Scheiße. Das gucken wir uns nicht an. Ok die. Die haben ja einfach die. Was zum Teufel. Leute Kickstarter. Be Crip. Best Suit for playing hard. Was. Ein neuer ein neuer Stick. Auch wenn man das Part mit dem Gaming Klopf. Den man am Anfang hatten. Dann ist dann ist aus. Dann ist das Skill ist real. Oh nein. Der Controller ist kaputt. Weltuntergang. Und jetzt macht sie wieder ganz. Magic. Was. Ich bräuchte für sowas echt eine Webcam. Ich bräuchte für sowas echt eine Webcam. Weil man manchmal gar nicht. Gar nicht gar nicht gut rüber bringen kann. Irgendwie wie man wie man sich gerade fühlt. Sondern einfach weil man einfach müsste. Einfach doof in die Kamera gucken kann. Und was. Hundert zwanzig tausend. Hundert zwanzig tausend. Und ich weiß nicht wozu ich was brauche. Das ist irgendein Mobile Game. Oder das gucken wir uns jetzt nicht an. Oder doch. Das hat hat wurde wurde gebackt. Max Fails Revealing. Ich weiß nicht. Es wäre es wäre für für Streams deutlich praktischer. Für sowas hier das mit Webcam machen zu können. Das auf jeden Fall. Hey. Was haben Sie alles gemischt. Match 3. Ich verstehe. Tower Defense. City Building Strategie. competitive Tower Defense. Ich meine. Der Typ kann zumindest sein Game schon mal gut anpreisen. Die Mechanics sind stellar. Das ist das ist so ein Spruch. Den hätte auch irgendein Typ von ihr auf der Bühne loslassen können. Pavillionen gibt es bestimmt. Aber wenn schon mit Webcam dann macht das auch richtig. Also ich muss ja ehrlich sagen das Game sieht für mich sehr sehr hart nach Resident Sleeper aus. Ja das sieht sehr Resident Sleeper mäßig aus. Wir brauchen mehr Echtzeit Strategie Spiele das auf jeden Fall gibt es zu wenig von. Die Römer sind am Start soll zumindest so aussehen. Und die Wikinger mit Hörner Helm. Moment. Erst haben sie diese. Warum haben die. Das hat ja nicht mal Ansatzweise mit dem. Also das hat ja absolut nichts mit dem zu tun. Wie es ausschaut also absolut gar nicht. Das sieht noch sehr rudimentär aus. Wie das komplette Konzept Art Zeug. Wie das komplette Art Geschichten nichts mit dem Game zu tun hat. Das musst du erst mal schaffen. Malkyrs Interactive Card Game. Ist das Hardstone Reloaded 25.0. Es gibt so viele Hardstone Clones. Brauchen wir da wirklich noch ein. Okay das das muss irgendwas haben. Sonst hätten es nicht so viele Leute gebacken. Das gucken wir uns jetzt an. Okay neue WoW Trailer. Ja es könnte 1 zu 1 irgendwie ein Hardstone Geschichte sein. Sieht schon so aus. Es gibt so viele gebacken. Moment ich glaube ich weiß was das wird. Das ist ein Offline Game oder. Ja das ist ein Offline Game. Ach das sind Karten mit RFID. Dass da nicht schon früher einer drauf gekommen ist. Das hätten zum Beispiel die Magic Dudes machen können. Die hätten ihre Karten irgendwie RFID Chips verpassen können. Dann kannst du online mitspielen. Dann verkaufst du in echt Karten und. Warum sind denn da die großen noch nicht früher drauf gekommen. Und warum ist Blizzard noch nicht auf die Idee gekommen. Hardstone Karten raus zu hauen. Ich meine Hardstone kannst du offline nicht spielen. Aber du kannst Karten eigentlich realisieren. Die sagen ich kann kein Französisch nachmachen. Ich weiß so dass das Franzosen viele Wörter immer gerne ein Französischen. Und dann hat man eh ein Franzose zu mir. Anstatt Frieschard hat er gesagt Friescharde. Da war es vorbei. Das übertreibt es halt. Das ist schon wieder der gleiche Typ. Wie oft hatten der das Game drinne? Das hatten wir doch vorher schon mal. Oder? Nee das ist was anderes. Das sieht aber verdächtig ähnlich aus. Stimmt Skylanders gab es ja da habe ich jetzt gar nicht dran gedacht. Hast du denn Super Mario Fan Remake gesehen? Wenn es schon ein bisschen her ist habe ich das gesehen. Das ist der der das erste Level nachgebaut hat oder? Oder gibt es noch mehr? Es gibt saumäßig viele Mario 64 Teile in neueren Engines Remaked. Weil es einfach ein Game ist das viele Leute beeinflusst hat. Das gibt es voll. Ist YouTube voll damit. Ein Game was wirklich davon profitiert ist. Also jetzt nicht von Remaken sondern von Enhancen. Ist Mario Galaxy im Emulator mit besseren Texturen und mehr Effekten. Das sieht wirklich nice aus. Das Game sah nämlich viel besser aus als die Wii letztendlich hergegeben hat. Ok was heißt das? Frogvale. Ist schon finanziert. Nein ist nicht die Hälfte. So diese manche Währungen sehen so viel aus irgendwie. Und dann sind es am Ende sind es dann 1000 Euro. Und dann wird es teuer. Was? Der Bus Emulator nur in... Ich meine nichts gegen minimalistische. Minimalistische und stylische Grafik. Aber ich finde nicht dass dieser minimalistische Grafikstil stylisch ist. Das sind irgendwelche eckigen Plops. Project Weep keine Ahnung. Kenne ich nicht. Project Medizinball. Ich erkenne nicht was das sein soll. Sieht aus wie Project Medizinball oder? Alles klar. Das war ein Gegner. Er schlägt einen Gegner an und der Gegner stirbt. Das ist mega intense. Ultra intense. 126 Chamber Street Horror Game. Wir hatten heute erstaunlich wenig Horror Games. Es ruckelt. Der Joe Filippone. Blaufilter. Battlefield 3. Es ruckelt wieder. Es ist ein Amnesia Style Ding Was hier überhaupt nicht mal ein Fall ist. Das sieht mir eher aus wie Horror gewollt, aber nicht gekonnt. Chaos, Roguelike, RPG, Early Footage. Heute haben wir halt uns minimalistische Grafik aber echt angetan. Was ist das für ein Geräusch? Dieser Sound. Als würde es schleifen. Oh krasses Kampfsystem. Was machen die Gegner eigentlich? Und warum sterben die nicht? Also manche Games sehen wirklich, da weiß ich immer nicht. Sind die absichtlich so komisch oder? Es ist einfach ungewollt. Geil. 3000 Euro. Also wenn euch das zusagt. Ich hoffe nicht, dass es wieder eine Visual Novel ist. Ja. Und weiter. Es sieht nach RPG Maker aus. Das ist ein RPG Maker Game. Oder was meint ihr? Das sieht aus wie RPG Maker. Das ist ein RPG Maker. Das ist sowas von sich. Man könnte ja ein bisschen was zeigen. Nope. Mass Commander. Also erinnere mich dran, dass wir noch features Haftbefehl gucken müssen. Der Mathe Commander. Die hässlichsten Asteroiden, die ich je gesehen habe. What? Was sehe ich da wieder? Es kotzt. Es hat irgendwas ausgekotzt gerade. Ach, das ist der Raketenantrieb. Ich habe gedacht, das ist ein komisches Viech. Es speilt irgendwas aus. Ja, das soll man rechnen lernen. Wisst ihr was ich an der Grafik heutzutage cool finde? Das war nämlich gerade so eine Einstellung mit der Kamera. Das hier, wenn man das so sieht. Das könnte auch aus irgendeinem Game sein. Also ohne Kontext herum, wenn man es heute realistisch machen will, sieht das wirklich ziemlich gut aus. Aber das ist halt echt jetzt. Okay, es ist ein Mathe Spiel. Okay, Pädagogik Bildungsauftrag FPS am Start. Wenn ihr das becken wollt, haut rein. Roots Video Game. Man kann Pixel auch schön machen. Man kann Pixel auch schön machen. Das ist nicht schön. Das sieht. Oh, Voice Acting Supreme. Voice Acting des Pargas. Okay, für den war keine Stimme mehr übrig. Oh Mann. Anfall. Was zum Teufel ist das? Willkommen. Hat da jeder, der in der Nachbarschaft wohnt, mal einen Satz gesprochen oder was? Amore, yes. So einfach ist es. Ich habe keinen Plastenschimmer, auf was es geht. Das macht dich echt im Kopf verrückt, manche Kickstarter-Projekte. Thehaveuring six is cubes, one-on-one online Game. Das ist wie aus Mario Galaxy, die in diese Level-Modes runterfällt, wo man drauf war. Cubes. Es sieht mir sehr langweilig aus. Hi Guys. Das wird wahrscheinlich nicht der nächste Online-Competitive-Hit werden. Hatten wir das nicht eben schon? Sieht aus wie den MMO von 1995. Äh, ha? Control Epic Spell Cases, jawoll. Moment, ich dachte der Anfang ist das Game, aber das ist das Game. Man scheint sich zumindest ansatzweise was dabei gedacht zu haben bei dem Spell-System. Es sieht aber mega langweilig aus. Okay, weil euch das angesprochen hat. The Malung. Ah, eben Snake mit Würfel und jetzt richtig Snake. Snake Enhanced. Snake HD Edition. Jetzt mit Levels, die irgendwie anders aussehen. Okay, es ist Snake im Puzzle-Modus. Mit einem FPS. Ich glaube es ist so eine Art rundenbasiertes Game. Das läuft nicht vorwärts bis man sich bewegt. Es sieht aber minimalistische Grafik in Ehren, aber... Das könnte sogar ich malen und ich kann es überhaupt nicht malen. Wenn ich ein Game machen würde, 2D, dann würde es wahrscheinlich optisch ungefähr so aussehen. Das ist jetzt aber nichts Gutes. Oh, geschreckt. Ich weiß nicht. System Ascent. Oh, halbe Million. Jetzt bin ich mal gespannt. Jetzt will ich mal was sehen. Es wurde auch schon gebacked. Was ist ein First-Player-Guided-Free-To-Play-Game-Best-On-Game-System-Developer-Game-Of-Zones-App? Was? Okay. Ich zeige Gameplay. Die Kickstarter-Videos sind heute so am abkacken. Gibt es da unten ein Video? Er freut sich. Ich weiß nicht, vielleicht. Was ist das? Game of Thrones Ascent. Habe ich schon nie gehört. Highly Popular Game Engine. Habe ich schon nie gehört. Was soll das sein? Das ist Browser-Game oder was? Ja, ein geiler Game of Thrones Browser-Game. Ja, super. Das haben wir gebraucht. Chaos-FPS-PC-Game-Multiplan. Ich ahne Schreckliches. Ich ahne Schreckliches, wenn ich das schon sehe. Was? Erzählt uns erstmal, das Game wird definitiv nicht so aussehen, wie man es hier im Trailer sieht. Da ist natürlich die Frage, warum macht er den Trailer so? Sollte man nicht einfach als Grundlage schon mal das nehmen, was es später auch werden soll? Das sieht ja grausam aus. Das sieht ja grausam aus. Was ist denn das? Was ist denn das? Manches tut weh. Manches tut echt weh, wenn man es sieht. Dieses komische Alien da, das hätte ich aufmalen können. Das ist kein Kompliment. Wenn ich was malen könnte, heißt das, das ist in der Regel schlecht. Das Haus ist auch irgendwie ein bisschen unförmig. Ich habe keinen blassen Schimmer, was ich hier eigentlich sehe gerade. Moviemaker-Paint. We won't disappoint. Ich glaube halt nicht, dass das was wird. Er will das Game in Unreal 4 danach machen, habe ich schon mal gesehen. Rocket-Ghost-Aden. Oder AI-Dan. Kickstarter-Stats. Nice. Schön, dass wir jetzt auf Kickstarter sind. Also ihr wisst ja, dass ich ein Fan von solchen Soundtracks bin. Und wir hatten heute schon ein paar Spiele, wo ich gesagt habe, das Spiel würde ich nicht kaufen, aber den Soundtrack. Bis auf ein bisschen was Melodisches, habe ich jetzt noch nichts rausgehört, was sich harmonisch anhören würde. Außer Gebrumme. Und was soll das vor allem sein? Guck mal, dem Ding kommt Feuer aus dem Arsch. Das fliegt. Feuer aus dem Arsch fliegt so hoch. Nee, nee Leute. Nee, nee. Nee. Ich habe da keine Nerven heute für, das werde ich anzugucken. Survival-Game-Best. Oh, schon wieder Survival. Das letzte Mal hatten wir aber deutlich mehr Battle Royale-Games. Moin, Spaceload09. Hat da wieder eine Unreal-Engine installiert und eine Map gemacht und ein paar Bäume drauf gestellt. Ein bisschen Speed-Tree am Start, wobei die Bäume sind sich teilweise schon ein bisschen ähnlich. Eher nicht Speed-Tree, eher Copy-Paste-Tree. Test, die muss sie. Ok, Zeichen. Wald. Ok, und wo ist jetzt der Survival-Aspekt davon? Ein Hirsch aus dem Asset-Store. Oh, krasse Animation. Aha. Demo. Impossible Dungeon Respawn. Ok, wir hatten ja heute schon minimalistische Grafik und minimalistischere Grafik und jetzt haben wir minimalistische Grafik mit nur einer Farbe. Man kann es immer noch toppen. Ein sexy Female Elf. Oh, das werden das die Feministen hören. Ja? Hallo? Kommt da noch was? Moment, ist das nur Text? Ok, ist es Text? Nein. Kein Video. Mesh my Polygons. Also im Vergleich zu das letzte Mal war heute wirklich zum größten Teil Crap dabei, oder? Es waren zwei, drei Sachen, wo man sagen könnte, ja, ganz ok. Aber der Rest war wirklich Crap. Das ist so Just Cause für Arme. Was ist das schon wieder? Man kann Luftballons an die Leute dranhängen und dann schweben sie, ja ok. Schön. Gut Job. Und dann hängen sie an der Decke. Und dann... Jetzt tu mal nicht so, als hättest du das selbst gemacht. Da zeigt das nämlich so, als hätte er das selbst gemacht. Da hättest du überhaupt nicht selbst gemacht. Den Schatten. Das ist Standard. Das ist schon dabei. Das muss man heutzutage nicht mal selbst machen. Das sieht... Was ist das wieder für ein Krempel, ey? Weg! Shades of Light. Was? Bei den meisten Videos heute check ich überhaupt nicht, was ich überhaupt zu Gesicht bekomme. Wenigstens klitscht das hart nicht in den Boden rein, sondern nur in die Pflanze dahinter. Ok. Leute, ich glaube, es reicht für heute. Es wird ja immer... Es wird ja nicht besser, es wird ja immer nur schlimmer, wenn ich mir das hier schon angucke. Es wird schon... Es wird immer schlimmer. Ich glaube, wir machen jetzt Schluss. Ich glaube, wir machen Schluss für heute. Macht's gut. Oh nee, wir müssen noch... Wir müssen noch Haftbefehle angucken. Ich will eigentlich überhaupt nicht... Ich weiß, dass mich das jetzt schon wieder aufregen wird, wenn ich den Kram sehe. Weil es wahrscheinlich total mies ist. Müssen wir uns jetzt wirklich, Tielinde, mal Haftbefehle angucken? Müssen wir uns jetzt wirklich, Tielinde, mal Haftbefehle angucken? Ja. Nein, müssen wir nicht. Sehr gut. Mach ich... Dann lass ich's bleiben. Ihr seid... Ihr seid ein netter Chat. Nein, ein nicer Chat. Ein sehr nicer Chat. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Der letzte Tag, Max, für was? Und zwar, ich zeige euch das mal, was ich habe, was ich gekauft habe. Das da. Das kommt bei Mädels mit Sicherheit gut an. Mädels haben immer kalte Füße, wobei das sieht nicht so aus, wie das, was ich gekauft habe. Nee, nee, ich glaube nicht, dass ihr zuschaut. Das sieht nicht so aus, was ich gekauft habe. Die, die ich gekauft habe, hatten eine deutlich dickere Sohle und... Egal, aber sowas in der Richtung habe ich gekauft. So, jetzt wisst ihr das auch. Ok. Ok. Gut Leute, am Schluss. Was nice, dass ihr dabei wart. Danke für die Follows. Ich guck mal, wenn wir hier alles jetzt am Start haben, wenn die Seite lädt. Jetzt muss er erstmal mit Twitch log in, weil er das schon seit gestern wieder vergessen hat. Also, danke für die Follows. Karo, Morphase, KissDHD, Akiza, FTW, Testo, Morris, Storm, Kot. Wer sehe ich nimmer? Die Resten, die anderen sind von gestern, vielleicht waren das heute auch alle. Geht schon mal von aus. Ja. Schön, dass ihr dabei gewesen seid, wir machen an der Stelle den Schluss. Und, äh, vielleicht sehen wir uns ja morgen schon wieder. Bis denn. See you! Abonnieren Kliken Abonnen Kliken Abonnen Kliken Abonnieren Kliken Abonnieren Abonnieren Kliken Abonnieren Kliken Abonnieren Kliken Das war's für heute. Bis zum nächsten Mal.", "segments": [{"id": 1, "start": 0.0, "end": 11.0, "text": "So, ich muss erst noch mal einen zweiten Rechner anmachen, also ich sehe noch keinen Chat oder sonst was, weil doch, ich habe hier eine Vorschau."}, {"id": 2, "start": 11.0, "end": 21.0, "text": "Dann soll ich noch mal einen Streaming Rechner anmachen, sonst sehe ich nämlich überhaupt nichts."}, {"id": 3, "start": 21.0, "end": 30.0, "text": "Aber ich habe mir gedacht, nachdem Twitch ja eh immer eine ganze Weile braucht bis Notifications rausgehen, dann machen wir das jetzt schon mal an."}, {"id": 4, "start": 30.0, "end": 34.0, "text": "Passwort vertippt."}, {"id": 5, "start": 34.0, "end": 39.0, "text": "Ich hoffe jetzt richtig."}, {"id": 6, "start": 39.0, "end": 53.0, "text": "Ich könnte bis mein Rechner gestartet ist gar nicht auf dem Tablet gucken, was im Chat passiert, falls schon jemand am Start ist."}, {"id": 7, "start": 53.0, "end": 55.0, "text": "Es ist schon jemand am Start."}, {"id": 8, "start": 55.0, "end": 61.0, "text": "Und haben wir zufällig Quality Options, das muss ich jetzt noch gerade mal nachgucken hier auf dem Tablet."}, {"id": 9, "start": 61.0, "end": 72.0, "text": "Ja, das ist ein bisschen der Nachteil, wenn man seine Festplatte voll verschlüsselt hat, was ich als komplett paranoider Informatiker natürlich habe."}, {"id": 10, "start": 72.0, "end": 76.0, "text": "Dauert es ein bisschen bis die Rechner gestartet sind."}, {"id": 11, "start": 76.0, "end": 88.0, "text": "Wublox Kanäle, da ist er. Bis ich das im Tablet eingegeben habe, ist mein Rechner auch gestartet."}, {"id": 12, "start": 88.0, "end": 93.0, "text": "Guck mal, das hat noch nicht mal erkannt, dass ich angeblich online bin."}, {"id": 13, "start": 93.0, "end": 96.0, "text": "Ah, egal."}, {"id": 14, "start": 96.0, "end": 98.0, "text": "Jetzt der Rechner eh an."}, {"id": 15, "start": 98.0, "end": 116.0, "text": "Oh Gott, die Tastatur wieder umstöpseln."}, {"id": 16, "start": 116.0, "end": 123.0, "text": "Ich kann nur Weihnachtsmusik anmachen. Ist ja schon kurz davor."}, {"id": 17, "start": 123.0, "end": 126.0, "text": "So, Chrome aufmachen."}, {"id": 18, "start": 126.0, "end": 130.0, "text": "Jetzt sehe ich gleich was."}, {"id": 19, "start": 130.0, "end": 132.0, "text": "So, jetzt habe ich auch Chat."}, {"id": 20, "start": 132.0, "end": 136.0, "text": "Also wenn schon einer da ist, jetzt sehe ich euch, jetzt habe ich Chat."}, {"id": 21, "start": 136.0, "end": 139.0, "text": "Jetzt haben wir Quality Options. Wir haben Quality Options, Alter."}, {"id": 22, "start": 139.0, "end": 142.0, "text": "Twitch will es wissen, ey."}, {"id": 23, "start": 142.0, "end": 147.0, "text": "Da habe ich ja noch weniger Grund, Partner zu werden. Außer Twitch Money."}, {"id": 24, "start": 147.0, "end": 157.0, "text": "Wenn ich jetzt auch so schon immer Quality Options kriege."}, {"id": 25, "start": 157.0, "end": 160.0, "text": "All die Musik geht mir auf den Sack, haben wir nicht sonst was."}, {"id": 26, "start": 160.0, "end": 169.0, "text": "Oh, wir mussten ja noch, ich habe es euch ja gestern versprochen, dass wir Till Lindemann Features Haftbefehl gucken."}, {"id": 27, "start": 169.0, "end": 185.0, "text": "Da müssen wir jetzt noch durch, ja. Ich weiß nicht so genau, was mich da erwartet."}, {"id": 28, "start": 185.0, "end": 187.0, "text": "Was ist mit der Maus los?"}, {"id": 29, "start": 187.0, "end": 189.0, "text": "Fuck."}, {"id": 30, "start": 189.0, "end": 196.0, "text": "Was ist das?"}, {"id": 31, "start": 196.0, "end": 198.0, "text": "So, ich muss jetzt den Sound glaube ich eh ein bisschen lauter machen."}, {"id": 32, "start": 198.0, "end": 210.0, "text": "Dass man die Kickstarter Videos hört."}, {"id": 33, "start": 210.0, "end": 215.0, "text": "So, machen wir schon mal ein Spiel auf."}, {"id": 34, "start": 215.0, "end": 220.0, "text": "Und dann konnte man, wie konnte man den Kram jetzt ordentlich filtern?"}, {"id": 35, "start": 220.0, "end": 226.0, "text": "Das ist, ich finde die Kickstarter Seite ist teilweise ein bisschen sortiert nach, weitere Filter."}, {"id": 36, "start": 226.0, "end": 232.0, "text": "Man konnte das nämlich sortieren nach Spiele Hardware, nach Spiele Software, nach Offline Spielen und so was."}, {"id": 37, "start": 232.0, "end": 237.0, "text": "Projekte, Beiträge, sortieren nach, Zufall."}, {"id": 38, "start": 237.0, "end": 240.0, "text": "Wo ging das denn jetzt noch? Ah, hier."}, {"id": 39, "start": 240.0, "end": 244.0, "text": "Hardware Videospiele."}, {"id": 40, "start": 244.0, "end": 246.0, "text": "Spiele."}, {"id": 41, "start": 246.0, "end": 248.0, "text": "Moment, Videospiele, da."}, {"id": 42, "start": 248.0, "end": 250.0, "text": "Handyspiele."}, {"id": 43, "start": 250.0, "end": 255.0, "text": "Igitt, es gibt eine eigene Kategorie für Handyspiele."}, {"id": 44, "start": 255.0, "end": 258.0, "text": "Ah, man kann keine Tabs aufmachen."}, {"id": 45, "start": 258.0, "end": 265.0, "text": "Dann fangen wir heute mal an mit Hardware für Videospiele."}, {"id": 46, "start": 265.0, "end": 267.0, "text": "Und es geht los."}, {"id": 47, "start": 267.0, "end": 269.0, "text": "Geht schon gut los."}, {"id": 48, "start": 269.0, "end": 275.0, "text": "Der erste Performance verbesserte Gaming Handschuh."}, {"id": 49, "start": 275.0, "end": 278.0, "text": "Was nicht alles gibt."}, {"id": 50, "start": 278.0, "end": 284.0, "text": "Okay."}, {"id": 51, "start": 284.0, "end": 286.0, "text": "Da gucken wir aber noch mal drüber."}, {"id": 52, "start": 286.0, "end": 291.0, "text": "Da gucken wir aber noch mal drüber, weil eigentlich, eigentlich will ich ja Videospiele gucken."}, {"id": 53, "start": 291.0, "end": 293.0, "text": "Hier, also da, die Kategorie."}, {"id": 54, "start": 293.0, "end": 295.0, "text": "Warte mal, wo ist die wieder?"}, {"id": 55, "start": 295.0, "end": 297.0, "text": "Das ist alles versteckt, hier."}, {"id": 56, "start": 297.0, "end": 299.0, "text": "Da."}, {"id": 57, "start": 299.0, "end": 303.0, "text": "Gummis Box."}, {"id": 58, "start": 303.0, "end": 304.0, "text": "Schauen wir mal."}, {"id": 59, "start": 304.0, "end": 307.0, "text": "So, ich poste den ganzen Krempel noch mal kurz auf Twitch."}, {"id": 60, "start": 307.0, "end": 321.0, "text": "Auf Twitter."}, {"id": 61, "start": 321.0, "end": 323.0, "text": "Die Streammusik kann sich nicht entscheiden."}, {"id": 62, "start": 323.0, "end": 331.0, "text": "Guck mal, ich hab die schon, ich hab die schon übelst geboostert, die Streammusik, ey."}, {"id": 63, "start": 331.0, "end": 341.0, "text": "Man weiß nicht, Windows und Sound verträgt sich eh nicht so gut."}, {"id": 64, "start": 341.0, "end": 343.0, "text": "Ist eigentlich mein Titel richtig?"}, {"id": 65, "start": 343.0, "end": 346.0, "text": "Kickstarter Projekt Refuse Server 2019, ja, das passt."}, {"id": 66, "start": 346.0, "end": 375.0, "text": "Das passt."}, {"id": 67, "start": 375.0, "end": 379.0, "text": "Oh nee, ich hab wieder indische Tastatur."}, {"id": 68, "start": 379.0, "end": 382.0, "text": "Ich wollte grad sagen, warum schreibe ich auf Twitter so merkwürdige Zeichen."}, {"id": 69, "start": 382.0, "end": 385.0, "text": "Mein Windows stellt sich immer, hier hab ich es mittlerweile gefixt, ne."}, {"id": 70, "start": 385.0, "end": 390.0, "text": "Aber beim anderen Rechner hab ich teilweise auch immer indische Tastatur eingestellt."}, {"id": 71, "start": 390.0, "end": 404.0, "text": "Ich weiß nicht warum, nicht dass ich jemals indische Tastatur installiert hätte."}, {"id": 72, "start": 404.0, "end": 410.0, "text": "So."}, {"id": 73, "start": 410.0, "end": 412.0, "text": "Tweet ist raus."}, {"id": 74, "start": 412.0, "end": 415.0, "text": "Was sagen denn die Twitter Trends?"}, {"id": 75, "start": 415.0, "end": 418.0, "text": "Guten Rutsch, äh, sind nicht ein bisschen früh."}, {"id": 76, "start": 418.0, "end": 424.0, "text": "KronkTV, Biathlon, GZS, äh, was denn alles Trend..."}, {"id": 77, "start": 424.0, "end": 426.0, "text": "Haha, so schlimm."}, {"id": 78, "start": 426.0, "end": 430.0, "text": "Es trendet der kleine Lord und irgendwie hab ich grad schon wieder gleich Drachenlord gelesen."}, {"id": 79, "start": 430.0, "end": 435.0, "text": "Nicht dass mich das auch nur ansatzweise interessieren würde, was bei der ganzen Geschichte läuft."}, {"id": 80, "start": 435.0, "end": 443.0, "text": "Aber, ähm, man sieht's halt oft auf Twitter."}, {"id": 81, "start": 443.0, "end": 445.0, "text": "Moin Leute."}, {"id": 82, "start": 445.0, "end": 447.0, "text": "So, ähm, jetzt gucken."}, {"id": 83, "start": 447.0, "end": 451.0, "text": "Ah, noch was zu trinken am Start."}, {"id": 84, "start": 451.0, "end": 454.0, "text": "Also ich glaub wir müssen dann eh die Musik ausmachen, weil wir Kickstarter Videos gucken."}, {"id": 85, "start": 454.0, "end": 460.0, "text": "Also, was geht's denn... Warte, Sekunde."}, {"id": 86, "start": 460.0, "end": 463.0, "text": "OKS?"}, {"id": 87, "start": 463.0, "end": 465.0, "text": "Oh, ganz wichtig, ganz wichtig."}, {"id": 88, "start": 465.0, "end": 470.0, "text": "Ich hab ja was, ich hab ja was essenzielles vergessen."}, {"id": 89, "start": 470.0, "end": 473.0, "text": "Was ganz wichtiges hab ich vergessen zu starten."}, {"id": 90, "start": 473.0, "end": 476.0, "text": "Ohne geht's ja schon mal gar nicht."}, {"id": 91, "start": 476.0, "end": 480.0, "text": "Nämlich die Web Application 11."}, {"id": 92, "start": 480.0, "end": 489.0, "text": "Ohne die Web Application 11 läuft nix hier."}, {"id": 93, "start": 489.0, "end": 492.0, "text": "Web Application 11, beste."}, {"id": 94, "start": 492.0, "end": 503.0, "text": "Was hab ich jetzt? Jetzt hab ich auch noch falsch gestartet, die Web Application 11."}, {"id": 95, "start": 503.0, "end": 508.0, "text": "So, wenn ich jetzt Glück hab, reagiert Visual Studio mal wieder."}, {"id": 96, "start": 508.0, "end": 511.0, "text": "Und wenn ich Pech hab, wow."}, {"id": 97, "start": 511.0, "end": 517.0, "text": "Alter, Visual Studio nervt doch nicht so rum."}, {"id": 98, "start": 517.0, "end": 524.0, "text": "Was ist denn hier los, schon wieder."}, {"id": 99, "start": 524.0, "end": 527.0, "text": "Ich hab's extra ohne Debugging gestartet, ja."}, {"id": 100, "start": 527.0, "end": 533.0, "text": "Wenn ich was ohne Debugging starte, Visual Studio, dann erwarte ich..."}, {"id": 101, "start": 533.0, "end": 534.0, "text": "Warum, warum?"}, {"id": 102, "start": 534.0, "end": 537.0, "text": "Alter, was ist das, warum hängen das?"}, {"id": 103, "start": 537.0, "end": 540.0, "text": "Was ist denn da schon wieder los, hä?"}, {"id": 104, "start": 540.0, "end": 545.0, "text": "Unable to connect, tja, das ist eben mein Problem."}, {"id": 105, "start": 545.0, "end": 551.0, "text": "Dann lass ich Visual Studio halt auf."}, {"id": 106, "start": 551.0, "end": 555.0, "text": "Da hab ich drauf."}, {"id": 107, "start": 555.0, "end": 564.0, "text": "Ich darf drauf, nice."}, {"id": 108, "start": 564.0, "end": 568.0, "text": "Okay, funktioniert alles."}, {"id": 109, "start": 568.0, "end": 571.0, "text": "Jetzt die Musik abgekackt, zwar zu viel."}, {"id": 110, "start": 571.0, "end": 576.0, "text": "Oh, ja, wir können übrigens, also wie gesagt, wir können Weihnachtsmusik anmachen, wenn es euch danach ist."}, {"id": 111, "start": 576.0, "end": 580.0, "text": "Ich hab mir extra was rausgesucht, was nicht so nervig ist."}, {"id": 112, "start": 580.0, "end": 583.0, "text": "Relaxing, ich glaub, das ist zu relaxing."}, {"id": 113, "start": 583.0, "end": 585.0, "text": "Aber den hier mal wieder an."}, {"id": 114, "start": 585.0, "end": 589.0, "text": "Das ist auch schon ganz schön relaxing."}, {"id": 115, "start": 589.0, "end": 593.0, "text": "Wir brauchen was nicht ganz so relaxing, Hip-Hop-Beats."}, {"id": 116, "start": 593.0, "end": 596.0, "text": "Nee, das ist zu wir."}, {"id": 117, "start": 596.0, "end": 603.0, "text": "Christmas-Hip-Hop-Radio."}, {"id": 118, "start": 603.0, "end": 606.0, "text": "Ich weiß nicht."}, {"id": 119, "start": 606.0, "end": 608.0, "text": "Wie ist denn so die Lautstärke von dem?"}, {"id": 120, "start": 608.0, "end": 611.0, "text": "Nee, das ist ja auch sehr nervig."}, {"id": 121, "start": 611.0, "end": 614.0, "text": "Chill-Out-Radio, das klingt doch gut."}, {"id": 122, "start": 614.0, "end": 621.0, "text": "Ja, gut, ob das jetzt irgendwie über die Kühe fliegen ist mir jetzt nebensächlich."}, {"id": 123, "start": 621.0, "end": 624.0, "text": "Guck mal, meine Maus ist übelst kaputt."}, {"id": 124, "start": 624.0, "end": 625.0, "text": "Habt ihr es gesehen?"}, {"id": 125, "start": 625.0, "end": 628.0, "text": "Ich leg hier rein, zieh das hoch und dann..."}, {"id": 126, "start": 628.0, "end": 629.0, "text": "Dann tracken."}, {"id": 127, "start": 629.0, "end": 631.0, "text": "Die YouTube mal wieder verbackt."}, {"id": 128, "start": 631.0, "end": 632.0, "text": "Lull."}, {"id": 129, "start": 632.0, "end": 636.0, "text": "Aber das ist ja nichts Neues."}, {"id": 130, "start": 636.0, "end": 639.0, "text": "Kann ich sogar wieder ein bisschen leiser machen."}, {"id": 131, "start": 639.0, "end": 640.0, "text": "Easy."}, {"id": 132, "start": 640.0, "end": 642.0, "text": "Easy."}, {"id": 133, "start": 642.0, "end": 644.0, "text": "Ah so, easy."}, {"id": 134, "start": 644.0, "end": 648.0, "text": "Easy."}, {"id": 135, "start": 648.0, "end": 652.0, "text": "Was hast du für eine Maus und Tastatur?"}, {"id": 136, "start": 652.0, "end": 657.0, "text": "Nachdem ich die letzten paar Jahre für meine Verhältnisse viele Mäuse ausprobiert habe,"}, {"id": 137, "start": 657.0, "end": 661.0, "text": "bin ich jetzt hängen geblieben bei einer Logitech G403."}, {"id": 138, "start": 661.0, "end": 663.0, "text": "Die Kabelvariante."}, {"id": 139, "start": 663.0, "end": 671.0, "text": "Und auf der Arbeit habe ich eine Ducky One Skyline Tastatur."}, {"id": 140, "start": 671.0, "end": 676.0, "text": "Und daheim habe ich eine Corsair Platinum K95."}, {"id": 141, "start": 676.0, "end": 681.0, "text": "Und die Software, ich sag's euch, die Software von dieser Tastatur, ich zeig euch das mal,"}, {"id": 142, "start": 681.0, "end": 686.0, "text": "da fallen mir die Haare vorn aus."}, {"id": 143, "start": 686.0, "end": 687.0, "text": "Allein schon das wieder."}, {"id": 144, "start": 687.0, "end": 690.0, "text": "Was hat es denn jetzt schon für Probleme?"}, {"id": 145, "start": 690.0, "end": 693.0, "text": "Was genau hat es für Schmerzen?"}, {"id": 146, "start": 693.0, "end": 699.0, "text": "Profiled Conflict."}, {"id": 147, "start": 699.0, "end": 706.0, "text": "To resolve conflict, click yes."}, {"id": 148, "start": 706.0, "end": 709.0, "text": "Nee, click save."}, {"id": 149, "start": 709.0, "end": 710.0, "text": "Das war's jetzt oder was?"}, {"id": 150, "start": 710.0, "end": 712.0, "text": "Also guck mal, das ist auch schon übelslam."}, {"id": 151, "start": 712.0, "end": 715.0, "text": "Du klickst hier drauf, es braucht eine halbe Stunde bis es geswitcht ist."}, {"id": 152, "start": 715.0, "end": 716.0, "text": "Ganz ganz schlimm."}, {"id": 153, "start": 716.0, "end": 719.0, "text": "Also diese Corsair Software ist wirklich grausam."}, {"id": 154, "start": 719.0, "end": 720.0, "text": "Ganz ganz grausam."}, {"id": 155, "start": 720.0, "end": 721.0, "text": "Also wirklich wirklich grausam."}, {"id": 156, "start": 721.0, "end": 725.0, "text": "Aber man kann jetzt natürlich irgendwie diese komischen Lightning Effekte anmachen,"}, {"id": 157, "start": 725.0, "end": 729.0, "text": "die irgendwie nicht an sind."}, {"id": 158, "start": 729.0, "end": 732.0, "text": "Doch, jetzt sind sie an."}, {"id": 159, "start": 732.0, "end": 743.0, "text": "Man kann, was ich ganz cool als Effekt finde, ist Puls, war es glaube ich."}, {"id": 160, "start": 743.0, "end": 748.0, "text": "Ja, da pulst die Tastatur so vor sich hin."}, {"id": 161, "start": 748.0, "end": 749.0, "text": "Das ist eigentlich ganz nett."}, {"id": 162, "start": 749.0, "end": 752.0, "text": "Wobei es auch wieder verschenkt ist Potenziales letztendlich."}, {"id": 163, "start": 752.0, "end": 755.0, "text": "Oh, das hab ich noch nie hochgedreht hier."}, {"id": 164, "start": 755.0, "end": 757.0, "text": "Oh, da drehst du ja ab bei."}, {"id": 165, "start": 757.0, "end": 761.0, "text": "Kommst du dir ja vor wie im Krankenwagen."}, {"id": 166, "start": 761.0, "end": 767.0, "text": "Wobei auch schon ein bisschen hier die Chance verschenkt ist, dass man hier beispielsweise sagen kann,"}, {"id": 167, "start": 767.0, "end": 770.0, "text": "ich will alle farm plus, ich will eine rauslassen."}, {"id": 168, "start": 770.0, "end": 774.0, "text": "Also die Corsair Software ist wirklich scheiße, muss man echt sagen."}, {"id": 169, "start": 774.0, "end": 778.0, "text": "Und Advanced gibt lustigerweise weniger Optionen."}, {"id": 170, "start": 778.0, "end": 786.0, "text": "Guck, das ist die Auswahl für Advanced und das ist die Auswahl für Basic."}, {"id": 171, "start": 786.0, "end": 788.0, "text": "Easy Advanced."}, {"id": 172, "start": 788.0, "end": 791.0, "text": "Ich dachte eigentlich immer Advanced ist Basic und mehr."}, {"id": 173, "start": 791.0, "end": 793.0, "text": "Aber bei Corsair ist das anders."}, {"id": 174, "start": 793.0, "end": 795.0, "text": "Die Tastatur ist halt richtig cool."}, {"id": 175, "start": 795.0, "end": 798.0, "text": "Also das Spielen macht hier mit wirklich Spaß."}, {"id": 176, "start": 798.0, "end": 807.0, "text": "Tippen geht halbwegs, aber ich hab das Gefühl, die Tasten sind ein Millimeter kleiner als bei anderen Tastaturen."}, {"id": 177, "start": 807.0, "end": 809.0, "text": "Das bringt mich oft aus dem Konzept."}, {"id": 178, "start": 809.0, "end": 814.0, "text": "Deswegen seht ihr mich in letzter Zeit auch oft zu extrem verdrücken, wenn ich irgendwas schreiben will."}, {"id": 179, "start": 814.0, "end": 816.0, "text": "Ihr erinnert euch ja noch hier dran."}, {"id": 180, "start": 816.0, "end": 820.0, "text": "Wenn ich anfangen will, Kinsle, die Konsole."}, {"id": 181, "start": 820.0, "end": 822.0, "text": "Ja, funktioniert nicht."}, {"id": 182, "start": 822.0, "end": 824.0, "text": "Und das liegt an der Tastatur."}, {"id": 183, "start": 824.0, "end": 827.0, "text": "Ja, und auf der Arbeit hab ich mir extra hier noch eine geholt."}, {"id": 184, "start": 827.0, "end": 832.0, "text": "Und die ist zum Schreiben und vom Gefühl her eigentlich viel nicer."}, {"id": 185, "start": 832.0, "end": 834.0, "text": "Nämlich die da."}, {"id": 186, "start": 834.0, "end": 836.0, "text": "Ich glaub das ist aber eine Two oder so, die ich hab."}, {"id": 187, "start": 836.0, "end": 837.0, "text": "Genau."}, {"id": 188, "start": 837.0, "end": 839.0, "text": "Die mit Nummer."}, {"id": 189, "start": 839.0, "end": 841.0, "text": "Ich bin NumBlock-Fan."}, {"id": 190, "start": 841.0, "end": 842.0, "text": "Ich mag NumBlocks."}, {"id": 191, "start": 842.0, "end": 845.0, "text": "Die hat auch so schöne Beschichtung oben."}, {"id": 192, "start": 845.0, "end": 852.0, "text": "Oder generell sind die Tasten bei der aus Plastik, was sich ein bisschen rauer anfühlt."}, {"id": 193, "start": 852.0, "end": 854.0, "text": "Das macht insgesamt einen besseren Eindruck."}, {"id": 194, "start": 854.0, "end": 857.0, "text": "Und auf jeden Fall, was man mit beiden Tastaturen kann."}, {"id": 195, "start": 857.0, "end": 863.0, "text": "Wenn der Eintrecher einen nachts überrascht und man sitzt auch am Rechner, dann kann man ihn mit der Tastatur easy ownen."}, {"id": 196, "start": 863.0, "end": 865.0, "text": "Die Tastaturen sind wirklich schwer."}, {"id": 197, "start": 865.0, "end": 866.0, "text": "Die kannst du als Waffe einsetzen."}, {"id": 198, "start": 866.0, "end": 867.0, "text": "Die sind gefährlich."}, {"id": 199, "start": 867.0, "end": 869.0, "text": "Beide, beide."}, {"id": 200, "start": 869.0, "end": 873.0, "text": "Die hat unten auch ein bisschen ein Polster dran."}, {"id": 201, "start": 873.0, "end": 881.0, "text": "Und die Tasten sind halt bei der hier zum Schreiben und zum Arbeiten richtig cool."}, {"id": 202, "start": 881.0, "end": 886.0, "text": "Und zum Spielen sind die Tasten hier schon ein bisschen mehr responsive."}, {"id": 203, "start": 886.0, "end": 887.0, "text": "Das merkt man."}, {"id": 204, "start": 887.0, "end": 891.0, "text": "Zumindest bild ich mir das ein, dass man das merkt."}, {"id": 205, "start": 891.0, "end": 897.0, "text": "Aber an sich macht es irgendwie einen billigeren Eindruck, obwohl es teurer ist."}, {"id": 206, "start": 897.0, "end": 898.0, "text": "Komisch eigentlich."}, {"id": 207, "start": 903.0, "end": 904.0, "text": "Naja."}, {"id": 208, "start": 904.0, "end": 906.0, "text": "Gut, da sind wir stehen geblieben."}, {"id": 209, "start": 906.0, "end": 908.0, "text": "Genau, Kickstarter."}, {"id": 210, "start": 908.0, "end": 910.0, "text": "Haben wir jetzt schon sortiert, das Ganze."}, {"id": 211, "start": 910.0, "end": 912.0, "text": "So, wir haben sortiert nach Spielen."}, {"id": 212, "start": 912.0, "end": 914.0, "text": "Wir haben sortiert nach Hardware."}, {"id": 213, "start": 914.0, "end": 924.0, "text": "Leute, seid ihr bereit für den World First Performance Enhancing Gaming Glove?"}, {"id": 214, "start": 924.0, "end": 934.0, "text": "Seid ihr bereit für den Handschuh, der eure Performance, euer Aim, eure KD, eure 360 Noscopes und Quickscopes verbessert?"}, {"id": 215, "start": 938.0, "end": 940.0, "text": "Ich mach mal kurz Musik aus."}, {"id": 216, "start": 940.0, "end": 943.0, "text": "Eigentlich brauchen wir keine Musik, weil wir Kickstarter haben."}, {"id": 217, "start": 943.0, "end": 945.0, "text": "Gucken wir uns das Ganze mal an."}, {"id": 218, "start": 945.0, "end": 947.0, "text": "Ihr müsst mir gleich nochmal sagen, ob die Lautstärke okay ist."}, {"id": 219, "start": 947.0, "end": 950.0, "text": "Also, World First Performance Enhancing Gaming Glove."}, {"id": 220, "start": 953.0, "end": 954.0, "text": "Video?"}, {"id": 221, "start": 954.0, "end": 973.0, "text": "The gaming industry is growing bigger and bigger every day. Millions of people are using a computer mouse for gaming and encounter the discomfort of high friction against the mouse pad and the lack of stability while maneuvering the mouse. Because of this, gamers around the world are performing worse and suffer from injuries."}, {"id": 222, "start": 973.0, "end": 974.0, "text": "Moment, was? Moment, Moment."}, {"id": 223, "start": 974.0, "end": 976.0, "text": "Warte mal, das muss ich mir nochmal hören."}, {"id": 224, "start": 976.0, "end": 992.0, "text": "The gaming industry is growing bigger and bigger every day. Millions of people are using a computer mouse for gaming and encounter the discomfort of high friction against the mouse pad and the lack of stability while maneuvering the mouse. Because of this, gamers around the world are performing worse and suffer from injuries."}, {"id": 225, "start": 992.0, "end": 1007.0, "text": "Seriously? Ich hatte noch nie, also ich hatte noch nie Injuries dadurch, dass ich mir die Hand am Mousepad aufgerieben hab oder so."}, {"id": 226, "start": 1007.0, "end": 1012.0, "text": "Ich bin immer auf einem hohen Niveau und versuche immer, mein Gameplay zu verbessern und mich nicht zu verletzen."}, {"id": 227, "start": 1012.0, "end": 1018.0, "text": "Während der letzten 2 Jahre habe ich versucht, eine Lösung zu finden für die Probleme, die die Gamer täglich im Computer haben."}, {"id": 228, "start": 1018.0, "end": 1024.0, "text": "Und ich bin so glücklich, die World's First Performance Enhancing Gaming Glove zu zeigen."}, {"id": 229, "start": 1024.0, "end": 1042.0, "text": "Das sieht aus wie eine Schiene, wenn man sich den Arm gebrochen hat, ein bisschen. Aber eben die Idee ist gar nicht so blöd."}, {"id": 230, "start": 1054.0, "end": 1076.0, "text": "Das ist nicht verkehrt."}, {"id": 231, "start": 1076.0, "end": 1103.0, "text": "Wenn es zu waffe ist, kannst du dir auch ein Ei draufbacken."}, {"id": 232, "start": 1103.0, "end": 1122.0, "text": "Die Musik?"}, {"id": 233, "start": 1122.0, "end": 1150.0, "text": "Das sieht aus wie so ein thrombose-Stropf. So was hat mein Opa auch immer."}, {"id": 234, "start": 1150.0, "end": 1155.0, "text": "Alter, take my money!"}, {"id": 235, "start": 1155.0, "end": 1158.0, "text": "Oh, das ist schon richtig übel. Nice, guck mal hier."}, {"id": 236, "start": 1158.0, "end": 1164.0, "text": "Der wollte 9.730, so krass kalkuliert, nicht einfach 9.000 oder 10.000. Nein, 9.730."}, {"id": 237, "start": 1164.0, "end": 1167.0, "text": "Wobei, das könnte sein der Umrechnungskurs."}, {"id": 238, "start": 1167.0, "end": 1174.0, "text": "Ach, das sind Schweden, Schwedische Kronen oder sowas."}, {"id": 239, "start": 1174.0, "end": 1184.0, "text": "Auch wenn ich so meine persönlichen Zweifel habe bei solchen Produkten, dass das wirklich immer so geil ist, wie es angepriesen wird."}, {"id": 240, "start": 1184.0, "end": 1188.0, "text": "Aber das finde ich nicht schlecht."}, {"id": 241, "start": 1188.0, "end": 1191.0, "text": "Ich poste das euch mal rein."}, {"id": 242, "start": 1191.0, "end": 1194.0, "text": "Ich finde das nicht schlecht."}, {"id": 243, "start": 1194.0, "end": 1207.0, "text": "Ich meine, im schlimmsten Fall bringt es nichts. Was soll denn der Spaß kosten am Ende?"}, {"id": 244, "start": 1207.0, "end": 1214.0, "text": "Sleeve Early Bird kostet 25 Dollar, das geht doch sogar noch."}, {"id": 245, "start": 1214.0, "end": 1229.0, "text": "Oh, da müsst ihr euch aber... Guck mal, und das gibt es schon im Februar. Das kann man becken und dann gucken, was Sache ist."}, {"id": 246, "start": 1229.0, "end": 1232.0, "text": "Eigentlich gar nicht. Ich glaube, das werde ich becken nachher."}, {"id": 247, "start": 1232.0, "end": 1239.0, "text": "Ich glaube, da gebe ich nachher meine Kohle für aus."}, {"id": 248, "start": 1239.0, "end": 1247.0, "text": "Haben wir nicht irgendwie mal ordentliche Hintergrundmusik?"}, {"id": 249, "start": 1247.0, "end": 1251.0, "text": "Best Zelda Music Compilation."}, {"id": 250, "start": 1251.0, "end": 1266.0, "text": "So, alles."}, {"id": 251, "start": 1266.0, "end": 1273.0, "text": "Wir machen Zelda-Dings die 20, 20... Die ist übelst nice."}, {"id": 252, "start": 1273.0, "end": 1278.0, "text": "Die ist mega nice. Die geht leider nur 45 Minuten."}, {"id": 253, "start": 1278.0, "end": 1290.0, "text": "Ach so, ich sollte vielleicht mal ein bisschen lauter machen."}, {"id": 254, "start": 1290.0, "end": 1300.0, "text": "Kirby Musik. Oh ja, Kirby Musik, endlich. Hat man schon so lange nicht mehr. Gefühlt schon Monate nicht mehr."}, {"id": 255, "start": 1300.0, "end": 1329.0, "text": "Kirby Gummy Race 10 Stunden. Bäm. Endlich wieder."}, {"id": 256, "start": 1329.0, "end": 1337.0, "text": "Oh, das ist gut. Das ist gute Hintergrundmusik. Beste."}, {"id": 257, "start": 1337.0, "end": 1342.0, "text": "Weiß jemand zufällig, wie man am dümmsten Daten von einem iPhone auf einen OnePlus überträgt?"}, {"id": 258, "start": 1342.0, "end": 1356.0, "text": "Also am dümmsten wahrscheinlich über irgendeinen Cloudsync oder so."}, {"id": 259, "start": 1356.0, "end": 1359.0, "text": "Okay, der Gaming-Sleeve. Ich hab's noch in den Chat gepostet."}, {"id": 260, "start": 1359.0, "end": 1362.0, "text": "Oh, das sieht... Ich find's von der Idee her gar nicht so schlecht."}, {"id": 261, "start": 1362.0, "end": 1368.0, "text": "Das ist jetzt wirklich meine Gaming-Performance so krass enhanced, wie sie sich das hier erzählen."}, {"id": 262, "start": 1368.0, "end": 1372.0, "text": "Ich hab so meine Zweifel dran, aber von der Idee her ist das mal wenigstens was Neues."}, {"id": 263, "start": 1372.0, "end": 1376.0, "text": "Und nach den ganzen Gaming-Utensilen, die wir uns in letzter Zeit so angeguckt haben,"}, {"id": 264, "start": 1376.0, "end": 1384.0, "text": "zum Beispiel Gaming-Tische, die komplett useless waren, dann doch lieber sowas."}, {"id": 265, "start": 1384.0, "end": 1391.0, "text": "So. Und man kriegt schon welche Early Bird-Sleeve hier."}, {"id": 266, "start": 1391.0, "end": 1400.0, "text": "Hat sich... Die Währung hat sich umgestellt."}, {"id": 267, "start": 1400.0, "end": 1404.0, "text": "Warum hat sich die Währung umgestellt? Moment."}, {"id": 268, "start": 1404.0, "end": 1408.0, "text": "Ah nee, hier. 25 Dollar gibt's einen."}, {"id": 269, "start": 1408.0, "end": 1415.0, "text": "Guck mal, da sind nur noch 6 Stück übrig. Da müssen wir jetzt theoretisch..."}, {"id": 270, "start": 1415.0, "end": 1419.0, "text": "Können wir das vielleicht in Deutsch..."}, {"id": 271, "start": 1419.0, "end": 1425.0, "text": "Können wir das nicht mal umrechnen irgendwie?"}, {"id": 272, "start": 1425.0, "end": 1429.0, "text": "Also nach Deutschland kostet es wie viel?"}, {"id": 273, "start": 1429.0, "end": 1432.0, "text": "29 Euro. Okay."}, {"id": 274, "start": 1432.0, "end": 1438.0, "text": "Naja. Kann man machen."}, {"id": 275, "start": 1438.0, "end": 1442.0, "text": "Gut, nice. Next."}, {"id": 276, "start": 1442.0, "end": 1445.0, "text": "Game Attack. Customize your game."}, {"id": 277, "start": 1445.0, "end": 1446.0, "text": "What?"}, {"id": 278, "start": 1446.0, "end": 1448.0, "text": "Professional Controller, Custom..."}, {"id": 279, "start": 1448.0, "end": 1452.0, "text": "Na, das kommt man uns nicht an. Das ist irgendwie..."}, {"id": 280, "start": 1452.0, "end": 1461.0, "text": "Was soll das überhaupt sein?"}, {"id": 281, "start": 1461.0, "end": 1463.0, "text": "Hm?"}, {"id": 282, "start": 1463.0, "end": 1470.0, "text": "Ach so, man kann irgendwie das gleiche Teil an jetzt irgendwie einen Gamecube-Controller machen."}, {"id": 283, "start": 1470.0, "end": 1476.0, "text": "Das soll ein Gamecube-Controller sein. Warum?"}, {"id": 284, "start": 1476.0, "end": 1480.0, "text": "Warum? Was mache ich damit? Wozu brauche ich das?"}, {"id": 285, "start": 1480.0, "end": 1482.0, "text": "Weiß ich nicht."}, {"id": 286, "start": 1482.0, "end": 1484.0, "text": "Bonus-Tracking da ist wohl."}, {"id": 287, "start": 1484.0, "end": 1490.0, "text": "Okay, das ist für Leute, die Offline-Games spielen vielleicht nicht schlecht."}, {"id": 288, "start": 1490.0, "end": 1500.0, "text": "So, ähm..."}, {"id": 289, "start": 1500.0, "end": 1503.0, "text": "Wer braucht so ein Gamebook?"}, {"id": 290, "start": 1503.0, "end": 1508.0, "text": "Mobile, Playstation, Xbox, Laptop for everybody."}, {"id": 291, "start": 1508.0, "end": 1514.0, "text": "Moment, die können nicht einfach Playstation, Xbox-Dinger verkaufen?"}, {"id": 292, "start": 1514.0, "end": 1518.0, "text": "Es sei denn..."}, {"id": 293, "start": 1518.0, "end": 1525.0, "text": "Das Ding sieht ja mal mega hässlich aus. Was soll das?"}, {"id": 294, "start": 1525.0, "end": 1533.0, "text": "Bei Optik eigentlich fast egal. Wobei man einfach Dinge an den tragen kann."}, {"id": 295, "start": 1533.0, "end": 1535.0, "text": "Arduino Game Boy."}, {"id": 296, "start": 1535.0, "end": 1536.0, "text": "Braucht man eigentlich auch nicht."}, {"id": 297, "start": 1536.0, "end": 1541.0, "text": "Nintendo Switch Pro Controller Joystick Fix."}, {"id": 298, "start": 1541.0, "end": 1544.0, "text": "Was muss man am..."}, {"id": 299, "start": 1544.0, "end": 1553.0, "text": "Was muss man daran fixen? Weiß das jemand?"}, {"id": 300, "start": 1553.0, "end": 1555.0, "text": "Hallo Video?"}, {"id": 301, "start": 1555.0, "end": 1563.0, "text": "Oh, High Quality. High Quality Render. Ich sehe es schon hier."}, {"id": 302, "start": 1563.0, "end": 1568.0, "text": "Was geht?"}, {"id": 303, "start": 1568.0, "end": 1577.0, "text": "Ohne. Kirby muss mal aus."}, {"id": 304, "start": 1577.0, "end": 1590.0, "text": "Ist das echt so?"}, {"id": 305, "start": 1590.0, "end": 1604.0, "text": "Na gut."}, {"id": 306, "start": 1604.0, "end": 1616.0, "text": "Das war der N64-Controller, der ist dick. Da war wirklich crap das Ding."}, {"id": 307, "start": 1616.0, "end": 1630.0, "text": "Die Musik?"}, {"id": 308, "start": 1630.0, "end": 1639.0, "text": "Das braucht doch kein Mensch, oder? Braucht man das?"}, {"id": 309, "start": 1639.0, "end": 1644.0, "text": "Okay, das ist im Prinzip einfach ein Metallring."}, {"id": 310, "start": 1644.0, "end": 1646.0, "text": "Next."}, {"id": 311, "start": 1646.0, "end": 1648.0, "text": "Arcana wäre nichts für mich."}, {"id": 312, "start": 1648.0, "end": 1650.0, "text": "Oculus Rift."}, {"id": 313, "start": 1650.0, "end": 1654.0, "text": "Gibt es mal wieder was? Ach nee, die werde auch mal entgehen."}, {"id": 314, "start": 1654.0, "end": 1659.0, "text": "Danach kriegt glaube ich keinen Hahn mehr."}, {"id": 315, "start": 1659.0, "end": 1667.0, "text": "Das ist schon wieder voll vorbei."}, {"id": 316, "start": 1667.0, "end": 1671.0, "text": "Oh, das muss ich mir einem Kollegen schicken, weil ich weiß nicht ob ich es mal im..."}, {"id": 317, "start": 1671.0, "end": 1676.0, "text": "Ob ich mal im Stream erzählt habe, aber ein Kollege von mir ist dabei, so eine Arcade-Gaminghalle zu bauen."}, {"id": 318, "start": 1676.0, "end": 1679.0, "text": "So mit solchen Dingern hier."}, {"id": 319, "start": 1679.0, "end": 1683.0, "text": "Und das muss ich ihm mal zeigen, vielleicht ist das ja was für den."}, {"id": 320, "start": 1683.0, "end": 1696.0, "text": "Da muss ich dann irgendwann mal, wenn das Ding fertig ist, muss ich dann auch mal ein bisschen Promotion machen, aber das dauert noch."}, {"id": 321, "start": 1696.0, "end": 1701.0, "text": "So, ich glaube, Hardware-Projekte haben wir genug geguckt, da ist jetzt nichts sonderlich Geiles dabei."}, {"id": 322, "start": 1701.0, "end": 1704.0, "text": "Der Gaming-Glove war natürlich wieder das Highlight jetzt hier."}, {"id": 323, "start": 1704.0, "end": 1708.0, "text": "Kleiner Favorit, ich bin nicht eingeloggt. Ich kann mich jetzt auch hier ausdrücklich einloggen."}, {"id": 324, "start": 1708.0, "end": 1711.0, "text": "Okay, gucken wir mal Gaming-Projekte. Was gibt es denn hier?"}, {"id": 325, "start": 1711.0, "end": 1718.0, "text": "96 Projekte? Moment."}, {"id": 326, "start": 1718.0, "end": 1723.0, "text": "Warum nur 96 Projekte?"}, {"id": 327, "start": 1723.0, "end": 1728.0, "text": "Ich habe irgendetwas verkehrt sortiert."}, {"id": 328, "start": 1728.0, "end": 1731.0, "text": "Spiele."}, {"id": 329, "start": 1731.0, "end": 1735.0, "text": "Projekte in Spiele erkunden."}, {"id": 330, "start": 1735.0, "end": 1739.0, "text": "Spiele. Das Textartal, die Sortierfunktion ist ganz, ganz merkwürdig."}, {"id": 331, "start": 1739.0, "end": 1741.0, "text": "Videospiele."}, {"id": 332, "start": 1741.0, "end": 1743.0, "text": "12.000 Projekte."}, {"id": 333, "start": 1743.0, "end": 1748.0, "text": "Okay. Und witzigerweise, die Sucheinstellungen sehen genau gleich aus."}, {"id": 334, "start": 1748.0, "end": 1752.0, "text": "Sortiert nach..."}, {"id": 335, "start": 1752.0, "end": 1756.0, "text": "Was ist denn da? Was meint ihr jetzt am besten? Beliebtheitsortieren oder Erscheinungsdatum?"}, {"id": 336, "start": 1756.0, "end": 1762.0, "text": "Oder Datum bis Ablauf?"}, {"id": 337, "start": 1762.0, "end": 1765.0, "text": "Oh, Enddatum."}, {"id": 338, "start": 1765.0, "end": 1768.0, "text": "Oh nein, Graphic Novels wieder. Please! Nicht schon wieder!"}, {"id": 339, "start": 1768.0, "end": 1773.0, "text": "Das letzte Mal hat er halbe Stream aus irgendwelchen..."}, {"id": 340, "start": 1773.0, "end": 1778.0, "text": "Aja, ja!"}, {"id": 341, "start": 1778.0, "end": 1781.0, "text": "Wo ist das sein? Immer!"}, {"id": 342, "start": 1781.0, "end": 1784.0, "text": "Der war eine krasse Weepshit."}, {"id": 343, "start": 1784.0, "end": 1793.0, "text": "Sag mal, macht diese Graphic Novel Geschichten, macht das kein großer Hersteller?"}, {"id": 344, "start": 1793.0, "end": 1801.0, "text": "Weil, das kann doch nicht sein, dass die Dinger so übertrieben beliebt sind."}, {"id": 345, "start": 1801.0, "end": 1804.0, "text": "Ich verstehe immer noch nicht..."}, {"id": 346, "start": 1804.0, "end": 1812.0, "text": "... warum das hier so unterschiedlich ist, die Kategorie."}, {"id": 347, "start": 1812.0, "end": 1818.0, "text": "Zu null!"}, {"id": 348, "start": 1818.0, "end": 1822.0, "text": "Okay, dann gucken wir uns erstmal diese Seite an, weil die hat hier nur 6 90 Projekte."}, {"id": 349, "start": 1822.0, "end": 1824.0, "text": "Und weil wir jetzt halb auch immer..."}, {"id": 350, "start": 1824.0, "end": 1832.0, "text": "Okay, Team Favorite. Ach, das sind quasi Recomment oder sowas, ne?"}, {"id": 351, "start": 1832.0, "end": 1839.0, "text": "Weil das Team Favorite Games sind, oder auch nicht?"}, {"id": 352, "start": 1839.0, "end": 1845.0, "text": "Okay, Leute, seid ihr bereit für den krassen Weepshit?"}, {"id": 353, "start": 1845.0, "end": 1849.0, "text": "Enddatum. Oho, ganze 480 Euro möchte er haben."}, {"id": 354, "start": 1849.0, "end": 1855.0, "text": "Pixel... wie, da gibt es überhaupt kein Weepvideo zu?"}, {"id": 355, "start": 1855.0, "end": 1861.0, "text": "Bei dem habe ich live und beim anderen nicht? Ja, was ist live überhaupt?"}, {"id": 356, "start": 1861.0, "end": 1874.0, "text": "Live. Was ist live?"}, {"id": 357, "start": 1874.0, "end": 1878.0, "text": "A new way of bringing creative projects alive."}, {"id": 358, "start": 1878.0, "end": 1884.0, "text": "Moment, sind das Typen, die irgendwie streamen oder so?"}, {"id": 359, "start": 1884.0, "end": 1890.0, "text": "Ach, das sind die Typen, die live streamen."}, {"id": 360, "start": 1890.0, "end": 1896.0, "text": "Das heißt, der Dude hier ist am live streamen. Sehe ich das richtig?"}, {"id": 361, "start": 1896.0, "end": 1898.0, "text": "Oder auch nicht?"}, {"id": 362, "start": 1898.0, "end": 1902.0, "text": "Ach, keine Ahnung. Kickstarter."}, {"id": 363, "start": 1902.0, "end": 1905.0, "text": "Ja, färben ganz einfach. Okay, das müssen wir uns hier angucken, die haben kein Video."}, {"id": 364, "start": 1905.0, "end": 1908.0, "text": "Projekte ohne Videos finde ich doof."}, {"id": 365, "start": 1908.0, "end": 1912.0, "text": "Das sieht mir aber nach..."}, {"id": 366, "start": 1912.0, "end": 1920.0, "text": "So wie es 100.000 Stück auf Kickstarter gibt."}, {"id": 367, "start": 1920.0, "end": 1931.0, "text": "So, Winter Wanderer. Science Fiction Travel Action RPG."}, {"id": 368, "start": 1931.0, "end": 1936.0, "text": "Gucken wir mal."}, {"id": 369, "start": 1936.0, "end": 1942.0, "text": "Die Videos kacken übelst ab, ne? Die brauchen voll lang zum Laden."}, {"id": 370, "start": 1942.0, "end": 1946.0, "text": "Oh, schon mal nice Grafik."}, {"id": 371, "start": 1946.0, "end": 1953.0, "text": "WTF."}, {"id": 372, "start": 1953.0, "end": 1956.0, "text": "Das ist aber ganz schön bauchfrei."}, {"id": 373, "start": 1956.0, "end": 1974.0, "text": "Das ist wichtig, hier ist man besonders gut gepanzert."}, {"id": 374, "start": 1974.0, "end": 1984.0, "text": "Was, was, was genau gucke ich mir da an?"}, {"id": 375, "start": 1984.0, "end": 2000.0, "text": "Oh, Band, Band, Monkathos."}, {"id": 376, "start": 2000.0, "end": 2024.0, "text": "WTF. Ich weiß ja nicht."}, {"id": 377, "start": 2024.0, "end": 2032.0, "text": "Na, ich weiß nicht."}, {"id": 378, "start": 2032.0, "end": 2036.0, "text": "Da passiert da noch mal irgendwas."}, {"id": 379, "start": 2036.0, "end": 2040.0, "text": "Oh, das ist eher Puzzle. Puzzle, Puzzle."}, {"id": 380, "start": 2040.0, "end": 2042.0, "text": "Oh, Fight."}, {"id": 381, "start": 2042.0, "end": 2049.0, "text": "Krasser Fight. Bäm, weggeslided."}, {"id": 382, "start": 2049.0, "end": 2057.0, "text": "Okay, um was gehts denn eigentlich? Was wollt ihr uns sagen?"}, {"id": 383, "start": 2057.0, "end": 2073.0, "text": "Wie sie abliest."}, {"id": 384, "start": 2073.0, "end": 2076.0, "text": "Okay, um was gehts?"}, {"id": 385, "start": 2076.0, "end": 2080.0, "text": "Das sah absolut nicht nach Zelda Classic Gameplay aus."}, {"id": 386, "start": 2080.0, "end": 2088.0, "text": "Absolut nicht."}, {"id": 387, "start": 2088.0, "end": 2093.0, "text": "2018er Playstation Awards Spanien nominiert."}, {"id": 388, "start": 2093.0, "end": 2100.0, "text": "Wenn ich mir angucke, was für die komischen deutschen Gaming Awards da immer nominiert ist, dann heißt es erstmal gar nichts."}, {"id": 389, "start": 2100.0, "end": 2108.0, "text": "Okay, ich hab keine Ahnung, was das sein soll. Außer, dass es angeblich Zelda Style ist und..."}, {"id": 390, "start": 2108.0, "end": 2112.0, "text": "Ja, die anscheinend wohl auch schon mal ein Game gemacht haben. Ich hab keine Ahnung."}, {"id": 391, "start": 2112.0, "end": 2114.0, "text": "Nicht meins. Okay, nächst."}, {"id": 392, "start": 2114.0, "end": 2117.0, "text": "Ruins to Rumble. Das ist noch mehr Pixels."}, {"id": 393, "start": 2117.0, "end": 2127.0, "text": "Wisst ihr, 10 Pixel waren zu viel. Wir sind bei einem Pixel angekommen."}, {"id": 394, "start": 2127.0, "end": 2131.0, "text": "Mein Sound ist nicht kaputt. Das hat keinen Sound."}, {"id": 395, "start": 2131.0, "end": 2134.0, "text": "Ich werde... Was ist das denn?"}, {"id": 396, "start": 2134.0, "end": 2146.0, "text": "Ich werde mal den passenden Sound kurz einplatten."}, {"id": 397, "start": 2146.0, "end": 2158.0, "text": "Was?"}, {"id": 398, "start": 2158.0, "end": 2162.0, "text": "Was seh ich da überhaupt?"}, {"id": 399, "start": 2162.0, "end": 2168.0, "text": "Er kann Baumstämme aneinander bauen oder Holzdinger aneinander und dann schweben sie in der Luft."}, {"id": 400, "start": 2168.0, "end": 2177.0, "text": "Und das ist so Terraria Light oder..."}, {"id": 401, "start": 2177.0, "end": 2182.0, "text": "Pavillion Man. Ja, das können wir machen am Ende des Jahres. Das schreib ich mir mal auf."}, {"id": 402, "start": 2182.0, "end": 2197.0, "text": "Okay, ich hab keine Ahnung, was in dem Game gehen soll. Aber es sieht jetzt nicht so exciting aus irgendwie."}, {"id": 403, "start": 2197.0, "end": 2203.0, "text": "Das sieht mega langweilig aus."}, {"id": 404, "start": 2203.0, "end": 2207.0, "text": "Was machen die da überhaupt? Was geht's da?"}, {"id": 405, "start": 2207.0, "end": 2217.0, "text": "Frederico. Das ist der von Miracoli."}, {"id": 406, "start": 2217.0, "end": 2219.0, "text": "Okay."}, {"id": 407, "start": 2219.0, "end": 2223.0, "text": "Er hat einen Ausruf. Hat er eine Quest oder wie? Oder was? Oder warum?"}, {"id": 408, "start": 2223.0, "end": 2228.0, "text": "Das ist absolut nichts. Okay, keine Ahnung."}, {"id": 409, "start": 2228.0, "end": 2236.0, "text": "Ruhige Zuhörer."}, {"id": 410, "start": 2236.0, "end": 2243.0, "text": "Für 591 Euro. Easy. Also, wenn ihr das becken wollt, da."}, {"id": 411, "start": 2243.0, "end": 2246.0, "text": "Okay, next."}, {"id": 412, "start": 2246.0, "end": 2253.0, "text": "Tactic... Tactic... Ach, das Game heißt Tactics. Ich hab's... Der Satz ist einfach."}, {"id": 413, "start": 2253.0, "end": 2263.0, "text": "Tactics. A turn-based video game for PC, Mac and Linux."}, {"id": 414, "start": 2263.0, "end": 2270.0, "text": "Er möchte 32K haben. Da gucken wir doch mal für was. Kein Video."}, {"id": 415, "start": 2270.0, "end": 2277.0, "text": "Vielleicht ein bisschen optimistisch."}, {"id": 416, "start": 2277.0, "end": 2290.0, "text": "Sound... Oh, es gibt auch schon ein Battle-Theme."}, {"id": 417, "start": 2290.0, "end": 2307.0, "text": "Hauptsache Chor."}, {"id": 418, "start": 2307.0, "end": 2313.0, "text": "Das haben die sich doch garantiert aus irgendwelchen Stock-Dingern zusammen gemixt, oder?"}, {"id": 419, "start": 2313.0, "end": 2330.0, "text": "100 Pro. Oder es ist von irgendeinem Studio gekauft. Es gibt ja mittlerweile relativ viele Studios, die so Jailer-Musik und Gedöns basteln."}, {"id": 420, "start": 2330.0, "end": 2344.0, "text": "Okay, weiter geht's mit... Ich hab erst Rocket Penguin gelesen. Pocket Penguin. Gameboy-Style Adventure."}, {"id": 421, "start": 2360.0, "end": 2373.0, "text": "Oh, viel zu laut."}, {"id": 422, "start": 2373.0, "end": 2390.0, "text": "Die Musik gefällt mir."}, {"id": 423, "start": 2390.0, "end": 2397.0, "text": "Das ist stylish. Irgendwie gefällt mir das. Wobei ich keine Gameboy-Spiele mag, in der Regel."}, {"id": 424, "start": 2397.0, "end": 2416.0, "text": "Die Musik geht ab. Ich würde mir den Soundtrack kaufen, nicht das Spiel."}, {"id": 425, "start": 2416.0, "end": 2428.0, "text": "Okay, was man in dem Game genau macht, erschließt sich mir nicht so richtig. Das ist auf der einen Seite ein bisschen so Jump'n'Run-mäßig und dann irgendwie so Bomberman."}, {"id": 426, "start": 2428.0, "end": 2439.0, "text": "Weiß nicht. Und zwischendurch auf Penguin."}, {"id": 427, "start": 2439.0, "end": 2452.0, "text": "Alles klar. Sound hat mir gut gefallen. Die Demo muss ich nicht spielen. Ich glaube nicht, dass mir das Game vom Gameplay her gefällt."}, {"id": 428, "start": 2452.0, "end": 2459.0, "text": "Denn ich muss auch dazu sagen, ich bin eigentlich kein großer Fan von Gameboy-Spielen."}, {"id": 429, "start": 2459.0, "end": 2472.0, "text": "Ich hatte zwar einen Gameboy und ich hab auch relativ viel Gameboy damals gespielt, aber es war auf dem Gameboy bis vielleicht auf Link's Awakening eigentlich nichts dabei, wo ich jetzt sagen würde, oh, da erinnere ich mich gern dran."}, {"id": 430, "start": 2472.0, "end": 2487.0, "text": "Ich war kein großer Pokemon-Fan. Das ist für mich schon mal rausgefallen. Und die anderen Sachen, die es da sogar gab... Ich meine, das Mario auf dem Gameboy war übelster Crap. Also das erste. Das zweite war dann auch schon ganz okay."}, {"id": 431, "start": 2487.0, "end": 2498.0, "text": "Noch nicht. Aber das müssen wir nachher machen noch. Ich hab's ja gestern versprochen. Wir gucken uns das an."}, {"id": 432, "start": 2498.0, "end": 2504.0, "text": "Okay, weiter. Nee, das hatten wir schon."}, {"id": 433, "start": 2504.0, "end": 2521.0, "text": "Okay, Snow Ash Land. 2D-Multiplayer-Top-Down-Shooter-Game."}, {"id": 434, "start": 2521.0, "end": 2538.0, "text": "Schon 200 Euro. Du hast eine Musik, wo du denkst, jetzt kommt gleich das übelst geile, was weiß ich, Raumschiff reingeflogen. Irgendwas super Geiles. Und dann fährt dann irgendwie so ein 2D-Panzer rum."}, {"id": 435, "start": 2538.0, "end": 2558.0, "text": "Nee, das kann 2D-Panzer. Das ist ein Typ. So quasi Contra von oben. Okay, mit Craft-Elementen. Es braucht jedes Game heute Craft-Elemente. Und Survival-Elemente natürlich auch. Das geht nicht ohne."}, {"id": 436, "start": 2558.0, "end": 2572.0, "text": "Oh, diese Immersion."}, {"id": 437, "start": 2572.0, "end": 2600.0, "text": "Das sieht jetzt ehrlich gesagt ein bisschen langweilig aus. Ich meine, es gibt ja auch 3 Milliarden Spiele dieser Art jetzt."}, {"id": 438, "start": 2600.0, "end": 2607.0, "text": "Das ist schon Resilience-Liefer. Das gefällt mir nicht."}, {"id": 439, "start": 2607.0, "end": 2620.0, "text": "Aber sie haben sich mit dem Trainland zumindest so weit Mühe gegeben. Ja, das stimmt. Das hab ich mir auch gerade gedacht. Die Musik passt dazu."}, {"id": 440, "start": 2620.0, "end": 2634.0, "text": "Oh, hier wird's gecraftet. Und es werden Wege gecraftet."}, {"id": 441, "start": 2634.0, "end": 2649.0, "text": "Hast du schon was zum Epic Store gesagt? Nee. Muss ich mal kurz einladen. Ich find das gut, dass Steam da Konkurrenz kriegt. Und sie geben ja auch mehr an die Entwickler ab. Also ich find das nicht schlecht."}, {"id": 442, "start": 2649.0, "end": 2662.0, "text": "Okay, der Trainer haben sich Mühe mitgegeben."}, {"id": 443, "start": 2662.0, "end": 2670.0, "text": "Was haben wir als nächstes? Crime? Oh, Weep-Kram wieder. Eine Visual-Novel."}, {"id": 444, "start": 2670.0, "end": 2683.0, "text": "So viele. Da gibt's so viele von. Warum gibt's da so viele von? Und warum bockt sie sich ins Gesicht? Man weiß es nicht."}, {"id": 445, "start": 2683.0, "end": 2707.0, "text": "Ja. Wir müssen uns eigentlich gar nicht den Trailer angucken. Die sind alle gleich. Die sind alle gleich gefüllt. Nee, ich will mir nicht heute wieder einen ganzen Tag Brischel-Novel-Trailer angucken."}, {"id": 446, "start": 2707.0, "end": 2726.0, "text": "High-Quality-Pixel-Art sieht man hier schon mal."}, {"id": 447, "start": 2726.0, "end": 2741.0, "text": "Der hat sich auch gedacht, wie der letzte. Warum nicht mal ein Bild mit 10 Pixel machen, wenn die anderen 300 nehmen?"}, {"id": 448, "start": 2741.0, "end": 2763.0, "text": "Was genau geht da ab? Boah, HD. Moment, diesen Effekt, den müssen wir uns gerade noch mal angucken. Achtung."}, {"id": 449, "start": 2763.0, "end": 2773.0, "text": "Ich mein, HD ist vielleicht jetzt auch ein bisschen overrated. So ein bisschen vielleicht."}, {"id": 450, "start": 2773.0, "end": 2783.0, "text": "Ich mein, okay, hier konnte man auch irgendwie sagen, er wollte einfach möglichst minimalistisch das machen. Dafür ist es okay."}, {"id": 451, "start": 2783.0, "end": 2795.0, "text": "Und hier muss man jetzt sagen, das sieht kacke aus. Das tut mir leid, aber irgendwie. Ach nee, ich weiß nicht."}, {"id": 452, "start": 2795.0, "end": 2816.0, "text": "Zum Gameplay kann ich nichts sagen. Moment, was? Er benutzt Visual Studio Community Edition. Da kann man schon mal sagen, er hat sich zumindest das Richtige ausgesucht als Entwicklungsumgebung."}, {"id": 453, "start": 2816.0, "end": 2828.0, "text": "ArcadeCon. Moment, das hatten wir das letzte Mal schon. Das ist irgendwie so eine Messe, wo schon ein Euro gespendet wurde. Ein Dollar von 87. Nice."}, {"id": 454, "start": 2828.0, "end": 2838.0, "text": "Die Leute scheinen da super scharf drauf zu sein, hinzugehen."}, {"id": 455, "start": 2838.0, "end": 2849.0, "text": "Das ist entweder Zombie Survival oder ein Battle Royale Game. Sieht schon irgendwie so aus."}, {"id": 456, "start": 2849.0, "end": 2866.0, "text": "66 Euro von 350.000. Jetzt geht es aber ab hier. Schauen wir mal. What the fuck?"}, {"id": 457, "start": 2866.0, "end": 2878.0, "text": "Er hat ein paar Presets genommen und in die, äh, nicht Presets, Prefabs genommen. Das war's?"}, {"id": 458, "start": 2878.0, "end": 2886.0, "text": "What the fuck?"}, {"id": 459, "start": 2886.0, "end": 2897.0, "text": "DTF? But why? 66 Dollar sind schon gebacked."}, {"id": 460, "start": 2897.0, "end": 2907.0, "text": "Moment, das ist ein deutscher Entwickler, oder?"}, {"id": 461, "start": 2907.0, "end": 2917.0, "text": "Das ist ein deutscher Text."}, {"id": 462, "start": 2917.0, "end": 2938.0, "text": "Jetzt fehlt eigentlich noch Battle Royale. Survival, Crafting, Dinosaurier, Battle Royale, Jagdgame. Für den PC werden, welches die Möglichkeit bietet, Strukturen auf der Insel zu bauen. Und das Jagen nach Dinosaurier."}, {"id": 463, "start": 2938.0, "end": 2957.0, "text": "Stegosaurus vs. Uttaraptor. Ja, wir haben uns quasi den, was ist denn das, ne, das ist Unreal, wir haben uns den Unreal Editor genommen und ein paar Demo-Dinger drauf gebaut und uns einen Dinosaurier-Model gekauft."}, {"id": 464, "start": 2957.0, "end": 2970.0, "text": "Easy clap. Death by Bacon. Es wird immer hochkarätischer, klar, gerade."}, {"id": 465, "start": 2970.0, "end": 2987.0, "text": "Immer hochkarätischer heute. 8K für Death by Bacon. Okay, es ist zumindest nicht RPG Maker, das ist schon mal nicht schlecht. Okay, was haben wir hier zu bieten?"}, {"id": 466, "start": 2987.0, "end": 3001.0, "text": "A Comedy Metrovania Game. Im Weep-Style, jawoll, kein Video, doch."}, {"id": 467, "start": 3001.0, "end": 3014.0, "text": "Und der Rock, der wippt aber ganz schön."}, {"id": 468, "start": 3014.0, "end": 3030.0, "text": "Alle die Sounds. Alle die Sounds."}, {"id": 469, "start": 3030.0, "end": 3050.0, "text": "Das Video hängt nicht, das Game hängt."}, {"id": 470, "start": 3050.0, "end": 3063.0, "text": "Genau, gucken wir uns da gerade an."}, {"id": 471, "start": 3063.0, "end": 3066.0, "text": "Okay, kommt da noch was?"}, {"id": 472, "start": 3066.0, "end": 3082.0, "text": "Wir gucken uns jetzt mal die YouTube-Bewertung an, was die Leute da so zu schreiben. Oh, die finden das alle klasse."}, {"id": 473, "start": 3082.0, "end": 3096.0, "text": "Ich meine, es sieht zumindest optisch besser aus als die Games vorher, was absolut keine Kunst ist, wenn man sich das hier so zum Beispiel anguckt."}, {"id": 474, "start": 3096.0, "end": 3112.0, "text": "Burst Soccer und ein realistisches Fußballspiel. Okay, kein Video, nichts, sehr fein."}, {"id": 475, "start": 3112.0, "end": 3125.0, "text": "Resident Evil-like Game. Okay, da muss man gucken."}, {"id": 476, "start": 3125.0, "end": 3141.0, "text": "What?"}, {"id": 477, "start": 3141.0, "end": 3147.0, "text": "Okay, die Italiener sind am Start. Das sind Italiener, oder?"}, {"id": 478, "start": 3147.0, "end": 3164.0, "text": "Was? Was geht ab?"}, {"id": 479, "start": 3164.0, "end": 3170.0, "text": "Wie das der Trailer? Oh, jetzt kommt noch was."}, {"id": 480, "start": 3170.0, "end": 3186.0, "text": "Krasse Kiai. Aber was ich geil finde, die reden voll überzeugt. Hört euch, das war so."}, {"id": 481, "start": 3186.0, "end": 3195.0, "text": "So voll überzeugt, ey. Ich meine, es sieht zumindest optisch nicht ganz so schlimm aus wie der Rest vorher."}, {"id": 482, "start": 3195.0, "end": 3207.0, "text": "Die Laufanimation ist schon absolut die Weltklasse, die Laufanimation."}, {"id": 483, "start": 3207.0, "end": 3225.0, "text": "Aber man muss jetzt mal dazu sagen. Hätte man sowas vor ein paar Jahren gezeigt, würde man sagen, zumindest technisch haben sie was drauf."}, {"id": 484, "start": 3225.0, "end": 3233.0, "text": "Das kann man heute aber gar nicht mehr so sagen, weil du nimmst dir irgendwie einen Unity oder einen Unreal, lädst du dir runter und das Game sieht halt,"}, {"id": 485, "start": 3233.0, "end": 3237.0, "text": "wenn man halbwegs kompetent ein ordentliches Level baut, das sieht halt gut aus."}, {"id": 486, "start": 3237.0, "end": 3244.0, "text": "Dann kaufst du dir aus dem Shop noch ein paar Models und dann sieht das halt einfach ganz gut aus."}, {"id": 487, "start": 3244.0, "end": 3247.0, "text": "So einem guten Game macht es das natürlich noch lange nicht."}, {"id": 488, "start": 3247.0, "end": 3252.0, "text": "Okay, die wollen einfach mal 100k, easy, clap, 100k, kein Ding."}, {"id": 489, "start": 3252.0, "end": 3265.0, "text": "Okay, weiter geht's. Echoes VR. Oh, die sind schon ziemlich, ziemlich weit gebacked."}, {"id": 490, "start": 3265.0, "end": 3285.0, "text": "Nein, hab ich nicht."}, {"id": 491, "start": 3285.0, "end": 3302.0, "text": "Okay, man sieht alle rumgewackelt schon, das ist ein VR-Game."}, {"id": 492, "start": 3302.0, "end": 3331.0, "text": "Mein Ancient Distrier. Das stimmt."}, {"id": 493, "start": 3331.0, "end": 3336.0, "text": "Das Interface erinnert mich ein bisschen an Dead Space."}, {"id": 494, "start": 3336.0, "end": 3365.0, "text": "Findet ihr das auch?"}, {"id": 495, "start": 3365.0, "end": 3375.0, "text": "Es soll einen erschrecken."}, {"id": 496, "start": 3375.0, "end": 3379.0, "text": "Okay, passiert jetzt noch was?"}, {"id": 497, "start": 3379.0, "end": 3382.0, "text": "Er stellt sich einen ab."}, {"id": 498, "start": 3382.0, "end": 3390.0, "text": "Das war es für den Fabian, das Spiel, da muss man schleichen, da mag es Spiele, wo man schleichen muss."}, {"id": 499, "start": 3390.0, "end": 3405.0, "text": "Das ist ein kacke Aiming-System, wie in jedem VR-Spiel, aber du kannst es ja auch irgendwie nicht gescheit machen."}, {"id": 500, "start": 3405.0, "end": 3409.0, "text": "Wow, das könnte nicht schlecht sein."}, {"id": 501, "start": 3409.0, "end": 3414.0, "text": "Es gibt zu wenig gute VR-Games, wenn das ein gutes VR-Game ist, dann her damit."}, {"id": 502, "start": 3414.0, "end": 3420.0, "text": "Auch wenn ich kein VR-Zeug habe."}, {"id": 503, "start": 3420.0, "end": 3421.0, "text": "Ist im Chat."}, {"id": 504, "start": 3421.0, "end": 3445.0, "text": "Super-Piclet. Kein Video und Tschüss."}, {"id": 505, "start": 3451.0, "end": 3461.0, "text": "Hallo, Video?"}, {"id": 506, "start": 3461.0, "end": 3469.0, "text": "Mehr übersteuern bitte."}, {"id": 507, "start": 3469.0, "end": 3491.0, "text": "Wow, das Interface."}, {"id": 508, "start": 3491.0, "end": 3504.0, "text": "Also."}, {"id": 509, "start": 3504.0, "end": 3510.0, "text": "Es ist 2019."}, {"id": 510, "start": 3510.0, "end": 3522.0, "text": "Passt."}, {"id": 511, "start": 3522.0, "end": 3550.0, "text": "Ja, gut, nächstes."}, {"id": 512, "start": 3550.0, "end": 3554.0, "text": "Okay."}, {"id": 513, "start": 3554.0, "end": 3566.0, "text": "Typing faster."}, {"id": 514, "start": 3566.0, "end": 3576.0, "text": "Warum laden die Videos heute so lang?"}, {"id": 515, "start": 3576.0, "end": 3580.0, "text": "Das ist ein Type-Game."}, {"id": 516, "start": 3580.0, "end": 3582.0, "text": "Ja gut."}, {"id": 517, "start": 3582.0, "end": 3584.0, "text": "Warum nicht?"}, {"id": 518, "start": 3584.0, "end": 3588.0, "text": "Warum nicht?"}, {"id": 519, "start": 3588.0, "end": 3606.0, "text": "Okay, ist das ein Spiel, wo man schreiben lernt oder sowas in der Richtung?"}, {"id": 520, "start": 3606.0, "end": 3609.0, "text": "Ich glaube, das ist ein Game, wo man schreiben lernt."}, {"id": 521, "start": 3609.0, "end": 3619.0, "text": "Da fällt mir jetzt nichts in dieser Kategorie ein, das heißt, wenn es gut gemacht ist, warum nicht?"}, {"id": 522, "start": 3619.0, "end": 3623.0, "text": "Weil ich meine Zweifel habe, dass es halt wirklich motiviert dazu, schreiben zu lernen."}, {"id": 523, "start": 3623.0, "end": 3630.0, "text": "Also schnell schreiben oder vielleicht auch blind schreiben oder so."}, {"id": 524, "start": 3630.0, "end": 3633.0, "text": "Ich meine, dass es für Kinder gut kann sein."}, {"id": 525, "start": 3633.0, "end": 3638.0, "text": "Ich meine, mir fällt kein anderes Spiel dieser Art ein, außer ein paar Browser-Games."}, {"id": 526, "start": 3638.0, "end": 3643.0, "text": "Warum nicht?"}, {"id": 527, "start": 3643.0, "end": 3651.0, "text": "Wenn ihr den pädagogischen Wert darin erkannt habt, dann könnt ihr ja backen."}, {"id": 528, "start": 3651.0, "end": 3657.0, "text": "Wir gucken uns jetzt nochmal kurz das Gameplay an."}, {"id": 529, "start": 3657.0, "end": 3661.0, "text": "Ich meine, zumindest haben sie mal einen Typ, der Grafik machen kann."}, {"id": 530, "start": 3661.0, "end": 3664.0, "text": "Das sieht nicht zu fürchten aus, wie der Rest, den wir vorher geguckt haben."}, {"id": 531, "start": 3664.0, "end": 3671.0, "text": "Das sieht schon mal ganz nice aus für das, was es sein soll."}, {"id": 532, "start": 3671.0, "end": 3672.0, "text": "Ja, es ist wirklich."}, {"id": 533, "start": 3672.0, "end": 3677.0, "text": "Na gut, es ist aber so, WASD kriegt prinzipiell eigentlich jeder Gamer hin."}, {"id": 534, "start": 3677.0, "end": 3679.0, "text": "Oh, das ist easy für die Wim-Leute."}, {"id": 535, "start": 3679.0, "end": 3688.0, "text": "Easy, kein Problem."}, {"id": 536, "start": 3688.0, "end": 3695.0, "text": "Okay, das ist genau so was, was wir gedacht haben."}, {"id": 537, "start": 3695.0, "end": 3704.0, "text": "Ein Spiel, wo man Typen übt."}, {"id": 538, "start": 3704.0, "end": 3712.0, "text": "Wobei das hier jetzt noch ziemlich easy aussieht."}, {"id": 539, "start": 3712.0, "end": 3713.0, "text": "Okay, so spannend ist das jetzt auch nicht."}, {"id": 540, "start": 3713.0, "end": 3718.0, "text": "Wie gesagt, ich habe es euch in den Chat gepostet."}, {"id": 541, "start": 3718.0, "end": 3722.0, "text": "Ich habe es in den Chat rein eliminiert, wie man so schön sagt."}, {"id": 542, "start": 3722.0, "end": 3724.0, "text": "So, jetzt haben wir als nächstes Bavaria."}, {"id": 543, "start": 3724.0, "end": 3732.0, "text": "Nein, Bayani Fighting Game, nicht Bavaria."}, {"id": 544, "start": 3732.0, "end": 3742.0, "text": "Demo Available."}, {"id": 545, "start": 3742.0, "end": 3753.0, "text": "Oh, nice."}, {"id": 546, "start": 3753.0, "end": 3755.0, "text": "Okay, das ist ein Fighting Game."}, {"id": 547, "start": 3755.0, "end": 3768.0, "text": "Einmal ein hübsches Fighting Game."}, {"id": 548, "start": 3768.0, "end": 3776.0, "text": "Also ich finde es vom Styler nicht ganz, ganz, ganz gut."}, {"id": 549, "start": 3776.0, "end": 3780.0, "text": "Da steckt bestimmt ein bisschen Arbeit drin."}, {"id": 550, "start": 3780.0, "end": 3786.0, "text": "Oh, mit richtigem Soundtrack."}, {"id": 551, "start": 3786.0, "end": 3792.0, "text": "Die Frage ist, ob das wirklich, ob der Soundtrack von dem Game ist oder ob da nicht einfach irgendeinen Soundtrack drunter gelegt hat."}, {"id": 552, "start": 3792.0, "end": 3799.0, "text": "Wahrscheinlich eher das."}, {"id": 553, "start": 3799.0, "end": 3801.0, "text": "Okay, sie fighten sich halt einen ab."}, {"id": 554, "start": 3801.0, "end": 3803.0, "text": "Ein Fighting Game."}, {"id": 555, "start": 3803.0, "end": 3804.0, "text": "Hallo?"}, {"id": 556, "start": 3804.0, "end": 3806.0, "text": "Player?"}, {"id": 557, "start": 3806.0, "end": 3815.0, "text": "Oh, es ist ein Weep-Fighting Game."}, {"id": 558, "start": 3815.0, "end": 3822.0, "text": "Ich will eigentlich vorspulen, aber das mag der Browser will nicht."}, {"id": 559, "start": 3822.0, "end": 3825.0, "text": "Dann nicht."}, {"id": 560, "start": 3825.0, "end": 3829.0, "text": "K-Nino-K-K-P."}, {"id": 561, "start": 3829.0, "end": 3831.0, "text": "Ah ja."}, {"id": 562, "start": 3831.0, "end": 3835.0, "text": "Okay, 12K wollen sie, die Hälfte ist schon fast gebacked."}, {"id": 563, "start": 3835.0, "end": 3837.0, "text": "Was gefällt?"}, {"id": 564, "start": 3837.0, "end": 3838.0, "text": "Help, Localize oder..."}, {"id": 565, "start": 3838.0, "end": 3839.0, "text": "Oh, Visual Novel."}, {"id": 566, "start": 3839.0, "end": 3850.0, "text": "Ich schau wieder, überall Visual Novels."}, {"id": 567, "start": 3850.0, "end": 3858.0, "text": "Oh Mann, immer der Kram, immer der gleiche Kram, ey."}, {"id": 568, "start": 3858.0, "end": 3861.0, "text": "Immer der gleiche Kram."}, {"id": 569, "start": 3861.0, "end": 3865.0, "text": "Warum gibt es davon so viel auf Kickstarter?"}, {"id": 570, "start": 3865.0, "end": 3869.0, "text": "Warum gibt es davon so viel auf Kickstarter? Ich verstehe das einfach nicht."}, {"id": 571, "start": 3869.0, "end": 3877.0, "text": "The fuck?"}, {"id": 572, "start": 3877.0, "end": 3883.0, "text": "Jetzt ohne noch was drüber, um die Qualität zu sagen, warum gibt es so viele Visual Novels auf Kickstarter?"}, {"id": 573, "start": 3883.0, "end": 3888.0, "text": "Das ist ja fast jedes dritte Game."}, {"id": 574, "start": 3888.0, "end": 3893.0, "text": "So, das kommt als nächstes."}, {"id": 575, "start": 3893.0, "end": 3896.0, "text": "Backlit-2015."}, {"id": 576, "start": 3896.0, "end": 3899.0, "text": "Oh, das sieht ja schon mal richtig eindrucksvoll aus."}, {"id": 577, "start": 3899.0, "end": 3902.0, "text": "Kept nichts zu, gut."}, {"id": 578, "start": 3902.0, "end": 3906.0, "text": "Full-Metal-Plastik."}, {"id": 579, "start": 3906.0, "end": 3919.0, "text": "Es sieht schlechter aus als Minecraft und es hat Panzer."}, {"id": 580, "start": 3919.0, "end": 3932.0, "text": "Judith, jawoll, jawoll, so fängt meine Demo an."}, {"id": 581, "start": 3932.0, "end": 3939.0, "text": "Das hat übrigens keinen Sound, das ist nicht kaputt oder so."}, {"id": 582, "start": 3939.0, "end": 3944.0, "text": "Press any key, ja, schön."}, {"id": 583, "start": 3944.0, "end": 3952.0, "text": "Oh Moment, wir müssen den Text lesen da unten."}, {"id": 584, "start": 3952.0, "end": 3955.0, "text": "Aha."}, {"id": 585, "start": 3955.0, "end": 3958.0, "text": "Das ist seine Doktorarbeit oder sowas in der Richtung."}, {"id": 586, "start": 3958.0, "end": 3966.0, "text": "Nein, nicht wirklich seine Doktorarbeit, seine Abschlussarbeit."}, {"id": 587, "start": 3966.0, "end": 3969.0, "text": "Das ist eine Abschlussarbeit, okay."}, {"id": 588, "start": 3969.0, "end": 3973.0, "text": "Ich weiß ja nicht."}, {"id": 589, "start": 3973.0, "end": 3982.0, "text": "Wisst ihr, wenn er das komplett selbst gemacht hätte, dann würde ich sagen, Respekt, aber es ist ein Unity-Game."}, {"id": 590, "start": 3982.0, "end": 3989.0, "text": "Das heißt, es ist nicht schwer, sowas zu machen."}, {"id": 591, "start": 3989.0, "end": 3998.0, "text": "Er hat es ja auch geschrieben als aus dem Asset Store, the fuck?"}, {"id": 592, "start": 3998.0, "end": 4000.0, "text": "Und es ruckelt wie Sau."}, {"id": 593, "start": 4000.0, "end": 4008.0, "text": "Er spielt das Game in der Unity-Umgebung, warum?"}, {"id": 594, "start": 4008.0, "end": 4016.0, "text": "Der Zirkus-Manager."}, {"id": 595, "start": 4016.0, "end": 4021.0, "text": "Varyonix Studio."}, {"id": 596, "start": 4021.0, "end": 4031.0, "text": "Das ist jetzt wieder sauer."}, {"id": 597, "start": 4031.0, "end": 4033.0, "text": "Zirkus-Manager."}, {"id": 598, "start": 4033.0, "end": 4035.0, "text": "Erstmal ein LKW bauen."}, {"id": 599, "start": 4035.0, "end": 4037.0, "text": "Das weiß ich mir unter dem Zirkus vorstellen."}, {"id": 600, "start": 4037.0, "end": 4043.0, "text": "Als erstes mal ein LKW bauen."}, {"id": 601, "start": 4043.0, "end": 4054.0, "text": "Das ist das essentielle zu einem Zirkus, dass man erst mal ein LKW macht."}, {"id": 602, "start": 4054.0, "end": 4068.0, "text": "What?"}, {"id": 603, "start": 4068.0, "end": 4072.0, "text": "Geht das jetzt aber mit Zirkus-Manager los?"}, {"id": 604, "start": 4072.0, "end": 4079.0, "text": "Nein, jetzt wird ein neuer LKW gemalt."}, {"id": 605, "start": 4079.0, "end": 4082.0, "text": "Was? Warum malt er uns LKWs vor?"}, {"id": 606, "start": 4082.0, "end": 4088.0, "text": "Das Ding heißt Zirkus-Manager."}, {"id": 607, "start": 4088.0, "end": 4089.0, "text": "ETF?"}, {"id": 608, "start": 4089.0, "end": 4090.0, "text": "Kein Zelt? Keine?"}, {"id": 609, "start": 4090.0, "end": 4092.0, "text": "Nix, ein LKW."}, {"id": 610, "start": 4092.0, "end": 4100.0, "text": "Ah, das ist ein LKW, wo du irgendwie Löwen oder so einsperren kannst."}, {"id": 611, "start": 4100.0, "end": 4111.0, "text": "Ich weiß halt nicht, was ich mir unter Zirkus-Manager vorstelle."}, {"id": 612, "start": 4111.0, "end": 4114.0, "text": "Photoshop kann er, ja das stimmt."}, {"id": 613, "start": 4114.0, "end": 4117.0, "text": "Grafik kann er, wenn ich mir das hier angucke."}, {"id": 614, "start": 4117.0, "end": 4120.0, "text": "Was man da unten gesehen hat, falls es von ihm ist."}, {"id": 615, "start": 4120.0, "end": 4126.0, "text": "Aber was genau hat das jetzt mit einem Zirkus-Manager-Game zu tun?"}, {"id": 616, "start": 4126.0, "end": 4130.0, "text": "Das stimmt, wenigstens macht er es selbst."}, {"id": 617, "start": 4130.0, "end": 4134.0, "text": "Das ist richtig, das kann man bei den meisten Games auf Kickstarter nicht sagen."}, {"id": 618, "start": 4134.0, "end": 4144.0, "text": "Die haben Unreal oder Unity runtergeladen, ein paar Assets rein, ein paar Prefibed-Geschichte, fertig."}, {"id": 619, "start": 4144.0, "end": 4154.0, "text": "Jetzt will er es wissen."}, {"id": 620, "start": 4154.0, "end": 4162.0, "text": "Ich finde, die Ähnlichkeit ist verpuffend, oder?"}, {"id": 621, "start": 4162.0, "end": 4172.0, "text": "Oder eher die hier?"}, {"id": 622, "start": 4172.0, "end": 4175.0, "text": "Zirkus-Manager, nice."}, {"id": 623, "start": 4175.0, "end": 4182.0, "text": "Also alles, was wir gesehen haben, in dem Trailer hat mit einem Zirkus-Manager nicht alles so viel zu tun,"}, {"id": 624, "start": 4182.0, "end": 4185.0, "text": "aber zumindest macht er seine Sachen selbst, was ich schon mal gut finde."}, {"id": 625, "start": 4185.0, "end": 4193.0, "text": "Deswegen, wenn ihr daran glaubt, Link."}, {"id": 626, "start": 4193.0, "end": 4197.0, "text": "Surviving LAN-Bridge."}, {"id": 627, "start": 4197.0, "end": 4208.0, "text": "LAN-Alter."}, {"id": 628, "start": 4208.0, "end": 4211.0, "text": "Eine Bodentextur."}, {"id": 629, "start": 4211.0, "end": 4215.0, "text": "Eine Kiste."}, {"id": 630, "start": 4215.0, "end": 4228.0, "text": "Aha, sowas gibt es nicht oft."}, {"id": 631, "start": 4228.0, "end": 4232.0, "text": "Das kann gut sein, wenn das gut gemacht ist."}, {"id": 632, "start": 4232.0, "end": 4242.0, "text": "Ich meine, das sieht ein bisschen eher so aus wie GTA San Andreas von der Grafik."}, {"id": 633, "start": 4242.0, "end": 4252.0, "text": "Oh, ja genau, so sieht es aus, wenn man den Baum fällt."}, {"id": 634, "start": 4252.0, "end": 4263.0, "text": "Die Häuser sehen auch alle ziemlich gleich aus."}, {"id": 635, "start": 4263.0, "end": 4269.0, "text": "Okay, Leute, ich glaube kaum, dass man so die Häuser gebaut hat in dieser Zeit, oder?"}, {"id": 636, "start": 4269.0, "end": 4273.0, "text": "Ich meine, hier ist ein Haus, hier oben ist ein Dach, hier sind Fenster und so,"}, {"id": 637, "start": 4273.0, "end": 4290.0, "text": "und der guckt jetzt quasi in den Dachboden vom anderen rein und kann da rüber klettern, oder was?"}, {"id": 638, "start": 4290.0, "end": 4294.0, "text": "Was ist da los? Warum fallen die um? Ah, weil solche."}, {"id": 639, "start": 4294.0, "end": 4300.0, "text": "Der bräuchte den, wie hieß das Ding, was wir letztens auf Amazon gesehen haben?"}, {"id": 640, "start": 4300.0, "end": 4304.0, "text": "Den Pest-Rejector bräuchte der."}, {"id": 641, "start": 4304.0, "end": 4307.0, "text": "Den Pest-Rejector von Amazon."}, {"id": 642, "start": 4307.0, "end": 4310.0, "text": "Das rejectet die Pest, dann passiert nichts mehr."}, {"id": 643, "start": 4310.0, "end": 4316.0, "text": "Das Ding ist wirklich Pest-Rejector."}, {"id": 644, "start": 4316.0, "end": 4326.0, "text": "Ja, das kann auch was werden, wobei man nicht viel bisher von sieht."}, {"id": 645, "start": 4326.0, "end": 4332.0, "text": "Die See of Gionum."}, {"id": 646, "start": 4332.0, "end": 4334.0, "text": "Kein Video."}, {"id": 647, "start": 4334.0, "end": 4337.0, "text": "Freya and the False Prophecy."}, {"id": 648, "start": 4337.0, "end": 4359.0, "text": "Nordische Mythologie, das könnte ja was für mich sein."}, {"id": 649, "start": 4359.0, "end": 4379.0, "text": "Ganz viel Blut. Muss man untermauern jetzt."}, {"id": 650, "start": 4379.0, "end": 4399.0, "text": "Oh, die Sprung-Sounds."}, {"id": 651, "start": 4399.0, "end": 4419.0, "text": "Die Sounds."}, {"id": 652, "start": 4419.0, "end": 4424.0, "text": "Da merkt man, dass da Leute dahinter sitzen, die schon mal ein Spiel gemacht haben und auch schon mal Trailer produziert haben."}, {"id": 653, "start": 4424.0, "end": 4429.0, "text": "Da sieht wenigstens nach was aus. Ich weiß nicht, ob das Game mich ansprechen wird."}, {"id": 654, "start": 4429.0, "end": 4440.0, "text": "Aber zumindest sieht das nicht, nicht so, nicht wie so 0-15 hingerostes Billig-Game aus."}, {"id": 655, "start": 4440.0, "end": 4445.0, "text": "Die Sprung-Sounds waren schon hart, oder?"}, {"id": 656, "start": 4445.0, "end": 4448.0, "text": "Das ist auch so irgendwo."}, {"id": 657, "start": 4448.0, "end": 4456.0, "text": "Ich weiß nicht, ob sie das Live beim passenden Anlass rekordet haben."}, {"id": 658, "start": 4456.0, "end": 4460.0, "text": "Okay, next."}, {"id": 659, "start": 4460.0, "end": 4465.0, "text": "Disabled Gamers."}, {"id": 660, "start": 4465.0, "end": 4478.0, "text": "Das ist kein Game, oder? Das ist ein Kanal für, wie heißt das?"}, {"id": 661, "start": 4478.0, "end": 4483.0, "text": "Zurückgeblieben ist instant der Bann raus. Was heißt das?"}, {"id": 662, "start": 4483.0, "end": 4490.0, "text": "Wie nennt man das jetzt politisch korrekt heutzutage?"}, {"id": 663, "start": 4490.0, "end": 4496.0, "text": "Ich weiß nicht, ob die eine Behinderung haben, dass man Entwicklungsstörungen, sowas wie."}, {"id": 664, "start": 4496.0, "end": 4505.0, "text": "Ich glaube so irgendwas wie Entwicklungsstörungen oder sowas."}, {"id": 665, "start": 4505.0, "end": 4512.0, "text": "Also quasi halb YouTube Deutschland brauchen wir doch gar nicht einen Channel für."}, {"id": 666, "start": 4512.0, "end": 4517.0, "text": "Dann gibt es doch genug zumindest in Deutschland für."}, {"id": 667, "start": 4517.0, "end": 4522.0, "text": "Da hast du das Gefühl, dass du ziemlich die Hälfte der deutschen YouTube-Channels zurückgeblieben wirst."}, {"id": 668, "start": 4522.0, "end": 4526.0, "text": "Das war jetzt gemein, aber es ist so."}, {"id": 669, "start": 4526.0, "end": 4528.0, "text": "Ich weiß nicht, keine Ahnung, kann ich sagen."}, {"id": 670, "start": 4528.0, "end": 4531.0, "text": "Es hat halt aber in der Gamer-Kategorie eigentlich nichts zu suchen."}, {"id": 671, "start": 4531.0, "end": 4533.0, "text": "The Spirit of Christmas."}, {"id": 672, "start": 4533.0, "end": 4539.0, "text": "Ein Runner-Game, oder ist das irgendein Mobile-Kack?"}, {"id": 673, "start": 4539.0, "end": 4542.0, "text": "Ah, gibt es gar nicht."}, {"id": 674, "start": 4542.0, "end": 4547.0, "text": "Zu null, da ist er wieder."}, {"id": 675, "start": 4547.0, "end": 4552.0, "text": "Anonymous, The Game, soon available."}, {"id": 676, "start": 4552.0, "end": 4566.0, "text": "Das sieht nicht so aus, als ist das soon available."}, {"id": 677, "start": 4566.0, "end": 4576.0, "text": "Grüner Code, so muss das sein."}, {"id": 678, "start": 4576.0, "end": 4584.0, "text": "Moment, was haben wir da im Hintergrund für?"}, {"id": 679, "start": 4584.0, "end": 4588.0, "text": "Das ist garantiert nicht der Code von seinem Game."}, {"id": 680, "start": 4588.0, "end": 4594.0, "text": "Das sieht mir aus wie irgendwo einfach rauskopiert."}, {"id": 681, "start": 4594.0, "end": 4613.0, "text": "Das ist ja irgendwie, was weiß ich, Linux Kernel C-Code oder sowas."}, {"id": 682, "start": 4613.0, "end": 4616.0, "text": "Immerhin ist das echt ein Kopf, weiß man da doch nicht mal."}, {"id": 683, "start": 4616.0, "end": 4618.0, "text": "Was auch immer, keine Ahnung."}, {"id": 684, "start": 4618.0, "end": 4622.0, "text": "World War, Blood of Our Fathers."}, {"id": 685, "start": 4622.0, "end": 4626.0, "text": "Historisch genau."}, {"id": 686, "start": 4626.0, "end": 4630.0, "text": "Das ist das, was Battlefield nicht auf die Reihe gekriegt hat."}, {"id": 687, "start": 4630.0, "end": 4632.0, "text": "Da fuck."}, {"id": 688, "start": 4632.0, "end": 4634.0, "text": "Alter, die wollen es aber wissen."}, {"id": 689, "start": 4634.0, "end": 4640.0, "text": "11 Millionen."}, {"id": 690, "start": 4640.0, "end": 4642.0, "text": "Die wollen wirklich das nächste Battlefield machen."}, {"id": 691, "start": 4642.0, "end": 4645.0, "text": "Ich habe so meine Zweifel, ob das was wird."}, {"id": 692, "start": 4645.0, "end": 4649.0, "text": "11 Millionen, das ist schon sehr ambitioniert."}, {"id": 693, "start": 4649.0, "end": 4652.0, "text": "Wir haben keinen Trailer."}, {"id": 694, "start": 4652.0, "end": 4661.0, "text": "11 Millionen, ok 12 Millionen eigentlich."}, {"id": 695, "start": 4661.0, "end": 4672.0, "text": "Kein Trailer, keine Konzeptbilder, nichts."}, {"id": 696, "start": 4672.0, "end": 4675.0, "text": "Voraussichtliche Liebung 2020."}, {"id": 697, "start": 4675.0, "end": 4678.0, "text": "Timeline, ok wie sieht es aus?"}, {"id": 698, "start": 4678.0, "end": 4680.0, "text": "Funding Rates, easy."}, {"id": 699, "start": 4680.0, "end": 4684.0, "text": "Ihr habt natürlich kein Problem bis Januar 2019."}, {"id": 700, "start": 4684.0, "end": 4686.0, "text": "Habt ihr 12 Millionen, überhaupt kein Ding."}, {"id": 701, "start": 4686.0, "end": 4688.0, "text": "Easy, easy."}, {"id": 702, "start": 4688.0, "end": 4691.0, "text": "Also easy ist 12 Millionen of my life hier."}, {"id": 703, "start": 4691.0, "end": 4694.0, "text": "Das ist überhaupt kein Ding."}, {"id": 704, "start": 4694.0, "end": 4695.0, "text": "Ok, wie geht es weiter?"}, {"id": 705, "start": 4695.0, "end": 4698.0, "text": "Im Februar."}, {"id": 706, "start": 4698.0, "end": 4700.0, "text": "Das Core-Team steht, aha."}, {"id": 707, "start": 4700.0, "end": 4704.0, "text": "Marketingmaterial, mehr als development-Team."}, {"id": 708, "start": 4704.0, "end": 4714.0, "text": "Also sie haben es richtig."}, {"id": 709, "start": 4714.0, "end": 4716.0, "text": "Also ich glaube man muss kein Heldseher sein,"}, {"id": 710, "start": 4716.0, "end": 4726.0, "text": "wenn man da sagt, ich glaube das wird nichts."}, {"id": 711, "start": 4726.0, "end": 4734.0, "text": "Was haben wir als nächstes?"}, {"id": 712, "start": 4734.0, "end": 4749.0, "text": "Die Venia Episode 1, 8 Euro."}, {"id": 713, "start": 4749.0, "end": 4756.0, "text": "Kick-Ass-Lauf-Animation."}, {"id": 714, "start": 4756.0, "end": 4771.0, "text": "Die Lauf-Animation hat es in sich."}, {"id": 715, "start": 4771.0, "end": 4788.0, "text": "Schnippel-Sounds."}, {"id": 716, "start": 4788.0, "end": 4792.0, "text": "Der ist einfach gerade aufgeploppt."}, {"id": 717, "start": 4792.0, "end": 4795.0, "text": "Ok."}, {"id": 718, "start": 4795.0, "end": 4806.0, "text": "Das sieht irgendwie merkwürdig aus."}, {"id": 719, "start": 4806.0, "end": 4811.0, "text": "Die Lauf-Animation ist die beste."}, {"id": 720, "start": 4811.0, "end": 4818.0, "text": "Optisch sieht es ein bisschen aus wie vom Gamecube."}, {"id": 721, "start": 4818.0, "end": 4822.0, "text": "Na ich weiß nicht."}, {"id": 722, "start": 4822.0, "end": 4827.0, "text": "Ok, kommt da noch was? 7 Minuten?"}, {"id": 723, "start": 4827.0, "end": 4830.0, "text": "Die Videos von Kickstarter sind heute ein bisschen langsam."}, {"id": 724, "start": 4830.0, "end": 4832.0, "text": "Sag mal hat die keinen Fuß?"}, {"id": 725, "start": 4832.0, "end": 4834.0, "text": "Nee, die hat den Fuß nur im Kopf."}, {"id": 726, "start": 4834.0, "end": 4836.0, "text": "T-Pose, jawoll, beste."}, {"id": 727, "start": 4836.0, "end": 4842.0, "text": "Das hat mir jetzt noch gefehlt."}, {"id": 728, "start": 4842.0, "end": 4845.0, "text": "Gut."}, {"id": 729, "start": 4845.0, "end": 4848.0, "text": "Warum ist das denn ein bisschen Team-Favorite?"}, {"id": 730, "start": 4848.0, "end": 4851.0, "text": "Was ist eigentlich Team-Favorite?"}, {"id": 731, "start": 4851.0, "end": 4853.0, "text": "Team-Favorite."}, {"id": 732, "start": 4853.0, "end": 4854.0, "text": "Inspired Tea."}, {"id": 733, "start": 4854.0, "end": 4856.0, "text": "Ah ja."}, {"id": 734, "start": 4856.0, "end": 4863.0, "text": "Final Detonation."}, {"id": 735, "start": 4863.0, "end": 4867.0, "text": "Das hatten wir doch das letzte Mal schon."}, {"id": 736, "start": 4867.0, "end": 4877.0, "text": "Der hat es einfach nochmal neu gelauncht, oder?"}, {"id": 737, "start": 4877.0, "end": 4879.0, "text": "Man erkennt nichts."}, {"id": 738, "start": 4879.0, "end": 4882.0, "text": "Das hatten wir das letzte Mal schon."}, {"id": 739, "start": 4882.0, "end": 4888.0, "text": "Das hat das letzte Mal schon nicht funktioniert."}, {"id": 740, "start": 4888.0, "end": 4890.0, "text": "Das hatten wir das letzte Mal schon."}, {"id": 741, "start": 4890.0, "end": 4893.0, "text": "Was zum Teufel soll das sein?"}, {"id": 742, "start": 4893.0, "end": 4895.0, "text": "Genau, das haben wir das letzte Mal schon angeguckt."}, {"id": 743, "start": 4895.0, "end": 4902.0, "text": "Dieses komische Ding."}, {"id": 744, "start": 4902.0, "end": 4906.0, "text": "Origin of Infestation."}, {"id": 745, "start": 4906.0, "end": 4913.0, "text": "Gleichzeitstrategie und Oldschool RPG in einem."}, {"id": 746, "start": 4913.0, "end": 4923.0, "text": "Will 60k haben."}, {"id": 747, "start": 4923.0, "end": 4925.0, "text": "Das ist sehr early."}, {"id": 748, "start": 4925.0, "end": 4934.0, "text": "Das ist untexturiert early."}, {"id": 749, "start": 4934.0, "end": 4937.0, "text": "Es war wahrscheinlich zu viel verlangt für einen Kickstarter-Trailer,"}, {"id": 750, "start": 4937.0, "end": 4954.0, "text": "mal hier ein paar rudimentäre Tricks zu uns rüber zu klatschen."}, {"id": 751, "start": 4954.0, "end": 4955.0, "text": "Mega-Physik-Engine."}, {"id": 752, "start": 4955.0, "end": 4956.0, "text": "Habt ihr das gesehen?"}, {"id": 753, "start": 4956.0, "end": 4957.0, "text": "Beste."}, {"id": 754, "start": 4957.0, "end": 4962.0, "text": "Wie in echt."}, {"id": 755, "start": 4962.0, "end": 4970.0, "text": "Was wollt ihr uns überhaupt zeigen mit dieser Aktion jetzt?"}, {"id": 756, "start": 4970.0, "end": 4974.0, "text": "Man kann ein Brett hinlegen, es fällt nicht runter und dann kann man drüber laufen."}, {"id": 757, "start": 4974.0, "end": 4978.0, "text": "Nice."}, {"id": 758, "start": 4978.0, "end": 4981.0, "text": "Garantiert irgendwelche gekauften Models."}, {"id": 759, "start": 4981.0, "end": 4984.0, "text": "Ja, das Ding sieht auch schon irgendwie..."}, {"id": 760, "start": 4984.0, "end": 4987.0, "text": "Ach, ich weiß nicht."}, {"id": 761, "start": 4987.0, "end": 4990.0, "text": "Die Dinger, das wird immer schlimmer heute."}, {"id": 762, "start": 4990.0, "end": 4992.0, "text": "Oh, sie haben sowas wie Concept Art."}, {"id": 763, "start": 4992.0, "end": 5000.0, "text": "Da ist bloß die Frage, ist das ihres?"}, {"id": 764, "start": 5000.0, "end": 5005.0, "text": "Weiß man ja nicht."}, {"id": 765, "start": 5005.0, "end": 5010.0, "text": "Okay, next."}, {"id": 766, "start": 5010.0, "end": 5012.0, "text": "Was?"}, {"id": 767, "start": 5012.0, "end": 5020.0, "text": "Den Kurs, wie man den Unity-Asset-Store benutzt oder was soll das?"}, {"id": 768, "start": 5020.0, "end": 5021.0, "text": "Irgendeine Anleitung."}, {"id": 769, "start": 5021.0, "end": 5023.0, "text": "Travel."}, {"id": 770, "start": 5023.0, "end": 5025.0, "text": "Thank you for traveling."}, {"id": 771, "start": 5025.0, "end": 5031.0, "text": "Gibt keine..."}, {"id": 772, "start": 5031.0, "end": 5032.0, "text": "Oh, das ist rein text-based."}, {"id": 773, "start": 5032.0, "end": 5034.0, "text": "Oh nee, bitte nicht."}, {"id": 774, "start": 5034.0, "end": 5037.0, "text": "Dafür ist es mir zusätzlich 2019 schon."}, {"id": 775, "start": 5037.0, "end": 5039.0, "text": "Royal Storm Bowling."}, {"id": 776, "start": 5039.0, "end": 5041.0, "text": "Ein Bowling-Game."}, {"id": 777, "start": 5041.0, "end": 5044.0, "text": "Ich habe lange drauf gewartet."}, {"id": 778, "start": 5044.0, "end": 5047.0, "text": "Irgendwie sehen viele von den Projekten einfach nur aus wie Betrug."}, {"id": 779, "start": 5047.0, "end": 5057.0, "text": "Naja, man muss ja sagen, bei den meisten Projekten sieht man ja schon irgendwo, worauf man sich einlässt, wenn man nicht ganz, ganz blind ist."}, {"id": 780, "start": 5057.0, "end": 5059.0, "text": "Und das heißt, man kann ja kaum von Betrug sprechen."}, {"id": 781, "start": 5059.0, "end": 5062.0, "text": "Die meisten Games sehen schon so aus, als wird es nichts."}, {"id": 782, "start": 5062.0, "end": 5065.0, "text": "Wo man richtig skamast wird, zum Beispiel, ist bei einer Hose."}, {"id": 783, "start": 5065.0, "end": 5068.0, "text": "Hab ich euch ja schon erzählt."}, {"id": 784, "start": 5068.0, "end": 5073.0, "text": "100 Euro Grip."}, {"id": 785, "start": 5073.0, "end": 5076.0, "text": "Skamast wurde ich aber richtig."}, {"id": 786, "start": 5076.0, "end": 5079.0, "text": "Was mich aber nicht davon abhält, Kickstarters."}, {"id": 787, "start": 5079.0, "end": 5081.0, "text": "Oh, episches."}, {"id": 788, "start": 5081.0, "end": 5084.0, "text": "Episches Bowling-Spiel."}, {"id": 789, "start": 5084.0, "end": 5089.0, "text": "Bowling mit dem händigen Kopf."}, {"id": 790, "start": 5089.0, "end": 5096.0, "text": "Was?"}, {"id": 791, "start": 5096.0, "end": 5098.0, "text": "Was?"}, {"id": 792, "start": 5098.0, "end": 5100.0, "text": "Was genau habe ich da jetzt gesehen?"}, {"id": 793, "start": 5100.0, "end": 5101.0, "text": "Wartet mal."}, {"id": 794, "start": 5101.0, "end": 5103.0, "text": "Moment."}, {"id": 795, "start": 5103.0, "end": 5104.0, "text": "Es ist ein Ball?"}, {"id": 796, "start": 5104.0, "end": 5106.0, "text": "Ein Helikopter?"}, {"id": 797, "start": 5106.0, "end": 5107.0, "text": "Noch mehr Ball?"}, {"id": 798, "start": 5107.0, "end": 5108.0, "text": "Blaulicht?"}, {"id": 799, "start": 5108.0, "end": 5110.0, "text": "Kegel?"}, {"id": 800, "start": 5110.0, "end": 5113.0, "text": "Äh..."}, {"id": 801, "start": 5113.0, "end": 5115.0, "text": "Was?"}, {"id": 802, "start": 5115.0, "end": 5118.0, "text": "Alter, wer denkt so was aus?"}, {"id": 803, "start": 5118.0, "end": 5120.0, "text": "Ok, 0% finanziert nach 13 Tagen."}, {"id": 804, "start": 5120.0, "end": 5124.0, "text": "Ich vermute mal, die 400 Euro werden auch nichts werden."}, {"id": 805, "start": 5124.0, "end": 5132.0, "text": "Der Markt für Battle Royale Bowling-Spiele ist, glaube ich, nicht vorhanden."}, {"id": 806, "start": 5132.0, "end": 5139.0, "text": "Battle Royale Bowling-Spiele."}, {"id": 807, "start": 5139.0, "end": 5146.0, "text": "I'm not a monster, first contact."}, {"id": 808, "start": 5146.0, "end": 5152.0, "text": "Ok, das sieht zumindest so aus, als hat der jemand drangesetzt, der ein bisschen artistisch begabt ist."}, {"id": 809, "start": 5152.0, "end": 5163.0, "text": "Level 260k."}, {"id": 810, "start": 5163.0, "end": 5165.0, "text": "Sechs Minuten, das gucken wir uns jetzt nicht komplett an."}, {"id": 811, "start": 5165.0, "end": 5172.0, "text": "Skippen wir mal ein bisschen."}, {"id": 812, "start": 5172.0, "end": 5186.0, "text": "Er erinnert mich so ein bisschen an Fallout."}, {"id": 813, "start": 5186.0, "end": 5187.0, "text": "Oder BioShock."}, {"id": 814, "start": 5187.0, "end": 5188.0, "text": "BioShock."}, {"id": 815, "start": 5188.0, "end": 5196.0, "text": "Vom, vom, vom, von der Ansage her."}, {"id": 816, "start": 5196.0, "end": 5199.0, "text": "Ach, das ist so eine..."}, {"id": 817, "start": 5199.0, "end": 5203.0, "text": "So ein bisschen wie Dings hier, wie dieses Söldner-Game, was es früher gegeben hat."}, {"id": 818, "start": 5203.0, "end": 5220.0, "text": "So Turn-Based-Stells."}, {"id": 819, "start": 5220.0, "end": 5224.0, "text": "Und jetzt haben sie zumindest ordentlich gemacht in der Hintergrunde."}, {"id": 820, "start": 5224.0, "end": 5227.0, "text": "Was ist denn heute mit den Kickstarter-Videos los?"}, {"id": 821, "start": 5227.0, "end": 5230.0, "text": "Guckt mal, das buffert sich immer ein ab."}, {"id": 822, "start": 5230.0, "end": 5236.0, "text": "Das könnte auch an der Telekom liegen."}, {"id": 823, "start": 5236.0, "end": 5248.0, "text": "Selma, ich wurde auch skammast."}, {"id": 824, "start": 5248.0, "end": 5252.0, "text": "Ich mein, so ein rundenbasiertes Taktik-Stells-Ding, warum nicht?"}, {"id": 825, "start": 5252.0, "end": 5260.0, "text": "Ist ja nicht so, dass es da so gute, so viele gibt."}, {"id": 826, "start": 5260.0, "end": 5263.0, "text": "Und sie haben, ich weiß nicht, sie sind ein normales Studio."}, {"id": 827, "start": 5263.0, "end": 5266.0, "text": "Also keine Skammast-Aktion."}, {"id": 828, "start": 5266.0, "end": 5270.0, "text": "Sie haben Leute, die..."}, {"id": 829, "start": 5270.0, "end": 5272.0, "text": "Sie haben Künstler, sie haben Programmierer und so."}, {"id": 830, "start": 5272.0, "end": 5277.0, "text": "Das steht zumindest schon mal auf ganz guten, hat schon mal gute Voraussetzungen."}, {"id": 831, "start": 5277.0, "end": 5281.0, "text": "Link, wenn euch das zusagt."}, {"id": 832, "start": 5281.0, "end": 5282.0, "text": "Was haben wir als nächstes?"}, {"id": 833, "start": 5282.0, "end": 5284.0, "text": "A Miscreation."}, {"id": 834, "start": 5284.0, "end": 5291.0, "text": "Plattformer with evolution."}, {"id": 835, "start": 5291.0, "end": 5292.0, "text": "4.300 Euro."}, {"id": 836, "start": 5292.0, "end": 5299.0, "text": "Boah."}, {"id": 837, "start": 5299.0, "end": 5306.0, "text": "Boah, die Musik macht ja eine Ermöse."}, {"id": 838, "start": 5306.0, "end": 5313.0, "text": "Wobei die eigentlich ganz nice ist."}, {"id": 839, "start": 5313.0, "end": 5321.0, "text": "Das hat ein bisschen was so Kirby-mäßiges."}, {"id": 840, "start": 5321.0, "end": 5325.0, "text": "Okay, jetzt wird plattformt, wie man das so kennt."}, {"id": 841, "start": 5325.0, "end": 5327.0, "text": "Und irgendwelche..."}, {"id": 842, "start": 5327.0, "end": 5330.0, "text": "Was genau sind das für Dinger?"}, {"id": 843, "start": 5330.0, "end": 5332.0, "text": "Hallo, ich wollte da hin zurück."}, {"id": 844, "start": 5332.0, "end": 5339.0, "text": "Was, was genau soll das sein?"}, {"id": 845, "start": 5339.0, "end": 5340.0, "text": "Maiskolben."}, {"id": 846, "start": 5340.0, "end": 5341.0, "text": "Bestimmt Maiskolben."}, {"id": 847, "start": 5341.0, "end": 5345.0, "text": "Die irgendwas rausspritzen."}, {"id": 848, "start": 5345.0, "end": 5353.0, "text": "Warum blieb Zeitmann oder was?"}, {"id": 849, "start": 5353.0, "end": 5361.0, "text": "Ein Yoshi-Eye."}, {"id": 850, "start": 5361.0, "end": 5368.0, "text": "Es läuft."}, {"id": 851, "start": 5368.0, "end": 5369.0, "text": "Es läuft."}, {"id": 852, "start": 5369.0, "end": 5382.0, "text": "Feuer hat es noch gekrabbelt."}, {"id": 853, "start": 5382.0, "end": 5383.0, "text": "Hier ist evolution."}, {"id": 854, "start": 5383.0, "end": 5390.0, "text": "Ist evolution nicht, ist evolution."}, {"id": 855, "start": 5390.0, "end": 5391.0, "text": "Link."}, {"id": 856, "start": 5391.0, "end": 5402.0, "text": "Ja, denke ich auch, es könnte durchaus was sein."}, {"id": 857, "start": 5402.0, "end": 5403.0, "text": "Requeam."}, {"id": 858, "start": 5403.0, "end": 5404.0, "text": "Requeam."}, {"id": 859, "start": 5404.0, "end": 5405.0, "text": "Was?"}, {"id": 860, "start": 5405.0, "end": 5406.0, "text": "Ride of Tracks."}, {"id": 861, "start": 5406.0, "end": 5407.0, "text": "Schau mal hier mit schöner..."}, {"id": 862, "start": 5407.0, "end": 5418.0, "text": "Ich finde, das sieht irgendwie so aus, als hat der Typ irgendwo Requeam als Schrift gekriegt"}, {"id": 863, "start": 5418.0, "end": 5421.0, "text": "und hat dann quasi nochmal auf das Bild was drunter geschrieben."}, {"id": 864, "start": 5421.0, "end": 5425.0, "text": "Und auch das hier und dann irgendwie so seine Hand reingemacht oder so."}, {"id": 865, "start": 5425.0, "end": 5429.0, "text": "Ach so, es ist ein Augmented Reality-Game."}, {"id": 866, "start": 5429.0, "end": 5430.0, "text": "Okay, dann ist das ja..."}, {"id": 867, "start": 5430.0, "end": 5432.0, "text": "Das kennen wir doch."}, {"id": 868, "start": 5432.0, "end": 5435.0, "text": "Das gab es doch das letzte Mal auch schon."}, {"id": 869, "start": 5435.0, "end": 5440.0, "text": "Und das kann nicht das Gleiche gewesen sein, weil das letzte Mal, wo wir geschaut haben,"}, {"id": 870, "start": 5440.0, "end": 5444.0, "text": "das war 4. November oder so, das ist schon eine ganze Weile her."}, {"id": 871, "start": 5444.0, "end": 5447.0, "text": "Das kennen wir schon."}, {"id": 872, "start": 5447.0, "end": 5450.0, "text": "Ich glaube, die haben das einfach nochmal reingestellt."}, {"id": 873, "start": 5450.0, "end": 5458.0, "text": "Ja, genau, das war das Game, die einfach random irgendwelche anderen Games als Trailer reingepackt"}, {"id": 874, "start": 5458.0, "end": 5459.0, "text": "haben."}, {"id": 875, "start": 5459.0, "end": 5460.0, "text": "Disney's Cars 3."}, {"id": 876, "start": 5460.0, "end": 5461.0, "text": "WTF?"}, {"id": 877, "start": 5461.0, "end": 5463.0, "text": "Genau, da kann ich mich noch dran erinnern."}, {"id": 878, "start": 5463.0, "end": 5468.0, "text": "Die haben einfach irgendwelche Trailer von irgendwelchen anderen Games reingepackt."}, {"id": 879, "start": 5468.0, "end": 5476.0, "text": "Disney's Cars 3, weil das auch so viel mit Requeam und Ride of Dragons zu tun hat."}, {"id": 880, "start": 5476.0, "end": 5477.0, "text": "Okay, weiter geht's."}, {"id": 881, "start": 5477.0, "end": 5478.0, "text": "Let's see."}, {"id": 882, "start": 5478.0, "end": 5479.0, "text": "Horror Game."}, {"id": 883, "start": 5479.0, "end": 5480.0, "text": "Oh, MonkaS-Time."}, {"id": 884, "start": 5480.0, "end": 5481.0, "text": "Wie lange machst du heute noch?"}, {"id": 885, "start": 5481.0, "end": 5482.0, "text": "Weiß nicht."}, {"id": 886, "start": 5482.0, "end": 5483.0, "text": "Voice Acting Top Notch."}, {"id": 887, "start": 5483.0, "end": 5508.0, "text": "Freue mich."}, {"id": 888, "start": 5508.0, "end": 5518.0, "text": "Das ist das schlechteste Voice Acting."}, {"id": 889, "start": 5518.0, "end": 5522.0, "text": "Cringe Voice Acting."}, {"id": 890, "start": 5522.0, "end": 5539.0, "text": "Der Rest sieht okay aus."}, {"id": 891, "start": 5539.0, "end": 5545.0, "text": "Das Voice Acting war aber wirklich der größte Horror überhaupt."}, {"id": 892, "start": 5545.0, "end": 5561.0, "text": "Ich finde das Ingame Zeug für Leute die Horror Games machen sah gar nicht so schlecht aus."}, {"id": 893, "start": 5561.0, "end": 5567.0, "text": "Aber das Voice Acting, das ist wirklich der Horror schlechthin."}, {"id": 894, "start": 5567.0, "end": 5571.0, "text": "So, was haben wir als nächstes?"}, {"id": 895, "start": 5571.0, "end": 5573.0, "text": "Super Realistic Autocross."}, {"id": 896, "start": 5573.0, "end": 5583.0, "text": "Ich ahne ja schon Schlimmes."}, {"id": 897, "start": 5583.0, "end": 5591.0, "text": "Ich habe übrigens, muss ich gerade mal erzählen, ich habe heute ein bisschen weiter gebastelt an das was wir gestern programmiert haben, die Gegensprechanlage."}, {"id": 898, "start": 5591.0, "end": 5598.0, "text": "Ich habe da jetzt eine Web Anwendung draus gebastelt, die schon halbwegs auf dem iPhone funktioniert und auf dem Android Tablet und sowas."}, {"id": 899, "start": 5598.0, "end": 5600.0, "text": "Kann ich euch die Tage mal zeigen."}, {"id": 900, "start": 5600.0, "end": 5629.0, "text": "Haben wir 1998?"}, {"id": 901, "start": 5629.0, "end": 5631.0, "text": "Was das für..."}, {"id": 902, "start": 5631.0, "end": 5634.0, "text": "Moment."}, {"id": 903, "start": 5634.0, "end": 5637.0, "text": "Was für eine Plattform kommt das?"}, {"id": 904, "start": 5637.0, "end": 5638.0, "text": "On Steam und Nintendo Switch."}, {"id": 905, "start": 5638.0, "end": 5644.0, "text": "Ok."}, {"id": 906, "start": 5644.0, "end": 5645.0, "text": "Ja."}, {"id": 907, "start": 5645.0, "end": 5648.0, "text": "Ok."}, {"id": 908, "start": 5648.0, "end": 5649.0, "text": "Live."}, {"id": 909, "start": 5649.0, "end": 5650.0, "text": "Live."}, {"id": 910, "start": 5650.0, "end": 5652.0, "text": "Wir können dem Entwickler live zugucken beim..."}, {"id": 911, "start": 5652.0, "end": 5655.0, "text": "Ok, jetzt müssen wir uns erstmal den Vikings Trailer angucken."}, {"id": 912, "start": 5655.0, "end": 5657.0, "text": "Wie ist eigentlich die neue Vikings Staffel?"}, {"id": 913, "start": 5657.0, "end": 5660.0, "text": "Ich habe schon vor einer Weile aufgehört zu gucken."}, {"id": 914, "start": 5660.0, "end": 5673.0, "text": "Ich habe irgendwie bis Staffel 3 geguckt."}, {"id": 915, "start": 5673.0, "end": 5674.0, "text": "Was ist das?"}, {"id": 916, "start": 5674.0, "end": 5679.0, "text": "Das sieht aus wie das billigste Rennspiel aller Zeiten."}, {"id": 917, "start": 5679.0, "end": 5688.0, "text": "Vielleicht tue ich den aber auch vollkommen ungerecht jetzt und das ist mega geil."}, {"id": 918, "start": 5688.0, "end": 5690.0, "text": "Ist ok, aber sehr viel Gelaber das vorangeht."}, {"id": 919, "start": 5690.0, "end": 5695.0, "text": "Ja, das ist auch der Grund warum ich Game of Thrones nicht gut fand."}, {"id": 920, "start": 5695.0, "end": 5698.0, "text": "Ich habe Game of Thrones, habe ich auch die ersten zwei Staffeln geguckt."}, {"id": 921, "start": 5698.0, "end": 5702.0, "text": "Da ging es finde ich, da fand ich irgendwie, da war das dann auch ganz nice."}, {"id": 922, "start": 5702.0, "end": 5705.0, "text": "Aber danach hat sich das so krass im Kreis gedreht immer."}, {"id": 923, "start": 5705.0, "end": 5711.0, "text": "Und so ohne Konsequenzen letztendlich irgendwie, so ganz viel Intrigen hier, Intrigen da."}, {"id": 924, "start": 5711.0, "end": 5713.0, "text": "Und dann wird es zackig aufgelöst und nichts ist passiert."}, {"id": 925, "start": 5713.0, "end": 5715.0, "text": "Vielleicht kratzt irgendwie einer ab."}, {"id": 926, "start": 5715.0, "end": 5720.0, "text": "Also Game of Thrones finde ich ist mit so die overrated Serie überhaupt."}, {"id": 927, "start": 5720.0, "end": 5721.0, "text": "Ok."}, {"id": 928, "start": 5721.0, "end": 5723.0, "text": "Adams ascending."}, {"id": 929, "start": 5723.0, "end": 5736.0, "text": "In one word what does Adams ascending mean to you?"}, {"id": 930, "start": 5736.0, "end": 5741.0, "text": "Was geht mit den Kickstarter Videos heute ab?"}, {"id": 931, "start": 5741.0, "end": 5748.0, "text": "Die laden überhaupt nicht richtig."}, {"id": 932, "start": 5748.0, "end": 5760.0, "text": "Warum genau liegt jetzt auf dem Planet irgendwie eine AK-47 rum?"}, {"id": 933, "start": 5760.0, "end": 5774.0, "text": "Hat da irgendwie einer mal eine logische Erklärung für?"}, {"id": 934, "start": 5774.0, "end": 5779.0, "text": "Also die Kickstarter Videos sind halt richtig im Arsch."}, {"id": 935, "start": 5779.0, "end": 5787.0, "text": "So nicht normal."}, {"id": 936, "start": 5787.0, "end": 5790.0, "text": "Ok gucken wir uns hier nochmal Pre-Alpha Gameplay an."}, {"id": 937, "start": 5790.0, "end": 5792.0, "text": "Vielleicht geht es auf YouTube besser."}, {"id": 938, "start": 5792.0, "end": 5803.0, "text": "Ja YouTube läuft gut."}, {"id": 939, "start": 5803.0, "end": 5808.0, "text": "Lauf Simulator."}, {"id": 940, "start": 5808.0, "end": 5811.0, "text": "Weltraumstells rumlaufen."}, {"id": 941, "start": 5811.0, "end": 5814.0, "text": "Auch wieder so ein Game, super für den Friseur geeignet."}, {"id": 942, "start": 5814.0, "end": 5825.0, "text": "Jetzt fehlen bloß noch Stellselemente."}, {"id": 943, "start": 5825.0, "end": 5834.0, "text": "Die größten Verhältnisse sind ein bisschen merkwürdig."}, {"id": 944, "start": 5834.0, "end": 5837.0, "text": "Ok aber es sieht zumindest schon mal aus als haben die sich irgendwas bei gedacht."}, {"id": 945, "start": 5837.0, "end": 5839.0, "text": "Das kann man ja zu den meisten Games nicht sagen."}, {"id": 946, "start": 5839.0, "end": 5842.0, "text": "Also wer das becken möchte."}, {"id": 947, "start": 5842.0, "end": 5845.0, "text": "Link."}, {"id": 948, "start": 5845.0, "end": 5847.0, "text": "Die haben schon, ja die brauchen noch ein bisschen was."}, {"id": 949, "start": 5847.0, "end": 5849.0, "text": "Dass das was wird. 16 Tage verbleibend."}, {"id": 950, "start": 5849.0, "end": 5854.0, "text": "Also haben sie noch ein bisschen Zeit bis nächstes Jahr."}, {"id": 951, "start": 5854.0, "end": 5860.0, "text": "Der Boss ist back schreibt."}, {"id": 952, "start": 5860.0, "end": 5865.0, "text": "Ich verstehe nicht warum in Game of Thrones so viele 16 drin sind."}, {"id": 953, "start": 5865.0, "end": 5867.0, "text": "Die braucht kein Mensch."}, {"id": 954, "start": 5867.0, "end": 5868.0, "text": "Ja wahrscheinlich."}, {"id": 955, "start": 5868.0, "end": 5871.0, "text": "Das war ja die ersten zwei Staffeln war es natürlich auch schon."}, {"id": 956, "start": 5871.0, "end": 5876.0, "text": "Aber da hat es zumindest oftmals noch irgendwie so einen Storyzweck gehabt."}, {"id": 957, "start": 5876.0, "end": 5883.0, "text": "Aber danach war es einfach nur weil sie gemerkt haben, dass das halt Marketing technisch nicht verkehrt ist."}, {"id": 958, "start": 5883.0, "end": 5885.0, "text": "Wenn die Leute darüber labern."}, {"id": 959, "start": 5885.0, "end": 5887.0, "text": "Goblin Slayer Game."}, {"id": 960, "start": 5887.0, "end": 5889.0, "text": "Moment Moment."}, {"id": 961, "start": 5889.0, "end": 5894.0, "text": "Ist Goblin Slayer nicht dieser Goblin Rape Dings."}, {"id": 962, "start": 5894.0, "end": 5897.0, "text": "Das gucken wir uns jetzt nicht an."}, {"id": 963, "start": 5897.0, "end": 5900.0, "text": "Ist das nicht dieser komische Anime."}, {"id": 964, "start": 5900.0, "end": 5906.0, "text": "Wo die Goblins dann irgendwie die Heilerin vergewaltigen oder so."}, {"id": 965, "start": 5906.0, "end": 5908.0, "text": "Frag mich nicht woher ich das weiß."}, {"id": 966, "start": 5908.0, "end": 5917.0, "text": "Das weiß aber."}, {"id": 967, "start": 5917.0, "end": 5919.0, "text": "Be Crip."}, {"id": 968, "start": 5919.0, "end": 5923.0, "text": "Weeps."}, {"id": 969, "start": 5923.0, "end": 5925.0, "text": "Ach so das ist nur nachgemacht."}, {"id": 970, "start": 5925.0, "end": 5927.0, "text": "Dann ist es natürlich."}, {"id": 971, "start": 5927.0, "end": 5930.0, "text": "What kind of Game will it be."}, {"id": 972, "start": 5930.0, "end": 5933.0, "text": "Ok komm Leute wir müssen."}, {"id": 973, "start": 5933.0, "end": 5936.0, "text": "Wir müssen unseren inneren Weep channelen quasi."}, {"id": 974, "start": 5936.0, "end": 5941.0, "text": "Moment."}, {"id": 975, "start": 5941.0, "end": 5942.0, "text": "Das ist das ist aber."}, {"id": 976, "start": 5942.0, "end": 5947.0, "text": "Das ist."}, {"id": 977, "start": 5947.0, "end": 5952.0, "text": "Das ist gerippt aus dem Anime."}, {"id": 978, "start": 5952.0, "end": 5953.0, "text": "Das ist."}, {"id": 979, "start": 5953.0, "end": 5954.0, "text": "Moment."}, {"id": 980, "start": 5954.0, "end": 5965.0, "text": "Das ist kein offizielles Game von denen."}, {"id": 981, "start": 5965.0, "end": 5968.0, "text": "Die haben doch gar nicht die Lizenz dafür."}, {"id": 982, "start": 5968.0, "end": 5975.0, "text": "Verstehe."}, {"id": 983, "start": 5975.0, "end": 5976.0, "text": "Scheiße."}, {"id": 984, "start": 5976.0, "end": 5980.0, "text": "Das gucken wir uns nicht an."}, {"id": 985, "start": 5980.0, "end": 5981.0, "text": "Ok die."}, {"id": 986, "start": 5981.0, "end": 5983.0, "text": "Die haben ja einfach die."}, {"id": 987, "start": 5983.0, "end": 5985.0, "text": "Was zum Teufel."}, {"id": 988, "start": 5985.0, "end": 5987.0, "text": "Leute Kickstarter."}, {"id": 989, "start": 5987.0, "end": 5988.0, "text": "Be Crip."}, {"id": 990, "start": 5988.0, "end": 5991.0, "text": "Best Suit for playing hard."}, {"id": 991, "start": 5991.0, "end": 5992.0, "text": "Was."}, {"id": 992, "start": 5992.0, "end": 5995.0, "text": "Ein neuer ein neuer Stick."}, {"id": 993, "start": 5995.0, "end": 5997.0, "text": "Auch wenn man das Part mit dem Gaming Klopf."}, {"id": 994, "start": 5997.0, "end": 5999.0, "text": "Den man am Anfang hatten."}, {"id": 995, "start": 5999.0, "end": 6001.0, "text": "Dann ist dann ist aus."}, {"id": 996, "start": 6001.0, "end": 6003.0, "text": "Dann ist das Skill ist real."}, {"id": 997, "start": 6003.0, "end": 6004.0, "text": "Oh nein."}, {"id": 998, "start": 6004.0, "end": 6012.0, "text": "Der Controller ist kaputt."}, {"id": 999, "start": 6012.0, "end": 6017.0, "text": "Weltuntergang."}, {"id": 1000, "start": 6017.0, "end": 6020.0, "text": "Und jetzt macht sie wieder ganz."}, {"id": 1001, "start": 6020.0, "end": 6039.0, "text": "Magic."}, {"id": 1002, "start": 6039.0, "end": 6045.0, "text": "Was."}, {"id": 1003, "start": 6045.0, "end": 6050.0, "text": "Ich bräuchte für sowas echt eine Webcam."}, {"id": 1004, "start": 6050.0, "end": 6051.0, "text": "Ich bräuchte für sowas echt eine Webcam."}, {"id": 1005, "start": 6051.0, "end": 6053.0, "text": "Weil man manchmal gar nicht."}, {"id": 1006, "start": 6053.0, "end": 6055.0, "text": "Gar nicht gar nicht gut rüber bringen kann."}, {"id": 1007, "start": 6055.0, "end": 6057.0, "text": "Irgendwie wie man wie man sich gerade fühlt."}, {"id": 1008, "start": 6057.0, "end": 6059.0, "text": "Sondern einfach weil man einfach müsste."}, {"id": 1009, "start": 6059.0, "end": 6063.0, "text": "Einfach doof in die Kamera gucken kann."}, {"id": 1010, "start": 6063.0, "end": 6064.0, "text": "Und was."}, {"id": 1011, "start": 6064.0, "end": 6075.0, "text": "Hundert zwanzig tausend."}, {"id": 1012, "start": 6075.0, "end": 6089.0, "text": "Hundert zwanzig tausend."}, {"id": 1013, "start": 6089.0, "end": 6094.0, "text": "Und ich weiß nicht wozu ich was brauche."}, {"id": 1014, "start": 6094.0, "end": 6096.0, "text": "Das ist irgendein Mobile Game."}, {"id": 1015, "start": 6096.0, "end": 6099.0, "text": "Oder das gucken wir uns jetzt nicht an."}, {"id": 1016, "start": 6099.0, "end": 6100.0, "text": "Oder doch."}, {"id": 1017, "start": 6100.0, "end": 6103.0, "text": "Das hat hat wurde wurde gebackt."}, {"id": 1018, "start": 6103.0, "end": 6105.0, "text": "Max Fails Revealing."}, {"id": 1019, "start": 6105.0, "end": 6107.0, "text": "Ich weiß nicht."}, {"id": 1020, "start": 6107.0, "end": 6110.0, "text": "Es wäre es wäre für für Streams deutlich praktischer."}, {"id": 1021, "start": 6110.0, "end": 6112.0, "text": "Für sowas hier das mit Webcam machen zu können."}, {"id": 1022, "start": 6112.0, "end": 6116.0, "text": "Das auf jeden Fall."}, {"id": 1023, "start": 6116.0, "end": 6119.0, "text": "Hey."}, {"id": 1024, "start": 6119.0, "end": 6134.0, "text": "Was haben Sie alles gemischt."}, {"id": 1025, "start": 6134.0, "end": 6147.0, "text": "Match 3."}, {"id": 1026, "start": 6147.0, "end": 6148.0, "text": "Ich verstehe."}, {"id": 1027, "start": 6148.0, "end": 6151.0, "text": "Tower Defense."}, {"id": 1028, "start": 6151.0, "end": 6164.0, "text": "City Building Strategie."}, {"id": 1029, "start": 6164.0, "end": 6184.0, "text": "competitive Tower Defense."}, {"id": 1030, "start": 6184.0, "end": 6185.0, "text": "Ich meine."}, {"id": 1031, "start": 6185.0, "end": 6188.0, "text": "Der Typ kann zumindest sein Game schon mal gut anpreisen."}, {"id": 1032, "start": 6188.0, "end": 6190.0, "text": "Die Mechanics sind stellar."}, {"id": 1033, "start": 6190.0, "end": 6191.0, "text": "Das ist das ist so ein Spruch."}, {"id": 1034, "start": 6191.0, "end": 6201.0, "text": "Den hätte auch irgendein Typ von ihr auf der Bühne loslassen können."}, {"id": 1035, "start": 6201.0, "end": 6203.0, "text": "Pavillionen gibt es bestimmt."}, {"id": 1036, "start": 6203.0, "end": 6210.0, "text": "Aber wenn schon mit Webcam dann macht das auch richtig."}, {"id": 1037, "start": 6210.0, "end": 6220.0, "text": "Also ich muss ja ehrlich sagen das Game sieht für mich sehr sehr hart nach Resident Sleeper aus."}, {"id": 1038, "start": 6220.0, "end": 6240.0, "text": "Ja das sieht sehr Resident Sleeper mäßig aus."}, {"id": 1039, "start": 6240.0, "end": 6260.0, "text": "Wir brauchen mehr Echtzeit Strategie Spiele das auf jeden Fall gibt es zu wenig von."}, {"id": 1040, "start": 6260.0, "end": 6263.0, "text": "Die Römer sind am Start soll zumindest so aussehen."}, {"id": 1041, "start": 6263.0, "end": 6274.0, "text": "Und die Wikinger mit Hörner Helm."}, {"id": 1042, "start": 6274.0, "end": 6276.0, "text": "Moment."}, {"id": 1043, "start": 6276.0, "end": 6278.0, "text": "Erst haben sie diese."}, {"id": 1044, "start": 6278.0, "end": 6279.0, "text": "Warum haben die."}, {"id": 1045, "start": 6279.0, "end": 6282.0, "text": "Das hat ja nicht mal Ansatzweise mit dem."}, {"id": 1046, "start": 6282.0, "end": 6284.0, "text": "Also das hat ja absolut nichts mit dem zu tun."}, {"id": 1047, "start": 6284.0, "end": 6308.0, "text": "Wie es ausschaut also absolut gar nicht."}, {"id": 1048, "start": 6308.0, "end": 6335.0, "text": "Das sieht noch sehr rudimentär aus."}, {"id": 1049, "start": 6335.0, "end": 6338.0, "text": "Wie das komplette Konzept Art Zeug."}, {"id": 1050, "start": 6338.0, "end": 6344.0, "text": "Wie das komplette Art Geschichten nichts mit dem Game zu tun hat."}, {"id": 1051, "start": 6344.0, "end": 6349.0, "text": "Das musst du erst mal schaffen."}, {"id": 1052, "start": 6349.0, "end": 6352.0, "text": "Malkyrs Interactive Card Game."}, {"id": 1053, "start": 6352.0, "end": 6357.0, "text": "Ist das Hardstone Reloaded 25.0."}, {"id": 1054, "start": 6357.0, "end": 6359.0, "text": "Es gibt so viele Hardstone Clones."}, {"id": 1055, "start": 6359.0, "end": 6364.0, "text": "Brauchen wir da wirklich noch ein."}, {"id": 1056, "start": 6364.0, "end": 6367.0, "text": "Okay das das muss irgendwas haben."}, {"id": 1057, "start": 6367.0, "end": 6369.0, "text": "Sonst hätten es nicht so viele Leute gebacken."}, {"id": 1058, "start": 6369.0, "end": 6378.0, "text": "Das gucken wir uns jetzt an."}, {"id": 1059, "start": 6378.0, "end": 6394.0, "text": "Okay neue WoW Trailer."}, {"id": 1060, "start": 6394.0, "end": 6398.0, "text": "Ja es könnte 1 zu 1 irgendwie ein Hardstone Geschichte sein."}, {"id": 1061, "start": 6398.0, "end": 6402.0, "text": "Sieht schon so aus."}, {"id": 1062, "start": 6402.0, "end": 6411.0, "text": "Es gibt so viele gebacken."}, {"id": 1063, "start": 6411.0, "end": 6414.0, "text": "Moment ich glaube ich weiß was das wird."}, {"id": 1064, "start": 6414.0, "end": 6416.0, "text": "Das ist ein Offline Game oder."}, {"id": 1065, "start": 6416.0, "end": 6428.0, "text": "Ja das ist ein Offline Game."}, {"id": 1066, "start": 6428.0, "end": 6435.0, "text": "Ach das sind Karten mit RFID."}, {"id": 1067, "start": 6435.0, "end": 6442.0, "text": "Dass da nicht schon früher einer drauf gekommen ist."}, {"id": 1068, "start": 6442.0, "end": 6445.0, "text": "Das hätten zum Beispiel die Magic Dudes machen können."}, {"id": 1069, "start": 6445.0, "end": 6447.0, "text": "Die hätten ihre Karten irgendwie RFID Chips verpassen können."}, {"id": 1070, "start": 6447.0, "end": 6450.0, "text": "Dann kannst du online mitspielen."}, {"id": 1071, "start": 6450.0, "end": 6453.0, "text": "Dann verkaufst du in echt Karten und."}, {"id": 1072, "start": 6453.0, "end": 6456.0, "text": "Warum sind denn da die großen noch nicht früher drauf gekommen."}, {"id": 1073, "start": 6456.0, "end": 6458.0, "text": "Und warum ist Blizzard noch nicht auf die Idee gekommen."}, {"id": 1074, "start": 6458.0, "end": 6460.0, "text": "Hardstone Karten raus zu hauen."}, {"id": 1075, "start": 6460.0, "end": 6462.0, "text": "Ich meine Hardstone kannst du offline nicht spielen."}, {"id": 1076, "start": 6462.0, "end": 6470.0, "text": "Aber du kannst Karten eigentlich realisieren."}, {"id": 1077, "start": 6470.0, "end": 6499.0, "text": "Die sagen ich kann kein Französisch nachmachen."}, {"id": 1078, "start": 6499.0, "end": 6506.0, "text": "Ich weiß so dass das Franzosen viele Wörter immer gerne ein Französischen."}, {"id": 1079, "start": 6506.0, "end": 6508.0, "text": "Und dann hat man eh ein Franzose zu mir."}, {"id": 1080, "start": 6508.0, "end": 6511.0, "text": "Anstatt Frieschard hat er gesagt Friescharde."}, {"id": 1081, "start": 6511.0, "end": 6513.0, "text": "Da war es vorbei."}, {"id": 1082, "start": 6513.0, "end": 6515.0, "text": "Das übertreibt es halt."}, {"id": 1083, "start": 6515.0, "end": 6517.0, "text": "Das ist schon wieder der gleiche Typ."}, {"id": 1084, "start": 6517.0, "end": 6519.0, "text": "Wie oft hatten der das Game drinne?"}, {"id": 1085, "start": 6519.0, "end": 6523.0, "text": "Das hatten wir doch vorher schon mal."}, {"id": 1086, "start": 6523.0, "end": 6524.0, "text": "Oder?"}, {"id": 1087, "start": 6524.0, "end": 6528.0, "text": "Nee das ist was anderes."}, {"id": 1088, "start": 6528.0, "end": 6540.0, "text": "Das sieht aber verdächtig ähnlich aus."}, {"id": 1089, "start": 6540.0, "end": 6547.0, "text": "Stimmt Skylanders gab es ja da habe ich jetzt gar nicht dran gedacht."}, {"id": 1090, "start": 6547.0, "end": 6556.0, "text": "Hast du denn Super Mario Fan Remake gesehen?"}, {"id": 1091, "start": 6556.0, "end": 6560.0, "text": "Wenn es schon ein bisschen her ist habe ich das gesehen."}, {"id": 1092, "start": 6560.0, "end": 6563.0, "text": "Das ist der der das erste Level nachgebaut hat oder?"}, {"id": 1093, "start": 6563.0, "end": 6564.0, "text": "Oder gibt es noch mehr?"}, {"id": 1094, "start": 6564.0, "end": 6572.0, "text": "Es gibt saumäßig viele Mario 64 Teile in neueren Engines Remaked."}, {"id": 1095, "start": 6572.0, "end": 6574.0, "text": "Weil es einfach ein Game ist das viele Leute beeinflusst hat."}, {"id": 1096, "start": 6574.0, "end": 6575.0, "text": "Das gibt es voll."}, {"id": 1097, "start": 6575.0, "end": 6577.0, "text": "Ist YouTube voll damit."}, {"id": 1098, "start": 6577.0, "end": 6581.0, "text": "Ein Game was wirklich davon profitiert ist."}, {"id": 1099, "start": 6581.0, "end": 6584.0, "text": "Also jetzt nicht von Remaken sondern von Enhancen."}, {"id": 1100, "start": 6584.0, "end": 6593.0, "text": "Ist Mario Galaxy im Emulator mit besseren Texturen und mehr Effekten."}, {"id": 1101, "start": 6593.0, "end": 6595.0, "text": "Das sieht wirklich nice aus."}, {"id": 1102, "start": 6595.0, "end": 6605.0, "text": "Das Game sah nämlich viel besser aus als die Wii letztendlich hergegeben hat."}, {"id": 1103, "start": 6605.0, "end": 6606.0, "text": "Ok was heißt das?"}, {"id": 1104, "start": 6606.0, "end": 6607.0, "text": "Frogvale."}, {"id": 1105, "start": 6607.0, "end": 6609.0, "text": "Ist schon finanziert."}, {"id": 1106, "start": 6609.0, "end": 6611.0, "text": "Nein ist nicht die Hälfte."}, {"id": 1107, "start": 6611.0, "end": 6614.0, "text": "So diese manche Währungen sehen so viel aus irgendwie."}, {"id": 1108, "start": 6614.0, "end": 6631.0, "text": "Und dann sind es am Ende sind es dann 1000 Euro."}, {"id": 1109, "start": 6631.0, "end": 6642.0, "text": "Und dann wird es teuer."}, {"id": 1110, "start": 6642.0, "end": 6649.0, "text": "Was?"}, {"id": 1111, "start": 6649.0, "end": 6665.0, "text": "Der Bus Emulator nur in..."}, {"id": 1112, "start": 6665.0, "end": 6678.0, "text": "Ich meine nichts gegen minimalistische."}, {"id": 1113, "start": 6678.0, "end": 6681.0, "text": "Minimalistische und stylische Grafik."}, {"id": 1114, "start": 6681.0, "end": 6692.0, "text": "Aber ich finde nicht dass dieser minimalistische Grafikstil stylisch ist."}, {"id": 1115, "start": 6692.0, "end": 6704.0, "text": "Das sind irgendwelche eckigen Plops."}, {"id": 1116, "start": 6704.0, "end": 6708.0, "text": "Project Weep keine Ahnung."}, {"id": 1117, "start": 6708.0, "end": 6709.0, "text": "Kenne ich nicht."}, {"id": 1118, "start": 6709.0, "end": 6716.0, "text": "Project Medizinball."}, {"id": 1119, "start": 6716.0, "end": 6719.0, "text": "Ich erkenne nicht was das sein soll."}, {"id": 1120, "start": 6719.0, "end": 6726.0, "text": "Sieht aus wie Project Medizinball oder?"}, {"id": 1121, "start": 6726.0, "end": 6738.0, "text": "Alles klar."}, {"id": 1122, "start": 6738.0, "end": 6759.0, "text": "Das war ein Gegner."}, {"id": 1123, "start": 6759.0, "end": 6777.0, "text": "Er schlägt einen Gegner an und der Gegner stirbt."}, {"id": 1124, "start": 6777.0, "end": 6781.0, "text": "Das ist mega intense."}, {"id": 1125, "start": 6781.0, "end": 6788.0, "text": "Ultra intense."}, {"id": 1126, "start": 6788.0, "end": 6794.0, "text": "126 Chamber Street Horror Game."}, {"id": 1127, "start": 6794.0, "end": 6802.0, "text": "Wir hatten heute erstaunlich wenig Horror Games."}, {"id": 1128, "start": 6802.0, "end": 6815.0, "text": "Es ruckelt."}, {"id": 1129, "start": 6815.0, "end": 6826.0, "text": "Der Joe Filippone."}, {"id": 1130, "start": 6826.0, "end": 6830.0, "text": "Blaufilter."}, {"id": 1131, "start": 6830.0, "end": 6832.0, "text": "Battlefield 3."}, {"id": 1132, "start": 6832.0, "end": 6843.0, "text": "Es ruckelt wieder."}, {"id": 1133, "start": 6843.0, "end": 6845.5, "text": "Es ist ein"}, {"id": 1134, "start": 6845.5, "end": 6848.0, "text": "Amnesia"}, {"id": 1135, "start": 6848.0, "end": 6850.0, "text": "Style"}, {"id": 1136, "start": 6850.0, "end": 6852.0, "text": "Ding"}, {"id": 1137, "start": 6852.0, "end": 6870.0, "text": "Was hier überhaupt nicht mal ein Fall ist."}, {"id": 1138, "start": 6870.0, "end": 6875.0, "text": "Das sieht mir eher aus wie Horror gewollt, aber nicht gekonnt."}, {"id": 1139, "start": 6875.0, "end": 6883.0, "text": "Chaos, Roguelike, RPG, Early Footage."}, {"id": 1140, "start": 6883.0, "end": 6898.0, "text": "Heute haben wir halt uns minimalistische Grafik aber echt angetan."}, {"id": 1141, "start": 6898.0, "end": 6918.0, "text": "Was ist das für ein Geräusch?"}, {"id": 1142, "start": 6918.0, "end": 6920.0, "text": "Dieser Sound."}, {"id": 1143, "start": 6920.0, "end": 6943.0, "text": "Als würde es schleifen."}, {"id": 1144, "start": 6943.0, "end": 6963.0, "text": "Oh krasses Kampfsystem."}, {"id": 1145, "start": 6963.0, "end": 6969.0, "text": "Was machen die Gegner eigentlich?"}, {"id": 1146, "start": 6969.0, "end": 6981.0, "text": "Und warum sterben die nicht?"}, {"id": 1147, "start": 6981.0, "end": 6985.0, "text": "Also manche Games sehen wirklich, da weiß ich immer nicht."}, {"id": 1148, "start": 6985.0, "end": 6988.0, "text": "Sind die absichtlich so komisch oder?"}, {"id": 1149, "start": 6988.0, "end": 6995.0, "text": "Es ist einfach ungewollt."}, {"id": 1150, "start": 6995.0, "end": 6997.0, "text": "Geil."}, {"id": 1151, "start": 6997.0, "end": 6999.0, "text": "3000 Euro."}, {"id": 1152, "start": 6999.0, "end": 7006.0, "text": "Also wenn euch das zusagt."}, {"id": 1153, "start": 7006.0, "end": 7030.0, "text": "Ich hoffe nicht, dass es wieder eine Visual Novel ist."}, {"id": 1154, "start": 7030.0, "end": 7037.0, "text": "Ja."}, {"id": 1155, "start": 7037.0, "end": 7042.0, "text": "Und weiter."}, {"id": 1156, "start": 7042.0, "end": 7045.0, "text": "Es sieht nach RPG Maker aus."}, {"id": 1157, "start": 7045.0, "end": 7049.0, "text": "Das ist ein RPG Maker Game."}, {"id": 1158, "start": 7049.0, "end": 7050.0, "text": "Oder was meint ihr?"}, {"id": 1159, "start": 7050.0, "end": 7056.0, "text": "Das sieht aus wie RPG Maker."}, {"id": 1160, "start": 7056.0, "end": 7067.0, "text": "Das ist ein RPG Maker."}, {"id": 1161, "start": 7067.0, "end": 7078.0, "text": "Das ist sowas von sich."}, {"id": 1162, "start": 7078.0, "end": 7085.0, "text": "Man könnte ja ein bisschen was zeigen."}, {"id": 1163, "start": 7085.0, "end": 7087.0, "text": "Nope."}, {"id": 1164, "start": 7087.0, "end": 7092.0, "text": "Mass Commander."}, {"id": 1165, "start": 7092.0, "end": 7108.0, "text": "Also erinnere mich dran, dass wir noch features Haftbefehl gucken müssen."}, {"id": 1166, "start": 7108.0, "end": 7122.0, "text": "Der Mathe Commander."}, {"id": 1167, "start": 7122.0, "end": 7131.0, "text": "Die hässlichsten Asteroiden, die ich je gesehen habe."}, {"id": 1168, "start": 7131.0, "end": 7134.0, "text": "What?"}, {"id": 1169, "start": 7134.0, "end": 7136.0, "text": "Was sehe ich da wieder?"}, {"id": 1170, "start": 7136.0, "end": 7138.0, "text": "Es kotzt."}, {"id": 1171, "start": 7138.0, "end": 7141.0, "text": "Es hat irgendwas ausgekotzt gerade."}, {"id": 1172, "start": 7141.0, "end": 7144.0, "text": "Ach, das ist der Raketenantrieb."}, {"id": 1173, "start": 7144.0, "end": 7146.0, "text": "Ich habe gedacht, das ist ein komisches Viech."}, {"id": 1174, "start": 7146.0, "end": 7164.0, "text": "Es speilt irgendwas aus."}, {"id": 1175, "start": 7164.0, "end": 7172.0, "text": "Ja, das soll man rechnen lernen."}, {"id": 1176, "start": 7172.0, "end": 7177.0, "text": "Wisst ihr was ich an der Grafik heutzutage cool finde?"}, {"id": 1177, "start": 7177.0, "end": 7180.0, "text": "Das war nämlich gerade so eine Einstellung mit der Kamera."}, {"id": 1178, "start": 7180.0, "end": 7183.0, "text": "Das hier, wenn man das so sieht."}, {"id": 1179, "start": 7183.0, "end": 7188.0, "text": "Das könnte auch aus irgendeinem Game sein."}, {"id": 1180, "start": 7188.0, "end": 7195.0, "text": "Also ohne Kontext herum, wenn man es heute realistisch machen will, sieht das wirklich ziemlich gut aus."}, {"id": 1181, "start": 7195.0, "end": 7200.0, "text": "Aber das ist halt echt jetzt."}, {"id": 1182, "start": 7200.0, "end": 7203.0, "text": "Okay, es ist ein Mathe Spiel."}, {"id": 1183, "start": 7203.0, "end": 7207.0, "text": "Okay, Pädagogik Bildungsauftrag FPS am Start."}, {"id": 1184, "start": 7207.0, "end": 7216.0, "text": "Wenn ihr das becken wollt, haut rein."}, {"id": 1185, "start": 7216.0, "end": 7224.0, "text": "Roots Video Game."}, {"id": 1186, "start": 7224.0, "end": 7233.0, "text": "Man kann Pixel auch schön machen."}, {"id": 1187, "start": 7233.0, "end": 7234.0, "text": "Man kann Pixel auch schön machen."}, {"id": 1188, "start": 7234.0, "end": 7239.0, "text": "Das ist nicht schön."}, {"id": 1189, "start": 7239.0, "end": 7246.0, "text": "Das sieht."}, {"id": 1190, "start": 7246.0, "end": 7256.0, "text": "Oh, Voice Acting Supreme."}, {"id": 1191, "start": 7256.0, "end": 7264.0, "text": "Voice Acting des Pargas."}, {"id": 1192, "start": 7264.0, "end": 7278.0, "text": "Okay, für den war keine Stimme mehr übrig."}, {"id": 1193, "start": 7278.0, "end": 7280.0, "text": "Oh Mann."}, {"id": 1194, "start": 7280.0, "end": 7285.0, "text": "Anfall."}, {"id": 1195, "start": 7285.0, "end": 7291.0, "text": "Was zum Teufel ist das?"}, {"id": 1196, "start": 7291.0, "end": 7298.0, "text": "Willkommen."}, {"id": 1197, "start": 7298.0, "end": 7306.0, "text": "Hat da jeder, der in der Nachbarschaft wohnt, mal einen Satz gesprochen oder was?"}, {"id": 1198, "start": 7306.0, "end": 7308.0, "text": "Amore, yes."}, {"id": 1199, "start": 7308.0, "end": 7316.0, "text": "So einfach ist es."}, {"id": 1200, "start": 7316.0, "end": 7326.0, "text": "Ich habe keinen Plastenschimmer, auf was es geht."}, {"id": 1201, "start": 7326.0, "end": 7331.0, "text": "Das macht dich echt im Kopf verrückt, manche Kickstarter-Projekte."}, {"id": 1202, "start": 7331.0, "end": 7360.0, "text": "Thehaveuring six is cubes, one-on-one online Game."}, {"id": 1203, "start": 7360.0, "end": 7365.0, "text": "Das ist wie aus Mario Galaxy, die in diese Level-Modes runterfällt, wo man drauf war."}, {"id": 1204, "start": 7365.0, "end": 7367.0, "text": "Cubes."}, {"id": 1205, "start": 7367.0, "end": 7371.0, "text": "Es sieht mir sehr langweilig aus."}, {"id": 1206, "start": 7371.0, "end": 7373.0, "text": "Hi Guys."}, {"id": 1207, "start": 7373.0, "end": 7377.0, "text": "Das wird wahrscheinlich nicht der nächste Online-Competitive-Hit werden."}, {"id": 1208, "start": 7377.0, "end": 7397.0, "text": "Hatten wir das nicht eben schon?"}, {"id": 1209, "start": 7397.0, "end": 7412.0, "text": "Sieht aus wie den MMO von 1995."}, {"id": 1210, "start": 7412.0, "end": 7416.0, "text": "Äh, ha?"}, {"id": 1211, "start": 7416.0, "end": 7422.0, "text": "Control Epic Spell Cases, jawoll."}, {"id": 1212, "start": 7422.0, "end": 7437.0, "text": "Moment, ich dachte der Anfang ist das Game, aber das ist das Game."}, {"id": 1213, "start": 7437.0, "end": 7455.0, "text": "Man scheint sich zumindest ansatzweise was dabei gedacht zu haben bei dem Spell-System."}, {"id": 1214, "start": 7455.0, "end": 7467.0, "text": "Es sieht aber mega langweilig aus."}, {"id": 1215, "start": 7467.0, "end": 7489.0, "text": "Okay, weil euch das angesprochen hat."}, {"id": 1216, "start": 7489.0, "end": 7504.0, "text": "The Malung."}, {"id": 1217, "start": 7504.0, "end": 7509.0, "text": "Ah, eben Snake mit Würfel und jetzt richtig Snake."}, {"id": 1218, "start": 7509.0, "end": 7512.0, "text": "Snake Enhanced."}, {"id": 1219, "start": 7512.0, "end": 7515.0, "text": "Snake HD Edition."}, {"id": 1220, "start": 7515.0, "end": 7531.0, "text": "Jetzt mit Levels, die irgendwie anders aussehen."}, {"id": 1221, "start": 7531.0, "end": 7536.0, "text": "Okay, es ist Snake im Puzzle-Modus."}, {"id": 1222, "start": 7536.0, "end": 7546.0, "text": "Mit einem FPS."}, {"id": 1223, "start": 7546.0, "end": 7549.0, "text": "Ich glaube es ist so eine Art rundenbasiertes Game."}, {"id": 1224, "start": 7549.0, "end": 7554.0, "text": "Das läuft nicht vorwärts bis man sich bewegt."}, {"id": 1225, "start": 7554.0, "end": 7560.0, "text": "Es sieht aber minimalistische Grafik in Ehren, aber..."}, {"id": 1226, "start": 7560.0, "end": 7569.0, "text": "Das könnte sogar ich malen und ich kann es überhaupt nicht malen."}, {"id": 1227, "start": 7569.0, "end": 7574.0, "text": "Wenn ich ein Game machen würde, 2D, dann würde es wahrscheinlich optisch ungefähr so aussehen."}, {"id": 1228, "start": 7574.0, "end": 7576.0, "text": "Das ist jetzt aber nichts Gutes."}, {"id": 1229, "start": 7576.0, "end": 7583.0, "text": "Oh, geschreckt."}, {"id": 1230, "start": 7583.0, "end": 7586.0, "text": "Ich weiß nicht."}, {"id": 1231, "start": 7586.0, "end": 7590.0, "text": "System Ascent."}, {"id": 1232, "start": 7590.0, "end": 7592.0, "text": "Oh, halbe Million."}, {"id": 1233, "start": 7592.0, "end": 7593.0, "text": "Jetzt bin ich mal gespannt."}, {"id": 1234, "start": 7593.0, "end": 7594.0, "text": "Jetzt will ich mal was sehen."}, {"id": 1235, "start": 7594.0, "end": 7596.0, "text": "Es wurde auch schon gebacked."}, {"id": 1236, "start": 7596.0, "end": 7603.0, "text": "Was ist ein First-Player-Guided-Free-To-Play-Game-Best-On-Game-System-Developer-Game-Of-Zones-App?"}, {"id": 1237, "start": 7603.0, "end": 7606.0, "text": "Was?"}, {"id": 1238, "start": 7606.0, "end": 7609.0, "text": "Okay."}, {"id": 1239, "start": 7609.0, "end": 7618.0, "text": "Ich zeige Gameplay."}, {"id": 1240, "start": 7618.0, "end": 7623.0, "text": "Die Kickstarter-Videos sind heute so am abkacken."}, {"id": 1241, "start": 7623.0, "end": 7625.0, "text": "Gibt es da unten ein Video?"}, {"id": 1242, "start": 7625.0, "end": 7633.0, "text": "Er freut sich."}, {"id": 1243, "start": 7633.0, "end": 7644.0, "text": "Ich weiß nicht, vielleicht."}, {"id": 1244, "start": 7644.0, "end": 7645.0, "text": "Was ist das?"}, {"id": 1245, "start": 7645.0, "end": 7648.0, "text": "Game of Thrones Ascent."}, {"id": 1246, "start": 7648.0, "end": 7651.0, "text": "Habe ich schon nie gehört."}, {"id": 1247, "start": 7651.0, "end": 7652.0, "text": "Highly Popular Game Engine."}, {"id": 1248, "start": 7652.0, "end": 7653.0, "text": "Habe ich schon nie gehört."}, {"id": 1249, "start": 7653.0, "end": 7654.0, "text": "Was soll das sein?"}, {"id": 1250, "start": 7654.0, "end": 7657.0, "text": "Das ist Browser-Game oder was?"}, {"id": 1251, "start": 7657.0, "end": 7660.0, "text": "Ja, ein geiler Game of Thrones Browser-Game."}, {"id": 1252, "start": 7660.0, "end": 7663.0, "text": "Ja, super."}, {"id": 1253, "start": 7663.0, "end": 7664.0, "text": "Das haben wir gebraucht."}, {"id": 1254, "start": 7664.0, "end": 7671.0, "text": "Chaos-FPS-PC-Game-Multiplan."}, {"id": 1255, "start": 7671.0, "end": 7672.0, "text": "Ich ahne Schreckliches."}, {"id": 1256, "start": 7672.0, "end": 7674.0, "text": "Ich ahne Schreckliches, wenn ich das schon sehe."}, {"id": 1257, "start": 7674.0, "end": 7683.0, "text": "Was?"}, {"id": 1258, "start": 7683.0, "end": 7699.0, "text": "Erzählt uns erstmal, das Game wird definitiv nicht so aussehen, wie man es hier im Trailer"}, {"id": 1259, "start": 7699.0, "end": 7700.0, "text": "sieht."}, {"id": 1260, "start": 7700.0, "end": 7703.0, "text": "Da ist natürlich die Frage, warum macht er den Trailer so?"}, {"id": 1261, "start": 7703.0, "end": 7707.0, "text": "Sollte man nicht einfach als Grundlage schon mal das nehmen, was es später auch werden"}, {"id": 1262, "start": 7707.0, "end": 7708.0, "text": "soll?"}, {"id": 1263, "start": 7708.0, "end": 7714.0, "text": "Das sieht ja grausam aus."}, {"id": 1264, "start": 7714.0, "end": 7723.0, "text": "Das sieht ja grausam aus."}, {"id": 1265, "start": 7723.0, "end": 7728.0, "text": "Was ist denn das?"}, {"id": 1266, "start": 7728.0, "end": 7736.0, "text": "Was ist denn das?"}, {"id": 1267, "start": 7736.0, "end": 7738.0, "text": "Manches tut weh."}, {"id": 1268, "start": 7738.0, "end": 7743.0, "text": "Manches tut echt weh, wenn man es sieht."}, {"id": 1269, "start": 7743.0, "end": 7746.0, "text": "Dieses komische Alien da, das hätte ich aufmalen können."}, {"id": 1270, "start": 7746.0, "end": 7749.0, "text": "Das ist kein Kompliment."}, {"id": 1271, "start": 7749.0, "end": 7760.0, "text": "Wenn ich was malen könnte, heißt das, das ist in der Regel schlecht."}, {"id": 1272, "start": 7760.0, "end": 7773.0, "text": "Das Haus ist auch irgendwie ein bisschen unförmig."}, {"id": 1273, "start": 7773.0, "end": 7777.0, "text": "Ich habe keinen blassen Schimmer, was ich hier eigentlich sehe gerade."}, {"id": 1274, "start": 7777.0, "end": 7778.0, "text": "Moviemaker-Paint."}, {"id": 1275, "start": 7778.0, "end": 7785.0, "text": "We won't disappoint."}, {"id": 1276, "start": 7785.0, "end": 7788.0, "text": "Ich glaube halt nicht, dass das was wird."}, {"id": 1277, "start": 7788.0, "end": 7793.0, "text": "Er will das Game in Unreal 4 danach machen, habe ich schon mal gesehen."}, {"id": 1278, "start": 7793.0, "end": 7794.0, "text": "Rocket-Ghost-Aden."}, {"id": 1279, "start": 7794.0, "end": 7795.0, "text": "Oder AI-Dan."}, {"id": 1280, "start": 7795.0, "end": 7796.0, "text": "Kickstarter-Stats."}, {"id": 1281, "start": 7796.0, "end": 7797.0, "text": "Nice."}, {"id": 1282, "start": 7797.0, "end": 7822.0, "text": "Schön, dass wir jetzt auf Kickstarter sind."}, {"id": 1283, "start": 7822.0, "end": 7844.0, "text": "Also ihr wisst ja, dass ich ein Fan von solchen Soundtracks bin."}, {"id": 1284, "start": 7844.0, "end": 7847.0, "text": "Und wir hatten heute schon ein paar Spiele, wo ich gesagt habe, das Spiel würde ich nicht"}, {"id": 1285, "start": 7847.0, "end": 7849.0, "text": "kaufen, aber den Soundtrack."}, {"id": 1286, "start": 7849.0, "end": 7857.0, "text": "Bis auf ein bisschen was Melodisches, habe ich jetzt noch nichts rausgehört, was sich"}, {"id": 1287, "start": 7857.0, "end": 7858.0, "text": "harmonisch anhören würde."}, {"id": 1288, "start": 7858.0, "end": 7859.0, "text": "Außer Gebrumme."}, {"id": 1289, "start": 7859.0, "end": 7872.0, "text": "Und was soll das vor allem sein?"}, {"id": 1290, "start": 7872.0, "end": 7876.0, "text": "Guck mal, dem Ding kommt Feuer aus dem Arsch."}, {"id": 1291, "start": 7876.0, "end": 7877.0, "text": "Das fliegt."}, {"id": 1292, "start": 7877.0, "end": 7880.0, "text": "Feuer aus dem Arsch fliegt so hoch."}, {"id": 1293, "start": 7880.0, "end": 7883.0, "text": "Nee, nee Leute."}, {"id": 1294, "start": 7883.0, "end": 7885.0, "text": "Nee, nee."}, {"id": 1295, "start": 7885.0, "end": 7886.0, "text": "Nee."}, {"id": 1296, "start": 7886.0, "end": 7893.0, "text": "Ich habe da keine Nerven heute für, das werde ich anzugucken."}, {"id": 1297, "start": 7893.0, "end": 7894.0, "text": "Survival-Game-Best."}, {"id": 1298, "start": 7894.0, "end": 7895.0, "text": "Oh, schon wieder Survival."}, {"id": 1299, "start": 7895.0, "end": 7902.0, "text": "Das letzte Mal hatten wir aber deutlich mehr Battle Royale-Games."}, {"id": 1300, "start": 7902.0, "end": 7907.0, "text": "Moin, Spaceload09."}, {"id": 1301, "start": 7907.0, "end": 7926.2, "text": "Hat da wieder eine Unreal-Engine installiert und eine Map gemacht und ein paar Bäume drauf"}, {"id": 1302, "start": 7926.2, "end": 7927.2, "text": "gestellt."}, {"id": 1303, "start": 7927.2, "end": 7943.2, "text": "Ein bisschen Speed-Tree am Start, wobei die Bäume sind sich teilweise schon ein bisschen"}, {"id": 1304, "start": 7943.2, "end": 7944.2, "text": "ähnlich."}, {"id": 1305, "start": 7944.2, "end": 7949.2, "text": "Eher nicht Speed-Tree, eher Copy-Paste-Tree."}, {"id": 1306, "start": 7949.2, "end": 7957.2, "text": "Test, die muss sie."}, {"id": 1307, "start": 7957.2, "end": 7961.2, "text": "Ok, Zeichen."}, {"id": 1308, "start": 7961.2, "end": 7964.2, "text": "Wald."}, {"id": 1309, "start": 7964.2, "end": 7977.2, "text": "Ok, und wo ist jetzt der Survival-Aspekt davon?"}, {"id": 1310, "start": 7977.2, "end": 7984.2, "text": "Ein Hirsch aus dem Asset-Store."}, {"id": 1311, "start": 7984.2, "end": 8011.2, "text": "Oh, krasse Animation."}, {"id": 1312, "start": 8011.2, "end": 8015.2, "text": "Aha."}, {"id": 1313, "start": 8015.2, "end": 8019.2, "text": "Demo."}, {"id": 1314, "start": 8019.2, "end": 8026.2, "text": "Impossible Dungeon Respawn."}, {"id": 1315, "start": 8026.2, "end": 8030.2, "text": "Ok, wir hatten ja heute schon minimalistische Grafik und minimalistischere Grafik und jetzt"}, {"id": 1316, "start": 8030.2, "end": 8033.2, "text": "haben wir minimalistische Grafik mit nur einer Farbe."}, {"id": 1317, "start": 8033.2, "end": 8052.2, "text": "Man kann es immer noch toppen."}, {"id": 1318, "start": 8052.2, "end": 8053.2, "text": "Ein sexy Female Elf."}, {"id": 1319, "start": 8053.2, "end": 8062.2, "text": "Oh, das werden das die Feministen hören."}, {"id": 1320, "start": 8062.2, "end": 8063.2, "text": "Ja?"}, {"id": 1321, "start": 8063.2, "end": 8064.2, "text": "Hallo?"}, {"id": 1322, "start": 8064.2, "end": 8065.2, "text": "Kommt da noch was?"}, {"id": 1323, "start": 8065.2, "end": 8070.2, "text": "Moment, ist das nur Text?"}, {"id": 1324, "start": 8070.2, "end": 8082.2, "text": "Ok, ist es Text?"}, {"id": 1325, "start": 8082.2, "end": 8085.2, "text": "Nein."}, {"id": 1326, "start": 8085.2, "end": 8090.2, "text": "Kein Video."}, {"id": 1327, "start": 8090.2, "end": 8099.2, "text": "Mesh my Polygons."}, {"id": 1328, "start": 8099.2, "end": 8104.2, "text": "Also im Vergleich zu das letzte Mal war heute wirklich zum größten Teil Crap dabei, oder?"}, {"id": 1329, "start": 8104.2, "end": 8116.2, "text": "Es waren zwei, drei Sachen, wo man sagen könnte, ja, ganz ok."}, {"id": 1330, "start": 8116.2, "end": 8122.2, "text": "Aber der Rest war wirklich Crap."}, {"id": 1331, "start": 8122.2, "end": 8133.2, "text": "Das ist so Just Cause für Arme."}, {"id": 1332, "start": 8133.2, "end": 8138.2, "text": "Was ist das schon wieder?"}, {"id": 1333, "start": 8138.2, "end": 8143.2, "text": "Man kann Luftballons an die Leute dranhängen und dann schweben sie, ja ok."}, {"id": 1334, "start": 8143.2, "end": 8145.2, "text": "Schön."}, {"id": 1335, "start": 8145.2, "end": 8147.2, "text": "Gut Job."}, {"id": 1336, "start": 8147.2, "end": 8152.2, "text": "Und dann hängen sie an der Decke."}, {"id": 1337, "start": 8152.2, "end": 8153.2, "text": "Und dann..."}, {"id": 1338, "start": 8153.2, "end": 8157.2, "text": "Jetzt tu mal nicht so, als hättest du das selbst gemacht."}, {"id": 1339, "start": 8157.2, "end": 8160.2, "text": "Da zeigt das nämlich so, als hätte er das selbst gemacht."}, {"id": 1340, "start": 8160.2, "end": 8162.2, "text": "Da hättest du überhaupt nicht selbst gemacht."}, {"id": 1341, "start": 8162.2, "end": 8163.2, "text": "Den Schatten."}, {"id": 1342, "start": 8163.2, "end": 8164.2, "text": "Das ist Standard."}, {"id": 1343, "start": 8164.2, "end": 8165.2, "text": "Das ist schon dabei."}, {"id": 1344, "start": 8165.2, "end": 8168.2, "text": "Das muss man heutzutage nicht mal selbst machen."}, {"id": 1345, "start": 8168.2, "end": 8183.2, "text": "Das sieht..."}, {"id": 1346, "start": 8183.2, "end": 8187.2, "text": "Was ist das wieder für ein Krempel, ey?"}, {"id": 1347, "start": 8187.2, "end": 8195.2, "text": "Weg!"}, {"id": 1348, "start": 8195.2, "end": 8198.2, "text": "Shades of Light."}, {"id": 1349, "start": 8225.2, "end": 8227.2, "text": "Was?"}, {"id": 1350, "start": 8227.2, "end": 8239.2, "text": "Bei den meisten Videos heute check ich überhaupt nicht, was ich überhaupt zu Gesicht bekomme."}, {"id": 1351, "start": 8239.2, "end": 8250.2, "text": "Wenigstens klitscht das hart nicht in den Boden rein, sondern nur in die Pflanze dahinter."}, {"id": 1352, "start": 8250.2, "end": 8251.2, "text": "Ok."}, {"id": 1353, "start": 8251.2, "end": 8254.2, "text": "Leute, ich glaube, es reicht für heute."}, {"id": 1354, "start": 8254.2, "end": 8255.2, "text": "Es wird ja immer..."}, {"id": 1355, "start": 8255.2, "end": 8260.2, "text": "Es wird ja nicht besser, es wird ja immer nur schlimmer, wenn ich mir das hier schon angucke."}, {"id": 1356, "start": 8260.2, "end": 8261.2, "text": "Es wird schon..."}, {"id": 1357, "start": 8261.2, "end": 8263.2, "text": "Es wird immer schlimmer."}, {"id": 1358, "start": 8263.2, "end": 8265.2, "text": "Ich glaube, wir machen jetzt Schluss."}, {"id": 1359, "start": 8265.2, "end": 8267.2, "text": "Ich glaube, wir machen Schluss für heute."}, {"id": 1360, "start": 8267.2, "end": 8268.2, "text": "Macht's gut."}, {"id": 1361, "start": 8268.2, "end": 8269.2, "text": "Oh nee, wir müssen noch..."}, {"id": 1362, "start": 8269.2, "end": 8270.2, "text": "Wir müssen noch Haftbefehle angucken."}, {"id": 1363, "start": 8270.2, "end": 8271.2, "text": "Ich will eigentlich überhaupt nicht..."}, {"id": 1364, "start": 8271.2, "end": 8274.2, "text": "Ich weiß, dass mich das jetzt schon wieder aufregen wird, wenn ich den Kram sehe."}, {"id": 1365, "start": 8274.2, "end": 8280.2, "text": "Weil es wahrscheinlich total mies ist."}, {"id": 1366, "start": 8280.2, "end": 8283.2, "text": "Müssen wir uns jetzt wirklich, Tielinde, mal Haftbefehle angucken?"}, {"id": 1367, "start": 8283.2, "end": 8284.2, "text": "Müssen wir uns jetzt wirklich, Tielinde, mal Haftbefehle angucken?"}, {"id": 1368, "start": 8284.2, "end": 8285.2, "text": "Ja."}, {"id": 1369, "start": 8285.2, "end": 8286.2, "text": "Nein, müssen wir nicht."}, {"id": 1370, "start": 8286.2, "end": 8287.2, "text": "Sehr gut."}, {"id": 1371, "start": 8287.2, "end": 8288.2, "text": "Mach ich..."}, {"id": 1372, "start": 8288.2, "end": 8289.2, "text": "Dann lass ich's bleiben."}, {"id": 1373, "start": 8289.2, "end": 8290.2, "text": "Ihr seid..."}, {"id": 1374, "start": 8290.2, "end": 8291.2, "text": "Ihr seid ein netter Chat."}, {"id": 1375, "start": 8291.2, "end": 8292.2, "text": "Nein, ein nicer Chat."}, {"id": 1376, "start": 8292.2, "end": 8293.2, "text": "Ein sehr nicer Chat."}, {"id": 1377, "start": 8293.2, "end": 8294.2, "text": "Ok."}, {"id": 1378, "start": 8294.2, "end": 8295.2, "text": "Ok."}, {"id": 1379, "start": 8295.2, "end": 8296.2, "text": "Ok."}, {"id": 1380, "start": 8296.2, "end": 8297.2, "text": "Ok."}, {"id": 1381, "start": 8297.2, "end": 8298.2, "text": "Ok."}, {"id": 1382, "start": 8298.2, "end": 8299.2, "text": "Ok."}, {"id": 1383, "start": 8299.2, "end": 8300.2, "text": "Ok."}, {"id": 1384, "start": 8300.2, "end": 8301.2, "text": "Ok."}, {"id": 1385, "start": 8301.2, "end": 8302.2, "text": "Ok."}, {"id": 1386, "start": 8302.2, "end": 8303.2, "text": "Ok."}, {"id": 1387, "start": 8303.2, "end": 8304.2, "text": "Ok."}, {"id": 1388, "start": 8304.2, "end": 8305.2, "text": "Ok."}, {"id": 1389, "start": 8305.2, "end": 8314.2, "text": "Ok."}, {"id": 1390, "start": 8314.2, "end": 8315.2, "text": "Ok."}, {"id": 1391, "start": 8315.2, "end": 8316.2, "text": "Ok."}, {"id": 1392, "start": 8316.2, "end": 8317.2, "text": "Ok."}, {"id": 1393, "start": 8317.2, "end": 8318.2, "text": "Ok."}, {"id": 1394, "start": 8318.2, "end": 8319.2, "text": "Ok."}, {"id": 1395, "start": 8319.2, "end": 8336.2, "text": "Der letzte Tag, Max, für was?"}, {"id": 1396, "start": 8336.2, "end": 8352.2, "text": "Und zwar, ich zeige euch das mal, was ich habe, was ich gekauft habe."}, {"id": 1397, "start": 8352.2, "end": 8355.2, "text": "Das da."}, {"id": 1398, "start": 8355.2, "end": 8360.2, "text": "Das kommt bei Mädels mit Sicherheit gut an."}, {"id": 1399, "start": 8360.2, "end": 8367.84, "text": "Mädels haben immer kalte Füße, wobei das sieht nicht so aus, wie das, was ich gekauft"}, {"id": 1400, "start": 8367.84, "end": 8368.84, "text": "habe."}, {"id": 1401, "start": 8368.84, "end": 8376.8, "text": "Nee, nee, ich glaube nicht, dass ihr zuschaut."}, {"id": 1402, "start": 8376.8, "end": 8379.0, "text": "Das sieht nicht so aus, was ich gekauft habe."}, {"id": 1403, "start": 8379.0, "end": 8383.2, "text": "Die, die ich gekauft habe, hatten eine deutlich dickere Sohle und..."}, {"id": 1404, "start": 8383.2, "end": 8385.2, "text": "Egal, aber sowas in der Richtung habe ich gekauft."}, {"id": 1405, "start": 8385.2, "end": 8388.2, "text": "So, jetzt wisst ihr das auch."}, {"id": 1406, "start": 8388.2, "end": 8391.2, "text": "Ok."}, {"id": 1407, "start": 8391.2, "end": 8394.2, "text": "Ok."}, {"id": 1408, "start": 8394.2, "end": 8397.2, "text": "Gut Leute, am Schluss."}, {"id": 1409, "start": 8397.2, "end": 8398.2, "text": "Was nice, dass ihr dabei wart."}, {"id": 1410, "start": 8398.2, "end": 8399.2, "text": "Danke für die Follows."}, {"id": 1411, "start": 8399.2, "end": 8404.2, "text": "Ich guck mal, wenn wir hier alles jetzt am Start haben, wenn die Seite lädt."}, {"id": 1412, "start": 8404.2, "end": 8409.96, "text": "Jetzt muss er erstmal mit Twitch log in, weil er das schon seit gestern wieder vergessen"}, {"id": 1413, "start": 8409.96, "end": 8410.96, "text": "hat."}, {"id": 1414, "start": 8410.96, "end": 8414.86, "text": "Also, danke für die Follows."}, {"id": 1415, "start": 8414.86, "end": 8423.86, "text": "Karo, Morphase, KissDHD, Akiza, FTW, Testo, Morris, Storm, Kot."}, {"id": 1416, "start": 8424.86, "end": 8425.86, "text": "Wer sehe ich nimmer?"}, {"id": 1417, "start": 8426.86, "end": 8429.86, "text": "Die Resten, die anderen sind von gestern, vielleicht waren das heute auch alle."}, {"id": 1418, "start": 8430.86, "end": 8431.86, "text": "Geht schon mal von aus."}, {"id": 1419, "start": 8431.86, "end": 8432.86, "text": "Ja."}, {"id": 1420, "start": 8433.86, "end": 8436.86, "text": "Schön, dass ihr dabei gewesen seid, wir machen an der Stelle den Schluss."}, {"id": 1421, "start": 8437.86, "end": 8440.86, "text": "Und, äh, vielleicht sehen wir uns ja morgen schon wieder."}, {"id": 1422, "start": 8441.86, "end": 8442.86, "text": "Bis denn."}, {"id": 1423, "start": 8442.86, "end": 8444.86, "text": "See you!"}, {"id": 1424, "start": 8533.86, "end": 8535.86, "text": "Abonnieren"}, {"id": 1425, "start": 8536.86, "end": 8538.86, "text": "Kliken"}, {"id": 1426, "start": 8539.86, "end": 8541.86, "text": "Abonnen"}, {"id": 1427, "start": 8542.86, "end": 8544.86, "text": "Kliken"}, {"id": 1428, "start": 8545.86, "end": 8547.86, "text": "Abonnen"}, {"id": 1429, "start": 8548.86, "end": 8550.86, "text": "Kliken"}, {"id": 1430, "start": 8551.86, "end": 8553.86, "text": "Abonnieren"}, {"id": 1431, "start": 8554.86, "end": 8556.86, "text": "Kliken"}, {"id": 1432, "start": 8557.86, "end": 8559.86, "text": "Abonnieren"}, {"id": 1433, "start": 8559.86, "end": 8561.86, "text": "Abonnieren"}, {"id": 1434, "start": 8562.86, "end": 8564.86, "text": "Kliken"}, {"id": 1435, "start": 8565.86, "end": 8568.86, "text": "Abonnieren"}, {"id": 1436, "start": 8569.86, "end": 8571.86, "text": "Kliken"}, {"id": 1437, "start": 8572.86, "end": 8574.86, "text": "Abonnieren"}, {"id": 1438, "start": 8575.86, "end": 8578.86, "text": "Kliken"}, {"id": 1439, "start": 8578.86, "end": 8580.86, "text": "Das war's für heute. Bis zum nächsten Mal."}]}