{"text": "Soll er.Ich bin am Start, das war jetzt super Optimizer Kram, ich bin heimgegangen, bin ziemlich gutmit dem Zug zurückgekommen, Video fertig gemacht für YouTube, in der Zwischenzeitwas zu essen bestellt, dass das alles parallelisiert ablaufen kann, Ulti-Threaded sozusagen, ganzschnell gefressen, Netzstreben angemacht, ist die Open Beta schon raus? Nö, Open Betaist glaube ich erst ab Samstag oder Morgen, was gab's? Ich würde es jetzt beim Shop zeigen,aber da müsste ich den Shop revealen, es gab, ich glaube, genau, Garnelen, gebratene Garnelen,also nicht gebratene Garnelen, sondern so mit Zeug, frittiert, frittierte Garnelen, sorum, richtig. Frittierte Garnelen gab's als Vorspeise und irgendwie so ein Stückchen frittierterFederkäse war das und als Hauptgericht gab's Ente mit Curry vom Asia bestellts. So, alsowenn er stimmt, sollte es 19 Uhr losgehen. Ich hab' vorhin nur auf die Schnelle was gefunden,ich hab' vorhin nur was gefunden, das ist, ach guck mal, hier haben wir's ja, 8AMPT,2CST, 19 Uhr, ja, jetzt. Pre-Purchase für Open Beta, nee, du musst, du musst nicht Pre-Purchasenfür Open Beta. Du musst nicht Pre-Purchasen für Open Beta. Die Open Beta startet halterst morgen. Zeitzonen, ja, die Zeitzonen sind nervig, ich meine, ich versteh's irgendwo,dass man jetzt nicht, äh, quasi, äh, keine Ahnung, 11 Uhr, dass das dann irgendwann Nachmittagsist oder so, das kann ich nicht, aber Zeitzonen sind an sich schon ein bisschen nervige Geschichte.Darf man zusammenspielen? Nee, ich spiel' erst mal so ein bisschen, wenn's denn dannlosgeht. Habt ihr schon mal ein neues Video gesehen, wo wir gerade dabei sind? Sexy TraxyTwitch Prime, dankeschön. Wobei, natürlich habt ihr schon mal ein neues Video gesehen,weil auf Twitch gab's das Video, ja, äh, zu sehen, bevor es YouTube sehen konnte, dreiTage vorher gab's das hier schon zu sehen. In etwas anderer Art und Weise, muss man sagen.In etwas anderer Art und Weise gab's das Video von heute, ja, schon vor drei oder vier Tagen,war das, glaub ich, vor drei Tagen auf Twitch zu sehen. Warum muss man das, was brauchtdas eigentlich für eine Breite vom Fenster her? Ohje, was, was, was krieg ich denn wiederSchönes aus YouTube Deutschland empfohlen, was ich nicht sehen will? Echt viel. Ungereagiert,okay. Ich bin nicht eingeloggt, sonst könnt ich's gleich mal, ähm, rausfiltern. Ansonstensieht man hier, dass wir schon halbwegs gescheite Sachen bisher geguckt haben und nicht so vielMist aus Deutschland empfohlen wird. Leben und Tod des Nintendo 3DS. Na gut, GTA RP,wobei ich prinzipiell gegen GTA RP nix habe, da sind manche Sachen lustig. Was ich beispielsweiserichtig, richtig schick finde ist, dass, ähm, Kamikaze jetzt ein, so seine, seine Sache gefundenhat, die gut läuft bei ihm. Der hat ja am Anfang ein bisschen Overwatch probiert, das liefer gar nicht gut, was, was Viewer anging und war halt auch sehr rage intensiv. Also fürihn freu ich mich da, dass er das jetzt hingekriegt hat mit seinem GTA RP. Twitch Mason. DreiMonate. Scheiße. Mr. Milchmann auch drei Monate. Scheiße, drei, drei Monate. Leute,ich hab noch keinen Golden Keg Subscriber Badge. Was war man da jetzt? Kein Golden KegSubscriber Badge. Aber ich werd mal direkt nach dem Stream für nächsten profisorischeinen machen. Hab ich überhaupt nicht mit gerechnet, dass ich, Alter, ich bin schonwirklich wieder drei Monate, bin ich, bin ich Partner auf Twitch? Ernsthaft? Wie gehtdas überhaupt? Ich hab doch erst, ich hab doch erst den Tweet gepostet. Ich hab docherst den Tweet gepostet. Auf Twitter, dass ich jetzt Partner bin. Sachen gibt's ja. Hätteich nicht gedacht. Ja, also, bis die Beta losgeht, Leute, ihr habt genau jetzt nochdie Zeit, ein neues Video anzugucken auf YouTube, oder wie der Karsten immer gesagthat, YouTube, wo ich dann teilweise sogar gedacht hab, das stimmt, dann seid ihr genau zu Betapünktlich wieder da. Oh, der Twitch-Mason, ja, ja, ja, aber sowas von. Hast du schongeguckt, gleich, danke lassen. Hier scheint ja ganz gut anzukommen, das Video. Alle schonam Start, sogar vorbestellt. Was? Nein. Ich bestell nichts mehr vor. Vorbestellen istblöd. Also, einzige, wo ich vorbestellen würde, ist, wenn irgendwas dabei wäre, sophysisch, irgendwelche Sammelfiguren oder sowas, und man will das unbedingt haben, aberselbst da kannst du dich nicht drauf verlassen. Denk mal an diese ganze Fallout-69-Geschichte.Ja, da haben sich auch alle gefreut. Oh, ja, geile, Nuka-Cola, oh, eine tolle Tasche,oh, will ich haben. Und dann kam der übelste Crabby raus. Den Sub-Button weggebasht, somuss das sein. Den Sub-Button weggebasht, das finde ich ist eigentlich eine richtiggute Redewendung, die man etablieren müsste im Video. Basht den Sub-Button. Ich weiß,ich kennt ja diesen Bass-Spieler, der immer Bass erzählt in seinen Videos, der immererzählt Slap-Bass, Slap-Like und so Zeug, das hat irgendwie so, so den Sub-Button gebashed,hat irgendwie was ähnliches, finde ich. Slap-Like-Now. Wie hieß der Typ denn? Warte mal, wie hießder denn? Slap-Like-Now, wer war denn das? Der, Dave, Dave, Dave 405 oder so, ja, genau,den meine ich. Slap-Like-Now, den meine ich, genau. Sowas müssen wir noch auch mal etablieren,Basht den Sub-Button. So quasi, wer richtig cool ist, Basht den Sub-Button auch bevorman das Video gesehen hat. Man könnte das Ganze ja noch unter Mauern so nach dem Motto Bashtden Sub-Button oder irgendwie, aber das klingt schon so aggressiv, Alter. Alter, was los,meine Maus bewegt sich voll alleine, warum macht die sowas denn? Warum bewegt sich, ah,das ist die zweite Maus am Rechner, die in der Meinung ist, die muss sich voll alleinebewegen. Das ist zum Aimen nicht unbedingt gut. Jokaluka, Stufe 1, Huge-Subscriber. Max,wie viele Subscriber muss man giften, damit du beim nächsten Video das Intro vormachst?Na ja, also es ist ja allgemein bekannt, dass ich mit sowas käuflich bin, das ist überhauptkein Problem. Also ich würde sagen, für 10 Subs mache ich das Intro vor. Mein Problemist ja nur dabei, ich habe keine Ahnung, wo ich das Intro habe. Der Rüpel, 3 Monate,Huge-Subscriber. Dann doch lieber ohne Intro. Tja, dann ohne Intro, kann man nix machen.Also wenn ich euch mal für das richtig krasse Business einen Tipp geben darf, ich bin jabekannt dafür, dass ich der richtig krasse Businessmaker bin, ihr dürft die Sachen niezu billig machen. Wenn ihr die Sachen zu billig macht, dann will keiner mehr was bezahlen.Geht es einfach aus dem alten Video raus? Na, ich habe schon überpländen und so gemacht,es ist nicht so einfach mit dem aus dem Video rauszuschnitten. Kann man sich schon die Betarunterladen ohne Beta? Ja, ja, kann man. Der Osten meldet sich zurück, nee, der grindetsich zurück höchstens, der meldet sich nicht mal zurück auf YouTube. Und wieviel dassdie Pussycam wiederkommt? Oh, oh, oh. Monka Toss. Bei wem läuft die Meta auch nur mit 3MBit?Ja, das wird wahrscheinlich gerade ordentlich drauf zugegriffen, vermute ich mal. Campaign.Gibt es ein Preview von der Kampagne? Ach ja, das ist das, das ist ja langweilig. Daswollen wir jetzt nicht, nein. Hä? By now? Nein. Destiny 2, warum soll ich das jetztda, genau, die ziehen doch um. Das ist ein anderer Account, da habe ich das Black Opshier nicht drauf. Nice, dass du wieder viele Videos raushast. Ja, es macht auch tatsächlichrichtig Bock, ne. Also, das hätte ich vorher gar nicht gedacht. Ich dachte mir, Alter,YouTube geht mir auf den Sack. Und ich muss ehrlich sagen, YouTube geht mir auch auf denSack. Gar nicht mal so sehr YouTube. Naja, doch, doch. Leute, eine Sache auf YouTubenervt mich. Ist euch das hier schon aufgefallen? Was könnte ich, was könnte ich damit meinen?Ist euch das schon aufgefallen? Wahrscheinlich nicht. Wahrscheinlich ist euch das noch nichtaufgefallen. Und zwar, das liegt nicht an meinem Zoom Level oder so. YouTube ist derMeinung, dass Subscriber-Account, das gibt es schon lange, nein, das gibt es erst seitzwei Tagen, dass das Subscriber-Account kaputt ist. Absichtlich. Die haben gedacht, das Subscriber-Accountüberfordert die Leute und deswegen werden Abozahlen jetzt immer gerundet. Das heißt,die nächste Abozahl, die bei mir angezeigt wird, ist nicht 278.520 oder so, sondern 279k.Und wisst ihr, was die Begründung von YouTube war, warum sie das machen? Nicht etwa, weilsie die Wahrheit aussprechen und sagen, ey, die Leute sind zu überfordert von vielenZahlen, die haben sich da bestimmt was bei gedacht. Die haben gesagt, nein, wir möchtendas auf allen Plattformen einheitlich machen. Und wir haben manche Plattformen, du siehstein bisschen laut, oder? Und wir haben manche Plattformen, die die Zahl eben kurz anzeigenund manche, die die Zahl komplett anzeigen. Und da war die Lösung von YouTube natürlichnicht, wie man jetzt als Normaldenken der Mensch sagen würde, okay, hey, dann zeigdas doch einfach auf allen Plattformen gleich ausführlich an und sagt, nein, wir verkürzendas auf allen Plattformen. Wie kommst du immer auf die Abo-Sprüche? Sind die spontanoder vorher ausgedacht? Teilweise, teils, teils, teils, teils. Manche Sachen fallen mir spontanein. Manchmal fällt mir das spontan kurz vorher ein, dass ich das dann mir mal kurzirgendwas in der Richtung notier. Ich komm drauf an. War eine Frage, wenn du zwischeneiner Unity Media 120k Leitung oder Telekom 100k DSL Leitung wählen konntest, was würdestdu nehmen? Ich würde das nehmen, was kein DS Lite hat und das wahrscheinlich die Telekom.Wenn du Unity Media ohne DS Lite kriegst, würde ich abhängig von machen, was du brauchst,weil Unity Media 120k hat nicht viel Upload, Telekom 100k DSL hat 40, 25, 20. Ich weißgerade nicht, was VDSL für ein Upload hat. Eigentlich wird das nicht open. Aber es istnicht im Prinzip völlig egal, wie genau die Zahl ist. Nein, das ist nicht egal. Ich zeigdir auch mal warum. Weil externe Seiten, die irgendwie Channel Tracking viel schöner hinbekommen,als YouTube jetzt nicht mehr funktionieren. Guck, hier haben sie wunderbar getrackt. Hierkonnten sie noch wunderbar tracken. Deswegen sieht man auch, dass ich 1k neue Abos gemachthabe. Im letzten Monat. Was für von, was von Minus, ohne Scheiß Leute, was von Minus1000 auf Plus 1000 oder von Minus 500 auf Plus 1000 schon nicht verkehrt ist. Und dasmit diesen Seiten geht es nicht mehr. Weil die ja nicht der Meinung waren, wir machenund wir ändern nur die Anzeigen, sondern unsere Google API rückt das auch nicht mehr raus.Fährst du immer noch über Frankfurt Hauptbahnhof zu arbeiten? Nein mache ich nicht mehr, ichfahre über den Südbahnhof. Äh, Lord Alex, Stufe 1. Zwei Monate. Danke schön. Oh, gleichgeht's los. Eine Frage habe gehört, dass alte Wordversionen free sind. A free werdendie wahrscheinlich nicht sein, aber wird sich kein Mensch dafür interessieren, ob du diejetzt irgendwie, äh, oder nicht. Basilos 1905. Dankeschön. Subscriber. Subscriber.Come on brah, genau. Warum eigentlich englisches Tastaturlayout, das ist nur Gebate. Um Leutezu verwirren ist das. Das ist kein englisches Tastaturlayout. Das ist deutsches Tastaturlayoutmit englischer, englischer Sprache. Du kannst aber auf, bei YouTube auf Show more gehenund zeigen. Wo? Was halte ich jetzt für ein Gerücht? Wo? LittleHands97, Dankeschön,Pog. Die Sache ist die, ich verstehe nicht, wer nach dieser Änderung gefragt hat aufYouTube, allen Ernstes. Früher stand das mal hier, aber da steht nicht mehr da. Alsoich wüsste wirklich nicht, wo das auf YouTube steht. Wann geht's los? In, äh, 20 Sekunden.Hoffen wir mal über den Balken. Ja, da siehst du die Likes. Was mit mehr als 1000 Likes,okay dann nehmen wir mein letztes Video. Ich sehe da nichts von genauen Abos. Und geht'slos? Was hier los? Activition. Was hier los? So geht's nicht. Monkathos. So geht's nicht,ich will Microtransaction kaufen. Battle.net neu starten. Das was bringt? Pog. Startet dasjetzt? Hallo? Was jetzt? Oh Danny, Dankeschön. Wollt ihr das jetzt nicht starten? Okay, ichmach das hier aus. Ah. Hä? Was jetzt? Smoke, Monkathos Smoke. Okay. Okay. Okay. Okay.Ja. Ja. Ja. Allo? Ich hab ne Idee. Das ist, das ist, das ist, das ist Anti Cheat Detection.Ich sag's euch Leute. Ey, ich sag's euch, das ist Anti Cheat Detection, weil ich VisualDas ist Anti-Cheat-Detection. Die denken sich, wer Visual Studio auf hat, ist ein nicer Cheator.Ich sag's euch! Ich hab's euch gesagt, Leute! Anti-Cheat! Anti-Cheat! Ich wusste's!Was? Nein, ich will meine Treibe jetzt nicht updaten. Lohnt sich das? Ich hab's euch gesagt, Anti-Cheat!Oh! Jaja, ist gut. Aber jetzt muss ich ja OBS mit der anderen ausmachen. Bisschen laut, oder? Minimal zu laut.Ist ja gut, ey. Ist ja gut. Betreibt man nicht. Game, übertreibt man nicht. Gibt's überhaupt einen neuen Treiber? Oh, hier!Ganz schön sneaky. Aber ganz ehrlich kann ich sagen, dass ich den Grafikkarten-Treiber-Upgrade machen muss. Kam läuft.Meine Güte. Die GeForce Experience wird gestartet. Kann man das machen, während OBS läuft? Da kackt OBS doch garantiert ab, wenn ich das mach, oder?Wenn ich jetzt Grafikkarten-Treiber abmache, da kackt OBS ab. Oder was meint ihr? Überlebt das OBS? Nee, oder? Nee.Nein! Nein! Alter! Du sollst es nicht installieren. Nee. Du sollst es... Ich wollt einfach nur gucken, ob ein neuer Treiber da ist.The fuck? Was ist das? Ist das jetzt euer Ernst? Ich klick das an und es installiert es einfach?You got to bait it. Ach nee. Ah. Ach nee, das war nur die GeForce Experience.Ja, das konnte man jetzt auch mal... Das konnte man jetzt ja auch erkennen, ne? Okay.Mein Problem ist, ist es so unordentlich, dass ich keine Ahnung hab, wo ich meine Anwendung gespeichert hab.Deswegen gucken wir mal, ob wir sneaky im Hintergrund Visual Studio starten können, ohne dass es crasht.Das Programm starten und dann schnell Visual Studio wieder ausmachen.Ach nee.Fuck, das bandert sich. Alter, wo hab ich mein Mist gespeichert?Patrick, dankeschön.Wir starten das jetzt einfach im Hintergrund. Reiß drauf.Warte mal, wo hab ich meine Anwendung gespeichert? Hier.Stream. Stream Meme Tool Web Application 11. Wenn ich meinen Krempel mal ordentlich benennen würde, ne?Wenn ich den Kram mal ordentlich benennen würde, dann könnte ich es auch starten.Siehste? Jetzt geht's. So, auf geht's.Sign in. Hä? Game, wo ist das Problem?Oh.Ich hab nen Key für das Game. Ich hab hier keinen, nicht Open Meter.Warum ist das jetzt so laut?Alter, wie kommt man auf diesen hässlichen Mixer?Okay.Geht's bei euch?Könnt ihr spielen?Bin in Game, okay.Alter, wo ist jetzt das Problem? Muss, muss man da jetzt noch irgendwas machen?Das ist nicht falscher.Nee? Guck mal, ich hab doch sogar, das ist doch sogar der gleiche Name wie auf der PlayState.Rot schon aktiviert? Ja, klar.Muss noch vorne wählen, den Key?Moment. Ach, es reicht nicht. Es reicht nicht, wenn man den Beta Key eingibt online oder was?Man kriegt noch nen extra, ich hab beides aktiviert. Ich hab PS4 und PC aktiviert.Ach so, es gibt es noch mal nen extra Key oder was?Also noch mal nen dritten Key dann.Oder wie, oder was, oder hä?Okay.Also muss ich jetzt in meine Mails gucken?Also muss ich jetzt in meine Mails gucken?Also ich hab ja alles, ihr Code für die Modern Warfare Beta ist da. Man braucht noch nen extra Code.Ach so, ja dann. Easy.Okay. Leute, ich glaub ich hab einen Code zu viel. Wartet mal, ich glaub ich hab zwei Codes.Nee, hab ich nicht. Ich kann euch keinen Code geben.Code Draw.Debated.Kann man nicht kopieren. Okay, wie löst man in diesem Ding jetzt irgendwie Codes ein?Blizzard?Wie löst man da Codes ein?Ach da.So, dann muss ich euch mal ausschalten, weil dann seht ihr meinen Code.Okay, also mal schnell eintippen.Mal gucken ob ich euch ausgeschaltet hab, ja.Muss man die Codes mit Minus eingeben?Ich hatte jetzt nicht gedacht, dass man nochmal nen extra Code braucht. Ich mein, ich musste schon nen Code eingeben, dass ich...Ich mein, warum muss ich nen Code eingeben, dass ich dann nen Code geschickt bekomme?Und davor muss ich mit meinem Count einloggen, das ist doch beknackt.You are claiming. Confirm.Claimed. Okay. Jetzt müsste es also funktionieren.Return to your games. Ah, okay, mal gucken. Jetzt funktioniert.Ist das Game also doch nicht für alle Spielbahnen? Nee, noch nicht.Sag mal, vergisst das Game jedes Mal die Audio-Settings? Was denn?Kannst du Modern Warfare Windows 98 spielen? Bestimmt, bestimmt. Easy.Modern Warfare Windows 98 Edition. Ah, das sieht doch schon viel schöner aus jetzt, except...Controller. Oh, wisst ihr was ich mal nachher unbedingt ausprobieren will?Ob man am PC mit dem Xim schön Crossplay cheaten kann. Das wollen wir mal nachher ausprobieren.Woodface.Oh, es laggt übelst. Es laggt übelst.Laggt übelst. Okay, bla bla bla bla. Audio-Mixes. Headphones.Volumes. Ja gut, Musik machen wir aus, Rest lassen wir an.Colorblind sind wir nicht. Fullscreen, wir wollen Fullscreen borderless haben.Continue. Weil wenn wir Fullscreen borderless haben, kriegen wir auch unsere Bildchen.Die laggen zwar ein bisschen, aber sie funktionieren.Installing Shaders to Opti...What? Das ist wieder so ein komisches Call of Duty Ding, was irgendwie jedes Game im Hintergrund macht oder gar nicht.Brauch keine Ahnung, aber... Ja, was auch immer.Übrigens an diese Mail, alle Donations gehen an diese Mail.Und Donations sind auch gerade kaputt. E-Mail liegt, ist scheißegal. Das ist eh mal eine öffentliche E-Mail, die jeder sieht.Okay, müssen wir jetzt warten, bis Shaders installiert sind.Okay, Maus fühlt sich default eigentlich ganz okay an, zumindest im Menü.Graphics, Refresh. Ist das gelockt? Ach so, weil ich...Render Resolution auf 50? Ich rollen? Ich hab krassen OP-Highend-PC.Wird keine Render Resolution auf 50% gemacht.Custom Frame Rate Limit.Disabled. Ist es dann Unlimited?Bam, 300 im Menü. Gib alles. Gib Gas.Voll. Sehr schön. Guck mal, noch nicht mal dieses Menü schafft es mit Rander zu rendern.Ähm...Ich muss Motion Blur und Gedöns ausstellen, sonst wird das nix.Filmigit?Wer will denn sowas?Was?Warum gibt es solche Settings eigentlich die...Nein, nein, wir wollen ganz stinknormales Multisampling haben und gut...Okay, weiß nicht. Ganz normales Multisampling.Wo kann man denn den Motion Blur ausstellen? Der ist irgendwie nicht da, oder?Sieht denn jemand? Sieht jemand Motion Blur?Kein Motion Blur.Miner-Typ. Oh, RIP.General.Field of View. Okay, da stellen wir gleich mal ein Stückchen hoch.Da kann man hier rein klären, 90.Ah, hier!Ist natürlich auch sehr sinnvoll, dass Motion Blur nicht in Graphics ist.Enabled. Vollen.FPS, Counter. Da haben wir ja oben schon. Haben wir ja oben schon, brauchen wir nicht nochmal.Ja.Okay. Voice Chat wollen wir muten.Okay, Leute, auf geht's.Welcome.Haha, welcome.So, äh, ja. Geh fort.Gunfight.Ist Gunfight 32 vs. 32?Server Latency ist ping. Wo habt ihr Server Latency gesehen?Ah, ja. Unbedingt. Unbedingt.Unbedingt brauchen wir das.Ganz wichtig.Ist Gunfight 2 vs. 2? Okay, wusste ich gar nicht mehr, wie der Klempel heißt.Okay, Quickplay.Wir gehen einfach mal rein.Mal gucken.Au! Level 18, Leute. Ich bin Level 18.Der hat meinen Rang von der Playstation 4 behalten.Lul, ich dachte, ich muss ja von vorne anfangen.Ist das nicht ein bisschen unfair?Na gut, 20. Was soll bei 20 schon passieren?Ground War. Ja, Ground War hab ich nicht gesehen.Ja, Nephtos. Das ist wahrscheinlich der übelste Tryhard-Dude am Start.Was soll denn das daneben eigentlich sein?Das ist eine Maus? Was ist das? Eine Fernbedienung?Oder was ist das?Ein Nunchuck von der Wii?Oh, 1200 FPS. Sogar mein Loadout ist drinne. Cool.Neun Millisekunden. 13, 26. Okay, das kann sich nicht so genau entscheiden, wie viel Ping ich jetzt letztendlich hab.Acht. Okay.Jetzt gibt's huge. Also die Sense ist nicht ganz richtig, aber es kommt kaum aus.Perfekt.Next, please.Hier, wo könnte hier was sein? Alter.Oh, das fühlt sich super komisch an.Ich muss übrigens da oben drauf. Ich zeige euch jetzt mal rühmlich einen nice Spot.Da oben, da checkt keiner, dass ihr da drauf seid. Kann man sich hier andocken? Wie dockt man sich an? Aha, okay.Oh, fuck.Ist das ein neuer Scott oder Modern Warfare Remaster?Das ist Modern Warfare Rebooted, ist das?Mit der Bitrate? Oh, was ist mit meiner Bitrate los?Was ist mit meiner Bitrate los? Oh nee, Spack Unity Media wieder, Leute. Spack Unity Media wieder.Spack Unity Media wieder. Okay, wartet mal, wartet mal.Wartet mal.Hä? Warum sieht das so kacke aus?Warum sieht das so kacke aus?Okay, das leckt nicht an Unity Media. Was ist denn los?Ich meine, dass das jetzt nicht wahnsinnig genial aussieht, dachte ich mir, aber dass das so scheiße aussieht.Warum sieht das so scheiße aus? Ich sehe es gerade in der Vorschau.Übelst rollt das schlecht aus.Ich gucke gerade auf mein Vorschaubildschirm, das pixelt sich mal übelst ein ab.Wir probieren nach der Runde gleich mal was aus, Leute.Wir probieren nach der Runde gleich mal was aus.Wo ist hier was?Das ist meiner. Alter, leg mich hin.Oh fuck. Alter, was ist das?Alter, ich denke immer noch, das sind...Kommst du rum? Kommst du rum?Danke schön.Juff.Oh.Wir capen wir das mal.Das hier oben ist ein richtig heißer Spot.Sag mal, wo sind denn die Gegner? Wo sind denn die Gegner alle?Sind die irgendwie gequittet oder so?Gegner?Alter, die Quali sieht wirklich räudig aus.Ich weiß, was wir machen. Ich weiß, was wir machen nächste Runde.Alter, ist ja gut.Ich check null, wo Gegner sind.Ich weiß, wie man OBS konfiguriert.Aber Bitrate hochstellen alleine bringt ja nichts.Ich hab ja nur begrenzt Upload und ich muss dabei ja noch spielen.Oh, klar. Wir müssen mal gucken, Clay. Ich guck nach der Runde.Ich weiß, was wir machen. Wir stellen die Auflösung einfach ein bisschen runter.Wir stellen die Auflösung runter, Leute. Von hinten, das ist typische Call of Duty Mist.Warum wird eigentlich die Death angezeigt in Domination?Oh, fuck.Ah, veraimt. Warum wird die in Domination angezeigt, die Death, aber in TDM werden Tode nicht angezeigt?Cella vollbilden? Nee, was soll das damit zu tun haben?Was soll das damit zu tun haben, ob das im Vollbild ist oder nicht? Bei mir sieht es auch gut aus.Das liegt an der Bitrate.Krass, leidet er sich einen ab. Geile Schleider.Oh nein, fuck noch einer.Ich guck nach der Runde. Ich glaube, ich mache einfach die Auflösung runter, dann ist das kein Problem.Ja, ist so klar.Autsch, hat aber reingehauen. Das ist übrigens übelst OP, das Spot hier.Mega Head-Clitch-Spot.Vielleicht soll ich mal hier meinen komischen Linksbombs-Strike starten. Der killt übrigens nichts, dieser Strike, der ist übelst...Fuck, übelst freudig.Der hat was gekillt, hätte ich nie gedacht.Okay, du, wo kommt der her? Ernsthaft?Fuck, next level strats, ja.Ich starte dann nach neun minitrigeren Auflösungen, dann sieht das gut aus.Wie gesagt, bis mich Junity Media auf 40M mit Upload eingestellt hat, da fuck, wo kommst denn du her?Wer campt mich jetzt auch mal? Ach fuck, ich hab hier gar keine Camp-Dings dabei.Was für ein Fail, den hab ich ja richtig gesehen.Mist, die Schalte.Da kommt gleich links einer.Sag mal, outplayen die mich irgendwie?Wo sind die?Wo sind hier alle?Was könnten für ne gute Auflösung sein? Also warte mal hier, Output.Rescale, also wir rescalen das mal ein bisschen runter.Pasta? Gucken wir mal, wir gucken mal, ob das was bringt. Mal schauen, dass das Game ordentlich läuft.Also ohne Scheiß, Leute, das fühlt sich auf dem PC einfach gleich drei Millionen mal besser an.Also ich bring sie mal toll finde. Searching for a match. 850 Millisekunden, logisch.Okay, das Turnwermer on. Shadowplay, ist er recordet, wohin? Dahin. Ich hab ehrlich gesagt, hab ich keine, ich hab kaum noch Speicher. Nee, kein sauber Broser.Fuck das. Kommt das Spiel für das Spiel für die Switch?Nee.Ist die Quali jetzt ein Ticken besser? Wenn nicht, starte ich wirklich neu.Nein, nein, nein, okay.Man da hoch.Wissen ihr was? Wenn ihr euch mal blicken lassen. Ja, einmal nicht hingeguckt, wie es am Start.Okay Leute, wisst ihr was? Ich sehs grad in der Vorschau. Das sieht übertrieben scheiße aus. Wartet mal, ich wackel mal.Ich stell mal runter, ich stells, ich stell mal runter.So Leute, ich bin gleich wieder am Start.", "segments": [{"id": 1, "start": 120.0, "end": 148.66, "text": "Soll er."}, {"id": 2, "start": 148.66, "end": 163.14, "text": "Ich bin am Start, das war jetzt super Optimizer Kram, ich bin heimgegangen, bin ziemlich gut"}, {"id": 3, "start": 163.14, "end": 168.58, "text": "mit dem Zug zurückgekommen, Video fertig gemacht für YouTube, in der Zwischenzeit"}, {"id": 4, "start": 168.58, "end": 174.9, "text": "was zu essen bestellt, dass das alles parallelisiert ablaufen kann, Ulti-Threaded sozusagen, ganz"}, {"id": 5, "start": 174.9, "end": 180.38, "text": "schnell gefressen, Netzstreben angemacht, ist die Open Beta schon raus? Nö, Open Beta"}, {"id": 6, "start": 180.38, "end": 187.38, "text": "ist glaube ich erst ab Samstag oder Morgen, was gab's? Ich würde es jetzt beim Shop zeigen,"}, {"id": 7, "start": 187.38, "end": 197.46, "text": "aber da müsste ich den Shop revealen, es gab, ich glaube, genau, Garnelen, gebratene Garnelen,"}, {"id": 8, "start": 197.46, "end": 206.06, "text": "also nicht gebratene Garnelen, sondern so mit Zeug, frittiert, frittierte Garnelen, so"}, {"id": 9, "start": 206.06, "end": 212.38, "text": "rum, richtig. Frittierte Garnelen gab's als Vorspeise und irgendwie so ein Stückchen frittierter"}, {"id": 10, "start": 212.38, "end": 230.86, "text": "Federkäse war das und als Hauptgericht gab's Ente mit Curry vom Asia bestellts. So, also"}, {"id": 11, "start": 230.86, "end": 241.78, "text": "wenn er stimmt, sollte es 19 Uhr losgehen. Ich hab' vorhin nur auf die Schnelle was gefunden,"}, {"id": 12, "start": 241.78, "end": 257.34, "text": "ich hab' vorhin nur was gefunden, das ist, ach guck mal, hier haben wir's ja, 8AMPT,"}, {"id": 13, "start": 257.34, "end": 272.3, "text": "2CST, 19 Uhr, ja, jetzt. Pre-Purchase für Open Beta, nee, du musst, du musst nicht Pre-Purchasen"}, {"id": 14, "start": 272.3, "end": 283.06, "text": "für Open Beta. Du musst nicht Pre-Purchasen für Open Beta. Die Open Beta startet halt"}, {"id": 15, "start": 283.06, "end": 290.98, "text": "erst morgen. Zeitzonen, ja, die Zeitzonen sind nervig, ich meine, ich versteh's irgendwo,"}, {"id": 16, "start": 290.98, "end": 297.26, "text": "dass man jetzt nicht, äh, quasi, äh, keine Ahnung, 11 Uhr, dass das dann irgendwann Nachmittags"}, {"id": 17, "start": 297.26, "end": 300.78, "text": "ist oder so, das kann ich nicht, aber Zeitzonen sind an sich schon ein bisschen nervige Geschichte."}, {"id": 18, "start": 300.78, "end": 319.34, "text": "Darf man zusammenspielen? Nee, ich spiel' erst mal so ein bisschen, wenn's denn dann"}, {"id": 19, "start": 319.34, "end": 328.02, "text": "losgeht. Habt ihr schon mal ein neues Video gesehen, wo wir gerade dabei sind? Sexy Traxy"}, {"id": 20, "start": 328.02, "end": 336.26, "text": "Twitch Prime, dankeschön. Wobei, natürlich habt ihr schon mal ein neues Video gesehen,"}, {"id": 21, "start": 336.26, "end": 341.06, "text": "weil auf Twitch gab's das Video, ja, äh, zu sehen, bevor es YouTube sehen konnte, drei"}, {"id": 22, "start": 341.06, "end": 345.62, "text": "Tage vorher gab's das hier schon zu sehen. In etwas anderer Art und Weise, muss man sagen."}, {"id": 23, "start": 345.62, "end": 356.26, "text": "In etwas anderer Art und Weise gab's das Video von heute, ja, schon vor drei oder vier Tagen,"}, {"id": 24, "start": 356.26, "end": 366.46, "text": "war das, glaub ich, vor drei Tagen auf Twitch zu sehen. Warum muss man das, was braucht"}, {"id": 25, "start": 366.46, "end": 371.18, "text": "das eigentlich für eine Breite vom Fenster her? Ohje, was, was, was krieg ich denn wieder"}, {"id": 26, "start": 371.18, "end": 379.06, "text": "Schönes aus YouTube Deutschland empfohlen, was ich nicht sehen will? Echt viel. Ungereagiert,"}, {"id": 27, "start": 379.06, "end": 387.9, "text": "okay. Ich bin nicht eingeloggt, sonst könnt ich's gleich mal, ähm, rausfiltern. Ansonsten"}, {"id": 28, "start": 387.9, "end": 392.78, "text": "sieht man hier, dass wir schon halbwegs gescheite Sachen bisher geguckt haben und nicht so viel"}, {"id": 29, "start": 392.78, "end": 402.86, "text": "Mist aus Deutschland empfohlen wird. Leben und Tod des Nintendo 3DS. Na gut, GTA RP,"}, {"id": 30, "start": 402.86, "end": 408.62, "text": "wobei ich prinzipiell gegen GTA RP nix habe, da sind manche Sachen lustig. Was ich beispielsweise"}, {"id": 31, "start": 408.62, "end": 416.22, "text": "richtig, richtig schick finde ist, dass, ähm, Kamikaze jetzt ein, so seine, seine Sache gefunden"}, {"id": 32, "start": 416.22, "end": 419.86, "text": "hat, die gut läuft bei ihm. Der hat ja am Anfang ein bisschen Overwatch probiert, das lief"}, {"id": 33, "start": 419.86, "end": 426.54, "text": "er gar nicht gut, was, was Viewer anging und war halt auch sehr rage intensiv. Also für"}, {"id": 34, "start": 426.54, "end": 435.18, "text": "ihn freu ich mich da, dass er das jetzt hingekriegt hat mit seinem GTA RP. Twitch Mason. Drei"}, {"id": 35, "start": 435.18, "end": 442.74, "text": "Monate. Scheiße. Mr. Milchmann auch drei Monate. Scheiße, drei, drei Monate. Leute,"}, {"id": 36, "start": 442.74, "end": 454.78, "text": "ich hab noch keinen Golden Keg Subscriber Badge. Was war man da jetzt? Kein Golden Keg"}, {"id": 37, "start": 454.78, "end": 471.46, "text": "Subscriber Badge. Aber ich werd mal direkt nach dem Stream für nächsten profisorisch"}, {"id": 38, "start": 471.46, "end": 475.86, "text": "einen machen. Hab ich überhaupt nicht mit gerechnet, dass ich, Alter, ich bin schon"}, {"id": 39, "start": 475.86, "end": 482.66, "text": "wirklich wieder drei Monate, bin ich, bin ich Partner auf Twitch? Ernsthaft? Wie geht"}, {"id": 40, "start": 482.66, "end": 492.54, "text": "das überhaupt? Ich hab doch erst, ich hab doch erst den Tweet gepostet. Ich hab doch"}, {"id": 41, "start": 492.54, "end": 516.82, "text": "erst den Tweet gepostet. Auf Twitter, dass ich jetzt Partner bin. Sachen gibt's ja. Hätte"}, {"id": 42, "start": 516.82, "end": 521.42, "text": "ich nicht gedacht. Ja, also, bis die Beta losgeht, Leute, ihr habt genau jetzt noch"}, {"id": 43, "start": 521.42, "end": 526.22, "text": "die Zeit, ein neues Video anzugucken auf YouTube, oder wie der Karsten immer gesagt"}, {"id": 44, "start": 526.22, "end": 532.18, "text": "hat, YouTube, wo ich dann teilweise sogar gedacht hab, das stimmt, dann seid ihr genau zu Beta"}, {"id": 45, "start": 532.18, "end": 551.66, "text": "pünktlich wieder da. Oh, der Twitch-Mason, ja, ja, ja, aber sowas von. Hast du schon"}, {"id": 46, "start": 551.66, "end": 559.14, "text": "geguckt, gleich, danke lassen. Hier scheint ja ganz gut anzukommen, das Video. Alle schon"}, {"id": 47, "start": 559.14, "end": 564.58, "text": "am Start, sogar vorbestellt. Was? Nein. Ich bestell nichts mehr vor. Vorbestellen ist"}, {"id": 48, "start": 564.58, "end": 575.34, "text": "blöd. Also, einzige, wo ich vorbestellen würde, ist, wenn irgendwas dabei wäre, so"}, {"id": 49, "start": 575.34, "end": 580.74, "text": "physisch, irgendwelche Sammelfiguren oder sowas, und man will das unbedingt haben, aber"}, {"id": 50, "start": 580.74, "end": 586.66, "text": "selbst da kannst du dich nicht drauf verlassen. Denk mal an diese ganze Fallout-69-Geschichte."}, {"id": 51, "start": 586.66, "end": 595.06, "text": "Ja, da haben sich auch alle gefreut. Oh, ja, geile, Nuka-Cola, oh, eine tolle Tasche,"}, {"id": 52, "start": 595.06, "end": 601.94, "text": "oh, will ich haben. Und dann kam der übelste Crabby raus. Den Sub-Button weggebasht, so"}, {"id": 53, "start": 601.94, "end": 609.06, "text": "muss das sein. Den Sub-Button weggebasht, das finde ich ist eigentlich eine richtig"}, {"id": 54, "start": 609.06, "end": 614.18, "text": "gute Redewendung, die man etablieren müsste im Video. Basht den Sub-Button. Ich weiß,"}, {"id": 55, "start": 614.18, "end": 622.58, "text": "ich kennt ja diesen Bass-Spieler, der immer Bass erzählt in seinen Videos, der immer"}, {"id": 56, "start": 622.58, "end": 630.7, "text": "erzählt Slap-Bass, Slap-Like und so Zeug, das hat irgendwie so, so den Sub-Button gebashed,"}, {"id": 57, "start": 630.7, "end": 639.34, "text": "hat irgendwie was ähnliches, finde ich. Slap-Like-Now. Wie hieß der Typ denn? Warte mal, wie hieß"}, {"id": 58, "start": 639.34, "end": 651.78, "text": "der denn? Slap-Like-Now, wer war denn das? Der, Dave, Dave, Dave 405 oder so, ja, genau,"}, {"id": 59, "start": 651.78, "end": 661.1, "text": "den meine ich. Slap-Like-Now, den meine ich, genau. Sowas müssen wir noch auch mal etablieren,"}, {"id": 60, "start": 661.1, "end": 667.14, "text": "Basht den Sub-Button. So quasi, wer richtig cool ist, Basht den Sub-Button auch bevor"}, {"id": 61, "start": 667.14, "end": 671.34, "text": "man das Video gesehen hat. Man könnte das Ganze ja noch unter Mauern so nach dem Motto Basht"}, {"id": 62, "start": 671.34, "end": 678.26, "text": "den Sub-Button oder irgendwie, aber das klingt schon so aggressiv, Alter. Alter, was los,"}, {"id": 63, "start": 678.26, "end": 684.06, "text": "meine Maus bewegt sich voll alleine, warum macht die sowas denn? Warum bewegt sich, ah,"}, {"id": 64, "start": 684.06, "end": 687.02, "text": "das ist die zweite Maus am Rechner, die in der Meinung ist, die muss sich voll alleine"}, {"id": 65, "start": 687.02, "end": 704.5, "text": "bewegen. Das ist zum Aimen nicht unbedingt gut. Jokaluka, Stufe 1, Huge-Subscriber. Max,"}, {"id": 66, "start": 704.5, "end": 711.14, "text": "wie viele Subscriber muss man giften, damit du beim nächsten Video das Intro vormachst?"}, {"id": 67, "start": 711.14, "end": 714.46, "text": "Na ja, also es ist ja allgemein bekannt, dass ich mit sowas käuflich bin, das ist überhaupt"}, {"id": 68, "start": 714.46, "end": 732.86, "text": "kein Problem. Also ich würde sagen, für 10 Subs mache ich das Intro vor. Mein Problem"}, {"id": 69, "start": 732.86, "end": 741.38, "text": "ist ja nur dabei, ich habe keine Ahnung, wo ich das Intro habe. Der Rüpel, 3 Monate,"}, {"id": 70, "start": 741.38, "end": 751.38, "text": "Huge-Subscriber. Dann doch lieber ohne Intro. Tja, dann ohne Intro, kann man nix machen."}, {"id": 71, "start": 751.38, "end": 757.06, "text": "Also wenn ich euch mal für das richtig krasse Business einen Tipp geben darf, ich bin ja"}, {"id": 72, "start": 757.06, "end": 762.3, "text": "bekannt dafür, dass ich der richtig krasse Businessmaker bin, ihr dürft die Sachen nie"}, {"id": 73, "start": 762.3, "end": 767.26, "text": "zu billig machen. Wenn ihr die Sachen zu billig macht, dann will keiner mehr was bezahlen."}, {"id": 74, "start": 767.26, "end": 774.94, "text": "Geht es einfach aus dem alten Video raus? Na, ich habe schon überpländen und so gemacht,"}, {"id": 75, "start": 774.94, "end": 779.06, "text": "es ist nicht so einfach mit dem aus dem Video rauszuschnitten. Kann man sich schon die Beta"}, {"id": 76, "start": 779.06, "end": 785.62, "text": "runterladen ohne Beta? Ja, ja, kann man. Der Osten meldet sich zurück, nee, der grindet"}, {"id": 77, "start": 785.62, "end": 792.38, "text": "sich zurück höchstens, der meldet sich nicht mal zurück auf YouTube. Und wieviel dass"}, {"id": 78, "start": 792.38, "end": 811.62, "text": "die Pussycam wiederkommt? Oh, oh, oh. Monka Toss. Bei wem läuft die Meta auch nur mit 3MBit?"}, {"id": 79, "start": 811.62, "end": 817.26, "text": "Ja, das wird wahrscheinlich gerade ordentlich drauf zugegriffen, vermute ich mal. Campaign."}, {"id": 80, "start": 817.26, "end": 827.14, "text": "Gibt es ein Preview von der Kampagne? Ach ja, das ist das, das ist ja langweilig. Das"}, {"id": 81, "start": 827.14, "end": 836.34, "text": "wollen wir jetzt nicht, nein. Hä? By now? Nein. Destiny 2, warum soll ich das jetzt"}, {"id": 82, "start": 836.34, "end": 841.78, "text": "da, genau, die ziehen doch um. Das ist ein anderer Account, da habe ich das Black Ops"}, {"id": 83, "start": 841.78, "end": 847.3, "text": "hier nicht drauf. Nice, dass du wieder viele Videos raushast. Ja, es macht auch tatsächlich"}, {"id": 84, "start": 847.3, "end": 853.74, "text": "richtig Bock, ne. Also, das hätte ich vorher gar nicht gedacht. Ich dachte mir, Alter,"}, {"id": 85, "start": 853.74, "end": 857.3, "text": "YouTube geht mir auf den Sack. Und ich muss ehrlich sagen, YouTube geht mir auch auf den"}, {"id": 86, "start": 857.3, "end": 862.02, "text": "Sack. Gar nicht mal so sehr YouTube. Naja, doch, doch. Leute, eine Sache auf YouTube"}, {"id": 87, "start": 862.02, "end": 869.54, "text": "nervt mich. Ist euch das hier schon aufgefallen? Was könnte ich, was könnte ich damit meinen?"}, {"id": 88, "start": 869.54, "end": 884.66, "text": "Ist euch das schon aufgefallen? Wahrscheinlich nicht. Wahrscheinlich ist euch das noch nicht"}, {"id": 89, "start": 884.66, "end": 891.94, "text": "aufgefallen. Und zwar, das liegt nicht an meinem Zoom Level oder so. YouTube ist der"}, {"id": 90, "start": 891.94, "end": 899.7, "text": "Meinung, dass Subscriber-Account, das gibt es schon lange, nein, das gibt es erst seit"}, {"id": 91, "start": 899.7, "end": 910.1, "text": "zwei Tagen, dass das Subscriber-Account kaputt ist. Absichtlich. Die haben gedacht, das Subscriber-Account"}, {"id": 92, "start": 910.1, "end": 915.1, "text": "überfordert die Leute und deswegen werden Abozahlen jetzt immer gerundet. Das heißt,"}, {"id": 93, "start": 915.1, "end": 926.58, "text": "die nächste Abozahl, die bei mir angezeigt wird, ist nicht 278.520 oder so, sondern 279k."}, {"id": 94, "start": 926.58, "end": 932.06, "text": "Und wisst ihr, was die Begründung von YouTube war, warum sie das machen? Nicht etwa, weil"}, {"id": 95, "start": 932.06, "end": 937.02, "text": "sie die Wahrheit aussprechen und sagen, ey, die Leute sind zu überfordert von vielen"}, {"id": 96, "start": 937.02, "end": 941.46, "text": "Zahlen, die haben sich da bestimmt was bei gedacht. Die haben gesagt, nein, wir möchten"}, {"id": 97, "start": 941.46, "end": 946.66, "text": "das auf allen Plattformen einheitlich machen. Und wir haben manche Plattformen, du siehst"}, {"id": 98, "start": 946.66, "end": 954.66, "text": "ein bisschen laut, oder? Und wir haben manche Plattformen, die die Zahl eben kurz anzeigen"}, {"id": 99, "start": 954.66, "end": 959.22, "text": "und manche, die die Zahl komplett anzeigen. Und da war die Lösung von YouTube natürlich"}, {"id": 100, "start": 959.22, "end": 963.94, "text": "nicht, wie man jetzt als Normaldenken der Mensch sagen würde, okay, hey, dann zeig"}, {"id": 101, "start": 963.94, "end": 968.78, "text": "das doch einfach auf allen Plattformen gleich ausführlich an und sagt, nein, wir verkürzen"}, {"id": 102, "start": 968.78, "end": 974.5, "text": "das auf allen Plattformen. Wie kommst du immer auf die Abo-Sprüche? Sind die spontan"}, {"id": 103, "start": 974.5, "end": 979.54, "text": "oder vorher ausgedacht? Teilweise, teils, teils, teils, teils. Manche Sachen fallen mir spontan"}, {"id": 104, "start": 979.54, "end": 983.34, "text": "ein. Manchmal fällt mir das spontan kurz vorher ein, dass ich das dann mir mal kurz"}, {"id": 105, "start": 983.34, "end": 990.26, "text": "irgendwas in der Richtung notier. Ich komm drauf an. War eine Frage, wenn du zwischen"}, {"id": 106, "start": 990.26, "end": 997.86, "text": "einer Unity Media 120k Leitung oder Telekom 100k DSL Leitung wählen konntest, was würdest"}, {"id": 107, "start": 997.86, "end": 1004.46, "text": "du nehmen? Ich würde das nehmen, was kein DS Lite hat und das wahrscheinlich die Telekom."}, {"id": 108, "start": 1004.46, "end": 1009.5, "text": "Wenn du Unity Media ohne DS Lite kriegst, würde ich abhängig von machen, was du brauchst,"}, {"id": 109, "start": 1009.5, "end": 1021.06, "text": "weil Unity Media 120k hat nicht viel Upload, Telekom 100k DSL hat 40, 25, 20. Ich weiß"}, {"id": 110, "start": 1021.06, "end": 1034.9, "text": "gerade nicht, was VDSL für ein Upload hat. Eigentlich wird das nicht open. Aber es ist"}, {"id": 111, "start": 1034.9, "end": 1039.26, "text": "nicht im Prinzip völlig egal, wie genau die Zahl ist. Nein, das ist nicht egal. Ich zeig"}, {"id": 112, "start": 1039.26, "end": 1045.7, "text": "dir auch mal warum. Weil externe Seiten, die irgendwie Channel Tracking viel schöner hinbekommen,"}, {"id": 113, "start": 1045.7, "end": 1051.5, "text": "als YouTube jetzt nicht mehr funktionieren. Guck, hier haben sie wunderbar getrackt. Hier"}, {"id": 114, "start": 1051.5, "end": 1056.14, "text": "konnten sie noch wunderbar tracken. Deswegen sieht man auch, dass ich 1k neue Abos gemacht"}, {"id": 115, "start": 1056.14, "end": 1065.06, "text": "habe. Im letzten Monat. Was für von, was von Minus, ohne Scheiß Leute, was von Minus"}, {"id": 116, "start": 1065.06, "end": 1075.02, "text": "1000 auf Plus 1000 oder von Minus 500 auf Plus 1000 schon nicht verkehrt ist. Und das"}, {"id": 117, "start": 1075.02, "end": 1078.38, "text": "mit diesen Seiten geht es nicht mehr. Weil die ja nicht der Meinung waren, wir machen"}, {"id": 118, "start": 1078.38, "end": 1082.94, "text": "und wir ändern nur die Anzeigen, sondern unsere Google API rückt das auch nicht mehr raus."}, {"id": 119, "start": 1082.94, "end": 1088.54, "text": "Fährst du immer noch über Frankfurt Hauptbahnhof zu arbeiten? Nein mache ich nicht mehr, ich"}, {"id": 120, "start": 1088.54, "end": 1106.9, "text": "fahre über den Südbahnhof. Äh, Lord Alex, Stufe 1. Zwei Monate. Danke schön. Oh, gleich"}, {"id": 121, "start": 1106.9, "end": 1115.74, "text": "geht's los. Eine Frage habe gehört, dass alte Wordversionen free sind. A free werden"}, {"id": 122, "start": 1115.74, "end": 1118.54, "text": "die wahrscheinlich nicht sein, aber wird sich kein Mensch dafür interessieren, ob du die"}, {"id": 123, "start": 1118.54, "end": 1133.5, "text": "jetzt irgendwie, äh, oder nicht. Basilos 1905. Dankeschön. Subscriber. Subscriber."}, {"id": 124, "start": 1133.5, "end": 1147.34, "text": "Come on brah, genau. Warum eigentlich englisches Tastaturlayout, das ist nur Gebate. Um Leute"}, {"id": 125, "start": 1147.34, "end": 1161.94, "text": "zu verwirren ist das. Das ist kein englisches Tastaturlayout. Das ist deutsches Tastaturlayout"}, {"id": 126, "start": 1161.94, "end": 1169.14, "text": "mit englischer, englischer Sprache. Du kannst aber auf, bei YouTube auf Show more gehen"}, {"id": 127, "start": 1169.14, "end": 1175.66, "text": "und zeigen. Wo? Was halte ich jetzt für ein Gerücht? Wo? LittleHands97, Dankeschön,"}, {"id": 128, "start": 1175.66, "end": 1183.5, "text": "Pog. Die Sache ist die, ich verstehe nicht, wer nach dieser Änderung gefragt hat auf"}, {"id": 129, "start": 1183.5, "end": 1189.22, "text": "YouTube, allen Ernstes. Früher stand das mal hier, aber da steht nicht mehr da. Also"}, {"id": 130, "start": 1189.22, "end": 1197.22, "text": "ich wüsste wirklich nicht, wo das auf YouTube steht. Wann geht's los? In, äh, 20 Sekunden."}, {"id": 131, "start": 1197.22, "end": 1217.22, "text": "Hoffen wir mal über den Balken. Ja, da siehst du die Likes. Was mit mehr als 1000 Likes,"}, {"id": 132, "start": 1217.22, "end": 1232.98, "text": "okay dann nehmen wir mein letztes Video. Ich sehe da nichts von genauen Abos. Und geht's"}, {"id": 133, "start": 1232.98, "end": 1249.78, "text": "los? Was hier los? Activition. Was hier los? So geht's nicht. Monkathos. So geht's nicht,"}, {"id": 134, "start": 1249.78, "end": 1276.02, "text": "ich will Microtransaction kaufen. Battle.net neu starten. Das was bringt? Pog. Startet das"}, {"id": 135, "start": 1276.02, "end": 1291.58, "text": "jetzt? Hallo? Was jetzt? Oh Danny, Dankeschön. Wollt ihr das jetzt nicht starten? Okay, ich"}, {"id": 136, "start": 1291.58, "end": 1314.02, "text": "mach das hier aus. Ah. Hä? Was jetzt? Smoke, Monkathos Smoke. Okay. Okay. Okay. Okay."}, {"id": 137, "start": 1314.02, "end": 1333.3, "text": "Ja. Ja. Ja. Allo? Ich hab ne Idee. Das ist, das ist, das ist, das ist Anti Cheat Detection."}, {"id": 138, "start": 1333.3, "end": 1338.94, "text": "Ich sag's euch Leute. Ey, ich sag's euch, das ist Anti Cheat Detection, weil ich Visual"}, {"id": 139, "start": 1338.94, "end": 1348.94, "text": "Das ist Anti-Cheat-Detection. Die denken sich, wer Visual Studio auf hat, ist ein nicer Cheator."}, {"id": 140, "start": 1348.94, "end": 1370.94, "text": "Ich sag's euch! Ich hab's euch gesagt, Leute! Anti-Cheat! Anti-Cheat! Ich wusste's!"}, {"id": 141, "start": 1370.94, "end": 1387.94, "text": "Was? Nein, ich will meine Treibe jetzt nicht updaten. Lohnt sich das? Ich hab's euch gesagt, Anti-Cheat!"}, {"id": 142, "start": 1387.94, "end": 1402.94, "text": "Oh! Jaja, ist gut. Aber jetzt muss ich ja OBS mit der anderen ausmachen. Bisschen laut, oder? Minimal zu laut."}, {"id": 143, "start": 1402.94, "end": 1417.94, "text": "Ist ja gut, ey. Ist ja gut. Betreibt man nicht. Game, übertreibt man nicht. Gibt's überhaupt einen neuen Treiber? Oh, hier!"}, {"id": 144, "start": 1417.94, "end": 1426.94, "text": "Ganz schön sneaky. Aber ganz ehrlich kann ich sagen, dass ich den Grafikkarten-Treiber-Upgrade machen muss. Kam läuft."}, {"id": 145, "start": 1426.94, "end": 1438.94, "text": "Meine Güte. Die GeForce Experience wird gestartet. Kann man das machen, während OBS läuft? Da kackt OBS doch garantiert ab, wenn ich das mach, oder?"}, {"id": 146, "start": 1438.94, "end": 1447.94, "text": "Wenn ich jetzt Grafikkarten-Treiber abmache, da kackt OBS ab. Oder was meint ihr? Überlebt das OBS? Nee, oder? Nee."}, {"id": 147, "start": 1447.94, "end": 1461.94, "text": "Nein! Nein! Alter! Du sollst es nicht installieren. Nee. Du sollst es... Ich wollt einfach nur gucken, ob ein neuer Treiber da ist."}, {"id": 148, "start": 1461.94, "end": 1472.94, "text": "The fuck? Was ist das? Ist das jetzt euer Ernst? Ich klick das an und es installiert es einfach?"}, {"id": 149, "start": 1472.94, "end": 1487.94, "text": "You got to bait it. Ach nee. Ah. Ach nee, das war nur die GeForce Experience."}, {"id": 150, "start": 1487.94, "end": 1499.94, "text": "Ja, das konnte man jetzt auch mal... Das konnte man jetzt ja auch erkennen, ne? Okay."}, {"id": 151, "start": 1499.94, "end": 1504.94, "text": "Mein Problem ist, ist es so unordentlich, dass ich keine Ahnung hab, wo ich meine Anwendung gespeichert hab."}, {"id": 152, "start": 1504.94, "end": 1509.94, "text": "Deswegen gucken wir mal, ob wir sneaky im Hintergrund Visual Studio starten können, ohne dass es crasht."}, {"id": 153, "start": 1509.94, "end": 1515.94, "text": "Das Programm starten und dann schnell Visual Studio wieder ausmachen."}, {"id": 154, "start": 1515.94, "end": 1530.94, "text": "Ach nee."}, {"id": 155, "start": 1530.94, "end": 1534.94, "text": "Fuck, das bandert sich. Alter, wo hab ich mein Mist gespeichert?"}, {"id": 156, "start": 1534.94, "end": 1541.94, "text": "Patrick, dankeschön."}, {"id": 157, "start": 1541.94, "end": 1545.94, "text": "Wir starten das jetzt einfach im Hintergrund. Reiß drauf."}, {"id": 158, "start": 1545.94, "end": 1548.94, "text": "Warte mal, wo hab ich meine Anwendung gespeichert? Hier."}, {"id": 159, "start": 1548.94, "end": 1555.94, "text": "Stream. Stream Meme Tool Web Application 11. Wenn ich meinen Krempel mal ordentlich benennen würde, ne?"}, {"id": 160, "start": 1555.94, "end": 1562.94, "text": "Wenn ich den Kram mal ordentlich benennen würde, dann könnte ich es auch starten."}, {"id": 161, "start": 1562.94, "end": 1578.94, "text": "Siehste? Jetzt geht's. So, auf geht's."}, {"id": 162, "start": 1578.94, "end": 1591.94, "text": "Sign in. Hä? Game, wo ist das Problem?"}, {"id": 163, "start": 1591.94, "end": 1608.94, "text": "Oh."}, {"id": 164, "start": 1608.94, "end": 1614.94, "text": "Ich hab nen Key für das Game. Ich hab hier keinen, nicht Open Meter."}, {"id": 165, "start": 1614.94, "end": 1619.94, "text": "Warum ist das jetzt so laut?"}, {"id": 166, "start": 1619.94, "end": 1629.94, "text": "Alter, wie kommt man auf diesen hässlichen Mixer?"}, {"id": 167, "start": 1629.94, "end": 1632.94, "text": "Okay."}, {"id": 168, "start": 1632.94, "end": 1636.94, "text": "Geht's bei euch?"}, {"id": 169, "start": 1636.94, "end": 1650.94, "text": "Könnt ihr spielen?"}, {"id": 170, "start": 1650.94, "end": 1656.94, "text": "Bin in Game, okay."}, {"id": 171, "start": 1656.94, "end": 1660.94, "text": "Alter, wo ist jetzt das Problem? Muss, muss man da jetzt noch irgendwas machen?"}, {"id": 172, "start": 1660.94, "end": 1664.94, "text": "Das ist nicht falscher."}, {"id": 173, "start": 1664.94, "end": 1670.94, "text": "Nee? Guck mal, ich hab doch sogar, das ist doch sogar der gleiche Name wie auf der PlayState."}, {"id": 174, "start": 1670.94, "end": 1675.94, "text": "Rot schon aktiviert? Ja, klar."}, {"id": 175, "start": 1675.94, "end": 1679.94, "text": "Muss noch vorne wählen, den Key?"}, {"id": 176, "start": 1679.94, "end": 1687.94, "text": "Moment. Ach, es reicht nicht. Es reicht nicht, wenn man den Beta Key eingibt online oder was?"}, {"id": 177, "start": 1687.94, "end": 1692.94, "text": "Man kriegt noch nen extra, ich hab beides aktiviert. Ich hab PS4 und PC aktiviert."}, {"id": 178, "start": 1692.94, "end": 1697.94, "text": "Ach so, es gibt es noch mal nen extra Key oder was?"}, {"id": 179, "start": 1697.94, "end": 1700.94, "text": "Also noch mal nen dritten Key dann."}, {"id": 180, "start": 1700.94, "end": 1703.94, "text": "Oder wie, oder was, oder hä?"}, {"id": 181, "start": 1703.94, "end": 1708.94, "text": "Okay."}, {"id": 182, "start": 1708.94, "end": 1718.94, "text": "Also muss ich jetzt in meine Mails gucken?"}, {"id": 183, "start": 1718.94, "end": 1738.94, "text": "Also muss ich jetzt in meine Mails gucken?"}, {"id": 184, "start": 1738.94, "end": 1747.94, "text": "Also ich hab ja alles, ihr Code für die Modern Warfare Beta ist da. Man braucht noch nen extra Code."}, {"id": 185, "start": 1747.94, "end": 1751.94, "text": "Ach so, ja dann. Easy."}, {"id": 186, "start": 1751.94, "end": 1760.94, "text": "Okay. Leute, ich glaub ich hab einen Code zu viel. Wartet mal, ich glaub ich hab zwei Codes."}, {"id": 187, "start": 1760.94, "end": 1763.94, "text": "Nee, hab ich nicht. Ich kann euch keinen Code geben."}, {"id": 188, "start": 1763.94, "end": 1769.94, "text": "Code Draw."}, {"id": 189, "start": 1769.94, "end": 1773.94, "text": "Debated."}, {"id": 190, "start": 1773.94, "end": 1783.94, "text": "Kann man nicht kopieren. Okay, wie löst man in diesem Ding jetzt irgendwie Codes ein?"}, {"id": 191, "start": 1783.94, "end": 1790.94, "text": "Blizzard?"}, {"id": 192, "start": 1790.94, "end": 1803.94, "text": "Wie löst man da Codes ein?"}, {"id": 193, "start": 1803.94, "end": 1807.94, "text": "Ach da."}, {"id": 194, "start": 1807.94, "end": 1815.94, "text": "So, dann muss ich euch mal ausschalten, weil dann seht ihr meinen Code."}, {"id": 195, "start": 1815.94, "end": 1820.94, "text": "Okay, also mal schnell eintippen."}, {"id": 196, "start": 1820.94, "end": 1824.94, "text": "Mal gucken ob ich euch ausgeschaltet hab, ja."}, {"id": 197, "start": 1824.94, "end": 1830.94, "text": "Muss man die Codes mit Minus eingeben?"}, {"id": 198, "start": 1830.94, "end": 1836.94, "text": "Ich hatte jetzt nicht gedacht, dass man nochmal nen extra Code braucht. Ich mein, ich musste schon nen Code eingeben, dass ich..."}, {"id": 199, "start": 1836.94, "end": 1841.94, "text": "Ich mein, warum muss ich nen Code eingeben, dass ich dann nen Code geschickt bekomme?"}, {"id": 200, "start": 1841.94, "end": 1848.94, "text": "Und davor muss ich mit meinem Count einloggen, das ist doch beknackt."}, {"id": 201, "start": 1848.94, "end": 1854.94, "text": "You are claiming. Confirm."}, {"id": 202, "start": 1854.94, "end": 1862.94, "text": "Claimed. Okay. Jetzt müsste es also funktionieren."}, {"id": 203, "start": 1862.94, "end": 1871.94, "text": "Return to your games. Ah, okay, mal gucken. Jetzt funktioniert."}, {"id": 204, "start": 1871.94, "end": 1876.94, "text": "Ist das Game also doch nicht für alle Spielbahnen? Nee, noch nicht."}, {"id": 205, "start": 1876.94, "end": 1886.94, "text": "Sag mal, vergisst das Game jedes Mal die Audio-Settings? Was denn?"}, {"id": 206, "start": 1886.94, "end": 1894.94, "text": "Kannst du Modern Warfare Windows 98 spielen? Bestimmt, bestimmt. Easy."}, {"id": 207, "start": 1894.94, "end": 1901.94, "text": "Modern Warfare Windows 98 Edition. Ah, das sieht doch schon viel schöner aus jetzt, except..."}, {"id": 208, "start": 1901.94, "end": 1905.94, "text": "Controller. Oh, wisst ihr was ich mal nachher unbedingt ausprobieren will?"}, {"id": 209, "start": 1905.94, "end": 1914.94, "text": "Ob man am PC mit dem Xim schön Crossplay cheaten kann. Das wollen wir mal nachher ausprobieren."}, {"id": 210, "start": 1914.94, "end": 1929.94, "text": "Woodface."}, {"id": 211, "start": 1929.94, "end": 1933.94, "text": "Oh, es laggt übelst. Es laggt übelst."}, {"id": 212, "start": 1933.94, "end": 1940.94, "text": "Laggt übelst. Okay, bla bla bla bla. Audio-Mixes. Headphones."}, {"id": 213, "start": 1940.94, "end": 1944.94, "text": "Volumes. Ja gut, Musik machen wir aus, Rest lassen wir an."}, {"id": 214, "start": 1944.94, "end": 1956.94, "text": "Colorblind sind wir nicht. Fullscreen, wir wollen Fullscreen borderless haben."}, {"id": 215, "start": 1956.94, "end": 1965.94, "text": "Continue. Weil wenn wir Fullscreen borderless haben, kriegen wir auch unsere Bildchen."}, {"id": 216, "start": 1965.94, "end": 1970.94, "text": "Die laggen zwar ein bisschen, aber sie funktionieren."}, {"id": 217, "start": 1970.94, "end": 1975.94, "text": "Installing Shaders to Opti..."}, {"id": 218, "start": 1975.94, "end": 1981.94, "text": "What? Das ist wieder so ein komisches Call of Duty Ding, was irgendwie jedes Game im Hintergrund macht oder gar nicht."}, {"id": 219, "start": 1981.94, "end": 1986.94, "text": "Brauch keine Ahnung, aber... Ja, was auch immer."}, {"id": 220, "start": 1986.94, "end": 1990.94, "text": "Übrigens an diese Mail, alle Donations gehen an diese Mail."}, {"id": 221, "start": 1990.94, "end": 2000.94, "text": "Und Donations sind auch gerade kaputt. E-Mail liegt, ist scheißegal. Das ist eh mal eine öffentliche E-Mail, die jeder sieht."}, {"id": 222, "start": 2000.94, "end": 2008.94, "text": "Okay, müssen wir jetzt warten, bis Shaders installiert sind."}, {"id": 223, "start": 2008.94, "end": 2014.94, "text": "Okay, Maus fühlt sich default eigentlich ganz okay an, zumindest im Menü."}, {"id": 224, "start": 2014.94, "end": 2020.94, "text": "Graphics, Refresh. Ist das gelockt? Ach so, weil ich..."}, {"id": 225, "start": 2020.94, "end": 2030.94, "text": "Render Resolution auf 50? Ich rollen? Ich hab krassen OP-Highend-PC."}, {"id": 226, "start": 2030.94, "end": 2037.94, "text": "Wird keine Render Resolution auf 50% gemacht."}, {"id": 227, "start": 2037.94, "end": 2041.94, "text": "Custom Frame Rate Limit."}, {"id": 228, "start": 2041.94, "end": 2045.94, "text": "Disabled. Ist es dann Unlimited?"}, {"id": 229, "start": 2045.94, "end": 2050.94, "text": "Bam, 300 im Menü. Gib alles. Gib Gas."}, {"id": 230, "start": 2050.94, "end": 2055.94, "text": "Voll. Sehr schön. Guck mal, noch nicht mal dieses Menü schafft es mit Rander zu rendern."}, {"id": 231, "start": 2055.94, "end": 2058.94, "text": "Ähm..."}, {"id": 232, "start": 2058.94, "end": 2065.94, "text": "Ich muss Motion Blur und Gedöns ausstellen, sonst wird das nix."}, {"id": 233, "start": 2065.94, "end": 2069.94, "text": "Filmigit?"}, {"id": 234, "start": 2069.94, "end": 2075.94, "text": "Wer will denn sowas?"}, {"id": 235, "start": 2075.94, "end": 2082.94, "text": "Was?"}, {"id": 236, "start": 2082.94, "end": 2086.94, "text": "Warum gibt es solche Settings eigentlich die..."}, {"id": 237, "start": 2086.94, "end": 2095.94, "text": "Nein, nein, wir wollen ganz stinknormales Multisampling haben und gut..."}, {"id": 238, "start": 2095.94, "end": 2101.94, "text": "Okay, weiß nicht. Ganz normales Multisampling."}, {"id": 239, "start": 2101.94, "end": 2105.94, "text": "Wo kann man denn den Motion Blur ausstellen? Der ist irgendwie nicht da, oder?"}, {"id": 240, "start": 2105.94, "end": 2112.94, "text": "Sieht denn jemand? Sieht jemand Motion Blur?"}, {"id": 241, "start": 2112.94, "end": 2115.94, "text": "Kein Motion Blur."}, {"id": 242, "start": 2115.94, "end": 2118.94, "text": "Miner-Typ. Oh, RIP."}, {"id": 243, "start": 2118.94, "end": 2121.94, "text": "General."}, {"id": 244, "start": 2121.94, "end": 2126.94, "text": "Field of View. Okay, da stellen wir gleich mal ein Stückchen hoch."}, {"id": 245, "start": 2126.94, "end": 2132.94, "text": "Da kann man hier rein klären, 90."}, {"id": 246, "start": 2132.94, "end": 2134.94, "text": "Ah, hier!"}, {"id": 247, "start": 2134.94, "end": 2143.94, "text": "Ist natürlich auch sehr sinnvoll, dass Motion Blur nicht in Graphics ist."}, {"id": 248, "start": 2143.94, "end": 2146.94, "text": "Enabled. Vollen."}, {"id": 249, "start": 2146.94, "end": 2155.94, "text": "FPS, Counter. Da haben wir ja oben schon. Haben wir ja oben schon, brauchen wir nicht nochmal."}, {"id": 250, "start": 2155.94, "end": 2158.94, "text": "Ja."}, {"id": 251, "start": 2158.94, "end": 2162.94, "text": "Okay. Voice Chat wollen wir muten."}, {"id": 252, "start": 2162.94, "end": 2164.94, "text": "Okay, Leute, auf geht's."}, {"id": 253, "start": 2164.94, "end": 2166.94, "text": "Welcome."}, {"id": 254, "start": 2166.94, "end": 2169.94, "text": "Haha, welcome."}, {"id": 255, "start": 2169.94, "end": 2172.94, "text": "So, äh, ja. Geh fort."}, {"id": 256, "start": 2172.94, "end": 2174.94, "text": "Gunfight."}, {"id": 257, "start": 2174.94, "end": 2185.94, "text": "Ist Gunfight 32 vs. 32?"}, {"id": 258, "start": 2185.94, "end": 2189.94, "text": "Server Latency ist ping. Wo habt ihr Server Latency gesehen?"}, {"id": 259, "start": 2189.94, "end": 2194.94, "text": "Ah, ja. Unbedingt. Unbedingt."}, {"id": 260, "start": 2194.94, "end": 2198.94, "text": "Unbedingt brauchen wir das."}, {"id": 261, "start": 2198.94, "end": 2199.94, "text": "Ganz wichtig."}, {"id": 262, "start": 2199.94, "end": 2204.94, "text": "Ist Gunfight 2 vs. 2? Okay, wusste ich gar nicht mehr, wie der Klempel heißt."}, {"id": 263, "start": 2204.94, "end": 2207.94, "text": "Okay, Quickplay."}, {"id": 264, "start": 2207.94, "end": 2210.94, "text": "Wir gehen einfach mal rein."}, {"id": 265, "start": 2210.94, "end": 2211.94, "text": "Mal gucken."}, {"id": 266, "start": 2211.94, "end": 2216.94, "text": "Au! Level 18, Leute. Ich bin Level 18."}, {"id": 267, "start": 2216.94, "end": 2220.94, "text": "Der hat meinen Rang von der Playstation 4 behalten."}, {"id": 268, "start": 2220.94, "end": 2227.94, "text": "Lul, ich dachte, ich muss ja von vorne anfangen."}, {"id": 269, "start": 2227.94, "end": 2230.94, "text": "Ist das nicht ein bisschen unfair?"}, {"id": 270, "start": 2230.94, "end": 2241.94, "text": "Na gut, 20. Was soll bei 20 schon passieren?"}, {"id": 271, "start": 2241.94, "end": 2246.94, "text": "Ground War. Ja, Ground War hab ich nicht gesehen."}, {"id": 272, "start": 2246.94, "end": 2250.94, "text": "Ja, Nephtos. Das ist wahrscheinlich der übelste Tryhard-Dude am Start."}, {"id": 273, "start": 2250.94, "end": 2253.94, "text": "Was soll denn das daneben eigentlich sein?"}, {"id": 274, "start": 2253.94, "end": 2256.94, "text": "Das ist eine Maus? Was ist das? Eine Fernbedienung?"}, {"id": 275, "start": 2256.94, "end": 2258.94, "text": "Oder was ist das?"}, {"id": 276, "start": 2258.94, "end": 2263.94, "text": "Ein Nunchuck von der Wii?"}, {"id": 277, "start": 2263.94, "end": 2272.94, "text": "Oh, 1200 FPS. Sogar mein Loadout ist drinne. Cool."}, {"id": 278, "start": 2272.94, "end": 2279.94, "text": "Neun Millisekunden. 13, 26. Okay, das kann sich nicht so genau entscheiden, wie viel Ping ich jetzt letztendlich hab."}, {"id": 279, "start": 2279.94, "end": 2281.94, "text": "Acht. Okay."}, {"id": 280, "start": 2281.94, "end": 2290.94, "text": "Jetzt gibt's huge. Also die Sense ist nicht ganz richtig, aber es kommt kaum aus."}, {"id": 281, "start": 2290.94, "end": 2298.94, "text": "Perfekt."}, {"id": 282, "start": 2298.94, "end": 2304.94, "text": "Next, please."}, {"id": 283, "start": 2304.94, "end": 2311.94, "text": "Hier, wo könnte hier was sein? Alter."}, {"id": 284, "start": 2311.94, "end": 2314.94, "text": "Oh, das fühlt sich super komisch an."}, {"id": 285, "start": 2314.94, "end": 2321.94, "text": "Ich muss übrigens da oben drauf. Ich zeige euch jetzt mal rühmlich einen nice Spot."}, {"id": 286, "start": 2321.94, "end": 2333.94, "text": "Da oben, da checkt keiner, dass ihr da drauf seid. Kann man sich hier andocken? Wie dockt man sich an? Aha, okay."}, {"id": 287, "start": 2333.94, "end": 2342.94, "text": "Oh, fuck."}, {"id": 288, "start": 2342.94, "end": 2345.94, "text": "Ist das ein neuer Scott oder Modern Warfare Remaster?"}, {"id": 289, "start": 2345.94, "end": 2351.94, "text": "Das ist Modern Warfare Rebooted, ist das?"}, {"id": 290, "start": 2351.94, "end": 2355.94, "text": "Mit der Bitrate? Oh, was ist mit meiner Bitrate los?"}, {"id": 291, "start": 2355.94, "end": 2362.94, "text": "Was ist mit meiner Bitrate los? Oh nee, Spack Unity Media wieder, Leute. Spack Unity Media wieder."}, {"id": 292, "start": 2362.94, "end": 2371.94, "text": "Spack Unity Media wieder. Okay, wartet mal, wartet mal."}, {"id": 293, "start": 2371.94, "end": 2376.94, "text": "Wartet mal."}, {"id": 294, "start": 2376.94, "end": 2383.94, "text": "Hä? Warum sieht das so kacke aus?"}, {"id": 295, "start": 2383.94, "end": 2390.94, "text": "Warum sieht das so kacke aus?"}, {"id": 296, "start": 2390.94, "end": 2393.94, "text": "Okay, das leckt nicht an Unity Media. Was ist denn los?"}, {"id": 297, "start": 2393.94, "end": 2401.94, "text": "Ich meine, dass das jetzt nicht wahnsinnig genial aussieht, dachte ich mir, aber dass das so scheiße aussieht."}, {"id": 298, "start": 2401.94, "end": 2405.94, "text": "Warum sieht das so scheiße aus? Ich sehe es gerade in der Vorschau."}, {"id": 299, "start": 2405.94, "end": 2413.94, "text": "Übelst rollt das schlecht aus."}, {"id": 300, "start": 2413.94, "end": 2423.94, "text": "Ich gucke gerade auf mein Vorschaubildschirm, das pixelt sich mal übelst ein ab."}, {"id": 301, "start": 2423.94, "end": 2428.94, "text": "Wir probieren nach der Runde gleich mal was aus, Leute."}, {"id": 302, "start": 2428.94, "end": 2437.94, "text": "Wir probieren nach der Runde gleich mal was aus."}, {"id": 303, "start": 2437.94, "end": 2448.94, "text": "Wo ist hier was?"}, {"id": 304, "start": 2448.94, "end": 2467.94, "text": "Das ist meiner. Alter, leg mich hin."}, {"id": 305, "start": 2467.94, "end": 2486.94, "text": "Oh fuck. Alter, was ist das?"}, {"id": 306, "start": 2486.94, "end": 2492.94, "text": "Alter, ich denke immer noch, das sind..."}, {"id": 307, "start": 2492.94, "end": 2496.94, "text": "Kommst du rum? Kommst du rum?"}, {"id": 308, "start": 2496.94, "end": 2498.94, "text": "Danke schön."}, {"id": 309, "start": 2498.94, "end": 2514.94, "text": "Juff."}, {"id": 310, "start": 2514.94, "end": 2522.94, "text": "Oh."}, {"id": 311, "start": 2522.94, "end": 2545.94, "text": "Wir capen wir das mal."}, {"id": 312, "start": 2545.94, "end": 2547.94, "text": "Das hier oben ist ein richtig heißer Spot."}, {"id": 313, "start": 2547.94, "end": 2552.94, "text": "Sag mal, wo sind denn die Gegner? Wo sind denn die Gegner alle?"}, {"id": 314, "start": 2552.94, "end": 2560.94, "text": "Sind die irgendwie gequittet oder so?"}, {"id": 315, "start": 2560.94, "end": 2563.94, "text": "Gegner?"}, {"id": 316, "start": 2563.94, "end": 2567.94, "text": "Alter, die Quali sieht wirklich räudig aus."}, {"id": 317, "start": 2567.94, "end": 2572.94, "text": "Ich weiß, was wir machen. Ich weiß, was wir machen nächste Runde."}, {"id": 318, "start": 2572.94, "end": 2589.94, "text": "Alter, ist ja gut."}, {"id": 319, "start": 2589.94, "end": 2600.94, "text": "Ich check null, wo Gegner sind."}, {"id": 320, "start": 2600.94, "end": 2610.94, "text": "Ich weiß, wie man OBS konfiguriert."}, {"id": 321, "start": 2610.94, "end": 2612.94, "text": "Aber Bitrate hochstellen alleine bringt ja nichts."}, {"id": 322, "start": 2612.94, "end": 2623.94, "text": "Ich hab ja nur begrenzt Upload und ich muss dabei ja noch spielen."}, {"id": 323, "start": 2623.94, "end": 2632.94, "text": "Oh, klar. Wir müssen mal gucken, Clay. Ich guck nach der Runde."}, {"id": 324, "start": 2632.94, "end": 2657.94, "text": "Ich weiß, was wir machen. Wir stellen die Auflösung einfach ein bisschen runter."}, {"id": 325, "start": 2657.94, "end": 2666.94, "text": "Wir stellen die Auflösung runter, Leute. Von hinten, das ist typische Call of Duty Mist."}, {"id": 326, "start": 2666.94, "end": 2674.94, "text": "Warum wird eigentlich die Death angezeigt in Domination?"}, {"id": 327, "start": 2674.94, "end": 2676.94, "text": "Oh, fuck."}, {"id": 328, "start": 2676.94, "end": 2686.94, "text": "Ah, veraimt. Warum wird die in Domination angezeigt, die Death, aber in TDM werden Tode nicht angezeigt?"}, {"id": 329, "start": 2686.94, "end": 2691.94, "text": "Cella vollbilden? Nee, was soll das damit zu tun haben?"}, {"id": 330, "start": 2691.94, "end": 2697.94, "text": "Was soll das damit zu tun haben, ob das im Vollbild ist oder nicht? Bei mir sieht es auch gut aus."}, {"id": 331, "start": 2697.94, "end": 2722.94, "text": "Das liegt an der Bitrate."}, {"id": 332, "start": 2722.94, "end": 2730.94, "text": "Krass, leidet er sich einen ab. Geile Schleider."}, {"id": 333, "start": 2730.94, "end": 2738.94, "text": "Oh nein, fuck noch einer."}, {"id": 334, "start": 2738.94, "end": 2757.94, "text": "Ich guck nach der Runde. Ich glaube, ich mache einfach die Auflösung runter, dann ist das kein Problem."}, {"id": 335, "start": 2757.94, "end": 2768.94, "text": "Ja, ist so klar."}, {"id": 336, "start": 2768.94, "end": 2773.94, "text": "Autsch, hat aber reingehauen. Das ist übrigens übelst OP, das Spot hier."}, {"id": 337, "start": 2773.94, "end": 2787.94, "text": "Mega Head-Clitch-Spot."}, {"id": 338, "start": 2787.94, "end": 2803.94, "text": "Vielleicht soll ich mal hier meinen komischen Linksbombs-Strike starten. Der killt übrigens nichts, dieser Strike, der ist übelst..."}, {"id": 339, "start": 2803.94, "end": 2807.94, "text": "Fuck, übelst freudig."}, {"id": 340, "start": 2807.94, "end": 2821.94, "text": "Der hat was gekillt, hätte ich nie gedacht."}, {"id": 341, "start": 2821.94, "end": 2841.94, "text": "Okay, du, wo kommt der her? Ernsthaft?"}, {"id": 342, "start": 2841.94, "end": 2857.94, "text": "Fuck, next level strats, ja."}, {"id": 343, "start": 2857.94, "end": 2861.94, "text": "Ich starte dann nach neun minitrigeren Auflösungen, dann sieht das gut aus."}, {"id": 344, "start": 2861.94, "end": 2871.94, "text": "Wie gesagt, bis mich Junity Media auf 40M mit Upload eingestellt hat, da fuck, wo kommst denn du her?"}, {"id": 345, "start": 2871.94, "end": 2878.94, "text": "Wer campt mich jetzt auch mal? Ach fuck, ich hab hier gar keine Camp-Dings dabei."}, {"id": 346, "start": 2878.94, "end": 2891.94, "text": "Was für ein Fail, den hab ich ja richtig gesehen."}, {"id": 347, "start": 2891.94, "end": 2904.94, "text": "Mist, die Schalte."}, {"id": 348, "start": 2904.94, "end": 2914.94, "text": "Da kommt gleich links einer."}, {"id": 349, "start": 2914.94, "end": 2923.94, "text": "Sag mal, outplayen die mich irgendwie?"}, {"id": 350, "start": 2923.94, "end": 2928.94, "text": "Wo sind die?"}, {"id": 351, "start": 2928.94, "end": 2936.94, "text": "Wo sind hier alle?"}, {"id": 352, "start": 2936.94, "end": 2944.94, "text": "Was könnten für ne gute Auflösung sein? Also warte mal hier, Output."}, {"id": 353, "start": 2944.94, "end": 2962.94, "text": "Rescale, also wir rescalen das mal ein bisschen runter."}, {"id": 354, "start": 2962.94, "end": 2975.94, "text": "Pasta? Gucken wir mal, wir gucken mal, ob das was bringt. Mal schauen, dass das Game ordentlich läuft."}, {"id": 355, "start": 2975.94, "end": 2986.94, "text": "Also ohne Scheiß, Leute, das fühlt sich auf dem PC einfach gleich drei Millionen mal besser an."}, {"id": 356, "start": 2986.94, "end": 2995.94, "text": "Also ich bring sie mal toll finde. Searching for a match. 850 Millisekunden, logisch."}, {"id": 357, "start": 2995.94, "end": 3024.94, "text": "Okay, das Turnwermer on. Shadowplay, ist er recordet, wohin? Dahin. Ich hab ehrlich gesagt, hab ich keine, ich hab kaum noch Speicher. Nee, kein sauber Broser."}, {"id": 358, "start": 3024.94, "end": 3050.94, "text": "Fuck das. Kommt das Spiel für das Spiel für die Switch?"}, {"id": 359, "start": 3050.94, "end": 3064.94, "text": "Nee."}, {"id": 360, "start": 3064.94, "end": 3073.94, "text": "Ist die Quali jetzt ein Ticken besser? Wenn nicht, starte ich wirklich neu."}, {"id": 361, "start": 3073.94, "end": 3081.94, "text": "Nein, nein, nein, okay."}, {"id": 362, "start": 3081.94, "end": 3107.94, "text": "Man da hoch."}, {"id": 363, "start": 3107.94, "end": 3123.94, "text": "Wissen ihr was? Wenn ihr euch mal blicken lassen. Ja, einmal nicht hingeguckt, wie es am Start."}, {"id": 364, "start": 3123.94, "end": 3137.94, "text": "Okay Leute, wisst ihr was? Ich sehs grad in der Vorschau. Das sieht übertrieben scheiße aus. Wartet mal, ich wackel mal."}, {"id": 365, "start": 3137.94, "end": 3150.94, "text": "Ich stell mal runter, ich stells, ich stell mal runter."}, {"id": 366, "start": 3150.94, "end": 3179.94, "text": "So Leute, ich bin gleich wieder am Start."}]}