{"text": "Ja ganz wichtig Leute also ich weiß nicht ob schon jemand da istwenn wir jetzt die Call of Duty Kampagne spielen was absolut unumgänglich ist wo wir überhaupt nichtdrumherum kommen ist, dass ich zu meinem Image Board eine US Flagge adde, weil ohne US Flaggekönnen wir wahrscheinlich keinen Kot spielen, das funktioniert nicht. Da ist wahrscheinlich so vielHeldentum wieder am Start in der Call of Duty Kampagne. Das geht ohne nicht. Das ist ein bisschenschlecht aufgelöst oder? Alles schlecht aufgelöst. Gibt es da keine ordentlichordentlich aufgelösten Flaggen oder wie? Ja das ist ein bisschen viele Sterne oder? Sind dasmittlerweile so viele Sterne? Ich brauche eine transparente US Flagge, da wird es doch gebenhier. Safe, boin, Nicky Turtle. Safe, ganz wichtig für Call of Duty brauchen wir hier die volleKokona Ladung, sonst geht das überhaupt nicht. Perfekt. Ganz wichtig. Eine Runde Kokona und eineRunde US Flagge, das brauchen wir für die Call of Duty Kampagne, anders sagt geht das nicht. Undum uns in die richtige Stimmung zu versetzen, brauchen wir noch eine Runde die passende Musik.Ist Price nicht Engländer? Egal, die Amis werden schon wieder super heldenhaft sein.Das passt erstaunlich gut hier drauf irgendwie.Link zum Song, da. SD 202YXBZP0M.Der Price ist heiß. Das war schlecht, oder? Das war schlecht. Der Price ist heiß,Alter. Warum spielst du die Kampagne zuerst? Weil die Multiplayer Räumen abscheißen sollen.Und weil ich keinen Bock hab, mich gleich aufzuregen über das Game, deswegen spielen wir erst mal die Kampagne.Ich glaube, ich habe den Sound viel zu laut. Die Kampagne ist insofern besser, da reg ich mich nicht auf bei.So, ich würde sagen, jetzt haben wir uns richtig eingestimmt mit der passenden Kokona Musik und der US Flagge am Start.Da kann eigentlich nichts mal schief gehen. Ich würde sagen, wir starten das Ganze mal und da muss ich auf jeden Fall,ich muss auf jeden Fall den Desktop Sound runterdrehen, weil das viel zu laut sein wird.Ich stelle das mal auf minus 40 und wir gucken jetzt mal, wie das ist.Ich hab' vorhin auf meinem anderen Account schon mal das Game gestartet und einfach mal gucken, ob das, ob das funktioniert, ja.So, es lädt.Wow, Alter, ist das, Alter, ist das, ist ja, ist ja, meine Güte, ey, warum machen die die Scheiß-Sound immer so laut?Jetzt ist es schwarz geworden, weil ich Firewall-Settings einstellen muss, Moment.Kann man den Kack überspringen? Nope. Was ist denn der Taskleiste, Web Application 1?Das hier, ich zeig's dir gleich. Das ist das hier, da ich so Bilder, Bilder overlayen kann.Ja, oh, es leckt aber gerade. Lekt, mega.Alter, mein Meme2 leckt, wie Sau, warum leckt das so rum?Es leckt, huge. Huge, leck.Wie leckt denn das so? Legt bestimmt an Kot. Zweifel verlegt es alles an Kot.Achso, das liegt daran, weil wir gerade Installing Shaders to Optimize Performance During Gameplay machen.Ich wusste gar nicht, dass man Shaders installieren muss.Ich dachte immer, Shaders sind Programme, die auf der Grafikkarte laufen.Und um genau zu sein, gibt es, glaube ich, was war das, Pixel-Shader und Vertex-Shader?Das eine sagt, wo der Pixel ist, und das andere sagt, welche Farbe der Pixel hat.Irgendwie so, ich bin mal da. Vortex? Vortex? Nee, Vertex.So mit Low-Level-Grafik-Programmierung bin ich jetzt nicht so...Pro. So, also wir accepten erstmal die Terms of Agreement.Okay. Accept. Campaign. M. Achso, Moment, stop. Options.Die Menü... Das ist wieder so ein Game, ne?Die Menü-Lautstärke ist übelst leise.Aber der Rest ist huge-laut. Okay, schauen wir mal.Also. Der installt eh irgendwelche Shaders, wie man die Shader installieren soll.Oh guck mal, der hat die Settings übernommen von meinem anderen Account, oder?Sehe ich das richtig? Ja! Big Brain, aber muss die Settings nicht nochmal machen.Mal gucken, ob er alles übernommen hat.Ja, der hat alles übernommen. Wahnsinn. Was der alles kann!So, Moment.Alter, wie mein Meme-Tool übelst lutsch rumspackt. Man hat einen Foff-Changer, ja.So Leute, jetzt ist die Frage, vielleicht poste ich das auch mal auf YouTube, dass ich jetzt Modern Warfare-Kampagne streame.Ich meine, das ist ja eine Gelegenheit, die gibt's nicht so oft.Poste ich das mal auf YouTube, während er hier die Shaders installiert? Spackt wegen Anti-Cheat-Tool.Da machen wir USA-Fahne an, dann läuft das Game besser.Erst mal USA-Fahne einblenden. Also ich glaube, wenn das Game Performance-Probleme hat, blenden wir einfach die USA-Fahne ein und dann wird es schon funktionieren.Poste auf YouTube. Ja, ja. YouTube hat doch jetzt mittlerweile so einen Community-Tab, wo man Dinge posten kann.Community? Poste das jetzt mal. So. So.What? Wenn ich auf dem anderen... Moment, wenn ich auf dem anderen Desktop bin, dann greift das Inputs ab.Ist aber mal ziemlich sack, wer weiß, ob ich jetzt was umgestellt hab. Na gut, dann minimieren wir das jetzt, dann geht das hoffentlich.So, Post ist raus.Sieht man aber nur auf Mobile. Nein, die siehst du auch im Browser.Sag mal, kann das sein, dass Modern Warfare übelste Auslastung verursacht?Das Game macht nichts. Das ist einfach nur an.Und da steht der Hauptmenü-Sound, da geht es schon ab. Okay, also auf geht's Leute.Channelt euren inneren Kokona und dann geben wir uns das mal. Moment, der Shader-Installer ist immer noch nicht fertig.Was installiert der Typ da?Ja, ich hab alles gedownloadet, alles installiert. Ich hab mir sogar durchgelesen, was man machen soll, weil das Spiel hat ziemliche Probleme. Man sieht es hier übrigens gerade schon wild rumrockeln.Die Player-Server sind übelst am Arsch, die funktionieren hier richtig, deswegen spielt ihr erstmal Kampagne.Ihr seht es, wie es hier ruckelt. Wenn ihr mal auf Reddit guckt, Modern Warfare, also die PC-Umsetzung soll diesmal wohl, zumindest zum aktuellen Zeitpunkt, ziemlich mies sein.Also das soll Freezes geben, das soll Crashes geben, das soll übelstes Geruckel in Cutscenes geben.Achso, der Main-Menü-Sound ist auch standardmäßig kaputt. Ich hab noch kein Game erlebt, wo der Hauptmenü-Sound kaputt ist, aber Call of Duty hat es geschafft, der Hauptmenü-Sound war kaputt.Die Beta lief tatsächlich besser und was man dazu machen muss, dass der Hauptmenü-Sound, bzw. generell der Sound in-Game richtig funktioniert ist, man muss hier das auf 48kHz stellen, weil, keine Ahnung, habe ich auf Reddit gefunden, hat funktioniert.Gegen das Geruckel, ich hab's auf der SSD installiert, also sprich, ich hab jetzt von meinen 500G SSD 130GB für fucking Modern Warfare drauf und alle Settings gemacht, so wie es auf Reddit empfohlen wird.Oh, das Shader-Install ist fertig. Auf geht's los.So, ihr müsst mir jetzt sagen, wie die Lautstärke ist. Ja, 130GB. Bisschen leise, oder? Ein ticke lauter können wir glaube ich noch machen.Die Musik ist auf 100%, ja, machen wir mal so und hoffen, dass nicht die Ohren wegfliegen. Mature, Erwachsener-Content, das Reifer-Content.Okay, auf geht's. Wir understanden und gucken mal, was uns da so erwartet.Oh, gucke mal. Ich möchte gerne von vorne anfangen. Ja Leute, jetzt die große Preisfrage.Ich würde sagen, wir spielen mal auf Normal. Realism ist klar, ne.Raussteigen.Eine Ehe am Stadion.Welchem Setting spielst du? Nee, Grafik ist alles auf Hoch.Kennt das überhaupt noch jemand?Ohje, es rocke.Okay, mal wieder Massenvernichtungswaffen. Gab's noch nie. Die Russen sind auch am Start. Also wie sich das gehört.Massenvernichtungswaffen, Amis am Start, Russen am Start, da kann er nicht mal schief gehen.Es ist glaube ich ein... Wie ist denn die Lautstärke so? Game, Audio und Ticken leiser, okay. Das ist schwierig, ich sehe das nämlich nicht. Weil das Game geht das Sound aus, wenn ich raus tabbe.Zu laut. Moment, wartet mal. So, jetzt müsste es eigentlich ganz okay sein.Passt, okay. Auf geht's. Erst mal schön Jumpshotten. Übrigens, falls ich Zaps übersehe, seht es mir nach. Ich gucke danach gleich, wer alles zappt.Ich lende mir das gleich mal ein, dass ich das nicht vergesse.So, perfekt. Auf geht's. Übrigens, man kann wahnsinnig schnell laufen hier.Laschen. Hier wird nicht lange gefackelt.Also für mich ist der In-Game Sound ein bisschen leise, aber ich weiß warum das bei euch so laut ist, wartet mal. Passt. Gameplugin ist aus.Okay. Also meckert rum, falls es zu laut oder zu leise ist, ne?Basht. Leute, ich wette mit euch, wenn ich den jetzt, wenn ich den jetzt bashe, dann ist die Mission zu Ende.Passt mal auf, das probieren wir jetzt mal kurz. Ah, null. Guck euch das mal an.Kein Gewirr. Ich darf die nicht bashen. Die waren schon down, bevor das eingeschlagen ist. Das hat wieder grandios gescriptet.Eins muss man aber, wir taken das von hier, eins muss man ihn hier lassen. Das sieht tatsächlich dieses Mal grafisch echt ganz hübsch aus.Muss man ihn lassen, ja.War ich eigentlich hell genug? Ich meine, es ist Nacht, aber man sollte was sehen.Nee, das ist nicht RTX On.Wir bashen gleich alles. Es wird alles On-Side gebasht.Oh guck mal, habt ihr gehört, die reagieren sogar drauf. Die haben gesagt, ich bin nicht patient, weil ich gleich instant alles weggebasht habe.Was nehmen wir denn hier mal mit? Pistole, wir brauchen eine Pistole. Wir brauchen eine AK-12 mit Grenadelauncher, also ist das perfekt.Hopp hopp. Nicht so langsam, ihr seid krasse Elite Soldiers. Es geht nicht so flüssig. Es müsste ziemlich flüssig sein eigentlich. 60 FPS Stream, 95 FPS In-Game, da ist eigentlich nichts mit unflüssig.Ich sehe es in meiner Vorschau, da ist keine Slideshow. Der Chechi baitet. Der Chechi baitet mich.Erstmal eine komplette Base weggebombt. Es sieht unflüssig aus. Warum sieht das so unflüssig aus?Warte mal, Moment, Moment. Nicht, dass Junotimedia rumspackt. Dropped Frames, Null.Stream läuft auf 60 und Game läuft auf 90. Oder guck mal, wie viel FPS ist in der Stream? 1080p, 60 FPS. Da gibt es nichts. Ich gucke mir das jetzt mal bei mir in der Vorschau an, aber da ist eigentlich nichts.Vielleicht ist euer Rechner zu langsam.Übersprungene Frames auf Twitch. Ist Twitch am Spacken? Ist vielleicht Twitch am Spacken und nicht bei mir? Weil, wie gesagt, bei mir ist nichts. Ich habe null übersprungene Frames.Die hatten doch hier irgendwie so eine Statistik, oder? Hier Stats. Was ist das?Was ist das? Ich habe so mit den schnellsten Rechnern, die man aktuell haben kann. Das kann nicht sein, dass das hier rumspackt.Das muss an Twitch liegen. Aber render lag? Was soll da laggen? Was macht Modern Warfare mit meinem PC? OBS braucht 8%?Warte mal.Geforce Experience auf und irgendwie Shadowplay und ganzes Gedöns ausmachen?Oh Gott. Nvidia, bitte. Ich meine, das Spiel ist standby. Wie kann das jetzt rumspacken?Okay, wartet mal. Das geht mir schon wieder mega auf den Keks. Warum ist das immer nur bei Kotze?Aber das kann doch nicht sein. Ich mache jetzt mal Modern Warfare aus.Was hat das mit Modern Warfare zu tun?WTF? Was ist das schon wieder für ein Crap?Hatten wir nicht sogar in der Beta auch so komische Async Sound Probleme?Wisst ihr noch? Oder war das alles, was ich von der Konsole gestreamt habe? Vielleicht OBS und COD unterschiedliche Kerne zuweisen. Das ist eigentlich total legal, weil das der Windows-Scheduler macht im Hintergrund.Na ja, ich habe verstanden. Leute, wie kann man... Ich zoome.Aktuell ist alles in Ordnung. Was jetzt?Ey, das ist ja schon wieder der Wahnsinn. Dieses rumgefregelbare Cod. Wie kann man das hier mal in... Wir stellen das in Fullscreen Borderless.Was geht mit Cod schon wieder ab? Was ist das? Was ist das hier?Mein Rechner ist null ausgelastet, Cod. Der macht nichts. Der ist zu 50% Eidl.Okay Leute, wir gucken jetzt mal, wie es ist. Es packt, oder?Das ist echt Holzprogrammierung. Sagt mir mal, ob es jetzt okay ist. Wenn es nicht okay ist, also wenn es wirklich ruckelt und Frames droppt, dann müssen wir mal gucken. Dann nehmen wir den Nvidia-Encoder.Jetzt sollen wir mounten. Alles basten.Okay, jetzt ist es okay. Jetzt ist es okay. Okay, schauen wir mal. Man mag es wohl programmieren. Der Chat ist heute aber nicht Q-Chat.Droppt Frames? Wirklich? Was hatten wir noch in der Beta schon mal dieses Geschiss, ey?Droppt? Okay.Das droppt Frames. Das droppt Frames.Ich habe keine Ahnung, warum das Frames droppt. Okay Leute, wir machen das jetzt so. Bevor wir jetzt hier lange rumfangeln. Ich stelle meinen Rendern einfach um.Ich mache kurz Stream aus, bin in zwei Minuten wieder da. Ich stelle um auf Nvidia-Renderer. Vielleicht geht das besser.Ich bin in zwei Minuten wieder da. In zwei Minuten könnte er F5 drücken.", "segments": [{"id": 1, "start": 0.0, "end": 29.4, "text": "Ja ganz wichtig Leute also ich weiß nicht ob schon jemand da ist"}, {"id": 2, "start": 29.4, "end": 35.68, "text": "wenn wir jetzt die Call of Duty Kampagne spielen was absolut unumgänglich ist wo wir überhaupt nicht"}, {"id": 3, "start": 35.68, "end": 43.6, "text": "drumherum kommen ist, dass ich zu meinem Image Board eine US Flagge adde, weil ohne US Flagge"}, {"id": 4, "start": 43.6, "end": 51.48, "text": "können wir wahrscheinlich keinen Kot spielen, das funktioniert nicht. Da ist wahrscheinlich so viel"}, {"id": 5, "start": 51.48, "end": 61.08, "text": "Heldentum wieder am Start in der Call of Duty Kampagne. Das geht ohne nicht. Das ist ein bisschen"}, {"id": 6, "start": 61.08, "end": 70.68, "text": "schlecht aufgelöst oder? Alles schlecht aufgelöst. Gibt es da keine ordentlich"}, {"id": 7, "start": 70.68, "end": 82.36, "text": "ordentlich aufgelösten Flaggen oder wie? Ja das ist ein bisschen viele Sterne oder? Sind das"}, {"id": 8, "start": 82.36, "end": 89.8, "text": "mittlerweile so viele Sterne? Ich brauche eine transparente US Flagge, da wird es doch geben"}, {"id": 9, "start": 89.8, "end": 101.52, "text": "hier. Safe, boin, Nicky Turtle. Safe, ganz wichtig für Call of Duty brauchen wir hier die volle"}, {"id": 10, "start": 101.52, "end": 116.28, "text": "Kokona Ladung, sonst geht das überhaupt nicht. Perfekt. Ganz wichtig. Eine Runde Kokona und eine"}, {"id": 11, "start": 116.28, "end": 121.0, "text": "Runde US Flagge, das brauchen wir für die Call of Duty Kampagne, anders sagt geht das nicht. Und"}, {"id": 12, "start": 121.0, "end": 147.4, "text": "um uns in die richtige Stimmung zu versetzen, brauchen wir noch eine Runde die passende Musik."}, {"id": 13, "start": 147.4, "end": 152.68, "text": "Ist Price nicht Engländer? Egal, die Amis werden schon wieder super heldenhaft sein."}, {"id": 14, "start": 152.68, "end": 171.44, "text": "Das passt erstaunlich gut hier drauf irgendwie."}, {"id": 15, "start": 182.68, "end": 190.92, "text": "Link zum Song, da. SD 202YXBZP0M."}, {"id": 16, "start": 212.68, "end": 237.48, "text": "Der Price ist heiß. Das war schlecht, oder? Das war schlecht. Der Price ist heiß,"}, {"id": 17, "start": 237.48, "end": 247.56, "text": "Alter. Warum spielst du die Kampagne zuerst? Weil die Multiplayer Räumen abscheißen sollen."}, {"id": 18, "start": 247.56, "end": 270.36, "text": "Und weil ich keinen Bock hab, mich gleich aufzuregen über das Game, deswegen spielen wir erst mal die Kampagne."}, {"id": 19, "start": 270.36, "end": 279.64, "text": "Ich glaube, ich habe den Sound viel zu laut. Die Kampagne ist insofern besser, da reg ich mich nicht auf bei."}, {"id": 20, "start": 279.64, "end": 295.0, "text": "So, ich würde sagen, jetzt haben wir uns richtig eingestimmt mit der passenden Kokona Musik und der US Flagge am Start."}, {"id": 21, "start": 295.0, "end": 299.8, "text": "Da kann eigentlich nichts mal schief gehen. Ich würde sagen, wir starten das Ganze mal und da muss ich auf jeden Fall,"}, {"id": 22, "start": 299.8, "end": 303.8, "text": "ich muss auf jeden Fall den Desktop Sound runterdrehen, weil das viel zu laut sein wird."}, {"id": 23, "start": 303.8, "end": 306.36, "text": "Ich stelle das mal auf minus 40 und wir gucken jetzt mal, wie das ist."}, {"id": 24, "start": 306.36, "end": 314.44, "text": "Ich hab' vorhin auf meinem anderen Account schon mal das Game gestartet und einfach mal gucken, ob das, ob das funktioniert, ja."}, {"id": 25, "start": 314.44, "end": 323.4, "text": "So, es lädt."}, {"id": 26, "start": 323.4, "end": 332.04, "text": "Wow, Alter, ist das, Alter, ist das, ist ja, ist ja, meine Güte, ey, warum machen die die Scheiß-Sound immer so laut?"}, {"id": 27, "start": 332.04, "end": 337.88, "text": "Jetzt ist es schwarz geworden, weil ich Firewall-Settings einstellen muss, Moment."}, {"id": 28, "start": 337.88, "end": 346.28, "text": "Kann man den Kack überspringen? Nope. Was ist denn der Taskleiste, Web Application 1?"}, {"id": 29, "start": 346.28, "end": 353.32, "text": "Das hier, ich zeig's dir gleich. Das ist das hier, da ich so Bilder, Bilder overlayen kann."}, {"id": 30, "start": 353.32, "end": 359.32, "text": "Ja, oh, es leckt aber gerade. Lekt, mega."}, {"id": 31, "start": 359.32, "end": 365.32, "text": "Alter, mein Meme2 leckt, wie Sau, warum leckt das so rum?"}, {"id": 32, "start": 365.32, "end": 373.32, "text": "Es leckt, huge. Huge, leck."}, {"id": 33, "start": 373.32, "end": 381.32, "text": "Wie leckt denn das so? Legt bestimmt an Kot. Zweifel verlegt es alles an Kot."}, {"id": 34, "start": 381.32, "end": 387.32, "text": "Achso, das liegt daran, weil wir gerade Installing Shaders to Optimize Performance During Gameplay machen."}, {"id": 35, "start": 387.32, "end": 391.32, "text": "Ich wusste gar nicht, dass man Shaders installieren muss."}, {"id": 36, "start": 391.32, "end": 401.32, "text": "Ich dachte immer, Shaders sind Programme, die auf der Grafikkarte laufen."}, {"id": 37, "start": 401.32, "end": 407.32, "text": "Und um genau zu sein, gibt es, glaube ich, was war das, Pixel-Shader und Vertex-Shader?"}, {"id": 38, "start": 407.32, "end": 413.32, "text": "Das eine sagt, wo der Pixel ist, und das andere sagt, welche Farbe der Pixel hat."}, {"id": 39, "start": 413.32, "end": 419.32, "text": "Irgendwie so, ich bin mal da. Vortex? Vortex? Nee, Vertex."}, {"id": 40, "start": 419.32, "end": 423.32, "text": "So mit Low-Level-Grafik-Programmierung bin ich jetzt nicht so..."}, {"id": 41, "start": 423.32, "end": 431.32, "text": "Pro. So, also wir accepten erstmal die Terms of Agreement."}, {"id": 42, "start": 431.32, "end": 439.32, "text": "Okay. Accept. Campaign. M. Achso, Moment, stop. Options."}, {"id": 43, "start": 439.32, "end": 443.32, "text": "Die Menü... Das ist wieder so ein Game, ne?"}, {"id": 44, "start": 443.32, "end": 451.32, "text": "Die Menü-Lautstärke ist übelst leise."}, {"id": 45, "start": 451.32, "end": 461.32, "text": "Aber der Rest ist huge-laut. Okay, schauen wir mal."}, {"id": 46, "start": 461.32, "end": 473.32, "text": "Also. Der installt eh irgendwelche Shaders, wie man die Shader installieren soll."}, {"id": 47, "start": 473.32, "end": 477.32, "text": "Oh guck mal, der hat die Settings übernommen von meinem anderen Account, oder?"}, {"id": 48, "start": 477.32, "end": 483.32, "text": "Sehe ich das richtig? Ja! Big Brain, aber muss die Settings nicht nochmal machen."}, {"id": 49, "start": 483.32, "end": 489.32, "text": "Mal gucken, ob er alles übernommen hat."}, {"id": 50, "start": 489.32, "end": 505.32, "text": "Ja, der hat alles übernommen. Wahnsinn. Was der alles kann!"}, {"id": 51, "start": 505.32, "end": 511.32, "text": "So, Moment."}, {"id": 52, "start": 511.32, "end": 519.32, "text": "Alter, wie mein Meme-Tool übelst lutsch rumspackt. Man hat einen Foff-Changer, ja."}, {"id": 53, "start": 519.32, "end": 526.32, "text": "So Leute, jetzt ist die Frage, vielleicht poste ich das auch mal auf YouTube, dass ich jetzt Modern Warfare-Kampagne streame."}, {"id": 54, "start": 526.32, "end": 531.32, "text": "Ich meine, das ist ja eine Gelegenheit, die gibt's nicht so oft."}, {"id": 55, "start": 531.32, "end": 543.32, "text": "Poste ich das mal auf YouTube, während er hier die Shaders installiert? Spackt wegen Anti-Cheat-Tool."}, {"id": 56, "start": 543.32, "end": 549.32, "text": "Da machen wir USA-Fahne an, dann läuft das Game besser."}, {"id": 57, "start": 549.32, "end": 557.32, "text": "Erst mal USA-Fahne einblenden. Also ich glaube, wenn das Game Performance-Probleme hat, blenden wir einfach die USA-Fahne ein und dann wird es schon funktionieren."}, {"id": 58, "start": 557.32, "end": 570.32, "text": "Poste auf YouTube. Ja, ja. YouTube hat doch jetzt mittlerweile so einen Community-Tab, wo man Dinge posten kann."}, {"id": 59, "start": 570.32, "end": 580.32, "text": "Community? Poste das jetzt mal. So. So."}, {"id": 60, "start": 580.32, "end": 589.32, "text": "What? Wenn ich auf dem anderen... Moment, wenn ich auf dem anderen Desktop bin, dann greift das Inputs ab."}, {"id": 61, "start": 589.32, "end": 618.32, "text": "Ist aber mal ziemlich sack, wer weiß, ob ich jetzt was umgestellt hab. Na gut, dann minimieren wir das jetzt, dann geht das hoffentlich."}, {"id": 62, "start": 618.32, "end": 640.32, "text": "So, Post ist raus."}, {"id": 63, "start": 640.32, "end": 650.32, "text": "Sieht man aber nur auf Mobile. Nein, die siehst du auch im Browser."}, {"id": 64, "start": 650.32, "end": 658.32, "text": "Sag mal, kann das sein, dass Modern Warfare übelste Auslastung verursacht?"}, {"id": 65, "start": 658.32, "end": 670.32, "text": "Das Game macht nichts. Das ist einfach nur an."}, {"id": 66, "start": 670.32, "end": 677.32, "text": "Und da steht der Hauptmenü-Sound, da geht es schon ab. Okay, also auf geht's Leute."}, {"id": 67, "start": 677.32, "end": 686.32, "text": "Channelt euren inneren Kokona und dann geben wir uns das mal. Moment, der Shader-Installer ist immer noch nicht fertig."}, {"id": 68, "start": 686.32, "end": 693.32, "text": "Was installiert der Typ da?"}, {"id": 69, "start": 693.32, "end": 717.32, "text": "Ja, ich hab alles gedownloadet, alles installiert. Ich hab mir sogar durchgelesen, was man machen soll, weil das Spiel hat ziemliche Probleme. Man sieht es hier übrigens gerade schon wild rumrockeln."}, {"id": 70, "start": 717.32, "end": 723.32, "text": "Die Player-Server sind übelst am Arsch, die funktionieren hier richtig, deswegen spielt ihr erstmal Kampagne."}, {"id": 71, "start": 723.32, "end": 733.32, "text": "Ihr seht es, wie es hier ruckelt. Wenn ihr mal auf Reddit guckt, Modern Warfare, also die PC-Umsetzung soll diesmal wohl, zumindest zum aktuellen Zeitpunkt, ziemlich mies sein."}, {"id": 72, "start": 733.32, "end": 739.32, "text": "Also das soll Freezes geben, das soll Crashes geben, das soll übelstes Geruckel in Cutscenes geben."}, {"id": 73, "start": 739.32, "end": 752.32, "text": "Achso, der Main-Menü-Sound ist auch standardmäßig kaputt. Ich hab noch kein Game erlebt, wo der Hauptmenü-Sound kaputt ist, aber Call of Duty hat es geschafft, der Hauptmenü-Sound war kaputt."}, {"id": 74, "start": 752.32, "end": 769.32, "text": "Die Beta lief tatsächlich besser und was man dazu machen muss, dass der Hauptmenü-Sound, bzw. generell der Sound in-Game richtig funktioniert ist, man muss hier das auf 48kHz stellen, weil, keine Ahnung, habe ich auf Reddit gefunden, hat funktioniert."}, {"id": 75, "start": 769.32, "end": 783.32, "text": "Gegen das Geruckel, ich hab's auf der SSD installiert, also sprich, ich hab jetzt von meinen 500G SSD 130GB für fucking Modern Warfare drauf und alle Settings gemacht, so wie es auf Reddit empfohlen wird."}, {"id": 76, "start": 783.32, "end": 786.32, "text": "Oh, das Shader-Install ist fertig. Auf geht's los."}, {"id": 77, "start": 786.32, "end": 802.32, "text": "So, ihr müsst mir jetzt sagen, wie die Lautstärke ist. Ja, 130GB. Bisschen leise, oder? Ein ticke lauter können wir glaube ich noch machen."}, {"id": 78, "start": 802.32, "end": 820.32, "text": "Die Musik ist auf 100%, ja, machen wir mal so und hoffen, dass nicht die Ohren wegfliegen. Mature, Erwachsener-Content, das Reifer-Content."}, {"id": 79, "start": 820.32, "end": 832.32, "text": "Okay, auf geht's. Wir understanden und gucken mal, was uns da so erwartet."}, {"id": 80, "start": 832.32, "end": 849.32, "text": "Oh, gucke mal. Ich möchte gerne von vorne anfangen. Ja Leute, jetzt die große Preisfrage."}, {"id": 81, "start": 849.32, "end": 860.32, "text": "Ich würde sagen, wir spielen mal auf Normal. Realism ist klar, ne."}, {"id": 82, "start": 860.32, "end": 867.32, "text": "Raussteigen."}, {"id": 83, "start": 867.32, "end": 872.32, "text": "Eine Ehe am Stadion."}, {"id": 84, "start": 898.32, "end": 905.32, "text": "Welchem Setting spielst du? Nee, Grafik ist alles auf Hoch."}, {"id": 85, "start": 913.32, "end": 918.32, "text": "Kennt das überhaupt noch jemand?"}, {"id": 86, "start": 918.32, "end": 928.32, "text": "Ohje, es rocke."}, {"id": 87, "start": 948.32, "end": 963.32, "text": "Okay, mal wieder Massenvernichtungswaffen. Gab's noch nie. Die Russen sind auch am Start. Also wie sich das gehört."}, {"id": 88, "start": 963.32, "end": 978.32, "text": "Massenvernichtungswaffen, Amis am Start, Russen am Start, da kann er nicht mal schief gehen."}, {"id": 89, "start": 978.32, "end": 997.32, "text": "Es ist glaube ich ein... Wie ist denn die Lautstärke so? Game, Audio und Ticken leiser, okay. Das ist schwierig, ich sehe das nämlich nicht. Weil das Game geht das Sound aus, wenn ich raus tabbe."}, {"id": 90, "start": 997.32, "end": 1012.32, "text": "Zu laut. Moment, wartet mal. So, jetzt müsste es eigentlich ganz okay sein."}, {"id": 91, "start": 1012.32, "end": 1031.32, "text": "Passt, okay. Auf geht's. Erst mal schön Jumpshotten. Übrigens, falls ich Zaps übersehe, seht es mir nach. Ich gucke danach gleich, wer alles zappt."}, {"id": 92, "start": 1031.32, "end": 1043.32, "text": "Ich lende mir das gleich mal ein, dass ich das nicht vergesse."}, {"id": 93, "start": 1043.32, "end": 1053.32, "text": "So, perfekt. Auf geht's. Übrigens, man kann wahnsinnig schnell laufen hier."}, {"id": 94, "start": 1053.32, "end": 1068.32, "text": "Laschen. Hier wird nicht lange gefackelt."}, {"id": 95, "start": 1068.32, "end": 1083.32, "text": "Also für mich ist der In-Game Sound ein bisschen leise, aber ich weiß warum das bei euch so laut ist, wartet mal. Passt. Gameplugin ist aus."}, {"id": 96, "start": 1083.32, "end": 1099.32, "text": "Okay. Also meckert rum, falls es zu laut oder zu leise ist, ne?"}, {"id": 97, "start": 1099.32, "end": 1123.32, "text": "Basht. Leute, ich wette mit euch, wenn ich den jetzt, wenn ich den jetzt bashe, dann ist die Mission zu Ende."}, {"id": 98, "start": 1123.32, "end": 1132.32, "text": "Passt mal auf, das probieren wir jetzt mal kurz. Ah, null. Guck euch das mal an."}, {"id": 99, "start": 1132.32, "end": 1156.32, "text": "Kein Gewirr. Ich darf die nicht bashen. Die waren schon down, bevor das eingeschlagen ist. Das hat wieder grandios gescriptet."}, {"id": 100, "start": 1156.32, "end": 1169.32, "text": "Eins muss man aber, wir taken das von hier, eins muss man ihn hier lassen. Das sieht tatsächlich dieses Mal grafisch echt ganz hübsch aus."}, {"id": 101, "start": 1169.32, "end": 1179.32, "text": "Muss man ihn lassen, ja."}, {"id": 102, "start": 1179.32, "end": 1188.32, "text": "War ich eigentlich hell genug? Ich meine, es ist Nacht, aber man sollte was sehen."}, {"id": 103, "start": 1188.32, "end": 1196.32, "text": "Nee, das ist nicht RTX On."}, {"id": 104, "start": 1196.32, "end": 1203.32, "text": "Wir bashen gleich alles. Es wird alles On-Side gebasht."}, {"id": 105, "start": 1203.32, "end": 1212.32, "text": "Oh guck mal, habt ihr gehört, die reagieren sogar drauf. Die haben gesagt, ich bin nicht patient, weil ich gleich instant alles weggebasht habe."}, {"id": 106, "start": 1212.32, "end": 1220.32, "text": "Was nehmen wir denn hier mal mit? Pistole, wir brauchen eine Pistole. Wir brauchen eine AK-12 mit Grenadelauncher, also ist das perfekt."}, {"id": 107, "start": 1220.32, "end": 1237.32, "text": "Hopp hopp. Nicht so langsam, ihr seid krasse Elite Soldiers. Es geht nicht so flüssig. Es müsste ziemlich flüssig sein eigentlich. 60 FPS Stream, 95 FPS In-Game, da ist eigentlich nichts mit unflüssig."}, {"id": 108, "start": 1237.32, "end": 1251.32, "text": "Ich sehe es in meiner Vorschau, da ist keine Slideshow. Der Chechi baitet. Der Chechi baitet mich."}, {"id": 109, "start": 1251.32, "end": 1271.32, "text": "Erstmal eine komplette Base weggebombt. Es sieht unflüssig aus. Warum sieht das so unflüssig aus?"}, {"id": 110, "start": 1271.32, "end": 1285.32, "text": "Warte mal, Moment, Moment. Nicht, dass Junotimedia rumspackt. Dropped Frames, Null."}, {"id": 111, "start": 1285.32, "end": 1305.32, "text": "Stream läuft auf 60 und Game läuft auf 90. Oder guck mal, wie viel FPS ist in der Stream? 1080p, 60 FPS. Da gibt es nichts. Ich gucke mir das jetzt mal bei mir in der Vorschau an, aber da ist eigentlich nichts."}, {"id": 112, "start": 1305.32, "end": 1318.32, "text": "Vielleicht ist euer Rechner zu langsam."}, {"id": 113, "start": 1318.32, "end": 1336.32, "text": "Übersprungene Frames auf Twitch. Ist Twitch am Spacken? Ist vielleicht Twitch am Spacken und nicht bei mir? Weil, wie gesagt, bei mir ist nichts. Ich habe null übersprungene Frames."}, {"id": 114, "start": 1336.32, "end": 1361.32, "text": "Die hatten doch hier irgendwie so eine Statistik, oder? Hier Stats. Was ist das?"}, {"id": 115, "start": 1361.32, "end": 1369.32, "text": "Was ist das? Ich habe so mit den schnellsten Rechnern, die man aktuell haben kann. Das kann nicht sein, dass das hier rumspackt."}, {"id": 116, "start": 1369.32, "end": 1391.32, "text": "Das muss an Twitch liegen. Aber render lag? Was soll da laggen? Was macht Modern Warfare mit meinem PC? OBS braucht 8%?"}, {"id": 117, "start": 1391.32, "end": 1401.32, "text": "Warte mal."}, {"id": 118, "start": 1401.32, "end": 1407.32, "text": "Geforce Experience auf und irgendwie Shadowplay und ganzes Gedöns ausmachen?"}, {"id": 119, "start": 1407.32, "end": 1421.32, "text": "Oh Gott. Nvidia, bitte. Ich meine, das Spiel ist standby. Wie kann das jetzt rumspacken?"}, {"id": 120, "start": 1421.32, "end": 1438.32, "text": "Okay, wartet mal. Das geht mir schon wieder mega auf den Keks. Warum ist das immer nur bei Kotze?"}, {"id": 121, "start": 1438.32, "end": 1457.32, "text": "Aber das kann doch nicht sein. Ich mache jetzt mal Modern Warfare aus."}, {"id": 122, "start": 1457.32, "end": 1467.32, "text": "Was hat das mit Modern Warfare zu tun?"}, {"id": 123, "start": 1467.32, "end": 1476.32, "text": "WTF? Was ist das schon wieder für ein Crap?"}, {"id": 124, "start": 1476.32, "end": 1487.32, "text": "Hatten wir nicht sogar in der Beta auch so komische Async Sound Probleme?"}, {"id": 125, "start": 1487.32, "end": 1507.32, "text": "Wisst ihr noch? Oder war das alles, was ich von der Konsole gestreamt habe? Vielleicht OBS und COD unterschiedliche Kerne zuweisen. Das ist eigentlich total legal, weil das der Windows-Scheduler macht im Hintergrund."}, {"id": 126, "start": 1507.32, "end": 1522.32, "text": "Na ja, ich habe verstanden. Leute, wie kann man... Ich zoome."}, {"id": 127, "start": 1522.32, "end": 1538.32, "text": "Aktuell ist alles in Ordnung. Was jetzt?"}, {"id": 128, "start": 1538.32, "end": 1554.32, "text": "Ey, das ist ja schon wieder der Wahnsinn. Dieses rumgefregelbare Cod. Wie kann man das hier mal in... Wir stellen das in Fullscreen Borderless."}, {"id": 129, "start": 1554.32, "end": 1569.32, "text": "Was geht mit Cod schon wieder ab? Was ist das? Was ist das hier?"}, {"id": 130, "start": 1569.32, "end": 1591.32, "text": "Mein Rechner ist null ausgelastet, Cod. Der macht nichts. Der ist zu 50% Eidl."}, {"id": 131, "start": 1591.32, "end": 1604.32, "text": "Okay Leute, wir gucken jetzt mal, wie es ist. Es packt, oder?"}, {"id": 132, "start": 1604.32, "end": 1625.32, "text": "Das ist echt Holzprogrammierung. Sagt mir mal, ob es jetzt okay ist. Wenn es nicht okay ist, also wenn es wirklich ruckelt und Frames droppt, dann müssen wir mal gucken. Dann nehmen wir den Nvidia-Encoder."}, {"id": 133, "start": 1625.32, "end": 1637.32, "text": "Jetzt sollen wir mounten. Alles basten."}, {"id": 134, "start": 1637.32, "end": 1656.32, "text": "Okay, jetzt ist es okay. Jetzt ist es okay. Okay, schauen wir mal. Man mag es wohl programmieren. Der Chat ist heute aber nicht Q-Chat."}, {"id": 135, "start": 1656.32, "end": 1670.32, "text": "Droppt Frames? Wirklich? Was hatten wir noch in der Beta schon mal dieses Geschiss, ey?"}, {"id": 136, "start": 1670.32, "end": 1678.32, "text": "Droppt? Okay."}, {"id": 137, "start": 1678.32, "end": 1693.32, "text": "Das droppt Frames. Das droppt Frames."}, {"id": 138, "start": 1693.32, "end": 1706.32, "text": "Ich habe keine Ahnung, warum das Frames droppt. Okay Leute, wir machen das jetzt so. Bevor wir jetzt hier lange rumfangeln. Ich stelle meinen Rendern einfach um."}, {"id": 139, "start": 1706.32, "end": 1715.32, "text": "Ich mache kurz Stream aus, bin in zwei Minuten wieder da. Ich stelle um auf Nvidia-Renderer. Vielleicht geht das besser."}, {"id": 140, "start": 1715.32, "end": 1744.32, "text": "Ich bin in zwei Minuten wieder da. In zwei Minuten könnte er F5 drücken."}]}