{"text": "So, wieder da? Ja, okay. Ist wieder da. Und die VM geht auch. Ich hab keine Ahnung, wasWindows wieder gedacht hat, was nicht funktioniert. Windows-Logik. Das sind so Sachen. So Problemehast du unter Linux echt nicht. Im Zweifelsfall schießt du unter Linux mal was ab, nutzt dichmal funktionierten, startest, dann gehts wieder. Aber so ist voll der Witz. Wo du dich den ganzenanderen müssen auch starten. Hast du schon Discord gelesen, was ich geschafft habe, Nesebaro?Soll ich da jetzt reingucken und onstream? Das ist das, äh, muss man das der Welt mitteilen?Meinst du? Ja, gut, mach ich gleich auf. Ach im Admin-Channel, im Admin-Channel guckich lieber nicht im Stream rein, wer weiß was da sonst noch so drin steht. Nix Böses,ah, gut, dann gucken wir rein. So, jetzt ist alles gestartet, wunderbar. Kranios. Hatder nur eine Reboot gebraucht? Ach ne, das Pepega-Board fehlt noch. Das ist ja eigentlichdas, was ich starten wollte. Oh man. Darf ich, darf ich mal nen Browser verwenden, irgendwie?Der POG-Chat, den haben wir letztens gefunden. Gut, ähm, das hat jetzt 10 Minuten oder sogedauert, weil Windows der Meinung war, abzuspatten. Dann starten wir das und können jetzt anfangen,aber vorher muss ich noch mal in den Admin-Channel gucken, dass wir uns anschauen können, wasda Sebaro für grandiose neue Errungenschaften, ähm, der Welt mitteilen muss. Ah, auf, startemal. Go, go, go. Der Friseur muss mal mehr streamen, der streamt kaum noch. Auch wenndas Video nicht so mein Game ist, ich guck dem immer gerne zu, wenn er da irgendwie 8Stunden im Kreis grindet. Aber er streamt irgendwie so wenig. Ich hab schon ein Profilzum Runnen, ich brauch kein neues. So, jetzt. Gut. Ja, der Windows Neustart hat mich überein bisschen durcheinander gebracht. Ok, gucken wir mal ins Discord. Also, was gibt's dennda Neues? Übrigens, ähm, wer den Link noch nicht hat, Ausrufezeichen Discord. Gibt'seinen Invite-Link. Yo, Max, lohnt sich ein Upgrade von einer 150 TI auf eine 1660 TI.Also, ich denk mal, dass der schon ordentlich Leistung bringen wird. Ich kenn jetzt keineBenchmarks, können wir gleich mal gucken. E-Mathmen-Channel. Und du meinst, Sebaro,ich kann da reingucken, ohne dass da jetzt was Schlimmes drin steht, ja? Ok. Und jetzt?Du hast LXD-Container eingerichtet. Max, wie machst du noch mal deine VMs in Linux?Das ist LXD. Das benutzt standardmäßig alle Cores. Hä? Kannst du mal kurz mein Profilsein? Nee, kann ich nicht, weil ich nicht eingeloggt bin in Steam hier auf dem, aufdem Account. Ich kann's aber nachher machen, wenn du willst. Du hast viele Benachrichtigungenbeim Discord. Ja, weil ich, äh, ich setz' die nie auf gelesen. Ich lass' die immereinfach laufen. So, ähm, im Prinzip könnte man den ganzen Kram von gestern mal löschen.Ja, dann ein leeres Pipiga-Board haben. Gut. Ja, nice, nice, nice Sebaro. Das, äh, istglaub' ich gar nicht so schwierig da, äh, Multi-Cores drinnen zu verwenden. Ich glaub',es macht sogar standardmäßig schon. So, also, nachdem wir ja gestern nicht zu der Geschichtemit Nextcloud gekommen sind, machen wir das heute. Und das ist auch der Grund, warum ichunbedingt mal ein Linux-VM brauche, weil ohne die Linux-VM funktioniert das Ganze natürlichnicht. Ähm, jetzt muss ich erstmal gucken, ob ich meinen Raspberry schon am Strom dranhab' von gestern noch. Oder nicht. Nein, der hängt hier, der hängt hier neben rum,aber ist nicht am Stromstrand, Stromblub, Strom dran. Muss ich erst mal anschließen.Warum steckt man USB immer falsch rum ein? So, jetzt. Heute geht das Roasten weiter.Wollen wir heute dann zum Schluss noch mal ein paar Stellenanzeigen angucken, ob wirwieder ein bisschen was zum Flamen finden. Da war ja gestern, also ich muss sagen, dieerste Stellenanzeige, die wir gesehen haben, die war echt okay, der Rest war ziemlicherBlödsinn. So, da ist er. Ähm, ich hole mal eine SSD und stöpsel die an den Raspberrydran. Eats SSD Eats Life. Oh nee, der bricht das schlecht um. Ich hole mal kurz eine SSDund stöpsel die an, dass wir das nachher auch ordentlich testen können. Weil, mit derOn-Board im MicroSD-Karte ist für'n Arsch. Da habe ich hier meinen Shima USB 3 auf SATA-Adapter.Für die Testwerke reicht der. Wie willst du was falsch einstecken? Nee, gar nicht.Man hat immer USB falsch rum. Ich hab das immer falsch rum am ersten Versuch. Okay,haben die ne schöne Anleitung dazu? Ähm, also Sebaro, wenn du mit LXC alle Cores auslassenkannst, dann müsstest du direkt auf dem Server auch alle Cores auslassen können. Oder meinstdu, weil du so mehrere Sachen parallel laufen lassen kannst. So, den USB-C-Porn, den USB-C-Porn,da haben sie ja immer was Gescheites gemacht, ja. Den kannst du so rum und so rum einstecken,das ist doch mal was. Bei waagrechten Steckplätzen muss das Loch des Steckers immer raus, kannman sagen, also sind keine waagrechten Steckplätze an meinem Gehäuse und ich guck mir die Steckerimmer nicht an. Es geht fast schneller, einfach immer rumdrehen und meistens ist es ja beiUSB so, erster Versuch passt nicht, zweiter Versuch passt nicht, dritter Versuch, ersterVersuch hätte doch gepasst. Ja, das kannst du machen Sebaro. Du kannst aber einfach aufdem Host mehrere Sachen starten. So, haben die eine offizielle Anleitung für Debian,wie man das installiert, weil die Sache ist die, man braucht bestimmt zig PHP-Abhängigkeitenund da müssen wir erstmal gucken, welche das sind. Macht's überhaupt Bock nur für162, das wäre noch ein bisschen mehr klein. Meistens sind da so, haben wir dann so meistensso 100 bis 150 in dem Dreh. Haben die irgendwie eine ordentliche Anleitung? Nee, haben dienicht, oder? Download Server, ja schön. Gibt es denn vielleicht ein, gibt es schon ein fertigesRaspbian Xcloud Repo? Vielleicht brauchen wir das dann gar nicht, dann macht das dasalles für mich. Criga, hat nichts mit dem Krieger zu tun, glaube ich. Lies sich aberähnlich. Install Engineings, also wir machen das weder mit Redis noch mit MariaDB, wir machendas mit einem SQLite Server zum Testen. Braucht man überhaupt einen externen Web Service,Web Server für Nextcloud, haben die nicht? Irgendso einen Dev Server mit dabei, den manWindows. Gibt es Leute, die betreiben das auf Windows? Sachen gibt's. Machen das wirklichLeute, ja? Install via Snap, das könnten wir tatsächlich machen. Das ist easy as fuckemit Snap zu installieren, aber wenn wir es mit Snap installieren, könnten wir es auchgleich als Docker Package installieren. Example Installation, ich will das irgendwann vonHand draufhauen. Es gibt ein fertiges Steam Account Signing. Ja doch, wie gesagt, ichkann es jetzt hier auf dem Stream nicht machen, aber ich mach das. Am besten ist, ihr schreibtdas irgendwo auf dem Discord. Ich weiß ja nicht genau wo, ob wir da vielleicht mal imDiscord für sowas einen eigenen Channel machen. Also ich kann das schon prinzipiell machen,aber wir müssen es irgendwo speichern. Vielleicht machen wir das im Discord. Vielleicht machenwir im Discord einen eigenen Channel für sowas. Da könnt ihr das rein posten und dann kannich das machen. Warum werden Server denn auf Linux gehostet? Also mal ganz pauschal gesagt,würde ich sagen, zum größten Teil, weil es erstens umsonst ist, zweitens viel mehrAuswahl hat an Server-Anwendungen, die was taugen, weil die Administration remote deutlicheinfacher ist, weil man das besser automatisieren kann, weil es open source ist, was ja auchein gewisser Faktor ist, wenn es um Security-Geschichten geht, und weil so ziemlich jeder 0815 Serviceim Internet auf Linux läuft. Also man hat einfach auch die Leute, die sich damit auskennen.Wenn man Sachen unter Windows hostet, dann macht man das meistens nur, wenn es eineSache ist, die es exklusiv für Windows gibt, oder als halt eine Support-Geschichte ist fürWindows-Clients. Also sprich, wenn man sagt, man hat 50 Windows-Clients und will einenActive Directory haben oder sowas, dann, aber das ist was, da kann es mich nichts zu fragen,weil von Windows habe ich keine Ahnung, und dann nimmt man sich halt auch einen Windows-Serverund macht da AD drauf, weil ich meine, man kann zwar AD auch mit Samba machen, aber ichglaube jemand, der ernsthaft einen AD betreiben will, macht das nicht mit Samba, dann machtdas mit einem Windows-Server. Zumindest würde ich das so machen. Allerdings würde ichkeine AD betreiben und kein Windows-Server, aber es ist was anderes. So, also, Demian-Packages.All you can use that package to install... Ah ja, hier steht es doch, was man braucht.Wir gucken uns lieber die Anleitung von dem Typ an mit Nginx, das wäre lieber. Ich binkein großartiger Apache-Fan. Was macht der denn hier? MariaDB lassen wir weg. Nginx-Configscheint mir ziemlich übertrieben zu sein. Machen wir mal die offizielle Anleitung, wirkönnen das ja immer noch ändern. Wo waren wir gerade? Da. Also Maria, lassen wir weg.Also, das brauchen wir alles. Ohne MariaDB. Ich hoffe die Option, dass man das mit sqlitelaufen lassen kann, gibt es noch. Wie unser Discord in Whitelink, der geht nicht auf denWeep-Channel, der geht auf die Eingangshalle. Oder? Ihr müsstet eigentlich automatischin die Eingangshalle kommen, wenn man automatisch in den Weep-Channel kommt, dann wundert esmich nicht, dass die Leute direkt wieder rausgehen. Oh, aus dem Ball-Roll. Jaja, das musste ändern.Geht auf den Weep-Channel. Geil. Nein, so war das glaub ich nicht gedacht. Ist in xcloud16 eigentlich schon Produkt, ja. Also das ist rausgekommen schon vor 3 Monaten oder so.Das kam sogar schon am 25.04. raus. Jetzt sollte es richtig, ja. Oh, der Created nochDinger im Hintergrund, ok. Wir sollten mal, wir sollten mal die SSD ein File-System draufmachen. Ich gerade angeschlossen, mal gucken, ob der Respirator die erkennt. Wurde der Web-Based-Updaterwieder rausgeholt? Hoffentlich nicht. Nextcloud war schon, oder generell auch damals bei Oncloudwar das immer so ein Acti-Sache zu updaten. Und sie hätten ja die Chance gehabt, malein ordentliches Docker-Image zu machen damals, aber irgendwie hatten sie ein Docker-Image,was man selbst nicht updaten kann, was ja eigentlich so... Was jetzt? Achso, ich glaube,das liegt daran, weil wir schon, weil wir schon Nginx drauf installiert haben. Wir installierenmal kurz. Und dann geht der Apache wahrscheinlich auch. Dann bin ich mal gespannt, was sichda in 3 Versionen alles getan hat. Wie gesagt, ich habe bei mir ja noch 13 drauf. Und dashat mir nicht so gut gefallen. Vor allem, weil der Sync rumgebackt hat oftmals. Ichhatte relativ oft, obwohl mehr als 5 Minuten Zeit waren, wo ich die Dateien abgerufenhabe, habe ich dann irgendwelche Sync-Konflikte gekriegt und sowas. War sehr merkwürdig.Was? Nein. The Game im Discord ist... Ich meine anderes. Das bin ich nicht. Sync-KonflikteBild-Dios? Nee. Sync-Konflikte bei meinen Plain-Text-Notizen hat da rumgespackt, woich mir gedacht habe, das ist so ziemlich der simpelste Fall, den man irgendwie habenkann, Plain-Text-Notiz zu sünden. Da kann es eigentlich keine Probleme geben. Viel einfachergeht es ja nicht. The Poplar ist am Start. Ich finde das interessant, wenn man auf Scienceand Technology stellt, den die Kategorie... Also im Vergleich zu... Im Prinzip gibt esja nur zwei Kategorie, die du machen kannst. Science and Technology oder Just Chatting.Just Chatting hast du viel mehr random Leute, die dem Stream dann so über den Weg laufen.Und im Durchschnitt hast du in Just Chatting auch deutlich mehr Views. Allerdings hat manin Science and Technology hat man zwar weniger Views, allerdings nach einem Stream mehr neueFollower. Das ist interessant, ja. Wahrscheinlich weil in die Kategorie auch Leute gucken,die es interessiert und die andere nur Leute, die mal vorbeikommen und dann ein bisschengucken. Ist nicht... Merkwürdig. Man wird eigentlich davon ausgehen, dass die Kategorie,wo man im Durchschnitt auch die meisten Zuschauer kriegt, dann auch unterm Strich dann das meistegibt, aber anscheinend nicht. Warum gibt es keinen Pokchamp in Dynamis? Das gibt es doch.Es gibt doch eh so ein paar Main Viewer. Ja, es gibt Leute, die sind immer am Start, dasgibt es auch. Oder hatte ich das jetzt schon? Installs, the packages, blablabla. Now downloadArchive Nextcloud Version, go to blablabla, blablabla. Gut, machen wir gleich. Erstmalmüssen wir die Festplatte formatieren, also die SSD. Und wir müssen mal gucken, ob wirden Apache... Wie heißt er unter Debian? Apache? Apache 2? Aha, ok. Schauen wir mal,ob die Webseite prinzipiell funktioniert. It works. Sehr schön. Ok, die Nextcloud machenwir allerdings auf die SSD drauf, weil ich habe jetzt auch keine Lust beim Testen meinerMicro SD Karte Aschen wie kaputt zu machen. Zeig mal, was haben wir denn hier für eineSSD? Da, da ist sie. Ja, DEV SDA. Dann haben wir noch MKFS, AXE. Ach komm, wir machen XFSan. Wow, Raspberry, was ist los? Another Voltage detected. Das sieht es auf jeden Fallnicht so gut. Vielleicht sollte ich den Raspberry mal direkt an die Steckdose, also direkt miteinem Spin-Netzteil an die Steckdose anstöpseln, anstatt es an den Rechner zu hängen. Egal,solange er nicht abkackt, wird das schon verkraften. 100 Grad, wo hast du das jetzt gelesen? VC,53 Grad ist er. Das ist beim Raspberry Pi 4 gar nicht so abwegig, das Ding wird ja heißohne Ende. Wir hatten es ja mal ausprobiert, auf wie viel haben wir es gekriegt? 86 Gradoder so? Ohne Lüfter? Also ohne Kühlkörper und ich glaube, 81 Grad mit Kühlkörper odersowas. Also das Ding ist richtig warm geworden. Huge warm ist das. Massive warm. Ich werdejetzt einmal die Nextcloud-Geschichte hier auspacken und gucken, ob es so prinzipiellfunktioniert. Und dann installieren wir das nochmal neu auf die SSD. Muss ich achte Checkoder brauche eine Check-Summe? Gut, einfach anzippen hier drinnen und gut ist. Zack. Boah,der anzippt sich aber ganz schön ab. Hätte ich doch nicht auf der MicroSD gerade anzippensollen. Es gibt eine fertige Manjaro-Version mit i3, ist das eine andere als deine? Ja,ich habe die minimalen Installationen, die minimalen Netinstall-Versionen und habe denRahmen selbst eingerichtet, ja. Ok, slash, Nextcloud. Ui, was? But why? Haha, jetzt kommentolle Apache-Debug-Geschichten. Habe ich irgendwas vergessen zu machen? Das ist immerso. Beste. Datei-Berechtigung, ja wahrscheinlich. Irgendwie sowas. Irgendwie sowas. Ich denkemal, das muss WWW-Data gehören und nicht root. WWW-Data, wobei ist das auch überhauptunter Raspian so? Wahrscheinlich. Wir gucken mal, als was läuft in der Web-Server. WWW-Data,ok, dann ergibt das Sinn. Ja, ja. Bam. Nochmal. Jetzt gehts wahrscheinlich. Ey. Only my SQLis available. Moment, ich will nicht mal SQL, ich will SQLite. Da muss man wahrscheinlichSQLite Zeug installieren. SQLite. Wie heißt die Pakete, die man da installieren muss?SQLite, PHP, wir suchen einfach mal. SQLite, was gibt es denn da alles? Gibt es eigentlichein Eats-Tool, mit dem man mit ein paar Klicks, ein simple Web-Server, Web-Server. Ich kannes nicht richtig vorlesen, aber ich kann dir die Frage beantworten. Ja, gibt es. Totaleasy. Du kannst einfach sagen. Fuck, ich hab's nicht mehr in der History. Du kannst mitPython mit einer Zeile, kannst den Web-Server starten. Das ist total einfach. Simple HTTP.Genau. Ja, so. Ach so. Also mal angenommen, hier bist du jetzt in dem Ordner drin undwillst einfach alle Dateien zur Verfügung stellen, die... Bin ich jetzt bescheuert?Ach so, ok. Gehst einfach rein, führst das aus und schon hast du einen Web-Server aufPort 80 laufen, auf Port 8000 laufen. Zack, hast du hier alle Dateien. Das ist halt sehrrudimentär und simple, aber für statisches HTML reicht das voll und ganz aus. So, undwie sah die Python 3-Variante aus? Sehr Overflow. Ah ja, ok, die Python 3-Varianteist das hier. Würde ich bevorzugen. Wow. Oder auch nicht. Ach so, der Punkt kommt jadahinter. So. Oder auch nicht. Lassen wir den Punkt einfach mal weg. Ok, so geht's auch.Das ist super einfach und so Sachen gibt's für fast alle Sprachen, die irgendwie dabeisind. Also Rubidrubi kannst du sowas machen, mit PAP kannst du sowas machen, so ein einfachganz... Node kannst du auch einfach in den Server starten. Aber ich finde die Python-Sacheist am einfachsten, weil man kann sich eigentlich ganz gut merken, also wahrscheinlich kannsich das jeder merken außer... Außer ich, dass man einfach sagen muss, minus M-HTTP-Serverund gut ist. Ich mein, viel kürzer und aussagekräftiger kann's eigentlich nicht sein in statischenHTTPS-Server aufzumachen, der in dem Ordner statisches HTML Zeug surft. Ok, SQLite, PAP,was muss ich denn da alles installieren für, was funktioniert? Oh man, bruh. Abinstall,hier, PHP, PHP, SQLite. Wartet mal Leute, hab... Ich hab übelst Mist installiert, warumhab ich denn hart... Siehste, deswegen copy-pastet man keine Tutorials. Warum hab ich PHP 7.2installiert, warum hab ich nicht einfach normal PHP installiert, ohne so eine Versionsangabedabei, ist doch total beknackt. Einfach so, dass das Meta-Package installieren und dannnimmt er halt das, was am aktuellsten ist. Ist der Tutorial klicken, ist nicht immerdas Richtige. Jetzt muss ich auch zur PAP-Version passende MySQL installieren, äh, SQLite installieren.So, und dann reloaden wir und hoffen, dass das Ding gecheckt hat, dass wir auch SQLitehaben. Ne, da muss man wahrscheinlich, vielleicht muss man Apache restarten, dass er das kapiert,oder? Wey! SQLite, jawoll. Also, Username, Admin, Passwort 123456. Also, äh, Massivesecure Passwort. Very weak. Das glaubt ja auch nur der Installer. Ah, hier kann mandas Datadirectory ändern. Das ändern wir mal, wobei das Datadirectory muss wahrscheinlichunterhalb. Das probieren wir mal aus. Das probieren wir jetzt mal aus. Ähm, wir haben,wir haben die SSD, haben wir formatiert, das passt. Wir mounten die jetzt mal. Dev-Sda-Sort.Gucken wir mal rein, er dürfte außer Lost and Found, ah ne, noch nicht mal. Ist ja einXFS. Okay, dann, dann lassen wir das jetzt einfach mal da reinhauen. Wahrscheinlich müssenwir die Berechtigung noch anpassen. Haben wir für Berechtigung. Root, Root, ja, okay,das geht nicht. Dann, dann ändern wir das mal. Wobei, wir machen, wir machen, ey, scheißdrauf. Jetzt zum Ausprobieren. So, slash, MNT, ähm, finish. Dann speicher, dann nehmich meine Sachen, die ich gleich zum Testen mal sünke. Speicher, dann nehm ich wenigstensgleich auf der SSD. Und, dann kriegt meine Micro SD-Karte nicht so viel ab. Was machtder da eigentlich gerade? Dinge macht er. Er macht 100% CPU-Dinge. Dann lassen wir immerDinge machen in der Zwischzeit. Gucken wir mal zu, ne. Aber es bleibt mir nix anderesübrig. Die Musik passt auch voll dazu. Resident-Sleeper-Musik. Brauchen wir eigentlich was anderes. Sweet Jazz.Ohje, das ist, das ist bestimmt Fahrstuhl. Das ist Fahrstuhl. Woop, woop, woop.Overwatch-Summer-Music. Ich kenn bloß noch, ich kenn bloß noch die Overwatch-Weihnachts-Musik.Ohja, genau. Äh, welcher Browser ist das hier? Das ist ganz normal. Chromium, Chromium istes. Ich hab so viele Browser installiert. Den fällt auch nix mal ein, oder? Im Prinzipmachen sie gefühlt seit, seit 3 Jahren. Und wann kamen Overwatch raus? 2017. Den gleichenKram. Wir brauchen Anime-Chills. Selbst die Baro Nu vielleicht. Aber, dass wir das brauchen,habe ich immer eine Zweifel. Okay, es ist anscheinend ist installt. Save form for all your data.Blabla, blabla. Auch guck mal, die haben jetzt einen, die haben jetzt so einen Setup-Guide,wie es aussieht. Okay, das ist im Prinzip blabla. Blabla, blabla. Get Desktop-App. Ja,die Desktop-App installieren wir gleich. Start using Nextcloud. Sehr schön. Äh,die Desktop-App installieren wir jetzt mal. 11 ist es hier, der da. Cute-Keychain. Cute-Chat.Haha, nee, nee.Wobei, das muss ich mir mal angucken. Die Seite sieht gar nicht so schlecht aus. Kenne ichnoch gar nicht hier. Wie funktioniert das? Plug DJ. Select your favorite type of musicin Startlisten. Okay, Metal. Und jetzt? Ach, ach nee, ach so ist das. Man macht da, manmacht quasi einen Chatraum. Man macht quasi so eine Art Chatraum. Und wenn man da jetztMusik reinzieht, hören das alle, die drin sind, oder wie? Das ist eigentlich gar keineschlechte Idee. Allerdings scheint die Plattform nicht so sonderlich besucht zu sein, ne? Hä,ich mach mal da jetzt keinen Account. Aber ich überlege mal das mal. Ich finde, dasist eigentlich eine gute App-Idee. Okay, Nextcloud ist installiert, das war super easy. Eats,das war hier, meint Eats. Und es war, nein, das war's. Okay, es sieht immer noch so auswie eh und je. Und Nextcloud ist langsam von der SD-Karte. Da hätte ich aber auch selbstdrauf kommen können, ehrlich gesagt. Das machen wir jetzt noch mal anders. Ich löschden Scheiß noch mal. Lösch den Kram noch mal und hänge mal meine SSD an die Stelleein, wo Nextcloud gerade ist. Machen wir hier nicht verzeichnen, Nextcloud. Gucken wir,ob das überhaupt dann gescheit funktioniert. Machen wir erst mal hier Temp. Dann unmountenwir wieder die normale SSD, wobei das geht wahrscheinlich nicht, solange ich das anhabe.Und dann moveen wir das ganze mal. Gucken, ob das funktioniert. Unmount die SSD, zack,mont die SSD auf Temp. Und jetzt kopieren wir einfach den ganzen Mist. Wobei, ne, wirkönnen einfach den ganzen Kram moveen. Der hier drunter liegt, den moveen wir nach TMP.Und dann sollte der Kram auf der SSD sein. Joa. Sieht so aus, ne? Und da sollte leersein. Achso, den Kram sollte man vielleicht noch mitschieben, das wäre nicht verkehrt.Was suchst du, was suchst du Knäb? Ok, Nextcloud. Schmeißen wir mal weg. Here is the directory,ja ja, blablabla. Alter, was ist das für Musik? Das hört sich irgendwie permanentan. Ja. So, haben wir den Kram unmountet. Dann benennen wir das um, den mountpoint,nextcloud. So, machen sie hier auch nochmal drauf. Und dann mounten wir den Kram wiederund dann sollte das eigentlich genauso wieder funktionieren. Fsda nach nextcloud. Und jetztstarten wir den Apache neu und gucken, ob alles funktioniert. Wenn ich es richtig gemachthabe, sollte es wieder funktionieren. Nur mit dem Unterschied, dass mein data directoryja immer noch verkehrt ist. Ja, mein data directory ist jetzt verkehrt. Ok Max, daswar doch keine allzu clevere Idee, was du da gemacht hast. Also muss ich die gerade nochmaleinstellen. Man kann das hier doch bestimmt drin einstellen. Config. Einstellen, wo dasdata directory liegt, oder? Ach, da. Easy as a fuck. Mein data directory soll jetztdas da sein. Übrigens, krasse Wim-Hacks jetzt mal an der Stelle. Was man machen kann, wennman einfach das da löschen will zwischen den einfachen Anführungsstrichen, sagt maneinfach ci. Einfache Anführungsstriche. Äh, warum hat das jetzt nicht funktioniert? Manmuss da nicht drin sein normalerweise. ci. Einfache Anführungsstriche. Was? Normalerweisemuss man da nicht drin sein. Ja, da funktioniert es auch so. So, da ist mein data directory.Ok, gucken wir mal, ob meine nextcloud Installation wieder funktioniert. Oh, ich habe es kaputtgemacht. Leute, ich habe es zerstört. Ich habe es kaputt gemacht. Lohnt. Mag der nicht,dass das aufnimmt? Kann das sein, dass ich mich verschrieben habe? Nee, habe ich nicht.Wie genau habe ich das jetzt geschafft, kaputt zu machen? Ja. Ok, ich setze nochmal die Dateiberechtigungfür alles da drauf. Aber nicht verkehrt. Ich habe es kaputt gemacht, Leute. RIP. Ichmuss nochmal neu installieren. Ich habe es zerstört. Ich bin mir ehrlich gesagt abernicht so ganz sicher, mit was ich es zerstört habe. Aber anscheinend habe ich es zerstört.Na gut. Machen wir es halt nochmal. Ist ja nicht so, dass wir schon viel gemacht hätten.So, wir haben jetzt einen Ordner. Nextcloud. Ja, ok. Stoppen wir mal den Apache, das istgleich nicht verkehrt. Ja, das war jetzt natürlich total episch. Ich muss da rein, es bringtnichts, wenn ich den Ordner lösche. Ich habe gerade meinen Mountpoint gelöscht. Da hängengeblieben. Ich muss jetzt erstmal da rein, erstmal alles löschen. Dann den Kram nochmalda rein installieren. Jetzt ist alles weg, genau. Apache ist gestoppt. Gut. Weiß jemandaus dem Kopf, wie man anzip sagt, dass er das hier rein anzippen soll, ohne den Ordnerzu erstellen. Geht doch bestimmt, da muss ich es danach nicht verschieben. Minus D.Ja gut, dann, vielleicht geht das ja. Und zipp. Nextcloud. 16. Minus D. Ob das so funktioniert?Jetzt macht der Nextcloud den Nextcloud, das ist natürlich total bescheuert. Aber manmerkt, dass es auf die SSD geht, weil das ist schon gleich viel schneller. Oder istes? G-Warp gemountet. Ja. Jetzt habe ich Nextcloud in Nextcloud, das ist natürlich super. Ganz,ganz huge. Kann man nicht alles von Nextcloud einfach moveen? Dahin? Ne, das wird, das funktioniertnatürlich so nicht. Aber das müsste eigentlich funktionieren. Oh, geht doch. Big brain. Okay,gut. Und jetzt tut es hoffentlich. Ey. Ach so, die Berechtigungen sind immer noch verkehrt.Ja, die Berechtigungen sind, das können wir jetzt einfach fixen damit und jetzt gehts.Ey. Admin, Passwort 1, 2, 3, 4, 5, 6. Finish. Jetzt rödel da wieder ein bisschen rum. Solltejetzt schneller gehen, weil es ist auf der SSD drauf. Da hat Twitch schon was zur Partnerbewerbunggesagt. Ich hab die immer neu abgeschickt. Ich muss erst nochmal YouTube connecten zuTwitch. Dass die auch sehen, dass ich, ich hab Twitter schon connectet und ich muss YouTubenoch connecten. Ja, Sebaro, so ist das. Warum bin ich eigentlich der Einzige, der irgendwiedazu gedrängt wird, dass man Geld ausgeben darf. Bei allen anderen schreien die Leute,Alter, sell out, sell out. Und bei mir ist es so, Max, ich will Geld, äh, Max, ich willdir Geld geben, mach Partner. So, jetzt aber, jetzt hat es funktioniert. Alle anderen habenkeine Keks-Emotes. Ich hab ja auch noch, noch nicht, aber das ist wahrscheinlich einesder ersten Emotes, die wir dann machen. Allerdings nehm ich nicht meinen Standard-Keks. Ich mussmir mit Emotes eh noch was einfallen lassen. Erstens brauch ich jemanden, der gute Emotesmachen kann, der nicht gar so teuer ist, weil letztendlich, ich bin schon bereit dafürwas zu bezahlen. Also ich will ihnen auch was geben, weil, ähm, es ist immer, wie gesagt,von Exposure kann keiner leben und hier ist jetzt nicht so, dass es auf Twitch wahnsinnigviel wäre bei mir. Ähm, und ich brauch aber noch irgendein gescheites Konzept, wie man,wie die Emotes aussehen sollen. Ok, also, Zeug funktioniert, gut. Du kannst mir Shit-Emotesmachen for free. Also, es gibt Channels, die werden nur abonniert, weil sie Shit-Emoteshaben. Vielleicht soll ich das auch probieren. So, wir brauchen erst noch mal einen neuenUser. Wir brauchen einen neuen, wie ging das, nochmal einen neuen User. Ja. Users. Wir braucheneinen neuen User. Einen MonkaSmoke brauch ich auf jeden Fall, allerdings ist MonkaSmokekein offizielles Twitch-Emote. Da mache ich einen, da reichen wir einen BetterTwitchTV-Emoteoder sowas ein, weil ein Channel, der wupplos heißt, darf natürlich kein Emote globalauf Twitch machen oder generell auf Twitch machen, das MonkaSmoke heißt. Das ist jairgendwo klar. Wobei wir für MonkaSmoke schon das beste Emote überhaupt haben. Übrigenswisst ihr, was mir gerade angefallen ist? Da müsst ihr euch schon mal Gedanken zu machen.Wir haben ja schon unsere BetterTwitchTV-Emotes, allerdings, wir können auch noch 24 FFZ-Emotesmachen. Wie ist denn bei euch so die Verteilung? Was habt ihr denn? Also, Moment, da müssenwir jetzt mal eine Abstimmung machen. Also, ja, ja, ihr müsst das doch nicht in Chatter.Habt ihr ein Twitch-Addon? FFZ, BetterTwitchTV oder keins? Also, ich glaube, die wenigstenhaben beides. Die wenigsten haben beides. Ich weiß, dass Beides geht, ja. Okay, dannhaben wir beides hier noch. Keins, beides, create. Da. Einmal please abstimmen, ob sichdas überhaupt lohnt, FFZ-Emotes zu machen. Ich weiß, dass man bei FFZ BetterTwitchTVanzeigen lassen kann. Ich weiß allerdings nicht, ob man... Ach, BetterTwitchTV kannauch FFZ, okay. Ja, ja, FFZ kann BetterTwitchTV-Emotes. Ich weiß aber nicht, ob BetterTwitchTV-EmotesFFZ-Emotes kann. Ihr habt wirklich beide Twitch-Addons? Echt? Okay. Ich hab nur noch FFZ seit einemJahr oder so. Warum eigentlich? Also, was ist der Grund für euch beides zu haben? Interessiertmich wirklich jetzt. Weil das einzige, was ich bei FFZ vermisse ist, dass die ne Historyhaben. Das alte BetterTwitchTV hatte ne History. Da hast du im Chat was geschrieben und konntestdann mit Pfeil hoch und Pfeil runter, wie in der Linux-Commando-Zeile so ein bisschen,deinen letzten Chat-Nachrichten durchswitchen. Hab aber keinen mit dem Option-Knopf gefunden,Alter. Okay, also lohnt sich auf jeden Fall, wenn man sagt, wir machen auch noch 24 FFZ-Emotes.Ich mein, wir haben ja alle BetterTwitchTV-Emotes haben wir ja schon voll. Ich könnte die jaauch mal ein bisschen updaten wieder. Aber dann haben wir noch mal 20 Emotes zusätzlich.So, also wir brauchen einen neuen User. Zwar nennen wir den User mal cute-chat. Display-Namebrauchen wir nix, Default, Group, alles, alles gut. Unlimited-Quota, Groups, Admin, ne.Ich Groups Admin. Ich glaub da gehen manche auch bei Groups Admin. Passwort, 1, 2, 3,4, 5, 6. Du brauchst keinen User, du brauchst einen Dark Mode, ja. Wisst ihr was, wir machenalles mit Admin. Wir machen einfach alles mit Admin. Warum? Warum überhaupt? Gibt eseinen Link zu den BetterTwitchTV-Emotes von Maxi? Ich glaube es gibt einen Link, wo mansich alle Channel-Emotes anzeigen lassen kann von einem gewissen Channel. Aber ansonstenwüsste ich jetzt nicht. Also man sieht, du siehst, wenn du BetterTwitchTV installierthast, siehst du unten, wenn du auf den Smiley klickst, wo die Emotes sind, siehst du dieEmotes vom Channel. Oder sieht man das in BetterTwitchTV? Ich denke schon, bei FFZ sieht man es. Ne,das Hint ist, es müssten 25 oder so sein, mehr gibt es nicht. Darkseam, ja, wo ist dasneue, das haben sie doch beworben, dass es jetzt ein neues Darkseam gibt. Wo schaltetman das ein? Settings, Theming, hier. Ne. Ach ne, das ist ja auch die Admin. Das istja auch die Admin-Konsole. Das kann man bestimmt für User spezifisch machen, ne. Wo ist dasneue? Wo schaltet man das Darkseam ein? Settings. Ach doch, hier, Personal Info, bla, bla, bla.Accessibility, Darkseam, jawoll. Ach, gleich schon viel besser, oder? Viel besser. Washaben wir zur Auswahl? Open Dill Lexic. Der Font sieht mega beschissen aus. Warum sollteich diesen Font dann verwenden um alles in der Welt? Der Font sieht richtig räudig aus,warum soll ich das Ding dann verwenden? Okay, vielleicht sieht es nur unter Linux-Kackeaus. Gucken wir mal wie das im Chrome ist. Ach, das ist, das, das bedeutet irgendwas,oder was? Dill, Dill, Dill, Dill, Dill, Dill, Dill, Dill, Dill, Dill, Dill, Dill, Dill,Dill, Dill, Dill. Ach so. Dann ergibt das Sinn. Was ich nicht verstehe ist, wenn man,inwieweit hilft einem denn ein Font bei einer Leserechtschreibschwäche? Das interessiertmich jetzt wirklich, wie inwieweit hilft mir das jetzt? Betont das gewisse Sachen so, dassdass ich es mir einfacher merken kann, ah Reading Errors ok, interessant was es nichtalles gibt, ich hätte jetzt nicht gedacht, dass einem eine Schriftart helfen kann, weildiese Rechtschreibschwäche, aber man lernt ja nicht aus, ok jetzt gucken wir erstmalwas für Apps standardmäßig dabei sind mittlerweile, eine Sache die mir auch überhaupt nicht gefallenhat war die Notizenapp, die war richtig crap, ich verwende schon seit einer ganzen Weilediese Geschichte hier als Notizapp, so wirklich glücklich bin ich damit aber auch nicht,wir gucken uns mal die offizielle Notizapp an wie die mittlerweile ist, Passport, ojahoch secure Passport, Achtung Leute 1, 2, 3, 4, 5, 6, so dann brauchen wir noch dieTo Do App, ja wobei die hieß nicht To Do, die hieß Task glaube ich, Tasks download andenable, ok was haben die eigentlich mittlerweile, wir gucken mal was es mittlerweile für Appsalles so gibt, das sind ja wohl die im offiziellen, ah ne das sind meine, ok schauen wir mal wasgibt es denn alles so für Apps, Cup, gibt es kein Cup, manchmal verwirrt mich der Twitchchat,jetzt ist jetzt der Partyparod am Start, Cup ist eine halbe, Cup, ich wusste gar nichtdass es das alles im Out gibt, warum, weil er so rein sneaked, was ist das für einCup, also quasi ein bisschen so hier, es sneaked auch rein, verstehe, dann machen wirein halbes Cup als Emote, es gibt eh noch jede Menge coole Emotes, die ich noch nichtdrin habe, ich habe zuletzt meine Emotes vor einem Jahr oder so aktualisiert, wir brauchenunbedingt Five Head, wenn wir wieder irgendwelche Big Brain Sachen machen oder irgendwas ausversehenlöschen, wir brauchen unbedingt noch unser Five Head Emote, für die 900 IQ Kommandozahlenbefehle,wie lange läuft deine Banner TwitchTV Subscription auf die Emotes, ich habe automatisch Verlängerungengemacht, 3 Head, ja den gibt es auch noch, das ist der Oi Typ ist das, oi, Monkratos,Monkratos brauchen wir auch noch, wir sollten im Discord, im Discord kann man noch bestimmteine Abstimmung machen oder Vorschläge oder sowas, was wir für Emotes brauchen, da überlegeich mir mal was, da machen wir irgendwie so eine, machen wir im Discord so eine Listeoder irgendwie was, wo man abstimmen kann, dass ich, ich meine ich werde ein paar Emotesrein machen, auch wenn die nicht auf der Liste drin sind, aber ein paar muss man ja gucken,das ist immer, wäre ja blöd wenn ich vielleicht irgendwas nicht kenne, obwohl das eigentlichein nicees Emote ist, Pepega, Pepega müssten wir eigentlich haben, aber nicht mal Pepegaals Emote, oh das ist aber bitter, ja Siebaro kannst du, kannst du machen, wir müssen abernoch überlegen, wie wir das mit der Abstimmung machen, äh, es geht nicht um Emotes aufdem Discord, es geht darum, welche Emotes ich als, als, als FFZ Emotes für den Channelnehmen kann, weil ich habe alle 25 BellaTwitchTV Emotes und ich habe noch 25 offenen FFZ Emotes,ja und wenn ich dann mal Partner bin, dann gibt es ja auch richtige Emotes, allerdingsnicht so viele, weil es werden jetzt ja nicht gleich irgendwie riesen Anzahl an Abos geben,aber so ein paar wird es, da muss ich mir echt mal Gedanken machen, was ich da nehme,auf jeden Fall müssen wir noch MonkaSmoke als extra Emote einreichen, bei, bei BellaTwitchTV,okay, ähm, wir machen jetzt mal weiter, LulWee, ja LulWee muss auch sein, ich verwende eigentlichauf allen Channels, wo es LulWee gibt, eigentlich fast nur LulWee anstatt Lul, wer sich kennt,LulWee ist einfach ein rangezoomtes Lul, weil Twitch, großartige Logik ist leider nichtdahinter zu erkennen, ja, übrigens, äh, wer neu am Start ist und das auch noch nichtmitgekriegt hat, wir haben also einen Discord Server, Ausrufezeichen Discord, wer noch nichtgefollowed ist, kann mir gerne followen, auf Twitter und natürlich auch auf Twitch, daseid ihr immer auf dem aktuellsten Stand, wenn der Stream live geht oder wenn es irgendwelcheanderen Sachen gibt, und jetzt haben wir Sellout-Modus beendet, jetzt machen wir weiter mit NextCloud, ähm, okay, was, was, was haben sie mittlerweile standardmäßig für, für Appsdabei, App-Order, sortieren, das brauch ich nicht nur mit den Customs hier, das blablabla,braucht man nicht, Random Background from Unsplash, das gefällt mir, ich weiß zwarnicht genau, was wir damit machen, aber das installieren wir einfach mal, Random Backgroundist immer, immer nice, äh, External Sites brauchen wir an der Stelle nicht, das brauchenwir auch nicht, okay, was haben wir sonst noch so, Files, äh, PDF Viewer, der ist standardmäßigdabei, Tiffties brauche ich nicht, brauche ich auch nicht, Draw IO als Addon für NextCloud, okay, das ist cool, das muss ich mir mal angucken, ich hab ja, wir haben ja schonöfters hier, äh, Draw, Draw IO Bildchen gemacht, gibt es Draw IO auch als Desktop Client eigentlich,also Desktop, in Anführungsstrichen, das ist wahrscheinlich eine Elektronen Anwendungoder sowas, ne, aber es ist cool, wenn er das einfach auf Next Cloud speichert, das,das gefällt mir, ähm, Camera Rob Reviews brauche ich nicht, Check Zoom, das ist nice,das können wir auch mal aktivieren, sollte das jetzt nicht eigentlich Enable, ups, ichhab das falsche angeklickt, Alter, jebaited, jetzt hab ich hier den Mist Enabled, den ichgar nicht haben will, äh, wie hieß das Ding, Raw, Disable, Next Cloud Games brauche ichwirklich nicht als Next Cloud Anwendung, Keep all the random clean your Next Cloud Data,warum nicht, Integrations, Draw IO haben wir schon, After Logic, Webmail Client, okay,Circles, Circles klingt mir viel zu sehr nach Google Plus, findet ihr nicht auch, da hierzusammen Editierzeug, brauche ich auch nicht, Git, Git hat Merge Tracker, ein Keepers Client,nein, den brauche ich auch nicht unbedingt da, Only Office, was ist denn Only Office,Ist ein Open Source Office Paket, ist das, ist das, ähm, ist das Libre Office mit Supportoder was ist das, ach ne, das ist ein komplett anderes, das ist ein eigenständiges Office,okay, hab ich noch nie was von gehört, aber wie gesagt ich verwende auch keine OfficeSoftware, Markdown Editor, Edit Text Editor, Plane Text, Markdown drüber reicht für 95%der Sachen, und ich sage es jedem Stream, die einzige Anwendung, die eine Daseinsberechtigunghat in dem Office Paket ist meiner Ansicht nach die Tabellengalkulation, OCR, OCR istcool wenn es richtig funktioniert, da könnte man beispielsweise ein Foto machen von irgendeinemDokument oder ein eingescanntes Dokument in Nextcloud schieben und das Ding macht OCRdrauf und man kann es durchsuchen, das wäre natürlich richtig cool, wie Previews zu Markdown,meistens gar nicht, das einzige wo ich das mal in schön brauche ist für einen Changelogoder sowas, weil unsere Changelogs auf der Arbeit, das ist alles in, unser Haupt Changelogquasi ist in Markdown und da habe ich, wie heißt das, Crip glaube ich, das ist so einPeißending oder so, das startest du einfach und das rendert dir alle Markdown Files ineinem Verzeichnis und dann kannst du das rauskopieren dann. Ansonsten hat, QR Notes hat eineneigenen Markdown Preview drinnen, das verwende ich allerdings habe ich den Markdown Vorschauausgeschaltet, verwende eigentlich bloß noch das Synthax Highlighting für Markdown,weil das das Dokument auch ein bisschen strukturiert, ansonsten stinkt normales Plain Text. Wasist Nextcloud? Eine Cloud Lösung zum selber Hosten, wobei Cloud in dem Sinne eigentlichein bisschen trügerisch ist an der Stelle, es hat mit Cloud relativ wenig zu tun, weilund der Cloud versteht mir ja gerade, dass es nicht bei dir läuft, dass du auch wenigEinfluss hast drauf wo es läuft und wie es eigentlich genau läuft, das ist im Prinzipstinknormale PAP Anwendung, die relativ viele nützliche Funktionen und Apps hat. Also imKern ist es eigentlich ein Filesynchronisierung Service sowie Dropbox, das ist so der Kern,plus Kalender und Kontaktlisten. Also die zwei Sachen, Kalender und Filesync, das isteigentlich so im Kern, das wofür Nextcloud da ist. Es gibt allerdings halt noch zig andereApps, wir gucken uns gerade mal an, was es da jetzt Neues gibt. Wie gesagt, die letzteVersion, die ich installiert habe, war 13. OCR könnte man vielleicht mal ausprobieren,das ist glaube ich ganz nützlich, wenn es gut funktioniert. Sentry, war Sentry nichtso ein bisschen was wie Jenkins, nur neuer. Social Login. Ja das ist jetzt alles nichtso das was man jetzt mal ausprobieren muss, das haben wir uns alle schon gesehen, AdminNotification, Quota Warning, das ist ganz praktisch, weil man das mit mehreren Leutenverwendet. Decryption, wenn man sich Loki eingefangen hat. Ein Audioplayer gibt esmittlerweile auch, ok. Ich hatte zwar bisher noch nie das Bedürfnis in meiner Nextcloudim Browser Audio Sachen abzuspielen, weil ich mein Audio Zeug überhaupt nicht mehrim Lokal hab. Eines der wenigen Clouddienste übrigens, die ich verwende, also Amazon Music.Ebook reader, Folder Player, GPX Edit, blablabla, das ist alles nicht so das was ich jetztunbedingt brauche. Phone Track, das wollte ich mal ausprobieren. Das wollte ich mal ausprobieren,das hab ich schon vor ner Weile gelesen. Da kann man, also aktuell mach ich es ja so,meine Presence Detection für Heimautomatisierung besteht ja aus mehreren Sachen, einmal obich im WLAN bin, ob mein Gerät gepinkt werden kann und solche Geschichten und ich hab aufmeinem iPhone ne Tracking Software laufen, die nennt sich, wie nennt die sich nochmal?Gute Frage, Own Tracks, genau. Das hab ich bei mir laufen auf dem iPhone und das hatverschiedene Modi, da kannst du einstellen, wie oft das quasi lockt, wo du gerade bistund es funktioniert halt ohne Clouddienste. Der schickt es dann an mein HeimautomatisierungSystem, Heim über nen Server im Internet, verschlüsselt und dann weiß meine Heimautomatisierungimmer wo ich bin und viel wichtiger, ob ich gerade auf dem Weg Heim bin und ob es spezielleDinge machen soll. Ja und deswegen wollte ich mal Phone Track ausprobieren, das kanndiese Daten wohl auswerten und man kann sich dann Bewegungsprofile anzeigen lassen undwas, da seh ich dann keine Ahnung, dass ich immer beim Asia All You Can Eat Freitag sitzeund All You Can Eat Snackaria Asia mache. Radio, ich hör zwar kein Radio, aber ich willes mal ausprobieren, wie gut das funktioniert. Ebook brauch ich nicht, Talk juckt mich überhauptnicht in On Cloud Office Text. Quick Notes, achso da sind irgendwelche Pappen, ne die brauchich nicht. Hatten die nicht auch den Markdown Reader? Notifications for calendar events.Full Text Search, haben sie das mittlerweile geschafft? Das wäre natürlich sehr nice.Welches davon sollen wir jetzt nehmen? Full Text Search, Full Text Search Files, FullText Search Elastic Plattform, Full Text Search OCR, was ist davon jetzt das Richtige? FullText Search Bookmarks, weiß ich nicht. Warum haben wir den Markdown Editor gerade nirgendwogesehen oder hab ich den einfach übersprungen? Ich würde ja, ach ist der unter Tools? Istder unter Tools irgendwo? Hier müsste ja A, B, C, D, E, F, G, H, J, K, L, M, Markdown,ich seh hier kein Markdown, müsste hier irgendwo sein. Aber was auch immer, brauchen wir jetzteh nicht gerade. So, ach guck mal, das macht wirklich die random Hintergründe, das istja witzig. Kona, ja. Mal gucken wie das Video abspielen im Browser mittlerweile klappthier. Achso, gut. Obwohl gemerkt, das ist alles in der VM, ne? Wir sind ja eigentlichunter Windows und Linux in der VM. Also ich muss sagen, das Webinterface sieht im Prinzipnoch genauso aus wie unter Nextcloud 13, allerdings hat es schon ein paar sinnvolle Verbesserungen.Erstmal ein Dark Theme, das hier hätten wir vielleicht noch ein bisschen schöner machenkönnen, modified, ein recent used, recent added, das ist auch ganz praktisch. Ok, probierenwir mal. Tasks App aus. Highspeed, aber gut, das läuft auch im Raspberry. Tasks, Check,Twitch, Chat, Spammen, Wonka, X hinzufügen. So, jetzt haben wir ein paar Tasks, die kannman danach jetzt suchen. Kann ich suchen, oder? Kann man die Tasks suchen mittlerweile? Ah,sie haben das in die Suche oben integriert. Das ist schon mal gut, das ging das letzteMal noch nicht. Das war bei Nextcloud 13, war das noch kaputt. Man konnte To Do's anlegen,konnte die To Do's aber nicht durchsuchen, das fand ich ziemlich fail. Ach man, ok,wir testen mal, ob man, ob der auch die zusätzlichen Sachen durchsucht. Achso. Hey! Ok, das istschon mal besser wie vorher. Das ist sogar mal eine, da kann man die App halbwegs gebrauchenmittlerweile anscheinend. Completed. Gut, ich meine ich werde, ich verwende als den Webclienthier für To Do's wahrscheinlich eh nicht oft, oder aktuell verwende ich ihn nie, aberich habe, ich fand es schon ein bisschen blöd, dass noch nicht mal die Suche funktionierthat vorher, also früher bei der alten Version. Ich meine, eine To Do Anwendung ohne Sucheist irgendwie ziemlich sinnlos. Ach ja, wir müssten Thunderbird installieren, um dieganzen Kalender- und To Do-Funktionen mal testen zu können. Was haben wir sonst nochhier? Radio. Das Dark Theme ist auch nicht so ganz konsistent. Ok, ich weiß nicht, wases jetzt hier macht, aber es macht nicht viel. Achso. Das buggt rum auf jeden Fall, wenn manes anklickt. Ok, ich meine ich höre kein Radio, aber es sieht auf den ersten Blickso aus, als würde es funktionieren. Stimmt, außerdem ist Dark Theme in der Beta. Ok,Nodes, gucken wir uns mal die Notiz-Anwendung an. Leider, es gibt wirklich verdammt wenigegute Apps für Kalender und To Do's, die nach Möglichkeit auch unter Windows funktionierenoder unter Linux, weil Kalender findest du noch halbwegs. Software, die Call of Kalenderkann, findest du noch halbwegs. Was du eigentlich so gut wie gar nichts findest, ist Software,die ordentlich To Do's unterstützt. Es gibt zwar, ich sag mal, Gott und die Welt hateinen To Do Programm, allerdings können die meisten dann keine Call of To Do's, waswieder doof ist, weil dann kann man es nicht sünken gescheit. Wobei es eigentlich dummist, weil iOS kann es von Haus aus, die Standard To Do App, unter Android ist es relativ einfachhinzuzufügen, aber so wirklich für einen Desktop gibt es kaum gescheite Call of Anwendungen.Aber Call of ist auch ein scheiß Protokoll, muss man ehrlich sagen. Das ist so ekligesXML-Geschwubbel, also ich will nicht sagen, dass es vom Ansatz her schlecht ist, aber vomProtokoll an sich. Ich mein, keiner macht 2019 auch gerne XML. Oder haben wir XML?XML-Cuties am Start. Kennst du Task Warrior? Ja, Task Warrior ist ziemlich gut. Das Problemist, dass Task Warrior auch nicht für alle Plattformen zur Verfügung steht. Ist OwnCloud nicht besser? Nö. Next Cloud ist quasi Own Cloud, bloß moderner und mit den ursprünglichenLeuten hinter Own Cloud. Task Warrior ist das Problem, dass du es nicht... Also Task Warriorkönntest du auf zwei Sachen lösen. Entweder sie würden Clients rausbringen für alle Plattformen,dann könntest du es verwenden. Das bedeutet allerdings auch für Windows, für iOS undfür Linux, für Mac und für Android. Und ich glaube für iOS zum Beispiel gibt es keinenordentlichen Task Warrior Client. Oder aber sie würden Sync zu Kaldorf erlauben. Wahnsinnig.Ok, Nodes. Ok, New Node. Ist ganz schön langsam, aber das ist auch noch Raspberry. Und manmerkt, dass das Darkseam Beta ist, weil so wirklich schön verdienen lässt sich nochnicht. Ok, also Rhyme, Nodes. Tolle Nodes. Ach so, ah. Das ist der neue Markdown Editorhier im... Der noch nicht mal List... Ah doch, macht er. List, macht er. Kann er SyntaxHighlight? Das ist immer... Wenn ihr mal ordentlichen Markdown Editor testen wollt, guckt ob erSyntax Highlight kann, dann seht ihr gleich ob das Ding ordentlich ist oder nicht. Nope,kann er nicht. Ist kein ordentlicher Markdown Editor. Kein Syntax Highlight. Für CodeLogs. Ja und... Ender Boy, wie nennt sich das? Mathjacks oder so, ne? Es gibt ja mittlerweilefür Markdown die Plugins, dass du da direkt Latex drin machen kannst, dass du da Mathjacksdrin machen kannst. Ja ich glaub so heißt das. Das ist als... Ja, das da. Dass man Formeleinfügen kann. Ja dafür hätte ich auch gerne Support. Wollen wir mal ausprobieren ob dasfunktioniert? Ich denke nicht, dass es funktioniert. Brauchen wir mal ein Beispiel? Ich glaubenicht, dass es funktioniert. Wobei, wo kann man sich jetzt das Geränder da anzeigen lassen?Preview. Nee, kann er nicht. Kann er nicht. Aber zumindest so Basic Markdown. Aber sagman mal so, das ist jetzt nichts tolles, weil... Warum kann man hier jetzt nicht mehr drinnemarkieren? Das ist jetzt auch wirklich nichts tolles, dass sie das mittlerweile eingebauthaben, weil so nen 0815 Textfeld mit Markdown Syntax machst du in 5 Zeilen JavaScript. Wasist mein Lieblings Markdown Editor? Ich hab ihn ehrlich gesagt noch nicht gefunden. MeinLieblings Editor an sich ist eigentlich Wim, weil ich den direkt hier inline im Terminalaufmachen kann. Allerdings ist Visual Studio Code in letzter Zeit auch schwer gestiegenbei mir so in der Nutzungsdauer. Die Musik, ja ich weiß auch nicht was mit das da losist. Die wiederholt sich vor allem die ganze Zeit und ist zu laut. Ansonsten klingt dieganz okay, aber warum sich das wiederholt, versteh ich auch nicht. Wahrscheinlich hatder Typ bloß 30 Sekunden gemacht und die haben da draußen einen 5 Minuten Track gebastelt.Am liebsten wär mir ja, wenn Emacs Org Mode nen ordentlichen Kaldorf Sync hätte. Hates aber nicht. Es hat so nen ganz ganz rudimentären Sync, der aber zum Beispiel schon daran aufhört,dass es keine To-Do Sync hat und dass der Two-Base Sync auch nicht ordentlich funktioniert.Das wär mir am liebsten. So jetzt müssen wir mal, ich brauch jetzt zwei Sachen, wirmüssen Thunderbird installieren, weil Thunderbird der einzige Cross-Platform Kaldorf Klein ist,der nicht sackt und der sackt an sich schon ziemlich, doch der am wenigsten sackt. EineRunde Thunderbird und dann brauchen wir den Nextcloud Klein und Sync ein paar Files.Ach nee, Server Address, okay, da, da, Nextcloud, komm her, hier weg, Server Address, next,nicht HTTPS, HTTPS, connect to your account. Oh, die haben jetzt so einen komischen Authentifizierungswizardhier noch am Start. Login, Admin 123456, hohes, segures Passwort. Was willst du mit Nextcloudmachen? Eigentlich hauptsächlich Files Sync bei mir daheim und ab und zu ein paar Sachenhalt vom Smartphone, meine ganzen Notizenkrams vom Smartphone Sync und Kalender, To-Do'sund Kontakte. Also eigentlich die Basics. Und das, was, Account, Grand Access. Der Buttonbringt es auch richtig, wenn du sonst nichts machen kannst auf der Seite. Okay, Sync everythingfrom Server as Confirmable. Home Test, Nextcloud, ja, okay, passt, connect. Es synkt. Es istgesynkt. Nextcloud. Ah, sehr schön. Funzt. Gut, dann machen wir mal ein bisschen was größeresrein und gucken was passiert. Wir sind jetzt mal, wir sind jetzt mal gemein, wir machenjetzt mal Nextcloud, mal gucken wie, mal gucken wie er das handelt. Das bedeutet gar nichts,das bedeutet ich hab mich verschrieben und mein LS-Kommando ist so schlau und checkt,dass ich das gar nicht haben will. Welche Distribution ist das eigentlich? Das ist Manjaro,Manjaro mit i3 als Desktop. Okay, gucken wir mal wie das den DD handelt. Ich mein, dafürist es nicht gedacht, aber wir können es ja mal ausbringen. Von Def Random, wir machenmal nicht nullen, wir machen random. Von Def Random nach blob.dxd, blob.bin, die Änderungist ja, wie gesagt, das ist eigentlich egal. Blocksize 1M, count, machen wir mal 10, wirmachen mal eine 10mb-Datei. Def Random ist übelst lahm, ne? Stimmt. Was war, u-randomwar glaub ich schneller, gell? Urandom, jawoll. So, und jetzt synkt das jetzt? Noch hat'snicht gesynkt, ne? Hat es schon gesynkt? Hat schon gesynkt. Oh, das hat er aber schnellkapiert. RM. Ah, okay, das geht schneller als bei 13 noch. Bei 13 hat das eine ganzeEcke gedauert oftmals. Was ist daran besser als Google Drive oder Dropbox? Nix. Also vonder Funktion her nicht wirklich nix. Es kann mehr, aber von der Funktion her, vomFilesync her, also ich würde sagen, dass der reine Sync von Dropbox wahrscheinlichbesser ist. Zumindest hatte ich in der Vergangenheit mit dem Sync Probleme von Nextcloud. Aberwenn es dich nicht stört, deine Daten woanders liegen zu haben als bei dir, dann kannst dunatürlich auch Dropbox nehmen. Also wenn man keine Abneigung gegen Cloud-Software hat,dann braucht man das auch nicht. Das ist nur für Leute, die die Sache bei sich lokallaufen lassen wollen. Und ich will halt mein Zeug nicht bei Dropbox oder bei Google Driveoder bei Amazon Drive oder was da so noch alles gibt lagern. Es gibt eine ganz gute Zwischenlösung,wenn man sagt, hey, man möchte nicht sein eigenes Filesync-Ding betreiben. Ich meine,da gehört ja auch noch ein bisschen was für Aluhutler, genau. Da gehört ja noch ein bisschenmehr dazu. Wenn du wirklich das so betreiben möchtest, dass du es nutzen kannst ein bisschenwie Dropbox, dann musst du dir auch dafür sorgen, dass das extern erreichbar ist. Undextern erreichbar in einem privaten Service ist immer doof, was dann wiederum heißt,du brauchst wahrscheinlich einen VPN. Das ist schön und sicher funktioniert und ganzgut. Da gehört dann ein bisschen mehr dazu. Wie greifst du jetzt von außerhalb draufzu? Gar nicht. Ich mache das ganz primitiv. Ich trage einfach Sachen bei mir ein oderich mache Notizen bei mir auf dem Tablet oder so. Und sobald das Tablet bei mir daheimins WLAN geht, dann synkt es das. Das reicht aber auch. Genau, es gibt auch eine ganz guteZwischenlösung. Wenn man Google Drive oder Dropbox verwenden will, dann kann man einfachdas verschlüsselt machen. Allerdings sollte man darauf achten, dass das ein Verfahrenist, was dann eine jeweilige mobile Client auch unterstützt. Wenn man nur Linux-Systemehat, kann man einfach NKFS oder so etwas verwenden. Oder was? E-Crypt-FS. Ich habeschon ewig nicht mehr verwendet. Der verschlüsselt auf Dateiebene. Und das ist wichtig, wennman sowas wie Google Drive verschlüsselt verwenden will, dann muss man auf Dateiebeneverschlüsseln, nicht auf Device-Ebene. Also auf Device-Ebene sieht das Dropbox undGoogle Drive gar nicht. Und du kannst auch nicht einfach einen True-Crypt oder einenVera-Crypt-Container nehmen und auf dein Dropbox-Laufwerk legen, weil dann denkt Dropbox, dass beijeder Änderung sich die gesamte Datei geändert hat. Das macht das Ding kaputt. Das funktioniertnicht. Das heißt, man muss irgendetwas nehmen, was auf Dateiebene verschlüsselt. Ja, undman braucht halt Clients, die es wieder entschlüsseln können. Was ist denn mit der Musik los? Dieist wirklich kacke. Concentrate your Asian... Ah, nee, nee. Kein Hip-Hop Zeug. A relaxingstudy. Procursive Housemix, was sagt der Zeug gibt? Oh, nee. Ich sag eigentlich überhauptnicht meine Musikrichtung, aber im Hintergrund kann ich mir jetzt kein Heavy-Metal-Gehemmereanhören oder sowas. Auch wenn es mir besser gefällt für Stream-Hintergrund, vor allemwenn man sich ein bisschen konzentrieren muss, ist das nichts. So, wo sind wir stehen geblieben?Genau, wir wollten gucken, ob der ganze Kram synkt. Können wir nochmal testen. Also, draufdie Ideen funktioniert wunderbar und schnell. Gucken wir mal, was er macht, wenn man dasein bisschen hintereinander spammt. Wahrscheinlich nix, wahrscheinlich synkt er einfach das Neueste.Ja, was passiert, wenn wir die gleiche Datei... Ah, das synkt er neu. Haha. Was natürlichauch nicht ganz optimal ist, wenn er die gleiche Datei mit dem gleichen Inhalt doppelt synkt.Egal, aber der Synk wirkt jetzt schon deutlich stabiler als das letzte Mal. Das letzte Malhat er hier teilweise irgendwie eine Minute rumgewurstet, bis er überhaupt angefangenhat zu synken. Milch ist auch Gift, ja. Milch ist vor allem mittlerweile ein Symbol... Oh,ne, was haben sie erzählt? Ein Symbol weißer, männlicher Weltanschauung, ja. Milch. Mittlerweilenimmt das alles Ausmaße an, da denkst du dir, was geht mit denen ab. Und ihr wisst ja auch,das Wort Woman oder Women ist auch ganz furchtbar sexistisch, ja. Weil da kommt das Wort, dakommt in Woman, kommt Mann drin vor. Und das ist böse. Das ist ganz böse. Deswegen sagtman jetzt, wenn man quasi nicht anecken will bei Feministen, muss man sagen Woman. Klingtzwar übel, als könnte man nicht richtig sprechen, aber so ist das heutzutage. Woman. Also irgendwiesind sie... Irgendwie die Welt ist teilweise schon nicht mehr ganz dicht, ist das anbelangt.Okay, ähm, tja, wo sind wir stehen geblieben? Weiter. Also, SYNK sieht erstmal okay aus.Wir können... Wir müssen jetzt eigentlich mal probieren, mal 5000 Files zu synken. Ichzeige euch jetzt nochmal was. Ähm, oder machen wir mal, machen wir mal Fangfrage. Was istdie einfachste Variante, 1000 Files zu erstellen? Jetzt hier auf der Shell unter Linux in diesemVerzeichnis. Dateien sollen heißen 1 bis 1000. Ah, Q-Chat fragen. Also ich, ich weiß, wiees geht, aber vielleicht, was habt ihr da so für Ideen? Dateien erstellen 1000 Stück,1 bis 1000 soll der Dateiname sein, möglichst kurz und knackig jetzt hier auf der Shell.Wie würdet ihr es machen? Irgendeine Vorlobe in der Bash, das geht noch einfacher, aberdas ist schon mal ein guter Ansatz. Vorlobe in der Bash ist auf jeden Fall nicht verkehrt.Touch 1, Touch 1 ist schon mal gut. Ah ne, Touch 1, 2 ist, äh, das ist zu langsam. Mankann sowas hier machen. Touch, 1 bis 1000. Und bam, hat man 1000 Files. Mal gucken, wasdas Ding da jetzt macht. Ohje. Jetzt, jetzt haben wir es. Jetzt haben wir es geschafft.Wow. Wo kommt die Auslastung her? Das sind 0-byte-Dateien. Warum verursachen, warum verursachen1000 Dateien mit 0-byte so eine krasse Auslastung? Na gut, ist logisch eigentlich, die muss neuangelegt werden. Das heißt, es müssen neue Metadaten gespeichert werden in der SQLite-Datenbankvon Nextcloud. Aber es wirkt mir doch ein bisschen ziemlich CPU-intensiv für 1000 leereDateien. Und wir sind wohlgemerkt, wir sind auf der SSD, ne? Wir sind auf der SSD. Also,wir sind jetzt nicht irgendwie auf der langsamen MicroSD-Karte, sondern auf der SSD. Ja, fürMephisto Boy ganz bestimmt, ganz bestimmt. Das kennen die meisten wahrscheinlich schon,oder? Was der Mephisto Boy hier gepostet hat. Das da. Ich mache mal sicherheitshalber einenComment davor. Kennt ihr das, was das macht? Weil es gibt ein paar Seiten, wo die Leutelustig sind und sowas als Antworten posten. Das wird euer System nicht killen, aber daswird dafür sorgen, dass sich euer System aufhängt bis zu einem Reboot. Und zwar macht es dasfolgendermaßen. Es ist ein bisschen schwierig zu erkennen, aber das ist eine Funktion inBash. Funktionsname ist Doppelpunkt. Das ist Funktionsdefinition. Das hier ist Body vonder Funktion. Und hier in der Stelle nichts anderes macht, wie sich selbst aufzurufenund sich selbst noch mal im Hintergrund zu starten. Danach wird das beendet als Befehl,dass ich auf die gleiche Zeile was Neues schreiben kann. Und jetzt rufe ich das zum ersten Malauf. Das heißt, hier wird es zum ersten Mal aufgerufen. Es verdoppelt sich. Ruft sichwieder selbst auf, verdoppelt sich, verdoppelt sich das. Das ist eine Frogbomb. Wenn mandas ausführt, kackt euer System ab. Einfach weil RAM und alles so rekrutiert. Ja, im Endeffektschon. Es forgt sich halt zu Tode. Hab ich auch gelesen, Sebaro. Oh, er ist fertig.So, wenn ich jetzt refresche, habe ich hier jetzt 1000 Dateien drinnen. Ägitt, EndlessScroll. Endless Scroll. Weiche. Endless Scroll. Please. Kein Endless Scroll. Tut mir das nichtleid. Macht Pages. Kein Endless Scroll. Kann man das umstellen? Doch, ich möchte Pageshaben. Ich mag kein Endless Scroll. Guckt euch die YouTube-Comments an, wie beschissendas mit Endless Scroll ist. Du findest überhaupt nichts mehr richtig. Wenn ich jetzt ein Videohabe mit 1000 Comments und ich bin halt jemand, der liest alle Comments unter seinen Videos,und ich weiß auch, da hat mal einer was gepostet. Das war relativ am Anfang vom Video. Ich findeden Scheiß nicht mehr. Doch, bei Dateien auch. Mag das nicht. Guck mal, es ist doch totalbeknackt. Warum muss ich jetzt, mal angenommen, ich will jetzt Datei, wenn wir mal ausblenden,dass es eine Suche gibt. Ich weiß, ich will Datei 500 haben. Warum muss ich dann EndlessScroll machen, bis 500? Warum kann ich nicht einfach auf Seite 8 gehen, oder sowas? Undübrigens, ein Dateibrowser macht das auch nicht so. Ein Dateibrowser macht das, achnee, warum habe ich jetzt gefräscht. Ein Dateibrowser zeigt dir einfach alle Dateienauf einmal an, und Endless Scroll nicht. Ich habe ja nicht das Problem, dass das alle Dateienauf einer Seite hat. Ich habe das Problem, dass nicht alle Dateien da standardmäßigdrin stehen. Ich mag kein Endless Scroll. Auf Reddit ist das auch die Pest Endless Scroll.Und auf Reddit Mobile sagen sie immer noch, ja installier dir doch die App, dann hastdu Endless Scroll. Das ist für mich ein weiterer Grund zu sagen, nee, Reddit, ich installierebestimmt keine Reddit App, weil ich will gerade kein Endless Scroll haben. Ich magkein Endless Scroll, und zumindest sollte es optional sein. Oder umgedreht, wenn manschon sagt Default Endless Scroll, könnte man ja halt hier oben irgendwas machen mitEndless Scroll ausschalten. LazyLoady macht aber schon den Fall zu Millionen von Adayas,das ist korrekt, allerdings hätte ich Millionen Dateien nicht in einem Ordner.How to disable Infinite Scroll? Gar nicht anscheinend. Was für eine Distro, das istmancharo mit i3-WM. Ja anscheinend geht das nicht zu disablen. Ich meine, das ist jetztkein KO Kriterium, ich mag Endless Scroll, aber einfach nicht. Das fängt schon damitan, wenn ich jetzt hier irgendwas tracken und droppen will, da muss ich dann hier sokomisch rumwursten, bis das geladen ist, also es ist nicht schön. Also mir gefällt's nicht.Ich kann verstehen, wenn man sagt, das ist Geschmackssache, mir kann aber keiner erzählenso nach dem Motto, Endless Scroll ist beste. Es bleibt Geschmackssache. Und mir gefälltEndless Scroll nicht. Wie die sich auf Twitter aufgeregt haben, wo ich mein Zenf zum Callof Duty 2, was es 2-Modus gegeben hab. Da waren ja paar richtig angepisste Call of Duty3-Modus wieder dabei diesmal. Wie markiert man denn jetzt hier alle? Geht das? Kann mansowas machen, wie markieren von hier bis Ende, Select File Range. Guckt euch das mal an,das ist doch nicht normal. Endless Scroll. Bleibt mir ja gar nichts anderes übrig. Undjetzt sagen wir Delete. Und nun kriegt er das mit. Weil jetzt könnten wir einen Konfliktverursachen. Das ist huge langsam. Gut, das liegt aber am Raspberry, das geht voranderem, da wär das schneller gegangen. Der brauche beim Löschen noch mehr CPU-Last von1000 leeren Dateien, als beim Anlegen von 1000 leeren Dateien. Der Chat gerade. Ich kannnicht oben einen Haken setzen, weil die Dateien, die will ich ja behalten. Ich wollte ja wirklichnur Dateien von 1 bis 1000 haben. Geht RM 1 bis 1000? Klar geht das. Ich wollte es jaübers Webinterface löschen, weil das mit RM funktioniert ist klar. Ich wollte mir angucken,wie das funktioniert übers Webinterface. Ah, ok, der Sync alle paar Sekunden anscheinendneu. Ok, jetzt. Das geht. Also ich muss sagen, der Sync macht einen ganz soliden Eindruck.Auf jeden Fall besser als bei Nextcloud 13 noch. Es könnte ein bisschen schneller sein,ja. Letztendlich legen wir 1000 leere Dateien an und löschen 1000 leere Dateien. Es könnteein bisschen schneller gehen, aber das schiebe ich jetzt einfach mal darauf, dass das nichtfür Massen an Dateien anlegen und löschen gerade optimiert ist und dass es auf einemRaspberry läuft und dass es mit SQLite läuft. Wobei SQLite performance-mäßig gar nichtübel ist als Single-User. Mit mehr Anfangs wird es schwierig. Ja, genau, der Typ. Ganzehrlich, dann geh Battle Spiel spielen, wenn es dir nicht gefällt. Da hatten wir auchein paar in den Comments drunter. Da hatten wir wieder einen Typ in den Comments, der hatein übelst dämliches Kommentar gepostet und auch gleich rumgeflamet. Da hab ich dann draufgeantwortet, ey, du Dummschwerzer, blablabla. Also sein Comment war schon komplett unteraller Kanone. Ich hab einfach nur drauf geantwortet, ey, du Dummschwerzer, dann erzähl mir mal,was hat dir denn an den Modus gefallen? Irgendwie sowas. Und da hat er gesagt, ja, da geh ichjetzt gar nicht drauf ein. Wahrscheinlich, weil dir nichts einfällt. Da hast du schonimmer Spezialisten teilweise am Start. Patrick, De-Abo macht man heute nicht mehr. Heute machtman, das müssen wir mit dem passenden Nachdruck, heute macht man kein De-Abo, heute macht manDis-Abo, macht man heute. KappaPride Dis-Abo. Ja, PavelimomentKot bekommt eine 2x2 Modus,der sah aber sowas von schlecht aus, dass ich mir nicht vorstellen kann, dass den jemandspielt bei Release. Maps einfach nur viereckig, quadratisch viereckig, spawn direkt gegenübermit zwei Leuten, in der Mitte eine Kiste und es war's. So sehen alle Maps aus. Wieheißt der RGB Text? LOLCat. LOLCat. Und das Beste ist, dadurch ihnen ist selbst aufgefallen,dass ihre Spawns kacke sind, weil das erste, könnt ihr euch daran erinnern, das erste,was ich gesagt hab im Stream, als ich den Modus gesehen hab, einer flasht, einer wirftGranate. Instant, instant win. Auf die Idee sind die Entwickler von Call of Duty allerdingsauch gekommen. Man kann ja nicht sagen, die sind schon clever. Deswegen haben sie nichtgesagt etwa, ah ok, man kann quasi aus dem Spawn heraus instant gewinnen, wir änderndie Maps und die Spawns, nein, die sind viel schlauer. Die haben gesagt, wir deaktiviereneinfach Equipment und Granaten die ersten drei Sekunden, dann kann das nicht passieren.Das ist mal, das ist 900 IQ. Nicht die Maps verbessern, nicht die Spawns verbessern, nein,einfach die Granaten deaktivieren. Die sind einfach richtig re-smart, sind die. Fiveheadbrauchen wir jetzt. Moment, den müssen wir jetzt hinzufügen, den brauch ich als Emote.Fivehead Emote. Das ist für die besonders big brain Leute. Fivehead. Ja, perfekt.Richtig, warum machen die in CS überhaupt Map Balance? Die sollen einfach Granaten deaktivieren.Das ist die Call of Duty Logik. Dann haben die Leute geschrieben, Max, jetzt mach dochnicht das ganze Game schlecht, nur weil der Modus nicht gut war. Wo ich mir dann immerdenke, wie kommen die Leute drauf? Das Comment, was ich geschrieben hab, hat sich exakt aufdiesen Modus bezogen und sonst nix. Außerdem ist es bei Call of Duty ja nicht so, dassman Call of Duty noch irgendwie schlecht machen müsste. Da haben sie ja die letzten Jahreselbst schon für gesorgt. Mittlerweile ist es eigentlich eher umgedreht. Sie müssen beweisen,dass es wieder was taugt. Magst du alle Hater? Ja, so sieht es aus. Du kannst aber auch garnichts mehr heutzutage sagen, dass nicht sofort jemand super krass offended ist. Die Callof Duty Fans waren da schon immer gut dabei. So, das Gesinke hat schön funktioniert. Mussich sagen, gefällt mir deutlich besser als Nextcloud 13. Dann testen wir jetzt mal, wieKalender und was ist eigentlich, ach so Plugpunkt Bind, das ist das, was ich vorhin angelegthab. Das löschen wir jetzt mal. Ja, entweder du bist Fan oder Hater, dazwischen gibt esnix mehr. Das finde ich auch ein bisschen bitter ehrlich gesagt, weil, hab ich auchschon mal vor Ewigkeiten im Video gesagt, eigentlich sind die Leute, die Games oderdie wie Hater aussehen, sind oftmals die größten Fans dieses Games. Allerdings nichtso diese, ich finde alles geil Fans oder ich verteidige den Hersteller auch wenn er Scheißebaut, sondern Fans, die das Game wegen dem Game an sich spielen. Nicht weil sie den Herstellerunglaublich fanboyen wollen, sondern die sich eigentlich nichts mehr wünschen alsdass das Game was taugt. Und das sind halt auch Leute, die über Jahre hinweg, guckteuch mal an, wie viele Leute WoW abonniert haben seit Release. Und ein Großteil davonsind mittlerweile die größten Kritiker von WoW selbst. Einfach weil sie das alles mitgekriegthaben und sagen, hey, das Spiel entwickelt sich in Richtung, die wir nicht mögen. Dassind aber keine Hater, die einfach nur Hate verbreiten wollen, die wünschen sich eigentlichnichts mehr als dass ihnen das Spiel wieder gefällt. Oder dass sich das Spiel, die wünschensich nichts mehr als dass sich das Game in die Richtung entwickelt, wie sie es gernehätten. Was passiert wenn zwei Clients die gleiche Datei offline editieren und das danngesunken versuchen? Nein, dann gibt es den Konflikt. Da spackts rum. Wobei ich mir garnicht mehr sicher bin, ob man nicht auch einstellen konnte, dass der letzte gewinnt. Ich glaube,das geht auch. Ich glaube, man konnte auch einstellen, der letzte gewinnt. Auf denPrivate WoW Classic Server. Gibt es nicht bald einen WoW Classic Server? Kommt dochim August. Oder? Ist ja nicht mal lange. Doch bald. Also ich werde es auf jeden Fall spielen,allerdings wahrscheinlich nicht super intensiv und auch nicht on stream. Einfach, dass ichmit dem Fabian mal ein bisschen was habe, wo man wieder spielen kann. Falls der dannspielt. Oder ein bisschen mit dem Eaxe rumrennen oder so. Das ist auch kein Spiel für streamen.MMOs taugen zum streamen nichts. Außer man ist eine ganz passende Persönlichkeit dafürund hat auch das passende Publikum und die passende Reichweite. Ich finde es übelstlangweilig. Ich persönlich gucke es mir nicht an. Ok, dann starten wir mal Thunderbirdund gucken, wie das mit dem Kalender-Sync ist. Was ist der Kalender überhaupt? Mussich das erst noch als App aktivieren? Ah ja. Download and Enable. 123456. Super SecretPassport. Ist dann ChinaCarm angekommen? Ne, immer noch nicht. Ich hoffe mal. Ich hoffemal morgen. DHL, AliExpress, der 50er Pack USB Kabel. Die schreiben ja 8-17 Tage Versandmit DHL. Und 8 Tage sind auf jeden Fall schon rum. Ne, sind nur 50 Kabel die ich bestellthabe. Der Typ hat in der Mail irgendwie Mist geschrieben. Und ganz ehrlich, wenn mir dieChinesen 200 Kabel schicken für den Preis von 50 ist ok. Dann lege ich einfach 150auf den Dachboden und gut ist. Danke für den Follow. ReedyGermany. USB Kabel. Alsosollten die mir, ohne Mist, sollten die mir wirklich 200 USB Kabel statt 50 Kabel ausversehengeschickt haben. Dann machen wir ein USB Kabel Giveaway. Allerdings müssen wir dann guckenwie wir das machen, weil, wie der Patrick gesagt hat, die Versandkosten lohnen sichhalt nicht so. Wollte schon noch flitter raushauen, jemand nutzt dein Logo? Ne. Es gibt tatsächlichLeute die mein Logo benutzen. Wenn man Google Bilder Search macht mit meinem Keks, findestdu wirklich Leute die irgendwann mein Logo drauf haben. Ich mein, so what, gibt's fürjeden der ein bisschen größeren Channel hat. Ok, Kalender. Wo ist der Kalender? Wo istder Kalender? Ach da. Der Kalender sieht mit Darktheme irgendwie ein bisschen unfertigaus. Ok, machen wir mal einen Tests. Ok, Name ist QChat. So und in dem Kalender fügen wirjetzt mal einen Termin ein und zwar morgen von 12 bis 14 Uhr. Jetzt haben wir morgenfür den Event rumstellen. Und Dienstag haben wir einen All-Day-Event. Arbeiten. FeelsBatman.Create. Ach ja und morgen, stimmt, morgen haben wir noch ein Event. Stream. Ok. Ok,der Kalender ist immer noch Mist, man kann nix, oder kann man? Day? Kann man, kann mannicht? Hallo? Ah. Man sieht hier ist das Darktheme, das funktioniert noch nicht richtig. Ok,zack. Save. Weil macht er wahrscheinlich automatisch. Und jetzt adde ich das mal in Thunderbirdund gucke ob das Gescheit funktioniert. Wie sieht das Lighttheme aus? Achtung Leute Sonnenbrilleaufsetzen. Ja, Hydrogen Yoyo, das ist auch ziemlich ja crap, die Online Kalenderverwaltung.Und nachdem es ja kaum gescheite Cross-Platform Clients gibt, nehmen wir jetzt mal einen derhalbwegs funktioniert, nämlich Thunderbird. Thunderbird hier standardmäßig Darktheme,das kann man viel besser. Nein, ich will keinen Mail-Account absetten. Ihh, was ist das fürwas? Ihh. Das sieht, das sieht noch nicht mal aus wie Windhouse 95. Das sieht aus wieWindhouse 95, das gerne, nicht Windhouse 95, das sieht hässlich aus. Das liegt aber wahrscheinlichein bisschen an meinem, wir probieren mal was. Man kann bestimmt GTK, man kann bestimmtsagen man will das mit einem, mit einem anderen Theme starten. Thunderbird. Ah, ok, ich glaubejetzt sieht es zumindest, jetzt sieht es zumindest besser aus. Es ist zwar, ähm, brauchen wirdoch die Sonnenbrille, aber es sieht jetzt wenigstens halbwegs ok aus. Oh, wo ist dieSidebar hin? Ach da. Ok, Kalender. On Network, wir löschen den jetzt erstmal hier. Kannman nicht löschen, weil das der einzige ist, keine Ahnung. New Kalender, On Network, Next,Location. Ok, wie kann ich den Kalender von Next Cloud jetzt adden? Das ging doch so irgendwie.Next. Nickname, ja, Cute Chat heißt der Kalender. Ich muss, ich muss mich doch noch anmeldenirgendwie. Ah ja, jetzt atmen. Ok. Oder auch nicht. Cute Chat ist kaputt. Dann machen wirdas schon mal so nicht. Cute Chat. Kann man sich hier den Kalender anzeigen lassen? So,wie kriege ich, wie kriege ich mein Next Cloud Kalender in Thunderbird? Ich mein, ich könntenachgucken. Ich könnte nachgucken, aber so schwer kann das noch gar nicht sein. ECS istdas Kalender-Format unten drunter. Kennst du MindTimeAI? Nö. Kann er CalDAF? Kann erTo Do's? Ok, den gibt es schon mal von Linux, das ist gut. Kann der To Do's? Das ist daswichtige da dran. Wir könnten das mal ausprobieren. Aber erstmal müssen wir das irgendwie in Thunderbirdgeedit kriegen. On Network. Ok, du hast recht, man muss CalDAF auswählen. Eigentlich istECS unten drunter das gleiche. Location. Next. Cute Chat. Ah, Cute Chat ist da. AberCute Chat synchronisiert nicht. Warum, dieses Gefrickel immer. Warum kann das nicht einfachsinken? Ok, Google Time. Ja, ich schaue mir Sonntag an, das ist klar, aber da sagt erhier schon, dass er nicht funktioniert. Und selbst wenn ich jetzt auf morgen switche istnichts drin. Weil Cute Chat nicht sinken kann. Crap. Ok, wir machen mal was anderes. Es gibtglaube ich ein neues Plugin, was das viel, viel einfacher macht. Hab ich letztens irgendwogesehen. Also der Thunderbird Interface wird immer ekliger. Wo konnte man sich jetzt nochmaldie Plugins anzeichen lassen? Das ging doch hier rechts irgendwo. Ok, machen wir es ebenso. Wo wo sind die Addons da? Thunderbird Sync Sync Manager. Ok, ok, ok, ok, ok, ok,ok. Wo können wir uns jetzt zwischen Nextcloud und Thunderbird? Ja genau, das brauchen wirdoch. Mein Gott ist das kompliziert wieder so einen einfachen Kalender in Thunderbirdzu adden. Hoi hoi hoi hoi hoi. TP Sync Account Manager. Dann machen wir das damit. Viel besser.Das Addon habe ich auch letztens irgendwo gesehen. TP Sync. Da ist es fast leicht aneinen Kalender zu programmieren. Ja. Hat er das jetzt gemacht? Hat er gemacht. Er zeigtes mir an. Ok und wo findet man das jetzt unter TB Sync Manager? Sag mal hat Thunderbirdnicht normalerweise. Ach da ist der Knopf. Wer hat sich das denn ausgedacht den Knopfda hinzumachen? Da guckt doch kein Mensch hin. TB Sync. Add Account, Add New Account,Kalender auf Karte auf Account. GMX. Megalull. Account Name. Ach ok jetzt muss ich auch garnicht den Mist reinschreiben, sondern kann einfach sagen ich will mein Nextcloud Serversein. Account Name. Admin. Server Ull. Deader. Username. Admin. Passport. 123456. Ok. Gut.Das ist Gefrickel ey. Wo ist das Problem? Ach Moment da muss ich jetzt nicht den Serverdann muss ich jetzt wirklich den Mist von da unten reinschreiben. Ok. The fuck? Wo istdenn jetzt das Problem wieder ey? Admin 123456. Das ist mir jetzt echt zu doof ey. Not allowed.Es schreckt. Not allowed. Service an der Welpe. Ja. Sehr schön. Toll. Wie gut das funktioniert.Ich hab das ja schonmal eingerichtet, da hab ich es nicht so problematisch. Moment wasist das für eine Ull? Es ist schön dass du es konfirmst, was muss ich neintragen?Verraten sie eigentlich. Ok. Wir machen was anderes wir sagen. Manual Configuration. AccountName. Admin. Server Address. Das da. Username. Admin. Passport. Finish. Service unavailable.Oh mann. Was hat er für Schmerzen? Man weiß es nicht. Man weiß es nicht. Tja. Dann wares das mit Thunderbird. Funktioniert das wohl nicht? Also es funktioniert schon irgendwiewahrscheinlich aber wie auch immer. Also ich bilde mir ein. Ich müsste mal bei meinemAn- Ich kann jetzt leider schon mal HTTPS getestet. Nee kann ich nicht testen. Habich nicht an. Habe ich auch kein Zertifikat für. Vor allem schon mal gar kein gültigesZertifikat. Ähm. Ich kann jetzt leider nicht umloggen. Auf dem anderen Account guckenwie ich es eingerichtet habe. Ich hätte eigentlich gedacht. Dass es ziemlich einfach ist. Dassich einfach nach Kall darf. Nach Location. Vielleicht muss ich jetzt hier eingeben Q-Chatoder so. Wow. Dann nehmen wir, dann nehmen wir mal das hier. Wir nehmen mal das hier.Offline-Support brauchen wir nicht. Q-Chat. Admin. 1, 2, 3, 4, 5, 6. Jaja. Safe. Ah. Ah.Gott. Dieses rumgefrickelt. Das ist eines der Gründe wo wir es gestern von hatten.Dass das garantiert keine normalen User mit normaler Software irgendwie dazu bewegen wirdirgendwie umzusteigen oder sowas. Ich mein. Wo ist das Problem? Einen beschissenen Kalenderhinzufügen. Ich kann jetzt auch nicht mal sagen an wem es liegt. Wahrscheinlich wirdes zur Hälfte an Thunderbird und zur Hälfte an Nextcloud liegen, dass es nicht funktioniert.Aber es ist erbärmlich dass es nicht klappt. Jetzt schreckt. Probieren wir mal dieses komischeThunderbird Sync-Ding. Count. I love things. Man. Er schreibt doch sogar. Works with moston cloud Nextcloud. Admin. Cool. Nehmen wir jetzt mal die andere. Nehmen wir jetzt maldie da. Username. Admin. 1, 2, 3, 4, 5, 6. Ist ja nicht so dass es großartig kompliziertwäre. Damn. Service unavailable. Warum auch immer. Weil. Response. Response leer. Jawoll.Sehr gut. Ok. Nice. Vielleicht sollten wir lieber mal Google bemühen anstatt hier weiterum zu basteln. Probieren wir es nochmal so. Nope. Ok. Thunderbird. Add. Nextcloud. Kalender.Jetzt. Aha. Mal 16. Ok. Sollte das funktionen habe ich nichts gesagt. Sie haben es wenigstensoffiziell in ihre Seite reingeschrieben. Once you have installed. Ich will kein Addressvor ich will Kalender. Network. Wollte mich verarschen. Was das für eine beknackte Anleitung.Ok. Ah hier. Ja das ist doch das was wir verwenden. Das ist genau das was ich die ganze Zeit schonmache. Das da. On network. Kalender auswählen. Und location. Das ist genau das was ich dieganze Zeit schon mache. Ich habe noch eine Idee Leute. Ich habe noch eine Idee. Ich habenoch eine. Eine Idee habe ich noch. Network. Kalender. Location. Nein das ist im Prinzipgenau das was er hier schreibt. So und jetzt. Machen wir. Wir tragen keine Name ein. Achdas geht gar nicht. Test. Aha. Wer hat das gedacht. Es geht nicht. Ich weiß dass es prinzipiellfunktioniert. Weil ich habe das bei mir auf dem anderen Account eingerichtet. Kann dochnicht sein. Die verbreitetste Kalender Lösung die es quasi zum selbst hosten gibt. Und Thunderbirdeines der verbreitesten Mail Clients. Den es so gibt. Auch ohne HTTPS. Ich habe. Ich habeja keine HTTPS an. Das muss ohne. Ach so. Ne tatsächlich. Meine andere NetCloud Instanzläuft auf. Hat ein gültiges Zertifikat. Allerdings. Ist die Fehlermeldung dafür ganz schön beknacktsollte es wirklich am Zertifikat liegen. Die Url stimmt bestimmt. Irgendwas hier bestimmt.Ach Moment. Ich habe euch mit das nehme ich. Moment. Was ist denn das für eine Url. Dasist eine andere Url. Wo kriegt man die dann her. Moment. Ah. Da wäre ich ja nie draufgekommen. Da wäre ich ja nie drauf gekommen. Jetzt funktioniert das bestimmt auch mit demAddon. Wartet mal. Das geht jetzt bestimmt. Addons. Alter die Bedienung. Gehen wir malmit Discovery Service. Probieren wir nochmal. Ach ne. Admin. Das funktioniert immer nochnicht. Manual. Admin. Admin. Unavailable. Kalenders. Ah Moment. Wir probieren nochmalwas anderes. Mein Gott ist das eingefunnelt. Discovery. Wir sagen jetzt Admin. Das da undda machen wir Admin und QtChat hinten weg und nehmen es einfach mal so. Das Addon suckte.Ja das muss ohne Addon gehen. Weil das Addon habe ich auf meinem anderen Rechner auch nichtdrauf. New Calender. Location. Da machen wir jetzt einfach das da rein. Next. QtChat. Easy.Funktioniert. Funktioniert. Ok man muss einfach. Dann ist es gar nicht so kacke wie ich jetztgetan habe die ganze Zeit. Man muss einfach nur das finden. Ja. Wenn man das weiß istkein Problem dann gehts eigentlich. Jetzt müsste ich die To Do's eigentlich auch drinne haben.Hat es meine To Do's nicht gesüngt? Ich müsste eigentlich drei To Do's haben. Ich müssteals To Do haben. Die Sachen müsste ich eigentlich als Task haben. Ok. Test. Task. Jetzt Sync.Nervosit.Ah, ach so, ok, das ist ein anderer Kalender, das ist ein anderer Kalender, ja ok, kannman die, kann man die rüberschieben? Ne, na das geht natürlich nicht, das wäre zu,zu pro. Ok, aber dann funktioniert's, das ist, warum kann man da nichts reinschreiben?Geht. Bäh. Ah, trotzdem so schön ist die Bedienung nicht. Aber es fun- es funktionierthalbwegs, ist halbwegs. Ok, ah, gut, ahm, ein bisschen hakelig ist das Ganze schon.Und man merkt, dass der Raspberry halt nicht der schnellste ist.Ja, also ich muss sagen, mir gefällt die neue Version viel besser als 13. Wenn manweiß, wenn man weiß, wie das mit den Links funktioniert, wie man die Kalender Links kriegt,das ist an sich auch relativ einfach zu adden. Wir könnten den Kalender mal ausprobieren.Probier, wir probieren den Kalender mal aus. Gucken, wie der ist. Hab ich noch nicht getestet.Wichtig ist halt, dass er To Do's unterstützt. Wie heißt der Minetime? Ne, wir laden unsden mal hier runter. Was, E-Mail verifizieren? Ernsthaft? Das muss ich mir angucken und einmaleine Runde roffeln. Lullen muss man. App Image runterladen. Wie geht. Probier ich jetztmal. 06. Minetime. Ups. Minetime. Ey, ich kann den mal tippen. Bam. Would you like to integratehome test with you? No. Elektron. Please. Hinfort. Heutzutage braucht man für eine publischeKalenderanwendung Elektronen. Äh ja, wir haben die Euler akzeptiert. Caldav, Beta, Username,Admin. 1, 2, 3, 4, 5, 6. Server-Uhrl. Tja, jetzt wieder die Frage, was man hier nehmensoll. Ich nehme mal hier die Basic-Uhrl. Vielleicht ist das Ding so clever. Ups. Undcheck das. Easy. Was? Please enter a valid E-Mail to continue. Warum? Ernsthaft? Dasmacht überhaupt keinen Sinn. Warum soll ich da eine E-Mail verifinieren? Ist das beimir lokal gehostet? Blub blub blub blub blub blub blub blub blub blub blub blub blub.Ready to go. Q-Chat. Du bekommst einen Code, sonst kannst du nichts machen. Äh. Wie wechsleich den Tag? Doch, hier. Nice. Der gefällt mir aber auch überhaupt nicht. Manchmal, wisstihr, es kommen, es gibt Tage, wo ich mir wünsche, dass mehr Mac OS Software für Windows undLinux verfügbar wäre. Die haben ordentliche Notiz-Programme, die haben ordentliche Mail-Programme,die haben ordentliche Programme mit Call of Unterstützung. Ordentliche To-Do-Programme,also da muss man sagen, das ist schon besser. Allerdings verwende ich Mac halt nicht. Naja.So, hat dieses Ding jetzt irgendwo Sachen angelegt bei mir auf dem System? Mein Timeoder so. Config. Mein Time. Tatsächlich. Alles weg. Piss dich, Alde. Trash. Moment,was? Trash. Empty. Weg. So, wartet mal kurz.So, wieder am Start. Okay Leute, also, ähm, ich finde Nextcloud 16 macht einen ganz gutenEindruck. Also deutlich besser als 13. Die, ähm, die Zusatz-Apps, ja gut. Ja. Ich meine,es sollte basic sein, dass man in der Task-App was suchen kann. Moment, haben wir die Notiz-Appausprobiert, ob man da auch ordentlich drinne suchen kann? Weil das ging das letzte Mal,glaube ich, auch nicht richtig. Komm her. Hallo. Suche. Hallo. Moment, man kann seineNotes nicht durchsuchen. Mein Gott ey, was ist das denn? Wer soll das denn benutzen?Eine Notiz-App ohne Volltext-Suche. Okay, da gab es aber doch irgendwelche Apps dafür.Fulltext Search, Fulltext Search Booksmark, Fulltext Search Elastic, Fulltext Search Files.Und hoffe, dass es funktioniert. Settings Search. Fulltext Search. Search Platform. Ach,da muss ich zusätzlich noch Elastic installieren, oder was? Ich hab, ich hab aber gar kein ElasticSearch irgendwie auf meinem Raspberry oder so drauf. Okay, das ist wahrscheinlich, dasSetup ist wahrscheinlich die Zeit nicht wert. Okay, ich werd', ich verwende den Kram einfachweiterhin als stinknormales Dropbox-Ersatz und sonst nix. Und selbst da, weil ich habmir nämlich überlegt, der Grund, warum ich, äh, also, der Hauptgrund eigentlich, warumich mir das jetzt nochmal angucke, ist, ich hab die Auswahl zwischen Nextcloud, halt alsLösung, die ein bisschen mehr kann, nebar FileSync und Kalender, oder ich nehm SyncThingplus, ähm, ein Kalender-Server und gut ist. Wozu ich tatsächlich gerade tendiere? Kannman eigentlich jetzt hier ein TrueIo-Bild machen? Hallo MrRampage67. Gucken, vielleichtist es doch recht einfach einzurichten. Leute seid ihr noch da? Der Chat ist so ruhig.Was ist da los? Okay, geht anscheinend noch. Elastic Search. Okay, man muss, man muss,äh, Elastic Search noch zusätzlich installieren. Ne, das ist mir zu blöd. Da hab ich jetztgerade nervt drauf. Okay, und wie verwandelt man TrueIo da drinnen? Wahrscheinlich einFile anlegen, mit der richtigen Extension. Okay, super, super Beschreibung, wie manes verwendet. Aha, oben auf plus drücken, okay. Plus, Diagramm, aha, blub. Charts, Network,ja, erzeug Diagramm. Okay, das ist ganz nett, dass sie nen TrueIo-Plugin haben. Was wirdgemacht? Wir haben gerade Nextcloud installiert und ich wollte mir anschauen, ob mir jetztNextcloud 16 gefällt. Ich hab ja aktuell 13, was so ein paar Probleme hat und mir nichtso zusagt. 16 gefällt mir deutlich besser. Wobei das an vielen Stellen auch irgendwienoch so ein bisschen unstrukturiert wirkt alles. Okay, haben wir ausprobiert, ist ganzokay. Das zum testen läuft auf nem Raspberry, allerdings in Zukunft wirds auf ne x86 Kistelaufen, wenn ichs denn verwende. So wie das aktuelle, was ich hab auch. Der Raspberryist mir einfach zu lahm für sowas. Und der O-Troid, der liegt bei mir rum. Das ist jadieses kleine Ding in diesem Festplattenrahmen drinnen, der liegt auf dem Sofa hier hinten,aber da mach ichs nicht drauf. Ne, der Raspberry ist mir zu lahm für sowas. Generell ist derRaspberry eigentlich für die meisten Sachen, mit denen man viel arbeitet zu langsam. Oderhalt nicht zu langsam, aber so, dass es nervt, wenn du beim Neustarten dann irgendwie 30Sekunden warten musst, bis Home Assistant gestartet ist und sowas. Das ist blöd. MrRampagefragt, das ist ne sehr gute Frage. Der MrRampage fragt nämlich das hier. Max, weißt du eigentlich,wie man bei einem Unity Media, DS Lite, es ist übrigens DS Lite, weil es für DualsDeck steht, aber es ist, also es hat nix mit DSL in dem Fall zu tun. Anschluss von außenerreichbar werden kann. Gibt's mehrere Varianten. Über IPv6 bist du schon jetzt erreichbarvon außen, weil du ne IPv6 Adresse hast. Also, es kann sein, dass das in dem Routerirgendeine Firewall drin ist, die das blockt, aber rein adressierungstechnisch bist du mitIPv6 von draußen jetzt schon erreichbar. Möchtest du allerdings mit deiner IPv4 Adresseerreichbar sein, dann wird es etwas komplizierter, weil es so pauschal erstmal gar nicht funktioniert.Weil dein Provider tunnelt deinen kompletten IPv4 Traffic über IPv6, deswegen nennt sichdas ja auch Duals Deck Lite, über deinen kompletten IPv4 Traffic über deinen IPv6zu Unity Media. Du hast gar keine öffentliche IP, du hast ne private IPv4 Adresse, gehstzu Unity Media und Unity Media hat dann ein paar Ausgangsserver, die sich lustigerweiseAfter nennen, die du dir teilst mit, keine Ahnung, 100 Leuten oder so. Das heißt, überdiesen Weg kommst du definitiv nicht von außen an deinen Rechner zum Beispiel. Es gibtmehrere Varianten, was du machen kannst. Du kannst dir nen eigenen Tunnel bauen, du könntestdir, also du könntest dir irgendeinen Anbieter suchen, der so nen 6 zu 4 oder was auch immerTunnel macht. Einfacher dürfte es sein, du mietest dir irgendwo nen günstigen Server,der ne feste IPv4 Adresse hat oder bekommen kann und tunnelt sein Kram da drüber zu dirnach Hause. So würd ich das wahrscheinlich machen. Also als ich Unity Media hatte undsie mir das noch nicht wieder eingeschaltet haben, dass ich nen vollwertigen IPv4 Anschlusshabe, hab ich so gemacht, ich hab euch ja schon mal erzählt, ich hab bei so nem superlow budget anbieternden Server, also das waren diese 35 Dollar für ne VM auf Lebenszeit,aber leider, dass die sowas machen. Und da hab ich so gemacht, ich hab mich dorthinverbunden per SSH und dort quasi nen Port mit SSH aufgemacht, wo man dann bei mir lokalauf dem jeweiligen Dienst rausgekommen ist. Also kann man sich das vorstellen, ich habmich verbunden von mir auf den Server, der hatte ne feste IPv4 Adresse, hab dann gesagtSSH-G, also global am Port lauschen und Port weiterleiten dann auf dieser Port bei mirhin. Und dann hab ich noch nen Auto SSH drumherum gemacht, dass es das auch automatisch wiederneu aufgebaut hat. Ist im Prinzip nix anderes, wie wenn man sich nen Anbieter ansucht, dereinen Tunnel bauen kann. Ne Fritzbox alleine bringt dir nix, ne? UnityMedia muss dich auch wieder umschalten, dass du ne feste IPv4 Adresse kriegst. Also UnityMedia muss dich dafür von Dualstack Lite auf richtigen Dualstack umschalten. Oder aufIPv4 only meinetwegen, sonst bringt dir die neue Fritzbox auch nix. Also ich geb zu, dashat sich jetzt alles ein bisschen kompliziert angehört, aber es ist auch ein bisschen komplizierter.Unity Media, mit Unity Media geht das nicht, so ohne weiteres. Dass wenn du Dualstack Litehast, dass du IPv4 was bei dir weiterleitest. Ja wenn Unity Media dich damit umschaltet,dann ist wieder was anderes. Wichtig ist, dass du den Dualstack Lite Geschiss loswirrst.Dann funktioniert das. Ne dünne DNS alleine bringt dir auch nix. Wenn du IPv4 Port weiterleitenwillst und IPv4 bei dir daheim nie ankommt, dann bringt dir auch ne dünne DNS nix. Solltedas Mieten von einer Fritzbox bei Unity Media dazu führen, dass die dich von DualstackLite auf richtiges Dualstack umschalten, dann bringt das was. Wobei es schon ein bisschendoof ist, dass man für so ne Basic Funktion 5€ im Monat bezahlen soll. Ich mein ok mankriegt ne Fritzbox zu, aber weiß nicht ob ich das machen würde. Du kannst aber auchso machen wie ich. Du gehst denen einfach 2 Monate am Stück auf den Sack und dann lenkensie vielleicht ein und schalten dich frei. Weil ich hab mittlerweile wieder ne festeIPv4 Adresse oder ich hab wieder eine Public IPv4 Adresse bei Unity Media. Aber ich habdie wirklich lange genervt und auch öffentlich auf Twitter genervt, was bei mir halt auchnoch nen gewissen Nachdruck hat, wenn sich das 20.000 Leute immer sehen. Kapparot dasinteressiert die meisten Leute auf YouTube leider nicht. Ich hatte mir eigentlich vorgenommenich will dieses Jahr ein bisschen mehr Technik Krams auf YouTube machen. Aber wie gesagtihr habt gesehen wie viele YouTube Videos dieses Jahr gekommen sind. Da hielst du dirGrenzen. Ja ok wenns bei dir so einfach funktioniert, dass ich weiß ich hab die 2 Monate genervt.Ihr könnts ja auf Twitter im Prinzip nachlesen. So Leute wir sind eigentlich fertig soweit.Ich glaub ich geh jetzt Abend essen. Äh falsches E-Mail Teil. Was ist das für ein Programmmit dem Regenbogen? Lolcat ist das. Lolcat. Also das Fond, Linux Befehlsnamen. Der Fondkommt aus Toilet. So heißt das Programm. Und Lolcat macht diese Regenbogen-Geschichte.Also wir können auch sowas hier machen, sowas wie LolW. Achso und drumrum ist ne Weilschaft.Brauchst du aber nicht. Das brauchst du nur wenn du es ein bisschen schneller ausgebenwillst. Wenn du das weglässt, hast du das Problem, dass das Ding. Warte mal das macht.Ok ich dachte das macht das eigentlich schon standardmäßig endlos, aber deswegen habich wahrscheinlich mit der Schleife drumrum umgemacht, dass es das endlos macht. Ok dannschauen wir mal, wen können wir heute hosten? Wen können wir heute hosten? Filter. Äh German.Den haben wir da. Ich einfach der Erste immer in dieser Kategorie bin. Plender Modeln lernen.Super Sonntag Special Stream. Was ist das denn? Oh. Ist das was für uns Leute? Ichglaub nicht. Die ganzen Weeps hier die sind damit. Das geht nicht. Ich kanns nicht lesen.Ein bisschen kleiner Text vielleicht. Allerdings macht es mir schon mal sympathisch. Es istdot net. Der Typ den du gestern gehostet hast wohnt 10 km vom Jahr. Ich fand den Streamganz nice. Ich würde interessieren hat jemand so lange geguckt? Hat er das noch hingekriegtmit seiner Grafikkarte? Hat das noch funktioniert am Ende? Hat jemand zufällig so lange geguckt?Android App. Android App ist interessierend. Developing Semantic Release. Was? Ich weißja nicht mal was er überhaupt macht. Der hat ein Kabel abgerissen. Oh. Typescript.Warum printet er? Ach nee LSIS ist das. Es ist wirklich ein Livestream von seinem 3DPoker mit einem FPS. CS. Klar. Wir gucken mal der Gelegenheit. Was sind denn so die großendeutschen Streams? Was gibt es denn da? Ich guck ja eigentlich nix. Trimax von dem habich schon mal was gehört. Schlora von dem hab ich auch schon mal was gehört. Kenn ichnicht. Das sagt mir irgendwas. Von dem hab ich auch schon mal irgendwas gehört. Die Nigoden kenn ich. Sagt mir gar nix. Das sagt mir auch. Das ist schon mal gesehen. Take kenntman natürlich. Kenn ich nicht. Kenn ich auch nicht. Kenn ich auch nicht. Kenn ich auchnicht. Kenn ich auch nicht. Kenn ich auch nicht. Kenn ich nicht. Kenn ich? Wenigstensmal einnehmer kennt. Kenn ich nicht. Gut. Kennt man. Kenn ich nicht. Kenn ich. Guckich nicht. Sagt mir alles nix. Von dem hab ich schon mal was gehört. Von dem hab ichauch schon mal was gehört. Den kenn ich auch. Der Name sagt mir auch irgendwas. Rest kennich alle hab ich noch nie was von gehört. Ach der streamt auch. Wie viele Mädels esmittlerweile auf twitch gibt. Und alles keine boob cam Sachen gibt's. Bin ja begeistert.Dass sich da normale streams jetzt immer mehr durchsetzen. Okay ansonsten kenn ich keinenmehr. Das hast du jetzt gesagt. Keine Ahnung. Aber die kenn ich. Die hat der Fabian malgehorstet. Das hab ich schon mal gesehen. Ja gut. Ich weiß nicht wen ich horsten soll.Keine Ahnung. Fällt mir jetzt. Fällt mir jetzt nicht nix ein. Wer ist denn bei ähm.Komm mal hier discover. Wer ist denn bei wie heißt denn diese Kategorie. Es gibt auchnoch mehr als diese science and technology. Oh hier. Programming. Alter Katze was los.So. Katze. Chico komm mal her. Komm mal her. Sag dem stream mal hallo. Komm mal her.Die will nicht. Ich bin der viertgrößte weltweiser. Von der hab ich schon mal irgendwas gehört.Hab ich glaub ich mal nen konferenz vortrag oder so gesehen. Okay ähm. Ich weiß nichtwen ich horsten soll. Keine Ahnung. Da horst ich heute keinen. Wenn mir keiner einfällt.Katze willst du nicht immer dem stream hallo sagen. Kannst mal ne runde brumm ins mikrofon.Runde schnurren ins mikrofon. Ne diesem abenteuer rumgucken modus. Aber für die bessere emersionhab ich noch ein bild von der Katze bevor wir ausmachen. Da isser. So leute ich hoffeeuch hat es gefallen. Wir machen jetzt schluss. Wir sehen uns wahrscheinlich morgen wieder.Aktuell ist ja richtiger streaming streak am start. Bis denn. CU. Achso und falls ihrnoch nicht im discord seid. Könnt ihr mal im discord vorbeigucken. Kommt natürlich gerneauch auf youtube twitter und natürlich auf twitch selber folgen. Dass ihr immer sehtwenn es was neues gibt. Machts gut. Bis zum nächsten mal tschüss.", "segments": [{"id": 1, "start": 0.0, "end": 12.5, "text": "So, wieder da? Ja, okay. Ist wieder da. Und die VM geht auch. Ich hab keine Ahnung, was"}, {"id": 2, "start": 12.5, "end": 20.66, "text": "Windows wieder gedacht hat, was nicht funktioniert. Windows-Logik. Das sind so Sachen. So Probleme"}, {"id": 3, "start": 20.66, "end": 24.74, "text": "hast du unter Linux echt nicht. Im Zweifelsfall schießt du unter Linux mal was ab, nutzt dich"}, {"id": 4, "start": 24.74, "end": 38.02, "text": "mal funktionierten, startest, dann gehts wieder. Aber so ist voll der Witz. Wo du dich den ganzen"}, {"id": 5, "start": 38.02, "end": 44.2, "text": "anderen müssen auch starten. Hast du schon Discord gelesen, was ich geschafft habe, Nesebaro?"}, {"id": 6, "start": 44.2, "end": 52.96, "text": "Soll ich da jetzt reingucken und onstream? Das ist das, äh, muss man das der Welt mitteilen?"}, {"id": 7, "start": 52.96, "end": 60.74, "text": "Meinst du? Ja, gut, mach ich gleich auf. Ach im Admin-Channel, im Admin-Channel guck"}, {"id": 8, "start": 60.74, "end": 72.24, "text": "ich lieber nicht im Stream rein, wer weiß was da sonst noch so drin steht. Nix Böses,"}, {"id": 9, "start": 72.24, "end": 86.78, "text": "ah, gut, dann gucken wir rein. So, jetzt ist alles gestartet, wunderbar. Kranios. Hat"}, {"id": 10, "start": 86.78, "end": 92.06, "text": "der nur eine Reboot gebraucht? Ach ne, das Pepega-Board fehlt noch. Das ist ja eigentlich"}, {"id": 11, "start": 92.06, "end": 104.62, "text": "das, was ich starten wollte. Oh man. Darf ich, darf ich mal nen Browser verwenden, irgendwie?"}, {"id": 12, "start": 104.62, "end": 114.62, "text": "Der POG-Chat, den haben wir letztens gefunden. Gut, ähm, das hat jetzt 10 Minuten oder so"}, {"id": 13, "start": 114.62, "end": 121.98, "text": "gedauert, weil Windows der Meinung war, abzuspatten. Dann starten wir das und können jetzt anfangen,"}, {"id": 14, "start": 121.98, "end": 125.74, "text": "aber vorher muss ich noch mal in den Admin-Channel gucken, dass wir uns anschauen können, was"}, {"id": 15, "start": 125.74, "end": 140.7, "text": "da Sebaro für grandiose neue Errungenschaften, ähm, der Welt mitteilen muss. Ah, auf, starte"}, {"id": 16, "start": 140.7, "end": 149.98, "text": "mal. Go, go, go. Der Friseur muss mal mehr streamen, der streamt kaum noch. Auch wenn"}, {"id": 17, "start": 149.98, "end": 153.42, "text": "das Video nicht so mein Game ist, ich guck dem immer gerne zu, wenn er da irgendwie 8"}, {"id": 18, "start": 153.42, "end": 162.54, "text": "Stunden im Kreis grindet. Aber er streamt irgendwie so wenig. Ich hab schon ein Profil"}, {"id": 19, "start": 162.54, "end": 179.94, "text": "zum Runnen, ich brauch kein neues. So, jetzt. Gut. Ja, der Windows Neustart hat mich über"}, {"id": 20, "start": 179.94, "end": 184.06, "text": "ein bisschen durcheinander gebracht. Ok, gucken wir mal ins Discord. Also, was gibt's denn"}, {"id": 21, "start": 184.06, "end": 189.46, "text": "da Neues? Übrigens, ähm, wer den Link noch nicht hat, Ausrufezeichen Discord. Gibt's"}, {"id": 22, "start": 189.46, "end": 197.22, "text": "einen Invite-Link. Yo, Max, lohnt sich ein Upgrade von einer 150 TI auf eine 1660 TI."}, {"id": 23, "start": 197.22, "end": 200.98, "text": "Also, ich denk mal, dass der schon ordentlich Leistung bringen wird. Ich kenn jetzt keine"}, {"id": 24, "start": 200.98, "end": 206.66, "text": "Benchmarks, können wir gleich mal gucken. E-Mathmen-Channel. Und du meinst, Sebaro,"}, {"id": 25, "start": 206.66, "end": 221.14, "text": "ich kann da reingucken, ohne dass da jetzt was Schlimmes drin steht, ja? Ok. Und jetzt?"}, {"id": 26, "start": 221.14, "end": 245.7, "text": "Du hast LXD-Container eingerichtet. Max, wie machst du noch mal deine VMs in Linux?"}, {"id": 27, "start": 245.7, "end": 261.42, "text": "Das ist LXD. Das benutzt standardmäßig alle Cores. Hä? Kannst du mal kurz mein Profil"}, {"id": 28, "start": 261.42, "end": 265.1, "text": "sein? Nee, kann ich nicht, weil ich nicht eingeloggt bin in Steam hier auf dem, auf"}, {"id": 29, "start": 265.1, "end": 282.06, "text": "dem Account. Ich kann's aber nachher machen, wenn du willst. Du hast viele Benachrichtigungen"}, {"id": 30, "start": 282.06, "end": 285.66, "text": "beim Discord. Ja, weil ich, äh, ich setz' die nie auf gelesen. Ich lass' die immer"}, {"id": 31, "start": 285.66, "end": 291.9, "text": "einfach laufen. So, ähm, im Prinzip könnte man den ganzen Kram von gestern mal löschen."}, {"id": 32, "start": 291.9, "end": 312.06, "text": "Ja, dann ein leeres Pipiga-Board haben. Gut. Ja, nice, nice, nice Sebaro. Das, äh, ist"}, {"id": 33, "start": 312.06, "end": 316.98, "text": "glaub' ich gar nicht so schwierig da, äh, Multi-Cores drinnen zu verwenden. Ich glaub',"}, {"id": 34, "start": 316.98, "end": 326.34, "text": "es macht sogar standardmäßig schon. So, also, nachdem wir ja gestern nicht zu der Geschichte"}, {"id": 35, "start": 326.34, "end": 332.46, "text": "mit Nextcloud gekommen sind, machen wir das heute. Und das ist auch der Grund, warum ich"}, {"id": 36, "start": 332.46, "end": 336.78, "text": "unbedingt mal ein Linux-VM brauche, weil ohne die Linux-VM funktioniert das Ganze natürlich"}, {"id": 37, "start": 336.78, "end": 341.22, "text": "nicht. Ähm, jetzt muss ich erstmal gucken, ob ich meinen Raspberry schon am Strom dran"}, {"id": 38, "start": 341.22, "end": 348.58, "text": "hab' von gestern noch. Oder nicht. Nein, der hängt hier, der hängt hier neben rum,"}, {"id": 39, "start": 348.58, "end": 352.78, "text": "aber ist nicht am Stromstrand, Stromblub, Strom dran. Muss ich erst mal anschließen."}, {"id": 40, "start": 352.78, "end": 366.94, "text": "Warum steckt man USB immer falsch rum ein? So, jetzt. Heute geht das Roasten weiter."}, {"id": 41, "start": 366.94, "end": 371.62, "text": "Wollen wir heute dann zum Schluss noch mal ein paar Stellenanzeigen angucken, ob wir"}, {"id": 42, "start": 371.62, "end": 380.06, "text": "wieder ein bisschen was zum Flamen finden. Da war ja gestern, also ich muss sagen, die"}, {"id": 43, "start": 380.06, "end": 386.26, "text": "erste Stellenanzeige, die wir gesehen haben, die war echt okay, der Rest war ziemlicher"}, {"id": 44, "start": 386.26, "end": 400.14, "text": "Blödsinn. So, da ist er. Ähm, ich hole mal eine SSD und stöpsel die an den Raspberry"}, {"id": 45, "start": 400.14, "end": 413.1, "text": "dran. Eats SSD Eats Life. Oh nee, der bricht das schlecht um. Ich hole mal kurz eine SSD"}, {"id": 46, "start": 413.1, "end": 417.06, "text": "und stöpsel die an, dass wir das nachher auch ordentlich testen können. Weil, mit der"}, {"id": 47, "start": 417.06, "end": 443.46, "text": "On-Board im MicroSD-Karte ist für'n Arsch. Da habe ich hier meinen Shima USB 3 auf SATA-Adapter."}, {"id": 48, "start": 443.46, "end": 464.66, "text": "Für die Testwerke reicht der. Wie willst du was falsch einstecken? Nee, gar nicht."}, {"id": 49, "start": 464.66, "end": 473.78, "text": "Man hat immer USB falsch rum. Ich hab das immer falsch rum am ersten Versuch. Okay,"}, {"id": 50, "start": 473.78, "end": 488.26, "text": "haben die ne schöne Anleitung dazu? Ähm, also Sebaro, wenn du mit LXC alle Cores auslassen"}, {"id": 51, "start": 488.26, "end": 492.18, "text": "kannst, dann müsstest du direkt auf dem Server auch alle Cores auslassen können. Oder meinst"}, {"id": 52, "start": 492.18, "end": 502.5, "text": "du, weil du so mehrere Sachen parallel laufen lassen kannst. So, den USB-C-Porn, den USB-C-Porn,"}, {"id": 53, "start": 502.5, "end": 507.86, "text": "da haben sie ja immer was Gescheites gemacht, ja. Den kannst du so rum und so rum einstecken,"}, {"id": 54, "start": 507.86, "end": 518.06, "text": "das ist doch mal was. Bei waagrechten Steckplätzen muss das Loch des Steckers immer raus, kann"}, {"id": 55, "start": 518.06, "end": 522.78, "text": "man sagen, also sind keine waagrechten Steckplätze an meinem Gehäuse und ich guck mir die Stecker"}, {"id": 56, "start": 522.78, "end": 527.58, "text": "immer nicht an. Es geht fast schneller, einfach immer rumdrehen und meistens ist es ja bei"}, {"id": 57, "start": 527.58, "end": 532.94, "text": "USB so, erster Versuch passt nicht, zweiter Versuch passt nicht, dritter Versuch, erster"}, {"id": 58, "start": 532.94, "end": 542.38, "text": "Versuch hätte doch gepasst. Ja, das kannst du machen Sebaro. Du kannst aber einfach auf"}, {"id": 59, "start": 542.38, "end": 548.94, "text": "dem Host mehrere Sachen starten. So, haben die eine offizielle Anleitung für Debian,"}, {"id": 60, "start": 548.94, "end": 554.42, "text": "wie man das installiert, weil die Sache ist die, man braucht bestimmt zig PHP-Abhängigkeiten"}, {"id": 61, "start": 554.42, "end": 562.86, "text": "und da müssen wir erstmal gucken, welche das sind. Macht's überhaupt Bock nur für"}, {"id": 62, "start": 562.86, "end": 573.38, "text": "162, das wäre noch ein bisschen mehr klein. Meistens sind da so, haben wir dann so meistens"}, {"id": 63, "start": 573.38, "end": 591.58, "text": "so 100 bis 150 in dem Dreh. Haben die irgendwie eine ordentliche Anleitung? Nee, haben die"}, {"id": 64, "start": 591.58, "end": 599.3, "text": "nicht, oder? Download Server, ja schön. Gibt es denn vielleicht ein, gibt es schon ein fertiges"}, {"id": 65, "start": 599.3, "end": 604.22, "text": "Raspbian Xcloud Repo? Vielleicht brauchen wir das dann gar nicht, dann macht das das"}, {"id": 66, "start": 604.22, "end": 614.86, "text": "alles für mich. Criga, hat nichts mit dem Krieger zu tun, glaube ich. Lies sich aber"}, {"id": 67, "start": 614.86, "end": 631.54, "text": "ähnlich. Install Engineings, also wir machen das weder mit Redis noch mit MariaDB, wir machen"}, {"id": 68, "start": 631.54, "end": 642.94, "text": "das mit einem SQLite Server zum Testen. Braucht man überhaupt einen externen Web Service,"}, {"id": 69, "start": 642.94, "end": 647.5, "text": "Web Server für Nextcloud, haben die nicht? Irgendso einen Dev Server mit dabei, den man"}, {"id": 70, "start": 673.06, "end": 683.42, "text": "Windows. Gibt es Leute, die betreiben das auf Windows? Sachen gibt's. Machen das wirklich"}, {"id": 71, "start": 683.42, "end": 692.1, "text": "Leute, ja? Install via Snap, das könnten wir tatsächlich machen. Das ist easy as fucke"}, {"id": 72, "start": 692.1, "end": 695.26, "text": "mit Snap zu installieren, aber wenn wir es mit Snap installieren, könnten wir es auch"}, {"id": 73, "start": 695.26, "end": 700.62, "text": "gleich als Docker Package installieren. Example Installation, ich will das irgendwann von"}, {"id": 74, "start": 700.62, "end": 720.74, "text": "Hand draufhauen. Es gibt ein fertiges Steam Account Signing. Ja doch, wie gesagt, ich"}, {"id": 75, "start": 720.74, "end": 727.94, "text": "kann es jetzt hier auf dem Stream nicht machen, aber ich mach das. Am besten ist, ihr schreibt"}, {"id": 76, "start": 727.94, "end": 736.26, "text": "das irgendwo auf dem Discord. Ich weiß ja nicht genau wo, ob wir da vielleicht mal im"}, {"id": 77, "start": 736.26, "end": 740.34, "text": "Discord für sowas einen eigenen Channel machen. Also ich kann das schon prinzipiell machen,"}, {"id": 78, "start": 740.34, "end": 744.1, "text": "aber wir müssen es irgendwo speichern. Vielleicht machen wir das im Discord. Vielleicht machen"}, {"id": 79, "start": 744.1, "end": 748.26, "text": "wir im Discord einen eigenen Channel für sowas. Da könnt ihr das rein posten und dann kann"}, {"id": 80, "start": 748.26, "end": 764.58, "text": "ich das machen. Warum werden Server denn auf Linux gehostet? Also mal ganz pauschal gesagt,"}, {"id": 81, "start": 764.58, "end": 772.78, "text": "würde ich sagen, zum größten Teil, weil es erstens umsonst ist, zweitens viel mehr"}, {"id": 82, "start": 772.78, "end": 785.42, "text": "Auswahl hat an Server-Anwendungen, die was taugen, weil die Administration remote deutlich"}, {"id": 83, "start": 785.42, "end": 791.5, "text": "einfacher ist, weil man das besser automatisieren kann, weil es open source ist, was ja auch"}, {"id": 84, "start": 791.5, "end": 798.3, "text": "ein gewisser Faktor ist, wenn es um Security-Geschichten geht, und weil so ziemlich jeder 0815 Service"}, {"id": 85, "start": 798.3, "end": 803.7, "text": "im Internet auf Linux läuft. Also man hat einfach auch die Leute, die sich damit auskennen."}, {"id": 86, "start": 803.7, "end": 813.46, "text": "Wenn man Sachen unter Windows hostet, dann macht man das meistens nur, wenn es eine"}, {"id": 87, "start": 813.46, "end": 818.18, "text": "Sache ist, die es exklusiv für Windows gibt, oder als halt eine Support-Geschichte ist für"}, {"id": 88, "start": 818.18, "end": 822.82, "text": "Windows-Clients. Also sprich, wenn man sagt, man hat 50 Windows-Clients und will einen"}, {"id": 89, "start": 822.82, "end": 829.78, "text": "Active Directory haben oder sowas, dann, aber das ist was, da kann es mich nichts zu fragen,"}, {"id": 90, "start": 829.78, "end": 836.66, "text": "weil von Windows habe ich keine Ahnung, und dann nimmt man sich halt auch einen Windows-Server"}, {"id": 91, "start": 836.66, "end": 840.46, "text": "und macht da AD drauf, weil ich meine, man kann zwar AD auch mit Samba machen, aber ich"}, {"id": 92, "start": 840.46, "end": 843.26, "text": "glaube jemand, der ernsthaft einen AD betreiben will, macht das nicht mit Samba, dann macht"}, {"id": 93, "start": 843.26, "end": 847.66, "text": "das mit einem Windows-Server. Zumindest würde ich das so machen. Allerdings würde ich"}, {"id": 94, "start": 847.66, "end": 854.3, "text": "keine AD betreiben und kein Windows-Server, aber es ist was anderes. So, also, Demian-Packages."}, {"id": 95, "start": 854.3, "end": 864.38, "text": "All you can use that package to install... Ah ja, hier steht es doch, was man braucht."}, {"id": 96, "start": 864.38, "end": 874.14, "text": "Wir gucken uns lieber die Anleitung von dem Typ an mit Nginx, das wäre lieber. Ich bin"}, {"id": 97, "start": 874.14, "end": 887.58, "text": "kein großartiger Apache-Fan. Was macht der denn hier? MariaDB lassen wir weg. Nginx-Config"}, {"id": 98, "start": 887.58, "end": 899.26, "text": "scheint mir ziemlich übertrieben zu sein. Machen wir mal die offizielle Anleitung, wir"}, {"id": 99, "start": 899.26, "end": 909.3, "text": "können das ja immer noch ändern. Wo waren wir gerade? Da. Also Maria, lassen wir weg."}, {"id": 100, "start": 909.3, "end": 915.98, "text": "Also, das brauchen wir alles. Ohne MariaDB. Ich hoffe die Option, dass man das mit sqlite"}, {"id": 101, "start": 915.98, "end": 942.66, "text": "laufen lassen kann, gibt es noch. Wie unser Discord in Whitelink, der geht nicht auf den"}, {"id": 102, "start": 942.66, "end": 948.82, "text": "Weep-Channel, der geht auf die Eingangshalle. Oder? Ihr müsstet eigentlich automatisch"}, {"id": 103, "start": 948.82, "end": 952.26, "text": "in die Eingangshalle kommen, wenn man automatisch in den Weep-Channel kommt, dann wundert es"}, {"id": 104, "start": 952.26, "end": 960.42, "text": "mich nicht, dass die Leute direkt wieder rausgehen. Oh, aus dem Ball-Roll. Jaja, das musste ändern."}, {"id": 105, "start": 960.42, "end": 977.14, "text": "Geht auf den Weep-Channel. Geil. Nein, so war das glaub ich nicht gedacht. Ist in xcloud"}, {"id": 106, "start": 977.14, "end": 992.02, "text": "16 eigentlich schon Produkt, ja. Also das ist rausgekommen schon vor 3 Monaten oder so."}, {"id": 107, "start": 992.02, "end": 1006.9, "text": "Das kam sogar schon am 25.04. raus. Jetzt sollte es richtig, ja. Oh, der Created noch"}, {"id": 108, "start": 1006.9, "end": 1015.82, "text": "Dinger im Hintergrund, ok. Wir sollten mal, wir sollten mal die SSD ein File-System drauf"}, {"id": 109, "start": 1015.82, "end": 1032.94, "text": "machen. Ich gerade angeschlossen, mal gucken, ob der Respirator die erkennt. Wurde der Web-Based-Updater"}, {"id": 110, "start": 1032.94, "end": 1037.58, "text": "wieder rausgeholt? Hoffentlich nicht. Nextcloud war schon, oder generell auch damals bei Oncloud"}, {"id": 111, "start": 1037.58, "end": 1042.9, "text": "war das immer so ein Acti-Sache zu updaten. Und sie hätten ja die Chance gehabt, mal"}, {"id": 112, "start": 1042.9, "end": 1046.94, "text": "ein ordentliches Docker-Image zu machen damals, aber irgendwie hatten sie ein Docker-Image,"}, {"id": 113, "start": 1046.94, "end": 1060.46, "text": "was man selbst nicht updaten kann, was ja eigentlich so... Was jetzt? Achso, ich glaube,"}, {"id": 114, "start": 1060.46, "end": 1069.26, "text": "das liegt daran, weil wir schon, weil wir schon Nginx drauf installiert haben. Wir installieren"}, {"id": 115, "start": 1069.26, "end": 1092.7, "text": "mal kurz. Und dann geht der Apache wahrscheinlich auch. Dann bin ich mal gespannt, was sich"}, {"id": 116, "start": 1092.7, "end": 1100.14, "text": "da in 3 Versionen alles getan hat. Wie gesagt, ich habe bei mir ja noch 13 drauf. Und das"}, {"id": 117, "start": 1100.14, "end": 1108.46, "text": "hat mir nicht so gut gefallen. Vor allem, weil der Sync rumgebackt hat oftmals. Ich"}, {"id": 118, "start": 1108.46, "end": 1114.18, "text": "hatte relativ oft, obwohl mehr als 5 Minuten Zeit waren, wo ich die Dateien abgerufen"}, {"id": 119, "start": 1114.18, "end": 1122.86, "text": "habe, habe ich dann irgendwelche Sync-Konflikte gekriegt und sowas. War sehr merkwürdig."}, {"id": 120, "start": 1122.86, "end": 1135.86, "text": "Was? Nein. The Game im Discord ist... Ich meine anderes. Das bin ich nicht. Sync-Konflikte"}, {"id": 121, "start": 1135.86, "end": 1141.7, "text": "Bild-Dios? Nee. Sync-Konflikte bei meinen Plain-Text-Notizen hat da rumgespackt, wo"}, {"id": 122, "start": 1141.7, "end": 1145.94, "text": "ich mir gedacht habe, das ist so ziemlich der simpelste Fall, den man irgendwie haben"}, {"id": 123, "start": 1145.94, "end": 1162.62, "text": "kann, Plain-Text-Notiz zu sünden. Da kann es eigentlich keine Probleme geben. Viel einfacher"}, {"id": 124, "start": 1162.62, "end": 1182.06, "text": "geht es ja nicht. The Poplar ist am Start. Ich finde das interessant, wenn man auf Science"}, {"id": 125, "start": 1182.06, "end": 1190.18, "text": "and Technology stellt, den die Kategorie... Also im Vergleich zu... Im Prinzip gibt es"}, {"id": 126, "start": 1190.18, "end": 1196.42, "text": "ja nur zwei Kategorie, die du machen kannst. Science and Technology oder Just Chatting."}, {"id": 127, "start": 1196.42, "end": 1202.58, "text": "Just Chatting hast du viel mehr random Leute, die dem Stream dann so über den Weg laufen."}, {"id": 128, "start": 1202.58, "end": 1214.7, "text": "Und im Durchschnitt hast du in Just Chatting auch deutlich mehr Views. Allerdings hat man"}, {"id": 129, "start": 1214.7, "end": 1219.54, "text": "in Science and Technology hat man zwar weniger Views, allerdings nach einem Stream mehr neue"}, {"id": 130, "start": 1219.54, "end": 1225.74, "text": "Follower. Das ist interessant, ja. Wahrscheinlich weil in die Kategorie auch Leute gucken,"}, {"id": 131, "start": 1225.74, "end": 1229.7, "text": "die es interessiert und die andere nur Leute, die mal vorbeikommen und dann ein bisschen"}, {"id": 132, "start": 1229.7, "end": 1237.86, "text": "gucken. Ist nicht... Merkwürdig. Man wird eigentlich davon ausgehen, dass die Kategorie,"}, {"id": 133, "start": 1237.86, "end": 1242.98, "text": "wo man im Durchschnitt auch die meisten Zuschauer kriegt, dann auch unterm Strich dann das meiste"}, {"id": 134, "start": 1242.98, "end": 1253.9, "text": "gibt, aber anscheinend nicht. Warum gibt es keinen Pokchamp in Dynamis? Das gibt es doch."}, {"id": 135, "start": 1253.9, "end": 1274.3, "text": "Es gibt doch eh so ein paar Main Viewer. Ja, es gibt Leute, die sind immer am Start, das"}, {"id": 136, "start": 1274.3, "end": 1284.62, "text": "gibt es auch. Oder hatte ich das jetzt schon? Installs, the packages, blablabla. Now download"}, {"id": 137, "start": 1284.62, "end": 1292.98, "text": "Archive Nextcloud Version, go to blablabla, blablabla. Gut, machen wir gleich. Erstmal"}, {"id": 138, "start": 1292.98, "end": 1301.7, "text": "müssen wir die Festplatte formatieren, also die SSD. Und wir müssen mal gucken, ob wir"}, {"id": 139, "start": 1301.7, "end": 1310.22, "text": "den Apache... Wie heißt er unter Debian? Apache? Apache 2? Aha, ok. Schauen wir mal,"}, {"id": 140, "start": 1310.22, "end": 1321.14, "text": "ob die Webseite prinzipiell funktioniert. It works. Sehr schön. Ok, die Nextcloud machen"}, {"id": 141, "start": 1321.14, "end": 1330.9, "text": "wir allerdings auf die SSD drauf, weil ich habe jetzt auch keine Lust beim Testen meiner"}, {"id": 142, "start": 1330.9, "end": 1336.14, "text": "Micro SD Karte Aschen wie kaputt zu machen. Zeig mal, was haben wir denn hier für eine"}, {"id": 143, "start": 1336.14, "end": 1362.02, "text": "SSD? Da, da ist sie. Ja, DEV SDA. Dann haben wir noch MKFS, AXE. Ach komm, wir machen XFS"}, {"id": 144, "start": 1362.02, "end": 1374.86, "text": "an. Wow, Raspberry, was ist los? Another Voltage detected. Das sieht es auf jeden Fall"}, {"id": 145, "start": 1374.86, "end": 1382.82, "text": "nicht so gut. Vielleicht sollte ich den Raspberry mal direkt an die Steckdose, also direkt mit"}, {"id": 146, "start": 1382.82, "end": 1393.58, "text": "einem Spin-Netzteil an die Steckdose anstöpseln, anstatt es an den Rechner zu hängen. Egal,"}, {"id": 147, "start": 1393.58, "end": 1407.94, "text": "solange er nicht abkackt, wird das schon verkraften. 100 Grad, wo hast du das jetzt gelesen? VC,"}, {"id": 148, "start": 1407.94, "end": 1417.06, "text": "53 Grad ist er. Das ist beim Raspberry Pi 4 gar nicht so abwegig, das Ding wird ja heiß"}, {"id": 149, "start": 1417.06, "end": 1423.22, "text": "ohne Ende. Wir hatten es ja mal ausprobiert, auf wie viel haben wir es gekriegt? 86 Grad"}, {"id": 150, "start": 1423.22, "end": 1438.54, "text": "oder so? Ohne Lüfter? Also ohne Kühlkörper und ich glaube, 81 Grad mit Kühlkörper oder"}, {"id": 151, "start": 1438.54, "end": 1450.66, "text": "sowas. Also das Ding ist richtig warm geworden. Huge warm ist das. Massive warm. Ich werde"}, {"id": 152, "start": 1450.66, "end": 1453.9, "text": "jetzt einmal die Nextcloud-Geschichte hier auspacken und gucken, ob es so prinzipiell"}, {"id": 153, "start": 1453.9, "end": 1464.3, "text": "funktioniert. Und dann installieren wir das nochmal neu auf die SSD. Muss ich achte Check"}, {"id": 154, "start": 1464.3, "end": 1482.14, "text": "oder brauche eine Check-Summe? Gut, einfach anzippen hier drinnen und gut ist. Zack. Boah,"}, {"id": 155, "start": 1482.14, "end": 1495.66, "text": "der anzippt sich aber ganz schön ab. Hätte ich doch nicht auf der MicroSD gerade anzippen"}, {"id": 156, "start": 1495.66, "end": 1505.06, "text": "sollen. Es gibt eine fertige Manjaro-Version mit i3, ist das eine andere als deine? Ja,"}, {"id": 157, "start": 1505.06, "end": 1509.86, "text": "ich habe die minimalen Installationen, die minimalen Netinstall-Versionen und habe den"}, {"id": 158, "start": 1509.86, "end": 1532.1, "text": "Rahmen selbst eingerichtet, ja. Ok, slash, Nextcloud. Ui, was? But why? Haha, jetzt kommen"}, {"id": 159, "start": 1532.1, "end": 1539.66, "text": "tolle Apache-Debug-Geschichten. Habe ich irgendwas vergessen zu machen? Das ist immer"}, {"id": 160, "start": 1539.66, "end": 1549.62, "text": "so. Beste. Datei-Berechtigung, ja wahrscheinlich. Irgendwie sowas. Irgendwie sowas. Ich denke"}, {"id": 161, "start": 1549.62, "end": 1557.9, "text": "mal, das muss WWW-Data gehören und nicht root. WWW-Data, wobei ist das auch überhaupt"}, {"id": 162, "start": 1557.9, "end": 1579.66, "text": "unter Raspian so? Wahrscheinlich. Wir gucken mal, als was läuft in der Web-Server. WWW-Data,"}, {"id": 163, "start": 1579.66, "end": 1600.86, "text": "ok, dann ergibt das Sinn. Ja, ja. Bam. Nochmal. Jetzt gehts wahrscheinlich. Ey. Only my SQL"}, {"id": 164, "start": 1600.86, "end": 1605.86, "text": "is available. Moment, ich will nicht mal SQL, ich will SQLite. Da muss man wahrscheinlich"}, {"id": 165, "start": 1605.86, "end": 1615.26, "text": "SQLite Zeug installieren. SQLite. Wie heißt die Pakete, die man da installieren muss?"}, {"id": 166, "start": 1615.26, "end": 1631.26, "text": "SQLite, PHP, wir suchen einfach mal. SQLite, was gibt es denn da alles? Gibt es eigentlich"}, {"id": 167, "start": 1631.26, "end": 1637.42, "text": "ein Eats-Tool, mit dem man mit ein paar Klicks, ein simple Web-Server, Web-Server. Ich kann"}, {"id": 168, "start": 1637.42, "end": 1640.66, "text": "es nicht richtig vorlesen, aber ich kann dir die Frage beantworten. Ja, gibt es. Total"}, {"id": 169, "start": 1640.66, "end": 1647.42, "text": "easy. Du kannst einfach sagen. Fuck, ich hab's nicht mehr in der History. Du kannst mit"}, {"id": 170, "start": 1647.42, "end": 1659.26, "text": "Python mit einer Zeile, kannst den Web-Server starten. Das ist total einfach. Simple HTTP."}, {"id": 171, "start": 1659.26, "end": 1671.26, "text": "Genau. Ja, so. Ach so. Also mal angenommen, hier bist du jetzt in dem Ordner drin und"}, {"id": 172, "start": 1671.26, "end": 1679.3, "text": "willst einfach alle Dateien zur Verfügung stellen, die... Bin ich jetzt bescheuert?"}, {"id": 173, "start": 1679.3, "end": 1687.7, "text": "Ach so, ok. Gehst einfach rein, führst das aus und schon hast du einen Web-Server auf"}, {"id": 174, "start": 1687.7, "end": 1694.02, "text": "Port 80 laufen, auf Port 8000 laufen. Zack, hast du hier alle Dateien. Das ist halt sehr"}, {"id": 175, "start": 1694.02, "end": 1701.22, "text": "rudimentär und simple, aber für statisches HTML reicht das voll und ganz aus. So, und"}, {"id": 176, "start": 1701.22, "end": 1709.46, "text": "wie sah die Python 3-Variante aus? Sehr Overflow. Ah ja, ok, die Python 3-Variante"}, {"id": 177, "start": 1709.46, "end": 1721.14, "text": "ist das hier. Würde ich bevorzugen. Wow. Oder auch nicht. Ach so, der Punkt kommt ja"}, {"id": 178, "start": 1721.14, "end": 1730.66, "text": "dahinter. So. Oder auch nicht. Lassen wir den Punkt einfach mal weg. Ok, so geht's auch."}, {"id": 179, "start": 1730.66, "end": 1738.7, "text": "Das ist super einfach und so Sachen gibt's für fast alle Sprachen, die irgendwie dabei"}, {"id": 180, "start": 1738.7, "end": 1744.22, "text": "sind. Also Rubidrubi kannst du sowas machen, mit PAP kannst du sowas machen, so ein einfach"}, {"id": 181, "start": 1744.22, "end": 1752.02, "text": "ganz... Node kannst du auch einfach in den Server starten. Aber ich finde die Python-Sache"}, {"id": 182, "start": 1752.02, "end": 1755.02, "text": "ist am einfachsten, weil man kann sich eigentlich ganz gut merken, also wahrscheinlich kann"}, {"id": 183, "start": 1755.02, "end": 1760.54, "text": "sich das jeder merken außer... Außer ich, dass man einfach sagen muss, minus M-HTTP-Server"}, {"id": 184, "start": 1760.54, "end": 1765.58, "text": "und gut ist. Ich mein, viel kürzer und aussagekräftiger kann's eigentlich nicht sein in statischen"}, {"id": 185, "start": 1765.58, "end": 1781.78, "text": "HTTPS-Server aufzumachen, der in dem Ordner statisches HTML Zeug surft. Ok, SQLite, PAP,"}, {"id": 186, "start": 1781.78, "end": 1796.18, "text": "was muss ich denn da alles installieren für, was funktioniert? Oh man, bruh. Abinstall,"}, {"id": 187, "start": 1796.18, "end": 1806.98, "text": "hier, PHP, PHP, SQLite. Wartet mal Leute, hab... Ich hab übelst Mist installiert, warum"}, {"id": 188, "start": 1806.98, "end": 1814.86, "text": "hab ich denn hart... Siehste, deswegen copy-pastet man keine Tutorials. Warum hab ich PHP 7.2"}, {"id": 189, "start": 1814.86, "end": 1821.18, "text": "installiert, warum hab ich nicht einfach normal PHP installiert, ohne so eine Versionsangabe"}, {"id": 190, "start": 1821.18, "end": 1828.18, "text": "dabei, ist doch total beknackt. Einfach so, dass das Meta-Package installieren und dann"}, {"id": 191, "start": 1828.18, "end": 1832.98, "text": "nimmt er halt das, was am aktuellsten ist. Ist der Tutorial klicken, ist nicht immer"}, {"id": 192, "start": 1832.98, "end": 1840.9, "text": "das Richtige. Jetzt muss ich auch zur PAP-Version passende MySQL installieren, äh, SQLite installieren."}, {"id": 193, "start": 1840.9, "end": 1847.82, "text": "So, und dann reloaden wir und hoffen, dass das Ding gecheckt hat, dass wir auch SQLite"}, {"id": 194, "start": 1847.82, "end": 1852.94, "text": "haben. Ne, da muss man wahrscheinlich, vielleicht muss man Apache restarten, dass er das kapiert,"}, {"id": 195, "start": 1852.94, "end": 1874.1, "text": "oder? Wey! SQLite, jawoll. Also, Username, Admin, Passwort 123456. Also, äh, Massive"}, {"id": 196, "start": 1874.1, "end": 1890.5, "text": "secure Passwort. Very weak. Das glaubt ja auch nur der Installer. Ah, hier kann man"}, {"id": 197, "start": 1890.5, "end": 1897.38, "text": "das Datadirectory ändern. Das ändern wir mal, wobei das Datadirectory muss wahrscheinlich"}, {"id": 198, "start": 1897.38, "end": 1907.78, "text": "unterhalb. Das probieren wir mal aus. Das probieren wir jetzt mal aus. Ähm, wir haben,"}, {"id": 199, "start": 1907.78, "end": 1918.5, "text": "wir haben die SSD, haben wir formatiert, das passt. Wir mounten die jetzt mal. Dev-Sda-Sort."}, {"id": 200, "start": 1918.5, "end": 1928.26, "text": "Gucken wir mal rein, er dürfte außer Lost and Found, ah ne, noch nicht mal. Ist ja ein"}, {"id": 201, "start": 1928.26, "end": 1934.5, "text": "XFS. Okay, dann, dann lassen wir das jetzt einfach mal da reinhauen. Wahrscheinlich müssen"}, {"id": 202, "start": 1934.5, "end": 1942.82, "text": "wir die Berechtigung noch anpassen. Haben wir für Berechtigung. Root, Root, ja, okay,"}, {"id": 203, "start": 1942.82, "end": 1949.82, "text": "das geht nicht. Dann, dann ändern wir das mal. Wobei, wir machen, wir machen, ey, scheiß"}, {"id": 204, "start": 1949.82, "end": 1963.02, "text": "drauf. Jetzt zum Ausprobieren. So, slash, MNT, ähm, finish. Dann speicher, dann nehm"}, {"id": 205, "start": 1963.02, "end": 1967.58, "text": "ich meine Sachen, die ich gleich zum Testen mal sünke. Speicher, dann nehm ich wenigstens"}, {"id": 206, "start": 1967.58, "end": 1978.98, "text": "gleich auf der SSD. Und, dann kriegt meine Micro SD-Karte nicht so viel ab. Was macht"}, {"id": 207, "start": 1978.98, "end": 1992.98, "text": "der da eigentlich gerade? Dinge macht er. Er macht 100% CPU-Dinge. Dann lassen wir immer"}, {"id": 208, "start": 1992.98, "end": 1998.14, "text": "Dinge machen in der Zwischzeit. Gucken wir mal zu, ne. Aber es bleibt mir nix anderes"}, {"id": 209, "start": 1998.14, "end": 2018.82, "text": "übrig. Die Musik passt auch voll dazu. Resident-Sleeper-Musik. Brauchen wir eigentlich was anderes. Sweet Jazz."}, {"id": 210, "start": 2018.82, "end": 2045.46, "text": "Ohje, das ist, das ist bestimmt Fahrstuhl. Das ist Fahrstuhl. Woop, woop, woop."}, {"id": 211, "start": 2045.46, "end": 2061.66, "text": "Overwatch-Summer-Music. Ich kenn bloß noch, ich kenn bloß noch die Overwatch-Weihnachts-Musik."}, {"id": 212, "start": 2061.66, "end": 2075.9, "text": "Ohja, genau. Äh, welcher Browser ist das hier? Das ist ganz normal. Chromium, Chromium ist"}, {"id": 213, "start": 2075.9, "end": 2083.54, "text": "es. Ich hab so viele Browser installiert. Den fällt auch nix mal ein, oder? Im Prinzip"}, {"id": 214, "start": 2083.54, "end": 2093.54, "text": "machen sie gefühlt seit, seit 3 Jahren. Und wann kamen Overwatch raus? 2017. Den gleichen"}, {"id": 215, "start": 2093.54, "end": 2099.82, "text": "Kram. Wir brauchen Anime-Chills. Selbst die Baro Nu vielleicht. Aber, dass wir das brauchen,"}, {"id": 216, "start": 2099.82, "end": 2108.62, "text": "habe ich immer eine Zweifel. Okay, es ist anscheinend ist installt. Save form for all your data."}, {"id": 217, "start": 2108.62, "end": 2113.82, "text": "Blabla, blabla. Auch guck mal, die haben jetzt einen, die haben jetzt so einen Setup-Guide,"}, {"id": 218, "start": 2113.82, "end": 2127.46, "text": "wie es aussieht. Okay, das ist im Prinzip blabla. Blabla, blabla. Get Desktop-App. Ja,"}, {"id": 219, "start": 2127.46, "end": 2134.66, "text": "die Desktop-App installieren wir gleich. Start using Nextcloud. Sehr schön. Äh,"}, {"id": 220, "start": 2134.66, "end": 2156.46, "text": "die Desktop-App installieren wir jetzt mal. 11 ist es hier, der da. Cute-Keychain. Cute-Chat."}, {"id": 221, "start": 2156.46, "end": 2176.06, "text": "Haha, nee, nee."}, {"id": 222, "start": 2187.06, "end": 2191.74, "text": "Wobei, das muss ich mir mal angucken. Die Seite sieht gar nicht so schlecht aus. Kenne ich"}, {"id": 223, "start": 2191.74, "end": 2202.42, "text": "noch gar nicht hier. Wie funktioniert das? Plug DJ. Select your favorite type of music"}, {"id": 224, "start": 2202.42, "end": 2225.7, "text": "in Startlisten. Okay, Metal. Und jetzt? Ach, ach nee, ach so ist das. Man macht da, man"}, {"id": 225, "start": 2225.7, "end": 2232.5, "text": "macht quasi einen Chatraum. Man macht quasi so eine Art Chatraum. Und wenn man da jetzt"}, {"id": 226, "start": 2232.5, "end": 2256.18, "text": "Musik reinzieht, hören das alle, die drin sind, oder wie? Das ist eigentlich gar keine"}, {"id": 227, "start": 2256.18, "end": 2276.7, "text": "schlechte Idee. Allerdings scheint die Plattform nicht so sonderlich besucht zu sein, ne? Hä,"}, {"id": 228, "start": 2276.7, "end": 2279.5, "text": "ich mach mal da jetzt keinen Account. Aber ich überlege mal das mal. Ich finde, das"}, {"id": 229, "start": 2279.5, "end": 2288.14, "text": "ist eigentlich eine gute App-Idee. Okay, Nextcloud ist installiert, das war super easy. Eats,"}, {"id": 230, "start": 2288.14, "end": 2297.98, "text": "das war hier, meint Eats. Und es war, nein, das war's. Okay, es sieht immer noch so aus"}, {"id": 231, "start": 2297.98, "end": 2307.22, "text": "wie eh und je. Und Nextcloud ist langsam von der SD-Karte. Da hätte ich aber auch selbst"}, {"id": 232, "start": 2307.22, "end": 2314.42, "text": "drauf kommen können, ehrlich gesagt. Das machen wir jetzt noch mal anders. Ich lösch"}, {"id": 233, "start": 2314.42, "end": 2324.14, "text": "den Scheiß noch mal. Lösch den Kram noch mal und hänge mal meine SSD an die Stelle"}, {"id": 234, "start": 2324.14, "end": 2337.3, "text": "ein, wo Nextcloud gerade ist. Machen wir hier nicht verzeichnen, Nextcloud. Gucken wir,"}, {"id": 235, "start": 2337.3, "end": 2346.94, "text": "ob das überhaupt dann gescheit funktioniert. Machen wir erst mal hier Temp. Dann unmounten"}, {"id": 236, "start": 2346.94, "end": 2351.26, "text": "wir wieder die normale SSD, wobei das geht wahrscheinlich nicht, solange ich das anhabe."}, {"id": 237, "start": 2351.26, "end": 2362.86, "text": "Und dann moveen wir das ganze mal. Gucken, ob das funktioniert. Unmount die SSD, zack,"}, {"id": 238, "start": 2362.86, "end": 2382.06, "text": "mont die SSD auf Temp. Und jetzt kopieren wir einfach den ganzen Mist. Wobei, ne, wir"}, {"id": 239, "start": 2382.06, "end": 2388.46, "text": "können einfach den ganzen Kram moveen. Der hier drunter liegt, den moveen wir nach TMP."}, {"id": 240, "start": 2388.46, "end": 2413.06, "text": "Und dann sollte der Kram auf der SSD sein. Joa. Sieht so aus, ne? Und da sollte leer"}, {"id": 241, "start": 2413.06, "end": 2430.86, "text": "sein. Achso, den Kram sollte man vielleicht noch mitschieben, das wäre nicht verkehrt."}, {"id": 242, "start": 2430.86, "end": 2448.18, "text": "Was suchst du, was suchst du Knäb? Ok, Nextcloud. Schmeißen wir mal weg. Here is the directory,"}, {"id": 243, "start": 2448.18, "end": 2464.7, "text": "ja ja, blablabla. Alter, was ist das für Musik? Das hört sich irgendwie permanent"}, {"id": 244, "start": 2464.7, "end": 2483.66, "text": "an. Ja. So, haben wir den Kram unmountet. Dann benennen wir das um, den mountpoint,"}, {"id": 245, "start": 2483.66, "end": 2497.7, "text": "nextcloud. So, machen sie hier auch nochmal drauf. Und dann mounten wir den Kram wieder"}, {"id": 246, "start": 2497.7, "end": 2506.94, "text": "und dann sollte das eigentlich genauso wieder funktionieren. Fsda nach nextcloud. Und jetzt"}, {"id": 247, "start": 2506.94, "end": 2511.22, "text": "starten wir den Apache neu und gucken, ob alles funktioniert. Wenn ich es richtig gemacht"}, {"id": 248, "start": 2511.22, "end": 2515.74, "text": "habe, sollte es wieder funktionieren. Nur mit dem Unterschied, dass mein data directory"}, {"id": 249, "start": 2515.74, "end": 2525.86, "text": "ja immer noch verkehrt ist. Ja, mein data directory ist jetzt verkehrt. Ok Max, das"}, {"id": 250, "start": 2525.86, "end": 2532.58, "text": "war doch keine allzu clevere Idee, was du da gemacht hast. Also muss ich die gerade nochmal"}, {"id": 251, "start": 2532.58, "end": 2550.62, "text": "einstellen. Man kann das hier doch bestimmt drin einstellen. Config. Einstellen, wo das"}, {"id": 252, "start": 2550.62, "end": 2563.22, "text": "data directory liegt, oder? Ach, da. Easy as a fuck. Mein data directory soll jetzt"}, {"id": 253, "start": 2563.22, "end": 2570.78, "text": "das da sein. Übrigens, krasse Wim-Hacks jetzt mal an der Stelle. Was man machen kann, wenn"}, {"id": 254, "start": 2570.78, "end": 2575.98, "text": "man einfach das da löschen will zwischen den einfachen Anführungsstrichen, sagt man"}, {"id": 255, "start": 2575.98, "end": 2583.14, "text": "einfach ci. Einfache Anführungsstriche. Äh, warum hat das jetzt nicht funktioniert? Man"}, {"id": 256, "start": 2583.14, "end": 2592.74, "text": "muss da nicht drin sein normalerweise. ci. Einfache Anführungsstriche. Was? Normalerweise"}, {"id": 257, "start": 2592.74, "end": 2606.62, "text": "muss man da nicht drin sein. Ja, da funktioniert es auch so. So, da ist mein data directory."}, {"id": 258, "start": 2606.62, "end": 2615.06, "text": "Ok, gucken wir mal, ob meine nextcloud Installation wieder funktioniert. Oh, ich habe es kaputt"}, {"id": 259, "start": 2615.06, "end": 2635.02, "text": "gemacht. Leute, ich habe es zerstört. Ich habe es kaputt gemacht. Lohnt. Mag der nicht,"}, {"id": 260, "start": 2635.02, "end": 2650.86, "text": "dass das aufnimmt? Kann das sein, dass ich mich verschrieben habe? Nee, habe ich nicht."}, {"id": 261, "start": 2650.86, "end": 2662.86, "text": "Wie genau habe ich das jetzt geschafft, kaputt zu machen? Ja. Ok, ich setze nochmal die Dateiberechtigung"}, {"id": 262, "start": 2662.86, "end": 2670.54, "text": "für alles da drauf. Aber nicht verkehrt. Ich habe es kaputt gemacht, Leute. RIP. Ich"}, {"id": 263, "start": 2670.54, "end": 2687.18, "text": "muss nochmal neu installieren. Ich habe es zerstört. Ich bin mir ehrlich gesagt aber"}, {"id": 264, "start": 2687.18, "end": 2694.94, "text": "nicht so ganz sicher, mit was ich es zerstört habe. Aber anscheinend habe ich es zerstört."}, {"id": 265, "start": 2694.94, "end": 2704.46, "text": "Na gut. Machen wir es halt nochmal. Ist ja nicht so, dass wir schon viel gemacht hätten."}, {"id": 266, "start": 2704.46, "end": 2725.06, "text": "So, wir haben jetzt einen Ordner. Nextcloud. Ja, ok. Stoppen wir mal den Apache, das ist"}, {"id": 267, "start": 2725.06, "end": 2735.58, "text": "gleich nicht verkehrt. Ja, das war jetzt natürlich total episch. Ich muss da rein, es bringt"}, {"id": 268, "start": 2735.58, "end": 2739.62, "text": "nichts, wenn ich den Ordner lösche. Ich habe gerade meinen Mountpoint gelöscht. Da hängen"}, {"id": 269, "start": 2739.62, "end": 2751.66, "text": "geblieben. Ich muss jetzt erstmal da rein, erstmal alles löschen. Dann den Kram nochmal"}, {"id": 270, "start": 2751.66, "end": 2768.02, "text": "da rein installieren. Jetzt ist alles weg, genau. Apache ist gestoppt. Gut. Weiß jemand"}, {"id": 271, "start": 2768.02, "end": 2777.54, "text": "aus dem Kopf, wie man anzip sagt, dass er das hier rein anzippen soll, ohne den Ordner"}, {"id": 272, "start": 2777.54, "end": 2793.58, "text": "zu erstellen. Geht doch bestimmt, da muss ich es danach nicht verschieben. Minus D."}, {"id": 273, "start": 2793.58, "end": 2809.38, "text": "Ja gut, dann, vielleicht geht das ja. Und zipp. Nextcloud. 16. Minus D. Ob das so funktioniert?"}, {"id": 274, "start": 2809.38, "end": 2818.9, "text": "Jetzt macht der Nextcloud den Nextcloud, das ist natürlich total bescheuert. Aber man"}, {"id": 275, "start": 2818.9, "end": 2826.7, "text": "merkt, dass es auf die SSD geht, weil das ist schon gleich viel schneller. Oder ist"}, {"id": 276, "start": 2826.7, "end": 2835.3, "text": "es? G-Warp gemountet. Ja. Jetzt habe ich Nextcloud in Nextcloud, das ist natürlich super. Ganz,"}, {"id": 277, "start": 2835.3, "end": 2846.34, "text": "ganz huge. Kann man nicht alles von Nextcloud einfach moveen? Dahin? Ne, das wird, das funktioniert"}, {"id": 278, "start": 2846.34, "end": 2872.14, "text": "natürlich so nicht. Aber das müsste eigentlich funktionieren. Oh, geht doch. Big brain. Okay,"}, {"id": 279, "start": 2872.14, "end": 2883.78, "text": "gut. Und jetzt tut es hoffentlich. Ey. Ach so, die Berechtigungen sind immer noch verkehrt."}, {"id": 280, "start": 2883.78, "end": 2896.54, "text": "Ja, die Berechtigungen sind, das können wir jetzt einfach fixen damit und jetzt gehts."}, {"id": 281, "start": 2896.54, "end": 2908.74, "text": "Ey. Admin, Passwort 1, 2, 3, 4, 5, 6. Finish. Jetzt rödel da wieder ein bisschen rum. Sollte"}, {"id": 282, "start": 2908.74, "end": 2927.94, "text": "jetzt schneller gehen, weil es ist auf der SSD drauf. Da hat Twitch schon was zur Partnerbewerbung"}, {"id": 283, "start": 2927.94, "end": 2933.9, "text": "gesagt. Ich hab die immer neu abgeschickt. Ich muss erst nochmal YouTube connecten zu"}, {"id": 284, "start": 2933.9, "end": 2942.5, "text": "Twitch. Dass die auch sehen, dass ich, ich hab Twitter schon connectet und ich muss YouTube"}, {"id": 285, "start": 2942.5, "end": 2959.94, "text": "noch connecten. Ja, Sebaro, so ist das. Warum bin ich eigentlich der Einzige, der irgendwie"}, {"id": 286, "start": 2959.94, "end": 2965.34, "text": "dazu gedrängt wird, dass man Geld ausgeben darf. Bei allen anderen schreien die Leute,"}, {"id": 287, "start": 2965.34, "end": 2970.82, "text": "Alter, sell out, sell out. Und bei mir ist es so, Max, ich will Geld, äh, Max, ich will"}, {"id": 288, "start": 2970.82, "end": 2989.3, "text": "dir Geld geben, mach Partner. So, jetzt aber, jetzt hat es funktioniert. Alle anderen haben"}, {"id": 289, "start": 2989.3, "end": 2994.42, "text": "keine Keks-Emotes. Ich hab ja auch noch, noch nicht, aber das ist wahrscheinlich eines"}, {"id": 290, "start": 2994.42, "end": 2998.62, "text": "der ersten Emotes, die wir dann machen. Allerdings nehm ich nicht meinen Standard-Keks. Ich muss"}, {"id": 291, "start": 2998.62, "end": 3004.42, "text": "mir mit Emotes eh noch was einfallen lassen. Erstens brauch ich jemanden, der gute Emotes"}, {"id": 292, "start": 3004.42, "end": 3012.5, "text": "machen kann, der nicht gar so teuer ist, weil letztendlich, ich bin schon bereit dafür"}, {"id": 293, "start": 3012.5, "end": 3019.3, "text": "was zu bezahlen. Also ich will ihnen auch was geben, weil, ähm, es ist immer, wie gesagt,"}, {"id": 294, "start": 3019.3, "end": 3022.7, "text": "von Exposure kann keiner leben und hier ist jetzt nicht so, dass es auf Twitch wahnsinnig"}, {"id": 295, "start": 3022.7, "end": 3033.34, "text": "viel wäre bei mir. Ähm, und ich brauch aber noch irgendein gescheites Konzept, wie man,"}, {"id": 296, "start": 3033.34, "end": 3049.1, "text": "wie die Emotes aussehen sollen. Ok, also, Zeug funktioniert, gut. Du kannst mir Shit-Emotes"}, {"id": 297, "start": 3049.1, "end": 3055.94, "text": "machen for free. Also, es gibt Channels, die werden nur abonniert, weil sie Shit-Emotes"}, {"id": 298, "start": 3055.94, "end": 3060.02, "text": "haben. Vielleicht soll ich das auch probieren. So, wir brauchen erst noch mal einen neuen"}, {"id": 299, "start": 3060.02, "end": 3066.5, "text": "User. Wir brauchen einen neuen, wie ging das, nochmal einen neuen User. Ja. Users. Wir brauchen"}, {"id": 300, "start": 3066.5, "end": 3072.06, "text": "einen neuen User. Einen MonkaSmoke brauch ich auf jeden Fall, allerdings ist MonkaSmoke"}, {"id": 301, "start": 3072.06, "end": 3076.74, "text": "kein offizielles Twitch-Emote. Da mache ich einen, da reichen wir einen BetterTwitchTV-Emote"}, {"id": 302, "start": 3076.74, "end": 3083.02, "text": "oder sowas ein, weil ein Channel, der wupplos heißt, darf natürlich kein Emote global"}, {"id": 303, "start": 3083.02, "end": 3087.54, "text": "auf Twitch machen oder generell auf Twitch machen, das MonkaSmoke heißt. Das ist ja"}, {"id": 304, "start": 3087.54, "end": 3097.86, "text": "irgendwo klar. Wobei wir für MonkaSmoke schon das beste Emote überhaupt haben. Übrigens"}, {"id": 305, "start": 3097.86, "end": 3102.62, "text": "wisst ihr, was mir gerade angefallen ist? Da müsst ihr euch schon mal Gedanken zu machen."}, {"id": 306, "start": 3102.62, "end": 3109.86, "text": "Wir haben ja schon unsere BetterTwitchTV-Emotes, allerdings, wir können auch noch 24 FFZ-Emotes"}, {"id": 307, "start": 3109.86, "end": 3116.3, "text": "machen. Wie ist denn bei euch so die Verteilung? Was habt ihr denn? Also, Moment, da müssen"}, {"id": 308, "start": 3116.3, "end": 3130.7, "text": "wir jetzt mal eine Abstimmung machen. Also, ja, ja, ihr müsst das doch nicht in Chatter."}, {"id": 309, "start": 3130.7, "end": 3150.54, "text": "Habt ihr ein Twitch-Addon? FFZ, BetterTwitchTV oder keins? Also, ich glaube, die wenigsten"}, {"id": 310, "start": 3150.54, "end": 3161.9, "text": "haben beides. Die wenigsten haben beides. Ich weiß, dass Beides geht, ja. Okay, dann"}, {"id": 311, "start": 3161.9, "end": 3174.78, "text": "haben wir beides hier noch. Keins, beides, create. Da. Einmal please abstimmen, ob sich"}, {"id": 312, "start": 3174.78, "end": 3184.26, "text": "das überhaupt lohnt, FFZ-Emotes zu machen. Ich weiß, dass man bei FFZ BetterTwitchTV"}, {"id": 313, "start": 3184.26, "end": 3188.98, "text": "anzeigen lassen kann. Ich weiß allerdings nicht, ob man... Ach, BetterTwitchTV kann"}, {"id": 314, "start": 3188.98, "end": 3195.54, "text": "auch FFZ, okay. Ja, ja, FFZ kann BetterTwitchTV-Emotes. Ich weiß aber nicht, ob BetterTwitchTV-Emotes"}, {"id": 315, "start": 3195.54, "end": 3218.14, "text": "FFZ-Emotes kann. Ihr habt wirklich beide Twitch-Addons? Echt? Okay. Ich hab nur noch FFZ seit einem"}, {"id": 316, "start": 3218.14, "end": 3226.54, "text": "Jahr oder so. Warum eigentlich? Also, was ist der Grund für euch beides zu haben? Interessiert"}, {"id": 317, "start": 3226.54, "end": 3242.98, "text": "mich wirklich jetzt. Weil das einzige, was ich bei FFZ vermisse ist, dass die ne History"}, {"id": 318, "start": 3242.98, "end": 3247.9, "text": "haben. Das alte BetterTwitchTV hatte ne History. Da hast du im Chat was geschrieben und konntest"}, {"id": 319, "start": 3247.9, "end": 3252.3, "text": "dann mit Pfeil hoch und Pfeil runter, wie in der Linux-Commando-Zeile so ein bisschen,"}, {"id": 320, "start": 3252.3, "end": 3268.74, "text": "deinen letzten Chat-Nachrichten durchswitchen. Hab aber keinen mit dem Option-Knopf gefunden,"}, {"id": 321, "start": 3268.74, "end": 3274.78, "text": "Alter. Okay, also lohnt sich auf jeden Fall, wenn man sagt, wir machen auch noch 24 FFZ-Emotes."}, {"id": 322, "start": 3274.78, "end": 3280.74, "text": "Ich mein, wir haben ja alle BetterTwitchTV-Emotes haben wir ja schon voll. Ich könnte die ja"}, {"id": 323, "start": 3280.74, "end": 3287.58, "text": "auch mal ein bisschen updaten wieder. Aber dann haben wir noch mal 20 Emotes zusätzlich."}, {"id": 324, "start": 3287.58, "end": 3306.3, "text": "So, also wir brauchen einen neuen User. Zwar nennen wir den User mal cute-chat. Display-Name"}, {"id": 325, "start": 3306.3, "end": 3314.26, "text": "brauchen wir nix, Default, Group, alles, alles gut. Unlimited-Quota, Groups, Admin, ne."}, {"id": 326, "start": 3314.26, "end": 3322.98, "text": "Ich Groups Admin. Ich glaub da gehen manche auch bei Groups Admin. Passwort, 1, 2, 3,"}, {"id": 327, "start": 3322.98, "end": 3332.46, "text": "4, 5, 6. Du brauchst keinen User, du brauchst einen Dark Mode, ja. Wisst ihr was, wir machen"}, {"id": 328, "start": 3332.46, "end": 3338.78, "text": "alles mit Admin. Wir machen einfach alles mit Admin. Warum? Warum überhaupt? Gibt es"}, {"id": 329, "start": 3338.78, "end": 3342.42, "text": "einen Link zu den BetterTwitchTV-Emotes von Maxi? Ich glaube es gibt einen Link, wo man"}, {"id": 330, "start": 3342.42, "end": 3351.9, "text": "sich alle Channel-Emotes anzeigen lassen kann von einem gewissen Channel. Aber ansonsten"}, {"id": 331, "start": 3351.9, "end": 3355.74, "text": "wüsste ich jetzt nicht. Also man sieht, du siehst, wenn du BetterTwitchTV installiert"}, {"id": 332, "start": 3355.74, "end": 3360.86, "text": "hast, siehst du unten, wenn du auf den Smiley klickst, wo die Emotes sind, siehst du die"}, {"id": 333, "start": 3360.86, "end": 3377.02, "text": "Emotes vom Channel. Oder sieht man das in BetterTwitchTV? Ich denke schon, bei FFZ sieht man es. Ne,"}, {"id": 334, "start": 3377.02, "end": 3388.54, "text": "das Hint ist, es müssten 25 oder so sein, mehr gibt es nicht. Darkseam, ja, wo ist das"}, {"id": 335, "start": 3388.54, "end": 3394.02, "text": "neue, das haben sie doch beworben, dass es jetzt ein neues Darkseam gibt. Wo schaltet"}, {"id": 336, "start": 3394.02, "end": 3412.78, "text": "man das ein? Settings, Theming, hier. Ne. Ach ne, das ist ja auch die Admin. Das ist"}, {"id": 337, "start": 3412.78, "end": 3418.5, "text": "ja auch die Admin-Konsole. Das kann man bestimmt für User spezifisch machen, ne. Wo ist das"}, {"id": 338, "start": 3418.5, "end": 3431.78, "text": "neue? Wo schaltet man das Darkseam ein? Settings. Ach doch, hier, Personal Info, bla, bla, bla."}, {"id": 339, "start": 3431.78, "end": 3449.14, "text": "Accessibility, Darkseam, jawoll. Ach, gleich schon viel besser, oder? Viel besser. Was"}, {"id": 340, "start": 3449.14, "end": 3460.66, "text": "haben wir zur Auswahl? Open Dill Lexic. Der Font sieht mega beschissen aus. Warum sollte"}, {"id": 341, "start": 3460.66, "end": 3470.58, "text": "ich diesen Font dann verwenden um alles in der Welt? Der Font sieht richtig räudig aus,"}, {"id": 342, "start": 3470.58, "end": 3474.98, "text": "warum soll ich das Ding dann verwenden? Okay, vielleicht sieht es nur unter Linux-Kacke"}, {"id": 343, "start": 3474.98, "end": 3492.62, "text": "aus. Gucken wir mal wie das im Chrome ist. Ach, das ist, das, das bedeutet irgendwas,"}, {"id": 344, "start": 3492.62, "end": 3501.62, "text": "oder was? Dill, Dill, Dill, Dill, Dill, Dill, Dill, Dill, Dill, Dill, Dill, Dill, Dill,"}, {"id": 345, "start": 3501.62, "end": 3514.98, "text": "Dill, Dill, Dill. Ach so. Dann ergibt das Sinn. Was ich nicht verstehe ist, wenn man,"}, {"id": 346, "start": 3514.98, "end": 3524.66, "text": "inwieweit hilft einem denn ein Font bei einer Leserechtschreibschwäche? Das interessiert"}, {"id": 347, "start": 3524.66, "end": 3528.7, "text": "mich jetzt wirklich, wie inwieweit hilft mir das jetzt? Betont das gewisse Sachen so, dass"}, {"id": 348, "start": 3528.7, "end": 3553.94, "text": "dass ich es mir einfacher merken kann, ah Reading Errors ok, interessant was es nicht"}, {"id": 349, "start": 3553.94, "end": 3559.06, "text": "alles gibt, ich hätte jetzt nicht gedacht, dass einem eine Schriftart helfen kann, weil"}, {"id": 350, "start": 3559.06, "end": 3566.14, "text": "diese Rechtschreibschwäche, aber man lernt ja nicht aus, ok jetzt gucken wir erstmal"}, {"id": 351, "start": 3566.14, "end": 3571.98, "text": "was für Apps standardmäßig dabei sind mittlerweile, eine Sache die mir auch überhaupt nicht gefallen"}, {"id": 352, "start": 3571.98, "end": 3584.34, "text": "hat war die Notizenapp, die war richtig crap, ich verwende schon seit einer ganzen Weile"}, {"id": 353, "start": 3584.34, "end": 3592.14, "text": "diese Geschichte hier als Notizapp, so wirklich glücklich bin ich damit aber auch nicht,"}, {"id": 354, "start": 3592.14, "end": 3598.54, "text": "wir gucken uns mal die offizielle Notizapp an wie die mittlerweile ist, Passport, oja"}, {"id": 355, "start": 3598.54, "end": 3607.38, "text": "hoch secure Passport, Achtung Leute 1, 2, 3, 4, 5, 6, so dann brauchen wir noch die"}, {"id": 356, "start": 3607.38, "end": 3613.18, "text": "To Do App, ja wobei die hieß nicht To Do, die hieß Task glaube ich, Tasks download and"}, {"id": 357, "start": 3613.18, "end": 3623.06, "text": "enable, ok was haben die eigentlich mittlerweile, wir gucken mal was es mittlerweile für Apps"}, {"id": 358, "start": 3623.06, "end": 3632.38, "text": "alles so gibt, das sind ja wohl die im offiziellen, ah ne das sind meine, ok schauen wir mal was"}, {"id": 359, "start": 3632.38, "end": 3649.46, "text": "gibt es denn alles so für Apps, Cup, gibt es kein Cup, manchmal verwirrt mich der Twitchchat,"}, {"id": 360, "start": 3649.46, "end": 3665.94, "text": "jetzt ist jetzt der Partyparod am Start, Cup ist eine halbe, Cup, ich wusste gar nicht"}, {"id": 361, "start": 3665.94, "end": 3691.9, "text": "dass es das alles im Out gibt, warum, weil er so rein sneaked, was ist das für ein"}, {"id": 362, "start": 3691.9, "end": 3720.7, "text": "Cup, also quasi ein bisschen so hier, es sneaked auch rein, verstehe, dann machen wir"}, {"id": 363, "start": 3720.7, "end": 3730.66, "text": "ein halbes Cup als Emote, es gibt eh noch jede Menge coole Emotes, die ich noch nicht"}, {"id": 364, "start": 3730.66, "end": 3737.82, "text": "drin habe, ich habe zuletzt meine Emotes vor einem Jahr oder so aktualisiert, wir brauchen"}, {"id": 365, "start": 3737.82, "end": 3751.14, "text": "unbedingt Five Head, wenn wir wieder irgendwelche Big Brain Sachen machen oder irgendwas ausversehen"}, {"id": 366, "start": 3751.14, "end": 3761.02, "text": "löschen, wir brauchen unbedingt noch unser Five Head Emote, für die 900 IQ Kommandozahlenbefehle,"}, {"id": 367, "start": 3761.02, "end": 3764.9, "text": "wie lange läuft deine Banner TwitchTV Subscription auf die Emotes, ich habe automatisch Verlängerungen"}, {"id": 368, "start": 3764.9, "end": 3784.14, "text": "gemacht, 3 Head, ja den gibt es auch noch, das ist der Oi Typ ist das, oi, Monkratos,"}, {"id": 369, "start": 3784.14, "end": 3792.42, "text": "Monkratos brauchen wir auch noch, wir sollten im Discord, im Discord kann man noch bestimmt"}, {"id": 370, "start": 3792.42, "end": 3797.38, "text": "eine Abstimmung machen oder Vorschläge oder sowas, was wir für Emotes brauchen, da überlege"}, {"id": 371, "start": 3797.38, "end": 3804.62, "text": "ich mir mal was, da machen wir irgendwie so eine, machen wir im Discord so eine Liste"}, {"id": 372, "start": 3804.62, "end": 3809.54, "text": "oder irgendwie was, wo man abstimmen kann, dass ich, ich meine ich werde ein paar Emotes"}, {"id": 373, "start": 3809.54, "end": 3816.9, "text": "rein machen, auch wenn die nicht auf der Liste drin sind, aber ein paar muss man ja gucken,"}, {"id": 374, "start": 3816.9, "end": 3823.3, "text": "das ist immer, wäre ja blöd wenn ich vielleicht irgendwas nicht kenne, obwohl das eigentlich"}, {"id": 375, "start": 3823.3, "end": 3828.54, "text": "ein nicees Emote ist, Pepega, Pepega müssten wir eigentlich haben, aber nicht mal Pepega"}, {"id": 376, "start": 3828.54, "end": 3837.74, "text": "als Emote, oh das ist aber bitter, ja Siebaro kannst du, kannst du machen, wir müssen aber"}, {"id": 377, "start": 3837.74, "end": 3844.86, "text": "noch überlegen, wie wir das mit der Abstimmung machen, äh, es geht nicht um Emotes auf"}, {"id": 378, "start": 3844.86, "end": 3857.98, "text": "dem Discord, es geht darum, welche Emotes ich als, als, als FFZ Emotes für den Channel"}, {"id": 379, "start": 3857.98, "end": 3875.74, "text": "nehmen kann, weil ich habe alle 25 BellaTwitchTV Emotes und ich habe noch 25 offenen FFZ Emotes,"}, {"id": 380, "start": 3875.74, "end": 3879.42, "text": "ja und wenn ich dann mal Partner bin, dann gibt es ja auch richtige Emotes, allerdings"}, {"id": 381, "start": 3879.42, "end": 3885.1, "text": "nicht so viele, weil es werden jetzt ja nicht gleich irgendwie riesen Anzahl an Abos geben,"}, {"id": 382, "start": 3885.1, "end": 3890.14, "text": "aber so ein paar wird es, da muss ich mir echt mal Gedanken machen, was ich da nehme,"}, {"id": 383, "start": 3890.14, "end": 3899.94, "text": "auf jeden Fall müssen wir noch MonkaSmoke als extra Emote einreichen, bei, bei BellaTwitchTV,"}, {"id": 384, "start": 3899.94, "end": 3911.02, "text": "okay, ähm, wir machen jetzt mal weiter, LulWee, ja LulWee muss auch sein, ich verwende eigentlich"}, {"id": 385, "start": 3911.02, "end": 3916.86, "text": "auf allen Channels, wo es LulWee gibt, eigentlich fast nur LulWee anstatt Lul, wer sich kennt,"}, {"id": 386, "start": 3916.86, "end": 3923.86, "text": "LulWee ist einfach ein rangezoomtes Lul, weil Twitch, großartige Logik ist leider nicht"}, {"id": 387, "start": 3923.86, "end": 3935.62, "text": "dahinter zu erkennen, ja, übrigens, äh, wer neu am Start ist und das auch noch nicht"}, {"id": 388, "start": 3935.62, "end": 3939.5, "text": "mitgekriegt hat, wir haben also einen Discord Server, Ausrufezeichen Discord, wer noch nicht"}, {"id": 389, "start": 3939.5, "end": 3944.42, "text": "gefollowed ist, kann mir gerne followen, auf Twitter und natürlich auch auf Twitch, da"}, {"id": 390, "start": 3944.42, "end": 3949.22, "text": "seid ihr immer auf dem aktuellsten Stand, wenn der Stream live geht oder wenn es irgendwelche"}, {"id": 391, "start": 3949.22, "end": 3953.9, "text": "anderen Sachen gibt, und jetzt haben wir Sellout-Modus beendet, jetzt machen wir weiter mit Next"}, {"id": 392, "start": 3953.9, "end": 3964.82, "text": "Cloud, ähm, okay, was, was, was haben sie mittlerweile standardmäßig für, für Apps"}, {"id": 393, "start": 3964.82, "end": 3971.78, "text": "dabei, App-Order, sortieren, das brauch ich nicht nur mit den Customs hier, das blablabla,"}, {"id": 394, "start": 3971.78, "end": 3983.54, "text": "braucht man nicht, Random Background from Unsplash, das gefällt mir, ich weiß zwar"}, {"id": 395, "start": 3983.54, "end": 3992.02, "text": "nicht genau, was wir damit machen, aber das installieren wir einfach mal, Random Background"}, {"id": 396, "start": 3992.02, "end": 4000.86, "text": "ist immer, immer nice, äh, External Sites brauchen wir an der Stelle nicht, das brauchen"}, {"id": 397, "start": 4000.86, "end": 4005.74, "text": "wir auch nicht, okay, was haben wir sonst noch so, Files, äh, PDF Viewer, der ist standardmäßig"}, {"id": 398, "start": 4005.74, "end": 4013.1, "text": "dabei, Tiffties brauche ich nicht, brauche ich auch nicht, Draw IO als Addon für Next"}, {"id": 399, "start": 4013.1, "end": 4018.86, "text": "Cloud, okay, das ist cool, das muss ich mir mal angucken, ich hab ja, wir haben ja schon"}, {"id": 400, "start": 4018.86, "end": 4028.22, "text": "öfters hier, äh, Draw, Draw IO Bildchen gemacht, gibt es Draw IO auch als Desktop Client eigentlich,"}, {"id": 401, "start": 4028.22, "end": 4031.82, "text": "also Desktop, in Anführungsstrichen, das ist wahrscheinlich eine Elektronen Anwendung"}, {"id": 402, "start": 4031.82, "end": 4039.9, "text": "oder sowas, ne, aber es ist cool, wenn er das einfach auf Next Cloud speichert, das,"}, {"id": 403, "start": 4039.9, "end": 4051.3, "text": "das gefällt mir, ähm, Camera Rob Reviews brauche ich nicht, Check Zoom, das ist nice,"}, {"id": 404, "start": 4051.3, "end": 4068.26, "text": "das können wir auch mal aktivieren, sollte das jetzt nicht eigentlich Enable, ups, ich"}, {"id": 405, "start": 4068.26, "end": 4075.26, "text": "hab das falsche angeklickt, Alter, jebaited, jetzt hab ich hier den Mist Enabled, den ich"}, {"id": 406, "start": 4075.26, "end": 4092.1, "text": "gar nicht haben will, äh, wie hieß das Ding, Raw, Disable, Next Cloud Games brauche ich"}, {"id": 407, "start": 4092.1, "end": 4099.98, "text": "wirklich nicht als Next Cloud Anwendung, Keep all the random clean your Next Cloud Data,"}, {"id": 408, "start": 4099.98, "end": 4109.82, "text": "warum nicht, Integrations, Draw IO haben wir schon, After Logic, Webmail Client, okay,"}, {"id": 409, "start": 4109.82, "end": 4119.54, "text": "Circles, Circles klingt mir viel zu sehr nach Google Plus, findet ihr nicht auch, da hier"}, {"id": 410, "start": 4119.54, "end": 4128.98, "text": "zusammen Editierzeug, brauche ich auch nicht, Git, Git hat Merge Tracker, ein Keepers Client,"}, {"id": 411, "start": 4128.98, "end": 4139.26, "text": "nein, den brauche ich auch nicht unbedingt da, Only Office, was ist denn Only Office,"}, {"id": 412, "start": 4139.26, "end": 4151.38, "text": "Ist ein Open Source Office Paket, ist das, ist das, ähm, ist das Libre Office mit Support"}, {"id": 413, "start": 4151.38, "end": 4157.82, "text": "oder was ist das, ach ne, das ist ein komplett anderes, das ist ein eigenständiges Office,"}, {"id": 414, "start": 4157.82, "end": 4164.94, "text": "okay, hab ich noch nie was von gehört, aber wie gesagt ich verwende auch keine Office"}, {"id": 415, "start": 4164.94, "end": 4172.42, "text": "Software, Markdown Editor, Edit Text Editor, Plane Text, Markdown drüber reicht für 95%"}, {"id": 416, "start": 4172.42, "end": 4179.78, "text": "der Sachen, und ich sage es jedem Stream, die einzige Anwendung, die eine Daseinsberechtigung"}, {"id": 417, "start": 4179.78, "end": 4187.1, "text": "hat in dem Office Paket ist meiner Ansicht nach die Tabellengalkulation, OCR, OCR ist"}, {"id": 418, "start": 4187.1, "end": 4191.62, "text": "cool wenn es richtig funktioniert, da könnte man beispielsweise ein Foto machen von irgendeinem"}, {"id": 419, "start": 4191.62, "end": 4195.78, "text": "Dokument oder ein eingescanntes Dokument in Nextcloud schieben und das Ding macht OCR"}, {"id": 420, "start": 4195.78, "end": 4204.62, "text": "drauf und man kann es durchsuchen, das wäre natürlich richtig cool, wie Previews zu Markdown,"}, {"id": 421, "start": 4204.62, "end": 4211.62, "text": "meistens gar nicht, das einzige wo ich das mal in schön brauche ist für einen Changelog"}, {"id": 422, "start": 4211.62, "end": 4217.06, "text": "oder sowas, weil unsere Changelogs auf der Arbeit, das ist alles in, unser Haupt Changelog"}, {"id": 423, "start": 4217.06, "end": 4222.62, "text": "quasi ist in Markdown und da habe ich, wie heißt das, Crip glaube ich, das ist so ein"}, {"id": 424, "start": 4222.62, "end": 4227.5, "text": "Peißending oder so, das startest du einfach und das rendert dir alle Markdown Files in"}, {"id": 425, "start": 4227.5, "end": 4241.74, "text": "einem Verzeichnis und dann kannst du das rauskopieren dann. Ansonsten hat, QR Notes hat einen"}, {"id": 426, "start": 4241.74, "end": 4246.82, "text": "eigenen Markdown Preview drinnen, das verwende ich allerdings habe ich den Markdown Vorschau"}, {"id": 427, "start": 4246.82, "end": 4252.06, "text": "ausgeschaltet, verwende eigentlich bloß noch das Synthax Highlighting für Markdown,"}, {"id": 428, "start": 4252.06, "end": 4259.1, "text": "weil das das Dokument auch ein bisschen strukturiert, ansonsten stinkt normales Plain Text. Was"}, {"id": 429, "start": 4259.1, "end": 4267.94, "text": "ist Nextcloud? Eine Cloud Lösung zum selber Hosten, wobei Cloud in dem Sinne eigentlich"}, {"id": 430, "start": 4267.94, "end": 4276.78, "text": "ein bisschen trügerisch ist an der Stelle, es hat mit Cloud relativ wenig zu tun, weil"}, {"id": 431, "start": 4276.78, "end": 4280.5, "text": "und der Cloud versteht mir ja gerade, dass es nicht bei dir läuft, dass du auch wenig"}, {"id": 432, "start": 4280.5, "end": 4286.74, "text": "Einfluss hast drauf wo es läuft und wie es eigentlich genau läuft, das ist im Prinzip"}, {"id": 433, "start": 4286.74, "end": 4294.9, "text": "stinknormale PAP Anwendung, die relativ viele nützliche Funktionen und Apps hat. Also im"}, {"id": 434, "start": 4294.9, "end": 4302.54, "text": "Kern ist es eigentlich ein Filesynchronisierung Service sowie Dropbox, das ist so der Kern,"}, {"id": 435, "start": 4302.54, "end": 4313.82, "text": "plus Kalender und Kontaktlisten. Also die zwei Sachen, Kalender und Filesync, das ist"}, {"id": 436, "start": 4313.82, "end": 4319.5, "text": "eigentlich so im Kern, das wofür Nextcloud da ist. Es gibt allerdings halt noch zig andere"}, {"id": 437, "start": 4319.5, "end": 4324.46, "text": "Apps, wir gucken uns gerade mal an, was es da jetzt Neues gibt. Wie gesagt, die letzte"}, {"id": 438, "start": 4324.46, "end": 4333.74, "text": "Version, die ich installiert habe, war 13. OCR könnte man vielleicht mal ausprobieren,"}, {"id": 439, "start": 4333.74, "end": 4342.38, "text": "das ist glaube ich ganz nützlich, wenn es gut funktioniert. Sentry, war Sentry nicht"}, {"id": 440, "start": 4342.38, "end": 4358.3, "text": "so ein bisschen was wie Jenkins, nur neuer. Social Login. Ja das ist jetzt alles nicht"}, {"id": 441, "start": 4358.3, "end": 4361.98, "text": "so das was man jetzt mal ausprobieren muss, das haben wir uns alle schon gesehen, Admin"}, {"id": 442, "start": 4361.98, "end": 4365.3, "text": "Notification, Quota Warning, das ist ganz praktisch, weil man das mit mehreren Leuten"}, {"id": 443, "start": 4365.3, "end": 4377.58, "text": "verwendet. Decryption, wenn man sich Loki eingefangen hat. Ein Audioplayer gibt es"}, {"id": 444, "start": 4377.58, "end": 4384.82, "text": "mittlerweile auch, ok. Ich hatte zwar bisher noch nie das Bedürfnis in meiner Nextcloud"}, {"id": 445, "start": 4384.82, "end": 4388.5, "text": "im Browser Audio Sachen abzuspielen, weil ich mein Audio Zeug überhaupt nicht mehr"}, {"id": 446, "start": 4388.5, "end": 4396.1, "text": "im Lokal hab. Eines der wenigen Clouddienste übrigens, die ich verwende, also Amazon Music."}, {"id": 447, "start": 4396.1, "end": 4406.42, "text": "Ebook reader, Folder Player, GPX Edit, blablabla, das ist alles nicht so das was ich jetzt"}, {"id": 448, "start": 4406.42, "end": 4413.1, "text": "unbedingt brauche. Phone Track, das wollte ich mal ausprobieren. Das wollte ich mal ausprobieren,"}, {"id": 449, "start": 4413.1, "end": 4420.98, "text": "das hab ich schon vor ner Weile gelesen. Da kann man, also aktuell mach ich es ja so,"}, {"id": 450, "start": 4420.98, "end": 4426.22, "text": "meine Presence Detection für Heimautomatisierung besteht ja aus mehreren Sachen, einmal ob"}, {"id": 451, "start": 4426.22, "end": 4434.48, "text": "ich im WLAN bin, ob mein Gerät gepinkt werden kann und solche Geschichten und ich hab auf"}, {"id": 452, "start": 4434.48, "end": 4446.82, "text": "meinem iPhone ne Tracking Software laufen, die nennt sich, wie nennt die sich nochmal?"}, {"id": 453, "start": 4446.82, "end": 4467.18, "text": "Gute Frage, Own Tracks, genau. Das hab ich bei mir laufen auf dem iPhone und das hat"}, {"id": 454, "start": 4467.18, "end": 4472.94, "text": "verschiedene Modi, da kannst du einstellen, wie oft das quasi lockt, wo du gerade bist"}, {"id": 455, "start": 4472.94, "end": 4479.14, "text": "und es funktioniert halt ohne Clouddienste. Der schickt es dann an mein Heimautomatisierung"}, {"id": 456, "start": 4479.14, "end": 4487.42, "text": "System, Heim über nen Server im Internet, verschlüsselt und dann weiß meine Heimautomatisierung"}, {"id": 457, "start": 4487.42, "end": 4492.02, "text": "immer wo ich bin und viel wichtiger, ob ich gerade auf dem Weg Heim bin und ob es spezielle"}, {"id": 458, "start": 4492.02, "end": 4496.46, "text": "Dinge machen soll. Ja und deswegen wollte ich mal Phone Track ausprobieren, das kann"}, {"id": 459, "start": 4496.46, "end": 4500.58, "text": "diese Daten wohl auswerten und man kann sich dann Bewegungsprofile anzeigen lassen und"}, {"id": 460, "start": 4500.58, "end": 4504.94, "text": "was, da seh ich dann keine Ahnung, dass ich immer beim Asia All You Can Eat Freitag sitze"}, {"id": 461, "start": 4504.94, "end": 4517.54, "text": "und All You Can Eat Snackaria Asia mache. Radio, ich hör zwar kein Radio, aber ich will"}, {"id": 462, "start": 4517.54, "end": 4523.5, "text": "es mal ausprobieren, wie gut das funktioniert. Ebook brauch ich nicht, Talk juckt mich überhaupt"}, {"id": 463, "start": 4523.5, "end": 4531.1, "text": "nicht in On Cloud Office Text. Quick Notes, achso da sind irgendwelche Pappen, ne die brauch"}, {"id": 464, "start": 4531.1, "end": 4545.14, "text": "ich nicht. Hatten die nicht auch den Markdown Reader? Notifications for calendar events."}, {"id": 465, "start": 4545.14, "end": 4555.42, "text": "Full Text Search, haben sie das mittlerweile geschafft? Das wäre natürlich sehr nice."}, {"id": 466, "start": 4555.42, "end": 4559.78, "text": "Welches davon sollen wir jetzt nehmen? Full Text Search, Full Text Search Files, Full"}, {"id": 467, "start": 4559.78, "end": 4567.18, "text": "Text Search Elastic Plattform, Full Text Search OCR, was ist davon jetzt das Richtige? Full"}, {"id": 468, "start": 4567.18, "end": 4580.34, "text": "Text Search Bookmarks, weiß ich nicht. Warum haben wir den Markdown Editor gerade nirgendwo"}, {"id": 469, "start": 4580.34, "end": 4591.46, "text": "gesehen oder hab ich den einfach übersprungen? Ich würde ja, ach ist der unter Tools? Ist"}, {"id": 470, "start": 4591.46, "end": 4608.94, "text": "der unter Tools irgendwo? Hier müsste ja A, B, C, D, E, F, G, H, J, K, L, M, Markdown,"}, {"id": 471, "start": 4608.94, "end": 4622.22, "text": "ich seh hier kein Markdown, müsste hier irgendwo sein. Aber was auch immer, brauchen wir jetzt"}, {"id": 472, "start": 4622.22, "end": 4626.66, "text": "eh nicht gerade. So, ach guck mal, das macht wirklich die random Hintergründe, das ist"}, {"id": 473, "start": 4626.66, "end": 4634.22, "text": "ja witzig. Kona, ja. Mal gucken wie das Video abspielen im Browser mittlerweile klappt"}, {"id": 474, "start": 4634.22, "end": 4639.62, "text": "hier. Achso, gut. Obwohl gemerkt, das ist alles in der VM, ne? Wir sind ja eigentlich"}, {"id": 475, "start": 4639.62, "end": 4644.86, "text": "unter Windows und Linux in der VM. Also ich muss sagen, das Webinterface sieht im Prinzip"}, {"id": 476, "start": 4644.86, "end": 4649.62, "text": "noch genauso aus wie unter Nextcloud 13, allerdings hat es schon ein paar sinnvolle Verbesserungen."}, {"id": 477, "start": 4649.62, "end": 4652.58, "text": "Erstmal ein Dark Theme, das hier hätten wir vielleicht noch ein bisschen schöner machen"}, {"id": 478, "start": 4652.58, "end": 4665.02, "text": "können, modified, ein recent used, recent added, das ist auch ganz praktisch. Ok, probieren"}, {"id": 479, "start": 4665.02, "end": 4683.06, "text": "wir mal. Tasks App aus. Highspeed, aber gut, das läuft auch im Raspberry. Tasks, Check,"}, {"id": 480, "start": 4683.06, "end": 4696.54, "text": "Twitch, Chat, Spammen, Wonka, X hinzufügen. So, jetzt haben wir ein paar Tasks, die kann"}, {"id": 481, "start": 4696.54, "end": 4706.66, "text": "man danach jetzt suchen. Kann ich suchen, oder? Kann man die Tasks suchen mittlerweile? Ah,"}, {"id": 482, "start": 4706.66, "end": 4710.86, "text": "sie haben das in die Suche oben integriert. Das ist schon mal gut, das ging das letzte"}, {"id": 483, "start": 4710.86, "end": 4716.7, "text": "Mal noch nicht. Das war bei Nextcloud 13, war das noch kaputt. Man konnte To Do's anlegen,"}, {"id": 484, "start": 4716.7, "end": 4723.22, "text": "konnte die To Do's aber nicht durchsuchen, das fand ich ziemlich fail. Ach man, ok,"}, {"id": 485, "start": 4723.22, "end": 4740.5, "text": "wir testen mal, ob man, ob der auch die zusätzlichen Sachen durchsucht. Achso. Hey! Ok, das ist"}, {"id": 486, "start": 4740.5, "end": 4747.98, "text": "schon mal besser wie vorher. Das ist sogar mal eine, da kann man die App halbwegs gebrauchen"}, {"id": 487, "start": 4747.98, "end": 4765.58, "text": "mittlerweile anscheinend. Completed. Gut, ich meine ich werde, ich verwende als den Webclient"}, {"id": 488, "start": 4765.58, "end": 4771.98, "text": "hier für To Do's wahrscheinlich eh nicht oft, oder aktuell verwende ich ihn nie, aber"}, {"id": 489, "start": 4771.98, "end": 4775.02, "text": "ich habe, ich fand es schon ein bisschen blöd, dass noch nicht mal die Suche funktioniert"}, {"id": 490, "start": 4775.02, "end": 4780.98, "text": "hat vorher, also früher bei der alten Version. Ich meine, eine To Do Anwendung ohne Suche"}, {"id": 491, "start": 4780.98, "end": 4786.3, "text": "ist irgendwie ziemlich sinnlos. Ach ja, wir müssten Thunderbird installieren, um die"}, {"id": 492, "start": 4786.3, "end": 4797.98, "text": "ganzen Kalender- und To Do-Funktionen mal testen zu können. Was haben wir sonst noch"}, {"id": 493, "start": 4797.98, "end": 4823.66, "text": "hier? Radio. Das Dark Theme ist auch nicht so ganz konsistent. Ok, ich weiß nicht, was"}, {"id": 494, "start": 4823.66, "end": 4834.82, "text": "es jetzt hier macht, aber es macht nicht viel. Achso. Das buggt rum auf jeden Fall, wenn man"}, {"id": 495, "start": 4834.82, "end": 4849.5, "text": "es anklickt. Ok, ich meine ich höre kein Radio, aber es sieht auf den ersten Blick"}, {"id": 496, "start": 4849.5, "end": 4855.94, "text": "so aus, als würde es funktionieren. Stimmt, außerdem ist Dark Theme in der Beta. Ok,"}, {"id": 497, "start": 4855.94, "end": 4861.02, "text": "Nodes, gucken wir uns mal die Notiz-Anwendung an. Leider, es gibt wirklich verdammt wenige"}, {"id": 498, "start": 4861.02, "end": 4869.02, "text": "gute Apps für Kalender und To Do's, die nach Möglichkeit auch unter Windows funktionieren"}, {"id": 499, "start": 4869.02, "end": 4877.82, "text": "oder unter Linux, weil Kalender findest du noch halbwegs. Software, die Call of Kalender"}, {"id": 500, "start": 4877.82, "end": 4882.94, "text": "kann, findest du noch halbwegs. Was du eigentlich so gut wie gar nichts findest, ist Software,"}, {"id": 501, "start": 4882.94, "end": 4890.18, "text": "die ordentlich To Do's unterstützt. Es gibt zwar, ich sag mal, Gott und die Welt hat"}, {"id": 502, "start": 4890.18, "end": 4896.86, "text": "einen To Do Programm, allerdings können die meisten dann keine Call of To Do's, was"}, {"id": 503, "start": 4896.86, "end": 4902.94, "text": "wieder doof ist, weil dann kann man es nicht sünken gescheit. Wobei es eigentlich dumm"}, {"id": 504, "start": 4902.94, "end": 4909.54, "text": "ist, weil iOS kann es von Haus aus, die Standard To Do App, unter Android ist es relativ einfach"}, {"id": 505, "start": 4909.54, "end": 4915.1, "text": "hinzuzufügen, aber so wirklich für einen Desktop gibt es kaum gescheite Call of Anwendungen."}, {"id": 506, "start": 4915.1, "end": 4921.34, "text": "Aber Call of ist auch ein scheiß Protokoll, muss man ehrlich sagen. Das ist so ekliges"}, {"id": 507, "start": 4921.34, "end": 4929.58, "text": "XML-Geschwubbel, also ich will nicht sagen, dass es vom Ansatz her schlecht ist, aber vom"}, {"id": 508, "start": 4929.58, "end": 4937.58, "text": "Protokoll an sich. Ich mein, keiner macht 2019 auch gerne XML. Oder haben wir XML?"}, {"id": 509, "start": 4937.58, "end": 4944.98, "text": "XML-Cuties am Start. Kennst du Task Warrior? Ja, Task Warrior ist ziemlich gut. Das Problem"}, {"id": 510, "start": 4944.98, "end": 4951.58, "text": "ist, dass Task Warrior auch nicht für alle Plattformen zur Verfügung steht. Ist Own"}, {"id": 511, "start": 4951.58, "end": 4958.62, "text": "Cloud nicht besser? Nö. Next Cloud ist quasi Own Cloud, bloß moderner und mit den ursprünglichen"}, {"id": 512, "start": 4958.62, "end": 4968.3, "text": "Leuten hinter Own Cloud. Task Warrior ist das Problem, dass du es nicht... Also Task Warrior"}, {"id": 513, "start": 4968.3, "end": 4975.34, "text": "könntest du auf zwei Sachen lösen. Entweder sie würden Clients rausbringen für alle Plattformen,"}, {"id": 514, "start": 4975.34, "end": 4979.34, "text": "dann könntest du es verwenden. Das bedeutet allerdings auch für Windows, für iOS und"}, {"id": 515, "start": 4979.34, "end": 4986.66, "text": "für Linux, für Mac und für Android. Und ich glaube für iOS zum Beispiel gibt es keinen"}, {"id": 516, "start": 4986.66, "end": 4995.66, "text": "ordentlichen Task Warrior Client. Oder aber sie würden Sync zu Kaldorf erlauben. Wahnsinnig."}, {"id": 517, "start": 4995.66, "end": 5003.66, "text": "Ok, Nodes. Ok, New Node. Ist ganz schön langsam, aber das ist auch noch Raspberry. Und man"}, {"id": 518, "start": 5003.66, "end": 5010.26, "text": "merkt, dass das Darkseam Beta ist, weil so wirklich schön verdienen lässt sich noch"}, {"id": 519, "start": 5010.26, "end": 5023.66, "text": "nicht. Ok, also Rhyme, Nodes. Tolle Nodes. Ach so, ah. Das ist der neue Markdown Editor"}, {"id": 520, "start": 5023.66, "end": 5030.3, "text": "hier im... Der noch nicht mal List... Ah doch, macht er. List, macht er. Kann er Syntax"}, {"id": 521, "start": 5030.3, "end": 5035.34, "text": "Highlight? Das ist immer... Wenn ihr mal ordentlichen Markdown Editor testen wollt, guckt ob er"}, {"id": 522, "start": 5035.34, "end": 5040.54, "text": "Syntax Highlight kann, dann seht ihr gleich ob das Ding ordentlich ist oder nicht. Nope,"}, {"id": 523, "start": 5040.54, "end": 5065.1, "text": "kann er nicht. Ist kein ordentlicher Markdown Editor. Kein Syntax Highlight. Für Code"}, {"id": 524, "start": 5065.1, "end": 5077.66, "text": "Logs. Ja und... Ender Boy, wie nennt sich das? Mathjacks oder so, ne? Es gibt ja mittlerweile"}, {"id": 525, "start": 5077.66, "end": 5082.26, "text": "für Markdown die Plugins, dass du da direkt Latex drin machen kannst, dass du da Mathjacks"}, {"id": 526, "start": 5082.26, "end": 5097.82, "text": "drin machen kannst. Ja ich glaub so heißt das. Das ist als... Ja, das da. Dass man Formel"}, {"id": 527, "start": 5097.82, "end": 5101.82, "text": "einfügen kann. Ja dafür hätte ich auch gerne Support. Wollen wir mal ausprobieren ob das"}, {"id": 528, "start": 5101.82, "end": 5110.22, "text": "funktioniert? Ich denke nicht, dass es funktioniert. Brauchen wir mal ein Beispiel? Ich glaube"}, {"id": 529, "start": 5110.22, "end": 5116.98, "text": "nicht, dass es funktioniert. Wobei, wo kann man sich jetzt das Geränder da anzeigen lassen?"}, {"id": 530, "start": 5116.98, "end": 5138.3, "text": "Preview. Nee, kann er nicht. Kann er nicht. Aber zumindest so Basic Markdown. Aber sag"}, {"id": 531, "start": 5138.3, "end": 5142.42, "text": "man mal so, das ist jetzt nichts tolles, weil... Warum kann man hier jetzt nicht mehr drinne"}, {"id": 532, "start": 5142.42, "end": 5145.98, "text": "markieren? Das ist jetzt auch wirklich nichts tolles, dass sie das mittlerweile eingebaut"}, {"id": 533, "start": 5145.98, "end": 5156.5, "text": "haben, weil so nen 0815 Textfeld mit Markdown Syntax machst du in 5 Zeilen JavaScript. Was"}, {"id": 534, "start": 5156.5, "end": 5163.26, "text": "ist mein Lieblings Markdown Editor? Ich hab ihn ehrlich gesagt noch nicht gefunden. Mein"}, {"id": 535, "start": 5163.26, "end": 5168.54, "text": "Lieblings Editor an sich ist eigentlich Wim, weil ich den direkt hier inline im Terminal"}, {"id": 536, "start": 5168.54, "end": 5174.78, "text": "aufmachen kann. Allerdings ist Visual Studio Code in letzter Zeit auch schwer gestiegen"}, {"id": 537, "start": 5174.78, "end": 5180.22, "text": "bei mir so in der Nutzungsdauer. Die Musik, ja ich weiß auch nicht was mit das da los"}, {"id": 538, "start": 5180.22, "end": 5193.94, "text": "ist. Die wiederholt sich vor allem die ganze Zeit und ist zu laut. Ansonsten klingt die"}, {"id": 539, "start": 5193.94, "end": 5198.06, "text": "ganz okay, aber warum sich das wiederholt, versteh ich auch nicht. Wahrscheinlich hat"}, {"id": 540, "start": 5198.06, "end": 5212.7, "text": "der Typ bloß 30 Sekunden gemacht und die haben da draußen einen 5 Minuten Track gebastelt."}, {"id": 541, "start": 5212.7, "end": 5218.66, "text": "Am liebsten wär mir ja, wenn Emacs Org Mode nen ordentlichen Kaldorf Sync hätte. Hat"}, {"id": 542, "start": 5218.66, "end": 5225.5, "text": "es aber nicht. Es hat so nen ganz ganz rudimentären Sync, der aber zum Beispiel schon daran aufhört,"}, {"id": 543, "start": 5225.5, "end": 5231.1, "text": "dass es keine To-Do Sync hat und dass der Two-Base Sync auch nicht ordentlich funktioniert."}, {"id": 544, "start": 5231.1, "end": 5242.42, "text": "Das wär mir am liebsten. So jetzt müssen wir mal, ich brauch jetzt zwei Sachen, wir"}, {"id": 545, "start": 5242.42, "end": 5249.34, "text": "müssen Thunderbird installieren, weil Thunderbird der einzige Cross-Platform Kaldorf Klein ist,"}, {"id": 546, "start": 5249.34, "end": 5264.9, "text": "der nicht sackt und der sackt an sich schon ziemlich, doch der am wenigsten sackt. Eine"}, {"id": 547, "start": 5264.9, "end": 5279.86, "text": "Runde Thunderbird und dann brauchen wir den Nextcloud Klein und Sync ein paar Files."}, {"id": 548, "start": 5279.86, "end": 5295.78, "text": "Ach nee, Server Address, okay, da, da, Nextcloud, komm her, hier weg, Server Address, next,"}, {"id": 549, "start": 5295.78, "end": 5313.86, "text": "nicht HTTPS, HTTPS, connect to your account. Oh, die haben jetzt so einen komischen Authentifizierungswizard"}, {"id": 550, "start": 5313.86, "end": 5324.78, "text": "hier noch am Start. Login, Admin 123456, hohes, segures Passwort. Was willst du mit Nextcloud"}, {"id": 551, "start": 5324.78, "end": 5328.1, "text": "machen? Eigentlich hauptsächlich Files Sync bei mir daheim und ab und zu ein paar Sachen"}, {"id": 552, "start": 5328.1, "end": 5334.86, "text": "halt vom Smartphone, meine ganzen Notizenkrams vom Smartphone Sync und Kalender, To-Do's"}, {"id": 553, "start": 5334.86, "end": 5347.82, "text": "und Kontakte. Also eigentlich die Basics. Und das, was, Account, Grand Access. Der Button"}, {"id": 554, "start": 5347.82, "end": 5357.62, "text": "bringt es auch richtig, wenn du sonst nichts machen kannst auf der Seite. Okay, Sync everything"}, {"id": 555, "start": 5357.62, "end": 5379.78, "text": "from Server as Confirmable. Home Test, Nextcloud, ja, okay, passt, connect. Es synkt. Es ist"}, {"id": 556, "start": 5379.78, "end": 5389.54, "text": "gesynkt. Nextcloud. Ah, sehr schön. Funzt. Gut, dann machen wir mal ein bisschen was größeres"}, {"id": 557, "start": 5389.54, "end": 5394.58, "text": "rein und gucken was passiert. Wir sind jetzt mal, wir sind jetzt mal gemein, wir machen"}, {"id": 558, "start": 5394.58, "end": 5401.86, "text": "jetzt mal Nextcloud, mal gucken wie, mal gucken wie er das handelt. Das bedeutet gar nichts,"}, {"id": 559, "start": 5401.86, "end": 5407.5, "text": "das bedeutet ich hab mich verschrieben und mein LS-Kommando ist so schlau und checkt,"}, {"id": 560, "start": 5407.5, "end": 5415.66, "text": "dass ich das gar nicht haben will. Welche Distribution ist das eigentlich? Das ist Manjaro,"}, {"id": 561, "start": 5415.66, "end": 5424.74, "text": "Manjaro mit i3 als Desktop. Okay, gucken wir mal wie das den DD handelt. Ich mein, dafür"}, {"id": 562, "start": 5424.74, "end": 5429.46, "text": "ist es nicht gedacht, aber wir können es ja mal ausbringen. Von Def Random, wir machen"}, {"id": 563, "start": 5429.46, "end": 5444.22, "text": "mal nicht nullen, wir machen random. Von Def Random nach blob.dxd, blob.bin, die Änderung"}, {"id": 564, "start": 5444.22, "end": 5450.18, "text": "ist ja, wie gesagt, das ist eigentlich egal. Blocksize 1M, count, machen wir mal 10, wir"}, {"id": 565, "start": 5450.18, "end": 5462.9, "text": "machen mal eine 10mb-Datei. Def Random ist übelst lahm, ne? Stimmt. Was war, u-random"}, {"id": 566, "start": 5462.9, "end": 5476.26, "text": "war glaub ich schneller, gell? Urandom, jawoll. So, und jetzt synkt das jetzt? Noch hat's"}, {"id": 567, "start": 5476.26, "end": 5489.66, "text": "nicht gesynkt, ne? Hat es schon gesynkt? Hat schon gesynkt. Oh, das hat er aber schnell"}, {"id": 568, "start": 5489.66, "end": 5503.06, "text": "kapiert. RM. Ah, okay, das geht schneller als bei 13 noch. Bei 13 hat das eine ganze"}, {"id": 569, "start": 5503.06, "end": 5512.38, "text": "Ecke gedauert oftmals. Was ist daran besser als Google Drive oder Dropbox? Nix. Also von"}, {"id": 570, "start": 5512.38, "end": 5519.98, "text": "der Funktion her nicht wirklich nix. Es kann mehr, aber von der Funktion her, vom"}, {"id": 571, "start": 5519.98, "end": 5525.42, "text": "Filesync her, also ich würde sagen, dass der reine Sync von Dropbox wahrscheinlich"}, {"id": 572, "start": 5525.42, "end": 5534.26, "text": "besser ist. Zumindest hatte ich in der Vergangenheit mit dem Sync Probleme von Nextcloud. Aber"}, {"id": 573, "start": 5534.26, "end": 5540.46, "text": "wenn es dich nicht stört, deine Daten woanders liegen zu haben als bei dir, dann kannst du"}, {"id": 574, "start": 5540.46, "end": 5548.02, "text": "natürlich auch Dropbox nehmen. Also wenn man keine Abneigung gegen Cloud-Software hat,"}, {"id": 575, "start": 5548.02, "end": 5551.94, "text": "dann braucht man das auch nicht. Das ist nur für Leute, die die Sache bei sich lokal"}, {"id": 576, "start": 5551.94, "end": 5566.5, "text": "laufen lassen wollen. Und ich will halt mein Zeug nicht bei Dropbox oder bei Google Drive"}, {"id": 577, "start": 5566.5, "end": 5575.74, "text": "oder bei Amazon Drive oder was da so noch alles gibt lagern. Es gibt eine ganz gute Zwischenlösung,"}, {"id": 578, "start": 5575.74, "end": 5580.18, "text": "wenn man sagt, hey, man möchte nicht sein eigenes Filesync-Ding betreiben. Ich meine,"}, {"id": 579, "start": 5580.18, "end": 5585.46, "text": "da gehört ja auch noch ein bisschen was für Aluhutler, genau. Da gehört ja noch ein bisschen"}, {"id": 580, "start": 5585.46, "end": 5593.54, "text": "mehr dazu. Wenn du wirklich das so betreiben möchtest, dass du es nutzen kannst ein bisschen"}, {"id": 581, "start": 5593.54, "end": 5597.5, "text": "wie Dropbox, dann musst du dir auch dafür sorgen, dass das extern erreichbar ist. Und"}, {"id": 582, "start": 5597.5, "end": 5601.5, "text": "extern erreichbar in einem privaten Service ist immer doof, was dann wiederum heißt,"}, {"id": 583, "start": 5601.5, "end": 5606.06, "text": "du brauchst wahrscheinlich einen VPN. Das ist schön und sicher funktioniert und ganz"}, {"id": 584, "start": 5606.06, "end": 5613.6, "text": "gut. Da gehört dann ein bisschen mehr dazu. Wie greifst du jetzt von außerhalb drauf"}, {"id": 585, "start": 5613.6, "end": 5621.06, "text": "zu? Gar nicht. Ich mache das ganz primitiv. Ich trage einfach Sachen bei mir ein oder"}, {"id": 586, "start": 5621.06, "end": 5627.74, "text": "ich mache Notizen bei mir auf dem Tablet oder so. Und sobald das Tablet bei mir daheim"}, {"id": 587, "start": 5627.74, "end": 5638.22, "text": "ins WLAN geht, dann synkt es das. Das reicht aber auch. Genau, es gibt auch eine ganz gute"}, {"id": 588, "start": 5638.22, "end": 5645.74, "text": "Zwischenlösung. Wenn man Google Drive oder Dropbox verwenden will, dann kann man einfach"}, {"id": 589, "start": 5645.74, "end": 5650.22, "text": "das verschlüsselt machen. Allerdings sollte man darauf achten, dass das ein Verfahren"}, {"id": 590, "start": 5650.22, "end": 5656.58, "text": "ist, was dann eine jeweilige mobile Client auch unterstützt. Wenn man nur Linux-Systeme"}, {"id": 591, "start": 5656.58, "end": 5661.86, "text": "hat, kann man einfach NKFS oder so etwas verwenden. Oder was? E-Crypt-FS. Ich habe"}, {"id": 592, "start": 5661.86, "end": 5667.06, "text": "schon ewig nicht mehr verwendet. Der verschlüsselt auf Dateiebene. Und das ist wichtig, wenn"}, {"id": 593, "start": 5667.06, "end": 5672.06, "text": "man sowas wie Google Drive verschlüsselt verwenden will, dann muss man auf Dateiebene"}, {"id": 594, "start": 5672.06, "end": 5677.74, "text": "verschlüsseln, nicht auf Device-Ebene. Also auf Device-Ebene sieht das Dropbox und"}, {"id": 595, "start": 5677.74, "end": 5686.9, "text": "Google Drive gar nicht. Und du kannst auch nicht einfach einen True-Crypt oder einen"}, {"id": 596, "start": 5686.9, "end": 5693.54, "text": "Vera-Crypt-Container nehmen und auf dein Dropbox-Laufwerk legen, weil dann denkt Dropbox, dass bei"}, {"id": 597, "start": 5693.54, "end": 5700.78, "text": "jeder Änderung sich die gesamte Datei geändert hat. Das macht das Ding kaputt. Das funktioniert"}, {"id": 598, "start": 5700.78, "end": 5708.74, "text": "nicht. Das heißt, man muss irgendetwas nehmen, was auf Dateiebene verschlüsselt. Ja, und"}, {"id": 599, "start": 5708.74, "end": 5711.94, "text": "man braucht halt Clients, die es wieder entschlüsseln können. Was ist denn mit der Musik los? Die"}, {"id": 600, "start": 5711.94, "end": 5725.02, "text": "ist wirklich kacke. Concentrate your Asian... Ah, nee, nee. Kein Hip-Hop Zeug. A relaxing"}, {"id": 601, "start": 5725.02, "end": 5740.66, "text": "study. Procursive Housemix, was sagt der Zeug gibt? Oh, nee. Ich sag eigentlich überhaupt"}, {"id": 602, "start": 5740.66, "end": 5748.94, "text": "nicht meine Musikrichtung, aber im Hintergrund kann ich mir jetzt kein Heavy-Metal-Gehemmere"}, {"id": 603, "start": 5748.94, "end": 5754.22, "text": "anhören oder sowas. Auch wenn es mir besser gefällt für Stream-Hintergrund, vor allem"}, {"id": 604, "start": 5754.22, "end": 5773.86, "text": "wenn man sich ein bisschen konzentrieren muss, ist das nichts. So, wo sind wir stehen geblieben?"}, {"id": 605, "start": 5773.86, "end": 5784.14, "text": "Genau, wir wollten gucken, ob der ganze Kram synkt. Können wir nochmal testen. Also, drauf"}, {"id": 606, "start": 5784.14, "end": 5789.1, "text": "die Ideen funktioniert wunderbar und schnell. Gucken wir mal, was er macht, wenn man das"}, {"id": 607, "start": 5789.1, "end": 5792.78, "text": "ein bisschen hintereinander spammt. Wahrscheinlich nix, wahrscheinlich synkt er einfach das Neueste."}, {"id": 608, "start": 5792.78, "end": 5802.3, "text": "Ja, was passiert, wenn wir die gleiche Datei... Ah, das synkt er neu. Haha. Was natürlich"}, {"id": 609, "start": 5802.3, "end": 5806.94, "text": "auch nicht ganz optimal ist, wenn er die gleiche Datei mit dem gleichen Inhalt doppelt synkt."}, {"id": 610, "start": 5806.94, "end": 5814.7, "text": "Egal, aber der Synk wirkt jetzt schon deutlich stabiler als das letzte Mal. Das letzte Mal"}, {"id": 611, "start": 5814.7, "end": 5818.1, "text": "hat er hier teilweise irgendwie eine Minute rumgewurstet, bis er überhaupt angefangen"}, {"id": 612, "start": 5818.1, "end": 5827.54, "text": "hat zu synken. Milch ist auch Gift, ja. Milch ist vor allem mittlerweile ein Symbol... Oh,"}, {"id": 613, "start": 5827.54, "end": 5839.14, "text": "ne, was haben sie erzählt? Ein Symbol weißer, männlicher Weltanschauung, ja. Milch. Mittlerweile"}, {"id": 614, "start": 5839.14, "end": 5844.66, "text": "nimmt das alles Ausmaße an, da denkst du dir, was geht mit denen ab. Und ihr wisst ja auch,"}, {"id": 615, "start": 5844.66, "end": 5853.86, "text": "das Wort Woman oder Women ist auch ganz furchtbar sexistisch, ja. Weil da kommt das Wort, da"}, {"id": 616, "start": 5853.86, "end": 5872.86, "text": "kommt in Woman, kommt Mann drin vor. Und das ist böse. Das ist ganz böse. Deswegen sagt"}, {"id": 617, "start": 5872.86, "end": 5885.34, "text": "man jetzt, wenn man quasi nicht anecken will bei Feministen, muss man sagen Woman. Klingt"}, {"id": 618, "start": 5885.34, "end": 5898.7, "text": "zwar übel, als könnte man nicht richtig sprechen, aber so ist das heutzutage. Woman. Also irgendwie"}, {"id": 619, "start": 5898.7, "end": 5902.94, "text": "sind sie... Irgendwie die Welt ist teilweise schon nicht mehr ganz dicht, ist das anbelangt."}, {"id": 620, "start": 5902.94, "end": 5917.5, "text": "Okay, ähm, tja, wo sind wir stehen geblieben? Weiter. Also, SYNK sieht erstmal okay aus."}, {"id": 621, "start": 5917.5, "end": 5926.7, "text": "Wir können... Wir müssen jetzt eigentlich mal probieren, mal 5000 Files zu synken. Ich"}, {"id": 622, "start": 5926.7, "end": 5933.06, "text": "zeige euch jetzt nochmal was. Ähm, oder machen wir mal, machen wir mal Fangfrage. Was ist"}, {"id": 623, "start": 5933.06, "end": 5939.26, "text": "die einfachste Variante, 1000 Files zu erstellen? Jetzt hier auf der Shell unter Linux in diesem"}, {"id": 624, "start": 5939.26, "end": 5952.46, "text": "Verzeichnis. Dateien sollen heißen 1 bis 1000. Ah, Q-Chat fragen. Also ich, ich weiß, wie"}, {"id": 625, "start": 5952.46, "end": 5958.18, "text": "es geht, aber vielleicht, was habt ihr da so für Ideen? Dateien erstellen 1000 Stück,"}, {"id": 626, "start": 5958.18, "end": 5962.94, "text": "1 bis 1000 soll der Dateiname sein, möglichst kurz und knackig jetzt hier auf der Shell."}, {"id": 627, "start": 5962.94, "end": 5968.38, "text": "Wie würdet ihr es machen? Irgendeine Vorlobe in der Bash, das geht noch einfacher, aber"}, {"id": 628, "start": 5968.38, "end": 5976.38, "text": "das ist schon mal ein guter Ansatz. Vorlobe in der Bash ist auf jeden Fall nicht verkehrt."}, {"id": 629, "start": 5976.38, "end": 5983.86, "text": "Touch 1, Touch 1 ist schon mal gut. Ah ne, Touch 1, 2 ist, äh, das ist zu langsam. Man"}, {"id": 630, "start": 5983.86, "end": 5994.22, "text": "kann sowas hier machen. Touch, 1 bis 1000. Und bam, hat man 1000 Files. Mal gucken, was"}, {"id": 631, "start": 5994.22, "end": 6010.34, "text": "das Ding da jetzt macht. Ohje. Jetzt, jetzt haben wir es. Jetzt haben wir es geschafft."}, {"id": 632, "start": 6010.34, "end": 6020.18, "text": "Wow. Wo kommt die Auslastung her? Das sind 0-byte-Dateien. Warum verursachen, warum verursachen"}, {"id": 633, "start": 6020.18, "end": 6026.98, "text": "1000 Dateien mit 0-byte so eine krasse Auslastung? Na gut, ist logisch eigentlich, die muss neu"}, {"id": 634, "start": 6026.98, "end": 6032.26, "text": "angelegt werden. Das heißt, es müssen neue Metadaten gespeichert werden in der SQLite-Datenbank"}, {"id": 635, "start": 6032.26, "end": 6040.02, "text": "von Nextcloud. Aber es wirkt mir doch ein bisschen ziemlich CPU-intensiv für 1000 leere"}, {"id": 636, "start": 6040.02, "end": 6055.9, "text": "Dateien. Und wir sind wohlgemerkt, wir sind auf der SSD, ne? Wir sind auf der SSD. Also,"}, {"id": 637, "start": 6055.9, "end": 6062.86, "text": "wir sind jetzt nicht irgendwie auf der langsamen MicroSD-Karte, sondern auf der SSD. Ja, für"}, {"id": 638, "start": 6062.86, "end": 6077.7, "text": "Mephisto Boy ganz bestimmt, ganz bestimmt. Das kennen die meisten wahrscheinlich schon,"}, {"id": 639, "start": 6077.7, "end": 6089.78, "text": "oder? Was der Mephisto Boy hier gepostet hat. Das da. Ich mache mal sicherheitshalber einen"}, {"id": 640, "start": 6089.78, "end": 6094.82, "text": "Comment davor. Kennt ihr das, was das macht? Weil es gibt ein paar Seiten, wo die Leute"}, {"id": 641, "start": 6094.82, "end": 6103.5, "text": "lustig sind und sowas als Antworten posten. Das wird euer System nicht killen, aber das"}, {"id": 642, "start": 6103.5, "end": 6112.26, "text": "wird dafür sorgen, dass sich euer System aufhängt bis zu einem Reboot. Und zwar macht es das"}, {"id": 643, "start": 6112.26, "end": 6120.46, "text": "folgendermaßen. Es ist ein bisschen schwierig zu erkennen, aber das ist eine Funktion in"}, {"id": 644, "start": 6120.46, "end": 6128.14, "text": "Bash. Funktionsname ist Doppelpunkt. Das ist Funktionsdefinition. Das hier ist Body von"}, {"id": 645, "start": 6128.14, "end": 6139.22, "text": "der Funktion. Und hier in der Stelle nichts anderes macht, wie sich selbst aufzurufen"}, {"id": 646, "start": 6139.22, "end": 6143.98, "text": "und sich selbst noch mal im Hintergrund zu starten. Danach wird das beendet als Befehl,"}, {"id": 647, "start": 6143.98, "end": 6147.94, "text": "dass ich auf die gleiche Zeile was Neues schreiben kann. Und jetzt rufe ich das zum ersten Mal"}, {"id": 648, "start": 6147.94, "end": 6152.94, "text": "auf. Das heißt, hier wird es zum ersten Mal aufgerufen. Es verdoppelt sich. Ruft sich"}, {"id": 649, "start": 6152.94, "end": 6169.1, "text": "wieder selbst auf, verdoppelt sich, verdoppelt sich das. Das ist eine Frogbomb. Wenn man"}, {"id": 650, "start": 6169.1, "end": 6179.62, "text": "das ausführt, kackt euer System ab. Einfach weil RAM und alles so rekrutiert. Ja, im Endeffekt"}, {"id": 651, "start": 6179.62, "end": 6193.34, "text": "schon. Es forgt sich halt zu Tode. Hab ich auch gelesen, Sebaro. Oh, er ist fertig."}, {"id": 652, "start": 6193.34, "end": 6206.9, "text": "So, wenn ich jetzt refresche, habe ich hier jetzt 1000 Dateien drinnen. Ägitt, Endless"}, {"id": 653, "start": 6206.9, "end": 6225.9, "text": "Scroll. Endless Scroll. Weiche. Endless Scroll. Please. Kein Endless Scroll. Tut mir das nicht"}, {"id": 654, "start": 6225.9, "end": 6245.22, "text": "leid. Macht Pages. Kein Endless Scroll. Kann man das umstellen? Doch, ich möchte Pages"}, {"id": 655, "start": 6245.22, "end": 6258.26, "text": "haben. Ich mag kein Endless Scroll. Guckt euch die YouTube-Comments an, wie beschissen"}, {"id": 656, "start": 6258.26, "end": 6262.98, "text": "das mit Endless Scroll ist. Du findest überhaupt nichts mehr richtig. Wenn ich jetzt ein Video"}, {"id": 657, "start": 6262.98, "end": 6270.14, "text": "habe mit 1000 Comments und ich bin halt jemand, der liest alle Comments unter seinen Videos,"}, {"id": 658, "start": 6270.14, "end": 6276.94, "text": "und ich weiß auch, da hat mal einer was gepostet. Das war relativ am Anfang vom Video. Ich finde"}, {"id": 659, "start": 6276.94, "end": 6286.9, "text": "den Scheiß nicht mehr. Doch, bei Dateien auch. Mag das nicht. Guck mal, es ist doch total"}, {"id": 660, "start": 6286.9, "end": 6291.78, "text": "beknackt. Warum muss ich jetzt, mal angenommen, ich will jetzt Datei, wenn wir mal ausblenden,"}, {"id": 661, "start": 6291.78, "end": 6298.3, "text": "dass es eine Suche gibt. Ich weiß, ich will Datei 500 haben. Warum muss ich dann Endless"}, {"id": 662, "start": 6298.3, "end": 6306.58, "text": "Scroll machen, bis 500? Warum kann ich nicht einfach auf Seite 8 gehen, oder sowas? Und"}, {"id": 663, "start": 6306.58, "end": 6315.26, "text": "übrigens, ein Dateibrowser macht das auch nicht so. Ein Dateibrowser macht das, ach"}, {"id": 664, "start": 6315.26, "end": 6322.58, "text": "nee, warum habe ich jetzt gefräscht. Ein Dateibrowser zeigt dir einfach alle Dateien"}, {"id": 665, "start": 6322.58, "end": 6330.26, "text": "auf einmal an, und Endless Scroll nicht. Ich habe ja nicht das Problem, dass das alle Dateien"}, {"id": 666, "start": 6330.26, "end": 6333.58, "text": "auf einer Seite hat. Ich habe das Problem, dass nicht alle Dateien da standardmäßig"}, {"id": 667, "start": 6333.58, "end": 6339.54, "text": "drin stehen. Ich mag kein Endless Scroll. Auf Reddit ist das auch die Pest Endless Scroll."}, {"id": 668, "start": 6339.54, "end": 6347.38, "text": "Und auf Reddit Mobile sagen sie immer noch, ja installier dir doch die App, dann hast"}, {"id": 669, "start": 6347.38, "end": 6351.14, "text": "du Endless Scroll. Das ist für mich ein weiterer Grund zu sagen, nee, Reddit, ich installiere"}, {"id": 670, "start": 6351.14, "end": 6359.14, "text": "bestimmt keine Reddit App, weil ich will gerade kein Endless Scroll haben. Ich mag"}, {"id": 671, "start": 6359.14, "end": 6366.34, "text": "kein Endless Scroll, und zumindest sollte es optional sein. Oder umgedreht, wenn man"}, {"id": 672, "start": 6366.34, "end": 6371.14, "text": "schon sagt Default Endless Scroll, könnte man ja halt hier oben irgendwas machen mit"}, {"id": 673, "start": 6371.14, "end": 6379.3, "text": "Endless Scroll ausschalten. LazyLoady macht aber schon den Fall zu Millionen von Adayas,"}, {"id": 674, "start": 6379.3, "end": 6384.3, "text": "das ist korrekt, allerdings hätte ich Millionen Dateien nicht in einem Ordner."}, {"id": 675, "start": 6384.3, "end": 6400.62, "text": "How to disable Infinite Scroll? Gar nicht anscheinend. Was für eine Distro, das ist"}, {"id": 676, "start": 6400.62, "end": 6414.9, "text": "mancharo mit i3-WM. Ja anscheinend geht das nicht zu disablen. Ich meine, das ist jetzt"}, {"id": 677, "start": 6414.9, "end": 6420.78, "text": "kein KO Kriterium, ich mag Endless Scroll, aber einfach nicht. Das fängt schon damit"}, {"id": 678, "start": 6420.78, "end": 6423.66, "text": "an, wenn ich jetzt hier irgendwas tracken und droppen will, da muss ich dann hier so"}, {"id": 679, "start": 6423.66, "end": 6429.78, "text": "komisch rumwursten, bis das geladen ist, also es ist nicht schön. Also mir gefällt's nicht."}, {"id": 680, "start": 6429.78, "end": 6433.82, "text": "Ich kann verstehen, wenn man sagt, das ist Geschmackssache, mir kann aber keiner erzählen"}, {"id": 681, "start": 6433.82, "end": 6439.66, "text": "so nach dem Motto, Endless Scroll ist beste. Es bleibt Geschmackssache. Und mir gefällt"}, {"id": 682, "start": 6439.66, "end": 6451.66, "text": "Endless Scroll nicht. Wie die sich auf Twitter aufgeregt haben, wo ich mein Zenf zum Call"}, {"id": 683, "start": 6451.66, "end": 6456.34, "text": "of Duty 2, was es 2-Modus gegeben hab. Da waren ja paar richtig angepisste Call of Duty"}, {"id": 684, "start": 6456.34, "end": 6474.78, "text": "3-Modus wieder dabei diesmal. Wie markiert man denn jetzt hier alle? Geht das? Kann man"}, {"id": 685, "start": 6474.78, "end": 6488.22, "text": "sowas machen, wie markieren von hier bis Ende, Select File Range. Guckt euch das mal an,"}, {"id": 686, "start": 6488.22, "end": 6513.74, "text": "das ist doch nicht normal. Endless Scroll. Bleibt mir ja gar nichts anderes übrig. Und"}, {"id": 687, "start": 6513.74, "end": 6522.3, "text": "jetzt sagen wir Delete. Und nun kriegt er das mit. Weil jetzt könnten wir einen Konflikt"}, {"id": 688, "start": 6522.3, "end": 6531.26, "text": "verursachen. Das ist huge langsam. Gut, das liegt aber am Raspberry, das geht vor"}, {"id": 689, "start": 6531.26, "end": 6538.78, "text": "anderem, da wär das schneller gegangen. Der brauche beim Löschen noch mehr CPU-Last von"}, {"id": 690, "start": 6538.78, "end": 6547.74, "text": "1000 leeren Dateien, als beim Anlegen von 1000 leeren Dateien. Der Chat gerade. Ich kann"}, {"id": 691, "start": 6547.74, "end": 6551.82, "text": "nicht oben einen Haken setzen, weil die Dateien, die will ich ja behalten. Ich wollte ja wirklich"}, {"id": 692, "start": 6551.82, "end": 6574.82, "text": "nur Dateien von 1 bis 1000 haben. Geht RM 1 bis 1000? Klar geht das. Ich wollte es ja"}, {"id": 693, "start": 6574.82, "end": 6580.34, "text": "übers Webinterface löschen, weil das mit RM funktioniert ist klar. Ich wollte mir angucken,"}, {"id": 694, "start": 6580.34, "end": 6584.3, "text": "wie das funktioniert übers Webinterface. Ah, ok, der Sync alle paar Sekunden anscheinend"}, {"id": 695, "start": 6584.3, "end": 6591.26, "text": "neu. Ok, jetzt. Das geht. Also ich muss sagen, der Sync macht einen ganz soliden Eindruck."}, {"id": 696, "start": 6591.26, "end": 6605.54, "text": "Auf jeden Fall besser als bei Nextcloud 13 noch. Es könnte ein bisschen schneller sein,"}, {"id": 697, "start": 6605.54, "end": 6613.9, "text": "ja. Letztendlich legen wir 1000 leere Dateien an und löschen 1000 leere Dateien. Es könnte"}, {"id": 698, "start": 6613.9, "end": 6618.06, "text": "ein bisschen schneller gehen, aber das schiebe ich jetzt einfach mal darauf, dass das nicht"}, {"id": 699, "start": 6618.06, "end": 6623.26, "text": "für Massen an Dateien anlegen und löschen gerade optimiert ist und dass es auf einem"}, {"id": 700, "start": 6623.26, "end": 6629.26, "text": "Raspberry läuft und dass es mit SQLite läuft. Wobei SQLite performance-mäßig gar nicht"}, {"id": 701, "start": 6629.26, "end": 6641.26, "text": "übel ist als Single-User. Mit mehr Anfangs wird es schwierig. Ja, genau, der Typ. Ganz"}, {"id": 702, "start": 6641.26, "end": 6644.78, "text": "ehrlich, dann geh Battle Spiel spielen, wenn es dir nicht gefällt. Da hatten wir auch"}, {"id": 703, "start": 6644.78, "end": 6652.7, "text": "ein paar in den Comments drunter. Da hatten wir wieder einen Typ in den Comments, der hat"}, {"id": 704, "start": 6652.7, "end": 6660.3, "text": "ein übelst dämliches Kommentar gepostet und auch gleich rumgeflamet. Da hab ich dann drauf"}, {"id": 705, "start": 6660.3, "end": 6667.46, "text": "geantwortet, ey, du Dummschwerzer, blablabla. Also sein Comment war schon komplett unter"}, {"id": 706, "start": 6667.46, "end": 6672.62, "text": "aller Kanone. Ich hab einfach nur drauf geantwortet, ey, du Dummschwerzer, dann erzähl mir mal,"}, {"id": 707, "start": 6672.62, "end": 6676.3, "text": "was hat dir denn an den Modus gefallen? Irgendwie sowas. Und da hat er gesagt, ja, da geh ich"}, {"id": 708, "start": 6676.3, "end": 6683.22, "text": "jetzt gar nicht drauf ein. Wahrscheinlich, weil dir nichts einfällt. Da hast du schon"}, {"id": 709, "start": 6683.22, "end": 6696.06, "text": "immer Spezialisten teilweise am Start. Patrick, De-Abo macht man heute nicht mehr. Heute macht"}, {"id": 710, "start": 6696.06, "end": 6701.98, "text": "man, das müssen wir mit dem passenden Nachdruck, heute macht man kein De-Abo, heute macht man"}, {"id": 711, "start": 6701.98, "end": 6719.26, "text": "Dis-Abo, macht man heute. KappaPride Dis-Abo. Ja, PavelimomentKot bekommt eine 2x2 Modus,"}, {"id": 712, "start": 6719.26, "end": 6723.1, "text": "der sah aber sowas von schlecht aus, dass ich mir nicht vorstellen kann, dass den jemand"}, {"id": 713, "start": 6723.1, "end": 6731.46, "text": "spielt bei Release. Maps einfach nur viereckig, quadratisch viereckig, spawn direkt gegenüber"}, {"id": 714, "start": 6731.46, "end": 6739.26, "text": "mit zwei Leuten, in der Mitte eine Kiste und es war's. So sehen alle Maps aus. Wie"}, {"id": 715, "start": 6739.26, "end": 6752.5, "text": "heißt der RGB Text? LOLCat. LOLCat. Und das Beste ist, dadurch ihnen ist selbst aufgefallen,"}, {"id": 716, "start": 6752.5, "end": 6757.46, "text": "dass ihre Spawns kacke sind, weil das erste, könnt ihr euch daran erinnern, das erste,"}, {"id": 717, "start": 6757.46, "end": 6762.34, "text": "was ich gesagt hab im Stream, als ich den Modus gesehen hab, einer flasht, einer wirft"}, {"id": 718, "start": 6762.34, "end": 6767.5, "text": "Granate. Instant, instant win. Auf die Idee sind die Entwickler von Call of Duty allerdings"}, {"id": 719, "start": 6767.5, "end": 6773.06, "text": "auch gekommen. Man kann ja nicht sagen, die sind schon clever. Deswegen haben sie nicht"}, {"id": 720, "start": 6773.06, "end": 6779.86, "text": "gesagt etwa, ah ok, man kann quasi aus dem Spawn heraus instant gewinnen, wir ändern"}, {"id": 721, "start": 6779.86, "end": 6786.42, "text": "die Maps und die Spawns, nein, die sind viel schlauer. Die haben gesagt, wir deaktivieren"}, {"id": 722, "start": 6786.42, "end": 6789.94, "text": "einfach Equipment und Granaten die ersten drei Sekunden, dann kann das nicht passieren."}, {"id": 723, "start": 6789.94, "end": 6798.02, "text": "Das ist mal, das ist 900 IQ. Nicht die Maps verbessern, nicht die Spawns verbessern, nein,"}, {"id": 724, "start": 6798.02, "end": 6809.78, "text": "einfach die Granaten deaktivieren. Die sind einfach richtig re-smart, sind die. Fivehead"}, {"id": 725, "start": 6809.78, "end": 6816.66, "text": "brauchen wir jetzt. Moment, den müssen wir jetzt hinzufügen, den brauch ich als Emote."}, {"id": 726, "start": 6816.66, "end": 6836.58, "text": "Fivehead Emote. Das ist für die besonders big brain Leute. Fivehead. Ja, perfekt."}, {"id": 727, "start": 6836.58, "end": 6854.9, "text": "Richtig, warum machen die in CS überhaupt Map Balance? Die sollen einfach Granaten deaktivieren."}, {"id": 728, "start": 6854.9, "end": 6863.18, "text": "Das ist die Call of Duty Logik. Dann haben die Leute geschrieben, Max, jetzt mach doch"}, {"id": 729, "start": 6863.18, "end": 6867.98, "text": "nicht das ganze Game schlecht, nur weil der Modus nicht gut war. Wo ich mir dann immer"}, {"id": 730, "start": 6867.98, "end": 6872.38, "text": "denke, wie kommen die Leute drauf? Das Comment, was ich geschrieben hab, hat sich exakt auf"}, {"id": 731, "start": 6872.38, "end": 6878.74, "text": "diesen Modus bezogen und sonst nix. Außerdem ist es bei Call of Duty ja nicht so, dass"}, {"id": 732, "start": 6878.74, "end": 6882.34, "text": "man Call of Duty noch irgendwie schlecht machen müsste. Da haben sie ja die letzten Jahre"}, {"id": 733, "start": 6882.34, "end": 6888.66, "text": "selbst schon für gesorgt. Mittlerweile ist es eigentlich eher umgedreht. Sie müssen beweisen,"}, {"id": 734, "start": 6888.66, "end": 6897.38, "text": "dass es wieder was taugt. Magst du alle Hater? Ja, so sieht es aus. Du kannst aber auch gar"}, {"id": 735, "start": 6897.38, "end": 6903.46, "text": "nichts mehr heutzutage sagen, dass nicht sofort jemand super krass offended ist. Die Call"}, {"id": 736, "start": 6903.46, "end": 6912.82, "text": "of Duty Fans waren da schon immer gut dabei. So, das Gesinke hat schön funktioniert. Muss"}, {"id": 737, "start": 6912.82, "end": 6922.66, "text": "ich sagen, gefällt mir deutlich besser als Nextcloud 13. Dann testen wir jetzt mal, wie"}, {"id": 738, "start": 6922.66, "end": 6926.9, "text": "Kalender und was ist eigentlich, ach so Plugpunkt Bind, das ist das, was ich vorhin angelegt"}, {"id": 739, "start": 6926.9, "end": 6938.58, "text": "hab. Das löschen wir jetzt mal. Ja, entweder du bist Fan oder Hater, dazwischen gibt es"}, {"id": 740, "start": 6938.58, "end": 6943.46, "text": "nix mehr. Das finde ich auch ein bisschen bitter ehrlich gesagt, weil, hab ich auch"}, {"id": 741, "start": 6943.46, "end": 6950.5, "text": "schon mal vor Ewigkeiten im Video gesagt, eigentlich sind die Leute, die Games oder"}, {"id": 742, "start": 6950.5, "end": 6957.18, "text": "die wie Hater aussehen, sind oftmals die größten Fans dieses Games. Allerdings nicht"}, {"id": 743, "start": 6957.18, "end": 6962.06, "text": "so diese, ich finde alles geil Fans oder ich verteidige den Hersteller auch wenn er Scheiße"}, {"id": 744, "start": 6962.06, "end": 6967.78, "text": "baut, sondern Fans, die das Game wegen dem Game an sich spielen. Nicht weil sie den Hersteller"}, {"id": 745, "start": 6967.78, "end": 6972.74, "text": "unglaublich fanboyen wollen, sondern die sich eigentlich nichts mehr wünschen als"}, {"id": 746, "start": 6972.74, "end": 6977.34, "text": "dass das Game was taugt. Und das sind halt auch Leute, die über Jahre hinweg, guckt"}, {"id": 747, "start": 6977.34, "end": 6984.38, "text": "euch mal an, wie viele Leute WoW abonniert haben seit Release. Und ein Großteil davon"}, {"id": 748, "start": 6984.38, "end": 6990.34, "text": "sind mittlerweile die größten Kritiker von WoW selbst. Einfach weil sie das alles mitgekriegt"}, {"id": 749, "start": 6990.34, "end": 6995.06, "text": "haben und sagen, hey, das Spiel entwickelt sich in Richtung, die wir nicht mögen. Das"}, {"id": 750, "start": 6995.06, "end": 6999.98, "text": "sind aber keine Hater, die einfach nur Hate verbreiten wollen, die wünschen sich eigentlich"}, {"id": 751, "start": 6999.98, "end": 7003.7, "text": "nichts mehr als dass ihnen das Spiel wieder gefällt. Oder dass sich das Spiel, die wünschen"}, {"id": 752, "start": 7003.7, "end": 7006.3, "text": "sich nichts mehr als dass sich das Game in die Richtung entwickelt, wie sie es gerne"}, {"id": 753, "start": 7006.3, "end": 7015.5, "text": "hätten. Was passiert wenn zwei Clients die gleiche Datei offline editieren und das dann"}, {"id": 754, "start": 7015.5, "end": 7025.38, "text": "gesunken versuchen? Nein, dann gibt es den Konflikt. Da spackts rum. Wobei ich mir gar"}, {"id": 755, "start": 7025.38, "end": 7028.7, "text": "nicht mehr sicher bin, ob man nicht auch einstellen konnte, dass der letzte gewinnt. Ich glaube,"}, {"id": 756, "start": 7028.7, "end": 7038.9, "text": "das geht auch. Ich glaube, man konnte auch einstellen, der letzte gewinnt. Auf den"}, {"id": 757, "start": 7038.9, "end": 7048.18, "text": "Private WoW Classic Server. Gibt es nicht bald einen WoW Classic Server? Kommt doch"}, {"id": 758, "start": 7048.18, "end": 7062.3, "text": "im August. Oder? Ist ja nicht mal lange. Doch bald. Also ich werde es auf jeden Fall spielen,"}, {"id": 759, "start": 7062.3, "end": 7067.46, "text": "allerdings wahrscheinlich nicht super intensiv und auch nicht on stream. Einfach, dass ich"}, {"id": 760, "start": 7067.46, "end": 7071.78, "text": "mit dem Fabian mal ein bisschen was habe, wo man wieder spielen kann. Falls der dann"}, {"id": 761, "start": 7071.78, "end": 7082.3, "text": "spielt. Oder ein bisschen mit dem Eaxe rumrennen oder so. Das ist auch kein Spiel für streamen."}, {"id": 762, "start": 7082.3, "end": 7088.98, "text": "MMOs taugen zum streamen nichts. Außer man ist eine ganz passende Persönlichkeit dafür"}, {"id": 763, "start": 7088.98, "end": 7097.58, "text": "und hat auch das passende Publikum und die passende Reichweite. Ich finde es übelst"}, {"id": 764, "start": 7097.58, "end": 7103.9, "text": "langweilig. Ich persönlich gucke es mir nicht an. Ok, dann starten wir mal Thunderbird"}, {"id": 765, "start": 7103.9, "end": 7113.98, "text": "und gucken, wie das mit dem Kalender-Sync ist. Was ist der Kalender überhaupt? Muss"}, {"id": 766, "start": 7113.98, "end": 7122.9, "text": "ich das erst noch als App aktivieren? Ah ja. Download and Enable. 123456. Super Secret"}, {"id": 767, "start": 7122.9, "end": 7127.5, "text": "Passport. Ist dann ChinaCarm angekommen? Ne, immer noch nicht. Ich hoffe mal. Ich hoffe"}, {"id": 768, "start": 7127.5, "end": 7140.74, "text": "mal morgen. DHL, AliExpress, der 50er Pack USB Kabel. Die schreiben ja 8-17 Tage Versand"}, {"id": 769, "start": 7140.74, "end": 7148.14, "text": "mit DHL. Und 8 Tage sind auf jeden Fall schon rum. Ne, sind nur 50 Kabel die ich bestellt"}, {"id": 770, "start": 7148.14, "end": 7153.62, "text": "habe. Der Typ hat in der Mail irgendwie Mist geschrieben. Und ganz ehrlich, wenn mir die"}, {"id": 771, "start": 7153.62, "end": 7160.98, "text": "Chinesen 200 Kabel schicken für den Preis von 50 ist ok. Dann lege ich einfach 150"}, {"id": 772, "start": 7160.98, "end": 7181.62, "text": "auf den Dachboden und gut ist. Danke für den Follow. ReedyGermany. USB Kabel. Also"}, {"id": 773, "start": 7181.62, "end": 7187.46, "text": "sollten die mir, ohne Mist, sollten die mir wirklich 200 USB Kabel statt 50 Kabel ausversehen"}, {"id": 774, "start": 7187.46, "end": 7193.42, "text": "geschickt haben. Dann machen wir ein USB Kabel Giveaway. Allerdings müssen wir dann gucken"}, {"id": 775, "start": 7193.42, "end": 7197.34, "text": "wie wir das machen, weil, wie der Patrick gesagt hat, die Versandkosten lohnen sich"}, {"id": 776, "start": 7197.34, "end": 7211.46, "text": "halt nicht so. Wollte schon noch flitter raushauen, jemand nutzt dein Logo? Ne. Es gibt tatsächlich"}, {"id": 777, "start": 7211.46, "end": 7216.62, "text": "Leute die mein Logo benutzen. Wenn man Google Bilder Search macht mit meinem Keks, findest"}, {"id": 778, "start": 7216.62, "end": 7219.86, "text": "du wirklich Leute die irgendwann mein Logo drauf haben. Ich mein, so what, gibt's für"}, {"id": 779, "start": 7219.86, "end": 7242.14, "text": "jeden der ein bisschen größeren Channel hat. Ok, Kalender. Wo ist der Kalender? Wo ist"}, {"id": 780, "start": 7242.14, "end": 7261.58, "text": "der Kalender? Ach da. Der Kalender sieht mit Darktheme irgendwie ein bisschen unfertig"}, {"id": 781, "start": 7261.58, "end": 7282.3, "text": "aus. Ok, machen wir mal einen Tests. Ok, Name ist QChat. So und in dem Kalender fügen wir"}, {"id": 782, "start": 7282.3, "end": 7302.38, "text": "jetzt mal einen Termin ein und zwar morgen von 12 bis 14 Uhr. Jetzt haben wir morgen"}, {"id": 783, "start": 7302.38, "end": 7321.82, "text": "für den Event rumstellen. Und Dienstag haben wir einen All-Day-Event. Arbeiten. FeelsBatman."}, {"id": 784, "start": 7321.82, "end": 7340.42, "text": "Create. Ach ja und morgen, stimmt, morgen haben wir noch ein Event. Stream. Ok. Ok,"}, {"id": 785, "start": 7340.42, "end": 7355.46, "text": "der Kalender ist immer noch Mist, man kann nix, oder kann man? Day? Kann man, kann man"}, {"id": 786, "start": 7355.46, "end": 7374.38, "text": "nicht? Hallo? Ah. Man sieht hier ist das Darktheme, das funktioniert noch nicht richtig. Ok,"}, {"id": 787, "start": 7374.38, "end": 7381.06, "text": "zack. Save. Weil macht er wahrscheinlich automatisch. Und jetzt adde ich das mal in Thunderbird"}, {"id": 788, "start": 7381.06, "end": 7387.38, "text": "und gucke ob das Gescheit funktioniert. Wie sieht das Lighttheme aus? Achtung Leute Sonnenbrille"}, {"id": 789, "start": 7387.38, "end": 7411.3, "text": "aufsetzen. Ja, Hydrogen Yoyo, das ist auch ziemlich ja crap, die Online Kalenderverwaltung."}, {"id": 790, "start": 7411.3, "end": 7417.62, "text": "Und nachdem es ja kaum gescheite Cross-Platform Clients gibt, nehmen wir jetzt mal einen der"}, {"id": 791, "start": 7417.62, "end": 7426.82, "text": "halbwegs funktioniert, nämlich Thunderbird. Thunderbird hier standardmäßig Darktheme,"}, {"id": 792, "start": 7426.82, "end": 7442.26, "text": "das kann man viel besser. Nein, ich will keinen Mail-Account absetten. Ihh, was ist das für"}, {"id": 793, "start": 7442.26, "end": 7465.1, "text": "was? Ihh. Das sieht, das sieht noch nicht mal aus wie Windhouse 95. Das sieht aus wie"}, {"id": 794, "start": 7465.1, "end": 7474.5, "text": "Windhouse 95, das gerne, nicht Windhouse 95, das sieht hässlich aus. Das liegt aber wahrscheinlich"}, {"id": 795, "start": 7474.5, "end": 7484.1, "text": "ein bisschen an meinem, wir probieren mal was. Man kann bestimmt GTK, man kann bestimmt"}, {"id": 796, "start": 7484.1, "end": 7500.3, "text": "sagen man will das mit einem, mit einem anderen Theme starten. Thunderbird. Ah, ok, ich glaube"}, {"id": 797, "start": 7500.3, "end": 7507.62, "text": "jetzt sieht es zumindest, jetzt sieht es zumindest besser aus. Es ist zwar, ähm, brauchen wir"}, {"id": 798, "start": 7507.62, "end": 7516.3, "text": "doch die Sonnenbrille, aber es sieht jetzt wenigstens halbwegs ok aus. Oh, wo ist die"}, {"id": 799, "start": 7516.3, "end": 7525.7, "text": "Sidebar hin? Ach da. Ok, Kalender. On Network, wir löschen den jetzt erstmal hier. Kann"}, {"id": 800, "start": 7525.7, "end": 7532.5, "text": "man nicht löschen, weil das der einzige ist, keine Ahnung. New Kalender, On Network, Next,"}, {"id": 801, "start": 7532.5, "end": 7538.22, "text": "Location. Ok, wie kann ich den Kalender von Next Cloud jetzt adden? Das ging doch so irgendwie."}, {"id": 802, "start": 7538.22, "end": 7559.66, "text": "Next. Nickname, ja, Cute Chat heißt der Kalender. Ich muss, ich muss mich doch noch anmelden"}, {"id": 803, "start": 7559.66, "end": 7589.46, "text": "irgendwie. Ah ja, jetzt atmen. Ok. Oder auch nicht. Cute Chat ist kaputt. Dann machen wir"}, {"id": 804, "start": 7589.46, "end": 7601.94, "text": "das schon mal so nicht. Cute Chat. Kann man sich hier den Kalender anzeigen lassen? So,"}, {"id": 805, "start": 7601.94, "end": 7609.74, "text": "wie kriege ich, wie kriege ich mein Next Cloud Kalender in Thunderbird? Ich mein, ich könnte"}, {"id": 806, "start": 7609.74, "end": 7622.9, "text": "nachgucken. Ich könnte nachgucken, aber so schwer kann das noch gar nicht sein. ECS ist"}, {"id": 807, "start": 7622.9, "end": 7641.3, "text": "das Kalender-Format unten drunter. Kennst du MindTimeAI? Nö. Kann er CalDAF? Kann er"}, {"id": 808, "start": 7641.3, "end": 7654.94, "text": "To Do's? Ok, den gibt es schon mal von Linux, das ist gut. Kann der To Do's? Das ist das"}, {"id": 809, "start": 7654.94, "end": 7665.78, "text": "wichtige da dran. Wir könnten das mal ausprobieren. Aber erstmal müssen wir das irgendwie in Thunderbird"}, {"id": 810, "start": 7665.78, "end": 7677.74, "text": "geedit kriegen. On Network. Ok, du hast recht, man muss CalDAF auswählen. Eigentlich ist"}, {"id": 811, "start": 7677.74, "end": 7698.66, "text": "ECS unten drunter das gleiche. Location. Next. Cute Chat. Ah, Cute Chat ist da. Aber"}, {"id": 812, "start": 7698.66, "end": 7708.34, "text": "Cute Chat synchronisiert nicht. Warum, dieses Gefrickel immer. Warum kann das nicht einfach"}, {"id": 813, "start": 7708.34, "end": 7736.42, "text": "sinken? Ok, Google Time. Ja, ich schaue mir Sonntag an, das ist klar, aber da sagt er"}, {"id": 814, "start": 7736.42, "end": 7740.86, "text": "hier schon, dass er nicht funktioniert. Und selbst wenn ich jetzt auf morgen switche ist"}, {"id": 815, "start": 7740.86, "end": 7755.3, "text": "nichts drin. Weil Cute Chat nicht sinken kann. Crap. Ok, wir machen mal was anderes. Es gibt"}, {"id": 816, "start": 7755.3, "end": 7759.3, "text": "glaube ich ein neues Plugin, was das viel, viel einfacher macht. Hab ich letztens irgendwo"}, {"id": 817, "start": 7759.3, "end": 7766.26, "text": "gesehen. Also der Thunderbird Interface wird immer ekliger. Wo konnte man sich jetzt nochmal"}, {"id": 818, "start": 7766.26, "end": 7771.38, "text": "die Plugins anzeichen lassen? Das ging doch hier rechts irgendwo. Ok, machen wir es eben"}, {"id": 819, "start": 7771.38, "end": 7801.14, "text": "so. Wo wo sind die Addons da? Thunderbird Sync Sync Manager. Ok, ok, ok, ok, ok, ok,"}, {"id": 820, "start": 7801.14, "end": 7806.3, "text": "ok. Wo können wir uns jetzt zwischen Nextcloud und Thunderbird? Ja genau, das brauchen wir"}, {"id": 821, "start": 7806.3, "end": 7814.98, "text": "doch. Mein Gott ist das kompliziert wieder so einen einfachen Kalender in Thunderbird"}, {"id": 822, "start": 7814.98, "end": 7838.02, "text": "zu adden. Hoi hoi hoi hoi hoi. TP Sync Account Manager. Dann machen wir das damit. Viel besser."}, {"id": 823, "start": 7838.02, "end": 7857.62, "text": "Das Addon habe ich auch letztens irgendwo gesehen. TP Sync. Da ist es fast leicht an"}, {"id": 824, "start": 7857.62, "end": 7878.06, "text": "einen Kalender zu programmieren. Ja. Hat er das jetzt gemacht? Hat er gemacht. Er zeigt"}, {"id": 825, "start": 7878.06, "end": 7891.74, "text": "es mir an. Ok und wo findet man das jetzt unter TB Sync Manager? Sag mal hat Thunderbird"}, {"id": 826, "start": 7891.74, "end": 7896.3, "text": "nicht normalerweise. Ach da ist der Knopf. Wer hat sich das denn ausgedacht den Knopf"}, {"id": 827, "start": 7896.3, "end": 7908.58, "text": "da hinzumachen? Da guckt doch kein Mensch hin. TB Sync. Add Account, Add New Account,"}, {"id": 828, "start": 7908.58, "end": 7916.42, "text": "Kalender auf Karte auf Account. GMX. Megalull. Account Name. Ach ok jetzt muss ich auch gar"}, {"id": 829, "start": 7916.42, "end": 7922.1, "text": "nicht den Mist reinschreiben, sondern kann einfach sagen ich will mein Nextcloud Server"}, {"id": 830, "start": 7922.1, "end": 7939.62, "text": "sein. Account Name. Admin. Server Ull. Deader. Username. Admin. Passport. 123456. Ok. Gut."}, {"id": 831, "start": 7939.62, "end": 7960.22, "text": "Das ist Gefrickel ey. Wo ist das Problem? Ach Moment da muss ich jetzt nicht den Server"}, {"id": 832, "start": 7960.22, "end": 7972.74, "text": "dann muss ich jetzt wirklich den Mist von da unten reinschreiben. Ok. The fuck? Wo ist"}, {"id": 833, "start": 7972.74, "end": 7989.18, "text": "denn jetzt das Problem wieder ey? Admin 123456. Das ist mir jetzt echt zu doof ey. Not allowed."}, {"id": 834, "start": 7989.18, "end": 8007.9, "text": "Es schreckt. Not allowed. Service an der Welpe. Ja. Sehr schön. Toll. Wie gut das funktioniert."}, {"id": 835, "start": 8007.9, "end": 8020.54, "text": "Ich hab das ja schonmal eingerichtet, da hab ich es nicht so problematisch. Moment was"}, {"id": 836, "start": 8020.54, "end": 8049.98, "text": "ist das für eine Ull? Es ist schön dass du es konfirmst, was muss ich neintragen?"}, {"id": 837, "start": 8049.98, "end": 8068.94, "text": "Verraten sie eigentlich. Ok. Wir machen was anderes wir sagen. Manual Configuration. Account"}, {"id": 838, "start": 8068.94, "end": 8081.02, "text": "Name. Admin. Server Address. Das da. Username. Admin. Passport. Finish. Service unavailable."}, {"id": 839, "start": 8081.02, "end": 8094.14, "text": "Oh mann. Was hat er für Schmerzen? Man weiß es nicht. Man weiß es nicht. Tja. Dann war"}, {"id": 840, "start": 8094.14, "end": 8097.9, "text": "es das mit Thunderbird. Funktioniert das wohl nicht? Also es funktioniert schon irgendwie"}, {"id": 841, "start": 8097.9, "end": 8108.54, "text": "wahrscheinlich aber wie auch immer. Also ich bilde mir ein. Ich müsste mal bei meinem"}, {"id": 842, "start": 8108.54, "end": 8113.22, "text": "An- Ich kann jetzt leider schon mal HTTPS getestet. Nee kann ich nicht testen. Hab"}, {"id": 843, "start": 8113.22, "end": 8117.06, "text": "ich nicht an. Habe ich auch kein Zertifikat für. Vor allem schon mal gar kein gültiges"}, {"id": 844, "start": 8117.06, "end": 8123.58, "text": "Zertifikat. Ähm. Ich kann jetzt leider nicht umloggen. Auf dem anderen Account gucken"}, {"id": 845, "start": 8123.58, "end": 8129.74, "text": "wie ich es eingerichtet habe. Ich hätte eigentlich gedacht. Dass es ziemlich einfach ist. Dass"}, {"id": 846, "start": 8129.74, "end": 8135.98, "text": "ich einfach nach Kall darf. Nach Location. Vielleicht muss ich jetzt hier eingeben Q-Chat"}, {"id": 847, "start": 8135.98, "end": 8156.74, "text": "oder so. Wow. Dann nehmen wir, dann nehmen wir mal das hier. Wir nehmen mal das hier."}, {"id": 848, "start": 8156.74, "end": 8176.06, "text": "Offline-Support brauchen wir nicht. Q-Chat. Admin. 1, 2, 3, 4, 5, 6. Jaja. Safe. Ah. Ah."}, {"id": 849, "start": 8176.06, "end": 8185.26, "text": "Gott. Dieses rumgefrickelt. Das ist eines der Gründe wo wir es gestern von hatten."}, {"id": 850, "start": 8185.26, "end": 8191.54, "text": "Dass das garantiert keine normalen User mit normaler Software irgendwie dazu bewegen wird"}, {"id": 851, "start": 8191.54, "end": 8197.62, "text": "irgendwie umzusteigen oder sowas. Ich mein. Wo ist das Problem? Einen beschissenen Kalender"}, {"id": 852, "start": 8197.62, "end": 8203.1, "text": "hinzufügen. Ich kann jetzt auch nicht mal sagen an wem es liegt. Wahrscheinlich wird"}, {"id": 853, "start": 8203.1, "end": 8206.3, "text": "es zur Hälfte an Thunderbird und zur Hälfte an Nextcloud liegen, dass es nicht funktioniert."}, {"id": 854, "start": 8206.3, "end": 8222.22, "text": "Aber es ist erbärmlich dass es nicht klappt. Jetzt schreckt. Probieren wir mal dieses komische"}, {"id": 855, "start": 8222.22, "end": 8236.9, "text": "Thunderbird Sync-Ding. Count. I love things. Man. Er schreibt doch sogar. Works with most"}, {"id": 856, "start": 8236.9, "end": 8245.14, "text": "on cloud Nextcloud. Admin. Cool. Nehmen wir jetzt mal die andere. Nehmen wir jetzt mal"}, {"id": 857, "start": 8245.14, "end": 8252.22, "text": "die da. Username. Admin. 1, 2, 3, 4, 5, 6. Ist ja nicht so dass es großartig kompliziert"}, {"id": 858, "start": 8252.22, "end": 8261.98, "text": "wäre. Damn. Service unavailable. Warum auch immer. Weil. Response. Response leer. Jawoll."}, {"id": 859, "start": 8261.98, "end": 8275.78, "text": "Sehr gut. Ok. Nice. Vielleicht sollten wir lieber mal Google bemühen anstatt hier weiter"}, {"id": 860, "start": 8275.78, "end": 8292.7, "text": "um zu basteln. Probieren wir es nochmal so. Nope. Ok. Thunderbird. Add. Nextcloud. Kalender."}, {"id": 861, "start": 8292.7, "end": 8317.1, "text": "Jetzt. Aha. Mal 16. Ok. Sollte das funktionen habe ich nichts gesagt. Sie haben es wenigstens"}, {"id": 862, "start": 8317.1, "end": 8333.3, "text": "offiziell in ihre Seite reingeschrieben. Once you have installed. Ich will kein Address"}, {"id": 863, "start": 8333.3, "end": 8357.34, "text": "vor ich will Kalender. Network. Wollte mich verarschen. Was das für eine beknackte Anleitung."}, {"id": 864, "start": 8357.34, "end": 8369.54, "text": "Ok. Ah hier. Ja das ist doch das was wir verwenden. Das ist genau das was ich die ganze Zeit schon"}, {"id": 865, "start": 8369.54, "end": 8381.98, "text": "mache. Das da. On network. Kalender auswählen. Und location. Das ist genau das was ich die"}, {"id": 866, "start": 8381.98, "end": 8391.54, "text": "ganze Zeit schon mache. Ich habe noch eine Idee Leute. Ich habe noch eine Idee. Ich habe"}, {"id": 867, "start": 8391.54, "end": 8397.26, "text": "noch eine. Eine Idee habe ich noch. Network. Kalender. Location. Nein das ist im Prinzip"}, {"id": 868, "start": 8397.26, "end": 8405.66, "text": "genau das was er hier schreibt. So und jetzt. Machen wir. Wir tragen keine Name ein. Ach"}, {"id": 869, "start": 8405.66, "end": 8422.82, "text": "das geht gar nicht. Test. Aha. Wer hat das gedacht. Es geht nicht. Ich weiß dass es prinzipiell"}, {"id": 870, "start": 8422.82, "end": 8436.34, "text": "funktioniert. Weil ich habe das bei mir auf dem anderen Account eingerichtet. Kann doch"}, {"id": 871, "start": 8436.34, "end": 8441.94, "text": "nicht sein. Die verbreitetste Kalender Lösung die es quasi zum selbst hosten gibt. Und Thunderbird"}, {"id": 872, "start": 8441.94, "end": 8453.38, "text": "eines der verbreitesten Mail Clients. Den es so gibt. Auch ohne HTTPS. Ich habe. Ich habe"}, {"id": 873, "start": 8453.38, "end": 8460.58, "text": "ja keine HTTPS an. Das muss ohne. Ach so. Ne tatsächlich. Meine andere NetCloud Instanz"}, {"id": 874, "start": 8460.58, "end": 8468.58, "text": "läuft auf. Hat ein gültiges Zertifikat. Allerdings. Ist die Fehlermeldung dafür ganz schön beknackt"}, {"id": 875, "start": 8468.58, "end": 8481.46, "text": "sollte es wirklich am Zertifikat liegen. Die Url stimmt bestimmt. Irgendwas hier bestimmt."}, {"id": 876, "start": 8481.46, "end": 8495.34, "text": "Ach Moment. Ich habe euch mit das nehme ich. Moment. Was ist denn das für eine Url. Das"}, {"id": 877, "start": 8495.34, "end": 8514.58, "text": "ist eine andere Url. Wo kriegt man die dann her. Moment. Ah. Da wäre ich ja nie drauf"}, {"id": 878, "start": 8514.58, "end": 8530.38, "text": "gekommen. Da wäre ich ja nie drauf gekommen. Jetzt funktioniert das bestimmt auch mit dem"}, {"id": 879, "start": 8530.38, "end": 8553.38, "text": "Addon. Wartet mal. Das geht jetzt bestimmt. Addons. Alter die Bedienung. Gehen wir mal"}, {"id": 880, "start": 8553.38, "end": 8562.82, "text": "mit Discovery Service. Probieren wir nochmal. Ach ne. Admin. Das funktioniert immer noch"}, {"id": 881, "start": 8562.82, "end": 8579.42, "text": "nicht. Manual. Admin. Admin. Unavailable. Kalenders. Ah Moment. Wir probieren nochmal"}, {"id": 882, "start": 8579.42, "end": 8585.14, "text": "was anderes. Mein Gott ist das eingefunnelt. Discovery. Wir sagen jetzt Admin. Das da und"}, {"id": 883, "start": 8585.14, "end": 8596.5, "text": "da machen wir Admin und QtChat hinten weg und nehmen es einfach mal so. Das Addon suckte."}, {"id": 884, "start": 8596.5, "end": 8601.34, "text": "Ja das muss ohne Addon gehen. Weil das Addon habe ich auf meinem anderen Rechner auch nicht"}, {"id": 885, "start": 8601.34, "end": 8616.46, "text": "drauf. New Calender. Location. Da machen wir jetzt einfach das da rein. Next. QtChat. Easy."}, {"id": 886, "start": 8616.46, "end": 8629.98, "text": "Funktioniert. Funktioniert. Ok man muss einfach. Dann ist es gar nicht so kacke wie ich jetzt"}, {"id": 887, "start": 8629.98, "end": 8641.98, "text": "getan habe die ganze Zeit. Man muss einfach nur das finden. Ja. Wenn man das weiß ist"}, {"id": 888, "start": 8641.98, "end": 8662.42, "text": "kein Problem dann gehts eigentlich. Jetzt müsste ich die To Do's eigentlich auch drinne haben."}, {"id": 889, "start": 8662.42, "end": 8673.74, "text": "Hat es meine To Do's nicht gesüngt? Ich müsste eigentlich drei To Do's haben. Ich müsste"}, {"id": 890, "start": 8673.74, "end": 8701.5, "text": "als To Do haben. Die Sachen müsste ich eigentlich als Task haben. Ok. Test. Task. Jetzt Sync."}, {"id": 891, "start": 8701.5, "end": 8704.34, "text": "Nervosit."}, {"id": 892, "start": 8731.5, "end": 8755.72, "text": "Ah, ach so, ok, das ist ein anderer Kalender, das ist ein anderer Kalender, ja ok, kann"}, {"id": 893, "start": 8755.72, "end": 8761.74, "text": "man die, kann man die rüberschieben? Ne, na das geht natürlich nicht, das wäre zu,"}, {"id": 894, "start": 8761.74, "end": 8771.86, "text": "zu pro. Ok, aber dann funktioniert's, das ist, warum kann man da nichts reinschreiben?"}, {"id": 895, "start": 8771.86, "end": 8782.5, "text": "Geht. Bäh. Ah, trotzdem so schön ist die Bedienung nicht. Aber es fun- es funktioniert"}, {"id": 896, "start": 8782.5, "end": 8802.22, "text": "halbwegs, ist halbwegs. Ok, ah, gut, ahm, ein bisschen hakelig ist das Ganze schon."}, {"id": 897, "start": 8802.22, "end": 8814.54, "text": "Und man merkt, dass der Raspberry halt nicht der schnellste ist."}, {"id": 898, "start": 8832.22, "end": 8851.18, "text": "Ja, also ich muss sagen, mir gefällt die neue Version viel besser als 13. Wenn man"}, {"id": 899, "start": 8851.18, "end": 8860.78, "text": "weiß, wenn man weiß, wie das mit den Links funktioniert, wie man die Kalender Links kriegt,"}, {"id": 900, "start": 8860.78, "end": 8872.42, "text": "das ist an sich auch relativ einfach zu adden. Wir könnten den Kalender mal ausprobieren."}, {"id": 901, "start": 8872.42, "end": 8880.86, "text": "Probier, wir probieren den Kalender mal aus. Gucken, wie der ist. Hab ich noch nicht getestet."}, {"id": 902, "start": 8880.86, "end": 8899.82, "text": "Wichtig ist halt, dass er To Do's unterstützt. Wie heißt der Minetime? Ne, wir laden uns"}, {"id": 903, "start": 8899.82, "end": 8911.14, "text": "den mal hier runter. Was, E-Mail verifizieren? Ernsthaft? Das muss ich mir angucken und einmal"}, {"id": 904, "start": 8911.14, "end": 8936.98, "text": "eine Runde roffeln. Lullen muss man. App Image runterladen. Wie geht. Probier ich jetzt"}, {"id": 905, "start": 8936.98, "end": 8948.1, "text": "mal. 06. Minetime. Ups. Minetime. Ey, ich kann den mal tippen. Bam. Would you like to integrate"}, {"id": 906, "start": 8948.1, "end": 8967.94, "text": "home test with you? No. Elektron. Please. Hinfort. Heutzutage braucht man für eine publische"}, {"id": 907, "start": 8967.94, "end": 8976.46, "text": "Kalenderanwendung Elektronen. Äh ja, wir haben die Euler akzeptiert. Caldav, Beta, Username,"}, {"id": 908, "start": 8976.46, "end": 8982.5, "text": "Admin. 1, 2, 3, 4, 5, 6. Server-Uhrl. Tja, jetzt wieder die Frage, was man hier nehmen"}, {"id": 909, "start": 8982.5, "end": 8989.02, "text": "soll. Ich nehme mal hier die Basic-Uhrl. Vielleicht ist das Ding so clever. Ups. Und"}, {"id": 910, "start": 8989.02, "end": 9016.86, "text": "check das. Easy. Was? Please enter a valid E-Mail to continue. Warum? Ernsthaft? Das"}, {"id": 911, "start": 9016.86, "end": 9020.22, "text": "macht überhaupt keinen Sinn. Warum soll ich da eine E-Mail verifinieren? Ist das bei"}, {"id": 912, "start": 9020.22, "end": 9032.1, "text": "mir lokal gehostet? Blub blub blub blub blub blub blub blub blub blub blub blub blub."}, {"id": 913, "start": 9032.1, "end": 9057.06, "text": "Ready to go. Q-Chat. Du bekommst einen Code, sonst kannst du nichts machen. Äh. Wie wechsle"}, {"id": 914, "start": 9057.06, "end": 9072.7, "text": "ich den Tag? Doch, hier. Nice. Der gefällt mir aber auch überhaupt nicht. Manchmal, wisst"}, {"id": 915, "start": 9072.7, "end": 9081.06, "text": "ihr, es kommen, es gibt Tage, wo ich mir wünsche, dass mehr Mac OS Software für Windows und"}, {"id": 916, "start": 9081.06, "end": 9087.7, "text": "Linux verfügbar wäre. Die haben ordentliche Notiz-Programme, die haben ordentliche Mail-Programme,"}, {"id": 917, "start": 9087.7, "end": 9095.9, "text": "die haben ordentliche Programme mit Call of Unterstützung. Ordentliche To-Do-Programme,"}, {"id": 918, "start": 9095.9, "end": 9109.82, "text": "also da muss man sagen, das ist schon besser. Allerdings verwende ich Mac halt nicht. Naja."}, {"id": 919, "start": 9109.82, "end": 9120.5, "text": "So, hat dieses Ding jetzt irgendwo Sachen angelegt bei mir auf dem System? Mein Time"}, {"id": 920, "start": 9120.5, "end": 9135.46, "text": "oder so. Config. Mein Time. Tatsächlich. Alles weg. Piss dich, Alde. Trash. Moment,"}, {"id": 921, "start": 9135.46, "end": 9145.98, "text": "was? Trash. Empty. Weg. So, wartet mal kurz."}, {"id": 922, "start": 9165.46, "end": 9176.78, "text": "So, wieder am Start. Okay Leute, also, ähm, ich finde Nextcloud 16 macht einen ganz guten"}, {"id": 923, "start": 9176.78, "end": 9186.78, "text": "Eindruck. Also deutlich besser als 13. Die, ähm, die Zusatz-Apps, ja gut. Ja. Ich meine,"}, {"id": 924, "start": 9186.78, "end": 9194.66, "text": "es sollte basic sein, dass man in der Task-App was suchen kann. Moment, haben wir die Notiz-App"}, {"id": 925, "start": 9194.66, "end": 9198.22, "text": "ausprobiert, ob man da auch ordentlich drinne suchen kann? Weil das ging das letzte Mal,"}, {"id": 926, "start": 9198.22, "end": 9213.58, "text": "glaube ich, auch nicht richtig. Komm her. Hallo. Suche. Hallo. Moment, man kann seine"}, {"id": 927, "start": 9213.58, "end": 9220.1, "text": "Notes nicht durchsuchen. Mein Gott ey, was ist das denn? Wer soll das denn benutzen?"}, {"id": 928, "start": 9220.1, "end": 9228.62, "text": "Eine Notiz-App ohne Volltext-Suche. Okay, da gab es aber doch irgendwelche Apps dafür."}, {"id": 929, "start": 9228.62, "end": 9250.3, "text": "Fulltext Search, Fulltext Search Booksmark, Fulltext Search Elastic, Fulltext Search Files."}, {"id": 930, "start": 9250.3, "end": 9276.62, "text": "Und hoffe, dass es funktioniert. Settings Search. Fulltext Search. Search Platform. Ach,"}, {"id": 931, "start": 9276.62, "end": 9281.5, "text": "da muss ich zusätzlich noch Elastic installieren, oder was? Ich hab, ich hab aber gar kein Elastic"}, {"id": 932, "start": 9281.5, "end": 9285.94, "text": "Search irgendwie auf meinem Raspberry oder so drauf. Okay, das ist wahrscheinlich, das"}, {"id": 933, "start": 9285.94, "end": 9291.14, "text": "Setup ist wahrscheinlich die Zeit nicht wert. Okay, ich werd', ich verwende den Kram einfach"}, {"id": 934, "start": 9291.14, "end": 9300.1, "text": "weiterhin als stinknormales Dropbox-Ersatz und sonst nix. Und selbst da, weil ich hab"}, {"id": 935, "start": 9300.1, "end": 9304.42, "text": "mir nämlich überlegt, der Grund, warum ich, äh, also, der Hauptgrund eigentlich, warum"}, {"id": 936, "start": 9304.42, "end": 9311.54, "text": "ich mir das jetzt nochmal angucke, ist, ich hab die Auswahl zwischen Nextcloud, halt als"}, {"id": 937, "start": 9311.54, "end": 9320.86, "text": "Lösung, die ein bisschen mehr kann, nebar FileSync und Kalender, oder ich nehm SyncThing"}, {"id": 938, "start": 9320.86, "end": 9337.34, "text": "plus, ähm, ein Kalender-Server und gut ist. Wozu ich tatsächlich gerade tendiere? Kann"}, {"id": 939, "start": 9337.34, "end": 9355.54, "text": "man eigentlich jetzt hier ein TrueIo-Bild machen? Hallo MrRampage67. Gucken, vielleicht"}, {"id": 940, "start": 9355.54, "end": 9367.82, "text": "ist es doch recht einfach einzurichten. Leute seid ihr noch da? Der Chat ist so ruhig."}, {"id": 941, "start": 9367.82, "end": 9377.7, "text": "Was ist da los? Okay, geht anscheinend noch. Elastic Search. Okay, man muss, man muss,"}, {"id": 942, "start": 9377.7, "end": 9382.94, "text": "äh, Elastic Search noch zusätzlich installieren. Ne, das ist mir zu blöd. Da hab ich jetzt"}, {"id": 943, "start": 9382.94, "end": 9393.66, "text": "gerade nervt drauf. Okay, und wie verwandelt man TrueIo da drinnen? Wahrscheinlich ein"}, {"id": 944, "start": 9393.66, "end": 9416.74, "text": "File anlegen, mit der richtigen Extension. Okay, super, super Beschreibung, wie man"}, {"id": 945, "start": 9416.74, "end": 9440.26, "text": "es verwendet. Aha, oben auf plus drücken, okay. Plus, Diagramm, aha, blub. Charts, Network,"}, {"id": 946, "start": 9440.26, "end": 9460.5, "text": "ja, erzeug Diagramm. Okay, das ist ganz nett, dass sie nen TrueIo-Plugin haben. Was wird"}, {"id": 947, "start": 9460.5, "end": 9466.42, "text": "gemacht? Wir haben gerade Nextcloud installiert und ich wollte mir anschauen, ob mir jetzt"}, {"id": 948, "start": 9466.42, "end": 9471.22, "text": "Nextcloud 16 gefällt. Ich hab ja aktuell 13, was so ein paar Probleme hat und mir nicht"}, {"id": 949, "start": 9471.22, "end": 9477.78, "text": "so zusagt. 16 gefällt mir deutlich besser. Wobei das an vielen Stellen auch irgendwie"}, {"id": 950, "start": 9477.78, "end": 9496.54, "text": "noch so ein bisschen unstrukturiert wirkt alles. Okay, haben wir ausprobiert, ist ganz"}, {"id": 951, "start": 9496.54, "end": 9509.38, "text": "okay. Das zum testen läuft auf nem Raspberry, allerdings in Zukunft wirds auf ne x86 Kiste"}, {"id": 952, "start": 9509.38, "end": 9515.02, "text": "laufen, wenn ichs denn verwende. So wie das aktuelle, was ich hab auch. Der Raspberry"}, {"id": 953, "start": 9515.02, "end": 9529.02, "text": "ist mir einfach zu lahm für sowas. Und der O-Troid, der liegt bei mir rum. Das ist ja"}, {"id": 954, "start": 9529.02, "end": 9537.78, "text": "dieses kleine Ding in diesem Festplattenrahmen drinnen, der liegt auf dem Sofa hier hinten,"}, {"id": 955, "start": 9537.78, "end": 9543.9, "text": "aber da mach ichs nicht drauf. Ne, der Raspberry ist mir zu lahm für sowas. Generell ist der"}, {"id": 956, "start": 9543.9, "end": 9550.5, "text": "Raspberry eigentlich für die meisten Sachen, mit denen man viel arbeitet zu langsam. Oder"}, {"id": 957, "start": 9550.5, "end": 9554.94, "text": "halt nicht zu langsam, aber so, dass es nervt, wenn du beim Neustarten dann irgendwie 30"}, {"id": 958, "start": 9554.94, "end": 9563.5, "text": "Sekunden warten musst, bis Home Assistant gestartet ist und sowas. Das ist blöd. MrRampage"}, {"id": 959, "start": 9563.5, "end": 9573.22, "text": "fragt, das ist ne sehr gute Frage. Der MrRampage fragt nämlich das hier. Max, weißt du eigentlich,"}, {"id": 960, "start": 9573.22, "end": 9577.94, "text": "wie man bei einem Unity Media, DS Lite, es ist übrigens DS Lite, weil es für Duals"}, {"id": 961, "start": 9577.94, "end": 9583.86, "text": "Deck steht, aber es ist, also es hat nix mit DSL in dem Fall zu tun. Anschluss von außen"}, {"id": 962, "start": 9583.86, "end": 9596.3, "text": "erreichbar werden kann. Gibt's mehrere Varianten. Über IPv6 bist du schon jetzt erreichbar"}, {"id": 963, "start": 9596.3, "end": 9605.78, "text": "von außen, weil du ne IPv6 Adresse hast. Also, es kann sein, dass das in dem Router"}, {"id": 964, "start": 9605.78, "end": 9610.78, "text": "irgendeine Firewall drin ist, die das blockt, aber rein adressierungstechnisch bist du mit"}, {"id": 965, "start": 9610.78, "end": 9620.74, "text": "IPv6 von draußen jetzt schon erreichbar. Möchtest du allerdings mit deiner IPv4 Adresse"}, {"id": 966, "start": 9620.74, "end": 9629.02, "text": "erreichbar sein, dann wird es etwas komplizierter, weil es so pauschal erstmal gar nicht funktioniert."}, {"id": 967, "start": 9629.02, "end": 9637.14, "text": "Weil dein Provider tunnelt deinen kompletten IPv4 Traffic über IPv6, deswegen nennt sich"}, {"id": 968, "start": 9637.14, "end": 9644.74, "text": "das ja auch Duals Deck Lite, über deinen kompletten IPv4 Traffic über deinen IPv6"}, {"id": 969, "start": 9644.74, "end": 9652.58, "text": "zu Unity Media. Du hast gar keine öffentliche IP, du hast ne private IPv4 Adresse, gehst"}, {"id": 970, "start": 9652.58, "end": 9658.46, "text": "zu Unity Media und Unity Media hat dann ein paar Ausgangsserver, die sich lustigerweise"}, {"id": 971, "start": 9658.46, "end": 9666.66, "text": "After nennen, die du dir teilst mit, keine Ahnung, 100 Leuten oder so. Das heißt, über"}, {"id": 972, "start": 9666.66, "end": 9676.62, "text": "diesen Weg kommst du definitiv nicht von außen an deinen Rechner zum Beispiel. Es gibt"}, {"id": 973, "start": 9676.62, "end": 9684.18, "text": "mehrere Varianten, was du machen kannst. Du kannst dir nen eigenen Tunnel bauen, du könntest"}, {"id": 974, "start": 9684.18, "end": 9689.74, "text": "dir, also du könntest dir irgendeinen Anbieter suchen, der so nen 6 zu 4 oder was auch immer"}, {"id": 975, "start": 9689.74, "end": 9703.22, "text": "Tunnel macht. Einfacher dürfte es sein, du mietest dir irgendwo nen günstigen Server,"}, {"id": 976, "start": 9703.22, "end": 9712.98, "text": "der ne feste IPv4 Adresse hat oder bekommen kann und tunnelt sein Kram da drüber zu dir"}, {"id": 977, "start": 9712.98, "end": 9721.06, "text": "nach Hause. So würd ich das wahrscheinlich machen. Also als ich Unity Media hatte und"}, {"id": 978, "start": 9721.06, "end": 9726.22, "text": "sie mir das noch nicht wieder eingeschaltet haben, dass ich nen vollwertigen IPv4 Anschluss"}, {"id": 979, "start": 9726.22, "end": 9731.74, "text": "habe, hab ich so gemacht, ich hab euch ja schon mal erzählt, ich hab bei so nem super"}, {"id": 980, "start": 9731.74, "end": 9740.9, "text": "low budget anbieternden Server, also das waren diese 35 Dollar für ne VM auf Lebenszeit,"}, {"id": 981, "start": 9740.9, "end": 9748.18, "text": "aber leider, dass die sowas machen. Und da hab ich so gemacht, ich hab mich dorthin"}, {"id": 982, "start": 9748.18, "end": 9761.66, "text": "verbunden per SSH und dort quasi nen Port mit SSH aufgemacht, wo man dann bei mir lokal"}, {"id": 983, "start": 9761.66, "end": 9767.74, "text": "auf dem jeweiligen Dienst rausgekommen ist. Also kann man sich das vorstellen, ich hab"}, {"id": 984, "start": 9767.74, "end": 9773.42, "text": "mich verbunden von mir auf den Server, der hatte ne feste IPv4 Adresse, hab dann gesagt"}, {"id": 985, "start": 9773.42, "end": 9780.74, "text": "SSH-G, also global am Port lauschen und Port weiterleiten dann auf dieser Port bei mir"}, {"id": 986, "start": 9780.74, "end": 9785.34, "text": "hin. Und dann hab ich noch nen Auto SSH drumherum gemacht, dass es das auch automatisch wieder"}, {"id": 987, "start": 9785.34, "end": 9791.86, "text": "neu aufgebaut hat. Ist im Prinzip nix anderes, wie wenn man sich nen Anbieter ansucht, der"}, {"id": 988, "start": 9791.86, "end": 9811.86, "text": "einen Tunnel bauen kann. Ne Fritzbox alleine bringt dir nix, ne? Unity"}, {"id": 989, "start": 9811.86, "end": 9817.54, "text": "Media muss dich auch wieder umschalten, dass du ne feste IPv4 Adresse kriegst. Also Unity"}, {"id": 990, "start": 9817.54, "end": 9822.62, "text": "Media muss dich dafür von Dualstack Lite auf richtigen Dualstack umschalten. Oder auf"}, {"id": 991, "start": 9822.62, "end": 9839.38, "text": "IPv4 only meinetwegen, sonst bringt dir die neue Fritzbox auch nix. Also ich geb zu, das"}, {"id": 992, "start": 9839.38, "end": 9843.9, "text": "hat sich jetzt alles ein bisschen kompliziert angehört, aber es ist auch ein bisschen komplizierter."}, {"id": 993, "start": 9843.9, "end": 9849.34, "text": "Unity Media, mit Unity Media geht das nicht, so ohne weiteres. Dass wenn du Dualstack Lite"}, {"id": 994, "start": 9849.34, "end": 9856.74, "text": "hast, dass du IPv4 was bei dir weiterleitest. Ja wenn Unity Media dich damit umschaltet,"}, {"id": 995, "start": 9856.74, "end": 9861.5, "text": "dann ist wieder was anderes. Wichtig ist, dass du den Dualstack Lite Geschiss loswirrst."}, {"id": 996, "start": 9861.5, "end": 9874.34, "text": "Dann funktioniert das. Ne dünne DNS alleine bringt dir auch nix. Wenn du IPv4 Port weiterleiten"}, {"id": 997, "start": 9874.34, "end": 9885.94, "text": "willst und IPv4 bei dir daheim nie ankommt, dann bringt dir auch ne dünne DNS nix. Sollte"}, {"id": 998, "start": 9885.94, "end": 9892.02, "text": "das Mieten von einer Fritzbox bei Unity Media dazu führen, dass die dich von Dualstack"}, {"id": 999, "start": 9892.02, "end": 9903.78, "text": "Lite auf richtiges Dualstack umschalten, dann bringt das was. Wobei es schon ein bisschen"}, {"id": 1000, "start": 9903.78, "end": 9914.18, "text": "doof ist, dass man für so ne Basic Funktion 5€ im Monat bezahlen soll. Ich mein ok man"}, {"id": 1001, "start": 9914.18, "end": 9919.46, "text": "kriegt ne Fritzbox zu, aber weiß nicht ob ich das machen würde. Du kannst aber auch"}, {"id": 1002, "start": 9919.46, "end": 9929.46, "text": "so machen wie ich. Du gehst denen einfach 2 Monate am Stück auf den Sack und dann lenken"}, {"id": 1003, "start": 9929.46, "end": 9939.42, "text": "sie vielleicht ein und schalten dich frei. Weil ich hab mittlerweile wieder ne feste"}, {"id": 1004, "start": 9939.42, "end": 9946.62, "text": "IPv4 Adresse oder ich hab wieder eine Public IPv4 Adresse bei Unity Media. Aber ich hab"}, {"id": 1005, "start": 9946.62, "end": 9950.78, "text": "die wirklich lange genervt und auch öffentlich auf Twitter genervt, was bei mir halt auch"}, {"id": 1006, "start": 9950.78, "end": 9961.86, "text": "noch nen gewissen Nachdruck hat, wenn sich das 20.000 Leute immer sehen. Kapparot das"}, {"id": 1007, "start": 9961.86, "end": 9965.54, "text": "interessiert die meisten Leute auf YouTube leider nicht. Ich hatte mir eigentlich vorgenommen"}, {"id": 1008, "start": 9965.54, "end": 9969.7, "text": "ich will dieses Jahr ein bisschen mehr Technik Krams auf YouTube machen. Aber wie gesagt"}, {"id": 1009, "start": 9969.7, "end": 9973.86, "text": "ihr habt gesehen wie viele YouTube Videos dieses Jahr gekommen sind. Da hielst du dir"}, {"id": 1010, "start": 9973.86, "end": 9990.14, "text": "Grenzen. Ja ok wenns bei dir so einfach funktioniert, dass ich weiß ich hab die 2 Monate genervt."}, {"id": 1011, "start": 9990.14, "end": 10017.58, "text": "Ihr könnts ja auf Twitter im Prinzip nachlesen. So Leute wir sind eigentlich fertig soweit."}, {"id": 1012, "start": 10017.58, "end": 10032.18, "text": "Ich glaub ich geh jetzt Abend essen. Äh falsches E-Mail Teil. Was ist das für ein Programm"}, {"id": 1013, "start": 10032.18, "end": 10042.1, "text": "mit dem Regenbogen? Lolcat ist das. Lolcat. Also das Fond, Linux Befehlsnamen. Der Fond"}, {"id": 1014, "start": 10042.1, "end": 10048.02, "text": "kommt aus Toilet. So heißt das Programm. Und Lolcat macht diese Regenbogen-Geschichte."}, {"id": 1015, "start": 10048.02, "end": 10058.7, "text": "Also wir können auch sowas hier machen, sowas wie LolW. Achso und drumrum ist ne Weilschaft."}, {"id": 1016, "start": 10058.7, "end": 10062.74, "text": "Brauchst du aber nicht. Das brauchst du nur wenn du es ein bisschen schneller ausgeben"}, {"id": 1017, "start": 10062.74, "end": 10078.02, "text": "willst. Wenn du das weglässt, hast du das Problem, dass das Ding. Warte mal das macht."}, {"id": 1018, "start": 10078.02, "end": 10082.7, "text": "Ok ich dachte das macht das eigentlich schon standardmäßig endlos, aber deswegen hab"}, {"id": 1019, "start": 10082.7, "end": 10101.42, "text": "ich wahrscheinlich mit der Schleife drumrum umgemacht, dass es das endlos macht. Ok dann"}, {"id": 1020, "start": 10101.42, "end": 10124.34, "text": "schauen wir mal, wen können wir heute hosten? Wen können wir heute hosten? Filter. Äh German."}, {"id": 1021, "start": 10124.34, "end": 10132.5, "text": "Den haben wir da. Ich einfach der Erste immer in dieser Kategorie bin. Plender Modeln lernen."}, {"id": 1022, "start": 10132.5, "end": 10144.46, "text": "Super Sonntag Special Stream. Was ist das denn? Oh. Ist das was für uns Leute? Ich"}, {"id": 1023, "start": 10144.46, "end": 10154.82, "text": "glaub nicht. Die ganzen Weeps hier die sind damit. Das geht nicht. Ich kanns nicht lesen."}, {"id": 1024, "start": 10154.82, "end": 10170.1, "text": "Ein bisschen kleiner Text vielleicht. Allerdings macht es mir schon mal sympathisch. Es ist"}, {"id": 1025, "start": 10170.1, "end": 10181.74, "text": "dot net. Der Typ den du gestern gehostet hast wohnt 10 km vom Jahr. Ich fand den Stream"}, {"id": 1026, "start": 10181.74, "end": 10185.82, "text": "ganz nice. Ich würde interessieren hat jemand so lange geguckt? Hat er das noch hingekriegt"}, {"id": 1027, "start": 10185.82, "end": 10194.02, "text": "mit seiner Grafikkarte? Hat das noch funktioniert am Ende? Hat jemand zufällig so lange geguckt?"}, {"id": 1028, "start": 10194.02, "end": 10213.66, "text": "Android App. Android App ist interessierend. Developing Semantic Release. Was? Ich weiß"}, {"id": 1029, "start": 10213.66, "end": 10221.26, "text": "ja nicht mal was er überhaupt macht. Der hat ein Kabel abgerissen. Oh. Typescript."}, {"id": 1030, "start": 10221.26, "end": 10238.06, "text": "Warum printet er? Ach nee LSIS ist das. Es ist wirklich ein Livestream von seinem 3D"}, {"id": 1031, "start": 10238.06, "end": 10258.5, "text": "Poker mit einem FPS. CS. Klar. Wir gucken mal der Gelegenheit. Was sind denn so die großen"}, {"id": 1032, "start": 10258.5, "end": 10262.9, "text": "deutschen Streams? Was gibt es denn da? Ich guck ja eigentlich nix. Trimax von dem hab"}, {"id": 1033, "start": 10262.9, "end": 10268.42, "text": "ich schon mal was gehört. Schlora von dem hab ich auch schon mal was gehört. Kenn ich"}, {"id": 1034, "start": 10268.42, "end": 10275.34, "text": "nicht. Das sagt mir irgendwas. Von dem hab ich auch schon mal irgendwas gehört. Die Nigo"}, {"id": 1035, "start": 10275.34, "end": 10285.98, "text": "den kenn ich. Sagt mir gar nix. Das sagt mir auch. Das ist schon mal gesehen. Take kennt"}, {"id": 1036, "start": 10285.98, "end": 10290.42, "text": "man natürlich. Kenn ich nicht. Kenn ich auch nicht. Kenn ich auch nicht. Kenn ich auch"}, {"id": 1037, "start": 10290.42, "end": 10294.82, "text": "nicht. Kenn ich auch nicht. Kenn ich auch nicht. Kenn ich nicht. Kenn ich? Wenigstens"}, {"id": 1038, "start": 10294.82, "end": 10305.14, "text": "mal einnehmer kennt. Kenn ich nicht. Gut. Kennt man. Kenn ich nicht. Kenn ich. Guck"}, {"id": 1039, "start": 10305.14, "end": 10311.74, "text": "ich nicht. Sagt mir alles nix. Von dem hab ich schon mal was gehört. Von dem hab ich"}, {"id": 1040, "start": 10311.74, "end": 10328.98, "text": "auch schon mal was gehört. Den kenn ich auch. Der Name sagt mir auch irgendwas. Rest kenn"}, {"id": 1041, "start": 10328.98, "end": 10349.22, "text": "ich alle hab ich noch nie was von gehört. Ach der streamt auch. Wie viele Mädels es"}, {"id": 1042, "start": 10349.22, "end": 10360.06, "text": "mittlerweile auf twitch gibt. Und alles keine boob cam Sachen gibt's. Bin ja begeistert."}, {"id": 1043, "start": 10360.06, "end": 10366.46, "text": "Dass sich da normale streams jetzt immer mehr durchsetzen. Okay ansonsten kenn ich keinen"}, {"id": 1044, "start": 10366.46, "end": 10379.78, "text": "mehr. Das hast du jetzt gesagt. Keine Ahnung. Aber die kenn ich. Die hat der Fabian mal"}, {"id": 1045, "start": 10379.78, "end": 10384.86, "text": "gehorstet. Das hab ich schon mal gesehen. Ja gut. Ich weiß nicht wen ich horsten soll."}, {"id": 1046, "start": 10384.86, "end": 10396.5, "text": "Keine Ahnung. Fällt mir jetzt. Fällt mir jetzt nicht nix ein. Wer ist denn bei ähm."}, {"id": 1047, "start": 10396.5, "end": 10401.5, "text": "Komm mal hier discover. Wer ist denn bei wie heißt denn diese Kategorie. Es gibt auch"}, {"id": 1048, "start": 10401.5, "end": 10413.02, "text": "noch mehr als diese science and technology. Oh hier. Programming. Alter Katze was los."}, {"id": 1049, "start": 10413.02, "end": 10440.94, "text": "So. Katze. Chico komm mal her. Komm mal her. Sag dem stream mal hallo. Komm mal her."}, {"id": 1050, "start": 10440.94, "end": 10464.3, "text": "Die will nicht. Ich bin der viertgrößte weltweiser. Von der hab ich schon mal irgendwas gehört."}, {"id": 1051, "start": 10464.3, "end": 10473.66, "text": "Hab ich glaub ich mal nen konferenz vortrag oder so gesehen. Okay ähm. Ich weiß nicht"}, {"id": 1052, "start": 10473.66, "end": 10476.3, "text": "wen ich horsten soll. Keine Ahnung. Da horst ich heute keinen. Wenn mir keiner einfällt."}, {"id": 1053, "start": 10476.3, "end": 10484.7, "text": "Katze willst du nicht immer dem stream hallo sagen. Kannst mal ne runde brumm ins mikrofon."}, {"id": 1054, "start": 10484.7, "end": 10496.3, "text": "Runde schnurren ins mikrofon. Ne diesem abenteuer rumgucken modus. Aber für die bessere emersion"}, {"id": 1055, "start": 10496.3, "end": 10503.22, "text": "hab ich noch ein bild von der Katze bevor wir ausmachen. Da isser. So leute ich hoffe"}, {"id": 1056, "start": 10503.22, "end": 10508.34, "text": "euch hat es gefallen. Wir machen jetzt schluss. Wir sehen uns wahrscheinlich morgen wieder."}, {"id": 1057, "start": 10508.34, "end": 10515.02, "text": "Aktuell ist ja richtiger streaming streak am start. Bis denn. CU. Achso und falls ihr"}, {"id": 1058, "start": 10515.02, "end": 10519.14, "text": "noch nicht im discord seid. Könnt ihr mal im discord vorbeigucken. Kommt natürlich gerne"}, {"id": 1059, "start": 10519.14, "end": 10524.9, "text": "auch auf youtube twitter und natürlich auf twitch selber folgen. Dass ihr immer seht"}, {"id": 1060, "start": 10524.9, "end": 10538.9, "text": "wenn es was neues gibt. Machts gut. Bis zum nächsten mal tschüss."}]}