{"text": "Congratulations! 10 B Ja Leute, ich bin eigentlich ja schon längst am Start. Ich wollte nämlich gerade mal gucken, was für Emotes besonders beliebt sind hier auf FrankerFacesZ Die Musik kann sich auch nicht entscheiden ob lauter oder leiser, ne? Haben wir schon alles? Wir haben jetzt übrigens als Emote auch noch LULW, haben wir noch. Und Kratos ist irgendwie nix dabei, was ich unbedingt bräuchte. Brauchen wir den da? Moment, das andere war auch ganz cool. Wartet mal, wo war es denn jetzt hier eben? Das ist auch so ne Kacke an Endless Scroll, dass es immer wieder an der gleichen Stelle anfängt. MonkaSpeed, ich find den auch nicht schlecht. Brauchen wir den noch? Okay, da muss ich den gleich noch mal im Channel hinzufügen. Aber erstmal hier muss ich fürs Minibot hinzufügen, White, Peepo, also immer. Das sieht schon ziemlich kacke aus, wenn man das so groß zieht, oder? Wie viele Emotes gibt es denn bei FFZ? Ich glaub 25 und mit Abo 40, irgendwie sowas. Log in to add Emotes, ich bin auch schon logged in. Heals Wired, man. Ja, Wired Champ. Ach jetzt, jetzt sagt, jetzt hat er auf einmal gecheckt, dass ich log in bin. OMEGALUL. OMEGALUL. So, jetzt haben wir auch noch White Peepo Happy im Channel zur Verfügung, da hat er die Welt drauf gewartet. Den Rest machen wir dann nachher. So Leute, also was wir heute vorhaben, es wird ein bisschen abenteuerlich, ich hab das ja schon mal gemacht, aber ich hab gesehen, es gibt ne neue Version von meiner Staubsauger Firmware, das heißt, und die haben richtig viele gute Änderungen drinne. Zum Beispiel, wir können uns mal das Change Log ansehen. Ja, das braucht ein paar Minuten, das braucht nur 5 Minuten. Äh, ich muss mal kurz mal die Vorschau hier richtig aufmachen, Recent Events, was hat mich eigentlich gerissen? Warum hab ich eigentlich Tippy Stream genommen, für Donations und Streamlabs für alles andere, kann mir das irgendjemand erklären? Wie nächstes, danke für den Sub. Der Matt K. ist auch am Start, Twitch Prime, nice. Also, jetzt können wir uns mal kurz angucken, was es für neue Features gibt, was wir jetzt neu eingebaut haben. Und da sind schon ein paar ganz praktische Geschichten dabei. Zum Beispiel kann man jetzt einstellen, dass, wo stand es denn jetzt hier, Go, genau, man kann jetzt einstellen, dass man Virtual Walls aufstellen kann für den Staubsauger. Ach, Sie Baro sind es tatsächlich, sind es 50, ja. Meine Vorschau geht nicht richtig, deswegen sehe ich das mit den Subs irgendwie nur so halb. Ganz merkwürdig. Meine Vorschau hat gerade ungefähr 0,3 FPS, das aktualisiert sich so alle 2 Sekunden mal. Wire, Wirechamp, geht es jetzt vielleicht besser? Keine Ahnung, was mit meiner Vorschau abgeht und es wieder rumspackt. Ist auch egal, man kann jetzt zum Beispiel Virtual Walls hinstellen, wo der Staubsauger Roboter dann nicht hinfährt. Das ist sehr nice, zum Beispiel, bei mir sieht es ja so aus, im ersten Stock, da habe ich ja hier quasi Pain Skills, aber hier ist der Flur, der Flur ist ungefähr so, hier ist mein Arbeitszimmer, hier ist das Wohnzimmer, hier ist das Schlafzimmer und so weiter. Und hier die Treppe vom Erdgeschoss rauf und der Staubsauger hat zwar, der Staubsauger, achso hier hinten ist auch noch ein Zimmer, da ist auch noch ein Zimmer, so ungefähr sieht das aus. Und das Schlafzimmer ist sogar ein bisschen länger. Ja, so ungefähr sieht das Ganze aus. Und der kann ganz gut hier hin und her fahren, der hat aber auch einen Sensor, dass er die Treppe nicht runterfällt. Allerdings, was man jetzt machen kann, man kann jetzt hier einstellen, so ein No-Go Area, dass er gar nicht versucht hier hinten zu fahren, weil hier kommt er eh nicht richtig hin, da spackt er manchmal ein bisschen rum und der versucht dann immer wieder die Treppe anzufahren, weil er irgendwie nicht checkt, dass es dann nicht weitergeht. Der fährt dann hier lang, ich fall runter, zurück, ich fall runter, zurück, ich fall runter, zurück, ich fall runter, zurück und dann hier ist neben so ein Geländer, da kommt er aber unten drunter durch, der versucht das auch jedes Mal so, ich fall runter, zurück, ich fall runter, zurück. Total sinnlos. Dem kann man jetzt einfach auf der Map markieren No-Go Area und dann sollte er das nicht mehr machen. Das probieren wir gleich mal aus, ob das Ganze funktioniert. Man kann jetzt über MQTT, also hier, über MQTT kann man jetzt Nachrichten verschicken, dass der Staubsauger irgendwie losfährt zu irgendeiner Zone oder sowas, brauche ich jetzt nicht. Der Editor ist neu, das finde ich ganz gut, man kann jetzt nämlich auf der Map, der Staubsauger legt ja eine Karte von einer Wohnung an, auf der Map kann man jetzt direkt per track and drop die Zonen definieren, wo er hinfahren soll. Da zieht man beispielsweise in ein Viereck, zumindest man zieht es ja hier glaube ich im Pull-Request, nee. Pull-Request, ach guck mal, die haben jetzt sogar Bildchen dabei. Genau, man kann jetzt hier so einstellen, hier, da, da sollst du es auch mal machen und man kann das Ding dann benennen, zum Beispiel, keine Ahnung, Wohnzimmer und das kann man halt direkt auf der Karte editieren, das ist eigentlich ganz praktisch. Mach mal Ausrufezeichen 1, dann wird das erklärt. 1 ausgeschrieben, das kriegen wir, das ist der Noob-Filter. So und als nächstes gibt es noch, wir brauchen übrigens noch einen E-Mode habe ich gesehen, wir brauchen noch Dings hier, das halbe Kappa Ding, das brauchen wir noch, Kap, Kap brauchen wir noch. Ach, ist schon, ist schon, lass mal gucken, ob das funktioniert, funktioniert, Kap, Kap, ja funktioniert, ach sehr schön, ja und wenn das stimmt, was der Sebaro sagt, das muss ich mir nachher nochmal angucken, aber wir gehen mal davon aus, weil der Sebaro erzählt ja eigentlich, außer dass der nachts sehr merkwürdige Bilder im Discord postet, kann man sich ja eine Regel darauf verlassen, was er sagt, deswegen werde ich nachher mal 5 Euro an das Projekt donaten und dann kriegen wir 50 E-Modes und dann brauchen wir natürlich noch die üblichen Twitch Sub, übrigens, ich brauche für Twitch, brauche ich noch einen ordentlichen Prefix für meine E-Modes, das war mir vorher gar nicht klar, man darf sich selbst auswählen. Sektor cleared, Prime Sub, sehr nice, übrigens bei der Gelegenheit, falls ihr einen Prime Account habt, jetzt erstmal eine Runde Sellout starten, falls ihr einen Prime Account habt bei Amazon, man kann ihn mit Twitch verbinden, man bekommt dann jede Menge Lootboxen und nein, Prime Loot heißt das Ganze, allerdings kann man auch einen Streamer einmal im Monat mit einem Tier 1 Sub kostenlos unterstützen. Kommt so bald frei, wie gesagt, muss ja keiner, ich erwähne es bloß mal nebenbei, weil bisschen Sellout, easy Sellout, easy Live, easy, so, ähm, ach Moment, ich muss ja mein PP-Gabort ist ja noch gar nicht gestartet, jetzt kriege ich ja gar keine Fragen im Chat mit, Moment, erstmal starten, Lootboxen, ja wie sagt denn Twitch dazu, es ist Prime Loot oder sowas oder Twitch Prime Loot oder, nein Prime Loot heißt es, ok, dämlich und bescheuert, damit komme ich als Erklärung daher, das ist halt so, ne, was willst du sagen, das ist halt so, ich hab mir das mal irgendwann so angewöhnt, immer Zeug zu kopieren und wenn man sich mal an sowas gewöhnt hat, dann ist es auch schwierig, sich das wieder abzugewöhnen, außerdem wozu, ja, der Eufy ist super, ah sehr schön, ah das hat er gestern gepostet, es meint es ist von gestern, direkt als Autostart doch, könnte man machen, genau, was gibt es sonst noch neues in der Firma, also ich hab aktuell Version 3, 3 plus ein paar Patches und jetzt installieren wir Version 4, das geht übrigens nur für Generation 2, aber ich hab hier ein Generation 2 Staubsauger, das ist ganz praktisch, man kann jetzt SSH Keys direkt über das Webinterface hochladen, das war immer ein bisschen gefurdelnd, wenn man die SSH Keys verkehrt hat, und man kann irgendwie über das Webinterface Versionsupdates machen oder sowas, das wäre auf jeden Fall nicht verkehrt, weil das Flaschen über den Raspberry ist immer nervig, was für ein Staubsauger habe ich, ich stehe noch im Titel, einen, den da, den da, also ich hab 2 aktuell, ich hab ein Eufy 11 und ich hab einen Roborock S50, der hier ist natürlich klar der bessere, der kostet aber auch 2-3 mal je nach Angebot so viel, Roborock, Alter Chat, Twitch Chat wieder es, wieder, Wirechamp, und der Eufy ist ganz praktisch, also der da, der Eufy, der Eufy ist ganz praktisch, der ist nämlich sehr flach, der passt auch unter alle Schränke und so drunter, ich machs jetzt immer so, der macht eigentlich alles inklusive Flur und der kriegt auch richtig gut Katzenstreu und sowas alles weg im Flur, und der ist halt auch schnell, weil er die Räume abscannt, und den Eufy setze ich dann ab und zu nur noch mal ins Schlafzimmer und überall da wo Schränke und was ist wo der andere nicht richtig drunter kommt, da darf der Eufy dann noch ein bisschen im Kreis fahren, im Zickzack, weil der Eufy ist ziemlich dumm, der fährt immer gegen die Wand, nächste Ecke, nächste Ecke und so weiter, und der ist halt schlauer, der scannt den Raum ab per Laser, so, was das Katzenstreu soll auch in eine Kiste und nicht einfach in Flur, die Katze die hält sich da aber nicht dran, die sitzt dann da drauf und macht dann erstmal ihren Haufen rein und dann wird gescharrt und dann fliegt halt das Katzenstreu mit raus, da kannst du nichts dagegen machen, da, die da, Eufy kostet 179 auf Amazon, hast du nicht 2 Katzen? Ne, hab ich nicht, so und was gibt es sonst noch so für schöne Changes, kommt der Roborock S50 auch mit Räumen klar wo ein Teppichübergang ist, ja, der kommt damit ziemlich gut klar, der hat sogar einen extra Teppichmodus wo er hoch dreht, also man kann das so einstellen dass der erkennt, man kann das auch einstellen wie empfindlich das ist, dass der erkennt wenn er jetzt auf ein bisschen dichtere Teppiche drauf fährt, dann fährt er halt auf den Teppich drauf und du merkst sobald er auf dem Teppich ist fängt er halt an und saugt sich einen ab, Memory Leak was fixed, siehst du mal so weit sind wir schon, 2019 kann sogar der Staubsauger an Memory leaken und wieso routest du den Robo in der dass ich die Kastleinfirma drauf machen kann, weil die originale Firmware geht nur mit offizieller App und es ist ja nicht nur dass du nur die offizielle App brauchst, du brauchst die offizielle App und die Verbindung geht immer über die Cloud in China und ich hab kein Bock dass mein Staubsauger eine Cloud Verbindung nach China braucht, besser looking default map ist auch ok, probieren wir einfach mal aus, ja so sieht es aus, aber ich kann das Ding empfehlen und es gibt das ab und zu mal relativ günstig, das ist ja nicht mal das aktuellste Modell von denen, es gibt jetzt schon einen S6, der S6 hat das Problem dass es glaube ich noch keine Kastleinfirma gibt wobei müssen wir mal schauen, ob es für den S6 mittlerweile schon eine Firmwareversion gibt, support for S6 vor 15 Tagen, warum kriegt der Typ einen Daumen runter, das ist doch eine vollkommen legitime Frage für das Projekt, so nach dem Motto ja wir sind ein Projekt für Roborock Staubsauger, ja ist der Roborock S60 Supporter, Daumen runter, Diss Abo Daumen runter, rooting this cousin should be done over in dustcloud, woher soll denn das dude denn wissen, da würde ich auch nicht drauf kommen, ok gucken wir mal ob wir den S6 schon, warum heißt der denn da T6, offiziell heißt der S6, wirechamp, was ist denn ein guter Preis für den S50, 400€ ist viel zu viel, ich habe den damals bei einem Angebot bei Amazon gekriegt, ich glaube für um die 300€, ich muss mal nachgucken was meiner gekostet hat, wir gucken einfach mal bei Guides Hals, ich gucke mal kurz nebenbei in den Mails was meiner gekostet hat bei Amazon, guck mal in der Vorschau ist er sogar schon drinnen, mal gucken mit welcher E-Mail Adresse habe ich ihn bestellt, ich muss mal Alternate, oh man was man da für E-Mails findet die will man überhaupt nicht finden, wenn man nach Alternate sucht, feels, merkwürdig Champ, wenn ich nach Alternate suche, warum finde ich dann 100.000 Werbemails, was ist das denn, E-Mail Volltext Suche in 2019, ok, ich finde es gerade nicht, ich glaube ich habe irgendwas um 300 oder 320 oder irgendwie sowas bezahlt, das war ein ziemlich gutes Angebot, er steht hier gar nicht drinnen, das gab es mal als Angebot, das ist er doch, ja viel zu teuer, also ich würde gucken, dass ich auf jeden Fall unter 350 kriege, am besten irgendwas für Richtung 300, weil alles andere ist dann nicht mehr so Schnäppchen mäßig und auf jeden Fall gucken, es gibt einen S5, die haben irgendwie vier verschiedene, also man muss gucken, dass es der S50 ist und man muss gucken auch, dass es nicht der S6 ist, weil den S6 kann man nicht flashen, so ein Smokersmoke, das hier ist viel viel zu teuer, WTF, muss man auf ein gutes Angebot warten, aber ich kann ihn auf jeden Fall empfehlen, guck hier gibt es ihn zum Beispiel ab 3960, das glaube ich nicht, das glaube ich, also für 280 würde ich den sofort kaufen, aber das ist bestimmt Skamars, also zumindest das Angebot sieht nicht nach Skamars, also es sieht jetzt auf den ersten Blick nicht Ultraskamars aus, also 280 Euro ist ein absolut Hammer Angebot, wenn das dann auch wirklich funktioniert, ach das ist die erste Generation, die können sich nicht entscheiden, Moment, die können sich nicht entscheiden, ne erste Generation sackt, erste Generation sackt, auf jeden Fall zweite Generation, aber die erste Generation ist doch glaube ich gar nicht, S50 oder, wat, was oben hast du das Modell zur Auswahl, ne das ist die Stückzahl, ach hier da, hier 50, aaaah, ja da kommen da Sachen schon näher, 470, Omega Lull, ne so nicht, Skamars, also ich würde gucken, dass ich einen unter 350 kriege auf jeden Fall, dann kann man sich da drüber Gedanken machen, ob das nicht, dann ist das Ding ein ganz gutes Angebot, tubated, ja, massive tubate, ok, als erstes müssen wir den komischen Papagei noch drin haben, naja, wie dem auch zwar als erstes, muss ich jetzt mal mein Raspberry holen anschließen, weil, wenn ich das noch richtig in Erinnerung hab, wenn ich das noch richtig in Erinnerung hab, ging der Flash Vorgang ungefähr so in der Richtung, wir müssen uns mal, die hat ne ganz gute Anleitung auf der Seite, also wenn ich das richtig in Erinnerung hab, ging das ungefähr so, man hat sich nen Image runtergeladen vom Hersteller, was bringt dir das Flaschen, ungeflasht braucht das Ding die offizielle App vom Hersteller und die offizielle, das alleine wär ja noch nicht so schlimm, aber die offizielle App vom Hersteller geht nicht direkt auf den Staubsauger, sondern geht immer über die Cloud in China und zum Staubsauger, also sowohl dein Staubsauger braucht permanente Verbindung zur China Cloud, als auch die App braucht permanente Verbindung zur China Cloud und wenn die China Cloud nicht geht, kannst du deine Wohnung nicht sauber machen, geschweige dann, dass ich eigentlich auch gar nicht will, dass mein Staubsauger in der China Cloud hängt, aber wenn du den flashst, ist die China Cloud weg, das ist richtig beknackt SneakyPile, das ist total bescheuert, oh ich hab einen Prime Sub vergessen, klumina01, Dankeschön Twitch Prime am Start, Pock, Internet of Shit, ja ist tatsächlich so, wir machen mal einen Twitter Post, weil sich ja wieder letztens Leute auf Twitter beschwert haben, dass sie nicht mitbekommen haben, sag mal habt ihr alle schon das neue Twitter Design, ich bekomm das nicht, ich bekomm nicht das neue Twitter Design, ist das machbar für jemand, der keine Ahnung hat, du kannst einfach mal zugucken, ich denke schon, dass es machbar ist für jemand, der keine Ahnung hat, allerdings sollte man sich nicht, sollte man ein bisschen Zeit einplanen, ich kanns nicht zeigen, weil ich nicht eingeloggt bin hier auf Twitter, ich hab noch das alte Design, wo die Knöpfe oben sind, wo die Knöpfe oben Startseite, Mitteilung, Nachrichten das neue Design hat die Knöpfe ja links an der Seite ok, jetzt hab ich mal die Sache auf Twitter gepostet, könnte es eigentlich auch so machen, dass es automatisch in Twitter Nachrichten schickt, wenn man on geht, das wäre vielleicht auch gar nicht so blöd, also zumindest wenn ich das richtig in Erinnerung hab, wie das ganze funktioniert hat, man braucht auf jeden Fall irgendein Gerät, wo man Access Points drin aufmachen kann, also man braucht ein Raspberry, man hat irgendein anderes Gerät, man kann auch sein Desktop nehmen mit einem USB Stick, mit einem WLAN USB Stick oder sowas in der Richtung, so und wie das ganze so grob funktioniert hat, wenn ich das in Erinnerung hab, man lädt sich die letzte aktuelle Firmware runter vom Hersteller und dann lädt man sich von GitHub, wir machen gleich die Anleitung mal durch, dann lädt man sich von GitHub so nen riesen, riesen Skript runter, was die Firmware modifiziert und als letztes lädt man sich dann auch hier dieses Fallow-Dingsbums, ich kann mir das immer nicht merken, wenn man das ausspricht, Fallow-Tudo runter, das ist ein Go-Programm und baut das in die Firmware ein, dann muss man das ganze flashen, wo ich mir nicht mehr ganz sicher bin, ist ob man die Firmware auf seinem Desktop bauen konnte oder ob man die Firmware auf dem Raspberry bauen musste, ich glaube man konnte, ich glaube man konnte die Firmware auf dem Desktop bauen und dann auf den Raspberry kopieren, Neoui, so einen hab ich auch noch, der ist auch an sich ganz gut, gerade dafür, dass er halt so blöde ist und halt nicht super intelligent, sondern einfach nur die Ecken abfährt, ich find's an sich auch ganz gut, wenn die Dinger ohne großartige Cloud-Anbindung oder sowas da her kommen, aber in dem Fall ist es halt so und das Gerät kann halt auch deutlich mehr, das kann beispielsweise die Räume scannen mit einem Laser, dass der weiß wie groß der Raum ist und fährt den dann halt auch gezielt ab, also wenn ich mir mal den Eufy angucke, der Eufy braucht fürs Wohnzimmer drüben keine Ahnung, eine halbe Stunde bis der das ordentlich sauber gemacht hat, weil der halt komplett planlos random fährt, der S50 braucht richtig ordentlich mit Teppichmodus 10 Minuten, das hat schon einen Unterschied, ob das Ding random den Raum zickzack durchfährt oder ob das Ding den Raum geplant durchfährt, wir gucken uns das dann auch gleich an, wenn er rumfährt. So, also wie ging denn der ganze Kram nochmal, hab ich vielleicht noch irgendwo was hier vom letzten, den Rute, warte, S5, habe ich hier vielleicht noch das alte Verzeichnis irgendwo drauf, Firmware, wie könnte ich das genannt haben, ich glaube das habe ich dann mal drauf, ok, dann muss ich das komplett neu herunterladen, den ganzen Mist, so, Laurenz, Twitch Prime, Dankeschön, Nice, Naisu, ok, wir empfehlen die folgende Firmware für den Vorgang, Firmware V1111001782, ok, Nice, machen wir, Introduction, kann man lesen oder, Hallo Tommy K, kann man eigentlich ganz gut lesen, jetzt hier von der Größe her, how this works, Blablabla, Local Interface, Blablub, so, das ist die technische Erklärung dahinter, wie sie es machen, how installation works, Encrypted but unsigned Firmware Image, Encryption Key, Blablabla, User has to download Firmware Image from Manufactor, ja, das machen wir und Patch them, genau, das war der Act, also man musste, kann ich mich noch dran erinnern, man musste vom Hersteller, man musste sich irgendwo einen Download suchen von der Firmware vom Hersteller und dann musste man die modifizieren mit dem Patch, oder ich muss mal die Klimaanlage anmachen, es ist übel warm hier drin, Mode, Mode, Klimaanlage, geh mal auf kühlen, kühlen, nice, so, Dependencies, Hammer bestimmt alles, Root Access, if you plan on being able to connect to your SSH, das brauchen wir nicht, das brauchen wir nicht, weil in Version 4 kann man den SSH Key hochladen über das Webinterface, Max, welche GPU empfiehlst du für 1080p 150Hz Gaming, ich beschäftige mich mit Grafikkarten und Zeug eigentlich in der Regel immer nur, wenn ich mir einen Rechner kaufe, allerdings, wenn ich mir jetzt einen neuen Rechner kaufen würde, nach allem was ich gelesen habe, würde ich wahrscheinlich eine 2070 oder sowas kaufen, oder ich würde wieder anfangen Videos zu machen und mir von Nvidia eine 2080 Ti geben lassen, das ist nämlich next level. Okay, Image Building, also wir müssen jetzt als erstes mal uns irgendwo das Hersteller Image runterladen, oder? Ne, ne, wir laden keine fertige Images runter, wir machen das selbst, okay, also, mkdir, ich bin mir nicht mehr sicher, ob man das auf dem Desktop oder auf dem Raspberry machen musste, ich würde sagen, wir machen es mal auf dem Raspberry, weil auf dem brauchen wir den Kram bis am Ende eh. Ich stöpsel mal kurz den Raspberry ein oder andert mal kurz, omegamode, so, Raspberry, ok, ok, ok, das Ding startet. Da machen wir das nämlich auf dem Raspberry, das ist besser. Gut, Pi Add, dann hoffen wir mal, dass er die gleiche IP kriegt wie das letzte Mal, muss ich erstmal nachgucken was er für eine IP gekriegt hat. Komm, komm on brah. Oh ne, eine andere IP gekriegt, muss ich mal kurz ins DHCP gucken. DHCP leases. Raspberry, was hat er denn gekriegt, ne Hunde. Ich hab die auch richtig bescheuert, ich hab das doch jetzt nicht im Wlan, sondern per Netzwerkstecker dran. Jetzt sind wir auf dem richtigen drauf. Statisches DHCP, äh ich glaub ich hab sogar statisches DHCP für das Ding, allerdings hab ich gerade den falschen Netz probiert. So, haben wir mal ein Update von dem Ding. Man weiß ja nie, beim 4er tut sich ja da auch noch recht viel. Go, go. Lohnt sich der 4er? Naja, also nur in Ausnahmefällen. Nur in Ausnahmefällen. Die Ausnahmefällen sind würde ich sagen, ähm, Media Center. Wobei ich ganz ehrlich, ich würde den Raspberry auch nicht als Media Center verwenden. Vielleicht den 4er, das müsste ich mal ausbrechen, aber ich finde da sollte man sich einfach günstig einen Android TV Stick kaufen und glücklich sein und das läuft dann in der Regel viel besser. Ähm, ja als Media Center würde ich den 4er nehmen, wenn es unbedingt ein Raspberry sein muss. Falls ich irgendwelche Anzeigewände habe, was wahrscheinlich die wenigsten hier haben, dann würde ich den 4er nehmen. Oder wenn ich ein ganz, ganz billiges NAS bauen will und halt die USB und Netzwerkübertragungsraten bräuchte. Aber dafür ist eigentlich an sich nicht geeignet. Allein schon weil du keine Verschlüsselung gescheit mit machen kannst, weil er dafür viel zu lahm ist. Oder es liegt am 32-Bit-Respieren, weil die, ähm, Arm-CPU ihre Encryption, äh, Crypto-Extensions nur unter 64-Bit verwenden kann. Wie viele Subs gab es heute schon? Ich glaube, vier oder fünf? Übrigens, gestern, total übertrieben, ne? Ich hab gestern mal nachgeguckt, ich guck mal wie viele Subs ich jetzt hab. Gestern nachgeguckt und ich hab ja so im Stream gesagt, naja, werden so 30 oder so gewesen sein. 52! 52! Huge! Noch, noch mehr Subs, hier, der GW-Oz-13-Kusch-Renada, naja, ähm, Twitch-Prime. Ich mach's über Holt bald exklusiv. Ja, wenn ich irgendwann mal, ähm, keine Ahnung, 40.000 Subs oder so hab. Shroud hat 40.000 Subs, ne? Ich letztens irgendwo gelesen. 40.000 Subs ist schon ziemlich pock. Reaction-Streams, ja. Ich hab doch letztens, haben wir doch ein Stream gemacht, wo ich irgendwie, letzten Sonntag hab ich mal ein Stream gemacht, wo ich gesagt hab, irgendwie Aufwach-Stream, wo wir uns ein paar Videos angeguckt haben. Das war ja so eine Art Reaction-Stream. Und da hatte ich auf einmal voll viele Zuschauer. So, aus dem Nichts. 100 Subs Face-Reveal, naja, 5000 Subs Face-Reveal. 5000 Subs Face-Reveal, oder eine Million Abos auf YouTube auf Face-Reveal. Easy. Gehst doch einfach auf den Boden schlafen, das siehst du halt schon. Ich guck exklusiv wirklich gern. Ähm, der ist halt, der hat halt so seine eigene, seine eigene Art irgendwie das zu machen. Ich find's halt, ich find's halt übelst lustig, ne? V.a. wenn er zwischendrin auf seinen Stuhl springt und irgendwie da drauf rumspringt. Also, ich weiß nicht, ich kann's mir nicht den ganzen Tag angucken, aber ich find's zwischendurch echt lustig. Der 300k Hype-Train, ich krieg aktuell auf YouTube, krieg ich schon wieder massig D-Abus einfach, weil ich nichts hochlade. Mit 300k ist da nichts auf YouTube, ne? Wie, es gibt keine Updates? Das glaub ich nicht. Für den Vierer gab's täglich Updates normalerweise. Warum, warum, warum gibt's keine Updates? Okay, ich will mich jetzt nicht beschweren, dass es keine Updates gibt. Man kann nicht abonnieren, ja, seit gestern, seit gestern irgendwie 17 Uhr oder so. Hat Twitch, äh, war Twitch der Meinung, wir schalten's jetzt frei. Also, ja. Also, ich mein, überlegt euch mal für die Größe vom Stream, ne? Und bei der ganzen Zeit sind's 52 Subs ist echt schon, das ist, äh, huge. Aber ich hab halt Big Brain Subs. Sie wissen halt, was ich gehöre. Der Sebaro war einer der Ersten, ja, ich weiß ja, ob der Sebaro der Erste war. Sebaro, soll ich mal nachgucken, ob du der Erste warst? Da Frank, Twitch Prime, Dankeschön. Sebaro, ich guck mal, ob du der Erste warst. Subscriber History, der war der Erste. Der Sebaro war der Erste, tatsächlich. Allerdings nur ganz knapp, ähm, Sebaro war der Erste, danach kam direkt der Silent Pain. Und dann kam der Patrick, der war aber ein paar Minuten später. Twitch Prime Sellout, ja, hab ich schon, einmal die Stunde reicht, würd ich sagen. Okay, also, wie funktioniert der ganze Kram jetzt hier? MKDeer, Roborock, alles gut, jawoll, bla, blup. Clone das Cloud Repo, Until Image Builder, 0.1 is available. Okay, was auch immer, wir clonen das jetzt einfach. Ich sag euch was, Klimaanlage ist wirklich angenehm. Fällt mir jedes Mal auf, wenn's so warm ist, dann drückst du einfach auf den Knopf und 5 Minuten später ist es kühl. Ja, Zugucker, ich werd's überleben, ich werd's überleben. Okay, haben wir den Kram geklaut, Create Directory, äh, Push, das ist jetzt aber die Oldschool Variante, äh. Download Latest Binary From machen wir auch. Da, 0.4 Beta wollen wir runterladen. Guck mal, hier haben sie auch noch ein paar Bilder von den neuen Funktionen, äh, das ist der Zonen Editor, das ist hier auch Zonen Editor, noch mehr Zonen Editor, äh, Access Core, ach, endlich, sie haben jetzt die Möglichkeit, dass man sich authentifiziert am Webinterface, ja, das ist gut. Aktuell ist es nämlich so, jeder der auf den Staubsauger-Roboter drauf kommt, also jeder der in diesem WLAN drinne ist, kann das Ding steuern. Ich mein, bei mir ist es kein Ding, ich hab nen extra WLAN für die ganzen China-Geräte, aber für, ich sag mal, in Anführung kriege ich normale Leute, die vielleicht die Geräte auch bei sich ins WLAN hängen, äh, gibts die irgendeinem Kollege oder so, der hat ein WLAN-Passwort und der steuert dann an Staubsauger durch die Wohnung. Sie haben es jetzt, jetzt haben sie es wohl geschafft, dass du, ähm, dass du den Staubsauger auch, ähm, Basic, also Passport-Authentifizierung schützen kannst. Und dass man endlich als H-Keys direkt hochladen kann. Das ist sehr, sehr, sehr, sehr, wo ist es? Äh, und sonst gibt es eigentlich nix Neues. Okay, wir sollen die neueste Version runterladen. Das da. OP-Link, EGET. Bäm. Erstmal drei, zig Millionen Zeichen, Ull. Okay, runtergeladen, Instructions, Download. Deployment. Warum können wir nicht einfach nen CD machen? Warum muss man Push-D machen? Achso, wir machen Push-D, dass man nachdem nachher wieder nach oben gehen kann. Das ist aber, das hab ich schon ewenig mal gesehen, dass das jemand verwendet. Äh, und jetzt müssen wir die CONF-RAW runterladen. Okay, auch gut, machen wir. ETC. VGET, Hosts, zack. RC-Local, zack. Wir machen jetzt einfach POPPT. So. Create Firmware Directory. Wir machen jetzt einfach mal die Anleitung durch. Ich hab das ja schonmal gemacht vor ein paar Monaten. Das hat auch soweit funktioniert. Download Latest Firmware. VGET, Ull. Ah. Example. Okay, da oben stand auch was die für ne Firmware-Version empfehlen. 1782. Also, ja dann passt die Ull doch eigentlich. Dieser Moment, wenn der Staubzauger SSH hat. Ja, hat er. Hat er ja aktuell auch schon. Also ich kann mich aktuell, ich zeig das mal, weil ich hab den ja hier schon, ah nee, ich hab ihn grad ausgeschaltet. Meint VGET. VGET? Wo, wo sind da stehen geblieben? Ahm. Ja, VGET. VGET. Resolving. Connecting. Waiting. Boah. Resident Sleeper hier. Was hast du für ne Klimaanlage? Irgendeine von Mitsubishi Heavy. Den genauen Typ kann ich dir nicht sagen. Langsamer Urlaubichter kann sein, aber ich starte es nicht nochmal. Die eineinhalb Minuten können wir warten. Das ist nicht GitHub, das ist von Amazon, let darunter. Welches Linux ist das? Das ist Manjaro mit i3-WM als Desktop. Ah stimmt, die haben ja sogar ein Befehl dafür. Ich hoffe es smoke danach nicht. Manjaro install gestern gefällt. Mit was? Was die Manjaro install gefällt. But why? Ach, das hab ich im Discord gesehen, ja das hat mir auch nichts gesagt. Was hast du für den Installer genommen? Den minimalen Netinstall. Damit hatte ich eigentlich noch keine Probleme bisher. Ubuntu immer noch beste. Auf dem Server ja. Ich weiß, ich find's witzig, ne? Die halbe Welt verwendet Ubuntu auf dem Desktop. Ich find Ubuntu auf dem Desktop suckt. Auf dem Desktop verwende ich Manjaro. Die andere halbe Welt verwendet auf dem Server Red Hat oder irgendwelche Abkömmlinge davon. Debian. Das war's eigentlich zum größten Teil. Manche haben noch Susu oder sowas. Aber du hast eigentlich Debian und Red Hat zum größten Teil. Und da verwende ich Ubuntu Server. Ubuntu Server beste. Ok, Download fertig. Nice. Oh, ich hab's falsche runtergeladen. Hab ich jetzt falsche runtergeladen? Ne, ne, ne, ich hab's richtige. Passt. If you follow above commands, your Rock Robo Directory Structure would look like this. Gucken wir mal, wie meine Robo Rock Directory Structure aussieht. Bam. Debated. Aber das wird schon funktionieren. Was ist ernsthaft noch? Das ist gar nicht, dass das starrer mir nicht dabei ist. Finde den Fehler. Was, bei was? Achso, muss noch eins hoch. So, sieht es jetzt so aus wie in der Anleitung. Rock Robo Dust Cloud. Blablabla. Devices, Dummy, Dust Cloud, License, Pipfile, Logo Presentation, Blablabla. Ok, passt. Firmware. Ja. Fale Tuto. Das ist echt der Zungenbrecher der Name. Ich weiß nicht warum. Die hätten das anders nennen sollen. Ich finde, das ist voll der Zungenbrecher. Die hätten das Projekt irgendwie Roboown oder keine Ahnung. Robo Rock, Beshtor oder was weiß ich. Voller Zungenbrecher. Deployment. Deployment, ETC, Blablabla. Ja, sieht gut aus. Creating Firmware Image. MKD Image. In welchem Verzeichnis soll man das jetzt hier überhaupt anlegen? Gar nicht hier, oder? Weil die gehen ja hier eins nach oben. Also irgendwie, in dem Verzeichnis sein oder in dem Verzeichnis? Ne, in welchem Verzeichnis muss man dann sein? Ach ne, der wechselt dann da rein. Achso, ok, dann passt das schon. Ok, also jetzt bilden wir mal das Firmware Image. Scroll noch mal hoch. Was hier in der Anleitung? Moin, Homewell. Achso, und übrigens, der Chat besteht drauf, dass ich Ubuntu nicht Ubuntu ausspreche, sondern... Ne, fuck. Moment. Wie muss ich Ubuntu aussprechen? Ich hab's vergessen. Wie muss ich Ubuntu aussprechen? Ubuntu, genau. Ubuntu. Oh, hier ist ne Motte. Da krabbelt ne Motte rum. Ich muss mal kurz platt machen. Jetzt hätte ich natürlich so toll gekrabbelt, dass ich nicht drankomme. C'mon brah, wartet mal. Morten Bash. Morten Bash. Wo ist hin? Wo ist das Viech hin? Wo ist das Viech hin? Ich komm da nicht hin. Debated. Ich komm da nicht hin. Das ist total, total beschissen hinter dem Monitor, ey. Fuck. Hm, wartet mal. Snipesaw, genau, das ab. 360 Quicks, gobt. Jetzt springt das Ding hier total rum. Wo ist es hin? Wo ist es hin? Wo ist es hin? Da, da springt's. Das jumpt voll. Das jumpt voll übern Tisch. Debated. Okay, ich hab, ich hab keine Ahnung wo es hin ist. Ich hab's nicht erwischt. Muss ich nachher noch mal gucken wo es hin ist. Aber ich hab's teilweise, ich hab's so halb erwischt, weil wenn das, weil wenn das, wenn ich das nicht erwischt hab, dann wird's nicht rumspringen, sondern wegfliegen. Hab ich hier so eine halbplatte Motte rum, rum, hüpfen. Die Katze findet, nein, die, die, Chico ist nicht in der Lage das zu fangen, äh, die ist da viel zu Noobcat für. Wobei gibt's nicht einen Streamer der Noobcat heißt. Okay, also jetzt müssen wir das Firmware-Image generieren. Okay, machen wir das mal. Warum muss man das eigentlich als Route machen? Muss man bestimmt nicht als Route machen, weil er doch eben beknackt. Achso, ja gut, wir sind auf dem Raspberry, wir sind E-Route. Keine andere Variante. Replace ADB. Replace ADB. Excessive, das Ding hat einen USB-Anschluss? Das hab ich überhaupt nicht gesehen, dass man Staubsäge und USB-Anschluss hat. Ich wüsste gar nicht wo das sein soll. Okay, dann machen wir das mal. Kommt mal nochmal eine Maschine, steckt aus. Keine Ahnung, wo der USB-Anschluss sein soll. Okay, ja auch gut. Hier hagelt es gerade 5 cm, Herr Körner. Ah, feels bad man. Einfach nicht rausgehen. Easy. Guck doch einfach bei deinem Gerät, ich weiß ja nicht wo ich gucken soll. Ich hab das Ding schon in der Hand gehabt, ich hab so ziemlich alles offen gehabt an dem Ding, ich hab keinen USB-Anschluss gesehen. Okay, wir machen das jetzt mal kurz anders. Warte mal, ich soll mal ein ordentliches Kommando draus bauen. So, weg. Firmware, jawoll. Public Key brauchen wir nicht. Path ist okay. Ja, Software Upgrades Disable auf jeden Fall. NTP Server 60.1, der kommt ja in mein China WLAN rein. Replace ADB. Okay, fertig. War das jetzt kopiert? Ja. Oh. Ah, ich hab die Voraussetzung nicht installiert. Ich kack noob. Abinstall. Okay, was brauchen wir? Was brauchen wir alles? Bash ist auf jeden Fall drauf. Open SSH. SSH Keygen wird wahrscheinlich auch drauf sein. Abinstall. DOS to UNIX, DOS to UNIX und CC. RIPPED. Okay, jetzt aber. Okay, dann soll man für no public key selected. Ich will ja auch keine Keys. Ich will auch überhaupt keine Keys. Hä? Wie, muss ich den Key auswählen oder was? Ich will keinen Key generieren. Ich will den Key hochladen übers Webinterface danach. Hab ich schon SSH generiert. SSH Key generiert. Mal gucken. Nee. Gott, generieren wir einen. Boot SSH, ja. Ne, Moment, wir brauchen ein Special Keygen. Wir generieren jetzt genau wie die das hier vorgeben. YourMail.example.com, perfekt. So wollte ich schon immer, dass das heißt. Okay, gut, dann. Dann noch mal. Punkt SSH. Papp. Passt das jetzt? Ich hab's auskommentiert. Hm? Bist doch. Wartet mal. Firmware. Ah, haha. Falsche Versionsnummer. So, der Rest sollte jetzt aber stimmen. So, ha. Ah, jetzt geht's los. Dann erstellt man immer mein Firmware Image. Gleich, gleich geht's MonkaS Smoke. Wir schauen mal wie der Raspberry ausgelastet ist. Oh na ja, ein CPU-Kern 100%. Das ist ja in Ordnung. Wird gezippt. Sorry, gezippt wird er, gezippt. Wir müssen ja neuerdings alles geil englisch betont aussprechen. Wir haben auch keine API mehr, wir haben nur APIs. Unter Ubuntu. Wahrscheinlich ist danach die SD, die, die Micro SD Karte von Raspberry direkt im Arsch. Mein Glocks HD. Ajeja. Oh Gott, Java. Ja, das wird immer wieder in Ordnung. Das wird ja immer schlimmer. Und auch Router, ja. Oh, er ist fertig. War das echt so einfach? Da kann ich mich gar nicht mehr dran erinnern. Ich dachte das letzte Mal hat es länger gedauert und hat noch mehr Schritte gebraucht. Aber vielleicht haben sie es ja, vielleicht haben sie es ja einfach verbessert. Okay, jetzt haben wir den Firmware Image generiert. Flashing, Flashing Firmware Image. After successful build on Firmware Image using VM. Nein, wir usen keine VM, wir usen, wir usen den Raspberry. Okay, ist schon installiert. PIP und VN machen ich. Oh. 50 Bits, Dankeschön. Kio-kun. Huge, huge Bits. So langsam aber sicher bräuchte ich einen dritten Monitor. Weil ich hab jetzt hier halt für das was ihr seht, da hab ich links neben dran den Monitor, da hab ich hier mein Image, mein Imagezeugs und mein Soundzeugs, dann hab ich Stream Vorschau und Chat und jetzt bräuchte ich eigentlich nochmal ne Anzeige für Follows, Subs und Bits und Donations und Gedöns. Weil ich werd garantiert wieder die Hälfte übersehen, wie ich das auch bei Follows immer gemacht hab. Wie viel RAM hast du eigentlich insgesamt? Doch der Rechner hat, äh, 316 Gigabyte. Also ist jetzt nicht, ist jetzt nicht so übermäßig viel. Ich, ich wollt mir ja noch nen, noch nen zweites Pack 16G kaufen, jetzt wo RAM grad ein bisschen billiger ist. Ok, weiter gehts. CD Punkt Punkt. Ne, nicht CD Punkt Punkt. MKDier-Flasher. Das kann fast ein CSGO Pro sein. Ähm, jawoll. Oh, ist VN anlegen. Jetzt müssen wir wahrscheinlich Activate machen, genau. ONF Activate. Install. Das ist jetzt ein Python Gedöns, das kann man einfach durchklicken. Äh, wie viel Euro sind denn 50 Bits? Äh, ich hab gestern hat irgendjemand gesagt im Stream, ein Bit ist ein Cent. Weiß ich ob das stimmt. Jedenfalls hast du hier alles. Huge Money hier. Massive. Next. Gamer3290, ich kann dir nicht ganz folgen. 500 Bits. Krasser Shit. Von Pruppi. Ist da, Pruppi, was ist denn das für ein Icon da neben dir? Direct Relief Charity. Oh, man kriegt jetzt, man kann sogar, man kann sogar Icons kriegen für, wahrscheinlich weil das irgendein Speedrun Marathon, oder? Interessant, wusste ich gar nicht, dass das geht. Okay, jetzt sind wir. Connect your robots. Cover Handshake. Na das geht jetzt, Moment, das funktioniert jetzt also nicht. Das funktioniert ja so nicht. Ich muss jetzt ja erstmal mein Raspberry zu dem gleichen WLAN connecten, wie mache ich, Moment, wie mache ich das jetzt am besten? Mein Robo ist ja schon angemeldet am WLAN. Das heißt ich melde jetzt einfach den Raspberry am gleichen WLAN an wie der Robo und dann gucken wir mal. Probieren wir mal aus. Ja, machen wir mal. Dann müssen wir erstmal WLAN, WLAN verbinden. Achso, aber nee Leute, jetzt muss ich euch ja wieder ausschalten. Jetzt muss ich euch ja wieder ausschalten, dass ihr mein WLAN Zeug nicht seht. Feels Batman. Ich switche euch einfach auf die andere Sache, auf die andere Seite rüber. Da habt ihr wenigstens, habt ihr wenigstens Chat und seid nicht so allein. Q Chat, ah ja, ja. Okay, Network Options, Wi-Fi, Wi-Fi, Wi-Fi. Germany. Also es dauert jetzt eine Minute, dann bin ich immer wieder am Start. Please enter SSID, please enter Password. Da muss ich jetzt mal nachgucken, weil ich muss jetzt erstmal auf meinen UniFi Controller. Oh, das wird jetzt ein bisschen kompliziert. Ich muss jetzt erstmal auf meinen UniFi Controller und die, die Client Isolation ausschalten, Isolation ausschalten. Sorry Leute, das braucht noch mal jetzt ein bisschen mehr, weil so viel, so viel liegt. Password not valid. Warum? Admin. Okay. Okay, Password. Sehr schön. Settings, Networks. Okay, WLAN Passwort brauchen wir jetzt noch. Finish. Okay, jetzt soll er sich zum WLAN connecten. Wenn er sich zum WLAN connectet, kann ich euch wieder einschalten. Er hat sich zum WLAN connectet. Poggers. Okay, ich schalte euch wieder ein. Das ist ja hier kompliziert. Okay, also ich bin jetzt beim WLAN verbunden mit dem gleichen WLAN wie der, wie der Roboter, wie der, wie der Staubsaugerroboter. Ich gucke mal, ob es funktioniert. Gegen das Me. Be Discover. Es kann aber sein, dass es nicht funktioniert, weil ich noch die Client Isolation ausschalten muss. Achso, VNF Activate. Naja, geht nicht. Okay, Client Isolation ausschalten. Wo ging das jetzt noch mal? Ich habe jetzt abgekriegt gerade, oder? Steff Christ hier eins. Dankeschön. Ah, hier. Guest Policies ausschalten. Save. So, und jetzt konfiguriert er mein WLAN neu. Und dann sollte es gleich funktionieren. Okay, wir müssen noch zwei Minuten warten, dass das WLAN neu konfiguriert, dann ist gut. Naja, guck, der hat jetzt gerade keine WLAN Verbindung. Wir warten jetzt bis der wieder WLAN Verbindung hat und dann probieren wir das Ganze noch mal aus. Und mir ist gerade ein Problem, weil ich habe hier den Roboter auch gar nicht angeschaltet. Das hier Big Brain Move. Versuchen das Ding zu flashen, wenn er gar nicht angeschaltet ist. Hexor. Elite Hacker Man. Twitch Prime. Naisu. Okay, ich schalte den Roboter schon mal ein. Kann nicht schaden, wenn wir den schon mal einschalten. Oh, fuck. Wo ist das? Alter, ich habe mein Audiointerface halt runtergeschmissen. Okay. Test, Test. Ja, das ist blöd, wenn man mit dem Stuhl und dem Headset auf durch den halben Raum fährt. Mick ist nicht gemutet, jebaited mich nicht. Mick ist nicht jebaited. Ich bin gerade mit dem Headset auf durch den halben Raum gefahren zum Staubsauger Roboter und habe das Zeug halt runtergeschmissen. Okay, Leute, der jebaited ist wirklich schlecht. Ich weiß, dass ihr mich hört. Okay, Staubsauger Roboter ist an. Raspberry hat auch wieder eine, hat auch wieder eine IP. So, und jetzt sehen wir mal, ob das funktioniert. Komm, komm an. Service Discovery Done. Und jetzt? Jetzt hätte es eigentlich funktionieren müssen. Warum geht das jetzt nicht? Warum geht das jetzt nicht? Ich habe doch keinen Token, ich habe keine Ahnung, wie man Token ist. Kann ich, ich versuche mal mit dem Ding direkt zu kommunizieren mit dem Roboter. Vielleicht ist er noch gar nicht an. Ich gucke mal meine DHCP-Lieses, ob der Roboter überhaupt an ist. Robo, Roborock, da ist er. 60, was hat er für eine IP? 60107. 60107. Ah, ich weiß, woran das liegt, Leute. Ich habe, ich habe eine Idee, woran das liegt. Ähm, wisst ihr, woran das liegen könnte? Ich habe mein Netzwerkkabel dran, ich habe mein Netzwerkkabel dran und ich habe WLAN-Verbindung aufgebaut. Also, das könnte sein, dass das Ding versucht, quasi bei mir im Netzwerk raus zu kommunizieren, anstatt, anstatt über WLAN. Dann, dann stöpsel ich WLAN-Netz ab, dann muss ich mich, nee, ich stöpsel, ich stöpsel, Alter, ich stöpsel WLAN ab. Also, easy, Leute, lass mal WLAN abstöpseln. Ähm, wir verbinden uns jetzt per SSH auf den Raspberry. Also, aus irgendwelchen Gründen nicht funktioniert. Doch. Und dann ziehe ich das Kabel raus. Ach, Quatsch. So, wir machen mal einen T-Max auf, wer weiß, dass das Ding nicht abkackt. Ähm, Roborock. Okay, ich ziehe, ich ziehe den Raspberry raus. Okay. Ähm, Raspberry ist draußen, keine IP mehr, alles gut. Ähm, Flasher, Activate, Achtung, C'mon, Bra. Ja! Bam! Funktioniert. Erst mal übelst ausflippen, er. Erst mal übelst ausflippen, er. Token. Token, äh. Token, äh. Token, äh. Token, äh. Token, äh. Token, ähm. Das Token sieht nicht korrekt aus. Moin, PSQL. Nee, nicht PS, doch PSQL. Ja, Ich meine, wir probieren es einfach mal aus. Ich habe irgendwie meine Entfernentaste abgemacht. IP ist 60107 und das Token ist updatefirmware, Updatefirmware, Image, Output, Polo S, PK, ob das jetzt funktioniert? On-Cast Smoke, macht der jetzt was? Hast du den Schaubsauger gesettet? Ne, ich habe eine Idee, man kann sich bestimmt im aktuellen Webinterface das Token anzeigen lassen. 60107, Settings, Token, ah, huge, ich glaube mit dem Token kann man nicht allzu viel anfangen. Updatefirmware, ist das das offizielle Token, das ist das Token von meinem Schaubsauger, offizieller gehts nicht mehr. Okay, die machen das von einem Verzeichnis oben drüber, machen wir jetzt auch einfach mal. Okay Leute, bless RNG, Moment, das haben wir gar nicht, bless RNG, das muss ich noch hinzufügen, das muss ich hier nicht, bless RNG, den brauchen wir noch, Color transparent, okay, okay, okay, er spricht, er spricht, er hat mit mir gesprochen, der Schaubsauger, no request was made, okay, okay, noch mal, oh Leute, habt ihr es gehört, habt ihr es gehört, ich versuche euch das mal so, dass man es hören kann, wartet mal kurz, ich stöpsel mich mal kurz ab und entwirre mein Mikro, da fällt auch mein Audiointerface nicht mehr runter, so, jetzt Achtung, passt mal auf was er sagt, ich glaube wir haben nämlich schon ein Problem, ich halte euch jetzt mal ran, sodass ihr das hört, habts ihr es gehört, der Akkustand ist zu niedrig, hört man das echt nicht, der hat gerade gesagt, der Akkustand ist zu niedrig, so, jetzt habe ich euch dran gehalten, Akkustand ist zu niedrig, das sagt natürlich, Staubsauger waifu, ja, was machen wir jetzt, ich würde sagen, ich hole mal die Ladestation von unten und setze ihn auf die Ladestation, vielleicht darf man nämlich updaten, wenn er lädt, okay, ich Ich bin jetzt 2 Minuten wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bin wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da. Ich bleibe wieder da.", "segments": [{"id": 1, "start": 60.0, "end": 78.0, "text": "Congratulations!"}, {"id": 2, "start": 78.0, "end": 84.76, "text": "10"}, {"id": 3, "start": 84.76, "end": 91.32, "text": "B"}, {"id": 4, "start": 181.32, "end": 189.96, "text": "Ja Leute, ich bin eigentlich ja schon längst am Start."}, {"id": 5, "start": 189.96, "end": 202.64, "text": "Ich wollte nämlich gerade mal gucken, was für Emotes besonders beliebt sind hier auf"}, {"id": 6, "start": 202.64, "end": 227.64, "text": "FrankerFacesZ"}, {"id": 7, "start": 227.64, "end": 236.84, "text": "Die Musik kann sich auch nicht entscheiden ob lauter oder leiser, ne?"}, {"id": 8, "start": 236.84, "end": 237.84, "text": "Haben wir schon alles?"}, {"id": 9, "start": 237.84, "end": 260.28, "text": "Wir haben jetzt übrigens als Emote auch noch LULW, haben wir noch."}, {"id": 10, "start": 260.28, "end": 283.24, "text": "Und Kratos ist irgendwie nix dabei, was ich unbedingt bräuchte."}, {"id": 11, "start": 283.24, "end": 292.24, "text": "Brauchen wir den da?"}, {"id": 12, "start": 292.24, "end": 299.16, "text": "Moment, das andere war auch ganz cool."}, {"id": 13, "start": 299.16, "end": 301.24, "text": "Wartet mal, wo war es denn jetzt hier eben?"}, {"id": 14, "start": 301.24, "end": 307.52, "text": "Das ist auch so ne Kacke an Endless Scroll, dass es immer wieder an der gleichen Stelle"}, {"id": 15, "start": 307.52, "end": 308.52, "text": "anfängt."}, {"id": 16, "start": 308.52, "end": 319.28, "text": "MonkaSpeed, ich find den auch nicht schlecht."}, {"id": 17, "start": 319.28, "end": 320.28, "text": "Brauchen wir den noch?"}, {"id": 18, "start": 320.28, "end": 322.36, "text": "Okay, da muss ich den gleich noch mal im Channel hinzufügen."}, {"id": 19, "start": 322.36, "end": 336.96, "text": "Aber erstmal hier muss ich fürs Minibot hinzufügen, White, Peepo, also immer."}, {"id": 20, "start": 336.96, "end": 361.76, "text": "Das sieht schon ziemlich kacke aus, wenn man das so groß zieht, oder?"}, {"id": 21, "start": 361.76, "end": 363.28, "text": "Wie viele Emotes gibt es denn bei FFZ?"}, {"id": 22, "start": 363.28, "end": 376.6, "text": "Ich glaub 25 und mit Abo 40, irgendwie sowas."}, {"id": 23, "start": 376.6, "end": 379.12, "text": "Log in to add Emotes, ich bin auch schon logged in."}, {"id": 24, "start": 379.12, "end": 383.32, "text": "Heals Wired, man."}, {"id": 25, "start": 383.32, "end": 385.92, "text": "Ja, Wired Champ."}, {"id": 26, "start": 385.92, "end": 392.4, "text": "Ach jetzt, jetzt sagt, jetzt hat er auf einmal gecheckt, dass ich log in bin."}, {"id": 27, "start": 392.4, "end": 393.4, "text": "OMEGALUL."}, {"id": 28, "start": 393.4, "end": 394.4, "text": "OMEGALUL."}, {"id": 29, "start": 394.4, "end": 401.92, "text": "So, jetzt haben wir auch noch White Peepo Happy im Channel zur Verfügung, da hat er"}, {"id": 30, "start": 401.92, "end": 402.92, "text": "die Welt drauf gewartet."}, {"id": 31, "start": 402.92, "end": 408.8, "text": "Den Rest machen wir dann nachher."}, {"id": 32, "start": 408.8, "end": 414.08, "text": "So Leute, also was wir heute vorhaben, es wird ein bisschen abenteuerlich, ich hab das ja"}, {"id": 33, "start": 414.08, "end": 418.44, "text": "schon mal gemacht, aber ich hab gesehen, es gibt ne neue Version von meiner Staubsauger"}, {"id": 34, "start": 418.44, "end": 423.56, "text": "Firmware, das heißt, und die haben richtig viele gute Änderungen drinne."}, {"id": 35, "start": 423.56, "end": 429.04, "text": "Zum Beispiel, wir können uns mal das Change Log ansehen."}, {"id": 36, "start": 429.04, "end": 431.52, "text": "Ja, das braucht ein paar Minuten, das braucht nur 5 Minuten."}, {"id": 37, "start": 431.52, "end": 458.32, "text": "Äh, ich muss mal kurz mal die Vorschau hier richtig aufmachen, Recent Events, was hat"}, {"id": 38, "start": 458.32, "end": 459.32, "text": "mich eigentlich gerissen?"}, {"id": 39, "start": 459.32, "end": 469.72, "text": "Warum hab ich eigentlich Tippy Stream genommen, für Donations und Streamlabs für alles andere,"}, {"id": 40, "start": 469.72, "end": 470.84, "text": "kann mir das irgendjemand erklären?"}, {"id": 41, "start": 470.84, "end": 490.52, "text": "Wie nächstes, danke für den Sub."}, {"id": 42, "start": 490.52, "end": 513.88, "text": "Der Matt K. ist auch am Start, Twitch Prime, nice."}, {"id": 43, "start": 513.88, "end": 520.88, "text": "Also, jetzt können wir uns mal kurz angucken, was es für neue Features gibt, was wir jetzt"}, {"id": 44, "start": 520.88, "end": 521.88, "text": "neu eingebaut haben."}, {"id": 45, "start": 521.88, "end": 522.88, "text": "Und da sind schon ein paar ganz praktische Geschichten dabei."}, {"id": 46, "start": 522.88, "end": 530.88, "text": "Zum Beispiel kann man jetzt einstellen, dass, wo stand es denn jetzt hier, Go, genau, man"}, {"id": 47, "start": 530.88, "end": 535.0, "text": "kann jetzt einstellen, dass man Virtual Walls aufstellen kann für den Staubsauger."}, {"id": 48, "start": 535.0, "end": 540.28, "text": "Ach, Sie Baro sind es tatsächlich, sind es 50, ja."}, {"id": 49, "start": 540.28, "end": 544.24, "text": "Meine Vorschau geht nicht richtig, deswegen sehe ich das mit den Subs irgendwie nur so"}, {"id": 50, "start": 544.24, "end": 545.24, "text": "halb."}, {"id": 51, "start": 545.24, "end": 546.24, "text": "Ganz merkwürdig."}, {"id": 52, "start": 546.24, "end": 550.44, "text": "Meine Vorschau hat gerade ungefähr 0,3 FPS, das aktualisiert sich so alle 2 Sekunden"}, {"id": 53, "start": 550.44, "end": 551.44, "text": "mal."}, {"id": 54, "start": 551.44, "end": 557.8, "text": "Wire, Wirechamp, geht es jetzt vielleicht besser?"}, {"id": 55, "start": 557.8, "end": 566.6, "text": "Keine Ahnung, was mit meiner Vorschau abgeht und es wieder rumspackt."}, {"id": 56, "start": 566.6, "end": 573.48, "text": "Ist auch egal, man kann jetzt zum Beispiel Virtual Walls hinstellen, wo der Staubsauger"}, {"id": 57, "start": 573.48, "end": 574.88, "text": "Roboter dann nicht hinfährt."}, {"id": 58, "start": 574.88, "end": 580.2, "text": "Das ist sehr nice, zum Beispiel, bei mir sieht es ja so aus, im ersten Stock, da habe ich"}, {"id": 59, "start": 580.2, "end": 588.48, "text": "ja hier quasi Pain Skills, aber hier ist der Flur, der Flur ist ungefähr so, hier ist"}, {"id": 60, "start": 588.48, "end": 594.72, "text": "mein Arbeitszimmer, hier ist das Wohnzimmer, hier ist das Schlafzimmer und so weiter."}, {"id": 61, "start": 594.72, "end": 606.36, "text": "Und hier die Treppe vom Erdgeschoss rauf und der Staubsauger hat zwar, der Staubsauger,"}, {"id": 62, "start": 606.36, "end": 612.4, "text": "achso hier hinten ist auch noch ein Zimmer, da ist auch noch ein Zimmer, so ungefähr"}, {"id": 63, "start": 612.4, "end": 613.4, "text": "sieht das aus."}, {"id": 64, "start": 613.4, "end": 616.48, "text": "Und das Schlafzimmer ist sogar ein bisschen länger."}, {"id": 65, "start": 616.48, "end": 619.04, "text": "Ja, so ungefähr sieht das Ganze aus."}, {"id": 66, "start": 619.04, "end": 623.92, "text": "Und der kann ganz gut hier hin und her fahren, der hat aber auch einen Sensor, dass er die"}, {"id": 67, "start": 623.92, "end": 625.32, "text": "Treppe nicht runterfällt."}, {"id": 68, "start": 625.32, "end": 631.48, "text": "Allerdings, was man jetzt machen kann, man kann jetzt hier einstellen, so ein No-Go Area,"}, {"id": 69, "start": 631.48, "end": 634.12, "text": "dass er gar nicht versucht hier hinten zu fahren, weil hier kommt er eh nicht richtig"}, {"id": 70, "start": 634.12, "end": 639.68, "text": "hin, da spackt er manchmal ein bisschen rum und der versucht dann immer wieder die Treppe"}, {"id": 71, "start": 639.68, "end": 642.68, "text": "anzufahren, weil er irgendwie nicht checkt, dass es dann nicht weitergeht."}, {"id": 72, "start": 642.68, "end": 646.08, "text": "Der fährt dann hier lang, ich fall runter, zurück, ich fall runter, zurück, ich fall"}, {"id": 73, "start": 646.08, "end": 649.8, "text": "runter, zurück, ich fall runter, zurück und dann hier ist neben so ein Geländer, da kommt"}, {"id": 74, "start": 649.8, "end": 653.36, "text": "er aber unten drunter durch, der versucht das auch jedes Mal so, ich fall runter, zurück,"}, {"id": 75, "start": 653.36, "end": 654.36, "text": "ich fall runter, zurück."}, {"id": 76, "start": 654.36, "end": 655.36, "text": "Total sinnlos."}, {"id": 77, "start": 655.36, "end": 661.44, "text": "Dem kann man jetzt einfach auf der Map markieren No-Go Area und dann sollte er das nicht mehr"}, {"id": 78, "start": 661.44, "end": 662.44, "text": "machen."}, {"id": 79, "start": 662.44, "end": 664.08, "text": "Das probieren wir gleich mal aus, ob das Ganze funktioniert."}, {"id": 80, "start": 664.08, "end": 674.0, "text": "Man kann jetzt über MQTT, also hier, über MQTT kann man jetzt Nachrichten verschicken,"}, {"id": 81, "start": 674.0, "end": 677.32, "text": "dass der Staubsauger irgendwie losfährt zu irgendeiner Zone oder sowas, brauche ich"}, {"id": 82, "start": 677.32, "end": 678.32, "text": "jetzt nicht."}, {"id": 83, "start": 678.32, "end": 684.4, "text": "Der Editor ist neu, das finde ich ganz gut, man kann jetzt nämlich auf der Map, der Staubsauger"}, {"id": 84, "start": 684.4, "end": 688.52, "text": "legt ja eine Karte von einer Wohnung an, auf der Map kann man jetzt direkt per track and"}, {"id": 85, "start": 688.52, "end": 693.4, "text": "drop die Zonen definieren, wo er hinfahren soll."}, {"id": 86, "start": 693.4, "end": 697.36, "text": "Da zieht man beispielsweise in ein Viereck, zumindest man zieht es ja hier glaube ich"}, {"id": 87, "start": 697.36, "end": 700.36, "text": "im Pull-Request, nee."}, {"id": 88, "start": 700.36, "end": 704.16, "text": "Pull-Request, ach guck mal, die haben jetzt sogar Bildchen dabei."}, {"id": 89, "start": 704.16, "end": 709.68, "text": "Genau, man kann jetzt hier so einstellen, hier, da, da sollst du es auch mal machen"}, {"id": 90, "start": 709.68, "end": 713.68, "text": "und man kann das Ding dann benennen, zum Beispiel, keine Ahnung, Wohnzimmer und das kann man"}, {"id": 91, "start": 713.68, "end": 716.16, "text": "halt direkt auf der Karte editieren, das ist eigentlich ganz praktisch."}, {"id": 92, "start": 716.16, "end": 721.0, "text": "Mach mal Ausrufezeichen 1, dann wird das erklärt."}, {"id": 93, "start": 721.0, "end": 727.32, "text": "1 ausgeschrieben, das kriegen wir, das ist der Noob-Filter."}, {"id": 94, "start": 727.32, "end": 743.76, "text": "So und als nächstes gibt es noch, wir brauchen übrigens noch einen E-Mode habe ich gesehen,"}, {"id": 95, "start": 743.76, "end": 751.32, "text": "wir brauchen noch Dings hier, das halbe Kappa Ding, das brauchen wir noch, Kap, Kap brauchen"}, {"id": 96, "start": 751.32, "end": 752.32, "text": "wir noch."}, {"id": 97, "start": 752.32, "end": 763.28, "text": "Ach, ist schon, ist schon, lass mal gucken, ob das funktioniert, funktioniert, Kap, Kap,"}, {"id": 98, "start": 763.28, "end": 769.44, "text": "ja funktioniert, ach sehr schön, ja und wenn das stimmt, was der Sebaro sagt, das muss"}, {"id": 99, "start": 769.44, "end": 772.88, "text": "ich mir nachher nochmal angucken, aber wir gehen mal davon aus, weil der Sebaro erzählt"}, {"id": 100, "start": 772.88, "end": 781.0, "text": "ja eigentlich, außer dass der nachts sehr merkwürdige Bilder im Discord postet, kann"}, {"id": 101, "start": 781.0, "end": 784.12, "text": "man sich ja eine Regel darauf verlassen, was er sagt, deswegen werde ich nachher mal 5"}, {"id": 102, "start": 784.12, "end": 790.48, "text": "Euro an das Projekt donaten und dann kriegen wir 50 E-Modes und dann brauchen wir natürlich"}, {"id": 103, "start": 790.48, "end": 794.36, "text": "noch die üblichen Twitch Sub, übrigens, ich brauche für Twitch, brauche ich noch"}, {"id": 104, "start": 794.36, "end": 799.72, "text": "einen ordentlichen Prefix für meine E-Modes, das war mir vorher gar nicht klar, man darf"}, {"id": 105, "start": 799.72, "end": 801.32, "text": "sich selbst auswählen."}, {"id": 106, "start": 801.32, "end": 805.56, "text": "Sektor cleared, Prime Sub, sehr nice, übrigens bei der Gelegenheit, falls ihr einen Prime"}, {"id": 107, "start": 805.56, "end": 809.68, "text": "Account habt, jetzt erstmal eine Runde Sellout starten, falls ihr einen Prime Account habt"}, {"id": 108, "start": 809.68, "end": 815.24, "text": "bei Amazon, man kann ihn mit Twitch verbinden, man bekommt dann jede Menge Lootboxen und"}, {"id": 109, "start": 815.24, "end": 821.4, "text": "nein, Prime Loot heißt das Ganze, allerdings kann man auch einen Streamer einmal im Monat"}, {"id": 110, "start": 821.4, "end": 824.2, "text": "mit einem Tier 1 Sub kostenlos unterstützen."}, {"id": 111, "start": 824.2, "end": 836.4, "text": "Kommt so bald frei, wie gesagt, muss ja keiner, ich erwähne es bloß mal nebenbei, weil bisschen"}, {"id": 112, "start": 836.4, "end": 847.36, "text": "Sellout, easy Sellout, easy Live, easy, so, ähm, ach Moment, ich muss ja mein PP-Gabort"}, {"id": 113, "start": 847.36, "end": 855.84, "text": "ist ja noch gar nicht gestartet, jetzt kriege ich ja gar keine Fragen im Chat mit, Moment,"}, {"id": 114, "start": 855.84, "end": 863.36, "text": "erstmal starten, Lootboxen, ja wie sagt denn Twitch dazu, es ist Prime Loot oder sowas"}, {"id": 115, "start": 863.36, "end": 875.4, "text": "oder Twitch Prime Loot oder, nein Prime Loot heißt es, ok, dämlich und bescheuert, damit"}, {"id": 116, "start": 875.4, "end": 881.16, "text": "komme ich als Erklärung daher, das ist halt so, ne, was willst du sagen, das ist halt"}, {"id": 117, "start": 881.16, "end": 887.16, "text": "so, ich hab mir das mal irgendwann so angewöhnt, immer Zeug zu kopieren und wenn man sich mal"}, {"id": 118, "start": 887.16, "end": 890.88, "text": "an sowas gewöhnt hat, dann ist es auch schwierig, sich das wieder abzugewöhnen, außerdem wozu,"}, {"id": 119, "start": 890.88, "end": 900.08, "text": "ja, der Eufy ist super, ah sehr schön, ah das hat er gestern gepostet, es meint es ist"}, {"id": 120, "start": 900.08, "end": 915.08, "text": "von gestern, direkt als Autostart doch, könnte man machen, genau, was gibt es sonst noch"}, {"id": 121, "start": 915.08, "end": 920.36, "text": "neues in der Firma, also ich hab aktuell Version 3, 3 plus ein paar Patches und jetzt"}, {"id": 122, "start": 920.36, "end": 932.28, "text": "installieren wir Version 4, das geht übrigens nur für Generation 2, aber ich hab hier ein"}, {"id": 123, "start": 932.28, "end": 941.04, "text": "Generation 2 Staubsauger, das ist ganz praktisch, man kann jetzt SSH Keys direkt über das Webinterface"}, {"id": 124, "start": 941.04, "end": 956.96, "text": "hochladen, das war immer ein bisschen gefurdelnd, wenn man die SSH Keys verkehrt hat, und man"}, {"id": 125, "start": 956.96, "end": 961.08, "text": "kann irgendwie über das Webinterface Versionsupdates machen oder sowas, das wäre auf jeden Fall"}, {"id": 126, "start": 961.08, "end": 971.2, "text": "nicht verkehrt, weil das Flaschen über den Raspberry ist immer nervig, was für ein Staubsauger"}, {"id": 127, "start": 971.2, "end": 982.48, "text": "habe ich, ich stehe noch im Titel, einen, den da, den da, also ich hab 2 aktuell, ich"}, {"id": 128, "start": 982.48, "end": 990.52, "text": "hab ein Eufy 11 und ich hab einen Roborock S50, der hier ist natürlich klar der bessere,"}, {"id": 129, "start": 990.52, "end": 996.28, "text": "der kostet aber auch 2-3 mal je nach Angebot so viel, Roborock, Alter Chat, Twitch Chat"}, {"id": 130, "start": 996.28, "end": 1018.28, "text": "wieder es, wieder, Wirechamp, und der Eufy ist ganz praktisch, also der da, der Eufy,"}, {"id": 131, "start": 1018.28, "end": 1022.44, "text": "der Eufy ist ganz praktisch, der ist nämlich sehr flach, der passt auch unter alle Schränke"}, {"id": 132, "start": 1022.44, "end": 1027.2, "text": "und so drunter, ich machs jetzt immer so, der macht eigentlich alles inklusive Flur"}, {"id": 133, "start": 1027.2, "end": 1034.44, "text": "und der kriegt auch richtig gut Katzenstreu und sowas alles weg im Flur, und der ist halt"}, {"id": 134, "start": 1034.44, "end": 1038.48, "text": "auch schnell, weil er die Räume abscannt, und den Eufy setze ich dann ab und zu nur"}, {"id": 135, "start": 1038.48, "end": 1042.76, "text": "noch mal ins Schlafzimmer und überall da wo Schränke und was ist wo der andere nicht"}, {"id": 136, "start": 1042.76, "end": 1047.16, "text": "richtig drunter kommt, da darf der Eufy dann noch ein bisschen im Kreis fahren, im Zickzack,"}, {"id": 137, "start": 1047.16, "end": 1052.6, "text": "weil der Eufy ist ziemlich dumm, der fährt immer gegen die Wand, nächste Ecke, nächste"}, {"id": 138, "start": 1052.6, "end": 1062.88, "text": "Ecke und so weiter, und der ist halt schlauer, der scannt den Raum ab per Laser, so, was"}, {"id": 139, "start": 1062.88, "end": 1065.84, "text": "das Katzenstreu soll auch in eine Kiste und nicht einfach in Flur, die Katze die hält"}, {"id": 140, "start": 1065.84, "end": 1069.12, "text": "sich da aber nicht dran, die sitzt dann da drauf und macht dann erstmal ihren Haufen"}, {"id": 141, "start": 1069.12, "end": 1072.72, "text": "rein und dann wird gescharrt und dann fliegt halt das Katzenstreu mit raus, da kannst du"}, {"id": 142, "start": 1072.72, "end": 1100.72, "text": "nichts dagegen machen, da, die da, Eufy kostet 179 auf Amazon, hast du nicht 2 Katzen?"}, {"id": 143, "start": 1100.72, "end": 1109.04, "text": "Ne, hab ich nicht, so und was gibt es sonst noch so für schöne Changes, kommt der Roborock"}, {"id": 144, "start": 1109.04, "end": 1113.44, "text": "S50 auch mit Räumen klar wo ein Teppichübergang ist, ja, der kommt damit ziemlich gut klar,"}, {"id": 145, "start": 1113.44, "end": 1119.28, "text": "der hat sogar einen extra Teppichmodus wo er hoch dreht, also man kann das so einstellen"}, {"id": 146, "start": 1119.28, "end": 1123.56, "text": "dass der erkennt, man kann das auch einstellen wie empfindlich das ist, dass der erkennt"}, {"id": 147, "start": 1123.56, "end": 1127.64, "text": "wenn er jetzt auf ein bisschen dichtere Teppiche drauf fährt, dann fährt er halt auf den Teppich"}, {"id": 148, "start": 1127.64, "end": 1134.96, "text": "drauf und du merkst sobald er auf dem Teppich ist fängt er halt an und saugt sich einen"}, {"id": 149, "start": 1134.96, "end": 1143.08, "text": "ab, Memory Leak was fixed, siehst du mal so weit sind wir schon, 2019 kann sogar der"}, {"id": 150, "start": 1143.08, "end": 1148.48, "text": "Staubsauger an Memory leaken und wieso routest du den Robo in der dass ich die Kastleinfirma"}, {"id": 151, "start": 1148.48, "end": 1155.96, "text": "drauf machen kann, weil die originale Firmware geht nur mit offizieller App und es ist ja"}, {"id": 152, "start": 1155.96, "end": 1160.44, "text": "nicht nur dass du nur die offizielle App brauchst, du brauchst die offizielle App und die Verbindung"}, {"id": 153, "start": 1160.44, "end": 1165.44, "text": "geht immer über die Cloud in China und ich hab kein Bock dass mein Staubsauger eine Cloud"}, {"id": 154, "start": 1165.44, "end": 1178.04, "text": "Verbindung nach China braucht, besser looking default map ist auch ok, probieren wir einfach"}, {"id": 155, "start": 1178.04, "end": 1192.36, "text": "mal aus, ja so sieht es aus, aber ich kann das Ding empfehlen und es gibt das ab und zu"}, {"id": 156, "start": 1192.36, "end": 1196.64, "text": "mal relativ günstig, das ist ja nicht mal das aktuellste Modell von denen, es gibt jetzt"}, {"id": 157, "start": 1196.64, "end": 1201.76, "text": "schon einen S6, der S6 hat das Problem dass es glaube ich noch keine Kastleinfirma gibt"}, {"id": 158, "start": 1201.76, "end": 1208.32, "text": "wobei müssen wir mal schauen, ob es für den S6 mittlerweile schon eine Firmwareversion"}, {"id": 159, "start": 1208.32, "end": 1218.84, "text": "gibt, support for S6 vor 15 Tagen, warum kriegt der Typ einen Daumen runter, das ist doch"}, {"id": 160, "start": 1218.84, "end": 1226.88, "text": "eine vollkommen legitime Frage für das Projekt, so nach dem Motto ja wir sind ein Projekt"}, {"id": 161, "start": 1226.88, "end": 1233.36, "text": "für Roborock Staubsauger, ja ist der Roborock S60 Supporter, Daumen runter, Diss Abo Daumen"}, {"id": 162, "start": 1233.36, "end": 1240.64, "text": "runter, rooting this cousin should be done over in dustcloud, woher soll denn das dude"}, {"id": 163, "start": 1240.64, "end": 1248.6, "text": "denn wissen, da würde ich auch nicht drauf kommen, ok gucken wir mal ob wir den S6 schon,"}, {"id": 164, "start": 1248.6, "end": 1259.64, "text": "warum heißt der denn da T6, offiziell heißt der S6, wirechamp, was ist denn ein guter"}, {"id": 165, "start": 1259.64, "end": 1266.36, "text": "Preis für den S50, 400€ ist viel zu viel, ich habe den damals bei einem Angebot bei"}, {"id": 166, "start": 1266.36, "end": 1271.12, "text": "Amazon gekriegt, ich glaube für um die 300€, ich muss mal nachgucken was meiner gekostet"}, {"id": 167, "start": 1271.12, "end": 1278.6, "text": "hat, wir gucken einfach mal bei Guides Hals, ich gucke mal kurz nebenbei in den Mails was"}, {"id": 168, "start": 1278.6, "end": 1282.56, "text": "meiner gekostet hat bei Amazon, guck mal in der Vorschau ist er sogar schon drinnen,"}, {"id": 169, "start": 1282.56, "end": 1301.2, "text": "mal gucken mit welcher E-Mail Adresse habe ich ihn bestellt, ich muss mal Alternate, oh"}, {"id": 170, "start": 1301.2, "end": 1304.0, "text": "man was man da für E-Mails findet die will man überhaupt nicht finden, wenn man nach"}, {"id": 171, "start": 1304.0, "end": 1315.56, "text": "Alternate sucht, feels, merkwürdig Champ, wenn ich nach Alternate suche, warum finde"}, {"id": 172, "start": 1315.56, "end": 1329.96, "text": "ich dann 100.000 Werbemails, was ist das denn, E-Mail Volltext Suche in 2019, ok, ich finde"}, {"id": 173, "start": 1329.96, "end": 1334.48, "text": "es gerade nicht, ich glaube ich habe irgendwas um 300 oder 320 oder irgendwie sowas bezahlt,"}, {"id": 174, "start": 1334.48, "end": 1356.36, "text": "das war ein ziemlich gutes Angebot, er steht hier gar nicht drinnen, das gab es mal als"}, {"id": 175, "start": 1356.36, "end": 1365.84, "text": "Angebot, das ist er doch, ja viel zu teuer, also ich würde gucken, dass ich auf jeden"}, {"id": 176, "start": 1365.84, "end": 1371.6, "text": "Fall unter 350 kriege, am besten irgendwas für Richtung 300, weil alles andere ist dann"}, {"id": 177, "start": 1371.6, "end": 1378.88, "text": "nicht mehr so Schnäppchen mäßig und auf jeden Fall gucken, es gibt einen S5, die haben"}, {"id": 178, "start": 1378.88, "end": 1383.2, "text": "irgendwie vier verschiedene, also man muss gucken, dass es der S50 ist und man muss gucken"}, {"id": 179, "start": 1383.2, "end": 1401.32, "text": "auch, dass es nicht der S6 ist, weil den S6 kann man nicht flashen, so ein Smokersmoke,"}, {"id": 180, "start": 1401.32, "end": 1408.88, "text": "das hier ist viel viel zu teuer, WTF, muss man auf ein gutes Angebot warten, aber ich"}, {"id": 181, "start": 1408.88, "end": 1418.24, "text": "kann ihn auf jeden Fall empfehlen, guck hier gibt es ihn zum Beispiel ab 3960, das glaube"}, {"id": 182, "start": 1418.24, "end": 1424.36, "text": "ich nicht, das glaube ich, also für 280 würde ich den sofort kaufen, aber das ist bestimmt"}, {"id": 183, "start": 1424.36, "end": 1443.28, "text": "Skamars, also zumindest das Angebot sieht nicht nach Skamars, also es sieht jetzt auf"}, {"id": 184, "start": 1443.28, "end": 1451.88, "text": "den ersten Blick nicht Ultraskamars aus, also 280 Euro ist ein absolut Hammer Angebot,"}, {"id": 185, "start": 1451.88, "end": 1457.48, "text": "wenn das dann auch wirklich funktioniert, ach das ist die erste Generation, die können"}, {"id": 186, "start": 1457.48, "end": 1460.32, "text": "sich nicht entscheiden, Moment, die können sich nicht entscheiden, ne erste Generation"}, {"id": 187, "start": 1460.32, "end": 1468.28, "text": "sackt, erste Generation sackt, auf jeden Fall zweite Generation, aber die erste Generation"}, {"id": 188, "start": 1468.28, "end": 1485.24, "text": "ist doch glaube ich gar nicht, S50 oder, wat, was oben hast du das Modell zur Auswahl, ne"}, {"id": 189, "start": 1485.24, "end": 1493.48, "text": "das ist die Stückzahl, ach hier da, hier 50, aaaah, ja da kommen da Sachen schon näher,"}, {"id": 190, "start": 1493.48, "end": 1504.24, "text": "470, Omega Lull, ne so nicht, Skamars, also ich würde gucken, dass ich einen unter 350"}, {"id": 191, "start": 1504.24, "end": 1508.56, "text": "kriege auf jeden Fall, dann kann man sich da drüber Gedanken machen, ob das nicht, dann"}, {"id": 192, "start": 1508.56, "end": 1524.0, "text": "ist das Ding ein ganz gutes Angebot, tubated, ja, massive tubate, ok, als erstes müssen"}, {"id": 193, "start": 1524.0, "end": 1543.04, "text": "wir den komischen Papagei noch drin haben, naja, wie dem auch zwar als erstes, muss ich"}, {"id": 194, "start": 1543.04, "end": 1549.52, "text": "jetzt mal mein Raspberry holen anschließen, weil, wenn ich das noch richtig in Erinnerung"}, {"id": 195, "start": 1549.52, "end": 1557.32, "text": "hab, wenn ich das noch richtig in Erinnerung hab, ging der Flash Vorgang ungefähr so in"}, {"id": 196, "start": 1557.32, "end": 1560.88, "text": "der Richtung, wir müssen uns mal, die hat ne ganz gute Anleitung auf der Seite, also"}, {"id": 197, "start": 1560.88, "end": 1566.52, "text": "wenn ich das richtig in Erinnerung hab, ging das ungefähr so, man hat sich nen Image runtergeladen"}, {"id": 198, "start": 1566.52, "end": 1572.84, "text": "vom Hersteller, was bringt dir das Flaschen, ungeflasht braucht das Ding die offizielle"}, {"id": 199, "start": 1572.84, "end": 1578.44, "text": "App vom Hersteller und die offizielle, das alleine wär ja noch nicht so schlimm, aber"}, {"id": 200, "start": 1578.44, "end": 1583.0, "text": "die offizielle App vom Hersteller geht nicht direkt auf den Staubsauger, sondern geht immer"}, {"id": 201, "start": 1583.0, "end": 1587.8, "text": "über die Cloud in China und zum Staubsauger, also sowohl dein Staubsauger braucht permanente"}, {"id": 202, "start": 1587.8, "end": 1591.6, "text": "Verbindung zur China Cloud, als auch die App braucht permanente Verbindung zur China Cloud"}, {"id": 203, "start": 1591.6, "end": 1595.16, "text": "und wenn die China Cloud nicht geht, kannst du deine Wohnung nicht sauber machen, geschweige"}, {"id": 204, "start": 1595.16, "end": 1599.24, "text": "dann, dass ich eigentlich auch gar nicht will, dass mein Staubsauger in der China Cloud hängt,"}, {"id": 205, "start": 1599.24, "end": 1608.96, "text": "aber wenn du den flashst, ist die China Cloud weg, das ist richtig beknackt SneakyPile, das"}, {"id": 206, "start": 1608.96, "end": 1618.96, "text": "ist total bescheuert, oh ich hab einen Prime Sub vergessen, klumina01, Dankeschön Twitch"}, {"id": 207, "start": 1618.96, "end": 1631.32, "text": "Prime am Start, Pock, Internet of Shit, ja ist tatsächlich so, wir machen mal einen"}, {"id": 208, "start": 1631.32, "end": 1635.88, "text": "Twitter Post, weil sich ja wieder letztens Leute auf Twitter beschwert haben, dass sie"}, {"id": 209, "start": 1635.88, "end": 1641.88, "text": "nicht mitbekommen haben, sag mal habt ihr alle schon das neue Twitter Design, ich bekomm"}, {"id": 210, "start": 1641.88, "end": 1649.24, "text": "das nicht, ich bekomm nicht das neue Twitter Design, ist das machbar für jemand, der keine"}, {"id": 211, "start": 1649.24, "end": 1653.84, "text": "Ahnung hat, du kannst einfach mal zugucken, ich denke schon, dass es machbar ist für jemand,"}, {"id": 212, "start": 1653.84, "end": 1662.48, "text": "der keine Ahnung hat, allerdings sollte man sich nicht, sollte man ein bisschen Zeit einplanen,"}, {"id": 213, "start": 1662.48, "end": 1666.24, "text": "ich kanns nicht zeigen, weil ich nicht eingeloggt bin hier auf Twitter, ich hab noch das alte"}, {"id": 214, "start": 1666.24, "end": 1672.08, "text": "Design, wo die Knöpfe oben sind, wo die Knöpfe oben Startseite, Mitteilung, Nachrichten"}, {"id": 215, "start": 1672.08, "end": 1699.72, "text": "das neue Design hat die Knöpfe ja links an der Seite"}, {"id": 216, "start": 1699.72, "end": 1717.52, "text": "ok, jetzt hab ich mal die Sache auf Twitter gepostet, könnte es eigentlich auch so machen,"}, {"id": 217, "start": 1717.52, "end": 1721.52, "text": "dass es automatisch in Twitter Nachrichten schickt, wenn man on geht, das wäre vielleicht"}, {"id": 218, "start": 1721.52, "end": 1725.6, "text": "auch gar nicht so blöd, also zumindest wenn ich das richtig in Erinnerung hab, wie das"}, {"id": 219, "start": 1725.6, "end": 1731.8, "text": "ganze funktioniert hat, man braucht auf jeden Fall irgendein Gerät, wo man Access Points"}, {"id": 220, "start": 1731.8, "end": 1737.04, "text": "drin aufmachen kann, also man braucht ein Raspberry, man hat irgendein anderes Gerät,"}, {"id": 221, "start": 1737.04, "end": 1740.48, "text": "man kann auch sein Desktop nehmen mit einem USB Stick, mit einem WLAN USB Stick oder sowas"}, {"id": 222, "start": 1740.48, "end": 1748.88, "text": "in der Richtung, so und wie das ganze so grob funktioniert hat, wenn ich das in Erinnerung"}, {"id": 223, "start": 1748.88, "end": 1757.2, "text": "hab, man lädt sich die letzte aktuelle Firmware runter vom Hersteller und dann lädt man sich"}, {"id": 224, "start": 1757.2, "end": 1762.04, "text": "von GitHub, wir machen gleich die Anleitung mal durch, dann lädt man sich von GitHub so"}, {"id": 225, "start": 1762.04, "end": 1769.4, "text": "nen riesen, riesen Skript runter, was die Firmware modifiziert und als letztes lädt"}, {"id": 226, "start": 1769.4, "end": 1772.6, "text": "man sich dann auch hier dieses Fallow-Dingsbums, ich kann mir das immer nicht merken, wenn"}, {"id": 227, "start": 1772.6, "end": 1778.6, "text": "man das ausspricht, Fallow-Tudo runter, das ist ein Go-Programm und baut das in die Firmware"}, {"id": 228, "start": 1778.6, "end": 1785.96, "text": "ein, dann muss man das ganze flashen, wo ich mir nicht mehr ganz sicher bin, ist ob man"}, {"id": 229, "start": 1785.96, "end": 1790.92, "text": "die Firmware auf seinem Desktop bauen konnte oder ob man die Firmware auf dem Raspberry"}, {"id": 230, "start": 1790.92, "end": 1809.2, "text": "bauen musste, ich glaube man konnte, ich glaube man konnte die Firmware auf dem Desktop bauen"}, {"id": 231, "start": 1809.2, "end": 1823.8, "text": "und dann auf den Raspberry kopieren, Neoui, so einen hab ich auch noch, der ist auch an sich"}, {"id": 232, "start": 1823.8, "end": 1829.0, "text": "ganz gut, gerade dafür, dass er halt so blöde ist und halt nicht super intelligent, sondern"}, {"id": 233, "start": 1829.0, "end": 1835.56, "text": "einfach nur die Ecken abfährt, ich find's an sich auch ganz gut, wenn die Dinger ohne"}, {"id": 234, "start": 1835.56, "end": 1839.28, "text": "großartige Cloud-Anbindung oder sowas da her kommen, aber in dem Fall ist es halt so und"}, {"id": 235, "start": 1839.28, "end": 1844.2, "text": "das Gerät kann halt auch deutlich mehr, das kann beispielsweise die Räume scannen mit"}, {"id": 236, "start": 1844.2, "end": 1847.24, "text": "einem Laser, dass der weiß wie groß der Raum ist und fährt den dann halt auch gezielt"}, {"id": 237, "start": 1847.24, "end": 1851.96, "text": "ab, also wenn ich mir mal den Eufy angucke, der Eufy braucht fürs Wohnzimmer drüben keine"}, {"id": 238, "start": 1851.96, "end": 1856.96, "text": "Ahnung, eine halbe Stunde bis der das ordentlich sauber gemacht hat, weil der halt komplett"}, {"id": 239, "start": 1856.96, "end": 1867.48, "text": "planlos random fährt, der S50 braucht richtig ordentlich mit Teppichmodus 10 Minuten, das"}, {"id": 240, "start": 1867.48, "end": 1871.72, "text": "hat schon einen Unterschied, ob das Ding random den Raum zickzack durchfährt oder ob das Ding"}, {"id": 241, "start": 1871.72, "end": 1875.28, "text": "den Raum geplant durchfährt, wir gucken uns das dann auch gleich an, wenn er rumfährt."}, {"id": 242, "start": 1875.28, "end": 1882.96, "text": "So, also wie ging denn der ganze Kram nochmal, hab ich vielleicht noch irgendwo was hier"}, {"id": 243, "start": 1882.96, "end": 1900.72, "text": "vom letzten, den Rute, warte, S5, habe ich hier vielleicht noch das alte Verzeichnis irgendwo"}, {"id": 244, "start": 1900.72, "end": 1908.6, "text": "drauf, Firmware, wie könnte ich das genannt haben, ich glaube das habe ich dann mal drauf,"}, {"id": 245, "start": 1908.6, "end": 1913.8, "text": "ok, dann muss ich das komplett neu herunterladen, den ganzen Mist, so, Laurenz, Twitch Prime,"}, {"id": 246, "start": 1913.8, "end": 1932.04, "text": "Dankeschön, Nice, Naisu, ok, wir empfehlen die folgende Firmware für den Vorgang, Firmware"}, {"id": 247, "start": 1932.04, "end": 1949.32, "text": "V1111001782, ok, Nice, machen wir, Introduction, kann man lesen oder, Hallo Tommy K, kann man"}, {"id": 248, "start": 1949.32, "end": 1962.72, "text": "eigentlich ganz gut lesen, jetzt hier von der Größe her, how this works, Blablabla, Local"}, {"id": 249, "start": 1962.72, "end": 1966.64, "text": "Interface, Blablub, so, das ist die technische Erklärung dahinter, wie sie es machen, how"}, {"id": 250, "start": 1966.64, "end": 1981.08, "text": "installation works, Encrypted but unsigned Firmware Image, Encryption Key, Blablabla,"}, {"id": 251, "start": 1981.08, "end": 1985.08, "text": "User has to download Firmware Image from Manufactor, ja, das machen wir und Patch them, genau,"}, {"id": 252, "start": 1985.08, "end": 1989.4, "text": "das war der Act, also man musste, kann ich mich noch dran erinnern, man musste vom Hersteller,"}, {"id": 253, "start": 1989.4, "end": 1993.56, "text": "man musste sich irgendwo einen Download suchen von der Firmware vom Hersteller und dann"}, {"id": 254, "start": 1993.56, "end": 1997.84, "text": "musste man die modifizieren mit dem Patch, oder ich muss mal die Klimaanlage anmachen,"}, {"id": 255, "start": 1997.84, "end": 2017.96, "text": "es ist übel warm hier drin, Mode, Mode, Klimaanlage, geh mal auf kühlen, kühlen, nice, so, Dependencies,"}, {"id": 256, "start": 2017.96, "end": 2024.6, "text": "Hammer bestimmt alles, Root Access, if you plan on being able to connect to your SSH,"}, {"id": 257, "start": 2024.6, "end": 2031.4, "text": "das brauchen wir nicht, das brauchen wir nicht, weil in Version 4 kann man den SSH Key hochladen"}, {"id": 258, "start": 2031.4, "end": 2040.8, "text": "über das Webinterface, Max, welche GPU empfiehlst du für 1080p 150Hz Gaming, ich beschäftige"}, {"id": 259, "start": 2040.8, "end": 2045.32, "text": "mich mit Grafikkarten und Zeug eigentlich in der Regel immer nur, wenn ich mir einen"}, {"id": 260, "start": 2045.32, "end": 2048.96, "text": "Rechner kaufe, allerdings, wenn ich mir jetzt einen neuen Rechner kaufen würde, nach allem"}, {"id": 261, "start": 2048.96, "end": 2056.36, "text": "was ich gelesen habe, würde ich wahrscheinlich eine 2070 oder sowas kaufen, oder ich würde"}, {"id": 262, "start": 2056.36, "end": 2063.6, "text": "wieder anfangen Videos zu machen und mir von Nvidia eine 2080 Ti geben lassen, das ist"}, {"id": 263, "start": 2063.6, "end": 2078.36, "text": "nämlich next level. Okay, Image Building, also wir müssen jetzt als erstes mal uns"}, {"id": 264, "start": 2078.36, "end": 2088.0, "text": "irgendwo das Hersteller Image runterladen, oder? Ne, ne, wir laden keine fertige Images"}, {"id": 265, "start": 2088.0, "end": 2092.24, "text": "runter, wir machen das selbst, okay, also, mkdir, ich bin mir nicht mehr sicher, ob man"}, {"id": 266, "start": 2092.24, "end": 2096.8, "text": "das auf dem Desktop oder auf dem Raspberry machen musste, ich würde sagen, wir machen"}, {"id": 267, "start": 2096.8, "end": 2102.4, "text": "es mal auf dem Raspberry, weil auf dem brauchen wir den Kram bis am Ende eh. Ich stöpsel"}, {"id": 268, "start": 2102.4, "end": 2128.4, "text": "mal kurz den Raspberry ein oder andert mal kurz, omegamode, so, Raspberry, ok, ok,"}, {"id": 269, "start": 2128.4, "end": 2141.3, "text": "ok, das Ding startet. Da machen wir das nämlich auf dem Raspberry, das ist besser. Gut, Pi"}, {"id": 270, "start": 2141.3, "end": 2146.56, "text": "Add, dann hoffen wir mal, dass er die gleiche IP kriegt wie das letzte Mal, muss ich erstmal"}, {"id": 271, "start": 2146.56, "end": 2158.44, "text": "nachgucken was er für eine IP gekriegt hat. Komm, komm on brah. Oh ne, eine andere IP gekriegt,"}, {"id": 272, "start": 2158.44, "end": 2174.48, "text": "muss ich mal kurz ins DHCP gucken. DHCP leases. Raspberry, was hat er denn gekriegt, ne Hunde."}, {"id": 273, "start": 2174.48, "end": 2180.72, "text": "Ich hab die auch richtig bescheuert, ich hab das doch jetzt nicht im Wlan, sondern per Netzwerkstecker"}, {"id": 274, "start": 2180.72, "end": 2194.6, "text": "dran. Jetzt sind wir auf dem richtigen drauf. Statisches DHCP, äh ich glaub ich hab sogar"}, {"id": 275, "start": 2194.6, "end": 2202.76, "text": "statisches DHCP für das Ding, allerdings hab ich gerade den falschen Netz probiert. So,"}, {"id": 276, "start": 2202.76, "end": 2208.28, "text": "haben wir mal ein Update von dem Ding. Man weiß ja nie, beim 4er tut sich ja da auch noch"}, {"id": 277, "start": 2208.28, "end": 2233.6, "text": "recht viel. Go, go."}, {"id": 278, "start": 2233.6, "end": 2249.76, "text": "Lohnt sich der 4er? Naja, also nur in Ausnahmefällen. Nur in Ausnahmefällen. Die Ausnahmefällen"}, {"id": 279, "start": 2249.76, "end": 2254.96, "text": "sind würde ich sagen, ähm, Media Center. Wobei ich ganz ehrlich, ich würde den Raspberry"}, {"id": 280, "start": 2254.96, "end": 2259.0, "text": "auch nicht als Media Center verwenden. Vielleicht den 4er, das müsste ich mal ausbrechen, aber"}, {"id": 281, "start": 2259.0, "end": 2262.4, "text": "ich finde da sollte man sich einfach günstig einen Android TV Stick kaufen und glücklich"}, {"id": 282, "start": 2262.4, "end": 2267.76, "text": "sein und das läuft dann in der Regel viel besser. Ähm, ja als Media Center würde ich"}, {"id": 283, "start": 2267.76, "end": 2272.04, "text": "den 4er nehmen, wenn es unbedingt ein Raspberry sein muss. Falls ich irgendwelche Anzeigewände"}, {"id": 284, "start": 2272.04, "end": 2277.36, "text": "habe, was wahrscheinlich die wenigsten hier haben, dann würde ich den 4er nehmen. Oder"}, {"id": 285, "start": 2277.36, "end": 2283.32, "text": "wenn ich ein ganz, ganz billiges NAS bauen will und halt die USB und Netzwerkübertragungsraten"}, {"id": 286, "start": 2283.32, "end": 2288.52, "text": "bräuchte. Aber dafür ist eigentlich an sich nicht geeignet. Allein schon weil du keine"}, {"id": 287, "start": 2288.52, "end": 2292.48, "text": "Verschlüsselung gescheit mit machen kannst, weil er dafür viel zu lahm ist. Oder es liegt"}, {"id": 288, "start": 2292.48, "end": 2298.88, "text": "am 32-Bit-Respieren, weil die, ähm, Arm-CPU ihre Encryption, äh, Crypto-Extensions nur"}, {"id": 289, "start": 2298.88, "end": 2303.68, "text": "unter 64-Bit verwenden kann. Wie viele Subs gab es heute schon? Ich glaube, vier oder"}, {"id": 290, "start": 2303.68, "end": 2308.92, "text": "fünf? Übrigens, gestern, total übertrieben, ne? Ich hab gestern mal nachgeguckt, ich guck"}, {"id": 291, "start": 2308.92, "end": 2313.08, "text": "mal wie viele Subs ich jetzt hab. Gestern nachgeguckt und ich hab ja so im Stream gesagt,"}, {"id": 292, "start": 2313.08, "end": 2333.48, "text": "naja, werden so 30 oder so gewesen sein. 52! 52! Huge! Noch, noch mehr Subs, hier, der"}, {"id": 293, "start": 2333.48, "end": 2344.96, "text": "GW-Oz-13-Kusch-Renada, naja, ähm, Twitch-Prime. Ich mach's über Holt bald exklusiv. Ja, wenn"}, {"id": 294, "start": 2344.96, "end": 2351.08, "text": "ich irgendwann mal, ähm, keine Ahnung, 40.000 Subs oder so hab. Shroud hat 40.000 Subs,"}, {"id": 295, "start": 2351.08, "end": 2361.72, "text": "ne? Ich letztens irgendwo gelesen. 40.000 Subs ist schon ziemlich pock. Reaction-Streams,"}, {"id": 296, "start": 2361.72, "end": 2366.48, "text": "ja. Ich hab doch letztens, haben wir doch ein Stream gemacht, wo ich irgendwie, letzten"}, {"id": 297, "start": 2366.48, "end": 2369.6, "text": "Sonntag hab ich mal ein Stream gemacht, wo ich gesagt hab, irgendwie Aufwach-Stream,"}, {"id": 298, "start": 2369.6, "end": 2374.12, "text": "wo wir uns ein paar Videos angeguckt haben. Das war ja so eine Art Reaction-Stream. Und"}, {"id": 299, "start": 2374.12, "end": 2388.92, "text": "da hatte ich auf einmal voll viele Zuschauer. So, aus dem Nichts. 100 Subs Face-Reveal,"}, {"id": 300, "start": 2388.92, "end": 2396.72, "text": "naja, 5000 Subs Face-Reveal. 5000 Subs Face-Reveal, oder eine Million Abos auf YouTube auf Face-Reveal."}, {"id": 301, "start": 2396.72, "end": 2414.2, "text": "Easy. Gehst doch einfach auf den Boden schlafen, das siehst du halt schon. Ich guck exklusiv"}, {"id": 302, "start": 2414.2, "end": 2423.92, "text": "wirklich gern. Ähm, der ist halt, der hat halt so seine eigene, seine eigene Art irgendwie"}, {"id": 303, "start": 2423.92, "end": 2428.2, "text": "das zu machen. Ich find's halt, ich find's halt übelst lustig, ne? V.a. wenn er zwischendrin"}, {"id": 304, "start": 2428.2, "end": 2431.76, "text": "auf seinen Stuhl springt und irgendwie da drauf rumspringt. Also, ich weiß nicht, ich"}, {"id": 305, "start": 2431.76, "end": 2434.4, "text": "kann's mir nicht den ganzen Tag angucken, aber ich find's zwischendurch echt lustig."}, {"id": 306, "start": 2434.4, "end": 2442.64, "text": "Der 300k Hype-Train, ich krieg aktuell auf YouTube, krieg ich schon wieder massig D-Abus"}, {"id": 307, "start": 2442.64, "end": 2453.0, "text": "einfach, weil ich nichts hochlade. Mit 300k ist da nichts auf YouTube, ne? Wie, es gibt"}, {"id": 308, "start": 2453.0, "end": 2459.76, "text": "keine Updates? Das glaub ich nicht. Für den Vierer gab's täglich Updates normalerweise."}, {"id": 309, "start": 2459.76, "end": 2471.12, "text": "Warum, warum, warum gibt's keine Updates? Okay, ich will mich jetzt nicht beschweren,"}, {"id": 310, "start": 2471.12, "end": 2474.96, "text": "dass es keine Updates gibt. Man kann nicht abonnieren, ja, seit gestern, seit gestern"}, {"id": 311, "start": 2474.96, "end": 2480.8, "text": "irgendwie 17 Uhr oder so. Hat Twitch, äh, war Twitch der Meinung, wir schalten's jetzt"}, {"id": 312, "start": 2480.8, "end": 2489.6, "text": "frei. Also, ja. Also, ich mein, überlegt euch mal für die Größe vom Stream, ne? Und"}, {"id": 313, "start": 2489.6, "end": 2498.44, "text": "bei der ganzen Zeit sind's 52 Subs ist echt schon, das ist, äh, huge. Aber ich hab halt"}, {"id": 314, "start": 2498.44, "end": 2508.92, "text": "Big Brain Subs. Sie wissen halt, was ich gehöre. Der Sebaro war einer der Ersten, ja, ich"}, {"id": 315, "start": 2508.92, "end": 2512.32, "text": "weiß ja, ob der Sebaro der Erste war. Sebaro, soll ich mal nachgucken, ob du der Erste warst?"}, {"id": 316, "start": 2512.32, "end": 2519.2, "text": "Da Frank, Twitch Prime, Dankeschön. Sebaro, ich guck mal, ob du der Erste warst. Subscriber"}, {"id": 317, "start": 2519.2, "end": 2529.96, "text": "History, der war der Erste. Der Sebaro war der Erste, tatsächlich. Allerdings nur ganz"}, {"id": 318, "start": 2529.96, "end": 2537.52, "text": "knapp, ähm, Sebaro war der Erste, danach kam direkt der Silent Pain. Und dann kam der"}, {"id": 319, "start": 2537.52, "end": 2547.0, "text": "Patrick, der war aber ein paar Minuten später. Twitch Prime Sellout, ja, hab ich schon,"}, {"id": 320, "start": 2547.0, "end": 2551.32, "text": "einmal die Stunde reicht, würd ich sagen. Okay, also, wie funktioniert der ganze Kram"}, {"id": 321, "start": 2551.32, "end": 2559.36, "text": "jetzt hier? MKDeer, Roborock, alles gut, jawoll, bla, blup. Clone das Cloud Repo, Until Image"}, {"id": 322, "start": 2559.36, "end": 2567.44, "text": "Builder, 0.1 is available. Okay, was auch immer, wir clonen das jetzt einfach. Ich"}, {"id": 323, "start": 2567.44, "end": 2574.8, "text": "sag euch was, Klimaanlage ist wirklich angenehm. Fällt mir jedes Mal auf, wenn's so warm ist,"}, {"id": 324, "start": 2574.8, "end": 2583.04, "text": "dann drückst du einfach auf den Knopf und 5 Minuten später ist es kühl. Ja, Zugucker,"}, {"id": 325, "start": 2583.04, "end": 2595.0, "text": "ich werd's überleben, ich werd's überleben. Okay, haben wir den Kram geklaut, Create Directory,"}, {"id": 326, "start": 2595.0, "end": 2606.72, "text": "äh, Push, das ist jetzt aber die Oldschool Variante, äh. Download Latest Binary From"}, {"id": 327, "start": 2606.72, "end": 2613.04, "text": "machen wir auch. Da, 0.4 Beta wollen wir runterladen. Guck mal, hier haben sie auch noch ein paar"}, {"id": 328, "start": 2613.04, "end": 2618.64, "text": "Bilder von den neuen Funktionen, äh, das ist der Zonen Editor, das ist hier auch Zonen"}, {"id": 329, "start": 2618.64, "end": 2627.16, "text": "Editor, noch mehr Zonen Editor, äh, Access Core, ach, endlich, sie haben jetzt die Möglichkeit,"}, {"id": 330, "start": 2627.16, "end": 2632.12, "text": "dass man sich authentifiziert am Webinterface, ja, das ist gut. Aktuell ist es nämlich so,"}, {"id": 331, "start": 2632.12, "end": 2636.08, "text": "jeder der auf den Staubsauger-Roboter drauf kommt, also jeder der in diesem WLAN drinne"}, {"id": 332, "start": 2636.08, "end": 2641.56, "text": "ist, kann das Ding steuern. Ich mein, bei mir ist es kein Ding, ich hab nen extra WLAN für"}, {"id": 333, "start": 2641.56, "end": 2645.96, "text": "die ganzen China-Geräte, aber für, ich sag mal, in Anführung kriege ich normale Leute,"}, {"id": 334, "start": 2645.96, "end": 2650.68, "text": "die vielleicht die Geräte auch bei sich ins WLAN hängen, äh, gibts die irgendeinem Kollege"}, {"id": 335, "start": 2650.68, "end": 2655.08, "text": "oder so, der hat ein WLAN-Passwort und der steuert dann an Staubsauger durch die Wohnung."}, {"id": 336, "start": 2655.08, "end": 2662.76, "text": "Sie haben es jetzt, jetzt haben sie es wohl geschafft, dass du, ähm, dass du den Staubsauger"}, {"id": 337, "start": 2662.76, "end": 2671.64, "text": "auch, ähm, Basic, also Passport-Authentifizierung schützen kannst. Und dass man endlich als"}, {"id": 338, "start": 2671.64, "end": 2683.36, "text": "H-Keys direkt hochladen kann. Das ist sehr, sehr, sehr, sehr, wo ist es? Äh, und sonst"}, {"id": 339, "start": 2683.36, "end": 2689.28, "text": "gibt es eigentlich nix Neues. Okay, wir sollen die neueste Version runterladen. Das da. OP-Link,"}, {"id": 340, "start": 2689.28, "end": 2702.08, "text": "EGET. Bäm. Erstmal drei, zig Millionen Zeichen, Ull. Okay, runtergeladen, Instructions, Download."}, {"id": 341, "start": 2702.08, "end": 2708.52, "text": "Deployment. Warum können wir nicht einfach nen CD machen? Warum muss man Push-D machen?"}, {"id": 342, "start": 2708.52, "end": 2712.76, "text": "Achso, wir machen Push-D, dass man nachdem nachher wieder nach oben gehen kann. Das ist"}, {"id": 343, "start": 2712.76, "end": 2716.96, "text": "aber, das hab ich schon ewenig mal gesehen, dass das jemand verwendet. Äh, und jetzt"}, {"id": 344, "start": 2716.96, "end": 2730.44, "text": "müssen wir die CONF-RAW runterladen. Okay, auch gut, machen wir. ETC. VGET, Hosts, zack."}, {"id": 345, "start": 2730.44, "end": 2742.12, "text": "RC-Local, zack. Wir machen jetzt einfach POPPT. So. Create Firmware Directory. Wir machen"}, {"id": 346, "start": 2742.12, "end": 2744.76, "text": "jetzt einfach mal die Anleitung durch. Ich hab das ja schonmal gemacht vor ein paar"}, {"id": 347, "start": 2744.76, "end": 2764.28, "text": "Monaten. Das hat auch soweit funktioniert. Download Latest Firmware. VGET, Ull. Ah. Example."}, {"id": 348, "start": 2764.28, "end": 2773.24, "text": "Okay, da oben stand auch was die für ne Firmware-Version empfehlen. 1782. Also, ja dann passt"}, {"id": 349, "start": 2773.24, "end": 2782.12, "text": "die Ull doch eigentlich. Dieser Moment, wenn der Staubzauger SSH hat. Ja, hat er. Hat"}, {"id": 350, "start": 2782.12, "end": 2786.12, "text": "er ja aktuell auch schon. Also ich kann mich aktuell, ich zeig das mal, weil ich hab den"}, {"id": 351, "start": 2786.12, "end": 2800.64, "text": "ja hier schon, ah nee, ich hab ihn grad ausgeschaltet. Meint VGET. VGET? Wo, wo sind da stehen geblieben?"}, {"id": 352, "start": 2800.64, "end": 2827.44, "text": "Ahm. Ja, VGET. VGET. Resolving. Connecting. Waiting. Boah. Resident Sleeper hier. Was hast"}, {"id": 353, "start": 2827.44, "end": 2833.04, "text": "du für ne Klimaanlage? Irgendeine von Mitsubishi Heavy. Den genauen Typ kann ich dir nicht"}, {"id": 354, "start": 2833.04, "end": 2846.28, "text": "sagen. Langsamer Urlaubichter kann sein, aber ich starte es nicht nochmal. Die eineinhalb"}, {"id": 355, "start": 2846.28, "end": 2856.08, "text": "Minuten können wir warten. Das ist nicht GitHub, das ist von Amazon, let darunter. Welches"}, {"id": 356, "start": 2856.08, "end": 2867.6, "text": "Linux ist das? Das ist Manjaro mit i3-WM als Desktop. Ah stimmt, die haben ja sogar ein"}, {"id": 357, "start": 2867.6, "end": 2885.8, "text": "Befehl dafür. Ich hoffe es smoke danach nicht. Manjaro install"}, {"id": 358, "start": 2885.8, "end": 2907.64, "text": "gestern gefällt. Mit was? Was die Manjaro install gefällt. But why? Ach, das hab ich"}, {"id": 359, "start": 2907.64, "end": 2911.72, "text": "im Discord gesehen, ja das hat mir auch nichts gesagt. Was hast du für den Installer genommen?"}, {"id": 360, "start": 2911.72, "end": 2921.0, "text": "Den minimalen Netinstall. Damit hatte ich eigentlich noch keine Probleme bisher. Ubuntu immer noch"}, {"id": 361, "start": 2921.0, "end": 2929.6, "text": "beste. Auf dem Server ja. Ich weiß, ich find's witzig, ne? Die halbe Welt verwendet Ubuntu"}, {"id": 362, "start": 2929.6, "end": 2934.36, "text": "auf dem Desktop. Ich find Ubuntu auf dem Desktop suckt. Auf dem Desktop verwende ich"}, {"id": 363, "start": 2934.36, "end": 2940.72, "text": "Manjaro. Die andere halbe Welt verwendet auf dem Server Red Hat oder irgendwelche Abkömmlinge"}, {"id": 364, "start": 2940.72, "end": 2948.72, "text": "davon. Debian. Das war's eigentlich zum größten Teil. Manche haben noch Susu oder sowas. Aber"}, {"id": 365, "start": 2948.72, "end": 2958.64, "text": "du hast eigentlich Debian und Red Hat zum größten Teil. Und da verwende ich Ubuntu Server."}, {"id": 366, "start": 2958.64, "end": 2967.36, "text": "Ubuntu Server beste. Ok, Download fertig. Nice. Oh, ich hab's falsche runtergeladen. Hab ich"}, {"id": 367, "start": 2967.36, "end": 2973.04, "text": "jetzt falsche runtergeladen? Ne, ne, ne, ich hab's richtige. Passt. If you follow above"}, {"id": 368, "start": 2973.04, "end": 2983.48, "text": "commands, your Rock Robo Directory Structure would look like this. Gucken wir mal, wie meine"}, {"id": 369, "start": 2983.48, "end": 2990.68, "text": "Robo Rock Directory Structure aussieht. Bam. Debated. Aber das wird schon funktionieren."}, {"id": 370, "start": 2990.68, "end": 3004.52, "text": "Was ist ernsthaft noch? Das ist gar nicht, dass das starrer mir nicht dabei ist. Finde"}, {"id": 371, "start": 3004.52, "end": 3014.32, "text": "den Fehler. Was, bei was? Achso, muss noch eins hoch. So, sieht es jetzt so aus wie in"}, {"id": 372, "start": 3014.32, "end": 3023.04, "text": "der Anleitung. Rock Robo Dust Cloud. Blablabla. Devices, Dummy, Dust Cloud, License, Pipfile,"}, {"id": 373, "start": 3023.04, "end": 3032.04, "text": "Logo Presentation, Blablabla. Ok, passt. Firmware. Ja. Fale Tuto. Das ist echt der Zungenbrecher"}, {"id": 374, "start": 3032.04, "end": 3035.52, "text": "der Name. Ich weiß nicht warum. Die hätten das anders nennen sollen. Ich finde, das"}, {"id": 375, "start": 3035.52, "end": 3042.84, "text": "ist voll der Zungenbrecher. Die hätten das Projekt irgendwie Roboown oder keine Ahnung."}, {"id": 376, "start": 3042.84, "end": 3065.72, "text": "Robo Rock, Beshtor oder was weiß ich. Voller Zungenbrecher. Deployment. Deployment, ETC,"}, {"id": 377, "start": 3065.72, "end": 3084.04, "text": "Blablabla. Ja, sieht gut aus. Creating Firmware Image. MKD Image. In welchem Verzeichnis soll"}, {"id": 378, "start": 3084.04, "end": 3096.72, "text": "man das jetzt hier überhaupt anlegen? Gar nicht hier, oder? Weil die gehen ja hier eins"}, {"id": 379, "start": 3096.72, "end": 3105.28, "text": "nach oben. Also irgendwie, in dem Verzeichnis sein oder in dem Verzeichnis? Ne, in welchem"}, {"id": 380, "start": 3105.28, "end": 3112.36, "text": "Verzeichnis muss man dann sein? Ach ne, der wechselt dann da rein. Achso, ok, dann passt"}, {"id": 381, "start": 3112.36, "end": 3118.48, "text": "das schon. Ok, also jetzt bilden wir mal das Firmware Image. Scroll noch mal hoch. Was"}, {"id": 382, "start": 3118.48, "end": 3138.96, "text": "hier in der Anleitung? Moin, Homewell. Achso, und übrigens, der Chat besteht drauf, dass"}, {"id": 383, "start": 3138.96, "end": 3145.2, "text": "ich Ubuntu nicht Ubuntu ausspreche, sondern... Ne, fuck. Moment. Wie muss ich Ubuntu aussprechen?"}, {"id": 384, "start": 3145.2, "end": 3155.72, "text": "Ich hab's vergessen. Wie muss ich Ubuntu aussprechen? Ubuntu, genau. Ubuntu. Oh,"}, {"id": 385, "start": 3155.72, "end": 3163.24, "text": "hier ist ne Motte. Da krabbelt ne Motte rum. Ich muss mal kurz platt machen. Jetzt hätte"}, {"id": 386, "start": 3163.24, "end": 3169.92, "text": "ich natürlich so toll gekrabbelt, dass ich nicht drankomme. C'mon brah, wartet mal. Morten"}, {"id": 387, "start": 3169.92, "end": 3182.16, "text": "Bash. Morten Bash. Wo ist hin? Wo ist das Viech hin? Wo ist das Viech hin? Ich komm"}, {"id": 388, "start": 3182.16, "end": 3190.24, "text": "da nicht hin. Debated. Ich komm da nicht hin. Das ist total, total beschissen hinter dem"}, {"id": 389, "start": 3190.24, "end": 3204.4, "text": "Monitor, ey. Fuck. Hm, wartet mal. Snipesaw, genau, das ab. 360 Quicks, gobt. Jetzt springt"}, {"id": 390, "start": 3204.4, "end": 3222.2, "text": "das Ding hier total rum. Wo ist es hin? Wo ist es hin? Wo ist es hin? Da, da springt's."}, {"id": 391, "start": 3222.2, "end": 3234.8, "text": "Das jumpt voll. Das jumpt voll übern Tisch. Debated. Okay, ich hab, ich hab keine Ahnung"}, {"id": 392, "start": 3234.8, "end": 3240.88, "text": "wo es hin ist. Ich hab's nicht erwischt. Muss ich nachher noch mal gucken wo es hin"}, {"id": 393, "start": 3240.88, "end": 3249.16, "text": "ist. Aber ich hab's teilweise, ich hab's so halb erwischt, weil wenn das, weil wenn das,"}, {"id": 394, "start": 3249.16, "end": 3254.04, "text": "wenn ich das nicht erwischt hab, dann wird's nicht rumspringen, sondern wegfliegen. Hab"}, {"id": 395, "start": 3254.04, "end": 3264.12, "text": "ich hier so eine halbplatte Motte rum, rum, hüpfen. Die Katze findet, nein, die, die,"}, {"id": 396, "start": 3264.12, "end": 3271.32, "text": "Chico ist nicht in der Lage das zu fangen, äh, die ist da viel zu Noobcat für. Wobei"}, {"id": 397, "start": 3271.32, "end": 3284.32, "text": "gibt's nicht einen Streamer der Noobcat heißt. Okay, also jetzt müssen wir das Firmware-Image"}, {"id": 398, "start": 3284.32, "end": 3298.8, "text": "generieren. Okay, machen wir das mal. Warum muss man das eigentlich als Route machen?"}, {"id": 399, "start": 3298.8, "end": 3302.64, "text": "Muss man bestimmt nicht als Route machen, weil er doch eben beknackt. Achso, ja gut, wir"}, {"id": 400, "start": 3302.64, "end": 3313.8, "text": "sind auf dem Raspberry, wir sind E-Route. Keine andere Variante. Replace ADB. Replace"}, {"id": 401, "start": 3313.8, "end": 3321.2, "text": "ADB. Excessive, das Ding hat einen USB-Anschluss? Das hab ich überhaupt nicht gesehen, dass"}, {"id": 402, "start": 3321.2, "end": 3328.72, "text": "man Staubsäge und USB-Anschluss hat. Ich wüsste gar nicht wo das sein soll. Okay,"}, {"id": 403, "start": 3328.72, "end": 3358.64, "text": "dann machen wir das mal. Kommt mal nochmal eine Maschine, steckt"}, {"id": 404, "start": 3358.64, "end": 3372.08, "text": "aus. Keine Ahnung, wo der USB-Anschluss sein soll. Okay, ja auch gut. Hier hagelt es gerade"}, {"id": 405, "start": 3372.08, "end": 3384.64, "text": "5 cm, Herr Körner. Ah, feels bad man. Einfach nicht rausgehen. Easy. Guck doch einfach bei"}, {"id": 406, "start": 3384.64, "end": 3388.08, "text": "deinem Gerät, ich weiß ja nicht wo ich gucken soll. Ich hab das Ding schon in der Hand gehabt,"}, {"id": 407, "start": 3388.08, "end": 3390.88, "text": "ich hab so ziemlich alles offen gehabt an dem Ding, ich hab keinen USB-Anschluss gesehen."}, {"id": 408, "start": 3390.88, "end": 3400.16, "text": "Okay, wir machen das jetzt mal kurz anders. Warte mal, ich soll mal ein ordentliches Kommando"}, {"id": 409, "start": 3400.16, "end": 3422.92, "text": "draus bauen. So, weg. Firmware, jawoll. Public Key brauchen wir nicht. Path ist okay. Ja,"}, {"id": 410, "start": 3422.92, "end": 3431.4, "text": "Software Upgrades Disable auf jeden Fall. NTP Server 60.1, der kommt ja in mein China"}, {"id": 411, "start": 3431.4, "end": 3453.16, "text": "WLAN rein. Replace ADB. Okay, fertig. War das jetzt kopiert? Ja. Oh. Ah, ich hab die Voraussetzung"}, {"id": 412, "start": 3453.16, "end": 3461.48, "text": "nicht installiert. Ich kack noob. Abinstall. Okay, was brauchen wir? Was brauchen wir alles?"}, {"id": 413, "start": 3461.48, "end": 3468.6, "text": "Bash ist auf jeden Fall drauf. Open SSH. SSH Keygen wird wahrscheinlich auch drauf sein."}, {"id": 414, "start": 3468.6, "end": 3488.84, "text": "Abinstall. DOS to UNIX, DOS to UNIX und CC. RIPPED. Okay, jetzt aber. Okay, dann soll man"}, {"id": 415, "start": 3488.84, "end": 3501.16, "text": "für no public key selected. Ich will ja auch keine Keys. Ich will auch überhaupt keine"}, {"id": 416, "start": 3501.16, "end": 3529.8, "text": "Keys. Hä? Wie, muss ich den Key auswählen oder was? Ich will keinen Key generieren."}, {"id": 417, "start": 3529.8, "end": 3543.24, "text": "Ich will den Key hochladen übers Webinterface danach. Hab ich schon SSH generiert. SSH Key"}, {"id": 418, "start": 3543.24, "end": 3559.72, "text": "generiert. Mal gucken. Nee. Gott, generieren wir einen. Boot SSH, ja. Ne, Moment, wir brauchen"}, {"id": 419, "start": 3559.72, "end": 3570.28, "text": "ein Special Keygen. Wir generieren jetzt genau wie die das hier vorgeben. YourMail.example.com,"}, {"id": 420, "start": 3570.28, "end": 3581.16, "text": "perfekt. So wollte ich schon immer, dass das heißt. Okay, gut, dann. Dann noch mal. Punkt"}, {"id": 421, "start": 3581.16, "end": 3610.6, "text": "SSH. Papp. Passt das jetzt? Ich hab's auskommentiert. Hm? Bist doch. Wartet mal."}, {"id": 422, "start": 3610.6, "end": 3626.92, "text": "Firmware. Ah, haha. Falsche Versionsnummer. So, der Rest sollte jetzt aber stimmen. So,"}, {"id": 423, "start": 3626.92, "end": 3648.68, "text": "ha. Ah, jetzt geht's los. Dann erstellt man immer mein Firmware Image. Gleich, gleich"}, {"id": 424, "start": 3648.68, "end": 3675.0, "text": "geht's MonkaS Smoke. Wir schauen mal wie der Raspberry ausgelastet ist. Oh na ja, ein CPU-Kern"}, {"id": 425, "start": 3675.0, "end": 3691.16, "text": "100%. Das ist ja in Ordnung. Wird gezippt. Sorry, gezippt wird er, gezippt. Wir müssen"}, {"id": 426, "start": 3691.16, "end": 3699.16, "text": "ja neuerdings alles geil englisch betont aussprechen. Wir haben auch keine API mehr, wir haben nur"}, {"id": 427, "start": 3699.16, "end": 3718.36, "text": "APIs. Unter Ubuntu. Wahrscheinlich ist danach die SD, die, die Micro SD Karte von Raspberry"}, {"id": 428, "start": 3718.36, "end": 3748.28, "text": "direkt im Arsch. Mein Glocks HD. Ajeja. Oh Gott, Java. Ja, das wird immer wieder in Ordnung."}, {"id": 429, "start": 3748.28, "end": 3759.8, "text": "Das wird ja immer schlimmer. Und auch Router, ja. Oh, er ist fertig. War das echt so einfach?"}, {"id": 430, "start": 3759.8, "end": 3762.28, "text": "Da kann ich mich gar nicht mehr dran erinnern. Ich dachte das letzte Mal hat es länger gedauert"}, {"id": 431, "start": 3762.28, "end": 3765.72, "text": "und hat noch mehr Schritte gebraucht. Aber vielleicht haben sie es ja, vielleicht haben"}, {"id": 432, "start": 3765.72, "end": 3773.88, "text": "sie es ja einfach verbessert. Okay, jetzt haben wir den Firmware Image generiert. Flashing,"}, {"id": 433, "start": 3773.88, "end": 3780.28, "text": "Flashing Firmware Image. After successful build on Firmware Image using VM. Nein, wir"}, {"id": 434, "start": 3780.28, "end": 3807.88, "text": "usen keine VM, wir usen, wir usen den Raspberry. Okay, ist schon installiert. PIP und VN machen"}, {"id": 435, "start": 3807.88, "end": 3827.0, "text": "ich. Oh. 50 Bits, Dankeschön. Kio-kun. Huge, huge Bits. So langsam aber sicher bräuchte"}, {"id": 436, "start": 3827.0, "end": 3831.64, "text": "ich einen dritten Monitor. Weil ich hab jetzt hier halt für das was ihr seht, da hab ich"}, {"id": 437, "start": 3831.64, "end": 3840.12, "text": "links neben dran den Monitor, da hab ich hier mein Image, mein Imagezeugs und mein Soundzeugs,"}, {"id": 438, "start": 3840.12, "end": 3845.4, "text": "dann hab ich Stream Vorschau und Chat und jetzt bräuchte ich eigentlich nochmal ne Anzeige"}, {"id": 439, "start": 3845.4, "end": 3853.4, "text": "für Follows, Subs und Bits und Donations und Gedöns. Weil ich werd garantiert wieder die"}, {"id": 440, "start": 3853.4, "end": 3858.92, "text": "Hälfte übersehen, wie ich das auch bei Follows immer gemacht hab. Wie viel RAM hast du eigentlich"}, {"id": 441, "start": 3858.92, "end": 3866.68, "text": "insgesamt? Doch der Rechner hat, äh, 316 Gigabyte. Also ist jetzt nicht, ist jetzt nicht so übermäßig"}, {"id": 442, "start": 3866.68, "end": 3880.92, "text": "viel. Ich, ich wollt mir ja noch nen, noch nen zweites Pack 16G kaufen, jetzt wo RAM"}, {"id": 443, "start": 3880.92, "end": 3889.64, "text": "grad ein bisschen billiger ist. Ok, weiter gehts. CD Punkt Punkt. Ne, nicht CD Punkt"}, {"id": 444, "start": 3889.64, "end": 3897.0, "text": "Punkt. MKDier-Flasher. Das kann fast ein CSGO Pro sein. Ähm, jawoll. Oh, ist VN anlegen."}, {"id": 445, "start": 3897.0, "end": 3908.84, "text": "Jetzt müssen wir wahrscheinlich Activate machen, genau. ONF Activate. Install. Das ist jetzt"}, {"id": 446, "start": 3908.84, "end": 3922.12, "text": "ein Python Gedöns, das kann man einfach durchklicken. Äh, wie viel Euro sind denn 50 Bits? Äh, ich"}, {"id": 447, "start": 3922.12, "end": 3927.32, "text": "hab gestern hat irgendjemand gesagt im Stream, ein Bit ist ein Cent. Weiß ich ob das stimmt."}, {"id": 448, "start": 3927.32, "end": 3951.96, "text": "Jedenfalls hast du hier alles. Huge Money hier. Massive. Next. Gamer3290, ich kann dir nicht"}, {"id": 449, "start": 3951.96, "end": 3968.92, "text": "ganz folgen. 500 Bits. Krasser Shit. Von Pruppi. Ist da, Pruppi, was ist denn das für"}, {"id": 450, "start": 3968.92, "end": 3975.32, "text": "ein Icon da neben dir? Direct Relief Charity. Oh, man kriegt jetzt, man kann sogar, man"}, {"id": 451, "start": 3975.32, "end": 3982.2, "text": "kann sogar Icons kriegen für, wahrscheinlich weil das irgendein Speedrun Marathon, oder?"}, {"id": 452, "start": 3982.2, "end": 3999.64, "text": "Interessant, wusste ich gar nicht, dass das geht. Okay, jetzt sind wir. Connect your robots."}, {"id": 453, "start": 3999.64, "end": 4005.76, "text": "Cover Handshake. Na das geht jetzt, Moment, das funktioniert jetzt also nicht. Das funktioniert"}, {"id": 454, "start": 4005.76, "end": 4012.64, "text": "ja so nicht. Ich muss jetzt ja erstmal mein Raspberry zu dem gleichen WLAN connecten,"}, {"id": 455, "start": 4012.64, "end": 4021.16, "text": "wie mache ich, Moment, wie mache ich das jetzt am besten? Mein Robo ist ja schon angemeldet"}, {"id": 456, "start": 4021.16, "end": 4026.76, "text": "am WLAN. Das heißt ich melde jetzt einfach den Raspberry am gleichen WLAN an wie der"}, {"id": 457, "start": 4026.76, "end": 4047.48, "text": "Robo und dann gucken wir mal. Probieren wir mal aus. Ja, machen wir mal. Dann müssen wir"}, {"id": 458, "start": 4047.48, "end": 4051.76, "text": "erstmal WLAN, WLAN verbinden. Achso, aber nee Leute, jetzt muss ich euch ja wieder ausschalten."}, {"id": 459, "start": 4051.76, "end": 4058.76, "text": "Jetzt muss ich euch ja wieder ausschalten, dass ihr mein WLAN Zeug nicht seht. Feels"}, {"id": 460, "start": 4058.76, "end": 4067.76, "text": "Batman. Ich switche euch einfach auf die andere Sache, auf die andere Seite rüber. Da habt"}, {"id": 461, "start": 4067.76, "end": 4085.36, "text": "ihr wenigstens, habt ihr wenigstens Chat und seid nicht so allein. Q Chat, ah ja, ja. Okay,"}, {"id": 462, "start": 4085.36, "end": 4110.16, "text": "Network Options, Wi-Fi, Wi-Fi, Wi-Fi. Germany. Also es dauert jetzt eine Minute, dann bin"}, {"id": 463, "start": 4110.16, "end": 4117.76, "text": "ich immer wieder am Start. Please enter SSID, please enter Password. Da muss ich jetzt mal"}, {"id": 464, "start": 4117.76, "end": 4124.56, "text": "nachgucken, weil ich muss jetzt erstmal auf meinen UniFi Controller. Oh, das wird jetzt"}, {"id": 465, "start": 4124.56, "end": 4129.76, "text": "ein bisschen kompliziert. Ich muss jetzt erstmal auf meinen UniFi Controller und die, die"}, {"id": 466, "start": 4129.76, "end": 4140.96, "text": "Client Isolation ausschalten, Isolation ausschalten. Sorry Leute, das braucht noch mal jetzt ein"}, {"id": 467, "start": 4140.96, "end": 4168.96, "text": "bisschen mehr, weil so viel, so viel liegt. Password not valid. Warum? Admin. Okay. Okay,"}, {"id": 468, "start": 4168.96, "end": 4197.76, "text": "Password. Sehr schön. Settings, Networks. Okay, WLAN Passwort brauchen wir jetzt noch."}, {"id": 469, "start": 4197.76, "end": 4219.76, "text": "Finish. Okay, jetzt soll er sich zum WLAN connecten. Wenn er sich zum WLAN connectet,"}, {"id": 470, "start": 4219.76, "end": 4227.06, "text": "kann ich euch wieder einschalten. Er hat sich zum WLAN connectet. Poggers. Okay, ich schalte"}, {"id": 471, "start": 4227.06, "end": 4252.76, "text": "euch wieder ein. Das ist ja hier kompliziert. Okay, also ich bin jetzt beim WLAN verbunden"}, {"id": 472, "start": 4252.76, "end": 4259.56, "text": "mit dem gleichen WLAN wie der, wie der Roboter, wie der, wie der Staubsaugerroboter. Ich gucke"}, {"id": 473, "start": 4259.56, "end": 4268.76, "text": "mal, ob es funktioniert. Gegen das Me. Be Discover. Es kann aber sein, dass es nicht"}, {"id": 474, "start": 4268.76, "end": 4280.76, "text": "funktioniert, weil ich noch die Client Isolation ausschalten muss. Achso, VNF Activate. Naja,"}, {"id": 475, "start": 4280.76, "end": 4290.76, "text": "geht nicht. Okay, Client Isolation ausschalten. Wo ging das jetzt noch mal? Ich habe jetzt"}, {"id": 476, "start": 4290.76, "end": 4311.76, "text": "abgekriegt gerade, oder? Steff Christ hier eins. Dankeschön. Ah, hier. Guest Policies"}, {"id": 477, "start": 4311.76, "end": 4313.76, "text": "ausschalten. Save. So, und jetzt konfiguriert er mein WLAN neu. Und dann sollte es gleich"}, {"id": 478, "start": 4313.76, "end": 4320.76, "text": "funktionieren. Okay, wir müssen noch zwei Minuten warten, dass das WLAN neu konfiguriert,"}, {"id": 479, "start": 4320.76, "end": 4337.76, "text": "dann ist gut. Naja, guck, der hat jetzt gerade keine WLAN Verbindung. Wir warten jetzt bis"}, {"id": 480, "start": 4337.76, "end": 4341.76, "text": "der wieder WLAN Verbindung hat und dann probieren wir das Ganze noch mal aus. Und mir ist gerade"}, {"id": 481, "start": 4341.76, "end": 4344.76, "text": "ein Problem, weil ich habe hier den Roboter auch gar nicht angeschaltet. Das hier Big"}, {"id": 482, "start": 4344.76, "end": 4351.76, "text": "Brain Move. Versuchen das Ding zu flashen, wenn er gar nicht angeschaltet ist. Hexor."}, {"id": 483, "start": 4351.76, "end": 4364.76, "text": "Elite Hacker Man. Twitch Prime. Naisu. Okay, ich schalte den Roboter schon mal ein. Kann"}, {"id": 484, "start": 4364.76, "end": 4371.76, "text": "nicht schaden, wenn wir den schon mal einschalten. Oh, fuck. Wo ist das? Alter, ich habe mein"}, {"id": 485, "start": 4371.76, "end": 4385.76, "text": "Audiointerface halt runtergeschmissen. Okay. Test, Test. Ja, das ist blöd, wenn man mit"}, {"id": 486, "start": 4385.76, "end": 4402.76, "text": "dem Stuhl und dem Headset auf durch den halben Raum fährt. Mick ist nicht gemutet, jebaited"}, {"id": 487, "start": 4402.76, "end": 4411.76, "text": "mich nicht. Mick ist nicht jebaited. Ich bin gerade mit dem Headset auf durch den halben"}, {"id": 488, "start": 4411.76, "end": 4422.76, "text": "Raum gefahren zum Staubsauger Roboter und habe das Zeug halt runtergeschmissen. Okay,"}, {"id": 489, "start": 4441.76, "end": 4451.76, "text": "Leute, der jebaited ist wirklich schlecht. Ich weiß, dass ihr mich hört. Okay, Staubsauger"}, {"id": 490, "start": 4451.76, "end": 4456.76, "text": "Roboter ist an. Raspberry hat auch wieder eine, hat auch wieder eine IP. So, und jetzt"}, {"id": 491, "start": 4456.76, "end": 4471.76, "text": "sehen wir mal, ob das funktioniert. Komm, komm an. Service Discovery Done. Und jetzt?"}, {"id": 492, "start": 4471.76, "end": 4493.76, "text": "Jetzt hätte es eigentlich funktionieren müssen. Warum geht das jetzt nicht? Warum geht das"}, {"id": 493, "start": 4493.76, "end": 4505.76, "text": "jetzt nicht? Ich habe doch keinen Token, ich habe keine Ahnung, wie man Token ist. Kann"}, {"id": 494, "start": 4505.76, "end": 4508.76, "text": "ich, ich versuche mal mit dem Ding direkt zu kommunizieren mit dem Roboter. Vielleicht"}, {"id": 495, "start": 4508.76, "end": 4514.96, "text": "ist er noch gar nicht an. Ich gucke mal meine DHCP-Lieses, ob der Roboter überhaupt an"}, {"id": 496, "start": 4514.96, "end": 4526.96, "text": "ist. Robo, Roborock, da ist er. 60, was hat er für eine IP? 60107. 60107. Ah, ich weiß,"}, {"id": 497, "start": 4526.96, "end": 4535.96, "text": "woran das liegt, Leute. Ich habe, ich habe eine Idee, woran das liegt. Ähm, wisst ihr,"}, {"id": 498, "start": 4535.96, "end": 4541.36, "text": "woran das liegen könnte? Ich habe mein Netzwerkkabel dran, ich habe mein Netzwerkkabel dran und"}, {"id": 499, "start": 4541.36, "end": 4546.56, "text": "ich habe WLAN-Verbindung aufgebaut. Also, das könnte sein, dass das Ding versucht,"}, {"id": 500, "start": 4546.56, "end": 4553.88, "text": "quasi bei mir im Netzwerk raus zu kommunizieren, anstatt, anstatt über WLAN. Dann, dann stöpsel"}, {"id": 501, "start": 4553.88, "end": 4557.44, "text": "ich WLAN-Netz ab, dann muss ich mich, nee, ich stöpsel, ich stöpsel, Alter, ich stöpsel"}, {"id": 502, "start": 4557.44, "end": 4565.12, "text": "WLAN ab. Also, easy, Leute, lass mal WLAN abstöpseln. Ähm, wir verbinden uns jetzt"}, {"id": 503, "start": 4565.12, "end": 4578.8, "text": "per SSH auf den Raspberry. Also, aus irgendwelchen Gründen nicht funktioniert. Doch. Und dann"}, {"id": 504, "start": 4578.8, "end": 4583.84, "text": "ziehe ich das Kabel raus. Ach, Quatsch. So, wir machen mal einen T-Max auf, wer weiß,"}, {"id": 505, "start": 4583.84, "end": 4599.28, "text": "dass das Ding nicht abkackt. Ähm, Roborock. Okay, ich ziehe, ich ziehe den Raspberry"}, {"id": 506, "start": 4599.28, "end": 4614.36, "text": "raus. Okay. Ähm, Raspberry ist draußen, keine IP mehr, alles gut. Ähm, Flasher, Activate,"}, {"id": 507, "start": 4614.36, "end": 4635.72, "text": "Achtung, C'mon, Bra. Ja! Bam! Funktioniert. Erst mal übelst ausflippen, er. Erst mal übelst"}, {"id": 508, "start": 4635.72, "end": 4661.4, "text": "ausflippen, er. Token. Token, äh. Token, äh. Token, äh. Token, äh. Token, äh. Token,"}, {"id": 509, "start": 4661.4, "end": 4687.76, "text": "ähm. Das Token sieht nicht korrekt aus. Moin, PSQL. Nee, nicht PS, doch PSQL. Ja,"}, {"id": 510, "start": 4687.76, "end": 4717.4, "text": "Ich meine, wir probieren es einfach mal aus."}, {"id": 511, "start": 4717.4, "end": 4729.32, "text": "Ich habe irgendwie meine Entfernentaste abgemacht."}, {"id": 512, "start": 4729.32, "end": 4749.24, "text": "IP ist 60107 und das Token ist updatefirmware,"}, {"id": 513, "start": 4749.24, "end": 4769.52, "text": "Updatefirmware, Image, Output, Polo S, PK, ob das jetzt funktioniert?"}, {"id": 514, "start": 4769.52, "end": 4785.88, "text": "On-Cast Smoke, macht der jetzt was?"}, {"id": 515, "start": 4799.52, "end": 4822.16, "text": "Hast du den Schaubsauger gesettet?"}, {"id": 516, "start": 4822.16, "end": 4829.92, "text": "Ne, ich habe eine Idee, man kann sich bestimmt im aktuellen Webinterface das Token anzeigen"}, {"id": 517, "start": 4829.92, "end": 4830.92, "text": "lassen."}, {"id": 518, "start": 4830.92, "end": 4846.72, "text": "60107, Settings, Token, ah, huge, ich glaube mit dem Token kann man nicht allzu viel anfangen."}, {"id": 519, "start": 4846.72, "end": 4864.64, "text": "Updatefirmware, ist das das offizielle Token, das ist das Token von meinem Schaubsauger,"}, {"id": 520, "start": 4864.64, "end": 4865.92, "text": "offizieller gehts nicht mehr."}, {"id": 521, "start": 4865.92, "end": 4881.92, "text": "Okay, die machen das von einem Verzeichnis oben drüber, machen wir jetzt auch einfach"}, {"id": 522, "start": 4881.92, "end": 4882.92, "text": "mal."}, {"id": 523, "start": 4882.92, "end": 4896.44, "text": "Okay Leute, bless RNG, Moment, das haben wir gar nicht, bless RNG, das muss ich noch hinzufügen,"}, {"id": 524, "start": 4896.44, "end": 4924.8, "text": "das muss ich hier nicht, bless RNG, den brauchen wir noch, Color transparent, okay, okay, okay,"}, {"id": 525, "start": 4924.8, "end": 4953.0, "text": "er spricht, er spricht, er hat mit mir gesprochen, der Schaubsauger, no request was made, okay,"}, {"id": 526, "start": 4953.0, "end": 4971.68, "text": "okay, noch mal, oh Leute, habt ihr es gehört, habt ihr es gehört, ich versuche euch das"}, {"id": 527, "start": 4971.68, "end": 4989.96, "text": "mal so, dass man es hören kann, wartet mal kurz, ich stöpsel mich mal kurz ab und entwirre"}, {"id": 528, "start": 4989.96, "end": 5009.04, "text": "mein Mikro, da fällt auch mein Audiointerface nicht mehr runter, so, jetzt Achtung, passt"}, {"id": 529, "start": 5009.04, "end": 5011.96, "text": "mal auf was er sagt, ich glaube wir haben nämlich schon ein Problem, ich halte euch"}, {"id": 530, "start": 5011.96, "end": 5030.76, "text": "jetzt mal ran, sodass ihr das hört, habts ihr es gehört, der Akkustand ist zu niedrig,"}, {"id": 531, "start": 5030.76, "end": 5054.28, "text": "hört man das echt nicht, der hat gerade gesagt, der Akkustand ist zu niedrig, so, jetzt habe"}, {"id": 532, "start": 5054.28, "end": 5083.92, "text": "ich euch dran gehalten, Akkustand ist zu niedrig, das sagt natürlich, Staubsauger waifu, ja,"}, {"id": 533, "start": 5083.92, "end": 5096.12, "text": "was machen wir jetzt, ich würde sagen, ich hole mal die Ladestation von unten und setze"}, {"id": 534, "start": 5096.12, "end": 5102.56, "text": "ihn auf die Ladestation, vielleicht darf man nämlich updaten, wenn er lädt, okay, ich"}, {"id": 535, "start": 5102.56, "end": 5104.56, "text": "Ich bin jetzt 2 Minuten wieder da."}, {"id": 536, "start": 5104.56, "end": 5126.56, "text": "Ich bleibe wieder da."}, {"id": 537, "start": 5134.56, "end": 5154.56, "text": "Ich bleibe wieder da."}, {"id": 538, "start": 5154.56, "end": 5170.56, "text": "Ich bleibe wieder da."}, {"id": 539, "start": 5170.56, "end": 5195.56, "text": "Ich bleibe wieder da."}, {"id": 540, "start": 5195.56, "end": 5220.56, "text": "Ich bleibe wieder da."}, {"id": 541, "start": 5220.56, "end": 5239.56, "text": "Ich bleibe wieder da."}, {"id": 542, "start": 5239.56, "end": 5254.56, "text": "Ich bin wieder da."}, {"id": 543, "start": 5254.56, "end": 5279.56, "text": "Ich bleibe wieder da."}, {"id": 544, "start": 5279.56, "end": 5304.56, "text": "Ich bleibe wieder da."}, {"id": 545, "start": 5304.56, "end": 5326.56, "text": "Ich bleibe wieder da."}, {"id": 546, "start": 5326.56, "end": 5345.56, "text": "Ich bleibe wieder da."}, {"id": 547, "start": 5345.56, "end": 5360.56, "text": "Ich bleibe wieder da."}, {"id": 548, "start": 5360.56, "end": 5388.56, "text": "Ich bleibe wieder da."}, {"id": 549, "start": 5388.56, "end": 5410.56, "text": "Ich bleibe wieder da."}, {"id": 550, "start": 5410.56, "end": 5432.56, "text": "Ich bleibe wieder da."}, {"id": 551, "start": 5432.56, "end": 5447.56, "text": "Ich bleibe wieder da."}, {"id": 552, "start": 5447.56, "end": 5462.56, "text": "Ich bleibe wieder da."}, {"id": 553, "start": 5462.56, "end": 5477.56, "text": "Ich bleibe wieder da."}, {"id": 554, "start": 5477.56, "end": 5492.56, "text": "Ich bleibe wieder da."}, {"id": 555, "start": 5492.56, "end": 5507.56, "text": "Ich bleibe wieder da."}, {"id": 556, "start": 5507.56, "end": 5522.56, "text": "Ich bleibe wieder da."}, {"id": 557, "start": 5522.56, "end": 5537.56, "text": "Ich bleibe wieder da."}, {"id": 558, "start": 5537.56, "end": 5552.56, "text": "Ich bleibe wieder da."}, {"id": 559, "start": 5552.56, "end": 5567.56, "text": "Ich bleibe wieder da."}, {"id": 560, "start": 5567.56, "end": 5582.56, "text": "Ich bleibe wieder da."}, {"id": 561, "start": 5582.56, "end": 5597.56, "text": "Ich bleibe wieder da."}, {"id": 562, "start": 5597.56, "end": 5612.56, "text": "Ich bleibe wieder da."}, {"id": 563, "start": 5612.56, "end": 5627.56, "text": "Ich bleibe wieder da."}, {"id": 564, "start": 5627.56, "end": 5642.56, "text": "Ich bleibe wieder da."}, {"id": 565, "start": 5642.56, "end": 5657.56, "text": "Ich bleibe wieder da."}, {"id": 566, "start": 5657.56, "end": 5672.56, "text": "Ich bleibe wieder da."}, {"id": 567, "start": 5672.56, "end": 5687.56, "text": "Ich bleibe wieder da."}, {"id": 568, "start": 5687.56, "end": 5702.56, "text": "Ich bleibe wieder da."}, {"id": 569, "start": 5702.56, "end": 5717.56, "text": "Ich bleibe wieder da."}, {"id": 570, "start": 5717.56, "end": 5732.56, "text": "Ich bleibe wieder da."}, {"id": 571, "start": 5732.56, "end": 5747.56, "text": "Ich bleibe wieder da."}, {"id": 572, "start": 5747.56, "end": 5762.56, "text": "Ich bleibe wieder da."}, {"id": 573, "start": 5762.56, "end": 5777.56, "text": "Ich bleibe wieder da."}, {"id": 574, "start": 5792.56, "end": 5807.56, "text": "Ich bleibe wieder da."}, {"id": 575, "start": 5807.56, "end": 5822.56, "text": "Ich bleibe wieder da."}, {"id": 576, "start": 5822.56, "end": 5837.56, "text": "Ich bleibe wieder da."}, {"id": 577, "start": 5837.56, "end": 5852.56, "text": "Ich bleibe wieder da."}, {"id": 578, "start": 5852.56, "end": 5867.56, "text": "Ich bleibe wieder da."}, {"id": 579, "start": 5867.56, "end": 5882.56, "text": "Ich bleibe wieder da."}, {"id": 580, "start": 5882.56, "end": 5897.56, "text": "Ich bleibe wieder da."}, {"id": 581, "start": 5897.56, "end": 5912.56, "text": "Ich bleibe wieder da."}, {"id": 582, "start": 5912.56, "end": 5927.56, "text": "Ich bleibe wieder da."}, {"id": 583, "start": 5927.56, "end": 5942.56, "text": "Ich bleibe wieder da."}, {"id": 584, "start": 5942.56, "end": 5957.56, "text": "Ich bleibe wieder da."}, {"id": 585, "start": 5957.56, "end": 5972.56, "text": "Ich bleibe wieder da."}, {"id": 586, "start": 5972.56, "end": 5987.56, "text": "Ich bleibe wieder da."}, {"id": 587, "start": 5987.56, "end": 6002.56, "text": "Ich bleibe wieder da."}, {"id": 588, "start": 6002.56, "end": 6017.56, "text": "Ich bleibe wieder da."}, {"id": 589, "start": 6017.56, "end": 6032.56, "text": "Ich bleibe wieder da."}, {"id": 590, "start": 6032.56, "end": 6047.56, "text": "Ich bleibe wieder da."}, {"id": 591, "start": 6047.56, "end": 6062.56, "text": "Ich bleibe wieder da."}, {"id": 592, "start": 6062.56, "end": 6077.56, "text": "Ich bleibe wieder da."}, {"id": 593, "start": 6077.56, "end": 6092.56, "text": "Ich bleibe wieder da."}, {"id": 594, "start": 6092.56, "end": 6107.56, "text": "Ich bleibe wieder da."}, {"id": 595, "start": 6107.56, "end": 6122.56, "text": "Ich bleibe wieder da."}, {"id": 596, "start": 6122.56, "end": 6137.56, "text": "Ich bleibe wieder da."}, {"id": 597, "start": 6137.56, "end": 6152.56, "text": "Ich bleibe wieder da."}, {"id": 598, "start": 6152.56, "end": 6167.56, "text": "Ich bleibe wieder da."}, {"id": 599, "start": 6167.56, "end": 6182.56, "text": "Ich bleibe wieder da."}, {"id": 600, "start": 6182.56, "end": 6197.56, "text": "Ich bleibe wieder da."}, {"id": 601, "start": 6197.56, "end": 6212.56, "text": "Ich bleibe wieder da."}, {"id": 602, "start": 6212.56, "end": 6227.56, "text": "Ich bleibe wieder da."}, {"id": 603, "start": 6227.56, "end": 6242.56, "text": "Ich bleibe wieder da."}, {"id": 604, "start": 6242.56, "end": 6257.56, "text": "Ich bleibe wieder da."}, {"id": 605, "start": 6257.56, "end": 6272.56, "text": "Ich bleibe wieder da."}, {"id": 606, "start": 6272.56, "end": 6287.56, "text": "Ich bleibe wieder da."}, {"id": 607, "start": 6287.56, "end": 6302.56, "text": "Ich bleibe wieder da."}, {"id": 608, "start": 6302.56, "end": 6317.56, "text": "Ich bleibe wieder da."}, {"id": 609, "start": 6317.56, "end": 6332.56, "text": "Ich bleibe wieder da."}, {"id": 610, "start": 6332.56, "end": 6347.56, "text": "Ich bleibe wieder da."}, {"id": 611, "start": 6347.56, "end": 6362.56, "text": "Ich bleibe wieder da."}, {"id": 612, "start": 6362.56, "end": 6377.56, "text": "Ich bleibe wieder da."}, {"id": 613, "start": 6377.56, "end": 6392.56, "text": "Ich bleibe wieder da."}, {"id": 614, "start": 6392.56, "end": 6407.56, "text": "Ich bleibe wieder da."}, {"id": 615, "start": 6407.56, "end": 6422.56, "text": "Ich bleibe wieder da."}, {"id": 616, "start": 6422.56, "end": 6437.56, "text": "Ich bleibe wieder da."}, {"id": 617, "start": 6437.56, "end": 6452.56, "text": "Ich bleibe wieder da."}, {"id": 618, "start": 6452.56, "end": 6467.56, "text": "Ich bleibe wieder da."}, {"id": 619, "start": 6467.56, "end": 6482.56, "text": "Ich bleibe wieder da."}, {"id": 620, "start": 6482.56, "end": 6497.56, "text": "Ich bleibe wieder da."}, {"id": 621, "start": 6497.56, "end": 6512.56, "text": "Ich bleibe wieder da."}, {"id": 622, "start": 6512.56, "end": 6527.56, "text": "Ich bleibe wieder da."}, {"id": 623, "start": 6527.56, "end": 6542.56, "text": "Ich bleibe wieder da."}, {"id": 624, "start": 6542.56, "end": 6557.56, "text": "Ich bleibe wieder da."}, {"id": 625, "start": 6557.56, "end": 6572.56, "text": "Ich bleibe wieder da."}, {"id": 626, "start": 6572.56, "end": 6587.56, "text": "Ich bleibe wieder da."}, {"id": 627, "start": 6587.56, "end": 6602.56, "text": "Ich bleibe wieder da."}, {"id": 628, "start": 6602.56, "end": 6617.56, "text": "Ich bleibe wieder da."}, {"id": 629, "start": 6617.56, "end": 6632.56, "text": "Ich bleibe wieder da."}, {"id": 630, "start": 6632.56, "end": 6647.56, "text": "Ich bleibe wieder da."}, {"id": 631, "start": 6647.56, "end": 6662.56, "text": "Ich bleibe wieder da."}, {"id": 632, "start": 6662.56, "end": 6677.56, "text": "Ich bleibe wieder da."}, {"id": 633, "start": 6677.56, "end": 6692.56, "text": "Ich bleibe wieder da."}, {"id": 634, "start": 6692.56, "end": 6707.56, "text": "Ich bleibe wieder da."}, {"id": 635, "start": 6707.56, "end": 6722.56, "text": "Ich bleibe wieder da."}, {"id": 636, "start": 6722.56, "end": 6737.56, "text": "Ich bleibe wieder da."}, {"id": 637, "start": 6737.56, "end": 6752.56, "text": "Ich bleibe wieder da."}, {"id": 638, "start": 6752.56, "end": 6767.56, "text": "Ich bleibe wieder da."}, {"id": 639, "start": 6767.56, "end": 6782.56, "text": "Ich bleibe wieder da."}, {"id": 640, "start": 6782.56, "end": 6797.56, "text": "Ich bleibe wieder da."}, {"id": 641, "start": 6797.56, "end": 6812.56, "text": "Ich bleibe wieder da."}, {"id": 642, "start": 6812.56, "end": 6827.56, "text": "Ich bleibe wieder da."}, {"id": 643, "start": 6827.56, "end": 6842.56, "text": "Ich bleibe wieder da."}, {"id": 644, "start": 6842.56, "end": 6857.56, "text": "Ich bleibe wieder da."}, {"id": 645, "start": 6857.56, "end": 6872.56, "text": "Ich bleibe wieder da."}, {"id": 646, "start": 6872.56, "end": 6887.56, "text": "Ich bleibe wieder da."}, {"id": 647, "start": 6887.56, "end": 6902.56, "text": "Ich bleibe wieder da."}, {"id": 648, "start": 6902.56, "end": 6917.56, "text": "Ich bleibe wieder da."}, {"id": 649, "start": 6917.56, "end": 6932.56, "text": "Ich bleibe wieder da."}, {"id": 650, "start": 6932.56, "end": 6947.56, "text": "Ich bleibe wieder da."}, {"id": 651, "start": 6947.56, "end": 6962.56, "text": "Ich bleibe wieder da."}, {"id": 652, "start": 6962.56, "end": 6977.56, "text": "Ich bleibe wieder da."}, {"id": 653, "start": 6977.56, "end": 6992.56, "text": "Ich bleibe wieder da."}, {"id": 654, "start": 6992.56, "end": 7007.56, "text": "Ich bleibe wieder da."}, {"id": 655, "start": 7007.56, "end": 7022.56, "text": "Ich bleibe wieder da."}, {"id": 656, "start": 7022.56, "end": 7037.56, "text": "Ich bleibe wieder da."}, {"id": 657, "start": 7037.56, "end": 7052.56, "text": "Ich bleibe wieder da."}, {"id": 658, "start": 7052.56, "end": 7067.56, "text": "Ich bleibe wieder da."}, {"id": 659, "start": 7067.56, "end": 7082.56, "text": "Ich bleibe wieder da."}, {"id": 660, "start": 7082.56, "end": 7097.56, "text": "Ich bleibe wieder da."}, {"id": 661, "start": 7097.56, "end": 7112.56, "text": "Ich bleibe wieder da."}, {"id": 662, "start": 7112.56, "end": 7127.56, "text": "Ich bleibe wieder da."}, {"id": 663, "start": 7127.56, "end": 7142.56, "text": "Ich bleibe wieder da."}, {"id": 664, "start": 7142.56, "end": 7157.56, "text": "Ich bleibe wieder da."}, {"id": 665, "start": 7157.56, "end": 7172.56, "text": "Ich bleibe wieder da."}, {"id": 666, "start": 7172.56, "end": 7187.56, "text": "Ich bleibe wieder da."}, {"id": 667, "start": 7187.56, "end": 7202.56, "text": "Ich bleibe wieder da."}, {"id": 668, "start": 7202.56, "end": 7217.56, "text": "Ich bleibe wieder da."}, {"id": 669, "start": 7217.56, "end": 7232.56, "text": "Ich bleibe wieder da."}, {"id": 670, "start": 7232.56, "end": 7247.56, "text": "Ich bleibe wieder da."}, {"id": 671, "start": 7247.56, "end": 7262.56, "text": "Ich bleibe wieder da."}, {"id": 672, "start": 7262.56, "end": 7277.56, "text": "Ich bleibe wieder da."}, {"id": 673, "start": 7277.56, "end": 7292.56, "text": "Ich bleibe wieder da."}, {"id": 674, "start": 7292.56, "end": 7307.56, "text": "Ich bleibe wieder da."}, {"id": 675, "start": 7307.56, "end": 7322.56, "text": "Ich bleibe wieder da."}, {"id": 676, "start": 7322.56, "end": 7337.56, "text": "Ich bleibe wieder da."}, {"id": 677, "start": 7337.56, "end": 7352.56, "text": "Ich bleibe wieder da."}, {"id": 678, "start": 7352.56, "end": 7367.56, "text": "Ich bleibe wieder da."}, {"id": 679, "start": 7367.56, "end": 7382.56, "text": "Ich bleibe wieder da."}, {"id": 680, "start": 7382.56, "end": 7397.56, "text": "Ich bleibe wieder da."}, {"id": 681, "start": 7397.56, "end": 7412.56, "text": "Ich bleibe wieder da."}, {"id": 682, "start": 7412.56, "end": 7427.56, "text": "Ich bleibe wieder da."}, {"id": 683, "start": 7427.56, "end": 7442.56, "text": "Ich bleibe wieder da."}, {"id": 684, "start": 7442.56, "end": 7457.56, "text": "Ich bleibe wieder da."}, {"id": 685, "start": 7457.56, "end": 7472.56, "text": "Ich bleibe wieder da."}, {"id": 686, "start": 7472.56, "end": 7487.56, "text": "Ich bleibe wieder da."}, {"id": 687, "start": 7487.56, "end": 7502.56, "text": "Ich bleibe wieder da."}, {"id": 688, "start": 7502.56, "end": 7517.56, "text": "Ich bleibe wieder da."}, {"id": 689, "start": 7517.56, "end": 7532.56, "text": "Ich bleibe wieder da."}, {"id": 690, "start": 7532.56, "end": 7547.56, "text": "Ich bleibe wieder da."}, {"id": 691, "start": 7547.56, "end": 7562.56, "text": "Ich bleibe wieder da."}, {"id": 692, "start": 7562.56, "end": 7577.56, "text": "Ich bleibe wieder da."}, {"id": 693, "start": 7577.56, "end": 7592.56, "text": "Ich bleibe wieder da."}, {"id": 694, "start": 7592.56, "end": 7607.56, "text": "Ich bleibe wieder da."}, {"id": 695, "start": 7607.56, "end": 7622.56, "text": "Ich bleibe wieder da."}, {"id": 696, "start": 7622.56, "end": 7637.56, "text": "Ich bleibe wieder da."}, {"id": 697, "start": 7637.56, "end": 7652.56, "text": "Ich bleibe wieder da."}, {"id": 698, "start": 7652.56, "end": 7667.56, "text": "Ich bleibe wieder da."}, {"id": 699, "start": 7667.56, "end": 7682.56, "text": "Ich bleibe wieder da."}, {"id": 700, "start": 7682.56, "end": 7697.56, "text": "Ich bleibe wieder da."}, {"id": 701, "start": 7697.56, "end": 7712.56, "text": "Ich bleibe wieder da."}, {"id": 702, "start": 7712.56, "end": 7727.56, "text": "Ich bleibe wieder da."}, {"id": 703, "start": 7727.56, "end": 7742.56, "text": "Ich bleibe wieder da."}, {"id": 704, "start": 7742.56, "end": 7757.56, "text": "Ich bleibe wieder da."}, {"id": 705, "start": 7757.56, "end": 7772.56, "text": "Ich bleibe wieder da."}, {"id": 706, "start": 7772.56, "end": 7787.56, "text": "Ich bleibe wieder da."}, {"id": 707, "start": 7787.56, "end": 7802.56, "text": "Ich bleibe wieder da."}, {"id": 708, "start": 7802.56, "end": 7817.56, "text": "Ich bleibe wieder da."}, {"id": 709, "start": 7817.56, "end": 7832.56, "text": "Ich bleibe wieder da."}, {"id": 710, "start": 7832.56, "end": 7847.56, "text": "Ich bleibe wieder da."}, {"id": 711, "start": 7847.56, "end": 7862.56, "text": "Ich bleibe wieder da."}, {"id": 712, "start": 7862.56, "end": 7877.56, "text": "Ich bleibe wieder da."}, {"id": 713, "start": 7877.56, "end": 7892.56, "text": "Ich bleibe wieder da."}, {"id": 714, "start": 7892.56, "end": 7907.56, "text": "Ich bleibe wieder da."}, {"id": 715, "start": 7907.56, "end": 7922.56, "text": "Ich bleibe wieder da."}, {"id": 716, "start": 7922.56, "end": 7937.56, "text": "Ich bleibe wieder da."}, {"id": 717, "start": 7937.56, "end": 7952.56, "text": "Ich bleibe wieder da."}, {"id": 718, "start": 7952.56, "end": 7967.56, "text": "Ich bleibe wieder da."}, {"id": 719, "start": 7967.56, "end": 7982.56, "text": "Ich bleibe wieder da."}, {"id": 720, "start": 7982.56, "end": 7997.56, "text": "Ich bleibe wieder da."}, {"id": 721, "start": 7997.56, "end": 8012.56, "text": "Ich bleibe wieder da."}, {"id": 722, "start": 8012.56, "end": 8027.56, "text": "Ich bleibe wieder da."}, {"id": 723, "start": 8027.56, "end": 8042.56, "text": "Ich bleibe wieder da."}, {"id": 724, "start": 8042.56, "end": 8057.56, "text": "Ich bleibe wieder da."}, {"id": 725, "start": 8057.56, "end": 8072.56, "text": "Ich bleibe wieder da."}, {"id": 726, "start": 8072.56, "end": 8087.56, "text": "Ich bleibe wieder da."}, {"id": 727, "start": 8087.56, "end": 8102.56, "text": "Ich bleibe wieder da."}, {"id": 728, "start": 8102.56, "end": 8117.56, "text": "Ich bleibe wieder da."}, {"id": 729, "start": 8117.56, "end": 8132.56, "text": "Ich bleibe wieder da."}, {"id": 730, "start": 8132.56, "end": 8147.56, "text": "Ich bleibe wieder da."}, {"id": 731, "start": 8147.56, "end": 8162.56, "text": "Ich bleibe wieder da."}, {"id": 732, "start": 8162.56, "end": 8177.56, "text": "Ich bleibe wieder da."}, {"id": 733, "start": 8177.56, "end": 8192.56, "text": "Ich bleibe wieder da."}, {"id": 734, "start": 8192.56, "end": 8207.56, "text": "Ich bleibe wieder da."}, {"id": 735, "start": 8207.56, "end": 8222.56, "text": "Ich bleibe wieder da."}, {"id": 736, "start": 8222.56, "end": 8237.56, "text": "Ich bleibe wieder da."}, {"id": 737, "start": 8237.56, "end": 8252.56, "text": "Ich bleibe wieder da."}, {"id": 738, "start": 8252.56, "end": 8267.56, "text": "Ich bleibe wieder da."}, {"id": 739, "start": 8267.56, "end": 8282.56, "text": "Ich bleibe wieder da."}, {"id": 740, "start": 8282.56, "end": 8297.56, "text": "Ich bleibe wieder da."}, {"id": 741, "start": 8297.56, "end": 8312.56, "text": "Ich bleibe wieder da."}, {"id": 742, "start": 8312.56, "end": 8327.56, "text": "Ich bleibe wieder da."}, {"id": 743, "start": 8327.56, "end": 8342.56, "text": "Ich bleibe wieder da."}, {"id": 744, "start": 8342.56, "end": 8357.56, "text": "Ich bleibe wieder da."}, {"id": 745, "start": 8357.56, "end": 8372.56, "text": "Ich bleibe wieder da."}, {"id": 746, "start": 8372.56, "end": 8387.56, "text": "Ich bleibe wieder da."}, {"id": 747, "start": 8387.56, "end": 8402.56, "text": "Ich bleibe wieder da."}, {"id": 748, "start": 8402.56, "end": 8417.56, "text": "Ich bleibe wieder da."}, {"id": 749, "start": 8417.56, "end": 8432.56, "text": "Ich bleibe wieder da."}, {"id": 750, "start": 8432.56, "end": 8447.56, "text": "Ich bleibe wieder da."}, {"id": 751, "start": 8447.56, "end": 8462.56, "text": "Ich bleibe wieder da."}, {"id": 752, "start": 8462.56, "end": 8477.56, "text": "Ich bleibe wieder da."}, {"id": 753, "start": 8477.56, "end": 8492.56, "text": "Ich bleibe wieder da."}, {"id": 754, "start": 8492.56, "end": 8507.56, "text": "Ich bleibe wieder da."}, {"id": 755, "start": 8507.56, "end": 8522.56, "text": "Ich bleibe wieder da."}, {"id": 756, "start": 8522.56, "end": 8537.56, "text": "Ich bleibe wieder da."}, {"id": 757, "start": 8537.56, "end": 8552.56, "text": "Ich bleibe wieder da."}, {"id": 758, "start": 8552.56, "end": 8567.56, "text": "Ich bleibe wieder da."}, {"id": 759, "start": 8567.56, "end": 8582.56, "text": "Ich bleibe wieder da."}, {"id": 760, "start": 8582.56, "end": 8597.56, "text": "Ich bleibe wieder da."}, {"id": 761, "start": 8597.56, "end": 8612.56, "text": "Ich bleibe wieder da."}, {"id": 762, "start": 8612.56, "end": 8627.56, "text": "Ich bleibe wieder da."}, {"id": 763, "start": 8627.56, "end": 8642.56, "text": "Ich bleibe wieder da."}, {"id": 764, "start": 8642.56, "end": 8657.56, "text": "Ich bleibe wieder da."}, {"id": 765, "start": 8657.56, "end": 8672.56, "text": "Ich bleibe wieder da."}, {"id": 766, "start": 8672.56, "end": 8687.56, "text": "Ich bleibe wieder da."}, {"id": 767, "start": 8687.56, "end": 8702.56, "text": "Ich bleibe wieder da."}, {"id": 768, "start": 8702.56, "end": 8717.56, "text": "Ich bleibe wieder da."}, {"id": 769, "start": 8717.56, "end": 8732.56, "text": "Ich bleibe wieder da."}, {"id": 770, "start": 8732.56, "end": 8747.56, "text": "Ich bleibe wieder da."}, {"id": 771, "start": 8747.56, "end": 8762.56, "text": "Ich bleibe wieder da."}, {"id": 772, "start": 8762.56, "end": 8777.56, "text": "Ich bleibe wieder da."}, {"id": 773, "start": 8777.56, "end": 8792.56, "text": "Ich bleibe wieder da."}, {"id": 774, "start": 8792.56, "end": 8807.56, "text": "Ich bleibe wieder da."}, {"id": 775, "start": 8807.56, "end": 8822.56, "text": "Ich bleibe wieder da."}, {"id": 776, "start": 8822.56, "end": 8837.56, "text": "Ich bleibe wieder da."}, {"id": 777, "start": 8837.56, "end": 8852.56, "text": "Ich bleibe wieder da."}, {"id": 778, "start": 8852.56, "end": 8867.56, "text": "Ich bleibe wieder da."}, {"id": 779, "start": 8867.56, "end": 8882.56, "text": "Ich bleibe wieder da."}, {"id": 780, "start": 8882.56, "end": 8897.56, "text": "Ich bleibe wieder da."}, {"id": 781, "start": 8897.56, "end": 8912.56, "text": "Ich bleibe wieder da."}, {"id": 782, "start": 8912.56, "end": 8927.56, "text": "Ich bleibe wieder da."}, {"id": 783, "start": 8927.56, "end": 8942.56, "text": "Ich bleibe wieder da."}, {"id": 784, "start": 8942.56, "end": 8957.56, "text": "Ich bleibe wieder da."}, {"id": 785, "start": 8957.56, "end": 8972.56, "text": "Ich bleibe wieder da."}, {"id": 786, "start": 8972.56, "end": 8987.56, "text": "Ich bleibe wieder da."}, {"id": 787, "start": 8987.56, "end": 9002.56, "text": "Ich bleibe wieder da."}, {"id": 788, "start": 9002.56, "end": 9017.56, "text": "Ich bleibe wieder da."}, {"id": 789, "start": 9017.56, "end": 9032.56, "text": "Ich bleibe wieder da."}, {"id": 790, "start": 9032.56, "end": 9047.56, "text": "Ich bleibe wieder da."}, {"id": 791, "start": 9047.56, "end": 9062.56, "text": "Ich bleibe wieder da."}, {"id": 792, "start": 9062.56, "end": 9077.56, "text": "Ich bleibe wieder da."}, {"id": 793, "start": 9077.56, "end": 9092.56, "text": "Ich bleibe wieder da."}, {"id": 794, "start": 9092.56, "end": 9107.56, "text": "Ich bleibe wieder da."}, {"id": 795, "start": 9107.56, "end": 9122.56, "text": "Ich bleibe wieder da."}, {"id": 796, "start": 9122.56, "end": 9137.56, "text": "Ich bleibe wieder da."}, {"id": 797, "start": 9137.56, "end": 9152.56, "text": "Ich bleibe wieder da."}, {"id": 798, "start": 9152.56, "end": 9167.56, "text": "Ich bleibe wieder da."}, {"id": 799, "start": 9167.56, "end": 9182.56, "text": "Ich bleibe wieder da."}, {"id": 800, "start": 9182.56, "end": 9197.56, "text": "Ich bleibe wieder da."}, {"id": 801, "start": 9197.56, "end": 9212.56, "text": "Ich bleibe wieder da."}, {"id": 802, "start": 9212.56, "end": 9227.56, "text": "Ich bleibe wieder da."}, {"id": 803, "start": 9227.56, "end": 9242.56, "text": "Ich bleibe wieder da."}, {"id": 804, "start": 9242.56, "end": 9257.56, "text": "Ich bleibe wieder da."}, {"id": 805, "start": 9257.56, "end": 9272.56, "text": "Ich bleibe wieder da."}, {"id": 806, "start": 9272.56, "end": 9287.56, "text": "Ich bleibe wieder da."}, {"id": 807, "start": 9287.56, "end": 9302.56, "text": "Ich bleibe wieder da."}]}