{"text": "N-n-n-nice, nice! N-n-n-nice, nice! N-n-n-nice, nice! N-n-n-nice, nice! N-n-n-nice, nice! N-n-n-nice, nice! N-n-n-nice, nice! N-n-n-nice, nice! N-n-n-nice, nice! N-n-n-nice, nice! N-n-n-nice, nice! N-n-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-n-nice, nice! N-n-n-nice, nice! N-n-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-n-nice, nice! N-nice, nice! N-n-nice, nice! N-nice, nice! N-n-nice, nice! N-nice, nice! N-nice, nice! N-nice, nice! N-nice, nice! N-n-nice! N-n-nice! N-n-nice! N-nice! N-nice, nice! N-n-nice! N-nice, nice! Ich wollte nicht den hier abspielen Oktober 2018 habe ich ein Video zu 9900K gemacht, den geköpft, als der neu auf den Markt kam Oh ja, das habe ich geguckt Das ist das Video, wo ich mir abgeguckt habe, wie man 8700K köpft Furchtbar eingeköpft habe Und dann habe ich eben analysiert, warum das so ist und Intel oder die Art wie Intel Und er hat damals auch gesagt, ich kenne das Video noch, er hat damals auch gesagt, wie scheiße das ist, dass Intel den Kram nicht verlötet Und damals haben sich wahrscheinlich alle aufgeregt, alter, kack, kack AMD Fanboy oder sowas Und jetzt ist es umgedreht, so hängen geblieben Der Video verlötet ist halt so, wenn man die köpft, dann holt man halt trotzdem 8-9 Grad raus Auch das hat Intel nicht gefallen Das könnt ihr mir glauben August 2018 habe ich 8 Videos gebracht zum Thema Epic Overclocking Ein Thema, was mir persönlich sehr viel Spaß gemacht hat Was ist das da unten? Sieht aus wie auf irgendwie, wie in so einem Freizeitpark so eine Wasserrutsche oder so Nicht so sehr, weil die natürlich nicht wollten, dass man AMD, Epic oder Server CPUs übertaktet Leider wurde dem ganzen auch ein Riegel vorgeschoben, also diese Sicherheitslücke, die wir genutzt haben Da fuck, was ist das? Ist das flüssig? Ist das hier wieder Stickstoff oder was ist das? Oder was macht der da? Also es ist keine Sicherheitslücke, aber die Lücke, die wir genutzt haben, um die Epic CPUs zu übertakken, die wurde leider geschlossen Also bei den kommenden CPUs ist es so leider nicht mehr möglich Strömungstest, okay Dann April 2018 habe ich Zen Plus, also den 2700X geköpft Zum Beispiel da habe ich auch gesagt, ey, Top verlötet, lohnt sich nicht, macht es nicht Januar 2018, ein großes Thema Thread-Typer gegen Epic Da war auch wieder so, da kam das den Leuten so vor, der macht so richtig krassen Content die ganze Zeit gegen Thread-Typer Angefangen hat dieses ganze Thema nur, ich hatte einen Thread-Typer vor Lounge, nicht von AMD, aber ich hatte einen vor Lounge Und dann habe ich den geköpft Und dann habe ich ein Video dazu gemacht, habe AMD gefragt, ey, es ist doch nächste Woche, dieses Embargo wird aufgehoben, dass wir Unboxings zeigen dürfen Da habe ich gesagt, worunter fällt eine CPU Köpfen? Ich zeige ja keine Leistung, ich öffne ja nur die CPU-Feld, das ist unter Unboxing Sagt AMD zu mir, ja, kannst du posten Poste ich das Video, ein Tag später schreibt mir AMD, dieses Video muss sofort offline Das ist so geil, das hast du öfters, dass sie nicht genau wissen Also ich weiß nicht, was das Standard ist bei AMD Aber so hin und her hatte ich damals auch bei, muss ich ein bisschen ausholen, EA hatte damals die erste Iteration ihrer Creator-Plattform RonKu hieß das damals Und da waren sie sich mit den Regeln für ihre Videos auch teilweise nicht so ganz einig So, wenn man da viel Zeit rein investiert und auch Geld in solche Videos Und dann, wenn nur ein Teil der Views entstanden ist und man wird gezwungen, das offline zu nehmen Während alle anderen Medien, das schon aufgegriffen haben, sich das im Internet verteilt Dann ist es natürlich total dämlich, das Video offline zu nehmen, musste ich dann aber tun Und dann kam dann zum Beispiel von AMD ein Statement, weil ich hatte dann gesagt, okay, hier sind vier Chips drauf auf den 30-Bit-CPUs Deswegen ist es wahrscheinlich technisch identisch zu Epic Oder es kommt halt entweder noch ein 32-Kanon-Threadripper, weil es gab einfach technisch gesehen keine andere logische Erklärung Warum sollte man vier Chips drauf machen, wenn man die Hälfte davon quasi verschwendet Die einzige logische Erklärung war, es ist ein 32-Kanon-Threadripper Kam AMD Statement 9, die CPU, DICE, die haben keine Schaltkreise drauf, die sind Dummies Da dachte ich mir, macht keinen Sinn, also wo wir wieder bei dem Thema wären, Marketing, das keinen Sinn ergibt Dann habe ich das aufgegriffen, habe ein Video dazu gemacht, habe die Chips analysiert, habe gesehen, okay, es sind Schaltkreise drunter, es muss ein 32-Kanon-Threadripper kommen Was ist passiert, ein halbes Jahr später kam ein 32-Kanon-Threadripper, aber erst mal so hinstellen, als wären meine Aussagen falsch Diese Dinge sind einfach natürlich Sachen, ich fühle mich dadurch jetzt nicht persönlich angegriffen oder sowas Aber es macht mir natürlich unheimlich Spaß, dann darauf einzugehen und damit zu spielen, könnt ihr wahrscheinlich auch irgendwo nachvollziehen Zum Beispiel August 2016, das ist ein bisschen weiter zurück, habe ich ein Video gemacht, wo ich die NVIDIA High Bandwidth SLE Brücke analysiert habe Da habe ich mir angeschaut, wie sie so eine NVIDIA High Bandwidth SLE Brücke analysiert haben Man braucht, wozu soll das gut sein? Entweder ist das SLI und das funktioniert, oder das funktioniert nicht, braucht man da echt eine High Bandwidth Bridge, was auch immer SLI Brücke aus, also die kam ja vor NVLink, da wurde gesagt, es gibt jetzt diese neuen High Bandwidth SLE Brücken, die können viel mehr Daten übertragen Die sind technisch viel aufwendiger als normale SLI Brücken usw. Dann habe ich da Röntgenanalysen machen lassen von den SLI Brücken und habe quasi gezeigt, dass die SLI Brücken genauso sind wie vorher Und einfach nur so ein paar zusätzliche Sachen drin haben Genau das habe ich mir gedacht, es gab was Dann der Klassiker, das war im Juni 2017 kam das X299 VRM Desaster Video Eines meiner kritischsten Videos, das ich je gemacht habe, kritisch auch in der Hinsicht, weil ich dadurch sehr viele Kontakte zerstört habe Ihr müsst bedenken, ich habe in dem Video gesagt, dass bei der X299 Plattform die Spannungswandler bzw. die Spannungswandler Kühler so extrem unterdimensioniert sind Das Overclocking, so wie das vorgesehen ist, wie es beworben an Mainboard Herstellern nicht möglich ist Und das ganze war ein Resultat aus mehreren Jahren, die sich zusammengetragen haben Denn es war schon so bei Z170, bei Z97 und sogar bei X299, habe ich diese Probleme schon festgestellt Habe das an die Hersteller übermittelt, hauptsächlich an ASUS und an Gigabyte und das hat sich damals nichts getan Es wurde von den Herstellern, es kamen so Aussagen wie, ja okay wir wissen, dass die Probleme existieren, die Spannungswandler werden warm Aber juckt uns nicht Aber die Designs sehen halt so besser aus, als wenn wir da so finden drauf machen Ich habe zwei Jahre lang da quasi gegen Wände geredet und bei X299 war das Problem für mich Ich mein, wenn ein Mainboard 360 Quickscope Killer HD Pro Gamer Edition heißt Brainbooster Pro Gamer Edition, da musste es natürlich auch erstmal gut aussehen und erst im zweiten Schritt funktionieren So kritisch, oder was ich gesehen habe, dass ich dann da quasi ein öffentliches Statement Video zu gemacht habe, damit sich was ändert Und ihr könnt euch vorstellen, ich war sehr lange oder ich bin schon sehr lange in dieser Branche aktiv, schon 15 Jahre circa Ich habe sehr viele Freunde in der Industrie und sehr viele haben sich da auch auf die Füße getreten gefühlt Als ich dieses Video veröffentlicht habe Ich war zum Beispiel ein halbes Jahr vorher bei Intel im Headquarter in den USA Und Intel hat mir danach zum Beispiel gesagt, dass nach diesem X299 Video werde ich nie wieder irgendwo von Intel eingeladen Ich darf nie wieder zu Intel in das Headquarter rein und so weiter Also ich habe meinen kompletten Intel Kontakt quasi abgebrannt dafür, um dieses Video zu machen Und auch die Mainboard Hersteller waren danach sehr reserviert mir gegenüber Ich habe am nächsten Tag sehr viele Anrufe bekommen von den Herstellern und haben gesagt Wir wissen nicht, ob wir mit dir in der Zukunft nochmal irgendwas machen können Und das war für mich, das war mir klar, als ich dieses Video gemacht habe Mir war komplett bewusst, wie die Resonanz von so einem Video... Ich zeige euch mal was Genau die gleiche Erfahrung habe ich auch gemacht, wobei es bei mir nicht drauf rausgelaufen ist, dass... Egal Vielleicht kennt noch einer dieses Video hier Von 2013 Da habe ich Activision übelst geflamed Ich weiß gar nicht mehr genau wegen was Aus irgendwelchen Gründen habe ich Activision geflamed Wenn ihr wollt, können wir uns das dann nochmal anhören Ich habe keine Ahnung, ich habe 5 Minuten Activision geflamed Und danach hat auch der damalige Community Manager von Activision in Deutschland Der war neu, der hat gesagt Also wenn ich will, dass ich nochmal irgendwohin eingeladen werde Oder dass ich in Zukunft eingeladen werde, oder dass er mich jetzt auch einladen kann Muss ich das Video löschen Also die sind da schon hinterher Ich habe das Video natürlich nicht gelöscht Und das hat danach trotzdem funktioniert Aber das ist nicht ohne Und man muss sich auch mal überlegen, das ist schon ein gewisses Risiko Ich meine, wenn du ein Kanal bist Der sagen wir jetzt mal auf spezielle Games spezialisiert hat Oder auf Hardware-Geschichten spezialisiert hat Dann profitierst du natürlich auch extrem davon Wenn du einen guten Kontakt zum Hersteller hast Und wenn du vielleicht auch die ein oder andere Sachen eben schon dann sehr zeitig hast Weil umso früher du bist, umso mehr Leute gucken das Ganze Ist ja logisch irgendwo Auf der anderen Seite ist es für dich auch wieder blöd Weil du hast immer das Gefühl, du kannst nicht komplett sagen, was du willst Und es gibt Channels, nehmen wir mal jetzt irgendwie Nehmen wir mal irgendwie einen Overwatch-Channel Nehmen wir mal zum Beispiel, weil ich immer auf Twitter folge, Highscore Heroes zu machen Der hat mit Sicherheit einen ziemlich guten Grad zu Blizzard Und macht hauptsächlich Overwatch-Content oder anderen Blizzard-Content Wenn der jetzt ein Video machen würde Das merkt man auch in den Videos, dass gerade auch berechtigte Weise Leute halt recht reserviert sind, was sich ins Rückhalten, was Kritik anbelangt Da muss man sich mal überlegen, was da los wäre Wenn du auf einmal keinerlei Support mehr von dem Hersteller hast Dessen einziger Content auf deinem Channel quasi gebracht wird Das ist echt nicht zu unterschätzen Ob wir das Video danach dann noch mal gucken, was ich damals geflamet habe Ich weiß es schon gar nicht mehr So sein kann, wenn man so kritisch sich im Internet äußert Wenn man eine gewisse Reichweite hat Aber aus meiner Sicht ist das manchmal eben einfach auch notwendig Also gerade wenn man YouTuber ist, der jetzt Ich sehe mich eher nicht so als Werbemarionette Sondern ich berichte über Dinge, die mir gefallen, die mir nicht gefallen Und dann muss man eben auch ein Video machen Und wenn mir Dinge nicht gefallen, dann muss es eben auch gesagt werden Weil es bringt uns allen am Ende nichts, wenn wir das verschweigen Wenn alle Reviewer nur Produkte reviewen und sagen Das ist toll, kauft das Das ist toll, kauft das Das stimmt Dann verbessert... Aaron Jesus Eingefür Twitch Prime Sub Twitch Prime Sub Weil ihr müsst jetzt mal zurück überlegen 2017 habe ich diese ganzen Filme nicht verpasst Ich muss jetzt mal zurück überlegen 2017 habe ich diese ganze VRM-Thematik angesprochen Oh die FPS, dankeschön Danach kam das auf, dass dann alle Reviewer plötzlich gesagt haben Oh, da gibt es ja was Interessantes, das können wir testen Ich habe mit allen großen Reviewern gesprochen, wie man sowas testet Wie man die Spannungswandel analysiert und so weiter Jetzt geht es aber hier ab Quantal Quetzal, Dankeschön Twitch Prime Nice, nice, nice Und schaut euch an, was ich getan habe Was ist denn jetzt los hier? Thais123, Twitch Prime, Dankeschön Übrigens, falls es noch Leute gibt Jetzt muss ich mal sehr laut starten Falls es noch Leute gibt Nein, ich mache nicht ihn als Hintergrund, weil das hat damit überhaupt nichts zu tun Falls es noch Leute gibt, die keine Ahnung haben, was diese ganze Twitch Prime-Geschichte ist Denen kann ich das natürlich mal kurz erklären Wenn man einen Amazon Prime-Account hat, kann man diesen Amazon Prime-Account kostenlos mit Twitch verknüpfen Und kann dann, man kriegt dann auch komisches Prime-Loot, habe ich noch nie eingelöst Aber das Beste daran ist, man kann kostenlos einen Streamer seiner Wahl unterstützen mit einem Sub Ohne, dass es einen selbst was kostet Allerdings, der Streamer kriegt trotzdem seinen Anteil von Twitch Sellout-Modus beendet Wir haben hier noch Ript12 und Sobati, Twitch Prime, Dankeschön Pog, huge Pog Easy Richtig Pog In den letzten zwei Jahren hat sich diese ganze Thematik um die Kühllösungen extrem krass verbessert Heutzutage werben sogar die ganzen Mainboard-Hersteller damit und sagen Schaut euch unsere Kühllösung an, die ist so und so viel kühler als die von der Konkurrenz Also wir haben jetzt genau das krasse Gegenteil von dem, was wir 2017 haben Und ich will mich da jetzt nicht selber loben oder sowas, aber das ist halt auch das Resultat von diesem Video Das muss man ganz klar sagen Und wenn wir Dinge verschweigen, die nicht funktionieren, dann wird sich nichts verbessern Das stimmt Wenn ich zum Beispiel sage, wir haben hier neue AMD-CPUs und die erreichen den Takt nicht Dann ist das nicht, weil ich irgendwie AMD bashen will, sondern weil ich erreichen möchte, dass es am Ende funktioniert Ja, da hat man ganz recht, es hat überhaupt keinen Sinn, neues Zeug zu zeigen Also wie gesagt, es sei dann, es ist jetzt halt was eingekauftes vom Hersteller letztendlich Aber wenn es nicht nur den Anschein haben soll von was Objektiven, sondern es ist wirklich Objektiv Dann hat wirklich außer eventuell jetzt unmittelbar der Hersteller keiner was von, wenn man da irgendwie alles schön redet Weil letztendlich, was ist das Resultat? Die Leute kaufen sich... Stellt euch mal vor, Xbox One zu Release Alle hätten gesagt, beste, ihr erinnert euch vielleicht noch an diese MLG-Geschichte mit Xbox damals Beste Konsole aller Zeiten Stellt euch vor, alle Influencer, was ja auch jetzt, das Wort gibt es ja auch erst seit 3, 4 Jahren Alle auf YouTube und alle, alle, alle, egal wo, hätten alle gesagt, Xbox One beste Und die Leute hätten sich die Xbox One gekauft und haben festgestellt, sie ist kacke Zu Release zumindest Das wäre scheiße gewesen für die Leute, die massig Kohle ausgegeben haben Und es wäre für denjenigen, der das zu sehr übertrieben hat, auch nicht gut Außer halt vielleicht, dass Microsoft ordentlich Kohle geblecht hat dafür Aber ansonsten, langfristig ist das, wenn man das zu oft macht oder zu offensichtlich, ist das auch für einen Channelbetreiber nicht gut Weil ich arbeite ja auch für Caseking, das wisst ihr alle Und ihr könnt euch vorstellen, wir verkaufen da das ein oder andere PC-System Wenn wir einen Ryzen da verkaufen und der wird angegeben mit zum Beispiel 4,6 GHz Der kommt beim Kunden an und der macht den Takt nicht Dann ist das rein theoretisch für uns sogar ein Garantiefall Dann kann der sagen, ich gebe den PC zurück, der erreicht nicht das, was die Spezifikationen versprechen Und ihr könnt euch vorstellen, wie viele Leute bei uns im Kundencenter anrufen Und einfach nur technische Fragen haben, ey, warum boostet CPU-X nicht so hoch Das haben wir bei Intel genauso wie bei AMD Gerade weil diese ganzen Boost-Thematiken eben auch sehr undurchsichtig sind Und oft auch nicht genau erklärt wird, welche CPU in welchem Zustand, in welcher Situation genau wie boostet Selbst für mich ist das oft gar nicht klar Gerade auch bei Intel zum Beispiel diese AVX-Offset-Thematik Dass nicht genau klar ist, bei welcher CPU, in welchem Zustand, was für ein Offset zum Beispiel verwendet wird automatisch Das sind solche Themen, da bin ich einfach kein Freund von Weil das am Ende einfach Unklarheiten für uns Endkunden bewirkt Und ja, da haben wir nichts davon Deswegen müssen Dinge, die nicht passen, die aktuell nicht funktionieren, einfach ausgesprochen werden Das hat nichts mit persönlicher Vorliebe zu tun Mir ist es egal Und selbst wenn, wenn in dem Fall was dran ist, wo ist das Problem? Ich hate quasi gegen jede Firma, das interessiert mich nicht Es ist mir egal, ob da Intel, Nvidia, AMD drauf steht Das spielt für mich keine Rolle Weil, warum? Ich bin mit keiner von den Firmen irgendwie persönlich verbunden Ich habe keinen Vorteil davon, wenn die eine Firma mehr verkauft als die andere Das ist mir persönlich komplett egal Mir geht es einfach nur darum, dass das, was wir kaufen, so gut wie möglich funktioniert Wenn wir Verbesserungspotenzial sehen, dann sollten wir das auch immer sagen Und dafür sorgen, dass sich auch Dinge ändern, wenn sie nicht funktionieren Interessanterweise bekomme ich zum Beispiel auch von den meisten Herstellern gar keine Samples zur Produktlaunches Also AMD und Intel, die schicken mir nie irgendwas Bei denen bin ich quasi gefühlt auf so einer Blacklist Und ich mache dieses Video auch, weil, als ich mit AMD gesprochen habe letzte Woche, da hat auch AMD gemeint, dass ich so richtig gegen AMD eingestellt wäre Und dann habe ich denen auch gesagt, für mich ist das ein rein wissenschaftliches Thema Genau, macht es gescheit, dann muss ich euch nicht flamen, ist doch ganz einfach Wenn die CPU boostet, dann ist es für mich gut Wenn die irgendeine Lösung haben, dann zeige ich die gerne Dann möchte ich das euch allen zeigen, wie das Ganze hinzubiegen ist Was? MW Fanboy, was zum Teufel hat denn Bill Gates heute noch mit Windows zu tun? Wie wir das Ganze gefixt bekommen Und nicht mal Ball, man hat mehr was mit Windows zu tun Und nicht mal der Windows Dude von früher, ich weiß nicht wie er hieß, hat man was mit Windows zu tun Also, das hat für mich keinerlei persönliche Hintergründe oder sowas Eigentlich ist es immer schade, dass man so ein Video überhaupt machen muss Ja Cooper, ich bin auch MSI gebannt Und sich da quasi so rechtfertigen muss, aber ja, ich wollte das Ganze mal so ein bisschen loswerden Hoffe, ich habe euch mit dem Video nicht zu sehr gelangweilt Und übrigens, was dieses Ganze, was meine Getränkesituation immer betrifft Ja, aber er hat recht, jetzt ist es vollkommen richtig Vollkommen richtig Und weil irgendjemand gesagt hat, EA, EA müsste ja schon längs pleite sein, wenn die das schon eine Weile praktiziert haben Ich weiß nicht, ob ihr euch mal den EA Aktienkurs so angeguckt habt Also, EA wird nicht demnächst pleite gehen Weil der Aktienkurs ja auch direkt damit, ob wir jetzt in der Firma pleite gehen oder nicht Erstmal nicht direkt was zu tun hat Aber auch so wird EA nicht in nächster Zeit pleite gehen Aber guckt euch mal das an, guckt euch mal die EA Aktie an Also, die ist jetzt nicht gerade, die ist jetzt nicht gerade so tolle mehr seit ein paar Jahren Die ist ordentlich runtergegangen Die ist ordentlich runtergegangen Erstmal hier, und dann zu dieser, ich würde mal sagen, das war so ein bisschen auch, wann waren das hier? 18, das war Battlefront Battlefront, wo am Battlefront ging es dann Weg Spielen Nein Warum erkennt das mein Netzblocker nicht? Okay, wir gucken uns jetzt nochmal mal ein Activision Flame Video an von 2013 100.000 Aufrufe, 8500 Likes und 156 Dislikes Okay, da muss was dran, da muss was dran gewesen sein, was ich damals erzählt hab Okay, hören wir uns das mal an, ich hab keine Ahnung, was das ist Okay, hören wir uns das mal an, ich hab keine Ahnung mehr, um was es ging Aber wie gesagt, das ist das Video, wo ich gefragt wurde, beziehungsweise quasi, dass ich es leuchten soll Hallo Jungs und Mädels, hier ist der Max und Activision Versteht man alles? Bisschen leise, gell? ... und schafft es ja immer wieder nicht nur auf ihre Spieler zu... Oh, es geht schon gleich los, der Flame geht gleich los, ich mach mal ein Stückchen lauter ... und schafft es ja immer wieder nicht nur auf ihre Spieler zu scheißen, sondern auf ihre Spieler zu scheißen und danach noch drauf zu pissen Also diese Kombination, das haben die ja richtig gut drauf Also wer es nicht ertragen kann, dass ich jetzt ein bisschen hier... Es gibt ja manche Leute, die flippen dann aus und meinen, sie müssen an den Fenster springen, wenn ich hier ein bisschen rumflame, zumindest kommt mir das manchmal so vor Die soll am besten gleich ausmachen, denn ich werde mich in diesem Video ein bisschen über Activision auslassen Ich habe einen News-Beitrag gelesen, bei callofdutyseries.de, übrigens ganz coole Seite, guckt es euch mal unten an, ist die News verlinkt und zwar geht es um Booster Ich habe mir gedacht, Booster ist ja nichts wildes, Booster, scheiß Booster, Booster sind kacke Ich glaube, da sind wir uns alle einig, dass Booster kacke sind Ich war auch voll aufgeregt in dem Video, ey Was ist da los? Nachdem jetzt natürlich Call of Duty Ghosts noch nicht so wirklich lange auf dem Markt ist, ist ja zumindest die PC-Version und auch die Konsolen-Version teilt teilweise offen, wie ein Joint und da wird gehackt, geboostet, gesonst was, ohne irgendwie, dass irgendjemand dem ganzen Einhalt gebietet Ja, das war doch so Wir haben ja natürlich das schöne Pair-to-Pair-Hosting-System, ich meine Dedicated Server for All Platforms, wir wissen es ja Was macht ihr denn, wenn ihr zufällig in eine Booster-Lobby kommt, wo man für jeden Kill 3 Milliarden Punkte kriegt und auf einmal seid der maximale Rang So, dann verlasst ihr das Spiel natürlich, weil ihr euch denkt, Scheiße, ich will das nicht, Problem ist, das Spiel speichert es Und jetzt, jetzt seid ihr auf die Gnade von Activision angewiesen, dass Activision euch nicht für das wissentliche Join in einer Booster-Lobby bant Allen Ernstes, was um alles in der Welt denken die sich? Es ging darum, irgendjemand, den genau dieser Fall betroffen hat, sprich, er ist wohl Da hat er Recht, also der Max von vor 5 Jahren Irgendwie unglücklich in eine Booster-Lobby gekommen, hat gesagt, Leute, könnt ihr nicht mal eine Stats resetten, ich will die geboosteten Stats nicht Und er sagt Activision, nein, wir können deine Stats nicht resetten, du kannst froh sein, dass wir dich nicht bannen für das wissentliche Join in einer Booster-Lobby Da hat er gesagt, the fuck, hallo, ich meine, wenn das Spiel schon so kaputt ist, dass sowas tatsächlich 2-3 Wochen nach dem Release möglich ist Das Game ist doch nicht alt, dass das wirklich jetzt schon möglich ist, da kann man sich doch mal ein bisschen kooperativer zeigen Zumal es für Call of Duty 4 auch schon ein Tool gibt, mit dem man Stats resetten kann Und das nächste ist, sie erzählen einem noch mal, sie sind nicht dafür verantwortlich, selbstverständlich sind sie nicht dafür verantwortlich, ihr Spiel sauber zu halten Nein, man soll sich im Vorfeld bitte angucken, wem man denn join, man soll nur... Das stimmt, das haben die damals wirklich erzählt, ich erinnere mich da noch dran, das haben die damals wirklich erzählt, so nach dem Motto, ja dann join halt einfach keine Booster-Lobby Leute joinen, denen man vertraut, der geile Witz an der ganzen Sache ist, ja Dedicated Servers on all Plattforms, wir wissen es ja, P2P Hosting, du hast keinen Einfluss drauf, wem du joinst Das einzige, was du machen kannst, ist dann Call of Duty abzuschießen, danach in der Hoffnung, es speichert die Stats nicht Also die schaffen es regelmäßig mit solchen Posts nicht auf die Leute zu scheißen, sondern echt nochmal so richtig drauf zu pissen Anstatt jetzt zu sagen, Leute okay, das Spiel ist halt einfach verhackt, verboostet, für sonst was, allerdings wer seine Stats resettet haben will, wer nicht wirklich wissentlich boosten wollte, der kann seine Stats resetten Nein, das machen sie nicht, das auf gar keinen Fall, also Leute ich weiß nicht, ich lese euch mal diese News vor, welche arroganten Antworten die Typen da posten Das ist echt, ich weiß manchmal echt nicht, was ich zu der ganzen Scheiße sagen soll, ich halte es manchmal einfach nicht aus, irgendwie kriege ich das nicht in meinen Kopf rein Eigentlich würde man ja erwarten, dass sie so ein bisschen auch noch, so ein bisschen, so ein ganz kleines bisschen, so ein bisschen auf Sympathie machen wollen, aber gar nicht, null, überhaupt keine Chance Vor allem, der größte Witz dabei ist ja auch noch, dass sie ja nochmal betonen, so schön, ja, so nach dem Motto, ist das schön, wir könnten dich ja auch gleich bannen Sei doch froh, dass du deinen Account jetzt nicht mehr gebrauchen kannst, du kannst das Game ja nochmal kaufen vielleicht Meine Güte, ich, ups, ich packe es nicht, na gut, es hat keinen Sinn sich da weiter drüber aufzudrängen, lest euch diese News mal durch, ihr bildet euch da selbst einen Urteil drüber Ich finde es echt, ich finde es einfach hart, ja, hätten sie es so gemacht wie in MW3, dann konnte man sich ja irgendwie mit diesen Prestige Tokens sogar noch irgendwie resetten Die News gibt es nicht mehr Ich behaupte einfach mal, die meisten Leute, die da spielen, die wollen nicht boosten, ja, wenn jemand das Game spielt, dann die meisten, die allermeisten, wollen das wirklich ordnungsgemäß durchspielen Und was kann denn bitteschön ein Neuling dafür, ja, mal irgendjemand, der das Spiel gerade gekauft hat, er joint, er macht Matchmaking, sonst was, joint irgendwo rein, ist in der Lobby und er landet zufällig als erstes in der Booster Lobby Das checkt der doch gar nicht, das weiß der doch überhaupt nicht, das kann der gar nicht wissen Und dann sagt Activision, naja, best gehabt, dumme Sau, hast du das Game gekauft, es ist so scheißegal, was du damit machst Ja, das ist schon geil, oder? Da ist was dran Also ich bin echt mal dafür, dass dieses Jahr nicht EA den Worst Company Award kriegt, sondern echt Activision Das sind solche Meldungen, ich könnte echt meinen Kopf nehmen und einfach die ganze Zeit auf die Tastatur schlagen mit meinem Kopf, wobei das eigentlich bescheuert wäre für die Idioten das zu machen, oder? Ja, wenn man mal ganz ehrlich ist, also ich pack's nicht, anstatt echt ein bisschen kooperativ zu sein, nein, gleich, das stimmt aber, das könnte ich heute immer noch so unterschreiben Und am besten noch drauf gekotzt auf die Leute, die das Game gekauft haben Jetzt geht er ab, ey Keine Fresse, macht's gut, bis zum nächsten Mal, tschüss Ja, aber das könnte ich heute immer noch so unterschreiben Da war der Max richtig am Hate Speech, ne? Macht er eigentlich noch Videos hier? Macht er noch Videos? Hey nice, immerhin, wenigstens einer von denen, die ich noch, die ich damals gekockt habe, macht mal Witz Der ist aktiver als ich, das stimmt, ich hab's grad gesehen, der hat's immerhin auf drei Videos im Jahr geschafft Ach ja, da ging er ab, hä? Da ging er ab, ich hab ja mehr so Videos damals noch über Kot gemacht, wo ich mich übrigens aufgeregt hab, das war auch, das war, wisst ihr, das war meine, das war meine Hater-Fanboy-Zeit, also die Zeit, wo ich mir eigentlich gewünscht habe, dass Kot wieder richtig gut wird Aber ich die aktuellen Kot-Ausgaben richtig kacke fand Und nach, nach zwei, drei Jahren war's bei mir dann so, dass mir egal war Hat mich nicht interessiert Ja, ähm Erstmal Regensounds wieder anmachen So, Regensounds Okay Leute Das Benachrichtigungspopup ist richtig nervig Was für ein Benachrichtigungspopup Was für ein Benachrichtigungspopup Wessen YouTube-Kanal war das gerade? Der meiner Der Sander macht auch noch Videos, ja? Ach so, das, ja, das ist, das ist, das ist ultra nervig Ich würd, ich würd auch gern einstellen, dass die Seite einfach, defaultmäßig mir Seite keine Benachrichtigung schicken darf Der Host von gestern war richtig gut, der Typ macht richtig geile Videos Ja, ich hab auch noch ein bisschen geguckt danach, das ist wirklich gut gewesen Ja, genau, ich hab auch noch ein bisschen geguckt danach, das ist wirklich gut gewesen Ja, genau, ich bin immer noch MSI Blacklist gebannt Äh, NVIDIA Partnerprogramm falls du das kennst, ich kenn das NVIDIA Partnerprogramm nicht Ähm, ich war ja vor ein paar Jahren mal bei NVIDIA in München Für die, was damals, damals wollten sie Shield, Shield und Shield Tablet promoten Aber das Nvidia Partner Programm kenne ich nicht. Kennst du dich mit Jenkins Pipelines aus? Ich würde nicht sagen, dass ich mich damit auskenne. Also ich habe vor vier Jahren oder so das letzte Mal großartig was mit Jenkins gemacht. Da habe ich für damals habe ich noch, wie gesagt, ich habe ja schon mal erzählt, was ich auf der Arbeit mache. Ich habe damals versucht für unsere Software Builds einen Jenkins aufzusetzen, der das automatisch macht, der dann auch so ein Übersichtsboard hatte. So ein bisschen wie Travis von GitHub quasi, als halt auf Jenkins Basis. Das hat auch ganz gut funktioniert. Allerdings mittlerweile kümmert sich jemand anderes um den Jenkins. Bin ich jetzt auch nicht gerade bös drum. Ach, das ist gut zu wissen. Das ist nicht schlecht. Ist deine Klimaanlage eigentlich in deiner Heimautomatisierung drin? Also dass das Ding bei einer bestimmten Hitze angeht? Nee, das habe ich nicht eingestellt, weil dann müsste ich, also dass ich das machen könnte, müsste ich auch einstellen, dass es verbunden ist mit Presence Detection. Also sprich, ist jemand daheim? Weil das wäre bescheuert, die Klimaanlage volle Pulle anzuschmeißen, wenn keiner daheim ist zum Beispiel. Aber was ich zum Beispiel mache, ist, dass wenn ich auf dem Weg heim bin, dass es dann 10 Minuten vorher schon angeht. Deswegen, da habe ich ja mein Location Tracking auf dem iPhone. Ähm... War kontrovers, wollten nur positive Reviews, sonst fliegst du aus dem Programm raus. Das heißt, dann schicken sie nicht und mir auch, okay. Aber wurde gecancelt. Ja, wenn sowas rauskommt, dann ist es natürlich, sieht es auch nicht gut aus für den Hersteller, ne? Ja, guck ich mir nachher mal an, Arthur. Fandest du das Design besser? Gucken wir mal. Ja, viel besser. Ja, huge. Fast 100 Subs hatte ich damals. Das fand ich viel schöner damals. Man müsste es ein bisschen anpassen, dass es aktueller ist, ja? Es ist nicht mehr so ganz zeitgemäß im Endeffekt. Auch die Wahl der Schriftart und sowas, ja? Also das ist nicht mehr ganz... Das Postfach gibt es übrigens nicht mehr, nur mal so angemerkt, ne? Das war viel besser, das Design. Du konntest das sogar noch ordentlich customisern. Das war viel, viel schöner, viel besser. Ja, Emic Summer, ich weiß. Das Video kann ich mich auch nicht dran erinnern. Hab ich das gemacht? Ach ne, das war Deluxe. Deluxe, den gab es ja damals auch noch, ja. Sind Chips-Tüten wie DLCs. Ach, das war der Feed, auch was man geliked hat und sowas. Ich hatte ja mal einen Minecraft-Saber, oh man, ja, stimmt. Pok. Ja, das war was, ja? Nice, ja. Dein favorite cut of all time? Black Ops 1. Stimmt, den hatte ich in den Featured Channel drin. Den Nico! Den Nico! Guck mal, damals hatte ich 100k und der Nico hatte 39k. Heute hat er was? Wie viel hat der Nico heute? Was hat er heute? 2,1 Millionen? Jaja. Die Rheinfelsquelle gab es damals auch noch. Ja, ich müsste echt mal wieder ernsthaft YouTube machen. Ich mache ja schon gefühlt seit 3, 4 Jahren nicht mehr ernsthaft YouTube. Die Facebook-Währung habe ich mir noch nicht angeguckt, großartig. Mein EL-Channel, welchen EL-Channel? Ich hatte nie einen EL-Channel. Ich habe einen zweiten Channel gehabt, wo ich ein bisschen Blödsinn hochgeladen habe, ja. Friseur-Autogramm, ja. Das glaube ich nicht. Meine Videos sind nicht das, was sich der YouTube Mainstream angucken will. Da müsste ich ihn da machen. Da müsste ich eine Mischung aus... Mit was kannst du heute noch im Gaming-Bereich so richtig abgehen? Entweder du bist ein richtig guter Fortnite-Spieler und kannst quasi die seriöse Schiene fahren, sage ich mal mit. Ich erkläre euch, wie man gut Fortnite spielt. Oder du bist nicht oder alle so gute Fortnite-Spieler und machst funny Fortnite-Videos. Was auch ganz gut geht, ist, du machst generell so funny Gaming-Videos mit ein paar Kollegen, die sich halt alle kennen und halt funny sind. Du machst Reaction-Videos, da müssen sie dann einen gewissen Charme haben, weil Reaction-Videos gibt es schon ganz schön viele. Als Grill machst du einfach Boop-Cam. Minecraft ist gar nicht mehr so angesagt. Ich meine, klar, es gibt große Channels, die auch viele Views mit Minecraft haben, aber so den... Minecraft ist einfach so eine Konstante in der Welt irgendwie mittlerweile. Hätte ich früher auch nicht für möglich gehalten, aber Minecraft lockt heute jetzt auch bei einem neuen Channel jetzt... auch nicht mehr instant irgendwie die Hunderttausende von Bildschirmen. Was hältst du generell von Crypto-Bitcoin? Das hat auf jeden Fall eine Zukunft. Gibt es eine Thematik, auf die du denn richtig Lust hättest, bezogen auf YouTube? Ja, habe ich ja schon mal gesagt, ich würde gerne in Videos mehr in die Richtung machen, wo es halt um... nicht unbedingt rein um Games geht. Ich würde gerne Sachen... Ich würde gerne... Ich hätte erstmal gerne ein ordentliches Battlefield-Video. Ich hätte mal gerne irgendwelche Games, wo ich was zu sagen kann. Dann würde ich gerne weiterhin einfach meinen Senf zu irgendwelchen aktuellen Sachen geben. Und als drittes würde ich eigentlich gerne ein bisschen mehr Technik-Krams machen. Jetzt nicht so super advancedes Kram wie hier im Stream. Das kannst du auf YouTube nicht bringen. Aber zum Beispiel ein selbst gebautes 10 Gigabit NAS. Sowas zum Beispiel, so für den Noob. Und viele Leute werden es nicht bauen, sondern einfach, die interessiert das. Ich zeige, mein Mini-Rack hat irgendwie 150.000 Aufrufe gekriegt. Meinung zu Commander Krieger? Keine Ahnung, ich weiß nicht, was er aktuell macht. Dazu müsste ich ja erstmal vor der Kamera rumspringen. Aber ich finde ganz ehrlich, die Lux Tech Tips ist die optimale Mischung aus Technik und Entertainment, so dass es noch den Großteil der Leute anspricht. Machst du es komplizierter, dann ist das für die meisten Leute nichts. Was er kaputt macht, weiß ich nicht. Ich habe schon ein paar Monate nichts gehört. Ja Reveal Video, aber wozu soll ich das machen? Da kennen mich die Leute ja in Frankfurt oder sonst wo. Ich habe keinen Bock drauf. Ich weiß das noch, wo ich mal den Friseur besucht habe, als er noch ein bisschen mehr Videos gemacht hat und auch regelmäßig Livestream. Wo mir interessiert ist, was ich jetzt mache. Der war ja aber weitem nicht so groß wie größere Channels auf YouTube, wo dann random die Leute laufen gekommen sind und ihn erkannt haben. Da habe ich keine Kraft drauf. Das Schlimmste, was ich mir vorstellen kann, ist morgens, wenn ich in der Bahn sitze und überhaupt keinen Bock auf die Welt um mich drum herum habe, dass dann irgendjemand kommt und sagt, hey Max, wie gehts? Kenne dich von YouTube. Das ist für mich schlecht und für den schlecht. Für alle schlecht dann. Gifts im Disco, was ist das? Das ist ein Kostüm, ein Kostüm, ein Kostüm. Das ist ein Kostüm. Das ist ein Kostüm, ein Kostüm. Das ist ein Kostüm, ein Kostüm. Gifts im Discord, reicht das Nitro für 50? Ich dachte, Nitro muss man sich selber kaufen. Ja, schau mal, was soll ich schauen im Discord? Okay, wir gehen jetzt mal ins Discord. Was? Cebaro, was? Auf Discord. Datenplatz. Wie nennt man Max in einem Meeting? Serious Max. Das fand ich mal ein guter Witz. So, was? Und jetzt gehen, jetzt gehen... Nee, Gifts gehen nicht, weil ich hab doch kein Nitro. Per PN. Ja, auf Twitter oder... Zwei Mal nach dem Streben dann. Geh bitte mal auf die Memes in Discord und bewert sie, nee. Max, warum bekommt die Schweizer Bahn es hin, eine Pünktlichkeit von 96% zu haben, und die deutsche Bahn es nicht? Also ich weiß nicht, was die Schweizer Bahn... Also was die besonders gut machen in der Schweiz. Ich weiß nur, was die deutsche Bahn besonders schlecht macht. Zum Beispiel in den letzten zehn Jahren ihr Netz verkleinern, obwohl immer mehr Leute fahren. Was mit Sicherheit ein großer Grund ist, warum es so beschissen läuft. Regel535 sagt, ich soll ein Video machen. Zehn Tipps, wie du dein PC schneller machst. Funktioniert wirklich. Direkt eine Million Views. Beste. Sack, alle weg. So, was könnte man sonst noch gucken? Ich muss mal in meine später anschauen Liste gucken, ob es da irgendwas interessantes noch drin gibt. Kennt ihr das? Das gucke ich auch manchmal gerne. War das das? Kennt ihr das? Das ist ein Typ, der macht immer Videos über seine Ameisen. Wo man sich eigentlich denkt, das ist übelst langweilig. Aber es ist trotzdem unterhaltsam sich anzugucken. Das Noverkühlungsvideo vom Bauer. Das müssen wir uns jetzt angucken. EA ist auch so ein typischer Bullshit-Marketing-Laden. Vor ein paar Jahren, nachdem der Hate so richtig groß war, haben sie erzählt, ihr Leute habt recht. Wir sind voll geläutert. Aber wir sind jetzt Player First. Wir werden die besten Player First und wir haben nur unsere Spieler im Sinn. Das hat genau zwei Wochen gehalten. Das EA besteht auch aus sehr viel Bullshit-Marketing. Das ist wohl wahr. Das ist der Obergi Beta. Wobei, das ist ein anderer Typ, als ich gedacht habe. Ich weiß gar nicht, wer das ist. Armes EA. Wie können die Leute nur auf die Idee kommen, dass EA nicht die Guten sind? Das ist mir vollkommen unverständlich. Das weiß ich gar nicht, wie man auf die Idee kommen könnte. Die müssen das verstehen. Die sagen nur offiziell, dass sie es nicht verstehen. Pee-Pee-Gas. Das war wenig auf jeden Fall. Wenn man sich das im Hintergrund anguckt, kann man überhaupt nicht auf die Idee kommen, was man an EA nicht mag. Das ist genau das, warum es unglaublich dumm ist, Firmen oder Unternehmen so extrem zu fanboyen, weil sie scheißen drauf. Sie haben das überhaupt nicht verdient, sie zu fanboyen. Als Fanboy lässt man sich einfach nur besser melken. Das ist nicht so, dass sie ihre Fans mögen. Die mögen ihre Fans, die sich gut melken lassen. Ich kann Blizzard auch nicht mehr fanboyen, Online-Ritter. Was hat Blizzard die letzten Jahre? Egal, wir gucken erst mal das Video an. EA ist bestimmt ein ganz toller Laden. Das EA jetzt wirklich so ein schöner Ort ist, wo alle Entwickler und alle Mitarbeiter glücklich sind, habe ich auch so meine Zweifel dran. MX-Sama, klar, das ist alles Activision mittlerweile. Und man merkt es auch immer mehr. Originale Blizzard-Leute sind zum größten Teil weg. Bei Blizzard hocken jetzt Activision, BWL, Marketing-Anzug-Leute. Und man darf von abgesehen, die supporten Indie-Developers jetzt ja auch nicht, weil sie aus reiner Nächstenliebe. Die versprechen sich ja natürlich auch was von. Und Anthem, hör mal auf. Fail-Game. Das haben wir geguckt, ich hehle. Das Fall of 76. Da muss ich jetzt aber trotzdem was zu sagen. Homeworld schreibt, und Blizzard hört auf die Community, sie kommen ins WoW Classic. Ich glaube, man gibt an der Stelle Blizzard sogar zu viel Credit, nach dem Motto, sie hören auf die Community. Verstehe ich nicht falsch. Ich finde es gut, dass für Classic WoW deutsche Server kommen. Aber, wie man überhaupt auf die Idee kommen konnte, das nicht zu tun, ist mir vollkommen unbegreiflich. Das hätte Ihnen eigentlich von Anfang an klar sein müssen, dass die Leute sich das wünschen. Und sie haben sich bewusst aus internen Gründen, die haben sich das garantiert gut überlegt, keine deutschen Server zu machen. Haben sie sich dafür entschieden, eben absichtlich nicht auf das zu hören, was die Leute wollen. Und erst nachdem der negative Aufschrei so groß war, und auch das negative Feedback und wahrscheinlich auch die befürchteten finanziellen Einbußen, so groß war, dass quasi das überwiegt hat. Erst dann hat man gesagt, man macht deutsche Server. Ich glaube auch wieder nicht, dass sie das so nach dem Motto aus reiner Nächstenliebe machen. Weil sie wirklich auf die Community in dem Sinn hören, und es ist ihnen was Großartiges, dass es für sie was zählt. Früher bei Blizzard wäre ich davon ausgegangen. Ihr müsst euch mal die alten, ohne Scheiß, guckt euch die alten BlizzCon Pressekonferenzen an. Das war eine komplett andere Firma. Du hattest damals, Overwatch-Chef hat damals auf der Bühne gestanden, für WoW noch, 2007 oder so. Da war ja früher, was war Chef bei World of Warcraft, Instance-Designer-Typ oder? Ich weiß es nicht, zumindest hat er was mit WoW zu tun gehabt. Der hat auf der Bühne gestanden damals und hat einen Witz darüber gemacht, dass man schlechte Spieler noch aus der Gruppe kicken kann. Das war ein Witz lustig, wie er das gesagt hat. Das würde der heute im Traumlicht dran denken, sowas zu sagen. Das würde er im Traumlicht dran denken. Blizzard ist heute deutlich mehr, nennen wir es mal professioneller, in dem Sinn, dass sie sich so verhalten, wie es alle anderen auch machen. Das ist der Chef der Lead-Designer von Overwatch. liche Firma grüß Ich weiß, dass Chef der Lead-Designer von Overwatch ist. ich wusste bloß nicht was er in was er in was er in wo designed hat ich weiß nur dass er auf den alten blitz konz auf der bühne gestanden ab und zu was über wo erzählt hat das war das war komplett andere welt kennt ihr den post von jeff wo er sich über über fqst ausgelassen hat ich kleiner flamer das hier genau ich glaube das meine ich die gucken uns jetzt nicht an die presse konferenz jetzt geht das geht ein stück da jetzt dann da erzählt er über wie sie wie sie wie sie rates erstellen in in wo und das ist ein komplett anderer vortrag eine komplett andere philosophie hinter dem wie die games wie sie die games gemacht haben als man das heute von blizzard sieht und ich kann mir einfach das nur so erklären dass seiter activischen mit am start ist blizzard immer mehr und mehr durch activischen bvl anzug menschen ersetzt wurde an den wichtigen stellen so dass heute quasi von von dem von dem von dem klassischen von der klassischen blizzard philosophie noch recht wenig übrig ist ich mein man sieht es doch schon an diesem mobile diablo sieht so eine firma aus die auf ihre fans hört ja und dann ja insofern ihr habt insofern schon recht das was blizzard qualitativ rausbringt von technischer seite sind die games top da kannst du nix sagen also blizzard games sind in der regel in der beta schon backfreier stabiler und und runder als das viele viele release titel sind aber dass man die spiele bei blizzard noch im hinblick für die spieler macht das glaube ich nicht mal das glaube ich auch bei blizzard nicht mehr was ist denn hier eigentlich kratzer eigentlich haben wir uns ein video angeguckt warum ihr so viel gehärtet wird beziehungsweise ihr sagt ihr weiß nicht warum sie so viel gehärtet werden und irgendwie sind wir auf blizzard gekommen ja und ein ritter dass ich schon in progress es gehen ja sogar die gerüchte um habe schon ein paar mal erzählt dass der ehemalige blizzard chef mitgegangen ist da gibt wie gesagt gerüchte ich sag nochmal gerüchte ich verkaufe das jetzt hier nicht irgendwie als das wäre so gerüchte dass der ehemalige blizzard chef der ist zurückgedreht vorletzte blitzkorn oder so oder hat gesagt ist jetzt vorbei ich mache mich vom acker weil er einer derjenigen war dass ich hingestellt hat und gesagt hat overwatch ist noch nicht ready beziehungsweise noch nicht e-sport ready oder passt auch overwatch ist quasi jetzt erst halbwegs ready wenn du es so willst ja die haben jetzt erst in replay modus die haben jetzt erst ein ordentliches ein ordentliches queue system wahrscheinlich wenn das tatsächlich auch so gut funktioniert wie ich das gesehen habe in videos von ptr und da fragt man sich er war da nicht vielleicht was dran ja der despektator und dass das observe in overwatch ist tatsächlich im vergleich zu cs bei weitem nicht so strukturiert aber das liegt auch in der natur vom game irgendwo egal wir gucken jetzt mal das video weiter die indy community in den ea isn't just trying to grab people out of the indy community to be part of ea like they do with every single developer that they integrate into the ea ecosystem whatever let's not even go that far they do not treat consumers well das sind who are actually putting money into ea's pocket or at very least making the case for investors to put money in ea's pocket you know the people who basically make the business healthy or unhealthy are just routinely treated as cattle as stupid brainless fools who don't know anything much less what they want themselves and that they need to be essentially told what they want and that they won't notice when every exploitative action you take is just plainly put right in front of them when for instance es wird halt es wird halt gemacht was geht es wird halt es wird halt komplett gemacht was geht sei es was loot boxen angeht sei es quasi an irgendwelchen versteckten sachen so nach dem motto irgendwelche shortcut packs oder oder was hast du sonst noch irgendwelche sachen die so in ewig langen krein haben dass du dann doch im shop was kauf es wird halt ausgetestet was geht und erst wenn das geschrei so groß ist wie es beispielsweise war bettel front 2 gewesen ist erst dann tut sich was und ich ich gehe mal davon aus dass ich bei bettel front 2 auch hauptsächlich was getan hat weil disney damals gesagt hat sie wollen damit nicht mein verbindung gebracht werden danke für den ost war das war das das stream ohne hose wenn es gar nicht mehr sicher ne das nee das war nicht das stream ohne hose den ich gehorstet habe oder ach nein das war ich weiß das war der neueste das war der der reisen pc war das ich weiß wieder weil ich habe letztendlich letztes hat man eingeheint gehorstet und als er gesagt hat quasi so hoch host sehr aufgestanden hatte keine hose an also also nicht komplett nackig oder so aber halt keine richtige hose mocha tors ja und sie inkludieren box ist in der game und übrigens falls du dich fragst hier was ist das eigentlich komischer typ der dich da gehorstet hat ich ich ich mache normalerweise kein reaction content aber heute ist so warm da machen da da gucken wir uns einfach ein paar sachen an mindlessly long encouraging people to put money into the games randomized gambling ecosystem that will eventually yield you a means to pass by all of that grinding ich hab guckt euch mal das game an von technischer seite kann man da wirklich nichts sagen das sieht richtig gut aus das lief auch richtig gut ich kann ehrlich gesagt nicht sagen wie gutes vom inhalt her war der er hat es glaube ich relativ viel gespielt falls er da ist aber an sich hatte bettel von zwei schon die chance in gescheites game zu werden aber es wurde komplett verkackt mit dieser ganzen crime micro transaction geschichte das im studa zu scribe dankeschön samus glömer pock you a means to pass by all of that grinding like oh i don't know maybe in star wars battlefront 2 which was perhaps one of the biggest gaming controversies of the last few years when they do that EA so clearly demonstrates their opinion of their customers we're lemmings in their eyes and no one likes to be considered that because when a massive company considers you to be just a follower that will do whatever they throw whatever at you and that's exactly what he does now i would have to say the star wars battlefront to loot box controversy is possibly one of the biggest controversies i've seen the entire time i've been games which dates back to the 1980s i must disclose if i say something like that but he has been behind some of the most interesting that's what i'm talking about how friendly they are to developers it's a little bit ironic because through the years they bought a number of studios and ran them into the ground this goes as far back to origin the developer of the ultimate game they shut down directly after all of the things also if one of us is vielleicht nicht erwartet in dem fall muss ich tatsächlich auch mal was pro ea sagen es liegt nicht nur an ea wenn also nicht es liegt nicht bei allen studios immer nur an ea dass die geschlossen werden da gibt es auch genug die haben sich einfach übernommen die haben gedacht so nach dem motto hoch wir sind jetzt bei ea wir schwimmen quasi in geld und haben dann dinge halt angefangen die nie fertig geworden sind sie haben sich einfach übernommen also es ist nicht unbedingt immer an allem schuld auch wenn da ea auf dem video jetzt drauf steht was ich halt richtig bitter finde ist sowas wie bei maxis zum beispiel in city rausgehauen was garantiert nicht so entstanden ist weil sich dass die designer bei maxis so gedacht haben sondern mit sicherheit waren da auch leute von ea direkt dahinten moment maxis überhaupt die nicht dass ich jetzt dich da jetzt blödsinn erzählt doch maxis war ea na ist ja im prinzip wurscht wenn nicht ea dann ersetzt das durch was anderem trifft ja auch zu ich glaube es ist ea gewesen die haben das spiel des letztes im city ja nicht so verkackt weil sich die designer das überlegt haben und gedacht haben wir wollen eine map die so klein ist wir wollen spiel was immer crash sonst was das war termin druck ohne ende wahrscheinlich unfertige unfertige sache released plus dass noch auf das gameplay und das game an sich einfluss genommen wurde das heißt ja die haben die doppelte arschkarte die mussten ein kack spiel machen das was zu früh released wurde und sie wurden danach auch noch geschlossen das doppelte arschkarte also das entwicklerstuhl hatte eigentlich die richtige arschkarte in dem fall ist die eigentlich größer als blizzard das ist so eine sache wo ich aus dem bauchgefühl sagen würde ja auf jeden fall allerdings hat blizzard wo und wo bringt übelst viel kohle allerdings insgesamt würde ich immer noch sagen wenn ich mir diesen ganzen sportgeschiss anguckt was sie so hat und drumherum ist ea eindeutig größer man müsste sich mal die zahlen angucken ja und ob activation blizzard größer ist muss man auch mal schon ich weiß ehrlich gesagt nicht die jetzt da ist l.a. sind da pickt auch kein mensch mehr durch oder das stimmt so schlecht hätte kein nachfolger gebraucht ganz ehrlich das war ein super game und hatte einen richtig schönen abschluss auch wenn es natürlich ein cliffhanger hatte aber es sollte also eine sorte von spiele gehört das irgendwie fast schon dazu aber es war abgeschlossen eigentlich jetzt bei zwei war schlecht jetzt bei zwei solange drei soll angeblich den ticken besser gewesen sein aber ganz ehrlich das hätte an sich kein nachfolger gebraucht im koop im koop ist alles geil ja das war ja auch komplett das kommt halt daher wenn man sagt leute wir brauchen eine neue mass effect und der entwickler sagt moment wir sind doch eigentlich mass effect ist doch eigentlich fertig und okay wir sollen ein neues mass effect machen ja was machen wir dann egal fangt schon mal an kann nichts gescheites bei rauskommen aber wie gesagt das supporten von irgendwelchen indie games ist ja ist ja nicht ist ja nicht aus reiner nix in die bevor nie massive games in fact there may actually be no one with bad intentions i'm not going to say that that's true i will say it's possible but ultimately the point of the company like the point of all companies is to make money and if funding some small indie game now from a passion project indie developer who's got great ideas means they have some kind of contractual obligation from that indie developer as well as just some kind of ongoing business relationship with them well later whether anybody thought about it now or not who is now more likely to work with ea for ea developing things that make ea look maybe not terrible whether it's entirely philanthropic or not i don't really care it doesn't matter it absorbs these indie studios into the ea ecosystem which is ultimately going to result in a less good outcome than if they were just successful on their own are they necessarily guaranteed success if they don't sign with ea i don't know but i guarantee the case the ea presents them is that they probably don't have a lot of choice outside the ea ecosystem and all of this stuff all of the crap whether they do some good stuff behind closed doors release some good games all of the crap is just out there we see it all the time it's impossible not to think about it when they do something new and while some single individual may struggle with the external perception that they are just a bunch of bad guys es kann es kann ja auch durchaus sein dass dass er wirklich das gefühl hat dass das will ich das würde ich dem jetzt auch gar nicht absprechen wollen allerdings wenn man mal fünf minuten in sich geht sollte eigentlich jeder drauf kommen warum die leute was gegen ea haben single individual may struggle with the external perception that they are just a bunch of bad guys to just reiterate it doesn't really matter if the guys at ea are good or bad it matters what the company does and what this company has just repeatedly done to people is shown that it has no confidence no regard or even a lot of cases basic empathy towards its customers and even though they might be treating these indie devs and some employees well i don't know that i consider that to be like a valid case for them people like to try to compartmentalize problems like excessive crunch as of the specific developer like the fact bioware had excessive crunch for both anthem and mass effect andromeda somehow that's their problem and not the massive larger entity that owns them placing financial pressure on them to deliver so at this point there is no good reason not to understand why there's an external perception that they're a bunch of bad guys it's because people tend not to separate the individuals from the massive entity that is screwing them well i don't personally agree with it a lot of people attribute it to oh well if it's a bad company it must be bad people running it now i'm not saying it's good people running it but i'm saying i don't really make any assumptions because i know that the end goal of a company is to make money and and there's always a pressure to deliver growth in publicly traded companies which ea is the financial incentives will always cause the exact situation we're talking about good people are bad people at the helm so it really doesn't matter the kind of guys they have at the company what matters is what the company does and it is routinely negative so there you go angeguckt blizzard hat wow und wow macht geld wow macht richtig viel geld immer noch das schöne an wo ist dass es ein aber basiertes modelles das heißt das heißt das hat wenige wenige höhen und tiefen in dem sind es wird nicht so sein dass alle keine ahnung sagen wir mal 6 millionen wo aber sich hab keine ahnung wie viel es aktuell gibt sie veröffentlicht er keine zahlen mehr dass die die von einem oder anderen wegfallen. Dazu kommt, die haben auch noch ein paar andere große Sachen. Blizzard hat ihr, ihr, ihr, ihr, ihr, ihr, ihr, ihr, ihr Dings, wie heißt sie heißt Hearthstone, die das Kartenspiel gedürnt. StarCraft ist mittlerweile nicht mal so angesagt. Sie haben Overwatch. Allerdings bild ich mir ein, dass wir, in diesem Financial Report gesehen haben, dass Overwatch an sich nicht so der Bringer ist. Die Overwatch League hält sich auch halbwegs in Grenzen. Ich denke mal hauptsächlich Geld wird Blizzard tatsächlich mit WoW und wahrscheinlich Hearthstone verdienen, würde ich jetzt mal Würde ich mal so vermuten. Dazu kommt natürlich noch, wenn man, wenn man auch Activation mitnimmt, dass die ja noch was, was hat Activation? Großes Nebakot. Aber was man nicht vergessen darf und was immer vergessen wird, ist, da wollte ich jetzt nämlich eigentlich drauf raus, dass bei Activation Blizzard auch noch Mobile Games mit dabei sind, weil Activation Blizzard setzt sich zusammen aus Blizzard, aus Activation oder aus King Games oder wie sie heißen. Die da, gibt's nämlich auch noch, die machen auch einen großen Anteil da dran, weil das sind die Candy Crush Dudes. Unter 1 Million Abos bei WoW, das kann ich mir kaum vorstellen. So, na. Das sind die mit so tollen Games wie Bubble Witch Saga, Candy Crush Saga, Pepper Panic Saga, die sind da auch am Start. Und die machen mit Sicherheit auch viel Kohle. Das sind die, das ist der Inbegriff von, von Casual Mobile Gaming Shit. Casual Mobile Gaming Shit. Aber das zeigt doch, warum Blizzard Diablo Immortal macht. Warum Blizzard Diablo Immortal macht, die Frage stellt sich mir gar nicht. Ich finde, die Frage ist, also ich finde die Antwort ist relativ offensichtlich, weil Mobile Games Geld bringen. Allerdings, das auf der BlizzCon anzukündigen, vor Diablo Fans, vor Hardcore Blizzard Fans, vor Hardcore Blizzard Diablo Fans, muss ich da mal überlegen, wer auf der BlizzCon ist. Auf der BlizzCon ist nicht der Candy Crush Spieler. Auf der BlizzCon ist der Hardcore Blizzard Fan, der auf dem PC spielt. Zu 90 Prozent. Und wenn du da einen Mobile Diablo ankündigst, obwohl sich die Leute seit Jahren schon wünschen, dass sich in dieser Marke noch ein bisschen was tut, da musst du dich nicht wundern, wenn das nach hinten losgeht. Warum Blizzard das macht, ist klar, weil man mit Mobile Games Geld verdienen kann. Ob Diablo Mobile auch Scheiße wird oder nicht, kann man überhaupt nicht sagen. Es könnte tatsächlich ein gutes Game werden. Aber das auf der BlizzCon als neues Diablo anzukündigen, vor einem Haufen PC-Spielender Diablo Blizzard Fans, ist schon ziemlich bescheuert gewesen. Sie hätten das so machen müssen, wie bei Skyrim. Skyrim hat ja auch, also Dings, Persista und, wie heißt denn das Studio von Skyrim? Warum heißen die irgendwie speziell? Kann man den ganzen Kram immer aus dem Kopf nicht merken. Ja, das ist er hier. Okay, Persista Game Studios, ja gut. Die haben das richtig gemacht. Die haben Skyrim Mobile angekündigt und haben danach den nicht sagensten Trailer für eine neues Main-Reihe Elder Scrolls aller Zeiten gezeigt. Das war so ein nicht sagen Trailer. Was ist denn Elder Scrolls 6? War das? Genau das da. Das war so nicht sagen. So ein absolut nicht sagen Trailer. Ich habe selten einen so nicht sagen Trailer gesehen, aber die haben es richtig gemacht. Die haben erst, die haben erst ihr... Moment, ist das überhaupt das Richtige? Ja doch, das ist das Richtige. Die haben erst ihr Mobile Game angekündigt und dann haben sie so hinten dran noch gesagt, wir sind dran zu spielern und dann haben sie gesagt, wir sind dran zu spielern und dann haben sie gesagt, wir sind dran zu spielern und dann haben sie gesagt, wir sind dran zu spielern. Ja doch, das ist das Richtige, genau. Ähm, die haben erst ihr Mobile Game angekündigt und dann haben sie so hinten dran noch gesagt, ja, wir sind dran an einem neuen Elder Scrolls. Das hätte gereicht bei Blizzard auch. Ich mein, jetzt ehrlich, als wäre das hier ein großer Aufwand für Blizzard gewesen, für Diablo so einen Trailer zu machen. Jetzt, jetzt, an dieser Stelle ist der Elder Scroll Fans schon, der, der ist hier, der, der ist voll hier am Abgehen. Sobald der Elder Scroll Fans das hier hört, da, da kann er sich nicht mehr halten. So, das war's, mehr haben die nicht gezeigt. Das war's, mehr haben die nicht gezeigt. Und so hätte das Blizzard auch machen müssen mit, mit einem neuen Diablo. Die hätten, die hätten ja ihr Mobile-Gedöns zeigen können, wäre vollkommen okay gewesen. Und dann hätten sie dann drei, und mir kann doch keiner erzählen, dass das, guckt euch das an, das ist doch nicht aufwendig. Das macht, das macht der Azubi in Blender in, in, in zwei Tagen macht er das. Ich mein, was, the fuck, du kannst doch einfach eine alte, eine alte Worldmap nehmen, Ingame-Fly-Hack anmachen und fliegen. Da ist nichts Aufwendiges dran. Und das hätte Blizzard einfach für Diablo auch machen sollen. Aber Blizzard will sich lieber doofe Fragen stellen lassen danach, ob man, ob man drauf antworten, ob man nicht auch Smartphones hat. Ja. Jumping from highest points in a Spider-Man-Game. Was für Videos man hier so alles empfohlen kriegt. Ah, Demo wie so ein VHS. Du hast damals schon gecalled, dass Anthem crap wird. Ich finde man hat Anthem schon seit dem ersten, seit dem ersten Reveal angesehen, dass es crap wird. Geht um Battlefield 5. Battlefield 5 is slowly dying. Ja, der regt sich da drüber auf zurecht. Battlefield 5 hat so voll verkackt. Mein Chef auf der Arbeit. Hab das ja schon ein paar mal erzählt, dass der, der spielt ja Battlefield. Ich hab sogar noch ein Video von dem irgendwo, wo er, wo er Heli fliegt. Jetzt müsste ich mal gucken, ob ich das noch finde. Das ist aber noch zur Zeit, da war er noch gar nicht mein Chef. Der spielt auch Battlefield. Und ich würde schon sagen, dass er jetzt nicht da, da 24-7 Pro ist. Ähm, eher, eher, eher der Casual-Spieler. Und sogar der hat keinen Bock mehr auf Battlefield 5. Der spielt, der spielt wieder Battlefield 1. Oder Battlefield 4. Ist ein Chef in deinem Alter ungefähr einen Ticken älter. Hat auch keinen Bock mehr auf Battlefield 5. Das heißt, selbst die guten Battlefield-Spieler haben keinen Bock auf Battlefield 5. Und die Casuals haben auch keinen Bock mehr auf Battlefield 5. Was? Gerücht um Diablo 4 Overwatch 2. Ja, blablabla. Ich glaube nicht, dass es in nächster Zeit einen Overwatch 2 gibt. Ex-Mitarbeiter-Pakt aus. Wahrscheinlich genauso seriös wie irgendwelche Fake-Trailer. Glaubt ihr wirklich, dass die sowas in einen Overwatch 2 packen würden? Das klingt mir nicht nach einer Storyline, die da drinnen vorkommt. Das klingt mir eher nach einer Fan-Fiction-Storyline. Woa. Das ist fast wie der Flöten-Typ von Ubisoft. Das ist... Alter, das ist Typ... Was ein Bullshit, ey. Das ist total beknackte. Allein schon, dass der League mehr Story enthält und Overwatch ja nur wirklich keine Story-getriebene Spiele in dem Sinne hat. Was ein Blödsinn, ey. Nichts davon, wow. Final Fantasy XIV darf in den Büros nicht mehr erwähnt werden. Das könnte ich mir tatsächlich vorstellen, weil die haben das richtig gemacht. Die haben die Kurve gekriegt von einem scheiß Lounge. Also Final Fantasy Online, also Final Fantasy XIV, hatte wirklich einen richtigen Drecks-Lounge damals. Das Game war auch in einem Zustand, es wollte kein Mensch spielen. Danach haben sie es überarbeitet, nur in gut und relaunch und siehe da, ist mal gut. Und die Leute haben es gespielt. Wo steht das mit den eine Million Abos? Die Abo-Zahlen von Woa sind unter eine Million gefallen. Das kann ich mir ehrlich gesagt nicht vorstellen. Ich verfolge Woa nicht so genau. Muss ich zugeben. Aber ich halte das für zu schnell. Wann kamen die letzten Woa-Zahlen raus? 2015? Mit irgendwie 6 Millionen? Du verlierst in der Zeit mit regelmäßigem Content, verlierst du nicht so viele Abos. Wobei, man muss sagen, die hatten schon richtigen Crap-Content in Woa. Nö, die veröffentlichen das nicht, da ist irgendetwas geraten, das ist Blödsinn. Discord-PN, ok. Sieh mal her. Du hast mir nichts geschickt im Discord. Weiß nicht, wie du mir was geschickt hast, aber mir nicht. Nee, du hast mir nichts geschickt, sonst würd's hier stehen. Ja, wenn Blizzard von Abo-Zahlen spricht, dann meinen die ja immer, aktive Abos nicht eingelogte Spieler oder so. Ich hab dich nicht geändert, aber du kannst mir trotzdem ein PN schreiben. Ansonsten schreibst du im Admin-Channel oder so. Falls es jetzt wichtig ist, dass wir uns im Stream angucken. Das da, der Sebaro, ey, guck mal hier. Ich kriege Nitro gegiftet vom Sebaro. Ultranis, gilt das jetzt auch für meinen Server global? Das heißt, ich kann jetzt im Discord, ich kann jetzt Dings hier machen. Ich kann jetzt 0.3D machen. Das ist huge. Ja, dankeschön. Aja ja. Gibt's noch irgendwelche technischen Sachen, die ihr fragen wollt heute oder wissen wollt? Ein bisschen Technik, Geschwätze, Gelaber könnten wir heute noch machen. Ansonsten würde ich mich jetzt nämlich vom Acker machen. Windows 10 Design. Ich weiß nicht, ob ich mich übers Windows 10 Design noch weiter auslassen will. Ich hab mich schon oft übers Windows 10 Design ausgelassen. Generell übers Windows Design, wie suboptimal ich das an vielen Stellen finde. Eigentlich wollte ich heute gar kein Strembann machen. Ich wollte heute eigentlich ein bisschen hier an der Heimautomatisierung basteln. Oder irgendwas anderes machen. Aber ich hab mich dann von Rechnergesetzen festgestellt, dass ich eigentlich auf nichts Bock hab. Und dass ich jetzt eigentlich bloß mich von Rechner setzen will und nichts machen will. Dann hab ich mir gedacht, eh, beim nichts machen kann ich auch Strembann machen. T-Max Electronics fragt, warum eigentlich kein Node-RED für meine Heimautomatisierung? Das kann ich relativ einfach beantworten. Allerdings, ich muss erstmal Node-RED zeigen für alle, die Node-RED nicht kennen. Gibt's hier eine Demo? Gucken wir uns ein paar Bilder an. Node-RED ist ein, nennen wir es mal ein Workflow-Tool, wo man sich... Ja, hier erkennt man es glaube ich ganz gut. Wo man sich Regeln zusammenklicken kann. Zum Beispiel könnte man sich mit Node-RED Regeln zusammenklicken. Wenn man hier beispielsweise auch seine Heimautomatisierungs-Sachen drin hatte, könnte man sich eine Regel zusammenklicken. Der Max ist auf dem Weg heim. Wenn das der Fall ist und neuer als 5 Minuten, dann schaltet die Klimaanlage ein. Also da kann man sich seine Automatisierung beispielsweise zusammenklicken. Und ich verwende ja Home Assistant als Heimautomatisierungslösung. Und da hast du drei Varianten, wie du deine Automatisierung machen kannst. Über das Web-Interface zusammenklicken. Oder aber in dem Home Assistant eigenen YAML-Dialekt schreiben. Das ist so mehr oder weniger das Gleiche, weil das Web-Interface generiert YAML. Oder man verwendet Node-RED mit dem Home Assistant-Plugin. Oder man macht das, was ich mache für meine Automatisierung. Man verwendet das Home Assistant-Python-Addon. Ich weiß gerade nicht mehr, wie es heißt. Appdemon verwendet man. Da kann man nämlich seine komplette Logik und seine kompletten Automatisierungen anstatt in so einem eklichen YAML-Dialekt zu schreiben, einfach in stinknormalem Python-Code programmieren. Und das fällt mir viel leichter, als in einem Web-Interface irgendwelche Logik zusammenzuklicken. Ach, du hast ein Beispiel gepostet auf Twitter. Hab ich gar nicht gesehen, nach was... Warum ist denn da meine Katze drin? Wo habe ich denn meine Katze gefilmt? Ach, das ist, wo sie unter dem Teppich versucht, irgendwas rauszuziehen. Ach, die ist doch niedlich, oder? Also, die ist ein bisschen zu dick. Aber das macht sie dann eigentlich noch viel niedlicher. Meine Katze tritt die Mäuse auch. Meine Katze fängt Mäuse, nicht die tritt die Mäuse. Jetzt findet sie den Ball nicht mehr. Wie lange arbeitest du freitags eigentlich? Bis mittags oder wegen? Vier Tage bis nachmittags? Meistens, meistens, entweder bis 13.30 oder bis 14.30, nur. Meistens 13.30. 13.30 bin ich freitags eigentlich auf dem Heimweg. Das funktioniert auch ganz gut. Ich meine, ich arbeite unter der Woche so von, ungefähr von 7 bis 15.30. Das sind ja acht Stunden, wenn du eine Pause abziehst. Ich mache es. Und ich habe ja nur 7,6 Stunden oder so am Tag. Dann passt das, dann kann ich Freitags 13.30 abhauen. Moin Wupplos und Chet, habt ihr schon mal gehört, dass im RZ die Server abspielen, weil die Kühlung zu schwach ist? Nein. Das habe ich noch nie gehört. Die meisten Klimaanlagen im RZ laufen auch überhaupt nicht auf Anschlag. Der Trend ist mittlerweile eh, dass man versucht, nicht kühler zu machen als nötig. Da ist eigentlich immer noch Geserver da. Hallo Clocks HD. Macht es bei dir eigentlich in Frankfurt Sinn, mit dem Auto zur Arbeit zu fahren? Weil du fährst laut deinen Tweets ja sehr oft mit den öffentlichen... Ja und ne, man könnte das machen. Das Problem ist, du brauchst einen Parkplatz. Wir haben bei uns in der Firma keine Parkplätze in dem Sinn. Man müsste sich irgendwas, entweder man fährt ins Parkhaus, was ziemlich teuer ist, oder man mietet sich so einen Stellplatz. Es gibt manche Parkhäuser, wo manche Sachen liegen, da kann man sich so was mieten. Oder man parkt ein bisschen außerhalb, da muss man dann auch wieder eine halbe Stunde laufen. Alles in allem ist es, auch wenn einem die Bahn auf den Sack geht, immer noch angenehmer mit dem Zug zu fahren. Weil ich steige morgen direkt, also ich gehe aus der Haustür, steige direkt in den Zug ein, quasi. Ich bin ja quasi direkt in der Nähe vom Bahnhof. Steige in den Zug ein. Dann fährt das Ding 25 Minuten, eine halbe Stunde. Dann steige ich Frankfurt Süd aus. Und früher bin ich immer von Frankfurt Süd dann mit der U-Bahn noch gefahren, ein Stückchen weiter, zum Willy Brandplatz. Allerdings, mittlerweile laufe ich vom Südbahnhof, das dauert dann noch mal so 25 Minuten. Aber da hat man sich ein bisschen bewegt, weil ich habe gemerkt, dass, ich meine, ich bin jetzt ja auch 35. Also ich bin ein bisschen älter. Und, dass den ganzen Tag vom Rechnersetzen auf der Arbeit, plus dann noch irgendwie daheim am Rechner sitzen, dass das auf Dauer alle möglichen Probleme macht. Führt hauptsächlich, also bei mir hat es hauptsächlich dazu geführt, dass ich nicht richtig pennen konnte. Das mir teilweise den Rücken wehgetan hat. Also das, was mir dann voll zu viel Rechnersetzen hat. Deswegen habe ich mir gedacht, ich laufe jetzt einfach morgens ein Stück und laufe mittags ein Stück. Und dann habe ich mich wenigstens ein bisschen bewegt. Aber das klappt eigentlich ganz gut. Ab und zu laufe ich sogar noch, wenn ich heimkomme. Ja, dann geht das eigentlich halbwegs. Welche Stühle habt ihr bei euch auf der Arbeit genommen? Ergonomische? Ja, die neuen Stühle gefallen mir ehrlich gesagt nicht so gut. Aber die alten Stühle waren sehr nice, die wir hatten. Deswegen habe ich mir den gleichen Stuhl für daheim geholt. Das ist ein... Wie ist der? Sedus Mr.24. Aber sogar glaube ich ein Link. Den gleichen, den der Krieger lustigerweise auch hat. Den da. Ich habe ihn in der Farbe. Das ist der beste Stuhl, den es gibt. Es gibt keinen besseren Stuhl. Ich mache dazu keinen Reflink. Und ich empfehle auch keinem, sich den zu kaufen. Ach so doch, wir haben ja dazu sogar einen Reflink. Wir haben ja sogar fast einen Reflink. Also es ist tatsächlich der beste Stuhl, den man sich wünschen kann im Endeffekt. Allerdings empfehle ich keinem, sich zu kaufen, weil er ist einfach viel zu teuer. Ich hätte mir den auch nicht gekauft, wenn ich quasi den vollen Preis hätte bezahlen müssen. Ich habe den gekriegt in irgendeinem Shop. Der hat anscheinend gerade seinen ganzen Kram verkauft. Da hat er ungefähr 60% vom normalen Preis gekostet. Ich meine, das ist immer noch verdammt viel Geld für einen Stuhl. Aber der Stuhl ist extrem gut. Den habe ich jetzt auch schon ein paar Jahre. Der macht überhaupt keine Anstalten. Der ist wie neu. Also wenn man viel vorm Rechner sitzt, ist es eine Überlegung wert. Allerdings kann es keinem empfehlen, weil es ist einfach zu teuer. Mal schauen, was es bei AliExpress gibt. Kennst du Hermann Miller? Er sagt mir irgendwas. Ich könnte mir sogar... Ist das nicht so ein Stuhldesigner-Typ? Was? Der sieht mir schon viel zu fancy-designed irgendwie aus. Das ist für die Leute, wo der Bauch nicht nur nach da geht, sondern auch schon so in die Seite, dass du die Lehne nicht mehr abspringst. So schlimm ist es bei mir zum Glück nicht. Kostet was? Kostet ungefähr das Gleiche. Also ich würde mir meinen Stuhl auf jeden Fall wiederholen. Das ist der beste Stuhl, den es gibt. Ganz witzig ist, wir hatten mal vor Ewigkeit einen Kollegen auf der Arbeit, der hat es geschafft, also der war sehr füllig, der hat es geschafft, bei seinem Stuhl die Armlehnen abzusprengen. Das war halt nicht so ein Stuhl, das war halt ein normaler Bürostuhl. Und das Stuhl, wo der drauf gesessen hat, hat immer die Armlehnen nach unten gehangen, weil die waren halt rausgesprengt aus dem Rahmen. Das war auch hart. Übrigens Leute, wisst ihr, dass man sowas heute gar nicht mehr sagen darf, das grenzt schon fast an Fatshaming und Hatespeech wieder. Wobei ich das eigentlich sagen darf, ich bin ja selbst nicht der aller Dünste. Allerdings davon bin ich noch ein Stückchen entfernt. Hexo, ihr habt auch die Mr.24 Stühle, die sind super. Die sind top. Ein Stuhl für 1,95 Euro inklusive Versand auf Aliexpress. Zeig mal, schick mal Link. Also ich denke, wenn man schon so viel Bauch hat, dass man nicht mehr gerade in die Toilette rein kann, dann ist zu viel. Wenn man sich quasi umdrehen muss und rückwärts in die Toilette einparken muss, dann ist zu viel. Da ist alles vorbei. Ich habe es euch erzählt, ich habe jetzt fast 8 Kilo abgenommen. Einfach, durch, wer hätte das gedacht, weniger essen. Das habe ich schon vor zwei Wochen erzählt oder so, aber es ist jetzt auch nicht mal weniger geworden. Das wird sich jetzt auch so ein bisschen halten. Übrigens hier, guck mal, Aliexpress Stuhl. Aliexpress Stuhl für 1,95 Euro inklusive Versand. Huge. Gelber Stuhl bei Aliexpress. Ich will nicht wissen, was in diesem Polster drin ist. Also erstens ist er wahrscheinlich in Kinderarbeit hergestellt. Und zweitens ist wahrscheinlich in diesem Polster der Materialabfall von der 3D-Drucker-Herstellung oder sowas drin. Ich meine, das sieht schon billig aus auf dem Bild hier. Ich würde das zu gerne einfach mal bestellen, um zu gucken, was da wirklich ankommt. Einfach nur gucken, was da ankommt. Was ist das für ein hässlicher Stuhl hier neben? Hallo, das habe ich nicht ausgewählt. Was ist das für ein hässlicher Stuhl? Stretchstuhl. Das ist aber geil, oder? Wie groß ist der? Eine gute Frage. Manuelle Messung. Es wird ein Fehler von ca. 1 cm. Und manchmal die Farbe vielleicht haben weniger Fehler. Oh, verstehe. Ich hoffe, Sie verstehen können. Danke im Voraus. Ich kann nur schwer verstehen, ehrlich gesagt. Ich glaube, er möchte uns mitteilen, dass das, was hier steht, nicht unbedingt zutreffen muss, dass es abweichen kann um bis zu 1 cm. Wie wäre es mit Höhe? Also D ist was? 42 cm. Also dann ist der Stuhl irgendwie 80 cm oder so. Insgesamt hoch, ungefähr. Es scheint ein ganz normaler Stuhl zu sein. Aber Qualität genial. Ich bin sehr zufrieden. Die Qualität ist bestimmt absolut genial bei dem 1,95 Euro Stuhl. Bestimmt die beste Qualität überhaupt. Oh, der ist gerade reduziert. Ja, guck mal. Normalerweise kostet er ja unglaubliche Wuche. 4 Euro kostet er normalerweise. Das ist ja voll übertrieben. 4 Euro für einen Stuhl. Wer gibt 4 Euro für einen Stuhl aus? Näh. Also 1,60 Euro lasse ich mit mir reden, aber für 4 Euro nicht. Ach, bei dem anderen geht es so um die Abdeckung. Ach, das ist nur die Abdeckung. Das ist gar nicht der Stuhl. Lol, she baited. Da steht es. Das ist nur die Abdeckung. Geil. Ja, dieses hässliche Ding hier darüber. Okay, ja, das ergibt ein bisschen mehr Sinn. Weil ich wollte gerade sagen, so 1,60 Euro für einen Stuhl ist schon verdammt wenig. Das ist übrigens auch was, was ich gerne in Videos machen würde. Ich bestelle ja mittlerweile relativ viel China-Kram und generell online viel. Das hatte ich eh vor, dass ich ab und zu mal ein Video mache. Also wenn ich dann wirklich mal wieder Videos mache und auch ein bisschen mehr Technik-Videos mache, wo ich einfach mal so die neuesten Sachen, die neuesten interessanten Sachen zeige, die ich gekauft habe. Zum Beispiel die China-Steckdosenleiste, die man flashen kann. Oder den 50er-Pack USB-Kabel, die übrigens immer noch nicht da sind. Nur mal angemerkt. Und ich frage mich, ob es wirklich jetzt ein 200er-Pack oder echt nur der 50er-Pack ist. Ich meine, ich habe nur einen 50er-Pack bestellt. Aber man weiß ja nie, ne? Der Sebaro hat einen Stuhl für 9 Dollar gefunden. Ja, 9 Dollar lasse ich mir so einen billigen Holzstuhl-Lock gefallen. Einfach eine Kamera an die Decke hängen und mit der Elgato captchern. Ja, könnte man machen. Da brauche ich ein bisschen ordentliche Beleuchtung. Ja, habe ich ja da, müsst ihr halt mal rüber holen. Findest du, dass Made in China mittlerweile einen besseren Status haben sollte, als der traditionell hat? Made in China oder generell, das ist halt sehr gemischt, ne? Du kannst den Ultra-Crab aus China bestellen. Und du kannst gutes Zeug aus China bestellen. Allerdings, es ist im Prinzip ein bisschen wie hier. Die billigen Sachen sind meistens Crab und die teuren Sachen haben zumindest das Potenzial gut zu sein. Also ich finde schon, dass Made in China oder generell China-Produkte teilweise zu unrechtend schlechten Ruf haben. Zum Beispiel den Staubsauger-Roboter, den ich mir gekauft habe. Der ist besser als das, was du hier kriegst für einen unschlagbaren Preis. Wenn er im Angebot ist, wohlgemerkt. Sind die China-Sachen aber laufend irgendwo. Ja, und der Eiskäuter hat Recht. Wenn es um Elektronik-Teile geht, dann kann man die bedenkenlos aus China bestellen, weil die Teile an sich sind entweder nachgebaut, aber bei einzelnen Elektronik-Teilen ist das nicht so wild. Entweder machen sie das, wofür sie da sind, oder sie machen das nicht. Oder es ist exakt der gleiche Kram. Ob du jetzt einen Widerstand holst von hier oder eine Kiste mit Widerstand aus China bestellst, ist wurscht. Du kannst mit China-Zeug schon ganz schön gescampt werden. Ich würde mir beispielsweise keine Grafikkarte aus China kaufen und auch keine CPU aus AliExpress, weil die sind ja bekannt dafür, dass sie beispielsweise alte Nvidia-Karten nehmen und quasi nur das BIOS flashen und sie dann als was Neues verkaufen. Oder dass sie, also man muss aber schon sagen, die Chinesen sind echt erfinderisch. Die haben hier Intel-CPUs. Das sind tatsächlich echte Intel-CPUs, allerdings sind das alte Notebook-CPUs, die sie quasi an einem Desktopsocket dran gepappt haben. Ich sehe jetzt hier keinen. Aber die Chinesen sind da echt erfinderisch, was das angeht. Also das würde ich mir nicht unbedingt kaufen. Ein Elektronik-Teil auf jeden Fall. Bring dir dieselbe Leistung. Ja, dieselbe Leistung, wie sie in dem Notebook auch gebracht haben. Call to do in 2K19 in China. Du kriegst bei AliExpress mehr oder weniger alles. Es gibt nichts, was du nicht auf AliExpress kriegst. Also nichts, was halbwegs üblich ist. Du kriegst alles auf AliExpress, alles. Außer Essen. Oder haben die auch Food? Nee, haben sie nicht. Doch, Sebaro, klar, gibt es auch. Gibt alles. Gibt mehr als bei Amazon, es gibt alles bei AliExpress. Es gibt für Sebaro wahrscheinlich sogar Waifu-Pillows. Bam, Waifu-Pillows für Sebaro. Die gibt es alles, alles auf AliExpress. Falls das was üblich ist. Nix Monkathos war alles angezogen. Nachtbot, abonniert auf Stufe 1. Danke schön. Ja, Eiskräuter ist so. Ich kaufe den ganzen Sensor-Kram auch noch in China. Man muss halt manchmal ein bisschen warten. Aber am besten ist, man bestellt sich halt dann ordentliche Mengen auch aus China. Also nicht irgendwie ein Sensor und losschicken. Nee, man bestellt sich alle möglichen Sensoren, die man braucht. Am besten natürlich beim gleichen Shop. Wie gesagt, AliExpress ist ja nicht so wie Amazon. Sondern AliExpress ist eher wie Amazon Marketplace. Und dann bestellt man sich halt von jedem Sensor 10 Stück. Und dann halt alle möglichen Sensoren, die man braucht. Da lohnt es sich auch da was einzukaufen. Wenn ich sage, will ich ein vierfaches Naiso reroll. Ja, dann musst du erst mal suppen. Sobald du suppst, dann können wir uns da drüber unterhalten. Twitch Prime ist auch okay. Sagt keiner, was ging. Für mich zählt Twitch Prime genauso. Wir diskriminieren hier keine Twitch Prime Benutzer. Hattest du eigentlich schon mal Probleme mit Zoll wegen AliExpress? Nee. Ich hatte bisher nur Probleme mit Zoll, wenn ich quasi ganz korrekt beispielsweise aus den USA bestellt habe. Also so richtig auch mit allem, wie man das so macht. Da musst du dann FAT bezahlen, dann musst du Mehrwertsteuer bezahlen und du musst, wenn es über 150 Euro ist, noch Zollgebühren bezahlen. Bei AliExpress ist es so. Wie viel bekommt man denn von den Fünften ab? Das ist eine gute Frage. Ich glaube standardmäßig ohne extra custom Twitch Vertrag. Ich glaube die Hälfte. Ich müsste mal nachgucken. Ich glaube die Hälfte. Also ich hatte noch nie Zollprobleme mit AliExpress. Das liegt aber auch daran, dass sie das glaube ich recht geschickt machen mittlerweile. Wenn du den normalen Versandweg nimmst bei AliExpress, dann kommt das dann mit irgendeinem Schiff aus China oder so. Die kommen dann in Rotterdam, in Niederlanden irgendwo an. Und von da geht es mit PostNL weiter. Also ich habe ehrlich gesagt keine Ahnung, ob AliExpress Sendungen jemals den Zoll sehen. Ich weiß nicht an welcher Stelle das gemacht werden müsste. Eigentlich müsste das ja in Niederlanden gemacht werden, wenn sie da landen. Keine Ahnung wie sie das machen. Und dazu kommt noch, dass die wahrscheinlich auch einfach die Sachen sehr optimistisch deklarieren. Die deklarieren es ordnungsgemäß. Allerdings was sie draufschreiben, wird wahrscheinlich nicht unbedingt immer so der Realität entsprechen. Du hast darüber einen Arbeitgeschirm, okay. China hat in Griechenland einen Hafen aufgekauft. Sehr gut, in Griechenland war wahrscheinlich der Hafen auch billig. Machst du irgendwann mal wieder eine Runde BF3 Metacommunity? Könnte man machen. Wo machst du am liebsten Urlaub? Also bisher muss ich sagen am besten. Also der beste Urlaub war in der Türkei. Allerdings ist das schon ewig her. Aber auch nur weil wir da mit mehreren Leuten da waren. Am besten gefallen, würde ich sagen, hat es mir auf Gran Canaria. Das hat mir am besten gefallen, ja. Also von drum herum. Gran Canaria beste, ja. Wie schauen deine Urlauber aus? Bahnurlaub oder Sachen anschauen? Beides, beides. Allerdings, ich muss dir ehrlich sagen, ich glaube, ich war die letzten fünf Jahre nicht mehr irgendwo so klassisch im Urlaub. Wo ich noch mal hinfahren würde, ist nach Island. Allerdings muss ich auch sagen, so richtig in den Urlaub fahren, da brauchst du ja noch Leute, die mitgehen. Ich bin jetzt nicht mehr in dem Alter, wo ich da jetzt irgendwie großartige EL-Freunde hätte, die da mitfahren. Die sind ja selbst alle beschäftigt mit Familie, Kinder, sonst was. Tja, und deswegen denke ich mal, bis ich vielleicht mal irgendwann, zumindest sagen wir mal Kinder außen vor, ja. Aber bis dahin werde ich wahrscheinlich dann erst mal nicht in den Urlaub fahren, weil alleine habe ich keinen Bock. Was natürlich nicht verkehrt ist, weil die letzten paar Jahre habe ich so gemacht, ich habe einfach zu den Zeitpunkten, wo alle Urlaub wollten, habe ich nie Urlaub genommen. Und dafür habe ich mich dann immer von der Arbeit den kompletten Dezember verpisst. Deswegen habe ich eigentlich den kompletten Dezember immer Zeit für Stremsoren und Videos. Wenn ich Videos mache. Aber ich mache ja letztendlich wenige Videos, ich weiß. Aber im Dezember habe ich immer einen ganzen Monat Zeit. Ich mache immer ein paar Debate-Videos, ja. War da nicht der Krieger? Was hältst Du von 360 Kameras? In welchem Anwendungsgebiet, wofür, genau? Weil für normale Aufnahmen sind die ja nichts. Das sieht ja ein bisschen rund aus. Aber 360 Kameras für normales Zeug. Außer halt vielleicht mit VR-Brille, dass man sich dann da drinnen dreht und immer nur einen Teil angezeigt kriegt oder sowas. Kreuzfahrtschriften sind voll mit Rentnern, kein Schimmer. Aber ich kenne ein paar Leute, die sind auch schon im Urlaub auf Kreuzfahrtschiff gegangen, das sind keine Rentner. Aber auf ein Kreuzfahrtschiff müsste ich ehrlich gesagt nicht. Gammelst Du da den ganzen Tag ums Schiff rum? Naja, ein paar Sachen angucken ist schon nicht verkehrt. Wobei ich halt keinen Bock habe auf dieses Standard-Tourismus-Kulturprogramm. Da hat ja jedes Land und jede Ecke so 4-5 Sehenswürdigkeiten, wo es alle Touristen hinkaren. Willst Du zu dem Video reacten? Ich glaube, das kenne ich. Ich glaube, das kenne ich. Jaja, das kenne ich. Das ist richtig gut. Haha, das ist gut. Das kenne ich. Das können wir uns angucken. Das Video ist wirklich lustig. Das Video ist wirklich lustig. Also für alle JavaScript-Fans, die müssen jetzt stark sein. Das ist lustig. Das geht auch nur. Das geht auch nur 4 Minuten oder so. Ach, Ruby? Nicht JavaScript. Ja. Das ist tatsächlich ein bisschen unlogisch. Ja, das ist Ruby. Das ist typischer Ruby-Style. Das verwirrt jeden, der mit Ruby anfängt. Diese Method-Missing-Geschichte. Das ist Ruby. Das ist Ruby-Logik. Wie das funktioniert, ist eigentlich ganz einfach. Diese Funktion, Method-Missing, wird aufgerufen, immer wenn Du was aufrufst, was es nicht gibt. Und in dem Fall nimmt er halt die Sachen, die es nicht gibt, als Argumente hierfür und macht einen String draus. Das stimmt. Das stimmt. Das ist wirklich cool bei Ruby. Alter, warum pissen Sie sich so weg? Übertreibt man nicht. Ja, jetzt kommt der gute Teil. Wisst ihr, was rauskommt? Was kommt raus? Leeres Array plus leeres Array? Lass mal überlegen. Das ist JavaScript. Also logisch wäre, leeres Array plus leeres Array gibt ein leeres Array. Die Frage ist nur, ob man in JavaScript leere Arrays mit Plus überhaupt zusammenhängen kann. Und ich denke mal, das geht nicht. Deswegen wird er wahrscheinlich versuchen, das Array umzuwandeln in irgendeinen Typ, den man addieren kann. Das heißt, das, was der Sebaro sagt, ist gar nicht so unlogisch, dass da not a number rauskommt. Aber es kann alles sein. Das ist JavaScript. Was? Warum? Wandelt der leeres Array um in den String und leeres String plus leeres String ist leeres String oder was? Ach du Scheiße, keine Ahnung. Da kommt jetzt not a number raus. Irgendwann muss in JavaScript immer not a number rauskommen. Okay, das mit Object ergibt sogar halbwegs Sinn. Halbwegs. In JavaScript-Logik ergibt das sogar halbwegs Sinn. Das ist ein Object, ein leeres. Aber es ist ein Object. Und das ist ein Array. Und das zusammen ist ein Object Array. Oder? Wie auch immer. Ist das überhaupt ein Object Array oder ist das nur ein Object? Nur ein Object, ne? Wo ist das Array hin? Ja, leider noch keine Sub-Eigens. Ich hab's noch nicht auf die Reihe gekriegt. Mir haben auch die guten Ideen gefehlt. Das ist jetzt not a number. Ich hab mir an gewöhnt, wenn man in JavaScript keine Ahnung hat was rauskommt, man muss es nur oft genug in verschiedenen Kombinationen probieren und irgendwann kommt not a number raus. Und eines ist es Null. Ich hab keine Ahnung warum da Null rauskommt. Okay, das ist wir. Das ist nice. Not a number. Endlich haben wir mal not a number. Das ist richtig. Pepega. Alter, wie sie sich wegpissen. Endlich mal ein Talk Publikum was gut drauf ist. Naja, da weiß ich jetzt was kommt. Da kommt jetzt Batman gleich. Voll klar, dass da 16 Kommas rauskommen. Wobei die 16 Kommas wahrscheinlich intern sowas sind Null, Null, Null, Null, Null, Null, Null, Null. Also sprich der Wandel das einfach, dass man es besser lesbar kann um in eben ne String Repräsentation von dem Inhalt von dem Array. Und es ist halt einfach Null, nächstes Element, Null, nächstes Element. Also das ergibt Sinn. Das ergibt auch Sinn. Du joins halt Null. Du joins 16 mal Null mit Wort zusammen. Das ist okay. Das ist ja im Prinzip das Trennzeichen. Und es ist halt nichts dazwischen. Das ergibt auch noch Sinn. Okay, das leuchtet mir auch noch irgendwo ein. Das ist ne gute Frage. Was kommt da raus? Macht er dann nur noch wahr raus? String minus eins. Was könnte das? Not a number. Da kommt jetzt, da kommt jetzt Not a number raus Leute. Not a number. Das ist das einzige was ich mir irgendwie erklären könnte. Ja, das kenn ich. Klar, das hab ich auch schon ein paarmal an Stream gezeigt. Das ist ja wirklich, das ist sau bekannt die Geschichte jetzt. Was da rauskommt. Da kommt jetzt Na Na Na Na Na Na Na Batman raus. Wieso gehen die alles so ab? Weil es halt die krassen Programmergeeks sind. Find das auch lustig? Und nicht so lustig, sondern ich find das wirklich lustig. Und die sind halt mal gut drauf. Endlich mal ein Talk mit Publikum was gut drauf ist. Ich mein okay die eskalieren halt voll jetzt, aber es ist schon abgedreht muss man sagen. Ich mein ich kenn das hier schon jetzt. Das ist bekannt. Das ist sau bekannt. Das ist ein guter Talk. Das ist ein guter Talk. Das Publikum ist so eingespielt. Nein, die finden das einfach lustig. Die finden das lustig. Das ist, also wenn man JavaScript Programmierer ist oder überhaupt wenn man ein bisschen was damit zu tun hat und schon mal JavaScript wirren gesehen hat, dann ist das, das ist tatsächlich echt lustig. Ja Sebaro, warum hatten wir überhaupt einen Discord Invite Link, der nur in den Weep Channel geführt hat? Haben wir mittlerweile einen ordentlichen Invite Link? Ich will die Leute nicht standardmäßig abschrecken, also nicht defaultmäßig abschrecken, wenn sie im Weep Channel rauskommen und dass Sebaro nachts um 2 Uhr Dinger postet. Ja dann Ray dann bist du halt da immun dagegen, kann ja sein. Echt war das lustig. Wie heißt das JS Ding von Microsoft, was da jetzt kommt? Kommt ein JS Ding von Microsoft? Ich weiß nur, dass Bing jetzt Chrome ist. Oder man zu Blazer, was wir uns gestern angeguckt haben. Blazer haben wir uns gestern angeguckt, allerdings Blazer ist kein JavaScript, Blazer ist ein komplettes.NET im Browser und auch hat mit JavaScript gar nichts zu tun. Ja Bildschirmarbeiter, das ist gefährlich, das habe ich auf der Arbeit auch gemacht im Discord und jetzt fragt mich Discord nicht mehr, ob ich wirklich weiter klicken will im Discord Channel und wenn ich jetzt ausversehen auf den Weep Channel im Discord klick, kommen da irgendwelche nacken Anime Grills. Das ist nicht so sinnvoll, wenn ich das auf dem Monitor auf der Arbeit anzeige. Willst du Monka Vinval in den Chatclient packen? Funktioniert nicht, weil der Chatclient ist, also wenn du den hier meinst, der ist, die Emotes sind gefaked, das ist mit einem Browser Addon und wenn das kein offizielles Emote ist, funktioniert es nicht. Das Overlay ist genauso, das ist ein Overlay von Streamlabs und das zeigt nur Emotes an die offiziell in dem Channel drin sind, das heißt ich müsste bei FFZ quasi Monka Vin oder so was oder Java S haben wir ja auch auf dem Discord, müsste ich dann als offizielles Emote einreichen bei FFZ, dass ich es bei mir im Channel hinzufügen könnte. Muss ich mal überlegen, wie wir das machen. Ich hätte viel lieber so Emotes in der Richtung direkt auf Twitch, also ich will auf jeden Fall ein Java Flame Emote, was man immer mal verwenden kann. Da kann ich es rein machen. Ich habe mir auch schon überlegt, was auch ein richtig gutes Windows Emote wäre, ist hier easy, bloß mit blauen Gläsern für Blue Screen. Das wäre auch ein ganz gutes Emote. Wo ist denn das Bild für Monka Vin? Oh, das Stream ist on. Wer hätte das gedacht? Ist hier Monka Vin drin? Ah hier, das kann man ja Link öffnen, speichern. Monka S3, ok gut. Was? Monka S3, ja nice. Ist ja auch drin. Monka Vin. Monka, hm, ja das könnte ich echt noch machen. Ok, mal gucken, wen wir hosten können. Ich programmiere mir die Welt, wen haben wir denn da? Was programmiert er denn? Was ist das? WordPress? Das ist WordPress? Autofill to Challenger, was ist das? Das ist.NET, das ist mir schon mal sympathisch. NoobDevTV, das ist auch.NET. Und ganz viele Messages hier neben. Was programmiert er da? Eine Minecraft-Klone oder was gibt das? Local Chunk Cache. Daran hätten wir noch zu bieten. Android Flutter App, der ist jeden Tag on, ne? Den haben wir jetzt schon öfters gesehen. Nee, das ist ein anderer. Und der 3D-Drucker ist natürlich am Start, wer sonst? Was, wer ist geil? Sharks Development. Der da? Autofill to Challenger? Der macht es richtig. Console Debugging, das einzig wahre. Das hört sich jetzt so an, als will ich den Flame, will ich gar nicht. Macht das selber so. Wer braucht schon Debugger? Beste. Console Debugging. Ja, er ist natürlich nur halb ernst gemein, das hat schon seinen Anwendungszweck. Aber für einfache Sachen ist beste. Redi sagt, nichts geht über Console Debugging. Wirtschaftswissenschaften im Studium, das hat immer null Zuschauer. Das liegt aber einfach auch daran, weil BWL-Shit einfach langweilig ist. Ich mein, wer guckt sich freiwillig BWL-Kram auf Twitch an? Das ist schon schlimm genug, wenn man das machen muss. Macht das weg. Ja, jetzt kommen immer welche, die es angeblich gucken. Pigs all didn't happen. Ich glaube euch kein Wort, dass ihr das guckt. Was programmiert er denn eigentlich? Was programmiert er denn hier? Models? Main? Das sieht nur ein bisschen nach WPF aus. Login-Window. Ein Twitch-Bot. Ja, ergibt Sinn. Der macht's richtig. Erstmal in Ruhe zurücklehnen, überlegen, so macht man's. Den hausdicht, der ist gut. Okay Leute, also. Wir sehen uns die Tage wieder. Bis dahin, monkaWin. Und wir sehen uns. Bis denn, CU.", "segments": [{"id": 1, "start": 90.0, "end": 95.0, "text": "N-n-n-nice, nice!"}, {"id": 2, "start": 120.0, "end": 125.0, "text": "N-n-n-nice, nice!"}, {"id": 3, "start": 150.0, "end": 155.0, "text": "N-n-n-nice, nice!"}, {"id": 4, "start": 180.0, "end": 186.0, "text": "N-n-n-nice, nice!"}, {"id": 5, "start": 210.0, "end": 216.0, "text": "N-n-n-nice, nice!"}, {"id": 6, "start": 240.0, "end": 245.0, "text": "N-n-n-nice, nice!"}, {"id": 7, "start": 270.0, "end": 275.0, "text": "N-n-n-nice, nice!"}, {"id": 8, "start": 300.0, "end": 305.0, "text": "N-n-n-nice, nice!"}, {"id": 9, "start": 330.0, "end": 335.0, "text": "N-n-n-nice, nice!"}, {"id": 10, "start": 360.0, "end": 365.0, "text": "N-n-n-nice, nice!"}, {"id": 11, "start": 390.0, "end": 395.0, "text": "N-n-n-nice, nice!"}, {"id": 12, "start": 420.0, "end": 425.0, "text": "N-n-n-nice, nice!"}, {"id": 13, "start": 450.0, "end": 455.0, "text": "N-n-nice, nice!"}, {"id": 14, "start": 480.0, "end": 485.0, "text": "N-n-nice, nice!"}, {"id": 15, "start": 510.0, "end": 515.0, "text": "N-n-nice, nice!"}, {"id": 16, "start": 540.0, "end": 545.0, "text": "N-n-nice, nice!"}, {"id": 17, "start": 570.0, "end": 575.0, "text": "N-n-n-nice, nice!"}, {"id": 18, "start": 600.0, "end": 605.0, "text": "N-n-n-nice, nice!"}, {"id": 19, "start": 630.0, "end": 635.0, "text": "N-n-n-nice, nice!"}, {"id": 20, "start": 660.0, "end": 665.0, "text": "N-n-nice, nice!"}, {"id": 21, "start": 690.0, "end": 695.0, "text": "N-n-nice, nice!"}, {"id": 22, "start": 720.0, "end": 725.0, "text": "N-n-nice, nice!"}, {"id": 23, "start": 750.0, "end": 755.0, "text": "N-n-nice, nice!"}, {"id": 24, "start": 780.0, "end": 785.0, "text": "N-n-nice, nice!"}, {"id": 25, "start": 810.0, "end": 815.0, "text": "N-n-nice, nice!"}, {"id": 26, "start": 840.0, "end": 845.0, "text": "N-n-nice, nice!"}, {"id": 27, "start": 870.0, "end": 875.0, "text": "N-n-nice, nice!"}, {"id": 28, "start": 900.0, "end": 905.0, "text": "N-n-nice, nice!"}, {"id": 29, "start": 930.0, "end": 935.0, "text": "N-n-nice, nice!"}, {"id": 30, "start": 960.0, "end": 965.0, "text": "N-n-nice, nice!"}, {"id": 31, "start": 990.0, "end": 995.0, "text": "N-n-nice, nice!"}, {"id": 32, "start": 1020.0, "end": 1026.0, "text": "N-n-nice, nice!"}, {"id": 33, "start": 1050.0, "end": 1055.0, "text": "N-n-nice, nice!"}, {"id": 34, "start": 1080.0, "end": 1085.0, "text": "N-nice, nice!"}, {"id": 35, "start": 1110.0, "end": 1116.0, "text": "N-n-nice, nice!"}, {"id": 36, "start": 1140.0, "end": 1145.0, "text": "N-n-nice, nice!"}, {"id": 37, "start": 1170.0, "end": 1175.0, "text": "N-n-nice, nice!"}, {"id": 38, "start": 1200.0, "end": 1205.0, "text": "N-n-nice, nice!"}, {"id": 39, "start": 1230.0, "end": 1235.0, "text": "N-nice, nice!"}, {"id": 40, "start": 1260.0, "end": 1265.0, "text": "N-n-nice, nice!"}, {"id": 41, "start": 1290.0, "end": 1295.0, "text": "N-nice, nice!"}, {"id": 42, "start": 1320.0, "end": 1325.0, "text": "N-n-nice, nice!"}, {"id": 43, "start": 1350.0, "end": 1355.0, "text": "N-nice, nice!"}, {"id": 44, "start": 1380.0, "end": 1385.0, "text": "N-nice, nice!"}, {"id": 45, "start": 1410.0, "end": 1415.0, "text": "N-nice, nice!"}, {"id": 46, "start": 1440.0, "end": 1445.0, "text": "N-nice, nice!"}, {"id": 47, "start": 1471.0, "end": 1476.0, "text": "N-n-nice!"}, {"id": 48, "start": 1475.0, "end": 1480.0, "text": "N-n-nice!"}, {"id": 49, "start": 1476.0, "end": 1481.0, "text": "N-n-nice!"}, {"id": 50, "start": 1482.0, "end": 1487.0, "text": "N-nice!"}, {"id": 51, "start": 1485.0, "end": 1490.0, "text": "N-nice, nice!"}, {"id": 52, "start": 1488.0, "end": 1493.0, "text": "N-n-nice!"}, {"id": 53, "start": 1490.0, "end": 1495.0, "text": "N-nice, nice!"}, {"id": 54, "start": 1495.0, "end": 1497.0, "text": "Ich wollte nicht den hier abspielen"}, {"id": 55, "start": 1500.0, "end": 1505.34, "text": "Oktober 2018 habe ich ein Video zu 9900K gemacht, den geköpft, als der neu auf den Markt kam"}, {"id": 56, "start": 1505.34, "end": 1507.34, "text": "Oh ja, das habe ich geguckt"}, {"id": 57, "start": 1507.34, "end": 1511.34, "text": "Das ist das Video, wo ich mir abgeguckt habe, wie man 8700K köpft"}, {"id": 58, "start": 1511.34, "end": 1513.34, "text": "Furchtbar eingeköpft habe"}, {"id": 59, "start": 1513.34, "end": 1517.34, "text": "Und dann habe ich eben analysiert, warum das so ist und Intel oder die Art wie Intel"}, {"id": 60, "start": 1517.34, "end": 1523.34, "text": "Und er hat damals auch gesagt, ich kenne das Video noch, er hat damals auch gesagt, wie scheiße das ist, dass Intel den Kram nicht verlötet"}, {"id": 61, "start": 1523.34, "end": 1530.34, "text": "Und damals haben sich wahrscheinlich alle aufgeregt, alter, kack, kack AMD Fanboy oder sowas"}, {"id": 62, "start": 1530.34, "end": 1532.34, "text": "Und jetzt ist es umgedreht, so hängen geblieben"}, {"id": 63, "start": 1532.34, "end": 1535.34, "text": "Der Video verlötet ist halt so, wenn man die köpft, dann holt man halt trotzdem 8-9 Grad raus"}, {"id": 64, "start": 1535.34, "end": 1537.34, "text": "Auch das hat Intel nicht gefallen"}, {"id": 65, "start": 1537.34, "end": 1539.34, "text": "Das könnt ihr mir glauben"}, {"id": 66, "start": 1539.34, "end": 1544.34, "text": "August 2018 habe ich 8 Videos gebracht zum Thema Epic Overclocking"}, {"id": 67, "start": 1544.34, "end": 1548.34, "text": "Ein Thema, was mir persönlich sehr viel Spaß gemacht hat"}, {"id": 68, "start": 1548.34, "end": 1555.34, "text": "Was ist das da unten? Sieht aus wie auf irgendwie, wie in so einem Freizeitpark so eine Wasserrutsche oder so"}, {"id": 69, "start": 1555.34, "end": 1561.34, "text": "Nicht so sehr, weil die natürlich nicht wollten, dass man AMD, Epic oder Server CPUs übertaktet"}, {"id": 70, "start": 1561.34, "end": 1565.34, "text": "Leider wurde dem ganzen auch ein Riegel vorgeschoben, also diese Sicherheitslücke, die wir genutzt haben"}, {"id": 71, "start": 1565.34, "end": 1567.34, "text": "Da fuck, was ist das?"}, {"id": 72, "start": 1571.34, "end": 1575.34, "text": "Ist das flüssig? Ist das hier wieder Stickstoff oder was ist das?"}, {"id": 73, "start": 1575.34, "end": 1577.34, "text": "Oder was macht der da?"}, {"id": 74, "start": 1577.34, "end": 1582.34, "text": "Also es ist keine Sicherheitslücke, aber die Lücke, die wir genutzt haben, um die Epic CPUs zu übertakken, die wurde leider geschlossen"}, {"id": 75, "start": 1582.34, "end": 1585.34, "text": "Also bei den kommenden CPUs ist es so leider nicht mehr möglich"}, {"id": 76, "start": 1585.34, "end": 1587.34, "text": "Strömungstest, okay"}, {"id": 77, "start": 1587.34, "end": 1593.34, "text": "Dann April 2018 habe ich Zen Plus, also den 2700X geköpft"}, {"id": 78, "start": 1593.34, "end": 1598.34, "text": "Zum Beispiel da habe ich auch gesagt, ey, Top verlötet, lohnt sich nicht, macht es nicht"}, {"id": 79, "start": 1598.34, "end": 1603.34, "text": "Januar 2018, ein großes Thema Thread-Typer gegen Epic"}, {"id": 80, "start": 1603.34, "end": 1609.34, "text": "Da war auch wieder so, da kam das den Leuten so vor, der macht so richtig krassen Content die ganze Zeit gegen Thread-Typer"}, {"id": 81, "start": 1609.34, "end": 1617.34, "text": "Angefangen hat dieses ganze Thema nur, ich hatte einen Thread-Typer vor Lounge, nicht von AMD, aber ich hatte einen vor Lounge"}, {"id": 82, "start": 1617.34, "end": 1619.34, "text": "Und dann habe ich den geköpft"}, {"id": 83, "start": 1619.34, "end": 1627.34, "text": "Und dann habe ich ein Video dazu gemacht, habe AMD gefragt, ey, es ist doch nächste Woche, dieses Embargo wird aufgehoben, dass wir Unboxings zeigen dürfen"}, {"id": 84, "start": 1627.34, "end": 1634.34, "text": "Da habe ich gesagt, worunter fällt eine CPU Köpfen? Ich zeige ja keine Leistung, ich öffne ja nur die CPU-Feld, das ist unter Unboxing"}, {"id": 85, "start": 1634.34, "end": 1637.34, "text": "Sagt AMD zu mir, ja, kannst du posten"}, {"id": 86, "start": 1637.34, "end": 1642.34, "text": "Poste ich das Video, ein Tag später schreibt mir AMD, dieses Video muss sofort offline"}, {"id": 87, "start": 1642.34, "end": 1646.34, "text": "Das ist so geil, das hast du öfters, dass sie nicht genau wissen"}, {"id": 88, "start": 1646.34, "end": 1649.34, "text": "Also ich weiß nicht, was das Standard ist bei AMD"}, {"id": 89, "start": 1649.34, "end": 1661.34, "text": "Aber so hin und her hatte ich damals auch bei, muss ich ein bisschen ausholen, EA hatte damals die erste Iteration ihrer Creator-Plattform"}, {"id": 90, "start": 1661.34, "end": 1663.34, "text": "RonKu hieß das damals"}, {"id": 91, "start": 1663.34, "end": 1668.34, "text": "Und da waren sie sich mit den Regeln für ihre Videos auch teilweise nicht so ganz einig"}, {"id": 92, "start": 1668.34, "end": 1674.34, "text": "So, wenn man da viel Zeit rein investiert und auch Geld in solche Videos"}, {"id": 93, "start": 1674.34, "end": 1680.34, "text": "Und dann, wenn nur ein Teil der Views entstanden ist und man wird gezwungen, das offline zu nehmen"}, {"id": 94, "start": 1680.34, "end": 1685.34, "text": "Während alle anderen Medien, das schon aufgegriffen haben, sich das im Internet verteilt"}, {"id": 95, "start": 1685.34, "end": 1688.34, "text": "Dann ist es natürlich total dämlich, das Video offline zu nehmen, musste ich dann aber tun"}, {"id": 96, "start": 1688.34, "end": 1697.34, "text": "Und dann kam dann zum Beispiel von AMD ein Statement, weil ich hatte dann gesagt, okay, hier sind vier Chips drauf auf den 30-Bit-CPUs"}, {"id": 97, "start": 1697.34, "end": 1701.34, "text": "Deswegen ist es wahrscheinlich technisch identisch zu Epic"}, {"id": 98, "start": 1701.34, "end": 1708.34, "text": "Oder es kommt halt entweder noch ein 32-Kanon-Threadripper, weil es gab einfach technisch gesehen keine andere logische Erklärung"}, {"id": 99, "start": 1708.34, "end": 1713.34, "text": "Warum sollte man vier Chips drauf machen, wenn man die Hälfte davon quasi verschwendet"}, {"id": 100, "start": 1713.34, "end": 1716.34, "text": "Die einzige logische Erklärung war, es ist ein 32-Kanon-Threadripper"}, {"id": 101, "start": 1716.34, "end": 1724.34, "text": "Kam AMD Statement 9, die CPU, DICE, die haben keine Schaltkreise drauf, die sind Dummies"}, {"id": 102, "start": 1724.34, "end": 1729.34, "text": "Da dachte ich mir, macht keinen Sinn, also wo wir wieder bei dem Thema wären, Marketing, das keinen Sinn ergibt"}, {"id": 103, "start": 1729.34, "end": 1736.34, "text": "Dann habe ich das aufgegriffen, habe ein Video dazu gemacht, habe die Chips analysiert, habe gesehen, okay, es sind Schaltkreise drunter, es muss ein 32-Kanon-Threadripper kommen"}, {"id": 104, "start": 1736.34, "end": 1741.34, "text": "Was ist passiert, ein halbes Jahr später kam ein 32-Kanon-Threadripper, aber erst mal so hinstellen, als wären meine Aussagen falsch"}, {"id": 105, "start": 1741.34, "end": 1747.34, "text": "Diese Dinge sind einfach natürlich Sachen, ich fühle mich dadurch jetzt nicht persönlich angegriffen oder sowas"}, {"id": 106, "start": 1747.34, "end": 1754.34, "text": "Aber es macht mir natürlich unheimlich Spaß, dann darauf einzugehen und damit zu spielen, könnt ihr wahrscheinlich auch irgendwo nachvollziehen"}, {"id": 107, "start": 1754.34, "end": 1763.34, "text": "Zum Beispiel August 2016, das ist ein bisschen weiter zurück, habe ich ein Video gemacht, wo ich die NVIDIA High Bandwidth SLE Brücke analysiert habe"}, {"id": 108, "start": 1763.34, "end": 1768.34, "text": "Da habe ich mir angeschaut, wie sie so eine NVIDIA High Bandwidth SLE Brücke analysiert haben"}, {"id": 109, "start": 1768.34, "end": 1772.34, "text": "Man braucht, wozu soll das gut sein?"}, {"id": 110, "start": 1772.34, "end": 1783.34, "text": "Entweder ist das SLI und das funktioniert, oder das funktioniert nicht, braucht man da echt eine High Bandwidth Bridge, was auch immer"}, {"id": 111, "start": 1783.34, "end": 1793.34, "text": "SLI Brücke aus, also die kam ja vor NVLink, da wurde gesagt, es gibt jetzt diese neuen High Bandwidth SLE Brücken, die können viel mehr Daten übertragen"}, {"id": 112, "start": 1793.34, "end": 1796.34, "text": "Die sind technisch viel aufwendiger als normale SLI Brücken usw."}, {"id": 113, "start": 1796.34, "end": 1803.34, "text": "Dann habe ich da Röntgenanalysen machen lassen von den SLI Brücken und habe quasi gezeigt, dass die SLI Brücken genauso sind wie vorher"}, {"id": 114, "start": 1803.34, "end": 1807.34, "text": "Und einfach nur so ein paar zusätzliche Sachen drin haben"}, {"id": 115, "start": 1807.34, "end": 1810.34, "text": "Genau das habe ich mir gedacht, es gab was"}, {"id": 116, "start": 1810.34, "end": 1820.34, "text": "Dann der Klassiker, das war im Juni 2017 kam das X299 VRM Desaster Video"}, {"id": 117, "start": 1820.34, "end": 1829.34, "text": "Eines meiner kritischsten Videos, das ich je gemacht habe, kritisch auch in der Hinsicht, weil ich dadurch sehr viele Kontakte zerstört habe"}, {"id": 118, "start": 1829.34, "end": 1838.34, "text": "Ihr müsst bedenken, ich habe in dem Video gesagt, dass bei der X299 Plattform die Spannungswandler bzw. die Spannungswandler Kühler so extrem unterdimensioniert sind"}, {"id": 119, "start": 1838.34, "end": 1844.34, "text": "Das Overclocking, so wie das vorgesehen ist, wie es beworben an Mainboard Herstellern nicht möglich ist"}, {"id": 120, "start": 1844.34, "end": 1850.34, "text": "Und das ganze war ein Resultat aus mehreren Jahren, die sich zusammengetragen haben"}, {"id": 121, "start": 1850.34, "end": 1858.34, "text": "Denn es war schon so bei Z170, bei Z97 und sogar bei X299, habe ich diese Probleme schon festgestellt"}, {"id": 122, "start": 1858.34, "end": 1865.34, "text": "Habe das an die Hersteller übermittelt, hauptsächlich an ASUS und an Gigabyte und das hat sich damals nichts getan"}, {"id": 123, "start": 1865.34, "end": 1871.34, "text": "Es wurde von den Herstellern, es kamen so Aussagen wie, ja okay wir wissen, dass die Probleme existieren, die Spannungswandler werden warm"}, {"id": 124, "start": 1871.34, "end": 1872.34, "text": "Aber juckt uns nicht"}, {"id": 125, "start": 1872.34, "end": 1876.34, "text": "Aber die Designs sehen halt so besser aus, als wenn wir da so finden drauf machen"}, {"id": 126, "start": 1876.34, "end": 1880.34, "text": "Ich habe zwei Jahre lang da quasi gegen Wände geredet und bei X299 war das Problem für mich"}, {"id": 127, "start": 1880.34, "end": 1889.34, "text": "Ich mein, wenn ein Mainboard 360 Quickscope Killer HD Pro Gamer Edition heißt"}, {"id": 128, "start": 1889.34, "end": 1897.34, "text": "Brainbooster Pro Gamer Edition, da musste es natürlich auch erstmal gut aussehen und erst im zweiten Schritt funktionieren"}, {"id": 129, "start": 1897.34, "end": 1905.34, "text": "So kritisch, oder was ich gesehen habe, dass ich dann da quasi ein öffentliches Statement Video zu gemacht habe, damit sich was ändert"}, {"id": 130, "start": 1905.34, "end": 1913.34, "text": "Und ihr könnt euch vorstellen, ich war sehr lange oder ich bin schon sehr lange in dieser Branche aktiv, schon 15 Jahre circa"}, {"id": 131, "start": 1913.34, "end": 1918.34, "text": "Ich habe sehr viele Freunde in der Industrie und sehr viele haben sich da auch auf die Füße getreten gefühlt"}, {"id": 132, "start": 1918.34, "end": 1920.34, "text": "Als ich dieses Video veröffentlicht habe"}, {"id": 133, "start": 1920.34, "end": 1924.34, "text": "Ich war zum Beispiel ein halbes Jahr vorher bei Intel im Headquarter in den USA"}, {"id": 134, "start": 1924.34, "end": 1931.34, "text": "Und Intel hat mir danach zum Beispiel gesagt, dass nach diesem X299 Video werde ich nie wieder irgendwo von Intel eingeladen"}, {"id": 135, "start": 1931.34, "end": 1934.34, "text": "Ich darf nie wieder zu Intel in das Headquarter rein und so weiter"}, {"id": 136, "start": 1934.34, "end": 1941.34, "text": "Also ich habe meinen kompletten Intel Kontakt quasi abgebrannt dafür, um dieses Video zu machen"}, {"id": 137, "start": 1941.34, "end": 1945.34, "text": "Und auch die Mainboard Hersteller waren danach sehr reserviert mir gegenüber"}, {"id": 138, "start": 1945.34, "end": 1949.34, "text": "Ich habe am nächsten Tag sehr viele Anrufe bekommen von den Herstellern und haben gesagt"}, {"id": 139, "start": 1949.34, "end": 1952.34, "text": "Wir wissen nicht, ob wir mit dir in der Zukunft nochmal irgendwas machen können"}, {"id": 140, "start": 1952.34, "end": 1957.34, "text": "Und das war für mich, das war mir klar, als ich dieses Video gemacht habe"}, {"id": 141, "start": 1957.34, "end": 1960.34, "text": "Mir war komplett bewusst, wie die Resonanz von so einem Video..."}, {"id": 142, "start": 1960.34, "end": 1962.34, "text": "Ich zeige euch mal was"}, {"id": 143, "start": 1962.34, "end": 1968.34, "text": "Genau die gleiche Erfahrung habe ich auch gemacht, wobei es bei mir nicht drauf rausgelaufen ist, dass..."}, {"id": 144, "start": 1968.34, "end": 1970.34, "text": "Egal"}, {"id": 145, "start": 1972.34, "end": 1974.34, "text": "Vielleicht kennt noch einer dieses Video hier"}, {"id": 146, "start": 1974.34, "end": 1976.34, "text": "Von 2013"}, {"id": 147, "start": 1976.34, "end": 1978.34, "text": "Da habe ich Activision übelst geflamed"}, {"id": 148, "start": 1978.34, "end": 1980.34, "text": "Ich weiß gar nicht mehr genau wegen was"}, {"id": 149, "start": 1980.34, "end": 1984.34, "text": "Aus irgendwelchen Gründen habe ich Activision geflamed"}, {"id": 150, "start": 1984.34, "end": 1987.34, "text": "Wenn ihr wollt, können wir uns das dann nochmal anhören"}, {"id": 151, "start": 1987.34, "end": 1989.34, "text": "Ich habe keine Ahnung, ich habe 5 Minuten Activision geflamed"}, {"id": 152, "start": 1989.34, "end": 1998.34, "text": "Und danach hat auch der damalige Community Manager von Activision in Deutschland"}, {"id": 153, "start": 1998.34, "end": 2000.34, "text": "Der war neu, der hat gesagt"}, {"id": 154, "start": 2000.34, "end": 2005.34, "text": "Also wenn ich will, dass ich nochmal irgendwohin eingeladen werde"}, {"id": 155, "start": 2005.34, "end": 2008.34, "text": "Oder dass ich in Zukunft eingeladen werde, oder dass er mich jetzt auch einladen kann"}, {"id": 156, "start": 2008.34, "end": 2010.34, "text": "Muss ich das Video löschen"}, {"id": 157, "start": 2010.34, "end": 2014.34, "text": "Also die sind da schon hinterher"}, {"id": 158, "start": 2014.34, "end": 2017.34, "text": "Ich habe das Video natürlich nicht gelöscht"}, {"id": 159, "start": 2017.34, "end": 2020.34, "text": "Und das hat danach trotzdem funktioniert"}, {"id": 160, "start": 2020.34, "end": 2024.34, "text": "Aber das ist nicht ohne"}, {"id": 161, "start": 2024.34, "end": 2028.34, "text": "Und man muss sich auch mal überlegen, das ist schon ein gewisses Risiko"}, {"id": 162, "start": 2028.34, "end": 2031.34, "text": "Ich meine, wenn du ein Kanal bist"}, {"id": 163, "start": 2031.34, "end": 2037.34, "text": "Der sagen wir jetzt mal auf spezielle Games spezialisiert hat"}, {"id": 164, "start": 2037.34, "end": 2041.34, "text": "Oder auf Hardware-Geschichten spezialisiert hat"}, {"id": 165, "start": 2041.34, "end": 2045.34, "text": "Dann profitierst du natürlich auch extrem davon"}, {"id": 166, "start": 2045.34, "end": 2048.34, "text": "Wenn du einen guten Kontakt zum Hersteller hast"}, {"id": 167, "start": 2048.34, "end": 2053.34, "text": "Und wenn du vielleicht auch die ein oder andere Sachen eben schon dann sehr zeitig hast"}, {"id": 168, "start": 2053.34, "end": 2056.34, "text": "Weil umso früher du bist, umso mehr Leute gucken das Ganze"}, {"id": 169, "start": 2056.34, "end": 2058.34, "text": "Ist ja logisch irgendwo"}, {"id": 170, "start": 2058.34, "end": 2061.34, "text": "Auf der anderen Seite ist es für dich auch wieder blöd"}, {"id": 171, "start": 2061.34, "end": 2066.34, "text": "Weil du hast immer das Gefühl, du kannst nicht komplett sagen, was du willst"}, {"id": 172, "start": 2066.34, "end": 2070.34, "text": "Und es gibt Channels, nehmen wir mal jetzt irgendwie"}, {"id": 173, "start": 2070.34, "end": 2072.34, "text": "Nehmen wir mal irgendwie einen Overwatch-Channel"}, {"id": 174, "start": 2072.34, "end": 2075.34, "text": "Nehmen wir mal zum Beispiel, weil ich immer auf Twitter folge, Highscore Heroes zu machen"}, {"id": 175, "start": 2075.34, "end": 2078.34, "text": "Der hat mit Sicherheit einen ziemlich guten Grad zu Blizzard"}, {"id": 176, "start": 2078.34, "end": 2081.34, "text": "Und macht hauptsächlich Overwatch-Content oder anderen Blizzard-Content"}, {"id": 177, "start": 2081.34, "end": 2084.34, "text": "Wenn der jetzt ein Video machen würde"}, {"id": 178, "start": 2084.34, "end": 2087.34, "text": "Das merkt man auch in den Videos, dass gerade auch berechtigte Weise"}, {"id": 179, "start": 2087.34, "end": 2092.34, "text": "Leute halt recht reserviert sind, was sich ins Rückhalten, was Kritik anbelangt"}, {"id": 180, "start": 2092.34, "end": 2095.34, "text": "Da muss man sich mal überlegen, was da los wäre"}, {"id": 181, "start": 2095.34, "end": 2099.34, "text": "Wenn du auf einmal keinerlei Support mehr von dem Hersteller hast"}, {"id": 182, "start": 2099.34, "end": 2104.34, "text": "Dessen einziger Content auf deinem Channel quasi gebracht wird"}, {"id": 183, "start": 2104.34, "end": 2107.34, "text": "Das ist echt nicht zu unterschätzen"}, {"id": 184, "start": 2107.34, "end": 2110.34, "text": "Ob wir das Video danach dann noch mal gucken, was ich damals geflamet habe"}, {"id": 185, "start": 2110.34, "end": 2112.34, "text": "Ich weiß es schon gar nicht mehr"}, {"id": 186, "start": 2113.34, "end": 2116.34, "text": "So sein kann, wenn man so kritisch sich im Internet äußert"}, {"id": 187, "start": 2116.34, "end": 2118.34, "text": "Wenn man eine gewisse Reichweite hat"}, {"id": 188, "start": 2118.34, "end": 2122.34, "text": "Aber aus meiner Sicht ist das manchmal eben einfach auch notwendig"}, {"id": 189, "start": 2122.34, "end": 2125.34, "text": "Also gerade wenn man YouTuber ist, der jetzt"}, {"id": 190, "start": 2125.34, "end": 2128.34, "text": "Ich sehe mich eher nicht so als Werbemarionette"}, {"id": 191, "start": 2128.34, "end": 2131.34, "text": "Sondern ich berichte über Dinge, die mir gefallen, die mir nicht gefallen"}, {"id": 192, "start": 2131.34, "end": 2134.34, "text": "Und dann muss man eben auch ein Video machen"}, {"id": 193, "start": 2134.34, "end": 2138.34, "text": "Und wenn mir Dinge nicht gefallen, dann muss es eben auch gesagt werden"}, {"id": 194, "start": 2138.34, "end": 2142.34, "text": "Weil es bringt uns allen am Ende nichts, wenn wir das verschweigen"}, {"id": 195, "start": 2142.34, "end": 2144.34, "text": "Wenn alle Reviewer nur Produkte reviewen und sagen"}, {"id": 196, "start": 2144.34, "end": 2146.34, "text": "Das ist toll, kauft das"}, {"id": 197, "start": 2146.34, "end": 2147.34, "text": "Das ist toll, kauft das"}, {"id": 198, "start": 2147.34, "end": 2147.34, "text": "Das stimmt"}, {"id": 199, "start": 2147.34, "end": 2148.34, "text": "Dann verbessert..."}, {"id": 200, "start": 2148.34, "end": 2149.34, "text": "Aaron Jesus"}, {"id": 201, "start": 2149.34, "end": 2150.34, "text": "Eingefür Twitch Prime Sub"}, {"id": 202, "start": 2150.34, "end": 2152.34, "text": "Twitch Prime Sub"}, {"id": 203, "start": 2156.34, "end": 2158.34, "text": "Weil ihr müsst jetzt mal zurück überlegen"}, {"id": 204, "start": 2158.34, "end": 2161.34, "text": "2017 habe ich diese ganzen Filme nicht verpasst"}, {"id": 205, "start": 2161.34, "end": 2164.34, "text": "Ich muss jetzt mal zurück überlegen"}, {"id": 206, "start": 2164.34, "end": 2166.34, "text": "2017 habe ich diese ganze VRM-Thematik angesprochen"}, {"id": 207, "start": 2166.34, "end": 2168.34, "text": "Oh die FPS, dankeschön"}, {"id": 208, "start": 2168.34, "end": 2171.34, "text": "Danach kam das auf, dass dann alle Reviewer plötzlich gesagt haben"}, {"id": 209, "start": 2171.34, "end": 2174.34, "text": "Oh, da gibt es ja was Interessantes, das können wir testen"}, {"id": 210, "start": 2174.34, "end": 2177.34, "text": "Ich habe mit allen großen Reviewern gesprochen, wie man sowas testet"}, {"id": 211, "start": 2177.34, "end": 2180.34, "text": "Wie man die Spannungswandel analysiert und so weiter"}, {"id": 212, "start": 2180.34, "end": 2182.34, "text": "Jetzt geht es aber hier ab"}, {"id": 213, "start": 2182.34, "end": 2185.34, "text": "Quantal Quetzal, Dankeschön Twitch Prime"}, {"id": 214, "start": 2185.34, "end": 2188.34, "text": "Nice, nice, nice"}, {"id": 215, "start": 2192.34, "end": 2194.34, "text": "Und schaut euch an, was ich getan habe"}, {"id": 216, "start": 2194.34, "end": 2195.34, "text": "Was ist denn jetzt los hier?"}, {"id": 217, "start": 2195.34, "end": 2198.34, "text": "Thais123, Twitch Prime, Dankeschön"}, {"id": 218, "start": 2199.34, "end": 2201.34, "text": "Übrigens, falls es noch Leute gibt"}, {"id": 219, "start": 2201.34, "end": 2202.34, "text": "Jetzt muss ich mal sehr laut starten"}, {"id": 220, "start": 2202.34, "end": 2203.34, "text": "Falls es noch Leute gibt"}, {"id": 221, "start": 2203.34, "end": 2206.34, "text": "Nein, ich mache nicht ihn als Hintergrund, weil das hat damit überhaupt nichts zu tun"}, {"id": 222, "start": 2208.34, "end": 2211.34, "text": "Falls es noch Leute gibt, die keine Ahnung haben, was diese ganze Twitch Prime-Geschichte ist"}, {"id": 223, "start": 2211.34, "end": 2214.34, "text": "Denen kann ich das natürlich mal kurz erklären"}, {"id": 224, "start": 2214.34, "end": 2219.34, "text": "Wenn man einen Amazon Prime-Account hat, kann man diesen Amazon Prime-Account kostenlos mit Twitch verknüpfen"}, {"id": 225, "start": 2219.34, "end": 2224.34, "text": "Und kann dann, man kriegt dann auch komisches Prime-Loot, habe ich noch nie eingelöst"}, {"id": 226, "start": 2224.34, "end": 2230.34, "text": "Aber das Beste daran ist, man kann kostenlos einen Streamer seiner Wahl unterstützen mit einem Sub"}, {"id": 227, "start": 2230.34, "end": 2232.34, "text": "Ohne, dass es einen selbst was kostet"}, {"id": 228, "start": 2232.34, "end": 2235.34, "text": "Allerdings, der Streamer kriegt trotzdem seinen Anteil von Twitch"}, {"id": 229, "start": 2236.34, "end": 2237.34, "text": "Sellout-Modus beendet"}, {"id": 230, "start": 2237.34, "end": 2244.34, "text": "Wir haben hier noch Ript12 und Sobati, Twitch Prime, Dankeschön"}, {"id": 231, "start": 2244.34, "end": 2247.34, "text": "Pog, huge Pog"}, {"id": 232, "start": 2252.34, "end": 2253.34, "text": "Easy"}, {"id": 233, "start": 2255.34, "end": 2256.34, "text": "Richtig Pog"}, {"id": 234, "start": 2259.34, "end": 2265.34, "text": "In den letzten zwei Jahren hat sich diese ganze Thematik um die Kühllösungen extrem krass verbessert"}, {"id": 235, "start": 2265.34, "end": 2269.34, "text": "Heutzutage werben sogar die ganzen Mainboard-Hersteller damit und sagen"}, {"id": 236, "start": 2269.34, "end": 2273.34, "text": "Schaut euch unsere Kühllösung an, die ist so und so viel kühler als die von der Konkurrenz"}, {"id": 237, "start": 2273.34, "end": 2276.34, "text": "Also wir haben jetzt genau das krasse Gegenteil von dem, was wir 2017 haben"}, {"id": 238, "start": 2276.34, "end": 2282.34, "text": "Und ich will mich da jetzt nicht selber loben oder sowas, aber das ist halt auch das Resultat von diesem Video"}, {"id": 239, "start": 2282.34, "end": 2283.34, "text": "Das muss man ganz klar sagen"}, {"id": 240, "start": 2283.34, "end": 2288.34, "text": "Und wenn wir Dinge verschweigen, die nicht funktionieren, dann wird sich nichts verbessern"}, {"id": 241, "start": 2288.34, "end": 2289.34, "text": "Das stimmt"}, {"id": 242, "start": 2289.34, "end": 2293.34, "text": "Wenn ich zum Beispiel sage, wir haben hier neue AMD-CPUs und die erreichen den Takt nicht"}, {"id": 243, "start": 2293.34, "end": 2299.34, "text": "Dann ist das nicht, weil ich irgendwie AMD bashen will, sondern weil ich erreichen möchte, dass es am Ende funktioniert"}, {"id": 244, "start": 2299.34, "end": 2304.34, "text": "Ja, da hat man ganz recht, es hat überhaupt keinen Sinn, neues Zeug zu zeigen"}, {"id": 245, "start": 2304.34, "end": 2308.34, "text": "Also wie gesagt, es sei dann, es ist jetzt halt was eingekauftes vom Hersteller letztendlich"}, {"id": 246, "start": 2308.34, "end": 2314.34, "text": "Aber wenn es nicht nur den Anschein haben soll von was Objektiven, sondern es ist wirklich Objektiv"}, {"id": 247, "start": 2314.34, "end": 2321.34, "text": "Dann hat wirklich außer eventuell jetzt unmittelbar der Hersteller keiner was von, wenn man da irgendwie alles schön redet"}, {"id": 248, "start": 2321.34, "end": 2325.34, "text": "Weil letztendlich, was ist das Resultat? Die Leute kaufen sich..."}, {"id": 249, "start": 2325.34, "end": 2328.34, "text": "Stellt euch mal vor, Xbox One zu Release"}, {"id": 250, "start": 2328.34, "end": 2333.34, "text": "Alle hätten gesagt, beste, ihr erinnert euch vielleicht noch an diese MLG-Geschichte mit Xbox damals"}, {"id": 251, "start": 2333.34, "end": 2335.34, "text": "Beste Konsole aller Zeiten"}, {"id": 252, "start": 2335.34, "end": 2339.34, "text": "Stellt euch vor, alle Influencer, was ja auch jetzt, das Wort gibt es ja auch erst seit 3, 4 Jahren"}, {"id": 253, "start": 2339.34, "end": 2345.34, "text": "Alle auf YouTube und alle, alle, alle, egal wo, hätten alle gesagt, Xbox One beste"}, {"id": 254, "start": 2345.34, "end": 2348.34, "text": "Und die Leute hätten sich die Xbox One gekauft und haben festgestellt, sie ist kacke"}, {"id": 255, "start": 2348.34, "end": 2351.34, "text": "Zu Release zumindest"}, {"id": 256, "start": 2351.34, "end": 2354.34, "text": "Das wäre scheiße gewesen für die Leute, die massig Kohle ausgegeben haben"}, {"id": 257, "start": 2354.34, "end": 2364.34, "text": "Und es wäre für denjenigen, der das zu sehr übertrieben hat, auch nicht gut"}, {"id": 258, "start": 2364.34, "end": 2371.34, "text": "Außer halt vielleicht, dass Microsoft ordentlich Kohle geblecht hat dafür"}, {"id": 259, "start": 2371.34, "end": 2378.34, "text": "Aber ansonsten, langfristig ist das, wenn man das zu oft macht oder zu offensichtlich, ist das auch für einen Channelbetreiber nicht gut"}, {"id": 260, "start": 2378.34, "end": 2382.34, "text": "Weil ich arbeite ja auch für Caseking, das wisst ihr alle"}, {"id": 261, "start": 2382.34, "end": 2386.34, "text": "Und ihr könnt euch vorstellen, wir verkaufen da das ein oder andere PC-System"}, {"id": 262, "start": 2386.34, "end": 2391.34, "text": "Wenn wir einen Ryzen da verkaufen und der wird angegeben mit zum Beispiel 4,6 GHz"}, {"id": 263, "start": 2391.34, "end": 2394.34, "text": "Der kommt beim Kunden an und der macht den Takt nicht"}, {"id": 264, "start": 2394.34, "end": 2397.34, "text": "Dann ist das rein theoretisch für uns sogar ein Garantiefall"}, {"id": 265, "start": 2397.34, "end": 2403.34, "text": "Dann kann der sagen, ich gebe den PC zurück, der erreicht nicht das, was die Spezifikationen versprechen"}, {"id": 266, "start": 2403.34, "end": 2406.34, "text": "Und ihr könnt euch vorstellen, wie viele Leute bei uns im Kundencenter anrufen"}, {"id": 267, "start": 2406.34, "end": 2411.34, "text": "Und einfach nur technische Fragen haben, ey, warum boostet CPU-X nicht so hoch"}, {"id": 268, "start": 2411.34, "end": 2413.34, "text": "Das haben wir bei Intel genauso wie bei AMD"}, {"id": 269, "start": 2413.34, "end": 2418.34, "text": "Gerade weil diese ganzen Boost-Thematiken eben auch sehr undurchsichtig sind"}, {"id": 270, "start": 2418.34, "end": 2424.34, "text": "Und oft auch nicht genau erklärt wird, welche CPU in welchem Zustand, in welcher Situation genau wie boostet"}, {"id": 271, "start": 2424.34, "end": 2427.34, "text": "Selbst für mich ist das oft gar nicht klar"}, {"id": 272, "start": 2427.34, "end": 2430.34, "text": "Gerade auch bei Intel zum Beispiel diese AVX-Offset-Thematik"}, {"id": 273, "start": 2430.34, "end": 2436.34, "text": "Dass nicht genau klar ist, bei welcher CPU, in welchem Zustand, was für ein Offset zum Beispiel verwendet wird automatisch"}, {"id": 274, "start": 2436.34, "end": 2439.34, "text": "Das sind solche Themen, da bin ich einfach kein Freund von"}, {"id": 275, "start": 2439.34, "end": 2444.34, "text": "Weil das am Ende einfach Unklarheiten für uns Endkunden bewirkt"}, {"id": 276, "start": 2444.34, "end": 2447.34, "text": "Und ja, da haben wir nichts davon"}, {"id": 277, "start": 2447.34, "end": 2452.34, "text": "Deswegen müssen Dinge, die nicht passen, die aktuell nicht funktionieren, einfach ausgesprochen werden"}, {"id": 278, "start": 2452.34, "end": 2455.34, "text": "Das hat nichts mit persönlicher Vorliebe zu tun"}, {"id": 279, "start": 2455.34, "end": 2457.34, "text": "Mir ist es egal"}, {"id": 280, "start": 2457.34, "end": 2463.34, "text": "Und selbst wenn, wenn in dem Fall was dran ist, wo ist das Problem?"}, {"id": 281, "start": 2463.34, "end": 2466.34, "text": "Ich hate quasi gegen jede Firma, das interessiert mich nicht"}, {"id": 282, "start": 2466.34, "end": 2469.34, "text": "Es ist mir egal, ob da Intel, Nvidia, AMD drauf steht"}, {"id": 283, "start": 2469.34, "end": 2471.34, "text": "Das spielt für mich keine Rolle"}, {"id": 284, "start": 2471.34, "end": 2475.34, "text": "Weil, warum? Ich bin mit keiner von den Firmen irgendwie persönlich verbunden"}, {"id": 285, "start": 2475.34, "end": 2478.34, "text": "Ich habe keinen Vorteil davon, wenn die eine Firma mehr verkauft als die andere"}, {"id": 286, "start": 2478.34, "end": 2480.34, "text": "Das ist mir persönlich komplett egal"}, {"id": 287, "start": 2480.34, "end": 2485.34, "text": "Mir geht es einfach nur darum, dass das, was wir kaufen, so gut wie möglich funktioniert"}, {"id": 288, "start": 2485.34, "end": 2490.34, "text": "Wenn wir Verbesserungspotenzial sehen, dann sollten wir das auch immer sagen"}, {"id": 289, "start": 2490.34, "end": 2495.34, "text": "Und dafür sorgen, dass sich auch Dinge ändern, wenn sie nicht funktionieren"}, {"id": 290, "start": 2495.34, "end": 2499.34, "text": "Interessanterweise bekomme ich zum Beispiel auch von den meisten Herstellern gar keine Samples zur Produktlaunches"}, {"id": 291, "start": 2499.34, "end": 2502.34, "text": "Also AMD und Intel, die schicken mir nie irgendwas"}, {"id": 292, "start": 2502.34, "end": 2504.34, "text": "Bei denen bin ich quasi gefühlt auf so einer Blacklist"}, {"id": 293, "start": 2504.34, "end": 2513.34, "text": "Und ich mache dieses Video auch, weil, als ich mit AMD gesprochen habe letzte Woche, da hat auch AMD gemeint, dass ich so richtig gegen AMD eingestellt wäre"}, {"id": 294, "start": 2513.34, "end": 2517.34, "text": "Und dann habe ich denen auch gesagt, für mich ist das ein rein wissenschaftliches Thema"}, {"id": 295, "start": 2517.34, "end": 2520.34, "text": "Genau, macht es gescheit, dann muss ich euch nicht flamen, ist doch ganz einfach"}, {"id": 296, "start": 2520.34, "end": 2522.34, "text": "Wenn die CPU boostet, dann ist es für mich gut"}, {"id": 297, "start": 2522.34, "end": 2524.34, "text": "Wenn die irgendeine Lösung haben, dann zeige ich die gerne"}, {"id": 298, "start": 2524.34, "end": 2529.34, "text": "Dann möchte ich das euch allen zeigen, wie das Ganze hinzubiegen ist"}, {"id": 299, "start": 2529.34, "end": 2534.34, "text": "Was? MW Fanboy, was zum Teufel hat denn Bill Gates heute noch mit Windows zu tun?"}, {"id": 300, "start": 2534.34, "end": 2535.34, "text": "Wie wir das Ganze gefixt bekommen"}, {"id": 301, "start": 2535.34, "end": 2538.34, "text": "Und nicht mal Ball, man hat mehr was mit Windows zu tun"}, {"id": 302, "start": 2538.34, "end": 2542.34, "text": "Und nicht mal der Windows Dude von früher, ich weiß nicht wie er hieß, hat man was mit Windows zu tun"}, {"id": 303, "start": 2542.34, "end": 2546.34, "text": "Also, das hat für mich keinerlei persönliche Hintergründe oder sowas"}, {"id": 304, "start": 2546.34, "end": 2549.34, "text": "Eigentlich ist es immer schade, dass man so ein Video überhaupt machen muss"}, {"id": 305, "start": 2549.34, "end": 2550.34, "text": "Ja Cooper, ich bin auch MSI gebannt"}, {"id": 306, "start": 2550.34, "end": 2554.34, "text": "Und sich da quasi so rechtfertigen muss, aber ja, ich wollte das Ganze mal so ein bisschen loswerden"}, {"id": 307, "start": 2554.34, "end": 2558.34, "text": "Hoffe, ich habe euch mit dem Video nicht zu sehr gelangweilt"}, {"id": 308, "start": 2558.34, "end": 2563.34, "text": "Und übrigens, was dieses Ganze, was meine Getränkesituation immer betrifft"}, {"id": 309, "start": 2563.34, "end": 2566.34, "text": "Ja, aber er hat recht, jetzt ist es vollkommen richtig"}, {"id": 310, "start": 2570.34, "end": 2571.34, "text": "Vollkommen richtig"}, {"id": 311, "start": 2571.34, "end": 2578.34, "text": "Und weil irgendjemand gesagt hat, EA, EA müsste ja schon längs pleite sein, wenn die das schon eine Weile praktiziert haben"}, {"id": 312, "start": 2578.34, "end": 2581.34, "text": "Ich weiß nicht, ob ihr euch mal den EA Aktienkurs so angeguckt habt"}, {"id": 313, "start": 2582.34, "end": 2585.34, "text": "Also, EA wird nicht demnächst pleite gehen"}, {"id": 314, "start": 2585.34, "end": 2590.34, "text": "Weil der Aktienkurs ja auch direkt damit, ob wir jetzt in der Firma pleite gehen oder nicht"}, {"id": 315, "start": 2590.34, "end": 2592.34, "text": "Erstmal nicht direkt was zu tun hat"}, {"id": 316, "start": 2592.34, "end": 2595.34, "text": "Aber auch so wird EA nicht in nächster Zeit pleite gehen"}, {"id": 317, "start": 2595.34, "end": 2599.34, "text": "Aber guckt euch mal das an, guckt euch mal die EA Aktie an"}, {"id": 318, "start": 2599.34, "end": 2607.34, "text": "Also, die ist jetzt nicht gerade, die ist jetzt nicht gerade so tolle mehr seit ein paar Jahren"}, {"id": 319, "start": 2607.34, "end": 2609.34, "text": "Die ist ordentlich runtergegangen"}, {"id": 320, "start": 2609.34, "end": 2612.34, "text": "Die ist ordentlich runtergegangen"}, {"id": 321, "start": 2613.34, "end": 2620.34, "text": "Erstmal hier, und dann zu dieser, ich würde mal sagen, das war so ein bisschen auch, wann waren das hier?"}, {"id": 322, "start": 2620.34, "end": 2622.34, "text": "18, das war Battlefront"}, {"id": 323, "start": 2622.34, "end": 2625.34, "text": "Battlefront, wo am Battlefront ging es dann"}, {"id": 324, "start": 2629.34, "end": 2630.34, "text": "Weg"}, {"id": 325, "start": 2631.34, "end": 2632.34, "text": "Spielen"}, {"id": 326, "start": 2633.34, "end": 2634.34, "text": "Nein"}, {"id": 327, "start": 2634.34, "end": 2637.34, "text": "Warum erkennt das mein Netzblocker nicht?"}, {"id": 328, "start": 2643.34, "end": 2647.34, "text": "Okay, wir gucken uns jetzt nochmal mal ein Activision Flame Video an von 2013"}, {"id": 329, "start": 2647.34, "end": 2652.34, "text": "100.000 Aufrufe, 8500 Likes und 156 Dislikes"}, {"id": 330, "start": 2652.34, "end": 2657.34, "text": "Okay, da muss was dran, da muss was dran gewesen sein, was ich damals erzählt hab"}, {"id": 331, "start": 2658.34, "end": 2661.34, "text": "Okay, hören wir uns das mal an, ich hab keine Ahnung, was das ist"}, {"id": 332, "start": 2661.34, "end": 2664.34, "text": "Okay, hören wir uns das mal an, ich hab keine Ahnung mehr, um was es ging"}, {"id": 333, "start": 2664.34, "end": 2671.34, "text": "Aber wie gesagt, das ist das Video, wo ich gefragt wurde, beziehungsweise quasi, dass ich es leuchten soll"}, {"id": 334, "start": 2680.34, "end": 2682.34, "text": "Hallo Jungs und Mädels, hier ist der Max und Activision"}, {"id": 335, "start": 2682.34, "end": 2683.34, "text": "Versteht man alles?"}, {"id": 336, "start": 2683.34, "end": 2685.34, "text": "Bisschen leise, gell?"}, {"id": 337, "start": 2685.34, "end": 2689.34, "text": "... und schafft es ja immer wieder nicht nur auf ihre Spieler zu..."}, {"id": 338, "start": 2690.34, "end": 2694.34, "text": "Oh, es geht schon gleich los, der Flame geht gleich los, ich mach mal ein Stückchen lauter"}, {"id": 339, "start": 2694.34, "end": 2702.34, "text": "... und schafft es ja immer wieder nicht nur auf ihre Spieler zu scheißen, sondern auf ihre Spieler zu scheißen und danach noch drauf zu pissen"}, {"id": 340, "start": 2702.34, "end": 2705.34, "text": "Also diese Kombination, das haben die ja richtig gut drauf"}, {"id": 341, "start": 2705.34, "end": 2708.34, "text": "Also wer es nicht ertragen kann, dass ich jetzt ein bisschen hier..."}, {"id": 342, "start": 2708.34, "end": 2714.34, "text": "Es gibt ja manche Leute, die flippen dann aus und meinen, sie müssen an den Fenster springen, wenn ich hier ein bisschen rumflame, zumindest kommt mir das manchmal so vor"}, {"id": 343, "start": 2714.34, "end": 2718.34, "text": "Die soll am besten gleich ausmachen, denn ich werde mich in diesem Video ein bisschen über Activision auslassen"}, {"id": 344, "start": 2718.34, "end": 2726.34, "text": "Ich habe einen News-Beitrag gelesen, bei callofdutyseries.de, übrigens ganz coole Seite, guckt es euch mal unten an, ist die News verlinkt und zwar geht es um Booster"}, {"id": 345, "start": 2726.34, "end": 2729.34, "text": "Ich habe mir gedacht, Booster ist ja nichts wildes, Booster, scheiß Booster, Booster sind kacke"}, {"id": 346, "start": 2729.34, "end": 2731.34, "text": "Ich glaube, da sind wir uns alle einig, dass Booster kacke sind"}, {"id": 347, "start": 2731.34, "end": 2734.34, "text": "Ich war auch voll aufgeregt in dem Video, ey"}, {"id": 348, "start": 2734.34, "end": 2736.34, "text": "Was ist da los?"}, {"id": 349, "start": 2736.34, "end": 2743.34, "text": "Nachdem jetzt natürlich Call of Duty Ghosts noch nicht so wirklich lange auf dem Markt ist, ist ja zumindest die PC-Version und auch die Konsolen-Version teilt"}, {"id": 350, "start": 2743.34, "end": 2751.34, "text": "teilweise offen, wie ein Joint und da wird gehackt, geboostet, gesonst was, ohne irgendwie, dass irgendjemand dem ganzen Einhalt gebietet"}, {"id": 351, "start": 2751.34, "end": 2752.34, "text": "Ja, das war doch so"}, {"id": 352, "start": 2752.34, "end": 2757.34, "text": "Wir haben ja natürlich das schöne Pair-to-Pair-Hosting-System, ich meine Dedicated Server for All Platforms, wir wissen es ja"}, {"id": 353, "start": 2757.34, "end": 2765.34, "text": "Was macht ihr denn, wenn ihr zufällig in eine Booster-Lobby kommt, wo man für jeden Kill 3 Milliarden Punkte kriegt und auf einmal seid der maximale Rang"}, {"id": 354, "start": 2765.34, "end": 2770.34, "text": "So, dann verlasst ihr das Spiel natürlich, weil ihr euch denkt, Scheiße, ich will das nicht, Problem ist, das Spiel speichert es"}, {"id": 355, "start": 2770.34, "end": 2778.34, "text": "Und jetzt, jetzt seid ihr auf die Gnade von Activision angewiesen, dass Activision euch nicht für das wissentliche Join in einer Booster-Lobby bant"}, {"id": 356, "start": 2778.34, "end": 2782.34, "text": "Allen Ernstes, was um alles in der Welt denken die sich?"}, {"id": 357, "start": 2782.34, "end": 2787.34, "text": "Es ging darum, irgendjemand, den genau dieser Fall betroffen hat, sprich, er ist wohl"}, {"id": 358, "start": 2787.34, "end": 2790.34, "text": "Da hat er Recht, also der Max von vor 5 Jahren"}, {"id": 359, "start": 2790.34, "end": 2797.34, "text": "Irgendwie unglücklich in eine Booster-Lobby gekommen, hat gesagt, Leute, könnt ihr nicht mal eine Stats resetten, ich will die geboosteten Stats nicht"}, {"id": 360, "start": 2797.34, "end": 2805.34, "text": "Und er sagt Activision, nein, wir können deine Stats nicht resetten, du kannst froh sein, dass wir dich nicht bannen für das wissentliche Join in einer Booster-Lobby"}, {"id": 361, "start": 2805.34, "end": 2813.34, "text": "Da hat er gesagt, the fuck, hallo, ich meine, wenn das Spiel schon so kaputt ist, dass sowas tatsächlich 2-3 Wochen nach dem Release möglich ist"}, {"id": 362, "start": 2813.34, "end": 2820.34, "text": "Das Game ist doch nicht alt, dass das wirklich jetzt schon möglich ist, da kann man sich doch mal ein bisschen kooperativer zeigen"}, {"id": 363, "start": 2820.34, "end": 2825.34, "text": "Zumal es für Call of Duty 4 auch schon ein Tool gibt, mit dem man Stats resetten kann"}, {"id": 364, "start": 2825.34, "end": 2834.34, "text": "Und das nächste ist, sie erzählen einem noch mal, sie sind nicht dafür verantwortlich, selbstverständlich sind sie nicht dafür verantwortlich, ihr Spiel sauber zu halten"}, {"id": 365, "start": 2834.34, "end": 2839.34, "text": "Nein, man soll sich im Vorfeld bitte angucken, wem man denn join, man soll nur..."}, {"id": 366, "start": 2839.34, "end": 2848.34, "text": "Das stimmt, das haben die damals wirklich erzählt, ich erinnere mich da noch dran, das haben die damals wirklich erzählt, so nach dem Motto, ja dann join halt einfach keine Booster-Lobby"}, {"id": 367, "start": 2848.34, "end": 2859.34, "text": "Leute joinen, denen man vertraut, der geile Witz an der ganzen Sache ist, ja Dedicated Servers on all Plattforms, wir wissen es ja, P2P Hosting, du hast keinen Einfluss drauf, wem du joinst"}, {"id": 368, "start": 2859.34, "end": 2865.34, "text": "Das einzige, was du machen kannst, ist dann Call of Duty abzuschießen, danach in der Hoffnung, es speichert die Stats nicht"}, {"id": 369, "start": 2865.34, "end": 2872.34, "text": "Also die schaffen es regelmäßig mit solchen Posts nicht auf die Leute zu scheißen, sondern echt nochmal so richtig drauf zu pissen"}, {"id": 370, "start": 2872.34, "end": 2887.34, "text": "Anstatt jetzt zu sagen, Leute okay, das Spiel ist halt einfach verhackt, verboostet, für sonst was, allerdings wer seine Stats resettet haben will, wer nicht wirklich wissentlich boosten wollte, der kann seine Stats resetten"}, {"id": 371, "start": 2887.34, "end": 2895.34, "text": "Nein, das machen sie nicht, das auf gar keinen Fall, also Leute ich weiß nicht, ich lese euch mal diese News vor, welche arroganten Antworten die Typen da posten"}, {"id": 372, "start": 2895.34, "end": 2904.34, "text": "Das ist echt, ich weiß manchmal echt nicht, was ich zu der ganzen Scheiße sagen soll, ich halte es manchmal einfach nicht aus, irgendwie kriege ich das nicht in meinen Kopf rein"}, {"id": 373, "start": 2904.34, "end": 2918.34, "text": "Eigentlich würde man ja erwarten, dass sie so ein bisschen auch noch, so ein bisschen, so ein ganz kleines bisschen, so ein bisschen auf Sympathie machen wollen, aber gar nicht, null, überhaupt keine Chance"}, {"id": 374, "start": 2918.34, "end": 2928.34, "text": "Vor allem, der größte Witz dabei ist ja auch noch, dass sie ja nochmal betonen, so schön, ja, so nach dem Motto, ist das schön, wir könnten dich ja auch gleich bannen"}, {"id": 375, "start": 2928.34, "end": 2933.34, "text": "Sei doch froh, dass du deinen Account jetzt nicht mehr gebrauchen kannst, du kannst das Game ja nochmal kaufen vielleicht"}, {"id": 376, "start": 2933.34, "end": 2948.34, "text": "Meine Güte, ich, ups, ich packe es nicht, na gut, es hat keinen Sinn sich da weiter drüber aufzudrängen, lest euch diese News mal durch, ihr bildet euch da selbst einen Urteil drüber"}, {"id": 377, "start": 2948.34, "end": 2956.34, "text": "Ich finde es echt, ich finde es einfach hart, ja, hätten sie es so gemacht wie in MW3, dann konnte man sich ja irgendwie mit diesen Prestige Tokens sogar noch irgendwie resetten"}, {"id": 378, "start": 2956.34, "end": 2958.34, "text": "Die News gibt es nicht mehr"}, {"id": 379, "start": 2958.34, "end": 2968.34, "text": "Ich behaupte einfach mal, die meisten Leute, die da spielen, die wollen nicht boosten, ja, wenn jemand das Game spielt, dann die meisten, die allermeisten, wollen das wirklich ordnungsgemäß durchspielen"}, {"id": 380, "start": 2968.34, "end": 2981.34, "text": "Und was kann denn bitteschön ein Neuling dafür, ja, mal irgendjemand, der das Spiel gerade gekauft hat, er joint, er macht Matchmaking, sonst was, joint irgendwo rein, ist in der Lobby und er landet zufällig als erstes in der Booster Lobby"}, {"id": 381, "start": 2981.34, "end": 2986.34, "text": "Das checkt der doch gar nicht, das weiß der doch überhaupt nicht, das kann der gar nicht wissen"}, {"id": 382, "start": 2986.34, "end": 2993.34, "text": "Und dann sagt Activision, naja, best gehabt, dumme Sau, hast du das Game gekauft, es ist so scheißegal, was du damit machst"}, {"id": 383, "start": 2993.34, "end": 2995.34, "text": "Ja, das ist schon geil, oder?"}, {"id": 384, "start": 2995.34, "end": 2997.34, "text": "Da ist was dran"}, {"id": 385, "start": 2997.34, "end": 3002.34, "text": "Also ich bin echt mal dafür, dass dieses Jahr nicht EA den Worst Company Award kriegt, sondern echt Activision"}, {"id": 386, "start": 3002.34, "end": 3011.34, "text": "Das sind solche Meldungen, ich könnte echt meinen Kopf nehmen und einfach die ganze Zeit auf die Tastatur schlagen mit meinem Kopf, wobei das eigentlich bescheuert wäre für die Idioten das zu machen, oder?"}, {"id": 387, "start": 3011.34, "end": 3020.34, "text": "Ja, wenn man mal ganz ehrlich ist, also ich pack's nicht, anstatt echt ein bisschen kooperativ zu sein, nein, gleich, das stimmt aber, das könnte ich heute immer noch so unterschreiben"}, {"id": 388, "start": 3020.34, "end": 3023.34, "text": "Und am besten noch drauf gekotzt auf die Leute, die das Game gekauft haben"}, {"id": 389, "start": 3023.34, "end": 3024.34, "text": "Jetzt geht er ab, ey"}, {"id": 390, "start": 3024.34, "end": 3027.34, "text": "Keine Fresse, macht's gut, bis zum nächsten Mal, tschüss"}, {"id": 391, "start": 3027.34, "end": 3030.34, "text": "Ja, aber das könnte ich heute immer noch so unterschreiben"}, {"id": 392, "start": 3030.34, "end": 3056.34, "text": "Da war der Max richtig am Hate Speech, ne? Macht er eigentlich noch Videos hier? Macht er noch Videos? Hey nice, immerhin, wenigstens einer von denen, die ich noch, die ich damals gekockt habe, macht mal Witz"}, {"id": 393, "start": 3060.34, "end": 3069.34, "text": "Der ist aktiver als ich, das stimmt, ich hab's grad gesehen, der hat's immerhin auf drei Videos im Jahr geschafft"}, {"id": 394, "start": 3069.34, "end": 3098.34, "text": "Ach ja, da ging er ab, hä? Da ging er ab, ich hab ja mehr so Videos damals noch über Kot gemacht, wo ich mich übrigens aufgeregt hab, das war auch, das war, wisst ihr, das war meine, das war meine Hater-Fanboy-Zeit, also die Zeit, wo ich mir eigentlich gewünscht habe, dass Kot wieder richtig gut wird"}, {"id": 395, "start": 3098.34, "end": 3102.34, "text": "Aber ich die aktuellen Kot-Ausgaben richtig kacke fand"}, {"id": 396, "start": 3102.34, "end": 3107.34, "text": "Und nach, nach zwei, drei Jahren war's bei mir dann so, dass mir egal war"}, {"id": 397, "start": 3107.34, "end": 3109.34, "text": "Hat mich nicht interessiert"}, {"id": 398, "start": 3115.34, "end": 3117.34, "text": "Ja, ähm"}, {"id": 399, "start": 3120.34, "end": 3122.34, "text": "Erstmal Regensounds wieder anmachen"}, {"id": 400, "start": 3122.34, "end": 3124.34, "text": "So, Regensounds"}, {"id": 401, "start": 3126.34, "end": 3128.34, "text": "Okay Leute"}, {"id": 402, "start": 3130.34, "end": 3134.34, "text": "Das Benachrichtigungspopup ist richtig nervig"}, {"id": 403, "start": 3139.34, "end": 3141.34, "text": "Was für ein Benachrichtigungspopup"}, {"id": 404, "start": 3141.34, "end": 3145.34, "text": "Was für ein Benachrichtigungspopup"}, {"id": 405, "start": 3151.34, "end": 3155.34, "text": "Wessen YouTube-Kanal war das gerade? Der meiner"}, {"id": 406, "start": 3160.34, "end": 3162.34, "text": "Der Sander macht auch noch Videos, ja?"}, {"id": 407, "start": 3162.34, "end": 3166.34, "text": "Ach so, das, ja, das ist, das ist, das ist ultra nervig"}, {"id": 408, "start": 3166.34, "end": 3173.34, "text": "Ich würd, ich würd auch gern einstellen, dass die Seite einfach, defaultmäßig mir Seite keine Benachrichtigung schicken darf"}, {"id": 409, "start": 3173.34, "end": 3176.34, "text": "Der Host von gestern war richtig gut, der Typ macht richtig geile Videos"}, {"id": 410, "start": 3176.34, "end": 3180.34, "text": "Ja, ich hab auch noch ein bisschen geguckt danach, das ist wirklich gut gewesen"}, {"id": 411, "start": 3184.34, "end": 3188.34, "text": "Ja, genau, ich hab auch noch ein bisschen geguckt danach, das ist wirklich gut gewesen"}, {"id": 412, "start": 3188.34, "end": 3195.34, "text": "Ja, genau, ich bin immer noch MSI Blacklist gebannt"}, {"id": 413, "start": 3196.34, "end": 3201.34, "text": "Äh, NVIDIA Partnerprogramm falls du das kennst, ich kenn das NVIDIA Partnerprogramm nicht"}, {"id": 414, "start": 3201.34, "end": 3206.34, "text": "Ähm, ich war ja vor ein paar Jahren mal bei NVIDIA in München"}, {"id": 415, "start": 3208.34, "end": 3214.34, "text": "Für die, was damals, damals wollten sie Shield, Shield und Shield Tablet promoten"}, {"id": 416, "start": 3214.34, "end": 3220.34, "text": "Aber das Nvidia Partner Programm kenne ich nicht."}, {"id": 417, "start": 3220.34, "end": 3228.34, "text": "Kennst du dich mit Jenkins Pipelines aus?"}, {"id": 418, "start": 3228.34, "end": 3231.34, "text": "Ich würde nicht sagen, dass ich mich damit auskenne."}, {"id": 419, "start": 3231.34, "end": 3238.34, "text": "Also ich habe vor vier Jahren oder so das letzte Mal großartig was mit Jenkins gemacht."}, {"id": 420, "start": 3238.34, "end": 3243.34, "text": "Da habe ich für damals habe ich noch, wie gesagt, ich habe ja schon mal erzählt, was ich auf der Arbeit mache."}, {"id": 421, "start": 3243.34, "end": 3250.34, "text": "Ich habe damals versucht für unsere Software Builds einen Jenkins aufzusetzen, der das automatisch macht,"}, {"id": 422, "start": 3250.34, "end": 3252.34, "text": "der dann auch so ein Übersichtsboard hatte."}, {"id": 423, "start": 3252.34, "end": 3259.34, "text": "So ein bisschen wie Travis von GitHub quasi, als halt auf Jenkins Basis."}, {"id": 424, "start": 3259.34, "end": 3261.34, "text": "Das hat auch ganz gut funktioniert."}, {"id": 425, "start": 3261.34, "end": 3264.34, "text": "Allerdings mittlerweile kümmert sich jemand anderes um den Jenkins."}, {"id": 426, "start": 3264.34, "end": 3269.34, "text": "Bin ich jetzt auch nicht gerade bös drum."}, {"id": 427, "start": 3269.34, "end": 3272.34, "text": "Ach, das ist gut zu wissen."}, {"id": 428, "start": 3272.34, "end": 3275.34, "text": "Das ist nicht schlecht."}, {"id": 429, "start": 3275.34, "end": 3279.34, "text": "Ist deine Klimaanlage eigentlich in deiner Heimautomatisierung drin?"}, {"id": 430, "start": 3279.34, "end": 3282.34, "text": "Also dass das Ding bei einer bestimmten Hitze angeht?"}, {"id": 431, "start": 3282.34, "end": 3287.34, "text": "Nee, das habe ich nicht eingestellt, weil dann müsste ich, also dass ich das machen könnte,"}, {"id": 432, "start": 3287.34, "end": 3291.34, "text": "müsste ich auch einstellen, dass es verbunden ist mit Presence Detection."}, {"id": 433, "start": 3291.34, "end": 3293.34, "text": "Also sprich, ist jemand daheim?"}, {"id": 434, "start": 3293.34, "end": 3301.34, "text": "Weil das wäre bescheuert, die Klimaanlage volle Pulle anzuschmeißen, wenn keiner daheim ist zum Beispiel."}, {"id": 435, "start": 3301.34, "end": 3305.34, "text": "Aber was ich zum Beispiel mache, ist, dass wenn ich auf dem Weg heim bin,"}, {"id": 436, "start": 3305.34, "end": 3307.34, "text": "dass es dann 10 Minuten vorher schon angeht."}, {"id": 437, "start": 3307.34, "end": 3318.34, "text": "Deswegen, da habe ich ja mein Location Tracking auf dem iPhone."}, {"id": 438, "start": 3318.34, "end": 3323.34, "text": "Ähm..."}, {"id": 439, "start": 3323.34, "end": 3327.34, "text": "War kontrovers, wollten nur positive Reviews, sonst fliegst du aus dem Programm raus."}, {"id": 440, "start": 3327.34, "end": 3331.34, "text": "Das heißt, dann schicken sie nicht und mir auch, okay."}, {"id": 441, "start": 3331.34, "end": 3332.34, "text": "Aber wurde gecancelt."}, {"id": 442, "start": 3332.34, "end": 3340.34, "text": "Ja, wenn sowas rauskommt, dann ist es natürlich, sieht es auch nicht gut aus für den Hersteller, ne?"}, {"id": 443, "start": 3340.34, "end": 3345.34, "text": "Ja, guck ich mir nachher mal an, Arthur."}, {"id": 444, "start": 3345.34, "end": 3347.34, "text": "Fandest du das Design besser?"}, {"id": 445, "start": 3347.34, "end": 3351.34, "text": "Gucken wir mal."}, {"id": 446, "start": 3351.34, "end": 3355.34, "text": "Ja, viel besser."}, {"id": 447, "start": 3355.34, "end": 3358.34, "text": "Ja, huge. Fast 100 Subs hatte ich damals."}, {"id": 448, "start": 3358.34, "end": 3362.34, "text": "Das fand ich viel schöner damals."}, {"id": 449, "start": 3362.34, "end": 3366.34, "text": "Man müsste es ein bisschen anpassen, dass es aktueller ist, ja?"}, {"id": 450, "start": 3366.34, "end": 3369.34, "text": "Es ist nicht mehr so ganz zeitgemäß im Endeffekt."}, {"id": 451, "start": 3369.34, "end": 3371.34, "text": "Auch die Wahl der Schriftart und sowas, ja?"}, {"id": 452, "start": 3371.34, "end": 3373.34, "text": "Also das ist nicht mehr ganz..."}, {"id": 453, "start": 3373.34, "end": 3377.34, "text": "Das Postfach gibt es übrigens nicht mehr, nur mal so angemerkt, ne?"}, {"id": 454, "start": 3377.34, "end": 3379.34, "text": "Das war viel besser, das Design."}, {"id": 455, "start": 3379.34, "end": 3382.34, "text": "Du konntest das sogar noch ordentlich customisern."}, {"id": 456, "start": 3382.34, "end": 3392.34, "text": "Das war viel, viel schöner, viel besser."}, {"id": 457, "start": 3392.34, "end": 3399.34, "text": "Ja, Emic Summer, ich weiß."}, {"id": 458, "start": 3399.34, "end": 3404.34, "text": "Das Video kann ich mich auch nicht dran erinnern. Hab ich das gemacht?"}, {"id": 459, "start": 3404.34, "end": 3406.34, "text": "Ach ne, das war Deluxe."}, {"id": 460, "start": 3406.34, "end": 3409.34, "text": "Deluxe, den gab es ja damals auch noch, ja."}, {"id": 461, "start": 3409.34, "end": 3417.34, "text": "Sind Chips-Tüten wie DLCs."}, {"id": 462, "start": 3417.34, "end": 3424.34, "text": "Ach, das war der Feed, auch was man geliked hat und sowas."}, {"id": 463, "start": 3424.34, "end": 3429.34, "text": "Ich hatte ja mal einen Minecraft-Saber, oh man, ja, stimmt."}, {"id": 464, "start": 3429.34, "end": 3435.34, "text": "Pok."}, {"id": 465, "start": 3435.34, "end": 3438.34, "text": "Ja, das war was, ja?"}, {"id": 466, "start": 3438.34, "end": 3442.34, "text": "Nice, ja."}, {"id": 467, "start": 3442.34, "end": 3449.34, "text": "Dein favorite cut of all time?"}, {"id": 468, "start": 3449.34, "end": 3453.34, "text": "Black Ops 1."}, {"id": 469, "start": 3453.34, "end": 3455.34, "text": "Stimmt, den hatte ich in den Featured Channel drin."}, {"id": 470, "start": 3455.34, "end": 3457.34, "text": "Den Nico! Den Nico!"}, {"id": 471, "start": 3457.34, "end": 3464.34, "text": "Guck mal, damals hatte ich 100k und der Nico hatte 39k."}, {"id": 472, "start": 3464.34, "end": 3465.34, "text": "Heute hat er was?"}, {"id": 473, "start": 3465.34, "end": 3469.34, "text": "Wie viel hat der Nico heute?"}, {"id": 474, "start": 3469.34, "end": 3473.34, "text": "Was hat er heute? 2,1 Millionen?"}, {"id": 475, "start": 3473.34, "end": 3475.34, "text": "Jaja."}, {"id": 476, "start": 3475.34, "end": 3482.34, "text": "Die Rheinfelsquelle gab es damals auch noch."}, {"id": 477, "start": 3482.34, "end": 3484.34, "text": "Ja, ich müsste echt mal wieder ernsthaft YouTube machen."}, {"id": 478, "start": 3484.34, "end": 3488.34, "text": "Ich mache ja schon gefühlt seit 3, 4 Jahren nicht mehr ernsthaft YouTube."}, {"id": 479, "start": 3488.34, "end": 3496.34, "text": "Die Facebook-Währung habe ich mir noch nicht angeguckt, großartig."}, {"id": 480, "start": 3496.34, "end": 3500.34, "text": "Mein EL-Channel, welchen EL-Channel? Ich hatte nie einen EL-Channel."}, {"id": 481, "start": 3500.34, "end": 3513.34, "text": "Ich habe einen zweiten Channel gehabt, wo ich ein bisschen Blödsinn hochgeladen habe, ja."}, {"id": 482, "start": 3513.34, "end": 3518.34, "text": "Friseur-Autogramm, ja."}, {"id": 483, "start": 3518.34, "end": 3520.34, "text": "Das glaube ich nicht."}, {"id": 484, "start": 3520.34, "end": 3532.34, "text": "Meine Videos sind nicht das, was sich der YouTube Mainstream angucken will."}, {"id": 485, "start": 3532.34, "end": 3536.34, "text": "Da müsste ich ihn da machen."}, {"id": 486, "start": 3536.34, "end": 3542.34, "text": "Da müsste ich eine Mischung aus..."}, {"id": 487, "start": 3542.34, "end": 3548.34, "text": "Mit was kannst du heute noch im Gaming-Bereich so richtig abgehen?"}, {"id": 488, "start": 3548.34, "end": 3555.34, "text": "Entweder du bist ein richtig guter Fortnite-Spieler"}, {"id": 489, "start": 3555.34, "end": 3560.34, "text": "und kannst quasi die seriöse Schiene fahren, sage ich mal mit."}, {"id": 490, "start": 3560.34, "end": 3564.34, "text": "Ich erkläre euch, wie man gut Fortnite spielt."}, {"id": 491, "start": 3564.34, "end": 3574.34, "text": "Oder du bist nicht oder alle so gute Fortnite-Spieler und machst funny Fortnite-Videos."}, {"id": 492, "start": 3574.34, "end": 3578.34, "text": "Was auch ganz gut geht, ist, du machst generell so funny Gaming-Videos mit ein paar Kollegen,"}, {"id": 493, "start": 3578.34, "end": 3582.34, "text": "die sich halt alle kennen und halt funny sind."}, {"id": 494, "start": 3582.34, "end": 3587.34, "text": "Du machst Reaction-Videos, da müssen sie dann einen gewissen Charme haben,"}, {"id": 495, "start": 3587.34, "end": 3591.34, "text": "weil Reaction-Videos gibt es schon ganz schön viele."}, {"id": 496, "start": 3591.34, "end": 3594.34, "text": "Als Grill machst du einfach Boop-Cam."}, {"id": 497, "start": 3594.34, "end": 3597.34, "text": "Minecraft ist gar nicht mehr so angesagt."}, {"id": 498, "start": 3597.34, "end": 3600.34, "text": "Ich meine, klar, es gibt große Channels, die auch viele Views mit Minecraft haben,"}, {"id": 499, "start": 3600.34, "end": 3602.34, "text": "aber so den..."}, {"id": 500, "start": 3602.34, "end": 3606.34, "text": "Minecraft ist einfach so eine Konstante in der Welt irgendwie mittlerweile."}, {"id": 501, "start": 3606.34, "end": 3608.34, "text": "Hätte ich früher auch nicht für möglich gehalten,"}, {"id": 502, "start": 3608.34, "end": 3613.34, "text": "aber Minecraft lockt heute jetzt auch bei einem neuen Channel jetzt..."}, {"id": 503, "start": 3613.34, "end": 3618.34, "text": "auch nicht mehr instant irgendwie die Hunderttausende von Bildschirmen."}, {"id": 504, "start": 3618.34, "end": 3622.34, "text": "Was hältst du generell von Crypto-Bitcoin? Das hat auf jeden Fall eine Zukunft."}, {"id": 505, "start": 3626.34, "end": 3630.34, "text": "Gibt es eine Thematik, auf die du denn richtig Lust hättest, bezogen auf YouTube?"}, {"id": 506, "start": 3630.34, "end": 3634.34, "text": "Ja, habe ich ja schon mal gesagt, ich würde gerne in Videos mehr in die Richtung machen,"}, {"id": 507, "start": 3634.34, "end": 3637.34, "text": "wo es halt um... nicht unbedingt rein um Games geht."}, {"id": 508, "start": 3637.34, "end": 3639.34, "text": "Ich würde gerne Sachen... Ich würde gerne..."}, {"id": 509, "start": 3639.34, "end": 3641.34, "text": "Ich hätte erstmal gerne ein ordentliches Battlefield-Video."}, {"id": 510, "start": 3641.34, "end": 3644.34, "text": "Ich hätte mal gerne irgendwelche Games, wo ich was zu sagen kann."}, {"id": 511, "start": 3644.34, "end": 3649.34, "text": "Dann würde ich gerne weiterhin einfach meinen Senf zu irgendwelchen aktuellen Sachen geben."}, {"id": 512, "start": 3649.34, "end": 3653.34, "text": "Und als drittes würde ich eigentlich gerne ein bisschen mehr Technik-Krams machen."}, {"id": 513, "start": 3653.34, "end": 3657.34, "text": "Jetzt nicht so super advancedes Kram wie hier im Stream."}, {"id": 514, "start": 3657.34, "end": 3659.34, "text": "Das kannst du auf YouTube nicht bringen."}, {"id": 515, "start": 3659.34, "end": 3663.34, "text": "Aber zum Beispiel ein selbst gebautes 10 Gigabit NAS."}, {"id": 516, "start": 3663.34, "end": 3667.34, "text": "Sowas zum Beispiel, so für den Noob."}, {"id": 517, "start": 3667.34, "end": 3670.34, "text": "Und viele Leute werden es nicht bauen, sondern einfach, die interessiert das."}, {"id": 518, "start": 3670.34, "end": 3676.34, "text": "Ich zeige, mein Mini-Rack hat irgendwie 150.000 Aufrufe gekriegt."}, {"id": 519, "start": 3689.34, "end": 3693.34, "text": "Meinung zu Commander Krieger? Keine Ahnung, ich weiß nicht, was er aktuell macht."}, {"id": 520, "start": 3693.34, "end": 3696.34, "text": "Dazu müsste ich ja erstmal vor der Kamera rumspringen."}, {"id": 521, "start": 3698.34, "end": 3704.34, "text": "Aber ich finde ganz ehrlich, die Lux Tech Tips ist die optimale Mischung"}, {"id": 522, "start": 3704.34, "end": 3712.34, "text": "aus Technik und Entertainment, so dass es noch den Großteil der Leute anspricht."}, {"id": 523, "start": 3712.34, "end": 3717.34, "text": "Machst du es komplizierter, dann ist das für die meisten Leute nichts."}, {"id": 524, "start": 3717.34, "end": 3723.34, "text": "Was er kaputt macht, weiß ich nicht. Ich habe schon ein paar Monate nichts gehört."}, {"id": 525, "start": 3725.34, "end": 3728.34, "text": "Ja Reveal Video, aber wozu soll ich das machen?"}, {"id": 526, "start": 3728.34, "end": 3731.34, "text": "Da kennen mich die Leute ja in Frankfurt oder sonst wo."}, {"id": 527, "start": 3731.34, "end": 3732.34, "text": "Ich habe keinen Bock drauf."}, {"id": 528, "start": 3732.34, "end": 3735.34, "text": "Ich weiß das noch, wo ich mal den Friseur besucht habe,"}, {"id": 529, "start": 3735.34, "end": 3739.34, "text": "als er noch ein bisschen mehr Videos gemacht hat und auch regelmäßig Livestream."}, {"id": 530, "start": 3739.34, "end": 3742.34, "text": "Wo mir interessiert ist, was ich jetzt mache."}, {"id": 531, "start": 3742.34, "end": 3747.34, "text": "Der war ja aber weitem nicht so groß wie größere Channels auf YouTube,"}, {"id": 532, "start": 3747.34, "end": 3751.34, "text": "wo dann random die Leute laufen gekommen sind und ihn erkannt haben."}, {"id": 533, "start": 3751.34, "end": 3753.34, "text": "Da habe ich keine Kraft drauf."}, {"id": 534, "start": 3754.34, "end": 3758.34, "text": "Das Schlimmste, was ich mir vorstellen kann, ist morgens, wenn ich in der Bahn sitze"}, {"id": 535, "start": 3758.34, "end": 3760.34, "text": "und überhaupt keinen Bock auf die Welt um mich drum herum habe,"}, {"id": 536, "start": 3760.34, "end": 3764.34, "text": "dass dann irgendjemand kommt und sagt, hey Max, wie gehts? Kenne dich von YouTube."}, {"id": 537, "start": 3764.34, "end": 3770.34, "text": "Das ist für mich schlecht und für den schlecht. Für alle schlecht dann."}, {"id": 538, "start": 3781.34, "end": 3783.34, "text": "Gifts im Disco, was ist das?"}, {"id": 539, "start": 3783.34, "end": 3786.34, "text": "Das ist ein Kostüm, ein Kostüm, ein Kostüm."}, {"id": 540, "start": 3786.34, "end": 3788.34, "text": "Das ist ein Kostüm."}, {"id": 541, "start": 3788.34, "end": 3790.34, "text": "Das ist ein Kostüm, ein Kostüm."}, {"id": 542, "start": 3790.34, "end": 3792.34, "text": "Das ist ein Kostüm, ein Kostüm."}, {"id": 543, "start": 3792.34, "end": 3796.34, "text": "Gifts im Discord, reicht das Nitro für 50?"}, {"id": 544, "start": 3796.34, "end": 3799.34, "text": "Ich dachte, Nitro muss man sich selber kaufen."}, {"id": 545, "start": 3811.34, "end": 3814.34, "text": "Ja, schau mal, was soll ich schauen im Discord?"}, {"id": 546, "start": 3814.34, "end": 3816.34, "text": "Okay, wir gehen jetzt mal ins Discord."}, {"id": 547, "start": 3816.34, "end": 3817.34, "text": "Was?"}, {"id": 548, "start": 3817.34, "end": 3822.34, "text": "Cebaro, was?"}, {"id": 549, "start": 3825.34, "end": 3829.34, "text": "Auf Discord. Datenplatz."}, {"id": 550, "start": 3833.34, "end": 3836.34, "text": "Wie nennt man Max in einem Meeting? Serious Max."}, {"id": 551, "start": 3836.34, "end": 3839.34, "text": "Das fand ich mal ein guter Witz."}, {"id": 552, "start": 3839.34, "end": 3843.34, "text": "So, was? Und jetzt gehen, jetzt gehen..."}, {"id": 553, "start": 3843.34, "end": 3848.34, "text": "Nee, Gifts gehen nicht, weil ich hab doch kein Nitro."}, {"id": 554, "start": 3853.34, "end": 3855.34, "text": "Per PN."}, {"id": 555, "start": 3855.34, "end": 3857.34, "text": "Ja, auf Twitter oder..."}, {"id": 556, "start": 3857.34, "end": 3869.34, "text": "Zwei Mal nach dem Streben dann."}, {"id": 557, "start": 3869.34, "end": 3872.34, "text": "Geh bitte mal auf die Memes in Discord und bewert sie, nee."}, {"id": 558, "start": 3872.34, "end": 3877.34, "text": "Max, warum bekommt die Schweizer Bahn es hin,"}, {"id": 559, "start": 3877.34, "end": 3879.34, "text": "eine Pünktlichkeit von 96% zu haben,"}, {"id": 560, "start": 3879.34, "end": 3883.34, "text": "und die deutsche Bahn es nicht?"}, {"id": 561, "start": 3883.34, "end": 3886.34, "text": "Also ich weiß nicht, was die Schweizer Bahn..."}, {"id": 562, "start": 3886.34, "end": 3889.34, "text": "Also was die besonders gut machen in der Schweiz."}, {"id": 563, "start": 3889.34, "end": 3892.34, "text": "Ich weiß nur, was die deutsche Bahn besonders schlecht macht."}, {"id": 564, "start": 3892.34, "end": 3894.34, "text": "Zum Beispiel in den letzten zehn Jahren ihr Netz verkleinern,"}, {"id": 565, "start": 3894.34, "end": 3897.34, "text": "obwohl immer mehr Leute fahren."}, {"id": 566, "start": 3897.34, "end": 3902.34, "text": "Was mit Sicherheit ein großer Grund ist, warum es so beschissen läuft."}, {"id": 567, "start": 3905.34, "end": 3908.34, "text": "Regel535 sagt, ich soll ein Video machen."}, {"id": 568, "start": 3908.34, "end": 3910.34, "text": "Zehn Tipps, wie du dein PC schneller machst."}, {"id": 569, "start": 3910.34, "end": 3913.34, "text": "Funktioniert wirklich. Direkt eine Million Views."}, {"id": 570, "start": 3913.34, "end": 3916.34, "text": "Beste."}, {"id": 571, "start": 3926.34, "end": 3928.34, "text": "Sack, alle weg."}, {"id": 572, "start": 3928.34, "end": 3930.34, "text": "So, was könnte man sonst noch gucken?"}, {"id": 573, "start": 3930.34, "end": 3933.34, "text": "Ich muss mal in meine später anschauen Liste gucken,"}, {"id": 574, "start": 3933.34, "end": 3947.34, "text": "ob es da irgendwas interessantes noch drin gibt."}, {"id": 575, "start": 3947.34, "end": 3948.34, "text": "Kennt ihr das?"}, {"id": 576, "start": 3948.34, "end": 3954.34, "text": "Das gucke ich auch manchmal gerne."}, {"id": 577, "start": 3954.34, "end": 3959.34, "text": "War das das? Kennt ihr das?"}, {"id": 578, "start": 3959.34, "end": 3963.34, "text": "Das ist ein Typ, der macht immer Videos über seine Ameisen."}, {"id": 579, "start": 3963.34, "end": 3967.34, "text": "Wo man sich eigentlich denkt, das ist übelst langweilig."}, {"id": 580, "start": 3967.34, "end": 3978.34, "text": "Aber es ist trotzdem unterhaltsam sich anzugucken."}, {"id": 581, "start": 3978.34, "end": 3986.34, "text": "Das Noverkühlungsvideo vom Bauer."}, {"id": 582, "start": 3986.34, "end": 3991.34, "text": "Das müssen wir uns jetzt angucken."}, {"id": 583, "start": 3991.34, "end": 3998.34, "text": "EA ist auch so ein typischer Bullshit-Marketing-Laden."}, {"id": 584, "start": 3998.34, "end": 4002.34, "text": "Vor ein paar Jahren, nachdem der Hate so richtig groß war,"}, {"id": 585, "start": 4002.34, "end": 4005.34, "text": "haben sie erzählt, ihr Leute habt recht."}, {"id": 586, "start": 4005.34, "end": 4008.34, "text": "Wir sind voll geläutert."}, {"id": 587, "start": 4008.34, "end": 4011.34, "text": "Aber wir sind jetzt Player First."}, {"id": 588, "start": 4011.34, "end": 4016.34, "text": "Wir werden die besten Player First und wir haben nur unsere Spieler im Sinn."}, {"id": 589, "start": 4016.34, "end": 4019.34, "text": "Das hat genau zwei Wochen gehalten."}, {"id": 590, "start": 4019.34, "end": 4035.34, "text": "Das EA besteht auch aus sehr viel Bullshit-Marketing."}, {"id": 591, "start": 4035.34, "end": 4048.34, "text": "Das ist wohl wahr."}, {"id": 592, "start": 4048.34, "end": 4053.34, "text": "Das ist der Obergi Beta."}, {"id": 593, "start": 4053.34, "end": 4056.34, "text": "Wobei, das ist ein anderer Typ, als ich gedacht habe."}, {"id": 594, "start": 4056.34, "end": 4061.34, "text": "Ich weiß gar nicht, wer das ist."}, {"id": 595, "start": 4061.34, "end": 4067.34, "text": "Armes EA."}, {"id": 596, "start": 4067.34, "end": 4076.34, "text": "Wie können die Leute nur auf die Idee kommen, dass EA nicht die Guten sind?"}, {"id": 597, "start": 4076.34, "end": 4079.34, "text": "Das ist mir vollkommen unverständlich."}, {"id": 598, "start": 4079.34, "end": 4090.34, "text": "Das weiß ich gar nicht, wie man auf die Idee kommen könnte."}, {"id": 599, "start": 4090.34, "end": 4092.34, "text": "Die müssen das verstehen."}, {"id": 600, "start": 4092.34, "end": 4121.34, "text": "Die sagen nur offiziell, dass sie es nicht verstehen."}, {"id": 601, "start": 4121.34, "end": 4123.34, "text": "Pee-Pee-Gas."}, {"id": 602, "start": 4151.34, "end": 4180.34, "text": "Das war wenig auf jeden Fall."}, {"id": 603, "start": 4180.34, "end": 4196.34, "text": "Wenn man sich das im Hintergrund anguckt, kann man überhaupt nicht auf die Idee kommen, was man an EA nicht mag."}, {"id": 604, "start": 4196.34, "end": 4209.34, "text": "Das ist genau das, warum es unglaublich dumm ist, Firmen oder Unternehmen so extrem zu fanboyen,"}, {"id": 605, "start": 4209.34, "end": 4216.34, "text": "weil sie scheißen drauf."}, {"id": 606, "start": 4216.34, "end": 4222.34, "text": "Sie haben das überhaupt nicht verdient, sie zu fanboyen."}, {"id": 607, "start": 4222.34, "end": 4227.34, "text": "Als Fanboy lässt man sich einfach nur besser melken."}, {"id": 608, "start": 4227.34, "end": 4229.34, "text": "Das ist nicht so, dass sie ihre Fans mögen."}, {"id": 609, "start": 4229.34, "end": 4240.34, "text": "Die mögen ihre Fans, die sich gut melken lassen."}, {"id": 610, "start": 4240.34, "end": 4243.34, "text": "Ich kann Blizzard auch nicht mehr fanboyen, Online-Ritter."}, {"id": 611, "start": 4243.34, "end": 4245.34, "text": "Was hat Blizzard die letzten Jahre?"}, {"id": 612, "start": 4245.34, "end": 4266.34, "text": "Egal, wir gucken erst mal das Video an."}, {"id": 613, "start": 4266.34, "end": 4272.34, "text": "EA ist bestimmt ein ganz toller Laden."}, {"id": 614, "start": 4272.34, "end": 4283.34, "text": "Das EA jetzt wirklich so ein schöner Ort ist, wo alle Entwickler und alle Mitarbeiter glücklich sind, habe ich auch so meine Zweifel dran."}, {"id": 615, "start": 4283.34, "end": 4288.34, "text": "MX-Sama, klar, das ist alles Activision mittlerweile."}, {"id": 616, "start": 4288.34, "end": 4290.34, "text": "Und man merkt es auch immer mehr."}, {"id": 617, "start": 4290.34, "end": 4295.34, "text": "Originale Blizzard-Leute sind zum größten Teil weg."}, {"id": 618, "start": 4295.34, "end": 4316.34, "text": "Bei Blizzard hocken jetzt Activision, BWL, Marketing-Anzug-Leute."}, {"id": 619, "start": 4316.34, "end": 4322.34, "text": "Und man darf von abgesehen, die supporten Indie-Developers jetzt ja auch nicht, weil sie aus reiner Nächstenliebe."}, {"id": 620, "start": 4322.34, "end": 4345.34, "text": "Die versprechen sich ja natürlich auch was von."}, {"id": 621, "start": 4345.34, "end": 4353.34, "text": "Und Anthem, hör mal auf."}, {"id": 622, "start": 4353.34, "end": 4376.34, "text": "Fail-Game."}, {"id": 623, "start": 4383.34, "end": 4387.34, "text": "Das haben wir geguckt, ich hehle."}, {"id": 624, "start": 4387.34, "end": 4390.34, "text": "Das Fall of 76."}, {"id": 625, "start": 4390.34, "end": 4393.34, "text": "Da muss ich jetzt aber trotzdem was zu sagen."}, {"id": 626, "start": 4393.34, "end": 4398.34, "text": "Homeworld schreibt, und Blizzard hört auf die Community, sie kommen ins WoW Classic."}, {"id": 627, "start": 4398.34, "end": 4408.34, "text": "Ich glaube, man gibt an der Stelle Blizzard sogar zu viel Credit, nach dem Motto, sie hören auf die Community."}, {"id": 628, "start": 4408.34, "end": 4410.34, "text": "Verstehe ich nicht falsch."}, {"id": 629, "start": 4410.34, "end": 4414.34, "text": "Ich finde es gut, dass für Classic WoW deutsche Server kommen."}, {"id": 630, "start": 4414.34, "end": 4421.34, "text": "Aber, wie man überhaupt auf die Idee kommen konnte, das nicht zu tun, ist mir vollkommen unbegreiflich."}, {"id": 631, "start": 4421.34, "end": 4424.34, "text": "Das hätte Ihnen eigentlich von Anfang an klar sein müssen, dass die Leute sich das wünschen."}, {"id": 632, "start": 4424.34, "end": 4432.34, "text": "Und sie haben sich bewusst aus internen Gründen, die haben sich das garantiert gut überlegt, keine deutschen Server zu machen."}, {"id": 633, "start": 4432.34, "end": 4440.34, "text": "Haben sie sich dafür entschieden, eben absichtlich nicht auf das zu hören, was die Leute wollen."}, {"id": 634, "start": 4440.34, "end": 4455.34, "text": "Und erst nachdem der negative Aufschrei so groß war, und auch das negative Feedback und wahrscheinlich auch die befürchteten finanziellen Einbußen, so groß war, dass quasi das überwiegt hat."}, {"id": 635, "start": 4455.34, "end": 4461.34, "text": "Erst dann hat man gesagt, man macht deutsche Server."}, {"id": 636, "start": 4461.34, "end": 4465.34, "text": "Ich glaube auch wieder nicht, dass sie das so nach dem Motto aus reiner Nächstenliebe machen."}, {"id": 637, "start": 4465.34, "end": 4475.34, "text": "Weil sie wirklich auf die Community in dem Sinn hören, und es ist ihnen was Großartiges, dass es für sie was zählt."}, {"id": 638, "start": 4475.34, "end": 4477.34, "text": "Früher bei Blizzard wäre ich davon ausgegangen."}, {"id": 639, "start": 4477.34, "end": 4482.34, "text": "Ihr müsst euch mal die alten, ohne Scheiß, guckt euch die alten BlizzCon Pressekonferenzen an."}, {"id": 640, "start": 4482.34, "end": 4485.34, "text": "Das war eine komplett andere Firma."}, {"id": 641, "start": 4485.34, "end": 4493.34, "text": "Du hattest damals, Overwatch-Chef hat damals auf der Bühne gestanden, für WoW noch, 2007 oder so."}, {"id": 642, "start": 4493.34, "end": 4499.34, "text": "Da war ja früher, was war Chef bei World of Warcraft, Instance-Designer-Typ oder?"}, {"id": 643, "start": 4499.34, "end": 4503.34, "text": "Ich weiß es nicht, zumindest hat er was mit WoW zu tun gehabt."}, {"id": 644, "start": 4503.34, "end": 4512.34, "text": "Der hat auf der Bühne gestanden damals und hat einen Witz darüber gemacht, dass man schlechte Spieler noch aus der Gruppe kicken kann."}, {"id": 645, "start": 4512.34, "end": 4517.34, "text": "Das war ein Witz lustig, wie er das gesagt hat."}, {"id": 646, "start": 4517.34, "end": 4521.34, "text": "Das würde der heute im Traumlicht dran denken, sowas zu sagen."}, {"id": 647, "start": 4526.34, "end": 4528.34, "text": "Das würde er im Traumlicht dran denken."}, {"id": 648, "start": 4528.34, "end": 4542.34, "text": "Blizzard ist heute deutlich mehr, nennen wir es mal professioneller, in dem Sinn, dass sie sich so verhalten, wie es alle anderen auch machen."}, {"id": 649, "start": 4542.34, "end": 4552.34, "text": "Das ist der Chef der Lead-Designer von Overwatch."}, {"id": 650, "start": 4552.34, "end": 4566.34, "text": "liche Firma grüß"}, {"id": 651, "start": 4566.34, "end": 4571.34, "text": "Ich weiß, dass Chef der Lead-Designer von Overwatch ist."}, {"id": 652, "start": 4571.34, "end": 4576.7, "text": "ich wusste bloß nicht was er in was er in was er in wo designed hat ich weiß"}, {"id": 653, "start": 4576.7, "end": 4579.58, "text": "nur dass er auf den alten blitz konz auf der bühne gestanden ab und zu was über"}, {"id": 654, "start": 4579.58, "end": 4585.58, "text": "wo erzählt hat das war das war komplett andere welt"}, {"id": 655, "start": 4589.86, "end": 4596.82, "text": "kennt ihr den post von jeff wo er sich über über fqst ausgelassen hat ich"}, {"id": 656, "start": 4596.82, "end": 4607.86, "text": "kleiner flamer das hier genau ich glaube das meine ich die gucken uns jetzt nicht"}, {"id": 657, "start": 4607.86, "end": 4611.62, "text": "an die presse konferenz jetzt geht das geht ein stück da jetzt dann da erzählt"}, {"id": 658, "start": 4611.62, "end": 4621.54, "text": "er über wie sie wie sie wie sie rates erstellen in in wo und das ist ein"}, {"id": 659, "start": 4621.54, "end": 4631.18, "text": "komplett anderer vortrag eine komplett andere philosophie hinter dem wie die"}, {"id": 660, "start": 4631.18, "end": 4636.06, "text": "games wie sie die games gemacht haben als man das heute von blizzard sieht und"}, {"id": 661, "start": 4636.06, "end": 4641.26, "text": "ich kann mir einfach das nur so erklären dass seiter activischen mit am start ist"}, {"id": 662, "start": 4641.26, "end": 4648.14, "text": "blizzard immer mehr und mehr durch activischen bvl anzug menschen ersetzt"}, {"id": 663, "start": 4648.14, "end": 4651.98, "text": "wurde an den wichtigen stellen so dass heute"}, {"id": 664, "start": 4651.98, "end": 4659.22, "text": "quasi von von dem von dem von dem klassischen von der klassischen blizzard"}, {"id": 665, "start": 4659.22, "end": 4666.58, "text": "philosophie noch recht wenig übrig ist ich mein man sieht es doch schon an diesem"}, {"id": 666, "start": 4666.58, "end": 4672.22, "text": "mobile diablo sieht so eine firma aus die auf ihre fans hört"}, {"id": 667, "start": 4674.22, "end": 4678.06, "text": "ja und dann ja insofern ihr habt insofern schon recht das was blizzard"}, {"id": 668, "start": 4678.06, "end": 4683.58, "text": "qualitativ rausbringt von technischer seite sind die games top da kannst du"}, {"id": 669, "start": 4683.58, "end": 4689.58, "text": "nix sagen also blizzard games sind in der regel in der beta schon backfreier"}, {"id": 670, "start": 4689.58, "end": 4696.62, "text": "stabiler und und runder als das viele viele release titel sind"}, {"id": 671, "start": 4700.5, "end": 4705.38, "text": "aber dass man die spiele bei blizzard noch im hinblick für die spieler macht"}, {"id": 672, "start": 4705.38, "end": 4709.86, "text": "das glaube ich nicht mal das glaube ich auch bei blizzard nicht mehr"}, {"id": 673, "start": 4721.06, "end": 4724.62, "text": "was ist denn hier eigentlich kratzer eigentlich haben wir uns ein video"}, {"id": 674, "start": 4724.62, "end": 4729.46, "text": "angeguckt warum ihr so viel gehärtet wird beziehungsweise"}, {"id": 675, "start": 4729.46, "end": 4734.42, "text": "ihr sagt ihr weiß nicht warum sie so viel gehärtet werden und irgendwie sind"}, {"id": 676, "start": 4734.42, "end": 4737.42, "text": "wir auf blizzard gekommen"}, {"id": 677, "start": 4738.06, "end": 4742.66, "text": "ja und ein ritter dass ich schon in progress"}, {"id": 678, "start": 4745.86, "end": 4750.66, "text": "es gehen ja sogar die gerüchte um habe schon ein paar mal erzählt dass der"}, {"id": 679, "start": 4750.66, "end": 4755.66, "text": "ehemalige blizzard chef mitgegangen ist da gibt wie gesagt gerüchte ich sag"}, {"id": 680, "start": 4755.66, "end": 4759.86, "text": "nochmal gerüchte ich verkaufe das jetzt hier nicht irgendwie als das wäre so"}, {"id": 681, "start": 4759.86, "end": 4763.78, "text": "gerüchte dass der ehemalige blizzard chef der ist zurückgedreht vorletzte"}, {"id": 682, "start": 4763.78, "end": 4767.38, "text": "blitzkorn oder so oder hat gesagt ist jetzt vorbei ich mache mich vom acker"}, {"id": 683, "start": 4767.38, "end": 4771.34, "text": "weil er einer derjenigen war dass ich hingestellt hat und gesagt hat"}, {"id": 684, "start": 4771.34, "end": 4774.18, "text": "overwatch ist noch nicht ready beziehungsweise noch nicht e-sport"}, {"id": 685, "start": 4774.18, "end": 4780.06, "text": "ready oder passt auch overwatch ist quasi jetzt erst"}, {"id": 686, "start": 4780.06, "end": 4784.66, "text": "halbwegs ready wenn du es so willst ja die haben jetzt erst in replay modus"}, {"id": 687, "start": 4784.66, "end": 4789.98, "text": "die haben jetzt erst ein ordentliches ein ordentliches queue system wahrscheinlich"}, {"id": 688, "start": 4789.98, "end": 4793.1, "text": "wenn das tatsächlich auch so gut funktioniert wie ich das gesehen habe"}, {"id": 689, "start": 4793.1, "end": 4799.26, "text": "in videos von ptr und da fragt man sich"}, {"id": 690, "start": 4799.26, "end": 4805.46, "text": "er war da nicht vielleicht was dran ja der despektator und dass das"}, {"id": 691, "start": 4805.46, "end": 4809.22, "text": "observe in overwatch ist tatsächlich im vergleich zu cs bei weitem nicht so"}, {"id": 692, "start": 4809.22, "end": 4813.58, "text": "strukturiert aber das liegt auch in der natur vom game irgendwo"}, {"id": 693, "start": 4813.58, "end": 4817.26, "text": "egal wir gucken jetzt mal das video weiter"}, {"id": 694, "start": 4817.26, "end": 4827.42, "text": "die indy community in den ea isn't just trying to grab people out of the indy"}, {"id": 695, "start": 4827.42, "end": 4831.18, "text": "community to be part of ea like they do with every single developer that they"}, {"id": 696, "start": 4831.18, "end": 4835.7, "text": "integrate into the ea ecosystem whatever let's not even go that far they do not"}, {"id": 697, "start": 4835.7, "end": 4840.66, "text": "treat consumers well das sind who are actually putting money into ea's pocket"}, {"id": 698, "start": 4840.66, "end": 4845.7, "text": "or at very least making the case for investors to put money in ea's pocket"}, {"id": 699, "start": 4845.7, "end": 4850.7, "text": "you know the people who basically make the business healthy or unhealthy are"}, {"id": 700, "start": 4850.7, "end": 4856.38, "text": "just routinely treated as cattle as stupid brainless fools who don't know"}, {"id": 701, "start": 4856.38, "end": 4860.74, "text": "anything much less what they want themselves and that they need to be"}, {"id": 702, "start": 4860.74, "end": 4865.5, "text": "essentially told what they want and that they won't notice when every"}, {"id": 703, "start": 4865.5, "end": 4870.38, "text": "exploitative action you take is just plainly put right in front of them when"}, {"id": 704, "start": 4870.38, "end": 4876.54, "text": "for instance es wird halt es wird halt gemacht was geht es wird halt es wird"}, {"id": 705, "start": 4876.54, "end": 4881.14, "text": "halt komplett gemacht was geht sei es was loot boxen angeht sei es quasi an"}, {"id": 706, "start": 4881.14, "end": 4886.02, "text": "irgendwelchen versteckten sachen so nach dem motto"}, {"id": 707, "start": 4886.02, "end": 4891.22, "text": "irgendwelche shortcut packs oder oder was hast du sonst noch"}, {"id": 708, "start": 4891.22, "end": 4896.14, "text": "irgendwelche sachen die so in ewig langen krein haben dass du dann doch im"}, {"id": 709, "start": 4896.14, "end": 4901.42, "text": "shop was kauf es wird halt ausgetestet was geht und erst wenn das geschrei so"}, {"id": 710, "start": 4901.42, "end": 4906.3, "text": "groß ist wie es beispielsweise war bettel front 2 gewesen ist erst dann"}, {"id": 711, "start": 4906.3, "end": 4910.62, "text": "tut sich was und ich ich gehe mal davon aus dass ich bei bettel front 2 auch"}, {"id": 712, "start": 4910.62, "end": 4913.9, "text": "hauptsächlich was getan hat weil disney damals gesagt hat sie wollen damit nicht"}, {"id": 713, "start": 4913.9, "end": 4922.1, "text": "mein verbindung gebracht werden danke für den ost war das war das das"}, {"id": 714, "start": 4922.1, "end": 4927.54, "text": "stream ohne hose wenn es gar nicht mehr sicher"}, {"id": 715, "start": 4929.86, "end": 4933.74, "text": "ne das nee das war nicht das stream ohne hose den ich gehorstet habe oder"}, {"id": 716, "start": 4933.74, "end": 4938.14, "text": "ach nein das war ich weiß das war der neueste das war der der reisen pc war"}, {"id": 717, "start": 4938.14, "end": 4940.94, "text": "das ich weiß wieder"}, {"id": 718, "start": 4941.14, "end": 4946.1, "text": "weil ich habe letztendlich letztes hat man eingeheint gehorstet und als er"}, {"id": 719, "start": 4946.1, "end": 4951.3, "text": "gesagt hat quasi so hoch host sehr aufgestanden hatte keine hose an also"}, {"id": 720, "start": 4951.3, "end": 4958.9, "text": "also nicht komplett nackig oder so aber halt keine richtige hose"}, {"id": 721, "start": 4960.94, "end": 4964.46, "text": "mocha tors ja"}, {"id": 722, "start": 4964.82, "end": 4969.14, "text": "und sie inkludieren box ist in der game und übrigens falls du dich fragst"}, {"id": 723, "start": 4969.14, "end": 4973.3, "text": "hier was ist das eigentlich komischer typ der dich da gehorstet hat ich ich ich"}, {"id": 724, "start": 4973.3, "end": 4980.1, "text": "mache normalerweise kein reaction content aber heute ist so warm da machen da"}, {"id": 725, "start": 4980.1, "end": 4983.1, "text": "da gucken wir uns einfach ein paar sachen an"}, {"id": 726, "start": 4983.1, "end": 4989.7, "text": "mindlessly long encouraging people to put money into the games randomized"}, {"id": 727, "start": 4989.7, "end": 4995.46, "text": "gambling ecosystem that will eventually yield you a means to pass by all of that"}, {"id": 728, "start": 4995.46, "end": 4999.42, "text": "grinding ich hab guckt euch mal das game an von technischer seite kann man da"}, {"id": 729, "start": 4999.42, "end": 5005.34, "text": "wirklich nichts sagen das sieht richtig gut aus das lief auch richtig gut ich"}, {"id": 730, "start": 5005.34, "end": 5008.98, "text": "kann ehrlich gesagt nicht sagen wie gutes vom inhalt her war der er hat es"}, {"id": 731, "start": 5008.98, "end": 5012.62, "text": "glaube ich relativ viel gespielt falls er da ist"}, {"id": 732, "start": 5014.26, "end": 5023.38, "text": "aber an sich hatte bettel von zwei schon die chance in gescheites game zu werden"}, {"id": 733, "start": 5024.18, "end": 5028.66, "text": "aber es wurde komplett verkackt mit dieser ganzen crime micro transaction"}, {"id": 734, "start": 5028.66, "end": 5034.46, "text": "geschichte das im studa zu scribe dankeschön"}, {"id": 735, "start": 5034.46, "end": 5038.42, "text": "samus glömer pock"}, {"id": 736, "start": 5039.1, "end": 5044.42, "text": "you a means to pass by all of that grinding like oh i don't know maybe in"}, {"id": 737, "start": 5044.42, "end": 5048.46, "text": "star wars battlefront 2 which was perhaps one of the biggest gaming"}, {"id": 738, "start": 5048.46, "end": 5053.66, "text": "controversies of the last few years when they do that EA so clearly demonstrates"}, {"id": 739, "start": 5053.66, "end": 5059.14, "text": "their opinion of their customers we're lemmings in their eyes and no one likes"}, {"id": 740, "start": 5059.14, "end": 5064.26, "text": "to be considered that because when a massive company considers you to be just"}, {"id": 741, "start": 5064.26, "end": 5068.82, "text": "a follower that will do whatever they throw whatever at you and that's exactly"}, {"id": 742, "start": 5068.82, "end": 5073.86, "text": "what he does now i would have to say the star wars battlefront to loot box"}, {"id": 743, "start": 5073.86, "end": 5078.1, "text": "controversy is possibly one of the biggest controversies i've seen the"}, {"id": 744, "start": 5078.1, "end": 5084.62, "text": "entire time i've been games which dates back to the 1980s i must disclose if i"}, {"id": 745, "start": 5084.62, "end": 5088.22, "text": "say something like that but he has been behind some of the most interesting"}, {"id": 746, "start": 5088.22, "end": 5094.5, "text": "that's what i'm talking about how friendly they are to developers it's a little bit"}, {"id": 747, "start": 5094.5, "end": 5098.54, "text": "ironic because through the years they bought a number of studios and ran them into the ground"}, {"id": 748, "start": 5098.54, "end": 5104.7, "text": "this goes as far back to origin the developer of the ultimate game they shut down directly"}, {"id": 749, "start": 5104.7, "end": 5110.14, "text": "after all of the things also if one of us is vielleicht nicht erwartet in dem fall"}, {"id": 750, "start": 5110.14, "end": 5116.66, "text": "muss ich tatsächlich auch mal was pro ea sagen es liegt nicht nur an ea wenn also"}, {"id": 751, "start": 5116.66, "end": 5121.78, "text": "nicht es liegt nicht bei allen studios immer nur an ea dass die geschlossen werden da gibt"}, {"id": 752, "start": 5121.78, "end": 5125.18, "text": "es auch genug die haben sich einfach übernommen die haben gedacht so nach dem motto hoch wir"}, {"id": 753, "start": 5125.18, "end": 5129.66, "text": "sind jetzt bei ea wir schwimmen quasi in geld und haben dann dinge halt angefangen die"}, {"id": 754, "start": 5129.66, "end": 5133.7, "text": "nie fertig geworden sind sie haben sich einfach übernommen also es ist nicht unbedingt immer"}, {"id": 755, "start": 5133.7, "end": 5138.94, "text": "an allem schuld auch wenn da ea auf dem video jetzt drauf steht was ich halt richtig bitter"}, {"id": 756, "start": 5138.94, "end": 5146.5, "text": "finde ist sowas wie bei maxis zum beispiel in city rausgehauen was garantiert nicht"}, {"id": 757, "start": 5146.5, "end": 5151.66, "text": "so entstanden ist weil sich dass die designer bei maxis so gedacht haben sondern mit sicherheit"}, {"id": 758, "start": 5151.66, "end": 5156.22, "text": "waren da auch leute von ea direkt dahinten moment maxis überhaupt die nicht dass ich"}, {"id": 759, "start": 5156.22, "end": 5162.58, "text": "jetzt dich da jetzt blödsinn erzählt doch maxis war ea na ist ja im prinzip wurscht wenn"}, {"id": 760, "start": 5162.58, "end": 5167.1, "text": "nicht ea dann ersetzt das durch was anderem trifft ja auch zu ich glaube es ist ea gewesen"}, {"id": 761, "start": 5167.1, "end": 5173.14, "text": "die haben das spiel des letztes im city ja nicht so verkackt weil sich die designer das"}, {"id": 762, "start": 5173.14, "end": 5176.58, "text": "überlegt haben und gedacht haben wir wollen eine map die so klein ist wir wollen spiel was immer"}, {"id": 763, "start": 5176.58, "end": 5182.86, "text": "crash sonst was das war termin druck ohne ende wahrscheinlich unfertige unfertige sache released"}, {"id": 764, "start": 5182.86, "end": 5191.82, "text": "plus dass noch auf das gameplay und das game an sich einfluss genommen wurde das heißt ja"}, {"id": 765, "start": 5191.82, "end": 5197.34, "text": "die haben die doppelte arschkarte die mussten ein kack spiel machen das was zu früh released"}, {"id": 766, "start": 5197.34, "end": 5203.18, "text": "wurde und sie wurden danach auch noch geschlossen das doppelte arschkarte also das entwicklerstuhl"}, {"id": 767, "start": 5203.18, "end": 5208.38, "text": "hatte eigentlich die richtige arschkarte in dem fall ist die eigentlich größer als blizzard"}, {"id": 768, "start": 5208.38, "end": 5216.02, "text": "das ist so eine sache wo ich aus dem bauchgefühl sagen würde ja auf jeden fall allerdings hat"}, {"id": 769, "start": 5216.02, "end": 5222.54, "text": "blizzard wo und wo bringt übelst viel kohle allerdings insgesamt würde ich immer noch sagen"}, {"id": 770, "start": 5222.54, "end": 5227.86, "text": "wenn ich mir diesen ganzen sportgeschiss anguckt was sie so hat und drumherum ist ea eindeutig"}, {"id": 771, "start": 5227.86, "end": 5234.74, "text": "größer man müsste sich mal die zahlen angucken ja und ob activation blizzard größer ist muss"}, {"id": 772, "start": 5234.74, "end": 5260.06, "text": "man auch mal schon ich weiß ehrlich gesagt nicht"}, {"id": 773, "start": 5260.06, "end": 5272.02, "text": "die jetzt da ist l.a. sind da pickt auch kein mensch mehr durch oder"}, {"id": 774, "start": 5272.02, "end": 5290.7, "text": "das stimmt so schlecht hätte kein nachfolger gebraucht ganz ehrlich das war ein super game"}, {"id": 775, "start": 5290.7, "end": 5293.58, "text": "und hatte einen richtig schönen abschluss auch wenn es natürlich ein cliffhanger hatte"}, {"id": 776, "start": 5293.58, "end": 5299.26, "text": "aber es sollte also eine sorte von spiele gehört das irgendwie fast schon dazu aber es war abgeschlossen"}, {"id": 777, "start": 5299.26, "end": 5305.02, "text": "eigentlich jetzt bei zwei war schlecht jetzt bei zwei solange drei soll angeblich den"}, {"id": 778, "start": 5305.02, "end": 5309.7, "text": "ticken besser gewesen sein aber ganz ehrlich das hätte an sich kein nachfolger gebraucht"}, {"id": 779, "start": 5309.7, "end": 5318.94, "text": "im koop im koop ist alles geil ja das war ja auch komplett"}, {"id": 780, "start": 5318.94, "end": 5348.82, "text": "das kommt halt daher wenn man sagt leute wir brauchen eine neue"}, {"id": 781, "start": 5348.82, "end": 5353.3, "text": "mass effect und der entwickler sagt moment wir sind doch eigentlich mass effect ist doch"}, {"id": 782, "start": 5353.3, "end": 5358.18, "text": "eigentlich fertig und okay wir sollen ein neues mass effect machen ja was machen wir"}, {"id": 783, "start": 5358.18, "end": 5387.34, "text": "dann egal fangt schon mal an kann nichts gescheites bei rauskommen"}, {"id": 784, "start": 5387.34, "end": 5414.86, "text": "aber wie gesagt"}, {"id": 785, "start": 5414.86, "end": 5419.54, "text": "das supporten von irgendwelchen indie games ist ja ist ja nicht ist ja nicht aus reiner"}, {"id": 786, "start": 5419.54, "end": 5426.38, "text": "nix in die bevor nie massive games in fact there may actually be no one with bad intentions"}, {"id": 787, "start": 5426.38, "end": 5431.14, "text": "i'm not going to say that that's true i will say it's possible but ultimately the point"}, {"id": 788, "start": 5431.14, "end": 5437.1, "text": "of the company like the point of all companies is to make money and if funding some small"}, {"id": 789, "start": 5437.1, "end": 5442.14, "text": "indie game now from a passion project indie developer who's got great ideas means they"}, {"id": 790, "start": 5442.14, "end": 5447.22, "text": "have some kind of contractual obligation from that indie developer as well as just some"}, {"id": 791, "start": 5447.22, "end": 5452.46, "text": "kind of ongoing business relationship with them well later whether anybody thought about"}, {"id": 792, "start": 5452.46, "end": 5458.3, "text": "it now or not who is now more likely to work with ea for ea developing things that make"}, {"id": 793, "start": 5458.3, "end": 5464.86, "text": "ea look maybe not terrible whether it's entirely philanthropic or not i don't really care"}, {"id": 794, "start": 5464.86, "end": 5470.54, "text": "it doesn't matter it absorbs these indie studios into the ea ecosystem which is ultimately"}, {"id": 795, "start": 5470.54, "end": 5475.14, "text": "going to result in a less good outcome than if they were just successful on their own"}, {"id": 796, "start": 5475.14, "end": 5480.38, "text": "are they necessarily guaranteed success if they don't sign with ea i don't know but i guarantee"}, {"id": 797, "start": 5480.38, "end": 5484.78, "text": "the case the ea presents them is that they probably don't have a lot of choice outside"}, {"id": 798, "start": 5484.78, "end": 5491.26, "text": "the ea ecosystem and all of this stuff all of the crap whether they do some good stuff"}, {"id": 799, "start": 5491.26, "end": 5497.26, "text": "behind closed doors release some good games all of the crap is just out there we see it"}, {"id": 800, "start": 5497.26, "end": 5502.94, "text": "all the time it's impossible not to think about it when they do something new and while some"}, {"id": 801, "start": 5502.94, "end": 5507.82, "text": "single individual may struggle with the external perception that they are just a bunch of bad"}, {"id": 802, "start": 5507.82, "end": 5514.3, "text": "guys es kann es kann ja auch durchaus sein dass dass er wirklich das gefühl hat dass das will"}, {"id": 803, "start": 5514.3, "end": 5517.5, "text": "ich das würde ich dem jetzt auch gar nicht absprechen wollen allerdings wenn man mal"}, {"id": 804, "start": 5517.5, "end": 5521.9, "text": "fünf minuten in sich geht sollte eigentlich jeder drauf kommen warum die leute was gegen"}, {"id": 805, "start": 5521.9, "end": 5527.18, "text": "ea haben single individual may struggle with the external perception that they are just a bunch of"}, {"id": 806, "start": 5527.18, "end": 5533.82, "text": "bad guys to just reiterate it doesn't really matter if the guys at ea are good or bad it matters"}, {"id": 807, "start": 5533.82, "end": 5540.06, "text": "what the company does and what this company has just repeatedly done to people is shown that it has"}, {"id": 808, "start": 5540.06, "end": 5547.58, "text": "no confidence no regard or even a lot of cases basic empathy towards its customers and even"}, {"id": 809, "start": 5547.58, "end": 5552.3, "text": "though they might be treating these indie devs and some employees well i don't know that i consider"}, {"id": 810, "start": 5552.3, "end": 5558.22, "text": "that to be like a valid case for them people like to try to compartmentalize problems like"}, {"id": 811, "start": 5558.22, "end": 5563.58, "text": "excessive crunch as of the specific developer like the fact bioware had excessive crunch"}, {"id": 812, "start": 5563.58, "end": 5568.86, "text": "for both anthem and mass effect andromeda somehow that's their problem and not the massive"}, {"id": 813, "start": 5568.86, "end": 5574.78, "text": "larger entity that owns them placing financial pressure on them to deliver so at this point"}, {"id": 814, "start": 5574.78, "end": 5581.1, "text": "there is no good reason not to understand why there's an external perception that they're a bunch of"}, {"id": 815, "start": 5581.1, "end": 5587.26, "text": "bad guys it's because people tend not to separate the individuals from the massive entity that is"}, {"id": 816, "start": 5587.26, "end": 5593.18, "text": "screwing them well i don't personally agree with it a lot of people attribute it to oh well if it's"}, {"id": 817, "start": 5593.18, "end": 5597.9, "text": "a bad company it must be bad people running it now i'm not saying it's good people running it but"}, {"id": 818, "start": 5597.9, "end": 5602.78, "text": "i'm saying i don't really make any assumptions because i know that the end goal of a company is to"}, {"id": 819, "start": 5602.78, "end": 5608.38, "text": "make money and and there's always a pressure to deliver growth in publicly traded companies which"}, {"id": 820, "start": 5608.38, "end": 5614.78, "text": "ea is the financial incentives will always cause the exact situation we're talking about good people"}, {"id": 821, "start": 5614.78, "end": 5620.14, "text": "are bad people at the helm so it really doesn't matter the kind of guys they have at the company"}, {"id": 822, "start": 5620.14, "end": 5637.02, "text": "what matters is what the company does and it is routinely negative so there you go"}, {"id": 823, "start": 5650.86, "end": 5659.26, "text": "angeguckt blizzard hat wow und wow macht geld wow macht richtig viel geld immer noch das schöne an"}, {"id": 824, "start": 5659.26, "end": 5666.82, "text": "wo ist dass es ein aber basiertes modelles das heißt das heißt das hat wenige wenige höhen und"}, {"id": 825, "start": 5666.82, "end": 5672.94, "text": "tiefen in dem sind es wird nicht so sein dass alle keine ahnung sagen wir mal 6 millionen wo aber"}, {"id": 826, "start": 5672.94, "end": 5677.5, "text": "sich hab keine ahnung wie viel es aktuell gibt sie veröffentlicht er keine zahlen mehr dass die"}, {"id": 827, "start": 5677.5, "end": 5684.1, "text": "die von einem oder anderen wegfallen. Dazu kommt, die haben auch noch ein paar andere große Sachen."}, {"id": 828, "start": 5684.1, "end": 5688.1, "text": "Blizzard hat ihr, ihr, ihr, ihr, ihr, ihr, ihr, ihr, ihr Dings, wie heißt sie heißt Hearthstone,"}, {"id": 829, "start": 5688.1, "end": 5693.64, "text": "die das Kartenspiel gedürnt. StarCraft ist mittlerweile nicht mal so angesagt. Sie haben"}, {"id": 830, "start": 5693.64, "end": 5698.94, "text": "Overwatch. Allerdings bild ich mir ein, dass wir, in diesem Financial Report gesehen haben,"}, {"id": 831, "start": 5698.94, "end": 5704.0, "text": "dass Overwatch an sich nicht so der Bringer ist. Die Overwatch League hält sich auch halbwegs"}, {"id": 832, "start": 5704.0, "end": 5709.2, "text": "in Grenzen. Ich denke mal hauptsächlich Geld wird Blizzard tatsächlich mit WoW und"}, {"id": 833, "start": 5710.4, "end": 5712.48, "text": "wahrscheinlich Hearthstone verdienen, würde ich jetzt mal"}, {"id": 834, "start": 5714.44, "end": 5716.44, "text": "Würde ich mal so vermuten."}, {"id": 835, "start": 5716.88, "end": 5724.8, "text": "Dazu kommt natürlich noch, wenn man, wenn man auch Activation mitnimmt, dass die ja noch was, was hat Activation? Großes Nebakot."}, {"id": 836, "start": 5724.8, "end": 5735.68, "text": "Aber was man nicht vergessen darf und was immer vergessen wird, ist, da wollte ich jetzt nämlich eigentlich drauf raus, dass bei Activation Blizzard"}, {"id": 837, "start": 5736.56, "end": 5741.76, "text": "auch noch Mobile Games mit dabei sind, weil Activation Blizzard setzt sich zusammen"}, {"id": 838, "start": 5743.68, "end": 5748.32, "text": "aus Blizzard, aus Activation oder aus King Games oder wie sie heißen."}, {"id": 839, "start": 5748.32, "end": 5753.84, "text": "Die da, gibt's nämlich auch noch, die machen auch einen großen Anteil da dran, weil das sind die Candy Crush Dudes."}, {"id": 840, "start": 5761.12, "end": 5764.32, "text": "Unter 1 Million Abos bei WoW, das kann ich mir kaum vorstellen."}, {"id": 841, "start": 5768.0, "end": 5770.0, "text": "So, na."}, {"id": 842, "start": 5770.8, "end": 5772.8, "text": "Das sind die mit so tollen Games wie"}, {"id": 843, "start": 5772.8, "end": 5780.32, "text": "Bubble Witch Saga, Candy Crush Saga, Pepper Panic Saga, die sind da auch am Start."}, {"id": 844, "start": 5783.52, "end": 5785.52, "text": "Und die machen mit Sicherheit auch viel Kohle."}, {"id": 845, "start": 5786.32, "end": 5790.4, "text": "Das sind die, das ist der Inbegriff von, von Casual"}, {"id": 846, "start": 5793.12, "end": 5795.12, "text": "Mobile Gaming Shit."}, {"id": 847, "start": 5795.12, "end": 5800.64, "text": "Casual Mobile Gaming Shit."}, {"id": 848, "start": 5811.6, "end": 5819.44, "text": "Aber das zeigt doch, warum Blizzard Diablo Immortal macht. Warum Blizzard Diablo Immortal macht, die Frage stellt sich mir gar nicht."}, {"id": 849, "start": 5819.44, "end": 5828.24, "text": "Ich finde, die Frage ist, also ich finde die Antwort ist relativ offensichtlich, weil Mobile Games Geld bringen."}, {"id": 850, "start": 5829.28, "end": 5839.84, "text": "Allerdings, das auf der BlizzCon anzukündigen, vor Diablo Fans, vor Hardcore Blizzard Fans, vor Hardcore Blizzard Diablo Fans,"}, {"id": 851, "start": 5841.36, "end": 5846.8, "text": "muss ich da mal überlegen, wer auf der BlizzCon ist. Auf der BlizzCon ist nicht der Candy Crush Spieler."}, {"id": 852, "start": 5846.8, "end": 5852.8, "text": "Auf der BlizzCon ist der Hardcore Blizzard Fan, der auf dem PC spielt. Zu 90 Prozent."}, {"id": 853, "start": 5854.32, "end": 5862.56, "text": "Und wenn du da einen Mobile Diablo ankündigst, obwohl sich die Leute seit Jahren schon wünschen, dass sich in dieser Marke noch ein bisschen was tut,"}, {"id": 854, "start": 5865.12, "end": 5871.6, "text": "da musst du dich nicht wundern, wenn das nach hinten losgeht. Warum Blizzard das macht, ist klar, weil man mit Mobile Games Geld verdienen kann."}, {"id": 855, "start": 5871.6, "end": 5878.64, "text": "Ob Diablo Mobile auch Scheiße wird oder nicht, kann man überhaupt nicht sagen. Es könnte tatsächlich ein gutes Game werden."}, {"id": 856, "start": 5879.52, "end": 5891.12, "text": "Aber das auf der BlizzCon als neues Diablo anzukündigen, vor einem Haufen PC-Spielender Diablo Blizzard Fans, ist schon ziemlich bescheuert gewesen."}, {"id": 857, "start": 5891.12, "end": 5903.36, "text": "Sie hätten das so machen müssen, wie bei Skyrim. Skyrim hat ja auch, also Dings, Persista und, wie heißt denn das Studio von Skyrim?"}, {"id": 858, "start": 5908.48, "end": 5914.16, "text": "Warum heißen die irgendwie speziell? Kann man den ganzen Kram immer aus dem Kopf nicht merken."}, {"id": 859, "start": 5914.16, "end": 5933.12, "text": "Ja, das ist er hier. Okay, Persista Game Studios, ja gut. Die haben das richtig gemacht. Die haben Skyrim Mobile angekündigt und haben danach den nicht sagensten Trailer für eine neues Main-Reihe Elder Scrolls aller Zeiten gezeigt."}, {"id": 860, "start": 5933.12, "end": 5949.92, "text": "Das war so ein nicht sagen Trailer. Was ist denn Elder Scrolls 6? War das? Genau das da. Das war so nicht sagen. So ein absolut nicht sagen Trailer."}, {"id": 861, "start": 5949.92, "end": 5965.68, "text": "Ich habe selten einen so nicht sagen Trailer gesehen, aber die haben es richtig gemacht. Die haben erst, die haben erst ihr... Moment, ist das überhaupt das Richtige?"}, {"id": 862, "start": 5965.68, "end": 5983.12, "text": "Ja doch, das ist das Richtige. Die haben erst ihr Mobile Game angekündigt und dann haben sie so hinten dran noch gesagt, wir sind dran zu spielern und dann haben sie gesagt, wir sind dran zu spielern und dann haben sie gesagt, wir sind dran zu spielern und dann haben sie gesagt, wir sind dran zu spielern."}, {"id": 863, "start": 5983.12, "end": 5987.12, "text": "Ja doch, das ist das Richtige, genau."}, {"id": 864, "start": 5987.12, "end": 5994.12, "text": "Ähm, die haben erst ihr Mobile Game angekündigt und dann haben sie so hinten dran noch gesagt,"}, {"id": 865, "start": 5994.12, "end": 5998.12, "text": "ja, wir sind dran an einem neuen Elder Scrolls."}, {"id": 866, "start": 5998.12, "end": 6000.12, "text": "Das hätte gereicht bei Blizzard auch."}, {"id": 867, "start": 6000.12, "end": 6005.12, "text": "Ich mein, jetzt ehrlich, als wäre das hier ein großer Aufwand für Blizzard gewesen,"}, {"id": 868, "start": 6005.12, "end": 6007.12, "text": "für Diablo so einen Trailer zu machen."}, {"id": 869, "start": 6007.12, "end": 6019.12, "text": "Jetzt, jetzt, an dieser Stelle ist der Elder Scroll Fans schon, der, der ist hier, der, der ist voll hier am Abgehen."}, {"id": 870, "start": 6019.12, "end": 6027.12, "text": "Sobald der Elder Scroll Fans das hier hört, da, da kann er sich nicht mehr halten."}, {"id": 871, "start": 6027.12, "end": 6036.12, "text": "So, das war's, mehr haben die nicht gezeigt."}, {"id": 872, "start": 6036.12, "end": 6039.12, "text": "Das war's, mehr haben die nicht gezeigt."}, {"id": 873, "start": 6039.12, "end": 6044.12, "text": "Und so hätte das Blizzard auch machen müssen mit, mit einem neuen Diablo."}, {"id": 874, "start": 6044.12, "end": 6049.12, "text": "Die hätten, die hätten ja ihr Mobile-Gedöns zeigen können, wäre vollkommen okay gewesen."}, {"id": 875, "start": 6049.12, "end": 6055.12, "text": "Und dann hätten sie dann drei, und mir kann doch keiner erzählen, dass das, guckt euch das an, das ist doch nicht aufwendig."}, {"id": 876, "start": 6055.12, "end": 6061.12, "text": "Das macht, das macht der Azubi in Blender in, in, in zwei Tagen macht er das."}, {"id": 877, "start": 6061.12, "end": 6070.12, "text": "Ich mein, was, the fuck, du kannst doch einfach eine alte, eine alte Worldmap nehmen, Ingame-Fly-Hack anmachen und fliegen."}, {"id": 878, "start": 6070.12, "end": 6074.12, "text": "Da ist nichts Aufwendiges dran."}, {"id": 879, "start": 6074.12, "end": 6085.12, "text": "Und das hätte Blizzard einfach für Diablo auch machen sollen."}, {"id": 880, "start": 6085.12, "end": 6099.12, "text": "Aber Blizzard will sich lieber doofe Fragen stellen lassen danach, ob man, ob man drauf antworten, ob man nicht auch Smartphones hat."}, {"id": 881, "start": 6099.12, "end": 6106.12, "text": "Ja."}, {"id": 882, "start": 6106.12, "end": 6109.12, "text": "Jumping from highest points in a Spider-Man-Game."}, {"id": 883, "start": 6109.12, "end": 6121.12, "text": "Was für Videos man hier so alles empfohlen kriegt."}, {"id": 884, "start": 6121.12, "end": 6136.12, "text": "Ah, Demo wie so ein VHS."}, {"id": 885, "start": 6136.12, "end": 6139.12, "text": "Du hast damals schon gecalled, dass Anthem crap wird."}, {"id": 886, "start": 6139.12, "end": 6153.12, "text": "Ich finde man hat Anthem schon seit dem ersten, seit dem ersten Reveal angesehen, dass es crap wird."}, {"id": 887, "start": 6153.12, "end": 6159.12, "text": "Geht um Battlefield 5."}, {"id": 888, "start": 6159.12, "end": 6171.12, "text": "Battlefield 5 is slowly dying."}, {"id": 889, "start": 6171.12, "end": 6173.12, "text": "Ja, der regt sich da drüber auf zurecht."}, {"id": 890, "start": 6173.12, "end": 6175.12, "text": "Battlefield 5 hat so voll verkackt."}, {"id": 891, "start": 6175.12, "end": 6177.12, "text": "Mein Chef auf der Arbeit."}, {"id": 892, "start": 6177.12, "end": 6180.12, "text": "Hab das ja schon ein paar mal erzählt, dass der, der spielt ja Battlefield."}, {"id": 893, "start": 6180.12, "end": 6184.12, "text": "Ich hab sogar noch ein Video von dem irgendwo, wo er, wo er Heli fliegt."}, {"id": 894, "start": 6184.12, "end": 6186.12, "text": "Jetzt müsste ich mal gucken, ob ich das noch finde."}, {"id": 895, "start": 6186.12, "end": 6189.12, "text": "Das ist aber noch zur Zeit, da war er noch gar nicht mein Chef."}, {"id": 896, "start": 6189.12, "end": 6190.12, "text": "Der spielt auch Battlefield."}, {"id": 897, "start": 6190.12, "end": 6197.12, "text": "Und ich würde schon sagen, dass er jetzt nicht da, da 24-7 Pro ist."}, {"id": 898, "start": 6197.12, "end": 6202.12, "text": "Ähm, eher, eher, eher der Casual-Spieler."}, {"id": 899, "start": 6202.12, "end": 6204.12, "text": "Und sogar der hat keinen Bock mehr auf Battlefield 5."}, {"id": 900, "start": 6204.12, "end": 6206.12, "text": "Der spielt, der spielt wieder Battlefield 1."}, {"id": 901, "start": 6206.12, "end": 6210.12, "text": "Oder Battlefield 4."}, {"id": 902, "start": 6210.12, "end": 6217.12, "text": "Ist ein Chef in deinem Alter ungefähr einen Ticken älter."}, {"id": 903, "start": 6217.12, "end": 6219.12, "text": "Hat auch keinen Bock mehr auf Battlefield 5."}, {"id": 904, "start": 6219.12, "end": 6222.12, "text": "Das heißt, selbst die guten Battlefield-Spieler haben keinen Bock auf Battlefield 5."}, {"id": 905, "start": 6222.12, "end": 6248.12, "text": "Und die Casuals haben auch keinen Bock mehr auf Battlefield 5."}, {"id": 906, "start": 6248.12, "end": 6251.12, "text": "Was? Gerücht um Diablo 4 Overwatch 2."}, {"id": 907, "start": 6251.12, "end": 6253.12, "text": "Ja, blablabla."}, {"id": 908, "start": 6253.12, "end": 6257.12, "text": "Ich glaube nicht, dass es in nächster Zeit einen Overwatch 2 gibt."}, {"id": 909, "start": 6257.12, "end": 6259.12, "text": "Ex-Mitarbeiter-Pakt aus."}, {"id": 910, "start": 6259.12, "end": 6278.12, "text": "Wahrscheinlich genauso seriös wie irgendwelche Fake-Trailer."}, {"id": 911, "start": 6278.12, "end": 6286.12, "text": "Glaubt ihr wirklich, dass die sowas in einen Overwatch 2 packen würden?"}, {"id": 912, "start": 6286.12, "end": 6292.12, "text": "Das klingt mir nicht nach einer Storyline, die da drinnen vorkommt."}, {"id": 913, "start": 6292.12, "end": 6307.12, "text": "Das klingt mir eher nach einer Fan-Fiction-Storyline."}, {"id": 914, "start": 6307.12, "end": 6309.12, "text": "Woa."}, {"id": 915, "start": 6309.12, "end": 6319.12, "text": "Das ist fast wie der Flöten-Typ von Ubisoft."}, {"id": 916, "start": 6319.12, "end": 6321.12, "text": "Das ist..."}, {"id": 917, "start": 6321.12, "end": 6323.12, "text": "Alter, das ist Typ..."}, {"id": 918, "start": 6323.12, "end": 6328.12, "text": "Was ein Bullshit, ey."}, {"id": 919, "start": 6328.12, "end": 6330.12, "text": "Das ist total beknackte."}, {"id": 920, "start": 6330.12, "end": 6338.12, "text": "Allein schon, dass der League mehr Story enthält und Overwatch ja nur wirklich keine Story-getriebene Spiele in dem Sinne hat."}, {"id": 921, "start": 6338.12, "end": 6346.12, "text": "Was ein Blödsinn, ey."}, {"id": 922, "start": 6346.12, "end": 6349.12, "text": "Nichts davon, wow."}, {"id": 923, "start": 6349.12, "end": 6352.12, "text": "Final Fantasy XIV darf in den Büros nicht mehr erwähnt werden."}, {"id": 924, "start": 6352.12, "end": 6355.12, "text": "Das könnte ich mir tatsächlich vorstellen, weil die haben das richtig gemacht."}, {"id": 925, "start": 6355.12, "end": 6358.12, "text": "Die haben die Kurve gekriegt von einem scheiß Lounge."}, {"id": 926, "start": 6358.12, "end": 6364.12, "text": "Also Final Fantasy Online, also Final Fantasy XIV, hatte wirklich einen richtigen Drecks-Lounge damals."}, {"id": 927, "start": 6364.12, "end": 6367.12, "text": "Das Game war auch in einem Zustand, es wollte kein Mensch spielen."}, {"id": 928, "start": 6367.12, "end": 6371.12, "text": "Danach haben sie es überarbeitet, nur in gut und relaunch und siehe da, ist mal gut."}, {"id": 929, "start": 6371.12, "end": 6378.12, "text": "Und die Leute haben es gespielt."}, {"id": 930, "start": 6378.12, "end": 6382.12, "text": "Wo steht das mit den eine Million Abos?"}, {"id": 931, "start": 6382.12, "end": 6384.12, "text": "Die Abo-Zahlen von Woa sind unter eine Million gefallen."}, {"id": 932, "start": 6384.12, "end": 6387.12, "text": "Das kann ich mir ehrlich gesagt nicht vorstellen."}, {"id": 933, "start": 6387.12, "end": 6389.12, "text": "Ich verfolge Woa nicht so genau."}, {"id": 934, "start": 6389.12, "end": 6392.12, "text": "Muss ich zugeben."}, {"id": 935, "start": 6392.12, "end": 6394.12, "text": "Aber ich halte das für zu schnell."}, {"id": 936, "start": 6394.12, "end": 6397.12, "text": "Wann kamen die letzten Woa-Zahlen raus? 2015?"}, {"id": 937, "start": 6397.12, "end": 6399.12, "text": "Mit irgendwie 6 Millionen?"}, {"id": 938, "start": 6399.12, "end": 6406.12, "text": "Du verlierst in der Zeit mit regelmäßigem Content, verlierst du nicht so viele Abos."}, {"id": 939, "start": 6406.12, "end": 6414.12, "text": "Wobei, man muss sagen, die hatten schon richtigen Crap-Content in Woa."}, {"id": 940, "start": 6414.12, "end": 6424.12, "text": "Nö, die veröffentlichen das nicht, da ist irgendetwas geraten, das ist Blödsinn."}, {"id": 941, "start": 6424.12, "end": 6427.12, "text": "Discord-PN, ok."}, {"id": 942, "start": 6427.12, "end": 6435.12, "text": "Sieh mal her."}, {"id": 943, "start": 6435.12, "end": 6441.12, "text": "Du hast mir nichts geschickt im Discord."}, {"id": 944, "start": 6441.12, "end": 6446.12, "text": "Weiß nicht, wie du mir was geschickt hast, aber mir nicht."}, {"id": 945, "start": 6446.12, "end": 6458.12, "text": "Nee, du hast mir nichts geschickt, sonst würd's hier stehen."}, {"id": 946, "start": 6458.12, "end": 6468.12, "text": "Ja, wenn Blizzard von Abo-Zahlen spricht, dann meinen die ja immer, aktive Abos nicht eingelogte Spieler oder so."}, {"id": 947, "start": 6468.12, "end": 6473.12, "text": "Ich hab dich nicht geändert, aber du kannst mir trotzdem ein PN schreiben."}, {"id": 948, "start": 6473.12, "end": 6476.12, "text": "Ansonsten schreibst du im Admin-Channel oder so."}, {"id": 949, "start": 6476.12, "end": 6499.12, "text": "Falls es jetzt wichtig ist, dass wir uns im Stream angucken."}, {"id": 950, "start": 6499.12, "end": 6503.12, "text": "Das da, der Sebaro, ey, guck mal hier."}, {"id": 951, "start": 6503.12, "end": 6514.12, "text": "Ich kriege Nitro gegiftet vom Sebaro."}, {"id": 952, "start": 6514.12, "end": 6520.12, "text": "Ultranis, gilt das jetzt auch für meinen Server global?"}, {"id": 953, "start": 6520.12, "end": 6527.12, "text": "Das heißt, ich kann jetzt im Discord, ich kann jetzt Dings hier machen."}, {"id": 954, "start": 6527.12, "end": 6532.12, "text": "Ich kann jetzt 0.3D machen."}, {"id": 955, "start": 6532.12, "end": 6538.12, "text": "Das ist huge."}, {"id": 956, "start": 6538.12, "end": 6548.12, "text": "Ja, dankeschön."}, {"id": 957, "start": 6548.12, "end": 6554.12, "text": "Aja ja."}, {"id": 958, "start": 6554.12, "end": 6560.12, "text": "Gibt's noch irgendwelche technischen Sachen, die ihr fragen wollt heute oder wissen wollt?"}, {"id": 959, "start": 6560.12, "end": 6565.12, "text": "Ein bisschen Technik, Geschwätze, Gelaber könnten wir heute noch machen."}, {"id": 960, "start": 6565.12, "end": 6574.12, "text": "Ansonsten würde ich mich jetzt nämlich vom Acker machen."}, {"id": 961, "start": 6574.12, "end": 6575.12, "text": "Windows 10 Design."}, {"id": 962, "start": 6575.12, "end": 6582.12, "text": "Ich weiß nicht, ob ich mich übers Windows 10 Design noch weiter auslassen will."}, {"id": 963, "start": 6582.12, "end": 6585.12, "text": "Ich hab mich schon oft übers Windows 10 Design ausgelassen."}, {"id": 964, "start": 6585.12, "end": 6593.12, "text": "Generell übers Windows Design, wie suboptimal ich das an vielen Stellen finde."}, {"id": 965, "start": 6593.12, "end": 6598.12, "text": "Eigentlich wollte ich heute gar kein Strembann machen."}, {"id": 966, "start": 6598.12, "end": 6607.12, "text": "Ich wollte heute eigentlich ein bisschen hier an der Heimautomatisierung basteln."}, {"id": 967, "start": 6607.12, "end": 6608.12, "text": "Oder irgendwas anderes machen."}, {"id": 968, "start": 6608.12, "end": 6613.12, "text": "Aber ich hab mich dann von Rechnergesetzen festgestellt, dass ich eigentlich auf nichts Bock hab."}, {"id": 969, "start": 6613.12, "end": 6619.12, "text": "Und dass ich jetzt eigentlich bloß mich von Rechner setzen will und nichts machen will."}, {"id": 970, "start": 6619.12, "end": 6627.12, "text": "Dann hab ich mir gedacht, eh, beim nichts machen kann ich auch Strembann machen."}, {"id": 971, "start": 6627.12, "end": 6635.12, "text": "T-Max Electronics fragt, warum eigentlich kein Node-RED für meine Heimautomatisierung?"}, {"id": 972, "start": 6635.12, "end": 6636.12, "text": "Das kann ich relativ einfach beantworten."}, {"id": 973, "start": 6636.12, "end": 6643.12, "text": "Allerdings, ich muss erstmal Node-RED zeigen für alle, die Node-RED nicht kennen."}, {"id": 974, "start": 6643.12, "end": 6645.12, "text": "Gibt's hier eine Demo?"}, {"id": 975, "start": 6645.12, "end": 6648.12, "text": "Gucken wir uns ein paar Bilder an."}, {"id": 976, "start": 6648.12, "end": 6656.12, "text": "Node-RED ist ein, nennen wir es mal ein Workflow-Tool, wo man sich..."}, {"id": 977, "start": 6656.12, "end": 6658.12, "text": "Ja, hier erkennt man es glaube ich ganz gut."}, {"id": 978, "start": 6658.12, "end": 6661.12, "text": "Wo man sich Regeln zusammenklicken kann."}, {"id": 979, "start": 6661.12, "end": 6665.12, "text": "Zum Beispiel könnte man sich mit Node-RED Regeln zusammenklicken."}, {"id": 980, "start": 6665.12, "end": 6669.12, "text": "Wenn man hier beispielsweise auch seine Heimautomatisierungs-Sachen drin hatte,"}, {"id": 981, "start": 6669.12, "end": 6672.12, "text": "könnte man sich eine Regel zusammenklicken."}, {"id": 982, "start": 6672.12, "end": 6675.12, "text": "Der Max ist auf dem Weg heim."}, {"id": 983, "start": 6675.12, "end": 6681.12, "text": "Wenn das der Fall ist und neuer als 5 Minuten, dann schaltet die Klimaanlage ein."}, {"id": 984, "start": 6681.12, "end": 6686.12, "text": "Also da kann man sich seine Automatisierung beispielsweise zusammenklicken."}, {"id": 985, "start": 6686.12, "end": 6692.12, "text": "Und ich verwende ja Home Assistant als Heimautomatisierungslösung."}, {"id": 986, "start": 6692.12, "end": 6696.12, "text": "Und da hast du drei Varianten, wie du deine Automatisierung machen kannst."}, {"id": 987, "start": 6696.12, "end": 6699.12, "text": "Über das Web-Interface zusammenklicken."}, {"id": 988, "start": 6699.12, "end": 6705.12, "text": "Oder aber in dem Home Assistant eigenen YAML-Dialekt schreiben."}, {"id": 989, "start": 6705.12, "end": 6709.12, "text": "Das ist so mehr oder weniger das Gleiche, weil das Web-Interface generiert YAML."}, {"id": 990, "start": 6709.12, "end": 6713.12, "text": "Oder man verwendet Node-RED mit dem Home Assistant-Plugin."}, {"id": 991, "start": 6713.12, "end": 6717.12, "text": "Oder man macht das, was ich mache für meine Automatisierung."}, {"id": 992, "start": 6717.12, "end": 6728.12, "text": "Man verwendet das Home Assistant-Python-Addon."}, {"id": 993, "start": 6728.12, "end": 6730.12, "text": "Ich weiß gerade nicht mehr, wie es heißt."}, {"id": 994, "start": 6730.12, "end": 6732.12, "text": "Appdemon verwendet man."}, {"id": 995, "start": 6732.12, "end": 6737.12, "text": "Da kann man nämlich seine komplette Logik und seine kompletten Automatisierungen"}, {"id": 996, "start": 6737.12, "end": 6740.12, "text": "anstatt in so einem eklichen YAML-Dialekt zu schreiben,"}, {"id": 997, "start": 6740.12, "end": 6744.12, "text": "einfach in stinknormalem Python-Code programmieren."}, {"id": 998, "start": 6744.12, "end": 6758.12, "text": "Und das fällt mir viel leichter, als in einem Web-Interface irgendwelche Logik zusammenzuklicken."}, {"id": 999, "start": 6758.12, "end": 6761.12, "text": "Ach, du hast ein Beispiel gepostet auf Twitter."}, {"id": 1000, "start": 6761.12, "end": 6768.12, "text": "Hab ich gar nicht gesehen, nach was..."}, {"id": 1001, "start": 6768.12, "end": 6770.12, "text": "Warum ist denn da meine Katze drin?"}, {"id": 1002, "start": 6770.12, "end": 6774.12, "text": "Wo habe ich denn meine Katze gefilmt?"}, {"id": 1003, "start": 6774.12, "end": 6778.12, "text": "Ach, das ist, wo sie unter dem Teppich versucht, irgendwas rauszuziehen."}, {"id": 1004, "start": 6778.12, "end": 6781.12, "text": "Ach, die ist doch niedlich, oder?"}, {"id": 1005, "start": 6781.12, "end": 6783.12, "text": "Also, die ist ein bisschen zu dick."}, {"id": 1006, "start": 6783.12, "end": 6789.12, "text": "Aber das macht sie dann eigentlich noch viel niedlicher."}, {"id": 1007, "start": 6789.12, "end": 6791.12, "text": "Meine Katze tritt die Mäuse auch."}, {"id": 1008, "start": 6791.12, "end": 6803.12, "text": "Meine Katze fängt Mäuse, nicht die tritt die Mäuse."}, {"id": 1009, "start": 6803.12, "end": 6817.12, "text": "Jetzt findet sie den Ball nicht mehr."}, {"id": 1010, "start": 6817.12, "end": 6822.12, "text": "Wie lange arbeitest du freitags eigentlich? Bis mittags oder wegen? Vier Tage bis nachmittags?"}, {"id": 1011, "start": 6822.12, "end": 6827.12, "text": "Meistens, meistens, entweder bis 13.30 oder bis 14.30, nur."}, {"id": 1012, "start": 6827.12, "end": 6833.12, "text": "Meistens 13.30. 13.30 bin ich freitags eigentlich auf dem Heimweg."}, {"id": 1013, "start": 6833.12, "end": 6835.12, "text": "Das funktioniert auch ganz gut."}, {"id": 1014, "start": 6835.12, "end": 6844.12, "text": "Ich meine, ich arbeite unter der Woche so von, ungefähr von 7 bis 15.30."}, {"id": 1015, "start": 6844.12, "end": 6850.12, "text": "Das sind ja acht Stunden, wenn du eine Pause abziehst."}, {"id": 1016, "start": 6850.12, "end": 6855.12, "text": "Ich mache es."}, {"id": 1017, "start": 6855.12, "end": 6859.12, "text": "Und ich habe ja nur 7,6 Stunden oder so am Tag."}, {"id": 1018, "start": 6859.12, "end": 6872.12, "text": "Dann passt das, dann kann ich Freitags 13.30 abhauen."}, {"id": 1019, "start": 6872.12, "end": 6877.12, "text": "Moin Wupplos und Chet, habt ihr schon mal gehört, dass im RZ die Server abspielen, weil die Kühlung zu schwach ist?"}, {"id": 1020, "start": 6877.12, "end": 6879.12, "text": "Nein."}, {"id": 1021, "start": 6879.12, "end": 6882.12, "text": "Das habe ich noch nie gehört."}, {"id": 1022, "start": 6882.12, "end": 6888.12, "text": "Die meisten Klimaanlagen im RZ laufen auch überhaupt nicht auf Anschlag."}, {"id": 1023, "start": 6888.12, "end": 6897.12, "text": "Der Trend ist mittlerweile eh, dass man versucht, nicht kühler zu machen als nötig."}, {"id": 1024, "start": 6897.12, "end": 6904.12, "text": "Da ist eigentlich immer noch Geserver da."}, {"id": 1025, "start": 6904.12, "end": 6908.12, "text": "Hallo Clocks HD."}, {"id": 1026, "start": 6908.12, "end": 6912.12, "text": "Macht es bei dir eigentlich in Frankfurt Sinn, mit dem Auto zur Arbeit zu fahren?"}, {"id": 1027, "start": 6912.12, "end": 6916.12, "text": "Weil du fährst laut deinen Tweets ja sehr oft mit den öffentlichen..."}, {"id": 1028, "start": 6916.12, "end": 6919.12, "text": "Ja und ne, man könnte das machen."}, {"id": 1029, "start": 6919.12, "end": 6925.12, "text": "Das Problem ist, du brauchst einen Parkplatz."}, {"id": 1030, "start": 6925.12, "end": 6928.12, "text": "Wir haben bei uns in der Firma keine Parkplätze in dem Sinn."}, {"id": 1031, "start": 6928.12, "end": 6934.12, "text": "Man müsste sich irgendwas, entweder man fährt ins Parkhaus, was ziemlich teuer ist, oder man mietet sich so einen Stellplatz."}, {"id": 1032, "start": 6934.12, "end": 6937.12, "text": "Es gibt manche Parkhäuser, wo manche Sachen liegen, da kann man sich so was mieten."}, {"id": 1033, "start": 6937.12, "end": 6942.12, "text": "Oder man parkt ein bisschen außerhalb, da muss man dann auch wieder eine halbe Stunde laufen."}, {"id": 1034, "start": 6942.12, "end": 6949.12, "text": "Alles in allem ist es, auch wenn einem die Bahn auf den Sack geht, immer noch angenehmer mit dem Zug zu fahren."}, {"id": 1035, "start": 6949.12, "end": 6955.12, "text": "Weil ich steige morgen direkt, also ich gehe aus der Haustür, steige direkt in den Zug ein, quasi."}, {"id": 1036, "start": 6955.12, "end": 6959.12, "text": "Ich bin ja quasi direkt in der Nähe vom Bahnhof."}, {"id": 1037, "start": 6959.12, "end": 6962.12, "text": "Steige in den Zug ein."}, {"id": 1038, "start": 6962.12, "end": 6965.12, "text": "Dann fährt das Ding 25 Minuten, eine halbe Stunde."}, {"id": 1039, "start": 6965.12, "end": 6969.12, "text": "Dann steige ich Frankfurt Süd aus."}, {"id": 1040, "start": 6969.12, "end": 6974.12, "text": "Und früher bin ich immer von Frankfurt Süd dann mit der U-Bahn noch gefahren, ein Stückchen weiter, zum Willy Brandplatz."}, {"id": 1041, "start": 6974.12, "end": 6981.12, "text": "Allerdings, mittlerweile laufe ich vom Südbahnhof, das dauert dann noch mal so 25 Minuten."}, {"id": 1042, "start": 6981.12, "end": 6988.12, "text": "Aber da hat man sich ein bisschen bewegt, weil ich habe gemerkt, dass, ich meine, ich bin jetzt ja auch 35."}, {"id": 1043, "start": 6988.12, "end": 6992.12, "text": "Also ich bin ein bisschen älter."}, {"id": 1044, "start": 6992.12, "end": 7002.12, "text": "Und, dass den ganzen Tag vom Rechnersetzen auf der Arbeit, plus dann noch irgendwie daheim am Rechner sitzen,"}, {"id": 1045, "start": 7002.12, "end": 7007.12, "text": "dass das auf Dauer alle möglichen Probleme macht."}, {"id": 1046, "start": 7007.12, "end": 7015.12, "text": "Führt hauptsächlich, also bei mir hat es hauptsächlich dazu geführt, dass ich nicht richtig pennen konnte."}, {"id": 1047, "start": 7015.12, "end": 7017.12, "text": "Das mir teilweise den Rücken wehgetan hat."}, {"id": 1048, "start": 7017.12, "end": 7019.12, "text": "Also das, was mir dann voll zu viel Rechnersetzen hat."}, {"id": 1049, "start": 7019.12, "end": 7029.12, "text": "Deswegen habe ich mir gedacht, ich laufe jetzt einfach morgens ein Stück und laufe mittags ein Stück."}, {"id": 1050, "start": 7029.12, "end": 7031.12, "text": "Und dann habe ich mich wenigstens ein bisschen bewegt."}, {"id": 1051, "start": 7031.12, "end": 7034.12, "text": "Aber das klappt eigentlich ganz gut."}, {"id": 1052, "start": 7034.12, "end": 7040.12, "text": "Ab und zu laufe ich sogar noch, wenn ich heimkomme."}, {"id": 1053, "start": 7040.12, "end": 7046.12, "text": "Ja, dann geht das eigentlich halbwegs."}, {"id": 1054, "start": 7046.12, "end": 7049.12, "text": "Welche Stühle habt ihr bei euch auf der Arbeit genommen?"}, {"id": 1055, "start": 7049.12, "end": 7052.12, "text": "Ergonomische? Ja, die neuen Stühle gefallen mir ehrlich gesagt nicht so gut."}, {"id": 1056, "start": 7052.12, "end": 7057.12, "text": "Aber die alten Stühle waren sehr nice, die wir hatten."}, {"id": 1057, "start": 7057.12, "end": 7060.12, "text": "Deswegen habe ich mir den gleichen Stuhl für daheim geholt."}, {"id": 1058, "start": 7060.12, "end": 7063.12, "text": "Das ist ein..."}, {"id": 1059, "start": 7063.12, "end": 7064.12, "text": "Wie ist der?"}, {"id": 1060, "start": 7064.12, "end": 7067.12, "text": "Sedus Mr.24."}, {"id": 1061, "start": 7067.12, "end": 7072.12, "text": "Aber sogar glaube ich ein Link."}, {"id": 1062, "start": 7072.12, "end": 7077.12, "text": "Den gleichen, den der Krieger lustigerweise auch hat."}, {"id": 1063, "start": 7077.12, "end": 7079.12, "text": "Den da."}, {"id": 1064, "start": 7079.12, "end": 7082.12, "text": "Ich habe ihn in der Farbe."}, {"id": 1065, "start": 7082.12, "end": 7086.12, "text": "Das ist der beste Stuhl, den es gibt."}, {"id": 1066, "start": 7086.12, "end": 7089.12, "text": "Es gibt keinen besseren Stuhl."}, {"id": 1067, "start": 7089.12, "end": 7091.12, "text": "Ich mache dazu keinen Reflink."}, {"id": 1068, "start": 7091.12, "end": 7094.12, "text": "Und ich empfehle auch keinem, sich den zu kaufen."}, {"id": 1069, "start": 7094.12, "end": 7098.12, "text": "Ach so doch, wir haben ja dazu sogar einen Reflink."}, {"id": 1070, "start": 7098.12, "end": 7100.12, "text": "Wir haben ja sogar fast einen Reflink."}, {"id": 1071, "start": 7100.12, "end": 7108.12, "text": "Also es ist tatsächlich der beste Stuhl, den man sich wünschen kann im Endeffekt."}, {"id": 1072, "start": 7108.12, "end": 7113.12, "text": "Allerdings empfehle ich keinem, sich zu kaufen, weil er ist einfach viel zu teuer."}, {"id": 1073, "start": 7113.12, "end": 7122.12, "text": "Ich hätte mir den auch nicht gekauft, wenn ich quasi den vollen Preis hätte bezahlen müssen."}, {"id": 1074, "start": 7122.12, "end": 7125.12, "text": "Ich habe den gekriegt in irgendeinem Shop."}, {"id": 1075, "start": 7125.12, "end": 7128.12, "text": "Der hat anscheinend gerade seinen ganzen Kram verkauft."}, {"id": 1076, "start": 7128.12, "end": 7131.12, "text": "Da hat er ungefähr 60% vom normalen Preis gekostet."}, {"id": 1077, "start": 7131.12, "end": 7136.12, "text": "Ich meine, das ist immer noch verdammt viel Geld für einen Stuhl."}, {"id": 1078, "start": 7136.12, "end": 7139.12, "text": "Aber der Stuhl ist extrem gut."}, {"id": 1079, "start": 7139.12, "end": 7145.12, "text": "Den habe ich jetzt auch schon ein paar Jahre. Der macht überhaupt keine Anstalten."}, {"id": 1080, "start": 7145.12, "end": 7148.12, "text": "Der ist wie neu."}, {"id": 1081, "start": 7157.12, "end": 7161.12, "text": "Also wenn man viel vorm Rechner sitzt, ist es eine Überlegung wert."}, {"id": 1082, "start": 7161.12, "end": 7166.12, "text": "Allerdings kann es keinem empfehlen, weil es ist einfach zu teuer."}, {"id": 1083, "start": 7166.12, "end": 7170.12, "text": "Mal schauen, was es bei AliExpress gibt."}, {"id": 1084, "start": 7170.12, "end": 7172.12, "text": "Kennst du Hermann Miller?"}, {"id": 1085, "start": 7172.12, "end": 7174.12, "text": "Er sagt mir irgendwas."}, {"id": 1086, "start": 7174.12, "end": 7197.12, "text": "Ich könnte mir sogar... Ist das nicht so ein Stuhldesigner-Typ?"}, {"id": 1087, "start": 7204.12, "end": 7212.12, "text": "Was?"}, {"id": 1088, "start": 7212.12, "end": 7225.12, "text": "Der sieht mir schon viel zu fancy-designed irgendwie aus."}, {"id": 1089, "start": 7225.12, "end": 7230.12, "text": "Das ist für die Leute, wo der Bauch nicht nur nach da geht, sondern auch schon so in die Seite,"}, {"id": 1090, "start": 7230.12, "end": 7235.12, "text": "dass du die Lehne nicht mehr abspringst."}, {"id": 1091, "start": 7235.12, "end": 7237.12, "text": "So schlimm ist es bei mir zum Glück nicht."}, {"id": 1092, "start": 7237.12, "end": 7238.12, "text": "Kostet was?"}, {"id": 1093, "start": 7238.12, "end": 7245.12, "text": "Kostet ungefähr das Gleiche."}, {"id": 1094, "start": 7245.12, "end": 7248.12, "text": "Also ich würde mir meinen Stuhl auf jeden Fall wiederholen."}, {"id": 1095, "start": 7248.12, "end": 7254.12, "text": "Das ist der beste Stuhl, den es gibt."}, {"id": 1096, "start": 7254.12, "end": 7261.12, "text": "Ganz witzig ist, wir hatten mal vor Ewigkeit einen Kollegen auf der Arbeit, der hat es geschafft,"}, {"id": 1097, "start": 7261.12, "end": 7271.12, "text": "also der war sehr füllig, der hat es geschafft, bei seinem Stuhl die Armlehnen abzusprengen."}, {"id": 1098, "start": 7271.12, "end": 7275.12, "text": "Das war halt nicht so ein Stuhl, das war halt ein normaler Bürostuhl."}, {"id": 1099, "start": 7275.12, "end": 7281.12, "text": "Und das Stuhl, wo der drauf gesessen hat, hat immer die Armlehnen nach unten gehangen,"}, {"id": 1100, "start": 7281.12, "end": 7291.12, "text": "weil die waren halt rausgesprengt aus dem Rahmen."}, {"id": 1101, "start": 7291.12, "end": 7298.12, "text": "Das war auch hart."}, {"id": 1102, "start": 7298.12, "end": 7301.12, "text": "Übrigens Leute, wisst ihr, dass man sowas heute gar nicht mehr sagen darf,"}, {"id": 1103, "start": 7301.12, "end": 7306.12, "text": "das grenzt schon fast an Fatshaming und Hatespeech wieder."}, {"id": 1104, "start": 7306.12, "end": 7312.12, "text": "Wobei ich das eigentlich sagen darf, ich bin ja selbst nicht der aller Dünste."}, {"id": 1105, "start": 7312.12, "end": 7319.12, "text": "Allerdings davon bin ich noch ein Stückchen entfernt."}, {"id": 1106, "start": 7319.12, "end": 7324.12, "text": "Hexo, ihr habt auch die Mr.24 Stühle, die sind super."}, {"id": 1107, "start": 7324.12, "end": 7327.12, "text": "Die sind top."}, {"id": 1108, "start": 7327.12, "end": 7332.12, "text": "Ein Stuhl für 1,95 Euro inklusive Versand auf Aliexpress."}, {"id": 1109, "start": 7332.12, "end": 7340.12, "text": "Zeig mal, schick mal Link."}, {"id": 1110, "start": 7340.12, "end": 7345.12, "text": "Also ich denke, wenn man schon so viel Bauch hat,"}, {"id": 1111, "start": 7345.12, "end": 7352.12, "text": "dass man nicht mehr gerade in die Toilette rein kann, dann ist zu viel."}, {"id": 1112, "start": 7352.12, "end": 7356.12, "text": "Wenn man sich quasi umdrehen muss und rückwärts in die Toilette einparken muss,"}, {"id": 1113, "start": 7356.12, "end": 7359.12, "text": "dann ist zu viel."}, {"id": 1114, "start": 7359.12, "end": 7366.12, "text": "Da ist alles vorbei."}, {"id": 1115, "start": 7366.12, "end": 7371.12, "text": "Ich habe es euch erzählt, ich habe jetzt fast 8 Kilo abgenommen."}, {"id": 1116, "start": 7371.12, "end": 7375.12, "text": "Einfach, durch, wer hätte das gedacht, weniger essen."}, {"id": 1117, "start": 7375.12, "end": 7377.12, "text": "Das habe ich schon vor zwei Wochen erzählt oder so,"}, {"id": 1118, "start": 7377.12, "end": 7379.12, "text": "aber es ist jetzt auch nicht mal weniger geworden."}, {"id": 1119, "start": 7379.12, "end": 7381.12, "text": "Das wird sich jetzt auch so ein bisschen halten."}, {"id": 1120, "start": 7381.12, "end": 7388.12, "text": "Übrigens hier, guck mal, Aliexpress Stuhl."}, {"id": 1121, "start": 7388.12, "end": 7396.12, "text": "Aliexpress Stuhl für 1,95 Euro inklusive Versand."}, {"id": 1122, "start": 7396.12, "end": 7401.12, "text": "Huge."}, {"id": 1123, "start": 7401.12, "end": 7403.12, "text": "Gelber Stuhl bei Aliexpress."}, {"id": 1124, "start": 7403.12, "end": 7410.12, "text": "Ich will nicht wissen, was in diesem Polster drin ist."}, {"id": 1125, "start": 7410.12, "end": 7414.12, "text": "Also erstens ist er wahrscheinlich in Kinderarbeit hergestellt."}, {"id": 1126, "start": 7414.12, "end": 7419.12, "text": "Und zweitens ist wahrscheinlich in diesem Polster der Materialabfall"}, {"id": 1127, "start": 7419.12, "end": 7422.12, "text": "von der 3D-Drucker-Herstellung oder sowas drin."}, {"id": 1128, "start": 7422.12, "end": 7427.12, "text": "Ich meine, das sieht schon billig aus auf dem Bild hier."}, {"id": 1129, "start": 7427.12, "end": 7433.12, "text": "Ich würde das zu gerne einfach mal bestellen,"}, {"id": 1130, "start": 7433.12, "end": 7437.12, "text": "um zu gucken, was da wirklich ankommt."}, {"id": 1131, "start": 7437.12, "end": 7440.12, "text": "Einfach nur gucken, was da ankommt."}, {"id": 1132, "start": 7440.12, "end": 7448.12, "text": "Was ist das für ein hässlicher Stuhl hier neben?"}, {"id": 1133, "start": 7448.12, "end": 7451.12, "text": "Hallo, das habe ich nicht ausgewählt."}, {"id": 1134, "start": 7451.12, "end": 7455.12, "text": "Was ist das für ein hässlicher Stuhl?"}, {"id": 1135, "start": 7455.12, "end": 7462.12, "text": "Stretchstuhl."}, {"id": 1136, "start": 7462.12, "end": 7465.12, "text": "Das ist aber geil, oder?"}, {"id": 1137, "start": 7465.12, "end": 7469.12, "text": "Wie groß ist der? Eine gute Frage."}, {"id": 1138, "start": 7469.12, "end": 7473.12, "text": "Manuelle Messung. Es wird ein Fehler von ca. 1 cm."}, {"id": 1139, "start": 7473.12, "end": 7476.12, "text": "Und manchmal die Farbe vielleicht haben weniger Fehler."}, {"id": 1140, "start": 7476.12, "end": 7479.12, "text": "Oh, verstehe. Ich hoffe, Sie verstehen können."}, {"id": 1141, "start": 7479.12, "end": 7482.12, "text": "Danke im Voraus."}, {"id": 1142, "start": 7482.12, "end": 7485.12, "text": "Ich kann nur schwer verstehen, ehrlich gesagt."}, {"id": 1143, "start": 7485.12, "end": 7489.12, "text": "Ich glaube, er möchte uns mitteilen, dass das, was hier steht,"}, {"id": 1144, "start": 7489.12, "end": 7494.12, "text": "nicht unbedingt zutreffen muss, dass es abweichen kann"}, {"id": 1145, "start": 7494.12, "end": 7500.12, "text": "um bis zu 1 cm."}, {"id": 1146, "start": 7500.12, "end": 7503.12, "text": "Wie wäre es mit Höhe?"}, {"id": 1147, "start": 7503.12, "end": 7506.12, "text": "Also D ist was? 42 cm."}, {"id": 1148, "start": 7506.12, "end": 7509.12, "text": "Also dann ist der Stuhl irgendwie 80 cm oder so."}, {"id": 1149, "start": 7509.12, "end": 7515.12, "text": "Insgesamt hoch, ungefähr."}, {"id": 1150, "start": 7515.12, "end": 7521.12, "text": "Es scheint ein ganz normaler Stuhl zu sein."}, {"id": 1151, "start": 7521.12, "end": 7526.12, "text": "Aber Qualität genial."}, {"id": 1152, "start": 7526.12, "end": 7528.12, "text": "Ich bin sehr zufrieden."}, {"id": 1153, "start": 7528.12, "end": 7531.12, "text": "Die Qualität ist bestimmt absolut genial"}, {"id": 1154, "start": 7531.12, "end": 7536.12, "text": "bei dem 1,95 Euro Stuhl."}, {"id": 1155, "start": 7536.12, "end": 7541.12, "text": "Bestimmt die beste Qualität überhaupt."}, {"id": 1156, "start": 7541.12, "end": 7545.12, "text": "Oh, der ist gerade reduziert."}, {"id": 1157, "start": 7545.12, "end": 7550.12, "text": "Ja, guck mal. Normalerweise kostet er ja unglaubliche Wuche."}, {"id": 1158, "start": 7550.12, "end": 7553.12, "text": "4 Euro kostet er normalerweise."}, {"id": 1159, "start": 7553.12, "end": 7556.12, "text": "Das ist ja voll übertrieben."}, {"id": 1160, "start": 7556.12, "end": 7558.12, "text": "4 Euro für einen Stuhl."}, {"id": 1161, "start": 7558.12, "end": 7560.12, "text": "Wer gibt 4 Euro für einen Stuhl aus?"}, {"id": 1162, "start": 7560.12, "end": 7562.12, "text": "Näh."}, {"id": 1163, "start": 7562.12, "end": 7568.12, "text": "Also 1,60 Euro lasse ich mit mir reden, aber für 4 Euro nicht."}, {"id": 1164, "start": 7568.12, "end": 7575.12, "text": "Ach, bei dem anderen geht es so um die Abdeckung."}, {"id": 1165, "start": 7575.12, "end": 7577.12, "text": "Ach, das ist nur die Abdeckung."}, {"id": 1166, "start": 7577.12, "end": 7580.12, "text": "Das ist gar nicht der Stuhl."}, {"id": 1167, "start": 7580.12, "end": 7590.12, "text": "Lol, she baited."}, {"id": 1168, "start": 7590.12, "end": 7595.12, "text": "Da steht es."}, {"id": 1169, "start": 7595.12, "end": 7600.12, "text": "Das ist nur die Abdeckung."}, {"id": 1170, "start": 7600.12, "end": 7603.12, "text": "Geil."}, {"id": 1171, "start": 7603.12, "end": 7617.12, "text": "Ja, dieses hässliche Ding hier darüber."}, {"id": 1172, "start": 7617.12, "end": 7620.12, "text": "Okay, ja, das ergibt ein bisschen mehr Sinn."}, {"id": 1173, "start": 7620.12, "end": 7623.12, "text": "Weil ich wollte gerade sagen, so 1,60 Euro für einen Stuhl"}, {"id": 1174, "start": 7623.12, "end": 7630.12, "text": "ist schon verdammt wenig."}, {"id": 1175, "start": 7630.12, "end": 7632.12, "text": "Das ist übrigens auch was, was ich gerne in Videos machen würde."}, {"id": 1176, "start": 7632.12, "end": 7638.12, "text": "Ich bestelle ja mittlerweile relativ viel China-Kram und generell online viel."}, {"id": 1177, "start": 7638.12, "end": 7642.12, "text": "Das hatte ich eh vor, dass ich ab und zu mal ein Video mache."}, {"id": 1178, "start": 7642.12, "end": 7644.12, "text": "Also wenn ich dann wirklich mal wieder Videos mache"}, {"id": 1179, "start": 7644.12, "end": 7646.12, "text": "und auch ein bisschen mehr Technik-Videos mache,"}, {"id": 1180, "start": 7646.12, "end": 7649.12, "text": "wo ich einfach mal so die neuesten Sachen,"}, {"id": 1181, "start": 7649.12, "end": 7653.12, "text": "die neuesten interessanten Sachen zeige, die ich gekauft habe."}, {"id": 1182, "start": 7653.12, "end": 7656.12, "text": "Zum Beispiel die China-Steckdosenleiste, die man flashen kann."}, {"id": 1183, "start": 7656.12, "end": 7660.12, "text": "Oder den 50er-Pack USB-Kabel, die übrigens immer noch nicht da sind."}, {"id": 1184, "start": 7660.12, "end": 7662.12, "text": "Nur mal angemerkt."}, {"id": 1185, "start": 7662.12, "end": 7669.12, "text": "Und ich frage mich, ob es wirklich jetzt ein 200er-Pack oder echt nur der 50er-Pack ist."}, {"id": 1186, "start": 7669.12, "end": 7674.12, "text": "Ich meine, ich habe nur einen 50er-Pack bestellt."}, {"id": 1187, "start": 7674.12, "end": 7687.12, "text": "Aber man weiß ja nie, ne?"}, {"id": 1188, "start": 7687.12, "end": 7690.12, "text": "Der Sebaro hat einen Stuhl für 9 Dollar gefunden."}, {"id": 1189, "start": 7690.12, "end": 7702.12, "text": "Ja, 9 Dollar lasse ich mir so einen billigen Holzstuhl-Lock gefallen."}, {"id": 1190, "start": 7702.12, "end": 7706.12, "text": "Einfach eine Kamera an die Decke hängen und mit der Elgato captchern."}, {"id": 1191, "start": 7706.12, "end": 7708.12, "text": "Ja, könnte man machen."}, {"id": 1192, "start": 7708.12, "end": 7712.12, "text": "Da brauche ich ein bisschen ordentliche Beleuchtung."}, {"id": 1193, "start": 7712.12, "end": 7719.12, "text": "Ja, habe ich ja da, müsst ihr halt mal rüber holen."}, {"id": 1194, "start": 7719.12, "end": 7723.12, "text": "Findest du, dass Made in China mittlerweile einen besseren Status haben sollte,"}, {"id": 1195, "start": 7723.12, "end": 7726.12, "text": "als der traditionell hat?"}, {"id": 1196, "start": 7726.12, "end": 7731.12, "text": "Made in China oder generell, das ist halt sehr gemischt, ne?"}, {"id": 1197, "start": 7731.12, "end": 7736.12, "text": "Du kannst den Ultra-Crab aus China bestellen."}, {"id": 1198, "start": 7736.12, "end": 7738.12, "text": "Und du kannst gutes Zeug aus China bestellen."}, {"id": 1199, "start": 7738.12, "end": 7742.12, "text": "Allerdings, es ist im Prinzip ein bisschen wie hier."}, {"id": 1200, "start": 7742.12, "end": 7745.12, "text": "Die billigen Sachen sind meistens Crab"}, {"id": 1201, "start": 7745.12, "end": 7748.12, "text": "und die teuren Sachen haben zumindest das Potenzial gut zu sein."}, {"id": 1202, "start": 7748.12, "end": 7752.12, "text": "Also ich finde schon, dass Made in China oder generell China-Produkte"}, {"id": 1203, "start": 7752.12, "end": 7756.12, "text": "teilweise zu unrechtend schlechten Ruf haben."}, {"id": 1204, "start": 7756.12, "end": 7759.12, "text": "Zum Beispiel den Staubsauger-Roboter, den ich mir gekauft habe."}, {"id": 1205, "start": 7759.12, "end": 7766.12, "text": "Der ist besser als das, was du hier kriegst für einen unschlagbaren Preis."}, {"id": 1206, "start": 7766.12, "end": 7769.12, "text": "Wenn er im Angebot ist, wohlgemerkt."}, {"id": 1207, "start": 7769.12, "end": 7777.12, "text": "Sind die China-Sachen aber laufend irgendwo."}, {"id": 1208, "start": 7777.12, "end": 7779.12, "text": "Ja, und der Eiskäuter hat Recht."}, {"id": 1209, "start": 7779.12, "end": 7782.12, "text": "Wenn es um Elektronik-Teile geht,"}, {"id": 1210, "start": 7782.12, "end": 7786.12, "text": "dann kann man die bedenkenlos aus China bestellen,"}, {"id": 1211, "start": 7786.12, "end": 7791.12, "text": "weil die Teile an sich sind entweder nachgebaut,"}, {"id": 1212, "start": 7791.12, "end": 7794.12, "text": "aber bei einzelnen Elektronik-Teilen ist das nicht so wild."}, {"id": 1213, "start": 7794.12, "end": 7797.12, "text": "Entweder machen sie das, wofür sie da sind, oder sie machen das nicht."}, {"id": 1214, "start": 7797.12, "end": 7800.12, "text": "Oder es ist exakt der gleiche Kram."}, {"id": 1215, "start": 7800.12, "end": 7803.12, "text": "Ob du jetzt einen Widerstand holst von hier"}, {"id": 1216, "start": 7803.12, "end": 7816.12, "text": "oder eine Kiste mit Widerstand aus China bestellst, ist wurscht."}, {"id": 1217, "start": 7816.12, "end": 7821.12, "text": "Du kannst mit China-Zeug schon ganz schön gescampt werden."}, {"id": 1218, "start": 7821.12, "end": 7823.12, "text": "Ich würde mir beispielsweise keine Grafikkarte aus China kaufen"}, {"id": 1219, "start": 7823.12, "end": 7825.12, "text": "und auch keine CPU aus AliExpress,"}, {"id": 1220, "start": 7825.12, "end": 7828.12, "text": "weil die sind ja bekannt dafür, dass sie beispielsweise"}, {"id": 1221, "start": 7828.12, "end": 7831.12, "text": "alte Nvidia-Karten nehmen und quasi nur das BIOS flashen"}, {"id": 1222, "start": 7831.12, "end": 7834.12, "text": "und sie dann als was Neues verkaufen."}, {"id": 1223, "start": 7834.12, "end": 7837.12, "text": "Oder dass sie, also man muss aber schon sagen,"}, {"id": 1224, "start": 7837.12, "end": 7839.12, "text": "die Chinesen sind echt erfinderisch."}, {"id": 1225, "start": 7839.12, "end": 7844.12, "text": "Die haben hier Intel-CPUs."}, {"id": 1226, "start": 7844.12, "end": 7849.12, "text": "Das sind tatsächlich echte Intel-CPUs, allerdings"}, {"id": 1227, "start": 7849.12, "end": 7853.12, "text": "sind das alte Notebook-CPUs,"}, {"id": 1228, "start": 7853.12, "end": 7862.12, "text": "die sie quasi an einem Desktopsocket dran gepappt haben."}, {"id": 1229, "start": 7862.12, "end": 7864.12, "text": "Ich sehe jetzt hier keinen."}, {"id": 1230, "start": 7864.12, "end": 7872.12, "text": "Aber die Chinesen sind da echt erfinderisch, was das angeht."}, {"id": 1231, "start": 7872.12, "end": 7877.12, "text": "Also das würde ich mir nicht unbedingt kaufen."}, {"id": 1232, "start": 7877.12, "end": 7882.12, "text": "Ein Elektronik-Teil auf jeden Fall."}, {"id": 1233, "start": 7882.12, "end": 7883.12, "text": "Bring dir dieselbe Leistung."}, {"id": 1234, "start": 7883.12, "end": 7888.12, "text": "Ja, dieselbe Leistung, wie sie in dem Notebook auch gebracht haben."}, {"id": 1235, "start": 7888.12, "end": 7892.12, "text": "Call to do in 2K19 in China."}, {"id": 1236, "start": 7892.12, "end": 7897.12, "text": "Du kriegst bei AliExpress mehr oder weniger alles."}, {"id": 1237, "start": 7897.12, "end": 7901.12, "text": "Es gibt nichts, was du nicht auf AliExpress kriegst."}, {"id": 1238, "start": 7901.12, "end": 7906.12, "text": "Also nichts, was halbwegs üblich ist."}, {"id": 1239, "start": 7906.12, "end": 7912.12, "text": "Du kriegst alles auf AliExpress, alles."}, {"id": 1240, "start": 7912.12, "end": 7917.12, "text": "Außer Essen."}, {"id": 1241, "start": 7917.12, "end": 7919.12, "text": "Oder haben die auch Food?"}, {"id": 1242, "start": 7919.12, "end": 7921.12, "text": "Nee, haben sie nicht."}, {"id": 1243, "start": 7921.12, "end": 7925.12, "text": "Doch, Sebaro, klar, gibt es auch."}, {"id": 1244, "start": 7925.12, "end": 7930.12, "text": "Gibt alles."}, {"id": 1245, "start": 7930.12, "end": 7934.12, "text": "Gibt mehr als bei Amazon, es gibt alles bei AliExpress."}, {"id": 1246, "start": 7934.12, "end": 7943.12, "text": "Es gibt für Sebaro wahrscheinlich sogar Waifu-Pillows."}, {"id": 1247, "start": 7943.12, "end": 7947.12, "text": "Bam, Waifu-Pillows für Sebaro."}, {"id": 1248, "start": 7947.12, "end": 7954.12, "text": "Die gibt es alles, alles auf AliExpress."}, {"id": 1249, "start": 7954.12, "end": 7957.12, "text": "Falls das was üblich ist."}, {"id": 1250, "start": 7957.12, "end": 7960.12, "text": "Nix Monkathos war alles angezogen."}, {"id": 1251, "start": 7960.12, "end": 7962.12, "text": "Nachtbot, abonniert auf Stufe 1."}, {"id": 1252, "start": 7962.12, "end": 7977.12, "text": "Danke schön."}, {"id": 1253, "start": 7977.12, "end": 7979.12, "text": "Ja, Eiskräuter ist so."}, {"id": 1254, "start": 7979.12, "end": 7981.12, "text": "Ich kaufe den ganzen Sensor-Kram auch noch in China."}, {"id": 1255, "start": 7981.12, "end": 7986.12, "text": "Man muss halt manchmal ein bisschen warten."}, {"id": 1256, "start": 7986.12, "end": 7992.12, "text": "Aber am besten ist, man bestellt sich halt dann ordentliche Mengen auch aus China."}, {"id": 1257, "start": 7992.12, "end": 7994.12, "text": "Also nicht irgendwie ein Sensor und losschicken."}, {"id": 1258, "start": 7994.12, "end": 7997.12, "text": "Nee, man bestellt sich alle möglichen Sensoren, die man braucht."}, {"id": 1259, "start": 7997.12, "end": 7999.12, "text": "Am besten natürlich beim gleichen Shop."}, {"id": 1260, "start": 7999.12, "end": 8002.12, "text": "Wie gesagt, AliExpress ist ja nicht so wie Amazon."}, {"id": 1261, "start": 8002.12, "end": 8005.12, "text": "Sondern AliExpress ist eher wie Amazon Marketplace."}, {"id": 1262, "start": 8005.12, "end": 8013.12, "text": "Und dann bestellt man sich halt von jedem Sensor 10 Stück."}, {"id": 1263, "start": 8013.12, "end": 8015.12, "text": "Und dann halt alle möglichen Sensoren, die man braucht."}, {"id": 1264, "start": 8015.12, "end": 8024.12, "text": "Da lohnt es sich auch da was einzukaufen."}, {"id": 1265, "start": 8024.12, "end": 8026.12, "text": "Wenn ich sage, will ich ein vierfaches Naiso reroll."}, {"id": 1266, "start": 8026.12, "end": 8029.12, "text": "Ja, dann musst du erst mal suppen."}, {"id": 1267, "start": 8029.12, "end": 8036.12, "text": "Sobald du suppst, dann können wir uns da drüber unterhalten."}, {"id": 1268, "start": 8036.12, "end": 8038.12, "text": "Twitch Prime ist auch okay."}, {"id": 1269, "start": 8038.12, "end": 8043.12, "text": "Sagt keiner, was ging."}, {"id": 1270, "start": 8043.12, "end": 8047.12, "text": "Für mich zählt Twitch Prime genauso."}, {"id": 1271, "start": 8047.12, "end": 8053.12, "text": "Wir diskriminieren hier keine Twitch Prime Benutzer."}, {"id": 1272, "start": 8053.12, "end": 8058.12, "text": "Hattest du eigentlich schon mal Probleme mit Zoll wegen AliExpress?"}, {"id": 1273, "start": 8058.12, "end": 8059.12, "text": "Nee."}, {"id": 1274, "start": 8059.12, "end": 8065.12, "text": "Ich hatte bisher nur Probleme mit Zoll, wenn ich quasi ganz korrekt"}, {"id": 1275, "start": 8065.12, "end": 8067.12, "text": "beispielsweise aus den USA bestellt habe."}, {"id": 1276, "start": 8067.12, "end": 8071.12, "text": "Also so richtig auch mit allem, wie man das so macht."}, {"id": 1277, "start": 8071.12, "end": 8074.12, "text": "Da musst du dann FAT bezahlen, dann musst du Mehrwertsteuer bezahlen"}, {"id": 1278, "start": 8074.12, "end": 8083.12, "text": "und du musst, wenn es über 150 Euro ist, noch Zollgebühren bezahlen."}, {"id": 1279, "start": 8083.12, "end": 8088.12, "text": "Bei AliExpress ist es so."}, {"id": 1280, "start": 8088.12, "end": 8092.12, "text": "Wie viel bekommt man denn von den Fünften ab?"}, {"id": 1281, "start": 8092.12, "end": 8093.12, "text": "Das ist eine gute Frage."}, {"id": 1282, "start": 8093.12, "end": 8098.12, "text": "Ich glaube standardmäßig ohne extra custom Twitch Vertrag."}, {"id": 1283, "start": 8098.12, "end": 8100.12, "text": "Ich glaube die Hälfte."}, {"id": 1284, "start": 8100.12, "end": 8101.12, "text": "Ich müsste mal nachgucken."}, {"id": 1285, "start": 8101.12, "end": 8113.12, "text": "Ich glaube die Hälfte."}, {"id": 1286, "start": 8113.12, "end": 8117.12, "text": "Also ich hatte noch nie Zollprobleme mit AliExpress."}, {"id": 1287, "start": 8117.12, "end": 8122.12, "text": "Das liegt aber auch daran, dass sie das glaube ich recht geschickt machen mittlerweile."}, {"id": 1288, "start": 8122.12, "end": 8127.12, "text": "Wenn du den normalen Versandweg nimmst bei AliExpress,"}, {"id": 1289, "start": 8127.12, "end": 8131.12, "text": "dann kommt das dann mit irgendeinem Schiff aus China oder so."}, {"id": 1290, "start": 8131.12, "end": 8136.12, "text": "Die kommen dann in Rotterdam, in Niederlanden irgendwo an."}, {"id": 1291, "start": 8136.12, "end": 8139.12, "text": "Und von da geht es mit PostNL weiter."}, {"id": 1292, "start": 8139.12, "end": 8143.12, "text": "Also ich habe ehrlich gesagt keine Ahnung,"}, {"id": 1293, "start": 8143.12, "end": 8147.12, "text": "ob AliExpress Sendungen jemals den Zoll sehen."}, {"id": 1294, "start": 8147.12, "end": 8150.12, "text": "Ich weiß nicht an welcher Stelle das gemacht werden müsste."}, {"id": 1295, "start": 8150.12, "end": 8155.12, "text": "Eigentlich müsste das ja in Niederlanden gemacht werden, wenn sie da landen."}, {"id": 1296, "start": 8155.12, "end": 8156.12, "text": "Keine Ahnung wie sie das machen."}, {"id": 1297, "start": 8156.12, "end": 8157.12, "text": "Und dazu kommt noch,"}, {"id": 1298, "start": 8157.12, "end": 8167.12, "text": "dass die wahrscheinlich auch einfach die Sachen sehr optimistisch deklarieren."}, {"id": 1299, "start": 8167.12, "end": 8170.12, "text": "Die deklarieren es ordnungsgemäß."}, {"id": 1300, "start": 8170.12, "end": 8172.12, "text": "Allerdings was sie draufschreiben,"}, {"id": 1301, "start": 8172.12, "end": 8178.12, "text": "wird wahrscheinlich nicht unbedingt immer so der Realität entsprechen."}, {"id": 1302, "start": 8178.12, "end": 8181.12, "text": "Du hast darüber einen Arbeitgeschirm, okay."}, {"id": 1303, "start": 8181.12, "end": 8183.12, "text": "China hat in Griechenland einen Hafen aufgekauft."}, {"id": 1304, "start": 8183.12, "end": 8190.12, "text": "Sehr gut, in Griechenland war wahrscheinlich der Hafen auch billig."}, {"id": 1305, "start": 8190.12, "end": 8192.12, "text": "Machst du irgendwann mal wieder eine Runde BF3 Metacommunity?"}, {"id": 1306, "start": 8192.12, "end": 8212.12, "text": "Könnte man machen."}, {"id": 1307, "start": 8212.12, "end": 8214.12, "text": "Wo machst du am liebsten Urlaub?"}, {"id": 1308, "start": 8214.12, "end": 8225.12, "text": "Also bisher muss ich sagen am besten."}, {"id": 1309, "start": 8225.12, "end": 8228.12, "text": "Also der beste Urlaub war in der Türkei."}, {"id": 1310, "start": 8228.12, "end": 8233.12, "text": "Allerdings ist das schon ewig her."}, {"id": 1311, "start": 8233.12, "end": 8238.12, "text": "Aber auch nur weil wir da mit mehreren Leuten da waren."}, {"id": 1312, "start": 8238.12, "end": 8244.12, "text": "Am besten gefallen, würde ich sagen, hat es mir auf Gran Canaria."}, {"id": 1313, "start": 8244.12, "end": 8247.12, "text": "Das hat mir am besten gefallen, ja."}, {"id": 1314, "start": 8247.12, "end": 8258.12, "text": "Also von drum herum."}, {"id": 1315, "start": 8258.12, "end": 8260.12, "text": "Gran Canaria beste, ja."}, {"id": 1316, "start": 8260.12, "end": 8261.12, "text": "Wie schauen deine Urlauber aus?"}, {"id": 1317, "start": 8261.12, "end": 8263.12, "text": "Bahnurlaub oder Sachen anschauen?"}, {"id": 1318, "start": 8263.12, "end": 8265.12, "text": "Beides, beides."}, {"id": 1319, "start": 8265.12, "end": 8267.12, "text": "Allerdings, ich muss dir ehrlich sagen,"}, {"id": 1320, "start": 8267.12, "end": 8276.12, "text": "ich glaube, ich war die letzten fünf Jahre nicht mehr irgendwo so klassisch im Urlaub."}, {"id": 1321, "start": 8276.12, "end": 8282.12, "text": "Wo ich noch mal hinfahren würde, ist nach Island."}, {"id": 1322, "start": 8282.12, "end": 8286.12, "text": "Allerdings muss ich auch sagen, so richtig in den Urlaub fahren,"}, {"id": 1323, "start": 8286.12, "end": 8296.12, "text": "da brauchst du ja noch Leute, die mitgehen."}, {"id": 1324, "start": 8296.12, "end": 8298.12, "text": "Ich bin jetzt nicht mehr in dem Alter,"}, {"id": 1325, "start": 8298.12, "end": 8302.12, "text": "wo ich da jetzt irgendwie großartige EL-Freunde hätte, die da mitfahren."}, {"id": 1326, "start": 8302.12, "end": 8307.12, "text": "Die sind ja selbst alle beschäftigt mit Familie, Kinder, sonst was."}, {"id": 1327, "start": 8307.12, "end": 8311.12, "text": "Tja, und deswegen denke ich mal, bis ich vielleicht mal irgendwann,"}, {"id": 1328, "start": 8311.12, "end": 8319.12, "text": "zumindest sagen wir mal Kinder außen vor, ja."}, {"id": 1329, "start": 8319.12, "end": 8321.12, "text": "Aber bis dahin werde ich wahrscheinlich dann erst mal nicht in den Urlaub fahren,"}, {"id": 1330, "start": 8321.12, "end": 8328.12, "text": "weil alleine habe ich keinen Bock."}, {"id": 1331, "start": 8328.12, "end": 8332.12, "text": "Was natürlich nicht verkehrt ist, weil die letzten paar Jahre habe ich so gemacht,"}, {"id": 1332, "start": 8332.12, "end": 8337.12, "text": "ich habe einfach zu den Zeitpunkten, wo alle Urlaub wollten, habe ich nie Urlaub genommen."}, {"id": 1333, "start": 8337.12, "end": 8346.12, "text": "Und dafür habe ich mich dann immer von der Arbeit den kompletten Dezember verpisst."}, {"id": 1334, "start": 8346.12, "end": 8350.12, "text": "Deswegen habe ich eigentlich den kompletten Dezember immer Zeit für Stremsoren und Videos."}, {"id": 1335, "start": 8350.12, "end": 8354.12, "text": "Wenn ich Videos mache."}, {"id": 1336, "start": 8354.12, "end": 8356.12, "text": "Aber ich mache ja letztendlich wenige Videos, ich weiß."}, {"id": 1337, "start": 8356.12, "end": 8365.12, "text": "Aber im Dezember habe ich immer einen ganzen Monat Zeit."}, {"id": 1338, "start": 8365.12, "end": 8391.12, "text": "Ich mache immer ein paar Debate-Videos, ja."}, {"id": 1339, "start": 8391.12, "end": 8397.12, "text": "War da nicht der Krieger?"}, {"id": 1340, "start": 8397.12, "end": 8404.12, "text": "Was hältst Du von 360 Kameras?"}, {"id": 1341, "start": 8404.12, "end": 8409.12, "text": "In welchem Anwendungsgebiet, wofür, genau?"}, {"id": 1342, "start": 8409.12, "end": 8413.12, "text": "Weil für normale Aufnahmen sind die ja nichts."}, {"id": 1343, "start": 8413.12, "end": 8417.12, "text": "Das sieht ja ein bisschen rund aus."}, {"id": 1344, "start": 8417.12, "end": 8421.12, "text": "Aber 360 Kameras für normales Zeug."}, {"id": 1345, "start": 8421.12, "end": 8425.12, "text": "Außer halt vielleicht mit VR-Brille, dass man sich dann da drinnen dreht"}, {"id": 1346, "start": 8425.12, "end": 8429.12, "text": "und immer nur einen Teil angezeigt kriegt oder sowas."}, {"id": 1347, "start": 8429.12, "end": 8435.12, "text": "Kreuzfahrtschriften sind voll mit Rentnern, kein Schimmer."}, {"id": 1348, "start": 8435.12, "end": 8440.12, "text": "Aber ich kenne ein paar Leute, die sind auch schon im Urlaub auf Kreuzfahrtschiff gegangen,"}, {"id": 1349, "start": 8440.12, "end": 8445.12, "text": "das sind keine Rentner."}, {"id": 1350, "start": 8445.12, "end": 8454.12, "text": "Aber auf ein Kreuzfahrtschiff müsste ich ehrlich gesagt nicht."}, {"id": 1351, "start": 8454.12, "end": 8459.12, "text": "Gammelst Du da den ganzen Tag ums Schiff rum?"}, {"id": 1352, "start": 8459.12, "end": 8465.12, "text": "Naja, ein paar Sachen angucken ist schon nicht verkehrt."}, {"id": 1353, "start": 8465.12, "end": 8470.12, "text": "Wobei ich halt keinen Bock habe auf dieses Standard-Tourismus-Kulturprogramm."}, {"id": 1354, "start": 8470.12, "end": 8478.12, "text": "Da hat ja jedes Land und jede Ecke so 4-5 Sehenswürdigkeiten, wo es alle Touristen hinkaren."}, {"id": 1355, "start": 8478.12, "end": 8482.12, "text": "Willst Du zu dem Video reacten?"}, {"id": 1356, "start": 8482.12, "end": 8485.12, "text": "Ich glaube, das kenne ich."}, {"id": 1357, "start": 8485.12, "end": 8495.12, "text": "Ich glaube, das kenne ich."}, {"id": 1358, "start": 8495.12, "end": 8500.12, "text": "Jaja, das kenne ich. Das ist richtig gut."}, {"id": 1359, "start": 8500.12, "end": 8503.12, "text": "Haha, das ist gut."}, {"id": 1360, "start": 8503.12, "end": 8509.12, "text": "Das kenne ich. Das können wir uns angucken. Das Video ist wirklich lustig."}, {"id": 1361, "start": 8509.12, "end": 8518.12, "text": "Das Video ist wirklich lustig. Also für alle JavaScript-Fans, die müssen jetzt stark sein."}, {"id": 1362, "start": 8518.12, "end": 8520.12, "text": "Das ist lustig."}, {"id": 1363, "start": 8520.12, "end": 8537.12, "text": "Das geht auch nur. Das geht auch nur 4 Minuten oder so."}, {"id": 1364, "start": 8537.12, "end": 8540.12, "text": "Ach, Ruby? Nicht JavaScript."}, {"id": 1365, "start": 8540.12, "end": 8564.12, "text": "Ja."}, {"id": 1366, "start": 8564.12, "end": 8569.12, "text": "Das ist tatsächlich ein bisschen unlogisch."}, {"id": 1367, "start": 8569.12, "end": 8587.12, "text": "Ja, das ist Ruby. Das ist typischer Ruby-Style."}, {"id": 1368, "start": 8587.12, "end": 8596.12, "text": "Das verwirrt jeden, der mit Ruby anfängt. Diese Method-Missing-Geschichte."}, {"id": 1369, "start": 8596.12, "end": 8601.12, "text": "Das ist Ruby. Das ist Ruby-Logik."}, {"id": 1370, "start": 8601.12, "end": 8606.12, "text": "Wie das funktioniert, ist eigentlich ganz einfach."}, {"id": 1371, "start": 8606.12, "end": 8614.12, "text": "Diese Funktion, Method-Missing, wird aufgerufen, immer wenn Du was aufrufst, was es nicht gibt."}, {"id": 1372, "start": 8614.12, "end": 8624.12, "text": "Und in dem Fall nimmt er halt die Sachen, die es nicht gibt, als Argumente hierfür und macht einen String draus."}, {"id": 1373, "start": 8624.12, "end": 8642.12, "text": "Das stimmt. Das stimmt. Das ist wirklich cool bei Ruby."}, {"id": 1374, "start": 8642.12, "end": 8647.12, "text": "Alter, warum pissen Sie sich so weg? Übertreibt man nicht."}, {"id": 1375, "start": 8647.12, "end": 8656.12, "text": "Ja, jetzt kommt der gute Teil."}, {"id": 1376, "start": 8656.12, "end": 8663.12, "text": "Wisst ihr, was rauskommt? Was kommt raus? Leeres Array plus leeres Array?"}, {"id": 1377, "start": 8663.12, "end": 8677.12, "text": "Lass mal überlegen. Das ist JavaScript. Also logisch wäre, leeres Array plus leeres Array gibt ein leeres Array."}, {"id": 1378, "start": 8677.12, "end": 8686.12, "text": "Die Frage ist nur, ob man in JavaScript leere Arrays mit Plus überhaupt zusammenhängen kann."}, {"id": 1379, "start": 8686.12, "end": 8703.12, "text": "Und ich denke mal, das geht nicht. Deswegen wird er wahrscheinlich versuchen, das Array umzuwandeln in irgendeinen Typ, den man addieren kann."}, {"id": 1380, "start": 8703.12, "end": 8712.12, "text": "Das heißt, das, was der Sebaro sagt, ist gar nicht so unlogisch, dass da not a number rauskommt."}, {"id": 1381, "start": 8712.12, "end": 8732.12, "text": "Aber es kann alles sein. Das ist JavaScript."}, {"id": 1382, "start": 8732.12, "end": 8750.12, "text": "Was? Warum?"}, {"id": 1383, "start": 8750.12, "end": 8770.12, "text": "Wandelt der leeres Array um in den String und leeres String plus leeres String ist leeres String oder was?"}, {"id": 1384, "start": 8770.12, "end": 8791.12, "text": "Ach du Scheiße, keine Ahnung. Da kommt jetzt not a number raus. Irgendwann muss in JavaScript immer not a number rauskommen."}, {"id": 1385, "start": 8791.12, "end": 8803.12, "text": "Okay, das mit Object ergibt sogar halbwegs Sinn. Halbwegs. In JavaScript-Logik ergibt das sogar halbwegs Sinn."}, {"id": 1386, "start": 8803.12, "end": 8820.12, "text": "Das ist ein Object, ein leeres. Aber es ist ein Object. Und das ist ein Array. Und das zusammen ist ein Object Array. Oder? Wie auch immer."}, {"id": 1387, "start": 8820.12, "end": 8829.12, "text": "Ist das überhaupt ein Object Array oder ist das nur ein Object? Nur ein Object, ne? Wo ist das Array hin?"}, {"id": 1388, "start": 8829.12, "end": 8846.12, "text": "Ja, leider noch keine Sub-Eigens. Ich hab's noch nicht auf die Reihe gekriegt. Mir haben auch die guten Ideen gefehlt."}, {"id": 1389, "start": 8846.12, "end": 8862.12, "text": "Das ist jetzt not a number. Ich hab mir an gewöhnt, wenn man in JavaScript keine Ahnung hat was rauskommt, man muss es nur oft genug in verschiedenen Kombinationen probieren und irgendwann kommt not a number raus."}, {"id": 1390, "start": 8862.12, "end": 8879.12, "text": "Und eines ist es Null. Ich hab keine Ahnung warum da Null rauskommt."}, {"id": 1391, "start": 8879.12, "end": 8895.12, "text": "Okay, das ist wir. Das ist nice. Not a number. Endlich haben wir mal not a number."}, {"id": 1392, "start": 8895.12, "end": 8918.12, "text": "Das ist richtig. Pepega. Alter, wie sie sich wegpissen."}, {"id": 1393, "start": 8918.12, "end": 8938.12, "text": "Endlich mal ein Talk Publikum was gut drauf ist."}, {"id": 1394, "start": 8938.12, "end": 8952.12, "text": "Naja, da weiß ich jetzt was kommt. Da kommt jetzt Batman gleich."}, {"id": 1395, "start": 8952.12, "end": 8977.12, "text": "Voll klar, dass da 16 Kommas rauskommen. Wobei die 16 Kommas wahrscheinlich intern sowas sind Null, Null, Null, Null, Null, Null, Null, Null. Also sprich der Wandel das einfach, dass man es besser lesbar kann um in eben ne String Repräsentation von dem Inhalt von dem Array."}, {"id": 1396, "start": 8977.12, "end": 8996.12, "text": "Und es ist halt einfach Null, nächstes Element, Null, nächstes Element. Also das ergibt Sinn."}, {"id": 1397, "start": 8996.12, "end": 9016.12, "text": "Das ergibt auch Sinn. Du joins halt Null. Du joins 16 mal Null mit Wort zusammen. Das ist okay. Das ist ja im Prinzip das Trennzeichen. Und es ist halt nichts dazwischen. Das ergibt auch noch Sinn."}, {"id": 1398, "start": 9026.12, "end": 9040.12, "text": "Okay, das leuchtet mir auch noch irgendwo ein."}, {"id": 1399, "start": 9040.12, "end": 9066.12, "text": "Das ist ne gute Frage. Was kommt da raus? Macht er dann nur noch wahr raus? String minus eins. Was könnte das? Not a number. Da kommt jetzt, da kommt jetzt Not a number raus Leute. Not a number. Das ist das einzige was ich mir irgendwie erklären könnte."}, {"id": 1400, "start": 9066.12, "end": 9082.12, "text": "Ja, das kenn ich. Klar, das hab ich auch schon ein paarmal an Stream gezeigt. Das ist ja wirklich, das ist sau bekannt die Geschichte jetzt. Was da rauskommt. Da kommt jetzt Na Na Na Na Na Na Na Batman raus."}, {"id": 1401, "start": 9082.12, "end": 9098.12, "text": "Wieso gehen die alles so ab? Weil es halt die krassen Programmergeeks sind. Find das auch lustig? Und nicht so lustig, sondern ich find das wirklich lustig. Und die sind halt mal gut drauf. Endlich mal ein Talk mit Publikum was gut drauf ist."}, {"id": 1402, "start": 9098.12, "end": 9116.12, "text": "Ich mein okay die eskalieren halt voll jetzt, aber es ist schon abgedreht muss man sagen. Ich mein ich kenn das hier schon jetzt. Das ist bekannt. Das ist sau bekannt."}, {"id": 1403, "start": 9116.12, "end": 9141.12, "text": "Das ist ein guter Talk. Das ist ein guter Talk. Das Publikum ist so eingespielt. Nein, die finden das einfach lustig. Die finden das lustig. Das ist, also wenn man JavaScript Programmierer ist oder überhaupt wenn man ein bisschen was damit zu tun hat und schon mal JavaScript wirren gesehen hat, dann ist das, das ist tatsächlich echt lustig."}, {"id": 1404, "start": 9141.12, "end": 9170.12, "text": "Ja Sebaro, warum hatten wir überhaupt einen Discord Invite Link, der nur in den Weep Channel geführt hat? Haben wir mittlerweile einen ordentlichen Invite Link? Ich will die Leute nicht standardmäßig abschrecken, also nicht defaultmäßig abschrecken, wenn sie im Weep Channel rauskommen und dass Sebaro nachts um 2 Uhr Dinger postet."}, {"id": 1405, "start": 9170.12, "end": 9188.12, "text": "Ja dann Ray dann bist du halt da immun dagegen, kann ja sein. Echt war das lustig."}, {"id": 1406, "start": 9188.12, "end": 9209.12, "text": "Wie heißt das JS Ding von Microsoft, was da jetzt kommt? Kommt ein JS Ding von Microsoft? Ich weiß nur, dass Bing jetzt Chrome ist. Oder man zu Blazer, was wir uns gestern angeguckt haben."}, {"id": 1407, "start": 9209.12, "end": 9233.12, "text": "Blazer haben wir uns gestern angeguckt, allerdings Blazer ist kein JavaScript, Blazer ist ein komplettes.NET im Browser und auch hat mit JavaScript gar nichts zu tun."}, {"id": 1408, "start": 9233.12, "end": 9250.12, "text": "Ja Bildschirmarbeiter, das ist gefährlich, das habe ich auf der Arbeit auch gemacht im Discord und jetzt fragt mich Discord nicht mehr, ob ich wirklich weiter klicken will im Discord Channel und wenn ich jetzt ausversehen auf den Weep Channel im Discord klick, kommen da irgendwelche nacken Anime Grills."}, {"id": 1409, "start": 9250.12, "end": 9261.12, "text": "Das ist nicht so sinnvoll, wenn ich das auf dem Monitor auf der Arbeit anzeige."}, {"id": 1410, "start": 9261.12, "end": 9267.12, "text": "Willst du Monka Vinval in den Chatclient packen?"}, {"id": 1411, "start": 9267.12, "end": 9292.12, "text": "Funktioniert nicht, weil der Chatclient ist, also wenn du den hier meinst, der ist, die Emotes sind gefaked, das ist mit einem Browser Addon und wenn das kein offizielles Emote ist, funktioniert es nicht."}, {"id": 1412, "start": 9292.12, "end": 9321.12, "text": "Das Overlay ist genauso, das ist ein Overlay von Streamlabs und das zeigt nur Emotes an die offiziell in dem Channel drin sind, das heißt ich müsste bei FFZ quasi Monka Vin oder so was oder Java S haben wir ja auch auf dem Discord, müsste ich dann als offizielles Emote einreichen bei FFZ, dass ich es bei mir im Channel hinzufügen könnte."}, {"id": 1413, "start": 9321.12, "end": 9337.12, "text": "Muss ich mal überlegen, wie wir das machen. Ich hätte viel lieber so Emotes in der Richtung direkt auf Twitch, also ich will auf jeden Fall ein Java Flame Emote, was man immer mal verwenden kann."}, {"id": 1414, "start": 9337.12, "end": 9352.12, "text": "Da kann ich es rein machen."}, {"id": 1415, "start": 9352.12, "end": 9367.12, "text": "Ich habe mir auch schon überlegt, was auch ein richtig gutes Windows Emote wäre, ist hier easy, bloß mit blauen Gläsern für Blue Screen."}, {"id": 1416, "start": 9367.12, "end": 9382.12, "text": "Das wäre auch ein ganz gutes Emote. Wo ist denn das Bild für Monka Vin?"}, {"id": 1417, "start": 9382.12, "end": 9404.12, "text": "Oh, das Stream ist on. Wer hätte das gedacht? Ist hier Monka Vin drin? Ah hier, das kann man ja Link öffnen, speichern."}, {"id": 1418, "start": 9404.12, "end": 9414.12, "text": "Monka S3, ok gut."}, {"id": 1419, "start": 9414.12, "end": 9438.12, "text": "Was? Monka S3, ja nice. Ist ja auch drin."}, {"id": 1420, "start": 9438.12, "end": 9456.12, "text": "Monka Vin."}, {"id": 1421, "start": 9456.12, "end": 9470.12, "text": "Monka, hm, ja das könnte ich echt noch machen. Ok, mal gucken, wen wir hosten können."}, {"id": 1422, "start": 9470.12, "end": 9488.12, "text": "Ich programmiere mir die Welt, wen haben wir denn da? Was programmiert er denn?"}, {"id": 1423, "start": 9488.12, "end": 9502.12, "text": "Was ist das? WordPress? Das ist WordPress? Autofill to Challenger, was ist das?"}, {"id": 1424, "start": 9502.12, "end": 9527.12, "text": "Das ist.NET, das ist mir schon mal sympathisch. NoobDevTV, das ist auch.NET. Und ganz viele Messages hier neben."}, {"id": 1425, "start": 9527.12, "end": 9534.12, "text": "Was programmiert er da? Eine Minecraft-Klone oder was gibt das? Local Chunk Cache."}, {"id": 1426, "start": 9534.12, "end": 9541.12, "text": "Daran hätten wir noch zu bieten. Android Flutter App, der ist jeden Tag on, ne? Den haben wir jetzt schon öfters gesehen."}, {"id": 1427, "start": 9541.12, "end": 9557.12, "text": "Nee, das ist ein anderer. Und der 3D-Drucker ist natürlich am Start, wer sonst? Was, wer ist geil?"}, {"id": 1428, "start": 9557.12, "end": 9578.12, "text": "Sharks Development. Der da? Autofill to Challenger? Der macht es richtig."}, {"id": 1429, "start": 9578.12, "end": 9587.12, "text": "Console Debugging, das einzig wahre. Das hört sich jetzt so an, als will ich den Flame, will ich gar nicht. Macht das selber so."}, {"id": 1430, "start": 9587.12, "end": 9595.12, "text": "Wer braucht schon Debugger? Beste. Console Debugging."}, {"id": 1431, "start": 9595.12, "end": 9601.12, "text": "Ja, er ist natürlich nur halb ernst gemein, das hat schon seinen Anwendungszweck. Aber für einfache Sachen ist beste."}, {"id": 1432, "start": 9601.12, "end": 9610.12, "text": "Redi sagt, nichts geht über Console Debugging. Wirtschaftswissenschaften im Studium, das hat immer null Zuschauer."}, {"id": 1433, "start": 9610.12, "end": 9615.12, "text": "Das liegt aber einfach auch daran, weil BWL-Shit einfach langweilig ist."}, {"id": 1434, "start": 9615.12, "end": 9623.12, "text": "Ich mein, wer guckt sich freiwillig BWL-Kram auf Twitch an?"}, {"id": 1435, "start": 9623.12, "end": 9632.12, "text": "Das ist schon schlimm genug, wenn man das machen muss. Macht das weg."}, {"id": 1436, "start": 9632.12, "end": 9637.12, "text": "Ja, jetzt kommen immer welche, die es angeblich gucken."}, {"id": 1437, "start": 9637.12, "end": 9654.12, "text": "Pigs all didn't happen. Ich glaube euch kein Wort, dass ihr das guckt. Was programmiert er denn eigentlich? Was programmiert er denn hier? Models? Main?"}, {"id": 1438, "start": 9654.12, "end": 9676.12, "text": "Das sieht nur ein bisschen nach WPF aus. Login-Window. Ein Twitch-Bot. Ja, ergibt Sinn."}, {"id": 1439, "start": 9676.12, "end": 9688.12, "text": "Der macht's richtig. Erstmal in Ruhe zurücklehnen, überlegen, so macht man's. Den hausdicht, der ist gut."}, {"id": 1440, "start": 9688.12, "end": 9706.12, "text": "Okay Leute, also. Wir sehen uns die Tage wieder. Bis dahin, monkaWin. Und wir sehen uns. Bis denn, CU."}]}