{"text": "So Leute, ich bin mal wieder am Start, weil zur Abwechslung, oha, geht das überhaupt jetzt, dafuck, ja doch es funktioniert wunderbar. So, ruckelt, ruckelt das Stream irgendwie, kann das sein. Ne, das Stream ruckelt nicht, das GIF ruckelt. So, doofes GIF, wenn das ruckelt, ruckelt das GIF. Das GIF ruckelt bei mir gar nicht, das GIF ruckelt nur im Stream. Das ist auch nicht warum, ich hab OBS neu eingerichtet und so, aber das ist mal weg. So, mal gucken ob das flüssig ist, muss mir das jetzt mal in der Vorschau angucken, ob das flüssig ist, was ich hier mache. Weil in meiner Vorschau ruckelt beziehungsweise hat das Stream irgendwie Aussetzer. Ne, das ruckeln, das hat Aussetzer, das Fenster bleibt stehen zwischendurch. Seht ihr das, ich bewege die ganze Zeit das Fenster hin und her, aber das bleibt stehen zwischendurch. Was ist das jetzt? Tja, ab und zu lagts, tja ich bin gleich wieder da.", "segments": [{"id": 1, "start": 0.0, "end": 11.0, "text": "So Leute, ich bin mal wieder am Start, weil zur Abwechslung, oha, geht das überhaupt jetzt, dafuck, ja doch es funktioniert wunderbar."}, {"id": 2, "start": 11.0, "end": 28.0, "text": "So, ruckelt, ruckelt das Stream irgendwie, kann das sein."}, {"id": 3, "start": 28.0, "end": 53.0, "text": "Ne, das Stream ruckelt nicht, das GIF ruckelt."}, {"id": 4, "start": 53.0, "end": 58.0, "text": "So, doofes GIF, wenn das ruckelt, ruckelt das GIF."}, {"id": 5, "start": 58.0, "end": 73.0, "text": "Das GIF ruckelt bei mir gar nicht, das GIF ruckelt nur im Stream."}, {"id": 6, "start": 73.0, "end": 90.0, "text": "Das ist auch nicht warum, ich hab OBS neu eingerichtet und so, aber das ist mal weg."}, {"id": 7, "start": 90.0, "end": 97.0, "text": "So, mal gucken ob das flüssig ist, muss mir das jetzt mal in der Vorschau angucken, ob das flüssig ist, was ich hier mache."}, {"id": 8, "start": 97.0, "end": 105.0, "text": "Weil in meiner Vorschau ruckelt beziehungsweise hat das Stream irgendwie Aussetzer."}, {"id": 9, "start": 105.0, "end": 113.0, "text": "Ne, das ruckeln, das hat Aussetzer, das Fenster bleibt stehen zwischendurch."}, {"id": 10, "start": 113.0, "end": 130.0, "text": "Seht ihr das, ich bewege die ganze Zeit das Fenster hin und her, aber das bleibt stehen zwischendurch. Was ist das jetzt?"}, {"id": 11, "start": 130.0, "end": 144.0, "text": "Tja, ab und zu lagts, tja ich bin gleich wieder da."}]}