{"text": ". Zu Pungen, Lockerungsübungen durchführen erstmal Okay, es ist Progas So Leute Ich glaub Ich überleg grad ob ich das auf Twitter Ob ich das auf Twitter Ich glaub ich poste das mal auf Twitter Bitworts Gucken Mein und deine Räder Wir müssen mal gucken ob der Ob das passt ja Also sprich Die Lautstärke, ob die Lautstärke passt Von der PS4 Und wir müssen gucken dass der Chat nicht nervt Wenn der Chat nervt dann müssen wir den Chat ausmachen Auch wenn es Q-Chat ist Ja und Aja ja und alles Dass ähm Wenn das nicht funktioniert mit dem Chat Wenn der Chat Ja PS4 MonkaS Hyper MonkaS ey Was ein Akt gestern Was ein unglaublicher riesen Akt Den Kram zum laufen zu bringen äh Ich poste mal auf Wir müssen erstmal kurz testen ob die Lautstärke okay ist Ihr solltet jetzt im Hintergrund Ihr solltet jetzt in Ich glaube mein Mikro ist vielleicht ein bisschen laut Nee ne ich hab doch seit Ich hab doch seit releasene PS4 Ich benutze die bloß nie Ich benutze die bloß nie Ich benutze die bloß nie Ich benutze die bloß nie Ich benutze die bloß nie Ich benutze die bloß nie Ich benutze die ja nie. Ich hab ewig eine. Ich hab schon grad ne Runde gespielt, das Spiel ruckelt ein bisschen. Aber das glaub ich nicht, dass es einmal an der PS4 liegt. Das wird einfach am Game liegen. Also ihr müsstet jetzt im Hintergrund, müsstet ihr leise den PS4-Menü-Sound hören. Ne, was heißt, kein einziges Game installiert außer Modern Warfare? Doch, doch. Doch, doch, klar. Das Problem ist nur, ich erzähl euch das jetzt mal kurz. Ich muss gleich mal handfetchen, meine Hand sind übel bappig. Ich hab hier so ne uralte Gammelmaus jetzt angeschlossen am anderen Rechner. Ich muss euch das jetzt mal kurz erzählen. Also, ein Riesenakt. Wir starten das jetzt gerade mal. Wir können jetzt ja gerade auch mal gucken, wie die Lautstärke hier ist. Das ruckelt wohl ein Bug von der Map. Ich glaub, das ruckelt überall irgendwie. Ja, wir warten erstmal mit Twitter-Message posten, bis ich ein paar Runden gespielt habe. Erinnert mich mal bitte dran. Alter, ist ja gut, ey. Ja, wir haben mehr Krach. Ich glaube, es könnte tatsächlich ein bisschen laut sein. Wenn es ein bisschen laut ist, muss ich, ähm, keinen Pepo-Clap habe ich nicht gefunden. Muss Link schicken. Also, pass mal auf, ein Riesenakt mit der Playstation. Ich hab mich gestern versucht anzumelden. Ich hab die Playstation 4 erst mal seit drei Jahren wieder eingeschaltet. Das ist ja ewig her. Seit Ewigkeiten hab ich das Ding wieder eingeschaltet. Und dann hab ich festgestellt, oh, ich muss erstmal eine Stunde lang Updates machen. Hab ich mir gesagt, ja nice, Stunde lang Updates. Hab ich die Playstation 4 Updates ziehen lassen, alles gut. Und dann war das Problem, das Ding wollte sich ins PSN verbinden. Und es konnte sich nicht mit dem PSN verbinden. Ging nicht. Keine PSN-Verbindung möglich. Ich hab mir gedacht, hä, was ist das? Hat sich eine Nachricht angezeigt, so ja, ich könnte ja mein Passwort resetten. Vielleicht wurde der Account gesperrt, was auch immer, was eigentlich vollkommener Blödsinn ist. Weil da hätte ich irgendwie eine Nachricht kriegen müssen per Mail. Aber nö, äh, wollten wir nicht. Ging nicht anmelden, hab ich gesagt, okay, resette ich mal mein Passwort. Ähm, resette ich mal mein Passwort. Hab ich mein Passwort resettet? Link auf dem Link, äh, in dem Link, in der Mail auf dem Link für Passwort. Genau, zu viel, zu viel Gehexort. In der Mail auf den Link geklickt, ähm, zum Thema Passwort resetten. Und dann wollten die mein Geburtsdatum wissen bei Sony. Mein Geburtsdatum, was weiß ich, was ich bei diesem fake Account für ein Geburtsdatum eingetragen hab. Gut, konnte ich nicht resetten. Okay, also, naja, gut. Scheiß drauf. Resettest du deine PS4, dass alles runter ist und meldest dich im neuen Account an. Dann ist mir aufgefallen, dass man, das ist Big Brain Play von Sony. Huge, huge, also Five Head. Übrigens, wir haben, wir haben unser erstes Emote. Macht mal Wupplull, Wupplull gibt's, gibt's jetzt in Emote. Ähm, ja, ging nicht. Man muss sich, man muss sich anmelden. Man muss sich anmelden. Dankeschön, Teinsa. Ich hab leider kein Memeboard heute am Start. Ich kann keine Sounds oder sonst was einblenden. Ähm, Teinsa, zwei Monate. Ultra Poggers, äh, Casino Kapitalist auch am Start. Sehr nice. Naja, zumindest man muss sich anmelden. Das ist richtig Huge Brain von Sony. Man muss sich anmelden, um seine PS4 resetten zu können. Also sprich, ähm, wenn man die PS4 resetten will, wenn man den Account verloren hat, dann geht das Ganze nicht. Tja. Leute, ich glaub der P, ich glaub der Sound ist ein bisschen laut, hä? Der, das Mainmenü, äh, wenn, wenn das Mainmenü schon so laut ist. Ich mach mal kurz ein bisschen leiser, wartet mal. Wenn das Mainmenü schon so laut ist. So. Wenn das Mainmenü schon so laut ist, dann, ähm, wird das andere auch zu laut sein. Naja, zumindest, also, dann hab ich festgestellt, man kann bei der PS4 einen zweiten Account anmelden. Hab ich mir gedacht, scheiß drauf. Du machst hier einen zweiten Account. Hab ich mir einen zweiten PSN-Account gemacht, angemeldet, bin in den Playstation Store gegangen und hab festgestellt, Modern Warfare ist nicht runterladbar. Nee, nee, das ist das Hauptmenü. Modern Warfare ist nicht runterladbar. Warum, weiß man nicht. Weil, ähm, Sony der Meinung ist, in Deutschland geht das nicht. Man kann das nicht runterladen. Man kann das nicht runterladen in Deutschland ohne Playstation Plus. Sie haben im Vorfeld, sie haben im Vorfeld einen Riesen-Acc gemacht. So nach dem Motto, jeder kann es spielen. Jeder kann es spielen. Vollkommen egal. Und in Deutschland geht das nur mit Playstation Plus. Na, Typ schrickt, ich hab nichts weitergeleitet auf die Playstation. Warum soll ich da was weiterleiten? Hypermonkaos. So. Hab ich festgestellt. Gut. Ähm, geht nicht. Und wollte ich, ich wollte mir tatsächlich mal ganz kurz überlegt, wollte ich mir, ich hab meinen Bildschirm irgendwie auf den falschen Monitor umgeschaltet. Warte mal kurz. Und dann wollte ich mir PS Plus kaufen, einen Monat, einfach zum Unterladen, weil ich keinen Bock hatte auf einen weiteren Akt, ne. Und dann hab ich festgestellt, oh, geht ja nicht. Ich muss irgendwie meinen Ausweis einscannen oder sowas. Ich muss mich irgendwie, irgendwas mit meinem Ausweis wollten sie haben. Und dann hab ich gesagt, gut, wisst ihr was, ihr könnt mich mal voll am Arsch lecken Sony. Und, und Infinity War, ihr könnt mich aktivischen. Ihr könnt mich alle am Arsch lecken. Ich mach mir jetzt einfach noch einen dritten Account an diesem Tag. Äh, den zweiten Account an diesem Tag. Und hab dort eingestellt, ich wohne in England, in London, im Burger King. Und ich heiße Max Omega Poggers. Und das haben die gefressen, das haben den Account mit angelegt. Und dann konnte ich's runterladen. Das war ein Riesenakt ohne Scheiß, Leute. Inklusive Download halb vier Stunden. Vier Stunden, die es dann gebraucht, bis ich das Game-Runden hatte. Und da sag noch mal einer, Konsole ist einfacher als PC. Gleich mal Resolve für Emotes, lol. Dankeschön. Es kann sein, dass ich das heute nicht so richtig sehe. Äh, mit den Emotes. Weil ich guck hier halt auf den zweiten Monitor, wo ich halt keinen, keinen, keinen... Wow. Ich halt keinen Chat hab. I took an Yo-Yo. Ja, trotzdem. Dankeschön für'n Sub. Ich geh jetzt mal ganz schnell Hände waschen und dann spielen wir. Waschen, alter, waschen. So, hat er waschen gesagt. Ja, heute ist mein Waschtag. Einmal, einmal im Monat. Einmal im Monat kann ich... Ich mein, sonst geht man nicht als echter Gamer durch, ne? Ist das Game P2P oder was wegen Natt? Ich habe nicht den leistesten Schimmer, eine Ahnung. Aber wir spielen jetzt die Runde. Auf geht's, Leute. Waschen, alter, waschen. Waschen! Waschen! Waschen! Waschen! Waschen! Waschen! Waschen, alter, waschen. Waschen! Erstmal jetzt ausflippen. Okay. Huge Bash, alter. Kommt jetzt, huge. Jetzt wird's, jetzt kommt... Massive. Massive Five-Head Bash. Oh, die Map, die suckt. Die hab ich... Gleich, das Game ist neu. Ich hab die Map erst zweimal gespielt. Und gleich erst mal Mapflame. Immer Mapflame. Mal gucken, ob die wieder mit MP5 startet wie das letzte Mal. Nee. Shotgun. Pumpe. So. Shotgun. Erste Map gleich flamen. Die Map ist aber wirklich suckig. Du weißt überhaupt nicht, wo... Alter, habt ihr gesehen, wie sie ruckelt? Da vorne war er. Huge Rush. Huge Big Brain. Rekt. Easy Clap. Okay. Was, was, was ist denn, was ist denn der beste Weg hier? Ich renn mal außen rum. Ich will an Pump-Action, da kann nicht so viel passieren. Wow, was? Was zum Teufel? Warum hat er eine Pistole? What the fuck? Ah, Secondary. Ah, Smart. Huge... Big Play. Pass mal auf, wir werden hier jetzt so krass außen noch. Also es ist nicht mit Maus, es ist nur mit Controller. Seien denn du hast irgendeinen Adapter, der das emuliert. Ach, wir haben gewonnen. Mein Teammate? Oh, es geht ab. The Beast Aim. The Beast Aim carried mich. 3 zu 0. Igitt. Warum trifft... Alter, fast zum Teufel. Ich blick nicht durch. Der Outplayed. Ich muss mich erstmal ein bisschen einspielen. Aber der Beast Aim. Guckt euch das Beast, guckt euch den Beast Aim an. The Beast Aim. The Beast Aim. The Beast Aim, guck mal, der geht ab. Das bestimmt hier. Wir haben eine Extra Solution, oder ich weiß nicht, ob es hier noch gibt. Achtung, jetzt, jetzt wird es. Weckt. Weggeskillt. Das ruckelt? Das ruckelt? Was ist das denn? Das ist... Warte, was? Ich weiß nicht mal, was der Knopf ist zum Messern. Das ist Alpha, Alpha. Ist das ein Schneiber? Schneiber End? Schneiber? Schneiber? Weckt. Die kriegen auf den Sack, ey. Schneiber. Das war... Hab ich das richtig gesehen? Eine 30 Schuss Autosniper? Eine 30 Schuss Silenced Autosniper? Ist das euer Ernster? Ich schneiber die jetzt wieder ins Bahn. Ich geh oben lang. Oh, oh, jetzt rushed er. Jetzt rushed er. Pfff. Na ja, 4-2-7. The Beast Aim, der will es wissen. Ach, das ist nur noch einer. Der ist gelieft. 6-0, gleich mal. Das ist eigentlich ein Sturmgewehr, okay. Ach so. Poggers, Poggers ist am Start. LOLW. Ach ne, nicht LOLW. Wupplull. Wie ist das Game? Das ist die zweite Runde. Wie findest du denn uns? Ich hab noch so gut wie nicht gespielt. Als haben wir wieder so ein komisches ACOG. Desert Eagle Ding. Passt, Leute, ich sag euch jetzt. Wir strafen jetzt, wir hardscopen jetzt. Und strafen und headshotten den Dude across the map. Ich sag's euch, ich sag's euch. Pass auf, pass auf. Reck. Reck, oh fuck, das ist gar nicht one-shot das Ding. Jetzt aber. Bam, in my face, Alter. Wie heilt man sich? Wie heilt man sich? Ich gewinne. Easy. Man gewinnt, wenn man mehr Leben hat als die Gegner. Easy. Man gewinnt, wenn man mehr Leben hat als die Gegner. Ja. Der hat übelst gelackt. Guckt euch mal an, Alter. Guckt euch mal an. Hallo. Jawoll, easy win. Ich find, das hat was, dass man keine Leben. Das hat was, dass man seine Leben nicht regenerieren kann. Das hat was, dass man seine Leben nicht regenerieren kann. Weil dadurch bringt das was, wenn du die Gegner low schießt. Weil dadurch bringt das was, wenn du die Gegner low schießt. Der konnte jetzt einfach one-shotten, weil ich den vor schon mal getroffen hab. Der konnte jetzt einfach one-shotten, weil ich den vor schon mal getroffen hab. Das ist eigentlich übelst nice. Das ist eigentlich übelst nice. Das ist eigentlich übelst nice. Ich wär da ja durchgelaufen jetzt. Ich wär da ja durchgelaufen jetzt. Nur in dem Modus mit dem Heilen, okay. Ich habe null ahnung. Okay die die die dinger sind deaktiviert Was zum teufel bin ich zu dumm zum zielen auf den oder was Hat man eine ping anzeige Fuck das war doch drauf oder ja okay ich bin ich glaube ich bin einfach zu dumm zum zielen kann sein wahrscheinlich wahrscheinlich ist mal eins drei das ist was ist das hier shotgun die auen uns übelst weg fingerzeige gibt es nicht okay wo ist wo ist denn der beast aimer hin haben sie uns übelst gecarriert oben oben unten okay komm mal zusammen reißen ich glaube es ist immer zwei hunden mit der gleichen waffe wir raschen jetzt die mitte lang hast mal auf übelst jutsch jutsch jutsch play was zum ich habe nur einmal geschossen er hat doppelt geschossen habe das gesehen gerade man kann die gegner nicht orten hier was auch immer schießt man zwei schuss wenn man irgendwie durchgedrückt hält oder so habt ihr es gerade gesehen ich habe einmal geschossen es war zwei schuss weg und der gegner nicht tot und irgendwie ganz merkwürdig auf packs geht es los scheiße man easy achter ist wieder gelieft was sind es für ehrenlose gegner jetzt wissen wir das ehrenlose gegner das letzte mal der ist gelieft nachdem die runde vorbei war das letzte mal ist gelieft spielst du mit mausentasten ich habe das freund mit diesem komischen adapter probiert das ist irgendwie merkwürdig wie du sekundäre stimmte ich an rpg als sekundäre steigt man jetzt eigentlich in der lobby wenn man jetzt einfach nur hier im chat rumgammelt man zurück ich mag übrigens den sound überhaupt nicht irgendwie also aber die analog steckt nur gegen einen es gibt hier bestimmt übelst nice nade spots wir rennen jetzt außen rum ganz schnell meine jüde ey übelste kacke mit ps4 control wow das spricht das spricht sekunde leute wartet mal das spricht das ist immer das wichtigste in kott stats check permanent stats checken aber wir haben uns getrennt das ist in schott ich spiele ich spiele aktuell eigentlich kaum noch shooter mäßig ich merke das auch dass ich irgendwie ob keine übung mehr habe aber wenn wir das jetzt ein paar tage kreinden dann sind wir wieder poggers ja was komm raus komm raus alter komm raus oh ein ein ein nicer messer kill ohne messer was ist das ist jetzt ein shotgun ich erkenne die kackwaffen ich glaube das ist ein shotgun oder auch nicht was ist das was ist das ich habe keine ahnung was ist für eine waffe ist es ein shotgun mk2 ok ich kann das bei meinem dude hinterher ich glaube das ist eine singel schusswaffe ok da bin ich das ist zu zu small brain für die waffe small brain jetzt gibt es ja lmg action in der mitte ich muss mal gucken dass man die maps die map irgendwie mal ein bisschen zu seinem vorteil ausspielt dieses dieses sinnlos lang ruschen ist links finde ich gut links hat was ich bin so scheiße in games mittlerweile ist es schlecht dabei hätte ich den übelst mein egal wie gewinnt das noch sagt euch leute wir kreiten das gelb jetzt morgen und morgen oder die nächsten tage werden so krass gebashed wenn wir wieder ein bisschen übung haben das bild kommt verzögert vom sound vom sound vom sound zum ach so meine stimme ja das kann sein da muss ich mich selbst ein bisschen verzögern ich war doch drauf das das liegt ich das kann sein weil es über die elgato geht in die elgato hat so eine halbe sekunde verzögern ich gucke mal dass ich mich ein bisschen verzögern kann gleich wenn wenn das hier fertig ist oder ist es jetzt fertig für so eine runde spielen dann stand stelle ich das ein versuche mich ein bisschen zu verzögern gleich wir machen jetzt noch eine runde und dann dann probiere ich das mal wobei hat man input display port jetzt muss halt umstöpsel war meine güte ich schmeiß immer diese verlängerung von meinem headset runter ich hoffe ich sind jetzt nicht direkt die oren weggeflogen so ich weiß ich versuche mich mal ein ticken zu verzögern wie geht das jetzt hier mic properties filter delay ok nope ich muss umschalten ich stelle es gleich um muss irgendwo mal gucken wie das geht das game hat keine musik oder diese komische schneiber end das ding bringt das was ab einer gewissen range und manchmal scheint es besser zu sein wenn man jetzt wird gerascht gepascht wenn ich mal sterben bitte das muss man anders spielen aber unser du gewinnt das wir gewinnen das wenn er einfach nichts macht ja das obs ich glaube ich weiß wie das geht da muss ich da muss ich in die in die übertragung settings das geht nicht über irgendwelche filter was der andere du hör ach da ist ein objektiv in der mitte oh mann das ist übelst der noob style ich will mich bewegen please na gut er hat mich jetzt aber nicht gesehen schön von der seite weg gesnackt wuppe lull war das da wahnsinn wie schlecht man werden kann vor allem auf der plattform nicht spiel man hört die gegner irgendwie komisch der wache 23 wir haben aufgeholt leute mp5 jetzt geht's ab Meine güte ist also entweder ist meine reaktion mittlerweile mega beschissen Ach ne ich hab bei ihm gar nicht geschossen oder es ist einfach huge host vorteil des todes Aber ich glaube meine reaktion ist einfach beschissen Ach so fuck man hat ja gar keine. Jetzt war mal huge pass auf huge play Richtig huge play richtig massive massive play Ich glaube dass der modus wenn man mit jemanden spielt mit dem man irgendwie auch im discord ist oder so da ist das glaube ich gar nicht so dumm darauf jetzt wieder gehetschrottet Okay hast schon mal überlegt e-sport mit meinem kram mit meiner krassen performance hier ist es ja auch Fabian will nicht spielen Fabian will nicht wartet mal was ist denn hier was gibt's denn hier eigentlich clan tech Also das ist die übliche geschichte hier kann man wieder custom emblems machen loadouts gibt es nicht weil ganz ganz weit hat man eigentlich den rang habe ich schon irgendwie einen rang profile xx darf mein profile nicht viewen ein profile gibt es nicht zu viewen Oh wieder ruckelmap Ich glaube auf der map ist es vorzulaufen zum auto gar nicht so übel wie geht eigentlich wie kann man eigentlich diesen super super super rennen machen und so Wo ist der dude das sieht auch übelst verwaschen aus na gut das könnte auch bei mir ein bisschen am stream liegen oder weil ich glaube der stream sieht eigentlich ganz gut aus das ruckelt voll die map was der andere war in der mitte der typ afk der typ afk also nicht meiner und auch nicht der der der der andere da steht immer im spawn und macht nichts da ist afk der typ der typ afk das sind beide afk die sind die sind jetzt einfach beide rage quittet achte auch gott das wieder ehren ehrenlose runde der andere schon wieder gelieft wisst ihr was jetzt kann ich mal testen was das für eine waffe ist jetzt ein shotgun ist oder das ist ein singel singel schuss singel schuss so ein bisschen was wie das sniper so sieht aus wie der shotgun ja die die one shot das auch jeder dude ist afk toll tolle runde wahnsinns win sind die 48 fps cap auf dem stream gewollt ja sind sind gewollt reicht und brauche weniger bandbreite muss nämlich gerade mal was gucken in der vorschau weil ich glaube das stream sieht ganz ok aus ja ich sehe kann der vorschau der stream sieht ganz in ordnung aus aber das sieht bei mir übrigens auch verwaschen aus nur das liegt nicht am stream wieso kann er spielen weil ich eine ps4 habe und jeder auf der ps4 die alpha kostenlos spielen kann allerdings oh wieder beste map allerdings dieses problem ist in deutschland du brauchst ps plus wobei die restliche welt oder baumstamm sieht gut aus direkt der die restliche welt braucht kein ps ps plus playstation plus die restliche welt ist da ein bisschen ein bisschen weiter als wir sollen wir rushen jetzt zum auto vor leute es leiden es leiden und sehnix fack man wo ist er tut da ist auch gesagt da war er kaufst du dir eigentlich eine ps5 oder xbox ultimate ich weiß nicht also ich bin ja recht enttäuscht von der letzten konsolengeneration habe ich ja habe ich ja schon ein paar mal erzählt die habe ich mir zum release gekauft und deswegen werde ich mir warten deswegen werde ich fertig mal warten es hat sich für mich überhaupt nicht gelohnt die die xbox one und ist das wieder die das die schneiber oder die die one shot schneiber alle man kann sich null bewegen da ist schon wieder gelieft der typ was ist das was sind das für gegner was sind das für gegner die macht man eigentlich super sprint die macht man eigentlich super sprint man kann auch irgendwie so super sprinten oder ob kommt es automatisch aber in ahnung wenn man einfach nur lang genug sprintet vielleicht was war das denn vielleicht linke stick reindrücken also quasi quasi das probieren wir mal aus der linke stick reindrücken ist ich halte linke stick jetzt gedrückt da passiert überhaupt nichts komisch oder zweimal linke stick nach vorn ich habe keine ahnung ich habe kein schimmer ja und übrigens das game hat wirklich keine musik außer außer im hauptmenü sonst hat es null sonst hat es null musik weder im menü noch sonst vor ja microtransaktion things snoop dock musik dlc ach guck mal hier ist jump tactical super sprint alter playstation bent ich war zu gut a must be signed in the playstation network ich bin im playstation network in gesigned dachte ich zumindest doch psn kackt gerade wieder ab doch psn kackt gerade wieder ab wie das ruckelt oder oder da müsste jetzt mal helfen wie wie beendet man auf der playstation games wie beendet man auf der playstation games dreieck ich habe keine ahnung wie geht das options options close da seht ihr seht ihr mal wie oft ich auf dieser plattform unterwegs bin ja weiß ich mal wie man games beendet wir sind übrigens den game lautstärke soll es gewesen ist das ok ach ja ich wollte mich ja noch moment ich wollte mich ja noch verzögern das mache ich jetzt mal bevor es losgeht x-faces 17 dankeschön twitch prime pock ok input ich muss mich mal kurz auf den pc umstellen und ok ich verzögere mal mikrofon bisschen audio oh fuck das geht gar nicht da wo ich dachte fernst hier konnte man sich ich weiß genau das ging das ging irgendwo in mixer oder irgendwo zink offset hier ist es mikrofon ok zink offset das heißt ich mache das jetzt mal 500 500 millisekunden ich mache das jetzt mal 500 millisekunden langsamer da müssen wir mal gucken wie es funktioniert also mal gucken wie ich wie ob ich jetzt irgendwie verzögert da bin sollte es sollte jetzt besser passen so ich müsste jetzt 500 millisekunden verzögert sein mal wieder monitor umschalten mal gucken ob es besser funktioniert ich will mal mikrofon 500 millisekunden verzögern damit ich zum game sound passend bin alter monitor schalten auf die ps4 um so nicht maus und keyboard an die tastatur ich glaube nicht dass man maus und keyboard einfach so ohne adapter an die ps4 machen kann und dann spielen das glaube ich nicht höchstens halt mit so einem mit irgend so einem sim adapter wobei das gefühl war ganz merkwürdig wird auch erkannt aber nicht in games das wäre nicht anders links schreckt Pock Das kann ich mir nicht vorstellen, dass man in-game direkt an die Playstation per Maus und Tastatur spielen kann Huge Na langsam werden wir warm, hä? Bäm bä bä bäm Easy win, easy life Ja es ist halt ein bisschen, bisschen langsamer als man jetzt irgendwie Call of Duty Deathmatch gewohnt ist Es gibt nur 2 was, es gibt nichts außer diesen Modus und irgendwie 3 Maps Achso jetzt machen wir Big Play Big Play Der kennt sich da hinten einen ab oder? Oh fuck War das hinter uns? Was zum Teufel? Ich war da 2 Sekunden vorher drauf Ah na gut, das war halt durch die Wand, durch die Wand macht weniger Damage Ok, das hat sich mir gefallen Jetzt in die Mitte Nein, nein, fuck Shit, auf jeden Fall Ok, es ist auf jeden Fall eine ziemlich doofe Idee loszurennen, man muss auf dem Weg bleiben wo man am Anfang lang gelaufen ist Doch die Waffen haben sogar Halbwegsrückstoß Alter Mann, wie viel downstairs ist der Come on! Mit den Alten Soke oke alter meine güte gibt's nicht mein ps4 ms so mega für den arsch wir müssen jetzt ein bisschen cs style machen da war er oder? da war er doch okay aber eine ping anzeige wäre trotzdem nicht schlecht. eine ping anzeige hätte schon was der wartet hier auf mich jetzt ich glaube das ist wirklich gut wenn man das mit jemanden spielt zusammen wo man wo man kommunizieren kann weil so hat man ja absolut keine ahnung ob hinter einem frei ist oder nicht also man kann eigentlich gerade ausrushen und gut ist also irgendwelche sachen weil du hast keine infos halt ich höre nix man hört die gegner ganz merkwürdig der wollte dropshotten wollte der dropshotten der typ glaub der wollte dropshotten gerade dropshotten war das easy easy win wie gefällt dir mw bisher eigentlich naja das kann man schlecht sagen es die kotz machen immer bock am anfang ich glaube der modus ist nicht dafür gemacht mit randoms zu spielen das mit dem sim hat geklappt macht das jetzt ich ich mach das jetzt ich stöpsel jetzt gleich mal auf den sim aber das problem ist dass ich das ganz merkwürdig anfühlt mit maus und tastatur emuliert irgendwie wir probieren das wir probieren das jetzt mal aus ich mache jetzt um nicht in die sau war nur muss das gelben beenden also leute das machen wir mal ich habe das ja noch angeschlossen deswegen kann ich auch so schlecht mein expedient ich mache das jetzt mal dran da muss ich erst mal die sim app aufmachen ich mach das jetzt ich mach das jetzt achtung passt passt ich hab's gleich so profil geladen ich brauche kein emulator echt man kann in den einstellungen auf tastatur maus stellen wirklich probieren wir danach aus jetzt will ich erst mal diesen komischen komischen adapter test ja aber ich glaube wenn du mit maus und tastatur spielst da wird na wobei ist doch egal ich wollte gerade sagen man wird nur mit maus und tastatur leuten gemetzt aber das ist ja egal ich spiele alle auf der ps4 das ist übelst gewöhnungsbedürftig leute ja ja ja übelste hardscoper das wird angezeigt wer mit maus mit was spiele ich gerade wo sieht man das ach hier unten mit dem controller klaus oder das Ja, eins, jetzt geht's ab. Au, ich hab mir grad Orangensaft ins Gesicht gespritzt. Oh, das brennt übelst. Boah, KS. Was ist das da? Schub, Schub, Schub, Schub, Schub, Schub, Schub. Oh, fuck, Säure im Auge ist super angenehm. Die sind links. Kann ich rennen? Kann ich rennen? Der kommt jetzt hinter mir, pass auf, da wird das geoutet. War vielleicht der Wallhack oder was? Was, ich hab gewonnen? Ach, der ist gelieft. Der ist gelieft. Deswegen. Wieso gehst du immer auf und ab? Was meinste? Weil ich, weil ich Crapmove mit auf der Konsole hab. Ach so, auf und ab? Weil ich denke, dass das mehr bringt. Denke. Ich hab keine Ahnung, ob das wirklich so ist. Für 60! 7-1, huge Gameplay, direkt YouTube Upload. 2 gegen 1. Wieso eigentlich 48 Bilder pro Sekunde? Weil das menschliche Auge nur 24 sehen kann und ich hab gedacht, wenn man die doppelte Anzahl davon nimmt, dann ist auch für beide Augen ruckelt frei. Nee, zum Bandbreite sparen. Big Brain 5 Head. Ach ja Leute, übrigens passt jetzt mein Gelaber vom Sound her besser zum Game? Seit ich, ich hab's ja, ich hab's ja verzögert, 50 Millisekunden. Jetzt sollte, jetzt sollte es besser hin, hinhauen. All die Klappe. Ich glaube, es müsste jetzt besser passen, wenn ich die 500 Millisekunden nicht verzögert hab. Oh. Decke, lege, Luke. Okay, wo gehen wir jetzt hier lang? Wir machen jetzt hier, wir machen jetzt unseren, wir machen jetzt den, den, den, Rush B, Rush B Taktik. Hits, der hat Hits, die Hits ansagen bringt hier ja nur wirklich nix. Oh, oh, oh, huge, Solo, ja und? Die Plays sind real, ich sag's euch. Woha, MonkaS, MonkaS, wo kam der denn her? Kollege, du bist vollkommen, oh, mein, da ist er, was, wie's rumruckelt, P2P Hosting in 2019, äh, habt ihr das gesehen? Oh, mp5, Achtung hier, hü, hü, pst, ha, easy Solo Carrier, ähm, 5-1, so ist das gut, so mag ich das. P2P, ich glaube, dass es P2P ist, die geben uns ja keine Ping-Anzeige. Haha, Kollege, so nicht, hähähä, den hat man gut, den map find ich gut, die map ruckelt nicht so, und ich hab das Gefühl, auf der map kann man auch die Gegner besser orten vom Sound her. Diese Waldmap ist der übelste Bodensatz, ich hab keine Ahnung, ob das Server sind, ich glaube nicht. Okay, das war zu übertrieben, das war zu in your face, ich bin in beide rein gerannt, das war nix, das war voll übermütig jetzt, ich dachte mir, ja, übelste Kacknoobs einfach mal reinrushen. Aber der Luke macht es schon jetzt, was ruckelt, seht ihr, wie krass der Typ abruckelt, lag switch am Start, er ist mal schön den lag switch angemacht, wir machen jetzt mal was, pass mal auf, huge, big brain play, bam, schreckt, rush B, P90 war das, direkt durch die Mitte und ruff, wupplull, oh nee, jetzt haben wir wieder so ne Kackwaffe am Start, einfach linke Seite, da kommt schon einer, ich seh es, oh fuck, Pfeil Pferd, M, tracking, track attack, protect, attack, track, meine Güte, du schreckst ja alles in dem Gamer, wenn ich nicht mal mit dem PS4 Controller spielen muss, das ist kein Problem, Kamasutra, seht ihr mal, wie merkwürdig die Schrift aussieht, die sieht übelst kaputt aus, die Schrift, ist das als Code 4 Remake gedacht, nee, das ist was eigenständiges, das Ding heißt wahrscheinlich Modern Warfare, wann man damit gut Geld verdienen kann, oh, das ist die Waffe, okay, also wir gehen jetzt auf die, wir gehen jetzt auf die Dinger hier, und on den, und da sehen wir auch gleich ob es einfach geht, ha, schreckt, voll im Kopf, voll im Kopf, nein, Shit, aber ich hab getaggt, Komm Kollege, du machst das, du machst das, du machst das. Jawoll! Schreckt! Sehr gut. Weggekockt. Warum Wallhack? Das ist nur beim Spawn einmalig. Wir gehen jetzt wieder auf die... Okay, der kommt bestimmt von links, ich sag's euch. Oh ne, okay, macht er nicht. Ich glaube, man kann mit dieser Waffe viel schneller schießen, als ich so gedacht hab. Ich hoffe, wir spielen noch ne Runde mit der, ah ne. Jetzt machen wir was, jetzt, jetzt, jetzt machen wir was, jetzt werden sie outplayed, outplayed. Scheiße! Fuck! Ah! Das hätte so gut klappen können. Ich bin voll, oh Gott, ich bin, das, das hätte richtig gut klappen können. Was ist eigentlich auf der Tastatur? Messern. Granaten könnte ich noch mal ein bisschen mehr verwenden. Gib mir den ab. Ich hab übrigens immer noch nicht gecheckt, wie ich Supersprint mache. Jawoll! Und? Das ist, das sieht aus wie Killer aus von Quad 4. Ah! So! Ach meine Güte ey, ich spiel viel, ich, ich, ich bin voll sinnlos am reinrushen gerade ey. Weil wir die letzten Runden so geowned haben, denk ich mir jetzt die ganze Zeit so, ah ja, Yolo drauf wird schon ein bisschen ordentlicher spielen. Okay, jetzt hab ich gecheckt, wie man sprintet. Das ist schon mal gut. Aber der, der, der Rod, der Riot, der carry uns. Riot carryt uns. Äh, ist der SMG, hä? P7? P7 klingt nach SMG. Ah, meine Güte ey, ich hör die nicht, ich hör die nicht, hörst du null und der hat mich auch nicht gehört. Ey, der Typ geht ab, der Riot, der gedübelst ab. Riot, da geht, da geht, der, der Audi. Ja, das ist, das ist Killer House aus Quad 4. Das sieht original aus irgendwie wie Killer House, aber jetzt kommt die LMG, LMG legit 2-5-8, ah dafür haben wir letzte Runde übelst geowned, bam, tja, gut, so gehts auch. LMG legit, ja LMG kann er. Ich hab das Movement halt null raus irgendwie mit, auf der PS4, also generell, das hab ich eben, eben noch mal gespielt. LMG legit, das kann er. Recht ist, die sind rechts. What? Du hörst die nicht, du hörst die nicht, der war recht, der war irgendwo rechts, rechts im Container, ey, laut dem Sound, du hörst den nicht, Achtung jetzt, ja, the fuck, wie geht das, wir haben beide vor uns gestanden und volle Ladung Shotgun in die Fresse, was ist das denn? Und ich hab einen euch, mit des Game, das krägt mich schon wieder auf, kann mir das irgendjemand erklären? The fuck, wenigstens geht hier Riot, was ist das, was ist das, alter geh weg, geh weg, du kannst dich null bewegen, ja, der ist über uns, okay, ey ey ey, outplayed, outsmarted, der im Tür, okay, die Runde haben wir gesagt, das Game kommt November, oder? Ist ne Perk, okay, ja, kann sein, aber ich hab jetzt zumindest gecheckt, wie man supersprintet. Ach hier sieht man, ach hier guckt mal Leute, hier sieht man, wer mit was spielt, ob Controller oder Maus in Tastatur, ich glaub da neben sieht man es, man wird wahrscheinlich nur mit den Leuten gematcht, die das gleiche spielen, okay, ich glaube das wird schnell langweilig, ich mein es gibt, was, vier, drei, drei, es gibt die Waldmap, die Map, die Killhausmap und was sonst noch, ich glaub das war es, oder? Achtung wir machen das wieder bigprane, bigprane, okay, die kommen rechts, die kommen rechts, okay, okay, das sind die übelsten Tryhards Leute, das hast du schon gesehen, wie die rumjumpen, das hast du schon gesehen, wir machen jetzt wieder middle, middle rush, was? Echt, wo muss das sein, oh Schneiber, oh Schneiber, Schneiber, Schneiber, Schneiber, Schneiber Action, was, was, ich hab bei dem nicht mal geschossen, was zum Teufel ist das wieder für ne Kacke, p2p-hosting-dreck alter, was ist das, habt ihr den Müll gesehen gerade, ich war so was von drauf, ich hab dem so ins Gesicht geschossen, Achtung noch mal, Achtung huge, huge play. Ach meine Fresse ey, das gibt's doch nicht, ah danke, klar, das hat schon, kein quickscope, 60 quickscopes, normale quickscopes gibt's nicht, what, von, von wo, damn, okay, okay, bam, wrecked, ich darf mal nicht so auf die Finger hauen, einfach mal abgewartet, 5-3, okay, was, was zum Teufel trifft mich hier die ganze Zeit, ach da oben, ah shit, da kann man ja hoch, das ist eigentlich ne gute Idee, das muss ich mir merken, können wir auf unserer Seite auch machen, okay wir können das gewinnen, wir können das gewinnen, ich muss, ich muss die nur, ich muss die nur hauen, alle, okay, Assault rifle, fuck, Alter was ist das, was ist das, noob tubed, ich wurde noob tubed, oder, kann das sein, kann das sein, dass ich gerade noob tubed wurde, nee, nee wurde ich nicht, was denn dann, ich wurde noob tubed, Achtung, Mittelrat, jetzt, jetzt, gut, gut, play, oh nee, schon wieder genoob tubed, gibt's doch nicht ey, das gibt's doch nicht, oh, na gut, sag gut, was willst du machen, du kannst nur den 2 on 2 Modus spielen, auf nur den gleichen 3 Maps, ähm, tja, also läuft's in 30 oder 60, also es hat auf jeden Fall deutliche Drops unter 30, bei dem, auf manchen, in manchen Situationen, ähm, also ich würd eher 30 sagen, aber eigentlich läuft COD immer in 60, wahrscheinlich, 60, wahrscheinlich doch 60, ich würd sagen normalerweise sind 60, doch, das sind 60, 60, wobei, das fühlt sich schon ziemlich lackey an, ist das so seh, oh, wir haben diese komische, diese komische, ähm, Singleschuss Sniper, Achtung, die, die werden jetzt geohnt in der Mitte, wir straven jetzt links raus und one shot'n' i2, wat, hinter mir, jawoll, wallhack confirmed, tschu, tschu, tschu, tschu, tschu, ist das überhaupt ne Singleschuss Waffe, oder könnt ich die einfach durchdrücken, ok, jetzt strafen wir rechts raus und one shot'n' was, Moment, ich muss mich heilen, na gut, da kannste nix machen, Spritze ist Q, wenn man's ausgerüstet hat, das ist random, das, das Loadout ist komplett random, jetzt hab ich auf Q, jetzt hab ich hier, äh, was heißt Q, äh, Q halt, keine Ahnung, was das gemapped ist, was, alter, wo die alle immer herkommen, ey, aus dem Ruckels zwischendurch, ja, LW Flip, so sieht's aus, es fühlt sich langsam an, ja, doch, es fühlt sich an, das ist aber gar nicht mal so übel, was willst du da machen, wenn du von beiden Seiten gerusht wirst, da machst du nix, was, was, was willst du da machen, ne, 1M14, Achtung, ich weiß nicht, wisst ihr, was wir jetzt machen, ich hab keine Ahnung, wie du mich so schnell bashen, ich hab kein, kein, kein Placentschürmer, wie das, wie das Fonster, gibt nur 3 Maps, was, da war ich doch überhaupt nicht, es gibt nur 3 Maps, ja, ok, kein Schürmer, aber ich glaube, es gibt nur 3, ja, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, Jetzt so What the fuck Was geht mir den Tuts ab Alter Was soll ich denn da machen Also ich war im Team 07 Was geht mir den ab Ja ja Voice Chat ist an, aber ich habe Voice Chat aus Ne ich mach nicht Voice an Voice ist in jedem Multiplayer zu Voice übelst toxic Das war auch XXSkullXX Oh ja 360Skull Oh da kennt mir den ernsthaft Motionplur Oh ja Motionplur muss aus Falls Motionplur wirklich ausgestellt werden kann Ne geht nicht weil General Ah doch weg Weg Okay Also ich muss euch sagen Die Map wie wir vorher gespielt haben Diese Ja die die die Die halt vorher die war besser Der wollt mich noobtuben Man hört die echt null Man hört die Gegner gar nicht Zumindest nicht da wo sie angeblich sind Gibt es noch Selfie, ja wenn man es ausgerüstet hat Aber die Zusammensetzung von Waffen Und Gadgets ist ja ziemlich random Rechts Outplayed Outplayed des Todes Ja Okay Okay Okay Okay Okay Okay Okay Okay Okay Okay Okay Okay Okay Okay Achtung Grenade Der ist oben Ich hab irgendwie das Gefühl, also entweder bin ich echt, also meine Reaktionen sucken einfach nur oder es ist wieder P2P, weil bei dem hab ich wieder nicht geschossen. Ich glaube es ist P2P, Suckerkacke. Richtig Boomer. Damn. Der oben, ich glaub der ist oben oder? Voll ins Knie. Was für ein Skyrim. Achtung jetzt hier, huge play. Bam, huge play. Aber halt was für ein Aim. Was macht der sich von mir killen lassen, keine Ahnung. Ruhig Schneiber, Schneiber. Links raus Draven und. Ha. 10 2, das war doch mal ne Runde. 10 2, so muss das sein. Der andere ist gleich wieder instant rage. Jetzt kommt der Chopper Gunner. Erst mal Chopper Gunner rausholen. Wobei Chopper Gunner kann man schlecht nachmachen. Das war er. Der Two Eats Clan. Mal gucken ob es wirklich Two Eats wird jetzt. Auch wieder diese Drecks Map. Oh Two Eats ist bei mir, der hat schon so ein Pro Namen. Achmed Mubarak 4411. Da kann nichts schief gehen. Wir machen Big Brain Play. Wir switchen Pistole. Und treffen nix. Ich fand das Play sinnvoll. Wir switchen wieder Pistole. Sag mal kann ich Pistole was hitten. Au. Musste weiter mal weg. Piss dich alle. Der ist da oben irgendwo. Was zum Teufel, ich hab den gar nicht gesehen. Ich hab ihn nicht gesehen. Ach von hinten. Ha. Fuck. Outplayed. Huge Outplayed. Mega Outplayed. Der ist da hinten, der ist immer noch da. Der Dude ist immer noch dahinter. Ja der ist gehitted, Gott. Ja nur diesen einen Modus. Ja nur diesen einen Modus. Das sackt ein bisschen. Ich bin headset, ich hab einen MMX 300. Der ist fett gehittert. Au. Der ist oben gewesen. Erwischt. Two Piece. Wie kommt das so anspielend, hat's jedem in der PS4 keiner spielen. Und ja der Sound ist mega komisch. Wir müssen gleich mal, erinnert mich mal bitte dran, dass wir in die Soundsettings gehen gleich. Wir gehen gleich in die Soundsettings. What the fuck. Lol. Der muss zum Objective. Links, links, links. Oder? Ich hab links gehört. Ja I'm Objective ist der Typ. I'm Objective, I'm Objective. Oder? Da links, links. Da ist er doch, ich seh ihn doch. Ah. Die Maps sind viel zu klein. Ah. Pst. Du hörst die Gegner so merkwürdig. Ich hab den von hinten gehört, aber, aber drei Kilometer weg ey. Und auf einmal ist er hinter einem. Wartet mal. Kann man irgendwas? Kann man? Nee jetzt nicht, das in der Runde suckt. Oh jetzt kommt Pistolenstells. Okay. Ha, wie ich vorbei gerannt bin. Der macht das jetzt da. Der, der Achmed, der Achmed macht das. Komm Achmed, Achmed, Achmed, Achmed, Achmed. Achmed, Achmed please. Nein. Achmed macht das nicht. Okay jetzt müssen wir was reißen. Jetzt müssen wir was reißen. Die F4, das können wir nicht auf uns sitzen lassen. Wo? Ha, erwischt. Eats clap. Okay. Äh, gut. Ha, wenn die alle zu mir kommen ist er auch in Ordnung. Oh, huge. Zweiter, zweiter Schuss, der war ja richtig. Jaja, ich hab jetzt diesen komischen Adapter dran. Ich hab mir mit PS4 Controllers sowas von krass gesagt ey. Ich sage jetzt zwar immer noch. Kann er mal sterben? Er ist oben. Big brain. Naja, wenn man sich hinkniet, dann hört man es irgendwie besser, warum auch immer. Nee, hab ich noch nicht. Herz 93. 10-4, damit kann ich leben. Also wenn die Games immer in der Kategorie sind, kann man sich wirklich nicht beschweren. 10-4, zwei Assists, so ist das doch gut. Ist eigentlich In-Game-Lautstärke gut? USB. In-Game-Lautstärke gut und sonst passt das alles. Nice. Übrigens, ne, Leute. Genau, Farmas mit Tigerstreifen. Übrigens Leute, wir haben ein Emote jetzt für alle Subs, nur mal so, ne. Für alle die es noch nicht mitgekriegt haben. Spielt sich das so wie früher? Nö. Das ist wieder die Single-Single-Schuss. Okay, wir gehen jetzt, wir pushen jetzt rechts über das Ding und stellsen sie voll weg. Achtung. Da oben ist er, ich seh ihn. Hä? Äh, ja, das war dumm. Soundsetting, Soundsetting sollen wir gucken, richtig. Äh, Options, Sound. Äh, Mute, Controller, Sound, okay, Audio Mix, Flat. Okay, was ist Flat? Headphones, Headphones. Headphones ist besser. Das hört sich schon viel besser an. Was auch immer Flat war. Ja, das hört... Kann mir mal irgendjemand erklären warum ich die nicht hitte? Ich seh die überhaupt nicht richtig. Hallo, Maus. Die hat sich nicht gedreht nach links gerade. Das ist keine Shotgun. Das ist dieses Range-Ding, oder? Äh. Och Mann, der Typ ist wieder gelieft. Das sagt doch. Wisst ihr was, wir liefen jetzt auch. Wie lief man? Options. Mein, wozu sollen wir drin bleiben? Two-on-one ist kacke. Guck mal, was gibt's denn nochmal für Sound-Settings hier? The Infinity-One-Mix. Each Mix Changes Sound-Balancing. Dann wäre es doch sinnvoll, die Dinger nicht Headphones One, Two, Three zu nennen, sondern danach, was wir tun, oder? Ich wusste gar nicht, dass der Controller Sounds macht. Weiter geht's. Ich würde mal interessieren, wie viel Neues mal 0,9. Dankeschön. Leute, ich kann leider nicht nachgucken, wer alles gesubbt hat. Falls ich irgendjemand vergessen hab, zu erwähnen. Dankeschön für den Sub. Ich guck nachher nochmal nach. Ich hab letztens übrigens eine 25-Dollar-Donation verpasst und ich hab mein Donation-Link jetzt auch rausgenommen, weil die Donation-Anzeige kaputt ist. Die mach ich erst wieder rein, während die Donation drin ist. Also falls derjenige zuguckt, der mir 25 Euro doniert hat, Dankeschön für die 25 Euro. Es hat's leider nicht angezeigt. Okay, jetzt machen wir wieder unsere Huge-Brain-Taktik. Achtung, passt mal auf. Huge-Brain. Ich zeig's euch jetzt. Oh nee, er hat mich geplockt. Das war Huge-Brain. Das war richtig Huge-Brain. Mit dem Unterschied, dass er mich gekillt hat. Das war richtig Huge-Brain umflankt. Nicht Next Level, aber nicht Next Level genug. Ach, wir haben wieder ein Noob-Tube. Jetzt aber. Ich will, dass es mal klappt. Scheiße, man. Die machen das gut. Die machen das echt nicht übel, die Gegner. Hat jemand von euch eine PS4 Pro? Und hat das schon mal gespielt? Oh, jetzt hat er sie geohnt. Mich würde interessieren, ob die Auflösung besser ist. Okay, jetzt sind wir auf der Seite. Jetzt mal was, ich hab ne Idee. Haha, erwischt. Outplayed. Ace, genau. Mal noch mal, das hat eigentlich ganz gut funktioniert. Okay, so gehts auch. Outcamped. Haben uns die Typen die erste Runde auch? Die erste Runde haben die Typen einfach im Spawn gestanden und nichts gemacht. So, mal gucken, ob jetzt meine Special-Tactic funktioniert. Die muss doch irgendwann mal klappen. Fuck. Nein. Okay, du machst das. Alter, du machst das. Nein, macht er nicht. Drei, zwei. Übelster Skill-Action. Okay, jetzt geh mal rechts. Ah, der Slider-Antin müsste ich noch mal öfters verwenden. Fuck, ich kacknup, äh. Muss man mal merken, wo die Dinger sind, wo man sich dahinter stellen kann auf der Map. Die stehen immer offen und die Gegner stehen immer in der Deckung. Das ist übelst nicht Five Head. Das ist Low-Low-IQ-Place. Okay, outsplayed. Wow. Du machst das, Kollege, du machst das. Easy, easy win. Warum war das kein Hit? Warum war das denn gerade kein Hit? Rechts, rechts, rechts, rechts, rechts. Ich höre ihn rechts, Kollege. Ja, schreckt. Jetzt müssen wir auftreten, Leute. Letzte Runde haben wir auch erst ein paar Runden gesucked und dann 10-4. Achtung, wir machen das jetzt anders. Fuck. Hol mal den Friseur ran, ich glaube nicht, dass der spielen will. Ich glaube nicht, dass der spielen will. Okay, Shotgun Action. Ach. Ah, das. Man müsste mal diesen, diesen super, super Rennspeed verwenden. Den benutze ich so gut wie nie. Der Friseur will nicht, kann es vergessen, er muss Black Desert spielen. 5-6. Aber wir haben alle, guck mal, wir sucken alle. Wobei, 50-50, K.D. ist nicht schlecht gegen halbwegs gescheite Gegner. Okay, da hinten ist einer, der kommt jetzt gleich, ja? Hit. Ach, die machen das mit der Pistole. Ich musste unbedingt noch mehr spielen. Das ist eigentlich richtig dämlich gewesen. Ich habe den dreimal getroffen, hätte ich den dreimal mit der Pistole getroffen, dann wäre er dahin gewesen. Oh, nice. Wow. Huge, der geht ab. Hier. YZ54. Jawoll. 5-5. Jetzt kommt es drauf an. Bis jetzt macht es Bock, aber CoD macht immer Bock, wenn es neu ist. Das wird aber nicht lange halten. Ich meine, drei Maps an einem Spiel, das ist ein bisschen, ein bisschen, ein bisschen suck. Wie, man muss nicht mit... Ich habe es übrigens immer noch nicht gecheckt, ob das jetzt ein Shotgun ist oder nicht. Nice. Das war die Spitzrunde. Damals hat Black Ops 1, ja nice, nice. Ja, ich habe ja auch überhaupt keine Ankündigung gemacht, weder auf Twitter, noch auf YouTube, irgendetwas anzurufen, dass heute CoD gespielt wird. Es macht schon Bock. Manchmal bugt die Lobby. Macht schon Bock. Aber ich glaube halt, also wenn wir das heute jetzt noch ein bisschen spielen, und vielleicht morgen noch eine Runde, ich glaube, dann ist die Luft raus aus, wie gesagt, drei Maps an einem Spielmodus. Acey130, habe ich nicht ausgerüstet, ich habe nur Chopper Gunner. Chopper Gunner, Hunde und Black Hawk. Gibt es irgendwann eine PC-Beta? Ich glaube, am 9. September oder so. Warst du mal wieder mit Kabum beim Chinesen? Mal wieder schon, das ist aber auch schon ein Jahr oder so her. PC-Beta gibt es glaube ich 9. September, 19.19 glaube ich, 19. September. Oh nee, Sucker-Map. Ah, Shotgun. Gut, Shotgun. Wir machen das jetzt anders. Wir gehen jetzt auf Pistole, gehen hier vorne hin und Shootern schon mal was weg. Da lebt nur noch einer, da kann er nur noch hier sein, nice. Nice, so muss das sein. Oder da, Hardscope da. Ich kann mich an das Homefront Gewinnspiel mit dem Sniper-Gameplay erinnern. Dunkel, ich weiß aber nicht mehr, was da gewesen ist. Boah, da hätte ich nicht mit der Pistole reinlaufen sollen. Das war richtig schreckt. Das war eine ordentliche Waffe. Es ruckelt. Der andere kommt links. Also ich habe keine Ahnung, wie der das überlebt hat. Sinali, Dankeschön. Also hallo an alle Sinali-Zuschauer, wer sehen will, wer Karibels abkackt, diese Runde. Aber wer gecarried wird von Hi, I'm Mori, der ist hier richtig. Jetzt aber hier. Wir machen jetzt mal anders, wir gehen jetzt auch mal links. Ich glaube das ist... Also mit die Mitte. Der ist noch links, der ist noch links. Tja, Kollege, so nicht. Du hast dann das beste Sniper-Gameplay verloren, mein Bruder hat das gewonnen. Homefront? Was gab's denn zu gewinnen damals? Ein Game, das Spiel? Oh, Sniper, Sniper end, Sniper end, Achtung jetzt hier. Huge, huge Sniper. Huge Sniper. Oh fuck. Was zum... Moment, was hat man hier am Start? Ok, was auch immer. Ich dachte, ich habe es gegen die Kiste geworfen. Da ist er. Fuck. What? Wie ist der denn so schnell da hingekommen jetzt? Ja, ja, ja, fuck, Alter, richtig reingesackt. Ich wollte eigentlich auch direkt zum Objective rennen. Ich dachte, wenn er mich anhittet, dann kann er nicht so schnell in der Mitte sein, aber ist er doch. Das ist so schlecht. Das ist der Wahnsinn. Wie kann man so scheiße sein? Wollen wir jetzt wieder aufdrehen, wieder, jetzt acht Kills in Runde. Ach, Overtime war fertig. Das war gar nicht das Objective. Was denn war? Ok, was auch immer. Oh fuck, das ist die Spritze, ich habe eine Spritze, ich wollte gar keinen. Ok, Gott. Jetzt wird aufgedreht, muss aufgedreht werden. Ist am abkacken. Da bist du manchmal die Zeiten von YouTube, ja doch, wie es früher gewesen ist, dann definitiv, aber so wie YouTube aktuell ist, nicht. Das ruckelt übelst die Map, zack, huge. Der war hier in der Mitte, oh ne, schon wieder die Kackspritze, bin dann oben, ich dachte, ich habe. Haha, prefire, bam, outplayed. Doch, also ich vermisse das schon, wie es früher auf YouTube gewesen ist, aber aktuell auf YouTube ist es nicht. Ah, hittet, hittet, hittet. Wer ist da immer noch da, der Typ? Ah, ging doch noch, letzten Runden war wieder besser. Kommen keine Videos mehr? Doch, auf jeden Fall gibt es noch Videos, allerdings weiß nicht wann. Ich werde nicht meinen Account löschen oder sowas blödes. Ich meine, allein schon, ganz ehrlich, wenn ich mir den YouTube Deutschland so angucke, was ich da vorgeschlagen habe, irgendwelche Unge-Reaction-Videos. Unge ist ja auch irgendwie zu dem geworden, was er früher nicht leiden konnte. Und noch viel mehr, also Deutschland kann so übelst knicken, ja, übelst knicken. Im internationalen Bereich finde ich, hast du bessere Chancen, was zu finden, als in Deutschland. Also, es heißt nicht, dass es in Deutschland nichts Gescheites gibt, es gibt auch durchaus die einen oder anderen gescheiten Videos. Aber ich finde, du hast einfach vom Verhältnis von Bullshit zu nicht Bullshit, ist das in Deutschland schlecht. Übrigens, die Granaten gibt es nur am Anfang nicht, weil die Maps dann broken werden. Okay, ich habe den Typ nicht einmal getroffen, ne. Hör auf zu schnaufen, ja. Jetzt erwischen wir einen. Was, warum zum Teufel trifft das immer nicht richtig? Das ist, ja, das ist der Max, der Max der gerade mit 01 übelst, kacke ist er auch. Das ist der Max, ja. Jawoll, jawoll, Kollege, du machst das. Ja, sehr schön. Übrigens, die Pistole ist übelst verbackt. Ihr habt das gerade nicht gemerkt, weil man sieht das nur, wenn man klickt oder wenn man knopfelt. Wenn du schnell tappst bei der Pistole, dann QT die Schüsse und schießt nicht einfach, hört nicht einfach auf zu schießen. Oh meine Güte, ich bin so schlecht gerade. Bäm, weg in YouTube. Was meint ihr, wie ist unser Verhältnis, so Win-Loss? So 80 Wins, 20 Loss ungefähr, hä? Ist der Eindruck so? Es macht Spaß, aber man kann null sagen zu. Okay, keine Ahnung, was das wieder gewesen ist. Das, das Kraft, das glaube ich dir nicht. Jemand der 03 abkackt, dem ist nicht schön zuzugucken. Ich weiß manchmal nicht, wie ich da spielen soll irgendwie. Kommen wir noch eine Runde Shotgun? Jawoll, weggeschotgunnt, so muss das sein. Jetzt kann man wieder zugucken. Man muss das eigentlich komplett ohne Scope spielen, das ist halt eine stinknormale Shotgun. Der ist oben. Der ist unten. Ja, jetzt hat man wenigstens gut gehört. Du bist nicht Max, doch, bin ich. Immer guck meinen Avatar an und guck den Subscriber Avatar an. Wie gefällt dir das Spiel, das macht Bock. Ha, in den Kopf, jetzt machen wir was, jetzt machen wir was Leute. Fuck, von der Idee her war es nicht schlecht. Ich wollte eigentlich mit der Shotgun da rüberjumpen, genauso wie der Typ ungefähr. Das war auch mein Plan, bloß dass er schon gestoppt hat, weil ich noch gerannt bin. Immer wieder Shotgun. Oh, was? Von wo? Übelst gefressen. Dachte, der hat es irgendwie nicht gecheckt. Ach, der Rick ist wieder da, du hast übrigens deinen Sub jetzt, ich habe es hingekriegt noch. Ok, mp5, mp5. Was sollst du da machen, die machen das auch clever, eine von links, eine von rechts. Da machst du nichts. Matchpoint, ok, wir müssen die Runde jetzt gewinnen, wir müssen gewinnen. Das ist gar nicht wirklich viel besser. Decked, defeat, abgekackt. Ups, da kann man eigentlich direkt, direkt leaven, weil warum soll man sich das weiter angucken? Next. Kann man eigentlich mittlerweile was customisern? Rantek, Calling Cards, was haben wir hier so noch? Tyrannosaurus schreckt. Headbang Master Chief. Apex Stels. Bis meine, also ich habe jetzt ein bisschen überlegt, bis meine Emotes alle fertig sind, ich habe ja auf Fiver zwei Leute angeschrieben. Und irgendwie nennen sie es da, ein GIG gebucht bei denen für Emotes, werde ich jetzt einfach ein paar sinnlose Meme Emotes hochladen. Ok, jetzt, jetzt. Der eine ist rechts, das habe ich gesehen. Ich checke das nicht. Da nicht. Ich habe noch keine Emotes. Wir haben auch eine Woche Zeit. Ich sehe die übelst schlechte Giga. Ich frage mich, ob das wirklich einen Vorteil bringt, wenn man eine PS Pro hätte. Ich sehe die übelst schlecht. Und was ich fragen würde ist, ob die PS 4 Pro, ob die flüssiger läuft. Weil gerade auf der Map ist es ganz schön hakelig. Ihr seht es glaube ich zwischendurch, dass es ordentliche Slowdowns hat. Jawoll, jawoll jetzt. Nein. Shit. Liegt an der Map bei mir. Ok, auf der Map ist es besonders auffällig. Fuck, ey. Was willst du denn da machen? Voll in die Fresse. Ihr habt mir jetzt so krass ins Gesicht genaglet gerade. Rechts war er, das sieht man schon. Da jumpt er. Oh, gut. Von hinten, klar. Ah, nice, win. Easy, gut. Beide rechts. Ich sehe nichts. Ey, das ist mega frustrierend gerade. Ich weiß überhaupt nicht, wie ich das richtig spielen soll. Dass die Ur-In-Game echte Zeit anzeigt. Nö. Wo ist der andere tot? Rechts. Oder? Na, da hinten? Hab ich doch richtig gesehen. Muss erst mal gucken, wo da eine Uhr ist. Wo ist da eine Uhr? Keine Uhr. Am Arm. Ach, da am Arm. Da guck ich nicht so genau hin. Ah, Outch 3-3. Der eine carried übelst da drüben, der Fuzzix. Mal gucken, was das jetzt für ein Loadout gibt. MP7 und Dessert-Igel. What? What the fuck? Es ist übelst random. Ich weiß wirklich nicht, wie ich das kontrolliert spielen soll. Geht das noch gar nicht? Der macht wieder das gleiche, ich sag's euch. Der probiert wieder das gleiche. Erwischt. Ok, wo ist der Dude jetzt? Da oben ist er. Ey, es gibt's net. Ich lauf pre-fired um die Ecke und ich bin tot. Was ist das denn? Na gut, der hat besser ge-aimsort. Aber der ist übelst low. Ein Hit und er ist da on. Ja gut, aber wir haben weniger Leben. Kann er relativ gut Sound tun. Ich hab da so meine Probleme. Aber ich glaub, das lag auch an den Sound-Settings am Anfang. Komm jetzt, jetzt wird aufgeholt. Jetzt wird aufgeholt. Oh nee, jetzt kommt diese Shotgun-Geschichte wieder. Ok, der ist schon mal schön angehittet. Was willst du machen? Ist das ein richtiges Kot von der Steuerung? Das ist schon richtig. Sehr klassisch von der Steuerung her. Wie heißt der Typ? Auch wieder unser Lieblings-Special-Killer aus der Map. Ok, das ist die gegen die Haupt-Kampf-Linie. Er ist da noch drinnen. Ha, der war klar. Sobald man weiß, wo die sind, ist das natürlich easy. Nimm Raketenwerfer. Hab ich einen Raketenwerfer? Ja, ich hab einen Raketenwerfer. Ja, das muss man echt ausprobieren. Ok, ich bilde ihn mir ein. Ich war vorher drauf. Aber wahrscheinlich hat er einfach gut Kopf getroffen. Hast ja gerade am Ende am Hitmarker gesehen. Ja, nice. Ach, ist mir nur noch einer übrig. Der ist wieder geraged-quittet, der Typ. Komm, rage-quitten die Leute immer. Rage-quitten wir jetzt auch. 2 gegen 1 ist dumm. Also 2 gegen 1 war echt kein Spaß. Ich finde das auch dumm. Warum? Da können die nice 1 on 1 machen. Oder können es sein lassen. Das Ding heißt ja nicht umsonst 2 gegen 2. Also wenn sie sich irgendwas bei gedacht haben, dann sollte das auch am besten 2 gegen 2 gespielt werden. Ich hatte zwar mal eine Zweifel, ob sie sich wirklich was bei gedacht haben, aber man weiß ja nie. Die Hoffnung stirbt zuletzt. Das ist kein Alpha für Vorstellern. Nee, nee, nee, nee. Das kann jeder. Jeder kann das Spiel mit einer PS4. Jeder. Nee, oder? Instant, instant-quit. Instant-quit. Das ist so dumm. Das ist sinnlos. Ich will das 2 gegen 2 spielen und nicht 1 gegen 2. Zum Download brauchst du PS Plus wohlgemerkt nur mit einem deutschen Account. Wenn du den internationalen Account, also jedes Land außer Deutschland, kann das Ding ohne PlayStation Plus runterladen. Jedes Land außer Deutschland. Und ja, 2 gegen 2. Sehr schön. Der Typ geht garantiert auch hier da oben rausgucken. Wegen Jugendschutz. Was auch immer das jetzt gewesen ist. Der andere ist oben. Ich hab den gesehen. Fuck. Was willst du machen? Zurückschmeißen, etwas können. Nice, nice. Vermaß. Den Kopf. Der ist auf der anderen Seite. Okay, gut. Mir leuchtet das mit Jugendschutz auch nicht ein. Aber das ist die einzige Erklärung, die ich dafür hab. Gott, Alter. Was ist das? Zwei Mal den Kopf geschossen. Nope. Das kann der ganz gut packen. Der muss den ein, zwei mal hinden, dann ist es vorbei. Jawoll, jawoll, komm. Noch. Der macht das, der macht das. Anito. Ah, nee. Antonio, nicht Anito. Was soll halt Anito sein? Antonio, easy win, easy life. Das war übrigens ein Headshot. Laut dem Hitmarker, wenn roter Hitmarker, wenn roter Hitmarker, Treffer, Headshot ist. Jeder links eingesniped, rechts eingesniped, down. Auch. MonkaS. MonkaGiga. Puh. Rage quit, rage quit, stopp. Ach, Quatsch. 6-1. Leute, ich hab nichts gesagt. Ich hab nichts gesagt, die Runde ist vorbei. Ich frag mich, warum die alles so krasses Movement auf der Konsone haben. Ich bin froh, wenn ich zwei Sticks gleichzeitig bedient krieg. Die GG, ja. Ein bisschen Menümusik wär schon nicht übel. Ups, ah, geht weiter. Ah, ich find, das ist die beste Map von den drei. Hill House sagt, dass die Waldmap sackt. Das Ding hier geht halbwegs. Okay, jetzt machen wir den Omega Rush, die Omega Rush Action links rum. Okay, ich hit den zweimal über die Range, passiert nichts, er hält mich zweimal über die Range, bin down. Sehr gut, sehr gut. Immer rechts rum, rechts rum sind wir irgendwie egal. Wisst ihr, wir machen jetzt was anderes. Der ist hittert, der ist richtig gut hittert. Fuck, der andere kommt jetzt. Hit. Der ist noch links rein, oder? Okay, doch. Ja gut, der hatte schon fat Damage drin. Nee, du musst, wenn du Playstation Plus, da musst du deinen Ausweis scannen. Ey, ich versteh das nicht. Ich bin genau wie der auf den drauf, ja. Aber ich verrecke. Es leuchtet mir überhaupt nicht ein. Ich schieb das einfach mal auf sackiges P2P Hosting. Jetzt machen wir unseren berühmten Middle Rush und sterben dabei. Aber rechts, alter, der ist rechts, der ist rechts, Kollege. Bam. Was war das? Okay, warum haben wir gewonnen, wenn die sich gegenseitig killen? Ich check das nicht. Das ist doch. Sehen die mich irgendwie früher oder was? Der hat mich durch den Container laufen sehen. Ich hab ihn nicht gesehen. Das ist so eine typische Cod-Geschichte, die ich einfach nicht checke. Links, links, rechts, links, rechts. Der geht ab. Remco carried uns. Was jetzt wieder? Cod. War das mal anders? Hab ich irgendwas in der Range? Ich seh meinen Ironsight überhaupt nicht. Den hab ich übrigens nicht gehört. Null gehört. Übel swashed ab. Okay, keine Ahnung. Mehr als draufschießen kann ich doch nicht. Schreckt. Alpha Eindrücke. Man kann nichts sagen. Das sind drei Maps, ein Spielmodus. Ich hab übrigens keine Ahnung, ob das P2P Hosting ist oder Dedicated Servers. Es fühlt sich ein bisschen nach P2P Hosting an. Achtung! Da war was. Ich hab was gesehen in der Mitte. Geht doch. Exos. Oh, jetzt werden sie weggeschneibt. Schonmal gleich ins Hardscope gehen. Achtung! Was? Ich dachte, ich hab Nowscoped aus der Hüfte. Der Schuss ist nicht mehr rausgekommen. Achtung, Hardscoped. Okay. Ja gut, der hatte natürlich den Vorteil jetzt. Das ist klar, wenn du einfach nur wartest und stehen bleibst. Wupplull. Aber wir müssen das gewinnen. Gleich ist 5-5. Ich glaub nicht, dass der Typ das gewinnt. Jetzt hier. Jetzt kommt's raus. Mal gucken, was wir für ein Loadout kriegen. Oder Pistol oder so. Achtung, wir gehen jetzt erst mal dahin. Alter, Dude, Dude. Hui. Das ganze Game wirkt unscharf. Also es wirkt übelst schwammig. Also wenn das so bleibt, und du siehst ja dein eigenes Ironsight nicht mal richtig, könnte ich mir vorstellen, dass man tatsächlich einen nicht unerheblichen Vorteil hat, wenn man eine Playstation Pro hat. Das Spiel ist für dich mit Controller räudig. Äh, richtig räudig. Also hat sich's gespielt. Optik mag's? Nee, nicht Optik. Face. Mensch, schon Face. Ja, Motionplay ist aus. Mal kurz gucken. Weg. Der Mist muss weg. Der Mist muss auf jeden Fall weg. Studierst du Dual? Studiere weder Single noch Dual. Wir probieren jetzt mal was. Leute, wir probieren mal was. Wir probieren jetzt mal was. Kommt da hier? Kommt da hier? Nee, Mitte. Okay, gut. Hast du mich gerade erahlt, General? Alter, Lul. Aber was man alles raushören kann. Hinter mir. Fuck, wusste ich. Ich hab's in dem Moment gehört, wo er getrobbt ist. Voll den Arsch geballert. Das ist ja, das ist der Budget. Das ist der Budget CS Modus. Tja, Kollege. Ähm, die Holzbanden, die da sind, die sind sehr, sehr widerständig. Du kannst da so gut wie nicht durchschießen. Du kannst da so gut wie nicht durchschießen durch das Holz hier. Ich geh mal zu meinem Dude. So geht das. Der hat mir das letzte Mal in den Arsch geballert. Jetzt hab ich ihm in den Arsch geballert. Bitte schön, ja. Jetzt. Am Moment ist ja ne Shotgun. Oh, mega Lul. Warum macht der Dude mir über Range so krassen Damage? Ich hab ihn zweimal über Range getroffen und er trifft mich einmal und ich bin fast tot. Kann mir das mir irgendjemand erklären? Das verstehe ich nicht. So spektakulier sieht das Game nicht aus. Ich glaube, es liegt unter anderem daran, dass man auch nicht zusammenspielt. Der andere ist in der Mitte. Ich muss mal zu meinem Dude. Okay, was auch immer. Ich dachte, jetzt kann man's outplayen hier. Ich glaube, der Dude ist oben. Jawoll. Ja, kommt rechts. Was zum Teufel? Wie geht das? Wie geht das? Ich aim den Typ ab, schieß drauf und bei ihm hab ich noch nicht mal geschossen. Ich check das nicht. Also das ist so diese typische Call of Duty-Dinger, die man null kapiert. Sollte es nicht Round One anstelle von Round Wind heißen? Englisch. Es sollt Round Owned heißen. Round Poggers sollte das heißen. Ja, direkt. Okay. Gott. Kann man nur diesen Modus spielen? Ja, leider. Nur diesen Modus und nur drei Maps und keine Perks, Loadouts, Killstreaks, irgendwas. Das ist PS4. Ja, es gibt's ja auch nur auf der PS4. Ich spiel nie PS4, deswegen krieg ich Anfall. Was? Alter! Treff ich die nicht oder was ist das? Ich schieß vorbei, oder Leute? Ich schieß vorbei. Zumindest nicht bewusst. Ich war voll an ihm. Okay, wahrscheinlich. Es ist auch wirklich gewöhnungsbedürftig. Alter, stöhne ich so rum. Ich hör nichts, weil ich lauter gestöhne. Man hört nichts. Es ist so mega für'n Arsch. GachiBase. Was jetzt? Ah, wir haben verloren. Okay. Kaufst du dir das Game? Sieht mega los. Man kann das überhaupt nicht einschätzen. Also ich kaufe es mir auf jeden Fall nicht auf der PS4. Ich hör da was im Voice Chat. Ich will nichts im Voice Chat hören. Auf der Switch? Ja, da. So wie Switcher 3. Man kann es ja mal probieren. Das stöhnt so rum, ich hör nichts. Ah, Mann. Weg strafeln. Also ich muss euch ehrlich sagen, ich sehe auf der PS4 die Gegner extrem schlecht. Normalerweise guckst du hin und du siehst einen Pixel rausgucken und easy spotted. Das kriegen wir noch. Null zwei, Null zwei. Okay. So muss das sein. Was schon? Fast drei Stunden? Waren wir jetzt wieder? War eine ganz gute Strat. Nein. Fuck, Munition leer. Shit. Sonst wäre der gefickt gewesen. Fuck. Ja, aber gut. Wenigstens. Der war angehittet. Der hatte was weiß ich noch. Zehn Leben oder so. Oh, mal eine neue Waffe. Die hatten wir noch nicht. Jetzt, huge, huge. Ah, fuck. Da machst du nichts, wenn die direkt neben dir stehen. Da machst du nichts. Mal gucken, vielleicht finde ich noch ein paar, die ich noch von früher kenne, dass wir mal mit ein paar gescheiten Leuten spielen können. Oh. Move, Alter. Psst. Ha, hui hui. Abgekempt. Was ist mit dem No Scope Faktor? Der ist bei Shotgun ziemlich hoch. Ich hab gerade irgendwie zwei auf einmal verschossen. Hatte keinen Schuss mehr. Irgendwie zwei auf einmal verschossen. Oh, zwei Leben zu ein Leben. Na, das kann ja was werden. Aber der gewinnt, der mit acht Leben. Der kämpft sich jetzt irgendwo in der Ecke. Drei, vier, komm. Das wird, das geht noch. Man muss da Carrie rausgeholt werden. Was zum Teufel? Wie geht das immer? Ist der geslided? Ich hab den überhaupt nicht gesehen. Du kannst die Alpha nicht downloaden, weil du keinen PS Plus hast. Du kannst die Alpha nicht downloaden, weil du keinen PS Plus hast. Oder halt, also du brauchst, in Deutschland brauchst du PlayStation Plus, weil Jugendschutz, was auch immer. Und international reicht's, wenn du einfach downloadest. Okay, Luft ist raus, Leute. Luft ist raus. Oh, wir haben gewonnen. Easy. Du kannst den dann fake, mach's wie ich. Mach dir einen fake account in England. Ein englischer fake account. Warte nicht, war kein Hit. War kein Hit. Ich check's nicht. Das, warum war das kein Hit? Das war voll drauf. Sag mal Leute, schieße ich wirklich vorbei? Vom Gefühl her treffe ich das, aber vielleicht sieht das, ihr seht das besser im Stream. Aber meiner Meinung nach war ich gerade voll auf dem Bein. Ja, ihr seht das besser. Selbst sieht man das immer schlecht. Du brauchst zum Online-Spielen keinen PlayStation Plus. Du brauchst nur in Deutschland zum Downloaden PlayStation Plus. Das ist big brain. Zum Spielen brauchst du keinen PlayStation Plus, nur zum Downloaden. Das ist richtig Pfeif her. Weil Jugendschutz. Wir sind das einzige Land wahrscheinlich, was so ein Müll braucht. Was wäre Cod ohne Mini-Rage nach dem Tode? Ja, die Tode sind auch so merkwürdig teilweise. Wo du dir so denkst, irgendwie das kann's doch nicht gewesen sein. Die Waffe ist schepp. Die Waffe ist schepp. Ich hab am Übrigen auch schon wieder geschossen, aber hatte keine Ahnung. Ich glaub die Luft ist raus. Die Runde spielen wir noch. Das hast du auch in der Beta vom letzten Cod gesagt. Ja, das ist halt auch immer so. Du brauchst PlayStation Plus zum Unterladen. Gut. War ich jetzt wieder nicht drauf? Mit Emulator spiel ich gerade. Achso, der hat's überlebt. Okay, weil es hat keinen Hitmarker gegeben. So, wir stürmen jetzt einfach drauf. Scheiß auf Taktik. In your face. Was? Ich hab irgendwie noch nicht einen Nahkampfangriff gemacht. Was ist das überhaupt? V? Ja. Ah, E. Ich hab keinen Bock mehr, Leute. Ich krieg nix geschissen, ey. Sobald der Typ geflasht war. Es ist übelst frustrierend, wenn man mal was gerockt hat irgendwie und dann so scheiße ist. Voll auf dem Sack. Jawoll. Einfach die ganze Zeit scheißen. Das ist Next Level. So geht das ja. So macht das ja Bock. Ich glaub, ich muss mir auch mal angewöhnen, den Slide mehr zu verwenden. Sitzt du im Rollstuhl? Was? Warum? Ich hab einfach jahrelang nix gespielt. Also kein Cut und keine Shooter allgemein. Und vor allem schon gar nicht mal PS4. Der Dude muss da rauskommen, klar. Ja, Outplayed. Jetzt klappt's ja. Jetzt funktioniert's. Jetzt werden wir mal schon ne Runde campen. Der andere kam links irgendwo, ne? Äh, an was ist der denn? An was ist der denn jetzt verreckt? An der Flash? Nee, an der Semtex. Adam sucht mal. RIP. Bäm. Weggeschottet. Geschottgammt. Oh, Schneiber. Schneiber-Action-8 jetzt. Jutsch Schneiber. Da schleicht sich noch ein anderer Dude hier ran bestimmt, oder? Mein Gott, ey, das kann doch nicht sein, dass wir laufen von allen Seiten geowned werden. Shit. Okay, nächste Runde müssen wir gewinnen. Sollte mich gar nicht mit diesem komischen Schneiber-Stell auffallen. Einfach hier M13 raus und in your face. Ach, fuck. Kacke, ey. So dämlich. Kommt das alte MW-Feeling auf? Nee, das kommt glaub ich eher Intim-Deathmatch auf. Nicht wirklich. Das ist auch ein bisschen doof mit zwei, ähm, nur zwei Basis, zwei und, und nur drei Maps. Sack, sackt schon ein bisschen, ja. Gibt es dedicated servers? Wahrscheinlich. Es fühlt, also manche Kills fühlen sich übelst Bullshit-mäßig an und man kriegt natürlich auch mal wieder keine Lack-Anzeige, also keine Ping-Anzeige, was ja schon mal richtiger Müll ist. Ich glaube, dass eine Ping-Anzeige bei ganz vielen Sachen dazu führen würde, dass man sich weniger aufregt, weil du hast so diese merkt, diese typischen Cod-Tode, wo du halt, wo du halt weißt, du hast getroffen und, und irgendwie hast du nicht. Und wenn du halt wenigstens eine Ping-Anzeige hättest, dann könntest du dir das so halbwegs erklären, wo das Problem liegt. Vor allem, wo, wo ist eigentlich das Problem, eine Ping-Anzeige anzubauen? Ich meine ernsthaft. Wo, wo, wo, was ist, was, wo, was, hä? Also, warum? Das ruckelt, die map, die ruckelt. Da hinten ist er übrigens. Hallo. Hui, hui, hui, HD. Vielleicht ist der Ping meistens Müll und soll keiner sehen, also wenn die wirklich ordentliche Server am Start haben, sollte der Ping eigentlich nicht Müll sein. Nup, tup, nup, tup. Ah, nup, tup. Lul. ASMR Kinder Fondue. So, so. Ja, Cod ist ja auch übrigens der ASMR-Content. Rechts, ich hab rechts was gehört, glaube ich. Nee, links. Da sieht man mal, wie merkwürdig der Sound ist, ne? Hab ich vielleicht meinen Headset falsch rum? Oh, und deswegen ist der Sound so komisch. Oh, nur Pistole. Einfach mal weggesprayt. Ja, es gibt ja noch nicht mal Balken. Komm, wir gucken mal, kann man eine Ping-Anzeige einschalten? Wow, oh mein, das geht weiter. Fuck. Pistisch, Alter. Meine Güte, gibt's doch nicht. Ins Knie, jawoll. One-Shot ins Knie. Vermaß. Pass mal auf, wir machen jetzt Trick 17. Aha. Ich seh die Ficker nicht. Ich seh sie einfach nicht. Das ist so schwammig. Ich seh sie nicht. Warum hat der, dass der mich überhaupt gesehen hat da oben? Ich seh sie nicht. Ich mach das nur am Hand vom Soundfest, wo er her schießt. Ich seh nix. Ich seh null, wo der hin schießt. Habt ihr da irgendwas gesehen gerade? Der muss anhaben. Ich seh sie nicht. Okay, 3-3. Oh, jetzt wieder diese komische Schrecktwaffe. Moment, was ist geht? Molotov werfen, so. Das war mal was, oder? Und das war meiner Meinung nach drauf, aber nicht. Aber das war nice. Der Jumpshot war nice, oder? Muss man zugeben. Achtung, Achtung, wir machen jetzt Trick 17. Ja. Hat er den jetzt erwischt? Oder den anderen? Jawoll. Trick 17 fängt an zu brennen. Tricks gefühlt auch nicht immer ein Hitmarker, wenn du drauffasst. Das fühl ich seit der, das kommt mir seit der ersten Runde so vor. Das sind teilweise ganz merkwürdige Hits oder manchmal triffst du Dinge, wo du denkst, ne, nie im Leben. Das ist jetzt ne richtige Shotgun, ne? Was? What the fuck? Was zum Teufel? Ich hab den zweimal gehadet mit der Pistole. Es war ein Shot, aber ich mit der Shotgun über den, oh Gott, äh. Die kann irgendwie mal um drei Kilometer mit der Shotgun schießen. Richtig nett. Jetzt muss man gewinnen. Wir warten jetzt kurz und dann geht die Flash rein. Okay. Ich, ich, ich geb's auf über die Range mit was zu machen. Ich verlier über Range alles. Weiß nicht so genau warum, aber irgendwie jetzt über Range krieg ich, krieg ich nichts tot mit den Dingern und sterb jedes Mal. Okay, final round. Oh, ordentlich Waffe, jawoll, nice. Ich mein, wie oft, wie oft muss ich treffen? Fickt euch mal, ey, meine Güte. Max, den Weitemann nicht, geh jetzt auf. Mach jetzt Schluss. Ich hab jetzt drei Stunden gespielt, das reicht mir. Komm, komm, das kriegst du hin. Das kriegst du hin. Easy win, easy win. Seht ihr wie das rumrockelt? Nee, ich geh jetzt wirklich auf drei Stunden reicht mir. Du bist frustriert, ich hab links was gehört. Da ist er, da ist er. Was machen die dann da? Win. Ja, morgen können wir eine Runde spielen. Wie kommst du so mit dem, generell mit PS4 klar? Ich hab übelst mal eine Probleme. Total ungewohnt, ja. Ich hab ja so einen Adapter, wo man auch mit Xbox spielen kann, aber generell ist halt, Playstation Aim ist halt gefühlt, also das liegt glaube ich irgendwie am Controller, aber selbst wenn ich den Xbox Controller an die Playstation mach, ist das eher Scheibenwischer, wohingegen Xbox halt direkt ist. Morgen mach ich Tastatur und Maus dran. Oh fuck, ich war noch in der Queue. Morgen mach ich Tastatur und Maus dran und dann probieren wir mal aus, wie sich damit auf der PS4 spielt. Wenn das denn überhaupt geht, haben jetzt so viele gesagt im Chat schon, das funktioniert. So, jetzt machen wir wieder Trick 17, Achtung. Nee, oder? Alter, was ist das wieder? Übelst nice. Plates gemacht und dann wirst du hier abgefarmt. Zweimal wieder, das fand ich eigentlich ganz sinnvoll. Der andere flankt rechts. Okay, da hab ich jetzt vorbei geschossen. Ich reg mich ja nicht bei allem auf. Wenn ich selbst vorbei schieße, ist das okay. Oh, Schneiber, Schneiber. Hardscope, Hardscope. What? Jetzt könnt ihr mir nicht erzählen, dass das nicht drauf war. Das kann mir keiner erzählen, dass das nicht drauf war. Wir machen das jetzt anders. Wir packen jetzt die Pistole aus und rushen die. Hat keinen Sinn. Ich will eine Ping-Anzeige, ohne Scheiße, ich will eine Ping-Anzeige. Weil ich hab bei dem noch nicht mal geschossen wieder. Ich will eine Ping-Anzeige. BTF, ist das wieder? Da kommt der Geschleide, der Tote. Die machen das aber auch sinnig, die Gegner, das merkste. Du merkst gleich, wenn du zwei hast, die ordentlich können. Du machst dir nichts. Da machst du echt gar nichts. Da wirst du geschreckt ohne Ende. Das ist hier 06. Alter, da merkste halt, wenn Gegner was taugen, dann bist du halt, wenn du so ein Playstation-Sucker bist wie ich, kriegst du halt auf die Fresse. Oh nice. Immerhin, immerhin nicht 6-0. Das Ding gefällt mir auch, ist mal ordentlicher. ACOG. Du machst dir nichts. Da machst du nichts. Gut Leute, reicht für heute. Ich glaube morgen geben wir uns das Ganze nochmal. Ich meine, es hat ja nicht viel Kontern. Es ist ja nicht so, dass man da jetzt irgendwie 24-7 mal für eine Woche spielen kann. Wobei so lange geht das gar nicht. Ich glaube Sonntagabend ist eh Schluss. Also Leute, ich hab nichts gesehen bisher. Ich hab heute nichts gesehen, was Abos angeht. Muss mal mein Zeug wieder umstöpseln, dass ich was sehe. Da gucke ich nochmal schnell. Da mal umstöpseln, den ganzen Müll hier. Dann gucke ich nochmal kurz rein, weil nicht, dass ich jetzt irgendwie zig Leute übersehen hab. Das wäre natürlich nicht so nice. So. Gucken wir mal. Ach ne, ich kann ja hier gar nicht gucken. Muss hier drüben gucken. Streamlabs. Also, wen haben wir denn hier heute? Ähm, den Martin haben wir. Den 11Core, Neusman09, GWOZ30Crucenda, den kenne ich schon. Der ist öfters am Start, ist auch wieder neu dabei. Wahrscheinlich zwei Monate. Ich sehs jetzt hier nicht mal. Xfacer, Zyplin, der Hydrogen Yoyo, Tanser und der Casino Capitalist. Dankeschön für alle Twitch Prime Subs, wo wir jetzt gerade dabei sind. Das muss jetzt nochmal sein. Für alle, die heute subscribt haben. Und auch danke an alle, die gefollowt haben. Haben wir sicherlich auch ein paar. Muss ich mir mal angucken. Recent Events. Follow, Follow. Ja, Dankeschön, Follow hier. Aber auch, haben wir auch jede Menge. Dankeschön für die Follows und für die ganzen Subs. Ich konnte euch leider nicht alle vorlesen, aber es gibt jetzt nochmal eine Runde. Und natürlich für die ganzen, für Qt Chat. So Leute, ich glaub übrigens mein Chat ist verreckt. Ich seh kein Chat mehr. Jetzt gehts wieder. Ich glaub der Zypelsrohr ist übrigens abgespackt. Ja, danke für die ganzen Subs. Wahrscheinlich bin ich morgen wieder am Start. Muss ja. Es kann auch sein, dass einfach keiner geschrieben hat. Und dann schauen wir mal wie es läuft. Das war heute schon, das war mir schon wieder typisches Call of Duty Gerage Deluxe. Die ganze Geschichte. Und sehr merkwürdig die Sachen wieder passieren zwischendurch. Und ein paar mal übelst gerollt worden. Ja, machts gut Leute. Wir sehen uns. Bis morgen. See you.", "segments": [{"id": 1, "start": 0.0, "end": 14.88, "text": "."}, {"id": 2, "start": 14.88, "end": 28.42, "text": "Zu"}, {"id": 3, "start": 28.42, "end": 31.42, "text": "Pungen, Lockerungsübungen durchführen erstmal"}, {"id": 4, "start": 34.42, "end": 35.42, "text": "Okay, es ist"}, {"id": 5, "start": 37.42, "end": 38.42, "text": "Progas"}, {"id": 6, "start": 47.42, "end": 48.42, "text": "So Leute"}, {"id": 7, "start": 49.42, "end": 50.42, "text": "Ich glaub"}, {"id": 8, "start": 51.42, "end": 54.42, "text": "Ich überleg grad ob ich das auf Twitter"}, {"id": 9, "start": 54.42, "end": 56.42, "text": "Ob ich das auf Twitter"}, {"id": 10, "start": 56.42, "end": 59.42, "text": "Ich glaub ich poste das mal auf Twitter"}, {"id": 11, "start": 60.42, "end": 61.42, "text": "Bitworts"}, {"id": 12, "start": 62.42, "end": 63.42, "text": "Gucken"}, {"id": 13, "start": 68.42, "end": 70.42, "text": "Mein und deine Räder"}, {"id": 14, "start": 71.42, "end": 73.42, "text": "Wir müssen mal gucken ob der"}, {"id": 15, "start": 74.42, "end": 75.42, "text": "Ob das passt ja"}, {"id": 16, "start": 75.42, "end": 76.42, "text": "Also sprich"}, {"id": 17, "start": 77.42, "end": 79.42, "text": "Die Lautstärke, ob die Lautstärke passt"}, {"id": 18, "start": 79.42, "end": 81.42, "text": "Von der PS4"}, {"id": 19, "start": 81.42, "end": 83.42, "text": "Und wir müssen gucken dass der Chat nicht nervt"}, {"id": 20, "start": 83.42, "end": 85.42, "text": "Wenn der Chat nervt dann müssen wir den Chat ausmachen"}, {"id": 21, "start": 85.42, "end": 87.42, "text": "Auch wenn es Q-Chat ist"}, {"id": 22, "start": 87.42, "end": 89.42, "text": "Ja und Aja ja und alles"}, {"id": 23, "start": 89.42, "end": 90.42, "text": "Dass ähm"}, {"id": 24, "start": 92.42, "end": 94.42, "text": "Wenn das nicht funktioniert mit dem Chat"}, {"id": 25, "start": 94.42, "end": 95.42, "text": "Wenn der Chat"}, {"id": 26, "start": 95.42, "end": 96.42, "text": "Ja PS4 MonkaS"}, {"id": 27, "start": 96.42, "end": 98.42, "text": "Hyper MonkaS ey"}, {"id": 28, "start": 98.42, "end": 99.42, "text": "Was ein Akt gestern"}, {"id": 29, "start": 99.42, "end": 101.42, "text": "Was ein unglaublicher riesen Akt"}, {"id": 30, "start": 101.42, "end": 103.42, "text": "Den Kram zum laufen zu bringen äh"}, {"id": 31, "start": 103.42, "end": 105.42, "text": "Ich poste mal auf"}, {"id": 32, "start": 105.42, "end": 109.42, "text": "Wir müssen erstmal kurz testen ob die Lautstärke okay ist"}, {"id": 33, "start": 109.42, "end": 111.42, "text": "Ihr solltet jetzt im Hintergrund"}, {"id": 34, "start": 111.42, "end": 112.42, "text": "Ihr solltet jetzt in"}, {"id": 35, "start": 112.42, "end": 115.42, "text": "Ich glaube mein Mikro ist vielleicht ein bisschen laut"}, {"id": 36, "start": 115.42, "end": 117.42, "text": "Nee ne ich hab doch seit"}, {"id": 37, "start": 117.42, "end": 119.42, "text": "Ich hab doch seit releasene PS4"}, {"id": 38, "start": 119.42, "end": 121.42, "text": "Ich benutze die bloß nie"}, {"id": 39, "start": 121.42, "end": 123.42, "text": "Ich benutze die bloß nie"}, {"id": 40, "start": 123.42, "end": 125.42, "text": "Ich benutze die bloß nie"}, {"id": 41, "start": 125.42, "end": 127.42, "text": "Ich benutze die bloß nie"}, {"id": 42, "start": 127.42, "end": 129.42, "text": "Ich benutze die bloß nie"}, {"id": 43, "start": 129.42, "end": 131.42, "text": "Ich benutze die bloß nie"}, {"id": 44, "start": 131.42, "end": 135.42, "text": "Ich benutze die ja nie."}, {"id": 45, "start": 135.42, "end": 139.42, "text": "Ich hab ewig eine. Ich hab schon grad ne Runde gespielt, das Spiel ruckelt ein bisschen."}, {"id": 46, "start": 139.42, "end": 143.42, "text": "Aber das glaub ich nicht, dass es einmal an der PS4 liegt. Das wird einfach am Game liegen."}, {"id": 47, "start": 143.42, "end": 150.42, "text": "Also ihr müsstet jetzt im Hintergrund, müsstet ihr leise den PS4-Menü-Sound hören."}, {"id": 48, "start": 150.42, "end": 160.42, "text": "Ne, was heißt, kein einziges Game installiert außer Modern Warfare?"}, {"id": 49, "start": 160.42, "end": 164.42, "text": "Doch, doch. Doch, doch, klar."}, {"id": 50, "start": 164.42, "end": 167.42, "text": "Das Problem ist nur, ich erzähl euch das jetzt mal kurz."}, {"id": 51, "start": 167.42, "end": 170.42, "text": "Ich muss gleich mal handfetchen, meine Hand sind übel bappig."}, {"id": 52, "start": 170.42, "end": 174.42, "text": "Ich hab hier so ne uralte Gammelmaus jetzt angeschlossen am anderen Rechner."}, {"id": 53, "start": 174.42, "end": 180.42, "text": "Ich muss euch das jetzt mal kurz erzählen. Also, ein Riesenakt."}, {"id": 54, "start": 180.42, "end": 182.42, "text": "Wir starten das jetzt gerade mal."}, {"id": 55, "start": 182.42, "end": 185.42, "text": "Wir können jetzt ja gerade auch mal gucken, wie die Lautstärke hier ist."}, {"id": 56, "start": 185.42, "end": 189.42, "text": "Das ruckelt wohl ein Bug von der Map. Ich glaub, das ruckelt überall irgendwie."}, {"id": 57, "start": 189.42, "end": 195.42, "text": "Ja, wir warten erstmal mit Twitter-Message posten, bis ich ein paar Runden gespielt habe."}, {"id": 58, "start": 195.42, "end": 198.42, "text": "Erinnert mich mal bitte dran. Alter, ist ja gut, ey."}, {"id": 59, "start": 198.42, "end": 205.42, "text": "Ja, wir haben mehr Krach. Ich glaube, es könnte tatsächlich ein bisschen laut sein."}, {"id": 60, "start": 205.42, "end": 209.42, "text": "Wenn es ein bisschen laut ist, muss ich, ähm, keinen Pepo-Clap habe ich nicht gefunden."}, {"id": 61, "start": 209.42, "end": 214.42, "text": "Muss Link schicken. Also, pass mal auf, ein Riesenakt mit der Playstation."}, {"id": 62, "start": 214.42, "end": 217.42, "text": "Ich hab mich gestern versucht anzumelden."}, {"id": 63, "start": 217.42, "end": 222.42, "text": "Ich hab die Playstation 4 erst mal seit drei Jahren wieder eingeschaltet."}, {"id": 64, "start": 222.42, "end": 226.42, "text": "Das ist ja ewig her. Seit Ewigkeiten hab ich das Ding wieder eingeschaltet."}, {"id": 65, "start": 226.42, "end": 230.42, "text": "Und dann hab ich festgestellt, oh, ich muss erstmal eine Stunde lang Updates machen."}, {"id": 66, "start": 230.42, "end": 232.42, "text": "Hab ich mir gesagt, ja nice, Stunde lang Updates."}, {"id": 67, "start": 232.42, "end": 235.42, "text": "Hab ich die Playstation 4 Updates ziehen lassen, alles gut."}, {"id": 68, "start": 235.42, "end": 239.42, "text": "Und dann war das Problem, das Ding wollte sich ins PSN verbinden."}, {"id": 69, "start": 239.42, "end": 241.42, "text": "Und es konnte sich nicht mit dem PSN verbinden. Ging nicht."}, {"id": 70, "start": 241.42, "end": 243.42, "text": "Keine PSN-Verbindung möglich."}, {"id": 71, "start": 243.42, "end": 245.42, "text": "Ich hab mir gedacht, hä, was ist das?"}, {"id": 72, "start": 245.42, "end": 248.42, "text": "Hat sich eine Nachricht angezeigt, so ja, ich könnte ja mein Passwort resetten."}, {"id": 73, "start": 248.42, "end": 252.42, "text": "Vielleicht wurde der Account gesperrt, was auch immer, was eigentlich vollkommener Blödsinn ist."}, {"id": 74, "start": 252.42, "end": 254.42, "text": "Weil da hätte ich irgendwie eine Nachricht kriegen müssen per Mail."}, {"id": 75, "start": 254.42, "end": 257.42, "text": "Aber nö, äh, wollten wir nicht."}, {"id": 76, "start": 257.42, "end": 260.42, "text": "Ging nicht anmelden, hab ich gesagt, okay, resette ich mal mein Passwort."}, {"id": 77, "start": 260.42, "end": 263.42, "text": "Ähm, resette ich mal mein Passwort."}, {"id": 78, "start": 263.42, "end": 265.42, "text": "Hab ich mein Passwort resettet?"}, {"id": 79, "start": 265.42, "end": 269.42, "text": "Link auf dem Link, äh, in dem Link, in der Mail auf dem Link für Passwort."}, {"id": 80, "start": 269.42, "end": 271.42, "text": "Genau, zu viel, zu viel Gehexort."}, {"id": 81, "start": 271.42, "end": 275.42, "text": "In der Mail auf den Link geklickt, ähm, zum Thema Passwort resetten."}, {"id": 82, "start": 275.42, "end": 278.42, "text": "Und dann wollten die mein Geburtsdatum wissen bei Sony."}, {"id": 83, "start": 278.42, "end": 283.42, "text": "Mein Geburtsdatum, was weiß ich, was ich bei diesem fake Account für ein Geburtsdatum eingetragen hab."}, {"id": 84, "start": 283.42, "end": 286.42, "text": "Gut, konnte ich nicht resetten."}, {"id": 85, "start": 286.42, "end": 289.42, "text": "Okay, also, naja, gut."}, {"id": 86, "start": 289.42, "end": 291.42, "text": "Scheiß drauf."}, {"id": 87, "start": 291.42, "end": 296.42, "text": "Resettest du deine PS4, dass alles runter ist und meldest dich im neuen Account an."}, {"id": 88, "start": 296.42, "end": 299.42, "text": "Dann ist mir aufgefallen, dass man, das ist Big Brain Play von Sony."}, {"id": 89, "start": 299.42, "end": 301.42, "text": "Huge, huge, also Five Head."}, {"id": 90, "start": 301.42, "end": 304.42, "text": "Übrigens, wir haben, wir haben unser erstes Emote."}, {"id": 91, "start": 304.42, "end": 308.42, "text": "Macht mal Wupplull, Wupplull gibt's, gibt's jetzt in Emote."}, {"id": 92, "start": 308.42, "end": 311.42, "text": "Ähm, ja, ging nicht."}, {"id": 93, "start": 311.42, "end": 313.42, "text": "Man muss sich, man muss sich anmelden."}, {"id": 94, "start": 313.42, "end": 315.42, "text": "Man muss sich anmelden."}, {"id": 95, "start": 315.42, "end": 317.42, "text": "Dankeschön, Teinsa."}, {"id": 96, "start": 317.42, "end": 319.42, "text": "Ich hab leider kein Memeboard heute am Start."}, {"id": 97, "start": 319.42, "end": 321.42, "text": "Ich kann keine Sounds oder sonst was einblenden."}, {"id": 98, "start": 321.42, "end": 323.42, "text": "Ähm, Teinsa, zwei Monate."}, {"id": 99, "start": 323.42, "end": 326.42, "text": "Ultra Poggers, äh, Casino Kapitalist auch am Start."}, {"id": 100, "start": 326.42, "end": 328.42, "text": "Sehr nice."}, {"id": 101, "start": 328.42, "end": 330.42, "text": "Naja, zumindest man muss sich anmelden."}, {"id": 102, "start": 330.42, "end": 332.42, "text": "Das ist richtig Huge Brain von Sony."}, {"id": 103, "start": 332.42, "end": 334.42, "text": "Man muss sich anmelden, um seine PS4 resetten zu können."}, {"id": 104, "start": 334.42, "end": 340.42, "text": "Also sprich, ähm, wenn man die PS4 resetten will, wenn man den Account verloren hat, dann geht das Ganze nicht."}, {"id": 105, "start": 340.42, "end": 342.42, "text": "Tja."}, {"id": 106, "start": 342.42, "end": 348.42, "text": "Leute, ich glaub der P, ich glaub der Sound ist ein bisschen laut, hä?"}, {"id": 107, "start": 348.42, "end": 352.42, "text": "Der, das Mainmenü, äh, wenn, wenn das Mainmenü schon so laut ist."}, {"id": 108, "start": 352.42, "end": 354.42, "text": "Ich mach mal kurz ein bisschen leiser, wartet mal."}, {"id": 109, "start": 354.42, "end": 361.42, "text": "Wenn das Mainmenü schon so laut ist."}, {"id": 110, "start": 361.42, "end": 362.42, "text": "So."}, {"id": 111, "start": 362.42, "end": 368.42, "text": "Wenn das Mainmenü schon so laut ist, dann, ähm, wird das andere auch zu laut sein."}, {"id": 112, "start": 368.42, "end": 372.42, "text": "Naja, zumindest, also, dann hab ich festgestellt, man kann bei der PS4 einen zweiten Account anmelden."}, {"id": 113, "start": 372.42, "end": 374.42, "text": "Hab ich mir gedacht, scheiß drauf."}, {"id": 114, "start": 374.42, "end": 375.42, "text": "Du machst hier einen zweiten Account."}, {"id": 115, "start": 375.42, "end": 384.42, "text": "Hab ich mir einen zweiten PSN-Account gemacht, angemeldet, bin in den Playstation Store gegangen und hab festgestellt, Modern Warfare ist nicht runterladbar."}, {"id": 116, "start": 384.42, "end": 386.42, "text": "Nee, nee, das ist das Hauptmenü."}, {"id": 117, "start": 386.42, "end": 389.42, "text": "Modern Warfare ist nicht runterladbar."}, {"id": 118, "start": 389.42, "end": 391.42, "text": "Warum, weiß man nicht."}, {"id": 119, "start": 391.42, "end": 395.42, "text": "Weil, ähm, Sony der Meinung ist, in Deutschland geht das nicht."}, {"id": 120, "start": 395.42, "end": 397.42, "text": "Man kann das nicht runterladen."}, {"id": 121, "start": 397.42, "end": 401.42, "text": "Man kann das nicht runterladen in Deutschland ohne Playstation Plus."}, {"id": 122, "start": 401.42, "end": 404.42, "text": "Sie haben im Vorfeld, sie haben im Vorfeld einen Riesen-Acc gemacht."}, {"id": 123, "start": 404.42, "end": 406.42, "text": "So nach dem Motto, jeder kann es spielen."}, {"id": 124, "start": 406.42, "end": 407.42, "text": "Jeder kann es spielen."}, {"id": 125, "start": 407.42, "end": 408.42, "text": "Vollkommen egal."}, {"id": 126, "start": 408.42, "end": 411.42, "text": "Und in Deutschland geht das nur mit Playstation Plus."}, {"id": 127, "start": 411.42, "end": 414.42, "text": "Na, Typ schrickt, ich hab nichts weitergeleitet auf die Playstation."}, {"id": 128, "start": 414.42, "end": 416.42, "text": "Warum soll ich da was weiterleiten?"}, {"id": 129, "start": 416.42, "end": 418.42, "text": "Hypermonkaos."}, {"id": 130, "start": 418.42, "end": 420.42, "text": "So."}, {"id": 131, "start": 420.42, "end": 421.42, "text": "Hab ich festgestellt."}, {"id": 132, "start": 421.42, "end": 422.42, "text": "Gut."}, {"id": 133, "start": 422.42, "end": 423.42, "text": "Ähm, geht nicht."}, {"id": 134, "start": 423.42, "end": 427.42, "text": "Und wollte ich, ich wollte mir tatsächlich mal ganz kurz überlegt, wollte ich mir,"}, {"id": 135, "start": 427.42, "end": 430.42, "text": "ich hab meinen Bildschirm irgendwie auf den falschen Monitor umgeschaltet."}, {"id": 136, "start": 430.42, "end": 431.42, "text": "Warte mal kurz."}, {"id": 137, "start": 431.42, "end": 435.42, "text": "Und dann wollte ich mir PS Plus kaufen, einen Monat, einfach zum Unterladen,"}, {"id": 138, "start": 435.42, "end": 437.42, "text": "weil ich keinen Bock hatte auf einen weiteren Akt, ne."}, {"id": 139, "start": 437.42, "end": 441.42, "text": "Und dann hab ich festgestellt, oh, geht ja nicht."}, {"id": 140, "start": 441.42, "end": 443.42, "text": "Ich muss irgendwie meinen Ausweis einscannen oder sowas."}, {"id": 141, "start": 443.42, "end": 447.42, "text": "Ich muss mich irgendwie, irgendwas mit meinem Ausweis wollten sie haben."}, {"id": 142, "start": 447.42, "end": 452.42, "text": "Und dann hab ich gesagt, gut, wisst ihr was, ihr könnt mich mal voll am Arsch lecken Sony."}, {"id": 143, "start": 452.42, "end": 455.42, "text": "Und, und Infinity War, ihr könnt mich aktivischen."}, {"id": 144, "start": 455.42, "end": 456.42, "text": "Ihr könnt mich alle am Arsch lecken."}, {"id": 145, "start": 456.42, "end": 459.42, "text": "Ich mach mir jetzt einfach noch einen dritten Account an diesem Tag."}, {"id": 146, "start": 459.42, "end": 461.42, "text": "Äh, den zweiten Account an diesem Tag."}, {"id": 147, "start": 461.42, "end": 466.42, "text": "Und hab dort eingestellt, ich wohne in England, in London, im Burger King."}, {"id": 148, "start": 466.42, "end": 468.42, "text": "Und ich heiße Max Omega Poggers."}, {"id": 149, "start": 468.42, "end": 472.42, "text": "Und das haben die gefressen, das haben den Account mit angelegt."}, {"id": 150, "start": 472.42, "end": 474.42, "text": "Und dann konnte ich's runterladen."}, {"id": 151, "start": 474.42, "end": 476.42, "text": "Das war ein Riesenakt ohne Scheiß, Leute."}, {"id": 152, "start": 476.42, "end": 478.42, "text": "Inklusive Download halb vier Stunden."}, {"id": 153, "start": 478.42, "end": 480.42, "text": "Vier Stunden, die es dann gebraucht, bis ich das Game-Runden hatte."}, {"id": 154, "start": 480.42, "end": 484.42, "text": "Und da sag noch mal einer, Konsole ist einfacher als PC."}, {"id": 155, "start": 487.42, "end": 490.42, "text": "Gleich mal Resolve für Emotes, lol. Dankeschön."}, {"id": 156, "start": 490.42, "end": 493.42, "text": "Es kann sein, dass ich das heute nicht so richtig sehe."}, {"id": 157, "start": 493.42, "end": 494.42, "text": "Äh, mit den Emotes."}, {"id": 158, "start": 494.42, "end": 497.42, "text": "Weil ich guck hier halt auf den zweiten Monitor, wo ich halt keinen, keinen, keinen..."}, {"id": 159, "start": 497.42, "end": 498.42, "text": "Wow."}, {"id": 160, "start": 499.42, "end": 500.42, "text": "Ich halt keinen Chat hab."}, {"id": 161, "start": 506.42, "end": 509.42, "text": "I took an Yo-Yo. Ja, trotzdem. Dankeschön für'n Sub."}, {"id": 162, "start": 509.42, "end": 512.42, "text": "Ich geh jetzt mal ganz schnell Hände waschen und dann spielen wir."}, {"id": 163, "start": 512.42, "end": 539.42, "text": "Waschen, alter, waschen."}, {"id": 164, "start": 542.42, "end": 545.42, "text": "So, hat er waschen gesagt. Ja, heute ist mein Waschtag."}, {"id": 165, "start": 546.42, "end": 549.42, "text": "Einmal, einmal im Monat. Einmal im Monat kann ich..."}, {"id": 166, "start": 549.42, "end": 552.42, "text": "Ich mein, sonst geht man nicht als echter Gamer durch, ne?"}, {"id": 167, "start": 553.42, "end": 556.42, "text": "Ist das Game P2P oder was wegen Natt?"}, {"id": 168, "start": 556.42, "end": 559.42, "text": "Ich habe nicht den leistesten Schimmer, eine Ahnung."}, {"id": 169, "start": 559.42, "end": 562.42, "text": "Aber wir spielen jetzt die Runde. Auf geht's, Leute."}, {"id": 170, "start": 562.42, "end": 564.42, "text": "Waschen, alter, waschen."}, {"id": 171, "start": 564.42, "end": 565.42, "text": "Waschen!"}, {"id": 172, "start": 565.42, "end": 566.42, "text": "Waschen!"}, {"id": 173, "start": 566.42, "end": 567.42, "text": "Waschen!"}, {"id": 174, "start": 567.42, "end": 568.42, "text": "Waschen!"}, {"id": 175, "start": 568.42, "end": 569.42, "text": "Waschen!"}, {"id": 176, "start": 569.42, "end": 570.42, "text": "Waschen!"}, {"id": 177, "start": 570.42, "end": 572.42, "text": "Waschen, alter, waschen. Waschen!"}, {"id": 178, "start": 573.42, "end": 575.42, "text": "Erstmal jetzt ausflippen."}, {"id": 179, "start": 576.42, "end": 577.42, "text": "Okay."}, {"id": 180, "start": 581.42, "end": 584.42, "text": "Huge Bash, alter. Kommt jetzt, huge. Jetzt wird's, jetzt kommt..."}, {"id": 181, "start": 584.42, "end": 585.42, "text": "Massive."}, {"id": 182, "start": 586.42, "end": 588.42, "text": "Massive Five-Head Bash."}, {"id": 183, "start": 588.42, "end": 590.42, "text": "Oh, die Map, die suckt. Die hab ich..."}, {"id": 184, "start": 590.42, "end": 593.42, "text": "Gleich, das Game ist neu. Ich hab die Map erst zweimal gespielt."}, {"id": 185, "start": 593.42, "end": 595.42, "text": "Und gleich erst mal Mapflame. Immer Mapflame."}, {"id": 186, "start": 595.42, "end": 598.42, "text": "Mal gucken, ob die wieder mit MP5 startet wie das letzte Mal. Nee."}, {"id": 187, "start": 598.42, "end": 600.42, "text": "Shotgun."}, {"id": 188, "start": 600.42, "end": 601.42, "text": "Pumpe."}, {"id": 189, "start": 602.42, "end": 603.42, "text": "So."}, {"id": 190, "start": 603.42, "end": 605.42, "text": "Shotgun."}, {"id": 191, "start": 608.42, "end": 610.42, "text": "Erste Map gleich flamen."}, {"id": 192, "start": 610.42, "end": 612.42, "text": "Die Map ist aber wirklich suckig. Du weißt überhaupt nicht, wo..."}, {"id": 193, "start": 612.42, "end": 614.42, "text": "Alter, habt ihr gesehen, wie sie ruckelt?"}, {"id": 194, "start": 615.42, "end": 617.42, "text": "Da vorne war er."}, {"id": 195, "start": 617.42, "end": 619.42, "text": "Huge Rush."}, {"id": 196, "start": 624.42, "end": 626.42, "text": "Huge Big Brain."}, {"id": 197, "start": 626.42, "end": 628.42, "text": "Rekt."}, {"id": 198, "start": 632.42, "end": 634.42, "text": "Easy Clap."}, {"id": 199, "start": 636.42, "end": 637.42, "text": "Okay."}, {"id": 200, "start": 637.42, "end": 640.42, "text": "Was, was, was ist denn, was ist denn der beste Weg hier?"}, {"id": 201, "start": 640.42, "end": 642.42, "text": "Ich renn mal außen rum."}, {"id": 202, "start": 642.42, "end": 645.42, "text": "Ich will an Pump-Action, da kann nicht so viel passieren."}, {"id": 203, "start": 646.42, "end": 649.42, "text": "Wow, was? Was zum Teufel? Warum hat er eine Pistole?"}, {"id": 204, "start": 650.42, "end": 652.42, "text": "What the fuck?"}, {"id": 205, "start": 652.42, "end": 655.42, "text": "Ah, Secondary. Ah, Smart."}, {"id": 206, "start": 655.42, "end": 657.42, "text": "Huge..."}, {"id": 207, "start": 657.42, "end": 659.42, "text": "Big Play."}, {"id": 208, "start": 659.42, "end": 662.42, "text": "Pass mal auf, wir werden hier jetzt so krass außen noch."}, {"id": 209, "start": 663.42, "end": 665.42, "text": "Also es ist nicht mit Maus, es ist nur mit Controller."}, {"id": 210, "start": 665.42, "end": 667.42, "text": "Seien denn du hast irgendeinen Adapter, der das emuliert."}, {"id": 211, "start": 667.42, "end": 669.42, "text": "Ach, wir haben gewonnen."}, {"id": 212, "start": 669.42, "end": 671.42, "text": "Mein Teammate? Oh, es geht ab."}, {"id": 213, "start": 671.42, "end": 673.42, "text": "The Beast Aim."}, {"id": 214, "start": 673.42, "end": 675.42, "text": "The Beast Aim carried mich."}, {"id": 215, "start": 676.42, "end": 678.42, "text": "3 zu 0."}, {"id": 216, "start": 678.42, "end": 682.42, "text": "Igitt."}, {"id": 217, "start": 688.42, "end": 690.42, "text": "Warum trifft... Alter, fast zum Teufel."}, {"id": 218, "start": 690.42, "end": 692.42, "text": "Ich blick nicht durch."}, {"id": 219, "start": 696.42, "end": 698.42, "text": "Der Outplayed."}, {"id": 220, "start": 698.42, "end": 700.42, "text": "Ich muss mich erstmal ein bisschen einspielen."}, {"id": 221, "start": 700.42, "end": 703.42, "text": "Aber der Beast Aim. Guckt euch das Beast, guckt euch den Beast Aim an."}, {"id": 222, "start": 703.42, "end": 705.42, "text": "The Beast Aim."}, {"id": 223, "start": 705.42, "end": 707.42, "text": "The Beast Aim."}, {"id": 224, "start": 710.42, "end": 712.42, "text": "The Beast Aim, guck mal, der geht ab."}, {"id": 225, "start": 712.42, "end": 714.42, "text": "Das bestimmt hier."}, {"id": 226, "start": 714.42, "end": 716.42, "text": "Wir haben eine Extra Solution, oder ich weiß nicht, ob es hier noch gibt."}, {"id": 227, "start": 717.42, "end": 719.42, "text": "Achtung, jetzt, jetzt wird es."}, {"id": 228, "start": 721.42, "end": 723.42, "text": "Weckt. Weggeskillt."}, {"id": 229, "start": 726.42, "end": 729.42, "text": "Das ruckelt? Das ruckelt? Was ist das denn?"}, {"id": 230, "start": 729.42, "end": 733.42, "text": "Das ist..."}, {"id": 231, "start": 741.42, "end": 743.42, "text": "Warte, was?"}, {"id": 232, "start": 745.42, "end": 747.42, "text": "Ich weiß nicht mal, was der Knopf ist zum Messern."}, {"id": 233, "start": 749.42, "end": 751.42, "text": "Das ist Alpha, Alpha."}, {"id": 234, "start": 751.42, "end": 753.42, "text": "Ist das ein Schneiber?"}, {"id": 235, "start": 753.42, "end": 755.42, "text": "Schneiber End?"}, {"id": 236, "start": 755.42, "end": 759.42, "text": "Schneiber? Schneiber?"}, {"id": 237, "start": 767.42, "end": 769.42, "text": "Weckt. Die kriegen auf den Sack, ey."}, {"id": 238, "start": 769.42, "end": 771.42, "text": "Schneiber."}, {"id": 239, "start": 771.42, "end": 773.42, "text": "Das war... Hab ich das richtig gesehen?"}, {"id": 240, "start": 773.42, "end": 775.42, "text": "Eine 30 Schuss Autosniper?"}, {"id": 241, "start": 777.42, "end": 779.42, "text": "Eine 30 Schuss Silenced Autosniper?"}, {"id": 242, "start": 779.42, "end": 785.42, "text": "Ist das euer Ernster?"}, {"id": 243, "start": 785.42, "end": 787.42, "text": "Ich schneiber die jetzt wieder ins Bahn."}, {"id": 244, "start": 791.42, "end": 793.42, "text": "Ich geh oben lang."}, {"id": 245, "start": 795.42, "end": 799.42, "text": "Oh, oh, jetzt rushed er. Jetzt rushed er."}, {"id": 246, "start": 799.42, "end": 801.42, "text": "Pfff."}, {"id": 247, "start": 805.42, "end": 807.42, "text": "Na ja, 4-2-7."}, {"id": 248, "start": 807.42, "end": 809.42, "text": "The Beast Aim, der will es wissen."}, {"id": 249, "start": 811.42, "end": 813.42, "text": "Ach, das ist nur noch einer."}, {"id": 250, "start": 813.42, "end": 815.42, "text": "Der ist gelieft."}, {"id": 251, "start": 819.42, "end": 821.42, "text": "6-0, gleich mal."}, {"id": 252, "start": 821.42, "end": 827.42, "text": "Das ist eigentlich ein Sturmgewehr, okay."}, {"id": 253, "start": 831.42, "end": 833.42, "text": "Ach so."}, {"id": 254, "start": 835.42, "end": 839.42, "text": "Poggers, Poggers ist am Start."}, {"id": 255, "start": 839.42, "end": 841.42, "text": "LOLW."}, {"id": 256, "start": 843.42, "end": 845.42, "text": "Ach ne, nicht LOLW. Wupplull."}, {"id": 257, "start": 845.42, "end": 847.42, "text": "Wie ist das Game?"}, {"id": 258, "start": 847.42, "end": 849.42, "text": "Das ist die zweite Runde."}, {"id": 259, "start": 851.42, "end": 853.42, "text": "Wie findest du denn uns?"}, {"id": 260, "start": 853.42, "end": 855.42, "text": "Ich hab noch so gut wie nicht gespielt."}, {"id": 261, "start": 855.42, "end": 857.42, "text": "Als haben wir wieder so ein komisches ACOG."}, {"id": 262, "start": 857.42, "end": 859.42, "text": "Desert Eagle Ding."}, {"id": 263, "start": 859.42, "end": 861.42, "text": "Passt, Leute, ich sag euch jetzt."}, {"id": 264, "start": 861.42, "end": 863.42, "text": "Wir strafen jetzt, wir hardscopen jetzt."}, {"id": 265, "start": 863.42, "end": 865.42, "text": "Und strafen und headshotten den Dude across the map."}, {"id": 266, "start": 865.42, "end": 867.42, "text": "Ich sag's euch, ich sag's euch."}, {"id": 267, "start": 867.42, "end": 869.42, "text": "Pass auf, pass auf."}, {"id": 268, "start": 871.42, "end": 873.42, "text": "Reck."}, {"id": 269, "start": 873.42, "end": 875.42, "text": "Reck, oh fuck, das ist gar nicht one-shot das Ding."}, {"id": 270, "start": 875.42, "end": 877.42, "text": "Jetzt aber."}, {"id": 271, "start": 877.42, "end": 879.42, "text": "Bam, in my face, Alter."}, {"id": 272, "start": 881.42, "end": 883.42, "text": "Wie heilt man sich?"}, {"id": 273, "start": 883.42, "end": 901.42, "text": "Wie heilt man sich?"}, {"id": 274, "start": 913.42, "end": 915.42, "text": "Ich gewinne."}, {"id": 275, "start": 917.42, "end": 919.42, "text": "Easy."}, {"id": 276, "start": 919.42, "end": 921.42, "text": "Man gewinnt, wenn man mehr Leben hat als die Gegner."}, {"id": 277, "start": 921.42, "end": 923.42, "text": "Easy."}, {"id": 278, "start": 923.42, "end": 925.42, "text": "Man gewinnt, wenn man mehr Leben hat als die Gegner."}, {"id": 279, "start": 925.42, "end": 929.42, "text": "Ja."}, {"id": 280, "start": 947.42, "end": 949.42, "text": "Der hat übelst gelackt."}, {"id": 281, "start": 949.42, "end": 951.42, "text": "Guckt euch mal an, Alter."}, {"id": 282, "start": 951.42, "end": 953.42, "text": "Guckt euch mal an."}, {"id": 283, "start": 957.42, "end": 959.42, "text": "Hallo."}, {"id": 284, "start": 959.42, "end": 961.42, "text": "Jawoll, easy win."}, {"id": 285, "start": 961.42, "end": 963.42, "text": "Ich find, das hat was, dass man keine Leben."}, {"id": 286, "start": 963.42, "end": 965.42, "text": "Das hat was, dass man seine Leben nicht regenerieren kann."}, {"id": 287, "start": 965.42, "end": 967.42, "text": "Das hat was, dass man seine Leben nicht regenerieren kann."}, {"id": 288, "start": 967.42, "end": 969.42, "text": "Weil dadurch bringt das was, wenn du die Gegner low schießt."}, {"id": 289, "start": 969.42, "end": 971.42, "text": "Weil dadurch bringt das was, wenn du die Gegner low schießt."}, {"id": 290, "start": 971.42, "end": 973.42, "text": "Der konnte jetzt einfach one-shotten, weil ich den vor schon mal getroffen hab."}, {"id": 291, "start": 973.42, "end": 975.42, "text": "Der konnte jetzt einfach one-shotten, weil ich den vor schon mal getroffen hab."}, {"id": 292, "start": 975.42, "end": 977.42, "text": "Das ist eigentlich übelst nice."}, {"id": 293, "start": 977.42, "end": 979.42, "text": "Das ist eigentlich übelst nice."}, {"id": 294, "start": 979.42, "end": 981.42, "text": "Das ist eigentlich übelst nice."}, {"id": 295, "start": 993.42, "end": 995.42, "text": "Ich wär da ja durchgelaufen jetzt."}, {"id": 296, "start": 995.42, "end": 997.42, "text": "Ich wär da ja durchgelaufen jetzt."}, {"id": 297, "start": 1001.42, "end": 1003.42, "text": "Nur in dem Modus mit dem Heilen, okay."}, {"id": 298, "start": 1003.42, "end": 1009.5, "text": "Ich habe null ahnung. Okay die die die dinger sind deaktiviert"}, {"id": 299, "start": 1017.5, "end": 1023.26, "text": "Was zum teufel bin ich zu dumm zum zielen auf den oder was"}, {"id": 300, "start": 1026.54, "end": 1028.54, "text": "Hat man eine ping anzeige"}, {"id": 301, "start": 1028.54, "end": 1037.3, "text": "Fuck das war doch drauf oder ja okay ich bin ich glaube ich bin einfach zu dumm zum zielen"}, {"id": 302, "start": 1037.3, "end": 1046.38, "text": "kann sein wahrscheinlich wahrscheinlich ist mal eins drei das ist was ist das hier shotgun"}, {"id": 303, "start": 1046.38, "end": 1058.74, "text": "die auen uns übelst weg"}, {"id": 304, "start": 1058.74, "end": 1067.58, "text": "fingerzeige gibt es nicht okay wo ist wo ist denn der beast aimer hin"}, {"id": 305, "start": 1067.58, "end": 1078.62, "text": "haben sie uns übelst gecarriert oben oben unten"}, {"id": 306, "start": 1078.62, "end": 1090.18, "text": "okay komm mal zusammen reißen ich glaube es ist immer zwei hunden mit der gleichen waffe"}, {"id": 307, "start": 1090.18, "end": 1097.58, "text": "wir raschen jetzt die mitte lang hast mal auf übelst jutsch jutsch jutsch play"}, {"id": 308, "start": 1097.58, "end": 1107.02, "text": "was zum ich habe nur einmal geschossen er hat doppelt geschossen habe das gesehen gerade"}, {"id": 309, "start": 1107.02, "end": 1126.94, "text": "man kann die gegner nicht orten hier was auch immer schießt man zwei schuss wenn man irgendwie"}, {"id": 310, "start": 1126.94, "end": 1133.58, "text": "durchgedrückt hält oder so habt ihr es gerade gesehen ich habe einmal geschossen es war zwei"}, {"id": 311, "start": 1133.58, "end": 1137.42, "text": "schuss weg und der gegner nicht tot und irgendwie ganz merkwürdig auf packs geht es los"}, {"id": 312, "start": 1137.42, "end": 1142.54, "text": "scheiße man"}, {"id": 313, "start": 1142.54, "end": 1148.66, "text": "easy"}, {"id": 314, "start": 1148.66, "end": 1165.26, "text": "achter ist wieder gelieft was sind es für ehrenlose gegner jetzt wissen wir das ehrenlose"}, {"id": 315, "start": 1165.26, "end": 1182.54, "text": "gegner"}, {"id": 316, "start": 1182.54, "end": 1199.06, "text": "das letzte mal der ist gelieft nachdem die runde vorbei war das letzte mal ist gelieft"}, {"id": 317, "start": 1199.06, "end": 1213.86, "text": "spielst du mit mausentasten ich habe das freund mit diesem komischen adapter probiert das"}, {"id": 318, "start": 1213.86, "end": 1235.78, "text": "ist irgendwie merkwürdig wie du sekundäre stimmte ich an rpg als sekundäre"}, {"id": 319, "start": 1235.78, "end": 1249.1, "text": "steigt man jetzt eigentlich in der lobby wenn man jetzt einfach nur hier im chat rumgammelt"}, {"id": 320, "start": 1249.1, "end": 1270.82, "text": "man zurück ich mag übrigens den sound überhaupt nicht irgendwie also aber die analog steckt"}, {"id": 321, "start": 1270.82, "end": 1280.54, "text": "nur gegen einen es gibt hier bestimmt übelst nice nade spots wir rennen jetzt außen rum"}, {"id": 322, "start": 1280.54, "end": 1293.1, "text": "ganz schnell meine jüde ey übelste kacke mit ps4 control wow das spricht das spricht"}, {"id": 323, "start": 1293.1, "end": 1308.94, "text": "sekunde leute wartet mal das spricht"}, {"id": 324, "start": 1308.94, "end": 1333.82, "text": "das ist immer das wichtigste in kott stats check permanent stats checken"}, {"id": 325, "start": 1333.82, "end": 1346.06, "text": "aber wir haben uns getrennt das ist in schott"}, {"id": 326, "start": 1346.06, "end": 1372.38, "text": "ich spiele ich spiele aktuell eigentlich kaum noch shooter mäßig ich merke das auch dass ich"}, {"id": 327, "start": 1372.38, "end": 1377.66, "text": "irgendwie ob keine übung mehr habe aber wenn wir das jetzt ein paar tage kreinden dann sind wir"}, {"id": 328, "start": 1377.66, "end": 1407.3, "text": "wieder poggers ja was komm raus komm raus alter komm raus oh ein"}, {"id": 329, "start": 1407.3, "end": 1414.86, "text": "ein ein nicer messer kill ohne messer was ist das ist jetzt ein shotgun ich erkenne die"}, {"id": 330, "start": 1414.86, "end": 1432.86, "text": "kackwaffen ich glaube das ist ein shotgun oder auch nicht was ist das was ist das ich habe"}, {"id": 331, "start": 1432.86, "end": 1451.3, "text": "keine ahnung was ist für eine waffe ist es ein shotgun mk2 ok ich kann das bei meinem"}, {"id": 332, "start": 1451.3, "end": 1470.82, "text": "dude hinterher ich glaube das ist eine singel schusswaffe ok da bin ich das ist zu zu small"}, {"id": 333, "start": 1470.82, "end": 1486.82, "text": "brain für die waffe small brain jetzt gibt es ja lmg action in der mitte"}, {"id": 334, "start": 1486.82, "end": 1508.3, "text": "ich muss mal gucken dass man die maps die map irgendwie mal ein bisschen zu seinem"}, {"id": 335, "start": 1508.3, "end": 1514.94, "text": "vorteil ausspielt dieses dieses sinnlos lang ruschen ist links finde ich gut links hat was"}, {"id": 336, "start": 1514.94, "end": 1541.54, "text": "ich bin so scheiße in games mittlerweile ist es schlecht dabei hätte ich den übelst mein"}, {"id": 337, "start": 1541.54, "end": 1549.42, "text": "egal wie gewinnt das noch sagt euch leute wir kreiten das gelb jetzt morgen und morgen"}, {"id": 338, "start": 1549.42, "end": 1568.0, "text": "oder die nächsten tage werden so krass gebashed wenn wir wieder ein bisschen übung haben"}, {"id": 339, "start": 1568.0, "end": 1577.34, "text": "das bild kommt verzögert vom sound vom sound vom sound zum ach so meine stimme ja das kann"}, {"id": 340, "start": 1577.34, "end": 1594.42, "text": "sein da muss ich mich selbst ein bisschen verzögern ich war doch drauf das das liegt ich das kann"}, {"id": 341, "start": 1594.42, "end": 1599.94, "text": "sein weil es über die elgato geht in die elgato hat so eine halbe sekunde verzögern ich gucke"}, {"id": 342, "start": 1599.94, "end": 1604.26, "text": "mal dass ich mich ein bisschen verzögern kann gleich wenn wenn das hier fertig ist oder"}, {"id": 343, "start": 1604.26, "end": 1611.74, "text": "ist es jetzt fertig für so eine runde spielen dann stand stelle ich das ein versuche mich"}, {"id": 344, "start": 1611.74, "end": 1616.5, "text": "ein bisschen zu verzögern gleich wir machen jetzt noch eine runde und dann dann probiere"}, {"id": 345, "start": 1616.5, "end": 1627.54, "text": "ich das mal wobei hat man input display port jetzt muss halt umstöpsel war meine güte"}, {"id": 346, "start": 1627.54, "end": 1631.86, "text": "ich schmeiß immer diese verlängerung von meinem headset runter ich hoffe ich sind jetzt"}, {"id": 347, "start": 1631.86, "end": 1639.02, "text": "nicht direkt die oren weggeflogen so ich weiß ich versuche mich mal ein ticken zu verzögern"}, {"id": 348, "start": 1639.02, "end": 1667.58, "text": "wie geht das jetzt hier mic properties filter delay ok nope ich muss umschalten ich stelle"}, {"id": 349, "start": 1667.58, "end": 1674.06, "text": "es gleich um muss irgendwo mal gucken wie das geht das game hat keine musik oder diese"}, {"id": 350, "start": 1674.06, "end": 1697.94, "text": "komische schneiber end"}, {"id": 351, "start": 1704.06, "end": 1723.86, "text": "das ding bringt das was ab einer gewissen range und manchmal scheint es besser zu sein"}, {"id": 352, "start": 1723.86, "end": 1745.14, "text": "wenn man jetzt wird gerascht gepascht wenn ich mal sterben bitte"}, {"id": 353, "start": 1745.14, "end": 1772.3, "text": "das muss man anders spielen aber unser du gewinnt das wir gewinnen das wenn er einfach"}, {"id": 354, "start": 1772.3, "end": 1783.74, "text": "nichts macht ja das obs ich glaube ich weiß wie das geht da muss ich da muss ich in die"}, {"id": 355, "start": 1783.74, "end": 1808.7, "text": "in die übertragung settings das geht nicht über irgendwelche filter"}, {"id": 356, "start": 1808.7, "end": 1820.74, "text": "was der andere du"}, {"id": 357, "start": 1820.74, "end": 1839.58, "text": "hör"}, {"id": 358, "start": 1839.58, "end": 1846.02, "text": "ach da ist ein objektiv in der mitte oh mann das ist übelst der noob style"}, {"id": 359, "start": 1846.02, "end": 1856.38, "text": "ich will mich bewegen please"}, {"id": 360, "start": 1856.38, "end": 1883.7, "text": "na gut er hat mich jetzt aber nicht gesehen"}, {"id": 361, "start": 1883.7, "end": 1901.18, "text": "schön von der seite weg gesnackt wuppe lull"}, {"id": 362, "start": 1901.18, "end": 1913.34, "text": "war das da wahnsinn wie schlecht man werden kann vor allem auf der plattform nicht spiel"}, {"id": 363, "start": 1913.34, "end": 1933.02, "text": "man hört die gegner irgendwie komisch"}, {"id": 364, "start": 1933.02, "end": 1948.14, "text": "der wache"}, {"id": 365, "start": 1948.14, "end": 1957.14, "text": "23 wir haben aufgeholt leute"}, {"id": 366, "start": 1957.14, "end": 1959.14, "text": "mp5 jetzt geht's ab"}, {"id": 367, "start": 1966.38, "end": 1971.22, "text": "Meine güte ist also entweder ist meine reaktion mittlerweile mega beschissen"}, {"id": 368, "start": 1973.38, "end": 1977.82, "text": "Ach ne ich hab bei ihm gar nicht geschossen oder es ist einfach huge host vorteil des todes"}, {"id": 369, "start": 1977.82, "end": 1984.5, "text": "Aber ich glaube meine reaktion ist einfach beschissen"}, {"id": 370, "start": 1984.5, "end": 1996.62, "text": "Ach so fuck man hat ja gar keine. Jetzt war mal huge pass auf huge play"}, {"id": 371, "start": 1996.62, "end": 2011.86, "text": "Richtig huge play richtig massive massive play"}, {"id": 372, "start": 2011.86, "end": 2023.82, "text": "Ich glaube dass der modus wenn man mit jemanden spielt mit dem man irgendwie auch im discord ist"}, {"id": 373, "start": 2023.82, "end": 2027.34, "text": "oder so da ist das glaube ich gar nicht so dumm darauf jetzt wieder gehetschrottet"}, {"id": 374, "start": 2035.14, "end": 2040.58, "text": "Okay hast schon mal überlegt e-sport mit meinem kram mit meiner krassen performance hier ist es ja auch"}, {"id": 375, "start": 2040.58, "end": 2051.62, "text": "Fabian will nicht spielen"}, {"id": 376, "start": 2051.62, "end": 2058.34, "text": "Fabian will nicht"}, {"id": 377, "start": 2058.34, "end": 2081.46, "text": "wartet mal was ist denn hier was gibt's denn hier eigentlich clan tech"}, {"id": 378, "start": 2081.46, "end": 2092.58, "text": "Also das ist die übliche geschichte hier kann man wieder custom emblems machen"}, {"id": 379, "start": 2092.58, "end": 2112.18, "text": "loadouts gibt es nicht weil ganz ganz weit hat man eigentlich den rang habe ich schon"}, {"id": 380, "start": 2112.18, "end": 2124.78, "text": "irgendwie einen rang profile xx darf mein profile nicht viewen"}, {"id": 381, "start": 2124.78, "end": 2129.5, "text": "ein profile gibt es nicht zu viewen"}, {"id": 382, "start": 2129.5, "end": 2145.5, "text": "Oh wieder ruckelmap"}, {"id": 383, "start": 2145.5, "end": 2154.82, "text": "Ich glaube auf der map ist es vorzulaufen zum auto gar nicht so übel"}, {"id": 384, "start": 2154.82, "end": 2160.14, "text": "wie geht eigentlich wie kann man eigentlich diesen super super super rennen machen und so"}, {"id": 385, "start": 2172.14, "end": 2182.78, "text": "Wo ist der dude das sieht auch übelst verwaschen aus na gut das könnte auch bei"}, {"id": 386, "start": 2182.78, "end": 2188.54, "text": "mir ein bisschen am stream liegen oder weil ich glaube der stream sieht eigentlich ganz gut aus"}, {"id": 387, "start": 2188.54, "end": 2200.5, "text": "das ruckelt voll die map was der andere war in der mitte"}, {"id": 388, "start": 2200.5, "end": 2212.74, "text": "der typ afk der typ afk also nicht meiner und auch nicht der der der der andere da steht immer"}, {"id": 389, "start": 2212.74, "end": 2234.02, "text": "im spawn und macht nichts da ist afk der typ"}, {"id": 390, "start": 2234.02, "end": 2245.3, "text": "der typ afk das sind beide afk die sind die sind jetzt einfach beide rage quittet"}, {"id": 391, "start": 2245.3, "end": 2262.54, "text": "achte auch gott das wieder ehren ehrenlose runde der andere schon wieder gelieft"}, {"id": 392, "start": 2262.54, "end": 2272.22, "text": "wisst ihr was jetzt kann ich mal testen was das für eine waffe ist jetzt ein shotgun ist"}, {"id": 393, "start": 2272.22, "end": 2283.5, "text": "oder das ist ein singel singel schuss singel schuss so ein bisschen was wie"}, {"id": 394, "start": 2283.5, "end": 2300.02, "text": "das sniper so sieht aus wie der shotgun ja die die one shot das auch jeder dude ist afk"}, {"id": 395, "start": 2300.02, "end": 2311.18, "text": "toll tolle runde"}, {"id": 396, "start": 2311.18, "end": 2333.94, "text": "wahnsinns win"}, {"id": 397, "start": 2333.94, "end": 2345.06, "text": "sind die 48 fps cap auf dem stream gewollt ja sind sind gewollt reicht und brauche weniger"}, {"id": 398, "start": 2345.06, "end": 2352.02, "text": "bandbreite muss nämlich gerade mal was gucken in der vorschau weil ich glaube das stream sieht"}, {"id": 399, "start": 2352.02, "end": 2367.42, "text": "ganz ok aus ja ich sehe kann der vorschau der stream sieht ganz in ordnung aus aber das sieht"}, {"id": 400, "start": 2367.42, "end": 2373.38, "text": "bei mir übrigens auch verwaschen aus nur das liegt nicht am stream wieso kann er spielen weil"}, {"id": 401, "start": 2373.38, "end": 2379.02, "text": "ich eine ps4 habe und jeder auf der ps4 die alpha kostenlos spielen kann allerdings oh wieder beste"}, {"id": 402, "start": 2379.02, "end": 2383.9, "text": "map allerdings dieses problem ist in deutschland du brauchst ps plus wobei die restliche welt oder"}, {"id": 403, "start": 2383.9, "end": 2390.78, "text": "baumstamm sieht gut aus direkt der die restliche welt braucht kein ps ps plus playstation plus"}, {"id": 404, "start": 2390.78, "end": 2398.18, "text": "die restliche welt ist da ein bisschen ein bisschen weiter als wir sollen wir rushen jetzt zum auto"}, {"id": 405, "start": 2398.18, "end": 2425.3, "text": "vor leute es leiden es leiden und sehnix fack man wo ist er tut da ist auch gesagt da war er"}, {"id": 406, "start": 2425.3, "end": 2434.86, "text": "kaufst du dir eigentlich eine ps5 oder xbox ultimate ich weiß nicht also ich bin ja recht"}, {"id": 407, "start": 2434.86, "end": 2438.3, "text": "enttäuscht von der letzten konsolengeneration habe ich ja habe ich ja schon ein paar mal"}, {"id": 408, "start": 2438.3, "end": 2457.74, "text": "erzählt die habe ich mir zum release gekauft und deswegen werde ich mir warten deswegen"}, {"id": 409, "start": 2457.74, "end": 2464.38, "text": "werde ich fertig mal warten es hat sich für mich überhaupt nicht gelohnt die die xbox one und"}, {"id": 410, "start": 2464.38, "end": 2468.86, "text": "ist das wieder die das die schneiber oder die die one shot schneiber"}, {"id": 411, "start": 2468.86, "end": 2483.46, "text": "alle man kann sich null bewegen da ist schon wieder gelieft der typ was ist das was sind das"}, {"id": 412, "start": 2483.46, "end": 2505.22, "text": "für gegner was sind das für gegner die macht man eigentlich super sprint die macht man eigentlich"}, {"id": 413, "start": 2505.22, "end": 2529.78, "text": "super sprint man kann auch irgendwie so super sprinten oder ob kommt es automatisch aber"}, {"id": 414, "start": 2529.78, "end": 2553.5, "text": "in ahnung wenn man einfach nur lang genug sprintet vielleicht was war das denn vielleicht"}, {"id": 415, "start": 2553.5, "end": 2565.38, "text": "linke stick reindrücken also quasi quasi das probieren wir mal aus"}, {"id": 416, "start": 2565.38, "end": 2575.94, "text": "der linke stick reindrücken ist ich halte linke stick jetzt gedrückt da passiert überhaupt nichts"}, {"id": 417, "start": 2575.94, "end": 2599.14, "text": "komisch oder zweimal linke stick nach vorn ich habe keine ahnung"}, {"id": 418, "start": 2599.14, "end": 2609.26, "text": "ich habe kein schimmer ja und übrigens das game hat wirklich keine musik"}, {"id": 419, "start": 2609.26, "end": 2615.3, "text": "außer außer im hauptmenü sonst hat es null"}, {"id": 420, "start": 2615.3, "end": 2622.7, "text": "sonst hat es null musik weder im menü noch sonst vor"}, {"id": 421, "start": 2622.7, "end": 2632.98, "text": "ja microtransaktion things snoop dock musik dlc ach guck mal hier ist jump"}, {"id": 422, "start": 2635.98, "end": 2636.68, "text": "tactical"}, {"id": 423, "start": 2639.42, "end": 2642.38, "text": "super sprint"}, {"id": 424, "start": 2642.38, "end": 2650.54, "text": "alter playstation"}, {"id": 425, "start": 2652.54, "end": 2653.9, "text": "bent ich war zu gut"}, {"id": 426, "start": 2653.9, "end": 2680.82, "text": "a must be signed in the playstation network ich bin im playstation network in gesigned"}, {"id": 427, "start": 2680.82, "end": 2687.86, "text": "dachte ich zumindest doch psn kackt gerade wieder ab"}, {"id": 428, "start": 2696.1, "end": 2697.7, "text": "doch psn kackt gerade wieder ab"}, {"id": 429, "start": 2697.7, "end": 2712.62, "text": "wie das ruckelt oder oder da müsste jetzt mal helfen wie wie beendet man auf der playstation"}, {"id": 430, "start": 2712.62, "end": 2726.1, "text": "games wie beendet man auf der playstation games dreieck ich habe keine ahnung wie"}, {"id": 431, "start": 2726.1, "end": 2730.5, "text": "geht das options options close"}, {"id": 432, "start": 2740.5, "end": 2747.14, "text": "da seht ihr seht ihr mal wie oft ich auf dieser plattform unterwegs bin ja"}, {"id": 433, "start": 2748.66, "end": 2752.86, "text": "weiß ich mal wie man games beendet wir sind übrigens den game lautstärke soll es gewesen"}, {"id": 434, "start": 2752.86, "end": 2757.1, "text": "ist das ok ach ja ich wollte mich ja noch moment ich wollte mich ja noch verzögern"}, {"id": 435, "start": 2757.1, "end": 2758.62, "text": "das mache ich jetzt mal bevor es losgeht"}, {"id": 436, "start": 2758.62, "end": 2772.3, "text": "x-faces 17 dankeschön twitch prime pock ok input ich muss mich mal kurz auf den pc umstellen"}, {"id": 437, "start": 2772.3, "end": 2784.26, "text": "und ok ich verzögere mal mikrofon bisschen audio"}, {"id": 438, "start": 2784.26, "end": 2810.14, "text": "oh fuck das geht gar nicht da wo ich dachte fernst"}, {"id": 439, "start": 2810.14, "end": 2818.22, "text": "hier konnte man sich ich weiß genau das ging das ging irgendwo in mixer oder irgendwo"}, {"id": 440, "start": 2818.22, "end": 2834.86, "text": "zink offset hier ist es mikrofon ok zink offset das heißt ich mache das jetzt mal 500 500"}, {"id": 441, "start": 2834.86, "end": 2844.66, "text": "millisekunden"}, {"id": 442, "start": 2844.66, "end": 2848.82, "text": "ich mache das jetzt mal 500 millisekunden langsamer da müssen wir mal gucken wie es"}, {"id": 443, "start": 2848.82, "end": 2868.7, "text": "funktioniert also mal gucken wie ich wie ob ich jetzt irgendwie verzögert da bin sollte"}, {"id": 444, "start": 2868.7, "end": 2869.7, "text": "es sollte jetzt besser passen"}, {"id": 445, "start": 2869.7, "end": 2878.3, "text": "so ich müsste jetzt 500 millisekunden verzögert sein"}, {"id": 446, "start": 2878.3, "end": 2885.98, "text": "mal wieder monitor umschalten mal gucken ob es besser funktioniert"}, {"id": 447, "start": 2885.98, "end": 2902.1, "text": "ich will mal mikrofon 500 millisekunden verzögern damit ich zum game sound passend"}, {"id": 448, "start": 2902.1, "end": 2913.18, "text": "bin alter monitor schalten auf die ps4 um"}, {"id": 449, "start": 2913.18, "end": 2916.18, "text": "so nicht maus und keyboard an die tastatur ich glaube nicht dass man maus und keyboard"}, {"id": 450, "start": 2916.18, "end": 2918.94, "text": "einfach so ohne adapter an die ps4 machen kann und dann spielen"}, {"id": 451, "start": 2918.94, "end": 2923.42, "text": "das glaube ich nicht"}, {"id": 452, "start": 2923.42, "end": 2929.38, "text": "höchstens halt mit so einem mit irgend so einem sim adapter wobei das gefühl war ganz"}, {"id": 453, "start": 2929.38, "end": 2930.38, "text": "merkwürdig"}, {"id": 454, "start": 2930.38, "end": 2946.82, "text": "wird auch erkannt aber nicht in games das wäre"}, {"id": 455, "start": 2946.82, "end": 2966.26, "text": "nicht anders links"}, {"id": 456, "start": 2966.26, "end": 2969.52, "text": "schreckt"}, {"id": 457, "start": 2969.52, "end": 2970.02, "text": "Pock"}, {"id": 458, "start": 2977.52, "end": 2982.52, "text": "Das kann ich mir nicht vorstellen, dass man in-game direkt an die Playstation per Maus und Tastatur spielen kann"}, {"id": 459, "start": 2984.02, "end": 2984.52, "text": "Huge"}, {"id": 460, "start": 2985.32, "end": 2986.52, "text": "Na langsam werden wir warm, hä?"}, {"id": 461, "start": 2986.52, "end": 3009.52, "text": "Bäm bä bä bäm"}, {"id": 462, "start": 3009.52, "end": 3011.02, "text": "Easy win, easy life"}, {"id": 463, "start": 3011.02, "end": 3018.52, "text": "Ja es ist halt ein bisschen, bisschen langsamer als man jetzt irgendwie Call of Duty Deathmatch gewohnt ist"}, {"id": 464, "start": 3022.52, "end": 3026.52, "text": "Es gibt nur 2 was, es gibt nichts außer diesen Modus und irgendwie 3 Maps"}, {"id": 465, "start": 3033.02, "end": 3034.52, "text": "Achso jetzt machen wir Big Play"}, {"id": 466, "start": 3034.52, "end": 3049.52, "text": "Big Play"}, {"id": 467, "start": 3049.52, "end": 3051.52, "text": "Der kennt sich da hinten einen ab oder? Oh fuck"}, {"id": 468, "start": 3051.52, "end": 3052.52, "text": "War das hinter uns?"}, {"id": 469, "start": 3056.02, "end": 3057.02, "text": "Was zum Teufel?"}, {"id": 470, "start": 3058.52, "end": 3060.52, "text": "Ich war da 2 Sekunden vorher drauf"}, {"id": 471, "start": 3060.52, "end": 3063.52, "text": "Ah na gut, das war halt durch die Wand, durch die Wand macht weniger Damage"}, {"id": 472, "start": 3065.52, "end": 3066.52, "text": "Ok, das hat sich mir gefallen"}, {"id": 473, "start": 3075.52, "end": 3076.52, "text": "Jetzt in die Mitte"}, {"id": 474, "start": 3076.52, "end": 3077.52, "text": "Nein, nein, fuck"}, {"id": 475, "start": 3082.52, "end": 3083.52, "text": "Shit, auf jeden Fall"}, {"id": 476, "start": 3083.52, "end": 3089.52, "text": "Ok, es ist auf jeden Fall eine ziemlich doofe Idee loszurennen, man muss auf dem Weg bleiben wo man am Anfang lang gelaufen ist"}, {"id": 477, "start": 3095.52, "end": 3097.52, "text": "Doch die Waffen haben sogar Halbwegsrückstoß"}, {"id": 478, "start": 3097.52, "end": 3103.48, "text": "Alter Mann, wie viel downstairs ist der"}, {"id": 479, "start": 3104.52, "end": 3105.52, "text": "Come on!"}, {"id": 480, "start": 3106.02, "end": 3121.72, "text": "Mit den Alten"}, {"id": 481, "start": 3122.52, "end": 3124.52, "text": "Soke oke"}, {"id": 482, "start": 3124.52, "end": 3133.04, "text": "alter meine güte gibt's nicht mein ps4 ms so mega für den arsch"}, {"id": 483, "start": 3133.04, "end": 3159.88, "text": "wir müssen jetzt ein bisschen cs style machen"}, {"id": 484, "start": 3163.04, "end": 3169.2, "text": "da war er oder? da war er doch"}, {"id": 485, "start": 3169.2, "end": 3194.12, "text": "okay aber eine ping anzeige wäre trotzdem nicht schlecht. eine ping anzeige hätte schon was"}, {"id": 486, "start": 3194.12, "end": 3208.36, "text": "der wartet hier auf mich jetzt"}, {"id": 487, "start": 3208.36, "end": 3219.44, "text": "ich glaube das ist wirklich gut wenn man das mit jemanden spielt zusammen wo man wo man"}, {"id": 488, "start": 3219.44, "end": 3225.92, "text": "kommunizieren kann weil so hat man ja absolut keine ahnung ob hinter einem frei ist oder nicht"}, {"id": 489, "start": 3225.92, "end": 3230.92, "text": "also man kann eigentlich gerade ausrushen und gut ist also irgendwelche sachen weil du"}, {"id": 490, "start": 3230.92, "end": 3257.12, "text": "hast keine infos halt ich höre nix"}, {"id": 491, "start": 3261.92, "end": 3267.52, "text": "man hört die gegner ganz merkwürdig"}, {"id": 492, "start": 3267.52, "end": 3271.44, "text": "der wollte dropshotten wollte der dropshotten der typ"}, {"id": 493, "start": 3271.44, "end": 3272.96, "text": "glaub der wollte dropshotten"}, {"id": 494, "start": 3272.96, "end": 3302.4, "text": "gerade dropshotten war das easy easy win"}, {"id": 495, "start": 3302.4, "end": 3310.52, "text": "wie gefällt dir mw bisher eigentlich naja das kann man schlecht sagen es die kotz machen immer"}, {"id": 496, "start": 3310.52, "end": 3316.6, "text": "bock am anfang ich glaube der modus ist nicht dafür gemacht mit randoms zu spielen das mit"}, {"id": 497, "start": 3316.6, "end": 3321.6, "text": "dem sim hat geklappt macht das jetzt ich ich mach das jetzt ich stöpsel jetzt gleich mal auf"}, {"id": 498, "start": 3321.6, "end": 3326.2, "text": "den sim aber das problem ist dass ich das ganz merkwürdig anfühlt mit maus und tastatur"}, {"id": 499, "start": 3326.2, "end": 3331.76, "text": "emuliert irgendwie wir probieren das wir probieren das jetzt mal aus ich mache jetzt"}, {"id": 500, "start": 3331.76, "end": 3344.16, "text": "um nicht in die sau war nur muss das gelben beenden also leute"}, {"id": 501, "start": 3344.16, "end": 3349.8, "text": "das machen wir mal ich habe das ja noch angeschlossen deswegen kann ich auch so"}, {"id": 502, "start": 3349.8, "end": 3358.2, "text": "schlecht mein expedient ich mache das jetzt mal dran da muss ich erst mal die sim app aufmachen"}, {"id": 503, "start": 3358.2, "end": 3384.08, "text": "ich mach das jetzt ich mach das jetzt achtung passt passt ich hab's gleich so profil geladen"}, {"id": 504, "start": 3384.08, "end": 3392.8, "text": "ich brauche kein emulator echt man kann in den einstellungen auf tastatur maus stellen"}, {"id": 505, "start": 3392.8, "end": 3398.32, "text": "wirklich probieren wir danach aus jetzt will ich erst mal diesen komischen komischen adapter"}, {"id": 506, "start": 3398.32, "end": 3402.68, "text": "test ja aber ich glaube wenn du mit maus und tastatur spielst da wird na wobei ist doch"}, {"id": 507, "start": 3402.68, "end": 3405.92, "text": "egal ich wollte gerade sagen man wird nur mit maus und tastatur leuten gemetzt aber das"}, {"id": 508, "start": 3405.92, "end": 3416.52, "text": "ist ja egal ich spiele alle auf der ps4 das ist übelst gewöhnungsbedürftig leute"}, {"id": 509, "start": 3416.52, "end": 3436.52, "text": "ja ja ja übelste hardscoper"}, {"id": 510, "start": 3436.52, "end": 3455.08, "text": "das wird angezeigt wer mit maus mit was spiele ich gerade wo sieht man das ach hier unten"}, {"id": 511, "start": 3455.08, "end": 3476.0, "text": "mit dem controller klaus oder"}, {"id": 512, "start": 3476.0, "end": 3488.96, "text": "das"}, {"id": 513, "start": 3488.96, "end": 3518.88, "text": "Ja, eins, jetzt geht's ab."}, {"id": 514, "start": 3518.88, "end": 3526.88, "text": "Au, ich hab mir grad Orangensaft ins Gesicht gespritzt."}, {"id": 515, "start": 3526.88, "end": 3532.24, "text": "Oh, das brennt übelst."}, {"id": 516, "start": 3532.24, "end": 3536.68, "text": "Boah, KS."}, {"id": 517, "start": 3536.68, "end": 3543.0, "text": "Was ist das da?"}, {"id": 518, "start": 3543.0, "end": 3549.28, "text": "Schub, Schub, Schub, Schub, Schub, Schub, Schub."}, {"id": 519, "start": 3549.28, "end": 3557.88, "text": "Oh, fuck, Säure im Auge ist super angenehm."}, {"id": 520, "start": 3557.88, "end": 3566.76, "text": "Die sind links."}, {"id": 521, "start": 3566.76, "end": 3568.2, "text": "Kann ich rennen?"}, {"id": 522, "start": 3568.2, "end": 3570.16, "text": "Kann ich rennen?"}, {"id": 523, "start": 3570.16, "end": 3575.36, "text": "Der kommt jetzt hinter mir, pass auf, da wird das geoutet."}, {"id": 524, "start": 3575.36, "end": 3582.96, "text": "War vielleicht der Wallhack oder was?"}, {"id": 525, "start": 3582.96, "end": 3597.72, "text": "Was, ich hab gewonnen?"}, {"id": 526, "start": 3597.72, "end": 3598.72, "text": "Ach, der ist gelieft."}, {"id": 527, "start": 3598.72, "end": 3599.72, "text": "Der ist gelieft."}, {"id": 528, "start": 3599.72, "end": 3600.72, "text": "Deswegen."}, {"id": 529, "start": 3600.72, "end": 3607.52, "text": "Wieso gehst du immer auf und ab?"}, {"id": 530, "start": 3607.52, "end": 3608.52, "text": "Was meinste?"}, {"id": 531, "start": 3608.52, "end": 3616.24, "text": "Weil ich, weil ich Crapmove mit auf der Konsole hab."}, {"id": 532, "start": 3616.24, "end": 3617.24, "text": "Ach so, auf und ab?"}, {"id": 533, "start": 3617.24, "end": 3619.6, "text": "Weil ich denke, dass das mehr bringt."}, {"id": 534, "start": 3619.6, "end": 3620.6, "text": "Denke."}, {"id": 535, "start": 3620.6, "end": 3622.6, "text": "Ich hab keine Ahnung, ob das wirklich so ist."}, {"id": 536, "start": 3622.6, "end": 3623.6, "text": "Für 60!"}, {"id": 537, "start": 3623.6, "end": 3637.08, "text": "7-1, huge Gameplay, direkt YouTube Upload."}, {"id": 538, "start": 3637.08, "end": 3639.6, "text": "2 gegen 1."}, {"id": 539, "start": 3639.6, "end": 3641.84, "text": "Wieso eigentlich 48 Bilder pro Sekunde?"}, {"id": 540, "start": 3641.84, "end": 3646.0, "text": "Weil das menschliche Auge nur 24 sehen kann und ich hab gedacht, wenn man die doppelte"}, {"id": 541, "start": 3646.0, "end": 3649.08, "text": "Anzahl davon nimmt, dann ist auch für beide Augen ruckelt frei."}, {"id": 542, "start": 3649.08, "end": 3656.76, "text": "Nee, zum Bandbreite sparen."}, {"id": 543, "start": 3656.76, "end": 3659.6, "text": "Big Brain 5 Head."}, {"id": 544, "start": 3659.6, "end": 3664.32, "text": "Ach ja Leute, übrigens passt jetzt mein Gelaber vom Sound her besser zum Game?"}, {"id": 545, "start": 3664.32, "end": 3669.36, "text": "Seit ich, ich hab's ja, ich hab's ja verzögert, 50 Millisekunden."}, {"id": 546, "start": 3669.36, "end": 3671.56, "text": "Jetzt sollte, jetzt sollte es besser hin, hinhauen."}, {"id": 547, "start": 3671.56, "end": 3674.0, "text": "All die Klappe."}, {"id": 548, "start": 3674.0, "end": 3682.24, "text": "Ich glaube, es müsste jetzt besser passen, wenn ich die 500 Millisekunden nicht verzögert"}, {"id": 549, "start": 3682.24, "end": 3683.24, "text": "hab."}, {"id": 550, "start": 3683.24, "end": 3684.24, "text": "Oh."}, {"id": 551, "start": 3684.24, "end": 3685.24, "text": "Decke, lege, Luke."}, {"id": 552, "start": 3685.24, "end": 3688.24, "text": "Okay, wo gehen wir jetzt hier lang?"}, {"id": 553, "start": 3688.24, "end": 3702.36, "text": "Wir machen jetzt hier, wir machen jetzt unseren, wir machen jetzt den, den, den, Rush B, Rush"}, {"id": 554, "start": 3702.36, "end": 3703.36, "text": "B Taktik."}, {"id": 555, "start": 3703.36, "end": 3711.76, "text": "Hits, der hat Hits, die Hits ansagen bringt hier ja nur wirklich nix."}, {"id": 556, "start": 3711.76, "end": 3728.16, "text": "Oh, oh, oh, huge, Solo, ja und?"}, {"id": 557, "start": 3728.16, "end": 3748.12, "text": "Die Plays sind real, ich sag's euch."}, {"id": 558, "start": 3748.12, "end": 3759.56, "text": "Woha, MonkaS, MonkaS, wo kam der denn her?"}, {"id": 559, "start": 3759.56, "end": 3771.56, "text": "Kollege, du bist vollkommen, oh, mein, da ist er, was, wie's rumruckelt, P2P Hosting"}, {"id": 560, "start": 3771.56, "end": 3775.32, "text": "in 2019, äh, habt ihr das gesehen?"}, {"id": 561, "start": 3775.32, "end": 3798.96, "text": "Oh, mp5, Achtung hier, hü, hü, pst, ha, easy Solo Carrier, ähm, 5-1, so ist das gut,"}, {"id": 562, "start": 3798.96, "end": 3801.96, "text": "so mag ich das."}, {"id": 563, "start": 3801.96, "end": 3808.48, "text": "P2P, ich glaube, dass es P2P ist, die geben uns ja keine Ping-Anzeige."}, {"id": 564, "start": 3808.48, "end": 3829.8, "text": "Haha, Kollege, so nicht, hähähä, den hat man gut, den map find ich gut, die map ruckelt"}, {"id": 565, "start": 3829.8, "end": 3833.04, "text": "nicht so, und ich hab das Gefühl, auf der map kann man auch die Gegner besser orten"}, {"id": 566, "start": 3833.04, "end": 3834.04, "text": "vom Sound her."}, {"id": 567, "start": 3834.04, "end": 3839.64, "text": "Diese Waldmap ist der übelste Bodensatz, ich hab keine Ahnung, ob das Server sind,"}, {"id": 568, "start": 3839.64, "end": 3840.64, "text": "ich glaube nicht."}, {"id": 569, "start": 3840.64, "end": 3851.16, "text": "Okay, das war zu übertrieben, das war zu in your face, ich bin in beide rein gerannt,"}, {"id": 570, "start": 3851.16, "end": 3855.92, "text": "das war nix, das war voll übermütig jetzt, ich dachte mir, ja, übelste Kacknoobs einfach"}, {"id": 571, "start": 3855.92, "end": 3856.92, "text": "mal reinrushen."}, {"id": 572, "start": 3856.92, "end": 3865.64, "text": "Aber der Luke macht es schon jetzt, was ruckelt, seht ihr, wie krass der Typ abruckelt, lag"}, {"id": 573, "start": 3865.64, "end": 3882.56, "text": "switch am Start, er ist mal schön den lag switch angemacht, wir machen jetzt mal was,"}, {"id": 574, "start": 3882.56, "end": 3899.72, "text": "pass mal auf, huge, big brain play, bam, schreckt, rush B, P90 war das, direkt durch die Mitte"}, {"id": 575, "start": 3899.72, "end": 3909.92, "text": "und ruff, wupplull, oh nee, jetzt haben wir wieder so ne Kackwaffe am Start, einfach linke"}, {"id": 576, "start": 3909.92, "end": 3938.68, "text": "Seite, da kommt schon einer, ich seh es, oh fuck, Pfeil Pferd, M, tracking, track attack,"}, {"id": 577, "start": 3938.68, "end": 3944.48, "text": "protect, attack, track, meine Güte, du schreckst ja alles in dem Gamer, wenn ich nicht mal"}, {"id": 578, "start": 3944.48, "end": 3962.12, "text": "mit dem PS4 Controller spielen muss, das ist kein Problem, Kamasutra, seht ihr mal, wie"}, {"id": 579, "start": 3962.12, "end": 3970.2, "text": "merkwürdig die Schrift aussieht, die sieht übelst kaputt aus, die Schrift, ist das als"}, {"id": 580, "start": 3970.2, "end": 3976.36, "text": "Code 4 Remake gedacht, nee, das ist was eigenständiges, das Ding heißt wahrscheinlich Modern Warfare,"}, {"id": 581, "start": 3976.36, "end": 3982.32, "text": "wann man damit gut Geld verdienen kann, oh, das ist die Waffe, okay, also wir gehen jetzt"}, {"id": 582, "start": 3982.32, "end": 3993.04, "text": "auf die, wir gehen jetzt auf die Dinger hier, und on den, und da sehen wir auch gleich ob"}, {"id": 583, "start": 3993.04, "end": 4020.32, "text": "es einfach geht, ha, schreckt, voll im Kopf, voll im Kopf, nein, Shit, aber ich hab getaggt,"}, {"id": 584, "start": 4020.32, "end": 4028.42, "text": "Komm Kollege, du machst das, du machst das, du machst das."}, {"id": 585, "start": 4028.42, "end": 4029.42, "text": "Jawoll!"}, {"id": 586, "start": 4029.42, "end": 4030.42, "text": "Schreckt!"}, {"id": 587, "start": 4030.42, "end": 4031.42, "text": "Sehr gut."}, {"id": 588, "start": 4031.42, "end": 4032.42, "text": "Weggekockt."}, {"id": 589, "start": 4032.42, "end": 4033.42, "text": "Warum Wallhack?"}, {"id": 590, "start": 4033.42, "end": 4034.42, "text": "Das ist nur beim Spawn einmalig."}, {"id": 591, "start": 4034.42, "end": 4035.42, "text": "Wir gehen jetzt wieder auf die..."}, {"id": 592, "start": 4035.42, "end": 4058.72, "text": "Okay, der kommt bestimmt von links, ich sag's euch."}, {"id": 593, "start": 4058.72, "end": 4064.72, "text": "Oh ne, okay, macht er nicht."}, {"id": 594, "start": 4064.72, "end": 4071.04, "text": "Ich glaube, man kann mit dieser Waffe viel schneller schießen, als ich so gedacht hab."}, {"id": 595, "start": 4071.04, "end": 4076.72, "text": "Ich hoffe, wir spielen noch ne Runde mit der, ah ne."}, {"id": 596, "start": 4076.72, "end": 4079.08, "text": "Jetzt machen wir was, jetzt, jetzt, jetzt machen wir was, jetzt werden sie outplayed,"}, {"id": 597, "start": 4079.08, "end": 4080.08, "text": "outplayed."}, {"id": 598, "start": 4080.08, "end": 4081.08, "text": "Scheiße!"}, {"id": 599, "start": 4081.08, "end": 4082.08, "text": "Fuck!"}, {"id": 600, "start": 4082.08, "end": 4083.08, "text": "Ah!"}, {"id": 601, "start": 4083.08, "end": 4092.08, "text": "Das hätte so gut klappen können."}, {"id": 602, "start": 4092.08, "end": 4097.64, "text": "Ich bin voll, oh Gott, ich bin, das, das hätte richtig gut klappen können."}, {"id": 603, "start": 4097.64, "end": 4101.2, "text": "Was ist eigentlich auf der Tastatur?"}, {"id": 604, "start": 4101.2, "end": 4102.2, "text": "Messern."}, {"id": 605, "start": 4102.2, "end": 4108.92, "text": "Granaten könnte ich noch mal ein bisschen mehr verwenden."}, {"id": 606, "start": 4108.92, "end": 4113.48, "text": "Gib mir den ab."}, {"id": 607, "start": 4113.48, "end": 4117.48, "text": "Ich hab übrigens immer noch nicht gecheckt, wie ich Supersprint mache."}, {"id": 608, "start": 4117.48, "end": 4122.24, "text": "Jawoll!"}, {"id": 609, "start": 4122.24, "end": 4127.8, "text": "Und?"}, {"id": 610, "start": 4127.8, "end": 4136.72, "text": "Das ist, das sieht aus wie Killer aus von Quad 4."}, {"id": 611, "start": 4136.72, "end": 4139.64, "text": "Ah!"}, {"id": 612, "start": 4139.64, "end": 4142.12, "text": "So!"}, {"id": 613, "start": 4142.12, "end": 4152.28, "text": "Ach meine Güte ey, ich spiel viel, ich, ich, ich bin voll sinnlos am reinrushen gerade"}, {"id": 614, "start": 4152.28, "end": 4153.28, "text": "ey."}, {"id": 615, "start": 4153.28, "end": 4156.72, "text": "Weil wir die letzten Runden so geowned haben, denk ich mir jetzt die ganze Zeit so, ah ja,"}, {"id": 616, "start": 4156.72, "end": 4159.72, "text": "Yolo drauf wird schon ein bisschen ordentlicher spielen."}, {"id": 617, "start": 4159.72, "end": 4161.36, "text": "Okay, jetzt hab ich gecheckt, wie man sprintet."}, {"id": 618, "start": 4161.36, "end": 4162.36, "text": "Das ist schon mal gut."}, {"id": 619, "start": 4162.36, "end": 4166.04, "text": "Aber der, der, der Rod, der Riot, der carry uns."}, {"id": 620, "start": 4166.04, "end": 4167.04, "text": "Riot carryt uns."}, {"id": 621, "start": 4167.04, "end": 4168.04, "text": "Äh, ist der SMG, hä?"}, {"id": 622, "start": 4168.04, "end": 4169.04, "text": "P7?"}, {"id": 623, "start": 4169.04, "end": 4170.04, "text": "P7 klingt nach SMG."}, {"id": 624, "start": 4170.04, "end": 4191.48, "text": "Ah, meine Güte ey, ich hör die nicht, ich hör die nicht, hörst du null und der hat"}, {"id": 625, "start": 4191.48, "end": 4192.48, "text": "mich auch nicht gehört."}, {"id": 626, "start": 4192.48, "end": 4198.4, "text": "Ey, der Typ geht ab, der Riot, der gedübelst ab."}, {"id": 627, "start": 4198.4, "end": 4217.4, "text": "Riot, da geht, da geht, der, der Audi."}, {"id": 628, "start": 4217.4, "end": 4235.92, "text": "Ja, das ist, das ist Killer House aus Quad 4."}, {"id": 629, "start": 4235.92, "end": 4244.84, "text": "Das sieht original aus irgendwie wie Killer House, aber jetzt kommt die LMG, LMG legit"}, {"id": 630, "start": 4244.84, "end": 4258.6, "text": "2-5-8, ah dafür haben wir letzte Runde übelst geowned, bam, tja, gut, so gehts auch."}, {"id": 631, "start": 4258.6, "end": 4261.8, "text": "LMG legit, ja LMG kann er."}, {"id": 632, "start": 4261.8, "end": 4267.48, "text": "Ich hab das Movement halt null raus irgendwie mit, auf der PS4, also generell, das hab ich"}, {"id": 633, "start": 4267.48, "end": 4268.48, "text": "eben, eben noch mal gespielt."}, {"id": 634, "start": 4268.48, "end": 4273.4, "text": "LMG legit, das kann er."}, {"id": 635, "start": 4273.4, "end": 4282.24, "text": "Recht ist, die sind rechts."}, {"id": 636, "start": 4282.24, "end": 4286.52, "text": "What?"}, {"id": 637, "start": 4286.52, "end": 4312.4, "text": "Du hörst die nicht, du hörst die nicht, der war recht, der war irgendwo rechts, rechts"}, {"id": 638, "start": 4312.4, "end": 4324.32, "text": "im Container, ey, laut dem Sound, du hörst den nicht, Achtung jetzt, ja, the fuck, wie"}, {"id": 639, "start": 4324.32, "end": 4330.24, "text": "geht das, wir haben beide vor uns gestanden und volle Ladung Shotgun in die Fresse, was"}, {"id": 640, "start": 4330.24, "end": 4331.24, "text": "ist das denn?"}, {"id": 641, "start": 4331.24, "end": 4339.68, "text": "Und ich hab einen euch, mit des Game, das krägt mich schon wieder auf, kann mir das"}, {"id": 642, "start": 4339.68, "end": 4340.68, "text": "irgendjemand erklären?"}, {"id": 643, "start": 4340.68, "end": 4370.36, "text": "The fuck, wenigstens geht hier Riot, was ist das, was ist das, alter geh weg, geh weg,"}, {"id": 644, "start": 4370.36, "end": 4384.92, "text": "du kannst dich null bewegen, ja, der ist über uns, okay, ey ey ey, outplayed, outsmarted,"}, {"id": 645, "start": 4384.92, "end": 4410.84, "text": "der im Tür, okay, die Runde haben wir gesagt, das Game kommt November, oder?"}, {"id": 646, "start": 4410.84, "end": 4420.2, "text": "Ist ne Perk, okay, ja, kann sein, aber ich hab jetzt zumindest gecheckt, wie man supersprintet."}, {"id": 647, "start": 4420.2, "end": 4434.72, "text": "Ach hier sieht man, ach hier guckt mal Leute, hier sieht man, wer mit was spielt, ob Controller"}, {"id": 648, "start": 4434.72, "end": 4445.44, "text": "oder Maus in Tastatur, ich glaub da neben sieht man es, man wird wahrscheinlich nur"}, {"id": 649, "start": 4445.44, "end": 4455.8, "text": "mit den Leuten gematcht, die das gleiche spielen, okay, ich glaube das wird schnell"}, {"id": 650, "start": 4455.8, "end": 4460.6, "text": "langweilig, ich mein es gibt, was, vier, drei, drei, es gibt die Waldmap, die Map,"}, {"id": 651, "start": 4460.6, "end": 4465.0, "text": "die Killhausmap und was sonst noch, ich glaub das war es, oder?"}, {"id": 652, "start": 4465.0, "end": 4479.96, "text": "Achtung wir machen das wieder bigprane, bigprane, okay, die kommen rechts, die kommen rechts,"}, {"id": 653, "start": 4479.96, "end": 4487.52, "text": "okay, okay, das sind die übelsten Tryhards Leute, das hast du schon gesehen, wie die"}, {"id": 654, "start": 4487.52, "end": 4513.0, "text": "rumjumpen, das hast du schon gesehen, wir machen jetzt wieder middle, middle rush, was?"}, {"id": 655, "start": 4513.0, "end": 4533.4, "text": "Echt, wo muss das sein, oh Schneiber, oh Schneiber, Schneiber, Schneiber, Schneiber, Schneiber"}, {"id": 656, "start": 4533.4, "end": 4549.92, "text": "Action, was, was, ich hab bei dem nicht mal geschossen, was zum Teufel ist das wieder"}, {"id": 657, "start": 4549.92, "end": 4564.96, "text": "für ne Kacke, p2p-hosting-dreck alter, was ist das, habt ihr den Müll gesehen gerade,"}, {"id": 658, "start": 4564.96, "end": 4587.28, "text": "ich war so was von drauf, ich hab dem so ins Gesicht geschossen, Achtung noch mal, Achtung"}, {"id": 659, "start": 4587.28, "end": 4609.04, "text": "huge, huge play."}, {"id": 660, "start": 4609.04, "end": 4633.24, "text": "Ach meine Fresse ey, das gibt's doch nicht, ah danke, klar, das hat schon, kein quickscope,"}, {"id": 661, "start": 4633.24, "end": 4659.08, "text": "60 quickscopes, normale quickscopes gibt's nicht, what, von, von wo, damn, okay, okay,"}, {"id": 662, "start": 4659.08, "end": 4681.56, "text": "bam, wrecked, ich darf mal nicht so auf die Finger hauen, einfach mal abgewartet, 5-3,"}, {"id": 663, "start": 4681.56, "end": 4701.76, "text": "okay, was, was zum Teufel trifft mich hier die ganze Zeit, ach da oben, ah shit, da kann"}, {"id": 664, "start": 4701.76, "end": 4712.48, "text": "man ja hoch, das ist eigentlich ne gute Idee, das muss ich mir merken, können wir auf unserer"}, {"id": 665, "start": 4712.48, "end": 4720.52, "text": "Seite auch machen, okay wir können das gewinnen, wir können das gewinnen, ich muss, ich muss"}, {"id": 666, "start": 4720.52, "end": 4746.24, "text": "die nur, ich muss die nur hauen, alle, okay, Assault rifle, fuck, Alter was ist das, was"}, {"id": 667, "start": 4746.24, "end": 4758.04, "text": "ist das, noob tubed, ich wurde noob tubed, oder, kann das sein, kann das sein, dass ich"}, {"id": 668, "start": 4758.04, "end": 4775.24, "text": "gerade noob tubed wurde, nee, nee wurde ich nicht, was denn dann, ich wurde noob tubed,"}, {"id": 669, "start": 4775.24, "end": 4797.32, "text": "Achtung, Mittelrat, jetzt, jetzt, gut, gut, play, oh nee, schon wieder genoob tubed, gibt's"}, {"id": 670, "start": 4797.32, "end": 4823.28, "text": "doch nicht ey, das gibt's doch nicht, oh, na gut, sag gut, was willst du machen, du kannst"}, {"id": 671, "start": 4823.28, "end": 4831.6, "text": "nur den 2 on 2 Modus spielen, auf nur den gleichen 3 Maps, ähm, tja, also läuft's"}, {"id": 672, "start": 4831.6, "end": 4841.76, "text": "in 30 oder 60, also es hat auf jeden Fall deutliche Drops unter 30, bei dem, auf manchen,"}, {"id": 673, "start": 4841.76, "end": 4850.4, "text": "in manchen Situationen, ähm, also ich würd eher 30 sagen, aber eigentlich läuft COD"}, {"id": 674, "start": 4850.4, "end": 4858.2, "text": "immer in 60, wahrscheinlich, 60, wahrscheinlich doch 60, ich würd sagen normalerweise sind"}, {"id": 675, "start": 4858.2, "end": 4865.24, "text": "60, doch, das sind 60, 60, wobei, das fühlt sich schon ziemlich lackey an, ist das so"}, {"id": 676, "start": 4865.24, "end": 4871.72, "text": "seh, oh, wir haben diese komische, diese komische, ähm, Singleschuss Sniper, Achtung, die,"}, {"id": 677, "start": 4871.72, "end": 4874.84, "text": "die werden jetzt geohnt in der Mitte, wir straven jetzt links raus und one shot'n'"}, {"id": 678, "start": 4874.84, "end": 4902.52, "text": "i2, wat, hinter mir, jawoll, wallhack confirmed, tschu, tschu, tschu, tschu, tschu, ist das"}, {"id": 679, "start": 4902.52, "end": 4907.48, "text": "überhaupt ne Singleschuss Waffe, oder könnt ich die einfach durchdrücken, ok, jetzt strafen"}, {"id": 680, "start": 4907.48, "end": 4926.04, "text": "wir rechts raus und one shot'n' was, Moment, ich muss mich heilen, na gut, da kannste"}, {"id": 681, "start": 4926.04, "end": 4937.08, "text": "nix machen, Spritze ist Q, wenn man's ausgerüstet hat, das ist random, das, das Loadout ist"}, {"id": 682, "start": 4937.08, "end": 4942.48, "text": "komplett random, jetzt hab ich auf Q, jetzt hab ich hier, äh, was heißt Q, äh, Q halt,"}, {"id": 683, "start": 4942.48, "end": 4959.36, "text": "keine Ahnung, was das gemapped ist, was, alter, wo die alle immer herkommen, ey, aus dem Ruckels"}, {"id": 684, "start": 4959.36, "end": 4967.48, "text": "zwischendurch, ja, LW Flip, so sieht's aus, es fühlt sich langsam an, ja, doch, es fühlt"}, {"id": 685, "start": 4967.48, "end": 4978.4, "text": "sich an, das ist aber gar nicht mal so übel, was willst du da machen, wenn du von beiden"}, {"id": 686, "start": 4978.4, "end": 4999.04, "text": "Seiten gerusht wirst, da machst du nix, was, was, was willst du da machen, ne, 1M14, Achtung,"}, {"id": 687, "start": 4999.04, "end": 5010.56, "text": "ich weiß nicht, wisst ihr, was wir jetzt machen, ich hab keine Ahnung, wie du mich so schnell"}, {"id": 688, "start": 5010.56, "end": 5017.72, "text": "bashen, ich hab kein, kein, kein Placentschürmer, wie das, wie das Fonster, gibt nur 3 Maps,"}, {"id": 689, "start": 5017.72, "end": 5039.12, "text": "was, da war ich doch überhaupt nicht, es gibt nur 3 Maps, ja, ok, kein Schürmer,"}, {"id": 690, "start": 5039.12, "end": 5062.16, "text": "aber ich glaube, es gibt nur 3, ja, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 691, "start": 5062.16, "end": 5078.56, "text": "ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 692, "start": 5078.56, "end": 5091.04, "text": "ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 693, "start": 5091.04, "end": 5093.04, "text": "Jetzt so"}, {"id": 694, "start": 5097.04, "end": 5099.04, "text": "What the fuck"}, {"id": 695, "start": 5099.04, "end": 5101.04, "text": "Was geht mir den Tuts ab"}, {"id": 696, "start": 5105.04, "end": 5107.04, "text": "Alter"}, {"id": 697, "start": 5107.04, "end": 5109.04, "text": "Was soll ich denn da machen"}, {"id": 698, "start": 5109.04, "end": 5111.04, "text": "Also ich war im Team 07"}, {"id": 699, "start": 5111.04, "end": 5122.04, "text": "Was geht mir den ab"}, {"id": 700, "start": 5122.04, "end": 5124.04, "text": "Ja ja Voice Chat ist an, aber ich habe Voice Chat aus"}, {"id": 701, "start": 5132.04, "end": 5134.04, "text": "Ne ich mach nicht Voice an"}, {"id": 702, "start": 5134.04, "end": 5137.04, "text": "Voice ist in jedem Multiplayer zu Voice übelst toxic"}, {"id": 703, "start": 5137.04, "end": 5139.04, "text": "Das war auch XXSkullXX"}, {"id": 704, "start": 5139.04, "end": 5141.04, "text": "Oh ja 360Skull"}, {"id": 705, "start": 5148.04, "end": 5150.04, "text": "Oh da kennt mir den ernsthaft"}, {"id": 706, "start": 5151.04, "end": 5153.04, "text": "Motionplur"}, {"id": 707, "start": 5153.04, "end": 5155.04, "text": "Oh ja Motionplur muss aus"}, {"id": 708, "start": 5155.04, "end": 5157.04, "text": "Falls Motionplur wirklich ausgestellt werden kann"}, {"id": 709, "start": 5157.04, "end": 5159.04, "text": "Ne geht nicht weil"}, {"id": 710, "start": 5159.04, "end": 5161.04, "text": "General"}, {"id": 711, "start": 5163.04, "end": 5165.04, "text": "Ah doch weg"}, {"id": 712, "start": 5165.04, "end": 5169.04, "text": "Weg"}, {"id": 713, "start": 5169.04, "end": 5189.04, "text": "Okay"}, {"id": 714, "start": 5199.04, "end": 5201.04, "text": "Also ich muss euch sagen"}, {"id": 715, "start": 5201.04, "end": 5203.04, "text": "Die Map wie wir vorher gespielt haben"}, {"id": 716, "start": 5203.04, "end": 5205.04, "text": "Diese"}, {"id": 717, "start": 5206.04, "end": 5207.04, "text": "Ja die die die"}, {"id": 718, "start": 5207.04, "end": 5209.04, "text": "Die halt vorher die war besser"}, {"id": 719, "start": 5209.04, "end": 5225.04, "text": "Der wollt mich noobtuben"}, {"id": 720, "start": 5225.04, "end": 5227.04, "text": "Man hört die echt null"}, {"id": 721, "start": 5227.04, "end": 5229.04, "text": "Man hört die Gegner gar nicht"}, {"id": 722, "start": 5229.04, "end": 5231.04, "text": "Zumindest nicht da wo sie angeblich sind"}, {"id": 723, "start": 5231.04, "end": 5233.04, "text": "Gibt es noch Selfie, ja wenn man es ausgerüstet hat"}, {"id": 724, "start": 5233.04, "end": 5235.04, "text": "Aber die Zusammensetzung von Waffen"}, {"id": 725, "start": 5235.04, "end": 5237.04, "text": "Und Gadgets ist ja ziemlich random"}, {"id": 726, "start": 5243.04, "end": 5245.04, "text": "Rechts"}, {"id": 727, "start": 5245.04, "end": 5247.04, "text": "Outplayed"}, {"id": 728, "start": 5247.04, "end": 5249.04, "text": "Outplayed des Todes"}, {"id": 729, "start": 5249.04, "end": 5251.04, "text": "Ja"}, {"id": 730, "start": 5255.04, "end": 5257.04, "text": "Okay"}, {"id": 731, "start": 5257.04, "end": 5259.04, "text": "Okay"}, {"id": 732, "start": 5259.04, "end": 5261.04, "text": "Okay"}, {"id": 733, "start": 5261.04, "end": 5263.04, "text": "Okay"}, {"id": 734, "start": 5263.04, "end": 5265.04, "text": "Okay"}, {"id": 735, "start": 5265.04, "end": 5267.04, "text": "Okay"}, {"id": 736, "start": 5267.04, "end": 5269.04, "text": "Okay"}, {"id": 737, "start": 5269.04, "end": 5271.04, "text": "Okay"}, {"id": 738, "start": 5271.04, "end": 5273.04, "text": "Okay"}, {"id": 739, "start": 5273.04, "end": 5275.04, "text": "Okay"}, {"id": 740, "start": 5275.04, "end": 5277.04, "text": "Okay"}, {"id": 741, "start": 5277.04, "end": 5279.04, "text": "Okay"}, {"id": 742, "start": 5279.04, "end": 5281.04, "text": "Okay"}, {"id": 743, "start": 5281.04, "end": 5283.04, "text": "Okay"}, {"id": 744, "start": 5291.04, "end": 5293.04, "text": "Achtung Grenade"}, {"id": 745, "start": 5293.04, "end": 5295.04, "text": "Der ist oben"}, {"id": 746, "start": 5295.04, "end": 5312.04, "text": "Ich hab irgendwie das Gefühl, also entweder bin ich echt, also meine Reaktionen sucken einfach nur oder es ist wieder P2P, weil bei dem hab ich wieder nicht geschossen."}, {"id": 747, "start": 5312.04, "end": 5315.04, "text": "Ich glaube es ist P2P, Suckerkacke."}, {"id": 748, "start": 5315.04, "end": 5320.04, "text": "Richtig Boomer."}, {"id": 749, "start": 5320.04, "end": 5340.04, "text": "Damn."}, {"id": 750, "start": 5340.04, "end": 5345.04, "text": "Der oben, ich glaub der ist oben oder?"}, {"id": 751, "start": 5345.04, "end": 5354.04, "text": "Voll ins Knie."}, {"id": 752, "start": 5354.04, "end": 5366.04, "text": "Was für ein Skyrim."}, {"id": 753, "start": 5366.04, "end": 5377.04, "text": "Achtung jetzt hier, huge play."}, {"id": 754, "start": 5377.04, "end": 5380.04, "text": "Bam, huge play."}, {"id": 755, "start": 5380.04, "end": 5388.04, "text": "Aber halt was für ein Aim."}, {"id": 756, "start": 5388.04, "end": 5393.04, "text": "Was macht der sich von mir killen lassen, keine Ahnung."}, {"id": 757, "start": 5393.04, "end": 5396.04, "text": "Ruhig Schneiber, Schneiber."}, {"id": 758, "start": 5396.04, "end": 5399.04, "text": "Links raus Draven und."}, {"id": 759, "start": 5399.04, "end": 5415.04, "text": "Ha."}, {"id": 760, "start": 5415.04, "end": 5428.04, "text": "10 2, das war doch mal ne Runde."}, {"id": 761, "start": 5428.04, "end": 5430.04, "text": "10 2, so muss das sein."}, {"id": 762, "start": 5430.04, "end": 5439.04, "text": "Der andere ist gleich wieder instant rage."}, {"id": 763, "start": 5439.04, "end": 5448.04, "text": "Jetzt kommt der Chopper Gunner."}, {"id": 764, "start": 5448.04, "end": 5457.04, "text": "Erst mal Chopper Gunner rausholen."}, {"id": 765, "start": 5457.04, "end": 5460.04, "text": "Wobei Chopper Gunner kann man schlecht nachmachen."}, {"id": 766, "start": 5460.04, "end": 5472.04, "text": "Das war er."}, {"id": 767, "start": 5472.04, "end": 5475.04, "text": "Der Two Eats Clan."}, {"id": 768, "start": 5475.04, "end": 5478.04, "text": "Mal gucken ob es wirklich Two Eats wird jetzt."}, {"id": 769, "start": 5478.04, "end": 5480.04, "text": "Auch wieder diese Drecks Map."}, {"id": 770, "start": 5480.04, "end": 5483.04, "text": "Oh Two Eats ist bei mir, der hat schon so ein Pro Namen."}, {"id": 771, "start": 5483.04, "end": 5490.04, "text": "Achmed Mubarak 4411."}, {"id": 772, "start": 5490.04, "end": 5494.04, "text": "Da kann nichts schief gehen."}, {"id": 773, "start": 5494.04, "end": 5497.04, "text": "Wir machen Big Brain Play."}, {"id": 774, "start": 5497.04, "end": 5500.04, "text": "Wir switchen Pistole."}, {"id": 775, "start": 5500.04, "end": 5502.04, "text": "Und treffen nix."}, {"id": 776, "start": 5502.04, "end": 5523.04, "text": "Ich fand das Play sinnvoll."}, {"id": 777, "start": 5523.04, "end": 5535.04, "text": "Wir switchen wieder Pistole."}, {"id": 778, "start": 5535.04, "end": 5540.04, "text": "Sag mal kann ich Pistole was hitten."}, {"id": 779, "start": 5540.04, "end": 5541.04, "text": "Au."}, {"id": 780, "start": 5541.04, "end": 5543.04, "text": "Musste weiter mal weg."}, {"id": 781, "start": 5543.04, "end": 5546.04, "text": "Piss dich alle."}, {"id": 782, "start": 5546.04, "end": 5572.04, "text": "Der ist da oben irgendwo."}, {"id": 783, "start": 5572.04, "end": 5576.04, "text": "Was zum Teufel, ich hab den gar nicht gesehen."}, {"id": 784, "start": 5576.04, "end": 5578.04, "text": "Ich hab ihn nicht gesehen."}, {"id": 785, "start": 5578.04, "end": 5581.04, "text": "Ach von hinten."}, {"id": 786, "start": 5581.04, "end": 5582.04, "text": "Ha."}, {"id": 787, "start": 5582.04, "end": 5583.04, "text": "Fuck."}, {"id": 788, "start": 5583.04, "end": 5584.04, "text": "Outplayed."}, {"id": 789, "start": 5584.04, "end": 5586.04, "text": "Huge Outplayed."}, {"id": 790, "start": 5586.04, "end": 5596.04, "text": "Mega Outplayed."}, {"id": 791, "start": 5596.04, "end": 5599.04, "text": "Der ist da hinten, der ist immer noch da."}, {"id": 792, "start": 5599.04, "end": 5607.04, "text": "Der Dude ist immer noch dahinter."}, {"id": 793, "start": 5607.04, "end": 5610.04, "text": "Ja der ist gehitted, Gott."}, {"id": 794, "start": 5610.04, "end": 5612.04, "text": "Ja nur diesen einen Modus."}, {"id": 795, "start": 5612.04, "end": 5616.04, "text": "Ja nur diesen einen Modus."}, {"id": 796, "start": 5616.04, "end": 5619.04, "text": "Das sackt ein bisschen."}, {"id": 797, "start": 5619.04, "end": 5630.04, "text": "Ich bin headset, ich hab einen MMX 300."}, {"id": 798, "start": 5630.04, "end": 5639.04, "text": "Der ist fett gehittert."}, {"id": 799, "start": 5639.04, "end": 5646.04, "text": "Au."}, {"id": 800, "start": 5646.04, "end": 5648.04, "text": "Der ist oben gewesen."}, {"id": 801, "start": 5648.04, "end": 5652.04, "text": "Erwischt."}, {"id": 802, "start": 5652.04, "end": 5654.04, "text": "Two Piece."}, {"id": 803, "start": 5654.04, "end": 5658.04, "text": "Wie kommt das so anspielend, hat's jedem in der PS4 keiner spielen."}, {"id": 804, "start": 5658.04, "end": 5661.04, "text": "Und ja der Sound ist mega komisch."}, {"id": 805, "start": 5661.04, "end": 5668.04, "text": "Wir müssen gleich mal, erinnert mich mal bitte dran, dass wir in die Soundsettings gehen gleich."}, {"id": 806, "start": 5668.04, "end": 5683.04, "text": "Wir gehen gleich in die Soundsettings."}, {"id": 807, "start": 5683.04, "end": 5690.04, "text": "What the fuck."}, {"id": 808, "start": 5690.04, "end": 5700.04, "text": "Lol."}, {"id": 809, "start": 5700.04, "end": 5702.04, "text": "Der muss zum Objective."}, {"id": 810, "start": 5702.04, "end": 5704.04, "text": "Links, links, links."}, {"id": 811, "start": 5704.04, "end": 5705.04, "text": "Oder?"}, {"id": 812, "start": 5705.04, "end": 5706.04, "text": "Ich hab links gehört."}, {"id": 813, "start": 5706.04, "end": 5707.04, "text": "Ja I'm Objective ist der Typ."}, {"id": 814, "start": 5707.04, "end": 5708.04, "text": "I'm Objective, I'm Objective."}, {"id": 815, "start": 5708.04, "end": 5709.04, "text": "Oder?"}, {"id": 816, "start": 5709.04, "end": 5710.04, "text": "Da links, links."}, {"id": 817, "start": 5710.04, "end": 5711.04, "text": "Da ist er doch, ich seh ihn doch."}, {"id": 818, "start": 5711.04, "end": 5712.04, "text": "Ah."}, {"id": 819, "start": 5712.04, "end": 5728.04, "text": "Die Maps sind viel zu klein."}, {"id": 820, "start": 5728.04, "end": 5743.04, "text": "Ah."}, {"id": 821, "start": 5743.04, "end": 5748.04, "text": "Pst."}, {"id": 822, "start": 5748.04, "end": 5750.04, "text": "Du hörst die Gegner so merkwürdig."}, {"id": 823, "start": 5750.04, "end": 5755.04, "text": "Ich hab den von hinten gehört, aber, aber drei Kilometer weg ey."}, {"id": 824, "start": 5755.04, "end": 5758.04, "text": "Und auf einmal ist er hinter einem."}, {"id": 825, "start": 5758.04, "end": 5759.04, "text": "Wartet mal."}, {"id": 826, "start": 5759.04, "end": 5760.04, "text": "Kann man irgendwas?"}, {"id": 827, "start": 5760.04, "end": 5761.04, "text": "Kann man?"}, {"id": 828, "start": 5761.04, "end": 5763.04, "text": "Nee jetzt nicht, das in der Runde suckt."}, {"id": 829, "start": 5763.04, "end": 5764.04, "text": "Oh jetzt kommt Pistolenstells."}, {"id": 830, "start": 5764.04, "end": 5765.04, "text": "Okay."}, {"id": 831, "start": 5765.04, "end": 5782.04, "text": "Ha, wie ich vorbei gerannt bin."}, {"id": 832, "start": 5782.04, "end": 5787.04, "text": "Der macht das jetzt da."}, {"id": 833, "start": 5787.04, "end": 5792.04, "text": "Der, der Achmed, der Achmed macht das."}, {"id": 834, "start": 5792.04, "end": 5799.04, "text": "Komm Achmed, Achmed, Achmed, Achmed, Achmed."}, {"id": 835, "start": 5799.04, "end": 5801.04, "text": "Achmed, Achmed please."}, {"id": 836, "start": 5801.04, "end": 5802.04, "text": "Nein."}, {"id": 837, "start": 5802.04, "end": 5805.04, "text": "Achmed macht das nicht."}, {"id": 838, "start": 5805.04, "end": 5810.04, "text": "Okay jetzt müssen wir was reißen."}, {"id": 839, "start": 5810.04, "end": 5813.04, "text": "Jetzt müssen wir was reißen."}, {"id": 840, "start": 5813.04, "end": 5838.04, "text": "Die F4, das können wir nicht auf uns sitzen lassen."}, {"id": 841, "start": 5838.04, "end": 5843.04, "text": "Wo?"}, {"id": 842, "start": 5843.04, "end": 5851.04, "text": "Ha, erwischt."}, {"id": 843, "start": 5851.04, "end": 5862.04, "text": "Eats clap."}, {"id": 844, "start": 5862.04, "end": 5868.04, "text": "Okay."}, {"id": 845, "start": 5868.04, "end": 5871.04, "text": "Äh, gut."}, {"id": 846, "start": 5871.04, "end": 5878.04, "text": "Ha, wenn die alle zu mir kommen ist er auch in Ordnung."}, {"id": 847, "start": 5878.04, "end": 5879.04, "text": "Oh, huge."}, {"id": 848, "start": 5879.04, "end": 5882.04, "text": "Zweiter, zweiter Schuss, der war ja richtig."}, {"id": 849, "start": 5882.04, "end": 5884.04, "text": "Jaja, ich hab jetzt diesen komischen Adapter dran."}, {"id": 850, "start": 5884.04, "end": 5889.04, "text": "Ich hab mir mit PS4 Controllers sowas von krass gesagt ey."}, {"id": 851, "start": 5889.04, "end": 5893.04, "text": "Ich sage jetzt zwar immer noch."}, {"id": 852, "start": 5893.04, "end": 5912.04, "text": "Kann er mal sterben?"}, {"id": 853, "start": 5912.04, "end": 5926.04, "text": "Er ist oben."}, {"id": 854, "start": 5926.04, "end": 5935.04, "text": "Big brain."}, {"id": 855, "start": 5935.04, "end": 5942.04, "text": "Naja, wenn man sich hinkniet, dann hört man es irgendwie besser, warum auch immer."}, {"id": 856, "start": 5942.04, "end": 5944.04, "text": "Nee, hab ich noch nicht."}, {"id": 857, "start": 5944.04, "end": 5946.04, "text": "Herz 93."}, {"id": 858, "start": 5946.04, "end": 5948.04, "text": "10-4, damit kann ich leben."}, {"id": 859, "start": 5948.04, "end": 5954.04, "text": "Also wenn die Games immer in der Kategorie sind, kann man sich wirklich nicht beschweren."}, {"id": 860, "start": 5954.04, "end": 5964.04, "text": "10-4, zwei Assists, so ist das doch gut."}, {"id": 861, "start": 5964.04, "end": 5968.04, "text": "Ist eigentlich In-Game-Lautstärke gut?"}, {"id": 862, "start": 5968.04, "end": 5973.04, "text": "USB."}, {"id": 863, "start": 5973.04, "end": 5978.04, "text": "In-Game-Lautstärke gut und sonst passt das alles."}, {"id": 864, "start": 5978.04, "end": 5980.04, "text": "Nice."}, {"id": 865, "start": 5980.04, "end": 5984.04, "text": "Übrigens, ne, Leute."}, {"id": 866, "start": 5984.04, "end": 5986.04, "text": "Genau, Farmas mit Tigerstreifen."}, {"id": 867, "start": 5986.04, "end": 5991.04, "text": "Übrigens Leute, wir haben ein Emote jetzt für alle Subs, nur mal so, ne."}, {"id": 868, "start": 5991.04, "end": 5995.04, "text": "Für alle die es noch nicht mitgekriegt haben."}, {"id": 869, "start": 5995.04, "end": 5997.04, "text": "Spielt sich das so wie früher?"}, {"id": 870, "start": 5997.04, "end": 6003.04, "text": "Nö."}, {"id": 871, "start": 6003.04, "end": 6006.04, "text": "Das ist wieder die Single-Single-Schuss."}, {"id": 872, "start": 6006.04, "end": 6013.04, "text": "Okay, wir gehen jetzt, wir pushen jetzt rechts über das Ding und stellsen sie voll weg."}, {"id": 873, "start": 6013.04, "end": 6020.04, "text": "Achtung."}, {"id": 874, "start": 6020.04, "end": 6022.04, "text": "Da oben ist er, ich seh ihn."}, {"id": 875, "start": 6022.04, "end": 6032.04, "text": "Hä?"}, {"id": 876, "start": 6032.04, "end": 6034.04, "text": "Äh, ja, das war dumm."}, {"id": 877, "start": 6034.04, "end": 6036.04, "text": "Soundsetting, Soundsetting sollen wir gucken, richtig."}, {"id": 878, "start": 6036.04, "end": 6039.04, "text": "Äh, Options, Sound."}, {"id": 879, "start": 6039.04, "end": 6043.04, "text": "Äh, Mute, Controller, Sound, okay, Audio Mix, Flat."}, {"id": 880, "start": 6043.04, "end": 6045.04, "text": "Okay, was ist Flat?"}, {"id": 881, "start": 6045.04, "end": 6047.04, "text": "Headphones, Headphones."}, {"id": 882, "start": 6047.04, "end": 6049.04, "text": "Headphones ist besser."}, {"id": 883, "start": 6049.04, "end": 6051.04, "text": "Das hört sich schon viel besser an."}, {"id": 884, "start": 6051.04, "end": 6053.04, "text": "Was auch immer Flat war."}, {"id": 885, "start": 6053.04, "end": 6062.04, "text": "Ja, das hört..."}, {"id": 886, "start": 6062.04, "end": 6064.04, "text": "Kann mir mal irgendjemand erklären warum ich die nicht hitte?"}, {"id": 887, "start": 6064.04, "end": 6071.04, "text": "Ich seh die überhaupt nicht richtig."}, {"id": 888, "start": 6071.04, "end": 6076.04, "text": "Hallo, Maus."}, {"id": 889, "start": 6076.04, "end": 6083.04, "text": "Die hat sich nicht gedreht nach links gerade."}, {"id": 890, "start": 6083.04, "end": 6085.04, "text": "Das ist keine Shotgun."}, {"id": 891, "start": 6085.04, "end": 6104.04, "text": "Das ist dieses Range-Ding, oder?"}, {"id": 892, "start": 6104.04, "end": 6106.04, "text": "Äh."}, {"id": 893, "start": 6106.04, "end": 6108.04, "text": "Och Mann, der Typ ist wieder gelieft."}, {"id": 894, "start": 6108.04, "end": 6111.04, "text": "Das sagt doch."}, {"id": 895, "start": 6111.04, "end": 6114.04, "text": "Wisst ihr was, wir liefen jetzt auch."}, {"id": 896, "start": 6114.04, "end": 6117.04, "text": "Wie lief man?"}, {"id": 897, "start": 6117.04, "end": 6120.04, "text": "Options."}, {"id": 898, "start": 6120.04, "end": 6122.04, "text": "Mein, wozu sollen wir drin bleiben?"}, {"id": 899, "start": 6122.04, "end": 6129.04, "text": "Two-on-one ist kacke."}, {"id": 900, "start": 6129.04, "end": 6141.04, "text": "Guck mal, was gibt's denn nochmal für Sound-Settings hier?"}, {"id": 901, "start": 6141.04, "end": 6146.04, "text": "The Infinity-One-Mix."}, {"id": 902, "start": 6146.04, "end": 6149.04, "text": "Each Mix Changes Sound-Balancing."}, {"id": 903, "start": 6149.04, "end": 6153.04, "text": "Dann wäre es doch sinnvoll, die Dinger nicht Headphones One, Two, Three zu nennen,"}, {"id": 904, "start": 6153.04, "end": 6161.04, "text": "sondern danach, was wir tun, oder?"}, {"id": 905, "start": 6161.04, "end": 6169.04, "text": "Ich wusste gar nicht, dass der Controller Sounds macht."}, {"id": 906, "start": 6169.04, "end": 6182.04, "text": "Weiter geht's."}, {"id": 907, "start": 6182.04, "end": 6185.04, "text": "Ich würde mal interessieren, wie viel Neues mal 0,9."}, {"id": 908, "start": 6185.04, "end": 6186.04, "text": "Dankeschön."}, {"id": 909, "start": 6186.04, "end": 6189.04, "text": "Leute, ich kann leider nicht nachgucken, wer alles gesubbt hat."}, {"id": 910, "start": 6189.04, "end": 6191.04, "text": "Falls ich irgendjemand vergessen hab, zu erwähnen."}, {"id": 911, "start": 6191.04, "end": 6192.04, "text": "Dankeschön für den Sub."}, {"id": 912, "start": 6192.04, "end": 6193.04, "text": "Ich guck nachher nochmal nach."}, {"id": 913, "start": 6193.04, "end": 6196.04, "text": "Ich hab letztens übrigens eine 25-Dollar-Donation verpasst"}, {"id": 914, "start": 6196.04, "end": 6198.04, "text": "und ich hab mein Donation-Link jetzt auch rausgenommen,"}, {"id": 915, "start": 6198.04, "end": 6201.04, "text": "weil die Donation-Anzeige kaputt ist."}, {"id": 916, "start": 6201.04, "end": 6204.04, "text": "Die mach ich erst wieder rein, während die Donation drin ist."}, {"id": 917, "start": 6204.04, "end": 6208.04, "text": "Also falls derjenige zuguckt, der mir 25 Euro doniert hat,"}, {"id": 918, "start": 6208.04, "end": 6213.04, "text": "Dankeschön für die 25 Euro."}, {"id": 919, "start": 6213.04, "end": 6216.04, "text": "Es hat's leider nicht angezeigt."}, {"id": 920, "start": 6216.04, "end": 6223.04, "text": "Okay, jetzt machen wir wieder unsere Huge-Brain-Taktik."}, {"id": 921, "start": 6223.04, "end": 6224.04, "text": "Achtung, passt mal auf."}, {"id": 922, "start": 6224.04, "end": 6225.04, "text": "Huge-Brain."}, {"id": 923, "start": 6225.04, "end": 6230.04, "text": "Ich zeig's euch jetzt."}, {"id": 924, "start": 6230.04, "end": 6242.04, "text": "Oh nee, er hat mich geplockt."}, {"id": 925, "start": 6242.04, "end": 6244.04, "text": "Das war Huge-Brain."}, {"id": 926, "start": 6244.04, "end": 6245.04, "text": "Das war richtig Huge-Brain."}, {"id": 927, "start": 6245.04, "end": 6249.04, "text": "Mit dem Unterschied, dass er mich gekillt hat."}, {"id": 928, "start": 6249.04, "end": 6256.04, "text": "Das war richtig Huge-Brain umflankt."}, {"id": 929, "start": 6256.04, "end": 6260.04, "text": "Nicht Next Level, aber nicht Next Level genug."}, {"id": 930, "start": 6260.04, "end": 6262.04, "text": "Ach, wir haben wieder ein Noob-Tube."}, {"id": 931, "start": 6262.04, "end": 6264.04, "text": "Jetzt aber."}, {"id": 932, "start": 6264.04, "end": 6274.04, "text": "Ich will, dass es mal klappt."}, {"id": 933, "start": 6274.04, "end": 6276.04, "text": "Scheiße, man."}, {"id": 934, "start": 6276.04, "end": 6277.04, "text": "Die machen das gut."}, {"id": 935, "start": 6277.04, "end": 6281.04, "text": "Die machen das echt nicht übel, die Gegner."}, {"id": 936, "start": 6281.04, "end": 6287.04, "text": "Hat jemand von euch eine PS4 Pro?"}, {"id": 937, "start": 6287.04, "end": 6289.04, "text": "Und hat das schon mal gespielt?"}, {"id": 938, "start": 6289.04, "end": 6292.04, "text": "Oh, jetzt hat er sie geohnt."}, {"id": 939, "start": 6292.04, "end": 6301.04, "text": "Mich würde interessieren, ob die Auflösung besser ist."}, {"id": 940, "start": 6301.04, "end": 6302.04, "text": "Okay, jetzt sind wir auf der Seite."}, {"id": 941, "start": 6302.04, "end": 6313.04, "text": "Jetzt mal was, ich hab ne Idee."}, {"id": 942, "start": 6313.04, "end": 6314.04, "text": "Haha, erwischt."}, {"id": 943, "start": 6314.04, "end": 6328.04, "text": "Outplayed."}, {"id": 944, "start": 6328.04, "end": 6329.04, "text": "Ace, genau."}, {"id": 945, "start": 6329.04, "end": 6346.04, "text": "Mal noch mal, das hat eigentlich ganz gut funktioniert."}, {"id": 946, "start": 6346.04, "end": 6349.04, "text": "Okay, so gehts auch."}, {"id": 947, "start": 6349.04, "end": 6351.04, "text": "Outcamped."}, {"id": 948, "start": 6351.04, "end": 6353.04, "text": "Haben uns die Typen die erste Runde auch?"}, {"id": 949, "start": 6353.04, "end": 6358.04, "text": "Die erste Runde haben die Typen einfach im Spawn gestanden und nichts gemacht."}, {"id": 950, "start": 6358.04, "end": 6361.04, "text": "So, mal gucken, ob jetzt meine Special-Tactic funktioniert."}, {"id": 951, "start": 6361.04, "end": 6370.04, "text": "Die muss doch irgendwann mal klappen."}, {"id": 952, "start": 6370.04, "end": 6371.04, "text": "Fuck."}, {"id": 953, "start": 6371.04, "end": 6373.04, "text": "Nein."}, {"id": 954, "start": 6373.04, "end": 6374.04, "text": "Okay, du machst das."}, {"id": 955, "start": 6374.04, "end": 6375.04, "text": "Alter, du machst das."}, {"id": 956, "start": 6375.04, "end": 6382.04, "text": "Nein, macht er nicht."}, {"id": 957, "start": 6382.04, "end": 6384.04, "text": "Drei, zwei."}, {"id": 958, "start": 6384.04, "end": 6387.04, "text": "Übelster Skill-Action."}, {"id": 959, "start": 6387.04, "end": 6391.04, "text": "Okay, jetzt geh mal rechts."}, {"id": 960, "start": 6391.04, "end": 6411.04, "text": "Ah, der Slider-Antin müsste ich noch mal öfters verwenden."}, {"id": 961, "start": 6411.04, "end": 6414.04, "text": "Fuck, ich kacknup, äh."}, {"id": 962, "start": 6414.04, "end": 6418.04, "text": "Muss man mal merken, wo die Dinger sind, wo man sich dahinter stellen kann auf der Map."}, {"id": 963, "start": 6418.04, "end": 6421.04, "text": "Die stehen immer offen und die Gegner stehen immer in der Deckung."}, {"id": 964, "start": 6421.04, "end": 6423.04, "text": "Das ist übelst nicht Five Head."}, {"id": 965, "start": 6423.04, "end": 6433.04, "text": "Das ist Low-Low-IQ-Place."}, {"id": 966, "start": 6433.04, "end": 6440.04, "text": "Okay, outsplayed."}, {"id": 967, "start": 6440.04, "end": 6447.04, "text": "Wow."}, {"id": 968, "start": 6447.04, "end": 6448.04, "text": "Du machst das, Kollege, du machst das."}, {"id": 969, "start": 6448.04, "end": 6451.04, "text": "Easy, easy win."}, {"id": 970, "start": 6451.04, "end": 6453.04, "text": "Warum war das kein Hit?"}, {"id": 971, "start": 6453.04, "end": 6456.04, "text": "Warum war das denn gerade kein Hit?"}, {"id": 972, "start": 6456.04, "end": 6457.04, "text": "Rechts, rechts, rechts, rechts, rechts."}, {"id": 973, "start": 6457.04, "end": 6459.04, "text": "Ich höre ihn rechts, Kollege."}, {"id": 974, "start": 6459.04, "end": 6463.04, "text": "Ja, schreckt."}, {"id": 975, "start": 6463.04, "end": 6465.04, "text": "Jetzt müssen wir auftreten, Leute."}, {"id": 976, "start": 6465.04, "end": 6473.04, "text": "Letzte Runde haben wir auch erst ein paar Runden gesucked und dann 10-4."}, {"id": 977, "start": 6473.04, "end": 6490.04, "text": "Achtung, wir machen das jetzt anders."}, {"id": 978, "start": 6490.04, "end": 6493.04, "text": "Fuck."}, {"id": 979, "start": 6493.04, "end": 6498.04, "text": "Hol mal den Friseur ran, ich glaube nicht, dass der spielen will."}, {"id": 980, "start": 6498.04, "end": 6504.04, "text": "Ich glaube nicht, dass der spielen will."}, {"id": 981, "start": 6504.04, "end": 6513.04, "text": "Okay, Shotgun Action."}, {"id": 982, "start": 6513.04, "end": 6514.04, "text": "Ach."}, {"id": 983, "start": 6514.04, "end": 6516.04, "text": "Ah, das."}, {"id": 984, "start": 6516.04, "end": 6521.04, "text": "Man müsste mal diesen, diesen super, super Rennspeed verwenden."}, {"id": 985, "start": 6521.04, "end": 6523.04, "text": "Den benutze ich so gut wie nie."}, {"id": 986, "start": 6523.04, "end": 6527.04, "text": "Der Friseur will nicht, kann es vergessen, er muss Black Desert spielen."}, {"id": 987, "start": 6527.04, "end": 6528.04, "text": "5-6."}, {"id": 988, "start": 6528.04, "end": 6532.04, "text": "Aber wir haben alle, guck mal, wir sucken alle."}, {"id": 989, "start": 6532.04, "end": 6539.04, "text": "Wobei, 50-50, K.D. ist nicht schlecht gegen halbwegs gescheite Gegner."}, {"id": 990, "start": 6539.04, "end": 6542.04, "text": "Okay, da hinten ist einer, der kommt jetzt gleich, ja?"}, {"id": 991, "start": 6542.04, "end": 6546.04, "text": "Hit."}, {"id": 992, "start": 6546.04, "end": 6551.04, "text": "Ach, die machen das mit der Pistole."}, {"id": 993, "start": 6551.04, "end": 6553.04, "text": "Ich musste unbedingt noch mehr spielen."}, {"id": 994, "start": 6553.04, "end": 6555.04, "text": "Das ist eigentlich richtig dämlich gewesen."}, {"id": 995, "start": 6555.04, "end": 6561.04, "text": "Ich habe den dreimal getroffen, hätte ich den dreimal mit der Pistole getroffen, dann wäre er dahin gewesen."}, {"id": 996, "start": 6561.04, "end": 6563.04, "text": "Oh, nice."}, {"id": 997, "start": 6563.04, "end": 6564.04, "text": "Wow."}, {"id": 998, "start": 6564.04, "end": 6566.04, "text": "Huge, der geht ab."}, {"id": 999, "start": 6566.04, "end": 6567.04, "text": "Hier."}, {"id": 1000, "start": 6567.04, "end": 6569.04, "text": "YZ54."}, {"id": 1001, "start": 6569.04, "end": 6570.04, "text": "Jawoll."}, {"id": 1002, "start": 6570.04, "end": 6571.04, "text": "5-5."}, {"id": 1003, "start": 6571.04, "end": 6572.04, "text": "Jetzt kommt es drauf an."}, {"id": 1004, "start": 6572.04, "end": 6575.04, "text": "Bis jetzt macht es Bock, aber CoD macht immer Bock, wenn es neu ist."}, {"id": 1005, "start": 6575.04, "end": 6576.04, "text": "Das wird aber nicht lange halten."}, {"id": 1006, "start": 6576.04, "end": 6581.04, "text": "Ich meine, drei Maps an einem Spiel, das ist ein bisschen, ein bisschen, ein bisschen suck."}, {"id": 1007, "start": 6581.04, "end": 6585.04, "text": "Wie, man muss nicht mit..."}, {"id": 1008, "start": 6585.04, "end": 6612.04, "text": "Ich habe es übrigens immer noch nicht gecheckt, ob das jetzt ein Shotgun ist oder nicht."}, {"id": 1009, "start": 6612.04, "end": 6618.04, "text": "Nice."}, {"id": 1010, "start": 6618.04, "end": 6622.04, "text": "Das war die Spitzrunde."}, {"id": 1011, "start": 6622.04, "end": 6625.04, "text": "Damals hat Black Ops 1, ja nice, nice."}, {"id": 1012, "start": 6625.04, "end": 6630.04, "text": "Ja, ich habe ja auch überhaupt keine Ankündigung gemacht, weder auf Twitter, noch auf YouTube, irgendetwas anzurufen,"}, {"id": 1013, "start": 6630.04, "end": 6638.04, "text": "dass heute CoD gespielt wird."}, {"id": 1014, "start": 6638.04, "end": 6642.04, "text": "Es macht schon Bock."}, {"id": 1015, "start": 6642.04, "end": 6644.04, "text": "Manchmal bugt die Lobby."}, {"id": 1016, "start": 6644.04, "end": 6646.04, "text": "Macht schon Bock."}, {"id": 1017, "start": 6646.04, "end": 6650.04, "text": "Aber ich glaube halt, also wenn wir das heute jetzt noch ein bisschen spielen,"}, {"id": 1018, "start": 6650.04, "end": 6654.04, "text": "und vielleicht morgen noch eine Runde, ich glaube, dann ist die Luft raus aus, wie gesagt,"}, {"id": 1019, "start": 6654.04, "end": 6658.04, "text": "drei Maps an einem Spielmodus."}, {"id": 1020, "start": 6658.04, "end": 6663.04, "text": "Acey130, habe ich nicht ausgerüstet, ich habe nur Chopper Gunner."}, {"id": 1021, "start": 6663.04, "end": 6667.04, "text": "Chopper Gunner, Hunde und Black Hawk."}, {"id": 1022, "start": 6667.04, "end": 6669.04, "text": "Gibt es irgendwann eine PC-Beta?"}, {"id": 1023, "start": 6669.04, "end": 6673.04, "text": "Ich glaube, am 9. September oder so."}, {"id": 1024, "start": 6673.04, "end": 6675.04, "text": "Warst du mal wieder mit Kabum beim Chinesen?"}, {"id": 1025, "start": 6675.04, "end": 6682.04, "text": "Mal wieder schon, das ist aber auch schon ein Jahr oder so her."}, {"id": 1026, "start": 6682.04, "end": 6694.04, "text": "PC-Beta gibt es glaube ich 9. September, 19.19 glaube ich, 19. September."}, {"id": 1027, "start": 6694.04, "end": 6702.04, "text": "Oh nee, Sucker-Map."}, {"id": 1028, "start": 6702.04, "end": 6704.04, "text": "Ah, Shotgun."}, {"id": 1029, "start": 6704.04, "end": 6708.04, "text": "Gut, Shotgun."}, {"id": 1030, "start": 6708.04, "end": 6709.04, "text": "Wir machen das jetzt anders."}, {"id": 1031, "start": 6709.04, "end": 6726.04, "text": "Wir gehen jetzt auf Pistole, gehen hier vorne hin und Shootern schon mal was weg."}, {"id": 1032, "start": 6726.04, "end": 6731.04, "text": "Da lebt nur noch einer, da kann er nur noch hier sein, nice."}, {"id": 1033, "start": 6731.04, "end": 6734.04, "text": "Nice, so muss das sein."}, {"id": 1034, "start": 6734.04, "end": 6738.04, "text": "Oder da, Hardscope da."}, {"id": 1035, "start": 6738.04, "end": 6743.04, "text": "Ich kann mich an das Homefront Gewinnspiel mit dem Sniper-Gameplay erinnern."}, {"id": 1036, "start": 6743.04, "end": 6760.04, "text": "Dunkel, ich weiß aber nicht mehr, was da gewesen ist."}, {"id": 1037, "start": 6760.04, "end": 6769.04, "text": "Boah, da hätte ich nicht mit der Pistole reinlaufen sollen."}, {"id": 1038, "start": 6769.04, "end": 6778.04, "text": "Das war richtig schreckt."}, {"id": 1039, "start": 6778.04, "end": 6783.04, "text": "Das war eine ordentliche Waffe."}, {"id": 1040, "start": 6783.04, "end": 6786.04, "text": "Es ruckelt."}, {"id": 1041, "start": 6786.04, "end": 6797.04, "text": "Der andere kommt links."}, {"id": 1042, "start": 6797.04, "end": 6800.04, "text": "Also ich habe keine Ahnung, wie der das überlebt hat."}, {"id": 1043, "start": 6800.04, "end": 6803.04, "text": "Sinali, Dankeschön."}, {"id": 1044, "start": 6803.04, "end": 6808.04, "text": "Also hallo an alle Sinali-Zuschauer, wer sehen will, wer Karibels abkackt, diese Runde."}, {"id": 1045, "start": 6808.04, "end": 6817.04, "text": "Aber wer gecarried wird von Hi, I'm Mori, der ist hier richtig."}, {"id": 1046, "start": 6817.04, "end": 6820.04, "text": "Jetzt aber hier."}, {"id": 1047, "start": 6820.04, "end": 6823.04, "text": "Wir machen jetzt mal anders, wir gehen jetzt auch mal links."}, {"id": 1048, "start": 6823.04, "end": 6836.04, "text": "Ich glaube das ist..."}, {"id": 1049, "start": 6836.04, "end": 6841.04, "text": "Also mit die Mitte."}, {"id": 1050, "start": 6841.04, "end": 6847.04, "text": "Der ist noch links, der ist noch links."}, {"id": 1051, "start": 6847.04, "end": 6851.04, "text": "Tja, Kollege, so nicht."}, {"id": 1052, "start": 6851.04, "end": 6855.04, "text": "Du hast dann das beste Sniper-Gameplay verloren, mein Bruder hat das gewonnen."}, {"id": 1053, "start": 6855.04, "end": 6858.04, "text": "Homefront? Was gab's denn zu gewinnen damals?"}, {"id": 1054, "start": 6858.04, "end": 6860.04, "text": "Ein Game, das Spiel?"}, {"id": 1055, "start": 6860.04, "end": 6862.04, "text": "Oh, Sniper, Sniper end, Sniper end, Achtung jetzt hier."}, {"id": 1056, "start": 6862.04, "end": 6866.04, "text": "Huge, huge Sniper."}, {"id": 1057, "start": 6866.04, "end": 6868.04, "text": "Huge Sniper."}, {"id": 1058, "start": 6868.04, "end": 6870.04, "text": "Oh fuck."}, {"id": 1059, "start": 6870.04, "end": 6872.04, "text": "Was zum..."}, {"id": 1060, "start": 6872.04, "end": 6886.04, "text": "Moment, was hat man hier am Start?"}, {"id": 1061, "start": 6886.04, "end": 6890.04, "text": "Ok, was auch immer."}, {"id": 1062, "start": 6890.04, "end": 6893.04, "text": "Ich dachte, ich habe es gegen die Kiste geworfen."}, {"id": 1063, "start": 6893.04, "end": 6908.04, "text": "Da ist er."}, {"id": 1064, "start": 6908.04, "end": 6914.04, "text": "Fuck."}, {"id": 1065, "start": 6914.04, "end": 6915.04, "text": "What?"}, {"id": 1066, "start": 6915.04, "end": 6917.04, "text": "Wie ist der denn so schnell da hingekommen jetzt?"}, {"id": 1067, "start": 6917.04, "end": 6921.04, "text": "Ja, ja, ja, fuck, Alter, richtig reingesackt."}, {"id": 1068, "start": 6921.04, "end": 6924.04, "text": "Ich wollte eigentlich auch direkt zum Objective rennen."}, {"id": 1069, "start": 6924.04, "end": 6937.04, "text": "Ich dachte, wenn er mich anhittet, dann kann er nicht so schnell in der Mitte sein, aber ist er doch."}, {"id": 1070, "start": 6937.04, "end": 6939.04, "text": "Das ist so schlecht."}, {"id": 1071, "start": 6939.04, "end": 6940.04, "text": "Das ist der Wahnsinn."}, {"id": 1072, "start": 6940.04, "end": 6944.04, "text": "Wie kann man so scheiße sein?"}, {"id": 1073, "start": 6944.04, "end": 6951.04, "text": "Wollen wir jetzt wieder aufdrehen, wieder, jetzt acht Kills in Runde."}, {"id": 1074, "start": 6951.04, "end": 6952.04, "text": "Ach, Overtime war fertig."}, {"id": 1075, "start": 6952.04, "end": 6954.04, "text": "Das war gar nicht das Objective."}, {"id": 1076, "start": 6954.04, "end": 6965.04, "text": "Was denn war?"}, {"id": 1077, "start": 6965.04, "end": 6969.04, "text": "Ok, was auch immer."}, {"id": 1078, "start": 6969.04, "end": 6975.04, "text": "Oh fuck, das ist die Spritze, ich habe eine Spritze, ich wollte gar keinen."}, {"id": 1079, "start": 6975.04, "end": 6977.04, "text": "Ok, Gott."}, {"id": 1080, "start": 6977.04, "end": 6981.04, "text": "Jetzt wird aufgedreht, muss aufgedreht werden."}, {"id": 1081, "start": 6981.04, "end": 6986.04, "text": "Ist am abkacken."}, {"id": 1082, "start": 6986.04, "end": 7004.04, "text": "Da bist du manchmal die Zeiten von YouTube, ja doch, wie es früher gewesen ist, dann definitiv, aber so wie YouTube aktuell ist, nicht."}, {"id": 1083, "start": 7004.04, "end": 7009.04, "text": "Das ruckelt übelst die Map, zack, huge."}, {"id": 1084, "start": 7009.04, "end": 7022.04, "text": "Der war hier in der Mitte, oh ne, schon wieder die Kackspritze, bin dann oben, ich dachte, ich habe."}, {"id": 1085, "start": 7022.04, "end": 7035.04, "text": "Haha, prefire, bam, outplayed."}, {"id": 1086, "start": 7035.04, "end": 7060.04, "text": "Doch, also ich vermisse das schon, wie es früher auf YouTube gewesen ist, aber aktuell auf YouTube ist es nicht."}, {"id": 1087, "start": 7060.04, "end": 7069.04, "text": "Ah, hittet, hittet, hittet."}, {"id": 1088, "start": 7069.04, "end": 7075.04, "text": "Wer ist da immer noch da, der Typ?"}, {"id": 1089, "start": 7075.04, "end": 7083.04, "text": "Ah, ging doch noch, letzten Runden war wieder besser."}, {"id": 1090, "start": 7083.04, "end": 7085.04, "text": "Kommen keine Videos mehr?"}, {"id": 1091, "start": 7085.04, "end": 7088.04, "text": "Doch, auf jeden Fall gibt es noch Videos, allerdings weiß nicht wann."}, {"id": 1092, "start": 7088.04, "end": 7091.04, "text": "Ich werde nicht meinen Account löschen oder sowas blödes."}, {"id": 1093, "start": 7091.04, "end": 7099.04, "text": "Ich meine, allein schon, ganz ehrlich, wenn ich mir den YouTube Deutschland so angucke, was ich da vorgeschlagen habe, irgendwelche Unge-Reaction-Videos."}, {"id": 1094, "start": 7099.04, "end": 7105.04, "text": "Unge ist ja auch irgendwie zu dem geworden, was er früher nicht leiden konnte."}, {"id": 1095, "start": 7105.04, "end": 7115.04, "text": "Und noch viel mehr, also Deutschland kann so übelst knicken, ja, übelst knicken."}, {"id": 1096, "start": 7115.04, "end": 7134.04, "text": "Im internationalen Bereich finde ich, hast du bessere Chancen, was zu finden, als in Deutschland."}, {"id": 1097, "start": 7134.04, "end": 7140.04, "text": "Also, es heißt nicht, dass es in Deutschland nichts Gescheites gibt, es gibt auch durchaus die einen oder anderen gescheiten Videos."}, {"id": 1098, "start": 7140.04, "end": 7151.04, "text": "Aber ich finde, du hast einfach vom Verhältnis von Bullshit zu nicht Bullshit, ist das in Deutschland schlecht."}, {"id": 1099, "start": 7151.04, "end": 7161.04, "text": "Übrigens, die Granaten gibt es nur am Anfang nicht, weil die Maps dann broken werden."}, {"id": 1100, "start": 7161.04, "end": 7177.04, "text": "Okay, ich habe den Typ nicht einmal getroffen, ne."}, {"id": 1101, "start": 7177.04, "end": 7191.04, "text": "Hör auf zu schnaufen, ja."}, {"id": 1102, "start": 7191.04, "end": 7200.04, "text": "Jetzt erwischen wir einen."}, {"id": 1103, "start": 7200.04, "end": 7216.04, "text": "Was, warum zum Teufel trifft das immer nicht richtig?"}, {"id": 1104, "start": 7216.04, "end": 7221.04, "text": "Das ist, ja, das ist der Max, der Max der gerade mit 01 übelst, kacke ist er auch."}, {"id": 1105, "start": 7221.04, "end": 7223.04, "text": "Das ist der Max, ja."}, {"id": 1106, "start": 7223.04, "end": 7227.04, "text": "Jawoll, jawoll, Kollege, du machst das. Ja, sehr schön."}, {"id": 1107, "start": 7227.04, "end": 7230.04, "text": "Übrigens, die Pistole ist übelst verbackt."}, {"id": 1108, "start": 7230.04, "end": 7235.04, "text": "Ihr habt das gerade nicht gemerkt, weil man sieht das nur, wenn man klickt oder wenn man knopfelt."}, {"id": 1109, "start": 7235.04, "end": 7255.04, "text": "Wenn du schnell tappst bei der Pistole, dann QT die Schüsse und schießt nicht einfach, hört nicht einfach auf zu schießen."}, {"id": 1110, "start": 7255.04, "end": 7260.04, "text": "Oh meine Güte, ich bin so schlecht gerade."}, {"id": 1111, "start": 7260.04, "end": 7265.04, "text": "Bäm, weg in YouTube."}, {"id": 1112, "start": 7265.04, "end": 7269.04, "text": "Was meint ihr, wie ist unser Verhältnis, so Win-Loss?"}, {"id": 1113, "start": 7269.04, "end": 7274.04, "text": "So 80 Wins, 20 Loss ungefähr, hä?"}, {"id": 1114, "start": 7274.04, "end": 7301.04, "text": "Ist der Eindruck so? Es macht Spaß, aber man kann null sagen zu."}, {"id": 1115, "start": 7301.04, "end": 7308.04, "text": "Okay, keine Ahnung, was das wieder gewesen ist."}, {"id": 1116, "start": 7308.04, "end": 7312.04, "text": "Das, das Kraft, das glaube ich dir nicht."}, {"id": 1117, "start": 7312.04, "end": 7316.04, "text": "Jemand der 03 abkackt, dem ist nicht schön zuzugucken."}, {"id": 1118, "start": 7316.04, "end": 7324.04, "text": "Ich weiß manchmal nicht, wie ich da spielen soll irgendwie."}, {"id": 1119, "start": 7324.04, "end": 7344.04, "text": "Kommen wir noch eine Runde Shotgun?"}, {"id": 1120, "start": 7344.04, "end": 7348.04, "text": "Jawoll, weggeschotgunnt, so muss das sein."}, {"id": 1121, "start": 7348.04, "end": 7356.04, "text": "Jetzt kann man wieder zugucken."}, {"id": 1122, "start": 7356.04, "end": 7365.04, "text": "Man muss das eigentlich komplett ohne Scope spielen, das ist halt eine stinknormale Shotgun."}, {"id": 1123, "start": 7365.04, "end": 7376.04, "text": "Der ist oben."}, {"id": 1124, "start": 7376.04, "end": 7384.04, "text": "Der ist unten."}, {"id": 1125, "start": 7384.04, "end": 7391.04, "text": "Ja, jetzt hat man wenigstens gut gehört. Du bist nicht Max, doch, bin ich."}, {"id": 1126, "start": 7391.04, "end": 7397.04, "text": "Immer guck meinen Avatar an und guck den Subscriber Avatar an."}, {"id": 1127, "start": 7397.04, "end": 7403.04, "text": "Wie gefällt dir das Spiel, das macht Bock."}, {"id": 1128, "start": 7403.04, "end": 7408.04, "text": "Ha, in den Kopf, jetzt machen wir was, jetzt machen wir was Leute."}, {"id": 1129, "start": 7408.04, "end": 7411.04, "text": "Fuck, von der Idee her war es nicht schlecht."}, {"id": 1130, "start": 7411.04, "end": 7416.04, "text": "Ich wollte eigentlich mit der Shotgun da rüberjumpen, genauso wie der Typ ungefähr."}, {"id": 1131, "start": 7416.04, "end": 7423.04, "text": "Das war auch mein Plan, bloß dass er schon gestoppt hat, weil ich noch gerannt bin."}, {"id": 1132, "start": 7423.04, "end": 7445.04, "text": "Immer wieder Shotgun. Oh, was? Von wo?"}, {"id": 1133, "start": 7445.04, "end": 7449.04, "text": "Übelst gefressen. Dachte, der hat es irgendwie nicht gecheckt."}, {"id": 1134, "start": 7449.04, "end": 7457.04, "text": "Ach, der Rick ist wieder da, du hast übrigens deinen Sub jetzt, ich habe es hingekriegt noch."}, {"id": 1135, "start": 7457.04, "end": 7479.04, "text": "Ok, mp5, mp5."}, {"id": 1136, "start": 7479.04, "end": 7487.04, "text": "Was sollst du da machen, die machen das auch clever, eine von links, eine von rechts."}, {"id": 1137, "start": 7487.04, "end": 7491.04, "text": "Da machst du nichts."}, {"id": 1138, "start": 7491.04, "end": 7495.04, "text": "Matchpoint, ok, wir müssen die Runde jetzt gewinnen, wir müssen gewinnen."}, {"id": 1139, "start": 7495.04, "end": 7514.04, "text": "Das ist gar nicht wirklich viel besser."}, {"id": 1140, "start": 7514.04, "end": 7529.04, "text": "Decked, defeat, abgekackt. Ups, da kann man eigentlich direkt, direkt leaven, weil warum soll man sich das weiter angucken?"}, {"id": 1141, "start": 7529.04, "end": 7535.04, "text": "Next."}, {"id": 1142, "start": 7535.04, "end": 7540.04, "text": "Kann man eigentlich mittlerweile was customisern?"}, {"id": 1143, "start": 7540.04, "end": 7545.04, "text": "Rantek, Calling Cards, was haben wir hier so noch?"}, {"id": 1144, "start": 7545.04, "end": 7548.04, "text": "Tyrannosaurus schreckt."}, {"id": 1145, "start": 7548.04, "end": 7552.04, "text": "Headbang Master Chief."}, {"id": 1146, "start": 7552.04, "end": 7560.04, "text": "Apex Stels."}, {"id": 1147, "start": 7560.04, "end": 7568.04, "text": "Bis meine, also ich habe jetzt ein bisschen überlegt, bis meine Emotes alle fertig sind, ich habe ja auf Fiver zwei Leute angeschrieben."}, {"id": 1148, "start": 7568.04, "end": 7579.04, "text": "Und irgendwie nennen sie es da, ein GIG gebucht bei denen für Emotes, werde ich jetzt einfach ein paar sinnlose Meme Emotes hochladen."}, {"id": 1149, "start": 7579.04, "end": 7587.04, "text": "Ok, jetzt, jetzt."}, {"id": 1150, "start": 7587.04, "end": 7603.04, "text": "Der eine ist rechts, das habe ich gesehen."}, {"id": 1151, "start": 7603.04, "end": 7622.04, "text": "Ich checke das nicht."}, {"id": 1152, "start": 7622.04, "end": 7630.04, "text": "Da nicht."}, {"id": 1153, "start": 7630.04, "end": 7634.04, "text": "Ich habe noch keine Emotes."}, {"id": 1154, "start": 7634.04, "end": 7643.04, "text": "Wir haben auch eine Woche Zeit."}, {"id": 1155, "start": 7643.04, "end": 7650.04, "text": "Ich sehe die übelst schlechte Giga. Ich frage mich, ob das wirklich einen Vorteil bringt, wenn man eine PS Pro hätte."}, {"id": 1156, "start": 7650.04, "end": 7657.04, "text": "Ich sehe die übelst schlecht."}, {"id": 1157, "start": 7657.04, "end": 7663.04, "text": "Und was ich fragen würde ist, ob die PS 4 Pro, ob die flüssiger läuft."}, {"id": 1158, "start": 7663.04, "end": 7666.04, "text": "Weil gerade auf der Map ist es ganz schön hakelig."}, {"id": 1159, "start": 7666.04, "end": 7672.04, "text": "Ihr seht es glaube ich zwischendurch, dass es ordentliche Slowdowns hat."}, {"id": 1160, "start": 7672.04, "end": 7676.04, "text": "Jawoll, jawoll jetzt."}, {"id": 1161, "start": 7676.04, "end": 7677.04, "text": "Nein."}, {"id": 1162, "start": 7677.04, "end": 7680.04, "text": "Shit."}, {"id": 1163, "start": 7680.04, "end": 7708.04, "text": "Liegt an der Map bei mir. Ok, auf der Map ist es besonders auffällig."}, {"id": 1164, "start": 7708.04, "end": 7715.04, "text": "Fuck, ey. Was willst du denn da machen?"}, {"id": 1165, "start": 7715.04, "end": 7721.04, "text": "Voll in die Fresse. Ihr habt mir jetzt so krass ins Gesicht genaglet gerade."}, {"id": 1166, "start": 7721.04, "end": 7726.04, "text": "Rechts war er, das sieht man schon."}, {"id": 1167, "start": 7726.04, "end": 7734.04, "text": "Da jumpt er."}, {"id": 1168, "start": 7734.04, "end": 7736.04, "text": "Oh, gut."}, {"id": 1169, "start": 7736.04, "end": 7738.04, "text": "Von hinten, klar."}, {"id": 1170, "start": 7738.04, "end": 7754.04, "text": "Ah, nice, win. Easy, gut."}, {"id": 1171, "start": 7754.04, "end": 7768.04, "text": "Beide rechts."}, {"id": 1172, "start": 7768.04, "end": 7770.04, "text": "Ich sehe nichts."}, {"id": 1173, "start": 7770.04, "end": 7775.04, "text": "Ey, das ist mega frustrierend gerade. Ich weiß überhaupt nicht, wie ich das richtig spielen soll."}, {"id": 1174, "start": 7775.04, "end": 7797.04, "text": "Dass die Ur-In-Game echte Zeit anzeigt. Nö."}, {"id": 1175, "start": 7797.04, "end": 7803.04, "text": "Wo ist der andere tot? Rechts."}, {"id": 1176, "start": 7803.04, "end": 7813.04, "text": "Oder?"}, {"id": 1177, "start": 7813.04, "end": 7818.04, "text": "Na, da hinten? Hab ich doch richtig gesehen."}, {"id": 1178, "start": 7818.04, "end": 7825.04, "text": "Muss erst mal gucken, wo da eine Uhr ist."}, {"id": 1179, "start": 7825.04, "end": 7829.04, "text": "Wo ist da eine Uhr?"}, {"id": 1180, "start": 7829.04, "end": 7836.04, "text": "Keine Uhr."}, {"id": 1181, "start": 7836.04, "end": 7849.04, "text": "Am Arm. Ach, da am Arm."}, {"id": 1182, "start": 7849.04, "end": 7853.04, "text": "Da guck ich nicht so genau hin."}, {"id": 1183, "start": 7853.04, "end": 7856.04, "text": "Ah, Outch 3-3."}, {"id": 1184, "start": 7856.04, "end": 7861.04, "text": "Der eine carried übelst da drüben, der Fuzzix."}, {"id": 1185, "start": 7861.04, "end": 7864.04, "text": "Mal gucken, was das jetzt für ein Loadout gibt."}, {"id": 1186, "start": 7864.04, "end": 7877.04, "text": "MP7 und Dessert-Igel."}, {"id": 1187, "start": 7877.04, "end": 7881.04, "text": "What? What the fuck?"}, {"id": 1188, "start": 7881.04, "end": 7889.04, "text": "Es ist übelst random. Ich weiß wirklich nicht, wie ich das kontrolliert spielen soll."}, {"id": 1189, "start": 7889.04, "end": 7904.04, "text": "Geht das noch gar nicht?"}, {"id": 1190, "start": 7904.04, "end": 7916.04, "text": "Der macht wieder das gleiche, ich sag's euch. Der probiert wieder das gleiche."}, {"id": 1191, "start": 7916.04, "end": 7919.04, "text": "Erwischt."}, {"id": 1192, "start": 7919.04, "end": 7932.04, "text": "Ok, wo ist der Dude jetzt?"}, {"id": 1193, "start": 7932.04, "end": 7938.04, "text": "Da oben ist er."}, {"id": 1194, "start": 7938.04, "end": 7943.04, "text": "Ey, es gibt's net. Ich lauf pre-fired um die Ecke und ich bin tot."}, {"id": 1195, "start": 7943.04, "end": 7945.04, "text": "Was ist das denn?"}, {"id": 1196, "start": 7945.04, "end": 7949.04, "text": "Na gut, der hat besser ge-aimsort."}, {"id": 1197, "start": 7949.04, "end": 7954.04, "text": "Aber der ist übelst low. Ein Hit und er ist da on."}, {"id": 1198, "start": 7954.04, "end": 7959.04, "text": "Ja gut, aber wir haben weniger Leben."}, {"id": 1199, "start": 7959.04, "end": 7963.04, "text": "Kann er relativ gut Sound tun. Ich hab da so meine Probleme."}, {"id": 1200, "start": 7963.04, "end": 7966.04, "text": "Aber ich glaub, das lag auch an den Sound-Settings am Anfang."}, {"id": 1201, "start": 7966.04, "end": 7969.04, "text": "Komm jetzt, jetzt wird aufgeholt. Jetzt wird aufgeholt."}, {"id": 1202, "start": 7969.04, "end": 7977.04, "text": "Oh nee, jetzt kommt diese Shotgun-Geschichte wieder."}, {"id": 1203, "start": 7977.04, "end": 7997.04, "text": "Ok, der ist schon mal schön angehittet."}, {"id": 1204, "start": 7997.04, "end": 8004.04, "text": "Was willst du machen?"}, {"id": 1205, "start": 8004.04, "end": 8009.04, "text": "Ist das ein richtiges Kot von der Steuerung? Das ist schon richtig."}, {"id": 1206, "start": 8009.04, "end": 8027.04, "text": "Sehr klassisch von der Steuerung her."}, {"id": 1207, "start": 8027.04, "end": 8037.04, "text": "Wie heißt der Typ? Auch wieder unser Lieblings-Special-Killer aus der Map."}, {"id": 1208, "start": 8037.04, "end": 8052.04, "text": "Ok, das ist die gegen die Haupt-Kampf-Linie."}, {"id": 1209, "start": 8052.04, "end": 8080.04, "text": "Er ist da noch drinnen."}, {"id": 1210, "start": 8080.04, "end": 8085.04, "text": "Ha, der war klar. Sobald man weiß, wo die sind, ist das natürlich easy."}, {"id": 1211, "start": 8085.04, "end": 8090.04, "text": "Nimm Raketenwerfer. Hab ich einen Raketenwerfer?"}, {"id": 1212, "start": 8090.04, "end": 8093.04, "text": "Ja, ich hab einen Raketenwerfer."}, {"id": 1213, "start": 8093.04, "end": 8108.04, "text": "Ja, das muss man echt ausprobieren."}, {"id": 1214, "start": 8108.04, "end": 8118.04, "text": "Ok, ich bilde ihn mir ein. Ich war vorher drauf."}, {"id": 1215, "start": 8118.04, "end": 8122.04, "text": "Aber wahrscheinlich hat er einfach gut Kopf getroffen."}, {"id": 1216, "start": 8122.04, "end": 8124.04, "text": "Hast ja gerade am Ende am Hitmarker gesehen."}, {"id": 1217, "start": 8124.04, "end": 8128.04, "text": "Ja, nice. Ach, ist mir nur noch einer übrig."}, {"id": 1218, "start": 8128.04, "end": 8130.04, "text": "Der ist wieder geraged-quittet, der Typ."}, {"id": 1219, "start": 8130.04, "end": 8133.04, "text": "Komm, rage-quitten die Leute immer."}, {"id": 1220, "start": 8133.04, "end": 8153.04, "text": "Rage-quitten wir jetzt auch. 2 gegen 1 ist dumm."}, {"id": 1221, "start": 8153.04, "end": 8161.04, "text": "Also 2 gegen 1 war echt kein Spaß."}, {"id": 1222, "start": 8161.04, "end": 8167.04, "text": "Ich finde das auch dumm. Warum? Da können die nice 1 on 1 machen."}, {"id": 1223, "start": 8167.04, "end": 8170.04, "text": "Oder können es sein lassen."}, {"id": 1224, "start": 8170.04, "end": 8172.04, "text": "Das Ding heißt ja nicht umsonst 2 gegen 2."}, {"id": 1225, "start": 8172.04, "end": 8176.04, "text": "Also wenn sie sich irgendwas bei gedacht haben, dann sollte das auch am besten 2 gegen 2 gespielt werden."}, {"id": 1226, "start": 8176.04, "end": 8181.04, "text": "Ich hatte zwar mal eine Zweifel, ob sie sich wirklich was bei gedacht haben, aber man weiß ja nie."}, {"id": 1227, "start": 8181.04, "end": 8185.04, "text": "Die Hoffnung stirbt zuletzt."}, {"id": 1228, "start": 8185.04, "end": 8188.04, "text": "Das ist kein Alpha für Vorstellern. Nee, nee, nee, nee."}, {"id": 1229, "start": 8188.04, "end": 8193.04, "text": "Das kann jeder. Jeder kann das Spiel mit einer PS4. Jeder."}, {"id": 1230, "start": 8193.04, "end": 8196.04, "text": "Nee, oder?"}, {"id": 1231, "start": 8196.04, "end": 8213.04, "text": "Instant, instant-quit."}, {"id": 1232, "start": 8213.04, "end": 8220.04, "text": "Instant-quit. Das ist so dumm."}, {"id": 1233, "start": 8220.04, "end": 8226.04, "text": "Das ist sinnlos. Ich will das 2 gegen 2 spielen und nicht 1 gegen 2."}, {"id": 1234, "start": 8226.04, "end": 8233.04, "text": "Zum Download brauchst du PS Plus wohlgemerkt nur mit einem deutschen Account."}, {"id": 1235, "start": 8233.04, "end": 8242.04, "text": "Wenn du den internationalen Account, also jedes Land außer Deutschland, kann das Ding ohne PlayStation Plus runterladen."}, {"id": 1236, "start": 8242.04, "end": 8269.04, "text": "Jedes Land außer Deutschland."}, {"id": 1237, "start": 8269.04, "end": 8274.04, "text": "Und ja, 2 gegen 2. Sehr schön."}, {"id": 1238, "start": 8274.04, "end": 8282.04, "text": "Der Typ geht garantiert auch hier da oben rausgucken."}, {"id": 1239, "start": 8282.04, "end": 8308.04, "text": "Wegen Jugendschutz."}, {"id": 1240, "start": 8308.04, "end": 8329.04, "text": "Was auch immer das jetzt gewesen ist."}, {"id": 1241, "start": 8329.04, "end": 8336.04, "text": "Der andere ist oben. Ich hab den gesehen."}, {"id": 1242, "start": 8336.04, "end": 8342.04, "text": "Fuck."}, {"id": 1243, "start": 8342.04, "end": 8346.04, "text": "Was willst du machen?"}, {"id": 1244, "start": 8346.04, "end": 8354.04, "text": "Zurückschmeißen, etwas können."}, {"id": 1245, "start": 8354.04, "end": 8366.04, "text": "Nice, nice."}, {"id": 1246, "start": 8366.04, "end": 8372.04, "text": "Vermaß."}, {"id": 1247, "start": 8372.04, "end": 8384.04, "text": "Den Kopf."}, {"id": 1248, "start": 8384.04, "end": 8390.04, "text": "Der ist auf der anderen Seite."}, {"id": 1249, "start": 8390.04, "end": 8396.04, "text": "Okay, gut."}, {"id": 1250, "start": 8396.04, "end": 8409.04, "text": "Mir leuchtet das mit Jugendschutz auch nicht ein. Aber das ist die einzige Erklärung, die ich dafür hab."}, {"id": 1251, "start": 8409.04, "end": 8413.04, "text": "Gott, Alter. Was ist das?"}, {"id": 1252, "start": 8413.04, "end": 8422.04, "text": "Zwei Mal den Kopf geschossen. Nope."}, {"id": 1253, "start": 8422.04, "end": 8428.04, "text": "Das kann der ganz gut packen. Der muss den ein, zwei mal hinden, dann ist es vorbei."}, {"id": 1254, "start": 8428.04, "end": 8438.04, "text": "Jawoll, jawoll, komm. Noch."}, {"id": 1255, "start": 8438.04, "end": 8447.04, "text": "Der macht das, der macht das. Anito. Ah, nee. Antonio, nicht Anito. Was soll halt Anito sein?"}, {"id": 1256, "start": 8447.04, "end": 8464.04, "text": "Antonio, easy win, easy life."}, {"id": 1257, "start": 8464.04, "end": 8478.04, "text": "Das war übrigens ein Headshot. Laut dem Hitmarker, wenn roter Hitmarker, wenn roter Hitmarker, Treffer, Headshot ist."}, {"id": 1258, "start": 8478.04, "end": 8491.04, "text": "Jeder links eingesniped, rechts eingesniped, down."}, {"id": 1259, "start": 8491.04, "end": 8503.04, "text": "Auch."}, {"id": 1260, "start": 8503.04, "end": 8529.04, "text": "MonkaS. MonkaGiga. Puh. Rage quit, rage quit, stopp. Ach, Quatsch. 6-1. Leute, ich hab nichts gesagt. Ich hab nichts gesagt, die Runde ist vorbei."}, {"id": 1261, "start": 8529.04, "end": 8544.04, "text": "Ich frag mich, warum die alles so krasses Movement auf der Konsone haben. Ich bin froh, wenn ich zwei Sticks gleichzeitig bedient krieg."}, {"id": 1262, "start": 8544.04, "end": 8564.04, "text": "Die GG, ja. Ein bisschen Menümusik wär schon nicht übel. Ups, ah, geht weiter."}, {"id": 1263, "start": 8564.04, "end": 8576.04, "text": "Ah, ich find, das ist die beste Map von den drei. Hill House sagt, dass die Waldmap sackt. Das Ding hier geht halbwegs."}, {"id": 1264, "start": 8576.04, "end": 8602.04, "text": "Okay, jetzt machen wir den Omega Rush, die Omega Rush Action links rum."}, {"id": 1265, "start": 8602.04, "end": 8619.04, "text": "Okay, ich hit den zweimal über die Range, passiert nichts, er hält mich zweimal über die Range, bin down. Sehr gut, sehr gut."}, {"id": 1266, "start": 8619.04, "end": 8630.04, "text": "Immer rechts rum, rechts rum sind wir irgendwie egal. Wisst ihr, wir machen jetzt was anderes."}, {"id": 1267, "start": 8630.04, "end": 8634.04, "text": "Der ist hittert, der ist richtig gut hittert."}, {"id": 1268, "start": 8634.04, "end": 8651.04, "text": "Fuck, der andere kommt jetzt."}, {"id": 1269, "start": 8651.04, "end": 8660.04, "text": "Hit."}, {"id": 1270, "start": 8660.04, "end": 8668.04, "text": "Der ist noch links rein, oder?"}, {"id": 1271, "start": 8668.04, "end": 8676.04, "text": "Okay, doch."}, {"id": 1272, "start": 8676.04, "end": 8687.04, "text": "Ja gut, der hatte schon fat Damage drin. Nee, du musst, wenn du Playstation Plus, da musst du deinen Ausweis scannen."}, {"id": 1273, "start": 8687.04, "end": 8698.04, "text": "Ey, ich versteh das nicht. Ich bin genau wie der auf den drauf, ja. Aber ich verrecke."}, {"id": 1274, "start": 8698.04, "end": 8712.04, "text": "Es leuchtet mir überhaupt nicht ein. Ich schieb das einfach mal auf sackiges P2P Hosting."}, {"id": 1275, "start": 8712.04, "end": 8729.04, "text": "Jetzt machen wir unseren berühmten Middle Rush und sterben dabei. Aber rechts, alter, der ist rechts, der ist rechts, Kollege."}, {"id": 1276, "start": 8729.04, "end": 8743.04, "text": "Bam. Was war das? Okay, warum haben wir gewonnen, wenn die sich gegenseitig killen?"}, {"id": 1277, "start": 8743.04, "end": 8751.04, "text": "Ich check das nicht. Das ist doch. Sehen die mich irgendwie früher oder was?"}, {"id": 1278, "start": 8751.04, "end": 8765.04, "text": "Der hat mich durch den Container laufen sehen. Ich hab ihn nicht gesehen. Das ist so eine typische Cod-Geschichte, die ich einfach nicht checke."}, {"id": 1279, "start": 8765.04, "end": 8777.04, "text": "Links, links, rechts, links, rechts. Der geht ab. Remco carried uns."}, {"id": 1280, "start": 8777.04, "end": 8791.04, "text": "Was jetzt wieder? Cod. War das mal anders?"}, {"id": 1281, "start": 8791.04, "end": 8818.04, "text": "Hab ich irgendwas in der Range? Ich seh meinen Ironsight überhaupt nicht."}, {"id": 1282, "start": 8818.04, "end": 8833.04, "text": "Den hab ich übrigens nicht gehört. Null gehört."}, {"id": 1283, "start": 8833.04, "end": 8858.04, "text": "Übel swashed ab. Okay, keine Ahnung. Mehr als draufschießen kann ich doch nicht."}, {"id": 1284, "start": 8858.04, "end": 8867.04, "text": "Schreckt. Alpha Eindrücke. Man kann nichts sagen. Das sind drei Maps, ein Spielmodus."}, {"id": 1285, "start": 8867.04, "end": 8880.04, "text": "Ich hab übrigens keine Ahnung, ob das P2P Hosting ist oder Dedicated Servers. Es fühlt sich ein bisschen nach P2P Hosting an."}, {"id": 1286, "start": 8880.04, "end": 8888.04, "text": "Achtung!"}, {"id": 1287, "start": 8888.04, "end": 8917.04, "text": "Da war was. Ich hab was gesehen in der Mitte."}, {"id": 1288, "start": 8917.04, "end": 8933.04, "text": "Geht doch. Exos."}, {"id": 1289, "start": 8933.04, "end": 8947.04, "text": "Oh, jetzt werden sie weggeschneibt. Schonmal gleich ins Hardscope gehen."}, {"id": 1290, "start": 8947.04, "end": 8958.04, "text": "Achtung!"}, {"id": 1291, "start": 8958.04, "end": 8965.04, "text": "Was? Ich dachte, ich hab Nowscoped aus der Hüfte."}, {"id": 1292, "start": 8965.04, "end": 8978.04, "text": "Der Schuss ist nicht mehr rausgekommen. Achtung, Hardscoped."}, {"id": 1293, "start": 8978.04, "end": 8988.04, "text": "Okay. Ja gut, der hatte natürlich den Vorteil jetzt. Das ist klar, wenn du einfach nur wartest und stehen bleibst."}, {"id": 1294, "start": 8988.04, "end": 8999.04, "text": "Wupplull."}, {"id": 1295, "start": 8999.04, "end": 9010.04, "text": "Aber wir müssen das gewinnen. Gleich ist 5-5. Ich glaub nicht, dass der Typ das gewinnt."}, {"id": 1296, "start": 9010.04, "end": 9025.04, "text": "Jetzt hier. Jetzt kommt's raus. Mal gucken, was wir für ein Loadout kriegen. Oder Pistol oder so."}, {"id": 1297, "start": 9025.04, "end": 9037.04, "text": "Achtung, wir gehen jetzt erst mal dahin."}, {"id": 1298, "start": 9037.04, "end": 9055.04, "text": "Alter, Dude, Dude. Hui. Das ganze Game wirkt unscharf. Also es wirkt übelst schwammig."}, {"id": 1299, "start": 9055.04, "end": 9071.04, "text": "Also wenn das so bleibt, und du siehst ja dein eigenes Ironsight nicht mal richtig, könnte ich mir vorstellen, dass man tatsächlich einen nicht unerheblichen Vorteil hat, wenn man eine Playstation Pro hat."}, {"id": 1300, "start": 9071.04, "end": 9085.04, "text": "Das Spiel ist für dich mit Controller räudig. Äh, richtig räudig. Also hat sich's gespielt. Optik mag's? Nee, nicht Optik. Face."}, {"id": 1301, "start": 9085.04, "end": 9101.04, "text": "Mensch, schon Face. Ja, Motionplay ist aus. Mal kurz gucken."}, {"id": 1302, "start": 9101.04, "end": 9127.04, "text": "Weg. Der Mist muss weg. Der Mist muss auf jeden Fall weg. Studierst du Dual?"}, {"id": 1303, "start": 9127.04, "end": 9137.04, "text": "Studiere weder Single noch Dual."}, {"id": 1304, "start": 9137.04, "end": 9152.04, "text": "Wir probieren jetzt mal was. Leute, wir probieren mal was. Wir probieren jetzt mal was."}, {"id": 1305, "start": 9152.04, "end": 9177.04, "text": "Kommt da hier? Kommt da hier? Nee, Mitte."}, {"id": 1306, "start": 9177.04, "end": 9190.04, "text": "Okay, gut."}, {"id": 1307, "start": 9190.04, "end": 9205.04, "text": "Hast du mich gerade erahlt, General? Alter, Lul. Aber was man alles raushören kann."}, {"id": 1308, "start": 9205.04, "end": 9213.04, "text": "Hinter mir. Fuck, wusste ich. Ich hab's in dem Moment gehört, wo er getrobbt ist."}, {"id": 1309, "start": 9213.04, "end": 9234.04, "text": "Voll den Arsch geballert. Das ist ja, das ist der Budget. Das ist der Budget CS Modus."}, {"id": 1310, "start": 9234.04, "end": 9243.04, "text": "Tja, Kollege. Ähm, die Holzbanden, die da sind, die sind sehr, sehr widerständig."}, {"id": 1311, "start": 9243.04, "end": 9249.04, "text": "Du kannst da so gut wie nicht durchschießen. Du kannst da so gut wie nicht durchschießen"}, {"id": 1312, "start": 9249.04, "end": 9268.04, "text": "durch das Holz hier. Ich geh mal zu meinem Dude."}, {"id": 1313, "start": 9268.04, "end": 9281.04, "text": "So geht das. Der hat mir das letzte Mal in den Arsch geballert. Jetzt hab ich ihm in den Arsch geballert."}, {"id": 1314, "start": 9281.04, "end": 9295.04, "text": "Bitte schön, ja. Jetzt. Am Moment ist ja ne Shotgun. Oh, mega Lul."}, {"id": 1315, "start": 9295.04, "end": 9307.04, "text": "Warum macht der Dude mir über Range so krassen Damage?"}, {"id": 1316, "start": 9307.04, "end": 9313.04, "text": "Ich hab ihn zweimal über Range getroffen und er trifft mich einmal und ich bin fast tot."}, {"id": 1317, "start": 9313.04, "end": 9321.04, "text": "Kann mir das mir irgendjemand erklären? Das verstehe ich nicht."}, {"id": 1318, "start": 9321.04, "end": 9337.04, "text": "So spektakulier sieht das Game nicht aus. Ich glaube, es liegt unter anderem daran, dass man auch nicht zusammenspielt."}, {"id": 1319, "start": 9337.04, "end": 9362.04, "text": "Der andere ist in der Mitte. Ich muss mal zu meinem Dude."}, {"id": 1320, "start": 9362.04, "end": 9384.04, "text": "Okay, was auch immer."}, {"id": 1321, "start": 9384.04, "end": 9410.04, "text": "Ich dachte, jetzt kann man's outplayen hier."}, {"id": 1322, "start": 9410.04, "end": 9417.04, "text": "Ich glaube, der Dude ist oben."}, {"id": 1323, "start": 9417.04, "end": 9435.04, "text": "Jawoll."}, {"id": 1324, "start": 9435.04, "end": 9445.04, "text": "Ja, kommt rechts. Was zum Teufel? Wie geht das? Wie geht das?"}, {"id": 1325, "start": 9445.04, "end": 9453.04, "text": "Ich aim den Typ ab, schieß drauf und bei ihm hab ich noch nicht mal geschossen."}, {"id": 1326, "start": 9453.04, "end": 9461.04, "text": "Ich check das nicht. Also das ist so diese typische Call of Duty-Dinger, die man null kapiert."}, {"id": 1327, "start": 9461.04, "end": 9469.04, "text": "Sollte es nicht Round One anstelle von Round Wind heißen?"}, {"id": 1328, "start": 9469.04, "end": 9477.04, "text": "Englisch. Es sollt Round Owned heißen."}, {"id": 1329, "start": 9477.04, "end": 9483.04, "text": "Round Poggers sollte das heißen."}, {"id": 1330, "start": 9483.04, "end": 9492.04, "text": "Ja, direkt."}, {"id": 1331, "start": 9492.04, "end": 9514.04, "text": "Okay."}, {"id": 1332, "start": 9514.04, "end": 9528.04, "text": "Gott."}, {"id": 1333, "start": 9528.04, "end": 9541.04, "text": "Kann man nur diesen Modus spielen? Ja, leider. Nur diesen Modus und nur drei Maps und keine Perks, Loadouts, Killstreaks, irgendwas."}, {"id": 1334, "start": 9541.04, "end": 9550.04, "text": "Das ist PS4. Ja, es gibt's ja auch nur auf der PS4. Ich spiel nie PS4, deswegen krieg ich Anfall."}, {"id": 1335, "start": 9550.04, "end": 9556.04, "text": "Was? Alter!"}, {"id": 1336, "start": 9556.04, "end": 9562.04, "text": "Treff ich die nicht oder was ist das?"}, {"id": 1337, "start": 9562.04, "end": 9568.04, "text": "Ich schieß vorbei, oder Leute? Ich schieß vorbei."}, {"id": 1338, "start": 9568.04, "end": 9573.04, "text": "Zumindest nicht bewusst."}, {"id": 1339, "start": 9573.04, "end": 9580.04, "text": "Ich war voll an ihm. Okay, wahrscheinlich."}, {"id": 1340, "start": 9580.04, "end": 9606.04, "text": "Es ist auch wirklich gewöhnungsbedürftig."}, {"id": 1341, "start": 9606.04, "end": 9611.04, "text": "Alter, stöhne ich so rum."}, {"id": 1342, "start": 9611.04, "end": 9620.04, "text": "Ich hör nichts, weil ich lauter gestöhne."}, {"id": 1343, "start": 9620.04, "end": 9631.04, "text": "Man hört nichts. Es ist so mega für'n Arsch."}, {"id": 1344, "start": 9631.04, "end": 9644.04, "text": "GachiBase."}, {"id": 1345, "start": 9644.04, "end": 9654.04, "text": "Was jetzt? Ah, wir haben verloren. Okay."}, {"id": 1346, "start": 9654.04, "end": 9668.04, "text": "Kaufst du dir das Game? Sieht mega los. Man kann das überhaupt nicht einschätzen. Also ich kaufe es mir auf jeden Fall nicht auf der PS4."}, {"id": 1347, "start": 9668.04, "end": 9673.04, "text": "Ich hör da was im Voice Chat. Ich will nichts im Voice Chat hören."}, {"id": 1348, "start": 9673.04, "end": 9695.04, "text": "Auf der Switch? Ja, da. So wie Switcher 3."}, {"id": 1349, "start": 9695.04, "end": 9714.04, "text": "Man kann es ja mal probieren."}, {"id": 1350, "start": 9714.04, "end": 9734.04, "text": "Das stöhnt so rum, ich hör nichts."}, {"id": 1351, "start": 9734.04, "end": 9748.04, "text": "Ah, Mann."}, {"id": 1352, "start": 9748.04, "end": 9753.04, "text": "Weg strafeln."}, {"id": 1353, "start": 9753.04, "end": 9778.04, "text": "Also ich muss euch ehrlich sagen, ich sehe auf der PS4 die Gegner extrem schlecht. Normalerweise guckst du hin und du siehst einen Pixel rausgucken und easy spotted."}, {"id": 1354, "start": 9778.04, "end": 9799.04, "text": "Das kriegen wir noch. Null zwei, Null zwei."}, {"id": 1355, "start": 9799.04, "end": 9808.04, "text": "Okay."}, {"id": 1356, "start": 9808.04, "end": 9813.04, "text": "So muss das sein. Was schon? Fast drei Stunden?"}, {"id": 1357, "start": 9813.04, "end": 9835.04, "text": "Waren wir jetzt wieder? War eine ganz gute Strat."}, {"id": 1358, "start": 9835.04, "end": 9847.04, "text": "Nein. Fuck, Munition leer. Shit. Sonst wäre der gefickt gewesen."}, {"id": 1359, "start": 9847.04, "end": 9860.04, "text": "Fuck. Ja, aber gut. Wenigstens. Der war angehittet. Der hatte was weiß ich noch. Zehn Leben oder so."}, {"id": 1360, "start": 9860.04, "end": 9871.04, "text": "Oh, mal eine neue Waffe. Die hatten wir noch nicht. Jetzt, huge, huge."}, {"id": 1361, "start": 9871.04, "end": 9881.04, "text": "Ah, fuck. Da machst du nichts, wenn die direkt neben dir stehen. Da machst du nichts."}, {"id": 1362, "start": 9881.04, "end": 9897.04, "text": "Mal gucken, vielleicht finde ich noch ein paar, die ich noch von früher kenne, dass wir mal mit ein paar gescheiten Leuten spielen können."}, {"id": 1363, "start": 9897.04, "end": 9914.04, "text": "Oh. Move, Alter."}, {"id": 1364, "start": 9914.04, "end": 9930.04, "text": "Psst."}, {"id": 1365, "start": 9930.04, "end": 9941.04, "text": "Ha, hui hui. Abgekempt."}, {"id": 1366, "start": 9941.04, "end": 9953.04, "text": "Was ist mit dem No Scope Faktor? Der ist bei Shotgun ziemlich hoch."}, {"id": 1367, "start": 9953.04, "end": 9958.04, "text": "Ich hab gerade irgendwie zwei auf einmal verschossen."}, {"id": 1368, "start": 9958.04, "end": 9961.04, "text": "Hatte keinen Schuss mehr. Irgendwie zwei auf einmal verschossen."}, {"id": 1369, "start": 9961.04, "end": 9974.04, "text": "Oh, zwei Leben zu ein Leben. Na, das kann ja was werden."}, {"id": 1370, "start": 9974.04, "end": 9981.04, "text": "Aber der gewinnt, der mit acht Leben. Der kämpft sich jetzt irgendwo in der Ecke."}, {"id": 1371, "start": 9981.04, "end": 9998.04, "text": "Drei, vier, komm. Das wird, das geht noch. Man muss da Carrie rausgeholt werden."}, {"id": 1372, "start": 9998.04, "end": 10006.04, "text": "Was zum Teufel? Wie geht das immer?"}, {"id": 1373, "start": 10006.04, "end": 10015.04, "text": "Ist der geslided? Ich hab den überhaupt nicht gesehen."}, {"id": 1374, "start": 10015.04, "end": 10019.04, "text": "Du kannst die Alpha nicht downloaden, weil du keinen PS Plus hast."}, {"id": 1375, "start": 10019.04, "end": 10021.04, "text": "Du kannst die Alpha nicht downloaden, weil du keinen PS Plus hast."}, {"id": 1376, "start": 10021.04, "end": 10040.04, "text": "Oder halt, also du brauchst, in Deutschland brauchst du PlayStation Plus, weil Jugendschutz, was auch immer. Und international reicht's, wenn du einfach downloadest."}, {"id": 1377, "start": 10040.04, "end": 10055.04, "text": "Okay, Luft ist raus, Leute. Luft ist raus. Oh, wir haben gewonnen. Easy."}, {"id": 1378, "start": 10055.04, "end": 10078.04, "text": "Du kannst den dann fake, mach's wie ich. Mach dir einen fake account in England. Ein englischer fake account."}, {"id": 1379, "start": 10078.04, "end": 10087.04, "text": "Warte nicht, war kein Hit. War kein Hit. Ich check's nicht."}, {"id": 1380, "start": 10087.04, "end": 10094.04, "text": "Das, warum war das kein Hit? Das war voll drauf. Sag mal Leute, schieße ich wirklich vorbei?"}, {"id": 1381, "start": 10094.04, "end": 10105.04, "text": "Vom Gefühl her treffe ich das, aber vielleicht sieht das, ihr seht das besser im Stream. Aber meiner Meinung nach war ich gerade voll auf dem Bein."}, {"id": 1382, "start": 10105.04, "end": 10112.04, "text": "Ja, ihr seht das besser. Selbst sieht man das immer schlecht."}, {"id": 1383, "start": 10112.04, "end": 10123.04, "text": "Du brauchst zum Online-Spielen keinen PlayStation Plus. Du brauchst nur in Deutschland zum Downloaden PlayStation Plus. Das ist big brain."}, {"id": 1384, "start": 10123.04, "end": 10133.04, "text": "Zum Spielen brauchst du keinen PlayStation Plus, nur zum Downloaden."}, {"id": 1385, "start": 10133.04, "end": 10139.04, "text": "Das ist richtig Pfeif her."}, {"id": 1386, "start": 10139.04, "end": 10143.04, "text": "Weil Jugendschutz."}, {"id": 1387, "start": 10143.04, "end": 10154.04, "text": "Wir sind das einzige Land wahrscheinlich, was so ein Müll braucht."}, {"id": 1388, "start": 10154.04, "end": 10168.04, "text": "Was wäre Cod ohne Mini-Rage nach dem Tode? Ja, die Tode sind auch so merkwürdig teilweise. Wo du dir so denkst, irgendwie das kann's doch nicht gewesen sein."}, {"id": 1389, "start": 10168.04, "end": 10171.04, "text": "Die Waffe ist schepp."}, {"id": 1390, "start": 10171.04, "end": 10185.04, "text": "Die Waffe ist schepp."}, {"id": 1391, "start": 10185.04, "end": 10193.04, "text": "Ich hab am Übrigen auch schon wieder geschossen, aber hatte keine Ahnung. Ich glaub die Luft ist raus. Die Runde spielen wir noch."}, {"id": 1392, "start": 10193.04, "end": 10201.04, "text": "Das hast du auch in der Beta vom letzten Cod gesagt. Ja, das ist halt auch immer so."}, {"id": 1393, "start": 10201.04, "end": 10214.04, "text": "Du brauchst PlayStation Plus zum Unterladen."}, {"id": 1394, "start": 10214.04, "end": 10224.04, "text": "Gut."}, {"id": 1395, "start": 10224.04, "end": 10227.04, "text": "War ich jetzt wieder nicht drauf? Mit Emulator spiel ich gerade."}, {"id": 1396, "start": 10227.04, "end": 10252.04, "text": "Achso, der hat's überlebt. Okay, weil es hat keinen Hitmarker gegeben."}, {"id": 1397, "start": 10252.04, "end": 10260.04, "text": "So, wir stürmen jetzt einfach drauf. Scheiß auf Taktik. In your face."}, {"id": 1398, "start": 10260.04, "end": 10283.04, "text": "Was? Ich hab irgendwie noch nicht einen Nahkampfangriff gemacht. Was ist das überhaupt? V? Ja. Ah, E."}, {"id": 1399, "start": 10283.04, "end": 10294.04, "text": "Ich hab keinen Bock mehr, Leute. Ich krieg nix geschissen, ey. Sobald der Typ geflasht war."}, {"id": 1400, "start": 10294.04, "end": 10323.04, "text": "Es ist übelst frustrierend, wenn man mal was gerockt hat irgendwie und dann so scheiße ist. Voll auf dem Sack."}, {"id": 1401, "start": 10323.04, "end": 10352.04, "text": "Jawoll. Einfach die ganze Zeit scheißen. Das ist Next Level. So geht das ja. So macht das ja Bock."}, {"id": 1402, "start": 10352.04, "end": 10357.04, "text": "Ich glaub, ich muss mir auch mal angewöhnen, den Slide mehr zu verwenden."}, {"id": 1403, "start": 10357.04, "end": 10363.04, "text": "Sitzt du im Rollstuhl? Was? Warum? Ich hab einfach jahrelang nix gespielt."}, {"id": 1404, "start": 10363.04, "end": 10392.04, "text": "Also kein Cut und keine Shooter allgemein. Und vor allem schon gar nicht mal PS4."}, {"id": 1405, "start": 10392.04, "end": 10408.04, "text": "Der Dude muss da rauskommen, klar."}, {"id": 1406, "start": 10408.04, "end": 10425.04, "text": "Ja, Outplayed. Jetzt klappt's ja. Jetzt funktioniert's."}, {"id": 1407, "start": 10425.04, "end": 10453.04, "text": "Jetzt werden wir mal schon ne Runde campen. Der andere kam links irgendwo, ne?"}, {"id": 1408, "start": 10453.04, "end": 10460.04, "text": "Äh, an was ist der denn? An was ist der denn jetzt verreckt?"}, {"id": 1409, "start": 10460.04, "end": 10475.04, "text": "An der Flash? Nee, an der Semtex. Adam sucht mal."}, {"id": 1410, "start": 10475.04, "end": 10489.04, "text": "RIP. Bäm. Weggeschottet. Geschottgammt."}, {"id": 1411, "start": 10489.04, "end": 10514.04, "text": "Oh, Schneiber. Schneiber-Action-8 jetzt. Jutsch Schneiber."}, {"id": 1412, "start": 10514.04, "end": 10525.04, "text": "Da schleicht sich noch ein anderer Dude hier ran bestimmt, oder? Mein Gott, ey, das kann doch nicht sein, dass wir laufen von allen Seiten geowned werden."}, {"id": 1413, "start": 10525.04, "end": 10538.04, "text": "Shit. Okay, nächste Runde müssen wir gewinnen."}, {"id": 1414, "start": 10538.04, "end": 10550.04, "text": "Sollte mich gar nicht mit diesem komischen Schneiber-Stell auffallen. Einfach hier M13 raus und in your face."}, {"id": 1415, "start": 10550.04, "end": 10555.04, "text": "Ach, fuck. Kacke, ey. So dämlich."}, {"id": 1416, "start": 10555.04, "end": 10566.04, "text": "Kommt das alte MW-Feeling auf? Nee, das kommt glaub ich eher Intim-Deathmatch auf."}, {"id": 1417, "start": 10566.04, "end": 10571.04, "text": "Nicht wirklich."}, {"id": 1418, "start": 10571.04, "end": 10581.04, "text": "Das ist auch ein bisschen doof mit zwei, ähm, nur zwei Basis, zwei und, und nur drei Maps."}, {"id": 1419, "start": 10581.04, "end": 10588.04, "text": "Sack, sackt schon ein bisschen, ja."}, {"id": 1420, "start": 10588.04, "end": 10600.04, "text": "Gibt es dedicated servers? Wahrscheinlich. Es fühlt, also manche Kills fühlen sich übelst Bullshit-mäßig an und man kriegt natürlich auch mal wieder keine Lack-Anzeige, also keine Ping-Anzeige, was ja schon mal richtiger Müll ist."}, {"id": 1421, "start": 10600.04, "end": 10615.04, "text": "Ich glaube, dass eine Ping-Anzeige bei ganz vielen Sachen dazu führen würde, dass man sich weniger aufregt, weil du hast so diese merkt, diese typischen Cod-Tode, wo du halt, wo du halt weißt, du hast getroffen und, und irgendwie hast du nicht."}, {"id": 1422, "start": 10615.04, "end": 10619.04, "text": "Und wenn du halt wenigstens eine Ping-Anzeige hättest, dann könntest du dir das so halbwegs erklären, wo das Problem liegt."}, {"id": 1423, "start": 10619.04, "end": 10641.04, "text": "Vor allem, wo, wo ist eigentlich das Problem, eine Ping-Anzeige anzubauen? Ich meine ernsthaft. Wo, wo, wo, was ist, was, wo, was, hä? Also, warum?"}, {"id": 1424, "start": 10641.04, "end": 10656.04, "text": "Das ruckelt, die map, die ruckelt. Da hinten ist er übrigens."}, {"id": 1425, "start": 10656.04, "end": 10674.04, "text": "Hallo. Hui, hui, hui, HD. Vielleicht ist der Ping meistens Müll und soll keiner sehen, also wenn die wirklich ordentliche Server am Start haben, sollte der Ping eigentlich nicht Müll sein."}, {"id": 1426, "start": 10674.04, "end": 10696.04, "text": "Nup, tup, nup, tup. Ah, nup, tup. Lul. ASMR Kinder Fondue. So, so. Ja, Cod ist ja auch übrigens der ASMR-Content."}, {"id": 1427, "start": 10696.04, "end": 10713.04, "text": "Rechts, ich hab rechts was gehört, glaube ich. Nee, links. Da sieht man mal, wie merkwürdig der Sound ist, ne? Hab ich vielleicht meinen Headset falsch rum? Oh, und deswegen ist der Sound so komisch."}, {"id": 1428, "start": 10713.04, "end": 10728.04, "text": "Oh, nur Pistole."}, {"id": 1429, "start": 10728.04, "end": 10744.04, "text": "Einfach mal weggesprayt. Ja, es gibt ja noch nicht mal Balken. Komm, wir gucken mal, kann man eine Ping-Anzeige einschalten?"}, {"id": 1430, "start": 10744.04, "end": 10763.04, "text": "Wow, oh mein, das geht weiter. Fuck. Pistisch, Alter."}, {"id": 1431, "start": 10763.04, "end": 10777.04, "text": "Meine Güte, gibt's doch nicht."}, {"id": 1432, "start": 10777.04, "end": 10783.04, "text": "Ins Knie, jawoll. One-Shot ins Knie."}, {"id": 1433, "start": 10783.04, "end": 10801.04, "text": "Vermaß. Pass mal auf, wir machen jetzt Trick 17. Aha."}, {"id": 1434, "start": 10801.04, "end": 10814.04, "text": "Ich seh die Ficker nicht. Ich seh sie einfach nicht. Das ist so schwammig. Ich seh sie nicht. Warum hat der, dass der mich überhaupt gesehen hat da oben? Ich seh sie nicht."}, {"id": 1435, "start": 10814.04, "end": 10832.04, "text": "Ich mach das nur am Hand vom Soundfest, wo er her schießt. Ich seh nix. Ich seh null, wo der hin schießt. Habt ihr da irgendwas gesehen gerade? Der muss anhaben."}, {"id": 1436, "start": 10832.04, "end": 10855.04, "text": "Ich seh sie nicht."}, {"id": 1437, "start": 10855.04, "end": 10871.04, "text": "Okay, 3-3. Oh, jetzt wieder diese komische Schrecktwaffe."}, {"id": 1438, "start": 10871.04, "end": 10883.04, "text": "Moment, was ist geht? Molotov werfen, so."}, {"id": 1439, "start": 10883.04, "end": 10887.04, "text": "Das war mal was, oder?"}, {"id": 1440, "start": 10887.04, "end": 10907.04, "text": "Und das war meiner Meinung nach drauf, aber nicht. Aber das war nice. Der Jumpshot war nice, oder? Muss man zugeben."}, {"id": 1441, "start": 10907.04, "end": 10914.04, "text": "Achtung, Achtung, wir machen jetzt Trick 17."}, {"id": 1442, "start": 10914.04, "end": 10938.04, "text": "Ja."}, {"id": 1443, "start": 10938.04, "end": 10952.04, "text": "Hat er den jetzt erwischt? Oder den anderen? Jawoll. Trick 17 fängt an zu brennen."}, {"id": 1444, "start": 10952.04, "end": 10965.04, "text": "Tricks gefühlt auch nicht immer ein Hitmarker, wenn du drauffasst. Das fühl ich seit der, das kommt mir seit der ersten Runde so vor. Das sind teilweise ganz merkwürdige Hits oder manchmal triffst du Dinge, wo du denkst, ne, nie im Leben."}, {"id": 1445, "start": 10965.04, "end": 10979.04, "text": "Das ist jetzt ne richtige Shotgun, ne?"}, {"id": 1446, "start": 10979.04, "end": 10999.04, "text": "Was? What the fuck? Was zum Teufel? Ich hab den zweimal gehadet mit der Pistole. Es war ein Shot, aber ich mit der Shotgun über den, oh Gott, äh."}, {"id": 1447, "start": 10999.04, "end": 11009.04, "text": "Die kann irgendwie mal um drei Kilometer mit der Shotgun schießen. Richtig nett. Jetzt muss man gewinnen."}, {"id": 1448, "start": 11009.04, "end": 11023.04, "text": "Wir warten jetzt kurz und dann geht die Flash rein."}, {"id": 1449, "start": 11023.04, "end": 11032.04, "text": "Okay. Ich, ich, ich geb's auf über die Range mit was zu machen. Ich verlier über Range alles."}, {"id": 1450, "start": 11032.04, "end": 11039.04, "text": "Weiß nicht so genau warum, aber irgendwie jetzt über Range krieg ich, krieg ich nichts tot mit den Dingern und sterb jedes Mal."}, {"id": 1451, "start": 11039.04, "end": 11061.04, "text": "Okay, final round. Oh, ordentlich Waffe, jawoll, nice."}, {"id": 1452, "start": 11061.04, "end": 11071.04, "text": "Ich mein, wie oft, wie oft muss ich treffen? Fickt euch mal, ey, meine Güte. Max, den Weitemann nicht, geh jetzt auf. Mach jetzt Schluss."}, {"id": 1453, "start": 11071.04, "end": 11083.04, "text": "Ich hab jetzt drei Stunden gespielt, das reicht mir. Komm, komm, das kriegst du hin. Das kriegst du hin. Easy win, easy win."}, {"id": 1454, "start": 11083.04, "end": 11094.04, "text": "Seht ihr wie das rumrockelt? Nee, ich geh jetzt wirklich auf drei Stunden reicht mir. Du bist frustriert, ich hab links was gehört. Da ist er, da ist er."}, {"id": 1455, "start": 11094.04, "end": 11118.04, "text": "Was machen die dann da? Win. Ja, morgen können wir eine Runde spielen. Wie kommst du so mit dem, generell mit PS4 klar? Ich hab übelst mal eine Probleme."}, {"id": 1456, "start": 11118.04, "end": 11130.04, "text": "Total ungewohnt, ja. Ich hab ja so einen Adapter, wo man auch mit Xbox spielen kann, aber generell ist halt, Playstation Aim ist halt gefühlt, also das liegt glaube ich irgendwie am Controller,"}, {"id": 1457, "start": 11130.04, "end": 11150.04, "text": "aber selbst wenn ich den Xbox Controller an die Playstation mach, ist das eher Scheibenwischer, wohingegen Xbox halt direkt ist. Morgen mach ich Tastatur und Maus dran."}, {"id": 1458, "start": 11150.04, "end": 11161.04, "text": "Oh fuck, ich war noch in der Queue. Morgen mach ich Tastatur und Maus dran und dann probieren wir mal aus, wie sich damit auf der PS4 spielt."}, {"id": 1459, "start": 11161.04, "end": 11181.04, "text": "Wenn das denn überhaupt geht, haben jetzt so viele gesagt im Chat schon, das funktioniert. So, jetzt machen wir wieder Trick 17, Achtung."}, {"id": 1460, "start": 11181.04, "end": 11197.04, "text": "Nee, oder? Alter, was ist das wieder? Übelst nice. Plates gemacht und dann wirst du hier abgefarmt."}, {"id": 1461, "start": 11197.04, "end": 11215.04, "text": "Zweimal wieder, das fand ich eigentlich ganz sinnvoll. Der andere flankt rechts. Okay, da hab ich jetzt vorbei geschossen. Ich reg mich ja nicht bei allem auf."}, {"id": 1462, "start": 11215.04, "end": 11232.04, "text": "Wenn ich selbst vorbei schieße, ist das okay. Oh, Schneiber, Schneiber. Hardscope, Hardscope."}, {"id": 1463, "start": 11232.04, "end": 11247.04, "text": "What? Jetzt könnt ihr mir nicht erzählen, dass das nicht drauf war. Das kann mir keiner erzählen, dass das nicht drauf war."}, {"id": 1464, "start": 11247.04, "end": 11266.04, "text": "Wir machen das jetzt anders. Wir packen jetzt die Pistole aus und rushen die. Hat keinen Sinn. Ich will eine Ping-Anzeige, ohne Scheiße, ich will eine Ping-Anzeige."}, {"id": 1465, "start": 11266.04, "end": 11279.04, "text": "Weil ich hab bei dem noch nicht mal geschossen wieder. Ich will eine Ping-Anzeige. BTF, ist das wieder? Da kommt der Geschleide, der Tote."}, {"id": 1466, "start": 11279.04, "end": 11292.04, "text": "Die machen das aber auch sinnig, die Gegner, das merkste. Du merkst gleich, wenn du zwei hast, die ordentlich können."}, {"id": 1467, "start": 11292.04, "end": 11305.04, "text": "Du machst dir nichts. Da machst du echt gar nichts. Da wirst du geschreckt ohne Ende."}, {"id": 1468, "start": 11305.04, "end": 11333.04, "text": "Das ist hier 06. Alter, da merkste halt, wenn Gegner was taugen, dann bist du halt, wenn du so ein Playstation-Sucker bist wie ich, kriegst du halt auf die Fresse."}, {"id": 1469, "start": 11333.04, "end": 11347.04, "text": "Oh nice. Immerhin, immerhin nicht 6-0."}, {"id": 1470, "start": 11347.04, "end": 11365.04, "text": "Das Ding gefällt mir auch, ist mal ordentlicher. ACOG."}, {"id": 1471, "start": 11365.04, "end": 11379.04, "text": "Du machst dir nichts. Da machst du nichts. Gut Leute, reicht für heute. Ich glaube morgen geben wir uns das Ganze nochmal."}, {"id": 1472, "start": 11379.04, "end": 11396.04, "text": "Ich meine, es hat ja nicht viel Kontern. Es ist ja nicht so, dass man da jetzt irgendwie 24-7 mal für eine Woche spielen kann. Wobei so lange geht das gar nicht. Ich glaube Sonntagabend ist eh Schluss."}, {"id": 1473, "start": 11396.04, "end": 11410.04, "text": "Also Leute, ich hab nichts gesehen bisher. Ich hab heute nichts gesehen, was Abos angeht. Muss mal mein Zeug wieder umstöpseln, dass ich was sehe."}, {"id": 1474, "start": 11410.04, "end": 11433.04, "text": "Da gucke ich nochmal schnell. Da mal umstöpseln, den ganzen Müll hier. Dann gucke ich nochmal kurz rein, weil nicht, dass ich jetzt irgendwie zig Leute übersehen hab."}, {"id": 1475, "start": 11433.04, "end": 11451.04, "text": "Das wäre natürlich nicht so nice."}, {"id": 1476, "start": 11451.04, "end": 11460.04, "text": "So. Gucken wir mal. Ach ne, ich kann ja hier gar nicht gucken. Muss hier drüben gucken."}, {"id": 1477, "start": 11460.04, "end": 11474.04, "text": "Streamlabs."}, {"id": 1478, "start": 11474.04, "end": 11491.04, "text": "Also, wen haben wir denn hier heute? Ähm, den Martin haben wir. Den 11Core, Neusman09, GWOZ30Crucenda, den kenne ich schon. Der ist öfters am Start, ist auch wieder neu dabei."}, {"id": 1479, "start": 11491.04, "end": 11511.04, "text": "Wahrscheinlich zwei Monate. Ich sehs jetzt hier nicht mal. Xfacer, Zyplin, der Hydrogen Yoyo, Tanser und der Casino Capitalist. Dankeschön für alle Twitch Prime Subs, wo wir jetzt gerade dabei sind. Das muss jetzt nochmal sein."}, {"id": 1480, "start": 11511.04, "end": 11522.04, "text": "Für alle, die heute subscribt haben. Und auch danke an alle, die gefollowt haben. Haben wir sicherlich auch ein paar. Muss ich mir mal angucken. Recent Events."}, {"id": 1481, "start": 11522.04, "end": 11543.04, "text": "Follow, Follow. Ja, Dankeschön, Follow hier. Aber auch, haben wir auch jede Menge. Dankeschön für die Follows und für die ganzen Subs. Ich konnte euch leider nicht alle vorlesen, aber es gibt jetzt nochmal eine Runde."}, {"id": 1482, "start": 11543.04, "end": 11561.04, "text": "Und natürlich für die ganzen, für Qt Chat."}, {"id": 1483, "start": 11561.04, "end": 11578.04, "text": "So Leute, ich glaub übrigens mein Chat ist verreckt. Ich seh kein Chat mehr. Jetzt gehts wieder. Ich glaub der Zypelsrohr ist übrigens abgespackt."}, {"id": 1484, "start": 11578.04, "end": 11591.04, "text": "Ja, danke für die ganzen Subs. Wahrscheinlich bin ich morgen wieder am Start. Muss ja. Es kann auch sein, dass einfach keiner geschrieben hat. Und dann schauen wir mal wie es läuft."}, {"id": 1485, "start": 11591.04, "end": 11611.04, "text": "Das war heute schon, das war mir schon wieder typisches Call of Duty Gerage Deluxe. Die ganze Geschichte. Und sehr merkwürdig die Sachen wieder passieren zwischendurch. Und ein paar mal übelst gerollt worden."}, {"id": 1486, "start": 11611.04, "end": 11621.04, "text": "Ja, machts gut Leute. Wir sehen uns. Bis morgen. See you."}]}