{"text": "So, jetzt ist es besser, ne? Ja, jetzt ist es gut.Haha, das war eine schnelle Runde, ja.Qualitätsoptionen, ja. Das war wahrscheinlich ganz gut, dass ich das deswegen aus und wieder angemacht habe, weil das keine Absicht war.Seht ihr das eigentlich?Ja, ne? Musste eigentlich eingeblendet werden.Big Brain.Ok, heute spielen wir nämlich den zweiten Teil fertig. Also, das Game gibt es ja nur einen Teil von, aber die zweite Hälfte des Spiels war heute fertig.Und ich habe mir jetzt auch endlich hier wieder mein Memeboard-Briefview-Zeug eingebaut. Das heißt, ich brauche jetzt selbst keine Overlays mehr angucken und ich kann euch trotzdem Overlays anmachen.Wir haben jetzt sogar extra Weep-Overlays am Start.Guck mal, die Suche funktioniert auch, die wir gestern gebastelt haben. Richtig nice, oder?Jetzt muss ich nur noch das einblenden auf der zweiten Seite.So, gut, auf geht's. Achso, vielleicht soll ich noch mal auf Twitter posten.Ja, das weiter geht. Twitter-Beste.Seht ihr die Emotes auch, wenn ich in-Game bin? Weil ich habe es mir jetzt so eingestellt, nachdem das Game nur schlecht als recht Fenstermodus unterstützt. Ich habe mir eingestellt, dass ihr das jetzt seht, allerdings ich nicht.Also, wenn wir mal gucken, ob das funktioniert, wenn wir auf Fullscreen sind. Ich mache jetzt mal irgendwas auf. Irgendwie hier, was weiß ich. Exploding Brain. So, jetzt solltet ihr ja den Typ gesehen haben.Oder der Gaben kann natürlich auch an Start. Das sollte man jetzt in OBS sehen und ich sollte das nicht sehen. Das ist eigentlich ganz praktisch. Dann fliegt man nämlich nicht aus dem Game raus. Das ist Pogos.Massive ist das. Huge. Huge.Richtig huge. Okay, nice. Funktioniert. Sehr schön. Achso, Lautstärke. Erstmal komische Musik aus. Ja, genau, wir müssen jetzt ja noch auf Twitter und geh du ins Posten. Lull.Erstmal kleiner Lautstärketest. Weil das verstellt sich ja leider immer. Warum, weiß man nicht so genau. Lautstärkentest. Moment, Achtung.Ich glaube, das ist ganz passend laut.Oh, sollte passen. Gut, dann machen wir jetzt mal einen ordentlichen Twitter-Post. Dann geht's los. Kurz die Musik an.Ich hab nämlich heute Morgen noch ein bisschen unser Tool hier erweitert. Mit Shortcuts, mit eigenen Browser Fenster für OBS. Also sprich, wie gesagt, ich kann jetzt Bildchen einblenden, die nur ihr seht und ich nicht.Und zwar kann man das folgendermaßen machen. Man kann sich hier einen Preview-Tab aufmachen und den kann man dann in OBS als Browser Source einbinden. Das heißt, wenn man Games hat, die überhaupt nicht mit klarkommen, dass man Sachen overlayt und die Games aus dem Game wirft, dann kann man das einschalten.Ich hoffe, ihr habt's verstanden. Was ich mein. Twitter-Post. Sollen wir auch YouTube-Post machen? Also kein Video-Upload, sondern diesen komischen Community-Post.Moin, Chicken-Man. Hallo, Sharks-Development.So, das war's für heute. Ich hoffe, ihr habt's verstanden.Vielen Dank für's Zuschauen.So, Twitter-Post ist raus.Gut, Musik aus, auf geht's.Genug gechillt, steppt.Wenn ihr in Hessen, aus Hessen kommt, wartet ihr heute schon wählen. Also ich war heute Vormittag schon, also vor irgendwie zwei Stunden oder so.Natürlich, aha.Moin, xQni. Was ist zur Zeit ein Main-Game? Ja, wenn ich eins hätte, ne? Wenn ich eins hätte.Also, ähm, zu wirklich gibt's ja keins aktuell.Also, wo sind wir denn das letzte Mal stehen geblieben? Für alle, die nicht dabei waren, ähm, ist schwierig.Die Musik ist doch einen Ticken laut, oder? Die hinter, auch, das hört man schon, der Hintergrund, das ist dann, ne, jetzt mal.Jetzt crasht das Game bestimmt beim Maximieren.Ne. Ja, wo sind wir das letzte Mal stehen geblieben? Ähm, wir haben, wir haben mit dem Wizard Grill zusammen einen Drache besiegt.Und das Wizard Grill wurde vom bösen Necromancer gekillt.Und jetzt sind wir mit dem Dämonenkrill in unserem Kopf unterwegs, irgendwelche geheimen Gems zu sammeln, mit denen wir dann irgendwas tun können, was auch immer.Wir müssen letztendlich die Welt retten. Wobei, man muss dazu sagen, ganz so einfach ist es in dem Game gar nicht.Also, bezüglich Welt retten, ja. Das hat jetzt keine super tiefgreifende Story, aber ist gar nicht mal so übel.Und es hat das beste Kampfsystem von allen Gems.So, weiter geht's. Pogu hab ich nicht aktiviert. Pogu gibt's nicht.Ich sollte mal auf meinem zweiten Bildschirm den Chat und mein Memeboard vertauschen. Das wär, glaub ich, viel, viel sinnvoller.Ups, ich hab den Chat zugemacht.Ich vertausch das mal, dann seh ich nämlich den Chat besser.Oder, vielleicht schieb ich's doch lieber andersrum.Ah, ich schieb's doch andersrum. Perfekt.Okay, weiter geht's. Also, wir brauchen jetzt noch ein Gem und dann können wir Dinger tun. Und letztendlich müssen wir ein paar Gegner hauen.Oh, der hat sich selbst aufgespießt. Das war natürlich ein Big Brain Play vom Gegner.Äh, wo ist der Gegner hin? Alter!Oh, so viele Geister ist am Start.Direkt. Direkt.Kicksorn.Noch mehr. Ähm, schreibt mir mal bitte, ob die Lautstärke passt. Ich hab da immer Probleme mit.Oh, oh, Bein ab.Oder ob wir noch einen Ticken lauter machen sollen.Ich kann das immer schlecht einschätzen. Das ist oft mal so, wenn's für mich übelst laut ist, ist es für euch zu leise und sowas.Das kann man immer schwer einschätzen.Elder Scrolls 6 Alpha. Ja, das Kampfsystem kann jedes Skyrim einpacken mit.Das ist so das beste interaktive Mehlekampfsystem, was ich je in dem Game gesehen hab.Lautstärke passt. Mikro in dem Sound gut gemischt. Ja, das ist schön.Wenn ich das richtige Erinnerung hab, kommt jetzt gleich der große Story-Twist.Wenn ich das noch richtig weiß.Das letzte Mal hab ich's ja gespielt vor gerne 10 Jahren oder so.Moment, wo müssen wir hin? Irgendwo da rüber, würde ich sagen.Rüber müssen wir stellen.Und ich hab mir das jetzt so gemacht, dass ich eine zweite Maus am zweiten Rechner hab. Das heißt, ich kann jetzt zweiten Rechner Infantry-Emotes einplatten.Das ist sehr praktisch.Oh, was haben wir da? Kettenrüstung. Kettenrüstung haben wir schon, ne?Wir haben sogar, haben wir nicht sogar noch was besseres schon?Plate Armor haben wir. Plate Armor plus zwei, äh, plus drei. Tja.Wir basteln jetzt noch ein paar Gegner und dann überlegen wir uns, was wir mal upgraden können.Entweder machen wir mehr Rüstung oder wir upgraden die Stärke.Aber ich glaube, wir upgraden die Stärke, dann können wir unser Life-Leech, unser Life-Leech-Schwert verwenden.Oh, der fängt ja auch von sich an zu schreien.Au!What the fuck?Was ist hier los?Hauptsache, den besten Klettern, oh, der ist ja der, was du magst leider, der beste Kletterer hier, ne?Hier können wir noch.Kommen wir hier rauf?Ähm, mal gucken.Oh, WTF.War nicht mal Singleplayer-Spiele funktionierender.Weiß gar nicht, ob die Kette reicht oder ob wir nochmal selbst ein paar Pfeile hochschießen müssen.Mal schauen.Ah, das sollte reichen. Wir müssen irgendwo darüber hüpfen.Was für ein Game war im ersten Schirm nicht dabei? Das ist Dark Messiah of Might and Magic.Das ist, äh, muss ich mal kurz was zu zeigen, mach ich grad mal auf, weil die Frage kommt wahrscheinlich öfters.Das ist ein Game von, ich glaub, 2006? 2006?Ähm, auf der Source-Engine.Ähm, auf der, auf der, auf der Half-Life 2-Version von der Source-Engine.Und dementsprechend hat es relativ viel Physik-Schlickstack auch dabei.Aber bei dem Kampfsystem kann er halt auch Skyrim einpacken.Das ist das einzige Game seiner Art, was ich kenne und ich...Oh, oh, oh, Max, Max...Was?Hallo? Ich bin auf der Brücke gelandet.What the fuck? Game hat mich massiv gebated gerade.Ähm, soll ich grad sagen, ja.Also bei dem Kampfsystem kann im Prinzip eigentlich jedes Game einpacken, was ich kenne, was versucht irgendwie Nahkampf-Sachen zu simulieren.Das kann das Game wirklich, das ist einfach das Beste.Ich kann es auch gleich nochmal kurz zeigen.Ja, und wie man halt sieht, das ist halt Half-Life 2.Beziehungsweise die Source-Engine vom Stand eines Half-Life 2.Und dementsprechend sind da halt jede Menge Physik-Schlickstack drinnen.Ja, so zum Beispiel, wie hier irgendwelche Seile hinschießen, dass man dann rüberspringen kann und sowas.Ich hab gedacht, er ist durchgefallen.Steckt der in der Wand?Lull.War jetzt hier noch irgendwas, was ich sammeln könnte?Was denn da?Was denn da?Sollen wir da nochmal reingucken?Oh, ich weiß nicht.Na, komm.Scheiß drauf.Wir speichern jetzt mal und dann machen wir...und skamasen wir das Save-Game.Wir gucken da jetzt rein und wenn da nichts ist, loanen wir einfach.Da müssen wir nicht nochmal hochklappern.Eats.Aber es sieht schon so aus, als soll man hier lang.Oder vielleicht ist hier irgendwas Geheimes versteckt.Mal gucken.Das Game ist ja voll von irgendwelchen Secret Areas und Secret Zauberdinger, die man ver...Nee.Okay, wir loanen.Hier war was schon.Wirst du Red Dead Redemption 2 spielen?Nee.Wie ich das letzte Mal schon gesagt hab, vielleicht hol ich's mir irgendwann nochmal.Ich bin einfach kein Open-World-Typ.Ich bin wahrscheinlich der Einzige, der sich das Game nicht gekauft hat.So, haben wir jetzt eigentlich alles?Ja, okay, haben wir.Gut, dann sind wir nämlich, glaub ich, mit dem Part vom Game durch.Jetzt kommt der große Story-Twist.Ich glaub, was war hier?Weil aktuell denken wir ja noch, dass wir die Welt retten müssen, so wie in jedem Fantasy-Spiel.Ich hab alle Gems einsetzen.Ja, manchmal ist es gut, wenn man viele Emauts hat.Jetzt müssen wir natürlich warten, bis das hochgekommen ist, weil wir sonst erquetschtwerden, weil Half-Life 2 Physik.Ja, jetzt kommt ein sinnloser Spider-Fight.Das heißt, für alle, die neu sind, kann ich das Kampfsystem erzeigen und warum ich denke,das beste Knack-Halb-Kampf-System ist, was es gibt.Also, erstens war davon abgesehen, dass es zig verschiedene Waffen gibt.Also, von Daggers zu Zweihandschwertern, zu Schwert mit Schild und sonst was.Man hat zig special moves, sprich, wenn man links liegt, auflädt, rechts auflädt, rückwärts,sonst was, Jump-Attack, rennen, mit Zweihandschwert rennen und dann halt noch eine stärkereAttacke machen und solche Dinger, ich versuch's mal zu zeigen.So was hier kann man auch machen.Jetzt bin ich vergiftet.Auf sieben ist man gegen Giftpreis.Dazu gibt es natürlich noch Bogenstells, den ich nicht gespeckt habe.Es gibt Schwert und Schild, Schwert und Haken, Schild und Haken.Also, es gibt zig Waffen und alles sind irgendwie im Handling anders und fühlen sich nichtgeil an, was das Dark-Halb-System anbelangt.Ab und zu kriegt man dann mal special attacks.Und man kann halt die Gegner in der Regel immer mit irgendwelchen Physikgeschichtenkillen, weil es halt Source-Engine ist.Oh, hier ist noch was.Nehmen wir mal ne Potion.Wer ist das Game?Dark Messiah of Might and Magic.Sollen wir mal gucken, ob hier noch irgendwas versteckt ist?Wo ist die Potion genau hingeflogen jetzt?Irgendeine Potion ist hier hinter geklitscht.Okay, hier gibt es nix.Hier gibt es noch mal was.Gegen Gift Potion.Hier gibt es noch mal was.Gegen Gift Potion.Ja, es gibt nen Skilltree, was man im Prinzip specken kann, eigentlich was man will.Und das ist dann eigentlich auch ganz cool gemacht.Man kann sogar komplett auf Stealth spielen, wenn man will.Mit Dolchen.Man kann auf Magic spielen mit Feuerball und Zeugs rumkicken und sowas in der Richtung.Aber wir spielen relativ klassisch gerade.Zwei-Hand-Org-Schwert und in your face und drauf.Aber das ist sehr vielfältig und es ist eines der Spiele mit dem höchsten Replay-Faktor im Endeffekt.Die Kampagne ist kurz so knackig, so irgendwie sieben, acht Stunden, würde ich sagen.Und das ganze System ist halt richtig nice.Vor allem, weil man so ein Org-Schwert auch einfach mal so kurz mit zwei Fingern dreht.So weißt du, so ein riesen, irgendwie vier, fünf Kilo schweres Ding.Mit den Fingern.Okay, jetzt muss ich ruhig sein.Moment, ich bin auf der falschen Seite.Nach diesem komischen Skull of Shadow waren wir ja quasi die kompletten letzten Streams auf der Suche.Und jetzt haben wir es gefunden. Jetzt kommt Story.Ach ja, wir sollen unseren Vater befreien, ne?Das ist ja der Oberdemon Lord.We waiting for our vengeance.We have waited for you.You are the one foretold by the wizard Sar-Shazar,the dark messiah of ancient prophecy.You are my sun and my air,the herald of fire and of blood.The creature that accompanies you is yours.Nimm sie an, sobald du siehst, dass sie fit sind.Jetzt nimm die Kugel meines älteren Gegens und schüttere das Gefängnis, das mich hält.Dies, mein Sohn, ich bestreite dich.Ich bin frei. Dieser Welt und jede Waffe in ihm wird ich sein.The Skull of Shadows ist nicht für die Likes von mir, Demonspawn.Der 7. Drache hat sich nicht selbst zerstört, sodass ein Demonspaar alle seine Arbeit verbreiten kann.Ich mache das für den Zweck aller Ashland.Die Propheze des dunklen Messias endet hier.Was ist passiert?Arentir hat dich getötet. Ich habe die Energie des Skulls verwendet, um dich zu reviven.Ich fühle mich... anders.Nicht überraschend. Wir sind noch näher gegründet, und einige meiner Gründe sind deine.Wo ist Arentir?Er ist weg mit dem Skull. Wir müssen schnell ihn stoppen.Stoppen? Ich werde ihn töten.Die Orks haben all deine Ausrüstung genommen. Sie dachten, dass du tot bist.Zeig ihnen, dass sie einen kleinen Fehler gemacht haben.Erich Gr Hannah.Erich Gr Hannahænoch mal zu unterstreichen, haben wir jetzt dadurch, dass jetzt Xana, also das ist die,die da im Hintergrund immer spricht, halt die, die auch gerade in der Zwischensequenzrumgerannt ist, also das, das Demon Grill. Oh, Big Brain. Deswegen, um das jetzt nochmal zu unterstreichen, haben wir jetzt auch unsere Demon Form am Start und können damitOrcs bashen und alles. Das hatten wir vorher nicht, weil vorher haben wir ja noch gedacht,wir sind der Gute, aber wir sind gar nicht der Gute.Okay, wir haben leider kein Inventar und wir können auch nicht auf den Skilltree zugreifen,wir müssen jetzt erstmal unsere Ausrüstung suchen. Meine andere Frage Boxen oder Headset?Kopfhörer und Mikro. Oh, Orc stellt's. Psst. Wir haben keine Rüstung und nichts Gescheites,wir müssen jetzt ein bisschen vorsichtiger sein. Oh, fuck, der hat mich gesehen. Warum?Warum hat der... Aber ich hab ja, ich hab ja ein Schild aufgehoben. Komm mal her, Orc.Erschreckt. Ausgeorgt. Ich muss mal kurz gucken, ob der Orc irgendwas dabei hat, was ich brauche.Nee, sieht nicht so aus. Gehen wir wieder hoch. Ja, ich hoffe, ich hab die Story jetztin soweit ganz gut zusammengefasst, dass man das jetzt kapiert hat. Aber nichtsdestotrotz,wir können immer noch, was wir nicht machen werden, es sei denn ihr wollt das unbedingt,ja, wir können immer noch den Guten spielen in dem Game. Ihr könnt euch ja schon malüberlegen, so ungefähr in zwei Stunden müssen wir uns entscheiden, was wir, was wir machen,ob wir gut oder böse sind. Könnt ihr euch ja schon mal überlegen. Und die Entscheidungist relativ weitreichend, ja. Oh, Spinnen. Und das ist auch das Spiel, was ich kenne,was Spinnen am besten hingekriegt hat. Ich kenne keinen Game, wo Spinnen ekliger sind.Spodas. Oh, ich hab keinen Schlüssel. Geht nicht auf. Lull. Oh, hier ist mein Zeug.Oh, jetzt haben wir unsere Ausrüstung wieder. Soll ich den Schlüssel haben, um das aufmachenzu können? Äh, Moment. Man kann da drüberspringen? Ob das so gedacht ist von dem Game? Ob dasjetzt gerade, ob das so gedacht war, dass ich hier einfach drüber hüpfen kann? Es siehtjetzt nämlich nicht so aus, als wäre das so gedacht. Ich bin mir da nicht so sicher.Wahrscheinlich haben jetzt irgendeinen Teil geskippt oder so. Aber gut, ich mein, wirsind hier einmal im Kreis, glaube ich. Hier ist ja eigentlich sonst nix mehr. Aber ichglaube nicht, dass das so gedacht ist, dass man hier durchgeht. Ah, erster Glitch fürdie Spieler. Du musst dir das Game als Speedrun angucken. Im Prinzip wird das halbe Gamegar nicht gespielt. Also ist das ja Speedrun-mäßig. Bei vielen Games. Natürlich, weil Source Engineist, kannst du auch jede Menge Zeug im Endeffekt rumwerfen, Physik-Zeugs kaputt machen. Oh,die stelzen wir jetzt. Die stelzen wir jetzt. Die konnten wir nicht stelzen. Da sieht man,was ich vorhin gesagt habe, es gibt relativ viele verschiedene Waffen. Alle vom Handlingher ein bisschen anders. Und die Gegner sind gar nicht mal so doof. Alter, ich will, dassdu da runterfliegst. Wenn du da runterfliegst, kann man so machen. Oder auch nicht. Oderauch nicht. Oh, nice. Wir können schmieden. Schmiede-Action können wir machen. Craft-Wars.Das da kommt rein. Das gibt ja ziemlich richtig gutes Schwert. Hier muss man auch von Handcraften. Geht nix mit Crafting-Menü. Hier muss man von Hand craften. Ein nicees Schwertkommt da jetzt raus. Blade. Amboss. Und wir haben noch irgendwo ja, wir haben da ein Hammer.Ha, falsch. Erstmal Schwert in Schmiede rein. Schwert heiß machen. Medieval-Schmiedesimulator.My little Plexmith. Oder irgendwie sowas gibt es bestimmt schon als Game. So, und jetztmüssen wir hier irgendwie noch nen Griff machen. Und dann haben wir richtig geile Schwert.Beste, ich glaube mit eines der besten Schwerte in dem Game. Flammenschwert. Ein sehr, sehrnicees Teil. Wobei ich sagen muss, ich persönlich finde das andere... Oh, oh, geht das kaputtmit der Zeit? Ah, man kann das nur ne gewisse Zeit in der Hand halten, ne? Oder gehts dannwieder kaputt? Man kann das wahrscheinlich nur ne gewisse Zeit in der Hand halten. Ok,das haben sie gemacht, weil es sonst zu OP wäre. Das finde ich eigentlich am besten,das ist ein Schwert mit Life Leech. Dazu müssen wir aber Stärke 3 specken, aber das könnenwir ruhig mal machen. Wir haben eh genug Skill Points. Und Mana Potions machen wir malweg. Ein nicees Schwert. Anderes Schild kommt weg, brauchen wir nicht mehr. So, können wirnoch Endos specken? Oh nice. Wir könnten auch noch specken, dass wir die neue Rüstunganziehen können. Sehr schön. Life Leech Waffe und Plate Armor. Da kann jetzt im Prinzipnix mehr schief gehen. Gebashed, werden sie. Oh, den einen hat's erwischt, den hat's zerrissen.Oh, Boss. Oh, oh, so war das nicht gedacht. Ok, wie hat man das Ding nochmal kaputt gemacht?Hat man das überhaupt kaputt gemacht oder konnte man hochklettern? Ich glaub man musstehochklettern, kann das sein? Ich weiß es nicht mehr genau. Ok, wie macht man das Fisch kaputt?Wir können ja versuchen ins Auge zu Jump Slashen. Hallo, komm her. Oh, Monka Giga. Ach, ichmuss dem bestimmtes Zeug umhauen lassen, da fällt's auf ihn drauf. Big Brain. Lass dennoch umhauen, please. Äh, nein, nicht werfen, geh weg. Nicht werfen. Kaputt machen hier,kaputt machen. Nee, der macht hier nicht kaputt. Ah, guck mal da, da ist was. Ich hab ja sodas Gefühl wir müssen hier hochklettern, weil da oben kletzert's auch, weil das ein bisschengefährlich werden könnte. Oh, oh. Hallo. Hallo, Cyclope. Cyclope overrated. Es ist natürlichziemlich blöd, wo... Ich kann jetzt hier weiter hüpfen. Ah, oh nee, ich hätte da was hinschießenmüssen. Ähm. Ach, guck mal, er geht weg. Ah. Piss dich. Wie, das ging nicht? Jetzt geht's.Jetzt geht's. Ok, schnell, schnell. Kletter, kletter, kletter, kletter, kletter. Hau michnicht weg. Kletter, kletter, kletter, kletter, kletter. Aha. Ok. Ein Stelzer Outfit, dasbrauchen wir nicht. Das können wir, Stelz 3 werden wir wahrscheinlich eh netzbacken.Ähm. Ähm. Meint ihr, das ist so gedacht, dass man sich jetzt hier so langhangelt? Dassman jetzt quasi den Spider-Man macht? Ich meine, die Physik in dem Game gibt's ja her,dass man sich hier langhangelt nach da drüben. Ich glaube, das ist von dem Game nicht sogedacht. Ich glaube, das ist von dem Game nicht gedacht. Oder was meint ihr? Mal gucken,ob das überhaupt geht. Ah. Alter, warum ist der durch die Seile gerannt? Warst du schonwählen? Ja. Oh. Oh. Ich konnte hochklettern. Nice. Nice, du. Ok, vielleicht ist es ernsthaftso gedacht, dass man den Outstelzen kann, den Gegner. Ob das... Ich hab mal eine Zweifel,dass es so gedacht ist. Wir gucken jetzt mal, ob wir hier rauskommen. Aber selbst wenn wirrauskommen, probieren wir mal, wie man den Cyclop bashen kann. Ich glaub nicht, dasses so gedacht ist, was ich hier mache. Oh. Oh. Oh. Nice. Nice, es geht. Aber die Musikläuft weiter. Das ist nicht so gedacht. Aber wir gucken mal, wie man das Viech platt machenkann. Das interessiert mich jetzt schon auch. Aber wisst ihr, was ich cool finde? Dass daseben nicht nur so tut, als hätte man eine gewisse Freiheit mit der Physik-Engine drunter,sondern man hat die Freiheit auch wirklich. Also sprich, man kann sich auch durchklitschen,ob man will oder nicht. Ob es das so gedacht ist oder nicht. Vielleicht kann... Genau,vielleicht kann ich ihm ins Auge ballern. Das geht bestimmt. Aber ich hab keinen Bogenstellsgespeckt. Ich hab keinen Bogenstells... Oh. Hat es getroffen? Guck mal, der ist clever.Es geht weg. Es geht weg, dass ich nicht sehe. Ein nicer, schlauer Cyclop. Doch nicht. Nee,ich glaub nicht, dass es so gedacht ist. Was haben... Oh, da hinten haben wir noch was.Vielleicht, vielleicht kann man da mit interagieren. Oder aber... Komm, wir machen jetzt YOLO, wirJumpslashen ihn einfach kaputt. Das geht bestimmt. Alter, warum hab ich überhaupt so ein Akt gemachtjetzt die ganze Zeit? Warum hab ich jetzt... Warum genau hab ich so ein Akt gemacht? EinfachJumpslashen und on. Mein Brudi meint, das Game sei verbackt. Nee. Geht eigentlich. Eatsreckt, ja. Vielleicht hätten wir ihn hiermit auch noch irgendwie platt machen können.Eine sehr schnelle Tür. Nee, nee, der PC-Port wurde nicht offiziell bestätigt. Aber ichkönnte mir vorstellen, dass Rockstar einen PC-Port macht. Das war bei GTA auch so. Undso ein Hype, wie um das Game ist. Und ich denk mal, sie werden sich natürlich auch dieGTA-PC-Verkaufszahlen angeguckt haben, wie viele Leute quasi Multiplayer spielen undsonst was. Ich geh davon aus, dass es einen PC-Port geben wird. Ich denke, sie haben dagute Erfahrungen mit GTA gemacht. Also ich denke, es wird einen PC-Port, wird's auf jedenFall geben. Hm, das Seil hat nicht funktioniert. Aber so sollte das klappen. Ich finde denKlettersound geil. Haben wir schon? My Prince. Aua. Toll. Einfach mal den Berg runterjumpslashed. WTF? Bin dazu wirklich langsam runtergehöpft. Spodas. Hallo Patrick. So viele Spodas.Boah. Spodas in den Games sind sehr eklig.Noch einer. Rekt. Eindeutig zu viele Spinnen. Uah, noch mehr. Das ist so eklig gemachtin dem Spiel, wie ich um die Ecke komm. Ich bin ja eh kein Spinnen-Fan. Das wisstja. Ich hab's mit Spinnen nicht. Aurel nicht. Und es ekelt mich in keinem Game-Spin, außerin dem. Ach ja, guck mal, jetzt sind wir hier, wo wir rausgeklettert sind vorhin. Also ichglaube nicht, dass das Game sich das so gedacht hat, aber es funktioniert und das ist ziemlichgut. Ich weiß, wenn man sich mal genau überlegt, ist es schon ziemlich nice, ne. Dass diehier nicht gesagt haben, nach dem Motto, hier ist sie verlassen das Kampfgebiet, sonderndass sie es einfach erlauben, dass du hier rauskletterst und den Fight umgehst, mit demsie sich Mühe gegeben haben. Das finde ich halt cool. Das ist nicht so, man tut so, alshat man einen Physik-Engine, lässt die Leute trotzdem nicht machen, was sie wollen, sondernlebt halt einfach damit, ne.Ah, das Demo-Level. Das Game kommt aus der Zeit, wo es noch Demos gab. Und das war dasDemo-Level hier. Ist hier irgendwo was? Achtung! Bam! Das Kampfsystem ist einfach nice. Da kannkeiner was anderes sagen. Beste. So, stellst du uns mal hier rein? Der Kreis in der Mittezeigt übrigens an, wie sehr man gestellst ist. Wie soll ich die denn jetzt messern?Kann ich irgendwie hier hoch? Hier hochklettern? Und irgendwas bashen? Ich meine, ich könntedie Goblins easy-Mehle-ownen, ja, aber ich will mal ein Dolchin, ein Messer. Ach, dann.Okay, dann fackel ich sie halt ab, wenn ich sie nicht messern kann. Die können nichts,die Viecher. Zack! Arm ab. Noch irgendwo was? Was ist das hier? Aha! So, was ist das?Secret. Aber nichts Tolles drin. Noch mal ein gefangener Ork. Die Goblins haben wirja alle geowned, hier ist nichts mehr. Ach, ich glaube, man hätte hier runter gehen können,hier hintertauchen und dann hier hoch. Das hätte wahrscheinlich auch funktioniert, abernachdem wir im Prinzip die Goblins einfach Nachkampf-ownen können, drauf geschissen.Jawoll. Wir sind mal so nett. Ich glaube, die alternative Taktik wäre gewesen, den Orkauch und die Goblins. Debated. Die können gar nichts.Die machen wir auch noch platt hier unten. Ist noch Blut drinne. Komm mal her. Komm malher Goblin. Ja, komm. Und jetzt BAM! Oh nee. Fuck. Ich wollte eigentlich die Stachel kicken.Dann halt nicht. Wenn du nicht willst. Aber komm, du lässt dich in die Stacheln kicken.Zack! Physik-Engine beste. BAM! Weiter geht's. So, ich glaube nur, wir müssen da hochklettern.Wann wird eigentlich Chrono Trigger mal gestimmt? Du hörst ja öfters die Musik davon. Dasist zu lang. Das ist zu lang. Das braucht irgendwie 20 Stunden oder so. Wo kommt dennder her? Der war eben noch nicht da. Ist ja auch schon wieder weg. Achja, ich wollte malgucken, was hier unten drinne ist. Ob irgendwas... Lass mich mal runterspringen. Moment, respawnendie hier? Die respawnen definitiv, oder? Ja, ja. Spawncampen angesagt hier. Was habenwir hier zu bieten? Staggers? Staggers? Haben wir die schon? Oh, plus 6 Damage Staggers.Können wir zwar nicht gebrauchen. Aber wir nehmen sie mal mit. Und irgendwann schmeißenwir uns weg, weil wir nicht genug Inventarplatz haben. Der Chrono Trigger ist speedran. Ichglaube, das kriege ich nicht gebacken. Achso, im Dezember 4 Tage am Stück. Also im Dezembersind wir eh ziemlich... Ich komm von da oben runtergejumpt. Jetzt verstehe ich das. ImDezember sind wir wahrscheinlich eh fast jeden Tag am Frenrun. Moment, der wird jetzt gebogit.Oh, der hat seinen Boden genagelt. Sieht nicht so aus, als geht es hier lang. Das Game isteindeutig das bessere Thief. Es hat gewisse Parallelen. Vor allem zum ersten hat das Stelzein bisschen Parallelen. Es gibt natürlich keine Moos-Pfeile oder was? Was gab es inDark Blood Shack? Es gab so ganz komische Dinge. Moos-Pfeile. Aber was man da auch machenkonnte, sind Pfeile anzünden. Das geht hier auch. Man kann hier zum Beispiel in dem GamePfeil nehmen und quasi ins Feuer halten. Dann kann man einen Feuerfall schießen. Dashat es schon ganz cool gemacht. Stimmt, Wasserpfeile für die Fackeln. Genau, das gab es da. DarkBlood Shack gab es das auch noch. Dark Blood Shack spielen wir aber nicht. Das ist zu altbacken.Das sieht wirklich hässlich aus. Geht es hier nach oben oder nach unten? Ich würdesagen es geht nach unten, weil nach oben geht es... Hallo? Geht es nicht weiter? Kiste.Doch. Die Dinger, die Dinger können echt nichts. Kommt noch eine Schaufel. Kann man dem nächstenGoblet keine Schaufel an den Kopf schmeißen. Wo ist er? Nee, ist nix. Hopp. Hopp. Boah. What the fuck?WTF? Ok, dann schmeißen wir dem Viech jetzt die Schaufel gegen den Kopf. Oder auch nicht.Ok, was genau soll ich machen, Game? Hallo? Geh weg! Piss dich, Alde! Kann man den...Da kann ich Bashing vielleicht. Nein, ich glaube das geht nicht. Ich glaube wir musstenwegrennen. Ich erinnere mich dunkel, ich glaube wir mussten wegrennen. Ah, ja stimmt.Oh, oh, oh, oh. Ok. Ja, ist auch noch Gift, ist klar.Ok, nach der Welle gehen wir durch. Geschafft. Wobei es das mit garantiert noch nicht gewesenist. What the fuck? Was? Ich glaube, ich glaube ich soll abhauen.Ok, rennen. Rennen, rennen, rennen, rennen. Ah, ah, oder? Aha. Nein, hier gehts nichtweiterwegaurennrennrennrennrennwir können gleich den pilz schluckeneinfach gefunden habenok, kommen wir jetzt hier raus gescheitrennrennrennrennenuhh... POLENolunkueehaukueehein bisschen foodfood daGut dass wir das food aufgesammelt haben fuck hier ist ja gar nixOkay, wo geht's dann weiterAhaPhysik spielt reinOkayKletter, kletter, kletter, kletter, kletter, kletter, kletter, kletterwegWoh, MonkersIch glaube das Game möchte von uns, dass wir hier reinfallenDas war echt anstrengendObwohl man wahrscheinlich im Prinzip kaum, kaum die Chance hat überhaupt zu sterben war das gut inszeniertDa muss man jetzt mal sagensehr niceSind wir durch oder? Mehr gibt's ja nicht in dem Level. Mana Tränke brauchen wir nichtAuch wieder diese ViechergestrecktIst da irgendwo lang? Da oben ist noch so ein ViechAh wir können mal gucken ob wir da hoch können wenn wir hier einen Pfeil hinschießen. Das probieren wir gleich mal ausAber erst mal das Viech baschenKomm her, er hat keinen BockGuck mal wasIch würde sagen es hat uns ein wenig in die Wand geklitscht geradeDadurch dass das Pfeil, dass das Seil noch hin und her gesprungen istVielleicht klitscht es uns aber auch wieder aus der Wand rausSieht fast so ausRausklitschen aus, nice wir sind rausgeklitschtHier geht's nicht weiterSecretWas gibt's hier?RecktSpinnen auch recktSo was ist jetzt hier in der Secret Area? Wo gibt's hier jetzt was? Ah ein PilzPilze sind in dem Spiel sehr nice, füllt Mana und Leben komplett aufAllerdings Mana brauchen wir ja nichtÄh rausIch nehm lieber das Orkspann, das klitzert nicht so rumÄh kannste nichts machenOh sehr niceEr wird jetzt wieder von den Spodas geowntEr wird jetzt wieder von den Spodas geowntEr wird jetzt wieder von den Spodas geowntSpielst du noch BDO? Ne eigentlich nichtSpielst du noch BDO? Ne eigentlich nichtJetzt muss ich erstmal die ganzen Spodas wieder umhauenOh fuck sie, Anti-DoteAnti-DoteÜbrigens, ich hab auch einen geilen Rundum-AngriffÜbrigens, ich hab auch einen geilen Rundum-AngriffSoll ich mal gebenEr ging irgendwie duckenZack, also quasiSo was wie Spin Attack in ZeldaBloß dass es hier irgendwie bei den Spodas nicht funktioniertOk alles downKetteJa, da ist doch der WayDa Way ist hierDa Way ist hierSpinnenAlso wirklich in dem Game sind Spinnen echt massivSpinnen echt massivHallo, massiv ekligMassivMaster Thieves Outfit, das haben wir schonUnd das können wir nicht anziehen, weil wir haben keinen Stealth-SpankUnd das können wir nicht anziehen, weil wir haben keinen Stealth-SpankÄhOhAuAh, da, guck mal daGehst du weg?KackfischOh, noch mehrVielleicht können wir die erbogigenNA-AimNee, können wir nichtWir hauen die lieber so umAber der nächste, der kommt, den können wir bestimmt NA-AimMückeAhIst mir heute weniger vor der Nase gespawntKönnen nichtsNope, OpfersAls OpfersOh, guck mal, kann man hier hochklappenOh guck mal, kann man hier hochklettern?Nee.Sah so aus, ne?Nee, im Prinzip müssen wir hier hochklettern.Oder auch nicht, doch, doch, doch.So müssen wir klettern, ja.Ah, Spoda, hast du so viele Spinnen.Jaja, ja.Das war ein Sektiv von dem Goblin, irgendwie hört's nicht auf.Ja, er splittert ordentlich Spinnen, das haben wir verstanden.Au, Arm ab.Ring of Protection.Wizard Robe, haben wir schon.Brauchen wir nicht.Wir müssen mal Info ein bisschen leer machen.Können wir wegschmeißen.Chainmail können wir wegschmeißen.Und Plate Armor können wir auch wegschmeißen.Oh, Moment, das ist die die wir anhaben?Nein, dann können wir die natürlich nicht wegschmeißen.Hammer können wir wegschmeißen, wir müssten glaub ich nix mehr craften und wenn liegteh einer da.Assassin Stellzeug brauchen wir nicht.Wir haben ordentlich Rüstung.Sollen wir ein bisschen Inventar Platz machen.Ähm, was haben wir sonst noch?Axt.Die Axt brauchen wir eigentlich auch nicht.Nein, die Axt zackt.Dann nehm ich doch lieber den Haken, damit kann zweigs Leute umhauen und runter werfen.Oh, weiter gehts.Skill Points.Skill Points sind immer gut.Scrolls, die wir nicht brauchen.Was haben wir denn hier schönes?Noch mehr Spodas.Aber ne Kisse.Wow, wollen wir jetzt hier noch was?Ne, die macht bloß Geräusche, obwohl sie schon down ist.Was haben wir denn hier, Stonesge... nix gescheites.Wo gehts denn lang?Pilz, sehr nice.Ach hier.Hauptsache wir haben das Seil durchgehackt.Da klitschelt was, Steffs zackt in dem Game.Steffs sind die schlechtesten Waffen in dem ganzen Spiel.Rundelstells.Nope.Rekt.Bogen brauchen wir nicht.Können wir eh nicht, haben wir eh nicht gespeckt.Jetzt kommt bestimmt gleich der Wurm wieder.So Leute, ich muss mal kurz aufs Klo.Ich bin gleich wieder am Start.Machen wir ein bisschen Musik an.5 Minuten, bin ich wieder am Start.Bis gleich.So, bin schöner.Ich frag mich immer wieder, Fabian das schafft innerhalb von 25 Sekunden vom Klo wieder dazu sein.Wie das Lied heißt, ich kann dir sagen wie das Stream heißt.Das Stream heißt Chillstep 24 7 Livestream Gentle Ambient und Study Music und das istanscheinend der aktuelle Song.Ich hab keine Playlist, das ist einfach Livestream gewesen.Hey Max, gib dir mal das hier, zeig mal her.Hexglock.Oh, das ist nice.Das ist cool.Dann checkt keiner mehr die Uhrzeit.Fabian ist immer dem Rechner im Pinkelflasch.Von der Zeit her könnte man echt denken das wäre so.Ich weiß ja wie es bei ihm aussieht, bei ihm ist das Klo mehr oder weniger nebendran aberbei mir auch.Also der Abstand zwischen den Klos ist bei uns ungefähr gleich.Aber er schafft es irgendwie in 25 Sekunden bei sich zu gehen und ich halt nur in normalZeit.Oh, jetzt wird er gekickt.Schreckt.Massive schreckt.Banane.Was haben wir hier noch?Guck mal ein Ork.Oh, ich seh da was, ich seh da was.Achtung Leute.Bam.Oh, den hat's zerrissen.Den hat's zerrissen.Das finde ich halt an Source Games geil, dass die oftmals so Physik-Spielereien eingebauthaben.Das ist ja mal ganz nice.Sehr, sehr nice.Vielleicht können wir ja mal so abplexen und wieder was erstellen.Die Gegner sind gar nicht so blöd.Die sehen einen wirklich schnell.Du siehst mich nicht.Du siehst mich nicht.Du kannst mich nicht sehen, das ist ausgeschlossen, als du mich siehst.Sehr gut.Onni.Fuck, hier kommt man gar nicht hoch.Haha.Oh nee, der ist runtergesprungen.Fuck.Geht fliegst du da rein?Ich will...Du sollst in die Stacheln fliegen.Okay.Dann wird er halt gemessert.Er wird gemessert und er fliegt in die Stacheln, super.Mehr geht ja gar nicht.Oh nice.Lauf hier rein.Bam.Fuck.Oh, kommt der her.Reinlaufen, reinlaufen, reinlaufen.Jawoll.Haha.Direkt.Will der lebt noch?Jetzt nicht mehr.Ah, so nice.Oh, der Parrot ist immer noch aktiv.WTF.Siehst du, das ist das Problem, wenn ich selbst das Overlay nicht sehe.Komm her, Orc.Jetzt fackelt er ab.Wird fleißig Battlefield spielen am 9.11?9. 11 wahrscheinlich nicht, aber es könnte tatsächlich sein, dass ich mir mal für 15Euro Premium, Premiere oder wie das heißt, hohle Origin Access und mir danach das Spielnicht kaufe, wenn es mir nicht gefällt und Origin Access wieder abbestelle.So spart man sich dann nämlich 60 Euro.Auch wenn die A4 hat, einem das Geld damit irgendwie aus der Tasche zu ziehen, kann manes ja auch genau umgedreht benutzen.Man kann es quasi so als bezahlte, unlimitierte Demo verwenden für den Monat und danach einfachwieder kündigen, deinstallieren, wenn man keinen Bock hat.Im Endeffekt habe ich es ja mit Battlefield 1 äh, da ist kein Boden mehr, mit Battlefield1 ähnlich gemacht.Wonka ist.Wonka.Ich dachte eigentlich, das fällt vor mir runter.Ich schaue einfach nicht hin.Easy.Was haben wir da, den haben wir schon, Potions können wir immer gebrauchen.Nice.Hast du schon WF3 ausprobiert, ja, aber da war die Sauberdown und seitdem nicht mehr.Ich habe mir das noch vor, das Spiel scheint nicht schlecht zu sein, weil sich die Zahlenauf Steam ganz gut halten.Was immer dafür spricht, dass die Spiele ganz gut sind.Wo sich die Leute teilweise schon darüber aufregen, habe ich letzte Woche gesehen, dassdas mal wieder Entwickler sind, die halt absolut null anscheinend mit ihren Spielern kommunizieren.Das finde ich immer blöd.Man weiß nicht, ich denke mir immer, wenn man es schon Early Access macht.Also wir versetzen uns jetzt mal in die Lage von einem Spielehersteller und ich entscheidemich dazu Early Access zu machen, allerdings im gleichen Zeitraum zu sagen, ich höre nichtauf das Feedback, beziehungsweise ich kommuniziere nicht mit meinen Spielern, ich finde das istirgendwie kontraproduktiv, also sprich, wenn man Early Access macht und die Leute quasischon mehr oder weniger...", "segments": [{"id": 1, "start": 0.0, "end": 16.0, "text": "So, jetzt ist es besser, ne? Ja, jetzt ist es gut."}, {"id": 2, "start": 16.0, "end": 23.0, "text": "Haha, das war eine schnelle Runde, ja."}, {"id": 3, "start": 23.0, "end": 31.0, "text": "Qualitätsoptionen, ja. Das war wahrscheinlich ganz gut, dass ich das deswegen aus und wieder angemacht habe, weil das keine Absicht war."}, {"id": 4, "start": 31.0, "end": 38.0, "text": "Seht ihr das eigentlich?"}, {"id": 5, "start": 38.0, "end": 45.0, "text": "Ja, ne? Musste eigentlich eingeblendet werden."}, {"id": 6, "start": 45.0, "end": 53.0, "text": "Big Brain."}, {"id": 7, "start": 53.0, "end": 62.0, "text": "Ok, heute spielen wir nämlich den zweiten Teil fertig. Also, das Game gibt es ja nur einen Teil von, aber die zweite Hälfte des Spiels war heute fertig."}, {"id": 8, "start": 62.0, "end": 72.0, "text": "Und ich habe mir jetzt auch endlich hier wieder mein Memeboard-Briefview-Zeug eingebaut. Das heißt, ich brauche jetzt selbst keine Overlays mehr angucken und ich kann euch trotzdem Overlays anmachen."}, {"id": 9, "start": 72.0, "end": 84.0, "text": "Wir haben jetzt sogar extra Weep-Overlays am Start."}, {"id": 10, "start": 84.0, "end": 98.0, "text": "Guck mal, die Suche funktioniert auch, die wir gestern gebastelt haben. Richtig nice, oder?"}, {"id": 11, "start": 98.0, "end": 109.0, "text": "Jetzt muss ich nur noch das einblenden auf der zweiten Seite."}, {"id": 12, "start": 109.0, "end": 117.0, "text": "So, gut, auf geht's. Achso, vielleicht soll ich noch mal auf Twitter posten."}, {"id": 13, "start": 117.0, "end": 135.0, "text": "Ja, das weiter geht. Twitter-Beste."}, {"id": 14, "start": 135.0, "end": 149.0, "text": "Seht ihr die Emotes auch, wenn ich in-Game bin? Weil ich habe es mir jetzt so eingestellt, nachdem das Game nur schlecht als recht Fenstermodus unterstützt. Ich habe mir eingestellt, dass ihr das jetzt seht, allerdings ich nicht."}, {"id": 15, "start": 149.0, "end": 165.0, "text": "Also, wenn wir mal gucken, ob das funktioniert, wenn wir auf Fullscreen sind. Ich mache jetzt mal irgendwas auf. Irgendwie hier, was weiß ich. Exploding Brain. So, jetzt solltet ihr ja den Typ gesehen haben."}, {"id": 16, "start": 165.0, "end": 189.0, "text": "Oder der Gaben kann natürlich auch an Start. Das sollte man jetzt in OBS sehen und ich sollte das nicht sehen. Das ist eigentlich ganz praktisch. Dann fliegt man nämlich nicht aus dem Game raus. Das ist Pogos."}, {"id": 17, "start": 189.0, "end": 200.0, "text": "Massive ist das. Huge. Huge."}, {"id": 18, "start": 200.0, "end": 229.0, "text": "Richtig huge. Okay, nice. Funktioniert. Sehr schön. Achso, Lautstärke. Erstmal komische Musik aus. Ja, genau, wir müssen jetzt ja noch auf Twitter und geh du ins Posten. Lull."}, {"id": 19, "start": 229.0, "end": 247.0, "text": "Erstmal kleiner Lautstärketest. Weil das verstellt sich ja leider immer. Warum, weiß man nicht so genau. Lautstärkentest. Moment, Achtung."}, {"id": 20, "start": 247.0, "end": 261.0, "text": "Ich glaube, das ist ganz passend laut."}, {"id": 21, "start": 261.0, "end": 281.0, "text": "Oh, sollte passen. Gut, dann machen wir jetzt mal einen ordentlichen Twitter-Post. Dann geht's los. Kurz die Musik an."}, {"id": 22, "start": 281.0, "end": 295.0, "text": "Ich hab nämlich heute Morgen noch ein bisschen unser Tool hier erweitert. Mit Shortcuts, mit eigenen Browser Fenster für OBS. Also sprich, wie gesagt, ich kann jetzt Bildchen einblenden, die nur ihr seht und ich nicht."}, {"id": 23, "start": 295.0, "end": 320.0, "text": "Und zwar kann man das folgendermaßen machen. Man kann sich hier einen Preview-Tab aufmachen und den kann man dann in OBS als Browser Source einbinden. Das heißt, wenn man Games hat, die überhaupt nicht mit klarkommen, dass man Sachen overlayt und die Games aus dem Game wirft, dann kann man das einschalten."}, {"id": 24, "start": 320.0, "end": 342.0, "text": "Ich hoffe, ihr habt's verstanden. Was ich mein. Twitter-Post. Sollen wir auch YouTube-Post machen? Also kein Video-Upload, sondern diesen komischen Community-Post."}, {"id": 25, "start": 342.0, "end": 352.0, "text": "Moin, Chicken-Man. Hallo, Sharks-Development."}, {"id": 26, "start": 372.0, "end": 387.0, "text": "So, das war's für heute. Ich hoffe, ihr habt's verstanden."}, {"id": 27, "start": 387.0, "end": 402.0, "text": "Vielen Dank für's Zuschauen."}, {"id": 28, "start": 417.0, "end": 430.0, "text": "So, Twitter-Post ist raus."}, {"id": 29, "start": 430.0, "end": 433.0, "text": "Gut, Musik aus, auf geht's."}, {"id": 30, "start": 433.0, "end": 436.0, "text": "Genug gechillt, steppt."}, {"id": 31, "start": 436.0, "end": 453.0, "text": "Wenn ihr in Hessen, aus Hessen kommt, wartet ihr heute schon wählen. Also ich war heute Vormittag schon, also vor irgendwie zwei Stunden oder so."}, {"id": 32, "start": 453.0, "end": 458.0, "text": "Natürlich, aha."}, {"id": 33, "start": 458.0, "end": 467.0, "text": "Moin, xQni. Was ist zur Zeit ein Main-Game? Ja, wenn ich eins hätte, ne? Wenn ich eins hätte."}, {"id": 34, "start": 467.0, "end": 495.0, "text": "Also, ähm, zu wirklich gibt's ja keins aktuell."}, {"id": 35, "start": 495.0, "end": 505.0, "text": "Also, wo sind wir denn das letzte Mal stehen geblieben? Für alle, die nicht dabei waren, ähm, ist schwierig."}, {"id": 36, "start": 505.0, "end": 513.0, "text": "Die Musik ist doch einen Ticken laut, oder? Die hinter, auch, das hört man schon, der Hintergrund, das ist dann, ne, jetzt mal."}, {"id": 37, "start": 513.0, "end": 517.0, "text": "Jetzt crasht das Game bestimmt beim Maximieren."}, {"id": 38, "start": 517.0, "end": 532.0, "text": "Ne. Ja, wo sind wir das letzte Mal stehen geblieben? Ähm, wir haben, wir haben mit dem Wizard Grill zusammen einen Drache besiegt."}, {"id": 39, "start": 532.0, "end": 538.0, "text": "Und das Wizard Grill wurde vom bösen Necromancer gekillt."}, {"id": 40, "start": 538.0, "end": 558.0, "text": "Und jetzt sind wir mit dem Dämonenkrill in unserem Kopf unterwegs, irgendwelche geheimen Gems zu sammeln, mit denen wir dann irgendwas tun können, was auch immer."}, {"id": 41, "start": 558.0, "end": 563.0, "text": "Wir müssen letztendlich die Welt retten. Wobei, man muss dazu sagen, ganz so einfach ist es in dem Game gar nicht."}, {"id": 42, "start": 563.0, "end": 569.0, "text": "Also, bezüglich Welt retten, ja. Das hat jetzt keine super tiefgreifende Story, aber ist gar nicht mal so übel."}, {"id": 43, "start": 569.0, "end": 572.0, "text": "Und es hat das beste Kampfsystem von allen Gems."}, {"id": 44, "start": 572.0, "end": 578.0, "text": "So, weiter geht's. Pogu hab ich nicht aktiviert. Pogu gibt's nicht."}, {"id": 45, "start": 578.0, "end": 589.0, "text": "Ich sollte mal auf meinem zweiten Bildschirm den Chat und mein Memeboard vertauschen. Das wär, glaub ich, viel, viel sinnvoller."}, {"id": 46, "start": 589.0, "end": 595.0, "text": "Ups, ich hab den Chat zugemacht."}, {"id": 47, "start": 595.0, "end": 603.0, "text": "Ich vertausch das mal, dann seh ich nämlich den Chat besser."}, {"id": 48, "start": 603.0, "end": 618.0, "text": "Oder, vielleicht schieb ich's doch lieber andersrum."}, {"id": 49, "start": 618.0, "end": 623.0, "text": "Ah, ich schieb's doch andersrum. Perfekt."}, {"id": 50, "start": 623.0, "end": 634.0, "text": "Okay, weiter geht's. Also, wir brauchen jetzt noch ein Gem und dann können wir Dinger tun. Und letztendlich müssen wir ein paar Gegner hauen."}, {"id": 51, "start": 634.0, "end": 642.0, "text": "Oh, der hat sich selbst aufgespießt. Das war natürlich ein Big Brain Play vom Gegner."}, {"id": 52, "start": 642.0, "end": 654.0, "text": "Äh, wo ist der Gegner hin? Alter!"}, {"id": 53, "start": 654.0, "end": 659.0, "text": "Oh, so viele Geister ist am Start."}, {"id": 54, "start": 659.0, "end": 666.0, "text": "Direkt. Direkt."}, {"id": 55, "start": 666.0, "end": 670.0, "text": "Kicksorn."}, {"id": 56, "start": 670.0, "end": 677.0, "text": "Noch mehr. Ähm, schreibt mir mal bitte, ob die Lautstärke passt. Ich hab da immer Probleme mit."}, {"id": 57, "start": 677.0, "end": 679.0, "text": "Oh, oh, Bein ab."}, {"id": 58, "start": 679.0, "end": 682.0, "text": "Oder ob wir noch einen Ticken lauter machen sollen."}, {"id": 59, "start": 682.0, "end": 687.0, "text": "Ich kann das immer schlecht einschätzen. Das ist oft mal so, wenn's für mich übelst laut ist, ist es für euch zu leise und sowas."}, {"id": 60, "start": 687.0, "end": 691.0, "text": "Das kann man immer schwer einschätzen."}, {"id": 61, "start": 691.0, "end": 700.0, "text": "Elder Scrolls 6 Alpha. Ja, das Kampfsystem kann jedes Skyrim einpacken mit."}, {"id": 62, "start": 700.0, "end": 708.0, "text": "Das ist so das beste interaktive Mehlekampfsystem, was ich je in dem Game gesehen hab."}, {"id": 63, "start": 708.0, "end": 714.0, "text": "Lautstärke passt. Mikro in dem Sound gut gemischt. Ja, das ist schön."}, {"id": 64, "start": 714.0, "end": 721.0, "text": "Wenn ich das richtige Erinnerung hab, kommt jetzt gleich der große Story-Twist."}, {"id": 65, "start": 721.0, "end": 725.0, "text": "Wenn ich das noch richtig weiß."}, {"id": 66, "start": 725.0, "end": 728.0, "text": "Das letzte Mal hab ich's ja gespielt vor gerne 10 Jahren oder so."}, {"id": 67, "start": 728.0, "end": 730.0, "text": "Moment, wo müssen wir hin? Irgendwo da rüber, würde ich sagen."}, {"id": 68, "start": 730.0, "end": 737.0, "text": "Rüber müssen wir stellen."}, {"id": 69, "start": 737.0, "end": 745.0, "text": "Und ich hab mir das jetzt so gemacht, dass ich eine zweite Maus am zweiten Rechner hab. Das heißt, ich kann jetzt zweiten Rechner Infantry-Emotes einplatten."}, {"id": 70, "start": 745.0, "end": 748.0, "text": "Das ist sehr praktisch."}, {"id": 71, "start": 748.0, "end": 752.0, "text": "Oh, was haben wir da? Kettenrüstung. Kettenrüstung haben wir schon, ne?"}, {"id": 72, "start": 752.0, "end": 756.0, "text": "Wir haben sogar, haben wir nicht sogar noch was besseres schon?"}, {"id": 73, "start": 756.0, "end": 764.0, "text": "Plate Armor haben wir. Plate Armor plus zwei, äh, plus drei. Tja."}, {"id": 74, "start": 764.0, "end": 767.0, "text": "Wir basteln jetzt noch ein paar Gegner und dann überlegen wir uns, was wir mal upgraden können."}, {"id": 75, "start": 767.0, "end": 774.0, "text": "Entweder machen wir mehr Rüstung oder wir upgraden die Stärke."}, {"id": 76, "start": 774.0, "end": 794.0, "text": "Aber ich glaube, wir upgraden die Stärke, dann können wir unser Life-Leech, unser Life-Leech-Schwert verwenden."}, {"id": 77, "start": 794.0, "end": 799.0, "text": "Oh, der fängt ja auch von sich an zu schreien."}, {"id": 78, "start": 799.0, "end": 801.0, "text": "Au!"}, {"id": 79, "start": 801.0, "end": 803.0, "text": "What the fuck?"}, {"id": 80, "start": 803.0, "end": 816.0, "text": "Was ist hier los?"}, {"id": 81, "start": 816.0, "end": 832.0, "text": "Hauptsache, den besten Klettern, oh, der ist ja der, was du magst leider, der beste Kletterer hier, ne?"}, {"id": 82, "start": 832.0, "end": 834.0, "text": "Hier können wir noch."}, {"id": 83, "start": 834.0, "end": 836.0, "text": "Kommen wir hier rauf?"}, {"id": 84, "start": 836.0, "end": 838.0, "text": "Ähm, mal gucken."}, {"id": 85, "start": 838.0, "end": 841.0, "text": "Oh, WTF."}, {"id": 86, "start": 841.0, "end": 846.0, "text": "War nicht mal Singleplayer-Spiele funktionierender."}, {"id": 87, "start": 846.0, "end": 851.0, "text": "Weiß gar nicht, ob die Kette reicht oder ob wir nochmal selbst ein paar Pfeile hochschießen müssen."}, {"id": 88, "start": 851.0, "end": 855.0, "text": "Mal schauen."}, {"id": 89, "start": 855.0, "end": 859.0, "text": "Ah, das sollte reichen. Wir müssen irgendwo darüber hüpfen."}, {"id": 90, "start": 859.0, "end": 863.0, "text": "Was für ein Game war im ersten Schirm nicht dabei? Das ist Dark Messiah of Might and Magic."}, {"id": 91, "start": 863.0, "end": 869.0, "text": "Das ist, äh, muss ich mal kurz was zu zeigen, mach ich grad mal auf, weil die Frage kommt wahrscheinlich öfters."}, {"id": 92, "start": 869.0, "end": 874.0, "text": "Das ist ein Game von, ich glaub, 2006? 2006?"}, {"id": 93, "start": 874.0, "end": 876.0, "text": "Ähm, auf der Source-Engine."}, {"id": 94, "start": 876.0, "end": 880.0, "text": "Ähm, auf der, auf der, auf der Half-Life 2-Version von der Source-Engine."}, {"id": 95, "start": 880.0, "end": 888.0, "text": "Und dementsprechend hat es relativ viel Physik-Schlickstack auch dabei."}, {"id": 96, "start": 888.0, "end": 892.0, "text": "Aber bei dem Kampfsystem kann er halt auch Skyrim einpacken."}, {"id": 97, "start": 892.0, "end": 895.0, "text": "Das ist das einzige Game seiner Art, was ich kenne und ich..."}, {"id": 98, "start": 895.0, "end": 897.0, "text": "Oh, oh, oh, Max, Max..."}, {"id": 99, "start": 897.0, "end": 898.0, "text": "Was?"}, {"id": 100, "start": 898.0, "end": 900.0, "text": "Hallo? Ich bin auf der Brücke gelandet."}, {"id": 101, "start": 900.0, "end": 907.0, "text": "What the fuck? Game hat mich massiv gebated gerade."}, {"id": 102, "start": 907.0, "end": 909.0, "text": "Ähm, soll ich grad sagen, ja."}, {"id": 103, "start": 909.0, "end": 916.0, "text": "Also bei dem Kampfsystem kann im Prinzip eigentlich jedes Game einpacken, was ich kenne, was versucht irgendwie Nahkampf-Sachen zu simulieren."}, {"id": 104, "start": 916.0, "end": 919.0, "text": "Das kann das Game wirklich, das ist einfach das Beste."}, {"id": 105, "start": 919.0, "end": 921.0, "text": "Ich kann es auch gleich nochmal kurz zeigen."}, {"id": 106, "start": 921.0, "end": 923.0, "text": "Ja, und wie man halt sieht, das ist halt Half-Life 2."}, {"id": 107, "start": 923.0, "end": 927.0, "text": "Beziehungsweise die Source-Engine vom Stand eines Half-Life 2."}, {"id": 108, "start": 927.0, "end": 930.0, "text": "Und dementsprechend sind da halt jede Menge Physik-Schlickstack drinnen."}, {"id": 109, "start": 930.0, "end": 943.0, "text": "Ja, so zum Beispiel, wie hier irgendwelche Seile hinschießen, dass man dann rüberspringen kann und sowas."}, {"id": 110, "start": 943.0, "end": 945.0, "text": "Ich hab gedacht, er ist durchgefallen."}, {"id": 111, "start": 945.0, "end": 947.0, "text": "Steckt der in der Wand?"}, {"id": 112, "start": 947.0, "end": 949.0, "text": "Lull."}, {"id": 113, "start": 949.0, "end": 952.0, "text": "War jetzt hier noch irgendwas, was ich sammeln könnte?"}, {"id": 114, "start": 952.0, "end": 956.0, "text": "Was denn da?"}, {"id": 115, "start": 956.0, "end": 959.0, "text": "Was denn da?"}, {"id": 116, "start": 959.0, "end": 963.0, "text": "Sollen wir da nochmal reingucken?"}, {"id": 117, "start": 963.0, "end": 964.0, "text": "Oh, ich weiß nicht."}, {"id": 118, "start": 964.0, "end": 965.0, "text": "Na, komm."}, {"id": 119, "start": 965.0, "end": 966.0, "text": "Scheiß drauf."}, {"id": 120, "start": 966.0, "end": 969.0, "text": "Wir speichern jetzt mal und dann machen wir..."}, {"id": 121, "start": 969.0, "end": 971.0, "text": "und skamasen wir das Save-Game."}, {"id": 122, "start": 971.0, "end": 974.0, "text": "Wir gucken da jetzt rein und wenn da nichts ist, loanen wir einfach."}, {"id": 123, "start": 974.0, "end": 977.0, "text": "Da müssen wir nicht nochmal hochklappern."}, {"id": 124, "start": 977.0, "end": 980.0, "text": "Eats."}, {"id": 125, "start": 980.0, "end": 983.0, "text": "Aber es sieht schon so aus, als soll man hier lang."}, {"id": 126, "start": 983.0, "end": 985.0, "text": "Oder vielleicht ist hier irgendwas Geheimes versteckt."}, {"id": 127, "start": 985.0, "end": 986.0, "text": "Mal gucken."}, {"id": 128, "start": 986.0, "end": 992.0, "text": "Das Game ist ja voll von irgendwelchen Secret Areas und Secret Zauberdinger, die man ver..."}, {"id": 129, "start": 992.0, "end": 993.0, "text": "Nee."}, {"id": 130, "start": 993.0, "end": 994.0, "text": "Okay, wir loanen."}, {"id": 131, "start": 994.0, "end": 995.0, "text": "Hier war was schon."}, {"id": 132, "start": 995.0, "end": 997.0, "text": "Wirst du Red Dead Redemption 2 spielen?"}, {"id": 133, "start": 997.0, "end": 998.0, "text": "Nee."}, {"id": 134, "start": 998.0, "end": 1001.0, "text": "Wie ich das letzte Mal schon gesagt hab, vielleicht hol ich's mir irgendwann nochmal."}, {"id": 135, "start": 1001.0, "end": 1005.0, "text": "Ich bin einfach kein Open-World-Typ."}, {"id": 136, "start": 1005.0, "end": 1012.0, "text": "Ich bin wahrscheinlich der Einzige, der sich das Game nicht gekauft hat."}, {"id": 137, "start": 1012.0, "end": 1014.0, "text": "So, haben wir jetzt eigentlich alles?"}, {"id": 138, "start": 1014.0, "end": 1015.0, "text": "Ja, okay, haben wir."}, {"id": 139, "start": 1015.0, "end": 1019.0, "text": "Gut, dann sind wir nämlich, glaub ich, mit dem Part vom Game durch."}, {"id": 140, "start": 1019.0, "end": 1022.0, "text": "Jetzt kommt der große Story-Twist."}, {"id": 141, "start": 1022.0, "end": 1026.0, "text": "Ich glaub, was war hier?"}, {"id": 142, "start": 1026.0, "end": 1031.0, "text": "Weil aktuell denken wir ja noch, dass wir die Welt retten müssen, so wie in jedem Fantasy-Spiel."}, {"id": 143, "start": 1056.0, "end": 1058.0, "text": "Ich hab alle Gems einsetzen."}, {"id": 144, "start": 1058.0, "end": 1085.0, "text": "Ja, manchmal ist es gut, wenn man viele Emauts hat."}, {"id": 145, "start": 1085.0, "end": 1111.0, "text": "Jetzt müssen wir natürlich warten, bis das hochgekommen ist, weil wir sonst erquetscht"}, {"id": 146, "start": 1111.0, "end": 1123.0, "text": "werden, weil Half-Life 2 Physik."}, {"id": 147, "start": 1123.0, "end": 1136.0, "text": "Ja, jetzt kommt ein sinnloser Spider-Fight."}, {"id": 148, "start": 1136.0, "end": 1140.0, "text": "Das heißt, für alle, die neu sind, kann ich das Kampfsystem erzeigen und warum ich denke,"}, {"id": 149, "start": 1140.0, "end": 1142.0, "text": "das beste Knack-Halb-Kampf-System ist, was es gibt."}, {"id": 150, "start": 1142.0, "end": 1145.0, "text": "Also, erstens war davon abgesehen, dass es zig verschiedene Waffen gibt."}, {"id": 151, "start": 1145.0, "end": 1151.0, "text": "Also, von Daggers zu Zweihandschwertern, zu Schwert mit Schild und sonst was."}, {"id": 152, "start": 1151.0, "end": 1157.0, "text": "Man hat zig special moves, sprich, wenn man links liegt, auflädt, rechts auflädt, rückwärts,"}, {"id": 153, "start": 1157.0, "end": 1164.0, "text": "sonst was, Jump-Attack, rennen, mit Zweihandschwert rennen und dann halt noch eine stärkere"}, {"id": 154, "start": 1164.0, "end": 1169.0, "text": "Attacke machen und solche Dinger, ich versuch's mal zu zeigen."}, {"id": 155, "start": 1169.0, "end": 1171.0, "text": "So was hier kann man auch machen."}, {"id": 156, "start": 1171.0, "end": 1173.0, "text": "Jetzt bin ich vergiftet."}, {"id": 157, "start": 1173.0, "end": 1177.0, "text": "Auf sieben ist man gegen Giftpreis."}, {"id": 158, "start": 1177.0, "end": 1183.0, "text": "Dazu gibt es natürlich noch Bogenstells, den ich nicht gespeckt habe."}, {"id": 159, "start": 1183.0, "end": 1189.0, "text": "Es gibt Schwert und Schild, Schwert und Haken, Schild und Haken."}, {"id": 160, "start": 1189.0, "end": 1194.0, "text": "Also, es gibt zig Waffen und alles sind irgendwie im Handling anders und fühlen sich nicht"}, {"id": 161, "start": 1194.0, "end": 1197.0, "text": "geil an, was das Dark-Halb-System anbelangt."}, {"id": 162, "start": 1197.0, "end": 1202.0, "text": "Ab und zu kriegt man dann mal special attacks."}, {"id": 163, "start": 1209.0, "end": 1214.0, "text": "Und man kann halt die Gegner in der Regel immer mit irgendwelchen Physikgeschichten"}, {"id": 164, "start": 1214.0, "end": 1218.0, "text": "killen, weil es halt Source-Engine ist."}, {"id": 165, "start": 1218.0, "end": 1222.0, "text": "Oh, hier ist noch was."}, {"id": 166, "start": 1226.0, "end": 1229.0, "text": "Nehmen wir mal ne Potion."}, {"id": 167, "start": 1233.0, "end": 1234.0, "text": "Wer ist das Game?"}, {"id": 168, "start": 1234.0, "end": 1237.0, "text": "Dark Messiah of Might and Magic."}, {"id": 169, "start": 1240.0, "end": 1243.0, "text": "Sollen wir mal gucken, ob hier noch irgendwas versteckt ist?"}, {"id": 170, "start": 1243.0, "end": 1249.0, "text": "Wo ist die Potion genau hingeflogen jetzt?"}, {"id": 171, "start": 1249.0, "end": 1254.0, "text": "Irgendeine Potion ist hier hinter geklitscht."}, {"id": 172, "start": 1254.0, "end": 1257.0, "text": "Okay, hier gibt es nix."}, {"id": 173, "start": 1257.0, "end": 1259.0, "text": "Hier gibt es noch mal was."}, {"id": 174, "start": 1259.0, "end": 1264.0, "text": "Gegen Gift Potion."}, {"id": 175, "start": 1264.0, "end": 1267.0, "text": "Hier gibt es noch mal was."}, {"id": 176, "start": 1267.0, "end": 1273.0, "text": "Gegen Gift Potion."}, {"id": 177, "start": 1273.0, "end": 1278.0, "text": "Ja, es gibt nen Skilltree, was man im Prinzip specken kann, eigentlich was man will."}, {"id": 178, "start": 1278.0, "end": 1280.0, "text": "Und das ist dann eigentlich auch ganz cool gemacht."}, {"id": 179, "start": 1280.0, "end": 1284.0, "text": "Man kann sogar komplett auf Stealth spielen, wenn man will."}, {"id": 180, "start": 1284.0, "end": 1285.0, "text": "Mit Dolchen."}, {"id": 181, "start": 1285.0, "end": 1291.0, "text": "Man kann auf Magic spielen mit Feuerball und Zeugs rumkicken und sowas in der Richtung."}, {"id": 182, "start": 1291.0, "end": 1293.0, "text": "Aber wir spielen relativ klassisch gerade."}, {"id": 183, "start": 1293.0, "end": 1297.0, "text": "Zwei-Hand-Org-Schwert und in your face und drauf."}, {"id": 184, "start": 1297.0, "end": 1302.0, "text": "Aber das ist sehr vielfältig und es ist eines der Spiele mit dem höchsten Replay-Faktor im Endeffekt."}, {"id": 185, "start": 1302.0, "end": 1307.0, "text": "Die Kampagne ist kurz so knackig, so irgendwie sieben, acht Stunden, würde ich sagen."}, {"id": 186, "start": 1307.0, "end": 1312.0, "text": "Und das ganze System ist halt richtig nice."}, {"id": 187, "start": 1312.0, "end": 1317.0, "text": "Vor allem, weil man so ein Org-Schwert auch einfach mal so kurz mit zwei Fingern dreht."}, {"id": 188, "start": 1317.0, "end": 1320.0, "text": "So weißt du, so ein riesen, irgendwie vier, fünf Kilo schweres Ding."}, {"id": 189, "start": 1320.0, "end": 1321.0, "text": "Mit den Fingern."}, {"id": 190, "start": 1321.0, "end": 1323.0, "text": "Okay, jetzt muss ich ruhig sein."}, {"id": 191, "start": 1328.0, "end": 1330.0, "text": "Moment, ich bin auf der falschen Seite."}, {"id": 192, "start": 1335.0, "end": 1343.0, "text": "Nach diesem komischen Skull of Shadow waren wir ja quasi die kompletten letzten Streams auf der Suche."}, {"id": 193, "start": 1343.0, "end": 1351.0, "text": "Und jetzt haben wir es gefunden. Jetzt kommt Story."}, {"id": 194, "start": 1355.0, "end": 1358.0, "text": "Ach ja, wir sollen unseren Vater befreien, ne?"}, {"id": 195, "start": 1358.0, "end": 1373.0, "text": "Das ist ja der Oberdemon Lord."}, {"id": 196, "start": 1388.0, "end": 1391.0, "text": "We waiting for our vengeance."}, {"id": 197, "start": 1391.0, "end": 1395.0, "text": "We have waited for you."}, {"id": 198, "start": 1395.0, "end": 1399.0, "text": "You are the one foretold by the wizard Sar-Shazar,"}, {"id": 199, "start": 1399.0, "end": 1404.0, "text": "the dark messiah of ancient prophecy."}, {"id": 200, "start": 1404.0, "end": 1408.0, "text": "You are my sun and my air,"}, {"id": 201, "start": 1408.0, "end": 1413.0, "text": "the herald of fire and of blood."}, {"id": 202, "start": 1413.0, "end": 1416.0, "text": "The creature that accompanies you is yours."}, {"id": 203, "start": 1416.0, "end": 1419.0, "text": "Nimm sie an, sobald du siehst, dass sie fit sind."}, {"id": 204, "start": 1420.0, "end": 1426.0, "text": "Jetzt nimm die Kugel meines älteren Gegens und schüttere das Gefängnis, das mich hält."}, {"id": 205, "start": 1427.0, "end": 1430.0, "text": "Dies, mein Sohn, ich bestreite dich."}, {"id": 206, "start": 1430.0, "end": 1441.0, "text": "Ich bin frei. Dieser Welt und jede Waffe in ihm wird ich sein."}, {"id": 207, "start": 1441.0, "end": 1458.0, "text": "The Skull of Shadows ist nicht für die Likes von mir, Demonspawn."}, {"id": 208, "start": 1458.0, "end": 1470.0, "text": "Der 7. Drache hat sich nicht selbst zerstört, sodass ein Demonspaar alle seine Arbeit verbreiten kann."}, {"id": 209, "start": 1471.0, "end": 1475.0, "text": "Ich mache das für den Zweck aller Ashland."}, {"id": 210, "start": 1475.0, "end": 1485.0, "text": "Die Propheze des dunklen Messias endet hier."}, {"id": 211, "start": 1506.0, "end": 1509.0, "text": "Was ist passiert?"}, {"id": 212, "start": 1510.0, "end": 1515.0, "text": "Arentir hat dich getötet. Ich habe die Energie des Skulls verwendet, um dich zu reviven."}, {"id": 213, "start": 1516.0, "end": 1518.0, "text": "Ich fühle mich... anders."}, {"id": 214, "start": 1519.0, "end": 1524.0, "text": "Nicht überraschend. Wir sind noch näher gegründet, und einige meiner Gründe sind deine."}, {"id": 215, "start": 1525.0, "end": 1526.0, "text": "Wo ist Arentir?"}, {"id": 216, "start": 1527.0, "end": 1530.0, "text": "Er ist weg mit dem Skull. Wir müssen schnell ihn stoppen."}, {"id": 217, "start": 1531.0, "end": 1533.0, "text": "Stoppen? Ich werde ihn töten."}, {"id": 218, "start": 1533.0, "end": 1537.0, "text": "Die Orks haben all deine Ausrüstung genommen. Sie dachten, dass du tot bist."}, {"id": 219, "start": 1537.0, "end": 1562.0, "text": "Zeig ihnen, dass sie einen kleinen Fehler gemacht haben."}, {"id": 220, "start": 1567.0, "end": 1570.0, "text": "Erich Gr Hannah."}, {"id": 221, "start": 1571.0, "end": 1576.0, "text": "Erich Gr Hannahæ"}, {"id": 222, "start": 1576.0, "end": 1581.76, "text": "noch mal zu unterstreichen, haben wir jetzt dadurch, dass jetzt Xana, also das ist die,"}, {"id": 223, "start": 1581.76, "end": 1584.84, "text": "die da im Hintergrund immer spricht, halt die, die auch gerade in der Zwischensequenz"}, {"id": 224, "start": 1584.84, "end": 1592.16, "text": "rumgerannt ist, also das, das Demon Grill. Oh, Big Brain. Deswegen, um das jetzt noch"}, {"id": 225, "start": 1592.16, "end": 1596.16, "text": "mal zu unterstreichen, haben wir jetzt auch unsere Demon Form am Start und können damit"}, {"id": 226, "start": 1596.16, "end": 1601.56, "text": "Orcs bashen und alles. Das hatten wir vorher nicht, weil vorher haben wir ja noch gedacht,"}, {"id": 227, "start": 1601.56, "end": 1608.56, "text": "wir sind der Gute, aber wir sind gar nicht der Gute."}, {"id": 228, "start": 1631.56, "end": 1643.48, "text": "Okay, wir haben leider kein Inventar und wir können auch nicht auf den Skilltree zugreifen,"}, {"id": 229, "start": 1643.48, "end": 1648.36, "text": "wir müssen jetzt erstmal unsere Ausrüstung suchen. Meine andere Frage Boxen oder Headset?"}, {"id": 230, "start": 1648.36, "end": 1658.8, "text": "Kopfhörer und Mikro. Oh, Orc stellt's. Psst. Wir haben keine Rüstung und nichts Gescheites,"}, {"id": 231, "start": 1658.8, "end": 1670.28, "text": "wir müssen jetzt ein bisschen vorsichtiger sein. Oh, fuck, der hat mich gesehen. Warum?"}, {"id": 232, "start": 1670.28, "end": 1675.64, "text": "Warum hat der... Aber ich hab ja, ich hab ja ein Schild aufgehoben. Komm mal her, Orc."}, {"id": 233, "start": 1675.64, "end": 1695.0, "text": "Erschreckt. Ausgeorgt. Ich muss mal kurz gucken, ob der Orc irgendwas dabei hat, was ich brauche."}, {"id": 234, "start": 1695.0, "end": 1705.68, "text": "Nee, sieht nicht so aus. Gehen wir wieder hoch. Ja, ich hoffe, ich hab die Story jetzt"}, {"id": 235, "start": 1705.68, "end": 1711.52, "text": "in soweit ganz gut zusammengefasst, dass man das jetzt kapiert hat. Aber nichtsdestotrotz,"}, {"id": 236, "start": 1711.52, "end": 1715.72, "text": "wir können immer noch, was wir nicht machen werden, es sei denn ihr wollt das unbedingt,"}, {"id": 237, "start": 1715.72, "end": 1720.88, "text": "ja, wir können immer noch den Guten spielen in dem Game. Ihr könnt euch ja schon mal"}, {"id": 238, "start": 1720.88, "end": 1727.28, "text": "überlegen, so ungefähr in zwei Stunden müssen wir uns entscheiden, was wir, was wir machen,"}, {"id": 239, "start": 1727.28, "end": 1734.6, "text": "ob wir gut oder böse sind. Könnt ihr euch ja schon mal überlegen. Und die Entscheidung"}, {"id": 240, "start": 1734.6, "end": 1751.2, "text": "ist relativ weitreichend, ja. Oh, Spinnen. Und das ist auch das Spiel, was ich kenne,"}, {"id": 241, "start": 1751.2, "end": 1754.08, "text": "was Spinnen am besten hingekriegt hat. Ich kenne keinen Game, wo Spinnen ekliger sind."}, {"id": 242, "start": 1754.08, "end": 1772.24, "text": "Spodas. Oh, ich hab keinen Schlüssel. Geht nicht auf. Lull. Oh, hier ist mein Zeug."}, {"id": 243, "start": 1772.24, "end": 1800.68, "text": "Oh, jetzt haben wir unsere Ausrüstung wieder. Soll ich den Schlüssel haben, um das aufmachen"}, {"id": 244, "start": 1800.68, "end": 1822.24, "text": "zu können? Äh, Moment. Man kann da drüberspringen? Ob das so gedacht ist von dem Game? Ob das"}, {"id": 245, "start": 1822.24, "end": 1829.6, "text": "jetzt gerade, ob das so gedacht war, dass ich hier einfach drüber hüpfen kann? Es sieht"}, {"id": 246, "start": 1829.6, "end": 1840.2, "text": "jetzt nämlich nicht so aus, als wäre das so gedacht. Ich bin mir da nicht so sicher."}, {"id": 247, "start": 1840.2, "end": 1844.92, "text": "Wahrscheinlich haben jetzt irgendeinen Teil geskippt oder so. Aber gut, ich mein, wir"}, {"id": 248, "start": 1844.92, "end": 1851.76, "text": "sind hier einmal im Kreis, glaube ich. Hier ist ja eigentlich sonst nix mehr. Aber ich"}, {"id": 249, "start": 1851.76, "end": 1856.6, "text": "glaube nicht, dass das so gedacht ist, dass man hier durchgeht. Ah, erster Glitch für"}, {"id": 250, "start": 1856.6, "end": 1860.64, "text": "die Spieler. Du musst dir das Game als Speedrun angucken. Im Prinzip wird das halbe Game"}, {"id": 251, "start": 1860.64, "end": 1872.52, "text": "gar nicht gespielt. Also ist das ja Speedrun-mäßig. Bei vielen Games. Natürlich, weil Source Engine"}, {"id": 252, "start": 1872.52, "end": 1878.36, "text": "ist, kannst du auch jede Menge Zeug im Endeffekt rumwerfen, Physik-Zeugs kaputt machen. Oh,"}, {"id": 253, "start": 1878.36, "end": 1891.88, "text": "die stelzen wir jetzt. Die stelzen wir jetzt. Die konnten wir nicht stelzen. Da sieht man,"}, {"id": 254, "start": 1891.88, "end": 1896.16, "text": "was ich vorhin gesagt habe, es gibt relativ viele verschiedene Waffen. Alle vom Handling"}, {"id": 255, "start": 1896.16, "end": 1908.56, "text": "her ein bisschen anders. Und die Gegner sind gar nicht mal so doof. Alter, ich will, dass"}, {"id": 256, "start": 1908.56, "end": 1916.6, "text": "du da runterfliegst. Wenn du da runterfliegst, kann man so machen. Oder auch nicht. Oder"}, {"id": 257, "start": 1916.6, "end": 1926.96, "text": "auch nicht. Oh, nice. Wir können schmieden. Schmiede-Action können wir machen. Craft-Wars."}, {"id": 258, "start": 1926.96, "end": 1933.6, "text": "Das da kommt rein. Das gibt ja ziemlich richtig gutes Schwert. Hier muss man auch von Hand"}, {"id": 259, "start": 1933.6, "end": 1950.8, "text": "craften. Geht nix mit Crafting-Menü. Hier muss man von Hand craften. Ein nicees Schwert"}, {"id": 260, "start": 1950.8, "end": 1957.72, "text": "kommt da jetzt raus. Blade. Amboss. Und wir haben noch irgendwo ja, wir haben da ein Hammer."}, {"id": 261, "start": 1957.72, "end": 1968.24, "text": "Ha, falsch. Erstmal Schwert in Schmiede rein. Schwert heiß machen. Medieval-Schmiedesimulator."}, {"id": 262, "start": 1968.24, "end": 1988.6, "text": "My little Plexmith. Oder irgendwie sowas gibt es bestimmt schon als Game. So, und jetzt"}, {"id": 263, "start": 1988.6, "end": 1992.48, "text": "müssen wir hier irgendwie noch nen Griff machen. Und dann haben wir richtig geile Schwert."}, {"id": 264, "start": 1992.48, "end": 2002.12, "text": "Beste, ich glaube mit eines der besten Schwerte in dem Game. Flammenschwert. Ein sehr, sehr"}, {"id": 265, "start": 2002.12, "end": 2012.72, "text": "nicees Teil. Wobei ich sagen muss, ich persönlich finde das andere... Oh, oh, geht das kaputt"}, {"id": 266, "start": 2012.72, "end": 2020.56, "text": "mit der Zeit? Ah, man kann das nur ne gewisse Zeit in der Hand halten, ne? Oder gehts dann"}, {"id": 267, "start": 2020.56, "end": 2026.72, "text": "wieder kaputt? Man kann das wahrscheinlich nur ne gewisse Zeit in der Hand halten. Ok,"}, {"id": 268, "start": 2026.72, "end": 2030.16, "text": "das haben sie gemacht, weil es sonst zu OP wäre. Das finde ich eigentlich am besten,"}, {"id": 269, "start": 2030.16, "end": 2034.68, "text": "das ist ein Schwert mit Life Leech. Dazu müssen wir aber Stärke 3 specken, aber das können"}, {"id": 270, "start": 2034.68, "end": 2043.04, "text": "wir ruhig mal machen. Wir haben eh genug Skill Points. Und Mana Potions machen wir mal"}, {"id": 271, "start": 2043.04, "end": 2059.92, "text": "weg. Ein nicees Schwert. Anderes Schild kommt weg, brauchen wir nicht mehr. So, können wir"}, {"id": 272, "start": 2059.92, "end": 2065.88, "text": "noch Endos specken? Oh nice. Wir könnten auch noch specken, dass wir die neue Rüstung"}, {"id": 273, "start": 2065.88, "end": 2070.56, "text": "anziehen können. Sehr schön. Life Leech Waffe und Plate Armor. Da kann jetzt im Prinzip"}, {"id": 274, "start": 2070.56, "end": 2083.04, "text": "nix mehr schief gehen. Gebashed, werden sie. Oh, den einen hat's erwischt, den hat's zerrissen."}, {"id": 275, "start": 2083.04, "end": 2105.56, "text": "Oh, Boss. Oh, oh, so war das nicht gedacht. Ok, wie hat man das Ding nochmal kaputt gemacht?"}, {"id": 276, "start": 2105.56, "end": 2110.64, "text": "Hat man das überhaupt kaputt gemacht oder konnte man hochklettern? Ich glaub man musste"}, {"id": 277, "start": 2110.64, "end": 2116.24, "text": "hochklettern, kann das sein? Ich weiß es nicht mehr genau. Ok, wie macht man das Fisch kaputt?"}, {"id": 278, "start": 2116.24, "end": 2140.56, "text": "Wir können ja versuchen ins Auge zu Jump Slashen. Hallo, komm her. Oh, Monka Giga. Ach, ich"}, {"id": 279, "start": 2140.56, "end": 2146.8, "text": "muss dem bestimmtes Zeug umhauen lassen, da fällt's auf ihn drauf. Big Brain. Lass den"}, {"id": 280, "start": 2146.8, "end": 2154.32, "text": "noch umhauen, please. Äh, nein, nicht werfen, geh weg. Nicht werfen. Kaputt machen hier,"}, {"id": 281, "start": 2154.32, "end": 2170.92, "text": "kaputt machen. Nee, der macht hier nicht kaputt. Ah, guck mal da, da ist was. Ich hab ja so"}, {"id": 282, "start": 2170.92, "end": 2176.36, "text": "das Gefühl wir müssen hier hochklettern, weil da oben kletzert's auch, weil das ein bisschen"}, {"id": 283, "start": 2176.36, "end": 2197.12, "text": "gefährlich werden könnte. Oh, oh. Hallo. Hallo, Cyclope. Cyclope overrated. Es ist natürlich"}, {"id": 284, "start": 2197.12, "end": 2203.68, "text": "ziemlich blöd, wo... Ich kann jetzt hier weiter hüpfen. Ah, oh nee, ich hätte da was hinschießen"}, {"id": 285, "start": 2203.68, "end": 2223.6, "text": "müssen. Ähm. Ach, guck mal, er geht weg. Ah. Piss dich. Wie, das ging nicht? Jetzt geht's."}, {"id": 286, "start": 2223.6, "end": 2228.0, "text": "Jetzt geht's. Ok, schnell, schnell. Kletter, kletter, kletter, kletter, kletter. Hau mich"}, {"id": 287, "start": 2228.0, "end": 2241.68, "text": "nicht weg. Kletter, kletter, kletter, kletter, kletter. Aha. Ok. Ein Stelzer Outfit, das"}, {"id": 288, "start": 2241.68, "end": 2246.2, "text": "brauchen wir nicht. Das können wir, Stelz 3 werden wir wahrscheinlich eh netzbacken."}, {"id": 289, "start": 2246.2, "end": 2264.4, "text": "Ähm. Ähm. Meint ihr, das ist so gedacht, dass man sich jetzt hier so langhangelt? Dass"}, {"id": 290, "start": 2264.4, "end": 2272.72, "text": "man jetzt quasi den Spider-Man macht? Ich meine, die Physik in dem Game gibt's ja her,"}, {"id": 291, "start": 2272.72, "end": 2276.52, "text": "dass man sich hier langhangelt nach da drüben. Ich glaube, das ist von dem Game nicht so"}, {"id": 292, "start": 2276.52, "end": 2285.44, "text": "gedacht. Ich glaube, das ist von dem Game nicht gedacht. Oder was meint ihr? Mal gucken,"}, {"id": 293, "start": 2285.44, "end": 2313.28, "text": "ob das überhaupt geht. Ah. Alter, warum ist der durch die Seile gerannt? Warst du schon"}, {"id": 294, "start": 2313.28, "end": 2323.56, "text": "wählen? Ja. Oh. Oh. Ich konnte hochklettern. Nice. Nice, du. Ok, vielleicht ist es ernsthaft"}, {"id": 295, "start": 2323.56, "end": 2332.2, "text": "so gedacht, dass man den Outstelzen kann, den Gegner. Ob das... Ich hab mal eine Zweifel,"}, {"id": 296, "start": 2332.2, "end": 2338.08, "text": "dass es so gedacht ist. Wir gucken jetzt mal, ob wir hier rauskommen. Aber selbst wenn wir"}, {"id": 297, "start": 2338.08, "end": 2342.16, "text": "rauskommen, probieren wir mal, wie man den Cyclop bashen kann. Ich glaub nicht, dass"}, {"id": 298, "start": 2342.16, "end": 2360.24, "text": "es so gedacht ist, was ich hier mache. Oh. Oh. Oh. Nice. Nice, es geht. Aber die Musik"}, {"id": 299, "start": 2360.24, "end": 2365.04, "text": "läuft weiter. Das ist nicht so gedacht. Aber wir gucken mal, wie man das Viech platt machen"}, {"id": 300, "start": 2365.04, "end": 2370.0, "text": "kann. Das interessiert mich jetzt schon auch. Aber wisst ihr, was ich cool finde? Dass das"}, {"id": 301, "start": 2370.0, "end": 2375.0, "text": "eben nicht nur so tut, als hätte man eine gewisse Freiheit mit der Physik-Engine drunter,"}, {"id": 302, "start": 2375.0, "end": 2377.96, "text": "sondern man hat die Freiheit auch wirklich. Also sprich, man kann sich auch durchklitschen,"}, {"id": 303, "start": 2377.96, "end": 2385.24, "text": "ob man will oder nicht. Ob es das so gedacht ist oder nicht. Vielleicht kann... Genau,"}, {"id": 304, "start": 2385.24, "end": 2388.96, "text": "vielleicht kann ich ihm ins Auge ballern. Das geht bestimmt. Aber ich hab keinen Bogenstells"}, {"id": 305, "start": 2388.96, "end": 2405.76, "text": "gespeckt. Ich hab keinen Bogenstells... Oh. Hat es getroffen? Guck mal, der ist clever."}, {"id": 306, "start": 2405.76, "end": 2420.32, "text": "Es geht weg. Es geht weg, dass ich nicht sehe. Ein nicer, schlauer Cyclop. Doch nicht. Nee,"}, {"id": 307, "start": 2420.32, "end": 2427.44, "text": "ich glaub nicht, dass es so gedacht ist. Was haben... Oh, da hinten haben wir noch was."}, {"id": 308, "start": 2427.44, "end": 2433.04, "text": "Vielleicht, vielleicht kann man da mit interagieren. Oder aber... Komm, wir machen jetzt YOLO, wir"}, {"id": 309, "start": 2433.04, "end": 2444.28, "text": "Jumpslashen ihn einfach kaputt. Das geht bestimmt. Alter, warum hab ich überhaupt so ein Akt gemacht"}, {"id": 310, "start": 2444.28, "end": 2455.08, "text": "jetzt die ganze Zeit? Warum hab ich jetzt... Warum genau hab ich so ein Akt gemacht? Einfach"}, {"id": 311, "start": 2455.08, "end": 2470.24, "text": "Jumpslashen und on. Mein Brudi meint, das Game sei verbackt. Nee. Geht eigentlich. Eats"}, {"id": 312, "start": 2470.24, "end": 2484.24, "text": "reckt, ja. Vielleicht hätten wir ihn hiermit auch noch irgendwie platt machen können."}, {"id": 313, "start": 2500.24, "end": 2517.0, "text": "Eine sehr schnelle Tür. Nee, nee, der PC-Port wurde nicht offiziell bestätigt. Aber ich"}, {"id": 314, "start": 2517.0, "end": 2525.2, "text": "könnte mir vorstellen, dass Rockstar einen PC-Port macht. Das war bei GTA auch so. Und"}, {"id": 315, "start": 2525.2, "end": 2528.44, "text": "so ein Hype, wie um das Game ist. Und ich denk mal, sie werden sich natürlich auch die"}, {"id": 316, "start": 2528.44, "end": 2532.2, "text": "GTA-PC-Verkaufszahlen angeguckt haben, wie viele Leute quasi Multiplayer spielen und"}, {"id": 317, "start": 2532.2, "end": 2536.8, "text": "sonst was. Ich geh davon aus, dass es einen PC-Port geben wird. Ich denke, sie haben da"}, {"id": 318, "start": 2536.8, "end": 2555.2, "text": "gute Erfahrungen mit GTA gemacht. Also ich denke, es wird einen PC-Port, wird's auf jeden"}, {"id": 319, "start": 2555.2, "end": 2578.48, "text": "Fall geben. Hm, das Seil hat nicht funktioniert. Aber so sollte das klappen. Ich finde den"}, {"id": 320, "start": 2578.48, "end": 2608.12, "text": "Klettersound geil. Haben wir schon? My Prince. Aua. Toll. Einfach mal den Berg runterjump"}, {"id": 321, "start": 2608.12, "end": 2633.96, "text": "slashed. WTF? Bin dazu wirklich langsam runtergehöpft. Spodas. Hallo Patrick. So viele Spodas."}, {"id": 322, "start": 2633.96, "end": 2646.2, "text": "Boah. Spodas in den Games sind sehr eklig."}, {"id": 323, "start": 2663.96, "end": 2682.6, "text": "Noch einer. Rekt. Eindeutig zu viele Spinnen. Uah, noch mehr. Das ist so eklig gemacht"}, {"id": 324, "start": 2682.6, "end": 2688.0, "text": "in dem Spiel, wie ich um die Ecke komm. Ich bin ja eh kein Spinnen-Fan. Das wisst"}, {"id": 325, "start": 2688.0, "end": 2696.76, "text": "ja. Ich hab's mit Spinnen nicht. Aurel nicht. Und es ekelt mich in keinem Game-Spin, außer"}, {"id": 326, "start": 2696.76, "end": 2702.44, "text": "in dem. Ach ja, guck mal, jetzt sind wir hier, wo wir rausgeklettert sind vorhin. Also ich"}, {"id": 327, "start": 2702.44, "end": 2706.0, "text": "glaube nicht, dass das Game sich das so gedacht hat, aber es funktioniert und das ist ziemlich"}, {"id": 328, "start": 2706.0, "end": 2712.84, "text": "gut. Ich weiß, wenn man sich mal genau überlegt, ist es schon ziemlich nice, ne. Dass die"}, {"id": 329, "start": 2712.84, "end": 2717.4, "text": "hier nicht gesagt haben, nach dem Motto, hier ist sie verlassen das Kampfgebiet, sondern"}, {"id": 330, "start": 2717.4, "end": 2722.16, "text": "dass sie es einfach erlauben, dass du hier rauskletterst und den Fight umgehst, mit dem"}, {"id": 331, "start": 2722.16, "end": 2726.6, "text": "sie sich Mühe gegeben haben. Das finde ich halt cool. Das ist nicht so, man tut so, als"}, {"id": 332, "start": 2726.6, "end": 2731.84, "text": "hat man einen Physik-Engine, lässt die Leute trotzdem nicht machen, was sie wollen, sondern"}, {"id": 333, "start": 2731.84, "end": 2732.84, "text": "lebt halt einfach damit, ne."}, {"id": 334, "start": 2732.84, "end": 2760.04, "text": "Ah, das Demo-Level. Das Game kommt aus der Zeit, wo es noch Demos gab. Und das war das"}, {"id": 335, "start": 2760.04, "end": 2786.2, "text": "Demo-Level hier. Ist hier irgendwo was? Achtung! Bam! Das Kampfsystem ist einfach nice. Da kann"}, {"id": 336, "start": 2786.2, "end": 2803.88, "text": "keiner was anderes sagen. Beste. So, stellst du uns mal hier rein? Der Kreis in der Mitte"}, {"id": 337, "start": 2803.88, "end": 2819.88, "text": "zeigt übrigens an, wie sehr man gestellst ist. Wie soll ich die denn jetzt messern?"}, {"id": 338, "start": 2819.88, "end": 2847.48, "text": "Kann ich irgendwie hier hoch? Hier hochklettern? Und irgendwas bashen? Ich meine, ich könnte"}, {"id": 339, "start": 2847.48, "end": 2863.92, "text": "die Goblins easy-Mehle-ownen, ja, aber ich will mal ein Dolchin, ein Messer. Ach, dann."}, {"id": 340, "start": 2863.92, "end": 2882.04, "text": "Okay, dann fackel ich sie halt ab, wenn ich sie nicht messern kann. Die können nichts,"}, {"id": 341, "start": 2882.04, "end": 2911.48, "text": "die Viecher. Zack! Arm ab. Noch irgendwo was? Was ist das hier? Aha! So, was ist das?"}, {"id": 342, "start": 2911.48, "end": 2927.32, "text": "Secret. Aber nichts Tolles drin. Noch mal ein gefangener Ork. Die Goblins haben wir"}, {"id": 343, "start": 2927.32, "end": 2935.0, "text": "ja alle geowned, hier ist nichts mehr. Ach, ich glaube, man hätte hier runter gehen können,"}, {"id": 344, "start": 2935.0, "end": 2939.32, "text": "hier hintertauchen und dann hier hoch. Das hätte wahrscheinlich auch funktioniert, aber"}, {"id": 345, "start": 2939.32, "end": 2942.76, "text": "nachdem wir im Prinzip die Goblins einfach Nachkampf-ownen können, drauf geschissen."}, {"id": 346, "start": 2942.76, "end": 2953.56, "text": "Jawoll. Wir sind mal so nett. Ich glaube, die alternative Taktik wäre gewesen, den Ork"}, {"id": 347, "start": 2953.56, "end": 2971.32, "text": "auch und die Goblins. Debated. Die können gar nichts."}, {"id": 348, "start": 2971.32, "end": 2989.44, "text": "Die machen wir auch noch platt hier unten. Ist noch Blut drinne. Komm mal her. Komm mal"}, {"id": 349, "start": 2989.44, "end": 2996.6, "text": "her Goblin. Ja, komm. Und jetzt BAM! Oh nee. Fuck. Ich wollte eigentlich die Stachel kicken."}, {"id": 350, "start": 2996.6, "end": 3004.36, "text": "Dann halt nicht. Wenn du nicht willst. Aber komm, du lässt dich in die Stacheln kicken."}, {"id": 351, "start": 3004.36, "end": 3020.32, "text": "Zack! Physik-Engine beste. BAM! Weiter geht's. So, ich glaube nur, wir müssen da hochklettern."}, {"id": 352, "start": 3020.32, "end": 3028.76, "text": "Wann wird eigentlich Chrono Trigger mal gestimmt? Du hörst ja öfters die Musik davon. Das"}, {"id": 353, "start": 3028.76, "end": 3033.96, "text": "ist zu lang. Das ist zu lang. Das braucht irgendwie 20 Stunden oder so. Wo kommt denn"}, {"id": 354, "start": 3033.96, "end": 3039.48, "text": "der her? Der war eben noch nicht da. Ist ja auch schon wieder weg. Achja, ich wollte mal"}, {"id": 355, "start": 3039.48, "end": 3044.4, "text": "gucken, was hier unten drinne ist. Ob irgendwas... Lass mich mal runterspringen. Moment, respawnen"}, {"id": 356, "start": 3044.4, "end": 3055.6, "text": "die hier? Die respawnen definitiv, oder? Ja, ja. Spawncampen angesagt hier. Was haben"}, {"id": 357, "start": 3055.6, "end": 3062.32, "text": "wir hier zu bieten? Staggers? Staggers? Haben wir die schon? Oh, plus 6 Damage Staggers."}, {"id": 358, "start": 3062.32, "end": 3072.4, "text": "Können wir zwar nicht gebrauchen. Aber wir nehmen sie mal mit. Und irgendwann schmeißen"}, {"id": 359, "start": 3072.4, "end": 3082.48, "text": "wir uns weg, weil wir nicht genug Inventarplatz haben. Der Chrono Trigger ist speedran. Ich"}, {"id": 360, "start": 3082.48, "end": 3090.04, "text": "glaube, das kriege ich nicht gebacken. Achso, im Dezember 4 Tage am Stück. Also im Dezember"}, {"id": 361, "start": 3090.04, "end": 3099.32, "text": "sind wir eh ziemlich... Ich komm von da oben runtergejumpt. Jetzt verstehe ich das. Im"}, {"id": 362, "start": 3099.32, "end": 3110.4, "text": "Dezember sind wir wahrscheinlich eh fast jeden Tag am Frenrun. Moment, der wird jetzt gebogit."}, {"id": 363, "start": 3110.4, "end": 3126.88, "text": "Oh, der hat seinen Boden genagelt. Sieht nicht so aus, als geht es hier lang. Das Game ist"}, {"id": 364, "start": 3126.88, "end": 3132.44, "text": "eindeutig das bessere Thief. Es hat gewisse Parallelen. Vor allem zum ersten hat das Stelz"}, {"id": 365, "start": 3132.44, "end": 3136.84, "text": "ein bisschen Parallelen. Es gibt natürlich keine Moos-Pfeile oder was? Was gab es in"}, {"id": 366, "start": 3136.84, "end": 3143.92, "text": "Dark Blood Shack? Es gab so ganz komische Dinge. Moos-Pfeile. Aber was man da auch machen"}, {"id": 367, "start": 3143.92, "end": 3148.6, "text": "konnte, sind Pfeile anzünden. Das geht hier auch. Man kann hier zum Beispiel in dem Game"}, {"id": 368, "start": 3148.6, "end": 3152.56, "text": "Pfeil nehmen und quasi ins Feuer halten. Dann kann man einen Feuerfall schießen. Das"}, {"id": 369, "start": 3152.56, "end": 3167.24, "text": "hat es schon ganz cool gemacht. Stimmt, Wasserpfeile für die Fackeln. Genau, das gab es da. Dark"}, {"id": 370, "start": 3167.24, "end": 3171.76, "text": "Blood Shack gab es das auch noch. Dark Blood Shack spielen wir aber nicht. Das ist zu altbacken."}, {"id": 371, "start": 3171.76, "end": 3182.52, "text": "Das sieht wirklich hässlich aus. Geht es hier nach oben oder nach unten? Ich würde"}, {"id": 372, "start": 3182.52, "end": 3199.36, "text": "sagen es geht nach unten, weil nach oben geht es... Hallo? Geht es nicht weiter? Kiste."}, {"id": 373, "start": 3199.36, "end": 3222.24, "text": "Doch. Die Dinger, die Dinger können echt nichts. Kommt noch eine Schaufel. Kann man dem nächsten"}, {"id": 374, "start": 3222.24, "end": 3247.96, "text": "Goblet keine Schaufel an den Kopf schmeißen. Wo ist er? Nee, ist nix. Hopp. Hopp. Boah. What the fuck?"}, {"id": 375, "start": 3247.96, "end": 3266.52, "text": "WTF? Ok, dann schmeißen wir dem Viech jetzt die Schaufel gegen den Kopf. Oder auch nicht."}, {"id": 376, "start": 3266.52, "end": 3296.16, "text": "Ok, was genau soll ich machen, Game? Hallo? Geh weg! Piss dich, Alde! Kann man den..."}, {"id": 377, "start": 3296.16, "end": 3310.8, "text": "Da kann ich Bashing vielleicht. Nein, ich glaube das geht nicht. Ich glaube wir mussten"}, {"id": 378, "start": 3310.8, "end": 3328.08, "text": "wegrennen. Ich erinnere mich dunkel, ich glaube wir mussten wegrennen. Ah, ja stimmt."}, {"id": 379, "start": 3328.08, "end": 3339.28, "text": "Oh, oh, oh, oh. Ok. Ja, ist auch noch Gift, ist klar."}, {"id": 380, "start": 3358.08, "end": 3368.12, "text": "Ok, nach der Welle gehen wir durch. Geschafft. Wobei es das mit garantiert noch nicht gewesen"}, {"id": 381, "start": 3368.12, "end": 3395.4, "text": "ist. What the fuck? Was? Ich glaube, ich glaube ich soll abhauen."}, {"id": 382, "start": 3395.4, "end": 3413.32, "text": "Ok, rennen. Rennen, rennen, rennen, rennen. Ah, ah, oder? Aha. Nein, hier gehts nicht"}, {"id": 383, "start": 3413.32, "end": 3415.32, "text": "weiter"}, {"id": 384, "start": 3415.32, "end": 3417.32, "text": "weg"}, {"id": 385, "start": 3419.32, "end": 3421.32, "text": "au"}, {"id": 386, "start": 3423.32, "end": 3425.32, "text": "rennrennrennrennrenn"}, {"id": 387, "start": 3429.32, "end": 3431.32, "text": "wir können gleich den pilz schlucken"}, {"id": 388, "start": 3431.32, "end": 3447.32, "text": "einfach gefunden haben"}, {"id": 389, "start": 3447.32, "end": 3459.32, "text": "ok, kommen wir jetzt hier raus gescheit"}, {"id": 390, "start": 3459.32, "end": 3461.32, "text": "rennrennrennrennen"}, {"id": 391, "start": 3465.32, "end": 3467.32, "text": "uhh... POLEN"}, {"id": 392, "start": 3467.32, "end": 3469.32, "text": "olun"}, {"id": 393, "start": 3475.32, "end": 3477.32, "text": "kueeh"}, {"id": 394, "start": 3479.32, "end": 3481.32, "text": "au"}, {"id": 395, "start": 3483.32, "end": 3485.32, "text": "kueeh"}, {"id": 396, "start": 3485.32, "end": 3487.32, "text": "ein bisschen food"}, {"id": 397, "start": 3487.32, "end": 3489.32, "text": "food da"}, {"id": 398, "start": 3496.76, "end": 3499.84, "text": "Gut dass wir das food aufgesammelt haben fuck hier ist ja gar nix"}, {"id": 399, "start": 3501.48, "end": 3503.48, "text": "Okay, wo geht's dann weiter"}, {"id": 400, "start": 3507.56, "end": 3509.56, "text": "Aha"}, {"id": 401, "start": 3512.48, "end": 3514.48, "text": "Physik spielt rein"}, {"id": 402, "start": 3514.48, "end": 3516.48, "text": "Okay"}, {"id": 403, "start": 3516.48, "end": 3518.48, "text": "Kletter, kletter, kletter, kletter, kletter, kletter, kletter, kletter"}, {"id": 404, "start": 3518.48, "end": 3520.48, "text": "weg"}, {"id": 405, "start": 3520.48, "end": 3522.48, "text": "Woh, Monkers"}, {"id": 406, "start": 3522.48, "end": 3536.04, "text": "Ich glaube das Game möchte von uns, dass wir hier reinfallen"}, {"id": 407, "start": 3546.04, "end": 3547.72, "text": "Das war echt anstrengend"}, {"id": 408, "start": 3547.72, "end": 3552.48, "text": "Obwohl man wahrscheinlich im Prinzip kaum, kaum die Chance hat überhaupt zu sterben war das gut inszeniert"}, {"id": 409, "start": 3554.04, "end": 3556.04, "text": "Da muss man jetzt mal sagen"}, {"id": 410, "start": 3556.04, "end": 3558.04, "text": "sehr nice"}, {"id": 411, "start": 3558.04, "end": 3571.28, "text": "Sind wir durch oder? Mehr gibt's ja nicht in dem Level. Mana Tränke brauchen wir nicht"}, {"id": 412, "start": 3571.28, "end": 3581.88, "text": "Auch wieder diese Viecher"}, {"id": 413, "start": 3581.88, "end": 3588.48, "text": "gestreckt"}, {"id": 414, "start": 3588.48, "end": 3599.56, "text": "Ist da irgendwo lang? Da oben ist noch so ein Viech"}, {"id": 415, "start": 3599.56, "end": 3604.04, "text": "Ah wir können mal gucken ob wir da hoch können wenn wir hier einen Pfeil hinschießen. Das probieren wir gleich mal aus"}, {"id": 416, "start": 3604.04, "end": 3606.04, "text": "Aber erst mal das Viech baschen"}, {"id": 417, "start": 3606.04, "end": 3608.04, "text": "Komm her, er hat keinen Bock"}, {"id": 418, "start": 3608.04, "end": 3614.04, "text": "Guck mal was"}, {"id": 419, "start": 3614.04, "end": 3622.04, "text": "Ich würde sagen es hat uns ein wenig in die Wand geklitscht gerade"}, {"id": 420, "start": 3622.04, "end": 3628.04, "text": "Dadurch dass das Pfeil, dass das Seil noch hin und her gesprungen ist"}, {"id": 421, "start": 3628.04, "end": 3632.04, "text": "Vielleicht klitscht es uns aber auch wieder aus der Wand raus"}, {"id": 422, "start": 3632.04, "end": 3636.04, "text": "Sieht fast so aus"}, {"id": 423, "start": 3636.04, "end": 3640.04, "text": "Rausklitschen aus, nice wir sind rausgeklitscht"}, {"id": 424, "start": 3646.04, "end": 3648.04, "text": "Hier geht's nicht weiter"}, {"id": 425, "start": 3650.04, "end": 3652.04, "text": "Secret"}, {"id": 426, "start": 3652.04, "end": 3654.04, "text": "Was gibt's hier?"}, {"id": 427, "start": 3654.04, "end": 3656.04, "text": "Reckt"}, {"id": 428, "start": 3656.04, "end": 3658.04, "text": "Spinnen auch reckt"}, {"id": 429, "start": 3666.04, "end": 3670.04, "text": "So was ist jetzt hier in der Secret Area? Wo gibt's hier jetzt was? Ah ein Pilz"}, {"id": 430, "start": 3670.04, "end": 3674.04, "text": "Pilze sind in dem Spiel sehr nice, füllt Mana und Leben komplett auf"}, {"id": 431, "start": 3674.04, "end": 3676.04, "text": "Allerdings Mana brauchen wir ja nicht"}, {"id": 432, "start": 3676.04, "end": 3678.04, "text": "Äh raus"}, {"id": 433, "start": 3678.04, "end": 3680.04, "text": "Ich nehm lieber das Orkspann, das klitzert nicht so rum"}, {"id": 434, "start": 3686.04, "end": 3688.04, "text": "Äh kannste nichts machen"}, {"id": 435, "start": 3688.04, "end": 3690.04, "text": "Oh sehr nice"}, {"id": 436, "start": 3690.04, "end": 3692.04, "text": "Er wird jetzt wieder von den Spodas geownt"}, {"id": 437, "start": 3692.04, "end": 3694.04, "text": "Er wird jetzt wieder von den Spodas geownt"}, {"id": 438, "start": 3694.04, "end": 3696.04, "text": "Er wird jetzt wieder von den Spodas geownt"}, {"id": 439, "start": 3696.04, "end": 3698.04, "text": "Spielst du noch BDO? Ne eigentlich nicht"}, {"id": 440, "start": 3726.04, "end": 3728.04, "text": "Spielst du noch BDO? Ne eigentlich nicht"}, {"id": 441, "start": 3738.04, "end": 3740.04, "text": "Jetzt muss ich erstmal die ganzen Spodas wieder umhauen"}, {"id": 442, "start": 3742.04, "end": 3744.04, "text": "Oh fuck sie, Anti-Dote"}, {"id": 443, "start": 3744.04, "end": 3750.04, "text": "Anti-Dote"}, {"id": 444, "start": 3750.04, "end": 3752.04, "text": "Übrigens, ich hab auch einen geilen Rundum-Angriff"}, {"id": 445, "start": 3752.04, "end": 3754.04, "text": "Übrigens, ich hab auch einen geilen Rundum-Angriff"}, {"id": 446, "start": 3754.04, "end": 3756.04, "text": "Soll ich mal geben"}, {"id": 447, "start": 3758.04, "end": 3760.04, "text": "Er ging irgendwie ducken"}, {"id": 448, "start": 3762.04, "end": 3764.04, "text": "Zack, also quasi"}, {"id": 449, "start": 3764.04, "end": 3766.04, "text": "So was wie Spin Attack in Zelda"}, {"id": 450, "start": 3766.04, "end": 3774.04, "text": "Bloß dass es hier irgendwie bei den Spodas nicht funktioniert"}, {"id": 451, "start": 3774.04, "end": 3776.04, "text": "Ok alles down"}, {"id": 452, "start": 3776.04, "end": 3778.04, "text": "Kette"}, {"id": 453, "start": 3786.04, "end": 3788.04, "text": "Ja, da ist doch der Way"}, {"id": 454, "start": 3788.04, "end": 3790.04, "text": "Da Way ist hier"}, {"id": 455, "start": 3790.04, "end": 3792.04, "text": "Da Way ist hier"}, {"id": 456, "start": 3792.04, "end": 3794.04, "text": "Spinnen"}, {"id": 457, "start": 3794.04, "end": 3796.04, "text": "Also wirklich in dem Game sind Spinnen echt massiv"}, {"id": 458, "start": 3796.04, "end": 3798.04, "text": "Spinnen echt massiv"}, {"id": 459, "start": 3798.04, "end": 3800.04, "text": "Hallo, massiv eklig"}, {"id": 460, "start": 3800.04, "end": 3802.04, "text": "Massiv"}, {"id": 461, "start": 3802.04, "end": 3804.04, "text": "Master Thieves Outfit, das haben wir schon"}, {"id": 462, "start": 3804.04, "end": 3806.04, "text": "Und das können wir nicht anziehen, weil wir haben keinen Stealth-Spank"}, {"id": 463, "start": 3806.04, "end": 3808.04, "text": "Und das können wir nicht anziehen, weil wir haben keinen Stealth-Spank"}, {"id": 464, "start": 3808.04, "end": 3812.04, "text": "Äh"}, {"id": 465, "start": 3814.04, "end": 3816.04, "text": "Oh"}, {"id": 466, "start": 3816.04, "end": 3818.04, "text": "Au"}, {"id": 467, "start": 3820.04, "end": 3822.04, "text": "Ah, da, guck mal da"}, {"id": 468, "start": 3830.04, "end": 3832.04, "text": "Gehst du weg?"}, {"id": 469, "start": 3834.04, "end": 3836.04, "text": "Kackfisch"}, {"id": 470, "start": 3836.04, "end": 3838.04, "text": "Oh, noch mehr"}, {"id": 471, "start": 3840.04, "end": 3842.04, "text": "Vielleicht können wir die erbogigen"}, {"id": 472, "start": 3846.04, "end": 3848.04, "text": "NA-Aim"}, {"id": 473, "start": 3848.04, "end": 3850.04, "text": "Nee, können wir nicht"}, {"id": 474, "start": 3850.04, "end": 3852.04, "text": "Wir hauen die lieber so um"}, {"id": 475, "start": 3854.04, "end": 3856.04, "text": "Aber der nächste, der kommt, den können wir bestimmt NA-Aim"}, {"id": 476, "start": 3856.04, "end": 3860.04, "text": "Mücke"}, {"id": 477, "start": 3870.04, "end": 3872.04, "text": "Ah"}, {"id": 478, "start": 3872.04, "end": 3874.04, "text": "Ist mir heute weniger vor der Nase gespawnt"}, {"id": 479, "start": 3874.04, "end": 3876.04, "text": "Können nichts"}, {"id": 480, "start": 3876.04, "end": 3878.04, "text": "Nope, Opfers"}, {"id": 481, "start": 3880.04, "end": 3882.04, "text": "Als Opfers"}, {"id": 482, "start": 3882.04, "end": 3908.54, "text": "Oh, guck mal, kann man hier hochklappen"}, {"id": 483, "start": 3908.54, "end": 3912.18, "text": "Oh guck mal, kann man hier hochklettern?"}, {"id": 484, "start": 3912.18, "end": 3913.18, "text": "Nee."}, {"id": 485, "start": 3913.18, "end": 3922.18, "text": "Sah so aus, ne?"}, {"id": 486, "start": 3922.18, "end": 3939.34, "text": "Nee, im Prinzip müssen wir hier hochklettern."}, {"id": 487, "start": 3939.34, "end": 3947.06, "text": "Oder auch nicht, doch, doch, doch."}, {"id": 488, "start": 3947.06, "end": 3950.06, "text": "So müssen wir klettern, ja."}, {"id": 489, "start": 3950.06, "end": 3966.14, "text": "Ah, Spoda, hast du so viele Spinnen."}, {"id": 490, "start": 3966.14, "end": 3967.14, "text": "Jaja, ja."}, {"id": 491, "start": 3967.14, "end": 3973.02, "text": "Das war ein Sektiv von dem Goblin, irgendwie hört's nicht auf."}, {"id": 492, "start": 3973.02, "end": 3982.26, "text": "Ja, er splittert ordentlich Spinnen, das haben wir verstanden."}, {"id": 493, "start": 3982.26, "end": 3996.18, "text": "Au, Arm ab."}, {"id": 494, "start": 3996.18, "end": 3997.18, "text": "Ring of Protection."}, {"id": 495, "start": 3997.18, "end": 3999.74, "text": "Wizard Robe, haben wir schon."}, {"id": 496, "start": 3999.74, "end": 4000.74, "text": "Brauchen wir nicht."}, {"id": 497, "start": 4000.74, "end": 4004.74, "text": "Wir müssen mal Info ein bisschen leer machen."}, {"id": 498, "start": 4004.74, "end": 4006.18, "text": "Können wir wegschmeißen."}, {"id": 499, "start": 4006.18, "end": 4007.54, "text": "Chainmail können wir wegschmeißen."}, {"id": 500, "start": 4007.54, "end": 4011.66, "text": "Und Plate Armor können wir auch wegschmeißen."}, {"id": 501, "start": 4011.66, "end": 4013.66, "text": "Oh, Moment, das ist die die wir anhaben?"}, {"id": 502, "start": 4013.66, "end": 4015.66, "text": "Nein, dann können wir die natürlich nicht wegschmeißen."}, {"id": 503, "start": 4015.66, "end": 4021.86, "text": "Hammer können wir wegschmeißen, wir müssten glaub ich nix mehr craften und wenn liegt"}, {"id": 504, "start": 4021.86, "end": 4022.86, "text": "eh einer da."}, {"id": 505, "start": 4022.86, "end": 4028.14, "text": "Assassin Stellzeug brauchen wir nicht."}, {"id": 506, "start": 4028.14, "end": 4030.46, "text": "Wir haben ordentlich Rüstung."}, {"id": 507, "start": 4030.46, "end": 4032.74, "text": "Sollen wir ein bisschen Inventar Platz machen."}, {"id": 508, "start": 4032.74, "end": 4034.78, "text": "Ähm, was haben wir sonst noch?"}, {"id": 509, "start": 4034.78, "end": 4035.78, "text": "Axt."}, {"id": 510, "start": 4035.78, "end": 4037.26, "text": "Die Axt brauchen wir eigentlich auch nicht."}, {"id": 511, "start": 4037.26, "end": 4039.74, "text": "Nein, die Axt zackt."}, {"id": 512, "start": 4039.74, "end": 4054.1, "text": "Dann nehm ich doch lieber den Haken, damit kann zweigs Leute umhauen und runter werfen."}, {"id": 513, "start": 4054.1, "end": 4061.98, "text": "Oh, weiter gehts."}, {"id": 514, "start": 4061.98, "end": 4062.98, "text": "Skill Points."}, {"id": 515, "start": 4062.98, "end": 4069.22, "text": "Skill Points sind immer gut."}, {"id": 516, "start": 4069.22, "end": 4070.5, "text": "Scrolls, die wir nicht brauchen."}, {"id": 517, "start": 4070.5, "end": 4089.54, "text": "Was haben wir denn hier schönes?"}, {"id": 518, "start": 4089.54, "end": 4090.54, "text": "Noch mehr Spodas."}, {"id": 519, "start": 4090.54, "end": 4091.54, "text": "Aber ne Kisse."}, {"id": 520, "start": 4091.54, "end": 4094.54, "text": "Wow, wollen wir jetzt hier noch was?"}, {"id": 521, "start": 4094.54, "end": 4097.7, "text": "Ne, die macht bloß Geräusche, obwohl sie schon down ist."}, {"id": 522, "start": 4097.7, "end": 4101.66, "text": "Was haben wir denn hier, Stonesge... nix gescheites."}, {"id": 523, "start": 4101.66, "end": 4107.62, "text": "Wo gehts denn lang?"}, {"id": 524, "start": 4107.62, "end": 4115.42, "text": "Pilz, sehr nice."}, {"id": 525, "start": 4115.42, "end": 4123.06, "text": "Ach hier."}, {"id": 526, "start": 4123.06, "end": 4124.06, "text": "Hauptsache wir haben das Seil durchgehackt."}, {"id": 527, "start": 4124.06, "end": 4141.82, "text": "Da klitschelt was, Steffs zackt in dem Game."}, {"id": 528, "start": 4141.82, "end": 4153.3, "text": "Steffs sind die schlechtesten Waffen in dem ganzen Spiel."}, {"id": 529, "start": 4153.3, "end": 4154.3, "text": "Rundelstells."}, {"id": 530, "start": 4154.3, "end": 4155.3, "text": "Nope."}, {"id": 531, "start": 4155.3, "end": 4156.3, "text": "Rekt."}, {"id": 532, "start": 4156.3, "end": 4157.3, "text": "Bogen brauchen wir nicht."}, {"id": 533, "start": 4157.3, "end": 4160.3, "text": "Können wir eh nicht, haben wir eh nicht gespeckt."}, {"id": 534, "start": 4160.3, "end": 4181.3, "text": "Jetzt kommt bestimmt gleich der Wurm wieder."}, {"id": 535, "start": 4181.3, "end": 4186.78, "text": "So Leute, ich muss mal kurz aufs Klo."}, {"id": 536, "start": 4186.78, "end": 4189.86, "text": "Ich bin gleich wieder am Start."}, {"id": 537, "start": 4189.86, "end": 4194.7, "text": "Machen wir ein bisschen Musik an."}, {"id": 538, "start": 4194.7, "end": 4202.02, "text": "5 Minuten, bin ich wieder am Start."}, {"id": 539, "start": 4202.02, "end": 4226.18, "text": "Bis gleich."}, {"id": 540, "start": 4503.02, "end": 4505.06, "text": "So, bin schöner."}, {"id": 541, "start": 4505.06, "end": 4512.26, "text": "Ich frag mich immer wieder, Fabian das schafft innerhalb von 25 Sekunden vom Klo wieder da"}, {"id": 542, "start": 4512.26, "end": 4513.26, "text": "zu sein."}, {"id": 543, "start": 4513.26, "end": 4514.9, "text": "Wie das Lied heißt, ich kann dir sagen wie das Stream heißt."}, {"id": 544, "start": 4514.9, "end": 4523.78, "text": "Das Stream heißt Chillstep 24 7 Livestream Gentle Ambient und Study Music und das ist"}, {"id": 545, "start": 4523.78, "end": 4525.74, "text": "anscheinend der aktuelle Song."}, {"id": 546, "start": 4525.74, "end": 4532.74, "text": "Ich hab keine Playlist, das ist einfach Livestream gewesen."}, {"id": 547, "start": 4532.74, "end": 4541.98, "text": "Hey Max, gib dir mal das hier, zeig mal her."}, {"id": 548, "start": 4541.98, "end": 4542.98, "text": "Hexglock."}, {"id": 549, "start": 4542.98, "end": 4543.98, "text": "Oh, das ist nice."}, {"id": 550, "start": 4543.98, "end": 4544.98, "text": "Das ist cool."}, {"id": 551, "start": 4544.98, "end": 4545.98, "text": "Dann checkt keiner mehr die Uhrzeit."}, {"id": 552, "start": 4545.98, "end": 4550.74, "text": "Fabian ist immer dem Rechner im Pinkelflasch."}, {"id": 553, "start": 4550.74, "end": 4557.06, "text": "Von der Zeit her könnte man echt denken das wäre so."}, {"id": 554, "start": 4557.06, "end": 4560.7, "text": "Ich weiß ja wie es bei ihm aussieht, bei ihm ist das Klo mehr oder weniger nebendran aber"}, {"id": 555, "start": 4560.7, "end": 4561.7, "text": "bei mir auch."}, {"id": 556, "start": 4561.7, "end": 4565.06, "text": "Also der Abstand zwischen den Klos ist bei uns ungefähr gleich."}, {"id": 557, "start": 4565.06, "end": 4571.06, "text": "Aber er schafft es irgendwie in 25 Sekunden bei sich zu gehen und ich halt nur in normal"}, {"id": 558, "start": 4571.06, "end": 4572.06, "text": "Zeit."}, {"id": 559, "start": 4572.06, "end": 4574.74, "text": "Oh, jetzt wird er gekickt."}, {"id": 560, "start": 4574.74, "end": 4575.74, "text": "Schreckt."}, {"id": 561, "start": 4575.74, "end": 4583.1, "text": "Massive schreckt."}, {"id": 562, "start": 4583.1, "end": 4584.1, "text": "Banane."}, {"id": 563, "start": 4584.1, "end": 4588.78, "text": "Was haben wir hier noch?"}, {"id": 564, "start": 4588.78, "end": 4593.54, "text": "Guck mal ein Ork."}, {"id": 565, "start": 4593.54, "end": 4596.38, "text": "Oh, ich seh da was, ich seh da was."}, {"id": 566, "start": 4596.38, "end": 4597.38, "text": "Achtung Leute."}, {"id": 567, "start": 4597.38, "end": 4598.38, "text": "Bam."}, {"id": 568, "start": 4598.38, "end": 4599.38, "text": "Oh, den hat's zerrissen."}, {"id": 569, "start": 4599.38, "end": 4602.38, "text": "Den hat's zerrissen."}, {"id": 570, "start": 4602.38, "end": 4609.9, "text": "Das finde ich halt an Source Games geil, dass die oftmals so Physik-Spielereien eingebaut"}, {"id": 571, "start": 4609.9, "end": 4610.9, "text": "haben."}, {"id": 572, "start": 4610.9, "end": 4611.9, "text": "Das ist ja mal ganz nice."}, {"id": 573, "start": 4611.9, "end": 4614.9, "text": "Sehr, sehr nice."}, {"id": 574, "start": 4614.9, "end": 4620.86, "text": "Vielleicht können wir ja mal so abplexen und wieder was erstellen."}, {"id": 575, "start": 4620.86, "end": 4631.14, "text": "Die Gegner sind gar nicht so blöd."}, {"id": 576, "start": 4631.14, "end": 4633.06, "text": "Die sehen einen wirklich schnell."}, {"id": 577, "start": 4633.06, "end": 4637.34, "text": "Du siehst mich nicht."}, {"id": 578, "start": 4637.34, "end": 4639.1, "text": "Du siehst mich nicht."}, {"id": 579, "start": 4639.1, "end": 4641.3, "text": "Du kannst mich nicht sehen, das ist ausgeschlossen, als du mich siehst."}, {"id": 580, "start": 4641.3, "end": 4642.3, "text": "Sehr gut."}, {"id": 581, "start": 4642.3, "end": 4643.3, "text": "Onni."}, {"id": 582, "start": 4643.3, "end": 4646.3, "text": "Fuck, hier kommt man gar nicht hoch."}, {"id": 583, "start": 4646.3, "end": 4647.3, "text": "Haha."}, {"id": 584, "start": 4647.3, "end": 4651.3, "text": "Oh nee, der ist runtergesprungen."}, {"id": 585, "start": 4651.3, "end": 4652.3, "text": "Fuck."}, {"id": 586, "start": 4652.3, "end": 4656.18, "text": "Geht fliegst du da rein?"}, {"id": 587, "start": 4656.18, "end": 4657.18, "text": "Ich will..."}, {"id": 588, "start": 4657.18, "end": 4659.38, "text": "Du sollst in die Stacheln fliegen."}, {"id": 589, "start": 4659.38, "end": 4660.38, "text": "Okay."}, {"id": 590, "start": 4660.38, "end": 4662.22, "text": "Dann wird er halt gemessert."}, {"id": 591, "start": 4662.22, "end": 4668.54, "text": "Er wird gemessert und er fliegt in die Stacheln, super."}, {"id": 592, "start": 4668.54, "end": 4669.54, "text": "Mehr geht ja gar nicht."}, {"id": 593, "start": 4669.54, "end": 4670.54, "text": "Oh nice."}, {"id": 594, "start": 4670.54, "end": 4671.54, "text": "Lauf hier rein."}, {"id": 595, "start": 4671.54, "end": 4672.54, "text": "Bam."}, {"id": 596, "start": 4672.54, "end": 4673.54, "text": "Fuck."}, {"id": 597, "start": 4673.54, "end": 4674.54, "text": "Oh, kommt der her."}, {"id": 598, "start": 4674.54, "end": 4675.54, "text": "Reinlaufen, reinlaufen, reinlaufen."}, {"id": 599, "start": 4675.54, "end": 4676.54, "text": "Jawoll."}, {"id": 600, "start": 4676.54, "end": 4677.54, "text": "Haha."}, {"id": 601, "start": 4677.54, "end": 4678.54, "text": "Direkt."}, {"id": 602, "start": 4678.54, "end": 4691.14, "text": "Will der lebt noch?"}, {"id": 603, "start": 4691.14, "end": 4693.14, "text": "Jetzt nicht mehr."}, {"id": 604, "start": 4693.14, "end": 4696.14, "text": "Ah, so nice."}, {"id": 605, "start": 4696.14, "end": 4698.18, "text": "Oh, der Parrot ist immer noch aktiv."}, {"id": 606, "start": 4698.18, "end": 4699.18, "text": "WTF."}, {"id": 607, "start": 4699.18, "end": 4703.22, "text": "Siehst du, das ist das Problem, wenn ich selbst das Overlay nicht sehe."}, {"id": 608, "start": 4703.22, "end": 4721.54, "text": "Komm her, Orc."}, {"id": 609, "start": 4721.54, "end": 4722.54, "text": "Jetzt fackelt er ab."}, {"id": 610, "start": 4722.54, "end": 4727.3, "text": "Wird fleißig Battlefield spielen am 9."}, {"id": 611, "start": 4727.3, "end": 4728.3, "text": "11?"}, {"id": 612, "start": 4728.3, "end": 4738.54, "text": "9. 11 wahrscheinlich nicht, aber es könnte tatsächlich sein, dass ich mir mal für 15"}, {"id": 613, "start": 4738.54, "end": 4745.74, "text": "Euro Premium, Premiere oder wie das heißt, hohle Origin Access und mir danach das Spiel"}, {"id": 614, "start": 4745.74, "end": 4748.54, "text": "nicht kaufe, wenn es mir nicht gefällt und Origin Access wieder abbestelle."}, {"id": 615, "start": 4748.54, "end": 4750.34, "text": "So spart man sich dann nämlich 60 Euro."}, {"id": 616, "start": 4750.34, "end": 4755.86, "text": "Auch wenn die A4 hat, einem das Geld damit irgendwie aus der Tasche zu ziehen, kann man"}, {"id": 617, "start": 4755.86, "end": 4757.26, "text": "es ja auch genau umgedreht benutzen."}, {"id": 618, "start": 4757.26, "end": 4766.42, "text": "Man kann es quasi so als bezahlte, unlimitierte Demo verwenden für den Monat und danach einfach"}, {"id": 619, "start": 4766.42, "end": 4770.02, "text": "wieder kündigen, deinstallieren, wenn man keinen Bock hat."}, {"id": 620, "start": 4770.02, "end": 4777.78, "text": "Im Endeffekt habe ich es ja mit Battlefield 1 äh, da ist kein Boden mehr, mit Battlefield"}, {"id": 621, "start": 4777.78, "end": 4778.78, "text": "1 ähnlich gemacht."}, {"id": 622, "start": 4778.78, "end": 4779.78, "text": "Wonka ist."}, {"id": 623, "start": 4779.78, "end": 4780.78, "text": "Wonka."}, {"id": 624, "start": 4780.78, "end": 4785.1, "text": "Ich dachte eigentlich, das fällt vor mir runter."}, {"id": 625, "start": 4785.1, "end": 4809.66, "text": "Ich schaue einfach nicht hin."}, {"id": 626, "start": 4809.66, "end": 4812.66, "text": "Easy."}, {"id": 627, "start": 4812.66, "end": 4827.62, "text": "Was haben wir da, den haben wir schon, Potions können wir immer gebrauchen."}, {"id": 628, "start": 4827.62, "end": 4830.62, "text": "Nice."}, {"id": 629, "start": 4830.62, "end": 4841.7, "text": "Hast du schon WF3 ausprobiert, ja, aber da war die Sauberdown und seitdem nicht mehr."}, {"id": 630, "start": 4841.7, "end": 4846.26, "text": "Ich habe mir das noch vor, das Spiel scheint nicht schlecht zu sein, weil sich die Zahlen"}, {"id": 631, "start": 4846.26, "end": 4847.82, "text": "auf Steam ganz gut halten."}, {"id": 632, "start": 4847.82, "end": 4850.54, "text": "Was immer dafür spricht, dass die Spiele ganz gut sind."}, {"id": 633, "start": 4850.54, "end": 4854.62, "text": "Wo sich die Leute teilweise schon darüber aufregen, habe ich letzte Woche gesehen, dass"}, {"id": 634, "start": 4854.62, "end": 4858.34, "text": "das mal wieder Entwickler sind, die halt absolut null anscheinend mit ihren Spielern kommunizieren."}, {"id": 635, "start": 4858.34, "end": 4860.34, "text": "Das finde ich immer blöd."}, {"id": 636, "start": 4860.34, "end": 4862.82, "text": "Man weiß nicht, ich denke mir immer, wenn man es schon Early Access macht."}, {"id": 637, "start": 4862.82, "end": 4867.7, "text": "Also wir versetzen uns jetzt mal in die Lage von einem Spielehersteller und ich entscheide"}, {"id": 638, "start": 4867.7, "end": 4873.54, "text": "mich dazu Early Access zu machen, allerdings im gleichen Zeitraum zu sagen, ich höre nicht"}, {"id": 639, "start": 4873.54, "end": 4878.42, "text": "auf das Feedback, beziehungsweise ich kommuniziere nicht mit meinen Spielern, ich finde das ist"}, {"id": 640, "start": 4878.42, "end": 4883.02, "text": "irgendwie kontraproduktiv, also sprich, wenn man Early Access macht und die Leute quasi"}, {"id": 641, "start": 4883.02, "end": 4898.46, "text": "schon mehr oder weniger..."}]}