{"text": "NajaNoch keiner daWie kann das seinWo sind die Subbox CamperLul wehWub lulFestgestellt, dass ich meinenOverlays auch gar nicht gestartet habeUnd KSOk SIch habe mir ein neues Mikrofon gekauftZum Aufnehmen von Technik VideosVielleicht probieren wir das nachher mal ausAktuell bin ich ganz normalÜber meine Zeit am StartClani am Start, Silent Pain am StartAja jaKannst du ein gutes Auto Interface empfehlen?Ich kenne mich da nicht so gut ausIch kann dir nur sagen welches ich habeUnd welches ich schon seit 8 Jahren oder so verwendeOhne jegliche ProblemeAber das ist zu teuerGibt es glaube ich auch gar nicht mehrDas ist zu teuer für einfach soDas ist natürlich geilWenn man verschiedene Sachen anschließen willWenn man eine Konsole anschließen will2 PCs anschließen willXLR Eingänge ein paar braucheUnd optische Eingänge brauche oder soDa ist das ganz niceAber für einfach nur ein Mikrofon anschließenUnd ein bisschen was natürlich zu teuerAber das ist das einzige Audio Interface was ich je hatteUnd das habe ich jetzt schon 8 Jahre langUnd ist wirklich richtig gut das DingIst halt viel zu teuerFür ein bisschen sowasAlso ich meine 440 EuroDas war damals noch ein Ticken teurerAber die positive Bewertung finde ich sprechend für sichDas schöne daran istDu hast ein Audio Knöpfchen vorne dranWo du verschiedene Funktionen lauter, leiserEingabequellen durchschalten kannstDu hast die EingabeHier vorne die InputsUnd hinten hast du noch mal so ein Breakout KabelWo dann im EndeffektIch weiß nicht ob sie dein Bild dabei habenWo du glaube ich 16 Sachen anschließen kannstIch weiß nicht ob die hier die Bilder habenMit dem Breakout KabelAber hier guckDa hast du glaube ich 4 XLR AnschlüsseDu hast ein paar fette KlinkendingerDu hast sogar so ein MIDI InterfaceDas was man wahrscheinlich bloß noch als Keyboard Spieler brauchtKeine AhnungDas ist wirklich niceDas ist wirklich niceTheoretisch kannst du sogar ein paar Firewire anschließenFalls das irgendjemand im Jahr 2019 noch haben willAber das ist wirklich gutDu kannst dir ja unten mal deinen Zettel verlinken mit Amazon vorstellenDas hatte ich früherHatte auch Fettkohle gebrachtIch war zu faul es zu aktualisierenDeswegenSchreibe ich mir gleich mal aufMuss ich mal wieder machenWeil Amazon Ref links bringen passivübelst viel Kohle. Doch doch das hat 6,3 mm Klinkeanschlüsse, 2 Stück, 3,5 mm Klinkeanschlüsse,2 Stück vorne und hier am Breakout Kabel hast du auch noch ein paar. Du hast Inputs hastdu wirklich mehr als genug und das beste ist, du hast sogar, du hast sogar einen optischenInput, der entweder, wie heißt das, dieses normale SPDIF oder so kann, oder kann sogarADAT mit 8 Channels, 6 Channels und so was und du kannst sogar durchschleifen in undout. Also das hat alles, das hat wirklich alles, was man irgendwie braucht. Es kostetein bisschen was und ich kann jetzt nicht sagen, ob es das beste ist oder sonst was,es hat sogar noch Firewire Anschluss. Hier vorne kannst du die Mikros umschalten. Alsodas Gesamtpaket fand ich das damals super und ich bin bis heute davon überzeugt. Alsoder Kauf, der hat sich wirklich mal gelohnt. Das geht seit 8 Jahren oder so schon ohneProbleme das Ding. Ja aber das mit Amazon verlinken, das mache ich dann mal so, malgucken. Ja und nachher, wenn im Stream alle da sind, wir können mal, ich habe mir für,ich habe mir ein Mikro gekauft für, ist nichts dolles, ja, siehst du auch schon, dass eseinen Klinkeanschluss hat, aber der Hersteller ist ganz gut, von dem habe ich schon so einMikrofon für Interviews oder so, nicht dass ich oft Interviews mache oder so. Aber ichhabe mir mal ein Mikrofon gekauft, was ein bisschen Kabel hat, was ich an meinen ZoomAudio Recorder anschließen kann für, wenn ich Technikvideos aufnehme. Also sprich, wennich dann wieder am Tisch stehe und ein bisschen rumlabern und so was, weil der Sound, derSound beim letzten Video war jetzt ja schon nicht so toll. Stimmt, Max, ich glaube duhast Recht, der muss glaube ich sogar Klinke haben, weil die Stromversorgung nur darübergescheit funktioniert, die brauchen ja nur ganz wenig, aber sie brauchen Strom. Ichglaube die müssen, ich glaube die müssen sogar Klinke haben. Ja, weil der Sound hierwar ja nicht sonderlich gut, ne, der Sound ist schon, es halt sehr, weil das halt im Wohnzimmerunten aufgenommen ist und ich habe es zwar mit dem Audio Recorder aufgenommen, ich habees mit dem Audio Recorder und der Kamera gleichzeitig aufgenommen, aber es halt halt einfach imRaum. Soll ich das Mikrofon mal auspacken und ranstecken, wollen wir mal ausprobierenwie sich das anhört? Kann das ja einfach mal ranstecken, wir können das mal ausprobieren.Ja, mach mal, ok, ich probiere das mal aus, frisch verpackt von Amazon, kommen wir hier,ok, jetzt haben wir Unboxing. Wo habe ich denn jetzt dagegen geschmissen, ich habe einfachgesagt, ich muss es mal aufmachen. Ok, das ist schon mal ganz cool verpackt, ist in soeinem Beutel drin, ist so ein komisches Salz dabei, was kein Mensch braucht, eigentlichsollte angeblich auch ein Headset-Bügel dabei sein, aber ist nicht, oder? Hä, ich dachte,da soll so ein Bügel dabei sein, guckt mal. Ich glaube, das ist, ach ne, das ist, da istnicht dabei, das ist quasi, das ist wie bei Essens-Serviervorschlag. Ok, ich probieredas jetzt mal aus, also hier ist so ein Klippse, hier ist so ein Klippse dabei, ich probiere,ich mache mir das jetzt mal als T-Shirt hier dran und dann stöpsel ich es mal um und wirprobieren das aus. Warning, haha, das ist ja geil, ich weiß nicht, sieht man hier irgendwoauf dem Ding? Ey, da ist, da ist ein Mikrofon, das sieht so aus, nur das hier, das hier einWarning dran ist, Warning, Strangulation Hazard, also Achtung, dass ich mich nicht damit erhängemit dem Kabel. Strangulation Hazard. This cable contains Kevlar and has the potential risk ofcausing strangulation. Avoid looping the cable around the neck and keep out of reach of children.Gut, das musste jetzt mal gesagt werden. Also Leute, hofft mal, dass ich mich nicht erwürgemit dem Kabel jetzt irgendwie, ne, also man kann ja alles passieren. Auf der Rückseitevon Tastaturen steht auch, dass das Verwenden einer Tastatur zu schweren gesundheitlichenSchäden führen kann. Just ma, Stufe 2, nein Stufe 1, abonniert drei Monate, Dankeschön,Vollgas, Alter. Moment, stimmt gar nicht, gar kein Prime. IQ steigt wieder ins unermesslichehier. So, ok, also, machen wir das mal auseinander. Das Kabel ist leider nicht ganz so lang, wieich gedacht habe, aber das ist nicht schlimm, weil so eine Klinkeverlängerung ist nur wirklichkein, kein Ding. Drei Monate? Zwei Monate, ja. Ok, so, jetzt muss man hier irgendwie den,wie funktioniert denn das? Wie macht man das da dran? Wie macht man das da jetzt? Fack,wie macht man das da rein? Da ist irgendeine komische Schleife drin, da muss man das Mikroglaube ich so rein, reinstelzen irgendwie, dass es hält. Hab ich auch immer das funktioniert?Äh, keine Ahnung, vielleicht mach ich das jetzt kaputt. Fest ist das da jetzt abernicht drin. Sack voll, es waggelt. Wie macht man das? Wie, wie macht man das? So, Achtung,wo ist das? Ah hier, da steht sogar alles dabei, wie es funktioniert. Ah, ganz andersfunktioniert es, als wie ich es gemacht habe. Ich hab's verkackt. Hab das falsch rum, falschrum dran gemacht. So, ich muss das eigentlich, das kommt da oben durch, das kommt da obendurch, aha. Ihr seht doch mal, ich bin schon überfordert mit so einem poplichen Mikrofon.Außerdem hat sich das Kabel verknotet, wie kann sich das Kabel, also Leute, wie kannsich das Kabel verknoten? Ich hab das Kabel gerade aus der Packung gemacht, das ist eigentlichgar nicht möglich. Ok, jetzt hab ich's, jetzt hab ich's. Jetzt ist dran. Ok, ich stöpseldas jetzt mal dran hier an mich. So, ich hör mich jetzt halt, also ich hör mich jetzthalt selbst nicht, ich stöpsel mich jetzt mal um. Wie mach ich denn das jetzt am besten?Ich stöpsel mich jetzt mal um, mach ich hier vorne mal ans T-Shirt. Also ich hör michjetzt selbst, es kann sein, dass es übelst zu laut ist oder übelst zu leise oder so,das müssen wir jetzt mal ausprobieren, also haltet euch mal die Ohren zu.Äh, es geht nicht, oder? Es hat nicht funktioniert. Ha. Ok.Ok, wir machen noch mal was, ich hab nämlich ne Idee. Es könnte sein, dass es einfach megaleise war und mein Noise Gate nicht. Ich mach mal kurz das Noise Gate aus. Das heißt,ihr hört jetzt wirklich jeden Mist, egal wie leise ich laber oder nicht. So, ich stöpseldas nochmal an, weil den Ein- und Ausschalter hat es nicht.Ok, ich mach mal kurz das Noise Gate aus, weil den Ein- und Ausschalter hat es nicht.Da hat jetzt nichts getan irgendwie, oder? Ha. Ska-Mast, ha? Knack-Knack.Ist das, bin ich Ska-Mast worden, oder? Das geht nicht am PC? Das muss, ich probieres jetzt mal an meinem Audiorecorder aus. Ich stöpsel es mal schnell an meinen Audiorecorder,da muss es eigentlich funktionieren. So. Ok, ich stöpsel es mal an meinem Audiorecorder,da muss es eigentlich funktionieren. Was soll das, warum geht das nicht? Hm, war jetztzwar so nicht geplant, aber. So. Macht es irgendwas? Blub, blub, blub. Test, Test, Test,Test, Test, Nö. Ja, Leute. Hm. Ich hab ehrlich gesagt keine Ahnung, warum das nicht funktioniert.Ist aber doof. Ja, aber sag mal, so in meinem Audiointerface sollte es doch eigentlich funktionieren.Hm. Ok, keine Ahnung. Naja, muss ich nachher mal ausprobieren, muss ich jetzt ja nichton stream machen. Ist ja nicht nötig, aber ich hab jetzt gedacht, mich schließt dasda voran und gut ist. Aber anscheinend ist die Sache wieder deutlich komplexer als mansich das vorstellt. So ein Mikro einfach in, so ein Mikrofon einfach in Eingang stöpseln,das geht ja nicht. Naja, gut. Hm. Keine Ahnung, was soll das, was soll das, was soll das,was soll das, was soll das, was soll das, was soll das, was soll das. Keine Ahnung, alsowarum das nicht funktioniert, vielleicht. Also, das. China Adapter bestellen, genau,deswegen hab ich schon Aliexpress auf. Das ist ja jetzt aber merkwürdig. Man brauchtda nen fucking Adapter für. Man braucht wirklich nen Adapter dafür, dass ich das am PC verwendenkann. Was ist denn das für ein Crap? Ach, vielleicht kann ichs mit der Cam. Warum gehtdas mit meinem Audiorecorder nicht, das fuckt mich jetzt übelst ab. Naja, gut, ähm. Wohab ich denn den Audiorecorder überhaupt hingeschmissen? Geht euch das teilweise auch so, dass ihrDinge in der Hand hattet und dann macht ihr was anderes und legt das kurz weg und dannseht ihrs nicht mehr. Das ist richtig MonkaS. Weit, es kann doch nicht weit sein. Ach, daist es. Hab's auf die Erde gelegt, ne, beim Schreibtisch. Lest mal bei Amazon die ersteFrage. Aha. Rode TRS auf TRS. Oh ne, dafür brauch ich jetzt echt noch mal nen extra Adapter?Das ist aber doof. Das ist aber doof. Ich hab noch nen Rode, ich hab noch nen Rode XLRAdapter. Ob das damit funktioniert? Das ist nen 3,5mm Klinke auf XLR Adapter. Das könnenwir mal ausprobieren, ob das damit funktioniert. Wahrscheinlich ist das Mikrofon RIP danachoder so. Aber das wird wahrscheinlich auch nicht funktionieren, wenn die Pins nichtda sind. Ah ja. So, angestöpselt ist es, aber macht gar nix. Na geil. Ok Leute, RIP, dannhalt nicht. Dann bring ich das jetzt mal wieder weg. Dann probieren wir das jetzt nicht aus.Das wäre eigentlich ne coole Sache. Ich hab mir mal vor ein paar Jahren so nen Funk-Mikrofon-Dingbei Toman gekauft, allerdings ging mir das immer auf den Keks mit Batterien und sowas.Ich will einfach meinen Audio-Recorder neben mich legen und gut is. Kosten dieser komischeAdapter hier. Ey, 3,5mm auf AR45, also ich bin eher dafür 3,5mm auf Gartenschlauch. Kostender Adapter 10 Euro. Ist das nicht euer Ernst? What the fuck? Das ist doch nix Rode-spezifisches,das ist doch wahrscheinlich so ein ganz publischer, das kann doch nicht sein, Aliexpress. Ups,nein, ich hab es so chinesisch umgestellt. Fuck, wie stelle ich es wieder zurück? Ja,sowas da, das ist doch schon mal gut hier, aber das ist das falsche. Das ist genormt,das denke ich auch. Egal, ich schmeiß jetzt das Mikrofon und den Adapter mal in die Ecke.Enttäuschend Leute, enttäuschend. Das ist Windwacke, oder? Tickenlauter gehört dieMusik schon mal. Okay, naja, dann hat sich das zumindest schon mal erledigt. Das funktioniertnicht, wie ich mir das gedacht hab. Also Leute, ich hab heute gar nix spezielles, oh was gehtdenn jetzt im Chat ab? Ich erkenne nicht, was das sein soll. Irgendein Tintenfisch, ichhab keine Ahnung, was das sein soll. Gut, das brauchen wir nicht, weg, weg, weg, weg,weg. Wir probieren es zwar im Stream aus, aber hat natürlich nicht funktioniert. Ganztoll. Hab ich irgendwelche Fragen im Chat eigentlich übersehen? Gehen wir mal auf Amazon, ja, aberda haben wir uns ja gerade schon angeguckt. Und wisst ihr, was das witzige ist? Ich habjetzt ja das neue iPhone aufgenötigt bekommen, es hat gar kein Klinkgestecker mehr dafür.Beste Programmiersprache deiner Meinung nach? Das kommt immer auf den Anwendungszweck an.Ja, nur noch Bluetooth Kopfhörer oder die neue Apple Kopfhörer, die haben jetzt einenLightning Anschluss. So was Beknacktes, Alter. Das wisst ihr, was ich nicht verstehe? Alsoich hab ja hier jetzt das, den Brocken hier, das XR. Und wer da allen Ernstes erzählt,da war kein Platz mehr, den Klinkeanschluss dran zu machen, der ist echt nicht mehr ganzdicht. Das ist das fetteste Stück, was man so in der Hose haben kann, also, also Smartphone.Das ist ein riesen fettes Teil, das XR, da wäre Platz gewesen für 75 Klinkeanschlüsse,aber nicht bei Apple. Ascii Spam, sind wir im Jahr 2001 oder was? Oh, Subs, ich hab wasübersehen. Der Karlsson Twitch Prime, 3 Monate, Dankeschön, Poggers. Komisch. Istauch bei allen Geräten so, das macht es nicht besser, wenn das bei allen Geräten so ist.Also auf den Klinkeanschluss zu verzichten ist einfach ultrabeknackt, weil ich mein,einen digital analoge Konverter braucht man eh schon, das Ding hat Lautsprecher, das gehtnicht ohne. Machst du mit dem Server weiter? Das weiß ich noch nicht genau. Könnten wireigentlich machen, ich weiß noch nicht so genau, was ich machen will, ehrlich gesagt.Ich hab jetzt nichts Spezielles vor, ich hab einfach mal Streben angemacht, sonst nichts.Wir können uns auch mal wieder ein paar Stellenanzeigen angucken, was es da interessantes gibt. Wiegesagt, ich gucke ja immer mal wieder, also eigentlich nur zur allgemeinen Belustigung.Hat was mit Wasserfestigkeit, tut uns die Klinke weglassen, dass halt, also ja ich glaubdir, dass die das sagen, aber die Geräte vorher sind auch nicht abgesoffen und tauchenwill mit seinem Smart Follower kaum einer. Ne, ich glaube das ist so ein Ding, Apple hatangefangen und die anderen machen es nach, weil. Kannst deinen Abfallsaal richten. Waswird hier so getrieben, ja das ist noch nicht so ganz raus. Ich wollte gerade mal ein neuesMikro testen, was ich mir für Technikvideos gekauft hab, aber festgestellt, es geht amPC nicht. Natürlich doof gewesen. Ich kann es mal an meiner Kamera ausbringen, vielleichtfunktioniert es daran. Samsung kriegt das auch mit Klinke hin, ok. Schau das FortniteEvent an. Ist das Fortnite Event das mit diesem schwarzen Loch? Das muss mir irgendjemand erklären,das hab ich nicht gecheckt. Das hab ich nicht gecheckt. Was ist das überhaupt? Gibt's dain game ein schwarzes Loch und irgendwo erscheinen Zahlen oder so, ne? Ich hab's null gecheckt,aber ich meine ich spiele auch kein Fortnite, deswegen weiß ich das wahrscheinlich. AlsFortnite Fan wüsste ich das wahrscheinlich sofort, ja. Did Fortnite really get deleted?Aha, tja. Grip Fortnite. Fortnite wurde gelöscht, wenn das Google sagt. Welche Kamera hast du,äh, irgendeinen Sony Teil? Ich weiß nicht welche, genau. Aber die reicht. Holst du dirModern Warfare? Ja, klar. Also ich hoffe ich krieg's. Ob ich mir holen werde, weiß ichnicht. Ob ich mir holen würde, weiß ich nicht. Aber wenn ich's kriege, nehm ich's. Die Sacheist nämlich die, ich gehe nämlich davon aus, dieses Jahr, dass Modern Warfare ganz ok werdenwird. Rein vom gametechnischen her. Es hat ein paar Dinge, die mir auf den Sack gehen,aber ich glaube an sich wird's ok. Aber die werden ihr Game komplett durch irgendwelcheLootboxkacke wieder zerstören. Ich mein, sie haben zwar vorher erst einen Tweet irgendwieabgesetzt, dass es, dass keiner bei Infinity Ward überhaupt an einem Lootbox und SupplyDrop System arbeitet, aber ehrlich gesagt, wer glaubt diesem Blödsinn, den die erzählen,ne? Ähm, ich erinnere mal eine Sache, der hat wortwörtlich gesagt zu Modern Warfare3, Last Stand ist nicht im Spiel. Fuck you Last Stand. Da erinnert sich dann noch einerdran. Dann kam das Game raus und hatte Last Stand drinne. Hieß halt anders. So, das heißtjetzt auch anders. Ähm, und natürlich ist das wieder im Game drinne. Oder aber, siearbeiten nicht dran, weil sie müssen nicht mehr dran arbeiten, weil das ist schon fertig.Alles beknackt. Totaler Blödsinn. Einfach nur die Leute skammarst, ist das. Ein ShowMe hat Klinke. Ja, ich verstehe das auch nicht, warum die es nicht hinkriegen. Hach ja, PS4exklusiv. Das ist auch so ein Ding, was mich ankotzt, ne? Diese PS-, also ich mein, dassman ne Woche exklusive Sachen hat, vielleicht sogar nen Monat bei manchen Sachen, kann ichja nachvollziehen. Aber nen Bestandteil des Games für ein Jahr Exklusivität ist bescheuert.Gibt's da eigentlich was Neues dazu? Ist da eigentlich jetzt was Neues zu mittlerweile?Ne, das ist halt einfach so, ne? Ich mein, überlegt euch mal, es ist 2020, es kommt dannirgendwie, keine Ahnung, Black Ops, äh, Black Ops Prequel oder irgendwie sowas raus. Undworauf wird man 2020 mehr abgehen? Oder was wird man, was wird man Oktober 2020 sagen?Wird man sagen, yeah, Call of Duty 2020 kommt raus? Oder, yeah, ich kann jetzt endlich denModern Warfare, äh, äh, äh, äh, Dickens Back Ops Modus spielen. Sagt doch keiner.an. Wub wub. Das ist, der Modus der exklusiv ist, ist dieser Spec Ops Modus aus MW3, oderSurvival, Survival, genau. Da hat man, das, das, ah fuck. Das ist auf den MultiplayerMaps gegen Bots im Endeffekt. Es ist quasi Zombies, ohne Zombies zu sein, nur in schlechterauf Multiplayer Maps. Also eigentlich nichts, was man wirklich vermisst, aber es ist beknackt,dass es ein Ja exklusiv ist. Das ist, also es ist schon ein, sag mal mal ein relativgroßer Bestandteil irgendwo. Also so von dieser Sache, was sie da erzählen, das machtmal, das macht 0,1% aus oder so, was sie da erzählt haben, ist natürlich totaler Blödsinn.Das ist, wie wenn man sagt, Zombies macht nur 1% aus. Genau, das Survival Modus kommtja später. Das Spec Ops Missions Modus, der kommt ja, das ist auch das, das ist das,was ich persönlich auch cool fand, bei MW2 und 3. MW2 habe ich mit dem Frisör richtiggerne die Co-Op Spec Ops Mission gespielt. Aber ansonsten kennt noch einer die, kenntnoch einer die AC130 Mission aus MW2, also die Spec Ops Mission. Da musste ein Spieler,da hat ein Spieler hier AC130 und ein Spieler war auf der Erde und wenn ein Spieler gestorbenist, war vorbei. Das war eigentlich ziemlich cool für Co-Op. Das war eigentlich ziemlichcool. Ich meine, das hat einen kleinen Teil vom Game aus gemacht, aber es war doch dennoch,es war das echt ein cooler Teil. Ich finde, eh in MW2 haben sie damals richtig, richtigviel Zeug reingestopft. Da war für jeden irgendwas dabei. Ah, Lukizu, ich finde, Flag Ops 1 warder beste. Wie teuer ist es eigentlich, den Nass zu bauen, fällt mir gerade so ein, nurmit SSDs. Sagen wir mal, ich will einen, keine Ahnung, wir gucken einfach mal, was, was fürTerabyte SSDs gerade kosten. Ok, das ist schon ganz schön teuer. Ups, das ist schon ganzschön teuer. Ich meine, ist ja bald Black Friday. Ja, aber da haben die die guten Sachenhier nicht. Also ich meine, mit den Covo-Dingern geht es noch irgendwie, wobei die halt performancemäßignicht so gut sind wie die und theoretisch auch schneller kaputt gehen, aber da würdeich mir keine Gedanken machen. Stell es doch mal Mindfactory zusammen. Es geht doch haltdarum, was die Platten kosten, also was die SSDs kosten. Also 4 Terabyte SSDs sind schonecht teuer. Die sind schon ganz schön teuer. Also ich glaube nicht, dass ich das in nächsterZeit machen kann. Eigentlich bräuchte es ja auch 8, gibt es schon 8 Terabyte, gibt esschon 8 Terabyte SSDs? Nein, 4 Terabyte ist das größte. Na gut. 4 mal 1 Terabyte in Rate0, das wäre wahrscheinlich billiger, ja. Aber ich habe daran gedacht, dass man beispielsweiseeinen Rate 1 machen könnte aus 8 Terabyte SSDs, aber es gibt ja gar keine 8 TerabyteSSDs. Oder man macht einen Rate 1 aus 4 Terabyte SSDs, da hat man so nur 4 Terabyte Speicher,aber ziemlich schnell lesen. Gibt es 4 Terabyte NVMe? Ok, ne, da ist 2 Terabyte das größte.Ach Mensch, das wäre nice, wenn ich einfach 5 SSDs in den Sauber klatscht, braucht keinenStrom, ist saumäßig schnell. Problem ist auch, ist saumäßig teuer. Ja ich weiß, klares gibt große SSDs, aber das sind halt keine Consumer-Dinger, die sind halt übelst teuer.Nichtschenk geblieben. Was kommen eigentlich noch für Games jetzt raus? Was kommen jetzteigentlich noch für Games raus? Also jetzt so. Upcoming. Gibt es da eine schöne Übersicht?Ach Cyberpunk, kommt Cyberpunk schon raus? Oktober, also was kommt denn hier noch allesInteressantes? Das wollte ich mir mal angucken. Das ist so ein bisschen RPG-mäßiges Rumgestellte,das könnte sogar ganz nett sein. Outerlands? Ist Outerlands dieser Fallout 4 Verschnitt?Ne, das ist was anderes. Wie hieß das? Wie hieß dieses Fallout-Ding? Scheiß vergessen.Overwatch-Legend für die Switch, Alter. Der Switcher ist mittlerweile auch auf der Switchangekommen. Nicht mal der Witcher, sondern der Switcher. Zombieladen braucht kein Mensch,aber das braucht auch keiner. Blablabla, das ist irgendwie nicht sonderlich spannend,was da rauskommt. LittleBigWorkshop, hat das was mit LittleBigPlanet zu tun? Ne, kann'snicht sein, weil wenn's auf der PS4 rauskommt, äh wenn's auf dem PC rauskommt, kann'snicht kein LittleBigPlanet sein. Ach, Outer Wilds, nicht Outer Worlds, das haben sie michdebatet, ja. Alles nicht so interessant. Apex Legends, Bloodhorn. Warum ist Apex eigentlichso abgekackt an Viewerzahlen? Das versteh ich nicht. Ich mein, guckt euch das. Ok,jetzt Streams, gerade die zwei größten, dieses Stream. Ja ok, jetzt ist das an Viewerzahlenziemlich gut. Ähm, aber normalerweise, wenn man sich das anguckt, ist, ich mein, es gucken475 Leute irgendwie in einem schwarzen Loch zu. Fuck. Ich will Viewers. Also Apex guckengerade richtig viel, aber die letzten Monate war Apex richtig am abkacken. Ähm, ist fürmich immer noch so mit das beste Battle Royale Game, ohne dass ich Battle Royale spiele.Das ist eigentlich, aber so rein vom Gucken her, gefällt mir, gefällt mir Apex eigentlicham besten. Moin, Soldier 5084. Ganz schön teuer. Ganz schön, ganz schön teuer hier dieganzen SSD-Geschichten, das kann man vergessen. So, was kommt denn sonst noch so? So, dasnächstes, was mich interessiert, kommt World of Warfare raus. 25. Oktober, dauert nichtmal lang. Übernächste Woche Freitag. Rest juckt mich nicht. Ach, hier kommt das. Pre-Order.Das kommt auch am 25. Oktober raus, ok. Disney Classic Games Aladdin. Nein, juckt mich nicht.Resident Evil 5, Resident Evil 6, nochmal für die Switch. Die Switch ist so die Remake-Tonneirgendwie, wo alle noch mal, alle Spiele von allen letzten Generationen jetzt nochmal aufder Switch rausbringen. Richtig. Ach, Death Stranding kommt ja am, stimmt das Game kommtja schon raus. Death Stranding ist bei mir im Kopf ein Game, wo es einmal im Jahr verwirrendeTrailer gibt und das Spiel nie erscheint. Aber ist ja gar nicht so, das kommt jetztja raus. Da bin ich gespannt drauf, da bin ich gespannt drauf. Es kommt Dreaded Redemptionfür den PC. Ich sag jetzt mal was Kontroverses, ja, geht mir am Arsch vorbei. Juckt mich,juckt mich überhaupt nicht. Aber ich hab schon öfters gesagt, ich bin einfach nicht der,nicht der große Open World Spiele Spieler. Ich gehe davon aus, dass sie eine ganz guteStory haben, das kriegen die eigentlich immer hin bei Rockstar. Aber ich bin einfach keingroßer Fan von Open World Spielen. Deswegen, das einzige auf, magst du GTA? Nö mag ichauch nicht. Das einzige Open World Spiel, was mir wirklich sehr gut gefallen hat, wasrichtig Open World war, also neuere Open World Games. Das einzige richtige Open World Game,was mir gefallen hat, war der Witcher. Also drei, die anderen, die eins und zwei warenja keine Open World. Witcher 3 hat mir richtig gut gefallen, aber auch nicht unbedingt derOpen World Aspekt, sondern die Main Kampagne war richtig gut, die DLC-Story war richtiggut und was bei Witcher 3 wirklich auch gut war, ist, dass die ganzen Quests, die irgendwiein der Welt verteilt waren, zum größten Teilen auch halbwegs interessant waren, zumgrößten Teil, ja nicht alle. Aber es gab schon ein paar ganz coole Sachen, die eineda mit dem Werwolf, kann mich auch irgendwie an so eine Quest erinnern, wo die Freundindann zum Werwolf wurde oder der Freund zum Werwolf, irgendwie sowas. Aber das war schonokay, ja. Den richtigen, diesen richtigen Open World Aspekt daran haben wir nicht gebrauchtund ich finde auch, dass die Witcher Open World so ein bisschen, zumindest in den Dörfernso ein bisschen, ein bisschen unfertig gewirkt hat. Die Leute standen da halt rum, die hattenihre drei Sprüche, die haben im Prinzip nichts großartig gemacht und es hat sich jetzt auchnicht irgendwie angefühlt, als reitet man da durch den Dorf durch. Was halt richtiggeil gemacht von Witcher 3 waren die größeren Städte. Das war halt ebenso, er quennt auch,ja. Das war halt übelst geil. Naja, aber. Hallo Max, endlich mal ein Livestream von dir,sehe nach sieben oder acht Jahren YouTube. Aber ja, nice. Ja, hast du halt, aber eigentlichsind übelst langweilig den Livestream erwischt, weil ich hab keine Ahnung, was wir genau machen.Wir schwätzen einfach. Also ihr könnt mich alles fragen, was ihr fragen wollt, dass wirGesprächs, Gesprächsstoff haben, ja. Es gibt jetzt irgendeine Free to Play Version von Pupke mitminimaler Grafik. Solltet ihr nicht mal drauf gucken, dass ihr Game überhaupt richtig läuft.Ey Leute, ich hab letztens wieder. Ich hab letztens wieder mal zehn Minuten. Das könntedas gewesen sein, das könnte das hier sogar gewesen sein. Ich hab letztens mal wieder zehnMinuten von irgendeinem PUBG Pupke Cup geguckt, ne. Kann sein, als es das war. War das jetztirgendwie erst vor ein paar Tagen? Dann ist was anderes. Zumindest, ich sag euch Leute,ähm, übelst langweilig. Also das ist echt kein eSport Game. Pupke eSport, es ist so langweilig.Da gewinnt das Team am Ende mit zwei Kills. Die spawnen, liegen rum, hoffen, dass der Circleirgendwie an der richtigen Stelle kommt. Und, ähm, campen dann weiter rum. Und am Ende killen sichdann die Leute gegenseitig und ein Team campt weiter. Und das killt dann die letzten zweiLeute und hat gewonnen. Ganz merkwürdig. Wie hast du eigentlich Internet, wenn du Unity Mediahast, wie so funktioniert doch wunderbar. Gehts?Ähm, das würde ich dann eher mathematisch angehen. Ich würde mir die Menge der Haare angucken und,ähm, dann kannst du einfach eine Menge an Haaren bilden, die weiß sind und eine Menge an Haarenbilden, die schwarz sind. Und dann musst du das gar nicht, ähm, so beantworten. Oder hasttrotzdem die Antwort. Schon mal Kaffee gegessen? Ähm, nee. Keine Ahnung. Also nicht wissentlich.Also nicht wissentlich aus irgendeiner Dose oder so. Und was ist mit Milka Kühen? Die sind CGIalt mittlerweile. Weil die Kühe nicht mehr einfärben dürfen. Schau mal StreamPie angeschaut, nö.Was ist das? Was ist StreamPie? Wo soll man Link schicken? Benutzt du einfach nur LibreOffice?Ich benutze gar kein Office. Ach, das kenne ich. Das kenne ich, das Video, Patrick. Ich benutzegar kein Office. Ich habe LibreOffice installiert, aber verwenden tue ich es nicht. Hehehe. Abstörungbei Unity Media. Stream läuft aber seit Aufruf. Also, ich habe Unity Media geflamed auf Twitterund ich habe jetzt DualStack Lite gekriegt, auch wenn sie mich da wieder ein bisschen gescampthaben bei der ganzen Geschichte. Aber es funktioniert jetzt und ich mache da auch nichts mehr, allesgut. Apex ist mega hype in den USA, aber sonst nirgends, okay. Ich wollte das auch malspielen. Vielleicht ist das echt ein Game für mich. Hast du den neuen Film Joker gesehen?Nein. Gibt es ihn denn schon auf einschlägigen Sicherheitskopie? Gibt es ihn schon als Sicherheitskopieirgendwo? Nein, Oldrade HC2 ist wirklich der günstige Optacore Einplatinencomputer. Ja,und vor allem, der ist schon 3 Jahre alt oder so. Ich habe jetzt ja das Teil hier drübenstehen als TV-Server, den da mit Platte drin und das funktioniert wunderbar. Das funktioniertecht richtig gut, viel besser als ich gedacht habe. Einfach hier eine USB-Dual-Tuner dran,2TB WD-Green-Platte eingesteckt, die ich noch da hatte. Wir haben es ja im Stream gemacht.Fertig, easy, läuft wunderbar. Yeratiel, warum bist du ein Jahr offline? Wenn du gekündigthast, kannst du einfach einen neuen Vertrag abschließen. Wie ist das jetzt in Apex? Hates jetzt einen Solo-Modus? Wobei ich sagen muss, ich finde, irgendwie macht es das Gameja auch schon ein bisschen aus, dass es eben Trio ist. Das ist ja auch mit den Flagen undRespawn ein bisschen drauf ausgelegt. Ab jetzt auf dem Pi Zero TV hat er ein installiertDVPC. Ja, das ist richtig nice. Ich meine, ich habe es auf der Kiste, die ist eine ganzeEcke stärker als den Raspberry Pi Zero. Zero ist ja ein ARM V6 Single Core. Der RaspberryZero hat halt nix im Endeffekt. Da ist der hier schon ein bisschen schneller. Und derläuft, läuft echt gut. Gab es eigentlich schon ein Update zu Fiverr? Ja, ist alles fertigseit einem Monat schon. Ich habe bloß immer noch das Video nicht gemacht. Fiverr ist seiteinem Monat schon fertig. Also einer hat was geliefert, das taugt eigentlich nicht wirklichwas und die anderen wollten mehr Geld oder haben abgesagt oder haben gesagt, sie könnenes nicht mehr haben. Wie hielst du beim O-Trill mit AES aus? Ganz okay. Ich glaube, der hattheoretisch Krypto Extensions, aber ich weiß nicht, ob das aktiviert ist, ob das funktioniert.Das müsste man mal ausprobieren. Können wir jetzt mal, könnte ich jetzt eigentlichmachen? Machen wir mal Vmware an. Ich gucke mal, wie schnell das geht. Ich muss nur malnachgucken, wie das funktioniert hat. Ach das, okay, das ist cool. Das muss ich mir malangucken. Eine robuste Alternative zum Elgato Stream Deck. Also im Prinzip hat einer meinMeme Board genommen und hat das mal ordentlich gebaut. Hast du eigentlich mal Zertifikatewie C10A gemacht? Ja, aber das ist schon ewig ausgelaufen. Das gucken wir uns jetzt malan. Was kann das denn? Raspberry Pi? Was macht das denn? Features. Wie das ist alles?Wie wäre es mit Screenshots? Okay, wir gucken uns mal das Video an. Warum gibt es kein DonationButton, weil Tippy Stream irgendwie kaputt ist und ich habe es wieder rausgeschmissen?Aber du kannst mir natürlich gerne einfach einen Prime-Sub dalassen. Huge Kamerarbeit,fast so gut wie bei mir. Bsreelight, Tripsprime, Dankeschön, Poggas.Eine Alternative, die kann, Kontrolle OBS. So wie das es gerade gemacht hat. Nun, ich binhier um euch zu sagen, es gibt eine Alternative. Eine große Reveal. Meine Damen und Herren,ich bin stolz auf Stream-Pi. Ich glaube, der hat wirklich mal ein Meme-Board genommenund einfach mal ordentlich gebaut. Also nein, der hat nicht meins genommen, aber der hatdie Idee im Endeffekt genommen und mal weitergedacht und ordentlich gemacht. Ich weiß nicht, obich das verwenden kann. Da bin ich mir nicht sicher, ob ich das verwenden kann.Weißt du, was sinnvoll wäre bei diesen ganzen Videos, immer wo die Leute ihre Projekte vorstellen?Einfach ein 1-Minute-Video machen, wo man es in Action sieht und ein paar interessanteFeatures. Weil so habe ich keinen Plan genau, was es ist. Ist es ein Tablet? Ein Tabletirgendwie. Ja, das ist von der Idee genau so. Das ist im Prinzip fast das Gleiche, wieich hier mit meinem Board gebaut habe. Nur wahrscheinlich ein bisschen durchdachter alsich. Was genau ist so schlimm, dass es sehr wir-programmiert ist an vielen Stellen? Ichmeine, exakt das kann man mit meinem Tool genauso machen. Im Prinzip ist das genau dasGleiche. Das geht auch auf einem Tablet. Nur, dass ich GIF-Animationen kann und dassich Sounds kann. Und sogar MP4-Sounds, also Audio-Spur in MP4-Videos oder Text-to-Speech.Und Touch Ui geht hier auch drauf. Zeit voraus. Ich gehe mal davon aus, dass seins ein bisschenbesser durchdacht ist als meins. Es ist eine ziemlich hässliche Oberfläche, muss ich jetztmal sagen. Ist deins auf Github? Meins ist auf Github, allerdings eine uralt Version.Die allererste Version, die ich gebaut habe, ist auf Github. Aber die kann halt keine Animation,die kann keinen Text, die kann keinen Sound, die kann einfach nur Bilder overlayen. Dafürist sie ziemlich simpel. Da ist eigentlich nicht wirklich viel, was man verstehen mussdran. Okay, was kann das Ding noch? Wolltest du dich noch mal fragen, ob du bei TV einenbeiden Tuner an eins oder zwei IPs gebunden hast? Keine Ahnung, ich habe gar nichts extragebunden irgendwie. Ich habe es auch im Stream sogar gemacht. Okay, da kannst du auch Skriptehinterlegen und so. Das macht es natürlich schon interessanter. Wieso pusht du keineneue Version, weil die kacke sind? Weil ich mich teilweise schäme für die eklichen Sachen,die ich hier verzapft habe. Das will ich so nicht veröffentlichen. Hätte er nicht malein bisschen gestrafteres Video dazu machen können? Aber damit kannst du OBS fernsteuern,das kann man mit meinem Tool natürlich nicht. OBS fernsteuern kann man natürlich mit meinemZeug nicht. Das Einzige, das ist viel mehr als das, was ich gebaut habe. Wie gesagt,meins kann nur Bilder overlayen und Text-to-Speech-Text machen oder koreanisch Text-to-Speech machenoder Bilder und Sound. Also, meins kann nur Audio-Video-Zeug und der hat ja wirklichkomplette OBS-Fernsteuerung gebaut, die man da drauf legen kann. Programmierst du eigentlichauch auf der Arbeit ab und zu seltener als mir lieb ist? Mach mal Ausrufezeichen Job,da hab ich Job oder Ausrufezeichen Beruf. Ich weiß gar nicht, wir haben ein Kommandodafür, da hab ich versucht mal zu ergleiten auf der Arbeit, zu treiben. Nein, mein Meme-Botbenutzt kein OBS, der macht Windows-Overlay, dass ich selbst sehe. Okay, jetzt hab ichgecheckt, was der meint, aber das ist schon eine ganze Ecke Advanster, was der gebauthat, als was ich gebaut hab. Außerdem, ich seitens in Java, das widerstrebt mir natürlichso ein bisschen. Ja, cheat, ich mach gefühlt mehr Code-Reviews als selber programmieren,das stimmt. Das stimmt, leider, ja. Paints-Champ, Java, Paints-Champ. Können wir mal ein bisschengucken? Können wir mal ein bisschen gucken, ich will mir keinen Java-Source-Code angucken.Dabei ist die Java und die Sharp-Source-Code gar nicht so großartig. Kannst du mal erklären,wie man mein altes Meme-Bot nutzt? Das ist ganz einfach. Du gehst einfach hier hin undlädst dir das einzige Release-Wasser, das es gibt, runter. Ja, Meme-Bot Excel. Und dannmachst du, was hier als Anleitung drin steht. Das ist ziemlich simpel, aber halt nicht sonnerlichadvanced, ja. Oh Gott, Java, Alter, wenn ich es sehe. MonkaS. Aber ehrlich gesagt,es sieht halt schon ähnlich aus, wie meinst du die Sharp-Zeug? Was ist denn das, sind dasAttribute oder was ist das? Füchsemel? Scheiße, das Fuck-XML, der Sache würde ich zustimmen.What the fuck? Warum muss der sich um irgendwelche Threat-Management kümmern bei Buckle-Click-Events?Boah, sieht das eklig aus, Alter. Oh, boah. Hä? Main. Ja, anscheinend habe ich noch niewas mitgemacht, keine Ahnung. Fuck-XML-Loader. Load. Aber ich muss sagen, seine Benamung istzumindest schon mal ganz gut. Er hat keine Factory-Manager-Manager-Class-Factory-Creator-Observer-Factory-Manager. Main, okay, was startetdas denn jetzt hier? If-F-XML. Igitt! Igitt! Das ist nicht wirklich das Frontend, was manin XML deklariert, oder? Da ist ja diese XML-Geschichte noch richtig hübsch dagegen. Ich weiß, XML istauch XML, aber ein bisschen kurz und knackiger. Und ich finde XML auch schon kacke. Also ander ganzen WPF-Geschichte geht mir XML am meisten auf den Keks. Da macht's QML vielbesser. QML ist, finde ich, die schönste Interface-Beschreibung. Habe ich mal ein Beispiel. Habe ich mal ein schönesBeispiel. Ja, sowas hier. Das ist doch schon mal viel besser lesbar als irgendwelche XML-Crap.Also QML, finde ich, ist die schönste Interface-Beschreibungssprache, die man von Hand schreibt, wohlgemerkt. Wenn manüber irgendwelche GUI-Designer macht, wie beispielsweise diesen Windows-Forms-Designer, der macht jaunter der Haube auch Spaghetti-Code, aber da macht man es halt immer mit einem Designer.Aber QML schreibt man halt von Hand. Und das ist richtig schick. Also QML, finde ich, istdas die schönste. Ach, du meinst, das ist auch so ein Designer? Okay, dann ist okay.Also, wenn das mit einem Designer erstellt wird, ist okay, wenn man den Mist nicht vonHand schreiben muss. Dann ist es in Ordnung. Dann macht man das einfach in seinem Designerund muss sich den Source-Code nie dazu angucken. Das ist okay. Ich dachte, man schreibt denMist von Hand. Ich mein, guck beispielsweise mal hier mein, das XML-Gegenstück von mir,das ist jetzt halt handgewurstet. Das sieht jetzt auch nicht viel schöner aus, ja. XMList halt immer scheiße. Oh, es gibt sogar Arm-Bills. Aber auch in Java. Geh weg. Schaumal SQF von Bohemia an, da musst du mir mal einen Linkshoot zuschicken. Kannst du bitteaufhören oder ich reporte dich. Mit was? Du meinst mit XML angucken? Ja, YAML ist mirpersönlich auch deutlich lieber als XML, wobei ich mittlerweile schon wieder einen Schrittzurückgegangen bin. Ich verwende auch kein YAML mehr. Ich verwende eigentlich für allesirgendwelche JSON-Config-Files, wenn es geht. YAML hat ja so mit Rails so richtig den Durchbruchgehabt damals. Aber ich mag Klammern. Okay, was soll ich mir angucken, das da? Was istdas überhaupt? SQF? Ist das für den Armor Level Editor oder wie? Was ist das? Das siehtfast aus wie Erlang. Oder? Das sieht ein bisschen aus wie Erlang. Also genauso hässlichwie Erlang. SQF-Example. Gucken wir mal. Nein. Ach, das ist die Armor Scripting Engine. Okay,Armor ist schon so ein Spiel, was nicht ordentlich läuft. Da wird die Armor Scripting Engineauch nicht besser sein. Gehen wir noch am Fernsehbauen? Nö. Okay, das sieht schonhardcore eklig aus. Das hat ein bisschen was von Windows-Batch. Das hat was von CMD-Batchirgendwie. Ach, nee, nee, nee, hör mal auf. Das ist ja eklig. Das will man nicht haben.Nee, ich bin nicht mehr am Fernsehbauen. Wo sind wir eigentlich gerade stehen gebliebenvorher? Das ist schrecklich. Ja, das ist echt schrecklich. Okay, gucken wir mal, wases da für neue Sachen gibt. Irgendwelche Steam-Games zu empfehlen. Ach, stimmt, wirwollten eigentlich gucken, was sonst noch dieses Jahr für interessantes Zeug rauskommt.Max, hast du schon den Ultra-Gaming-PC gesehen, den ich auf Discord geschickt hab? Nee.Welchem Channel hast du den geschickt? Können wir uns jetzt mal angucken? Gucken wir unsmal Gaming-PC Setup an. Rails, was ist das nochmal? Ja, das ist so eine Sache, die man2005 verwendet hat. Wenn du Java nicht magst, Marcelo von Kotlin, würde ich jederzeit Javavorziehen. Kotlin hat sich so das Beste aus allem geschnappt. Welchem Channel hast dudas gepostet? Allgemein. Ach, der da. Okay, zeig's mal her. The fuck? Who buys that?Fx3300? 8300? Was soll das sein? Von 2009 oder was? Was kostet's? 1000 Euro! Okay.Das Gerät ist mit einem sehr schnellen Acht-Kern-Prozessor. So wie mit schnellen 8GB. War das schon DDR3?Nee, das war noch DDR2, oder? Von Shinobi. Von Shinobi ist das. Heißt die eine Ba-ja ja nicht auch Shinobi? Oder Shibune oder so? Die ganzen Weebs unter uns wissen dasbestimmt. Shinobu, Shinobu, genau, Shinobu. Irgendwie so. Okay. 8GB Markenarbeitspeicherausgestattet. Jetzt haben sie sich auch noch Encoding-Fails. Auch noch Encoding-Fails.Dass man das im Jahr 2019 noch hat. Arbeiten sie in Ruhe ohne störende Lüfter. Oh, dasleises Netz hat und hat einen geregelten Lüfter. Ui, was das alles hat. Sehr schnelles GT710.Ai ai ai, das ist ja absolut high-end. Warum hat das Ding überhaupt so gute Bewertung?Shinobibi. Den Shop müssen wir uns jetzt mal angucken auf Amazon. Okay, Fyte, die Typengibt es ja wirklich. Ultra, Ultra-8-Kern. Ist das denn, sag mal, ernsthaft jetzt? Warumverkaufen die noch, warum verkaufen die denn? Was ist denn das für eine beknackte Kombi,Alter? Ach so. Dass das überhaupt startet in Kombination. Ich meine, von wann ist dieCPU 2009? Oder 11? Release, release, release. 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009,2012. Ich aber trotzdem. Ich meine, das ist eine 8 Jahre alte CPU, die wohlgemerkt damalsschon gesackt hat. Und außerdem ist das, glaube ich, gar kein 8-Kerner, oder? Das wardoch damals kein echten 8-Kerner. Das war doch diese... Ich kann mich ja schon gar nichtmehr richtig dran erinnern. Turbo. Okay, wo ist der PC, den du gesehen hast? Den guckenwir uns jetzt mal ein bisschen genauer an. Wenn ich den Namen sehe, da habe ich jetztirgendwie diesen komischen Aya-ya-Ausschnitt im Kopf. Shinobuni. Aya-ya? So. Amazon Choice.Moment, wir gucken jetzt mal was anderes. Wir gucken jetzt mal was, und zwar die Bewertungmüssen wir uns jetzt mal angucken. Wichtig ist, von wann die ersten Bewertungen sind,kann man auch älteste zuerst machen? Älteste zuerst? Nein. Geht natürlich nicht Amazon.Amazon. Sortieren nach neueste zuerst. Ich glaube es nicht. Warum gibt es kein Pagingmehr für Kommentare? Meine Güte, Alter. Wie mich Webdesign 2019 abfuckt. Wie mich Webdesign2019 abfuckt, das könnt ihr euch gar nicht vorstellen. Ich will einfach nur sehen, wannder älteste Kommentar her ist. Warum geht das nicht? Oder bin ich einfach nur zu dumm?Webdesign 2019, ey. Wie lange darf ich das jetzt machen? Drei Stunden, oder? Ach, hier.Okay. Also die erste, die erste Rezension ist von Mitte 2018. Das heißt, die verkaufenwirklich einen PC von vor, sagen wir mal, acht Jahren, sieben Jahre, einen PC von vorsieben Jahren, der vor sieben Jahren noch nicht mal gut gewesen wäre. Das war die Zeit,wo AMD überhaupt nicht mithalten konnte. Boah, wupp wupp wupp geht mir auf. Bin vollendspositiv überrascht. Alle Spiele laufen bei höchster Auflösung. Also entweder ist dasder übelste Kacknoob oder er ist bezahlt. Ich hätte beim Kauf von Einzelkomponentenwesentlich mehr bezahlt. Das bezweifle ich. War ganz davon abgesehen. Natürlich ist derscheiß teuer. Das gibt es ja mittlerweile auch nicht mehr. Mehr als Defekthexe. Wasist Defekthexe? Okay, dann müssen wir uns die Bewertung mal angucken. Was ist eine Defekthexe?Ich hab keine Ahnung Leute, ich hab keinen Schimmer. Es gibt eine Seite, wo man Fake-Bewertungenfiltern kann. Okay, wie machen die das? Das hab ich noch nie. Oh, das ist ja cool. Wasist das? Review-Matter. It's a tool analyzing reviews on Amazon. I understand. Copy-Paste-Product-Url. Ja, geht wahrscheinlich nur auf Englisch,okay. Okay, das sieht sehr vertrauenserwürdig aus.Die haben die Produkte getauscht irgendwie, aber die anderen Produkte waren genauso kacke.Okay, also was schreiben denn die Leute? 102 Personen fanden das hilfreich. Die am höchstenbewertete kritische Rezession ist, zweimal ein beschädigtes Gerät erhalten. Mehr alsDefekthexe. Ich hab immer noch keine Ahnung, was er uns sagen will mit Defekthexe. Linkauf Discord geschickt. Vor allem hat er auch noch so ein hässliches Gehäuse dabei. Okay,wir müssen jetzt mal die Kommentare durchlesen. Was schreiben die Leute denn alles? Kann mandrei Monitore anschließen? Moment. Ja, der hat recht, der Typ. Leider sehr enttäuschend.Ich meine, wer das glaubt, ja. Wer das glaubt. Was? Defekthexe? Diese Seite? Ernsthaft, esgibt ne Seite, die Defekthexe heißt. Okay, das hat damit aber glaub ich nix zu tun. Alter,die Musik. Oh, Grip. Oh. Kann ich mal wieder nicht entscheiden, ob's laut oder leise seinsoll. Geldabzock ist statt Gamingwunder. Ist leider überhaupt kein Gaming-PC, wie angegeben.Ach, eher ein schlechter Witz. Oh, der hat sogar ne 1060. Veraltenes Board, schlechterRAM, langsamer Festplatte, schlechte CPU. Noch nichtmal für CSGO ist das ausreichend.CS will so viel FPS wie irgendwie nur möglich. GTA V ruckeln, das heißt schon was. GTA Vläuft eigentlich fast überall. Halbwegs, halbwegs. Gut zum anderen. Ja, die Rezessionist zwei Tage alt. Kompletter Dreck. Besser 500 Euro mehr ausgeben und einen guten undzukunftssicheren PC ausgeben. Für 500 Euro kann er sich nen besseren PC kaufen aktuell.All die Musik. Witz. 7, 7 Cent. Dankeschön. Schlagschade. Gut. Magst du die Fallout-Reihe?Ich hab die neuen nicht mehr gespielt, aber an sich schon, ja. Oh, ich hab was, ich habwas übersehen, Leute. The Reezes. Bist du noch am Start? Nur mit einem echten Sub istmein LQ ins unermessliche gestiegen, Pfeil Pferd. Ja, hoffe ich mal, hoffe ich. Und mitjedem Monat, mit jedem Monat wird's noch mehr. Wie wär's mit PC-Empfehlungen zu Weihnachten?Ja, wenn Hardware-Rat da Bock hat, können wir wieder was machen. Das sind doch, dassind doch Fake-Reviews, oder? Oder ist das, oder sind die Leute wirklich einfach nur dämlich?PC scheint leise zu sein, funktioniert bei Spielen sehr flüssig. Nein. Wenn man CandyCrush spielt vielleicht. Der PC hat alles, was man benötigt. Wichtig war, dass er dasWindows Office schon hatte. Oh, wichtig, natürlich ist das Windows Office enorm wichtig. PowerPoint wäre nicht schlecht gewesen, kann man aber noch installieren. Alter, die Gnoobs,ey. Top PC zum Top Preis, sehr guter PC. Nein, ist er nicht. War auch Activirus dabei,ja. Norton Internet Security Suite bestimmt. Michi, Stufe 1, Dankeschön, Poggers. Ähm,ich habe nur die Grafikkarte gewechselt, den Arbeitsspeicher und eine SSD, alles spielbar.Moment, der hat auch noch richtig Geld reingesteckt in den PC. Ich habe nur die Grafikkarte gewechselt,den Arbeitsspeicher und eine SSD, das heißt, der hat eigentlich alles ausgetauscht, wasnoch irgendwie, was, oh Mann. Sowas gibt es, ich wusste nicht, dass es eine GTX 1030 gibt.Sehr guter PC, schönes Gehäuse. Battlefront Apex Legends, na gut, die Dinger laufen auchüberall gut, aber ich bezweifle, dass die wirklich richtig gut laufen und wenn schonliegt es da dran, dass eine 1060 dafür ganz okay ist. Ähm, mit Unschlapp, die Leute sindso hängen geblieben, warum? Stimmt. Ah, jetzt verstehe ich, dass die Skamasen.Den PC gibt es mit einer, nö, machen sie nicht. Sie haben mir das hier halt alles irgendwiezusammengefasst, aber es ist alles, alles die gleiche Kack-CPU. So, und der andere,der für tausend Euro, Alter, tausend, fucking, tausend Euro, tausend Euro für acht Jahrefür acht Jahre. Alter. Was ist dieses Wuppwuppwupp, das ist ja ätzend heute. Okay, wir gehenjetzt mal auf Anfang zurück, gucken von wann die erste Bewertung ist. Okay, die Leute schätzendas hier wirklich richtig ein. PC-Gehäuse leicht beschädigt. Internet G-Data lässtsich nicht aktivieren. Ich weiß jetzt nicht, ob das ein negativer Punkt ist, ehrlich gesagt.Es war nur ein Grafik-Chip undenkbar. Ah ja. Was möchte er uns sagen? Es war nur ein Grafik-Chip.Er will uns nicht undenkbar sagen. Erkennbar? Erkennbar? Meint er den RAM-Riegel? Erkennbar?Es war nur ein RAM-Riegel erkennbar? Will er uns sagen, dass das, dass da nur ein RAM-Riegeldrin ist? Es war nur ein RAM-Riegel erkennbar? Ja, es ist auch nur ein RAM-Riegel. Und weiter?PC-Spiel in Ultra. Wow, auf mittleren Einstellungen, 25 FPS. Krasse Gaming-PC. Kack-W. Da könnenwir wirklich mal Kack-W verwenden heute. Wow, in mittleren 25 FPS. Das ist schlecht. Ja,die On-Board-GPU von der aktuellen CPU wäre besser. Kannst du mal auf Anker-Mann die PCsbewerten? Was ist Anker-Mann? Ist Anker nicht so ein China-Hersteller von USB-Hubs und Zeug?Okay. Warum man niemals einen PC bei Amazon kaufen sollte? Okay, was haben wir denn hiernoch drin? Insane Scam, okay. Okay, was ist Anker-Mann? PC-Systeme. Was soll ich da jetztzu sagen? Okay, also was schreiben die Leute denn hier sonst noch Tolles? Hilfe! Da siehtman mal, dass tatsächlich hier mit Leute scamaßt werden. Die denken sich, sie kaufen wirklicheinen geilen Gaming-PC und dann ist es der... Ich meine, es ist in Deutschland nicht verboten,das zu verkaufen. Muss man auch mal ganz klar sagen. Also, der darf diesen Kram hier verkaufen.Ob man ihn als Ultra-Gaming-PC anpreisen darf, ist was anderes. Lieferung war schnell, optischund technisch 100%. Der Typ hat wirklich sich diesen PC für 1000 Euro gekauft, ich glaubees nicht. PC langsam. Bewertung bezahlt. Okay, das ist jetzt gekauft.Das kann nicht sein, dass es Leute wirklich gut finden. Angeblich soll der Prozessor denTurbo unterstützen, aber er funktioniert... Welcher Turbo? Das ist nur ein PC, da war nichtsmit Turbo. Ein Ryzen 5 der zweiten Genre hat mehr Leistung als... Der Vergleich ist jetztein bisschen komisch, aber okay. Der meint wahrscheinlich die GPU. Ist beim Ryzen überhaupteine GPU drinne? Das ist immer so wenig, kenn ich mich aus mit aktuellem Zeug. Ihr seiddoch Verbrecher aus Ursemia. Ja, das stimmt schon. Okay, hier haben es die Leute wenigstensgecheckt. Ne, ne, ne. Das sieht doch jetzt halbwegs normal aus. Ich meine, natürlichviel zu teuer im Endeffekt. Das ist aber nicht so ein Crap wie das andere, was wirgesehen haben. Ich meine, das ist natürlich viel zu teuer für so was hier. Denkst duder HP Microserver Gen 10 ist brauchbar für 12 VMs zu hosten, die Linux im Idle-Betriebfahren. Cheat125 schickt mir mal eine Link zu dem Sauber, den ihr kaufen wollt, da kannich ihr das sagen. Aber in der Regel ist fast alles schnell genug, um 12 VMs im Idle zuhosten. Nächste Mal die Antwort, please. Welche? Welche Antwort? Okay, Moment, ichguck sie mir mal kurz an. Der da. Ähm, also die Dinger sind übrigens immer, die sindziemlich gut. Die kann man an sich empfehlen, wenn man einfach was Fertiges haben will,was was taugt. Das ist echt nicht schlecht, die Teile. Okay, was ist denn da drinnen?Specifications, ein Opteron X300, was ist denn das? Ist das was Neues, ist das was Altes?Ist das, ist das, ist das die, ist das ein Ryzen Abkömmling? Keine Ahnung von. Ah nee,Jaguar ist das noch. Ja, mit wieviel RAM willst du den kaufen? Mit wieviel RAM ist deiner?Das reicht dicke, um 12 Idle VMs zu hosten. Vorab kein Ding. 16G, jaja, easy, reichtdas, easy. Linux Idle, den Dinger, den gibste 256 MB RAM und gut ist. Das reicht, das reichtdicke, für 12 Idle. Aber wohlgemerkt Idle, die ab und zu mal ein bisschen was machen,aber du kannst, also, warum willst du überhaupt 12 Linux VMs hosten? Also, vielleicht kannstdu es nicht irgendwie anders losen? 12 Idle VMs hört sich irgendwie so, weiß nicht, washast du denn vor? Eine VM per Service, vielleicht kannst du einfach einen Container per Servicemachen, das wäre noch deutlich ressourcensparender. Ein Container per Service braucht im Endeffektgar nichts. Meinst du Home Assistant und weitere Dienste? Web Server, was ist denn Bad? Web Server,auf einem Home Server ist Overkill und nicht Energiesparen. Die Boards sind ganz gut. Nö,das ist okay, kann man machen. Guck mal kurz in das Video rein, da zeigt ein Typ die Seitenin Australien nehmen. Welches Video, Leute? Ihr wisst, ich bin beim Chat manchmal nichtso ganz, ihr müsst versuchen die Comments, wenn ich da irgendwas mir angucken soll, dieso möglichst komplett zu verfassen, wo das alles drin ist. Ich kann nicht immer dreiComments zusammensuchen, ich weiß überhaupt nicht mehr, auf was sich das bezieht. Aberfertig PCs waren noch nie günstig, das stimmt, deswegen machen wir mal ein bisschen Werbung.Die Dinger kann man sich holen. Die Dinger kann man sich holen. Was hat er denn aktuell?Zeig mal her. Was hat er denn aktuell? Comments zusammengebaut mit installiertem Windows zuHause. Zu Hause an. Einfach anschließend loslegen, sehr gut konfiguriert. Was kriegen wir dennhier für 399 Euro? Oh, siehe da, das Ding kostet nun ein Viertel von dem anderen undist in allen Belangen viel, viel besser. Was ich mich ja frage ist, wie er das mit demPreis macht. Ich meine, das ist schon ziemlich günstig, was er da zusammenwurstet. Natürlichist es vielleicht noch ein Ticken günstiger, wenn ich das selbst baue, aber er muss janoch was dran verdienen. Was noch mal ein Beispiel für SQF. Alter, was ist das?Mir fällt keine Sprache ein, die ähnlich vergleichbar hässlich ist. Was ist das? Alter,wie geht's? Das ist schlimmer als Paul. Mir fällt jetzt nichts Vergleichbares ein gerade.Geh weg. Okay, was kann ich denn, wenn ich bei Hardwarerad richtig Kohle ausgeben will?Den Horst Flock können wir kaufen. Den Horst Flock, wer ist denn der Horst Flock? Okay,was kriegen wir bei Hardwarerad, wenn wir 3899 Euro ausgeben wollen? Zeig mal her.Wer ist Horst Flock? Jeden Tag ein Video. Ich hab von Horst Flock noch nie was gehört.Der immer so tut, als wäre er ein Rentner. Also so wie Wilhelm Kramer LP, oder was? Kenntihr noch jemand? Okay, also was kriegt man bei Hardwarerad für einen 3899 Euro PC? Schauenwir mal. Einen i9. Okay, naja, schnellst hinter als CPU. So ein komisches Board, was so 3Milliarden Sachen hat, was ich nicht brauch. 32G, 500G Samsung. Eine zweite 1TB SSD, okay.Hätte man da nicht eine 2TB SSD nehmen können? Mann, das ist teuer, das Ding. Wilhelm Kramerwar doch Kollege, ja genau. Ich weiß, da gehen nur die Gerüchte. Ach okay, SLI, dasmacht es teuer, das macht es teuer. Das allein sind ja schon mal 2500 Euro. Das allein sindja schon mal 2500 Euro oder 2600 Euro. 2x2080 Ti. Okay, SLI kommt mir nicht mehr in dieTüte, was haben wir hier zu bieten? Das gleiche wahrscheinlich nur ohne SLI. So, ein bisschennormalere Preise jetzt mal hier. Nehmen wir mal den da. Intel, 8700K. Hat der keine RyzenPCs? Ich dachte eigentlich, ne, wahrscheinlich die bisschen billigeren. Nehmen wir mal 1000Euro, das ist eigentlich das, was ich aktuell für einen PC ausgeben würde. Da hat er einenRyzen drin. Aber warum hat er eigentlich noch die Ryzen 5er drin und auch keine Ryzen,auch keine 3000er? Wahrscheinlich, weil die preisleistungsmäßig nicht so gut sind, ha?Haltbestand. Na gut, ich mein, wenn es vom Preis her, wenn es vom Preis her sich besserso lohnt, beziehungsweise eine bessere Grafikkarte einzubauen, dann ist das auf jeden Fall sinnvoller.Aber da kann man nichts verkehrt machen, großartig, bei den PCs, wenn man was komplettes habenwill. Das hier liest sich auch nach Crap preisleistungsmäßig und das hier eh. Shinobi sei Dank, der Computerläuft schnell und gut. Das ist auch wieder so ne Sellout Rezension. Meine Güte, die Leute.Entweder sind das wirklich so Kacknoobs oder das ist einfach gekauft. Meine Güte, Alter.Das ist was ein Kram, ey. Okay, oje, der Chat explodiert ja wieder hier. Ach so, das Video.Das Video kann man zum Schluss gucken dann. Alter, was ist das für ein, für ein, ichmein, das wupp, wupp, wuppt ja immer, aber Melodik ist das, ist das nicht wirklich gerade.Ja, schon besser. Was, ein Link im Discord? Was?Wonke S. Mit 2TB Mikro SST? War das nicht alles gefuckt? Das kann doch nicht, das kostetgar nichts, oder? Kannst du erklären, was SLI für Vorteile hat und Nachteile hat? Naja,der Vorteil bei SLI ist ganz klar, wenn dir eine Grafikkarte nicht ausreicht, weil duirgendwie 8K, 4K, 120 FPS oder was auch immer machen willst, mit hohen Details, dann baustdir noch eine zweite Grafikkarte da rein und du kriegst ein bisschen mehr Performance.Du kriegst nicht doppelt so viel Performance, du kriegst, ich sag mal so 50, 40 bis 80%mehr je nach Game Performance, aber die Nachteile sind, dass viele Games rumspacken auf SLISystemen, deswegen hat halt kaum noch eine SLI Systeme. Du hast irgendwelche Mikro-Rucklerund es sackt einfach nur. Und viele Spiele haben auch keine gute SLI-Unterstützung mehr.Das ist einfach outdated mittlerweile, SLI. Max, was meinst du, wie lange? Äh, wo sindwir stehen geblieben? Max, was meinst du, wie lange dauert es, bis viele Programme undSpiele auf Linux funktionieren und man wechseln kann, ohne auf Gaming-ETC zu verzichten? Wahrscheinlichnie. Wahrscheinlich nie. Ich hab übrigens wieder jede Menge Subs verpasst, wir habenja einmal am Start den, ähm, oder besser gesagt, die Morchel 223 mit einem Prime-Subund dann haben wir Michael 50 Billiarden, Trillionen, was auch immer, resubscribed,zwei Monate, huge, high IQ-Sub. Davor hatten wir noch Michi, aber den hab ich glaube ichschon vorgelesen. Warum ist denn deine Twitch-Description nicht der Discord-Server? Das ist eine guteFrage. Wenn mir einer meiner Mods kurz einen, äh, Invite-Link schicken könnte, der fürimmer gültig ist, weil ich bin zu dumm sowas zu generieren, dann pack ich's in die Beschreibungrein. Ja, ich wollte mir eigentlich noch ein paar Stellen anzeigen, zum Schluss jetzt angucken,weil Gaming-PCs haben wir durch. Welches Terminal kannst du Windows 10 empfehlen? Also ich kanndir zwei Sachen empfehlen. Einmal leg dir eine Linux-VM an und mach dein Zeug da drinnen,das ist schon mal mein erster Tipp. Und wenn's unbedingt ein Windows-Terminal sein will,dann kann ich dir hier nur den da empfehlen, den, der CMDR, der irgendwie meine Settingsvergessen hat vom letzten Mal. Der ist tausendmal besser als dieses Kack-Terminal, was bei Windowskommt. Vielleicht ist in Zukunft das ganz gut, was Microsoft da gerade noch entwickelt.Ähm, zum Thema Linux-Gaming kann ich eigentlich noch sagen, wenn wir, also eine, ich sag mal,eine gute Sache könnte Google-Stadia tatsächlich machen. Äh, hier, du kannst den Linux-VM,installier den Linux-VM, da hast du auch ein ordentliches Terminal. Besser als Windows-Crap.Ähm, also eine Sache, für die Stadia tatsächlich sorgen könnte, aber wohl gesagt könnte ist,dass manche Sachen besser auf Lilungs laufen. Ähm, weil der große Unterschied zwischenden bisherigen Streaming-Anbietern, die es, also Gaming-Streamer-Anbieter, die es bishergegeben hat und Stadia ist ja, dass die Game, dass die Games explizit für Stadia angepasstwerden müssen. Also sprich, das sind keine VMs mit irgendwie, also das sind keine Windows-VMs,wo irgendwie Grafikkarten durchgereicht werden oder so. Sondern, das sind, quasi, nativeläuft das, wahrscheinlich haben die schon irgendwie gewisse Professionierungs-, Virtualisierungs-,sonst was, Geschichte dahinter. Aber die Games müssen bei Stadia angepasst werden. Ich weißjetzt nicht, was dahinter läuft, aber ich bilde mir ein, ich hab irgendwo gelesen, eswäre eine Linux. BSD ist in dem Bereich auch lustigerweise recht beliebt. Man darf nichtvergessen, die Playstation läuft auf einem BSD, auf einem FreeBSD. Seit, ich glaub, seitder Playstation 2 schon. Oder vielleicht sogar seit der Playstation 1. Ja, Morstl, das istnett von dir. Huge. Big IQ-Sub. Point Bugs. Ah, du wolltest auf Motroid Point IS ausprobieren.Ja, kann ich schon machen. Wenn ich noch den, war das Cryptsetup Benchmark, was man machenmuss dafür? Ich glaub, Cryptsetup Benchmark ist das. Probieren wir es mal bei mir lokalaus. Wie schnell ich verschlüsseln und entschlüsseln kann lokal bei mir auf dem Rechner, in derVM. Und dann vergleichen wir das mal mit der Embedded-Kiste. Ah, dankeschön, Discord-Link,den pack ich gleich mal in meine Channel-Beschreibung rein. Schauen wir mal. Ja, aber mal. Discord.Discord. So, absenden. Also ich sollte jetzt eigentlich in meiner Channel-Beschreibungeinen Discord-Invite-Link haben. Ja, sollte funktionieren. Ok, also, so schnell sind wirbei mir lokal. Und jetzt verbinden wir uns mal. Hab ich nicht mehr in der Historie drinnen.Was, 123 oder 125 hier? Ok, wir gucken mal. Machen wir hier kurz auf, dass wir sehen,was für Auslastung verursacht. Oh, ist nicht installiert. Installieren wir mal. Die Hoffnung,dass die Fernsehaufnahmen nicht abkacken oder so. Hab keine Lust, von Windows 7 auf Windows10 zu wechseln. Ja, die wird nichts anderes übrig bleiben. Stimmt, anderer Link. Ja,das müssen wir nochmal anpassen. Das stimmt. Wir brauchen vom Nightbot den Link. Müssenwir nochmal anpassen. Channels bearbeiten. Ok, also schauen wir mal. Crypt Benchmark.Absenden. So, jetzt Paddles speichern. Ah, funktioniert. Ja, na. Also mit Verschlüsselungist auf dem O-Troid nicht sonderlich viel. Das liegt aber glaube ich da dran, dass derKernel, das ist ja ein Custom Kernel, den wir gebastelt haben hier. Das ist ja ein CustomKernel, den wir gebastelt haben. Und der hat wahrscheinlich schlicht und ergreifend keinerleiCrypto Extensions oder irgendwas drinnen. Es könnte aber auch sein, dass der keinehat. Da bin ich mir ehrlich gesagt nicht sicher. Vielleicht hat er auch keine Crypto Extensions.Kann sein. Kann sein. Weil, ich glaube, das hier ist das wichtige für Plattenverschlüsselungund 83 MB Lesenschreiben. Ja, aber dann ist er halt volle Pulle ausgelastet. Habt ihrmal geguckt, wie die CPU-Auslastung war, als ich das haben laufen lassen? Ach, das istein Single Threaded oder was? Ah, nee, nee, nee, passt schon. Naja, also so geil mit Fähr-und Endschlüssel ist da nix. Also da geht nicht allzu viel. Man müsste es mal ausprobieren.Man müsste es mal ausprobieren, wie gut das wirklich funktioniert. Kann man jetzt schlechtsagen. Funktioniert AES auf dem Pi mittlerweile? Ja, ich glaube, das liegt daran. Das gingglaube ich, also ich bin mir nicht ganz sicher. Aber ich glaube, das ging die ganze Zeit schon.Das Problem war, dass die Encryption auf dem Raspberry Pi, also die Crypto Extensions inder CPU nur auf dem 64-Bit-Betriebssystem funktionieren. Magst du welche Encryption- und Hashing-Methodefindest du aktuell am besten? Ich, ehrlich gesagt, ich fahre da so mit den normalen StandardsAES und Schale 256 und gut ist. Man muss es ja nicht unbedingt komplizierter machen alsnötig. Simple 2016 Twitch Prime, Dankeschön. IQ vom Chat wieder gestiegen. Was sagste zudem Deal hier? Mal gucken. Gaming PC Ryzen 5. Das sieht doch ganz ok aus. Was ist dadenn? Ah hier, da unten steht es. Das sieht ganz gut aus. Ich meine, es ist halt ein Ryzen2, aber ganz ehrlich, das reicht auch. Ich würde mir zwar jetzt, wenn schon überhaupt,ich würde mir einen Ryzen desktop PC bauen, wenn ich mir einen desktop PC bauen würde,aber dann halt mit einem Ryzen 3. Aber das ist ok. 16G sind top. 2060, weil bei der Preiskategorieist das wahrscheinlich auch ganz ok, kommt ein bisschen auf die andere Seite. 256G SSDist halt wirklich osch klein. Bully Guard Internet Security, gut, braucht kein Mensch.Guck mal, sogar ein Spiel dabei. Ja, das macht, der Eindruck ist ganz in Ordnung. Wobei ichhalt, wie gesagt, ich würde mir selbst was bauen. Ich würde mir wahrscheinlich irgendwasbauen mit einem aktuellen Ryzen, noch ein bisschen schnelleren Grafikkarte und mit einergrößeren SSD, aber natürlich kommst du dann auch mit 700€ nicht mehr hin. Ich würdeaber wahrscheinlich 1000€ ausgeben und aktuell einen Ryzen rein machen, eine schnellere Grafikkarteund eine größere SSD, dann bist du bei 1000€ und gut ist. Nein, also aktuell, wenn ichmir einen desktop PC bauen würde, würde ich mir, zumindest so wie ich das zuletzt geguckthabe, vielleicht hat Intel jetzt ja mittlerweile was Neues. Ich habe gelesen, dass die neuenCPUs von Intel deutlich günstiger geworden sind, also die neuesten High-End CPUs vonIntel deutlich günstiger geworden sind als die Generation davor, aber ich würde wahrscheinlicheinen Ryzen bauen. Liegt zwischen dem Ryzen 2700X und 3700X, ich vermute mal nicht viel,aber wir können ja mal gucken. Ein bisschen was dürfte schon sein, das hat sich da eigentlichganz gut was getan. Ja, 15%, 15% ist schon okay von einer Generation. Hat er nicht sogarmehr Kerne? Ne, die haben beide 8 Kerne. Es ist halt rund um die bessere CPU. Preis-Leistungs-Mäßigmüssen wir mal gucken, was kosten da Kram so. Ja gut, deswegen hat Hardwarerat auch nochdie alten Ryzen drinne, weil die nicht so viel langsamer sind, aber viel billiger sind.Die kosten nur die Hälfte. Naja, nicht ganz. Zwei Drittel. Weniger. Äh ne, was? Ne, quickmaths. So 40% oder so. Weniger.Ich bin mal gespannt, was Intel jetzt noch treibt. Der neuere ist langsam getaktet.Ja, das juckt doch nicht. Das juckt doch nicht. Rein auf Taktzahlen kannst du eh nicht gucken.Selbst wenn, die Dinger laufen in der Regel eh höher als das was da angegeben wird.Haben wir zuletzt bei dem Bauer, beim Auer angeguckt, die Boostgeschichten von den RyzenDinger und dass die nicht so gut sind, wie er sich das erhofft hat. Hast du eine leichteMöglichkeit, ohne was mit NPM oder Nodes zu machen, eine Python Datei über Javascriptauszuführen? What? Moment. Brauche keine Resultate von Python oder so. Es soll nurdie Python Datei exekuted werden. Moment. Du willst, du willst in Javascript quasinen Systemcall machen oder was? Du willst in Javascript quasi einfach nen Prozess starten,wenn ich das jetzt mal so richtig verstanden hab. Naja, also Node wirst du auf jeden Fallschon brauchen, weil du brauchst ja, du brauchst ja, du brauchst ja irgendeine Runtime. Undohne Node wird das nix. Oder ohne, sag mal, ohne irgendeinen Javascript, ohne irgendeineJavascript Runtime wird das nix. Es mag da vielleicht irgendwelche leichtgewichtigerenSachen geben, aber irgendeine Runtime brauchste. Oh, das ist cool, Airworker. Aber das wirdwahrscheinlich nur ganz basic Sachen unterstützen, oder? Also wenn du einfach nur nen Programmausführen willst, also ist egal, ob es jetzt ein Python Programm ist, ein Go-Programm,ein Shell-Script, dann machst du einfach, brauchst halt irgendwie ne Javascript Runtimeauf deinem System und sagst dann sowas, tja, in Python wärs jetzt irgendwie was OS-openoder sowas. In Javascript ehrlich gesagt, keine Ahnung, aber das ist halt auch ein bisschenvon der Runtime abhängig. Weiß ich jetzt nicht, wie man das in Node macht. Wahrscheinlichauch sowas wie process, execute oder sowas. Tja, Leute, es ist 21 Uhr, äh, 55. Ich glaub,ich muss gleich auf. Aber ich hab ehrlich gesagt gar keinen Bock aufzugehen. Aber ichmuss morgen wieder arbeiten gehen. Morgen KS. Ah, jetzt, ok, jetzt erzählt er, was erhaben will. Mein Raspberry Pi soll eine HTML-Seite haben, die einen Button auf der Seite hat.Wird der gedrückt, soll eine Python angemacht werden. Mehr nicht. Ah, ähm, das hat mirmit Javascript nichts zu tun. Du brauchst, du brauchst ein bisschen kleinzeitigen Javascript,aber das ist viel einfacher. Ähm, du könntest, du könntest sowas wie, sowas wie Flask oderso nehmen und einfach mini-Web-Server in Python starten, der, äh, deine Sachen ausführt.Das ist, das ist super simpel hier, guck mal. Mehr brauchste nicht. Das bindest du einfachin eine Python-Datei an, ein, und wenn einer diese, diese Url hier aufruft, dann wird dieseFunktion auf, ausgeführt. Und da kannst du natürlich dein, dein Python-Zeug drinne starten.Da kannst du nämlich das Backern einfach in Python hosten, das macht's viel einfacher.Und, ähm, für die Seite, für die Seite, die machst du entweder inline, schreibst duhier, dann HTML rein. Ähm, oder aber du lässt irgendwie eine statische Seite da drübersurfen. Das ist, das dürfte dann relativ einfach sein. Ah, so, so würde ich das wahrscheinlichmachen. Da würde ich nämlich einfach, ähm, in, in Python mein Backend starten. Ansonstenkönntest du das in jeder x-beliebigen anderen Sprache machen, da brauchst du kein Nodedafür oder so. Ja, das, du brauchst da wahrscheinlich, wahrscheinlich brauchst du da noch nichtmal großartigen Javascript für. Machst n Button, Submit, Submit auf die, auf die Urlund gut ist. Da brauchst du nicht mal Javascript für, da brauchste, da brauchste eine, eineZeit, eins oder zwei Zeilen HTML. Kannste alles inline machen. Ja, also das ist glaubich recht easy damit zu bewerkstelligen. Preise von den neuen Intel-CPUs, ah, da gucken wirjetzt noch mal schnell. Huge, äh, Quali. Beste Quali aller Zeiten hier. Was hat manzu bieten? Oh, langsam, wenn die Intel-CPU-Namen aber auch wieder un, unleserlicher, könntees ja kaum sein, äh. Guck mal, die i3 haben jetzt hier vier Kerne, acht Threads, ähm,ab dem i5 sind schon sechs Kerne, okay. Die sechs Kerne hab ich, bei mir noch ab dem i7gekriegt. Commit lag, die stehen auf lag, wow. Moment. Warum kostet das 1000, ah, Moment.Hi, ich hab mich verguckt. Ich hab mich verguckt. Es sind 129 Dollar. Ich wollt grad sagen,die i3 kostet jetzt 1000 Dollar. Was ist da los? Ähm. Okay, die Preise sind okay. Diesind jetzt wenigstens in Regionen, die konkurrenzfähig zu AMD sind. Aber die Bezeichnung ist ja schonmal wieder wir, oder? I9, 10800F, 10900F, 10900KF. Also mit K ist ja wieder, äh, taktänderbar.Was ist das, ein neuer Sockel wieder? Nee, nicht erst neu. Das ist tatsächlich wiederein neuer Sockel. Also Intel übertreibt's echt, ja. AMD schafft's irgendwie drei bisvier Jahre oder so mit dem gleichen Sockel. Und Intel braucht quasi bei jedem geändertenRegister irgendwie gleich einen neuen Sockel. So nach dem Motto, oh wir haben da ein Transistoran der anderen Stelle. Was machen wir denn da jetzt? Neuer Sockel. Was sonst? Intel machtimmer neuer Sockel. Ähm, Intel liebt ihre Pins. Die haben ja noch nicht mal mehr Pins.Das ist es ja gerade. Die haben ja nur noch diese Pads zum Auflegen jetzt. Oder habenIntel CPUs mittlerweile wieder Pins. Nee, ne? Diese Kontakte. Also was gibt's denn hier?Also, okay, schauen wir mal. Vergleichbar, ich hab dann 8700K. Das ist vergleichbar mitdem hier. Nur, dass ich jetzt zwei Kerne mehr kriegen würde. Takt hat sich nix geändert.Ist exakt das gleiche wie bei mir. Also ich hab ja meine auch über Takt. Ich weiß garnicht wie viel. Ich glaub' meiner ist standardmäßig mit 4,5 gelaufen. Aber Takt ist exakt dasgleiche wie bei mir. So, dass alle mit 5,1 laufen. Es hat zwei Kerne mehr. Kostet aberein bisschen weniger als damals meiner. Ich muss euch ehrlich sagen, fürs Spielen erscheintmir der hier eigentlich noch mit am attraktivsten. Also zum Spielen muss ich sagen, gefälltmir der hier eigentlich noch mit am besten. Der hat den besten Takt. Der hat ne gute Anzahlan Kerne. Mehr brauchen wir fürs Spielen eh nicht. Der ist preisleistungsmäßig auch okay.Ich mein, man könnte auch einfach den da nehmen. Bezahlt man 100€ mehr, 110€ mehr,hat nicht wirklich viel niedrigeren Takt. Mit dem passenden Board und der passenden Kühlungläuft der hier wahrscheinlich auch locker auf 4,8. Der ist auch nicht schlecht. Was istdenn da bei AMD vergleichbar? Der 3800? 8 Kerne oder 3800? Ne, müssen wir noch einhöher gehen. Ja, das ist ungefähr der vergleichbare. Der hat, nicht Kundenbewertung, der hat, jader kommt fast gleich heraus. Okay, das ist Turbo, Turbotakt. Dafür hat man dann nochzwei Kerne mehr. Tja, muss mal gucken, was dann wichtig ist. Aber ich muss sagen, dassieht mir doch hier relativ konkurrenzfähig aus. Wobei man halt sagen muss, 10 und 12Kerne braucht man eigentlich nicht. Dann würde ich lieber einen 3700X nehmen oder irgendwieso was. Für weniger als der, also auf dem Niveau. Also aktuell würde ich wahrscheinlichden hier nehmen. An CPUs. So, und das entspricht dann ungefähr dem hier. 8 Kerne hat der hierauch. Ja, dann würde ich den hier nehmen. Ah, guck mal, nur bei dem teureren kriegstdu hier den Multiplikator. Ich würde wahrscheinlich trotzdem den hier nehmen irgendwie, so bauchgefühlmäßig.Jetzt mal ein bisschen genauer überlegen. Aber ich finde, das sieht relativ konkurrenzfähigaus, was Intel jetzt hier gerade am Start hat. Glaubst du, Intels Grafikkarte werden alleszerficken? Nö, warum sollten sie? Was hast du gegen LGA Sockel? Nix. Ich habe nur wasdagegen, das Intel alle furzlange neuen Sockel hat. AMD hat immer noch diese eklig schnellkaputtbaren Dinge an ihren CPUs. Weiß ich nicht, was du meinst, keine Ahnung. Ich hatteschon lange kein AMD-CPU mehr. Gut, mal gucken, ob ich irgendjemand hosten kann. Kannwir irgendjemand hosten? Wen haben wir hier am Start? Irgendwie keiner da. Du folgst,den folge ich denn. Keiner so wirklich am Start. Na gut Leute, bis denn, machts gut,wir sehen uns, legt die Tage, CU!Wir sehen uns, legt die Tage, CU!Wir sehen uns, legt die Tage, CU!Wir sehen uns, legt die Tage, CU!Wir sehen uns, legt die Tage, CU!", "segments": [{"id": 1, "start": 0.0, "end": 2.0, "text": "Naja"}, {"id": 2, "start": 2.0, "end": 4.0, "text": "Noch keiner da"}, {"id": 3, "start": 4.0, "end": 6.0, "text": "Wie kann das sein"}, {"id": 4, "start": 6.0, "end": 8.0, "text": "Wo sind die Subbox Camper"}, {"id": 5, "start": 8.0, "end": 10.0, "text": "Lul weh"}, {"id": 6, "start": 10.0, "end": 12.0, "text": "Wub lul"}, {"id": 7, "start": 18.0, "end": 20.0, "text": "Festgestellt, dass ich meinen"}, {"id": 8, "start": 20.0, "end": 22.0, "text": "Overlays auch gar nicht gestartet habe"}, {"id": 9, "start": 24.0, "end": 26.0, "text": "Und KS"}, {"id": 10, "start": 26.0, "end": 28.0, "text": "Ok S"}, {"id": 11, "start": 48.0, "end": 50.0, "text": "Ich habe mir ein neues Mikrofon gekauft"}, {"id": 12, "start": 50.0, "end": 52.0, "text": "Zum Aufnehmen von Technik Videos"}, {"id": 13, "start": 52.0, "end": 56.0, "text": "Vielleicht probieren wir das nachher mal aus"}, {"id": 14, "start": 58.0, "end": 60.0, "text": "Aktuell bin ich ganz normal"}, {"id": 15, "start": 60.0, "end": 62.0, "text": "Über meine Zeit am Start"}, {"id": 16, "start": 66.0, "end": 68.0, "text": "Clani am Start, Silent Pain am Start"}, {"id": 17, "start": 68.0, "end": 84.0, "text": "Aja ja"}, {"id": 18, "start": 98.0, "end": 102.0, "text": "Kannst du ein gutes Auto Interface empfehlen?"}, {"id": 19, "start": 102.0, "end": 104.0, "text": "Ich kenne mich da nicht so gut aus"}, {"id": 20, "start": 104.0, "end": 106.0, "text": "Ich kann dir nur sagen welches ich habe"}, {"id": 21, "start": 106.0, "end": 110.0, "text": "Und welches ich schon seit 8 Jahren oder so verwende"}, {"id": 22, "start": 110.0, "end": 112.0, "text": "Ohne jegliche Probleme"}, {"id": 23, "start": 112.0, "end": 114.0, "text": "Aber das ist zu teuer"}, {"id": 24, "start": 114.0, "end": 116.0, "text": "Gibt es glaube ich auch gar nicht mehr"}, {"id": 25, "start": 116.0, "end": 118.0, "text": "Das ist zu teuer für einfach so"}, {"id": 26, "start": 118.0, "end": 120.0, "text": "Das ist natürlich geil"}, {"id": 27, "start": 120.0, "end": 122.0, "text": "Wenn man verschiedene Sachen anschließen will"}, {"id": 28, "start": 122.0, "end": 124.0, "text": "Wenn man eine Konsole anschließen will"}, {"id": 29, "start": 124.0, "end": 126.0, "text": "2 PCs anschließen will"}, {"id": 30, "start": 126.0, "end": 128.0, "text": "XLR Eingänge ein paar brauche"}, {"id": 31, "start": 128.0, "end": 130.0, "text": "Und optische Eingänge brauche oder so"}, {"id": 32, "start": 130.0, "end": 132.0, "text": "Da ist das ganz nice"}, {"id": 33, "start": 132.0, "end": 134.0, "text": "Aber für einfach nur ein Mikrofon anschließen"}, {"id": 34, "start": 134.0, "end": 136.0, "text": "Und ein bisschen was natürlich zu teuer"}, {"id": 35, "start": 136.0, "end": 140.0, "text": "Aber das ist das einzige Audio Interface was ich je hatte"}, {"id": 36, "start": 140.0, "end": 142.0, "text": "Und das habe ich jetzt schon 8 Jahre lang"}, {"id": 37, "start": 142.0, "end": 144.0, "text": "Und ist wirklich richtig gut das Ding"}, {"id": 38, "start": 144.0, "end": 146.0, "text": "Ist halt viel zu teuer"}, {"id": 39, "start": 146.0, "end": 148.0, "text": "Für ein bisschen sowas"}, {"id": 40, "start": 148.0, "end": 150.0, "text": "Also ich meine 440 Euro"}, {"id": 41, "start": 150.0, "end": 152.0, "text": "Das war damals noch ein Ticken teurer"}, {"id": 42, "start": 152.0, "end": 154.0, "text": "Aber die positive Bewertung finde ich sprechend für sich"}, {"id": 43, "start": 154.0, "end": 156.0, "text": "Das schöne daran ist"}, {"id": 44, "start": 156.0, "end": 158.0, "text": "Du hast ein Audio Knöpfchen vorne dran"}, {"id": 45, "start": 158.0, "end": 160.0, "text": "Wo du verschiedene Funktionen lauter, leiser"}, {"id": 46, "start": 160.0, "end": 162.0, "text": "Eingabequellen durchschalten kannst"}, {"id": 47, "start": 162.0, "end": 164.0, "text": "Du hast die Eingabe"}, {"id": 48, "start": 164.0, "end": 166.0, "text": "Hier vorne die Inputs"}, {"id": 49, "start": 166.0, "end": 168.0, "text": "Und hinten hast du noch mal so ein Breakout Kabel"}, {"id": 50, "start": 168.0, "end": 170.0, "text": "Wo dann im Endeffekt"}, {"id": 51, "start": 170.0, "end": 172.0, "text": "Ich weiß nicht ob sie dein Bild dabei haben"}, {"id": 52, "start": 172.0, "end": 176.0, "text": "Wo du glaube ich 16 Sachen anschließen kannst"}, {"id": 53, "start": 178.0, "end": 180.0, "text": "Ich weiß nicht ob die hier die Bilder haben"}, {"id": 54, "start": 180.0, "end": 182.0, "text": "Mit dem Breakout Kabel"}, {"id": 55, "start": 182.0, "end": 184.0, "text": "Aber hier guck"}, {"id": 56, "start": 184.0, "end": 186.0, "text": "Da hast du glaube ich 4 XLR Anschlüsse"}, {"id": 57, "start": 186.0, "end": 188.0, "text": "Du hast ein paar fette Klinkendinger"}, {"id": 58, "start": 188.0, "end": 190.0, "text": "Du hast sogar so ein MIDI Interface"}, {"id": 59, "start": 190.0, "end": 192.0, "text": "Das was man wahrscheinlich bloß noch als Keyboard Spieler braucht"}, {"id": 60, "start": 192.0, "end": 194.0, "text": "Keine Ahnung"}, {"id": 61, "start": 194.0, "end": 196.0, "text": "Das ist wirklich nice"}, {"id": 62, "start": 196.0, "end": 198.0, "text": "Das ist wirklich nice"}, {"id": 63, "start": 198.0, "end": 200.0, "text": "Theoretisch kannst du sogar ein paar Firewire anschließen"}, {"id": 64, "start": 200.0, "end": 204.0, "text": "Falls das irgendjemand im Jahr 2019 noch haben will"}, {"id": 65, "start": 204.0, "end": 206.0, "text": "Aber das ist wirklich gut"}, {"id": 66, "start": 206.0, "end": 208.0, "text": "Du kannst dir ja unten mal deinen Zettel verlinken mit Amazon vorstellen"}, {"id": 67, "start": 214.0, "end": 216.0, "text": "Das hatte ich früher"}, {"id": 68, "start": 216.0, "end": 218.0, "text": "Hatte auch Fettkohle gebracht"}, {"id": 69, "start": 218.0, "end": 220.0, "text": "Ich war zu faul es zu aktualisieren"}, {"id": 70, "start": 220.0, "end": 222.0, "text": "Deswegen"}, {"id": 71, "start": 222.0, "end": 224.0, "text": "Schreibe ich mir gleich mal auf"}, {"id": 72, "start": 228.0, "end": 230.0, "text": "Muss ich mal wieder machen"}, {"id": 73, "start": 230.0, "end": 232.0, "text": "Weil Amazon Ref links bringen passiv"}, {"id": 74, "start": 232.0, "end": 245.0, "text": "übelst viel Kohle. Doch doch das hat 6,3 mm Klinkeanschlüsse, 2 Stück, 3,5 mm Klinkeanschlüsse,"}, {"id": 75, "start": 245.0, "end": 252.24, "text": "2 Stück vorne und hier am Breakout Kabel hast du auch noch ein paar. Du hast Inputs hast"}, {"id": 76, "start": 252.24, "end": 260.92, "text": "du wirklich mehr als genug und das beste ist, du hast sogar, du hast sogar einen optischen"}, {"id": 77, "start": 260.92, "end": 269.84, "text": "Input, der entweder, wie heißt das, dieses normale SPDIF oder so kann, oder kann sogar"}, {"id": 78, "start": 269.84, "end": 274.24, "text": "ADAT mit 8 Channels, 6 Channels und so was und du kannst sogar durchschleifen in und"}, {"id": 79, "start": 274.24, "end": 279.6, "text": "out. Also das hat alles, das hat wirklich alles, was man irgendwie braucht. Es kostet"}, {"id": 80, "start": 279.6, "end": 282.48, "text": "ein bisschen was und ich kann jetzt nicht sagen, ob es das beste ist oder sonst was,"}, {"id": 81, "start": 282.48, "end": 288.12, "text": "es hat sogar noch Firewire Anschluss. Hier vorne kannst du die Mikros umschalten. Also"}, {"id": 82, "start": 288.12, "end": 291.68, "text": "das Gesamtpaket fand ich das damals super und ich bin bis heute davon überzeugt. Also"}, {"id": 83, "start": 291.68, "end": 296.4, "text": "der Kauf, der hat sich wirklich mal gelohnt. Das geht seit 8 Jahren oder so schon ohne"}, {"id": 84, "start": 296.4, "end": 305.48, "text": "Probleme das Ding. Ja aber das mit Amazon verlinken, das mache ich dann mal so, mal"}, {"id": 85, "start": 305.48, "end": 309.28, "text": "gucken. Ja und nachher, wenn im Stream alle da sind, wir können mal, ich habe mir für,"}, {"id": 86, "start": 309.28, "end": 315.84, "text": "ich habe mir ein Mikro gekauft für, ist nichts dolles, ja, siehst du auch schon, dass es"}, {"id": 87, "start": 315.84, "end": 319.68, "text": "einen Klinkeanschluss hat, aber der Hersteller ist ganz gut, von dem habe ich schon so ein"}, {"id": 88, "start": 319.68, "end": 328.52, "text": "Mikrofon für Interviews oder so, nicht dass ich oft Interviews mache oder so. Aber ich"}, {"id": 89, "start": 328.52, "end": 333.6, "text": "habe mir mal ein Mikrofon gekauft, was ein bisschen Kabel hat, was ich an meinen Zoom"}, {"id": 90, "start": 333.6, "end": 338.56, "text": "Audio Recorder anschließen kann für, wenn ich Technikvideos aufnehme. Also sprich, wenn"}, {"id": 91, "start": 338.56, "end": 342.6, "text": "ich dann wieder am Tisch stehe und ein bisschen rumlabern und so was, weil der Sound, der"}, {"id": 92, "start": 342.6, "end": 352.6, "text": "Sound beim letzten Video war jetzt ja schon nicht so toll. Stimmt, Max, ich glaube du"}, {"id": 93, "start": 352.6, "end": 358.68, "text": "hast Recht, der muss glaube ich sogar Klinke haben, weil die Stromversorgung nur darüber"}, {"id": 94, "start": 358.68, "end": 366.04, "text": "gescheit funktioniert, die brauchen ja nur ganz wenig, aber sie brauchen Strom. Ich"}, {"id": 95, "start": 366.04, "end": 373.88, "text": "glaube die müssen, ich glaube die müssen sogar Klinke haben. Ja, weil der Sound hier"}, {"id": 96, "start": 373.88, "end": 392.2, "text": "war ja nicht sonderlich gut, ne, der Sound ist schon, es halt sehr, weil das halt im Wohnzimmer"}, {"id": 97, "start": 392.2, "end": 397.32, "text": "unten aufgenommen ist und ich habe es zwar mit dem Audio Recorder aufgenommen, ich habe"}, {"id": 98, "start": 397.32, "end": 402.36, "text": "es mit dem Audio Recorder und der Kamera gleichzeitig aufgenommen, aber es halt halt einfach im"}, {"id": 99, "start": 402.36, "end": 410.76, "text": "Raum. Soll ich das Mikrofon mal auspacken und ranstecken, wollen wir mal ausprobieren"}, {"id": 100, "start": 410.76, "end": 414.44, "text": "wie sich das anhört? Kann das ja einfach mal ranstecken, wir können das mal ausprobieren."}, {"id": 101, "start": 414.44, "end": 433.16, "text": "Ja, mach mal, ok, ich probiere das mal aus, frisch verpackt von Amazon, kommen wir hier,"}, {"id": 102, "start": 433.16, "end": 445.56, "text": "ok, jetzt haben wir Unboxing. Wo habe ich denn jetzt dagegen geschmissen, ich habe einfach"}, {"id": 103, "start": 445.56, "end": 465.88, "text": "gesagt, ich muss es mal aufmachen. Ok, das ist schon mal ganz cool verpackt, ist in so"}, {"id": 104, "start": 465.88, "end": 472.76, "text": "einem Beutel drin, ist so ein komisches Salz dabei, was kein Mensch braucht, eigentlich"}, {"id": 105, "start": 472.76, "end": 482.92, "text": "sollte angeblich auch ein Headset-Bügel dabei sein, aber ist nicht, oder? Hä, ich dachte,"}, {"id": 106, "start": 482.92, "end": 495.24, "text": "da soll so ein Bügel dabei sein, guckt mal. Ich glaube, das ist, ach ne, das ist, da ist"}, {"id": 107, "start": 495.24, "end": 504.76, "text": "nicht dabei, das ist quasi, das ist wie bei Essens-Serviervorschlag. Ok, ich probiere"}, {"id": 108, "start": 504.76, "end": 509.96, "text": "das jetzt mal aus, also hier ist so ein Klippse, hier ist so ein Klippse dabei, ich probiere,"}, {"id": 109, "start": 509.96, "end": 514.6, "text": "ich mache mir das jetzt mal als T-Shirt hier dran und dann stöpsel ich es mal um und wir"}, {"id": 110, "start": 514.6, "end": 521.68, "text": "probieren das aus. Warning, haha, das ist ja geil, ich weiß nicht, sieht man hier irgendwo"}, {"id": 111, "start": 521.68, "end": 529.68, "text": "auf dem Ding? Ey, da ist, da ist ein Mikrofon, das sieht so aus, nur das hier, das hier ein"}, {"id": 112, "start": 529.68, "end": 537.32, "text": "Warning dran ist, Warning, Strangulation Hazard, also Achtung, dass ich mich nicht damit erhänge"}, {"id": 113, "start": 537.32, "end": 552.16, "text": "mit dem Kabel. Strangulation Hazard. This cable contains Kevlar and has the potential risk of"}, {"id": 114, "start": 552.16, "end": 559.72, "text": "causing strangulation. Avoid looping the cable around the neck and keep out of reach of children."}, {"id": 115, "start": 559.72, "end": 568.32, "text": "Gut, das musste jetzt mal gesagt werden. Also Leute, hofft mal, dass ich mich nicht erwürge"}, {"id": 116, "start": 568.32, "end": 573.68, "text": "mit dem Kabel jetzt irgendwie, ne, also man kann ja alles passieren. Auf der Rückseite"}, {"id": 117, "start": 573.68, "end": 578.4, "text": "von Tastaturen steht auch, dass das Verwenden einer Tastatur zu schweren gesundheitlichen"}, {"id": 118, "start": 578.4, "end": 584.28, "text": "Schäden führen kann. Just ma, Stufe 2, nein Stufe 1, abonniert drei Monate, Dankeschön,"}, {"id": 119, "start": 584.28, "end": 595.96, "text": "Vollgas, Alter. Moment, stimmt gar nicht, gar kein Prime. IQ steigt wieder ins unermessliche"}, {"id": 120, "start": 595.96, "end": 605.56, "text": "hier. So, ok, also, machen wir das mal auseinander. Das Kabel ist leider nicht ganz so lang, wie"}, {"id": 121, "start": 605.56, "end": 611.64, "text": "ich gedacht habe, aber das ist nicht schlimm, weil so eine Klinkeverlängerung ist nur wirklich"}, {"id": 122, "start": 611.64, "end": 621.76, "text": "kein, kein Ding. Drei Monate? Zwei Monate, ja. Ok, so, jetzt muss man hier irgendwie den,"}, {"id": 123, "start": 621.76, "end": 640.88, "text": "wie funktioniert denn das? Wie macht man das da dran? Wie macht man das da jetzt? Fack,"}, {"id": 124, "start": 640.88, "end": 649.36, "text": "wie macht man das da rein? Da ist irgendeine komische Schleife drin, da muss man das Mikro"}, {"id": 125, "start": 649.36, "end": 660.32, "text": "glaube ich so rein, reinstelzen irgendwie, dass es hält. Hab ich auch immer das funktioniert?"}, {"id": 126, "start": 660.32, "end": 666.48, "text": "Äh, keine Ahnung, vielleicht mach ich das jetzt kaputt. Fest ist das da jetzt aber"}, {"id": 127, "start": 666.48, "end": 679.28, "text": "nicht drin. Sack voll, es waggelt. Wie macht man das? Wie, wie macht man das? So, Achtung,"}, {"id": 128, "start": 679.28, "end": 696.84, "text": "wo ist das? Ah hier, da steht sogar alles dabei, wie es funktioniert. Ah, ganz anders"}, {"id": 129, "start": 696.84, "end": 705.0, "text": "funktioniert es, als wie ich es gemacht habe. Ich hab's verkackt. Hab das falsch rum, falsch"}, {"id": 130, "start": 705.0, "end": 718.52, "text": "rum dran gemacht. So, ich muss das eigentlich, das kommt da oben durch, das kommt da oben"}, {"id": 131, "start": 718.52, "end": 726.04, "text": "durch, aha. Ihr seht doch mal, ich bin schon überfordert mit so einem poplichen Mikrofon."}, {"id": 132, "start": 726.04, "end": 731.16, "text": "Außerdem hat sich das Kabel verknotet, wie kann sich das Kabel, also Leute, wie kann"}, {"id": 133, "start": 731.16, "end": 734.76, "text": "sich das Kabel verknoten? Ich hab das Kabel gerade aus der Packung gemacht, das ist eigentlich"}, {"id": 134, "start": 734.76, "end": 753.8, "text": "gar nicht möglich. Ok, jetzt hab ich's, jetzt hab ich's. Jetzt ist dran. Ok, ich stöpsel"}, {"id": 135, "start": 753.8, "end": 762.4, "text": "das jetzt mal dran hier an mich. So, ich hör mich jetzt halt, also ich hör mich jetzt"}, {"id": 136, "start": 762.4, "end": 766.96, "text": "halt selbst nicht, ich stöpsel mich jetzt mal um. Wie mach ich denn das jetzt am besten?"}, {"id": 137, "start": 766.96, "end": 775.12, "text": "Ich stöpsel mich jetzt mal um, mach ich hier vorne mal ans T-Shirt. Also ich hör mich"}, {"id": 138, "start": 775.12, "end": 780.68, "text": "jetzt selbst, es kann sein, dass es übelst zu laut ist oder übelst zu leise oder so,"}, {"id": 139, "start": 780.68, "end": 798.44, "text": "das müssen wir jetzt mal ausprobieren, also haltet euch mal die Ohren zu."}, {"id": 140, "start": 798.44, "end": 827.88, "text": "Äh, es geht nicht, oder? Es hat nicht funktioniert. Ha. Ok."}, {"id": 141, "start": 827.88, "end": 837.92, "text": "Ok, wir machen noch mal was, ich hab nämlich ne Idee. Es könnte sein, dass es einfach mega"}, {"id": 142, "start": 837.92, "end": 844.32, "text": "leise war und mein Noise Gate nicht. Ich mach mal kurz das Noise Gate aus. Das heißt,"}, {"id": 143, "start": 844.32, "end": 853.4, "text": "ihr hört jetzt wirklich jeden Mist, egal wie leise ich laber oder nicht. So, ich stöpsel"}, {"id": 144, "start": 853.4, "end": 861.2, "text": "das nochmal an, weil den Ein- und Ausschalter hat es nicht."}, {"id": 145, "start": 883.4, "end": 908.2, "text": "Ok, ich mach mal kurz das Noise Gate aus, weil den Ein- und Ausschalter hat es nicht."}, {"id": 146, "start": 908.2, "end": 936.64, "text": "Da hat jetzt nichts getan irgendwie, oder? Ha. Ska-Mast, ha? Knack-Knack."}, {"id": 147, "start": 936.64, "end": 949.28, "text": "Ist das, bin ich Ska-Mast worden, oder? Das geht nicht am PC? Das muss, ich probier"}, {"id": 148, "start": 949.28, "end": 957.28, "text": "es jetzt mal an meinem Audiorecorder aus. Ich stöpsel es mal schnell an meinen Audiorecorder,"}, {"id": 149, "start": 957.28, "end": 981.0, "text": "da muss es eigentlich funktionieren. So. Ok, ich stöpsel es mal an meinem Audiorecorder,"}, {"id": 150, "start": 981.0, "end": 995.84, "text": "da muss es eigentlich funktionieren. Was soll das, warum geht das nicht? Hm, war jetzt"}, {"id": 151, "start": 995.84, "end": 1011.76, "text": "zwar so nicht geplant, aber. So. Macht es irgendwas? Blub, blub, blub. Test, Test, Test,"}, {"id": 152, "start": 1011.76, "end": 1021.92, "text": "Test, Test, Nö. Ja, Leute. Hm. Ich hab ehrlich gesagt keine Ahnung, warum das nicht funktioniert."}, {"id": 153, "start": 1021.92, "end": 1033.24, "text": "Ist aber doof. Ja, aber sag mal, so in meinem Audiointerface sollte es doch eigentlich funktionieren."}, {"id": 154, "start": 1033.24, "end": 1044.0, "text": "Hm. Ok, keine Ahnung. Naja, muss ich nachher mal ausprobieren, muss ich jetzt ja nicht"}, {"id": 155, "start": 1044.0, "end": 1047.76, "text": "on stream machen. Ist ja nicht nötig, aber ich hab jetzt gedacht, mich schließt das"}, {"id": 156, "start": 1047.76, "end": 1053.76, "text": "da voran und gut ist. Aber anscheinend ist die Sache wieder deutlich komplexer als man"}, {"id": 157, "start": 1053.76, "end": 1059.48, "text": "sich das vorstellt. So ein Mikro einfach in, so ein Mikrofon einfach in Eingang stöpseln,"}, {"id": 158, "start": 1059.48, "end": 1087.2, "text": "das geht ja nicht. Naja, gut. Hm. Keine Ahnung, was soll das, was soll das, was soll das,"}, {"id": 159, "start": 1087.2, "end": 1090.84, "text": "was soll das, was soll das, was soll das, was soll das, was soll das. Keine Ahnung, also"}, {"id": 160, "start": 1090.84, "end": 1097.92, "text": "warum das nicht funktioniert, vielleicht. Also, das. China Adapter bestellen, genau,"}, {"id": 161, "start": 1097.92, "end": 1108.44, "text": "deswegen hab ich schon Aliexpress auf. Das ist ja jetzt aber merkwürdig. Man braucht"}, {"id": 162, "start": 1108.44, "end": 1135.28, "text": "da nen fucking Adapter für. Man braucht wirklich nen Adapter dafür, dass ich das am PC verwenden"}, {"id": 163, "start": 1135.28, "end": 1145.72, "text": "kann. Was ist denn das für ein Crap? Ach, vielleicht kann ichs mit der Cam. Warum geht"}, {"id": 164, "start": 1145.72, "end": 1153.12, "text": "das mit meinem Audiorecorder nicht, das fuckt mich jetzt übelst ab. Naja, gut, ähm. Wo"}, {"id": 165, "start": 1153.12, "end": 1158.64, "text": "hab ich denn den Audiorecorder überhaupt hingeschmissen? Geht euch das teilweise auch so, dass ihr"}, {"id": 166, "start": 1158.64, "end": 1163.52, "text": "Dinge in der Hand hattet und dann macht ihr was anderes und legt das kurz weg und dann"}, {"id": 167, "start": 1163.52, "end": 1170.16, "text": "seht ihrs nicht mehr. Das ist richtig MonkaS. Weit, es kann doch nicht weit sein. Ach, da"}, {"id": 168, "start": 1170.16, "end": 1177.2, "text": "ist es. Hab's auf die Erde gelegt, ne, beim Schreibtisch. Lest mal bei Amazon die erste"}, {"id": 169, "start": 1177.2, "end": 1201.96, "text": "Frage. Aha. Rode TRS auf TRS. Oh ne, dafür brauch ich jetzt echt noch mal nen extra Adapter?"}, {"id": 170, "start": 1201.96, "end": 1222.52, "text": "Das ist aber doof. Das ist aber doof. Ich hab noch nen Rode, ich hab noch nen Rode XLR"}, {"id": 171, "start": 1222.52, "end": 1235.56, "text": "Adapter. Ob das damit funktioniert? Das ist nen 3,5mm Klinke auf XLR Adapter. Das können"}, {"id": 172, "start": 1235.56, "end": 1242.04, "text": "wir mal ausprobieren, ob das damit funktioniert. Wahrscheinlich ist das Mikrofon RIP danach"}, {"id": 173, "start": 1242.04, "end": 1247.72, "text": "oder so. Aber das wird wahrscheinlich auch nicht funktionieren, wenn die Pins nicht"}, {"id": 174, "start": 1247.72, "end": 1275.36, "text": "da sind. Ah ja. So, angestöpselt ist es, aber macht gar nix. Na geil. Ok Leute, RIP, dann"}, {"id": 175, "start": 1275.36, "end": 1278.4, "text": "halt nicht. Dann bring ich das jetzt mal wieder weg. Dann probieren wir das jetzt nicht aus."}, {"id": 176, "start": 1278.4, "end": 1284.6, "text": "Das wäre eigentlich ne coole Sache. Ich hab mir mal vor ein paar Jahren so nen Funk-Mikrofon-Ding"}, {"id": 177, "start": 1284.6, "end": 1288.92, "text": "bei Toman gekauft, allerdings ging mir das immer auf den Keks mit Batterien und sowas."}, {"id": 178, "start": 1288.92, "end": 1295.08, "text": "Ich will einfach meinen Audio-Recorder neben mich legen und gut is. Kosten dieser komische"}, {"id": 179, "start": 1295.08, "end": 1306.6, "text": "Adapter hier. Ey, 3,5mm auf AR45, also ich bin eher dafür 3,5mm auf Gartenschlauch. Kosten"}, {"id": 180, "start": 1306.6, "end": 1319.72, "text": "der Adapter 10 Euro. Ist das nicht euer Ernst? What the fuck? Das ist doch nix Rode-spezifisches,"}, {"id": 181, "start": 1319.72, "end": 1325.36, "text": "das ist doch wahrscheinlich so ein ganz publischer, das kann doch nicht sein, Aliexpress. Ups,"}, {"id": 182, "start": 1325.36, "end": 1337.64, "text": "nein, ich hab es so chinesisch umgestellt. Fuck, wie stelle ich es wieder zurück? Ja,"}, {"id": 183, "start": 1337.64, "end": 1344.12, "text": "sowas da, das ist doch schon mal gut hier, aber das ist das falsche. Das ist genormt,"}, {"id": 184, "start": 1344.12, "end": 1371.0, "text": "das denke ich auch. Egal, ich schmeiß jetzt das Mikrofon und den Adapter mal in die Ecke."}, {"id": 185, "start": 1371.0, "end": 1396.88, "text": "Enttäuschend Leute, enttäuschend. Das ist Windwacke, oder? Tickenlauter gehört die"}, {"id": 186, "start": 1396.88, "end": 1409.04, "text": "Musik schon mal. Okay, naja, dann hat sich das zumindest schon mal erledigt. Das funktioniert"}, {"id": 187, "start": 1409.04, "end": 1412.72, "text": "nicht, wie ich mir das gedacht hab. Also Leute, ich hab heute gar nix spezielles, oh was geht"}, {"id": 188, "start": 1412.72, "end": 1427.56, "text": "denn jetzt im Chat ab? Ich erkenne nicht, was das sein soll. Irgendein Tintenfisch, ich"}, {"id": 189, "start": 1427.56, "end": 1433.24, "text": "hab keine Ahnung, was das sein soll. Gut, das brauchen wir nicht, weg, weg, weg, weg,"}, {"id": 190, "start": 1433.24, "end": 1438.2, "text": "weg. Wir probieren es zwar im Stream aus, aber hat natürlich nicht funktioniert. Ganz"}, {"id": 191, "start": 1438.2, "end": 1442.84, "text": "toll. Hab ich irgendwelche Fragen im Chat eigentlich übersehen? Gehen wir mal auf Amazon, ja, aber"}, {"id": 192, "start": 1442.84, "end": 1451.6, "text": "da haben wir uns ja gerade schon angeguckt. Und wisst ihr, was das witzige ist? Ich hab"}, {"id": 193, "start": 1451.6, "end": 1456.28, "text": "jetzt ja das neue iPhone aufgenötigt bekommen, es hat gar kein Klinkgestecker mehr dafür."}, {"id": 194, "start": 1456.28, "end": 1470.24, "text": "Beste Programmiersprache deiner Meinung nach? Das kommt immer auf den Anwendungszweck an."}, {"id": 195, "start": 1470.24, "end": 1486.16, "text": "Ja, nur noch Bluetooth Kopfhörer oder die neue Apple Kopfhörer, die haben jetzt einen"}, {"id": 196, "start": 1486.16, "end": 1490.16, "text": "Lightning Anschluss. So was Beknacktes, Alter. Das wisst ihr, was ich nicht verstehe? Also"}, {"id": 197, "start": 1490.16, "end": 1504.56, "text": "ich hab ja hier jetzt das, den Brocken hier, das XR. Und wer da allen Ernstes erzählt,"}, {"id": 198, "start": 1504.56, "end": 1509.84, "text": "da war kein Platz mehr, den Klinkeanschluss dran zu machen, der ist echt nicht mehr ganz"}, {"id": 199, "start": 1509.84, "end": 1515.6, "text": "dicht. Das ist das fetteste Stück, was man so in der Hose haben kann, also, also Smartphone."}, {"id": 200, "start": 1515.6, "end": 1526.76, "text": "Das ist ein riesen fettes Teil, das XR, da wäre Platz gewesen für 75 Klinkeanschlüsse,"}, {"id": 201, "start": 1526.76, "end": 1538.8, "text": "aber nicht bei Apple. Ascii Spam, sind wir im Jahr 2001 oder was? Oh, Subs, ich hab was"}, {"id": 202, "start": 1538.8, "end": 1558.08, "text": "übersehen. Der Karlsson Twitch Prime, 3 Monate, Dankeschön, Poggers. Komisch. Ist"}, {"id": 203, "start": 1558.08, "end": 1563.76, "text": "auch bei allen Geräten so, das macht es nicht besser, wenn das bei allen Geräten so ist."}, {"id": 204, "start": 1563.76, "end": 1570.12, "text": "Also auf den Klinkeanschluss zu verzichten ist einfach ultrabeknackt, weil ich mein,"}, {"id": 205, "start": 1570.12, "end": 1574.72, "text": "einen digital analoge Konverter braucht man eh schon, das Ding hat Lautsprecher, das geht"}, {"id": 206, "start": 1574.72, "end": 1580.48, "text": "nicht ohne. Machst du mit dem Server weiter? Das weiß ich noch nicht genau. Könnten wir"}, {"id": 207, "start": 1580.48, "end": 1584.72, "text": "eigentlich machen, ich weiß noch nicht so genau, was ich machen will, ehrlich gesagt."}, {"id": 208, "start": 1584.72, "end": 1592.08, "text": "Ich hab jetzt nichts Spezielles vor, ich hab einfach mal Streben angemacht, sonst nichts."}, {"id": 209, "start": 1592.08, "end": 1597.36, "text": "Wir können uns auch mal wieder ein paar Stellenanzeigen angucken, was es da interessantes gibt. Wie"}, {"id": 210, "start": 1597.36, "end": 1601.12, "text": "gesagt, ich gucke ja immer mal wieder, also eigentlich nur zur allgemeinen Belustigung."}, {"id": 211, "start": 1601.12, "end": 1610.2, "text": "Hat was mit Wasserfestigkeit, tut uns die Klinke weglassen, dass halt, also ja ich glaub"}, {"id": 212, "start": 1610.2, "end": 1618.68, "text": "dir, dass die das sagen, aber die Geräte vorher sind auch nicht abgesoffen und tauchen"}, {"id": 213, "start": 1618.68, "end": 1636.2, "text": "will mit seinem Smart Follower kaum einer. Ne, ich glaube das ist so ein Ding, Apple hat"}, {"id": 214, "start": 1636.2, "end": 1651.76, "text": "angefangen und die anderen machen es nach, weil. Kannst deinen Abfallsaal richten. Was"}, {"id": 215, "start": 1651.76, "end": 1655.6, "text": "wird hier so getrieben, ja das ist noch nicht so ganz raus. Ich wollte gerade mal ein neues"}, {"id": 216, "start": 1655.6, "end": 1659.04, "text": "Mikro testen, was ich mir für Technikvideos gekauft hab, aber festgestellt, es geht am"}, {"id": 217, "start": 1659.04, "end": 1666.36, "text": "PC nicht. Natürlich doof gewesen. Ich kann es mal an meiner Kamera ausbringen, vielleicht"}, {"id": 218, "start": 1666.36, "end": 1674.0, "text": "funktioniert es daran. Samsung kriegt das auch mit Klinke hin, ok. Schau das Fortnite"}, {"id": 219, "start": 1674.0, "end": 1678.92, "text": "Event an. Ist das Fortnite Event das mit diesem schwarzen Loch? Das muss mir irgendjemand erklären,"}, {"id": 220, "start": 1678.92, "end": 1688.48, "text": "das hab ich nicht gecheckt. Das hab ich nicht gecheckt. Was ist das überhaupt? Gibt's da"}, {"id": 221, "start": 1688.48, "end": 1694.64, "text": "in game ein schwarzes Loch und irgendwo erscheinen Zahlen oder so, ne? Ich hab's null gecheckt,"}, {"id": 222, "start": 1694.64, "end": 1698.96, "text": "aber ich meine ich spiele auch kein Fortnite, deswegen weiß ich das wahrscheinlich. Als"}, {"id": 223, "start": 1698.96, "end": 1706.0, "text": "Fortnite Fan wüsste ich das wahrscheinlich sofort, ja. Did Fortnite really get deleted?"}, {"id": 224, "start": 1706.0, "end": 1723.96, "text": "Aha, tja. Grip Fortnite. Fortnite wurde gelöscht, wenn das Google sagt. Welche Kamera hast du,"}, {"id": 225, "start": 1723.96, "end": 1732.4, "text": "äh, irgendeinen Sony Teil? Ich weiß nicht welche, genau. Aber die reicht. Holst du dir"}, {"id": 226, "start": 1732.4, "end": 1737.8, "text": "Modern Warfare? Ja, klar. Also ich hoffe ich krieg's. Ob ich mir holen werde, weiß ich"}, {"id": 227, "start": 1737.8, "end": 1741.52, "text": "nicht. Ob ich mir holen würde, weiß ich nicht. Aber wenn ich's kriege, nehm ich's. Die Sache"}, {"id": 228, "start": 1741.52, "end": 1747.76, "text": "ist nämlich die, ich gehe nämlich davon aus, dieses Jahr, dass Modern Warfare ganz ok werden"}, {"id": 229, "start": 1747.76, "end": 1753.16, "text": "wird. Rein vom gametechnischen her. Es hat ein paar Dinge, die mir auf den Sack gehen,"}, {"id": 230, "start": 1753.16, "end": 1757.04, "text": "aber ich glaube an sich wird's ok. Aber die werden ihr Game komplett durch irgendwelche"}, {"id": 231, "start": 1757.04, "end": 1760.72, "text": "Lootboxkacke wieder zerstören. Ich mein, sie haben zwar vorher erst einen Tweet irgendwie"}, {"id": 232, "start": 1760.72, "end": 1767.36, "text": "abgesetzt, dass es, dass keiner bei Infinity Ward überhaupt an einem Lootbox und Supply"}, {"id": 233, "start": 1767.36, "end": 1773.0, "text": "Drop System arbeitet, aber ehrlich gesagt, wer glaubt diesem Blödsinn, den die erzählen,"}, {"id": 234, "start": 1773.0, "end": 1779.0, "text": "ne? Ähm, ich erinnere mal eine Sache, der hat wortwörtlich gesagt zu Modern Warfare"}, {"id": 235, "start": 1779.0, "end": 1782.72, "text": "3, Last Stand ist nicht im Spiel. Fuck you Last Stand. Da erinnert sich dann noch einer"}, {"id": 236, "start": 1782.72, "end": 1787.6, "text": "dran. Dann kam das Game raus und hatte Last Stand drinne. Hieß halt anders. So, das heißt"}, {"id": 237, "start": 1787.6, "end": 1794.68, "text": "jetzt auch anders. Ähm, und natürlich ist das wieder im Game drinne. Oder aber, sie"}, {"id": 238, "start": 1794.68, "end": 1798.72, "text": "arbeiten nicht dran, weil sie müssen nicht mehr dran arbeiten, weil das ist schon fertig."}, {"id": 239, "start": 1798.72, "end": 1807.84, "text": "Alles beknackt. Totaler Blödsinn. Einfach nur die Leute skammarst, ist das. Ein Show"}, {"id": 240, "start": 1807.84, "end": 1822.36, "text": "Me hat Klinke. Ja, ich verstehe das auch nicht, warum die es nicht hinkriegen. Hach ja, PS4"}, {"id": 241, "start": 1822.36, "end": 1827.8, "text": "exklusiv. Das ist auch so ein Ding, was mich ankotzt, ne? Diese PS-, also ich mein, dass"}, {"id": 242, "start": 1827.8, "end": 1833.36, "text": "man ne Woche exklusive Sachen hat, vielleicht sogar nen Monat bei manchen Sachen, kann ich"}, {"id": 243, "start": 1833.36, "end": 1838.56, "text": "ja nachvollziehen. Aber nen Bestandteil des Games für ein Jahr Exklusivität ist bescheuert."}, {"id": 244, "start": 1838.56, "end": 1843.24, "text": "Gibt's da eigentlich was Neues dazu? Ist da eigentlich jetzt was Neues zu mittlerweile?"}, {"id": 245, "start": 1843.24, "end": 1854.92, "text": "Ne, das ist halt einfach so, ne? Ich mein, überlegt euch mal, es ist 2020, es kommt dann"}, {"id": 246, "start": 1854.92, "end": 1865.64, "text": "irgendwie, keine Ahnung, Black Ops, äh, Black Ops Prequel oder irgendwie sowas raus. Und"}, {"id": 247, "start": 1865.64, "end": 1873.24, "text": "worauf wird man 2020 mehr abgehen? Oder was wird man, was wird man Oktober 2020 sagen?"}, {"id": 248, "start": 1873.24, "end": 1878.36, "text": "Wird man sagen, yeah, Call of Duty 2020 kommt raus? Oder, yeah, ich kann jetzt endlich den"}, {"id": 249, "start": 1878.36, "end": 1895.56, "text": "Modern Warfare, äh, äh, äh, äh, Dickens Back Ops Modus spielen. Sagt doch keiner."}, {"id": 250, "start": 1895.56, "end": 1913.72, "text": "an. Wub wub. Das ist, der Modus der exklusiv ist, ist dieser Spec Ops Modus aus MW3, oder"}, {"id": 251, "start": 1913.72, "end": 1922.44, "text": "Survival, Survival, genau. Da hat man, das, das, ah fuck. Das ist auf den Multiplayer"}, {"id": 252, "start": 1922.44, "end": 1928.2, "text": "Maps gegen Bots im Endeffekt. Es ist quasi Zombies, ohne Zombies zu sein, nur in schlechter"}, {"id": 253, "start": 1928.2, "end": 1935.88, "text": "auf Multiplayer Maps. Also eigentlich nichts, was man wirklich vermisst, aber es ist beknackt,"}, {"id": 254, "start": 1935.88, "end": 1940.48, "text": "dass es ein Ja exklusiv ist. Das ist, also es ist schon ein, sag mal mal ein relativ"}, {"id": 255, "start": 1940.48, "end": 1945.88, "text": "großer Bestandteil irgendwo. Also so von dieser Sache, was sie da erzählen, das macht"}, {"id": 256, "start": 1945.88, "end": 1952.36, "text": "mal, das macht 0,1% aus oder so, was sie da erzählt haben, ist natürlich totaler Blödsinn."}, {"id": 257, "start": 1952.36, "end": 1961.64, "text": "Das ist, wie wenn man sagt, Zombies macht nur 1% aus. Genau, das Survival Modus kommt"}, {"id": 258, "start": 1961.64, "end": 1965.72, "text": "ja später. Das Spec Ops Missions Modus, der kommt ja, das ist auch das, das ist das,"}, {"id": 259, "start": 1965.72, "end": 1971.88, "text": "was ich persönlich auch cool fand, bei MW2 und 3. MW2 habe ich mit dem Frisör richtig"}, {"id": 260, "start": 1971.88, "end": 1982.6, "text": "gerne die Co-Op Spec Ops Mission gespielt. Aber ansonsten kennt noch einer die, kennt"}, {"id": 261, "start": 1982.6, "end": 1993.72, "text": "noch einer die AC130 Mission aus MW2, also die Spec Ops Mission. Da musste ein Spieler,"}, {"id": 262, "start": 1993.72, "end": 1998.48, "text": "da hat ein Spieler hier AC130 und ein Spieler war auf der Erde und wenn ein Spieler gestorben"}, {"id": 263, "start": 1998.48, "end": 2010.0, "text": "ist, war vorbei. Das war eigentlich ziemlich cool für Co-Op. Das war eigentlich ziemlich"}, {"id": 264, "start": 2010.0, "end": 2014.12, "text": "cool. Ich meine, das hat einen kleinen Teil vom Game aus gemacht, aber es war doch dennoch,"}, {"id": 265, "start": 2014.12, "end": 2019.44, "text": "es war das echt ein cooler Teil. Ich finde, eh in MW2 haben sie damals richtig, richtig"}, {"id": 266, "start": 2019.44, "end": 2035.92, "text": "viel Zeug reingestopft. Da war für jeden irgendwas dabei. Ah, Lukizu, ich finde, Flag Ops 1 war"}, {"id": 267, "start": 2035.92, "end": 2049.6, "text": "der beste. Wie teuer ist es eigentlich, den Nass zu bauen, fällt mir gerade so ein, nur"}, {"id": 268, "start": 2049.6, "end": 2055.52, "text": "mit SSDs. Sagen wir mal, ich will einen, keine Ahnung, wir gucken einfach mal, was, was für"}, {"id": 269, "start": 2055.52, "end": 2071.12, "text": "Terabyte SSDs gerade kosten. Ok, das ist schon ganz schön teuer. Ups, das ist schon ganz"}, {"id": 270, "start": 2071.12, "end": 2082.2, "text": "schön teuer. Ich meine, ist ja bald Black Friday. Ja, aber da haben die die guten Sachen"}, {"id": 271, "start": 2082.2, "end": 2088.6, "text": "hier nicht. Also ich meine, mit den Covo-Dingern geht es noch irgendwie, wobei die halt performancemäßig"}, {"id": 272, "start": 2088.6, "end": 2092.96, "text": "nicht so gut sind wie die und theoretisch auch schneller kaputt gehen, aber da würde"}, {"id": 273, "start": 2092.96, "end": 2098.72, "text": "ich mir keine Gedanken machen. Stell es doch mal Mindfactory zusammen. Es geht doch halt"}, {"id": 274, "start": 2098.72, "end": 2116.64, "text": "darum, was die Platten kosten, also was die SSDs kosten. Also 4 Terabyte SSDs sind schon"}, {"id": 275, "start": 2116.64, "end": 2120.04, "text": "echt teuer. Die sind schon ganz schön teuer. Also ich glaube nicht, dass ich das in nächster"}, {"id": 276, "start": 2120.04, "end": 2124.48, "text": "Zeit machen kann. Eigentlich bräuchte es ja auch 8, gibt es schon 8 Terabyte, gibt es"}, {"id": 277, "start": 2124.48, "end": 2137.0, "text": "schon 8 Terabyte SSDs? Nein, 4 Terabyte ist das größte. Na gut. 4 mal 1 Terabyte in Rate"}, {"id": 278, "start": 2137.0, "end": 2142.28, "text": "0, das wäre wahrscheinlich billiger, ja. Aber ich habe daran gedacht, dass man beispielsweise"}, {"id": 279, "start": 2142.28, "end": 2147.08, "text": "einen Rate 1 machen könnte aus 8 Terabyte SSDs, aber es gibt ja gar keine 8 Terabyte"}, {"id": 280, "start": 2147.08, "end": 2156.92, "text": "SSDs. Oder man macht einen Rate 1 aus 4 Terabyte SSDs, da hat man so nur 4 Terabyte Speicher,"}, {"id": 281, "start": 2156.92, "end": 2177.56, "text": "aber ziemlich schnell lesen. Gibt es 4 Terabyte NVMe? Ok, ne, da ist 2 Terabyte das größte."}, {"id": 282, "start": 2177.56, "end": 2184.4, "text": "Ach Mensch, das wäre nice, wenn ich einfach 5 SSDs in den Sauber klatscht, braucht keinen"}, {"id": 283, "start": 2184.4, "end": 2198.36, "text": "Strom, ist saumäßig schnell. Problem ist auch, ist saumäßig teuer. Ja ich weiß, klar"}, {"id": 284, "start": 2198.36, "end": 2202.72, "text": "es gibt große SSDs, aber das sind halt keine Consumer-Dinger, die sind halt übelst teuer."}, {"id": 285, "start": 2202.72, "end": 2214.24, "text": "Nichtschenk geblieben. Was kommen eigentlich noch für Games jetzt raus? Was kommen jetzt"}, {"id": 286, "start": 2214.24, "end": 2225.28, "text": "eigentlich noch für Games raus? Also jetzt so. Upcoming. Gibt es da eine schöne Übersicht?"}, {"id": 287, "start": 2225.28, "end": 2237.92, "text": "Ach Cyberpunk, kommt Cyberpunk schon raus? Oktober, also was kommt denn hier noch alles"}, {"id": 288, "start": 2237.92, "end": 2246.2, "text": "Interessantes? Das wollte ich mir mal angucken. Das ist so ein bisschen RPG-mäßiges Rumgestellte,"}, {"id": 289, "start": 2246.2, "end": 2251.64, "text": "das könnte sogar ganz nett sein. Outerlands? Ist Outerlands dieser Fallout 4 Verschnitt?"}, {"id": 290, "start": 2251.64, "end": 2271.36, "text": "Ne, das ist was anderes. Wie hieß das? Wie hieß dieses Fallout-Ding? Scheiß vergessen."}, {"id": 291, "start": 2271.36, "end": 2278.04, "text": "Overwatch-Legend für die Switch, Alter. Der Switcher ist mittlerweile auch auf der Switch"}, {"id": 292, "start": 2278.04, "end": 2283.04, "text": "angekommen. Nicht mal der Witcher, sondern der Switcher. Zombieladen braucht kein Mensch,"}, {"id": 293, "start": 2283.04, "end": 2288.44, "text": "aber das braucht auch keiner. Blablabla, das ist irgendwie nicht sonderlich spannend,"}, {"id": 294, "start": 2288.44, "end": 2296.84, "text": "was da rauskommt. LittleBigWorkshop, hat das was mit LittleBigPlanet zu tun? Ne, kann's"}, {"id": 295, "start": 2296.84, "end": 2300.68, "text": "nicht sein, weil wenn's auf der PS4 rauskommt, äh wenn's auf dem PC rauskommt, kann's"}, {"id": 296, "start": 2300.68, "end": 2309.48, "text": "nicht kein LittleBigPlanet sein. Ach, Outer Wilds, nicht Outer Worlds, das haben sie mich"}, {"id": 297, "start": 2309.48, "end": 2320.04, "text": "debatet, ja. Alles nicht so interessant. Apex Legends, Bloodhorn. Warum ist Apex eigentlich"}, {"id": 298, "start": 2320.04, "end": 2326.68, "text": "so abgekackt an Viewerzahlen? Das versteh ich nicht. Ich mein, guckt euch das. Ok,"}, {"id": 299, "start": 2326.68, "end": 2331.28, "text": "jetzt Streams, gerade die zwei größten, dieses Stream. Ja ok, jetzt ist das an Viewerzahlen"}, {"id": 300, "start": 2331.28, "end": 2339.16, "text": "ziemlich gut. Ähm, aber normalerweise, wenn man sich das anguckt, ist, ich mein, es gucken"}, {"id": 301, "start": 2339.16, "end": 2355.4, "text": "475 Leute irgendwie in einem schwarzen Loch zu. Fuck. Ich will Viewers. Also Apex gucken"}, {"id": 302, "start": 2355.4, "end": 2363.36, "text": "gerade richtig viel, aber die letzten Monate war Apex richtig am abkacken. Ähm, ist für"}, {"id": 303, "start": 2363.36, "end": 2368.16, "text": "mich immer noch so mit das beste Battle Royale Game, ohne dass ich Battle Royale spiele."}, {"id": 304, "start": 2368.16, "end": 2375.84, "text": "Das ist eigentlich, aber so rein vom Gucken her, gefällt mir, gefällt mir Apex eigentlich"}, {"id": 305, "start": 2375.84, "end": 2387.8, "text": "am besten. Moin, Soldier 5084. Ganz schön teuer. Ganz schön, ganz schön teuer hier die"}, {"id": 306, "start": 2387.8, "end": 2391.8, "text": "ganzen SSD-Geschichten, das kann man vergessen. So, was kommt denn sonst noch so? So, das"}, {"id": 307, "start": 2391.8, "end": 2396.52, "text": "nächstes, was mich interessiert, kommt World of Warfare raus. 25. Oktober, dauert nicht"}, {"id": 308, "start": 2396.52, "end": 2405.96, "text": "mal lang. Übernächste Woche Freitag. Rest juckt mich nicht. Ach, hier kommt das. Pre-Order."}, {"id": 309, "start": 2405.96, "end": 2415.68, "text": "Das kommt auch am 25. Oktober raus, ok. Disney Classic Games Aladdin. Nein, juckt mich nicht."}, {"id": 310, "start": 2415.68, "end": 2426.92, "text": "Resident Evil 5, Resident Evil 6, nochmal für die Switch. Die Switch ist so die Remake-Tonne"}, {"id": 311, "start": 2426.92, "end": 2430.64, "text": "irgendwie, wo alle noch mal, alle Spiele von allen letzten Generationen jetzt nochmal auf"}, {"id": 312, "start": 2430.64, "end": 2439.04, "text": "der Switch rausbringen. Richtig. Ach, Death Stranding kommt ja am, stimmt das Game kommt"}, {"id": 313, "start": 2439.04, "end": 2443.76, "text": "ja schon raus. Death Stranding ist bei mir im Kopf ein Game, wo es einmal im Jahr verwirrende"}, {"id": 314, "start": 2443.76, "end": 2447.4, "text": "Trailer gibt und das Spiel nie erscheint. Aber ist ja gar nicht so, das kommt jetzt"}, {"id": 315, "start": 2447.4, "end": 2453.92, "text": "ja raus. Da bin ich gespannt drauf, da bin ich gespannt drauf. Es kommt Dreaded Redemption"}, {"id": 316, "start": 2453.92, "end": 2460.72, "text": "für den PC. Ich sag jetzt mal was Kontroverses, ja, geht mir am Arsch vorbei. Juckt mich,"}, {"id": 317, "start": 2460.72, "end": 2470.36, "text": "juckt mich überhaupt nicht. Aber ich hab schon öfters gesagt, ich bin einfach nicht der,"}, {"id": 318, "start": 2470.36, "end": 2475.24, "text": "nicht der große Open World Spiele Spieler. Ich gehe davon aus, dass sie eine ganz gute"}, {"id": 319, "start": 2475.24, "end": 2480.16, "text": "Story haben, das kriegen die eigentlich immer hin bei Rockstar. Aber ich bin einfach kein"}, {"id": 320, "start": 2480.16, "end": 2484.84, "text": "großer Fan von Open World Spielen. Deswegen, das einzige auf, magst du GTA? Nö mag ich"}, {"id": 321, "start": 2484.84, "end": 2491.44, "text": "auch nicht. Das einzige Open World Spiel, was mir wirklich sehr gut gefallen hat, was"}, {"id": 322, "start": 2491.44, "end": 2498.2, "text": "richtig Open World war, also neuere Open World Games. Das einzige richtige Open World Game,"}, {"id": 323, "start": 2498.2, "end": 2503.48, "text": "was mir gefallen hat, war der Witcher. Also drei, die anderen, die eins und zwei waren"}, {"id": 324, "start": 2503.48, "end": 2509.36, "text": "ja keine Open World. Witcher 3 hat mir richtig gut gefallen, aber auch nicht unbedingt der"}, {"id": 325, "start": 2509.36, "end": 2517.12, "text": "Open World Aspekt, sondern die Main Kampagne war richtig gut, die DLC-Story war richtig"}, {"id": 326, "start": 2517.12, "end": 2525.28, "text": "gut und was bei Witcher 3 wirklich auch gut war, ist, dass die ganzen Quests, die irgendwie"}, {"id": 327, "start": 2525.28, "end": 2529.4, "text": "in der Welt verteilt waren, zum größten Teilen auch halbwegs interessant waren, zum"}, {"id": 328, "start": 2529.4, "end": 2534.08, "text": "größten Teil, ja nicht alle. Aber es gab schon ein paar ganz coole Sachen, die eine"}, {"id": 329, "start": 2534.08, "end": 2539.16, "text": "da mit dem Werwolf, kann mich auch irgendwie an so eine Quest erinnern, wo die Freundin"}, {"id": 330, "start": 2539.16, "end": 2542.48, "text": "dann zum Werwolf wurde oder der Freund zum Werwolf, irgendwie sowas. Aber das war schon"}, {"id": 331, "start": 2542.48, "end": 2547.84, "text": "okay, ja. Den richtigen, diesen richtigen Open World Aspekt daran haben wir nicht gebraucht"}, {"id": 332, "start": 2547.84, "end": 2557.64, "text": "und ich finde auch, dass die Witcher Open World so ein bisschen, zumindest in den Dörfern"}, {"id": 333, "start": 2557.64, "end": 2564.12, "text": "so ein bisschen, ein bisschen unfertig gewirkt hat. Die Leute standen da halt rum, die hatten"}, {"id": 334, "start": 2564.12, "end": 2572.04, "text": "ihre drei Sprüche, die haben im Prinzip nichts großartig gemacht und es hat sich jetzt auch"}, {"id": 335, "start": 2572.04, "end": 2575.72, "text": "nicht irgendwie angefühlt, als reitet man da durch den Dorf durch. Was halt richtig"}, {"id": 336, "start": 2575.72, "end": 2581.16, "text": "geil gemacht von Witcher 3 waren die größeren Städte. Das war halt ebenso, er quennt auch,"}, {"id": 337, "start": 2581.16, "end": 2589.56, "text": "ja. Das war halt übelst geil. Naja, aber. Hallo Max, endlich mal ein Livestream von dir,"}, {"id": 338, "start": 2589.56, "end": 2593.2, "text": "sehe nach sieben oder acht Jahren YouTube. Aber ja, nice. Ja, hast du halt, aber eigentlich"}, {"id": 339, "start": 2593.2, "end": 2597.48, "text": "sind übelst langweilig den Livestream erwischt, weil ich hab keine Ahnung, was wir genau machen."}, {"id": 340, "start": 2597.48, "end": 2602.16, "text": "Wir schwätzen einfach. Also ihr könnt mich alles fragen, was ihr fragen wollt, dass wir"}, {"id": 341, "start": 2602.16, "end": 2610.24, "text": "Gesprächs, Gesprächsstoff haben, ja. Es gibt jetzt irgendeine Free to Play Version von Pupke mit"}, {"id": 342, "start": 2610.24, "end": 2614.68, "text": "minimaler Grafik. Solltet ihr nicht mal drauf gucken, dass ihr Game überhaupt richtig läuft."}, {"id": 343, "start": 2614.68, "end": 2626.36, "text": "Ey Leute, ich hab letztens wieder. Ich hab letztens wieder mal zehn Minuten. Das könnte"}, {"id": 344, "start": 2626.36, "end": 2630.8, "text": "das gewesen sein, das könnte das hier sogar gewesen sein. Ich hab letztens mal wieder zehn"}, {"id": 345, "start": 2630.8, "end": 2637.48, "text": "Minuten von irgendeinem PUBG Pupke Cup geguckt, ne. Kann sein, als es das war. War das jetzt"}, {"id": 346, "start": 2637.48, "end": 2644.24, "text": "irgendwie erst vor ein paar Tagen? Dann ist was anderes. Zumindest, ich sag euch Leute,"}, {"id": 347, "start": 2644.24, "end": 2653.12, "text": "ähm, übelst langweilig. Also das ist echt kein eSport Game. Pupke eSport, es ist so langweilig."}, {"id": 348, "start": 2653.12, "end": 2658.36, "text": "Da gewinnt das Team am Ende mit zwei Kills. Die spawnen, liegen rum, hoffen, dass der Circle"}, {"id": 349, "start": 2658.36, "end": 2665.24, "text": "irgendwie an der richtigen Stelle kommt. Und, ähm, campen dann weiter rum. Und am Ende killen sich"}, {"id": 350, "start": 2665.24, "end": 2669.12, "text": "dann die Leute gegenseitig und ein Team campt weiter. Und das killt dann die letzten zwei"}, {"id": 351, "start": 2669.12, "end": 2675.88, "text": "Leute und hat gewonnen. Ganz merkwürdig. Wie hast du eigentlich Internet, wenn du Unity Media"}, {"id": 352, "start": 2675.88, "end": 2703.28, "text": "hast, wie so funktioniert doch wunderbar. Gehts?"}, {"id": 353, "start": 2703.28, "end": 2713.12, "text": "Ähm, das würde ich dann eher mathematisch angehen. Ich würde mir die Menge der Haare angucken und,"}, {"id": 354, "start": 2713.12, "end": 2718.08, "text": "ähm, dann kannst du einfach eine Menge an Haaren bilden, die weiß sind und eine Menge an Haaren"}, {"id": 355, "start": 2718.08, "end": 2726.4, "text": "bilden, die schwarz sind. Und dann musst du das gar nicht, ähm, so beantworten. Oder hast"}, {"id": 356, "start": 2726.4, "end": 2739.84, "text": "trotzdem die Antwort. Schon mal Kaffee gegessen? Ähm, nee. Keine Ahnung. Also nicht wissentlich."}, {"id": 357, "start": 2739.84, "end": 2748.6, "text": "Also nicht wissentlich aus irgendeiner Dose oder so. Und was ist mit Milka Kühen? Die sind CGI"}, {"id": 358, "start": 2748.6, "end": 2766.96, "text": "alt mittlerweile. Weil die Kühe nicht mehr einfärben dürfen. Schau mal StreamPie angeschaut, nö."}, {"id": 359, "start": 2766.96, "end": 2786.04, "text": "Was ist das? Was ist StreamPie? Wo soll man Link schicken? Benutzt du einfach nur LibreOffice?"}, {"id": 360, "start": 2786.04, "end": 2793.16, "text": "Ich benutze gar kein Office. Ach, das kenne ich. Das kenne ich, das Video, Patrick. Ich benutze"}, {"id": 361, "start": 2793.16, "end": 2813.56, "text": "gar kein Office. Ich habe LibreOffice installiert, aber verwenden tue ich es nicht. Hehehe. Abstörung"}, {"id": 362, "start": 2813.56, "end": 2819.72, "text": "bei Unity Media. Stream läuft aber seit Aufruf. Also, ich habe Unity Media geflamed auf Twitter"}, {"id": 363, "start": 2819.72, "end": 2824.2, "text": "und ich habe jetzt DualStack Lite gekriegt, auch wenn sie mich da wieder ein bisschen gescampt"}, {"id": 364, "start": 2824.2, "end": 2831.6, "text": "haben bei der ganzen Geschichte. Aber es funktioniert jetzt und ich mache da auch nichts mehr, alles"}, {"id": 365, "start": 2831.6, "end": 2842.8, "text": "gut. Apex ist mega hype in den USA, aber sonst nirgends, okay. Ich wollte das auch mal"}, {"id": 366, "start": 2842.8, "end": 2850.16, "text": "spielen. Vielleicht ist das echt ein Game für mich. Hast du den neuen Film Joker gesehen?"}, {"id": 367, "start": 2850.16, "end": 2861.16, "text": "Nein. Gibt es ihn denn schon auf einschlägigen Sicherheitskopie? Gibt es ihn schon als Sicherheitskopie"}, {"id": 368, "start": 2861.16, "end": 2877.28, "text": "irgendwo? Nein, Oldrade HC2 ist wirklich der günstige Optacore Einplatinencomputer. Ja,"}, {"id": 369, "start": 2877.28, "end": 2884.16, "text": "und vor allem, der ist schon 3 Jahre alt oder so. Ich habe jetzt ja das Teil hier drüben"}, {"id": 370, "start": 2884.16, "end": 2892.88, "text": "stehen als TV-Server, den da mit Platte drin und das funktioniert wunderbar. Das funktioniert"}, {"id": 371, "start": 2892.88, "end": 2901.12, "text": "echt richtig gut, viel besser als ich gedacht habe. Einfach hier eine USB-Dual-Tuner dran,"}, {"id": 372, "start": 2901.12, "end": 2906.08, "text": "2TB WD-Green-Platte eingesteckt, die ich noch da hatte. Wir haben es ja im Stream gemacht."}, {"id": 373, "start": 2906.08, "end": 2934.4, "text": "Fertig, easy, läuft wunderbar. Yeratiel, warum bist du ein Jahr offline? Wenn du gekündigt"}, {"id": 374, "start": 2934.4, "end": 2950.12, "text": "hast, kannst du einfach einen neuen Vertrag abschließen. Wie ist das jetzt in Apex? Hat"}, {"id": 375, "start": 2950.12, "end": 2961.16, "text": "es jetzt einen Solo-Modus? Wobei ich sagen muss, ich finde, irgendwie macht es das Game"}, {"id": 376, "start": 2961.16, "end": 2965.84, "text": "ja auch schon ein bisschen aus, dass es eben Trio ist. Das ist ja auch mit den Flagen und"}, {"id": 377, "start": 2965.84, "end": 2974.6, "text": "Respawn ein bisschen drauf ausgelegt. Ab jetzt auf dem Pi Zero TV hat er ein installiert"}, {"id": 378, "start": 2974.6, "end": 2980.68, "text": "DVPC. Ja, das ist richtig nice. Ich meine, ich habe es auf der Kiste, die ist eine ganze"}, {"id": 379, "start": 2980.68, "end": 2998.8, "text": "Ecke stärker als den Raspberry Pi Zero. Zero ist ja ein ARM V6 Single Core. Der Raspberry"}, {"id": 380, "start": 2998.8, "end": 3005.0, "text": "Zero hat halt nix im Endeffekt. Da ist der hier schon ein bisschen schneller. Und der"}, {"id": 381, "start": 3005.0, "end": 3009.08, "text": "läuft, läuft echt gut. Gab es eigentlich schon ein Update zu Fiverr? Ja, ist alles fertig"}, {"id": 382, "start": 3009.08, "end": 3015.0, "text": "seit einem Monat schon. Ich habe bloß immer noch das Video nicht gemacht. Fiverr ist seit"}, {"id": 383, "start": 3015.0, "end": 3019.68, "text": "einem Monat schon fertig. Also einer hat was geliefert, das taugt eigentlich nicht wirklich"}, {"id": 384, "start": 3019.68, "end": 3023.48, "text": "was und die anderen wollten mehr Geld oder haben abgesagt oder haben gesagt, sie können"}, {"id": 385, "start": 3023.48, "end": 3031.48, "text": "es nicht mehr haben. Wie hielst du beim O-Trill mit AES aus? Ganz okay. Ich glaube, der hat"}, {"id": 386, "start": 3031.48, "end": 3036.24, "text": "theoretisch Krypto Extensions, aber ich weiß nicht, ob das aktiviert ist, ob das funktioniert."}, {"id": 387, "start": 3036.24, "end": 3042.92, "text": "Das müsste man mal ausprobieren. Können wir jetzt mal, könnte ich jetzt eigentlich"}, {"id": 388, "start": 3042.92, "end": 3051.4, "text": "machen? Machen wir mal Vmware an. Ich gucke mal, wie schnell das geht. Ich muss nur mal"}, {"id": 389, "start": 3051.4, "end": 3062.12, "text": "nachgucken, wie das funktioniert hat. Ach das, okay, das ist cool. Das muss ich mir mal"}, {"id": 390, "start": 3062.12, "end": 3071.68, "text": "angucken. Eine robuste Alternative zum Elgato Stream Deck. Also im Prinzip hat einer mein"}, {"id": 391, "start": 3071.68, "end": 3081.84, "text": "Meme Board genommen und hat das mal ordentlich gebaut. Hast du eigentlich mal Zertifikate"}, {"id": 392, "start": 3081.84, "end": 3088.4, "text": "wie C10A gemacht? Ja, aber das ist schon ewig ausgelaufen. Das gucken wir uns jetzt mal"}, {"id": 393, "start": 3088.4, "end": 3114.56, "text": "an. Was kann das denn? Raspberry Pi? Was macht das denn? Features. Wie das ist alles?"}, {"id": 394, "start": 3114.56, "end": 3136.56, "text": "Wie wäre es mit Screenshots? Okay, wir gucken uns mal das Video an. Warum gibt es kein Donation"}, {"id": 395, "start": 3136.56, "end": 3139.76, "text": "Button, weil Tippy Stream irgendwie kaputt ist und ich habe es wieder rausgeschmissen?"}, {"id": 396, "start": 3139.76, "end": 3152.08, "text": "Aber du kannst mir natürlich gerne einfach einen Prime-Sub dalassen. Huge Kamerarbeit,"}, {"id": 397, "start": 3152.08, "end": 3165.2, "text": "fast so gut wie bei mir. Bsreelight, Tripsprime, Dankeschön, Poggas."}, {"id": 398, "start": 3165.2, "end": 3177.32, "text": "Eine Alternative, die kann, Kontrolle OBS. So wie das es gerade gemacht hat. Nun, ich bin"}, {"id": 399, "start": 3177.32, "end": 3185.6, "text": "hier um euch zu sagen, es gibt eine Alternative. Eine große Reveal. Meine Damen und Herren,"}, {"id": 400, "start": 3185.6, "end": 3202.96, "text": "ich bin stolz auf Stream-Pi. Ich glaube, der hat wirklich mal ein Meme-Board genommen"}, {"id": 401, "start": 3202.96, "end": 3208.0, "text": "und einfach mal ordentlich gebaut. Also nein, der hat nicht meins genommen, aber der hat"}, {"id": 402, "start": 3208.0, "end": 3234.04, "text": "die Idee im Endeffekt genommen und mal weitergedacht und ordentlich gemacht. Ich weiß nicht, ob"}, {"id": 403, "start": 3234.04, "end": 3247.76, "text": "ich das verwenden kann. Da bin ich mir nicht sicher, ob ich das verwenden kann."}, {"id": 404, "start": 3264.04, "end": 3270.52, "text": "Weißt du, was sinnvoll wäre bei diesen ganzen Videos, immer wo die Leute ihre Projekte vorstellen?"}, {"id": 405, "start": 3270.52, "end": 3276.64, "text": "Einfach ein 1-Minute-Video machen, wo man es in Action sieht und ein paar interessante"}, {"id": 406, "start": 3276.64, "end": 3282.44, "text": "Features. Weil so habe ich keinen Plan genau, was es ist. Ist es ein Tablet? Ein Tablet"}, {"id": 407, "start": 3282.44, "end": 3302.32, "text": "irgendwie. Ja, das ist von der Idee genau so. Das ist im Prinzip fast das Gleiche, wie"}, {"id": 408, "start": 3302.32, "end": 3320.0, "text": "ich hier mit meinem Board gebaut habe. Nur wahrscheinlich ein bisschen durchdachter als"}, {"id": 409, "start": 3320.0, "end": 3340.4, "text": "ich. Was genau ist so schlimm, dass es sehr wir-programmiert ist an vielen Stellen? Ich"}, {"id": 410, "start": 3340.4, "end": 3352.76, "text": "meine, exakt das kann man mit meinem Tool genauso machen. Im Prinzip ist das genau das"}, {"id": 411, "start": 3352.76, "end": 3359.4, "text": "Gleiche. Das geht auch auf einem Tablet. Nur, dass ich GIF-Animationen kann und dass"}, {"id": 412, "start": 3359.4, "end": 3374.96, "text": "ich Sounds kann. Und sogar MP4-Sounds, also Audio-Spur in MP4-Videos oder Text-to-Speech."}, {"id": 413, "start": 3374.96, "end": 3390.04, "text": "Und Touch Ui geht hier auch drauf. Zeit voraus. Ich gehe mal davon aus, dass seins ein bisschen"}, {"id": 414, "start": 3390.04, "end": 3398.4, "text": "besser durchdacht ist als meins. Es ist eine ziemlich hässliche Oberfläche, muss ich jetzt"}, {"id": 415, "start": 3398.4, "end": 3409.2, "text": "mal sagen. Ist deins auf Github? Meins ist auf Github, allerdings eine uralt Version."}, {"id": 416, "start": 3409.2, "end": 3423.12, "text": "Die allererste Version, die ich gebaut habe, ist auf Github. Aber die kann halt keine Animation,"}, {"id": 417, "start": 3423.12, "end": 3428.96, "text": "die kann keinen Text, die kann keinen Sound, die kann einfach nur Bilder overlayen. Dafür"}, {"id": 418, "start": 3428.96, "end": 3433.4, "text": "ist sie ziemlich simpel. Da ist eigentlich nicht wirklich viel, was man verstehen muss"}, {"id": 419, "start": 3433.4, "end": 3444.36, "text": "dran. Okay, was kann das Ding noch? Wolltest du dich noch mal fragen, ob du bei TV einen"}, {"id": 420, "start": 3444.36, "end": 3453.28, "text": "beiden Tuner an eins oder zwei IPs gebunden hast? Keine Ahnung, ich habe gar nichts extra"}, {"id": 421, "start": 3453.28, "end": 3468.2, "text": "gebunden irgendwie. Ich habe es auch im Stream sogar gemacht. Okay, da kannst du auch Skripte"}, {"id": 422, "start": 3468.2, "end": 3472.64, "text": "hinterlegen und so. Das macht es natürlich schon interessanter. Wieso pusht du keine"}, {"id": 423, "start": 3472.64, "end": 3478.16, "text": "neue Version, weil die kacke sind? Weil ich mich teilweise schäme für die eklichen Sachen,"}, {"id": 424, "start": 3478.16, "end": 3489.44, "text": "die ich hier verzapft habe. Das will ich so nicht veröffentlichen. Hätte er nicht mal"}, {"id": 425, "start": 3489.44, "end": 3507.6, "text": "ein bisschen gestrafteres Video dazu machen können? Aber damit kannst du OBS fernsteuern,"}, {"id": 426, "start": 3507.6, "end": 3524.04, "text": "das kann man mit meinem Tool natürlich nicht. OBS fernsteuern kann man natürlich mit meinem"}, {"id": 427, "start": 3524.04, "end": 3529.72, "text": "Zeug nicht. Das Einzige, das ist viel mehr als das, was ich gebaut habe. Wie gesagt,"}, {"id": 428, "start": 3529.72, "end": 3537.36, "text": "meins kann nur Bilder overlayen und Text-to-Speech-Text machen oder koreanisch Text-to-Speech machen"}, {"id": 429, "start": 3537.36, "end": 3551.04, "text": "oder Bilder und Sound. Also, meins kann nur Audio-Video-Zeug und der hat ja wirklich"}, {"id": 430, "start": 3551.04, "end": 3556.68, "text": "komplette OBS-Fernsteuerung gebaut, die man da drauf legen kann. Programmierst du eigentlich"}, {"id": 431, "start": 3556.68, "end": 3567.32, "text": "auch auf der Arbeit ab und zu seltener als mir lieb ist? Mach mal Ausrufezeichen Job,"}, {"id": 432, "start": 3567.32, "end": 3570.88, "text": "da hab ich Job oder Ausrufezeichen Beruf. Ich weiß gar nicht, wir haben ein Kommando"}, {"id": 433, "start": 3570.88, "end": 3581.4, "text": "dafür, da hab ich versucht mal zu ergleiten auf der Arbeit, zu treiben. Nein, mein Meme-Bot"}, {"id": 434, "start": 3581.4, "end": 3590.12, "text": "benutzt kein OBS, der macht Windows-Overlay, dass ich selbst sehe. Okay, jetzt hab ich"}, {"id": 435, "start": 3590.12, "end": 3595.16, "text": "gecheckt, was der meint, aber das ist schon eine ganze Ecke Advanster, was der gebaut"}, {"id": 436, "start": 3595.16, "end": 3599.84, "text": "hat, als was ich gebaut hab. Außerdem, ich seitens in Java, das widerstrebt mir natürlich"}, {"id": 437, "start": 3599.84, "end": 3609.72, "text": "so ein bisschen. Ja, cheat, ich mach gefühlt mehr Code-Reviews als selber programmieren,"}, {"id": 438, "start": 3609.72, "end": 3620.0, "text": "das stimmt. Das stimmt, leider, ja. Paints-Champ, Java, Paints-Champ. Können wir mal ein bisschen"}, {"id": 439, "start": 3620.0, "end": 3626.04, "text": "gucken? Können wir mal ein bisschen gucken, ich will mir keinen Java-Source-Code angucken."}, {"id": 440, "start": 3626.04, "end": 3631.12, "text": "Dabei ist die Java und die Sharp-Source-Code gar nicht so großartig. Kannst du mal erklären,"}, {"id": 441, "start": 3631.12, "end": 3639.96, "text": "wie man mein altes Meme-Bot nutzt? Das ist ganz einfach. Du gehst einfach hier hin und"}, {"id": 442, "start": 3639.96, "end": 3647.0, "text": "lädst dir das einzige Release-Wasser, das es gibt, runter. Ja, Meme-Bot Excel. Und dann"}, {"id": 443, "start": 3647.0, "end": 3658.2, "text": "machst du, was hier als Anleitung drin steht. Das ist ziemlich simpel, aber halt nicht sonnerlich"}, {"id": 444, "start": 3658.2, "end": 3686.64, "text": "advanced, ja. Oh Gott, Java, Alter, wenn ich es sehe. MonkaS. Aber ehrlich gesagt,"}, {"id": 445, "start": 3686.64, "end": 3694.88, "text": "es sieht halt schon ähnlich aus, wie meinst du die Sharp-Zeug? Was ist denn das, sind das"}, {"id": 446, "start": 3694.88, "end": 3721.2, "text": "Attribute oder was ist das? Füchsemel? Scheiße, das Fuck-XML, der Sache würde ich zustimmen."}, {"id": 447, "start": 3721.2, "end": 3729.12, "text": "What the fuck? Warum muss der sich um irgendwelche Threat-Management kümmern bei Buckle-Click-Events?"}, {"id": 448, "start": 3729.12, "end": 3753.96, "text": "Boah, sieht das eklig aus, Alter. Oh, boah. Hä? Main. Ja, anscheinend habe ich noch nie"}, {"id": 449, "start": 3753.96, "end": 3762.32, "text": "was mitgemacht, keine Ahnung. Fuck-XML-Loader. Load. Aber ich muss sagen, seine Benamung ist"}, {"id": 450, "start": 3762.32, "end": 3778.92, "text": "zumindest schon mal ganz gut. Er hat keine Factory-Manager-Manager-Class-Factory-Creator-Observer-Factory-Manager. Main, okay, was startet"}, {"id": 451, "start": 3778.92, "end": 3794.76, "text": "das denn jetzt hier? If-F-XML. Igitt! Igitt! Das ist nicht wirklich das Frontend, was man"}, {"id": 452, "start": 3794.76, "end": 3815.0, "text": "in XML deklariert, oder? Da ist ja diese XML-Geschichte noch richtig hübsch dagegen. Ich weiß, XML ist"}, {"id": 453, "start": 3815.0, "end": 3823.36, "text": "auch XML, aber ein bisschen kurz und knackiger. Und ich finde XML auch schon kacke. Also an"}, {"id": 454, "start": 3823.36, "end": 3832.96, "text": "der ganzen WPF-Geschichte geht mir XML am meisten auf den Keks. Da macht's QML viel"}, {"id": 455, "start": 3832.96, "end": 3858.44, "text": "besser. QML ist, finde ich, die schönste Interface-Beschreibung. Habe ich mal ein Beispiel. Habe ich mal ein schönes"}, {"id": 456, "start": 3858.44, "end": 3874.44, "text": "Beispiel. Ja, sowas hier. Das ist doch schon mal viel besser lesbar als irgendwelche XML-Crap."}, {"id": 457, "start": 3874.44, "end": 3883.8, "text": "Also QML, finde ich, ist die schönste Interface-Beschreibungssprache, die man von Hand schreibt, wohlgemerkt. Wenn man"}, {"id": 458, "start": 3883.8, "end": 3889.2, "text": "über irgendwelche GUI-Designer macht, wie beispielsweise diesen Windows-Forms-Designer, der macht ja"}, {"id": 459, "start": 3889.2, "end": 3893.72, "text": "unter der Haube auch Spaghetti-Code, aber da macht man es halt immer mit einem Designer."}, {"id": 460, "start": 3893.72, "end": 3903.2, "text": "Aber QML schreibt man halt von Hand. Und das ist richtig schick. Also QML, finde ich, ist"}, {"id": 461, "start": 3903.2, "end": 3912.16, "text": "das die schönste. Ach, du meinst, das ist auch so ein Designer? Okay, dann ist okay."}, {"id": 462, "start": 3912.16, "end": 3915.68, "text": "Also, wenn das mit einem Designer erstellt wird, ist okay, wenn man den Mist nicht von"}, {"id": 463, "start": 3915.68, "end": 3919.76, "text": "Hand schreiben muss. Dann ist es in Ordnung. Dann macht man das einfach in seinem Designer"}, {"id": 464, "start": 3919.76, "end": 3924.92, "text": "und muss sich den Source-Code nie dazu angucken. Das ist okay. Ich dachte, man schreibt den"}, {"id": 465, "start": 3924.92, "end": 3933.36, "text": "Mist von Hand. Ich mein, guck beispielsweise mal hier mein, das XML-Gegenstück von mir,"}, {"id": 466, "start": 3933.36, "end": 3939.8, "text": "das ist jetzt halt handgewurstet. Das sieht jetzt auch nicht viel schöner aus, ja. XML"}, {"id": 467, "start": 3939.8, "end": 3959.4, "text": "ist halt immer scheiße. Oh, es gibt sogar Arm-Bills. Aber auch in Java. Geh weg. Schau"}, {"id": 468, "start": 3959.4, "end": 3964.8, "text": "mal SQF von Bohemia an, da musst du mir mal einen Linkshoot zuschicken. Kannst du bitte"}, {"id": 469, "start": 3964.8, "end": 3974.6, "text": "aufhören oder ich reporte dich. Mit was? Du meinst mit XML angucken? Ja, YAML ist mir"}, {"id": 470, "start": 3974.6, "end": 3980.08, "text": "persönlich auch deutlich lieber als XML, wobei ich mittlerweile schon wieder einen Schritt"}, {"id": 471, "start": 3980.08, "end": 3984.68, "text": "zurückgegangen bin. Ich verwende auch kein YAML mehr. Ich verwende eigentlich für alles"}, {"id": 472, "start": 3984.68, "end": 3991.36, "text": "irgendwelche JSON-Config-Files, wenn es geht. YAML hat ja so mit Rails so richtig den Durchbruch"}, {"id": 473, "start": 3991.36, "end": 4020.24, "text": "gehabt damals. Aber ich mag Klammern. Okay, was soll ich mir angucken, das da? Was ist"}, {"id": 474, "start": 4020.24, "end": 4044.12, "text": "das überhaupt? SQF? Ist das für den Armor Level Editor oder wie? Was ist das? Das sieht"}, {"id": 475, "start": 4044.12, "end": 4052.96, "text": "fast aus wie Erlang. Oder? Das sieht ein bisschen aus wie Erlang. Also genauso hässlich"}, {"id": 476, "start": 4052.96, "end": 4073.92, "text": "wie Erlang. SQF-Example. Gucken wir mal. Nein. Ach, das ist die Armor Scripting Engine. Okay,"}, {"id": 477, "start": 4073.92, "end": 4077.92, "text": "Armor ist schon so ein Spiel, was nicht ordentlich läuft. Da wird die Armor Scripting Engine"}, {"id": 478, "start": 4077.92, "end": 4098.72, "text": "auch nicht besser sein. Gehen wir noch am Fernsehbauen? Nö. Okay, das sieht schon"}, {"id": 479, "start": 4098.72, "end": 4108.52, "text": "hardcore eklig aus. Das hat ein bisschen was von Windows-Batch. Das hat was von CMD-Batch"}, {"id": 480, "start": 4108.52, "end": 4115.16, "text": "irgendwie. Ach, nee, nee, nee, hör mal auf. Das ist ja eklig. Das will man nicht haben."}, {"id": 481, "start": 4115.16, "end": 4118.84, "text": "Nee, ich bin nicht mehr am Fernsehbauen. Wo sind wir eigentlich gerade stehen geblieben"}, {"id": 482, "start": 4118.84, "end": 4136.32, "text": "vorher? Das ist schrecklich. Ja, das ist echt schrecklich. Okay, gucken wir mal, was"}, {"id": 483, "start": 4136.32, "end": 4147.6, "text": "es da für neue Sachen gibt. Irgendwelche Steam-Games zu empfehlen. Ach, stimmt, wir"}, {"id": 484, "start": 4147.6, "end": 4152.48, "text": "wollten eigentlich gucken, was sonst noch dieses Jahr für interessantes Zeug rauskommt."}, {"id": 485, "start": 4152.48, "end": 4160.32, "text": "Max, hast du schon den Ultra-Gaming-PC gesehen, den ich auf Discord geschickt hab? Nee."}, {"id": 486, "start": 4160.32, "end": 4164.6, "text": "Welchem Channel hast du den geschickt? Können wir uns jetzt mal angucken? Gucken wir uns"}, {"id": 487, "start": 4164.6, "end": 4169.92, "text": "mal Gaming-PC Setup an. Rails, was ist das nochmal? Ja, das ist so eine Sache, die man"}, {"id": 488, "start": 4169.92, "end": 4179.24, "text": "2005 verwendet hat. Wenn du Java nicht magst, Marcelo von Kotlin, würde ich jederzeit Java"}, {"id": 489, "start": 4179.24, "end": 4188.72, "text": "vorziehen. Kotlin hat sich so das Beste aus allem geschnappt. Welchem Channel hast du"}, {"id": 490, "start": 4188.72, "end": 4214.44, "text": "das gepostet? Allgemein. Ach, der da. Okay, zeig's mal her. The fuck? Who buys that?"}, {"id": 491, "start": 4214.44, "end": 4244.24, "text": "Fx3300? 8300? Was soll das sein? Von 2009 oder was? Was kostet's? 1000 Euro! Okay."}, {"id": 492, "start": 4244.24, "end": 4253.52, "text": "Das Gerät ist mit einem sehr schnellen Acht-Kern-Prozessor. So wie mit schnellen 8GB. War das schon DDR3?"}, {"id": 493, "start": 4253.52, "end": 4269.36, "text": "Nee, das war noch DDR2, oder? Von Shinobi. Von Shinobi ist das. Heißt die eine Ba-"}, {"id": 494, "start": 4269.36, "end": 4279.04, "text": "ja ja nicht auch Shinobi? Oder Shibune oder so? Die ganzen Weebs unter uns wissen das"}, {"id": 495, "start": 4279.04, "end": 4294.48, "text": "bestimmt. Shinobu, Shinobu, genau, Shinobu. Irgendwie so. Okay. 8GB Markenarbeitspeicher"}, {"id": 496, "start": 4294.48, "end": 4304.32, "text": "ausgestattet. Jetzt haben sie sich auch noch Encoding-Fails. Auch noch Encoding-Fails."}, {"id": 497, "start": 4304.32, "end": 4319.92, "text": "Dass man das im Jahr 2019 noch hat. Arbeiten sie in Ruhe ohne störende Lüfter. Oh, das"}, {"id": 498, "start": 4319.92, "end": 4326.08, "text": "leises Netz hat und hat einen geregelten Lüfter. Ui, was das alles hat. Sehr schnelles GT710."}, {"id": 499, "start": 4326.08, "end": 4333.2, "text": "Ai ai ai, das ist ja absolut high-end. Warum hat das Ding überhaupt so gute Bewertung?"}, {"id": 500, "start": 4333.2, "end": 4349.64, "text": "Shinobibi. Den Shop müssen wir uns jetzt mal angucken auf Amazon. Okay, Fyte, die Typen"}, {"id": 501, "start": 4349.64, "end": 4365.16, "text": "gibt es ja wirklich. Ultra, Ultra-8-Kern. Ist das denn, sag mal, ernsthaft jetzt? Warum"}, {"id": 502, "start": 4365.16, "end": 4370.76, "text": "verkaufen die noch, warum verkaufen die denn? Was ist denn das für eine beknackte Kombi,"}, {"id": 503, "start": 4370.76, "end": 4386.4, "text": "Alter? Ach so. Dass das überhaupt startet in Kombination. Ich meine, von wann ist die"}, {"id": 504, "start": 4386.4, "end": 4413.96, "text": "CPU 2009? Oder 11? Release, release, release. 2009, 2009, 2009, 2009, 2009, 2009, 2009, 2009,"}, {"id": 505, "start": 4413.96, "end": 4431.84, "text": "2012. Ich aber trotzdem. Ich meine, das ist eine 8 Jahre alte CPU, die wohlgemerkt damals"}, {"id": 506, "start": 4431.84, "end": 4437.64, "text": "schon gesackt hat. Und außerdem ist das, glaube ich, gar kein 8-Kerner, oder? Das war"}, {"id": 507, "start": 4437.64, "end": 4442.6, "text": "doch damals kein echten 8-Kerner. Das war doch diese... Ich kann mich ja schon gar nicht"}, {"id": 508, "start": 4442.6, "end": 4454.88, "text": "mehr richtig dran erinnern. Turbo. Okay, wo ist der PC, den du gesehen hast? Den gucken"}, {"id": 509, "start": 4454.88, "end": 4462.92, "text": "wir uns jetzt mal ein bisschen genauer an. Wenn ich den Namen sehe, da habe ich jetzt"}, {"id": 510, "start": 4462.92, "end": 4475.08, "text": "irgendwie diesen komischen Aya-ya-Ausschnitt im Kopf. Shinobuni. Aya-ya? So. Amazon Choice."}, {"id": 511, "start": 4475.08, "end": 4486.68, "text": "Moment, wir gucken jetzt mal was anderes. Wir gucken jetzt mal was, und zwar die Bewertung"}, {"id": 512, "start": 4486.68, "end": 4492.8, "text": "müssen wir uns jetzt mal angucken. Wichtig ist, von wann die ersten Bewertungen sind,"}, {"id": 513, "start": 4492.8, "end": 4500.16, "text": "kann man auch älteste zuerst machen? Älteste zuerst? Nein. Geht natürlich nicht Amazon."}, {"id": 514, "start": 4500.16, "end": 4514.6, "text": "Amazon. Sortieren nach neueste zuerst. Ich glaube es nicht. Warum gibt es kein Paging"}, {"id": 515, "start": 4514.6, "end": 4533.16, "text": "mehr für Kommentare? Meine Güte, Alter. Wie mich Webdesign 2019 abfuckt. Wie mich Webdesign"}, {"id": 516, "start": 4533.16, "end": 4540.24, "text": "2019 abfuckt, das könnt ihr euch gar nicht vorstellen. Ich will einfach nur sehen, wann"}, {"id": 517, "start": 4540.24, "end": 4547.28, "text": "der älteste Kommentar her ist. Warum geht das nicht? Oder bin ich einfach nur zu dumm?"}, {"id": 518, "start": 4547.28, "end": 4574.6, "text": "Webdesign 2019, ey. Wie lange darf ich das jetzt machen? Drei Stunden, oder? Ach, hier."}, {"id": 519, "start": 4574.6, "end": 4595.84, "text": "Okay. Also die erste, die erste Rezension ist von Mitte 2018. Das heißt, die verkaufen"}, {"id": 520, "start": 4595.84, "end": 4605.12, "text": "wirklich einen PC von vor, sagen wir mal, acht Jahren, sieben Jahre, einen PC von vor"}, {"id": 521, "start": 4605.12, "end": 4612.08, "text": "sieben Jahren, der vor sieben Jahren noch nicht mal gut gewesen wäre. Das war die Zeit,"}, {"id": 522, "start": 4612.08, "end": 4624.28, "text": "wo AMD überhaupt nicht mithalten konnte. Boah, wupp wupp wupp geht mir auf. Bin vollends"}, {"id": 523, "start": 4624.28, "end": 4631.68, "text": "positiv überrascht. Alle Spiele laufen bei höchster Auflösung. Also entweder ist das"}, {"id": 524, "start": 4631.68, "end": 4640.64, "text": "der übelste Kacknoob oder er ist bezahlt. Ich hätte beim Kauf von Einzelkomponenten"}, {"id": 525, "start": 4640.64, "end": 4649.8, "text": "wesentlich mehr bezahlt. Das bezweifle ich. War ganz davon abgesehen. Natürlich ist der"}, {"id": 526, "start": 4649.8, "end": 4669.04, "text": "scheiß teuer. Das gibt es ja mittlerweile auch nicht mehr. Mehr als Defekthexe. Was"}, {"id": 527, "start": 4669.04, "end": 4688.24, "text": "ist Defekthexe? Okay, dann müssen wir uns die Bewertung mal angucken. Was ist eine Defekthexe?"}, {"id": 528, "start": 4688.24, "end": 4697.76, "text": "Ich hab keine Ahnung Leute, ich hab keinen Schimmer. Es gibt eine Seite, wo man Fake-Bewertungen"}, {"id": 529, "start": 4697.76, "end": 4706.6, "text": "filtern kann. Okay, wie machen die das? Das hab ich noch nie. Oh, das ist ja cool. Was"}, {"id": 530, "start": 4706.6, "end": 4730.92, "text": "ist das? Review-Matter. It's a tool analyzing reviews on Amazon. I understand. Copy-Paste-Product-Url. Ja, geht wahrscheinlich nur auf Englisch,"}, {"id": 531, "start": 4730.92, "end": 4757.72, "text": "okay. Okay, das sieht sehr vertrauenserwürdig aus."}, {"id": 532, "start": 4757.72, "end": 4771.0, "text": "Die haben die Produkte getauscht irgendwie, aber die anderen Produkte waren genauso kacke."}, {"id": 533, "start": 4771.0, "end": 4783.36, "text": "Okay, also was schreiben denn die Leute? 102 Personen fanden das hilfreich. Die am höchsten"}, {"id": 534, "start": 4783.36, "end": 4788.4, "text": "bewertete kritische Rezession ist, zweimal ein beschädigtes Gerät erhalten. Mehr als"}, {"id": 535, "start": 4788.4, "end": 4800.64, "text": "Defekthexe. Ich hab immer noch keine Ahnung, was er uns sagen will mit Defekthexe. Link"}, {"id": 536, "start": 4800.64, "end": 4813.76, "text": "auf Discord geschickt. Vor allem hat er auch noch so ein hässliches Gehäuse dabei. Okay,"}, {"id": 537, "start": 4813.76, "end": 4818.28, "text": "wir müssen jetzt mal die Kommentare durchlesen. Was schreiben die Leute denn alles? Kann man"}, {"id": 538, "start": 4818.28, "end": 4844.48, "text": "drei Monitore anschließen? Moment. Ja, der hat recht, der Typ. Leider sehr enttäuschend."}, {"id": 539, "start": 4844.48, "end": 4861.56, "text": "Ich meine, wer das glaubt, ja. Wer das glaubt. Was? Defekthexe? Diese Seite? Ernsthaft, es"}, {"id": 540, "start": 4861.56, "end": 4883.68, "text": "gibt ne Seite, die Defekthexe heißt. Okay, das hat damit aber glaub ich nix zu tun. Alter,"}, {"id": 541, "start": 4883.68, "end": 4898.08, "text": "die Musik. Oh, Grip. Oh. Kann ich mal wieder nicht entscheiden, ob's laut oder leise sein"}, {"id": 542, "start": 4898.08, "end": 4906.08, "text": "soll. Geldabzock ist statt Gamingwunder. Ist leider überhaupt kein Gaming-PC, wie angegeben."}, {"id": 543, "start": 4906.08, "end": 4914.16, "text": "Ach, eher ein schlechter Witz. Oh, der hat sogar ne 1060. Veraltenes Board, schlechter"}, {"id": 544, "start": 4914.16, "end": 4920.72, "text": "RAM, langsamer Festplatte, schlechte CPU. Noch nichtmal für CSGO ist das ausreichend."}, {"id": 545, "start": 4920.72, "end": 4925.92, "text": "CS will so viel FPS wie irgendwie nur möglich. GTA V ruckeln, das heißt schon was. GTA V"}, {"id": 546, "start": 4925.92, "end": 4931.84, "text": "läuft eigentlich fast überall. Halbwegs, halbwegs. Gut zum anderen. Ja, die Rezession"}, {"id": 547, "start": 4931.84, "end": 4936.88, "text": "ist zwei Tage alt. Kompletter Dreck. Besser 500 Euro mehr ausgeben und einen guten und"}, {"id": 548, "start": 4936.88, "end": 4942.12, "text": "zukunftssicheren PC ausgeben. Für 500 Euro kann er sich nen besseren PC kaufen aktuell."}, {"id": 549, "start": 4942.12, "end": 4963.0, "text": "All die Musik. Witz. 7, 7 Cent. Dankeschön. Schlagschade. Gut. Magst du die Fallout-Reihe?"}, {"id": 550, "start": 4963.0, "end": 4969.44, "text": "Ich hab die neuen nicht mehr gespielt, aber an sich schon, ja. Oh, ich hab was, ich hab"}, {"id": 551, "start": 4969.44, "end": 4975.32, "text": "was übersehen, Leute. The Reezes. Bist du noch am Start? Nur mit einem echten Sub ist"}, {"id": 552, "start": 4975.32, "end": 4980.92, "text": "mein LQ ins unermessliche gestiegen, Pfeil Pferd. Ja, hoffe ich mal, hoffe ich. Und mit"}, {"id": 553, "start": 4980.92, "end": 4991.72, "text": "jedem Monat, mit jedem Monat wird's noch mehr. Wie wär's mit PC-Empfehlungen zu Weihnachten?"}, {"id": 554, "start": 4991.72, "end": 4997.92, "text": "Ja, wenn Hardware-Rat da Bock hat, können wir wieder was machen. Das sind doch, das"}, {"id": 555, "start": 4997.92, "end": 5003.84, "text": "sind doch Fake-Reviews, oder? Oder ist das, oder sind die Leute wirklich einfach nur dämlich?"}, {"id": 556, "start": 5003.84, "end": 5012.6, "text": "PC scheint leise zu sein, funktioniert bei Spielen sehr flüssig. Nein. Wenn man Candy"}, {"id": 557, "start": 5012.6, "end": 5019.8, "text": "Crush spielt vielleicht. Der PC hat alles, was man benötigt. Wichtig war, dass er das"}, {"id": 558, "start": 5019.8, "end": 5027.16, "text": "Windows Office schon hatte. Oh, wichtig, natürlich ist das Windows Office enorm wichtig. Power"}, {"id": 559, "start": 5027.16, "end": 5032.36, "text": "Point wäre nicht schlecht gewesen, kann man aber noch installieren. Alter, die Gnoobs,"}, {"id": 560, "start": 5032.36, "end": 5045.32, "text": "ey. Top PC zum Top Preis, sehr guter PC. Nein, ist er nicht. War auch Activirus dabei,"}, {"id": 561, "start": 5045.32, "end": 5056.12, "text": "ja. Norton Internet Security Suite bestimmt. Michi, Stufe 1, Dankeschön, Poggers. Ähm,"}, {"id": 562, "start": 5056.12, "end": 5061.52, "text": "ich habe nur die Grafikkarte gewechselt, den Arbeitsspeicher und eine SSD, alles spielbar."}, {"id": 563, "start": 5061.52, "end": 5072.08, "text": "Moment, der hat auch noch richtig Geld reingesteckt in den PC. Ich habe nur die Grafikkarte gewechselt,"}, {"id": 564, "start": 5072.08, "end": 5076.92, "text": "den Arbeitsspeicher und eine SSD, das heißt, der hat eigentlich alles ausgetauscht, was"}, {"id": 565, "start": 5076.92, "end": 5093.0, "text": "noch irgendwie, was, oh Mann. Sowas gibt es, ich wusste nicht, dass es eine GTX 1030 gibt."}, {"id": 566, "start": 5093.0, "end": 5100.04, "text": "Sehr guter PC, schönes Gehäuse. Battlefront Apex Legends, na gut, die Dinger laufen auch"}, {"id": 567, "start": 5100.04, "end": 5104.4, "text": "überall gut, aber ich bezweifle, dass die wirklich richtig gut laufen und wenn schon"}, {"id": 568, "start": 5104.4, "end": 5110.32, "text": "liegt es da dran, dass eine 1060 dafür ganz okay ist. Ähm, mit Unschlapp, die Leute sind"}, {"id": 569, "start": 5110.32, "end": 5128.88, "text": "so hängen geblieben, warum? Stimmt. Ah, jetzt verstehe ich, dass die Skamasen."}, {"id": 570, "start": 5128.88, "end": 5141.04, "text": "Den PC gibt es mit einer, nö, machen sie nicht. Sie haben mir das hier halt alles irgendwie"}, {"id": 571, "start": 5141.04, "end": 5150.72, "text": "zusammengefasst, aber es ist alles, alles die gleiche Kack-CPU. So, und der andere,"}, {"id": 572, "start": 5150.72, "end": 5162.96, "text": "der für tausend Euro, Alter, tausend, fucking, tausend Euro, tausend Euro für acht Jahre"}, {"id": 573, "start": 5162.96, "end": 5184.8, "text": "für acht Jahre. Alter. Was ist dieses Wuppwuppwupp, das ist ja ätzend heute. Okay, wir gehen"}, {"id": 574, "start": 5184.8, "end": 5190.2, "text": "jetzt mal auf Anfang zurück, gucken von wann die erste Bewertung ist. Okay, die Leute schätzen"}, {"id": 575, "start": 5190.2, "end": 5195.68, "text": "das hier wirklich richtig ein. PC-Gehäuse leicht beschädigt. Internet G-Data lässt"}, {"id": 576, "start": 5195.68, "end": 5209.36, "text": "sich nicht aktivieren. Ich weiß jetzt nicht, ob das ein negativer Punkt ist, ehrlich gesagt."}, {"id": 577, "start": 5209.36, "end": 5237.64, "text": "Es war nur ein Grafik-Chip undenkbar. Ah ja. Was möchte er uns sagen? Es war nur ein Grafik-Chip."}, {"id": 578, "start": 5237.64, "end": 5251.5, "text": "Er will uns nicht undenkbar sagen. Erkennbar? Erkennbar? Meint er den RAM-Riegel? Erkennbar?"}, {"id": 579, "start": 5251.5, "end": 5256.28, "text": "Es war nur ein RAM-Riegel erkennbar? Will er uns sagen, dass das, dass da nur ein RAM-Riegel"}, {"id": 580, "start": 5256.28, "end": 5264.24, "text": "drin ist? Es war nur ein RAM-Riegel erkennbar? Ja, es ist auch nur ein RAM-Riegel. Und weiter?"}, {"id": 581, "start": 5264.24, "end": 5293.2, "text": "PC-Spiel in Ultra. Wow, auf mittleren Einstellungen, 25 FPS. Krasse Gaming-PC. Kack-W. Da können"}, {"id": 582, "start": 5293.2, "end": 5312.84, "text": "wir wirklich mal Kack-W verwenden heute. Wow, in mittleren 25 FPS. Das ist schlecht. Ja,"}, {"id": 583, "start": 5312.84, "end": 5326.24, "text": "die On-Board-GPU von der aktuellen CPU wäre besser. Kannst du mal auf Anker-Mann die PCs"}, {"id": 584, "start": 5326.24, "end": 5335.72, "text": "bewerten? Was ist Anker-Mann? Ist Anker nicht so ein China-Hersteller von USB-Hubs und Zeug?"}, {"id": 585, "start": 5335.72, "end": 5356.52, "text": "Okay. Warum man niemals einen PC bei Amazon kaufen sollte? Okay, was haben wir denn hier"}, {"id": 586, "start": 5356.52, "end": 5381.44, "text": "noch drin? Insane Scam, okay. Okay, was ist Anker-Mann? PC-Systeme. Was soll ich da jetzt"}, {"id": 587, "start": 5381.44, "end": 5394.36, "text": "zu sagen? Okay, also was schreiben die Leute denn hier sonst noch Tolles? Hilfe! Da sieht"}, {"id": 588, "start": 5394.36, "end": 5402.4, "text": "man mal, dass tatsächlich hier mit Leute scamaßt werden. Die denken sich, sie kaufen wirklich"}, {"id": 589, "start": 5402.4, "end": 5407.2, "text": "einen geilen Gaming-PC und dann ist es der... Ich meine, es ist in Deutschland nicht verboten,"}, {"id": 590, "start": 5407.2, "end": 5411.96, "text": "das zu verkaufen. Muss man auch mal ganz klar sagen. Also, der darf diesen Kram hier verkaufen."}, {"id": 591, "start": 5411.96, "end": 5433.68, "text": "Ob man ihn als Ultra-Gaming-PC anpreisen darf, ist was anderes. Lieferung war schnell, optisch"}, {"id": 592, "start": 5433.68, "end": 5440.16, "text": "und technisch 100%. Der Typ hat wirklich sich diesen PC für 1000 Euro gekauft, ich glaube"}, {"id": 593, "start": 5440.16, "end": 5463.2, "text": "es nicht. PC langsam. Bewertung bezahlt. Okay, das ist jetzt gekauft."}, {"id": 594, "start": 5463.2, "end": 5485.28, "text": "Das kann nicht sein, dass es Leute wirklich gut finden. Angeblich soll der Prozessor den"}, {"id": 595, "start": 5485.28, "end": 5494.12, "text": "Turbo unterstützen, aber er funktioniert... Welcher Turbo? Das ist nur ein PC, da war nichts"}, {"id": 596, "start": 5494.12, "end": 5503.12, "text": "mit Turbo. Ein Ryzen 5 der zweiten Genre hat mehr Leistung als... Der Vergleich ist jetzt"}, {"id": 597, "start": 5503.12, "end": 5509.64, "text": "ein bisschen komisch, aber okay. Der meint wahrscheinlich die GPU. Ist beim Ryzen überhaupt"}, {"id": 598, "start": 5509.64, "end": 5514.32, "text": "eine GPU drinne? Das ist immer so wenig, kenn ich mich aus mit aktuellem Zeug. Ihr seid"}, {"id": 599, "start": 5514.32, "end": 5519.28, "text": "doch Verbrecher aus Ursemia. Ja, das stimmt schon. Okay, hier haben es die Leute wenigstens"}, {"id": 600, "start": 5519.28, "end": 5536.08, "text": "gecheckt. Ne, ne, ne. Das sieht doch jetzt halbwegs normal aus. Ich meine, natürlich"}, {"id": 601, "start": 5536.08, "end": 5540.8, "text": "viel zu teuer im Endeffekt. Das ist aber nicht so ein Crap wie das andere, was wir"}, {"id": 602, "start": 5540.8, "end": 5557.64, "text": "gesehen haben. Ich meine, das ist natürlich viel zu teuer für so was hier. Denkst du"}, {"id": 603, "start": 5557.64, "end": 5564.08, "text": "der HP Microserver Gen 10 ist brauchbar für 12 VMs zu hosten, die Linux im Idle-Betrieb"}, {"id": 604, "start": 5564.08, "end": 5571.08, "text": "fahren. Cheat125 schickt mir mal eine Link zu dem Sauber, den ihr kaufen wollt, da kann"}, {"id": 605, "start": 5571.08, "end": 5575.64, "text": "ich ihr das sagen. Aber in der Regel ist fast alles schnell genug, um 12 VMs im Idle zu"}, {"id": 606, "start": 5575.64, "end": 5604.48, "text": "hosten. Nächste Mal die Antwort, please. Welche? Welche Antwort? Okay, Moment, ich"}, {"id": 607, "start": 5604.48, "end": 5617.24, "text": "guck sie mir mal kurz an. Der da. Ähm, also die Dinger sind übrigens immer, die sind"}, {"id": 608, "start": 5617.24, "end": 5623.04, "text": "ziemlich gut. Die kann man an sich empfehlen, wenn man einfach was Fertiges haben will,"}, {"id": 609, "start": 5623.04, "end": 5627.08, "text": "was was taugt. Das ist echt nicht schlecht, die Teile. Okay, was ist denn da drinnen?"}, {"id": 610, "start": 5627.08, "end": 5635.96, "text": "Specifications, ein Opteron X300, was ist denn das? Ist das was Neues, ist das was Altes?"}, {"id": 611, "start": 5635.96, "end": 5646.28, "text": "Ist das, ist das, ist das die, ist das ein Ryzen Abkömmling? Keine Ahnung von. Ah nee,"}, {"id": 612, "start": 5646.28, "end": 5665.44, "text": "Jaguar ist das noch. Ja, mit wieviel RAM willst du den kaufen? Mit wieviel RAM ist deiner?"}, {"id": 613, "start": 5665.44, "end": 5676.56, "text": "Das reicht dicke, um 12 Idle VMs zu hosten. Vorab kein Ding. 16G, jaja, easy, reicht"}, {"id": 614, "start": 5676.56, "end": 5691.6, "text": "das, easy. Linux Idle, den Dinger, den gibste 256 MB RAM und gut ist. Das reicht, das reicht"}, {"id": 615, "start": 5691.6, "end": 5696.96, "text": "dicke, für 12 Idle. Aber wohlgemerkt Idle, die ab und zu mal ein bisschen was machen,"}, {"id": 616, "start": 5696.96, "end": 5705.76, "text": "aber du kannst, also, warum willst du überhaupt 12 Linux VMs hosten? Also, vielleicht kannst"}, {"id": 617, "start": 5705.76, "end": 5713.28, "text": "du es nicht irgendwie anders losen? 12 Idle VMs hört sich irgendwie so, weiß nicht, was"}, {"id": 618, "start": 5713.28, "end": 5719.48, "text": "hast du denn vor? Eine VM per Service, vielleicht kannst du einfach einen Container per Service"}, {"id": 619, "start": 5719.48, "end": 5729.08, "text": "machen, das wäre noch deutlich ressourcensparender. Ein Container per Service braucht im Endeffekt"}, {"id": 620, "start": 5729.08, "end": 5749.68, "text": "gar nichts. Meinst du Home Assistant und weitere Dienste? Web Server, was ist denn Bad? Web Server,"}, {"id": 621, "start": 5749.68, "end": 5758.36, "text": "auf einem Home Server ist Overkill und nicht Energiesparen. Die Boards sind ganz gut. Nö,"}, {"id": 622, "start": 5758.36, "end": 5767.88, "text": "das ist okay, kann man machen. Guck mal kurz in das Video rein, da zeigt ein Typ die Seiten"}, {"id": 623, "start": 5767.88, "end": 5771.68, "text": "in Australien nehmen. Welches Video, Leute? Ihr wisst, ich bin beim Chat manchmal nicht"}, {"id": 624, "start": 5771.68, "end": 5777.44, "text": "so ganz, ihr müsst versuchen die Comments, wenn ich da irgendwas mir angucken soll, die"}, {"id": 625, "start": 5777.44, "end": 5780.6, "text": "so möglichst komplett zu verfassen, wo das alles drin ist. Ich kann nicht immer drei"}, {"id": 626, "start": 5780.6, "end": 5788.4, "text": "Comments zusammensuchen, ich weiß überhaupt nicht mehr, auf was sich das bezieht. Aber"}, {"id": 627, "start": 5788.4, "end": 5792.64, "text": "fertig PCs waren noch nie günstig, das stimmt, deswegen machen wir mal ein bisschen Werbung."}, {"id": 628, "start": 5792.64, "end": 5799.92, "text": "Die Dinger kann man sich holen. Die Dinger kann man sich holen. Was hat er denn aktuell?"}, {"id": 629, "start": 5799.92, "end": 5807.36, "text": "Zeig mal her. Was hat er denn aktuell? Comments zusammengebaut mit installiertem Windows zu"}, {"id": 630, "start": 5807.36, "end": 5816.36, "text": "Hause. Zu Hause an. Einfach anschließend loslegen, sehr gut konfiguriert. Was kriegen wir denn"}, {"id": 631, "start": 5816.36, "end": 5823.2, "text": "hier für 399 Euro? Oh, siehe da, das Ding kostet nun ein Viertel von dem anderen und"}, {"id": 632, "start": 5823.2, "end": 5828.56, "text": "ist in allen Belangen viel, viel besser. Was ich mich ja frage ist, wie er das mit dem"}, {"id": 633, "start": 5828.56, "end": 5833.2, "text": "Preis macht. Ich meine, das ist schon ziemlich günstig, was er da zusammenwurstet. Natürlich"}, {"id": 634, "start": 5833.2, "end": 5842.44, "text": "ist es vielleicht noch ein Ticken günstiger, wenn ich das selbst baue, aber er muss ja"}, {"id": 635, "start": 5842.44, "end": 5865.28, "text": "noch was dran verdienen. Was noch mal ein Beispiel für SQF. Alter, was ist das?"}, {"id": 636, "start": 5865.28, "end": 5879.72, "text": "Mir fällt keine Sprache ein, die ähnlich vergleichbar hässlich ist. Was ist das? Alter,"}, {"id": 637, "start": 5879.72, "end": 5895.44, "text": "wie geht's? Das ist schlimmer als Paul. Mir fällt jetzt nichts Vergleichbares ein gerade."}, {"id": 638, "start": 5895.44, "end": 5914.68, "text": "Geh weg. Okay, was kann ich denn, wenn ich bei Hardwarerad richtig Kohle ausgeben will?"}, {"id": 639, "start": 5914.68, "end": 5922.76, "text": "Den Horst Flock können wir kaufen. Den Horst Flock, wer ist denn der Horst Flock? Okay,"}, {"id": 640, "start": 5922.76, "end": 5929.44, "text": "was kriegen wir bei Hardwarerad, wenn wir 3899 Euro ausgeben wollen? Zeig mal her."}, {"id": 641, "start": 5929.44, "end": 5945.92, "text": "Wer ist Horst Flock? Jeden Tag ein Video. Ich hab von Horst Flock noch nie was gehört."}, {"id": 642, "start": 5945.92, "end": 5956.36, "text": "Der immer so tut, als wäre er ein Rentner. Also so wie Wilhelm Kramer LP, oder was? Kennt"}, {"id": 643, "start": 5956.36, "end": 5964.48, "text": "ihr noch jemand? Okay, also was kriegt man bei Hardwarerad für einen 3899 Euro PC? Schauen"}, {"id": 644, "start": 5964.48, "end": 5974.44, "text": "wir mal. Einen i9. Okay, naja, schnellst hinter als CPU. So ein komisches Board, was so 3"}, {"id": 645, "start": 5974.44, "end": 5981.52, "text": "Milliarden Sachen hat, was ich nicht brauch. 32G, 500G Samsung. Eine zweite 1TB SSD, okay."}, {"id": 646, "start": 5981.52, "end": 5991.4, "text": "Hätte man da nicht eine 2TB SSD nehmen können? Mann, das ist teuer, das Ding. Wilhelm Kramer"}, {"id": 647, "start": 5991.4, "end": 5997.24, "text": "war doch Kollege, ja genau. Ich weiß, da gehen nur die Gerüchte. Ach okay, SLI, das"}, {"id": 648, "start": 5997.24, "end": 6009.24, "text": "macht es teuer, das macht es teuer. Das allein sind ja schon mal 2500 Euro. Das allein sind"}, {"id": 649, "start": 6009.24, "end": 6017.0, "text": "ja schon mal 2500 Euro oder 2600 Euro. 2x2080 Ti. Okay, SLI kommt mir nicht mehr in die"}, {"id": 650, "start": 6017.0, "end": 6024.44, "text": "Tüte, was haben wir hier zu bieten? Das gleiche wahrscheinlich nur ohne SLI. So, ein bisschen"}, {"id": 651, "start": 6024.44, "end": 6033.36, "text": "normalere Preise jetzt mal hier. Nehmen wir mal den da. Intel, 8700K. Hat der keine Ryzen"}, {"id": 652, "start": 6033.36, "end": 6040.84, "text": "PCs? Ich dachte eigentlich, ne, wahrscheinlich die bisschen billigeren. Nehmen wir mal 1000"}, {"id": 653, "start": 6040.84, "end": 6045.04, "text": "Euro, das ist eigentlich das, was ich aktuell für einen PC ausgeben würde. Da hat er einen"}, {"id": 654, "start": 6045.04, "end": 6051.32, "text": "Ryzen drin. Aber warum hat er eigentlich noch die Ryzen 5er drin und auch keine Ryzen,"}, {"id": 655, "start": 6051.32, "end": 6056.36, "text": "auch keine 3000er? Wahrscheinlich, weil die preisleistungsmäßig nicht so gut sind, ha?"}, {"id": 656, "start": 6056.36, "end": 6074.8, "text": "Haltbestand. Na gut, ich mein, wenn es vom Preis her, wenn es vom Preis her sich besser"}, {"id": 657, "start": 6074.8, "end": 6082.16, "text": "so lohnt, beziehungsweise eine bessere Grafikkarte einzubauen, dann ist das auf jeden Fall sinnvoller."}, {"id": 658, "start": 6082.16, "end": 6086.36, "text": "Aber da kann man nichts verkehrt machen, großartig, bei den PCs, wenn man was komplettes haben"}, {"id": 659, "start": 6086.36, "end": 6094.52, "text": "will. Das hier liest sich auch nach Crap preisleistungsmäßig und das hier eh. Shinobi sei Dank, der Computer"}, {"id": 660, "start": 6094.52, "end": 6105.8, "text": "läuft schnell und gut. Das ist auch wieder so ne Sellout Rezension. Meine Güte, die Leute."}, {"id": 661, "start": 6105.8, "end": 6115.16, "text": "Entweder sind das wirklich so Kacknoobs oder das ist einfach gekauft. Meine Güte, Alter."}, {"id": 662, "start": 6115.16, "end": 6132.84, "text": "Das ist was ein Kram, ey. Okay, oje, der Chat explodiert ja wieder hier. Ach so, das Video."}, {"id": 663, "start": 6132.84, "end": 6141.76, "text": "Das Video kann man zum Schluss gucken dann. Alter, was ist das für ein, für ein, ich"}, {"id": 664, "start": 6141.76, "end": 6149.32, "text": "mein, das wupp, wupp, wuppt ja immer, aber Melodik ist das, ist das nicht wirklich gerade."}, {"id": 665, "start": 6149.32, "end": 6175.28, "text": "Ja, schon besser. Was, ein Link im Discord? Was?"}, {"id": 666, "start": 6175.28, "end": 6193.24, "text": "Wonke S. Mit 2TB Mikro SST? War das nicht alles gefuckt? Das kann doch nicht, das kostet"}, {"id": 667, "start": 6193.24, "end": 6204.28, "text": "gar nichts, oder? Kannst du erklären, was SLI für Vorteile hat und Nachteile hat? Naja,"}, {"id": 668, "start": 6204.28, "end": 6208.92, "text": "der Vorteil bei SLI ist ganz klar, wenn dir eine Grafikkarte nicht ausreicht, weil du"}, {"id": 669, "start": 6208.92, "end": 6216.88, "text": "irgendwie 8K, 4K, 120 FPS oder was auch immer machen willst, mit hohen Details, dann baust"}, {"id": 670, "start": 6216.88, "end": 6220.52, "text": "dir noch eine zweite Grafikkarte da rein und du kriegst ein bisschen mehr Performance."}, {"id": 671, "start": 6220.52, "end": 6226.64, "text": "Du kriegst nicht doppelt so viel Performance, du kriegst, ich sag mal so 50, 40 bis 80%"}, {"id": 672, "start": 6226.64, "end": 6232.4, "text": "mehr je nach Game Performance, aber die Nachteile sind, dass viele Games rumspacken auf SLI"}, {"id": 673, "start": 6232.4, "end": 6236.92, "text": "Systemen, deswegen hat halt kaum noch eine SLI Systeme. Du hast irgendwelche Mikro-Ruckler"}, {"id": 674, "start": 6236.92, "end": 6243.96, "text": "und es sackt einfach nur. Und viele Spiele haben auch keine gute SLI-Unterstützung mehr."}, {"id": 675, "start": 6243.96, "end": 6255.4, "text": "Das ist einfach outdated mittlerweile, SLI. Max, was meinst du, wie lange? Äh, wo sind"}, {"id": 676, "start": 6255.4, "end": 6271.6, "text": "wir stehen geblieben? Max, was meinst du, wie lange dauert es, bis viele Programme und"}, {"id": 677, "start": 6271.6, "end": 6277.56, "text": "Spiele auf Linux funktionieren und man wechseln kann, ohne auf Gaming-ETC zu verzichten? Wahrscheinlich"}, {"id": 678, "start": 6277.56, "end": 6283.32, "text": "nie. Wahrscheinlich nie. Ich hab übrigens wieder jede Menge Subs verpasst, wir haben"}, {"id": 679, "start": 6283.32, "end": 6296.88, "text": "ja einmal am Start den, ähm, oder besser gesagt, die Morchel 223 mit einem Prime-Sub"}, {"id": 680, "start": 6296.88, "end": 6306.68, "text": "und dann haben wir Michael 50 Billiarden, Trillionen, was auch immer, resubscribed,"}, {"id": 681, "start": 6306.68, "end": 6315.08, "text": "zwei Monate, huge, high IQ-Sub. Davor hatten wir noch Michi, aber den hab ich glaube ich"}, {"id": 682, "start": 6315.08, "end": 6334.04, "text": "schon vorgelesen. Warum ist denn deine Twitch-Description nicht der Discord-Server? Das ist eine gute"}, {"id": 683, "start": 6334.04, "end": 6344.16, "text": "Frage. Wenn mir einer meiner Mods kurz einen, äh, Invite-Link schicken könnte, der für"}, {"id": 684, "start": 6344.16, "end": 6348.28, "text": "immer gültig ist, weil ich bin zu dumm sowas zu generieren, dann pack ich's in die Beschreibung"}, {"id": 685, "start": 6348.28, "end": 6354.64, "text": "rein. Ja, ich wollte mir eigentlich noch ein paar Stellen anzeigen, zum Schluss jetzt angucken,"}, {"id": 686, "start": 6354.64, "end": 6360.92, "text": "weil Gaming-PCs haben wir durch. Welches Terminal kannst du Windows 10 empfehlen? Also ich kann"}, {"id": 687, "start": 6360.92, "end": 6369.32, "text": "dir zwei Sachen empfehlen. Einmal leg dir eine Linux-VM an und mach dein Zeug da drinnen,"}, {"id": 688, "start": 6369.32, "end": 6377.12, "text": "das ist schon mal mein erster Tipp. Und wenn's unbedingt ein Windows-Terminal sein will,"}, {"id": 689, "start": 6377.12, "end": 6383.52, "text": "dann kann ich dir hier nur den da empfehlen, den, der CMDR, der irgendwie meine Settings"}, {"id": 690, "start": 6383.52, "end": 6390.64, "text": "vergessen hat vom letzten Mal. Der ist tausendmal besser als dieses Kack-Terminal, was bei Windows"}, {"id": 691, "start": 6390.64, "end": 6395.56, "text": "kommt. Vielleicht ist in Zukunft das ganz gut, was Microsoft da gerade noch entwickelt."}, {"id": 692, "start": 6395.56, "end": 6406.84, "text": "Ähm, zum Thema Linux-Gaming kann ich eigentlich noch sagen, wenn wir, also eine, ich sag mal,"}, {"id": 693, "start": 6406.84, "end": 6413.6, "text": "eine gute Sache könnte Google-Stadia tatsächlich machen. Äh, hier, du kannst den Linux-VM,"}, {"id": 694, "start": 6413.6, "end": 6419.32, "text": "installier den Linux-VM, da hast du auch ein ordentliches Terminal. Besser als Windows-Crap."}, {"id": 695, "start": 6419.32, "end": 6427.24, "text": "Ähm, also eine Sache, für die Stadia tatsächlich sorgen könnte, aber wohl gesagt könnte ist,"}, {"id": 696, "start": 6427.24, "end": 6431.2, "text": "dass manche Sachen besser auf Lilungs laufen. Ähm, weil der große Unterschied zwischen"}, {"id": 697, "start": 6431.2, "end": 6435.8, "text": "den bisherigen Streaming-Anbietern, die es, also Gaming-Streamer-Anbieter, die es bisher"}, {"id": 698, "start": 6435.8, "end": 6441.36, "text": "gegeben hat und Stadia ist ja, dass die Game, dass die Games explizit für Stadia angepasst"}, {"id": 699, "start": 6441.36, "end": 6446.64, "text": "werden müssen. Also sprich, das sind keine VMs mit irgendwie, also das sind keine Windows-VMs,"}, {"id": 700, "start": 6446.64, "end": 6454.08, "text": "wo irgendwie Grafikkarten durchgereicht werden oder so. Sondern, das sind, quasi, native"}, {"id": 701, "start": 6454.08, "end": 6459.16, "text": "läuft das, wahrscheinlich haben die schon irgendwie gewisse Professionierungs-, Virtualisierungs-,"}, {"id": 702, "start": 6459.16, "end": 6463.88, "text": "sonst was, Geschichte dahinter. Aber die Games müssen bei Stadia angepasst werden. Ich weiß"}, {"id": 703, "start": 6463.88, "end": 6467.28, "text": "jetzt nicht, was dahinter läuft, aber ich bilde mir ein, ich hab irgendwo gelesen, es"}, {"id": 704, "start": 6467.28, "end": 6472.44, "text": "wäre eine Linux. BSD ist in dem Bereich auch lustigerweise recht beliebt. Man darf nicht"}, {"id": 705, "start": 6472.44, "end": 6477.88, "text": "vergessen, die Playstation läuft auf einem BSD, auf einem FreeBSD. Seit, ich glaub, seit"}, {"id": 706, "start": 6477.88, "end": 6495.28, "text": "der Playstation 2 schon. Oder vielleicht sogar seit der Playstation 1. Ja, Morstl, das ist"}, {"id": 707, "start": 6495.28, "end": 6504.56, "text": "nett von dir. Huge. Big IQ-Sub. Point Bugs. Ah, du wolltest auf Motroid Point IS ausprobieren."}, {"id": 708, "start": 6504.56, "end": 6515.72, "text": "Ja, kann ich schon machen. Wenn ich noch den, war das Cryptsetup Benchmark, was man machen"}, {"id": 709, "start": 6515.72, "end": 6523.16, "text": "muss dafür? Ich glaub, Cryptsetup Benchmark ist das. Probieren wir es mal bei mir lokal"}, {"id": 710, "start": 6523.16, "end": 6531.16, "text": "aus. Wie schnell ich verschlüsseln und entschlüsseln kann lokal bei mir auf dem Rechner, in der"}, {"id": 711, "start": 6531.16, "end": 6538.32, "text": "VM. Und dann vergleichen wir das mal mit der Embedded-Kiste. Ah, dankeschön, Discord-Link,"}, {"id": 712, "start": 6538.32, "end": 6552.32, "text": "den pack ich gleich mal in meine Channel-Beschreibung rein. Schauen wir mal. Ja, aber mal. Discord."}, {"id": 713, "start": 6552.32, "end": 6567.32, "text": "Discord. So, absenden. Also ich sollte jetzt eigentlich in meiner Channel-Beschreibung"}, {"id": 714, "start": 6567.32, "end": 6591.28, "text": "einen Discord-Invite-Link haben. Ja, sollte funktionieren. Ok, also, so schnell sind wir"}, {"id": 715, "start": 6591.28, "end": 6599.52, "text": "bei mir lokal. Und jetzt verbinden wir uns mal. Hab ich nicht mehr in der Historie drinnen."}, {"id": 716, "start": 6599.52, "end": 6617.08, "text": "Was, 123 oder 125 hier? Ok, wir gucken mal. Machen wir hier kurz auf, dass wir sehen,"}, {"id": 717, "start": 6617.08, "end": 6625.08, "text": "was für Auslastung verursacht. Oh, ist nicht installiert. Installieren wir mal. Die Hoffnung,"}, {"id": 718, "start": 6625.08, "end": 6636.08, "text": "dass die Fernsehaufnahmen nicht abkacken oder so. Hab keine Lust, von Windows 7 auf Windows"}, {"id": 719, "start": 6636.08, "end": 6649.12, "text": "10 zu wechseln. Ja, die wird nichts anderes übrig bleiben. Stimmt, anderer Link. Ja,"}, {"id": 720, "start": 6649.12, "end": 6657.04, "text": "das müssen wir nochmal anpassen. Das stimmt. Wir brauchen vom Nightbot den Link. Müssen"}, {"id": 721, "start": 6657.04, "end": 6666.76, "text": "wir nochmal anpassen. Channels bearbeiten. Ok, also schauen wir mal. Crypt Benchmark."}, {"id": 722, "start": 6666.76, "end": 6685.84, "text": "Absenden. So, jetzt Paddles speichern. Ah, funktioniert. Ja, na. Also mit Verschlüsselung"}, {"id": 723, "start": 6685.84, "end": 6690.0, "text": "ist auf dem O-Troid nicht sonderlich viel. Das liegt aber glaube ich da dran, dass der"}, {"id": 724, "start": 6690.0, "end": 6695.36, "text": "Kernel, das ist ja ein Custom Kernel, den wir gebastelt haben hier. Das ist ja ein Custom"}, {"id": 725, "start": 6695.36, "end": 6699.84, "text": "Kernel, den wir gebastelt haben. Und der hat wahrscheinlich schlicht und ergreifend keinerlei"}, {"id": 726, "start": 6699.84, "end": 6704.24, "text": "Crypto Extensions oder irgendwas drinnen. Es könnte aber auch sein, dass der keine"}, {"id": 727, "start": 6704.24, "end": 6711.28, "text": "hat. Da bin ich mir ehrlich gesagt nicht sicher. Vielleicht hat er auch keine Crypto Extensions."}, {"id": 728, "start": 6711.28, "end": 6724.32, "text": "Kann sein. Kann sein. Weil, ich glaube, das hier ist das wichtige für Plattenverschlüsselung"}, {"id": 729, "start": 6724.32, "end": 6731.92, "text": "und 83 MB Lesenschreiben. Ja, aber dann ist er halt volle Pulle ausgelastet. Habt ihr"}, {"id": 730, "start": 6731.92, "end": 6738.8, "text": "mal geguckt, wie die CPU-Auslastung war, als ich das haben laufen lassen? Ach, das ist"}, {"id": 731, "start": 6738.8, "end": 6765.48, "text": "ein Single Threaded oder was? Ah, nee, nee, nee, passt schon. Naja, also so geil mit Fähr-"}, {"id": 732, "start": 6765.48, "end": 6776.36, "text": "und Endschlüssel ist da nix. Also da geht nicht allzu viel. Man müsste es mal ausprobieren."}, {"id": 733, "start": 6776.36, "end": 6782.0, "text": "Man müsste es mal ausprobieren, wie gut das wirklich funktioniert. Kann man jetzt schlecht"}, {"id": 734, "start": 6782.0, "end": 6789.96, "text": "sagen. Funktioniert AES auf dem Pi mittlerweile? Ja, ich glaube, das liegt daran. Das ging"}, {"id": 735, "start": 6789.96, "end": 6794.08, "text": "glaube ich, also ich bin mir nicht ganz sicher. Aber ich glaube, das ging die ganze Zeit schon."}, {"id": 736, "start": 6794.08, "end": 6799.76, "text": "Das Problem war, dass die Encryption auf dem Raspberry Pi, also die Crypto Extensions in"}, {"id": 737, "start": 6799.76, "end": 6808.08, "text": "der CPU nur auf dem 64-Bit-Betriebssystem funktionieren. Magst du welche Encryption- und Hashing-Methode"}, {"id": 738, "start": 6808.08, "end": 6813.88, "text": "findest du aktuell am besten? Ich, ehrlich gesagt, ich fahre da so mit den normalen Standards"}, {"id": 739, "start": 6813.88, "end": 6823.88, "text": "AES und Schale 256 und gut ist. Man muss es ja nicht unbedingt komplizierter machen als"}, {"id": 740, "start": 6823.88, "end": 6839.88, "text": "nötig. Simple 2016 Twitch Prime, Dankeschön. IQ vom Chat wieder gestiegen. Was sagste zu"}, {"id": 741, "start": 6839.88, "end": 6865.88, "text": "dem Deal hier? Mal gucken. Gaming PC Ryzen 5. Das sieht doch ganz ok aus. Was ist da"}, {"id": 742, "start": 6865.88, "end": 6891.28, "text": "denn? Ah hier, da unten steht es. Das sieht ganz gut aus. Ich meine, es ist halt ein Ryzen"}, {"id": 743, "start": 6891.28, "end": 6902.28, "text": "2, aber ganz ehrlich, das reicht auch. Ich würde mir zwar jetzt, wenn schon überhaupt,"}, {"id": 744, "start": 6902.28, "end": 6906.08, "text": "ich würde mir einen Ryzen desktop PC bauen, wenn ich mir einen desktop PC bauen würde,"}, {"id": 745, "start": 6906.08, "end": 6920.0, "text": "aber dann halt mit einem Ryzen 3. Aber das ist ok. 16G sind top. 2060, weil bei der Preiskategorie"}, {"id": 746, "start": 6920.0, "end": 6927.48, "text": "ist das wahrscheinlich auch ganz ok, kommt ein bisschen auf die andere Seite. 256G SSD"}, {"id": 747, "start": 6927.48, "end": 6936.08, "text": "ist halt wirklich osch klein. Bully Guard Internet Security, gut, braucht kein Mensch."}, {"id": 748, "start": 6936.08, "end": 6953.08, "text": "Guck mal, sogar ein Spiel dabei. Ja, das macht, der Eindruck ist ganz in Ordnung. Wobei ich"}, {"id": 749, "start": 6953.08, "end": 6955.88, "text": "halt, wie gesagt, ich würde mir selbst was bauen. Ich würde mir wahrscheinlich irgendwas"}, {"id": 750, "start": 6955.88, "end": 6961.24, "text": "bauen mit einem aktuellen Ryzen, noch ein bisschen schnelleren Grafikkarte und mit einer"}, {"id": 751, "start": 6961.24, "end": 6969.84, "text": "größeren SSD, aber natürlich kommst du dann auch mit 700€ nicht mehr hin. Ich würde"}, {"id": 752, "start": 6969.84, "end": 6975.08, "text": "aber wahrscheinlich 1000€ ausgeben und aktuell einen Ryzen rein machen, eine schnellere Grafikkarte"}, {"id": 753, "start": 6975.08, "end": 6994.44, "text": "und eine größere SSD, dann bist du bei 1000€ und gut ist. Nein, also aktuell, wenn ich"}, {"id": 754, "start": 6994.44, "end": 6999.32, "text": "mir einen desktop PC bauen würde, würde ich mir, zumindest so wie ich das zuletzt geguckt"}, {"id": 755, "start": 6999.32, "end": 7005.16, "text": "habe, vielleicht hat Intel jetzt ja mittlerweile was Neues. Ich habe gelesen, dass die neuen"}, {"id": 756, "start": 7005.16, "end": 7008.8, "text": "CPUs von Intel deutlich günstiger geworden sind, also die neuesten High-End CPUs von"}, {"id": 757, "start": 7008.8, "end": 7019.2, "text": "Intel deutlich günstiger geworden sind als die Generation davor, aber ich würde wahrscheinlich"}, {"id": 758, "start": 7019.2, "end": 7030.44, "text": "einen Ryzen bauen. Liegt zwischen dem Ryzen 2700X und 3700X, ich vermute mal nicht viel,"}, {"id": 759, "start": 7030.44, "end": 7035.76, "text": "aber wir können ja mal gucken. Ein bisschen was dürfte schon sein, das hat sich da eigentlich"}, {"id": 760, "start": 7035.76, "end": 7047.56, "text": "ganz gut was getan. Ja, 15%, 15% ist schon okay von einer Generation. Hat er nicht sogar"}, {"id": 761, "start": 7047.56, "end": 7064.36, "text": "mehr Kerne? Ne, die haben beide 8 Kerne. Es ist halt rund um die bessere CPU. Preis-Leistungs-Mäßig"}, {"id": 762, "start": 7064.36, "end": 7072.04, "text": "müssen wir mal gucken, was kosten da Kram so. Ja gut, deswegen hat Hardwarerat auch noch"}, {"id": 763, "start": 7072.04, "end": 7079.64, "text": "die alten Ryzen drinne, weil die nicht so viel langsamer sind, aber viel billiger sind."}, {"id": 764, "start": 7079.64, "end": 7088.2, "text": "Die kosten nur die Hälfte. Naja, nicht ganz. Zwei Drittel. Weniger. Äh ne, was? Ne, quick"}, {"id": 765, "start": 7088.2, "end": 7105.28, "text": "maths. So 40% oder so. Weniger."}, {"id": 766, "start": 7105.28, "end": 7127.56, "text": "Ich bin mal gespannt, was Intel jetzt noch treibt. Der neuere ist langsam getaktet."}, {"id": 767, "start": 7127.56, "end": 7136.68, "text": "Ja, das juckt doch nicht. Das juckt doch nicht. Rein auf Taktzahlen kannst du eh nicht gucken."}, {"id": 768, "start": 7136.68, "end": 7144.32, "text": "Selbst wenn, die Dinger laufen in der Regel eh höher als das was da angegeben wird."}, {"id": 769, "start": 7144.32, "end": 7152.64, "text": "Haben wir zuletzt bei dem Bauer, beim Auer angeguckt, die Boostgeschichten von den Ryzen"}, {"id": 770, "start": 7152.64, "end": 7160.96, "text": "Dinger und dass die nicht so gut sind, wie er sich das erhofft hat. Hast du eine leichte"}, {"id": 771, "start": 7160.96, "end": 7168.0, "text": "Möglichkeit, ohne was mit NPM oder Nodes zu machen, eine Python Datei über Javascript"}, {"id": 772, "start": 7168.0, "end": 7173.92, "text": "auszuführen? What? Moment. Brauche keine Resultate von Python oder so. Es soll nur"}, {"id": 773, "start": 7173.92, "end": 7186.8, "text": "die Python Datei exekuted werden. Moment. Du willst, du willst in Javascript quasi"}, {"id": 774, "start": 7186.8, "end": 7193.96, "text": "nen Systemcall machen oder was? Du willst in Javascript quasi einfach nen Prozess starten,"}, {"id": 775, "start": 7193.96, "end": 7198.8, "text": "wenn ich das jetzt mal so richtig verstanden hab. Naja, also Node wirst du auf jeden Fall"}, {"id": 776, "start": 7198.8, "end": 7204.96, "text": "schon brauchen, weil du brauchst ja, du brauchst ja, du brauchst ja irgendeine Runtime. Und"}, {"id": 777, "start": 7204.96, "end": 7212.04, "text": "ohne Node wird das nix. Oder ohne, sag mal, ohne irgendeinen Javascript, ohne irgendeine"}, {"id": 778, "start": 7212.04, "end": 7219.04, "text": "Javascript Runtime wird das nix. Es mag da vielleicht irgendwelche leichtgewichtigeren"}, {"id": 779, "start": 7219.04, "end": 7230.52, "text": "Sachen geben, aber irgendeine Runtime brauchste. Oh, das ist cool, Airworker. Aber das wird"}, {"id": 780, "start": 7230.52, "end": 7242.24, "text": "wahrscheinlich nur ganz basic Sachen unterstützen, oder? Also wenn du einfach nur nen Programm"}, {"id": 781, "start": 7242.24, "end": 7246.16, "text": "ausführen willst, also ist egal, ob es jetzt ein Python Programm ist, ein Go-Programm,"}, {"id": 782, "start": 7246.16, "end": 7252.56, "text": "ein Shell-Script, dann machst du einfach, brauchst halt irgendwie ne Javascript Runtime"}, {"id": 783, "start": 7252.56, "end": 7259.08, "text": "auf deinem System und sagst dann sowas, tja, in Python wärs jetzt irgendwie was OS-open"}, {"id": 784, "start": 7259.08, "end": 7263.56, "text": "oder sowas. In Javascript ehrlich gesagt, keine Ahnung, aber das ist halt auch ein bisschen"}, {"id": 785, "start": 7263.56, "end": 7272.4, "text": "von der Runtime abhängig. Weiß ich jetzt nicht, wie man das in Node macht. Wahrscheinlich"}, {"id": 786, "start": 7272.4, "end": 7291.96, "text": "auch sowas wie process, execute oder sowas. Tja, Leute, es ist 21 Uhr, äh, 55. Ich glaub,"}, {"id": 787, "start": 7291.96, "end": 7298.72, "text": "ich muss gleich auf. Aber ich hab ehrlich gesagt gar keinen Bock aufzugehen. Aber ich"}, {"id": 788, "start": 7298.72, "end": 7307.88, "text": "muss morgen wieder arbeiten gehen. Morgen KS. Ah, jetzt, ok, jetzt erzählt er, was er"}, {"id": 789, "start": 7307.88, "end": 7314.04, "text": "haben will. Mein Raspberry Pi soll eine HTML-Seite haben, die einen Button auf der Seite hat."}, {"id": 790, "start": 7314.04, "end": 7325.12, "text": "Wird der gedrückt, soll eine Python angemacht werden. Mehr nicht. Ah, ähm, das hat mir"}, {"id": 791, "start": 7325.12, "end": 7332.96, "text": "mit Javascript nichts zu tun. Du brauchst, du brauchst ein bisschen kleinzeitigen Javascript,"}, {"id": 792, "start": 7332.96, "end": 7338.92, "text": "aber das ist viel einfacher. Ähm, du könntest, du könntest sowas wie, sowas wie Flask oder"}, {"id": 793, "start": 7338.92, "end": 7345.96, "text": "so nehmen und einfach mini-Web-Server in Python starten, der, äh, deine Sachen ausführt."}, {"id": 794, "start": 7345.96, "end": 7353.72, "text": "Das ist, das ist super simpel hier, guck mal. Mehr brauchste nicht. Das bindest du einfach"}, {"id": 795, "start": 7353.72, "end": 7359.28, "text": "in eine Python-Datei an, ein, und wenn einer diese, diese Url hier aufruft, dann wird diese"}, {"id": 796, "start": 7359.28, "end": 7364.72, "text": "Funktion auf, ausgeführt. Und da kannst du natürlich dein, dein Python-Zeug drinne starten."}, {"id": 797, "start": 7364.72, "end": 7367.64, "text": "Da kannst du nämlich das Backern einfach in Python hosten, das macht's viel einfacher."}, {"id": 798, "start": 7367.64, "end": 7374.08, "text": "Und, ähm, für die Seite, für die Seite, die machst du entweder inline, schreibst du"}, {"id": 799, "start": 7374.08, "end": 7381.48, "text": "hier, dann HTML rein. Ähm, oder aber du lässt irgendwie eine statische Seite da drüber"}, {"id": 800, "start": 7381.48, "end": 7388.32, "text": "surfen. Das ist, das dürfte dann relativ einfach sein. Ah, so, so würde ich das wahrscheinlich"}, {"id": 801, "start": 7388.32, "end": 7395.04, "text": "machen. Da würde ich nämlich einfach, ähm, in, in Python mein Backend starten. Ansonsten"}, {"id": 802, "start": 7395.04, "end": 7397.6, "text": "könntest du das in jeder x-beliebigen anderen Sprache machen, da brauchst du kein Node"}, {"id": 803, "start": 7397.6, "end": 7402.36, "text": "dafür oder so. Ja, das, du brauchst da wahrscheinlich, wahrscheinlich brauchst du da noch nicht"}, {"id": 804, "start": 7402.36, "end": 7410.84, "text": "mal großartigen Javascript für. Machst n Button, Submit, Submit auf die, auf die Url"}, {"id": 805, "start": 7410.84, "end": 7415.24, "text": "und gut ist. Da brauchst du nicht mal Javascript für, da brauchste, da brauchste eine, eine"}, {"id": 806, "start": 7415.24, "end": 7431.08, "text": "Zeit, eins oder zwei Zeilen HTML. Kannste alles inline machen. Ja, also das ist glaub"}, {"id": 807, "start": 7431.08, "end": 7440.12, "text": "ich recht easy damit zu bewerkstelligen. Preise von den neuen Intel-CPUs, ah, da gucken wir"}, {"id": 808, "start": 7440.12, "end": 7453.96, "text": "jetzt noch mal schnell. Huge, äh, Quali. Beste Quali aller Zeiten hier. Was hat man"}, {"id": 809, "start": 7453.96, "end": 7459.72, "text": "zu bieten? Oh, langsam, wenn die Intel-CPU-Namen aber auch wieder un, unleserlicher, könnte"}, {"id": 810, "start": 7459.72, "end": 7475.2, "text": "es ja kaum sein, äh. Guck mal, die i3 haben jetzt hier vier Kerne, acht Threads, ähm,"}, {"id": 811, "start": 7475.2, "end": 7481.4, "text": "ab dem i5 sind schon sechs Kerne, okay. Die sechs Kerne hab ich, bei mir noch ab dem i7"}, {"id": 812, "start": 7481.4, "end": 7501.56, "text": "gekriegt. Commit lag, die stehen auf lag, wow. Moment. Warum kostet das 1000, ah, Moment."}, {"id": 813, "start": 7501.56, "end": 7515.96, "text": "Hi, ich hab mich verguckt. Ich hab mich verguckt. Es sind 129 Dollar. Ich wollt grad sagen,"}, {"id": 814, "start": 7515.96, "end": 7544.6, "text": "die i3 kostet jetzt 1000 Dollar. Was ist da los? Ähm. Okay, die Preise sind okay. Die"}, {"id": 815, "start": 7544.6, "end": 7563.0, "text": "sind jetzt wenigstens in Regionen, die konkurrenzfähig zu AMD sind. Aber die Bezeichnung ist ja schon"}, {"id": 816, "start": 7563.0, "end": 7576.72, "text": "mal wieder wir, oder? I9, 10800F, 10900F, 10900KF. Also mit K ist ja wieder, äh, taktänderbar."}, {"id": 817, "start": 7576.72, "end": 7582.6, "text": "Was ist das, ein neuer Sockel wieder? Nee, nicht erst neu. Das ist tatsächlich wieder"}, {"id": 818, "start": 7582.6, "end": 7587.8, "text": "ein neuer Sockel. Also Intel übertreibt's echt, ja. AMD schafft's irgendwie drei bis"}, {"id": 819, "start": 7587.8, "end": 7595.68, "text": "vier Jahre oder so mit dem gleichen Sockel. Und Intel braucht quasi bei jedem geänderten"}, {"id": 820, "start": 7595.68, "end": 7606.12, "text": "Register irgendwie gleich einen neuen Sockel. So nach dem Motto, oh wir haben da ein Transistor"}, {"id": 821, "start": 7606.12, "end": 7611.48, "text": "an der anderen Stelle. Was machen wir denn da jetzt? Neuer Sockel. Was sonst? Intel macht"}, {"id": 822, "start": 7611.48, "end": 7619.4, "text": "immer neuer Sockel. Ähm, Intel liebt ihre Pins. Die haben ja noch nicht mal mehr Pins."}, {"id": 823, "start": 7619.4, "end": 7626.08, "text": "Das ist es ja gerade. Die haben ja nur noch diese Pads zum Auflegen jetzt. Oder haben"}, {"id": 824, "start": 7626.08, "end": 7633.64, "text": "Intel CPUs mittlerweile wieder Pins. Nee, ne? Diese Kontakte. Also was gibt's denn hier?"}, {"id": 825, "start": 7633.64, "end": 7640.04, "text": "Also, okay, schauen wir mal. Vergleichbar, ich hab dann 8700K. Das ist vergleichbar mit"}, {"id": 826, "start": 7640.04, "end": 7648.72, "text": "dem hier. Nur, dass ich jetzt zwei Kerne mehr kriegen würde. Takt hat sich nix geändert."}, {"id": 827, "start": 7648.72, "end": 7654.64, "text": "Ist exakt das gleiche wie bei mir. Also ich hab ja meine auch über Takt. Ich weiß gar"}, {"id": 828, "start": 7654.64, "end": 7658.6, "text": "nicht wie viel. Ich glaub' meiner ist standardmäßig mit 4,5 gelaufen. Aber Takt ist exakt das"}, {"id": 829, "start": 7658.6, "end": 7671.08, "text": "gleiche wie bei mir. So, dass alle mit 5,1 laufen. Es hat zwei Kerne mehr. Kostet aber"}, {"id": 830, "start": 7671.08, "end": 7686.64, "text": "ein bisschen weniger als damals meiner. Ich muss euch ehrlich sagen, fürs Spielen erscheint"}, {"id": 831, "start": 7686.64, "end": 7702.76, "text": "mir der hier eigentlich noch mit am attraktivsten. Also zum Spielen muss ich sagen, gefällt"}, {"id": 832, "start": 7702.76, "end": 7709.56, "text": "mir der hier eigentlich noch mit am besten. Der hat den besten Takt. Der hat ne gute Anzahl"}, {"id": 833, "start": 7709.56, "end": 7717.52, "text": "an Kerne. Mehr brauchen wir fürs Spielen eh nicht. Der ist preisleistungsmäßig auch okay."}, {"id": 834, "start": 7717.52, "end": 7731.64, "text": "Ich mein, man könnte auch einfach den da nehmen. Bezahlt man 100€ mehr, 110€ mehr,"}, {"id": 835, "start": 7731.64, "end": 7735.76, "text": "hat nicht wirklich viel niedrigeren Takt. Mit dem passenden Board und der passenden Kühlung"}, {"id": 836, "start": 7735.76, "end": 7746.12, "text": "läuft der hier wahrscheinlich auch locker auf 4,8. Der ist auch nicht schlecht. Was ist"}, {"id": 837, "start": 7746.12, "end": 7772.56, "text": "denn da bei AMD vergleichbar? Der 3800? 8 Kerne oder 3800? Ne, müssen wir noch ein"}, {"id": 838, "start": 7772.56, "end": 7793.92, "text": "höher gehen. Ja, das ist ungefähr der vergleichbare. Der hat, nicht Kundenbewertung, der hat, ja"}, {"id": 839, "start": 7793.92, "end": 7804.68, "text": "der kommt fast gleich heraus. Okay, das ist Turbo, Turbotakt. Dafür hat man dann noch"}, {"id": 840, "start": 7804.68, "end": 7811.56, "text": "zwei Kerne mehr. Tja, muss mal gucken, was dann wichtig ist. Aber ich muss sagen, das"}, {"id": 841, "start": 7811.56, "end": 7817.84, "text": "sieht mir doch hier relativ konkurrenzfähig aus. Wobei man halt sagen muss, 10 und 12"}, {"id": 842, "start": 7817.84, "end": 7823.44, "text": "Kerne braucht man eigentlich nicht. Dann würde ich lieber einen 3700X nehmen oder irgendwie"}, {"id": 843, "start": 7823.44, "end": 7837.08, "text": "so was. Für weniger als der, also auf dem Niveau. Also aktuell würde ich wahrscheinlich"}, {"id": 844, "start": 7837.08, "end": 7857.24, "text": "den hier nehmen. An CPUs. So, und das entspricht dann ungefähr dem hier. 8 Kerne hat der hier"}, {"id": 845, "start": 7857.24, "end": 7872.96, "text": "auch. Ja, dann würde ich den hier nehmen. Ah, guck mal, nur bei dem teureren kriegst"}, {"id": 846, "start": 7872.96, "end": 7881.88, "text": "du hier den Multiplikator. Ich würde wahrscheinlich trotzdem den hier nehmen irgendwie, so bauchgefühlmäßig."}, {"id": 847, "start": 7881.88, "end": 7887.84, "text": "Jetzt mal ein bisschen genauer überlegen. Aber ich finde, das sieht relativ konkurrenzfähig"}, {"id": 848, "start": 7887.84, "end": 7895.28, "text": "aus, was Intel jetzt hier gerade am Start hat. Glaubst du, Intels Grafikkarte werden alles"}, {"id": 849, "start": 7895.28, "end": 7907.52, "text": "zerficken? Nö, warum sollten sie? Was hast du gegen LGA Sockel? Nix. Ich habe nur was"}, {"id": 850, "start": 7907.52, "end": 7929.6, "text": "dagegen, das Intel alle furzlange neuen Sockel hat. AMD hat immer noch diese eklig schnell"}, {"id": 851, "start": 7929.6, "end": 7933.8, "text": "kaputtbaren Dinge an ihren CPUs. Weiß ich nicht, was du meinst, keine Ahnung. Ich hatte"}, {"id": 852, "start": 7933.8, "end": 7953.0, "text": "schon lange kein AMD-CPU mehr. Gut, mal gucken, ob ich irgendjemand hosten kann. Kann"}, {"id": 853, "start": 7953.0, "end": 7963.84, "text": "wir irgendjemand hosten? Wen haben wir hier am Start? Irgendwie keiner da. Du folgst,"}, {"id": 854, "start": 7963.84, "end": 7983.36, "text": "den folge ich denn. Keiner so wirklich am Start. Na gut Leute, bis denn, machts gut,"}, {"id": 855, "start": 7983.36, "end": 7994.8, "text": "wir sehen uns, legt die Tage, CU!"}, {"id": 856, "start": 8043.36, "end": 8058.8, "text": "Wir sehen uns, legt die Tage, CU!"}, {"id": 857, "start": 8058.8, "end": 8074.24, "text": "Wir sehen uns, legt die Tage, CU!"}, {"id": 858, "start": 8074.24, "end": 8089.68, "text": "Wir sehen uns, legt die Tage, CU!"}, {"id": 859, "start": 8089.68, "end": 8105.12, "text": "Wir sehen uns, legt die Tage, CU!"}]}