{"text": "Spel das, now we're older, everyone's moved on But I remember Twitch chat from those days that are gone Twitch emotes from long ago made you feel You're not alone, KappaPogChamp Keep a forehead, BibleThumb, Twitch emotes I remember typing Dan's game ForeheadSwiftRage, PJSalt and FailFish Life was easy, spamming all the time TOS was nowhere, so everyone's feeling fine Twitch emotes from long ago made you feel You're not alone, KappaPogChamp Keep a forehead, BibleThumb, Twitch emotes Still hear his bark in the morning hour he calls me His doggy emote reminds me of a time far away Looking at a chat I get a feeling that I miss emotes from yesterday Yesterday Twitch emotes from long ago made you feel You're not alone, PogChamp, KappaPog, BibleThumb, Twitch emotes You're not alone, PogChamp, KappaPog, BibleThumb, Twitch emotes Cake, oder? Egal, das ist jetzt relativ spontan, weil ich hab grad gesehen Ja, genug Twitch emotes Ähm, ich hab grad gesehen, dass es eine neue Proxmox Version gibt Warum kein Subbutton, ja weil Twitch sich noch nicht darum gekümmert hat Ich glaube Twitch hat besseres zu tun, als den ganzen Tag darauf zu warten, dass der Max endlich seine Bewerbung abschickt Das wird jetzt ein bisschen kompliziert, was ich jetzt vor hab, wartet mal Das wird jetzt ein bisschen kompliziert, weil Also wir gucken uns erstmal an, was es hier Neues gibt Ich hab mir noch gar nichts großartig dazu eingeguckt Und das letzte Mal, wo ich Proxmox installiert hab, ist irgendwie schon drei Versionen her oder so Ah, jetzt muss ich die Musik ein bisschen leiser machen Ha, ich glaube Rocket schreibt auch einfach alle Leute an, die sie in ihrer E-Mail-Liste drin haben Ich frag gerade, ob ich sie nicht an Stand 2.1 in der Gamescom besuchen will Wann, wann war ich das letztes Mal auf der Gamescom? Und ich find so geil, wie die alle die E-Mail in der Gamescom besuchen wollen Und ich find so geil, wie die alle die E-Mail in der Gamescom besuchen wollen Und ich find so geil, wie die alle die E-Mail immer schreiben, also jetzt nicht Rocket in dem Fall Sondern auch diese ganzen anderen Promotion Dudes Hey Max, how it's going? So als würde ich den Typ kennen Und vor allem als würde der mich kennen Kennt er uns überhaupt nicht Außerdem, warum schreibt man jemand, der zwei Videos im Jahr hochlädt? Die Abos kriegt dafür, oder keine Abos kriegt dafür, weil er nichts hochlädt Und für den sich eh keiner, warum schreibt er mir überhaupt? Also ich würd das nicht machen an der näheren Stelle Ich würd mir denken, ey, der Max da, warum soll ich den mal schreiben? Egal, es wird ein bisschen komplizierter was wir heute vorhaben Und zwar Wieso sollte man zur Gamescom gehen? Weil man gerne in Schlangen steht vielleicht Könnt ich mir vorstellen Also Knäherbär, die Bewerbung ist raus Und sobald es da ist, kannst du deine 5 Euro loswerden Also Gamescom hat echt keinen Sinn Gamescom lohnt sich nur, wenn man gerne in Schlangen steht Also wir machen mal noch schnell einen Tweet So, Tweet ist raus So jetzt kann ich zum eigentlichen Punkt kommen Was ich eigentlich machen will Und da müssen wir uns glaube ich auch ein bisschen beeilen Weil es ist 18.20 wie gesagt Ich muss um 22 Uhr spätestens pennen, da ich morgen wieder aufstehen kann Und weil ich hab gesehen, es kam eine neue Proxmox Version raus Es ist schon 2-3 Versionen her, also schon eine ganze Weile Wo ich das zuletzt ausprobiert habe Und das hat mich nicht überzeugt Das ist ein Open Source Konkurrent für ESX Allerdings setzen die den Fokus nicht jetzt unbedingt auf Enterprise, HA Das hat sich für mich bisher nicht so ausgesehen Sondern eher auf lokale, kleinere Installationen Dafür haben sie ein paar Sachen dabei, die für alle, die daheim was hausten wollen, ganz praktisch sind Das letzte Mal, wo ich mir das angeguckt habe, war das wirklich nice Ich zeige euch mal das Web Interface Wenn man jetzt keinen eigenen Linux Server installieren wollte für VMs Oder wenn man ESX nicht wollte Oder wenn man kein Hyper-V wollte Oder eben kein KVM von HANA administrieren wollte Dann hat man hier ein schönes Web Interface gekriegt bei Proxmox Sieht dann ungefähr so aus, da kann man hier seine unterschiedlichen VMs anlegen Es erinnert entfernt an das ESX Web Interface Allerdings viel mehr schwarz-weiß, VM wäre gerne blau und ein bisschen bunter Er ist mit diesem Datacenter hier und so entfernt an das ESX Web Interface Das ist alles nicht die neue Oberfläche So ungefähr sieht das auf dem ESX aus Und das ist halt komplett kostenlos Auf Linux Basis bietet KVM und LXC als Virtualisierungstechnik Heißt ESX-E jetzt nicht VSphere? Nee, ESX heißt immer noch ESX Ich dachte generell, dass VSphere eigentlich eher das Management-Gedürz drumherum ist Und ESX der Hypervisor Aber ich bin jetzt nicht so der VM-Ware-Experte, was das angeht So und ich habe mir gedacht, nachdem heute die neue Version erschienen ist, vor ein paar Stunden, das ist noch gar nicht so lange her Probieren wir das Ganze heute einfach mal aus Genau, ZFS-Encryption ist dabei Wir gucken uns gleich mal so kurz an, was sich getan hat Und danach wird es ein bisschen komplizierter und ich hoffe, das wird funktionieren, weil ich muss das ja irgendwie hier anschließen Ich hätte die Auswahl Ich könnte übrigens Leute, ich muss mein Pepega-Bot noch starten, sonst sehe ich eure Fragen nicht Der Max hat nämlich auch vorhin gefragt, welchen Mikrotik-Router würdest du empfehlen für Heimnetzwerk? Mit relativ vielen Ports Schreibt mir das gleich nochmal, wenn ich mein Board geschrieben habe Wenn ich mein Board gestartet habe, dass ich nicht vergesse Da muss ich nämlich nachher ein bisschen mehr zu sagen Was heute ein bisschen kompliziert wird, ist, ich hätte jetzt die Auswahl, man könnte jetzt beispielsweise Rocksmox hier in VM-Ware testen Aber Virtualisierung in Virtualisierung testen ist nicht so die allerbeste Idee Ich meine, für einen Chrom-Überblick über das Webinterface und so würde das funktionieren Nested-Virtualisierung funktioniert mittlerweile eigentlich ganz gut Aber so wirklich schön ist das glaube ich nur, wenn wir auch die neuen Features testen können Und das können wir auch auf Hardware-Geschalt testen Deswegen habe ich mir einen Board rausgesucht, einen Dual-Core-Atom Celeron, nein Pentium-Silver heißen die Dinger jetzt Habe ich mir noch einen Board rausgesucht Noch ein Netzteil rausgekramt Und hab einen, ich muss mal gucken wie viel RAM da drin ist, ich glaube 8G, 4G Ich guck mal kurz Leute, wie viel RAM ist da drin Zum Glück habe ich mittlerweile so viel sammelt Suri um Hardware Ich erkenne es nicht, wie groß ist der RAM-Riegel Ah, 8G, also wir haben 8GB RAM, einen Dual-Core, Pentium-Silber Und das war's Wir haben einen, ich zeige euch das Board mal, was das für ein Board ist Das ist so mein, eines der Boards, die ich mir damals geholt habe für mein NAS-Build Was noch übrig geblieben ist NGB, das Board hier ist das Also, das ist auch das was noch ein Parallel-Port in 2019 hat Wo man sich denkt, the fuck, was ist da los, warum hat es das Also wir haben einen PC-Express-Slot, den benutzen wir nicht Ich habe 8GB RAM drin Und hier haben wir einen M2-Slot Und in den M2-Slot werde ich jetzt mal zum Test eine Terabyte SSD machen Ich habe mir eine gekauft für meinen Rechner hier Und die habe ich aber noch nicht eingebaut, deswegen werden wir die jetzt zum Test testweise mal verwenden Für unsere Proxbox-Installation Und dann gucken wir mal ob das funktioniert Was ein bisschen schwierig werden wird ist Ich muss irgendwie von der Hardware-Kiste jetzt versuchen über die Elgato-Capture-Card Muss ich irgendwie versuchen euch das Build weiter zu leiten Da müssen wir mal gucken wie das Ganze funktioniert Fluxik, ich habe den letzten Monat fast jeden Tag gestrebt Aber es ist schön, dass du wieder am Start bist Genau, also wir gucken uns mal kurz an was die für neue Features haben bei Proxbox 6 Diese ganze ZEV-Geschichte kann ich nicht viel zu sagen Wir haben auf der Arbeit ein bisschen rumgespielt mit einem ZEV-Cluster Aber ich wüsste jetzt nicht wozu ich das daheim großartig verwenden würde Das ist ein verteiltes Storage-System Hast du dir die 10TB WD-RED für dein NAS bei Amazon gekauft? Du meinst die von gestern? Ja Die die jetzt aktuell in meinem NAS drin sind, sind das 10TB Seagate Einwolf Ich weiß, dass ich einfach eine Szene machen kann Ich muss aber mal gucken ob das hier alles funktioniert mit der Capture-Card So wie ich es angeschlossen habe Ich habe ja sogar schon eine extra Szene für Capture-Cards hier Aber wir müssen mal gucken wie das funktioniert Also wenn man sich die neuesten Features anguckt zu diesen ZEV-Geschichten kann ich nichts sagen Corosync 3 ist eigentlich ganz nett, das ist die Cluster Das ist ein Programm wo man Linux-Systeme mit Clustern kann ZFS-08, das ist tatsächlich 900 IQ ZFS-08 ist richtig big brain, da warte ich auch schon drauf Auf die nächste Ubuntu-Version die da standardmäßig mit dabei hat Also das ist nicht big brain, das ist schon richtig clever Die haben nämlich viele coole Sachen dabei Zum Beispiel haben sie endlich ihren Verschlüsselungs-Patch drin Damit kann man jetzt quasi mit ZFS direkt die Platten verschlüsseln Und braucht keinen Lux oder sowas mehr dazwischen Und das ganze funktioniert sogar mit SSDs, dass da Trim-Support, das Trim irgendwie durchgereicht wird Also das ist wirklich eine super tolle Geschichte Und das probieren wir heute mal aus, es supportet auch ZFS auf UEFI-Kisten und auf NVMe-Devices Das probieren wir nämlich aus, weil deswegen habe ich auch das Board rausgesucht Das ist eine NVMe-SSD, Anschlussmöglichkeit Und ich habe eine NVMe-SSD hier gerade da, das bietet sich heute einfach an zu testen Bevor ich das Ding in meinem Rechner baue Dann haben wir QEMO 4.0, das ist jetzt eher intern Wahrscheinlich hat man ein bisschen mehr Hardware zur Auswahl, die man virtualisieren kann Was haben wir sonst noch schönes? Ich habe auf Reddit vorher ein schönes Change-Log gelesen dazu, ehrlich gesagt Genau, es gibt eine neue LXC-Version, also sprich das Ding kann Voll-Virtualisierung und Container-Virtualisierung Und Gedöns, wir müssen es einfach mal ausprobieren Würdest du eher den 3700X oder den 3900X CPU nehmen? Für Game-Stream und Videos machen Der 3900X hat mehr Kerne, da würde ich den 3900X nehmen Vor allem wenn es um Games plus Streamen geht und du CPU encoden willst, dann sind mehr Kerne auf jeden Fall nicht verkehrt So, und jetzt müssen wir erstmal gucken wie wir das machen Als erstes müssen wir uns den Kram mal downloaden ISO-Installer, oh BitTorrent Da ist die Filesharing-Anzeige gleich raus Den besten Ruf hat es ja nicht, obwohl es ja eigentlich nur ein Übertragungs-Protokoll ist, was eigentlich an sich keinen schlechten Ruf haben dürfte Download, ISO, jawoll Ok, wo ist mein USB-Stick? Ich brauche meinen USB-Stick Moment, Moment, Stopp, Stopp Leute, warum lade ich den Mist überhaupt unter Windows runter, das ist ja ein kompletter Fail Da muss ich meinen Linux-VM runterladen, da kann ich das Zeug wenigstens gleich ordentlich flaschen Ich flasche auch USB-Sticks Mir fällt es immer schwer den korrekten, immer die korrekten Begriffe für zu nehmen, bei mir wird alles geflasht Mikro-SD-Karten, USB-Sticks, Festplatten wird alles geflasht Auch weil man Festplatten eigentlich überhaupt nicht flaschen kann Aber ich meine, wen juckt es? Ok, während der Kram downloadet und das Stream hoffentlich dabei nicht rumrockelt Muss ich mal kurz hier den USB-Stick crabben Komm her, USB-Stick, huge USB-Stick, da ist er Und bei Anschließen und dann flaschen wir das Ganze Und danach teste ich mal, ob der Mist funktioniert mit, ähm Mit Capture-Card und allem Werden wir gleich sehen Erstmal USB-Stick Ja, ich habe gedacht, bevor ich das jetzt irgendwie noch eine Stunde vorbereite, alles Und dann haben wir keine Zeit mehr, fangen wir einfach direkt mit dem Stream an und beeilen uns ein bisschen Also ran an die VM USB-Stick sollte erkannt worden sein, hoffe ich mal Äh Da ist der USB-Stick 16G wird reichen, denke ich mal, wie groß ist das ISO? 700, äh 742 MB Ok, ähm Etcher Heutzutage flasht man ja, braucht man ja eine komplette Elektronen und Heutzutage braucht man ja einen kompletten Browser, der in einem eigenen Fenster läuft, nur um eine Nur um einen USB-Stick zu flaschen Weil, weil es geht Ähm, Downloads Oxmox ISO Auf den USB-Stick, der irgendwie USB, ähm, Ubuntu Server heißt, aber ist ok, Flash Man kann es ja 50 Diskette nehmen, easy, nein, ZIP, ZIP Diskette nehme ich, ZIP Drive Da reichen dann nur 7 Stück Kann man inzwischen Oxmox ohne CD installieren? Ich hab keine Ahnung, ich hab ewig kein Oxmox mehr verwendet Es ist schon Ich sag mal Jahre her, wo ich das letzte Mal Oxmox verwendet habe Ich hab, ich hab bin eigentlich übelster Noob, was das angeht, also Wenn der Installer sackt, werden wir es wahrscheinlich nicht auf die Reihe kriegen Gucken wir mal, es wird schon, wird schon funktionieren Ähm, so, wenn das Ding geflasht ist, muss ich erst mal gucken, dass das mit der Capture-Card funktioniert Ich schlöpsel euch jetzt nämlich gleich einfach mal dran an das Board Und schalte um auf die Capture-Card und wir gucken, ob man was sieht Ja, ich installiere das auch, auch über USB, das wird auf jeden Fall funktionieren Verwendest du da eigentlich für eine VM-Software auf Windows? Für was meinst du jetzt? Ach so, was ich eigentlich für eine VM-Workstation Das ist eine VM-Workstation So, der USB-Stick ist geflasht Jetzt probiere ich das mal schnell mit der Capture-Card aus Ich stöpsel euch mal dran und wir gucken, ob was passiert Moment, ich muss das erst mal umschalten Scene 2, dann machen wir hier unseren Yo-Dog, machen wir weg Ähm, Browser-View machen wir weg, ich weiß, ihr seht gar nichts, Elgato ist an Und jetzt machen wir hier oben in die Ecke noch eine Display-Capture Die machen wir aber so dann Ähm, ach so, den Chat brauchen wir noch, oder? Q-Chat brauchen wir noch Q-Chat, ähm Da muss ich euch mal kurz ausmachen, dass ich den Chat darüber bringen kann Da muss man nämlich Secret-Wolves kopieren Und die will ich euch nicht zeigen Eats So, jetzt haben wir hier Chat, wie groß ist vielleicht der Chat? Jaja, Leaked, Jebaited wird hier höchstens Wie mach ich das jetzt kleiner? Moment, wir machen das Display-Capture nochmal aus, da seht ihr nichts Noch Browser-Capture an, jetzt machen wir 400x400 oder was man da so braucht Jetzt ist besser, oder? Wie groß ist denn der Chat bei dem anderen? Ja, das ist ungefähr genauso groß Das lassen wir so, oder? Wir machen vielleicht noch ein Stückchen weiter Thicc-Chat Und Display-Capture, so, jetzt haben wir es, perfekt, oder? Was ich hier leider nicht drinne habe, sind Donations und Gedöns Kannst du mal was mit Shell sortieren, please? Pipe-Sort Alternativ Pipe-Sort N, wenn es numerisch sein soll Es ist eigentlich Eats IF Du kannst einfach ein Beispiel reinposten, dann sag ich dir, wie es funktioniert Subscriptions, ja wie gesagt, meine Bewerbung ist raus So, jetzt schließe ich mal die Capture-Card an Dann hoffen wir das Scheiß funktioniert So Habe ich bei dem Elgato Ding jetzt irgendwas getan? Es sollte eigentlich So ein Elgato Ding angezeigt werden Probieren wir es mal so Da war bei mir der Ton Ok, wir schalten mal kurz um auf das hier Und wir probieren es mal hier mit Und gucken, ob das Board an sich funktioniert Ok, ähm Ja, ich mache mal das Board an, würde ich sagen, und dann gucken wir, was passiert Aja, ja Geht was? Passiert da was? Oh, oh, oh, fuck Ist das Netzteil laut Ist das Netzteil laut, das pumpt sich ja hier ein ab Ok, jetzt machen wir die Elgato Software zu und gucken, ob es im OBS funktioniert Ich entferne einfach mal das Elgato Ding hier nochmal drin Remove Game Capture Ne, ach Quatsch, nicht Game Capture Das Ding heißt nur Game Capture Video Capture Device ist es Ey Da guck an Da guck an, man erkennt was Pock Huge Pock Ok, wir müssen jetzt mal checken, ob die Auflösung irgendwie halbwegs passt Ähm, Resolution, wie macht man das? Gar nicht, das macht alles automatisch, hä? Handficker Video, HD, Input, blim, blim, blim HD Input Device PC Ok, wir probieren einfach mal aus, ob das funktioniert jetzt Also Leute, was, wollen wir mal hier, ne, wisst ihr was, es ist doch eigentlich viel besser, wenn wir das machen Und wir machen es mit der Game Capture HD Software, machen wir es Fullscreen, oder? Das ist doch wahrscheinlich viel besser Oh fuck, muss ich das erstmal da wieder löschen Profi Streamer Doch, ich glaube es ist besser, wenn wir das so lassen und machen die Game Capture hier auf Oh fuck Hab ich das jetzt geschrottet? Flip Ich hab ne Idee was wir machen Wir ziehen den USB-Stacker einfach nochmal raus Äh, macht das jetzt was? Ah ne, Connect to Host Ha, haha Ok, auf, mach hinne, Capture Card One moment please Warum ist das schwarz? Und warum kackt es ab? Ok Ich werd, ich werd die mal kurz hier aus OBS removeen Was hat das denn jetzt für Schmerzen, ey Äh Alter, was jetzt Ok, ich mach die, ich mach die Capture Card nochmal raus Weiß was, ein Akt, ey", "segments": [{"id": 1, "start": 0.0, "end": 8.64, "text": "Spel das, now we're older, everyone's moved on"}, {"id": 2, "start": 8.64, "end": 13.84, "text": "But I remember Twitch chat from those days that are gone"}, {"id": 3, "start": 13.84, "end": 22.32, "text": "Twitch emotes from long ago made you feel"}, {"id": 4, "start": 22.32, "end": 38.48, "text": "You're not alone, KappaPogChamp Keep a forehead, BibleThumb, Twitch emotes"}, {"id": 5, "start": 38.48, "end": 51.36, "text": "I remember typing Dan's game ForeheadSwiftRage, PJSalt and FailFish"}, {"id": 6, "start": 51.36, "end": 61.6, "text": "Life was easy, spamming all the time TOS was nowhere, so everyone's feeling fine"}, {"id": 7, "start": 61.6, "end": 70.08, "text": "Twitch emotes from long ago made you feel"}, {"id": 8, "start": 70.08, "end": 85.76, "text": "You're not alone, KappaPogChamp Keep a forehead, BibleThumb, Twitch emotes"}, {"id": 9, "start": 85.76, "end": 91.04, "text": "Still hear his bark in the morning hour he calls me"}, {"id": 10, "start": 91.04, "end": 104.96, "text": "His doggy emote reminds me of a time far away Looking at a chat I get a feeling that I miss emotes from yesterday"}, {"id": 11, "start": 104.96, "end": 116.32, "text": "Yesterday Twitch emotes from long ago made you feel"}, {"id": 12, "start": 116.32, "end": 131.04, "text": "You're not alone, PogChamp, KappaPog, BibleThumb, Twitch emotes"}, {"id": 13, "start": 131.04, "end": 147.04, "text": "You're not alone, PogChamp, KappaPog, BibleThumb, Twitch emotes"}, {"id": 14, "start": 161.68, "end": 162.64, "text": "Cake, oder?"}, {"id": 15, "start": 180.64, "end": 184.88, "text": "Egal, das ist jetzt relativ spontan, weil ich hab grad gesehen"}, {"id": 16, "start": 184.88, "end": 186.88, "text": "Ja, genug Twitch emotes"}, {"id": 17, "start": 186.88, "end": 194.96, "text": "Ähm, ich hab grad gesehen, dass es eine neue Proxmox Version gibt"}, {"id": 18, "start": 194.96, "end": 199.76, "text": "Warum kein Subbutton, ja weil Twitch sich noch nicht darum gekümmert hat"}, {"id": 19, "start": 199.76, "end": 212.72, "text": "Ich glaube Twitch hat besseres zu tun, als den ganzen Tag darauf zu warten, dass der Max endlich seine Bewerbung abschickt"}, {"id": 20, "start": 212.72, "end": 217.52, "text": "Das wird jetzt ein bisschen kompliziert, was ich jetzt vor hab, wartet mal"}, {"id": 21, "start": 217.52, "end": 224.72, "text": "Das wird jetzt ein bisschen kompliziert, weil"}, {"id": 22, "start": 224.72, "end": 226.72, "text": "Also wir gucken uns erstmal an, was es hier Neues gibt"}, {"id": 23, "start": 226.72, "end": 228.72, "text": "Ich hab mir noch gar nichts großartig dazu eingeguckt"}, {"id": 24, "start": 228.72, "end": 234.72, "text": "Und das letzte Mal, wo ich Proxmox installiert hab, ist irgendwie schon drei Versionen her oder so"}, {"id": 25, "start": 234.72, "end": 242.72, "text": "Ah, jetzt muss ich die Musik ein bisschen leiser machen"}, {"id": 26, "start": 242.72, "end": 252.72, "text": "Ha, ich glaube Rocket schreibt auch einfach alle Leute an, die sie in ihrer E-Mail-Liste drin haben"}, {"id": 27, "start": 252.72, "end": 258.72, "text": "Ich frag gerade, ob ich sie nicht an Stand 2.1 in der Gamescom besuchen will"}, {"id": 28, "start": 258.72, "end": 272.72, "text": "Wann, wann war ich das letztes Mal auf der Gamescom?"}, {"id": 29, "start": 272.72, "end": 276.72, "text": "Und ich find so geil, wie die alle die E-Mail in der Gamescom besuchen wollen"}, {"id": 30, "start": 276.72, "end": 280.72, "text": "Und ich find so geil, wie die alle die E-Mail in der Gamescom besuchen wollen"}, {"id": 31, "start": 280.72, "end": 290.72, "text": "Und ich find so geil, wie die alle die E-Mail immer schreiben, also jetzt nicht Rocket in dem Fall"}, {"id": 32, "start": 290.72, "end": 292.72, "text": "Sondern auch diese ganzen anderen Promotion Dudes"}, {"id": 33, "start": 292.72, "end": 294.72, "text": "Hey Max, how it's going?"}, {"id": 34, "start": 294.72, "end": 296.72, "text": "So als würde ich den Typ kennen"}, {"id": 35, "start": 296.72, "end": 298.72, "text": "Und vor allem als würde der mich kennen"}, {"id": 36, "start": 298.72, "end": 300.72, "text": "Kennt er uns überhaupt nicht"}, {"id": 37, "start": 300.72, "end": 306.72, "text": "Außerdem, warum schreibt man jemand, der zwei Videos im Jahr hochlädt?"}, {"id": 38, "start": 306.72, "end": 312.72, "text": "Die Abos kriegt dafür, oder keine Abos kriegt dafür, weil er nichts hochlädt"}, {"id": 39, "start": 312.72, "end": 318.72, "text": "Und für den sich eh keiner, warum schreibt er mir überhaupt?"}, {"id": 40, "start": 318.72, "end": 322.72, "text": "Also ich würd das nicht machen an der näheren Stelle"}, {"id": 41, "start": 322.72, "end": 330.72, "text": "Ich würd mir denken, ey, der Max da, warum soll ich den mal schreiben?"}, {"id": 42, "start": 330.72, "end": 334.72, "text": "Egal, es wird ein bisschen komplizierter was wir heute vorhaben"}, {"id": 43, "start": 334.72, "end": 336.72, "text": "Und zwar"}, {"id": 44, "start": 336.72, "end": 338.72, "text": "Wieso sollte man zur Gamescom gehen?"}, {"id": 45, "start": 338.72, "end": 340.72, "text": "Weil man gerne in Schlangen steht vielleicht"}, {"id": 46, "start": 340.72, "end": 342.72, "text": "Könnt ich mir vorstellen"}, {"id": 47, "start": 342.72, "end": 350.72, "text": "Also Knäherbär, die Bewerbung ist raus"}, {"id": 48, "start": 350.72, "end": 360.72, "text": "Und sobald es da ist, kannst du deine 5 Euro loswerden"}, {"id": 49, "start": 360.72, "end": 370.72, "text": "Also Gamescom hat echt keinen Sinn"}, {"id": 50, "start": 370.72, "end": 380.72, "text": "Gamescom lohnt sich nur, wenn man gerne in Schlangen steht"}, {"id": 51, "start": 380.72, "end": 390.72, "text": "Also wir machen mal noch schnell einen Tweet"}, {"id": 52, "start": 410.72, "end": 424.72, "text": "So, Tweet ist raus"}, {"id": 53, "start": 424.72, "end": 426.72, "text": "So jetzt kann ich zum eigentlichen Punkt kommen"}, {"id": 54, "start": 426.72, "end": 430.72, "text": "Was ich eigentlich machen will"}, {"id": 55, "start": 430.72, "end": 432.72, "text": "Und da müssen wir uns glaube ich auch ein bisschen beeilen"}, {"id": 56, "start": 432.72, "end": 434.72, "text": "Weil es ist 18.20 wie gesagt"}, {"id": 57, "start": 434.72, "end": 438.72, "text": "Ich muss um 22 Uhr spätestens pennen, da ich morgen wieder aufstehen kann"}, {"id": 58, "start": 438.72, "end": 440.72, "text": "Und weil ich hab gesehen, es kam eine neue Proxmox Version raus"}, {"id": 59, "start": 440.72, "end": 444.72, "text": "Es ist schon 2-3 Versionen her, also schon eine ganze Weile"}, {"id": 60, "start": 444.72, "end": 446.72, "text": "Wo ich das zuletzt ausprobiert habe"}, {"id": 61, "start": 446.72, "end": 448.72, "text": "Und das hat mich nicht überzeugt"}, {"id": 62, "start": 448.72, "end": 458.72, "text": "Das ist ein Open Source Konkurrent für ESX"}, {"id": 63, "start": 458.72, "end": 464.72, "text": "Allerdings setzen die den Fokus nicht jetzt unbedingt auf Enterprise, HA"}, {"id": 64, "start": 464.72, "end": 470.72, "text": "Das hat sich für mich bisher nicht so ausgesehen"}, {"id": 65, "start": 470.72, "end": 474.72, "text": "Sondern eher auf lokale, kleinere Installationen"}, {"id": 66, "start": 474.72, "end": 478.72, "text": "Dafür haben sie ein paar Sachen dabei, die für alle, die daheim was hausten wollen, ganz praktisch sind"}, {"id": 67, "start": 478.72, "end": 482.72, "text": "Das letzte Mal, wo ich mir das angeguckt habe, war das wirklich nice"}, {"id": 68, "start": 482.72, "end": 484.72, "text": "Ich zeige euch mal das Web Interface"}, {"id": 69, "start": 484.72, "end": 490.72, "text": "Wenn man jetzt keinen eigenen Linux Server installieren wollte für VMs"}, {"id": 70, "start": 490.72, "end": 492.72, "text": "Oder wenn man ESX nicht wollte"}, {"id": 71, "start": 492.72, "end": 494.72, "text": "Oder wenn man kein Hyper-V wollte"}, {"id": 72, "start": 494.72, "end": 498.72, "text": "Oder eben kein KVM von HANA administrieren wollte"}, {"id": 73, "start": 498.72, "end": 502.72, "text": "Dann hat man hier ein schönes Web Interface gekriegt bei Proxmox"}, {"id": 74, "start": 502.72, "end": 508.72, "text": "Sieht dann ungefähr so aus, da kann man hier seine unterschiedlichen VMs anlegen"}, {"id": 75, "start": 508.72, "end": 516.72, "text": "Es erinnert entfernt an das ESX Web Interface"}, {"id": 76, "start": 516.72, "end": 522.72, "text": "Allerdings viel mehr schwarz-weiß, VM wäre gerne blau und ein bisschen bunter"}, {"id": 77, "start": 522.72, "end": 532.72, "text": "Er ist mit diesem Datacenter hier und so entfernt an das ESX Web Interface"}, {"id": 78, "start": 532.72, "end": 538.72, "text": "Das ist alles nicht die neue Oberfläche"}, {"id": 79, "start": 538.72, "end": 542.72, "text": "So ungefähr sieht das auf dem ESX aus"}, {"id": 80, "start": 542.72, "end": 546.72, "text": "Und das ist halt komplett kostenlos"}, {"id": 81, "start": 546.72, "end": 556.72, "text": "Auf Linux Basis bietet KVM und LXC als Virtualisierungstechnik"}, {"id": 82, "start": 556.72, "end": 560.72, "text": "Heißt ESX-E jetzt nicht VSphere?"}, {"id": 83, "start": 560.72, "end": 562.72, "text": "Nee, ESX heißt immer noch ESX"}, {"id": 84, "start": 562.72, "end": 566.72, "text": "Ich dachte generell, dass VSphere eigentlich eher das Management-Gedürz drumherum ist"}, {"id": 85, "start": 566.72, "end": 568.72, "text": "Und ESX der Hypervisor"}, {"id": 86, "start": 568.72, "end": 574.72, "text": "Aber ich bin jetzt nicht so der VM-Ware-Experte, was das angeht"}, {"id": 87, "start": 574.72, "end": 582.72, "text": "So und ich habe mir gedacht, nachdem heute die neue Version erschienen ist, vor ein paar Stunden, das ist noch gar nicht so lange her"}, {"id": 88, "start": 582.72, "end": 584.72, "text": "Probieren wir das Ganze heute einfach mal aus"}, {"id": 89, "start": 584.72, "end": 586.72, "text": "Genau, ZFS-Encryption ist dabei"}, {"id": 90, "start": 586.72, "end": 590.72, "text": "Wir gucken uns gleich mal so kurz an, was sich getan hat"}, {"id": 91, "start": 590.72, "end": 596.72, "text": "Und danach wird es ein bisschen komplizierter und ich hoffe, das wird funktionieren, weil ich muss das ja irgendwie hier anschließen"}, {"id": 92, "start": 596.72, "end": 598.72, "text": "Ich hätte die Auswahl"}, {"id": 93, "start": 598.72, "end": 602.72, "text": "Ich könnte übrigens Leute, ich muss mein Pepega-Bot noch starten, sonst sehe ich eure Fragen nicht"}, {"id": 94, "start": 602.72, "end": 610.72, "text": "Der Max hat nämlich auch vorhin gefragt, welchen Mikrotik-Router würdest du empfehlen für Heimnetzwerk?"}, {"id": 95, "start": 610.72, "end": 612.72, "text": "Mit relativ vielen Ports"}, {"id": 96, "start": 612.72, "end": 616.72, "text": "Schreibt mir das gleich nochmal, wenn ich mein Board geschrieben habe"}, {"id": 97, "start": 616.72, "end": 622.72, "text": "Wenn ich mein Board gestartet habe, dass ich nicht vergesse"}, {"id": 98, "start": 622.72, "end": 626.72, "text": "Da muss ich nämlich nachher ein bisschen mehr zu sagen"}, {"id": 99, "start": 626.72, "end": 634.72, "text": "Was heute ein bisschen kompliziert wird, ist, ich hätte jetzt die Auswahl, man könnte jetzt beispielsweise Rocksmox hier in VM-Ware testen"}, {"id": 100, "start": 634.72, "end": 640.72, "text": "Aber Virtualisierung in Virtualisierung testen ist nicht so die allerbeste Idee"}, {"id": 101, "start": 640.72, "end": 645.72, "text": "Ich meine, für einen Chrom-Überblick über das Webinterface und so würde das funktionieren"}, {"id": 102, "start": 645.72, "end": 648.72, "text": "Nested-Virtualisierung funktioniert mittlerweile eigentlich ganz gut"}, {"id": 103, "start": 648.72, "end": 652.72, "text": "Aber so wirklich schön ist das glaube ich nur, wenn wir auch die neuen Features testen können"}, {"id": 104, "start": 652.72, "end": 654.72, "text": "Und das können wir auch auf Hardware-Geschalt testen"}, {"id": 105, "start": 654.72, "end": 660.72, "text": "Deswegen habe ich mir einen Board rausgesucht, einen Dual-Core-Atom"}, {"id": 106, "start": 660.72, "end": 663.72, "text": "Celeron, nein Pentium-Silver heißen die Dinger jetzt"}, {"id": 107, "start": 663.72, "end": 665.72, "text": "Habe ich mir noch einen Board rausgesucht"}, {"id": 108, "start": 665.72, "end": 667.72, "text": "Noch ein Netzteil rausgekramt"}, {"id": 109, "start": 667.72, "end": 671.72, "text": "Und hab einen, ich muss mal gucken wie viel RAM da drin ist, ich glaube 8G, 4G"}, {"id": 110, "start": 671.72, "end": 674.72, "text": "Ich guck mal kurz Leute, wie viel RAM ist da drin"}, {"id": 111, "start": 674.72, "end": 680.72, "text": "Zum Glück habe ich mittlerweile so viel sammelt Suri um Hardware"}, {"id": 112, "start": 680.72, "end": 685.72, "text": "Ich erkenne es nicht, wie groß ist der RAM-Riegel"}, {"id": 113, "start": 685.72, "end": 694.72, "text": "Ah, 8G, also wir haben 8GB RAM, einen Dual-Core, Pentium-Silber"}, {"id": 114, "start": 694.72, "end": 701.72, "text": "Und das war's"}, {"id": 115, "start": 701.72, "end": 706.72, "text": "Wir haben einen, ich zeige euch das Board mal, was das für ein Board ist"}, {"id": 116, "start": 706.72, "end": 719.72, "text": "Das ist so mein, eines der Boards, die ich mir damals geholt habe für mein NAS-Build"}, {"id": 117, "start": 719.72, "end": 721.72, "text": "Was noch übrig geblieben ist"}, {"id": 118, "start": 721.72, "end": 732.72, "text": "NGB, das Board hier ist das"}, {"id": 119, "start": 732.72, "end": 737.72, "text": "Also, das ist auch das was noch ein Parallel-Port in 2019 hat"}, {"id": 120, "start": 737.72, "end": 741.72, "text": "Wo man sich denkt, the fuck, was ist da los, warum hat es das"}, {"id": 121, "start": 741.72, "end": 744.72, "text": "Also wir haben einen PC-Express-Slot, den benutzen wir nicht"}, {"id": 122, "start": 744.72, "end": 746.72, "text": "Ich habe 8GB RAM drin"}, {"id": 123, "start": 746.72, "end": 752.72, "text": "Und hier haben wir einen M2-Slot"}, {"id": 124, "start": 752.72, "end": 757.72, "text": "Und in den M2-Slot werde ich jetzt mal zum Test eine Terabyte SSD machen"}, {"id": 125, "start": 757.72, "end": 760.72, "text": "Ich habe mir eine gekauft für meinen Rechner hier"}, {"id": 126, "start": 760.72, "end": 764.72, "text": "Und die habe ich aber noch nicht eingebaut, deswegen werden wir die jetzt zum Test testweise mal verwenden"}, {"id": 127, "start": 764.72, "end": 766.72, "text": "Für unsere Proxbox-Installation"}, {"id": 128, "start": 766.72, "end": 768.72, "text": "Und dann gucken wir mal ob das funktioniert"}, {"id": 129, "start": 768.72, "end": 770.72, "text": "Was ein bisschen schwierig werden wird ist"}, {"id": 130, "start": 770.72, "end": 780.72, "text": "Ich muss irgendwie von der Hardware-Kiste jetzt versuchen über die Elgato-Capture-Card"}, {"id": 131, "start": 780.72, "end": 786.72, "text": "Muss ich irgendwie versuchen euch das Build weiter zu leiten"}, {"id": 132, "start": 786.72, "end": 788.72, "text": "Da müssen wir mal gucken wie das Ganze funktioniert"}, {"id": 133, "start": 788.72, "end": 792.72, "text": "Fluxik, ich habe den letzten Monat fast jeden Tag gestrebt"}, {"id": 134, "start": 792.72, "end": 794.72, "text": "Aber es ist schön, dass du wieder am Start bist"}, {"id": 135, "start": 794.72, "end": 801.72, "text": "Genau, also wir gucken uns mal kurz an was die für neue Features haben bei Proxbox 6"}, {"id": 136, "start": 801.72, "end": 806.72, "text": "Diese ganze ZEV-Geschichte kann ich nicht viel zu sagen"}, {"id": 137, "start": 806.72, "end": 810.72, "text": "Wir haben auf der Arbeit ein bisschen rumgespielt mit einem ZEV-Cluster"}, {"id": 138, "start": 810.72, "end": 816.72, "text": "Aber ich wüsste jetzt nicht wozu ich das daheim großartig verwenden würde"}, {"id": 139, "start": 816.72, "end": 819.72, "text": "Das ist ein verteiltes Storage-System"}, {"id": 140, "start": 819.72, "end": 824.72, "text": "Hast du dir die 10TB WD-RED für dein NAS bei Amazon gekauft?"}, {"id": 141, "start": 824.72, "end": 827.72, "text": "Du meinst die von gestern? Ja"}, {"id": 142, "start": 827.72, "end": 833.72, "text": "Die die jetzt aktuell in meinem NAS drin sind, sind das 10TB Seagate Einwolf"}, {"id": 143, "start": 833.72, "end": 836.72, "text": "Ich weiß, dass ich einfach eine Szene machen kann"}, {"id": 144, "start": 836.72, "end": 839.72, "text": "Ich muss aber mal gucken ob das hier alles funktioniert mit der Capture-Card"}, {"id": 145, "start": 839.72, "end": 841.72, "text": "So wie ich es angeschlossen habe"}, {"id": 146, "start": 841.72, "end": 844.72, "text": "Ich habe ja sogar schon eine extra Szene für Capture-Cards hier"}, {"id": 147, "start": 844.72, "end": 847.72, "text": "Aber wir müssen mal gucken wie das funktioniert"}, {"id": 148, "start": 847.72, "end": 851.72, "text": "Also wenn man sich die neuesten Features anguckt zu diesen ZEV-Geschichten kann ich nichts sagen"}, {"id": 149, "start": 851.72, "end": 854.72, "text": "Corosync 3 ist eigentlich ganz nett, das ist die Cluster"}, {"id": 150, "start": 854.72, "end": 860.72, "text": "Das ist ein Programm wo man Linux-Systeme mit Clustern kann"}, {"id": 151, "start": 860.72, "end": 865.72, "text": "ZFS-08, das ist tatsächlich 900 IQ"}, {"id": 152, "start": 865.72, "end": 869.72, "text": "ZFS-08 ist richtig big brain, da warte ich auch schon drauf"}, {"id": 153, "start": 869.72, "end": 872.72, "text": "Auf die nächste Ubuntu-Version die da standardmäßig mit dabei hat"}, {"id": 154, "start": 872.72, "end": 875.72, "text": "Also das ist nicht big brain, das ist schon richtig clever"}, {"id": 155, "start": 875.72, "end": 877.72, "text": "Die haben nämlich viele coole Sachen dabei"}, {"id": 156, "start": 877.72, "end": 881.72, "text": "Zum Beispiel haben sie endlich ihren Verschlüsselungs-Patch drin"}, {"id": 157, "start": 881.72, "end": 885.72, "text": "Damit kann man jetzt quasi mit ZFS direkt die Platten verschlüsseln"}, {"id": 158, "start": 885.72, "end": 888.72, "text": "Und braucht keinen Lux oder sowas mehr dazwischen"}, {"id": 159, "start": 888.72, "end": 895.72, "text": "Und das ganze funktioniert sogar mit SSDs, dass da Trim-Support, das Trim irgendwie durchgereicht wird"}, {"id": 160, "start": 895.72, "end": 899.72, "text": "Also das ist wirklich eine super tolle Geschichte"}, {"id": 161, "start": 899.72, "end": 910.72, "text": "Und das probieren wir heute mal aus, es supportet auch ZFS auf UEFI-Kisten und auf NVMe-Devices"}, {"id": 162, "start": 910.72, "end": 915.72, "text": "Das probieren wir nämlich aus, weil deswegen habe ich auch das Board rausgesucht"}, {"id": 163, "start": 915.72, "end": 918.72, "text": "Das ist eine NVMe-SSD, Anschlussmöglichkeit"}, {"id": 164, "start": 918.72, "end": 923.72, "text": "Und ich habe eine NVMe-SSD hier gerade da, das bietet sich heute einfach an zu testen"}, {"id": 165, "start": 923.72, "end": 926.72, "text": "Bevor ich das Ding in meinem Rechner baue"}, {"id": 166, "start": 926.72, "end": 929.72, "text": "Dann haben wir QEMO 4.0, das ist jetzt eher intern"}, {"id": 167, "start": 929.72, "end": 935.72, "text": "Wahrscheinlich hat man ein bisschen mehr Hardware zur Auswahl, die man virtualisieren kann"}, {"id": 168, "start": 935.72, "end": 944.72, "text": "Was haben wir sonst noch schönes?"}, {"id": 169, "start": 944.72, "end": 954.72, "text": "Ich habe auf Reddit vorher ein schönes Change-Log gelesen dazu, ehrlich gesagt"}, {"id": 170, "start": 954.72, "end": 964.72, "text": "Genau, es gibt eine neue LXC-Version, also sprich das Ding kann Voll-Virtualisierung und Container-Virtualisierung"}, {"id": 171, "start": 964.72, "end": 969.72, "text": "Und Gedöns, wir müssen es einfach mal ausprobieren"}, {"id": 172, "start": 969.72, "end": 975.72, "text": "Würdest du eher den 3700X oder den 3900X CPU nehmen?"}, {"id": 173, "start": 975.72, "end": 981.72, "text": "Für Game-Stream und Videos machen"}, {"id": 174, "start": 981.72, "end": 986.72, "text": "Der 3900X hat mehr Kerne, da würde ich den 3900X nehmen"}, {"id": 175, "start": 986.72, "end": 999.72, "text": "Vor allem wenn es um Games plus Streamen geht und du CPU encoden willst, dann sind mehr Kerne auf jeden Fall nicht verkehrt"}, {"id": 176, "start": 999.72, "end": 1001.72, "text": "So, und jetzt müssen wir erstmal gucken wie wir das machen"}, {"id": 177, "start": 1001.72, "end": 1006.72, "text": "Als erstes müssen wir uns den Kram mal downloaden"}, {"id": 178, "start": 1006.72, "end": 1011.72, "text": "ISO-Installer, oh BitTorrent"}, {"id": 179, "start": 1011.72, "end": 1019.72, "text": "Da ist die Filesharing-Anzeige gleich raus"}, {"id": 180, "start": 1019.72, "end": 1029.72, "text": "Den besten Ruf hat es ja nicht, obwohl es ja eigentlich nur ein Übertragungs-Protokoll ist, was eigentlich an sich keinen schlechten Ruf haben dürfte"}, {"id": 181, "start": 1029.72, "end": 1032.72, "text": "Download, ISO, jawoll"}, {"id": 182, "start": 1032.72, "end": 1037.72, "text": "Ok, wo ist mein USB-Stick? Ich brauche meinen USB-Stick"}, {"id": 183, "start": 1037.72, "end": 1043.72, "text": "Moment, Moment, Stopp, Stopp Leute, warum lade ich den Mist überhaupt unter Windows runter, das ist ja ein kompletter Fail"}, {"id": 184, "start": 1043.72, "end": 1049.72, "text": "Da muss ich meinen Linux-VM runterladen, da kann ich das Zeug wenigstens gleich ordentlich flaschen"}, {"id": 185, "start": 1049.72, "end": 1054.72, "text": "Ich flasche auch USB-Sticks"}, {"id": 186, "start": 1054.72, "end": 1060.72, "text": "Mir fällt es immer schwer den korrekten, immer die korrekten Begriffe für zu nehmen, bei mir wird alles geflasht"}, {"id": 187, "start": 1060.72, "end": 1065.72, "text": "Mikro-SD-Karten, USB-Sticks, Festplatten wird alles geflasht"}, {"id": 188, "start": 1065.72, "end": 1069.72, "text": "Auch weil man Festplatten eigentlich überhaupt nicht flaschen kann"}, {"id": 189, "start": 1069.72, "end": 1074.72, "text": "Aber ich meine, wen juckt es?"}, {"id": 190, "start": 1074.72, "end": 1079.72, "text": "Ok, während der Kram downloadet und das Stream hoffentlich dabei nicht rumrockelt"}, {"id": 191, "start": 1079.72, "end": 1083.72, "text": "Muss ich mal kurz hier den USB-Stick crabben"}, {"id": 192, "start": 1083.72, "end": 1088.72, "text": "Komm her, USB-Stick, huge USB-Stick, da ist er"}, {"id": 193, "start": 1088.72, "end": 1091.72, "text": "Und bei Anschließen und dann flaschen wir das Ganze"}, {"id": 194, "start": 1091.72, "end": 1098.72, "text": "Und danach teste ich mal, ob der Mist funktioniert mit, ähm"}, {"id": 195, "start": 1098.72, "end": 1101.72, "text": "Mit Capture-Card und allem"}, {"id": 196, "start": 1101.72, "end": 1103.72, "text": "Werden wir gleich sehen"}, {"id": 197, "start": 1103.72, "end": 1105.72, "text": "Erstmal USB-Stick"}, {"id": 198, "start": 1105.72, "end": 1109.72, "text": "Ja, ich habe gedacht, bevor ich das jetzt irgendwie noch eine Stunde vorbereite, alles"}, {"id": 199, "start": 1109.72, "end": 1114.72, "text": "Und dann haben wir keine Zeit mehr, fangen wir einfach direkt mit dem Stream an und beeilen uns ein bisschen"}, {"id": 200, "start": 1114.72, "end": 1116.72, "text": "Also ran an die VM"}, {"id": 201, "start": 1116.72, "end": 1121.72, "text": "USB-Stick sollte erkannt worden sein, hoffe ich mal"}, {"id": 202, "start": 1121.72, "end": 1123.72, "text": "Äh"}, {"id": 203, "start": 1123.72, "end": 1125.72, "text": "Da ist der USB-Stick"}, {"id": 204, "start": 1125.72, "end": 1131.72, "text": "16G wird reichen, denke ich mal, wie groß ist das ISO?"}, {"id": 205, "start": 1131.72, "end": 1134.72, "text": "700, äh 742 MB"}, {"id": 206, "start": 1134.72, "end": 1138.72, "text": "Ok, ähm"}, {"id": 207, "start": 1138.72, "end": 1139.72, "text": "Etcher"}, {"id": 208, "start": 1139.72, "end": 1144.72, "text": "Heutzutage flasht man ja, braucht man ja eine komplette Elektronen und"}, {"id": 209, "start": 1144.72, "end": 1149.72, "text": "Heutzutage braucht man ja einen kompletten Browser, der in einem eigenen Fenster läuft, nur um eine"}, {"id": 210, "start": 1149.72, "end": 1152.72, "text": "Nur um einen USB-Stick zu flaschen"}, {"id": 211, "start": 1152.72, "end": 1157.72, "text": "Weil, weil es geht"}, {"id": 212, "start": 1157.72, "end": 1160.72, "text": "Ähm, Downloads"}, {"id": 213, "start": 1160.72, "end": 1163.72, "text": "Oxmox ISO"}, {"id": 214, "start": 1163.72, "end": 1171.72, "text": "Auf den USB-Stick, der irgendwie USB, ähm, Ubuntu Server heißt, aber ist ok, Flash"}, {"id": 215, "start": 1171.72, "end": 1176.72, "text": "Man kann es ja 50 Diskette nehmen, easy, nein, ZIP, ZIP Diskette nehme ich, ZIP Drive"}, {"id": 216, "start": 1176.72, "end": 1182.72, "text": "Da reichen dann nur 7 Stück"}, {"id": 217, "start": 1182.72, "end": 1185.72, "text": "Kann man inzwischen Oxmox ohne CD installieren?"}, {"id": 218, "start": 1185.72, "end": 1188.72, "text": "Ich hab keine Ahnung, ich hab ewig kein Oxmox mehr verwendet"}, {"id": 219, "start": 1188.72, "end": 1191.72, "text": "Es ist schon"}, {"id": 220, "start": 1191.72, "end": 1197.72, "text": "Ich sag mal Jahre her, wo ich das letzte Mal Oxmox verwendet habe"}, {"id": 221, "start": 1197.72, "end": 1200.72, "text": "Ich hab, ich hab bin eigentlich übelster Noob, was das angeht, also"}, {"id": 222, "start": 1200.72, "end": 1205.72, "text": "Wenn der Installer sackt, werden wir es wahrscheinlich nicht auf die Reihe kriegen"}, {"id": 223, "start": 1205.72, "end": 1208.72, "text": "Gucken wir mal, es wird schon, wird schon funktionieren"}, {"id": 224, "start": 1208.72, "end": 1212.72, "text": "Ähm, so, wenn das Ding geflasht ist, muss ich erst mal gucken, dass das mit der Capture-Card funktioniert"}, {"id": 225, "start": 1212.72, "end": 1216.72, "text": "Ich schlöpsel euch jetzt nämlich gleich einfach mal dran an das Board"}, {"id": 226, "start": 1216.72, "end": 1228.72, "text": "Und schalte um auf die Capture-Card und wir gucken, ob man was sieht"}, {"id": 227, "start": 1228.72, "end": 1233.72, "text": "Ja, ich installiere das auch, auch über USB, das wird auf jeden Fall funktionieren"}, {"id": 228, "start": 1233.72, "end": 1237.72, "text": "Verwendest du da eigentlich für eine VM-Software auf Windows?"}, {"id": 229, "start": 1237.72, "end": 1244.72, "text": "Für was meinst du jetzt?"}, {"id": 230, "start": 1244.72, "end": 1252.72, "text": "Ach so, was ich eigentlich für eine VM-Workstation"}, {"id": 231, "start": 1252.72, "end": 1256.72, "text": "Das ist eine VM-Workstation"}, {"id": 232, "start": 1256.72, "end": 1265.72, "text": "So, der USB-Stick ist geflasht"}, {"id": 233, "start": 1265.72, "end": 1267.72, "text": "Jetzt probiere ich das mal schnell mit der Capture-Card aus"}, {"id": 234, "start": 1267.72, "end": 1276.72, "text": "Ich stöpsel euch mal dran und wir gucken, ob was passiert"}, {"id": 235, "start": 1276.72, "end": 1280.72, "text": "Moment, ich muss das erst mal umschalten"}, {"id": 236, "start": 1280.72, "end": 1286.72, "text": "Scene 2, dann machen wir hier unseren Yo-Dog, machen wir weg"}, {"id": 237, "start": 1286.72, "end": 1291.72, "text": "Ähm, Browser-View machen wir weg, ich weiß, ihr seht gar nichts, Elgato ist an"}, {"id": 238, "start": 1291.72, "end": 1299.72, "text": "Und jetzt machen wir hier oben in die Ecke noch eine Display-Capture"}, {"id": 239, "start": 1299.72, "end": 1305.72, "text": "Die machen wir aber so dann"}, {"id": 240, "start": 1305.72, "end": 1311.72, "text": "Ähm, ach so, den Chat brauchen wir noch, oder?"}, {"id": 241, "start": 1311.72, "end": 1318.72, "text": "Q-Chat brauchen wir noch"}, {"id": 242, "start": 1318.72, "end": 1324.72, "text": "Q-Chat, ähm"}, {"id": 243, "start": 1324.72, "end": 1331.72, "text": "Da muss ich euch mal kurz ausmachen, dass ich den Chat darüber bringen kann"}, {"id": 244, "start": 1331.72, "end": 1336.72, "text": "Da muss man nämlich Secret-Wolves kopieren"}, {"id": 245, "start": 1336.72, "end": 1349.72, "text": "Und die will ich euch nicht zeigen"}, {"id": 246, "start": 1349.72, "end": 1352.72, "text": "Eats"}, {"id": 247, "start": 1352.72, "end": 1363.72, "text": "So, jetzt haben wir hier Chat, wie groß ist vielleicht der Chat?"}, {"id": 248, "start": 1363.72, "end": 1376.72, "text": "Jaja, Leaked, Jebaited wird hier höchstens"}, {"id": 249, "start": 1376.72, "end": 1382.72, "text": "Wie mach ich das jetzt kleiner?"}, {"id": 250, "start": 1382.72, "end": 1386.72, "text": "Moment, wir machen das Display-Capture nochmal aus, da seht ihr nichts"}, {"id": 251, "start": 1386.72, "end": 1393.72, "text": "Noch Browser-Capture an, jetzt machen wir 400x400 oder was man da so braucht"}, {"id": 252, "start": 1393.72, "end": 1396.72, "text": "Jetzt ist besser, oder?"}, {"id": 253, "start": 1396.72, "end": 1401.72, "text": "Wie groß ist denn der Chat bei dem anderen?"}, {"id": 254, "start": 1401.72, "end": 1407.72, "text": "Ja, das ist ungefähr genauso groß"}, {"id": 255, "start": 1407.72, "end": 1413.72, "text": "Das lassen wir so, oder? Wir machen vielleicht noch ein Stückchen weiter"}, {"id": 256, "start": 1413.72, "end": 1416.72, "text": "Thicc-Chat"}, {"id": 257, "start": 1416.72, "end": 1420.72, "text": "Und Display-Capture, so, jetzt haben wir es, perfekt, oder?"}, {"id": 258, "start": 1420.72, "end": 1430.72, "text": "Was ich hier leider nicht drinne habe, sind Donations und Gedöns"}, {"id": 259, "start": 1430.72, "end": 1433.72, "text": "Kannst du mal was mit Shell sortieren, please? Pipe-Sort"}, {"id": 260, "start": 1433.72, "end": 1436.72, "text": "Alternativ Pipe-Sort N, wenn es numerisch sein soll"}, {"id": 261, "start": 1436.72, "end": 1439.72, "text": "Es ist eigentlich Eats IF"}, {"id": 262, "start": 1439.72, "end": 1444.72, "text": "Du kannst einfach ein Beispiel reinposten, dann sag ich dir, wie es funktioniert"}, {"id": 263, "start": 1444.72, "end": 1447.72, "text": "Subscriptions, ja wie gesagt, meine Bewerbung ist raus"}, {"id": 264, "start": 1447.72, "end": 1451.72, "text": "So, jetzt schließe ich mal die Capture-Card an"}, {"id": 265, "start": 1451.72, "end": 1475.72, "text": "Dann hoffen wir das Scheiß funktioniert"}, {"id": 266, "start": 1481.72, "end": 1495.72, "text": "So"}, {"id": 267, "start": 1495.72, "end": 1500.72, "text": "Habe ich bei dem Elgato Ding jetzt irgendwas getan?"}, {"id": 268, "start": 1500.72, "end": 1510.72, "text": "Es sollte eigentlich"}, {"id": 269, "start": 1510.72, "end": 1520.72, "text": "So ein Elgato Ding angezeigt werden"}, {"id": 270, "start": 1520.72, "end": 1525.72, "text": "Probieren wir es mal so"}, {"id": 271, "start": 1525.72, "end": 1534.72, "text": "Da war bei mir der Ton"}, {"id": 272, "start": 1534.72, "end": 1537.72, "text": "Ok, wir schalten mal kurz um auf das hier"}, {"id": 273, "start": 1537.72, "end": 1540.72, "text": "Und wir probieren es mal hier mit"}, {"id": 274, "start": 1540.72, "end": 1547.72, "text": "Und gucken, ob das Board an sich funktioniert"}, {"id": 275, "start": 1547.72, "end": 1550.72, "text": "Ok, ähm"}, {"id": 276, "start": 1550.72, "end": 1564.72, "text": "Ja, ich mache mal das Board an, würde ich sagen, und dann gucken wir, was passiert"}, {"id": 277, "start": 1564.72, "end": 1592.72, "text": "Aja, ja"}, {"id": 278, "start": 1592.72, "end": 1597.72, "text": "Geht was?"}, {"id": 279, "start": 1597.72, "end": 1602.72, "text": "Passiert da was?"}, {"id": 280, "start": 1602.72, "end": 1619.72, "text": "Oh, oh, oh, fuck"}, {"id": 281, "start": 1619.72, "end": 1622.72, "text": "Ist das Netzteil laut"}, {"id": 282, "start": 1622.72, "end": 1625.72, "text": "Ist das Netzteil laut, das pumpt sich ja hier ein ab"}, {"id": 283, "start": 1625.72, "end": 1632.72, "text": "Ok, jetzt machen wir die Elgato Software zu und gucken, ob es im OBS funktioniert"}, {"id": 284, "start": 1632.72, "end": 1636.72, "text": "Ich entferne einfach mal das Elgato Ding hier nochmal drin"}, {"id": 285, "start": 1636.72, "end": 1639.72, "text": "Remove"}, {"id": 286, "start": 1639.72, "end": 1642.72, "text": "Game Capture"}, {"id": 287, "start": 1642.72, "end": 1644.72, "text": "Ne, ach Quatsch, nicht Game Capture"}, {"id": 288, "start": 1644.72, "end": 1649.72, "text": "Das Ding heißt nur Game Capture"}, {"id": 289, "start": 1649.72, "end": 1657.72, "text": "Video Capture Device ist es"}, {"id": 290, "start": 1657.72, "end": 1660.72, "text": "Ey"}, {"id": 291, "start": 1660.72, "end": 1673.72, "text": "Da guck an"}, {"id": 292, "start": 1673.72, "end": 1680.72, "text": "Da guck an, man erkennt was"}, {"id": 293, "start": 1680.72, "end": 1682.72, "text": "Pock"}, {"id": 294, "start": 1682.72, "end": 1684.72, "text": "Huge Pock"}, {"id": 295, "start": 1684.72, "end": 1692.72, "text": "Ok, wir müssen jetzt mal checken, ob die Auflösung irgendwie halbwegs passt"}, {"id": 296, "start": 1692.72, "end": 1696.72, "text": "Ähm, Resolution, wie macht man das? Gar nicht, das macht alles automatisch, hä?"}, {"id": 297, "start": 1696.72, "end": 1704.72, "text": "Handficker Video, HD, Input, blim, blim, blim"}, {"id": 298, "start": 1704.72, "end": 1707.72, "text": "HD"}, {"id": 299, "start": 1707.72, "end": 1710.72, "text": "Input Device"}, {"id": 300, "start": 1710.72, "end": 1712.72, "text": "PC"}, {"id": 301, "start": 1712.72, "end": 1723.72, "text": "Ok, wir probieren einfach mal aus, ob das funktioniert jetzt"}, {"id": 302, "start": 1723.72, "end": 1729.72, "text": "Also Leute, was, wollen wir mal hier, ne, wisst ihr was, es ist doch eigentlich viel besser, wenn wir das machen"}, {"id": 303, "start": 1729.72, "end": 1733.72, "text": "Und wir machen es mit der Game Capture HD Software, machen wir es Fullscreen, oder?"}, {"id": 304, "start": 1733.72, "end": 1736.72, "text": "Das ist doch wahrscheinlich viel besser"}, {"id": 305, "start": 1736.72, "end": 1748.72, "text": "Oh fuck, muss ich das erstmal da wieder löschen"}, {"id": 306, "start": 1748.72, "end": 1756.72, "text": "Profi Streamer"}, {"id": 307, "start": 1756.72, "end": 1762.72, "text": "Doch, ich glaube es ist besser, wenn wir das so lassen und machen die Game Capture hier auf"}, {"id": 308, "start": 1762.72, "end": 1765.72, "text": "Oh fuck"}, {"id": 309, "start": 1765.72, "end": 1769.72, "text": "Hab ich das jetzt geschrottet?"}, {"id": 310, "start": 1769.72, "end": 1789.72, "text": "Flip"}, {"id": 311, "start": 1789.72, "end": 1792.72, "text": "Ich hab ne Idee was wir machen"}, {"id": 312, "start": 1792.72, "end": 1820.72, "text": "Wir ziehen den USB-Stacker einfach nochmal raus"}, {"id": 313, "start": 1820.72, "end": 1827.72, "text": "Äh, macht das jetzt was? Ah ne, Connect to Host"}, {"id": 314, "start": 1827.72, "end": 1832.72, "text": "Ha, haha"}, {"id": 315, "start": 1832.72, "end": 1839.72, "text": "Ok, auf, mach hinne, Capture Card"}, {"id": 316, "start": 1839.72, "end": 1843.72, "text": "One moment please"}, {"id": 317, "start": 1843.72, "end": 1863.72, "text": "Warum ist das schwarz? Und warum kackt es ab?"}, {"id": 318, "start": 1863.72, "end": 1871.72, "text": "Ok"}, {"id": 319, "start": 1871.72, "end": 1880.72, "text": "Ich werd, ich werd die mal kurz hier aus OBS removeen"}, {"id": 320, "start": 1880.72, "end": 1884.72, "text": "Was hat das denn jetzt für Schmerzen, ey"}, {"id": 321, "start": 1884.72, "end": 1889.72, "text": "Äh"}, {"id": 322, "start": 1889.72, "end": 1895.72, "text": "Alter, was jetzt"}, {"id": 323, "start": 1895.72, "end": 1898.72, "text": "Ok, ich mach die, ich mach die Capture Card nochmal raus"}, {"id": 324, "start": 1898.72, "end": 1901.72, "text": "Weiß was, ein Akt, ey"}]}