{"text": "Hallo, schon jemand da? Oh, wisst ihr was ich sehe? Twitch ist wieder der Meinung, ich habe keine Qualitätsoptionen heute und heute sind es 720p, 60 fps, ich habe das Gefühl Twitch hat da irgendwas geändert, weil ich hatte früher immer, immer Quality Optionen und in letzter Zeit immer nur Source oder Auto, ich weiß nicht was da los ist. Ich hatte jetzt zwei Monate lang immer Quality Optionen, immer, aber jetzt nicht und ich weiß nicht warum ehrlich zu sein. Ich meine, habe ich zu hohe Bitrate? Ich kann nicht, ich habe nichts geändert. Ich wollte gerade sagen, ich habe zu hohe, ich kann nicht zu hohe Bitrate haben, ich habe nichts getan, hat sich, ne? Ich gucke mir das jetzt gerade mal an, Video Statistik anzeigen, ja exakt, so mal kann das sein, dass man das nicht mal angezeigt kriegt. Leute, kann, kriegt ihr noch, wenn ihr, wenn ihr euch die Video Statistik anzeigen lasst, ne, von meinem Video, kriegt ihr da noch angezeigt, wie viel Bitrate das ist, das steht bei mir jetzt gar nicht mehr drinnen. Warum, wo ist das hin? Show Video Stats, ja das zeigt, das zeigt bei mir nichts mehr an. Das zeigt, das zeigt bei mir, nein doch Playback Rate, Playback Rate, ah ja, ich musste mal richtig gucken, doch Playback Rate steht da, ich glaube Playback Rate ist, ist das? Ach auf Deutsch heißt das Speicherauslastung, ok, weil dann haben sie das einfach nur falsch übersetzt, weil wenn ich mir das auf Englisch im Browser angucke heißt das Playback Rate 6000 Kilobits, also das passt, das habe ich auch genau eingestellt. Das muss, oh ich muss mein Bot noch einstellen, mein Bot ist immer noch der Meinung, ich bin heute ziemlich im Arsch, das bin ich zwar auch, aber das, ach komm ich lasse den Text jetzt einfach drinnen stehen, scheiß drauf. Ich würde dir gerne ein Google Drive Link für Gameplay zukommen lassen, aber halt nicht öffentlich, also per DN oder so ähnlich, du kannst mir das per YouTube PM schicken oder per Business E-Mail oder per Twitch PM, keine Ahnung, am liebsten eigentlich per YouTube PM. So, dann würde ich mal sagen, nochmal den Text weg. Hallo Romanjo, wir spielen heute mal ein Puzzle Game, was ich schon immer mal spielen wollte, was ich seit 2000, ach ich weiß es nicht, 2000, Moment, man kann das doch in Steam nachgucken, seit wann ich das in der Bibliothek habe oder runtergeladen, ne sieht man nicht mehr. Keine Ahnung, gefühlt seit 8 Jahren oder so auf Steam hab, das Game kam raus 2008, ich hab das schon ewig auf Steam, ich wollte das schon immer mal spielen und ich hab es nie über den ersten 2-3 Levels raus geschafft, obwohl es nicht wirklich schwierig ist. Aber ich dachte mir, das ist ein wunderbares Game für Livestream, weil ich kann Chat lesen und wir können schwätzen. Obwohl es hat kein Zeitlimit oder sowas. Das ist ein super entspanntes Puzzle Game. Ich hau nicht, dass ich es zu laut hab, ne das passt so ne. Find den Button für YouTube PM nicht. Ich weiß mittlerweile gar nicht mehr wie das funktioniert. Ok, das erste sind ein paar Tutorial Levels, das ist das easy Mode. Jetzt kriegt natürlich jeder hin. Und ich hab es wie gesagt, ich hab nur die ersten paar Levels je gespielt, ich wollte das schon immer mal spielen. Das gilt ja so als eines der coolsten Puzzle Games überhaupt. Max, was hältst du eigentlich von den ganzen IT-Consulting Firmen? In welchem Bereich oder meistens so generell, dass sich jeder irgendwie Junior-Consultant auf die Fahne schreibt? Naja, die meisten Consultants kannst du erstmal in die Tonne kloppen. Was viele dort können ist, die können sich gut verkaufen. Aber Leute, die wirklich Ahnung haben, sind da recht rar gesehen. Steht noch auf dem Schild drauf. Ok, ich muss zur Pipe rüber, zum Rohr. Das hätte ich mir aber auch so überlegt. Ok, die ersten Levels sind ja immer einfach bei sowas. Das wird doch mal bestimmt ziemlich schnell ziemlich schwer. Ah, da Sebaro ist auch da. Moin. Sebaro hat gefragt, wie mein Tag war. Ich muss sagen, relativ entspannend. Ich war ja heute nicht arbeiten. Es ist ja Montag. Gehe ich in die Arbeit. Deswegen war es heute entspannend. Ich war im Bauhaus. Und habe noch mal für das Hoftor Wellen, wie heißt das? So Wellen aus durchsichtigem Plastik gekauft. Kann ich dann nämlich hinter das Hoftor machen. Und dann kann die Katze, die ich mir hole, nicht durchs Hoftor klettern. Meine alte Katze konnte auch so nicht durchs Hoftor klettern, weil die war einfach zu alt und ungelenkig dafür. Aber wenn ich jetzt mir eine neue Katze hole oder zwei neue Katzen, dann habe ich Angst, dass die quasi das Hoftor hochgehen und dann durchs Hoftor klettern, weil das Hoftor hat halt relativ große Löcher drin. Dann mache ich jetzt die Platten dahinter. Das ist halt glatt. Da kann keine Katze hochklettern. Und dann sind die halt da. Was gerade die Management Consulting Firmen sind bei Arbeitnehmern ja nicht gern gesehen. Gehen in eine Firma, reinschmeißen die Hälfte raus, das ganze Konzept durcheinander oder verschwinden. Es kommt drauf an, in welchem Bereich die sind. Wenn man sich für irgendwas, wo die Firma sagt, wollen wir uns nicht selbst darum kümmern oder irgendwas, wo wir keine Ahnung von haben und wir holen uns irgendeinen, der sich das auskennt, jemand holt, das ist überhaupt nichts Schlimmes dabei. Das Problem ist eher, dass die meisten Consulting-Leute halt einfach schwätzer sind. Wir hatten mal auf der Arbeit, hatten wir mal Consulting-Typen da aus den USA, von irgendeiner Firma, die sich mit so Cloud-Gedöns auskennt, ich will jetzt den Namen nicht sagen. Und die haben ab dem zweiten Tag, also sie waren den ersten Tag da, haben was gemacht. Und den zweiten Tag haben sie festgestellt, oh, wir sind ja quasi so mitten in Frankfurt, da können wir jetzt mal alle möglichen German-Spezialitäten ausprobieren. Und haben sich dann ab Mittags, dem zweiten Tag nur noch German-Bier reingehauen und waren eigentlich zunächst mal zu gebrauchen. Das hat sich natürlich nicht gelohnt, ne? Tofu? Morgen Max, wie geht's? Oh, mir geht's gut. Wie gesagt, ich muss heute nicht arbeiten gehen. Naja, ich muss wahrscheinlich hier mich runterhängen lassen, ne? Aufwachen! Gutes Video von Anderviren-Softer, THX. Oh, da müssen wir uns ein bisschen aufpassen. Konnte man die Bälle nicht irgendwie wieder abmachen? Ne, das ging, das ging mit anderen. Ich glaube, meine Baukunste erreichen hier schnell ihr Limit in dem Game. Hey Max, was war dein größter Scam deines Lebens, wo du gescampt wurdest? Wo du richtig scamaßt wurdest. Oh, da muss ich mir mal Gedanken drüber machen. Das größte, wo ich beschissen wurde. Ich weiß, mir fällt's nicht ein. Mir fällt das jetzt nicht ein. Also, wo ich mich richtig verarscht, wo ich mir richtig verarscht vorkam, das ist aber bestimmt nicht der größte Scamaß meines Lebens, wo ich mir richtig verarscht vorkam, war bei meinem neuen Unity-Media-Anschluss, als ich DualStack Live bekommen habe. Das war die größte Verarschung, was providermäßig besser so passiert ist. Damals war es ja so, damals konntest du, wenn du ein Handy hattest bei der Telekom, also bei, weiß ich nicht, ob die mobile hießen damals, also mein Handy hatte da in diesem Telekom-Netz, die hatten damals mobil keine IPv6-Adressen. Und ich hatte keine Möglichkeit, mich vom Handy mehr daheim einzuloggen. Was ich regelmäßig benutzt hab, ich hab VPN angemacht auf dem Handy, hab dann Mails daheim gelesen, hab mir irgendwelche Sachen gesunken, alles. Und das ging dann auf einmal nicht mehr, weil die Unity-Media der Meinung war, wir machen DualStack Live. Aber was war so der größte Scamaß, ich weiß es nicht. Größte Scamaß. Wow, was ist das? What the fuck? Ich wusste gar nicht, was das Spiel das Story hat. Hat sich mal ein Freund versucht zu Scamasen? Ich hab keine Freunde. Naja, also ich hab nicht viele Freunde. Keine Ahnung, ich überleg grad, was hab ich, ich glaube, ihr kennt sogar alle meine Freunde. Oder? Lass mal überlegen. Ich hab mit dem Fabian hab ich natürlich schon Videos gemacht. Der Karsten, also sprich der MasterKröber, der war auch ab und zu mal in Videos. Der Felix, mit dem ich meine Ausbildung gemacht hab, war auch schon mal in einem Video dabei. Ansonsten, wie gesagt, ich hab relativ wenig Freunde. In der Schule hatte ich ein bisschen mehr, nicht wirklich viel mehr Freunde. Aber so Scamaß? Ja, der Kabum, aber der hat mich auch nicht Scamaß. Wobei, in der Schule, das war nicht so wirklich Scamaß. Ich hatte zwei Kommos in der Schule, den hab ich mir super verstanden. Der eine ging ursprünglich auf eine andere Schule als ich. Und irgendwann ist der gewechselt auf meine Schule und hat sich zum übelsten Spaß entwickelt. Mit dem wollte ich da nichts mehr zu tun haben. Aber der hatte dann halt die ganzen Deppen bei mir auf der Schule, die hatten wohl irgendwie schlechten Einfluss auf ihn. Da hat sich zum übelsten Spaß entwickelt. Und der andere, vor allem das geile war, das kennt ihr wahrscheinlich auch, als ich noch in der Schule war, bzw. noch ein bisschen jünger war, oder vielleicht seid ihr noch in der Schule, man hat irgendwelche Freunde. Und die bringt man auch ab und zu mit heim. Und mein Opa, der hat dann immer gesagt, wenn er da meine beiden Kumpels gesehen hat, die werden es aber voll noch zu was bringen, weil die gute Noten geschrieben haben und so was in der Richtung. Man wollte mir damit quasi sagen, so nach dem Motto, die bringen es ja zu viel mehr als ich, weil die viel bessere Noten schreiben und so was. Soll ich euch mal was sagen? Die haben es alle beide komplett verschissen, was das angeht. Aber wie gesagt, der eine, mit dem ich mich da eigentlich am besten verstanden habe, als er noch auf die andere Schule gegangen ist, der, okay, oh Gott, wie funktioniert das hier jetzt? Der hat sich zum übelsten Spaß entwickelt, als er dann zu mir auf die Schule gegangen ist. Aber bei mir gab es auch noch viel Spaß. Und ich glaube nicht, dass es so gedacht ist, wie ich das hier mache, oder? Moment. Ich glaube, ich sollte hier noch einen hinbauen. Ah, so ist es besser. So, und der andere hat dann wiederum die Schule gewechselt und ist irgendwo anders hingezogen. Und irgendwann kam er wieder und war auch der übelste Spaß. Also insofern habe ich eigentlich auch keine Freunde bei unserer Schule. Oh, knapp. Oh, das ist knapp. Das ist richtig knapp. Wenn das jetzt da reingeht, dann bricht es auseinander. Und also von meinen Freunden habe ich so, wie ich jetzt, also wenn ich jetzt, mir fällt jetzt nichts ein, das wurde ich doch nicht so richtig verarscht. Ich überlege gerade, ich meine, jetzt wurde ja schon jeder ein bisschen, wurde ja schon jeder gescampt. Ich muss, ich mache mir gerade echt Gedanken, was war denn das, wo ich bisher am meisten mal gescampt wurde von irgendwas? Zwei englische Mädels außen vor, die einem komische Dinge erzählt haben, was da nicht so war, aber das ist ja nicht, das ist ja nicht Scam. Was? Wo wurde ich mal gescampt so richtig? Ich muss mir da mal Gedanken zumachen, fällt mir gerade nichts ein. Wahrscheinlich wisst ihr das besser, weil ich das mal in einem Video erzählt habe und jetzt gar nicht dran denke. Hey, hast du, hast auf Twitch eine Pen mit dem Google Drive Link erhalten? Auf Twitch? Ich weiß gar nicht, wie man auf Twitch meint. Ich weiß gar nicht, wie man auf Twitch Messages sich anguckt, fällt mir gerade auf. Wie kriege ich mir auf Twitch Messages? Warte mal, Dashboard? Ich weiß nicht, wo man Messages sich anguckt auf Twitch. Wo geht denn das? Video Manager? Nach Nachrichten, da ist es ja. Angeblich habe ich keine Messages erhalten, Eingang, nichts. Sonstiges? Sonstiges? Twitch, please, was ist denn das für eine Logik? Bei Twitch hat man unter Messages Eingang, Ausgang, sonstiges und jetzt ratet mal, Chat, ratet mal in welchem Ort eine neue Message landet. Eingang, Ausgang oder sonstiges? Der Bot schreibt ein sinnloses Zeug, das ist noch von gestern. Aber das Ganze ist mal aufzuklären, die Message von ihm ist in sonstiges gelandet. Also nicht Eingang oder so, wie man das erwarten würde. Ich habe unter sonstiges sogar mittlerweile einige PNs, die habe ich alle überhaupt mit gesehen. WTF? Ist auch geil, wer guckt denn bitte schön in sonstiges? Was ist das für ein Schwachsinn wieder? Okay, aber ich habe es gekriegt, die PN, alles gut. Sonstiges normal, ja. Ich muss mal meinem Bot beibringen, dass er nicht so komische Dinger schreibt, Moment. Okay, Nightbot. Wo ist der Nightbot? Hier ist der Nightbot. Nightbot Timers, da ändern wir jetzt mal den Text. Add Wupplos, wenn ich etwas übersehe, dann. So, ich habe den Bottext mal geupdatet. BDO-Frage, kann man, was kann mir ein Crystal für Arm, Moor, Claymant und kann zwischen Gathering, Fishing, Training und Processing auswählen? Was für ein Anfang, kein Schimmer. Ich sage doch, ich bin der best ausgerüstete BDO-Noob, ich habe von dem Gewapp keine Ahnung. Was denkst du über die Sicherheit von Online-Banking? Gerade mit Mobile-Tan und Banking-App auf einem Handy sehe ich das doch etwas kritischer. Ich auch. Da kann ich dazu nicht sagen. Man darf nicht vergessen, die ganzen Scamas-Leute sind halt immer sehr kreativ. Moment, was muss ich hier überhaupt machen? Ah, das sind die Dinger, die man wieder wegmachen kann. New Go Balls. Ah, ich glaube, ich habe jetzt gecheckt, wie das funktioniert. Ich muss hier nach oben bauen. Ups, so war das jetzt nicht gedacht, wie ich das gemacht habe. Ich muss das hier nach oben bauen, dann kann ich hier unten abmachen. So. Moment, ich glaube, ich mache das aber falsch. Kann ich das Ding nicht irgendwie an die Wand sticken lassen? Ball, Ball, geh weg! Das bleibt nicht an der Wand hängen, ne? Ich lebe nicht so wirklich an der Wand, das wird doch niemals was, wenn das da abgeht. Ich glaube, meine Baukünste fehlen gerade. Das klebt da gar nicht dran an der Wand. Warum klebt das nicht an der Wand? Ach so, doch, funktioniert doch. Easy. Oh, ich sehe schon, das Spiel wird gefummelt. Aber ich wollte es ja so. Ich gucke gleich den Chat, falls ich was übersehen habe. Oh, ich habe Angst, dass das gleich abbricht. Was, nur zwei Stück? Das geht aber besser. Ich kann das hier noch abmachen, das hier noch abmachen. Das da, das da, das da, das da. Okay, aber wir haben es gepackt, neun von zwei, easy. Ja, Sebaro, frag mal den Frisör. Heute kommt der Mercy-Nerf? Oh, nice. Nice, ich freue mich ja, muss ich ehrlich sagen. Ich bin ja normalerweise nicht so extrem schadenfroh. Ich kann mich jetzt nicht so sehr am Leid andere erfreuen. Aber den Mercy-Mains in Overwatch, den gönne ich. What? Den Mercy-Mains gönne ich. Was muss man hier machen? In das Menü soll ich gucken, okay. Menü. 35 or more balls, easy. Ach, hier unten, ne, das Menü. Okay, wir müssen da oben hin. Okay, das wird jetzt ein bisschen komplizierter. So wird Bubble die hergestellt. Was wird denn an Mercy generft? Also ich weiß nicht, ob das noch der aktuelle Stand ist. Letzte Mal, was ich gelesen habe, ist, dass du nicht mehr instant retzen kannst. Selbst in der Ultimate. Dass, ich glaube, deine ult kürzer ist. Und ich glaube, die Zeit, wie du fliegen kannst, wird auch irgendwie verringert oder so. Bin ich jetzt aber nicht mal ganz sicher. What the fuck? Oh, ich sehe schon, das wird was. Okay, ich glaube, das ist nicht gedacht, dass es da so stehen bleibt, oder? Krasse Baukünste. Ich setze da jetzt einfach mal irgendwas aneinander. Easy clap, easy. Nein. Das ist ja hardcore. Wahrscheinlich kann ich das einfach irgendwie vollbauen hier. Ich meine, ich brauche ja bloß acht. Ich brauche ja nur acht Goos. Das ist ja nichts. Zack, zack, zack, zack. Easy geschafft. Woher kommt der Hate gegen Mercy mains? Als ich noch gespielt habe, waren die Hanzo mains. Ich glaube, ich habe das Gefühl, es ist ein bisschen weniger geworden. Außerdem heißt es ja nicht Hanzo, sondern wenn man cool ist, ist es Hanzo. Ich glaube, der hauptsächliche Mercy-Held liegt daran, im Charakter selbst. Mercy ist der Held, der mit Abstand für den wenigsten Einsatz das Höchste bringt. Und es ist schon in gewisser Weise frustrierend, wenn man sich überlegt, man kann sowas wie Tracer Genji gut spielen, was saumäßig schwierig ist. Und du siehst irgendjemanden, der Mercy linke Maustaste gedrückt halten kann, ab und zu mal Q und zwei Leute instant retten und hat damit im Endeffekt fast mehr Einfluss auf das Spiel, als du, das sich übrigens die Seele aus dem Leib spielt. Das ist glaube ich der hauptsächliche Hate gegen Mercy. Dazu kommt halt auch, dass man sieht, wenn man sich die Match-Historie von den Leuten anguckt, dass du welche hast, die waren halt, keine Ahnung, die haben hier ihre Mercy-One-Tricks gespielt, sind dann halt quasi gewesen, irgendwie Gold, Platin, Gold, Gold, Platin, Platin, vielleicht mal Diamond oder so. Und jetzt die letzten zwei Seasons halt GM. Das ist halt lächerlich. Für nichts. Können im Endeffekt. Ich meine, man darf sich nicht überlegen, es heißt Grandmaster. Und du kannst mit links klicken Grandmaster werden. Das ist halt auch nicht so. Vom Design her auch alles nicht so tolle. Woher kann er... Was sagst du denn zu Slayers angekündigtem Ende? Ich weiß gar nicht, was du meinst. Was? Hä? Was ist zu Ende? Ich weiß nicht, was du meinst. Oh, das wird eine Balanciere-Geschichte jetzt hier. Ich glaube, ich muss mich hier erstmal hier runter hangeln, die Balls aufsammeln und dann wieder nach oben. Oh, da bin ich ja mal gespannt, wie das funktioniert. Das müssen wir auf jeden Fall nach oben hängen und dann wieder nach oben. Und dann wieder nach oben. Und dann wieder nach oben. Oh, da bin ich ja mal gespannt, wie das funktioniert. Das müssen wir auf jeden Fall mit den grünen Balls machen. Weil die lassen sich ja wieder abkletten. Ich hab mir absichtlich ein sehr entspanntes Gameport ausgesucht. Aber ich glaube, das wird echt kompliziert später. Oh ne, komm her jetzt. Komm her. So. Zack, dann bauen wir mal wieder hoch. Dann bauen wir auf der anderen Seite runter. Kann man eigentlich speichern? Das geht natürlich nicht. Wäre ja auch bescheuert, wenn das funktioniert. Was? Ich muss eigentlich gar nicht Pause machen, ich spiele da überhaupt kein Zeitlimit. Wat? Tf. Was ist das? In Hotstars gleiche. Sehr viele, die Goldblatt waren, wurden auf einmal Masters. Es gab vier Resets von der Season bis heute, klappt es nicht. Also was ist so alles in allem gelesen? Äh. Ah. Diese Dinger, diese Dinger machen immer, immer einen Schritt zurück, kann das sein? Lull. Jetzt hab ich mich selbst resettet. Perfekt Max, ganz, ganz clever gemacht. Ich muss, ich muss die weißen Teile machen. Ok, aber jetzt, jetzt weiß ich's. Die resetten mich. Auch gut. Hallo. Ich will das Ding da anklicken. Und nicht runterfallen. Blitz. Ah, man kann hier nicht durchtracken. Auch gut. So und jetzt müssen wir hier runterbauen und die anderen holen. Hey Max, welche Programmiersprache empfiehlst du zum Anfangen? Ähm, das hatten wir gestern schon mal kurz. Auf welcher Plattform willst du programmieren oder willst du einfach nur ein bisschen warm werden? Also hast du was Konkretes im Kopf, was du machen willst? Oder auf welcher Plattform programmierst du? Also quasi Mac, Windows oder? Wo bist du unterwegs? Ah. Ah. Auf welcher Plattform programmierst du? Also quasi Mac, Windows oder? Wo bist du unterwegs? Ups, das war jetzt ne blöde Idee. Ohne Ankündigung 74. Gestern war krass, ne? Und ich habe ich habe ein paar Windows Forms Sachen zusammen geklickt, okay es war Wochenende Wenn du also wenn du wenn du Windows entwickelst kann ich dir empfehlen lade hier Visual Studio runter Ich zeig das mal wir können es ja heute alles mal ein bisschen entspannt machen Ich mache mal kurz einen clone auf ich zeig dir mal was du dir was du dir bis da besorgen kannst Lad dir einfach das hier runter im moment Capture Window Capture das da Lad dir einfach die Visual Studio Community Edition runter das da ist komplett kostenlos Auch wenn das hinterher gerade ein bisschen lahm ist, wobei ich glaube eher Microsoft ist lahm Oh, Try Microsoft Edge Fast Secure Browser, also lade dir am besten Visual Studio Community 2017 runter, kost nix und dann schnappst du dir das Galileo Open Book C-Sharp das da und fängst an Das ist das Beste was ich dir zum Einstieg unter Windows empfehlen kann Nicht retry Zoom Oh Oh ich ahne Schlemmes Oh, das wird nix das wird nix ach du scheiß Komm schnell schnell schnell gu gu balls zack zack bevor das wieder um kippt Kippt ja gar nicht um dann können wir noch ein bisschen besseren Score hier rausholen Nicht dass es jetzt reißt okay das kann ich in dem ab machen jetzt continue Nice wachs Lava über gotten die Welt Streams sind die besten Ja finde ich auch macht mir auch am meisten bock übrigens heute ich muss mich ja mal wieder ich muss mich ja mal wieder über YouTube auslassen Ich habe ja ein Video hochgeladen über über Virenscanner und es gibt Videos Da Da nervt es mich einfach das sind halt Videos wo vielleicht manchmal was fällt was dem einen oder anderen nicht so gefällt Ja zum Beispiel gibt es bestimmt Leute die haben sich Virenscanner gekauft Und die finden es doof dass ich nicht sage ihren Virenscanner ist der beste Und ich würde ihnen empfehlen einfach Windows Defender oder gar nichts zu verwenden. So im Endeffekt sage ich das ja in dem Video Und das sind dann solche Videos wo ich einfach mal instant 10 15 D Abos kriege Das nervt mich das ihr könnt ich ich meine klar kann es jetzt im Endeffekt sagen was juckt mich ich meine den meisten Leuten gefällt es doch und alles Das stimmt schon, aber das nervt mich irgendwie immer und das tratt trotz krassem Abos Video heute wieder Mir hat das Bad Company 1 Gameplay gefallen ja das war auch mal wieder was das muss ja mal wieder sein Und es hat letztens einer in den Comments gefragt so nach dem motto ist dir das wichtiger das Neue Leute abonnieren anstatt dass es den bestehenden gefällt und sonst was Man kann sich auch echt an allem stören was ich sag ich mein Als einer mit dem anderen nichts zu tun ich muss ja im video kurz und knackige sache sagen können die passt und kann dann nicht erst mal fünf minuten philosophieren Was mir am besten gefällt oder so deswegen sage ich da mittlerweile mein standard abo spurt und gut ist Lass das mit dem abo sellout lieber aus das bringt unglaublich viel kann sich das gar nicht vorstellen Deswegen ich ich habe ja auch früher immer gesagt so ein blödsinn ja Aber es ist einfach so dass viele leute die videos gucken und und sogar regelmäßig gucken ich sehe es ja über die startseiten Das heißt die leute gucken die videos über die startseite Und kriegen sie auch empfohlen über die startseite oder über videos was sie nicht empfohlen bekommen würden wenn sie nicht mich öfters gucken würden oder Nicht leute die ähnliche videos machen zu meinen öfters gucken würden Und ich sehe einfach dass das total wenige abos daraus resultieren Und seit ich jetzt angefangen habe einmal im video darauf hinzuweisen ist das viel mehr als wirklich extrem viel mehr und die Die ganzen social plate statistiken die man quasi von außen sieht sind ja nur die halbe wahrheit Wenn was social plate ansteht keine ahnung ich mache irgendwie muss jetzt mal gucken Social plate sagt aktuell ich mache am tag Daily Durchschnitt 44 abos steht jetzt da Na das ist im vergleich zuletzt ist ja immer noch immens Die letzten zwei jahre habe ich minus abos gemacht weil ich kaum was hochgeladen habe Mittlerweile bin ich schon wieder bei ungefähr 44 am tag Und Wo wollte ich jetzt eigentlich drauf raus Ah ja genau das ist überhaupt nichts großartig aussagt in wirklichkeit sind das viel viel viel viel mehr als 44 abos am tag aber Dazu kommen natürlich wenn man schon länger dabei ist dann hast du halt immer konnten die inaktiv was muss ich eigentlich machen Ah immer konnten die inaktiv werden die gelöscht werden und alles mögliche in der richtung Bloß halt auch leute die de abos also sprich das sind ja nur die abos die übrig bleiben Was muss ich eigentlich machen jetzt Fly Ach ich glaube ich muss hier ich muss hier einen Ich muss muss an die balls einen Laufballon dran hängen Also ich finde die ideen für die rätsel hier sind wirklich clever Auch wenn es noch die tutorial welten sind Max wie stehst du eigentlich zu space x interessierst du nicht dafür überhaupt Also ich habe mich relativ wenig Beschäftige ich mich mit was so Was so die privaten Raumfahrer Da und da gibt es ja nicht nur space x gibt es gibt ja auch noch Ich habe vergessen wie das andere heißt Was die so machen ich kriege immer mit da mal eine rakete wird abgestürzt mal irgendein satellite kaputt mal hat alles geklappt das Ding ist wieder gelandet Für so universum Theorie und Weltraum und sowas interessiere ich mich extrem Ich gucke so viele So viele ich habe viele viele youtube channels abonnieren guck da so viele videos in der richtung Was jetzt allerdings space x und sowas macht an sich Juckt mich nicht muss ich sagen Und ich glaube auch nicht wo wir gerade beim thema sind Ich glaube nicht dass Wann will Elon Musk auf dem Mars fliegen 2020 oder wann war das Das kann ich euch am besten nicht vorstellen dass das funktioniert Ich kann mir vorstellen dass sie oder was 2000 wann wann wollte der Anwälter losfliegen 2030 oder wann war das 2022 irgendwie so So und Ich kann mir vorstellen dass sie Irgendwas bauen und auch irgendwie leute reinsetzen Aber wenn das wirklich starten soll Wenn ich nicht ausgehe vor allem nicht termingerecht Dann habe ich die doofere vermutung Dass wahrscheinlich noch nicht mal die leute lebend auf mars ankommen werden Geschweige denn die ganze sache irgendeiner überlebt von den die damit machen Max machst du magst du ananas ananas auf pizza Ja auch wenn das laut gordon ramsey voll verwerflich ist mag ich das Hält zur zeit reisen für möglich realistisch in die zukunft ja in die vergangenheit nicht So Ich muss jetzt hier machen Jetzt rüber fliegen Ich glaube ich habe es gecheckt was ich machen muss Das wird das mit balance aktier Funktioniert Wenn wir bauen das jetzt mal möglichst Ach du scheiße Wir bauen das jetzt hier mal möglichst gerade Da oben sind auch stacheln Da muss ich jetzt ein bisschen aufpassen Die physik der gobel ist ein bisschen gewöhnungsbedürftig Das ist knapp Das ist schwieriger als ich mir das vorgestellt habe gerade Jetzt habe ich da eigentlich für ein komisches ding gebaut das ist doch komplett sinnlos Nein ich wollte den ball doch gar nicht dahin machen Ich baue hier ein scheiß zusammen der wahnsinn Das ist das ist echt knapp was ich hier baue Mit dem letzten goball Was ist das für eine konstruktion Es hat geklappt Ich muss jetzt hoch scrollen Hallo Mr. Anlocker Da fragt was meine lieblingsidee ist Ich muss sagen unter windows auch wenn microsoft produkte immer viel hate abbekommen aber gegen visual studio kann man eigentlich nichts schlechtes sagen Es ist alles mal also ich kann nicht sagen was meine was meine gehassteste beziehungsweise meine unbeliebteste ide ist das ist eindeutig eclipse So was aufgeplasenes hässliches habe ich ja selten benutzen müssen Aber unter windows muss ich sagen visual studio ist super für alles was ja alles windows und dot net mäßiges Und für c++ finde ich was auch ziemlich gut ist ist der cute Creator heißt da creator der cute creator der ist auch super Also ich würde sagen visual studio und cute creator Wenn du tv schaust was schaust du eher an dokus oder serienfilme Talkshow danach ich gucke eigentlich gar kein fernseher Also wenn wenn ich mal irgendwas gucke Dann dann vielleicht irgendwelche doku geschichten ich gucke eigentlich nichts ich gucke eigentlich das mittlerweile muss ich sagen Ich bin ja war ich bin jetzt wie gesagt ich bin 84 geboren ja Das ist eigentlich so die die letzte generation die so noch mit fernseher aufgewachsen ist zu der ich gehöre Also noch ohne youtube und internet und zeug Ich bin ja quasi die letzte generation die das betrifft Aber ich glaube ich im umkehrfall war ich einer der ersten Der quasi oder gehör ich auch auch zur ersten generation wo viele komplett auf fernsehe verzichten Ich komme eigentlich kein fernseher Fernsehen 2k 18 in 2k 18 leute Ich habe die story von dem spiel immer noch nicht verstanden falls es wirklich einer hat Wie hoch muss ich dann Okay das ist echt hoch damit da müssen wir da müssen wir ein bisschen breiter anfangen Achtung max architekten skills sind jetzt gefragt Maximum architekt skills So ich hoffe man das ist breit genug Wir machen jetzt so eine eifelturm ja Ich glaube das ist das letzte das letzte level Zu form vom tutorial Und es ist jetzt schon schäpp Das ist jetzt schon schäpp okay wir gleichen das mal ein bisschen aus Wie viel 25 nach gut ich habe ja auch ganz schön viele Das ist nicht gerade oder was hier bauer Oh es kommt auch noch wind dabei ach du okay da müssen wir das hier ein bisschen schwerer bauen als auf der anderen seite Wie hoch wir da müssen und das wird nix ach du scheiße das wird nix Oh fuck Es lebt es lebt Oder auch nicht Scheiß Das wird nix ach du scheiße Ich baue es einfach so schnell der hat ja auch geschrieben ich soll schnell Jetzt kann ich doch rückgängig machen oder Ich glaube ich muss doch mal anfangen Scheiße Okay wir fangen nochmal das muss anders machen Das das funktioniert nicht okay wir müssen das breiter bauen So Okay okay jetzt ist jetzt ist es echt breit Was game ist black desert nein nicht wirklich weiß ich was der hör nicht auf den nightbot was er da erzählt der nightbot hat keine ahnung Okay was gibt es nie auf dem schild Okay das heißt das heißt das heißt das ist die taktik hier oder was Okay Okay Jetzt ja zack ich zack ich zack ich zack ich rein rein rein rein rein rein rein Easy clap easy clap überhaupt kein ding überhaupt kein ding Max nightbot labert wie der scheiße ja das stimmt nicht so ganz was der geschrieben hat mit game black desert das ist falsch Was ist das ziel von dem spiel zur röhre zu kommen Ich habe wie gesagt ich habe twitch immer noch nicht angefragt eingeschrieben benutzt du denn ab und zu dein switch Es gibt ja nichts auf der switch Da wird mir jetzt zwar der nintendo fan widersprechen aber was gibt es denn auf der switch Es gibt zellner es gibt mario es gibt vielleicht noch das platoon wenn man da drauf steht Es gibt dieses mario rabbit spiel wenn man da drauf steht Es gibt was gibt es denn was gibt es denn sonst auf der switch Moment das gucken wir uns jetzt mal zusammen an wir gucken uns jetzt mal wir gucken uns jetzt mal kurz die switch games an Und dann sage ich euch was mir davon gefällt was nicht weil ab coming vor 2017 Gibt es da keine liste für spiel für switch spiel 2018 rausgekommen sind das das überrascht mich jetzt aber Und vor allem 2017 nicht 2018 wo gibt es dann switch spiel release list aktueller ja gucken wir mal Best switch games 2017 wenn man danach so guck jetzt funktioniert jetzt kann ich mich sogar verschrieben Jetzt kann ich sogar sein best switch games 2017 funktioniert also gutes game gutes game Bestimmt ganz okay kann ich nichts zu sagen ich war noch nie groß das platoon fan Übrigens wer sagt der max frisst wieder ich habe hier traum also nicht so nicht dass jetzt irgendwelche ungesunden sachen puttern würde oder so So mario kart 8 deluxe ist nicht übel mario kart 8 generell war nicht übel Weil ich sagen muss ich finde ich war mario kart war schon immer dadurch gekennzeichnet dass es absolut random ist Aber ich habe persönlich den eindruck dass mario kart 8 fast noch das random mix der mario kart überhaupt ist Was mich ein bisschen genervt hat ich fand das mario kart auf der wie richtig geil ich fand das auf dem ds richtig geil Und ich finde mario kart 8 auch ganz gut aber das ist bei mir jetzt in meiner mario kart liste nicht so weit Wobei es mittlerweile viel mehr strecken und alles gibt als früher Was ich bis heute nicht verstanden habe warum es link in einem mario kart spiel gibt aber wahrscheinlich weil Nintendo mittlerweile auch verstanden hat es geht darum was die leute für charaktere spielen wollen scheiß egal ob sie zum universum gehören oder nicht Ok also fangen wir an gutes game also für die ersten beiden absolut top games gibt es nichts dazu zu sagen Eines der besten spiele die überhaupt rausgekommen sind so die ersten beiden Splatoon wem es gefällt mario kart 8 auch nicht übel mario und rapid ist eigentlich auch ganz nett Und arms da muss ich sagen bin ich ein bisschen enttäuscht von nintendo was arms angeht sie haben das im vorfeld angekündigt Als arms e-sport league oder so haben sie mal irgendwo erzählt ja nintendo arms is joining the world of e-sports bla bla bla bla Also so nach dem motto wir haben ganz tolle ambitionen mit dem game und jetzt kam letztens die message arms ist eingestellt Jawoll so macht man ein tolles competitive multiplayer spiel in dem was paar monaten nach release einstellt Das easy clap das ganz toll nintendo xenoplade chronicles 2 soll ziemlich gut sein Und das wars das heißt wir haben im endeffekt zwei must have games wofür es sich ohne frage lohnt eine switch zu kaufen Wenn man halt eine view hat kann man sagen hey eigentlich kann ich das zelt auch da drauf spielen aber angenommen hätte keine view was ja viele leute betrifft Also must have ja allein schon für die zwei games kann man sich eine switch kaufen Rest ist so naja und bis hier eigentlich auch noch alles ganz gut also gebe es wenn man angenommen es gefällt einem alles das hier gibt es aktuell 1 2 3 4 5 6 7 nein das wie gesagt mittlerweile 1 2 3 4 5 wir sagen mal wir sagen mal 5 oder 6 games Wobei es für mich halt einfach nur zwei games sind und das ist einfach zu wenig Das ist einfach zu wenig ich meine dass ich da andere konsolen wie jetzt die neuen sachen die für microsoft für die xbox rauskommen Auch noch nicht so nicht mit rum bekleckern ist sie macht es jetzt ja auch nicht besser im endeffekt So was haben wir noch nach rechts slipper clips net net ja Sonic mania soll ganz gut sein kann es aber glaube ich auch auf allen anderen plattformen spielen und hatte glaube ich fps probleme auf das mit Ich weiß nicht wie das neue fire emblem ist keine ahnung wenn das was taugt ist bestimmt auch ein ganz gutes game Golf story was auch immer kann ich immer fast er ist das ist dieses f0 was kein f0 ist das ist aber auch eine neuauflage von infos alt Und das soll auch ganz gut sein fifa 18 die die bekommen dass da steht sogar p da ist sogar die ps4 Da ist sogar die ps4 packung auf der konsolen dings weil man nach switch sucht Beschissenste fifa portierung für fifa um aller zeiten für die switch eins want to switch Hör mal auf das sage ich nichts zu nba jugg nicht steampunk ist glaube ich ganz gut aber es hat alles jetzt nichts wofür man nicht unbedingt Switch kaufen muss holst du da muss man sich definitiv keine switch kaufen Juggaleli muss auch keine switch verkaufen man kann es überall woanders spielen sonic 2017 nein Nein das neue bomba man sagt auch das ist auch eine neuauflage von etwas altem glaube ich Kommt mir irgendwie bekannt vor als es doch ein bisschen älter lego spiele gibt es auch überall anderes was auch immer das hier ist Jetzt bestimmt auch überall anders snake pass gibt es auch überall anders also das war es im endeffekt bleiben zwei must have spiele für die Den rest gibt es auch für andere plattform im prinzip gibt es zwei must have spiele für die switch Das ist das hier und ein ziemlich gutes wenn man noch sowas steht mit xenoplates und dann und und vielleicht auch mario kart das Aber das das das um mario kart auf hier hast du wirklich wenn mit viel wohlwollen hast du kannst du dir selbst wenn du die andere noch Noch mit nimmst also es kommt jeder auf sagen wenn man ungefähr vier spiele die ihm gefallen könnten auf das mit zur zeit Und es ist halt ein bisschen wenig da Ah ja skyrim gibt es habe ich vergessen gibt es das mittlerweile schon Jetzt sage ich das gibt es eigentlich skyrim schon wobei skyrim für mich natürlich auch kein grund ist sich die switch zu kaufen Außer dass man es mitnehmen kann ok wer skyrim schon immer mal mobil spielen wollte ja ok ok aber Die beste skyrimversion krasse definitiv auf dem pc und man merkt skyrim mittlerweile an dass es in die jahre gekommen ist Ich weiß wie oft wollen sie denn skyrim noch raushauen skyrim gibt es ja gefühlt quasi für für alles Das kam wann kam skyrim raus kann ich mal richtig reden skyrim kam 2011 oder so raus 2011 ende 2011 kam das raus Ich meine überlegt man das spiel ist sieben jahre alt und da gibt es jetzt neu das wird als grandios geil und neu Angepriesel auf sieben jahre später auf das kommt irgendwann ist ja auch mal ist ja mal irgendwie ist aber auch gut mit skyrim Ok bridge builder style nein so funktioniert das definitiv nicht ich muss ich muss ich muss das mal anders Ich muss da ein bisschen nach hinten bauen es ist eigentlich ziemlich easy So muss man das machen wir müssen erstmal ordentlich nach hinten so gewicht dran bauen dann können wir nach vorne weiter machen Irgendwie so ich glaube das passt schon was ich da mache so halbwegs naja fast krasse krasse building skills Vielleicht soll ich das noch ein bisschen zusammen bauen ich sehe halt auch die hälfte irgendwie nicht Ich glaube das was ich hier mache ist irgendwie eine ziemlich dämliche idee Das funktioniert so nicht Ich glaube ich fange noch mal neu an warte ich fange noch mal neu an das klappt das klappt so nicht das ist bescheuert Ok im Prinzip ist es doch ganz einfach zack zack zack wir bauen jetzt einfach so weit bis es anfängt runter zu fallen So wenn es anfängt runter zu fallen bauen wir hier hinten was dran und dann zieht es das wieder hoch Ich sehe halt nichts so wirklich und jetzt zieht es das sollte es das naja Irgendwie sind meine bridge builder Sachen jetzt auch nicht so toll Wie weit muss ich denn da eigentlich das ist ja gar nicht mal so weit Ja stimmt das neue Monster Hunter ist ja ist ja am start das wollte ich ja eigentlich mit dem Fabian mal ausprobieren Max was du da baust funktioniert nicht oder doch Max das ist nichts das funktioniert so nicht das ist eine ziemlich bescheuerte Idee was du hier baust Ich glaube ich muss noch mal anfangen Ich bin da zu dumm für das gibt es doch nicht Ok ganz ganz ganz ruhig Oder muss ich mal ich baue nach hier unten was hier unten kommt noch was hin jawoll hier unten kommt noch so ist das gut So fuck das wollte ich gar nicht scheiße kann schon mal rückgängig machen So ja so ist das schick Staticor ja krasser Staticor So und jetzt jetzt weiß ich was wir jetzt bauen wir hier hinten Jetzt bauen wir hier hinten hoch und lassen es einfach zurückziehen So genau ok Das klappt das klappt Oder auch nicht fuck man warum bin ich denn so schlecht für dieses Game Staticor am Berg Das wird doch nie was Alter wie soll das was werden Ach du scheiße Schreckt Ich habe zu wenig Balls Oh nee jetzt habe ich zu wenig Balls ich glaube es nicht Kann ich noch mal rückgängig machen Next MLG Taktik hochbauen und umfallen lassen Pass mal auf das ist gar nicht so schwer das machen wir jetzt einfach Weiter zack So easy Staticor Guck mal überhaupt kein Ding Man muss aber nicht alles total überdenken Guck mal jetzt hier wie viele von acht wir da kriegen Ok was habe ich jetzt überlesen im Chat zeigt mal her Ich habe ganz viel verpasst nachdem ich jetzt hier dieses komische Stylers verbauen musste Was sagst du zum Nintendo Labo Kannst du mir Tipps für den Anfang geben Ich würde dir empfehlen, du bist wahrscheinlich unter Windows unterwegs. Lad dir Wishlist Studio Community Edition runter und fang an. Nehm dir noch das Galileo OpenPress, die Scharpbuchen, und fang an zu lernen. An welchem Level fängt man eigentlich in BDO mit dem Grind an? Durchgängig. Man levelt nicht über Quests. Quests brauchen wir nur für Contribution Points. Man grindet quasi von 1 bis 60. Du levelst ja auch in einem Tag bis 54 oder so. Mittlerweile. Ist der Fabian noch Friseur? Soweit ich weiß, arbeitet er noch, er hat doch letztens mal im Stream was ich gesagt. Soweit ich weiß, er arbeitet noch im Friseursalon. Er kümmert sich jetzt aber eher um organisatorische Dinge. Verstehe den Hype um Monster Hunter gar nicht. Hab es 3 Stunden gespielt und dann vor langer Weile ausgebaut. Ich kann dazu nichts sagen. Ich hab das neue Monster Hunter noch gar nicht ausprobiert. Ich wollte das mit dem Friseur spielen. Ich wollte das mit dem Fabian spielen. Wir wollten uns einfach mal angucken. Weil es ja auch Leute ansprechen soll wie mich, die quasi mit Monster Hunter bisher nicht so viel anfangen konnten. Wer macht deiner Meinung nach die besten Mäuse, Tastatur und Headsets? Headsets? Bio Dynamics? Also es gibt eigentlich nichts was über das MMX300 geht. Immer noch wenn man die Kohle hat. Oder man ein bisschen gespart hat. Hier wir sind im Magen gelandet anscheinend. Mäuse, Tastatur und Mäuse, würde ich sagen an sich hätte ich immer gesagt Logitech. Aber ich hab jetzt ja, wie gesagt ich hatte ja lange die zum testen die 500, was war das? G502 glaube ich. Oder was? G402. Protoy Score oder wie das Ding hieß. Die waren mir zu schwer. Und ich hab seitdem von Zoe, also das ist BenQ, die EC2A, da gibt es jetzt mittlerweile auch die EC2B glaube ich. Irgendwie so eine Neuauflage davon. Und ich muss sagen das ist so eine simple Maus, die hat nichts. Das ist einfach eine Maus mit zwei Seitentasten, eine Maus hat zwei Knöpfe links und rechts. Die finde ich richtig gut. Und Tastaturen würde ich ausprobieren was mir gefällt. Also ich würde sagen Headsets, ein MMX-200 von Bio Dynamics oder eben irgendein x-beliebiges gutes Audio Kopfhörer und ein Mod-Mic dabei. Dann für mich hier eine Zoe EC2A mit der sogar Taimo spielt. Taimo spielt jetzt ja nicht mehr mit DBS, aber das ist einfach mein Lieblings-Overwatch-Spieler. Und Tastature kein Schimmer. Was müssen wir jetzt hier bauen? Also ich muss sagen die Levels sind echt kreativ gemacht hier. Ich glaube irgendwie ich muss nach unten bauen, kann das sein? Sodass es nicht mehr so hin und her wackelt jetzt erstmal. Weil solange es hin und her wackelt ist das ziemlich kacke. Solange es hin und her wackelt wird das hier nichts. Äh nein so wird das auch so nichts. Bleiben die an den Wänden hängen? Nicht wirklich oder? Ja das haben wir schon gelesen. Gucken wir mal. Wie spruft? Es hängt nicht so wirklich an, bleibt nicht so wirklich an der Wand hängen. Hallo Relic Gaming HD. Jetzt hängt es. Ein bisschen zumindest. Oder auch nicht. WTF soll das funktionieren? Ich glaube ich muss es nach unten bauen. Ich glaube ich muss das nach unten bauen. Aber gucken wir mal. Wir bauen es jetzt einfach mal nach oben. Ja aber jetzt ist es zu schwer, jetzt moves nicht mehr. Jetzt können wir nämlich hier nochmal nach rechts bauen. Ja so ist das gut. Jetzt steckt es fest. Nicht umkippen, nein. Oh fuck. Es wird nicht schön, aber es wird funktionieren. Ich sag es euch, es wird einfach werden. Okay wie soll das jetzt genau funktionieren? Wie geht man jetzt hier durch? What? Ich glaube das Ziel ist einfach nur raus zu kommen, es gibt überhaupt kein Limit. Und wir gehen langsam die Bälle aus, wobei ich kann die ja unten ab... Okay was steht auf dem Schild? Okay ich muss fliegen. Fliegt man damit? Also ich finde ihr habt echt, der Typ der das Spiel gebaut hat echt coole Ideen. Es sieht zwar nicht elegant aus, aber es funktioniert. Flieg, flieg, will nicht. Und hopp, abgehoben. Oh Starry, Starry Mode. Easy clap. Wenn das als Chapter 1 gewesen ist, und mich das an dem einen Level schon so überfordert hat, will ich echt gar nicht wissen was Chapter 2 wird. Okay ich scroll mal kurz Chat hoch, mal ein bisschen was übersehen. Wie lange die Mainquests gehen BDO? Stunden. Ewig. Die gehen bis in die Wüste. Und danach gibt es noch mal einen, die gehen noch mal quer durch die Welt, ewig gehen die Mainquests. Gucken wie schwierig Chapter 2 wird. Oh guck mal neue Balls. Ah die wiegen bestimmt nichts. Oder wenig, die wiegen wenig, da kann man sich hier runter hangeln. Wir hangeln uns jetzt hier runter, dann holen wir die Goo Bälle von da unten. Aufwachen. Aufwachen. Und dann müssen wir irgendwie da rein. Ja Sebaro, in BDO machst du immer Kreisel grind, egal ob Mainquest oder nicht. Ich hab die Mainquests selbst noch nicht mal durch. Wie lange geht das Stream heute? Keine Ahnung, wahrscheinlich noch so eine Stunde oder so. Oh jetzt wirds natürlich schwierig, jetzt müssen wir irgendwie hier rein. Die sind für Wassertropfen verdammt stabil sag ich euch. Ich ahne Schlimmes, Leute ich ahne Schlimmes. Ich muss das in die entgegengesetzte Richtung noch bauen oder? Kann man die Wassertropfen voneinander wieder abdingsen? Nee kann man nicht. Ich glaube ich muss da noch mal kurz in die entgegengesetzte Richtung bauen, sonst fällt das wieder runter. Wobei, komm scheiß drauf. Komm jetzt, komm jetzt. Jawoll, easy. Einfach nicht zu sehr überdenken alles, einfach mal ein bisschen machen. Hast du eigentlich so Kartenspiele wie Matching oder Yu-Gi-Oh gespielt? Ja ich hab Yu-Gi-Oh gespielt. Und die Noobs geohnt, die die Serie geguckt haben, gedacht haben sie wissen Bescheid. Oh jetzt muss ich erstmal da drüber fliegen. Okay jetzt muss ich irgendwie da drüber kommen. Ey das funktioniert. Oh das ist natürlich ganz, oh das ist übertriebenes. Gefummelt, aber kein Ding. Und wo muss ich überhaupt hinfliegen? Ich flieg jetzt hier rüber, dann lande ich hier. Jetzt hab ich rückgängig gemacht, natürlich ganz toll. Dann lande ich hier und dann hangel ich mich hier runter zur Röhre. Klingt nach einem guten Plan, so machen wir das. Der Sound ist toll. So jetzt sind wir hier drüber, sind wir drüber? Na ein Stück können wir noch rüber. So jetzt fliegen wir runter. Der Max hat schon immer Noobs geohnt. Es war am Anfang, als die ganzen Leute diese komische Yu-Gi-Oh Fernsehserie geguckt haben, war es auch geil. Die meisten Leute haben sich ja null mit dem Game beschäftigt. Ich weiß leider auch, ich hab wieder fast alles vergessen. Ich glaube Yu-Gi-Oh hatte ja gar keine festen Kartenbeschränkungen. Also du konntest theoretisch so viele Karten nehmen, wie du willst. Da bin ich mir jetzt aber nicht mal so ganz sicher. Oder zumindest war die Anzahl der Karten, die du nehmen konntest so hoch, dass keiner maximale Anzahl genommen hat. Und du hattest halt irgendwelche Leute, die haben dann den ganzen Bullshit reingepackt. Also irgendwie dieser komische blaue Drache aus der Serie, obwohl die überhaupt keine Monster dazu hatten, um das Ding zu beschweren. Und da hattest du dann halt diese Totenkopfkarte. Ich hab jetzt alles vergessen, wie das Zeug hieß. Dieser Totenkopf, den du quasi, so die beste Karte damals, die du direkt beschweren konntest. Oder eine der besten. Und die haben halt rumgegangen mit Billigmonstern, weil sie halt so ein auf geiler Tüt wie aus der Serie machen wollten. Wobei es gibt ja auf YouTube viele Videos, die die Yu-Gi-Oh! Serie ein bisschen analysiert haben. Und quasi mal erzählen, was die eigentlich in der Serie für eine Scheiße spielen, die laut Regeln überhaupt nicht erlaubt ist. So ich geh mal davon aus, ich muss jetzt hier rüberfliegen. Und dann hier mit dem kleinen, mit dem Wasserguss das Zeug rüber runter dröpfeln lassen. Wir machen mal ein Ballon weg, weil wir wollen ein bisschen tiefer fliegen. Nee, wir müssen noch ein bisschen rüber. So, ja das ist gut, das passt. Ok, das sieht doch ganz gut aus. Das hängt jetzt aber nicht gerade, gerade. Kann ich einen auch hier hin machen, hängt es dann gerade? Ja, ja das sieht ganz gut aus. Plopp, plopp, plopp, plopp, jawoll. Überhaupt kein Ding. Alles gepackt, next. Packt Champ. So realistische Physik, ja. Was Pavillon, es gibt eine neue Yu-Gi-Oh! Serie, wirklich? Ich hab, ich glaub ich bin einer wenigen, die das gespielt haben, aber nie wirklich die Serie geguckt haben. Klar, ab und zu mal irgendwelche Folgen oder so, ich fand das irgendwie bescheuert. Vor allem halt dieses typische Zeug, so wie es halt in Yu-Gi-Oh! immer gewesen ist. Oh mein Gott, weißt du, wenn man von irgendwas getroffen wurde, was ja laut dieser Serie nur quasi Hologramm war, ne, da kommt dann irgendein Monster, attackiert, und es ist halt sogar in der Story von der Serie, es ist halt nur ein Hologramm, es ist halt nicht echt, ja. Und die Leute, und dann in der Serie immer dann alle Charaktere, wenn sie gehittet werden. Fand ich schon damals übelst bescheuert. Vor allem, wenn sie dann immer angekündigt haben, den Scheiß so, ich beschwöre jetzt, was weiß ich, krasser Owner, 8000, haben sie es dann beschwört, ne. Und da kommt dann der andere, da antwortet dann der andere Typ in diesem Duell an, das kannst du nicht tun. Und dann sagt dann der andere noch, ha, du willst sehen, wie ich das kann, aber nicht, wenn ich jetzt meine Fallenkarte... Das war dann immer so, oh, das ging mir etwas, ich hab das nie großartig geguckt. Das war richtig beknackt eigentlich. Und dann haben sie immer so getan in der Serie, als wären sie jetzt voll überrascht, so, oh mein Gott, nein, das geht doch nicht. Und dann nächste Runde steht dann so da, ha, ha, ha, damit habe ich gerechnet, dass du diese Karte jetzt spielst. Ha, ha, und deswegen beschwöre ich jetzt die einzige Karte, die es in dem Spiel gibt, die genau dagegen wirkt. Richtig eng geblieben. Oh, das sieht kompliziert aus. Wie heißt denn das Level noch mal? Steht nicht da. Ich glaube, der Schildermaler möchte uns irgendwie die Story von World of Goo näherbringen. Was, es gibt mittlerweile sechs Serien, die fangen ja immer wieder mit neuem Charakter an. Ach so, das sind andere. Echt, wie gesagt, null beschäftigt. So, wie funktioniert denn das Ganze hier jetzt? Ich hab nur, ich hab nur Wasser, Guss, oder? Die schwarzen Dinger gehen eigentlich. Okay, ich glaube, ich habe ungefähr gecheckt, was ich machen muss. Ich habe so meinen Zweifel, ob das funktioniert. Wobei, das könnte schon funktionieren. So, und jetzt machen wir im Endeffekt, jetzt bauen wir hier vorne einen. Und da haben wir direkt einen Luftballon dran. Ja, das funktioniert. Und dann muss ich, und dann muss ich über diese Windmühle drüber bauen. Game, ernsthaft jetzt, ja? Und dann, wo muss ich hin? Oh, ob das was wird. Das heißt, ich muss mich jetzt hier mit Luftballon hochhangeln. Und dann quasi mit dem Wind mich irgendwie... Na, da wollen wir mal. Easy clap, das ist überhaupt kein Ding. Wisst ihr, Leute, ich habe es schon immer gesagt, es ist immer alles easy, bis man sagt, es ist nicht easy. Deswegen ist das einfachste Level überhaupt hier. Das ist schon too easy. Der Luftballon-Sound, der macht einen so ein bisschen komisch im Kopf, ne? Okay, eigentlich sind wir hoch genug. Was passiert jetzt, wenn ich hier so ein Ding dran hänge? Schwebt das dann schon im Wind? Das schwebt schon im Wind, okay. Ja, nicht so ganz. Okay, wir müssen noch mal eins weiter machen. So, ich glaube, das reicht. Und jetzt hängen wir die dran und dann lassen wir uns hier runter hängen, so. Guck mal, guck mal, das passt. Ich müsste ziemlich genau da rauskommen, glaube ich. Aber die Physik verhält sich so, wie ich mir das gedacht habe. Nein! Hier habe ich noch einen. Wir müssen das hier ein bisschen höher machen in der Mitte. Ja, ja, das funktioniert. Ja, das klappt, das klappt, das klappt, das klappt. Das klappt, das klappt, das klappt schon easy. Guck mal an. Oh, wir sind zu weit. Wir sind viel zu weit. Oh, doch, es hängt wieder, es hängt runter. Perfekt. Okay, so richtig funktioniert das so nicht. Da müssen wir hier noch ein paar abmachen und dahinter hängen. Und dann sollten die hier weiter runterfallen. Ja. Gut. Sehr gut. Zieh auf, wir kommen der Sache näher. Perfekt. Komm jetzt noch ein Stückchen, noch ein Stückchen. Okay, okay. Ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja. Ja, ja, ja. Komm, komm. Jawohl! Oh, oh, oh. Nicht, nicht, nicht kaputtgehen jetzt. Komm, es fehlen nicht mehr viel. Es fehlen nicht mehr viel Gooballs. Macht hinne! Oh! War das knapp! Haha, f**kt, das war knapp! Ist doch eingebrochen! Monka X, da reicht Monka S nicht mehr. Da brauchen wir Monka X für. Hab ich, hab ich eigentlich? Moment. Hab ich noch nicht mal freigeschaltet Okay, hast du schon irgendwas zu übersehen im Chat Hast du mal Subnautica gespielt? Ich hab mir das Weil irgendwann auf Steam als es noch early war das Das war Early Access oder war das ein Beta oder so mal angeguckt Also wurde empfohlen im Steam Store Hab ich mir gedacht so Auf Survival unter Wasser stellen, das hab ich keine Lust Wie sich jetzt alle erzählen, wie sie die Yu-Gi-Oh! Serie angeguckt haben Genau, das Spiel der Schatten, das gab's auch noch Ja So was, was komplett, was es in der Original-Fassung nie gegeben hat Wie findest du D-Lan? Findest du D-Lan ist deine Alternative zu W-Lan? Nö Weil W-Lan funktioniert überall, D-Lan funktioniert nur da wo Steckdosen sind Es ist überhaupt keine Alternative zu W-Lan Wie willst du mit D-Lan in deine Gartenhütte Internetversorgung kriegen, wenn du da sitzt und grillst und irgendwie W-Lan empfangen haben willst D-Lan ist höchstens eine Alternative zu Netzwerkkabel legen im Haus Und selbst da muss ich sagen Also Wenn man irgendwie Sinn kriegt Netzwerkkabel zu legen, würde ich Netzwerkkabel legen anstatt diesen über Strom Netzwerkzeugs da Holst du dir dieses Jahr kein neues Kaspersky? Ja, das ist eine gute Entscheidung Was hältst du von Monster Hunter World? Ich hab's noch nicht gespielt, ich wollte das mit dem Farmirnir spielen Hier fehlen FFZ-Emoves. Wie macht man denn FFZ-Emoves? Gibt's da so eine Seite wie bei Bella Twitch TV wo man FFZ-Emoves freischalten kann? Da mach ich das nämlich nachher gleich Guckst du irgendwelche Serienfilme? Ne, also ich guck generell wenig Wenig so klassische Sachen. Klar ich guck ab und zu mal einen Film auf Amazon, aber Serien Wenig. Das letzte, was war das letzte was ich geguckt hab? True Detectives hab ich glaube ich geguckt, das fand ich dann schlecht. Davor hab ich mal Black Sails geguckt, so Pirate Stealths Und jetzt müsste ich mal nachgucken Ich müsste mal warten, ich hab jetzt mal nachgucken, ich hab jetzt mal nachgucken Ich müsste jetzt mal bei Amazon gucken, was ich mir da jetzt geholt hab. Ich hab schon ein paar Sachen geguckt, war Es gibt schon ein paar ganz coole Filme Aber das Problem ist, ich merke es immer wieder, wir bleiben die Sachen meistens nicht in Erinnerung Und das spricht es nicht unbedingt für das Zeug. Moment mal Leute, ich guck jetzt mal Was ich bei Amazon, was hab ich zuletzt bei Amazon geguckt? Das kann man bestimmt sortieren, oder? Kann man Amazon Bestellungen nach Videos sortieren? Ja True Detectives, Staffel 1 hab ich geguckt. Simon scant Vol. 1, als weil ich das immer auf YouTube guck. Der hat einen Film in Farbe gemacht, das hab ich mir noch geholt Hab ich den geguckt, The Accountant hab ich geschaut. Alo und Spot, ja so Animationsfilme, da steh ich ja drauf Die Gross in the Shell, Realverfilmung hab ich geguckt. John Wick, Passengers, was hab ich denn noch so? Black Sails Staffel 1, 2, 3, 4, Deadpool Ja, also ich hab schon ein paar Filme geguckt, so richtig krasse Erinnerungen. Also ich muss sagen, der Film, der mir in den letzten Jahren am meisten in Erinnerung geblieben ist, wo ich sagen muss, der ist nicht wirklich gut, aber der ist voll abgedreht, das war Hardcore Henry Das ist mir echt, falls das jemand kennt, das ist mir echt in Erinnerung geblieben. Wahrscheinlich gefällt es bloß Leuten, die Cod spielen oder so, oder Battlefield, keine Ahnung, ich fand das übelst geil Einfach mal Filme komplett mit GoPros gedreht, oder eben mit irgendwelchen Actioncams. Moment, was muss ich hier eigentlich machen? Hardcore was? Hardcore Henry, was heißt das? Das ist komplett aus Ego Perspektive gedreht, so mit irgendwelchen Actioncams Das fand ich übelst geil, ich meine, der Film ist objektiv, also wenn jetzt der krasse Kritiker hingeht und dann zerreißt den Film, also wirklich gut ist der, aber der ist geil gemacht Ich muss übrigens mal gucken, ob ich noch mehr De-Abos bekommen habe, weil irgendwelche Leute sich wieder auf den Schlips gedreht und gefühlt haben, weil ich den Viren-Scanner schlecht gemacht habe Ja, zwei, drei mehr oder so, ich finde das so geil, wie die Leute mit sowas Probleme haben Ich glaube, ich muss das hochheben Und jetzt muss ich, was muss ich jetzt machen? Jetzt muss ich hier wahrscheinlich die grünen Goo Balls andocken, dass ich mich hier hoch schaufeln kann Vermute ich mal, keine Ahnung, ob das irgendwie stimmt, was ich hier mache Na, ob das so klappt, woa, woa, woa, woa, woa, das ist so gedacht, ich meine, ich brauche 36, das sind ordentlich viele, die hier rumschwimmen Oh, da unten ist noch was Gucken wir doch mal, gucken wir mal, ob das reicht, ob ich genug gerettet habe Deswegen braucht man auch die ganzen Ballons, weil man so viel hat Magst du streamen oder magst du Video gucken? Ja, das ist schwierig, ich würde sagen, magst du streamen, weil es geht nicht mehr so lange, dann kannst du Video gucken Ich muss ja morgen wieder arbeiten, das heißt, ich muss dann irgendwann auch demnächst pennen Oh, oh, so jetzt gucken wir mal, wie viel wir haben, genug, genug, überhaupt kein Ding 50 von 36, da kann ja wirklich nichts schief gehen Zu gute Auflösung für den Stream, äh, Streamer zu gute Auflösung für dich Ähm, ja, ich kriege ja heute keine Quality Options Ich gucke mal, ich weiß ja nicht, was ich dagegen machen soll, ehrlich gesagt Ich hatte immer Quality Options, ich weiß nicht, wo die jetzt hin sind Vielleicht möchte mir Twitch damit auch sagen, ich soll sie mal anschreiben wegen, äh, ne, Partner und so Kann ja sein Super, easy Beauty School Stream mit 30 FPS, du hast Quality Options Ne, ich habe am Anfang 1080p 30 FPS gestreamt, ich hatte auch keine Quality Options Deswegen habe ich, ähm, dann umgeschaltet und jetzt habe ich auch keine Quality Options Als letztes Mal, ja, hatte ich das Weiß nicht, bei uns, das letzte Mal waren es auch 48 FPS, was ich probiert habe War das nicht früher sogar so, dass nur Raring Fights Auflösung hatten? Äh, keine Ahnung, ich hatte immer Quality Options, egal mit was ich gestreamt habe bisher Ich habe immer bisher mit 6 MBit gestreamt, 6 MBit, entweder 1080, 30 oder 7720, 60 oder 48 Und immer Quality Options Ich probiere das das nächste Mal aus, ich stelle dann wieder auf 30, mal gucken ob es dann funktioniert Außerdem soll Twitch allgemein, Twitch muss mal langsam ein bisschen mehr als 6 MBit erlauben Was ist das? Ein Grill-Goo Also wenn, wenn Twitch das hinkriegt, dass man, dass man, sagen wir mal, mit 8 MBit, 8 MBit wäre schon Sogar 7 fände ich schon gut, 6 MBit ist einfach für 1080p ein bisschen wenig 8 MBit, am besten wäre natürlich 10, aber sagen wir mal, die können es doch so machen wie YouTube Ich meine als Amazon mittlerweile, dahinter, die haben ja nicht zu wenig Rechenleistung oder so Könnten doch einfach sagen, wir erlauben 1440p mit 15 MBit, so, und dann Transcoden sie das irgendwie Ich meine, ich weiß, das kostet ordentlich Rechenleistung, ja, aber es wäre ja okay, wenn man das für Streams macht, die ein bisschen Zuschauer haben Das muss doch funktionieren, so, was muss ich denn hier überhaupt machen? Wer ist der hübscheste Goo Ball? Tja Das Goo Ball Grill Wow, wo sollte das jetzt wegfliegen? Oh, Leute, wir müssen das Goo Ball Grill zerstören, seht ihr das? Das ist ja tragisch Wahrscheinlich kommen jetzt die Feministen in mein Stream Und wollen, dass ich gelöscht werde, weil ich das Goo Ball Grill reinwerfen muss Instant Band Holst du dir Kingdom Come Deliverance, nee Was war dieses, dieses Asiahacken slash Diablo Style Game, ne? Hallo Alex Wieso die das machen, oh Storytime Ich verstehe die Story nicht Ich finde, sie sollten es erlauben, dass du in guter Qualität zu Twitch Streams Und dann sollen sie das halt transcode, dann können sie sagen, okay Die Leute, die eine fett genaue Leitung haben, können sich das quasi Source angucken, 1440p mit, keine Ahnung, 15 Mbit Und die anderen werden halt runtergerechnet auf, sagen wir mal, 8, 1080p Oder, sagen wir mal, auf 6 für 720p, das wäre halt sehr praktisch Er sieht einfach, Twitch ist die Seite mit der hässlichsten Videoqualität Also die Stream-Seite mit der hässlichsten Videoqualität Aber trotzdem, gleichzeitig die beste Das liegt halt nicht an der Videoqualität Sondern an einem anderen Drumherum Als Partner geht das bestimmt, aber wobei Als Partner kriegst du auch nicht mehr Bitrate oder nur ganz, ganz zu ganz speziellen Angest Also hier, Danz Gaming hat ja auch, der streamt ja auch nur irgendwas mit 6, 6-7 Mbit Also der kriegt auch nicht mehr Was muss ich denn hier machen, jetzt? Ich muss wieder den, den Scoop Ball Grill kaputt machen Pretty flower, I wonder happens when you get closer Das wollen wir mal ausprobieren Die Pipe sackt Also ich vermute mal, was ich jetzt machen muss, ist hier einfach hochbauen Bis, bis, bis das Scoop Ball Grill hier oben in den Häcksler gesaugt wird Dann fallen die Scoop Balls hier runter Und hier unten durch So stelle ich mir das gerade vor Mal gucken, ob das so funktioniert Oh, da muss ich aufpassen, dass es jetzt runterfällt Ja, da muss man aufpassen Pass auf, ooooh Da muss man aufpassen Nein, nein, nicht runterfallen Nein, nein, nicht runterfallen Ok, bauen wir jetzt erstmal hier so einen Rand, dass er nicht mehr runterfallen kann So Dann hier neben hoch Weiß nicht, ob das sinnvoll ist, was ich hier mache Ich weiß noch gar nicht so genau, was Was macht denn die Plume da? Ich probiere erstmal das Scoop Ball Das Scoop Ball Grill Jo, oh, oh, fuck Knapp, knapp, knapp Weiter hoch zu heben Ok, und du? Ich bin mir jetzt so ganz sicher, ob das stimmt, was ich hier mache, ehrlich gesagt So, ich meine, jetzt kann ja eigentlich nichts mehr passieren, wenn ich das so baue, ne? Ok, jetzt gehen wir voll Gas Und schleudern sie hier raus Ok, oder auch nicht Wir haben doch nicht immer so viele Balls Ein Ball haben wir noch Achtung Leute Volle Pulle Jawoll Yeah Jetzt schreckt Ok, das funktioniert Und jetzt muss ich nach da unten Was ja eigentlich heißt, ich muss den ganzen Scheiß hier abbauen Wobei jetzt, nein, jetzt muss ich wahrscheinlich einfach zur Plume hin Jawoll 900 IQ Plays Bloop Blooper Zwar too easy Ja, es kann ja auch verstehen Also ich würde mir wünschen, dass Twitch generell ein bisschen an Also irl ist das eine ich fände es gut wenn die an creative arbeiten Weil es gibt viele leute die Ich sag mal so gehen wir von dem stream aus die ich gestern gemacht es gibt viele leute die programmieren irgendwas was mit sicherheit auch Mehr leute interessiert als die vier fünf sachen die es jetzt halt zufällig gerade in creative finden oder leute die malen irgendwas die keine ahnung die die falten irgendwelche krassen papierfiguren die basteln irgendwas Es gibt kennt ihr den den dings hier den piano im pro man Das ist auch übelst geil gucken teilweise nur 30 leute zu oder beißt es ist mega nice ja der piano im pro man Dann, mal gucken ob der überhaupt online ist quasi gerade Dann haust wenn er nämlich nachhör der piano im pro man Ja sogar online das ist mega nice und das kommt kaum einer man kann 27 leute zu Also die ich ich fände es gut wenn twitch an creative arbeitet noch Oder im irl und creative verschmilzt weil ich meine du brauchst du brauchst nicht talkshow irl creative Programming das muss ja eigentlich alles sein Entweder machen sie warum sollte programming nicht für irl sein Beauty und die elektrische tentacle Wie heißt das zu piano im pro man Ich hauste den nachher ich hauste den nachher da ist übelst geil natürlich Wow, was ist das? Wiederein kuhball grill Story ist doch ist story intensifies Okay wir müssen wieder irgendwelche dinger bauen Ich vermute mal ich muss das ich muss den den grillball hier hochheben Ja Ja Ja Ja Ja Okay, das sieht nicht so schwierig aus bis jetzt wo ich sagen wir müssen hier einfach rüber und dann Und dann dass das das Das grill hier wieder in den häcksler werfen und dann sollte das soll das tun Oh das sagt ich muss gleich auf gleich pennen überhaupt kein bock Oh wir müssen mal ein bisschen lofball aus zack komm her Okay, okay, okay Okay, okay, okay Okay, okay, okay Okay, okay, okay Okay, okay, okay eigentlich eigentlich haben wir es jetzt ja mehr oder weniger So ist das was hier rüber rollen So nicht aber fast Ja genau, so Ich dachte ja mal tief wir fangen erst um neun an Ich kann ich kann fast anfangen wann ich will solange Solange der empfang auf ist selbst dann könnte ich mit der karte ins haus Ich mein ich wahrscheinlich würde sich irgendwann mal die personal abteilung melden wenn ich stundenlang oder tage ist nicht stundenlang tagelang Um drei uhr oder so das glaube ich nicht dass das so gehen würde aber ich kann ohne probleme schon um kurz vor sieben anfangen Das hat einen großen vorteil wenn ich kurz nach sieben da bin Da ich an 15 uhr durch 19 min den großen Vorteil, wenn ich kurz nach 7 da bin, dass ich dann 15 Uhr wieder abhauen kann. Kurz nach 15 Uhr. Das ist natürlich sehr, sehr nice. Jetzt. Jetzt noch ein Bug, jetzt ein Feature. Hä? Machst du kein Mitter? Doch, in der Arbeitszeit habe ich eine halbe Stunde Mittagspause mit drin. Also die muss ich nehmen, da bleibt mir nichts anderes übrig. Muss ich jetzt hier unten abbauen? Ich glaube nicht, dass das so gedacht ist, wie ich das gerade gemacht habe. Ah, so ist das gedacht. Aha. Fuck, ich bin dumm, ich muss das oben vorher abmachen. Oops, was sind das? Ah, jetzt funktioniert es. Okay, Leute, es ist 1.30 Uhr. Das war heute leider ein etwas kürzerer Stream als gestern. Gestern war er übertrieben lang, gestern waren 8 Stunden. Oder, ich guck mal, 7,5 Stunden gestern. Heute haben wir es nur auf 2 gebracht. Ich muss aber leider Schluss machen. Wer noch nicht auf YouTube gewesen ist und mal ein Video geguckt hat, kann sich ja mal... Was? The Whistle. Also ich kann jetzt pfeifen. Ja, wer noch nicht mal ein Video geguckt hat, kann sich ja mal YouTube reinschauen. Wer jetzt nur hier über Twitch dabei ist, ihr könnt auch mal ein Video gucken. Wer jetzt nur hier über Twitch dabei ist, ich freue mich natürlich über Follows auf allen möglichen Seiten. Natürlich erstmal hier auf Twitch, auf Twitter, auf YouTube. Das Einzige, wo ich keinen Bock drauf habe, ist Facebook. Auch wenn ich Facebook... Ich habe zwar einen Facebook-Account, den habe ich aber nur, um ihn zu haben. Ich finde, Facebook ist die beschissenste Social-Media-Plattform von allen. Ja. Ich hoffe, euch hat es gefallen. Und wir machen ja einen Schluss. Dann sehen wir uns wahrscheinlich morgen. Bis dann, machts gut, tschüss. Die Sendung wurde vom NDR live untertitelt. Die Sendung wurde vom NDR live untertitelt. Die Sendung wurde vom NDR live untertitelt. Diese Sendung wurde vom NDR live untertitelt. Diese Sendung wurde vom NDR live untertitelt. Die Sendung wurde von NDR live untertitelt. Diese Sendung wurde vom NDR live untertitelt. Die Sendung wurde vom NDR live untertitelt. Diese Sendung wurde vom NDR live untertitelt. Die Sendung wurde vom NDR live untertitelt. Die Sendung wurde von NDR live untertitelt. Die Sendung wurde vom NDR live untertitelt.", "segments": [{"id": 1, "start": 60.0, "end": 85.2, "text": "Hallo, schon jemand da?"}, {"id": 2, "start": 85.2, "end": 111.2, "text": "Oh, wisst ihr was ich sehe? Twitch ist wieder der Meinung, ich habe keine Qualitätsoptionen heute und heute sind es 720p, 60 fps, ich habe das Gefühl Twitch hat da irgendwas geändert, weil ich hatte früher immer, immer Quality Optionen und in letzter Zeit immer nur Source oder Auto, ich weiß nicht was da los ist."}, {"id": 3, "start": 111.2, "end": 132.2, "text": "Ich hatte jetzt zwei Monate lang immer Quality Optionen, immer, aber jetzt nicht und ich weiß nicht warum ehrlich zu sein."}, {"id": 4, "start": 132.2, "end": 159.2, "text": "Ich meine, habe ich zu hohe Bitrate? Ich kann nicht, ich habe nichts geändert."}, {"id": 5, "start": 159.2, "end": 164.2, "text": "Ich wollte gerade sagen, ich habe zu hohe, ich kann nicht zu hohe Bitrate haben, ich habe nichts getan, hat sich, ne?"}, {"id": 6, "start": 164.2, "end": 174.2, "text": "Ich gucke mir das jetzt gerade mal an, Video Statistik anzeigen, ja exakt, so mal kann das sein, dass man das nicht mal angezeigt kriegt."}, {"id": 7, "start": 174.2, "end": 195.2, "text": "Leute, kann, kriegt ihr noch, wenn ihr, wenn ihr euch die Video Statistik anzeigen lasst, ne, von meinem Video, kriegt ihr da noch angezeigt, wie viel Bitrate das ist, das steht bei mir jetzt gar nicht mehr drinnen."}, {"id": 8, "start": 195.2, "end": 207.2, "text": "Warum, wo ist das hin? Show Video Stats, ja das zeigt, das zeigt bei mir nichts mehr an."}, {"id": 9, "start": 207.2, "end": 234.2, "text": "Das zeigt, das zeigt bei mir, nein doch Playback Rate, Playback Rate, ah ja, ich musste mal richtig gucken, doch Playback Rate steht da, ich glaube Playback Rate ist, ist das?"}, {"id": 10, "start": 234.2, "end": 250.2, "text": "Ach auf Deutsch heißt das Speicherauslastung, ok, weil dann haben sie das einfach nur falsch übersetzt, weil wenn ich mir das auf Englisch im Browser angucke heißt das Playback Rate 6000 Kilobits, also das passt, das habe ich auch genau eingestellt."}, {"id": 11, "start": 250.2, "end": 265.2, "text": "Das muss, oh ich muss mein Bot noch einstellen, mein Bot ist immer noch der Meinung, ich bin heute ziemlich im Arsch, das bin ich zwar auch, aber das, ach komm ich lasse den Text jetzt einfach drinnen stehen, scheiß drauf."}, {"id": 12, "start": 265.2, "end": 292.2, "text": "Ich würde dir gerne ein Google Drive Link für Gameplay zukommen lassen, aber halt nicht öffentlich, also per DN oder so ähnlich, du kannst mir das per YouTube PM schicken oder per Business E-Mail oder per Twitch PM, keine Ahnung, am liebsten eigentlich per YouTube PM."}, {"id": 13, "start": 292.2, "end": 305.2, "text": "So, dann würde ich mal sagen, nochmal den Text weg."}, {"id": 14, "start": 305.2, "end": 326.2, "text": "Hallo Romanjo, wir spielen heute mal ein Puzzle Game, was ich schon immer mal spielen wollte, was ich seit 2000, ach ich weiß es nicht, 2000, Moment, man kann das doch in Steam nachgucken, seit wann ich das in der Bibliothek habe oder runtergeladen, ne sieht man nicht mehr."}, {"id": 15, "start": 326.2, "end": 348.2, "text": "Keine Ahnung, gefühlt seit 8 Jahren oder so auf Steam hab, das Game kam raus 2008, ich hab das schon ewig auf Steam, ich wollte das schon immer mal spielen und ich hab es nie über den ersten 2-3 Levels raus geschafft, obwohl es nicht wirklich schwierig ist."}, {"id": 16, "start": 348.2, "end": 363.2, "text": "Aber ich dachte mir, das ist ein wunderbares Game für Livestream, weil ich kann Chat lesen und wir können schwätzen."}, {"id": 17, "start": 363.2, "end": 380.2, "text": "Obwohl es hat kein Zeitlimit oder sowas."}, {"id": 18, "start": 380.2, "end": 383.2, "text": "Das ist ein super entspanntes Puzzle Game."}, {"id": 19, "start": 383.2, "end": 394.2, "text": "Ich hau nicht, dass ich es zu laut hab, ne das passt so ne."}, {"id": 20, "start": 394.2, "end": 397.2, "text": "Find den Button für YouTube PM nicht."}, {"id": 21, "start": 397.2, "end": 408.2, "text": "Ich weiß mittlerweile gar nicht mehr wie das funktioniert."}, {"id": 22, "start": 408.2, "end": 415.2, "text": "Ok, das erste sind ein paar Tutorial Levels, das ist das easy Mode."}, {"id": 23, "start": 415.2, "end": 418.2, "text": "Jetzt kriegt natürlich jeder hin."}, {"id": 24, "start": 418.2, "end": 422.2, "text": "Und ich hab es wie gesagt, ich hab nur die ersten paar Levels je gespielt, ich wollte das schon immer mal spielen."}, {"id": 25, "start": 422.2, "end": 428.2, "text": "Das gilt ja so als eines der coolsten Puzzle Games überhaupt."}, {"id": 26, "start": 428.2, "end": 432.2, "text": "Max, was hältst du eigentlich von den ganzen IT-Consulting Firmen?"}, {"id": 27, "start": 432.2, "end": 444.2, "text": "In welchem Bereich oder meistens so generell, dass sich jeder irgendwie Junior-Consultant auf die Fahne schreibt?"}, {"id": 28, "start": 444.2, "end": 452.2, "text": "Naja, die meisten Consultants kannst du erstmal in die Tonne kloppen."}, {"id": 29, "start": 452.2, "end": 458.2, "text": "Was viele dort können ist, die können sich gut verkaufen."}, {"id": 30, "start": 458.2, "end": 475.2, "text": "Aber Leute, die wirklich Ahnung haben, sind da recht rar gesehen."}, {"id": 31, "start": 475.2, "end": 479.2, "text": "Steht noch auf dem Schild drauf."}, {"id": 32, "start": 479.2, "end": 483.2, "text": "Ok, ich muss zur Pipe rüber, zum Rohr."}, {"id": 33, "start": 483.2, "end": 494.2, "text": "Das hätte ich mir aber auch so überlegt."}, {"id": 34, "start": 494.2, "end": 500.2, "text": "Ok, die ersten Levels sind ja immer einfach bei sowas."}, {"id": 35, "start": 500.2, "end": 504.2, "text": "Das wird doch mal bestimmt ziemlich schnell ziemlich schwer."}, {"id": 36, "start": 504.2, "end": 507.2, "text": "Ah, da Sebaro ist auch da."}, {"id": 37, "start": 507.2, "end": 509.2, "text": "Moin."}, {"id": 38, "start": 509.2, "end": 514.2, "text": "Sebaro hat gefragt, wie mein Tag war. Ich muss sagen, relativ entspannend."}, {"id": 39, "start": 514.2, "end": 517.2, "text": "Ich war ja heute nicht arbeiten."}, {"id": 40, "start": 517.2, "end": 520.2, "text": "Es ist ja Montag. Gehe ich in die Arbeit."}, {"id": 41, "start": 520.2, "end": 525.2, "text": "Deswegen war es heute entspannend. Ich war im Bauhaus."}, {"id": 42, "start": 525.2, "end": 530.2, "text": "Und habe noch mal für das Hoftor Wellen, wie heißt das?"}, {"id": 43, "start": 530.2, "end": 543.2, "text": "So Wellen aus durchsichtigem Plastik gekauft."}, {"id": 44, "start": 543.2, "end": 546.2, "text": "Kann ich dann nämlich hinter das Hoftor machen."}, {"id": 45, "start": 546.2, "end": 552.2, "text": "Und dann kann die Katze, die ich mir hole, nicht durchs Hoftor klettern."}, {"id": 46, "start": 552.2, "end": 557.2, "text": "Meine alte Katze konnte auch so nicht durchs Hoftor klettern, weil die war einfach zu alt und ungelenkig dafür."}, {"id": 47, "start": 557.2, "end": 561.2, "text": "Aber wenn ich jetzt mir eine neue Katze hole oder zwei neue Katzen,"}, {"id": 48, "start": 561.2, "end": 566.2, "text": "dann habe ich Angst, dass die quasi das Hoftor hochgehen und dann durchs Hoftor klettern,"}, {"id": 49, "start": 566.2, "end": 569.2, "text": "weil das Hoftor hat halt relativ große Löcher drin."}, {"id": 50, "start": 569.2, "end": 572.2, "text": "Dann mache ich jetzt die Platten dahinter. Das ist halt glatt."}, {"id": 51, "start": 572.2, "end": 575.2, "text": "Da kann keine Katze hochklettern."}, {"id": 52, "start": 575.2, "end": 590.2, "text": "Und dann sind die halt da."}, {"id": 53, "start": 590.2, "end": 596.2, "text": "Was gerade die Management Consulting Firmen sind bei Arbeitnehmern ja nicht gern gesehen."}, {"id": 54, "start": 596.2, "end": 602.2, "text": "Gehen in eine Firma, reinschmeißen die Hälfte raus, das ganze Konzept durcheinander oder verschwinden."}, {"id": 55, "start": 602.2, "end": 606.2, "text": "Es kommt drauf an, in welchem Bereich die sind."}, {"id": 56, "start": 606.2, "end": 613.2, "text": "Wenn man sich für irgendwas, wo die Firma sagt, wollen wir uns nicht selbst darum kümmern oder irgendwas,"}, {"id": 57, "start": 613.2, "end": 619.2, "text": "wo wir keine Ahnung von haben und wir holen uns irgendeinen, der sich das auskennt, jemand holt, das ist überhaupt nichts Schlimmes dabei."}, {"id": 58, "start": 619.2, "end": 625.2, "text": "Das Problem ist eher, dass die meisten Consulting-Leute halt einfach schwätzer sind."}, {"id": 59, "start": 625.2, "end": 633.2, "text": "Wir hatten mal auf der Arbeit, hatten wir mal Consulting-Typen da aus den USA,"}, {"id": 60, "start": 633.2, "end": 639.2, "text": "von irgendeiner Firma, die sich mit so Cloud-Gedöns auskennt, ich will jetzt den Namen nicht sagen."}, {"id": 61, "start": 639.2, "end": 644.2, "text": "Und die haben ab dem zweiten Tag, also sie waren den ersten Tag da, haben was gemacht."}, {"id": 62, "start": 644.2, "end": 649.2, "text": "Und den zweiten Tag haben sie festgestellt, oh, wir sind ja quasi so mitten in Frankfurt,"}, {"id": 63, "start": 649.2, "end": 653.2, "text": "da können wir jetzt mal alle möglichen German-Spezialitäten ausprobieren."}, {"id": 64, "start": 653.2, "end": 659.2, "text": "Und haben sich dann ab Mittags, dem zweiten Tag nur noch German-Bier reingehauen und waren eigentlich zunächst mal zu gebrauchen."}, {"id": 65, "start": 659.2, "end": 663.2, "text": "Das hat sich natürlich nicht gelohnt, ne?"}, {"id": 66, "start": 663.2, "end": 668.2, "text": "Tofu? Morgen Max, wie geht's? Oh, mir geht's gut."}, {"id": 67, "start": 668.2, "end": 673.2, "text": "Wie gesagt, ich muss heute nicht arbeiten gehen."}, {"id": 68, "start": 673.2, "end": 683.2, "text": "Naja, ich muss wahrscheinlich hier mich runterhängen lassen, ne?"}, {"id": 69, "start": 683.2, "end": 691.2, "text": "Aufwachen!"}, {"id": 70, "start": 691.2, "end": 696.2, "text": "Gutes Video von Anderviren-Softer, THX."}, {"id": 71, "start": 696.2, "end": 705.2, "text": "Oh, da müssen wir uns ein bisschen aufpassen."}, {"id": 72, "start": 705.2, "end": 709.2, "text": "Konnte man die Bälle nicht irgendwie wieder abmachen?"}, {"id": 73, "start": 709.2, "end": 718.2, "text": "Ne, das ging, das ging mit anderen."}, {"id": 74, "start": 718.2, "end": 729.2, "text": "Ich glaube, meine Baukunste erreichen hier schnell ihr Limit in dem Game."}, {"id": 75, "start": 729.2, "end": 734.2, "text": "Hey Max, was war dein größter Scam deines Lebens, wo du gescampt wurdest?"}, {"id": 76, "start": 734.2, "end": 739.2, "text": "Wo du richtig scamaßt wurdest. Oh, da muss ich mir mal Gedanken drüber machen."}, {"id": 77, "start": 739.2, "end": 745.2, "text": "Das größte, wo ich beschissen wurde."}, {"id": 78, "start": 745.2, "end": 748.2, "text": "Ich weiß, mir fällt's nicht ein."}, {"id": 79, "start": 748.2, "end": 750.2, "text": "Mir fällt das jetzt nicht ein."}, {"id": 80, "start": 750.2, "end": 755.2, "text": "Also, wo ich mich richtig verarscht, wo ich mir richtig verarscht vorkam,"}, {"id": 81, "start": 755.2, "end": 758.2, "text": "das ist aber bestimmt nicht der größte Scamaß meines Lebens,"}, {"id": 82, "start": 758.2, "end": 764.2, "text": "wo ich mir richtig verarscht vorkam, war bei meinem neuen Unity-Media-Anschluss,"}, {"id": 83, "start": 764.2, "end": 771.2, "text": "als ich DualStack Live bekommen habe."}, {"id": 84, "start": 771.2, "end": 775.2, "text": "Das war die größte Verarschung, was providermäßig besser so passiert ist."}, {"id": 85, "start": 775.2, "end": 782.2, "text": "Damals war es ja so, damals konntest du, wenn du ein Handy hattest bei der Telekom,"}, {"id": 86, "start": 782.2, "end": 786.2, "text": "also bei, weiß ich nicht, ob die mobile hießen damals,"}, {"id": 87, "start": 786.2, "end": 792.2, "text": "also mein Handy hatte da in diesem Telekom-Netz, die hatten damals mobil keine IPv6-Adressen."}, {"id": 88, "start": 792.2, "end": 797.2, "text": "Und ich hatte keine Möglichkeit, mich vom Handy mehr daheim einzuloggen."}, {"id": 89, "start": 797.2, "end": 802.2, "text": "Was ich regelmäßig benutzt hab, ich hab VPN angemacht auf dem Handy,"}, {"id": 90, "start": 802.2, "end": 806.2, "text": "hab dann Mails daheim gelesen, hab mir irgendwelche Sachen gesunken, alles."}, {"id": 91, "start": 806.2, "end": 809.2, "text": "Und das ging dann auf einmal nicht mehr, weil die Unity-Media der Meinung war,"}, {"id": 92, "start": 809.2, "end": 811.2, "text": "wir machen DualStack Live."}, {"id": 93, "start": 811.2, "end": 816.2, "text": "Aber was war so der größte Scamaß, ich weiß es nicht."}, {"id": 94, "start": 816.2, "end": 824.2, "text": "Größte Scamaß."}, {"id": 95, "start": 824.2, "end": 834.2, "text": "Wow, was ist das?"}, {"id": 96, "start": 834.2, "end": 844.2, "text": "What the fuck?"}, {"id": 97, "start": 844.2, "end": 852.2, "text": "Ich wusste gar nicht, was das Spiel das Story hat."}, {"id": 98, "start": 852.2, "end": 857.2, "text": "Hat sich mal ein Freund versucht zu Scamasen?"}, {"id": 99, "start": 857.2, "end": 860.2, "text": "Ich hab keine Freunde."}, {"id": 100, "start": 860.2, "end": 867.2, "text": "Naja, also ich hab nicht viele Freunde."}, {"id": 101, "start": 867.2, "end": 877.2, "text": "Keine Ahnung, ich überleg grad, was hab ich, ich glaube, ihr kennt sogar alle meine Freunde."}, {"id": 102, "start": 877.2, "end": 880.2, "text": "Oder? Lass mal überlegen."}, {"id": 103, "start": 880.2, "end": 884.2, "text": "Ich hab mit dem Fabian hab ich natürlich schon Videos gemacht."}, {"id": 104, "start": 884.2, "end": 889.2, "text": "Der Karsten, also sprich der MasterKröber, der war auch ab und zu mal in Videos."}, {"id": 105, "start": 889.2, "end": 899.2, "text": "Der Felix, mit dem ich meine Ausbildung gemacht hab, war auch schon mal in einem Video dabei."}, {"id": 106, "start": 899.2, "end": 902.2, "text": "Ansonsten, wie gesagt, ich hab relativ wenig Freunde."}, {"id": 107, "start": 902.2, "end": 914.2, "text": "In der Schule hatte ich ein bisschen mehr, nicht wirklich viel mehr Freunde."}, {"id": 108, "start": 914.2, "end": 922.2, "text": "Aber so Scamaß?"}, {"id": 109, "start": 922.2, "end": 928.2, "text": "Ja, der Kabum, aber der hat mich auch nicht Scamaß."}, {"id": 110, "start": 928.2, "end": 933.2, "text": "Wobei, in der Schule, das war nicht so wirklich Scamaß."}, {"id": 111, "start": 933.2, "end": 938.2, "text": "Ich hatte zwei Kommos in der Schule, den hab ich mir super verstanden."}, {"id": 112, "start": 938.2, "end": 942.2, "text": "Der eine ging ursprünglich auf eine andere Schule als ich."}, {"id": 113, "start": 942.2, "end": 950.2, "text": "Und irgendwann ist der gewechselt auf meine Schule und hat sich zum übelsten Spaß entwickelt."}, {"id": 114, "start": 950.2, "end": 952.2, "text": "Mit dem wollte ich da nichts mehr zu tun haben."}, {"id": 115, "start": 952.2, "end": 957.2, "text": "Aber der hatte dann halt die ganzen Deppen bei mir auf der Schule, die hatten wohl irgendwie schlechten Einfluss auf ihn."}, {"id": 116, "start": 957.2, "end": 959.2, "text": "Da hat sich zum übelsten Spaß entwickelt."}, {"id": 117, "start": 959.2, "end": 963.2, "text": "Und der andere, vor allem das geile war, das kennt ihr wahrscheinlich auch,"}, {"id": 118, "start": 963.2, "end": 967.2, "text": "als ich noch in der Schule war, bzw. noch ein bisschen jünger war,"}, {"id": 119, "start": 967.2, "end": 971.2, "text": "oder vielleicht seid ihr noch in der Schule, man hat irgendwelche Freunde."}, {"id": 120, "start": 971.2, "end": 973.2, "text": "Und die bringt man auch ab und zu mit heim."}, {"id": 121, "start": 973.2, "end": 977.2, "text": "Und mein Opa, der hat dann immer gesagt, wenn er da meine beiden Kumpels gesehen hat,"}, {"id": 122, "start": 977.2, "end": 985.2, "text": "die werden es aber voll noch zu was bringen, weil die gute Noten geschrieben haben und so was in der Richtung."}, {"id": 123, "start": 985.2, "end": 989.2, "text": "Man wollte mir damit quasi sagen, so nach dem Motto, die bringen es ja zu viel mehr als ich,"}, {"id": 124, "start": 989.2, "end": 991.2, "text": "weil die viel bessere Noten schreiben und so was."}, {"id": 125, "start": 991.2, "end": 993.2, "text": "Soll ich euch mal was sagen?"}, {"id": 126, "start": 993.2, "end": 998.2, "text": "Die haben es alle beide komplett verschissen, was das angeht."}, {"id": 127, "start": 998.2, "end": 1001.2, "text": "Aber wie gesagt, der eine, mit dem ich mich da eigentlich am besten verstanden habe,"}, {"id": 128, "start": 1001.2, "end": 1007.2, "text": "als er noch auf die andere Schule gegangen ist, der, okay, oh Gott, wie funktioniert das hier jetzt?"}, {"id": 129, "start": 1007.2, "end": 1013.2, "text": "Der hat sich zum übelsten Spaß entwickelt, als er dann zu mir auf die Schule gegangen ist."}, {"id": 130, "start": 1013.2, "end": 1018.2, "text": "Aber bei mir gab es auch noch viel Spaß."}, {"id": 131, "start": 1018.2, "end": 1024.2, "text": "Und ich glaube nicht, dass es so gedacht ist, wie ich das hier mache, oder?"}, {"id": 132, "start": 1024.2, "end": 1027.2, "text": "Moment."}, {"id": 133, "start": 1027.2, "end": 1032.2, "text": "Ich glaube, ich sollte hier noch einen hinbauen."}, {"id": 134, "start": 1032.2, "end": 1037.2, "text": "Ah, so ist es besser."}, {"id": 135, "start": 1037.2, "end": 1043.2, "text": "So, und der andere hat dann wiederum die Schule gewechselt und ist irgendwo anders hingezogen."}, {"id": 136, "start": 1043.2, "end": 1047.2, "text": "Und irgendwann kam er wieder und war auch der übelste Spaß."}, {"id": 137, "start": 1047.2, "end": 1056.2, "text": "Also insofern habe ich eigentlich auch keine Freunde bei unserer Schule."}, {"id": 138, "start": 1056.2, "end": 1059.2, "text": "Oh, knapp. Oh, das ist knapp. Das ist richtig knapp."}, {"id": 139, "start": 1059.2, "end": 1065.2, "text": "Wenn das jetzt da reingeht, dann bricht es auseinander."}, {"id": 140, "start": 1065.2, "end": 1069.2, "text": "Und also von meinen Freunden habe ich so, wie ich jetzt, also wenn ich jetzt, mir fällt jetzt nichts ein,"}, {"id": 141, "start": 1069.2, "end": 1074.2, "text": "das wurde ich doch nicht so richtig verarscht."}, {"id": 142, "start": 1074.2, "end": 1078.2, "text": "Ich überlege gerade, ich meine, jetzt wurde ja schon jeder ein bisschen, wurde ja schon jeder gescampt."}, {"id": 143, "start": 1078.2, "end": 1085.2, "text": "Ich muss, ich mache mir gerade echt Gedanken, was war denn das, wo ich bisher am meisten mal gescampt wurde von irgendwas?"}, {"id": 144, "start": 1085.2, "end": 1089.2, "text": "Zwei englische Mädels außen vor, die einem komische Dinge erzählt haben, was da nicht so war,"}, {"id": 145, "start": 1089.2, "end": 1093.2, "text": "aber das ist ja nicht, das ist ja nicht Scam."}, {"id": 146, "start": 1093.2, "end": 1097.2, "text": "Was? Wo wurde ich mal gescampt so richtig?"}, {"id": 147, "start": 1097.2, "end": 1104.2, "text": "Ich muss mir da mal Gedanken zumachen, fällt mir gerade nichts ein."}, {"id": 148, "start": 1104.2, "end": 1111.2, "text": "Wahrscheinlich wisst ihr das besser, weil ich das mal in einem Video erzählt habe und jetzt gar nicht dran denke."}, {"id": 149, "start": 1111.2, "end": 1116.2, "text": "Hey, hast du, hast auf Twitch eine Pen mit dem Google Drive Link erhalten?"}, {"id": 150, "start": 1116.2, "end": 1122.2, "text": "Auf Twitch? Ich weiß gar nicht, wie man auf Twitch meint."}, {"id": 151, "start": 1122.2, "end": 1128.2, "text": "Ich weiß gar nicht, wie man auf Twitch Messages sich anguckt, fällt mir gerade auf."}, {"id": 152, "start": 1128.2, "end": 1132.2, "text": "Wie kriege ich mir auf Twitch Messages?"}, {"id": 153, "start": 1132.2, "end": 1139.2, "text": "Warte mal, Dashboard?"}, {"id": 154, "start": 1139.2, "end": 1143.2, "text": "Ich weiß nicht, wo man Messages sich anguckt auf Twitch."}, {"id": 155, "start": 1143.2, "end": 1150.2, "text": "Wo geht denn das?"}, {"id": 156, "start": 1150.2, "end": 1157.2, "text": "Video Manager? Nach Nachrichten, da ist es ja."}, {"id": 157, "start": 1157.2, "end": 1162.2, "text": "Angeblich habe ich keine Messages erhalten, Eingang, nichts."}, {"id": 158, "start": 1162.2, "end": 1165.2, "text": "Sonstiges? Sonstiges?"}, {"id": 159, "start": 1165.2, "end": 1168.2, "text": "Twitch, please, was ist denn das für eine Logik?"}, {"id": 160, "start": 1168.2, "end": 1172.2, "text": "Bei Twitch hat man unter Messages Eingang, Ausgang, sonstiges"}, {"id": 161, "start": 1172.2, "end": 1178.2, "text": "und jetzt ratet mal, Chat, ratet mal in welchem Ort eine neue Message landet."}, {"id": 162, "start": 1178.2, "end": 1184.2, "text": "Eingang, Ausgang oder sonstiges?"}, {"id": 163, "start": 1184.2, "end": 1194.2, "text": "Der Bot schreibt ein sinnloses Zeug, das ist noch von gestern."}, {"id": 164, "start": 1194.2, "end": 1198.2, "text": "Aber das Ganze ist mal aufzuklären, die Message von ihm ist in sonstiges gelandet."}, {"id": 165, "start": 1198.2, "end": 1214.2, "text": "Also nicht Eingang oder so, wie man das erwarten würde."}, {"id": 166, "start": 1214.2, "end": 1221.2, "text": "Ich habe unter sonstiges sogar mittlerweile einige PNs, die habe ich alle überhaupt mit gesehen."}, {"id": 167, "start": 1221.2, "end": 1235.2, "text": "WTF?"}, {"id": 168, "start": 1235.2, "end": 1238.2, "text": "Ist auch geil, wer guckt denn bitte schön in sonstiges?"}, {"id": 169, "start": 1238.2, "end": 1245.2, "text": "Was ist das für ein Schwachsinn wieder?"}, {"id": 170, "start": 1245.2, "end": 1253.2, "text": "Okay, aber ich habe es gekriegt, die PN, alles gut."}, {"id": 171, "start": 1253.2, "end": 1255.2, "text": "Sonstiges normal, ja."}, {"id": 172, "start": 1255.2, "end": 1266.2, "text": "Ich muss mal meinem Bot beibringen, dass er nicht so komische Dinger schreibt, Moment."}, {"id": 173, "start": 1266.2, "end": 1269.2, "text": "Okay, Nightbot."}, {"id": 174, "start": 1269.2, "end": 1273.2, "text": "Wo ist der Nightbot? Hier ist der Nightbot."}, {"id": 175, "start": 1273.2, "end": 1281.2, "text": "Nightbot Timers, da ändern wir jetzt mal den Text."}, {"id": 176, "start": 1281.2, "end": 1291.2, "text": "Add Wupplos, wenn ich etwas übersehe, dann."}, {"id": 177, "start": 1291.2, "end": 1296.2, "text": "So, ich habe den Bottext mal geupdatet."}, {"id": 178, "start": 1296.2, "end": 1304.2, "text": "BDO-Frage, kann man, was kann mir ein Crystal für Arm, Moor, Claymant und kann zwischen Gathering, Fishing, Training und Processing auswählen?"}, {"id": 179, "start": 1304.2, "end": 1309.2, "text": "Was für ein Anfang, kein Schimmer."}, {"id": 180, "start": 1309.2, "end": 1325.2, "text": "Ich sage doch, ich bin der best ausgerüstete BDO-Noob, ich habe von dem Gewapp keine Ahnung."}, {"id": 181, "start": 1325.2, "end": 1331.2, "text": "Was denkst du über die Sicherheit von Online-Banking?"}, {"id": 182, "start": 1331.2, "end": 1336.2, "text": "Gerade mit Mobile-Tan und Banking-App auf einem Handy sehe ich das doch etwas kritischer."}, {"id": 183, "start": 1336.2, "end": 1339.2, "text": "Ich auch."}, {"id": 184, "start": 1339.2, "end": 1345.2, "text": "Da kann ich dazu nicht sagen."}, {"id": 185, "start": 1345.2, "end": 1353.2, "text": "Man darf nicht vergessen, die ganzen Scamas-Leute sind halt immer sehr kreativ."}, {"id": 186, "start": 1353.2, "end": 1358.2, "text": "Moment, was muss ich hier überhaupt machen?"}, {"id": 187, "start": 1358.2, "end": 1363.2, "text": "Ah, das sind die Dinger, die man wieder wegmachen kann."}, {"id": 188, "start": 1363.2, "end": 1366.2, "text": "New Go Balls."}, {"id": 189, "start": 1366.2, "end": 1369.2, "text": "Ah, ich glaube, ich habe jetzt gecheckt, wie das funktioniert."}, {"id": 190, "start": 1369.2, "end": 1372.2, "text": "Ich muss hier nach oben bauen."}, {"id": 191, "start": 1372.2, "end": 1375.2, "text": "Ups, so war das jetzt nicht gedacht, wie ich das gemacht habe."}, {"id": 192, "start": 1375.2, "end": 1381.2, "text": "Ich muss das hier nach oben bauen, dann kann ich hier unten abmachen."}, {"id": 193, "start": 1381.2, "end": 1388.2, "text": "So."}, {"id": 194, "start": 1388.2, "end": 1390.2, "text": "Moment, ich glaube, ich mache das aber falsch."}, {"id": 195, "start": 1390.2, "end": 1401.2, "text": "Kann ich das Ding nicht irgendwie an die Wand sticken lassen?"}, {"id": 196, "start": 1401.2, "end": 1408.2, "text": "Ball, Ball, geh weg!"}, {"id": 197, "start": 1408.2, "end": 1428.2, "text": "Das bleibt nicht an der Wand hängen, ne?"}, {"id": 198, "start": 1428.2, "end": 1437.2, "text": "Ich lebe nicht so wirklich an der Wand, das wird doch niemals was, wenn das da abgeht."}, {"id": 199, "start": 1437.2, "end": 1443.2, "text": "Ich glaube, meine Baukünste fehlen gerade."}, {"id": 200, "start": 1443.2, "end": 1445.2, "text": "Das klebt da gar nicht dran an der Wand."}, {"id": 201, "start": 1445.2, "end": 1448.2, "text": "Warum klebt das nicht an der Wand?"}, {"id": 202, "start": 1448.2, "end": 1451.2, "text": "Ach so, doch, funktioniert doch."}, {"id": 203, "start": 1451.2, "end": 1460.2, "text": "Easy."}, {"id": 204, "start": 1460.2, "end": 1463.2, "text": "Oh, ich sehe schon, das Spiel wird gefummelt."}, {"id": 205, "start": 1463.2, "end": 1473.2, "text": "Aber ich wollte es ja so."}, {"id": 206, "start": 1473.2, "end": 1488.2, "text": "Ich gucke gleich den Chat, falls ich was übersehen habe."}, {"id": 207, "start": 1488.2, "end": 1501.2, "text": "Oh, ich habe Angst, dass das gleich abbricht."}, {"id": 208, "start": 1501.2, "end": 1504.2, "text": "Was, nur zwei Stück? Das geht aber besser."}, {"id": 209, "start": 1504.2, "end": 1509.2, "text": "Ich kann das hier noch abmachen, das hier noch abmachen."}, {"id": 210, "start": 1509.2, "end": 1514.2, "text": "Das da, das da, das da, das da."}, {"id": 211, "start": 1514.2, "end": 1531.2, "text": "Okay, aber wir haben es gepackt, neun von zwei, easy."}, {"id": 212, "start": 1531.2, "end": 1534.2, "text": "Ja, Sebaro, frag mal den Frisör."}, {"id": 213, "start": 1534.2, "end": 1542.2, "text": "Heute kommt der Mercy-Nerf? Oh, nice."}, {"id": 214, "start": 1542.2, "end": 1545.2, "text": "Nice, ich freue mich ja, muss ich ehrlich sagen."}, {"id": 215, "start": 1545.2, "end": 1548.2, "text": "Ich bin ja normalerweise nicht so extrem schadenfroh."}, {"id": 216, "start": 1548.2, "end": 1553.2, "text": "Ich kann mich jetzt nicht so sehr am Leid andere erfreuen."}, {"id": 217, "start": 1553.2, "end": 1572.2, "text": "Aber den Mercy-Mains in Overwatch, den gönne ich."}, {"id": 218, "start": 1572.2, "end": 1575.2, "text": "What? Den Mercy-Mains gönne ich."}, {"id": 219, "start": 1575.2, "end": 1581.2, "text": "Was muss man hier machen?"}, {"id": 220, "start": 1581.2, "end": 1584.2, "text": "In das Menü soll ich gucken, okay."}, {"id": 221, "start": 1584.2, "end": 1588.2, "text": "Menü."}, {"id": 222, "start": 1588.2, "end": 1593.2, "text": "35 or more balls, easy."}, {"id": 223, "start": 1593.2, "end": 1599.2, "text": "Ach, hier unten, ne, das Menü."}, {"id": 224, "start": 1599.2, "end": 1603.2, "text": "Okay, wir müssen da oben hin."}, {"id": 225, "start": 1603.2, "end": 1607.2, "text": "Okay, das wird jetzt ein bisschen komplizierter."}, {"id": 226, "start": 1607.2, "end": 1611.2, "text": "So wird Bubble die hergestellt."}, {"id": 227, "start": 1611.2, "end": 1613.2, "text": "Was wird denn an Mercy generft?"}, {"id": 228, "start": 1613.2, "end": 1615.2, "text": "Also ich weiß nicht, ob das noch der aktuelle Stand ist."}, {"id": 229, "start": 1615.2, "end": 1619.2, "text": "Letzte Mal, was ich gelesen habe, ist, dass du nicht mehr instant retzen kannst."}, {"id": 230, "start": 1619.2, "end": 1625.2, "text": "Selbst in der Ultimate."}, {"id": 231, "start": 1625.2, "end": 1629.2, "text": "Dass, ich glaube, deine ult kürzer ist."}, {"id": 232, "start": 1629.2, "end": 1634.2, "text": "Und ich glaube, die Zeit, wie du fliegen kannst, wird auch irgendwie verringert oder so."}, {"id": 233, "start": 1634.2, "end": 1641.2, "text": "Bin ich jetzt aber nicht mal ganz sicher."}, {"id": 234, "start": 1641.2, "end": 1648.2, "text": "What the fuck?"}, {"id": 235, "start": 1648.2, "end": 1655.2, "text": "Oh, ich sehe schon, das wird was."}, {"id": 236, "start": 1655.2, "end": 1661.2, "text": "Okay, ich glaube, das ist nicht gedacht, dass es da so stehen bleibt, oder?"}, {"id": 237, "start": 1661.2, "end": 1669.2, "text": "Krasse Baukünste."}, {"id": 238, "start": 1669.2, "end": 1672.2, "text": "Ich setze da jetzt einfach mal irgendwas aneinander."}, {"id": 239, "start": 1672.2, "end": 1674.2, "text": "Easy clap, easy."}, {"id": 240, "start": 1674.2, "end": 1677.2, "text": "Nein."}, {"id": 241, "start": 1677.2, "end": 1679.2, "text": "Das ist ja hardcore."}, {"id": 242, "start": 1679.2, "end": 1682.2, "text": "Wahrscheinlich kann ich das einfach irgendwie vollbauen hier."}, {"id": 243, "start": 1682.2, "end": 1683.2, "text": "Ich meine, ich brauche ja bloß acht."}, {"id": 244, "start": 1683.2, "end": 1685.2, "text": "Ich brauche ja nur acht Goos."}, {"id": 245, "start": 1685.2, "end": 1688.2, "text": "Das ist ja nichts."}, {"id": 246, "start": 1688.2, "end": 1690.2, "text": "Zack, zack, zack, zack."}, {"id": 247, "start": 1690.2, "end": 1699.2, "text": "Easy geschafft."}, {"id": 248, "start": 1699.2, "end": 1702.2, "text": "Woher kommt der Hate gegen Mercy mains?"}, {"id": 249, "start": 1702.2, "end": 1706.2, "text": "Als ich noch gespielt habe, waren die Hanzo mains."}, {"id": 250, "start": 1706.2, "end": 1709.2, "text": "Ich glaube, ich habe das Gefühl, es ist ein bisschen weniger geworden."}, {"id": 251, "start": 1709.2, "end": 1716.2, "text": "Außerdem heißt es ja nicht Hanzo, sondern wenn man cool ist, ist es Hanzo."}, {"id": 252, "start": 1716.2, "end": 1724.2, "text": "Ich glaube, der hauptsächliche Mercy-Held liegt daran, im Charakter selbst."}, {"id": 253, "start": 1724.2, "end": 1735.2, "text": "Mercy ist der Held, der mit Abstand für den wenigsten Einsatz das Höchste bringt."}, {"id": 254, "start": 1735.2, "end": 1738.2, "text": "Und es ist schon in gewisser Weise frustrierend, wenn man sich überlegt,"}, {"id": 255, "start": 1738.2, "end": 1742.2, "text": "man kann sowas wie Tracer Genji gut spielen, was saumäßig schwierig ist."}, {"id": 256, "start": 1742.2, "end": 1747.2, "text": "Und du siehst irgendjemanden, der Mercy linke Maustaste gedrückt halten kann,"}, {"id": 257, "start": 1747.2, "end": 1752.2, "text": "ab und zu mal Q und zwei Leute instant retten und hat damit im Endeffekt fast mehr Einfluss auf das Spiel,"}, {"id": 258, "start": 1752.2, "end": 1755.2, "text": "als du, das sich übrigens die Seele aus dem Leib spielt."}, {"id": 259, "start": 1755.2, "end": 1760.2, "text": "Das ist glaube ich der hauptsächliche Hate gegen Mercy."}, {"id": 260, "start": 1760.2, "end": 1766.2, "text": "Dazu kommt halt auch, dass man sieht, wenn man sich die Match-Historie von den Leuten anguckt,"}, {"id": 261, "start": 1766.2, "end": 1772.2, "text": "dass du welche hast, die waren halt, keine Ahnung, die haben hier ihre Mercy-One-Tricks gespielt,"}, {"id": 262, "start": 1772.2, "end": 1777.2, "text": "sind dann halt quasi gewesen, irgendwie Gold, Platin, Gold, Gold, Platin, Platin, vielleicht mal Diamond oder so."}, {"id": 263, "start": 1777.2, "end": 1781.2, "text": "Und jetzt die letzten zwei Seasons halt GM. Das ist halt lächerlich."}, {"id": 264, "start": 1781.2, "end": 1787.2, "text": "Für nichts. Können im Endeffekt. Ich meine, man darf sich nicht überlegen, es heißt Grandmaster."}, {"id": 265, "start": 1787.2, "end": 1792.2, "text": "Und du kannst mit links klicken Grandmaster werden. Das ist halt auch nicht so."}, {"id": 266, "start": 1792.2, "end": 1797.2, "text": "Vom Design her auch alles nicht so tolle."}, {"id": 267, "start": 1811.2, "end": 1814.2, "text": "Woher kann er..."}, {"id": 268, "start": 1814.2, "end": 1819.2, "text": "Was sagst du denn zu Slayers angekündigtem Ende?"}, {"id": 269, "start": 1819.2, "end": 1824.2, "text": "Ich weiß gar nicht, was du meinst. Was? Hä? Was ist zu Ende?"}, {"id": 270, "start": 1828.2, "end": 1831.2, "text": "Ich weiß nicht, was du meinst."}, {"id": 271, "start": 1831.2, "end": 1835.2, "text": "Oh, das wird eine Balanciere-Geschichte jetzt hier."}, {"id": 272, "start": 1835.2, "end": 1842.2, "text": "Ich glaube, ich muss mich hier erstmal hier runter hangeln, die Balls aufsammeln"}, {"id": 273, "start": 1843.2, "end": 1845.2, "text": "und dann wieder nach oben."}, {"id": 274, "start": 1845.2, "end": 1848.2, "text": "Oh, da bin ich ja mal gespannt, wie das funktioniert."}, {"id": 275, "start": 1848.2, "end": 1853.2, "text": "Das müssen wir auf jeden Fall nach oben hängen und dann wieder nach oben."}, {"id": 276, "start": 1853.2, "end": 1856.2, "text": "Und dann wieder nach oben."}, {"id": 277, "start": 1856.2, "end": 1861.2, "text": "Und dann wieder nach oben. Oh, da bin ich ja mal gespannt, wie das funktioniert."}, {"id": 278, "start": 1861.2, "end": 1870.2, "text": "Das müssen wir auf jeden Fall mit den grünen Balls machen."}, {"id": 279, "start": 1870.2, "end": 1875.2, "text": "Weil die lassen sich ja wieder abkletten."}, {"id": 280, "start": 1879.2, "end": 1884.2, "text": "Ich hab mir absichtlich ein sehr entspanntes Gameport ausgesucht."}, {"id": 281, "start": 1884.2, "end": 1887.2, "text": "Aber ich glaube, das wird echt kompliziert später."}, {"id": 282, "start": 1887.2, "end": 1890.2, "text": "Oh ne, komm her jetzt."}, {"id": 283, "start": 1891.2, "end": 1894.2, "text": "Komm her. So."}, {"id": 284, "start": 1896.2, "end": 1900.2, "text": "Zack, dann bauen wir mal wieder hoch."}, {"id": 285, "start": 1909.2, "end": 1913.2, "text": "Dann bauen wir auf der anderen Seite runter. Kann man eigentlich speichern?"}, {"id": 286, "start": 1913.2, "end": 1917.2, "text": "Das geht natürlich nicht. Wäre ja auch bescheuert, wenn das funktioniert."}, {"id": 287, "start": 1922.2, "end": 1926.2, "text": "Was? Ich muss eigentlich gar nicht Pause machen, ich spiele da überhaupt kein Zeitlimit."}, {"id": 288, "start": 1926.2, "end": 1928.2, "text": "Wat?"}, {"id": 289, "start": 1928.2, "end": 1930.2, "text": "Tf."}, {"id": 290, "start": 1930.2, "end": 1932.2, "text": "Was ist das?"}, {"id": 291, "start": 1932.2, "end": 1936.2, "text": "In Hotstars gleiche. Sehr viele, die Goldblatt waren, wurden auf einmal Masters."}, {"id": 292, "start": 1936.2, "end": 1939.2, "text": "Es gab vier Resets von der Season bis heute, klappt es nicht."}, {"id": 293, "start": 1939.2, "end": 1942.2, "text": "Also was ist so alles in allem gelesen?"}, {"id": 294, "start": 1944.2, "end": 1946.2, "text": "Äh."}, {"id": 295, "start": 1948.2, "end": 1950.2, "text": "Ah."}, {"id": 296, "start": 1950.2, "end": 1956.2, "text": "Diese Dinger, diese Dinger machen immer, immer einen Schritt zurück, kann das sein?"}, {"id": 297, "start": 1956.2, "end": 1958.2, "text": "Lull."}, {"id": 298, "start": 1958.2, "end": 1962.2, "text": "Jetzt hab ich mich selbst resettet. Perfekt Max, ganz, ganz clever gemacht."}, {"id": 299, "start": 1966.2, "end": 1969.2, "text": "Ich muss, ich muss die weißen Teile machen."}, {"id": 300, "start": 1974.2, "end": 1977.2, "text": "Ok, aber jetzt, jetzt weiß ich's."}, {"id": 301, "start": 1979.2, "end": 1982.2, "text": "Die resetten mich. Auch gut."}, {"id": 302, "start": 1982.2, "end": 1985.2, "text": "Hallo. Ich will das Ding da anklicken."}, {"id": 303, "start": 1987.2, "end": 1989.2, "text": "Und nicht runterfallen."}, {"id": 304, "start": 1989.2, "end": 1991.2, "text": "Blitz."}, {"id": 305, "start": 1991.2, "end": 1994.2, "text": "Ah, man kann hier nicht durchtracken. Auch gut."}, {"id": 306, "start": 1995.2, "end": 1998.2, "text": "So und jetzt müssen wir hier runterbauen und die anderen holen."}, {"id": 307, "start": 1998.2, "end": 2003.2, "text": "Hey Max, welche Programmiersprache empfiehlst du zum Anfangen?"}, {"id": 308, "start": 2003.2, "end": 2010.2, "text": "Ähm, das hatten wir gestern schon mal kurz. Auf welcher Plattform willst du programmieren oder willst du einfach nur ein bisschen warm werden?"}, {"id": 309, "start": 2010.2, "end": 2016.2, "text": "Also hast du was Konkretes im Kopf, was du machen willst? Oder auf welcher Plattform programmierst du?"}, {"id": 310, "start": 2016.2, "end": 2019.2, "text": "Also quasi Mac, Windows oder?"}, {"id": 311, "start": 2019.2, "end": 2022.2, "text": "Wo bist du unterwegs?"}, {"id": 312, "start": 2022.2, "end": 2024.2, "text": "Ah."}, {"id": 313, "start": 2024.2, "end": 2026.2, "text": "Ah."}, {"id": 314, "start": 2026.2, "end": 2033.2, "text": "Auf welcher Plattform programmierst du? Also quasi Mac, Windows oder?"}, {"id": 315, "start": 2033.2, "end": 2036.2, "text": "Wo bist du unterwegs?"}, {"id": 316, "start": 2037.2, "end": 2040.2, "text": "Ups, das war jetzt ne blöde Idee."}, {"id": 317, "start": 2049.2, "end": 2053.2, "text": "Ohne Ankündigung 74. Gestern war krass, ne?"}, {"id": 318, "start": 2053.2, "end": 2059.96, "text": "Und ich habe ich habe ein paar Windows Forms Sachen zusammen geklickt, okay es war Wochenende"}, {"id": 319, "start": 2072.88, "end": 2078.16, "text": "Wenn du also wenn du wenn du Windows entwickelst kann ich dir empfehlen lade hier Visual Studio runter"}, {"id": 320, "start": 2078.16, "end": 2081.9, "text": "Ich zeig das mal wir können es ja heute alles mal ein bisschen entspannt machen"}, {"id": 321, "start": 2084.52, "end": 2088.9, "text": "Ich mache mal kurz einen clone auf ich zeig dir mal was du dir was du dir bis da besorgen kannst"}, {"id": 322, "start": 2093.4, "end": 2095.76, "text": "Lad dir einfach das hier runter im moment"}, {"id": 323, "start": 2098.08, "end": 2100.08, "text": "Capture"}, {"id": 324, "start": 2100.08, "end": 2105.52, "text": "Window Capture das da"}, {"id": 325, "start": 2109.6, "end": 2114.48, "text": "Lad dir einfach die Visual Studio Community Edition runter das da ist komplett kostenlos"}, {"id": 326, "start": 2120.48, "end": 2123.88, "text": "Auch wenn das hinterher gerade ein bisschen lahm ist, wobei ich glaube eher Microsoft ist lahm"}, {"id": 327, "start": 2123.88, "end": 2131.92, "text": "Oh, Try Microsoft Edge Fast Secure Browser, also lade dir am besten Visual Studio Community 2017 runter, kost nix"}, {"id": 328, "start": 2132.64, "end": 2135.4, "text": "und dann schnappst du dir das"}, {"id": 329, "start": 2137.32, "end": 2143.04, "text": "Galileo Open Book C-Sharp das da und fängst an"}, {"id": 330, "start": 2143.04, "end": 2152.36, "text": "Das ist das Beste was ich dir zum Einstieg unter Windows empfehlen kann"}, {"id": 331, "start": 2154.64, "end": 2156.64, "text": "Nicht retry Zoom"}, {"id": 332, "start": 2161.88, "end": 2163.88, "text": "Oh"}, {"id": 333, "start": 2164.88, "end": 2166.88, "text": "Oh ich ahne Schlemmes"}, {"id": 334, "start": 2166.88, "end": 2172.18, "text": "Oh, das wird nix das wird nix ach du scheiß"}, {"id": 335, "start": 2179.96, "end": 2185.0, "text": "Komm schnell schnell schnell gu gu balls zack zack bevor das wieder um kippt"}, {"id": 336, "start": 2185.0, "end": 2194.56, "text": "Kippt ja gar nicht um dann können wir noch ein bisschen besseren Score hier rausholen"}, {"id": 337, "start": 2197.6, "end": 2203.4, "text": "Nicht dass es jetzt reißt okay das kann ich in dem ab machen jetzt continue"}, {"id": 338, "start": 2206.04, "end": 2208.96, "text": "Nice wachs Lava über gotten die Welt Streams sind die besten"}, {"id": 339, "start": 2208.96, "end": 2216.36, "text": "Ja finde ich auch macht mir auch am meisten bock übrigens heute ich muss mich ja mal wieder ich muss mich ja mal wieder über YouTube auslassen"}, {"id": 340, "start": 2217.04, "end": 2219.04, "text": "Ich habe ja ein Video hochgeladen"}, {"id": 341, "start": 2219.96, "end": 2222.56, "text": "über über Virenscanner und es gibt Videos"}, {"id": 342, "start": 2224.6, "end": 2226.44, "text": "Da"}, {"id": 343, "start": 2226.44, "end": 2233.04, "text": "Da nervt es mich einfach das sind halt Videos wo vielleicht manchmal was fällt was dem einen oder anderen nicht so gefällt"}, {"id": 344, "start": 2233.04, "end": 2236.4, "text": "Ja zum Beispiel gibt es bestimmt Leute die haben sich Virenscanner gekauft"}, {"id": 345, "start": 2236.4, "end": 2240.36, "text": "Und die finden es doof dass ich nicht sage ihren Virenscanner ist der beste"}, {"id": 346, "start": 2240.8, "end": 2246.04, "text": "Und ich würde ihnen empfehlen einfach Windows Defender oder gar nichts zu verwenden. So im Endeffekt sage ich das ja in dem Video"}, {"id": 347, "start": 2246.76, "end": 2252.64, "text": "Und das sind dann solche Videos wo ich einfach mal instant 10 15 D Abos kriege"}, {"id": 348, "start": 2253.48, "end": 2260.8, "text": "Das nervt mich das ihr könnt ich ich meine klar kann es jetzt im Endeffekt sagen was juckt mich ich meine den meisten Leuten gefällt es doch und alles"}, {"id": 349, "start": 2260.8, "end": 2268.6, "text": "Das stimmt schon, aber das nervt mich irgendwie immer und das tratt trotz krassem Abos"}, {"id": 350, "start": 2269.8, "end": 2271.8, "text": "Video heute wieder"}, {"id": 351, "start": 2272.56, "end": 2277.44, "text": "Mir hat das Bad Company 1 Gameplay gefallen ja das war auch mal wieder was das muss ja mal wieder sein"}, {"id": 352, "start": 2284.64, "end": 2287.16, "text": "Und es hat letztens einer in den Comments gefragt so nach dem motto"}, {"id": 353, "start": 2287.96, "end": 2289.96, "text": "ist dir das wichtiger das"}, {"id": 354, "start": 2289.96, "end": 2295.16, "text": "Neue Leute abonnieren anstatt dass es den bestehenden gefällt und sonst was"}, {"id": 355, "start": 2296.36, "end": 2298.8, "text": "Man kann sich auch echt an allem stören was ich sag"}, {"id": 356, "start": 2299.88, "end": 2301.12, "text": "ich mein"}, {"id": 357, "start": 2301.12, "end": 2308.08, "text": "Als einer mit dem anderen nichts zu tun ich muss ja im video kurz und knackige sache sagen können die passt und kann dann nicht erst mal"}, {"id": 358, "start": 2308.08, "end": 2309.88, "text": "fünf minuten"}, {"id": 359, "start": 2309.88, "end": 2311.6, "text": "philosophieren"}, {"id": 360, "start": 2311.6, "end": 2324.92, "text": "Was mir am besten gefällt oder so deswegen sage ich da mittlerweile mein standard abo spurt und gut ist"}, {"id": 361, "start": 2324.92, "end": 2331.48, "text": "Lass das mit dem abo sellout lieber aus das bringt unglaublich viel kann sich das gar nicht vorstellen"}, {"id": 362, "start": 2333.8, "end": 2337.24, "text": "Deswegen ich ich habe ja auch früher immer gesagt so ein blödsinn ja"}, {"id": 363, "start": 2337.24, "end": 2344.28, "text": "Aber es ist einfach so dass viele leute die videos gucken und und sogar regelmäßig gucken ich sehe es ja über die startseiten"}, {"id": 364, "start": 2344.28, "end": 2346.28, "text": "Das heißt die leute gucken die videos über die startseite"}, {"id": 365, "start": 2346.64, "end": 2353.32, "text": "Und kriegen sie auch empfohlen über die startseite oder über videos was sie nicht empfohlen bekommen würden wenn sie nicht mich öfters gucken würden oder"}, {"id": 366, "start": 2354.8, "end": 2357.72, "text": "Nicht leute die ähnliche videos machen zu meinen öfters gucken würden"}, {"id": 367, "start": 2358.68, "end": 2362.32, "text": "Und ich sehe einfach dass das total wenige abos daraus resultieren"}, {"id": 368, "start": 2362.32, "end": 2368.28, "text": "Und seit ich jetzt angefangen habe einmal im video darauf hinzuweisen ist das viel mehr als wirklich extrem viel mehr"}, {"id": 369, "start": 2369.56, "end": 2371.56, "text": "und die"}, {"id": 370, "start": 2373.4, "end": 2376.72, "text": "Die ganzen social plate statistiken die man quasi von außen sieht"}, {"id": 371, "start": 2377.76, "end": 2379.76, "text": "sind ja nur die halbe wahrheit"}, {"id": 372, "start": 2380.2, "end": 2384.92, "text": "Wenn was social plate ansteht keine ahnung ich mache irgendwie muss jetzt mal gucken"}, {"id": 373, "start": 2384.92, "end": 2390.56, "text": "Social plate sagt aktuell ich mache am tag"}, {"id": 374, "start": 2390.56, "end": 2396.56, "text": "Daily Durchschnitt 44 abos steht jetzt da"}, {"id": 375, "start": 2396.56, "end": 2399.56, "text": "Na das ist im vergleich zuletzt ist ja immer noch immens"}, {"id": 376, "start": 2399.56, "end": 2405.56, "text": "Die letzten zwei jahre habe ich minus abos gemacht weil ich kaum was hochgeladen habe"}, {"id": 377, "start": 2405.56, "end": 2407.56, "text": "Mittlerweile bin ich schon wieder bei ungefähr 44 am tag"}, {"id": 378, "start": 2407.56, "end": 2409.56, "text": "Und"}, {"id": 379, "start": 2409.56, "end": 2413.56, "text": "Wo wollte ich jetzt eigentlich drauf raus"}, {"id": 380, "start": 2413.56, "end": 2420.56, "text": "Ah ja genau das ist überhaupt nichts großartig aussagt in wirklichkeit sind das viel viel viel viel mehr als 44 abos am tag aber"}, {"id": 381, "start": 2420.56, "end": 2427.56, "text": "Dazu kommen natürlich wenn man schon länger dabei ist dann hast du halt immer konnten die inaktiv was muss ich eigentlich machen"}, {"id": 382, "start": 2427.56, "end": 2432.56, "text": "Ah immer konnten die inaktiv werden die gelöscht werden und alles mögliche in der richtung"}, {"id": 383, "start": 2432.56, "end": 2437.56, "text": "Bloß halt auch leute die de abos also sprich das sind ja nur die abos die übrig bleiben"}, {"id": 384, "start": 2437.56, "end": 2443.56, "text": "Was muss ich eigentlich machen jetzt"}, {"id": 385, "start": 2443.56, "end": 2446.56, "text": "Fly"}, {"id": 386, "start": 2446.56, "end": 2449.56, "text": "Ach ich glaube ich muss hier ich muss hier einen"}, {"id": 387, "start": 2449.56, "end": 2452.56, "text": "Ich muss muss an die balls einen"}, {"id": 388, "start": 2452.56, "end": 2455.56, "text": "Laufballon dran hängen"}, {"id": 389, "start": 2455.56, "end": 2460.56, "text": "Also ich finde die ideen für die rätsel hier sind wirklich clever"}, {"id": 390, "start": 2460.56, "end": 2468.56, "text": "Auch wenn es noch die tutorial welten sind"}, {"id": 391, "start": 2468.56, "end": 2477.56, "text": "Max wie stehst du eigentlich zu space x interessierst du nicht dafür überhaupt"}, {"id": 392, "start": 2477.56, "end": 2481.56, "text": "Also ich habe mich relativ wenig"}, {"id": 393, "start": 2481.56, "end": 2484.56, "text": "Beschäftige ich mich mit was so"}, {"id": 394, "start": 2484.56, "end": 2490.56, "text": "Was so die privaten Raumfahrer"}, {"id": 395, "start": 2490.56, "end": 2494.56, "text": "Da und da gibt es ja nicht nur space x gibt es gibt ja auch noch"}, {"id": 396, "start": 2494.56, "end": 2498.56, "text": "Ich habe vergessen wie das andere heißt"}, {"id": 397, "start": 2498.56, "end": 2505.56, "text": "Was die so machen ich kriege immer mit da mal eine rakete wird abgestürzt mal irgendein satellite kaputt mal hat alles geklappt das Ding ist wieder gelandet"}, {"id": 398, "start": 2505.56, "end": 2508.56, "text": "Für so universum"}, {"id": 399, "start": 2508.56, "end": 2511.56, "text": "Theorie und Weltraum und sowas interessiere ich mich extrem"}, {"id": 400, "start": 2511.56, "end": 2514.56, "text": "Ich gucke so viele"}, {"id": 401, "start": 2514.56, "end": 2519.56, "text": "So viele ich habe viele viele youtube channels abonnieren guck da so viele videos in der richtung"}, {"id": 402, "start": 2519.56, "end": 2524.56, "text": "Was jetzt allerdings space x und sowas macht an sich"}, {"id": 403, "start": 2524.56, "end": 2528.56, "text": "Juckt mich nicht muss ich sagen"}, {"id": 404, "start": 2528.56, "end": 2531.56, "text": "Und ich glaube auch nicht wo wir gerade beim thema sind"}, {"id": 405, "start": 2531.56, "end": 2534.56, "text": "Ich glaube nicht dass"}, {"id": 406, "start": 2534.56, "end": 2541.56, "text": "Wann will Elon Musk auf dem Mars fliegen 2020 oder wann war das"}, {"id": 407, "start": 2541.56, "end": 2546.56, "text": "Das kann ich euch am besten nicht vorstellen dass das funktioniert"}, {"id": 408, "start": 2546.56, "end": 2553.56, "text": "Ich kann mir vorstellen dass sie oder was 2000 wann wann wollte der"}, {"id": 409, "start": 2553.56, "end": 2559.56, "text": "Anwälter losfliegen 2030 oder wann war das"}, {"id": 410, "start": 2559.56, "end": 2562.56, "text": "2022 irgendwie so"}, {"id": 411, "start": 2562.56, "end": 2569.56, "text": "So und"}, {"id": 412, "start": 2569.56, "end": 2572.56, "text": "Ich kann mir vorstellen dass sie"}, {"id": 413, "start": 2572.56, "end": 2576.56, "text": "Irgendwas bauen und auch irgendwie leute reinsetzen"}, {"id": 414, "start": 2576.56, "end": 2579.56, "text": "Aber wenn das wirklich starten soll"}, {"id": 415, "start": 2579.56, "end": 2583.56, "text": "Wenn ich nicht ausgehe vor allem nicht termingerecht"}, {"id": 416, "start": 2583.56, "end": 2588.56, "text": "Dann habe ich die doofere vermutung"}, {"id": 417, "start": 2588.56, "end": 2593.56, "text": "Dass wahrscheinlich noch nicht mal die leute lebend auf mars ankommen werden"}, {"id": 418, "start": 2593.56, "end": 2600.56, "text": "Geschweige denn die ganze sache irgendeiner überlebt von den die damit machen"}, {"id": 419, "start": 2600.56, "end": 2604.56, "text": "Max machst du magst du ananas ananas auf pizza"}, {"id": 420, "start": 2604.56, "end": 2608.56, "text": "Ja auch wenn das laut gordon ramsey voll verwerflich ist mag ich das"}, {"id": 421, "start": 2608.56, "end": 2619.56, "text": "Hält zur zeit reisen für möglich realistisch in die zukunft ja in die vergangenheit nicht"}, {"id": 422, "start": 2619.56, "end": 2633.56, "text": "So"}, {"id": 423, "start": 2633.56, "end": 2643.56, "text": "Ich muss jetzt hier machen"}, {"id": 424, "start": 2643.56, "end": 2655.56, "text": "Jetzt rüber fliegen"}, {"id": 425, "start": 2655.56, "end": 2660.56, "text": "Ich glaube ich habe es gecheckt was ich machen muss"}, {"id": 426, "start": 2660.56, "end": 2666.56, "text": "Das wird das mit balance aktier"}, {"id": 427, "start": 2666.56, "end": 2668.56, "text": "Funktioniert"}, {"id": 428, "start": 2668.56, "end": 2670.56, "text": "Wenn wir bauen das jetzt mal möglichst"}, {"id": 429, "start": 2670.56, "end": 2673.56, "text": "Ach du scheiße"}, {"id": 430, "start": 2673.56, "end": 2680.56, "text": "Wir bauen das jetzt hier mal möglichst gerade"}, {"id": 431, "start": 2680.56, "end": 2685.56, "text": "Da oben sind auch stacheln"}, {"id": 432, "start": 2685.56, "end": 2695.56, "text": "Da muss ich jetzt ein bisschen aufpassen"}, {"id": 433, "start": 2695.56, "end": 2702.56, "text": "Die physik der gobel ist ein bisschen gewöhnungsbedürftig"}, {"id": 434, "start": 2702.56, "end": 2719.56, "text": "Das ist knapp"}, {"id": 435, "start": 2719.56, "end": 2728.56, "text": "Das ist schwieriger als ich mir das vorgestellt habe gerade"}, {"id": 436, "start": 2728.56, "end": 2738.56, "text": "Jetzt habe ich da eigentlich für ein komisches ding gebaut das ist doch komplett sinnlos"}, {"id": 437, "start": 2738.56, "end": 2743.56, "text": "Nein ich wollte den ball doch gar nicht dahin machen"}, {"id": 438, "start": 2743.56, "end": 2755.56, "text": "Ich baue hier ein scheiß zusammen der wahnsinn"}, {"id": 439, "start": 2755.56, "end": 2776.56, "text": "Das ist das ist echt knapp was ich hier baue"}, {"id": 440, "start": 2776.56, "end": 2785.56, "text": "Mit dem letzten goball"}, {"id": 441, "start": 2785.56, "end": 2793.56, "text": "Was ist das für eine konstruktion"}, {"id": 442, "start": 2793.56, "end": 2796.56, "text": "Es hat geklappt"}, {"id": 443, "start": 2796.56, "end": 2806.56, "text": "Ich muss jetzt hoch scrollen"}, {"id": 444, "start": 2806.56, "end": 2816.56, "text": "Hallo Mr. Anlocker"}, {"id": 445, "start": 2816.56, "end": 2823.56, "text": "Da fragt was meine lieblingsidee ist"}, {"id": 446, "start": 2823.56, "end": 2832.56, "text": "Ich muss sagen unter windows auch wenn microsoft produkte immer viel hate abbekommen aber gegen visual studio kann man eigentlich nichts schlechtes sagen"}, {"id": 447, "start": 2832.56, "end": 2842.56, "text": "Es ist alles mal also ich kann nicht sagen was meine was meine gehassteste beziehungsweise meine unbeliebteste ide ist das ist eindeutig eclipse"}, {"id": 448, "start": 2842.56, "end": 2849.56, "text": "So was aufgeplasenes hässliches habe ich ja selten benutzen müssen"}, {"id": 449, "start": 2849.56, "end": 2856.56, "text": "Aber unter windows muss ich sagen visual studio ist super für alles was ja alles windows und dot net mäßiges"}, {"id": 450, "start": 2856.56, "end": 2865.56, "text": "Und für c++ finde ich was auch ziemlich gut ist ist der cute"}, {"id": 451, "start": 2865.56, "end": 2871.56, "text": "Creator heißt da creator der cute creator der ist auch super"}, {"id": 452, "start": 2871.56, "end": 2879.56, "text": "Also ich würde sagen visual studio und cute creator"}, {"id": 453, "start": 2879.56, "end": 2884.56, "text": "Wenn du tv schaust was schaust du eher an dokus oder serienfilme"}, {"id": 454, "start": 2884.56, "end": 2888.56, "text": "Talkshow danach ich gucke eigentlich gar kein fernseher"}, {"id": 455, "start": 2888.56, "end": 2893.56, "text": "Also wenn wenn ich mal irgendwas gucke"}, {"id": 456, "start": 2893.56, "end": 2900.56, "text": "Dann dann vielleicht irgendwelche doku geschichten ich gucke eigentlich nichts ich gucke eigentlich das mittlerweile muss ich sagen"}, {"id": 457, "start": 2900.56, "end": 2904.56, "text": "Ich bin ja war ich bin jetzt wie gesagt ich bin 84 geboren ja"}, {"id": 458, "start": 2904.56, "end": 2909.56, "text": "Das ist eigentlich so die die letzte generation die so noch mit fernseher aufgewachsen ist zu der ich gehöre"}, {"id": 459, "start": 2909.56, "end": 2913.56, "text": "Also noch ohne youtube und internet und zeug"}, {"id": 460, "start": 2913.56, "end": 2918.56, "text": "Ich bin ja quasi die letzte generation die das betrifft"}, {"id": 461, "start": 2918.56, "end": 2923.56, "text": "Aber ich glaube ich im umkehrfall war ich einer der ersten"}, {"id": 462, "start": 2923.56, "end": 2932.56, "text": "Der quasi oder gehör ich auch auch zur ersten generation wo viele komplett auf fernsehe verzichten"}, {"id": 463, "start": 2932.56, "end": 2959.56, "text": "Ich komme eigentlich kein fernseher"}, {"id": 464, "start": 2959.56, "end": 2975.56, "text": "Fernsehen 2k 18 in 2k 18 leute"}, {"id": 465, "start": 2975.56, "end": 2983.56, "text": "Ich habe die story von dem spiel immer noch nicht verstanden falls es wirklich einer hat"}, {"id": 466, "start": 2983.56, "end": 2985.56, "text": "Wie hoch muss ich dann"}, {"id": 467, "start": 2985.56, "end": 2991.56, "text": "Okay das ist echt hoch damit da müssen wir da müssen wir ein bisschen breiter anfangen"}, {"id": 468, "start": 2991.56, "end": 2998.56, "text": "Achtung max architekten skills sind jetzt gefragt"}, {"id": 469, "start": 2998.56, "end": 3002.56, "text": "Maximum architekt skills"}, {"id": 470, "start": 3002.56, "end": 3005.56, "text": "So ich hoffe man das ist breit genug"}, {"id": 471, "start": 3005.56, "end": 3012.56, "text": "Wir machen jetzt so eine eifelturm ja"}, {"id": 472, "start": 3012.56, "end": 3016.56, "text": "Ich glaube das ist das letzte das letzte level"}, {"id": 473, "start": 3016.56, "end": 3025.56, "text": "Zu form vom tutorial"}, {"id": 474, "start": 3025.56, "end": 3028.56, "text": "Und es ist jetzt schon schäpp"}, {"id": 475, "start": 3028.56, "end": 3035.56, "text": "Das ist jetzt schon schäpp okay wir gleichen das mal ein bisschen aus"}, {"id": 476, "start": 3035.56, "end": 3051.56, "text": "Wie viel 25 nach gut ich habe ja auch ganz schön viele"}, {"id": 477, "start": 3051.56, "end": 3056.56, "text": "Das ist nicht gerade oder was hier bauer"}, {"id": 478, "start": 3056.56, "end": 3068.56, "text": "Oh es kommt auch noch wind dabei ach du okay da müssen wir das hier ein bisschen schwerer bauen als auf der anderen seite"}, {"id": 479, "start": 3068.56, "end": 3094.56, "text": "Wie hoch wir da müssen und das wird nix ach du scheiße das wird nix"}, {"id": 480, "start": 3094.56, "end": 3099.56, "text": "Oh fuck"}, {"id": 481, "start": 3099.56, "end": 3104.56, "text": "Es lebt es lebt"}, {"id": 482, "start": 3104.56, "end": 3106.56, "text": "Oder auch nicht"}, {"id": 483, "start": 3106.56, "end": 3113.56, "text": "Scheiß"}, {"id": 484, "start": 3113.56, "end": 3124.56, "text": "Das wird nix ach du scheiße"}, {"id": 485, "start": 3124.56, "end": 3128.56, "text": "Ich baue es einfach so schnell der hat ja auch geschrieben ich soll schnell"}, {"id": 486, "start": 3128.56, "end": 3152.56, "text": "Jetzt kann ich doch rückgängig machen oder"}, {"id": 487, "start": 3152.56, "end": 3158.56, "text": "Ich glaube ich muss doch mal anfangen"}, {"id": 488, "start": 3158.56, "end": 3160.56, "text": "Scheiße"}, {"id": 489, "start": 3160.56, "end": 3165.56, "text": "Okay wir fangen nochmal das muss anders machen"}, {"id": 490, "start": 3165.56, "end": 3181.56, "text": "Das das funktioniert nicht okay wir müssen das breiter bauen"}, {"id": 491, "start": 3181.56, "end": 3188.56, "text": "So"}, {"id": 492, "start": 3188.56, "end": 3201.56, "text": "Okay okay jetzt ist jetzt ist es echt breit"}, {"id": 493, "start": 3201.56, "end": 3209.56, "text": "Was game ist black desert nein nicht wirklich weiß ich was der hör nicht auf den nightbot was er da erzählt der nightbot hat keine ahnung"}, {"id": 494, "start": 3209.56, "end": 3215.56, "text": "Okay was gibt es nie auf dem schild"}, {"id": 495, "start": 3215.56, "end": 3222.56, "text": "Okay das heißt das heißt das heißt das ist die taktik hier oder was"}, {"id": 496, "start": 3222.56, "end": 3250.56, "text": "Okay"}, {"id": 497, "start": 3250.56, "end": 3267.56, "text": "Okay"}, {"id": 498, "start": 3267.56, "end": 3274.56, "text": "Jetzt ja zack ich zack ich zack ich zack ich rein rein rein rein rein rein rein"}, {"id": 499, "start": 3274.56, "end": 3287.56, "text": "Easy clap easy clap überhaupt kein ding überhaupt kein ding"}, {"id": 500, "start": 3287.56, "end": 3296.56, "text": "Max nightbot labert wie der scheiße ja das stimmt nicht so ganz was der geschrieben hat mit game black desert das ist falsch"}, {"id": 501, "start": 3296.56, "end": 3311.56, "text": "Was ist das ziel von dem spiel zur röhre zu kommen"}, {"id": 502, "start": 3311.56, "end": 3326.56, "text": "Ich habe wie gesagt ich habe twitch immer noch nicht angefragt eingeschrieben benutzt du denn ab und zu dein switch"}, {"id": 503, "start": 3326.56, "end": 3331.56, "text": "Es gibt ja nichts auf der switch"}, {"id": 504, "start": 3331.56, "end": 3338.56, "text": "Da wird mir jetzt zwar der nintendo fan widersprechen aber was gibt es denn auf der switch"}, {"id": 505, "start": 3338.56, "end": 3343.56, "text": "Es gibt zellner es gibt mario es gibt vielleicht noch das platoon wenn man da drauf steht"}, {"id": 506, "start": 3343.56, "end": 3347.56, "text": "Es gibt dieses mario rabbit spiel wenn man da drauf steht"}, {"id": 507, "start": 3347.56, "end": 3354.56, "text": "Es gibt was gibt es denn was gibt es denn sonst auf der switch"}, {"id": 508, "start": 3354.56, "end": 3365.56, "text": "Moment das gucken wir uns jetzt mal zusammen an wir gucken uns jetzt mal wir gucken uns jetzt mal kurz die switch games an"}, {"id": 509, "start": 3365.56, "end": 3378.56, "text": "Und dann sage ich euch was mir davon gefällt was nicht weil ab coming vor 2017"}, {"id": 510, "start": 3378.56, "end": 3388.56, "text": "Gibt es da keine liste für spiel für switch spiel 2018 rausgekommen sind das das überrascht mich jetzt aber"}, {"id": 511, "start": 3388.56, "end": 3400.56, "text": "Und vor allem 2017 nicht 2018 wo gibt es dann switch spiel release list aktueller ja gucken wir mal"}, {"id": 512, "start": 3400.56, "end": 3406.56, "text": "Best switch games 2017 wenn man danach so guck jetzt funktioniert jetzt kann ich mich sogar verschrieben"}, {"id": 513, "start": 3406.56, "end": 3419.56, "text": "Jetzt kann ich sogar sein best switch games 2017 funktioniert also gutes game gutes game"}, {"id": 514, "start": 3419.56, "end": 3426.56, "text": "Bestimmt ganz okay kann ich nichts zu sagen ich war noch nie groß das platoon fan"}, {"id": 515, "start": 3426.56, "end": 3441.56, "text": "Übrigens wer sagt der max frisst wieder ich habe hier traum also nicht so nicht dass jetzt irgendwelche ungesunden sachen puttern würde oder so"}, {"id": 516, "start": 3441.56, "end": 3452.56, "text": "So mario kart 8 deluxe ist nicht übel mario kart 8 generell war nicht übel"}, {"id": 517, "start": 3452.56, "end": 3462.56, "text": "Weil ich sagen muss ich finde ich war mario kart war schon immer dadurch gekennzeichnet dass es absolut random ist"}, {"id": 518, "start": 3462.56, "end": 3470.56, "text": "Aber ich habe persönlich den eindruck dass mario kart 8 fast noch das random mix der mario kart überhaupt ist"}, {"id": 519, "start": 3470.56, "end": 3479.56, "text": "Was mich ein bisschen genervt hat ich fand das mario kart auf der wie richtig geil ich fand das auf dem ds richtig geil"}, {"id": 520, "start": 3479.56, "end": 3486.56, "text": "Und ich finde mario kart 8 auch ganz gut aber das ist bei mir jetzt in meiner mario kart liste nicht so weit"}, {"id": 521, "start": 3486.56, "end": 3490.56, "text": "Wobei es mittlerweile viel mehr strecken und alles gibt als früher"}, {"id": 522, "start": 3490.56, "end": 3496.56, "text": "Was ich bis heute nicht verstanden habe warum es link in einem mario kart spiel gibt aber wahrscheinlich weil"}, {"id": 523, "start": 3496.56, "end": 3503.56, "text": "Nintendo mittlerweile auch verstanden hat es geht darum was die leute für charaktere spielen wollen scheiß egal ob sie zum universum gehören oder nicht"}, {"id": 524, "start": 3503.56, "end": 3513.56, "text": "Ok also fangen wir an gutes game also für die ersten beiden absolut top games gibt es nichts dazu zu sagen"}, {"id": 525, "start": 3513.56, "end": 3518.56, "text": "Eines der besten spiele die überhaupt rausgekommen sind so die ersten beiden"}, {"id": 526, "start": 3518.56, "end": 3524.56, "text": "Splatoon wem es gefällt mario kart 8 auch nicht übel mario und rapid ist eigentlich auch ganz nett"}, {"id": 527, "start": 3524.56, "end": 3535.56, "text": "Und arms da muss ich sagen bin ich ein bisschen enttäuscht von nintendo was arms angeht sie haben das im vorfeld angekündigt"}, {"id": 528, "start": 3535.56, "end": 3543.56, "text": "Als arms e-sport league oder so haben sie mal irgendwo erzählt ja nintendo arms is joining the world of e-sports bla bla bla bla"}, {"id": 529, "start": 3543.56, "end": 3551.56, "text": "Also so nach dem motto wir haben ganz tolle ambitionen mit dem game und jetzt kam letztens die message arms ist eingestellt"}, {"id": 530, "start": 3551.56, "end": 3558.56, "text": "Jawoll so macht man ein tolles competitive multiplayer spiel in dem was paar monaten nach release einstellt"}, {"id": 531, "start": 3558.56, "end": 3565.56, "text": "Das easy clap das ganz toll nintendo xenoplade chronicles 2 soll ziemlich gut sein"}, {"id": 532, "start": 3565.56, "end": 3573.56, "text": "Und das wars das heißt wir haben im endeffekt zwei must have games wofür es sich ohne frage lohnt eine switch zu kaufen"}, {"id": 533, "start": 3573.56, "end": 3581.56, "text": "Wenn man halt eine view hat kann man sagen hey eigentlich kann ich das zelt auch da drauf spielen aber angenommen hätte keine view was ja viele leute betrifft"}, {"id": 534, "start": 3581.56, "end": 3589.56, "text": "Also must have ja allein schon für die zwei games kann man sich eine switch kaufen"}, {"id": 535, "start": 3589.56, "end": 3599.56, "text": "Rest ist so naja und bis hier eigentlich auch noch alles ganz gut also gebe es wenn man angenommen es gefällt einem alles das hier gibt es aktuell"}, {"id": 536, "start": 3599.56, "end": 3609.56, "text": "1 2 3 4 5 6 7 nein das wie gesagt mittlerweile 1 2 3 4 5 wir sagen mal wir sagen mal 5 oder 6 games"}, {"id": 537, "start": 3609.56, "end": 3617.56, "text": "Wobei es für mich halt einfach nur zwei games sind und das ist einfach zu wenig"}, {"id": 538, "start": 3617.56, "end": 3627.56, "text": "Das ist einfach zu wenig ich meine dass ich da andere konsolen wie jetzt die neuen sachen die für microsoft für die xbox rauskommen"}, {"id": 539, "start": 3627.56, "end": 3633.56, "text": "Auch noch nicht so nicht mit rum bekleckern ist sie macht es jetzt ja auch nicht besser im endeffekt"}, {"id": 540, "start": 3633.56, "end": 3639.56, "text": "So was haben wir noch nach rechts slipper clips net net ja"}, {"id": 541, "start": 3639.56, "end": 3649.56, "text": "Sonic mania soll ganz gut sein kann es aber glaube ich auch auf allen anderen plattformen spielen und hatte glaube ich fps probleme auf das mit"}, {"id": 542, "start": 3649.56, "end": 3656.56, "text": "Ich weiß nicht wie das neue fire emblem ist keine ahnung wenn das was taugt ist bestimmt auch ein ganz gutes game"}, {"id": 543, "start": 3656.56, "end": 3667.56, "text": "Golf story was auch immer kann ich immer fast er ist das ist dieses f0 was kein f0 ist das ist aber auch eine neuauflage von infos alt"}, {"id": 544, "start": 3667.56, "end": 3674.56, "text": "Und das soll auch ganz gut sein fifa 18 die die bekommen dass da steht sogar p da ist sogar die ps4"}, {"id": 545, "start": 3674.56, "end": 3678.56, "text": "Da ist sogar die ps4 packung auf der konsolen dings weil man nach switch sucht"}, {"id": 546, "start": 3678.56, "end": 3688.56, "text": "Beschissenste fifa portierung für fifa um aller zeiten für die switch eins want to switch"}, {"id": 547, "start": 3688.56, "end": 3694.56, "text": "Hör mal auf das sage ich nichts zu nba jugg nicht steampunk ist glaube ich ganz gut aber es hat alles jetzt nichts wofür man nicht unbedingt"}, {"id": 548, "start": 3694.56, "end": 3698.56, "text": "Switch kaufen muss holst du da muss man sich definitiv keine switch kaufen"}, {"id": 549, "start": 3698.56, "end": 3704.56, "text": "Juggaleli muss auch keine switch verkaufen man kann es überall woanders spielen sonic 2017 nein"}, {"id": 550, "start": 3704.56, "end": 3713.56, "text": "Nein das neue bomba man sagt auch das ist auch eine neuauflage von etwas altem glaube ich"}, {"id": 551, "start": 3713.56, "end": 3719.56, "text": "Kommt mir irgendwie bekannt vor als es doch ein bisschen älter lego spiele gibt es auch überall anderes was auch immer das hier ist"}, {"id": 552, "start": 3719.56, "end": 3725.56, "text": "Jetzt bestimmt auch überall anders snake pass gibt es auch überall anders also das war es im endeffekt bleiben zwei must have spiele für die"}, {"id": 553, "start": 3725.56, "end": 3732.56, "text": "Den rest gibt es auch für andere plattform im prinzip gibt es zwei must have spiele für die switch"}, {"id": 554, "start": 3732.56, "end": 3739.56, "text": "Das ist das hier und ein ziemlich gutes wenn man noch sowas steht mit xenoplates und dann und und vielleicht auch mario kart das"}, {"id": 555, "start": 3739.56, "end": 3748.56, "text": "Aber das das das um mario kart auf hier hast du wirklich wenn mit viel wohlwollen hast du kannst du dir selbst wenn du die andere noch"}, {"id": 556, "start": 3748.56, "end": 3755.56, "text": "Noch mit nimmst also es kommt jeder auf sagen wenn man ungefähr vier spiele die ihm gefallen könnten auf das mit zur zeit"}, {"id": 557, "start": 3755.56, "end": 3762.56, "text": "Und es ist halt ein bisschen wenig da"}, {"id": 558, "start": 3762.56, "end": 3771.56, "text": "Ah ja skyrim gibt es habe ich vergessen gibt es das mittlerweile schon"}, {"id": 559, "start": 3771.56, "end": 3786.56, "text": "Jetzt sage ich das gibt es eigentlich skyrim schon wobei skyrim für mich natürlich auch kein grund ist sich die switch zu kaufen"}, {"id": 560, "start": 3786.56, "end": 3798.56, "text": "Außer dass man es mitnehmen kann ok wer skyrim schon immer mal mobil spielen wollte ja ok ok aber"}, {"id": 561, "start": 3798.56, "end": 3809.56, "text": "Die beste skyrimversion krasse definitiv auf dem pc und man merkt skyrim mittlerweile an dass es in die jahre gekommen ist"}, {"id": 562, "start": 3809.56, "end": 3814.56, "text": "Ich weiß wie oft wollen sie denn skyrim noch raushauen skyrim gibt es ja gefühlt quasi für für alles"}, {"id": 563, "start": 3814.56, "end": 3822.56, "text": "Das kam wann kam skyrim raus kann ich mal richtig reden skyrim kam 2011 oder so raus"}, {"id": 564, "start": 3822.56, "end": 3831.56, "text": "2011 ende 2011 kam das raus"}, {"id": 565, "start": 3831.56, "end": 3838.56, "text": "Ich meine überlegt man das spiel ist sieben jahre alt und da gibt es jetzt neu das wird als grandios geil und neu"}, {"id": 566, "start": 3838.56, "end": 3853.56, "text": "Angepriesel auf sieben jahre später auf das kommt irgendwann ist ja auch mal ist ja mal irgendwie ist aber auch gut mit skyrim"}, {"id": 567, "start": 3853.56, "end": 3868.56, "text": "Ok bridge builder style nein so funktioniert das definitiv nicht ich muss ich muss ich muss das mal anders"}, {"id": 568, "start": 3868.56, "end": 3879.56, "text": "Ich muss da ein bisschen nach hinten bauen es ist eigentlich ziemlich easy"}, {"id": 569, "start": 3879.56, "end": 3906.56, "text": "So muss man das machen wir müssen erstmal ordentlich nach hinten so gewicht dran bauen dann können wir nach vorne weiter machen"}, {"id": 570, "start": 3906.56, "end": 3918.56, "text": "Irgendwie so ich glaube das passt schon was ich da mache so halbwegs naja fast krasse krasse building skills"}, {"id": 571, "start": 3918.56, "end": 3929.56, "text": "Vielleicht soll ich das noch ein bisschen zusammen bauen ich sehe halt auch die hälfte irgendwie nicht"}, {"id": 572, "start": 3929.56, "end": 3939.56, "text": "Ich glaube das was ich hier mache ist irgendwie eine ziemlich dämliche idee"}, {"id": 573, "start": 3939.56, "end": 3947.56, "text": "Das funktioniert so nicht"}, {"id": 574, "start": 3947.56, "end": 3954.56, "text": "Ich glaube ich fange noch mal neu an warte ich fange noch mal neu an das klappt das klappt so nicht das ist bescheuert"}, {"id": 575, "start": 3954.56, "end": 3969.56, "text": "Ok im Prinzip ist es doch ganz einfach zack zack zack wir bauen jetzt einfach so weit bis es anfängt runter zu fallen"}, {"id": 576, "start": 3969.56, "end": 3984.56, "text": "So wenn es anfängt runter zu fallen bauen wir hier hinten was dran und dann zieht es das wieder hoch"}, {"id": 577, "start": 3984.56, "end": 3999.56, "text": "Ich sehe halt nichts so wirklich und jetzt zieht es das sollte es das naja"}, {"id": 578, "start": 3999.56, "end": 4010.56, "text": "Irgendwie sind meine bridge builder Sachen jetzt auch nicht so toll"}, {"id": 579, "start": 4010.56, "end": 4030.56, "text": "Wie weit muss ich denn da eigentlich das ist ja gar nicht mal so weit"}, {"id": 580, "start": 4030.56, "end": 4045.56, "text": "Ja stimmt das neue Monster Hunter ist ja ist ja am start das wollte ich ja eigentlich mit dem Fabian mal ausprobieren"}, {"id": 581, "start": 4045.56, "end": 4050.56, "text": "Max was du da baust funktioniert nicht oder doch"}, {"id": 582, "start": 4050.56, "end": 4079.56, "text": "Max das ist nichts das funktioniert so nicht das ist eine ziemlich bescheuerte Idee was du hier baust"}, {"id": 583, "start": 4079.56, "end": 4089.56, "text": "Ich glaube ich muss noch mal anfangen"}, {"id": 584, "start": 4089.56, "end": 4095.56, "text": "Ich bin da zu dumm für das gibt es doch nicht"}, {"id": 585, "start": 4095.56, "end": 4103.56, "text": "Ok ganz ganz ganz ruhig"}, {"id": 586, "start": 4103.56, "end": 4120.56, "text": "Oder muss ich mal ich baue nach hier unten was hier unten kommt noch was hin jawoll hier unten kommt noch so ist das gut"}, {"id": 587, "start": 4120.56, "end": 4129.56, "text": "So fuck das wollte ich gar nicht scheiße kann schon mal rückgängig machen"}, {"id": 588, "start": 4129.56, "end": 4141.56, "text": "So ja so ist das schick Staticor ja krasser Staticor"}, {"id": 589, "start": 4141.56, "end": 4149.56, "text": "So und jetzt jetzt weiß ich was wir jetzt bauen wir hier hinten"}, {"id": 590, "start": 4149.56, "end": 4157.56, "text": "Jetzt bauen wir hier hinten hoch und lassen es einfach zurückziehen"}, {"id": 591, "start": 4157.56, "end": 4184.56, "text": "So genau ok"}, {"id": 592, "start": 4184.56, "end": 4192.56, "text": "Das klappt das klappt"}, {"id": 593, "start": 4192.56, "end": 4213.56, "text": "Oder auch nicht fuck man warum bin ich denn so schlecht für dieses Game"}, {"id": 594, "start": 4213.56, "end": 4224.56, "text": "Staticor am Berg"}, {"id": 595, "start": 4224.56, "end": 4230.56, "text": "Das wird doch nie was"}, {"id": 596, "start": 4230.56, "end": 4247.56, "text": "Alter wie soll das was werden"}, {"id": 597, "start": 4247.56, "end": 4264.56, "text": "Ach du scheiße"}, {"id": 598, "start": 4264.56, "end": 4284.56, "text": "Schreckt"}, {"id": 599, "start": 4284.56, "end": 4296.56, "text": "Ich habe zu wenig Balls"}, {"id": 600, "start": 4296.56, "end": 4325.56, "text": "Oh nee jetzt habe ich zu wenig Balls ich glaube es nicht Kann ich noch mal rückgängig machen"}, {"id": 601, "start": 4325.56, "end": 4345.56, "text": "Next MLG Taktik hochbauen und umfallen lassen"}, {"id": 602, "start": 4345.56, "end": 4360.56, "text": "Pass mal auf das ist gar nicht so schwer das machen wir jetzt einfach"}, {"id": 603, "start": 4360.56, "end": 4377.56, "text": "Weiter zack"}, {"id": 604, "start": 4377.56, "end": 4394.56, "text": "So easy Staticor"}, {"id": 605, "start": 4394.56, "end": 4410.56, "text": "Guck mal überhaupt kein Ding"}, {"id": 606, "start": 4410.56, "end": 4416.56, "text": "Man muss aber nicht alles total überdenken"}, {"id": 607, "start": 4416.56, "end": 4426.56, "text": "Guck mal jetzt hier wie viele von acht wir da kriegen"}, {"id": 608, "start": 4426.56, "end": 4436.56, "text": "Ok was habe ich jetzt überlesen im Chat zeigt mal her"}, {"id": 609, "start": 4436.56, "end": 4446.56, "text": "Ich habe ganz viel verpasst nachdem ich jetzt hier dieses komische Stylers verbauen musste"}, {"id": 610, "start": 4446.56, "end": 4468.56, "text": "Was sagst du zum Nintendo Labo"}, {"id": 611, "start": 4468.56, "end": 4473.56, "text": "Kannst du mir Tipps für den Anfang geben"}, {"id": 612, "start": 4473.56, "end": 4477.56, "text": "Ich würde dir empfehlen, du bist wahrscheinlich unter Windows unterwegs."}, {"id": 613, "start": 4477.56, "end": 4486.56, "text": "Lad dir Wishlist Studio Community Edition runter und fang an."}, {"id": 614, "start": 4486.56, "end": 4491.56, "text": "Nehm dir noch das Galileo OpenPress, die Scharpbuchen, und fang an zu lernen."}, {"id": 615, "start": 4491.56, "end": 4500.56, "text": "An welchem Level fängt man eigentlich in BDO mit dem Grind an? Durchgängig."}, {"id": 616, "start": 4500.56, "end": 4505.56, "text": "Man levelt nicht über Quests. Quests brauchen wir nur für Contribution Points."}, {"id": 617, "start": 4505.56, "end": 4507.56, "text": "Man grindet quasi von 1 bis 60."}, {"id": 618, "start": 4507.56, "end": 4514.56, "text": "Du levelst ja auch in einem Tag bis 54 oder so."}, {"id": 619, "start": 4514.56, "end": 4529.56, "text": "Mittlerweile."}, {"id": 620, "start": 4529.56, "end": 4533.56, "text": "Ist der Fabian noch Friseur?"}, {"id": 621, "start": 4533.56, "end": 4537.56, "text": "Soweit ich weiß, arbeitet er noch, er hat doch letztens mal im Stream was ich gesagt."}, {"id": 622, "start": 4537.56, "end": 4543.56, "text": "Soweit ich weiß, er arbeitet noch im Friseursalon."}, {"id": 623, "start": 4543.56, "end": 4559.56, "text": "Er kümmert sich jetzt aber eher um organisatorische Dinge."}, {"id": 624, "start": 4559.56, "end": 4564.56, "text": "Verstehe den Hype um Monster Hunter gar nicht. Hab es 3 Stunden gespielt und dann vor langer Weile ausgebaut."}, {"id": 625, "start": 4564.56, "end": 4569.56, "text": "Ich kann dazu nichts sagen. Ich hab das neue Monster Hunter noch gar nicht ausprobiert."}, {"id": 626, "start": 4569.56, "end": 4574.56, "text": "Ich wollte das mit dem Friseur spielen. Ich wollte das mit dem Fabian spielen."}, {"id": 627, "start": 4574.56, "end": 4576.56, "text": "Wir wollten uns einfach mal angucken."}, {"id": 628, "start": 4576.56, "end": 4583.56, "text": "Weil es ja auch Leute ansprechen soll wie mich, die quasi mit Monster Hunter bisher nicht so viel anfangen konnten."}, {"id": 629, "start": 4583.56, "end": 4589.56, "text": "Wer macht deiner Meinung nach die besten Mäuse, Tastatur und Headsets?"}, {"id": 630, "start": 4589.56, "end": 4591.56, "text": "Headsets?"}, {"id": 631, "start": 4591.56, "end": 4599.56, "text": "Bio Dynamics? Also es gibt eigentlich nichts was über das MMX300 geht."}, {"id": 632, "start": 4599.56, "end": 4602.56, "text": "Immer noch wenn man die Kohle hat."}, {"id": 633, "start": 4602.56, "end": 4610.56, "text": "Oder man ein bisschen gespart hat."}, {"id": 634, "start": 4610.56, "end": 4616.56, "text": "Hier wir sind im Magen gelandet anscheinend."}, {"id": 635, "start": 4616.56, "end": 4624.56, "text": "Mäuse, Tastatur und Mäuse, würde ich sagen an sich hätte ich immer gesagt Logitech."}, {"id": 636, "start": 4624.56, "end": 4631.56, "text": "Aber ich hab jetzt ja, wie gesagt ich hatte ja lange die zum testen die 500, was war das? G502 glaube ich."}, {"id": 637, "start": 4631.56, "end": 4634.56, "text": "Oder was? G402."}, {"id": 638, "start": 4634.56, "end": 4638.56, "text": "Protoy Score oder wie das Ding hieß. Die waren mir zu schwer."}, {"id": 639, "start": 4638.56, "end": 4646.56, "text": "Und ich hab seitdem von Zoe, also das ist BenQ, die EC2A, da gibt es jetzt mittlerweile auch die EC2B glaube ich."}, {"id": 640, "start": 4646.56, "end": 4648.56, "text": "Irgendwie so eine Neuauflage davon."}, {"id": 641, "start": 4648.56, "end": 4652.56, "text": "Und ich muss sagen das ist so eine simple Maus, die hat nichts."}, {"id": 642, "start": 4652.56, "end": 4657.56, "text": "Das ist einfach eine Maus mit zwei Seitentasten, eine Maus hat zwei Knöpfe links und rechts."}, {"id": 643, "start": 4657.56, "end": 4659.56, "text": "Die finde ich richtig gut."}, {"id": 644, "start": 4659.56, "end": 4662.56, "text": "Und Tastaturen würde ich ausprobieren was mir gefällt."}, {"id": 645, "start": 4662.56, "end": 4674.56, "text": "Also ich würde sagen Headsets, ein MMX-200 von Bio Dynamics oder eben irgendein x-beliebiges gutes Audio Kopfhörer und ein Mod-Mic dabei."}, {"id": 646, "start": 4674.56, "end": 4679.56, "text": "Dann für mich hier eine Zoe EC2A mit der sogar Taimo spielt."}, {"id": 647, "start": 4679.56, "end": 4686.56, "text": "Taimo spielt jetzt ja nicht mehr mit DBS, aber das ist einfach mein Lieblings-Overwatch-Spieler."}, {"id": 648, "start": 4686.56, "end": 4703.56, "text": "Und Tastature kein Schimmer."}, {"id": 649, "start": 4703.56, "end": 4707.56, "text": "Was müssen wir jetzt hier bauen?"}, {"id": 650, "start": 4707.56, "end": 4712.56, "text": "Also ich muss sagen die Levels sind echt kreativ gemacht hier."}, {"id": 651, "start": 4712.56, "end": 4715.56, "text": "Ich glaube irgendwie ich muss nach unten bauen, kann das sein?"}, {"id": 652, "start": 4715.56, "end": 4719.56, "text": "Sodass es nicht mehr so hin und her wackelt jetzt erstmal."}, {"id": 653, "start": 4719.56, "end": 4731.56, "text": "Weil solange es hin und her wackelt ist das ziemlich kacke."}, {"id": 654, "start": 4731.56, "end": 4738.56, "text": "Solange es hin und her wackelt wird das hier nichts."}, {"id": 655, "start": 4738.56, "end": 4742.56, "text": "Äh nein so wird das auch so nichts."}, {"id": 656, "start": 4742.56, "end": 4752.56, "text": "Bleiben die an den Wänden hängen?"}, {"id": 657, "start": 4752.56, "end": 4757.56, "text": "Nicht wirklich oder?"}, {"id": 658, "start": 4757.56, "end": 4760.56, "text": "Ja das haben wir schon gelesen."}, {"id": 659, "start": 4760.56, "end": 4766.56, "text": "Gucken wir mal."}, {"id": 660, "start": 4766.56, "end": 4778.56, "text": "Wie spruft?"}, {"id": 661, "start": 4778.56, "end": 4781.56, "text": "Es hängt nicht so wirklich an, bleibt nicht so wirklich an der Wand hängen."}, {"id": 662, "start": 4781.56, "end": 4788.56, "text": "Hallo Relic Gaming HD."}, {"id": 663, "start": 4788.56, "end": 4790.56, "text": "Jetzt hängt es."}, {"id": 664, "start": 4790.56, "end": 4791.56, "text": "Ein bisschen zumindest."}, {"id": 665, "start": 4791.56, "end": 4793.56, "text": "Oder auch nicht."}, {"id": 666, "start": 4793.56, "end": 4796.56, "text": "WTF soll das funktionieren?"}, {"id": 667, "start": 4796.56, "end": 4798.56, "text": "Ich glaube ich muss es nach unten bauen."}, {"id": 668, "start": 4798.56, "end": 4801.56, "text": "Ich glaube ich muss das nach unten bauen."}, {"id": 669, "start": 4801.56, "end": 4803.56, "text": "Aber gucken wir mal."}, {"id": 670, "start": 4803.56, "end": 4809.56, "text": "Wir bauen es jetzt einfach mal nach oben."}, {"id": 671, "start": 4809.56, "end": 4811.56, "text": "Ja aber jetzt ist es zu schwer, jetzt moves nicht mehr."}, {"id": 672, "start": 4811.56, "end": 4814.56, "text": "Jetzt können wir nämlich hier nochmal nach rechts bauen."}, {"id": 673, "start": 4814.56, "end": 4816.56, "text": "Ja so ist das gut."}, {"id": 674, "start": 4816.56, "end": 4822.56, "text": "Jetzt steckt es fest."}, {"id": 675, "start": 4822.56, "end": 4832.56, "text": "Nicht umkippen, nein."}, {"id": 676, "start": 4832.56, "end": 4839.56, "text": "Oh fuck."}, {"id": 677, "start": 4839.56, "end": 4845.56, "text": "Es wird nicht schön, aber es wird funktionieren."}, {"id": 678, "start": 4845.56, "end": 4852.56, "text": "Ich sag es euch, es wird einfach werden."}, {"id": 679, "start": 4875.56, "end": 4877.56, "text": "Okay wie soll das jetzt genau funktionieren?"}, {"id": 680, "start": 4877.56, "end": 4889.56, "text": "Wie geht man jetzt hier durch?"}, {"id": 681, "start": 4889.56, "end": 4896.56, "text": "What?"}, {"id": 682, "start": 4896.56, "end": 4911.56, "text": "Ich glaube das Ziel ist einfach nur raus zu kommen, es gibt überhaupt kein Limit."}, {"id": 683, "start": 4911.56, "end": 4913.56, "text": "Und wir gehen langsam die Bälle aus, wobei ich kann die ja unten ab..."}, {"id": 684, "start": 4913.56, "end": 4933.56, "text": "Okay was steht auf dem Schild?"}, {"id": 685, "start": 4933.56, "end": 4938.56, "text": "Okay ich muss fliegen."}, {"id": 686, "start": 4938.56, "end": 4943.56, "text": "Fliegt man damit?"}, {"id": 687, "start": 4943.56, "end": 4950.56, "text": "Also ich finde ihr habt echt, der Typ der das Spiel gebaut hat echt coole Ideen."}, {"id": 688, "start": 4950.56, "end": 4959.56, "text": "Es sieht zwar nicht elegant aus, aber es funktioniert."}, {"id": 689, "start": 4959.56, "end": 4969.56, "text": "Flieg, flieg, will nicht."}, {"id": 690, "start": 4969.56, "end": 4984.56, "text": "Und hopp, abgehoben."}, {"id": 691, "start": 4984.56, "end": 5013.56, "text": "Oh Starry, Starry Mode."}, {"id": 692, "start": 5013.56, "end": 5020.56, "text": "Easy clap."}, {"id": 693, "start": 5020.56, "end": 5028.56, "text": "Wenn das als Chapter 1 gewesen ist, und mich das an dem einen Level schon so überfordert hat, will ich echt gar nicht wissen was Chapter 2 wird."}, {"id": 694, "start": 5028.56, "end": 5033.56, "text": "Okay ich scroll mal kurz Chat hoch, mal ein bisschen was übersehen."}, {"id": 695, "start": 5033.56, "end": 5036.56, "text": "Wie lange die Mainquests gehen BDO?"}, {"id": 696, "start": 5036.56, "end": 5039.56, "text": "Stunden."}, {"id": 697, "start": 5039.56, "end": 5040.56, "text": "Ewig."}, {"id": 698, "start": 5040.56, "end": 5043.56, "text": "Die gehen bis in die Wüste."}, {"id": 699, "start": 5043.56, "end": 5065.56, "text": "Und danach gibt es noch mal einen, die gehen noch mal quer durch die Welt, ewig gehen die Mainquests."}, {"id": 700, "start": 5065.56, "end": 5073.56, "text": "Gucken wie schwierig Chapter 2 wird."}, {"id": 701, "start": 5073.56, "end": 5095.56, "text": "Oh guck mal neue Balls."}, {"id": 702, "start": 5095.56, "end": 5099.56, "text": "Ah die wiegen bestimmt nichts."}, {"id": 703, "start": 5099.56, "end": 5108.56, "text": "Oder wenig, die wiegen wenig, da kann man sich hier runter hangeln."}, {"id": 704, "start": 5108.56, "end": 5116.56, "text": "Wir hangeln uns jetzt hier runter, dann holen wir die Goo Bälle von da unten."}, {"id": 705, "start": 5116.56, "end": 5123.56, "text": "Aufwachen."}, {"id": 706, "start": 5123.56, "end": 5125.56, "text": "Aufwachen."}, {"id": 707, "start": 5125.56, "end": 5133.56, "text": "Und dann müssen wir irgendwie da rein."}, {"id": 708, "start": 5133.56, "end": 5140.56, "text": "Ja Sebaro, in BDO machst du immer Kreisel grind, egal ob Mainquest oder nicht."}, {"id": 709, "start": 5140.56, "end": 5143.56, "text": "Ich hab die Mainquests selbst noch nicht mal durch."}, {"id": 710, "start": 5143.56, "end": 5154.56, "text": "Wie lange geht das Stream heute? Keine Ahnung, wahrscheinlich noch so eine Stunde oder so."}, {"id": 711, "start": 5154.56, "end": 5161.56, "text": "Oh jetzt wirds natürlich schwierig, jetzt müssen wir irgendwie hier rein."}, {"id": 712, "start": 5161.56, "end": 5166.56, "text": "Die sind für Wassertropfen verdammt stabil sag ich euch."}, {"id": 713, "start": 5166.56, "end": 5175.56, "text": "Ich ahne Schlimmes, Leute ich ahne Schlimmes."}, {"id": 714, "start": 5175.56, "end": 5180.56, "text": "Ich muss das in die entgegengesetzte Richtung noch bauen oder?"}, {"id": 715, "start": 5180.56, "end": 5191.56, "text": "Kann man die Wassertropfen voneinander wieder abdingsen? Nee kann man nicht."}, {"id": 716, "start": 5191.56, "end": 5195.56, "text": "Ich glaube ich muss da noch mal kurz in die entgegengesetzte Richtung bauen, sonst fällt das wieder runter."}, {"id": 717, "start": 5195.56, "end": 5205.56, "text": "Wobei, komm scheiß drauf."}, {"id": 718, "start": 5205.56, "end": 5210.56, "text": "Komm jetzt, komm jetzt."}, {"id": 719, "start": 5210.56, "end": 5215.56, "text": "Jawoll, easy."}, {"id": 720, "start": 5215.56, "end": 5221.56, "text": "Einfach nicht zu sehr überdenken alles, einfach mal ein bisschen machen."}, {"id": 721, "start": 5221.56, "end": 5233.56, "text": "Hast du eigentlich so Kartenspiele wie Matching oder Yu-Gi-Oh gespielt? Ja ich hab Yu-Gi-Oh gespielt."}, {"id": 722, "start": 5233.56, "end": 5238.56, "text": "Und die Noobs geohnt, die die Serie geguckt haben, gedacht haben sie wissen Bescheid."}, {"id": 723, "start": 5263.56, "end": 5283.56, "text": "Oh jetzt muss ich erstmal da drüber fliegen."}, {"id": 724, "start": 5283.56, "end": 5289.56, "text": "Okay jetzt muss ich irgendwie da drüber kommen."}, {"id": 725, "start": 5289.56, "end": 5296.56, "text": "Ey das funktioniert. Oh das ist natürlich ganz, oh das ist übertriebenes."}, {"id": 726, "start": 5296.56, "end": 5303.56, "text": "Gefummelt, aber kein Ding."}, {"id": 727, "start": 5303.56, "end": 5308.56, "text": "Und wo muss ich überhaupt hinfliegen? Ich flieg jetzt hier rüber, dann lande ich hier."}, {"id": 728, "start": 5308.56, "end": 5318.56, "text": "Jetzt hab ich rückgängig gemacht, natürlich ganz toll."}, {"id": 729, "start": 5318.56, "end": 5324.56, "text": "Dann lande ich hier und dann hangel ich mich hier runter zur Röhre."}, {"id": 730, "start": 5324.56, "end": 5332.56, "text": "Klingt nach einem guten Plan, so machen wir das."}, {"id": 731, "start": 5332.56, "end": 5346.56, "text": "Der Sound ist toll."}, {"id": 732, "start": 5346.56, "end": 5352.56, "text": "So jetzt sind wir hier drüber, sind wir drüber? Na ein Stück können wir noch rüber."}, {"id": 733, "start": 5352.56, "end": 5357.56, "text": "So jetzt fliegen wir runter."}, {"id": 734, "start": 5357.56, "end": 5359.56, "text": "Der Max hat schon immer Noobs geohnt."}, {"id": 735, "start": 5359.56, "end": 5366.56, "text": "Es war am Anfang, als die ganzen Leute diese komische Yu-Gi-Oh Fernsehserie geguckt haben, war es auch geil."}, {"id": 736, "start": 5366.56, "end": 5369.56, "text": "Die meisten Leute haben sich ja null mit dem Game beschäftigt."}, {"id": 737, "start": 5369.56, "end": 5373.56, "text": "Ich weiß leider auch, ich hab wieder fast alles vergessen."}, {"id": 738, "start": 5373.56, "end": 5378.56, "text": "Ich glaube Yu-Gi-Oh hatte ja gar keine festen Kartenbeschränkungen."}, {"id": 739, "start": 5378.56, "end": 5383.56, "text": "Also du konntest theoretisch so viele Karten nehmen, wie du willst."}, {"id": 740, "start": 5383.56, "end": 5386.56, "text": "Da bin ich mir jetzt aber nicht mal so ganz sicher."}, {"id": 741, "start": 5386.56, "end": 5394.56, "text": "Oder zumindest war die Anzahl der Karten, die du nehmen konntest so hoch, dass keiner maximale Anzahl genommen hat."}, {"id": 742, "start": 5394.56, "end": 5398.56, "text": "Und du hattest halt irgendwelche Leute, die haben dann den ganzen Bullshit reingepackt."}, {"id": 743, "start": 5398.56, "end": 5407.56, "text": "Also irgendwie dieser komische blaue Drache aus der Serie, obwohl die überhaupt keine Monster dazu hatten, um das Ding zu beschweren."}, {"id": 744, "start": 5407.56, "end": 5411.56, "text": "Und da hattest du dann halt diese Totenkopfkarte."}, {"id": 745, "start": 5411.56, "end": 5415.56, "text": "Ich hab jetzt alles vergessen, wie das Zeug hieß."}, {"id": 746, "start": 5415.56, "end": 5422.56, "text": "Dieser Totenkopf, den du quasi, so die beste Karte damals, die du direkt beschweren konntest."}, {"id": 747, "start": 5422.56, "end": 5423.56, "text": "Oder eine der besten."}, {"id": 748, "start": 5423.56, "end": 5432.56, "text": "Und die haben halt rumgegangen mit Billigmonstern, weil sie halt so ein auf geiler Tüt wie aus der Serie machen wollten."}, {"id": 749, "start": 5432.56, "end": 5440.56, "text": "Wobei es gibt ja auf YouTube viele Videos, die die Yu-Gi-Oh! Serie ein bisschen analysiert haben."}, {"id": 750, "start": 5440.56, "end": 5454.56, "text": "Und quasi mal erzählen, was die eigentlich in der Serie für eine Scheiße spielen, die laut Regeln überhaupt nicht erlaubt ist."}, {"id": 751, "start": 5454.56, "end": 5457.56, "text": "So ich geh mal davon aus, ich muss jetzt hier rüberfliegen."}, {"id": 752, "start": 5457.56, "end": 5476.56, "text": "Und dann hier mit dem kleinen, mit dem Wasserguss das Zeug rüber runter dröpfeln lassen."}, {"id": 753, "start": 5476.56, "end": 5484.56, "text": "Wir machen mal ein Ballon weg, weil wir wollen ein bisschen tiefer fliegen."}, {"id": 754, "start": 5484.56, "end": 5489.56, "text": "Nee, wir müssen noch ein bisschen rüber."}, {"id": 755, "start": 5489.56, "end": 5498.56, "text": "So, ja das ist gut, das passt."}, {"id": 756, "start": 5498.56, "end": 5506.56, "text": "Ok, das sieht doch ganz gut aus."}, {"id": 757, "start": 5506.56, "end": 5514.56, "text": "Das hängt jetzt aber nicht gerade, gerade. Kann ich einen auch hier hin machen, hängt es dann gerade?"}, {"id": 758, "start": 5514.56, "end": 5520.56, "text": "Ja, ja das sieht ganz gut aus."}, {"id": 759, "start": 5520.56, "end": 5538.56, "text": "Plopp, plopp, plopp, plopp, jawoll."}, {"id": 760, "start": 5538.56, "end": 5543.56, "text": "Überhaupt kein Ding."}, {"id": 761, "start": 5543.56, "end": 5547.56, "text": "Alles gepackt, next."}, {"id": 762, "start": 5547.56, "end": 5551.56, "text": "Packt Champ."}, {"id": 763, "start": 5551.56, "end": 5578.56, "text": "So realistische Physik, ja."}, {"id": 764, "start": 5578.56, "end": 5585.56, "text": "Was Pavillon, es gibt eine neue Yu-Gi-Oh! Serie, wirklich?"}, {"id": 765, "start": 5585.56, "end": 5591.56, "text": "Ich hab, ich glaub ich bin einer wenigen, die das gespielt haben, aber nie wirklich die Serie geguckt haben."}, {"id": 766, "start": 5591.56, "end": 5599.56, "text": "Klar, ab und zu mal irgendwelche Folgen oder so, ich fand das irgendwie bescheuert."}, {"id": 767, "start": 5599.56, "end": 5603.56, "text": "Vor allem halt dieses typische Zeug, so wie es halt in Yu-Gi-Oh! immer gewesen ist."}, {"id": 768, "start": 5603.56, "end": 5611.56, "text": "Oh mein Gott, weißt du, wenn man von irgendwas getroffen wurde, was ja laut dieser Serie nur quasi Hologramm war,"}, {"id": 769, "start": 5611.56, "end": 5618.56, "text": "ne, da kommt dann irgendein Monster, attackiert, und es ist halt sogar in der Story von der Serie, es ist halt nur ein Hologramm, es ist halt nicht echt, ja."}, {"id": 770, "start": 5618.56, "end": 5625.56, "text": "Und die Leute, und dann in der Serie immer dann alle Charaktere, wenn sie gehittet werden."}, {"id": 771, "start": 5625.56, "end": 5629.56, "text": "Fand ich schon damals übelst bescheuert."}, {"id": 772, "start": 5629.56, "end": 5639.56, "text": "Vor allem, wenn sie dann immer angekündigt haben, den Scheiß so, ich beschwöre jetzt, was weiß ich, krasser Owner, 8000, haben sie es dann beschwört, ne."}, {"id": 773, "start": 5639.56, "end": 5646.56, "text": "Und da kommt dann der andere, da antwortet dann der andere Typ in diesem Duell an, das kannst du nicht tun."}, {"id": 774, "start": 5646.56, "end": 5652.56, "text": "Und dann sagt dann der andere noch, ha, du willst sehen, wie ich das kann, aber nicht, wenn ich jetzt meine Fallenkarte..."}, {"id": 775, "start": 5652.56, "end": 5660.56, "text": "Das war dann immer so, oh, das ging mir etwas, ich hab das nie großartig geguckt."}, {"id": 776, "start": 5660.56, "end": 5663.56, "text": "Das war richtig beknackt eigentlich."}, {"id": 777, "start": 5663.56, "end": 5669.56, "text": "Und dann haben sie immer so getan in der Serie, als wären sie jetzt voll überrascht, so, oh mein Gott, nein, das geht doch nicht."}, {"id": 778, "start": 5669.56, "end": 5676.56, "text": "Und dann nächste Runde steht dann so da, ha, ha, ha, damit habe ich gerechnet, dass du diese Karte jetzt spielst."}, {"id": 779, "start": 5676.56, "end": 5682.56, "text": "Ha, ha, und deswegen beschwöre ich jetzt die einzige Karte, die es in dem Spiel gibt, die genau dagegen wirkt."}, {"id": 780, "start": 5682.56, "end": 5692.56, "text": "Richtig eng geblieben."}, {"id": 781, "start": 5692.56, "end": 5695.56, "text": "Oh, das sieht kompliziert aus."}, {"id": 782, "start": 5695.56, "end": 5700.56, "text": "Wie heißt denn das Level noch mal?"}, {"id": 783, "start": 5700.56, "end": 5712.56, "text": "Steht nicht da."}, {"id": 784, "start": 5712.56, "end": 5721.56, "text": "Ich glaube, der Schildermaler möchte uns irgendwie die Story von World of Goo näherbringen."}, {"id": 785, "start": 5721.56, "end": 5729.56, "text": "Was, es gibt mittlerweile sechs Serien, die fangen ja immer wieder mit neuem Charakter an. Ach so, das sind andere."}, {"id": 786, "start": 5729.56, "end": 5738.56, "text": "Echt, wie gesagt, null beschäftigt. So, wie funktioniert denn das Ganze hier jetzt?"}, {"id": 787, "start": 5738.56, "end": 5743.56, "text": "Ich hab nur, ich hab nur Wasser, Guss, oder?"}, {"id": 788, "start": 5743.56, "end": 5752.56, "text": "Die schwarzen Dinger gehen eigentlich."}, {"id": 789, "start": 5752.56, "end": 5756.56, "text": "Okay, ich glaube, ich habe ungefähr gecheckt, was ich machen muss."}, {"id": 790, "start": 5756.56, "end": 5766.56, "text": "Ich habe so meinen Zweifel, ob das funktioniert."}, {"id": 791, "start": 5766.56, "end": 5773.56, "text": "Wobei, das könnte schon funktionieren."}, {"id": 792, "start": 5773.56, "end": 5777.56, "text": "So, und jetzt machen wir im Endeffekt, jetzt bauen wir hier vorne einen."}, {"id": 793, "start": 5777.56, "end": 5787.56, "text": "Und da haben wir direkt einen Luftballon dran. Ja, das funktioniert."}, {"id": 794, "start": 5787.56, "end": 5792.56, "text": "Und dann muss ich, und dann muss ich über diese Windmühle drüber bauen."}, {"id": 795, "start": 5792.56, "end": 5798.56, "text": "Game, ernsthaft jetzt, ja? Und dann, wo muss ich hin?"}, {"id": 796, "start": 5798.56, "end": 5802.56, "text": "Oh, ob das was wird. Das heißt, ich muss mich jetzt hier mit Luftballon hochhangeln."}, {"id": 797, "start": 5802.56, "end": 5808.56, "text": "Und dann quasi mit dem Wind mich irgendwie..."}, {"id": 798, "start": 5808.56, "end": 5814.56, "text": "Na, da wollen wir mal. Easy clap, das ist überhaupt kein Ding."}, {"id": 799, "start": 5814.56, "end": 5821.56, "text": "Wisst ihr, Leute, ich habe es schon immer gesagt, es ist immer alles easy, bis man sagt, es ist nicht easy."}, {"id": 800, "start": 5821.56, "end": 5825.56, "text": "Deswegen ist das einfachste Level überhaupt hier."}, {"id": 801, "start": 5825.56, "end": 5845.56, "text": "Das ist schon too easy."}, {"id": 802, "start": 5845.56, "end": 5858.56, "text": "Der Luftballon-Sound, der macht einen so ein bisschen komisch im Kopf, ne?"}, {"id": 803, "start": 5858.56, "end": 5862.56, "text": "Okay, eigentlich sind wir hoch genug. Was passiert jetzt, wenn ich hier so ein Ding dran hänge?"}, {"id": 804, "start": 5862.56, "end": 5866.56, "text": "Schwebt das dann schon im Wind?"}, {"id": 805, "start": 5866.56, "end": 5871.56, "text": "Das schwebt schon im Wind, okay."}, {"id": 806, "start": 5871.56, "end": 5879.56, "text": "Ja, nicht so ganz. Okay, wir müssen noch mal eins weiter machen."}, {"id": 807, "start": 5879.56, "end": 5886.56, "text": "So, ich glaube, das reicht. Und jetzt hängen wir die dran und dann lassen wir uns hier runter hängen, so."}, {"id": 808, "start": 5886.56, "end": 5892.56, "text": "Guck mal, guck mal, das passt. Ich müsste ziemlich genau da rauskommen, glaube ich."}, {"id": 809, "start": 5892.56, "end": 5902.56, "text": "Aber die Physik verhält sich so, wie ich mir das gedacht habe."}, {"id": 810, "start": 5902.56, "end": 5920.56, "text": "Nein!"}, {"id": 811, "start": 5920.56, "end": 5924.56, "text": "Hier habe ich noch einen."}, {"id": 812, "start": 5924.56, "end": 5930.56, "text": "Wir müssen das hier ein bisschen höher machen in der Mitte."}, {"id": 813, "start": 5930.56, "end": 5940.56, "text": "Ja, ja, das funktioniert. Ja, das klappt, das klappt, das klappt, das klappt."}, {"id": 814, "start": 5940.56, "end": 5945.56, "text": "Das klappt, das klappt, das klappt schon easy. Guck mal an."}, {"id": 815, "start": 5945.56, "end": 5955.56, "text": "Oh, wir sind zu weit. Wir sind viel zu weit."}, {"id": 816, "start": 5955.56, "end": 5966.56, "text": "Oh, doch, es hängt wieder, es hängt runter. Perfekt."}, {"id": 817, "start": 5966.56, "end": 5972.56, "text": "Okay, so richtig funktioniert das so nicht. Da müssen wir hier noch ein paar abmachen und dahinter hängen."}, {"id": 818, "start": 5972.56, "end": 5979.56, "text": "Und dann sollten die hier weiter runterfallen. Ja. Gut. Sehr gut."}, {"id": 819, "start": 5979.56, "end": 5988.56, "text": "Zieh auf, wir kommen der Sache näher. Perfekt. Komm jetzt noch ein Stückchen, noch ein Stückchen."}, {"id": 820, "start": 5988.56, "end": 5997.56, "text": "Okay, okay. Ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja, ja."}, {"id": 821, "start": 5997.56, "end": 5999.56, "text": "Ja, ja, ja. Komm, komm. Jawohl!"}, {"id": 822, "start": 6001.06, "end": 6003.06, "text": "Oh, oh, oh. Nicht, nicht, nicht kaputtgehen jetzt."}, {"id": 823, "start": 6003.06, "end": 6004.66, "text": "Komm, es fehlen nicht mehr viel."}, {"id": 824, "start": 6004.66, "end": 6007.02, "text": "Es fehlen nicht mehr viel Gooballs. Macht hinne!"}, {"id": 825, "start": 6010.36, "end": 6011.86, "text": "Oh! War das knapp!"}, {"id": 826, "start": 6012.8, "end": 6015.6, "text": "Haha, f**kt, das war knapp!"}, {"id": 827, "start": 6017.34, "end": 6018.84, "text": "Ist doch eingebrochen!"}, {"id": 828, "start": 6020.52, "end": 6022.82, "text": "Monka X, da reicht Monka S nicht mehr."}, {"id": 829, "start": 6022.82, "end": 6024.34, "text": "Da brauchen wir Monka X für."}, {"id": 830, "start": 6024.76, "end": 6026.28, "text": "Hab ich, hab ich eigentlich? Moment."}, {"id": 831, "start": 6026.92, "end": 6028.92, "text": "Hab ich noch nicht mal freigeschaltet"}, {"id": 832, "start": 6035.72, "end": 6038.36, "text": "Okay, hast du schon irgendwas zu übersehen im Chat"}, {"id": 833, "start": 6042.16, "end": 6044.16, "text": "Hast du mal Subnautica gespielt?"}, {"id": 834, "start": 6045.96, "end": 6047.6, "text": "Ich hab mir das"}, {"id": 835, "start": 6047.6, "end": 6050.12, "text": "Weil irgendwann auf Steam als es noch early war das"}, {"id": 836, "start": 6050.64, "end": 6054.48, "text": "Das war Early Access oder war das ein Beta oder so mal angeguckt"}, {"id": 837, "start": 6054.48, "end": 6057.8, "text": "Also wurde empfohlen im Steam Store"}, {"id": 838, "start": 6058.72, "end": 6060.72, "text": "Hab ich mir gedacht so"}, {"id": 839, "start": 6060.84, "end": 6064.04, "text": "Auf Survival unter Wasser stellen, das hab ich keine Lust"}, {"id": 840, "start": 6074.2, "end": 6077.56, "text": "Wie sich jetzt alle erzählen, wie sie die Yu-Gi-Oh! Serie angeguckt haben"}, {"id": 841, "start": 6078.56, "end": 6081.12, "text": "Genau, das Spiel der Schatten, das gab's auch noch"}, {"id": 842, "start": 6081.12, "end": 6083.12, "text": "Ja"}, {"id": 843, "start": 6083.16, "end": 6087.2, "text": "So was, was komplett, was es in der Original-Fassung nie gegeben hat"}, {"id": 844, "start": 6087.8, "end": 6092.2, "text": "Wie findest du D-Lan? Findest du D-Lan ist deine Alternative zu W-Lan? Nö"}, {"id": 845, "start": 6092.76, "end": 6096.08, "text": "Weil W-Lan funktioniert überall, D-Lan funktioniert nur da wo Steckdosen sind"}, {"id": 846, "start": 6096.52, "end": 6098.52, "text": "Es ist überhaupt keine Alternative zu W-Lan"}, {"id": 847, "start": 6099.0, "end": 6103.0, "text": "Wie willst du mit D-Lan in deine Gartenhütte"}, {"id": 848, "start": 6103.0, "end": 6110.4, "text": "Internetversorgung kriegen, wenn du da sitzt und grillst und irgendwie W-Lan empfangen haben willst"}, {"id": 849, "start": 6115.16, "end": 6120.48, "text": "D-Lan ist höchstens eine Alternative zu Netzwerkkabel legen im Haus"}, {"id": 850, "start": 6121.32, "end": 6123.32, "text": "Und selbst da muss ich sagen"}, {"id": 851, "start": 6124.16, "end": 6125.68, "text": "Also"}, {"id": 852, "start": 6125.68, "end": 6131.04, "text": "Wenn man irgendwie Sinn kriegt Netzwerkkabel zu legen, würde ich Netzwerkkabel legen anstatt diesen"}, {"id": 853, "start": 6131.04, "end": 6133.04, "text": "über Strom"}, {"id": 854, "start": 6133.96, "end": 6135.96, "text": "Netzwerkzeugs da"}, {"id": 855, "start": 6152.12, "end": 6156.92, "text": "Holst du dir dieses Jahr kein neues Kaspersky? Ja, das ist eine gute Entscheidung"}, {"id": 856, "start": 6156.92, "end": 6161.64, "text": "Was hältst du von Monster Hunter World? Ich hab's noch nicht gespielt, ich wollte das mit dem Farmirnir spielen"}, {"id": 857, "start": 6162.92, "end": 6166.92, "text": "Hier fehlen FFZ-Emoves. Wie macht man denn FFZ-Emoves?"}, {"id": 858, "start": 6167.96, "end": 6175.4, "text": "Gibt's da so eine Seite wie bei Bella Twitch TV wo man FFZ-Emoves freischalten kann? Da mach ich das nämlich nachher gleich"}, {"id": 859, "start": 6178.28, "end": 6180.28, "text": "Guckst du irgendwelche Serienfilme?"}, {"id": 860, "start": 6181.08, "end": 6183.08, "text": "Ne, also ich guck generell wenig"}, {"id": 861, "start": 6183.08, "end": 6189.24, "text": "Wenig so klassische Sachen. Klar ich guck ab und zu mal einen Film auf Amazon, aber Serien"}, {"id": 862, "start": 6190.96, "end": 6196.6, "text": "Wenig. Das letzte, was war das letzte was ich geguckt hab? True Detectives hab ich glaube ich geguckt, das fand ich dann schlecht."}, {"id": 863, "start": 6196.6, "end": 6200.68, "text": "Davor hab ich mal Black Sails geguckt, so Pirate Stealths"}, {"id": 864, "start": 6205.32, "end": 6207.32, "text": "Und jetzt müsste ich mal nachgucken"}, {"id": 865, "start": 6207.64, "end": 6211.16, "text": "Ich müsste mal warten, ich hab jetzt mal nachgucken, ich hab jetzt mal nachgucken"}, {"id": 866, "start": 6211.16, "end": 6216.76, "text": "Ich müsste jetzt mal bei Amazon gucken, was ich mir da jetzt geholt hab. Ich hab schon ein paar Sachen geguckt, war"}, {"id": 867, "start": 6218.12, "end": 6220.12, "text": "Es gibt schon ein paar ganz coole Filme"}, {"id": 868, "start": 6221.4, "end": 6225.64, "text": "Aber das Problem ist, ich merke es immer wieder, wir bleiben die Sachen meistens nicht in Erinnerung"}, {"id": 869, "start": 6226.12, "end": 6230.36, "text": "Und das spricht es nicht unbedingt für das Zeug. Moment mal Leute, ich guck jetzt mal"}, {"id": 870, "start": 6230.36, "end": 6239.32, "text": "Was ich bei Amazon, was hab ich zuletzt bei Amazon geguckt? Das kann man bestimmt sortieren, oder?"}, {"id": 871, "start": 6241.88, "end": 6245.0, "text": "Kann man Amazon Bestellungen nach Videos sortieren? Ja"}, {"id": 872, "start": 6245.0, "end": 6266.12, "text": "True Detectives, Staffel 1 hab ich geguckt. Simon scant Vol. 1, als weil ich das immer auf YouTube guck. Der hat einen Film in Farbe gemacht, das hab ich mir noch geholt"}, {"id": 873, "start": 6266.12, "end": 6271.88, "text": "Hab ich den geguckt, The Accountant hab ich geschaut. Alo und Spot, ja so Animationsfilme, da steh ich ja drauf"}, {"id": 874, "start": 6271.88, "end": 6283.4, "text": "Die Gross in the Shell, Realverfilmung hab ich geguckt. John Wick, Passengers, was hab ich denn noch so? Black Sails"}, {"id": 875, "start": 6286.2, "end": 6289.64, "text": "Staffel 1, 2, 3, 4, Deadpool"}, {"id": 876, "start": 6289.64, "end": 6307.56, "text": "Ja, also ich hab schon ein paar Filme geguckt, so richtig krasse Erinnerungen. Also ich muss sagen, der Film, der mir in den letzten Jahren am meisten in Erinnerung geblieben ist, wo ich sagen muss, der ist nicht wirklich gut, aber der ist voll abgedreht, das war Hardcore Henry"}, {"id": 877, "start": 6307.56, "end": 6321.48, "text": "Das ist mir echt, falls das jemand kennt, das ist mir echt in Erinnerung geblieben. Wahrscheinlich gefällt es bloß Leuten, die Cod spielen oder so, oder Battlefield, keine Ahnung, ich fand das übelst geil"}, {"id": 878, "start": 6321.48, "end": 6329.72, "text": "Einfach mal Filme komplett mit GoPros gedreht, oder eben mit irgendwelchen Actioncams. Moment, was muss ich hier eigentlich machen?"}, {"id": 879, "start": 6329.72, "end": 6344.76, "text": "Hardcore was? Hardcore Henry, was heißt das? Das ist komplett aus Ego Perspektive gedreht, so mit irgendwelchen Actioncams"}, {"id": 880, "start": 6344.76, "end": 6362.68, "text": "Das fand ich übelst geil, ich meine, der Film ist objektiv, also wenn jetzt der krasse Kritiker hingeht und dann zerreißt den Film, also wirklich gut ist der, aber der ist geil gemacht"}, {"id": 881, "start": 6362.68, "end": 6375.0, "text": "Ich muss übrigens mal gucken, ob ich noch mehr De-Abos bekommen habe, weil irgendwelche Leute sich wieder auf den Schlips gedreht und gefühlt haben, weil ich den Viren-Scanner schlecht gemacht habe"}, {"id": 882, "start": 6375.0, "end": 6384.12, "text": "Ja, zwei, drei mehr oder so, ich finde das so geil, wie die Leute mit sowas Probleme haben"}, {"id": 883, "start": 6384.12, "end": 6411.8, "text": "Ich glaube, ich muss das hochheben"}, {"id": 884, "start": 6411.8, "end": 6430.12, "text": "Und jetzt muss ich, was muss ich jetzt machen? Jetzt muss ich hier wahrscheinlich die grünen Goo Balls andocken, dass ich mich hier hoch schaufeln kann"}, {"id": 885, "start": 6430.12, "end": 6443.4, "text": "Vermute ich mal, keine Ahnung, ob das irgendwie stimmt, was ich hier mache"}, {"id": 886, "start": 6443.4, "end": 6471.96, "text": "Na, ob das so klappt, woa, woa, woa, woa, woa, das ist so gedacht, ich meine, ich brauche 36, das sind ordentlich viele, die hier rumschwimmen"}, {"id": 887, "start": 6471.96, "end": 6484.6, "text": "Oh, da unten ist noch was"}, {"id": 888, "start": 6484.6, "end": 6496.2, "text": "Gucken wir doch mal, gucken wir mal, ob das reicht, ob ich genug gerettet habe"}, {"id": 889, "start": 6496.2, "end": 6504.36, "text": "Deswegen braucht man auch die ganzen Ballons, weil man so viel hat"}, {"id": 890, "start": 6504.36, "end": 6514.44, "text": "Magst du streamen oder magst du Video gucken? Ja, das ist schwierig, ich würde sagen, magst du streamen, weil es geht nicht mehr so lange, dann kannst du Video gucken"}, {"id": 891, "start": 6514.44, "end": 6518.04, "text": "Ich muss ja morgen wieder arbeiten, das heißt, ich muss dann irgendwann auch demnächst pennen"}, {"id": 892, "start": 6518.04, "end": 6528.28, "text": "Oh, oh, so jetzt gucken wir mal, wie viel wir haben, genug, genug, überhaupt kein Ding"}, {"id": 893, "start": 6528.28, "end": 6536.84, "text": "50 von 36, da kann ja wirklich nichts schief gehen"}, {"id": 894, "start": 6536.84, "end": 6542.6, "text": "Zu gute Auflösung für den Stream, äh, Streamer zu gute Auflösung für dich"}, {"id": 895, "start": 6542.6, "end": 6551.16, "text": "Ähm, ja, ich kriege ja heute keine Quality Options"}, {"id": 896, "start": 6551.16, "end": 6555.32, "text": "Ich gucke mal, ich weiß ja nicht, was ich dagegen machen soll, ehrlich gesagt"}, {"id": 897, "start": 6555.32, "end": 6561.48, "text": "Ich hatte immer Quality Options, ich weiß nicht, wo die jetzt hin sind"}, {"id": 898, "start": 6561.48, "end": 6567.8, "text": "Vielleicht möchte mir Twitch damit auch sagen, ich soll sie mal anschreiben wegen, äh, ne, Partner und so"}, {"id": 899, "start": 6567.8, "end": 6592.36, "text": "Kann ja sein"}, {"id": 900, "start": 6592.36, "end": 6597.72, "text": "Super, easy"}, {"id": 901, "start": 6597.72, "end": 6604.12, "text": "Beauty School"}, {"id": 902, "start": 6604.12, "end": 6606.44, "text": "Stream mit 30 FPS, du hast Quality Options"}, {"id": 903, "start": 6606.44, "end": 6612.04, "text": "Ne, ich habe am Anfang 1080p 30 FPS gestreamt, ich hatte auch keine Quality Options"}, {"id": 904, "start": 6612.04, "end": 6617.88, "text": "Deswegen habe ich, ähm, dann umgeschaltet und jetzt habe ich auch keine Quality Options"}, {"id": 905, "start": 6617.88, "end": 6621.16, "text": "Als letztes Mal, ja, hatte ich das"}, {"id": 906, "start": 6621.16, "end": 6628.2, "text": "Weiß nicht, bei uns, das letzte Mal waren es auch 48 FPS, was ich probiert habe"}, {"id": 907, "start": 6628.2, "end": 6631.72, "text": "War das nicht früher sogar so, dass nur Raring Fights Auflösung hatten?"}, {"id": 908, "start": 6631.72, "end": 6635.8, "text": "Äh, keine Ahnung, ich hatte immer Quality Options, egal mit was ich gestreamt habe bisher"}, {"id": 909, "start": 6635.8, "end": 6643.96, "text": "Ich habe immer bisher mit 6 MBit gestreamt, 6 MBit, entweder 1080, 30 oder 7720, 60 oder 48"}, {"id": 910, "start": 6643.96, "end": 6652.6, "text": "Und immer Quality Options"}, {"id": 911, "start": 6652.6, "end": 6660.2, "text": "Ich probiere das das nächste Mal aus, ich stelle dann wieder auf 30, mal gucken ob es dann funktioniert"}, {"id": 912, "start": 6660.2, "end": 6667.08, "text": "Außerdem soll Twitch allgemein, Twitch muss mal langsam ein bisschen mehr als 6 MBit erlauben"}, {"id": 913, "start": 6667.08, "end": 6675.8, "text": "Was ist das?"}, {"id": 914, "start": 6675.8, "end": 6681.0, "text": "Ein Grill-Goo"}, {"id": 915, "start": 6681.0, "end": 6693.8, "text": "Also wenn, wenn Twitch das hinkriegt, dass man, dass man, sagen wir mal, mit 8 MBit, 8 MBit wäre schon"}, {"id": 916, "start": 6693.8, "end": 6700.52, "text": "Sogar 7 fände ich schon gut, 6 MBit ist einfach für 1080p ein bisschen wenig"}, {"id": 917, "start": 6700.52, "end": 6707.8, "text": "8 MBit, am besten wäre natürlich 10, aber sagen wir mal, die können es doch so machen wie YouTube"}, {"id": 918, "start": 6707.8, "end": 6712.6, "text": "Ich meine als Amazon mittlerweile, dahinter, die haben ja nicht zu wenig Rechenleistung oder so"}, {"id": 919, "start": 6712.6, "end": 6723.0, "text": "Könnten doch einfach sagen, wir erlauben 1440p mit 15 MBit, so, und dann Transcoden sie das irgendwie"}, {"id": 920, "start": 6723.0, "end": 6734.04, "text": "Ich meine, ich weiß, das kostet ordentlich Rechenleistung, ja, aber es wäre ja okay, wenn man das für Streams macht, die ein bisschen Zuschauer haben"}, {"id": 921, "start": 6734.04, "end": 6741.8, "text": "Das muss doch funktionieren, so, was muss ich denn hier überhaupt machen?"}, {"id": 922, "start": 6741.8, "end": 6744.52, "text": "Wer ist der hübscheste Goo Ball?"}, {"id": 923, "start": 6744.52, "end": 6748.04, "text": "Tja"}, {"id": 924, "start": 6748.04, "end": 6750.28, "text": "Das Goo Ball Grill"}, {"id": 925, "start": 6750.28, "end": 6758.68, "text": "Wow, wo sollte das jetzt wegfliegen?"}, {"id": 926, "start": 6758.68, "end": 6768.44, "text": "Oh, Leute, wir müssen das Goo Ball Grill zerstören, seht ihr das?"}, {"id": 927, "start": 6768.44, "end": 6772.76, "text": "Das ist ja tragisch"}, {"id": 928, "start": 6772.76, "end": 6775.88, "text": "Wahrscheinlich kommen jetzt die Feministen in mein Stream"}, {"id": 929, "start": 6775.88, "end": 6794.2, "text": "Und wollen, dass ich gelöscht werde, weil ich das Goo Ball Grill reinwerfen muss"}, {"id": 930, "start": 6794.2, "end": 6806.44, "text": "Instant Band"}, {"id": 931, "start": 6806.44, "end": 6809.8, "text": "Holst du dir Kingdom Come Deliverance, nee"}, {"id": 932, "start": 6809.8, "end": 6815.4, "text": "Was war dieses, dieses Asiahacken slash Diablo Style Game, ne?"}, {"id": 933, "start": 6815.4, "end": 6828.28, "text": "Hallo Alex"}, {"id": 934, "start": 6828.28, "end": 6832.6, "text": "Wieso die das machen, oh Storytime"}, {"id": 935, "start": 6832.6, "end": 6842.76, "text": "Ich verstehe die Story nicht"}, {"id": 936, "start": 6842.76, "end": 6848.76, "text": "Ich finde, sie sollten es erlauben, dass du in guter Qualität zu Twitch Streams"}, {"id": 937, "start": 6848.76, "end": 6852.68, "text": "Und dann sollen sie das halt transcode, dann können sie sagen, okay"}, {"id": 938, "start": 6852.68, "end": 6859.4, "text": "Die Leute, die eine fett genaue Leitung haben, können sich das quasi Source angucken, 1440p mit, keine Ahnung, 15 Mbit"}, {"id": 939, "start": 6859.4, "end": 6866.12, "text": "Und die anderen werden halt runtergerechnet auf, sagen wir mal, 8, 1080p"}, {"id": 940, "start": 6866.12, "end": 6871.96, "text": "Oder, sagen wir mal, auf 6 für 720p, das wäre halt sehr praktisch"}, {"id": 941, "start": 6871.96, "end": 6876.68, "text": "Er sieht einfach, Twitch ist die Seite mit der hässlichsten Videoqualität"}, {"id": 942, "start": 6876.68, "end": 6880.04, "text": "Also die Stream-Seite mit der hässlichsten Videoqualität"}, {"id": 943, "start": 6880.04, "end": 6883.88, "text": "Aber trotzdem, gleichzeitig die beste"}, {"id": 944, "start": 6883.88, "end": 6886.12, "text": "Das liegt halt nicht an der Videoqualität"}, {"id": 945, "start": 6886.12, "end": 6891.8, "text": "Sondern an einem anderen Drumherum"}, {"id": 946, "start": 6891.8, "end": 6894.04, "text": "Als Partner geht das bestimmt, aber wobei"}, {"id": 947, "start": 6894.04, "end": 6899.4, "text": "Als Partner kriegst du auch nicht mehr Bitrate oder nur ganz, ganz zu ganz speziellen Angest"}, {"id": 948, "start": 6899.4, "end": 6905.72, "text": "Also hier, Danz Gaming hat ja auch, der streamt ja auch nur irgendwas mit 6, 6-7 Mbit"}, {"id": 949, "start": 6905.72, "end": 6907.72, "text": "Also der kriegt auch nicht mehr"}, {"id": 950, "start": 6907.72, "end": 6909.72, "text": "Was muss ich denn hier machen, jetzt?"}, {"id": 951, "start": 6918.76, "end": 6921.24, "text": "Ich muss wieder den, den Scoop Ball Grill kaputt machen"}, {"id": 952, "start": 6926.52, "end": 6929.32, "text": "Pretty flower, I wonder happens when you get closer"}, {"id": 953, "start": 6929.32, "end": 6931.32, "text": "Das wollen wir mal ausprobieren"}, {"id": 954, "start": 6936.36, "end": 6938.36, "text": "Die Pipe sackt"}, {"id": 955, "start": 6938.36, "end": 6941.8, "text": "Also ich vermute mal, was ich jetzt machen muss, ist hier einfach hochbauen"}, {"id": 956, "start": 6941.8, "end": 6947.8, "text": "Bis, bis, bis das Scoop Ball Grill hier oben in den Häcksler gesaugt wird"}, {"id": 957, "start": 6950.44, "end": 6952.44, "text": "Dann fallen die Scoop Balls hier runter"}, {"id": 958, "start": 6954.44, "end": 6956.44, "text": "Und hier unten durch"}, {"id": 959, "start": 6956.44, "end": 6958.44, "text": "So stelle ich mir das gerade vor"}, {"id": 960, "start": 6958.44, "end": 6960.44, "text": "Mal gucken, ob das so funktioniert"}, {"id": 961, "start": 6970.44, "end": 6972.44, "text": "Oh, da muss ich aufpassen, dass es jetzt runterfällt"}, {"id": 962, "start": 6972.44, "end": 6982.44, "text": "Ja, da muss man aufpassen"}, {"id": 963, "start": 6982.44, "end": 6984.44, "text": "Pass auf, ooooh"}, {"id": 964, "start": 6994.44, "end": 6996.44, "text": "Da muss man aufpassen"}, {"id": 965, "start": 6998.44, "end": 7000.44, "text": "Nein, nein, nicht runterfallen"}, {"id": 966, "start": 7000.44, "end": 7002.44, "text": "Nein, nein, nicht runterfallen"}, {"id": 967, "start": 7006.44, "end": 7010.44, "text": "Ok, bauen wir jetzt erstmal hier so einen Rand, dass er nicht mehr runterfallen kann"}, {"id": 968, "start": 7014.44, "end": 7016.44, "text": "So"}, {"id": 969, "start": 7016.44, "end": 7018.44, "text": "Dann hier neben hoch"}, {"id": 970, "start": 7018.44, "end": 7020.44, "text": "Weiß nicht, ob das sinnvoll ist, was ich hier mache"}, {"id": 971, "start": 7020.44, "end": 7022.44, "text": "Ich weiß noch gar nicht so genau, was"}, {"id": 972, "start": 7024.44, "end": 7026.44, "text": "Was macht denn die Plume da?"}, {"id": 973, "start": 7026.44, "end": 7028.44, "text": "Ich probiere erstmal das Scoop Ball"}, {"id": 974, "start": 7028.44, "end": 7030.44, "text": "Das Scoop Ball Grill"}, {"id": 975, "start": 7030.44, "end": 7032.44, "text": "Jo, oh, oh, fuck"}, {"id": 976, "start": 7032.44, "end": 7034.44, "text": "Knapp, knapp, knapp"}, {"id": 977, "start": 7034.44, "end": 7036.44, "text": "Weiter hoch zu heben"}, {"id": 978, "start": 7052.44, "end": 7054.44, "text": "Ok, und du?"}, {"id": 979, "start": 7054.44, "end": 7058.44, "text": "Ich bin mir jetzt so ganz sicher, ob das stimmt, was ich hier mache, ehrlich gesagt"}, {"id": 980, "start": 7060.44, "end": 7064.44, "text": "So, ich meine, jetzt kann ja eigentlich nichts mehr passieren, wenn ich das so baue, ne?"}, {"id": 981, "start": 7068.44, "end": 7070.44, "text": "Ok, jetzt gehen wir voll Gas"}, {"id": 982, "start": 7070.44, "end": 7072.44, "text": "Und schleudern sie hier raus"}, {"id": 983, "start": 7072.44, "end": 7074.44, "text": "Ok, oder auch nicht"}, {"id": 984, "start": 7074.44, "end": 7076.44, "text": "Wir haben doch nicht immer so viele Balls"}, {"id": 985, "start": 7080.44, "end": 7082.44, "text": "Ein Ball haben wir noch"}, {"id": 986, "start": 7082.44, "end": 7084.44, "text": "Achtung Leute"}, {"id": 987, "start": 7084.44, "end": 7086.44, "text": "Volle Pulle"}, {"id": 988, "start": 7086.44, "end": 7088.44, "text": "Jawoll"}, {"id": 989, "start": 7088.44, "end": 7090.44, "text": "Yeah"}, {"id": 990, "start": 7090.44, "end": 7092.44, "text": "Jetzt schreckt"}, {"id": 991, "start": 7094.44, "end": 7096.44, "text": "Ok, das funktioniert"}, {"id": 992, "start": 7098.44, "end": 7100.44, "text": "Und jetzt muss ich nach da unten"}, {"id": 993, "start": 7104.44, "end": 7106.44, "text": "Was ja eigentlich heißt, ich muss den ganzen Scheiß hier abbauen"}, {"id": 994, "start": 7106.44, "end": 7110.44, "text": "Wobei jetzt, nein, jetzt muss ich wahrscheinlich einfach zur Plume hin"}, {"id": 995, "start": 7114.44, "end": 7116.44, "text": "Jawoll"}, {"id": 996, "start": 7116.44, "end": 7118.44, "text": "900 IQ Plays"}, {"id": 997, "start": 7122.44, "end": 7124.44, "text": "Bloop"}, {"id": 998, "start": 7124.44, "end": 7130.44, "text": "Blooper"}, {"id": 999, "start": 7130.44, "end": 7132.44, "text": "Zwar too easy"}, {"id": 1000, "start": 7140.44, "end": 7146.44, "text": "Ja, es kann ja auch verstehen"}, {"id": 1001, "start": 7146.44, "end": 7150.44, "text": "Also ich würde mir wünschen, dass Twitch generell ein bisschen an"}, {"id": 1002, "start": 7150.44, "end": 7154.68, "text": "Also irl ist das eine ich fände es gut wenn die an creative arbeiten"}, {"id": 1003, "start": 7157.88, "end": 7159.88, "text": "Weil es gibt viele leute die"}, {"id": 1004, "start": 7160.56, "end": 7167.2, "text": "Ich sag mal so gehen wir von dem stream aus die ich gestern gemacht es gibt viele leute die programmieren irgendwas was mit sicherheit auch"}, {"id": 1005, "start": 7167.52, "end": 7172.12, "text": "Mehr leute interessiert als die vier fünf sachen die es jetzt halt zufällig gerade in creative finden"}, {"id": 1006, "start": 7172.12, "end": 7179.88, "text": "oder leute die malen irgendwas die keine ahnung die die falten irgendwelche krassen papierfiguren die basteln irgendwas"}, {"id": 1007, "start": 7180.88, "end": 7184.2, "text": "Es gibt kennt ihr den den dings hier den piano im pro man"}, {"id": 1008, "start": 7185.0, "end": 7192.48, "text": "Das ist auch übelst geil gucken teilweise nur 30 leute zu oder beißt es ist mega nice ja der piano im pro man"}, {"id": 1009, "start": 7192.96, "end": 7195.78, "text": "Dann, mal gucken ob der überhaupt online ist quasi gerade"}, {"id": 1010, "start": 7195.78, "end": 7200.26, "text": "Dann haust wenn er nämlich nachhör der piano im pro man"}, {"id": 1011, "start": 7203.3, "end": 7210.1, "text": "Ja sogar online das ist mega nice und das kommt kaum einer man kann 27 leute zu"}, {"id": 1012, "start": 7212.1, "end": 7215.9, "text": "Also die ich ich fände es gut wenn twitch an creative arbeitet noch"}, {"id": 1013, "start": 7217.14, "end": 7223.3, "text": "Oder im irl und creative verschmilzt weil ich meine du brauchst du brauchst nicht talkshow irl creative"}, {"id": 1014, "start": 7223.3, "end": 7225.3, "text": "Programming das muss ja eigentlich alles sein"}, {"id": 1015, "start": 7225.7, "end": 7229.62, "text": "Entweder machen sie warum sollte programming nicht für irl sein"}, {"id": 1016, "start": 7239.3, "end": 7241.3, "text": "Beauty und die elektrische tentacle"}, {"id": 1017, "start": 7242.62, "end": 7244.62, "text": "Wie heißt das zu piano im pro man"}, {"id": 1018, "start": 7245.26, "end": 7249.78, "text": "Ich hauste den nachher ich hauste den nachher da ist übelst geil natürlich"}, {"id": 1019, "start": 7249.78, "end": 7254.26, "text": "Wow, was ist das? Wiederein kuhball grill"}, {"id": 1020, "start": 7258.42, "end": 7261.06, "text": "Story ist doch ist story intensifies"}, {"id": 1021, "start": 7267.38, "end": 7270.62, "text": "Okay wir müssen wieder irgendwelche dinger bauen"}, {"id": 1022, "start": 7270.62, "end": 7275.02, "text": "Ich vermute mal ich muss das ich muss den den grillball hier hochheben"}, {"id": 1023, "start": 7289.26, "end": 7291.26, "text": "Ja"}, {"id": 1024, "start": 7291.26, "end": 7295.26, "text": "Ja"}, {"id": 1025, "start": 7295.26, "end": 7297.26, "text": "Ja"}, {"id": 1026, "start": 7297.26, "end": 7303.26, "text": "Ja"}, {"id": 1027, "start": 7303.26, "end": 7311.26, "text": "Ja"}, {"id": 1028, "start": 7320.22, "end": 7325.1, "text": "Okay, das sieht nicht so schwierig aus bis jetzt wo ich sagen wir müssen hier einfach rüber und dann"}, {"id": 1029, "start": 7329.02, "end": 7331.02, "text": "Und dann dass das das"}, {"id": 1030, "start": 7331.02, "end": 7336.98, "text": "Das grill hier wieder in den häcksler werfen und dann sollte das soll das tun"}, {"id": 1031, "start": 7340.14, "end": 7344.9, "text": "Oh das sagt ich muss gleich auf gleich pennen überhaupt kein bock"}, {"id": 1032, "start": 7344.9, "end": 7350.42, "text": "Oh wir müssen mal ein bisschen lofball aus zack komm her"}, {"id": 1033, "start": 7360.22, "end": 7362.22, "text": "Okay, okay, okay"}, {"id": 1034, "start": 7363.06, "end": 7365.06, "text": "Okay, okay, okay"}, {"id": 1035, "start": 7366.26, "end": 7368.26, "text": "Okay, okay, okay"}, {"id": 1036, "start": 7369.74, "end": 7371.74, "text": "Okay, okay, okay"}, {"id": 1037, "start": 7371.74, "end": 7377.54, "text": "Okay, okay, okay eigentlich eigentlich haben wir es jetzt ja mehr oder weniger"}, {"id": 1038, "start": 7387.3, "end": 7389.74, "text": "So ist das was hier rüber rollen"}, {"id": 1039, "start": 7395.62, "end": 7397.62, "text": "So nicht aber fast"}, {"id": 1040, "start": 7397.62, "end": 7399.62, "text": "Ja genau, so"}, {"id": 1041, "start": 7406.18, "end": 7410.18, "text": "Ich dachte ja mal tief wir fangen erst um neun an"}, {"id": 1042, "start": 7410.74, "end": 7414.14, "text": "Ich kann ich kann fast anfangen wann ich will solange"}, {"id": 1043, "start": 7415.78, "end": 7419.38, "text": "Solange der empfang auf ist selbst dann könnte ich mit der karte ins haus"}, {"id": 1044, "start": 7419.38, "end": 7426.9, "text": "Ich mein ich wahrscheinlich würde sich irgendwann mal die personal abteilung melden wenn ich stundenlang oder tage ist nicht stundenlang tagelang"}, {"id": 1045, "start": 7427.82, "end": 7434.5, "text": "Um drei uhr oder so das glaube ich nicht dass das so gehen würde aber ich kann ohne probleme schon um kurz vor sieben anfangen"}, {"id": 1046, "start": 7434.7, "end": 7437.26, "text": "Das hat einen großen vorteil wenn ich kurz nach sieben da bin"}, {"id": 1047, "start": 7438.34, "end": 7444.98, "text": "Da ich an 15 uhr durch 19 min"}, {"id": 1048, "start": 7444.98, "end": 7449.98, "text": "den großen Vorteil, wenn ich kurz nach 7 da bin, dass ich dann 15 Uhr wieder abhauen kann."}, {"id": 1049, "start": 7449.98, "end": 7456.98, "text": "Kurz nach 15 Uhr. Das ist natürlich sehr, sehr nice."}, {"id": 1050, "start": 7456.98, "end": 7459.98, "text": "Jetzt."}, {"id": 1051, "start": 7471.98, "end": 7473.98, "text": "Jetzt noch ein Bug, jetzt ein Feature."}, {"id": 1052, "start": 7481.98, "end": 7483.98, "text": "Hä?"}, {"id": 1053, "start": 7483.98, "end": 7485.98, "text": "Machst du kein Mitter?"}, {"id": 1054, "start": 7485.98, "end": 7490.98, "text": "Doch, in der Arbeitszeit habe ich eine halbe Stunde Mittagspause mit drin."}, {"id": 1055, "start": 7490.98, "end": 7494.98, "text": "Also die muss ich nehmen, da bleibt mir nichts anderes übrig."}, {"id": 1056, "start": 7503.98, "end": 7505.98, "text": "Muss ich jetzt hier unten abbauen?"}, {"id": 1057, "start": 7505.98, "end": 7513.98, "text": "Ich glaube nicht, dass das so gedacht ist, wie ich das gerade gemacht habe."}, {"id": 1058, "start": 7513.98, "end": 7529.98, "text": "Ah, so ist das gedacht."}, {"id": 1059, "start": 7529.98, "end": 7536.98, "text": "Aha."}, {"id": 1060, "start": 7536.98, "end": 7541.98, "text": "Fuck, ich bin dumm, ich muss das oben vorher abmachen."}, {"id": 1061, "start": 7541.98, "end": 7555.98, "text": "Oops, was sind das?"}, {"id": 1062, "start": 7571.98, "end": 7579.98, "text": "Ah, jetzt funktioniert es."}, {"id": 1063, "start": 7579.98, "end": 7584.98, "text": "Okay, Leute, es ist 1.30 Uhr."}, {"id": 1064, "start": 7584.98, "end": 7587.98, "text": "Das war heute leider ein etwas kürzerer Stream als gestern."}, {"id": 1065, "start": 7587.98, "end": 7589.98, "text": "Gestern war er übertrieben lang, gestern waren 8 Stunden."}, {"id": 1066, "start": 7589.98, "end": 7592.98, "text": "Oder, ich guck mal, 7,5 Stunden gestern."}, {"id": 1067, "start": 7592.98, "end": 7595.98, "text": "Heute haben wir es nur auf 2 gebracht."}, {"id": 1068, "start": 7595.98, "end": 7601.98, "text": "Ich muss aber leider Schluss machen."}, {"id": 1069, "start": 7601.98, "end": 7606.98, "text": "Wer noch nicht auf YouTube gewesen ist und mal ein Video geguckt hat, kann sich ja mal..."}, {"id": 1070, "start": 7606.98, "end": 7608.98, "text": "Was?"}, {"id": 1071, "start": 7608.98, "end": 7611.98, "text": "The Whistle."}, {"id": 1072, "start": 7611.98, "end": 7614.98, "text": "Also ich kann jetzt pfeifen."}, {"id": 1073, "start": 7614.98, "end": 7618.98, "text": "Ja, wer noch nicht mal ein Video geguckt hat, kann sich ja mal YouTube reinschauen."}, {"id": 1074, "start": 7618.98, "end": 7622.98, "text": "Wer jetzt nur hier über Twitch dabei ist, ihr könnt auch mal ein Video gucken."}, {"id": 1075, "start": 7622.98, "end": 7628.98, "text": "Wer jetzt nur hier über Twitch dabei ist, ich freue mich natürlich über Follows auf allen möglichen Seiten."}, {"id": 1076, "start": 7628.98, "end": 7632.98, "text": "Natürlich erstmal hier auf Twitch, auf Twitter, auf YouTube."}, {"id": 1077, "start": 7632.98, "end": 7634.98, "text": "Das Einzige, wo ich keinen Bock drauf habe, ist Facebook."}, {"id": 1078, "start": 7634.98, "end": 7635.98, "text": "Auch wenn ich Facebook..."}, {"id": 1079, "start": 7635.98, "end": 7638.98, "text": "Ich habe zwar einen Facebook-Account, den habe ich aber nur, um ihn zu haben."}, {"id": 1080, "start": 7638.98, "end": 7645.98, "text": "Ich finde, Facebook ist die beschissenste Social-Media-Plattform von allen."}, {"id": 1081, "start": 7645.98, "end": 7647.98, "text": "Ja."}, {"id": 1082, "start": 7647.98, "end": 7652.98, "text": "Ich hoffe, euch hat es gefallen."}, {"id": 1083, "start": 7652.98, "end": 7656.98, "text": "Und wir machen ja einen Schluss."}, {"id": 1084, "start": 7656.98, "end": 7659.98, "text": "Dann sehen wir uns wahrscheinlich morgen."}, {"id": 1085, "start": 7659.98, "end": 7678.98, "text": "Bis dann, machts gut, tschüss."}, {"id": 1086, "start": 7689.98, "end": 7692.98, "text": "Die Sendung wurde vom NDR live untertitelt."}, {"id": 1087, "start": 7719.98, "end": 7722.98, "text": "Die Sendung wurde vom NDR live untertitelt."}, {"id": 1088, "start": 7749.98, "end": 7752.98, "text": "Die Sendung wurde vom NDR live untertitelt."}, {"id": 1089, "start": 7779.98, "end": 7782.98, "text": "Diese Sendung wurde vom NDR live untertitelt."}, {"id": 1090, "start": 7782.98, "end": 7785.98, "text": "Diese Sendung wurde vom NDR live untertitelt."}, {"id": 1091, "start": 7785.98, "end": 7788.98, "text": "Die Sendung wurde von NDR live untertitelt."}, {"id": 1092, "start": 7788.98, "end": 7791.98, "text": "Diese Sendung wurde vom NDR live untertitelt."}, {"id": 1093, "start": 7791.98, "end": 7794.98, "text": "Die Sendung wurde vom NDR live untertitelt."}, {"id": 1094, "start": 7794.98, "end": 7797.98, "text": "Diese Sendung wurde vom NDR live untertitelt."}, {"id": 1095, "start": 7797.98, "end": 7800.98, "text": "Die Sendung wurde vom NDR live untertitelt."}, {"id": 1096, "start": 7800.98, "end": 7803.98, "text": "Die Sendung wurde von NDR live untertitelt."}, {"id": 1097, "start": 7803.98, "end": 7806.98, "text": "Die Sendung wurde vom NDR live untertitelt."}]}