{"text": "Just, just, just paint it.Just, just, just paint it.Just, just, just paint it.Almost heaven.Older Twitch chat.All these emotes.Wondering how to spell that.Now we're older.Everyone's moved on.But I remember Twitch chat.From those days that are gone.Twitch emotes.From long ago.Made you feel.You're not alone.Cappapog jam.Keep a forehead.Bible thumb.Twitch emotes.I remember.Typing dance game.Forehead swift rage.PJ salt and fail fish.Life was easy.Spamming all the time.TOS was nowhere.So everyone's feeling fine.Twitch emotes.From long ago.Made you feel.You're not alone.Cappapog jam.Keep a forehead.Bible thumb.Twitch emotes.Still hear his bark.From the morning hour he calls me.This doggy emote reminds me.Of a time far away.Looking at a chat I get a feeling.That I miss emotes from yesterday.Yesterday.Twitch emotes.From long ago.Made you feel.You're not alone.Cappapog jam.Cappapog.Bible thumb.Twitch emotes.Keep a forehead.Twitch emotes.Bible thumb.Twitch emotes.So.Auf geht's.Bashen, alter, bashen.Ihr müsst mal gucken, ob ich irgendwie rumspacke, was den Sound angeht.Weil ich hab letztens meine Streams angehört.Und hab festgestellt, dass ich manchmal, wenn was ist, dass ich bisschen übersteuere.Und deswegen hab ich jetzt mal ein Compressor eingeschaltet.Also sprich, egal, ich kann jetzt hier voll reinschreien oder so.Und es wird nicht lauter.Also.Nur bis zu einem gewissen Punkt.Auf der anderen Seite sollte man...Ja, keine Ahnung.Ich hab übrigens keine Ahnung, was ich da eingestellt hab.Mir gibt das Sinn, was ich da eingestellt hab.Ich hab da keinen Plassen Schimmer von Audiozeug.Ich hab das aus irgendeinem Forenbeitrag oder so.Ja.Keine Ahnung.Hublull.Also keine Ahnung, was das macht.Der älteste Stream ist vor zwei Monaten.Ne.Wir haben, im Archiv haben wir alle Streams...Ich hab hier doch grad den Chat gepostet.Im Archiv haben wir alle Streams.Bis 2000.Bis irgendwie Ende 2007 oder so.Guck.Guck.Wubblords.tv.Da.Wir gehst jetzt auf Archiv.Oder wie die coolen Leute natürlich sagen würden, Archive.Archiv sagt ja keiner mehr. Ist ja Archive.Und dann kannst du dir alles angucken.Von 2007.September 2007.2007.Siehst du, dass ich da sogar mal ein bisschen Overwatch gespielt hab.Und KS, ich hab Overwatch gespielt.Vier Stunden.Ich hab allen Ernstes vier Stunden Overwatch gespielt, das kann ich mir gar nicht vorstellen.Wie hab ich das denn ausgehalten?Wie hab ich das ausgehalten?Das versteh ich nicht, ja.Ja, na gut.In Ordnung, na.Sag mal, kann das sein, dass der Kompressor komische Dinger macht?Also sprich, wenn ich ne gewisse Zeit laut rede.Bla, bla, bla, bla, bla, bla, bla, bla, bla, bla.Ne, ist kein Unterschied. Erinnert sich nix.Also, die Sache ist halt die, wenn ich das ausschalte, übersteuer ich manchmal.Und das sackt. Guck, ich zeig's euch mal.Ich das ausschalte und ich mach jetzt.Oder ich huste oder so.Verrecken. Dann übersteuer das Ganze.Und es sackt. Auf der anderen Seite.Eigentlich kann ich noch so laut rumschreien, wie ich will und übersteuer nicht.Eigentlich könnte ich den Kompressor auch auslassen.Na gut, dann lass ich den Kompressor mal aus, ist wurscht.So, also Leute.Ich hab da was gefunden. Ich zeig euch mal was.Aber jetzt muss ich erstmal gucken, weil im Chat gibt's Questions.Erstmal haben wir irgendwie nen Sub gehabt, den hab ich übersehen. Kann das sein?Und zwar.Vier Monate am Stück.Das ist absolut high IQ.Höher geht's immer.Aber das ist schon ziemlich big brain.Das ist nice. Subscriber.Ich finde meine Sounds nicht, weil ich mein Fenster resized hab.Big brain Subscriber.KappaRot fragt.Moin Max. Habe da mal eine Frage.Warum fahren aktuell alle so auf VS Code ab und nicht mehr auf eine normale IDE wie Visual Studio?Das kann man so glaube ich gar nicht sagen.Wer auf Visual Studio Code total abfährt, sind die ganzen Frontend Jungs und Mädels.Die finden das geil.Weil für JavaScript plus 30 Milliarden JavaScript Frameworks, die es gibt.Und CSS, HTML und so ist Visual Studio Code nicht schlecht.Als 0x15 Standard Editor ist das auch ganz gut.Aber für Sachen wie Java oder Alter.Hab ich tatsächlich gesagt, ich glaub's nicht.Wobei Go geht auch noch ganz gut drin.Oder C Sharp oder so.Da ist eine richtige IDE schon nicht verkehrt.Da kackt auch Visual Studio relativ schnell.Also nicht ab, aber gerät mal schnell an die Grenzen dessen, was da schon drin ist.Ich denke mal Visual Studio könnte das auch ganz gut.Aber die Sachen sind einfach nicht auf dem Stand, wie es bei irgendwelchen ordentlichen IDEs sind.Das heißt eigentlich braucht man beides.Ich hab aktuell für mein C Sharp Zeug hab ich Visual Studio und für Frontend Zeug hab ich Visual Studio Code.Und als wir in letzter Zeit haben wir öfters auch mal Web-Anwendungen gebastelt.Und da haben wir ja beides verwendet.So, nutzt du Proxmox? Das läuft da so alles.Nee, mach ich nicht.Ich hab zwar mal einen Stream gemacht, wo ich die neue Proxmox-Version angeguckt hab, aber benutze ich nicht.Ach ja, und die Sache, warum Leute auf Visual Studio Code zu abgehen, ist glaube ich relativ einfach zu beantworten.Und zwar, mal kurz das GitHub-Projekt raussuchen.Weil Projekte mit einer gewissen Verbreitung automatisch neue Leute anziehen.Ich will nicht sagen, dass Visual Studio Code ein schlechter Editor ist oder so.Von diesen ganzen JavaScript-Basierten ist er eigentlich der beste.Er hat auch für Gott und die Welt irgendwelche Plugins.Und es gibt eigentlich auch nicht mehr wirklich so eine Alternative.Wenn man auf der Kommandozeile editieren will, würde ich ganz klar Vim nehmen, sonst nichts.Aber da drin würde ich jetzt auch nicht irgendwelche größeren Sachen mehr basteln.Vor einer Weile, vor so ein paar Jahren, war das voll angesagt, dass die ganzen Leute versucht haben, irgendwie in Vim aufzubohren,auf IDE-Funktionen, aber das hat auch nicht richtig gut funktioniert.Das geht mit Visual Studio Code und einer ordentlichen Plugins-Schnittstelle natürlich eine ganze Ecke besser.Und große Projekte ziehen einfach immer mehr Leute an.Also das passt und dazu ist das Ganze ganz gut.Dazu kommt, dass die anderen Sachen halt ein bisschen schwächeln.Was gibt es denn für ernsthafte Alternativen?Früher, würde ich noch sagen, Emacs hatte auch sau viele Plugins.Aber Emacs ist sowohl von der Entwicklung her als auch von den Plugins und der Plugin-Entwicklung her,bzw. diese Extensions, diese Lisp.Genau, ich wollte gerade sagen Link, aber Link ist ja verkehrt.Diese Lisp-Backstage ist auch eklig zu schreiben.Gibt es nicht wirklich viel Erfolg.Emacs hat ein paar coole Sachen, die es so in nichts anderem gibt, wie OrgMode zum Beispiel,aber das interessiert nicht mehr so viele Leute.Ich muss euch übrigens gleich nochmal was richtig Cooles zeigen, was ich gefunden habe.Ja, deswegen ist Visual Studio Code so beliebt.Wir wollen Pfeifer, ja, mach ich, mach ich, mach ich doch an.Der Milchmann hat abonniert.Subscriber, vier Monate.Huge.Bist du nicht sogar Gründer?Doch, du bist Gründer.Alter, huge.Das ist hier, da reicht schon das Prell nicht mehr für.Das ist schon, das platzt schon.Vierter Monat in Folge, Dankeschön.Nice.IQ auch nochmal erhöhen, so ist das richtig.Blatter Dart.Ja, ich hab letztens, ich hab letztens ein bisschen rumgebastelt mit, ähm, damit.Da kann man jetzt experimentell Desktop-Programme erstellen mit Flutter.Das ist eigentlich ziemlich cool, aber ich glaube, das dauert noch ein bisschen, bis das spruchreif ist,weil du hast beispielsweise kein Webview.Was kannst du mit nem GUI-Framework anfangen heutzutage, wo kein Webview drin ist?Jede Anwendung braucht früher oder später mal ein bisschen HTML und Browserzeug, was sie anzeigtund sei es nur, um sich irgendwo anzumelden oder so.Also, ein GUI-Framework, was absolut gar kein Webview unterstützt, ist schwierig zu verwenden.Auch kann man beispielsweise keinen 3D-Content einbinden, falls man,oder generell 3D-beschleunigten, Grafikkarten-beschleunigten Content.Das braucht, das muss noch ein bisschen reifen, aber an sich ist echt cool.Oh, ich wurde gehorstet, danke schön.Huge, huge shows.Atom, nee Atom ist eklig.Atom gefällt mir überhaupt nicht.Also, das letzte Mal, wo ich mich mit Atom auseinandergesetzt hab, ganz am Anfang,ich hab den ja verwendet, wo er ganz neu war, der hier,da konnte er keine Dateien öffnen, die größer als, oder keine Dateien speichern oder öffnen,die größer als 1MB waren.Ich mein, das kommt zwar relativ selten vor, aber ich mein, für einen Standard-Editor ist das nichts.Außerdem war Atom deutlich langsamer als VS Code, wobei man halt sagen muss,dass der Untersatz zwischen VS Code und Atom ja eigentlich der gleiche ist.Ja, okay, Visual Studio Code für C++, weiß ich ehrlich gesagt nicht, wie gut das ist.Wahrscheinlich, wahrscheinlich nicht so tolle.Was für einen Mikrotik-Router hast du und nutzt du auch einen Switch von denen?Ja, beides.Könntest du eine Home-Lab-Tour machen?Ja, aber erst, wenn ich aufgeräumt hab.Also, als Switch hab ich den hier.Ach, Quatsch.Ich hab keinen Mikrotik-Switch.Ich hab einen Ubiquiti-Switch, den da.Und einen Router hab ich, den da.Den Router, den da.Und als Switch hab ich den da.Das sind zwölf 10-Gigabit-Ports Glasfaser und vier 10-Gigabit-Ports Kupfer.Weil, weil mehr Geld.Studentens abgeben, ja, macht ja nichts.Mit welcher Programmiersprache hast du damals angefangen?Also, ich glaube, den allerersten Kontakt hatte ich auch wie viele mit C.Aber, ähm, da hat mich das überhaupt nicht interessiert.Wobei ich wieder meinen üblichen Punkt ansprechen muss, dass ich denke, dass C eine scheiß Einstiegssprache ist.Iokun, vier Monate.Auch hier, Gründer, vier Monats-Abo.Der Chat-IQ steigt jetzt unermesslich, ey.Das Tastatur-Layout ist nicht auf Englisch, das Tastatur-Layout ist auf Deutsch.Aber die Sprache ist auf Englisch.Und die Sprache hab ich bei allem auf Englisch.Erstens, weil ich weiß, dass die englische Sprachausgabe besser manchmal spielen.Aber, ähm, Software hab ich, wenn's geht, auf Englisch.Weil, wenn es mal irgendwas gibt, was nicht funktioniert oder was ich wissen muss,es ist viel, viel, viel einfacher, was auf Englisch zu suchen zu einem Programm und was zu finden,als mit irgendwelchen deutschen Menüs und deutschen Fehlermeldungen da Suchmaschinen zu füttern.Java-Programmieren.Ja, ja, komm, da musst du jetzt einmal durch, wenn gut ist.So, Blimetext ist auch nice.Das hab ich früher öfters verwendet.Wobei ich ja früher der Hardcore-WIM und EMAX-Benutzer war.Man kann auch beides verwenden, ist überhaupt kein Problem, ja.Standard-Text in die Topf von Windows, ja. Ist klar.Die Fairness-Atom fühlt sich deutlich weniger responsive an als VS Code,als ich das letzte Mal verwendet hab.Ich hab das aber auch schon wieder zwei Jahre her.Ja, nur mobile ist Flutter super.Ohne den Chat grad überhaupt nicht her hinterher.Muss euch gleich noch mal was richtig Nices zeigen an Software, was ich gefunden hab.Hab ich vor einer Weile schon ein paar Mal ausprobiert, aber fand ich nie so gut.Aber seit den letzten paar Versionen ist das richtig gut geworden.Aber erst mal muss ich gucken, ob ich Chat alles jetzt gelesen hab.Ja, und zwar, ich hab euch ja schon öfters erzählt, dass ich, wir basteln gleich weiter,dass ich auf der Suche bin nach einem ordentlichen Notiz-Programm und To-Do-Programmund Notification-Programm, was auf allen Plattformen funktioniert.Und was nicht Outlook ist, irgendwas Einfaches, was sich auch ordentlich bedienen lässt,weil Outlook lässt sich nicht ordentlich bedienen.Zumindest To-Do's und so, wenn ich das übelste Zittellos das Fenster rumgeklicke.Und ich habe die ganze Zeit halt gesucht, weil ich Nextcloud verwende.Nee, nee, ich will das selbst gehostet haben.Selbst gehostet, selbst gehostet, das ist ja das Wichtigste.Wenn es nicht selbst gehostet werden muss, gibt es 30 Millionen Sachen.So, und ich hab gedacht, okay, ich verwende einfach Nextcloud.Nee, ich schwachsinn, ich verwende ja eh schon Nextcloud.Also habe ich die ganze Zeit was gesucht, was Caldav To-Do's unterstützt.Und Caldav Kalender und Tasks und so.Das ist auch auf Mobile kaum ein Problem.IOS unterstützt das alles, wobei die jetzt auch schon Probleme haben.Und Android unterstützt das auch.Aber es gibt uns verrecken keine gescheite Windows-Software,die ordentlich sowohl To-Do's als auch Calendars unterstützt.Das ist Müll und ich hab ewig gesucht und für Linux schonmal gar nicht.Alles, alles Crap, ja.Und dann habe ich mir gesagt, okay, ne, Taskwarrior bringt nix.Taskwarrior bringt ja nix.Erstens gibt es für Taskwarrior keine gescheiten Mobile-Apps.Ich glaube eine Android-App.Entweder die iOS-App oder die Android-App.Eins von beiden hat gesackt.Taskwarrior habe ich mir nämlich auch angeguckt.Unter Windows war es glaube ich auch ein bisschen problematisch.Und in irgendeiner Art und Weise hat auch Cross-Platform nicht gescheit funktioniert,weil du immer zu deinem Server connecten musstest.Deinem Taskwarrior-Server.Das war auf jeden Fall nicht so schön.Und dann habe ich das eine Weile versucht wie der Twin Quartz Thunderbird mit Lightning.Das geht eigentlich ziemlich gut.Die haben auch ganz coole Add-ons, dass man To-Do's und so relativ ordentlich machen kann.Allerdings hat dann Thunderbird in der letzten Version absolutes Big-Brain-Play gemachtund hat dafür gesorgt, dass alle Add-ons nicht mehr funktionieren.Und dann habe ich mir gedacht, so, wisst ihr was, ihr könnt mich jetzt mal alle am Arsch lecken.Ich gucke jetzt mal was es sonst so gibt.Und ich habe jetzt was gefunden.Das nennt sich hier Joplin oder so.Notes.So.Und das ist echt nice.Das gibt es für alle Plattformen.Das gibt es für Linux, für Windows, für Mac, für iOS, für Android.Hat coole Funktionen und was das wichtig ist.Also Notizprogrammen, wie man halt Notizprogrammen sich so vorstellt, ist eigentlich ganz nice.Aber es unterstützt To-Do's.Leider unterstützt es keine Call of To-Do's um es zu synchronisieren mit Nextcloud.Aber das ist kein Problem.Falls es den Client für alle Betriebssysteme gibt, kann ich einfach die eingebaute To-Do-Funktion verwenden.Und auch über Nextcloud sinken, halt einfach über den Filesynch von Nextcloud.Funktioniert wunderbar.Und ich weiß jetzt auch warum mir die letzte Version nicht gefallen hat, ist, da konnten die noch keine Notifications verschicken.Ich meine, wozu kann ich ein Fälligkeitsdatum eintragen bei irgendeinem To-Do, so nach dem Motto, hey, To-Do, keine Ahnung, hier fürs Abendessen einkaufen.Und ich setze dann irgendwie hin, bis spätestens 16 Uhr erledigen.Was bringt mir das, wenn ich das setzen kann, wenn das Ding keine Notifications kann.Aber seit einem letzten Version kann das Notifications und ist richtig nice.Also es ist wirklich cool und ich werde das jetzt versuchen.Es gibt sogar Terminal Applications für Linux, Mac und mit WSL Windows.Und was richtig nice ist auch, die haben sogar noch Browser Addons, wo du quasi dann Webseiten bookmarken kannst und Cross-Plattform sinken.Und Webseiten, Screenshotten, Snapshotten, Cross-Plattform sinken und so.Eigentlich übertrieben geil.Und ich muss jetzt mal probieren, ich werde das jetzt mal probieren in nächster Zeit öfters zu verwenden.Weil ich glaube, das ist das erste Programm, was ich gefunden habe, was wirklich jetzt mal alles abfackelt, was ich an To-Do und Notizen haben will.Wozu eigentlich hardwarerad.de tun?Ja genau, also kommen wir mal zur eigentlichen Geschichte, nachdem ich jetzt so lange rumgeschwätzt habe, um alles mögliche andere.Und zwar braucht der Hardwarerad oder das Hardwarerad-Team, also die hier, ein Tool, wenn ich das, ich zeige euch mal das Bild.Ich habe es euch ja letztes Mal schon gezeigt.Er hat mir das ja versucht aufzumalen.Wo habe ich es denn?Hier, er hat mir versucht aufzumalen, was er braucht.Aber das haben wir uns das letzte Mal schon angeguckt.Aua, wie sieht die Website aus? Gar nicht, sieht doch gut aus.Ok, das hier unten, die Schrift könnte man ein bisschen heller machen.Aber das ist doch eine richtig ordentliche Website, die sieht nicht so überladen, Crap beladen aus, wie alles andere.Ok, einfach simpel.Die Schrift könnte auch ein bisschen besser Anti-Alas sein, aber ansonsten.Naja, zumindest habe ich für die ja schon diesen Windows-Aktivierungs-Server da gebastelt.Also nicht der, der nicht Windows aktiviert, sondern wo man Windows-Seriennummern drin verwalten kann und so ein kleines Programm,was dann die Windows-Installation aktiviert, das ein bisschen weniger Arbeit haben.Und da haben sie mich gefragt, ob es nicht möglich wäre, ein Programm zu basteln, das mit ihrem Sparkode-Scanner funktioniert.Also sprich, wenn die eine Lieferung, wenn die eine Palette bekommen, mit neuen Sachen drauf,dann wollen sie die Sachen scannen, wollen quasi dabeischreiben hier, ok, das sind jetzt 15 Seriennummern von, keine Ahnung, AMD, Ryzen 3, 3900X.Scan, scan, scan, scan, scan. Und das Ganze speichern.Und falls irgendwann mal Riture ist wahrscheinlich oder irgendwie, wenn mal irgendwie einer was wissen will,dann wollen sie suchen können, quasi nach der jeweiligen Seriennummer, in welcher Bestellung das drin war, wahrscheinlich, dass es zuordnen können, von welchem Lieferant das ist oder so, keine Ahnung.Meine erste Frage war auch, warum macht ihr das nicht mit eurer Shop- oder Warenwirtschaftssoftware?Und ich meine, die kann das irgendwie nicht richtig. Und ich habe ihnen gesagt, ok, ich bastel irgendwas, was das macht.Ist jetzt eigentlich nichts großartig Aufwendiges. Aber es wird kein schöneres Preis gewinnen.So. Und das habe ich hier quei. So etwas habe ich mir auch überlegt, ob man nicht noch einen SYNC ran basteln kann für die Shop-Software.Die meisten Barcode-Scanner tun doch eh so, als wenn sie die Tastatur eingaben. Ja, genau. So werden wir das wahrscheinlich auch machen.So, wir werden das auch machen. Ich zeige euch mal. Also, ihr könnt euch vielleicht, also die Leute, die dabei waren im letzten Stream,ich zeige euch mal, wie das Programm im letzten Stream ausgeschaut hat. Und dann zeige ich euch mal, wie es jetzt aussieht, weil ich habe heute nochmal ein bisschen gebastelt dran.So, das letzte Mal, ich resette das mal. Das letzte Mal haben wir ja versucht, das Ding ein bisschen zu skinnen am Ende noch, aber das hat scheiße ausgesehen.Das ist übrigens Windows Forms, nicht WPF und nicht OWP oder sonst was in der Richtung. Ganz oldschool Windows Forms.Wie konnte man nochmal resetten hier in Git unter Visual Studio? Sonst musst du das über die Kommandozeile machen.Was ich dort, wo ich deutlich mehr Übungen habe hier, reset, art, yes. Ja, okay. Warum haben wir das letzte Mal?Form, so. Oh, der ganze Shit muss weg. So sah das Ding das letzte Mal aus. Also, jetzt sehr ultra hässlich.Oh, der ganze Shit muss weg, so sah das Ding das letzte Mal aus, also jetzt sehr ultrahässlich, wo ist denn die Textbox hinten oben, wo ist meine Textbox, okay keine Ahnung,es sah das letzte Mal ultra hässlich aus, eigentlich gab es hier noch eine Textbox,wo man suchen kann und da macht man die Bestellung auf, also es sieht wirklich, sah richtig auswie so eine kacke Windows 95 Anwendung, aber das Icon, Icon ist das Wichtigste, so undich hab mir gedacht, okay, irgendwie fand ich, sah das Ding mega hässlich aus, ich habmir gedacht, ey, sollen wir es nicht vielleicht doch in WPF neu machen oder sollen wir esnicht vielleicht doch in einer Web Anwendung machen oder sollen wir nicht vielleicht dochirgendwie gucken, ob wir es vielleicht nicht doch als UWP machen, ich hab mir gedacht,eigentlich ist mir das alles zu viel Act für eine Anwendung, die aus zwei Fenstern bestehtund irgendwie drei Eingabefelder hat und jetzt zeige ich euch mal, wie es heute aussieht,hier hab ich übrigens aufgeschrieben, was wir noch machen müssen, jetzt zeige ich euchmal, wie das heute aussieht, sieht schon ein bisschen besser aus, Bäm, ist doch schonmal Fortschritt im Vergleich zu dem anderen, oder, so, jetzt haben wir nämlich auch einenordentlichen, ordentlichen Listview hier, wo man das, wo man suchen kann und wo man hervorhebenkann und ich zeige euch mal, was richtig cool ist, es ist jetzt, beispielsweise, ich habjetzt nur eine Sache eingetragen, ja, als Test, so und ich zeige euch mal, was das jetzt,was das für coole Sachen kann, also erstens mal natürlich, du kannst sortieren, na, dasist jetzt natürlich schon ein riesen Vorteil im Vergleich zu dem anderen, du kannst sortieren,das ist aber jetzt nicht auf meine Mist gewachsen, ich hab mir einfach eine GUI Library gesucht,die ein paar bessere Controls hat, wir verwenden jetzt Sync Fusion für das Ganze, kann mansich kaum mal kostenlos verwenden, wenn man sich mit einem Linked-in-Konto verknüpft,da hab ich mir gedacht, ich mach mir einfach ein Fake-Linked-In-Konto und hol mir einenCode für die Free-Version, also man kann jetzt hier sortieren, ist eigentlich ganz praktisch,dieses Created-Add hier machen wir noch weg, das brauchen wir in der Hauptform nicht undjetzt zeige ich euch mal, was richtig geil ist, also es sind schon ein paar richtig niceFeatures drin im Vergleich zum letzten Mal, man kann suchen, beispielsweise nach AMD undihr seht, es wird alles ausgepl... na gut, es ist jetzt sonst nichts anderes drin, eswird alles ausgeplendet, was nicht AMD ist und sogar AMD wird Highlighted, also wennich jetzt mal hier nach R34 oder WE-Dings suche, dann sieht man, wo es gefunden wirdund alles andere wird ausgeplendet, aber oben drüber sieht man immer noch, in welcher Bestellungdas drin ist, nämlich in der Bestellung, neue Bestellung vom 19.10., was noch nicht gehtist die Detailform aufmachen, achja, das Speichern der Daten funktioniert auch ein bisschenanders, wie in der alten Anwendung, in der alten Anwendung haben wir so eine EmbeddedNoSQL LiteDB verwendet, bis mir dann irgendwann aufgefallen ist, dass es eigentlich gar keineso schlaue Idee gewesen, weil das Ding keinerlei Database-Migrations oder so kann, also sprich,wenn ich mal auf die Idee kommen sollte, in Zukunft da irgendwie noch ein paar Felderumzubenennen oder so, dann spackt das wahrscheinlich übelst rum.Du weißt schon, dass Syncfusion über 2K, nee, kostet nicht, die Free-Version nicht,du musst für die Free-Version nichts bezahlen und du kannst die Free-Version auch verwendenbis, glaube ich, eine Million Euro Umsatz oder, nee, oder eine oder 100.000, 100.000 glaubeich, ne, irgendwie so, was juckt es mich, das ist ein internes Tool, was sonst keinerverwendet, womit ich auch nichts verdiene oder so, das kann sich jeder, kann sich jederherunterladen hier, ja, die haben das safe, ich aber nicht, das ist aber echt cool, dasist das, nee, guck mal hier, Companies and Individuals less than 1Million and Viewer than5Developers, alles, was ich, was ich habe. So, und das ist echt cool, weil da sind schonein paar bessere Controls dabei, das ist egal, ob Hardware Rat die Software benutzt, in demFall zählt es, als zähle ich als Programmierer bzw. wie ich das eventuell irgendwie weiterlizenziere oder so. Ich bin ja nicht Hardware Rat oder so, ich bin der Max, ich habe mitHardware Rat nichts zu tun, außer, dass ich für Hardware Rat was programmiere. So, undalso das ist wirklich nice, da muss man gar nicht so viel zu machen und jetzt zeige icheuch mal was richtig, was richtig krass ist, also ein richtig nice Feature, wenn man sagt,ok, ich will jetzt eine neue Bestellung hinzufügen, klick ich hier oben drauf, geht neues Fensterauf neue Bestellung, nennen wir jetzt mal irgendwie Twitch, QtChat, Ayayaya, heißt die Bestellung,so und jetzt passt mal auf. Ich kann jetzt, wenn ich hier in die Beschreibung gehe undanfange was einzutippen oder doppelt reinklicke, kriege ich Autocompletion mit allen anderenBeschreibungen, die es schon gibt. Das ist hier Big Brain. Gehst hier rein, fängst,keine Ahnung, gehst hier rein, fängst an zu schreiben, äh, Risen, zack. Und das istrichtig cool, weil ich habe mir gedacht, ähm, die Rechtschreibfehler werden auch übernommen,ja, weil ich habe mir gedacht, die kriegen wahrscheinlich gar nicht so viele verschiedeneTeile. Benutzt du Lambda? Hä? Nee, was? Meinst du hier, äh, meint ihr so, die Geschichten,ja klar. Ähm, ja, und das ist halt echt nice, weil ich habe mir gedacht, die bestellengar nicht so viel, die bestellen vielleicht, keine Ahnung, 20 verschiedene Sachen undda musst du jedes Mal den Mist eintippen und hier machst du einfach Autovervollständigungund sagst, okay, das ist ein AMD Risen, so. Und jetzt hast du die Möglichkeit, manuellwas einzutippen, wenn du manuell was eintippen willst, kann ja auch mal sein, dass du keinenScanner hast, dann kannst du hier sagen, LUL HD 2019 Omega LUL, die Seriennummer, zack,passt. Du könntest aber auch scannen und, äh, Lambdas, Lambdas sind, im Prinzip sindLambdas Funktionen, ohne dass du ihnen einen Namen geben musst und dass du sie inline schreibenkannst. Ähm, so. Und ich simuliere jetzt mal einen Scanner, da muss ich jetzt mal dasTerminal aufmachen, da sieht man das nämlich ganz gut. Ich logge nämlich mit, was in dieserForm, äh, Form quasi getippt wird. Also erstmal, erstmal schon Keylogger ist raus, ja. Alsoich logge in dieser Form mit, was, äh, was getippt wird. Das heißt, egal wo man in dieserForm ist, wenn der Scanner scannt, geht's immer automatisch, wird's immer automatischeingescannt. Und ich tu jetzt mal so, als wär ich der Scanner und es setzt jetzt voraus,dass man den Scanner customisen kann, dass er ein Zeichen davor und ein Zeichen danachsendet. Da müssen wir mal gucken, wenn das nicht geht, wenn das der Scanner nicht kann,was die haben, dann mach ich halt ein Inputfeld, wo du reingehen musst, ja, das geht auch.Ah, gut. So, ich, ich fake jetzt mal, ich fake jetzt mal Scanner. So, bla, bla, bla, bla,blub, zack. Habt ihr gesehen? Ich war jetzt der Scanner. Bin jetzt der Scanner, ich scanneSeriennummer und wird eingetragen. Ich hab jetzt hier, ich hab jetzt Underscore alsStartzeichen verwendet, aber da sollte man vielleicht was verwenden, was nicht in Seriennummerndavor kommt. Underscore könnte schon, könnte schon, äh, ein bisschen schwierig werden.Der Patrick hat subscribt. Big Brain. Dude, wieder auf Stufe 3, Alter. Vier Monate aufStufe 3. Ich glaub's nicht, ja. Da, da brauch ich, brauch ich zwei Big Brain Emotes für,ähm, das ist auch scheiße. Geocon hat auch abonniert. Hab ich, hab ich, hab ich ganzübersehen, ja. Wahnsinn. Q als Signalzeichen, größer oder kleiner Zeichen. Hey, das findeich eigentlich cool. Das eine Zeichen zum Starten, das andere Zeichen zum, ähm, SargentFlakes Twitch Prime, dankeschön. Ja, so, so schaut das Ganze jetzt aus. Das ist, findeich, schon viel schöner benutzbar als der andere Kram, den ich da gebastelt hab. Gefälltmir. Hat was. Und am besten, am besten finde ich eigentlich die Autovervollständigung.Ähm, und, irgendjemand hat gefragt, wie ich das Ganze speichere, das zeige ich euch jetztgleich. Mit größer Zeichen am Anfang und kleiner Zeichen am Ende ist es bei uns umgesetztworden. Ach, du hast, ach, du hast es auch so mit Eingaben vom Scanner gemacht. Nein,ich, ja, wahrscheinlich mach ich das auch so mit größer und kleiner Zeichen. Da binich nicht der Einzige, der auf diese, auf die blöde Idee gekommen ist. Ähm, ja, ähm,was man, was man noch machen kann, ist natürlich, man kann, man kann Sachen löschen. Das istnatürlich nicht verkehrt. Oh, ich, ich tu jetzt noch mal so, als bin ich Scanner undscanne ein bisschen. So. Ähm, so, und das ist jetzt kein AMD Ryzen, sondern das istjetzt ein Intel, wie heißen die aktuellen CPUs? 9, 9, 0, 0k oder so. Gibt's, gibt'sden? Oder wir machen was anderes. China-Netzteil ist das jetzt. China-Netzteil. So, jetzt drückenwir das Save. Was noch nicht geht, ist, dass er automatisch Refreshed. Muss ich auch nochals To Do reinschreiben. Das müssen wir auch noch machen. Auto, Refresh, Main Form. So,und wenn man das jetzt speichert, zack, dann reloadet er noch nicht, weil's, äh, weil'snoch nicht implementiert ist, dass er reloadet. So, wenn ich jetzt wieder neu starte, dann,dann andere Kram auch alles drin. So, was ist denn? Jetzt haben wir zwei Bestellungendrinne. Einmal neue Bestellungen, einmal neue Bestellungen. Achso, ich hab die Dinger einfachnur neue Bestellungen genannt. Das ist natürlich taktisch nicht so geschickt. Ich hätte dieein bisschen besser benennen sollen. Anstatt neue Bestellungen. Wobei, ich hab die Bestellungendoch Q-Chat Ayayaya genannt. Das, das scheint doch rumzubuggen. Eigentlich sollte da jetztQ-Chat Ayayaya drinstehen in der Bestellung. Tja, da müssen wir mal gucken, warum das nichtfunktioniert. Das gucken wir als erstes. Bestellungs. So, ähm, bugged irgendwie ein bisschen kanndas sein. Warum steht denn in der Description drinne? Tja, gut. Das scheint irgendwie nichtso ganz zu funktionieren, würd ich sagen. Aber, wär auch viel zu einfach, wenn derKram immer auf alle Hüfte funktionieren würde. Okay, müssen wir mal gucken an der Stelle,wo das gespeichert wird. Wahrscheinlich ist das relativ simpel. Ähm, die ganze wird hierunten irgendwo gespeichert. Also sprich, wenn man hier unten auf save drückt. Ah, kanndas sein, dass das einfach, dass das nie geupdatet wird? Die Granatierung ist wahnsinnig bigein. Warum wird das nicht geupdatet? Hier wird der Kram doch eigentlich alles angelegt.Achso, und übrigens toll, dass die Dinger Textbox 2 heißen. Vielleicht sollte ich dieDinger mal ordentlich benennen. Und zwar, das ist nicht Textbox 2, sondern das ist dieTextbox für, ähm, das wird, das wird nicht richtig gespeichert, denk ich mir. Ähm,das ist nicht, das ist nämlich nicht die Textbox 2, das ist die, die, keine Ahnung, DescriptionBox oder so. Wieder. Hat der Name hier jetzt auch angepasst? Ja, sehr schön. Dann blicktman nämlich auch mal ein bisschen durch. Das ist ein bisschen mit heißer, heißer Nadelgeschrickt, ne. Aber hier, hier, hier legt er das doch eigentlich an. Also sprich, wennich's hinzufüge, wenn ich's hinzufüge, dann nimmt er das aus der Description, setztdie Seriennummer und edit das. Ok, also dann gucken wir mal mit dem SQLite Browser malwas Verrückliches, was der Flo vorgeschlagen hat, warum das Ganze nicht funktioniert. Desktop,äh, wie heißt das Ding hier? Web Application, ne WinForms App 11, besser Name. Oh, das guckenwir mal rein. Ne, das wurde nicht richtig gespeichert. Die Seriennummer wurden aberrichtig gespeichert, was mich zu der Annahme führt, dass die Textbox irgendwie rumschwackt.Lässt mich vermuten, dass die Textbox irgendwie rumschwackt. Ok, probier mal das noch malaus. Also wenn ich was Neues hinzufüge, hier, neue, neu. Achso, ah, ich glaub ich weißwo ganz leh, guck mal. Also das erste, warum es nicht funktioniert, schon mal das hier.Von der Order setze ich nie die Description. Und das Ding nennen wir jetzt mal anders um,äh, irgendwie so, dass ich mir das merken kann. Ok, das sollte das jetzt eine schon mal fixen.Gucken wir mal, bla bla bla bla, bla bla bla. So, ich tu mal wieder so, als wäre ich Scanner,jetzt tue ich das hinzu. Ähm, wobei das ist doof, wir machen das mal anders. Ähm, ichwusste ja irgendwie hier, keine Ahnung, blub. Ok, save. Ok, jetzt gucken wir mal was passiert.Hä? Das scheint irgendwas mit der Textbox nicht richtig zu sein. Weil jetzt hat dasfunktioniert. Ach ne, Moment. Aber die Order stimmt auch nicht. Ah, also. Moment, alsoan der Stelle auch vollkommen falsch, wo ich das setze. Muss das hier unten beim Speichernsetzen. Sonst mach ich das ja alles doppelt und dreifach. Ok, probieren wir das Ganzenochmal aus. Egal, save. Hä? Moment, kann das sein, dass ich irgendwie meine Textboxenvertauscht hab oder so? Hab ich irgendwo meine Textboxen vertauscht? Das ist doch vollkommenfalsch. Hier müsste eigentlich drinstehen eins, zwei, drei. What? Ich muss noch, ichmuss noch rtx on machen. Ja, genau. Ok, gucken wir nochmal. Was ist beim hinzufüllen? Description?Das ist aber echt merkwürdig. Nehm ein Datacrit. Das ist ein Datacrit. Das ist abermerkwürdig. Ok, also nochmal ganz langsam gucken. Was mach ich denn hier beim Speichernunten? Updated ads setz ich bloß. Ok, das ist ok. Das brauch ich an der Stelle garantiertnicht mehr. Ok, wisst ihr was? Wir gucken jetzt tatsächlich noch mit dem SQLite Explorerund gucken, ob die Anzeige nicht jetzt verkehrt ist. Hä? Da gebastelt. Sehr merkwürdig.Ok, das Ding heißt QtChat. Beschreibung, da ist jetzt drinne keine Ahnung, 0w und jetztmachen wir hier irgendwelche Seriennummer rein. So. Hier. Ne, ne, das liegt nicht auf demNetzwerk. Das ist aber echt merkwürdig. So, gucken wir mal jetzt, was drinne steht.Das ist jetzt ok. Ok, dann hab ich irgendwelche Probleme, wenn ich die Felder zwischenzeitlichupdate. Da muss ich mal gucken, warum der rumspackt. Aber wir machen erst mal die anderenPunkte. Aber prinzipiell ist das an der richtigen Stelle kommt das an. Das ist Seriennummer,das ist Description. Dernummer, das passt. Ok, das passt prinzipiell schon. Der updatedas zwischenrinnig. Da muss ich mal gucken, was der für Schmerzen hat. Äh, was ist SQLdafür geeint, damit z.B. mehrere Personen darauf zugreifen, wenn die DB auf einem Netzlaufwerkliegt oder sollte man der für, eher für MySQL liegen. Also, also, äh, SQLite auf demNetzlaufwerk würde ich nicht unbedingt, ähm, würde ich jetzt nicht unbedingt. Da könnt'sauch Probleme geben, irgendwas zu locken oder so. Generell würde ich mir überlegen, wennich SQLite verwende und das mit mehreren Benutzern verwende, da muss man das, alsodas geht, das ganze prinzipiell schon machen. Aber ehrlich gesagt, keine Ahnung, wie dasim größeren Ziel aussieht. Ich hab da keine großen Erfahrungen mit SQLite. Ähm, mein,theoretisch geht das, aber ich weiß nicht, ob ich machen würde. Naja, aber zumindestist das komisch. Irgendwie, irgendwie packt das an manchen Stellen rum. So, das erste,das nächste, was ich machen muss, ich muss aus meiner Haupt, muss ich ein bisschen schönermachen, ähm, dieses Create braucht hier drin kein Mensch. Das schmeiße ich jetzt gerademal an der Stelle wieder raus. Das sieht doch ein bisschen übersichtlicher aus. So, wasman natürlich noch machen muss, ist, wenn man den Kram anklickt, dass er dann die Detailansichtaufmacht mit den ganzen Werten drin. Hahaha, neues Testament, ey, das ist, der Witz istwirklich gut. Ich hab's erst nicht gecheckt, ja, aber jetzt, wenn ich das ganze nur maldurchlese, ist das eigentlich echt lustig. Wenn die die B auf ein Rätsel aufklickt,ist das mal Verspätung. Ja, das ist richtig. Das muss man erst, ja, das dauert, das dauerteine Weile. So, ich bin ganz froh, dass ich diese komische optische, die optisch bisschenhübschenen Controls für Windows Forms noch gefunden habe, weil, ähm, das alte sahwirklich Crap-mäßig aus, ja. Aber das ist jetzt eigentlich ganz nett. So, ähm, alsowas wird man als nächstes machen? Bestellt sich jetzt nicht über Umlangung, das habenwir uns angeguckt, dass es irgendeine Geschichte von zwischendrin Sachen nicht aktualisiertwird. Da muss ich mal in Ruhe gucken. Äh, Terok, Switch Prime, Dankeschön, Big Brain.Ähm, Create Date aus Mainform raus, haben wir gemacht. Drag and Drop mach ich jetztnicht, da muss ich erst mal angucken, wie das geht. Ähm, ja, das was am meisten gescanntwurde, wollte ich hier als Default reinschreiben, bzw. als ersten Vorschlag in der Autocompletionanbieten. Das glaube ich nicht verkehrt, wenn wir das sortieren, nachdem wie oft wasvorgekommen ist. Ähm, dann müssen wir als nächstes das da machen, dass die Mainformneu geladen wird, irgendwie, wenn neue Daten hinzugefügt werden, alles andere ist beknackt,ja. Also sprich, wir müssen das einmal neu einlesen, weil sonst ist es total bescheuert.Ähm, Sound aus. Die Gruppen werden nicht richtig sortiert, ok. Also ich glaube dasist das erste was wir machen. Das muss ich mir hier unten drunter mal hinschreiben,ähm, dass ich mir das mal angucke, warum das so komisch rumspackt. Wahrscheinlich relativsimple, weil ich an irgendeiner Stelle, wo es im UI aktualisiert, unten drunter nichtaktualisiert wird. Äh, Ruffy Monkey, was genau möchtest du mir mitteilen? Dass dueine krasse Datenbank Pro bist, oder was? Ich weiß auch, dass man das anders machenkann. Vio, Vio still abonniert Stufe 1, Dankeschön. Pog. So, dann würde ich sagen, machen wirdas jetzt mal. Achja stimmt, das müssen wir zuerst machen, das packt nämlich auch nochrum. Ich bin nämlich ziemlich, äh, ziemlich beknackt hier an der Stelle unten, hab ich,ähm, gemacht. Ich sehr, ich edit die Sache immer. Wo das Problem ist, ich kann das nichtimmer adden, ich muss das updaten. Also sprich, wenn das eine neue, wenn das ein neuer Eintragist, dann machen wir ein add. Wenn das kein neuer Eintrag ist, dann machen wir ein update.Ansonsten packt das rum. So, ich überleg grad, wie man das mit dem, mit dem updaten vonder Mainform gescheit machen können. Also ich will ja, dass wenn ich was neues hinzufüge,ich blablabla, wenn ich was neues hinzufüge, will ich ja beim speichern, dass die Mainformneu geladen wird. Das könnt man entweder machen, wenn man die Form zu macht, aber dasist eigentlich doof. Wir bräuchten irgendeinen Event, wir müssten irgendwie Bescheid sagenso nach dem Motto, ich hab save geklickt und wenn ich save geklickt hab, dann muss ichupdaten. Wie macht man das am besten? Wir könnten, wir könnten hier drin ein Event machen,wir könnten hier drin ein Event machen, so nach dem Motto saved und wenn wir hier untenspeichern, dann werfen wir das saved Event. Ne modaldingsdialog will ich net machen. Alsowir könnten, wir könnten, wir könnten irgendwie sowas hier machen. Saved oder so. Hallo, nein,das gibt es öfters. Ach Mist, den Kram gibt es öfters. Saved. Dann reichen wir das durch.Gibt es für SQLer, ich hab keine Objekte, doch, doch, doch. Ich hab ja auch mal eherF-Core reingeschmissen, weil ich keinen Bock hatte irgendwelche SQL Statements zu schreiben.So und jetzt schmeißen wir ein Event beim speichern. Müsste doch eigentlich funktionieren.Saved. So und jetzt können wir bei uns in der Mainform. Event row change, du lässtAutomat speichern, aber du brauchst keinen Saved Button. Das ist cool. Das ist tatsächlichganz praktisch. Du meinst bei dem Ding hier. Gucken was da alles changed ist. Heißt wahrscheinlich,wahrscheinlich heißt das nur beim offiziellen Microsoft Control und hier heißt das wahrscheinlichirgendwie anders, aber das gibt es garantiert hier auch. Und der View. Ich hab gar keinrichtiges Data Table. Ich hab einfach nur ein Array aus Objekts, was aus EF Core rauskommtdafür. Aber ist ja auch, das bei dem Update passt eigentlich so denke ich mal ganz gut.So, wir gehen jetzt mal zurück in die Mainform und gucken, wenn das Ganze zugemacht wird.Was tut es? Ich hab eigentlich die Punktfragezeichen. Was ist, wenn das Ding null ist, also wenn,ach was mach ich da eigentlich für ein Schwarzinsert? Also sprich, wenn hier nichts dran attachedist, dann invoked, also dann ruft das nicht die Methode auf. Also wenn das hier im Endeffekt,wenn das hier null ist, dann macht er das hier nicht. Das Ding hat auch irgendwie einenabsolut Zungenbrechernamen, das Ding. Null, boah, wie heißt das Ding? Irgendwie Null BlahQuestionmark Operator. Das Ding hat ganz abartige Namen. Das ist so ähnlich wie True Doppelpunkt,die Fragezeichen. Ja, bloß dass du nicht alles doppelt und dreifach schreiben musst.Null, wie heißt dieser Kram nochmal? Save, was, call the save? Navigation Operator. Heißtaber offiziell nie so, oder? Ist das so? Save, null, null, Null Conditional Operator heißtdas, genau. Das Ding, genau. Und man kann das jetzt auch, oder geht es vielleicht schonimmer, man kann das auch als Index für BIOS verwenden. Ich meine, man kann es auch übertreiben,ja. Aber für Events ist das wirklich ganz praktisch. So, okay, gehen wir mal in dieEinform gucken. Wir gucken, das müssen wir auf jeden Fall noch an eine Stelle zusammenfassen,deswegen habe ich es ja auch noch in die Tudu reingeschrieben. Ich habe das heute in zweiStunden, indem ich hier mit meinem Zeug fertig war, zusammen gewurstet, dass es funktioniertund besser ausschaut als das letzte und dass das auch mal fertig wird irgendwann. Alsoich habe es, ich glaube nicht, dass wir heute komplett fertig werden. Okay, also wir guckenjetzt mal, wie kann man das jetzt am besten, also sprich, wenn die Form closed, nee nichtclosed, wenn die, ach Quatsch, weg machen. Also sprich, wenn jetzt einer den Save Buttondrückt, dann, was machen wir dann? Dann laden wir den Kram neu, würde ich sagen. Da müssenwir mal gucken, dass wir vorher richtig gespeichert haben, jawoll, haben wir, passt. So, wo habeich nie das Laden aus der Datenbank da oben. Man merkt halt schon, dass es ein bisschenmit Halsanatel gestrickt ist, aber das brauchen wir an der Stelle garantiert nicht. Also ladenwir den Kram neu, wenn man auf save drückt. Und dann müssen wir noch sagen refresh. Unddas müssen wir invogen, weil wenn wir das nicht invogen, dann fresh uns das ganze Ding,das wird sonst nichts. Weil das, wobei, nee, müssten wir nicht invogen, das kommt beidesaus dem GUI-Smart, das eigentlich kein Ding. Müsste eigentlich funktionieren, wobei, gehtdas von, ja, das muss von einer Form in die andere Form, müsste das auch funktionieren.Okay, also wenn jetzt einer den save Button drückt, dann müsste das eigentlich weichernund neu laden. Gucken wir mal, ob das funktioniert. Okay, also mal ein neues Fenster auf. Blablabla,blablabla. Okay, und jetzt save. Oh, what the fuck. Alter, was jetzt? Smokersmoke. Wasgenau möchte ich mir denn diese Fehlermeldung jetzt sagen? At least one option. What? Okay,okay. What? Eh? Was ist doch da oben genauso? Okay. Okay. Okay. Okay. Okay. Okay. Okay.Eh? Muss ich jetzt vorher clearen oder so? MrAmec, Twitch Prime, Dankeschön. Das funktionierthier oben doch auch. Warum sollte das da unten nicht mal funktionieren? Muss man das, dasmuss man bestimmt, das muss man bestimmt vorher clearen oder irgendwie sowas. Warte mal, wartemal, wir probieren mal was aus. Und zwar, ich mach jetzt erst mal, erst mal mal dasmal hier. Das ist jetzt merkwürdig. Blablabla. Aha. Der spackt beim Refresh rum.Warum spackt der denn beim Refresh rum? Das leuchtet mir jetzt nicht wirklich ein. Ichwerd' mal kurz meine Datepunk wegschmeißen, dass es ein bisschen leerer wird. Spackt derbeim Refresh rum? Muss ich das doch invoken? Aber ist doch eigentlich, GUI-Thread ist GUI-Thread,das sollte doch eigentlich keine Probleme machen. Wär' ich jetzt nicht mitgerechnet, dass deran der Stelle irgendwie rumspackt? Ja. Führen wir mal aus. Add. Neue Bestellung. Blabla. Save.Gut, das Refresh nicht. Hä? Jetzt kackt es gar nicht mehr ab. Aber Refreshen tut es auchnicht mehr. Wo ist denn das Problem? Wie verwenden wir den Kram überhaupt richtig?Was, weil er nicht sortieren muss?Genau. Filter?Ne, ich mach' hier, ich schreib' hier eine, äh, ich schreib' hier eine komplett neueSache. Ah, okay. Äh, also was hat der, was hat der damit für Schmerzen, das weh ichnicht. Genau das Gleiche, wenn ich oben doch auch. Genau das Gleiche mach' ich hier dochauch. Also exakt, exakt das Gleiche. Warum spackt es da oben rum, äh, da oben nicht rumund hier spackt das rum. Ah, die muss ich nicht verstehen. Ähm, ich mach' mal kurz denKram aus. Steht alles schön untereinander, okay. Darf man diese Sache vielleicht nureinmal neu, nee, oder? Man darf hier sicherlich nicht nur einmal neu. Ha! Das hat irgendwasmit den Gruppen zu tun. Das hat irgendwas mit den Gruppen-Settings zu tun. What? Okay.Funktioniert. Gut, das Löschen wird noch nicht funktionieren, oder? Ähm, das Löschenkommt ja auch nie, kommt ja auch nie in der Collection an, aber what? Was hat es denn,was hat das denn mit den Gruppen zu tun? Okay, das ist wahrscheinlich irgendeine framework-spezifischeSache jetzt. Was jucken denn denn die Gruppen davon? Okay. Was auch immer. Kein Schimmer.Aber an sich funktioniert das Updaten. Das verstehe ich nicht. Ah, ich mal guck, dassdas normale Updaten tut. Ja, bla, bla, bla, bla, bla, bla. Also ich muss den Kram unbedingtmal ein bisschen, äh, ordentlicher zusammenschreiben, weil ich hab' jetzt zwei Mal, zwei Methodenhier aufgerufen, wenn einmal hier mit Enter drücken und einmal hier für Plus drückenund so, bla, bum, bum. Ähm, da hier, Q-Chat, Beschreibung, Aja, Ja, Zufügen, Serie-Nummer,irgendwas, save, zack, funktioniert direkt. Was hat der, warum spackt das auf einmal? Undwarum geht das mit dem Sortieren nicht nachdem man das geändert hat? Das liegt eindeutigda dran, wenn man das hier updatet, dann spackt der rum. Wenn ich das hier nicht mache, alsowenn ich das hier einfach nur öffne und sortier, ach nee, ok. Äh, Wonka Smoke, Alter. Warum?Wo ist das Problem? Ah, ich glaub' ich weiß, ich glaub' ich weiß woran das liegt. Ichweiß woran das liegt, glaub' ich. Ah, ich glaub' ich weiß woran das liegt. Ich dachte,ich könnte, ich könnte mich da vordrücken. Ähm, ich dachte, ich könnte mich da vordrücken,dass die Anzeige hier hässlich ist, indem ich hier, ich zeig' euch das mal kurz, ähm,ah, wird's wahrscheinlich liegen, ne, ähm, Order. Dass es hier richtig angezeigt wird,hab' ich hier Two-String überschrieben, weil sonst steht ja nur drin, dass es ein Order,sonst war es irgendwie, und wahrscheinlich stört ihn das irgendwie, weil wenn ich dashier sortiere ist kein Problem, aber das hier kann man nicht sortieren einfach so. Ok,das ist interessant, das war mir so nicht klar. Und, liegt das vielleicht doch mit den, mitden, mit den Data, vielleicht doch da dran? Also beim einfügen liegt das bestimmt auchda dran. Ja. Ok, ich hab' ehrlich gesagt keine Ahnung warum man das machen muss. MehrEinträge mit, was soll das Tool später machen? Ähm, dass, du kannst Seriennummer von Produktensuchen, in welcher Bestellung die vorgekommen sind. So. Also ist nicht für mich, ähm, mussich jetzt da irgendwie, ok Moment Leute, ich muss jetzt nochmal was ausbrechen, ich mach'das hier nochmal weg, dann sieht die Anzeige zwar hässlich aus, wie, wie kommt's zum Einsatzvon, ähm, oh wie heißt das Ding hier, SF-Dings hier, Sync Fusion? Einfach weil die eine kostenloseLizenz haben. Einfach weil die eine kostenlose Lizenz haben. Alles. Weil die eine kostenloseLizenz haben und ganz gut ausschauen und ich die Kram nicht neu in WPF oder UWP machenmuss. Ok, das juckt die nicht. Muss ich da jetzt wirklich? Eye Comparable irgendwie im,aber warum? Ja gut, muss ich, das ist ja ein eigener Typ. Rings, haben das? Ok, ja machenwir mal, machen wir, ähm, machen wir. Eye Comparable, was macht man da mittlerweilehier, den, den, den da? Ah, Compare to. Für was ist Compare? Compare ist die Geschichtemit größer, kleiner, gleich, oder? Also minus eins, null und eins, ne, irgendwie so ist das.Die Spalte sollten in Ordnung, ach, ah, du, also heißt das, was meinst du jetzt fürdie Geschichte mit den Gruppen oder meinst du für, ähm, Vira generell das handelt,was da drinne steht? Also ok, aber so müsste das eigentlich, eigentlich, ok, ähm, alsoim Prinzip, kann ich da jetzt einfach sagen, es ist ja eigentlich egal, alles gleich. Sound zumindest jetzt müsste es nicht mehr abkatzen. Das Sortieren kann man custom handeln. Ok,das, das, das ist gut zu, ja das Sortieren, also das Filtern habe ich custom gemacht, dasSortieren wusste ich nicht, dass das funktioniert. Ich habe das ja auch noch nie vorher benutzt.Zumindest, der eigentliche Grund warum ich das benutze ist, weil sie eine Free-Lizenzhaben und weil es ganz gut aussieht, im Vergleich zu Oldschool Windows Forms. Aber guck mal,wie schön die Autovervollstellung funktioniert. So, mal gucken, ob es jetzt funktioniert.Hat das jetzt hinzugefügt? Also mit den Gruppen spackt übelst rum, das checke ich nicht.Hast du eine Ahnung, äh, Krasios, wenn du das schon mal benutzt hast, ähm, warum esihn stört, bzw. warum er nicht refresht, wenn ich Gruppen drin habe? Wenn ich die Gruppenrausnehme, refresht er sofort, das juckt ihn überhaupt nicht. Wenn ich die Gruppen rausnehme,dann etwas hinzufüge, hier blablabla, zack, ist da. Aber wenn ich Gruppen drin habe, spackter rum, ich habe keine Ahnung warum. Sollen wir mal gucken. Die Gruppen machen sie mal aus,ja. Hätte ich auch machen sollen. Wow, jetzt hat es funktioniert. Ach, nice, jetzt funktioniertes. Diese iComparable-Geschichte war es echt komisch. So, dann sag mal hier unten jetztnoch, keine Ahnung, auto-expand-groups, aber das habe ich eben doch schon gesagt. Dannsag ich es eben noch mal, gucken, ob das jetzt funktioniert. Oh, add, ich musste jetzt echtmal was anfassen, klein, blablabla. Es lagged übrigens die Autovervollstellung, weilich ja so viel Zeug drin habe, also ich musste schon mal ein bisschen begrenzen. Warum öffneter die jetzt nicht? Kein Bock. Kann ich so expand, expand, all-group machen wir jetzt.Okay, er sollte es zwar automatisch machen, aber macht er anscheinend nicht. Wieso machstdu das nicht einfach über den Debugger? Was soll ich dir sagen? Konsolendebugging istdas einzig wahre. So, blablabla, nice. Jetzt geht, jetzt funktioniert es. Okay, man mussden Kram danach noch mal explizit sagen, er soll den Kram wieder aufmachen. Okay, ja,muss man wissen, muss man wissen. Okay, wir machen jetzt mal eine eigene, links, hier,Open, keine Ahnung, ja, Order Form, klar. Also wir müssen das nur an einer Stelle allesaufmachen. So, und das da unten machen wir ab, fort, setzen es da durch, weil da kannman jetzt auch den anderen Knopf drücken, zack, hinzufügen, select, autocomplete, select,laggen wird nicht toleriert, naja, ja, guck da ist es jetzt hier, da wird es hinzufügen,also das funktioniert. Gut, das löschen geht glaube ich noch nicht, fuck, bam, in yourface. Das löschen funktioniert nicht, weil, wobei, muss ich mal gucken, das löschen daswar jetzt was anderes. Warum programmierst du mit einer nicht über Linux, weil das eineWindows Desktop Anwendung ist. Eine Windows Desktop Anwendung ist schwierig über Linuxzu gebasteln. Oh, neue Bestellung, zack, entfernen, okay, geht nicht, da weiß ich aber bereitsliegt, dass das nicht geht. Wieso programmierst du mit einer Sampler? Könntest du das auchin C machen oder in Go machen oder in JavaScript machen oder in, pass mal auf, in Erlang oderin Lisp oder in Kobol oder eventuell auch in Java. Aber wir wollen es ja mal nicht sosehr übertreiben jetzt hier, ne. Okay, das Updaten funktioniert. So, das löschen klapptnicht, weil, ich weiß warum das löschen nicht klappt, wenn wir nämlich hier draufklicken,das ist einfach Delete Selected Records, das, ähm, deletet die Sachen gar nicht. Swift,ja, Swift ist nice, also ich hab ganz, ganz wenig, ich hab also wirklich, eigentlich programmiert,was dann auch Info auf MyOS gerät gelaufen, jetzt hab ich noch nichts in Swift, aber ichhab mir mal ein bisschen Swift Tutorials und, ähm, ich guck mir ab und zu halt auch so dieaktuellen, von irgendwelchen Konferenzen und so die ganzen Webcasts an. Und ich muss sagen,Swift gefällt mir echt gut. Was mir in der ersten oder in der ersten Swift Version einbisschen, bisschen schwer gefallen ist, durchzusteigen, ist, wie das ganze String Handling funktioniertmit den unterschiedlichen Encodings. Das war ein bisschen, ähm, da hatten aber mehrereLeute das Problem und ich glaub, das ist aber, das haben sie jetzt, äh, schöner gemacht.Also, okay, wir müssen jetzt erstmal gucken, wie wir hier rauskriegen, was davon Selectedist. Data Grid, Selected, Selected, Selected Item, wir haben nur ein Item Selected, mehrgeht nicht, Selected Item, äh, ich, ich, wir machen jetzt mal eine, wobei, weil die Leutehier so auf dem Debugger stehen, aber das halt mal mit dem Debugger, ja. So, wenn ichjetzt hier auf löschen klicke, müsste er da anhalten. Löschen, zack. Okay, was stehtda drinnen? Order, blablub, sehr schön, steht das Richtige drin. Das heißt, wir könnenjetzt hergehen und sagen, ähm, Selected Item wollen wir löschen. Items, remove. Müssenwir das casten dafür? Wahrscheinlich müssen wir das casten. So, und jetzt sollte das mitdem löschen eigentlich auch funktionieren. Was genau brauchst du da? Wir bauen für Hardwaregerade ein Tool, wo er mit einem, mit einem Scanner, ähm, neue Seriennummer scannen kann.Funktion, die Funktionsstar sind die besten, ne? Wo er mit einem Scanner neue, neue Lieferungenscannen kann und dann irgendwie in einem halben Jahr gucken kann, welche Seriennummer in welcherLieferung drin war. Also eigentlich soll irgendwie so ein bisschen Tutorial, Tutorial Zeug. Istes das gleiche wie casten? Nee, ist es nicht. Casten, also der cast in Klammern, wenn dassich nicht konvertieren lässt, geht direkt kaputt. Ähm, beziehungsweise der, der casteteinfach auf, ohne Rücksicht auf Verluste. Mit S kommt Null zurück, aber er kackt nichtab, wenn ich das irgendwie. Wobei ich mir jetzt gar nicht sicher bin, es gibt ja verschiedeneVarianten. Äh, Difference, die Scharp zwischen S ist und cast. Wieso machst du das nichtin Python? Warum machst du das nicht in Ruby? Warum machst du das nicht in Go? Warum machstdu das nicht in JavaScript? Ähm, ja, Python ist nicht unbedingt jetzt das, was ich fürWinner aus Desktop Software verwenden würde. Ach genau, ist castet nicht, ist guckt nur,ist guckt nur und gibt True oder False zurück, ob das Objekt sich cast, nee, nee, ob das Objektdieser spezielle Typ ist. S gibt Null zurück, wenn es sich nicht konvertieren lässt undder Casting Operator, also das in Klammern, das richtig casten, dann kackt es direkt ab.Keylogger, Keylogger ist schon integriert. Ok, mal gucken, ob das mit dem Löschen funktioniert.Ok, adden, bla bla blub, add add add, mal gucken, was hinzu kommt, save, tak, Räumestellungdelete, delete, what? What the hell? Warum geht das Löschen nicht? Wonka, Smoke, ichhab das Löschen kaputt gemacht. Lebt der Versand-Tracksor noch? Äh, ja, ich hab abernicht weiter gemacht. Wo ist das Problem? Hier, hier, das mag er irgendwie nicht. Warummag er das nicht? Was hat er für Schmerzen jetzt? Was mag er da dran nicht? Ja, da, addadd add, löschen, add add add, löschen, save, löschen, löschen, ok, also prinzipiellfunktioniert das noch. Was mag er hier dran jetzt nicht? Liegt da den Funktionsnamen eindeutig,eindeutig muss. Außerdem Leute, das sind die absolute next level big brain Funktionsnamen.Was ist das für Zeichenspart? Hä, the fuck? Ich bin verwirrt. Wir haben doch sogar ebennachgeguckt, dass das funktioniert. Ich bin echt verwirrt. Warum geht das Löschen nicht?What? Hä? Das muss funktionen, wir haben extra gerade reingeguckt, ob da das Item drin ist,aber der macht ja, es ist ja nicht so, also der macht einfach gar nichts oder hab ichnicht das Richtige selectet. Doch, hä? What? Das Programmier ist so ein Tool, wo man Seriennummernsuchen kann, in welcher Bestellung die Seriennummer drin waren. Also eigentlich was kleines. Allerdingsmit einem UI Framework, was ich im Leben noch nicht verwendet hab. Debugging die Remove Funktion.Hä? Das check ich jetzt grad nicht. Aber wenn der Cast nicht klappt, dann sollte er zumindestDelete Active Item sehen. Guckt hier. Selected Item.Hä? Selected Item ist das hier. Wartet mal.Nein. Wartet mal. Ob ich weiß woran das liegt. Das funktioniert. Das funktioniert. Hast duzur Zeit eine Freundin? Ja, in den Twitch Chat. Das funktioniert. Ich glaube wir müsseneinfach nur Refreshen. Ich glaube das funktioniert alles. Ich glaube das funktioniert eigentlichalles. Passt mal auf, ich glaube ich weiß woran das liegt. Ha! Oh. Geht nur einmal. Ne.Es ist ein bisschen kaputt. Oh, da ist ein Fehler im Icon. Ganz schlimm. Neue Bestellung,da ist kein Lull drin. Man muss jetzt neu anklicken. Aber ich glaube ich weiß worandas liegt. Wenn ich das jetzt mal hinzufüge. So, löschen wir mal irgendwas. Man aktualisiertes hier an der Stelle nicht, aber ich weiß woran das gelegen hat. Ich glaube das liegtda dran, dass wenn ich es hier lösche, aus dieser Collection mit Items, ich es hier nichtmal löschen kann, weil quasi die Sache unten drunter schon weg ist. Weil der hier greiftda drauf zu. Deswegen versucht das zu löschen und finde das nicht mehr. Also vielleichtgeht das, vielleicht geht das wenn ich so rum mache. Machen wir noch mal einen Breakpointund gucken nach. Machen wir es mal so rum, vielleicht geht das. Oh. Continue. Ja, esist weg oder? Ich glaube es ist weg. Ne, ist nicht weg. War es weg oder war es nichtweg? Das erste. War das erste weg oder nicht weg? War noch vorher eins mehr. Ja doch. Derwählt bloß nicht das gleiche wieder aus was vorher selectet war. Na ja gut. Das ist aufjeden Fall nicht schön synchronisiert. Ich glaube das müssen wir doch mit irgendeinerData Table machen oder so. Dann muss man den Kram nicht von Hand machen. Na ja, aberfinde ich schon mal ganz gut. Was ich also nicht ganz verstehe ist, wenn ich jetzt denKram hier hinzufüge. Ja guck das ist nicht gesynkt, das ist nicht gesynkt, das sackt.Das muss ich anders machen. Das ist Müll. Der löscht das hier, danach löscht das da.Kann man vielleicht, kann man es vielleicht einfach so machen, dass ich sag hier remove,lasse das weg und refresh dann einfach nur. Das funktioniert. Aber was jetzt noch nichtgeht ist das save und lösche den Kram dann. Das speichert er dann nicht, das kommt nichtgelöscht an. Das ist mir jetzt noch nicht ganz klar. Da gucken wir mal, ob ich hierirgendwelche Subs übersehen hab. Das ist der Amec. Weiß ja nicht, ob ich das vorgelegthaben habe, aber Dankeschön für den Sub. Terox und xFatal. Vier Monate in der Folge.Huge Sub. Poggers Massive Sub. Das ist Visual Studio. Kostet mittlerweile auch nichts mehr.Was ich jetzt nicht so ganz kapiere ist, why, wenn ich das update, dass dann nicht gelöschtwird. Das ist jetzt free, ja. Eigentlich sollte es an der Stelle alles weggeschmissen werden.Ja, die Community Edition ist free, also das was du brauchst ist im Endeffekt free. Ichweiß gar nicht so genau, was der Unterschied ist aktuell zwischen Visual Studio Communityund nicht Community. Früher war es mal diese, ich glaube diese Codesave, nee, nee, wiehieß das? Team Studio, nee, fuck. Diese komische Microsoft Source Code Verwaltung, die ehkeiner verwendet hat, war glaube ich ein paar Code Analyse Sachen sind wohl glaube ich auchauf Professional festgelegt. Azure Integration ist glaube ich auch nur bei Professional, aberansonsten ist das meiste brauchst du davon eh nicht. Wir können ja mal gucken. CommunityProfessional. There is no difference between Community or Professional when using UnityEngine. Ok, wir wollen nicht Unity. Compare Visual Studio Offerings. Ok, guck mal wasda. Usage Scenarios, Enterprise, was auch immer sich dahinter verbirgt, man weiß esnicht. Ach nett Cody, das Geflame gegen Unity finde ich unberechtigt. Das sind die Spieleentwickler,die kacke entwickeln und nicht Unity. Das ist genauso wie mit Java, über Java macheich mich auch immer gerne lustig und man kann auch in Java viele ordentliche Software programmieren.Sir of Jelly, da würde ich komplett unterschiedliche Sachen für verwenden. Java in Visual Studioist nicht so tolle. Python in Visual Studio geht mittlerweile zwar, aber hält sich inGrenzen. C geht wahrscheinlich auch, aber gibt es wahrscheinlich auch besseres. AlsoVisual Studio würde ich eigentlich nur verwenden für Winners Anwendungen, also sprich F Sharp,C Sharp. Was geht denn noch schön in Visual Studio? Die Microsoft C++ Geschichten. Mittlerweilegeht glaube ich auch JavaScript ganz gut. VB, genau, Visual Basic habe ich ja komplettvergessen, falls es heute noch jemand verwendet überhaupt. Verwendet jemand noch Visual Basic?Golang und Ruby, echt? Geht nicht gut in Visual Studio. Also ich habe mal vor ein paar Jahrenversucht Ruby in Visual Studio zu programmieren, das war nicht schön. Ja PyCharm ist gut.Ihoden Rakete verwendet VBA, ja das wundert mich nicht bei dem Namen. Mit VBA das gehtab wie Rakete, aber. VBA, weiß gar nicht welche Software heute noch VBA, aber Excel, Excelverwendet vor allem VBA. Und jetzt ganze Office, ganze Office gedönnt, oder? Ganze Office gedönntist glaube ich noch VBA. Access Formulare, oh alter. Access Formulare. Ich verwende keineAccess Formulare, ich verwende nur CSV. CSV, Master Race, beste. Visual Basic ist docheh genau gleich wie C Sharp, nur dass man statt Klammern eben Then und End If benutzt. Genau.Viele Sachen, viele neueren Features, die sie jetzt da entwickeln bei Microsoft. Esist ja nicht mehr direkt gesyncht, C Sharp Version und.NET Release, aber C Sharp kriegteindeutig mehr Liebe als Visual Studio. Und ein paar Sachen, ich hab sogar letztes Malin irgendeinem Webcast da drüber gesehen, sind bis heute nicht in Visual Basic angekommen.Unter der Haube, was da als IL Code rausfällt, das dürfte ziemlich das gleiche sein. Arbeitendie überhaupt noch an VB.NET? Sie haben nie das Gegenteil behauptet. Wahrscheinlich soein bisschen wie bei Windows Phone. Ok, also was erzählt es? Live Dependency Validation.Ok, ich weiß nicht mal was es ist, deswegen geh ich mal voll aus, ich brauch das nicht.Das ist Live Dependency Validation. Azure, Azure DevOps Lab. Ok, Azure Zeug, das brauchich schon mal nicht. Ich muss übrigens noch, Leute, wir müssen noch ein bisschen was inAzure machen, fällt mir gerade ein, in einem der nächsten Streams so ein bisschen in Azureherumklicken, weil ich hab noch 90 Euro auf meinem Azure Account drauf und es verfälltin 11 Tagen. Da müssen wir noch ein bisschen, da legen wir uns mal ne 120 Core Kiste anAzure und lassen die 2 Sekunden laufen, dann ist das Geld all. Hast du nicht auch nochGeld auf Fiverr? Doch, 120 Euro oder so, weil die alle abgesagt haben. Ah, also gth44,was ist es überhaupt? Ich kann mir da überhaupt nichts darunter vorstellen. Live, also mankann Live irgendwelche Abhängigkeiten überprüfen, was sagt uns das? Keine Ahnung. Ok, man kannirgendwelche Diagramme erstellen, das brauch ich auf jeden Fall nicht. Das Design irgendwie,den Aufbau irgendwie überprüfen, was auch immer es ist, keine Ahnung. Code Clone, auchkeine Ahnung, was das sein soll. Code Lens, das kenn ich, das ist so ein Code Analyzervon Microsoft, der dir dann teilweise sagt, hier an der Stelle ist per Style Guide, keineAhnung, ein Simikolon vorgesehen oder eine Komma oder irgendwie man schreibt die Ifsam Anfang und nicht am Ende oder irgendwie sowas, das glaube ich Code Lens. ÜbrigensLeute hier, was auch witzig ist, was komisch ist, Rishel Studio hier, ach nee, es ist auchnicht wirklich schneller, die haben irgendwas mit der aktuellen Version gemacht, die habenirgendwas mit der aktuellen Version gemacht, dass, nee hier gehts, hier gehts. Auf meinemMain Account ist die Autovervollständigung so übertrieben langsam geworden, ich weißgar nicht woran das liegt und ich hab schon den ganzen, bis der standardmäßig dabeiist, deaktiviert. Weiß ich gar nicht woran das liegt, warum mein Main Account so langsamist. So, wir wollen ja noch gucken, was der Unterschied ist. Peak Definition, ja gut,das geht bei allem. Advanced Debugging, Konsole, beste. Intellitrace, ich hab aber, nee, nochnicht mal, Rishel ist alles aus auf meinem Main Account, also Main Windows Account, aberda leckt IntelliSense übelst rum. Ey, meine tollen Funktionsnamen, Leute, ich hab dasin zwei Stunden, bevor ich jetzt, ich bin direkt danach angegangen, als es halbwegsfunktioniert hat, den Kram hier zusammen gewurstet, ja, was man machen können. Kannich mir jetzt nicht auch noch tolle Funktionsnamen überlegen, weil. Code Map Debugger Integration.Source Map kenne ich, weiß nicht, was ein Code Map ist. Der Antivirus, das könnte sein,wobei ich Windows Defender sowohl hier als auch auf dem anderen habe, aber das könntesein. Vielleicht muss ich einfach nur mal den Windows Trick machen und Rishel Studiodeinstallieren und neu installieren. Das hilft bestimmt..NET Core Memory, okay, dasbrauche ich, das habe ich zum Glück noch nie gebraucht. Code Matrix. Snapshot Debugger,Time Travel Debugging. Alter, das liest sich mal absolut next level. Time Travel Debugging.Wie darf man sich das vorstellen? Zurück in die Zukunft mäßig, oder was? IntelliTest,weiß ich auch nicht, was es ist. Live Unit Testing, kann man dann der Qt Chat dabei zugucken,wie die Tests durchlaufen. Cross Platform. Samarien brauche ich nicht. Also, man sieht,was fehlt an Rishel Studio Community zu Enterprise ist nicht wirklich wichtig. Ich muss mirdas aber in Ruhe noch mal ein bisschen überlegen, wie wir das machen mit dem Schreiben in dieDatenbank beziehungsweise das Updaten und Lesen. Das ist, so wie ich es jetzt zusammengewusstet habe, auf jeden Fall nicht der Weisheiterschluss. Wir nehmen lieber doch eine Data Table undwir nehmen irgendwas, wo man nicht laufend Refresh aufrufen muss, sondern was automatischcheckt, bin refreshed und so. Mal gucken. Aber was ich immer noch nicht ganz checke ist,warum der hier, das hat damit nichts zu tun, warum der hier die Sachen nicht updatet.Sollte er hier eigentlich die Sachen updaten? Das gucken wir uns jetzt gleich schon mal an.Bloop Chat. Fügen wir ein paar Dinge hinzu. Saven, gesaved. Und jetzt sollte er die eigentlichauslegen. Kann das? Passt. Ok. Order. Items. Drei. Passt doch. Warum macht er das nicht?Aber der macht prinzipiell schon das Richtige. Aber hier refresht er den Kram nicht. Warumdenn das nicht? Der müsste das doch refreshen. Warum refresht er das nicht? Warum refreshter das nur beim adden? Ok, ne, das ist irgendwie von der Logik her von Arsch. Bezahl einfachwen auf Fiverr. Alter, auf Fiverr, die haben mir noch nicht mal einen Twitch Chatloggerhingekriegt. Den Controls gescheite Namen geben, ja. BattleLP Twitch Prime, Dankeschön. Irgendwiedas hier rum. Er saved das? Der data das doch richtig. Xdafuck Twitch Prime. Dankeschön,nice. Big Brain. Wie ist denn das? Ist das irgendeine EF Core Geschichte vielleicht?Dass man. Na gut. Ok, ich muss mal was eintragen, was ich auch wieder finde. Ähm. Ist dasvielleicht eine EF Core Geschichte? Dass der die Sachen nicht löscht? Als Abhängigkeitdann könnte das sein. Also wir haben jetzt ja nachgeguckt, dass das löschen prinzipiellrichtig funktioniert. So, Moment, äh, mach das nochmal zu. Wir benennen das jetzt malso, dass ich, dass ich's finde hier. Keine Ahnung. Äh, hallo. Hallo und dann fügen wirhier was hinzu. So, save. Funktioniert. So, wir löschen jetzt alles bis auf drei. Save.So, und wir haben gerade nachgeguckt. Ähm, das funktioniert. Kann das sein, dass EF Coredas nicht löscht, wenn ich's eben nicht explizit sage? Weil, es ist ja so, ich update hierzwar die Order, aber was ich gemacht habe sind, ähm, quasi Sachen aus Items löschen.Muss man, muss man das dem irgendwie explizit sagen, dass er das, dass er das löschen soll?Aber gucken wir mal. Gucken wir mal mit dem SQL Explorer, was denn, was da hinten jetztrausgekommen ist. Borders, hallo, 23. Tatsächlich, der löscht das nicht. Ähm. Muss Max jetztdas Fiverr Projekt zeigen? Ich weiß gar nicht, ob ich da hinkomme. Dann müssen wir uns jetztauf Fiverr einloggen, Klei. Ey Leute, wollen wir uns jetzt Fiverr angucken? Fiverr? Da gibt'saber nicht so viel zu gucken. Okay, da müsst ihr mir jetzt helfen. Da müsst ihr mir erstmalhier das, das Problem müssen wir jetzt noch fixen und dann gucken wir uns Fiverr an. Also,das ist irgendeine Konfigurationsgeschichte von mir, weil ich zu smallbrain bin. Ich habhier eine Order mit Items drinne. So. Und wenn ich da, wenn ich dort jetzt Items löscheund sag meiner Datenbank, update mal diese Order, dann löscht er nicht die Items daraus. Er fügt sie nur hinzu. Was muss ich EF Core sagen, dass der das macht? Da müssenwir Google fragen. Child Collection. Da, da ist doch hier die Frage. Was? Aha. Okay,oder löschen oder hinzufügen. Ah, der hat aber Recht, was er hier schreibt. Ich glaube,daran liegt das, weil meine Order, glaube ich, weiß woran das liegt. Meine Order setzeich, setze ich hier. Die kommt nicht, die kommt nicht aus dem, aus dem DB-Kontext unddementsprechend trackt er auch meine Changes nicht. Das heißt, wenn ich will, dass dasfunktioniert, wenn ich will, dass es funktioniert, muss ich das Ganze hier nochmal irgendwieaus dem DB-Kontext laden oder so und dann löschen. Und dann wird es wahrscheinlichfunktionieren. So. Das kommt nicht aus dem Change-Tracker hier beziehungsweise nichtaus dem DB-Kontext. Attach-Method. Aha. Nee. Geht das Attach?So. Kann man das, kann man das einfach so?Kann man das einfach so machen? Nee, oder? Kann man nicht einfach so machen, oder? Dasfunktioniert bestimmt nicht. Nee, nee, nee, funktioniert so nicht. Sehr gut, dann mussich mir das nochmal in Ruhe überlegen. Oder gucken wir uns jetzt gleich Fiverr an, würdeich sagen. Ich muss gucken, dass das, ich muss, ich muss das mit, ich muss das andersmachen. Ich weiß, ich weiß, wie ich das machen muss. Und zwar ich übergebe hier nicht dieOrder, sondern ich übergebe die Order-ID und lade mir den Kram dann, ja, und lade mirdann den Kram raus aus dem, aus dem, aus dem DB-Kontext. Müsste ich, das müsste ich hiereigentlich machen. Irgendwie so. Da muss ich mal gucken. Wollte mal gucken, wie wir dasmachen. Okay, also gucken wir uns mal Fiverr an. Wir sind ja schon wieder eine Weile on,ne? Nachdem ich da schon mal zwei Stunden am Stück vorher das Ding zusammen gewurstethab. Ja, also. Dann loggen wir uns mal ein auf Fiverr. Ich muss, es kann aber sein, dassich euch ausstellen muss, weil ich nicht weiß, was ich über Fiverr registriert hab. Hattenwir nicht das Fiverr Projekt hier schon mal runtergeladen oder so? Ne, ne? Okay, Fiverr,Fiverr. Also, für alle, die sich mitgekriegt haben, ich habe mal vor einer Weile ein Toolprogrammiert für den Twitch-Chat, was einfach den kompletten Twitch-Chat mitschneidet undschaut, was mich erwähnt. Glaube, das gab es hier. Contains and Wobblers. Ne, das istdas nicht das Richtige. Das heißt zwar Twitch-Chat, aber das ist nicht das Richtige. Was war dasRichtige? Kurz gucken, wie das wirkt. Boah, jaja. Okay. TestNet3, wirklich Net3 genannt,natürlich wieder typischer Max-Big-Brain-Name. Das Ding Net3 heißt. Ja, das ist es. Also,starten. Kostet weiter nicht den Haufen Geld, doch. Ich verwende einfach immer die Lizenzzum Trial. Okay, ich zeige euch jetzt mal das Tool, was ich dort in Auftrag gegebenhabe. Ich glaube aber, ich habe es kaputt gemacht bei mir. Welcher Port tauscht dasstandardmäßig? Steht da irgendetwas da? 5000. Also, so sieht das aus, was ich da gebastelthabe. Also, im Prinzip, nichts großartig kompliziertes. Ein Tool, was alle Twitch-Chat-Fragen mitloggt,die an mich gehen, sodass ich keine Fragen mehr übersehe, mit einem Knopf dahinter,um die Sache zu löschen. Und, das, wie man hier sieht, ist nicht sonderlich viel. Dassind so 100, 200, so 200, 250 Zeilen inklusive HTML und allem Boilerplate, was man so braucht.Also, es ist nicht großartig kompliziert und man sieht es hier auch, es ist ziemlichübersichtlich, was man dafür machen muss. Also, Web-Anwendung und auch das HTML istwirklich super easy. Also, sieht man, das sollte für jemanden, der ein bisschen geübtist, echt kein großer Akt sein. Will einer Black Ops 1 Key verschenken? Wo es das günstiggibt? Guck mal, irgendwie bei G2A, Kinguin oder irgendwie so komischen Key-Shops. Also,es ist nicht sonderlich schwierig. So, und ich bin auf Fiverr gegangen und hab nach dengünstigsten Programmierern gesucht, die versprechen, eine vollständige ASP.NET-Anwendung zu programmieren.So, ich muss mich jetzt mal einloggen. Fiverr ist eine Plattform, wo du kreative Leutebeauftragen kannst, Dinge für dich zu machen. So, ich muss jetzt erstmal hier kurz gucken,wie mein Passwort für Fiverr ist. Okay Leute, muss ich mal kurz ausblenden, wenn ich sicherbin, ob das hier funktioniert. Soll ich mal gucken, ob das auch noch funktioniert.Okay, don't save. Bin eingeloggt bei Fiverr. Kannst du einen Passwortmanager empfehlen?Ja, ich verwende immer noch Key-Pass. Seit Jahren schon. Damit fahre ich eigentlich auchganz gut. So, also, denk dran, das hier sollte rauskommen. Eine simple Web-Anwendung, dieChat mitloggt auf Twitch. So, und ich hab mir bei Fiverr Leute rausgesucht. Guck mal,120 Euro hab ich noch auf Fiverr, weil die alle wieder zurückgezogen haben. Ich änderemal den Titel auf Fiverr. So, und ich hab mir Leute rausgesucht. Guck mal, hier Orders.Cancelled, Cancelled, Cancelled, Cancelled. Messages. Inboard. Wo sind denn die Messagesvon den Typen? Ja, also, ich hab mir hier Leute rausgesucht,wie Ahmed zum Beispiel, der halt gesagt hat, ich programmiere euch eine komplette ASP.NETCore Web-Applikation, überhaupt kein Problem. Da hab ich ihm halt erklärt, was ich habenwollte. Und gibt es hier keine ordentlichen Messages-Übersicht eigentlich bei Fiverr odernicht? Ah, hier, View All Orders. Da, jetzt kann ich es euch zeigen. Completed. Genau,und hab ich ihm beschrieben, was ich haben will. Nämlich halt sowas hier. Im Prinzipeine Web-Anwendung, die sie bauen können, wie sie wollen, was sie dafür verwenden, istmir eigentlich egal. Hauptsache sie verwenden ASP.NET Core im Backend, weil ich hab mirhalt ASP.NET Core Entwickler rausgesucht und hab ihnen gesagt, hier, mach einfach, macheinfach, mach wie du willst. Ich will den Tool haben, was Twitch Chat mitguckt, ob ichangeschrieben werde. Ganz einfach. So, es haben von 11 Leute, die ich angeschriebenhabe, haben 10 Leute gecancelt. Ich mein, ich kanns verstehen. Ich würde das für 6,67Euro auch nicht machen. Also ich würde den Rechner für 6,67 Euro noch nicht mal hochfahren.Dafür. Ich kann verstehen, dass sie alle abgesagt haben. Aber sie haben alle in ihrem Profildrinstehen, dass sie sowas machen. Und wer reinschreibt, dass man für 6,67 Euro anykind of ASP.NET MVC or Core Application developed, dann sollte man es vielleicht nicht reinschreiben.Aber es steht halt drin. Ja, es ist im Prinzip viel heiße Luft und nichts dahinter. Zumindesthaben die alle abgesagt. Der eine war richtig cool. Ich weiß jetzt gar nicht, welcher dasgewesen ist. War das der hier? Nein. War das der hier? Nein, das war der hier. Nein, daswar der hier. Okay, der hat gleich gecancelt. Der hier, genau. Ich hab denen übrigens auchallen einen Hinweis gegeben. Ich hab denen den Hinweis gegeben, wenn sie nicht weiterwussten. Wobei ich eigentlich ganz ehrlich davon ausgegangen wäre, dass ein guter Programmiererdas selber rauskriegt. Ich hab denen alle noch den Hinweis gegeben, dass soweit ichweiß, Twitch einen IRC Chat anbietet, den man anonym benutzen kann. Das hab ich allen,die gesagt haben, sie wissen nicht genau, was ich will, was ich mach. Das hab ich denenallen gesagt, weil ich hatte das Gefühl, es hat da keiner so richtig gecheckt, wie erdas machen soll. Der Typ hier war eh geil. Ich hab ihm gesagt, ich geb ihm sogar nochTrinkgeld, wenn er's extra macht. Und jetzt kommt halt die Frage, how much is your budget?Er hat's für 11,43 Euro reingestellt. Dann hab ich gesagt, 50 Euro maximal. Und der anderekommt, ich will 700 Euro. Der will's wissen. No. Das ist schon geil, ne? Lass mal haltso Dinger reinschreiben. Mal gucken, was mittlerweile im Profil steht. Sein Profil geupdatet.Ach, guck mal. Das gibt's überhaupt nicht mehr. Das ist was anderes. Der hat jetztsein Profil geupdatet. Ich mein, aber komm. I will create a custom web solution for yourbusiness needs. Da kann man das schon drunter vorstellen. Single page application. Er hatalles reingeschrieben, was man braucht. So, 9,40 Euro. Und dann will er 700 Euro. Bam,in your face. Ich hab denen aber übrigens alle keinen Stress gemacht. So was erlaubtwahrscheinlich nicht. Wahrscheinlich ist es auch gegen die Pfeiffer-Regeln, aber ichmein, okay, erst. Und ich hab ja halt gesagt, okay, übrigens mein Name ist der beste. Ichheiße Max Lull, aber stelle mich immer als Peter Lull vor. Als Peter Lull oder PeterWubblords oder irgendwie so. Ja, hier sind die Project Specification. Naja, also daswar, das kam viele, die sowas geschrieben haben. Gab viele, die sowas geschrieben haben,dass sie das nicht für die Kohle machen. Und ich mein, guck mal, ich bin der Ansicht,ich bin ihm schon ziemlich entgegengekommen. Ich hab ihm gesagt, okay, 11,43 Euro seheich ein. 50 Euro ist okay. Und dann immer noch nicht. Ich würds für diesen Preis natürlichauch nicht machen. Aber dann sollen wir es halt nicht reinschreiben. So, und das gingmit allen so ein bisschen hin und her. Und der Einzige, der was geliefert hat am Ende,für wie viel hättest du sowas gemacht? Das eigentliche Machen ist gar nicht so, garnicht so das Problem. Es ist ja, warum es für schwierig fällt, das einzuschätzen ist,ich hab im Vorfeld halt ne Weile auch geguckt, wie man das am besten machen kann. Deswegenhab ich denen auch alle den Hinweis auf den IRC-Chat gegeben. Keine Ahnung. Sind wir dieFrage, ob auch noch dann anschließend Support irgendwie mit dabei ist oder noch extra Wünscheoder so. Aber ich sag mal so, was in dem Umfang, was ich hier zusammen gewurstet hab, ich kauffür, keine Ahnung, 200 Euro oder so. 200 Euro, 300 Euro, 200 bis 300 Euro wär ichdir wahrscheinlich zufrieden mit. Irgendwie soll man Daumen gepeilt werden. Natürlichwürd ichs da ein bisschen schöner machen als nur für mich. So, aber 700 ist ein bisschenviel. Mal ganz davon abgesehen, kann man das nicht so wirklich vergleichen, weil, dassind ja halt zum größten Teil Inder oder irgendwo aus dieser Ecke, wie man das auchan den Namen sieht. Und da siehts ja mit Kohle noch mal anders aus. Deswegen können dieja auch die Sachen so billig anbieten. Naja, zumindest der einzige, der geliefert hat,ist Develop WordPresser. Okay, der hat sein Profil mittlerweile geändert. Ja, der einzige,der den Auftrag erledigt hat, ist Umasharik2. Der hat auch ein bisschen rumgewurstet. Blablabla,die haben hier all looks fine. Soll Peter Lull enthalten. Okay, und er hat mir das Ganze,den Source Code hat er mir geschickt als Ra-File. Auch schonmal geil. Twitch.ra, deswegen lad ichdas jetzt auch nur unter Linux runter. Ich mein, verschickt ihr eure Aufträge beziehungsweiseeuren Source Code. Ich auch immer per Ra-File. Der andere Seite, was soll er großartig machen?Ich meine, er hätte mir einen Link zu irgendeinem Repo schicken können, aber er hat seine Seitemittlerweile geändert, dass er kein, dass er kein, dass er, er macht kein ASP.NET mehr,macht das nur WordPress. So, okay. Jetzt gucken wir uns mal den Code an, den er gebastelt hat.Unra, ich weiß gar nicht, ob ich das installiert hab. Twitch. Ach so, wie geht das? X. So, und dasist das, was er programmiert hat. Wir müssen dazu sagen, ich muss dazu sagen, ich hab schonmalreingeguckt und da waren ein paar sehr abenteuerliche Sachen dabei. Wenn ihr wollt, können wir unsspäter auch noch die anderen angucken, was sie so geschrieben haben. Ich versuchte ein bisschen,bisschen mehr Geld aus den Rippen zu leiern. Okay, machen wir das Ganze mal auf. Ups. Oder?Hat er eigentlich, hat das jetzt eigentlich aktualisiert? Den Titel? Für euch? Vom Streben?Ja, okay, nice. Ups. Ups. Hat es jetzt funktioniert? Ja, hat funktioniert. Perfekt.Also, gucken wir uns mal an, was er programmiert hat. Wo fangen wir denn am besten an? ProgramCS. Das ist Default, da hat er nichts drinne gemacht. Also, das ist ein ganz normales ASP.NET Core,wie soll ich sagen, Standard Template. Assassin of Fivehead, richtig Fivehead. Big Brain. Also,da hat er nix schonmal drinne gemacht, da müssen wir mal schauen. Oh fuck, mein Twitch-Vorschau-Browserist gerade übelst abgekackt. Was ist da los? Warum ist das kaputt? Leute, Chat, jetzt benehmt euch,ich seh den Chat grad nicht mehr. So, mein Chat ist wieder da. Okay. BattleLP und Xdafuck. Dankefür, geiler Name, für den Sub. Hab ich glaube ich übersehen. So, okay, gucken wir mal, was er hat. Okay, also das ist Standard Default-Things.Standard, hat er hier was drinne gemacht? Nein, das ist auch Standard Template. Standard ASP.NET Core Template,da hat er nix drinne gemacht. Das ist auch Standard. Bootstrap, JavaScript, hat er da was gemacht? Nein.CSS, das ist auch Default. Wo hat er denn überhaupt was gemacht? Twitch, das ist von ihm wahrscheinlich.ISC-Chant.CSHTML, Razorpage. Okay, also, big brain code, gucken wir uns jetzt mal an. Also, was macht er hier?Es sind irgendwelche Razorpages. Model. Twitch Chat, Twitch, okay, die Models müssen wir uns auch nochmal angucken. Twitch View Model.Username Channel. Okay, das hält sich in Grenzen. Einheitlich, ob groß oder klein schreiben, ist auch nicht angesagt.Also, man merkt, ist das ASP.NET, ja, ist das, ist das, also man merkt, dass er wahnsinnig Bock hat auf das ganze Projekt.Lemonv7, Dankeschön. Okay, gucken wir uns mal an, was er hier getrieben hat. Was, was genau soll mir das hier sagen?Darf man das so nicht machen? Okay, also, das ist eine Razorpage mit diesem Model. Dann ein bisschen HTML.Er zeigt den Username an. Machst du ein Code Review? Naja, ich habe, also, STBA42, ich habe bei Fiverr ein paar Sachen in Auftrag gegeben.Und gucke jetzt, was rausgekommen ist. Zeig doch erstmal das Programm. Nee, ich fühle das nicht einfach aus, ohne mir angeguckt zu haben, was da drinnen steht.Glaubst du doch selbst nicht, dass ich das einfach mal ausführe, ohne reingeguckt zu haben. Das hier ist, glaube ich, echt big brain.Guck mal. Item in Model Take One? For each in Take What? Das habe ich schon mal gesehen, das habe ich, das habe ich mir, das ist die einzige Zeile, die ich mir schon mal angeguckt habe oder, oder, oder mir in Erinnerung geblieben ist von der ganzen, was ist das?Hat das irgendeinen Sinn? Versteht das einer? Warum? Also, ich meine, das ist eine Schleife, ja, ich, ich weiß, was es macht, aber ich versuche mich gerade rein zu denken, warum man das so macht.Also, ich meine, es ist eine Schleife über einen IEnumerable. Allerdings ist da immer nur ein Item drin. Hätte er nicht einfach Model nehmen können oder, oder einfach, oder einfach Model 1 oder Model First oder Model First or Default hätte er nehmen können oder sowas?Das einzige, äh, Patrick weiß ich nicht mehr, das einzige, was mir hier zu einfällt ist, so wird das nicht ausgeführt, wenn in Model, wenn keine Models drin sind, aber da hätte man einfach auch einen If machen können.Also, das ist, das ist schon ein bisschen sehr um die Ecke. Eine Vorschleife über, über ein Element, anstatt das Element direkt zu verwenden.So, und das ist JustinFan12345, okay, daco, SplitItBaby, die besten Kommentare ever, SplitItBaby.Was macht der denn hier? Document Get Element By ID Content. Okay, Inner, InnerHTML, jetzt, jetzt, jetzt replace da irgendwelche Farben oder so.Picsing a bit to string, string, der bastelt irgendwelche HTML Geschichten zusammen, ähm, okay, er macht irgendwelche Magic für sein HTML, jetzt macht er SplitItBaby, ähm, und jetzt guckt er, ob das ganze rot ist.Und wenn es nicht rot ist, färbt er es rot. Wenn ich das jetzt so richtig, richtig interpretiere.Der färbt meinen Namen rot, der färbt meinen Namen rot, allerdings hat er nicht verstanden, was ich haben will, allerdings hat er nicht verstanden, was ich haben will, er soll nicht den Namen JustinFan rot färben, sondern er soll Peter0, wie ich eben auf Fiverr heiße, rot färben.JustinFan brauche nur für den Twitch Chat IRC, nicht für das Webfrontend. Also von der Funktion her ist es schonmal falsch, das macht nicht das, was ich haben wollte.Ähm, okay, was haben wir da als nächstes? Controller, was ist denn im Controller drin? Der Twitch Controller. Socket? IRC-Chat? Ach nee, das hat er einfach generiert.Okay, er macht hier nichts. Das hier, das hier ist die eigentliche Sache, das hier ist die eigentliche Sache, die, ähm, die man braucht, um sich zu dem Twitch IRC zu connecten.Und wisst ihr was das lustige ist? Das ist eins zu eins der Python-Code, den ich ihm geschickt habe. Das ist noch nicht mal eine eigene Leistung gewesen, das hier auch da drauf zu kommen, weil was ich euch jetzt gar nicht gezeigt habe ist, in dem Auftrag habe ich ihm erklärt, wie es geht.Ich hab ihm mit dem Auftrag erklärt, wie es funktioniert, ähm, und hab ihm, ich hab ihm, ich hab ihm, ich hab ihm, ich hab ihm Python-Sample-Code geschickt, wie es funktioniert.Und er hat einfach nur den Python-Sample-Code genommen und hat das halbwegs lauffähig gemacht in, in.NET. So.Was aber okay ist. Was aber okay ist. Da hab ich, da hab ich überhaupt keine Schmerzen mit. Es ist natürlich ein bisschen blöd, dass ich's ihm raussuchen musste.Ja, ich hab ihm fünfmal versucht zu erklären, um was es geht, ähm, aber wie gesagt, der Einzige, der's gemacht hat. So, jetzt gucken wir uns mal an, ob das hier überhaupt theoretisch funktioniert, was er da, was er da gebastelt hat.Also ganz ehrlich, wenn ich einfach nur ein normaler Typ auf Twitch wäre, der sowas haben möchte und es nicht vorher selbst programmiert hätte, ich hätte ihm garantiert nicht einen Link zu einem GitHub-Projekt schicken können, wo das eine an Python schonmal gebastelt hat.Die variablen Benamungen sind auch absolut Kraut und Rüben, ne?IP.Werden die Leute eigentlich geprüft mit Testaufgaben? Nö.Ich glaube, was er versucht zu machen oder was der, das ist im Prinzip, also ich zeige euch mal zum Vergleich, wie es bei mir ausschaut, wie meine Sache aussieht. Wo kann man hier nochmal Projekte aufmachen?Ja. Also mal zum Vergleich. Meine Geschichte sieht so aus. Da sieht man, es ist eigentlich relativ ähnlich, nur kann man diesen Shit da mal ausblenden.Also, das ist, das sind die vergleichbaren Sachen von mir. Und das ist was Base64 encode.War das überhaupt? Mach ich doch an der Stelle auch nicht. Um eins funktioniert er. Base64 encode?Brauch beizen, wusste nicht, wie sonst, ich weiß nicht. Aber ich bilde mir an, man muss irgendwas mit Base64 machen. Encode ich das irgendwo? Base64 hier, seht ihr was?Ich bin erstaunt, dass das funktioniert. Ich bin erstaunt, dass das funktioniert.Der schickte Base64 encode das rüber, wo man eigentlich UTF-8 bytes schicken sollte. Ob das funktioniert? Da bin ich mir nicht so sicher.Okay. Das macht gar kein Base64 encode. Das heißt nur Base64 encode.Das ist gar kein Base64 encode. Das ist Chibate.Okay, das ist das Highlight. Das ist echt nice. Base64 encode. Okay, also wir haben uns das jetzt angeguckt. Das sollte nichts Schlimmes machen. Wir führen das Ganze jetzt einfach mal aus und gucken, ob es überhaupt funktioniert.Wir gucken, ob es überhaupt funktioniert.Das bildet schon mal ganz schön lange. Ach fuck, ich kack Noob. Wenn man Exit macht, exited ja alles. Und nicht nur das eine Fenster. Ich hätte Exit-Window oder Close-Window oder so machen müssen.Big brain plays, Leute.Okay, auf geht's starten.Warum bildet das eigentlich so ewig?Wird jetzt der indische Keylogger ausgeführt oder was?Falsche Framework-Version, okay. Wollen wir das Settings umstellen?Ach, das ist noch.NET Core 3 Review. Aber trotzdem, man sollte doch mit.NET Core auch ohne Probleme ASP.NET Links 2 ausführen können. Wahrscheinlich braucht das Blazer Zeug, da ist doch kein Blazer dabei.Das ist jetzt 2er.Das ist jetzt das 2er.NET. Wir gucken, ob es damit funktioniert.Wow. Okay, ich glaube, ich muss nochmal neu starten. Das packt gerade rum.Damit müsste es jetzt aber funktionieren. Es läuft, okay.Also, hier ist es. Hier ist es. Username.Das verwende er doch nie, oder?Ich glaube, Username verwende er doch nie.Was muss ich denn wo eingeben? Channel? Okay. Channel? Wo Blots?Username? Keine Ahnung, Search.Ich sag doch, es funktioniert, oder? Was ist das?Funktioniert nicht. Username? So?Nope. Es geht nicht. Es ist kaputt.Oder muss ich hier Justin Fan irgendwie reinschreiben?Tatsächlich. Okay, das macht überhaupt nicht das, was ich haben wollte.Automatisch updaten tut es auch nicht, oder?Also, wirklich funktioniert tut das Ganze nicht. Nee, das funktioniert nicht.Es ist kaputt, was er in der programmiert hat.Aber Justin Fan ist rot, ja. Yeah.Wie war nochmal die Anforderungsbeschreibung dazu? Moment, kann ich dir zeigen?Ich hab sie mir danach ausführlich erklärt.Er hat sogar sich den Twitch-Chat angeguckt und festgestellt, dass ich dann...Alter, Piver, geh mal nicht auf den Sack.Good Programmer, nice communication.Auftrag, Requirements. Ja.Wine? Warum zum Teufel sollte ich jetzt in Wine öffnen wollen?Ich will das in Firefox aufmachen.Wine? Alter, warum startest du Wine, um den PDF zu öffnen?What the fuck?Lullen, Alter.Okay, kann aber einfach so. Warum macht er das nicht einfach im Browser auf?Jetzt macht er es im Browser auf. Big brain, next level, Wahnsinn.Das hab ich ihm geschrieben, ja.Also nicht Justin Fan.Wine ist quasi eine Windows-AP-Implementierung für Linux.Das hat er auch gemacht.Dann hab ich ihm gesagt, ich will nicht, dass das Ding einen AP-Key braucht.Das hab ich reingeschrieben, weil ich die Leute dazu bringen wollte festzustellen,ah ja, es gibt ja eine IRC-AP, aber da hätten sie mal selbst nachgucken müssen.Channel und Username sollte man einstellen können.Allerdings, wie gesagt, der Channel, den ich überwachen will und nicht Justin Fan.Ich lass mal laufen, vielleicht geht's ja nach, ups, vielleicht geht's ja jetzt nach einer Weile.Justin Fan.Funktioniert das überhaupt? Geht der überhaupt in den richtigen Channel rein?Was der da gebastelt hat, geht der überhaupt in den richtigen?Vor allem, warum ist das denn ein Controller?Das ergibt doch überhaupt keinen Sinn.Das funktioniert überhaupt nicht.Guck mal, das müsste eine Endlosschleife sein, die im Hintergrund läuft.Die hat erstens in dem Controller nichts zu suchen, der lockt sich einfach nur ein und...Alter, das ist ja noch weniger das, was ich haben wollte als...Oh man.So, ich hab gesagt, Chat-Messages sollen einen Neustart überstehen, machen sie nicht.Und ich hätte gerne einen Knopf, um Chat-Nachrichten zu löschen, der ist auch nicht da.Schluss, das Frontend soll sich selbst refreshen, wenn eine neue Nachricht ankommt.Und das soll Zeit und Datum anzeigen, wann sie gepostet werden. Fertig.Ich finde, die Beschreibung ist verständlich, oder?Und wenn nicht, kann man an zwei, drei Stellen nachfragen und man versteht es wieder.Oder, der hätte mich ein paar Sachen spezifisch nachfragen können und hätte das eigentlich verstehen müssen, oder?Ich finde, man kann das recht gut erkennen.Der hat jetzt echt den Wine geöffnet, ich fass es nicht.Ja, also...Es funktioniert nicht wirklich.Ich bin schon wieder auf dem Weg.Ich bin schon wieder auf dem Weg.Ich bin schon wieder auf dem Weg.Ich bin schon wieder auf dem Weg.Jetzt habt ihr das Fiverr Programm gesehen von dem Einzigen, der geantwortet hat.Also der Einzige, der eine Lösung erarbeitet hat.Wobei das keine wirkliche Lösung ist.Ach stimmt, da hat der Videos gestehtJa er hat das gleicheJa Fiverr ist jetzt gutEr hat mir ein Bild davon geschicktWas er machtMacht man das BildMacht man das Bild wieder zuCheckt die Fiverr Seite nichtWie viel habe ich ihm gegeben 36 Dollar36 Dollar immerhinOkay gucken wir uns mal das Video anAlter was geht mit der AufnahmeDas ist halt absolut nicht das was ich haben wollteWie macht man den Scheiß hier zu überhauptEscape geht nichtDas daVersuch mal WupplosSehr gute Big Prane IdeeBig PraneJustin Fan 1,2,3SoJa aber das kann nicht funktionierenEr macht ja gar keine HintergrundschleifeAlso er macht nichts im BackgroundUnd er macht es auch gleich wieder zuWas macht das Programm dannJa um ehrlich zu sein macht es nicht sonderlich viel von ihmDas einzige was es macht istEs meldet sich einmal im Twitch IRC Chat anKriegt die WillkommensmeldungUnd meldet sich und macht danach gleich wieder gleich wieder zuUnd es färbt lustigerweise auch nur Justin Fan 1,2,3,4,5 einOh Gott ist das FailWeil wenn ich mich Justin Fan 1,2,3,4,5 nenneDann funktioniert zumindest das Highlighten vom UsernameJede andere Justin Fan Geschichte geht nichtBewertet den mal entsprechendIch hab den schon bewertetIch hab reingeschrieben ganz toller ProgrammiererIch will denen mit meinem Zeug keineKeine irgendwieDa es irgendwie von Fiverr kicken oder soEs ist egal es war ein VersuchUnd mir war klarDass man für 5 Euro oder 7 Euro indische Programmierer jetzt nichtsWirklich richtig ausgereiftes erwarten kannDas Farben Splitted Baby hat auch nicht so funktioniertJaOkay alsoDas ist die Qualität von FiverrMan bestellt wasMan bestellt wasEiner gibt was ab was absolut nicht das tut was es tun soll11 sagen abUnd von diesen 10 sagen abUnd von diesen 10Achso wollen wir uns das aktuelle Profil von ihm nochmal anguckenUnd von diesen 10 wollten eigentlich auch über die Hälfte viel viel viel mehr GeldWir gucken mal was er jetzt machtWordPress Website und Bugfix WordPressEr hat ASP.NET Core rausgenommenOb ich mit für verantwortlich binDass er ASP.NET rausgenommen hatWar die Aufgabe so komplex oder unsichtigNeinWar sie nichtAlso Leute ihr habt ihr wart ja vielleicht ein paar in dem Stream dabei wo wir das zusammen programmiert habenDas gepaart mit meiner BeschreibungDa hätte man doch eigentlich wenn man halbwegs weiß was man machtEin bisschen weiter kommen müssen als so oderBin ich dazu anspruchsvollAber wir wollen jetzt hier nicht zu sehr flamenWeil er hat immerhin sich dran gewagtSo und die anderen canceltDen einen haben wir uns ja schon mal angegucktDie anderen lohnen sich gar nicht großartig anzuguckenDie haben das UI sieht hübsch aus das UI ist Standard Bootstrap aus dem ASP.NET Core TemplateWas passiert mit den restlichen 120 EuroIch weiß ich kann man die sich irgendwie wieder irgendwie wieder zurück überweisen lassen oder soOkay wir gucken malASMR ASMR Adult ASMR YouTubeWas habe ich da gesuchtWas habe ich da gesuchtMonka TossIch glaube ich habe gesucht ob es Leute gibt für denFür mein Meme BoardOb ich nicht ein paar Sprecher finde oder Sprecherinnen die Dinger sagen könnenIch habe gedacht das wäre wahrscheinlich ganz lustigAber da gibt es gibt es ja gibt es ist auf Fiverr kannst du kannst du alles kaufenAlso du hast da auch Leute die beispielsweise sagenI do cute Anime Girls Adult Voiceovers und sowasAlles dabeiJa klarDas lohnt sich nicht das jetzt anzuguckenDie haben alle abgesagt die haben alle abgesagt oder haben gesagt mehr GeldDas ist alles wirklich gecheckt hat es keinerKannst du mal nein das mache ich jetzt hier und stream garantiert nichtJa Leute so sah das mit Fiverr ausAlso ich gebe zuMein Programm ist jetzt nicht die optische Augenweide was ich hier gebastelt habeAber es funktioniert es funktioniert jetzt übrigens gerade nicht weil ich es ausgemacht habeAber es funktioniertEinfacher Weg um in Chrome die IP zu verschleiernVPNKannst auch eine komischen China Proxy oder so nehmen aber VPN ist das besteOh I'm not trolling Fiverr'sThey want more moneyThey advertised service for5 to 15 euros and 1700Bangladesh hat bessere loading timeNa ja gut so sah es ausSo sah es aus mit FiverrWar es eigentlichDeswegen habe ich da auch deswegen habe ich da auch noch kein Video zugemachtWeil was was soll ich da groß im Video zu erzählenHast du Bock dir das Github von der NSA anzuguckenWeil die NSA hat ein GithubGibt es auf Fiverr keine Programmierpros doch doch auf jeden FallAuf jeden Fall und es gäbe auch garantiert auf FiverrGenug die das machen könntenAber ich wollte halt absichtlich welche probieren die explizit sagenWir für für 5 bis 15 Euro machen wir dasDer BND hat auch eine Github jaDie haben auf Github haben die so eine Reverse Engineer Challenge mal gehabtJa LeuteGibt es noch irgendwas was wir machen könnenIch glaube ich log jetzt um und spiele eine RundeIch wollte gerade sagen Overwatch mache ich nichtEine Runde Borderlands weiterIch muss sagen das Borderlands Endgame ist gar nicht mal so übelDa kann er ganz schön noch ein bisschen vor sich hin brindenOmas Märchenstunde live die Marmeladenoma ist onlineKönnten wir hostenDie habe ich mir irgendwann abonniert als das bei Kronk gezeigt wurdeDa habe ich mir gedacht sowas muss man eigentlich unterstützenOverwatch ja ich habe die Role Queue mal ausprobierenIch habe mich nach den ersten zwei Games schon wieder so aufgeregtDass ich direkt rage quitted binIch glaube ich habe es auch gar nicht mehr installiertBorderlands ist ein Entspannungs Game für michIch log jetzt um wir sehen uns morgen frühSonntag früh ist immer Aufwach StreamFalls der ein oder andere noch nicht weiß wohin mit seinem Twitch Prime SubIhr wisst ja und Big IQ haben wollt dann seid ihr hier richtigUnd wie gesagt spätestens morgen früh sehen wir unsIch werde dann nachmittags mal gucken dass ich den restlichen Krams hier vom Hardware Rad tueWas ich da heute zwei Stunden zusammen geklotzt habeWelche Uhrzeit immer so von zwischen neun und zehn so in dem Dreh geht es immer los oderManchmal auch nach zehn aber von neun bis zehn Uhr dreißig in dem Dreh geht es immer losUnd dann so bis 13 Uhr wir haben glaube ich sogar schon bis 14 14 30 oder soIch spiele jetzt kein Overwatch ganz bestimmt nicht ganz bestimmt nichtDu kannst mir das mal schicken wir können das mal ausprobierenAber jetzt nicht on Stream jetzt ich log jetzt um und spiele ein bisschen Borderlands oder irgendwas oder gucke irgendwas bei AmazonMax DPS tot zumindest OverwatchIch hab das ja eigentlich den Channel damals nur gemacht weil ich halt Bock hatteOverwatch sehr Overwatch spezifische Videos zu machenUnd das Problem war dann nur dass mir Overwatch eine Woche nachdem ich den Channel aufgemacht habeKeinen Bock mehr hatte keinen Bock mehr gemacht hatNächste Woche schon MW ja ja glaube schon nächste Woche Freitag glaube ichOkay Leute also bis denn macht's gut", "segments": [{"id": 1, "start": 60.0, "end": 62.0, "text": "Just, just, just paint it."}, {"id": 2, "start": 62.0, "end": 64.0, "text": "Just, just, just paint it."}, {"id": 3, "start": 64.0, "end": 66.0, "text": "Just, just, just paint it."}, {"id": 4, "start": 72.0, "end": 74.0, "text": "Almost heaven."}, {"id": 5, "start": 76.0, "end": 78.0, "text": "Older Twitch chat."}, {"id": 6, "start": 78.0, "end": 80.0, "text": "All these emotes."}, {"id": 7, "start": 80.0, "end": 84.0, "text": "Wondering how to spell that."}, {"id": 8, "start": 86.0, "end": 88.0, "text": "Now we're older."}, {"id": 9, "start": 88.0, "end": 90.0, "text": "Everyone's moved on."}, {"id": 10, "start": 90.0, "end": 93.0, "text": "But I remember Twitch chat."}, {"id": 11, "start": 93.0, "end": 95.0, "text": "From those days that are gone."}, {"id": 12, "start": 95.0, "end": 98.0, "text": "Twitch emotes."}, {"id": 13, "start": 98.0, "end": 101.0, "text": "From long ago."}, {"id": 14, "start": 101.0, "end": 104.0, "text": "Made you feel."}, {"id": 15, "start": 104.0, "end": 107.0, "text": "You're not alone."}, {"id": 16, "start": 107.0, "end": 110.0, "text": "Cappapog jam."}, {"id": 17, "start": 110.0, "end": 113.0, "text": "Keep a forehead."}, {"id": 18, "start": 113.0, "end": 116.0, "text": "Bible thumb."}, {"id": 19, "start": 116.0, "end": 120.0, "text": "Twitch emotes."}, {"id": 20, "start": 120.0, "end": 123.0, "text": "I remember."}, {"id": 21, "start": 123.0, "end": 126.0, "text": "Typing dance game."}, {"id": 22, "start": 126.0, "end": 128.0, "text": "Forehead swift rage."}, {"id": 23, "start": 128.0, "end": 133.0, "text": "PJ salt and fail fish."}, {"id": 24, "start": 133.0, "end": 135.0, "text": "Life was easy."}, {"id": 25, "start": 135.0, "end": 138.0, "text": "Spamming all the time."}, {"id": 26, "start": 138.0, "end": 141.0, "text": "TOS was nowhere."}, {"id": 27, "start": 141.0, "end": 143.0, "text": "So everyone's feeling fine."}, {"id": 28, "start": 143.0, "end": 146.0, "text": "Twitch emotes."}, {"id": 29, "start": 146.0, "end": 149.0, "text": "From long ago."}, {"id": 30, "start": 149.0, "end": 152.0, "text": "Made you feel."}, {"id": 31, "start": 152.0, "end": 155.0, "text": "You're not alone."}, {"id": 32, "start": 155.0, "end": 158.0, "text": "Cappapog jam."}, {"id": 33, "start": 158.0, "end": 161.0, "text": "Keep a forehead."}, {"id": 34, "start": 161.0, "end": 164.0, "text": "Bible thumb."}, {"id": 35, "start": 164.0, "end": 167.0, "text": "Twitch emotes."}, {"id": 36, "start": 167.0, "end": 170.0, "text": "Still hear his bark."}, {"id": 37, "start": 170.0, "end": 173.0, "text": "From the morning hour he calls me."}, {"id": 38, "start": 173.0, "end": 176.0, "text": "This doggy emote reminds me."}, {"id": 39, "start": 176.0, "end": 179.0, "text": "Of a time far away."}, {"id": 40, "start": 179.0, "end": 182.0, "text": "Looking at a chat I get a feeling."}, {"id": 41, "start": 182.0, "end": 186.0, "text": "That I miss emotes from yesterday."}, {"id": 42, "start": 186.0, "end": 189.0, "text": "Yesterday."}, {"id": 43, "start": 189.0, "end": 192.0, "text": "Twitch emotes."}, {"id": 44, "start": 192.0, "end": 195.0, "text": "From long ago."}, {"id": 45, "start": 195.0, "end": 198.0, "text": "Made you feel."}, {"id": 46, "start": 198.0, "end": 201.0, "text": "You're not alone."}, {"id": 47, "start": 201.0, "end": 204.0, "text": "Cappapog jam."}, {"id": 48, "start": 204.0, "end": 207.0, "text": "Cappapog."}, {"id": 49, "start": 207.0, "end": 210.0, "text": "Bible thumb."}, {"id": 50, "start": 210.0, "end": 213.0, "text": "Twitch emotes."}, {"id": 51, "start": 213.0, "end": 216.0, "text": "Keep a forehead."}, {"id": 52, "start": 216.0, "end": 219.0, "text": "Twitch emotes."}, {"id": 53, "start": 219.0, "end": 222.0, "text": "Bible thumb."}, {"id": 54, "start": 222.0, "end": 225.0, "text": "Twitch emotes."}, {"id": 55, "start": 225.0, "end": 228.0, "text": "So."}, {"id": 56, "start": 228.0, "end": 231.0, "text": "Auf geht's."}, {"id": 57, "start": 231.0, "end": 234.0, "text": "Bashen, alter, bashen."}, {"id": 58, "start": 234.0, "end": 237.0, "text": "Ihr müsst mal gucken, ob ich irgendwie rumspacke, was den Sound angeht."}, {"id": 59, "start": 237.0, "end": 240.0, "text": "Weil ich hab letztens meine Streams angehört."}, {"id": 60, "start": 240.0, "end": 243.0, "text": "Und hab festgestellt, dass ich manchmal, wenn was ist, dass ich bisschen übersteuere."}, {"id": 61, "start": 246.0, "end": 249.0, "text": "Und deswegen hab ich jetzt mal ein Compressor eingeschaltet."}, {"id": 62, "start": 249.0, "end": 252.0, "text": "Also sprich, egal, ich kann jetzt hier voll reinschreien oder so."}, {"id": 63, "start": 252.0, "end": 255.0, "text": "Und es wird nicht lauter."}, {"id": 64, "start": 255.0, "end": 258.0, "text": "Also."}, {"id": 65, "start": 258.0, "end": 261.0, "text": "Nur bis zu einem gewissen Punkt."}, {"id": 66, "start": 261.0, "end": 264.0, "text": "Auf der anderen Seite sollte man..."}, {"id": 67, "start": 264.0, "end": 267.0, "text": "Ja, keine Ahnung."}, {"id": 68, "start": 267.0, "end": 270.0, "text": "Ich hab übrigens keine Ahnung, was ich da eingestellt hab."}, {"id": 69, "start": 270.0, "end": 273.0, "text": "Mir gibt das Sinn, was ich da eingestellt hab."}, {"id": 70, "start": 273.0, "end": 276.0, "text": "Ich hab da keinen Plassen Schimmer von Audiozeug."}, {"id": 71, "start": 276.0, "end": 279.0, "text": "Ich hab das aus irgendeinem Forenbeitrag oder so."}, {"id": 72, "start": 279.0, "end": 282.0, "text": "Ja."}, {"id": 73, "start": 282.0, "end": 285.0, "text": "Keine Ahnung."}, {"id": 74, "start": 285.0, "end": 288.0, "text": "Hublull."}, {"id": 75, "start": 288.0, "end": 291.0, "text": "Also keine Ahnung, was das macht."}, {"id": 76, "start": 294.0, "end": 297.0, "text": "Der älteste Stream ist vor zwei Monaten."}, {"id": 77, "start": 297.0, "end": 300.0, "text": "Ne."}, {"id": 78, "start": 300.0, "end": 303.0, "text": "Wir haben, im Archiv haben wir alle Streams..."}, {"id": 79, "start": 303.0, "end": 306.0, "text": "Ich hab hier doch grad den Chat gepostet."}, {"id": 80, "start": 306.0, "end": 309.0, "text": "Im Archiv haben wir alle Streams."}, {"id": 81, "start": 309.0, "end": 312.0, "text": "Bis 2000."}, {"id": 82, "start": 312.0, "end": 315.0, "text": "Bis irgendwie Ende 2007 oder so."}, {"id": 83, "start": 324.0, "end": 327.0, "text": "Guck."}, {"id": 84, "start": 327.0, "end": 330.0, "text": "Guck."}, {"id": 85, "start": 330.0, "end": 333.0, "text": "Wubblords.tv."}, {"id": 86, "start": 333.0, "end": 336.0, "text": "Da."}, {"id": 87, "start": 336.0, "end": 339.0, "text": "Wir gehst jetzt auf Archiv."}, {"id": 88, "start": 339.0, "end": 342.0, "text": "Oder wie die coolen Leute natürlich sagen würden, Archive."}, {"id": 89, "start": 342.0, "end": 345.0, "text": "Archiv sagt ja keiner mehr. Ist ja Archive."}, {"id": 90, "start": 345.0, "end": 348.0, "text": "Und dann kannst du dir alles angucken."}, {"id": 91, "start": 350.0, "end": 353.0, "text": "Von 2007."}, {"id": 92, "start": 353.0, "end": 356.0, "text": "September 2007."}, {"id": 93, "start": 356.0, "end": 359.0, "text": "2007."}, {"id": 94, "start": 359.0, "end": 362.0, "text": "Siehst du, dass ich da sogar mal ein bisschen Overwatch gespielt hab."}, {"id": 95, "start": 362.0, "end": 365.0, "text": "Und KS, ich hab Overwatch gespielt."}, {"id": 96, "start": 365.0, "end": 368.0, "text": "Vier Stunden."}, {"id": 97, "start": 368.0, "end": 371.0, "text": "Ich hab allen Ernstes vier Stunden Overwatch gespielt, das kann ich mir gar nicht vorstellen."}, {"id": 98, "start": 371.0, "end": 374.0, "text": "Wie hab ich das denn ausgehalten?"}, {"id": 99, "start": 376.0, "end": 379.0, "text": "Wie hab ich das ausgehalten?"}, {"id": 100, "start": 379.0, "end": 383.0, "text": "Das versteh ich nicht, ja."}, {"id": 101, "start": 388.0, "end": 391.0, "text": "Ja, na gut."}, {"id": 102, "start": 391.0, "end": 394.0, "text": "In Ordnung, na."}, {"id": 103, "start": 394.0, "end": 397.0, "text": "Sag mal, kann das sein, dass der Kompressor komische Dinger macht?"}, {"id": 104, "start": 397.0, "end": 400.0, "text": "Also sprich, wenn ich ne gewisse Zeit laut rede."}, {"id": 105, "start": 400.0, "end": 403.0, "text": "Bla, bla, bla, bla, bla, bla, bla, bla, bla, bla."}, {"id": 106, "start": 403.0, "end": 406.0, "text": "Ne, ist kein Unterschied. Erinnert sich nix."}, {"id": 107, "start": 406.0, "end": 409.0, "text": "Also, die Sache ist halt die, wenn ich das ausschalte, übersteuer ich manchmal."}, {"id": 108, "start": 409.0, "end": 412.0, "text": "Und das sackt. Guck, ich zeig's euch mal."}, {"id": 109, "start": 412.0, "end": 415.0, "text": "Ich das ausschalte und ich mach jetzt."}, {"id": 110, "start": 416.0, "end": 419.0, "text": "Oder ich huste oder so."}, {"id": 111, "start": 419.0, "end": 422.0, "text": "Verrecken. Dann übersteuer das Ganze."}, {"id": 112, "start": 422.0, "end": 425.0, "text": "Und es sackt. Auf der anderen Seite."}, {"id": 113, "start": 425.0, "end": 428.0, "text": "Eigentlich kann ich noch so laut rumschreien, wie ich will und übersteuer nicht."}, {"id": 114, "start": 428.0, "end": 436.0, "text": "Eigentlich könnte ich den Kompressor auch auslassen."}, {"id": 115, "start": 436.0, "end": 441.0, "text": "Na gut, dann lass ich den Kompressor mal aus, ist wurscht."}, {"id": 116, "start": 441.0, "end": 444.0, "text": "So, also Leute."}, {"id": 117, "start": 444.0, "end": 447.0, "text": "Ich hab da was gefunden. Ich zeig euch mal was."}, {"id": 118, "start": 447.0, "end": 452.0, "text": "Aber jetzt muss ich erstmal gucken, weil im Chat gibt's Questions."}, {"id": 119, "start": 452.0, "end": 456.0, "text": "Erstmal haben wir irgendwie nen Sub gehabt, den hab ich übersehen. Kann das sein?"}, {"id": 120, "start": 456.0, "end": 459.0, "text": "Und zwar."}, {"id": 121, "start": 459.0, "end": 462.0, "text": "Vier Monate am Stück."}, {"id": 122, "start": 462.0, "end": 465.0, "text": "Das ist absolut high IQ."}, {"id": 123, "start": 465.0, "end": 468.0, "text": "Höher geht's immer."}, {"id": 124, "start": 468.0, "end": 471.0, "text": "Aber das ist schon ziemlich big brain."}, {"id": 125, "start": 471.0, "end": 474.0, "text": "Das ist nice. Subscriber."}, {"id": 126, "start": 474.0, "end": 477.0, "text": "Ich finde meine Sounds nicht, weil ich mein Fenster resized hab."}, {"id": 127, "start": 477.0, "end": 487.0, "text": "Big brain Subscriber."}, {"id": 128, "start": 487.0, "end": 490.0, "text": "KappaRot fragt."}, {"id": 129, "start": 490.0, "end": 493.0, "text": "Moin Max. Habe da mal eine Frage."}, {"id": 130, "start": 493.0, "end": 501.0, "text": "Warum fahren aktuell alle so auf VS Code ab und nicht mehr auf eine normale IDE wie Visual Studio?"}, {"id": 131, "start": 501.0, "end": 504.0, "text": "Das kann man so glaube ich gar nicht sagen."}, {"id": 132, "start": 504.0, "end": 509.0, "text": "Wer auf Visual Studio Code total abfährt, sind die ganzen Frontend Jungs und Mädels."}, {"id": 133, "start": 509.0, "end": 512.0, "text": "Die finden das geil."}, {"id": 134, "start": 512.0, "end": 518.0, "text": "Weil für JavaScript plus 30 Milliarden JavaScript Frameworks, die es gibt."}, {"id": 135, "start": 518.0, "end": 522.0, "text": "Und CSS, HTML und so ist Visual Studio Code nicht schlecht."}, {"id": 136, "start": 522.0, "end": 525.0, "text": "Als 0x15 Standard Editor ist das auch ganz gut."}, {"id": 137, "start": 525.0, "end": 528.0, "text": "Aber für Sachen wie Java oder Alter."}, {"id": 138, "start": 528.0, "end": 531.0, "text": "Hab ich tatsächlich gesagt, ich glaub's nicht."}, {"id": 139, "start": 531.0, "end": 534.0, "text": "Wobei Go geht auch noch ganz gut drin."}, {"id": 140, "start": 534.0, "end": 536.0, "text": "Oder C Sharp oder so."}, {"id": 141, "start": 536.0, "end": 539.0, "text": "Da ist eine richtige IDE schon nicht verkehrt."}, {"id": 142, "start": 539.0, "end": 541.0, "text": "Da kackt auch Visual Studio relativ schnell."}, {"id": 143, "start": 541.0, "end": 545.0, "text": "Also nicht ab, aber gerät mal schnell an die Grenzen dessen, was da schon drin ist."}, {"id": 144, "start": 545.0, "end": 547.0, "text": "Ich denke mal Visual Studio könnte das auch ganz gut."}, {"id": 145, "start": 547.0, "end": 551.0, "text": "Aber die Sachen sind einfach nicht auf dem Stand, wie es bei irgendwelchen ordentlichen IDEs sind."}, {"id": 146, "start": 551.0, "end": 553.0, "text": "Das heißt eigentlich braucht man beides."}, {"id": 147, "start": 553.0, "end": 559.0, "text": "Ich hab aktuell für mein C Sharp Zeug hab ich Visual Studio und für Frontend Zeug hab ich Visual Studio Code."}, {"id": 148, "start": 559.0, "end": 564.0, "text": "Und als wir in letzter Zeit haben wir öfters auch mal Web-Anwendungen gebastelt."}, {"id": 149, "start": 564.0, "end": 570.0, "text": "Und da haben wir ja beides verwendet."}, {"id": 150, "start": 570.0, "end": 574.0, "text": "So, nutzt du Proxmox? Das läuft da so alles."}, {"id": 151, "start": 574.0, "end": 577.0, "text": "Nee, mach ich nicht."}, {"id": 152, "start": 577.0, "end": 582.0, "text": "Ich hab zwar mal einen Stream gemacht, wo ich die neue Proxmox-Version angeguckt hab, aber benutze ich nicht."}, {"id": 153, "start": 582.0, "end": 590.0, "text": "Ach ja, und die Sache, warum Leute auf Visual Studio Code zu abgehen, ist glaube ich relativ einfach zu beantworten."}, {"id": 154, "start": 590.0, "end": 599.0, "text": "Und zwar, mal kurz das GitHub-Projekt raussuchen."}, {"id": 155, "start": 599.0, "end": 605.0, "text": "Weil Projekte mit einer gewissen Verbreitung automatisch neue Leute anziehen."}, {"id": 156, "start": 605.0, "end": 608.0, "text": "Ich will nicht sagen, dass Visual Studio Code ein schlechter Editor ist oder so."}, {"id": 157, "start": 608.0, "end": 612.0, "text": "Von diesen ganzen JavaScript-Basierten ist er eigentlich der beste."}, {"id": 158, "start": 612.0, "end": 617.0, "text": "Er hat auch für Gott und die Welt irgendwelche Plugins."}, {"id": 159, "start": 617.0, "end": 624.0, "text": "Und es gibt eigentlich auch nicht mehr wirklich so eine Alternative."}, {"id": 160, "start": 624.0, "end": 628.0, "text": "Wenn man auf der Kommandozeile editieren will, würde ich ganz klar Vim nehmen, sonst nichts."}, {"id": 161, "start": 628.0, "end": 634.0, "text": "Aber da drin würde ich jetzt auch nicht irgendwelche größeren Sachen mehr basteln."}, {"id": 162, "start": 634.0, "end": 643.0, "text": "Vor einer Weile, vor so ein paar Jahren, war das voll angesagt, dass die ganzen Leute versucht haben, irgendwie in Vim aufzubohren,"}, {"id": 163, "start": 643.0, "end": 648.0, "text": "auf IDE-Funktionen, aber das hat auch nicht richtig gut funktioniert."}, {"id": 164, "start": 648.0, "end": 654.0, "text": "Das geht mit Visual Studio Code und einer ordentlichen Plugins-Schnittstelle natürlich eine ganze Ecke besser."}, {"id": 165, "start": 654.0, "end": 660.0, "text": "Und große Projekte ziehen einfach immer mehr Leute an."}, {"id": 166, "start": 660.0, "end": 664.0, "text": "Also das passt und dazu ist das Ganze ganz gut."}, {"id": 167, "start": 664.0, "end": 667.0, "text": "Dazu kommt, dass die anderen Sachen halt ein bisschen schwächeln."}, {"id": 168, "start": 667.0, "end": 670.0, "text": "Was gibt es denn für ernsthafte Alternativen?"}, {"id": 169, "start": 670.0, "end": 674.0, "text": "Früher, würde ich noch sagen, Emacs hatte auch sau viele Plugins."}, {"id": 170, "start": 674.0, "end": 680.0, "text": "Aber Emacs ist sowohl von der Entwicklung her als auch von den Plugins und der Plugin-Entwicklung her,"}, {"id": 171, "start": 680.0, "end": 689.0, "text": "bzw. diese Extensions, diese Lisp."}, {"id": 172, "start": 689.0, "end": 691.0, "text": "Genau, ich wollte gerade sagen Link, aber Link ist ja verkehrt."}, {"id": 173, "start": 691.0, "end": 694.0, "text": "Diese Lisp-Backstage ist auch eklig zu schreiben."}, {"id": 174, "start": 694.0, "end": 696.0, "text": "Gibt es nicht wirklich viel Erfolg."}, {"id": 175, "start": 696.0, "end": 701.0, "text": "Emacs hat ein paar coole Sachen, die es so in nichts anderem gibt, wie OrgMode zum Beispiel,"}, {"id": 176, "start": 701.0, "end": 704.0, "text": "aber das interessiert nicht mehr so viele Leute."}, {"id": 177, "start": 704.0, "end": 710.0, "text": "Ich muss euch übrigens gleich nochmal was richtig Cooles zeigen, was ich gefunden habe."}, {"id": 178, "start": 710.0, "end": 713.0, "text": "Ja, deswegen ist Visual Studio Code so beliebt."}, {"id": 179, "start": 713.0, "end": 720.0, "text": "Wir wollen Pfeifer, ja, mach ich, mach ich, mach ich doch an."}, {"id": 180, "start": 720.0, "end": 723.0, "text": "Der Milchmann hat abonniert."}, {"id": 181, "start": 723.0, "end": 728.0, "text": "Subscriber, vier Monate."}, {"id": 182, "start": 728.0, "end": 729.0, "text": "Huge."}, {"id": 183, "start": 729.0, "end": 731.0, "text": "Bist du nicht sogar Gründer?"}, {"id": 184, "start": 731.0, "end": 733.0, "text": "Doch, du bist Gründer."}, {"id": 185, "start": 733.0, "end": 734.0, "text": "Alter, huge."}, {"id": 186, "start": 734.0, "end": 737.0, "text": "Das ist hier, da reicht schon das Prell nicht mehr für."}, {"id": 187, "start": 737.0, "end": 741.0, "text": "Das ist schon, das platzt schon."}, {"id": 188, "start": 741.0, "end": 743.0, "text": "Vierter Monat in Folge, Dankeschön."}, {"id": 189, "start": 743.0, "end": 746.0, "text": "Nice."}, {"id": 190, "start": 746.0, "end": 756.0, "text": "IQ auch nochmal erhöhen, so ist das richtig."}, {"id": 191, "start": 756.0, "end": 757.0, "text": "Blatter Dart."}, {"id": 192, "start": 757.0, "end": 768.0, "text": "Ja, ich hab letztens, ich hab letztens ein bisschen rumgebastelt mit, ähm, damit."}, {"id": 193, "start": 768.0, "end": 774.0, "text": "Da kann man jetzt experimentell Desktop-Programme erstellen mit Flutter."}, {"id": 194, "start": 774.0, "end": 780.0, "text": "Das ist eigentlich ziemlich cool, aber ich glaube, das dauert noch ein bisschen, bis das spruchreif ist,"}, {"id": 195, "start": 780.0, "end": 783.0, "text": "weil du hast beispielsweise kein Webview."}, {"id": 196, "start": 783.0, "end": 788.0, "text": "Was kannst du mit nem GUI-Framework anfangen heutzutage, wo kein Webview drin ist?"}, {"id": 197, "start": 788.0, "end": 794.0, "text": "Jede Anwendung braucht früher oder später mal ein bisschen HTML und Browserzeug, was sie anzeigt"}, {"id": 198, "start": 794.0, "end": 798.0, "text": "und sei es nur, um sich irgendwo anzumelden oder so."}, {"id": 199, "start": 798.0, "end": 805.0, "text": "Also, ein GUI-Framework, was absolut gar kein Webview unterstützt, ist schwierig zu verwenden."}, {"id": 200, "start": 805.0, "end": 808.0, "text": "Auch kann man beispielsweise keinen 3D-Content einbinden, falls man,"}, {"id": 201, "start": 808.0, "end": 812.0, "text": "oder generell 3D-beschleunigten, Grafikkarten-beschleunigten Content."}, {"id": 202, "start": 812.0, "end": 822.0, "text": "Das braucht, das muss noch ein bisschen reifen, aber an sich ist echt cool."}, {"id": 203, "start": 822.0, "end": 826.0, "text": "Oh, ich wurde gehorstet, danke schön."}, {"id": 204, "start": 826.0, "end": 839.0, "text": "Huge, huge shows."}, {"id": 205, "start": 839.0, "end": 842.0, "text": "Atom, nee Atom ist eklig."}, {"id": 206, "start": 842.0, "end": 844.0, "text": "Atom gefällt mir überhaupt nicht."}, {"id": 207, "start": 844.0, "end": 848.0, "text": "Also, das letzte Mal, wo ich mich mit Atom auseinandergesetzt hab, ganz am Anfang,"}, {"id": 208, "start": 848.0, "end": 852.0, "text": "ich hab den ja verwendet, wo er ganz neu war, der hier,"}, {"id": 209, "start": 852.0, "end": 858.0, "text": "da konnte er keine Dateien öffnen, die größer als, oder keine Dateien speichern oder öffnen,"}, {"id": 210, "start": 858.0, "end": 860.0, "text": "die größer als 1MB waren."}, {"id": 211, "start": 860.0, "end": 864.0, "text": "Ich mein, das kommt zwar relativ selten vor, aber ich mein, für einen Standard-Editor ist das nichts."}, {"id": 212, "start": 864.0, "end": 868.0, "text": "Außerdem war Atom deutlich langsamer als VS Code, wobei man halt sagen muss,"}, {"id": 213, "start": 868.0, "end": 873.0, "text": "dass der Untersatz zwischen VS Code und Atom ja eigentlich der gleiche ist."}, {"id": 214, "start": 873.0, "end": 885.0, "text": "Ja, okay, Visual Studio Code für C++, weiß ich ehrlich gesagt nicht, wie gut das ist."}, {"id": 215, "start": 885.0, "end": 887.0, "text": "Wahrscheinlich, wahrscheinlich nicht so tolle."}, {"id": 216, "start": 887.0, "end": 894.0, "text": "Was für einen Mikrotik-Router hast du und nutzt du auch einen Switch von denen?"}, {"id": 217, "start": 894.0, "end": 895.0, "text": "Ja, beides."}, {"id": 218, "start": 895.0, "end": 897.0, "text": "Könntest du eine Home-Lab-Tour machen?"}, {"id": 219, "start": 897.0, "end": 899.0, "text": "Ja, aber erst, wenn ich aufgeräumt hab."}, {"id": 220, "start": 899.0, "end": 904.0, "text": "Also, als Switch hab ich den hier."}, {"id": 221, "start": 904.0, "end": 907.0, "text": "Ach, Quatsch."}, {"id": 222, "start": 907.0, "end": 909.0, "text": "Ich hab keinen Mikrotik-Switch."}, {"id": 223, "start": 909.0, "end": 912.0, "text": "Ich hab einen Ubiquiti-Switch, den da."}, {"id": 224, "start": 912.0, "end": 919.0, "text": "Und einen Router hab ich, den da."}, {"id": 225, "start": 919.0, "end": 921.0, "text": "Den Router, den da."}, {"id": 226, "start": 921.0, "end": 923.0, "text": "Und als Switch hab ich den da."}, {"id": 227, "start": 923.0, "end": 930.0, "text": "Das sind zwölf 10-Gigabit-Ports Glasfaser und vier 10-Gigabit-Ports Kupfer."}, {"id": 228, "start": 930.0, "end": 941.0, "text": "Weil, weil mehr Geld."}, {"id": 229, "start": 941.0, "end": 943.0, "text": "Studentens abgeben, ja, macht ja nichts."}, {"id": 230, "start": 943.0, "end": 948.0, "text": "Mit welcher Programmiersprache hast du damals angefangen?"}, {"id": 231, "start": 948.0, "end": 952.0, "text": "Also, ich glaube, den allerersten Kontakt hatte ich auch wie viele mit C."}, {"id": 232, "start": 952.0, "end": 956.0, "text": "Aber, ähm, da hat mich das überhaupt nicht interessiert."}, {"id": 233, "start": 956.0, "end": 964.0, "text": "Wobei ich wieder meinen üblichen Punkt ansprechen muss, dass ich denke, dass C eine scheiß Einstiegssprache ist."}, {"id": 234, "start": 964.0, "end": 966.0, "text": "Iokun, vier Monate."}, {"id": 235, "start": 966.0, "end": 969.0, "text": "Auch hier, Gründer, vier Monats-Abo."}, {"id": 236, "start": 969.0, "end": 988.0, "text": "Der Chat-IQ steigt jetzt unermesslich, ey."}, {"id": 237, "start": 988.0, "end": 992.0, "text": "Das Tastatur-Layout ist nicht auf Englisch, das Tastatur-Layout ist auf Deutsch."}, {"id": 238, "start": 992.0, "end": 994.0, "text": "Aber die Sprache ist auf Englisch."}, {"id": 239, "start": 994.0, "end": 997.0, "text": "Und die Sprache hab ich bei allem auf Englisch."}, {"id": 240, "start": 997.0, "end": 1001.0, "text": "Erstens, weil ich weiß, dass die englische Sprachausgabe besser manchmal spielen."}, {"id": 241, "start": 1001.0, "end": 1004.0, "text": "Aber, ähm, Software hab ich, wenn's geht, auf Englisch."}, {"id": 242, "start": 1004.0, "end": 1007.0, "text": "Weil, wenn es mal irgendwas gibt, was nicht funktioniert oder was ich wissen muss,"}, {"id": 243, "start": 1007.0, "end": 1012.0, "text": "es ist viel, viel, viel einfacher, was auf Englisch zu suchen zu einem Programm und was zu finden,"}, {"id": 244, "start": 1012.0, "end": 1022.0, "text": "als mit irgendwelchen deutschen Menüs und deutschen Fehlermeldungen da Suchmaschinen zu füttern."}, {"id": 245, "start": 1022.0, "end": 1023.0, "text": "Java-Programmieren."}, {"id": 246, "start": 1023.0, "end": 1028.0, "text": "Ja, ja, komm, da musst du jetzt einmal durch, wenn gut ist."}, {"id": 247, "start": 1028.0, "end": 1030.0, "text": "So, Blimetext ist auch nice."}, {"id": 248, "start": 1030.0, "end": 1032.0, "text": "Das hab ich früher öfters verwendet."}, {"id": 249, "start": 1032.0, "end": 1035.0, "text": "Wobei ich ja früher der Hardcore-WIM und EMAX-Benutzer war."}, {"id": 250, "start": 1035.0, "end": 1040.0, "text": "Man kann auch beides verwenden, ist überhaupt kein Problem, ja."}, {"id": 251, "start": 1040.0, "end": 1048.0, "text": "Standard-Text in die Topf von Windows, ja. Ist klar."}, {"id": 252, "start": 1048.0, "end": 1053.0, "text": "Die Fairness-Atom fühlt sich deutlich weniger responsive an als VS Code,"}, {"id": 253, "start": 1053.0, "end": 1055.0, "text": "als ich das letzte Mal verwendet hab."}, {"id": 254, "start": 1055.0, "end": 1060.0, "text": "Ich hab das aber auch schon wieder zwei Jahre her."}, {"id": 255, "start": 1060.0, "end": 1066.0, "text": "Ja, nur mobile ist Flutter super."}, {"id": 256, "start": 1066.0, "end": 1069.0, "text": "Ohne den Chat grad überhaupt nicht her hinterher."}, {"id": 257, "start": 1069.0, "end": 1074.0, "text": "Muss euch gleich noch mal was richtig Nices zeigen an Software, was ich gefunden hab."}, {"id": 258, "start": 1074.0, "end": 1077.0, "text": "Hab ich vor einer Weile schon ein paar Mal ausprobiert, aber fand ich nie so gut."}, {"id": 259, "start": 1077.0, "end": 1080.0, "text": "Aber seit den letzten paar Versionen ist das richtig gut geworden."}, {"id": 260, "start": 1080.0, "end": 1084.0, "text": "Aber erst mal muss ich gucken, ob ich Chat alles jetzt gelesen hab."}, {"id": 261, "start": 1084.0, "end": 1090.0, "text": "Ja, und zwar, ich hab euch ja schon öfters erzählt, dass ich, wir basteln gleich weiter,"}, {"id": 262, "start": 1090.0, "end": 1096.0, "text": "dass ich auf der Suche bin nach einem ordentlichen Notiz-Programm und To-Do-Programm"}, {"id": 263, "start": 1096.0, "end": 1101.0, "text": "und Notification-Programm, was auf allen Plattformen funktioniert."}, {"id": 264, "start": 1101.0, "end": 1111.0, "text": "Und was nicht Outlook ist, irgendwas Einfaches, was sich auch ordentlich bedienen lässt,"}, {"id": 265, "start": 1111.0, "end": 1116.0, "text": "weil Outlook lässt sich nicht ordentlich bedienen."}, {"id": 266, "start": 1116.0, "end": 1120.0, "text": "Zumindest To-Do's und so, wenn ich das übelste Zittellos das Fenster rumgeklicke."}, {"id": 267, "start": 1120.0, "end": 1126.0, "text": "Und ich habe die ganze Zeit halt gesucht, weil ich Nextcloud verwende."}, {"id": 268, "start": 1126.0, "end": 1128.0, "text": "Nee, nee, ich will das selbst gehostet haben."}, {"id": 269, "start": 1128.0, "end": 1132.0, "text": "Selbst gehostet, selbst gehostet, das ist ja das Wichtigste."}, {"id": 270, "start": 1132.0, "end": 1136.0, "text": "Wenn es nicht selbst gehostet werden muss, gibt es 30 Millionen Sachen."}, {"id": 271, "start": 1136.0, "end": 1139.0, "text": "So, und ich hab gedacht, okay, ich verwende einfach Nextcloud."}, {"id": 272, "start": 1139.0, "end": 1142.0, "text": "Nee, ich schwachsinn, ich verwende ja eh schon Nextcloud."}, {"id": 273, "start": 1142.0, "end": 1148.0, "text": "Also habe ich die ganze Zeit was gesucht, was Caldav To-Do's unterstützt."}, {"id": 274, "start": 1148.0, "end": 1150.0, "text": "Und Caldav Kalender und Tasks und so."}, {"id": 275, "start": 1150.0, "end": 1153.0, "text": "Das ist auch auf Mobile kaum ein Problem."}, {"id": 276, "start": 1153.0, "end": 1157.0, "text": "IOS unterstützt das alles, wobei die jetzt auch schon Probleme haben."}, {"id": 277, "start": 1157.0, "end": 1158.0, "text": "Und Android unterstützt das auch."}, {"id": 278, "start": 1158.0, "end": 1161.0, "text": "Aber es gibt uns verrecken keine gescheite Windows-Software,"}, {"id": 279, "start": 1161.0, "end": 1165.0, "text": "die ordentlich sowohl To-Do's als auch Calendars unterstützt."}, {"id": 280, "start": 1165.0, "end": 1168.0, "text": "Das ist Müll und ich hab ewig gesucht und für Linux schonmal gar nicht."}, {"id": 281, "start": 1168.0, "end": 1171.0, "text": "Alles, alles Crap, ja."}, {"id": 282, "start": 1171.0, "end": 1176.0, "text": "Und dann habe ich mir gesagt, okay, ne, Taskwarrior bringt nix."}, {"id": 283, "start": 1176.0, "end": 1178.0, "text": "Taskwarrior bringt ja nix."}, {"id": 284, "start": 1178.0, "end": 1181.0, "text": "Erstens gibt es für Taskwarrior keine gescheiten Mobile-Apps."}, {"id": 285, "start": 1181.0, "end": 1184.0, "text": "Ich glaube eine Android-App."}, {"id": 286, "start": 1184.0, "end": 1187.0, "text": "Entweder die iOS-App oder die Android-App."}, {"id": 287, "start": 1187.0, "end": 1188.0, "text": "Eins von beiden hat gesackt."}, {"id": 288, "start": 1188.0, "end": 1190.0, "text": "Taskwarrior habe ich mir nämlich auch angeguckt."}, {"id": 289, "start": 1190.0, "end": 1193.0, "text": "Unter Windows war es glaube ich auch ein bisschen problematisch."}, {"id": 290, "start": 1193.0, "end": 1200.0, "text": "Und in irgendeiner Art und Weise hat auch Cross-Platform nicht gescheit funktioniert,"}, {"id": 291, "start": 1200.0, "end": 1202.0, "text": "weil du immer zu deinem Server connecten musstest."}, {"id": 292, "start": 1202.0, "end": 1206.0, "text": "Deinem Taskwarrior-Server."}, {"id": 293, "start": 1206.0, "end": 1208.0, "text": "Das war auf jeden Fall nicht so schön."}, {"id": 294, "start": 1208.0, "end": 1216.0, "text": "Und dann habe ich das eine Weile versucht wie der Twin Quartz Thunderbird mit Lightning."}, {"id": 295, "start": 1216.0, "end": 1218.0, "text": "Das geht eigentlich ziemlich gut."}, {"id": 296, "start": 1218.0, "end": 1222.0, "text": "Die haben auch ganz coole Add-ons, dass man To-Do's und so relativ ordentlich machen kann."}, {"id": 297, "start": 1222.0, "end": 1230.0, "text": "Allerdings hat dann Thunderbird in der letzten Version absolutes Big-Brain-Play gemacht"}, {"id": 298, "start": 1230.0, "end": 1234.0, "text": "und hat dafür gesorgt, dass alle Add-ons nicht mehr funktionieren."}, {"id": 299, "start": 1234.0, "end": 1239.0, "text": "Und dann habe ich mir gedacht, so, wisst ihr was, ihr könnt mich jetzt mal alle am Arsch lecken."}, {"id": 300, "start": 1239.0, "end": 1242.0, "text": "Ich gucke jetzt mal was es sonst so gibt."}, {"id": 301, "start": 1242.0, "end": 1244.0, "text": "Und ich habe jetzt was gefunden."}, {"id": 302, "start": 1244.0, "end": 1248.0, "text": "Das nennt sich hier Joplin oder so."}, {"id": 303, "start": 1248.0, "end": 1250.0, "text": "Notes."}, {"id": 304, "start": 1250.0, "end": 1251.0, "text": "So."}, {"id": 305, "start": 1251.0, "end": 1253.0, "text": "Und das ist echt nice."}, {"id": 306, "start": 1253.0, "end": 1255.0, "text": "Das gibt es für alle Plattformen."}, {"id": 307, "start": 1255.0, "end": 1261.0, "text": "Das gibt es für Linux, für Windows, für Mac, für iOS, für Android."}, {"id": 308, "start": 1261.0, "end": 1265.0, "text": "Hat coole Funktionen und was das wichtig ist."}, {"id": 309, "start": 1265.0, "end": 1270.0, "text": "Also Notizprogrammen, wie man halt Notizprogrammen sich so vorstellt, ist eigentlich ganz nice."}, {"id": 310, "start": 1270.0, "end": 1272.0, "text": "Aber es unterstützt To-Do's."}, {"id": 311, "start": 1272.0, "end": 1278.0, "text": "Leider unterstützt es keine Call of To-Do's um es zu synchronisieren mit Nextcloud."}, {"id": 312, "start": 1278.0, "end": 1280.0, "text": "Aber das ist kein Problem."}, {"id": 313, "start": 1280.0, "end": 1287.0, "text": "Falls es den Client für alle Betriebssysteme gibt, kann ich einfach die eingebaute To-Do-Funktion verwenden."}, {"id": 314, "start": 1287.0, "end": 1291.0, "text": "Und auch über Nextcloud sinken, halt einfach über den Filesynch von Nextcloud."}, {"id": 315, "start": 1291.0, "end": 1295.0, "text": "Funktioniert wunderbar."}, {"id": 316, "start": 1295.0, "end": 1301.0, "text": "Und ich weiß jetzt auch warum mir die letzte Version nicht gefallen hat, ist, da konnten die noch keine Notifications verschicken."}, {"id": 317, "start": 1301.0, "end": 1311.0, "text": "Ich meine, wozu kann ich ein Fälligkeitsdatum eintragen bei irgendeinem To-Do, so nach dem Motto, hey, To-Do, keine Ahnung, hier fürs Abendessen einkaufen."}, {"id": 318, "start": 1311.0, "end": 1314.0, "text": "Und ich setze dann irgendwie hin, bis spätestens 16 Uhr erledigen."}, {"id": 319, "start": 1314.0, "end": 1323.0, "text": "Was bringt mir das, wenn ich das setzen kann, wenn das Ding keine Notifications kann."}, {"id": 320, "start": 1323.0, "end": 1328.0, "text": "Aber seit einem letzten Version kann das Notifications und ist richtig nice."}, {"id": 321, "start": 1328.0, "end": 1331.0, "text": "Also es ist wirklich cool und ich werde das jetzt versuchen."}, {"id": 322, "start": 1331.0, "end": 1338.0, "text": "Es gibt sogar Terminal Applications für Linux, Mac und mit WSL Windows."}, {"id": 323, "start": 1338.0, "end": 1350.0, "text": "Und was richtig nice ist auch, die haben sogar noch Browser Addons, wo du quasi dann Webseiten bookmarken kannst und Cross-Plattform sinken."}, {"id": 324, "start": 1350.0, "end": 1354.0, "text": "Und Webseiten, Screenshotten, Snapshotten, Cross-Plattform sinken und so."}, {"id": 325, "start": 1354.0, "end": 1356.0, "text": "Eigentlich übertrieben geil."}, {"id": 326, "start": 1356.0, "end": 1362.0, "text": "Und ich muss jetzt mal probieren, ich werde das jetzt mal probieren in nächster Zeit öfters zu verwenden."}, {"id": 327, "start": 1362.0, "end": 1371.0, "text": "Weil ich glaube, das ist das erste Programm, was ich gefunden habe, was wirklich jetzt mal alles abfackelt, was ich an To-Do und Notizen haben will."}, {"id": 328, "start": 1371.0, "end": 1374.0, "text": "Wozu eigentlich hardwarerad.de tun?"}, {"id": 329, "start": 1374.0, "end": 1382.0, "text": "Ja genau, also kommen wir mal zur eigentlichen Geschichte, nachdem ich jetzt so lange rumgeschwätzt habe, um alles mögliche andere."}, {"id": 330, "start": 1382.0, "end": 1394.0, "text": "Und zwar braucht der Hardwarerad oder das Hardwarerad-Team, also die hier, ein Tool, wenn ich das, ich zeige euch mal das Bild."}, {"id": 331, "start": 1394.0, "end": 1396.0, "text": "Ich habe es euch ja letztes Mal schon gezeigt."}, {"id": 332, "start": 1396.0, "end": 1399.0, "text": "Er hat mir das ja versucht aufzumalen."}, {"id": 333, "start": 1399.0, "end": 1403.0, "text": "Wo habe ich es denn?"}, {"id": 334, "start": 1403.0, "end": 1407.0, "text": "Hier, er hat mir versucht aufzumalen, was er braucht."}, {"id": 335, "start": 1407.0, "end": 1411.0, "text": "Aber das haben wir uns das letzte Mal schon angeguckt."}, {"id": 336, "start": 1411.0, "end": 1418.0, "text": "Aua, wie sieht die Website aus? Gar nicht, sieht doch gut aus."}, {"id": 337, "start": 1418.0, "end": 1422.0, "text": "Ok, das hier unten, die Schrift könnte man ein bisschen heller machen."}, {"id": 338, "start": 1422.0, "end": 1428.0, "text": "Aber das ist doch eine richtig ordentliche Website, die sieht nicht so überladen, Crap beladen aus, wie alles andere."}, {"id": 339, "start": 1428.0, "end": 1434.0, "text": "Ok, einfach simpel."}, {"id": 340, "start": 1434.0, "end": 1438.0, "text": "Die Schrift könnte auch ein bisschen besser Anti-Alas sein, aber ansonsten."}, {"id": 341, "start": 1438.0, "end": 1446.0, "text": "Naja, zumindest habe ich für die ja schon diesen Windows-Aktivierungs-Server da gebastelt."}, {"id": 342, "start": 1446.0, "end": 1453.0, "text": "Also nicht der, der nicht Windows aktiviert, sondern wo man Windows-Seriennummern drin verwalten kann und so ein kleines Programm,"}, {"id": 343, "start": 1453.0, "end": 1457.0, "text": "was dann die Windows-Installation aktiviert, das ein bisschen weniger Arbeit haben."}, {"id": 344, "start": 1457.0, "end": 1472.0, "text": "Und da haben sie mich gefragt, ob es nicht möglich wäre, ein Programm zu basteln, das mit ihrem Sparkode-Scanner funktioniert."}, {"id": 345, "start": 1472.0, "end": 1480.0, "text": "Also sprich, wenn die eine Lieferung, wenn die eine Palette bekommen, mit neuen Sachen drauf,"}, {"id": 346, "start": 1480.0, "end": 1491.0, "text": "dann wollen sie die Sachen scannen, wollen quasi dabeischreiben hier, ok, das sind jetzt 15 Seriennummern von, keine Ahnung, AMD, Ryzen 3, 3900X."}, {"id": 347, "start": 1491.0, "end": 1495.0, "text": "Scan, scan, scan, scan, scan. Und das Ganze speichern."}, {"id": 348, "start": 1495.0, "end": 1501.0, "text": "Und falls irgendwann mal Riture ist wahrscheinlich oder irgendwie, wenn mal irgendwie einer was wissen will,"}, {"id": 349, "start": 1501.0, "end": 1514.0, "text": "dann wollen sie suchen können, quasi nach der jeweiligen Seriennummer, in welcher Bestellung das drin war, wahrscheinlich, dass es zuordnen können, von welchem Lieferant das ist oder so, keine Ahnung."}, {"id": 350, "start": 1514.0, "end": 1519.0, "text": "Meine erste Frage war auch, warum macht ihr das nicht mit eurer Shop- oder Warenwirtschaftssoftware?"}, {"id": 351, "start": 1519.0, "end": 1526.0, "text": "Und ich meine, die kann das irgendwie nicht richtig. Und ich habe ihnen gesagt, ok, ich bastel irgendwas, was das macht."}, {"id": 352, "start": 1526.0, "end": 1531.0, "text": "Ist jetzt eigentlich nichts großartig Aufwendiges. Aber es wird kein schöneres Preis gewinnen."}, {"id": 353, "start": 1535.0, "end": 1544.0, "text": "So. Und das habe ich hier quei. So etwas habe ich mir auch überlegt, ob man nicht noch einen SYNC ran basteln kann für die Shop-Software."}, {"id": 354, "start": 1544.0, "end": 1552.0, "text": "Die meisten Barcode-Scanner tun doch eh so, als wenn sie die Tastatur eingaben. Ja, genau. So werden wir das wahrscheinlich auch machen."}, {"id": 355, "start": 1552.0, "end": 1559.0, "text": "So, wir werden das auch machen. Ich zeige euch mal. Also, ihr könnt euch vielleicht, also die Leute, die dabei waren im letzten Stream,"}, {"id": 356, "start": 1559.0, "end": 1568.0, "text": "ich zeige euch mal, wie das Programm im letzten Stream ausgeschaut hat. Und dann zeige ich euch mal, wie es jetzt aussieht, weil ich habe heute nochmal ein bisschen gebastelt dran."}, {"id": 357, "start": 1568.0, "end": 1578.0, "text": "So, das letzte Mal, ich resette das mal. Das letzte Mal haben wir ja versucht, das Ding ein bisschen zu skinnen am Ende noch, aber das hat scheiße ausgesehen."}, {"id": 358, "start": 1578.0, "end": 1584.0, "text": "Das ist übrigens Windows Forms, nicht WPF und nicht OWP oder sonst was in der Richtung. Ganz oldschool Windows Forms."}, {"id": 359, "start": 1584.0, "end": 1590.0, "text": "Wie konnte man nochmal resetten hier in Git unter Visual Studio? Sonst musst du das über die Kommandozeile machen."}, {"id": 360, "start": 1590.0, "end": 1604.0, "text": "Was ich dort, wo ich deutlich mehr Übungen habe hier, reset, art, yes. Ja, okay. Warum haben wir das letzte Mal?"}, {"id": 361, "start": 1604.0, "end": 1618.0, "text": "Form, so. Oh, der ganze Shit muss weg. So sah das Ding das letzte Mal aus. Also, jetzt sehr ultra hässlich."}, {"id": 362, "start": 1618.0, "end": 1632.4, "text": "Oh, der ganze Shit muss weg, so sah das Ding das letzte Mal aus, also jetzt sehr ultra"}, {"id": 363, "start": 1632.4, "end": 1645.64, "text": "hässlich, wo ist denn die Textbox hinten oben, wo ist meine Textbox, okay keine Ahnung,"}, {"id": 364, "start": 1645.64, "end": 1649.28, "text": "es sah das letzte Mal ultra hässlich aus, eigentlich gab es hier noch eine Textbox,"}, {"id": 365, "start": 1649.28, "end": 1652.72, "text": "wo man suchen kann und da macht man die Bestellung auf, also es sieht wirklich, sah richtig aus"}, {"id": 366, "start": 1652.72, "end": 1658.36, "text": "wie so eine kacke Windows 95 Anwendung, aber das Icon, Icon ist das Wichtigste, so und"}, {"id": 367, "start": 1658.36, "end": 1663.6, "text": "ich hab mir gedacht, okay, irgendwie fand ich, sah das Ding mega hässlich aus, ich hab"}, {"id": 368, "start": 1663.6, "end": 1666.52, "text": "mir gedacht, ey, sollen wir es nicht vielleicht doch in WPF neu machen oder sollen wir es"}, {"id": 369, "start": 1666.52, "end": 1670.0, "text": "nicht vielleicht doch in einer Web Anwendung machen oder sollen wir nicht vielleicht doch"}, {"id": 370, "start": 1670.0, "end": 1673.28, "text": "irgendwie gucken, ob wir es vielleicht nicht doch als UWP machen, ich hab mir gedacht,"}, {"id": 371, "start": 1673.28, "end": 1677.64, "text": "eigentlich ist mir das alles zu viel Act für eine Anwendung, die aus zwei Fenstern besteht"}, {"id": 372, "start": 1677.64, "end": 1686.08, "text": "und irgendwie drei Eingabefelder hat und jetzt zeige ich euch mal, wie es heute aussieht,"}, {"id": 373, "start": 1686.08, "end": 1690.84, "text": "hier hab ich übrigens aufgeschrieben, was wir noch machen müssen, jetzt zeige ich euch"}, {"id": 374, "start": 1690.84, "end": 1701.08, "text": "mal, wie das heute aussieht, sieht schon ein bisschen besser aus, Bäm, ist doch schon"}, {"id": 375, "start": 1701.08, "end": 1706.88, "text": "mal Fortschritt im Vergleich zu dem anderen, oder, so, jetzt haben wir nämlich auch einen"}, {"id": 376, "start": 1706.88, "end": 1712.08, "text": "ordentlichen, ordentlichen Listview hier, wo man das, wo man suchen kann und wo man hervorheben"}, {"id": 377, "start": 1712.08, "end": 1719.24, "text": "kann und ich zeige euch mal, was richtig cool ist, es ist jetzt, beispielsweise, ich hab"}, {"id": 378, "start": 1719.24, "end": 1726.04, "text": "jetzt nur eine Sache eingetragen, ja, als Test, so und ich zeige euch mal, was das jetzt,"}, {"id": 379, "start": 1726.04, "end": 1731.48, "text": "was das für coole Sachen kann, also erstens mal natürlich, du kannst sortieren, na, das"}, {"id": 380, "start": 1731.48, "end": 1737.96, "text": "ist jetzt natürlich schon ein riesen Vorteil im Vergleich zu dem anderen, du kannst sortieren,"}, {"id": 381, "start": 1737.96, "end": 1742.76, "text": "das ist aber jetzt nicht auf meine Mist gewachsen, ich hab mir einfach eine GUI Library gesucht,"}, {"id": 382, "start": 1742.76, "end": 1747.32, "text": "die ein paar bessere Controls hat, wir verwenden jetzt Sync Fusion für das Ganze, kann man"}, {"id": 383, "start": 1747.32, "end": 1752.04, "text": "sich kaum mal kostenlos verwenden, wenn man sich mit einem Linked-in-Konto verknüpft,"}, {"id": 384, "start": 1752.04, "end": 1756.16, "text": "da hab ich mir gedacht, ich mach mir einfach ein Fake-Linked-In-Konto und hol mir einen"}, {"id": 385, "start": 1756.16, "end": 1763.36, "text": "Code für die Free-Version, also man kann jetzt hier sortieren, ist eigentlich ganz praktisch,"}, {"id": 386, "start": 1763.36, "end": 1767.68, "text": "dieses Created-Add hier machen wir noch weg, das brauchen wir in der Hauptform nicht und"}, {"id": 387, "start": 1767.68, "end": 1770.36, "text": "jetzt zeige ich euch mal, was richtig geil ist, also es sind schon ein paar richtig nice"}, {"id": 388, "start": 1770.36, "end": 1776.2, "text": "Features drin im Vergleich zum letzten Mal, man kann suchen, beispielsweise nach AMD und"}, {"id": 389, "start": 1776.2, "end": 1780.6, "text": "ihr seht, es wird alles ausgepl... na gut, es ist jetzt sonst nichts anderes drin, es"}, {"id": 390, "start": 1780.6, "end": 1785.64, "text": "wird alles ausgeplendet, was nicht AMD ist und sogar AMD wird Highlighted, also wenn"}, {"id": 391, "start": 1785.64, "end": 1792.28, "text": "ich jetzt mal hier nach R34 oder WE-Dings suche, dann sieht man, wo es gefunden wird"}, {"id": 392, "start": 1792.28, "end": 1797.04, "text": "und alles andere wird ausgeplendet, aber oben drüber sieht man immer noch, in welcher Bestellung"}, {"id": 393, "start": 1797.04, "end": 1804.36, "text": "das drin ist, nämlich in der Bestellung, neue Bestellung vom 19.10., was noch nicht geht"}, {"id": 394, "start": 1804.36, "end": 1810.44, "text": "ist die Detailform aufmachen, achja, das Speichern der Daten funktioniert auch ein bisschen"}, {"id": 395, "start": 1810.44, "end": 1813.64, "text": "anders, wie in der alten Anwendung, in der alten Anwendung haben wir so eine Embedded"}, {"id": 396, "start": 1813.64, "end": 1818.44, "text": "NoSQL LiteDB verwendet, bis mir dann irgendwann aufgefallen ist, dass es eigentlich gar keine"}, {"id": 397, "start": 1818.44, "end": 1824.92, "text": "so schlaue Idee gewesen, weil das Ding keinerlei Database-Migrations oder so kann, also sprich,"}, {"id": 398, "start": 1824.92, "end": 1829.08, "text": "wenn ich mal auf die Idee kommen sollte, in Zukunft da irgendwie noch ein paar Felder"}, {"id": 399, "start": 1829.08, "end": 1831.6, "text": "umzubenennen oder so, dann spackt das wahrscheinlich übelst rum."}, {"id": 400, "start": 1831.6, "end": 1837.72, "text": "Du weißt schon, dass Syncfusion über 2K, nee, kostet nicht, die Free-Version nicht,"}, {"id": 401, "start": 1837.72, "end": 1841.88, "text": "du musst für die Free-Version nichts bezahlen und du kannst die Free-Version auch verwenden"}, {"id": 402, "start": 1841.88, "end": 1847.44, "text": "bis, glaube ich, eine Million Euro Umsatz oder, nee, oder eine oder 100.000, 100.000 glaube"}, {"id": 403, "start": 1847.44, "end": 1857.4, "text": "ich, ne, irgendwie so, was juckt es mich, das ist ein internes Tool, was sonst keiner"}, {"id": 404, "start": 1857.4, "end": 1862.8, "text": "verwendet, womit ich auch nichts verdiene oder so, das kann sich jeder, kann sich jeder"}, {"id": 405, "start": 1862.8, "end": 1873.64, "text": "herunterladen hier, ja, die haben das safe, ich aber nicht, das ist aber echt cool, das"}, {"id": 406, "start": 1873.64, "end": 1885.16, "text": "ist das, nee, guck mal hier, Companies and Individuals less than 1Million and Viewer than"}, {"id": 407, "start": 1885.16, "end": 1897.32, "text": "5Developers, alles, was ich, was ich habe. So, und das ist echt cool, weil da sind schon"}, {"id": 408, "start": 1897.32, "end": 1903.36, "text": "ein paar bessere Controls dabei, das ist egal, ob Hardware Rat die Software benutzt, in dem"}, {"id": 409, "start": 1903.36, "end": 1909.32, "text": "Fall zählt es, als zähle ich als Programmierer bzw. wie ich das eventuell irgendwie weiter"}, {"id": 410, "start": 1909.32, "end": 1917.12, "text": "lizenziere oder so. Ich bin ja nicht Hardware Rat oder so, ich bin der Max, ich habe mit"}, {"id": 411, "start": 1917.12, "end": 1922.2, "text": "Hardware Rat nichts zu tun, außer, dass ich für Hardware Rat was programmiere. So, und"}, {"id": 412, "start": 1922.2, "end": 1925.72, "text": "also das ist wirklich nice, da muss man gar nicht so viel zu machen und jetzt zeige ich"}, {"id": 413, "start": 1925.72, "end": 1932.28, "text": "euch mal was richtig, was richtig krass ist, also ein richtig nice Feature, wenn man sagt,"}, {"id": 414, "start": 1932.28, "end": 1938.92, "text": "ok, ich will jetzt eine neue Bestellung hinzufügen, klick ich hier oben drauf, geht neues Fenster"}, {"id": 415, "start": 1938.92, "end": 1946.72, "text": "auf neue Bestellung, nennen wir jetzt mal irgendwie Twitch, QtChat, Ayayaya, heißt die Bestellung,"}, {"id": 416, "start": 1946.72, "end": 1956.6, "text": "so und jetzt passt mal auf. Ich kann jetzt, wenn ich hier in die Beschreibung gehe und"}, {"id": 417, "start": 1956.6, "end": 1962.76, "text": "anfange was einzutippen oder doppelt reinklicke, kriege ich Autocompletion mit allen anderen"}, {"id": 418, "start": 1962.76, "end": 1973.92, "text": "Beschreibungen, die es schon gibt. Das ist hier Big Brain. Gehst hier rein, fängst,"}, {"id": 419, "start": 1973.92, "end": 1981.2, "text": "keine Ahnung, gehst hier rein, fängst an zu schreiben, äh, Risen, zack. Und das ist"}, {"id": 420, "start": 1981.2, "end": 1986.76, "text": "richtig cool, weil ich habe mir gedacht, ähm, die Rechtschreibfehler werden auch übernommen,"}, {"id": 421, "start": 1986.76, "end": 1991.96, "text": "ja, weil ich habe mir gedacht, die kriegen wahrscheinlich gar nicht so viele verschiedene"}, {"id": 422, "start": 1991.96, "end": 2002.36, "text": "Teile. Benutzt du Lambda? Hä? Nee, was? Meinst du hier, äh, meint ihr so, die Geschichten,"}, {"id": 423, "start": 2002.36, "end": 2008.96, "text": "ja klar. Ähm, ja, und das ist halt echt nice, weil ich habe mir gedacht, die bestellen"}, {"id": 424, "start": 2008.96, "end": 2013.12, "text": "gar nicht so viel, die bestellen vielleicht, keine Ahnung, 20 verschiedene Sachen und"}, {"id": 425, "start": 2013.12, "end": 2017.4, "text": "da musst du jedes Mal den Mist eintippen und hier machst du einfach Autovervollständigung"}, {"id": 426, "start": 2017.4, "end": 2023.36, "text": "und sagst, okay, das ist ein AMD Risen, so. Und jetzt hast du die Möglichkeit, manuell"}, {"id": 427, "start": 2023.36, "end": 2029.44, "text": "was einzutippen, wenn du manuell was eintippen willst, kann ja auch mal sein, dass du keinen"}, {"id": 428, "start": 2029.44, "end": 2038.96, "text": "Scanner hast, dann kannst du hier sagen, LUL HD 2019 Omega LUL, die Seriennummer, zack,"}, {"id": 429, "start": 2038.96, "end": 2045.68, "text": "passt. Du könntest aber auch scannen und, äh, Lambdas, Lambdas sind, im Prinzip sind"}, {"id": 430, "start": 2045.68, "end": 2049.48, "text": "Lambdas Funktionen, ohne dass du ihnen einen Namen geben musst und dass du sie inline schreiben"}, {"id": 431, "start": 2049.48, "end": 2061.0, "text": "kannst. Ähm, so. Und ich simuliere jetzt mal einen Scanner, da muss ich jetzt mal das"}, {"id": 432, "start": 2061.0, "end": 2065.68, "text": "Terminal aufmachen, da sieht man das nämlich ganz gut. Ich logge nämlich mit, was in dieser"}, {"id": 433, "start": 2065.68, "end": 2071.44, "text": "Form, äh, Form quasi getippt wird. Also erstmal, erstmal schon Keylogger ist raus, ja. Also"}, {"id": 434, "start": 2071.44, "end": 2076.28, "text": "ich logge in dieser Form mit, was, äh, was getippt wird. Das heißt, egal wo man in dieser"}, {"id": 435, "start": 2076.28, "end": 2081.6, "text": "Form ist, wenn der Scanner scannt, geht's immer automatisch, wird's immer automatisch"}, {"id": 436, "start": 2081.6, "end": 2086.68, "text": "eingescannt. Und ich tu jetzt mal so, als wär ich der Scanner und es setzt jetzt voraus,"}, {"id": 437, "start": 2086.68, "end": 2091.72, "text": "dass man den Scanner customisen kann, dass er ein Zeichen davor und ein Zeichen danach"}, {"id": 438, "start": 2091.72, "end": 2095.8, "text": "sendet. Da müssen wir mal gucken, wenn das nicht geht, wenn das der Scanner nicht kann,"}, {"id": 439, "start": 2095.8, "end": 2101.16, "text": "was die haben, dann mach ich halt ein Inputfeld, wo du reingehen musst, ja, das geht auch."}, {"id": 440, "start": 2101.16, "end": 2110.16, "text": "Ah, gut. So, ich, ich fake jetzt mal, ich fake jetzt mal Scanner. So, bla, bla, bla, bla,"}, {"id": 441, "start": 2110.16, "end": 2116.12, "text": "blub, zack. Habt ihr gesehen? Ich war jetzt der Scanner. Bin jetzt der Scanner, ich scanne"}, {"id": 442, "start": 2116.12, "end": 2122.68, "text": "Seriennummer und wird eingetragen. Ich hab jetzt hier, ich hab jetzt Underscore als"}, {"id": 443, "start": 2122.68, "end": 2126.48, "text": "Startzeichen verwendet, aber da sollte man vielleicht was verwenden, was nicht in Seriennummern"}, {"id": 444, "start": 2126.48, "end": 2131.24, "text": "davor kommt. Underscore könnte schon, könnte schon, äh, ein bisschen schwierig werden."}, {"id": 445, "start": 2131.24, "end": 2138.32, "text": "Der Patrick hat subscribt. Big Brain. Dude, wieder auf Stufe 3, Alter. Vier Monate auf"}, {"id": 446, "start": 2138.32, "end": 2145.16, "text": "Stufe 3. Ich glaub's nicht, ja. Da, da brauch ich, brauch ich zwei Big Brain Emotes für,"}, {"id": 447, "start": 2145.16, "end": 2151.76, "text": "ähm, das ist auch scheiße. Geocon hat auch abonniert. Hab ich, hab ich, hab ich ganz"}, {"id": 448, "start": 2151.76, "end": 2164.36, "text": "übersehen, ja. Wahnsinn. Q als Signalzeichen, größer oder kleiner Zeichen. Hey, das finde"}, {"id": 449, "start": 2164.36, "end": 2170.72, "text": "ich eigentlich cool. Das eine Zeichen zum Starten, das andere Zeichen zum, ähm, Sargent"}, {"id": 450, "start": 2170.72, "end": 2184.76, "text": "Flakes Twitch Prime, dankeschön. Ja, so, so schaut das Ganze jetzt aus. Das ist, finde"}, {"id": 451, "start": 2184.76, "end": 2190.28, "text": "ich, schon viel schöner benutzbar als der andere Kram, den ich da gebastelt hab. Gefällt"}, {"id": 452, "start": 2190.28, "end": 2196.56, "text": "mir. Hat was. Und am besten, am besten finde ich eigentlich die Autovervollständigung."}, {"id": 453, "start": 2196.56, "end": 2202.16, "text": "Ähm, und, irgendjemand hat gefragt, wie ich das Ganze speichere, das zeige ich euch jetzt"}, {"id": 454, "start": 2202.16, "end": 2207.44, "text": "gleich. Mit größer Zeichen am Anfang und kleiner Zeichen am Ende ist es bei uns umgesetzt"}, {"id": 455, "start": 2207.44, "end": 2210.72, "text": "worden. Ach, du hast, ach, du hast es auch so mit Eingaben vom Scanner gemacht. Nein,"}, {"id": 456, "start": 2210.72, "end": 2214.12, "text": "ich, ja, wahrscheinlich mach ich das auch so mit größer und kleiner Zeichen. Da bin"}, {"id": 457, "start": 2214.12, "end": 2218.28, "text": "ich nicht der Einzige, der auf diese, auf die blöde Idee gekommen ist. Ähm, ja, ähm,"}, {"id": 458, "start": 2218.28, "end": 2222.52, "text": "was man, was man noch machen kann, ist natürlich, man kann, man kann Sachen löschen. Das ist"}, {"id": 459, "start": 2222.52, "end": 2226.92, "text": "natürlich nicht verkehrt. Oh, ich, ich tu jetzt noch mal so, als bin ich Scanner und"}, {"id": 460, "start": 2226.92, "end": 2233.84, "text": "scanne ein bisschen. So. Ähm, so, und das ist jetzt kein AMD Ryzen, sondern das ist"}, {"id": 461, "start": 2233.84, "end": 2240.72, "text": "jetzt ein Intel, wie heißen die aktuellen CPUs? 9, 9, 0, 0k oder so. Gibt's, gibt's"}, {"id": 462, "start": 2240.72, "end": 2249.8, "text": "den? Oder wir machen was anderes. China-Netzteil ist das jetzt. China-Netzteil. So, jetzt drücken"}, {"id": 463, "start": 2249.8, "end": 2253.76, "text": "wir das Save. Was noch nicht geht, ist, dass er automatisch Refreshed. Muss ich auch noch"}, {"id": 464, "start": 2253.76, "end": 2263.16, "text": "als To Do reinschreiben. Das müssen wir auch noch machen. Auto, Refresh, Main Form. So,"}, {"id": 465, "start": 2263.16, "end": 2268.28, "text": "und wenn man das jetzt speichert, zack, dann reloadet er noch nicht, weil's, äh, weil's"}, {"id": 466, "start": 2268.28, "end": 2273.96, "text": "noch nicht implementiert ist, dass er reloadet. So, wenn ich jetzt wieder neu starte, dann,"}, {"id": 467, "start": 2273.96, "end": 2280.04, "text": "dann andere Kram auch alles drin. So, was ist denn? Jetzt haben wir zwei Bestellungen"}, {"id": 468, "start": 2280.04, "end": 2282.8, "text": "drinne. Einmal neue Bestellungen, einmal neue Bestellungen. Achso, ich hab die Dinger einfach"}, {"id": 469, "start": 2282.8, "end": 2286.44, "text": "nur neue Bestellungen genannt. Das ist natürlich taktisch nicht so geschickt. Ich hätte die"}, {"id": 470, "start": 2286.44, "end": 2294.28, "text": "ein bisschen besser benennen sollen. Anstatt neue Bestellungen. Wobei, ich hab die Bestellungen"}, {"id": 471, "start": 2294.28, "end": 2303.56, "text": "doch Q-Chat Ayayaya genannt. Das, das scheint doch rumzubuggen. Eigentlich sollte da jetzt"}, {"id": 472, "start": 2303.56, "end": 2310.88, "text": "Q-Chat Ayayaya drinstehen in der Bestellung. Tja, da müssen wir mal gucken, warum das nicht"}, {"id": 473, "start": 2310.88, "end": 2326.36, "text": "funktioniert. Das gucken wir als erstes. Bestellungs. So, ähm, bugged irgendwie ein bisschen kann"}, {"id": 474, "start": 2326.36, "end": 2340.88, "text": "das sein. Warum steht denn in der Description drinne? Tja, gut. Das scheint irgendwie nicht"}, {"id": 475, "start": 2340.88, "end": 2346.16, "text": "so ganz zu funktionieren, würd ich sagen. Aber, wär auch viel zu einfach, wenn der"}, {"id": 476, "start": 2346.16, "end": 2352.08, "text": "Kram immer auf alle Hüfte funktionieren würde. Okay, müssen wir mal gucken an der Stelle,"}, {"id": 477, "start": 2352.08, "end": 2357.08, "text": "wo das gespeichert wird. Wahrscheinlich ist das relativ simpel. Ähm, die ganze wird hier"}, {"id": 478, "start": 2357.08, "end": 2374.64, "text": "unten irgendwo gespeichert. Also sprich, wenn man hier unten auf save drückt. Ah, kann"}, {"id": 479, "start": 2374.64, "end": 2391.96, "text": "das sein, dass das einfach, dass das nie geupdatet wird? Die Granatierung ist wahnsinnig big"}, {"id": 480, "start": 2391.96, "end": 2406.68, "text": "ein. Warum wird das nicht geupdatet? Hier wird der Kram doch eigentlich alles angelegt."}, {"id": 481, "start": 2406.68, "end": 2415.04, "text": "Achso, und übrigens toll, dass die Dinger Textbox 2 heißen. Vielleicht sollte ich die"}, {"id": 482, "start": 2415.04, "end": 2422.08, "text": "Dinger mal ordentlich benennen. Und zwar, das ist nicht Textbox 2, sondern das ist die"}, {"id": 483, "start": 2422.08, "end": 2435.2, "text": "Textbox für, ähm, das wird, das wird nicht richtig gespeichert, denk ich mir. Ähm,"}, {"id": 484, "start": 2435.2, "end": 2445.76, "text": "das ist nicht, das ist nämlich nicht die Textbox 2, das ist die, die, keine Ahnung, Description"}, {"id": 485, "start": 2445.76, "end": 2452.4, "text": "Box oder so. Wieder. Hat der Name hier jetzt auch angepasst? Ja, sehr schön. Dann blickt"}, {"id": 486, "start": 2452.4, "end": 2456.4, "text": "man nämlich auch mal ein bisschen durch. Das ist ein bisschen mit heißer, heißer Nadel"}, {"id": 487, "start": 2456.4, "end": 2460.96, "text": "geschrickt, ne. Aber hier, hier, hier legt er das doch eigentlich an. Also sprich, wenn"}, {"id": 488, "start": 2460.96, "end": 2468.92, "text": "ich's hinzufüge, wenn ich's hinzufüge, dann nimmt er das aus der Description, setzt"}, {"id": 489, "start": 2468.92, "end": 2479.44, "text": "die Seriennummer und edit das. Ok, also dann gucken wir mal mit dem SQLite Browser mal"}, {"id": 490, "start": 2479.44, "end": 2486.08, "text": "was Verrückliches, was der Flo vorgeschlagen hat, warum das Ganze nicht funktioniert. Desktop,"}, {"id": 491, "start": 2486.08, "end": 2496.0, "text": "äh, wie heißt das Ding hier? Web Application, ne WinForms App 11, besser Name. Oh, das gucken"}, {"id": 492, "start": 2496.0, "end": 2503.92, "text": "wir mal rein. Ne, das wurde nicht richtig gespeichert. Die Seriennummer wurden aber"}, {"id": 493, "start": 2503.92, "end": 2509.92, "text": "richtig gespeichert, was mich zu der Annahme führt, dass die Textbox irgendwie rumschwackt."}, {"id": 494, "start": 2509.92, "end": 2523.28, "text": "Lässt mich vermuten, dass die Textbox irgendwie rumschwackt. Ok, probier mal das noch mal"}, {"id": 495, "start": 2523.28, "end": 2534.56, "text": "aus. Also wenn ich was Neues hinzufüge, hier, neue, neu. Achso, ah, ich glaub ich weiß"}, {"id": 496, "start": 2534.56, "end": 2540.0, "text": "wo ganz leh, guck mal. Also das erste, warum es nicht funktioniert, schon mal das hier."}, {"id": 497, "start": 2540.0, "end": 2554.56, "text": "Von der Order setze ich nie die Description. Und das Ding nennen wir jetzt mal anders um,"}, {"id": 498, "start": 2554.56, "end": 2565.04, "text": "äh, irgendwie so, dass ich mir das merken kann. Ok, das sollte das jetzt eine schon mal fixen."}, {"id": 499, "start": 2565.04, "end": 2573.84, "text": "Gucken wir mal, bla bla bla bla, bla bla bla. So, ich tu mal wieder so, als wäre ich Scanner,"}, {"id": 500, "start": 2573.84, "end": 2584.88, "text": "jetzt tue ich das hinzu. Ähm, wobei das ist doof, wir machen das mal anders. Ähm, ich"}, {"id": 501, "start": 2584.88, "end": 2593.44, "text": "wusste ja irgendwie hier, keine Ahnung, blub. Ok, save. Ok, jetzt gucken wir mal was passiert."}, {"id": 502, "start": 2593.44, "end": 2604.64, "text": "Hä? Das scheint irgendwas mit der Textbox nicht richtig zu sein. Weil jetzt hat das"}, {"id": 503, "start": 2604.64, "end": 2632.24, "text": "funktioniert. Ach ne, Moment. Aber die Order stimmt auch nicht. Ah, also. Moment, also"}, {"id": 504, "start": 2632.24, "end": 2637.44, "text": "an der Stelle auch vollkommen falsch, wo ich das setze. Muss das hier unten beim Speichern"}, {"id": 505, "start": 2637.44, "end": 2647.72, "text": "setzen. Sonst mach ich das ja alles doppelt und dreifach. Ok, probieren wir das Ganze"}, {"id": 506, "start": 2647.72, "end": 2667.56, "text": "nochmal aus. Egal, save. Hä? Moment, kann das sein, dass ich irgendwie meine Textboxen"}, {"id": 507, "start": 2667.56, "end": 2678.2, "text": "vertauscht hab oder so? Hab ich irgendwo meine Textboxen vertauscht? Das ist doch vollkommen"}, {"id": 508, "start": 2678.2, "end": 2687.4, "text": "falsch. Hier müsste eigentlich drinstehen eins, zwei, drei. What? Ich muss noch, ich"}, {"id": 509, "start": 2687.4, "end": 2716.12, "text": "muss noch rtx on machen. Ja, genau. Ok, gucken wir nochmal. Was ist beim hinzufüllen? Description?"}, {"id": 510, "start": 2716.12, "end": 2744.92, "text": "Das ist aber echt merkwürdig. Nehm ein Datacrit. Das ist ein Datacrit. Das ist aber"}, {"id": 511, "start": 2744.92, "end": 2760.56, "text": "merkwürdig. Ok, also nochmal ganz langsam gucken. Was mach ich denn hier beim Speichern"}, {"id": 512, "start": 2760.56, "end": 2775.56, "text": "unten? Updated ads setz ich bloß. Ok, das ist ok. Das brauch ich an der Stelle garantiert"}, {"id": 513, "start": 2775.56, "end": 2777.4, "text": "nicht mehr. Ok, wisst ihr was? Wir gucken jetzt tatsächlich noch mit dem SQLite Explorer"}, {"id": 514, "start": 2777.4, "end": 2805.72, "text": "und gucken, ob die Anzeige nicht jetzt verkehrt ist. Hä? Da gebastelt. Sehr merkwürdig."}, {"id": 515, "start": 2805.72, "end": 2820.04, "text": "Ok, das Ding heißt QtChat. Beschreibung, da ist jetzt drinne keine Ahnung, 0w und jetzt"}, {"id": 516, "start": 2820.04, "end": 2839.56, "text": "machen wir hier irgendwelche Seriennummer rein. So. Hier. Ne, ne, das liegt nicht auf dem"}, {"id": 517, "start": 2839.56, "end": 2850.2, "text": "Netzwerk. Das ist aber echt merkwürdig. So, gucken wir mal jetzt, was drinne steht."}, {"id": 518, "start": 2850.2, "end": 2865.88, "text": "Das ist jetzt ok. Ok, dann hab ich irgendwelche Probleme, wenn ich die Felder zwischenzeitlich"}, {"id": 519, "start": 2865.88, "end": 2871.24, "text": "update. Da muss ich mal gucken, warum der rumspackt. Aber wir machen erst mal die anderen"}, {"id": 520, "start": 2871.24, "end": 2880.04, "text": "Punkte. Aber prinzipiell ist das an der richtigen Stelle kommt das an. Das ist Seriennummer,"}, {"id": 521, "start": 2880.04, "end": 2904.64, "text": "das ist Description. Dernummer, das passt. Ok, das passt prinzipiell schon. Der update"}, {"id": 522, "start": 2904.64, "end": 2910.56, "text": "das zwischenrinnig. Da muss ich mal gucken, was der für Schmerzen hat. Äh, was ist SQL"}, {"id": 523, "start": 2910.56, "end": 2914.4, "text": "dafür geeint, damit z.B. mehrere Personen darauf zugreifen, wenn die DB auf einem Netzlaufwerk"}, {"id": 524, "start": 2914.4, "end": 2919.68, "text": "liegt oder sollte man der für, eher für MySQL liegen. Also, also, äh, SQLite auf dem"}, {"id": 525, "start": 2919.68, "end": 2930.16, "text": "Netzlaufwerk würde ich nicht unbedingt, ähm, würde ich jetzt nicht unbedingt. Da könnt's"}, {"id": 526, "start": 2930.16, "end": 2934.76, "text": "auch Probleme geben, irgendwas zu locken oder so. Generell würde ich mir überlegen, wenn"}, {"id": 527, "start": 2934.76, "end": 2941.2, "text": "ich SQLite verwende und das mit mehreren Benutzern verwende, da muss man das, also"}, {"id": 528, "start": 2941.2, "end": 2949.04, "text": "das geht, das ganze prinzipiell schon machen. Aber ehrlich gesagt, keine Ahnung, wie das"}, {"id": 529, "start": 2949.04, "end": 2962.16, "text": "im größeren Ziel aussieht. Ich hab da keine großen Erfahrungen mit SQLite. Ähm, mein,"}, {"id": 530, "start": 2962.16, "end": 2969.88, "text": "theoretisch geht das, aber ich weiß nicht, ob ich machen würde. Naja, aber zumindest"}, {"id": 531, "start": 2969.88, "end": 2977.64, "text": "ist das komisch. Irgendwie, irgendwie packt das an manchen Stellen rum. So, das erste,"}, {"id": 532, "start": 2977.64, "end": 2981.24, "text": "das nächste, was ich machen muss, ich muss aus meiner Haupt, muss ich ein bisschen schöner"}, {"id": 533, "start": 2981.24, "end": 2985.32, "text": "machen, ähm, dieses Create braucht hier drin kein Mensch. Das schmeiße ich jetzt gerade"}, {"id": 534, "start": 2985.32, "end": 2998.04, "text": "mal an der Stelle wieder raus. Das sieht doch ein bisschen übersichtlicher aus. So, was"}, {"id": 535, "start": 2998.04, "end": 3003.48, "text": "man natürlich noch machen muss, ist, wenn man den Kram anklickt, dass er dann die Detailansicht"}, {"id": 536, "start": 3003.48, "end": 3020.36, "text": "aufmacht mit den ganzen Werten drin. Hahaha, neues Testament, ey, das ist, der Witz ist"}, {"id": 537, "start": 3020.36, "end": 3024.0, "text": "wirklich gut. Ich hab's erst nicht gecheckt, ja, aber jetzt, wenn ich das ganze nur mal"}, {"id": 538, "start": 3024.0, "end": 3028.92, "text": "durchlese, ist das eigentlich echt lustig. Wenn die die B auf ein Rätsel aufklickt,"}, {"id": 539, "start": 3028.92, "end": 3040.44, "text": "ist das mal Verspätung. Ja, das ist richtig. Das muss man erst, ja, das dauert, das dauert"}, {"id": 540, "start": 3040.44, "end": 3051.92, "text": "eine Weile. So, ich bin ganz froh, dass ich diese komische optische, die optisch bisschen"}, {"id": 541, "start": 3051.92, "end": 3055.96, "text": "hübschenen Controls für Windows Forms noch gefunden habe, weil, ähm, das alte sah"}, {"id": 542, "start": 3055.96, "end": 3061.92, "text": "wirklich Crap-mäßig aus, ja. Aber das ist jetzt eigentlich ganz nett. So, ähm, also"}, {"id": 543, "start": 3061.92, "end": 3068.2, "text": "was wird man als nächstes machen? Bestellt sich jetzt nicht über Umlangung, das haben"}, {"id": 544, "start": 3068.2, "end": 3071.16, "text": "wir uns angeguckt, dass es irgendeine Geschichte von zwischendrin Sachen nicht aktualisiert"}, {"id": 545, "start": 3071.16, "end": 3078.12, "text": "wird. Da muss ich mal in Ruhe gucken. Äh, Terok, Switch Prime, Dankeschön, Big Brain."}, {"id": 546, "start": 3078.12, "end": 3083.6, "text": "Ähm, Create Date aus Mainform raus, haben wir gemacht. Drag and Drop mach ich jetzt"}, {"id": 547, "start": 3083.6, "end": 3088.52, "text": "nicht, da muss ich erst mal angucken, wie das geht. Ähm, ja, das was am meisten gescannt"}, {"id": 548, "start": 3088.52, "end": 3093.76, "text": "wurde, wollte ich hier als Default reinschreiben, bzw. als ersten Vorschlag in der Autocompletion"}, {"id": 549, "start": 3093.76, "end": 3098.44, "text": "anbieten. Das glaube ich nicht verkehrt, wenn wir das sortieren, nachdem wie oft was"}, {"id": 550, "start": 3098.44, "end": 3105.08, "text": "vorgekommen ist. Ähm, dann müssen wir als nächstes das da machen, dass die Mainform"}, {"id": 551, "start": 3105.08, "end": 3109.36, "text": "neu geladen wird, irgendwie, wenn neue Daten hinzugefügt werden, alles andere ist beknackt,"}, {"id": 552, "start": 3109.36, "end": 3114.44, "text": "ja. Also sprich, wir müssen das einmal neu einlesen, weil sonst ist es total bescheuert."}, {"id": 553, "start": 3114.44, "end": 3128.0, "text": "Ähm, Sound aus. Die Gruppen werden nicht richtig sortiert, ok. Also ich glaube das"}, {"id": 554, "start": 3128.0, "end": 3135.04, "text": "ist das erste was wir machen. Das muss ich mir hier unten drunter mal hinschreiben,"}, {"id": 555, "start": 3135.04, "end": 3139.64, "text": "ähm, dass ich mir das mal angucke, warum das so komisch rumspackt. Wahrscheinlich relativ"}, {"id": 556, "start": 3139.64, "end": 3147.92, "text": "simple, weil ich an irgendeiner Stelle, wo es im UI aktualisiert, unten drunter nicht"}, {"id": 557, "start": 3147.92, "end": 3167.04, "text": "aktualisiert wird. Äh, Ruffy Monkey, was genau möchtest du mir mitteilen? Dass du"}, {"id": 558, "start": 3167.04, "end": 3171.92, "text": "eine krasse Datenbank Pro bist, oder was? Ich weiß auch, dass man das anders machen"}, {"id": 559, "start": 3171.92, "end": 3185.76, "text": "kann. Vio, Vio still abonniert Stufe 1, Dankeschön. Pog. So, dann würde ich sagen, machen wir"}, {"id": 560, "start": 3185.76, "end": 3201.88, "text": "das jetzt mal. Achja stimmt, das müssen wir zuerst machen, das packt nämlich auch noch"}, {"id": 561, "start": 3201.88, "end": 3208.4, "text": "rum. Ich bin nämlich ziemlich, äh, ziemlich beknackt hier an der Stelle unten, hab ich,"}, {"id": 562, "start": 3208.4, "end": 3213.84, "text": "ähm, gemacht. Ich sehr, ich edit die Sache immer. Wo das Problem ist, ich kann das nicht"}, {"id": 563, "start": 3213.84, "end": 3227.48, "text": "immer adden, ich muss das updaten. Also sprich, wenn das eine neue, wenn das ein neuer Eintrag"}, {"id": 564, "start": 3227.48, "end": 3241.16, "text": "ist, dann machen wir ein add. Wenn das kein neuer Eintrag ist, dann machen wir ein update."}, {"id": 565, "start": 3241.16, "end": 3254.88, "text": "Ansonsten packt das rum. So, ich überleg grad, wie man das mit dem, mit dem updaten von"}, {"id": 566, "start": 3254.88, "end": 3259.36, "text": "der Mainform gescheit machen können. Also ich will ja, dass wenn ich was neues hinzufüge,"}, {"id": 567, "start": 3259.36, "end": 3266.84, "text": "ich blablabla, wenn ich was neues hinzufüge, will ich ja beim speichern, dass die Mainform"}, {"id": 568, "start": 3266.84, "end": 3274.12, "text": "neu geladen wird. Das könnt man entweder machen, wenn man die Form zu macht, aber das"}, {"id": 569, "start": 3274.12, "end": 3280.16, "text": "ist eigentlich doof. Wir bräuchten irgendeinen Event, wir müssten irgendwie Bescheid sagen"}, {"id": 570, "start": 3280.16, "end": 3287.8, "text": "so nach dem Motto, ich hab save geklickt und wenn ich save geklickt hab, dann muss ich"}, {"id": 571, "start": 3287.8, "end": 3302.44, "text": "updaten. Wie macht man das am besten? Wir könnten, wir könnten hier drin ein Event machen,"}, {"id": 572, "start": 3302.44, "end": 3307.88, "text": "wir könnten hier drin ein Event machen, so nach dem Motto saved und wenn wir hier unten"}, {"id": 573, "start": 3307.88, "end": 3319.08, "text": "speichern, dann werfen wir das saved Event. Ne modaldingsdialog will ich net machen. Also"}, {"id": 574, "start": 3319.08, "end": 3339.28, "text": "wir könnten, wir könnten, wir könnten irgendwie sowas hier machen. Saved oder so. Hallo, nein,"}, {"id": 575, "start": 3339.28, "end": 3351.04, "text": "das gibt es öfters. Ach Mist, den Kram gibt es öfters. Saved. Dann reichen wir das durch."}, {"id": 576, "start": 3351.04, "end": 3364.88, "text": "Gibt es für SQLer, ich hab keine Objekte, doch, doch, doch. Ich hab ja auch mal eher"}, {"id": 577, "start": 3364.88, "end": 3369.04, "text": "F-Core reingeschmissen, weil ich keinen Bock hatte irgendwelche SQL Statements zu schreiben."}, {"id": 578, "start": 3369.04, "end": 3380.56, "text": "So und jetzt schmeißen wir ein Event beim speichern. Müsste doch eigentlich funktionieren."}, {"id": 579, "start": 3380.56, "end": 3407.16, "text": "Saved. So und jetzt können wir bei uns in der Mainform. Event row change, du lässt"}, {"id": 580, "start": 3407.16, "end": 3415.16, "text": "Automat speichern, aber du brauchst keinen Saved Button. Das ist cool. Das ist tatsächlich"}, {"id": 581, "start": 3415.16, "end": 3439.24, "text": "ganz praktisch. Du meinst bei dem Ding hier. Gucken was da alles changed ist. Heißt wahrscheinlich,"}, {"id": 582, "start": 3439.24, "end": 3442.96, "text": "wahrscheinlich heißt das nur beim offiziellen Microsoft Control und hier heißt das wahrscheinlich"}, {"id": 583, "start": 3442.96, "end": 3467.72, "text": "irgendwie anders, aber das gibt es garantiert hier auch. Und der View. Ich hab gar kein"}, {"id": 584, "start": 3467.72, "end": 3474.4, "text": "richtiges Data Table. Ich hab einfach nur ein Array aus Objekts, was aus EF Core rauskommt"}, {"id": 585, "start": 3474.4, "end": 3482.44, "text": "dafür. Aber ist ja auch, das bei dem Update passt eigentlich so denke ich mal ganz gut."}, {"id": 586, "start": 3482.44, "end": 3489.64, "text": "So, wir gehen jetzt mal zurück in die Mainform und gucken, wenn das Ganze zugemacht wird."}, {"id": 587, "start": 3489.64, "end": 3499.6, "text": "Was tut es? Ich hab eigentlich die Punktfragezeichen. Was ist, wenn das Ding null ist, also wenn,"}, {"id": 588, "start": 3499.6, "end": 3507.32, "text": "ach was mach ich da eigentlich für ein Schwarzinsert? Also sprich, wenn hier nichts dran attached"}, {"id": 589, "start": 3507.32, "end": 3515.72, "text": "ist, dann invoked, also dann ruft das nicht die Methode auf. Also wenn das hier im Endeffekt,"}, {"id": 590, "start": 3515.72, "end": 3526.76, "text": "wenn das hier null ist, dann macht er das hier nicht. Das Ding hat auch irgendwie einen"}, {"id": 591, "start": 3526.76, "end": 3536.64, "text": "absolut Zungenbrechernamen, das Ding. Null, boah, wie heißt das Ding? Irgendwie Null Blah"}, {"id": 592, "start": 3536.64, "end": 3543.16, "text": "Questionmark Operator. Das Ding hat ganz abartige Namen. Das ist so ähnlich wie True Doppelpunkt,"}, {"id": 593, "start": 3543.16, "end": 3549.68, "text": "die Fragezeichen. Ja, bloß dass du nicht alles doppelt und dreifach schreiben musst."}, {"id": 594, "start": 3549.68, "end": 3559.76, "text": "Null, wie heißt dieser Kram nochmal? Save, was, call the save? Navigation Operator. Heißt"}, {"id": 595, "start": 3559.76, "end": 3581.24, "text": "aber offiziell nie so, oder? Ist das so? Save, null, null, Null Conditional Operator heißt"}, {"id": 596, "start": 3581.24, "end": 3596.68, "text": "das, genau. Das Ding, genau. Und man kann das jetzt auch, oder geht es vielleicht schon"}, {"id": 597, "start": 3596.68, "end": 3602.28, "text": "immer, man kann das auch als Index für BIOS verwenden. Ich meine, man kann es auch übertreiben,"}, {"id": 598, "start": 3602.28, "end": 3609.52, "text": "ja. Aber für Events ist das wirklich ganz praktisch. So, okay, gehen wir mal in die"}, {"id": 599, "start": 3609.52, "end": 3627.0, "text": "Einform gucken. Wir gucken, das müssen wir auf jeden Fall noch an eine Stelle zusammenfassen,"}, {"id": 600, "start": 3627.0, "end": 3631.44, "text": "deswegen habe ich es ja auch noch in die Tudu reingeschrieben. Ich habe das heute in zwei"}, {"id": 601, "start": 3631.44, "end": 3637.12, "text": "Stunden, indem ich hier mit meinem Zeug fertig war, zusammen gewurstet, dass es funktioniert"}, {"id": 602, "start": 3637.12, "end": 3641.08, "text": "und besser ausschaut als das letzte und dass das auch mal fertig wird irgendwann. Also"}, {"id": 603, "start": 3641.08, "end": 3644.36, "text": "ich habe es, ich glaube nicht, dass wir heute komplett fertig werden. Okay, also wir gucken"}, {"id": 604, "start": 3644.36, "end": 3651.6, "text": "jetzt mal, wie kann man das jetzt am besten, also sprich, wenn die Form closed, nee nicht"}, {"id": 605, "start": 3651.6, "end": 3667.36, "text": "closed, wenn die, ach Quatsch, weg machen. Also sprich, wenn jetzt einer den Save Button"}, {"id": 606, "start": 3667.36, "end": 3683.08, "text": "drückt, dann, was machen wir dann? Dann laden wir den Kram neu, würde ich sagen. Da müssen"}, {"id": 607, "start": 3683.08, "end": 3692.16, "text": "wir mal gucken, dass wir vorher richtig gespeichert haben, jawoll, haben wir, passt. So, wo habe"}, {"id": 608, "start": 3692.16, "end": 3699.84, "text": "ich nie das Laden aus der Datenbank da oben. Man merkt halt schon, dass es ein bisschen"}, {"id": 609, "start": 3699.84, "end": 3706.24, "text": "mit Halsanatel gestrickt ist, aber das brauchen wir an der Stelle garantiert nicht. Also laden"}, {"id": 610, "start": 3706.24, "end": 3722.68, "text": "wir den Kram neu, wenn man auf save drückt. Und dann müssen wir noch sagen refresh. Und"}, {"id": 611, "start": 3722.68, "end": 3729.44, "text": "das müssen wir invogen, weil wenn wir das nicht invogen, dann fresh uns das ganze Ding,"}, {"id": 612, "start": 3729.44, "end": 3737.08, "text": "das wird sonst nichts. Weil das, wobei, nee, müssten wir nicht invogen, das kommt beides"}, {"id": 613, "start": 3737.08, "end": 3740.76, "text": "aus dem GUI-Smart, das eigentlich kein Ding. Müsste eigentlich funktionieren, wobei, geht"}, {"id": 614, "start": 3740.76, "end": 3743.68, "text": "das von, ja, das muss von einer Form in die andere Form, müsste das auch funktionieren."}, {"id": 615, "start": 3743.68, "end": 3768.44, "text": "Okay, also wenn jetzt einer den save Button drückt, dann müsste das eigentlich weichern"}, {"id": 616, "start": 3768.44, "end": 3778.32, "text": "und neu laden. Gucken wir mal, ob das funktioniert. Okay, also mal ein neues Fenster auf. Blablabla,"}, {"id": 617, "start": 3778.32, "end": 3799.48, "text": "blablabla. Okay, und jetzt save. Oh, what the fuck. Alter, was jetzt? Smokersmoke. Was"}, {"id": 618, "start": 3799.48, "end": 3822.12, "text": "genau möchte ich mir denn diese Fehlermeldung jetzt sagen? At least one option. What? Okay,"}, {"id": 619, "start": 3822.12, "end": 3851.56, "text": "okay. What? Eh? Was ist doch da oben genauso? Okay. Okay. Okay. Okay. Okay. Okay. Okay."}, {"id": 620, "start": 3851.56, "end": 3871.32, "text": "Eh? Muss ich jetzt vorher clearen oder so? MrAmec, Twitch Prime, Dankeschön. Das funktioniert"}, {"id": 621, "start": 3871.32, "end": 3875.8, "text": "hier oben doch auch. Warum sollte das da unten nicht mal funktionieren? Muss man das, das"}, {"id": 622, "start": 3875.8, "end": 3881.08, "text": "muss man bestimmt, das muss man bestimmt vorher clearen oder irgendwie sowas. Warte mal, warte"}, {"id": 623, "start": 3881.08, "end": 3885.56, "text": "mal, wir probieren mal was aus. Und zwar, ich mach jetzt erst mal, erst mal mal das"}, {"id": 624, "start": 3885.56, "end": 3912.2, "text": "mal hier. Das ist jetzt merkwürdig. Blablabla. Aha. Der spackt beim Refresh rum."}, {"id": 625, "start": 3912.2, "end": 3937.16, "text": "Warum spackt der denn beim Refresh rum? Das leuchtet mir jetzt nicht wirklich ein. Ich"}, {"id": 626, "start": 3937.16, "end": 3958.04, "text": "werd' mal kurz meine Datepunk wegschmeißen, dass es ein bisschen leerer wird. Spackt der"}, {"id": 627, "start": 3958.04, "end": 3963.4, "text": "beim Refresh rum? Muss ich das doch invoken? Aber ist doch eigentlich, GUI-Thread ist GUI-Thread,"}, {"id": 628, "start": 3963.4, "end": 3983.96, "text": "das sollte doch eigentlich keine Probleme machen. Wär' ich jetzt nicht mitgerechnet, dass der"}, {"id": 629, "start": 3983.96, "end": 3997.48, "text": "an der Stelle irgendwie rumspackt? Ja. Führen wir mal aus. Add. Neue Bestellung. Blabla. Save."}, {"id": 630, "start": 3997.48, "end": 4018.12, "text": "Gut, das Refresh nicht. Hä? Jetzt kackt es gar nicht mehr ab. Aber Refreshen tut es auch"}, {"id": 631, "start": 4018.12, "end": 4023.88, "text": "nicht mehr. Wo ist denn das Problem? Wie verwenden wir den Kram überhaupt richtig?"}, {"id": 632, "start": 4023.88, "end": 4033.64, "text": "Was, weil er nicht sortieren muss?"}, {"id": 633, "start": 4053.88, "end": 4070.92, "text": "Genau. Filter?"}, {"id": 634, "start": 4070.92, "end": 4085.8, "text": "Ne, ich mach' hier, ich schreib' hier eine, äh, ich schreib' hier eine komplett neue"}, {"id": 635, "start": 4085.8, "end": 4092.92, "text": "Sache. Ah, okay. Äh, also was hat der, was hat der damit für Schmerzen, das weh ich"}, {"id": 636, "start": 4092.92, "end": 4101.8, "text": "nicht. Genau das Gleiche, wenn ich oben doch auch. Genau das Gleiche mach' ich hier doch"}, {"id": 637, "start": 4101.8, "end": 4110.68, "text": "auch. Also exakt, exakt das Gleiche. Warum spackt es da oben rum, äh, da oben nicht rum"}, {"id": 638, "start": 4110.68, "end": 4123.4, "text": "und hier spackt das rum. Ah, die muss ich nicht verstehen. Ähm, ich mach' mal kurz den"}, {"id": 639, "start": 4123.4, "end": 4133.0, "text": "Kram aus. Steht alles schön untereinander, okay. Darf man diese Sache vielleicht nur"}, {"id": 640, "start": 4133.0, "end": 4147.64, "text": "einmal neu, nee, oder? Man darf hier sicherlich nicht nur einmal neu. Ha! Das hat irgendwas"}, {"id": 641, "start": 4147.64, "end": 4160.92, "text": "mit den Gruppen zu tun. Das hat irgendwas mit den Gruppen-Settings zu tun. What? Okay."}, {"id": 642, "start": 4160.92, "end": 4171.96, "text": "Funktioniert. Gut, das Löschen wird noch nicht funktionieren, oder? Ähm, das Löschen"}, {"id": 643, "start": 4171.96, "end": 4178.36, "text": "kommt ja auch nie, kommt ja auch nie in der Collection an, aber what? Was hat es denn,"}, {"id": 644, "start": 4178.36, "end": 4187.64, "text": "was hat das denn mit den Gruppen zu tun? Okay, das ist wahrscheinlich irgendeine framework-spezifische"}, {"id": 645, "start": 4187.64, "end": 4201.88, "text": "Sache jetzt. Was jucken denn denn die Gruppen davon? Okay. Was auch immer. Kein Schimmer."}, {"id": 646, "start": 4201.88, "end": 4209.48, "text": "Aber an sich funktioniert das Updaten. Das verstehe ich nicht. Ah, ich mal guck, dass"}, {"id": 647, "start": 4209.48, "end": 4217.84, "text": "das normale Updaten tut. Ja, bla, bla, bla, bla, bla, bla. Also ich muss den Kram unbedingt"}, {"id": 648, "start": 4217.84, "end": 4222.08, "text": "mal ein bisschen, äh, ordentlicher zusammenschreiben, weil ich hab' jetzt zwei Mal, zwei Methoden"}, {"id": 649, "start": 4222.08, "end": 4224.92, "text": "hier aufgerufen, wenn einmal hier mit Enter drücken und einmal hier für Plus drücken"}, {"id": 650, "start": 4224.92, "end": 4232.68, "text": "und so, bla, bum, bum. Ähm, da hier, Q-Chat, Beschreibung, Aja, Ja, Zufügen, Serie-Nummer,"}, {"id": 651, "start": 4232.68, "end": 4243.16, "text": "irgendwas, save, zack, funktioniert direkt. Was hat der, warum spackt das auf einmal? Und"}, {"id": 652, "start": 4243.16, "end": 4250.2, "text": "warum geht das mit dem Sortieren nicht nachdem man das geändert hat? Das liegt eindeutig"}, {"id": 653, "start": 4250.2, "end": 4259.72, "text": "da dran, wenn man das hier updatet, dann spackt der rum. Wenn ich das hier nicht mache, also"}, {"id": 654, "start": 4259.72, "end": 4270.76, "text": "wenn ich das hier einfach nur öffne und sortier, ach nee, ok. Äh, Wonka Smoke, Alter. Warum?"}, {"id": 655, "start": 4270.76, "end": 4279.72, "text": "Wo ist das Problem? Ah, ich glaub' ich weiß, ich glaub' ich weiß woran das liegt. Ich"}, {"id": 656, "start": 4279.72, "end": 4288.48, "text": "weiß woran das liegt, glaub' ich. Ah, ich glaub' ich weiß woran das liegt. Ich dachte,"}, {"id": 657, "start": 4288.48, "end": 4294.8, "text": "ich könnte, ich könnte mich da vordrücken. Ähm, ich dachte, ich könnte mich da vordrücken,"}, {"id": 658, "start": 4294.8, "end": 4299.92, "text": "dass die Anzeige hier hässlich ist, indem ich hier, ich zeig' euch das mal kurz, ähm,"}, {"id": 659, "start": 4299.92, "end": 4307.36, "text": "ah, wird's wahrscheinlich liegen, ne, ähm, Order. Dass es hier richtig angezeigt wird,"}, {"id": 660, "start": 4307.36, "end": 4313.08, "text": "hab' ich hier Two-String überschrieben, weil sonst steht ja nur drin, dass es ein Order,"}, {"id": 661, "start": 4313.08, "end": 4324.52, "text": "sonst war es irgendwie, und wahrscheinlich stört ihn das irgendwie, weil wenn ich das"}, {"id": 662, "start": 4324.52, "end": 4338.68, "text": "hier sortiere ist kein Problem, aber das hier kann man nicht sortieren einfach so. Ok,"}, {"id": 663, "start": 4338.68, "end": 4351.0, "text": "das ist interessant, das war mir so nicht klar. Und, liegt das vielleicht doch mit den, mit"}, {"id": 664, "start": 4351.0, "end": 4364.36, "text": "den, mit den Data, vielleicht doch da dran? Also beim einfügen liegt das bestimmt auch"}, {"id": 665, "start": 4364.36, "end": 4375.28, "text": "da dran. Ja. Ok, ich hab' ehrlich gesagt keine Ahnung warum man das machen muss. Mehr"}, {"id": 666, "start": 4375.28, "end": 4384.12, "text": "Einträge mit, was soll das Tool später machen? Ähm, dass, du kannst Seriennummer von Produkten"}, {"id": 667, "start": 4384.12, "end": 4397.12, "text": "suchen, in welcher Bestellung die vorgekommen sind. So. Also ist nicht für mich, ähm, muss"}, {"id": 668, "start": 4397.12, "end": 4400.8, "text": "ich jetzt da irgendwie, ok Moment Leute, ich muss jetzt nochmal was ausbrechen, ich mach'"}, {"id": 669, "start": 4400.8, "end": 4406.88, "text": "das hier nochmal weg, dann sieht die Anzeige zwar hässlich aus, wie, wie kommt's zum Einsatz"}, {"id": 670, "start": 4406.88, "end": 4414.28, "text": "von, ähm, oh wie heißt das Ding hier, SF-Dings hier, Sync Fusion? Einfach weil die eine kostenlose"}, {"id": 671, "start": 4414.28, "end": 4421.28, "text": "Lizenz haben. Einfach weil die eine kostenlose Lizenz haben. Alles. Weil die eine kostenlose"}, {"id": 672, "start": 4421.28, "end": 4425.16, "text": "Lizenz haben und ganz gut ausschauen und ich die Kram nicht neu in WPF oder UWP machen"}, {"id": 673, "start": 4425.16, "end": 4441.0, "text": "muss. Ok, das juckt die nicht. Muss ich da jetzt wirklich? Eye Comparable irgendwie im,"}, {"id": 674, "start": 4441.0, "end": 4451.28, "text": "aber warum? Ja gut, muss ich, das ist ja ein eigener Typ. Rings, haben das? Ok, ja machen"}, {"id": 675, "start": 4451.28, "end": 4465.6, "text": "wir mal, machen wir, ähm, machen wir. Eye Comparable, was macht man da mittlerweile"}, {"id": 676, "start": 4465.6, "end": 4482.04, "text": "hier, den, den, den da? Ah, Compare to. Für was ist Compare? Compare ist die Geschichte"}, {"id": 677, "start": 4482.04, "end": 4486.8, "text": "mit größer, kleiner, gleich, oder? Also minus eins, null und eins, ne, irgendwie so ist das."}, {"id": 678, "start": 4486.8, "end": 4497.88, "text": "Die Spalte sollten in Ordnung, ach, ah, du, also heißt das, was meinst du jetzt für"}, {"id": 679, "start": 4497.88, "end": 4504.04, "text": "die Geschichte mit den Gruppen oder meinst du für, ähm, Vira generell das handelt,"}, {"id": 680, "start": 4504.04, "end": 4514.92, "text": "was da drinne steht? Also ok, aber so müsste das eigentlich, eigentlich, ok, ähm, also"}, {"id": 681, "start": 4514.92, "end": 4518.88, "text": "im Prinzip, kann ich da jetzt einfach sagen, es ist ja eigentlich egal, alles gleich. So"}, {"id": 682, "start": 4518.88, "end": 4524.08, "text": "und zumindest jetzt müsste es nicht mehr abkatzen. Das Sortieren kann man custom handeln. Ok,"}, {"id": 683, "start": 4524.08, "end": 4528.48, "text": "das, das, das ist gut zu, ja das Sortieren, also das Filtern habe ich custom gemacht, das"}, {"id": 684, "start": 4528.48, "end": 4533.52, "text": "Sortieren wusste ich nicht, dass das funktioniert. Ich habe das ja auch noch nie vorher benutzt."}, {"id": 685, "start": 4533.52, "end": 4536.88, "text": "Zumindest, der eigentliche Grund warum ich das benutze ist, weil sie eine Free-Lizenz"}, {"id": 686, "start": 4536.88, "end": 4543.48, "text": "haben und weil es ganz gut aussieht, im Vergleich zu Oldschool Windows Forms. Aber guck mal,"}, {"id": 687, "start": 4543.48, "end": 4548.68, "text": "wie schön die Autovervollstellung funktioniert. So, mal gucken, ob es jetzt funktioniert."}, {"id": 688, "start": 4548.68, "end": 4558.96, "text": "Hat das jetzt hinzugefügt? Also mit den Gruppen spackt übelst rum, das checke ich nicht."}, {"id": 689, "start": 4558.96, "end": 4565.24, "text": "Hast du eine Ahnung, äh, Krasios, wenn du das schon mal benutzt hast, ähm, warum es"}, {"id": 690, "start": 4565.24, "end": 4572.2, "text": "ihn stört, bzw. warum er nicht refresht, wenn ich Gruppen drin habe? Wenn ich die Gruppen"}, {"id": 691, "start": 4572.2, "end": 4577.32, "text": "rausnehme, refresht er sofort, das juckt ihn überhaupt nicht. Wenn ich die Gruppen rausnehme,"}, {"id": 692, "start": 4577.32, "end": 4586.52, "text": "dann etwas hinzufüge, hier blablabla, zack, ist da. Aber wenn ich Gruppen drin habe, spackt"}, {"id": 693, "start": 4586.52, "end": 4602.52, "text": "er rum, ich habe keine Ahnung warum. Sollen wir mal gucken. Die Gruppen machen sie mal aus,"}, {"id": 694, "start": 4602.52, "end": 4611.28, "text": "ja. Hätte ich auch machen sollen. Wow, jetzt hat es funktioniert. Ach, nice, jetzt funktioniert"}, {"id": 695, "start": 4611.28, "end": 4619.24, "text": "es. Diese iComparable-Geschichte war es echt komisch. So, dann sag mal hier unten jetzt"}, {"id": 696, "start": 4619.24, "end": 4625.52, "text": "noch, keine Ahnung, auto-expand-groups, aber das habe ich eben doch schon gesagt. Dann"}, {"id": 697, "start": 4625.52, "end": 4632.92, "text": "sag ich es eben noch mal, gucken, ob das jetzt funktioniert. Oh, add, ich musste jetzt echt"}, {"id": 698, "start": 4632.92, "end": 4637.88, "text": "mal was anfassen, klein, blablabla. Es lagged übrigens die Autovervollstellung, weil"}, {"id": 699, "start": 4637.88, "end": 4648.04, "text": "ich ja so viel Zeug drin habe, also ich musste schon mal ein bisschen begrenzen. Warum öffnet"}, {"id": 700, "start": 4648.04, "end": 4657.16, "text": "er die jetzt nicht? Kein Bock. Kann ich so expand, expand, all-group machen wir jetzt."}, {"id": 701, "start": 4657.16, "end": 4666.48, "text": "Okay, er sollte es zwar automatisch machen, aber macht er anscheinend nicht. Wieso machst"}, {"id": 702, "start": 4666.48, "end": 4675.92, "text": "du das nicht einfach über den Debugger? Was soll ich dir sagen? Konsolendebugging ist"}, {"id": 703, "start": 4675.92, "end": 4690.48, "text": "das einzig wahre. So, blablabla, nice. Jetzt geht, jetzt funktioniert es. Okay, man muss"}, {"id": 704, "start": 4690.48, "end": 4701.0, "text": "den Kram danach noch mal explizit sagen, er soll den Kram wieder aufmachen. Okay, ja,"}, {"id": 705, "start": 4701.0, "end": 4708.72, "text": "muss man wissen, muss man wissen. Okay, wir machen jetzt mal eine eigene, links, hier,"}, {"id": 706, "start": 4708.72, "end": 4721.32, "text": "Open, keine Ahnung, ja, Order Form, klar. Also wir müssen das nur an einer Stelle alles"}, {"id": 707, "start": 4721.32, "end": 4740.04, "text": "aufmachen. So, und das da unten machen wir ab, fort, setzen es da durch, weil da kann"}, {"id": 708, "start": 4740.04, "end": 4753.56, "text": "man jetzt auch den anderen Knopf drücken, zack, hinzufügen, select, autocomplete, select,"}, {"id": 709, "start": 4753.56, "end": 4761.8, "text": "laggen wird nicht toleriert, naja, ja, guck da ist es jetzt hier, da wird es hinzufügen,"}, {"id": 710, "start": 4761.8, "end": 4773.24, "text": "also das funktioniert. Gut, das löschen geht glaube ich noch nicht, fuck, bam, in your"}, {"id": 711, "start": 4773.24, "end": 4781.08, "text": "face. Das löschen funktioniert nicht, weil, wobei, muss ich mal gucken, das löschen das"}, {"id": 712, "start": 4781.08, "end": 4785.32, "text": "war jetzt was anderes. Warum programmierst du mit einer nicht über Linux, weil das eine"}, {"id": 713, "start": 4785.32, "end": 4790.28, "text": "Windows Desktop Anwendung ist. Eine Windows Desktop Anwendung ist schwierig über Linux"}, {"id": 714, "start": 4790.28, "end": 4800.36, "text": "zu gebasteln. Oh, neue Bestellung, zack, entfernen, okay, geht nicht, da weiß ich aber bereits"}, {"id": 715, "start": 4800.36, "end": 4804.92, "text": "liegt, dass das nicht geht. Wieso programmierst du mit einer Sampler? Könntest du das auch"}, {"id": 716, "start": 4804.92, "end": 4809.52, "text": "in C machen oder in Go machen oder in JavaScript machen oder in, pass mal auf, in Erlang oder"}, {"id": 717, "start": 4809.52, "end": 4820.24, "text": "in Lisp oder in Kobol oder eventuell auch in Java. Aber wir wollen es ja mal nicht so"}, {"id": 718, "start": 4820.24, "end": 4829.52, "text": "sehr übertreiben jetzt hier, ne. Okay, das Updaten funktioniert. So, das löschen klappt"}, {"id": 719, "start": 4829.52, "end": 4834.72, "text": "nicht, weil, ich weiß warum das löschen nicht klappt, wenn wir nämlich hier draufklicken,"}, {"id": 720, "start": 4834.72, "end": 4843.88, "text": "das ist einfach Delete Selected Records, das, ähm, deletet die Sachen gar nicht. Swift,"}, {"id": 721, "start": 4843.88, "end": 4850.4, "text": "ja, Swift ist nice, also ich hab ganz, ganz wenig, ich hab also wirklich, eigentlich programmiert,"}, {"id": 722, "start": 4850.4, "end": 4855.76, "text": "was dann auch Info auf MyOS gerät gelaufen, jetzt hab ich noch nichts in Swift, aber ich"}, {"id": 723, "start": 4855.76, "end": 4860.88, "text": "hab mir mal ein bisschen Swift Tutorials und, ähm, ich guck mir ab und zu halt auch so die"}, {"id": 724, "start": 4860.88, "end": 4866.44, "text": "aktuellen, von irgendwelchen Konferenzen und so die ganzen Webcasts an. Und ich muss sagen,"}, {"id": 725, "start": 4866.44, "end": 4870.12, "text": "Swift gefällt mir echt gut. Was mir in der ersten oder in der ersten Swift Version ein"}, {"id": 726, "start": 4870.12, "end": 4875.4, "text": "bisschen, bisschen schwer gefallen ist, durchzusteigen, ist, wie das ganze String Handling funktioniert"}, {"id": 727, "start": 4875.4, "end": 4882.88, "text": "mit den unterschiedlichen Encodings. Das war ein bisschen, ähm, da hatten aber mehrere"}, {"id": 728, "start": 4882.88, "end": 4891.12, "text": "Leute das Problem und ich glaub, das ist aber, das haben sie jetzt, äh, schöner gemacht."}, {"id": 729, "start": 4891.12, "end": 4897.08, "text": "Also, okay, wir müssen jetzt erstmal gucken, wie wir hier rauskriegen, was davon Selected"}, {"id": 730, "start": 4897.08, "end": 4909.28, "text": "ist. Data Grid, Selected, Selected, Selected Item, wir haben nur ein Item Selected, mehr"}, {"id": 731, "start": 4909.28, "end": 4921.68, "text": "geht nicht, Selected Item, äh, ich, ich, wir machen jetzt mal eine, wobei, weil die Leute"}, {"id": 732, "start": 4921.68, "end": 4936.8, "text": "hier so auf dem Debugger stehen, aber das halt mal mit dem Debugger, ja. So, wenn ich"}, {"id": 733, "start": 4936.8, "end": 4948.56, "text": "jetzt hier auf löschen klicke, müsste er da anhalten. Löschen, zack. Okay, was steht"}, {"id": 734, "start": 4948.56, "end": 4954.48, "text": "da drinnen? Order, blablub, sehr schön, steht das Richtige drin. Das heißt, wir können"}, {"id": 735, "start": 4954.48, "end": 4967.2, "text": "jetzt hergehen und sagen, ähm, Selected Item wollen wir löschen. Items, remove. Müssen"}, {"id": 736, "start": 4967.2, "end": 4977.8, "text": "wir das casten dafür? Wahrscheinlich müssen wir das casten. So, und jetzt sollte das mit"}, {"id": 737, "start": 4977.8, "end": 4983.36, "text": "dem löschen eigentlich auch funktionieren. Was genau brauchst du da? Wir bauen für Hardware"}, {"id": 738, "start": 4983.36, "end": 4989.68, "text": "gerade ein Tool, wo er mit einem, mit einem Scanner, ähm, neue Seriennummer scannen kann."}, {"id": 739, "start": 4989.68, "end": 4997.16, "text": "Funktion, die Funktionsstar sind die besten, ne? Wo er mit einem Scanner neue, neue Lieferungen"}, {"id": 740, "start": 4997.16, "end": 5000.88, "text": "scannen kann und dann irgendwie in einem halben Jahr gucken kann, welche Seriennummer in welcher"}, {"id": 741, "start": 5000.88, "end": 5009.76, "text": "Lieferung drin war. Also eigentlich soll irgendwie so ein bisschen Tutorial, Tutorial Zeug. Ist"}, {"id": 742, "start": 5009.76, "end": 5016.68, "text": "es das gleiche wie casten? Nee, ist es nicht. Casten, also der cast in Klammern, wenn das"}, {"id": 743, "start": 5016.68, "end": 5023.8, "text": "sich nicht konvertieren lässt, geht direkt kaputt. Ähm, beziehungsweise der, der castet"}, {"id": 744, "start": 5023.8, "end": 5030.32, "text": "einfach auf, ohne Rücksicht auf Verluste. Mit S kommt Null zurück, aber er kackt nicht"}, {"id": 745, "start": 5030.32, "end": 5037.4, "text": "ab, wenn ich das irgendwie. Wobei ich mir jetzt gar nicht sicher bin, es gibt ja verschiedene"}, {"id": 746, "start": 5037.4, "end": 5044.28, "text": "Varianten. Äh, Difference, die Scharp zwischen S ist und cast. Wieso machst du das nicht"}, {"id": 747, "start": 5044.28, "end": 5047.92, "text": "in Python? Warum machst du das nicht in Ruby? Warum machst du das nicht in Go? Warum machst"}, {"id": 748, "start": 5047.92, "end": 5056.12, "text": "du das nicht in JavaScript? Ähm, ja, Python ist nicht unbedingt jetzt das, was ich für"}, {"id": 749, "start": 5056.12, "end": 5075.96, "text": "Winner aus Desktop Software verwenden würde. Ach genau, ist castet nicht, ist guckt nur,"}, {"id": 750, "start": 5075.96, "end": 5081.96, "text": "ist guckt nur und gibt True oder False zurück, ob das Objekt sich cast, nee, nee, ob das Objekt"}, {"id": 751, "start": 5081.96, "end": 5093.32, "text": "dieser spezielle Typ ist. S gibt Null zurück, wenn es sich nicht konvertieren lässt und"}, {"id": 752, "start": 5093.32, "end": 5098.28, "text": "der Casting Operator, also das in Klammern, das richtig casten, dann kackt es direkt ab."}, {"id": 753, "start": 5098.28, "end": 5114.76, "text": "Keylogger, Keylogger ist schon integriert. Ok, mal gucken, ob das mit dem Löschen funktioniert."}, {"id": 754, "start": 5114.76, "end": 5128.52, "text": "Ok, adden, bla bla blub, add add add, mal gucken, was hinzu kommt, save, tak, Räumestellung"}, {"id": 755, "start": 5128.52, "end": 5148.36, "text": "delete, delete, what? What the hell? Warum geht das Löschen nicht? Wonka, Smoke, ich"}, {"id": 756, "start": 5148.36, "end": 5158.96, "text": "hab das Löschen kaputt gemacht. Lebt der Versand-Tracksor noch? Äh, ja, ich hab aber"}, {"id": 757, "start": 5158.96, "end": 5164.48, "text": "nicht weiter gemacht. Wo ist das Problem? Hier, hier, das mag er irgendwie nicht. Warum"}, {"id": 758, "start": 5164.48, "end": 5172.36, "text": "mag er das nicht? Was hat er für Schmerzen jetzt? Was mag er da dran nicht? Ja, da, add"}, {"id": 759, "start": 5172.36, "end": 5181.2, "text": "add add, löschen, add add add, löschen, save, löschen, löschen, ok, also prinzipiell"}, {"id": 760, "start": 5181.2, "end": 5187.64, "text": "funktioniert das noch. Was mag er hier dran jetzt nicht? Liegt da den Funktionsnamen eindeutig,"}, {"id": 761, "start": 5187.64, "end": 5194.04, "text": "eindeutig muss. Außerdem Leute, das sind die absolute next level big brain Funktionsnamen."}, {"id": 762, "start": 5194.04, "end": 5217.04, "text": "Was ist das für Zeichenspart? Hä, the fuck? Ich bin verwirrt. Wir haben doch sogar eben"}, {"id": 763, "start": 5217.04, "end": 5227.48, "text": "nachgeguckt, dass das funktioniert. Ich bin echt verwirrt. Warum geht das Löschen nicht?"}, {"id": 764, "start": 5227.48, "end": 5251.44, "text": "What? Hä? Das muss funktionen, wir haben extra gerade reingeguckt, ob da das Item drin ist,"}, {"id": 765, "start": 5251.44, "end": 5255.4, "text": "aber der macht ja, es ist ja nicht so, also der macht einfach gar nichts oder hab ich"}, {"id": 766, "start": 5255.4, "end": 5276.64, "text": "nicht das Richtige selectet. Doch, hä? What? Das Programmier ist so ein Tool, wo man Seriennummern"}, {"id": 767, "start": 5276.64, "end": 5282.44, "text": "suchen kann, in welcher Bestellung die Seriennummer drin waren. Also eigentlich was kleines. Allerdings"}, {"id": 768, "start": 5282.44, "end": 5288.56, "text": "mit einem UI Framework, was ich im Leben noch nicht verwendet hab. Debugging die Remove Funktion."}, {"id": 769, "start": 5288.56, "end": 5301.28, "text": "Hä? Das check ich jetzt grad nicht. Aber wenn der Cast nicht klappt, dann sollte er zumindest"}, {"id": 770, "start": 5301.28, "end": 5327.08, "text": "Delete Active Item sehen. Guckt hier. Selected Item."}, {"id": 771, "start": 5327.08, "end": 5351.56, "text": "Hä? Selected Item ist das hier. Wartet mal."}, {"id": 772, "start": 5351.56, "end": 5371.68, "text": "Nein. Wartet mal. Ob ich weiß woran das liegt. Das funktioniert. Das funktioniert. Hast du"}, {"id": 773, "start": 5371.68, "end": 5376.84, "text": "zur Zeit eine Freundin? Ja, in den Twitch Chat. Das funktioniert. Ich glaube wir müssen"}, {"id": 774, "start": 5376.84, "end": 5388.04, "text": "einfach nur Refreshen. Ich glaube das funktioniert alles. Ich glaube das funktioniert eigentlich"}, {"id": 775, "start": 5388.04, "end": 5406.88, "text": "alles. Passt mal auf, ich glaube ich weiß woran das liegt. Ha! Oh. Geht nur einmal. Ne."}, {"id": 776, "start": 5406.88, "end": 5414.92, "text": "Es ist ein bisschen kaputt. Oh, da ist ein Fehler im Icon. Ganz schlimm. Neue Bestellung,"}, {"id": 777, "start": 5414.92, "end": 5422.68, "text": "da ist kein Lull drin. Man muss jetzt neu anklicken. Aber ich glaube ich weiß woran"}, {"id": 778, "start": 5422.68, "end": 5432.08, "text": "das liegt. Wenn ich das jetzt mal hinzufüge. So, löschen wir mal irgendwas. Man aktualisiert"}, {"id": 779, "start": 5432.08, "end": 5442.52, "text": "es hier an der Stelle nicht, aber ich weiß woran das gelegen hat. Ich glaube das liegt"}, {"id": 780, "start": 5442.52, "end": 5448.0, "text": "da dran, dass wenn ich es hier lösche, aus dieser Collection mit Items, ich es hier nicht"}, {"id": 781, "start": 5448.0, "end": 5454.96, "text": "mal löschen kann, weil quasi die Sache unten drunter schon weg ist. Weil der hier greift"}, {"id": 782, "start": 5454.96, "end": 5461.36, "text": "da drauf zu. Deswegen versucht das zu löschen und finde das nicht mehr. Also vielleicht"}, {"id": 783, "start": 5461.36, "end": 5468.64, "text": "geht das, vielleicht geht das wenn ich so rum mache. Machen wir noch mal einen Breakpoint"}, {"id": 784, "start": 5468.64, "end": 5487.08, "text": "und gucken nach. Machen wir es mal so rum, vielleicht geht das. Oh. Continue. Ja, es"}, {"id": 785, "start": 5487.08, "end": 5504.12, "text": "ist weg oder? Ich glaube es ist weg. Ne, ist nicht weg. War es weg oder war es nicht"}, {"id": 786, "start": 5504.12, "end": 5522.64, "text": "weg? Das erste. War das erste weg oder nicht weg? War noch vorher eins mehr. Ja doch. Der"}, {"id": 787, "start": 5522.64, "end": 5530.96, "text": "wählt bloß nicht das gleiche wieder aus was vorher selectet war. Na ja gut. Das ist auf"}, {"id": 788, "start": 5530.96, "end": 5534.2, "text": "jeden Fall nicht schön synchronisiert. Ich glaube das müssen wir doch mit irgendeiner"}, {"id": 789, "start": 5534.2, "end": 5539.08, "text": "Data Table machen oder so. Dann muss man den Kram nicht von Hand machen. Na ja, aber"}, {"id": 790, "start": 5539.08, "end": 5552.52, "text": "finde ich schon mal ganz gut. Was ich also nicht ganz verstehe ist, wenn ich jetzt den"}, {"id": 791, "start": 5552.52, "end": 5559.96, "text": "Kram hier hinzufüge. Ja guck das ist nicht gesynkt, das ist nicht gesynkt, das sackt."}, {"id": 792, "start": 5559.96, "end": 5565.72, "text": "Das muss ich anders machen. Das ist Müll. Der löscht das hier, danach löscht das da."}, {"id": 793, "start": 5565.72, "end": 5570.88, "text": "Kann man vielleicht, kann man es vielleicht einfach so machen, dass ich sag hier remove,"}, {"id": 794, "start": 5570.88, "end": 5587.88, "text": "lasse das weg und refresh dann einfach nur. Das funktioniert. Aber was jetzt noch nicht"}, {"id": 795, "start": 5587.88, "end": 5601.32, "text": "geht ist das save und lösche den Kram dann. Das speichert er dann nicht, das kommt nicht"}, {"id": 796, "start": 5601.32, "end": 5608.12, "text": "gelöscht an. Das ist mir jetzt noch nicht ganz klar. Da gucken wir mal, ob ich hier"}, {"id": 797, "start": 5608.12, "end": 5613.68, "text": "irgendwelche Subs übersehen hab. Das ist der Amec. Weiß ja nicht, ob ich das vorgelegt"}, {"id": 798, "start": 5613.68, "end": 5620.88, "text": "haben habe, aber Dankeschön für den Sub. Terox und xFatal. Vier Monate in der Folge."}, {"id": 799, "start": 5620.88, "end": 5634.28, "text": "Huge Sub. Poggers Massive Sub. Das ist Visual Studio. Kostet mittlerweile auch nichts mehr."}, {"id": 800, "start": 5634.28, "end": 5659.68, "text": "Was ich jetzt nicht so ganz kapiere ist, why, wenn ich das update, dass dann nicht gelöscht"}, {"id": 801, "start": 5659.68, "end": 5669.12, "text": "wird. Das ist jetzt free, ja. Eigentlich sollte es an der Stelle alles weggeschmissen werden."}, {"id": 802, "start": 5669.12, "end": 5684.2, "text": "Ja, die Community Edition ist free, also das was du brauchst ist im Endeffekt free. Ich"}, {"id": 803, "start": 5684.2, "end": 5688.24, "text": "weiß gar nicht so genau, was der Unterschied ist aktuell zwischen Visual Studio Community"}, {"id": 804, "start": 5688.24, "end": 5693.0, "text": "und nicht Community. Früher war es mal diese, ich glaube diese Codesave, nee, nee, wie"}, {"id": 805, "start": 5693.0, "end": 5700.0, "text": "hieß das? Team Studio, nee, fuck. Diese komische Microsoft Source Code Verwaltung, die eh"}, {"id": 806, "start": 5700.0, "end": 5705.24, "text": "keiner verwendet hat, war glaube ich ein paar Code Analyse Sachen sind wohl glaube ich auch"}, {"id": 807, "start": 5705.24, "end": 5711.52, "text": "auf Professional festgelegt. Azure Integration ist glaube ich auch nur bei Professional, aber"}, {"id": 808, "start": 5711.52, "end": 5729.2, "text": "ansonsten ist das meiste brauchst du davon eh nicht. Wir können ja mal gucken. Community"}, {"id": 809, "start": 5729.2, "end": 5742.84, "text": "Professional. There is no difference between Community or Professional when using Unity"}, {"id": 810, "start": 5742.84, "end": 5752.84, "text": "Engine. Ok, wir wollen nicht Unity. Compare Visual Studio Offerings. Ok, guck mal was"}, {"id": 811, "start": 5752.84, "end": 5759.84, "text": "da. Usage Scenarios, Enterprise, was auch immer sich dahinter verbirgt, man weiß es"}, {"id": 812, "start": 5759.84, "end": 5767.88, "text": "nicht. Ach nett Cody, das Geflame gegen Unity finde ich unberechtigt. Das sind die Spieleentwickler,"}, {"id": 813, "start": 5767.88, "end": 5772.28, "text": "die kacke entwickeln und nicht Unity. Das ist genauso wie mit Java, über Java mache"}, {"id": 814, "start": 5772.28, "end": 5775.96, "text": "ich mich auch immer gerne lustig und man kann auch in Java viele ordentliche Software programmieren."}, {"id": 815, "start": 5775.96, "end": 5790.04, "text": "Sir of Jelly, da würde ich komplett unterschiedliche Sachen für verwenden. Java in Visual Studio"}, {"id": 816, "start": 5790.04, "end": 5796.36, "text": "ist nicht so tolle. Python in Visual Studio geht mittlerweile zwar, aber hält sich in"}, {"id": 817, "start": 5796.36, "end": 5802.2, "text": "Grenzen. C geht wahrscheinlich auch, aber gibt es wahrscheinlich auch besseres. Also"}, {"id": 818, "start": 5802.2, "end": 5808.6, "text": "Visual Studio würde ich eigentlich nur verwenden für Winners Anwendungen, also sprich F Sharp,"}, {"id": 819, "start": 5808.6, "end": 5821.48, "text": "C Sharp. Was geht denn noch schön in Visual Studio? Die Microsoft C++ Geschichten. Mittlerweile"}, {"id": 820, "start": 5821.48, "end": 5828.44, "text": "geht glaube ich auch JavaScript ganz gut. VB, genau, Visual Basic habe ich ja komplett"}, {"id": 821, "start": 5828.44, "end": 5833.44, "text": "vergessen, falls es heute noch jemand verwendet überhaupt. Verwendet jemand noch Visual Basic?"}, {"id": 822, "start": 5833.44, "end": 5842.36, "text": "Golang und Ruby, echt? Geht nicht gut in Visual Studio. Also ich habe mal vor ein paar Jahren"}, {"id": 823, "start": 5842.36, "end": 5850.04, "text": "versucht Ruby in Visual Studio zu programmieren, das war nicht schön. Ja PyCharm ist gut."}, {"id": 824, "start": 5850.04, "end": 5859.64, "text": "Ihoden Rakete verwendet VBA, ja das wundert mich nicht bei dem Namen. Mit VBA das geht"}, {"id": 825, "start": 5859.64, "end": 5869.88, "text": "ab wie Rakete, aber. VBA, weiß gar nicht welche Software heute noch VBA, aber Excel, Excel"}, {"id": 826, "start": 5869.88, "end": 5880.28, "text": "verwendet vor allem VBA. Und jetzt ganze Office, ganze Office gedönnt, oder? Ganze Office gedönnt"}, {"id": 827, "start": 5880.28, "end": 5892.84, "text": "ist glaube ich noch VBA. Access Formulare, oh alter. Access Formulare. Ich verwende keine"}, {"id": 828, "start": 5892.84, "end": 5902.52, "text": "Access Formulare, ich verwende nur CSV. CSV, Master Race, beste. Visual Basic ist doch"}, {"id": 829, "start": 5902.52, "end": 5908.84, "text": "eh genau gleich wie C Sharp, nur dass man statt Klammern eben Then und End If benutzt. Genau."}, {"id": 830, "start": 5908.84, "end": 5916.52, "text": "Viele Sachen, viele neueren Features, die sie jetzt da entwickeln bei Microsoft. Es"}, {"id": 831, "start": 5916.52, "end": 5920.88, "text": "ist ja nicht mehr direkt gesyncht, C Sharp Version und.NET Release, aber C Sharp kriegt"}, {"id": 832, "start": 5920.88, "end": 5926.64, "text": "eindeutig mehr Liebe als Visual Studio. Und ein paar Sachen, ich hab sogar letztes Mal"}, {"id": 833, "start": 5926.64, "end": 5931.08, "text": "in irgendeinem Webcast da drüber gesehen, sind bis heute nicht in Visual Basic angekommen."}, {"id": 834, "start": 5931.08, "end": 5943.36, "text": "Unter der Haube, was da als IL Code rausfällt, das dürfte ziemlich das gleiche sein. Arbeiten"}, {"id": 835, "start": 5943.36, "end": 5948.56, "text": "die überhaupt noch an VB.NET? Sie haben nie das Gegenteil behauptet. Wahrscheinlich so"}, {"id": 836, "start": 5948.56, "end": 5955.52, "text": "ein bisschen wie bei Windows Phone. Ok, also was erzählt es? Live Dependency Validation."}, {"id": 837, "start": 5955.52, "end": 5964.28, "text": "Ok, ich weiß nicht mal was es ist, deswegen geh ich mal voll aus, ich brauch das nicht."}, {"id": 838, "start": 5964.28, "end": 5982.84, "text": "Das ist Live Dependency Validation. Azure, Azure DevOps Lab. Ok, Azure Zeug, das brauch"}, {"id": 839, "start": 5982.84, "end": 5988.6, "text": "ich schon mal nicht. Ich muss übrigens noch, Leute, wir müssen noch ein bisschen was in"}, {"id": 840, "start": 5988.6, "end": 5992.2, "text": "Azure machen, fällt mir gerade ein, in einem der nächsten Streams so ein bisschen in Azure"}, {"id": 841, "start": 5992.2, "end": 5999.72, "text": "herumklicken, weil ich hab noch 90 Euro auf meinem Azure Account drauf und es verfällt"}, {"id": 842, "start": 5999.72, "end": 6013.32, "text": "in 11 Tagen. Da müssen wir noch ein bisschen, da legen wir uns mal ne 120 Core Kiste an"}, {"id": 843, "start": 6013.32, "end": 6025.4, "text": "Azure und lassen die 2 Sekunden laufen, dann ist das Geld all. Hast du nicht auch noch"}, {"id": 844, "start": 6025.4, "end": 6038.8, "text": "Geld auf Fiverr? Doch, 120 Euro oder so, weil die alle abgesagt haben. Ah, also gth44,"}, {"id": 845, "start": 6038.8, "end": 6046.0, "text": "was ist es überhaupt? Ich kann mir da überhaupt nichts darunter vorstellen. Live, also man"}, {"id": 846, "start": 6046.0, "end": 6051.8, "text": "kann Live irgendwelche Abhängigkeiten überprüfen, was sagt uns das? Keine Ahnung. Ok, man kann"}, {"id": 847, "start": 6051.8, "end": 6062.32, "text": "irgendwelche Diagramme erstellen, das brauch ich auf jeden Fall nicht. Das Design irgendwie,"}, {"id": 848, "start": 6062.32, "end": 6069.28, "text": "den Aufbau irgendwie überprüfen, was auch immer es ist, keine Ahnung. Code Clone, auch"}, {"id": 849, "start": 6069.28, "end": 6076.64, "text": "keine Ahnung, was das sein soll. Code Lens, das kenn ich, das ist so ein Code Analyzer"}, {"id": 850, "start": 6076.64, "end": 6087.08, "text": "von Microsoft, der dir dann teilweise sagt, hier an der Stelle ist per Style Guide, keine"}, {"id": 851, "start": 6087.08, "end": 6093.48, "text": "Ahnung, ein Simikolon vorgesehen oder eine Komma oder irgendwie man schreibt die Ifs"}, {"id": 852, "start": 6093.48, "end": 6097.12, "text": "am Anfang und nicht am Ende oder irgendwie sowas, das glaube ich Code Lens. Übrigens"}, {"id": 853, "start": 6097.12, "end": 6105.48, "text": "Leute hier, was auch witzig ist, was komisch ist, Rishel Studio hier, ach nee, es ist auch"}, {"id": 854, "start": 6105.48, "end": 6111.8, "text": "nicht wirklich schneller, die haben irgendwas mit der aktuellen Version gemacht, die haben"}, {"id": 855, "start": 6111.8, "end": 6122.24, "text": "irgendwas mit der aktuellen Version gemacht, dass, nee hier gehts, hier gehts. Auf meinem"}, {"id": 856, "start": 6122.24, "end": 6127.64, "text": "Main Account ist die Autovervollständigung so übertrieben langsam geworden, ich weiß"}, {"id": 857, "start": 6127.64, "end": 6135.92, "text": "gar nicht woran das liegt und ich hab schon den ganzen, bis der standardmäßig dabei"}, {"id": 858, "start": 6135.92, "end": 6141.64, "text": "ist, deaktiviert. Weiß ich gar nicht woran das liegt, warum mein Main Account so langsam"}, {"id": 859, "start": 6141.64, "end": 6150.28, "text": "ist. So, wir wollen ja noch gucken, was der Unterschied ist. Peak Definition, ja gut,"}, {"id": 860, "start": 6150.28, "end": 6163.64, "text": "das geht bei allem. Advanced Debugging, Konsole, beste. Intellitrace, ich hab aber, nee, noch"}, {"id": 861, "start": 6163.64, "end": 6169.4, "text": "nicht mal, Rishel ist alles aus auf meinem Main Account, also Main Windows Account, aber"}, {"id": 862, "start": 6169.4, "end": 6179.52, "text": "da leckt IntelliSense übelst rum. Ey, meine tollen Funktionsnamen, Leute, ich hab das"}, {"id": 863, "start": 6179.52, "end": 6182.72, "text": "in zwei Stunden, bevor ich jetzt, ich bin direkt danach angegangen, als es halbwegs"}, {"id": 864, "start": 6182.72, "end": 6186.88, "text": "funktioniert hat, den Kram hier zusammen gewurstet, ja, was man machen können. Kann"}, {"id": 865, "start": 6186.88, "end": 6192.36, "text": "ich mir jetzt nicht auch noch tolle Funktionsnamen überlegen, weil. Code Map Debugger Integration."}, {"id": 866, "start": 6192.36, "end": 6204.6, "text": "Source Map kenne ich, weiß nicht, was ein Code Map ist. Der Antivirus, das könnte sein,"}, {"id": 867, "start": 6204.6, "end": 6207.68, "text": "wobei ich Windows Defender sowohl hier als auch auf dem anderen habe, aber das könnte"}, {"id": 868, "start": 6207.68, "end": 6216.92, "text": "sein. Vielleicht muss ich einfach nur mal den Windows Trick machen und Rishel Studio"}, {"id": 869, "start": 6216.92, "end": 6230.2, "text": "deinstallieren und neu installieren. Das hilft bestimmt..NET Core Memory, okay, das"}, {"id": 870, "start": 6230.2, "end": 6238.48, "text": "brauche ich, das habe ich zum Glück noch nie gebraucht. Code Matrix. Snapshot Debugger,"}, {"id": 871, "start": 6238.48, "end": 6247.12, "text": "Time Travel Debugging. Alter, das liest sich mal absolut next level. Time Travel Debugging."}, {"id": 872, "start": 6247.12, "end": 6262.16, "text": "Wie darf man sich das vorstellen? Zurück in die Zukunft mäßig, oder was? IntelliTest,"}, {"id": 873, "start": 6262.16, "end": 6268.8, "text": "weiß ich auch nicht, was es ist. Live Unit Testing, kann man dann der Qt Chat dabei zugucken,"}, {"id": 874, "start": 6268.8, "end": 6285.68, "text": "wie die Tests durchlaufen. Cross Platform. Samarien brauche ich nicht. Also, man sieht,"}, {"id": 875, "start": 6285.68, "end": 6307.64, "text": "was fehlt an Rishel Studio Community zu Enterprise ist nicht wirklich wichtig. Ich muss mir"}, {"id": 876, "start": 6307.64, "end": 6313.6, "text": "das aber in Ruhe noch mal ein bisschen überlegen, wie wir das machen mit dem Schreiben in die"}, {"id": 877, "start": 6313.6, "end": 6317.52, "text": "Datenbank beziehungsweise das Updaten und Lesen. Das ist, so wie ich es jetzt zusammen"}, {"id": 878, "start": 6317.52, "end": 6325.4, "text": "gewusstet habe, auf jeden Fall nicht der Weisheiterschluss. Wir nehmen lieber doch eine Data Table und"}, {"id": 879, "start": 6325.4, "end": 6334.92, "text": "wir nehmen irgendwas, wo man nicht laufend Refresh aufrufen muss, sondern was automatisch"}, {"id": 880, "start": 6334.92, "end": 6349.6, "text": "checkt, bin refreshed und so. Mal gucken. Aber was ich immer noch nicht ganz checke ist,"}, {"id": 881, "start": 6349.6, "end": 6357.36, "text": "warum der hier, das hat damit nichts zu tun, warum der hier die Sachen nicht updatet."}, {"id": 882, "start": 6357.36, "end": 6368.56, "text": "Sollte er hier eigentlich die Sachen updaten? Das gucken wir uns jetzt gleich schon mal an."}, {"id": 883, "start": 6368.56, "end": 6388.48, "text": "Bloop Chat. Fügen wir ein paar Dinge hinzu. Saven, gesaved. Und jetzt sollte er die eigentlich"}, {"id": 884, "start": 6388.48, "end": 6409.32, "text": "auslegen. Kann das? Passt. Ok. Order. Items. Drei. Passt doch. Warum macht er das nicht?"}, {"id": 885, "start": 6409.32, "end": 6421.52, "text": "Aber der macht prinzipiell schon das Richtige. Aber hier refresht er den Kram nicht. Warum"}, {"id": 886, "start": 6421.52, "end": 6428.56, "text": "denn das nicht? Der müsste das doch refreshen. Warum refresht er das nicht? Warum refresht"}, {"id": 887, "start": 6428.56, "end": 6444.08, "text": "er das nur beim adden? Ok, ne, das ist irgendwie von der Logik her von Arsch. Bezahl einfach"}, {"id": 888, "start": 6444.08, "end": 6449.28, "text": "wen auf Fiverr. Alter, auf Fiverr, die haben mir noch nicht mal einen Twitch Chatlogger"}, {"id": 889, "start": 6449.28, "end": 6469.04, "text": "hingekriegt. Den Controls gescheite Namen geben, ja. BattleLP Twitch Prime, Dankeschön. Irgendwie"}, {"id": 890, "start": 6469.04, "end": 6495.28, "text": "das hier rum. Er saved das? Der data das doch richtig. Xdafuck Twitch Prime. Dankeschön,"}, {"id": 891, "start": 6495.28, "end": 6508.24, "text": "nice. Big Brain. Wie ist denn das? Ist das irgendeine EF Core Geschichte vielleicht?"}, {"id": 892, "start": 6508.24, "end": 6524.0, "text": "Dass man. Na gut. Ok, ich muss mal was eintragen, was ich auch wieder finde. Ähm. Ist das"}, {"id": 893, "start": 6524.0, "end": 6531.08, "text": "vielleicht eine EF Core Geschichte? Dass der die Sachen nicht löscht? Als Abhängigkeit"}, {"id": 894, "start": 6531.08, "end": 6537.68, "text": "dann könnte das sein. Also wir haben jetzt ja nachgeguckt, dass das löschen prinzipiell"}, {"id": 895, "start": 6537.68, "end": 6542.96, "text": "richtig funktioniert. So, Moment, äh, mach das nochmal zu. Wir benennen das jetzt mal"}, {"id": 896, "start": 6542.96, "end": 6549.44, "text": "so, dass ich, dass ich's finde hier. Keine Ahnung. Äh, hallo. Hallo und dann fügen wir"}, {"id": 897, "start": 6549.44, "end": 6559.84, "text": "hier was hinzu. So, save. Funktioniert. So, wir löschen jetzt alles bis auf drei. Save."}, {"id": 898, "start": 6559.84, "end": 6566.32, "text": "So, und wir haben gerade nachgeguckt. Ähm, das funktioniert. Kann das sein, dass EF Core"}, {"id": 899, "start": 6566.32, "end": 6573.76, "text": "das nicht löscht, wenn ich's eben nicht explizit sage? Weil, es ist ja so, ich update hier"}, {"id": 900, "start": 6573.76, "end": 6581.08, "text": "zwar die Order, aber was ich gemacht habe sind, ähm, quasi Sachen aus Items löschen."}, {"id": 901, "start": 6581.08, "end": 6585.6, "text": "Muss man, muss man das dem irgendwie explizit sagen, dass er das, dass er das löschen soll?"}, {"id": 902, "start": 6585.6, "end": 6590.84, "text": "Aber gucken wir mal. Gucken wir mal mit dem SQL Explorer, was denn, was da hinten jetzt"}, {"id": 903, "start": 6590.84, "end": 6611.4, "text": "rausgekommen ist. Borders, hallo, 23. Tatsächlich, der löscht das nicht. Ähm. Muss Max jetzt"}, {"id": 904, "start": 6611.4, "end": 6625.6, "text": "das Fiverr Projekt zeigen? Ich weiß gar nicht, ob ich da hinkomme. Dann müssen wir uns jetzt"}, {"id": 905, "start": 6625.6, "end": 6644.32, "text": "auf Fiverr einloggen, Klei. Ey Leute, wollen wir uns jetzt Fiverr angucken? Fiverr? Da gibt's"}, {"id": 906, "start": 6644.32, "end": 6651.88, "text": "aber nicht so viel zu gucken. Okay, da müsst ihr mir jetzt helfen. Da müsst ihr mir erstmal"}, {"id": 907, "start": 6651.88, "end": 6658.92, "text": "hier das, das Problem müssen wir jetzt noch fixen und dann gucken wir uns Fiverr an. Also,"}, {"id": 908, "start": 6658.92, "end": 6663.76, "text": "das ist irgendeine Konfigurationsgeschichte von mir, weil ich zu smallbrain bin. Ich hab"}, {"id": 909, "start": 6663.76, "end": 6671.84, "text": "hier eine Order mit Items drinne. So. Und wenn ich da, wenn ich dort jetzt Items lösche"}, {"id": 910, "start": 6671.84, "end": 6676.04, "text": "und sag meiner Datenbank, update mal diese Order, dann löscht er nicht die Items da"}, {"id": 911, "start": 6676.04, "end": 6694.24, "text": "raus. Er fügt sie nur hinzu. Was muss ich EF Core sagen, dass der das macht? Da müssen"}, {"id": 912, "start": 6694.24, "end": 6719.84, "text": "wir Google fragen. Child Collection. Da, da ist doch hier die Frage. Was? Aha. Okay,"}, {"id": 913, "start": 6719.84, "end": 6730.36, "text": "oder löschen oder hinzufügen. Ah, der hat aber Recht, was er hier schreibt. Ich glaube,"}, {"id": 914, "start": 6730.36, "end": 6746.08, "text": "daran liegt das, weil meine Order, glaube ich, weiß woran das liegt. Meine Order setze"}, {"id": 915, "start": 6746.08, "end": 6756.28, "text": "ich, setze ich hier. Die kommt nicht, die kommt nicht aus dem, aus dem DB-Kontext und"}, {"id": 916, "start": 6756.28, "end": 6763.76, "text": "dementsprechend trackt er auch meine Changes nicht. Das heißt, wenn ich will, dass das"}, {"id": 917, "start": 6763.76, "end": 6777.36, "text": "funktioniert, wenn ich will, dass es funktioniert, muss ich das Ganze hier nochmal irgendwie"}, {"id": 918, "start": 6777.36, "end": 6784.96, "text": "aus dem DB-Kontext laden oder so und dann löschen. Und dann wird es wahrscheinlich"}, {"id": 919, "start": 6784.96, "end": 6800.16, "text": "funktionieren. So. Das kommt nicht aus dem Change-Tracker hier beziehungsweise nicht"}, {"id": 920, "start": 6800.16, "end": 6829.6, "text": "aus dem DB-Kontext. Attach-Method. Aha. Nee. Geht das Attach?"}, {"id": 921, "start": 6829.6, "end": 6859.52, "text": "So. Kann man das, kann man das einfach so?"}, {"id": 922, "start": 6859.52, "end": 6876.76, "text": "Kann man das einfach so machen? Nee, oder? Kann man nicht einfach so machen, oder? Das"}, {"id": 923, "start": 6876.76, "end": 6896.68, "text": "funktioniert bestimmt nicht. Nee, nee, nee, funktioniert so nicht. Sehr gut, dann muss"}, {"id": 924, "start": 6896.68, "end": 6900.96, "text": "ich mir das nochmal in Ruhe überlegen. Oder gucken wir uns jetzt gleich Fiverr an, würde"}, {"id": 925, "start": 6900.96, "end": 6907.68, "text": "ich sagen. Ich muss gucken, dass das, ich muss, ich muss das mit, ich muss das anders"}, {"id": 926, "start": 6907.68, "end": 6912.96, "text": "machen. Ich weiß, ich weiß, wie ich das machen muss. Und zwar ich übergebe hier nicht die"}, {"id": 927, "start": 6912.96, "end": 6922.64, "text": "Order, sondern ich übergebe die Order-ID und lade mir den Kram dann, ja, und lade mir"}, {"id": 928, "start": 6922.64, "end": 6940.92, "text": "dann den Kram raus aus dem, aus dem, aus dem DB-Kontext. Müsste ich, das müsste ich hier"}, {"id": 929, "start": 6940.92, "end": 6945.6, "text": "eigentlich machen. Irgendwie so. Da muss ich mal gucken. Wollte mal gucken, wie wir das"}, {"id": 930, "start": 6945.6, "end": 6952.96, "text": "machen. Okay, also gucken wir uns mal Fiverr an. Wir sind ja schon wieder eine Weile on,"}, {"id": 931, "start": 6952.96, "end": 6956.08, "text": "ne? Nachdem ich da schon mal zwei Stunden am Stück vorher das Ding zusammen gewurstet"}, {"id": 932, "start": 6956.08, "end": 6976.04, "text": "hab. Ja, also. Dann loggen wir uns mal ein auf Fiverr. Ich muss, es kann aber sein, dass"}, {"id": 933, "start": 6976.04, "end": 6987.52, "text": "ich euch ausstellen muss, weil ich nicht weiß, was ich über Fiverr registriert hab. Hatten"}, {"id": 934, "start": 6987.52, "end": 7002.8, "text": "wir nicht das Fiverr Projekt hier schon mal runtergeladen oder so? Ne, ne? Okay, Fiverr,"}, {"id": 935, "start": 7002.8, "end": 7016.24, "text": "Fiverr. Also, für alle, die sich mitgekriegt haben, ich habe mal vor einer Weile ein Tool"}, {"id": 936, "start": 7016.24, "end": 7022.32, "text": "programmiert für den Twitch-Chat, was einfach den kompletten Twitch-Chat mitschneidet und"}, {"id": 937, "start": 7022.32, "end": 7033.52, "text": "schaut, was mich erwähnt. Glaube, das gab es hier. Contains and Wobblers. Ne, das ist"}, {"id": 938, "start": 7033.52, "end": 7041.12, "text": "das nicht das Richtige. Das heißt zwar Twitch-Chat, aber das ist nicht das Richtige. Was war das"}, {"id": 939, "start": 7041.12, "end": 7062.88, "text": "Richtige? Kurz gucken, wie das wirkt. Boah, jaja. Okay. TestNet3, wirklich Net3 genannt,"}, {"id": 940, "start": 7062.88, "end": 7080.2, "text": "natürlich wieder typischer Max-Big-Brain-Name. Das Ding Net3 heißt. Ja, das ist es. Also,"}, {"id": 941, "start": 7080.2, "end": 7093.6, "text": "starten. Kostet weiter nicht den Haufen Geld, doch. Ich verwende einfach immer die Lizenz"}, {"id": 942, "start": 7093.6, "end": 7100.64, "text": "zum Trial. Okay, ich zeige euch jetzt mal das Tool, was ich dort in Auftrag gegeben"}, {"id": 943, "start": 7100.64, "end": 7111.08, "text": "habe. Ich glaube aber, ich habe es kaputt gemacht bei mir. Welcher Port tauscht das"}, {"id": 944, "start": 7111.08, "end": 7121.92, "text": "standardmäßig? Steht da irgendetwas da? 5000. Also, so sieht das aus, was ich da gebastelt"}, {"id": 945, "start": 7121.92, "end": 7134.52, "text": "habe. Also, im Prinzip, nichts großartig kompliziertes. Ein Tool, was alle Twitch-Chat-Fragen mitloggt,"}, {"id": 946, "start": 7134.52, "end": 7138.52, "text": "die an mich gehen, sodass ich keine Fragen mehr übersehe, mit einem Knopf dahinter,"}, {"id": 947, "start": 7138.52, "end": 7152.64, "text": "um die Sache zu löschen. Und, das, wie man hier sieht, ist nicht sonderlich viel. Das"}, {"id": 948, "start": 7152.64, "end": 7168.28, "text": "sind so 100, 200, so 200, 250 Zeilen inklusive HTML und allem Boilerplate, was man so braucht."}, {"id": 949, "start": 7168.28, "end": 7174.28, "text": "Also, es ist nicht großartig kompliziert und man sieht es hier auch, es ist ziemlich"}, {"id": 950, "start": 7174.28, "end": 7178.88, "text": "übersichtlich, was man dafür machen muss. Also, Web-Anwendung und auch das HTML ist"}, {"id": 951, "start": 7178.88, "end": 7185.36, "text": "wirklich super easy. Also, sieht man, das sollte für jemanden, der ein bisschen geübt"}, {"id": 952, "start": 7185.36, "end": 7192.6, "text": "ist, echt kein großer Akt sein. Will einer Black Ops 1 Key verschenken? Wo es das günstig"}, {"id": 953, "start": 7192.6, "end": 7199.72, "text": "gibt? Guck mal, irgendwie bei G2A, Kinguin oder irgendwie so komischen Key-Shops. Also,"}, {"id": 954, "start": 7199.72, "end": 7208.24, "text": "es ist nicht sonderlich schwierig. So, und ich bin auf Fiverr gegangen und hab nach den"}, {"id": 955, "start": 7208.24, "end": 7217.56, "text": "günstigsten Programmierern gesucht, die versprechen, eine vollständige ASP.NET-Anwendung zu programmieren."}, {"id": 956, "start": 7217.56, "end": 7224.52, "text": "So, ich muss mich jetzt mal einloggen. Fiverr ist eine Plattform, wo du kreative Leute"}, {"id": 957, "start": 7224.52, "end": 7239.04, "text": "beauftragen kannst, Dinge für dich zu machen. So, ich muss jetzt erstmal hier kurz gucken,"}, {"id": 958, "start": 7239.04, "end": 7263.44, "text": "wie mein Passwort für Fiverr ist. Okay Leute, muss ich mal kurz ausblenden, wenn ich sicher"}, {"id": 959, "start": 7263.44, "end": 7276.32, "text": "bin, ob das hier funktioniert. Soll ich mal gucken, ob das auch noch funktioniert."}, {"id": 960, "start": 7276.32, "end": 7305.76, "text": "Okay, don't save. Bin eingeloggt bei Fiverr. Kannst du einen Passwortmanager empfehlen?"}, {"id": 961, "start": 7305.76, "end": 7310.4, "text": "Ja, ich verwende immer noch Key-Pass. Seit Jahren schon. Damit fahre ich eigentlich auch"}, {"id": 962, "start": 7310.4, "end": 7318.28, "text": "ganz gut. So, also, denk dran, das hier sollte rauskommen. Eine simple Web-Anwendung, die"}, {"id": 963, "start": 7318.28, "end": 7326.96, "text": "Chat mitloggt auf Twitch. So, und ich hab mir bei Fiverr Leute rausgesucht. Guck mal,"}, {"id": 964, "start": 7326.96, "end": 7335.04, "text": "120 Euro hab ich noch auf Fiverr, weil die alle wieder zurückgezogen haben. Ich ändere"}, {"id": 965, "start": 7335.04, "end": 7362.2, "text": "mal den Titel auf Fiverr. So, und ich hab mir Leute rausgesucht. Guck mal, hier Orders."}, {"id": 966, "start": 7362.2, "end": 7383.36, "text": "Cancelled, Cancelled, Cancelled, Cancelled. Messages. Inboard. Wo sind denn die Messages"}, {"id": 967, "start": 7383.36, "end": 7394.28, "text": "von den Typen? Ja, also, ich hab mir hier Leute rausgesucht,"}, {"id": 968, "start": 7394.28, "end": 7404.28, "text": "wie Ahmed zum Beispiel, der halt gesagt hat, ich programmiere euch eine komplette ASP.NET"}, {"id": 969, "start": 7404.28, "end": 7410.6, "text": "Core Web-Applikation, überhaupt kein Problem. Da hab ich ihm halt erklärt, was ich haben"}, {"id": 970, "start": 7410.6, "end": 7416.4, "text": "wollte. Und gibt es hier keine ordentlichen Messages-Übersicht eigentlich bei Fiverr oder"}, {"id": 971, "start": 7416.4, "end": 7423.48, "text": "nicht? Ah, hier, View All Orders. Da, jetzt kann ich es euch zeigen. Completed. Genau,"}, {"id": 972, "start": 7423.48, "end": 7427.64, "text": "und hab ich ihm beschrieben, was ich haben will. Nämlich halt sowas hier. Im Prinzip"}, {"id": 973, "start": 7427.64, "end": 7433.04, "text": "eine Web-Anwendung, die sie bauen können, wie sie wollen, was sie dafür verwenden, ist"}, {"id": 974, "start": 7433.04, "end": 7437.2, "text": "mir eigentlich egal. Hauptsache sie verwenden ASP.NET Core im Backend, weil ich hab mir"}, {"id": 975, "start": 7437.2, "end": 7443.72, "text": "halt ASP.NET Core Entwickler rausgesucht und hab ihnen gesagt, hier, mach einfach, mach"}, {"id": 976, "start": 7443.72, "end": 7451.32, "text": "einfach, mach wie du willst. Ich will den Tool haben, was Twitch Chat mitguckt, ob ich"}, {"id": 977, "start": 7451.32, "end": 7458.6, "text": "angeschrieben werde. Ganz einfach. So, es haben von 11 Leute, die ich angeschrieben"}, {"id": 978, "start": 7458.6, "end": 7467.4, "text": "habe, haben 10 Leute gecancelt. Ich mein, ich kanns verstehen. Ich würde das für 6,67"}, {"id": 979, "start": 7467.4, "end": 7474.6, "text": "Euro auch nicht machen. Also ich würde den Rechner für 6,67 Euro noch nicht mal hochfahren."}, {"id": 980, "start": 7474.6, "end": 7485.96, "text": "Dafür. Ich kann verstehen, dass sie alle abgesagt haben. Aber sie haben alle in ihrem Profil"}, {"id": 981, "start": 7485.96, "end": 7494.64, "text": "drinstehen, dass sie sowas machen. Und wer reinschreibt, dass man für 6,67 Euro any"}, {"id": 982, "start": 7494.64, "end": 7501.88, "text": "kind of ASP.NET MVC or Core Application developed, dann sollte man es vielleicht nicht reinschreiben."}, {"id": 983, "start": 7501.88, "end": 7520.76, "text": "Aber es steht halt drin. Ja, es ist im Prinzip viel heiße Luft und nichts dahinter. Zumindest"}, {"id": 984, "start": 7520.76, "end": 7529.32, "text": "haben die alle abgesagt. Der eine war richtig cool. Ich weiß jetzt gar nicht, welcher das"}, {"id": 985, "start": 7529.32, "end": 7557.08, "text": "gewesen ist. War das der hier? Nein. War das der hier? Nein, das war der hier. Nein, das"}, {"id": 986, "start": 7557.08, "end": 7570.32, "text": "war der hier. Okay, der hat gleich gecancelt. Der hier, genau. Ich hab denen übrigens auch"}, {"id": 987, "start": 7570.32, "end": 7574.64, "text": "allen einen Hinweis gegeben. Ich hab denen den Hinweis gegeben, wenn sie nicht weiter"}, {"id": 988, "start": 7574.64, "end": 7579.08, "text": "wussten. Wobei ich eigentlich ganz ehrlich davon ausgegangen wäre, dass ein guter Programmierer"}, {"id": 989, "start": 7579.08, "end": 7587.44, "text": "das selber rauskriegt. Ich hab denen alle noch den Hinweis gegeben, dass soweit ich"}, {"id": 990, "start": 7587.44, "end": 7595.08, "text": "weiß, Twitch einen IRC Chat anbietet, den man anonym benutzen kann. Das hab ich allen,"}, {"id": 991, "start": 7595.08, "end": 7599.08, "text": "die gesagt haben, sie wissen nicht genau, was ich will, was ich mach. Das hab ich denen"}, {"id": 992, "start": 7599.08, "end": 7609.6, "text": "allen gesagt, weil ich hatte das Gefühl, es hat da keiner so richtig gecheckt, wie er"}, {"id": 993, "start": 7609.6, "end": 7622.76, "text": "das machen soll. Der Typ hier war eh geil. Ich hab ihm gesagt, ich geb ihm sogar noch"}, {"id": 994, "start": 7622.76, "end": 7629.88, "text": "Trinkgeld, wenn er's extra macht. Und jetzt kommt halt die Frage, how much is your budget?"}, {"id": 995, "start": 7629.88, "end": 7638.68, "text": "Er hat's für 11,43 Euro reingestellt. Dann hab ich gesagt, 50 Euro maximal. Und der andere"}, {"id": 996, "start": 7638.68, "end": 7661.44, "text": "kommt, ich will 700 Euro. Der will's wissen. No. Das ist schon geil, ne? Lass mal halt"}, {"id": 997, "start": 7661.44, "end": 7665.4, "text": "so Dinger reinschreiben. Mal gucken, was mittlerweile im Profil steht. Sein Profil geupdatet."}, {"id": 998, "start": 7665.4, "end": 7676.68, "text": "Ach, guck mal. Das gibt's überhaupt nicht mehr. Das ist was anderes. Der hat jetzt"}, {"id": 999, "start": 7676.68, "end": 7687.44, "text": "sein Profil geupdatet. Ich mein, aber komm. I will create a custom web solution for your"}, {"id": 1000, "start": 7687.44, "end": 7696.44, "text": "business needs. Da kann man das schon drunter vorstellen. Single page application. Er hat"}, {"id": 1001, "start": 7696.44, "end": 7702.36, "text": "alles reingeschrieben, was man braucht. So, 9,40 Euro. Und dann will er 700 Euro. Bam,"}, {"id": 1002, "start": 7702.36, "end": 7707.08, "text": "in your face. Ich hab denen aber übrigens alle keinen Stress gemacht. So was erlaubt"}, {"id": 1003, "start": 7707.08, "end": 7711.32, "text": "wahrscheinlich nicht. Wahrscheinlich ist es auch gegen die Pfeiffer-Regeln, aber ich"}, {"id": 1004, "start": 7711.32, "end": 7718.76, "text": "mein, okay, erst. Und ich hab ja halt gesagt, okay, übrigens mein Name ist der beste. Ich"}, {"id": 1005, "start": 7718.76, "end": 7730.0, "text": "heiße Max Lull, aber stelle mich immer als Peter Lull vor. Als Peter Lull oder Peter"}, {"id": 1006, "start": 7730.0, "end": 7743.04, "text": "Wubblords oder irgendwie so. Ja, hier sind die Project Specification. Naja, also das"}, {"id": 1007, "start": 7743.04, "end": 7748.64, "text": "war, das kam viele, die sowas geschrieben haben. Gab viele, die sowas geschrieben haben,"}, {"id": 1008, "start": 7748.64, "end": 7753.08, "text": "dass sie das nicht für die Kohle machen. Und ich mein, guck mal, ich bin der Ansicht,"}, {"id": 1009, "start": 7753.08, "end": 7758.44, "text": "ich bin ihm schon ziemlich entgegengekommen. Ich hab ihm gesagt, okay, 11,43 Euro sehe"}, {"id": 1010, "start": 7758.44, "end": 7766.76, "text": "ich ein. 50 Euro ist okay. Und dann immer noch nicht. Ich würds für diesen Preis natürlich"}, {"id": 1011, "start": 7766.76, "end": 7771.64, "text": "auch nicht machen. Aber dann sollen wir es halt nicht reinschreiben. So, und das ging"}, {"id": 1012, "start": 7771.64, "end": 7784.08, "text": "mit allen so ein bisschen hin und her. Und der Einzige, der was geliefert hat am Ende,"}, {"id": 1013, "start": 7784.08, "end": 7793.88, "text": "für wie viel hättest du sowas gemacht? Das eigentliche Machen ist gar nicht so, gar"}, {"id": 1014, "start": 7793.88, "end": 7799.12, "text": "nicht so das Problem. Es ist ja, warum es für schwierig fällt, das einzuschätzen ist,"}, {"id": 1015, "start": 7799.12, "end": 7803.72, "text": "ich hab im Vorfeld halt ne Weile auch geguckt, wie man das am besten machen kann. Deswegen"}, {"id": 1016, "start": 7803.72, "end": 7828.28, "text": "hab ich denen auch alle den Hinweis auf den IRC-Chat gegeben. Keine Ahnung. Sind wir die"}, {"id": 1017, "start": 7828.28, "end": 7834.2, "text": "Frage, ob auch noch dann anschließend Support irgendwie mit dabei ist oder noch extra Wünsche"}, {"id": 1018, "start": 7834.2, "end": 7840.68, "text": "oder so. Aber ich sag mal so, was in dem Umfang, was ich hier zusammen gewurstet hab, ich kauf"}, {"id": 1019, "start": 7840.68, "end": 7849.36, "text": "für, keine Ahnung, 200 Euro oder so. 200 Euro, 300 Euro, 200 bis 300 Euro wär ich"}, {"id": 1020, "start": 7849.36, "end": 7854.56, "text": "dir wahrscheinlich zufrieden mit. Irgendwie soll man Daumen gepeilt werden. Natürlich"}, {"id": 1021, "start": 7854.56, "end": 7863.32, "text": "würd ichs da ein bisschen schöner machen als nur für mich. So, aber 700 ist ein bisschen"}, {"id": 1022, "start": 7863.32, "end": 7877.64, "text": "viel. Mal ganz davon abgesehen, kann man das nicht so wirklich vergleichen, weil, das"}, {"id": 1023, "start": 7877.64, "end": 7883.24, "text": "sind ja halt zum größten Teil Inder oder irgendwo aus dieser Ecke, wie man das auch"}, {"id": 1024, "start": 7883.24, "end": 7887.84, "text": "an den Namen sieht. Und da siehts ja mit Kohle noch mal anders aus. Deswegen können die"}, {"id": 1025, "start": 7887.84, "end": 7892.24, "text": "ja auch die Sachen so billig anbieten. Naja, zumindest der einzige, der geliefert hat,"}, {"id": 1026, "start": 7892.24, "end": 7906.2, "text": "ist Develop WordPresser. Okay, der hat sein Profil mittlerweile geändert. Ja, der einzige,"}, {"id": 1027, "start": 7906.2, "end": 7928.44, "text": "der den Auftrag erledigt hat, ist Umasharik2. Der hat auch ein bisschen rumgewurstet. Blablabla,"}, {"id": 1028, "start": 7928.44, "end": 7938.24, "text": "die haben hier all looks fine. Soll Peter Lull enthalten. Okay, und er hat mir das Ganze,"}, {"id": 1029, "start": 7938.24, "end": 7947.72, "text": "den Source Code hat er mir geschickt als Ra-File. Auch schonmal geil. Twitch.ra, deswegen lad ich"}, {"id": 1030, "start": 7947.72, "end": 7955.36, "text": "das jetzt auch nur unter Linux runter. Ich mein, verschickt ihr eure Aufträge beziehungsweise"}, {"id": 1031, "start": 7955.36, "end": 7960.0, "text": "euren Source Code. Ich auch immer per Ra-File. Der andere Seite, was soll er großartig machen?"}, {"id": 1032, "start": 7960.0, "end": 7967.56, "text": "Ich meine, er hätte mir einen Link zu irgendeinem Repo schicken können, aber er hat seine Seite"}, {"id": 1033, "start": 7967.56, "end": 7973.32, "text": "mittlerweile geändert, dass er kein, dass er kein, dass er, er macht kein ASP.NET mehr,"}, {"id": 1034, "start": 7973.32, "end": 7986.8, "text": "macht das nur WordPress. So, okay. Jetzt gucken wir uns mal den Code an, den er gebastelt hat."}, {"id": 1035, "start": 7986.8, "end": 8004.52, "text": "Unra, ich weiß gar nicht, ob ich das installiert hab. Twitch. Ach so, wie geht das? X. So, und das"}, {"id": 1036, "start": 8004.52, "end": 8010.56, "text": "ist das, was er programmiert hat. Wir müssen dazu sagen, ich muss dazu sagen, ich hab schonmal"}, {"id": 1037, "start": 8010.56, "end": 8016.4, "text": "reingeguckt und da waren ein paar sehr abenteuerliche Sachen dabei. Wenn ihr wollt, können wir uns"}, {"id": 1038, "start": 8016.4, "end": 8020.32, "text": "später auch noch die anderen angucken, was sie so geschrieben haben. Ich versuchte ein bisschen,"}, {"id": 1039, "start": 8020.32, "end": 8030.6, "text": "bisschen mehr Geld aus den Rippen zu leiern. Okay, machen wir das Ganze mal auf. Ups. Oder?"}, {"id": 1040, "start": 8030.6, "end": 8055.88, "text": "Hat er eigentlich, hat das jetzt eigentlich aktualisiert? Den Titel? Für euch? Vom Streben?"}, {"id": 1041, "start": 8055.88, "end": 8076.4, "text": "Ja, okay, nice. Ups. Ups. Hat es jetzt funktioniert? Ja, hat funktioniert. Perfekt."}, {"id": 1042, "start": 8076.4, "end": 8087.16, "text": "Also, gucken wir uns mal an, was er programmiert hat. Wo fangen wir denn am besten an? Program"}, {"id": 1043, "start": 8087.16, "end": 8094.4, "text": "CS. Das ist Default, da hat er nichts drinne gemacht. Also, das ist ein ganz normales ASP.NET Core,"}, {"id": 1044, "start": 8094.4, "end": 8110.2, "text": "wie soll ich sagen, Standard Template. Assassin of Fivehead, richtig Fivehead. Big Brain. Also,"}, {"id": 1045, "start": 8110.2, "end": 8115.88, "text": "da hat er nix schonmal drinne gemacht, da müssen wir mal schauen. Oh fuck, mein Twitch-Vorschau-Browser"}, {"id": 1046, "start": 8115.88, "end": 8122.12, "text": "ist gerade übelst abgekackt. Was ist da los? Warum ist das kaputt? Leute, Chat, jetzt benehmt euch,"}, {"id": 1047, "start": 8122.12, "end": 8143.96, "text": "ich seh den Chat grad nicht mehr. So, mein Chat ist wieder da. Okay. BattleLP und Xdafuck. Danke"}, {"id": 1048, "start": 8143.96, "end": 8153.6, "text": "für, geiler Name, für den Sub. Hab ich glaube ich übersehen. So, okay, gucken wir mal, was er hat. Okay, also das ist Standard Default-Things."}, {"id": 1049, "start": 8153.6, "end": 8162.56, "text": "Standard, hat er hier was drinne gemacht? Nein, das ist auch Standard Template. Standard ASP.NET Core Template,"}, {"id": 1050, "start": 8162.56, "end": 8172.16, "text": "da hat er nix drinne gemacht. Das ist auch Standard. Bootstrap, JavaScript, hat er da was gemacht? Nein."}, {"id": 1051, "start": 8172.16, "end": 8185.76, "text": "CSS, das ist auch Default. Wo hat er denn überhaupt was gemacht? Twitch, das ist von ihm wahrscheinlich."}, {"id": 1052, "start": 8185.76, "end": 8204.28, "text": "ISC-Chant.CSHTML, Razorpage. Okay, also, big brain code, gucken wir uns jetzt mal an. Also, was macht er hier?"}, {"id": 1053, "start": 8204.28, "end": 8216.76, "text": "Es sind irgendwelche Razorpages. Model. Twitch Chat, Twitch, okay, die Models müssen wir uns auch nochmal angucken. Twitch View Model."}, {"id": 1054, "start": 8216.76, "end": 8223.96, "text": "Username Channel. Okay, das hält sich in Grenzen. Einheitlich, ob groß oder klein schreiben, ist auch nicht angesagt."}, {"id": 1055, "start": 8223.96, "end": 8233.36, "text": "Also, man merkt, ist das ASP.NET, ja, ist das, ist das, also man merkt, dass er wahnsinnig Bock hat auf das ganze Projekt."}, {"id": 1056, "start": 8233.36, "end": 8242.48, "text": "Lemonv7, Dankeschön. Okay, gucken wir uns mal an, was er hier getrieben hat. Was, was genau soll mir das hier sagen?"}, {"id": 1057, "start": 8242.48, "end": 8249.92, "text": "Darf man das so nicht machen? Okay, also, das ist eine Razorpage mit diesem Model. Dann ein bisschen HTML."}, {"id": 1058, "start": 8249.92, "end": 8272.32, "text": "Er zeigt den Username an. Machst du ein Code Review? Naja, ich habe, also, STBA42, ich habe bei Fiverr ein paar Sachen in Auftrag gegeben."}, {"id": 1059, "start": 8272.32, "end": 8285.2, "text": "Und gucke jetzt, was rausgekommen ist. Zeig doch erstmal das Programm. Nee, ich fühle das nicht einfach aus, ohne mir angeguckt zu haben, was da drinnen steht."}, {"id": 1060, "start": 8285.2, "end": 8294.96, "text": "Glaubst du doch selbst nicht, dass ich das einfach mal ausführe, ohne reingeguckt zu haben. Das hier ist, glaube ich, echt big brain."}, {"id": 1061, "start": 8294.96, "end": 8316.8, "text": "Guck mal. Item in Model Take One? For each in Take What? Das habe ich schon mal gesehen, das habe ich, das habe ich mir, das ist die einzige Zeile, die ich mir schon mal angeguckt habe oder, oder, oder mir in Erinnerung geblieben ist von der ganzen, was ist das?"}, {"id": 1062, "start": 8316.8, "end": 8343.44, "text": "Hat das irgendeinen Sinn? Versteht das einer? Warum? Also, ich meine, das ist eine Schleife, ja, ich, ich weiß, was es macht, aber ich versuche mich gerade rein zu denken, warum man das so macht."}, {"id": 1063, "start": 8343.44, "end": 8370.24, "text": "Also, ich meine, es ist eine Schleife über einen IEnumerable. Allerdings ist da immer nur ein Item drin. Hätte er nicht einfach Model nehmen können oder, oder einfach, oder einfach Model 1 oder Model First oder Model First or Default hätte er nehmen können oder sowas?"}, {"id": 1064, "start": 8370.24, "end": 8391.6, "text": "Das einzige, äh, Patrick weiß ich nicht mehr, das einzige, was mir hier zu einfällt ist, so wird das nicht ausgeführt, wenn in Model, wenn keine Models drin sind, aber da hätte man einfach auch einen If machen können."}, {"id": 1065, "start": 8391.6, "end": 8404.72, "text": "Also, das ist, das ist schon ein bisschen sehr um die Ecke. Eine Vorschleife über, über ein Element, anstatt das Element direkt zu verwenden."}, {"id": 1066, "start": 8404.72, "end": 8426.48, "text": "So, und das ist JustinFan12345, okay, daco, SplitItBaby, die besten Kommentare ever, SplitItBaby."}, {"id": 1067, "start": 8426.48, "end": 8441.44, "text": "Was macht der denn hier? Document Get Element By ID Content. Okay, Inner, InnerHTML, jetzt, jetzt, jetzt replace da irgendwelche Farben oder so."}, {"id": 1068, "start": 8441.44, "end": 8469.6, "text": "Picsing a bit to string, string, der bastelt irgendwelche HTML Geschichten zusammen, ähm, okay, er macht irgendwelche Magic für sein HTML, jetzt macht er SplitItBaby, ähm, und jetzt guckt er, ob das ganze rot ist."}, {"id": 1069, "start": 8469.6, "end": 8482.24, "text": "Und wenn es nicht rot ist, färbt er es rot. Wenn ich das jetzt so richtig, richtig interpretiere."}, {"id": 1070, "start": 8482.24, "end": 8499.84, "text": "Der färbt meinen Namen rot, der färbt meinen Namen rot, allerdings hat er nicht verstanden, was ich haben will, allerdings hat er nicht verstanden, was ich haben will, er soll nicht den Namen JustinFan rot färben, sondern er soll Peter0, wie ich eben auf Fiverr heiße, rot färben."}, {"id": 1071, "start": 8499.84, "end": 8517.12, "text": "JustinFan brauche nur für den Twitch Chat IRC, nicht für das Webfrontend. Also von der Funktion her ist es schonmal falsch, das macht nicht das, was ich haben wollte."}, {"id": 1072, "start": 8517.12, "end": 8538.72, "text": "Ähm, okay, was haben wir da als nächstes? Controller, was ist denn im Controller drin? Der Twitch Controller. Socket? IRC-Chat? Ach nee, das hat er einfach generiert."}, {"id": 1073, "start": 8538.72, "end": 8554.72, "text": "Okay, er macht hier nichts. Das hier, das hier ist die eigentliche Sache, das hier ist die eigentliche Sache, die, ähm, die man braucht, um sich zu dem Twitch IRC zu connecten."}, {"id": 1074, "start": 8554.72, "end": 8574.56, "text": "Und wisst ihr was das lustige ist? Das ist eins zu eins der Python-Code, den ich ihm geschickt habe. Das ist noch nicht mal eine eigene Leistung gewesen, das hier auch da drauf zu kommen, weil was ich euch jetzt gar nicht gezeigt habe ist, in dem Auftrag habe ich ihm erklärt, wie es geht."}, {"id": 1075, "start": 8574.56, "end": 8588.56, "text": "Ich hab ihm mit dem Auftrag erklärt, wie es funktioniert, ähm, und hab ihm, ich hab ihm, ich hab ihm, ich hab ihm, ich hab ihm Python-Sample-Code geschickt, wie es funktioniert."}, {"id": 1076, "start": 8588.56, "end": 8600.56, "text": "Und er hat einfach nur den Python-Sample-Code genommen und hat das halbwegs lauffähig gemacht in, in.NET. So."}, {"id": 1077, "start": 8600.56, "end": 8610.56, "text": "Was aber okay ist. Was aber okay ist. Da hab ich, da hab ich überhaupt keine Schmerzen mit. Es ist natürlich ein bisschen blöd, dass ich's ihm raussuchen musste."}, {"id": 1078, "start": 8610.56, "end": 8622.56, "text": "Ja, ich hab ihm fünfmal versucht zu erklären, um was es geht, ähm, aber wie gesagt, der Einzige, der's gemacht hat. So, jetzt gucken wir uns mal an, ob das hier überhaupt theoretisch funktioniert, was er da, was er da gebastelt hat."}, {"id": 1079, "start": 8622.56, "end": 8642.56, "text": "Also ganz ehrlich, wenn ich einfach nur ein normaler Typ auf Twitch wäre, der sowas haben möchte und es nicht vorher selbst programmiert hätte, ich hätte ihm garantiert nicht einen Link zu einem GitHub-Projekt schicken können, wo das eine an Python schonmal gebastelt hat."}, {"id": 1080, "start": 8642.56, "end": 8666.56, "text": "Die variablen Benamungen sind auch absolut Kraut und Rüben, ne?"}, {"id": 1081, "start": 8666.56, "end": 8680.56, "text": "IP."}, {"id": 1082, "start": 8680.56, "end": 8686.56, "text": "Werden die Leute eigentlich geprüft mit Testaufgaben? Nö."}, {"id": 1083, "start": 8686.56, "end": 8702.56, "text": "Ich glaube, was er versucht zu machen oder was der, das ist im Prinzip, also ich zeige euch mal zum Vergleich, wie es bei mir ausschaut, wie meine Sache aussieht. Wo kann man hier nochmal Projekte aufmachen?"}, {"id": 1084, "start": 8702.56, "end": 8724.56, "text": "Ja. Also mal zum Vergleich. Meine Geschichte sieht so aus. Da sieht man, es ist eigentlich relativ ähnlich, nur kann man diesen Shit da mal ausblenden."}, {"id": 1085, "start": 8724.56, "end": 8750.56, "text": "Also, das ist, das sind die vergleichbaren Sachen von mir. Und das ist was Base64 encode."}, {"id": 1086, "start": 8750.56, "end": 8771.56, "text": "War das überhaupt? Mach ich doch an der Stelle auch nicht. Um eins funktioniert er. Base64 encode?"}, {"id": 1087, "start": 8771.56, "end": 8795.56, "text": "Brauch beizen, wusste nicht, wie sonst, ich weiß nicht. Aber ich bilde mir an, man muss irgendwas mit Base64 machen. Encode ich das irgendwo? Base64 hier, seht ihr was?"}, {"id": 1088, "start": 8795.56, "end": 8804.56, "text": "Ich bin erstaunt, dass das funktioniert. Ich bin erstaunt, dass das funktioniert."}, {"id": 1089, "start": 8804.56, "end": 8828.56, "text": "Der schickte Base64 encode das rüber, wo man eigentlich UTF-8 bytes schicken sollte. Ob das funktioniert? Da bin ich mir nicht so sicher."}, {"id": 1090, "start": 8828.56, "end": 8848.56, "text": "Okay. Das macht gar kein Base64 encode. Das heißt nur Base64 encode."}, {"id": 1091, "start": 8848.56, "end": 8864.56, "text": "Das ist gar kein Base64 encode. Das ist Chibate."}, {"id": 1092, "start": 8864.56, "end": 8882.56, "text": "Okay, das ist das Highlight. Das ist echt nice. Base64 encode. Okay, also wir haben uns das jetzt angeguckt. Das sollte nichts Schlimmes machen. Wir führen das Ganze jetzt einfach mal aus und gucken, ob es überhaupt funktioniert."}, {"id": 1093, "start": 8882.56, "end": 8904.56, "text": "Wir gucken, ob es überhaupt funktioniert."}, {"id": 1094, "start": 8904.56, "end": 8921.56, "text": "Das bildet schon mal ganz schön lange. Ach fuck, ich kack Noob. Wenn man Exit macht, exited ja alles. Und nicht nur das eine Fenster. Ich hätte Exit-Window oder Close-Window oder so machen müssen."}, {"id": 1095, "start": 8921.56, "end": 8942.56, "text": "Big brain plays, Leute."}, {"id": 1096, "start": 8942.56, "end": 8952.56, "text": "Okay, auf geht's starten."}, {"id": 1097, "start": 8952.56, "end": 8963.56, "text": "Warum bildet das eigentlich so ewig?"}, {"id": 1098, "start": 8963.56, "end": 8979.56, "text": "Wird jetzt der indische Keylogger ausgeführt oder was?"}, {"id": 1099, "start": 8979.56, "end": 8993.56, "text": "Falsche Framework-Version, okay. Wollen wir das Settings umstellen?"}, {"id": 1100, "start": 8993.56, "end": 9009.56, "text": "Ach, das ist noch.NET Core 3 Review. Aber trotzdem, man sollte doch mit.NET Core auch ohne Probleme ASP.NET Links 2 ausführen können. Wahrscheinlich braucht das Blazer Zeug, da ist doch kein Blazer dabei."}, {"id": 1101, "start": 9009.56, "end": 9024.56, "text": "Das ist jetzt 2er."}, {"id": 1102, "start": 9024.56, "end": 9031.56, "text": "Das ist jetzt das 2er.NET. Wir gucken, ob es damit funktioniert."}, {"id": 1103, "start": 9031.56, "end": 9042.56, "text": "Wow. Okay, ich glaube, ich muss nochmal neu starten. Das packt gerade rum."}, {"id": 1104, "start": 9042.56, "end": 9061.56, "text": "Damit müsste es jetzt aber funktionieren. Es läuft, okay."}, {"id": 1105, "start": 9061.56, "end": 9073.56, "text": "Also, hier ist es. Hier ist es. Username."}, {"id": 1106, "start": 9073.56, "end": 9079.56, "text": "Das verwende er doch nie, oder?"}, {"id": 1107, "start": 9079.56, "end": 9086.56, "text": "Ich glaube, Username verwende er doch nie."}, {"id": 1108, "start": 9086.56, "end": 9094.56, "text": "Was muss ich denn wo eingeben? Channel? Okay. Channel? Wo Blots?"}, {"id": 1109, "start": 9094.56, "end": 9106.56, "text": "Username? Keine Ahnung, Search."}, {"id": 1110, "start": 9106.56, "end": 9113.56, "text": "Ich sag doch, es funktioniert, oder? Was ist das?"}, {"id": 1111, "start": 9113.56, "end": 9119.56, "text": "Funktioniert nicht. Username? So?"}, {"id": 1112, "start": 9119.56, "end": 9126.56, "text": "Nope. Es geht nicht. Es ist kaputt."}, {"id": 1113, "start": 9126.56, "end": 9135.56, "text": "Oder muss ich hier Justin Fan irgendwie reinschreiben?"}, {"id": 1114, "start": 9135.56, "end": 9143.56, "text": "Tatsächlich. Okay, das macht überhaupt nicht das, was ich haben wollte."}, {"id": 1115, "start": 9143.56, "end": 9156.56, "text": "Automatisch updaten tut es auch nicht, oder?"}, {"id": 1116, "start": 9156.56, "end": 9166.56, "text": "Also, wirklich funktioniert tut das Ganze nicht. Nee, das funktioniert nicht."}, {"id": 1117, "start": 9166.56, "end": 9172.56, "text": "Es ist kaputt, was er in der programmiert hat."}, {"id": 1118, "start": 9172.56, "end": 9177.56, "text": "Aber Justin Fan ist rot, ja. Yeah."}, {"id": 1119, "start": 9177.56, "end": 9181.56, "text": "Wie war nochmal die Anforderungsbeschreibung dazu? Moment, kann ich dir zeigen?"}, {"id": 1120, "start": 9181.56, "end": 9186.56, "text": "Ich hab sie mir danach ausführlich erklärt."}, {"id": 1121, "start": 9186.56, "end": 9192.56, "text": "Er hat sogar sich den Twitch-Chat angeguckt und festgestellt, dass ich dann..."}, {"id": 1122, "start": 9192.56, "end": 9198.56, "text": "Alter, Piver, geh mal nicht auf den Sack."}, {"id": 1123, "start": 9198.56, "end": 9203.56, "text": "Good Programmer, nice communication."}, {"id": 1124, "start": 9203.56, "end": 9209.56, "text": "Auftrag, Requirements. Ja."}, {"id": 1125, "start": 9209.56, "end": 9216.56, "text": "Wine? Warum zum Teufel sollte ich jetzt in Wine öffnen wollen?"}, {"id": 1126, "start": 9216.56, "end": 9221.56, "text": "Ich will das in Firefox aufmachen."}, {"id": 1127, "start": 9221.56, "end": 9226.56, "text": "Wine? Alter, warum startest du Wine, um den PDF zu öffnen?"}, {"id": 1128, "start": 9226.56, "end": 9230.56, "text": "What the fuck?"}, {"id": 1129, "start": 9230.56, "end": 9239.56, "text": "Lullen, Alter."}, {"id": 1130, "start": 9239.56, "end": 9245.56, "text": "Okay, kann aber einfach so. Warum macht er das nicht einfach im Browser auf?"}, {"id": 1131, "start": 9245.56, "end": 9250.56, "text": "Jetzt macht er es im Browser auf. Big brain, next level, Wahnsinn."}, {"id": 1132, "start": 9250.56, "end": 9260.56, "text": "Das hab ich ihm geschrieben, ja."}, {"id": 1133, "start": 9260.56, "end": 9263.56, "text": "Also nicht Justin Fan."}, {"id": 1134, "start": 9263.56, "end": 9279.56, "text": "Wine ist quasi eine Windows-AP-Implementierung für Linux."}, {"id": 1135, "start": 9279.56, "end": 9281.56, "text": "Das hat er auch gemacht."}, {"id": 1136, "start": 9281.56, "end": 9284.56, "text": "Dann hab ich ihm gesagt, ich will nicht, dass das Ding einen AP-Key braucht."}, {"id": 1137, "start": 9284.56, "end": 9288.56, "text": "Das hab ich reingeschrieben, weil ich die Leute dazu bringen wollte festzustellen,"}, {"id": 1138, "start": 9288.56, "end": 9293.56, "text": "ah ja, es gibt ja eine IRC-AP, aber da hätten sie mal selbst nachgucken müssen."}, {"id": 1139, "start": 9293.56, "end": 9296.56, "text": "Channel und Username sollte man einstellen können."}, {"id": 1140, "start": 9296.56, "end": 9306.56, "text": "Allerdings, wie gesagt, der Channel, den ich überwachen will und nicht Justin Fan."}, {"id": 1141, "start": 9306.56, "end": 9320.56, "text": "Ich lass mal laufen, vielleicht geht's ja nach, ups, vielleicht geht's ja jetzt nach einer Weile."}, {"id": 1142, "start": 9320.56, "end": 9329.56, "text": "Justin Fan."}, {"id": 1143, "start": 9329.56, "end": 9335.56, "text": "Funktioniert das überhaupt? Geht der überhaupt in den richtigen Channel rein?"}, {"id": 1144, "start": 9335.56, "end": 9340.56, "text": "Was der da gebastelt hat, geht der überhaupt in den richtigen?"}, {"id": 1145, "start": 9340.56, "end": 9347.56, "text": "Vor allem, warum ist das denn ein Controller?"}, {"id": 1146, "start": 9347.56, "end": 9352.56, "text": "Das ergibt doch überhaupt keinen Sinn."}, {"id": 1147, "start": 9352.56, "end": 9355.56, "text": "Das funktioniert überhaupt nicht."}, {"id": 1148, "start": 9355.56, "end": 9362.56, "text": "Guck mal, das müsste eine Endlosschleife sein, die im Hintergrund läuft."}, {"id": 1149, "start": 9362.56, "end": 9368.56, "text": "Die hat erstens in dem Controller nichts zu suchen, der lockt sich einfach nur ein und..."}, {"id": 1150, "start": 9368.56, "end": 9376.56, "text": "Alter, das ist ja noch weniger das, was ich haben wollte als..."}, {"id": 1151, "start": 9376.56, "end": 9378.56, "text": "Oh man."}, {"id": 1152, "start": 9378.56, "end": 9384.56, "text": "So, ich hab gesagt, Chat-Messages sollen einen Neustart überstehen, machen sie nicht."}, {"id": 1153, "start": 9384.56, "end": 9390.56, "text": "Und ich hätte gerne einen Knopf, um Chat-Nachrichten zu löschen, der ist auch nicht da."}, {"id": 1154, "start": 9390.56, "end": 9395.56, "text": "Schluss, das Frontend soll sich selbst refreshen, wenn eine neue Nachricht ankommt."}, {"id": 1155, "start": 9395.56, "end": 9400.56, "text": "Und das soll Zeit und Datum anzeigen, wann sie gepostet werden. Fertig."}, {"id": 1156, "start": 9400.56, "end": 9404.56, "text": "Ich finde, die Beschreibung ist verständlich, oder?"}, {"id": 1157, "start": 9404.56, "end": 9409.56, "text": "Und wenn nicht, kann man an zwei, drei Stellen nachfragen und man versteht es wieder."}, {"id": 1158, "start": 9409.56, "end": 9414.56, "text": "Oder, der hätte mich ein paar Sachen spezifisch nachfragen können und hätte das eigentlich verstehen müssen, oder?"}, {"id": 1159, "start": 9414.56, "end": 9420.56, "text": "Ich finde, man kann das recht gut erkennen."}, {"id": 1160, "start": 9420.56, "end": 9423.56, "text": "Der hat jetzt echt den Wine geöffnet, ich fass es nicht."}, {"id": 1161, "start": 9423.56, "end": 9427.56, "text": "Ja, also..."}, {"id": 1162, "start": 9427.56, "end": 9431.56, "text": "Es funktioniert nicht wirklich."}, {"id": 1163, "start": 9435.56, "end": 9439.56, "text": "Ich bin schon wieder auf dem Weg."}, {"id": 1164, "start": 9439.56, "end": 9443.56, "text": "Ich bin schon wieder auf dem Weg."}, {"id": 1165, "start": 9443.56, "end": 9447.56, "text": "Ich bin schon wieder auf dem Weg."}, {"id": 1166, "start": 9447.56, "end": 9451.56, "text": "Ich bin schon wieder auf dem Weg."}, {"id": 1167, "start": 9451.56, "end": 9459.56, "text": "Jetzt habt ihr das Fiverr Programm gesehen von dem Einzigen, der geantwortet hat."}, {"id": 1168, "start": 9459.56, "end": 9465.56, "text": "Also der Einzige, der eine Lösung erarbeitet hat."}, {"id": 1169, "start": 9465.56, "end": 9469.56, "text": "Wobei das keine wirkliche Lösung ist."}, {"id": 1170, "start": 9469.56, "end": 9471.56, "text": "Ach stimmt, da hat der Videos gesteht"}, {"id": 1171, "start": 9482.98, "end": 9484.98, "text": "Ja er hat das gleiche"}, {"id": 1172, "start": 9486.34, "end": 9489.34, "text": "Ja Fiverr ist jetzt gut"}, {"id": 1173, "start": 9490.46, "end": 9492.46, "text": "Er hat mir ein Bild davon geschickt"}, {"id": 1174, "start": 9492.46, "end": 9499.96, "text": "Was er macht"}, {"id": 1175, "start": 9499.96, "end": 9501.96, "text": "Macht man das Bild"}, {"id": 1176, "start": 9501.96, "end": 9503.96, "text": "Macht man das Bild wieder zu"}, {"id": 1177, "start": 9505.96, "end": 9507.96, "text": "Checkt die Fiverr Seite nicht"}, {"id": 1178, "start": 9509.96, "end": 9512.96, "text": "Wie viel habe ich ihm gegeben 36 Dollar"}, {"id": 1179, "start": 9516.96, "end": 9518.96, "text": "36 Dollar immerhin"}, {"id": 1180, "start": 9518.96, "end": 9521.96, "text": "Okay gucken wir uns mal das Video an"}, {"id": 1181, "start": 9535.96, "end": 9537.96, "text": "Alter was geht mit der Aufnahme"}, {"id": 1182, "start": 9537.96, "end": 9549.96, "text": "Das ist halt absolut nicht das was ich haben wollte"}, {"id": 1183, "start": 9557.96, "end": 9559.96, "text": "Wie macht man den Scheiß hier zu überhaupt"}, {"id": 1184, "start": 9559.96, "end": 9561.96, "text": "Escape geht nicht"}, {"id": 1185, "start": 9561.96, "end": 9563.96, "text": "Das da"}, {"id": 1186, "start": 9563.96, "end": 9568.96, "text": "Versuch mal Wupplos"}, {"id": 1187, "start": 9568.96, "end": 9571.96, "text": "Sehr gute Big Prane Idee"}, {"id": 1188, "start": 9571.96, "end": 9574.96, "text": "Big Prane"}, {"id": 1189, "start": 9574.96, "end": 9577.96, "text": "Justin Fan 1,2,3"}, {"id": 1190, "start": 9577.96, "end": 9580.96, "text": "So"}, {"id": 1191, "start": 9587.96, "end": 9589.96, "text": "Ja aber das kann nicht funktionieren"}, {"id": 1192, "start": 9589.96, "end": 9594.96, "text": "Er macht ja gar keine Hintergrundschleife"}, {"id": 1193, "start": 9594.96, "end": 9596.96, "text": "Also er macht nichts im Background"}, {"id": 1194, "start": 9596.96, "end": 9598.96, "text": "Und er macht es auch gleich wieder zu"}, {"id": 1195, "start": 9607.96, "end": 9609.96, "text": "Was macht das Programm dann"}, {"id": 1196, "start": 9609.96, "end": 9612.96, "text": "Ja um ehrlich zu sein macht es nicht sonderlich viel von ihm"}, {"id": 1197, "start": 9612.96, "end": 9614.96, "text": "Das einzige was es macht ist"}, {"id": 1198, "start": 9614.96, "end": 9618.96, "text": "Es meldet sich einmal im Twitch IRC Chat an"}, {"id": 1199, "start": 9618.96, "end": 9620.96, "text": "Kriegt die Willkommensmeldung"}, {"id": 1200, "start": 9620.96, "end": 9623.96, "text": "Und meldet sich und macht danach gleich wieder gleich wieder zu"}, {"id": 1201, "start": 9626.96, "end": 9630.96, "text": "Und es färbt lustigerweise auch nur Justin Fan 1,2,3,4,5 ein"}, {"id": 1202, "start": 9630.96, "end": 9632.96, "text": "Oh Gott ist das Fail"}, {"id": 1203, "start": 9637.96, "end": 9642.96, "text": "Weil wenn ich mich Justin Fan 1,2,3,4,5 nenne"}, {"id": 1204, "start": 9642.96, "end": 9647.96, "text": "Dann funktioniert zumindest das Highlighten vom Username"}, {"id": 1205, "start": 9647.96, "end": 9652.96, "text": "Jede andere Justin Fan Geschichte geht nicht"}, {"id": 1206, "start": 9652.96, "end": 9656.96, "text": "Bewertet den mal entsprechend"}, {"id": 1207, "start": 9656.96, "end": 9657.96, "text": "Ich hab den schon bewertet"}, {"id": 1208, "start": 9657.96, "end": 9659.96, "text": "Ich hab reingeschrieben ganz toller Programmierer"}, {"id": 1209, "start": 9659.96, "end": 9662.96, "text": "Ich will denen mit meinem Zeug keine"}, {"id": 1210, "start": 9662.96, "end": 9664.96, "text": "Keine irgendwie"}, {"id": 1211, "start": 9664.96, "end": 9667.96, "text": "Da es irgendwie von Fiverr kicken oder so"}, {"id": 1212, "start": 9667.96, "end": 9669.96, "text": "Es ist egal es war ein Versuch"}, {"id": 1213, "start": 9669.96, "end": 9672.96, "text": "Und mir war klar"}, {"id": 1214, "start": 9672.96, "end": 9677.96, "text": "Dass man für 5 Euro oder 7 Euro indische Programmierer jetzt nichts"}, {"id": 1215, "start": 9677.96, "end": 9681.96, "text": "Wirklich richtig ausgereiftes erwarten kann"}, {"id": 1216, "start": 9681.96, "end": 9685.96, "text": "Das Farben Splitted Baby hat auch nicht so funktioniert"}, {"id": 1217, "start": 9685.96, "end": 9686.96, "text": "Ja"}, {"id": 1218, "start": 9686.96, "end": 9688.96, "text": "Okay also"}, {"id": 1219, "start": 9688.96, "end": 9691.96, "text": "Das ist die Qualität von Fiverr"}, {"id": 1220, "start": 9691.96, "end": 9693.96, "text": "Man bestellt was"}, {"id": 1221, "start": 9693.96, "end": 9696.96, "text": "Man bestellt was"}, {"id": 1222, "start": 9696.96, "end": 9700.96, "text": "Einer gibt was ab was absolut nicht das tut was es tun soll"}, {"id": 1223, "start": 9700.96, "end": 9703.96, "text": "11 sagen ab"}, {"id": 1224, "start": 9703.96, "end": 9708.96, "text": "Und von diesen 10 sagen ab"}, {"id": 1225, "start": 9708.96, "end": 9710.96, "text": "Und von diesen 10"}, {"id": 1226, "start": 9710.96, "end": 9714.96, "text": "Achso wollen wir uns das aktuelle Profil von ihm nochmal angucken"}, {"id": 1227, "start": 9714.96, "end": 9720.96, "text": "Und von diesen 10 wollten eigentlich auch über die Hälfte viel viel viel mehr Geld"}, {"id": 1228, "start": 9720.96, "end": 9723.96, "text": "Wir gucken mal was er jetzt macht"}, {"id": 1229, "start": 9723.96, "end": 9730.96, "text": "WordPress Website und Bugfix WordPress"}, {"id": 1230, "start": 9730.96, "end": 9732.96, "text": "Er hat ASP.NET Core rausgenommen"}, {"id": 1231, "start": 9732.96, "end": 9735.96, "text": "Ob ich mit für verantwortlich bin"}, {"id": 1232, "start": 9735.96, "end": 9738.96, "text": "Dass er ASP.NET rausgenommen hat"}, {"id": 1233, "start": 9747.96, "end": 9750.96, "text": "War die Aufgabe so komplex oder unsichtig"}, {"id": 1234, "start": 9750.96, "end": 9754.96, "text": "Nein"}, {"id": 1235, "start": 9754.96, "end": 9756.96, "text": "War sie nicht"}, {"id": 1236, "start": 9756.96, "end": 9761.96, "text": "Also Leute ihr habt ihr wart ja vielleicht ein paar in dem Stream dabei wo wir das zusammen programmiert haben"}, {"id": 1237, "start": 9761.96, "end": 9765.96, "text": "Das gepaart mit meiner Beschreibung"}, {"id": 1238, "start": 9765.96, "end": 9769.96, "text": "Da hätte man doch eigentlich wenn man halbwegs weiß was man macht"}, {"id": 1239, "start": 9769.96, "end": 9773.96, "text": "Ein bisschen weiter kommen müssen als so oder"}, {"id": 1240, "start": 9773.96, "end": 9776.96, "text": "Bin ich dazu anspruchsvoll"}, {"id": 1241, "start": 9776.96, "end": 9784.96, "text": "Aber wir wollen jetzt hier nicht zu sehr flamen"}, {"id": 1242, "start": 9784.96, "end": 9787.96, "text": "Weil er hat immerhin sich dran gewagt"}, {"id": 1243, "start": 9787.96, "end": 9792.96, "text": "So und die anderen cancelt"}, {"id": 1244, "start": 9792.96, "end": 9795.96, "text": "Den einen haben wir uns ja schon mal angeguckt"}, {"id": 1245, "start": 9795.96, "end": 9799.96, "text": "Die anderen lohnen sich gar nicht großartig anzugucken"}, {"id": 1246, "start": 9799.96, "end": 9805.96, "text": "Die haben das UI sieht hübsch aus das UI ist Standard Bootstrap aus dem ASP.NET Core Template"}, {"id": 1247, "start": 9805.96, "end": 9810.96, "text": "Was passiert mit den restlichen 120 Euro"}, {"id": 1248, "start": 9810.96, "end": 9816.96, "text": "Ich weiß ich kann man die sich irgendwie wieder irgendwie wieder zurück überweisen lassen oder so"}, {"id": 1249, "start": 9816.96, "end": 9821.96, "text": "Okay wir gucken mal"}, {"id": 1250, "start": 9821.96, "end": 9827.96, "text": "ASMR ASMR Adult ASMR YouTube"}, {"id": 1251, "start": 9827.96, "end": 9829.96, "text": "Was habe ich da gesucht"}, {"id": 1252, "start": 9829.96, "end": 9831.96, "text": "Was habe ich da gesucht"}, {"id": 1253, "start": 9831.96, "end": 9836.96, "text": "Monka Toss"}, {"id": 1254, "start": 9836.96, "end": 9843.96, "text": "Ich glaube ich habe gesucht ob es Leute gibt für den"}, {"id": 1255, "start": 9843.96, "end": 9847.96, "text": "Für mein Meme Board"}, {"id": 1256, "start": 9847.96, "end": 9853.96, "text": "Ob ich nicht ein paar Sprecher finde oder Sprecherinnen die Dinger sagen können"}, {"id": 1257, "start": 9853.96, "end": 9857.96, "text": "Ich habe gedacht das wäre wahrscheinlich ganz lustig"}, {"id": 1258, "start": 9857.96, "end": 9867.96, "text": "Aber da gibt es gibt es ja gibt es ist auf Fiverr kannst du kannst du alles kaufen"}, {"id": 1259, "start": 9867.96, "end": 9870.96, "text": "Also du hast da auch Leute die beispielsweise sagen"}, {"id": 1260, "start": 9870.96, "end": 9877.96, "text": "I do cute Anime Girls Adult Voiceovers und sowas"}, {"id": 1261, "start": 9877.96, "end": 9890.96, "text": "Alles dabei"}, {"id": 1262, "start": 9890.96, "end": 9892.96, "text": "Ja klar"}, {"id": 1263, "start": 9892.96, "end": 9896.96, "text": "Das lohnt sich nicht das jetzt anzugucken"}, {"id": 1264, "start": 9896.96, "end": 9901.96, "text": "Die haben alle abgesagt die haben alle abgesagt oder haben gesagt mehr Geld"}, {"id": 1265, "start": 9901.96, "end": 9904.96, "text": "Das ist alles wirklich gecheckt hat es keiner"}, {"id": 1266, "start": 9904.96, "end": 9908.96, "text": "Kannst du mal nein das mache ich jetzt hier und stream garantiert nicht"}, {"id": 1267, "start": 9908.96, "end": 9911.96, "text": "Ja Leute so sah das mit Fiverr aus"}, {"id": 1268, "start": 9911.96, "end": 9913.96, "text": "Also ich gebe zu"}, {"id": 1269, "start": 9913.96, "end": 9919.96, "text": "Mein Programm ist jetzt nicht die optische Augenweide was ich hier gebastelt habe"}, {"id": 1270, "start": 9919.96, "end": 9925.96, "text": "Aber es funktioniert es funktioniert jetzt übrigens gerade nicht weil ich es ausgemacht habe"}, {"id": 1271, "start": 9925.96, "end": 9932.96, "text": "Aber es funktioniert"}, {"id": 1272, "start": 9932.96, "end": 9936.96, "text": "Einfacher Weg um in Chrome die IP zu verschleiern"}, {"id": 1273, "start": 9936.96, "end": 9940.96, "text": "VPN"}, {"id": 1274, "start": 9940.96, "end": 9948.96, "text": "Kannst auch eine komischen China Proxy oder so nehmen aber VPN ist das beste"}, {"id": 1275, "start": 9948.96, "end": 9953.96, "text": "Oh I'm not trolling Fiverr's"}, {"id": 1276, "start": 9953.96, "end": 9958.96, "text": "They want more money"}, {"id": 1277, "start": 9958.96, "end": 9962.96, "text": "They advertised service for"}, {"id": 1278, "start": 9962.96, "end": 9969.96, "text": "5 to 15 euros and 1700"}, {"id": 1279, "start": 9969.96, "end": 9975.96, "text": "Bangladesh hat bessere loading time"}, {"id": 1280, "start": 9975.96, "end": 9979.96, "text": "Na ja gut so sah es aus"}, {"id": 1281, "start": 9979.96, "end": 9987.96, "text": "So sah es aus mit Fiverr"}, {"id": 1282, "start": 9987.96, "end": 9989.96, "text": "War es eigentlich"}, {"id": 1283, "start": 9989.96, "end": 9999.96, "text": "Deswegen habe ich da auch deswegen habe ich da auch noch kein Video zugemacht"}, {"id": 1284, "start": 9999.96, "end": 10004.96, "text": "Weil was was soll ich da groß im Video zu erzählen"}, {"id": 1285, "start": 10004.96, "end": 10007.96, "text": "Hast du Bock dir das Github von der NSA anzugucken"}, {"id": 1286, "start": 10007.96, "end": 10022.96, "text": "Weil die NSA hat ein Github"}, {"id": 1287, "start": 10022.96, "end": 10027.96, "text": "Gibt es auf Fiverr keine Programmierpros doch doch auf jeden Fall"}, {"id": 1288, "start": 10027.96, "end": 10033.96, "text": "Auf jeden Fall und es gäbe auch garantiert auf Fiverr"}, {"id": 1289, "start": 10033.96, "end": 10037.96, "text": "Genug die das machen könnten"}, {"id": 1290, "start": 10037.96, "end": 10042.96, "text": "Aber ich wollte halt absichtlich welche probieren die explizit sagen"}, {"id": 1291, "start": 10042.96, "end": 10048.96, "text": "Wir für für 5 bis 15 Euro machen wir das"}, {"id": 1292, "start": 10048.96, "end": 10053.96, "text": "Der BND hat auch eine Github ja"}, {"id": 1293, "start": 10053.96, "end": 10072.96, "text": "Die haben auf Github haben die so eine Reverse Engineer Challenge mal gehabt"}, {"id": 1294, "start": 10072.96, "end": 10078.96, "text": "Ja Leute"}, {"id": 1295, "start": 10078.96, "end": 10081.96, "text": "Gibt es noch irgendwas was wir machen können"}, {"id": 1296, "start": 10081.96, "end": 10084.96, "text": "Ich glaube ich log jetzt um und spiele eine Runde"}, {"id": 1297, "start": 10084.96, "end": 10086.96, "text": "Ich wollte gerade sagen Overwatch mache ich nicht"}, {"id": 1298, "start": 10086.96, "end": 10088.96, "text": "Eine Runde Borderlands weiter"}, {"id": 1299, "start": 10088.96, "end": 10098.96, "text": "Ich muss sagen das Borderlands Endgame ist gar nicht mal so übel"}, {"id": 1300, "start": 10098.96, "end": 10125.96, "text": "Da kann er ganz schön noch ein bisschen vor sich hin brinden"}, {"id": 1301, "start": 10125.96, "end": 10130.96, "text": "Omas Märchenstunde live die Marmeladenoma ist online"}, {"id": 1302, "start": 10130.96, "end": 10133.96, "text": "Könnten wir hosten"}, {"id": 1303, "start": 10133.96, "end": 10137.96, "text": "Die habe ich mir irgendwann abonniert als das bei Kronk gezeigt wurde"}, {"id": 1304, "start": 10137.96, "end": 10142.96, "text": "Da habe ich mir gedacht sowas muss man eigentlich unterstützen"}, {"id": 1305, "start": 10142.96, "end": 10145.96, "text": "Overwatch ja ich habe die Role Queue mal ausprobieren"}, {"id": 1306, "start": 10145.96, "end": 10147.96, "text": "Ich habe mich nach den ersten zwei Games schon wieder so aufgeregt"}, {"id": 1307, "start": 10147.96, "end": 10153.96, "text": "Dass ich direkt rage quitted bin"}, {"id": 1308, "start": 10153.96, "end": 10165.96, "text": "Ich glaube ich habe es auch gar nicht mehr installiert"}, {"id": 1309, "start": 10165.96, "end": 10172.96, "text": "Borderlands ist ein Entspannungs Game für mich"}, {"id": 1310, "start": 10172.96, "end": 10175.96, "text": "Ich log jetzt um wir sehen uns morgen früh"}, {"id": 1311, "start": 10175.96, "end": 10183.96, "text": "Sonntag früh ist immer Aufwach Stream"}, {"id": 1312, "start": 10183.96, "end": 10187.96, "text": "Falls der ein oder andere noch nicht weiß wohin mit seinem Twitch Prime Sub"}, {"id": 1313, "start": 10187.96, "end": 10196.96, "text": "Ihr wisst ja und Big IQ haben wollt dann seid ihr hier richtig"}, {"id": 1314, "start": 10196.96, "end": 10201.96, "text": "Und wie gesagt spätestens morgen früh sehen wir uns"}, {"id": 1315, "start": 10201.96, "end": 10206.96, "text": "Ich werde dann nachmittags mal gucken dass ich den restlichen Krams hier vom Hardware Rad tue"}, {"id": 1316, "start": 10206.96, "end": 10210.96, "text": "Was ich da heute zwei Stunden zusammen geklotzt habe"}, {"id": 1317, "start": 10210.96, "end": 10220.96, "text": "Welche Uhrzeit immer so von zwischen neun und zehn so in dem Dreh geht es immer los oder"}, {"id": 1318, "start": 10220.96, "end": 10225.96, "text": "Manchmal auch nach zehn aber von neun bis zehn Uhr dreißig in dem Dreh geht es immer los"}, {"id": 1319, "start": 10225.96, "end": 10239.96, "text": "Und dann so bis 13 Uhr wir haben glaube ich sogar schon bis 14 14 30 oder so"}, {"id": 1320, "start": 10239.96, "end": 10258.96, "text": "Ich spiele jetzt kein Overwatch ganz bestimmt nicht ganz bestimmt nicht"}, {"id": 1321, "start": 10258.96, "end": 10261.96, "text": "Du kannst mir das mal schicken wir können das mal ausprobieren"}, {"id": 1322, "start": 10261.96, "end": 10277.96, "text": "Aber jetzt nicht on Stream jetzt ich log jetzt um und spiele ein bisschen Borderlands oder irgendwas oder gucke irgendwas bei Amazon"}, {"id": 1323, "start": 10277.96, "end": 10282.96, "text": "Max DPS tot zumindest Overwatch"}, {"id": 1324, "start": 10282.96, "end": 10287.96, "text": "Ich hab das ja eigentlich den Channel damals nur gemacht weil ich halt Bock hatte"}, {"id": 1325, "start": 10287.96, "end": 10291.96, "text": "Overwatch sehr Overwatch spezifische Videos zu machen"}, {"id": 1326, "start": 10291.96, "end": 10295.96, "text": "Und das Problem war dann nur dass mir Overwatch eine Woche nachdem ich den Channel aufgemacht habe"}, {"id": 1327, "start": 10295.96, "end": 10303.96, "text": "Keinen Bock mehr hatte keinen Bock mehr gemacht hat"}, {"id": 1328, "start": 10303.96, "end": 10311.96, "text": "Nächste Woche schon MW ja ja glaube schon nächste Woche Freitag glaube ich"}, {"id": 1329, "start": 10311.96, "end": 10317.96, "text": "Okay Leute also bis denn macht's gut"}]}