{"text": "So, ich bin noch mal kurzzeitig am Start, Stunde Zeit habe ich noch oder eineinhalb Stunden Zeit habe ich noch, so habe ich mir gedacht ich mache einfach mal Streams so an. Wobei, warte mal, ich wollte doch eigentlich mit dem Fabian heute irgendwas machen, ne? Ist der da? Okay. Ich wollte, wann war denn der zuletzt da? Ah, hier. Ich wollte mit dem Fabian noch irgendwas machen heute, was war das denn nochmal? Ah, das habe ich vergessen. Achso, mein Video-Account umziehen, genau, null. Werde ich wahrscheinlich eh nicht mal spielen, aber schadet wahrscheinlich auch nichts, ne? Ehe noch keiner da, ich laber jetzt hier quasi komplett ins Leere. So fühlt man sich wahrscheinlich als einer von 99% der Twitch-Streamer, wo irgendwie nur null oder der Vorschau-Rechner zuguckt. Das tut mir ja teilweise auch ein bisschen leid, muss ich sagen, ne? Ich scroll abends manchmal auf dem Handy durch so Spiele, wo halt sonst auch kaum einer unterwegs ist und gucke dann durch, da gibt es echt seitenweise Leute, da guckt einfach niemand zu. Also mittlerweile ist es so voll auf Twitch, wenn du nicht von irgendwo her einen anderen Boost kriegst, ist das wirklich verdammt lange und harte Arbeit. Da irgendwie, und der passende Content selbstverständlich, ne? Das zähle ich mal unter Arbeit dabei, da was auf die Reihe zu kriegen. Glück gehört natürlich auch ein bisschen dazu, keine Frage, aber ja. Das ist nicht mehr wie 2010 YouTube, wo du einfach nur das richtige Game zeigen musstest, das instant 50k plus. Nein, 2010 war es eher 5k plus, da war das schon viel. Mein letztes, ach guck mal, der Twitch hat es kapiert, das ist on, nice. Ihr seid ja am Start schon Leute, 17 Monate, Dankeschön, hypersubscription. Oh, die Modes sind vielleicht ein bisschen thick. Ne, der letzte Stream, den habe ich gelöscht, da war Musik in ein paar Videos drin, die ich geguckt habe und man weiß auf Twitch leider nicht so genau. Okay, die Playlist gefällt mir nicht, ich muss mal was anderes machen. Auch mal irgendwas anderes. Ja, okay, besser, besser als nichts. Sag mal, weiß noch irgendjemand? Ich wollte mir bei Amazon, warte mal, vielleicht habe ich das hier sogar schon in den Warenkorb reingelegt, oh, da habe ich noch ganz viel drin liegen. Du klingst nicht gut, ne? Nö, nö, nö, ist alles in Ordnung. Hör ich mich irgendwie anders an? Stimmt irgendwas nicht? Moment. Säck, Säck, Säck. Blablabla, Test, Test, Test, Test, wie höre ich mich an? Blablabla, Test, Test, Test, wie höre ich mich an, wie immer. Übrigens, eins muss ich sagen, was die ganze YouTube und Streaming-Geschichte gebracht hat, ist, normalerweise hat man ja so den Reflex, wenn man seine eigene Stimme aufgenommen hört, denkt man, man klingt komisch. Aber ich muss sagen, seitdem ich so viele Videos Probe gehört habe von mir und so viele Stunden von meinem eigenen Content angeguckt habe, ist das für mich wie ein zweiter Max. Also quasi, ich höre mich einmal, wenn ich rede und einmal so wie ich in Videos klinge. Also, das fällt mir überhaupt nicht mehr auf. So, ich wollte doch mal gucken, irgendwas wollte ich mir noch letztens kaufen und ich glaube, das brauche ich unbedingt, was ist das für ein, Moment, das da. Ja, genau, das da, das da wollte ich mir kaufen. Lackierte, exzellent, lackierte Kabels wollte ich mir kaufen. Ja, genau, genau, das muss ich unbedingt gerade mal hier nebenbei auf dem zweiten Rechner, Amazon. Da bin ich nämlich echt gespannt drauf, ob das was taucht. Das ist normal, das ist normal, aber glaub mir, du gewöhnst dich danach nicht allzu langer Zeit dran. Hallo Max, ich kenne dich seit ich 14 bin. Na gut, dann bist du jetzt wahrscheinlich, vielleicht bist du 24 oder so. Ah, okay, schreibt es ja auch dahinter. 23, freue mich, wenn ich manchmal Zeit habe, deine YouTube Videos zu gucken, auch wenn ich nicht so oft mit dem Informat... Das hast du heute als Kommentar schon geschrieben oder zumindest jemand hat ein relativ ähnliches Kommentar geschrieben. Übrigens, schön, dass du dann mich hierher gefunden hast. Also du bist nicht der einzige, aber ich mache ja auch noch ein paar Gaming bezogene Videos. Aber eins muss man halt echt sagen, ich habe es letztens hier auf Twitter geschrieben. Das ist, also die Zeiten haben, übrigens drüben im Wohnzimmer liegt was Dickes hinterm Fernseher. Ich habe Chico entdeckt, die, wie sagt man, so rumgechillt hat hinterm Fernseher und kam sich dann ganz ertappt vor. Aber ich habe es ja letztens hier geschrieben auf Twitter, guck mal wie sehr sich die Zeiten ändern. Beliebtestes Video innerhalb der ersten 24 Stunden ist das Video, wo ich über Teilzeit rede. Und das unbeliebteste Video war das letzte Battlefield 6 Video. Schon geil. Früher wäre das komplett umgedreht gewesen, aber komplett. Sebaro, der Cute-Mod ist da, Leute. Wir brauchen eine Runde Ayaya-Spam in den Chat. Der Sebaro muss sich hier von Weeps umgeben fühlen, dass er öfters, öfters vorbeiguckt. Ja, nice. Das ist richtig, Venice hat ja gar keine Spieler mehr. Venice ist ja voll vorbei. Aber Venice hat es verkackt. Die haben das voll verkackt. Die hätten eins, zwei offizielle Server machen müssen mit gutem Ruleset plus Mod-Spezialitäten zum Beispiel. Aber jetzt nichts total abgedrehtes, so Sachen wie Medics können Engineer-Waffen verwenden oder irgendwie sowas in der Richtung. Dass man aber weiß, worauf man sich einlässt und das gut moderiert ist, dann hätte es auch geklappt, zumindest mit ein paar Spielern, weil es spielt, zumindest ich finde, es hat sich viel angenehmer gespielt als Vanilla. Warum klingt man auf einer Aufnahme anders, als wenn man sich selbst hört? Naja, weil wenn du dich auf einer Aufnahme hörst, ist das, was aus deinem Mund rauskommt, ins Mikrofon geht. Und was du selbst hörst, ist ja normalerweise nur Schall, der entweder aus deinem Mund rausgeht, von der Wand abgeprallt wird oder hauptsächlich hörst du dich ja über irgendwelche Schall, oder Knochenübertragungen und sonst was, hörst du dich ja selbst. Das klingt halt ganz anders. Würdest du lieber nur Twitch oder nur, oh das ist eine schwierige Frage. Würdest du lieber nur Twitch machen oder nur YouTube, wenn du eins dürftest? Okay, also ich gehe mal davon aus, mit irgendeiner Antwort, so wie Multistream oder so, kann ich mich nicht davor drücken, dass ich einfach sag, gerne stream ich auf eine Plattform, die auf alle beiden Plattformen weiter streamt. Also wenn ich nur Twitch oder nur YouTube machen würde, wenn man mal die finanzielle Art, wenn man mal das finanzielle außen vor lässt, würde ich sagen, würde ich lieber Twitch machen. Weil, weil nur hier haben wir den Hi IQ Chat, den gibt es auf YouTube, nur zum Teil. Der Chat hier ist Massify IQ LittleShana, der ist, der ist durch die Decke, also man muss sagen, ich habe eindeutig den big-brainigsten Twitch Chat, den es auf Twitch gibt. Hast du schon mal was von NA Vision? Ja, NA Vision kenne ich. NA Vision ist das, die denken, dass das Georgian oder das Georgia und Georgian das gleiche sind. Nee, aber NA Vision oder so kenne ich nicht. Nee, Vision habe ich ja nie gehört. Doch, doch, so lange schon, ja. Ab nächstem Monat muss ich, oh, das ist gut, das ist gut, huge brain. Telefonsupport ist ja auch, also Mail-Support, Support Sachen über Mail beantworten, also wenn ich die Auswahl hätte, würde ich das noch lieber machen, weil mit Leuten telefonieren ist schlimm. Ich muss euch mal was erzählen, ich habe auf der Arbeit so eine dumme Durchwahl, ich kann euch jetzt nicht genau sagen, welche, aber ich habe so eine blöde Durchwahl, die ist relativ ähnlich zu der Durchwahl für so eine Abrechnungsstelle für einen Außendienst, und manchmal verwählen die sich und rufen bei mir an und ihr könnt euch vorstellen, wenn der Außendienst bei einer Abrechnungsstelle anruft, dann sind die angepisst, weil ihre Abrechnung nicht stimmt. Da kommen die immer bei mir raus und sagen, ja, also hören sie mal, ich habe da eine Frage zu meiner Abrechnung, wie kann das sein, also Moment, Moment, ich, also ich kann ihnen nicht helfen, ich weiß nicht, um was es geht, sie sind komplett falsch, manche regen sich da noch auf, da habe ich schon immer, da habe ich immer schon Spaß dran. Auch nice, exzellent, wo sich wieder bestätigt, viel Twitch bei mir gucken, einfach Massive IQ easy Übernahme, da gibt es sicherlich noch genug, aber die riesen, diese riesen Mengen an Leuten, die dann durch die Innenstadt gerannt sind und alle nur auf ihr Handy geguckt haben, die haben ja damals sogar gewarnt davor, so nach dem Motto, Achtung Autofahrer, Pokemon Go Spieler laufen vor das Auto. Ist natürlich nicht was von Microsoft Dynamics, ich habe keine Ahnung, was das ist, so etwas wie Microsoft, das sieht so eine Mischung aus, wie als hätte man Exzellent mit SAP gekreuzt, was ist das denn, wer macht denn sowas freiwillig, ja das, das kann ein bisschen dauern, wobei man sagen muss, deswegen verwende ich auch Manjaro, weil der Installer easy ist, also nicht für Kacknoobs, für Kacknoobs ist ja schon der Ubuntu Installer zu kompliziert, der Windows Installer auch, was arbeitest du, ich arbeite als DevOps Engineer bei einer Bank in Frankfurt und falls du das genau wissen willst, hier habe ich ein Video zugemacht, kannst du über YouTube DL was von Twitch unterladen, ja das funktioniert, das unterstützt sich sein, ich glaube YouTube DL kann sogar Pornhub mittlerweile, Toss, Monkratoss, Borderlands ja, Borderlands war ein richtig geiles Game, leider kein gescheites Endgame so wirklich, übrigens, ich habe mich in dem Video von heute, ich habe mich übelst verlabert, ich finde den übrigen Thumbnail von heute, ich habe mich übelst verlabert in dem Video, und zwar hier ganz am Anfang, wo es ums Gehalt geht, da habe ich einfach zwischendrin gesagt, Alter, ich habe keinen Bock mehr auf die Fragen, ich sage jetzt einfach, was ich verdiene, und dann habe ich dann einfach gesagt, so ich verdiene das und das im Monat, so jetzt lässt es mal raus, und dann ist mir im Nachhinein eingefallen, habe ich gedacht, ok, eigentlich darf ich das, also ich darf das, theoretisch kann man das einem nicht verbieten, aber ich habe mir gedacht, bevor ich das jetzt mal so im Stream, in so einem Video raushaue, was potenziell 20.000 plus Leute gucken, ich frage nochmal, ob da, also einfach mal so, ob da jemand was dagegen hat, wenn ich das sage, ja, das heißt, ich frage mal morgen oder so meinen Chef, ob da irgendwas aus sein hat, sich dagegen spricht, normalerweise kann man das nicht untersagen, so wirklich, aber vielleicht gibt es da irgendwas, warum man meint, das ist keine so gute Idee, und ich frage den mal, und dann mache ich dann, da brauche ich so ein Clickbait, brauche ich ein Clickbait Video, Gehaltsleak, jetzt ist es raus, oder irgendwie, ne, ne, ne, das tut es zu langweilig, was brauche ich für Leute, wir brauchen guten Clickbait Titel, Alter, wie ein Cheko angucken kann, so viel verdiene ich, ja, das ist eigentlich noch viel besser, das ist schön easy, das ist schön easy, ich sage einfach, so viel, ich sage, Gehalt, Reveal, so viel, ja, das ist eigentlich ein guter Titel, bin ich reich, das ist ein guter Cheepbait, das ist ein guter, das mache ich auf Thumbnail, was mache ich auf Thumbnail, wie reich bin ich, das ist noch besser gestellt, die Frage, in einem Monat, das ist gut, also, Gehalt, Gehalt, Reveal, so viel verdiene ich in einem Monat, und auf Thumbnail mache ich den Text, wie reich bin ich, das ist so geiler Clickbait, Alter, aber, und auf dem Thumbnail muss ich dann, wollte ich gerade sagen, auf dem Thumbnail verpixel ich dann irgendwie so einen riesen Geldkoffer oder sowas, das ist eine gute Idee, so war das, perfekt, gibt es wirklich Leute, die SAP mögen, außer SAP Consultants, was genau macht SAP überhaupt, das frage ich mich bis heute, ehrlich gesagt, kann mir das jemand erklären, ich weiß es nicht, ich weiß nur, dass es teuer ist und die ganzen Business Leute das haben und Business Zeugs damit machen, naja, wie gesagt, das funktioniert, soll ich das zeigen oder glaubst du es mir, ach du Scheiße, ach du große Scheiße, das ist ja, Excel ist die Idee desjenigen, der nicht programmieren kann, also Excel ist die Idee der Manager, ach es geht nicht mehr, ach so, ja Moment, das können wir ausprobieren, ob ich YouTube DL noch machen kann, Sack, Sack, ich probiere es aus, Sack, das ist auch so eine Scheiß-MMO-Abkürzung, Sack, ne hat nichts mit Security zu tun, sondern mit Sekunde, so was laden wir jetzt mal runter, hier das da, ja mal gucken, ob das noch funktioniert, YouTube DL, aber hier, welches komische Verzeichnis, bin ich denn da gelandet, YouTube, ich kann nicht mehr tippen, YouTube DL, Pause-Camp, oh, ein Gun, YouTube DL updaten, das ist bestimmt uralt, Windows, please, updaten, YouTube DL updaten, was zum Geier macht das da, what the fuck, das soll einfach nur, das soll einfach nur YouTube DL updaten und nicht das ganze Internet, Chat, wer war das von euch, seid ihr schon drin, ach ok, das war anscheinend alles dafür nötig, dass mein YouTube DL updatet, ok guck mal, das ist über ein Jahr alt mein YouTube DL gewesen, ok probier mal aus, ob es jetzt funktioniert, sieht gut aus, ja, schreibs, das funktioniert, aber ich breche jetzt mal ab, oh kann ich da, ojeje, das traue ich RM nicht zu, das muss ich so löschen, ja ja funktioniert noch, also, warst du also nie Friseur, jetzt ist es raus Leute, ich war nie der Friseur, jetzt ist es jetzt, es hat Jahre gedauert, aber jetzt ist es raus, liegt, ABAP Programmierung, sag mal ABAP, jetzt mal ernsthaft, was ich bisher davon gesehen habe, ist es keinerlei Sprache, wo ich auch nur im Traum dran denken würde sie zu lernen, weil guckt euch das mal an, wtf, das sieht aus als hätte man Kobold und Basic miteinander verheiratet, SQL, Kobold und Basic zusammen, das Thumbnail ist, ja das Thumbnail finde ich auch ganz gut geworden, Supported Sides, guck mal hier was die da alles drin haben, guck mal was die da alles drin haben, bei YouTube DL, ist da, ist da, Moment, ja siehste, kannst du grad vorne Videos downloaden mit YouTube DL, warum das ganze Ding jetzt noch YouTube DL heißt, fragwürdig, aber ich würde so ein bekanntes Projekt auch nicht umbenennen, 94.000 Sterne, das dürfte eines der größten und bekanntesten Projekte auf GitHub sein, in was ist denn das eigentlich programmiert, das ist irgendein Python Ding oder, oder JavaScript, was ist denn das, ja, Python ist das, ja, ich hab jetzt schon, ich hab jetzt schon ein gutes Clickbait zusammen, ja genau, nicht nur verpixeln Geldkoffer, sondern irgendwie, ich weiß was ich reinmache, ich weiß was ich reinmache, so zum Witz für den Stream, weil der Stream das weiß, ich mach einen verpixelten Opel Agila in grün rein, wenn das verpixeln ist, erkennste eh nicht was das für ein Auto ist, aber der Stream weiß ja, dass ich so ein Massive Auto hab, okay, noch mal schnell Chat gucken, jaja so was mach ich, so was mach ich, Goldhaufen oder irgendwas, mach ne Winralizenz rein, nee der Witz ist mittlerweile abgefahren, das haben schon so viele Leute gemacht, so was passiert, wenn man eine Winralizenz bestellt, Leute, könnt ihr euch vorstellen, wisst ihr was passiert, wenn man eine Winralizenz bestellt, man bekommt eine Winralizenz, das wars, diese Winralizenz Videos sind die unspektakulärsten aller Zeiten, man bestellt ne Lizenz und man bekommt ne Lizenz, nein, damit hätte ich ja nie gerechnet, warum so ein altes Auto, weil ich kaum Auto fahr und das noch fährt, warum soll ich mir ein neues kaufen, warum soll ich mir ein neues kaufen, was ist heute auf dem Plan, um 22 Uhr schlafen gehen ist auf dem Plan, aha, zum Glück verdient SAP damit nicht ihr Geld, Quatsch, das kann ich nicht machen, das erkennt, Leute man darf es mit Clickbait nicht übertreiben, gerade diese Kombination ist total ausgelutscht, die Leute sind dumm, aber die Leute sind, also die sind dumm und erkennen dumme Muster, also die Leute erkennen mittlerweile, dass das Clickbait ist, ne, der Unterschied dazwischen ist, das ist nur lokal für meinen User, das ist systemweit, ja, wie gesagt, das frage ich mich auch und nein, wir machen kein Ababstream, wie hast du den Friseur kennengelernt, einfach durch YouTube damals, ihr wohnt ja, nein, nicht durch YouTube, guckt mal, mein erstes Video, mein erstes Video, ich weiß gar nicht, ob ich das überhaupt noch irgendwo hab, das ist mein erstes Video, genau, das ist mein erstes Video, das hab ich nochmal neu hochgeladen und im Abspann, den ich rausgeschnitten hab, weil ich dumm bin, ah hier nochmal komplett, genau, so und der Abspann, der Abspann von meinem allerersten Video, das kann ich euch übrigens nicht zeigen, den Abspann, weil da ist Musik drinne und zwar im Intro was von den apokalyptischen Reitern und im Outro irgendwas von den Toten Hosen, das kann, deswegen kann ich nicht abspielen, so und jetzt pass mal auf, was in meinem ersten Video im Outro drinne stand, das steht drinne, nächstes Video war wahrscheinlich Dual Kommentar mit meinem Kumpel dem Friseur, so also wie kann ich den Friseur nicht, der hatte damals, der hatte damals die ganzen Xbox Accounts, die alles so komisch geplant waren, xxderfriseur, xfriseur, iderfriseur, der hatte, der hat glaub ich, der hat keine Ahnung, Fabian hat ohne Scheiß 15 Xbox Accounts, so also ich kenne den aus dem MMO, ich kenne den Friseur nämlich aus Dark Age of Camelot, bestes MMO aller Zeiten Leute, weißte ich, hat es jemand von euch gespielt, ich gebe zu Grafik ist Massive, massiver Painz Champ in der heutigen Zeit, was will man so viele Accounts, das muss man Fabian fragen, keine Ahnung, aber bestes PvP, was es jemals gegeben hat, in einem MMO Leute, beste, ich würde es heute auf gar keinen Fall mehr spielen, ich meine es sieht schon scheiße aus, man muss mal ehrlich sehen, aber das ist schon richtig nice, man darf nicht vergessen, das sind keine NPCs, das sind alles Spieler hier auf dem Bild, alles Spieler, wurde mal gut aufgepilzt hier, ahja Camelot an Chained kommt wahrscheinlich nie raus in dem Tempo, wie die da weitermachen, aber ohne Scheiß Leute, bestes MMO aller Zeiten, jetzt zu spielen lohnt sich nicht mehr, jemand guckt euch das mal an, wie das ausschaut, und das checkt auch niemand mehr heute, der da neu mit anfängt, aber ansonsten ist das massiv geil, hast du das gespielt während dem Arbeitsamtkurs, also ich hab das gespielt von 2000, Moment, das kam 2011, 2001 oder so raus, ich hab das gespielt von Release, sogar ein paar Tage vorher, von Release bis 2010, habe ich das wirklich täglich gespielt, oder 2010 stimmt nicht, nein das stimmt nicht Leute, ich hab aufgehört bevor ich Youtube angefangen habe, 2009, also ich hab das gespielt von 2001 bis 2009 quasi täglich, mehrere Stunden, wobei ich die letzten zwei, drei Jahre nur noch FVR gespielt hab mit meinen acht Leuten da, abends zwei, drei Stunden, so und dann hab ich ein paar mal immer wieder reingeguckt in das Game, ich hab da tausende Stunden drinne, ey ich hab da bestimmt, frag mich nicht, 12.000 Spielstunden über alle Scheiße oder so, wie viele Stunden hatten ja, how much hours one year, ok 8.760, ja das kommt hin, ist gar kein Problem, 12.000 Stunden, easy, easy, 12.000 Stunden, ich hab das 10 Jahre gespielt, wenn ich das 10 Jahre gespielt hab, hab ich doch mal locker eineinhalb Jahre, aber mal locker eineinhalb Jahre in Zeitsatz gespielt, locker, locker, bestes, bestes MMO, ja und daher kenne ich den Fabian, wir haben auf dem gleichen Server damals gespielt und der Fabian hat damals schon das gemacht was er heute immer noch gerne macht, rerollen, das war einer der ersten 50er, das war max level damals hier in dem Game, auf dem Server oder ich weiß gar nicht ob er 50 geworden ist, zumindest eines der am höchsten gelevelten Leute zur damaligen Zeit mit der jeweiligen Klasse, der hat nämlich eine übelste Kackklasse gespielt, zumindest für Gruppen ja und irgendwann hat er einfach rerollt auf alle Charaktere, damals musste man Leute, damals musste man noch alle Charaktere löschen, dass man rerollen konnte auf einem anderen Realm, alle Charaktere gelöscht, rerollt, dann hat er aufgelevelt, 2 Monate später hat er wieder rerollt, der Fabian war wirklich, der war nur am rerollen, das war im Prinzip wie heute immer noch bei den ingl. Games spielt, ja daher kenne ich den und den Mastercrapper, den Mastercrapper kenne ich auch, also eigentlich kenne ich den Mastercrapper und über den Mastercrapper kenne ich den Fabian, so rum. MMO Freundschaften, da sieht man, da sieht man mal wieder Real Life RL Stells ist komplett overrated, ich habe Corona Quarantäne gelebt zu Zeiten wo es noch kein Corona gab, ja. So, ja ja also man kann übelst viel Geld in Autos reinhauen, wenn man will, ich habe auf der Arbeit auch so einen, der ist permanent am Autotunen, was witzig ist, also der hat übelst, der hat eben, ich glaube irgendeinen BMW hat er, übelst am Autotunen und auch laufen sich irgendwelche komischen Abgase, Abgasrohre und haste nicht gesehen bestellt und einmal wollte er sich bei AliExpress irgendwelche Teile bestellen, hat dann festgestellt, ah nee das wird aber zu heiß und dann vertraut er dem Chinesen Kram nicht, dass wenn es so heiß wird, dass es da nicht schmilzt oder so und irgendwann ist dann seine Freundin schwanger geworden, da meinte er so ein halbes Jahr später, ey man, es war eine scheiß Idee mit dem Auto, hättest du es mal gewusst, hättest du es nicht gemacht, hättest du mir ein anderes Auto gekauft, nicht getutet, jetzt braucht er die Kohle und das Auto will natürlich so keiner haben, Pech gehabt, tja, aber ich mein vielleicht, vielleicht hätte er die Freundin nicht gekriegt ohne das Auto, man weiß es ja nie, ja, du hast ein vollverschlüsseltes Arch, gut Job, Leute, ich hab echt ein Problem, ist ernsthaft, ich komm mit meinen, also ich komm nicht mit den Leuten klar, die in meinem Alter sind, also so, so auf persönlicher, persönlicher Ebene komm ich mit 99% der Leute in meinem Alter nicht klar, ist einfach so, also klar schon mit Leuten, die ähnlich denken wie ich und auch irgendwie Gaming-Gedöns machen und da im Internet sich auskennen und sonst wie, aber ohne scheiß 99% der 36 oder 35 plus Jährigen, mit denen komm ich nicht klar, das sind so ganz komische Leute, das sind Leute, die gehen irgendwie noch auf Facebook und posten irgendwelche komischen Bildchen und lachen sich da drüber kaputt und so, so Dinge, die seit 10 Jahren outdated sind, ja, das sind Leute, die denken, keine Ahnung, Pepe wäre was für Nazis oder so, die checken gar nichts, was im Internet abgeht, ja, Facebook, ja, richtig Pains-Champ, ich mein hier im Chat nicht, im Chat die Leute hier, weiß ich, die wären sonst ja nicht da, ja ich komm auch mit, das stimmt schon, ich komm auch mit 99% der anderen Leuten nicht klar, alter Mädchen 2 hör mal auf, sowas kommt als nächstes, Everquest, gibt's da wohl Leute, die noch extrem reincripen, ja, aber das Spiel ist eigentlich mehr oder weniger dead, wenn du Dark dir ein bisschen angucken willst, dann spiel auf dem Free-Shart, der hat noch ganz gute Spielerzahlen, kannst auch ESO spielen, wenn du zumindest ein Spiel haben willst, was von manchen der Dark-Beteiligten mitentwickelt wurde, aber ESO hat mit Dark an sich gar nichts zu tun, ein bisschen das PvP vielleicht, aber ansonsten eigentlich, guck, der hat ganz gute Spielzahlen, ich mein mehr als wenn es, ne, für das ohne Scheiß, für das, dass das ein Free-Shart ist, für das, dass das ein Free-Shart ist, ist das nicht schlecht am Wochenende 2000 Spieler hier am Start, ne, man muss hier die ganzen Reiche zusammenrechnen, oh ist schon in Ordnung, ja ich hab halt hier auch auf dem Free-Shart gespielt, hier so bis, bis keine Ahnung, hier so irgendwie Mitte, Mitte, Ende letzten Jahres irgendwie so und ich hab ja auch schon wieder nen übelst High-Rank-Solo-Char und bin voll reingesuchtet ein paar Monate, doch, doch hab ich auch, aber ich muss dir ehrlich sagen, ich bin mit World of Warcraft nie warm geworden, das lag aber da dran, weil entgegen Internetmeinung hat World of Warcraft MMOs nicht erfunden, das ist ja so ein bisschen ein Running-Gag, viele Leute schreiben das mittlerweile so aus Spaß rein, obwohl sie eigentlich wissen, dass es nicht so ist, weil in der Zeit lang die Leute das wirklich dachten, wo gleich first MMO und sowas in der Richtung, World of Warcraft, ihr werdet lachen, World of Warcraft galte damals, unter den damals quasi schon hart eingesottenen MMO-Spielern als Kinder-MMO, als weichgespültes Kinder-MMO, ich mein, damit hatten sie nicht unrecht, wenn man sich guckt, was da für komische Gestalten teilweise rumgerannt sind, heute ist World of Warcraft für viele so das nostalgische beste Game ever, das Snoop-MMO, was gar nicht stimmt, ne, geradezu zu Classic schonmal, schonmal gar nicht, weil das, das war sicherlich nicht schwer, gerade im Vergleich zu heut irgendwelchen High-End-Rate-Geschichten, aber das Knowledge hat ihr damals halt komplett gefehlt, doch, doch, ich hab auch ein bisschen World of Warcraft gespielt, aber nie, der großartig gesuchtet wie Dark, Quick-Maths-Big-Prain hier im Kopf, wie kommt es wieder, tja, das ist ne gute Frage, wie kommt es, dass ich wieder so viele Videos mache, Leute, jetzt, ich hab ne Frage, der Chat weiß ja sowas manchmal besser als ich, wisst ihr, warum das so ist, ich weiß es nicht, warum mach ich ausgerechnet jetzt wieder Videos und hab die letzten sechs Jahre keine gemacht, na, Stonks kanns nicht sein, für Stonks hätt ich die letzten sechs Jahre überhaupt Videos machen können, weil's Bock macht, ja, das ist richtig, aber warum jetzt auf einmal wieder, ich glaube, ich weiß warum, Leute, ich weiß warum, Moment, ich kanns euch zeigen, warum ich wieder Videos mach, ähm, und zwar, ich hab ja irgendwann mal im Dezember, genau, ich hab irgendwann im Dezember mal das Video zu Black Friday gemacht, dann hab ich wieder ein paar Wochen nix gemacht, hab ich mir gedacht, ey, weißt was, ich mach noch ein Weihnachtsgeschenke-Video und dann gab's Battlefield 3 für umsonst auf Steam oder Origin, irgendwo, gab's das umsonst, so, und dann hab ich mir gedacht, alter, nimmst jetzt einfach ein paar Battlefield-Videos auf, hab ich ja dann hier auch gemacht und gleichermaßen hatte ich die Idee, warum mach ich nicht einfach mal ein paar IT-Technik-Videos und dann hab ich dann damit angefangen, hab ich mir gedacht, das ist eigentlich ganz cool, weil ich hatte ja auch so ein bisschen das Problem, ich konnte nicht so wirklich gamingbezogenen Content machen, weil, was willst du machen, großartig, wenn es grad kein Game gibt, wo du Bock drauf hast. Ne, mit Corona hat das gar nix zu tun. Corona hat das gar nix zu tun. Das ist ne gute Frage. Würdest du zurückblickend sagen, dass die Zeit verschwendet war, also du meinst die Zeit, diese 12.000 Stunden oder was auch immer, wo ich da auch gespielt hab? Nö, warum? Ich würde mir sogar eher wünschen, ich könnte noch weiterspielen, aber das Game ist halt dead. Ich würde mich freuen, wenn ich heute noch Kreisel-Grind machen könnte. Da hab ich übrigens auch mal ein Video zugemacht in letzter Zeit. Nö, überhaupt nicht. Gar nicht. Ich würd mir sogar umgedreht eher wünschen, dass es wieder ein Game gibt, wo ich 12.000 Stunden grinden will. Der Archlinux-Nerd ist am Start. Danke schön für den Prime Sub. Ja, das ist wichtig. Das ist unglaublich wichtig. Das muss man immer mitteilen den Leuten. Ich benutze übrigens auch Archlinux. Ich weiß nicht, ob ich dir schon mal erzählen hab. Wobei, geht man Jaro als Archlinux durch? Ich mein, das ist ein Archlinux, hat aber so ein paar Zwischenrepos. Das ist nicht pures Arch, oder? Man muss leiden bei der Installation. Ja, Stripes, dann kann man das jetzt nicht gehen. Das ist eine geile Idee. Das ist eine geile Idee für mein MMO-Video. Ich war jahrelang ein Lockdown-Prepper. Ich muss noch besser in solche Clickbait-Titel-Generation im Kopf reinkommen. Ja, du vielleicht nicht. Das kann man wahrscheinlich so pauschal nicht sagen. Es gibt bestimmt genug Leute, die haben da kein Problem damit. Und warum? Ich meine, da magst du wenigstens eine Sache an dir, dein Auto. Also ich mein, ich bezieh's jetzt nicht explizit auf dich, sondern klar, seit letztem Tag hat sich auch wieder übelst einer geflamed gefühlt im Chat, weil ich gesagt hab, dich, obwohl ich gar nicht dich gemeint hab, den das geschrieben hat. Ja, das kommt auch dazu. Also ich komm auch mit 99% der Leute nicht klar. Ja, ist echt so. Also die Sache ist halt ernsthaft so. Ich kann mir nicht vorstellen, dass ich bald 40, also bald, bald ist übertrieben, ich werd 37 dieses Jahr, dass ich bald 40 werde. Man muss sich das mal vorstellen. Ich werd 40. Ab da geht's los, dass Frauen in die Wechseljahre kommen, ey. Mit 40, so ungefähr. Da geht's langsam los. Langsam. Ich sag jetzt nicht instance vorbei. Muss ich mal vorstellen, ich bin schon in so einem Alter. Das kann man sich gar nicht vorstellen. Zum Glück bekommen Männer sowas nicht. Du musst mal Kinder zeugen. Ja, ich weiß, ey. Wenn ich Kinder will, da muss jetzt, da muss jetzt ran. Ja, hast du recht. Aber ich will gar keine Kinder. Ich glaub, das ist alles der schlimmsten Sachen, die ich mir gerade vorstellen könne, Kinder zu kriegen. Dann ist vorbei. Mit Daily Stream. Dann ist Schluss. Also außerdem, da hängt irgendwas an meiner Decke. Ah, das ist ein Fussel. Ich muss mal kurz gucken, was da an meiner Decke hängt. MonkaS, MonkaS. Nee, das ist wirklich nur ein Fussel. Das ist wirklich nur ein Fussel. Ähm, das wollte ich jetzt gerade sagen. Ja, dann ist vorbei, wenn ich Kinder krieg mit Daily Stream. Mal davon abgesehen. Um Kinder zu kriegen fehlt mir ja auch ein ganz entscheidendes, äh, was man da, was man da noch dazu braucht, ja. Also, insofern ist das eh keine Option aktuell. Geld, das auch. Geld, Geld hast du nie genug. Ja, ich mein, ohne Frau wird da schwierig, ja. Ich mein, in der heutigen Zeit, ja, ne, gibt's ja nichts, was nix gibt, aber das funktioniert noch nicht so. Da stimmt, gleichaltrige Menschen sind ganz merkwürdig. Ich hab paar Softwareprojekte für die Arbeit tatsächlich nach meinem neuen Benamungsschema benannt. Beispielsweise hab ich letztens, ähm, einen, ähm, was gebastelt, was ich mit zwei Fakta-Authentifizierung anmelden kann. Das ist der Orth-Champ. Und, äh, wir hatten auch schon den Proxy-Champ und den Performance-Champ hatten wir auch schon. Ja, ganz wichtig. Also, falls, falls sich mal jemand irgendwie irgendwo neu anfängt und loggt sich auf dem Linux-Surfer ein und ihr seht dann, dass irgendwo im Root-Verzeichnis irgendwas mit Champ rumliegt, dann habt ihr wahrscheinlich Überbleibseln von mir gefunden. Gibt bestimmt oder garantiert. Äh, selten. Ah, richtig Hardcore-Arch. By the way, User. Es ist vorbei, das werden wir nicht mehr sehen. Glaubst du, wird es in nächstem Jahr noch neue Battlefield-Games geben? Ja, glaub ich. Also, es sagen ja viele, wenn das neue Battlefield-Game nicht gut, also nicht gut ankommt, dann ist die Reihe tot. Leute, es ist nix tot, was nicht bis zum letzten möglichen Cent gemolken ist. Guckt euch mal an, was EA beispielsweise gemacht hat mit Medal of Honor. Das war schon nicht gut, das Reboot und danach kommt noch ein zweites, es war auch nicht gut. Und dann kommen noch irgendwelche Mobile-Games im Zweifelsfall vorn. Oder guckt euch mal Dungeon-Keeper an. Kennt jemand von euch noch Dungeon-Keeper? Eines der besten Spiele aller Zeiten. Das hat EA auch komplett zerstört mit irgendeinem komischen Mobile-Game zum Schluss. Für die Zoomer unter uns, die das nicht mehr kennen, Leute. Dungeon-Keeper. Eines der besten Games überhaupt. Das ist Dungeon-Keeper 2. Dungeon-Keeper, ja. So, und da gab es in irgendwann Jahrzehnte später so ein Mobile-Game vorn und es war einfach schlecht. Einfach nur schlecht. Und man musste irgendwie drei Tage warten, bis man einen neuen Block abbauen kann und sowas. Einfach nur schlecht. Und dann war es tot. Also, selbst wenn Battlefield floppt, das nächste, wird es weitere Battlefield-Games geben. 100 Pro. In irgendeiner Art und Weise wird es das geben. Ähm. Früher hab ich immer gelabert. Und fand mich dann übelst geil, dass ich 20 Minuten zu einem Thema labern kann, aber mittlerweile mach ich so, ich schreib mir ein paar Punkte auf, weil ich, weil ich hab mir selbst ja die ein oder anderen alten Videos angeguckt und hab einfach festgestellt, vom Inhalt her ist das schon okay, aber das ist einfach viel zu lang. Also viel zu, viel zu viel zwischendurch. So, und jetzt hab ich ein paar Punkte. Manchmal auch ein paar Punkte geben, ja. So. Äh, ich muss dir ehrlich sagen, ich hab noch nie nen Gentoo installiert. Das einzige Mal, wo ich Gentoo wirklich live im Einsatz gesehen hab, ist bei uns einem auf der Arbeit, der hat ein neues Notebook bekommen, ne. Kein Notebook, stimmt nicht. Ne VM. Ne VM und, äh, oder doch ein Notebook, ich weiß es nicht aus dem Prinzip, egal, und wollte sich darauf nen Gentoo installieren und hat drei Tage gebraucht, weil das zigmal neu kompilieren musste, dass der Colonel seinen Netzwerkkartentreiber überhaupt enthält. Also, ich glaube, das will ich nicht machen. Ja, dann ist kein Wunder, dass es nicht geht. Warum denn eigentlich nicht? Ich mein, du kannst User-Repos verwenden. Ich mein, es ist halt ein bisschen einfacher für Kacknoobs, ne, aber, na gut, das ist klar, die echten Hardcore-Artschleute wollen das natürlich nicht. Wie? Man kann Artschleute halbwegs komfortabel installieren? Wird das jetzt auch zum Nuke-Betriebssystem? Only Suckless-Software, ja, ich verwende auch nur Suckless-Software, wobei ich sagen muss, ich hab mal ne Zeit lang das Suckless-Terminal verwendet. Suckless-Terminal, ich verwende heute noch den Suckless-Screen-Log. Leute, die keine Ahnung haben, wovon ich spreche, wissen wahrscheinlich null, was ich meine. Suckless ist irgendeine Entwicklergruppe, die komische Open-Source-Software für Linux macht, die im Prinzip nichts kann, aber schön in C programmiert ist. Was macht dein 3D-Drucker? Der ist gerade aus und steht rum. Was will er denn auch machen? Ja, der Artschleutung-Speedrun, wir haben letztens in den Artsch-Install-Speedrun geguckt, der war glaub ich in 1,5 Minuten durch oder so. Kann Mikrotik, ja, können sie. Die können angeblich sogar mittlerweile mit, entweder ist es schon in der offiziellen Firmware oder mit irgendeinem Beta-Package, können die sogar angeblich WireGuard mittlerweile. Da bin ich nicht agil genug für. Ich glaube, ich glaube, er ist, wann ist er geboren? 1988, 1985? Irgendwie, wir sind ungefähr ins, ich glaube, ich bin einen Ticken älter. Aber dass ich sehr wie Monte bin, würde ich jetzt mal nicht so unterschreiben. Keine Ahnung, ich weiß nicht. Ich meine, ich kenne ihn nicht wirklich gut, aber ich würde sagen, eher nicht. Die biologische Uhr läuft ab, ja. Das könnte man natürlich machen, wenn ich es mir mit 90 dort noch mal anders überlege. Was machst du heute? Ich gehe in einer halben Stunde schlafen. Ja, dass sie schneller müde sind, das kann, das kenne ich, das kenne ich. Das kenne ich. Das kenne ich, das kenne ich. Ich glaube, ich glaube, der Zug ist abgefahren. Twitch soll günstiger werden. Echt? Globale Community durch lokale Preise für Abonnements aufbauen. Was soll denn lokale Preise sein? Alter, Wall of Text. Meine Güte, ey, mehr Text. Alter, steht da auch irgendwas? Ach, erste Länder, Mexiko und die Türkei. Was interessiert mich denn, was die Türken und die Mexikaner machen? Sobald sich das machen kann, mache ich das auch günstiger. Sobald es bei mir das günstiger möglich ist, mache ich das günstiger. Wisst ihr, was noch geiler wäre? Es wird günstiger, aber man müsste Twitch nicht mehr so viel von abgeben. Ja, nach Indien oder so wahrscheinlich. Wobei, Indien ist ja Out zum Outsourcen. Hab ich so den Eindruck. Nee. Geh ich nicht drauf, wer weiß, was da dahinter ist. Guck mal, wenn schon mal eine Vorschau nicht lädt, das heißt irgendwas. So sieht es aus, das habe ich tatsächlich schon mal gemacht. Ich habe tatsächlich schon mal was kommodiert mit Gagway in einem Komet. Das gibt es garantiert noch. Aber es gibt viel weniger solcher Games. Könnt ihr euch noch dran erinnern, noch vor gar nicht allzu vielen Jahren gab es total viele G-Bait Links, so nach dem Motto, boah, guck dir mal das hier an. Und dann hast du dann draufgeklickt und dann kam es noch auf so einer Seite raus, haha, sie wurden erwischt, ihnen wurden 270 Credits abgenommen, registrieren sie sich jetzt auch hier. So diese G-Bait Games, wo es darum ging, die Leute mit einem Link rein zu G-Baiten, gibt es gar nicht mehr. Gibt es gar nicht so wirklich mehr. Du meinst du das Remake von Alarmstufe Rot, das war tatsächlich gut, ja? Alarmstufe Rot war aber auch so ein Kindheitsgame bei mir. Ich wusste gar nicht, dass es ein Generals Remake gibt. Es gibt ein Generals Remake, wirklich? Ah, das ist ein Mod. Aha, wusste ich gar nicht. Ja, das Portal Mod, da habe ich ja nicht gespielt. Wusste ich gar nicht, dass es da ein Mod zu gibt, das ist cool. Stellt euch vor, Battlefield 6 Free to Play. Also wie gesagt, ich glaube nicht, dass es Free to Play wird. Eventuell so eine Mini Basic Version am Wochenende oder so, keine Ahnung, aber das Battle Royale, und das ist so sicher wie das Armen in der Kirche, ich weiß nicht warum Leute überhaupt noch vermuten, das könnte ein Battle Royale, das ist sicher, das Battle Royale wird es geben. 100%. Die sehen was Warzone für eine Kohle macht, die sehen es selbst, die sehen auch selbst was Apex für eine Kohle macht. Und Apex und so ein modernes Military Setting, ich würde sagen, die haben nicht so viele Schnittmenge, oder die, die sich überschneiden sind wahrscheinlich überschaubar, und das spricht einfach noch mal zusätzliche, eine Riesenanzahl zusätzlicher Leute an. Und dann haben die Apex und Battlefield Battle Royale, ist doch kein Unterschied. Also das glaubt nicht, dass das denen sonderlich viel Selbstkonkurrenz macht, aber das ist sicher, das wird es geben, 100%. Ja gut, du kannst ja erstmal zwei Tage warten. Es braucht auf jeden Fall viel RAM und Festplattenplatz. Ne, weiß ich nicht, ich hab auch noch nichts von EA gehört, ich hab euch ja gestern erzählt, dass ich ne Einladung gekriegt hab, oder ne Einladung bekomme, eventuell, wenn ich zustimme, dass ich nichts sage, was die mir dann mitteilen werden. Öffentlich bis zum so und so finden. Ich hab auch nix bekommen, also mal gucken, mal gucken, was da so kommt. Also es könnte sein, dass die für die, also was ich vermute ist, was ich vermute ist, und ich hab ja noch nichts bekommen von denen, deswegen kann ich jetzt einfach mal vermuten, ich vermute mal die wollen wahrscheinlich ein bisschen Gameplay oder Zeug auch sammeln für ihren Reveal Stream. Und vielleicht haben wir Glück, und wir sehen mein Name im Reveal Stream dann irgendwann im Killfeed aufploppen oder so, wenn sie zwei Minuten Multiplayer zeigen. Also, mein Ingame Name. Info Holden. Sebaro weiß es. Ne, ich glaube so heiße ich nur Bad Company 2. Nicht Info Holden. Doch ohne Scheiß, das mach ich. Wenn ich wirklich zu dem Event eingeladen werde, nenne ich mein Gamertag Info Holden. Das ist so richtig dumm. Vor allem die Amis checken doch eh nicht, was das heißen soll. Das ist so richtig dämlich. Aber natürlich auch für LeadSpeak, dass man es nicht so offensichtlich sieht. Cute Chat, das ist noch besser, ich nenne mich Cute Chat. Excellent. Vorhold Senpai. Na, das ist mir dann schon zu viel Reaps in. Kann meine Hochschule eigentlich sehen, was ich so im Internet reibe, wenn ich vergesse aus OpenVPN zu gehen? Ja klar oder? Nö, wahrscheinlich nicht. Ist auch eine dumme Frage. Also höchstwahrscheinlich nicht, weil die meisten Seiten mittlerweile über SSL gehen. Und Seiten, die über SSL, also HTTPS, TLS ist es ja eigentlich, wenn man korrekt sein will, gehen, sehen die auch nichts. Für alles Unverschlüsselte ja, das könnte man sehen, wenn man da irgendwie mitschneidet unterwegs, aber naja, was einer macht, denke ich eher nicht, aber man weiß ja nie. Lokale Preise, bald gibt es Subs aus Indien. Moment, das heißt, ich kann dann in Indien Subscriben, ja das ist nice. Dann wird es für die Schweizer teurer. Stimmt. Aber vielleicht wird es ja bei 5 Dollar. Sag mal, das ist doch jetzt schon teurer oder? Wir bezahlen 5 Euro oder 5 Dollar? Ist es nicht jetzt schon so? Oder wird das immer in? Ne, das kann ja nicht sein. Moment, warum kostet das 5,99 Schweizer Franken? Ne, oder? Das wäre ja noch mehr, das wäre noch jebaiteter. 479, Alter. Tja, Chat, das frage ich mich auch. Rico hat einen guten Punkt angesprochen. Wie schaffe ich es eigentlich, so wenige Subs zu haben? Wie geht das überhaupt? Vielleicht ist der Cute Chat doch nicht so cute. Sonst würden jetzt alle Subs, die noch nicht gesubbt haben, mit ihrem Prime-Sub, den sie den Monat noch frei haben. Wir sind wenige dafür Massive IQ, das ist richtig. Das funktioniert, das Sub-Jebait funktioniert immer. Domboy, Dankeschön für den Prime-Sub. Jetzt überlegt euch mal, hätte ich noch mehr Subs und jeder Sub wird euren IQ steigern, dann würde euer Kopf so aussehen mittlerweile. Das passt ja gar nicht mehr rein. Das muss langsam dosiert werden. Moment, die Copy-Pasta geht länger. Die kenne ich noch länger. Die gibt es in noch einer längeren Variante. Aber die kriege ich aus dem Kopf nicht mehr hin. Laurin2698, Dankeschön, 2 Monate Prime-Subscription. Oh jetzt kommt die Massive Copy-Pasta hier. Jetzt, jetzt. Never sub, never donated, Adblock, on stolen Laptop. Endlich muss ich euch das mal zeigen. Markieren wo wir waren. Ja, jetzt haben wir es. Never subbed, never donated, Adblock, on stolen Laptop, neighbors, Wi-Fi, mamas Haus, stolen solar panels, stolen suns, ne das ist nicht den, den ich kenne. Das ist nicht den, den ich kenne. Es gab noch irgendeinen besseren. Mein Lieblings Copy-Pasta ist aber, wo ist die Musik? Mein Lieblings Copy-Pasta war aber immer noch zu Overwatch Zeiten. Ich weiß gar nicht mehr wie das genau ging, wo man die Leute gebaitet hat mit ihrem Skill-Rating. Also sprich, ich hab dann immer in die Chats gepostet, random in irgendwelche Streams gegangen und hab dann sowas geschrieben wie bitte schreibt nicht im Chat wenn ihr nicht mindestens 2000, wenn ihr nicht mindestens Highskill seid, 2000 SR plus, 2000 SR plus ist halt nichts gewesen in Overwatch. Das hat jeder gehabt, der das Spiel zum ersten Mal gespielt hat. Dann haben sich die Leute immer richtig krass tschüben lassen, nur nach dem Motto, LOL, High, High SR, 2000 plus, LOL, K Knoob. Das war so geil, die haben sich teilweise am Anfang, haben die sich mega triggern lassen mit so sinnloser Copy-Pasta. Das hab ich immer gerne gespammt. Man darf nicht vergessen, ich war damals auch schon 33. Ne 2016, ja doch, kommt hin. Da hat der 33 jährige da gesitzt, gesessen daheim und hat einen Switch Copy-Pasta gemacht. Ich hab mich gefreut, wenn die Leute darauf angesprungen sind. Ja. Ich glaub's nicht ernsthaft euch das da anklicken jetzt, oder? Lösch die, wir können höchstens die Nachricht löschen. Das find ich gemein, sowas. Vor allem im Hinblick dessen, dass er wahrscheinlich keine Ahnung hat. Rionic on fire, ach ne, Rionic fire, soviel drei Monate, dankeschön für den Sub. Massive Subscription hier. Keine exe Download Links hier. Ja gut, dann ist die Verbindung über SSL nicht safe. Tja. Oh komm mal, 200 IQ Sub Emote, das ist, das ist auch Big Brain. Ja gut, dazu musste aber erst einmal ein Rechner dran kommen. Tja, das kommt drauf an, wie lange es diesen ganzen Kram noch gibt. Wahrscheinlich ist es gar nicht so doof, weil ich davon ausgehe, dass gerade dieses ganze Cobalt Zeug und sogar ein bisschen die Cloud verfolgen wird. Wie sinnvoll das ist, Host selbst zu lernen, beziehungsweise mein Mainframe selbst zu lernen, hab ich so meine Bedenken, weil IBM versucht ja auch, dass man den Kram bei ihnen in der Cloud laufen lassen kann. Also eigene Mainframe Hardware eher weniger, aber Cobalt und sowas, ja, ohne Scheiß, ich glaube, das lohnt sich immer noch. Aber natürlich nicht als einziges, ne. Also ich würde mich nicht darauf verlassen, dass ich jetzt einen krassen Cobalt Shop in den ersten paar Wochen finde, nachdem ich da das Cobalt Tutorial gemacht hab. Aber wenn man ein bisschen Cobalt Ahnung hat, ist es glaube ich nicht verkehrt. Es ist aber eklig, ich hab's ja selbst im Stream schon mal ausprobiert. In die Cloud verfolgt, ey, ist doch echt so. Es gibt ja mittlerweile schon Cobalt zu Java, Transpiler. Die wandeln dann alten Cobalt Code um in Java. Ich weiß jetzt nicht, was davon besser ist. Dann hat man hässliches Cobalt Transpiled zu Java. Ob das jetzt so viel geiler ist, ich weiß ja nicht. Chat, das könnt ihr nicht, ne, das kannst du nur, wenn du zu viele Channel Points hast. Kann ich das anklicken? Moment, ich muss das gerade mal checken in meiner Vorschau hier. Okay, Thumbnail Concept, zeig mal her. Ne, nein, nein, nein, nein, nein, nein, das kann ich nicht machen. Man kann es ja verdammt gesehen, die Leute fallen nicht mehr drauf rein auf so extreme Sachen. Heute muss besser Clickbaited werden. Die Leute erkennen Muster in sowas und die wissen genau, das ist ein typisches Gebate, Clickbait. Ja, die Leute sind doof, aber die Leute erkennen dofe Muster. Das ist was, das hättest du vor zwei Jahren machen können. Meinst du das mit der Mikrowelle? Das wurde mir auch vorhin empfohlen, ich hab's nicht geguckt. Ich bin begeistert, Leute, guck mal, wir haben es jetzt ernsthaft geschafft, über ne Stunde nichts anderes zu machen als zehn Fragen im Chat zu beantworten und drei, vier Sachen zu zeigen. Fertig, easy Content. Warum mach ich mir überhaupt noch Gedanken darüber, was ich im Stream zeigen könnte? Die Leute erkennen den Clickbait am Ende, drücken sie trotzdem drauf. Ich glaube, das überschätzt du, wie dumm dumme Leute sind. Also, die erkennen das schon. Hey, ich teste da nix. Wer das Video von heute nicht geguckt hat, guckt mal rein, ihr könnt das Video, weil manche schreiben, ihr guckt gerne Videos zum Einschlafen. Ihr könnt das Video zum Einschlafen gucken, da gibt's keinen Gameplay dabei. Übrigens, was mich gewundert hat in den letzten Videos, es haben ein paar Leute was geschrieben von so sinngemäß, also in dem Video, ich kann es euch einfach zeigen. Hier, genau, das haben tatsächlich einige geschrieben in dem Video und auch unter den letzten Videos, so nach dem Motto, ob es mich interessieren würde, für wen ich arbeite und ob ich Probleme damit habe, so wie wohltätig oder so mein Arbeitgeber ist und das muss ich mal ganz ehrlich, das habe ich ja auch drunter gar nicht geantwortet, aber ganz ehrlich, es ist mir zu 99% scheißegal, solang es nicht irgendwas ist mit Tierversuchen oder so oder mit, selbst wenn es ein Waffenhersteller ist, das würde ich mir vielleicht zweimal überlegen, aber wenn es viel Geld ist, ich meine, ich muss ja niemand erschießen dafür. Nee, aber, sag mal so Tierversuche und Waffenhersteller wären vielleicht so Sachen, da würde ich sagen, nee, also Tierversuche würde ich auf gar keinen Fall machen. Menschenversuche sind okay, ja, da habe ich kein Problem mit, aber Tierversuche würde ich nicht supporten. Das, da würde ich mir das überlegen, aber ansonsten ist mir das vollkommen egal, was die da irgendwie machen und es hat auch letztens unter dem Video, unter dem da vor einer geschrieben, ich glaube noch in dem Battlefield-Video, da wollte ich, ich habe mir schon fast überlegt, ob ich da mal ein eigenes Video zu machen sollte, weil ich das interessantes Comment fand, wo ich nämlich glaube, dass in der Hersteller vollkommen jebaited hat. Wenn ich es finde. Tja, nee, keine Ahnung. Da hat jemand geschrieben, er wird sich auf jeden Fall das nächste Battlefield kaufen, weil DICE öffentlich Black Lives Matter unterstützt und gerade deswegen ist das für ihn ein Pflichtkauf und ich habe mir gedacht, ich müsste zu diesem Comment eigentlich mal ein eigenes Video machen, nämlich gar nicht so sehr über irgendwelche Charity-Bewegungen oder dass man Black Lives Matter supportet, das ist glaube ich nur sekundär, sondern dass der Hersteller damit genau das erreicht, was die erreichen wollen, weil im Kern scheißen die Hersteller auf alles, was irgendwie Ethik oder irgendwas, das ist den Herstellern vollkommen egal, aber der Hersteller hat damit genau das geschafft, was er schaffen wollte, der hat sich quasi so ein schönes Image verpasst, dass sogar die Leute sagen, hey, wir unterstützen den Hersteller jetzt, also die haben quasi Sellout gemacht, die haben sich quasi so ein gutes Image damit verpasst, dass die quasi allein schon damit wieder Geld verdienen, die haben genau das erreicht, was sie wollen, weil ansonsten ist das denen vollkommen egal, egal in welche Richtung das geht, denen gehts ums Geld, denen gehts eigentlich nur ums Geld, wie gesagt, Ausnahmen bestätigen die Regeln, das ist das gleiche, das ist das gleiche, wie wenn du Leute hast, das habe ich auch unter dem letzten Video geschrieben, das ist das gleiche, wie wenn du Ölkonzerne hast, wenn du Ölkonzerne hast und die jetzt voll grün sind auf einmal, das ist denen doch auch scheißegal, die wissen einfach nur, dass es gut ankommt, das ist denen vollkommen egal und Blizzard, Blizzard waren ja eh noch die geilsten, ne, Blizzard waren eh die geilsten, so nach dem Motto, Hongkong, was, wie, null, nee nee, Hongkong scheißen wir drauf, interessiert uns überhaupt nicht, äh, Mist, wir haben zu viele Tencent-Anteile, ach nee, wie, da waren Caster im Bild, ja die schmeißen wir gleich mit raus, Blizzard voll geschissen auf Hongkong, vollkommen egal, ne, und dann drei Wochen später, so nach dem Motto, oh ja, wir stehen voll an der Seite von Black Lives Matter, es geht in dem Fall überhaupt nicht drum, ob man diese Initiativen gut oder schlecht findet, das ist einfach so, wie nennt man das, so heuschlerig alles, das kannst du nicht glauben, das kannst du einfach nicht glauben alles, es geht ihm einfach nur um das eigene Wohl und das ist das, was man erstmal realisieren muss bei der ganzen Geschichte, es geht dem nur darum, in irgendeiner Art und Weise daraus Kapital zu schlagen, sonst nix, was das Unternehmen gendert, oder das können die meinetwegen machen, das ist mir, das ist auch so ein Thema, das geht mir sonst wo vorbei, solang nicht einer von mir erwartet, dass ich jetzt irgendwelche komischen Zungenbrecher verwende, ich frag mich übrigens bis heute noch, wie die gendergerechte Variante von Bankkaufmann ist, oder von System, IT Systemkaufmann, also was ist die gendergerechte Variante von Bankkaufmann, ich war mir jetzt klar, dass man Bankkaufmann und Bankkauffrau sagen kann, aber wie macht man da ein Wort drauf, Bankkaufinnen oder wie, das ergibt keinen Sinn, eigentlich ist mir das vollkommen wurscht, solang das keiner von mir erwartet, das kann jeder machen wie er will, das kann jeder komplett machen wie er will, ich bin ja eh ein Fan von freier Entfaltung und das sollen die einfach machen, solang von mir keiner erwartet oder mir das irgendwie aufzwingen will, das klingt natürlich auch sehr sinnvoll, was ich aber witzig finde, wenn es um negative Sachen geht, dann ist das meistens in Ordnung, wenn das männlich ist, aber letztendlich juckt es mich nicht, das ist ein Thema, ganz ehrlich, ich setze mich damit auch ungern auseinander öffentlich oder generell noch ungern auseinander, weil da geht es zum größten Teil gar nicht mehr darum eine rationale nachvollziehbare an der realen Welt orientierte Sache zu machen, sondern nur um irgendwelche ideologischen Dinge durchzudrücken, von denen man sagt, keine Ahnung was das noch für ein Bezug zur Realität hat, sondern wir fantasieren uns einfach zusammen, dass es besser ist und es juckt mich nicht, es juckt mich nicht, ist mir egal, was hatte die 1 in der Uhr getan, das ist so eine Angewohnheit die ich habe, das kommt in dem Video erkläre ich es ja auch, weil die Frage kommt total oft, ich habe mir irgendwann mal eine angewöhnte 1 in die Zwischenablage zu machen, ich glaube das kommt noch aus Zeiten wo ich ICQ und sowas verwendet habe oder MMO Chats, dass ich nicht aus Versehen das falsche Copy Paste, deswegen habe ich immer mal eine Zwischenablage überschrieben, ich habe in MMOs ab und zu mal das falsche Copy Paste an die falschen Leute, das war immer peinlich, wenn du vor allem wenn es derjenige ist, über den du gerade voll ablässt hast und dann Copy Paste die in die Messager, ich habe keine Links in der Zwischenablage, ich habe meistens Texts in der Zwischenablage, aber stell dir mal vor, du bist in dem MMO und chattest da irgendwie mit 5-6 Leuten gleichzeitig und einer davon ist der übelste Depp der dir immer auf den Keks geht, aber in irgendeiner Art und Weise musst du dich doch ganz gut mit ihm stellen, dann ist es schlecht wenn du gerade einem anderen schreiben willst, alter der Kacknoob schreibt mich schon wieder an und ich sende es ihm aus Versehen, ja wusste ich, habe ich hier übrigens ausgeschaltet, weil Woop League, man weiß ja nie, der Depp ist Meister Gilden, ich muss zu sagen, ich war in MMOs nur in Ultra Elite Hardcore 247 Kreiselgrinder Gilden, ich habe mich mit Noobs in MMOs erst gar nicht abgegeben, nein ganz so schlimm war es nicht, ich war immer nur in High-Level Elite PvP Gilds, keine Zeit mit Noobs da zu groupen, das ist eigentlich total hängen geblieben, ich habe mir damals ja übelst was drauf eingebildet, weil Daok 8 vs 8 gespielt und sich übelst geil gefunden, dass man den halben Server geowned hat, was nicht schwer war, weil 90% der Spieler richtige Kacknoobs waren, die du weg Aeen konntest mit ein paar gut geskillten und gut equipten und gelevelten Chars, damals fand ich das so geil, dass wir da mit 8 Leute 50 gekillt haben, da ging mir richtig einer drauf ab, ich bin aber nicht mehr lange da, ich bin genau noch 4 Minuten da, ganz im Ernst, Passt of Exile 2, ich kann mir nicht vorstellen, dass Diablo 4 auch nur ansatzweise da rankommt, es ist schon lange nicht mehr so, dass Passt of Exile die Konkurrenz zu Diablo ist, mittlerweile ist es so, Diablo ist die Konkurrenz zu Passt of Exile, die haben gezeigt, dass man es schaffen kann, ein Game jahrelang am Leben zu halten, auch wenn, und das muss man da auch mal sagen, auch wenn in letzter Zeit sehr viele hardcore Passt of Exile Fans pissed sind auf Crying Gear Games, aber die haben es wirklich lange geschafft, dass die Fans gut auf sie zu sprechen waren, also ich kenne kaum einen Hersteller, der ein Game gemacht hat und irgendwie 8 Jahre oder so am Stück supportet hat und die Leute mochten den Hersteller, die haben es erst die letzten 1-2 Jahre verkackt, nee Patrick, das sind nicht nur die Hardcore Leute, die waren auch positiv immer Crying Gear Games gegenüber gestellt, weil die Hardcore Leute sind ja auch das, die die ganzen 300€ Skin Packs und so kaufen, die müssen wohl irgendwas an ihrer Kommunikation geändert haben, ich weiß es nicht, ich bin da nicht genug drin in diesen ganzen Passt of Exile Zeug, keine Ahnung, aber mal ganz im Ernst, Passt of Exile ist das, was sie schlagen müssen mit Diablo und nicht umgedreht, deswegen wenn ich drauf tippen müsste, wenn ich mir angucke, was Blizzard die letzten Jahre immer so gebaut hat, wenn ich mir dann angucke, was Grinding Gear Games gemacht hat, für mich ist klar, PoE 2 wird es machen, vielleicht nicht der initiale Hype, der initiale Hype hat Diablo immer, aber langfristig Passt of Exile 2 ganz klar, ja macht es, Sacred 1 mit A, das war wirklich gut, Sacred 2 fand ich auch nicht so übel, Windows Updates, ja by the way, ich müsste jetzt, vielleicht es ist 21h1, Diablo 2 Remastered, Diablo 2 ist ja auch ein Game, also du kannst eigentlich kaum was verkacken, also das hat ja auch nicht die Komplexität von dem Warcraft 3, ich glaube, man kann Diablo 2 gar nicht so richtig verkacken und ich wette, mit euch Blizzard schafft es trotzdem irgendwie, dass es am Ende schlechter ist als das Original, ja ja, wie gesagt, möglich ist es, möglich ist es, nee, Aktionshaus machen die nicht mehr, also sollten die wirklich echt Geld schütten, Diablo 2 einbauen, das ist vorbei, nee, das glaube ich nicht, aber ich glaube, sie werden es in irgendeiner Art und Weise anders verkacken, ich weiß noch nicht wie, aber die schaffen es, die schaffen es irgendwie, Leute, es ist soweit, es ist 22h, wartet mal, wen hausten wir denn, ach komm mal, der Battlefield 3 Streamsor ist wieder am Start, guck mal hier, der Battlefield 3 Streamsor, 3 in 30 Leute gucken da sogar zu und guck mal, er spielt mit I-Lesbian-Support zusammen, komm den hausten wir, haust, zack, nee er spielt nicht, Metro, was ist da los, klar ist das Metro, nee, Keg-Wade, was ist das, das ist Bazaar, nee Sand-Crossing, Sand-Crossing ist das, Sand-Crossing ist das, ich Bazaar, okay Leute, also bis denn, machts gut, CU.", "segments": [{"id": 1, "start": 0.0, "end": 18.96, "text": "So, ich bin noch mal kurzzeitig am Start, Stunde Zeit habe ich noch oder eineinhalb"}, {"id": 2, "start": 18.96, "end": 23.0, "text": "Stunden Zeit habe ich noch, so habe ich mir gedacht ich mache einfach mal Streams so an."}, {"id": 3, "start": 23.0, "end": 28.72, "text": "Wobei, warte mal, ich wollte doch eigentlich mit dem Fabian heute irgendwas machen, ne?"}, {"id": 4, "start": 28.72, "end": 30.72, "text": "Ist der da?"}, {"id": 5, "start": 30.72, "end": 32.72, "text": "Okay."}, {"id": 6, "start": 32.72, "end": 35.72, "text": "Ich wollte, wann war denn der zuletzt da?"}, {"id": 7, "start": 35.72, "end": 36.72, "text": "Ah, hier."}, {"id": 8, "start": 36.72, "end": 40.72, "text": "Ich wollte mit dem Fabian noch irgendwas machen heute, was war das denn nochmal?"}, {"id": 9, "start": 40.72, "end": 42.72, "text": "Ah, das habe ich vergessen."}, {"id": 10, "start": 42.72, "end": 45.72, "text": "Achso, mein Video-Account umziehen, genau, null."}, {"id": 11, "start": 45.72, "end": 49.72, "text": "Werde ich wahrscheinlich eh nicht mal spielen, aber schadet wahrscheinlich auch nichts,"}, {"id": 12, "start": 49.72, "end": 50.72, "text": "ne?"}, {"id": 13, "start": 50.72, "end": 55.72, "text": "Ehe noch keiner da, ich laber jetzt hier quasi komplett ins Leere."}, {"id": 14, "start": 55.72, "end": 63.72, "text": "So fühlt man sich wahrscheinlich als einer von 99% der Twitch-Streamer, wo irgendwie"}, {"id": 15, "start": 63.72, "end": 67.72, "text": "nur null oder der Vorschau-Rechner zuguckt."}, {"id": 16, "start": 67.72, "end": 71.72, "text": "Das tut mir ja teilweise auch ein bisschen leid, muss ich sagen, ne?"}, {"id": 17, "start": 71.72, "end": 77.72, "text": "Ich scroll abends manchmal auf dem Handy durch so Spiele, wo halt sonst auch kaum einer unterwegs"}, {"id": 18, "start": 77.72, "end": 84.72, "text": "ist und gucke dann durch, da gibt es echt seitenweise Leute, da guckt einfach niemand"}, {"id": 19, "start": 84.72, "end": 85.72, "text": "zu."}, {"id": 20, "start": 85.72, "end": 90.72, "text": "Also mittlerweile ist es so voll auf Twitch, wenn du nicht von irgendwo her einen anderen"}, {"id": 21, "start": 90.72, "end": 95.72, "text": "Boost kriegst, ist das wirklich verdammt lange und harte Arbeit."}, {"id": 22, "start": 95.72, "end": 100.72, "text": "Da irgendwie, und der passende Content selbstverständlich, ne?"}, {"id": 23, "start": 100.72, "end": 106.72, "text": "Das zähle ich mal unter Arbeit dabei, da was auf die Reihe zu kriegen."}, {"id": 24, "start": 106.72, "end": 113.72, "text": "Glück gehört natürlich auch ein bisschen dazu, keine Frage, aber ja."}, {"id": 25, "start": 113.72, "end": 118.72, "text": "Das ist nicht mehr wie 2010 YouTube, wo du einfach nur das richtige Game zeigen musstest,"}, {"id": 26, "start": 118.72, "end": 120.72, "text": "das instant 50k plus."}, {"id": 27, "start": 120.72, "end": 124.72, "text": "Nein, 2010 war es eher 5k plus, da war das schon viel."}, {"id": 28, "start": 124.72, "end": 129.72, "text": "Mein letztes, ach guck mal, der Twitch hat es kapiert, das ist on, nice."}, {"id": 29, "start": 129.72, "end": 135.72, "text": "Ihr seid ja am Start schon Leute, 17 Monate, Dankeschön, hypersubscription."}, {"id": 30, "start": 135.72, "end": 141.72, "text": "Oh, die Modes sind vielleicht ein bisschen thick."}, {"id": 31, "start": 141.72, "end": 148.72, "text": "Ne, der letzte Stream, den habe ich gelöscht, da war Musik in ein paar Videos drin, die"}, {"id": 32, "start": 148.72, "end": 154.72, "text": "ich geguckt habe und man weiß auf Twitch leider nicht so genau."}, {"id": 33, "start": 154.72, "end": 167.72, "text": "Okay, die Playlist gefällt mir nicht, ich muss mal was anderes machen."}, {"id": 34, "start": 167.72, "end": 172.72, "text": "Auch mal irgendwas anderes."}, {"id": 35, "start": 172.72, "end": 179.72, "text": "Ja, okay, besser, besser als nichts."}, {"id": 36, "start": 179.72, "end": 185.72, "text": "Sag mal, weiß noch irgendjemand?"}, {"id": 37, "start": 185.72, "end": 190.72, "text": "Ich wollte mir bei Amazon, warte mal, vielleicht habe ich das hier sogar schon in den Warenkorb"}, {"id": 38, "start": 190.72, "end": 192.72, "text": "reingelegt, oh, da habe ich noch ganz viel drin liegen."}, {"id": 39, "start": 192.72, "end": 194.72, "text": "Du klingst nicht gut, ne?"}, {"id": 40, "start": 194.72, "end": 198.72, "text": "Nö, nö, nö, ist alles in Ordnung."}, {"id": 41, "start": 198.72, "end": 200.72, "text": "Hör ich mich irgendwie anders an?"}, {"id": 42, "start": 200.72, "end": 201.72, "text": "Stimmt irgendwas nicht?"}, {"id": 43, "start": 201.72, "end": 202.72, "text": "Moment."}, {"id": 44, "start": 202.72, "end": 203.72, "text": "Säck, Säck, Säck."}, {"id": 45, "start": 203.72, "end": 206.72, "text": "Blablabla, Test, Test, Test, Test, wie höre ich mich an?"}, {"id": 46, "start": 206.72, "end": 210.72, "text": "Blablabla, Test, Test, Test, wie höre ich mich an, wie immer."}, {"id": 47, "start": 210.72, "end": 215.72, "text": "Übrigens, eins muss ich sagen, was die ganze YouTube und Streaming-Geschichte gebracht hat,"}, {"id": 48, "start": 215.72, "end": 222.72, "text": "ist, normalerweise hat man ja so den Reflex, wenn man seine eigene Stimme aufgenommen"}, {"id": 49, "start": 222.72, "end": 227.72, "text": "hört, denkt man, man klingt komisch."}, {"id": 50, "start": 227.72, "end": 235.72, "text": "Aber ich muss sagen, seitdem ich so viele Videos Probe gehört habe von mir und so viele Stunden"}, {"id": 51, "start": 235.72, "end": 241.72, "text": "von meinem eigenen Content angeguckt habe, ist das für mich wie ein zweiter Max."}, {"id": 52, "start": 241.72, "end": 247.72, "text": "Also quasi, ich höre mich einmal, wenn ich rede und einmal so wie ich in Videos klinge."}, {"id": 53, "start": 247.72, "end": 252.72, "text": "Also, das fällt mir überhaupt nicht mehr auf."}, {"id": 54, "start": 252.72, "end": 256.72, "text": "So, ich wollte doch mal gucken, irgendwas wollte ich mir noch letztens kaufen und ich"}, {"id": 55, "start": 256.72, "end": 262.72, "text": "glaube, das brauche ich unbedingt, was ist das für ein, Moment, das da."}, {"id": 56, "start": 262.72, "end": 266.72, "text": "Ja, genau, das da, das da wollte ich mir kaufen."}, {"id": 57, "start": 266.72, "end": 271.72, "text": "Lackierte, exzellent, lackierte Kabels wollte ich mir kaufen."}, {"id": 58, "start": 271.72, "end": 276.72, "text": "Ja, genau, genau, das muss ich unbedingt gerade mal hier nebenbei auf dem zweiten Rechner,"}, {"id": 59, "start": 276.72, "end": 279.72, "text": "Amazon."}, {"id": 60, "start": 279.72, "end": 283.72, "text": "Da bin ich nämlich echt gespannt drauf, ob das was taucht."}, {"id": 61, "start": 283.72, "end": 288.72, "text": "Das ist normal, das ist normal, aber glaub mir, du gewöhnst dich danach nicht allzu langer"}, {"id": 62, "start": 288.72, "end": 289.72, "text": "Zeit dran."}, {"id": 63, "start": 289.72, "end": 291.72, "text": "Hallo Max, ich kenne dich seit ich 14 bin."}, {"id": 64, "start": 291.72, "end": 294.72, "text": "Na gut, dann bist du jetzt wahrscheinlich, vielleicht bist du 24 oder so."}, {"id": 65, "start": 294.72, "end": 297.72, "text": "Ah, okay, schreibt es ja auch dahinter."}, {"id": 66, "start": 297.72, "end": 303.72, "text": "23, freue mich, wenn ich manchmal Zeit habe, deine YouTube Videos zu gucken, auch wenn"}, {"id": 67, "start": 303.72, "end": 305.72, "text": "ich nicht so oft mit dem Informat..."}, {"id": 68, "start": 305.72, "end": 308.72, "text": "Das hast du heute als Kommentar schon geschrieben oder zumindest jemand hat ein relativ ähnliches"}, {"id": 69, "start": 308.72, "end": 309.72, "text": "Kommentar geschrieben."}, {"id": 70, "start": 309.72, "end": 311.72, "text": "Übrigens, schön, dass du dann mich hierher gefunden hast."}, {"id": 71, "start": 311.72, "end": 317.72, "text": "Also du bist nicht der einzige, aber ich mache ja auch noch ein paar Gaming bezogene"}, {"id": 72, "start": 317.72, "end": 318.72, "text": "Videos."}, {"id": 73, "start": 318.72, "end": 321.72, "text": "Aber eins muss man halt echt sagen, ich habe es letztens hier auf Twitter geschrieben."}, {"id": 74, "start": 321.72, "end": 327.72, "text": "Das ist, also die Zeiten haben, übrigens drüben im Wohnzimmer liegt was Dickes hinterm"}, {"id": 75, "start": 327.72, "end": 328.72, "text": "Fernseher."}, {"id": 76, "start": 328.72, "end": 337.72, "text": "Ich habe Chico entdeckt, die, wie sagt man, so rumgechillt hat hinterm Fernseher und kam"}, {"id": 77, "start": 337.72, "end": 339.72, "text": "sich dann ganz ertappt vor."}, {"id": 78, "start": 339.72, "end": 345.72, "text": "Aber ich habe es ja letztens hier geschrieben auf Twitter, guck mal wie sehr sich die Zeiten"}, {"id": 79, "start": 345.72, "end": 346.72, "text": "ändern."}, {"id": 80, "start": 346.72, "end": 352.72, "text": "Beliebtestes Video innerhalb der ersten 24 Stunden ist das Video, wo ich über Teilzeit"}, {"id": 81, "start": 352.72, "end": 353.72, "text": "rede."}, {"id": 82, "start": 353.72, "end": 355.72, "text": "Und das unbeliebteste Video war das letzte Battlefield 6 Video."}, {"id": 83, "start": 355.72, "end": 356.72, "text": "Schon geil."}, {"id": 84, "start": 356.72, "end": 360.72, "text": "Früher wäre das komplett umgedreht gewesen, aber komplett."}, {"id": 85, "start": 360.72, "end": 364.72, "text": "Sebaro, der Cute-Mod ist da, Leute."}, {"id": 86, "start": 364.72, "end": 367.72, "text": "Wir brauchen eine Runde Ayaya-Spam in den Chat."}, {"id": 87, "start": 367.72, "end": 382.72, "text": "Der Sebaro muss sich hier von Weeps umgeben fühlen, dass er öfters, öfters vorbeiguckt."}, {"id": 88, "start": 382.72, "end": 387.72, "text": "Ja, nice."}, {"id": 89, "start": 387.72, "end": 395.72, "text": "Das ist richtig, Venice hat ja gar keine Spieler mehr."}, {"id": 90, "start": 395.72, "end": 397.72, "text": "Venice ist ja voll vorbei."}, {"id": 91, "start": 397.72, "end": 399.72, "text": "Aber Venice hat es verkackt."}, {"id": 92, "start": 399.72, "end": 401.72, "text": "Die haben das voll verkackt."}, {"id": 93, "start": 401.72, "end": 411.72, "text": "Die hätten eins, zwei offizielle Server machen müssen mit gutem Ruleset plus Mod-Spezialitäten"}, {"id": 94, "start": 411.72, "end": 412.72, "text": "zum Beispiel."}, {"id": 95, "start": 412.72, "end": 416.72, "text": "Aber jetzt nichts total abgedrehtes, so Sachen wie Medics können Engineer-Waffen verwenden"}, {"id": 96, "start": 416.72, "end": 418.72, "text": "oder irgendwie sowas in der Richtung."}, {"id": 97, "start": 418.72, "end": 422.72, "text": "Dass man aber weiß, worauf man sich einlässt und das gut moderiert ist, dann hätte es"}, {"id": 98, "start": 422.72, "end": 430.72, "text": "auch geklappt, zumindest mit ein paar Spielern, weil es spielt, zumindest ich finde, es hat"}, {"id": 99, "start": 430.72, "end": 433.72, "text": "sich viel angenehmer gespielt als Vanilla."}, {"id": 100, "start": 433.72, "end": 444.72, "text": "Warum klingt man auf einer Aufnahme anders, als wenn man sich selbst hört?"}, {"id": 101, "start": 444.72, "end": 449.72, "text": "Naja, weil wenn du dich auf einer Aufnahme hörst, ist das, was aus deinem Mund rauskommt,"}, {"id": 102, "start": 449.72, "end": 450.72, "text": "ins Mikrofon geht."}, {"id": 103, "start": 450.72, "end": 455.72, "text": "Und was du selbst hörst, ist ja normalerweise nur Schall, der entweder aus deinem Mund rausgeht,"}, {"id": 104, "start": 455.72, "end": 460.72, "text": "von der Wand abgeprallt wird oder hauptsächlich hörst du dich ja über irgendwelche Schall,"}, {"id": 105, "start": 460.72, "end": 464.72, "text": "oder Knochenübertragungen und sonst was, hörst du dich ja selbst."}, {"id": 106, "start": 464.72, "end": 467.72, "text": "Das klingt halt ganz anders."}, {"id": 107, "start": 467.72, "end": 479.72, "text": "Würdest du lieber nur Twitch oder nur, oh das ist eine schwierige Frage."}, {"id": 108, "start": 479.72, "end": 486.72, "text": "Würdest du lieber nur Twitch machen oder nur YouTube, wenn du eins dürftest?"}, {"id": 109, "start": 486.72, "end": 490.72, "text": "Okay, also ich gehe mal davon aus, mit irgendeiner Antwort, so wie Multistream oder so, kann"}, {"id": 110, "start": 490.72, "end": 493.72, "text": "ich mich nicht davor drücken, dass ich einfach sag, gerne stream ich auf eine Plattform,"}, {"id": 111, "start": 493.72, "end": 496.72, "text": "die auf alle beiden Plattformen weiter streamt."}, {"id": 112, "start": 496.72, "end": 501.72, "text": "Also wenn ich nur Twitch oder nur YouTube machen würde, wenn man mal die finanzielle"}, {"id": 113, "start": 501.72, "end": 505.72, "text": "Art, wenn man mal das finanzielle außen vor lässt, würde ich sagen, würde ich lieber"}, {"id": 114, "start": 505.72, "end": 506.72, "text": "Twitch machen."}, {"id": 115, "start": 506.72, "end": 515.72, "text": "Weil, weil nur hier haben wir den Hi IQ Chat, den gibt es auf YouTube, nur zum Teil."}, {"id": 116, "start": 515.72, "end": 531.72, "text": "Der Chat hier ist Massify IQ LittleShana, der ist, der ist durch die Decke, also man"}, {"id": 117, "start": 531.72, "end": 537.72, "text": "muss sagen, ich habe eindeutig den big-brainigsten Twitch Chat, den es auf Twitch gibt."}, {"id": 118, "start": 537.72, "end": 549.72, "text": "Hast du schon mal was von NA Vision?"}, {"id": 119, "start": 549.72, "end": 555.72, "text": "Ja, NA Vision kenne ich."}, {"id": 120, "start": 555.72, "end": 562.72, "text": "NA Vision ist das, die denken, dass das Georgian oder das Georgia und Georgian das gleiche"}, {"id": 121, "start": 562.72, "end": 563.72, "text": "sind."}, {"id": 122, "start": 563.72, "end": 569.72, "text": "Nee, aber NA Vision oder so kenne ich nicht."}, {"id": 123, "start": 569.72, "end": 578.72, "text": "Nee, Vision habe ich ja nie gehört."}, {"id": 124, "start": 578.72, "end": 591.72, "text": "Doch, doch, so lange schon, ja."}, {"id": 125, "start": 591.72, "end": 598.72, "text": "Ab nächstem Monat muss ich, oh, das ist gut, das ist gut, huge brain."}, {"id": 126, "start": 598.72, "end": 603.22, "text": "Telefonsupport ist ja auch, also Mail-Support, Support Sachen über Mail beantworten, also"}, {"id": 127, "start": 603.22, "end": 606.38, "text": "wenn ich die Auswahl hätte, würde ich das noch lieber machen, weil mit Leuten telefonieren"}, {"id": 128, "start": 606.38, "end": 607.38, "text": "ist schlimm."}, {"id": 129, "start": 607.38, "end": 611.4, "text": "Ich muss euch mal was erzählen, ich habe auf der Arbeit so eine dumme Durchwahl, ich"}, {"id": 130, "start": 611.4, "end": 616.16, "text": "kann euch jetzt nicht genau sagen, welche, aber ich habe so eine blöde Durchwahl, die"}, {"id": 131, "start": 616.16, "end": 624.12, "text": "ist relativ ähnlich zu der Durchwahl für so eine Abrechnungsstelle für einen Außendienst,"}, {"id": 132, "start": 624.12, "end": 627.48, "text": "und manchmal verwählen die sich und rufen bei mir an und ihr könnt euch vorstellen,"}, {"id": 133, "start": 627.48, "end": 631.12, "text": "wenn der Außendienst bei einer Abrechnungsstelle anruft, dann sind die angepisst, weil ihre"}, {"id": 134, "start": 631.12, "end": 632.12, "text": "Abrechnung nicht stimmt."}, {"id": 135, "start": 632.12, "end": 635.0, "text": "Da kommen die immer bei mir raus und sagen, ja, also hören sie mal, ich habe da eine"}, {"id": 136, "start": 635.0, "end": 640.28, "text": "Frage zu meiner Abrechnung, wie kann das sein, also Moment, Moment, ich, also ich kann ihnen"}, {"id": 137, "start": 640.28, "end": 643.68, "text": "nicht helfen, ich weiß nicht, um was es geht, sie sind komplett falsch, manche regen sich"}, {"id": 138, "start": 643.68, "end": 647.84, "text": "da noch auf, da habe ich schon immer, da habe ich immer schon Spaß dran."}, {"id": 139, "start": 647.84, "end": 658.8, "text": "Auch nice, exzellent, wo sich wieder bestätigt, viel Twitch bei mir gucken, einfach Massive"}, {"id": 140, "start": 658.8, "end": 666.68, "text": "IQ easy Übernahme, da gibt es sicherlich noch genug, aber die riesen, diese riesen"}, {"id": 141, "start": 666.68, "end": 669.88, "text": "Mengen an Leuten, die dann durch die Innenstadt gerannt sind und alle nur auf ihr Handy geguckt"}, {"id": 142, "start": 669.88, "end": 674.72, "text": "haben, die haben ja damals sogar gewarnt davor, so nach dem Motto, Achtung Autofahrer, Pokemon"}, {"id": 143, "start": 674.72, "end": 684.12, "text": "Go Spieler laufen vor das Auto."}, {"id": 144, "start": 684.12, "end": 688.16, "text": "Ist natürlich nicht was von Microsoft Dynamics, ich habe keine Ahnung, was das ist, so etwas"}, {"id": 145, "start": 688.16, "end": 710.36, "text": "wie Microsoft, das sieht so eine Mischung aus, wie als hätte man Exzellent mit SAP gekreuzt,"}, {"id": 146, "start": 710.36, "end": 724.48, "text": "was ist das denn, wer macht denn sowas freiwillig, ja das, das kann ein bisschen dauern, wobei"}, {"id": 147, "start": 724.48, "end": 729.28, "text": "man sagen muss, deswegen verwende ich auch Manjaro, weil der Installer easy ist, also"}, {"id": 148, "start": 729.28, "end": 733.44, "text": "nicht für Kacknoobs, für Kacknoobs ist ja schon der Ubuntu Installer zu kompliziert,"}, {"id": 149, "start": 733.44, "end": 743.16, "text": "der Windows Installer auch, was arbeitest du, ich arbeite als DevOps Engineer bei einer"}, {"id": 150, "start": 743.16, "end": 754.16, "text": "Bank in Frankfurt und falls du das genau wissen willst, hier habe ich ein Video zugemacht,"}, {"id": 151, "start": 754.16, "end": 757.64, "text": "kannst du über YouTube DL was von Twitch unterladen, ja das funktioniert, das unterstützt"}, {"id": 152, "start": 757.64, "end": 769.2, "text": "sich sein, ich glaube YouTube DL kann sogar Pornhub mittlerweile, Toss, Monkratoss, Borderlands"}, {"id": 153, "start": 769.2, "end": 780.28, "text": "ja, Borderlands war ein richtig geiles Game, leider kein gescheites Endgame so wirklich,"}, {"id": 154, "start": 780.28, "end": 792.68, "text": "übrigens, ich habe mich in dem Video von heute, ich habe mich übelst verlabert, ich"}, {"id": 155, "start": 792.68, "end": 801.36, "text": "finde den übrigen Thumbnail von heute, ich habe mich übelst verlabert in dem Video,"}, {"id": 156, "start": 801.36, "end": 806.48, "text": "und zwar hier ganz am Anfang, wo es ums Gehalt geht, da habe ich einfach zwischendrin gesagt,"}, {"id": 157, "start": 806.48, "end": 810.64, "text": "Alter, ich habe keinen Bock mehr auf die Fragen, ich sage jetzt einfach, was ich verdiene,"}, {"id": 158, "start": 810.64, "end": 814.04, "text": "und dann habe ich dann einfach gesagt, so ich verdiene das und das im Monat, so jetzt"}, {"id": 159, "start": 814.04, "end": 817.72, "text": "lässt es mal raus, und dann ist mir im Nachhinein eingefallen, habe ich gedacht, ok, eigentlich"}, {"id": 160, "start": 817.72, "end": 823.0, "text": "darf ich das, also ich darf das, theoretisch kann man das einem nicht verbieten, aber ich"}, {"id": 161, "start": 823.0, "end": 828.0, "text": "habe mir gedacht, bevor ich das jetzt mal so im Stream, in so einem Video raushaue, was"}, {"id": 162, "start": 828.0, "end": 834.32, "text": "potenziell 20.000 plus Leute gucken, ich frage nochmal, ob da, also einfach mal so,"}, {"id": 163, "start": 834.32, "end": 841.88, "text": "ob da jemand was dagegen hat, wenn ich das sage, ja, das heißt, ich frage mal morgen"}, {"id": 164, "start": 841.88, "end": 847.0, "text": "oder so meinen Chef, ob da irgendwas aus sein hat, sich dagegen spricht, normalerweise"}, {"id": 165, "start": 847.0, "end": 851.88, "text": "kann man das nicht untersagen, so wirklich, aber vielleicht gibt es da irgendwas, warum"}, {"id": 166, "start": 851.88, "end": 856.96, "text": "man meint, das ist keine so gute Idee, und ich frage den mal, und dann mache ich dann,"}, {"id": 167, "start": 856.96, "end": 861.24, "text": "da brauche ich so ein Clickbait, brauche ich ein Clickbait Video, Gehaltsleak, jetzt ist"}, {"id": 168, "start": 861.24, "end": 865.4, "text": "es raus, oder irgendwie, ne, ne, ne, das tut es zu langweilig, was brauche ich für Leute,"}, {"id": 169, "start": 865.4, "end": 877.44, "text": "wir brauchen guten Clickbait Titel, Alter, wie ein Cheko angucken kann, so viel verdiene"}, {"id": 170, "start": 877.44, "end": 883.72, "text": "ich, ja, das ist eigentlich noch viel besser, das ist schön easy, das ist schön easy, ich"}, {"id": 171, "start": 883.72, "end": 897.6, "text": "sage einfach, so viel, ich sage, Gehalt, Reveal, so viel, ja, das ist eigentlich ein guter Titel,"}, {"id": 172, "start": 897.6, "end": 903.12, "text": "bin ich reich, das ist ein guter Cheepbait, das ist ein guter, das mache ich auf Thumbnail,"}, {"id": 173, "start": 903.12, "end": 923.28, "text": "was mache ich auf Thumbnail, wie reich bin ich, das ist noch besser gestellt, die Frage,"}, {"id": 174, "start": 923.28, "end": 928.8, "text": "in einem Monat, das ist gut, also, Gehalt, Gehalt, Reveal, so viel verdiene ich in einem"}, {"id": 175, "start": 928.8, "end": 938.44, "text": "Monat, und auf Thumbnail mache ich den Text, wie reich bin ich, das ist so geiler Clickbait,"}, {"id": 176, "start": 938.44, "end": 944.16, "text": "Alter, aber, und auf dem Thumbnail muss ich dann, wollte ich gerade sagen, auf dem Thumbnail"}, {"id": 177, "start": 944.16, "end": 951.64, "text": "verpixel ich dann irgendwie so einen riesen Geldkoffer oder sowas, das ist eine gute"}, {"id": 178, "start": 951.64, "end": 966.8, "text": "Idee, so war das, perfekt, gibt es wirklich Leute, die SAP mögen, außer SAP Consultants,"}, {"id": 179, "start": 966.8, "end": 971.96, "text": "was genau macht SAP überhaupt, das frage ich mich bis heute, ehrlich gesagt, kann mir"}, {"id": 180, "start": 971.96, "end": 975.92, "text": "das jemand erklären, ich weiß es nicht, ich weiß nur, dass es teuer ist und die ganzen"}, {"id": 181, "start": 975.92, "end": 987.12, "text": "Business Leute das haben und Business Zeugs damit machen, naja, wie gesagt, das funktioniert,"}, {"id": 182, "start": 987.12, "end": 1001.6, "text": "soll ich das zeigen oder glaubst du es mir, ach du Scheiße, ach du große Scheiße, das"}, {"id": 183, "start": 1001.6, "end": 1011.92, "text": "ist ja, Excel ist die Idee desjenigen, der nicht programmieren kann, also Excel ist die"}, {"id": 184, "start": 1011.92, "end": 1024.2, "text": "Idee der Manager, ach es geht nicht mehr, ach so, ja Moment, das können wir ausprobieren,"}, {"id": 185, "start": 1024.2, "end": 1032.16, "text": "ob ich YouTube DL noch machen kann, Sack, Sack, ich probiere es aus, Sack, das ist auch"}, {"id": 186, "start": 1032.16, "end": 1038.8, "text": "so eine Scheiß-MMO-Abkürzung, Sack, ne hat nichts mit Security zu tun, sondern mit Sekunde,"}, {"id": 187, "start": 1038.8, "end": 1046.44, "text": "so was laden wir jetzt mal runter, hier das da, ja mal gucken, ob das noch funktioniert,"}, {"id": 188, "start": 1046.44, "end": 1054.04, "text": "YouTube DL, aber hier, welches komische Verzeichnis, bin ich denn da gelandet, YouTube, ich kann"}, {"id": 189, "start": 1054.04, "end": 1069.36, "text": "nicht mehr tippen, YouTube DL, Pause-Camp, oh, ein Gun, YouTube DL updaten, das ist bestimmt"}, {"id": 190, "start": 1069.36, "end": 1086.44, "text": "uralt, Windows, please, updaten, YouTube DL updaten, was zum Geier macht das da, what"}, {"id": 191, "start": 1086.44, "end": 1092.08, "text": "the fuck, das soll einfach nur, das soll einfach nur YouTube DL updaten und nicht das ganze"}, {"id": 192, "start": 1092.08, "end": 1103.88, "text": "Internet, Chat, wer war das von euch, seid ihr schon drin, ach ok, das war anscheinend"}, {"id": 193, "start": 1103.88, "end": 1107.84, "text": "alles dafür nötig, dass mein YouTube DL updatet, ok guck mal, das ist über ein Jahr alt mein"}, {"id": 194, "start": 1107.84, "end": 1119.48, "text": "YouTube DL gewesen, ok probier mal aus, ob es jetzt funktioniert, sieht gut aus, ja,"}, {"id": 195, "start": 1119.48, "end": 1130.52, "text": "schreibs, das funktioniert, aber ich breche jetzt mal ab, oh kann ich da, ojeje, das traue"}, {"id": 196, "start": 1130.52, "end": 1143.32, "text": "ich RM nicht zu, das muss ich so löschen, ja ja funktioniert noch, also, warst du also"}, {"id": 197, "start": 1143.32, "end": 1153.88, "text": "nie Friseur, jetzt ist es raus Leute, ich war nie der Friseur, jetzt ist es jetzt, es hat"}, {"id": 198, "start": 1153.88, "end": 1167.44, "text": "Jahre gedauert, aber jetzt ist es raus, liegt, ABAP Programmierung, sag mal ABAP, jetzt mal"}, {"id": 199, "start": 1167.44, "end": 1172.28, "text": "ernsthaft, was ich bisher davon gesehen habe, ist es keinerlei Sprache, wo ich auch nur"}, {"id": 200, "start": 1172.28, "end": 1179.4, "text": "im Traum dran denken würde sie zu lernen, weil guckt euch das mal an, wtf, das sieht"}, {"id": 201, "start": 1179.4, "end": 1202.72, "text": "aus als hätte man Kobold und Basic miteinander verheiratet, SQL, Kobold und Basic zusammen,"}, {"id": 202, "start": 1202.72, "end": 1213.36, "text": "das Thumbnail ist, ja das Thumbnail finde ich auch ganz gut geworden, Supported Sides,"}, {"id": 203, "start": 1213.36, "end": 1219.92, "text": "guck mal hier was die da alles drin haben, guck mal was die da alles drin haben, bei"}, {"id": 204, "start": 1219.92, "end": 1228.04, "text": "YouTube DL, ist da, ist da, Moment, ja siehste, kannst du grad vorne Videos downloaden mit"}, {"id": 205, "start": 1228.04, "end": 1235.52, "text": "YouTube DL, warum das ganze Ding jetzt noch YouTube DL heißt, fragwürdig, aber ich würde"}, {"id": 206, "start": 1235.52, "end": 1240.32, "text": "so ein bekanntes Projekt auch nicht umbenennen, 94.000 Sterne, das dürfte eines der größten"}, {"id": 207, "start": 1240.32, "end": 1243.48, "text": "und bekanntesten Projekte auf GitHub sein, in was ist denn das eigentlich programmiert,"}, {"id": 208, "start": 1243.48, "end": 1255.84, "text": "das ist irgendein Python Ding oder, oder JavaScript, was ist denn das, ja, Python ist das, ja,"}, {"id": 209, "start": 1255.84, "end": 1278.2, "text": "ich hab jetzt schon, ich hab jetzt schon ein gutes Clickbait zusammen, ja genau, nicht"}, {"id": 210, "start": 1278.2, "end": 1283.52, "text": "nur verpixeln Geldkoffer, sondern irgendwie, ich weiß was ich reinmache, ich weiß was"}, {"id": 211, "start": 1283.52, "end": 1295.92, "text": "ich reinmache, so zum Witz für den Stream, weil der Stream das weiß, ich mach einen"}, {"id": 212, "start": 1295.92, "end": 1302.04, "text": "verpixelten Opel Agila in grün rein, wenn das verpixeln ist, erkennste eh nicht was"}, {"id": 213, "start": 1302.04, "end": 1326.36, "text": "das für ein Auto ist, aber der Stream weiß ja, dass ich so ein Massive Auto hab, okay,"}, {"id": 214, "start": 1326.36, "end": 1333.84, "text": "noch mal schnell Chat gucken, jaja so was mach ich, so was mach ich, Goldhaufen oder"}, {"id": 215, "start": 1333.84, "end": 1340.72, "text": "irgendwas, mach ne Winralizenz rein, nee der Witz ist mittlerweile abgefahren, das haben"}, {"id": 216, "start": 1340.72, "end": 1345.88, "text": "schon so viele Leute gemacht, so was passiert, wenn man eine Winralizenz bestellt, Leute,"}, {"id": 217, "start": 1345.88, "end": 1350.92, "text": "könnt ihr euch vorstellen, wisst ihr was passiert, wenn man eine Winralizenz bestellt,"}, {"id": 218, "start": 1350.92, "end": 1357.48, "text": "man bekommt eine Winralizenz, das wars, diese Winralizenz Videos sind die unspektakulärsten"}, {"id": 219, "start": 1357.48, "end": 1362.56, "text": "aller Zeiten, man bestellt ne Lizenz und man bekommt ne Lizenz, nein, damit hätte ich"}, {"id": 220, "start": 1362.56, "end": 1370.08, "text": "ja nie gerechnet, warum so ein altes Auto, weil ich kaum Auto fahr und das noch fährt,"}, {"id": 221, "start": 1370.08, "end": 1379.02, "text": "warum soll ich mir ein neues kaufen, warum soll ich mir ein neues kaufen, was ist heute"}, {"id": 222, "start": 1379.02, "end": 1398.08, "text": "auf dem Plan, um 22 Uhr schlafen gehen ist auf dem Plan, aha, zum Glück verdient SAP"}, {"id": 223, "start": 1398.08, "end": 1403.68, "text": "damit nicht ihr Geld, Quatsch, das kann ich nicht machen, das erkennt, Leute man darf"}, {"id": 224, "start": 1403.68, "end": 1407.56, "text": "es mit Clickbait nicht übertreiben, gerade diese Kombination ist total ausgelutscht,"}, {"id": 225, "start": 1407.56, "end": 1415.04, "text": "die Leute sind dumm, aber die Leute sind, also die sind dumm und erkennen dumme Muster,"}, {"id": 226, "start": 1415.04, "end": 1426.72, "text": "also die Leute erkennen mittlerweile, dass das Clickbait ist, ne, der Unterschied dazwischen"}, {"id": 227, "start": 1426.72, "end": 1441.64, "text": "ist, das ist nur lokal für meinen User, das ist systemweit, ja, wie gesagt, das frage"}, {"id": 228, "start": 1441.64, "end": 1446.52, "text": "ich mich auch und nein, wir machen kein Ababstream, wie hast du den Friseur kennengelernt, einfach"}, {"id": 229, "start": 1446.52, "end": 1452.08, "text": "durch YouTube damals, ihr wohnt ja, nein, nicht durch YouTube, guckt mal, mein erstes Video,"}, {"id": 230, "start": 1452.08, "end": 1460.6, "text": "mein erstes Video, ich weiß gar nicht, ob ich das überhaupt noch irgendwo hab, das"}, {"id": 231, "start": 1460.6, "end": 1468.2, "text": "ist mein erstes Video, genau, das ist mein erstes Video, das hab ich nochmal neu hochgeladen"}, {"id": 232, "start": 1468.2, "end": 1474.24, "text": "und im Abspann, den ich rausgeschnitten hab, weil ich dumm bin, ah hier nochmal komplett,"}, {"id": 233, "start": 1474.24, "end": 1480.08, "text": "genau, so und der Abspann, der Abspann von meinem allerersten Video, das kann ich euch"}, {"id": 234, "start": 1480.08, "end": 1486.88, "text": "übrigens nicht zeigen, den Abspann, weil da ist Musik drinne und zwar im Intro was von"}, {"id": 235, "start": 1486.88, "end": 1491.52, "text": "den apokalyptischen Reitern und im Outro irgendwas von den Toten Hosen, das kann, deswegen kann"}, {"id": 236, "start": 1491.52, "end": 1496.48, "text": "ich nicht abspielen, so und jetzt pass mal auf, was in meinem ersten Video im Outro drinne"}, {"id": 237, "start": 1496.48, "end": 1509.68, "text": "stand, das steht drinne, nächstes Video war wahrscheinlich Dual Kommentar mit meinem Kumpel"}, {"id": 238, "start": 1509.68, "end": 1520.68, "text": "dem Friseur, so also wie kann ich den Friseur nicht, der hatte damals, der hatte damals"}, {"id": 239, "start": 1520.68, "end": 1527.08, "text": "die ganzen Xbox Accounts, die alles so komisch geplant waren, xxderfriseur, xfriseur, iderfriseur,"}, {"id": 240, "start": 1527.08, "end": 1533.68, "text": "der hatte, der hat glaub ich, der hat keine Ahnung, Fabian hat ohne Scheiß 15 Xbox Accounts,"}, {"id": 241, "start": 1533.68, "end": 1540.0, "text": "so also ich kenne den aus dem MMO, ich kenne den Friseur nämlich aus Dark Age of Camelot,"}, {"id": 242, "start": 1540.0, "end": 1544.76, "text": "bestes MMO aller Zeiten Leute, weißte ich, hat es jemand von euch gespielt, ich gebe"}, {"id": 243, "start": 1544.76, "end": 1551.88, "text": "zu Grafik ist Massive, massiver Painz Champ in der heutigen Zeit, was will man so viele"}, {"id": 244, "start": 1551.88, "end": 1557.76, "text": "Accounts, das muss man Fabian fragen, keine Ahnung, aber bestes PvP, was es jemals gegeben"}, {"id": 245, "start": 1557.76, "end": 1563.04, "text": "hat, in einem MMO Leute, beste, ich würde es heute auf gar keinen Fall mehr spielen,"}, {"id": 246, "start": 1563.04, "end": 1570.4, "text": "ich meine es sieht schon scheiße aus, man muss mal ehrlich sehen, aber das ist schon"}, {"id": 247, "start": 1570.4, "end": 1574.56, "text": "richtig nice, man darf nicht vergessen, das sind keine NPCs, das sind alles Spieler hier"}, {"id": 248, "start": 1574.56, "end": 1588.04, "text": "auf dem Bild, alles Spieler, wurde mal gut aufgepilzt hier, ahja Camelot an Chained kommt"}, {"id": 249, "start": 1588.04, "end": 1593.84, "text": "wahrscheinlich nie raus in dem Tempo, wie die da weitermachen, aber ohne Scheiß Leute,"}, {"id": 250, "start": 1593.84, "end": 1597.56, "text": "bestes MMO aller Zeiten, jetzt zu spielen lohnt sich nicht mehr, jemand guckt euch"}, {"id": 251, "start": 1597.56, "end": 1604.0, "text": "das mal an, wie das ausschaut, und das checkt auch niemand mehr heute, der da neu mit anfängt,"}, {"id": 252, "start": 1604.0, "end": 1611.64, "text": "aber ansonsten ist das massiv geil, hast du das gespielt während dem Arbeitsamtkurs,"}, {"id": 253, "start": 1611.64, "end": 1619.88, "text": "also ich hab das gespielt von 2000, Moment, das kam 2011, 2001 oder so raus, ich hab das"}, {"id": 254, "start": 1619.88, "end": 1633.64, "text": "gespielt von Release, sogar ein paar Tage vorher, von Release bis 2010, habe ich das wirklich"}, {"id": 255, "start": 1633.64, "end": 1638.32, "text": "täglich gespielt, oder 2010 stimmt nicht, nein das stimmt nicht Leute, ich hab aufgehört"}, {"id": 256, "start": 1638.32, "end": 1643.48, "text": "bevor ich Youtube angefangen habe, 2009, also ich hab das gespielt von 2001 bis 2009 quasi"}, {"id": 257, "start": 1643.48, "end": 1653.8, "text": "täglich, mehrere Stunden, wobei ich die letzten zwei, drei Jahre nur noch FVR gespielt hab"}, {"id": 258, "start": 1653.8, "end": 1661.08, "text": "mit meinen acht Leuten da, abends zwei, drei Stunden, so und dann hab ich ein paar mal"}, {"id": 259, "start": 1661.08, "end": 1668.28, "text": "immer wieder reingeguckt in das Game, ich hab da tausende Stunden drinne, ey ich hab"}, {"id": 260, "start": 1668.28, "end": 1673.96, "text": "da bestimmt, frag mich nicht, 12.000 Spielstunden über alle Scheiße oder so, wie viele Stunden"}, {"id": 261, "start": 1673.96, "end": 1685.4, "text": "hatten ja, how much hours one year, ok 8.760, ja das kommt hin, ist gar kein Problem, 12.000"}, {"id": 262, "start": 1685.4, "end": 1690.36, "text": "Stunden, easy, easy, 12.000 Stunden, ich hab das 10 Jahre gespielt, wenn ich das 10 Jahre"}, {"id": 263, "start": 1690.36, "end": 1694.68, "text": "gespielt hab, hab ich doch mal locker eineinhalb Jahre, aber mal locker eineinhalb Jahre in"}, {"id": 264, "start": 1694.68, "end": 1704.32, "text": "Zeitsatz gespielt, locker, locker, bestes, bestes MMO, ja und daher kenne ich den Fabian,"}, {"id": 265, "start": 1704.32, "end": 1711.08, "text": "wir haben auf dem gleichen Server damals gespielt und der Fabian hat damals schon das gemacht"}, {"id": 266, "start": 1711.08, "end": 1716.68, "text": "was er heute immer noch gerne macht, rerollen, das war einer der ersten 50er, das war max"}, {"id": 267, "start": 1716.68, "end": 1721.84, "text": "level damals hier in dem Game, auf dem Server oder ich weiß gar nicht ob er 50 geworden"}, {"id": 268, "start": 1721.84, "end": 1727.96, "text": "ist, zumindest eines der am höchsten gelevelten Leute zur damaligen Zeit mit der jeweiligen"}, {"id": 269, "start": 1727.96, "end": 1737.36, "text": "Klasse, der hat nämlich eine übelste Kackklasse gespielt, zumindest für Gruppen ja und irgendwann"}, {"id": 270, "start": 1737.36, "end": 1742.6, "text": "hat er einfach rerollt auf alle Charaktere, damals musste man Leute, damals musste man"}, {"id": 271, "start": 1742.6, "end": 1747.08, "text": "noch alle Charaktere löschen, dass man rerollen konnte auf einem anderen Realm, alle Charaktere"}, {"id": 272, "start": 1747.08, "end": 1754.12, "text": "gelöscht, rerollt, dann hat er aufgelevelt, 2 Monate später hat er wieder rerollt, der"}, {"id": 273, "start": 1754.12, "end": 1758.56, "text": "Fabian war wirklich, der war nur am rerollen, das war im Prinzip wie heute immer noch bei"}, {"id": 274, "start": 1758.56, "end": 1765.16, "text": "den ingl. Games spielt, ja daher kenne ich den und den Mastercrapper, den Mastercrapper"}, {"id": 275, "start": 1765.16, "end": 1768.56, "text": "kenne ich auch, also eigentlich kenne ich den Mastercrapper und über den Mastercrapper"}, {"id": 276, "start": 1768.56, "end": 1778.88, "text": "kenne ich den Fabian, so rum. MMO Freundschaften, da sieht man, da sieht man mal wieder Real"}, {"id": 277, "start": 1778.88, "end": 1786.52, "text": "Life RL Stells ist komplett overrated, ich habe Corona Quarantäne gelebt zu Zeiten wo"}, {"id": 278, "start": 1786.52, "end": 1804.48, "text": "es noch kein Corona gab, ja. So, ja ja also man kann übelst viel Geld in Autos reinhauen,"}, {"id": 279, "start": 1804.48, "end": 1808.64, "text": "wenn man will, ich habe auf der Arbeit auch so einen, der ist permanent am Autotunen,"}, {"id": 280, "start": 1808.64, "end": 1814.16, "text": "was witzig ist, also der hat übelst, der hat eben, ich glaube irgendeinen BMW hat er,"}, {"id": 281, "start": 1814.16, "end": 1819.28, "text": "übelst am Autotunen und auch laufen sich irgendwelche komischen Abgase, Abgasrohre und"}, {"id": 282, "start": 1819.28, "end": 1823.56, "text": "haste nicht gesehen bestellt und einmal wollte er sich bei AliExpress irgendwelche Teile"}, {"id": 283, "start": 1823.56, "end": 1827.28, "text": "bestellen, hat dann festgestellt, ah nee das wird aber zu heiß und dann vertraut er"}, {"id": 284, "start": 1827.28, "end": 1831.72, "text": "dem Chinesen Kram nicht, dass wenn es so heiß wird, dass es da nicht schmilzt oder so und"}, {"id": 285, "start": 1831.72, "end": 1834.56, "text": "irgendwann ist dann seine Freundin schwanger geworden, da meinte er so ein halbes Jahr"}, {"id": 286, "start": 1834.56, "end": 1838.76, "text": "später, ey man, es war eine scheiß Idee mit dem Auto, hättest du es mal gewusst, hättest"}, {"id": 287, "start": 1838.76, "end": 1842.6, "text": "du es nicht gemacht, hättest du mir ein anderes Auto gekauft, nicht getutet, jetzt braucht"}, {"id": 288, "start": 1842.6, "end": 1849.48, "text": "er die Kohle und das Auto will natürlich so keiner haben, Pech gehabt, tja, aber ich"}, {"id": 289, "start": 1849.48, "end": 1855.2, "text": "mein vielleicht, vielleicht hätte er die Freundin nicht gekriegt ohne das Auto, man weiß es"}, {"id": 290, "start": 1855.2, "end": 1875.4, "text": "ja nie, ja, du hast ein vollverschlüsseltes Arch, gut Job, Leute, ich hab echt ein Problem,"}, {"id": 291, "start": 1875.4, "end": 1880.88, "text": "ist ernsthaft, ich komm mit meinen, also ich komm nicht mit den Leuten klar, die in meinem"}, {"id": 292, "start": 1880.88, "end": 1886.96, "text": "Alter sind, also so, so auf persönlicher, persönlicher Ebene komm ich mit 99% der Leute"}, {"id": 293, "start": 1886.96, "end": 1892.44, "text": "in meinem Alter nicht klar, ist einfach so, also klar schon mit Leuten, die ähnlich denken"}, {"id": 294, "start": 1892.44, "end": 1897.76, "text": "wie ich und auch irgendwie Gaming-Gedöns machen und da im Internet sich auskennen und"}, {"id": 295, "start": 1897.76, "end": 1903.2, "text": "sonst wie, aber ohne scheiß 99% der 36 oder 35 plus Jährigen, mit denen komm ich nicht"}, {"id": 296, "start": 1903.2, "end": 1907.68, "text": "klar, das sind so ganz komische Leute, das sind Leute, die gehen irgendwie noch auf Facebook"}, {"id": 297, "start": 1907.68, "end": 1911.84, "text": "und posten irgendwelche komischen Bildchen und lachen sich da drüber kaputt und so,"}, {"id": 298, "start": 1911.84, "end": 1920.04, "text": "so Dinge, die seit 10 Jahren outdated sind, ja, das sind Leute, die denken, keine Ahnung,"}, {"id": 299, "start": 1920.04, "end": 1932.08, "text": "Pepe wäre was für Nazis oder so, die checken gar nichts, was im Internet abgeht, ja, Facebook,"}, {"id": 300, "start": 1932.08, "end": 1938.44, "text": "ja, richtig Pains-Champ, ich mein hier im Chat nicht, im Chat die Leute hier, weiß ich,"}, {"id": 301, "start": 1938.44, "end": 1942.12, "text": "die wären sonst ja nicht da, ja ich komm auch mit, das stimmt schon, ich komm auch"}, {"id": 302, "start": 1942.12, "end": 1952.44, "text": "mit 99% der anderen Leuten nicht klar, alter Mädchen 2 hör mal auf, sowas kommt als nächstes,"}, {"id": 303, "start": 1952.44, "end": 1962.64, "text": "Everquest, gibt's da wohl Leute, die noch extrem reincripen, ja, aber das Spiel ist eigentlich"}, {"id": 304, "start": 1962.64, "end": 1972.16, "text": "mehr oder weniger dead, wenn du Dark dir ein bisschen angucken willst, dann spiel auf dem"}, {"id": 305, "start": 1972.16, "end": 1992.56, "text": "Free-Shart, der hat noch ganz gute Spielerzahlen, kannst auch ESO spielen, wenn du zumindest"}, {"id": 306, "start": 1992.56, "end": 1996.96, "text": "ein Spiel haben willst, was von manchen der Dark-Beteiligten mitentwickelt wurde, aber"}, {"id": 307, "start": 1996.96, "end": 2000.68, "text": "ESO hat mit Dark an sich gar nichts zu tun, ein bisschen das PvP vielleicht, aber ansonsten"}, {"id": 308, "start": 2000.68, "end": 2006.64, "text": "eigentlich, guck, der hat ganz gute Spielzahlen, ich mein mehr als wenn es, ne, für das ohne"}, {"id": 309, "start": 2006.64, "end": 2010.64, "text": "Scheiß, für das, dass das ein Free-Shart ist, für das, dass das ein Free-Shart ist,"}, {"id": 310, "start": 2010.64, "end": 2015.48, "text": "ist das nicht schlecht am Wochenende 2000 Spieler hier am Start, ne, man muss hier die ganzen"}, {"id": 311, "start": 2015.48, "end": 2023.8, "text": "Reiche zusammenrechnen, oh ist schon in Ordnung, ja ich hab halt hier auch auf dem Free-Shart"}, {"id": 312, "start": 2023.8, "end": 2028.96, "text": "gespielt, hier so bis, bis keine Ahnung, hier so irgendwie Mitte, Mitte, Ende letzten"}, {"id": 313, "start": 2028.96, "end": 2035.36, "text": "Jahres irgendwie so und ich hab ja auch schon wieder nen übelst High-Rank-Solo-Char und"}, {"id": 314, "start": 2035.36, "end": 2044.16, "text": "bin voll reingesuchtet ein paar Monate, doch, doch hab ich auch, aber ich muss dir ehrlich"}, {"id": 315, "start": 2044.16, "end": 2050.32, "text": "sagen, ich bin mit World of Warcraft nie warm geworden, das lag aber da dran, weil entgegen"}, {"id": 316, "start": 2050.32, "end": 2056.96, "text": "Internetmeinung hat World of Warcraft MMOs nicht erfunden, das ist ja so ein bisschen"}, {"id": 317, "start": 2056.96, "end": 2060.6, "text": "ein Running-Gag, viele Leute schreiben das mittlerweile so aus Spaß rein, obwohl sie"}, {"id": 318, "start": 2060.6, "end": 2064.0, "text": "eigentlich wissen, dass es nicht so ist, weil in der Zeit lang die Leute das wirklich dachten,"}, {"id": 319, "start": 2064.0, "end": 2073.44, "text": "wo gleich first MMO und sowas in der Richtung, World of Warcraft, ihr werdet lachen, World"}, {"id": 320, "start": 2073.44, "end": 2080.52, "text": "of Warcraft galte damals, unter den damals quasi schon hart eingesottenen MMO-Spielern"}, {"id": 321, "start": 2080.52, "end": 2087.6, "text": "als Kinder-MMO, als weichgespültes Kinder-MMO, ich mein, damit hatten sie nicht unrecht,"}, {"id": 322, "start": 2087.6, "end": 2094.04, "text": "wenn man sich guckt, was da für komische Gestalten teilweise rumgerannt sind, heute"}, {"id": 323, "start": 2094.04, "end": 2100.8, "text": "ist World of Warcraft für viele so das nostalgische beste Game ever, das Snoop-MMO, was gar nicht"}, {"id": 324, "start": 2100.8, "end": 2108.24, "text": "stimmt, ne, geradezu zu Classic schonmal, schonmal gar nicht, weil das, das war sicherlich"}, {"id": 325, "start": 2108.24, "end": 2112.6, "text": "nicht schwer, gerade im Vergleich zu heut irgendwelchen High-End-Rate-Geschichten, aber"}, {"id": 326, "start": 2112.6, "end": 2115.72, "text": "das Knowledge hat ihr damals halt komplett gefehlt, doch, doch, ich hab auch ein bisschen"}, {"id": 327, "start": 2115.72, "end": 2122.72, "text": "World of Warcraft gespielt, aber nie, der großartig gesuchtet wie Dark, Quick-Maths-Big-Prain"}, {"id": 328, "start": 2122.72, "end": 2133.2, "text": "hier im Kopf, wie kommt es wieder, tja, das ist ne gute Frage, wie kommt es, dass ich"}, {"id": 329, "start": 2133.2, "end": 2140.12, "text": "wieder so viele Videos mache, Leute, jetzt, ich hab ne Frage, der Chat weiß ja sowas manchmal"}, {"id": 330, "start": 2140.12, "end": 2145.6, "text": "besser als ich, wisst ihr, warum das so ist, ich weiß es nicht, warum mach ich ausgerechnet"}, {"id": 331, "start": 2145.6, "end": 2152.6, "text": "jetzt wieder Videos und hab die letzten sechs Jahre keine gemacht, na, Stonks kanns nicht"}, {"id": 332, "start": 2152.6, "end": 2161.8, "text": "sein, für Stonks hätt ich die letzten sechs Jahre überhaupt Videos machen können, weil's"}, {"id": 333, "start": 2161.8, "end": 2167.24, "text": "Bock macht, ja, das ist richtig, aber warum jetzt auf einmal wieder, ich glaube, ich weiß"}, {"id": 334, "start": 2167.24, "end": 2172.72, "text": "warum, Leute, ich weiß warum, Moment, ich kanns euch zeigen, warum ich wieder Videos"}, {"id": 335, "start": 2172.72, "end": 2192.04, "text": "mach, ähm, und zwar, ich hab ja irgendwann mal im Dezember, genau, ich hab irgendwann"}, {"id": 336, "start": 2192.04, "end": 2195.0, "text": "im Dezember mal das Video zu Black Friday gemacht, dann hab ich wieder ein paar Wochen"}, {"id": 337, "start": 2195.0, "end": 2198.6, "text": "nix gemacht, hab ich mir gedacht, ey, weißt was, ich mach noch ein Weihnachtsgeschenke-Video"}, {"id": 338, "start": 2198.6, "end": 2208.32, "text": "und dann gab's Battlefield 3 für umsonst auf Steam oder Origin, irgendwo, gab's das"}, {"id": 339, "start": 2208.32, "end": 2213.44, "text": "umsonst, so, und dann hab ich mir gedacht, alter, nimmst jetzt einfach ein paar Battlefield-Videos"}, {"id": 340, "start": 2213.44, "end": 2218.48, "text": "auf, hab ich ja dann hier auch gemacht und gleichermaßen hatte ich die Idee, warum mach"}, {"id": 341, "start": 2218.48, "end": 2224.56, "text": "ich nicht einfach mal ein paar IT-Technik-Videos und dann hab ich dann damit angefangen, hab"}, {"id": 342, "start": 2224.56, "end": 2228.72, "text": "ich mir gedacht, das ist eigentlich ganz cool, weil ich hatte ja auch so ein bisschen das"}, {"id": 343, "start": 2228.72, "end": 2234.52, "text": "Problem, ich konnte nicht so wirklich gamingbezogenen Content machen, weil, was willst du machen,"}, {"id": 344, "start": 2234.52, "end": 2237.32, "text": "großartig, wenn es grad kein Game gibt, wo du Bock drauf hast."}, {"id": 345, "start": 2237.32, "end": 2256.56, "text": "Ne, mit Corona hat das gar nix zu tun. Corona hat das gar nix zu tun. Das ist ne gute Frage."}, {"id": 346, "start": 2256.56, "end": 2262.8, "text": "Würdest du zurückblickend sagen, dass die Zeit verschwendet war, also du meinst die"}, {"id": 347, "start": 2262.8, "end": 2267.04, "text": "Zeit, diese 12.000 Stunden oder was auch immer, wo ich da auch gespielt hab? Nö, warum?"}, {"id": 348, "start": 2267.04, "end": 2273.52, "text": "Ich würde mir sogar eher wünschen, ich könnte noch weiterspielen, aber das Game ist halt"}, {"id": 349, "start": 2273.52, "end": 2281.36, "text": "dead. Ich würde mich freuen, wenn ich heute noch Kreisel-Grind machen könnte. Da hab"}, {"id": 350, "start": 2281.36, "end": 2286.92, "text": "ich übrigens auch mal ein Video zugemacht in letzter Zeit. Nö, überhaupt nicht. Gar"}, {"id": 351, "start": 2286.92, "end": 2290.24, "text": "nicht. Ich würd mir sogar umgedreht eher wünschen, dass es wieder ein Game gibt, wo"}, {"id": 352, "start": 2290.24, "end": 2299.52, "text": "ich 12.000 Stunden grinden will. Der Archlinux-Nerd ist am Start. Danke schön für den Prime"}, {"id": 353, "start": 2299.52, "end": 2307.44, "text": "Sub. Ja, das ist wichtig. Das ist unglaublich wichtig. Das muss man immer mitteilen den"}, {"id": 354, "start": 2307.44, "end": 2311.08, "text": "Leuten. Ich benutze übrigens auch Archlinux. Ich weiß nicht, ob ich dir schon mal erzählen"}, {"id": 355, "start": 2311.08, "end": 2316.48, "text": "hab. Wobei, geht man Jaro als Archlinux durch? Ich mein, das ist ein Archlinux, hat aber"}, {"id": 356, "start": 2316.48, "end": 2324.44, "text": "so ein paar Zwischenrepos. Das ist nicht pures Arch, oder? Man muss leiden bei der Installation."}, {"id": 357, "start": 2324.44, "end": 2346.04, "text": "Ja, Stripes, dann kann man das jetzt nicht gehen. Das ist eine geile Idee. Das ist eine"}, {"id": 358, "start": 2346.04, "end": 2357.52, "text": "geile Idee für mein MMO-Video. Ich war jahrelang ein Lockdown-Prepper. Ich muss noch besser"}, {"id": 359, "start": 2357.52, "end": 2373.2, "text": "in solche Clickbait-Titel-Generation im Kopf reinkommen. Ja, du vielleicht nicht. Das"}, {"id": 360, "start": 2373.2, "end": 2376.52, "text": "kann man wahrscheinlich so pauschal nicht sagen. Es gibt bestimmt genug Leute, die"}, {"id": 361, "start": 2376.52, "end": 2385.48, "text": "haben da kein Problem damit. Und warum? Ich meine, da magst du wenigstens eine Sache"}, {"id": 362, "start": 2385.48, "end": 2390.44, "text": "an dir, dein Auto. Also ich mein, ich bezieh's jetzt nicht explizit auf dich, sondern klar,"}, {"id": 363, "start": 2390.44, "end": 2394.72, "text": "seit letztem Tag hat sich auch wieder übelst einer geflamed gefühlt im Chat, weil ich"}, {"id": 364, "start": 2394.72, "end": 2398.52, "text": "gesagt hab, dich, obwohl ich gar nicht dich gemeint hab, den das geschrieben hat."}, {"id": 365, "start": 2398.52, "end": 2415.32, "text": "Ja, das kommt auch dazu. Also ich komm auch mit 99% der Leute nicht klar. Ja, ist echt"}, {"id": 366, "start": 2415.32, "end": 2422.48, "text": "so. Also die Sache ist halt ernsthaft so. Ich kann mir nicht vorstellen, dass ich bald"}, {"id": 367, "start": 2422.48, "end": 2428.12, "text": "40, also bald, bald ist übertrieben, ich werd 37 dieses Jahr, dass ich bald 40 werde. Man"}, {"id": 368, "start": 2428.12, "end": 2434.56, "text": "muss sich das mal vorstellen. Ich werd 40. Ab da geht's los, dass Frauen in die Wechseljahre"}, {"id": 369, "start": 2434.56, "end": 2441.48, "text": "kommen, ey. Mit 40, so ungefähr. Da geht's langsam los. Langsam. Ich sag jetzt nicht"}, {"id": 370, "start": 2441.48, "end": 2448.12, "text": "instance vorbei. Muss ich mal vorstellen, ich bin schon in so einem Alter. Das kann"}, {"id": 371, "start": 2448.12, "end": 2453.4, "text": "man sich gar nicht vorstellen. Zum Glück bekommen Männer sowas nicht. Du musst mal"}, {"id": 372, "start": 2453.4, "end": 2459.68, "text": "Kinder zeugen. Ja, ich weiß, ey. Wenn ich Kinder will, da muss jetzt, da muss jetzt"}, {"id": 373, "start": 2459.68, "end": 2467.0, "text": "ran. Ja, hast du recht. Aber ich will gar keine Kinder. Ich glaub, das ist alles der"}, {"id": 374, "start": 2467.0, "end": 2471.4, "text": "schlimmsten Sachen, die ich mir gerade vorstellen könne, Kinder zu kriegen. Dann ist vorbei."}, {"id": 375, "start": 2471.4, "end": 2483.2, "text": "Mit Daily Stream. Dann ist Schluss. Also außerdem, da hängt irgendwas an meiner Decke. Ah,"}, {"id": 376, "start": 2483.2, "end": 2498.84, "text": "das ist ein Fussel. Ich muss mal kurz gucken, was da an meiner Decke hängt. MonkaS, MonkaS."}, {"id": 377, "start": 2498.84, "end": 2517.0, "text": "Nee, das ist wirklich nur ein Fussel. Das ist wirklich nur ein Fussel. Ähm, das wollte"}, {"id": 378, "start": 2517.0, "end": 2524.12, "text": "ich jetzt gerade sagen. Ja, dann ist vorbei, wenn ich Kinder krieg mit Daily Stream. Mal"}, {"id": 379, "start": 2524.12, "end": 2537.0, "text": "davon abgesehen. Um Kinder zu kriegen fehlt mir ja auch ein ganz entscheidendes, äh,"}, {"id": 380, "start": 2537.0, "end": 2543.72, "text": "was man da, was man da noch dazu braucht, ja. Also, insofern ist das eh keine Option"}, {"id": 381, "start": 2543.72, "end": 2559.64, "text": "aktuell. Geld, das auch. Geld, Geld hast du nie genug. Ja, ich mein, ohne Frau wird da"}, {"id": 382, "start": 2559.64, "end": 2570.52, "text": "schwierig, ja. Ich mein, in der heutigen Zeit, ja, ne, gibt's ja nichts, was nix gibt, aber"}, {"id": 383, "start": 2570.52, "end": 2584.84, "text": "das funktioniert noch nicht so. Da stimmt, gleichaltrige Menschen sind ganz merkwürdig."}, {"id": 384, "start": 2584.84, "end": 2594.92, "text": "Ich hab paar Softwareprojekte für die Arbeit tatsächlich nach meinem neuen Benamungsschema"}, {"id": 385, "start": 2594.92, "end": 2603.48, "text": "benannt. Beispielsweise hab ich letztens, ähm, einen, ähm, was gebastelt, was ich"}, {"id": 386, "start": 2603.48, "end": 2610.8, "text": "mit zwei Fakta-Authentifizierung anmelden kann. Das ist der Orth-Champ. Und, äh, wir hatten"}, {"id": 387, "start": 2610.8, "end": 2620.76, "text": "auch schon den Proxy-Champ und den Performance-Champ hatten wir auch schon. Ja, ganz wichtig."}, {"id": 388, "start": 2620.76, "end": 2626.72, "text": "Also, falls, falls sich mal jemand irgendwie irgendwo neu anfängt und loggt sich auf"}, {"id": 389, "start": 2626.72, "end": 2630.0, "text": "dem Linux-Surfer ein und ihr seht dann, dass irgendwo im Root-Verzeichnis irgendwas mit"}, {"id": 390, "start": 2630.0, "end": 2635.96, "text": "Champ rumliegt, dann habt ihr wahrscheinlich Überbleibseln von mir gefunden. Gibt bestimmt"}, {"id": 391, "start": 2635.96, "end": 2665.68, "text": "oder garantiert. Äh, selten. Ah, richtig Hardcore-Arch. By the way, User. Es ist vorbei,"}, {"id": 392, "start": 2665.68, "end": 2678.0, "text": "das werden wir nicht mehr sehen. Glaubst du, wird es in nächstem Jahr noch neue Battlefield-Games"}, {"id": 393, "start": 2678.0, "end": 2683.48, "text": "geben? Ja, glaub ich. Also, es sagen ja viele, wenn das neue Battlefield-Game nicht gut,"}, {"id": 394, "start": 2683.48, "end": 2690.4, "text": "also nicht gut ankommt, dann ist die Reihe tot. Leute, es ist nix tot, was nicht bis"}, {"id": 395, "start": 2690.4, "end": 2697.96, "text": "zum letzten möglichen Cent gemolken ist. Guckt euch mal an, was EA beispielsweise gemacht"}, {"id": 396, "start": 2697.96, "end": 2702.36, "text": "hat mit Medal of Honor. Das war schon nicht gut, das Reboot und danach kommt noch ein"}, {"id": 397, "start": 2702.36, "end": 2706.4, "text": "zweites, es war auch nicht gut. Und dann kommen noch irgendwelche Mobile-Games im Zweifelsfall"}, {"id": 398, "start": 2706.4, "end": 2711.8, "text": "vorn. Oder guckt euch mal Dungeon-Keeper an. Kennt jemand von euch noch Dungeon-Keeper?"}, {"id": 399, "start": 2711.8, "end": 2717.52, "text": "Eines der besten Spiele aller Zeiten. Das hat EA auch komplett zerstört mit irgendeinem"}, {"id": 400, "start": 2717.52, "end": 2725.04, "text": "komischen Mobile-Game zum Schluss. Für die Zoomer unter uns, die das nicht mehr kennen,"}, {"id": 401, "start": 2725.04, "end": 2739.28, "text": "Leute. Dungeon-Keeper. Eines der besten Games überhaupt. Das ist Dungeon-Keeper 2. Dungeon-Keeper,"}, {"id": 402, "start": 2739.28, "end": 2747.24, "text": "ja. So, und da gab es in irgendwann Jahrzehnte später so ein Mobile-Game vorn und es war"}, {"id": 403, "start": 2747.24, "end": 2753.76, "text": "einfach schlecht. Einfach nur schlecht. Und man musste irgendwie drei Tage warten, bis"}, {"id": 404, "start": 2753.76, "end": 2758.08, "text": "man einen neuen Block abbauen kann und sowas. Einfach nur schlecht. Und dann war es tot."}, {"id": 405, "start": 2758.08, "end": 2762.64, "text": "Also, selbst wenn Battlefield floppt, das nächste, wird es weitere Battlefield-Games"}, {"id": 406, "start": 2762.64, "end": 2774.36, "text": "geben. 100 Pro. In irgendeiner Art und Weise wird es das geben. Ähm. Früher hab ich immer"}, {"id": 407, "start": 2774.36, "end": 2779.6, "text": "gelabert. Und fand mich dann übelst geil, dass ich 20 Minuten zu einem Thema labern kann,"}, {"id": 408, "start": 2779.6, "end": 2783.72, "text": "aber mittlerweile mach ich so, ich schreib mir ein paar Punkte auf, weil ich, weil ich"}, {"id": 409, "start": 2783.72, "end": 2790.08, "text": "hab mir selbst ja die ein oder anderen alten Videos angeguckt und hab einfach festgestellt,"}, {"id": 410, "start": 2790.08, "end": 2794.6, "text": "vom Inhalt her ist das schon okay, aber das ist einfach viel zu lang. Also viel zu, viel"}, {"id": 411, "start": 2794.6, "end": 2807.84, "text": "zu viel zwischendurch. So, und jetzt hab ich ein paar Punkte. Manchmal auch ein paar Punkte"}, {"id": 412, "start": 2807.84, "end": 2825.64, "text": "geben, ja. So. Äh, ich muss dir ehrlich sagen, ich hab noch nie nen Gentoo installiert. Das"}, {"id": 413, "start": 2825.64, "end": 2829.84, "text": "einzige Mal, wo ich Gentoo wirklich live im Einsatz gesehen hab, ist bei uns einem auf"}, {"id": 414, "start": 2829.84, "end": 2838.84, "text": "der Arbeit, der hat ein neues Notebook bekommen, ne. Kein Notebook, stimmt nicht. Ne VM. Ne"}, {"id": 415, "start": 2838.84, "end": 2844.04, "text": "VM und, äh, oder doch ein Notebook, ich weiß es nicht aus dem Prinzip, egal, und wollte"}, {"id": 416, "start": 2844.04, "end": 2849.52, "text": "sich darauf nen Gentoo installieren und hat drei Tage gebraucht, weil das zigmal neu kompilieren"}, {"id": 417, "start": 2849.52, "end": 2856.52, "text": "musste, dass der Colonel seinen Netzwerkkartentreiber überhaupt enthält. Also, ich glaube, das"}, {"id": 418, "start": 2856.52, "end": 2871.48, "text": "will ich nicht machen. Ja, dann ist kein Wunder, dass es nicht geht. Warum denn eigentlich"}, {"id": 419, "start": 2871.48, "end": 2878.56, "text": "nicht? Ich mein, du kannst User-Repos verwenden. Ich mein, es ist halt ein bisschen einfacher"}, {"id": 420, "start": 2878.56, "end": 2883.64, "text": "für Kacknoobs, ne, aber, na gut, das ist klar, die echten Hardcore-Artschleute wollen"}, {"id": 421, "start": 2883.64, "end": 2891.0, "text": "das natürlich nicht. Wie? Man kann Artschleute halbwegs komfortabel installieren? Wird das"}, {"id": 422, "start": 2891.0, "end": 2906.04, "text": "jetzt auch zum Nuke-Betriebssystem? Only Suckless-Software, ja, ich verwende auch nur Suckless-Software,"}, {"id": 423, "start": 2906.04, "end": 2912.12, "text": "wobei ich sagen muss, ich hab mal ne Zeit lang das Suckless-Terminal verwendet. Suckless-Terminal,"}, {"id": 424, "start": 2912.12, "end": 2917.32, "text": "ich verwende heute noch den Suckless-Screen-Log. Leute, die keine Ahnung haben, wovon ich spreche,"}, {"id": 425, "start": 2917.32, "end": 2923.2, "text": "wissen wahrscheinlich null, was ich meine. Suckless ist irgendeine Entwicklergruppe,"}, {"id": 426, "start": 2923.2, "end": 2928.2, "text": "die komische Open-Source-Software für Linux macht, die im Prinzip nichts kann, aber schön"}, {"id": 427, "start": 2928.2, "end": 2942.08, "text": "in C programmiert ist. Was macht dein 3D-Drucker? Der ist gerade aus und steht rum. Was will"}, {"id": 428, "start": 2942.08, "end": 2951.36, "text": "er denn auch machen? Ja, der Artschleutung-Speedrun, wir haben letztens in den Artsch-Install-Speedrun"}, {"id": 429, "start": 2951.36, "end": 2959.92, "text": "geguckt, der war glaub ich in 1,5 Minuten durch oder so. Kann Mikrotik, ja, können sie. Die"}, {"id": 430, "start": 2959.92, "end": 2966.72, "text": "können angeblich sogar mittlerweile mit, entweder ist es schon in der offiziellen Firmware oder"}, {"id": 431, "start": 2966.72, "end": 2979.88, "text": "mit irgendeinem Beta-Package, können die sogar angeblich WireGuard mittlerweile. Da bin ich"}, {"id": 432, "start": 2979.88, "end": 2997.84, "text": "nicht agil genug für. Ich glaube, ich glaube, er ist, wann ist er geboren? 1988, 1985? Irgendwie,"}, {"id": 433, "start": 2997.84, "end": 3007.88, "text": "wir sind ungefähr ins, ich glaube, ich bin einen Ticken älter. Aber dass ich sehr wie"}, {"id": 434, "start": 3007.88, "end": 3014.2, "text": "Monte bin, würde ich jetzt mal nicht so unterschreiben. Keine Ahnung, ich weiß nicht. Ich meine,"}, {"id": 435, "start": 3014.2, "end": 3020.92, "text": "ich kenne ihn nicht wirklich gut, aber ich würde sagen, eher nicht. Die biologische"}, {"id": 436, "start": 3020.92, "end": 3025.56, "text": "Uhr läuft ab, ja. Das könnte man natürlich machen, wenn ich es mir mit 90 dort noch mal"}, {"id": 437, "start": 3025.56, "end": 3047.52, "text": "anders überlege. Was machst du heute? Ich gehe in einer halben Stunde schlafen. Ja,"}, {"id": 438, "start": 3047.52, "end": 3054.96, "text": "dass sie schneller müde sind, das kann, das kenne ich, das kenne ich. Das kenne ich."}, {"id": 439, "start": 3054.96, "end": 3078.28, "text": "Das kenne ich, das kenne ich."}, {"id": 440, "start": 3084.96, "end": 3096.88, "text": "Ich glaube, ich glaube, der Zug ist abgefahren. Twitch soll günstiger werden. Echt? Globale"}, {"id": 441, "start": 3096.88, "end": 3102.24, "text": "Community durch lokale Preise für Abonnements aufbauen. Was soll denn lokale Preise sein?"}, {"id": 442, "start": 3102.24, "end": 3126.52, "text": "Alter, Wall of Text. Meine Güte, ey, mehr Text. Alter, steht da auch irgendwas? Ach,"}, {"id": 443, "start": 3126.52, "end": 3131.08, "text": "erste Länder, Mexiko und die Türkei. Was interessiert mich denn, was die Türken und"}, {"id": 444, "start": 3131.08, "end": 3143.76, "text": "die Mexikaner machen? Sobald sich das machen kann, mache ich das auch günstiger. Sobald"}, {"id": 445, "start": 3143.76, "end": 3147.96, "text": "es bei mir das günstiger möglich ist, mache ich das günstiger. Wisst ihr, was noch geiler"}, {"id": 446, "start": 3147.96, "end": 3154.96, "text": "wäre? Es wird günstiger, aber man müsste Twitch nicht mehr so viel von abgeben. Ja,"}, {"id": 447, "start": 3154.96, "end": 3161.04, "text": "nach Indien oder so wahrscheinlich. Wobei, Indien ist ja Out zum Outsourcen. Hab ich"}, {"id": 448, "start": 3161.04, "end": 3178.44, "text": "so den Eindruck. Nee. Geh ich nicht drauf, wer weiß, was da dahinter ist. Guck mal, wenn"}, {"id": 449, "start": 3178.44, "end": 3185.12, "text": "schon mal eine Vorschau nicht lädt, das heißt irgendwas. So sieht es aus, das habe ich tatsächlich"}, {"id": 450, "start": 3185.12, "end": 3192.44, "text": "schon mal gemacht. Ich habe tatsächlich schon mal was kommodiert mit Gagway in einem Komet."}, {"id": 451, "start": 3192.44, "end": 3196.8, "text": "Das gibt es garantiert noch. Aber es gibt viel weniger solcher Games. Könnt ihr euch"}, {"id": 452, "start": 3196.8, "end": 3202.96, "text": "noch dran erinnern, noch vor gar nicht allzu vielen Jahren gab es total viele G-Bait Links,"}, {"id": 453, "start": 3202.96, "end": 3207.0, "text": "so nach dem Motto, boah, guck dir mal das hier an. Und dann hast du dann draufgeklickt"}, {"id": 454, "start": 3207.0, "end": 3211.88, "text": "und dann kam es noch auf so einer Seite raus, haha, sie wurden erwischt, ihnen wurden 270"}, {"id": 455, "start": 3211.88, "end": 3217.44, "text": "Credits abgenommen, registrieren sie sich jetzt auch hier. So diese G-Bait Games, wo"}, {"id": 456, "start": 3217.44, "end": 3221.92, "text": "es darum ging, die Leute mit einem Link rein zu G-Baiten, gibt es gar nicht mehr. Gibt"}, {"id": 457, "start": 3221.92, "end": 3235.88, "text": "es gar nicht so wirklich mehr. Du meinst du das Remake von Alarmstufe Rot, das war tatsächlich"}, {"id": 458, "start": 3235.88, "end": 3243.84, "text": "gut, ja? Alarmstufe Rot war aber auch so ein Kindheitsgame bei mir. Ich wusste gar nicht,"}, {"id": 459, "start": 3243.84, "end": 3252.28, "text": "dass es ein Generals Remake gibt. Es gibt ein Generals Remake, wirklich? Ah, das ist"}, {"id": 460, "start": 3252.28, "end": 3279.52, "text": "ein Mod. Aha, wusste ich gar nicht. Ja, das Portal Mod, da habe ich ja nicht gespielt."}, {"id": 461, "start": 3279.52, "end": 3288.92, "text": "Wusste ich gar nicht, dass es da ein Mod zu gibt, das ist cool. Stellt euch vor, Battlefield"}, {"id": 462, "start": 3288.92, "end": 3295.4, "text": "6 Free to Play. Also wie gesagt, ich glaube nicht, dass es Free to Play wird. Eventuell"}, {"id": 463, "start": 3295.4, "end": 3300.48, "text": "so eine Mini Basic Version am Wochenende oder so, keine Ahnung, aber das Battle Royale,"}, {"id": 464, "start": 3300.48, "end": 3303.8, "text": "und das ist so sicher wie das Armen in der Kirche, ich weiß nicht warum Leute überhaupt"}, {"id": 465, "start": 3303.8, "end": 3309.76, "text": "noch vermuten, das könnte ein Battle Royale, das ist sicher, das Battle Royale wird es"}, {"id": 466, "start": 3309.76, "end": 3313.48, "text": "geben. 100%. Die sehen was Warzone für eine Kohle macht, die sehen es selbst, die sehen"}, {"id": 467, "start": 3313.48, "end": 3320.6, "text": "auch selbst was Apex für eine Kohle macht. Und Apex und so ein modernes Military Setting,"}, {"id": 468, "start": 3320.6, "end": 3325.36, "text": "ich würde sagen, die haben nicht so viele Schnittmenge, oder die, die sich überschneiden"}, {"id": 469, "start": 3325.36, "end": 3330.48, "text": "sind wahrscheinlich überschaubar, und das spricht einfach noch mal zusätzliche, eine Riesenanzahl"}, {"id": 470, "start": 3330.48, "end": 3337.92, "text": "zusätzlicher Leute an. Und dann haben die Apex und Battlefield Battle Royale, ist doch"}, {"id": 471, "start": 3337.92, "end": 3342.6, "text": "kein Unterschied. Also das glaubt nicht, dass das denen sonderlich viel Selbstkonkurrenz"}, {"id": 472, "start": 3342.6, "end": 3352.32, "text": "macht, aber das ist sicher, das wird es geben, 100%. Ja gut, du kannst ja erstmal zwei Tage"}, {"id": 473, "start": 3352.32, "end": 3362.4, "text": "warten. Es braucht auf jeden Fall viel RAM und Festplattenplatz. Ne, weiß ich nicht,"}, {"id": 474, "start": 3362.4, "end": 3369.24, "text": "ich hab auch noch nichts von EA gehört, ich hab euch ja gestern erzählt, dass ich ne Einladung"}, {"id": 475, "start": 3369.24, "end": 3375.4, "text": "gekriegt hab, oder ne Einladung bekomme, eventuell, wenn ich zustimme, dass ich nichts sage, was"}, {"id": 476, "start": 3375.4, "end": 3383.04, "text": "die mir dann mitteilen werden. Öffentlich bis zum so und so finden. Ich hab auch nix"}, {"id": 477, "start": 3383.04, "end": 3387.68, "text": "bekommen, also mal gucken, mal gucken, was da so kommt. Also es könnte sein, dass die"}, {"id": 478, "start": 3387.68, "end": 3392.44, "text": "für die, also was ich vermute ist, was ich vermute ist, und ich hab ja noch nichts bekommen"}, {"id": 479, "start": 3392.44, "end": 3396.36, "text": "von denen, deswegen kann ich jetzt einfach mal vermuten, ich vermute mal die wollen wahrscheinlich"}, {"id": 480, "start": 3396.36, "end": 3401.76, "text": "ein bisschen Gameplay oder Zeug auch sammeln für ihren Reveal Stream. Und vielleicht haben"}, {"id": 481, "start": 3401.76, "end": 3407.8, "text": "wir Glück, und wir sehen mein Name im Reveal Stream dann irgendwann im Killfeed aufploppen"}, {"id": 482, "start": 3407.8, "end": 3425.48, "text": "oder so, wenn sie zwei Minuten Multiplayer zeigen. Also, mein Ingame Name. Info Holden."}, {"id": 483, "start": 3425.48, "end": 3433.28, "text": "Sebaro weiß es. Ne, ich glaube so heiße ich nur Bad Company 2. Nicht Info Holden. Doch"}, {"id": 484, "start": 3433.28, "end": 3438.56, "text": "ohne Scheiß, das mach ich. Wenn ich wirklich zu dem Event eingeladen werde, nenne ich mein"}, {"id": 485, "start": 3438.56, "end": 3450.68, "text": "Gamertag Info Holden. Das ist so richtig dumm. Vor allem die Amis checken doch eh nicht,"}, {"id": 486, "start": 3450.68, "end": 3458.88, "text": "was das heißen soll. Das ist so richtig dämlich. Aber natürlich auch für LeadSpeak, dass man"}, {"id": 487, "start": 3458.88, "end": 3471.72, "text": "es nicht so offensichtlich sieht. Cute Chat, das ist noch besser, ich nenne mich Cute Chat."}, {"id": 488, "start": 3471.72, "end": 3486.72, "text": "Excellent. Vorhold Senpai. Na, das ist mir dann schon zu viel Reaps in. Kann meine Hochschule"}, {"id": 489, "start": 3486.72, "end": 3492.2, "text": "eigentlich sehen, was ich so im Internet reibe, wenn ich vergesse aus OpenVPN zu gehen? Ja"}, {"id": 490, "start": 3492.2, "end": 3498.2, "text": "klar oder? Nö, wahrscheinlich nicht. Ist auch eine dumme Frage. Also höchstwahrscheinlich"}, {"id": 491, "start": 3498.2, "end": 3506.2, "text": "nicht, weil die meisten Seiten mittlerweile über SSL gehen. Und Seiten, die über SSL,"}, {"id": 492, "start": 3506.2, "end": 3515.04, "text": "also HTTPS, TLS ist es ja eigentlich, wenn man korrekt sein will, gehen, sehen die auch"}, {"id": 493, "start": 3515.04, "end": 3523.96, "text": "nichts. Für alles Unverschlüsselte ja, das könnte man sehen, wenn man da irgendwie mitschneidet"}, {"id": 494, "start": 3523.96, "end": 3543.36, "text": "unterwegs, aber naja, was einer macht, denke ich eher nicht, aber man weiß ja nie. Lokale"}, {"id": 495, "start": 3543.36, "end": 3547.6, "text": "Preise, bald gibt es Subs aus Indien. Moment, das heißt, ich kann dann in Indien Subscriben,"}, {"id": 496, "start": 3547.6, "end": 3554.12, "text": "ja das ist nice. Dann wird es für die Schweizer teurer. Stimmt. Aber vielleicht wird es ja"}, {"id": 497, "start": 3554.12, "end": 3561.32, "text": "bei 5 Dollar. Sag mal, das ist doch jetzt schon teurer oder? Wir bezahlen 5 Euro oder 5 Dollar?"}, {"id": 498, "start": 3561.32, "end": 3577.76, "text": "Ist es nicht jetzt schon so? Oder wird das immer in? Ne, das kann ja nicht sein. Moment,"}, {"id": 499, "start": 3577.76, "end": 3582.56, "text": "warum kostet das 5,99 Schweizer Franken? Ne, oder? Das wäre ja noch mehr, das wäre"}, {"id": 500, "start": 3582.56, "end": 3607.96, "text": "noch jebaiteter. 479, Alter. Tja, Chat, das frage ich mich auch. Rico hat einen guten"}, {"id": 501, "start": 3607.96, "end": 3615.48, "text": "Punkt angesprochen. Wie schaffe ich es eigentlich, so wenige Subs zu haben? Wie geht das überhaupt?"}, {"id": 502, "start": 3615.48, "end": 3626.0, "text": "Vielleicht ist der Cute Chat doch nicht so cute. Sonst würden jetzt alle Subs, die"}, {"id": 503, "start": 3626.0, "end": 3635.44, "text": "noch nicht gesubbt haben, mit ihrem Prime-Sub, den sie den Monat noch frei haben. Wir sind"}, {"id": 504, "start": 3635.44, "end": 3642.72, "text": "wenige dafür Massive IQ, das ist richtig. Das funktioniert, das Sub-Jebait funktioniert"}, {"id": 505, "start": 3642.72, "end": 3651.88, "text": "immer. Domboy, Dankeschön für den Prime-Sub. Jetzt überlegt euch mal, hätte ich noch mehr"}, {"id": 506, "start": 3651.88, "end": 3657.0, "text": "Subs und jeder Sub wird euren IQ steigern, dann würde euer Kopf so aussehen mittlerweile."}, {"id": 507, "start": 3657.0, "end": 3673.16, "text": "Das passt ja gar nicht mehr rein. Das muss langsam dosiert werden. Moment, die Copy-Pasta"}, {"id": 508, "start": 3673.16, "end": 3683.4, "text": "geht länger. Die kenne ich noch länger. Die gibt es in noch einer längeren Variante."}, {"id": 509, "start": 3683.4, "end": 3697.04, "text": "Aber die kriege ich aus dem Kopf nicht mehr hin. Laurin2698, Dankeschön, 2 Monate Prime-Subscription."}, {"id": 510, "start": 3697.04, "end": 3706.36, "text": "Oh jetzt kommt die Massive Copy-Pasta hier. Jetzt, jetzt. Never sub, never donated, Adblock,"}, {"id": 511, "start": 3706.36, "end": 3718.44, "text": "on stolen Laptop. Endlich muss ich euch das mal zeigen. Markieren wo wir waren. Ja, jetzt"}, {"id": 512, "start": 3718.44, "end": 3723.84, "text": "haben wir es. Never subbed, never donated, Adblock, on stolen Laptop, neighbors, Wi-Fi,"}, {"id": 513, "start": 3723.84, "end": 3729.64, "text": "mamas Haus, stolen solar panels, stolen suns, ne das ist nicht den, den ich kenne. Das ist"}, {"id": 514, "start": 3729.64, "end": 3743.72, "text": "nicht den, den ich kenne. Es gab noch irgendeinen besseren. Mein Lieblings Copy-Pasta ist aber,"}, {"id": 515, "start": 3743.72, "end": 3753.16, "text": "wo ist die Musik? Mein Lieblings Copy-Pasta war aber immer noch zu Overwatch Zeiten. Ich"}, {"id": 516, "start": 3753.16, "end": 3757.2, "text": "weiß gar nicht mehr wie das genau ging, wo man die Leute gebaitet hat mit ihrem Skill-Rating."}, {"id": 517, "start": 3757.2, "end": 3763.08, "text": "Also sprich, ich hab dann immer in die Chats gepostet, random in irgendwelche Streams gegangen"}, {"id": 518, "start": 3763.08, "end": 3768.76, "text": "und hab dann sowas geschrieben wie bitte schreibt nicht im Chat wenn ihr nicht mindestens 2000,"}, {"id": 519, "start": 3768.76, "end": 3774.52, "text": "wenn ihr nicht mindestens Highskill seid, 2000 SR plus, 2000 SR plus ist halt nichts gewesen"}, {"id": 520, "start": 3774.52, "end": 3778.24, "text": "in Overwatch. Das hat jeder gehabt, der das Spiel zum ersten Mal gespielt hat. Dann haben"}, {"id": 521, "start": 3778.24, "end": 3782.68, "text": "sich die Leute immer richtig krass tschüben lassen, nur nach dem Motto, LOL, High, High"}, {"id": 522, "start": 3782.68, "end": 3787.6, "text": "SR, 2000 plus, LOL, K Knoob. Das war so geil, die haben sich teilweise am Anfang, haben"}, {"id": 523, "start": 3787.6, "end": 3791.68, "text": "die sich mega triggern lassen mit so sinnloser Copy-Pasta. Das hab ich immer gerne gespammt."}, {"id": 524, "start": 3791.68, "end": 3800.12, "text": "Man darf nicht vergessen, ich war damals auch schon 33. Ne 2016, ja doch, kommt hin. Da"}, {"id": 525, "start": 3800.12, "end": 3804.88, "text": "hat der 33 jährige da gesitzt, gesessen daheim und hat einen Switch Copy-Pasta gemacht."}, {"id": 526, "start": 3804.88, "end": 3822.68, "text": "Ich hab mich gefreut, wenn die Leute darauf angesprungen sind. Ja. Ich glaub's nicht ernsthaft"}, {"id": 527, "start": 3822.68, "end": 3837.8, "text": "euch das da anklicken jetzt, oder? Lösch die, wir können höchstens die Nachricht löschen."}, {"id": 528, "start": 3837.8, "end": 3841.76, "text": "Das find ich gemein, sowas. Vor allem im Hinblick dessen, dass er wahrscheinlich keine Ahnung"}, {"id": 529, "start": 3841.76, "end": 3849.48, "text": "hat. Rionic on fire, ach ne, Rionic fire, soviel drei Monate, dankeschön für den Sub."}, {"id": 530, "start": 3849.48, "end": 3870.72, "text": "Massive Subscription hier. Keine exe Download Links hier. Ja gut, dann ist die Verbindung"}, {"id": 531, "start": 3870.72, "end": 3900.24, "text": "über SSL nicht safe. Tja. Oh komm mal, 200 IQ Sub Emote, das ist,"}, {"id": 532, "start": 3900.24, "end": 3927.4, "text": "das ist auch Big Brain. Ja gut, dazu musste aber erst einmal ein Rechner"}, {"id": 533, "start": 3927.4, "end": 3942.36, "text": "dran kommen. Tja, das kommt drauf an, wie lange es diesen ganzen Kram noch gibt. Wahrscheinlich"}, {"id": 534, "start": 3942.36, "end": 3949.68, "text": "ist es gar nicht so doof, weil ich davon ausgehe, dass gerade dieses ganze Cobalt Zeug und sogar"}, {"id": 535, "start": 3949.68, "end": 3957.36, "text": "ein bisschen die Cloud verfolgen wird. Wie sinnvoll das ist, Host selbst zu lernen,"}, {"id": 536, "start": 3957.36, "end": 3963.52, "text": "beziehungsweise mein Mainframe selbst zu lernen, hab ich so meine Bedenken, weil IBM versucht"}, {"id": 537, "start": 3963.52, "end": 3974.48, "text": "ja auch, dass man den Kram bei ihnen in der Cloud laufen lassen kann. Also eigene Mainframe"}, {"id": 538, "start": 3974.48, "end": 3980.04, "text": "Hardware eher weniger, aber Cobalt und sowas, ja, ohne Scheiß, ich glaube, das lohnt sich"}, {"id": 539, "start": 3980.04, "end": 3985.6, "text": "immer noch. Aber natürlich nicht als einziges, ne. Also ich würde mich nicht darauf verlassen,"}, {"id": 540, "start": 3985.6, "end": 3988.56, "text": "dass ich jetzt einen krassen Cobalt Shop in den ersten paar Wochen finde, nachdem ich"}, {"id": 541, "start": 3988.56, "end": 3993.56, "text": "da das Cobalt Tutorial gemacht hab. Aber wenn man ein bisschen Cobalt Ahnung hat, ist es"}, {"id": 542, "start": 3993.56, "end": 3997.96, "text": "glaube ich nicht verkehrt. Es ist aber eklig, ich hab's ja selbst im Stream schon mal ausprobiert."}, {"id": 543, "start": 3997.96, "end": 4009.48, "text": "In die Cloud verfolgt, ey, ist doch echt so. Es gibt ja mittlerweile schon Cobalt zu Java,"}, {"id": 544, "start": 4009.48, "end": 4017.44, "text": "Transpiler. Die wandeln dann alten Cobalt Code um in Java. Ich weiß jetzt nicht, was"}, {"id": 545, "start": 4017.44, "end": 4025.92, "text": "davon besser ist. Dann hat man hässliches Cobalt Transpiled zu Java. Ob das jetzt so"}, {"id": 546, "start": 4025.92, "end": 4032.28, "text": "viel geiler ist, ich weiß ja nicht. Chat, das könnt ihr nicht, ne, das kannst du nur,"}, {"id": 547, "start": 4032.28, "end": 4038.04, "text": "wenn du zu viele Channel Points hast. Kann ich das anklicken? Moment, ich muss das gerade"}, {"id": 548, "start": 4038.04, "end": 4047.68, "text": "mal checken in meiner Vorschau hier. Okay, Thumbnail Concept, zeig mal her. Ne, nein,"}, {"id": 549, "start": 4047.68, "end": 4053.4, "text": "nein, nein, nein, nein, nein, das kann ich nicht machen. Man kann es ja verdammt gesehen,"}, {"id": 550, "start": 4053.4, "end": 4065.28, "text": "die Leute fallen nicht mehr drauf rein auf so extreme Sachen. Heute muss besser Clickbaited"}, {"id": 551, "start": 4065.28, "end": 4070.28, "text": "werden. Die Leute erkennen Muster in sowas und die wissen genau, das ist ein typisches"}, {"id": 552, "start": 4070.28, "end": 4080.56, "text": "Gebate, Clickbait. Ja, die Leute sind doof, aber die Leute erkennen dofe Muster. Das ist"}, {"id": 553, "start": 4080.56, "end": 4089.2, "text": "was, das hättest du vor zwei Jahren machen können. Meinst du das mit der Mikrowelle?"}, {"id": 554, "start": 4089.2, "end": 4102.72, "text": "Das wurde mir auch vorhin empfohlen, ich hab's nicht geguckt. Ich bin begeistert, Leute,"}, {"id": 555, "start": 4102.72, "end": 4114.32, "text": "guck mal, wir haben es jetzt ernsthaft geschafft, über ne Stunde nichts anderes zu machen als"}, {"id": 556, "start": 4114.32, "end": 4119.08, "text": "zehn Fragen im Chat zu beantworten und drei, vier Sachen zu zeigen. Fertig, easy Content."}, {"id": 557, "start": 4119.08, "end": 4123.52, "text": "Warum mach ich mir überhaupt noch Gedanken darüber, was ich im Stream zeigen könnte?"}, {"id": 558, "start": 4123.52, "end": 4134.56, "text": "Die Leute erkennen den Clickbait am Ende, drücken sie trotzdem drauf. Ich glaube, das"}, {"id": 559, "start": 4134.56, "end": 4148.72, "text": "überschätzt du, wie dumm dumme Leute sind. Also, die erkennen das schon. Hey, ich teste"}, {"id": 560, "start": 4148.72, "end": 4158.0, "text": "da nix. Wer das Video von heute nicht geguckt hat, guckt mal rein, ihr könnt das Video,"}, {"id": 561, "start": 4158.0, "end": 4161.92, "text": "weil manche schreiben, ihr guckt gerne Videos zum Einschlafen. Ihr könnt das Video zum"}, {"id": 562, "start": 4161.92, "end": 4167.96, "text": "Einschlafen gucken, da gibt's keinen Gameplay dabei. Übrigens, was mich gewundert hat"}, {"id": 563, "start": 4167.96, "end": 4175.96, "text": "in den letzten Videos, es haben ein paar Leute was geschrieben von so sinngemäß, also in"}, {"id": 564, "start": 4175.96, "end": 4195.28, "text": "dem Video, ich kann es euch einfach zeigen. Hier, genau, das haben tatsächlich einige"}, {"id": 565, "start": 4195.28, "end": 4201.08, "text": "geschrieben in dem Video und auch unter den letzten Videos, so nach dem Motto, ob es mich"}, {"id": 566, "start": 4201.08, "end": 4208.36, "text": "interessieren würde, für wen ich arbeite und ob ich Probleme damit habe, so wie wohltätig"}, {"id": 567, "start": 4208.36, "end": 4212.8, "text": "oder so mein Arbeitgeber ist und das muss ich mal ganz ehrlich, das habe ich ja auch"}, {"id": 568, "start": 4212.8, "end": 4221.1, "text": "drunter gar nicht geantwortet, aber ganz ehrlich, es ist mir zu 99% scheißegal, solang es nicht"}, {"id": 569, "start": 4221.1, "end": 4229.92, "text": "irgendwas ist mit Tierversuchen oder so oder mit, selbst wenn es ein Waffenhersteller ist,"}, {"id": 570, "start": 4229.92, "end": 4236.32, "text": "das würde ich mir vielleicht zweimal überlegen, aber wenn es viel Geld ist, ich meine, ich"}, {"id": 571, "start": 4236.32, "end": 4241.16, "text": "muss ja niemand erschießen dafür. Nee, aber, sag mal so Tierversuche und Waffenhersteller"}, {"id": 572, "start": 4241.16, "end": 4243.84, "text": "wären vielleicht so Sachen, da würde ich sagen, nee, also Tierversuche würde ich auf"}, {"id": 573, "start": 4243.84, "end": 4249.04, "text": "gar keinen Fall machen. Menschenversuche sind okay, ja, da habe ich kein Problem mit, aber"}, {"id": 574, "start": 4249.04, "end": 4258.72, "text": "Tierversuche würde ich nicht supporten. Das, da würde ich mir das überlegen, aber ansonsten"}, {"id": 575, "start": 4258.72, "end": 4263.76, "text": "ist mir das vollkommen egal, was die da irgendwie machen und es hat auch letztens unter dem"}, {"id": 576, "start": 4263.76, "end": 4271.28, "text": "Video, unter dem da vor einer geschrieben, ich glaube noch in dem Battlefield-Video,"}, {"id": 577, "start": 4271.28, "end": 4274.66, "text": "da wollte ich, ich habe mir schon fast überlegt, ob ich da mal ein eigenes Video zu machen"}, {"id": 578, "start": 4274.66, "end": 4281.2, "text": "sollte, weil ich das interessantes Comment fand, wo ich nämlich glaube, dass in der"}, {"id": 579, "start": 4281.2, "end": 4310.36, "text": "Hersteller vollkommen jebaited hat. Wenn ich es finde. Tja, nee, keine Ahnung."}, {"id": 580, "start": 4310.36, "end": 4316.4, "text": "Da hat jemand geschrieben, er wird sich auf jeden Fall das nächste Battlefield kaufen,"}, {"id": 581, "start": 4316.4, "end": 4321.48, "text": "weil DICE öffentlich Black Lives Matter unterstützt und gerade deswegen ist das für ihn ein"}, {"id": 582, "start": 4321.48, "end": 4325.6, "text": "Pflichtkauf und ich habe mir gedacht, ich müsste zu diesem Comment eigentlich mal ein"}, {"id": 583, "start": 4325.6, "end": 4329.64, "text": "eigenes Video machen, nämlich gar nicht so sehr über irgendwelche Charity-Bewegungen"}, {"id": 584, "start": 4329.64, "end": 4334.8, "text": "oder dass man Black Lives Matter supportet, das ist glaube ich nur sekundär, sondern"}, {"id": 585, "start": 4334.8, "end": 4340.32, "text": "dass der Hersteller damit genau das erreicht, was die erreichen wollen, weil im Kern scheißen"}, {"id": 586, "start": 4340.32, "end": 4345.04, "text": "die Hersteller auf alles, was irgendwie Ethik oder irgendwas, das ist den Herstellern vollkommen"}, {"id": 587, "start": 4345.04, "end": 4351.48, "text": "egal, aber der Hersteller hat damit genau das geschafft, was er schaffen wollte, der"}, {"id": 588, "start": 4351.48, "end": 4359.04, "text": "hat sich quasi so ein schönes Image verpasst, dass sogar die Leute sagen, hey, wir unterstützen"}, {"id": 589, "start": 4359.04, "end": 4362.6, "text": "den Hersteller jetzt, also die haben quasi Sellout gemacht, die haben sich quasi so ein"}, {"id": 590, "start": 4362.6, "end": 4367.08, "text": "gutes Image damit verpasst, dass die quasi allein schon damit wieder Geld verdienen,"}, {"id": 591, "start": 4367.08, "end": 4372.84, "text": "die haben genau das erreicht, was sie wollen, weil ansonsten ist das denen vollkommen egal,"}, {"id": 592, "start": 4372.84, "end": 4379.6, "text": "egal in welche Richtung das geht, denen gehts ums Geld, denen gehts eigentlich nur ums Geld,"}, {"id": 593, "start": 4379.6, "end": 4384.16, "text": "wie gesagt, Ausnahmen bestätigen die Regeln, das ist das gleiche, das ist das gleiche,"}, {"id": 594, "start": 4384.16, "end": 4387.6, "text": "wie wenn du Leute hast, das habe ich auch unter dem letzten Video geschrieben, das ist"}, {"id": 595, "start": 4387.6, "end": 4393.0, "text": "das gleiche, wie wenn du Ölkonzerne hast, wenn du Ölkonzerne hast und die jetzt voll"}, {"id": 596, "start": 4393.0, "end": 4398.24, "text": "grün sind auf einmal, das ist denen doch auch scheißegal, die wissen einfach nur, dass"}, {"id": 597, "start": 4398.24, "end": 4406.08, "text": "es gut ankommt, das ist denen vollkommen egal und Blizzard, Blizzard waren ja eh noch die"}, {"id": 598, "start": 4406.08, "end": 4413.6, "text": "geilsten, ne, Blizzard waren eh die geilsten, so nach dem Motto, Hongkong, was, wie, null,"}, {"id": 599, "start": 4413.6, "end": 4418.72, "text": "nee nee, Hongkong scheißen wir drauf, interessiert uns überhaupt nicht, äh, Mist, wir haben"}, {"id": 600, "start": 4418.72, "end": 4423.96, "text": "zu viele Tencent-Anteile, ach nee, wie, da waren Caster im Bild, ja die schmeißen wir"}, {"id": 601, "start": 4423.96, "end": 4431.48, "text": "gleich mit raus, Blizzard voll geschissen auf Hongkong, vollkommen egal, ne, und dann"}, {"id": 602, "start": 4431.48, "end": 4435.76, "text": "drei Wochen später, so nach dem Motto, oh ja, wir stehen voll an der Seite von Black"}, {"id": 603, "start": 4435.76, "end": 4440.4, "text": "Lives Matter, es geht in dem Fall überhaupt nicht drum, ob man diese Initiativen gut oder"}, {"id": 604, "start": 4440.4, "end": 4446.88, "text": "schlecht findet, das ist einfach so, wie nennt man das, so heuschlerig alles, das kannst"}, {"id": 605, "start": 4446.88, "end": 4454.52, "text": "du nicht glauben, das kannst du einfach nicht glauben alles, es geht ihm einfach nur um"}, {"id": 606, "start": 4454.52, "end": 4461.04, "text": "das eigene Wohl und das ist das, was man erstmal realisieren muss bei der ganzen Geschichte,"}, {"id": 607, "start": 4461.04, "end": 4468.0, "text": "es geht dem nur darum, in irgendeiner Art und Weise daraus Kapital zu schlagen, sonst"}, {"id": 608, "start": 4468.0, "end": 4487.68, "text": "nix, was das Unternehmen gendert, oder das können die meinetwegen machen, das ist mir,"}, {"id": 609, "start": 4487.68, "end": 4492.44, "text": "das ist auch so ein Thema, das geht mir sonst wo vorbei, solang nicht einer von mir erwartet,"}, {"id": 610, "start": 4492.44, "end": 4498.28, "text": "dass ich jetzt irgendwelche komischen Zungenbrecher verwende, ich frag mich übrigens bis heute"}, {"id": 611, "start": 4498.28, "end": 4504.88, "text": "noch, wie die gendergerechte Variante von Bankkaufmann ist, oder von System, IT Systemkaufmann,"}, {"id": 612, "start": 4504.88, "end": 4509.68, "text": "also was ist die gendergerechte Variante von Bankkaufmann, ich war mir jetzt klar, dass"}, {"id": 613, "start": 4509.68, "end": 4518.24, "text": "man Bankkaufmann und Bankkauffrau sagen kann, aber wie macht man da ein Wort drauf, Bankkaufinnen"}, {"id": 614, "start": 4518.24, "end": 4527.64, "text": "oder wie, das ergibt keinen Sinn, eigentlich ist mir das vollkommen wurscht, solang das"}, {"id": 615, "start": 4527.64, "end": 4533.08, "text": "keiner von mir erwartet, das kann jeder machen wie er will, das kann jeder komplett machen"}, {"id": 616, "start": 4533.08, "end": 4542.48, "text": "wie er will, ich bin ja eh ein Fan von freier Entfaltung und das sollen die einfach machen,"}, {"id": 617, "start": 4542.48, "end": 4549.8, "text": "solang von mir keiner erwartet oder mir das irgendwie aufzwingen will, das klingt natürlich"}, {"id": 618, "start": 4549.8, "end": 4556.96, "text": "auch sehr sinnvoll, was ich aber witzig finde, wenn es um negative Sachen geht, dann ist"}, {"id": 619, "start": 4556.96, "end": 4565.6, "text": "das meistens in Ordnung, wenn das männlich ist, aber letztendlich juckt es mich nicht,"}, {"id": 620, "start": 4565.6, "end": 4570.8, "text": "das ist ein Thema, ganz ehrlich, ich setze mich damit auch ungern auseinander öffentlich"}, {"id": 621, "start": 4570.8, "end": 4575.96, "text": "oder generell noch ungern auseinander, weil da geht es zum größten Teil gar nicht mehr"}, {"id": 622, "start": 4575.96, "end": 4585.52, "text": "darum eine rationale nachvollziehbare an der realen Welt orientierte Sache zu machen, sondern"}, {"id": 623, "start": 4585.52, "end": 4590.72, "text": "nur um irgendwelche ideologischen Dinge durchzudrücken, von denen man sagt, keine Ahnung was das noch"}, {"id": 624, "start": 4590.72, "end": 4596.12, "text": "für ein Bezug zur Realität hat, sondern wir fantasieren uns einfach zusammen, dass es"}, {"id": 625, "start": 4596.12, "end": 4605.56, "text": "besser ist und es juckt mich nicht, es juckt mich nicht, ist mir egal, was hatte die 1"}, {"id": 626, "start": 4605.56, "end": 4610.2, "text": "in der Uhr getan, das ist so eine Angewohnheit die ich habe, das kommt in dem Video erkläre"}, {"id": 627, "start": 4610.2, "end": 4615.12, "text": "ich es ja auch, weil die Frage kommt total oft, ich habe mir irgendwann mal eine angewöhnte"}, {"id": 628, "start": 4615.12, "end": 4620.52, "text": "1 in die Zwischenablage zu machen, ich glaube das kommt noch aus Zeiten wo ich ICQ und sowas"}, {"id": 629, "start": 4620.52, "end": 4626.32, "text": "verwendet habe oder MMO Chats, dass ich nicht aus Versehen das falsche Copy Paste, deswegen"}, {"id": 630, "start": 4626.32, "end": 4633.84, "text": "habe ich immer mal eine Zwischenablage überschrieben, ich habe in MMOs ab und zu mal das falsche"}, {"id": 631, "start": 4633.84, "end": 4639.24, "text": "Copy Paste an die falschen Leute, das war immer peinlich, wenn du vor allem wenn es"}, {"id": 632, "start": 4639.24, "end": 4642.6, "text": "derjenige ist, über den du gerade voll ablässt hast und dann Copy Paste die in die Messager,"}, {"id": 633, "start": 4642.6, "end": 4655.68, "text": "ich habe keine Links in der Zwischenablage, ich habe meistens Texts in der Zwischenablage,"}, {"id": 634, "start": 4655.68, "end": 4661.92, "text": "aber stell dir mal vor, du bist in dem MMO und chattest da irgendwie mit 5-6 Leuten gleichzeitig"}, {"id": 635, "start": 4661.92, "end": 4665.6, "text": "und einer davon ist der übelste Depp der dir immer auf den Keks geht, aber in irgendeiner"}, {"id": 636, "start": 4665.6, "end": 4669.56, "text": "Art und Weise musst du dich doch ganz gut mit ihm stellen, dann ist es schlecht wenn"}, {"id": 637, "start": 4669.56, "end": 4674.64, "text": "du gerade einem anderen schreiben willst, alter der Kacknoob schreibt mich schon wieder an"}, {"id": 638, "start": 4674.64, "end": 4686.88, "text": "und ich sende es ihm aus Versehen, ja wusste ich, habe ich hier übrigens ausgeschaltet,"}, {"id": 639, "start": 4686.88, "end": 4693.92, "text": "weil Woop League, man weiß ja nie, der Depp ist Meister Gilden, ich muss zu sagen, ich"}, {"id": 640, "start": 4693.92, "end": 4700.44, "text": "war in MMOs nur in Ultra Elite Hardcore 247 Kreiselgrinder Gilden, ich habe mich mit Noobs"}, {"id": 641, "start": 4700.44, "end": 4709.68, "text": "in MMOs erst gar nicht abgegeben, nein ganz so schlimm war es nicht, ich war immer nur"}, {"id": 642, "start": 4709.68, "end": 4725.68, "text": "in High-Level Elite PvP Gilds, keine Zeit mit Noobs da zu groupen, das ist eigentlich"}, {"id": 643, "start": 4725.68, "end": 4732.92, "text": "total hängen geblieben, ich habe mir damals ja übelst was drauf eingebildet, weil Daok"}, {"id": 644, "start": 4732.92, "end": 4737.32, "text": "8 vs 8 gespielt und sich übelst geil gefunden, dass man den halben Server geowned hat, was"}, {"id": 645, "start": 4737.32, "end": 4742.04, "text": "nicht schwer war, weil 90% der Spieler richtige Kacknoobs waren, die du weg Aeen konntest"}, {"id": 646, "start": 4742.04, "end": 4752.12, "text": "mit ein paar gut geskillten und gut equipten und gelevelten Chars, damals fand ich das"}, {"id": 647, "start": 4752.12, "end": 4756.68, "text": "so geil, dass wir da mit 8 Leute 50 gekillt haben, da ging mir richtig einer drauf ab,"}, {"id": 648, "start": 4756.68, "end": 4772.6, "text": "ich bin aber nicht mehr lange da, ich bin genau noch 4 Minuten da, ganz im Ernst, Passt"}, {"id": 649, "start": 4772.6, "end": 4779.16, "text": "of Exile 2, ich kann mir nicht vorstellen, dass Diablo 4 auch nur ansatzweise da rankommt,"}, {"id": 650, "start": 4779.16, "end": 4783.24, "text": "es ist schon lange nicht mehr so, dass Passt of Exile die Konkurrenz zu Diablo ist, mittlerweile"}, {"id": 651, "start": 4783.24, "end": 4788.16, "text": "ist es so, Diablo ist die Konkurrenz zu Passt of Exile, die haben gezeigt, dass man es schaffen"}, {"id": 652, "start": 4788.16, "end": 4795.52, "text": "kann, ein Game jahrelang am Leben zu halten, auch wenn, und das muss man da auch mal sagen,"}, {"id": 653, "start": 4795.52, "end": 4802.16, "text": "auch wenn in letzter Zeit sehr viele hardcore Passt of Exile Fans pissed sind auf Crying"}, {"id": 654, "start": 4802.16, "end": 4809.08, "text": "Gear Games, aber die haben es wirklich lange geschafft, dass die Fans gut auf sie zu sprechen"}, {"id": 655, "start": 4809.08, "end": 4814.6, "text": "waren, also ich kenne kaum einen Hersteller, der ein Game gemacht hat und irgendwie 8 Jahre"}, {"id": 656, "start": 4814.6, "end": 4818.2, "text": "oder so am Stück supportet hat und die Leute mochten den Hersteller, die haben es erst"}, {"id": 657, "start": 4818.2, "end": 4828.84, "text": "die letzten 1-2 Jahre verkackt, nee Patrick, das sind nicht nur die Hardcore Leute, die"}, {"id": 658, "start": 4828.84, "end": 4833.36, "text": "waren auch positiv immer Crying Gear Games gegenüber gestellt, weil die Hardcore Leute"}, {"id": 659, "start": 4833.36, "end": 4840.44, "text": "sind ja auch das, die die ganzen 300€ Skin Packs und so kaufen, die müssen wohl irgendwas"}, {"id": 660, "start": 4840.44, "end": 4845.32, "text": "an ihrer Kommunikation geändert haben, ich weiß es nicht, ich bin da nicht genug drin"}, {"id": 661, "start": 4845.32, "end": 4856.2, "text": "in diesen ganzen Passt of Exile Zeug, keine Ahnung, aber mal ganz im Ernst, Passt of Exile"}, {"id": 662, "start": 4856.2, "end": 4860.44, "text": "ist das, was sie schlagen müssen mit Diablo und nicht umgedreht, deswegen wenn ich drauf"}, {"id": 663, "start": 4860.44, "end": 4864.8, "text": "tippen müsste, wenn ich mir angucke, was Blizzard die letzten Jahre immer so gebaut hat, wenn"}, {"id": 664, "start": 4864.8, "end": 4873.44, "text": "ich mir dann angucke, was Grinding Gear Games gemacht hat, für mich ist klar, PoE 2 wird"}, {"id": 665, "start": 4873.44, "end": 4880.16, "text": "es machen, vielleicht nicht der initiale Hype, der initiale Hype hat Diablo immer, aber langfristig"}, {"id": 666, "start": 4880.16, "end": 4901.56, "text": "Passt of Exile 2 ganz klar, ja macht es, Sacred 1 mit A, das war wirklich gut, Sacred 2 fand"}, {"id": 667, "start": 4901.56, "end": 4909.24, "text": "ich auch nicht so übel, Windows Updates, ja by the way, ich müsste jetzt, vielleicht"}, {"id": 668, "start": 4909.24, "end": 4922.2, "text": "es ist 21h1, Diablo 2 Remastered, Diablo 2 ist ja auch ein Game, also du kannst eigentlich"}, {"id": 669, "start": 4922.2, "end": 4936.24, "text": "kaum was verkacken, also das hat ja auch nicht die Komplexität von dem Warcraft 3, ich glaube,"}, {"id": 670, "start": 4936.24, "end": 4940.92, "text": "man kann Diablo 2 gar nicht so richtig verkacken und ich wette, mit euch Blizzard schafft es"}, {"id": 671, "start": 4940.92, "end": 4952.36, "text": "trotzdem irgendwie, dass es am Ende schlechter ist als das Original, ja ja, wie gesagt, möglich"}, {"id": 672, "start": 4952.36, "end": 4956.92, "text": "ist es, möglich ist es, nee, Aktionshaus machen die nicht mehr, also sollten die wirklich"}, {"id": 673, "start": 4956.92, "end": 4963.68, "text": "echt Geld schütten, Diablo 2 einbauen, das ist vorbei, nee, das glaube ich nicht, aber"}, {"id": 674, "start": 4963.68, "end": 4967.12, "text": "ich glaube, sie werden es in irgendeiner Art und Weise anders verkacken, ich weiß noch"}, {"id": 675, "start": 4967.12, "end": 4983.6, "text": "nicht wie, aber die schaffen es, die schaffen es irgendwie, Leute, es ist soweit, es ist"}, {"id": 676, "start": 4983.6, "end": 4991.52, "text": "22h, wartet mal, wen hausten wir denn, ach komm mal, der Battlefield 3 Streamsor ist wieder"}, {"id": 677, "start": 4991.52, "end": 4999.52, "text": "am Start, guck mal hier, der Battlefield 3 Streamsor, 3 in 30 Leute gucken da sogar zu"}, {"id": 678, "start": 4999.52, "end": 5021.24, "text": "und guck mal, er spielt mit I-Lesbian-Support zusammen, komm den hausten wir, haust, zack,"}, {"id": 679, "start": 5021.24, "end": 5031.04, "text": "nee er spielt nicht, Metro, was ist da los, klar ist das Metro, nee, Keg-Wade, was ist"}, {"id": 680, "start": 5031.04, "end": 5040.6, "text": "das, das ist Bazaar, nee Sand-Crossing, Sand-Crossing ist das, Sand-Crossing ist das, ich Bazaar,"}, {"id": 681, "start": 5040.6, "end": 5055.0, "text": "okay Leute, also bis denn, machts gut, CU."}]}