{"text": "Das war's für heute. Bis zum nächsten Mal. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Das war's für heute. Poggers! Huge Pog! Massive Pog! So Leute, ich bin am Start. Falls ihr eben schon was im Stream gehört habt, dann weiß ich das nicht. Der Kommentator ist am Start. 17 Monate Hyper Subscription hier. Massive Subs. So, die richtige E-Mode Größe ist entscheidend. So, perfekt. Exquisite. So, also, mal gucken, ob das alles funktioniert. Ja, Funst. Von der Benachrichtigung hier. He lacks critical information. Stream ist gar nicht live. Jebaited. Aufzeichnung. So, also, okay. Ich verrate euch mal kurz, was wir heute machen. Und zwar, ich hatte heute Rücksprache mit meinem Chef. Und mir ist aufgefallen, dass ich vor, das haben wir heute übrigens zum Glück nicht besprochen, dass ich ihm vor einem Jahr oder so erzählt habe. Warte mal. Ich mach mal, also das hab ich ja, aber wir machen heute exquisite, classic Soundtrack. Ah, yes. Für mehr Gehirnzellenstimulation. Ah, yes. Weil das ist mir eigentlich auf Dauer vielleicht auch ein bisschen zu anstrengend. Ich weiß nicht. Wie konntest du den Soundtrack wechseln? Das ist schon fünfmal durchgelaufen in der Zwischenzeit. Also, und zwar, ich hab vor einer Weile mal vorgeschlagen, ich könnte mal so eine Skills Übersicht erstellen. Wo ich mal so reinschreibe, wo ich exquisite Big Brain Skills hab. Ich hab gedacht, das können wir einfach im Stream machen. Das heißt, ich muss jetzt mal in mich gehen und mir überlegen, okay, was könnte man da alles hinschreiben? Cobol zum Beispiel. Cobol, äh, sehr gut. Grills klären, Social Media Expert. Nee, realistische Sachen reinschreiben. Ähm, und mir ist was wirklich ZG aufgefallen, Leute. Richtig ZG. Mess, also richtig, so hier. ZG ist mir gerade was aufgefallen. Und zwar sag ich dir was zu. Und zwar wisst ihr, was mir extrem ZG aufgefallen ist? Und zwar, dass es ein Plants vs. Zombies 3 gab. Schon vor über, glaub ich, im dreiviertel Jahr released. Ich hab nichts von mitbekommen. Und das Game sieht dermaßen beschissen aus, dass ich mich frage, was hat EA da wieder gemacht? Ihr wisst, dass ich riesen huge Fan bin von Plants vs. Zombies 1. Und jetzt guckt euch mal die Screenshots davon an. Was ist mit denen los? Alter, was ist das? Wollt ihr mich verarschen? Ich mein, es hat sich zurückentwickelt. Es hat sich zurückentwickelt. So, das ist Plants vs. Zombies 1 gewesen. Ich mein, jetzt mal ernsthaft. Was zum? Das ist Plants vs. Zombies auf Wish bestellt. Was ist denn mit dir? Das kann doch nicht in der Ernst sein. Echt, das ist ein... Das kann doch nicht in der Ernst sein. Guckt euch den Schrott mal an. Das ist der erste Teil. Wunderbar. Pixel-Grafik. Alles top. Super Game. Was ist denn das? Das ist... Ich weiß gar nicht, was ich dazu sagen soll. Vor allem, warum haben die Nüsse überhaupt einen Lebensbalken? Vorher hat man da erkannt, anhand wie die Grafik aussah, ob das gut oder schlecht war. So, und es wird noch schlimmer. Es wird noch schlimmer. Das hört noch gar nicht auf. Das hört noch gar nicht auf. Nicht nur, dass das Gameplay übelst ranzig aussieht. Sie haben auch noch so dämliche Level-Mechaniken eingebaut. Level deine Pflanzen auf und es wird noch schlimmer. Es wird noch... Moment, Moment. Es wird noch schlimmer. Du kannst jetzt eine eigene... Guckt euch das mal an. Was ist das für ein... Was machen die mit dem Game, Alter? Was soll das? So, und es wird noch schlimmer. Es wird noch schlimmer. Ich weiß nicht, ob man das irgendwo sieht. What the fuck? Die haben auch noch Farmville oder sowas mit eingebaut. Man kann jetzt... Man kann jetzt die Stadt aufbauen mit Microtransactions. Level your house, Microtransactions für Stadt ausbauen. Please. EA, wirst du dir jedes gute Game irgendwie versauen? Was du sehen bist, Plants vs. Zombies 3, was schon vor einem Dreivierteljahr rausgekommen ist. Okay, das stimmt nicht. Es kam so eine Early Access Version raus und die Leute haben es geflamed as fuck. Es kann doch nicht sein. Guckt euch das mal an. Das war so... Also ich will nicht sagen schön jetzt von Effekten oder so. Ein schönes Game. Das war einfach handgemalte Pixel Grafik. Das ging. Das war wunderbar. Und was macht man draus? So eine hässliche Krütze mit irgendwelchen... Was sind das überhaupt für 3D Models? Haben sie da sich irgendwie von DeviantArt... Waren sie auf Fiverr? Waren sie auf Fiverr und haben sich was machen lassen oder wie? Meine Güte, ey. Ich krieg Anfälle. Wie kann man das so verkacken? Ich meine, der zweite Teil war schon deutlich schlechter als der erste Teil. Und warum war der zweite Teil schlechter? Weil sie sich gedacht haben, anstatt motivierendes Gameplay ist genug, die Sachen frei zu spielen, hat man sich gedacht, nein, wir fucken die Leute ab und machen es jetzt mit Microtransactions. Natürlich sind das 3D Models. Guckst du dir mal an. Doch, doch. Ich würd schon sagen. Doch, doch, doch, doch. Deswegen hast du ja auch die komischen... Deswegen sieht das auch so eckig aus. Das ist so schrecklich, Alter. Ich meine, der zweite Teil... Ich hab ja nicht gespielt lange, weil Microtransactions, das ging ja noch irgendwie auf. Wie kann man, ey, wie kann man das wieder so verkacken? Ich versteh's nicht. Ich versteh's nicht. So, und das Witzige ist... Update History. Das Witzige ist, die haben das Game released in Rumänien oder so. Irgendwie Ungarn-Rumänien. Und zum Test, Early Access. Und danach, hier, die haben das quasi 25. Februar, also vor einem Jahr, in Rumänien oder so released. Und danach haben die Leute es so geflamed, dass die das Game wieder runtergenommen haben und jetzt kann man es nicht mehr spielen. Also die haben so extrem verschissen. Ich weiß nicht, was da wieder los war. Das ärgert mich. Sowas ärgert mich richtig, ja. Das war so eine geiles Game. Der zweite Teil ging auch noch. Das erste Garden Warfare war auch noch irgendwo in Ordnung. Auch wenn ich verstanden hab, warum und weshalb und naja, gut. Aber das ist wirklich komplett... Das ist, das ist, äh... Ja. Echt Pain's Champ. Nee, war's nicht. Zumachen. Dazu kann ich einfach nur, wenn ich das hier sag, wenn ich das hier seh. Kann ich einfach nur noch sagen. Ganz klar. Piss dich, Aldo. Piss dich, Aldo. So, das geht an die E. Gut jetzt aber hier zu aber so eine kacke wie man das so versauen kann Was ist das shortcut umgeschlossene short tabs shift ctrl t Sieht schrecklich aus Exzellent Das ist tatsächlich ganz nice ja das habe ich mir auch auf steam geholt ist tatsächlich ganz cool Aber ich mag halt ist dass das das plans world zombie setting finde ich viel viel cooler So ich mache mal kurz meine vm an oder vm wie die coolen leute sagen Dann sollen sie meint wegen 16 bit grafiken aber gerade bei 16 bit grafiken sind wie findet ihr die schriftart ist sie nicht poggers Warum ist heute lügenpresse kann mir das irgendjemand erklären wer hat diesen komischen wer hat es dem nightbot beigebracht? Ja ja ich weiß ihr war es alle der chat wenn man den chat fragt wer es war dann war es immer jeder I made this das ist das dümmste meme auf twitch ich verstehe gar nicht warum sich das so Hat irgendjemand eine ahnung warum dieses I made this irgendwie so beliebt ist das ist total dumm Aber gut twitch twitch und dumme chat memes da weißt ja schon bescheid soll man den kram von gestern wieder zumachen Ppega vögel erst mal update fahren erst mal Nix zu mein was nix zu tun glaube ich nicht ja erst mal hier update bäm bäm bäbä bäm update So ich muss erst mal kurz meinen font wieder zurück stellen ok damit kann ich leben Geh weg erst mal alles update zack zack So das soll jetzt mal updaten genau also was wir heute machen ich gehe mal in mich ich speichere mir das mal Ich gehe mal in mich und überlege mir mal detailliert was kann ich eigentlich Ich meine ich kann euch jetzt schon spoilern viel viel ist es wahrscheinlich nicht Aber ich wollte schon seit lange mal so eine liste erstellen wo drin steht was weiß ich welche programmier sprachen kann ich gut oder Was was was kann man da was kann man da noch so reinschreiben so windows experte zb bin ich ja auch bekannt für also gerade dass ich mich mit windows besonders gut auskennen powershell hacker Drucker reparieren sowas ja mit shit mit shit kennen wir uns ja nicht so gut Also in welchem Drucker reparieren sowas ja mit shit mit shit kenn ich mich aus ko boll ja ja ko boll ist natürlich klar Ko ball ist ist einsteiger 90,999 prozent der weltbevölkerung wollen wir wetten Ja, aber nur für für für massif konsultant geharr 250k im jahr dann mache ich domain migration easy Ich habe übrigens am anfang gesagt ich sag noch was zu irgendwie genau zu was man das macht sie geschrieben hat wollte schon was zu sagen Max ich arbeite auch teilzeit wie du muss sagen das war die beste entscheidung ja ist ist das beste teilzeit ist einfach nur Ja ich arbeite 75 prozent 75 wie funktioniert das denn Warte mal wie viel wie viel arbeite ich dann eigentlich lowbrane das überlegen wenn ich 100 prozent aber ein arbeit Einen tag weniger weniger dann sind das 20 prozent also 80 prozent oder Ich kann nicht mehr rechnen leute Das 80 ja oder ja ja Okay, dann dann bis noch ein bisschen weniger huge huge muffs ja Und ich brauche doch wieder ein bisschen nintendo gedudel dass es geht geht einfach besser Immer Einfach nice so deswegen verstehe ich gar nicht warum die brats auf der wald musik so pepega ist Zumindest nicht zum zumindest ich fand sie langweilig so hier updates gemacht beim So ich lasse das mal kurz updates durchlaufen und jetzt höre ich halt gucke ich noch mal kurz chat Es ist echt so das ist genauso wisst ihr jetzt immer ernsthaft ich will jetzt nicht weiter drauf rumreihen wisst ihr warum das neue plans Was ist so kacke aussieht die wollen keine leute verschrecken und man spricht den casuals Dicht den casual der welt an das sind nicht also die die leute die mit sowas angesprochen werden sollen Das sind welche das sind nicht die leute die man sich und die wir uns unser casuals vorstellen ja Was sie damit ansprechen wollen ist das ist so wie mcdonalds ihr essen macht McDonalds macht ihr essen auch nicht darauf dass es quasi gut schmeckt mcdonalds macht ihr essen darauf dass es einen möglichst geringen prozentsatz an leuten gibt die es nicht essen können Das ist das ist das ist ja der trick dabei mcdonalds würde überhaupt keine vorteile davon ziehen wenn dies jetzt irgendwie besonders gut machen würden Die die die sorgen einfach dafür dass es Also du kannst ja auf der einen seite so besonders exquisite sachen machen wo du dann halt vielleicht nicht viele hast die das mögen aber die die das mögen die sagen halt Boah das ist ja besonders fein Und mcdonalds macht die umgedrehte taktik die machen es nicht besonders fein die machen es so dass es möglichst viele so wie farscht Stuhlmusik im endeffekt dass das da ist die farscht stuhlmusik der mobile games was ihr da seht Allem schinks tier 1 10 monat dankeschön poggers Ja heute mal was skill skill ist irgendeine markdown skill ist da muss ich jetzt aber erst mal updaten für Ne muss ich net aber ich mache es mal updaten Ich habe mal früher fünf euro die stunde trucker repariert frag doch mal ob du bei hardware rad pc zusammen bauen kannst Da verdient sie bestimmt mehr als fünf euro die stunde und ich habe gehört die suchen leute Ist das ungoogle korn das ist kaum jem ja Ja Ja so sieht es aus es ist so es ist damit die mutter diese grafik sieht so aus damit die mutter und nicht nur die mutter das Das das ist wie soll ich das beschreiben Die mutter ist noch normaler casual das das sind so sachen die richten sich an leute die möchten möglichst wenig Wenig haben wo sie anecken können ja also das ist ein spiel das ist garantiert auch also die sind auf so eine grafik gekommen Weil die auch veganer nicht triggern wollen 100 pro Das da machen die sich jeden scheiß gedanken heutzutage Oder kann man halt manche sachen nicht machen Ja Ist es im endeffekt auch das ist das mcdonalds essen der mobile games oder die fahrstuhl musik der mobile games Abzack sagt aber Immer immer noch besser also man er p.m. Geht mir teilweise echt noch mehr auf den kicks floor the game stufe 1 sag ich schon für den primes ab huge IQ increase ok Gehen wir mal hier rüber hat er updates installiert massive sommer rebooten bm Reboot schadet nicht guck ich ich mache mal ein reboot vielleicht kriege ich ein neues hintergrund bild von bingen Es ist übrigens der einzige service den ich jemals von bingen verwendet habe und verwende verwende Die daily daily image von bingen für meinen hintergrund das ist einzige Also pack mein 6.0 nie das ist bingen markt vögel oder Was ist das überhaupt Er any ornithologen in der chat was sind das was sehe ich hier für vögel Storch nee das ist kein storsch Storch nee das ist kein storsch Seine großeltern benutzen bingen Wegen den schönen bildern ja genau So leute wollen die mit plans was zombies drei ansprechen So ok ich mache jetzt mal einen neuen ordner mk dir Keck w3 weil keck w1 gibt es garantiert schon Ah Wusste ich dass es das gibt wusste ich das gibt keck wie gibt es schon Keck wie gibt es schon keck weight und keck wie drei also so touch skills punkt md Zack so sehr schön also So ist jetzt müssen wir uns gedanken machen jetzt wirds jetzt wirds big brain also was schreibt man was schreibt man in so was rein Was was schreibt man in so was rein also Mima ich weiß ja nicht das soll schon was das soll schon was bisschen seriöses sein wo ich dann auch sagen kann ok hier lasst Mal nachgucken Das sind keine kraniche das weiß ich ja das kann sein ich kraniche sind das nicht das sind 5 hat bürz Also also kann das nicht irgendwie die markt markt dauernd vorschau oder sowas konnte das nicht Ah jetzt Skillorts so Also fangen wir mal an mit das mal überlegen mit was mit was fängt man gut an linux linux Linux linux linux wir fangen mit linux an ok linux linux linux Zweite header draus linux ok Also linux an sich Was fällt da drunter schauss scripting kann ich gut so bash zsh so die standard dinger Aber ich mach plus plus plus dahinter so für wie gut ich das kann So was gibt es dann sonst auch was gibt es dann sonst auch für für Sachen unter linux zu zu zu ahnung zu haben also red hat cento s kenne ich mich super aus Ubuntu debian kenne ich mich gut aus Aus suse moment wir brauchen auch das passende image keck weh Wie macht man noch mal ein image in markt dauernd Image markt dauernd Irgendwie irgendwas mit klammern ich kann mir das immer nicht merken Irgendwas mit klammern na ah ja hier guck mal da Poros Und jetzt brauche ich keck wie keck weh image copy image link So ha perfekt ob sie groß Ja wunderbar haben wir das größer machen Kameras kamer das irgendwie sie sie sie fetter machen oder so Die kriegt man die vorschau größer ok markt dauernd preview vias code von size geht auch bestimmt irgendwie von size markt dauernd preview Microsoft Also was extension markt dauernd von size ok Quatsch was mache ich denn setting Wo müssen wir hin extension Mark dauernd ah ja hier von sides 20 bäm ah Yes excellent excellent Shit Gut Also red hat kann ich sento es kann ich ubuntu debian kann ich suse kann ich überhaupt nicht suse habe ich keine ahnung davon aber suse braucht man ja auch nicht weil Es ist sagt so Was red hat red hat gleich elotrix was ach ach red hat Jetzt habe ich es verstanden Ok hat ein bisschen gedauert Hier legs critical information hat ein bisschen gedauert ja Ja Ok was schreibt man denn in sowas rein ok win windows Windows ja da fällt mir ehrlich gesagt nichts zu ein nächstes nächstes nächstes thema Aber so wenn das habe ich keine ahnung von ok also Linux kenne ich mich aus shell skippen sonst wie funktioniert auch wunderbar ich ich muss mir echt mal ein bisschen gedankt machen was man da Alles rein was man alles reinschreibt also jetzt machen wir erstmal betriebssysteme so Dann würde ich da mal sowas wie mal sowas wie klaut Also klaut technisch kenne ich mich aus mit netlify ganz ok mit Dings hier Und Wie heißen sie noch mal klaut flair voll vergessen alle klaut flair Dann kenne ich mich aus ein bisschen mit aws allerdings nicht sonderlich gut mit mit google kenne ich mich auch bisschen aus So jetzt nach klaut auch dabei erkenne ich mich gut aus aber kann man überhaupt nicht vergleichen miteinander aber schreibe mal rein Übrigens ausrufe zeichnen hetzener wer 20 euro gutschein haben will Aber nur für neukunden Es ja da kenne ich mir mittlerweile ganz gut aus weil auf der arbeit viel es ja machen Ok wunderbar Digital außen ja Da kenne ich mich ganz gut mit aus habe ich lang verwendet Was wird aufgeschrieben ich habe mal vor einem jahr meinem chef gesagt hey wie sieht es dann aus haben wir nicht mehr sachen wo man ein bisschen was programmieren kann oder sonst wie Und er hat gemeint ja müssen wir mal ein bisschen übergreifen gucken da habe ich ihm gesagt weißt du was ich schicke dir mal eine skillliste Mit sachen die ich kann beziehungsweise sachen wo ich gerne was machen wo ich gerne mehr machen würde Und ich habe es ist einfach jetzt ein ja über ignoriert und nicht mal dran gedacht Ich habe mir gedacht ich mache das jetzt einfach mal im stream also ich gebe zu Das ist jetzt vielleicht nicht das allerspannendste zum zugucken aber ich muss es eh machen Und jetzt können wir auch im stream uns was überlegen Ich war ich weiß noch nicht wie ich das ganze strukturiere ich schreibe jetzt einfach mal irgendwie ein bisschen was auf ja so Cloud was zählt was zählt zu cloud sonst noch dabei ich würde sagen kubernetes und sonst wie das machen wir oder docker Geschichten das machen wir dann später unter irgendwie defops tools oder sowas Wie kommt man auf so viel cloud erfahrung einfach benutzen Und eine firma haben die dafür geld ausgibt Leute ich muss amazon sack Metser Die wichtige geschichte musst jetzt mal erledigt werden Die ist aber echt gut leute empf spelungen die ist aber echt gut leute es war ohne scheiß also ich wollte jetzt hier nicht ein sinnloses rummeme machen oder so beste barbecue sauce hier die ist richtig scheiße kennt ihr jemand von euch hell yeah ach ne falsches falsches kokona hier die ist richtig spockers warum ist das hier nicht richtig photoshopped oder sieht das auf dem glass auch so aus aber die ist wirklich gut kann man nur empfehlen sehr gut ist eine und das andere schließt sich ja nicht aus du kannst ja eins mit senf essen und eins mit barbecue sauce außerdem muss ich sagen ich habe das früher immer verkehrt gemacht ich habe barbecue sauce immer früher wie ketchup verwenden also du hast barbecue sauce dabei geschüttet damit gegessen bis ich irgendwann mal gecheckt habe das barbecue sauce eigentlich dafür da ist dass man es drauf macht und damit dann auf den grill oder oder brät oder sonst wie was oder zumindest schon beim zubereiten drauf macht und nicht danach weil man kann sicherlich auch danach drauf machen schmeckt damit auch gut das habe ich immer nicht kapiert weiß ich weiß nicht ob das wirklich so der weißheitsletzter schluss ist aber ich glaube barbecue sauce ist dafür gedacht dass man die bei der zubereitung schon drauf macht und dann schmeckt die auch besser also schmeckt so schon geil aber wenn ihr die quasi mitgegrillt hast schmeckt es noch besser auf fleisch wird bier gekippt das schmeckt nicht also mir mir schmeckt das nicht ich mag bier aber an sich nicht ich trinke nur 500 euro wein plus aber bier mag ich net chat ihr bestimmt auch oder übrigens ich muss mal wieder bestellen ich muss mal wieder bestellen bei meinem lieblings italien shop und die haben auch hier wein aber ich trinke kein wein ich trinke auch kein bier ich trinke eigentlich fast nichts alkoholisches da kann man sich einfach mal easy sechs flaschen für 40 euro holen ja oder hier oder hier 72 euro und 84 euro und so exzellent aber auch wenn man da nichts bestellt an weinen kann man da exquisite nudeln bestellen die sind wirklich die sind wirklich gut die nudeln bei denen die nudeln bei denen sind wirklich nice guckt euch die mal an hier den font den font in visual studio endlich da da habe ich drauf gewartet ja die sind wirklich poggers die nudeln und wenn man gar nicht weiß was man bestellen soll dann bestellt man einfach probier probierpaket probierpaket pass pasta und soßen dann kriegt man vier soßen und vier mal nudeln ist wirklich sehr nice wirklich sehr schmeckt echt geil das zeug von denen aber es ist halt ein bisschen teuer und ich glaube es ist nicht jedermanns fall für nudeln und soßen quasi 37 euro auszugehen wurde beim lidl 40 cent dafür bezahlt kann ich verstehen würde ich normalerweise auch nicht jeden tag machen aber schmeckt wirklich gut also ich würde es nicht ich würde es ganz ehrlich ich würde das nur zum probieren ich würde das nur zum nur zum probieren mal machen normalerweise würde ich das nicht würde ich das nicht bestellen weil die soßen sind so sind ok aber jetzt nicht wahnsinnig geil ich bestelle lieber nudeln udel so das wird bei uns an weihnachten immer an alle verteilt echt da dann kriegt ihr was gutes an weihnachten bei uns gibt es an weihnachten vom betriebsrat so einen komischen nikolaus und das war so ein nackischen nicht eingepackten nikolaus schokoladen nikolaus weil das stimmt ja gar nicht bei uns gibt es auch an weihnachten öfters mal bei uns gibt es an weihnachten auch öfters mal sachen letztes mal gab es gab es letztes mal nudel gab es das letzte mal stimmt nudel nudel und so komisches salz was bei mir heute noch unten rum steht ich weiß nicht warum salz aber nudel und salz gab es glühwein gibt es bei uns manchmal zu silvester der schmeckt mir aber nicht wie gesagt leute ich trinke eigentlich so gut wie nix das einzige was ich ab und zu ganz ganz selten mal trinke weihnachten silvester ist tatsächlich bisschen bisschen wein aber ich bin kein großer alkohol trinke ich mag bier überhaupt nicht und wein eigentlich auch nicht und irgendwelchen harten krams so wodka und sonst wie auch nicht das einzige was ich tatsächlich ganz gerne trinke ist whisky aber dann auch nur ein bisschen war es maxis schwerer alkohol darf man darüber eigentlich reden auf twitch nee aber ich mag es nicht habe ich auch schon mal habe ich auch schon mal gab falls sie ich bin mir nicht versich lafroy oder wie man die ausspricht die haben ja auch alle unterschiedliche sachen von von irgendwie hat mich nicht acht jahren bis irgendwie dann rauf zu frag mich nicht 30 jahren für irgendwie 8000 euro die flasche oder so es ist teilweise echt wobei sich das nicht lohnt verkostigungs live stream nee mache ich net aber wie gesagt ich trinke nicht nicht viel zeug so ok weiter also was was was habe ich noch für messif messif skills lassen überlegen was braucht man als als nächstes als nächstes mal programmier sprachen aber progers progers ok jetzt muss ich mal in mich gehen was für was für programmier sprachen krieg ich dann krieg ich denn gut hin vielleicht sollte man progers unterteilen in back end und in front und ent vielleicht sollte es einfach klein schreiben wieso cobalt immerhin ich würde sagen cobalt fortgeschrittener ganz klar ich meine ich kann besser cobalt als 99,99 prozent der weltbevölkerung bin ich mir sicher weil die meisten leute können gar keine programmier sprache und die die welche können können garantiert kein cobalt ich meine ich habe mit cobalt immerhin immerhin schon mal dateien eingelesen und geschrieben kannst du mit dem horst live verkostum machen mit welchem horst ach ich weiß wem du meinst du meinst denkst hier whiskey store ja genau der den habe ich jetzt gar nicht gedacht ja den gibt es ja auch noch hat er nicht einen zwei channel hat er nicht den zwei channel woran er erzählt hat klimawandel liegt an sonnen aktivität gut ich meine man kann nicht immer einer meinung sein ja außerdem es ist beim whiskey verkosten egal so machen wir mal weiter also das weiß er hier für lulz ja also fangen wir an es ist ab aber fangen wir mit was an was ich kann das kann ich gut so ruby ruby kann ich auch gut büton büton kann ich auch nicht gut mache ich zu wenig mit mache ich zu wenig mit aber wenn ich was mache ist easy so c plus plus c plus plus paint champ will ich nicht das ist sogar synchron gescrollt mittlerweile paint champ noch es ist keine programmiersprache aber noch es könnte man als technologie reinschreiben ich weiß was ich was meine ich schreibe es einfach mal auf ich schreibe es einfach aus nein aber beschreibe ich da nicht rein so ja war du könntest 50 prozent machen für progress bar was was ist das denn progress bar def in einem minute was was was was sehe ich da kann man das irgendwie einbinden oder wie du verdienst doch dein geld mit java nähe zum glück nicht ich meine viele unserer software ist in java da mache ich nicht mit den die ausrufe zeichnen 50 prozent das klappt auch im leben nicht oder nähe mit dem link dahinter so das ist ja cool oder das ist ja mal big brain alter das ist wirklich next level shit hier ok excellent das machen wir so so machen wir das java fünf ach komm zwar ich kann java lesen und schreiben ich mag java aber nicht der komfort sich ich ich kann das aber ich mag das nicht ok c++ kann ich aber ich mag es absolut nicht aber ok es soll ja was ernsthaftes werden es soll ja was ernsthaftes werden ok 60 ich meine ich hasse es da was mit was zu machen aber ich krieg es mittlerweile ganz ich krieg das mittlerweile echt ganz gut hin also auch wenn viele sachen noch böhmische dörfer sind aber das ist normal in c++ 70 ruby ruby kann ich wirklich gut auch wenn ich schon ganz lang nichts damit gemacht habe was passiert eigentlich wenn ich jetzt 1000 reinschreibe 9000 poggers bringt ja zwar nix aber cobalt 10 ich mein cobalt ernsthaft ja puzzle meister dankeschön für den zapp ok lasst mal weiter überlegen was haben wir noch für was haben wir noch für für neise für neise prognose sprachen was kann ich dann noch go go kann ich mittlerweile tatsächlich ganz gut aber ich drück mich immer was davor in go zu machen weil es einige sachen an go gibt die mich nerven ich verwendet go immer nur dann wenn es gute libraries in go gibt oder das ökosystem halt go erfordert ansonsten mache ich eigentlich bogen um go weil es ist mir doch ein bisschen sehr minimalistisch in vielen stellen wisst ihr es gibt zum beispiel eine sache die ich nicht verstehe warum man warum man das 2021 rast habe ich auch mal ausprobiert ja können wir auch gleich was dabei schreiben was habe ich aber zuletzt vor ein paar jahren gemacht als es relativ neu war also was mich halt an go nervt ist zum beispiel diese sache ich weiß zum beispiel ich kann mir einfach ums verrecken nicht merken wie die wie die maps und tags ist in go es ist es ist ganz schlimm also wenn du in go eine variabler anlegen willst da musst irgendwie so int wie ging das ich kann ich kann es mir nicht merken ich kann es mir einfach nicht merken so map so ich kann es mir einfach nicht merken maps und tags go nicht mappo ja aber plus gleich geht nicht wenn es global ist das war doch richtig was ich gemacht habe fast leute es war fast richtig es war fast richtig guck mal es war fast richtig was ich gemacht habe das ist aber auch eklig ist und tags aus dem kopf so also so das ist das ist eine map zuordnung key value also sprich so was hier zum beispiel map 0 w gleich 1 so und was ich halt was ich halt überhaupt nicht mag an go ist dass wenn man jetzt zum beispiel sagen wenn man hat man hat einen int array ich finde diese sind total und eingängig dann haben sie noch ihre komische slice syntax die noch mal anders ist so und was ich halt ein bisschen doof hin du hast in du hast in go einen array mit fünf elementen so in jeder programmiersprache kannst du sowas machen array sagen wir jetzt irgendwie keine nennen wir mal javascript filter element ich will alle elemente haben die größer als zwei sind so neues ray gleich so das kannst du in nahezu jeder sprache machen dies heute gibt nicht in go in go funktioniert das net weil die sich gedacht haben vorschleife master race in go in go musst du dann in die vor range war das so die syntax go for range ja fast fast fast fast fast fast so das ist die syntax in go und die sind in go richtig scharf drauf dass du alles verschleifst ja also so nach dem motto wie array filter sonst wie ne gibt es nicht gibt es nicht nein mach mach schleife von hand und ich finde auch dieses plus klar dieses doppelpunkt gleich ein bisschen pains champing weil du kannst sachen mit wahr anlegen du kannst sachen dann naja es ist wie gesagt ich finde go ist nicht so konsequent in manchen sachen aber es ok ist ist in ordnung also kann man verwenden ich finde so eigentlich kutteln damit habe ich tatsächlich noch nichts gemacht das finde ich halt ein bisschen pains champ in go aber ich mag go an sich also wenn ich die auswahl habe jetzt mal ernsthaft wenn ich die auswahl habe machst du was in go oder machst du was in c++ da können wir davon ausgehen ich werde ich würde jeden tag go verwenden so machen wir weiter javascript so dumm es klingt mittlerweile kriege ich javascript eigentlich ganz gut hin auch wenn es immer noch ein paar ich habe eine null vergessen bei kobol du meinst es muss so sein wie gesagt ich habe sie eben gesagt ich kann kobol besser ich kann ich kann kobol besser als 9.99 pro welt der weltbevölkerung das heißt aber bei kobol auch nix immer dieses c++ gebasche naja c++ ist ja auch einfach zu basteln weil c++ kacke ist so als javascript kriege ich mittlerweile auch echt ganz gut hin auch wenn es noch so ein paar sachen gibt die die mich immer kringen lassen javascript ja zum beispiel objekte schleife objekte oder oder was gibt es was gibt es noch so schön kringiges in javascript ich meine gleich gleich gleich ist ja immer so ein bisschen so eine sache was gibt es so schön kringige sachen noch in javascript immer pein die immer richtig pein sind dass da auch wieder drei verschiedene variablen du kannst du kannst machen du kannst konst machen du kannst einfach so zuweisen ja das ist ein bissl inkonsequent aber es ergibt es ergibt in javascript sogar noch sinn weil javascript eben gewachsen ist in den letzten jahren und dadurch dass es im browser drin ist kannst du auch einfach alte sachen über bord schmeißen dass dann sachen nicht funktionieren get burrito dankeschön twitch prime gaming so type script muss ich ehrlich sagen ich habe ein bisschen was mit type script gemacht aber ich blick aber weiter noch nicht wirklich gut durch kommen wir mal html css in einem da bin ich echt nicht gut ich sag mal 50 also gerade css gerade css habe ich echt da komm ich meine ich kriege wer ich kriege webseiten frontend sind das ist kein kein ding aber ich bin gerade was css angeht bin ich immer wieder überrascht wie easy man sachen in css machen kann wenn man weiß was man macht ach moment hat er mir alles nicht beckent lull keck wait kennt ihr nicht die html das html beckent wenn ich das meinem chef zeige dann bekomme ich den java kurs kann schon sein o pp pp ja pp kann ich tatsächlich auch halbwegs brauchbar ich würde mal sagen so 50 50 hat jemand meine frage an den chat hat jemand von euch auf meinem battlefield 4 server gespielt damals wahrscheinlich nicht wahrscheinlich nicht schon so lange her wahrscheinlich was was der max hatten battlefield 4 server gehabt und auf meinem battlefield 4 server hatte ich eine php ist der zeite da konntest du auf max fps.de gehen ich glaube slash battlefield 4 oder so oder hast du eine übersicht gesehen an statistiken von leuten ja genau auf nitrado genau da hast du eine statistik gesehen von kills und alle möglichen sachen von den leuten die auf dem server gespielt haben und das war mit php gemacht mit laravel laravel 08 oder so was damals es war glaube ich noch gar nicht raus das war wirklich das war wirklich nice und was halt was halt das coole war oder was immer noch das gute an am php ist das gibt es halt überall php du wirst kein host da finden php maria db oder php mai sql das sind einfach die dinger die jeder wenn ihr den den reutigsten letzten hinterwelt hauster der kann php und mai sql deswegen ist es nicht verkehrt man ein bisschen php kann ja laravel ist tatsächlich nice ich ach ja übrigens wenn wir von back end reden vielleicht mache ich den frontend weil von back end java script warum sind wir sind übrigens noch wir sind ja immer noch beim back end da würde ich sagen java script back end was nord js angeht vielleicht sollte man es doch nicht in frontend back end teilen ich mache nichts mit nord js ganz ehrlich ich habe keine ahnung von nord js ich kenne die nord js standard library nicht und nix ich kann java script ja aber ich habe von nord js kein plan mach ich mach back end nord js immer einen bogen drum ich meine ich krieg damit was gebacken wenn ich damit was basteln muss aber kein plan also ich verstehe auch ehrlich gesagt nicht warum ich nord js im back end verwenden sollte es sei denn also die der einzige grund der mir einfallen würde es gibt es okay es gibt zwei gründe die mir einfallen würden warum man nord im back end verwenden sollte das ist einmal weil man krasser frontend java script checker ist und eben im back end java script verwenden will man ist das einzige ist was man kann oder weil es irgendwelche super geilen npm packages gibt die ich verwenden will ansonsten hat irgendjemand jetzt mal ernsthaft hat sonst noch irgendjemand eine sinnvolle begründung für java script im back end ok leuchtet ein ja verstehe ich wobei ich das mit puppeteer.net mache puppeteer sharp heißt glaube ich ob es auch ein binding easy aufzusetzen gut sind andere sachen auch gleiche codebase ja ok das ist ja schon alt aber trifft immer wieder gut ist aber halt die realität ja das sage ich ja wenn man sich auskennt im frontend aber ansonsten ja dann machen wir noch generell mal hier dort das müssen wir anders nennen das muss ich irgendwie platt platforms oder sowas keine ahnung wie nennt man das runtimes mit dort nett kenne ich mich auch ziemlich gut aus an sich also ich könnte theoretisch auf wichelt basic.net programmieren aber ich will kein wichelt basic.net programmieren f sharp habe ich noch nie was gemacht mit außer mal in hello world oder so der frame frameworks der frameworks trifft sie eigentlich nicht ja machen wir mal weiter ok was für was für programmier sprachen krieg ich sonst noch krieg ich sonst noch zusammen ok ich weiß was wir brauchen oder best best zählt besser als eigene sprache gar ist es ja im prinzip best kann ich nicht schlecht sie hast du sicher auch schon benutzt ja das würde ich mal hier mit rein zählen wobei ich halt sagen würde z ist an sich eine super geschichte aber z plus plus ist kacke assembler naja also ich kann eine schleife in assembler machen was wahrscheinlich auch wieder mehr ist als 99,999 prozent der weltbevölkerung können aber wirklich gut nicht was empfiehlst du denn fürs back end was willst du denn machen battle schieb dann kann ich dir auch was sagen awk ist auch nur sprachig aber das awk und seht und sonst fast zähle ich da jetzt nicht auf perl allah was oft exes immer schlimmer also wenn du mir sagst dass du machen willst kann ich dir aus einfaches kleines webprojekt mit datenbank dahinter sq light oder richtig echte datenbank ich persönlich bin ja sq light fern für kleinen kram ja also ich würde hiermit machen ich würde sp.net verwenden sp.net core bitte schön ich sp.net sp.net ist sachen aus der steinzeit ich ich verwende gerne sp.net core allerdings ganz ehrlich wenn ich nicht schon sich habe könnte ich würde wahrscheinlich das da nehmen also wenn ich wirklich das minimalste am minimalsten brauche im back end dann würde ich das hier nehmen example hallo example das sind nur drei zeilen example soll ich mich veräppeln ja das alles was du machen musst oder kriegst du wenn du die wenn du die seite aufruf steht dann hello world drauf also das finde ich nice also wenn ich was ganz ganz kleines minimales brauchen würde und nicht so ein großer c sharp fanboy wäre das ist quasi ein bisschen wie senatra für ruby genau dann würde ich das verwenden was ist genau back end und was frontend das ist einfach zu beantworten frontend ist alles was bei dir auf dem rechner im browser läuft back end ist alles was auf dem server läuft das kann man das ist tatsächlich mal eine sache die kann man relativ einfach trennen und klassifizieren normalerweise ist die antwort immer so grau so ja aber es gibt auch so was und es gibt was in der mitte da gibt es eigentlich nichts in der mitte frontend ist alles was bei dir auf dem rechner im browser läuft und back end ist alles was auf dem server läuft fertig das kann man in dem fall tatsächlich mal ganz gut trennen was ist mit plays a server side rendering das ist server side und sobald sie auf dem klein sind die seiten und dort irgendwas dynamisch läuft dann ist es frontend da ist es kleinzeit das kann man schon relativ einfach trennen also alles interaktive alles interaktive ist klein seit ich ja und selbst wenn es über irgendwelche signal a geschichten geht letztendlich wird die webseite im klein gerendert es gibt ja so was in der richtung schon du kannst ja beispielsweise dort net komplett in web assembly laufen lassen dann kannst du theoretisch auch dein backends im frontend machen aber dann ist es halt kein backend mehr sondern es ist ein teil von einem frontend ja razor pages ist auch server side rendering und dann auf dem klein und sobald du da was interaktives macht mit javascript oder sonst wie dann ist es wieder frontend also ich finde das kann man schon relativ klar trennen so was macht man wenn man übermüdet ist schlafen würde ich sagen also wenn man übermüdet ist eine steckdose aufmachen ist glaube ich nicht so eine gute idee gibt es mittelend nee so was gibt es nicht es gibt es gibt so was wie mittelware was man ab und zu verwendet wird als teile von irgendeiner server pipeline oder sowas das ist aber auch backends so also weiter was für programmiersprachen habe ich jetzt noch was habe ich jetzt noch vergessen da man besch so irgendwas vergessen kann ich sonst noch irgendwas haben irgendwas im stream gemacht javascript bap go java c++ bei schruby c sharp wird heute noch was geprogrammt wahrscheinlich nicht programming languages wir gucken einfach mal ob ich da irgendwas ganz offensichtlich ist übersehen habe wo ich jetzt einfach nicht dran denke ok pausen ja was gibt es die scharpe ccgo r nein habe ich kein swift habe ich auch kein plan von ach groovy du hast recht groovy kann ich tatsächlich das ist das einzige was ich jemals an projekt ab oder sagen wir mal in anfangen abgeschlossen habe auf der jvm groovy tatsächlich ja habe ich habe ich tatsächlich mal gemacht javascript bap css typescript ruby c swift habe ich kein plan von objective c und er habe ich auch kein plan von schell hatte ich skala kein plan von go power shell ich habe eine sache bisher die letzten jahre über mal in power shell gemacht aber das würde ich nicht sagen als hellig großen plan von power shell und perl habe ich auch keine großartung ja gut flatter ist eher so was wie richtung dart frameworks noch dabei kommt es war auch noch easy flatter da es zehn prozent vielleicht ich habe schon mal ein beispielprojekt gemacht sql soll ich sql dabei schreiben ja das problem bei sql ist sql bin ich schlecht also sql also sql queries schreiben habe ich keinen plan wieso ich das mache weil ich mal vor über einem jahr meinem chef gesagt habe ich will ein bisschen mehr programmierstelle machen hat gesagt ja müssen wir ein bisschen rumgucken da habe ich zu ihm gesagt ja ich schicke dir einfach mal eine übersichtseite mit sachen die ich gut kann und das habe ich mich jetzt über ein jahr wieder verdrängt das ganze ich habe mir gedacht jetzt mache ich das einfach mal soft skills oh ja dass das muss sein soft skills ok scrum ops scrum eitel kann bahn ein moment das muss man linkser ich schreibe jetzt einfach einfach irgendwas rein ajay lean die schäbte schäbte teams das aber noch sonst so schön ist test driven development clean code block chain a block chain sind keine soft skills iot iot muss auch noch irgendwo rein ich weiß ich weiß bloß noch nicht wo er weiß bloß noch nicht wo voll voll das ist aber auch kein soft skill full stack ja ok man wollte es jetzt nicht übertreiben die hälfte davon habe ich habe ich eigentlich auch kein plan aber das witzige ist dass eigentlich keiner so wirklich plan davon hatten einfach so tut als ob ok wunderbar wunderbar team fähig konstruktiv innovationsfreudig also zusammengefasst 5 hat ist ihr was das schlimme ist das fällt überhaupt nicht auf zwischen diesen dämlichen buzz words dass da 5 hat steht das sieht so aus als gehört es da einfach rein jammel jammel schreibe noch ein genau aber jammel ja doch er kommt bei der bei def ob skills da kann ich kann aber tippen jason jason jason von 100 prozent ich kann sogar jammel variablen und so easy xml 9 xml schreibe ich da erst gar nicht rein reicht mir schon das microsoft zu sehr auf xml steht frontend frameworks oh ja ja ja dass das vielleicht auch nicht schlecht ok frontend frameworks ich kann eigentlich nur vgs kann ich was kann ich denn sonst noch doch das stimmte ich kann kraft ql kann ich denn da kann ich kann ich überhaupt irgendwas die react kann ich nicht habe ich noch nie verwendet bin ich der große frontend lara lara im beck ja das kann man ich weiß übrigens gar nicht wie man schreibt mit l oder mit l stopp mit einem l angular ne angular schreibe ich da nicht rein da muss ich ja noch was in angular machen die 100 prozent lull keg weight ich habe das vor fünf jahren mal verwendet für irgendwie eine kleine seite lull man muss prinzipiell gar nichts auf haben ich schreibe gerade einfach alles auf ich werde es auch nicht eins zu eins meinem chef so schicken oder so was was habe ich noch für ahnung ich meine vba pains chat bloß nicht kein vba hört mir auf euer tailwind kann ich jetzt ein bisschen haben wir letztens geübt ich wollte noch schnell habe ich irgendwelche programmier sprachen vergessen nein sieht nicht so aus alles klar exzellent ja das wusste ich alles auflisten so ich gerade programmier sprachen sind schon mal nicht verkehrt bootstrap ruby haben wir drin hier guck ruby ich werde es auch nicht so abgeben ich schreibe einfach alles ich schreibe jetzt einfach alles drauf jetzt machen wir mal jetzt kommen massif der fob skills brauchen wir jetzt huge also erst mal erst mal shit puppet habe ich ganz gut ansible kann ich mittlerweile ganz gut jenkins kann ich ganz gut github actions kann ich ganz gut github an sich kann ich wunderbar verwende jeder mittlerweile shit und shit hab was fast verum moment defops roadmap wir lassen uns jetzt einfach mal inspirieren der fob roadmap also das schreibe ich da doch nicht drauf ich schreibe da noch nicht screen und die markt drauf dachte kommt man kommt man kommt sich der leser verarscht vor man best scripting wim wim wim ich weiß nicht wo das hinkommt das muss hier unter linux oder genau wim excellent wim skills ja diesen ganzen krempel hier könnte ich da auch noch hinschreiben also ich habe ich habe ahnung von nginx ich habe ahnung wir machen mal laut balancer in einem trafik weiß nicht wie man den kram schreibt irgendwie so habe ich richtig geschrieben hätte ich gar nicht gedacht apache ist pains gempt das schreibe ich nicht drauf aber kennst du das ganz gut mit mit aus habe ich das falsch geschrieben oder ach doch habe ich falsch geschrieben das sind aussicht zu zungenbrecher immer ja das nicht verkehrt hinzuschreiben so konsul ist das in irgendwelche key value store gedöns es da bin ich ja der der richtiges skiller im es also windows windows webserver cloud fehlen cloud hatten wir hier cloud aber da da fehlen die die da fehlt noch einiges ja es ist ja der forst habe ich keinen plan von ich kenne mich eigentlich nur ganz gut mit jenkins und github actions aus ja vm wir virtualisierungs kram vielleicht noch virtualisierung da habe ich aber eigentlich gar keinen plan von da habe ich echt keinen plan von ich meine ich kann vm installieren aber ich habe keine ahnung von von irgendwie esx administration oder so was das kann ich da auch nicht reinschreiben weil wenn es eine sache gibt mit der sich mal chef auskennt ist es ex-administration da hatte echt ahnung von das hat er früher gemacht da weiß er bescheid da weiß er echt bescheid er kennt kann in den raffer reinschreiben einfach joko groups erwähnen ja kann ich dann auch noch schreibt er ich habe dann auch die docker stellz brauche man natürlich auch noch hier natürlich natürlich natürlich sack sack natürlich das muss ja auch noch alles bei der fob skills reiner docker docker kompose wird es eine liste fürs arbeitszeug ist weder noch ich schreibe ich ich ich habe mir jetzt über ich schreibe erst mal alles auf was ich irgendwie kann und dann gucke ich mal nach was man damit dann anfängt so was haben die hier noch schönes trinchen ihrer defops liste sonst nichts oder alibaba cloud die chinesen cloud wollen wir uns mal einen test warum warum warum warum ist die warum ist die alibaba cloud warum gibt es da eigentlich kein häkchen dran was ist das wieder für rassistischer höchst rassistische liste die chinesen werden ausgegrenzt leute china chinesen cloud wird nicht verwendet ich meine es könnte vielleicht was damit zu tun haben dass das datenschutz technisch bedenklich ist aber nein kann ich sein die china cloud so alibaba cloud wie kann man sich da anmelden zu zehn zwölf monate free trial ja per ich will jetzt die alibaba cloud haben das sind doch stock images das ist doch gar nix für die ops jetzt hätte ich fast leute beinahe beinahe hätte ich blok ausgemacht warum hätte ich warum will ich den blok ausmachen ausgerechnet auf der chinesen cloud so kann man sich da free account ich war mir jetzt einfach ein fake account alle fake account account so so germany your mail ja ja alles klar ok 10 minute mail brauchen wir jetzt wir brauchen hier so ein fake das da register enter your passport das sage ich euch nicht das password das password muss ich mir auch mal kurz aufschreiben ok passt perfekt ok confirm save was ja ok notification vor wo ist die bei faun nein nicht bei faun bei faun oder kennst du an unbox net nee habe ich noch nicht ausprobiert ist das deine webseite und du machst promotion oder ist es wie sagt bloß die haben das geplogged achso ich muss send noch erst klicken ich kacke kacke noob kostenlosen faun von alibar das probieren wir jetzt aus probiert aus aliexpress cloud china chinesen cloud alter kommt nicht an so wie wie wie machen wir das jetzt dies bestimmt ist bestimmt blacklisted ist alle ex auf hier big bang obhigh rose firefight success voll der崴 individual account fast nämn peter akile agilé french e adresse ja zeil eins bangfurt am ein hessen geht nicht ich muss mal kurz den dark reader aus machen leute hessen nein oder faun und 1 5 1 die woher wollen die woher wollen die wissen dass es nicht eine valid nummer ist ohne null fuck identity verification was ist was ist mit den chinesen los warum interessiert die das überhaupt buber okay was ist wenn ich jetzt enterprise mach da brauche ich auch verification id shit den voter von kund blue, okay okay sab mit was Mist wie kriege ich jetzt ein Fake Telefon noch mal her? Scheiße Was ist das free online phone ja perfekt Free online phone sehr gut sehr gut 4.9 gibt es keinen gibt es kein German Tinder Accounts Alter Ach man muss jetzt bloß 4.9 nehmen Ach scheiße man oh nee jetzt habe ich das zu gemacht Oh knapp Stimmt landender Nee land kann man ja auch nicht Ok dann scheiße das funktioniert nicht Ok Was temp sms.net kann man das aufmachen? Temp sms.net ok ich hoffe das gibt es jetzt keine Pornwerbung drauf oder so German Chinese Nummer Wo sind die German Numbers Leute? Wo sind die German Temporary Numbers Germany? Ok Alles klar Bäm das brauchen wir jetzt Das ist wahrscheinlich schon belegt send Ok So und jetzt ist die Frage Was machen die denn da rufen die da jetzt an oder schicken die da Als ob da jemand sein Amazon Account ja doch da hat jemand sein Amazon Account drauf registriert Sag mal die machen online Banking da drüber Die machen ernsthaft online Banking da drüber Die Leute Scheiße ok das funktioniert glaube ich nicht Appeal oh nee Wie kriege ich mich da registriert Reobtain Nee das funktioniert nicht Ok das tut nicht Temp SMS wo hat Temp SMS haben die irgendwie Germany Das Problem ist wahrscheinlich hat sich schon längst jemand mit dieser Nummer bei Aliexpress registriert Handy Nummer ich gebe doch da jetzt keine gültige Handy Nummer ein Receive SMS Punkt kommen ok easy machen wir jetzt Noch hier zu outen ok perfekt Whatsapp Alter was da alles für Zeug drin liegt Jalla online Casino Von Susi196601 alles klar Auch Chinesen macht hinne ey China Chinesen Mensch Ich nehme keine Nummern von euch hallo Nein entweder das geht hier mit oder es Mensch warum geht das nicht V-SIM-Card Die haben es erkannt dass ich Fake Accounts machen will Ok wir probieren jetzt noch was aus Ok hier tut es nichts ok dann probieren wir den jetzt noch aus Fake Nummer ok next Aliexpress Zack So wenn das jetzt nicht geht haben wir gelitten Aber auf alle Captain Peng Dankeschön für die Zaps Jaja Ich glaube Tank-Code Was Ich glaube die haben mich geblockt Oh nee keine Ads please Ich bin geblockt ok Ok kein Aliexpress Account Leute Kein Chinesen Account Enterprise Account Lul Fuck Ok keine Chance Keine Chance keine China Chinesen Das ist was anderes oder Das ist das ist doch was anderes V123456 ok Leute keine Chance Vorbei Grip Aliexpress Alter Wie im Moment Warum geht denn das jetzt auf einmal Wait a minute Warum geht denn das jetzt doch Muss ich das gar nicht machen When she baited G-Trial Elastic Compute Service Ok try now Ah she baited Ok geht doch nicht Wie würde ich denn hier jetzt überhaupt was anlegen in der China Cloud Server Load Balancer Cloud Monitor Elastic Compute Service Wie würde ich hier mal eine billige VM anlegen in der China Chinesen Cloud Sag mal der geht mir gerade echt auf den Kekse Dark Reader Instances Images VPC? Nee Disks Create Disk Ja ja ich und ich Ah Mist Ok die checken das echt Ok Leute keine Chance Keine Chance man kann Main Business Wie Vielleicht kann man das irgendwie austricksen Frankfurt am Main Teil 1 Ah Mist 60329 Fax Plus 49 Warum kann ich das nicht safen Ah Business Name Ah das ging jetzt oder was Ich bin voll überfordert Private Virtual Cloud Wie macht man bei den Chinesen Irgendeinen Server Das ist ja noch unübersichtlicher als AWS Ok Cloud Shell Cloud Shell ist gut Cloud Shell Storage Space Create Ah schau mir da Moment darf ich jetzt neu Darf ich jetzt neu Darf ich jetzt neu Handy nochmal gibbeten Ok die haben mich geploggt keine Chance Oh nee ich hab Angst bei was da für ein Ad kommt Ok Leute nope keine Chance Keine China Chinesen Cloud Private Window Keine Chance Bam China geht nicht So und was wir jetzt noch machen ist One more Moment Moment Wo löscht man den Kram jetzt nochmal Preferences History Clear Äh letzte Stunde Bam Ganzer China Kram wieder weg Ok aber ich würde sagen wir kennen uns jetzt damit schon mal relativ gut aus Also können wir sagen Alibaba Cloud auf jeden Fall schon mal eins ja Also für irgendwas muss ich das jetzt ja gelohnt haben Ich hab jetzt zumindest schon mal die Cloud Konsole gesehen von Alibaba So ok wo sind wir stehen geblieben Wo sind wir denn davor stehen geblieben Der Forbes Kram sind wir stehen geblieben Wieso Hetzner weil ich mich damit ganz gut auskenne Das da Das bin ich Woher willst du wissen dass ich in Wirklichkeit Max heiß Also gar nicht wieder drauf kommt Datenbanken na Datenbanken muss ich ehrlich gesagt nichts machen da hört es bei mir direkt auf nach Abinstall Postgres Mehr ASP.NET Core ach stimmt das müssen wir natürlich reinschreiben ja genau Da bin ich nicht schlecht drinne So ok Programmiersprachen haben wir alles würde ich sagen So Defob Stels Ansible Jenkins und so was Terraform kenne ich mich auch ein bisschen mit aus Ja gut GitLab ja Das ärgert mich jetzt dass ich die China Cloud nicht nicht angelegt bekommen habe Ja das juckt aber kein ehrlich gesagt Kommen wir machen jetzt einfach noch hier Ede Editor kann ich ein bisschen mit Wim skills Wim skills flexen Jetbrains Zeug kenne ich mich auch gut aus VS Code kenne ich mich auch gut aus Ja was soll ich da sonst reinschreiben Ach so ja Soft Skills da müssen wir natürlich noch so Sachen wie Jyra und Confluence und so im Gedönsranche Wobei das ja eigentlich keine Soft Skills sind das sind ja Tools oder so Wie macht man die Preview du sagst dir einfach Open Markdown Open Preview Markdown to the side und dann hast du es hier So was gibt es jetzt mal ernsthaft was ist denn noch interessant also was muss man da noch reinschreiben Es gibt so viele Sachen wo ich mir noch nie Gedanken zu gemacht habe und wahrscheinlich ich auch schon gemacht habe aber mir nie drüber nachgedacht habe Exis Soft Skills ich hasse Menschen Keck Wait Achja Netzwerk Netzwerk ist vielleicht nicht schlecht Wobei ich Netzwerk ich hab mal ein CCNA gemacht 0w 2007 Ich glaube nicht dass es irgendwas noch irgendwie raus reißt CCNA von 2007 ist glaube ich Who Cares Nee ich glaube ich gar nicht von 2007 ist sogar glaube ich von 2008 oder 9 oder so Das habe ich schon hingeschrieben bei Linux bei Linux Skills Gibst du das deinem Chef 1 zu 1 nein Quatsch Wobei warum eigentlich nicht Kommunikation tja kommt drauf an ob ich die Leute mag oder nicht Lohnt sich CCNA eigentlich schwer zu sagen also für mich hat es sich bis jetzt nicht gelohnt Ja was kann ich denn im Netzwerk bereich ich kann Open Sense PF Sense ein bisschen Wobei es gar nicht Open Sense heißt sondern Open Open Open Sense heißt ja Warum auch immer man das nicht Open Sense sondern Open Open Sense genannt hat Mikrotik Unify Ohbei Die kann ich immer nicht schreiben das ist zwar jetzt kein Business Zeug aber es schadet sicherlich auch nichts wenn man das mal reinschreibt Kann ich sonst noch irgendwie Netzwerk mäßig großartig was Doch kann ich Fritzbox Ich glaube das ist ganz furchtbar entscheidend dass ich in Fritzbox reinschreibe Du hast nicht mitbekommen warum ich das mache weil Moment wo war dann hier die Frage Weil ich mal irgendwann vor über einem Jahr meinem Chef gesagt habe ich würde gern ein bisschen mehr Sachen programmieren auf der Arbeit Ich habe jetzt ein Jahr lang ignoriert und ich habe mir gedacht ich mache das jetzt einfach mal Leute mir gehen langsam die IOT brauchen wir noch IOT IOT Moment IOT ist so bescheuert brauche ich auf der Arbeit nie im Leben Aber was soll ich da was soll ich da reinschreiben Ich habe ein bisschen Ahnung von Embedded Kram Wobei der Patrick ist doch noch da oder Patrick bist du noch da geht mein ESP32 und ESP266 Zeug was ich da mache als Embedded durch Oder sagt da sagt da jeder Distribute Cluster ja das stimmt stimmt stimmt ja ja ja hast du recht Also ich erkenne mich mit HA aus Cluster Kram Schreibt mir jetzt einfach mal was auf ich weiß nicht wie ich es nenne IBM Mainframe Liner habe ich keine Ahnung von Was machst du denn auf der Arbeit ich mache das hier guck mal Ich habe da sogar ein extra Video zu gemacht Ich habe schon fast alle schon mal ein Video gemacht Social Media Skills Twitter Flamer Twitch Twitch Emote Expert Ich weiß gar nicht wo ich den ganzen Kram hier noch dazu reinschreiben soll Borderlands ist schon wieder so alt ja Boah Leute mein Brain macht nicht mehr mit Ich kann mir mal nachdenken gerade MonkaS Da gibt es nur noch 100.000 Sachen und Gott und die Welt was ich da reinschreiben kann Ich bestelle mir jetzt erstmal bei Amazon schnell noch was Und zwar noch 16x16 LED Matrix fällt mir gerade so ein brauche ich Virtualisierung habe ich schon aber da kenne ich mich nicht wirklich gut mit aus Oh ich kann ein paar VMs aufsetzen aber von ESX Administration habe ich keine Ahnung Wie warum ist denn das so teuer geworden Warum ist das so teuer geworden ich habe da 15 Euro für bezahlt Keckweight Inflation Kick auch bei LED Stellhand beim China Chinesen ja das mache ich jetzt auch AliExpress 16x16 LED Weil ich will noch ich will noch zwei Lampen davon drucken Guck ich habe mir doch von ich habe mir doch hier so eine Lampe 3D gedruckt und die ist wirklich nice also das ist das erste mal wo ich es wirklich gesagt habe da ist was brauchbares cooles bei rausgekommen beim 3D drucken Hier die da mit WLED die Lampe ist wirklich nice geworden Da wollte ich mir noch zwei drei von machen LED Lampen kann man nie genug haben Und dazu brauche ich halt so ein 16x16 LED Matrix Die ist halt echt nice geworden guck so sah sie auf dem 3D Drucker aus Mein Druckbett hat auch schon bessere Zeiten gesehen Leute ich habe letztens den meinen mega geilen 3D Drucker gesehen auf YouTube Das ist 3D Drucker CNC Fräse und Laser Gravur Gerät in einem Ich will euch hier nochmal kurz zeigen Kaufe ich mir nicht Weil das Ding kann Laser Gravieren 3D Drucken und CNC Fräsen Richtig richtig abgedrehtes Teil kostet aber kostet aber 2000 Euro oder so Nee nee geht glaube ich ab 1200 Euro los geht ab 1200 Euro los und Aber für die Größe bezahlst du dann 2000 Euro Das ist gar nicht mal so teuer ne Das ist gar nicht mal so teuer aber es ist halt insgesamt 250 Euro 3D Drucker relativ teuer Das macht auch einen hochwertigen Eindruck mit dem Ding zum bedienen Du hast den Laser der kann auch automatisch kalibrieren und alles Guck hier Gravurstelz das ist das Video Ihr Gravurstelz kannst du machen Du kannst natürlich 3D Drucken das ist klar Die übliche 3D Druckgeschichte Dann kannst du hier Gravurstelz machen Und dann kann das Ding auch CNC Fräsen Ich mein man braucht es nicht aber es ist schon irgendwie ein geiles Gerät Oder müsst ihr zugeben Ist schon wirklich nice Nee nee nicht Laser ohne Gehäuse Du kriegst ein Gehäuse drum herum Du kriegst ein Gehäuse mit was auch für Laser schützt und so Der hat es nur für die Aufnahmen weggelassen Das ist richtig cool Aber brauche ich nicht Ich fand es nur geil Ich fand es nur geil So was kostet es bei den China Chinesen Guck bei den China Chinesen kostet es das gleiche Panel Einfach mal nur 10 Euro anstatt 25 in Deutschland Das ist genau das gleiche Panel Ach das ist 8 mal 8 ich brauch 16 mal 16 Nächste Woche Video dazu Nein WTF ich kauf mir das nicht Es ist nur geil Aber ich geb doch im Leben Ich geb doch im Leben da 2000 Euro für ein Gerät was ich nie verwende Wobei So unwahrscheinlich ist es nicht Aber nein mach ich es nicht In dem Fall mach ich es nicht Nein nein nein mach ich es nicht Ja hätten mal die die von diesem Videoschnittprogramm die bei mir Werbung machen wollten mein Angebot akzeptiert Dann hätte ich jetzt ein bisschen mehr Geld gehabt und hätte mir das kaufen können Und ich könnte mir das auch so kaufen aber ich sehe es nicht ein ich muss mich ein bisschen zurückhalten Ich gebe ja eh schon nicht viel Geld aus Aber ich habe manchmal den Hang dazu so Spielkrams zu kaufen von dem ich genau weiß ich brauche ihn eigentlich nicht Irgendwas in Richtung Middleware Integration Message Mappings Du meinst irgendwelche Message Que Geschichten so von Rabbit MQ bis sonst was von Spring habe ich keine Ahnung Ja Byte Strike genau Woher weißt du das Die machen gerade überall Werbung Die haben ich gefragt und ich habe gesagt Ja können wir machen Placement 800 Euro haben die gemeint 800 Euro ist uns zu viel Wobei ich das voll und ganz angemessen finde ehrlich gesagt Für das was die wollten Und ich habe mir jetzt überlegt ob ich jetzt nicht einfach noch mal noch mal sagen soll ja ok Machen wir 500 Euro und es gibt noch einen Twitter Post dabei oder so Aber drunter mache ich das nicht Die wollten links also also Donald links und sonst was und die wollten 60 plus als 60 Sekunden Plus Placement mitten in einem Video haben Und das mache ich nicht für ein Apfel und ein Ei 60 Sekunden Video Placement das kannst du nicht überspringen das ist reingerendert das nimmt das ganze total aus dem Video Fluss raus die Leute haben kein Bock schalten ab also das muss schon ordentlich bezahlt werden dass ich das mache Da ist 800 Euro aber schon frech was für 60 Sekunden Werbung ist da Weißt du was du woanders bezahlst für 60 Sekunden Werbung Du mal ich ja auch noch 60 Sekunden Werbung also die Werbung soll ich ja auch noch machen also sprich ich soll War das MonkaS alter Ah paar Schrauben waren das die Schrauben Päckchen die runtergefallen sind Lull Ach du meinst vielleicht billig ja ja Ja die Werbung soll ich ja auch noch machen also sprich ich krieg dann vielleicht einen Clip oder so von denen und soll dann da 60 Sekunden auch noch drüber labern aber ich habe gleich schon gesagt also irgendwie persönliche Empfehlungen kann ich nicht geben weil ich benutze das ja nicht ja ach nee ach nee nee nee also für 500 Euro würde ich dann vielleicht gerade so aber auch nicht komplett was sie sich vorgestellt haben machen aber sonst würde ich nicht bringt ja nix bringt ja nix wenn man das alles umsonst macht Was willst du für eine Minute Bitbattle Gameplay gar nix Raid Shadow Legends Gameplay ja da krieg ich das doppelte für allerdings das Problem bei Raid Shadow Legends Gameplay ist oder bei bei Raid Shadow Legends ist das haben die ja auch schon gleich am Anfang geschrieben du musst halt so tun als findest du's geil also alle anderen sind damit zufrieden wenn man sagt was weiß ich das ist hier Produkt XY das ist das das ist das beste für das und das zu machen und so das ist okay aber Raid Shadow Legends will dass du quasi sagst ich spiele dieses Spiel schon ein halbes Jahr und das hat mich selten ein RPG so begeistert ladet euch jetzt Raid Shadow Legends runter die die legen da die legen da wirklich wirklich wer drauf und ne mach ich nicht mach ich nicht vergiss es echt ist das Pains Champ hab ich noch nie verwendet ich hab's auch nicht vor zu verwenden um ehrlich ehrlich zu sein Cloud oder Hardware Shop Corporation mach mal ausrufe Zeichen Hetzner ich bin grad dabei ich hab mir denen schon ein Testvideo gemacht bei Hetzner und ich bin gerade dabei denen ein Vorschlag zu schicken für so komplettes monatliches so ein Paket mit monatliche mit monatlicher Zahlung ja da werde ich dann so Sachen rein machen wie Stream Overlay und dass es commands gibt im Chat man könnte beispielsweise auch Discord messages rein machen Videobeschreibung alle möglichen Sachen ich bin da grad dabei sowas zusammenzuschreiben wo ich ich werde es wahrscheinlich so machen ich schlag den drei Sachen vor mit drei drei unterschiedlichen unterschiedlichen Preisen ja keine Ahnung 500 Euro 1000 Euro 1500 ich weiß es noch nicht keine Ahnung und dann ist dann halt je nachdem wie umfangreich die Sache ist können sie sich dann raussuchen was sie haben wollen was ich nie wieder machen werde ist so ne so ne G2A Geschichte mit festen Videoanzahlen im Monat das mach ich nie wieder das fand ich kacke aber G2A war auch merkwürdig denen waren Aufrufe egal die wollten nur viele Videos haben also die waren ganz merkwürdig so im nachhinein betrachtet die waren ganz die waren ganz merkwürdig ne ich hab ja auch versucht zu erklären so nach dem Motto hey wenn ich weniger Videos mache das ist sogar besser weil unterm Strich eure Videos sogar noch mehr geguckt werden ich hatte die ja nicht in jedem Video drinne aber ich hab gesagt guck mal diese Videos wo ihr drinne seid also bei G2A die gucken dann sogar mehr wenn ich Videos mache sonst war der egal die wollten Videos haben in massen die waren die waren komisch IprepperRS ach ne IpepperRS nicht wird nicht gepreppt Dankeschön für den Sub Abofaller hat auch Subscribed Dankeschön vor 26 Minuten Prime Sub der Captain Peng auch schon sieben Monate huge Subscriptions Leute Dankeschön für die ganzen Subs Klopapierprepper ich wurde total geflamed dafür dass ich Klopapier damals könnt ihr euch noch dran erinnern als ich mal auf Twitter gepostet hab ich hab mir ne Palette war ja nicht wirklich ne komplette Palette aber ich sag jetzt einfach mal in der Richtung ich hab mir ne Palette Klopapier bestellt wie sie sich aufgeregt haben auf Twitter alle wieder Max du bist Teil des Problems und deswegen wegen dir kann ich mir mein Bob es nicht abputzen und sowas meine Güte haben dich aufgeregt Alter dabei hab ich das ja nicht irgendwie beim Rewe bestellt sondern in nem Großhandel und die hatten jederzeit genug und die haben explizit gesagt sie beliefern wenn es Engpässe gibt auch zuerst Krankenhäuser und alles das heißt was ich bekommen hab an Klopapier damals war vollkommen quasi ohne Einfluss auf die anderen Leute außer dass ich genug Klopapier hatte und die anderen die sich permanent eingeredet haben dass sie irgendwie moralisch überlegen sind weil sie sich jetzt den Bobes mit einem Stück zweimal abputzen nicht aber tja so sind sie halt die Twitter Flamer ja Video Einblendung mit FFmpeg da viel mehr sollte man damit aber auch nicht machen also das geht man kann ja Offerlays machen mit FFmpeg aber schön ist was anderes Leute ich bin zu Lowbrain ich krieg ich krieg gerade nicht mehr nicht mehr Skillers zusammen irgendwie das ist zu mein Hirn setzt mein Hirn setzt aus grad vorbei Running Low on Cuties ja so siehts aus wo sind sie denn alle hin wo ist wo ist der Chat investierst du eigentlich an der Börse nein ich mach aktuell in der Richtung gar nichts aber ich sollte das unbedingt machen weil ich hab achso ja ich kann euch ja noch was erzählen aber vorher beantworten ich das ne mach ich nicht ich hab heute war ich aber wieder geschockt als ich auf mein Konto geguckt hab ich hab Geld vom Automat abgeholt da liegt viel zu viel Geld rum und auf dem Business Konto liegt auch viel zu viel Geld rum ich muss unbedingt den Kram irgendwie investieren und sei es nur in langfristig einfach was nehmen für zum Beispiel genau irgendwas wie ETFs oder so aber das Problem ist ich hab von sowas keine Ahnung ich beschäftige mich auch einfach nur ungern damit auch ich weiß dass das blöd ist aber ich muss das unbedingt machen weil ansonsten ist es nur noch die Hälfte wert frag her Endpunkt ich glaub da hat davon auch nicht so viel Ahnung Bitcoin ist aktuell gut zu investieren es ist runter gibt es überhaupt noch Sparbücher ja gut geben tut es das noch das macht dann die Oma von der Oma so das ist ja auch schon vorbei wie jetzt soll ich MrBeast Style machen der nächste der meinen Tweet retweetet ich verlose unter allen die retweeten 100.000 Euro ne 10.000 Dollar macht er ja immer MrBeast Style ja ja ganz bestimmt ich mein damit kann man sie übelst krass natürlich Follower Sachen auch holen wer diesen Tweet retweetet und Follower unter allen die retweet und Follower verlose ich 5000 Euro und dann ist natürlich die Frage überprüft überhaupt irgendjemand ob er das macht gut der hat genug Geld der wird es wahrscheinlich machen aber es gibt bestimmt genug Leute die faken sowas war nicht war nicht mal hat gab es da nicht mal bei Simon Desue so ein Miniskandal damals der auch gesagt hat hier ihr bekommt Geld und dann hat er das nie bezahlt und hat die Leute gescampt aber gut bei Simon Desue wundert mich ja nichts mehr und ApoRed okay das weiß ich nicht mehr bei ApoRed weiß ich nur noch dass der mal einen Bombenprank kennt ihr noch den Bombenprank von ApoRed das war so blöd da hätte man sich doch auch da wäre man doch auch auf die Idee gekommen im Vorfeld schon dass es vielleicht nicht so sinnvoll ist das zu machen alter es ist so ah so Paynes Champ keine zwei Meter gerade ausgedacht den habe ich abonniert auf YouTube ich mach garantiert nicht all in Bitcoin also den habe ich abonniert auf YouTube den Kerl ja der ist irgendwie auch weg von der Bildfläche gut ich glaube die die die Stelzen jetzt in Dubai rum bisschen was an Open Source Projekte spenden ich ich spende ich spende ab und zu für irgendwelche Tierschutzgeschichten was all in Essen ja das mache ich ja eh schon ist trotzdem noch was übrig Leute was machen wenn jetzt wir haben noch eine halbe Stunde Zeit also für für Skill Stels ist mein mein Hirn ist gerade zu zu low brain ich dafür da kann ich mir nicht mehr ausdruck aussuchen Depot eröffnen im Stream näh YouTube Reacts ne hab ich jetzt auch kein Bock drauf Vingate hat jetzt uninstall upgrade und list das funktioniert doch aber im Leben nicht richtig das glaube ich dir nicht dass es funktioniert ich moment wohl mein Moment Video von Geek Freaks waren das die nicht mit dem Windows Tuning Pack Moment Tag das muss ich mir angucken Ach das ist nicht mein Friseur das ist mein Zahnarzt meinst du ja genau der spricht wie mein Zahnarzt an installen install ab ok experimental das muss man sich mal auf der Zunge zergehen lassen Microsoft hat einen Package Manager gemacht wo es experimental ist eine App zu aninstallen was haben alle mit den Hot Tube Streams es ist ja schon ein bisschen weniger geworden die üblichen Verdächtigen gibt es immer noch aber so der Riesen der Riesen Aufreger und Riesen Hype ist ja eigentlich auch schon wieder weg Paints Champ auf MSI ok immerhin dann wird das vielleicht jetzt mal ernst zu nehmen der Package Manager demnächst Booba TV gibt's schon ja das kenne ich das mache ich jetzt aber nicht auf Progress Paradev da musst du glaube ich Serious Max ihr danken im Chat weil ich glaube der hat es vorhin gepostet da bin ich auch nicht selbst drauf gekommen ich gucke noch mal schnell was was sind so die aktuellen GitHub Trends das schaue ich mir jetzt noch mal schnell an da ist wahrscheinlich nichts großartiges spannendes dabei Doc was Doc to Shotgun Monka ist was ah das ist ein Crawler das ist ein Bot das ist ein Bot der einem einen Termin fürs Impfen crapped das ist eigentlich eine coole Idee das ist doch mal was was ordentliches kippt sich auch für die deutsche ja ich weiß ich weiß ja Patrick ich weiß ich habe es gelesen im Chat im Discord und das wird das wird Paints Champ ich ich verstehe nicht warum Microsoft es nicht auf die Reihe klingt ordentliches UI Framework zu machen China Chinesen Kram versteht man wieder nichts Deutsch Haus der hat ein Video hochgeladen dass er keinen Bock mehr drauf hat habe ich heute morgen gesehen okay es gibt mal wieder absolut nichts spannendes was trendet nice hat sich gelohnt wieso kein chinesen von weil ich selten chinesische zeichen braucht die leute vermiesen ihm das echt was haben sie gemacht stack overflow hat die fall von geändert sehr kunde sehr kunde moment moment stack overflow wir suchen jetzt eine 10 plus plus frage auf stack overflow wir müssen ja neue sachen auch gleich mit der hässlichsten sprache was das gar nicht mal so schlecht muss ich sagen gar nicht mal so schlecht das ist das ist besser als der alte font was ist das was ist das für ein font wie nennt man das okay die verwenden einfach kaskas kardia monos die haben einfach nur die reinfolge geändert was von den lokalen schriftarten verwendet wird oder oder ist das wirklich aber ich muss sagen das sieht besser aus als vorher kannst du mal erklären was das alles in der obersten leiste bedeutet als die windows leiste das hier das ist desktop 1 dass ich desktop 2 das ist desktop 3 das ist freier plattenplatz freier ram freier swap gibt es nicht weil ich habe kein swap freier swap cpu auslastung cpu load lokale ip und wie viel grad up und down geht übers netzwerk und dann die das aktuelle datum und netzwerkverbindung ist nicht das ist jetzt kaskadia code wir haben passt ja gut dazu dass wir gestern neue schriftarten ausprobiert haben ip league monka es aber ich muss sagen es gefällt mir besser die was hatten die davor courier oder sowas stack overflow das sah so oldschool aus auf stack overflow die schrift mit welchem programm kann man gut die temperatur seiner pc hardware überwachen vor frag mich nicht unter windows keine ahnung ich glaube das ist die neue microsoft schriftart hier die leute hätten richtig selbst das probieren wir jetzt mal ich finde es eigentlich ganz gut font lesen wir doch mal wie dazu gibt es keine oder gibt es bestimmt ein hacker news jetzt bestimmt hacker news eintrag für und und und und reddit und reddit reddit stack overflow gibt es bestimmt auch was für is it just me or stack overflow incredible toxic ja stack overflow sind sehr viele merkwürdige leute font font die da wird noch nicht drauf rum geflammt war warum nicht stack warum warum wird es auch noch nicht drauf rum geflammt die fall font hier we are switching we are switching fonts das schon das schon ein bisschen okay das ist schon das ist schon ein bisschen her wo sie das angekündigt haben so da wird da wird garantiert drauf rum geflammt pull requests würgen wir schon mal nicht okay was auch immer ach leute wisst ihr warum es kann das sein dass sie den default font gar nicht geändert haben ich habe einfach nur total viele fonts installiert ich guck mal leute die haben den default font doch moment moment moment leute ich habe doch gestern ganz viele ganz viele font installiert wahrscheinlich ist es deswegen einfach wenn ich den kram wieder habe ich gestern den snapshot restored wobei kann ich einfach ausprobieren was habe ich gestern als letzten font installiert ne ist noch alles drauf ah ne okay ich weiß gar nicht was ich alles installiert habe gestern okay ich muss mal ich muss ich muss ah ne ich kann nicht rückgängig machen fack da ist ja meine liste weg wenn ich jetzt rückgängig mache keg weight ja okay was was habe ich da alles installiert man konnte noch mit pack packman list by install date das geht doch irgendwie wow what the install ich will einfach wissen listen by install date you can't what the fack font install wunderbar das beste ist einfach sachen copy pasten wieder ich dachte das geht echt nicht na gut aber was ich machen kann ist so das ist alles installiert es crept nach minus i ttf nach mein installierten fonts genau so also das da kann man installieren das da kann man deinstallieren wie mochi braumann robot und mono kommen installieren meslo kommen deinstallieren jet brands mono kommen deinstallieren kommen installieren kommen auch deinstallieren vierer kaut kommen auch Okay, das ist der ganze Kempel von gestern So und dann, kann man auch deinstallieren, das muss man glaube ich drauf lassen Wobei, wartet mal, haben wir noch hier, minus minus recursive, dass er alles mit wegschmeißt So und jetzt, ich mach mal ein Reboot, ich weiß, braucht man nicht, es reicht Browser neu starten und jetzt gucken wir mal wie jetzt Deckoverflow aussieht, der braucht übrigens login manageraft total overrated einfach direkt x starten So, da sind wieder die five head birds am start Das ist doch der standard font von immer Das ist das anders als sonst, wie sieht das unter windows aus Tatsächlich, ah die haben die haben die reinfolge der fonts geändert Die haben einfach die reinfolge der fonts geändert die vom system verwendet also die reinfolge der auf dem system verfügbaren fonts haben die geändert Ja, das ist ok ich finde es aber nice weil standardmäßig hatten die unter windows glaube ich sonst Currier new oder sowas in der richtung Bin ich in ordnung passt Können sie ruhig so lassen, das wäre auch so lieber als das standard font den sie da vorher drin hatten So leute Ich mache mich jetzt schon vom agger ich habe bin zu low brain da heute mit der liste weiterzumachen aber wir haben ja schon einiges eingetragen Ich werde das wahrscheinlich dann auf off stream fertig machen Ich schaue jetzt erstmal ab Spiel vielleicht noch runde battlefield oder so aber nicht on stream Morgen stream ich muss mal gucken ich wollte mich endlich darum kümmern dass ich mein 3d kicks bekomme der reden kann Muss ich mit muss ich mich ein bisschen mit pfeiffer auseinandersetzen Der rüppel dankeschön 16 monate hypersubscription hier Wann ist eigentlich der nächste feiertag Säck Säck Und 24 ja montag bringt mir nix mont ist ja scheiße warum muss das montag sein Warum muss das montag sein was soll das können die finks montag nicht dienstag machen Ein montag sagt Montag ist der schlechteste feiertag überhaupt Gibt es nicht einfach eine tabelle hier So Dann haben wir als nächstes das hatten wir schon das haben wir frohen leichnam kommt dann dritter sechster Was ist eine dritte sechste ist ich hoffe dass es dann auch montag geht wenn das jetzt wieder montag ist kriege ich anfälle leute Donnerstag sehr gut exzellent es heißt nächste woche brauche ich freitag wieder urlaub Direkt urlaubsantrag urlaub antrag ist raus direkt montag mache ich dienstag mache ich den Hast du schon gemacht Was für ein appstarter verwendest du Was für ein appstarter verwendest du äh was unter windows das startmenü Ach unter linux in der file rofi roffi roffi Welches themen boah keine ahnung Keine ich habe schon ausgemacht weiß ich nicht komm das nächste mal gucken leute gucken wir das nächste mal Ich spiele es noch eine runde plans versus zombie 1 endless oder irgendwas Wir sehen uns macht es gut bis morgen Bis morgen zu", "segments": [{"id": 1, "start": 0.0, "end": 2.0, "text": "Das war's für heute."}, {"id": 2, "start": 2.0, "end": 4.0, "text": "Bis zum nächsten Mal."}, {"id": 3, "start": 4.0, "end": 31.0, "text": "Das war's für heute."}, {"id": 4, "start": 31.0, "end": 33.0, "text": "Das war's für heute."}, {"id": 5, "start": 33.0, "end": 61.0, "text": "Das war's für heute."}, {"id": 6, "start": 61.0, "end": 63.0, "text": "Das war's für heute."}, {"id": 7, "start": 92.0, "end": 94.0, "text": "Das war's für heute."}, {"id": 8, "start": 94.0, "end": 96.0, "text": "Das war's für heute."}, {"id": 9, "start": 96.0, "end": 98.0, "text": "Das war's für heute."}, {"id": 10, "start": 98.0, "end": 106.4, "text": "Poggers! Huge Pog! Massive Pog!"}, {"id": 11, "start": 128.0, "end": 137.0, "text": "So Leute, ich bin am Start. Falls ihr eben schon was im Stream gehört habt, dann weiß ich das nicht."}, {"id": 12, "start": 137.0, "end": 142.0, "text": "Der Kommentator ist am Start. 17 Monate Hyper Subscription hier."}, {"id": 13, "start": 142.0, "end": 165.0, "text": "Massive Subs."}, {"id": 14, "start": 165.0, "end": 177.0, "text": "So, die richtige E-Mode Größe ist entscheidend. So, perfekt. Exquisite."}, {"id": 15, "start": 177.0, "end": 184.0, "text": "So, also, mal gucken, ob das alles funktioniert."}, {"id": 16, "start": 184.0, "end": 199.0, "text": "Ja, Funst. Von der Benachrichtigung hier. He lacks critical information. Stream ist gar nicht live."}, {"id": 17, "start": 199.0, "end": 217.0, "text": "Jebaited. Aufzeichnung."}, {"id": 18, "start": 217.0, "end": 234.0, "text": "So, also, okay. Ich verrate euch mal kurz, was wir heute machen. Und zwar, ich hatte heute Rücksprache mit meinem Chef. Und mir ist aufgefallen, dass ich vor, das haben wir heute übrigens zum Glück nicht besprochen, dass ich ihm vor einem Jahr oder so erzählt habe."}, {"id": 19, "start": 234.0, "end": 246.0, "text": "Warte mal. Ich mach mal, also das hab ich ja, aber wir machen heute exquisite, classic Soundtrack."}, {"id": 20, "start": 246.0, "end": 272.0, "text": "Ah, yes. Für mehr Gehirnzellenstimulation. Ah, yes. Weil das ist mir eigentlich auf Dauer vielleicht auch ein bisschen zu anstrengend. Ich weiß nicht."}, {"id": 21, "start": 272.0, "end": 285.0, "text": "Wie konntest du den Soundtrack wechseln? Das ist schon fünfmal durchgelaufen in der Zwischenzeit. Also, und zwar, ich hab vor einer Weile mal vorgeschlagen, ich könnte mal so eine Skills Übersicht erstellen."}, {"id": 22, "start": 285.0, "end": 295.0, "text": "Wo ich mal so reinschreibe, wo ich exquisite Big Brain Skills hab. Ich hab gedacht, das können wir einfach im Stream machen."}, {"id": 23, "start": 295.0, "end": 311.0, "text": "Das heißt, ich muss jetzt mal in mich gehen und mir überlegen, okay, was könnte man da alles hinschreiben? Cobol zum Beispiel. Cobol, äh, sehr gut."}, {"id": 24, "start": 311.0, "end": 325.0, "text": "Grills klären, Social Media Expert. Nee, realistische Sachen reinschreiben. Ähm, und mir ist was wirklich ZG aufgefallen, Leute. Richtig ZG."}, {"id": 25, "start": 325.0, "end": 341.0, "text": "Mess, also richtig, so hier. ZG ist mir gerade was aufgefallen. Und zwar sag ich dir was zu. Und zwar wisst ihr, was mir extrem ZG aufgefallen ist? Und zwar, dass es ein Plants vs. Zombies 3 gab."}, {"id": 26, "start": 341.0, "end": 351.0, "text": "Schon vor über, glaub ich, im dreiviertel Jahr released. Ich hab nichts von mitbekommen. Und das Game sieht dermaßen beschissen aus, dass ich mich frage, was hat EA da wieder gemacht?"}, {"id": 27, "start": 351.0, "end": 367.0, "text": "Ihr wisst, dass ich riesen huge Fan bin von Plants vs. Zombies 1. Und jetzt guckt euch mal die Screenshots davon an."}, {"id": 28, "start": 367.0, "end": 380.0, "text": "Was ist mit denen los? Alter, was ist das? Wollt ihr mich verarschen? Ich mein, es hat sich zurückentwickelt. Es hat sich zurückentwickelt."}, {"id": 29, "start": 380.0, "end": 396.0, "text": "So, das ist Plants vs. Zombies 1 gewesen. Ich mein, jetzt mal ernsthaft. Was zum?"}, {"id": 30, "start": 396.0, "end": 417.0, "text": "Das ist Plants vs. Zombies auf Wish bestellt. Was ist denn mit dir? Das kann doch nicht in der Ernst sein. Echt, das ist ein..."}, {"id": 31, "start": 417.0, "end": 431.0, "text": "Das kann doch nicht in der Ernst sein. Guckt euch den Schrott mal an. Das ist der erste Teil. Wunderbar. Pixel-Grafik. Alles top. Super Game. Was ist denn das?"}, {"id": 32, "start": 431.0, "end": 438.0, "text": "Das ist... Ich weiß gar nicht, was ich dazu sagen soll. Vor allem, warum haben die Nüsse überhaupt einen Lebensbalken?"}, {"id": 33, "start": 438.0, "end": 447.0, "text": "Vorher hat man da erkannt, anhand wie die Grafik aussah, ob das gut oder schlecht war. So, und es wird noch schlimmer. Es wird noch schlimmer."}, {"id": 34, "start": 447.0, "end": 453.0, "text": "Das hört noch gar nicht auf. Das hört noch gar nicht auf. Nicht nur, dass das Gameplay übelst ranzig aussieht."}, {"id": 35, "start": 453.0, "end": 461.0, "text": "Sie haben auch noch so dämliche Level-Mechaniken eingebaut. Level deine Pflanzen auf und es wird noch schlimmer."}, {"id": 36, "start": 461.0, "end": 476.0, "text": "Es wird noch... Moment, Moment. Es wird noch schlimmer. Du kannst jetzt eine eigene... Guckt euch das mal an. Was ist das für ein... Was machen die mit dem Game, Alter? Was soll das?"}, {"id": 37, "start": 476.0, "end": 483.0, "text": "So, und es wird noch schlimmer. Es wird noch schlimmer. Ich weiß nicht, ob man das irgendwo sieht."}, {"id": 38, "start": 483.0, "end": 501.0, "text": "What the fuck? Die haben auch noch Farmville oder sowas mit eingebaut. Man kann jetzt... Man kann jetzt die Stadt aufbauen mit Microtransactions."}, {"id": 39, "start": 501.0, "end": 520.0, "text": "Level your house, Microtransactions für Stadt ausbauen. Please. EA, wirst du dir jedes gute Game irgendwie versauen?"}, {"id": 40, "start": 520.0, "end": 534.0, "text": "Was du sehen bist, Plants vs. Zombies 3, was schon vor einem Dreivierteljahr rausgekommen ist. Okay, das stimmt nicht. Es kam so eine Early Access Version raus und die Leute haben es geflamed as fuck."}, {"id": 41, "start": 534.0, "end": 542.0, "text": "Es kann doch nicht sein. Guckt euch das mal an. Das war so... Also ich will nicht sagen schön jetzt von Effekten oder so."}, {"id": 42, "start": 542.0, "end": 551.0, "text": "Ein schönes Game. Das war einfach handgemalte Pixel Grafik. Das ging. Das war wunderbar. Und was macht man draus? So eine hässliche Krütze mit irgendwelchen..."}, {"id": 43, "start": 551.0, "end": 562.0, "text": "Was sind das überhaupt für 3D Models? Haben sie da sich irgendwie von DeviantArt... Waren sie auf Fiverr? Waren sie auf Fiverr und haben sich was machen lassen oder wie?"}, {"id": 44, "start": 562.0, "end": 573.0, "text": "Meine Güte, ey. Ich krieg Anfälle. Wie kann man das so verkacken? Ich meine, der zweite Teil war schon deutlich schlechter als der erste Teil. Und warum war der zweite Teil schlechter?"}, {"id": 45, "start": 573.0, "end": 584.0, "text": "Weil sie sich gedacht haben, anstatt motivierendes Gameplay ist genug, die Sachen frei zu spielen, hat man sich gedacht, nein, wir fucken die Leute ab und machen es jetzt mit Microtransactions."}, {"id": 46, "start": 584.0, "end": 594.0, "text": "Natürlich sind das 3D Models. Guckst du dir mal an. Doch, doch. Ich würd schon sagen. Doch, doch, doch, doch."}, {"id": 47, "start": 594.0, "end": 601.0, "text": "Deswegen hast du ja auch die komischen... Deswegen sieht das auch so eckig aus."}, {"id": 48, "start": 601.0, "end": 618.0, "text": "Das ist so schrecklich, Alter. Ich meine, der zweite Teil... Ich hab ja nicht gespielt lange, weil Microtransactions, das ging ja noch irgendwie auf."}, {"id": 49, "start": 618.0, "end": 631.0, "text": "Wie kann man, ey, wie kann man das wieder so verkacken? Ich versteh's nicht. Ich versteh's nicht. So, und das Witzige ist... Update History."}, {"id": 50, "start": 631.0, "end": 642.0, "text": "Das Witzige ist, die haben das Game released in Rumänien oder so. Irgendwie Ungarn-Rumänien. Und zum Test, Early Access."}, {"id": 51, "start": 642.0, "end": 649.0, "text": "Und danach, hier, die haben das quasi 25. Februar, also vor einem Jahr, in Rumänien oder so released."}, {"id": 52, "start": 649.0, "end": 656.0, "text": "Und danach haben die Leute es so geflamed, dass die das Game wieder runtergenommen haben und jetzt kann man es nicht mehr spielen."}, {"id": 53, "start": 656.0, "end": 662.0, "text": "Also die haben so extrem verschissen. Ich weiß nicht, was da wieder los war."}, {"id": 54, "start": 662.0, "end": 668.0, "text": "Das ärgert mich. Sowas ärgert mich richtig, ja. Das war so eine geiles Game. Der zweite Teil ging auch noch."}, {"id": 55, "start": 668.0, "end": 676.0, "text": "Das erste Garden Warfare war auch noch irgendwo in Ordnung. Auch wenn ich verstanden hab, warum und weshalb und naja, gut."}, {"id": 56, "start": 676.0, "end": 689.0, "text": "Aber das ist wirklich komplett... Das ist, das ist, äh... Ja. Echt Pain's Champ. Nee, war's nicht. Zumachen."}, {"id": 57, "start": 689.0, "end": 698.0, "text": "Dazu kann ich einfach nur, wenn ich das hier sag, wenn ich das hier seh. Kann ich einfach nur noch sagen. Ganz klar."}, {"id": 58, "start": 698.0, "end": 713.0, "text": "Piss dich, Aldo. Piss dich, Aldo. So, das geht an die E."}, {"id": 59, "start": 713.0, "end": 717.96, "text": "Gut jetzt aber hier zu aber so eine kacke wie man das so versauen kann"}, {"id": 60, "start": 719.6, "end": 725.16, "text": "Was ist das shortcut umgeschlossene short tabs shift ctrl t"}, {"id": 61, "start": 726.56, "end": 728.56, "text": "Sieht schrecklich aus"}, {"id": 62, "start": 733.2, "end": 735.2, "text": "Exzellent"}, {"id": 63, "start": 735.28, "end": 739.52, "text": "Das ist tatsächlich ganz nice ja das habe ich mir auch auf steam geholt ist tatsächlich ganz cool"}, {"id": 64, "start": 739.52, "end": 744.16, "text": "Aber ich mag halt ist dass das das plans world zombie setting finde ich viel viel cooler"}, {"id": 65, "start": 744.48, "end": 748.72, "text": "So ich mache mal kurz meine vm an oder vm wie die coolen leute sagen"}, {"id": 66, "start": 753.24, "end": 759.08, "text": "Dann sollen sie meint wegen 16 bit grafiken aber gerade bei 16 bit grafiken sind wie findet ihr die schriftart ist sie nicht poggers"}, {"id": 67, "start": 759.08, "end": 768.88, "text": "Warum ist heute lügenpresse kann mir das irgendjemand erklären wer hat diesen komischen wer hat es dem nightbot beigebracht?"}, {"id": 68, "start": 774.88, "end": 779.32, "text": "Ja ja ich weiß ihr war es alle der chat wenn man den chat fragt wer es war dann war es immer jeder"}, {"id": 69, "start": 782.6, "end": 786.52, "text": "I made this das ist das dümmste meme auf twitch ich verstehe gar nicht warum sich das so"}, {"id": 70, "start": 786.52, "end": 792.92, "text": "Hat irgendjemand eine ahnung warum dieses I made this irgendwie so beliebt ist das ist total dumm"}, {"id": 71, "start": 797.24, "end": 804.32, "text": "Aber gut twitch twitch und dumme chat memes da weißt ja schon bescheid soll man den kram von gestern wieder zumachen"}, {"id": 72, "start": 807.2, "end": 809.2, "text": "Ppega vögel"}, {"id": 73, "start": 809.24, "end": 811.24, "text": "erst mal update fahren erst mal"}, {"id": 74, "start": 811.24, "end": 816.68, "text": "Nix zu mein was nix zu tun glaube ich nicht ja erst mal hier update bäm"}, {"id": 75, "start": 817.76, "end": 819.76, "text": "bäm bäbä bäm update"}, {"id": 76, "start": 821.32, "end": 826.68, "text": "So ich muss erst mal kurz meinen font wieder zurück stellen ok damit kann ich leben"}, {"id": 77, "start": 828.48, "end": 832.0, "text": "Geh weg erst mal alles update zack zack"}, {"id": 78, "start": 832.0, "end": 837.28, "text": "So das soll jetzt mal updaten genau also was wir heute machen ich gehe mal in mich ich speichere mir das mal"}, {"id": 79, "start": 837.28, "end": 841.2, "text": "Ich gehe mal in mich und überlege mir mal detailliert was kann ich eigentlich"}, {"id": 80, "start": 841.76, "end": 845.52, "text": "Ich meine ich kann euch jetzt schon spoilern viel viel ist es wahrscheinlich nicht"}, {"id": 81, "start": 846.64, "end": 853.44, "text": "Aber ich wollte schon seit lange mal so eine liste erstellen wo drin steht was weiß ich welche programmier sprachen kann ich gut oder"}, {"id": 82, "start": 853.44, "end": 862.04, "text": "Was was was kann man da was kann man da noch so reinschreiben so windows experte zb bin ich ja auch bekannt für also gerade dass ich mich mit windows"}, {"id": 83, "start": 862.04, "end": 865.04, "text": "besonders gut auskennen powershell hacker"}, {"id": 84, "start": 871.16, "end": 876.36, "text": "Drucker reparieren sowas ja mit shit mit shit kennen wir uns ja nicht so gut"}, {"id": 85, "start": 876.36, "end": 881.76, "text": "Also in welchem"}, {"id": 86, "start": 886.24, "end": 890.34, "text": "Drucker reparieren sowas ja mit shit mit shit kenn ich mich aus"}, {"id": 87, "start": 891.66, "end": 895.22, "text": "ko boll ja ja ko boll ist natürlich klar"}, {"id": 88, "start": 897.88, "end": 900.16, "text": "Ko ball ist ist einsteiger"}, {"id": 89, "start": 900.16, "end": 903.32, "text": "90,999 prozent der weltbevölkerung wollen wir wetten"}, {"id": 90, "start": 908.68, "end": 915.28, "text": "Ja, aber nur für für für massif konsultant geharr 250k im jahr dann mache ich domain migration easy"}, {"id": 91, "start": 918.0, "end": 923.28, "text": "Ich habe übrigens am anfang gesagt ich sag noch was zu irgendwie genau zu was man das macht sie geschrieben hat wollte schon was zu sagen"}, {"id": 92, "start": 923.28, "end": 929.0, "text": "Max ich arbeite auch teilzeit wie du muss sagen das war die beste entscheidung ja ist ist das beste teilzeit ist einfach nur"}, {"id": 93, "start": 931.64, "end": 936.52, "text": "Ja ich arbeite 75 prozent 75 wie funktioniert das denn"}, {"id": 94, "start": 938.16, "end": 944.4, "text": "Warte mal wie viel wie viel arbeite ich dann eigentlich lowbrane das überlegen wenn ich 100 prozent aber ein arbeit"}, {"id": 95, "start": 944.4, "end": 950.4, "text": "Einen tag weniger weniger dann sind das 20 prozent also 80 prozent oder"}, {"id": 96, "start": 950.4, "end": 953.0, "text": "Ich kann nicht mehr rechnen leute"}, {"id": 97, "start": 958.64, "end": 962.36, "text": "Das 80 ja oder ja ja"}, {"id": 98, "start": 965.76, "end": 968.04, "text": "Okay, dann dann bis noch ein bisschen weniger"}, {"id": 99, "start": 969.44, "end": 971.44, "text": "huge huge muffs ja"}, {"id": 100, "start": 971.44, "end": 979.44, "text": "Und ich brauche doch wieder ein bisschen nintendo gedudel dass es geht geht einfach besser"}, {"id": 101, "start": 982.76, "end": 984.76, "text": "Immer"}, {"id": 102, "start": 985.2, "end": 990.84, "text": "Einfach nice so deswegen verstehe ich gar nicht warum die brats auf der wald musik so pepega ist"}, {"id": 103, "start": 990.84, "end": 1000.36, "text": "Zumindest nicht zum zumindest ich fand sie langweilig so hier updates gemacht beim"}, {"id": 104, "start": 1002.36, "end": 1008.52, "text": "So ich lasse das mal kurz updates durchlaufen und jetzt höre ich halt gucke ich noch mal kurz chat"}, {"id": 105, "start": 1008.52, "end": 1024.12, "text": "Es ist echt so das ist genauso wisst ihr jetzt immer ernsthaft ich will jetzt nicht weiter drauf rumreihen wisst ihr warum das neue plans"}, {"id": 106, "start": 1024.12, "end": 1030.36, "text": "Was ist so kacke aussieht die wollen keine leute verschrecken und man spricht den casuals"}, {"id": 107, "start": 1030.92, "end": 1036.84, "text": "Dicht den casual der welt an das sind nicht also die die leute die mit sowas angesprochen werden sollen"}, {"id": 108, "start": 1036.84, "end": 1042.28, "text": "Das sind welche das sind nicht die leute die man sich und die wir uns unser casuals vorstellen ja"}, {"id": 109, "start": 1042.76, "end": 1049.16, "text": "Was sie damit ansprechen wollen ist das ist so wie mcdonalds ihr essen macht"}, {"id": 110, "start": 1049.72, "end": 1061.32, "text": "McDonalds macht ihr essen auch nicht darauf dass es quasi gut schmeckt mcdonalds macht ihr essen darauf dass es einen möglichst geringen prozentsatz an leuten gibt die es nicht essen können"}, {"id": 111, "start": 1061.32, "end": 1067.88, "text": "Das ist das ist das ist ja der trick dabei mcdonalds würde überhaupt keine vorteile davon ziehen wenn dies jetzt irgendwie besonders gut machen würden"}, {"id": 112, "start": 1068.36, "end": 1070.52, "text": "Die die die sorgen einfach dafür dass es"}, {"id": 113, "start": 1071.0, "end": 1079.88, "text": "Also du kannst ja auf der einen seite so besonders exquisite sachen machen wo du dann halt vielleicht nicht viele hast die das mögen aber die die das mögen die sagen halt"}, {"id": 114, "start": 1079.88, "end": 1081.88, "text": "Boah das ist ja besonders fein"}, {"id": 115, "start": 1082.36, "end": 1090.76, "text": "Und mcdonalds macht die umgedrehte taktik die machen es nicht besonders fein die machen es so dass es möglichst viele so wie farscht"}, {"id": 116, "start": 1090.76, "end": 1097.56, "text": "Stuhlmusik im endeffekt dass das da ist die farscht stuhlmusik der mobile games was ihr da seht"}, {"id": 117, "start": 1103.56, "end": 1106.04, "text": "Allem schinks tier 1 10 monat dankeschön poggers"}, {"id": 118, "start": 1112.84, "end": 1118.32, "text": "Ja heute mal was skill skill ist irgendeine markdown skill ist da muss ich jetzt aber erst mal updaten für"}, {"id": 119, "start": 1118.32, "end": 1120.72, "text": "Ne muss ich net aber ich mache es mal updaten"}, {"id": 120, "start": 1122.24, "end": 1128.8, "text": "Ich habe mal früher fünf euro die stunde trucker repariert frag doch mal ob du bei hardware rad pc zusammen bauen kannst"}, {"id": 121, "start": 1131.44, "end": 1137.16, "text": "Da verdient sie bestimmt mehr als fünf euro die stunde und ich habe gehört die suchen leute"}, {"id": 122, "start": 1141.12, "end": 1143.48, "text": "Ist das ungoogle korn das ist kaum jem ja"}, {"id": 123, "start": 1143.48, "end": 1145.48, "text": "Ja"}, {"id": 124, "start": 1146.68, "end": 1154.84, "text": "Ja so sieht es aus es ist so es ist damit die mutter diese grafik sieht so aus damit die mutter und nicht nur die mutter das"}, {"id": 125, "start": 1158.84, "end": 1160.84, "text": "Das das ist wie soll ich das beschreiben"}, {"id": 126, "start": 1161.68, "end": 1169.04, "text": "Die mutter ist noch normaler casual das das sind so sachen die richten sich an leute die möchten möglichst wenig"}, {"id": 127, "start": 1169.04, "end": 1177.2, "text": "Wenig haben wo sie anecken können ja also das ist ein spiel das ist garantiert auch also die sind auf so eine grafik gekommen"}, {"id": 128, "start": 1177.2, "end": 1180.32, "text": "Weil die auch veganer nicht triggern wollen 100 pro"}, {"id": 129, "start": 1182.32, "end": 1185.24, "text": "Das da machen die sich jeden scheiß gedanken heutzutage"}, {"id": 130, "start": 1187.4, "end": 1191.08, "text": "Oder kann man halt manche sachen nicht machen"}, {"id": 131, "start": 1191.08, "end": 1193.08, "text": "Ja"}, {"id": 132, "start": 1198.6, "end": 1205.36, "text": "Ist es im endeffekt auch das ist das mcdonalds essen der mobile games oder die fahrstuhl musik der mobile games"}, {"id": 133, "start": 1207.4, "end": 1209.4, "text": "Abzack sagt aber"}, {"id": 134, "start": 1210.24, "end": 1216.56, "text": "Immer immer noch besser also man er p.m. Geht mir teilweise echt noch mehr auf den kicks floor the game stufe 1 sag ich schon für"}, {"id": 135, "start": 1216.56, "end": 1217.84, "text": "den primes ab"}, {"id": 136, "start": 1217.84, "end": 1218.96, "text": "huge"}, {"id": 137, "start": 1218.96, "end": 1221.68, "text": "IQ increase ok"}, {"id": 138, "start": 1221.68, "end": 1224.6, "text": "Gehen wir mal hier rüber hat er updates installiert massive sommer rebooten bm"}, {"id": 139, "start": 1225.56, "end": 1230.8, "text": "Reboot schadet nicht guck ich ich mache mal ein reboot vielleicht kriege ich ein neues hintergrund bild von bingen"}, {"id": 140, "start": 1232.32, "end": 1237.62, "text": "Es ist übrigens der einzige service den ich jemals von bingen verwendet habe und verwende verwende"}, {"id": 141, "start": 1239.96, "end": 1244.48, "text": "Die daily daily image von bingen für meinen hintergrund das ist einzige"}, {"id": 142, "start": 1244.48, "end": 1248.12, "text": "Also pack mein 6.0 nie das ist bingen markt vögel oder"}, {"id": 143, "start": 1253.84, "end": 1255.84, "text": "Was ist das überhaupt"}, {"id": 144, "start": 1258.8, "end": 1263.8, "text": "Er any ornithologen in der chat was sind das was sehe ich hier für vögel"}, {"id": 145, "start": 1269.36, "end": 1271.36, "text": "Storch nee das ist kein storsch"}, {"id": 146, "start": 1271.36, "end": 1273.8, "text": "Storch nee das ist kein storsch"}, {"id": 147, "start": 1280.96, "end": 1282.96, "text": "Seine großeltern benutzen bingen"}, {"id": 148, "start": 1283.96, "end": 1285.96, "text": "Wegen den schönen bildern ja genau"}, {"id": 149, "start": 1286.72, "end": 1289.64, "text": "So leute wollen die mit plans was zombies drei ansprechen"}, {"id": 150, "start": 1291.88, "end": 1294.96, "text": "So ok ich mache jetzt mal einen neuen ordner mk dir"}, {"id": 151, "start": 1296.16, "end": 1299.0, "text": "Keck w3 weil keck w1 gibt es garantiert schon"}, {"id": 152, "start": 1299.0, "end": 1301.0, "text": "Ah"}, {"id": 153, "start": 1305.32, "end": 1308.72, "text": "Wusste ich dass es das gibt wusste ich das gibt keck wie gibt es schon"}, {"id": 154, "start": 1309.64, "end": 1317.04, "text": "Keck wie gibt es schon keck weight und keck wie drei also so touch skills punkt md"}, {"id": 155, "start": 1319.08, "end": 1321.16, "text": "Zack so sehr schön also"}, {"id": 156, "start": 1321.16, "end": 1328.2, "text": "So ist jetzt müssen wir uns gedanken machen jetzt wirds jetzt wirds big brain also was schreibt man was schreibt man in so was rein"}, {"id": 157, "start": 1330.96, "end": 1332.96, "text": "Was was schreibt man in so was rein also"}, {"id": 158, "start": 1335.84, "end": 1343.36, "text": "Mima ich weiß ja nicht das soll schon was das soll schon was bisschen seriöses sein wo ich dann auch sagen kann ok hier lasst"}, {"id": 159, "start": 1343.36, "end": 1344.4, "text": "Mal nachgucken"}, {"id": 160, "start": 1344.4, "end": 1348.84, "text": "Das sind keine kraniche das weiß ich ja das kann sein ich kraniche sind das nicht das sind"}, {"id": 161, "start": 1348.84, "end": 1350.84, "text": "5 hat bürz"}, {"id": 162, "start": 1352.56, "end": 1359.2, "text": "Also also kann das nicht irgendwie die markt markt dauernd vorschau oder sowas konnte das nicht"}, {"id": 163, "start": 1363.92, "end": 1365.92, "text": "Ah jetzt"}, {"id": 164, "start": 1367.16, "end": 1369.16, "text": "Skillorts so"}, {"id": 165, "start": 1369.88, "end": 1374.84, "text": "Also fangen wir mal an mit das mal überlegen mit was mit was fängt man gut an linux linux"}, {"id": 166, "start": 1374.84, "end": 1379.04, "text": "Linux linux linux wir fangen mit linux an ok linux"}, {"id": 167, "start": 1379.76, "end": 1381.76, "text": "linux linux"}, {"id": 168, "start": 1382.4, "end": 1384.56, "text": "Zweite header draus linux ok"}, {"id": 169, "start": 1385.56, "end": 1387.56, "text": "Also linux an sich"}, {"id": 170, "start": 1387.96, "end": 1391.98, "text": "Was fällt da drunter schauss scripting kann ich gut"}, {"id": 171, "start": 1392.76, "end": 1394.76, "text": "so bash zsh"}, {"id": 172, "start": 1395.76, "end": 1397.76, "text": "so die standard dinger"}, {"id": 173, "start": 1397.76, "end": 1404.08, "text": "Aber ich mach plus plus plus dahinter so für wie gut ich das kann"}, {"id": 174, "start": 1404.44, "end": 1408.16, "text": "So was gibt es dann sonst auch was gibt es dann sonst auch für für"}, {"id": 175, "start": 1408.84, "end": 1414.4, "text": "Sachen unter linux zu zu zu ahnung zu haben also red hat"}, {"id": 176, "start": 1415.08, "end": 1417.08, "text": "cento s kenne ich mich super aus"}, {"id": 177, "start": 1418.48, "end": 1420.84, "text": "Ubuntu debian kenne ich mich gut aus"}, {"id": 178, "start": 1420.84, "end": 1428.84, "text": "Aus suse moment wir brauchen auch das passende image keck weh"}, {"id": 179, "start": 1437.04, "end": 1439.04, "text": "Wie macht man noch mal ein image in markt dauernd"}, {"id": 180, "start": 1441.2, "end": 1443.2, "text": "Image markt dauernd"}, {"id": 181, "start": 1443.2, "end": 1449.88, "text": "Irgendwie irgendwas mit klammern ich kann mir das immer nicht merken"}, {"id": 182, "start": 1451.6, "end": 1454.0, "text": "Irgendwas mit klammern na ah ja hier guck mal da"}, {"id": 183, "start": 1455.8, "end": 1457.8, "text": "Poros"}, {"id": 184, "start": 1458.64, "end": 1462.84, "text": "Und jetzt brauche ich keck wie keck weh image copy image link"}, {"id": 185, "start": 1465.8, "end": 1469.28, "text": "So ha perfekt ob sie groß"}, {"id": 186, "start": 1469.28, "end": 1475.16, "text": "Ja wunderbar haben wir das größer machen"}, {"id": 187, "start": 1476.76, "end": 1481.52, "text": "Kameras kamer das irgendwie sie sie sie fetter machen oder so"}, {"id": 188, "start": 1485.56, "end": 1493.2, "text": "Die kriegt man die vorschau größer ok markt dauernd preview vias code von size geht auch bestimmt irgendwie"}, {"id": 189, "start": 1494.32, "end": 1496.32, "text": "von size markt dauernd preview"}, {"id": 190, "start": 1496.32, "end": 1498.32, "text": "Microsoft"}, {"id": 191, "start": 1504.32, "end": 1508.24, "text": "Also was extension markt dauernd von size ok"}, {"id": 192, "start": 1510.72, "end": 1513.08, "text": "Quatsch was mache ich denn setting"}, {"id": 193, "start": 1517.0, "end": 1519.24, "text": "Wo müssen wir hin extension"}, {"id": 194, "start": 1519.24, "end": 1525.56, "text": "Mark dauernd ah ja hier von sides 20 bäm ah"}, {"id": 195, "start": 1526.76, "end": 1528.76, "text": "Yes excellent excellent"}, {"id": 196, "start": 1531.48, "end": 1533.48, "text": "Shit"}, {"id": 197, "start": 1533.88, "end": 1535.0, "text": "Gut"}, {"id": 198, "start": 1535.0, "end": 1542.52, "text": "Also red hat kann ich sento es kann ich ubuntu debian kann ich suse kann ich überhaupt nicht suse habe ich keine ahnung davon aber suse"}, {"id": 199, "start": 1542.88, "end": 1544.88, "text": "braucht man ja auch nicht weil"}, {"id": 200, "start": 1544.88, "end": 1549.32, "text": "Es ist sagt so"}, {"id": 201, "start": 1553.08, "end": 1559.8, "text": "Was red hat red hat gleich elotrix was ach ach red hat"}, {"id": 202, "start": 1562.72, "end": 1564.72, "text": "Jetzt habe ich es verstanden"}, {"id": 203, "start": 1565.28, "end": 1567.28, "text": "Ok hat ein bisschen gedauert"}, {"id": 204, "start": 1568.2, "end": 1571.16, "text": "Hier legs critical information hat ein bisschen gedauert ja"}, {"id": 205, "start": 1571.16, "end": 1573.16, "text": "Ja"}, {"id": 206, "start": 1574.4, "end": 1579.24, "text": "Ok was schreibt man denn in sowas rein ok win windows"}, {"id": 207, "start": 1579.24, "end": 1594.36, "text": "Windows ja da fällt mir ehrlich gesagt nichts zu ein nächstes nächstes nächstes thema"}, {"id": 208, "start": 1601.0, "end": 1604.68, "text": "Aber so wenn das habe ich keine ahnung von ok also"}, {"id": 209, "start": 1604.68, "end": 1610.16, "text": "Linux kenne ich mich aus shell skippen sonst wie funktioniert auch wunderbar ich ich muss mir echt mal ein bisschen gedankt machen was man da"}, {"id": 210, "start": 1610.16, "end": 1614.04, "text": "Alles rein was man alles reinschreibt also jetzt machen wir erstmal betriebssysteme so"}, {"id": 211, "start": 1615.48, "end": 1617.96, "text": "Dann würde ich da mal sowas wie mal sowas wie klaut"}, {"id": 212, "start": 1620.08, "end": 1626.64, "text": "Also klaut technisch kenne ich mich aus mit netlify ganz ok mit"}, {"id": 213, "start": 1628.52, "end": 1630.52, "text": "Dings hier"}, {"id": 214, "start": 1630.52, "end": 1632.52, "text": "Und"}, {"id": 215, "start": 1633.16, "end": 1637.56, "text": "Wie heißen sie noch mal klaut flair voll vergessen alle klaut flair"}, {"id": 216, "start": 1640.2, "end": 1647.4, "text": "Dann kenne ich mich aus ein bisschen mit aws allerdings nicht sonderlich gut mit mit google kenne ich mich auch"}, {"id": 217, "start": 1648.2, "end": 1649.52, "text": "bisschen aus"}, {"id": 218, "start": 1649.52, "end": 1656.16, "text": "So jetzt nach klaut auch dabei erkenne ich mich gut aus aber kann man überhaupt nicht vergleichen miteinander aber schreibe mal rein"}, {"id": 219, "start": 1656.16, "end": 1660.84, "text": "Übrigens ausrufe zeichnen hetzener wer 20 euro gutschein haben will"}, {"id": 220, "start": 1662.48, "end": 1664.48, "text": "Aber nur für neukunden"}, {"id": 221, "start": 1665.76, "end": 1669.24, "text": "Es ja da kenne ich mir mittlerweile ganz gut aus weil auf der arbeit viel es ja machen"}, {"id": 222, "start": 1673.44, "end": 1675.44, "text": "Ok wunderbar"}, {"id": 223, "start": 1677.36, "end": 1679.36, "text": "Digital außen ja"}, {"id": 224, "start": 1680.28, "end": 1682.54, "text": "Da kenne ich mich ganz gut mit aus habe ich lang verwendet"}, {"id": 225, "start": 1682.54, "end": 1688.06, "text": "Was wird aufgeschrieben ich habe mal vor einem jahr meinem chef gesagt hey wie sieht es dann aus"}, {"id": 226, "start": 1688.06, "end": 1691.34, "text": "haben wir nicht mehr sachen wo man ein bisschen was programmieren kann oder sonst wie"}, {"id": 227, "start": 1691.9, "end": 1698.3, "text": "Und er hat gemeint ja müssen wir mal ein bisschen übergreifen gucken da habe ich ihm gesagt weißt du was ich schicke dir mal eine skillliste"}, {"id": 228, "start": 1698.3, "end": 1702.22, "text": "Mit sachen die ich kann beziehungsweise sachen wo ich gerne was machen wo ich gerne mehr machen würde"}, {"id": 229, "start": 1702.86, "end": 1706.86, "text": "Und ich habe es ist einfach jetzt ein ja über ignoriert und nicht mal dran gedacht"}, {"id": 230, "start": 1708.14, "end": 1711.18, "text": "Ich habe mir gedacht ich mache das jetzt einfach mal im stream also ich gebe zu"}, {"id": 231, "start": 1711.18, "end": 1715.82, "text": "Das ist jetzt vielleicht nicht das allerspannendste zum zugucken aber ich muss es eh machen"}, {"id": 232, "start": 1716.62, "end": 1719.74, "text": "Und jetzt können wir auch im stream uns was überlegen"}, {"id": 233, "start": 1720.54, "end": 1726.22, "text": "Ich war ich weiß noch nicht wie ich das ganze strukturiere ich schreibe jetzt einfach mal irgendwie ein bisschen was auf ja so"}, {"id": 234, "start": 1727.26, "end": 1733.34, "text": "Cloud was zählt was zählt zu cloud sonst noch dabei ich würde sagen kubernetes und sonst wie das machen wir oder docker"}, {"id": 235, "start": 1733.34, "end": 1736.7, "text": "Geschichten das machen wir dann später unter irgendwie defops tools oder sowas"}, {"id": 236, "start": 1736.7, "end": 1739.18, "text": "Wie kommt man auf so viel cloud erfahrung einfach benutzen"}, {"id": 237, "start": 1743.66, "end": 1745.66, "text": "Und eine firma haben die dafür geld ausgibt"}, {"id": 238, "start": 1752.7, "end": 1755.58, "text": "Leute ich muss amazon sack"}, {"id": 239, "start": 1755.58, "end": 1760.24, "text": "Metser"}, {"id": 240, "start": 1773.66, "end": 1776.54, "text": "Die wichtige geschichte musst jetzt mal erledigt werden"}, {"id": 241, "start": 1778.7, "end": 1782.3, "text": "Die ist aber echt gut leute empf spelungen"}, {"id": 242, "start": 1782.3, "end": 1785.34, "text": "die ist aber echt gut leute"}, {"id": 243, "start": 1785.34, "end": 1789.78, "text": "es war ohne scheiß also ich wollte jetzt hier nicht ein sinnloses rummeme machen oder"}, {"id": 244, "start": 1789.78, "end": 1790.18, "text": "so"}, {"id": 245, "start": 1790.18, "end": 1794.86, "text": "beste barbecue sauce hier die ist richtig scheiße kennt ihr jemand von euch"}, {"id": 246, "start": 1794.86, "end": 1800.18, "text": "hell yeah ach ne falsches falsches kokona hier"}, {"id": 247, "start": 1800.18, "end": 1803.34, "text": "die ist richtig spockers"}, {"id": 248, "start": 1803.34, "end": 1811.98, "text": "warum ist das hier nicht richtig photoshopped oder sieht das auf dem glass auch so aus"}, {"id": 249, "start": 1811.98, "end": 1819.86, "text": "aber die ist wirklich gut kann man nur empfehlen"}, {"id": 250, "start": 1819.86, "end": 1823.74, "text": "sehr gut ist eine und das andere schließt sich ja nicht aus du kannst"}, {"id": 251, "start": 1823.74, "end": 1829.46, "text": "ja eins mit senf essen und eins mit barbecue sauce außerdem muss ich sagen ich habe das"}, {"id": 252, "start": 1829.46, "end": 1832.7, "text": "früher immer verkehrt gemacht ich habe barbecue sauce immer früher wie"}, {"id": 253, "start": 1832.7, "end": 1837.58, "text": "ketchup verwenden also du hast barbecue sauce dabei geschüttet damit gegessen"}, {"id": 254, "start": 1837.58, "end": 1841.82, "text": "bis ich irgendwann mal gecheckt habe das barbecue sauce eigentlich dafür"}, {"id": 255, "start": 1841.82, "end": 1847.42, "text": "da ist dass man es drauf macht und damit dann auf den grill oder oder brät"}, {"id": 256, "start": 1847.42, "end": 1851.82, "text": "oder sonst wie was oder zumindest schon beim zubereiten drauf macht und nicht"}, {"id": 257, "start": 1851.82, "end": 1855.1, "text": "danach weil man kann sicherlich auch danach drauf machen schmeckt damit auch"}, {"id": 258, "start": 1855.1, "end": 1860.06, "text": "gut das habe ich immer nicht kapiert weiß ich weiß nicht ob das wirklich so"}, {"id": 259, "start": 1860.06, "end": 1864.62, "text": "der weißheitsletzter schluss ist aber ich glaube barbecue sauce ist dafür"}, {"id": 260, "start": 1864.62, "end": 1868.58, "text": "gedacht dass man die bei der zubereitung schon drauf macht und dann schmeckt"}, {"id": 261, "start": 1868.58, "end": 1872.66, "text": "die auch besser also schmeckt so schon geil aber wenn ihr die quasi mitgegrillt"}, {"id": 262, "start": 1872.66, "end": 1877.78, "text": "hast schmeckt es noch besser auf fleisch wird bier gekippt das schmeckt"}, {"id": 263, "start": 1877.78, "end": 1883.54, "text": "nicht also mir mir schmeckt das nicht ich mag bier aber an sich nicht ich"}, {"id": 264, "start": 1883.54, "end": 1889.34, "text": "trinke nur 500 euro wein plus aber bier mag ich net"}, {"id": 265, "start": 1889.34, "end": 1896.1, "text": "chat ihr bestimmt auch oder"}, {"id": 266, "start": 1901.14, "end": 1908.74, "text": "übrigens ich muss mal wieder bestellen ich muss mal wieder bestellen bei meinem"}, {"id": 267, "start": 1908.74, "end": 1917.46, "text": "lieblings italien shop und die haben auch hier wein aber ich trinke kein wein"}, {"id": 268, "start": 1917.46, "end": 1921.78, "text": "ich trinke auch kein bier ich trinke eigentlich fast nichts alkoholisches da"}, {"id": 269, "start": 1921.78, "end": 1925.38, "text": "kann man sich einfach mal easy sechs flaschen für 40 euro holen ja oder hier"}, {"id": 270, "start": 1925.38, "end": 1935.82, "text": "oder hier 72 euro und 84 euro und so exzellent aber auch wenn man da nichts"}, {"id": 271, "start": 1935.82, "end": 1941.42, "text": "bestellt an weinen kann man da exquisite nudeln bestellen die sind wirklich die"}, {"id": 272, "start": 1941.42, "end": 1946.98, "text": "sind wirklich gut die nudeln bei denen die nudeln bei denen sind wirklich nice"}, {"id": 273, "start": 1946.98, "end": 1957.02, "text": "guckt euch die mal an hier den font den font in visual studio endlich da da"}, {"id": 274, "start": 1957.02, "end": 1964.22, "text": "habe ich drauf gewartet ja die sind wirklich poggers die nudeln und wenn man"}, {"id": 275, "start": 1964.22, "end": 1968.46, "text": "gar nicht weiß was man bestellen soll dann bestellt man einfach probier"}, {"id": 276, "start": 1968.46, "end": 1976.86, "text": "probierpaket probierpaket pass pasta und soßen dann kriegt man vier soßen"}, {"id": 277, "start": 1976.86, "end": 1984.66, "text": "und vier mal nudeln ist wirklich sehr nice wirklich sehr schmeckt echt geil"}, {"id": 278, "start": 1984.66, "end": 1989.58, "text": "das zeug von denen aber es ist halt ein bisschen teuer und ich glaube es ist nicht"}, {"id": 279, "start": 1989.58, "end": 1995.1, "text": "jedermanns fall für nudeln und soßen quasi 37 euro auszugehen wurde beim"}, {"id": 280, "start": 1995.1, "end": 1999.34, "text": "lidl 40 cent dafür bezahlt kann ich verstehen würde ich normalerweise auch"}, {"id": 281, "start": 1999.34, "end": 2003.62, "text": "nicht jeden tag machen aber schmeckt wirklich gut also ich würde es nicht ich"}, {"id": 282, "start": 2003.62, "end": 2009.22, "text": "würde es ganz ehrlich ich würde das nur zum probieren ich würde das nur zum"}, {"id": 283, "start": 2009.22, "end": 2013.42, "text": "nur zum probieren mal machen normalerweise würde ich das nicht"}, {"id": 284, "start": 2013.42, "end": 2017.9, "text": "würde ich das nicht bestellen weil die soßen sind so sind ok aber jetzt nicht"}, {"id": 285, "start": 2017.9, "end": 2023.02, "text": "wahnsinnig geil ich bestelle lieber nudeln udel so das wird bei uns an"}, {"id": 286, "start": 2023.02, "end": 2026.06, "text": "weihnachten immer an alle verteilt echt da dann kriegt ihr was gutes an"}, {"id": 287, "start": 2026.06, "end": 2029.78, "text": "weihnachten bei uns gibt es an weihnachten vom betriebsrat so einen"}, {"id": 288, "start": 2029.78, "end": 2038.74, "text": "komischen nikolaus und das war so ein nackischen nicht eingepackten nikolaus"}, {"id": 289, "start": 2038.74, "end": 2041.98, "text": "schokoladen nikolaus"}, {"id": 290, "start": 2044.66, "end": 2049.66, "text": "weil das stimmt ja gar nicht bei uns gibt es auch an weihnachten öfters mal"}, {"id": 291, "start": 2049.66, "end": 2056.66, "text": "bei uns gibt es an weihnachten auch öfters mal sachen letztes mal gab es"}, {"id": 292, "start": 2056.66, "end": 2062.02, "text": "gab es letztes mal nudel gab es das letzte mal stimmt nudel nudel und so"}, {"id": 293, "start": 2062.02, "end": 2067.1, "text": "komisches salz was bei mir heute noch unten rum steht ich weiß nicht warum"}, {"id": 294, "start": 2067.1, "end": 2079.02, "text": "salz aber nudel und salz gab es glühwein gibt es bei uns manchmal zu"}, {"id": 295, "start": 2079.18, "end": 2083.06, "text": "silvester der schmeckt mir aber nicht wie gesagt leute ich trinke eigentlich so"}, {"id": 296, "start": 2083.06, "end": 2087.78, "text": "gut wie nix das einzige was ich ab und zu ganz ganz selten mal trinke weihnachten"}, {"id": 297, "start": 2087.78, "end": 2091.78, "text": "silvester ist tatsächlich bisschen bisschen wein aber ich bin kein großer"}, {"id": 298, "start": 2091.78, "end": 2097.66, "text": "alkohol trinke ich mag bier überhaupt nicht und wein eigentlich auch nicht und"}, {"id": 299, "start": 2097.66, "end": 2102.22, "text": "irgendwelchen harten krams so wodka und sonst wie auch nicht das einzige was ich"}, {"id": 300, "start": 2102.22, "end": 2106.98, "text": "tatsächlich ganz gerne trinke ist whisky"}, {"id": 301, "start": 2106.98, "end": 2112.54, "text": "aber dann auch nur ein bisschen war es"}, {"id": 302, "start": 2116.78, "end": 2121.58, "text": "maxis schwerer alkohol darf man darüber eigentlich reden auf twitch"}, {"id": 303, "start": 2121.58, "end": 2125.66, "text": "nee aber ich mag es nicht"}, {"id": 304, "start": 2130.98, "end": 2135.58, "text": "habe ich auch schon mal habe ich auch schon mal gab falls sie ich bin mir nicht"}, {"id": 305, "start": 2135.58, "end": 2141.38, "text": "versich lafroy oder wie man die ausspricht die haben ja auch alle"}, {"id": 306, "start": 2141.38, "end": 2147.38, "text": "unterschiedliche sachen von von irgendwie hat mich nicht acht jahren bis"}, {"id": 307, "start": 2147.38, "end": 2151.54, "text": "irgendwie dann rauf zu frag mich nicht 30 jahren für irgendwie 8000 euro die"}, {"id": 308, "start": 2151.54, "end": 2155.82, "text": "flasche oder so es ist teilweise echt wobei sich das nicht lohnt"}, {"id": 309, "start": 2155.82, "end": 2168.66, "text": "verkostigungs live stream nee mache ich net aber wie gesagt ich trinke nicht"}, {"id": 310, "start": 2168.66, "end": 2171.74, "text": "nicht viel zeug"}, {"id": 311, "start": 2176.34, "end": 2181.78, "text": "so ok weiter also was was was habe ich noch für messif messif skills lassen"}, {"id": 312, "start": 2181.78, "end": 2185.78, "text": "überlegen was braucht man als als nächstes als nächstes mal programmier"}, {"id": 313, "start": 2185.78, "end": 2191.82, "text": "sprachen aber progers progers ok jetzt muss ich mal in mich gehen was für was"}, {"id": 314, "start": 2191.82, "end": 2195.58, "text": "für programmier sprachen krieg ich dann krieg ich denn gut hin vielleicht"}, {"id": 315, "start": 2195.58, "end": 2205.1, "text": "sollte man progers unterteilen in back end und in front und ent vielleicht sollte"}, {"id": 316, "start": 2205.1, "end": 2214.26, "text": "es einfach klein schreiben wieso cobalt immerhin ich würde sagen cobalt"}, {"id": 317, "start": 2214.26, "end": 2220.1, "text": "fortgeschrittener ganz klar ich meine ich kann besser cobalt als 99,99"}, {"id": 318, "start": 2220.1, "end": 2225.5, "text": "prozent der weltbevölkerung bin ich mir sicher weil die meisten leute können"}, {"id": 319, "start": 2225.5, "end": 2228.78, "text": "gar keine programmier sprache und die die welche können können garantiert"}, {"id": 320, "start": 2228.78, "end": 2232.7, "text": "kein cobalt ich meine ich habe mit cobalt immerhin immerhin schon mal"}, {"id": 321, "start": 2232.7, "end": 2236.34, "text": "dateien eingelesen und geschrieben"}, {"id": 322, "start": 2238.14, "end": 2241.9, "text": "kannst du mit dem horst live verkostum machen mit welchem horst"}, {"id": 323, "start": 2241.9, "end": 2251.94, "text": "ach ich weiß wem du meinst du meinst denkst hier whiskey store ja genau der"}, {"id": 324, "start": 2251.94, "end": 2260.26, "text": "den habe ich jetzt gar nicht gedacht ja den gibt es ja auch noch hat er nicht"}, {"id": 325, "start": 2260.26, "end": 2267.62, "text": "einen zwei channel hat er nicht den zwei channel woran er erzählt hat klimawandel"}, {"id": 326, "start": 2267.62, "end": 2273.62, "text": "liegt an sonnen aktivität gut ich meine man kann nicht immer einer"}, {"id": 327, "start": 2273.62, "end": 2278.82, "text": "meinung sein ja außerdem es ist beim whiskey verkosten egal"}, {"id": 328, "start": 2281.14, "end": 2289.7, "text": "so machen wir mal weiter also das weiß er hier für lulz ja also fangen wir an"}, {"id": 329, "start": 2289.7, "end": 2296.98, "text": "es ist ab aber fangen wir mit was an was ich kann das kann ich gut so ruby ruby"}, {"id": 330, "start": 2296.98, "end": 2299.86, "text": "kann ich auch gut"}, {"id": 331, "start": 2301.26, "end": 2306.74, "text": "büton büton kann ich auch nicht gut mache ich zu wenig mit mache ich zu"}, {"id": 332, "start": 2306.74, "end": 2311.86, "text": "wenig mit aber wenn ich was mache ist easy so"}, {"id": 333, "start": 2311.86, "end": 2322.38, "text": "c plus plus c plus plus paint champ will ich nicht"}, {"id": 334, "start": 2322.38, "end": 2331.3, "text": "das ist sogar synchron gescrollt mittlerweile paint champ noch es ist"}, {"id": 335, "start": 2331.3, "end": 2336.46, "text": "keine programmiersprache aber noch es könnte man als technologie reinschreiben"}, {"id": 336, "start": 2336.46, "end": 2340.3, "text": "ich weiß was ich was meine ich schreibe es einfach mal auf ich schreibe es"}, {"id": 337, "start": 2340.3, "end": 2347.74, "text": "einfach aus nein aber beschreibe ich da nicht rein so ja war"}, {"id": 338, "start": 2357.46, "end": 2365.06, "text": "du könntest 50 prozent machen für progress bar was"}, {"id": 339, "start": 2365.06, "end": 2370.34, "text": "was ist das denn progress bar def"}, {"id": 340, "start": 2370.34, "end": 2377.86, "text": "in einem minute was was was was sehe ich da"}, {"id": 341, "start": 2384.22, "end": 2390.94, "text": "kann man das irgendwie einbinden oder wie du verdienst doch dein geld mit java"}, {"id": 342, "start": 2390.94, "end": 2396.82, "text": "nähe zum glück nicht ich meine viele unserer software ist in java da mache"}, {"id": 343, "start": 2396.82, "end": 2399.7, "text": "ich nicht mit den"}, {"id": 344, "start": 2401.26, "end": 2406.98, "text": "die ausrufe zeichnen 50 prozent das klappt auch im leben nicht oder"}, {"id": 345, "start": 2406.98, "end": 2416.58, "text": "nähe mit dem link dahinter"}, {"id": 346, "start": 2422.34, "end": 2426.94, "text": "so das ist ja cool"}, {"id": 347, "start": 2426.94, "end": 2434.34, "text": "oder das ist ja mal big brain alter"}, {"id": 348, "start": 2439.82, "end": 2441.62, "text": "das ist wirklich next level shit hier"}, {"id": 349, "start": 2441.62, "end": 2449.38, "text": "ok excellent das machen wir so so machen wir das java"}, {"id": 350, "start": 2449.38, "end": 2460.66, "text": "fünf ach komm zwar ich kann java lesen und schreiben ich mag java aber nicht"}, {"id": 351, "start": 2460.66, "end": 2466.3, "text": "der komfort sich ich ich kann das aber ich mag das nicht"}, {"id": 352, "start": 2471.26, "end": 2477.54, "text": "ok c++ kann ich aber ich mag es absolut nicht aber ok es soll ja was ernsthaftes werden es"}, {"id": 353, "start": 2477.54, "end": 2484.54, "text": "soll ja was ernsthaftes werden ok 60 ich meine ich hasse es da was mit was zu"}, {"id": 354, "start": 2484.54, "end": 2488.58, "text": "machen aber ich krieg es mittlerweile ganz ich krieg das mittlerweile echt ganz"}, {"id": 355, "start": 2488.58, "end": 2492.26, "text": "gut hin also auch wenn viele sachen noch böhmische"}, {"id": 356, "start": 2492.26, "end": 2503.94, "text": "dörfer sind aber das ist normal in c++ 70 ruby ruby kann ich wirklich gut auch"}, {"id": 357, "start": 2503.94, "end": 2508.86, "text": "wenn ich schon ganz lang nichts damit gemacht habe was passiert eigentlich"}, {"id": 358, "start": 2508.86, "end": 2512.5, "text": "wenn ich jetzt 1000 reinschreibe"}, {"id": 359, "start": 2517.06, "end": 2523.78, "text": "9000 poggers bringt ja zwar nix aber"}, {"id": 360, "start": 2523.78, "end": 2534.86, "text": "cobalt 10 ich mein cobalt ernsthaft ja"}, {"id": 361, "start": 2538.38, "end": 2542.5, "text": "puzzle meister dankeschön für den zapp ok lasst mal weiter überlegen was haben"}, {"id": 362, "start": 2542.5, "end": 2545.86, "text": "wir noch für was haben wir noch für für neise für neise prognose sprachen was"}, {"id": 363, "start": 2545.86, "end": 2553.06, "text": "kann ich dann noch go go kann ich mittlerweile tatsächlich ganz gut aber"}, {"id": 364, "start": 2553.06, "end": 2558.98, "text": "ich drück mich immer was davor in go zu machen weil es einige sachen an go gibt"}, {"id": 365, "start": 2558.98, "end": 2568.1, "text": "die mich nerven ich verwendet go immer nur dann wenn es gute libraries in go"}, {"id": 366, "start": 2568.1, "end": 2572.74, "text": "gibt oder das ökosystem halt go erfordert ansonsten mache ich eigentlich"}, {"id": 367, "start": 2572.74, "end": 2577.42, "text": "bogen um go weil es ist mir doch ein bisschen sehr minimalistisch in vielen"}, {"id": 368, "start": 2577.42, "end": 2582.18, "text": "stellen wisst ihr es gibt zum beispiel eine sache die ich nicht verstehe warum"}, {"id": 369, "start": 2582.18, "end": 2586.02, "text": "man warum man das 2021 rast habe ich auch mal ausprobiert ja können wir auch"}, {"id": 370, "start": 2586.02, "end": 2589.38, "text": "gleich was dabei schreiben was habe ich aber zuletzt vor ein paar jahren gemacht"}, {"id": 371, "start": 2589.38, "end": 2594.38, "text": "als es relativ neu war also was mich halt an go nervt ist zum"}, {"id": 372, "start": 2594.38, "end": 2599.46, "text": "beispiel diese sache ich weiß zum beispiel ich kann mir einfach ums"}, {"id": 373, "start": 2599.46, "end": 2604.82, "text": "verrecken nicht merken wie die wie die maps und tags ist in go es ist es ist"}, {"id": 374, "start": 2604.82, "end": 2608.46, "text": "ganz schlimm also wenn du in go eine variabler anlegen willst"}, {"id": 375, "start": 2608.46, "end": 2613.26, "text": "da musst irgendwie so int wie ging das ich kann ich kann es mir nicht merken ich"}, {"id": 376, "start": 2613.26, "end": 2621.42, "text": "kann es mir einfach nicht merken so map so ich kann es mir einfach nicht"}, {"id": 377, "start": 2621.42, "end": 2631.26, "text": "merken maps und tags go nicht mappo ja aber plus gleich geht nicht wenn es"}, {"id": 378, "start": 2631.26, "end": 2638.94, "text": "global ist das war doch richtig was ich gemacht habe fast leute es war fast"}, {"id": 379, "start": 2638.94, "end": 2644.9, "text": "richtig es war fast richtig guck mal es war fast richtig was ich gemacht habe"}, {"id": 380, "start": 2644.9, "end": 2652.66, "text": "das ist aber auch eklig ist und tags aus dem kopf so also so das ist das ist eine"}, {"id": 381, "start": 2652.66, "end": 2665.42, "text": "map zuordnung key value also sprich so was hier zum beispiel map 0 w gleich 1 so"}, {"id": 382, "start": 2665.42, "end": 2671.02, "text": "und was ich halt was ich halt überhaupt nicht mag an go ist dass wenn man jetzt"}, {"id": 383, "start": 2671.02, "end": 2678.42, "text": "zum beispiel sagen wenn man hat man hat einen int array ich finde diese sind"}, {"id": 384, "start": 2678.42, "end": 2684.14, "text": "total und eingängig dann haben sie noch ihre komische slice syntax die noch mal"}, {"id": 385, "start": 2684.14, "end": 2686.86, "text": "anders ist so und was ich halt ein bisschen doof"}, {"id": 386, "start": 2686.86, "end": 2691.14, "text": "hin du hast in du hast in go einen array mit fünf elementen so in jeder"}, {"id": 387, "start": 2691.14, "end": 2695.38, "text": "programmiersprache kannst du sowas machen array sagen wir jetzt irgendwie"}, {"id": 388, "start": 2695.38, "end": 2702.54, "text": "keine nennen wir mal javascript filter element ich will alle elemente haben die"}, {"id": 389, "start": 2702.54, "end": 2708.98, "text": "größer als zwei sind so neues ray gleich so das kannst du in nahezu jeder"}, {"id": 390, "start": 2708.98, "end": 2714.9, "text": "sprache machen dies heute gibt nicht in go in go funktioniert das net weil die"}, {"id": 391, "start": 2714.9, "end": 2722.02, "text": "sich gedacht haben vorschleife master race in go in go musst du dann in die"}, {"id": 392, "start": 2722.02, "end": 2735.54, "text": "vor range war das so die syntax go for range"}, {"id": 393, "start": 2737.06, "end": 2748.9, "text": "ja fast fast fast fast fast fast so das ist die syntax in go und die sind in"}, {"id": 394, "start": 2748.9, "end": 2756.54, "text": "go richtig scharf drauf dass du alles verschleifst ja also so nach dem motto"}, {"id": 395, "start": 2756.54, "end": 2761.1, "text": "wie array filter sonst wie ne gibt es nicht gibt es nicht nein mach mach"}, {"id": 396, "start": 2761.1, "end": 2765.58, "text": "schleife von hand und ich finde auch dieses plus klar dieses doppelpunkt"}, {"id": 397, "start": 2765.58, "end": 2769.3, "text": "gleich ein bisschen pains champing weil du kannst sachen mit wahr anlegen du"}, {"id": 398, "start": 2769.3, "end": 2778.14, "text": "kannst sachen dann naja es ist wie gesagt ich finde go ist nicht so"}, {"id": 399, "start": 2778.14, "end": 2783.02, "text": "konsequent in manchen sachen aber es ok ist ist in ordnung also kann man"}, {"id": 400, "start": 2783.02, "end": 2786.1, "text": "verwenden ich finde so eigentlich kutteln damit"}, {"id": 401, "start": 2786.1, "end": 2790.56, "text": "habe ich tatsächlich noch nichts gemacht das finde ich halt ein bisschen pains"}, {"id": 402, "start": 2790.56, "end": 2795.22, "text": "champ in go aber ich mag go an sich also wenn ich die auswahl habe jetzt mal"}, {"id": 403, "start": 2795.22, "end": 2798.46, "text": "ernsthaft wenn ich die auswahl habe machst du was in go oder machst du was"}, {"id": 404, "start": 2798.46, "end": 2803.46, "text": "in c++ da können wir davon ausgehen ich werde ich würde jeden tag go verwenden"}, {"id": 405, "start": 2803.46, "end": 2811.98, "text": "so machen wir weiter javascript so dumm es klingt mittlerweile kriege ich"}, {"id": 406, "start": 2811.98, "end": 2815.42, "text": "javascript eigentlich ganz gut hin"}, {"id": 407, "start": 2819.34, "end": 2824.46, "text": "auch wenn es immer noch ein paar ich habe eine null vergessen bei kobol du"}, {"id": 408, "start": 2824.46, "end": 2828.78, "text": "meinst es muss so sein wie gesagt ich habe sie eben gesagt ich kann kobol"}, {"id": 409, "start": 2828.78, "end": 2834.7, "text": "besser ich kann ich kann kobol besser als 9.99 pro welt der weltbevölkerung das"}, {"id": 410, "start": 2834.7, "end": 2842.74, "text": "heißt aber bei kobol auch nix immer dieses c++ gebasche naja c++ ist ja auch"}, {"id": 411, "start": 2842.74, "end": 2847.38, "text": "einfach zu basteln weil c++ kacke ist so als javascript kriege ich mittlerweile"}, {"id": 412, "start": 2847.38, "end": 2852.54, "text": "auch echt ganz gut hin auch wenn es noch so ein paar sachen gibt die die mich"}, {"id": 413, "start": 2852.54, "end": 2859.3, "text": "immer kringen lassen javascript ja zum beispiel objekte schleife objekte"}, {"id": 414, "start": 2859.3, "end": 2865.66, "text": "oder oder was gibt es was gibt es noch so schön kringiges in javascript ich"}, {"id": 415, "start": 2865.66, "end": 2871.58, "text": "meine gleich gleich gleich ist ja immer so ein bisschen so eine sache was gibt"}, {"id": 416, "start": 2871.58, "end": 2876.22, "text": "es so schön kringige sachen noch in javascript immer pein die immer richtig"}, {"id": 417, "start": 2876.22, "end": 2882.74, "text": "pein sind dass da auch wieder drei verschiedene variablen du kannst du kannst"}, {"id": 418, "start": 2882.74, "end": 2888.18, "text": "machen du kannst konst machen du kannst einfach so zuweisen ja das ist ein"}, {"id": 419, "start": 2888.18, "end": 2895.46, "text": "bissl inkonsequent aber es ergibt es ergibt in javascript sogar noch sinn"}, {"id": 420, "start": 2895.46, "end": 2899.42, "text": "weil javascript eben gewachsen ist in den letzten jahren und dadurch dass es im"}, {"id": 421, "start": 2899.42, "end": 2902.86, "text": "browser drin ist kannst du auch einfach alte sachen über bord schmeißen dass"}, {"id": 422, "start": 2902.86, "end": 2910.42, "text": "dann sachen nicht funktionieren get burrito dankeschön twitch prime gaming"}, {"id": 423, "start": 2910.42, "end": 2914.74, "text": "so type script muss ich ehrlich sagen ich habe ein bisschen was mit type"}, {"id": 424, "start": 2914.74, "end": 2922.18, "text": "script gemacht aber ich blick aber weiter noch nicht wirklich gut durch"}, {"id": 425, "start": 2922.18, "end": 2930.54, "text": "kommen wir mal html css in einem da bin ich echt nicht gut ich sag mal 50 also"}, {"id": 426, "start": 2930.54, "end": 2936.26, "text": "gerade css gerade css habe ich echt da komm ich meine ich kriege wer ich kriege"}, {"id": 427, "start": 2936.26, "end": 2941.66, "text": "webseiten frontend sind das ist kein kein ding aber ich bin gerade was css angeht"}, {"id": 428, "start": 2941.66, "end": 2944.62, "text": "bin ich immer wieder überrascht wie easy man sachen in css machen kann wenn man"}, {"id": 429, "start": 2944.62, "end": 2947.7, "text": "weiß was man macht ach moment hat er mir alles nicht beckent"}, {"id": 430, "start": 2947.7, "end": 2950.54, "text": "lull keck wait"}, {"id": 431, "start": 2950.98, "end": 2955.98, "text": "kennt ihr nicht die html das html beckent"}, {"id": 432, "start": 2955.98, "end": 2964.3, "text": "wenn ich das meinem chef zeige dann bekomme ich den java kurs kann schon sein"}, {"id": 433, "start": 2964.3, "end": 2970.78, "text": "o pp pp ja pp kann ich tatsächlich auch halbwegs brauchbar ich würde mal sagen"}, {"id": 434, "start": 2970.78, "end": 2976.54, "text": "so 50 50 hat jemand meine frage an den chat hat jemand von euch auf meinem"}, {"id": 435, "start": 2976.54, "end": 2982.26, "text": "battlefield 4 server gespielt damals wahrscheinlich nicht wahrscheinlich"}, {"id": 436, "start": 2982.26, "end": 2986.22, "text": "nicht schon so lange her wahrscheinlich was was der max hatten battlefield 4"}, {"id": 437, "start": 2986.22, "end": 2992.14, "text": "server gehabt und auf meinem battlefield 4 server hatte ich eine php ist der"}, {"id": 438, "start": 2992.14, "end": 2996.5, "text": "zeite da konntest du auf max fps.de gehen"}, {"id": 439, "start": 2996.5, "end": 3001.62, "text": "ich glaube slash battlefield 4 oder so oder hast du eine übersicht gesehen an"}, {"id": 440, "start": 3001.62, "end": 3006.18, "text": "statistiken von leuten ja genau auf nitrado genau da hast du eine statistik"}, {"id": 441, "start": 3006.18, "end": 3011.74, "text": "gesehen von kills und alle möglichen sachen von den leuten die auf dem server"}, {"id": 442, "start": 3011.74, "end": 3016.9, "text": "gespielt haben und das war mit php gemacht mit laravel laravel 08 oder so"}, {"id": 443, "start": 3016.9, "end": 3020.06, "text": "was damals es war glaube ich noch gar nicht raus das war wirklich das war"}, {"id": 444, "start": 3020.06, "end": 3026.14, "text": "wirklich nice und was halt was halt das coole war oder was immer noch das gute"}, {"id": 445, "start": 3026.14, "end": 3033.42, "text": "an am php ist das gibt es halt überall php du wirst kein host da finden php"}, {"id": 446, "start": 3033.42, "end": 3039.62, "text": "maria db oder php mai sql das sind einfach die dinger die jeder wenn ihr"}, {"id": 447, "start": 3039.62, "end": 3046.58, "text": "den den reutigsten letzten hinterwelt hauster der kann php und mai sql"}, {"id": 448, "start": 3046.58, "end": 3050.34, "text": "deswegen ist es nicht verkehrt man ein bisschen php kann"}, {"id": 449, "start": 3050.34, "end": 3056.5, "text": "ja laravel ist tatsächlich nice ich ach ja übrigens wenn wir von back end"}, {"id": 450, "start": 3056.5, "end": 3060.22, "text": "reden vielleicht mache ich den frontend weil von back end java script warum sind"}, {"id": 451, "start": 3060.22, "end": 3062.54, "text": "wir sind übrigens noch"}, {"id": 452, "start": 3062.54, "end": 3069.9, "text": "wir sind ja immer noch beim back end da würde ich sagen java script back end"}, {"id": 453, "start": 3069.9, "end": 3074.42, "text": "was nord js angeht vielleicht sollte man es doch nicht in frontend back end"}, {"id": 454, "start": 3074.42, "end": 3079.78, "text": "teilen ich mache nichts mit nord js ganz ehrlich ich habe keine ahnung von"}, {"id": 455, "start": 3079.78, "end": 3084.58, "text": "nord js ich kenne die nord js standard library nicht und nix ich kann java"}, {"id": 456, "start": 3084.58, "end": 3089.86, "text": "script ja aber ich habe von nord js kein plan mach ich mach back end nord js"}, {"id": 457, "start": 3089.86, "end": 3093.98, "text": "immer einen bogen drum ich meine ich krieg damit was gebacken wenn ich damit"}, {"id": 458, "start": 3093.98, "end": 3096.94, "text": "was basteln muss aber"}, {"id": 459, "start": 3099.3, "end": 3105.26, "text": "kein plan also ich verstehe auch ehrlich gesagt nicht warum ich nord js im"}, {"id": 460, "start": 3105.26, "end": 3109.62, "text": "back end verwenden sollte es sei denn also die der einzige grund der mir"}, {"id": 461, "start": 3109.62, "end": 3113.02, "text": "einfallen würde es gibt es okay es gibt zwei gründe die mir einfallen würden"}, {"id": 462, "start": 3113.02, "end": 3119.02, "text": "warum man nord im back end verwenden sollte das ist einmal weil man krasser"}, {"id": 463, "start": 3119.02, "end": 3124.66, "text": "frontend java script checker ist und eben im back end java script verwenden will"}, {"id": 464, "start": 3124.66, "end": 3129.58, "text": "man ist das einzige ist was man kann oder weil es irgendwelche super geilen npm"}, {"id": 465, "start": 3129.58, "end": 3133.22, "text": "packages gibt die ich verwenden will ansonsten hat irgendjemand jetzt mal"}, {"id": 466, "start": 3133.22, "end": 3136.5, "text": "ernsthaft hat sonst noch irgendjemand eine sinnvolle begründung für java"}, {"id": 467, "start": 3136.5, "end": 3142.98, "text": "script im back end ok leuchtet ein ja verstehe ich wobei ich das mit"}, {"id": 468, "start": 3142.98, "end": 3149.94, "text": "puppeteer.net mache puppeteer sharp heißt glaube ich ob es auch ein binding easy"}, {"id": 469, "start": 3149.94, "end": 3157.38, "text": "aufzusetzen gut sind andere sachen auch gleiche codebase ja ok"}, {"id": 470, "start": 3157.38, "end": 3183.58, "text": "das ist ja schon alt aber trifft immer wieder gut ist aber halt die realität"}, {"id": 471, "start": 3183.58, "end": 3194.1, "text": "ja das sage ich ja wenn man sich auskennt im frontend aber ansonsten ja"}, {"id": 472, "start": 3194.1, "end": 3199.34, "text": "dann machen wir noch generell mal hier dort das müssen wir anders nennen das"}, {"id": 473, "start": 3199.34, "end": 3203.78, "text": "muss ich irgendwie platt platforms oder sowas keine ahnung wie nennt man das"}, {"id": 474, "start": 3203.78, "end": 3210.18, "text": "runtimes mit dort nett kenne ich mich auch ziemlich gut aus an sich also ich"}, {"id": 475, "start": 3210.18, "end": 3217.66, "text": "könnte theoretisch auf wichelt basic.net programmieren aber ich will"}, {"id": 476, "start": 3217.66, "end": 3221.42, "text": "kein wichelt basic.net programmieren"}, {"id": 477, "start": 3224.58, "end": 3231.58, "text": "f sharp habe ich noch nie was gemacht mit außer mal in hello world oder so der"}, {"id": 478, "start": 3231.58, "end": 3242.46, "text": "frame frameworks der frameworks trifft sie eigentlich nicht ja machen wir mal"}, {"id": 479, "start": 3242.46, "end": 3247.18, "text": "weiter ok was für was für programmier sprachen krieg ich sonst noch krieg ich"}, {"id": 480, "start": 3247.18, "end": 3250.26, "text": "sonst noch zusammen ok ich weiß was wir brauchen"}, {"id": 481, "start": 3250.26, "end": 3260.9, "text": "oder best best zählt besser als eigene sprache gar ist es ja im prinzip best"}, {"id": 482, "start": 3260.9, "end": 3270.5, "text": "kann ich nicht schlecht sie hast du sicher auch schon benutzt ja das würde"}, {"id": 483, "start": 3270.5, "end": 3274.86, "text": "ich mal hier mit rein zählen wobei ich halt sagen würde z ist an sich eine"}, {"id": 484, "start": 3274.86, "end": 3278.74, "text": "super geschichte aber z plus plus ist kacke"}, {"id": 485, "start": 3281.9, "end": 3288.22, "text": "assembler naja also ich kann eine schleife in assembler machen was"}, {"id": 486, "start": 3288.22, "end": 3292.38, "text": "wahrscheinlich auch wieder mehr ist als 99,999 prozent der weltbevölkerung können"}, {"id": 487, "start": 3292.38, "end": 3320.26, "text": "aber wirklich gut nicht"}, {"id": 488, "start": 3320.26, "end": 3323.5, "text": "was empfiehlst du denn fürs back end was willst du denn machen"}, {"id": 489, "start": 3323.5, "end": 3329.62, "text": "battle schieb dann kann ich dir auch was sagen"}, {"id": 490, "start": 3331.42, "end": 3336.86, "text": "awk ist auch nur sprachig aber das awk und seht und sonst fast zähle ich da"}, {"id": 491, "start": 3336.86, "end": 3342.3, "text": "jetzt nicht auf perl allah"}, {"id": 492, "start": 3342.3, "end": 3351.3, "text": "was oft exes immer schlimmer also wenn du mir sagst dass du machen willst kann"}, {"id": 493, "start": 3351.3, "end": 3355.62, "text": "ich dir aus einfaches kleines webprojekt mit datenbank dahinter"}, {"id": 494, "start": 3355.62, "end": 3361.22, "text": "sq light oder richtig echte datenbank ich persönlich bin ja sq light fern für"}, {"id": 495, "start": 3361.22, "end": 3365.86, "text": "kleinen kram ja also ich würde hiermit machen ich"}, {"id": 496, "start": 3365.86, "end": 3372.14, "text": "würde sp.net verwenden sp.net core bitte schön ich sp.net sp.net ist sachen aus der"}, {"id": 497, "start": 3372.14, "end": 3377.74, "text": "steinzeit ich ich verwende gerne sp.net core allerdings ganz ehrlich wenn ich"}, {"id": 498, "start": 3377.74, "end": 3381.82, "text": "nicht schon sich habe könnte ich würde wahrscheinlich das da nehmen also wenn ich"}, {"id": 499, "start": 3381.82, "end": 3386.78, "text": "wirklich das minimalste am minimalsten brauche im back end dann würde ich das"}, {"id": 500, "start": 3386.78, "end": 3400.3, "text": "hier nehmen example"}, {"id": 501, "start": 3400.3, "end": 3423.22, "text": "hallo example das sind nur drei zeilen example soll ich mich veräppeln ja das"}, {"id": 502, "start": 3423.22, "end": 3427.98, "text": "alles was du machen musst oder kriegst du wenn du die wenn du die"}, {"id": 503, "start": 3427.98, "end": 3436.06, "text": "seite aufruf steht dann hello world drauf also das finde ich nice also wenn ich"}, {"id": 504, "start": 3436.06, "end": 3439.94, "text": "was ganz ganz kleines minimales brauchen würde und nicht so ein großer c sharp"}, {"id": 505, "start": 3439.94, "end": 3445.02, "text": "fanboy wäre das ist quasi ein bisschen wie senatra für ruby genau dann würde"}, {"id": 506, "start": 3445.02, "end": 3452.14, "text": "ich das verwenden was ist genau back end und was frontend das ist einfach zu"}, {"id": 507, "start": 3452.14, "end": 3456.94, "text": "beantworten frontend ist alles was bei dir auf dem rechner im browser läuft"}, {"id": 508, "start": 3456.94, "end": 3463.98, "text": "back end ist alles was auf dem server läuft das kann man das ist tatsächlich"}, {"id": 509, "start": 3463.98, "end": 3467.38, "text": "mal eine sache die kann man relativ einfach trennen und klassifizieren"}, {"id": 510, "start": 3467.38, "end": 3471.1, "text": "normalerweise ist die antwort immer so grau so ja aber es gibt auch so was und"}, {"id": 511, "start": 3471.1, "end": 3474.66, "text": "es gibt was in der mitte da gibt es eigentlich nichts in der mitte frontend"}, {"id": 512, "start": 3474.66, "end": 3478.18, "text": "ist alles was bei dir auf dem rechner im browser läuft und back end ist alles"}, {"id": 513, "start": 3478.18, "end": 3481.38, "text": "was auf dem server läuft fertig das kann man in dem fall tatsächlich mal ganz"}, {"id": 514, "start": 3481.38, "end": 3494.18, "text": "gut trennen was ist mit plays a server side rendering das ist server side und"}, {"id": 515, "start": 3494.18, "end": 3497.42, "text": "sobald sie auf dem klein sind die seiten und dort irgendwas dynamisch läuft dann"}, {"id": 516, "start": 3497.42, "end": 3502.14, "text": "ist es frontend da ist es kleinzeit das kann man schon relativ einfach trennen"}, {"id": 517, "start": 3502.14, "end": 3510.98, "text": "also alles interaktive alles interaktive ist klein seit ich ja und selbst wenn es"}, {"id": 518, "start": 3510.98, "end": 3514.66, "text": "über irgendwelche signal a geschichten geht letztendlich wird die webseite im"}, {"id": 519, "start": 3514.66, "end": 3517.66, "text": "klein gerendert"}, {"id": 520, "start": 3522.42, "end": 3527.1, "text": "es gibt ja so was in der richtung schon du kannst ja beispielsweise dort net"}, {"id": 521, "start": 3527.1, "end": 3534.38, "text": "komplett in web assembly laufen lassen dann kannst du theoretisch auch dein"}, {"id": 522, "start": 3534.38, "end": 3539.54, "text": "backends im frontend machen aber dann ist es halt kein backend mehr sondern"}, {"id": 523, "start": 3539.54, "end": 3542.78, "text": "es ist ein teil von einem frontend"}, {"id": 524, "start": 3542.98, "end": 3547.22, "text": "ja razor pages ist auch server side rendering und dann auf dem klein und"}, {"id": 525, "start": 3547.22, "end": 3550.66, "text": "sobald du da was interaktives macht mit javascript oder sonst wie dann ist es"}, {"id": 526, "start": 3550.66, "end": 3557.66, "text": "wieder frontend also ich finde das kann man schon relativ klar trennen so was"}, {"id": 527, "start": 3557.66, "end": 3565.14, "text": "macht man wenn man übermüdet ist schlafen würde ich sagen also wenn man"}, {"id": 528, "start": 3565.14, "end": 3571.18, "text": "übermüdet ist eine steckdose aufmachen ist glaube ich nicht so eine gute idee"}, {"id": 529, "start": 3576.54, "end": 3582.46, "text": "gibt es mittelend nee so was gibt es nicht es gibt es gibt so was wie"}, {"id": 530, "start": 3582.46, "end": 3588.78, "text": "mittelware was man ab und zu verwendet wird als teile von irgendeiner server"}, {"id": 531, "start": 3588.78, "end": 3599.82, "text": "pipeline oder sowas das ist aber auch backends so also weiter was für"}, {"id": 532, "start": 3599.82, "end": 3604.7, "text": "programmiersprachen habe ich jetzt noch was habe ich jetzt noch vergessen"}, {"id": 533, "start": 3604.98, "end": 3613.54, "text": "da man besch so irgendwas vergessen kann ich sonst noch irgendwas haben"}, {"id": 534, "start": 3613.54, "end": 3622.54, "text": "irgendwas im stream gemacht javascript bap go java c++ bei schruby c sharp"}, {"id": 535, "start": 3622.54, "end": 3627.42, "text": "wird heute noch was geprogrammt wahrscheinlich nicht programming"}, {"id": 536, "start": 3627.42, "end": 3632.34, "text": "languages wir gucken einfach mal ob ich da irgendwas ganz offensichtlich ist"}, {"id": 537, "start": 3632.34, "end": 3636.86, "text": "übersehen habe wo ich jetzt einfach nicht dran denke ok pausen ja was gibt"}, {"id": 538, "start": 3636.86, "end": 3641.18, "text": "es die scharpe ccgo r nein habe ich kein swift habe ich auch kein plan von"}, {"id": 539, "start": 3641.18, "end": 3648.34, "text": "ach groovy du hast recht groovy kann ich tatsächlich das ist das einzige was ich"}, {"id": 540, "start": 3648.34, "end": 3654.22, "text": "jemals an projekt ab oder sagen wir mal in anfangen abgeschlossen habe auf der"}, {"id": 541, "start": 3654.22, "end": 3677.22, "text": "jvm groovy tatsächlich ja habe ich habe ich tatsächlich mal gemacht"}, {"id": 542, "start": 3677.22, "end": 3685.66, "text": "javascript bap css typescript ruby c swift habe ich kein plan von"}, {"id": 543, "start": 3685.66, "end": 3688.98, "text": "objective c und er habe ich auch kein plan von schell hatte ich skala kein plan"}, {"id": 544, "start": 3688.98, "end": 3695.38, "text": "von go power shell ich habe eine sache bisher die letzten jahre über mal in"}, {"id": 545, "start": 3695.38, "end": 3699.22, "text": "power shell gemacht aber das würde ich nicht sagen als hellig großen plan von"}, {"id": 546, "start": 3699.22, "end": 3707.94, "text": "power shell und perl habe ich auch keine großartung ja gut flatter ist eher so"}, {"id": 547, "start": 3707.94, "end": 3717.98, "text": "was wie richtung dart frameworks noch dabei kommt es war auch noch easy"}, {"id": 548, "start": 3717.98, "end": 3725.22, "text": "flatter da es zehn prozent vielleicht ich habe schon mal ein beispielprojekt"}, {"id": 549, "start": 3725.22, "end": 3734.94, "text": "gemacht sql soll ich sql dabei schreiben ja das problem bei sql ist sql bin ich"}, {"id": 550, "start": 3734.94, "end": 3751.34, "text": "schlecht also sql also sql queries schreiben habe ich keinen plan wieso ich"}, {"id": 551, "start": 3751.34, "end": 3756.9, "text": "das mache weil ich mal vor über einem jahr meinem chef gesagt habe ich will ein"}, {"id": 552, "start": 3756.9, "end": 3760.1, "text": "bisschen mehr programmierstelle machen hat gesagt ja müssen wir ein bisschen"}, {"id": 553, "start": 3760.1, "end": 3763.98, "text": "rumgucken da habe ich zu ihm gesagt ja ich schicke dir einfach mal eine"}, {"id": 554, "start": 3763.98, "end": 3768.78, "text": "übersichtseite mit sachen die ich gut kann und das habe ich mich jetzt über"}, {"id": 555, "start": 3768.78, "end": 3772.66, "text": "ein jahr wieder verdrängt das ganze ich habe mir gedacht jetzt mache ich das"}, {"id": 556, "start": 3772.66, "end": 3778.58, "text": "einfach mal soft skills oh ja dass das muss sein"}, {"id": 557, "start": 3778.58, "end": 3783.14, "text": "soft skills ok scrum"}, {"id": 558, "start": 3783.14, "end": 3793.54, "text": "ops scrum eitel kann bahn ein moment das muss man linkser ich schreibe jetzt"}, {"id": 559, "start": 3793.54, "end": 3796.9, "text": "einfach einfach irgendwas rein"}, {"id": 560, "start": 3796.9, "end": 3814.38, "text": "ajay lean die schäbte schäbte teams"}, {"id": 561, "start": 3814.38, "end": 3828.14, "text": "das aber noch sonst so schön ist test driven development clean code"}, {"id": 562, "start": 3828.58, "end": 3835.82, "text": "block chain a block chain sind keine soft skills iot iot muss auch noch irgendwo"}, {"id": 563, "start": 3835.82, "end": 3839.02, "text": "rein ich weiß ich weiß bloß noch nicht wo er weiß"}, {"id": 564, "start": 3839.02, "end": 3853.9, "text": "bloß noch nicht wo voll voll das ist aber auch kein soft skill full stack ja"}, {"id": 565, "start": 3853.9, "end": 3860.82, "text": "ok man wollte es jetzt nicht übertreiben die hälfte davon habe ich habe ich"}, {"id": 566, "start": 3860.82, "end": 3863.98, "text": "eigentlich auch kein plan aber das witzige ist dass eigentlich keiner so"}, {"id": 567, "start": 3863.98, "end": 3867.98, "text": "wirklich plan davon hatten einfach so tut als ob"}, {"id": 568, "start": 3867.98, "end": 3872.74, "text": "ok wunderbar wunderbar"}, {"id": 569, "start": 3872.98, "end": 3879.26, "text": "team fähig konstruktiv innovationsfreudig also zusammengefasst"}, {"id": 570, "start": 3879.26, "end": 3882.1, "text": "5 hat"}, {"id": 571, "start": 3883.18, "end": 3887.62, "text": "ist ihr was das schlimme ist das fällt überhaupt nicht auf zwischen diesen"}, {"id": 572, "start": 3887.62, "end": 3890.66, "text": "dämlichen buzz words dass da 5 hat steht das sieht so aus als gehört es da"}, {"id": 573, "start": 3890.66, "end": 3893.18, "text": "einfach rein"}, {"id": 574, "start": 3893.18, "end": 3902.18, "text": "jammel jammel schreibe noch ein genau aber jammel"}, {"id": 575, "start": 3907.38, "end": 3916.66, "text": "ja doch er kommt bei der bei def ob skills da kann ich kann aber tippen"}, {"id": 576, "start": 3916.66, "end": 3925.74, "text": "jason jason jason von 100 prozent ich kann sogar jammel variablen und so"}, {"id": 577, "start": 3927.58, "end": 3930.58, "text": "easy"}, {"id": 578, "start": 3931.66, "end": 3935.94, "text": "xml 9 xml schreibe ich da erst gar nicht rein reicht mir schon das microsoft"}, {"id": 579, "start": 3935.94, "end": 3943.66, "text": "zu sehr auf xml steht frontend frameworks oh ja ja ja dass das vielleicht auch"}, {"id": 580, "start": 3943.66, "end": 3951.14, "text": "nicht schlecht ok frontend frameworks ich kann eigentlich nur vgs kann ich"}, {"id": 581, "start": 3951.14, "end": 3957.74, "text": "was kann ich denn sonst noch doch das stimmte ich kann kraft ql"}, {"id": 582, "start": 3964.26, "end": 3967.06, "text": "kann ich denn da kann ich kann ich überhaupt irgendwas"}, {"id": 583, "start": 3967.06, "end": 3974.66, "text": "die react kann ich nicht habe ich noch nie verwendet bin ich der große frontend"}, {"id": 584, "start": 3974.66, "end": 3979.1, "text": "lara lara im beck ja das kann man"}, {"id": 585, "start": 3980.62, "end": 3984.22, "text": "ich weiß übrigens gar nicht wie man schreibt mit l oder mit l stopp mit einem"}, {"id": 586, "start": 3984.22, "end": 3991.06, "text": "l angular ne angular schreibe ich da nicht rein da muss ich ja noch was in"}, {"id": 587, "start": 3991.06, "end": 3995.78, "text": "angular machen die 100 prozent lull keg weight ich habe das vor fünf jahren mal"}, {"id": 588, "start": 3995.78, "end": 4002.74, "text": "verwendet für irgendwie eine kleine seite lull man muss prinzipiell gar"}, {"id": 589, "start": 4002.74, "end": 4005.58, "text": "nichts auf haben ich schreibe gerade einfach alles auf ich werde es auch nicht"}, {"id": 590, "start": 4005.58, "end": 4009.54, "text": "eins zu eins meinem chef so schicken oder so"}, {"id": 591, "start": 4011.78, "end": 4017.26, "text": "was was habe ich noch für ahnung ich meine vba"}, {"id": 592, "start": 4017.26, "end": 4026.1, "text": "pains chat bloß nicht kein vba hört mir auf"}, {"id": 593, "start": 4031.9, "end": 4038.14, "text": "euer tailwind kann ich jetzt ein bisschen haben wir letztens geübt"}, {"id": 594, "start": 4039.42, "end": 4042.1, "text": "ich wollte noch schnell habe ich irgendwelche programmier sprachen"}, {"id": 595, "start": 4042.1, "end": 4048.46, "text": "vergessen nein sieht nicht so aus alles klar exzellent ja das wusste ich alles"}, {"id": 596, "start": 4048.46, "end": 4053.22, "text": "auflisten so ich gerade programmier sprachen sind schon mal nicht verkehrt"}, {"id": 597, "start": 4053.22, "end": 4058.54, "text": "bootstrap ruby haben wir drin hier guck ruby"}, {"id": 598, "start": 4063.14, "end": 4067.54, "text": "ich werde es auch nicht so abgeben ich schreibe einfach alles ich schreibe jetzt"}, {"id": 599, "start": 4067.54, "end": 4071.26, "text": "einfach alles drauf jetzt machen wir mal jetzt kommen massif der fob skills"}, {"id": 600, "start": 4071.26, "end": 4080.18, "text": "brauchen wir jetzt huge also erst mal erst mal shit"}, {"id": 601, "start": 4083.14, "end": 4092.18, "text": "puppet habe ich ganz gut ansible kann ich mittlerweile ganz gut jenkins kann ich"}, {"id": 602, "start": 4092.18, "end": 4101.62, "text": "ganz gut github actions kann ich ganz gut github an sich kann ich wunderbar"}, {"id": 603, "start": 4101.62, "end": 4106.58, "text": "verwende jeder mittlerweile shit und shit hab"}, {"id": 604, "start": 4113.02, "end": 4121.02, "text": "was fast verum moment defops roadmap wir lassen uns jetzt einfach mal"}, {"id": 605, "start": 4121.02, "end": 4129.7, "text": "inspirieren der fob roadmap also das schreibe ich da doch nicht drauf ich"}, {"id": 606, "start": 4129.7, "end": 4132.62, "text": "schreibe da noch nicht screen und die markt drauf dachte kommt man kommt man"}, {"id": 607, "start": 4132.62, "end": 4135.86, "text": "kommt sich der leser verarscht vor"}, {"id": 608, "start": 4138.74, "end": 4145.86, "text": "man best scripting wim wim wim ich weiß nicht wo das hinkommt das muss hier unter"}, {"id": 609, "start": 4145.86, "end": 4153.02, "text": "linux oder genau wim excellent wim skills"}, {"id": 610, "start": 4158.3, "end": 4165.14, "text": "ja diesen ganzen krempel hier könnte ich da auch noch hinschreiben also ich"}, {"id": 611, "start": 4165.14, "end": 4169.78, "text": "habe ich habe ahnung von nginx ich habe ahnung wir machen mal laut balancer in"}, {"id": 612, "start": 4169.78, "end": 4178.54, "text": "einem trafik weiß nicht wie man den kram schreibt irgendwie so"}, {"id": 613, "start": 4179.22, "end": 4181.74, "text": "habe ich richtig geschrieben hätte ich gar nicht gedacht"}, {"id": 614, "start": 4181.74, "end": 4185.74, "text": "apache ist pains gempt das schreibe ich nicht drauf aber kennst du das ganz gut"}, {"id": 615, "start": 4185.74, "end": 4191.02, "text": "mit mit aus habe ich das falsch geschrieben oder"}, {"id": 616, "start": 4191.02, "end": 4197.1, "text": "ach doch habe ich falsch geschrieben das sind aussicht zu zungenbrecher immer"}, {"id": 617, "start": 4197.1, "end": 4206.78, "text": "ja das nicht verkehrt hinzuschreiben so konsul ist das in irgendwelche key"}, {"id": 618, "start": 4206.78, "end": 4220.1, "text": "value store gedöns es da bin ich ja der der richtiges skiller im es also"}, {"id": 619, "start": 4220.1, "end": 4226.18, "text": "windows windows webserver cloud fehlen cloud hatten wir hier cloud aber da"}, {"id": 620, "start": 4226.18, "end": 4232.34, "text": "da fehlen die die da fehlt noch einiges ja"}, {"id": 621, "start": 4233.54, "end": 4238.46, "text": "es ist ja der forst habe ich keinen plan von ich kenne mich eigentlich nur ganz"}, {"id": 622, "start": 4238.46, "end": 4245.42, "text": "gut mit jenkins und github actions aus ja vm wir virtualisierungs kram vielleicht"}, {"id": 623, "start": 4245.42, "end": 4247.54, "text": "noch"}, {"id": 624, "start": 4248.1, "end": 4253.06, "text": "virtualisierung da habe ich aber eigentlich gar keinen plan von da habe"}, {"id": 625, "start": 4253.06, "end": 4259.26, "text": "ich echt keinen plan von ich meine ich kann vm installieren aber ich habe keine"}, {"id": 626, "start": 4259.26, "end": 4268.3, "text": "ahnung von von irgendwie esx administration oder so was das kann ich"}, {"id": 627, "start": 4268.3, "end": 4271.86, "text": "da auch nicht reinschreiben weil wenn es eine sache gibt mit der sich mal chef"}, {"id": 628, "start": 4271.86, "end": 4277.3, "text": "auskennt ist es ex-administration da hatte echt ahnung von das hat er früher"}, {"id": 629, "start": 4277.3, "end": 4284.58, "text": "gemacht da weiß er bescheid da weiß er echt bescheid er kennt kann in den raffer"}, {"id": 630, "start": 4284.58, "end": 4291.54, "text": "reinschreiben einfach joko groups erwähnen ja kann ich dann auch noch"}, {"id": 631, "start": 4291.54, "end": 4294.3, "text": "schreibt er ich habe dann auch die docker stellz brauche man natürlich auch"}, {"id": 632, "start": 4294.3, "end": 4301.82, "text": "noch hier natürlich natürlich natürlich sack sack natürlich das muss"}, {"id": 633, "start": 4301.82, "end": 4308.14, "text": "ja auch noch alles bei der fob skills reiner docker docker kompose"}, {"id": 634, "start": 4308.94, "end": 4313.5, "text": "wird es eine liste fürs arbeitszeug ist weder noch ich schreibe ich ich ich habe"}, {"id": 635, "start": 4313.5, "end": 4317.14, "text": "mir jetzt über ich schreibe erst mal alles auf was ich irgendwie kann und dann"}, {"id": 636, "start": 4317.14, "end": 4322.3, "text": "gucke ich mal nach was man damit dann anfängt so was haben die hier noch"}, {"id": 637, "start": 4322.3, "end": 4327.74, "text": "schönes trinchen ihrer defops liste sonst nichts oder alibaba cloud die"}, {"id": 638, "start": 4327.74, "end": 4334.3, "text": "chinesen cloud wollen wir uns mal einen test warum warum warum warum ist die"}, {"id": 639, "start": 4334.3, "end": 4339.14, "text": "warum ist die alibaba cloud warum gibt es da eigentlich kein häkchen dran"}, {"id": 640, "start": 4339.14, "end": 4344.5, "text": "was ist das wieder für rassistischer höchst rassistische liste die chinesen"}, {"id": 641, "start": 4344.5, "end": 4351.26, "text": "werden ausgegrenzt leute china chinesen cloud wird nicht verwendet ich meine es"}, {"id": 642, "start": 4351.26, "end": 4354.22, "text": "könnte vielleicht was damit zu tun haben dass das datenschutz technisch"}, {"id": 643, "start": 4354.22, "end": 4365.7, "text": "bedenklich ist aber nein kann ich sein die china cloud so alibaba cloud wie kann"}, {"id": 644, "start": 4365.7, "end": 4368.58, "text": "man sich da anmelden zu"}, {"id": 645, "start": 4368.94, "end": 4376.62, "text": "zehn zwölf monate free trial ja per ich will jetzt die alibaba cloud"}, {"id": 646, "start": 4376.62, "end": 4387.7, "text": "haben das sind doch stock images das ist doch gar nix für die"}, {"id": 647, "start": 4387.7, "end": 4393.3, "text": "ops jetzt hätte ich fast leute beinahe beinahe hätte ich blok ausgemacht"}, {"id": 648, "start": 4393.3, "end": 4396.1, "text": "warum hätte ich warum will ich den blok ausmachen ausgerechnet auf der"}, {"id": 649, "start": 4396.1, "end": 4404.58, "text": "chinesen cloud so kann man sich da free account ich war mir jetzt einfach ein"}, {"id": 650, "start": 4404.58, "end": 4418.66, "text": "fake account alle fake account account so so germany your mail ja ja alles klar"}, {"id": 651, "start": 4418.66, "end": 4428.38, "text": "ok 10 minute mail brauchen wir jetzt wir brauchen hier so ein fake das da"}, {"id": 652, "start": 4428.38, "end": 4433.26, "text": "register enter your passport das sage ich euch nicht das password"}, {"id": 653, "start": 4433.26, "end": 4437.9, "text": "das password muss ich mir auch mal kurz aufschreiben"}, {"id": 654, "start": 4440.14, "end": 4443.9, "text": "ok passt perfekt"}, {"id": 655, "start": 4443.9, "end": 4461.54, "text": "ok confirm save was"}, {"id": 656, "start": 4461.54, "end": 4472.1, "text": "ja ok notification vor wo ist die"}, {"id": 657, "start": 4473.5, "end": 4481.58, "text": "bei faun nein nicht bei faun bei faun oder kennst du an unbox net nee habe ich"}, {"id": 658, "start": 4481.58, "end": 4492.02, "text": "noch nicht ausprobiert ist das deine webseite und du machst promotion oder ist"}, {"id": 659, "start": 4492.02, "end": 4499.18, "text": "es wie sagt bloß die haben das geplogged"}, {"id": 660, "start": 4499.18, "end": 4505.46, "text": "achso ich muss send noch erst klicken ich kacke kacke noob kostenlosen faun"}, {"id": 661, "start": 4505.46, "end": 4511.46, "text": "von alibar das probieren wir jetzt aus probiert aus aliexpress cloud china"}, {"id": 662, "start": 4511.46, "end": 4516.66, "text": "chinesen cloud alter kommt nicht an"}, {"id": 663, "start": 4520.46, "end": 4524.9, "text": "so wie wie wie machen wir das jetzt"}, {"id": 664, "start": 4525.62, "end": 4531.46, "text": "dies bestimmt ist bestimmt blacklisted ist alle ex auf hier"}, {"id": 665, "start": 4531.46, "end": 4538.7, "text": "big bang obhigh rose firefight"}, {"id": 666, "start": 4547.4, "end": 4557.58, "text": "success voll der崴 individual account fast nämn peter akile"}, {"id": 667, "start": 4557.58, "end": 4586.34, "text": "agilé french e adresse ja zeil eins bangfurt am ein hessen"}, {"id": 668, "start": 4586.34, "end": 4596.5, "text": "geht nicht ich muss mal kurz den dark reader aus machen leute hessen nein oder faun"}, {"id": 669, "start": 4616.34, "end": 4622.78, "text": "und 1 5 1 die woher wollen die woher wollen die wissen dass es nicht eine"}, {"id": 670, "start": 4622.78, "end": 4646.34, "text": "valid nummer ist ohne null fuck identity verification was ist was ist mit den"}, {"id": 671, "start": 4646.34, "end": 4658.54, "text": "chinesen los warum interessiert die das überhaupt buber okay was ist wenn ich"}, {"id": 672, "start": 4658.54, "end": 4669.46, "text": "jetzt enterprise mach da brauche ich auch verification id shit den voter von"}, {"id": 673, "start": 4669.46, "end": 4677.3, "text": "kund blue, okay okay sab mit was"}, {"id": 674, "start": 4677.3, "end": 4701.34, "text": "Mist wie kriege ich jetzt ein Fake Telefon noch mal her?"}, {"id": 675, "start": 4701.34, "end": 4705.9, "text": "Scheiße Was ist das free online phone ja perfekt"}, {"id": 676, "start": 4705.9, "end": 4709.86, "text": "Free online phone sehr gut sehr gut"}, {"id": 677, "start": 4709.86, "end": 4715.46, "text": "4.9 gibt es keinen gibt es kein German"}, {"id": 678, "start": 4715.46, "end": 4730.02, "text": "Tinder Accounts Alter"}, {"id": 679, "start": 4730.02, "end": 4732.98, "text": "Ach man muss jetzt bloß 4.9 nehmen"}, {"id": 680, "start": 4732.98, "end": 4735.78, "text": "Ach scheiße man oh nee jetzt habe ich das zu gemacht"}, {"id": 681, "start": 4735.78, "end": 4742.94, "text": "Oh knapp Stimmt landender"}, {"id": 682, "start": 4742.94, "end": 4743.94, "text": "Nee land kann man ja auch nicht"}, {"id": 683, "start": 4743.94, "end": 4750.42, "text": "Ok dann scheiße das funktioniert nicht"}, {"id": 684, "start": 4750.42, "end": 4755.1, "text": "Ok"}, {"id": 685, "start": 4755.1, "end": 4763.1, "text": "Was temp sms.net kann man das aufmachen?"}, {"id": 686, "start": 4763.1, "end": 4769.98, "text": "Temp sms.net ok ich hoffe das gibt es jetzt keine Pornwerbung drauf oder so"}, {"id": 687, "start": 4769.98, "end": 4772.66, "text": "German"}, {"id": 688, "start": 4772.66, "end": 4776.82, "text": "Chinese Nummer"}, {"id": 689, "start": 4776.82, "end": 4779.86, "text": "Wo sind die German Numbers Leute?"}, {"id": 690, "start": 4779.86, "end": 4783.94, "text": "Wo sind die German Temporary Numbers Germany?"}, {"id": 691, "start": 4783.94, "end": 4786.26, "text": "Ok"}, {"id": 692, "start": 4786.26, "end": 4790.9, "text": "Alles klar Bäm das brauchen wir jetzt"}, {"id": 693, "start": 4790.9, "end": 4795.1, "text": "Das ist wahrscheinlich schon belegt send"}, {"id": 694, "start": 4795.1, "end": 4800.1, "text": "Ok"}, {"id": 695, "start": 4800.1, "end": 4817.42, "text": "So und jetzt ist die Frage"}, {"id": 696, "start": 4817.42, "end": 4820.22, "text": "Was machen die denn da rufen die da jetzt an oder schicken die da"}, {"id": 697, "start": 4820.22, "end": 4827.82, "text": "Als ob da jemand sein Amazon Account ja doch da hat jemand sein Amazon Account drauf registriert"}, {"id": 698, "start": 4827.82, "end": 4833.74, "text": "Sag mal die machen online Banking da drüber"}, {"id": 699, "start": 4833.74, "end": 4835.98, "text": "Die machen ernsthaft online Banking da drüber"}, {"id": 700, "start": 4835.98, "end": 4841.62, "text": "Die Leute"}, {"id": 701, "start": 4841.62, "end": 4845.66, "text": "Scheiße ok das funktioniert glaube ich nicht"}, {"id": 702, "start": 4845.66, "end": 4853.42, "text": "Appeal oh nee"}, {"id": 703, "start": 4853.42, "end": 4869.94, "text": "Wie kriege ich mich da registriert Reobtain"}, {"id": 704, "start": 4869.94, "end": 4873.82, "text": "Nee das funktioniert nicht"}, {"id": 705, "start": 4873.82, "end": 4889.22, "text": "Ok das tut nicht Temp SMS wo hat Temp SMS haben die irgendwie Germany"}, {"id": 706, "start": 4889.22, "end": 4910.1, "text": "Das Problem ist wahrscheinlich hat sich schon längst jemand mit dieser Nummer bei Aliexpress"}, {"id": 707, "start": 4910.1, "end": 4911.1, "text": "registriert"}, {"id": 708, "start": 4911.1, "end": 4914.02, "text": "Handy Nummer ich gebe doch da jetzt keine gültige Handy Nummer ein"}, {"id": 709, "start": 4914.02, "end": 4920.18, "text": "Receive SMS Punkt kommen ok easy machen wir jetzt"}, {"id": 710, "start": 4920.18, "end": 4945.06, "text": "Noch hier zu outen ok perfekt"}, {"id": 711, "start": 4945.06, "end": 4953.58, "text": "Whatsapp Alter was da alles für Zeug drin liegt"}, {"id": 712, "start": 4953.58, "end": 4966.5, "text": "Jalla online Casino"}, {"id": 713, "start": 4966.5, "end": 4969.26, "text": "Von Susi196601 alles klar"}, {"id": 714, "start": 4969.26, "end": 4981.5, "text": "Auch Chinesen macht hinne ey"}, {"id": 715, "start": 4981.5, "end": 4982.5, "text": "China Chinesen Mensch"}, {"id": 716, "start": 4982.5, "end": 4989.18, "text": "Ich nehme keine Nummern von euch hallo"}, {"id": 717, "start": 4989.18, "end": 4999.9, "text": "Nein entweder das geht hier mit oder es"}, {"id": 718, "start": 4999.9, "end": 5000.9, "text": "Mensch warum geht das nicht"}, {"id": 719, "start": 5000.9, "end": 5021.3, "text": "V-SIM-Card"}, {"id": 720, "start": 5021.3, "end": 5048.98, "text": "Die haben es erkannt dass ich Fake Accounts machen will"}, {"id": 721, "start": 5048.98, "end": 5050.34, "text": "Ok wir probieren jetzt noch was aus"}, {"id": 722, "start": 5050.34, "end": 5059.26, "text": "Ok hier tut es nichts ok dann probieren wir den jetzt noch aus"}, {"id": 723, "start": 5059.26, "end": 5067.9, "text": "Fake Nummer ok next Aliexpress"}, {"id": 724, "start": 5067.9, "end": 5072.9, "text": "Zack"}, {"id": 725, "start": 5072.9, "end": 5076.82, "text": "So wenn das jetzt nicht geht haben wir gelitten"}, {"id": 726, "start": 5076.82, "end": 5079.06, "text": "Aber auf alle Captain Peng Dankeschön für die Zaps"}, {"id": 727, "start": 5079.06, "end": 5082.98, "text": "Jaja"}, {"id": 728, "start": 5082.98, "end": 5089.26, "text": "Ich glaube Tank-Code"}, {"id": 729, "start": 5089.26, "end": 5093.86, "text": "Was"}, {"id": 730, "start": 5093.86, "end": 5094.86, "text": "Ich glaube die haben mich geblockt"}, {"id": 731, "start": 5094.86, "end": 5113.38, "text": "Oh nee keine Ads please"}, {"id": 732, "start": 5113.38, "end": 5134.02, "text": "Ich bin geblockt ok"}, {"id": 733, "start": 5134.02, "end": 5135.86, "text": "Ok kein Aliexpress Account Leute"}, {"id": 734, "start": 5135.86, "end": 5141.9, "text": "Kein Chinesen Account"}, {"id": 735, "start": 5141.9, "end": 5147.74, "text": "Enterprise Account Lul"}, {"id": 736, "start": 5147.74, "end": 5148.74, "text": "Fuck"}, {"id": 737, "start": 5148.74, "end": 5153.34, "text": "Ok keine Chance"}, {"id": 738, "start": 5153.34, "end": 5160.98, "text": "Keine Chance keine China Chinesen"}, {"id": 739, "start": 5160.98, "end": 5169.9, "text": "Das ist was anderes oder"}, {"id": 740, "start": 5169.9, "end": 5175.34, "text": "Das ist das ist doch was anderes"}, {"id": 741, "start": 5175.34, "end": 5196.62, "text": "V123456 ok Leute keine Chance"}, {"id": 742, "start": 5196.62, "end": 5197.62, "text": "Vorbei"}, {"id": 743, "start": 5197.62, "end": 5207.78, "text": "Grip Aliexpress Alter"}, {"id": 744, "start": 5207.78, "end": 5209.78, "text": "Wie im Moment"}, {"id": 745, "start": 5209.78, "end": 5210.78, "text": "Warum geht denn das jetzt auf einmal"}, {"id": 746, "start": 5210.78, "end": 5212.78, "text": "Wait a minute"}, {"id": 747, "start": 5212.78, "end": 5215.54, "text": "Warum geht denn das jetzt doch"}, {"id": 748, "start": 5215.54, "end": 5216.54, "text": "Muss ich das gar nicht machen"}, {"id": 749, "start": 5216.54, "end": 5226.38, "text": "When she baited"}, {"id": 750, "start": 5226.38, "end": 5240.34, "text": "G-Trial"}, {"id": 751, "start": 5240.34, "end": 5245.14, "text": "Elastic Compute Service"}, {"id": 752, "start": 5245.14, "end": 5246.14, "text": "Ok try now"}, {"id": 753, "start": 5246.14, "end": 5252.14, "text": "Ah she baited"}, {"id": 754, "start": 5252.14, "end": 5262.18, "text": "Ok geht doch nicht"}, {"id": 755, "start": 5262.18, "end": 5264.58, "text": "Wie würde ich denn hier jetzt überhaupt was anlegen in der China Cloud"}, {"id": 756, "start": 5264.58, "end": 5272.1, "text": "Server Load Balancer Cloud Monitor Elastic Compute Service"}, {"id": 757, "start": 5272.1, "end": 5276.62, "text": "Wie würde ich hier mal eine billige VM anlegen in der China Chinesen Cloud"}, {"id": 758, "start": 5276.62, "end": 5284.78, "text": "Sag mal der geht mir gerade echt auf den Kekse Dark Reader"}, {"id": 759, "start": 5284.78, "end": 5285.78, "text": "Instances Images"}, {"id": 760, "start": 5285.78, "end": 5286.78, "text": "VPC?"}, {"id": 761, "start": 5286.78, "end": 5287.78, "text": "Nee"}, {"id": 762, "start": 5287.78, "end": 5292.78, "text": "Disks"}, {"id": 763, "start": 5292.78, "end": 5293.78, "text": "Create Disk"}, {"id": 764, "start": 5293.78, "end": 5296.18, "text": "Ja ja ich und ich"}, {"id": 765, "start": 5296.18, "end": 5301.18, "text": "Ah Mist"}, {"id": 766, "start": 5301.18, "end": 5302.82, "text": "Ok die checken das echt"}, {"id": 767, "start": 5302.82, "end": 5304.06, "text": "Ok Leute keine Chance"}, {"id": 768, "start": 5304.06, "end": 5316.62, "text": "Keine Chance man kann"}, {"id": 769, "start": 5316.62, "end": 5317.62, "text": "Main Business"}, {"id": 770, "start": 5317.62, "end": 5325.02, "text": "Wie"}, {"id": 771, "start": 5325.02, "end": 5326.5, "text": "Vielleicht kann man das irgendwie austricksen"}, {"id": 772, "start": 5326.5, "end": 5335.3, "text": "Frankfurt am Main"}, {"id": 773, "start": 5335.3, "end": 5336.3, "text": "Teil 1"}, {"id": 774, "start": 5336.3, "end": 5337.3, "text": "Ah Mist"}, {"id": 775, "start": 5337.3, "end": 5338.3, "text": "60329"}, {"id": 776, "start": 5338.3, "end": 5345.3, "text": "Fax"}, {"id": 777, "start": 5345.3, "end": 5348.3, "text": "Plus 49"}, {"id": 778, "start": 5348.3, "end": 5349.46, "text": "Warum kann ich das nicht safen"}, {"id": 779, "start": 5349.46, "end": 5358.94, "text": "Ah Business Name"}, {"id": 780, "start": 5358.94, "end": 5359.94, "text": "Ah das ging jetzt oder was"}, {"id": 781, "start": 5359.94, "end": 5370.58, "text": "Ich bin voll überfordert"}, {"id": 782, "start": 5370.58, "end": 5374.1, "text": "Private Virtual Cloud"}, {"id": 783, "start": 5374.1, "end": 5376.46, "text": "Wie macht man bei den Chinesen"}, {"id": 784, "start": 5376.46, "end": 5382.54, "text": "Irgendeinen Server"}, {"id": 785, "start": 5382.54, "end": 5384.54, "text": "Das ist ja noch unübersichtlicher als AWS"}, {"id": 786, "start": 5384.54, "end": 5395.1, "text": "Ok Cloud Shell Cloud Shell ist gut"}, {"id": 787, "start": 5395.1, "end": 5406.94, "text": "Cloud Shell Storage Space Create"}, {"id": 788, "start": 5406.94, "end": 5411.94, "text": "Ah schau mir da"}, {"id": 789, "start": 5411.94, "end": 5414.14, "text": "Moment darf ich jetzt neu"}, {"id": 790, "start": 5414.14, "end": 5415.14, "text": "Darf ich jetzt neu"}, {"id": 791, "start": 5415.14, "end": 5417.02, "text": "Darf ich jetzt neu Handy nochmal gibbeten"}, {"id": 792, "start": 5417.02, "end": 5431.22, "text": "Ok die haben mich geploggt keine Chance"}, {"id": 793, "start": 5431.22, "end": 5438.82, "text": "Oh nee ich hab Angst bei was da für ein Ad kommt"}, {"id": 794, "start": 5438.82, "end": 5441.94, "text": "Ok Leute nope keine Chance"}, {"id": 795, "start": 5441.94, "end": 5444.38, "text": "Keine China Chinesen Cloud"}, {"id": 796, "start": 5444.38, "end": 5447.78, "text": "Private Window"}, {"id": 797, "start": 5447.78, "end": 5451.86, "text": "Keine Chance Bam"}, {"id": 798, "start": 5451.86, "end": 5453.78, "text": "China geht nicht"}, {"id": 799, "start": 5453.78, "end": 5455.7, "text": "So und was wir jetzt noch machen ist"}, {"id": 800, "start": 5455.7, "end": 5456.7, "text": "One more"}, {"id": 801, "start": 5456.7, "end": 5457.7, "text": "Moment Moment"}, {"id": 802, "start": 5457.7, "end": 5459.74, "text": "Wo löscht man den Kram jetzt nochmal"}, {"id": 803, "start": 5459.74, "end": 5464.22, "text": "Preferences History Clear"}, {"id": 804, "start": 5464.22, "end": 5468.3, "text": "Äh letzte Stunde Bam"}, {"id": 805, "start": 5468.3, "end": 5469.54, "text": "Ganzer China Kram wieder weg"}, {"id": 806, "start": 5469.54, "end": 5473.78, "text": "Ok aber ich würde sagen wir kennen uns jetzt damit schon mal relativ gut aus"}, {"id": 807, "start": 5473.78, "end": 5479.1, "text": "Also können wir sagen Alibaba Cloud auf jeden Fall schon mal eins ja"}, {"id": 808, "start": 5479.1, "end": 5483.58, "text": "Also für irgendwas muss ich das jetzt ja gelohnt haben"}, {"id": 809, "start": 5483.58, "end": 5486.38, "text": "Ich hab jetzt zumindest schon mal die Cloud Konsole gesehen von Alibaba"}, {"id": 810, "start": 5486.38, "end": 5494.46, "text": "So ok wo sind wir stehen geblieben"}, {"id": 811, "start": 5494.46, "end": 5499.34, "text": "Wo sind wir denn davor stehen geblieben"}, {"id": 812, "start": 5499.34, "end": 5506.66, "text": "Der Forbes Kram sind wir stehen geblieben"}, {"id": 813, "start": 5506.66, "end": 5509.78, "text": "Wieso Hetzner weil ich mich damit ganz gut auskenne"}, {"id": 814, "start": 5509.78, "end": 5521.98, "text": "Das da"}, {"id": 815, "start": 5521.98, "end": 5524.98, "text": "Das bin ich"}, {"id": 816, "start": 5524.98, "end": 5527.14, "text": "Woher willst du wissen dass ich in Wirklichkeit Max heiß"}, {"id": 817, "start": 5527.14, "end": 5532.26, "text": "Also gar nicht wieder drauf kommt"}, {"id": 818, "start": 5532.26, "end": 5539.82, "text": "Datenbanken na Datenbanken muss ich ehrlich gesagt nichts machen da hört es bei mir direkt"}, {"id": 819, "start": 5539.82, "end": 5543.66, "text": "auf nach Abinstall Postgres"}, {"id": 820, "start": 5543.66, "end": 5550.94, "text": "Mehr ASP.NET Core ach stimmt das müssen wir natürlich reinschreiben ja genau"}, {"id": 821, "start": 5550.94, "end": 5556.3, "text": "Da bin ich nicht schlecht drinne"}, {"id": 822, "start": 5556.3, "end": 5571.86, "text": "So ok Programmiersprachen haben wir alles würde ich sagen"}, {"id": 823, "start": 5571.86, "end": 5590.54, "text": "So Defob Stels Ansible Jenkins und so was Terraform kenne ich mich auch ein bisschen mit aus"}, {"id": 824, "start": 5590.54, "end": 5593.14, "text": "Ja gut GitLab ja"}, {"id": 825, "start": 5593.14, "end": 5603.98, "text": "Das ärgert mich jetzt dass ich die China Cloud nicht nicht angelegt bekommen habe"}, {"id": 826, "start": 5603.98, "end": 5615.26, "text": "Ja das juckt aber kein ehrlich gesagt"}, {"id": 827, "start": 5615.26, "end": 5628.1, "text": "Kommen wir machen jetzt einfach noch hier Ede Editor kann ich ein bisschen mit Wim skills"}, {"id": 828, "start": 5628.1, "end": 5629.46, "text": "Wim skills flexen"}, {"id": 829, "start": 5629.46, "end": 5635.46, "text": "Jetbrains Zeug kenne ich mich auch gut aus"}, {"id": 830, "start": 5635.46, "end": 5640.98, "text": "VS Code kenne ich mich auch gut aus"}, {"id": 831, "start": 5640.98, "end": 5642.98, "text": "Ja was soll ich da sonst reinschreiben"}, {"id": 832, "start": 5642.98, "end": 5651.26, "text": "Ach so ja Soft Skills da müssen wir natürlich noch so Sachen wie Jyra und Confluence und"}, {"id": 833, "start": 5651.26, "end": 5652.26, "text": "so im Gedönsranche"}, {"id": 834, "start": 5652.26, "end": 5658.5, "text": "Wobei das ja eigentlich keine Soft Skills sind das sind ja"}, {"id": 835, "start": 5658.5, "end": 5659.5, "text": "Tools oder so"}, {"id": 836, "start": 5659.5, "end": 5668.34, "text": "Wie macht man die Preview du sagst dir einfach Open Markdown Open Preview Markdown to the"}, {"id": 837, "start": 5668.34, "end": 5675.54, "text": "side und dann hast du es hier"}, {"id": 838, "start": 5675.54, "end": 5679.86, "text": "So was gibt es jetzt mal ernsthaft was ist denn noch interessant also was muss man da"}, {"id": 839, "start": 5679.86, "end": 5680.86, "text": "noch reinschreiben"}, {"id": 840, "start": 5680.86, "end": 5685.66, "text": "Es gibt so viele Sachen wo ich mir noch nie Gedanken zu gemacht habe und wahrscheinlich"}, {"id": 841, "start": 5685.66, "end": 5688.66, "text": "ich auch schon gemacht habe aber mir nie drüber nachgedacht habe"}, {"id": 842, "start": 5688.66, "end": 5700.54, "text": "Exis Soft Skills ich hasse Menschen"}, {"id": 843, "start": 5700.54, "end": 5709.18, "text": "Keck Wait Achja Netzwerk Netzwerk ist vielleicht nicht schlecht"}, {"id": 844, "start": 5709.18, "end": 5714.9, "text": "Wobei ich Netzwerk ich hab mal ein CCNA gemacht 0w 2007"}, {"id": 845, "start": 5714.9, "end": 5720.58, "text": "Ich glaube nicht dass es irgendwas noch irgendwie raus reißt"}, {"id": 846, "start": 5720.58, "end": 5726.34, "text": "CCNA von 2007 ist glaube ich Who Cares"}, {"id": 847, "start": 5726.34, "end": 5735.22, "text": "Nee ich glaube ich gar nicht von 2007 ist sogar glaube ich von 2008 oder 9 oder so"}, {"id": 848, "start": 5735.22, "end": 5738.82, "text": "Das habe ich schon hingeschrieben bei Linux bei Linux Skills"}, {"id": 849, "start": 5738.82, "end": 5745.98, "text": "Gibst du das deinem Chef 1 zu 1 nein Quatsch Wobei warum eigentlich nicht"}, {"id": 850, "start": 5745.98, "end": 5749.34, "text": "Kommunikation tja kommt drauf an ob ich die Leute mag oder nicht"}, {"id": 851, "start": 5749.34, "end": 5755.98, "text": "Lohnt sich CCNA eigentlich schwer zu sagen also für mich hat es sich bis jetzt nicht"}, {"id": 852, "start": 5755.98, "end": 5756.98, "text": "gelohnt"}, {"id": 853, "start": 5756.98, "end": 5762.94, "text": "Ja was kann ich denn im Netzwerk bereich ich kann Open Sense PF Sense ein bisschen"}, {"id": 854, "start": 5762.94, "end": 5766.98, "text": "Wobei es gar nicht Open Sense heißt sondern Open Open Open Sense heißt ja"}, {"id": 855, "start": 5766.98, "end": 5772.9, "text": "Warum auch immer man das nicht Open Sense sondern Open Open Sense genannt hat"}, {"id": 856, "start": 5772.9, "end": 5782.7, "text": "Mikrotik Unify Ohbei"}, {"id": 857, "start": 5782.7, "end": 5786.18, "text": "Die kann ich immer nicht schreiben das ist zwar jetzt kein Business Zeug aber es schadet"}, {"id": 858, "start": 5786.18, "end": 5787.86, "text": "sicherlich auch nichts wenn man das mal reinschreibt"}, {"id": 859, "start": 5787.86, "end": 5795.14, "text": "Kann ich sonst noch irgendwie Netzwerk mäßig großartig was"}, {"id": 860, "start": 5795.14, "end": 5798.82, "text": "Doch kann ich Fritzbox"}, {"id": 861, "start": 5798.82, "end": 5808.26, "text": "Ich glaube das ist ganz furchtbar entscheidend dass ich in Fritzbox reinschreibe"}, {"id": 862, "start": 5808.26, "end": 5812.66, "text": "Du hast nicht mitbekommen warum ich das mache weil"}, {"id": 863, "start": 5812.66, "end": 5820.18, "text": "Moment wo war dann hier die Frage Weil ich mal irgendwann vor über einem Jahr"}, {"id": 864, "start": 5820.18, "end": 5823.22, "text": "meinem Chef gesagt habe ich würde gern ein bisschen mehr Sachen programmieren auf der"}, {"id": 865, "start": 5823.22, "end": 5824.22, "text": "Arbeit"}, {"id": 866, "start": 5824.22, "end": 5828.82, "text": "Ich habe jetzt ein Jahr lang ignoriert und ich habe mir gedacht ich mache das jetzt einfach"}, {"id": 867, "start": 5828.82, "end": 5829.82, "text": "mal"}, {"id": 868, "start": 5829.82, "end": 5842.06, "text": "Leute mir gehen langsam die IOT brauchen wir noch IOT IOT Moment"}, {"id": 869, "start": 5842.06, "end": 5846.06, "text": "IOT ist so bescheuert brauche ich auf der Arbeit nie im Leben"}, {"id": 870, "start": 5846.06, "end": 5849.1, "text": "Aber was soll ich da was soll ich da reinschreiben"}, {"id": 871, "start": 5849.1, "end": 5855.38, "text": "Ich habe ein bisschen Ahnung von Embedded Kram"}, {"id": 872, "start": 5855.38, "end": 5862.74, "text": "Wobei der Patrick ist doch noch da oder Patrick bist du noch da geht mein ESP32 und ESP266"}, {"id": 873, "start": 5862.74, "end": 5864.78, "text": "Zeug was ich da mache als Embedded durch"}, {"id": 874, "start": 5864.78, "end": 5867.58, "text": "Oder sagt da sagt da jeder"}, {"id": 875, "start": 5867.58, "end": 5875.74, "text": "Distribute Cluster ja das stimmt stimmt stimmt ja ja ja hast du recht"}, {"id": 876, "start": 5875.74, "end": 5880.34, "text": "Also ich erkenne mich mit HA aus Cluster Kram"}, {"id": 877, "start": 5880.34, "end": 5882.34, "text": "Schreibt mir jetzt einfach mal was auf ich weiß nicht wie ich es nenne"}, {"id": 878, "start": 5882.34, "end": 5890.06, "text": "IBM Mainframe Liner habe ich keine Ahnung von"}, {"id": 879, "start": 5890.06, "end": 5893.74, "text": "Was machst du denn auf der Arbeit ich mache das hier guck mal"}, {"id": 880, "start": 5893.74, "end": 5897.1, "text": "Ich habe da sogar ein extra Video zu gemacht"}, {"id": 881, "start": 5897.1, "end": 5907.66, "text": "Ich habe schon fast alle schon mal ein Video gemacht"}, {"id": 882, "start": 5907.66, "end": 5918.46, "text": "Social Media Skills Twitter Flamer Twitch Twitch Emote Expert"}, {"id": 883, "start": 5918.46, "end": 5921.1, "text": "Ich weiß gar nicht wo ich den ganzen Kram hier noch dazu reinschreiben soll"}, {"id": 884, "start": 5921.1, "end": 5925.94, "text": "Borderlands ist schon wieder so alt ja"}, {"id": 885, "start": 5925.94, "end": 5927.94, "text": "Boah Leute mein Brain macht nicht mehr mit"}, {"id": 886, "start": 5927.94, "end": 5931.94, "text": "Ich kann mir mal nachdenken gerade MonkaS"}, {"id": 887, "start": 5931.94, "end": 5935.14, "text": "Da gibt es nur noch 100.000 Sachen und Gott und die Welt was ich da reinschreiben kann"}, {"id": 888, "start": 5935.14, "end": 5940.94, "text": "Ich bestelle mir jetzt erstmal bei Amazon schnell noch was"}, {"id": 889, "start": 5940.94, "end": 5945.58, "text": "Und zwar noch 16x16 LED Matrix fällt mir gerade so ein brauche ich"}, {"id": 890, "start": 5945.58, "end": 5948.42, "text": "Virtualisierung habe ich schon aber da kenne ich mich nicht wirklich gut mit aus"}, {"id": 891, "start": 5948.42, "end": 5953.38, "text": "Oh ich kann ein paar VMs aufsetzen aber von ESX Administration habe ich keine Ahnung"}, {"id": 892, "start": 5953.38, "end": 5956.38, "text": "Wie warum ist denn das so teuer geworden"}, {"id": 893, "start": 5956.38, "end": 5963.46, "text": "Warum ist das so teuer geworden ich habe da 15 Euro für bezahlt"}, {"id": 894, "start": 5963.46, "end": 5973.34, "text": "Keckweight Inflation Kick auch bei LED"}, {"id": 895, "start": 5973.34, "end": 5975.66, "text": "Stellhand beim China Chinesen ja das mache ich jetzt auch"}, {"id": 896, "start": 5975.66, "end": 5996.46, "text": "AliExpress 16x16 LED"}, {"id": 897, "start": 5996.46, "end": 5999.06, "text": "Weil ich will noch ich will noch zwei Lampen davon drucken"}, {"id": 898, "start": 5999.06, "end": 6005.62, "text": "Guck ich habe mir doch von ich habe mir doch hier so eine Lampe 3D gedruckt und die ist"}, {"id": 899, "start": 6005.62, "end": 6011.22, "text": "wirklich nice also das ist das erste mal wo ich es wirklich gesagt habe da ist was"}, {"id": 900, "start": 6011.22, "end": 6014.22, "text": "brauchbares cooles bei rausgekommen beim 3D drucken"}, {"id": 901, "start": 6014.22, "end": 6023.06, "text": "Hier die da mit WLED die Lampe ist wirklich nice geworden"}, {"id": 902, "start": 6023.06, "end": 6031.38, "text": "Da wollte ich mir noch zwei drei von machen LED Lampen kann man nie genug haben"}, {"id": 903, "start": 6031.38, "end": 6037.98, "text": "Und dazu brauche ich halt so ein 16x16 LED Matrix"}, {"id": 904, "start": 6037.98, "end": 6050.58, "text": "Die ist halt echt nice geworden guck so sah sie auf dem 3D Drucker aus"}, {"id": 905, "start": 6050.58, "end": 6053.3, "text": "Mein Druckbett hat auch schon bessere Zeiten gesehen"}, {"id": 906, "start": 6053.3, "end": 6066.26, "text": "Leute ich habe letztens den meinen mega geilen 3D Drucker gesehen auf YouTube"}, {"id": 907, "start": 6066.26, "end": 6070.74, "text": "Das ist 3D Drucker CNC Fräse und Laser Gravur Gerät in einem"}, {"id": 908, "start": 6070.74, "end": 6074.9, "text": "Ich will euch hier nochmal kurz zeigen Kaufe ich mir nicht"}, {"id": 909, "start": 6074.9, "end": 6100.06, "text": "Weil das Ding kann Laser Gravieren 3D Drucken und CNC Fräsen"}, {"id": 910, "start": 6100.06, "end": 6106.58, "text": "Richtig richtig abgedrehtes Teil kostet aber kostet aber 2000 Euro oder so"}, {"id": 911, "start": 6106.58, "end": 6115.9, "text": "Nee nee geht glaube ich ab 1200 Euro los geht ab 1200 Euro los und"}, {"id": 912, "start": 6115.9, "end": 6121.22, "text": "Aber für die Größe bezahlst du dann 2000 Euro Das ist gar nicht mal so teuer ne"}, {"id": 913, "start": 6121.22, "end": 6126.06, "text": "Das ist gar nicht mal so teuer aber es ist halt insgesamt 250 Euro 3D Drucker relativ"}, {"id": 914, "start": 6126.06, "end": 6129.54, "text": "teuer Das macht auch einen hochwertigen Eindruck"}, {"id": 915, "start": 6129.54, "end": 6134.26, "text": "mit dem Ding zum bedienen Du hast den Laser der kann auch automatisch"}, {"id": 916, "start": 6134.26, "end": 6145.38, "text": "kalibrieren und alles Guck hier Gravurstelz das ist das Video"}, {"id": 917, "start": 6145.38, "end": 6149.54, "text": "Ihr Gravurstelz kannst du machen Du kannst natürlich 3D Drucken das ist"}, {"id": 918, "start": 6149.54, "end": 6152.86, "text": "klar Die übliche 3D Druckgeschichte"}, {"id": 919, "start": 6152.86, "end": 6161.42, "text": "Dann kannst du hier Gravurstelz machen Und dann kann das Ding auch CNC Fräsen"}, {"id": 920, "start": 6161.42, "end": 6167.06, "text": "Ich mein man braucht es nicht aber es ist schon irgendwie ein geiles Gerät"}, {"id": 921, "start": 6167.06, "end": 6169.9, "text": "Oder müsst ihr zugeben Ist schon wirklich nice"}, {"id": 922, "start": 6169.9, "end": 6176.78, "text": "Nee nee nicht Laser ohne Gehäuse Du kriegst ein Gehäuse drum herum"}, {"id": 923, "start": 6176.78, "end": 6180.94, "text": "Du kriegst ein Gehäuse mit was auch für Laser schützt und so"}, {"id": 924, "start": 6180.94, "end": 6187.02, "text": "Der hat es nur für die Aufnahmen weggelassen Das ist richtig cool"}, {"id": 925, "start": 6187.02, "end": 6193.94, "text": "Aber brauche ich nicht Ich fand es nur geil"}, {"id": 926, "start": 6193.94, "end": 6197.74, "text": "Ich fand es nur geil So was kostet es bei den China Chinesen"}, {"id": 927, "start": 6197.74, "end": 6200.9, "text": "Guck bei den China Chinesen kostet es das gleiche Panel"}, {"id": 928, "start": 6200.9, "end": 6206.58, "text": "Einfach mal nur 10 Euro anstatt 25 in Deutschland Das ist genau das gleiche Panel"}, {"id": 929, "start": 6206.58, "end": 6220.82, "text": "Ach das ist 8 mal 8 ich brauch 16 mal 16 Nächste Woche Video dazu"}, {"id": 930, "start": 6220.82, "end": 6225.98, "text": "Nein WTF ich kauf mir das nicht"}, {"id": 931, "start": 6225.98, "end": 6229.66, "text": "Es ist nur geil Aber ich geb doch im Leben"}, {"id": 932, "start": 6229.66, "end": 6233.22, "text": "Ich geb doch im Leben da 2000 Euro für ein Gerät was ich nie verwende"}, {"id": 933, "start": 6233.22, "end": 6240.9, "text": "Wobei So unwahrscheinlich ist es nicht"}, {"id": 934, "start": 6240.9, "end": 6244.58, "text": "Aber nein mach ich es nicht In dem Fall mach ich es nicht"}, {"id": 935, "start": 6244.58, "end": 6256.86, "text": "Nein nein nein mach ich es nicht Ja hätten mal die die von diesem Videoschnittprogramm"}, {"id": 936, "start": 6256.86, "end": 6260.66, "text": "die bei mir Werbung machen wollten mein Angebot akzeptiert"}, {"id": 937, "start": 6260.66, "end": 6264.9, "text": "Dann hätte ich jetzt ein bisschen mehr Geld gehabt und hätte mir das kaufen können"}, {"id": 938, "start": 6264.9, "end": 6267.7, "text": "Und ich könnte mir das auch so kaufen aber ich sehe es nicht ein ich muss mich ein bisschen"}, {"id": 939, "start": 6267.7, "end": 6271.3, "text": "zurückhalten Ich gebe ja eh schon nicht viel Geld aus"}, {"id": 940, "start": 6271.3, "end": 6276.34, "text": "Aber ich habe manchmal den Hang dazu so Spielkrams zu kaufen von dem ich genau weiß ich brauche"}, {"id": 941, "start": 6276.34, "end": 6282.5, "text": "ihn eigentlich nicht Irgendwas in Richtung Middleware Integration"}, {"id": 942, "start": 6282.5, "end": 6291.14, "text": "Message Mappings Du meinst irgendwelche Message Que Geschichten"}, {"id": 943, "start": 6291.14, "end": 6296.98, "text": "so von Rabbit MQ bis sonst was von Spring habe ich keine Ahnung"}, {"id": 944, "start": 6296.98, "end": 6301.78, "text": "Ja Byte Strike genau Woher weißt du das"}, {"id": 945, "start": 6301.78, "end": 6304.54, "text": "Die machen gerade überall Werbung"}, {"id": 946, "start": 6304.54, "end": 6318.34, "text": "Die haben ich gefragt und ich habe gesagt Ja können wir machen Placement 800 Euro haben"}, {"id": 947, "start": 6318.34, "end": 6324.98, "text": "die gemeint 800 Euro ist uns zu viel Wobei ich das voll und ganz angemessen"}, {"id": 948, "start": 6324.98, "end": 6329.66, "text": "finde ehrlich gesagt Für das was die wollten"}, {"id": 949, "start": 6329.66, "end": 6335.38, "text": "Und ich habe mir jetzt überlegt ob ich jetzt nicht einfach noch mal noch mal sagen soll"}, {"id": 950, "start": 6335.38, "end": 6338.5, "text": "ja ok Machen wir 500 Euro und es gibt noch einen"}, {"id": 951, "start": 6338.5, "end": 6343.02, "text": "Twitter Post dabei oder so Aber drunter mache ich das nicht"}, {"id": 952, "start": 6343.02, "end": 6356.66, "text": "Die wollten links also also Donald links und sonst was und die wollten 60 plus als 60"}, {"id": 953, "start": 6356.66, "end": 6360.98, "text": "Sekunden Plus Placement mitten in einem Video haben"}, {"id": 954, "start": 6360.98, "end": 6370.98, "text": "Und das mache ich nicht für ein Apfel und ein Ei"}, {"id": 955, "start": 6370.98, "end": 6376.18, "text": "60 Sekunden Video Placement das kannst du nicht überspringen das ist reingerendert"}, {"id": 956, "start": 6376.18, "end": 6381.34, "text": "das nimmt das ganze total aus dem Video Fluss raus die Leute haben kein Bock schalten ab"}, {"id": 957, "start": 6381.34, "end": 6392.38, "text": "also das muss schon ordentlich bezahlt werden dass ich das mache"}, {"id": 958, "start": 6392.38, "end": 6399.18, "text": "Da ist 800 Euro aber schon frech was für 60 Sekunden Werbung ist da"}, {"id": 959, "start": 6399.18, "end": 6408.34, "text": "Weißt du was du woanders bezahlst für 60 Sekunden Werbung"}, {"id": 960, "start": 6408.34, "end": 6414.5, "text": "Du mal ich ja auch noch 60 Sekunden Werbung also die Werbung soll ich ja auch noch machen"}, {"id": 961, "start": 6414.5, "end": 6419.42, "text": "also sprich ich soll War das MonkaS alter"}, {"id": 962, "start": 6419.42, "end": 6424.22, "text": "Ah paar Schrauben waren das die Schrauben Päckchen die runtergefallen sind"}, {"id": 963, "start": 6424.22, "end": 6428.1, "text": "Lull Ach du meinst vielleicht billig ja ja"}, {"id": 964, "start": 6428.1, "end": 6431.7, "text": "Ja die Werbung soll ich ja auch noch machen also sprich ich krieg dann vielleicht einen"}, {"id": 965, "start": 6431.7, "end": 6437.22, "text": "Clip oder so von denen und soll dann da 60 Sekunden auch noch drüber labern"}, {"id": 966, "start": 6437.22, "end": 6440.66, "text": "aber ich habe gleich schon gesagt also irgendwie persönliche Empfehlungen kann ich nicht geben"}, {"id": 967, "start": 6440.66, "end": 6447.3, "text": "weil ich benutze das ja nicht ja ach nee ach nee nee nee"}, {"id": 968, "start": 6447.3, "end": 6452.46, "text": "also für 500 Euro würde ich dann vielleicht gerade so aber auch nicht komplett was sie"}, {"id": 969, "start": 6452.46, "end": 6456.82, "text": "sich vorgestellt haben machen aber sonst würde ich nicht bringt ja nix bringt ja nix"}, {"id": 970, "start": 6456.82, "end": 6462.74, "text": "wenn man das alles umsonst macht Was willst du für eine Minute Bitbattle"}, {"id": 971, "start": 6462.74, "end": 6472.9, "text": "Gameplay gar nix"}, {"id": 972, "start": 6472.9, "end": 6477.82, "text": "Raid Shadow Legends Gameplay ja da krieg ich das doppelte für allerdings das Problem"}, {"id": 973, "start": 6477.82, "end": 6482.66, "text": "bei Raid Shadow Legends Gameplay ist oder bei bei Raid Shadow Legends ist das haben"}, {"id": 974, "start": 6482.66, "end": 6488.06, "text": "die ja auch schon gleich am Anfang geschrieben du musst halt so tun als findest du's geil"}, {"id": 975, "start": 6488.06, "end": 6493.66, "text": "also alle anderen sind damit zufrieden wenn man sagt was weiß ich das ist hier Produkt"}, {"id": 976, "start": 6493.66, "end": 6501.42, "text": "XY das ist das das ist das beste für das und das zu machen und so das ist okay aber"}, {"id": 977, "start": 6501.42, "end": 6506.26, "text": "Raid Shadow Legends will dass du quasi sagst ich spiele dieses Spiel schon ein halbes Jahr"}, {"id": 978, "start": 6506.26, "end": 6511.42, "text": "und das hat mich selten ein RPG so begeistert ladet euch jetzt Raid Shadow Legends runter"}, {"id": 979, "start": 6511.42, "end": 6522.06, "text": "die die legen da die legen da wirklich wirklich wer drauf und ne mach ich nicht mach ich nicht"}, {"id": 980, "start": 6522.06, "end": 6529.54, "text": "vergiss es echt ist das Pains Champ hab ich noch nie verwendet ich hab's auch nicht vor"}, {"id": 981, "start": 6529.54, "end": 6537.26, "text": "zu verwenden um ehrlich ehrlich zu sein Cloud oder Hardware Shop Corporation mach mal ausrufe"}, {"id": 982, "start": 6537.26, "end": 6541.46, "text": "Zeichen Hetzner ich bin grad dabei ich hab mir denen schon ein Testvideo gemacht bei"}, {"id": 983, "start": 6541.46, "end": 6548.18, "text": "Hetzner und ich bin gerade dabei denen ein Vorschlag zu schicken für so komplettes"}, {"id": 984, "start": 6548.18, "end": 6553.66, "text": "monatliches so ein Paket mit monatliche mit monatlicher Zahlung ja da werde ich dann so"}, {"id": 985, "start": 6553.66, "end": 6561.86, "text": "Sachen rein machen wie Stream Overlay und dass es commands gibt im Chat man könnte beispielsweise"}, {"id": 986, "start": 6561.86, "end": 6569.7, "text": "auch Discord messages rein machen Videobeschreibung alle möglichen Sachen ich bin da grad dabei"}, {"id": 987, "start": 6569.7, "end": 6575.86, "text": "sowas zusammenzuschreiben wo ich ich werde es wahrscheinlich so machen ich schlag den"}, {"id": 988, "start": 6575.86, "end": 6582.38, "text": "drei Sachen vor mit drei drei unterschiedlichen unterschiedlichen Preisen ja keine Ahnung"}, {"id": 989, "start": 6582.38, "end": 6589.82, "text": "500 Euro 1000 Euro 1500 ich weiß es noch nicht keine Ahnung und dann ist dann halt"}, {"id": 990, "start": 6589.82, "end": 6596.94, "text": "je nachdem wie umfangreich die Sache ist können sie sich dann raussuchen was sie haben wollen"}, {"id": 991, "start": 6596.94, "end": 6601.82, "text": "was ich nie wieder machen werde ist so ne so ne G2A Geschichte mit festen Videoanzahlen"}, {"id": 992, "start": 6601.82, "end": 6608.46, "text": "im Monat das mach ich nie wieder das fand ich kacke aber G2A war auch merkwürdig denen"}, {"id": 993, "start": 6608.46, "end": 6613.22, "text": "waren Aufrufe egal die wollten nur viele Videos haben also die waren ganz merkwürdig so im"}, {"id": 994, "start": 6613.22, "end": 6621.98, "text": "nachhinein betrachtet die waren ganz die waren ganz merkwürdig ne ich hab ja auch versucht"}, {"id": 995, "start": 6621.98, "end": 6626.38, "text": "zu erklären so nach dem Motto hey wenn ich weniger Videos mache das ist sogar besser"}, {"id": 996, "start": 6626.38, "end": 6630.5, "text": "weil unterm Strich eure Videos sogar noch mehr geguckt werden ich hatte die ja nicht in jedem"}, {"id": 997, "start": 6630.5, "end": 6635.66, "text": "Video drinne aber ich hab gesagt guck mal diese Videos wo ihr drinne seid also bei G2A"}, {"id": 998, "start": 6635.66, "end": 6639.3, "text": "die gucken dann sogar mehr wenn ich Videos mache sonst war der egal die wollten Videos"}, {"id": 999, "start": 6639.3, "end": 6646.06, "text": "haben in massen die waren die waren komisch IprepperRS ach ne IpepperRS nicht wird nicht"}, {"id": 1000, "start": 6646.06, "end": 6651.66, "text": "gepreppt Dankeschön für den Sub Abofaller hat auch Subscribed Dankeschön vor 26 Minuten"}, {"id": 1001, "start": 6651.66, "end": 6661.14, "text": "Prime Sub der Captain Peng auch schon sieben Monate huge Subscriptions Leute Dankeschön"}, {"id": 1002, "start": 6661.14, "end": 6672.3, "text": "für die ganzen Subs Klopapierprepper ich wurde total geflamed dafür dass ich Klopapier"}, {"id": 1003, "start": 6672.3, "end": 6676.58, "text": "damals könnt ihr euch noch dran erinnern als ich mal auf Twitter gepostet hab ich hab"}, {"id": 1004, "start": 6676.58, "end": 6680.58, "text": "mir ne Palette war ja nicht wirklich ne komplette Palette aber ich sag jetzt einfach mal in"}, {"id": 1005, "start": 6680.58, "end": 6684.78, "text": "der Richtung ich hab mir ne Palette Klopapier bestellt wie sie sich aufgeregt haben auf"}, {"id": 1006, "start": 6684.78, "end": 6689.74, "text": "Twitter alle wieder Max du bist Teil des Problems und deswegen wegen dir kann ich mir mein"}, {"id": 1007, "start": 6689.74, "end": 6696.1, "text": "Bob es nicht abputzen und sowas meine Güte haben dich aufgeregt Alter dabei hab ich das"}, {"id": 1008, "start": 6696.1, "end": 6699.94, "text": "ja nicht irgendwie beim Rewe bestellt sondern in nem Großhandel und die hatten jederzeit"}, {"id": 1009, "start": 6699.94, "end": 6706.58, "text": "genug und die haben explizit gesagt sie beliefern wenn es Engpässe gibt auch zuerst Krankenhäuser"}, {"id": 1010, "start": 6706.58, "end": 6712.86, "text": "und alles das heißt was ich bekommen hab an Klopapier damals war vollkommen quasi ohne"}, {"id": 1011, "start": 6712.86, "end": 6717.86, "text": "Einfluss auf die anderen Leute außer dass ich genug Klopapier hatte und die anderen"}, {"id": 1012, "start": 6717.86, "end": 6721.66, "text": "die sich permanent eingeredet haben dass sie irgendwie moralisch überlegen sind weil sie"}, {"id": 1013, "start": 6721.66, "end": 6727.26, "text": "sich jetzt den Bobes mit einem Stück zweimal abputzen nicht aber tja so sind sie halt"}, {"id": 1014, "start": 6727.26, "end": 6738.62, "text": "die Twitter Flamer ja Video Einblendung mit FFmpeg da viel mehr sollte man damit aber"}, {"id": 1015, "start": 6738.62, "end": 6744.18, "text": "auch nicht machen also das geht man kann ja Offerlays machen mit FFmpeg aber schön ist"}, {"id": 1016, "start": 6744.18, "end": 6750.34, "text": "was anderes Leute ich bin zu Lowbrain ich krieg ich krieg gerade nicht mehr nicht mehr"}, {"id": 1017, "start": 6750.34, "end": 6762.86, "text": "Skillers zusammen irgendwie das ist zu mein Hirn setzt mein Hirn setzt aus grad vorbei"}, {"id": 1018, "start": 6762.86, "end": 6770.58, "text": "Running Low on Cuties ja so siehts aus wo sind sie denn alle hin wo ist wo ist der Chat"}, {"id": 1019, "start": 6770.58, "end": 6779.34, "text": "investierst du eigentlich an der Börse nein ich mach aktuell in der Richtung gar nichts"}, {"id": 1020, "start": 6779.34, "end": 6785.98, "text": "aber ich sollte das unbedingt machen weil ich hab achso ja ich kann euch ja noch was"}, {"id": 1021, "start": 6785.98, "end": 6793.22, "text": "erzählen aber vorher beantworten ich das ne mach ich nicht ich hab heute war ich aber"}, {"id": 1022, "start": 6793.22, "end": 6797.7, "text": "wieder geschockt als ich auf mein Konto geguckt hab ich hab Geld vom Automat abgeholt da liegt"}, {"id": 1023, "start": 6797.7, "end": 6801.82, "text": "viel zu viel Geld rum und auf dem Business Konto liegt auch viel zu viel Geld rum ich"}, {"id": 1024, "start": 6801.82, "end": 6807.22, "text": "muss unbedingt den Kram irgendwie investieren und sei es nur in langfristig einfach was"}, {"id": 1025, "start": 6807.22, "end": 6810.86, "text": "nehmen für zum Beispiel genau irgendwas wie ETFs oder so aber das Problem ist ich hab"}, {"id": 1026, "start": 6810.86, "end": 6815.18, "text": "von sowas keine Ahnung ich beschäftige mich auch einfach nur ungern damit auch ich weiß"}, {"id": 1027, "start": 6815.18, "end": 6822.42, "text": "dass das blöd ist aber ich muss das unbedingt machen weil ansonsten ist es nur noch die"}, {"id": 1028, "start": 6822.42, "end": 6831.3, "text": "Hälfte wert frag her Endpunkt ich glaub da hat davon auch nicht so viel Ahnung Bitcoin"}, {"id": 1029, "start": 6831.3, "end": 6843.74, "text": "ist aktuell gut zu investieren es ist runter gibt es überhaupt noch Sparbücher ja gut"}, {"id": 1030, "start": 6843.74, "end": 6852.1, "text": "geben tut es das noch das macht dann die Oma von der Oma so das ist ja auch schon vorbei"}, {"id": 1031, "start": 6852.1, "end": 6865.06, "text": "wie jetzt soll ich MrBeast Style machen der nächste der meinen Tweet retweetet ich verlose"}, {"id": 1032, "start": 6865.06, "end": 6871.7, "text": "unter allen die retweeten 100.000 Euro ne 10.000 Dollar macht er ja immer MrBeast Style"}, {"id": 1033, "start": 6871.7, "end": 6882.94, "text": "ja ja ganz bestimmt ich mein damit kann man sie übelst krass natürlich Follower Sachen"}, {"id": 1034, "start": 6882.94, "end": 6888.62, "text": "auch holen wer diesen Tweet retweetet und Follower unter allen die retweet und Follower"}, {"id": 1035, "start": 6888.62, "end": 6896.78, "text": "verlose ich 5000 Euro und dann ist natürlich die Frage überprüft überhaupt irgendjemand"}, {"id": 1036, "start": 6896.78, "end": 6900.78, "text": "ob er das macht gut der hat genug Geld der wird es wahrscheinlich machen aber es gibt"}, {"id": 1037, "start": 6900.78, "end": 6905.94, "text": "bestimmt genug Leute die faken sowas war nicht war nicht mal hat gab es da nicht mal"}, {"id": 1038, "start": 6905.94, "end": 6911.9, "text": "bei Simon Desue so ein Miniskandal damals der auch gesagt hat hier ihr bekommt Geld"}, {"id": 1039, "start": 6911.9, "end": 6916.22, "text": "und dann hat er das nie bezahlt und hat die Leute gescampt aber gut bei Simon Desue wundert"}, {"id": 1040, "start": 6916.22, "end": 6922.9, "text": "mich ja nichts mehr und ApoRed okay das weiß ich nicht mehr bei ApoRed weiß ich nur noch"}, {"id": 1041, "start": 6922.9, "end": 6929.18, "text": "dass der mal einen Bombenprank kennt ihr noch den Bombenprank von ApoRed das war so blöd"}, {"id": 1042, "start": 6929.18, "end": 6932.86, "text": "da hätte man sich doch auch da wäre man doch auch auf die Idee gekommen im Vorfeld schon"}, {"id": 1043, "start": 6932.86, "end": 6938.5, "text": "dass es vielleicht nicht so sinnvoll ist das zu machen alter es ist so ah so Paynes Champ"}, {"id": 1044, "start": 6938.5, "end": 6952.78, "text": "keine zwei Meter gerade ausgedacht den habe ich abonniert auf YouTube ich mach garantiert"}, {"id": 1045, "start": 6952.78, "end": 6959.54, "text": "nicht all in Bitcoin also den habe ich abonniert auf YouTube den Kerl"}, {"id": 1046, "start": 6959.54, "end": 6983.86, "text": "ja der ist irgendwie auch weg von der Bildfläche gut ich glaube die die die Stelzen jetzt in"}, {"id": 1047, "start": 6983.86, "end": 6991.18, "text": "Dubai rum bisschen was an Open Source Projekte spenden ich ich spende ich spende ab und zu"}, {"id": 1048, "start": 6991.18, "end": 7000.78, "text": "für irgendwelche Tierschutzgeschichten was all in Essen ja das mache ich ja eh schon"}, {"id": 1049, "start": 7000.78, "end": 7014.78, "text": "ist trotzdem noch was übrig"}, {"id": 1050, "start": 7014.78, "end": 7020.5, "text": "Leute was machen wenn jetzt wir haben noch eine halbe Stunde Zeit also für für Skill"}, {"id": 1051, "start": 7020.5, "end": 7024.7, "text": "Stels ist mein mein Hirn ist gerade zu zu low brain ich dafür da kann ich mir nicht"}, {"id": 1052, "start": 7024.7, "end": 7035.22, "text": "mehr ausdruck aussuchen"}, {"id": 1053, "start": 7035.22, "end": 7044.06, "text": "Depot eröffnen im Stream näh YouTube Reacts ne hab ich jetzt auch kein Bock drauf"}, {"id": 1054, "start": 7044.06, "end": 7049.14, "text": "Vingate hat jetzt uninstall upgrade und list das funktioniert doch aber im Leben nicht"}, {"id": 1055, "start": 7049.14, "end": 7059.98, "text": "richtig das glaube ich dir nicht dass es funktioniert ich moment wohl mein Moment"}, {"id": 1056, "start": 7059.98, "end": 7062.78, "text": "Video von Geek Freaks waren das die nicht mit dem Windows Tuning Pack"}, {"id": 1057, "start": 7062.78, "end": 7075.74, "text": "Moment Tag das muss ich mir angucken Ach das ist nicht mein Friseur das ist mein Zahnarzt"}, {"id": 1058, "start": 7075.74, "end": 7085.98, "text": "meinst du ja genau der spricht wie mein Zahnarzt an installen install ab ok experimental das"}, {"id": 1059, "start": 7085.98, "end": 7090.46, "text": "muss man sich mal auf der Zunge zergehen lassen Microsoft hat einen Package Manager gemacht"}, {"id": 1060, "start": 7090.46, "end": 7099.18, "text": "wo es experimental ist eine App zu aninstallen"}, {"id": 1061, "start": 7099.18, "end": 7102.46, "text": "was haben alle mit den Hot Tube Streams es ist ja schon ein bisschen weniger geworden"}, {"id": 1062, "start": 7102.46, "end": 7106.74, "text": "die üblichen Verdächtigen gibt es immer noch aber so der Riesen der Riesen Aufreger"}, {"id": 1063, "start": 7106.74, "end": 7118.14, "text": "und Riesen Hype ist ja eigentlich auch schon wieder weg"}, {"id": 1064, "start": 7118.14, "end": 7123.02, "text": "Paints Champ auf MSI ok immerhin dann wird das vielleicht jetzt mal ernst zu nehmen der"}, {"id": 1065, "start": 7123.02, "end": 7127.78, "text": "Package Manager demnächst Booba TV gibt's schon ja das kenne ich das"}, {"id": 1066, "start": 7127.78, "end": 7138.9, "text": "mache ich jetzt aber nicht auf Progress Paradev da musst du glaube ich Serious Max ihr danken"}, {"id": 1067, "start": 7138.9, "end": 7144.74, "text": "im Chat weil ich glaube der hat es vorhin gepostet da bin ich auch nicht selbst drauf"}, {"id": 1068, "start": 7144.74, "end": 7161.5, "text": "gekommen"}, {"id": 1069, "start": 7161.5, "end": 7164.86, "text": "ich gucke noch mal schnell was was sind so die aktuellen GitHub Trends das schaue ich"}, {"id": 1070, "start": 7164.86, "end": 7168.18, "text": "mir jetzt noch mal schnell an da ist wahrscheinlich nichts großartiges spannendes dabei"}, {"id": 1071, "start": 7168.18, "end": 7181.22, "text": "Doc was Doc to Shotgun Monka ist was ah das ist ein Crawler das ist ein Bot das ist ein"}, {"id": 1072, "start": 7181.22, "end": 7188.46, "text": "Bot der einem einen Termin fürs Impfen crapped das ist eigentlich eine coole Idee"}, {"id": 1073, "start": 7188.46, "end": 7202.14, "text": "das ist doch mal was was ordentliches kippt sich auch für die deutsche ja ich weiß ich"}, {"id": 1074, "start": 7202.14, "end": 7210.42, "text": "weiß ja Patrick ich weiß ich habe es gelesen im Chat im Discord und das wird das wird"}, {"id": 1075, "start": 7210.42, "end": 7213.98, "text": "Paints Champ ich ich verstehe nicht warum Microsoft es nicht auf die Reihe klingt"}, {"id": 1076, "start": 7213.98, "end": 7220.74, "text": "ordentliches UI Framework zu machen China Chinesen Kram versteht man wieder nichts"}, {"id": 1077, "start": 7220.74, "end": 7230.78, "text": "Deutsch Haus der hat ein Video hochgeladen dass er keinen Bock mehr drauf hat habe ich"}, {"id": 1078, "start": 7230.78, "end": 7242.7, "text": "heute morgen gesehen okay es gibt mal wieder absolut nichts spannendes was trendet nice"}, {"id": 1079, "start": 7242.7, "end": 7250.02, "text": "hat sich gelohnt wieso kein chinesen von weil ich selten chinesische zeichen braucht"}, {"id": 1080, "start": 7250.02, "end": 7259.74, "text": "die leute vermiesen ihm das echt was haben sie gemacht stack overflow hat die fall"}, {"id": 1081, "start": 7259.74, "end": 7267.7, "text": "von geändert sehr kunde sehr kunde moment moment stack overflow wir suchen jetzt eine"}, {"id": 1082, "start": 7267.7, "end": 7273.86, "text": "10 plus plus frage auf stack overflow wir müssen ja neue sachen auch gleich mit der"}, {"id": 1083, "start": 7273.86, "end": 7290.46, "text": "hässlichsten sprache was das gar nicht mal so schlecht muss ich sagen gar nicht mal so"}, {"id": 1084, "start": 7290.46, "end": 7307.38, "text": "schlecht das ist das ist besser als der alte font was ist das was ist das für ein font"}, {"id": 1085, "start": 7307.38, "end": 7321.02, "text": "wie nennt man das okay die verwenden einfach kaskas kardia monos die haben einfach nur"}, {"id": 1086, "start": 7321.02, "end": 7327.18, "text": "die reinfolge geändert was von den lokalen schriftarten verwendet wird oder oder ist das"}, {"id": 1087, "start": 7327.18, "end": 7344.3, "text": "wirklich aber ich muss sagen das sieht besser aus als vorher kannst du mal erklären was"}, {"id": 1088, "start": 7344.3, "end": 7351.22, "text": "das alles in der obersten leiste bedeutet als die windows leiste das hier das ist desktop"}, {"id": 1089, "start": 7351.22, "end": 7360.58, "text": "1 dass ich desktop 2 das ist desktop 3 das ist freier plattenplatz freier ram freier"}, {"id": 1090, "start": 7360.58, "end": 7367.02, "text": "swap gibt es nicht weil ich habe kein swap freier swap cpu auslastung cpu load lokale"}, {"id": 1091, "start": 7367.02, "end": 7373.06, "text": "ip und wie viel grad up und down geht übers netzwerk und dann die das aktuelle datum und"}, {"id": 1092, "start": 7373.06, "end": 7382.3, "text": "netzwerkverbindung ist nicht das ist jetzt kaskadia code wir haben passt ja gut dazu"}, {"id": 1093, "start": 7382.3, "end": 7397.3, "text": "dass wir gestern neue schriftarten ausprobiert haben ip league monka es"}, {"id": 1094, "start": 7397.3, "end": 7401.9, "text": "aber ich muss sagen es gefällt mir besser die was hatten die davor courier oder sowas"}, {"id": 1095, "start": 7401.9, "end": 7409.26, "text": "stack overflow das sah so oldschool aus auf stack overflow die schrift mit welchem programm"}, {"id": 1096, "start": 7409.26, "end": 7413.82, "text": "kann man gut die temperatur seiner pc hardware überwachen vor frag mich nicht unter windows"}, {"id": 1097, "start": 7413.82, "end": 7425.5, "text": "keine ahnung ich glaube das ist die neue microsoft schriftart hier die leute hätten richtig"}, {"id": 1098, "start": 7425.5, "end": 7432.18, "text": "selbst das probieren wir jetzt mal ich finde es eigentlich ganz gut font lesen wir doch"}, {"id": 1099, "start": 7432.18, "end": 7441.42, "text": "mal wie dazu gibt es keine oder gibt es bestimmt ein hacker news jetzt bestimmt hacker news"}, {"id": 1100, "start": 7441.42, "end": 7448.38, "text": "eintrag für und und und und reddit und reddit reddit stack overflow gibt es bestimmt auch"}, {"id": 1101, "start": 7448.38, "end": 7457.46, "text": "was für is it just me or stack overflow incredible toxic ja stack overflow sind sehr viele merkwürdige"}, {"id": 1102, "start": 7457.46, "end": 7483.62, "text": "leute font font die da wird noch nicht drauf rum geflammt war warum nicht stack warum warum"}, {"id": 1103, "start": 7483.62, "end": 7491.62, "text": "wird es auch noch nicht drauf rum geflammt die fall font hier we are switching we are"}, {"id": 1104, "start": 7491.62, "end": 7500.14, "text": "switching fonts das schon das schon ein bisschen okay das ist schon das ist schon ein bisschen"}, {"id": 1105, "start": 7500.14, "end": 7509.9, "text": "her wo sie das angekündigt haben so da wird da wird garantiert drauf rum geflammt pull"}, {"id": 1106, "start": 7509.9, "end": 7521.14, "text": "requests würgen wir schon mal nicht"}, {"id": 1107, "start": 7539.9, "end": 7552.46, "text": "okay was auch immer"}, {"id": 1108, "start": 7552.46, "end": 7557.22, "text": "ach leute wisst ihr warum es kann das sein dass sie den default font gar nicht geändert"}, {"id": 1109, "start": 7557.22, "end": 7562.66, "text": "haben ich habe einfach nur total viele fonts installiert ich guck mal leute die haben den"}, {"id": 1110, "start": 7562.66, "end": 7570.54, "text": "default font doch moment moment moment leute ich habe doch gestern ganz viele ganz viele"}, {"id": 1111, "start": 7570.54, "end": 7585.26, "text": "font installiert wahrscheinlich ist es deswegen einfach wenn ich den kram wieder habe ich"}, {"id": 1112, "start": 7585.26, "end": 7592.46, "text": "gestern den snapshot restored wobei kann ich einfach ausprobieren was habe ich gestern"}, {"id": 1113, "start": 7592.46, "end": 7608.58, "text": "als letzten font installiert ne ist noch alles drauf ah ne okay ich weiß gar nicht was"}, {"id": 1114, "start": 7608.58, "end": 7612.42, "text": "ich alles installiert habe gestern okay ich muss mal ich muss ich muss ah ne ich kann"}, {"id": 1115, "start": 7612.42, "end": 7616.26, "text": "nicht rückgängig machen fack da ist ja meine liste weg wenn ich jetzt rückgängig mache"}, {"id": 1116, "start": 7616.26, "end": 7625.62, "text": "keg weight ja okay was was habe ich da alles installiert man konnte noch mit pack packman"}, {"id": 1117, "start": 7625.62, "end": 7647.86, "text": "list by install date das geht doch irgendwie wow what the install ich will einfach wissen"}, {"id": 1118, "start": 7647.86, "end": 7666.7, "text": "listen by install date you can't what the fack font install wunderbar das beste ist einfach"}, {"id": 1119, "start": 7666.7, "end": 7678.82, "text": "sachen copy pasten wieder ich dachte das geht echt nicht na gut aber was ich machen kann"}, {"id": 1120, "start": 7678.82, "end": 7689.18, "text": "ist so das ist alles installiert es crept nach minus i ttf nach mein installierten fonts"}, {"id": 1121, "start": 7689.18, "end": 7699.42, "text": "genau so also das da kann man installieren das da kann man deinstallieren wie mochi braumann"}, {"id": 1122, "start": 7699.42, "end": 7710.24, "text": "robot und mono kommen installieren meslo kommen deinstallieren jet brands mono kommen"}, {"id": 1123, "start": 7710.24, "end": 7717.58, "text": "deinstallieren kommen installieren kommen auch deinstallieren vierer kaut kommen auch"}, {"id": 1124, "start": 7717.58, "end": 7719.58, "text": "Okay, das ist der ganze Kempel von gestern"}, {"id": 1125, "start": 7721.74, "end": 7726.74, "text": "So und dann, kann man auch deinstallieren, das muss man glaube ich drauf lassen"}, {"id": 1126, "start": 7728.5, "end": 7734.68, "text": "Wobei, wartet mal, haben wir noch hier, minus minus recursive, dass er alles mit wegschmeißt"}, {"id": 1127, "start": 7736.4, "end": 7741.76, "text": "So und jetzt, ich mach mal ein Reboot, ich weiß, braucht man nicht, es reicht Browser neu starten und jetzt gucken wir mal wie jetzt"}, {"id": 1128, "start": 7741.76, "end": 7753.06, "text": "Deckoverflow aussieht, der braucht übrigens login manageraft total overrated einfach direkt x starten"}, {"id": 1129, "start": 7754.26, "end": 7756.66, "text": "So, da sind wieder die five head birds am start"}, {"id": 1130, "start": 7763.54, "end": 7765.54, "text": "Das ist doch der standard font von immer"}, {"id": 1131, "start": 7765.54, "end": 7772.38, "text": "Das ist das anders als sonst, wie sieht das unter windows aus"}, {"id": 1132, "start": 7775.62, "end": 7780.86, "text": "Tatsächlich, ah die haben die haben die reinfolge der fonts geändert"}, {"id": 1133, "start": 7782.42, "end": 7790.38, "text": "Die haben einfach die reinfolge der fonts geändert die vom system verwendet also die reinfolge der auf dem system verfügbaren fonts haben die geändert"}, {"id": 1134, "start": 7790.38, "end": 7795.98, "text": "Ja, das ist ok ich finde es aber nice weil standardmäßig hatten die unter windows glaube ich sonst"}, {"id": 1135, "start": 7796.38, "end": 7798.38, "text": "Currier new oder sowas in der richtung"}, {"id": 1136, "start": 7802.94, "end": 7804.94, "text": "Bin ich in ordnung passt"}, {"id": 1137, "start": 7804.94, "end": 7819.14, "text": "Können sie ruhig so lassen, das wäre auch so lieber als das standard font den sie da vorher drin hatten"}, {"id": 1138, "start": 7828.14, "end": 7830.14, "text": "So leute"}, {"id": 1139, "start": 7830.14, "end": 7839.34, "text": "Ich mache mich jetzt schon vom agger ich habe bin zu low brain da heute mit der liste weiterzumachen aber wir haben ja schon einiges eingetragen"}, {"id": 1140, "start": 7839.34, "end": 7842.74, "text": "Ich werde das wahrscheinlich dann auf off stream fertig machen"}, {"id": 1141, "start": 7844.34, "end": 7846.34, "text": "Ich schaue jetzt erstmal ab"}, {"id": 1142, "start": 7848.18, "end": 7852.22, "text": "Spiel vielleicht noch runde battlefield oder so aber nicht on stream"}, {"id": 1143, "start": 7853.06, "end": 7856.94, "text": "Morgen stream ich muss mal gucken ich wollte mich endlich darum kümmern dass ich mein"}, {"id": 1144, "start": 7856.94, "end": 7860.26, "text": "3d kicks bekomme der reden kann"}, {"id": 1145, "start": 7861.14, "end": 7863.82, "text": "Muss ich mit muss ich mich ein bisschen mit pfeiffer auseinandersetzen"}, {"id": 1146, "start": 7866.94, "end": 7870.26, "text": "Der rüppel dankeschön 16 monate hypersubscription hier"}, {"id": 1147, "start": 7874.06, "end": 7876.06, "text": "Wann ist eigentlich der nächste feiertag"}, {"id": 1148, "start": 7877.7, "end": 7879.7, "text": "Säck Säck"}, {"id": 1149, "start": 7879.7, "end": 7889.94, "text": "Und 24 ja montag bringt mir nix mont ist ja scheiße warum muss das montag sein"}, {"id": 1150, "start": 7893.58, "end": 7898.1, "text": "Warum muss das montag sein was soll das können die finks montag nicht dienstag machen"}, {"id": 1151, "start": 7901.66, "end": 7903.66, "text": "Ein montag sagt"}, {"id": 1152, "start": 7903.66, "end": 7907.58, "text": "Montag ist der schlechteste feiertag überhaupt"}, {"id": 1153, "start": 7909.66, "end": 7911.66, "text": "Gibt es nicht einfach eine tabelle hier"}, {"id": 1154, "start": 7913.26, "end": 7915.26, "text": "So"}, {"id": 1155, "start": 7915.26, "end": 7920.46, "text": "Dann haben wir als nächstes das hatten wir schon das haben wir frohen leichnam kommt dann dritter sechster"}, {"id": 1156, "start": 7921.26, "end": 7926.54, "text": "Was ist eine dritte sechste ist ich hoffe dass es dann auch montag geht wenn das jetzt wieder montag ist kriege ich anfälle leute"}, {"id": 1157, "start": 7926.54, "end": 7932.7, "text": "Donnerstag sehr gut exzellent es heißt nächste woche brauche ich freitag wieder urlaub"}, {"id": 1158, "start": 7936.14, "end": 7942.7, "text": "Direkt urlaubsantrag urlaub antrag ist raus direkt montag mache ich dienstag mache ich den"}, {"id": 1159, "start": 7947.5, "end": 7949.5, "text": "Hast du schon gemacht"}, {"id": 1160, "start": 7951.26, "end": 7953.1, "text": "Was für ein appstarter verwendest du"}, {"id": 1161, "start": 7953.1, "end": 7961.26, "text": "Was für ein appstarter verwendest du äh was unter windows das startmenü"}, {"id": 1162, "start": 7964.46, "end": 7969.5, "text": "Ach unter linux in der file rofi roffi roffi"}, {"id": 1163, "start": 7972.18, "end": 7974.86, "text": "Welches themen boah keine ahnung"}, {"id": 1164, "start": 7976.06, "end": 7980.78, "text": "Keine ich habe schon ausgemacht weiß ich nicht komm das nächste mal gucken leute gucken wir das nächste mal"}, {"id": 1165, "start": 7980.78, "end": 7985.02, "text": "Ich spiele es noch eine runde plans versus zombie 1 endless oder irgendwas"}, {"id": 1166, "start": 7986.06, "end": 7989.34, "text": "Wir sehen uns macht es gut bis morgen"}, {"id": 1167, "start": 7989.34, "end": 8011.34, "text": "Bis morgen zu"}]}