{"text": "Ja ja jaNiceSo mal zu ungewöhnlicher Zeit anIch glaube teams hat wieder an meiner sound settings rum gespieltKeg weight, ne passt alles. Ich war ja gestern abends schon on, lull. Hab ich ja schon alles umgestellt wiederDanach hatte ich ja keinen teams anruf zum glück mehrNach 22 Uhr kommt es selbst vorSo jetzt müssen wir erstmal checken ob ich mehr bitrate einstellen kann. Huge bitrateWeil ohne mehr bitrate wird battlefield sackig aussehenOutput ja 4,9 viel zu viel 6,6,9 braucht man mindestensDeutschland deutsches internet jetzt wirds wieder kompliziert 7,9 6,9 aber schauen ob das funktioniertGeht nicht hoch, warum geht das nicht auf? Wait a minute, keg weightEigentlich sollten die settings jetzt raufgehenAh das ist nvnk, nvnk kann den scheiß ja nichtOkay, ich muss noch mal kurz streamen außen wieder anmachenErst noch mal schnell checken. Moin Hexer, noch mal kurz checken obIch irgendwie Delay drin hab, nee Delay braucht man nicht. Stream style bei Battlefield 3 gibt es keine mehr, keg weight", "segments": [{"id": 1, "start": 0.0, "end": 2.0, "text": "Ja ja ja"}, {"id": 2, "start": 9.6, "end": 11.6, "text": "Nice"}, {"id": 3, "start": 14.56, "end": 18.68, "text": "So mal zu ungewöhnlicher Zeit an"}, {"id": 4, "start": 20.7, "end": 23.62, "text": "Ich glaube teams hat wieder an meiner sound settings rum gespielt"}, {"id": 5, "start": 23.62, "end": 29.98, "text": "Keg weight, ne passt alles. Ich war ja gestern abends schon on, lull. Hab ich ja schon alles umgestellt wieder"}, {"id": 6, "start": 30.34, "end": 32.34, "text": "Danach hatte ich ja keinen teams anruf zum glück mehr"}, {"id": 7, "start": 32.74, "end": 34.74, "text": "Nach 22 Uhr kommt es selbst vor"}, {"id": 8, "start": 41.54, "end": 46.7, "text": "So jetzt müssen wir erstmal checken ob ich mehr bitrate einstellen kann. Huge bitrate"}, {"id": 9, "start": 46.7, "end": 53.02, "text": "Weil ohne mehr bitrate wird battlefield sackig aussehen"}, {"id": 10, "start": 54.3, "end": 58.42, "text": "Output ja 4,9 viel zu viel 6,6,9 braucht man mindestens"}, {"id": 11, "start": 59.9, "end": 66.46, "text": "Deutschland deutsches internet jetzt wirds wieder kompliziert 7,9 6,9 aber schauen ob das funktioniert"}, {"id": 12, "start": 66.46, "end": 76.78, "text": "Geht nicht hoch, warum geht das nicht auf? Wait a minute, keg weight"}, {"id": 13, "start": 81.9, "end": 83.9, "text": "Eigentlich sollten die settings jetzt raufgehen"}, {"id": 14, "start": 86.54, "end": 89.74, "text": "Ah das ist nvnk, nvnk kann den scheiß ja nicht"}, {"id": 15, "start": 91.94, "end": 94.38, "text": "Okay, ich muss noch mal kurz streamen außen wieder anmachen"}, {"id": 16, "start": 94.38, "end": 98.54, "text": "Erst noch mal schnell checken. Moin Hexer, noch mal kurz checken ob"}, {"id": 17, "start": 98.54, "end": 127.66, "text": "Ich irgendwie Delay drin hab, nee Delay braucht man nicht. Stream style bei Battlefield 3 gibt es keine mehr, keg weight"}]}