{"text": "Jetzt sollte es Twitch gecheckt haben, hoffe ich. Wupp wupp. Hat es Twitch kapiert. Lass mal gucken. Twitch. Jawoll, passt, alles gut. Jetzt haben wir mehr Bitrate. Jetzt sollte das ganze flüssiger aussehen. Schauen wir mal. Jetzt muss ich mir Werbung angucken, ernsthaft. Ich muss mir Werbung auf meinem eigenen Channel angucken. Dass ich meine Streamsettings überprüfen kann. Das ist schon geil. Ja, ich bin schon mal online, aber nicht lang. Zwei Stunden, eineinhalb Stunden, mal gucken. So, wartet mal kurz. Wo ging das jetzt noch mal zum Nachschauen? Video Stats, ne? So, passt. Playback, 6,9. Oh, Girls, Alter. Moment, ich weiß, dass ihr nichts seht. Das ist Absicht. Checkweight. So, jetzt seht ihr wieder was. So, und jetzt sollte der irgendwann auch mal joinen. Guck mal, Game lädt schon. Wir müssen mal gucken, wie das ausschaut, ob die Sound-Lautstärke okay ist. Probieren wir mal aus. Bin wir da nicht... Ups, bin wir da noch nicht so sicher. Müssen wir mal gleich mal schauen. Oh nein, Bazaar, Alter. Please. Jetzt wird's gleich richtig, richtig eklig. Okay, ich glaub, wir gewinnen. Erst mal OP M16, Klaas. Wait a minute. Ruckelt das? Sack. On. Ich weiß nicht, ob ihr das seht. Ich mach grad ein Video-Overlay-Settings. Performance, Position. Moment, FPS. Weg. Ah. Okay, es ruckelt, also 200 FPS sollte eigentlich nix ruckeln. So, wird bestimmt gleich wieder geflammt. Leute, ihr könnt euch nicht vorstellen, wie auf diesen... Wie auf diesen Server... Es gibt ja nur noch drei Server oder so, wo da gespielt wird. Wie viel da immer noch drauf geflammt wird, ich komm da nicht klar. Da wird so krass geflammt immer noch bei dem Game. Ich weiß gar nicht, warum. Oh, es laggt, Alter. What the fuck? Okay, krasser Stels. Krasser Flank-Stels. Okay. Übrigens, dass das Game so ausgepleicht aussieht, ist normal. Das ist halt das Game. In your face, Alter. Oh, oh. Schreckt. Next, please. Oh, da fällt eine Levierung. Warum macht der denn so was? Anzeige ist raus. Flame in 2K21. Ey, ist echt so. Ich weiß nicht, was mit den Leuten los ist. Die sind so hardcore am flamen hier auf diesen letzten verbliebenen Battlefield-Servern. Ich weiß gar nicht, warum. Hier ist übrigens Spawn drin. Hier ist das PS... Hier ist Spawn drin. Ich weiß gar nicht... Ist die Lautstärke okay vom... Also ist die Lautstärke vom Game in Ordnung? Achtung, huge res. Oh. Ich werde beschuttet. Passt? Sehr nice. Sehr, sehr. Exquisite, kann man dazu nur sagen. Irgendwo hier... Irgendwo hier drin wird gestälzt. Wieder ist down. Warum... Warum stirbt der einfach? Lul. Wie sie sich aus der Hüfte wegsprayen lassen. Erstmal sinnlosen. Spray und pray bis tot ist er. Lul. Ich habe gar... Warum... Warum wir mit Iron Sands gehen? Einfach draufhalten. Wo gehen hier was? Wo ist hier was los? Ah, okay. Post-Champ. Wo geht hier was? Na? Co-Comrade? Co-Comrades? Ist das live? Klingt schwer nach Replay. Jaja. Paid Actors, weißt du doch. Paid Actors. Paid Actors Replay. Oh, oh, oh. Jetzt kommt Massive Flank. Achtung Leute. Huge. Okay. Oh, da kommt was. Da kommt was. Achtung. She baited. Von rechts kommt auch noch was. Ich renn jetzt wahrscheinlich voll rein. Irgendwo hier sind sie doch. Oh nee, sind die down? In the ass? Oder wie's die Soldaten in Battlefield 3 sagen? I get fucked up in the ass over here. Kommst du da raus? Kommst du um die Ecke? Komm um die Ecke. Komm um die Ecke. Du lebst doch noch. Oder auch nicht. Komm her. Move. Die killen ja alles. Was ist hier los? Ich seh nix. Wir sprechen mal in the hole. Oh, hab ich, hab ich, hab ich Squad-Dings? Suppression? Weniger Suppression? Ja zum Glück. Excellent. Huge Flank. Geh nix. Jetzt, jetzt stell's. Ok, da müssen wir jetzt rüber. Push, Pusherman. Nein. Zu früh Pusherman. Alter, was ist denn mit denen los? 49,5 die ersten paar. Das heißt, die Runde läuft auf jeden Fall schon eine ganze Weile. Was cool ist, wir sind reingekommen. Die Runde war noch irgendwie halbwegs, halbwegs offen. Und jetzt ist übelst, übelst Spawn-Rape angesagt. Guck dir das mal an. 478. Oh, jetzt, jetzt hier. Da kommen sie. Schreck. Oh, oh, oh. Oh, oh. Die sind da noch, ich hab Schiss. Ah, gehst du fort? Ok, ok. Nein, nein, nein. Alter, wo, wo, wo? Move from base, noobs. So sieht's aus. Alter. Ich verpiss mich jetzt. Moin. Heute können die die Sprüche nicht mehr bringen. Nee, auf gar keinen Fall. Ich seh nix. Ja, na klar. Mit der G3 erst mal übelst angeballert. Und jetzt. Der G3, man. Der fucked up in the ass over hier. Lass mich in Ruhe. Wo ist er? Ok. Push, push gels. Hier ist er doch, oder? Der muss doch, der muss doch hier. Oh nein. Unverwundbarkeits-Klitsch. Ja, das ist halt das Problem, wenn du so olde Games spielst, ne? Unverwundbarkeits-Klitsch Nice hack, GG Eats Ja, das ist halt das Problem, wenn du so alle Games spielst, ne? Zum Glück sackt er auch damit. Guck mal, hallo, kein Quake, Alter. Oder er hat mega miese Hit-Rack, aber ich weiß nicht, ich hab komplett durchgesprayed. Okay, die schießen aus. What the fuck, Alter? Hier liegt einer. Sag mal, the fuck? Aber Cheater sackt halt richtig. Ich versteh's gar nicht. In so nem alten Game, warum cheatet man da? Oder es war halt Server-Fail. Ich mein, ich hab ja straight durchgeschossen. Das ist aber so, das kann in Battlefield 3 auch mal vorkommen. Das kann auch mal vorkommen in dem Game. Ah, da oben ist Stels. Hier, jetzt. Achtung, wallbang nade. Bam, der hat nix gehittert. Ah, ah, ah, lass mich nicht in Line of Sight, Alter. Okay, wobei ich gerne hier durchpushen würde, ne? Ah ja, können wir. Ihr müsst mal auf den Chat achten, wie hardcore die rumflamen, immer noch. Und das auch im Jahr 2021 in Battlefield 3, das kann man sich gar nicht vorstellen. Man glaubt es nicht, aber es ist echt so. Ist jetzt grad ein bisschen schwierig, hier rauszukommen. Oh, da kommt ein LRV rumgefahren. LRV, gehst sofort. Rechts um die Ecke steht... Warum? Der C4 denn jetzt? Wohin, wohin, wohin? Ah, das war ein anderer. Der C4, ich wollte ihm zugucken, wie er mit dem Auto C4... Friendly ist nicht möglich, ne. So geil. Das Geflame ist so hart in dem Spiel, immer noch. Ich weiß gar nicht warum. Ich mein, das Spiel ist so alt. Also ich versteh nicht, wie man da jetzt noch cheatet, geschweige denn, irgendwie die Mutterflamen muss so. Okay, huge massive flank. Okay, der macht das gleiche wie ich. Der macht das gleiche wie ich. Der aimt auf die Ecke. Mal gucken wer schneller ist. Wo ist er? Oh fuck ey, dabei war das richtig gut drauf. Naja. Der sitzt immer noch da, ich sag's euch. Oder auch nicht. Da sitzt er, der ist den ganzen Tag. Nein, nein, nein, nein, lass mich in Ruhe. Na fuck. Sind sie da von, was haben sie übelst? Ah, von beiden Seiten gesandwicht. Wie gesagt, Friendly Fire gibt's nicht. So, gehen wir jetzt hin. B, C, C, easy, easy. What the fuck. Oh hier oben ist mir ein bisschen offen. Und da unten fährt der L.A.V. rum. Warum schießt der, warum schießt der denn damit aus L.A.V.? Man weiß nicht. Aber wir haben gewonnen. Easy, easy win. Nächste Runde, mal gucken was nächste Runde für eine Map kommt. Wahrscheinlich Metro oder sowas. Dann steige ich, dann steige ich geistig schon wieder aus, wenn jetzt Metro kommt. Wahrscheinlich kommt jetzt Metro klar. Im Headclitch. Ja, das wusste. Immer easy. Nächste Runde, ich predicte mal nächste Runde, mach mal 80 Kills. Bam. Ja Hardcore Server mit Friendly Fire gibt's. Das ist richtig. Nein, das ist nicht Venice. Venice ist dead AF. Leider. Ich glaube, ich mache Window Mode an, dass ich sinnlose Emotes spammen kann. Ich habe übrigens geplant, ich mache ein Video dazu, weil jeder sagt quasi so, weil ich es gerade im Chat lese, jeder sagt so 2011 beste Gamingzeit, 2000 beste Gamingzeit, 98 beste Gamingzeit und ich glaube, es liegt daran, dass die Leute, also da spielen mehrere Sachen rein. Ja, ich finde auch, die Games waren potenziell früher besser. Zumindest wenn du dir mal so die Masse anguckst. Aber es kommt auch dazu, dass die Leute immer das geil finden, womit sie angefangen haben. Und was die Leute auch nicht vergessen, die mögen gar nicht so sehr die Games, die mögen gar nicht so sehr die Games, sondern die Zeit, in denen sie die Games gespielt haben. Wisst ihr, so von der Schule kommen No-Life, 24-7-Kreisel-Krein. Man mochte einfach die Zeit und nicht so sehr, also auch die Games aus der Zeit, aber man mochte halt vor allem die Zeit. Sowas, was ich nach der Schule zur Oma Futter gegangen, dann MMO gegrindet im Kreis, sowas. Moment, ich brauche das Auto. Wisst ihr, sowas ist eigentlich das, was die Leute mögen. Wir gehen jetzt übrigens direkt zu B und lassen uns vom Pantsman ficken. Oder wir gehen direkt zu C, wir gehen direkt zu C und hoffen der Panzer trifft uns nicht. Easy, easy clap C. So, easy win. Sind die Gegner? Die Gegner, wo sind sie? Da oben kommt ein Panzer. Oder auch nicht. Wait a minute. Wo sind sie denn? Ah, da kommt, oh, oh, oh, oh. Schreck. Kommt nur ein Auto, einfach um die Ecke gefahren. Can't wait. Deswegen mag ich Battlefield, da passiert immer so random shit einfach. Warte mal, ich blick gerade nicht durch. Wo sind wir denn hier? Oh, oh, oh. Okay, Schnaps. Muss weg, muss weg. Der kann uns übelst nice up-aim hier oben. Stelltsen wir mal hier rauf. Huh, huh. I get, I get fucked up in the ass over here. Oh, da ist voll. Oder, what? Headshot? Ich glaube es geht los. Einfach mal so random in die Richtung geschossen, easy. Oh, ich glaube die bashen uns hier. Richts, richts, hardcore, hardcore bash. Alter, what the fuck? Hinter uns? Okay, okay, sack, sack. Okay, ich weiß nicht wo er hin ist, der Dude. Aber es gefällt mir auf jeden Fall nicht. Genau, gehen wir aufs Dach. Guck mal, wann der Dude hier rauskommt. Mist, schon weg. Okay, flank, flank stellts. Krieg ich den? Ich guck mal ob ich den gerätst krieg. Oh, oh, oh, oh. Lass mich in Ruhe. Das war ein Gegner übrigens glaube ich, oder? Der Schneibermann, der Schneibermann, guckt euch an. Einfach, einfach nicht beachtet. Okay, jetzt, jetzt stellts. Die kommen hier gleich lang stellts, ich sag es euch. Gucken wir mal, gucken wir mal von oben was hier, was hier so los ist. Oh, der ist einfach leck, guck mal ich komm, komm die Treppe hoch. Wo, wo sind sie? Okay, die holen wir jetzt. Easy, easy, easy, easy, easy clap, easy clap. Pass mal auf, easy clap. Und S, jawoll. Massive flank. So, erstmal kurz einnehmen. Schneibermann, Schneibermann. Pass auf, der headshot mich jetzt wieder übelst random across. Sag mal, was mir gerade auffällt, ich dachte gerade im Hinterkopf irgendwie, die haben das erst seit Battlefield 4 gemacht mit dem Sniper Scope, dass man das sieht. War das echt schon immer in Battlefield 3? Anscheinend, ja die werden das jetzt ja nicht 15 Jahre danach gepatcht haben oder so. Ja, war schon immer. Ja, ich weiß es, ich dachte das wäre irgendwie so krasse Neuerungen gewesen in BF4, aber nein, anscheinend. Anscheinend war das auch schon in BF3 so doof. Der ist auf dem Dach, oh, der Levy. Laff. Oh Leute, ich seh schon, das läuft, das läuft auf Spawn Rape raus. Leute, das läuft auf Spawn Rape raus. Wir assisten einfach den Gegnern gleich. Wenn die Spawn rapeen, assisten wir den Gegnern und lassen uns, lassen uns destroyen. Da ist übrigens was auf dem Berg. Ich weiß nicht so genau wo, aber irgendwo auf dem Berg. Weckt. Oh, das läuft auf Spawn Rape raus, ich sag's euch. Die russische Seite verliert hier fast immer, ich hab schon beides gesehen. Und ihr wisst, ich hab schon beides gesehen. Aber ja, potentiell hast du recht, potentiell ist es auch tatsächlich eher so. Egal, Yolo Rats Time, treffen eh nix. Okay, ich guck mir den Spawn Rape zwei Minuten an und dann assiste ich. Zick zack, zick zack, ich hab Schiss. So, erstmal kurz hinstelzen. Ich seh nix. Hab das gehört? Get fucked up in the ass over hier. Da werden so heute alle getriggert bei den Sprüchen von Battlefield 3. Lol, was war das für ein Kill? Hab das gesehen? Haha, die Kills, Gangway. M16 Spray in die Richtung, easy clap, easy clap. Oh, oh, da kommt ein Pantsman angestellst. Noch mehr, noch mehr. Hier gucken sie auch ganz gern um die Ecke, die geh ich nass. Ich hab direkt ein Panzer vor der Nase, man. Ich hab direkt ein Panzer vor dem Gesicht. Okay Leute, meint ihr, wir sollen assisten, wir sollen nett sein und den Surfer am Leben halten. Sollen wir assisten und uns Spawn Rappen lassen? Geiz, kommen wir assisten und lassen uns Spawn Rappen. Ei, ei, ei, ei, ei, wir wollen uns anwesend. Ja, sobald die sterbe assist ich. Erstmal, erstmal. Pass auf, ich retz den Moment. Das ist eigentlich dumm. Ich retz die Leute, die ich gleich gegen mich hab, wenn ich assiste. Das ist eigentlich dumm. Eigentlich müsste ich die jetzt sabotieren und dann assisten. Hier geht ja nix, hier geht ja nix raus. Erstmal grob in die Richtung gesprayt. Okay, pass auf, jetzt Yolo Time. Die haben schon gar keinen Bock mehr, die Gegner. Im Panzer bleiben und hinten in der Base. Nee, das ist dumm. Keck. By the way, hier ist beste Posey. Hier ist beste Posey für Spawn Rapp. Nicht, dass ich das jemals machen würde. Oh, da kommt ein Panzmann. Achtung, Panzer. Nice, den lass ich durch. Gut, auf der anderen Seite, was soll ich auch sonst machen? Okay, die haben C eingenommen, vielleicht schaffen sie es doch raus. Ach komm, Leute, ich helf denen jetzt. Scheiß drauf. Assist. Bam. Jetzt. Wird oft geräumt. In your face. Wo war die Moab? Der Server hat eine Nuke aktiviert, also wenn du, oh nee, Nuke Squad, sieht schon besser aus. Also wenn du zu sehr abgehst, wenn du zu sehr abgehst, wirst du ein paar Mal genugt. Moment, ist der AFK? Geiler Dude. Das ist mal AFK. So, jetzt sind wir auf der anderen Seite. Jetzt sind wir auf der anderen Seite. Easy win, ich sag's euch, wenn man nicht hängen bleibt. Easiest win of my life, ja. Da steht garantiert einer, weil da steh ich auch immer. Fuck. Dass deine Maus nicht geht, nee, das sagt mir nix. Okay, die haben alle gelieft. Bin grad am Rätsel, ob das mit dem Assist doch so ne gute Idee war, aber trotzdem easy win jetzt. Pass mal auf. Da kommt der Panzer rangefahren. Da kann ich jetzt nicht peeken, das krieg ich auf den Sack. Guckt's euch an. Guckt's euch an. Was willst du denn hier machen? Kack. Sind sie auch noch mit dem LLV am Start hier, ich fass es nicht. Kurz rein spotten, da ist nix mehr, oder? Da ist nix mehr. Kannst du mal, krasser Elite-Soldat, kannst du mal durchs Fenster springen, ohne hängen zu bleiben. Okay, die sind überhaupt nicht mehr dran. Die sind hier überhaupt nicht mehr. Oh doch, da rechts war was. Da bashen wir jetzt von der Seite rein, wenn die hier langstelsten. Aber ist nix mehr. Die haben sich alle verpisst, aber die stehen immer noch voll vor der Base. Bam, in der S. Oh fuck. Leute, hier ist ein wenig die Kacke am Dampfen, hier kommen wir nicht raus, vergesst se. Shit. Tja, krasser Spawn-Rape. Aber ey, ich hab's versucht, ich hab's wenigstens versucht. Der Typ ist immer noch Afka. Der moved, der bewegt sich, aber was macht der denn da? Hier kannst du nicht raus, kannst vergessen. Die einzige Sache, wo wir raus können, ist auf der anderen Seite, hier es sackt. Wir bräuchten guten Panzerfahrer, also haben wir ein, zwei gute Panzerfahrer, easy. Aber so, nope. Das dumme ist, ich hab ja selbst zu dem Spawn-Rape mit beigetragen. Wenn ihr joinen wollt, easy win. Ich hab ja selbst zu dem Spawn-Rape mit beigetragen, weil ich hier am Anfang andere Seite gespielt hab. Der Typ ist immer noch da hinten, da können wir jetzt nicht raus. Ich mein, wir können Counterspawn-Rapen, also aus dem Spawn ein paar Kills machen, aber Sinn und Zweck der Übung ist es nicht. Alter, guckt euch das mal an. Kack Wade. Oh, Kack Wade. Ich seh nix. What the fuck is happening? Ok, nice. Gute Sicht, gute Sicht. Äh, ich spiel auf, äh, ich spiel auf dem hier. Zack, äh, der ist es glaube ich. Ja, äh, der hier. TLR2. Der Typ ist immer noch auf, der ist nicht auf, gerade hat's gedreht. Ich weiß was der macht. Der RPGt einfach den ganzen Tag. Der Jevil nennt den ganzen Tag vor der Brücke. Geil, nicer Dude. Das bringt's. Muss kurz trappieren. Nein, nein, musst kein BF3 runterladen. Ich sag die spielen ja nur noch ne Stunde oder so. Ich mein, wir können auch den ganzen Tag hier stehen und die Gegner bashen, die pieken, ne? Ist kein Problem. Easy, easy. What? Kick. Ich mein, wir können hier 30 Billionen Kills machen, ist kein Problem. Ist gar kein Problem, wir können hier 50 Billionen Kills machen, den ganzen Tag. Oh ne. Die Granate, beste. Meine Güte. Das ist ganz schlecht. Das ist ganz schlecht. Meine Güte, du kannst hier nicht mal den Kopf rausstecken. Kopf rausstecken, Verbotener. Bam. Das kann sich aber voll komplett knicken. Okay, haben wir hier irgendwie noch Muni? Muni? Muni? Oh ja, da vorne haben wir Muni. Okay, ich brauch eh neue Munition. 25, jetzt mal ernsthaft, guck mal. Der nächste hat 5, 15. Was ist denn hier wieder los? Mysterion, Dankeschön für den Sub. Ey Leute, ich steh jetzt einfach die ganze Zeit hier und schieß grad aus. Easy Kills, mir egal. Wenn die Gegner da Bock drauf haben. Wenn die Gegner da Bock drauf haben, mach ich das easy, easy clap. Da ist er. Ja klar, nix gehitted. Okay, wie kommen wir hier raus? Vermutlich gar nicht. Vermutlich gar nicht. Hallo, please. Au. Erstmal hinter den Mülleimer legen. Meine Güte. Ich fass das net. Das ganze Klicken, hier kommst du nicht raus. Vielleicht verlängere ich ja sogar das Leiden hier der Leute, wenn ich sie retze. Ja, aber was soll ich machen? Ich meine, ich kann da schlecht rauslaufen. Leute, ich kann hier nicht rauslaufen, wenn ich rauslaufe, krieg ich auf den Sack. Kommt raus. Das ist ja voll lächerlich. Spielst du POE? Ich hab die letzten Seasons nicht mal gespielt, nee. Passt mal auf hier, Massive Jump Attack. Wie kommt man hier rauf? Kommt man hier überhaupt rauf? Stelsman ist unterwegs. Hier kommt man nicht weiter, okay. Da Stelsman. Geiler, das hat sich aber gelohnt, das hat sich ja richtig gelohnt da langzustellen. Was sagt ihr eigentlich, der Typ steht immer noch hinten mit seinem Launcher. Ja, nehm ein, nehm ein, ich spawn sofort bei dir, Kollege, ich spawn sofort bei D. Auf, nehm ein. Oh nee, Panzer ist down. Fuck. Jetzt nehmen die anderen wieder ein. RIP. Campers are everywhere. Naja, das sind ja keine Campers im eigentlichen Sinne, wo sollen sie sonst hin? Aber komm mal, jetzt werden die Gegner genugt, das ist gut. Nuke sie weg, dann können wir rauspushen. Jawoll, Gegner sind alle tot, alle tot. Sie sollten zumindest alle tot sein. Okay, wir versuchen mal raus zu pushen. Keg, Kegweight, mal gucken wie weit wir kommen. Oh nee, da kommt ein Panzer. Kommt ein Panzer, auf mich direkt, auf mich zugefahren. Oder? Nee, da steht er einfach nur. Jetzt ist einer eingestiegen. Fucked up in the ass over here. Fuck, man, warum ist denn jeder Ecke da einer von denen? Okay, wir sitzen wieder hinten im Spawn. Nice. GG Eats. Sehr gut. Perfekt. Ganz doll. Okay, easy, easy, easy clap, easy clap, easy clap. Oh, oh. Monkey ass. Wallbang nade, die kommt richtig gut, die müssen jetzt moveen. Direkt. Fuck, das sind zu viele. Wir kommen einfach nicht vorwärts, man. Killt was, Leute. Schrecklich, Spawnrape unten. Ja, dass du spawnen bringt ja noch nicht einmal was. Man kommt eigentlich prinzipiell hier nur über die rechte Seite gescheit wieder raus. Oder? Oder? Man hat eins, zwei richtig gute Panzerfahrer und Support dafür. Das funktioniert. Das funktioniert auch. Okay, aber es ist gleich vorbei. Ist gleich vorbei. Und sitzen sie schon wieder hier? Na klar. Na klar. Na klar, sitzen sie da schon wieder. Was sonst? Was sonst? Keg. Was macht der hier? Oh, da liegt der Busch, den kann man nicht retzen. Das Nuke hat ja nichts gebracht. Ultrakratze braucht den Panzer. Ja, flame ihn. Flame ihn. Beleidigt die Mutter? Dann gibt er dir bestimmt den Panzer. Das hast du dir so gedacht, Kollege. What the fuck? Was hält der Dude aus? Was halten die Dudes gerade alle aus? Das ist nicht Hardcore. Das ist nicht Softcore. Das ist Double XP. Nicht Double XP. Was laber ich für ein Stuss? Double HP. Ja, ich treff nicht. Das stimmt auch. Ich musste eigentlich anders schießen auf die Range. Oder? Ich muss mir wieder angewöhnen, wie man gut runterziehen kann. Was ich nicht kann. Egal, ich bin... Sucuk ist da drüben. Sucuk. So, jetzt kommen wir jetzt raus. Wie sie hier und her ruckeln. Wir haben drei Poggers, aber Massive Poggers. Ich hänge. Jetzt haben sie mich auf dem Radar drauf, weil sie mich gehittert haben schon mal. Mal drüber spotten. Jetzt steht auch noch direkt im Gesicht der Panzer. Easy Rats. Zack. Und nichts wie weg, weil die campen hier sich schon wieder ein ab. Ich sehe es genau. Guckst du dir an? Guckst du dir an? Du kannst hier eigentlich... Klar. Das ist nicht Venice, weil Venice ist dead. Leider. Leider ist Venice dead. Achtung. Ah. Kann man hier irgendwie durch mit dem Auto? Nein. Ich muss dich verstecken hier. Lass mich um die Ecke. Jawoll. Sehr gut. Weg. Nice. Hilfe. Ich will um die Ecke. Nein. Nein. Okay. Ich bin weg. Huge driving skills. Ich habe keinen Bock, den ganzen Tag an dieser kack Ecke hier zu hocken. Was soll das geben, wenn es fertig ist? Okay. Please. Steck deinen Kopf raus. Wo ist er? Wo bist du, Dude? Komm her. Okay, der ist down. Alter. Du kannst keine Ecke. Du kannst aus keiner Ecke rausgucken hier, ohne instant auf die Fresse zu kriegen. Warum bin ich so dumm gewesen und habe assistet? Sag mal. Warum habe ich assistet? Na doch, ich habe assistet, weil ich gedacht habe, dass kommen ein paar Leute mit und wir bashen die jetzt, weil ich mag so diese ganze Spawn-Rape-Geschichte nicht. Ich mag kein Spawn-Rape. Jetzt wird gerätzt und ich kriege den Kill geklaut. Die Panzer haben es auch nicht leicht. Ja, die ganze Gegner geiern nur da drauf. Die geiern den ganzen Tag nur darauf, dass irgendwie sich was um die Ecke bewegt, um da gebashed zu werden. Schön, wenn sie alle Objectives kontrollen. Ist jetzt ja nichts neues. Mann, fuck. Warum ist da noch einer? Ich hatte sie gerade so schön drin. Alle weggesprayt an der Mauer hätte ich jetzt alle weggesprayt. Stimmt, smoke die rechte Seite. Da hast du recht. Das machen wir jetzt. Customize. Wie ging das nochmal? Appearance? Nee, warte. Wait a minute. Schon eine Weile nicht mehr gemacht hier. Smoke. Wir müssen smokeen, hast recht. Aber ich fürchte, wir kommen trotzdem trotz des Smoke nicht weit. Massive Smoke. Wie kann das eigentlich sein, dass das Residium komplett negativ ist? Ich wäre schon abgeaimt, wenn ich nur rauslaufe, Mann. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Fuck. Da andere Seite hat er gesessen. Ja, das sackt halt ein bisschen bei der Map. Egal. Wir smokeen jetzt eine Weile rum. Runde Smoke Action. Nice. Das ist wenigstens mal ein halbwegs guter Spawn. Fuck, Mann. Du kannst hier nicht... Du warst zweimal auf der Winnerseite. Ja, das ist auch mega langweilig. Smoke links. Du kommst... Also meiner Erfahrung nach kommst du links wirklich schlecht vorbei. Schön Rätsel. Nice. Ah, ah, ah, ah, du kommst hier nicht mal raus. Ich weiß, wir sind immerhin mal halbwegs rausgekommen, ne? Aber ich glaub nicht, dass wir weit kommen, weil unsere Gegner, unsere Player sind halt einfach schlechter. Okay, weißt du was wir einschmarrn können, jetzt auf B. Oh fuck. Ah, nein, von hinten, fuck, ist einfach ein Sniper vor mir im Gesicht gesessen. Wo? Ja, ja, guck mal da. Mein Gott, warum ist der Spawn immer noch da hinten? Hätte ich nicht mal mitpushen können, Leute. Der hinter setzt doch ein Dude, oder? Nein, man, ich wollte die gerade retzen, die zwei da hinten. Shit. Ey Leute, wir probieren alles, wir probieren alles, ne, ich kann nicht mehr machen. Zockst du auch zwischendurch BR4? Ich hab letztens mal wieder BR4 installiert, ja, aber ich spiel hauptsächlich BR3, wenn überhaupt. Fuck. Ich mein, ich geb wirklich alles, ne, ich geb wirklich alles, aber jetzt keine Chance, keine Chance. Hier kommste nicht raus, der Spawn ist weg, wo liegt denn der Dude, da, okay, wir probieren erst mal hier rum, weil, deswegen, in your face, Alter, okay, ich hol dich, fuck, fuck, fuck, fuck, fuck, ist auch clusterfuck da, die Ecke, es ist überall clusterfuck und überall liegen sie rum, Mensch, Pff, Mörser, jetzt Mörsern sie da rein, Alter, fuck, ne, man kann durch die Smokes teilweise markieren, wenn du vorher schon markiert hast, kannst du nachher auch markieren. Moment, wo, wo bin ich hier überhaupt, wo, wo bin ich hier überhaupt? Kannst du voll vergessen, oho, wir haben das Objective, ich fass es nicht. Aber hier kommst du jetzt wieder nicht weiter. Pff, schreckt, Alter, aber immerhin, ey, komm, wir haben es jetzt mit viel Smoke geschafft, wenigstens mal ein Objective wiederzubekommen, so, wir gehen jetzt mal kurz als Engineer rein und versuchen da zu spawnen und den Typen bisschen zu bashen, Alter, meine Güte, ey, what the fuck, please, Leute, spawn halt mal, macht doch mal irgendeiner was, macht doch mal irgendeiner was, okay, der ist wieder weg, easy, easy clap, perfekt, tja, das war wohl nix, ne, ach guck mal, wir kriegen Leute für Balance gemovet, das ist halt auch geil, wir kriegen Leute für Balance gemovet und die werden instant in den Server dann verlassen, wenn sie für Balance gemovet werden, wie war das nochmal mit den Tickets, äh nein, je mehr Objectives du hältst, umso schneller verlieren die Gegner Tickets, glaub so rum war das, oder umgedreht, ja umgedreht könnte man das auch deuten, fuck, da kommt noch zurück, okay, kommen noch 179 Tickets, was war man da, das kannst du vergessen, die Ultra Giraffe PC ist am Start, Ultra Giraffe PC, das klingt wie ein Xbox, wie so ein auto generated Xbox Game Attack, kennt ihr das noch, ja jetzt ist er einfach weg, was ey, die Suppression macht mich fertig, ich hab kein Money mehr, ich brauche Moon, haben wir es in Gears so vor immer gesagt, ich brauche Moon, du hast dich wirklich so benannt, es klingt wie so ein Xbox Game Attack, okay, check nichts mehr, ja klar, der hat mich vorher schon markiert, der Dude, fuck, fuck man, aber immerhin, ich wollte gerade sagen wir haben mehr Kills als die Gegner, aber haben wir nicht, guckt euch den Chat an, der Chat Leute, fick deine Moon als 2011, so muss das sein, guter Chat, so wie sich das gehört für ein Online-Game, guter Chat, okay, ich habe Schiss, dass da einer kommt, klar, okay Leute, es wird alles zugesmockt, Smok Action, Smok, Massive Smok, Massive Smok, Massive Smok, okay Smok ist all, hat sich ausgesmockt, fertig gesmockt, da kommt jetzt eh gleich einer hin und One-Hit-One-Shotted mich mit der Shotgun um die Ecke oder so, ha, take weight, ich habe Schiss, oh, Booba, hat er gerade gesagt, warum sagt der Booba, ich dachte Booba ist eine 2020er Twitch Erfindung, Booba, so Eric, bam, in your face Eric, so was hast du jetzt davon, Monka, dachte ich es war es, M16 Abuser, habe ich überhaupt kein Problem bei dieser Runde mit, null, null fucks given, oh fuck, hier ist noch einer, nein, der ist hinter mir, shit, wir bräuchten auch ein paar Medics, die ratzen, Alter, ich meine, guck mal, guck mal, ich hab, ohne Scheiß, ich hab 11k Punkte, der nächste hat 4,6, perfect, okay, ich, also Leute, es kann mir keiner vorwerfen, ich würde irgendwie hier nicht alles versuchen, ne, ich probier alles, wirklich, ich probier alles, kommst du raus? kommst du raus, Leute, mehr ging wirklich nicht, aber, komm, ich hab, ich hab, ich hab wirklich alles versucht und der Dude hier, die haben wahrscheinlich, das sind, das sind die typischen Panzer-Hongs, die den ganzen Tag da im Panzer rumgammeln und sonst nix machen, aber gut, wenn man es kann, ist es nicht schlecht, weil man muss ehrlich sagen, so einfach ist das in Battlefield 3 gar nicht, also, wenn Noobs in Battlefield 3 Panzer fahren, ist das ausm spawn, fahren und tot sein, hast du noch Platz, ja, ja, ja, noch Platz, wenn nicht, wenn nicht, Captain Peng, geh ich, geh ich zu dir in ein anderes Squad, aber es müsste Platz sein, da ich Panzer gameplay ne, ich kann das nicht so gut, übrigens, ich muss demnächst dann auch furtern, mal gucken, was jetzt für eine Map kommt, nein, ich hab keinen eigenen Battlefield-Server mehr, ich wollte nen Venice-Server machen, aber dann war es auch schon dead, okay, das könnte jetzt mega geil werden oder massiver Schmerz-Champ, hier Captain Peng, bist du irgendwo hier am Start schon, ah, ich join bei dir rein, passt, oh ne, jetzt ist er raus, okay, jetzt join, join, passt, gut, finger joined, oh, exellent, jetzt ist er wieder raus, keck, wait, so, wir machen mal langsam, wir machen mal, ich nehm auch keinen Smoke mit, ich nehm mal wieder Medic, Medic, Medic mit, ich warte mal bis das erste gecaptured ist, dann spawn ich rein, beste Map, Spin-Mod, erstmal Kreisler am Start, ich will eigentlich ein paar C rein, falls wir das schnell kriegen, Leute, ich krieg ja epileptische Anfälle, okay, ich spawn bei euch rein, C ist umkämpft, so, wahrscheinlich kommen gleich von vorne irgendwelche, oh, haben die da einen Heli drin im Tunnel, konnte man hier nicht drauf hüpfen, doch, haben die den Heli, die haben den fucking Heli im Tunnel, Alter, die haben den Heli im Tunnel, ich spiel jetzt nichts anderes als M16, hast doch gesehen, wir haben das letzte mal schon auf den Sack gekriegt, oh nee, shit, wir kriegen das, easy, easy, easy, jawoll, jetzt kommt der Counterspawn-Rape, Leute, ich sag's euch, Counterspawn-Rape, easy win, das ist jetzt die Rache für letzte Runde, Chalters, rennt durch, was, wie sieht es auf der anderen Seite, nein, nein, nein, oh, oh, da kommt ein Auto, fuck, ich dachte, ich krieg den anderen noch, das G3, ja, G3 ist ganz nice, aber G3 muss man brain spielen, ich hab keinen Bock mit brain zu spielen, also muss man, G3 muss man sich Mühe geben, mit aimen und so, M16 kann man einfach sprain, einfach sprain ist besser als mit brain spielen, wer spielt schon freiwillig mit brain, wenn man noch easy kills machen kann, Moment, Leute, ich muss mal kurz, ich muss mal kurz, easy, hits clap, hits clap, easy clap, weiter, weiter, weiter, man, man, manmans, man, man, spans王, man, man man man listens to me worship 2020, ultra giraffe hat es am start hier hat es hat das auto am start achtung rpg und inf wer ist geflämt rpg und inf mit so 50 kaliber in den kopf macht nix 50 kaliber in in in in in in in the head aaa ja ok ja ja ich spawn a spawn a easy a warum ach der heli stellz mann ist an a ob ich da jetzt wieder vorgelaufen es dauert auf 50 stunden wie achtung für 60 wo kam der denn her hat ist der vom heli abgesprungen oder was du wurdest ins gegner team gemoved wie jetzt was soll das anzeige ist raus dann dann kannst du wieder zurückmove also das geht muss im zweifelsfall wieder raus aber machen was du machen was du willst wo ist das auto jetzt sofort jetzt sofort packt ja möglich okay die haben spawn spawn punkt auf a das natürlich durf lass mich raus mann geil das ist immer richtig geil wenn du wenn du so wenn du so nice geblockt wirst wenn sie hinter dir stehen okay peng wird reingesporn sort mann jetzt flank flank bash der auf dem dach ist das ist wie ging das hier noch mal nein warum habe ich das ich habe das falsche geworfen normalerweise kann man durch die medikits nicht durch nicht durch reizen jetzt sind sie an z haben wir hier panzer oder irgendwas ok ich glaube der ist auf dem dach auto haben wir noch am start weiß ich wo ich was retten kann wie warum ist das der hat doch gerade gerebt ein mann auf dem dach fahre nicht mehr gut aber da konnte ich machen sonst wäre er begeht worden aber warum ist es auch so eben kaputt gegangen obwohl er repariert hat muss man nicht verstehen pushen wir mal ein bisschen vor fuck alter das ist ja alles voll das ist ja alles mal das ist ja mal das wimmelt ja nur vor gegner okay wir müssten glaube rechts rum oder links rum noch nicht so ganz sicher muss auf jeden fall jetzt was sie für was sie für stells action starten dass es was wird wollen lord killer zum glück kann sie noch nicht die op-positions besetzt aber jetzt schon oder auch nicht da oben ist da oben oder ist da unter dem auto es ist hier gerade nicht normal und wir brauchen auch ein bisschen mehr medics wirst ja nie gerätzt heute ich habe immer so viel zeit muss gleich gleich wieder essen man ey wo sind denn alle was gibt es heute das ist eine gute frage ich glaube ich glaube ich glaube spaghetti spaghetti mit tullfisch hier sind welche ich sehe nichts ich sehe meinem eigenen smoke nix das ist die op-positions steht das ist die beste pose auf der ganzen map da kannst du da kannst du so krass rein beschen f micron Ja was jetzt entscheidet euch Auf, auf, auf, auf Shit Du kriegst nicht einen Rats ab hier Weggesprayt 5 Minuten Maggi Werbung 5 Minuten Maggi Werbung Ähhhh Ich weiß nicht, ich habe Endblock an Ähh Ich habe hier ein bisschen Schiss ehrlich gesagt gerade Schiss ehrlich gesagt gerade Man Meine Jüde, du kommst wirklich keinen Meter weit panz wir brauchen Panzerstelzer Panz-Panz-Mans braver Captain Peng ist da Weiß nicht genau wo er ist ehrlich gesagt da. Oh ne Panzer direkt vor der Nase Da ist einer meine Jüde, wir kriegen gerade wieder richtig krass auf den Sack wartet mal Leute mein Essen ist fertig muss jetzt muss jetzt gleich weg, gleich Futter, Futterstelz Huge Capture Massive Back Cap, Back wie nennt man das eigentlich? Back Rage Cap, keine Ahnung Achtung, Achtung pass mal auf Massive Oh, oh, oh Warum genau bin ich gestorben? Warum genau bin ich gestorben? Was ist das? Take Wait? Warum, warum, warum ist Hä was hat, okay das müsst ihr mir nochmal erklären, weil ich jetzt gestorben bin Ich bin gestorben Okay hier geht was vorne Wo ist der, wo ist hier der Stelzer? Der ist doch hier im Berg garantiert irgendwo Andere Seite Ich seh die alle grad net What the fuck Wo sind die alle? Die Rakete hat den Boden getroffen, du warst in der Explosion, aber das Auto war da ein ganzes Stück von mir weg Okay All right All right, please, Capture Ich weiß dann echt nicht, die können, ohne Schiss, die können ja von allen Seiten jetzt kommen Hier liegt doch was drin oder, weil das nicht Captured, ah doch Ich muss mal, ich bleib mal beim Capfen pengen Oh, oh Springen bei mir ab Fuck man, ah, der hätte mir jetzt erwischt, der hätte mir jetzt erwischt Aber gut, wir haben schon hinten zweimal Sachen gecaptured, das ist net verkehrt Bin mir nicht ganz sicher, wo hier was ist Okay, ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier Ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier Ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier Bin mir nicht ganz sicher, wo hier was ist Oh what the fuck, wo ist das denn hin Shit man, wo ist denn die Rakete hin geflogen, die war absolut nicht da, wo es das Fahnenkreuz war Okay, haben wir C? Oh nice, wir haben C, C ist gut, dann gehen wir jetzt auf C Ich bin grad voll planlos, ich weiß echt nicht, wo hier was abgeht Habt ihr mal einen Plan, wo hier was abgeht? Wo geht hier was ab? Wir können jetzt gegencaptchern Ich muss essen, ich muss essen, keine Chance Komm, es captchert einfach jeder, wenn er seinen Shit Oh please Writing wieder sein shushit Oh, please. Das sah aus wie ein Friendly, oder? Das sah aus wie ein Friendly. Bam! Okay, jetzt dürfte er nächstes Mal da sein. Oben am Berg. Der lebt noch, oder? Lass mich mal hoch. Da oben hocken auch noch welche. Komm, please. Elite Soldat, spring! Spring! Hier, da ist gar keiner mehr. Ah Mist, jetzt bin ich doof. Kommt man da noch hoch? Ich muss eigentlich aufs Dach. Nee, kommt man nicht mehr hoch, kacke. Ja, nein. Leute, ich muss essen, ich muss weg. Schön, dass ihr dabei wart. Spontane Runde, BF3. Ich würde jetzt eigentlich gerne auch die Runde zu Ende spielen, aber es wird kalt. Okay, nice, uns haben wir schön gegenseitig gekillt, Leute, macht's gut, wir sehen uns im nächsten Stream. Mal gucken, vielleicht bin ich nachher noch mal da, bis dann, macht's gut, see you.", "segments": [{"id": 1, "start": 0.0, "end": 3.0, "text": "Jetzt sollte es Twitch gecheckt haben, hoffe ich."}, {"id": 2, "start": 9.0, "end": 10.0, "text": "Wupp wupp."}, {"id": 3, "start": 11.0, "end": 12.0, "text": "Hat es Twitch kapiert."}, {"id": 4, "start": 13.0, "end": 14.0, "text": "Lass mal gucken."}, {"id": 5, "start": 14.0, "end": 15.0, "text": "Twitch."}, {"id": 6, "start": 16.0, "end": 18.0, "text": "Jawoll, passt, alles gut."}, {"id": 7, "start": 18.0, "end": 20.0, "text": "Jetzt haben wir mehr Bitrate."}, {"id": 8, "start": 20.0, "end": 22.0, "text": "Jetzt sollte das ganze flüssiger aussehen."}, {"id": 9, "start": 22.0, "end": 23.0, "text": "Schauen wir mal."}, {"id": 10, "start": 23.0, "end": 25.0, "text": "Jetzt muss ich mir Werbung angucken, ernsthaft."}, {"id": 11, "start": 25.0, "end": 28.0, "text": "Ich muss mir Werbung auf meinem eigenen Channel angucken."}, {"id": 12, "start": 28.0, "end": 32.0, "text": "Dass ich meine Streamsettings überprüfen kann."}, {"id": 13, "start": 32.0, "end": 33.0, "text": "Das ist schon geil."}, {"id": 14, "start": 34.0, "end": 37.0, "text": "Ja, ich bin schon mal online, aber nicht lang."}, {"id": 15, "start": 37.0, "end": 40.0, "text": "Zwei Stunden, eineinhalb Stunden, mal gucken."}, {"id": 16, "start": 40.0, "end": 42.0, "text": "So, wartet mal kurz."}, {"id": 17, "start": 42.0, "end": 44.0, "text": "Wo ging das jetzt noch mal zum Nachschauen?"}, {"id": 18, "start": 45.0, "end": 46.0, "text": "Video Stats, ne?"}, {"id": 19, "start": 46.0, "end": 48.0, "text": "So, passt."}, {"id": 20, "start": 48.0, "end": 49.0, "text": "Playback, 6,9."}, {"id": 21, "start": 49.0, "end": 51.0, "text": "Oh, Girls, Alter."}, {"id": 22, "start": 55.0, "end": 57.0, "text": "Moment, ich weiß, dass ihr nichts seht."}, {"id": 23, "start": 57.0, "end": 58.0, "text": "Das ist Absicht."}, {"id": 24, "start": 62.0, "end": 63.0, "text": "Checkweight."}, {"id": 25, "start": 65.0, "end": 67.0, "text": "So, jetzt seht ihr wieder was."}, {"id": 26, "start": 68.0, "end": 71.0, "text": "So, und jetzt sollte der irgendwann auch mal joinen."}, {"id": 27, "start": 71.0, "end": 73.0, "text": "Guck mal, Game lädt schon."}, {"id": 28, "start": 73.0, "end": 77.0, "text": "Wir müssen mal gucken, wie das ausschaut, ob die Sound-Lautstärke okay ist."}, {"id": 29, "start": 77.0, "end": 78.0, "text": "Probieren wir mal aus."}, {"id": 30, "start": 78.0, "end": 79.0, "text": "Bin wir da nicht..."}, {"id": 31, "start": 80.0, "end": 82.0, "text": "Ups, bin wir da noch nicht so sicher."}, {"id": 32, "start": 82.0, "end": 87.0, "text": "Müssen wir mal gleich mal schauen."}, {"id": 33, "start": 87.0, "end": 89.0, "text": "Oh nein, Bazaar, Alter."}, {"id": 34, "start": 89.0, "end": 90.0, "text": "Please."}, {"id": 35, "start": 91.0, "end": 94.0, "text": "Jetzt wird's gleich richtig, richtig eklig."}, {"id": 36, "start": 98.0, "end": 100.0, "text": "Okay, ich glaub, wir gewinnen."}, {"id": 37, "start": 100.0, "end": 102.0, "text": "Erst mal OP M16, Klaas."}, {"id": 38, "start": 104.0, "end": 105.0, "text": "Wait a minute."}, {"id": 39, "start": 105.0, "end": 106.0, "text": "Ruckelt das?"}, {"id": 40, "start": 106.0, "end": 107.0, "text": "Sack."}, {"id": 41, "start": 107.0, "end": 110.0, "text": "On."}, {"id": 42, "start": 111.0, "end": 112.0, "text": "Ich weiß nicht, ob ihr das seht."}, {"id": 43, "start": 112.0, "end": 114.0, "text": "Ich mach grad ein Video-Overlay-Settings."}, {"id": 44, "start": 116.0, "end": 118.0, "text": "Performance, Position."}, {"id": 45, "start": 119.0, "end": 120.0, "text": "Moment, FPS."}, {"id": 46, "start": 124.0, "end": 125.0, "text": "Weg."}, {"id": 47, "start": 127.0, "end": 128.0, "text": "Ah."}, {"id": 48, "start": 128.0, "end": 131.0, "text": "Okay, es ruckelt, also 200 FPS sollte eigentlich nix ruckeln."}, {"id": 49, "start": 134.0, "end": 136.0, "text": "So, wird bestimmt gleich wieder geflammt."}, {"id": 50, "start": 136.0, "end": 139.0, "text": "Leute, ihr könnt euch nicht vorstellen, wie auf diesen..."}, {"id": 51, "start": 140.0, "end": 141.0, "text": "Wie auf diesen Server..."}, {"id": 52, "start": 141.0, "end": 144.0, "text": "Es gibt ja nur noch drei Server oder so, wo da gespielt wird."}, {"id": 53, "start": 144.0, "end": 147.0, "text": "Wie viel da immer noch drauf geflammt wird, ich komm da nicht klar."}, {"id": 54, "start": 152.0, "end": 154.0, "text": "Da wird so krass geflammt immer noch bei dem Game."}, {"id": 55, "start": 154.0, "end": 156.0, "text": "Ich weiß gar nicht, warum."}, {"id": 56, "start": 156.0, "end": 158.0, "text": "Oh, es laggt, Alter."}, {"id": 57, "start": 158.0, "end": 159.0, "text": "What the fuck?"}, {"id": 58, "start": 160.0, "end": 162.0, "text": "Okay, krasser Stels."}, {"id": 59, "start": 162.0, "end": 164.0, "text": "Krasser Flank-Stels."}, {"id": 60, "start": 164.0, "end": 166.0, "text": "Okay."}, {"id": 61, "start": 167.0, "end": 170.0, "text": "Übrigens, dass das Game so ausgepleicht aussieht, ist normal."}, {"id": 62, "start": 170.0, "end": 172.0, "text": "Das ist halt das Game."}, {"id": 63, "start": 174.0, "end": 175.0, "text": "In your face, Alter."}, {"id": 64, "start": 175.0, "end": 176.0, "text": "Oh, oh."}, {"id": 65, "start": 177.0, "end": 178.0, "text": "Schreckt."}, {"id": 66, "start": 178.0, "end": 179.0, "text": "Next, please."}, {"id": 67, "start": 179.0, "end": 180.0, "text": "Oh, da fällt eine Levierung."}, {"id": 68, "start": 180.0, "end": 182.0, "text": "Warum macht der denn so was?"}, {"id": 69, "start": 182.0, "end": 184.0, "text": "Anzeige ist raus."}, {"id": 70, "start": 185.0, "end": 187.0, "text": "Flame in 2K21."}, {"id": 71, "start": 187.0, "end": 188.0, "text": "Ey, ist echt so."}, {"id": 72, "start": 188.0, "end": 190.0, "text": "Ich weiß nicht, was mit den Leuten los ist."}, {"id": 73, "start": 190.0, "end": 196.0, "text": "Die sind so hardcore am flamen hier auf diesen letzten verbliebenen Battlefield-Servern."}, {"id": 74, "start": 196.0, "end": 197.0, "text": "Ich weiß gar nicht, warum."}, {"id": 75, "start": 197.0, "end": 199.0, "text": "Hier ist übrigens Spawn drin."}, {"id": 76, "start": 199.0, "end": 200.0, "text": "Hier ist das PS..."}, {"id": 77, "start": 200.0, "end": 201.0, "text": "Hier ist Spawn drin."}, {"id": 78, "start": 202.0, "end": 203.0, "text": "Ich weiß gar nicht..."}, {"id": 79, "start": 203.0, "end": 205.0, "text": "Ist die Lautstärke okay vom..."}, {"id": 80, "start": 207.0, "end": 209.0, "text": "Also ist die Lautstärke vom Game in Ordnung?"}, {"id": 81, "start": 211.0, "end": 213.0, "text": "Achtung, huge res."}, {"id": 82, "start": 216.0, "end": 217.0, "text": "Oh."}, {"id": 83, "start": 217.0, "end": 218.0, "text": "Ich werde beschuttet."}, {"id": 84, "start": 219.0, "end": 220.0, "text": "Passt?"}, {"id": 85, "start": 220.0, "end": 221.0, "text": "Sehr nice."}, {"id": 86, "start": 221.0, "end": 222.0, "text": "Sehr, sehr."}, {"id": 87, "start": 222.0, "end": 224.0, "text": "Exquisite, kann man dazu nur sagen."}, {"id": 88, "start": 224.0, "end": 225.0, "text": "Irgendwo hier..."}, {"id": 89, "start": 225.0, "end": 227.0, "text": "Irgendwo hier drin wird gestälzt."}, {"id": 90, "start": 230.0, "end": 231.0, "text": "Wieder ist down."}, {"id": 91, "start": 232.0, "end": 233.0, "text": "Warum..."}, {"id": 92, "start": 233.0, "end": 234.0, "text": "Warum stirbt der einfach?"}, {"id": 93, "start": 239.0, "end": 240.0, "text": "Lul."}, {"id": 94, "start": 240.0, "end": 242.0, "text": "Wie sie sich aus der Hüfte wegsprayen lassen."}, {"id": 95, "start": 242.0, "end": 244.0, "text": "Erstmal sinnlosen."}, {"id": 96, "start": 244.0, "end": 246.0, "text": "Spray und pray bis tot ist er."}, {"id": 97, "start": 246.0, "end": 247.0, "text": "Lul."}, {"id": 98, "start": 248.0, "end": 249.0, "text": "Ich habe gar..."}, {"id": 99, "start": 249.0, "end": 250.0, "text": "Warum..."}, {"id": 100, "start": 250.0, "end": 251.0, "text": "Warum wir mit Iron Sands gehen?"}, {"id": 101, "start": 251.0, "end": 252.0, "text": "Einfach draufhalten."}, {"id": 102, "start": 255.0, "end": 256.0, "text": "Wo gehen hier was?"}, {"id": 103, "start": 259.0, "end": 260.0, "text": "Wo ist hier was los?"}, {"id": 104, "start": 260.0, "end": 261.0, "text": "Ah, okay."}, {"id": 105, "start": 262.0, "end": 263.0, "text": "Post-Champ."}, {"id": 106, "start": 263.0, "end": 272.0, "text": "Wo geht hier was?"}, {"id": 107, "start": 272.0, "end": 273.0, "text": "Na?"}, {"id": 108, "start": 273.0, "end": 274.0, "text": "Co-Comrade?"}, {"id": 109, "start": 279.0, "end": 280.0, "text": "Co-Comrades?"}, {"id": 110, "start": 282.0, "end": 283.0, "text": "Ist das live?"}, {"id": 111, "start": 283.0, "end": 284.0, "text": "Klingt schwer nach Replay."}, {"id": 112, "start": 284.0, "end": 285.0, "text": "Jaja."}, {"id": 113, "start": 285.0, "end": 286.0, "text": "Paid Actors, weißt du doch."}, {"id": 114, "start": 291.0, "end": 292.0, "text": "Paid Actors."}, {"id": 115, "start": 292.0, "end": 293.0, "text": "Paid Actors Replay."}, {"id": 116, "start": 297.0, "end": 298.0, "text": "Oh, oh, oh."}, {"id": 117, "start": 298.0, "end": 299.0, "text": "Jetzt kommt Massive Flank."}, {"id": 118, "start": 299.0, "end": 300.0, "text": "Achtung Leute."}, {"id": 119, "start": 300.0, "end": 301.0, "text": "Huge."}, {"id": 120, "start": 303.0, "end": 304.0, "text": "Okay."}, {"id": 121, "start": 304.0, "end": 305.0, "text": "Oh, da kommt was."}, {"id": 122, "start": 305.0, "end": 306.0, "text": "Da kommt was."}, {"id": 123, "start": 306.0, "end": 307.0, "text": "Achtung."}, {"id": 124, "start": 307.0, "end": 308.0, "text": "She baited."}, {"id": 125, "start": 310.0, "end": 311.0, "text": "Von rechts kommt auch noch was."}, {"id": 126, "start": 311.0, "end": 312.0, "text": "Ich renn jetzt wahrscheinlich voll rein."}, {"id": 127, "start": 315.0, "end": 316.0, "text": "Irgendwo hier sind sie doch."}, {"id": 128, "start": 317.0, "end": 318.0, "text": "Oh nee, sind die down?"}, {"id": 129, "start": 318.0, "end": 321.0, "text": "In the ass?"}, {"id": 130, "start": 322.0, "end": 325.0, "text": "Oder wie's die Soldaten in Battlefield 3 sagen?"}, {"id": 131, "start": 325.0, "end": 327.0, "text": "I get fucked up in the ass over here."}, {"id": 132, "start": 332.0, "end": 333.0, "text": "Kommst du da raus?"}, {"id": 133, "start": 333.0, "end": 334.0, "text": "Kommst du um die Ecke?"}, {"id": 134, "start": 334.0, "end": 335.0, "text": "Komm um die Ecke."}, {"id": 135, "start": 335.0, "end": 336.0, "text": "Komm um die Ecke."}, {"id": 136, "start": 336.0, "end": 337.0, "text": "Du lebst doch noch."}, {"id": 137, "start": 337.0, "end": 338.0, "text": "Oder auch nicht."}, {"id": 138, "start": 342.0, "end": 343.0, "text": "Komm her."}, {"id": 139, "start": 343.0, "end": 347.0, "text": "Move."}, {"id": 140, "start": 351.0, "end": 352.0, "text": "Die killen ja alles."}, {"id": 141, "start": 354.0, "end": 355.0, "text": "Was ist hier los?"}, {"id": 142, "start": 358.0, "end": 359.0, "text": "Ich seh nix."}, {"id": 143, "start": 359.0, "end": 360.0, "text": "Wir sprechen mal in the hole."}, {"id": 144, "start": 363.0, "end": 366.0, "text": "Oh, hab ich, hab ich, hab ich Squad-Dings?"}, {"id": 145, "start": 366.0, "end": 367.0, "text": "Suppression?"}, {"id": 146, "start": 367.0, "end": 368.0, "text": "Weniger Suppression?"}, {"id": 147, "start": 368.0, "end": 369.0, "text": "Ja zum Glück."}, {"id": 148, "start": 369.0, "end": 370.0, "text": "Excellent."}, {"id": 149, "start": 370.0, "end": 371.0, "text": "Huge Flank."}, {"id": 150, "start": 371.0, "end": 374.0, "text": "Geh nix."}, {"id": 151, "start": 379.0, "end": 380.0, "text": "Jetzt, jetzt stell's."}, {"id": 152, "start": 382.0, "end": 384.0, "text": "Ok, da müssen wir jetzt rüber."}, {"id": 153, "start": 384.0, "end": 385.0, "text": "Push, Pusherman."}, {"id": 154, "start": 387.0, "end": 388.0, "text": "Nein."}, {"id": 155, "start": 388.0, "end": 389.0, "text": "Zu früh Pusherman."}, {"id": 156, "start": 391.0, "end": 393.0, "text": "Alter, was ist denn mit denen los?"}, {"id": 157, "start": 393.0, "end": 395.0, "text": "49,5 die ersten paar."}, {"id": 158, "start": 395.0, "end": 400.0, "text": "Das heißt, die Runde läuft auf jeden Fall schon eine ganze Weile."}, {"id": 159, "start": 405.0, "end": 407.0, "text": "Was cool ist, wir sind reingekommen."}, {"id": 160, "start": 407.0, "end": 409.0, "text": "Die Runde war noch irgendwie halbwegs, halbwegs offen."}, {"id": 161, "start": 409.0, "end": 413.0, "text": "Und jetzt ist übelst, übelst Spawn-Rape angesagt."}, {"id": 162, "start": 413.0, "end": 414.0, "text": "Guck dir das mal an."}, {"id": 163, "start": 414.0, "end": 416.0, "text": "478."}, {"id": 164, "start": 416.0, "end": 417.0, "text": "Oh, jetzt, jetzt hier."}, {"id": 165, "start": 417.0, "end": 418.0, "text": "Da kommen sie."}, {"id": 166, "start": 421.0, "end": 422.0, "text": "Schreck."}, {"id": 167, "start": 422.0, "end": 423.0, "text": "Oh, oh, oh."}, {"id": 168, "start": 423.0, "end": 424.0, "text": "Oh, oh."}, {"id": 169, "start": 424.0, "end": 427.0, "text": "Die sind da noch, ich hab Schiss."}, {"id": 170, "start": 427.0, "end": 429.0, "text": "Ah, gehst du fort?"}, {"id": 171, "start": 432.0, "end": 433.0, "text": "Ok, ok."}, {"id": 172, "start": 433.0, "end": 434.0, "text": "Nein, nein, nein."}, {"id": 173, "start": 434.0, "end": 435.0, "text": "Alter, wo, wo, wo?"}, {"id": 174, "start": 435.0, "end": 437.0, "text": "Move from base, noobs."}, {"id": 175, "start": 437.0, "end": 438.0, "text": "So sieht's aus."}, {"id": 176, "start": 439.0, "end": 440.0, "text": "Alter."}, {"id": 177, "start": 442.0, "end": 443.0, "text": "Ich verpiss mich jetzt."}, {"id": 178, "start": 447.0, "end": 448.0, "text": "Moin."}, {"id": 179, "start": 448.0, "end": 450.0, "text": "Heute können die die Sprüche nicht mehr bringen."}, {"id": 180, "start": 450.0, "end": 454.0, "text": "Nee, auf gar keinen Fall."}, {"id": 181, "start": 454.0, "end": 455.0, "text": "Ich seh nix."}, {"id": 182, "start": 458.0, "end": 459.0, "text": "Ja, na klar."}, {"id": 183, "start": 459.0, "end": 462.0, "text": "Mit der G3 erst mal übelst angeballert."}, {"id": 184, "start": 462.0, "end": 463.0, "text": "Und jetzt."}, {"id": 185, "start": 464.0, "end": 465.0, "text": "Der G3, man."}, {"id": 186, "start": 466.0, "end": 468.0, "text": "Der fucked up in the ass over hier."}, {"id": 187, "start": 468.0, "end": 470.0, "text": "Lass mich in Ruhe."}, {"id": 188, "start": 475.0, "end": 476.0, "text": "Wo ist er?"}, {"id": 189, "start": 478.0, "end": 479.0, "text": "Ok."}, {"id": 190, "start": 479.0, "end": 480.0, "text": "Push, push gels."}, {"id": 191, "start": 481.0, "end": 482.0, "text": "Hier ist er doch, oder?"}, {"id": 192, "start": 482.0, "end": 483.0, "text": "Der muss doch, der muss doch hier."}, {"id": 193, "start": 485.0, "end": 486.0, "text": "Oh nein."}, {"id": 194, "start": 486.0, "end": 489.0, "text": "Unverwundbarkeits-Klitsch."}, {"id": 195, "start": 489.0, "end": 494.0, "text": "Ja, das ist halt das Problem, wenn du so olde Games spielst, ne?"}, {"id": 196, "start": 494.0, "end": 517.0, "text": "Unverwundbarkeits-Klitsch Nice hack, GG Eats Ja, das ist halt das Problem, wenn du so"}, {"id": 197, "start": 517.0, "end": 533.0, "text": "alle Games spielst, ne? Zum Glück sackt er auch damit. Guck mal, hallo, kein Quake,"}, {"id": 198, "start": 533.0, "end": 540.24, "text": "Alter. Oder er hat mega miese Hit-Rack, aber ich weiß nicht, ich hab komplett durchgesprayed."}, {"id": 199, "start": 540.24, "end": 566.32, "text": "Okay, die schießen aus. What the fuck, Alter? Hier liegt einer. Sag mal, the fuck? Aber"}, {"id": 200, "start": 566.32, "end": 571.0, "text": "Cheater sackt halt richtig. Ich versteh's gar nicht. In so nem alten Game, warum cheatet"}, {"id": 201, "start": 571.0, "end": 576.8, "text": "man da? Oder es war halt Server-Fail. Ich mein, ich hab ja straight durchgeschossen."}, {"id": 202, "start": 576.8, "end": 587.04, "text": "Das ist aber so, das kann in Battlefield 3 auch mal vorkommen. Das kann auch mal vorkommen"}, {"id": 203, "start": 587.04, "end": 600.76, "text": "in dem Game. Ah, da oben ist Stels. Hier, jetzt. Achtung, wallbang nade. Bam, der hat"}, {"id": 204, "start": 600.76, "end": 609.88, "text": "nix gehittert. Ah, ah, ah, lass mich nicht in Line of Sight, Alter. Okay, wobei ich"}, {"id": 205, "start": 609.88, "end": 620.2, "text": "gerne hier durchpushen würde, ne? Ah ja, können wir. Ihr müsst mal auf den Chat achten,"}, {"id": 206, "start": 620.2, "end": 626.04, "text": "wie hardcore die rumflamen, immer noch. Und das auch im Jahr 2021 in Battlefield 3, das"}, {"id": 207, "start": 626.04, "end": 634.96, "text": "kann man sich gar nicht vorstellen. Man glaubt es nicht, aber es ist echt so. Ist jetzt"}, {"id": 208, "start": 634.96, "end": 642.12, "text": "grad ein bisschen schwierig, hier rauszukommen. Oh, da kommt ein LRV rumgefahren. LRV, gehst"}, {"id": 209, "start": 642.12, "end": 653.84, "text": "sofort. Rechts um die Ecke steht... Warum? Der C4 denn jetzt? Wohin, wohin, wohin? Ah,"}, {"id": 210, "start": 653.84, "end": 658.84, "text": "das war ein anderer. Der C4, ich wollte ihm zugucken, wie er mit dem Auto C4... Friendly"}, {"id": 211, "start": 658.84, "end": 673.08, "text": "ist nicht möglich, ne. So geil. Das Geflame ist so hart in dem Spiel, immer noch. Ich"}, {"id": 212, "start": 673.08, "end": 678.64, "text": "weiß gar nicht warum. Ich mein, das Spiel ist so alt. Also ich versteh nicht, wie man"}, {"id": 213, "start": 678.64, "end": 692.88, "text": "da jetzt noch cheatet, geschweige denn, irgendwie die Mutterflamen muss so. Okay, huge massive"}, {"id": 214, "start": 692.88, "end": 703.64, "text": "flank. Okay, der macht das gleiche wie ich. Der macht das gleiche wie ich. Der aimt auf"}, {"id": 215, "start": 703.64, "end": 719.08, "text": "die Ecke. Mal gucken wer schneller ist. Wo ist er? Oh fuck ey, dabei war das richtig"}, {"id": 216, "start": 719.08, "end": 735.08, "text": "gut drauf. Naja. Der sitzt immer noch da, ich sag's euch. Oder auch nicht. Da sitzt"}, {"id": 217, "start": 735.08, "end": 740.12, "text": "er, der ist den ganzen Tag. Nein, nein, nein, nein, lass mich in Ruhe. Na fuck. Sind sie"}, {"id": 218, "start": 740.12, "end": 749.52, "text": "da von, was haben sie übelst? Ah, von beiden Seiten gesandwicht. Wie gesagt, Friendly Fire"}, {"id": 219, "start": 749.52, "end": 760.08, "text": "gibt's nicht. So, gehen wir jetzt hin. B, C, C, easy, easy. What the fuck. Oh hier oben"}, {"id": 220, "start": 760.08, "end": 770.36, "text": "ist mir ein bisschen offen. Und da unten fährt der L.A.V. rum. Warum schießt der, warum schießt"}, {"id": 221, "start": 770.36, "end": 775.6, "text": "der denn damit aus L.A.V.? Man weiß nicht. Aber wir haben gewonnen. Easy, easy win. Nächste"}, {"id": 222, "start": 775.6, "end": 779.2, "text": "Runde, mal gucken was nächste Runde für eine Map kommt. Wahrscheinlich Metro oder sowas."}, {"id": 223, "start": 779.2, "end": 785.28, "text": "Dann steige ich, dann steige ich geistig schon wieder aus, wenn jetzt Metro kommt. Wahrscheinlich"}, {"id": 224, "start": 785.28, "end": 795.68, "text": "kommt jetzt Metro klar. Im Headclitch. Ja, das wusste. Immer easy. Nächste Runde, ich"}, {"id": 225, "start": 795.68, "end": 801.28, "text": "predicte mal nächste Runde, mach mal 80 Kills. Bam. Ja Hardcore Server mit Friendly Fire"}, {"id": 226, "start": 801.28, "end": 811.12, "text": "gibt's. Das ist richtig. Nein, das ist nicht Venice. Venice ist dead AF. Leider. Ich glaube,"}, {"id": 227, "start": 811.12, "end": 827.04, "text": "ich mache Window Mode an, dass ich sinnlose Emotes spammen kann. Ich habe übrigens geplant,"}, {"id": 228, "start": 827.04, "end": 831.52, "text": "ich mache ein Video dazu, weil jeder sagt quasi so, weil ich es gerade im Chat lese,"}, {"id": 229, "start": 831.52, "end": 837.32, "text": "jeder sagt so 2011 beste Gamingzeit, 2000 beste Gamingzeit, 98 beste Gamingzeit und"}, {"id": 230, "start": 837.32, "end": 842.6, "text": "ich glaube, es liegt daran, dass die Leute, also da spielen mehrere Sachen rein. Ja, ich"}, {"id": 231, "start": 842.6, "end": 847.76, "text": "finde auch, die Games waren potenziell früher besser. Zumindest wenn du dir mal so die Masse"}, {"id": 232, "start": 847.76, "end": 852.88, "text": "anguckst. Aber es kommt auch dazu, dass die Leute immer das geil finden, womit sie angefangen"}, {"id": 233, "start": 852.88, "end": 858.28, "text": "haben. Und was die Leute auch nicht vergessen, die mögen gar nicht so sehr die Games, die"}, {"id": 234, "start": 858.28, "end": 861.72, "text": "mögen gar nicht so sehr die Games, sondern die Zeit, in denen sie die Games gespielt"}, {"id": 235, "start": 861.72, "end": 867.24, "text": "haben. Wisst ihr, so von der Schule kommen No-Life, 24-7-Kreisel-Krein. Man mochte einfach"}, {"id": 236, "start": 867.24, "end": 874.12, "text": "die Zeit und nicht so sehr, also auch die Games aus der Zeit, aber man mochte halt vor"}, {"id": 237, "start": 874.12, "end": 878.08, "text": "allem die Zeit. Sowas, was ich nach der Schule zur Oma Futter gegangen, dann MMO gegrindet"}, {"id": 238, "start": 878.08, "end": 889.28, "text": "im Kreis, sowas. Moment, ich brauche das Auto. Wisst ihr, sowas ist eigentlich das, was"}, {"id": 239, "start": 889.28, "end": 893.04, "text": "die Leute mögen. Wir gehen jetzt übrigens direkt zu B und lassen uns vom Pantsman ficken."}, {"id": 240, "start": 893.04, "end": 897.92, "text": "Oder wir gehen direkt zu C, wir gehen direkt zu C und hoffen der Panzer trifft uns nicht."}, {"id": 241, "start": 897.92, "end": 919.24, "text": "Easy, easy clap C. So, easy win. Sind die Gegner? Die Gegner, wo sind sie? Da oben"}, {"id": 242, "start": 919.24, "end": 929.64, "text": "kommt ein Panzer. Oder auch nicht. Wait a minute. Wo sind sie denn? Ah, da kommt, oh, oh, oh,"}, {"id": 243, "start": 929.64, "end": 941.4, "text": "oh. Schreck. Kommt nur ein Auto, einfach um die Ecke gefahren. Can't wait. Deswegen"}, {"id": 244, "start": 941.4, "end": 948.52, "text": "mag ich Battlefield, da passiert immer so random shit einfach. Warte mal, ich blick"}, {"id": 245, "start": 948.52, "end": 954.28, "text": "gerade nicht durch. Wo sind wir denn hier? Oh, oh, oh. Okay, Schnaps. Muss weg, muss"}, {"id": 246, "start": 954.28, "end": 967.32, "text": "weg. Der kann uns übelst nice up-aim hier oben. Stelltsen wir mal hier rauf. Huh, huh."}, {"id": 247, "start": 967.32, "end": 980.2, "text": "I get, I get fucked up in the ass over here. Oh, da ist voll. Oder, what? Headshot? Ich"}, {"id": 248, "start": 980.2, "end": 991.32, "text": "glaube es geht los. Einfach mal so random in die Richtung geschossen, easy. Oh, ich"}, {"id": 249, "start": 991.32, "end": 1011.24, "text": "glaube die bashen uns hier. Richts, richts, hardcore, hardcore bash. Alter, what the fuck?"}, {"id": 250, "start": 1011.24, "end": 1026.0, "text": "Hinter uns? Okay, okay, sack, sack. Okay, ich weiß nicht wo er hin ist, der Dude. Aber"}, {"id": 251, "start": 1026.0, "end": 1033.24, "text": "es gefällt mir auf jeden Fall nicht. Genau, gehen wir aufs Dach. Guck mal, wann der Dude"}, {"id": 252, "start": 1033.24, "end": 1046.88, "text": "hier rauskommt. Mist, schon weg. Okay, flank, flank stellts. Krieg ich den? Ich guck mal"}, {"id": 253, "start": 1046.88, "end": 1051.6, "text": "ob ich den gerätst krieg. Oh, oh, oh, oh. Lass mich in Ruhe. Das war ein Gegner übrigens"}, {"id": 254, "start": 1051.6, "end": 1061.48, "text": "glaube ich, oder? Der Schneibermann, der Schneibermann, guckt euch an. Einfach, einfach"}, {"id": 255, "start": 1061.48, "end": 1080.0, "text": "nicht beachtet. Okay, jetzt, jetzt stellts. Die kommen hier gleich lang stellts, ich sag"}, {"id": 256, "start": 1080.0, "end": 1085.16, "text": "es euch. Gucken wir mal, gucken wir mal von oben was hier, was hier so los ist. Oh, der"}, {"id": 257, "start": 1085.16, "end": 1095.4, "text": "ist einfach leck, guck mal ich komm, komm die Treppe hoch. Wo, wo sind sie? Okay, die"}, {"id": 258, "start": 1095.4, "end": 1103.88, "text": "holen wir jetzt. Easy, easy, easy, easy, easy clap, easy clap. Pass mal auf, easy clap."}, {"id": 259, "start": 1103.88, "end": 1119.2, "text": "Und S, jawoll. Massive flank. So, erstmal kurz einnehmen. Schneibermann, Schneibermann."}, {"id": 260, "start": 1119.2, "end": 1132.0, "text": "Pass auf, der headshot mich jetzt wieder übelst random across. Sag mal, was mir gerade auffällt,"}, {"id": 261, "start": 1132.0, "end": 1135.4, "text": "ich dachte gerade im Hinterkopf irgendwie, die haben das erst seit Battlefield 4 gemacht"}, {"id": 262, "start": 1135.4, "end": 1139.48, "text": "mit dem Sniper Scope, dass man das sieht. War das echt schon immer in Battlefield 3?"}, {"id": 263, "start": 1139.48, "end": 1155.84, "text": "Anscheinend, ja die werden das jetzt ja nicht 15 Jahre danach gepatcht haben oder so. Ja,"}, {"id": 264, "start": 1155.84, "end": 1161.8, "text": "war schon immer. Ja, ich weiß es, ich dachte das wäre irgendwie so krasse Neuerungen gewesen"}, {"id": 265, "start": 1161.8, "end": 1175.12, "text": "in BF4, aber nein, anscheinend. Anscheinend war das auch schon in BF3 so doof. Der ist"}, {"id": 266, "start": 1175.12, "end": 1183.08, "text": "auf dem Dach, oh, der Levy. Laff. Oh Leute, ich seh schon, das läuft, das läuft auf Spawn"}, {"id": 267, "start": 1183.08, "end": 1191.84, "text": "Rape raus. Leute, das läuft auf Spawn Rape raus. Wir assisten einfach den Gegnern gleich."}, {"id": 268, "start": 1191.84, "end": 1196.76, "text": "Wenn die Spawn rapeen, assisten wir den Gegnern und lassen uns, lassen uns destroyen. Da ist"}, {"id": 269, "start": 1196.76, "end": 1206.8, "text": "übrigens was auf dem Berg. Ich weiß nicht so genau wo, aber irgendwo auf dem Berg. Weckt."}, {"id": 270, "start": 1206.8, "end": 1223.36, "text": "Oh, das läuft auf Spawn Rape raus, ich sag's euch. Die russische Seite verliert hier fast"}, {"id": 271, "start": 1223.36, "end": 1228.04, "text": "immer, ich hab schon beides gesehen. Und ihr wisst, ich hab schon beides gesehen. Aber"}, {"id": 272, "start": 1228.04, "end": 1233.2, "text": "ja, potentiell hast du recht, potentiell ist es auch tatsächlich eher so. Egal, Yolo Rats"}, {"id": 273, "start": 1233.2, "end": 1242.6, "text": "Time, treffen eh nix. Okay, ich guck mir den Spawn Rape zwei Minuten an und dann assiste"}, {"id": 274, "start": 1242.6, "end": 1258.84, "text": "ich. Zick zack, zick zack, ich hab Schiss. So, erstmal kurz hinstelzen. Ich seh nix."}, {"id": 275, "start": 1258.84, "end": 1268.4, "text": "Hab das gehört? Get fucked up in the ass over hier. Da werden so heute alle getriggert"}, {"id": 276, "start": 1268.4, "end": 1276.88, "text": "bei den Sprüchen von Battlefield 3. Lol, was war das für ein Kill? Hab das gesehen?"}, {"id": 277, "start": 1276.88, "end": 1292.24, "text": "Haha, die Kills, Gangway. M16 Spray in die Richtung, easy clap, easy clap. Oh, oh, da"}, {"id": 278, "start": 1292.24, "end": 1300.2, "text": "kommt ein Pantsman angestellst. Noch mehr, noch mehr. Hier gucken sie auch ganz gern"}, {"id": 279, "start": 1300.2, "end": 1314.6, "text": "um die Ecke, die geh ich nass. Ich hab direkt ein Panzer vor der Nase, man. Ich hab direkt"}, {"id": 280, "start": 1314.6, "end": 1324.44, "text": "ein Panzer vor dem Gesicht. Okay Leute, meint ihr, wir sollen assisten, wir sollen nett"}, {"id": 281, "start": 1324.44, "end": 1332.72, "text": "sein und den Surfer am Leben halten. Sollen wir assisten und uns Spawn Rappen lassen?"}, {"id": 282, "start": 1332.72, "end": 1350.48, "text": "Geiz, kommen wir assisten und lassen uns Spawn Rappen. Ei, ei, ei, ei, ei, wir wollen uns"}, {"id": 283, "start": 1350.48, "end": 1362.56, "text": "anwesend. Ja, sobald die sterbe assist ich. Erstmal, erstmal. Pass auf, ich retz den Moment."}, {"id": 284, "start": 1362.56, "end": 1366.88, "text": "Das ist eigentlich dumm. Ich retz die Leute, die ich gleich gegen mich hab, wenn ich assiste."}, {"id": 285, "start": 1366.88, "end": 1375.04, "text": "Das ist eigentlich dumm. Eigentlich müsste ich die jetzt sabotieren und dann assisten."}, {"id": 286, "start": 1375.04, "end": 1397.84, "text": "Hier geht ja nix, hier geht ja nix raus. Erstmal grob in die Richtung gesprayt. Okay, pass"}, {"id": 287, "start": 1397.84, "end": 1407.6, "text": "auf, jetzt Yolo Time. Die haben schon gar keinen Bock mehr, die Gegner. Im Panzer bleiben"}, {"id": 288, "start": 1407.6, "end": 1420.12, "text": "und hinten in der Base. Nee, das ist dumm. Keck. By the way, hier ist beste Posey. Hier"}, {"id": 289, "start": 1420.12, "end": 1425.24, "text": "ist beste Posey für Spawn Rapp. Nicht, dass ich das jemals machen würde. Oh, da kommt"}, {"id": 290, "start": 1425.24, "end": 1431.2, "text": "ein Panzmann. Achtung, Panzer. Nice, den lass ich durch. Gut, auf der anderen Seite, was"}, {"id": 291, "start": 1431.2, "end": 1434.48, "text": "soll ich auch sonst machen? Okay, die haben C eingenommen, vielleicht schaffen sie es"}, {"id": 292, "start": 1434.48, "end": 1445.52, "text": "doch raus. Ach komm, Leute, ich helf denen jetzt. Scheiß drauf. Assist. Bam. Jetzt."}, {"id": 293, "start": 1445.52, "end": 1454.48, "text": "Wird oft geräumt. In your face. Wo war die Moab? Der Server hat eine Nuke aktiviert,"}, {"id": 294, "start": 1454.48, "end": 1467.36, "text": "also wenn du, oh nee, Nuke Squad, sieht schon besser aus. Also wenn du zu sehr abgehst,"}, {"id": 295, "start": 1467.36, "end": 1476.96, "text": "wenn du zu sehr abgehst, wirst du ein paar Mal genugt. Moment, ist der AFK? Geiler Dude."}, {"id": 296, "start": 1476.96, "end": 1487.64, "text": "Das ist mal AFK. So, jetzt sind wir auf der anderen Seite. Jetzt sind wir auf der anderen"}, {"id": 297, "start": 1487.64, "end": 1497.16, "text": "Seite. Easy win, ich sag's euch, wenn man nicht hängen bleibt. Easiest win of my life,"}, {"id": 298, "start": 1497.16, "end": 1516.28, "text": "ja. Da steht garantiert einer, weil da steh ich auch immer. Fuck. Dass deine Maus nicht"}, {"id": 299, "start": 1516.28, "end": 1529.92, "text": "geht, nee, das sagt mir nix. Okay, die haben alle gelieft. Bin grad am Rätsel, ob das"}, {"id": 300, "start": 1529.92, "end": 1541.88, "text": "mit dem Assist doch so ne gute Idee war, aber trotzdem easy win jetzt. Pass mal auf. Da"}, {"id": 301, "start": 1541.88, "end": 1546.6, "text": "kommt der Panzer rangefahren. Da kann ich jetzt nicht peeken, das krieg ich auf den"}, {"id": 302, "start": 1546.6, "end": 1557.88, "text": "Sack. Guckt's euch an. Guckt's euch an. Was willst du denn hier machen? Kack. Sind"}, {"id": 303, "start": 1557.88, "end": 1569.6, "text": "sie auch noch mit dem LLV am Start hier, ich fass es nicht. Kurz rein spotten, da ist"}, {"id": 304, "start": 1569.6, "end": 1575.88, "text": "nix mehr, oder? Da ist nix mehr. Kannst du mal, krasser Elite-Soldat, kannst du mal"}, {"id": 305, "start": 1575.88, "end": 1585.16, "text": "durchs Fenster springen, ohne hängen zu bleiben. Okay, die sind überhaupt nicht mehr dran."}, {"id": 306, "start": 1585.16, "end": 1592.28, "text": "Die sind hier überhaupt nicht mehr. Oh doch, da rechts war was. Da bashen wir jetzt von"}, {"id": 307, "start": 1592.28, "end": 1598.64, "text": "der Seite rein, wenn die hier langstelsten. Aber ist nix mehr. Die haben sich alle verpisst,"}, {"id": 308, "start": 1598.64, "end": 1612.16, "text": "aber die stehen immer noch voll vor der Base. Bam, in der S. Oh fuck. Leute, hier ist ein"}, {"id": 309, "start": 1612.16, "end": 1622.6, "text": "wenig die Kacke am Dampfen, hier kommen wir nicht raus, vergesst se. Shit. Tja, krasser"}, {"id": 310, "start": 1622.6, "end": 1635.12, "text": "Spawn-Rape. Aber ey, ich hab's versucht, ich hab's wenigstens versucht. Der Typ ist"}, {"id": 311, "start": 1635.12, "end": 1657.92, "text": "immer noch Afka. Der moved, der bewegt sich, aber was macht der denn da? Hier kannst du"}, {"id": 312, "start": 1657.92, "end": 1661.28, "text": "nicht raus, kannst vergessen. Die einzige Sache, wo wir raus können, ist auf der anderen"}, {"id": 313, "start": 1661.28, "end": 1670.04, "text": "Seite, hier es sackt. Wir bräuchten guten Panzerfahrer, also haben wir ein, zwei gute"}, {"id": 314, "start": 1670.04, "end": 1676.24, "text": "Panzerfahrer, easy. Aber so, nope. Das dumme ist, ich hab ja selbst zu dem Spawn-Rape mit"}, {"id": 315, "start": 1676.24, "end": 1684.0, "text": "beigetragen. Wenn ihr joinen wollt, easy win. Ich hab ja selbst zu dem Spawn-Rape mit beigetragen,"}, {"id": 316, "start": 1684.0, "end": 1704.16, "text": "weil ich hier am Anfang andere Seite gespielt hab. Der Typ ist immer noch da hinten, da"}, {"id": 317, "start": 1704.16, "end": 1726.2, "text": "können wir jetzt nicht raus. Ich mein, wir können Counterspawn-Rapen, also aus dem Spawn"}, {"id": 318, "start": 1726.2, "end": 1736.4, "text": "ein paar Kills machen, aber Sinn und Zweck der Übung ist es nicht. Alter, guckt euch"}, {"id": 319, "start": 1736.4, "end": 1760.56, "text": "das mal an. Kack Wade. Oh, Kack Wade. Ich seh nix. What the fuck is happening? Ok, nice."}, {"id": 320, "start": 1760.56, "end": 1772.0, "text": "Gute Sicht, gute Sicht. Äh, ich spiel auf, äh, ich spiel auf dem hier. Zack, äh, der"}, {"id": 321, "start": 1772.0, "end": 1781.2, "text": "ist es glaube ich. Ja, äh, der hier. TLR2. Der Typ ist immer noch auf, der ist nicht"}, {"id": 322, "start": 1781.2, "end": 1790.44, "text": "auf, gerade hat's gedreht. Ich weiß was der macht. Der RPGt einfach den ganzen Tag. Der"}, {"id": 323, "start": 1790.44, "end": 1802.08, "text": "Jevil nennt den ganzen Tag vor der Brücke. Geil, nicer Dude. Das bringt's. Muss kurz"}, {"id": 324, "start": 1802.08, "end": 1805.68, "text": "trappieren. Nein, nein, musst kein BF3 runterladen. Ich sag die spielen ja nur noch ne Stunde"}, {"id": 325, "start": 1805.68, "end": 1813.28, "text": "oder so. Ich mein, wir können auch den ganzen Tag hier stehen und die Gegner bashen, die"}, {"id": 326, "start": 1813.28, "end": 1821.72, "text": "pieken, ne? Ist kein Problem. Easy, easy. What? Kick. Ich mein, wir können hier 30"}, {"id": 327, "start": 1821.72, "end": 1831.36, "text": "Billionen Kills machen, ist kein Problem. Ist gar kein Problem, wir können hier 50"}, {"id": 328, "start": 1831.36, "end": 1854.12, "text": "Billionen Kills machen, den ganzen Tag. Oh ne. Die Granate, beste. Meine Güte. Das ist"}, {"id": 329, "start": 1854.12, "end": 1871.84, "text": "ganz schlecht. Das ist ganz schlecht. Meine Güte, du kannst hier nicht mal den Kopf rausstecken."}, {"id": 330, "start": 1871.84, "end": 1898.72, "text": "Kopf rausstecken, Verbotener. Bam. Das kann sich aber voll komplett knicken. Okay, haben"}, {"id": 331, "start": 1898.72, "end": 1908.6, "text": "wir hier irgendwie noch Muni? Muni? Muni? Oh ja, da vorne haben wir Muni. Okay, ich"}, {"id": 332, "start": 1908.6, "end": 1918.08, "text": "brauch eh neue Munition. 25, jetzt mal ernsthaft, guck mal. Der nächste hat 5, 15. Was ist denn"}, {"id": 333, "start": 1918.08, "end": 1926.48, "text": "hier wieder los? Mysterion, Dankeschön für den Sub. Ey Leute, ich steh jetzt einfach"}, {"id": 334, "start": 1926.48, "end": 1930.96, "text": "die ganze Zeit hier und schieß grad aus. Easy Kills, mir egal. Wenn die Gegner da Bock"}, {"id": 335, "start": 1930.96, "end": 1945.0, "text": "drauf haben. Wenn die Gegner da Bock drauf haben, mach ich das easy, easy clap. Da ist"}, {"id": 336, "start": 1945.0, "end": 1971.12, "text": "er. Ja klar, nix gehitted. Okay, wie kommen wir hier raus? Vermutlich gar nicht. Vermutlich"}, {"id": 337, "start": 1971.12, "end": 1994.8, "text": "gar nicht. Hallo, please. Au. Erstmal hinter den Mülleimer legen. Meine Güte. Ich fass"}, {"id": 338, "start": 1994.8, "end": 2005.96, "text": "das net. Das ganze Klicken, hier kommst du nicht raus. Vielleicht verlängere ich ja"}, {"id": 339, "start": 2005.96, "end": 2021.84, "text": "sogar das Leiden hier der Leute, wenn ich sie retze. Ja, aber was soll ich machen?"}, {"id": 340, "start": 2021.84, "end": 2033.6, "text": "Ich meine, ich kann da schlecht rauslaufen. Leute, ich kann hier nicht rauslaufen, wenn"}, {"id": 341, "start": 2033.6, "end": 2058.84, "text": "ich rauslaufe, krieg ich auf den Sack. Kommt raus. Das ist ja voll lächerlich."}, {"id": 342, "start": 2058.84, "end": 2072.72, "text": "Spielst du POE? Ich hab die letzten Seasons nicht mal gespielt, nee. Passt mal auf hier,"}, {"id": 343, "start": 2072.72, "end": 2083.08, "text": "Massive Jump Attack. Wie kommt man hier rauf? Kommt man hier überhaupt rauf? Stelsman ist"}, {"id": 344, "start": 2083.08, "end": 2100.48, "text": "unterwegs. Hier kommt man nicht weiter, okay. Da Stelsman. Geiler, das hat sich aber gelohnt,"}, {"id": 345, "start": 2100.48, "end": 2108.4, "text": "das hat sich ja richtig gelohnt da langzustellen. Was sagt ihr eigentlich, der Typ steht immer"}, {"id": 346, "start": 2108.4, "end": 2115.32, "text": "noch hinten mit seinem Launcher. Ja, nehm ein, nehm ein, ich spawn sofort bei dir, Kollege,"}, {"id": 347, "start": 2115.32, "end": 2120.16, "text": "ich spawn sofort bei D. Auf, nehm ein. Oh nee, Panzer ist down. Fuck. Jetzt nehmen die anderen"}, {"id": 348, "start": 2120.16, "end": 2128.6, "text": "wieder ein. RIP. Campers are everywhere. Naja, das sind ja keine Campers im eigentlichen"}, {"id": 349, "start": 2128.6, "end": 2132.64, "text": "Sinne, wo sollen sie sonst hin? Aber komm mal, jetzt werden die Gegner genugt, das ist"}, {"id": 350, "start": 2132.64, "end": 2142.12, "text": "gut. Nuke sie weg, dann können wir rauspushen. Jawoll, Gegner sind alle tot, alle tot. Sie"}, {"id": 351, "start": 2142.12, "end": 2154.64, "text": "sollten zumindest alle tot sein. Okay, wir versuchen mal raus zu pushen. Keg, Kegweight,"}, {"id": 352, "start": 2154.64, "end": 2158.64, "text": "mal gucken wie weit wir kommen. Oh nee, da kommt ein Panzer. Kommt ein Panzer, auf mich"}, {"id": 353, "start": 2158.64, "end": 2169.4, "text": "direkt, auf mich zugefahren. Oder? Nee, da steht er einfach nur. Jetzt ist einer eingestiegen."}, {"id": 354, "start": 2169.4, "end": 2191.32, "text": "Fucked up in the ass over here. Fuck, man, warum ist denn jeder Ecke da einer von denen?"}, {"id": 355, "start": 2191.32, "end": 2214.52, "text": "Okay, wir sitzen wieder hinten im Spawn. Nice. GG Eats. Sehr gut. Perfekt. Ganz doll."}, {"id": 356, "start": 2214.52, "end": 2230.52, "text": "Okay, easy, easy, easy clap, easy clap, easy clap. Oh, oh. Monkey ass. Wallbang nade, die"}, {"id": 357, "start": 2230.52, "end": 2247.6, "text": "kommt richtig gut, die müssen jetzt moveen. Direkt. Fuck, das sind zu viele. Wir kommen"}, {"id": 358, "start": 2247.6, "end": 2257.92, "text": "einfach nicht vorwärts, man. Killt was, Leute. Schrecklich, Spawnrape unten. Ja, dass du"}, {"id": 359, "start": 2257.92, "end": 2262.0, "text": "spawnen bringt ja noch nicht einmal was. Man kommt eigentlich prinzipiell hier nur über"}, {"id": 360, "start": 2262.0, "end": 2269.88, "text": "die rechte Seite gescheit wieder raus. Oder? Oder? Man hat eins, zwei richtig gute Panzerfahrer"}, {"id": 361, "start": 2269.88, "end": 2278.04, "text": "und Support dafür. Das funktioniert. Das funktioniert auch. Okay, aber es ist gleich"}, {"id": 362, "start": 2278.04, "end": 2294.72, "text": "vorbei. Ist gleich vorbei. Und sitzen sie schon wieder hier? Na klar. Na klar. Na klar,"}, {"id": 363, "start": 2294.72, "end": 2311.56, "text": "sitzen sie da schon wieder. Was sonst? Was sonst? Keg. Was macht der hier? Oh, da liegt"}, {"id": 364, "start": 2311.56, "end": 2322.4, "text": "der Busch, den kann man nicht retzen. Das Nuke hat ja nichts gebracht. Ultrakratze braucht"}, {"id": 365, "start": 2322.4, "end": 2326.72, "text": "den Panzer. Ja, flame ihn. Flame ihn. Beleidigt die Mutter? Dann gibt er dir bestimmt den"}, {"id": 366, "start": 2326.72, "end": 2351.64, "text": "Panzer. Das hast du dir so gedacht, Kollege. What the fuck? Was hält der Dude aus? Was"}, {"id": 367, "start": 2351.64, "end": 2361.36, "text": "halten die Dudes gerade alle aus? Das ist nicht Hardcore. Das ist nicht Softcore. Das"}, {"id": 368, "start": 2361.36, "end": 2376.28, "text": "ist Double XP. Nicht Double XP. Was laber ich für ein Stuss? Double HP. Ja, ich treff"}, {"id": 369, "start": 2376.28, "end": 2381.2, "text": "nicht. Das stimmt auch. Ich musste eigentlich anders schießen auf die Range. Oder? Ich"}, {"id": 370, "start": 2381.2, "end": 2396.28, "text": "muss mir wieder angewöhnen, wie man gut runterziehen kann. Was ich nicht kann. Egal, ich bin..."}, {"id": 371, "start": 2396.28, "end": 2412.28, "text": "Sucuk ist da drüben. Sucuk. So, jetzt kommen wir jetzt raus. Wie sie hier und her ruckeln."}, {"id": 372, "start": 2412.28, "end": 2437.92, "text": "Wir haben drei Poggers, aber Massive Poggers. Ich hänge. Jetzt haben sie mich auf dem Radar"}, {"id": 373, "start": 2437.92, "end": 2448.16, "text": "drauf, weil sie mich gehittert haben schon mal. Mal drüber spotten. Jetzt steht auch"}, {"id": 374, "start": 2448.16, "end": 2461.04, "text": "noch direkt im Gesicht der Panzer. Easy Rats. Zack. Und nichts wie weg, weil die campen"}, {"id": 375, "start": 2461.04, "end": 2468.4, "text": "hier sich schon wieder ein ab. Ich sehe es genau. Guckst du dir an? Guckst du dir an?"}, {"id": 376, "start": 2468.4, "end": 2481.76, "text": "Du kannst hier eigentlich... Klar. Das ist nicht Venice, weil Venice ist dead. Leider."}, {"id": 377, "start": 2481.76, "end": 2510.32, "text": "Leider ist Venice dead. Achtung. Ah. Kann man hier irgendwie durch mit dem Auto? Nein."}, {"id": 378, "start": 2510.32, "end": 2523.28, "text": "Ich muss dich verstecken hier. Lass mich um die Ecke. Jawoll. Sehr gut. Weg. Nice. Hilfe."}, {"id": 379, "start": 2523.28, "end": 2532.68, "text": "Ich will um die Ecke. Nein. Nein. Okay. Ich bin weg. Huge driving skills. Ich habe"}, {"id": 380, "start": 2532.68, "end": 2538.0, "text": "keinen Bock, den ganzen Tag an dieser kack Ecke hier zu hocken. Was soll das geben,"}, {"id": 381, "start": 2538.0, "end": 2559.76, "text": "wenn es fertig ist? Okay. Please. Steck deinen Kopf raus."}, {"id": 382, "start": 2559.76, "end": 2584.84, "text": "Wo ist er? Wo bist du, Dude? Komm her. Okay, der ist down."}, {"id": 383, "start": 2584.84, "end": 2602.72, "text": "Alter. Du kannst keine Ecke. Du kannst aus keiner Ecke rausgucken hier, ohne instant"}, {"id": 384, "start": 2602.72, "end": 2617.68, "text": "auf die Fresse zu kriegen. Warum bin ich so dumm gewesen und habe assistet? Sag mal. Warum"}, {"id": 385, "start": 2617.68, "end": 2621.64, "text": "habe ich assistet? Na doch, ich habe assistet, weil ich gedacht habe, dass kommen ein paar"}, {"id": 386, "start": 2621.64, "end": 2636.96, "text": "Leute mit und wir bashen die jetzt, weil ich mag so diese ganze Spawn-Rape-Geschichte nicht."}, {"id": 387, "start": 2636.96, "end": 2661.44, "text": "Ich mag kein Spawn-Rape. Jetzt wird gerätzt und ich kriege den Kill geklaut. Die Panzer"}, {"id": 388, "start": 2661.44, "end": 2669.76, "text": "haben es auch nicht leicht. Ja, die ganze Gegner geiern nur da drauf. Die geiern den"}, {"id": 389, "start": 2669.76, "end": 2674.84, "text": "ganzen Tag nur darauf, dass irgendwie sich was um die Ecke bewegt, um da gebashed zu"}, {"id": 390, "start": 2674.84, "end": 2697.88, "text": "werden. Schön, wenn sie alle Objectives kontrollen. Ist jetzt ja nichts neues. Mann, fuck. Warum"}, {"id": 391, "start": 2697.88, "end": 2701.72, "text": "ist da noch einer? Ich hatte sie gerade so schön drin. Alle weggesprayt an der Mauer"}, {"id": 392, "start": 2701.72, "end": 2707.0, "text": "hätte ich jetzt alle weggesprayt. Stimmt, smoke die rechte Seite. Da hast du recht."}, {"id": 393, "start": 2707.0, "end": 2711.36, "text": "Das machen wir jetzt. Customize. Wie ging das nochmal? Appearance? Nee, warte. Wait"}, {"id": 394, "start": 2711.36, "end": 2719.56, "text": "a minute. Schon eine Weile nicht mehr gemacht hier. Smoke. Wir müssen smokeen, hast recht."}, {"id": 395, "start": 2719.56, "end": 2734.68, "text": "Aber ich fürchte, wir kommen trotzdem trotz des Smoke nicht weit. Massive Smoke. Wie kann"}, {"id": 396, "start": 2734.68, "end": 2743.92, "text": "das eigentlich sein, dass das Residium komplett negativ ist? Ich wäre schon abgeaimt, wenn"}, {"id": 397, "start": 2743.92, "end": 2773.08, "text": "ich nur rauslaufe, Mann. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay. Okay."}, {"id": 398, "start": 2773.08, "end": 2784.12, "text": "Fuck. Da andere Seite hat er gesessen. Ja, das sackt halt ein bisschen bei der Map. Egal."}, {"id": 399, "start": 2784.12, "end": 2791.84, "text": "Wir smokeen jetzt eine Weile rum. Runde Smoke Action. Nice. Das ist wenigstens mal ein halbwegs"}, {"id": 400, "start": 2791.84, "end": 2808.84, "text": "guter Spawn. Fuck, Mann. Du kannst hier nicht... Du warst zweimal auf der Winnerseite. Ja,"}, {"id": 401, "start": 2808.84, "end": 2813.88, "text": "das ist auch mega langweilig. Smoke links. Du kommst... Also meiner Erfahrung nach kommst"}, {"id": 402, "start": 2813.88, "end": 2835.24, "text": "du links wirklich schlecht vorbei. Schön Rätsel."}, {"id": 403, "start": 2835.24, "end": 2848.72, "text": "Nice."}, {"id": 404, "start": 2865.24, "end": 2880.6, "text": "Ah, ah, ah, ah, du kommst hier nicht mal raus."}, {"id": 405, "start": 2880.6, "end": 2900.76, "text": "Ich weiß, wir sind immerhin mal halbwegs rausgekommen, ne?"}, {"id": 406, "start": 2900.76, "end": 2904.12, "text": "Aber ich glaub nicht, dass wir weit kommen, weil unsere Gegner, unsere Player sind halt"}, {"id": 407, "start": 2904.12, "end": 2905.12, "text": "einfach schlechter."}, {"id": 408, "start": 2905.12, "end": 2916.56, "text": "Okay, weißt du was wir einschmarrn können, jetzt auf B."}, {"id": 409, "start": 2916.56, "end": 2935.56, "text": "Oh fuck."}, {"id": 410, "start": 2935.56, "end": 2953.04, "text": "Ah, nein, von hinten, fuck, ist einfach ein Sniper vor mir im Gesicht gesessen."}, {"id": 411, "start": 2953.04, "end": 2954.04, "text": "Wo?"}, {"id": 412, "start": 2954.04, "end": 2957.04, "text": "Ja, ja, guck mal da."}, {"id": 413, "start": 2957.04, "end": 2962.68, "text": "Mein Gott, warum ist der Spawn immer noch da hinten?"}, {"id": 414, "start": 2962.68, "end": 2965.48, "text": "Hätte ich nicht mal mitpushen können, Leute."}, {"id": 415, "start": 2965.48, "end": 2993.64, "text": "Der hinter setzt doch ein Dude, oder?"}, {"id": 416, "start": 2993.64, "end": 3000.04, "text": "Nein, man, ich wollte die gerade retzen, die zwei da hinten."}, {"id": 417, "start": 3000.04, "end": 3001.04, "text": "Shit."}, {"id": 418, "start": 3001.04, "end": 3005.56, "text": "Ey Leute, wir probieren alles, wir probieren alles, ne, ich kann nicht mehr machen."}, {"id": 419, "start": 3005.56, "end": 3009.68, "text": "Zockst du auch zwischendurch BR4?"}, {"id": 420, "start": 3009.68, "end": 3015.2, "text": "Ich hab letztens mal wieder BR4 installiert, ja, aber ich spiel hauptsächlich BR3, wenn"}, {"id": 421, "start": 3015.2, "end": 3016.2, "text": "überhaupt."}, {"id": 422, "start": 3016.2, "end": 3017.2, "text": "Fuck."}, {"id": 423, "start": 3017.2, "end": 3033.64, "text": "Ich mein, ich geb wirklich alles, ne, ich geb wirklich alles, aber jetzt keine Chance,"}, {"id": 424, "start": 3033.64, "end": 3034.64, "text": "keine Chance."}, {"id": 425, "start": 3034.64, "end": 3040.72, "text": "Hier kommste nicht raus, der Spawn ist weg, wo liegt denn der Dude, da, okay, wir probieren"}, {"id": 426, "start": 3040.72, "end": 3059.72, "text": "erst mal hier rum, weil, deswegen, in your face, Alter, okay, ich hol dich, fuck, fuck,"}, {"id": 427, "start": 3059.72, "end": 3066.8, "text": "fuck, fuck, fuck, ist auch clusterfuck da, die Ecke, es ist überall clusterfuck und"}, {"id": 428, "start": 3066.8, "end": 3081.16, "text": "überall liegen sie rum, Mensch, Pff, Mörser, jetzt Mörsern sie da rein, Alter, fuck, ne,"}, {"id": 429, "start": 3081.16, "end": 3084.88, "text": "man kann durch die Smokes teilweise markieren, wenn du vorher schon markiert hast, kannst"}, {"id": 430, "start": 3084.88, "end": 3085.88, "text": "du nachher auch markieren."}, {"id": 431, "start": 3085.88, "end": 3095.16, "text": "Moment, wo, wo bin ich hier überhaupt, wo, wo bin ich hier überhaupt?"}, {"id": 432, "start": 3095.16, "end": 3122.04, "text": "Kannst du voll vergessen, oho, wir haben das Objective, ich fass es nicht."}, {"id": 433, "start": 3122.04, "end": 3128.8, "text": "Aber hier kommst du jetzt wieder nicht weiter."}, {"id": 434, "start": 3128.8, "end": 3149.68, "text": "Pff, schreckt, Alter, aber immerhin, ey, komm, wir haben es jetzt mit viel Smoke geschafft,"}, {"id": 435, "start": 3149.68, "end": 3155.0, "text": "wenigstens mal ein Objective wiederzubekommen, so, wir gehen jetzt mal kurz als Engineer"}, {"id": 436, "start": 3155.0, "end": 3176.76, "text": "rein und versuchen da zu spawnen und den Typen bisschen zu bashen, Alter, meine Güte, ey,"}, {"id": 437, "start": 3176.76, "end": 3183.92, "text": "what the fuck, please, Leute, spawn halt mal, macht doch mal irgendeiner was, macht doch"}, {"id": 438, "start": 3183.92, "end": 3196.6, "text": "mal irgendeiner was, okay, der ist wieder weg, easy, easy clap, perfekt, tja, das war"}, {"id": 439, "start": 3196.6, "end": 3209.08, "text": "wohl nix, ne, ach guck mal, wir kriegen Leute für Balance gemovet, das ist halt auch geil,"}, {"id": 440, "start": 3209.08, "end": 3212.44, "text": "wir kriegen Leute für Balance gemovet und die werden instant in den Server dann verlassen,"}, {"id": 441, "start": 3212.44, "end": 3221.84, "text": "wenn sie für Balance gemovet werden, wie war das nochmal mit den Tickets, äh nein, je"}, {"id": 442, "start": 3221.84, "end": 3227.64, "text": "mehr Objectives du hältst, umso schneller verlieren die Gegner Tickets, glaub so rum"}, {"id": 443, "start": 3227.64, "end": 3247.76, "text": "war das, oder umgedreht, ja umgedreht könnte man das auch deuten, fuck, da kommt noch zurück,"}, {"id": 444, "start": 3247.76, "end": 3264.84, "text": "okay, kommen noch 179 Tickets, was war man da, das kannst du vergessen, die Ultra Giraffe"}, {"id": 445, "start": 3264.84, "end": 3275.08, "text": "PC ist am Start, Ultra Giraffe PC, das klingt wie ein Xbox, wie so ein auto generated Xbox"}, {"id": 446, "start": 3275.08, "end": 3300.24, "text": "Game Attack, kennt ihr das noch, ja jetzt ist er einfach weg, was"}, {"id": 447, "start": 3300.24, "end": 3320.48, "text": "ey, die Suppression macht mich fertig, ich hab kein Money mehr, ich brauche Moon, haben"}, {"id": 448, "start": 3320.48, "end": 3334.92, "text": "wir es in Gears so vor immer gesagt, ich brauche Moon, du hast dich wirklich so benannt,"}, {"id": 449, "start": 3334.92, "end": 3353.08, "text": "es klingt wie so ein Xbox Game Attack, okay, check nichts mehr, ja klar, der hat mich vorher"}, {"id": 450, "start": 3353.08, "end": 3358.08, "text": "schon markiert, der Dude, fuck, fuck man, aber immerhin, ich wollte gerade sagen wir"}, {"id": 451, "start": 3358.08, "end": 3363.4, "text": "haben mehr Kills als die Gegner, aber haben wir nicht, guckt euch den Chat an, der Chat"}, {"id": 452, "start": 3363.4, "end": 3371.76, "text": "Leute, fick deine Moon als 2011, so muss das sein, guter Chat, so wie sich das gehört"}, {"id": 453, "start": 3371.76, "end": 3401.2, "text": "für ein Online-Game, guter Chat, okay, ich habe Schiss, dass da einer kommt, klar,"}, {"id": 454, "start": 3401.2, "end": 3421.56, "text": "okay Leute, es wird alles zugesmockt, Smok Action, Smok, Massive Smok, Massive Smok,"}, {"id": 455, "start": 3421.56, "end": 3428.48, "text": "Massive Smok, okay Smok ist all, hat sich ausgesmockt, fertig gesmockt, da kommt jetzt"}, {"id": 456, "start": 3428.48, "end": 3438.2, "text": "eh gleich einer hin und One-Hit-One-Shotted mich mit der Shotgun um die Ecke oder so, ha,"}, {"id": 457, "start": 3438.2, "end": 3466.72, "text": "take weight, ich habe Schiss, oh, Booba, hat er gerade gesagt, warum sagt der Booba,"}, {"id": 458, "start": 3466.72, "end": 3491.68, "text": "ich dachte Booba ist eine 2020er Twitch Erfindung, Booba, so Eric, bam, in your face Eric, so"}, {"id": 459, "start": 3491.68, "end": 3519.08, "text": "was hast du jetzt davon, Monka, dachte ich es war es, M16 Abuser, habe ich überhaupt"}, {"id": 460, "start": 3519.08, "end": 3534.36, "text": "kein Problem bei dieser Runde mit, null, null fucks given, oh fuck, hier ist noch einer,"}, {"id": 461, "start": 3534.36, "end": 3543.92, "text": "nein, der ist hinter mir, shit, wir bräuchten auch ein paar Medics, die ratzen, Alter, ich"}, {"id": 462, "start": 3543.92, "end": 3549.44, "text": "meine, guck mal, guck mal, ich hab, ohne Scheiß, ich hab 11k Punkte, der nächste hat 4,6, perfect,"}, {"id": 463, "start": 3549.44, "end": 3557.16, "text": "okay, ich, also Leute, es kann mir keiner vorwerfen, ich würde irgendwie hier nicht"}, {"id": 464, "start": 3557.16, "end": 3585.68, "text": "alles versuchen, ne, ich probier alles, wirklich, ich probier alles, kommst du raus?"}, {"id": 465, "start": 3585.68, "end": 3601.36, "text": "kommst du raus, Leute, mehr ging wirklich nicht, aber, komm, ich hab, ich hab, ich hab wirklich"}, {"id": 466, "start": 3601.36, "end": 3605.24, "text": "alles versucht und der Dude hier, die haben wahrscheinlich, das sind, das sind die typischen"}, {"id": 467, "start": 3605.24, "end": 3611.56, "text": "Panzer-Hongs, die den ganzen Tag da im Panzer rumgammeln und sonst nix machen, aber gut,"}, {"id": 468, "start": 3611.56, "end": 3614.96, "text": "wenn man es kann, ist es nicht schlecht, weil man muss ehrlich sagen, so einfach ist das"}, {"id": 469, "start": 3614.96, "end": 3622.56, "text": "in Battlefield 3 gar nicht, also, wenn Noobs in Battlefield 3 Panzer fahren, ist das ausm"}, {"id": 470, "start": 3622.56, "end": 3628.68, "text": "spawn, fahren und tot sein, hast du noch Platz, ja, ja, ja, noch Platz, wenn nicht, wenn nicht,"}, {"id": 471, "start": 3628.68, "end": 3633.32, "text": "Captain Peng, geh ich, geh ich zu dir in ein anderes Squad, aber es müsste Platz sein,"}, {"id": 472, "start": 3633.32, "end": 3636.68, "text": "da ich Panzer gameplay ne, ich kann das nicht so gut, übrigens, ich muss demnächst dann"}, {"id": 473, "start": 3636.68, "end": 3642.72, "text": "auch furtern, mal gucken, was jetzt für eine Map kommt, nein, ich hab keinen eigenen Battlefield-Server"}, {"id": 474, "start": 3642.72, "end": 3657.36, "text": "mehr, ich wollte nen Venice-Server machen, aber dann war es auch schon dead, okay, das"}, {"id": 475, "start": 3657.36, "end": 3671.56, "text": "könnte jetzt mega geil werden oder massiver Schmerz-Champ, hier Captain Peng, bist du"}, {"id": 476, "start": 3671.56, "end": 3677.84, "text": "irgendwo hier am Start schon, ah, ich join bei dir rein, passt, oh ne, jetzt ist er raus,"}, {"id": 477, "start": 3677.84, "end": 3684.72, "text": "okay, jetzt join, join, passt, gut, finger joined, oh, exellent, jetzt ist er wieder"}, {"id": 478, "start": 3684.72, "end": 3692.32, "text": "raus, keck, wait, so, wir machen mal langsam, wir machen mal, ich nehm auch keinen Smoke"}, {"id": 479, "start": 3692.32, "end": 3697.36, "text": "mit, ich nehm mal wieder Medic, Medic, Medic mit, ich warte mal bis das erste gecaptured"}, {"id": 480, "start": 3697.36, "end": 3726.32, "text": "ist, dann spawn ich rein, beste Map, Spin-Mod, erstmal Kreisler am Start, ich will eigentlich"}, {"id": 481, "start": 3726.32, "end": 3731.64, "text": "ein paar C rein, falls wir das schnell kriegen, Leute, ich krieg ja epileptische Anfälle,"}, {"id": 482, "start": 3731.64, "end": 3747.32, "text": "okay, ich spawn bei euch rein, C ist umkämpft, so, wahrscheinlich kommen gleich von vorne"}, {"id": 483, "start": 3747.32, "end": 3757.76, "text": "irgendwelche, oh, haben die da einen Heli drin im Tunnel, konnte man hier nicht drauf"}, {"id": 484, "start": 3757.76, "end": 3768.36, "text": "hüpfen, doch, haben die den Heli, die haben den fucking Heli im Tunnel, Alter, die haben"}, {"id": 485, "start": 3768.36, "end": 3783.08, "text": "den Heli im Tunnel, ich spiel jetzt nichts anderes als M16, hast doch gesehen, wir haben"}, {"id": 486, "start": 3783.08, "end": 3802.64, "text": "das letzte mal schon auf den Sack gekriegt, oh nee, shit, wir kriegen das, easy, easy,"}, {"id": 487, "start": 3802.64, "end": 3808.36, "text": "easy, jawoll, jetzt kommt der Counterspawn-Rape, Leute, ich sag's euch, Counterspawn-Rape,"}, {"id": 488, "start": 3808.36, "end": 3834.24, "text": "easy win, das ist jetzt die Rache für letzte Runde, Chalters, rennt durch, was, wie sieht"}, {"id": 489, "start": 3834.24, "end": 3841.6, "text": "es auf der anderen Seite, nein, nein, nein, oh, oh, da kommt ein Auto, fuck, ich dachte,"}, {"id": 490, "start": 3841.6, "end": 3849.52, "text": "ich krieg den anderen noch, das G3, ja, G3 ist ganz nice, aber G3 muss man brain spielen,"}, {"id": 491, "start": 3849.52, "end": 3853.12, "text": "ich hab keinen Bock mit brain zu spielen, also muss man, G3 muss man sich Mühe geben,"}, {"id": 492, "start": 3853.12, "end": 3876.64, "text": "mit aimen und so, M16 kann man einfach sprain, einfach sprain ist besser als mit brain spielen,"}, {"id": 493, "start": 3876.64, "end": 3889.04, "text": "wer spielt schon freiwillig mit brain, wenn man noch easy kills machen kann, Moment, Leute,"}, {"id": 494, "start": 3889.04, "end": 3911.48, "text": "ich muss mal kurz, ich muss mal kurz, easy, hits clap, hits clap, easy clap, weiter, weiter,"}, {"id": 495, "start": 3911.48, "end": 3928.36, "text": "weiter, man, man, manmans, man, man, spans王, man, man man man listens to me worship 2020,"}, {"id": 496, "start": 3928.36, "end": 3935.58, "text": "ultra giraffe hat es am start hier hat es hat das auto am start"}, {"id": 497, "start": 3935.58, "end": 3945.42, "text": "achtung rpg und inf wer ist geflämt rpg und inf"}, {"id": 498, "start": 3945.42, "end": 3959.54, "text": "mit so 50 kaliber in den kopf macht nix"}, {"id": 499, "start": 3959.54, "end": 3973.62, "text": "50 kaliber in in in in in in in the head aaa ja ok ja ja ich spawn a spawn a easy a"}, {"id": 500, "start": 3973.62, "end": 3990.0, "text": "warum ach der heli stellz mann ist an a ob ich da jetzt wieder vorgelaufen"}, {"id": 501, "start": 3990.0, "end": 4016.72, "text": "es dauert auf 50 stunden wie achtung für 60 wo kam der denn her"}, {"id": 502, "start": 4020.0, "end": 4025.88, "text": "hat ist der vom heli abgesprungen oder was"}, {"id": 503, "start": 4025.88, "end": 4033.08, "text": "du wurdest ins gegner team gemoved wie jetzt was soll das"}, {"id": 504, "start": 4033.08, "end": 4042.64, "text": "anzeige ist raus dann dann kannst du wieder zurückmove also das geht muss"}, {"id": 505, "start": 4042.64, "end": 4054.6, "text": "im zweifelsfall wieder raus aber machen was du machen was du willst"}, {"id": 506, "start": 4054.6, "end": 4071.4, "text": "wo ist das auto jetzt sofort jetzt sofort packt ja möglich okay die haben"}, {"id": 507, "start": 4071.4, "end": 4086.16, "text": "spawn spawn punkt auf a das natürlich durf"}, {"id": 508, "start": 4086.16, "end": 4092.96, "text": "lass mich raus mann geil das ist immer richtig geil wenn du wenn du so wenn du"}, {"id": 509, "start": 4092.96, "end": 4106.6, "text": "so nice geblockt wirst wenn sie hinter dir stehen okay peng wird reingesporn sort"}, {"id": 510, "start": 4106.6, "end": 4122.36, "text": "mann jetzt flank flank bash der auf dem dach ist das ist wie ging das hier noch mal nein"}, {"id": 511, "start": 4122.36, "end": 4126.72, "text": "warum habe ich das ich habe das falsche geworfen normalerweise kann man durch die"}, {"id": 512, "start": 4126.72, "end": 4135.96, "text": "medikits nicht durch nicht durch reizen jetzt sind sie an z haben wir hier"}, {"id": 513, "start": 4135.96, "end": 4144.24, "text": "panzer oder irgendwas ok ich glaube der ist auf dem dach auto haben wir noch am"}, {"id": 514, "start": 4144.24, "end": 4162.04, "text": "start weiß ich wo ich was retten kann wie warum ist das der hat doch gerade"}, {"id": 515, "start": 4162.04, "end": 4179.32, "text": "gerebt ein mann auf dem dach fahre nicht mehr gut aber da konnte ich machen sonst"}, {"id": 516, "start": 4179.32, "end": 4185.32, "text": "wäre er begeht worden aber warum ist es auch so eben kaputt gegangen obwohl er"}, {"id": 517, "start": 4185.32, "end": 4196.84, "text": "repariert hat muss man nicht verstehen"}, {"id": 518, "start": 4196.84, "end": 4200.96, "text": "pushen wir mal ein bisschen vor"}, {"id": 519, "start": 4202.96, "end": 4209.08, "text": "fuck alter das ist ja alles voll das ist ja alles mal das ist ja mal das"}, {"id": 520, "start": 4209.08, "end": 4215.68, "text": "wimmelt ja nur vor gegner okay wir müssten glaube rechts rum oder links rum"}, {"id": 521, "start": 4215.68, "end": 4221.52, "text": "noch nicht so ganz sicher muss auf jeden fall jetzt was sie für was sie für"}, {"id": 522, "start": 4221.52, "end": 4225.32, "text": "stells action starten dass es was wird"}, {"id": 523, "start": 4226.2, "end": 4234.32, "text": "wollen lord killer zum glück kann sie noch nicht die op-positions besetzt"}, {"id": 524, "start": 4234.32, "end": 4241.92, "text": "aber jetzt schon oder auch nicht da oben ist da oben oder ist da unter dem auto"}, {"id": 525, "start": 4241.92, "end": 4267.12, "text": "es ist hier gerade nicht normal und wir brauchen auch ein bisschen mehr medics"}, {"id": 526, "start": 4267.12, "end": 4272.56, "text": "wirst ja nie gerätzt heute ich habe immer so viel zeit muss gleich gleich"}, {"id": 527, "start": 4272.56, "end": 4300.68, "text": "wieder essen man ey wo sind denn alle was gibt es heute das ist eine gute frage"}, {"id": 528, "start": 4300.68, "end": 4308.64, "text": "ich glaube ich glaube ich glaube spaghetti spaghetti mit tullfisch"}, {"id": 529, "start": 4312.0, "end": 4320.32, "text": "hier sind welche ich sehe nichts ich sehe meinem eigenen smoke nix"}, {"id": 530, "start": 4321.64, "end": 4326.76, "text": "das ist die op-positions steht das ist die beste pose auf der ganzen map da"}, {"id": 531, "start": 4326.76, "end": 4330.88, "text": "kannst du da kannst du so krass rein beschen"}, {"id": 532, "start": 4330.88, "end": 4342.48, "text": "f micron"}, {"id": 533, "start": 4342.48, "end": 4344.48, "text": "Ja was jetzt entscheidet euch"}, {"id": 534, "start": 4372.48, "end": 4388.48, "text": "Auf, auf, auf, auf"}, {"id": 535, "start": 4388.48, "end": 4392.48, "text": "Shit"}, {"id": 536, "start": 4392.48, "end": 4394.48, "text": "Du kriegst nicht einen Rats ab hier"}, {"id": 537, "start": 4394.48, "end": 4398.48, "text": "Weggesprayt"}, {"id": 538, "start": 4398.48, "end": 4400.48, "text": "5 Minuten Maggi Werbung"}, {"id": 539, "start": 4400.48, "end": 4402.48, "text": "5 Minuten Maggi Werbung"}, {"id": 540, "start": 4402.48, "end": 4404.48, "text": "Ähhhh"}, {"id": 541, "start": 4404.48, "end": 4406.48, "text": "Ich weiß nicht, ich habe Endblock an"}, {"id": 542, "start": 4406.48, "end": 4408.48, "text": "Ähh"}, {"id": 543, "start": 4426.48, "end": 4428.48, "text": "Ich habe hier ein bisschen Schiss ehrlich gesagt gerade"}, {"id": 544, "start": 4428.48, "end": 4430.48, "text": "Schiss ehrlich gesagt gerade"}, {"id": 545, "start": 4436.88, "end": 4438.88, "text": "Man"}, {"id": 546, "start": 4440.92, "end": 4446.32, "text": "Meine Jüde, du kommst wirklich keinen Meter weit panz wir brauchen Panzerstelzer"}, {"id": 547, "start": 4447.92, "end": 4449.92, "text": "Panz-Panz-Mans braver"}, {"id": 548, "start": 4452.4, "end": 4454.4, "text": "Captain Peng ist da"}, {"id": 549, "start": 4454.4, "end": 4460.36, "text": "Weiß nicht genau wo er ist ehrlich gesagt da. Oh ne Panzer direkt vor der Nase"}, {"id": 550, "start": 4464.04, "end": 4470.76, "text": "Da ist einer meine Jüde, wir kriegen gerade wieder richtig krass auf den Sack wartet mal"}, {"id": 551, "start": 4470.76, "end": 4481.6, "text": "Leute mein Essen ist fertig muss jetzt muss jetzt gleich weg, gleich Futter, Futterstelz"}, {"id": 552, "start": 4490.2, "end": 4492.2, "text": "Huge Capture"}, {"id": 553, "start": 4492.52, "end": 4493.72, "text": "Massive"}, {"id": 554, "start": 4493.72, "end": 4496.24, "text": "Back Cap, Back wie nennt man das eigentlich?"}, {"id": 555, "start": 4496.24, "end": 4500.48, "text": "Back Rage Cap, keine Ahnung"}, {"id": 556, "start": 4505.2, "end": 4507.68, "text": "Achtung, Achtung pass mal auf Massive"}, {"id": 557, "start": 4507.68, "end": 4512.4, "text": "Oh, oh, oh"}, {"id": 558, "start": 4523.32, "end": 4525.32, "text": "Warum genau bin ich gestorben?"}, {"id": 559, "start": 4530.6, "end": 4532.6, "text": "Warum genau bin ich gestorben?"}, {"id": 560, "start": 4532.6, "end": 4534.6, "text": "Was ist das?"}, {"id": 561, "start": 4537.04, "end": 4539.04, "text": "Take Wait?"}, {"id": 562, "start": 4539.8, "end": 4541.8, "text": "Warum, warum, warum ist"}, {"id": 563, "start": 4542.92, "end": 4546.52, "text": "Hä was hat, okay das müsst ihr mir nochmal erklären, weil ich jetzt gestorben bin"}, {"id": 564, "start": 4546.52, "end": 4548.52, "text": "Ich bin gestorben"}, {"id": 565, "start": 4561.04, "end": 4563.04, "text": "Okay hier geht was vorne"}, {"id": 566, "start": 4569.84, "end": 4574.44, "text": "Wo ist der, wo ist hier der Stelzer? Der ist doch hier im Berg garantiert irgendwo"}, {"id": 567, "start": 4574.44, "end": 4576.44, "text": "Andere Seite"}, {"id": 568, "start": 4583.72, "end": 4585.72, "text": "Ich seh die alle grad net"}, {"id": 569, "start": 4587.12, "end": 4589.12, "text": "What the fuck"}, {"id": 570, "start": 4590.24, "end": 4596.72, "text": "Wo sind die alle? Die Rakete hat den Boden getroffen, du warst in der Explosion, aber das Auto war da ein ganzes Stück von mir weg"}, {"id": 571, "start": 4596.72, "end": 4598.72, "text": "Okay"}, {"id": 572, "start": 4602.92, "end": 4604.92, "text": "All right"}, {"id": 573, "start": 4617.68, "end": 4619.92, "text": "All right, please, Capture"}, {"id": 574, "start": 4619.92, "end": 4624.08, "text": "Ich weiß dann echt nicht, die können, ohne Schiss, die können ja von allen Seiten jetzt kommen"}, {"id": 575, "start": 4625.64, "end": 4628.64, "text": "Hier liegt doch was drin oder, weil das nicht Captured, ah doch"}, {"id": 576, "start": 4630.64, "end": 4632.64, "text": "Ich muss mal, ich bleib mal beim Capfen pengen"}, {"id": 577, "start": 4633.44, "end": 4635.44, "text": "Oh, oh"}, {"id": 578, "start": 4636.64, "end": 4638.64, "text": "Springen bei mir ab"}, {"id": 579, "start": 4640.68, "end": 4644.68, "text": "Fuck man, ah, der hätte mir jetzt erwischt, der hätte mir jetzt erwischt"}, {"id": 580, "start": 4644.68, "end": 4648.12, "text": "Aber gut, wir haben schon hinten zweimal Sachen gecaptured, das ist net verkehrt"}, {"id": 581, "start": 4656.12, "end": 4658.12, "text": "Bin mir nicht ganz sicher, wo hier was ist"}, {"id": 582, "start": 4662.76, "end": 4664.76, "text": "Okay, ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier"}, {"id": 583, "start": 4666.04, "end": 4668.04, "text": "Ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier"}, {"id": 584, "start": 4668.04, "end": 4674.04, "text": "Ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier, ich bin jetzt hier"}, {"id": 585, "start": 4676.04, "end": 4678.04, "text": "Bin mir nicht ganz sicher, wo hier was ist"}, {"id": 586, "start": 4679.32, "end": 4681.32, "text": "Oh what the fuck, wo ist das denn hin"}, {"id": 587, "start": 4681.32, "end": 4691.32, "text": "Shit man, wo ist denn die Rakete hin geflogen, die war absolut nicht da, wo es das Fahnenkreuz war"}, {"id": 588, "start": 4693.32, "end": 4699.0, "text": "Okay, haben wir C? Oh nice, wir haben C, C ist gut, dann gehen wir jetzt auf C"}, {"id": 589, "start": 4700.76, "end": 4703.48, "text": "Ich bin grad voll planlos, ich weiß echt nicht, wo hier was abgeht"}, {"id": 590, "start": 4703.48, "end": 4711.48, "text": "Habt ihr mal einen Plan, wo hier was abgeht? Wo geht hier was ab? Wir können jetzt gegencaptchern"}, {"id": 591, "start": 4714.2, "end": 4716.2, "text": "Ich muss essen, ich muss essen, keine Chance"}, {"id": 592, "start": 4721.0, "end": 4723.0, "text": "Komm, es captchert einfach jeder, wenn er seinen Shit"}, {"id": 593, "start": 4723.0, "end": 4729.72, "text": "Oh please"}, {"id": 594, "start": 4735.72, "end": 4727.72, "text": "Writing"}, {"id": 595, "start": 4727.72, "end": 4733.62, "text": "wieder sein shushit"}, {"id": 596, "start": 4733.62, "end": 4743.34, "text": "Oh, please."}, {"id": 597, "start": 4743.34, "end": 4762.22, "text": "Das sah aus wie ein Friendly, oder?"}, {"id": 598, "start": 4762.22, "end": 4772.14, "text": "Das sah aus wie ein Friendly."}, {"id": 599, "start": 4772.14, "end": 4773.14, "text": "Bam!"}, {"id": 600, "start": 4773.14, "end": 4779.74, "text": "Okay, jetzt dürfte er nächstes Mal da sein."}, {"id": 601, "start": 4779.74, "end": 4784.54, "text": "Oben am Berg."}, {"id": 602, "start": 4784.54, "end": 4788.3, "text": "Der lebt noch, oder?"}, {"id": 603, "start": 4788.3, "end": 4792.38, "text": "Lass mich mal hoch."}, {"id": 604, "start": 4792.38, "end": 4799.42, "text": "Da oben hocken auch noch welche."}, {"id": 605, "start": 4799.42, "end": 4800.7, "text": "Komm, please."}, {"id": 606, "start": 4800.7, "end": 4802.26, "text": "Elite Soldat, spring!"}, {"id": 607, "start": 4802.26, "end": 4803.26, "text": "Spring!"}, {"id": 608, "start": 4803.26, "end": 4809.22, "text": "Hier, da ist gar keiner mehr."}, {"id": 609, "start": 4809.22, "end": 4821.38, "text": "Ah Mist, jetzt bin ich doof."}, {"id": 610, "start": 4821.38, "end": 4822.38, "text": "Kommt man da noch hoch?"}, {"id": 611, "start": 4822.38, "end": 4825.38, "text": "Ich muss eigentlich aufs Dach."}, {"id": 612, "start": 4825.38, "end": 4827.06, "text": "Nee, kommt man nicht mehr hoch, kacke."}, {"id": 613, "start": 4827.06, "end": 4832.06, "text": "Ja, nein."}, {"id": 614, "start": 4832.06, "end": 4840.18, "text": "Leute, ich muss essen, ich muss weg."}, {"id": 615, "start": 4840.18, "end": 4841.18, "text": "Schön, dass ihr dabei wart."}, {"id": 616, "start": 4841.18, "end": 4846.62, "text": "Spontane Runde, BF3."}, {"id": 617, "start": 4846.62, "end": 4853.34, "text": "Ich würde jetzt eigentlich gerne auch die Runde zu Ende spielen, aber es wird kalt."}, {"id": 618, "start": 4853.34, "end": 4861.74, "text": "Okay, nice, uns haben wir schön gegenseitig gekillt, Leute, macht's gut, wir sehen uns"}, {"id": 619, "start": 4861.74, "end": 4862.74, "text": "im nächsten Stream."}, {"id": 620, "start": 4862.74, "end": 4892.7, "text": "Mal gucken, vielleicht bin ich nachher noch mal da, bis dann, macht's gut, see you."}]}