{"text": "Ich bin noch mal am Start. Es sind 11 Leute am Start, seid ihr noch heute Morgen drin und es hat jetzt einfach gelaudet oder? LUL. LULHD. Warum gibt es eigentlich kein LULHD-Emote? FFZ. Better Twitch TV. Es gibt kein LULHD. Warum gibt es kein LULHD? Ich brauche ein LULHD-Emote. Es gibt aber auch bestimmt ein paar lachende Total Biscuit Bilder in High Definition. Oh, die Musik ist ein bisschen laut. TF, was ist das für eine komische Playlist, bitte? Guck mal, ist das ein Evoli? Poggu, Mr. Hammy auch mal wieder am Start, nice. Leute, ich muss euch mal was erzählen. Ich habe gestern gemerkt... Also wie soll ich das sagen? Ich habe gestern realisiert, dass ich alt bin. Aber jetzt anders als ihr denkt, anders als ihr denkt Leute, anders als ihr denkt. Und zwar, ich habe gestern mal wieder mit dem Fabian Discord gelabert und da habe ich erfahren, dass jetzt von einem gemeinsamen Kumpel von uns die Freundin schwanger ist. So alt wie wir. So, und da ist mir immer wieder aufgefallen, wie alt ich bin. Früher haben wir uns da lustig drüber gemacht. Ich habe mit dem Fabian und dem Mastercraver, habe ich MMO Kreiselgrind gemacht und wir haben uns über sowas lustig gemacht und jetzt ist es so weit, Alter. Wir haben uns lustig gemacht über so Dinge wie, warte mal ab bis wir 35 sind und Kinder kriegen und so. Jetzt ist es so weit. Das haben wir damals aus Scheiß gesagt, weil wir gedacht haben, das kommt eh nicht so. Und jetzt ist es so weit, Alter. Ich musste übrigens mal eine Nachricht schreiben. Ich weiß das ja offiziell noch gar nicht. Wobei, doch, ja. Ich meine, fuck. Ja, aber mir ist es, ich kriege eh keine Kinder, aber andere vielleicht, die ich kenne. Ich habe da gar keinen, wie soll ich sagen, gar keinen Bestreben, da irgendwie Nachwuchs zu zeugen oder so. Macht ja auch nichts. Männer, Männer, Männer können mit 90 noch Kinder kriegen, ist überhaupt kein Problem. Nee, ich habe da, ich habe da keinen Bock drauf. Ich finde es, ich finde es schon geil. Das ist mir gestern erstmal aufgefallen. So, das ist mir wirklich zum ersten Mal so richtig aufgefallen. Das, das, das ich jetzt, ich bin echt alt, ja. Gut, ich meine 36 ist eigentlich so insgesamt, am Gesamtlebenserwartung noch jung, aber. Krass, hätte ich nicht gedacht. Denkt man so, aber es gibt dann doch erstaunlich viele. Und es gibt sogar umgedreht, es gibt sogar mittlerweile relativ viele Informatikergrills. 36, aber anders als 36 vor ein paar Jahrzehnten. Ja, das stimmt. Heute kann man sich entscheiden mit 36. Ist man mit 36 Boomer alt oder, ich meine gut, mit 36 werden die wenigsten noch rumlaufen und was erzählen wie, fühl ich, fühl ich Digger oder was sagt man dann heute noch so, sus, sus, sus fühl ich Digger. Nee, was ist dann so die typische, ah ja, keine Ahnung. Aber heute kann man sich, heute kann man sich wirklich entscheiden, ja. Also, ist man, jeet, also ist man mit 36 Boomer alt oder ist man mit 36 noch normal. Jaja, das ist heute anders als vor 20 Jahren, das stimmt schon. Es ist eh so, für mich ist auch alles ab, ursprünglich mal alles ab, was nach 1990 geboren ist, ist jung, allerdings ist das Problem, die sind auch schon 30. Ah, da hab ich ja noch vier Jahre Zeit, easy. So Leute, wir spielen heute nicht einfach nur Plants vs. Zombies, wir probieren uns heute mal in Endless Survival. Ich hab das schon mal gespielt, es ist nicht so, dass ich das noch nie gespielt hätte, aber nicht sonderlich weit. Mal gucken, wie weit wir kommen. Wir knappen, wir schnappen uns einfach hier so ein Fottem-Bild und bauen das nach vor 20 Jahren Wachstum in Verbandskästen gepinkelt. Warum hab ich das noch auf? Warum läuft das immer noch? Warum läuft das immer noch? Hat der Serious Max 5 Stunden Abteilen? Der hat den ganzen Tag irgendwo einen Server gemietet und streamt das den ganzen Tag. World Record Attempt, ich hab ehrlich gesagt keine Ahnung, wo der World Record ist. Der World Record ist wahrscheinlich bei 500.000 Flagen, weil es gibt ja Builds, die sind komplett Endless, da musst du gar nichts machen. Also es gibt ja solche Builds hier, das ist ja noch das manuelle Build, hier muss man ja noch was machen, ja. Aber es gibt ja richtige, guck mal, es gibt so komplette Endless Builds, da kannst du einfach AFK gehen und easy win. Aber das machen wir nicht, wir machen so ein Noob-Build, weil ich hab schon, ich bin da nicht gut und ich hab das auch schon, ich hab das nicht viel gespielt. Es ist nicht so als würde ich jeden Tag Plants vs. Zombies grinden oder so, aber das machen wir jetzt mal. So was bauen wir jetzt hier in der Richtung. Ich hab das, wie gesagt, ich hab das schon mal gespielt, ich glaube man fängt an genau mit ganz vielen Sonnenblumen, da stellt man irgendwie die ersten 1-2 Runden und dann baut man das Ganze um zu sowas. Und dann mal gucken, mal gucken wie das läuft, wie gesagt schon ein bisschen her. Hab ich noch, was hab noch Raspberry Pi Zero rumliegen, hast du einen Vorschlag, was ich damit machen kann? Ne, das kann man so pauschal nicht sagen, ist halt die Frage, ob es irgendwas sinnvolles gibt, was du brauchst. Das kann man so echt schlecht sagen, von einer Kamera bis irgendein Dashboard bis im Zweifelsfall Home Automation, irgendwie ein lokales Wiki oder sonst was, da gibt es ja zig Varianten, was man so machen kann. 23 Monate, das ist ja Massive Hyper Subscription, Alter, Huge Big Brain, da können wir eigentlich nur noch gewinnen. By the way, soll ich die Kategorie auf Plants vs. Zombies stehen lassen oder soll ich die Kategorie einfach auf Retro machen? Das ist ja schon Retro, ich meine das Game kann wann raus, 2008 oder so. Retro gucken bestimmt, ich muss jetzt mal kurz was gucken. Gibt es noch Leute, die dieses Spiel streamen auf Twitch? Ah, die spielen Kampagne und ansonsten streamt im Prinzip auch. What the fuck? Retro gleich mehr Klicks, komm wir schalten auf Retro um. Retro. Bam. Plants, Zombies, Endless, Survival. Bleiben wir jetzt in Titel rein, easy, jetzt ist Retro, bam. Wann kommt Peggle Deluxe? Ich hab diesen ganz Casual Crap hab ich nie gespielt. Leute, ich muss jetzt noch mal eine Sache loswerden zu dem was ich am Anfang gesagt hab, wie gesagt, da ich realisiert hab, gestern Abend so zum ersten Mal richtig schass ich echt alt bin mittlerweile. Und zwar, eins wollte ich euch jetzt mal sagen, vielleicht für die Leute die noch nicht so alt sind. Wenn man Sachen so erlebt, sei das dass man mit irgendwelchen Kumpels in MMO spielt oder irgendwelche geilen Sachen hat. Wow, der Eltschwangerfahrzeit aufgehört, Sauerei. Kann man die Notifications ausschalten irgendwie? Unsichtbar, hab ich doch. Ja, gut, Keco now drei Monate. Also was ich euch sagen wollte ist folgendes. Egal ob ihr jetzt mit irgendwelchen Kumpels MMOs grindet oder irgendwie meinetwegen auch Elstels macht oder sonst was. Wenn man jünger ist und das ist mir aufgefallen, jetzt so ist mir das zurückblickend aufgefallen, denkt immer, das ist ja nichts besonderes, das kann man ja alles jederzeit wieder machen oder ja, das ist jetzt nicht so wild, also wenn das nächste MMO kommt, da wird wieder gegrindet. Aber ich kann euch sagen genießt die Sachen, wenn ihr sie macht, weil ihr wisst nicht ob es das nochmal gibt. Oder sagen wir mal umgedreht, irgendwann wird das letzte Mal sein, dass ihr irgendwas spezielles macht. Gippe Hands, ja. Ob ich jemals wieder beispielsweise mit dem Karsten und Fabian irgendwie MMO grinden werde ist keine Ahnung. Wie gesagt, der Karsten kriegt jetzt ein Kind. Ich hab keinen Gamer, was ich spielen will. Dann brauchen wir noch ein Game, was ich mit dem Fabian zusammen spielen kann, was uns so einfach ist. Deswegen, ich sag euch Leute, man denkt früher immer, das ist so easy, das kannst du alles jederzeit wieder machen. Aber das muss nicht so sein. Und was ich euch auch empfehlen kann in der heutigen Zeit, was wirklich cool ist, weil das, das ging früher nicht, sonst hätte ich es gemacht, captchert einfach ein bisschen was. Macht Shadowplay an, was auch immer gerade warum das auch immer kaputt ist, macht Shadowplay an. Alter, die Musik ist ja, ist ja, guck mal, da geht das, ist das ein Efoli, das Efoli geht, Gassi. Captchert ein paar Sachen. Also wenn ihr beispielsweise irgendwie den ersten Raid macht in irgendeinem MMO, mit irgendwelchen Leuten, wo ihr, die ihr kennt oder einfach nur weil es fast geil ist, captchert das einfach. Captchert das. Nehmt euch eine externe Festplatte. Ich fänd's geil, hätte ich das jetzt gemacht. Das ist kein Efoli. Was ist das denn? Ich hab keinen Schimmer von Pokemons, Alter. Nehmt euch eine externe Festplatte, nehmt euch eine 10TB-Platte oder was auch immer. Captchert was, wenn ihr was Geiles, Geiles macht mit den Leuten und speichert euch das. Dann könnt ihr euch das 20 Jahre später angucken. Das war, das ging da früher noch nicht so, ne. Früher hast du noch nicht einfach, da hat der Fraps, kennt noch einer Fraps? Damals musstest du Spiele mit Fraps captchern und so ein Kack. Max, ich möchte ein Lastfirma Netzwerk. Es soll wirklich nur als Datenablage und Schärfe für mehrere Netze, würdest du sagen die Einschränkungen davon sein? Jaja, die sind gar nicht so schlecht, die Cyanology-Dinger. Kann man schon kaufen, würde ich, also wenn du einfach nur sinnlos hinstellen, speichern willst und halt dich nicht selbst drum kümmern, dann sind die Cyanology-Dinger nicht so gut. Nein, nein, nein, das würde ich auch nicht machen. Macht das, macht das ohne Scheiß, machts euch auf eine externe Platte, macht da ab und zu mal ein Backup, guckt mal, ob das ab und zu funktioniert. Captchert die Sachen, genauso wie jeder Handy dabei, macht mal Foto und Videos, das könnt ihr euch später angucken, weil ich sag euch, irgendwann und ihr wisst es zu dem Zeitpunkt nicht, ist es das letzte Mal, dass ihr eine Sache macht, wovon ihr noch denkt aktuell zu diesem Zeitpunkt, ach das ist doch das Normalste von der Welt und 20 Jahre später denkt ihr euch, wann war denn das, naja egal, so wir bashen jetzt, alter. Übrigens, der Hype-Train ist bei 94% wenn sich einer noch erbarmt, by the way, warum ist, stimmt das Spiel, mir fällts ja, ich bin ja auch Kacknoob, das ist ja immer 4 zu 3, ich strecke das ja in den Videos immer. Was machen wir denn jetzt, brauche ich da, Leute soll ich euch stretchen oder soll ich an die Seite ein paar Billchen machen, ich kann an die Seite ein paar Billchen, ist halt so, ne ich lasse das so, ich lasse das einfach so, aber wir müssen die Guides hier übrigens aufmachen, weil ich richtig, richtig noobig bin und keine Ahnung hab, wie das genau, ob, ob ist das grün, alter, was ist das denn, also ich muss eben, ich muss eben ein paar Billchen, what the fuck, wieder kaputt, so, das Bild muss ich aufmachen, ich muss wussten, wie man das Bild aufbaut und das da muss ich aufmachen, weil man gucken kann, wie das Endgame-Bild aussieht, ok, exellent, also so fangen wir jetzt an, easy und dann wird gebashed, alter, vielleicht, vielleicht schaffe ich ja meinen Rekord von 53 Runden, wie gesagt ich hab das nie sonderlich großartig gespielt, Basti Baron zwei Monate, dankeschön für den Sub, Massive, dankeschön, hast du schon mal Garnwaffel gespielt, ja sogar mit dem Friseur zusammen damals, das ist eigentlich ganz nett, oh erst mal Gießsauce, erst mal Gießstelz machen, ja bam, jawoll, by the way diese Gießkanne ist auf dem PC total sinnlos, auf der Xbox hast du glaube ich einmal geklickt und es wurden alle gegossen, erst mal Dünger kaufen, jawoll, ah jetzt Gärtner Stream, so muss das sein, der wollte mir nicht zugucken beim Gärtner schon mal, übrigens ich sollte vielleicht mal eine von beiden Musik ausmachen, haben wir die Schnecke gekriegt, das war es, bam, flitze, kann man, ah Gott mal hier, G-Bait, na gut da muss man den Kram halt rücken, also wir machen jetzt optimist, optimist das Bild, huge optimising, hier, fack, massiv optimist, ich habe überhaupt kein Geld, so Hauptmenü, überleben, 52 Splangen habe ich schon geschafft, hast du eigentlich nur ein Screen, nee ich habe zwei Screens, aber ich will ja dass ihr seht was ich, was ich gucke, deswegen mache ich das hier auf, so fangen wir an, ok, endlos, überleben, endlos, auf gehts, weiter, wtf, das ist von, das ist von 2005 oder was auch immer, äh, krasser Scheiß, komm mal 52 Splagen Lull, nein nein, ich will mich gar nicht spoilern lassen, ich will mich gar nicht spoilern lassen, wir machen das jetzt neu, so, alter, zack, also was brauchen wir denn, wir brauchen jede Menge, jede Menge Sonnenblumenstells brauchen wir, wir brauchen Lillipads, wie heißt das auf deutsch, äh, Seerosen oder so, ähm, Kürbis und Pilzstells, ok, so das heißt also wir brauchen Kürbis, wir brauchen Seerosenplätter, dann brauchen wir die Pilze und die Kaffeebohne, dass man die aufwecken kann, ähm, Knoblauch braucht man glaube ich am Anfang noch, Knoblauchstells, genau, ähm, das war's, ok, das ist die erste Runde, da brauchen wir auf jeden Fall noch Kartoffelmine und Splash, Smash, was auch immer, ja und als letztes ist eigentlich, ist eigentlich wurscht, vielleicht haben wir genug, vielleicht haben wir genug, um schon die Kanonen aufzubauen am Anfang, schauen wir mal, los geht's, das Game ist sehr verpixelt, ja, ach so, mal gucken, wartet mal, es gibt zwei, es gibt zwei Varianten, man kann so machen, dann sieht es ein bisschen, oh, ist jetzt nicht wirklich besser oder, seht ihr überhaupt was, wait a minute, äh, ein bisschen klein oder, wait, warte mal, das ist irgendwie ein bisschen kaputt, Moment, Moment, wartet, wartet, ich hab ne Idee, ich hab ne Idee, mal gucken, ob das jetzt wieder größer wird, jetzt wieder größer, ok, wait, ne, ok, jetzt hab ich Vollbild ausgemacht, Vollbild, so, jetzt haben wir es im Fenster, jetzt haben wir es im Fenster, kann man das Fenster resizeen, what the, ne, Fenster resizeen geht nicht, ok, das sackt, also ich muss drei Drehbeschleunigungen Vollbild machen, das funktioniert sonst nicht anders, das funktioniert nicht anders, so, jetzt müsste Vollbild sein, ihr müsst es auch wieder sehen, ne, ja, ok, zack, jetzt muss man uns sputen, so, setzten wir jetzt hier schon platt, ne, wir warten noch, wir warten noch, ich werde es jetzt wahrscheinlich mega verkacken, das sage ich euch gleich, Dankeschön für den Sub, oder ne, was war das, aber zumindest haben wir den, haben wir den Hype-Train geschafft, huge Hype, Tim Apple wäre stolz auf uns, oh, jetzt kommt er in der gleichen Lane noch mal, zack, ähm, noch mal hier hin, so, wir müssen ganz, ganz viele, guck mal, wir müssen ganz ultra viele Sonnenblumen bauen und dann am Anfang hier so ne Reihe aus Pilzen, wie viel APM, das werden wir gleich sehen, wenn es ein bisschen schwieriger wird, insane movements, so ist das geil, Green Style, 6 Monate, Dankeschön für den Sub, so, das heißt wir brauchen die ersten, wieviel die ersten, 1, 2, 3, 4, 8, also die ersten 4 brauchen wir Äh, Blätter und Kürbis und in den ersten 3 Pilze und obendings brauchen wir dann Knoblauch, alles klar, exellent, so machen wir das, also, machen wir da, weiß ich, ich glaube ich sollte lieber, ich sollte lieber erst, ähm, Blätter, Blätter bauen, ne, Blätter und Sonnenblumen, so den er unten kriegen will, locker, gar kein Problem, ich muss jetzt erstmal aufrüsten, ich muss jetzt erstmal aufrüsten an Sonnenblumen, Cattails sind OP, ja, aber da kriege ich das andere Bild nicht mehr hin, ich glaube ich sollte erst Sonnenblumen bauen, bevor ich den Kram hier mache, Moment, ich brauche, oh fuck, ich brauche ja 150 für den anderen Pilz, MonkaS, Ripper, das reicht nicht den zu killen, ne, ne, ich muss erst, ich muss erst Sonnenkram aufrüsten, ah, ah, oh, geil, das Ding ist ja richtig OP, OP as fuck, das ist ja, das ist ja wahnsinnig OP das Teil, guckt euch das mal ab, guckt, das hat, das hat ihn ja geschreckt, geschreckt Sonnensgleichen, hoffentlich reicht das noch, ja, das sollte noch reichen, 200 kostet der, oh nice, nice Timing, 200 kostet das jetzt schon, ok, ach guck mal, das wird immer, das wird immer teurer, weiss ich gar nicht mehr, nice, guck mal, jetzt sind wir doch erstmal schon mal safe, gegen die ersten paar, wir müssen hier alles, wir müssen hier alles zu klatschen, Sonnenblumen, nehmen die eigentlich die fetten Sonnenblumen dann, ne, hä, warum nehmen die nicht die teuren Sonnenblumen, Anno, Anno habe ich sogar 1602 viel gespielt damals, ja, ach hier machen die das dann, ok, Hintergrundaufnahme fürs nächste YouTube Video, so die werden jetzt gebashed, oh zack, so jetzt müssen wir gucken, dass wir nebenbei aus, oh ne, das war jetzt kacke, das war jetzt dumm, das war jetzt richtig dumm gesetzt, den müssen wir jetzt, den müssen wir jetzt chompern oder wie auch immer man das, bent, zack, immer schön upgraden, der ist noch nicht wieder ready, pranks, die bauen doppelt garlic, glaube, naja gut, der wird jetzt gekillt, das ist gar kein Ding, komm mal hier oben hin, dass wir zwei Stück haben, jetzt upgraden wir den, hier machen wir so ein Teil hin, den Pilz rein, auf, weg hin, pranks, Lel, hast du das Spiel nicht mittlerweile mal durchgezockt, ne, das ist endless, das ist endless mode, da ist nichts mit durchspielen, erst, erste massive wave, gut, das ist easy, das kriegen wir hin, die Sounds, Alter, pranks, pranks, so, jetzt können wir einen neuen Kürbis setzen, da vorne, ah, da soll er mal weiter, weiter dran rumkauen, so, zack, zack, zack, zack, zack, zack, so, jetzt haben wir hier vorne welche, ich weiß nicht, ob ich nicht, oh fuck, was, what the, da wollte ich dir sagen, Boomer-Reflexe, ich hoffe, ich baue das, by the way, ich hoffe, ich baue das irgendwie richtig, ok, jetzt können wir den nächsten upgraden gleich, das da, das da, das da, so, gut, immer mehr Blumen, weil wir müssen, wir brauchen gleich sau viel Kohle, wir müssen gleich die ganzen Korn, die ganzen Kanonen bauen, oh, oh, gehst du kaputt, gehst, gehst du, oh, knapp, so, so, stimmt das, was ich hier baue, ok, ich brauche vier, vier Dinger hier vorne, alles klar, machen wir, ich sagte schon so lange her, so, den hier muss man noch vollbauen, hier vorne noch Blätter hin, ein Pilz schläft noch, ah ja, stimmt, lull, ok, ich sehe jetzt schon, das geht auf den Finger mit dem Geklicke, auf der Xbox konnte man einfach den Cursor vorbei bewegen und gut war, so, das Refreshen wir mal das Teil, so, ok, zweite Flag, jetzt brauchen wir hier, jetzt müssen wir schnell, ja, ey, super Timing, huge, passt ja wunderbar, die kommen jetzt überhaupt nicht hier dran vorbei, guck hier, schreckt werden sie, richtig geschreckt, so, hier kann ich schon Korns hinbauen oder, kann ich hier schon Korns hinbauen, ich brauche Korns da, eins, zwei, drei und danach dann die Kanonen, können wir im Endeffekt schon machen denke ich mal, alles sammeln, alles sammeln, alles sammeln, BÄM, high APM, so, was brauchen wir denn jetzt, also, wir haben jetzt komische Springer, Zombies, das ist jetzt aber nicht schlimm, die werden alle gekillt, also ich kann jetzt schon, ich kann jetzt, ok, hier muss ich dann noch vollbauen mit Sonnenblumen und hier, dann kann ich eigentlich schon anfangen Kanonen zu bauen würde ich sagen, ja, und was ist als nächstes, Kanonen, dann brauchen wir noch ganz viel, ah, und dann brauchen wir noch ganz viele Kürbis, ok, das machen wir zuerst, Melonen und Kürbis brauchen wir noch, also, brauch ich noch Seerosen, nein, brauch ich nicht, sehr gut, kann ich weglassen, dann kopieren wir uns erstmal den Kürbis, dass wir zweimal Kürbisse bauen können, der weiße Kürbis kopiert der Kürbis, den baue ich jetzt auch, es gibt so eine Pflanze, die kann alles kopieren, so, dann brauchen wir, wir brauchen keine Pilze mehr, die Pilze stehen, jetzt können wir die Kanonen erstmal aufbauen, also das da, dann brauchen wir die Maiskanone, wir brauchen auf jeden Fall Sonnenblumen, dann habe ich gesehen, die benutzen hier in der Mitte die großen Sonnenblumen, die können wir eigentlich auch schon mit reinpacken, so, jetzt ist los die Frage, brauche ich irgendwie noch so ein Notfallding, erstmal nicht, so und dann machen die hier vorne noch Stachel hin, so, was brauche ich denn sonst noch, wobei, ich brauche noch Pilze, ich muss den Pilz gerade mitnehmen, nein, Melonen, Melonen und Eismelonen brauche ich noch, das passt doch, das mit den Pilzställs mache ich danach, mal gucken, ob das so hinhaut, wie ich mir das vorgestellt habe. So, hier kommt jetzt rein, hier kommt die erste Kanone hin, Moment, das stimmt doch nicht, was ich gebaut habe, oder? Ne, doch, doch, ist richtig, hier kommt Stachel hin, doch, ne, ne, das ist ok, das ist alles gut, alles gut, passt, hier kommt Stachel hin, ne, doch, passt, passt, alles gut, alles gut. Boah, äh ja, da kommst du ja mit dem Geklicke-Gun immer hinterher, Monkeys, äh, 300 APM, das ist ja hier fast wie Starcraft, ok, ähm, Zack, wo müssen, wo müssen die komischen Melonen hin? Äh, unten, eins frei, unten, unten, ok, also Melone, da, da, da und da, 1, 2, 3, genau, so, kann, äh, Kanone, jawoll, ok, das wird anstrengend, fuck, du brauchst 30 Milliarden APM, Monkeys, Alter, das kann meine, das, das, das, das, das macht meine Hand ja nicht mit, äh, 50, 50 Milliarden APM, guckt euch das mal an, äh, 0W, so, nächste Melone, dann kommt hier oben noch ein Korb hin, da kommt noch eine Sonnenblume drauf, so, und hier in der Mitte, hier in der Mitte kommt auch alles voller Kanone, ne, genau, halber Starcraft-D-Spot ja ohne Scheiß, hätte ich gar nicht gedacht, das kann ich mich gar nicht mehr dran erinnern, dass es so anstrengend ist, so, jetzt machen wir hier noch Cannon, jetzt können wir hier schon Bam machen, guck mal, in your face, wo kommen denn noch welche hin, hier, hier kommen noch welche hin, der hüpft einfach drüber, Anzeige ist raus, ok, ähm, das, das, ok, perfekt, ich muss aufpassen, wenn hier einer springt, hab ich Pech, so, erstmal alles einsammeln, äh, jetzt, da, Finger überhitzen gleich, MonkaS, ah, hier Kanone, ich muss jetzt erstmal Kanonen aufbauen, ok, das ist tatsächlich deutlich anstrengend, als ich diese Erinnerung hab, wir können jetzt hier schon Cannon Bash machen, alles gut, next, den Garlic brauch ich jetzt eigentlich fast schon gar nicht mehr, hier upgraden, Sonnenblumensteher, Upgrade, so, Körbe, so, das passt alles, so, wo muss die nächste, wo muss die nächste Melone hin, da, da, oder, ja, ich hab leider noch keine Pilze dabei, sonst hätte ich das gleich machen können, wir machen erstmal, bevor wir die Melonen machen, machen wir erstmal die Kanonen fertig, wir haben in jeder Lane, warte mal, diese Lane muss da noch ne Eismelone, da machen wir hier, ist das richtig gemacht, ja, ja, ah, passt, Guide, so, next up, Kalapult ist da, bäm, hat schon mal weggeballert jetzt, Zeit, muss alles ausgenutzt werden, ok, also wir brauchen jetzt auf jeden Fall noch ein paar Sonnen, ne, wir brauchen keine Sonnenblumen mehr, wir haben alles an Sonnenblumen gesonnen, gesonnenblumt, was wir brauchen, wunderbar, wir brauchen auch eine Reihe davon, das da brauchen wir, dann brauchen wir kopierte, kopierte Körbe, oder, was ist das, Kürbis, Kürbis, Imitator Kürbis, melone und Maiskanone und dann können wir jetzt eigentlich schon mit Pilzen anfangen, also den da, den da und den da, dann kommt mal wieder ein Coding Stream, wenn ich irgendwas hab, was ich programmieren will, so, wir können das jetzt auch in Ruhe bauen, wir haben noch keine Zombies, die Pflanzen von oben klauen, das passt, so, zack, so jetzt ist der Garlic, jetzt ist egal, ob der kaputt geht oder nicht, jetzt egal, ok, jetzt ist gar kein Problem, ob jetzt der Garlic, also ob der Knoblauch da ist oder nicht, ist jetzt egal, so jetzt können wir schon weitere Melonen bauen, da muss eine hin, da muss eine Melone hin, ich lass die mal hier ein bisschen langsamer, dass ich Zeit hab, so, da muss eine Melone hin, hier muss jetzt eine Kanone oben hin, meine Güte, ist ja fast hier halbe Starcraft, so, dann brauchen wir ganz viele, die letzte Reihe muss erstmal geschützt werden, falls irgendwelche Buddle Zombies kommen, so, halber Pool Stream, ja, schon, true, 0W, so, machen wir die mal platt, dass meine Kürbisse nicht kaputt gehen, so, als nächstes müssen wir erstmal ein bisschen Sonne sammeln, noch würde ich sagen, erst ein bisschen Sonne sammeln, den hier können wir schon mal drüber pflanzen, so, nächste Kanone bauen, nächste Kanone, das ist gut, das ist gut, wenn die sich selbst ein bisschen stallen hier, so, so, wir brauchen auf jeden Fall Pilze gegen die, gegen die Dinger, es gibt ja diese fetten Zombies, die kleine Zombies werfen und da brauchen wir auf jeden Fall die Pilze hier hinten, aber erstmal, wir machen jetzt erstmal das Setup komplett, wir machen jetzt erstmal das Setup komplett mit den Kanonen, weil dann können wir alles bashen, easy, easy clap, so, ah, Melonen muss ich bauen, seck, Melonen muss ich da hin, ne, da, oder, ja, ich brauch auf jeden Fall noch ein bisschen Geld, ach, das kriegt meine Defense auch so hin, so, nächste Maiskanone, 800, ok, das wird, das wird teuer, jetzt muss ich, ich muss ein bisschen sammeln, ich muss ein bisschen, ein bisschen Sonne sammeln, dass das klappt, der andere Seite, ich muss eigentlich auch meine Sachen protekten, so, bauen wir gleich die nächste Kanone bei 800, da gleich soweit, jetzt sofort, ich rampe da einfach drüber, so, nächste Kanone am Start, Geld kann ich nachher sammeln, jetzt erstmal aufbauen, bam, bababam, so, letzte Welle, ähm, ich muss unbedingt die Pilze bauen, zum Defenden, Garlic ist RIP, den brauchen wir jetzt aber nicht mehr, weil jetzt hab ich die Cannons am Start, eine Kanone brauch ich noch, die können wir eigentlich jetzt schon, ah, Mist, hätt ich die jetzt mal schnell geplant, da hätt ich sie nicht mal mitnehmen müssen, na gut, ok, also wir brauchen auf jeden Fall noch einmal das und die Kanone, so, den Kram, brauchen wir bis, bis jedes Ding, es braucht jedes Feld braucht ein Kürbis, so, und jetzt diese Runde müssen wir auf jeden Fall anfangen die Pilze zu bauen, also brauchen wir das und das, so vorne, vorne den Boden haben wir gebaut, was fehlt denn jetzt eigentlich noch, es fehlen jetzt noch Pilze und es fehlen, ah Melonen, Melonenstelz fehlt noch, ups, fuck, Melonenstelz fehlt noch, also zack, Melone und als letztes brauchen wir jetzt noch das Teil, wo ist das, das Schirm, das Schirm brauchen wir noch, hier brauchen wir noch ein Schirm, Schirm, Pilz, Pilz, Pilz, ok, also von der Idee her ist es eigentlich easy jetzt, wir bauen alle Melonen fertig, machen Eismelone draus und hier machen wir Pilze hin in die Reihe, da müssen wir aber noch ein bisschen Sonne bauen, so weg damit, ne den hätt ich da lassen sollen, ich hab noch gar nicht genug Geld, guck mal, jetzt sammel ich, jetzt sammel ich langsamer, jetzt weiß ich auch warum die am Anfang alle in diesen Guides immer so viel Sonnenkram spammen, du hast sonst einfach schlicht und ergreifend nicht genug, so und ich schieß jetzt absichtlich nicht auf die Zombies, ich bau jetzt erst noch mal meine Kanone, so fertig, so jetzt haben wir das Cannon Setup, weil die sollen ein bisschen langsamer gehen, wenn ich die jetzt kille mit meinem, mit dem Eis dann spawnen die so schnell, aber manchmal muss ich sie killen, ja jetzt hab ich, jetzt bleibt mir alles übrig, so, ok, GARLIC GRIP, oh, oh, oh, nein, nein, nein, ihr esst es nicht, ihr esst es, oh, bisschen zu spät, so, ich hab, warte mal, ich brauch noch hier, hier brauch ich noch eine Melone, ne, das war's dann, hier ist noch eine, eine Melone, easy, oh, oh, MonkaS, ok, jetzt hab ich das komplette Setup fertig, jetzt fehlen mir hier nur noch die Pilzreihe, ne, Pilzreihe und Schirm, das Blatt, das Blatt kann ich aber immer noch planten, sobald ich Fallschirms, Bungie Zombies krieg, jetzt erst mal Defenden, so und hier muss ein Pilz hin, ne, seh ich richtig, hier muss ein Pilz hin, genau, die Reihe muss komplett noch verpilzt werden, ich hab zu wenig Sonne, müssen wir mal schauen, was als nächstes kommt, nicht, dass die uns gleich schrecken, aber das, die ersten Wellen sind easy mit den, mit den, mit den Maiskanonen, ist überhaupt kein Problem, oh, was mach ich denn da, also mein Rekord ist 52 Runden, vielleicht schaffen wir das heute, ja, ok, jetzt brauchen wir da noch was und da noch was und den dahin, jawoll, sieht gut aus, sieht gut aus, es wär natürlich cool, wenn das ein bisschen langsamer ging, dass ich mehr Zeit hab, Sonne zu sammeln, oh, Massive, Massive Money, neues iPhone ist raus, so, ok, ich muss diese Reihe, muss ich verpilzen, aber das sammel ich jetzt erst mal ein bisschen Sonne, der nächste kostet ja 500, ha, ha, ha, ha, ich hab nicht aufgepasst, fuck, ha, nein, nein, null, keck wait, ich hab nicht aufgepasst, ok, das könnt jetzt nach hinten losgehen, weil das Ding kostet 850, alter, fuck, jetzt ist wieder mal ganzes Geld weg, shit, hab ich verkackt, siehste, zu viel Chat geguckt, damn, Chat ist schuld, wie immer, ok, aber Kanonen sind jetzt schon mal fertig, also ich brauch Pilze, 1000 Sonne in Sand gesetzt, ja, ok, das ist easy, das ist easy hier, die kriegt man, die kriegt man einfach, so, also, ich brauch den Pilz, den Pilz, die Bohne, davon brauchen wir noch, geh ich mal von aus, brauchen wir noch beide, nee, nicht wirklich, einmal brauchen wir den Kram hier noch, das ist ok, da brauch ich keinen, keinen geklonten Kürbis, wir können aber den Einfrierpilz nehmen, der ist immer praktisch, so, dann brauchen wir noch die, den Schirm und ich glaub noch die, noch ne, noch ne Eismelone, Melonen haben wir jetzt alle, wir müssen eigentlich nur noch das hier jetzt mit Pilzen machen, eigentlich nur noch den hier mit Pilzen und hier und, warte mal, den hier mit Pilzen, hier und hier mit Schirm und der Rest Eismelone, ok, alles klar, machen wir, easy as fuck, sowas nehm ich da jetzt noch mit, brauch ich da jetzt noch irgendwas gescheit, eigentlich, hab ich was, ah Moment, hab ich die Sonne, Sonnen schon abgecreated alle, ja, wie alt ist das Game, ich glaub von 2007 oder so, oh ich hoffe ich hab nix vergessen, Schirm, Dings und Pilz, nee eigentlich nicht, bisschen kacke da ich jetzt 1000 Sonne in den Sand gesetzt hab, aber shit, shit happens, dafür sind die Zombies jetzt einfach, so als nächstes kommt hier hin, dann könnt ihr nämlich hier was hinwerfen und ich kann auf jeden Fall hier defenden und hier defenden, easy, dazu kann ich nur sagen, easy, gar kein Problem, 100, 100 Flaggen, easy, kein, heute, world record, ich sag's euch, world record, was haben wir hier, Eismelonen brauchen wir, alles, das ist jetzt einfach, das muss einfach alles ne Eismelone werden, ich mach jetzt absichtlich nix, weil umso langsamer die Zombies sind, umso mehr Zeit hab ich Zeug zu sammeln und ich brauch noch, ich brauch ordentlich noch Sonne und ich hab kaum noch was, dass meine defense reicht komplett gegen die Crap Zombies, das geht schon als Retro Tour, ich guck mal wie pixelig das ist und 4 zu 3, das Game ist nur 4 zu 3, wenn das nicht Retro ist dann, dann weiß ich ja auch nicht, jaja Boomer Aufmerksamkeit Leute, ich weiß, übrigens wenn ihr irgendwelche Fragen habt oder so, jetzt nicht unbedingt zu dem Game, zu allgemein, könnt ihr in Chat gucken, ich guck ab und zu mal nach, nach ein paar Runden guck ich, guck ich da noch mal Chat, ich guck hier nebenbei immer noch, guck hier nebenbei immer noch Chat, ich denke mal, dass es nachher ein bisschen entspannter wird, wenn ich alles aufgebaut hab und einfach nur sinnlos, sinnlos wegbomben kann alles, neue Melone, passt doch eigentlich, so wir brauchen noch ein paar Pilze, Pilze dahin, wir machen jetzt erstmal, machen wir die Blätter schon, wir machen die Blätter schon, warte mal, hab ich das jetzt richtig gemacht, Blätter, Blätter, Blätter, genau, Blätter, Blätter, ihr werdet gleich sehen wofür die Blätter gut sind, das ist wenn dann, gibt ja so Bungee Jumping Zombies, die dann von oben runter kommen und die werden geplockt, so Eismelone ist gleich aufgeladen, die sind gestalt, dann kann ich jetzt hier eigentlich schon weiter die Blätter hinsetzen, dann ist das Build fast fertig, dann fehlen noch ein paar Eismelone und es fehlen noch ein paar Pilze und dann ist Endless Mode angesagt, dann wird einfach nur noch, nur noch weggebombt, so Eismelone sind auch alle komplett, hier kommt noch, ja was fehlt jetzt noch, zwei Pilze fehlen noch oder, das wars, easy, noch zwei Pilze, irgendwie nicht genug Sonne, heck, heck wait, jetzt, so, oder hab ich irgendwas vergessen, ich glaub das wars vom Setup her, ah da oben fehlt noch ein Kürbis, oben fehlt noch ein Kürbis, oh, oh, na das sind wir aber gerade noch mal rechtzeitig fertig geworden, weil das sind die großen Dinger, die werfen so kleine Zombies, die fressen dann hinten alles weg, da brauchen wir auf jeden Fall oben noch ein Kürbis, da ein Pilz, Pilz und wo ist die Kaffeebohne, Kaffeebohne, Cherry Bomb, so, mal den Kram noch rein, ansonsten Melonen hab ich, falls was kaputt geht, ansonsten brauch ich nix mehr ne, das da, das da, sieht eigentlich gut aus, Melonen hab ich auch alle, ja ist eigentlich, eigentlich, wenn ich jetzt total brain afk bin, was vergessen hab, ist eigentlich alles durch, ja gut, wenn eh alles durch ist, dann können wir einfach noch, noch ne Kirschbombe klonen, ne, mehr Spikes kann ich nicht machen, weil auf die Stellen kann man keine Kirschbomben setzen, wo was ist, stopp, ich glaub so ist es ganz gut, außerdem sind es die abgecreateden Spikes, die gehen soweit ich weiß nicht kaputt, so, hier oben, so, wir sind rechtzeitig fertig geworden, sehr, sehr nice, so, es fehlen mir jetzt eigentlich noch hier oben nen Pilz, das wars, easy, nur hier nen Pilz drin, das ist alles, dann haben wir hier Massive Endless Setup am Start, dann wird gebashed, da kann ich endlich mal n bisschen, bisschen Money in dem Game machen, mit den restlichen Sachen kaufen, die gehen bei Fahrzeugen kaputt, verlieren zacken, ah, ich verstehe, ich verstehe, ja noch sind die keine großartige Bedrohung, so, mir fehlt hier oben jetzt eigentlich nur noch ein Pilz, dann ist das Setup komplett, 600 Zonne, ach, haben wir ja gleich, für Money Making gibt es noch ein Minigame, welches denn, das Zombos Minigame, das letzte, da kommt man glaube ich ganz gut Money machen, so, ich glaube unser Setup ist fertig, wartet mal, lass mal kurz vergleichen, äh, was, äh, äh, Eismelone, Eismelone, Pilz, Pilz, Pilz, Schirm, Eismelone, Eismelone, Pilz, Pilz, Pilz, Schirm und unten das gleiche in der Mitte, sieht gut aus, ich würd sagen Setup ist perfekt, so, jetzt kann ich hier bashen, kann ich eben mal Chat gucken, easy, einfach alles, einfach, einfach, einfach One-Tappen alles, so muss das sein, easy as fuck, wobei ich mir, mich noch so dunkel dran erinnern kann, so ab Welle, ab Welle 15, 16 oder so wirds dann ein bisschen schwieriger, dann spammen, da spammen die dich nämlich voll mit, mit Zombies, da ist komplett hier alles dicht, Maismanagement, genau, wo zielt man die Maiskollen am besten hin, hier so in die Ecke wahrscheinlich, dann triffts nämlich hier auf dem Teil alles und hier alles, so hier würd ich sagen, oh da kommen die dicken, Money, guck deswegen, wegen diesen kleinen Zombies die geworfen werden braucht man überall die Kürbisse, oh huge drops, kann mal nen Screenshot raus und für was, aber mach mal, mach mal, mach einfach, weiß zwar nicht für was genau, aber such mal raus, huge drops, so okay, man muss aber ab und zu auch noch die Kürbisse replacen, sonst wirds nix, ach für den Money Farm, ja, oder gib mal Link auf irgendeinen Guide oder so, aber ich muss eigentlich kein, ich verdiene jetzt genug, wir spielen jetzt bis Runde 50 Billiarden und dann hab ich Easy Max Money, alter Corona, wär schön wenns nen Shortcut für Maiskanonen gäbe, dass man nicht immer die ganze Zeit so machen muss, und ich sag mal, weiß jemand ob's nen Button gibt für wähle die letzten Plans noch mal aus, gibt's wahrscheinlich nicht, so das heißt, wenn wir jetzt den, den, die Kaffeebohne, den, den, das da, und dann nehmen wir noch die Cherry, die Bomben dabei, dann nehmen wir noch das, das W-Platt für die, für die Ballon-Zombies, und das wars, 24inStunden-Stream, also das ist ja ein Endless-Bild, also das hat das Potential Endless zu spielen, ja, das heißt im Endeffekt, wir sehen uns dann morgen um 5, Max geht in Runde 30, kaputt kann gut sein, das kann gut sein, na jetzt, jetzt, ja guck mal jetzt werden die sogar von meinen, von meinen Kanonen geschreckt, von meinen Melonen, Melonen, nicht Kanonen, easy, easy, okay ich soll jetzt nicht so, nicht so viel Memes drücken, weil wahrscheinlich verkacke ich's gleich einmal und dann bin ich instant drip, okay solange da keine von den großen Zombies dabei sind ist easy, können ja gar nichts, aber die refill nicht sonderlich schnell, also wenn man hier mal wirklich alles rausbauen ist, deswegen braucht man, wegen den Zombies braucht man diese Schirmplätter, sonst ziehen die einem die Pflanzen raus, oh wow, Epilepsiewarnung, was passiert, ich erkenne nichts mehr, what the fuck, okay ich hau jetzt einfach Kanonen rein, ich, das überfordert mein Boomer Hirn da jetzt noch durch zu blicken, wo da grad was abgeht, aber einfach Kanonen reinhalten und, und gut ist, so muss das sein, guck so unendlich viel ballern kann man damit nicht, das war schon wieder fast leer, oh, oh, oh, weee, weggeweht, ne was soll man auch so viel schreiben bei dem Game im Chat, sonst ist ja wer los, lass Zombies ein bisschen laufen, oh wir haben die Pros im Chat, mach ich jetzt, pvz Pros im Chat, easy, easy, easy, ah, schreckt, boah ey so viel, guck mal ich hab schon 10k, ich kann, ich kauf gleich einfach, ich mein ich hab schon fast alles in dem Game unlocked ne, aber ich kann, ich kauf einfach gleich alles, oh, der hat so viel Pool Streams geguckt, also wieder die gleiche Geschichte, falls ich neu aufbauen muss, aber Ballonzombies dabei, ach falls wir Ballonzombies dabei haben, der hat Allergie, ne der war zu viel im Pool, zu viel Chlor, du, du, du, nein ich mach jetzt nicht Bubatv auf, gut die kommen ja auch so nicht durch die Defense durch, die Sacken, kleinen Kackknubs hier, Bam, was ein bisschen nervig ist, man muss wirklich auf alles klicken, man muss auf die Kanonen klicken, man muss auf die Sonnen klicken, man muss auf die Münzen klicken, da kannst du doch gar nicht alles einsammeln, vor allem es wird ja pro Runde immer mehr, so dann müssen wir irgendwelche Kürbisse neu machen, neue Coding Stream Auto Sonnenklicker, das gibt's bestimmt schon für das Game, auf der Xbox ging das, auf der Xbox muss man einfach nur im Kreis fahren mit dem Stick und gut war, ich mein es wäre auch fail gewesen auf der Xbox, wenn man wirklich jedes Ding anklicken muss, ich glaub sogar dass auf der Xbox die Münzen automatisch gesammelt hat, oder man musste einfach nur drüber, das heißt du hast auf der Xbox im Prinzip nichts anderes gemacht, wie den Stick permanent im Kreis bewegt, oh Pflanze, Poggers, PVZ ist das ehemalige Aim Lab, oh guck mal da kommt die Rentner, da kommen die Rentner Zombies mit ihren Rollator Dingern, die Boomer Zombies, oh warum, warum klaut er mir einfach eine Sonnenblume, never donate it never stop, neighbor wifi free entertainment, klaut er einfach meine Sonnenblume, oh ich hab alles rausgefeuert, oh das war der falsche Pilz, die klauen eigentlich einfach die Sonnenblume geklaut, Anzeige ist raus, na gut die können wir replanten nächste Runde easy, ab wann hörst du auf Sonnenblumen zusammen gar nicht, weil diese ganze Usables hier kosten ja auch, wie viel brauchen die großen eigentlich an meist zwei, ja zwei oder drei, so ok Sonnenblumen replanten, ich glaub ich passt da wieder, Bungie Zombies, na gut dann Sonnenblumen zack, das da, das da, das da, das da, den da und den da, ah wird schon passen, ach nee Sack, Kürbis braucht man immer, Kürbis braucht man immer ohne Kürbis geht hier nichts, so jetzt könnte ich eigentlich schon auswechseln wieder, das wars wer muss sich davon nicht planten, planten alter, wer muss sich nicht planten, es gibt ja auch ein komplett Auto Setup, da musst du gar nichts machen, da musst du einfach nur Sonnen einsammeln und Münzen, fertig, was ist das Loch von dem Atompilz, diesem Doompilz, das geht dann nicht mehr ein paar Minuten weg, die droppen aber schon ordentlich hier, guck mal hier ich hab angefangen mit 800, jetzt hab ich schon 10k, dazu kann ich nur sagen, ich brauche noch glaube ich das Achievement, sammle alle Pflanzen, oh, bleibst du, bleibst du, gehst du weg da oben, aber das werd ich nie kriegen, da braucht man so viel Lack und muss das 50 Milliarden Stunden spielen, mach ich nicht, man kann hier gar nicht online Pflanzen trainen oder sowas, ey, ha, blocked, oh, oh, oh, da kommt was fettes, Leute da kommt was richtig fettes angefahren und Bundlezombies am Start, MonkaS, jawoll, krieg ichs auf den Sack, 500 APM, hierfür das Game brauchst du mehr als jeder StarCraft Profi, außerdem wer braucht Aim Cap, wenn er PVZ hat, so man muss immer noch mal ein Auge auf den Kürbis haben, falls ein Kürbis kaputt geht, müssen wir den replanten, das geht auf jeden Fall echt aufs Handgelenk und auf den Finger, sag mal, wie gibt es Leute die das bis 1000 Runden spielen, hallo, 1000, 1000, da ist das Mousepad durch bis in den Keller, du musst jede verfickte Münze anklicken und jede Sonne, du könntest einen Bot programmieren, ja, aber das ist ja nicht legit, das ist ja beschiss, ja, bestimmt man kann Pause machen, aber trotzdem, das BTF 1000, ah gut, die gehen auch so kaputt, nice, guck mal, wir sind schon bei Flagge 17, gibt's huge money, 17, da verbrauchst du wahrscheinlich 10 Mäuse, wenn es reicht, du hast 2 Achievements nicht geschafft, welche denn, weißt du es noch, ich hab kaum Achievements in dem Game, da kommen noch mehr Zombies, so, was haben wir hier, Flugzeug, Zombies, Döpp, Döpp, Döpp, Döpp, Kaffeebohne, Kürbis und Stells, perfekt, los geht's, ich hoffe ich hab nichts vergessen, Mobile ist wahrscheinlich angenehmer als auf PC, da kannst du einfach drauf tippen, aber ich muss euch ehrlich sagen, ich glaube die Xbox Version ist echt die beste, weil die Xbox Version ist auch 16 zu 9, da siehst du noch das Haus mit, es wäre natürlich geil, falls es einen Mod gäbe, dass man die Xbox Sachen quasi importieren kann in die PC Version, das wäre richtig cool, Moment, Fans vs. Zombies, 16, 9, ne, hier das geht wahrscheinlich nicht, Full HD auf Whitescreen Mod, aha, HD Backer, ok, es gäbe wohl irgendwelche Hacker Man Hacks um das Whitescreen zu spielen, können wir nochmal ausprobieren, oh klicke, klicke, klicke, klicke, du musst wirklich je den Furz anklicken, heute Nacht klicke ich im Schlaf, heute Nacht klicke ich wahrscheinlich im Schlaf, ja Bloons hab ich mir letztens runtergeladen, das ist ja das mit den Affen und den Luftballons, da kenn ich nur die uralt Flash Variante, das wollte ich auch mal wieder ein paar Runden spielen, das ist ja auch so ein Zuchtgame, da hab ich Bewertungen gesehen auf Steam, wo Leute irgendwie 5000 Stunden Bloons haben, absolut Zuchtgame, was ist besser Bloons 5 oder Bloons 6, hab ich jetzt unterschiedliche Sachen gelesen auf Reddit, 6 ok, easy, easy, easy, jelly, jelly zueinen oh, da kriegst du ja Kopfschmerzen ein, ich muss dir eine Münze anklicken, komm shiny come on bruh, oh, huge Drop ok, ich mach doch ein Mareni gleich in der Logitech Software, die einfach endlos klickt, bis ich ausmache. Achtung, Puster, Puster 82 am Start, gibt's den eigentlich noch? Puster 82, oder war doch Puster 82, der Elsch-Mago-Fatz hat aufgehört mit Battlefield 3, jawoll. Oh, wieder was übersehen. Also ich muss sagen, mit dem Meist-Timing bin ich nicht der Beste. Es hört hier gar nicht mehr auf, und es ist erst Runde 19, da klickst du dich ja kaputt gleich. Es hat sich ausgepustert beim Puster 82, das muss ich mal kurz gucken, Puster 82, gibt's den noch? Da ist er doch, Puster 82, YouTube, da ist er, genau. Der pustet nicht mehr seit Mitte 2020, und er pustet auch auf YouTube nicht mehr, hat sich ausgepustet, hier, weggepustet. Gilt das eigentlich auch als Tower-Defense-Game? Jaja, würde schon sagen. Würde schon sagen, weil was soll es sonst sein, wenn es kein Tower-Defense-Game ist? Ich meine, das sind ja im Prinzip Towers. Ja, da ist es richtig, natürlich weiß ich, dass es nicht aufhört, aber ich frag mich, wenn ich jetzt bei Runde 20 bin, was die da noch abziehen wollen, klar. Was ist dein Rekord, ich glaube 52, 52, Chat, was habe ich vergessen? Nix, ja, los geht's. Top-Down-Shooter, da gab's doch früher, kennt noch einer, CS 2D? Das war so ein Flash-Game, das haben wir teilweise in der Berufsschule noch gespielt. CS 2D, das haben wir in der Berufsschule gespielt, CS 2D. Wie, Moment, das wird noch geupdatet? Alter, das ist, das haben wir vor, das habe ich vor 13 Jahren in der Berufsschule gespielt, wollt ihr mich veräppeln? Oder, oder ist es was anderes gewesen? 9 von 10. Das war super Pausen-Game und auch super in Unterrichts-Game. Es war auf dem Berufsschulrechner auch mehr oder weniger alles drauf, was sich so über die Jahre angesammelt hat. Auf dem einen Berufsschulrechner waren sogar Porns drauf, weiß ich noch, das hat sich nie einer angeguckt. Da gab's irgendeinen Ordner mit Porn drauf, dann siehst du mal, das hat da keinen mehr gejuckt. Das war schon fail, Alter, Berufsschule war so schlecht im Nachhinein, also rein von dem, was man gelernt hat. Ich bin aber, ich hab's ja im Video gesagt, ich bin ja gerne hingegangen, einfach weil's wie Urlaub war. Komm mal hier, fast 10.000 Sonne. Gibt's dann, gibt's dann extra Achievement. Alles gebashed. Was, nein, gehst du weg, gehst du weg, Alter, bam, piss dich, Alter, was soll das, was soll das, was gibt es hier, wenn's fertig ist, der will doch nicht meinen Pilz klauen. Du mein Pilz in Ruhe, du musstest nach der Berufsschule auf die Arbeit, nee, da hatte ich Glück, das musste ich nicht, man muss ja auch nicht mehr auf die Arbeit nach der Berufsschule. Ab, Leute, wie viel, ab wie viel, schon ab 5 Stunden oder so, MonkaS, ah, das wird mir zu viel. Okay, jetzt, jetzt, jetzt ist das Boomer, jetzt ist das Boomer hier überfordert, Leute, jetzt ist das Boomer hier überfordert, ah, was, was geht, okay, wir haben alles easy überlebt. 5 Stunden, genau, ab 5 Stunden muss man nicht mehr, muss man nicht mehr auch in Betrieb nach der Berufsschule. Also ich, ich musste prinzipiell, lässt, lässt du, lässt ihr, bam, glaub, es geht los, klaut er einfach wieder, einfach wieder meinen Pilz klauen. Okay, die brauchen wie viel, oh, sack, brauchen die 3, brauchen die 3? Die fliegt, 22, jawoll, hier, wir knacken jetzt mein, mein, mein Rekord, weil die müssten echt einen Button machen für die gleichen Pflanzen noch mal ausrüsten, ich vergesse nämlich immer irgendwas, isse, oh, der oberste Rasenmäher ist weg, wann ist denn das passiert, habe ich irgendeinen, habe ich irgendeinen, äh, Luftballon Zombie nicht gesehen? Oh, siehst du mal, Multitasking mit 36, das ganze geht nicht mehr, übrigens, diese Zombies sahen in der ersten Version von dem Game aus wie Michael Jackson und als er dann gestorben ist, haben sie das geändert. Diese Dance, diese Dance Zombies, weiß gar nicht warum, ehrlich gesagt, wäre doch eigentlich cool gewesen, wenn er noch im Game drinne wäre, aber gut, kann ich verstehen, jetzt wenn er tot ist und ein Zombie und ja, ja, okay, man wollte da wahrscheinlich Stress aus dem Weg gehen oder man hat sich selbst über gedacht, ist nicht so nett, man muss jede Münze anklicken, mal schauen, ob das noch was wird mit 50 plus Runden, ich hab da so meine Zweifel, boah, ey, meine Güte, das geklicke da fest, ja wahnsinnig, aber alles erwischt, ich muss die Sonne gar nicht anklicken, ich hab eh Max Sonne, alles erwischt, easy easy easy, falsches Emote, ah, da fliegt was, weg damit, ah, Boomer hier ist wieder überfordert, Leute, oh, der Flugchamp, ja, meine Güte, Max, wie stehst du zu Hunden, äh, Achtung, Achtung, oh nee, das war der falsche, nein, der klaut man Pilz, äh, weder noch, also ich bin jetzt kein großartiger Hunde-Fan, aber ich hab keine Schmerzen, also ich mag Katzen lieber als Hunde, aber es ist jetzt nicht so, dass ich Hunde hasse oder so, ich sag, alter, kack Hunde, wer Hunde haben will, soll sich Hunde haben, gibt ja auch paar ganz süße Hunde, aber Katzen beste, vor allem Katze FPS beste, Katzen sind so undankbar, äh, wo ist das, wo ist das, plus, die kommen halt nicht zu einem hin gerannt und äh, freuen sich offensichtlich, damn, jawoll, noch mehr, jetzt wird's aber langsam ganz schön viel, 20k, huge money, oh, wir haben alles aufgebraucht, ich glaub, ich muss mal ein anderes Endless Setup noch ausprobieren, irgendwas, wo man nicht klicken muss, ich mein, hallo, das ist ja wirklich Next Level Aim Lab hier, ja, das kommt auf die Katze an, chat, oh, Mist, jetzt hab ich alles aufgebraucht, ja, aber alles gut, nix kaputt gegangen, wunderbar, der sammelt alles Geld, na klar, money, ich brauch achievements, huge, noch mehr Geld, bau dir eine Geldsammlerpflanze ein, ja, das Problem ist, ich hab kein Platz hier irgendwie noch eine Geldsammlerpflanze hinzustellen, ich mein, ich könnt mein Zen Garden einfach voll machen und dann den ganzen Tag den Rechner anlassen, aber dann spiel ich lieber ein bisschen Endless, Achtung, jetzt machen wir, bam, jawoll, schreckt, schreckt, ja, so geht das, ok, jetzt wird's mir zu viel, Leute, es wird mir zu viel, jetzt, jetzt, mein Boomerhand wirklich am Limit hier, ich muss Geld anklicken, Zeug anklicken, Kanonen anklicken, gucken, dass hier nix gefressen wird, gucken, dass die Kürbisse nicht kaputtgehen, alles Geld aufsammeln, Monke-Ass-Moment, ich muss mal kurz, muss mal kurz alles einfrieren, das wird zu viel jetzt, das wird zu viel, so, gehen irgendwelche Kürbisse kaputt, ne, sieht eigentlich auch alles gut aus, Bild ist äußerst Boomer-unfreundlich, Leute, äußerst Boomer-unfreundlich, das ist auch nicht dafür gemacht, 36-jährige Boomer können das nicht spielen, 36-jährige Boomer hassen diesen Trick, du glaubst nicht, was als nächstes geschieht, ne, das glaube ich wirklich nicht, gucken, 26, ok, die Hälfte haben wir, Leute, die Hälfte von meinem bisherigen Rekord, easy, was mache ich da, falsche Reihenfolge, oh mein Hirn setzt aus, Leute, mein Hirn setzt aus, was habe ich jetzt schon wieder vergessen, ah, Blaseblatt, Boomer müde, hey, schon 21.10, ne, Magnet, wo soll ich den hinstellen, ich habe keinen Platz, wo soll ich hier ein Magnet hinstellen, man könnte vielleicht zwei Sonnenblumen wegmachen, ey, das könnte man echt machen, oder, ich meine, ich habe doch genug Sonne, ich könnte, reichen die goldenen Magnete von hier bis da, ich glaube nicht, das probieren wir gleich aus, ob das mit dem Poggers Magnet funktioniert, wenn nicht rebuilden wir es, also die goldenen Magnete könnten vieles nehmen, ich weiß nicht, wie weit es ist, das ist Delfingeräusch, ach, guck mal, die Boomer auf dem Rollator wieder, guck mal, da machst du Money hier, aber eins haben die richtig gemacht, sowohl die Sounds beim Einsammeln von den Münzen als auch von den Sonnen, das fühlt sich richtig satisfying an, warte mal, das hier können wir noch upgraden, Finger weg, Finger weg von meinem Rasen her, dazu kann ich nur sagen, der Delfinsound geht auch ganz gewaltig auf dem Keks, oh, oh, meine Rasen, meine Rasen ist weg, die haben wirklich meine Rasen geklaut gerade, seht ihr das, die haben einfach die Rasen geklaut, einfach Rasen gerippt, ok, wir müssen Rasen rebuilden nächste Runde, haha, what the fuck, oh, das, also ich sag euch, Aim Lab ist nicht so anstrengend, Audio nicht Auto, ja, dass ich jetzt, also mein Hirn ist eh schon am Limit, dass ich jetzt manche Wörter noch falsch ausspreche, wir können ihm jetzt ja wirklich nicht übel nehmen, warum sammle ich überhaupt noch Sonnen auf, ich hab Max, Max Sonn, Sonn, Max Sonn, ist das schwedische Max, Max Max Sonn, oh, guck hier, gerade, gerade noch rechtzeitig, bevor er mir noch den Rasen geklaut hätte, ok, wir probieren das jetzt mit dem Magnet aus, oh Mist, jetzt hab ich den falsch gesehen, wir probieren das mit dem Magnet aus, ich muss eigentlich schon Rasen replanten, weil ich müsste eigentlich hier, Magnet, Magnet, warte mal, wo ist denn der andere Magnet, da, ach, das ist auch noch ein Pilz, so, ok, jetzt bin ich, jetzt bin ich mal gespannt, ob das funktioniert, ne, ah, ah, shoot, shoot, ah, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ah, shoot, poggers, Magnet, Alter, bester Magnet, ein feiner Magnet, kommt der bis da unten hin, zack, auf Magnet, der ist zu langsam, der Magnet ist zu langsam, Leute, ich muss noch einen bauen, guck mal, der ist zu langsam, der Magnet, der kommt nicht hinterher, ich mach da noch einen Magnet hin, ah, jetzt, jawoll, jetzt wird gelootet, erst fuck, guckt's euch an, der ist loot, jetzt geht das loot rein, huge loot, so ist das nice, es könnte aber halt sein, dass mit die Sonne ausgeht später, boah, so ist das ja geil, so ist das geil, so ist das nice, jetzt lootet's automatisch, mach rechts auch noch Boden, hab ich doch, hier, ne, ne, hier kann ich keinen Boden machen, hier muss ich Pilze und so drauf stellen können, Pilze und Bomben und so, das geht nicht, wenn da Boden ist, lass meinen Boden in Ruhe, piss dich, oh, hier kommen wieder die fetten, guck mal, die Magnete hier, guck's euch an, bam, die kommen nicht hinterher, guck mal, die Magnete sind zu langsam, die sacken zu langsam, ich hab keine Muni mehr, ich hab keine Muni mehr, so, ist hier irgendwas kaputt, muss ich irgendwas retten, ok, die Magnete machen's aber auf jeden Fall ein bisschen leichter, warum sind manche Kürbisse weiß, weil die geklont sind mit so einer Klonfrucht, dann kann man zwei vom gleichen setzen, ja doch, die Magnete helfen schon, die Magnete helfen schon, da muss ich nicht mal ganz so viel klicken, sehr, ein, sehr, sehr nicer Magnet, kann man das eigentlich upgraden hier jetzt, nein, ihr klaut mir hier nix, habt ihr gesehen, wie er schon den Magnet wieder klauen wollte, wir machen jetzt so, replanten das, ok, zwei Stück, zwei Stück, sollte reichen, jawoll, huge, komm mal hier, 30k, easy money, easy life, ok, das da, Pilzstelz und Kaffeebohne und Dings, ok, auf geht's, 30 Flanken Leute, noch, noch 12 bis zu meinem Rekord, nee, nee, oh nee, 22 bis zu meinem Rekord, Monkeys, das dauert ja noch, das dauert ja bis, bis 5 Uhr nachts oder so, Leute, ist wahnsinnig spannendes, intense Gameplay, oder, gib's zu, da ist, da ist jegliches Battle Royale zu gucken, nix dagegen, woher kommt eigentlich das Wort Stelz, ich kann's dir, doch klar kann ich dir sagen, das kommt vom Friseur und mir, wo wir MMOs gespielt haben und da gibt es doch Klassen, die schleichen können und nachdem wir Stelz immer so kacke auszusprechen fanden, haben wir halt gesagt, der Stelz war irgendwann, und daher kommt das, Stelz kommt von Schleichen, Raid Shadow Legends ist langweilig im Vergleich, ja gut, das stimmt, das kann ich mir wirklich vorstellen, Raid Shadow Legends sackt ja auch richtig, komm mal die Magnete, da ohne rechts in die Ecke kommen die Magnete nicht, da muss ich doch ab und zu mal selbst klicken, BÄÄÄM, ah der hat Xessen, oh da fliegt was, ich hab ein bisschen zu wenig Sonnenproduktion hier, das ist das Problem, wenn es jetzt noch ein bisschen weiter geht, dann geht mir irgendwann die Sonne aus, eigentlich kann man immer nur auf die gleiche Stelle zielen und alles easy, guck mal, einfach nur auf diese Stelle zielen und easy easy schreckt alles, dahin und dahin, BÄÄM, null, dahin und dahin, easy win und die Magnete sacken alles für mich ein, perfekt, so mag ich das, wie viel FPS hast du gerade, 240, also mehr kann der Monitor nicht, oh einer entkommen, ui, guck mal die Magnete kommen mit sacken nicht nach, Eats Boomer Strategie, sagt es mal nicht, mein Gehirn war zwischenzeitlich voll am Anschlag, da ging nicht mehr, guck jetzt muss ich die Zombies wieder weg pusten, irgendwo musste ich einen Kürbis reparieren, Leute wo musste ich, ah da, da, da, Kürbis Rep, dann macht ihr schnell ein Makro, nee nee so einfach ist das nicht, du musst schon ab und zu mal noch ein paar Usables reinhauen, aber was heißt so einfach easy, weil schwer ist es jetzt auch nicht gerade ja, aber abwarten, wird ja noch schwieriger, aber es gibt auf jeden Fall fat money, hier alles wieder reloaded, soll ich euch mal sagen dieser komische Delphinsound der geht mir voll auf den Sack, aber richtig, die Magnete, das mit den Magneten Chat war eine richtig gute Idee, richtig, richtig big brain, da hat sich Subscribing wieder gelohnt hier, massive Schwarmintelligenz im Chat, hast du eigentlich ein Ziel welches Level du erreichen willst, ja Weltrekord, Int Overflow, Int Overflow, wann ist ein Int 32, 2 Milliarden 200, doch keine Ahnung, irgendwas bei 2 Milliarden, nee ich hab da kein spezielles, spezielles Goal, 2,1 nicht 2,2, habt ihr das jetzt nachgeguckt oder, das wussten ihr nicht aus dem Kopf aber wusste irgendjemand von euch, das ist 2,147,000,000 und sonst was ist, oh, oh, oh, oh, oh, oh, oh, die Magnete war eine richtig gute Idee, big brain, jetzt muss ich mich um den Mist nicht selbst kümmern, um Eiskräufe sind wir leer, Moment wir müssen mal kurz was in luft sprengt jetzt kommen wieder die fetten zwei stück da drauf zwei stück da drauf amas kürbis kürbis replanten noch in oder der geht kaputt dem muss dem muss ich refreshen hier oder einfach im kopf ausrechnen ja klar 232 easy mache ich immer im kopf sonst ich wollte euch ehrlich gesagt nur fragen ich wollte wissen ob ihr das auch wisst weil es ist ja quickmaps ob vius was das ist oh jetzt wird es viel oder das war es falsche den da müsst ihr refreshen und ich habe nichts mehr shit und der boden geht gleich kaputt da oben boomer hinsetzt wieder aus der delfin geht mir auch voll auf den keck oh der delfin monka ist moment okay sehr sehr jetzt muss ich kurz erst erst mal alles weg bomben hier was noch da ist okay doch wir sind für das safe safe leute safe alles safe kein problem sind wir fit blub blub den boden könnte man mal neu planten hier kürbis brauche jetzt kommt die diskussion wann in ja gut ist die frage ob sein oder anzahlen wir machen ein paar kürbisse gut das sollte jetzt diese runde nichts kaputt gehen dass da das da brauchen wir gegen die flug zombies kurz schauen muss man noch irgendwas irgendwas replanten ja aber die ganzen kürbisse der boden genau der boden muss replantet werden das da das da zack zack perfekt toxi dankeschön für den sub erst mal alles refreschen du du du du du das also dass da bin ich echt begeistert der mag nicht der delfin dieser delfin saunter fack mich so krass ab der fahre ich auch so meine fresse der delfin sauner alles andere ist gut aber dieser delfin saunen macht mich fertig aber hier toxi dankeschön hyper subscription aus spikes spikes am arsch ja jetzt haben wir geplantet jawoll easy guck mal wir brauchen mit der mason wir verlieren aber hier noch die müssten es eigentlich davon dauern gehen jawoll so einmal können wir noch planten komm her das stachel stein planten das level ist sicher als uint 64 gespeichert ok dann wird schwierig ich habe keine ahnung was das maximum für uint 64 ist nein nein du klaust nicht meinen boden ein boden ist mir das war ein boden in roh das ist das das ist zu viel für mein hirn sinnloses gemiem auf dem zweiten monitor und dann hier noch zombies die fänden soll das spiel nicht einfach sein ja warum ist es weg warum ist es weg ich kann jetzt gar nicht replanten ich habe nichts dabei monka es gibt der scheiß delfin ja das scheiß gnome alter ruby das checkt jetzt auch keiner der nicht regelmäßig im stream dabei ist direkt geben müssen gleich replanten nächste runde aber sieht ja noch alles safe aus sieht nur alles safe aus was hat ruby mit scheiß gnome zu tun wie das das weißt du doch du warst doch schon oft genug im stream dabei oh nee der klaut der klaut mein pilz gehst du weg ok replanten also wir brauchen das platz ok wir brauchen einen platz wir brauchen das wir brauchen den pilz stellz wir brauchen die bohne wir brauchen die zwei boden habe ich alles gemacht naja boden passt alles gut nur eins kaputt und versus flug zombies jawohl sonnenblumen nee warum sonnenblumen oh der delfin man der gleiche kollege der gesagt hat der scheiß gnome hat auch immer hat auch immer ruby gesagt das war ja einer das war der typ der auch bei uns also der kollege bei mir auf der arbeit immer schlichter hat auch sein desktop so eingestellt dass es immer gemacht hat im pc speaker wenn er mit der maus an den bildschirmrand gekommen ist und dann hat er gesagt der scheiß gnome als als wird es am gnome liegen huge drops huge drops massive da hinten muss jetzt aufpassen das muss bestimmt auch bald mal replanten aber gibt es jetzt eigentlich jede runde delfine so machen wir mal bumm jawohl so gehört sich das alles wieder replanted ready to go wie hat er das gemacht ja ich weiß es nicht ich weiß bis heute nicht wie das funktioniert dass man seinen pc speaker summen lassen kann wenn man mit der maus am bildschirmrand kommt keine ahnung wirklich legit keine ahnung wie das funktioniert absolut kein plan ok ich muss ich muss ich muss ja gar nicht mehr klicken dafür habe ich den magnet ja am start mehr mehr messen flut delfine finger weg finger weg warum sterben die eigentlich nicht normalerweise sind die doch mit einer kanone hinüber guck mal jetzt geht mir komplett die munition aus wo ist der diamant gewesen habt ihr gesehen habe sie schon eingesammelt ich höre den delfin sehen aber nie hier du musst hier hingucken hier stellt da immer rum der delfine mal kurz slowdown die magnete sind nice guck mal mein mani an kakt delfine ich habe das geschenk übersehen vielleicht kommt es auch automatisch im garten kann sein wie vielen wellen willst du machen weiß ich nicht mal gucken bis ich ins bett gehe ihr wisst ja boomer müde dauert ja nicht mehr lange alter der delfine ich gehe danach gleich ea verklagen für den delfin sound sagt es hat traumatische erlebnisse hinter hinterlassen hier anzeige ist raus heute die sonnenblumen reichen nicht guckt mal seht ihr das wird immer weniger ich brauche eigentlich vier eigentlich kann ich mir den magnet da gar nicht leisten Mal kurz Slowdown, wird mir zu viel und meine Kanonen müssen nachladen. Wie die leben ja immer noch da oben die Viecher. So das muss refreshed werden, huge loot. Ich glaube wenn ich muss einfach mehr Sonnen einsammeln dann geht das schon. So irgendwelche Kürbissdinger nachblenden. Ah nee, hätte fast den Magnet entwendet hier. Entwendet klar. Never Donate, Never Sub, Never Wi-Fi, Free Entertainment hätte er gemacht mit meinem Magnet. Massive Loot. Massiver Loot-Champ. Das kostet so viel Sonne, guck mal das wird immer weniger. Bin ich sparsam genug? So nice die Magnete sind, das funktioniert auf Dauer nicht. Ausreichend verprobt. Der verprobt ist auch so ein Suckerwort. Oh, oh Moment. Fuck. Jetzt habe ich ein Problem. Lass meine Melone in Ruhe. Nein. Close, close. Bin fast meine Melone gerippt, geschreckt da unten. Beinahe wäre es das gewesen mit der Melone. So und das ist alles gut, sieht gut aus, sieht gut aus, sieht gut aus, hier vorne sieht auch gut aus. Ok, jetzt kann es erstmal eigentlich nichts passieren. Das wird geploggt. Das lebt noch. Ich habe da gerade alles drauf gebombt, was irgendwie geht. Ok, wir müssen den Boden replanten da oben, ist fast kaputt. Der Kürbis ist hier auch fast kaputt. Das heißt wir machen jetzt eine neue Aufbaurunde, zack, zack, Boden und Dings, Dings, Dings, Kaffee und Platt, alles gut. Ja und den bei der Gelegenheit. Ich muss, ich muss, oh nein jetzt habe ich da reingeklickt, richtig dumm. Jetzt habe ich einen total, total vereimt. Habt ihr es gesehen? Ich brauche doch mehr Aim Lab Training. Aber das sind zum Glück diesmal so die richtigen Sucker Zombies, die können alle nichts. Oh, da sind auch große dabei. Ok, die können doch was und ich habe, ich habe nichts mehr. Sag mal, kann es sein, dass die Mais, die Maiskanonen nur eine gewisse Maximumanzahl an Zombies hitten können, weil ansonsten müssten die eigentlich down gehen, die Fetten da oben. Guck, der hier, der hätte mit down gehen müssen eigentlich. Die da auch. Jetzt sind sie down gegangen. Hä? Die haben bestimmt irgendein Maximumanzahl, den sie hitten können. Die Sonnen, die Sonnen gehen aus. Wo könnte ich, könnte ich irgendwo noch eine Sonne hin? Eigentlich nicht, ne? Ich habe zu wenig Geld, um das zu maintainen, das Bild. Boah, wie viel die droppen mittlerweile ey. Da fuck, guck mal hier, ich habe 63k gemacht. Richtig geiler Kreiselgrind hier. Richtig nicer Kreiselgrind. Boah, was die droppen mittlerweile. Lul. Ich verliere pro Runde momentan 1k, ja das zackt. Ich muss die Magnete eigentlich weg machen. Aber ohne Magnete ist dumm, da muss ich das ja alles selbst einsammeln. Ne, ne Leute, dann sterbe ich lieber und sammle die Kohle mit den Magneten ein. Das kannste knicken. Ne. Ich kann auch sonst nichts weg machen, ich mein was soll ich sonst weg machen? Den Boden und da eine Sonne hinstellen funktioniert nicht. Ich kann, eigentlich kann ich nichts weg machen. Höchstens, höchstens die hier. Der wollt wieder mal nen Pilz klauen. Oh ne Leute, wir haben, wir haben, wir haben mal keine Delfine die Runde. Poggers. Delfin freie Runde. Aber wir können noch ne Weile spielen mit Magneten. So, wieder, wieder die übliche Geschichte, weil es mega huge spannend. Ich versuche mal ein bisschen sparsam zu sein. Oh wir haben wieder Delfine, please. Please keine Delfine mehr. Okay, wieviel müssen wir noch? 42? Ich schaff mein Rekord nicht Leute. Das ist mir zu, zu pepega gerade. Ich will nicht noch 10 Runden spielen. Ne, ne Moment, das sind nur noch 5 Runden oder? Das sind ja 2 Flagen pro Runde. Okay dann vielleicht doch. Obbei das sieht ganz schön RIP aus jetzt. Ich hab zu wenig, ich hab zu wenig Mais. Mais ist okay, ich glaub das wars. Ah, wobei, wobei, wobei. Oh ne, noch mal Glück gehabt. Noch mal Glück gehabt. Okay, das hat sich jetzt nicht gelohnt. Aber ich hab mich jetzt bei Usables ein bisschen zusammen gerissen, das heißt ich lasse mein Rasen in Ruhe. Ich glaub der kann den Rasen gar nicht aufpicken oder? Ne, kann er gar nicht. Lassen. Please Delfine. Ah Plant. Plant. Banana Planter. Kennt das noch jemand? Das ist da wo der Friseur hat mal ne Montage hochgeladen. Oh, oh Zombie. Ne Montage bei sich hochgeladen von nem Typ der hieß Banana Planter. Und der hat halt übelst krass gecheatet. Hat alles, hat alles One Shot Sniped. Nicht One Shot Sniped. Also Instant Turn On und alles. Sniper Montage vom Cheater auch. Oh Fuck, hier geht was kaputt Leute. Hier geht was kaputt. Ah, Monka. What is Happening? Leute ich brauch die zwei, ich brauch die zwei Sonnen. Das ist das sonst das RIP. Aber es ist mir egal, es ist egal. Ich hab das Money und ich hab keinen Bock den Kram selbst aufzuluten, zu looten jedes Mal. Kürbis sind echt angefressen ja. Die sind gerade nicht gestorben. So jetzt ist die große Preisfrage Leute. Plant ich Sonnenblumen und lasst das mit den Magneten? Oh Boden ist weg. Boden ist weg. Was mach ich Leute? Komm ich geh eh nix pennen. Scheiß drauf, ich lasse das mit den Magneten. Kürbis ist auf weg. Wo ist der Kürbis weg? Ah, da ist der Kürbis weg. Direkt wieder hin. Zack. Ok, für die Runde sollte es auf jeden Fall noch reichen. Delfine sind back. Delfin Warfare. Sollte in jeden Fall die Kürbisse noch am kaputt gehen? Sieht eigentlich gerade ganz ok aus, aber ich muss Sonne looten. Fuck, alles weg. Kein Mais mehr da. Mais weg. Nooo. Sag mal gibt es wirklich Leute, die das bis Runde 1000 gespielt haben? Das ist ja der Wahnsinn. Das bis Runde 1000, meine Fresse ey. Da drehst du doch komplett am Rad danach. Ja klar, du kannst es über mehrere Tage machen, aber trotzdem. What the fuck. Pepega. Ich würde durchdrehen, ja ich auch. Ich drehe jetzt schon durch. Gutes Loot. Nächstes Mal probiere ich ein Auto Setup, ohne dass ich was machen muss. Gehe ich einfach ab. Wobei ich glaube ganz abgehen geht nicht. Weil du musst ab und zu immer noch mal eine Bombe oder so eine Cherrybombe reinsetzen. So. Ja, Mais ist alt. Rasen kaputt, aber ich wollte eh replanten. Ok, Boomer hier ist wieder überfordert, ich merke nix. Ich halte einfach nur noch, ich halte einfach nur noch rein. Ich halte einfach nur noch rein. Trainierende KI gibt es bestimmt schon. Plants vs. Zombies KI. Würde ich mich nicht wundern, gibt es bestimmt schon. Gibt es bestimmt schon. Müssen wir mal auf GitHub gucken. Sorry, auf Shithub. Da sind noch mehr Zombies. 2000, wir haben gar nicht so viel verloren diese Runde. An Money. Ok, wir haben alles replantet. Passt. Also den da, den da, den da, den da, den da, den da, den da, den da, den da, den da, den da. Zack, los geht's. Langsam finde ich den Kram schon. 46, ok, also wir haben jetzt wirklich eine reelle Chance da meinen Rekord zu packen. Ich meine es sind noch drei Runden. Es muss doch gehen. Drei Runden, easy. Muss doch möglich sein. Die halten so viel aus, die fetten Dinger. Guck mal, ich hab nicht genug Mais dafür. Ja, ich hab nicht genug Mais. Und das geht jetzt auch kaputt, weil die Delfine hier rumstelzen. Was hältst du vom angeblichen Battlefield 6 Gameplay Trailer auf TikTok? Hast du mal einen Link? Kenn ich nicht. Oh nein, Grip. Ok, jetzt wird's, jetzt wird's, jetzt wird's kacke. Ich hab jetzt auch kein Mais mehr und das ist jetzt, die Runde hat erst angefangen. Shit. Run dead. TikTok. Können wir uns gleich angucken? Können wir uns gleich angucken. Oh fuck, Alter. Wir haben nicht mehr genug Kanonen. Shit. Ich glaube Leute, ich glaube wir werden überrannt. Der Spawn reicht nicht mehr. Fuck. Der Spawn reicht nicht mehr von dem Maiskram. Ich brauch die sechste Kanone unbedingt wieder. Hoffentlich überleben wir das doch irgendwie. Ich hab auch keine Sonne mehr. Shit. Ok, ich glaub das war's. Ich glaub das war's. ok. Jetzt müssten die Magneten weg. Mal gucken, ob wir die Runde noch überleben. Dann ragequit' dich einfach. 48 habe ich neun Rekorde, nee nee 52 hatte ich. 52 hatte ich. Der hat den Kürbis geklaut. Alter, warum klaust du meinen Kürbis, man? Pepega-Zombie-Mensch. Mann. Frau. Divers. Keine Ahnung. Kann ja kein Mensch sein. Zombie-Mensch geht ja nicht. Sind ja, das waren ja mal Menschen, aber sind ja, sind Zombies noch Menschen, wenn es mal Menschen waren oder sind das jetzt, was sind die denn jetzt eigentlich? Undead. Also nee, dann nicht mehr. Ok Leute, reicht genug. Easy, easy win. Das haben wir keine Chance zu überleben. Ich muss, ähm, ich muss replanten. Ich hab keine Sonne mehr übrig. Man sieht's leider nicht hier. Ich hab noch 12-15 Sonnen, das krieg ich im Leben nicht hin. Ähm, vergiss es. Ok Leute, ich klick jetzt random was an und wir lassen uns bashen. Wir lassen uns bashen. So sieht's aus, wenn man stirbt in dem Game. Wir werden jetzt, wir werden jetzt Gachi-Bast vor den Zombies. Mach jetzt nichts, ich lass mich jetzt überrennen. Oh, bam. Äh, ich mach nicht die 50 voll. Die Runde hätten wir eh nicht gewonnen. Guckt's euch an. Alle zu viele Pool-Streams geguckt. Monarch-S. Rage Quit. Nee, das hätten wir nicht, das hätten wir doch großartig machen sollen. Alter, was da kommt? Guckt euch das mal an. Guckt euch das mal an. Can't wait. Kannst du noch dein Garten zeigen? Ja, mach ich jetzt. Ich mach jetzt Garten und geh in den Shop. Setke. Das ist kein Problem, wir haben den Chat. Wir haben den Chat, wir sind so big brain, uns wächst in zweites Gehirn nach. Nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nicht nochmal. Can't wait. Nee, nee, nee, nee, nee, nee. Ok, sehr gut. Ok, ok, wir gärtnern nochmal schnell ne Runde. Lass nochmal ne Runde gärtnern. So. Massive Garten. Stell's. Schneggel. Wie? Und düngen. Düngen. Yes. Erstmal schön Gartenstells machen. Next floor. So, gehen wir mal kurz den Laden und kaufen noch ein bisschen Dünger. Was hab ich denn da gespawnt? Was ist das? Ach, das ist das Ding, was die Gräber auf der Nachtmap wegmacht. So, jetzt müssen wir den Schubkarre nehmen und den Schubkarre abladen. Exzellent. So, noch mal ne Runde Dünger kaufen. Haben wir genug Geld jetzt? Was bringt der Garten wieder? Im Prinzip Geld. Ich bin mir nicht sicher, ob man nicht auch Pflanzen züchten konnte, die man in Game verwendet dann. Keine Ahnung. Es gibt bestimmt auch ein paar Erfolge. Ich weiß nicht. Genau. So, erst noch ein bisschen Musik spielen. Jawoll. So, was kann ich mir überhaupt noch kaufen? Blumen? Brauche ich nicht. Ah, Aquarium kaufen. Jawoll. 30K, keine Güte. Rechnen brauchen wir nicht, sonst hab ich ja alles. Dünger. Wir können den Baum, ja, wir können den Baum crowen. Ausverkauft, ok. Wir crowen den Baum ein bisschen. Da kriegen wir eine useful Tipps für das Game. Angeblich sollen eingefrorene Zombies langsamer fressen. Aha. Hast du schon von dem Yeti-Zombie gehört in 3.1 oder 3.10, wo es den gab? Nein, noch ganz neu. Ich hab das Game noch nie gespielt. Deshalb sind Pustepilze in Nachtlevels unverzichtbar. Aha. Brauchst du noch Wasser pflanzen für deinen Sandgarten? Ich verwet- was? Ich verwette mein Floam? Nein, was? Ok, great, den Witz verstehe ich nicht. Ok, ich mach das jetzt einfach mal ein bisschen schneller. Kennst du das Plants vs. Zombies 3D Spiel? Ja. Du meinst Garden Warfare, das war tatsächlich ganz cool. Oh, es wächst. Es gibt in jedem Spiel Modus. So, laden. Ich kaufe jetzt einfach mein komplettes Geld in Baum, was soll ich sonst holen? Ich weiß gar nicht, wie oft man den füttern muss. Wie oft muss man den füttern? 100 Mal? Wenn ich höre, was, wenn ich höre? Sollen sich die Unten fürchterlich ändern, wenn man Must-Mustache, also Dings Schnurrbahn, eintippt? Battle for Neighborville, ja, das ist doch, das ist doch, ähm, das ist doch irgendein Garden Warfare, oder? Oh. Oh. Oh, oh. Diese Tipps, die habe ich alle, die habe ich unbedingt, äh, die habe ich gebraucht. Super. Easy, laden. Kaufen jetzt noch zwei. Und schon ist das Geld alles weg. Geld wieder weg. Nächste Runde Survival. Huge Baum. Ja. So, und jetzt sollte ich mir noch irgendeinen Battlefield-League-Trailer angucken. Okay, zeig mal her. Das Spiel hast du in der Ba- Ah, ich hab mich vertippt. So, das da. What the fuck? Äh, kann man das groß machen? Ach, dieses TikTok, das kann man nicht groß machen, oder? Kann man das irgendwie groß machen? Nee, gibt kein Vollbild. Äh, also was sehen wir da? Ähm, das ist real. Das haben die nicht gefakt. Das haben die nicht gefakt. Wobei der Typ eben ziemlich ähnlich aussah wie der Typ in Battlefield 4. Na gut, das ist jetzt irgendwie unsinnig für den Trailer. Das am Anfang sieht aus wie die Battlefield-3-Kampagne. Ich mein, das haben wir ja schon im Vorfeld gesehen. Doch, ich glaube, ich glaube tatsächlich, das ist real. Zumindest teils. Das ist der Typ aus Battlefield 4, Alter. Oder ist das doch gefakt? Zumindest sieht er dem NPC aus Battlefield 4 sehr ähnlich. Man weiß es nicht. Was jetzt? Der Link geht nicht. Sarex. Oder ist es doch fake? Reddit, Battlefield. Nee, ich bin mir nicht sicher. Manches sieht mir, kommt mir sehr bekannt vor. Leak. Okay, doch kein Leak. Ähm. Aber mal davon abgesehen, wenn das der Trailer sein soll, ist das ganz schön zusammenhanglos. Wahrscheinlich ist es ein Fake. Wahrscheinlich ist es ein Fake. Wahrscheinlich ist es ein Fake. Ach, keine Ahnung. Ich will jetzt keine Half-Life-Video gucken. Erstmal eine Runde Evoli Gassi führen, weil ich weiß, es ist kein Evoli. Was ist es denn überhaupt? Wenn's kein Evoli ist, was ist es denn? Puma schlafen. Stimmt, es ist 22.12 Uhr. Ich hoste jetzt den Frasier. Wait a minute. Get Right spielt Raid Shadow Legends. Okay, wenn sogar Get Right ein Raid Shadow Legends Placement macht, dann sollte ich es vielleicht auch machen. Ja. Einer der bekanntesten CS-Spieler überhaupt spielt allen Ernstes Raid Shadow Legends. Okay, vielleicht, vielleicht soll ich das auch machen. Vielleicht soll ich das auch machen. Ey, wenn sogar Get Right ein Raid Shadow Legends spielen, Alter. Es ist keiner worden. Der Friseur ist off. Tja. Dann hoste ich jetzt den Pool. Oder wir hosten jetzt, wir hosten jetzt Miramizu. Lul. Original BoobCamp Stream. Nein, wir hosten den WoopTube. WoopTube Champ. Mach Raid, kein Host, okay. Wir raiden jetzt meinen Poolstream. Was heißt mein Poolstream? Ist ja nicht mein Poolstream. Ist ja, auch wenn es so aussieht. Wir raiden den jetzt. Also Leute, wir sehen uns bis morgen. Macht's gut. See you.", "segments": [{"id": 1, "start": 0.0, "end": 14.32, "text": "Ich bin noch mal am Start."}, {"id": 2, "start": 14.32, "end": 40.32, "text": "Es sind 11 Leute am Start, seid ihr noch heute Morgen drin und es hat jetzt einfach"}, {"id": 3, "start": 40.32, "end": 47.32, "text": "gelaudet oder?"}, {"id": 4, "start": 47.32, "end": 50.32, "text": "LUL."}, {"id": 5, "start": 50.32, "end": 53.32, "text": "LULHD."}, {"id": 6, "start": 53.32, "end": 59.32, "text": "Warum gibt es eigentlich kein LULHD-Emote?"}, {"id": 7, "start": 59.32, "end": 62.32, "text": "FFZ."}, {"id": 8, "start": 62.32, "end": 65.32, "text": "Better Twitch TV."}, {"id": 9, "start": 65.32, "end": 67.32, "text": "Es gibt kein LULHD."}, {"id": 10, "start": 67.32, "end": 68.32, "text": "Warum gibt es kein LULHD?"}, {"id": 11, "start": 68.32, "end": 70.32, "text": "Ich brauche ein LULHD-Emote."}, {"id": 12, "start": 70.32, "end": 76.32, "text": "Es gibt aber auch bestimmt ein paar lachende Total Biscuit Bilder in High Definition."}, {"id": 13, "start": 76.32, "end": 94.32, "text": "Oh, die Musik ist ein bisschen laut."}, {"id": 14, "start": 94.32, "end": 97.32, "text": "TF, was ist das für eine komische Playlist, bitte?"}, {"id": 15, "start": 97.32, "end": 102.32, "text": "Guck mal, ist das ein Evoli?"}, {"id": 16, "start": 102.32, "end": 107.32, "text": "Poggu, Mr."}, {"id": 17, "start": 107.32, "end": 112.32, "text": "Hammy auch mal wieder am Start, nice."}, {"id": 18, "start": 112.32, "end": 115.32, "text": "Leute, ich muss euch mal was erzählen."}, {"id": 19, "start": 115.32, "end": 117.32, "text": "Ich habe gestern gemerkt..."}, {"id": 20, "start": 117.32, "end": 122.32, "text": "Also wie soll ich das sagen?"}, {"id": 21, "start": 122.32, "end": 130.32, "text": "Ich habe gestern realisiert, dass ich alt bin."}, {"id": 22, "start": 130.32, "end": 136.32, "text": "Aber jetzt anders als ihr denkt, anders als ihr denkt Leute, anders als ihr denkt."}, {"id": 23, "start": 136.32, "end": 145.32, "text": "Und zwar, ich habe gestern mal wieder mit dem Fabian Discord gelabert und da habe ich"}, {"id": 24, "start": 145.32, "end": 151.32, "text": "erfahren, dass jetzt von einem gemeinsamen Kumpel von uns die Freundin schwanger ist."}, {"id": 25, "start": 151.32, "end": 152.32, "text": "So alt wie wir."}, {"id": 26, "start": 152.32, "end": 155.32, "text": "So, und da ist mir immer wieder aufgefallen, wie alt ich bin."}, {"id": 27, "start": 155.32, "end": 157.32, "text": "Früher haben wir uns da lustig drüber gemacht."}, {"id": 28, "start": 157.32, "end": 165.32, "text": "Ich habe mit dem Fabian und dem Mastercraver, habe ich MMO Kreiselgrind gemacht und wir"}, {"id": 29, "start": 165.32, "end": 168.32, "text": "haben uns über sowas lustig gemacht und jetzt ist es so weit, Alter."}, {"id": 30, "start": 168.32, "end": 176.32, "text": "Wir haben uns lustig gemacht über so Dinge wie, warte mal ab bis wir 35 sind und Kinder"}, {"id": 31, "start": 176.32, "end": 177.32, "text": "kriegen und so."}, {"id": 32, "start": 177.32, "end": 179.32, "text": "Jetzt ist es so weit."}, {"id": 33, "start": 179.32, "end": 187.32, "text": "Das haben wir damals aus Scheiß gesagt, weil wir gedacht haben, das kommt eh nicht so."}, {"id": 34, "start": 187.32, "end": 194.32, "text": "Und jetzt ist es so weit, Alter."}, {"id": 35, "start": 194.32, "end": 198.32, "text": "Ich musste übrigens mal eine Nachricht schreiben."}, {"id": 36, "start": 198.32, "end": 201.32, "text": "Ich weiß das ja offiziell noch gar nicht."}, {"id": 37, "start": 201.32, "end": 204.32, "text": "Wobei, doch, ja."}, {"id": 38, "start": 204.32, "end": 207.32, "text": "Ich meine, fuck."}, {"id": 39, "start": 207.32, "end": 214.32, "text": "Ja, aber mir ist es, ich kriege eh keine Kinder, aber andere vielleicht, die ich kenne."}, {"id": 40, "start": 214.32, "end": 221.32, "text": "Ich habe da gar keinen, wie soll ich sagen, gar keinen Bestreben, da irgendwie Nachwuchs"}, {"id": 41, "start": 221.32, "end": 222.32, "text": "zu zeugen oder so."}, {"id": 42, "start": 222.32, "end": 224.32, "text": "Macht ja auch nichts."}, {"id": 43, "start": 224.32, "end": 232.32, "text": "Männer, Männer, Männer können mit 90 noch Kinder kriegen, ist überhaupt kein Problem."}, {"id": 44, "start": 232.32, "end": 235.32, "text": "Nee, ich habe da, ich habe da keinen Bock drauf."}, {"id": 45, "start": 235.32, "end": 237.32, "text": "Ich finde es, ich finde es schon geil."}, {"id": 46, "start": 237.32, "end": 238.32, "text": "Das ist mir gestern erstmal aufgefallen."}, {"id": 47, "start": 238.32, "end": 243.32, "text": "So, das ist mir wirklich zum ersten Mal so richtig aufgefallen."}, {"id": 48, "start": 243.32, "end": 248.32, "text": "Das, das, das ich jetzt, ich bin echt alt, ja."}, {"id": 49, "start": 248.32, "end": 254.32, "text": "Gut, ich meine 36 ist eigentlich so insgesamt, am Gesamtlebenserwartung noch jung, aber."}, {"id": 50, "start": 254.32, "end": 260.32, "text": "Krass, hätte ich nicht gedacht."}, {"id": 51, "start": 260.32, "end": 271.32, "text": "Denkt man so, aber es gibt dann doch erstaunlich viele."}, {"id": 52, "start": 271.32, "end": 276.32, "text": "Und es gibt sogar umgedreht, es gibt sogar mittlerweile relativ viele Informatikergrills."}, {"id": 53, "start": 276.32, "end": 281.32, "text": "36, aber anders als 36 vor ein paar Jahrzehnten."}, {"id": 54, "start": 281.32, "end": 282.32, "text": "Ja, das stimmt."}, {"id": 55, "start": 282.32, "end": 285.32, "text": "Heute kann man sich entscheiden mit 36."}, {"id": 56, "start": 285.32, "end": 291.32, "text": "Ist man mit 36 Boomer alt oder, ich meine gut, mit 36 werden die wenigsten noch rumlaufen"}, {"id": 57, "start": 291.32, "end": 297.32, "text": "und was erzählen wie, fühl ich, fühl ich Digger oder was sagt man dann heute noch"}, {"id": 58, "start": 297.32, "end": 302.32, "text": "so, sus, sus, sus fühl ich Digger."}, {"id": 59, "start": 302.32, "end": 307.32, "text": "Nee, was ist dann so die typische, ah ja, keine Ahnung."}, {"id": 60, "start": 307.32, "end": 310.32, "text": "Aber heute kann man sich, heute kann man sich wirklich entscheiden, ja."}, {"id": 61, "start": 310.32, "end": 318.32, "text": "Also, ist man, jeet, also ist man mit 36 Boomer alt oder ist man mit 36 noch normal."}, {"id": 62, "start": 318.32, "end": 322.32, "text": "Jaja, das ist heute anders als vor 20 Jahren, das stimmt schon."}, {"id": 63, "start": 322.32, "end": 330.32, "text": "Es ist eh so, für mich ist auch alles ab, ursprünglich mal alles ab, was nach 1990"}, {"id": 64, "start": 330.32, "end": 335.32, "text": "geboren ist, ist jung, allerdings ist das Problem, die sind auch schon 30."}, {"id": 65, "start": 335.32, "end": 342.32, "text": "Ah, da hab ich ja noch vier Jahre Zeit, easy."}, {"id": 66, "start": 342.32, "end": 349.32, "text": "So Leute, wir spielen heute nicht einfach nur Plants vs. Zombies, wir probieren uns"}, {"id": 67, "start": 349.32, "end": 351.32, "text": "heute mal in Endless Survival."}, {"id": 68, "start": 351.32, "end": 355.32, "text": "Ich hab das schon mal gespielt, es ist nicht so, dass ich das noch nie gespielt hätte,"}, {"id": 69, "start": 355.32, "end": 356.32, "text": "aber nicht sonderlich weit."}, {"id": 70, "start": 356.32, "end": 357.32, "text": "Mal gucken, wie weit wir kommen."}, {"id": 71, "start": 357.32, "end": 370.32, "text": "Wir knappen, wir schnappen uns einfach hier so ein Fottem-Bild und bauen das nach vor"}, {"id": 72, "start": 370.32, "end": 377.32, "text": "20 Jahren Wachstum in Verbandskästen gepinkelt."}, {"id": 73, "start": 377.32, "end": 385.32, "text": "Warum hab ich das noch auf?"}, {"id": 74, "start": 385.32, "end": 386.32, "text": "Warum läuft das immer noch?"}, {"id": 75, "start": 386.32, "end": 387.32, "text": "Warum läuft das immer noch?"}, {"id": 76, "start": 387.32, "end": 390.32, "text": "Hat der Serious Max 5 Stunden Abteilen?"}, {"id": 77, "start": 390.32, "end": 396.32, "text": "Der hat den ganzen Tag irgendwo einen Server gemietet und streamt das den ganzen Tag."}, {"id": 78, "start": 396.32, "end": 400.32, "text": "World Record Attempt, ich hab ehrlich gesagt keine Ahnung, wo der World Record ist."}, {"id": 79, "start": 400.32, "end": 405.32, "text": "Der World Record ist wahrscheinlich bei 500.000 Flagen, weil es gibt ja Builds, die sind"}, {"id": 80, "start": 405.32, "end": 407.32, "text": "komplett Endless, da musst du gar nichts machen."}, {"id": 81, "start": 407.32, "end": 414.32, "text": "Also es gibt ja solche Builds hier, das ist ja noch das manuelle Build, hier muss man"}, {"id": 82, "start": 414.32, "end": 417.32, "text": "ja noch was machen, ja."}, {"id": 83, "start": 417.32, "end": 426.32, "text": "Aber es gibt ja richtige, guck mal, es gibt so komplette Endless Builds, da kannst du einfach"}, {"id": 84, "start": 426.32, "end": 430.32, "text": "AFK gehen und easy win."}, {"id": 85, "start": 430.32, "end": 435.32, "text": "Aber das machen wir nicht, wir machen so ein Noob-Build, weil ich hab schon, ich bin da"}, {"id": 86, "start": 435.32, "end": 439.32, "text": "nicht gut und ich hab das auch schon, ich hab das nicht viel gespielt."}, {"id": 87, "start": 439.32, "end": 445.32, "text": "Es ist nicht so als würde ich jeden Tag Plants vs. Zombies grinden oder so, aber das machen"}, {"id": 88, "start": 445.32, "end": 446.32, "text": "wir jetzt mal."}, {"id": 89, "start": 446.32, "end": 448.32, "text": "So was bauen wir jetzt hier in der Richtung."}, {"id": 90, "start": 448.32, "end": 451.32, "text": "Ich hab das, wie gesagt, ich hab das schon mal gespielt, ich glaube man fängt an genau"}, {"id": 91, "start": 451.32, "end": 456.32, "text": "mit ganz vielen Sonnenblumen, da stellt man irgendwie die ersten 1-2 Runden und dann"}, {"id": 92, "start": 456.32, "end": 459.32, "text": "baut man das Ganze um zu sowas."}, {"id": 93, "start": 459.32, "end": 465.32, "text": "Und dann mal gucken, mal gucken wie das läuft, wie gesagt schon ein bisschen her."}, {"id": 94, "start": 465.32, "end": 470.32, "text": "Hab ich noch, was hab noch Raspberry Pi Zero rumliegen, hast du einen Vorschlag, was ich"}, {"id": 95, "start": 470.32, "end": 471.32, "text": "damit machen kann?"}, {"id": 96, "start": 471.32, "end": 477.32, "text": "Ne, das kann man so pauschal nicht sagen, ist halt die Frage, ob es irgendwas sinnvolles"}, {"id": 97, "start": 477.32, "end": 478.32, "text": "gibt, was du brauchst."}, {"id": 98, "start": 478.32, "end": 486.32, "text": "Das kann man so echt schlecht sagen, von einer Kamera bis irgendein Dashboard bis im Zweifelsfall"}, {"id": 99, "start": 486.32, "end": 492.32, "text": "Home Automation, irgendwie ein lokales Wiki oder sonst was, da gibt es ja zig Varianten,"}, {"id": 100, "start": 492.32, "end": 493.32, "text": "was man so machen kann."}, {"id": 101, "start": 493.32, "end": 503.32, "text": "23 Monate, das ist ja Massive Hyper Subscription, Alter, Huge Big Brain, da können wir eigentlich"}, {"id": 102, "start": 503.32, "end": 504.32, "text": "nur noch gewinnen."}, {"id": 103, "start": 504.32, "end": 507.32, "text": "By the way, soll ich die Kategorie auf Plants vs."}, {"id": 104, "start": 507.32, "end": 510.32, "text": "Zombies stehen lassen oder soll ich die Kategorie einfach auf Retro machen?"}, {"id": 105, "start": 510.32, "end": 516.32, "text": "Das ist ja schon Retro, ich meine das Game kann wann raus, 2008 oder so."}, {"id": 106, "start": 516.32, "end": 519.32, "text": "Retro gucken bestimmt, ich muss jetzt mal kurz was gucken."}, {"id": 107, "start": 519.32, "end": 525.32, "text": "Gibt es noch Leute, die dieses Spiel streamen auf Twitch?"}, {"id": 108, "start": 525.32, "end": 534.32, "text": "Ah, die spielen Kampagne und ansonsten streamt im Prinzip auch."}, {"id": 109, "start": 534.32, "end": 543.32, "text": "What the fuck?"}, {"id": 110, "start": 543.32, "end": 548.32, "text": "Retro gleich mehr Klicks, komm wir schalten auf Retro um."}, {"id": 111, "start": 548.32, "end": 549.32, "text": "Retro."}, {"id": 112, "start": 549.32, "end": 550.32, "text": "Bam."}, {"id": 113, "start": 550.32, "end": 555.32, "text": "Plants, Zombies, Endless, Survival."}, {"id": 114, "start": 555.32, "end": 568.32, "text": "Bleiben wir jetzt in Titel rein, easy, jetzt ist Retro, bam."}, {"id": 115, "start": 568.32, "end": 570.32, "text": "Wann kommt Peggle Deluxe?"}, {"id": 116, "start": 570.32, "end": 573.32, "text": "Ich hab diesen ganz Casual Crap hab ich nie gespielt."}, {"id": 117, "start": 573.32, "end": 576.32, "text": "Leute, ich muss jetzt noch mal eine Sache loswerden zu dem was ich am Anfang gesagt"}, {"id": 118, "start": 576.32, "end": 580.32, "text": "hab, wie gesagt, da ich realisiert hab, gestern Abend so zum ersten Mal richtig"}, {"id": 119, "start": 580.32, "end": 582.32, "text": "schass ich echt alt bin mittlerweile."}, {"id": 120, "start": 582.32, "end": 591.32, "text": "Und zwar, eins wollte ich euch jetzt mal sagen, vielleicht für die Leute die noch"}, {"id": 121, "start": 591.32, "end": 594.32, "text": "nicht so alt sind."}, {"id": 122, "start": 594.32, "end": 600.32, "text": "Wenn man Sachen so erlebt, sei das dass man mit irgendwelchen Kumpels in MMO spielt"}, {"id": 123, "start": 600.32, "end": 603.32, "text": "oder irgendwelche geilen Sachen hat."}, {"id": 124, "start": 603.32, "end": 606.32, "text": "Wow, der Eltschwangerfahrzeit aufgehört, Sauerei."}, {"id": 125, "start": 606.32, "end": 611.32, "text": "Kann man die Notifications ausschalten irgendwie?"}, {"id": 126, "start": 611.32, "end": 614.32, "text": "Unsichtbar, hab ich doch."}, {"id": 127, "start": 614.32, "end": 617.32, "text": "Ja, gut, Keco now drei Monate."}, {"id": 128, "start": 617.32, "end": 620.32, "text": "Also was ich euch sagen wollte ist folgendes."}, {"id": 129, "start": 620.32, "end": 624.32, "text": "Egal ob ihr jetzt mit irgendwelchen Kumpels MMOs grindet oder irgendwie meinetwegen auch"}, {"id": 130, "start": 624.32, "end": 626.32, "text": "Elstels macht oder sonst was."}, {"id": 131, "start": 626.32, "end": 631.32, "text": "Wenn man jünger ist und das ist mir aufgefallen, jetzt so ist mir das zurückblickend aufgefallen,"}, {"id": 132, "start": 631.32, "end": 637.32, "text": "denkt immer, das ist ja nichts besonderes, das kann man ja alles jederzeit wieder machen"}, {"id": 133, "start": 637.32, "end": 643.32, "text": "oder ja, das ist jetzt nicht so wild, also wenn das nächste MMO kommt, da wird wieder"}, {"id": 134, "start": 643.32, "end": 644.32, "text": "gegrindet."}, {"id": 135, "start": 644.32, "end": 650.32, "text": "Aber ich kann euch sagen genießt die Sachen, wenn ihr sie macht, weil ihr wisst nicht ob"}, {"id": 136, "start": 650.32, "end": 651.32, "text": "es das nochmal gibt."}, {"id": 137, "start": 651.32, "end": 657.32, "text": "Oder sagen wir mal umgedreht, irgendwann wird das letzte Mal sein, dass ihr irgendwas"}, {"id": 138, "start": 657.32, "end": 659.32, "text": "spezielles macht."}, {"id": 139, "start": 659.32, "end": 663.32, "text": "Gippe Hands, ja."}, {"id": 140, "start": 663.32, "end": 671.32, "text": "Ob ich jemals wieder beispielsweise mit dem Karsten und Fabian irgendwie MMO grinden werde"}, {"id": 141, "start": 671.32, "end": 674.32, "text": "ist keine Ahnung."}, {"id": 142, "start": 674.32, "end": 679.32, "text": "Wie gesagt, der Karsten kriegt jetzt ein Kind."}, {"id": 143, "start": 679.32, "end": 684.32, "text": "Ich hab keinen Gamer, was ich spielen will."}, {"id": 144, "start": 684.32, "end": 687.32, "text": "Dann brauchen wir noch ein Game, was ich mit dem Fabian zusammen spielen kann, was uns"}, {"id": 145, "start": 687.32, "end": 689.32, "text": "so einfach ist."}, {"id": 146, "start": 689.32, "end": 694.32, "text": "Deswegen, ich sag euch Leute, man denkt früher immer, das ist so easy, das kannst du alles"}, {"id": 147, "start": 694.32, "end": 695.32, "text": "jederzeit wieder machen."}, {"id": 148, "start": 695.32, "end": 699.32, "text": "Aber das muss nicht so sein."}, {"id": 149, "start": 699.32, "end": 704.32, "text": "Und was ich euch auch empfehlen kann in der heutigen Zeit, was wirklich cool ist, weil"}, {"id": 150, "start": 704.32, "end": 708.32, "text": "das, das ging früher nicht, sonst hätte ich es gemacht, captchert einfach ein bisschen"}, {"id": 151, "start": 708.32, "end": 709.32, "text": "was."}, {"id": 152, "start": 709.32, "end": 715.32, "text": "Macht Shadowplay an, was auch immer gerade warum das auch immer kaputt ist, macht Shadowplay"}, {"id": 153, "start": 715.32, "end": 716.32, "text": "an."}, {"id": 154, "start": 716.32, "end": 723.32, "text": "Alter, die Musik ist ja, ist ja, guck mal, da geht das, ist das ein Efoli, das Efoli geht,"}, {"id": 155, "start": 723.32, "end": 724.32, "text": "Gassi."}, {"id": 156, "start": 724.32, "end": 725.32, "text": "Captchert ein paar Sachen."}, {"id": 157, "start": 725.32, "end": 730.32, "text": "Also wenn ihr beispielsweise irgendwie den ersten Raid macht in irgendeinem MMO, mit"}, {"id": 158, "start": 730.32, "end": 736.32, "text": "irgendwelchen Leuten, wo ihr, die ihr kennt oder einfach nur weil es fast geil ist, captchert"}, {"id": 159, "start": 736.32, "end": 737.32, "text": "das einfach."}, {"id": 160, "start": 737.32, "end": 738.32, "text": "Captchert das."}, {"id": 161, "start": 738.32, "end": 739.32, "text": "Nehmt euch eine externe Festplatte."}, {"id": 162, "start": 739.32, "end": 741.32, "text": "Ich fänd's geil, hätte ich das jetzt gemacht."}, {"id": 163, "start": 741.32, "end": 742.32, "text": "Das ist kein Efoli."}, {"id": 164, "start": 742.32, "end": 743.32, "text": "Was ist das denn?"}, {"id": 165, "start": 743.32, "end": 747.32, "text": "Ich hab keinen Schimmer von Pokemons, Alter."}, {"id": 166, "start": 747.32, "end": 753.32, "text": "Nehmt euch eine externe Festplatte, nehmt euch eine 10TB-Platte oder was auch immer."}, {"id": 167, "start": 753.32, "end": 758.6, "text": "Captchert was, wenn ihr was Geiles, Geiles macht mit den Leuten und speichert euch das."}, {"id": 168, "start": 758.6, "end": 763.48, "text": "Dann könnt ihr euch das 20 Jahre später angucken."}, {"id": 169, "start": 763.48, "end": 769.08, "text": "Das war, das ging da früher noch nicht so, ne."}, {"id": 170, "start": 769.08, "end": 772.36, "text": "Früher hast du noch nicht einfach, da hat der Fraps, kennt noch einer Fraps?"}, {"id": 171, "start": 772.36, "end": 774.8, "text": "Damals musstest du Spiele mit Fraps captchern und so ein Kack."}, {"id": 172, "start": 774.8, "end": 784.8, "text": "Max, ich möchte ein Lastfirma Netzwerk."}, {"id": 173, "start": 784.8, "end": 788.2, "text": "Es soll wirklich nur als Datenablage und Schärfe für mehrere Netze, würdest du sagen"}, {"id": 174, "start": 788.2, "end": 789.2, "text": "die Einschränkungen davon sein?"}, {"id": 175, "start": 789.2, "end": 792.8, "text": "Jaja, die sind gar nicht so schlecht, die Cyanology-Dinger."}, {"id": 176, "start": 792.8, "end": 796.8, "text": "Kann man schon kaufen, würde ich, also wenn du einfach nur sinnlos hinstellen, speichern"}, {"id": 177, "start": 796.8, "end": 800.6, "text": "willst und halt dich nicht selbst drum kümmern, dann sind die Cyanology-Dinger nicht so gut."}, {"id": 178, "start": 800.6, "end": 802.76, "text": "Nein, nein, nein, das würde ich auch nicht machen."}, {"id": 179, "start": 802.76, "end": 806.48, "text": "Macht das, macht das ohne Scheiß, machts euch auf eine externe Platte, macht da ab und zu"}, {"id": 180, "start": 806.48, "end": 808.88, "text": "mal ein Backup, guckt mal, ob das ab und zu funktioniert."}, {"id": 181, "start": 808.88, "end": 813.52, "text": "Captchert die Sachen, genauso wie jeder Handy dabei, macht mal Foto und Videos, das könnt"}, {"id": 182, "start": 813.52, "end": 818.64, "text": "ihr euch später angucken, weil ich sag euch, irgendwann und ihr wisst es zu dem Zeitpunkt"}, {"id": 183, "start": 818.64, "end": 825.16, "text": "nicht, ist es das letzte Mal, dass ihr eine Sache macht, wovon ihr noch denkt aktuell"}, {"id": 184, "start": 825.16, "end": 829.84, "text": "zu diesem Zeitpunkt, ach das ist doch das Normalste von der Welt und 20 Jahre später"}, {"id": 185, "start": 829.84, "end": 837.12, "text": "denkt ihr euch, wann war denn das, naja egal, so wir bashen jetzt, alter."}, {"id": 186, "start": 837.12, "end": 849.12, "text": "Übrigens, der Hype-Train ist bei 94% wenn sich einer noch erbarmt, by the way, warum"}, {"id": 187, "start": 849.12, "end": 853.28, "text": "ist, stimmt das Spiel, mir fällts ja, ich bin ja auch Kacknoob, das ist ja immer 4"}, {"id": 188, "start": 853.28, "end": 855.12, "text": "zu 3, ich strecke das ja in den Videos immer."}, {"id": 189, "start": 855.12, "end": 868.44, "text": "Was machen wir denn jetzt, brauche ich da, Leute soll ich euch stretchen oder soll ich"}, {"id": 190, "start": 868.44, "end": 871.44, "text": "an die Seite ein paar Billchen machen, ich kann an die Seite ein paar Billchen, ist halt"}, {"id": 191, "start": 871.44, "end": 877.44, "text": "so, ne ich lasse das so, ich lasse das einfach so, aber wir müssen die Guides hier übrigens"}, {"id": 192, "start": 877.44, "end": 881.88, "text": "aufmachen, weil ich richtig, richtig noobig bin und keine Ahnung hab, wie das genau,"}, {"id": 193, "start": 881.88, "end": 887.52, "text": "ob, ob ist das grün, alter, was ist das denn, also ich muss eben, ich muss eben ein paar"}, {"id": 194, "start": 887.52, "end": 893.84, "text": "Billchen, what the fuck, wieder kaputt, so, das Bild muss ich aufmachen, ich muss wussten,"}, {"id": 195, "start": 893.84, "end": 899.24, "text": "wie man das Bild aufbaut und das da muss ich aufmachen, weil man gucken kann, wie das"}, {"id": 196, "start": 899.24, "end": 904.2, "text": "Endgame-Bild aussieht, ok, exellent, also so fangen wir jetzt an, easy und dann wird"}, {"id": 197, "start": 904.2, "end": 908.72, "text": "gebashed, alter, vielleicht, vielleicht schaffe ich ja meinen Rekord von 53 Runden, wie gesagt"}, {"id": 198, "start": 908.72, "end": 913.16, "text": "ich hab das nie sonderlich großartig gespielt, Basti Baron zwei Monate, dankeschön für"}, {"id": 199, "start": 913.16, "end": 917.92, "text": "den Sub, Massive, dankeschön, hast du schon mal Garnwaffel gespielt, ja sogar mit dem"}, {"id": 200, "start": 917.92, "end": 921.76, "text": "Friseur zusammen damals, das ist eigentlich ganz nett, oh erst mal Gießsauce, erst mal"}, {"id": 201, "start": 921.76, "end": 931.88, "text": "Gießstelz machen, ja bam, jawoll, by the way diese Gießkanne ist auf dem PC total sinnlos,"}, {"id": 202, "start": 931.88, "end": 937.28, "text": "auf der Xbox hast du glaube ich einmal geklickt und es wurden alle gegossen, erst mal Dünger"}, {"id": 203, "start": 937.28, "end": 949.12, "text": "kaufen, jawoll, ah jetzt Gärtner Stream, so muss das sein, der wollte mir nicht zugucken"}, {"id": 204, "start": 949.12, "end": 954.48, "text": "beim Gärtner schon mal, übrigens ich sollte vielleicht mal eine von beiden Musik ausmachen,"}, {"id": 205, "start": 954.48, "end": 969.56, "text": "haben wir die Schnecke gekriegt, das war es, bam, flitze, kann man, ah Gott mal hier, G-Bait,"}, {"id": 206, "start": 969.56, "end": 976.56, "text": "na gut da muss man den Kram halt rücken, also wir machen jetzt optimist, optimist das Bild,"}, {"id": 207, "start": 976.56, "end": 989.56, "text": "huge optimising, hier, fack, massiv optimist, ich habe überhaupt kein Geld, so Hauptmenü,"}, {"id": 208, "start": 989.56, "end": 996.92, "text": "überleben, 52 Splangen habe ich schon geschafft, hast du eigentlich nur ein Screen, nee ich"}, {"id": 209, "start": 996.92, "end": 1001.48, "text": "habe zwei Screens, aber ich will ja dass ihr seht was ich, was ich gucke, deswegen mache"}, {"id": 210, "start": 1001.48, "end": 1015.0, "text": "ich das hier auf, so fangen wir an, ok, endlos, überleben, endlos, auf gehts, weiter, wtf,"}, {"id": 211, "start": 1015.0, "end": 1024.52, "text": "das ist von, das ist von 2005 oder was auch immer, äh, krasser Scheiß, komm mal 52"}, {"id": 212, "start": 1024.52, "end": 1029.16, "text": "Splagen Lull, nein nein, ich will mich gar nicht spoilern lassen, ich will mich gar nicht"}, {"id": 213, "start": 1029.16, "end": 1037.44, "text": "spoilern lassen, wir machen das jetzt neu, so, alter, zack, also was brauchen wir denn,"}, {"id": 214, "start": 1037.44, "end": 1048.96, "text": "wir brauchen jede Menge, jede Menge Sonnenblumenstells brauchen wir, wir brauchen Lillipads, wie"}, {"id": 215, "start": 1048.96, "end": 1057.96, "text": "heißt das auf deutsch, äh, Seerosen oder so, ähm, Kürbis und Pilzstells, ok, so das"}, {"id": 216, "start": 1057.96, "end": 1065.24, "text": "heißt also wir brauchen Kürbis, wir brauchen Seerosenplätter, dann brauchen wir die Pilze"}, {"id": 217, "start": 1065.24, "end": 1078.84, "text": "und die Kaffeebohne, dass man die aufwecken kann, ähm, Knoblauch braucht man glaube"}, {"id": 218, "start": 1078.84, "end": 1090.2, "text": "ich am Anfang noch, Knoblauchstells, genau, ähm, das war's, ok, das ist die erste Runde,"}, {"id": 219, "start": 1090.2, "end": 1097.72, "text": "da brauchen wir auf jeden Fall noch Kartoffelmine und Splash, Smash, was auch immer, ja und"}, {"id": 220, "start": 1097.72, "end": 1101.08, "text": "als letztes ist eigentlich, ist eigentlich wurscht, vielleicht haben wir genug, vielleicht"}, {"id": 221, "start": 1101.08, "end": 1109.4, "text": "haben wir genug, um schon die Kanonen aufzubauen am Anfang, schauen wir mal, los geht's, das"}, {"id": 222, "start": 1109.4, "end": 1114.04, "text": "Game ist sehr verpixelt, ja, ach so, mal gucken, wartet mal, es gibt zwei, es gibt"}, {"id": 223, "start": 1114.04, "end": 1123.16, "text": "zwei Varianten, man kann so machen, dann sieht es ein bisschen, oh, ist jetzt nicht wirklich"}, {"id": 224, "start": 1123.16, "end": 1131.88, "text": "besser oder, seht ihr überhaupt was, wait a minute, äh, ein bisschen klein oder, wait,"}, {"id": 225, "start": 1131.88, "end": 1140.96, "text": "warte mal, das ist irgendwie ein bisschen kaputt, Moment, Moment, wartet, wartet, ich"}, {"id": 226, "start": 1140.96, "end": 1149.12, "text": "hab ne Idee, ich hab ne Idee, mal gucken, ob das jetzt wieder größer wird, jetzt wieder"}, {"id": 227, "start": 1149.12, "end": 1158.72, "text": "größer, ok, wait, ne, ok, jetzt hab ich Vollbild ausgemacht, Vollbild, so, jetzt haben wir"}, {"id": 228, "start": 1158.72, "end": 1166.24, "text": "es im Fenster, jetzt haben wir es im Fenster, kann man das Fenster resizeen, what the, ne,"}, {"id": 229, "start": 1166.24, "end": 1171.04, "text": "Fenster resizeen geht nicht, ok, das sackt, also ich muss drei Drehbeschleunigungen Vollbild"}, {"id": 230, "start": 1171.04, "end": 1179.4, "text": "machen, das funktioniert sonst nicht anders, das funktioniert nicht anders, so, jetzt müsste"}, {"id": 231, "start": 1179.4, "end": 1189.04, "text": "Vollbild sein, ihr müsst es auch wieder sehen, ne, ja, ok, zack, jetzt muss man uns sputen,"}, {"id": 232, "start": 1189.04, "end": 1200.04, "text": "so, setzten wir jetzt hier schon platt, ne, wir warten noch, wir warten noch, ich werde"}, {"id": 233, "start": 1200.04, "end": 1208.72, "text": "es jetzt wahrscheinlich mega verkacken, das sage ich euch gleich, Dankeschön für den"}, {"id": 234, "start": 1208.72, "end": 1214.2, "text": "Sub, oder ne, was war das, aber zumindest haben wir den, haben wir den Hype-Train geschafft,"}, {"id": 235, "start": 1214.2, "end": 1223.32, "text": "huge Hype, Tim Apple wäre stolz auf uns, oh, jetzt kommt er in der gleichen Lane noch"}, {"id": 236, "start": 1223.32, "end": 1237.2, "text": "mal, zack, ähm, noch mal hier hin, so, wir müssen ganz, ganz viele, guck mal, wir müssen"}, {"id": 237, "start": 1237.2, "end": 1245.56, "text": "ganz ultra viele Sonnenblumen bauen und dann am Anfang hier so ne Reihe aus Pilzen, wie"}, {"id": 238, "start": 1245.56, "end": 1249.44, "text": "viel APM, das werden wir gleich sehen, wenn es ein bisschen schwieriger wird, insane movements,"}, {"id": 239, "start": 1249.44, "end": 1254.28, "text": "so ist das geil, Green Style, 6 Monate, Dankeschön für den Sub, so, das heißt wir brauchen"}, {"id": 240, "start": 1254.28, "end": 1261.16, "text": "die ersten, wieviel die ersten, 1, 2, 3, 4, 8, also die ersten 4 brauchen wir Äh, Blätter"}, {"id": 241, "start": 1261.16, "end": 1270.36, "text": "und Kürbis und in den ersten 3 Pilze und obendings brauchen wir dann Knoblauch, alles klar,"}, {"id": 242, "start": 1270.36, "end": 1282.16, "text": "exellent, so machen wir das, also, machen wir da, weiß ich, ich glaube ich sollte lieber,"}, {"id": 243, "start": 1282.16, "end": 1289.08, "text": "ich sollte lieber erst, ähm, Blätter, Blätter bauen, ne, Blätter und Sonnenblumen, so den"}, {"id": 244, "start": 1289.08, "end": 1295.16, "text": "er unten kriegen will, locker, gar kein Problem, ich muss jetzt erstmal aufrüsten, ich muss"}, {"id": 245, "start": 1295.16, "end": 1301.72, "text": "jetzt erstmal aufrüsten an Sonnenblumen, Cattails sind OP, ja, aber da kriege ich das"}, {"id": 246, "start": 1301.72, "end": 1309.16, "text": "andere Bild nicht mehr hin, ich glaube ich sollte erst Sonnenblumen bauen, bevor ich"}, {"id": 247, "start": 1309.16, "end": 1322.16, "text": "den Kram hier mache, Moment, ich brauche, oh fuck, ich brauche ja 150 für den anderen"}, {"id": 248, "start": 1322.16, "end": 1331.96, "text": "Pilz, MonkaS, Ripper, das reicht nicht den zu killen, ne, ne, ich muss erst, ich muss"}, {"id": 249, "start": 1331.96, "end": 1344.24, "text": "erst Sonnenkram aufrüsten, ah, ah, oh, geil, das Ding ist ja richtig OP, OP as fuck, das"}, {"id": 250, "start": 1344.24, "end": 1348.44, "text": "ist ja, das ist ja wahnsinnig OP das Teil, guckt euch das mal ab, guckt, das hat, das"}, {"id": 251, "start": 1348.44, "end": 1366.12, "text": "hat ihn ja geschreckt, geschreckt Sonnensgleichen, hoffentlich reicht das noch, ja, das sollte"}, {"id": 252, "start": 1366.12, "end": 1378.28, "text": "noch reichen, 200 kostet der, oh nice, nice Timing, 200 kostet das jetzt schon, ok, ach"}, {"id": 253, "start": 1378.28, "end": 1383.96, "text": "guck mal, das wird immer, das wird immer teurer, weiss ich gar nicht mehr, nice, guck mal,"}, {"id": 254, "start": 1383.96, "end": 1389.0, "text": "jetzt sind wir doch erstmal schon mal safe, gegen die ersten paar, wir müssen hier alles,"}, {"id": 255, "start": 1389.0, "end": 1396.36, "text": "wir müssen hier alles zu klatschen, Sonnenblumen, nehmen die eigentlich die fetten Sonnenblumen"}, {"id": 256, "start": 1396.36, "end": 1405.32, "text": "dann, ne, hä, warum nehmen die nicht die teuren Sonnenblumen, Anno, Anno habe ich sogar 1602"}, {"id": 257, "start": 1405.32, "end": 1416.44, "text": "viel gespielt damals, ja, ach hier machen die das dann, ok, Hintergrundaufnahme fürs"}, {"id": 258, "start": 1416.44, "end": 1424.72, "text": "nächste YouTube Video, so die werden jetzt gebashed, oh zack, so jetzt müssen wir gucken,"}, {"id": 259, "start": 1424.72, "end": 1429.4, "text": "dass wir nebenbei aus, oh ne, das war jetzt kacke, das war jetzt dumm, das war jetzt richtig"}, {"id": 260, "start": 1429.4, "end": 1434.88, "text": "dumm gesetzt, den müssen wir jetzt, den müssen wir jetzt chompern oder wie auch immer man"}, {"id": 261, "start": 1434.88, "end": 1451.64, "text": "das, bent, zack, immer schön upgraden, der ist noch nicht wieder ready, pranks, die bauen"}, {"id": 262, "start": 1451.64, "end": 1460.4, "text": "doppelt garlic, glaube, naja gut, der wird jetzt gekillt, das ist gar kein Ding, komm"}, {"id": 263, "start": 1460.4, "end": 1465.04, "text": "mal hier oben hin, dass wir zwei Stück haben, jetzt upgraden wir den, hier machen wir so"}, {"id": 264, "start": 1465.04, "end": 1474.32, "text": "ein Teil hin, den Pilz rein, auf, weg hin, pranks, Lel, hast du das Spiel nicht mittlerweile"}, {"id": 265, "start": 1474.32, "end": 1479.68, "text": "mal durchgezockt, ne, das ist endless, das ist endless mode, da ist nichts mit durchspielen,"}, {"id": 266, "start": 1479.68, "end": 1494.84, "text": "erst, erste massive wave, gut, das ist easy, das kriegen wir hin, die Sounds, Alter, pranks,"}, {"id": 267, "start": 1494.84, "end": 1504.36, "text": "pranks, so, jetzt können wir einen neuen Kürbis setzen, da vorne, ah, da soll er mal weiter,"}, {"id": 268, "start": 1504.36, "end": 1520.56, "text": "weiter dran rumkauen, so, zack, zack, zack, zack, zack, zack, so, jetzt haben wir hier"}, {"id": 269, "start": 1520.56, "end": 1538.16, "text": "vorne welche, ich weiß nicht, ob ich nicht, oh fuck, was, what the, da wollte ich dir"}, {"id": 270, "start": 1538.16, "end": 1539.72, "text": "sagen, Boomer-Reflexe, ich hoffe, ich baue das, by the way, ich hoffe, ich baue das irgendwie"}, {"id": 271, "start": 1539.72, "end": 1550.16, "text": "richtig, ok, jetzt können wir den nächsten upgraden gleich, das da, das da, das da,"}, {"id": 272, "start": 1550.16, "end": 1558.08, "text": "so, gut, immer mehr Blumen, weil wir müssen, wir brauchen gleich sau viel Kohle, wir müssen"}, {"id": 273, "start": 1558.08, "end": 1567.0, "text": "gleich die ganzen Korn, die ganzen Kanonen bauen, oh, oh, gehst du kaputt, gehst, gehst"}, {"id": 274, "start": 1567.0, "end": 1589.56, "text": "du, oh, knapp, so, so, stimmt das, was ich hier baue, ok, ich brauche vier, vier Dinger"}, {"id": 275, "start": 1589.56, "end": 1603.0, "text": "hier vorne, alles klar, machen wir, ich sagte schon so lange her, so, den hier muss man"}, {"id": 276, "start": 1603.0, "end": 1611.8, "text": "noch vollbauen, hier vorne noch Blätter hin, ein Pilz schläft noch, ah ja, stimmt,"}, {"id": 277, "start": 1611.8, "end": 1618.92, "text": "lull, ok, ich sehe jetzt schon, das geht auf den Finger mit dem Geklicke, auf der Xbox"}, {"id": 278, "start": 1618.92, "end": 1626.72, "text": "konnte man einfach den Cursor vorbei bewegen und gut war, so, das Refreshen wir mal das"}, {"id": 279, "start": 1626.72, "end": 1636.88, "text": "Teil, so, ok, zweite Flag, jetzt brauchen wir hier, jetzt müssen wir schnell, ja, ey,"}, {"id": 280, "start": 1636.88, "end": 1641.16, "text": "super Timing, huge, passt ja wunderbar, die kommen jetzt überhaupt nicht hier dran vorbei,"}, {"id": 281, "start": 1641.16, "end": 1648.92, "text": "guck hier, schreckt werden sie, richtig geschreckt, so, hier kann ich schon Korns hinbauen oder,"}, {"id": 282, "start": 1648.92, "end": 1657.32, "text": "kann ich hier schon Korns hinbauen, ich brauche Korns da, eins, zwei, drei und danach dann"}, {"id": 283, "start": 1657.32, "end": 1668.0, "text": "die Kanonen, können wir im Endeffekt schon machen denke ich mal, alles sammeln, alles"}, {"id": 284, "start": 1668.0, "end": 1676.36, "text": "sammeln, alles sammeln, BÄM, high APM, so, was brauchen wir denn jetzt, also, wir haben"}, {"id": 285, "start": 1676.36, "end": 1680.84, "text": "jetzt komische Springer, Zombies, das ist jetzt aber nicht schlimm, die werden alle"}, {"id": 286, "start": 1680.84, "end": 1687.88, "text": "gekillt, also ich kann jetzt schon, ich kann jetzt, ok, hier muss ich dann noch vollbauen"}, {"id": 287, "start": 1687.88, "end": 1691.68, "text": "mit Sonnenblumen und hier, dann kann ich eigentlich schon anfangen Kanonen zu bauen würde ich"}, {"id": 288, "start": 1691.68, "end": 1699.68, "text": "sagen, ja, und was ist als nächstes, Kanonen, dann brauchen wir noch ganz viel, ah, und"}, {"id": 289, "start": 1699.68, "end": 1703.72, "text": "dann brauchen wir noch ganz viele Kürbis, ok, das machen wir zuerst, Melonen und Kürbis"}, {"id": 290, "start": 1703.72, "end": 1710.76, "text": "brauchen wir noch, also, brauch ich noch Seerosen, nein, brauch ich nicht, sehr gut, kann ich"}, {"id": 291, "start": 1710.76, "end": 1716.88, "text": "weglassen, dann kopieren wir uns erstmal den Kürbis, dass wir zweimal Kürbisse bauen"}, {"id": 292, "start": 1716.88, "end": 1723.28, "text": "können, der weiße Kürbis kopiert der Kürbis, den baue ich jetzt auch, es gibt so eine Pflanze,"}, {"id": 293, "start": 1723.28, "end": 1731.08, "text": "die kann alles kopieren, so, dann brauchen wir, wir brauchen keine Pilze mehr, die Pilze"}, {"id": 294, "start": 1731.08, "end": 1736.36, "text": "stehen, jetzt können wir die Kanonen erstmal aufbauen, also das da, dann brauchen wir"}, {"id": 295, "start": 1736.36, "end": 1740.24, "text": "die Maiskanone, wir brauchen auf jeden Fall Sonnenblumen, dann habe ich gesehen, die benutzen"}, {"id": 296, "start": 1740.24, "end": 1751.68, "text": "hier in der Mitte die großen Sonnenblumen, die können wir eigentlich auch schon mit reinpacken,"}, {"id": 297, "start": 1751.68, "end": 1759.64, "text": "so, jetzt ist los die Frage, brauche ich irgendwie noch so ein Notfallding, erstmal nicht, so"}, {"id": 298, "start": 1759.64, "end": 1771.4, "text": "und dann machen die hier vorne noch Stachel hin, so, was brauche ich denn sonst noch,"}, {"id": 299, "start": 1771.4, "end": 1778.44, "text": "wobei, ich brauche noch Pilze, ich muss den Pilz gerade mitnehmen, nein, Melonen, Melonen"}, {"id": 300, "start": 1778.44, "end": 1783.0, "text": "und Eismelonen brauche ich noch, das passt doch, das mit den Pilzställs mache ich danach,"}, {"id": 301, "start": 1783.0, "end": 1785.72, "text": "mal gucken, ob das so hinhaut, wie ich mir das vorgestellt habe."}, {"id": 302, "start": 1785.72, "end": 1797.2, "text": "So, hier kommt jetzt rein, hier kommt die erste Kanone hin, Moment, das stimmt doch nicht,"}, {"id": 303, "start": 1797.2, "end": 1798.2, "text": "was ich gebaut habe, oder?"}, {"id": 304, "start": 1798.2, "end": 1806.24, "text": "Ne, doch, doch, ist richtig, hier kommt Stachel hin, doch, ne, ne, das ist ok, das ist alles"}, {"id": 305, "start": 1806.24, "end": 1816.2, "text": "gut, alles gut, passt, hier kommt Stachel hin, ne, doch, passt, passt, alles gut, alles"}, {"id": 306, "start": 1816.2, "end": 1817.2, "text": "gut."}, {"id": 307, "start": 1817.2, "end": 1826.48, "text": "Boah, äh ja, da kommst du ja mit dem Geklicke-Gun immer hinterher, Monkeys, äh, 300 APM, das"}, {"id": 308, "start": 1826.48, "end": 1837.08, "text": "ist ja hier fast wie Starcraft, ok, ähm, Zack, wo müssen, wo müssen die komischen Melonen"}, {"id": 309, "start": 1837.08, "end": 1838.08, "text": "hin?"}, {"id": 310, "start": 1838.08, "end": 1862.2, "text": "Äh, unten, eins frei, unten, unten, ok, also Melone, da, da, da und da, 1, 2, 3, genau,"}, {"id": 311, "start": 1862.2, "end": 1871.2, "text": "so, kann, äh, Kanone, jawoll, ok, das wird anstrengend, fuck, du brauchst 30 Milliarden"}, {"id": 312, "start": 1871.2, "end": 1877.44, "text": "APM, Monkeys, Alter, das kann meine, das, das, das, das, das macht meine Hand ja nicht"}, {"id": 313, "start": 1877.44, "end": 1903.24, "text": "mit, äh, 50, 50 Milliarden APM, guckt euch das mal an, äh, 0W, so, nächste Melone, dann"}, {"id": 314, "start": 1903.24, "end": 1909.64, "text": "kommt hier oben noch ein Korb hin, da kommt noch eine Sonnenblume drauf, so, und hier"}, {"id": 315, "start": 1909.64, "end": 1915.0, "text": "in der Mitte, hier in der Mitte kommt auch alles voller Kanone, ne, genau, halber Starcraft-D-Spot"}, {"id": 316, "start": 1915.0, "end": 1917.72, "text": "ja ohne Scheiß, hätte ich gar nicht gedacht, das kann ich mich gar nicht mehr dran erinnern,"}, {"id": 317, "start": 1917.72, "end": 1925.32, "text": "dass es so anstrengend ist, so, jetzt machen wir hier noch Cannon, jetzt können wir hier"}, {"id": 318, "start": 1925.32, "end": 1932.24, "text": "schon Bam machen, guck mal, in your face, wo kommen denn noch welche hin, hier, hier"}, {"id": 319, "start": 1932.24, "end": 1949.0, "text": "kommen noch welche hin, der hüpft einfach drüber, Anzeige ist raus, ok, ähm, das,"}, {"id": 320, "start": 1949.0, "end": 1959.16, "text": "das, ok, perfekt, ich muss aufpassen, wenn hier einer springt, hab ich Pech, so, erstmal"}, {"id": 321, "start": 1959.16, "end": 1974.84, "text": "alles einsammeln, äh, jetzt, da, Finger überhitzen gleich, MonkaS, ah, hier Kanone, ich muss"}, {"id": 322, "start": 1974.84, "end": 1980.84, "text": "jetzt erstmal Kanonen aufbauen, ok, das ist tatsächlich deutlich anstrengend, als ich"}, {"id": 323, "start": 1980.84, "end": 1991.76, "text": "diese Erinnerung hab, wir können jetzt hier schon Cannon Bash machen, alles gut, next,"}, {"id": 324, "start": 1991.76, "end": 1999.92, "text": "den Garlic brauch ich jetzt eigentlich fast schon gar nicht mehr, hier upgraden, Sonnenblumensteher,"}, {"id": 325, "start": 1999.92, "end": 2011.76, "text": "Upgrade, so, Körbe, so, das passt alles, so, wo muss die nächste, wo muss die nächste"}, {"id": 326, "start": 2011.76, "end": 2017.12, "text": "Melone hin, da, da, oder, ja, ich hab leider noch keine Pilze dabei, sonst hätte ich das"}, {"id": 327, "start": 2017.12, "end": 2026.32, "text": "gleich machen können, wir machen erstmal, bevor wir die Melonen machen, machen wir erstmal"}, {"id": 328, "start": 2026.32, "end": 2032.92, "text": "die Kanonen fertig, wir haben in jeder Lane, warte mal, diese Lane muss da noch ne Eismelone,"}, {"id": 329, "start": 2032.92, "end": 2048.76, "text": "da machen wir hier, ist das richtig gemacht, ja, ja, ah, passt, Guide, so, next up, Kalapult"}, {"id": 330, "start": 2048.76, "end": 2065.32, "text": "ist da, bäm, hat schon mal weggeballert jetzt, Zeit, muss alles ausgenutzt werden, ok, also"}, {"id": 331, "start": 2065.32, "end": 2068.64, "text": "wir brauchen jetzt auf jeden Fall noch ein paar Sonnen, ne, wir brauchen keine Sonnenblumen"}, {"id": 332, "start": 2068.64, "end": 2073.16, "text": "mehr, wir haben alles an Sonnenblumen gesonnen, gesonnenblumt, was wir brauchen, wunderbar,"}, {"id": 333, "start": 2073.16, "end": 2077.52, "text": "wir brauchen auch eine Reihe davon, das da brauchen wir, dann brauchen wir kopierte,"}, {"id": 334, "start": 2077.52, "end": 2094.96, "text": "kopierte Körbe, oder, was ist das, Kürbis, Kürbis, Imitator Kürbis, melone und Maiskanone"}, {"id": 335, "start": 2094.96, "end": 2099.24, "text": "und dann können wir jetzt eigentlich schon mit Pilzen anfangen, also den da, den da"}, {"id": 336, "start": 2099.24, "end": 2104.6, "text": "und den da, dann kommt mal wieder ein Coding Stream, wenn ich irgendwas hab, was ich programmieren"}, {"id": 337, "start": 2104.6, "end": 2110.8, "text": "will, so, wir können das jetzt auch in Ruhe bauen, wir haben noch keine Zombies, die Pflanzen"}, {"id": 338, "start": 2110.8, "end": 2120.8, "text": "von oben klauen, das passt, so, zack, so jetzt ist der Garlic, jetzt ist egal, ob der kaputt"}, {"id": 339, "start": 2120.8, "end": 2135.2, "text": "geht oder nicht, jetzt egal, ok, jetzt ist gar kein Problem, ob jetzt der Garlic, also"}, {"id": 340, "start": 2135.2, "end": 2142.12, "text": "ob der Knoblauch da ist oder nicht, ist jetzt egal, so jetzt können wir schon weitere Melonen"}, {"id": 341, "start": 2142.12, "end": 2151.92, "text": "bauen, da muss eine hin, da muss eine Melone hin, ich lass die mal hier ein bisschen langsamer,"}, {"id": 342, "start": 2151.92, "end": 2156.64, "text": "dass ich Zeit hab, so, da muss eine Melone hin, hier muss jetzt eine Kanone oben hin,"}, {"id": 343, "start": 2156.64, "end": 2163.12, "text": "meine Güte, ist ja fast hier halbe Starcraft, so, dann brauchen wir ganz viele, die letzte"}, {"id": 344, "start": 2163.12, "end": 2173.36, "text": "Reihe muss erstmal geschützt werden, falls irgendwelche Buddle Zombies kommen, so, halber"}, {"id": 345, "start": 2173.36, "end": 2180.56, "text": "Pool Stream, ja, schon, true, 0W, so, machen wir die mal platt, dass meine Kürbisse nicht"}, {"id": 346, "start": 2180.56, "end": 2188.56, "text": "kaputt gehen, so, als nächstes müssen wir erstmal ein bisschen Sonne sammeln, noch"}, {"id": 347, "start": 2188.56, "end": 2196.64, "text": "würde ich sagen, erst ein bisschen Sonne sammeln, den hier können wir schon mal drüber"}, {"id": 348, "start": 2196.64, "end": 2208.48, "text": "pflanzen, so, nächste Kanone bauen, nächste Kanone, das ist gut, das ist gut, wenn die"}, {"id": 349, "start": 2208.48, "end": 2215.6, "text": "sich selbst ein bisschen stallen hier, so, so, wir brauchen auf jeden Fall Pilze gegen"}, {"id": 350, "start": 2215.6, "end": 2219.64, "text": "die, gegen die Dinger, es gibt ja diese fetten Zombies, die kleine Zombies werfen und da"}, {"id": 351, "start": 2219.64, "end": 2223.88, "text": "brauchen wir auf jeden Fall die Pilze hier hinten, aber erstmal, wir machen jetzt erstmal"}, {"id": 352, "start": 2223.88, "end": 2228.28, "text": "das Setup komplett, wir machen jetzt erstmal das Setup komplett mit den Kanonen, weil dann"}, {"id": 353, "start": 2228.28, "end": 2240.0, "text": "können wir alles bashen, easy, easy clap, so, ah, Melonen muss ich bauen, seck, Melonen"}, {"id": 354, "start": 2240.0, "end": 2254.92, "text": "muss ich da hin, ne, da, oder, ja, ich brauch auf jeden Fall noch ein bisschen Geld, ach,"}, {"id": 355, "start": 2254.92, "end": 2261.44, "text": "das kriegt meine Defense auch so hin, so, nächste Maiskanone, 800, ok, das wird, das"}, {"id": 356, "start": 2261.44, "end": 2268.76, "text": "wird teuer, jetzt muss ich, ich muss ein bisschen sammeln, ich muss ein bisschen, ein bisschen"}, {"id": 357, "start": 2268.76, "end": 2272.68, "text": "Sonne sammeln, dass das klappt, der andere Seite, ich muss eigentlich auch meine Sachen"}, {"id": 358, "start": 2272.68, "end": 2291.52, "text": "protekten, so, bauen wir gleich die nächste Kanone bei 800, da gleich soweit, jetzt sofort,"}, {"id": 359, "start": 2291.52, "end": 2299.08, "text": "ich rampe da einfach drüber, so, nächste Kanone am Start, Geld kann ich nachher sammeln,"}, {"id": 360, "start": 2299.08, "end": 2315.52, "text": "jetzt erstmal aufbauen, bam, bababam, so, letzte Welle, ähm, ich muss unbedingt die"}, {"id": 361, "start": 2315.52, "end": 2325.52, "text": "Pilze bauen, zum Defenden, Garlic ist RIP, den brauchen wir jetzt aber nicht mehr, weil"}, {"id": 362, "start": 2325.52, "end": 2330.44, "text": "jetzt hab ich die Cannons am Start, eine Kanone brauch ich noch, die können wir eigentlich"}, {"id": 363, "start": 2330.44, "end": 2334.52, "text": "jetzt schon, ah, Mist, hätt ich die jetzt mal schnell geplant, da hätt ich sie nicht"}, {"id": 364, "start": 2334.52, "end": 2341.72, "text": "mal mitnehmen müssen, na gut, ok, also wir brauchen auf jeden Fall noch einmal das und"}, {"id": 365, "start": 2341.72, "end": 2348.44, "text": "die Kanone, so, den Kram, brauchen wir bis, bis jedes Ding, es braucht jedes Feld braucht"}, {"id": 366, "start": 2348.44, "end": 2358.12, "text": "ein Kürbis, so, und jetzt diese Runde müssen wir auf jeden Fall anfangen die Pilze zu bauen,"}, {"id": 367, "start": 2358.12, "end": 2368.84, "text": "also brauchen wir das und das, so vorne, vorne den Boden haben wir gebaut, was fehlt denn"}, {"id": 368, "start": 2368.84, "end": 2374.96, "text": "jetzt eigentlich noch, es fehlen jetzt noch Pilze und es fehlen, ah Melonen, Melonenstelz"}, {"id": 369, "start": 2374.96, "end": 2386.06, "text": "fehlt noch, ups, fuck, Melonenstelz fehlt noch, also zack, Melone und als letztes brauchen"}, {"id": 370, "start": 2386.06, "end": 2392.52, "text": "wir jetzt noch das Teil, wo ist das, das Schirm, das Schirm brauchen wir noch, hier brauchen"}, {"id": 371, "start": 2392.52, "end": 2399.36, "text": "wir noch ein Schirm, Schirm, Pilz, Pilz, Pilz, ok, also von der Idee her ist es eigentlich"}, {"id": 372, "start": 2399.36, "end": 2407.04, "text": "easy jetzt, wir bauen alle Melonen fertig, machen Eismelone draus und hier machen wir"}, {"id": 373, "start": 2407.04, "end": 2415.36, "text": "Pilze hin in die Reihe, da müssen wir aber noch ein bisschen Sonne bauen, so weg damit,"}, {"id": 374, "start": 2415.36, "end": 2420.44, "text": "ne den hätt ich da lassen sollen, ich hab noch gar nicht genug Geld, guck mal, jetzt"}, {"id": 375, "start": 2420.44, "end": 2425.72, "text": "sammel ich, jetzt sammel ich langsamer, jetzt weiß ich auch warum die am Anfang alle in"}, {"id": 376, "start": 2425.72, "end": 2430.32, "text": "diesen Guides immer so viel Sonnenkram spammen, du hast sonst einfach schlicht und ergreifend"}, {"id": 377, "start": 2430.32, "end": 2438.88, "text": "nicht genug, so und ich schieß jetzt absichtlich nicht auf die Zombies, ich bau jetzt erst"}, {"id": 378, "start": 2438.88, "end": 2447.64, "text": "noch mal meine Kanone, so fertig, so jetzt haben wir das Cannon Setup, weil die sollen"}, {"id": 379, "start": 2447.64, "end": 2455.2, "text": "ein bisschen langsamer gehen, wenn ich die jetzt kille mit meinem, mit dem Eis dann spawnen"}, {"id": 380, "start": 2455.2, "end": 2459.08, "text": "die so schnell, aber manchmal muss ich sie killen, ja jetzt hab ich, jetzt bleibt mir"}, {"id": 381, "start": 2459.08, "end": 2479.72, "text": "alles übrig, so, ok, GARLIC GRIP, oh, oh, oh, nein, nein, nein, ihr esst es nicht, ihr"}, {"id": 382, "start": 2479.72, "end": 2494.84, "text": "esst es, oh, bisschen zu spät, so, ich hab, warte mal, ich brauch noch hier, hier brauch"}, {"id": 383, "start": 2494.84, "end": 2502.48, "text": "ich noch eine Melone, ne, das war's dann, hier ist noch eine, eine Melone, easy, oh,"}, {"id": 384, "start": 2502.48, "end": 2513.4, "text": "oh, MonkaS, ok, jetzt hab ich das komplette Setup fertig, jetzt fehlen mir hier nur noch"}, {"id": 385, "start": 2513.4, "end": 2520.08, "text": "die Pilzreihe, ne, Pilzreihe und Schirm, das Blatt, das Blatt kann ich aber immer noch"}, {"id": 386, "start": 2520.08, "end": 2534.0, "text": "planten, sobald ich Fallschirms, Bungie Zombies krieg, jetzt erst mal Defenden, so und hier"}, {"id": 387, "start": 2534.0, "end": 2538.6, "text": "muss ein Pilz hin, ne, seh ich richtig, hier muss ein Pilz hin, genau, die Reihe muss"}, {"id": 388, "start": 2538.6, "end": 2551.72, "text": "komplett noch verpilzt werden, ich hab zu wenig Sonne, müssen wir mal schauen, was"}, {"id": 389, "start": 2551.72, "end": 2556.88, "text": "als nächstes kommt, nicht, dass die uns gleich schrecken, aber das, die ersten Wellen"}, {"id": 390, "start": 2556.88, "end": 2562.16, "text": "sind easy mit den, mit den, mit den Maiskanonen, ist überhaupt kein Problem, oh, was mach"}, {"id": 391, "start": 2562.16, "end": 2576.0, "text": "ich denn da, also mein Rekord ist 52 Runden, vielleicht schaffen wir das heute, ja, ok,"}, {"id": 392, "start": 2576.0, "end": 2581.4, "text": "jetzt brauchen wir da noch was und da noch was und den dahin, jawoll, sieht gut aus,"}, {"id": 393, "start": 2581.4, "end": 2590.4, "text": "sieht gut aus, es wär natürlich cool, wenn das ein bisschen langsamer ging, dass ich"}, {"id": 394, "start": 2590.4, "end": 2605.44, "text": "mehr Zeit hab, Sonne zu sammeln, oh, Massive, Massive Money, neues iPhone ist raus, so,"}, {"id": 395, "start": 2605.44, "end": 2610.76, "text": "ok, ich muss diese Reihe, muss ich verpilzen, aber das sammel ich jetzt erst mal ein bisschen"}, {"id": 396, "start": 2610.76, "end": 2622.4, "text": "Sonne, der nächste kostet ja 500, ha, ha, ha, ha, ich hab nicht aufgepasst, fuck, ha,"}, {"id": 397, "start": 2622.4, "end": 2633.84, "text": "nein, nein, null, keck wait, ich hab nicht aufgepasst, ok, das könnt jetzt nach hinten"}, {"id": 398, "start": 2633.84, "end": 2641.2, "text": "losgehen, weil das Ding kostet 850, alter, fuck, jetzt ist wieder mal ganzes Geld weg,"}, {"id": 399, "start": 2641.2, "end": 2651.56, "text": "shit, hab ich verkackt, siehste, zu viel Chat geguckt, damn, Chat ist schuld, wie immer,"}, {"id": 400, "start": 2651.56, "end": 2657.52, "text": "ok, aber Kanonen sind jetzt schon mal fertig, also ich brauch Pilze, 1000 Sonne in Sand"}, {"id": 401, "start": 2657.52, "end": 2662.68, "text": "gesetzt, ja, ok, das ist easy, das ist easy hier, die kriegt man, die kriegt man einfach,"}, {"id": 402, "start": 2662.68, "end": 2669.32, "text": "so, also, ich brauch den Pilz, den Pilz, die Bohne, davon brauchen wir noch, geh ich mal"}, {"id": 403, "start": 2669.32, "end": 2673.16, "text": "von aus, brauchen wir noch beide, nee, nicht wirklich, einmal brauchen wir den Kram hier"}, {"id": 404, "start": 2673.16, "end": 2681.24, "text": "noch, das ist ok, da brauch ich keinen, keinen geklonten Kürbis, wir können aber den Einfrierpilz"}, {"id": 405, "start": 2681.24, "end": 2690.04, "text": "nehmen, der ist immer praktisch, so, dann brauchen wir noch die, den Schirm und ich glaub noch"}, {"id": 406, "start": 2690.04, "end": 2694.04, "text": "die, noch ne, noch ne Eismelone, Melonen haben wir jetzt alle, wir müssen eigentlich nur"}, {"id": 407, "start": 2694.04, "end": 2701.52, "text": "noch das hier jetzt mit Pilzen machen, eigentlich nur noch den hier mit Pilzen und hier und,"}, {"id": 408, "start": 2701.52, "end": 2707.76, "text": "warte mal, den hier mit Pilzen, hier und hier mit Schirm und der Rest Eismelone, ok, alles"}, {"id": 409, "start": 2707.76, "end": 2713.52, "text": "klar, machen wir, easy as fuck, sowas nehm ich da jetzt noch mit, brauch ich da jetzt"}, {"id": 410, "start": 2713.52, "end": 2721.96, "text": "noch irgendwas gescheit, eigentlich, hab ich was, ah Moment, hab ich die Sonne, Sonnen"}, {"id": 411, "start": 2721.96, "end": 2729.76, "text": "schon abgecreated alle, ja, wie alt ist das Game, ich glaub von 2007 oder so, oh ich hoffe"}, {"id": 412, "start": 2729.76, "end": 2740.8, "text": "ich hab nix vergessen, Schirm, Dings und Pilz, nee eigentlich nicht, bisschen kacke da ich"}, {"id": 413, "start": 2740.8, "end": 2747.48, "text": "jetzt 1000 Sonne in den Sand gesetzt hab, aber shit, shit happens, dafür sind die Zombies"}, {"id": 414, "start": 2747.48, "end": 2760.88, "text": "jetzt einfach, so als nächstes kommt hier hin, dann könnt ihr nämlich hier was hinwerfen"}, {"id": 415, "start": 2760.88, "end": 2770.6, "text": "und ich kann auf jeden Fall hier defenden und hier defenden, easy, dazu kann ich nur"}, {"id": 416, "start": 2770.6, "end": 2785.08, "text": "sagen, easy, gar kein Problem, 100, 100 Flaggen, easy, kein, heute, world record, ich sag's"}, {"id": 417, "start": 2785.08, "end": 2795.04, "text": "euch, world record, was haben wir hier, Eismelonen brauchen wir, alles, das ist jetzt einfach,"}, {"id": 418, "start": 2795.04, "end": 2803.96, "text": "das muss einfach alles ne Eismelone werden, ich mach jetzt absichtlich nix, weil umso"}, {"id": 419, "start": 2803.96, "end": 2809.04, "text": "langsamer die Zombies sind, umso mehr Zeit hab ich Zeug zu sammeln und ich brauch noch,"}, {"id": 420, "start": 2809.04, "end": 2815.28, "text": "ich brauch ordentlich noch Sonne und ich hab kaum noch was, dass meine defense reicht"}, {"id": 421, "start": 2815.28, "end": 2823.64, "text": "komplett gegen die Crap Zombies, das geht schon als Retro Tour, ich guck mal wie pixelig"}, {"id": 422, "start": 2823.64, "end": 2828.92, "text": "das ist und 4 zu 3, das Game ist nur 4 zu 3, wenn das nicht Retro ist dann, dann weiß"}, {"id": 423, "start": 2828.92, "end": 2840.6, "text": "ich ja auch nicht, jaja Boomer Aufmerksamkeit Leute, ich weiß, übrigens wenn ihr irgendwelche"}, {"id": 424, "start": 2840.6, "end": 2843.76, "text": "Fragen habt oder so, jetzt nicht unbedingt zu dem Game, zu allgemein, könnt ihr in Chat"}, {"id": 425, "start": 2843.76, "end": 2847.48, "text": "gucken, ich guck ab und zu mal nach, nach ein paar Runden guck ich, guck ich da noch"}, {"id": 426, "start": 2847.48, "end": 2853.84, "text": "mal Chat, ich guck hier nebenbei immer noch, guck hier nebenbei immer noch Chat, ich denke"}, {"id": 427, "start": 2853.84, "end": 2858.16, "text": "mal, dass es nachher ein bisschen entspannter wird, wenn ich alles aufgebaut hab und einfach"}, {"id": 428, "start": 2858.16, "end": 2871.88, "text": "nur sinnlos, sinnlos wegbomben kann alles, neue Melone, passt doch eigentlich, so wir"}, {"id": 429, "start": 2871.88, "end": 2876.32, "text": "brauchen noch ein paar Pilze, Pilze dahin, wir machen jetzt erstmal, machen wir die Blätter"}, {"id": 430, "start": 2876.32, "end": 2882.68, "text": "schon, wir machen die Blätter schon, warte mal, hab ich das jetzt richtig gemacht, Blätter,"}, {"id": 431, "start": 2882.68, "end": 2896.84, "text": "Blätter, Blätter, genau, Blätter, Blätter, ihr werdet gleich sehen wofür die Blätter"}, {"id": 432, "start": 2896.84, "end": 2900.92, "text": "gut sind, das ist wenn dann, gibt ja so Bungee Jumping Zombies, die dann von oben runter"}, {"id": 433, "start": 2900.92, "end": 2912.96, "text": "kommen und die werden geplockt, so Eismelone ist gleich aufgeladen, die sind gestalt, dann"}, {"id": 434, "start": 2912.96, "end": 2916.84, "text": "kann ich jetzt hier eigentlich schon weiter die Blätter hinsetzen, dann ist das Build"}, {"id": 435, "start": 2916.84, "end": 2921.76, "text": "fast fertig, dann fehlen noch ein paar Eismelone und es fehlen noch ein paar Pilze und dann"}, {"id": 436, "start": 2921.76, "end": 2929.48, "text": "ist Endless Mode angesagt, dann wird einfach nur noch, nur noch weggebombt, so Eismelone"}, {"id": 437, "start": 2929.48, "end": 2936.24, "text": "sind auch alle komplett, hier kommt noch, ja was fehlt jetzt noch, zwei Pilze fehlen"}, {"id": 438, "start": 2936.24, "end": 2950.36, "text": "noch oder, das wars, easy, noch zwei Pilze, irgendwie nicht genug Sonne, heck, heck wait,"}, {"id": 439, "start": 2950.36, "end": 2959.24, "text": "jetzt, so, oder hab ich irgendwas vergessen, ich glaub das wars vom Setup her, ah da oben"}, {"id": 440, "start": 2959.24, "end": 2964.72, "text": "fehlt noch ein Kürbis, oben fehlt noch ein Kürbis, oh, oh, na das sind wir aber gerade"}, {"id": 441, "start": 2964.72, "end": 2968.24, "text": "noch mal rechtzeitig fertig geworden, weil das sind die großen Dinger, die werfen so"}, {"id": 442, "start": 2968.24, "end": 2972.32, "text": "kleine Zombies, die fressen dann hinten alles weg, da brauchen wir auf jeden Fall oben noch"}, {"id": 443, "start": 2972.32, "end": 2982.12, "text": "ein Kürbis, da ein Pilz, Pilz und wo ist die Kaffeebohne, Kaffeebohne, Cherry Bomb,"}, {"id": 444, "start": 2982.12, "end": 2998.68, "text": "so, mal den Kram noch rein, ansonsten Melonen hab ich, falls was kaputt geht, ansonsten brauch"}, {"id": 445, "start": 2998.68, "end": 3011.92, "text": "ich nix mehr ne, das da, das da, sieht eigentlich gut aus, Melonen hab ich auch alle, ja ist"}, {"id": 446, "start": 3011.92, "end": 3018.04, "text": "eigentlich, eigentlich, wenn ich jetzt total brain afk bin, was vergessen hab, ist eigentlich"}, {"id": 447, "start": 3018.04, "end": 3027.32, "text": "alles durch, ja gut, wenn eh alles durch ist, dann können wir einfach noch, noch ne Kirschbombe"}, {"id": 448, "start": 3027.32, "end": 3037.2, "text": "klonen, ne, mehr Spikes kann ich nicht machen, weil auf die Stellen kann man keine Kirschbomben"}, {"id": 449, "start": 3037.2, "end": 3046.48, "text": "setzen, wo was ist, stopp, ich glaub so ist es ganz gut, außerdem sind es die abgecreateden"}, {"id": 450, "start": 3046.48, "end": 3059.22, "text": "Spikes, die gehen soweit ich weiß nicht kaputt, so, hier oben, so, wir sind rechtzeitig fertig"}, {"id": 451, "start": 3059.22, "end": 3064.56, "text": "geworden, sehr, sehr nice, so, es fehlen mir jetzt eigentlich noch hier oben nen Pilz,"}, {"id": 452, "start": 3064.56, "end": 3073.12, "text": "das wars, easy, nur hier nen Pilz drin, das ist alles, dann haben wir hier Massive Endless"}, {"id": 453, "start": 3073.12, "end": 3079.64, "text": "Setup am Start, dann wird gebashed, da kann ich endlich mal n bisschen, bisschen Money"}, {"id": 454, "start": 3079.64, "end": 3085.2, "text": "in dem Game machen, mit den restlichen Sachen kaufen, die gehen bei Fahrzeugen kaputt, verlieren"}, {"id": 455, "start": 3085.2, "end": 3100.56, "text": "zacken, ah, ich verstehe, ich verstehe, ja noch sind die keine großartige Bedrohung,"}, {"id": 456, "start": 3100.56, "end": 3118.88, "text": "so, mir fehlt hier oben jetzt eigentlich nur noch ein Pilz, dann ist das Setup komplett,"}, {"id": 457, "start": 3118.88, "end": 3125.28, "text": "600 Zonne, ach, haben wir ja gleich, für Money Making gibt es noch ein Minigame, welches"}, {"id": 458, "start": 3125.28, "end": 3130.48, "text": "denn, das Zombos Minigame, das letzte, da kommt man glaube ich ganz gut Money machen,"}, {"id": 459, "start": 3130.48, "end": 3136.2, "text": "so, ich glaube unser Setup ist fertig, wartet mal, lass mal kurz vergleichen, äh, was, äh,"}, {"id": 460, "start": 3136.2, "end": 3142.6, "text": "äh, Eismelone, Eismelone, Pilz, Pilz, Pilz, Schirm, Eismelone, Eismelone, Pilz, Pilz,"}, {"id": 461, "start": 3142.6, "end": 3148.4, "text": "Pilz, Schirm und unten das gleiche in der Mitte, sieht gut aus, ich würd sagen Setup"}, {"id": 462, "start": 3148.4, "end": 3158.96, "text": "ist perfekt, so, jetzt kann ich hier bashen, kann ich eben mal Chat gucken, easy, einfach"}, {"id": 463, "start": 3158.96, "end": 3165.88, "text": "alles, einfach, einfach, einfach One-Tappen alles, so muss das sein, easy as fuck, wobei"}, {"id": 464, "start": 3165.88, "end": 3175.04, "text": "ich mir, mich noch so dunkel dran erinnern kann, so ab Welle, ab Welle 15, 16 oder so"}, {"id": 465, "start": 3175.04, "end": 3179.32, "text": "wirds dann ein bisschen schwieriger, dann spammen, da spammen die dich nämlich voll"}, {"id": 466, "start": 3179.32, "end": 3190.72, "text": "mit, mit Zombies, da ist komplett hier alles dicht, Maismanagement, genau, wo zielt man"}, {"id": 467, "start": 3190.72, "end": 3194.04, "text": "die Maiskollen am besten hin, hier so in die Ecke wahrscheinlich, dann triffts nämlich"}, {"id": 468, "start": 3194.04, "end": 3217.96, "text": "hier auf dem Teil alles und hier alles, so hier würd ich sagen, oh da kommen die dicken,"}, {"id": 469, "start": 3217.96, "end": 3223.12, "text": "Money, guck deswegen, wegen diesen kleinen Zombies die geworfen werden braucht man überall"}, {"id": 470, "start": 3223.12, "end": 3235.56, "text": "die Kürbisse, oh huge drops, kann mal nen Screenshot raus und für was, aber mach mal,"}, {"id": 471, "start": 3235.56, "end": 3249.04, "text": "mach mal, mach einfach, weiß zwar nicht für was genau, aber such mal raus, huge drops,"}, {"id": 472, "start": 3249.04, "end": 3262.32, "text": "so okay, man muss aber ab und zu auch noch die Kürbisse replacen, sonst wirds nix, ach"}, {"id": 473, "start": 3262.32, "end": 3268.68, "text": "für den Money Farm, ja, oder gib mal Link auf irgendeinen Guide oder so, aber ich muss"}, {"id": 474, "start": 3268.68, "end": 3273.8, "text": "eigentlich kein, ich verdiene jetzt genug, wir spielen jetzt bis Runde 50 Billiarden"}, {"id": 475, "start": 3273.8, "end": 3286.64, "text": "und dann hab ich Easy Max Money, alter Corona, wär schön wenns nen Shortcut für Maiskanonen"}, {"id": 476, "start": 3286.64, "end": 3295.16, "text": "gäbe, dass man nicht immer die ganze Zeit so machen muss, und ich sag mal, weiß jemand"}, {"id": 477, "start": 3295.16, "end": 3300.0, "text": "ob's nen Button gibt für wähle die letzten Plans noch mal aus, gibt's wahrscheinlich"}, {"id": 478, "start": 3300.0, "end": 3308.08, "text": "nicht, so das heißt, wenn wir jetzt den, den, die Kaffeebohne, den, den, das da, und dann"}, {"id": 479, "start": 3308.08, "end": 3317.32, "text": "nehmen wir noch die Cherry, die Bomben dabei, dann nehmen wir noch das, das W-Platt für"}, {"id": 480, "start": 3317.32, "end": 3334.8, "text": "die, für die Ballon-Zombies, und das wars, 24inStunden-Stream, also das ist ja ein Endless-Bild,"}, {"id": 481, "start": 3334.8, "end": 3341.6, "text": "also das hat das Potential Endless zu spielen, ja, das heißt im Endeffekt, wir sehen uns"}, {"id": 482, "start": 3341.6, "end": 3360.68, "text": "dann morgen um 5, Max geht in Runde 30, kaputt kann gut sein, das kann gut sein, na jetzt,"}, {"id": 483, "start": 3360.68, "end": 3364.72, "text": "jetzt, ja guck mal jetzt werden die sogar von meinen, von meinen Kanonen geschreckt,"}, {"id": 484, "start": 3364.72, "end": 3386.48, "text": "von meinen Melonen, Melonen, nicht Kanonen, easy, easy, okay ich soll jetzt nicht so, nicht"}, {"id": 485, "start": 3386.48, "end": 3392.0, "text": "so viel Memes drücken, weil wahrscheinlich verkacke ich's gleich einmal und dann bin"}, {"id": 486, "start": 3392.0, "end": 3410.56, "text": "ich instant drip, okay solange da keine von den großen Zombies dabei sind ist easy, können"}, {"id": 487, "start": 3410.56, "end": 3418.8, "text": "ja gar nichts, aber die refill nicht sonderlich schnell, also wenn man hier mal wirklich alles"}, {"id": 488, "start": 3418.8, "end": 3424.68, "text": "rausbauen ist, deswegen braucht man, wegen den Zombies braucht man diese Schirmplätter,"}, {"id": 489, "start": 3424.68, "end": 3433.68, "text": "sonst ziehen die einem die Pflanzen raus, oh wow, Epilepsiewarnung, was passiert, ich"}, {"id": 490, "start": 3433.68, "end": 3448.84, "text": "erkenne nichts mehr, what the fuck, okay ich hau jetzt einfach Kanonen rein, ich, das überfordert"}, {"id": 491, "start": 3448.84, "end": 3453.04, "text": "mein Boomer Hirn da jetzt noch durch zu blicken, wo da grad was abgeht, aber einfach Kanonen"}, {"id": 492, "start": 3453.04, "end": 3476.12, "text": "reinhalten und, und gut ist, so muss das sein, guck so unendlich viel ballern kann man damit"}, {"id": 493, "start": 3476.12, "end": 3494.28, "text": "nicht, das war schon wieder fast leer, oh, oh, oh, weee, weggeweht, ne was soll man auch"}, {"id": 494, "start": 3494.28, "end": 3501.28, "text": "so viel schreiben bei dem Game im Chat, sonst ist ja wer los, lass Zombies ein bisschen"}, {"id": 495, "start": 3501.28, "end": 3528.04, "text": "laufen, oh wir haben die Pros im Chat, mach ich jetzt, pvz Pros im Chat, easy, easy, easy,"}, {"id": 496, "start": 3528.04, "end": 3539.52, "text": "ah, schreckt, boah ey so viel, guck mal ich hab schon 10k, ich kann, ich kauf gleich einfach,"}, {"id": 497, "start": 3539.52, "end": 3543.88, "text": "ich mein ich hab schon fast alles in dem Game unlocked ne, aber ich kann, ich kauf einfach"}, {"id": 498, "start": 3543.88, "end": 3552.68, "text": "gleich alles, oh, der hat so viel Pool Streams geguckt, also wieder die gleiche Geschichte,"}, {"id": 499, "start": 3552.68, "end": 3567.64, "text": "falls ich neu aufbauen muss, aber Ballonzombies dabei, ach falls wir Ballonzombies dabei haben,"}, {"id": 500, "start": 3567.64, "end": 3585.8, "text": "der hat Allergie, ne der war zu viel im Pool, zu viel Chlor, du, du, du, nein ich mach jetzt"}, {"id": 501, "start": 3585.8, "end": 3598.68, "text": "nicht Bubatv auf, gut die kommen ja auch so nicht durch die Defense durch, die Sacken,"}, {"id": 502, "start": 3598.68, "end": 3611.32, "text": "kleinen Kackknubs hier, Bam, was ein bisschen nervig ist, man muss wirklich auf alles klicken,"}, {"id": 503, "start": 3611.32, "end": 3614.84, "text": "man muss auf die Kanonen klicken, man muss auf die Sonnen klicken, man muss auf die"}, {"id": 504, "start": 3614.84, "end": 3618.32, "text": "Münzen klicken, da kannst du doch gar nicht alles einsammeln, vor allem es wird ja pro"}, {"id": 505, "start": 3618.32, "end": 3642.84, "text": "Runde immer mehr, so dann müssen wir irgendwelche Kürbisse neu machen, neue Coding Stream Auto"}, {"id": 506, "start": 3642.84, "end": 3648.0, "text": "Sonnenklicker, das gibt's bestimmt schon für das Game, auf der Xbox ging das, auf der Xbox"}, {"id": 507, "start": 3648.0, "end": 3651.52, "text": "muss man einfach nur im Kreis fahren mit dem Stick und gut war, ich mein es wäre auch"}, {"id": 508, "start": 3651.52, "end": 3656.0, "text": "fail gewesen auf der Xbox, wenn man wirklich jedes Ding anklicken muss, ich glaub sogar"}, {"id": 509, "start": 3656.0, "end": 3660.12, "text": "dass auf der Xbox die Münzen automatisch gesammelt hat, oder man musste einfach nur"}, {"id": 510, "start": 3660.12, "end": 3663.56, "text": "drüber, das heißt du hast auf der Xbox im Prinzip nichts anderes gemacht, wie den Stick"}, {"id": 511, "start": 3663.56, "end": 3684.96, "text": "permanent im Kreis bewegt, oh Pflanze, Poggers, PVZ ist das ehemalige Aim Lab,"}, {"id": 512, "start": 3684.96, "end": 3705.84, "text": "oh guck mal da kommt die Rentner, da kommen die Rentner Zombies mit ihren Rollator Dingern,"}, {"id": 513, "start": 3705.84, "end": 3732.0, "text": "die Boomer Zombies, oh warum, warum klaut er mir einfach eine Sonnenblume, never donate"}, {"id": 514, "start": 3732.0, "end": 3750.16, "text": "it never stop, neighbor wifi free entertainment, klaut er einfach meine Sonnenblume, oh ich"}, {"id": 515, "start": 3750.16, "end": 3770.44, "text": "hab alles rausgefeuert, oh das war der falsche Pilz, die klauen eigentlich einfach die Sonnenblume"}, {"id": 516, "start": 3770.44, "end": 3789.76, "text": "geklaut, Anzeige ist raus, na gut die können wir replanten nächste Runde easy, ab wann hörst"}, {"id": 517, "start": 3789.76, "end": 3800.0, "text": "du auf Sonnenblumen zusammen gar nicht, weil diese ganze Usables hier kosten ja auch,"}, {"id": 518, "start": 3800.0, "end": 3815.44, "text": "wie viel brauchen die großen eigentlich an meist zwei, ja zwei oder drei, so ok Sonnenblumen"}, {"id": 519, "start": 3815.44, "end": 3826.64, "text": "replanten, ich glaub ich passt da wieder, Bungie Zombies, na gut dann Sonnenblumen zack, das"}, {"id": 520, "start": 3826.64, "end": 3849.32, "text": "da, das da, das da, das da, den da und den da, ah wird schon passen, ach nee Sack, Kürbis"}, {"id": 521, "start": 3849.32, "end": 3854.96, "text": "braucht man immer, Kürbis braucht man immer ohne Kürbis geht hier nichts, so jetzt könnte"}, {"id": 522, "start": 3854.96, "end": 3861.4, "text": "ich eigentlich schon auswechseln wieder, das wars wer muss sich davon nicht planten, planten"}, {"id": 523, "start": 3861.4, "end": 3879.24, "text": "alter, wer muss sich nicht planten, es gibt ja auch ein komplett Auto Setup, da musst"}, {"id": 524, "start": 3879.24, "end": 3890.44, "text": "du gar nichts machen, da musst du einfach nur Sonnen einsammeln und Münzen, fertig,"}, {"id": 525, "start": 3890.44, "end": 3902.72, "text": "was ist das Loch von dem Atompilz, diesem Doompilz, das geht dann nicht mehr ein paar"}, {"id": 526, "start": 3902.72, "end": 3926.12, "text": "Minuten weg, die droppen aber schon ordentlich hier, guck mal hier ich hab angefangen mit"}, {"id": 527, "start": 3926.12, "end": 3946.0, "text": "800, jetzt hab ich schon 10k, dazu kann ich nur sagen, ich brauche noch glaube ich das"}, {"id": 528, "start": 3946.0, "end": 3951.96, "text": "Achievement, sammle alle Pflanzen, oh, bleibst du, bleibst du, gehst du weg da oben, aber"}, {"id": 529, "start": 3951.96, "end": 3956.24, "text": "das werd ich nie kriegen, da braucht man so viel Lack und muss das 50 Milliarden Stunden"}, {"id": 530, "start": 3956.24, "end": 3965.6, "text": "spielen, mach ich nicht, man kann hier gar nicht online Pflanzen trainen oder sowas,"}, {"id": 531, "start": 3965.6, "end": 3973.52, "text": "ey, ha, blocked, oh, oh, oh, da kommt was fettes, Leute da kommt was richtig fettes"}, {"id": 532, "start": 3973.52, "end": 3999.0, "text": "angefahren und Bundlezombies am Start, MonkaS, jawoll, krieg ichs auf den Sack, 500 APM,"}, {"id": 533, "start": 3999.0, "end": 4010.24, "text": "hierfür das Game brauchst du mehr als jeder StarCraft Profi, außerdem wer braucht Aim"}, {"id": 534, "start": 4010.24, "end": 4030.56, "text": "Cap, wenn er PVZ hat, so man muss immer noch mal ein Auge auf den Kürbis haben, falls"}, {"id": 535, "start": 4030.56, "end": 4040.48, "text": "ein Kürbis kaputt geht, müssen wir den replanten, das geht auf jeden Fall echt aufs Handgelenk"}, {"id": 536, "start": 4040.48, "end": 4048.76, "text": "und auf den Finger, sag mal, wie gibt es Leute die das bis 1000 Runden spielen, hallo, 1000,"}, {"id": 537, "start": 4048.76, "end": 4058.4, "text": "1000, da ist das Mousepad durch bis in den Keller, du musst jede verfickte Münze anklicken"}, {"id": 538, "start": 4058.4, "end": 4067.28, "text": "und jede Sonne, du könntest einen Bot programmieren, ja, aber das ist ja nicht legit, das ist ja"}, {"id": 539, "start": 4067.28, "end": 4092.24, "text": "beschiss, ja, bestimmt man kann Pause machen, aber trotzdem, das BTF 1000, ah gut, die gehen"}, {"id": 540, "start": 4092.24, "end": 4101.72, "text": "auch so kaputt, nice, guck mal, wir sind schon bei Flagge 17, gibt's huge money, 17, da verbrauchst"}, {"id": 541, "start": 4101.72, "end": 4107.56, "text": "du wahrscheinlich 10 Mäuse, wenn es reicht, du hast 2 Achievements nicht geschafft, welche"}, {"id": 542, "start": 4107.56, "end": 4116.92, "text": "denn, weißt du es noch, ich hab kaum Achievements in dem Game, da kommen noch mehr Zombies,"}, {"id": 543, "start": 4116.92, "end": 4131.56, "text": "so, was haben wir hier, Flugzeug, Zombies, Döpp, Döpp, Döpp, Döpp, Kaffeebohne, Kürbis"}, {"id": 544, "start": 4131.56, "end": 4139.36, "text": "und Stells, perfekt, los geht's, ich hoffe ich hab nichts vergessen, Mobile ist wahrscheinlich"}, {"id": 545, "start": 4139.36, "end": 4143.64, "text": "angenehmer als auf PC, da kannst du einfach drauf tippen, aber ich muss euch ehrlich sagen,"}, {"id": 546, "start": 4143.64, "end": 4151.64, "text": "ich glaube die Xbox Version ist echt die beste, weil die Xbox Version ist auch 16 zu 9, da"}, {"id": 547, "start": 4151.64, "end": 4155.8, "text": "siehst du noch das Haus mit, es wäre natürlich geil, falls es einen Mod gäbe, dass man die"}, {"id": 548, "start": 4155.8, "end": 4166.0, "text": "Xbox Sachen quasi importieren kann in die PC Version, das wäre richtig cool, Moment,"}, {"id": 549, "start": 4166.0, "end": 4186.2, "text": "Fans vs. Zombies, 16, 9, ne, hier das geht wahrscheinlich nicht, Full HD auf Whitescreen"}, {"id": 550, "start": 4186.2, "end": 4207.28, "text": "Mod, aha, HD Backer, ok, es gäbe wohl irgendwelche Hacker Man Hacks um das Whitescreen zu spielen,"}, {"id": 551, "start": 4207.28, "end": 4221.88, "text": "können wir nochmal ausprobieren, oh klicke, klicke, klicke, klicke, du musst wirklich"}, {"id": 552, "start": 4221.88, "end": 4234.84, "text": "je den Furz anklicken, heute Nacht klicke ich im Schlaf, heute Nacht klicke ich wahrscheinlich"}, {"id": 553, "start": 4234.84, "end": 4241.96, "text": "im Schlaf, ja Bloons hab ich mir letztens runtergeladen, das ist ja das mit den Affen"}, {"id": 554, "start": 4241.96, "end": 4248.0, "text": "und den Luftballons, da kenn ich nur die uralt Flash Variante, das wollte ich auch mal wieder"}, {"id": 555, "start": 4248.0, "end": 4251.56, "text": "ein paar Runden spielen, das ist ja auch so ein Zuchtgame, da hab ich Bewertungen gesehen"}, {"id": 556, "start": 4251.56, "end": 4269.84, "text": "auf Steam, wo Leute irgendwie 5000 Stunden Bloons haben, absolut Zuchtgame, was ist besser"}, {"id": 557, "start": 4269.84, "end": 4295.44, "text": "Bloons 5 oder Bloons 6, hab ich jetzt unterschiedliche Sachen gelesen auf Reddit, 6 ok, easy, easy,"}, {"id": 558, "start": 4295.44, "end": 4310.02, "text": "easy, jelly, jelly zueinen oh, da kriegst du ja Kopfschmerzen ein, ich muss dir eine"}, {"id": 559, "start": 4310.02, "end": 4320.94, "text": "Münze anklicken, komm shiny come on bruh, oh, huge Drop ok, ich mach doch ein Mareni"}, {"id": 560, "start": 4320.94, "end": 4325.1, "text": "gleich in der Logitech Software, die einfach endlos klickt, bis ich ausmache."}, {"id": 561, "start": 4325.1, "end": 4343.14, "text": "Achtung, Puster, Puster 82 am Start, gibt's den eigentlich noch?"}, {"id": 562, "start": 4343.14, "end": 4358.78, "text": "Puster 82, oder war doch Puster 82, der Elsch-Mago-Fatz hat aufgehört mit Battlefield 3, jawoll."}, {"id": 563, "start": 4358.78, "end": 4376.3, "text": "Oh, wieder was übersehen."}, {"id": 564, "start": 4376.3, "end": 4384.26, "text": "Also ich muss sagen, mit dem Meist-Timing bin ich nicht der Beste."}, {"id": 565, "start": 4384.26, "end": 4399.9, "text": "Es hört hier gar nicht mehr auf, und es ist erst Runde 19, da klickst du dich ja kaputt"}, {"id": 566, "start": 4399.9, "end": 4400.9, "text": "gleich."}, {"id": 567, "start": 4400.9, "end": 4407.78, "text": "Es hat sich ausgepustert beim Puster 82, das muss ich mal kurz gucken, Puster 82, gibt's"}, {"id": 568, "start": 4407.78, "end": 4408.78, "text": "den noch?"}, {"id": 569, "start": 4408.78, "end": 4412.66, "text": "Da ist er doch, Puster 82, YouTube, da ist er, genau."}, {"id": 570, "start": 4412.66, "end": 4420.7, "text": "Der pustet nicht mehr seit Mitte 2020, und er pustet auch auf YouTube nicht mehr, hat"}, {"id": 571, "start": 4420.7, "end": 4424.3, "text": "sich ausgepustet, hier, weggepustet."}, {"id": 572, "start": 4424.3, "end": 4429.02, "text": "Gilt das eigentlich auch als Tower-Defense-Game?"}, {"id": 573, "start": 4429.02, "end": 4430.26, "text": "Jaja, würde schon sagen."}, {"id": 574, "start": 4430.26, "end": 4445.7, "text": "Würde schon sagen, weil was soll es sonst sein, wenn es kein Tower-Defense-Game ist?"}, {"id": 575, "start": 4445.7, "end": 4448.18, "text": "Ich meine, das sind ja im Prinzip Towers."}, {"id": 576, "start": 4448.18, "end": 4458.38, "text": "Ja, da ist es richtig, natürlich weiß ich, dass es nicht aufhört, aber ich frag mich,"}, {"id": 577, "start": 4458.38, "end": 4462.7, "text": "wenn ich jetzt bei Runde 20 bin, was die da noch abziehen wollen, klar."}, {"id": 578, "start": 4462.7, "end": 4483.74, "text": "Was ist dein Rekord, ich glaube 52, 52, Chat, was habe ich vergessen?"}, {"id": 579, "start": 4483.74, "end": 4489.38, "text": "Nix, ja, los geht's."}, {"id": 580, "start": 4489.38, "end": 4493.18, "text": "Top-Down-Shooter, da gab's doch früher, kennt noch einer, CS 2D?"}, {"id": 581, "start": 4493.18, "end": 4497.82, "text": "Das war so ein Flash-Game, das haben wir teilweise in der Berufsschule noch gespielt."}, {"id": 582, "start": 4497.82, "end": 4508.74, "text": "CS 2D, das haben wir in der Berufsschule gespielt, CS 2D."}, {"id": 583, "start": 4508.74, "end": 4513.86, "text": "Wie, Moment, das wird noch geupdatet?"}, {"id": 584, "start": 4513.86, "end": 4519.02, "text": "Alter, das ist, das haben wir vor, das habe ich vor 13 Jahren in der Berufsschule gespielt,"}, {"id": 585, "start": 4519.02, "end": 4520.02, "text": "wollt ihr mich veräppeln?"}, {"id": 586, "start": 4520.02, "end": 4525.38, "text": "Oder, oder ist es was anderes gewesen?"}, {"id": 587, "start": 4525.38, "end": 4532.54, "text": "9 von 10."}, {"id": 588, "start": 4532.54, "end": 4548.18, "text": "Das war super Pausen-Game und auch super in Unterrichts-Game."}, {"id": 589, "start": 4548.18, "end": 4551.54, "text": "Es war auf dem Berufsschulrechner auch mehr oder weniger alles drauf, was sich so über"}, {"id": 590, "start": 4551.54, "end": 4553.02, "text": "die Jahre angesammelt hat."}, {"id": 591, "start": 4553.02, "end": 4556.42, "text": "Auf dem einen Berufsschulrechner waren sogar Porns drauf, weiß ich noch, das hat sich"}, {"id": 592, "start": 4556.42, "end": 4557.42, "text": "nie einer angeguckt."}, {"id": 593, "start": 4557.42, "end": 4569.46, "text": "Da gab's irgendeinen Ordner mit Porn drauf, dann siehst du mal, das hat da keinen mehr"}, {"id": 594, "start": 4569.46, "end": 4570.46, "text": "gejuckt."}, {"id": 595, "start": 4570.46, "end": 4580.06, "text": "Das war schon fail, Alter, Berufsschule war so schlecht im Nachhinein, also rein von dem,"}, {"id": 596, "start": 4580.06, "end": 4581.06, "text": "was man gelernt hat."}, {"id": 597, "start": 4581.06, "end": 4585.42, "text": "Ich bin aber, ich hab's ja im Video gesagt, ich bin ja gerne hingegangen, einfach weil's"}, {"id": 598, "start": 4585.42, "end": 4587.82, "text": "wie Urlaub war."}, {"id": 599, "start": 4587.82, "end": 4591.58, "text": "Komm mal hier, fast 10.000 Sonne."}, {"id": 600, "start": 4591.58, "end": 4606.38, "text": "Gibt's dann, gibt's dann extra Achievement."}, {"id": 601, "start": 4606.38, "end": 4607.38, "text": "Alles gebashed."}, {"id": 602, "start": 4607.38, "end": 4625.82, "text": "Was, nein, gehst du weg, gehst du weg, Alter, bam, piss dich, Alter, was soll das, was"}, {"id": 603, "start": 4625.82, "end": 4628.74, "text": "soll das, was gibt es hier, wenn's fertig ist, der will doch nicht meinen Pilz klauen."}, {"id": 604, "start": 4628.74, "end": 4648.1, "text": "Du mein Pilz in Ruhe, du musstest nach der Berufsschule auf die Arbeit, nee, da hatte"}, {"id": 605, "start": 4648.1, "end": 4652.5, "text": "ich Glück, das musste ich nicht, man muss ja auch nicht mehr auf die Arbeit nach der"}, {"id": 606, "start": 4652.5, "end": 4653.5, "text": "Berufsschule."}, {"id": 607, "start": 4653.5, "end": 4664.26, "text": "Ab, Leute, wie viel, ab wie viel, schon ab 5 Stunden oder so, MonkaS, ah, das wird mir"}, {"id": 608, "start": 4664.26, "end": 4665.26, "text": "zu viel."}, {"id": 609, "start": 4665.26, "end": 4682.26, "text": "Okay, jetzt, jetzt, jetzt ist das Boomer, jetzt ist das Boomer hier überfordert, Leute,"}, {"id": 610, "start": 4682.26, "end": 4699.02, "text": "jetzt ist das Boomer hier überfordert, ah, was, was geht, okay, wir haben alles easy überlebt."}, {"id": 611, "start": 4699.02, "end": 4706.42, "text": "5 Stunden, genau, ab 5 Stunden muss man nicht mehr, muss man nicht mehr auch in Betrieb"}, {"id": 612, "start": 4706.42, "end": 4707.42, "text": "nach der Berufsschule."}, {"id": 613, "start": 4707.42, "end": 4716.66, "text": "Also ich, ich musste prinzipiell, lässt, lässt du, lässt ihr, bam, glaub, es geht los, klaut"}, {"id": 614, "start": 4716.66, "end": 4718.26, "text": "er einfach wieder, einfach wieder meinen Pilz klauen."}, {"id": 615, "start": 4718.26, "end": 4736.3, "text": "Okay, die brauchen wie viel, oh, sack, brauchen die 3, brauchen die 3?"}, {"id": 616, "start": 4736.3, "end": 4748.86, "text": "Die fliegt, 22, jawoll, hier, wir knacken jetzt mein, mein, mein Rekord, weil die müssten"}, {"id": 617, "start": 4748.86, "end": 4758.22, "text": "echt einen Button machen für die gleichen Pflanzen noch mal ausrüsten, ich vergesse"}, {"id": 618, "start": 4758.22, "end": 4772.42, "text": "nämlich immer irgendwas, isse, oh, der oberste Rasenmäher ist weg, wann ist denn das passiert,"}, {"id": 619, "start": 4772.42, "end": 4776.94, "text": "habe ich irgendeinen, habe ich irgendeinen, äh, Luftballon Zombie nicht gesehen?"}, {"id": 620, "start": 4776.94, "end": 4803.98, "text": "Oh, siehst du mal, Multitasking mit 36, das ganze geht nicht mehr, übrigens, diese Zombies"}, {"id": 621, "start": 4803.98, "end": 4809.7, "text": "sahen in der ersten Version von dem Game aus wie Michael Jackson und als er dann gestorben"}, {"id": 622, "start": 4809.7, "end": 4810.7, "text": "ist, haben sie das geändert."}, {"id": 623, "start": 4810.7, "end": 4821.78, "text": "Diese Dance, diese Dance Zombies, weiß gar nicht warum, ehrlich gesagt, wäre doch eigentlich"}, {"id": 624, "start": 4821.78, "end": 4825.22, "text": "cool gewesen, wenn er noch im Game drinne wäre, aber gut, kann ich verstehen, jetzt"}, {"id": 625, "start": 4825.22, "end": 4830.98, "text": "wenn er tot ist und ein Zombie und ja, ja, okay, man wollte da wahrscheinlich Stress"}, {"id": 626, "start": 4830.98, "end": 4849.86, "text": "aus dem Weg gehen oder man hat sich selbst über gedacht, ist nicht so nett, man muss"}, {"id": 627, "start": 4849.86, "end": 4858.14, "text": "jede Münze anklicken, mal schauen, ob das noch was wird mit 50 plus Runden, ich hab"}, {"id": 628, "start": 4858.14, "end": 4882.42, "text": "da so meine Zweifel, boah, ey, meine Güte, das geklicke da fest, ja wahnsinnig, aber"}, {"id": 629, "start": 4882.42, "end": 4901.42, "text": "alles erwischt, ich muss die Sonne gar nicht anklicken, ich hab eh Max Sonne, alles erwischt,"}, {"id": 630, "start": 4901.42, "end": 4927.7, "text": "easy easy easy, falsches Emote, ah, da fliegt was, weg damit, ah, Boomer hier ist wieder"}, {"id": 631, "start": 4927.7, "end": 4957.38, "text": "überfordert, Leute, oh, der Flugchamp, ja, meine Güte, Max, wie"}, {"id": 632, "start": 4957.38, "end": 4966.98, "text": "stehst du zu Hunden, äh, Achtung, Achtung, oh nee, das war der falsche, nein, der klaut"}, {"id": 633, "start": 4966.98, "end": 4973.22, "text": "man Pilz, äh, weder noch, also ich bin jetzt kein großartiger Hunde-Fan, aber ich hab"}, {"id": 634, "start": 4973.22, "end": 4978.94, "text": "keine Schmerzen, also ich mag Katzen lieber als Hunde, aber es ist jetzt nicht so, dass"}, {"id": 635, "start": 4978.94, "end": 4984.5, "text": "ich Hunde hasse oder so, ich sag, alter, kack Hunde, wer Hunde haben will, soll sich Hunde"}, {"id": 636, "start": 4984.5, "end": 5011.26, "text": "haben, gibt ja auch paar ganz süße Hunde, aber Katzen beste, vor allem Katze FPS beste,"}, {"id": 637, "start": 5011.26, "end": 5019.18, "text": "Katzen sind so undankbar, äh, wo ist das, wo ist das, plus, die kommen halt nicht zu"}, {"id": 638, "start": 5019.18, "end": 5037.74, "text": "einem hin gerannt und äh, freuen sich offensichtlich, damn, jawoll, noch mehr, jetzt wird's aber"}, {"id": 639, "start": 5037.74, "end": 5058.5, "text": "langsam ganz schön viel, 20k, huge money, oh, wir haben alles aufgebraucht, ich glaub,"}, {"id": 640, "start": 5058.5, "end": 5061.66, "text": "ich muss mal ein anderes Endless Setup noch ausprobieren, irgendwas, wo man nicht klicken"}, {"id": 641, "start": 5061.66, "end": 5084.1, "text": "muss, ich mein, hallo, das ist ja wirklich Next Level Aim Lab hier, ja, das kommt auf"}, {"id": 642, "start": 5084.1, "end": 5100.86, "text": "die Katze an, chat, oh, Mist, jetzt hab ich alles aufgebraucht, ja, aber alles gut, nix"}, {"id": 643, "start": 5100.86, "end": 5115.26, "text": "kaputt gegangen, wunderbar, der sammelt alles Geld, na klar, money, ich brauch achievements,"}, {"id": 644, "start": 5115.26, "end": 5127.34, "text": "huge, noch mehr Geld, bau dir eine Geldsammlerpflanze ein, ja, das Problem ist, ich hab kein Platz"}, {"id": 645, "start": 5127.34, "end": 5133.7, "text": "hier irgendwie noch eine Geldsammlerpflanze hinzustellen, ich mein, ich könnt mein Zen"}, {"id": 646, "start": 5133.7, "end": 5138.98, "text": "Garden einfach voll machen und dann den ganzen Tag den Rechner anlassen, aber dann spiel"}, {"id": 647, "start": 5138.98, "end": 5150.7, "text": "ich lieber ein bisschen Endless, Achtung, jetzt machen wir, bam, jawoll, schreckt, schreckt,"}, {"id": 648, "start": 5150.7, "end": 5170.58, "text": "ja, so geht das, ok, jetzt wird's mir zu viel, Leute, es wird mir zu viel, jetzt, jetzt,"}, {"id": 649, "start": 5170.58, "end": 5175.82, "text": "mein Boomerhand wirklich am Limit hier, ich muss Geld anklicken, Zeug anklicken, Kanonen"}, {"id": 650, "start": 5175.82, "end": 5180.9, "text": "anklicken, gucken, dass hier nix gefressen wird, gucken, dass die Kürbisse nicht kaputtgehen,"}, {"id": 651, "start": 5180.9, "end": 5185.46, "text": "alles Geld aufsammeln, Monke-Ass-Moment, ich muss mal kurz, muss mal kurz alles einfrieren,"}, {"id": 652, "start": 5185.46, "end": 5201.02, "text": "das wird zu viel jetzt, das wird zu viel, so, gehen irgendwelche Kürbisse kaputt, ne, sieht"}, {"id": 653, "start": 5201.02, "end": 5216.62, "text": "eigentlich auch alles gut aus, Bild ist äußerst Boomer-unfreundlich, Leute, äußerst Boomer-unfreundlich,"}, {"id": 654, "start": 5216.62, "end": 5225.9, "text": "das ist auch nicht dafür gemacht, 36-jährige Boomer können das nicht spielen, 36-jährige"}, {"id": 655, "start": 5225.9, "end": 5237.34, "text": "Boomer hassen diesen Trick, du glaubst nicht, was als nächstes geschieht, ne, das glaube"}, {"id": 656, "start": 5237.34, "end": 5244.14, "text": "ich wirklich nicht, gucken, 26, ok, die Hälfte haben wir, Leute, die Hälfte von meinem bisherigen"}, {"id": 657, "start": 5244.14, "end": 5260.78, "text": "Rekord, easy, was mache ich da, falsche Reihenfolge, oh mein Hirn setzt aus, Leute, mein Hirn setzt"}, {"id": 658, "start": 5260.78, "end": 5269.42, "text": "aus, was habe ich jetzt schon wieder vergessen, ah, Blaseblatt, Boomer müde, hey, schon 21.10,"}, {"id": 659, "start": 5269.42, "end": 5275.58, "text": "ne, Magnet, wo soll ich den hinstellen, ich habe keinen Platz, wo soll ich hier ein Magnet"}, {"id": 660, "start": 5275.58, "end": 5285.82, "text": "hinstellen, man könnte vielleicht zwei Sonnenblumen wegmachen, ey, das könnte man echt machen,"}, {"id": 661, "start": 5285.82, "end": 5296.58, "text": "oder, ich meine, ich habe doch genug Sonne, ich könnte, reichen die goldenen Magnete von"}, {"id": 662, "start": 5296.58, "end": 5314.98, "text": "hier bis da, ich glaube nicht, das probieren wir gleich aus, ob das mit dem Poggers Magnet"}, {"id": 663, "start": 5314.98, "end": 5328.3, "text": "funktioniert, wenn nicht rebuilden wir es, also die goldenen Magnete könnten vieles nehmen,"}, {"id": 664, "start": 5328.3, "end": 5344.78, "text": "ich weiß nicht, wie weit es ist, das ist Delfingeräusch, ach, guck mal, die Boomer auf dem Rollator"}, {"id": 665, "start": 5344.78, "end": 5367.54, "text": "wieder, guck mal, da machst du Money hier, aber eins haben die richtig gemacht, sowohl"}, {"id": 666, "start": 5367.54, "end": 5372.34, "text": "die Sounds beim Einsammeln von den Münzen als auch von den Sonnen, das fühlt sich richtig"}, {"id": 667, "start": 5372.34, "end": 5382.22, "text": "satisfying an, warte mal, das hier können wir noch upgraden, Finger weg, Finger weg"}, {"id": 668, "start": 5382.22, "end": 5400.26, "text": "von meinem Rasen her, dazu kann ich nur sagen, der Delfinsound geht auch ganz gewaltig auf"}, {"id": 669, "start": 5400.26, "end": 5406.18, "text": "dem Keks, oh, oh, meine Rasen, meine Rasen ist weg, die haben wirklich meine Rasen geklaut"}, {"id": 670, "start": 5406.18, "end": 5425.3, "text": "gerade, seht ihr das, die haben einfach die Rasen geklaut, einfach Rasen gerippt, ok,"}, {"id": 671, "start": 5425.3, "end": 5440.78, "text": "wir müssen Rasen rebuilden nächste Runde, haha, what the fuck, oh, das, also ich sag"}, {"id": 672, "start": 5440.78, "end": 5460.02, "text": "euch, Aim Lab ist nicht so anstrengend, Audio nicht Auto, ja, dass ich jetzt, also mein"}, {"id": 673, "start": 5460.02, "end": 5464.42, "text": "Hirn ist eh schon am Limit, dass ich jetzt manche Wörter noch falsch ausspreche, wir"}, {"id": 674, "start": 5464.42, "end": 5472.82, "text": "können ihm jetzt ja wirklich nicht übel nehmen, warum sammle ich überhaupt noch Sonnen auf,"}, {"id": 675, "start": 5472.82, "end": 5482.34, "text": "ich hab Max, Max Sonn, Sonn, Max Sonn, ist das schwedische Max, Max Max Sonn, oh, guck"}, {"id": 676, "start": 5482.34, "end": 5495.86, "text": "hier, gerade, gerade noch rechtzeitig, bevor er mir noch den Rasen geklaut hätte, ok,"}, {"id": 677, "start": 5495.86, "end": 5499.38, "text": "wir probieren das jetzt mit dem Magnet aus, oh Mist, jetzt hab ich den falsch gesehen,"}, {"id": 678, "start": 5499.38, "end": 5510.02, "text": "wir probieren das mit dem Magnet aus, ich muss eigentlich schon Rasen replanten, weil"}, {"id": 679, "start": 5510.02, "end": 5516.66, "text": "ich müsste eigentlich hier, Magnet, Magnet, warte mal, wo ist denn der andere Magnet, da,"}, {"id": 680, "start": 5516.66, "end": 5530.26, "text": "ach, das ist auch noch ein Pilz, so, ok, jetzt bin ich, jetzt bin ich mal gespannt, ob das"}, {"id": 681, "start": 5530.26, "end": 5558.06, "text": "funktioniert, ne, ah, ah, shoot, shoot, ah, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok, ok,"}, {"id": 682, "start": 5558.06, "end": 5575.34, "text": "ah, shoot, poggers, Magnet, Alter, bester Magnet, ein feiner Magnet, kommt der bis da"}, {"id": 683, "start": 5575.34, "end": 5583.9, "text": "unten hin, zack, auf Magnet, der ist zu langsam, der Magnet ist zu langsam, Leute, ich muss"}, {"id": 684, "start": 5583.9, "end": 5594.14, "text": "noch einen bauen, guck mal, der ist zu langsam, der Magnet, der kommt nicht hinterher, ich"}, {"id": 685, "start": 5594.14, "end": 5614.14, "text": "mach da noch einen Magnet hin, ah, jetzt, jawoll, jetzt wird gelootet, erst fuck, guckt's euch"}, {"id": 686, "start": 5614.14, "end": 5630.54, "text": "an, der ist loot, jetzt geht das loot rein, huge loot, so ist das nice, es könnte aber"}, {"id": 687, "start": 5630.54, "end": 5639.3, "text": "halt sein, dass mit die Sonne ausgeht später, boah, so ist das ja geil, so ist das geil,"}, {"id": 688, "start": 5639.3, "end": 5651.22, "text": "so ist das nice, jetzt lootet's automatisch, mach rechts auch noch Boden, hab ich doch,"}, {"id": 689, "start": 5651.22, "end": 5656.06, "text": "hier, ne, ne, hier kann ich keinen Boden machen, hier muss ich Pilze und so drauf stellen können,"}, {"id": 690, "start": 5656.06, "end": 5667.22, "text": "Pilze und Bomben und so, das geht nicht, wenn da Boden ist, lass meinen Boden in Ruhe,"}, {"id": 691, "start": 5667.22, "end": 5688.34, "text": "piss dich, oh, hier kommen wieder die fetten, guck mal, die Magnete hier, guck's euch an,"}, {"id": 692, "start": 5688.34, "end": 5697.74, "text": "bam, die kommen nicht hinterher, guck mal, die Magnete sind zu langsam, die sacken zu"}, {"id": 693, "start": 5697.74, "end": 5719.78, "text": "langsam, ich hab keine Muni mehr, ich hab keine Muni mehr, so, ist hier irgendwas kaputt,"}, {"id": 694, "start": 5719.78, "end": 5743.18, "text": "muss ich irgendwas retten, ok, die Magnete machen's aber auf jeden Fall ein bisschen"}, {"id": 695, "start": 5743.18, "end": 5754.26, "text": "leichter, warum sind manche Kürbisse weiß, weil die geklont sind mit so einer Klonfrucht,"}, {"id": 696, "start": 5754.26, "end": 5763.26, "text": "dann kann man zwei vom gleichen setzen, ja doch, die Magnete helfen schon, die Magnete"}, {"id": 697, "start": 5763.26, "end": 5768.58, "text": "helfen schon, da muss ich nicht mal ganz so viel klicken, sehr, ein, sehr, sehr nicer"}, {"id": 698, "start": 5768.58, "end": 5779.58, "text": "Magnet, kann man das eigentlich upgraden hier jetzt, nein, ihr klaut mir hier nix, habt"}, {"id": 699, "start": 5779.58, "end": 5790.02, "text": "ihr gesehen, wie er schon den Magnet wieder klauen wollte, wir machen jetzt so, replanten"}, {"id": 700, "start": 5790.02, "end": 5804.42, "text": "das, ok, zwei Stück, zwei Stück, sollte reichen, jawoll, huge, komm mal hier, 30k, easy money,"}, {"id": 701, "start": 5804.42, "end": 5826.98, "text": "easy life, ok, das da, Pilzstelz und Kaffeebohne und Dings, ok, auf geht's, 30 Flanken Leute,"}, {"id": 702, "start": 5826.98, "end": 5834.74, "text": "noch, noch 12 bis zu meinem Rekord, nee, nee, oh nee, 22 bis zu meinem Rekord, Monkeys,"}, {"id": 703, "start": 5834.74, "end": 5844.9, "text": "das dauert ja noch, das dauert ja bis, bis 5 Uhr nachts oder so, Leute, ist wahnsinnig"}, {"id": 704, "start": 5844.9, "end": 5851.5, "text": "spannendes, intense Gameplay, oder, gib's zu, da ist, da ist jegliches Battle Royale"}, {"id": 705, "start": 5851.5, "end": 5858.14, "text": "zu gucken, nix dagegen, woher kommt eigentlich das Wort Stelz, ich kann's dir, doch klar"}, {"id": 706, "start": 5858.14, "end": 5867.06, "text": "kann ich dir sagen, das kommt vom Friseur und mir, wo wir MMOs gespielt haben und da"}, {"id": 707, "start": 5867.06, "end": 5873.3, "text": "gibt es doch Klassen, die schleichen können und nachdem wir Stelz immer so kacke auszusprechen"}, {"id": 708, "start": 5873.3, "end": 5886.06, "text": "fanden, haben wir halt gesagt, der Stelz war irgendwann, und daher kommt das, Stelz kommt"}, {"id": 709, "start": 5886.06, "end": 5894.18, "text": "von Schleichen, Raid Shadow Legends ist langweilig im Vergleich, ja gut, das stimmt, das kann"}, {"id": 710, "start": 5894.18, "end": 5902.5, "text": "ich mir wirklich vorstellen, Raid Shadow Legends sackt ja auch richtig, komm mal die Magnete,"}, {"id": 711, "start": 5902.5, "end": 5906.18, "text": "da ohne rechts in die Ecke kommen die Magnete nicht, da muss ich doch ab und zu mal selbst"}, {"id": 712, "start": 5906.18, "end": 5921.3, "text": "klicken, BÄÄÄM, ah der hat Xessen, oh da fliegt was, ich hab ein bisschen zu wenig"}, {"id": 713, "start": 5921.3, "end": 5924.82, "text": "Sonnenproduktion hier, das ist das Problem, wenn es jetzt noch ein bisschen weiter geht,"}, {"id": 714, "start": 5924.82, "end": 5939.7, "text": "dann geht mir irgendwann die Sonne aus, eigentlich kann man immer nur auf die gleiche Stelle zielen"}, {"id": 715, "start": 5939.7, "end": 5944.14, "text": "und alles easy, guck mal, einfach nur auf diese Stelle zielen und easy easy schreckt"}, {"id": 716, "start": 5944.14, "end": 5962.3, "text": "alles, dahin und dahin, BÄÄM, null, dahin und dahin, easy win und die Magnete sacken"}, {"id": 717, "start": 5962.3, "end": 5976.78, "text": "alles für mich ein, perfekt, so mag ich das, wie viel FPS hast du gerade, 240, also mehr"}, {"id": 718, "start": 5976.78, "end": 5996.7, "text": "kann der Monitor nicht, oh einer entkommen, ui, guck mal die Magnete kommen mit sacken"}, {"id": 719, "start": 5996.7, "end": 6004.62, "text": "nicht nach, Eats Boomer Strategie, sagt es mal nicht, mein Gehirn war zwischenzeitlich"}, {"id": 720, "start": 6004.62, "end": 6016.54, "text": "voll am Anschlag, da ging nicht mehr, guck jetzt muss ich die Zombies wieder weg pusten,"}, {"id": 721, "start": 6016.54, "end": 6021.94, "text": "irgendwo musste ich einen Kürbis reparieren, Leute wo musste ich, ah da, da, da, Kürbis"}, {"id": 722, "start": 6021.94, "end": 6031.94, "text": "Rep, dann macht ihr schnell ein Makro, nee nee so einfach ist das nicht, du musst schon"}, {"id": 723, "start": 6031.94, "end": 6037.5, "text": "ab und zu mal noch ein paar Usables reinhauen, aber was heißt so einfach easy, weil schwer"}, {"id": 724, "start": 6037.5, "end": 6043.86, "text": "ist es jetzt auch nicht gerade ja, aber abwarten, wird ja noch schwieriger, aber es gibt auf"}, {"id": 725, "start": 6043.86, "end": 6055.42, "text": "jeden Fall fat money, hier alles wieder reloaded, soll ich euch mal sagen dieser komische Delphinsound"}, {"id": 726, "start": 6055.42, "end": 6063.7, "text": "der geht mir voll auf den Sack, aber richtig, die Magnete, das mit den Magneten Chat war"}, {"id": 727, "start": 6063.7, "end": 6072.02, "text": "eine richtig gute Idee, richtig, richtig big brain, da hat sich Subscribing wieder gelohnt"}, {"id": 728, "start": 6072.02, "end": 6079.26, "text": "hier, massive Schwarmintelligenz im Chat, hast du eigentlich ein Ziel welches Level du erreichen"}, {"id": 729, "start": 6079.26, "end": 6087.78, "text": "willst, ja Weltrekord, Int Overflow, Int Overflow, wann ist ein Int 32, 2 Milliarden"}, {"id": 730, "start": 6087.78, "end": 6098.18, "text": "200, doch keine Ahnung, irgendwas bei 2 Milliarden, nee ich hab da kein spezielles, spezielles"}, {"id": 731, "start": 6098.18, "end": 6117.46, "text": "Goal, 2,1 nicht 2,2, habt ihr das jetzt nachgeguckt oder, das wussten ihr nicht aus dem Kopf"}, {"id": 732, "start": 6117.46, "end": 6132.86, "text": "aber wusste irgendjemand von euch, das ist 2,147,000,000 und sonst was ist, oh, oh, oh,"}, {"id": 733, "start": 6132.86, "end": 6150.02, "text": "oh, oh, oh, oh, die Magnete war eine richtig gute Idee, big brain, jetzt muss ich mich"}, {"id": 734, "start": 6150.02, "end": 6161.34, "text": "um den Mist nicht selbst kümmern, um Eiskräufe sind wir leer, Moment wir müssen mal kurz"}, {"id": 735, "start": 6161.34, "end": 6177.62, "text": "was in luft sprengt"}, {"id": 736, "start": 6177.62, "end": 6180.3, "text": "jetzt kommen wieder die fetten zwei stück da drauf"}, {"id": 737, "start": 6180.3, "end": 6193.54, "text": "zwei stück da drauf"}, {"id": 738, "start": 6193.54, "end": 6199.18, "text": "amas kürbis kürbis replanten noch in oder der geht kaputt dem muss dem muss"}, {"id": 739, "start": 6199.18, "end": 6206.9, "text": "ich refreshen hier oder einfach im kopf ausrechnen ja klar 232 easy mache ich"}, {"id": 740, "start": 6206.9, "end": 6210.78, "text": "immer im kopf sonst ich wollte euch ehrlich gesagt nur fragen ich wollte"}, {"id": 741, "start": 6210.78, "end": 6218.02, "text": "wissen ob ihr das auch wisst weil es ist ja quickmaps ob vius was das ist"}, {"id": 742, "start": 6218.02, "end": 6239.42, "text": "oh jetzt wird es viel oder das war es falsche"}, {"id": 743, "start": 6239.42, "end": 6242.5, "text": "den da müsst ihr refreshen und ich habe nichts mehr shit"}, {"id": 744, "start": 6242.5, "end": 6253.82, "text": "und der boden geht gleich kaputt da oben"}, {"id": 745, "start": 6253.82, "end": 6263.66, "text": "boomer hinsetzt wieder aus der delfin geht mir auch voll auf den keck"}, {"id": 746, "start": 6263.66, "end": 6276.78, "text": "oh der delfin monka ist moment okay sehr sehr jetzt muss ich kurz"}, {"id": 747, "start": 6276.78, "end": 6288.86, "text": "erst erst mal alles weg bomben hier was noch da ist"}, {"id": 748, "start": 6288.86, "end": 6300.06, "text": "okay doch wir sind für das safe safe leute safe alles safe kein problem"}, {"id": 749, "start": 6300.06, "end": 6320.46, "text": "sind wir fit"}, {"id": 750, "start": 6320.46, "end": 6326.22, "text": "blub blub den boden könnte man mal neu planten hier kürbis brauche"}, {"id": 751, "start": 6326.22, "end": 6330.14, "text": "jetzt kommt die diskussion wann in ja gut ist die frage ob sein oder anzahlen"}, {"id": 752, "start": 6330.14, "end": 6340.74, "text": "wir machen ein paar kürbisse gut das sollte jetzt diese runde nichts kaputt"}, {"id": 753, "start": 6340.74, "end": 6348.18, "text": "gehen dass da das da brauchen wir gegen die flug zombies kurz schauen muss man"}, {"id": 754, "start": 6348.18, "end": 6353.78, "text": "noch irgendwas irgendwas replanten ja aber die ganzen kürbisse der boden"}, {"id": 755, "start": 6353.78, "end": 6362.42, "text": "genau der boden muss replantet werden das da das da zack zack"}, {"id": 756, "start": 6362.42, "end": 6369.62, "text": "perfekt toxi dankeschön für den sub"}, {"id": 757, "start": 6369.62, "end": 6383.02, "text": "erst mal alles refreschen du du du du du das also dass da bin ich echt"}, {"id": 758, "start": 6383.02, "end": 6387.66, "text": "begeistert der mag nicht der delfin dieser delfin saunter fack mich so krass"}, {"id": 759, "start": 6387.66, "end": 6398.86, "text": "ab der fahre ich auch so meine fresse der delfin sauner alles andere ist gut"}, {"id": 760, "start": 6398.86, "end": 6403.02, "text": "aber dieser delfin saunen macht mich fertig aber hier toxi dankeschön hyper"}, {"id": 761, "start": 6403.02, "end": 6405.42, "text": "subscription"}, {"id": 762, "start": 6413.98, "end": 6421.86, "text": "aus spikes spikes am arsch ja jetzt haben wir geplantet"}, {"id": 763, "start": 6421.86, "end": 6430.06, "text": "jawoll easy guck mal wir brauchen mit der mason wir verlieren"}, {"id": 764, "start": 6452.86, "end": 6459.18, "text": "aber hier noch die müssten es eigentlich davon dauern gehen jawoll so einmal können"}, {"id": 765, "start": 6459.18, "end": 6467.22, "text": "wir noch planten komm her das stachel stein planten das level ist sicher als"}, {"id": 766, "start": 6467.22, "end": 6471.34, "text": "uint 64 gespeichert ok dann wird schwierig ich habe keine ahnung was das"}, {"id": 767, "start": 6471.34, "end": 6478.22, "text": "maximum für uint 64 ist nein nein du klaust nicht meinen boden ein boden ist"}, {"id": 768, "start": 6478.22, "end": 6483.66, "text": "mir das war ein boden in roh"}, {"id": 769, "start": 6483.66, "end": 6510.06, "text": "das ist das das ist zu viel für mein hirn sinnloses gemiem auf dem zweiten"}, {"id": 770, "start": 6510.06, "end": 6514.22, "text": "monitor und dann hier noch zombies die fänden"}, {"id": 771, "start": 6520.86, "end": 6528.3, "text": "soll das spiel nicht einfach sein ja warum ist es weg warum ist es weg"}, {"id": 772, "start": 6528.3, "end": 6540.78, "text": "ich kann jetzt gar nicht replanten ich habe nichts dabei monka es gibt der"}, {"id": 773, "start": 6540.78, "end": 6544.58, "text": "scheiß delfin ja das scheiß gnome alter ruby"}, {"id": 774, "start": 6544.58, "end": 6554.54, "text": "das checkt jetzt auch keiner der nicht regelmäßig im stream dabei ist"}, {"id": 775, "start": 6567.54, "end": 6572.22, "text": "direkt geben müssen gleich replanten nächste runde aber sieht ja noch alles"}, {"id": 776, "start": 6572.22, "end": 6576.78, "text": "safe aus sieht nur alles safe aus was hat ruby mit scheiß gnome zu tun wie das"}, {"id": 777, "start": 6576.78, "end": 6579.78, "text": "das weißt du doch du warst doch schon oft genug im stream dabei"}, {"id": 778, "start": 6579.78, "end": 6586.06, "text": "oh nee der klaut der klaut mein pilz gehst du weg"}, {"id": 779, "start": 6586.06, "end": 6603.74, "text": "ok replanten also wir brauchen das platz ok wir brauchen einen platz wir brauchen"}, {"id": 780, "start": 6603.74, "end": 6607.26, "text": "das wir brauchen den pilz stellz wir brauchen die bohne wir brauchen die"}, {"id": 781, "start": 6607.26, "end": 6612.94, "text": "zwei boden habe ich alles gemacht naja boden passt alles gut nur eins kaputt"}, {"id": 782, "start": 6612.94, "end": 6617.7, "text": "und versus flug zombies jawohl"}, {"id": 783, "start": 6617.7, "end": 6623.18, "text": "sonnenblumen nee warum sonnenblumen"}, {"id": 784, "start": 6623.18, "end": 6644.1, "text": "oh der delfin man der gleiche kollege der gesagt hat der scheiß gnome hat"}, {"id": 785, "start": 6644.1, "end": 6654.9, "text": "auch immer hat auch immer ruby gesagt das war ja einer das war der typ der auch"}, {"id": 786, "start": 6654.9, "end": 6657.74, "text": "bei uns also der kollege bei mir auf der arbeit immer schlichter hat auch"}, {"id": 787, "start": 6657.74, "end": 6663.18, "text": "sein desktop so eingestellt dass es immer gemacht hat im pc speaker wenn er"}, {"id": 788, "start": 6663.18, "end": 6667.5, "text": "mit der maus an den bildschirmrand gekommen ist und dann hat er gesagt der"}, {"id": 789, "start": 6667.5, "end": 6677.66, "text": "scheiß gnome als als wird es am gnome liegen huge drops huge drops massive"}, {"id": 790, "start": 6681.5, "end": 6686.7, "text": "da hinten muss jetzt aufpassen das muss bestimmt auch bald mal replanten"}, {"id": 791, "start": 6686.7, "end": 6693.98, "text": "aber gibt es jetzt eigentlich jede runde delfine"}, {"id": 792, "start": 6693.98, "end": 6715.54, "text": "so machen wir mal bumm jawohl"}, {"id": 793, "start": 6715.54, "end": 6725.62, "text": "so gehört sich das alles wieder replanted ready to go"}, {"id": 794, "start": 6725.62, "end": 6734.5, "text": "wie hat er das gemacht ja ich weiß es nicht ich weiß bis heute nicht wie das"}, {"id": 795, "start": 6734.5, "end": 6739.9, "text": "funktioniert dass man seinen pc speaker summen lassen kann wenn man mit der"}, {"id": 796, "start": 6739.9, "end": 6743.5, "text": "maus am bildschirmrand kommt keine ahnung wirklich legit keine ahnung wie"}, {"id": 797, "start": 6743.5, "end": 6749.78, "text": "das funktioniert absolut kein plan"}, {"id": 798, "start": 6760.86, "end": 6765.06, "text": "ok ich muss ich muss ich muss ja gar nicht mehr klicken dafür habe ich den"}, {"id": 799, "start": 6765.06, "end": 6774.82, "text": "magnet ja am start mehr mehr messen flut delfine finger weg"}, {"id": 800, "start": 6780.62, "end": 6783.62, "text": "finger weg"}, {"id": 801, "start": 6783.62, "end": 6795.46, "text": "warum sterben die eigentlich nicht normalerweise sind die doch mit einer"}, {"id": 802, "start": 6795.46, "end": 6798.1, "text": "kanone hinüber"}, {"id": 803, "start": 6798.1, "end": 6812.98, "text": "guck mal jetzt geht mir komplett die munition aus wo ist der diamant gewesen"}, {"id": 804, "start": 6812.98, "end": 6816.94, "text": "habt ihr gesehen habe sie schon eingesammelt"}, {"id": 805, "start": 6818.54, "end": 6823.1, "text": "ich höre den delfin sehen aber nie hier du musst hier hingucken hier stellt"}, {"id": 806, "start": 6823.1, "end": 6832.98, "text": "da immer rum der delfine mal kurz slowdown"}, {"id": 807, "start": 6832.98, "end": 6851.42, "text": "die magnete sind nice guck mal mein mani an"}, {"id": 808, "start": 6851.42, "end": 6861.38, "text": "kakt delfine ich habe das geschenk übersehen vielleicht kommt es auch"}, {"id": 809, "start": 6861.38, "end": 6867.02, "text": "automatisch im garten kann sein"}, {"id": 810, "start": 6874.02, "end": 6878.62, "text": "wie vielen wellen willst du machen weiß ich nicht mal gucken bis ich ins bett"}, {"id": 811, "start": 6878.62, "end": 6891.58, "text": "gehe ihr wisst ja boomer müde dauert ja nicht mehr lange alter der delfine"}, {"id": 812, "start": 6892.38, "end": 6897.62, "text": "ich gehe danach gleich ea verklagen für den delfin sound sagt es hat"}, {"id": 813, "start": 6897.62, "end": 6906.02, "text": "traumatische erlebnisse hinter hinterlassen hier anzeige ist raus"}, {"id": 814, "start": 6906.02, "end": 6911.26, "text": "heute die sonnenblumen reichen nicht guckt mal seht ihr das wird immer"}, {"id": 815, "start": 6911.26, "end": 6913.62, "text": "weniger"}, {"id": 816, "start": 6914.66, "end": 6917.54, "text": "ich brauche eigentlich vier eigentlich kann ich mir den magnet da gar nicht"}, {"id": 817, "start": 6917.54, "end": 6937.04, "text": "leisten"}, {"id": 818, "start": 6947.54, "end": 6959.66, "text": "Mal kurz Slowdown, wird mir zu viel und meine Kanonen müssen nachladen."}, {"id": 819, "start": 6959.66, "end": 6979.74, "text": "Wie die leben ja immer noch da oben die Viecher. So das muss refreshed werden,"}, {"id": 820, "start": 6979.74, "end": 6985.9, "text": "huge loot. Ich glaube wenn ich muss einfach mehr Sonnen einsammeln dann geht das schon."}, {"id": 821, "start": 6985.9, "end": 6999.06, "text": "So irgendwelche Kürbissdinger nachblenden. Ah nee, hätte fast den Magnet entwendet hier."}, {"id": 822, "start": 6999.06, "end": 7010.62, "text": "Entwendet klar. Never Donate, Never Sub, Never Wi-Fi, Free Entertainment hätte er gemacht mit"}, {"id": 823, "start": 7010.62, "end": 7029.14, "text": "meinem Magnet. Massive Loot. Massiver Loot-Champ. Das kostet so viel Sonne, guck mal das wird immer"}, {"id": 824, "start": 7029.14, "end": 7038.34, "text": "weniger. Bin ich sparsam genug? So nice die Magnete sind, das funktioniert auf Dauer nicht."}, {"id": 825, "start": 7038.34, "end": 7053.26, "text": "Ausreichend verprobt. Der verprobt ist auch so ein Suckerwort. Oh, oh Moment. Fuck. Jetzt"}, {"id": 826, "start": 7053.26, "end": 7067.9, "text": "habe ich ein Problem. Lass meine Melone in Ruhe. Nein. Close, close. Bin fast meine Melone gerippt,"}, {"id": 827, "start": 7067.9, "end": 7086.78, "text": "geschreckt da unten. Beinahe wäre es das gewesen mit der Melone. So und das ist alles gut,"}, {"id": 828, "start": 7086.78, "end": 7088.86, "text": "sieht gut aus, sieht gut aus, sieht gut aus, hier vorne sieht auch gut aus. Ok,"}, {"id": 829, "start": 7088.86, "end": 7114.74, "text": "jetzt kann es erstmal eigentlich nichts passieren. Das wird geploggt. Das lebt noch. Ich habe da"}, {"id": 830, "start": 7114.74, "end": 7121.74, "text": "gerade alles drauf gebombt, was irgendwie geht. Ok, wir müssen den Boden replanten da oben,"}, {"id": 831, "start": 7121.74, "end": 7126.82, "text": "ist fast kaputt. Der Kürbis ist hier auch fast kaputt. Das heißt wir machen jetzt eine"}, {"id": 832, "start": 7126.82, "end": 7146.98, "text": "neue Aufbaurunde, zack, zack, Boden und Dings, Dings, Dings, Kaffee und Platt, alles gut. Ja"}, {"id": 833, "start": 7146.98, "end": 7153.58, "text": "und den bei der Gelegenheit. Ich muss, ich muss, oh nein jetzt habe ich da reingeklickt,"}, {"id": 834, "start": 7153.58, "end": 7159.22, "text": "richtig dumm. Jetzt habe ich einen total, total vereimt. Habt ihr es gesehen? Ich brauche doch"}, {"id": 835, "start": 7159.22, "end": 7167.78, "text": "mehr Aim Lab Training. Aber das sind zum Glück diesmal so die richtigen Sucker Zombies, die"}, {"id": 836, "start": 7167.78, "end": 7183.5, "text": "können alle nichts. Oh, da sind auch große dabei. Ok, die können doch was und ich habe,"}, {"id": 837, "start": 7183.5, "end": 7199.26, "text": "ich habe nichts mehr. Sag mal, kann es sein, dass die Mais, die Maiskanonen nur eine gewisse"}, {"id": 838, "start": 7199.26, "end": 7203.86, "text": "Maximumanzahl an Zombies hitten können, weil ansonsten müssten die eigentlich down gehen,"}, {"id": 839, "start": 7203.86, "end": 7211.14, "text": "die Fetten da oben. Guck, der hier, der hätte mit down gehen müssen eigentlich. Die da"}, {"id": 840, "start": 7211.14, "end": 7218.46, "text": "auch. Jetzt sind sie down gegangen. Hä? Die haben bestimmt irgendein Maximumanzahl,"}, {"id": 841, "start": 7218.46, "end": 7243.38, "text": "den sie hitten können. Die Sonnen, die Sonnen gehen aus. Wo könnte ich, könnte ich irgendwo"}, {"id": 842, "start": 7243.38, "end": 7264.1, "text": "noch eine Sonne hin? Eigentlich nicht, ne? Ich habe zu wenig Geld, um das zu maintainen,"}, {"id": 843, "start": 7264.1, "end": 7270.38, "text": "das Bild. Boah, wie viel die droppen mittlerweile ey. Da fuck, guck mal hier, ich habe 63k gemacht."}, {"id": 844, "start": 7270.38, "end": 7292.62, "text": "Richtig geiler Kreiselgrind hier. Richtig nicer Kreiselgrind."}, {"id": 845, "start": 7292.62, "end": 7320.94, "text": "Boah, was die droppen mittlerweile. Lul. Ich verliere pro Runde momentan 1k, ja das zackt."}, {"id": 846, "start": 7320.94, "end": 7325.06, "text": "Ich muss die Magnete eigentlich weg machen. Aber ohne Magnete ist dumm, da muss ich das"}, {"id": 847, "start": 7325.06, "end": 7330.18, "text": "ja alles selbst einsammeln. Ne, ne Leute, dann sterbe ich lieber und sammle die Kohle"}, {"id": 848, "start": 7330.18, "end": 7339.34, "text": "mit den Magneten ein. Das kannste knicken. Ne. Ich kann auch sonst nichts weg machen,"}, {"id": 849, "start": 7339.34, "end": 7343.34, "text": "ich mein was soll ich sonst weg machen? Den Boden und da eine Sonne hinstellen funktioniert"}, {"id": 850, "start": 7343.34, "end": 7353.42, "text": "nicht. Ich kann, eigentlich kann ich nichts weg machen. Höchstens, höchstens die hier."}, {"id": 851, "start": 7353.42, "end": 7364.78, "text": "Der wollt wieder mal nen Pilz klauen. Oh ne Leute, wir haben, wir haben, wir haben"}, {"id": 852, "start": 7364.78, "end": 7381.1, "text": "mal keine Delfine die Runde. Poggers. Delfin freie Runde. Aber wir können noch ne Weile"}, {"id": 853, "start": 7381.1, "end": 7387.46, "text": "spielen mit Magneten. So, wieder, wieder die übliche Geschichte, weil es mega huge spannend."}, {"id": 854, "start": 7387.46, "end": 7412.06, "text": "Ich versuche mal ein bisschen sparsam zu sein. Oh wir haben wieder Delfine, please. Please"}, {"id": 855, "start": 7412.06, "end": 7433.98, "text": "keine Delfine mehr. Okay, wieviel müssen wir noch? 42? Ich schaff mein Rekord nicht"}, {"id": 856, "start": 7433.98, "end": 7441.66, "text": "Leute. Das ist mir zu, zu pepega gerade. Ich will nicht noch 10 Runden spielen. Ne,"}, {"id": 857, "start": 7441.66, "end": 7456.86, "text": "ne Moment, das sind nur noch 5 Runden oder? Das sind ja 2 Flagen pro Runde. Okay dann"}, {"id": 858, "start": 7456.86, "end": 7466.3, "text": "vielleicht doch. Obbei das sieht ganz schön RIP aus jetzt. Ich hab zu wenig, ich hab zu"}, {"id": 859, "start": 7466.3, "end": 7494.22, "text": "wenig Mais. Mais ist okay, ich glaub das wars. Ah, wobei, wobei, wobei. Oh ne, noch mal Glück"}, {"id": 860, "start": 7494.22, "end": 7505.14, "text": "gehabt. Noch mal Glück gehabt. Okay, das hat sich jetzt nicht gelohnt. Aber ich hab mich"}, {"id": 861, "start": 7505.14, "end": 7511.18, "text": "jetzt bei Usables ein bisschen zusammen gerissen, das heißt ich lasse mein Rasen in Ruhe. Ich"}, {"id": 862, "start": 7511.18, "end": 7529.1, "text": "glaub der kann den Rasen gar nicht aufpicken oder? Ne, kann er gar nicht. Lassen. Please"}, {"id": 863, "start": 7529.1, "end": 7540.46, "text": "Delfine. Ah Plant. Plant. Banana Planter. Kennt das noch jemand? Das ist da wo der Friseur"}, {"id": 864, "start": 7540.46, "end": 7546.7, "text": "hat mal ne Montage hochgeladen. Oh, oh Zombie. Ne Montage bei sich hochgeladen von nem Typ"}, {"id": 865, "start": 7546.7, "end": 7552.54, "text": "der hieß Banana Planter. Und der hat halt übelst krass gecheatet. Hat alles, hat alles"}, {"id": 866, "start": 7552.54, "end": 7572.42, "text": "One Shot Sniped. Nicht One Shot Sniped. Also Instant Turn On und alles. Sniper Montage"}, {"id": 867, "start": 7572.42, "end": 7588.02, "text": "vom Cheater auch. Oh Fuck, hier geht was kaputt Leute. Hier geht was kaputt. Ah, Monka. What"}, {"id": 868, "start": 7588.02, "end": 7598.94, "text": "is Happening? Leute ich brauch die zwei, ich brauch die zwei Sonnen. Das ist das sonst"}, {"id": 869, "start": 7598.94, "end": 7606.3, "text": "das RIP. Aber es ist mir egal, es ist egal. Ich hab das Money und ich hab keinen Bock"}, {"id": 870, "start": 7606.3, "end": 7631.06, "text": "den Kram selbst aufzuluten, zu looten jedes Mal. Kürbis sind echt angefressen ja. Die"}, {"id": 871, "start": 7631.06, "end": 7645.74, "text": "sind gerade nicht gestorben. So jetzt ist die große Preisfrage Leute. Plant ich Sonnenblumen"}, {"id": 872, "start": 7645.74, "end": 7657.26, "text": "und lasst das mit den Magneten? Oh Boden ist weg. Boden ist weg. Was mach ich Leute? Komm"}, {"id": 873, "start": 7657.26, "end": 7676.74, "text": "ich geh eh nix pennen. Scheiß drauf, ich lasse das mit den Magneten. Kürbis ist auf"}, {"id": 874, "start": 7676.74, "end": 7701.82, "text": "weg. Wo ist der Kürbis weg? Ah, da ist der Kürbis weg. Direkt wieder hin. Zack. Ok,"}, {"id": 875, "start": 7701.82, "end": 7714.22, "text": "für die Runde sollte es auf jeden Fall noch reichen. Delfine sind back. Delfin Warfare."}, {"id": 876, "start": 7714.22, "end": 7732.54, "text": "Sollte in jeden Fall die Kürbisse noch am kaputt gehen? Sieht eigentlich gerade ganz"}, {"id": 877, "start": 7732.54, "end": 7761.3, "text": "ok aus, aber ich muss Sonne looten. Fuck, alles weg. Kein Mais mehr da. Mais weg. Nooo."}, {"id": 878, "start": 7761.3, "end": 7765.9, "text": "Sag mal gibt es wirklich Leute, die das bis Runde 1000 gespielt haben? Das ist ja der"}, {"id": 879, "start": 7765.9, "end": 7777.58, "text": "Wahnsinn. Das bis Runde 1000, meine Fresse ey. Da drehst du doch komplett am Rad danach."}, {"id": 880, "start": 7777.58, "end": 7791.82, "text": "Ja klar, du kannst es über mehrere Tage machen, aber trotzdem. What the fuck. Pepega. Ich"}, {"id": 881, "start": 7791.82, "end": 7815.82, "text": "würde durchdrehen, ja ich auch. Ich drehe jetzt schon durch. Gutes Loot. Nächstes Mal"}, {"id": 882, "start": 7815.82, "end": 7824.62, "text": "probiere ich ein Auto Setup, ohne dass ich was machen muss. Gehe ich einfach ab. Wobei"}, {"id": 883, "start": 7824.62, "end": 7830.46, "text": "ich glaube ganz abgehen geht nicht. Weil du musst ab und zu immer noch mal eine Bombe"}, {"id": 884, "start": 7830.46, "end": 7855.82, "text": "oder so eine Cherrybombe reinsetzen. So. Ja, Mais ist alt."}, {"id": 885, "start": 7855.82, "end": 7872.74, "text": "Rasen kaputt, aber ich wollte eh replanten. Ok, Boomer hier ist wieder überfordert, ich"}, {"id": 886, "start": 7872.74, "end": 7888.38, "text": "merke nix. Ich halte einfach nur noch, ich halte einfach nur noch rein. Ich halte einfach"}, {"id": 887, "start": 7888.38, "end": 7894.26, "text": "nur noch rein. Trainierende KI gibt es bestimmt schon. Plants vs. Zombies KI. Würde ich mich"}, {"id": 888, "start": 7894.26, "end": 7903.62, "text": "nicht wundern, gibt es bestimmt schon. Gibt es bestimmt schon. Müssen wir mal auf GitHub"}, {"id": 889, "start": 7903.62, "end": 7915.68, "text": "gucken. Sorry, auf Shithub. Da sind noch mehr Zombies. 2000, wir haben gar nicht so viel"}, {"id": 890, "start": 7915.68, "end": 7926.74, "text": "verloren diese Runde. An Money. Ok, wir haben alles replantet. Passt. Also den da, den da,"}, {"id": 891, "start": 7926.74, "end": 7932.54, "text": "den da, den da, den da, den da, den da, den da, den da, den da, den da. Zack, los geht's."}, {"id": 892, "start": 7932.54, "end": 7940.5, "text": "Langsam finde ich den Kram schon. 46, ok, also wir haben jetzt wirklich eine reelle"}, {"id": 893, "start": 7940.5, "end": 7951.7, "text": "Chance da meinen Rekord zu packen. Ich meine es sind noch drei Runden. Es muss doch gehen."}, {"id": 894, "start": 7951.7, "end": 7971.34, "text": "Drei Runden, easy. Muss doch möglich sein. Die halten so viel aus, die fetten Dinger."}, {"id": 895, "start": 7971.34, "end": 7988.14, "text": "Guck mal, ich hab nicht genug Mais dafür. Ja, ich hab nicht genug Mais. Und das geht"}, {"id": 896, "start": 7988.14, "end": 7993.9, "text": "jetzt auch kaputt, weil die Delfine hier rumstelzen. Was hältst du vom angeblichen Battlefield"}, {"id": 897, "start": 7993.9, "end": 8008.38, "text": "6 Gameplay Trailer auf TikTok? Hast du mal einen Link? Kenn ich nicht. Oh nein, Grip."}, {"id": 898, "start": 8008.38, "end": 8031.34, "text": "Ok, jetzt wird's, jetzt wird's, jetzt wird's kacke. Ich hab jetzt auch kein Mais mehr"}, {"id": 899, "start": 8031.34, "end": 8055.98, "text": "und das ist jetzt, die Runde hat erst angefangen. Shit. Run dead. TikTok. Können wir uns gleich"}, {"id": 900, "start": 8055.98, "end": 8084.46, "text": "angucken? Können wir uns gleich angucken. Oh fuck, Alter. Wir haben nicht mehr genug"}, {"id": 901, "start": 8084.46, "end": 8094.82, "text": "Kanonen. Shit. Ich glaube Leute, ich glaube wir werden überrannt. Der Spawn reicht nicht"}, {"id": 902, "start": 8094.82, "end": 8113.62, "text": "mehr. Fuck. Der Spawn reicht nicht mehr von dem Maiskram."}, {"id": 903, "start": 8113.62, "end": 8131.54, "text": "Ich brauch die sechste Kanone unbedingt wieder. Hoffentlich überleben wir das doch irgendwie."}, {"id": 904, "start": 8131.54, "end": 8150.62, "text": "Ich hab auch keine Sonne mehr. Shit. Ok, ich glaub das war's. Ich glaub das war's."}, {"id": 905, "start": 7154.48, "end": 8173.7, "text": "ok. Jetzt müssten die Magneten weg. Mal gucken, ob wir die Runde noch überleben."}, {"id": 906, "start": 8173.7, "end": 8184.18, "text": "Dann ragequit' dich einfach. 48 habe ich neun Rekorde, nee nee 52 hatte ich. 52 hatte"}, {"id": 907, "start": 8184.18, "end": 8198.58, "text": "ich. Der hat den Kürbis geklaut. Alter, warum klaust du meinen Kürbis, man? Pepega-Zombie-Mensch."}, {"id": 908, "start": 8198.58, "end": 8206.34, "text": "Mann. Frau. Divers. Keine Ahnung. Kann ja kein Mensch sein. Zombie-Mensch geht ja nicht."}, {"id": 909, "start": 8206.34, "end": 8211.46, "text": "Sind ja, das waren ja mal Menschen, aber sind ja, sind Zombies noch Menschen, wenn es mal"}, {"id": 910, "start": 8211.46, "end": 8217.66, "text": "Menschen waren oder sind das jetzt, was sind die denn jetzt eigentlich? Undead. Also nee,"}, {"id": 911, "start": 8217.66, "end": 8223.9, "text": "dann nicht mehr. Ok Leute, reicht genug. Easy, easy win. Das haben wir keine Chance zu überleben."}, {"id": 912, "start": 8223.9, "end": 8231.86, "text": "Ich muss, ähm, ich muss replanten. Ich hab keine Sonne mehr übrig. Man sieht's leider"}, {"id": 913, "start": 8231.86, "end": 8237.14, "text": "nicht hier. Ich hab noch 12-15 Sonnen, das krieg ich im Leben nicht hin. Ähm, vergiss"}, {"id": 914, "start": 8237.14, "end": 8244.66, "text": "es. Ok Leute, ich klick jetzt random was an und wir lassen uns bashen. Wir lassen uns"}, {"id": 915, "start": 8244.66, "end": 8254.38, "text": "bashen. So sieht's aus, wenn man stirbt in dem Game. Wir werden jetzt, wir werden jetzt"}, {"id": 916, "start": 8254.38, "end": 8281.26, "text": "Gachi-Bast vor den Zombies. Mach jetzt nichts, ich lass mich jetzt überrennen. Oh, bam."}, {"id": 917, "start": 8281.26, "end": 8299.06, "text": "Äh, ich mach nicht die 50 voll. Die Runde hätten wir eh nicht gewonnen. Guckt's euch"}, {"id": 918, "start": 8299.06, "end": 8320.18, "text": "an. Alle zu viele Pool-Streams geguckt. Monarch-S. Rage Quit. Nee, das hätten wir nicht, das"}, {"id": 919, "start": 8320.18, "end": 8336.02, "text": "hätten wir doch großartig machen sollen. Alter, was da kommt? Guckt euch das mal an."}, {"id": 920, "start": 8336.02, "end": 8354.5, "text": "Guckt euch das mal an. Can't wait. Kannst du noch dein Garten zeigen? Ja, mach ich jetzt."}, {"id": 921, "start": 8354.5, "end": 8382.1, "text": "Ich mach jetzt Garten und geh in den Shop. Setke. Das ist kein Problem, wir haben den"}, {"id": 922, "start": 8382.1, "end": 8387.74, "text": "Chat. Wir haben den Chat, wir sind so big brain, uns wächst in zweites Gehirn nach."}, {"id": 923, "start": 8387.74, "end": 8397.38, "text": "Nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nein, nicht nochmal. Can't"}, {"id": 924, "start": 8397.38, "end": 8407.3, "text": "wait. Nee, nee, nee, nee, nee, nee. Ok, sehr gut. Ok, ok, wir gärtnern nochmal schnell"}, {"id": 925, "start": 8407.3, "end": 8427.62, "text": "ne Runde. Lass nochmal ne Runde gärtnern. So. Massive Garten. Stell's. Schneggel. Wie?"}, {"id": 926, "start": 8427.62, "end": 8457.38, "text": "Und düngen. Düngen. Yes. Erstmal schön Gartenstells machen. Next"}, {"id": 927, "start": 8457.38, "end": 8485.42, "text": "floor. So, gehen wir mal kurz den Laden und kaufen noch ein bisschen Dünger. Was hab"}, {"id": 928, "start": 8485.42, "end": 8492.74, "text": "ich denn da gespawnt? Was ist das? Ach, das ist das Ding, was die Gräber auf der Nachtmap"}, {"id": 929, "start": 8492.74, "end": 8508.7, "text": "wegmacht. So, jetzt müssen wir den Schubkarre nehmen und den Schubkarre abladen. Exzellent."}, {"id": 930, "start": 8508.7, "end": 8519.26, "text": "So, noch mal ne Runde Dünger kaufen. Haben wir genug Geld jetzt? Was bringt der Garten"}, {"id": 931, "start": 8519.26, "end": 8525.34, "text": "wieder? Im Prinzip Geld. Ich bin mir nicht sicher, ob man nicht auch Pflanzen züchten"}, {"id": 932, "start": 8525.34, "end": 8533.82, "text": "konnte, die man in Game verwendet dann. Keine Ahnung. Es gibt bestimmt auch ein paar Erfolge."}, {"id": 933, "start": 8533.82, "end": 8550.22, "text": "Ich weiß nicht. Genau. So, erst noch ein bisschen Musik spielen. Jawoll. So, was kann"}, {"id": 934, "start": 8550.22, "end": 8561.74, "text": "ich mir überhaupt noch kaufen? Blumen? Brauche ich nicht. Ah, Aquarium kaufen. Jawoll. 30K,"}, {"id": 935, "start": 8561.74, "end": 8570.9, "text": "keine Güte. Rechnen brauchen wir nicht, sonst hab ich ja alles. Dünger. Wir können den"}, {"id": 936, "start": 8570.9, "end": 8585.46, "text": "Baum, ja, wir können den Baum crowen. Ausverkauft, ok. Wir crowen den Baum ein bisschen. Da kriegen"}, {"id": 937, "start": 8585.46, "end": 8592.18, "text": "wir eine useful Tipps für das Game. Angeblich sollen eingefrorene Zombies langsamer fressen."}, {"id": 938, "start": 8592.18, "end": 8599.78, "text": "Aha. Hast du schon von dem Yeti-Zombie gehört in 3.1 oder 3.10, wo es den gab? Nein, noch"}, {"id": 939, "start": 8599.78, "end": 8607.62, "text": "ganz neu. Ich hab das Game noch nie gespielt. Deshalb sind Pustepilze in Nachtlevels unverzichtbar."}, {"id": 940, "start": 8607.62, "end": 8616.58, "text": "Aha. Brauchst du noch Wasser pflanzen für deinen Sandgarten? Ich verwet- was? Ich verwette"}, {"id": 941, "start": 8616.58, "end": 8627.42, "text": "mein Floam? Nein, was? Ok, great, den Witz verstehe ich nicht. Ok, ich mach das jetzt"}, {"id": 942, "start": 8627.42, "end": 8632.94, "text": "einfach mal ein bisschen schneller. Kennst du das Plants vs. Zombies 3D Spiel? Ja. Du"}, {"id": 943, "start": 8632.94, "end": 8642.5, "text": "meinst Garden Warfare, das war tatsächlich ganz cool. Oh, es wächst. Es gibt in jedem"}, {"id": 944, "start": 8642.5, "end": 8658.58, "text": "Spiel Modus. So, laden. Ich kaufe jetzt einfach mein komplettes Geld in Baum, was soll ich"}, {"id": 945, "start": 8658.58, "end": 8667.38, "text": "sonst holen? Ich weiß gar nicht, wie oft man den füttern muss. Wie oft muss man den füttern?"}, {"id": 946, "start": 8667.38, "end": 8675.5, "text": "100 Mal? Wenn ich höre, was, wenn ich höre? Sollen sich die Unten fürchterlich ändern,"}, {"id": 947, "start": 8675.5, "end": 8681.78, "text": "wenn man Must-Mustache, also Dings Schnurrbahn, eintippt? Battle for Neighborville, ja, das"}, {"id": 948, "start": 8681.78, "end": 8705.66, "text": "ist doch, das ist doch, ähm, das ist doch irgendein Garden Warfare, oder? Oh. Oh. Oh,"}, {"id": 949, "start": 8705.66, "end": 8720.66, "text": "oh. Diese Tipps, die habe ich alle, die habe ich unbedingt, äh, die habe ich gebraucht."}, {"id": 950, "start": 8720.66, "end": 8741.34, "text": "Super. Easy, laden. Kaufen jetzt noch zwei. Und schon ist das Geld alles weg. Geld wieder"}, {"id": 951, "start": 8741.34, "end": 8751.5, "text": "weg. Nächste Runde Survival. Huge Baum. Ja. So, und jetzt sollte ich mir noch irgendeinen"}, {"id": 952, "start": 8751.5, "end": 8758.22, "text": "Battlefield-League-Trailer angucken. Okay, zeig mal her. Das Spiel hast du in der Ba-"}, {"id": 953, "start": 8758.22, "end": 8783.3, "text": "Ah, ich hab mich vertippt. So, das da. What the fuck? Äh, kann man das groß machen? Ach,"}, {"id": 954, "start": 8783.3, "end": 8792.5, "text": "dieses TikTok, das kann man nicht groß machen, oder? Kann man das irgendwie groß machen?"}, {"id": 955, "start": 8792.5, "end": 8822.22, "text": "Nee, gibt kein Vollbild. Äh, also was sehen wir da? Ähm, das ist real. Das haben die"}, {"id": 956, "start": 8822.22, "end": 8834.82, "text": "nicht gefakt. Das haben die nicht gefakt. Wobei der Typ eben ziemlich ähnlich aussah"}, {"id": 957, "start": 8834.82, "end": 8843.58, "text": "wie der Typ in Battlefield 4. Na gut, das ist jetzt irgendwie unsinnig für den Trailer."}, {"id": 958, "start": 8843.58, "end": 8859.02, "text": "Das am Anfang sieht aus wie die Battlefield-3-Kampagne. Ich mein, das haben wir ja schon"}, {"id": 959, "start": 8859.02, "end": 8874.06, "text": "im Vorfeld gesehen. Doch, ich glaube, ich glaube tatsächlich, das ist real. Zumindest"}, {"id": 960, "start": 8874.06, "end": 8880.94, "text": "teils. Das ist der Typ aus Battlefield 4, Alter. Oder ist das doch gefakt? Zumindest"}, {"id": 961, "start": 8880.94, "end": 8892.26, "text": "sieht er dem NPC aus Battlefield 4 sehr ähnlich. Man weiß es nicht. Was jetzt? Der Link geht"}, {"id": 962, "start": 8892.26, "end": 8912.58, "text": "nicht. Sarex. Oder ist es doch fake? Reddit, Battlefield. Nee, ich bin mir nicht sicher."}, {"id": 963, "start": 8912.58, "end": 8933.46, "text": "Manches sieht mir, kommt mir sehr bekannt vor. Leak. Okay, doch kein Leak. Ähm. Aber mal"}, {"id": 964, "start": 8933.46, "end": 8937.38, "text": "davon abgesehen, wenn das der Trailer sein soll, ist das ganz schön zusammenhanglos."}, {"id": 965, "start": 8937.38, "end": 8945.02, "text": "Wahrscheinlich ist es ein Fake. Wahrscheinlich ist es ein Fake. Wahrscheinlich ist es ein"}, {"id": 966, "start": 8945.02, "end": 8954.7, "text": "Fake. Ach, keine Ahnung. Ich will jetzt keine Half-Life-Video gucken. Erstmal eine Runde"}, {"id": 967, "start": 8954.7, "end": 8960.74, "text": "Evoli Gassi führen, weil ich weiß, es ist kein Evoli. Was ist es denn überhaupt? Wenn's"}, {"id": 968, "start": 8960.74, "end": 8978.02, "text": "kein Evoli ist, was ist es denn? Puma schlafen. Stimmt, es ist 22.12 Uhr. Ich hoste jetzt"}, {"id": 969, "start": 8978.02, "end": 8988.98, "text": "den Frasier. Wait a minute. Get Right spielt Raid Shadow Legends. Okay, wenn sogar Get"}, {"id": 970, "start": 8988.98, "end": 8993.18, "text": "Right ein Raid Shadow Legends Placement macht, dann sollte ich es vielleicht auch machen."}, {"id": 971, "start": 8993.18, "end": 9009.86, "text": "Ja. Einer der bekanntesten CS-Spieler überhaupt spielt allen Ernstes Raid Shadow Legends."}, {"id": 972, "start": 9009.86, "end": 9019.78, "text": "Okay, vielleicht, vielleicht soll ich das auch machen. Vielleicht soll ich das auch"}, {"id": 973, "start": 9019.78, "end": 9029.42, "text": "machen. Ey, wenn sogar Get Right ein Raid Shadow Legends spielen, Alter. Es ist keiner"}, {"id": 974, "start": 9029.42, "end": 9054.22, "text": "worden. Der Friseur ist off. Tja."}, {"id": 975, "start": 9054.22, "end": 9070.38, "text": "Dann hoste ich jetzt den Pool. Oder wir hosten jetzt, wir hosten jetzt Miramizu. Lul. Original"}, {"id": 976, "start": 9070.38, "end": 9079.94, "text": "BoobCamp Stream. Nein, wir hosten den WoopTube. WoopTube Champ. Mach Raid, kein Host, okay."}, {"id": 977, "start": 9079.94, "end": 9088.58, "text": "Wir raiden jetzt meinen Poolstream. Was heißt mein Poolstream? Ist ja nicht mein Poolstream."}, {"id": 978, "start": 9088.58, "end": 9099.98, "text": "Ist ja, auch wenn es so aussieht. Wir raiden den jetzt. Also Leute, wir sehen uns bis morgen."}, {"id": 979, "start": 9099.98, "end": 9111.5, "text": "Macht's gut. See you."}]}