{"text": "das funktioniert bei dir? Guck mal kurz. Twitch braucht immer ein bisschen bis das am Start ist,bis kapiert er das online ist. Aber wo sieht man das jetzt? Vorhin stand da,dass Streaming startet und jetzt, wo ist das denn hin? Ah hier, warte, warte, warte. YouTube,Alter. Also Twitch ist on, Twitch ist on, aber YouTube hat es noch nicht gecheckt. Wahrscheinlichmuss ich einen Hick machen, jetzt live oder sowas. Ich glaube, ich habe es jetzt, jetzt, aha. Ah nice,perfekt, ich sage dir, wenn es on ist. Jetzt dürfte er bei mir. Twitch hat es auch kapiert,Twitch ist auch on. Moin, excellent, 5HatChat hier wieder am Start. Twitch hat es kapiert,YouTube hat es kapiert, bei mir ist es auch on. Wunderbar, ich muss dich hier mal muten,stream. Oh, hugepaint da kommt, perfekt. So. Oh, jetzt habe ich dein SSH, jetzt habe ich imStream dein SSH Public Key geleaked, das gibt schlimmeres. Oh nein, oh nein. So, okay,Discord lasse ich lieber zu, man weiß ja nie. Also Leute, wir sind am Start, super agil heute.13, Dankeschön für den Sub, 20 Monate, huge hyper subscription. Ja, wir warten jetzt mal,bis das alles so ein bisschen angelaufen ist. Leute, sag mal, ob die Musik bei mir passt,please. Ja, bei mir auch gerne mal in den Chat schreiben, wie es mit den Audioeinstellungenfunktioniert. Ich habe keinen Plan, es sollte passen, aber es ist ja immer so eine Sache. Ja,ich denke auch. Chat, ihr müsst mir auch mal sagen, ob dein Neulang genug, nicht laut genug ist. Ja,null ein Gast, das steht im Titel, genau. Wir sind heute zu zweit am Start und sind heute superagil und programmieren was zusammen. Wenn die Streams dann so weit online sind, erzählen wireuch auch was. Wir haben sowas noch nie gemacht, wir haben keinen Plan, wie das Ganze läuft.Normalerweise kann ich ja so vor mich hin labern, wie ich will und es ist keiner dabei. Ja, guckenwir heute mal. Ich bin echt gespannt. Es wird entweder richtig nice und es wird super funktionierenoder alles gecheat. Wahrscheinlich. Du hast doch Urlaub, oder? Nice. Weil ich habe gestern einVideo gemacht und habe angefangen mit, ja schön ist Feiertag und dann hat mir die Hälfte erzählt,es ist gar kein Feiertag. Bei mir ist es so, ich habe jetzt generell keine Vorlesungen. Ah, das ist natürlich praktisch. Deswegen ist das ein bisschen cheat. Einbisschen lauter soll ich nicht machen. Okay, mache ich. Konnte man das in Discord irgendwie direktmachen? Ja, doch, wenn du rechts klick auf mein Profilbild machst. Ah, Wahnsinn. Wobei, dann höre ichdich ja auch lauter. Du bist bei mir laut genug. Ich mache einfach im OBS. Ich mache einfach im OBS lauter.Da muss ich jetzt aber die Mario Kart Musik ein bisschen leiser machen. Das ist hier wieder Setup.Ich glaube, jetzt passt es. Sogar mit Hetzenerwerbung, ja. Mal gucken, ob bei dir die Leute auch schon am Start sind. Ich habe dein Chatoffen, zeig mal da. Bei mir sind die Leute am Start. Bei dir sind sie am Start. Vergessen Sie auch nicht, diepassenden Secure Coding Verfahren zu beachten. Natürlich. Also was erwarten die Leute von uns?Also selbstverständlich. Erstmal Daily Scrum Stand-Up. Kann man ein Board-Fit rausgeholt. ErstmalTasks verschieben. Ja, gar schon eine User-Story geschrieben. Ja, perfekt. So muss das sein.Alles schön agil. Das passt mit Ton. Wunderbar. Ja gut, ich würde sagen, wenn das alles technischsoweit passt, erzählen wir, was wir heute vorhaben. Absolut. Chat hier auf. Soll ich loslegen? Und zwar,wir haben uns überlegt, es wäre mal eine gute Sache, wenn wir einfach zusammen ein bisschenwas programmieren im Stream. Diesmal ohne Rute Passwort League, sagt mein Chat. Ja, ich kippemir Mühe. Das letzte Mal habe ich das Rute Passwort gelegt von der Kiste. Also wir habengedacht, es wäre mal eine schöne Sache, zusammen was zu programmieren im Stream. Das heißt,wir brauchen ein Projekt, was jetzt nicht so wahnsinnig umfangreich ist, was man auch machenkann, weil das ist ein Unterschied, ob man jetzt offline sitzt und davor sich hin programmiert oderhier live und die Leute zugucken, plus sich noch um die ganze Technik kümmern muss und man so wasnoch nie gemacht hat und eigentlich gar keine Ahnung, hat was passiert. Deswegen haben wir unsgedacht, wir machen einen Speedtest. Ich habe mir auch schon die passende Domain registriert,nämlich den speedchamp.org und wir werden einen Speedtest programmieren, wo man gucken kann,ja, wie viel Bandbreite man hat. Das ist jetzt nichts Tolles in dem Sinn, dass es noch nie dagewesen ist, aber ich habe so was noch nicht gemacht, zumindest noch nie so was fertigprogrammiert und zumindest, es ist vom Umfang her relativ klein. Ich denke mal, das gibt,was weiß ich, 200, 300 Zeilen Frontend, 200, 300 Zeilen Backend, also was überschaubares,was man jetzt ja auch hier in zwei, drei Stunden Stream hinkriegt und da gucken wir mal, ne?Yes, auf jeden Fall. Also ich habe so was auch noch nie gemacht. Ich meine, wer programmiert so inseiner Freizeit so ein Internet Speedtest, die wenigsten, aber ich denke schon, dass wir dasgut hinbekommen. So, auch wenn es vielleicht ein bisschen so scuffed ist oder so am Anfang,ich meine, wir müssen uns erstmal dran gewöhnen und einfach mal gucken, wie es funktioniert.Es geht auch darum, mal so ein bisschen so das ganze Drumherum an so ein bisschen zu zeigen.Richtig, genau. Wir fangen ganz von vorne an. Wir fangen an mit GitHub-Projekt anzulegen. Alsowir machen das ganz öffentlich. Ihr könnt dann reingucken, wie das aussieht danach. Ach,Moment, habe ich mich gar nicht auf GitHub angemeldet. Irgendwo habe ich mich auf GitHubangemeldet. Ob ich mich auf GitHub angemeldet? Ach, hier habe ich mich auf GitHub angemeldet.Perfekt. Also inklusive Repo anlegen und dann einen Server erstellen, dort das Ganze draufdeployen. Wir machen DNS-Auflösung für Domain-Name. Ich mache ein Zertifikat dafür. Also im Prinzipso alles, was man für so ein kleines Projekt braucht. Warum ist der Preis-Champ nicht aufGitHub? Ich hatte nicht vor, den Preis-Champ auf GitHub zu machen. Muss nicht sein. Tja,was gibt es sonst noch zu sagen? Ich glaube an sich nicht. Ich glaube, wir können eigentlichdirekt mal loslegen, das GitHub-Propositor zu erstellen. Genau, also folgendermaßen,wir haben uns das so überlegt, im Vorfeld schon ein bisschen. Diese Anwendung wird jawahrscheinlich bestehen aus einem Frontend, was ihr dann seht, wo man dann Sachen hochladenkann. Übrigens, danke für die ganzen Subs. Ich kann heute nicht jeden einzelnen Sub quasida zwei Minuten huldigen, weil das muss ich auch zu viele Sachen gleichzeitig konzentrieren.Also es wird ja auf jeden Fall aus einem Frontend bestehen, sowas hier bei Speedtest. Wie heißendie Speedtests? Net, die gibt es ja auch. Und es gibt dann im Prinzip so ein Frontend,wo man draufklicken kann und dann zeigt es dir an, wie viel Bandbreite man so hat undwelchen Ping. Und dann muss das Ganze natürlich auch noch ein Backend bestehen, wo man, jaman muss ja irgendwo was hochladen. Also sprich, man braucht zwei Komponenten davon. Oh nein,IP League, schon wieder schlimm. Chat ist schon reingehackt hier, ich sehe es schon.Das Botnetz aus Polen ist schon am Start. Aber sag es nicht so laut, sonst kommen diewieder an den Start. Leute, heute please, keine DDoS, kein DDoS, ja. Heute nicht. Das hatmir schon gereicht, das letzte Mal. Deswegen, das erste, wie man bei jedem super agilenProjekt anfängt, ist natürlich ein Git Repo anzulegen. Oder, wie mein ehemaliger Azubigesagt hätte, ein Jit Repo. Ein Jit Repo. Jit Repo, ja. Welches Jit Repo wollen Sieerstellen? Nein, nein. Ich lege jetzt einfach mal eins an. Wie nennen wir das Ding? Ichwürde sagen Speedchamp wie die Seite. Einfach einfach Speedchamp. Ich schaue dir dabei zu,ne? Genau. Teamwork, weil ein anderer macht es. Kannst ja, kannst ja den Stream bei direinplanen. Bei mir kannst du das Bild machen. Also. Wir machen gerade basically eine Reallife,Realtime Reaction auf dich. Genau, genau. Ich hoffe, es ist gar nicht so viel Verzögerung.Es dürfte nicht so viel Verzögerung sein. Ich glaube nicht, nee. Wade, Max wurde dasletzte Mal gedendost. Ja, wurde ich. Und du warst dabei, das weiß ich, weil ich habedich im Chat damals gesehen. Okay, also wir legen ein Git Repo an. Wir machen kein großartigesTemplate oder sonst was. Public das Ganze. Das heißt, ihr könnt euch das dann auch anguckenlive, während wir hier dran rumbasteln. Ich sage euch aber gleich, das muss ich jetztmal so disclaimer, falls irgendwas überhaupt nicht klappt, ne? Also wir werden jetzt heutenicht durchziehen, bis es dann wirklich funktioniert. Wir denken, es klappt so in zwei, drei Stunden,aber ja, Planung und Realität ist so eine Sache, ne? Müssen wir mal schauen. So, ichleg mal, ich mache einfach ein ganz normales leeres Repo ohne irgendwas. Gibt's Speedtestund ich lade dich gleich mal zu ein. Obwohl, ich muss dich wahrscheinlich, doch, ich solltedich zu einladen. Doch, du musst mich als Maintainer einladen. Genau, genau, mach ich.Weil sonst musst du irgendwie Pull-Request und Gedöns machen und so. Wir müssen es janicht übertreiben. Warte mal, wie ging das jetzt nochmal? Bin ich jetzt blöd? Ich habedich letztens doch auch erst zu was eingeladen. Wo war das denn nochmal? Manage Access glaubich, ne? Manage Access. Ja, Direct Access hier in weit. Du musst das Repo noch umbenennen.Wieso? Du hast es nicht Speedchamp genannt. Oh, ich habe Speedtest genannt. Oh nein. Hier,Abmahnung ist direkt raus. Das muss gleich gelöscht werden. Das muss gleich weg. Du kannstdas ganz oben, kannst du das, du kannst das auch rename, musst nicht löschen. Das kommtweg. Das muss von Anfang an richtig sein. So, jetzt nochmal. Also, New Repo. So, noch einStream kurz neu starten. Genau, Speedchamp. So, dann mal so, past public. Wir machen keinereadme, keine get ignore. Das mache ich dann gleich von Hand. Create Repo. Und jetzt fügeich dich mal hinzu. Jetzt bin ich mir nicht sicher. Muss ich dich da? Ich glaube, mankonnte nach den Leuten suchen, ne? Ich glaube auch. Dann wäre es einfach nur L. Da bistdu. Da. Minus. Hab dich. Easy. So, jetzt hast du Berechtigung. Wir hoffen, dass wir nixleaken. Irgendwelche Keys oder sonst wie. Man weiß ja nie. Okay, Repo ist am Start,noch nix drinne. Das heißt, wir können uns den ganzen Kram schon mal klonen. Ich hoffe,ich hab mein SSH Key hier. Ich muss jetzt mal gucken, ob ich noch ne Mail oder so bestätigenmuss. Ja. Dann hoffen, dass ich meine Mails nicht liege. Das ist jetzt egal. Das ist haltso dieser Hintergrund. Ja, da muss man echt aufpassen. Leute, ich verwende Vmware Workstation.Chat fragt mich gerade, was ich für eine Vmware oder Vm-Lösung verwende. Ich verwende VmwareWorkstation auf dem Desktop. Hast du, auf was bist du gerade unterwegs? Windows, Mac oderLinux? Ich bin auf Windows unterwegs. Ganz classic. Es gibt Leute, die Edge benutzen.Ja, ich benutze Edge. Was? Ich benutze tatsächlich Edge. Hin und wieder. Okay, kann man jetztseit der Chrome basiert ist, kann man sich das ja sogar auch geben. Chat hier auch wiederam Lästern. Wer benutzt Edge? Wer ist dieser Noel im Hintergrund? Ist das der Shithub-BMI-Rechner-Azubi?Nein, nein, nein, nein, nein, nein. Der Azubi mit dem Shithub, das ist her Endpunkt. Dasist allerdings nicht der Noel. Das sind zwei unterschiedliche Leute. Stimmt, aber gleichAnfangsbuchstabe. Ja. Ich kann es jetzt sagen, weil ich hab ihn gefragt, ob das geht. DerShithub-Azubi heißt Niklas. Also kann man das vielleicht ein bisschen unterscheiden?Nein, das ist er nicht. Das ist er nicht. Du arbeitest auch in Frankfurt mittlerweile,ne? Ich arbeite auch in Frankfurt, ja. Wir sind uns aber noch nie über den Weg gelaufen.Ne. Nur auf YouTube. Also wir kennen uns nicht. Es ist nicht der Shithub-Azubi. Genau. Daswäre aber schon lustig. Das wäre witzig gewesen, ja. Gut. Also, ja, ich hab angelegt.Repo ist am Start. Du müsstest jetzt klonen können. Und ich würde sagen, ich leg jetzteinfach mal, dass du anfangen kannst, ich leg jetzt einfach mal ein.NET-Projekt an.Oder wie wollen wir das überhaupt machen? Das ist eh die Frage. Also was nehmen wireigentlich für Technik dafür? Wie gesagt, wir wollen einen Speedtest programmieren.Das zeigt die Leute ja noch. Hallo? Ich firefox restarten, Alter. Nerv nicht. Okay, restarten.Ähm, genau. Wir wollen einen Speedtest programmieren. Gibt's ja jede Menge Sachen. Es gibt jazum Beispiel auch schon Lieber-Speed-Tests und solche Geschichten. Das sieht dann soaus. Wobei ich will es nicht zeigen, sonst ist noch mehr Leak angesagt. Nur gut. Alsowie wollen wir das machen? Was ist denn da so eine gute Kombi? Also ich persönlich magja.NET C-Sharp im Backend und ein Backend in irgendeiner Art und Weise für Datei-Upload,Datei-Download und gucken, wie lange das braucht, wenn wir brauchen. Absolut. Also ich denkemal dadurch, dass wir das dann zu zweit dran arbeiten, teilen wir auf, ich mach Frontend,du machst Backend. So war es geplant, ja. Und dann gucken wir einfach, wie wir das dannhinbekommen. Ich mein, das Frontend, das wird jetzt nicht, das ist nur viel Aufwand sein.Ich guck dann mal, dass ich das hinbekomme, vielleicht irgendwie cool aussehen zu lassen.Kommt drauf an, wie fancy das aussieht, ne? Richtig, richtig, genau. Also wenn wir dasauf speedtest.net-Niveau machen wollen mit so animierten, krassen Sachen, muss ich malgucken. Ich bin jetzt auch kein CSS-Profi. Genau. Aber wir kriegen da schon was Schickeshin. Chat meint, wir sollen den Cobalt programmieren, das Backend. Alter, so ein Cobalt-Backendwäre jetzt echt schon... Erstmal ein IBM Mainframe im Keller für eine Runde Cobalt.Bin mir nicht sicher, ob man Web-Anwendungen in Cobalt programmieren kann, aber im Zweifelsfallschon. Im Zweifel kriegen wir das hin. Ob wir das hin kriegen, weiß ich nicht. Man kannes auf jeden Fall machen. Das ist Enterprise. Das ist richtig, Business Enterprise. Ja,und dann noch ne, wie heißt dieses Java-Zeug, nicht Webforms, so Applets oder sowas, wasrichtig oldschool ist. Oh Gott, das sind Java-Applets. Ja, mit Browser-Plugin. Nein, wir machenes nicht in Azure-Chat. Wir machen es heute auf einem Server von Hetzner, den werde ichgleich anlegen. Das heißt, ich würde sagen, wir machen jetzt erstmal Folgendes, dass wiranfangen können, wo wir nicht so viel Leerlauf haben. Ich lege jetzt einfach mal zwei Ordneran. Richtig, du legst die Ordner an, ich clone mir das und dann... Wir machen einfach so,wir machen zwei Ordner. Wir machen zwei Ordner, Speedtest-Backend, Speedtest-Frontend, dasswir ein bisschen unabhängig da voneinander rumwursten können. Im Backend-Ordner macheich dann meine.NET-Anwendung und im Frontend kannst du dein Zeug machen, komplett unabhängigvon dem, was ich mache. Wir haben uns überlegt, dass wir uns gegenseitig zugucken können.Muss ich vielleicht auch gleich nochmal zeigen. Wir haben uns hier in Visual Studio Code geadded,das können wir gleich mal ausprobieren, ob das funktioniert. Das gucken wir mal. Dannkönnen wir uns nämlich gegenseitig zugucken, wie wir das Ganze programmieren. Oder wenneiner mal sagt, guck mal bei mir rein, dann können wir schauen. Also, gucken wir unsdas mal an. Also, ich habe die Ordner angelegt, wir machen hier mal... Wir bräuchten nocheine Git-Ignore-File, glaube ich. An sich ja, beziehungsweise du kannst sie dann auch inden jeweiligen Unterordnern einfach drin haben und dann Projekt bezogen. Stimmt, ist wahrscheinlichbesser. Gut, dann lade ich jetzt einfach mal hoch. Also, mit React genau wird automatischeine Git-Ignore erstellt mit dem Boilerplate-Code. Speed, Champ, Backend. Ich werde jetzt einfachmal da drin schnell ein.NET-Projekt erstellen, committen und hochladen, dann kannst du dirdas Ganze klonen. Oh nein, mein Trial-Zeitraum ist zufälligerweise wieder auf 30 Tage hoch.Geiler gesehen. Gleich gibt es Root-Passwort liegen. Na, ich versuche, Leute, ich versuchenicht das Root-Passwort zu liegen. So, also, legen wir mal eine neue Solution an. Undzwar im Ordner... Wo habe ich das jetzt hingemacht? Speed, Champ, Speed, Champ, Speed, Champ,Backend. Man kann es ja auch übertreiben. So, Create Directory for Solution. Nope. Was?Absolute Parts? Hüte. Home, Max. Wollen sie jetzt aber wissen hier. Alles klar. Das istnicht so agil. Das ist nicht so agil, nee. Solution Name, Speed, Champ. Wie oft ichdas Wort heute wahrscheinlich noch schreiben werde. Ey, bei jedem Speed, Champ ein Shot.Ich sage, wie es ist. Also, ich habe hier Orangensaft. Das reicht wahrscheinlich nicht.So, also wir brauchen ASP.NET Core Web-Application. Empty. Wir machen eine Web-AP. Letztendlichwird das Backend relativ übersichtlich. Was soll das Speed, Champ sein? Eine Speed-Test-Seite,die wir hier live zusammen heute im Stream entwickeln werden. Komplett von Anfang anbis hoffentlich Ende. Wir werden sehen, aber kriegen wir, denke ich, hin. Gibt es jetztetwas, was ich hier gemacht habe? Project Files. Zum Teufel, da legt das hier nochmaldrin an. Weg. Kann ich jetzt irgendwie dazu überreden, dass er das im gleichen Verzeichnismacht? Ich verschiebe den Kram einfach, klein mir wurscht. So, also wir wollen keine Authentifizierunghaben. Wir benutzen C-Sharp im Backend. Put Same Directory. Ja, schön. Create. Ich werdedas jetzt einfach nochmal kurz umschieben und dann passt das. Das kriegst du hin. Ibelieve in you. Genau, dann kannst du dir das Ganze... Ich lasse die Fall... Ich mach nochgar nichts drinne. Ich lasse... Guck, der Chat weiß es schon wieder besser. Das Chatist schon wieder triggert. Bin ich jetzt blöd? Wo ist es denn? Was? Sag mal, hä? Wo?Wozu? Wo habe ich das jetzt erstellt? Sitze, Leute, es fängt schon bei den einfachen Sachenan. Chat schreit schon wieder rum, das ist falsch, das ist falsch. What the fuck? Chat,wo habe ich es falsch gemacht? Ich erstelle einfach schon mal mein Projekt und move dasdann einfach auf. Mach das, mach das. Bin ich jetzt total verwirrt? Home, Max? Okay,also ich hätte nicht gedacht, dass es schon am Projektanlegen scheitert, aber man kanndas doch sicherlich hier öffnen. Show im File Manager. Ist doch was da? Leckt bei euchim Stream manchmal, schreiben die Leute bei mir in den Chat. Der Stream? Ich weiß nicht,vielleicht kann die Kamera ein bisschen laggen, aber der Stream sollte an sich eigentlichoptimal sein. Ja, also das sollte nichts sein. Ich weiß nicht, Leute, leckt es bei euch,ich habe hier die Vorschau an, da ist absolut gar nichts laggy. Ach, ich bin blöd, ichhabe es wirklich im falschen Ordner erstellt. Hier ist es. Okay, YouTube zeigt mir aucheine gute Verbindung. Wer streamt denn auch mit WLAN? Ja, ich kann mir keinen LAN-Kabelhier durch die Wohnung ziehen, das geht nicht. Das wäre hässlich. Aber es ist 5 GigahertzNetz, das passt. Kannst ja mal den Speedtest dann machen. Okay, der Stream hängt sich manchmalzusammen. Streamst du über WLAN? Ich streame tatsächlich über WLAN, ja. Okay. Die Buchsenin meiner Wohnung, die sind da so scheiße gelegt, dass ich basically an meinem Arbeitsplatzmir keinen LAN-Kabel verlegen kann, außer dass ich jetzt quasi einmal komplett um meinegesamte Wohnung mir eins ziehen müsste. Und ich will es halt nicht direkt über, klardurch die Wohnung. Ja, zur Not 100 Meter LAN-Kabel. Habe ich hier für Dinger angelegt, ey. Ichfail. Jetzt lag das. Oh, vielleicht muss ich meinen Bitrate einfach ein bisschen runtermachen. Ach, tatsächlich. Okay, sollte eigentlich nicht laggen. Ich schraube mal die Bitraterunter. Ah, da muss ich den Stream selber wahrscheinlich kurz neu starten, ne? Also in OBS nicht. Dukannst in OBS normalerweise die Bitrate ändern, es sei denn, wo das nicht funktioniert, ist,wenn du über NVIDIA Decoder streamst. Dann geht das glaube ich nicht. Ja, okay, es lagauf jeden Fall. Ich kriege da gerade auch Benachrichtigungen dafür. Echt? Also ichstreame mit Streamlabs OBS. Die Beeinstellungen dürften ja basically the same sein. Ja, ne,dann mach mal die Bitrate ein bisschen runter. Aber Chat, bei mir lag nichts, oder? Gucken,was die Leute sagen, aber bei mir sollte eigentlich alles in Ordnung sein. Hoffentlich streamter wenigstens über Wi-Fi 6. Ich glaube kaum einer hat Wi-Fi 6 Geräte. Oder streams überWi-Fi 6? Nein, ich glaube nicht. Ich glaube nicht. Okay, also ich habe jetzt den Kramangelegt, ich push das jetzt mal aufgetappt. Oh nein. Warte, ich will kein neues Erregnungsverstärkterhaben. Mach mal Git Ignore, dass ich den ganzen Kram nicht mit hochlade, den ich nicht brauche.Also wir wollen das ganze IDE Zeug, brauchen wir nicht. Und wir brauchen Out und Bin auchnicht. Okay, wunderbar. Jetzt habe ich einen zweiten Stream gestartet. Oh fuck. YouTube,das wird ein Speedtest. Ja Leute, wir haben noch ein bisschen Anlaufschwierigkeiten gerade.So dumm bei YouTube. Ich verstehe es eh nicht. Die wurschteln seit Jahren an ihrem YouTubeStreaming Zeugs rum und kriegen es aber echt nicht gebacken. Aber gar nicht. Sehr, sehr,sehr komisch, ne? Egal, müssen die Leute den neuen Stream öffnen. Link zum Teilenabrufung.So, jetzt passt das. Git Commit A minus M. Init. Git Push Origin Master. Perfekt. Allesklar. So, ich habe jetzt nach sehr viel Hin und Her und sinnlosem Rumgeschieben geschafft,dass unser GitHub Projekt zumindest steht. Wunderbar. Chat gibt ihr recht, also YouTubeist schlimm geworden. Was ich auf YouTube nicht so genau verstehe, ist, die haben jamal großartig angekündigt, sie wollen jetzt auch im Game Streaming Bereich Twitch Konkurrenzmachen. Und das Einzige, was die gemacht haben, ist, ihre normales verkacktes Streaming genommenund ein Darksteam dran geklebt. Und da tun jetzt irgendwie als wäre das super toll. Alsoich habe echt keine Ahnung, warum man das auf YouTube streamen soll. Ich verstehe dasauch nicht. Ich verstehe das auch nicht. Ey, zur Not, wenn das jetzt wieder Problememacht, ich mache mir einen Twitch-Account und let's fucking go. Ne, das muss jetzt eigentlichfunktionieren. Aber sollte gehen. Sollte gehen. Ich will doch nur ein bisschen JavaScript-Spaghetti-Codemachen. Genau. Ich muss schon die ersten Leute bannen, weil mir da irgendwie blödes Zeugrumgespammt wird. Oh ne, heute übrigens das Ausrufezeichen heute stimmt nicht. Wir spielenheute kein Half-Life-Mod. Nein, nein. Hab ich über euch die richtige Kategorie? Ja, Scienceand Technology, das passt. Ach, jetzt ist das wieder nur... ach, egal, funktioniert. Leutesind da, wunderbar. Top. So mehr oder weniger. Jetzt müssen wir noch den neuen Chat holen.Dann brauchst du dann gleich noch mal den Link zu mir in den Kommentaren. Genau, kannstdu machen. Teilen, zack. 300 Zuschauer, was ist da los? Ja, die Leute haben heute freiund wollen nichts. Die haben schon darauf gewartet, dass sie uns hier beim Failing zuguckenkönnen. Ist so, ist so. Ich gucke mal. Freitag Mittag. Weißt du, bei dem Wetter, was willstdu da auch anderes machen? Es geht eigentlich bei mir. Es ist gar nicht so wild. Es hatheute Morgen ein bisschen gewittert, aber jetzt ist sogar ein bisschen Sonne. Geht. Alsohältst Hälschin Grenzen. Hier ist es richtig heiß gefüllt. Richtig. Ja, es ist, es istrichtig, es ist ultraspül. Genau, genau. Bovel. Also dein Stream ist immer noch off. Ja ja,ich habe einen neuen Link jetzt. Ach so. Ja, wie gesagt, ich konnte, ich konnte das nichtmal. Ich sehe es. Ich sehe es. Okay, wunderbar. Meine Güte, es ist so fail auf YouTube. Esist total bescheuert. Es ist total bescheuert. Gut, wunderbar. Ja, sag, wenn es so weit ist.Also ich habe den Gramm jetzt hochgeladen. Naja, also ich, ich bin ready basically. Chatmöchte wissen, mit welchen Sprachen wir das programmieren. Also ich würde mal sagen,wir sind uns noch nicht so hundertprozentig sicher, was es jetzt im Detail alles wird,aber Sprachen können wir schon sagen. Wir machen Backend. Backend wird.net, C-Sharp,Frontend wird logischerweise JavaScript, was auch sonst. Wird schwierig und du machstwahrscheinlich in React. Genau, ich mache das mit React. Da habe ich so am meisten Erfahrung,ist an sich natürlich auch Overkill. Klar, so ein bisschen, aber wäre ja sonst, wäreja sonst langweilig. Das heißt Frontend mit React. Gucken, ob ich mir noch irgendeineCSS-Library hinzufüge und gucken wir mal, dass das passt. Hast du gesehen, dass manjetzt mit Blazor, dass die jetzt auch angefangen haben, mit C-Sharp in den Browser zu bringen?Mhm, das Blazor WebAssembly und so weiter. Das wollte ich mir auch mal C-Sharp mal anschauen,weil das an sich echt nice ist. Ja, also ich muss sagen, ist meine persönliche Lieblingssprache,wenn es halt nichts gibt, was dagegen spricht. Es gibt ein paar, gibt Projekte, wenn du irgendwieeinen Bootloader programmieren willst oder sowas, dann ist weder JavaScript noch C-Sharpwahrscheinlich das Mittel der Wahl, aber ansonsten ist das echt cool. Was ich bei Blazor ein bisschendumm finde, ist, also immer noch, ich glaube, das werden sie noch fixen in Zukunft, Blazor ist ansich ein bisschen langsam im Vergleich zu JavaScript, aber es ist halt ein riesen Download. Also wenn dudas starten willst, dann muss ja komplette.NET Runtime als WebAssembly runterladen. Du mussterst mal irgendwie, keine Ahnung, 15 MB oder so downloaden, dass die Seite überhaupt eine Chance hat,zu starten. Mhm, das stimmt. Aber ich glaube, das ist eine coole Sache. Generell, ich glaube,generell so mit WebAssembly kommen noch so ziemlich coole Sachen im Webbereich. Ja,denke ich auch. Gerade was Spiele und High-Performance-Sachen angeht oder wenn diemal anfangen, irgendwann so Dinge wie Photoshop oder so umzuziehen, dass es im Browser läuft.Auf jeden Fall. Ich fühle mich wie so ein Rentner, weil ich die Schriftgröße von meinem Editor sogroß habe, damit der Streamdata einigermaßen... Ich habe es auch immer mega fett. Aber ich hoffe,es funktioniert. So, ich habe jetzt auch mal ein Projekt offen. Wir können das jetzt mal mitWishlist Studio Code gucken. Chet fragt gerade, wie willst du denn eigentlich die Geschwindigkeitmessen von dem Up und Download? Soll ich da mal kurz was zu zeigen? Erzähl, erzähl. Also,wir haben uns im Vorfeld so ein bisschen Gedanken schon gemacht. Es gibt von Mozilla einen Artikeldazu. Mit Mathematik, ja, das stimmt. Ein bisschen rechnen muss man dabei. Zum Glückin Studierst du Informatik, da ist das kein Problem. Da kriegen wir das hin. Quasi UploadSize geteilt durch Zeit. Das sind schon Big Brain Quick Maths, was man dafür braucht. Aberwie man das macht, ich habe einen Artikel von Mozilla gefunden. Binary Upload oder sowas. Wirwerden das, genau hier, Sending and Receiving. Ich kann dir mal den Link schicken. Falls duden später brauchst. Siehe Discord. Die haben ein Beispiel hier von Mozilla und wir werden daskomplett ohne viel Overhead machen. Das heißt, wir senden wirklich Binary Zeug. Also wir machenjetzt kein Form Upload oder sowas, wo dann quasi ein 10% oder so der hochgeladenen Daten so Overheadsind, sondern wir schieben wirklich Bites hoch. Und das ist hier neu. Da brauchst du einen halbwegsneuen Browser. Was heißt halbwegs neuen Browser? Halbwegs neuen Browser. Ein Browser, der älter ist,also jünger ist als drei, vier Jahre. Und da kann man jetzt direkt Bites hochladen. Und wirwerden einfach, haben wir uns jetzt überlegt, so ein 20 MB Bite Array nehmen und einfach hochladenund gucken und auf dem Server messen. Oder im Kleinen messen, müssen wir mal gucken, wielange der Upload dauert. Und dann sollte es relativ simpel sein. Wir wissen, dass wir 20 MBhochgeladen haben und wir wissen, wenn wir das messen, wie lange das gedauert hat. Und von derTheorie hier ist dann Upload Size durch Upload Zeit, ja, die Geschwindigkeit. So weit in der Theorie.Wir sollen mal schauen, wie das Ganze funktioniert. Und das Gleiche im Download auch. Genau. Es wirdjetzt nicht so detailreich sein, aber das ist ja auch, ich denke mal, am Anfang noch nicht der,das sind nur zwei. Hauptsache, da steht irgendeine Zahl in Emmet oder so. Und dann haben wir das.Und dann so Problematiken, weil wir können jetzt zum Beispiel dadurch jetzt nicht großeigentlich den Ping messen. Das stimmt. Wir können vielleicht höchstens sagen,okay, wie lange dauert, bis die Antwort kam, bis zur nächsten und so weiter. Deswegen werdenwir das in so in dieser ersten Version so ein bisschen außen vor lassen. Genau. Ob wir dairgendwie so nah ran kommen an den Ping wie möglich. Genau. Wir werden einfach mal probieren,dass wir jetzt irgendwas halbwegs funktionieren, das hinkriegen. Und dann können wir das ja nochein bisschen schöner machen. Ich sehe bei mir im Chat schon die Leute, das könnte man doch auchlocker mit WebRTC machen. Jaja, könnte man sicherlich alles machen. Wir könnten überWebSockets machen. Wir könnten über WebRTC machen oder sonst was. Wir beschränken unserstmal drauf für die erste Version. Wir schieben einfach ganz normal mit einem Postrequest Zeughoch und laden Sachen runter und messen, wie lange es dauert. Und wenn das geht, kann mansicher überlegen, wie man weitermacht. Exactly. Genau. Ja, so sieht es aus. Okay,dann lass uns mal schnell probieren, ob Visual Studio Code funktioniert. Ich starte mal kurzeine Collaboration Session in der Hoffnung, ich leake den Join Link nicht. Das wäre nämlichziemlich blöd jetzt. Code. Der Chat wartet schon drauf, ich sehe es schon. Gibt es schonein agiles Jira-Board für das Projekt? Ah, stimmt. Ich weiß gar nicht. Das kann man aber bei GitHub.Bei GitHub kannst du Boards erstellen. Stimmt, stimmt. GitHub-Issues kann man machen, ja. Ganz,ganz wichtig. Du kannst auch Cumber-Boards erstellen auf GitHub mittlerweile. Jawoll. Endlich. Endlich.Da habe ich drauf gewartet, dass wir und da müssen wir vorher, aber wie du gesagt hast,wir müssen erst noch ein paar User-Stories definieren. Ja, das stimmt. Und Tribe-Meetings,ganz wichtig. Okay, Live-Share. Ich versuche mal wie Sign-In mit GitHub. Will mich das veräppeln?Ich habe mich eben schon Sign-Int. Lass mal gucken. Ich bin auch drin. Ich nicht. Das istnatürlich blöd. Okay, Chat, ihr müsst jetzt mal kurz weggucken. Ich blende euch jetzt aus.So, ihr dürft jetzt nix sehen. Authorize. Open. Ja, mach. Wishlist Studio. So, sollte eigentlich,sollte eigentlich jetzt funktionieren. Ich mache mal wieder, mache mal wieder an. Guckjetzt mal ins Clipboard, dass ich nicht jetzt den Invite-Link irgendwie leake. Nee, nee,habe ich nicht. Okay, ich mache euch wieder an, Chat. Die Leute geiern immer so krass drauf,dass wenn was liegt, ey. Aber kann ich schon nachvollziehen. Okay, ich bin, Moment. Immernoch Sign-In? Was ist das schon wieder? Writing information to keychain failed. Ist das jetztneueste GitHub-Kryptowährung? Blockchain-Login, oder? Dein Login kann nicht auf die Blockchaingeschrieben werden. Deswegen können wir uns den Code in Visual Studio nicht teilen. Ach,jetzt geht's. Okay, alles klar. Invitation-Link has been copied to Clipboard. Ganz, ganz schlechteIdee. Ganz schlechte Idee. Ich invite dich aber vorher mal. Invite-Contact. Du müsstest jetztwas gekriegt haben. Ich schau mal. Also, ich habe dich. Yes. Ich habe accepted. Okay,joining. So, und jetzt mache ich mal kurz mein Clipboard leer. Clear. Und mach den Chat nochmal schwarz. Und gucke, ob es aus dem Clipboard raus ist. Ja, okay, wunderbar. Nein, sind nichtaus dem Clipboard. What the fuck? Alter, die wollen jetzt nicht ernsthaft, dass ich neustarte, dass es aus dem Clipboard verschwindet oder wie, oder was? Okay. Doch. Mach mal nicht.Egal. Man sieht es eh nicht. Man sieht es eh nicht komplett. Man sieht es eh nicht. MeinClipboard-Manager ist zu klein. Also, man sieht gar nicht den. Ich müsste es quasi explizitauswählen und dann irgendwo reinpasten. Man sieht das gar nicht in der Historie. Alles klar,alles liegt. Wunderbar. Bist du getjoint? Ich bin getjoint. Ich sehe jetzt. Siehst duProjektfiles und so? Yes. Ja, perfekt. Wunderbar. Da können wir anfangen. Was ist denn der SpeedChamp? Wir versuchen, eine Speed-Testing-Seite zu bauen. Heute live im Stream zusammen. DanielKuell kümmert sich ums Frontend und ich kümmere mich ums Backend. Lass uns doch mal zusammenin der Datei gehen und gucken, ob es funktioniert. Ich bin gerade mal in dem Controller drin.In dem Vettacontroller. Ist ja auch ein gutes Feature für unseren Speed-Test. Das ist dasStandard-Web-Abi-Projekt. Da kriegst du das dabei. Heute ist es... Was? Sweltering? Whatthe fuck? Ist das Schwül? Was ist Sweltering? Chat, Englisch-Profis, was ist Sweltering?Okay. Wenn der Chat das sagt, dann muss das so stimmen. Chat weiß sowas immer. Okay,im Prinzip scheint es zu funktionieren. Kannst du auch was reinschreiben? Ja, hab ich schongerade. Hast du schon? Gut. Wunderbar. Das funktioniert. Wunderbar. Im Prinzip werdeich jetzt eh Folgendes machen mit dem Controller. Der kommt jetzt erstmal weg. Okay. Ich habnoch keine Permissions zu pushen. Echt nicht? Hast du nicht? 4-0-3 unauthorized bekommen.Für die Wahrscheinlichkeit kann ich nicht direkt in den Main-Branch pushen. Müsstestdu eigentlich? Ich hab nix extra protected oder so. Guck mal hier. Settings. Ich habManage Access. Du bist dabei. Du bist auch eingeloggt, oder? Nee, Pending-Invite. Duhast noch nicht angenommen. Ich hab noch nicht angenommen. Stark. Okay. Daran liegt's.Weil jetzt hätte mich das echt gewonnen. Ich hab dich ja auch letztens eingeladen.Ging sofort. Hä? Ja, das stimmt, das stimmt. Okay, dann muss ich mal gucken, wo diese Mailankam. Ray Cohn, wir programmieren einen Schnelltest, einen Internet-Speedtest zusammen. Genau.In der Hoffnung, dass du... Ah, hier ist die Invalid angekommen. Ach, ich wundere michschon die ganze Zeit, warum in deinem Chat nix mehr kommt. Ich hab noch den alten Chatauf. Ich muss den neuen erstmal wieder auspoppen. So, Accept Invitation. Okay, wunderbar. Jetztkann ich es nochmal probieren. Einen Corona-Schnelltest, einen Speedtest. Ohne Scheiß. Könnten wireinen Corona-Schnelltest programmieren hier? Wir werden reich. Online-Frontend-Corona-Schnelltest.Weißt du, du musst unten in dein Maussensor reinhauchen. Ey, das wär doch mal geil, oder?Dass da nächstes Millionen-Start-up ist am Start. Da seh ich uns. So, wo ist denn jetztmein... Visual Code Studio A. Also ich würd vorstellen, wir machen das so. Wir lassen diesesVisual Studio Code hier offen mit dem Code-Share, aber jeder wurstet in seiner eigenen Idee rum.Genau. Na, da kommen wir uns auch nicht in die Quere. Du bist hier im Frontend-Ordner,ich bin im Backend-Ordner. Wir müssen uns erstmal überlegen, wie wir das Backend-Technischüberhaupt machen wollen. Ich muss dir ja quasi die Routen zur Verfügung stellen, dass duwas machen kannst, ne? An sich brauch ich die Routen schon, bevor ich das überhaupt anfangenkann. Ja, denk ich auch. Im Endeffekt könntest du die Routen bereitstellen und da einfachmal irgendwie so ein Sleep reinmachen. Ja, kann man machen. Damit ich schon mal so quasimit so Metadaten arbeiten kann und den Rest gucken wir dann, wenn's soweit ist. Genau,ich würd sagen, wir müssen es ja nicht komplizierter machen als sonst wie. Wir machen einfachslash speedchamp im Controller. Das heißt, da kannst du dann deinen Upload starten.Ich mach ein slash speedchamp und ich mach wirklich wie du sagst, ich mach einfach einSleep rein, dass du gucken kannst, dass das... Wobei, ich mach kein Sleep rein, ich geb direinfach irgendeine sinnlose Jason-Antwort, dass du siehst, dass es funktioniert. Stark.Machen wir so. Danach können wir gucken, wie wir das machen. Wir müssen uns eh überlegen.Da kann der Chat sich auch mal Gedanken zumachen. Wie würdet ihr das machen, Chat? Sollen wirdas möglichst cheat-sicher machen oder nicht? Weil die Sache ist die, wenn man das im Frontendmisst und ich glaube speedtest.net macht das im Frontend, da kann man relativ einfach Ergebnissefaken. Glaub ich, ich weiß es nicht. Wenn man das rein im Frontend misst, dann kann mannatürlich bescheißen. Ja, da kann ich da übergeben, was ich will. Oder sollen wirdas im Backend messen, dass quasi der Server überprüft und das in irgendeiner Art undWeise in der Datenbank speichert, dass man sich die Ergebnisse nachher abrufen kann.Könnt ihr euch mal überlegen, was ihr dafür am sinnvollsten haltet. Backend, sagt derChat. Ja, ich finde auch, wir probieren es einfach mal. Dann messe ich das und du pushteinfach wie verrückt immer 20 MB rauf und ich messe, wie lang es dauert. Okay, ich legejetzt aber erstmal einen Controller an mit slash speedchamp ohne irgendwas. Genau. Duhast bei dir lokal auch irgendeine.net-Taste starten kannst, oder? Ja, du müsstest mirdann nur sagen, wie. Ja, mache ich gleich. Ich habe.net installiert, Version 5 und wenndu mir dann sagst, wie ich das irgendwie zum Laufen bekomme. Du musst das einfach pullenund.net run drinnen eingeben, fertig. Ja, okay, easy. Frontend wird natürlich in Blazergemacht. Nein, Frontend wird wahrscheinlich in React gemacht. Genau. Speedchamp-Controller.Und nicht mit Angular. Angular. Und nicht mit Angular. Angular, ja, da hat mal ein Chatgeschrieben, da mag jemand mehr Angular. Oh, oh, oh. Verstehe ich gar nicht. Kann ich nichtnachvollziehen, wie man, wie man Angular mehr mögen kann? Aber jedem das eine, ne? Ihrwisst, ich bin, ich bin Vue.js-Fan und letztendlich soll jeder nehmen, was er will. Ja, im Endeffektist halt Angular nahezu, weil es halt ein komplettes Framework abbildet, ne? Du hastja mit Vue und React eher so Libraries, die dir den Vue-Layer darstellen und mit Angularhast du halt wirklich ein komplettes Framework, was auch noch Routing mit reinbringt und Cachingund alle möglichen Sachen, der so was wie React nicht out of the box mitbringt. Ja,ich denke, wenn man so im Enterprise, Business, was auch immer Umfeld ist und irgendeine Riesen,irgendeine Riesenanwendung macht, dann mag das sinnvoll sein, aber ja, für unsere Zweckejetzt vielleicht nicht so. Das stimmt, das stimmt. Also, was brauchen wir denn jetzt?Ich hab jetzt einen Controller angelegt, der Meinung ist, er geht nicht. Ach so, hier,dann, wie machen wir das? Wir machen Postrequest, oder? Postrequest, weil du musst ja Zeug hochladen.Du machst ein Postrequest, weil ich muss Zeug hochladen, ja, genau. Wir machen Post,und zwar wir machen ein Post unterhalb von slash speedchamp. Ich muss mal, ich mussmein Outlook schließen, weil jetzt bekomme ich sonst die ganze Zeit Meldungen, weil LeuteIssues in dem Weight erstellen. Ernsthaft? Chad, reißt euch zusammen. Es war klar, warklar, war klar. Wann kommt der Cobalt-Stream? Macht ihr nur, macht ihr nur. Der Cobalt-Stream,du wirst lachen, ich hab einen Cobalt-Stream gemacht letztes Weihnachten und das war grausam.Ach Gott. Ja, also Cobalt war wirklich nicht, war kein Spaß. Ich mach jetzt mal ganz schnellhier den Controller fertig, dass du was machen kannst, und dann guck ich mal bei dir mitin den Stream, ob du das gestartet kriegst. Ich überleg grad, was machen wir jetzt hier,wir warten einfach. Await, Task, Delay, was weiß ich, 10 Sekunden, ja, komm, eine Sekunde,reicht, fertig. Bestow, also das ist hier die hohe Kunst. So, ich hab jetzt einen slashspeedchamp gemacht, der eine Sekunde wartet. Ja, okay, wunderbar. Ich könnte schon einbisschen was einlesen, aber das mach ich gleich, ich pushe das jetzt erstmal und dann könnenwir's machen. Achja, die Domain hab ich schon gekauft, Leute. Also speedchamp.org hab ichschon gekauft. Da muss ich mich übrigens auch gleich noch einloggen, das machen wiralles. Ich pushe dir das jetzt, dann kannst du dir ein bisschen Gedanken frontendmäßigmachen, weil ich muss am Ende wahrscheinlich einfach nur einlesen, also wahrscheinlichist meine Seite back-end technisch nicht so lang, und dann mach ich die ganzen Server-Geschichtenin der Zwischenzeit. Ja, mach das auf jeden Fall, ich weiß es. Okay, also slash speedchampist am Start. Willst du den Jason zurückhaben? Ach komm, einfach zum Aufrufen jetzt erstmal,dann können wir gucken. Sobald du was anderes brauchst, sag einfach Bescheid, dann machenwir das. Wettervorhersage kann weg. Delete. Bei mir fragt im Chat, warum Windows OS fürdie Entwicklung? Gute Frage. Na ja, das ist basically das einzige, was ich habe. So, ichhab noch einen Mac, aber auf dem entwickle ich nicht gerne. Es hat sich halt einfach ergeben,dass ich Windows benutze, weil ich da so mit den Tools am familiärsten bin. Okay. Istjetzt kein, mein Gott, jetzt nichts krasses. Nee, also ich denke auch, es soll jeder dasnehmen, wo er am besten mit klarkommt. Ich bin da schon längere Zeit von weggekommen,mir zu sagen, hey, die Leute, ich weiß nicht, ich bekehr keine Leute mehr. Auch im privatenBereich nicht mehr, wenn da einer sagt, er benutzt Windows, da muss er im Zweifelsfallmit leben, wenn ich sag, kann ich dir nicht helfen, da hab ich keine Ahnung von, aberich versuche nicht mal die Leute zu bekehren, so nach dem Motto, ja verwende Linux, verwendedas, weil dann kommen sie zwei Wochen später an und wollen, dass du ihnen hilfst und dannregen sie sich noch auf, dass du dran schuld bist, weil du so einen Mist empfohlen hast.Nee, nee, nee, nee. Ja, das stimmt, das stimmt. Du hast was gepusht, hab ich gesehen. Ichhab was gepusht, ja, das muss man es wahrscheinlich auch angewöhnen, immer erst einen Pull zumachen, bevor wir dann was pushen. Ich pull. Hat funktioniert. Oh, ist im Frontend, hastschon hier Scaffold Project. Ich hab schon, ich hab schon basically die ganze Anwendungfertig. Okay, dann push ich den GIT commit. Hast du auch eine ordentliche Commit-Messagegemacht? Initial Commit. Hoch agil sind wir. Also, da macht man ja prinzipiell nur Commitsin it oder Temp. Temp ist auch ein gutes. Ich kann ja, ich kann ja die immer random irgendeinIssue markieren. Stimmt, das machen wir. Dann schließen wir einfach bei jedem pushen undIssue auf GitHub. So, also Leute, nein, die E-Mail-Adresse ist nicht geleakt. Das istdie öffentliche E-Mail-Adresse, die ich auch für Donations hab hier am Stream. Nix liegt.Also, ich hab gepusht, kannst mal schauen. Okay, dann prob ich mal. Und ich gucke jetztmal bei dir mit ins Stream rein, wenn du pullst, dass das, dass es gestartet kriegst. Okay,ich hör jetzt den Speech-Hat-Controller und so weiter und jetzt sagst du einfach.netrun so. Ähm, Moment, wau, ich hör mal, ich hör mal, jetzt hören wir uns doppelt. Ichseh, oh, der Stream hat Delay. Oh nein. Ich reloade mal. So langsam. YouTube, come on.Du bist, du bist gerade noch in Issues drin. Oder du bist bei dir, bist du schon im Terminalirgendwo, oder? Ich hab das Terminal bei mir offen. Alter, ist das langsam auf YouTube?Das ist ja echt langsam. 10 Sek, krass. 10 Sekunden Delay. Okay, jetzt machst du, jetztmachst du bei mir auch das Terminal auf. Du gehst, du gehst rein in den Backend undsagst einfach.net run. Fertig. Run, okay. Und dann auf Port 5000, ne? Und dann ist esglaube ich auf Port 5000 oder Port 5002 oder was auch immer. Jaja, genau, genau, das siehtgut aus. Äh, das, das werde ich noch ausschalten. Der macht ja aktuell noch HTTPS und Redirectund sonst was. Das kommt alles raus, weil vom Plan her ist ja so die ähm, Zertifikat-Geschichteund so. Machen wir nicht selbst in dem, in dem.net Programm. Wir lassen uns per Letzterencrypt ein Zertifikat ausstellen und machen da was davor, was das macht. Machst wahrscheinlichja, genau. Ähm, okay, dann ist halt, ah warte, das ist ja auch eben Postrequest, ne? Dasist ein Post, genau. Sollte, sollte eigentlich funktionieren, wenn du nen Post machst aufslash speedchamp. Du wirst mich wundern, wenn das nicht funktioniert. Ist dumm, dass ichdas jetzt nicht zugucken kann. Naja, Pech. Ihr müsst halt gucken, warte mal. Look, localhost5000. Genau. Der wirft mir halt Errors mit dem SSL. Ja, gut, das. Also, also, wenn ichhalt HTTP localhost 5000 slash speedchamp mache und dann Post. Ähm. Ja. Dann sagter mir SSLP, blablabla, oder SSL Remote Key was not okay. Ach, ich hab, ich, der leitetum auf, ähm, standardmäßig auf SSL, das muss ich noch rausmachen, warte mal. Das istder erste Bug schon. Eine, eine Zeile quasi. Der ist kaputt. Das muss ich rausschmeißen.Der macht standardmäßig Umleitung, HTTPS Redirection, das brauchen wir alles net. Essollte eigentlich funktionieren. Ja, genau. Ihr wisst, wie das ist, ne? Famous Last Words,sollte eigentlich funktionieren. Also, Authorization und HTTPS Umleitung machen wir weg. Brauchman nicht. Äh, ich seh übrigens gerade, ich generiere, by the way, automatische SwaggerUI, äh, Swagger, äh, AP Documentation. Wusste ich auch nicht, dass ich das mach, ja. Die,die scheint ganz wichtig zu sein für eine Uhr. So. Ich mach mal ein neues Comet. Unddas jetzt mal hier an alle, die im Chat, äh, bei beiden Channels dabei sind. Normalerweise,wenn man jetzt lokal bei sich ist, würde man Folgendes machen. Das mach ich jetzt explizitnicht. Ich zeig's euch aber mal. Man würde sagen, hier geht, äh, keine Ahnung, man fügtdie Dinger hinzu, dass man committet, und dann sagen die Leute meistens so was wie,anhängen ans letzte Comet. Das Dumme ist jetzt nur, wenn ich das letzte Comet quasiüberschreibe, das ist lokal wunderbar, aber dadurch, dass der Noel sich da schon gepushthat, kriegt er jetzt ne Fehlermeldung, wenn ich das mache. Das heißt, ich muss ein neuesComet oben drauf machen. Das heißt, sobald man nen Public, nen Branch Public hat, sollteman nie da dran an der Historie rumspielen. So. Git commit, minus a, minus m. Tja, fix.Beste. Push. So. Kann's noch mal. Jetzt hat er fertig gepusht. Kann's noch mal. Jetztsollte es eigentlich funktionieren. Ich probier's bei mir lokal auch mal aus..net run. Genau.Perl. Minus x. Post. Localhost. Port 5000. Slash. Speed. Champ. Ja, sieht gut aus. Yes,sieht gut aus. 200, okay, eine Sekunde, wunderbar. Ja. Äh, schön. Ja, wunderbar. Das heißt,du kannst schon mal was abkragen. So, jetzt kommt, äh, jetzt kommt noch eine Frage imChat mit, was ich den Reverse-Proxy mache. Das mach ich nicht mit Traffic. Das ist mirzu kompliziert. Das mach ich mit Cuddy. Das startet man einfach, macht drei Zeilen Konfigund dann kriegt man ein Zertifikat und gut ist. Ja. Genau, äh, wie machen wir jetztam besten weiter? Willst du jetzt ein bisschen die Seite basteln und ich mach Server? Äh,genau, ich würde jetzt ein bisschen die Seite basteln. Du machst den Server und, ähm, dann,dann gucken wir mal, wie gut das geht und dann, ähm, ja, mache ich mir jetzt mal ein bisschenGedanken, wie ich das am besten im Frontend umsetze. Ja, ich hab auch noch keine Ahnunggenau, wie wir das machen. Den Mod, das Mozilla hab ich dir gepostet, ne? Äh, ja, das istdas, das ist im Mozilla-Ul. Genau, wunderbar. Worum geht's hier? Kann ich mal die Projektdokumentationsehen? Ja, kannst du? Moment, was ist die Standard Swagger-UI? Ah, hier, Sekunde, Sekunde.Zeig ich dir? Kriegst du? Kriegst du? Projektdokumentation, keine Probleme, haben wir alles, haben wiralles. Hier. Hammer, Hammer, Hammer. Local House, Port 5000. Ich kann das, ich kann das schreiben.Port 5000 slash Swagger. Hier, guck, da ist sie, Leute. Projektdokumentation. Jetzt kommtder Chat an, ist-soll-Analyse. Was kommt als nächstes? Gantt, Gantt-Diagramm oder was?Ey, ich hab, wir müssen noch Risikoanforderungen, müssen wir uns auch noch angucken. Also, also.Aber seht ihr den Chat hier? Da. Wir haben eine Apidek-Dokumentation. Die ist zwar,wenn man ehrlich ist, ziemlich mickrig. Das Einzige, was da drin ist, ist Code 200, Success.Ja. Gut zu wissen. Ist halt, ist halt da, ne? Aber ist ja cool. Hab ich noch nie ausprobiert.Man kann sich jetzt jeder seinen eigenen Speedchamp programmieren. Mit der Doku. Mit der Dokuin unserem Projekt schon. Gibt ja jede Menge solcher Sachen. Genau, wunderbar. Joa. Dannkannst du dir ja mal ein bisschen Gedanken um Frontend machen. Wie wollen wir das machen?Soll ich jetzt, also ich bastel jetzt Server, soll ich mich muten in der Zwischenzeit, weilich würd ein bisschen was bei erklären. Und das sieht man bei dir ja nicht. Ich glaub,wir können uns so ein bisschen bei, neben bei muten, jeder erklärt so ein bisschen,was er gerade macht. Und wenn der Server dann da ist, sagst du Bescheid. Genau. Genau. Okay.Gut. So machen wir das. Bis gleich. Bis gleich. So Leute, also. Geh los. So wie wir uns dasjetzt überlegt haben, der Noel bastelt ein bisschen am Frontend. Und ja, ich werd danndas Backend machen. Aber jetzt müssen wir erstmal einen Server anlegen. Weil ohne Serverkönnen wir das Ganze nicht laufen lassen. Und ich hab mir schon was gekauft. Ich zeigeuch das mal. Guck mal da. Hallo, Peter Wubbel. Ihr seht wieder, ich hab mich mit meinem legitlegit Name registriert, wie wir ja alle wissen, dass ich Peter Wubbel heiße. Und ich hab mireine Domain gekauft, die hat nämlich speedchamp.org. Da ist es. Oh, ich hab acht. Ich hab acht TageZeit, meine Kontaktkontaktinfo zu verifizieren. Ich hab da so meine Schwierigkeiten, das zuverifizieren, weil, weil ich zeig's euch mal. Okay, das heißt, die Domain ist nach dem Streamweg, keck wait. Nein, nein, nein. Email was sent, what the fuck. Warte mal, Domains. Wiekommt man jetzt überhaupt in die Settings rein hier? Manage. Okay, wunderbar. Weil daswitzige ist, ich glaube, es wird schwierig zu verifizieren. Oder meinte ich, ich kannmich hier, ich. Peter Wubbel, Teil eins, Frankfurt in Hessen. Liegt Telefonnummer, die es bythe way nicht gibt, irgendwas eingegeben. Du musst glaube ich nur eine Mail bestätigen.Das probiere ich mal aus. Leute, ich probiere mal aus, ob ich das, ich logg mich mal kurzin meiner E-Mail Adresse ein. Anderen. Anderen. Rosa. Gucken wir mal. Weiter zum Postfach.Wo ist das denn? Spam Verdacht? Ach, das hätte ich vorher schon machen müssen. Dasist im Spam Verdacht gelandet. Ne. Message vom NamecheapCEO, jaja, ist klar. Also ichhabe nichts bekommen. Ich habe nichts, ich habe nichts bekommen hier. Ich habe, ich habeihnen gesagt, ich will das verifizieren. Verifizieren. E-Mail war send. Also, jucktsie nicht, ich habe keine E-Mail gekriegt bis jetzt. Keine Ahnung an, was sie das geschickthaben. Na gut, schauen wir mal. Zumindest, ich habe ja acht Tage Zeit, das so zu machen.Also was wir jetzt machen, dann müssen wir es folgendes. Ich habe mir, wie gesagt, dieseDomain hier habe ich mir gekauft, speedchamp.org. Sprich, wenn jemand jetzt drauf geht, kommtman wohin? Hier auf irgendeine komische Parkseite. Was ich übrigens auch immer frech finde, wenndie quasi schon das für Werbung benutzen, obwohl man dafür Geld bezahlt hat. Übrigens,das ist Namecheap, verwende ich zum ersten Mal. Ich habe vorher das noch nie verwendet,keine Ahnung. Ich habe immer was anderes verwendet zum Domains registrieren. So, SourceUrl, speedchamp.org,DestinationUrl, www.speedchamp.org, das ist ein Redirect, den braucht eigentlich keinNamecheap, den können wir gleich löschen. Namecheap ist POG. Warum Namecheap diesmal?Weiß nicht, weil ich mich nicht leaken wollte. Bei dem anderen Domain registrieren würdeich mich wahrscheinlich leaken. Waren kurz die Musik einen Tick laut, dann hörte ergar nicht, dass Musik an ist. Max Error. Wieso, was? Du musst, du musst Cores noch deaktivieren.Weil ich ja von dem Frontend aus das mache und das muss man dann noch deaktivieren. Okay,mache ich. Okay, wunderbar. Da habe ich jetzt gar nicht dran gedacht. Ja, ich auch nicht.Das ist tatsächlich gar nicht so einfach, da muss ich abgucken. Da muss ich abgucken,mache ich gleich. Okay. Alright. Ja. Sagt ihr gleich Bescheid. Yes, kein Schreis. Ihr vollagil ist das hier Wahnsinn. Sagt ihr Bescheid. Sitz mal Leute, so muss das sein. Du mussteinfach deaktivieren. Ja. Nee, aber Leute, es ist echt so, ich bin hier gar nicht gewöhntmit Leuten zusammen was zu basteln. Ich muss mal kurz abgucken. Das war relativ, relativeasy, wenn man weiß, wie es geht. Startup. Ja, ich habe es. Ich habe es. Cores deaktivieren.Startup. Ich mache das ganze Swagger, Swagger gedönnt raus. Das brauchen wir nicht. Alsoadd Cores. Also sprich, das ist, dass er jetzt, wenn er von einem anderen Domain kommt, seinBrowser nicht meckert, wenn er darauf zugreift. Swagger Zeug kommt alles weg. Also hier. Allowall. Einzig sinnvolle Cores Regelung. By the way, warum habe ich hier zwei, zwei, zweiLeerzeichen? Ich will nicht zwei Leerzeichen. Ich will zwei Spaces. Was ist das hier? Spaces.Ja, zwei Spaces und jetzt Reformat. Jawoll. Exzellent. Gleich viel besser. Okay, wunderbar.Jetzt haben wir das hinzugefügt. Jetzt sollte das eigentlich klappen. Wenn ich das, jetztsollte er von allen Seiten drauf zugreifen können. Natürlich machen wir das ganze nurif, if development vorbei. Komm, wer weiß. Aber das richtige environment gesetzt, dannlassen wir es einfach mal so. Ähm, machen wir das aus. Git. Status wird jetzt neu gepusht.Hat sich nur Startup geändert. Wunderbar. Sieht man, er hat nicht viel getan. Und jetztmachen wir commit fix, Cores, Bäm, Push. So, sag ich ihm Bescheid. So, ich hab gepusht.Okay, wunderbar. Sollte, sollte nur tun. Ich hab's jetzt, ich hab's aus dem Preischampkopiert. Das ist unter dotnet ein bisschen durch die Brust ins Auge. Du kannst ja, kannstja auf, wobei hier, du hast auch so ein Wischloss Studio Code auf, ne? Äh, ja, das hab ichauch. Ich kann's dir grad mal zeigen. Ist wirklich richtig knack gemacht. Startup. Esgibt kein, guck mal hier, es gibt keinen Schalter einfach zu sagen hier allow all. Man muss dannirgendwie zig zig policies adden oder sonst was. Aber du solltest jetzt jede Methode vonjeder, von jeder Seite und, und mit allen möglichen Credentials, die wir nicht haben.Okay. Probier mal aus. Mach ich, mach ich. Ja, ich mach wieder Mute, ne? Yes. Genau,so Leute. Ähm, wo sind wir stehen geblieben? Bei der, bei speedchamp.org. Bei der Domain.Übrigens, danke für die ganzen Subs. Jetzt war der Gelegenheit, jetzt wo ich mich gemutedhab. Jetzt kann ich mal kurz, kann ich mal ganz schnell, äh, Big Brain 5-Head Subs hiervorlesen. Und zwar, den haben wir hier am Start. Al-Kalf ist am Start. Dankeschön. Vor 24Minuten. 7-Head Ayaya. Aber Massive 7-Head, Alter. Huge. Weeps in. Shalomitwitchprime33Minuten. Slayda Teddy ist am Start. Asuru97. Liann V. Crate Wilhelm. 8 Monate. Michael50 Billion. 13 Monate am Start, Leute. Dankeschön für die ganzen Subs. Huge Hyper Subscriptionshier. Ja, Carlson hat auch Subscribed. 13 ist wieder am Start. Das war's für heute,glaube ich. Dankeschön für die ganzen Subs. Massive. Du hast ja 3080 TI bekommen. Excellent.Xempi, Dankeschön für den Sub. Hier wird richtig agil programmiert. Wir sind im Discordund per Programmen quasi. Aber ich mach jetzt erstmal den Server, dass wir damit zu Portekommen. Also, ich hab das Redirect gelöscht. Ich hab, wie gesagt, noch nie Namecheap verwendet.Ich muss jetzt einen Server anlegen bei Hetzner. By the way, falls ihr auch mal ein paar virtuelleServer in der Cloud braucht, Fips, Dankeschön für, nee, Fizz, Dankeschön für die 6 Monateam Start, Fips, Dankeschön. Falls ihr auch virtuelle Server in der Cloud braucht, machtmal Ausrufezeichen Hetzner, dann bekommt ihr einen 20 Euro Startgutschein. Und ich zeigeeuch jetzt mal, was ihr für 20 Euro schon bekommt. Wenn wir jetzt nämlich hier einenServer hinzufügt, sagen wir hier in den Nürnberg, Ubuntu 20.04 machen wir und wir nehmen maleinen Triple Core. Guckt mal, ihr könnt für 8 Euro, also ihr könnt mit meinen 20 EuroStartgut haben, fast 3 Monate, sagen wir mal zweieinhalb Monate, einen Triple Core 4GBRAM 80GB SSD Server betreiben. Ist doch schon mal nice. Oder nicht. Kommando klappt, klar.Ich glaube, du kannst das Kommando plus nicht 50.000 einer gleich in Sekunde spammen. So,also wir legen jetzt einen neuen Server an. Das ist viel, das ist die Hälfte wie beiDigital Ocean. Das lohnt sich richtig. Wieso bist du da nicht? Ausrufezeichen Hetzner kannsich anmelden über meinen Partnerlink. Postchamp. Also ich war auch bei Digital Ocean früherund ich bin schon mittlerweile mit allem, was ich habe bei Hetzner und hier, da darf ichnicht draufklicken. Deswegen habe ich extra hingeschrieben, nicht, dass ich dem Streamliege. Sogar mit Alarm, Alarm. Also wir legen jetzt einen Triple Core Server an. Wir addenunsere SSH Keys, dass wir uns beide drauf einloggen können. Ist natürlich ganz sinnig.Und den Server nennen wir, ich überlege gerade, was könnten wir für ein sinnvolles Namenskonzeptmachen irgendwie. Postchamp, passt doch. Genau, legen wir den Server an. Wir legen uns übrigensauch noch eine Firewall gleich an. Das ist jetzt ein neues Feature bei Hetzner. Diefinden das bestimmt toll, wenn ich das mal vorstelle. Ich finde das ist was wirklichsinnvolles, das habe ich bei vielen anderen Cloud Anbietern schon gesehen. Bei Hetznergibt es das erst seit 2-3 Monaten oder so. Was soll der Champ können? Speedtest. Wirhaben ein Projekt gebraucht, was wir einfach zu zweit im Stream programmieren können,wo man nicht so viel Code programmieren muss, sondern was übersichtlich ist. IP liegt.Was haustest du bei Prot nicht öffnen? Unter anderem den Preischamp, aber das geht euchnichts an, deswegen steht ja auch nicht öffnen dran. Was ist denn so im Betrieb in der Cloud?Was im Betrieb, was meinst du bei uns auf der Arbeit? Oh, das ist jetzt ein bisschenviel, was ich jetzt aufzählen müsste. Das hier ist ein neues Feature bei Hetzner. Dasgibt es bei vielen anderen Cloud Anbietern auch schon. Man kann jetzt, ohne dass manseinen Server selbst schützt, also man konnte schon immer seinen Server selbst schützen,IP-Tables, Firewall auf Linux aufmachen oder so, kann man jetzt eine Firewall da vorstellendirekt bei Hetzner. Das ist tatsächlich ganz praktisch. Nennen wir die mal FW-Speedchamp.Ich hänge da nur einen Server dran. Man kann da wohl mehrere Server dran hängen. Packenwir den Speedchamp dran. Und jetzt ist alles gefiltert außer Port 22 und Ping. Und waswir halt auch noch freigeben müssen ist TCP-Port 80 und TCP-Port 443. Also sprich, Port 80,HTTP und HTTPS. Das müssen wir auf jeden Fall auch freigeben, sonst wird das Ganze nichtfunktionieren. Speedchamp wäre auch eine gute Darkwrap-Seite. Generell, wir haben es jaDomainnamen und Projekte angetan, die irgendwas mit Champ heißen. Applied to? Was? Ja,ich glaube, das braucht einfach nur ein bisschen. Fully applied. Excellent. Hat funktioniert.So, also, zack. Loggen wir uns mal auf den Server auf, machen wir ein neues Tab auf,root, add, Hetzner, IP. Und als erstes mal eine Runde updaten. HTTPS ist ein TCP-Protokoll,ja? Klar. Was sonst? Gibt ja nicht so viele Möglichkeiten, wie du was übertragen kannst.Du hast doch zu Hause einen Server. Warum machst du das nicht bei dir zu Hause? Naja,nein schon, weil ihr es dann nicht ausprobieren könnt. So, wir machen jetzt erst mal hierPackage-Update. Das ist ein eigenes Protokoll. HTTPS gibt es da nicht. Das ist TLS im Endeffekt.Das ist quasi eine Verschlüsselung auf Layer-4-Ebene. Dementsprechend siehst du auch beispielsweisenicht, welche Urls du aufrufst. Siehst du also Parameter. Die Urls siehst du im Prinzipschon, weil du machst vorher eine DNS-Abfrage, aber du siehst halt nichts, was im HTTP-Requestdrinner ist. Übrigens heute, falls wir einen Mod da haben, Modcheck, Leute, Modcheck. Modcheck.Ich bin ja da. Wo ist der Cute-Mod? Ja, das frage ich mich auch. Keine Mods, keine Regeln,doch die Regeln gelten nach wie vor. So, jetzt haben wir erst mal hier Updates gemacht, Upgrade,wunderbar. Abinstall, erst mal die wichtigsten Dinger, die wir hier brauchen drauf, deset,git. So, mal diese Standard-Packages auf dem Server installieren. So, und was wir jetztmachen müssen ist folgendes. Wir haben ja hier unsere SpeedChamp-Anwendung und wir müssenjetzt gucken, dass das Ding ein ordentliches Zertifikat bekommt. Also sprich, wenn mandann später auf die Seite geht, speedchamp.org, dann will ich, dass wir ein gültiges Zertifikatbekommen. Aktuell kriegen wir da schlicht und ergreifend gar nichts, was auch nicht sosinnvoll ist. Warum benutze ich nicht die Cute-VM? Weil ich in der Cute-VM nichts auf die Reihekriege. Die sieht einfach nur cute aus, aber ansonsten nix. Cute nicht gleich ergonomisch.Gut, jetzt haben wir den Server hier eingerichtet bei Headsnone. Wir haben Package-Updates gemacht,wir machen mal schnell ein Reboot, dass er den aktuellen Kern lädt. Und jetzt nehmenwir uns die IP und tragen das hier beim DNS ein. Weil wir wollen ja, dass ping speedchamp.orgsoll ja nicht auflösen auf das, sondern speedchamp.org soll gefälligst auflösen auf... Wie machich denn jetzt einen Eintrag für das komplette So? Oder Sternchen? Sternchen wahrscheinlich,ja. Bitte auch IPv6, 0w, Alter. IPv6. Ach, kein C-Name, ein A-Rekord. Jaja, jaja. Habter recht. Packweight. Yes. Also ich muss sagen, schön zu bedienen ist das jetzt nicht wirklich.Muss man da jetzt Sternchen machen? Oder kann man das ganz weglassen? Nein, man muss wahrscheinlichSternchen machen, oder Punkt. Sternchen, Sternchen, da heißt wahrscheinlich alles. Okay, und wenndas jetzt funktioniert... Nein, nein, nein, wir machen kein IPv6. IPv6 in 2021. So, undjetzt müssen wir warten, bis das DNS propagatet ist. Er benutzt Namechamp für DNS. Das wäregeil, ich mach mal einen eigenen DNS dafür. FlashDNS, gibt's da einen Knopf für? Ach,du meinst bei mir lokal, dass der das nicht mal gecached hat? Ach so. Aber das brauchttrotzdem ein bisschen Zeit zu propagaten. So 5 Minuten oder so sollte man dem schon malZeit geben. Man kann das ja ganz einfach ohne Cache ausprobieren. Also wenn man das ausprobierenwill, macht man nicht einfach einen Ping, sondern sagt, ähm, Dick. Speedchamp at GoogleDNS,mal gucken was der GoogleDNS zurückliefert. Und der GoogleDNS liefert zurück nichts. Warumliefert der gar nichts zurück? Ihr habt schon recht, man sollte schon IPv6 machen. Ne, ne,das ist egal. Ich frag jetzt da direkt den GoogleDNS ab. Warum antwortet er? Wir könnenauch mal Cloudflare abfragen. Juckt, juckt, juckt ihn gar nicht. Juckt ihn, juckt ihnnoch gar nicht. Hat er das jetzt überhaupt gespeichert? Wie gesagt, ich hab Namecheapnoch nirgendwo benutzt, muss ich jetzt irgendwie noch was speichern oder so? Oder muss ichbei Host direkt eintragen? Speedchamp.org. Also ich weiß gar nicht, wie das aussehenmuss hier. Sternchen ist ok. Host add, als würde es hier sein. Add. Ne, Sternchen, Sternchengeht schon. Ok, wir warten jetzt einfach mal kurz ab und schauen, ob das funktioniert.TTL Automatic ist doch ok. Was kann man hier bei Domains noch eintragen? Bei DNS Servernoch eintragen? Basic DNS, Custom DNS. Ok, auch gut. Da könnte ich über Cloudflaremachen oder so. Wir warten einfach mal ab. Wir warten einfach mal ab. Namecheap. NichtNamechamp. Namecheap DNS Toplevel. Ich weiß gar nicht, wie man das da eintragen muss.Aber nicht Toplevel. A-Record. Die haben doch bestimmt ein Exempel dafür. How can I setup A-Record for my domain? Yep. Manage. Advanced DNS. Add. Ah. Ah, das ist... Ok. Add leitetalles darauf weiter. Sternchen ist quasi Wildcard. Da kann ich sagen Sternchen Punkt. Das heißt,ich muss in dem Fall wirklich ein Add verwenden, wenn ich das richtig sehe. Ok, dann probierenwir das mal aus. Add. So müsste das jetzt eigentlich richtig sein. A-Record Add. Ja,exakt. So, so habe ich das jetzt. Sehr schön. YouTube Streamer. Wieso? Wieso was passiertman gerade im Stream? Ich habe es jetzt nicht auf. Was macht er? Er ist hier Frontend HackerMan am Start. Guckt euch mal an hier. Der ist ja fast schon fertig. Der ist ja fast schonfertig. Ich habe mich mit dem Server eingerichtet. Ich laber zuviel. Ich habe nichts gemacht.Ich hatte schon komplettes Energie am Start. Erst mal auf YouTube streamt. Ok Leute, alsohier, Progress. Progress. Heck wait. Jetzt geht es so langsam. Warte mal. Wollen wirschon mal SSH Session? Wollen wir schon mal SSH Session? Ach hier, ich habe hier Rebooted.So, also Dick. Er läst immer noch nicht auf. Ist auch egal. Also, ähm, wie kommt man zudeinem Kollegen? Du gehst hier hin. Moment, ich pause das mal in Chat. Wenn wir einenMod da haben, könntet ihr einen Command einfügen. Das wäre schon äußerst nice, aber ich glaube,es hat keiner da. Das Sprint endet heute. Du musst alles schaffen. Ah, guck mal. Auflösungfunktioniert. Ok, wunderbar. Also, wenn ich jetzt hier hingehe auf speedchamp.org, dann,ah, der hat es immer noch gecashed. So, was wir jetzt machen müssen ist, wir braucheneine, also die Domain zeigt jetzt auf den Server drauf. Wir brauchen jetzt ein gültigesZertifikat. Dafür installieren wir jetzt einen Reverseproxy, der das für uns macht.Ist total einfach. Habe ich schon öfters im Stream gemacht. Ähm, wir installieren unsKaddi als Reverseproxy, weil ich da meinung bin, Kaddi ist als Reverseproxy mit Abstandam einfachsten. Deswegen mache ich das jetzt einfach mal. Klar, man kann das alles auchmit, ähm, Docker-Containern machen oder direkt über Azure Functions. Das haben wir uns übrigensfür einen zweiten Stream überlegt, Leute. Wenn wir hier in Speedchamp auch einen Falsurfergehostet haben, dann wollen wir das nächste Mal versuchen, in irgendwie jetzt nicht unbedingtjetzt gleich nächster, direkt nächster Stream, aber in einem der nächsten Streams, machenwir dann das Frontend auf Netlify und das Backend in Azure Functions. Serverless, genau.By the way, habe ich schon mal gesagt, was für ein bescheuerter Name Serverless eigentlichist. Serverless bedeutet ja im Endeffekt bloß, es sind nicht meine Computer, sondern Computervon anderen Leuten. Jeden Stream, ja, ja, ich weiß es. Ok, Boomer, ich habe vergessen.So, Kaddi haben wir am Start, wunderbar. Dann brauchen wir jetzt, äh, die Config-Datei.Genau, also, unser Server läuft ja, wie man hier sieht, auf.netrun. Unser Server läuftja auf localhost port 5000. Das heißt, wir müssen jetzt eine Kaddi-Regel einstellen,das ist nun mal so zur Erklärung. Wir haben auf dem Server dann lokal unseren eigentlichenWeb-Service laufen auf port 5000. Mein Stream laggt übrigens. Ok. Huge lag. Ok. Ok. Ok.Ok. Ok.Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok.Komm an Wodafone, krieg dich ein, mach hinne!So, kriegt sich das Ganze jetzt wieder ein?Äh, Test-Test, geht das jetzt wieder?Ah, jetzt geht's wieder!Meine Güte, Wodafone hier, guckt euch das mal an, 54% Päckchenlost, Keg-Wade, Alter!Wodafone direkt verreckt einfach nur.So, äh, Test-Test, bist du da?Ich bin da, hörst du mich?Mein Stream ist komplett abgeschissen, Wodafone war zwei Minuten weg.Ich bin froh, dass das bei mir nicht passiert ist, weil ich bin auch bei Wodafone.Ah, vielleicht wird, ich hab vorhin meine IP geleakt, vielleicht den Idee-Dossack direktam Start.Nee, glaub ich nicht.Das kann halt sein, ne?Nee, das ist irgendeine Wodafone-Kacke.Oder einfach wieder Wodafone am Verkacken.Ich denke, ich denke es ist Wodafone.Also, ähm, tja, also ich bin immer noch am Server einrichten, ich hab gesehen, ichhab kurz bei dir im Stream geguckt, du hast schon irgendwie GUI am Start mit Knopf undso.Ich hab, ich hab, ich bin richtig krass am, am Agile unterwegs, ich hab den Knopf und...Ja, ich seh's.Also ich, ich, ich sorg jetzt erstmal dafür, dass man, äh, also Domain funktioniert schonund ähm, ich mach jetzt erstmal ein ordentliches Zertifikat, dass wir, dass wir grünes Häkchenim Browser haben, wenn wir draufgehen.Okay, alles klar.Ich sag dir Bescheid, bis gleich.Okay, jo.Okay Leute, funktioniert jetzt alles wieder?Sollte, sollte alles tun, ne?Man hat, man hat von ihm nix gehört?Doch, man hat was von ihm gehört.Wodafone Premium Peering, ja.Okay, wunderbar.Also, weiter geht's.Ähm, wo bin ich jetzt stehen geblieben?Genau.Also wir müssen jetzt ein Proxy bauen, der sich um Zertifikate kümmert.Ja, ich bin, ich bin wieder da.Dann muss ich um, leider, leider Wodafone wieder rumgespackt.Wir müssen uns jetzt um den Proxy kümmern, der äh, äh, Zertifikate, äh, erneuert mitletzterem Clip, dass wir ein schönes grünes Häkchen im Browser haben, wenn wir auf speedchamp.orggehen.Der Chatbot scheint zu hängen.Der macht wahrscheinlich einfach nicht hetzener 30.000 mal.Da müssen wir gucken.Okay, guck mal, speedchamp.org, die Testseite geht übrigens schon.Also, Leute, wenn ihr jetzt auf speedchamp.org geht, kriegt ihr die Testseite, möglichstwahrscheinlich, die etwas scheppe Testseite.Aber, das werden wir jetzt rausschmeißen, das werden wir jetzt rausschmeißen, und zwarwir werden jetzt einen, äh, Redirect machen.Und zwar einen Redirect für, ich hoffe, das krieg ich aus dem Kopf hin, kardi, äh, reverseProxy.Ich hab jetzt einfach die offizielle Doku an, die ist nämlich ganz gut für, für kardi.Oh, ne, ist wieder am abkacken, oder?Das ist mega am rumleggen, äh.Huge lag.Oh, ne, das ist mega am rumleggen, äh, reverse Proxy, äh, reverse Proxy, äh, Redirect.Oh, ne, das ist mega am rumleggen, äh, reverse Proxy, äh, reverse Proxy, äh, Redirect.Oh, ne, das ist mega am rumleggen, äh, reverse Proxy, äh, Redirect.", "segments": [{"id": 1, "start": 0.0, "end": 8.52, "text": "das funktioniert bei dir? Guck mal kurz. Twitch braucht immer ein bisschen bis das am Start ist,"}, {"id": 2, "start": 8.52, "end": 21.32, "text": "bis kapiert er das online ist. Aber wo sieht man das jetzt? Vorhin stand da,"}, {"id": 3, "start": 21.32, "end": 34.08, "text": "dass Streaming startet und jetzt, wo ist das denn hin? Ah hier, warte, warte, warte. YouTube,"}, {"id": 4, "start": 34.08, "end": 45.56, "text": "Alter. Also Twitch ist on, Twitch ist on, aber YouTube hat es noch nicht gecheckt. Wahrscheinlich"}, {"id": 5, "start": 45.56, "end": 51.92, "text": "muss ich einen Hick machen, jetzt live oder sowas. Ich glaube, ich habe es jetzt, jetzt, aha. Ah nice,"}, {"id": 6, "start": 51.92, "end": 61.32, "text": "perfekt, ich sage dir, wenn es on ist. Jetzt dürfte er bei mir. Twitch hat es auch kapiert,"}, {"id": 7, "start": 61.32, "end": 67.72, "text": "Twitch ist auch on. Moin, excellent, 5HatChat hier wieder am Start. Twitch hat es kapiert,"}, {"id": 8, "start": 67.72, "end": 70.72, "text": "YouTube hat es kapiert, bei mir ist es auch on. Wunderbar, ich muss dich hier mal muten,"}, {"id": 9, "start": 70.72, "end": 79.84, "text": "stream. Oh, hugepaint da kommt, perfekt. So. Oh, jetzt habe ich dein SSH, jetzt habe ich im"}, {"id": 10, "start": 79.84, "end": 86.72, "text": "Stream dein SSH Public Key geleaked, das gibt schlimmeres. Oh nein, oh nein. So, okay,"}, {"id": 11, "start": 86.72, "end": 93.72, "text": "Discord lasse ich lieber zu, man weiß ja nie. Also Leute, wir sind am Start, super agil heute."}, {"id": 12, "start": 93.72, "end": 107.84, "text": "13, Dankeschön für den Sub, 20 Monate, huge hyper subscription. Ja, wir warten jetzt mal,"}, {"id": 13, "start": 107.84, "end": 111.28, "text": "bis das alles so ein bisschen angelaufen ist. Leute, sag mal, ob die Musik bei mir passt,"}, {"id": 14, "start": 111.28, "end": 116.6, "text": "please. Ja, bei mir auch gerne mal in den Chat schreiben, wie es mit den Audioeinstellungen"}, {"id": 15, "start": 116.6, "end": 123.48, "text": "funktioniert. Ich habe keinen Plan, es sollte passen, aber es ist ja immer so eine Sache. Ja,"}, {"id": 16, "start": 123.48, "end": 133.72, "text": "ich denke auch. Chat, ihr müsst mir auch mal sagen, ob dein Neulang genug, nicht laut genug ist. Ja,"}, {"id": 17, "start": 133.72, "end": 137.52, "text": "null ein Gast, das steht im Titel, genau. Wir sind heute zu zweit am Start und sind heute super"}, {"id": 18, "start": 137.52, "end": 142.6, "text": "agil und programmieren was zusammen. Wenn die Streams dann so weit online sind, erzählen wir"}, {"id": 19, "start": 142.6, "end": 147.76, "text": "euch auch was. Wir haben sowas noch nie gemacht, wir haben keinen Plan, wie das Ganze läuft."}, {"id": 20, "start": 147.76, "end": 154.08, "text": "Normalerweise kann ich ja so vor mich hin labern, wie ich will und es ist keiner dabei. Ja, gucken"}, {"id": 21, "start": 154.08, "end": 161.2, "text": "wir heute mal. Ich bin echt gespannt. Es wird entweder richtig nice und es wird super funktionieren"}, {"id": 22, "start": 161.2, "end": 175.52, "text": "oder alles gecheat. Wahrscheinlich. Du hast doch Urlaub, oder? Nice. Weil ich habe gestern ein"}, {"id": 23, "start": 175.52, "end": 181.2, "text": "Video gemacht und habe angefangen mit, ja schön ist Feiertag und dann hat mir die Hälfte erzählt,"}, {"id": 24, "start": 181.2, "end": 192.72, "text": "es ist gar kein Feiertag. Bei mir ist es so, ich habe jetzt generell keine Vorlesungen. Ah, das ist natürlich praktisch. Deswegen ist das ein bisschen cheat. Ein"}, {"id": 25, "start": 192.72, "end": 198.48, "text": "bisschen lauter soll ich nicht machen. Okay, mache ich. Konnte man das in Discord irgendwie direkt"}, {"id": 26, "start": 198.48, "end": 208.12, "text": "machen? Ja, doch, wenn du rechts klick auf mein Profilbild machst. Ah, Wahnsinn. Wobei, dann höre ich"}, {"id": 27, "start": 208.12, "end": 213.04, "text": "dich ja auch lauter. Du bist bei mir laut genug. Ich mache einfach im OBS. Ich mache einfach im OBS lauter."}, {"id": 28, "start": 213.04, "end": 221.32, "text": "Da muss ich jetzt aber die Mario Kart Musik ein bisschen leiser machen. Das ist hier wieder Setup."}, {"id": 29, "start": 221.32, "end": 241.0, "text": "Ich glaube, jetzt passt es. Sogar mit Hetzenerwerbung, ja. Mal gucken, ob bei dir die Leute auch schon am Start sind. Ich habe dein Chat"}, {"id": 30, "start": 241.0, "end": 248.08, "text": "offen, zeig mal da. Bei mir sind die Leute am Start. Bei dir sind sie am Start. Vergessen Sie auch nicht, die"}, {"id": 31, "start": 248.08, "end": 255.16, "text": "passenden Secure Coding Verfahren zu beachten. Natürlich. Also was erwarten die Leute von uns?"}, {"id": 32, "start": 255.16, "end": 262.6, "text": "Also selbstverständlich. Erstmal Daily Scrum Stand-Up. Kann man ein Board-Fit rausgeholt. Erstmal"}, {"id": 33, "start": 262.6, "end": 269.84, "text": "Tasks verschieben. Ja, gar schon eine User-Story geschrieben. Ja, perfekt. So muss das sein."}, {"id": 34, "start": 269.84, "end": 280.56, "text": "Alles schön agil. Das passt mit Ton. Wunderbar. Ja gut, ich würde sagen, wenn das alles technisch"}, {"id": 35, "start": 280.56, "end": 290.32, "text": "soweit passt, erzählen wir, was wir heute vorhaben. Absolut. Chat hier auf. Soll ich loslegen? Und zwar,"}, {"id": 36, "start": 290.32, "end": 294.68, "text": "wir haben uns überlegt, es wäre mal eine gute Sache, wenn wir einfach zusammen ein bisschen"}, {"id": 37, "start": 294.68, "end": 299.16, "text": "was programmieren im Stream. Diesmal ohne Rute Passwort League, sagt mein Chat. Ja, ich kippe"}, {"id": 38, "start": 299.16, "end": 304.52, "text": "mir Mühe. Das letzte Mal habe ich das Rute Passwort gelegt von der Kiste. Also wir haben"}, {"id": 39, "start": 304.52, "end": 307.4, "text": "gedacht, es wäre mal eine schöne Sache, zusammen was zu programmieren im Stream. Das heißt,"}, {"id": 40, "start": 307.4, "end": 312.92, "text": "wir brauchen ein Projekt, was jetzt nicht so wahnsinnig umfangreich ist, was man auch machen"}, {"id": 41, "start": 312.92, "end": 317.0, "text": "kann, weil das ist ein Unterschied, ob man jetzt offline sitzt und davor sich hin programmiert oder"}, {"id": 42, "start": 317.0, "end": 321.24, "text": "hier live und die Leute zugucken, plus sich noch um die ganze Technik kümmern muss und man so was"}, {"id": 43, "start": 321.24, "end": 327.2, "text": "noch nie gemacht hat und eigentlich gar keine Ahnung, hat was passiert. Deswegen haben wir uns"}, {"id": 44, "start": 327.2, "end": 332.12, "text": "gedacht, wir machen einen Speedtest. Ich habe mir auch schon die passende Domain registriert,"}, {"id": 45, "start": 332.12, "end": 338.84, "text": "nämlich den speedchamp.org und wir werden einen Speedtest programmieren, wo man gucken kann,"}, {"id": 46, "start": 338.84, "end": 343.04, "text": "ja, wie viel Bandbreite man hat. Das ist jetzt nichts Tolles in dem Sinn, dass es noch nie da"}, {"id": 47, "start": 343.04, "end": 348.4, "text": "gewesen ist, aber ich habe so was noch nicht gemacht, zumindest noch nie so was fertig"}, {"id": 48, "start": 348.4, "end": 353.24, "text": "programmiert und zumindest, es ist vom Umfang her relativ klein. Ich denke mal, das gibt,"}, {"id": 49, "start": 353.24, "end": 358.2, "text": "was weiß ich, 200, 300 Zeilen Frontend, 200, 300 Zeilen Backend, also was überschaubares,"}, {"id": 50, "start": 358.2, "end": 365.32, "text": "was man jetzt ja auch hier in zwei, drei Stunden Stream hinkriegt und da gucken wir mal, ne?"}, {"id": 51, "start": 365.32, "end": 370.88, "text": "Yes, auf jeden Fall. Also ich habe so was auch noch nie gemacht. Ich meine, wer programmiert so in"}, {"id": 52, "start": 370.88, "end": 374.96, "text": "seiner Freizeit so ein Internet Speedtest, die wenigsten, aber ich denke schon, dass wir das"}, {"id": 53, "start": 374.96, "end": 381.56, "text": "gut hinbekommen. So, auch wenn es vielleicht ein bisschen so scuffed ist oder so am Anfang,"}, {"id": 54, "start": 381.56, "end": 389.12, "text": "ich meine, wir müssen uns erstmal dran gewöhnen und einfach mal gucken, wie es funktioniert."}, {"id": 55, "start": 389.12, "end": 392.2, "text": "Es geht auch darum, mal so ein bisschen so das ganze Drumherum an so ein bisschen zu zeigen."}, {"id": 56, "start": 392.2, "end": 398.36, "text": "Richtig, genau. Wir fangen ganz von vorne an. Wir fangen an mit GitHub-Projekt anzulegen. Also"}, {"id": 57, "start": 398.36, "end": 403.32, "text": "wir machen das ganz öffentlich. Ihr könnt dann reingucken, wie das aussieht danach. Ach,"}, {"id": 58, "start": 403.32, "end": 405.96, "text": "Moment, habe ich mich gar nicht auf GitHub angemeldet. Irgendwo habe ich mich auf GitHub"}, {"id": 59, "start": 405.96, "end": 410.36, "text": "angemeldet. Ob ich mich auf GitHub angemeldet? Ach, hier habe ich mich auf GitHub angemeldet."}, {"id": 60, "start": 410.36, "end": 419.84, "text": "Perfekt. Also inklusive Repo anlegen und dann einen Server erstellen, dort das Ganze drauf"}, {"id": 61, "start": 419.84, "end": 427.52, "text": "deployen. Wir machen DNS-Auflösung für Domain-Name. Ich mache ein Zertifikat dafür. Also im Prinzip"}, {"id": 62, "start": 427.52, "end": 431.36, "text": "so alles, was man für so ein kleines Projekt braucht. Warum ist der Preis-Champ nicht auf"}, {"id": 63, "start": 431.36, "end": 441.52, "text": "GitHub? Ich hatte nicht vor, den Preis-Champ auf GitHub zu machen. Muss nicht sein. Tja,"}, {"id": 64, "start": 441.52, "end": 445.32, "text": "was gibt es sonst noch zu sagen? Ich glaube an sich nicht. Ich glaube, wir können eigentlich"}, {"id": 65, "start": 445.32, "end": 452.08, "text": "direkt mal loslegen, das GitHub-Propositor zu erstellen. Genau, also folgendermaßen,"}, {"id": 66, "start": 452.08, "end": 456.44, "text": "wir haben uns das so überlegt, im Vorfeld schon ein bisschen. Diese Anwendung wird ja"}, {"id": 67, "start": 456.44, "end": 462.16, "text": "wahrscheinlich bestehen aus einem Frontend, was ihr dann seht, wo man dann Sachen hochladen"}, {"id": 68, "start": 462.16, "end": 466.0, "text": "kann. Übrigens, danke für die ganzen Subs. Ich kann heute nicht jeden einzelnen Sub quasi"}, {"id": 69, "start": 466.0, "end": 471.12, "text": "da zwei Minuten huldigen, weil das muss ich auch zu viele Sachen gleichzeitig konzentrieren."}, {"id": 70, "start": 471.12, "end": 476.28, "text": "Also es wird ja auf jeden Fall aus einem Frontend bestehen, sowas hier bei Speedtest. Wie heißen"}, {"id": 71, "start": 476.28, "end": 481.92, "text": "die Speedtests? Net, die gibt es ja auch. Und es gibt dann im Prinzip so ein Frontend,"}, {"id": 72, "start": 481.92, "end": 486.2, "text": "wo man draufklicken kann und dann zeigt es dir an, wie viel Bandbreite man so hat und"}, {"id": 73, "start": 486.2, "end": 491.36, "text": "welchen Ping. Und dann muss das Ganze natürlich auch noch ein Backend bestehen, wo man, ja"}, {"id": 74, "start": 491.36, "end": 496.76, "text": "man muss ja irgendwo was hochladen. Also sprich, man braucht zwei Komponenten davon. Oh nein,"}, {"id": 75, "start": 496.76, "end": 501.52, "text": "IP League, schon wieder schlimm. Chat ist schon reingehackt hier, ich sehe es schon."}, {"id": 76, "start": 501.52, "end": 505.88, "text": "Das Botnetz aus Polen ist schon am Start. Aber sag es nicht so laut, sonst kommen die"}, {"id": 77, "start": 505.88, "end": 511.72, "text": "wieder an den Start. Leute, heute please, keine DDoS, kein DDoS, ja. Heute nicht. Das hat"}, {"id": 78, "start": 511.72, "end": 516.96, "text": "mir schon gereicht, das letzte Mal. Deswegen, das erste, wie man bei jedem super agilen"}, {"id": 79, "start": 516.96, "end": 521.72, "text": "Projekt anfängt, ist natürlich ein Git Repo anzulegen. Oder, wie mein ehemaliger Azubi"}, {"id": 80, "start": 521.72, "end": 527.08, "text": "gesagt hätte, ein Jit Repo. Ein Jit Repo. Jit Repo, ja. Welches Jit Repo wollen Sie"}, {"id": 81, "start": 527.08, "end": 532.0, "text": "erstellen? Nein, nein. Ich lege jetzt einfach mal eins an. Wie nennen wir das Ding? Ich"}, {"id": 82, "start": 532.0, "end": 536.24, "text": "würde sagen Speedchamp wie die Seite. Einfach einfach Speedchamp. Ich schaue dir dabei zu,"}, {"id": 83, "start": 536.24, "end": 539.72, "text": "ne? Genau. Teamwork, weil ein anderer macht es. Kannst ja, kannst ja den Stream bei dir"}, {"id": 84, "start": 539.72, "end": 544.72, "text": "einplanen. Bei mir kannst du das Bild machen. Also. Wir machen gerade basically eine Reallife,"}, {"id": 85, "start": 544.72, "end": 548.72, "text": "Realtime Reaction auf dich. Genau, genau. Ich hoffe, es ist gar nicht so viel Verzögerung."}, {"id": 86, "start": 548.72, "end": 553.16, "text": "Es dürfte nicht so viel Verzögerung sein. Ich glaube nicht, nee. Wade, Max wurde das"}, {"id": 87, "start": 553.16, "end": 557.6, "text": "letzte Mal gedendost. Ja, wurde ich. Und du warst dabei, das weiß ich, weil ich habe"}, {"id": 88, "start": 557.6, "end": 564.44, "text": "dich im Chat damals gesehen. Okay, also wir legen ein Git Repo an. Wir machen kein großartiges"}, {"id": 89, "start": 564.44, "end": 567.88, "text": "Template oder sonst was. Public das Ganze. Das heißt, ihr könnt euch das dann auch angucken"}, {"id": 90, "start": 567.88, "end": 572.88, "text": "live, während wir hier dran rumbasteln. Ich sage euch aber gleich, das muss ich jetzt"}, {"id": 91, "start": 572.88, "end": 577.52, "text": "mal so disclaimer, falls irgendwas überhaupt nicht klappt, ne? Also wir werden jetzt heute"}, {"id": 92, "start": 577.52, "end": 581.44, "text": "nicht durchziehen, bis es dann wirklich funktioniert. Wir denken, es klappt so in zwei, drei Stunden,"}, {"id": 93, "start": 581.44, "end": 587.76, "text": "aber ja, Planung und Realität ist so eine Sache, ne? Müssen wir mal schauen. So, ich"}, {"id": 94, "start": 587.76, "end": 593.0, "text": "leg mal, ich mache einfach ein ganz normales leeres Repo ohne irgendwas. Gibt's Speedtest"}, {"id": 95, "start": 593.0, "end": 596.84, "text": "und ich lade dich gleich mal zu ein. Obwohl, ich muss dich wahrscheinlich, doch, ich sollte"}, {"id": 96, "start": 596.84, "end": 601.12, "text": "dich zu einladen. Doch, du musst mich als Maintainer einladen. Genau, genau, mach ich."}, {"id": 97, "start": 601.12, "end": 605.52, "text": "Weil sonst musst du irgendwie Pull-Request und Gedöns machen und so. Wir müssen es ja"}, {"id": 98, "start": 605.52, "end": 611.56, "text": "nicht übertreiben. Warte mal, wie ging das jetzt nochmal? Bin ich jetzt blöd? Ich habe"}, {"id": 99, "start": 611.56, "end": 614.76, "text": "dich letztens doch auch erst zu was eingeladen. Wo war das denn nochmal? Manage Access glaub"}, {"id": 100, "start": 614.76, "end": 619.56, "text": "ich, ne? Manage Access. Ja, Direct Access hier in weit. Du musst das Repo noch umbenennen."}, {"id": 101, "start": 619.56, "end": 626.08, "text": "Wieso? Du hast es nicht Speedchamp genannt. Oh, ich habe Speedtest genannt. Oh nein. Hier,"}, {"id": 102, "start": 626.08, "end": 634.04, "text": "Abmahnung ist direkt raus. Das muss gleich gelöscht werden. Das muss gleich weg. Du kannst"}, {"id": 103, "start": 634.04, "end": 635.6, "text": "das ganz oben, kannst du das, du kannst das auch rename, musst nicht löschen. Das kommt"}, {"id": 104, "start": 635.6, "end": 640.4, "text": "weg. Das muss von Anfang an richtig sein. So, jetzt nochmal. Also, New Repo. So, noch ein"}, {"id": 105, "start": 640.4, "end": 646.32, "text": "Stream kurz neu starten. Genau, Speedchamp. So, dann mal so, past public. Wir machen keine"}, {"id": 106, "start": 646.32, "end": 651.36, "text": "readme, keine get ignore. Das mache ich dann gleich von Hand. Create Repo. Und jetzt füge"}, {"id": 107, "start": 651.36, "end": 656.2, "text": "ich dich mal hinzu. Jetzt bin ich mir nicht sicher. Muss ich dich da? Ich glaube, man"}, {"id": 108, "start": 656.2, "end": 661.68, "text": "konnte nach den Leuten suchen, ne? Ich glaube auch. Dann wäre es einfach nur L. Da bist"}, {"id": 109, "start": 661.68, "end": 669.8, "text": "du. Da. Minus. Hab dich. Easy. So, jetzt hast du Berechtigung. Wir hoffen, dass wir nix"}, {"id": 110, "start": 669.8, "end": 677.12, "text": "leaken. Irgendwelche Keys oder sonst wie. Man weiß ja nie. Okay, Repo ist am Start,"}, {"id": 111, "start": 677.12, "end": 685.76, "text": "noch nix drinne. Das heißt, wir können uns den ganzen Kram schon mal klonen. Ich hoffe,"}, {"id": 112, "start": 685.76, "end": 690.64, "text": "ich hab mein SSH Key hier. Ich muss jetzt mal gucken, ob ich noch ne Mail oder so bestätigen"}, {"id": 113, "start": 690.64, "end": 695.88, "text": "muss. Ja. Dann hoffen, dass ich meine Mails nicht liege. Das ist jetzt egal. Das ist halt"}, {"id": 114, "start": 695.88, "end": 701.4, "text": "so dieser Hintergrund. Ja, da muss man echt aufpassen. Leute, ich verwende Vmware Workstation."}, {"id": 115, "start": 701.4, "end": 708.28, "text": "Chat fragt mich gerade, was ich für eine Vmware oder Vm-Lösung verwende. Ich verwende Vmware"}, {"id": 116, "start": 708.28, "end": 714.2, "text": "Workstation auf dem Desktop. Hast du, auf was bist du gerade unterwegs? Windows, Mac oder"}, {"id": 117, "start": 714.2, "end": 721.48, "text": "Linux? Ich bin auf Windows unterwegs. Ganz classic. Es gibt Leute, die Edge benutzen."}, {"id": 118, "start": 721.48, "end": 730.68, "text": "Ja, ich benutze Edge. Was? Ich benutze tatsächlich Edge. Hin und wieder. Okay, kann man jetzt"}, {"id": 119, "start": 730.68, "end": 734.68, "text": "seit der Chrome basiert ist, kann man sich das ja sogar auch geben. Chat hier auch wieder"}, {"id": 120, "start": 734.68, "end": 743.64, "text": "am Lästern. Wer benutzt Edge? Wer ist dieser Noel im Hintergrund? Ist das der Shithub-BMI-Rechner-Azubi?"}, {"id": 121, "start": 743.64, "end": 749.44, "text": "Nein, nein, nein, nein, nein, nein. Der Azubi mit dem Shithub, das ist her Endpunkt. Das"}, {"id": 122, "start": 749.44, "end": 754.24, "text": "ist allerdings nicht der Noel. Das sind zwei unterschiedliche Leute. Stimmt, aber gleich"}, {"id": 123, "start": 754.24, "end": 759.32, "text": "Anfangsbuchstabe. Ja. Ich kann es jetzt sagen, weil ich hab ihn gefragt, ob das geht. Der"}, {"id": 124, "start": 759.32, "end": 763.88, "text": "Shithub-Azubi heißt Niklas. Also kann man das vielleicht ein bisschen unterscheiden?"}, {"id": 125, "start": 763.88, "end": 769.12, "text": "Nein, das ist er nicht. Das ist er nicht. Du arbeitest auch in Frankfurt mittlerweile,"}, {"id": 126, "start": 769.12, "end": 772.4, "text": "ne? Ich arbeite auch in Frankfurt, ja. Wir sind uns aber noch nie über den Weg gelaufen."}, {"id": 127, "start": 772.4, "end": 780.04, "text": "Ne. Nur auf YouTube. Also wir kennen uns nicht. Es ist nicht der Shithub-Azubi. Genau. Das"}, {"id": 128, "start": 780.04, "end": 790.56, "text": "wäre aber schon lustig. Das wäre witzig gewesen, ja. Gut. Also, ja, ich hab angelegt."}, {"id": 129, "start": 790.56, "end": 796.72, "text": "Repo ist am Start. Du müsstest jetzt klonen können. Und ich würde sagen, ich leg jetzt"}, {"id": 130, "start": 796.72, "end": 800.88, "text": "einfach mal, dass du anfangen kannst, ich leg jetzt einfach mal ein.NET-Projekt an."}, {"id": 131, "start": 800.88, "end": 805.72, "text": "Oder wie wollen wir das überhaupt machen? Das ist eh die Frage. Also was nehmen wir"}, {"id": 132, "start": 805.72, "end": 809.64, "text": "eigentlich für Technik dafür? Wie gesagt, wir wollen einen Speedtest programmieren."}, {"id": 133, "start": 809.64, "end": 816.92, "text": "Das zeigt die Leute ja noch. Hallo? Ich firefox restarten, Alter. Nerv nicht. Okay, restarten."}, {"id": 134, "start": 816.92, "end": 822.32, "text": "Ähm, genau. Wir wollen einen Speedtest programmieren. Gibt's ja jede Menge Sachen. Es gibt ja"}, {"id": 135, "start": 822.32, "end": 829.16, "text": "zum Beispiel auch schon Lieber-Speed-Tests und solche Geschichten. Das sieht dann so"}, {"id": 136, "start": 829.16, "end": 837.28, "text": "aus. Wobei ich will es nicht zeigen, sonst ist noch mehr Leak angesagt. Nur gut. Also"}, {"id": 137, "start": 837.28, "end": 840.64, "text": "wie wollen wir das machen? Was ist denn da so eine gute Kombi? Also ich persönlich mag"}, {"id": 138, "start": 840.64, "end": 846.2, "text": "ja.NET C-Sharp im Backend und ein Backend in irgendeiner Art und Weise für Datei-Upload,"}, {"id": 139, "start": 846.2, "end": 851.88, "text": "Datei-Download und gucken, wie lange das braucht, wenn wir brauchen. Absolut. Also ich denke"}, {"id": 140, "start": 851.88, "end": 856.16, "text": "mal dadurch, dass wir das dann zu zweit dran arbeiten, teilen wir auf, ich mach Frontend,"}, {"id": 141, "start": 856.16, "end": 861.08, "text": "du machst Backend. So war es geplant, ja. Und dann gucken wir einfach, wie wir das dann"}, {"id": 142, "start": 861.08, "end": 865.8, "text": "hinbekommen. Ich mein, das Frontend, das wird jetzt nicht, das ist nur viel Aufwand sein."}, {"id": 143, "start": 865.8, "end": 869.08, "text": "Ich guck dann mal, dass ich das hinbekomme, vielleicht irgendwie cool aussehen zu lassen."}, {"id": 144, "start": 869.08, "end": 873.0, "text": "Kommt drauf an, wie fancy das aussieht, ne? Richtig, richtig, genau. Also wenn wir das"}, {"id": 145, "start": 873.0, "end": 878.0, "text": "auf speedtest.net-Niveau machen wollen mit so animierten, krassen Sachen, muss ich mal"}, {"id": 146, "start": 878.0, "end": 884.4, "text": "gucken. Ich bin jetzt auch kein CSS-Profi. Genau. Aber wir kriegen da schon was Schickes"}, {"id": 147, "start": 884.4, "end": 888.08, "text": "hin. Chat meint, wir sollen den Cobalt programmieren, das Backend. Alter, so ein Cobalt-Backend"}, {"id": 148, "start": 888.08, "end": 894.48, "text": "wäre jetzt echt schon... Erstmal ein IBM Mainframe im Keller für eine Runde Cobalt."}, {"id": 149, "start": 894.48, "end": 899.12, "text": "Bin mir nicht sicher, ob man Web-Anwendungen in Cobalt programmieren kann, aber im Zweifelsfall"}, {"id": 150, "start": 899.12, "end": 905.92, "text": "schon. Im Zweifel kriegen wir das hin. Ob wir das hin kriegen, weiß ich nicht. Man kann"}, {"id": 151, "start": 905.92, "end": 911.6, "text": "es auf jeden Fall machen. Das ist Enterprise. Das ist richtig, Business Enterprise. Ja,"}, {"id": 152, "start": 911.6, "end": 918.56, "text": "und dann noch ne, wie heißt dieses Java-Zeug, nicht Webforms, so Applets oder sowas, was"}, {"id": 153, "start": 918.56, "end": 925.4, "text": "richtig oldschool ist. Oh Gott, das sind Java-Applets. Ja, mit Browser-Plugin. Nein, wir machen"}, {"id": 154, "start": 925.4, "end": 931.76, "text": "es nicht in Azure-Chat. Wir machen es heute auf einem Server von Hetzner, den werde ich"}, {"id": 155, "start": 931.76, "end": 935.52, "text": "gleich anlegen. Das heißt, ich würde sagen, wir machen jetzt erstmal Folgendes, dass wir"}, {"id": 156, "start": 935.52, "end": 939.72, "text": "anfangen können, wo wir nicht so viel Leerlauf haben. Ich lege jetzt einfach mal zwei Ordner"}, {"id": 157, "start": 939.72, "end": 944.68, "text": "an. Richtig, du legst die Ordner an, ich clone mir das und dann... Wir machen einfach so,"}, {"id": 158, "start": 944.68, "end": 949.92, "text": "wir machen zwei Ordner. Wir machen zwei Ordner, Speedtest-Backend, Speedtest-Frontend, dass"}, {"id": 159, "start": 949.92, "end": 954.48, "text": "wir ein bisschen unabhängig da voneinander rumwursten können. Im Backend-Ordner mache"}, {"id": 160, "start": 954.48, "end": 959.4, "text": "ich dann meine.NET-Anwendung und im Frontend kannst du dein Zeug machen, komplett unabhängig"}, {"id": 161, "start": 959.4, "end": 963.16, "text": "von dem, was ich mache. Wir haben uns überlegt, dass wir uns gegenseitig zugucken können."}, {"id": 162, "start": 963.16, "end": 967.56, "text": "Muss ich vielleicht auch gleich nochmal zeigen. Wir haben uns hier in Visual Studio Code geadded,"}, {"id": 163, "start": 967.56, "end": 971.4, "text": "das können wir gleich mal ausprobieren, ob das funktioniert. Das gucken wir mal. Dann"}, {"id": 164, "start": 971.4, "end": 976.04, "text": "können wir uns nämlich gegenseitig zugucken, wie wir das Ganze programmieren. Oder wenn"}, {"id": 165, "start": 976.04, "end": 981.24, "text": "einer mal sagt, guck mal bei mir rein, dann können wir schauen. Also, gucken wir uns"}, {"id": 166, "start": 981.24, "end": 986.76, "text": "das mal an. Also, ich habe die Ordner angelegt, wir machen hier mal... Wir bräuchten noch"}, {"id": 167, "start": 986.76, "end": 994.36, "text": "eine Git-Ignore-File, glaube ich. An sich ja, beziehungsweise du kannst sie dann auch in"}, {"id": 168, "start": 994.36, "end": 999.8, "text": "den jeweiligen Unterordnern einfach drin haben und dann Projekt bezogen. Stimmt, ist wahrscheinlich"}, {"id": 169, "start": 999.8, "end": 1005.08, "text": "besser. Gut, dann lade ich jetzt einfach mal hoch. Also, mit React genau wird automatisch"}, {"id": 170, "start": 1005.08, "end": 1012.08, "text": "eine Git-Ignore erstellt mit dem Boilerplate-Code. Speed, Champ, Backend. Ich werde jetzt einfach"}, {"id": 171, "start": 1012.08, "end": 1017.6, "text": "mal da drin schnell ein.NET-Projekt erstellen, committen und hochladen, dann kannst du dir"}, {"id": 172, "start": 1017.6, "end": 1023.88, "text": "das Ganze klonen. Oh nein, mein Trial-Zeitraum ist zufälligerweise wieder auf 30 Tage hoch."}, {"id": 173, "start": 1023.88, "end": 1032.04, "text": "Geiler gesehen. Gleich gibt es Root-Passwort liegen. Na, ich versuche, Leute, ich versuche"}, {"id": 174, "start": 1032.04, "end": 1040.2, "text": "nicht das Root-Passwort zu liegen. So, also, legen wir mal eine neue Solution an. Und"}, {"id": 175, "start": 1040.2, "end": 1047.64, "text": "zwar im Ordner... Wo habe ich das jetzt hingemacht? Speed, Champ, Speed, Champ, Speed, Champ,"}, {"id": 176, "start": 1047.64, "end": 1054.32, "text": "Backend. Man kann es ja auch übertreiben. So, Create Directory for Solution. Nope. Was?"}, {"id": 177, "start": 1054.32, "end": 1061.64, "text": "Absolute Parts? Hüte. Home, Max. Wollen sie jetzt aber wissen hier. Alles klar. Das ist"}, {"id": 178, "start": 1061.64, "end": 1067.2, "text": "nicht so agil. Das ist nicht so agil, nee. Solution Name, Speed, Champ. Wie oft ich"}, {"id": 179, "start": 1067.2, "end": 1073.48, "text": "das Wort heute wahrscheinlich noch schreiben werde. Ey, bei jedem Speed, Champ ein Shot."}, {"id": 180, "start": 1073.48, "end": 1077.88, "text": "Ich sage, wie es ist. Also, ich habe hier Orangensaft. Das reicht wahrscheinlich nicht."}, {"id": 181, "start": 1077.88, "end": 1085.68, "text": "So, also wir brauchen ASP.NET Core Web-Application. Empty. Wir machen eine Web-AP. Letztendlich"}, {"id": 182, "start": 1085.68, "end": 1091.16, "text": "wird das Backend relativ übersichtlich. Was soll das Speed, Champ sein? Eine Speed-Test-Seite,"}, {"id": 183, "start": 1091.16, "end": 1096.64, "text": "die wir hier live zusammen heute im Stream entwickeln werden. Komplett von Anfang an"}, {"id": 184, "start": 1096.64, "end": 1103.16, "text": "bis hoffentlich Ende. Wir werden sehen, aber kriegen wir, denke ich, hin. Gibt es jetzt"}, {"id": 185, "start": 1103.16, "end": 1109.28, "text": "etwas, was ich hier gemacht habe? Project Files. Zum Teufel, da legt das hier nochmal"}, {"id": 186, "start": 1109.28, "end": 1116.6, "text": "drin an. Weg. Kann ich jetzt irgendwie dazu überreden, dass er das im gleichen Verzeichnis"}, {"id": 187, "start": 1116.6, "end": 1122.52, "text": "macht? Ich verschiebe den Kram einfach, klein mir wurscht. So, also wir wollen keine Authentifizierung"}, {"id": 188, "start": 1122.52, "end": 1132.44, "text": "haben. Wir benutzen C-Sharp im Backend. Put Same Directory. Ja, schön. Create. Ich werde"}, {"id": 189, "start": 1132.44, "end": 1137.2, "text": "das jetzt einfach nochmal kurz umschieben und dann passt das. Das kriegst du hin. I"}, {"id": 190, "start": 1137.2, "end": 1141.32, "text": "believe in you. Genau, dann kannst du dir das Ganze... Ich lasse die Fall... Ich mach noch"}, {"id": 191, "start": 1141.32, "end": 1145.72, "text": "gar nichts drinne. Ich lasse... Guck, der Chat weiß es schon wieder besser. Das Chat"}, {"id": 192, "start": 1145.72, "end": 1161.88, "text": "ist schon wieder triggert. Bin ich jetzt blöd? Wo ist es denn? Was? Sag mal, hä? Wo?"}, {"id": 193, "start": 1161.88, "end": 1167.44, "text": "Wozu? Wo habe ich das jetzt erstellt? Sitze, Leute, es fängt schon bei den einfachen Sachen"}, {"id": 194, "start": 1167.44, "end": 1175.28, "text": "an. Chat schreit schon wieder rum, das ist falsch, das ist falsch. What the fuck? Chat,"}, {"id": 195, "start": 1175.28, "end": 1181.08, "text": "wo habe ich es falsch gemacht? Ich erstelle einfach schon mal mein Projekt und move das"}, {"id": 196, "start": 1181.08, "end": 1189.64, "text": "dann einfach auf. Mach das, mach das. Bin ich jetzt total verwirrt? Home, Max? Okay,"}, {"id": 197, "start": 1189.64, "end": 1194.76, "text": "also ich hätte nicht gedacht, dass es schon am Projektanlegen scheitert, aber man kann"}, {"id": 198, "start": 1194.76, "end": 1201.28, "text": "das doch sicherlich hier öffnen. Show im File Manager. Ist doch was da? Leckt bei euch"}, {"id": 199, "start": 1201.28, "end": 1207.44, "text": "im Stream manchmal, schreiben die Leute bei mir in den Chat. Der Stream? Ich weiß nicht,"}, {"id": 200, "start": 1207.44, "end": 1211.68, "text": "vielleicht kann die Kamera ein bisschen laggen, aber der Stream sollte an sich eigentlich"}, {"id": 201, "start": 1211.68, "end": 1216.24, "text": "optimal sein. Ja, also das sollte nichts sein. Ich weiß nicht, Leute, leckt es bei euch,"}, {"id": 202, "start": 1216.24, "end": 1222.12, "text": "ich habe hier die Vorschau an, da ist absolut gar nichts laggy. Ach, ich bin blöd, ich"}, {"id": 203, "start": 1222.12, "end": 1228.2, "text": "habe es wirklich im falschen Ordner erstellt. Hier ist es. Okay, YouTube zeigt mir auch"}, {"id": 204, "start": 1228.2, "end": 1232.08, "text": "eine gute Verbindung. Wer streamt denn auch mit WLAN? Ja, ich kann mir keinen LAN-Kabel"}, {"id": 205, "start": 1232.08, "end": 1236.76, "text": "hier durch die Wohnung ziehen, das geht nicht. Das wäre hässlich. Aber es ist 5 Gigahertz"}, {"id": 206, "start": 1236.76, "end": 1241.12, "text": "Netz, das passt. Kannst ja mal den Speedtest dann machen. Okay, der Stream hängt sich manchmal"}, {"id": 207, "start": 1241.12, "end": 1247.76, "text": "zusammen. Streamst du über WLAN? Ich streame tatsächlich über WLAN, ja. Okay. Die Buchsen"}, {"id": 208, "start": 1247.76, "end": 1251.76, "text": "in meiner Wohnung, die sind da so scheiße gelegt, dass ich basically an meinem Arbeitsplatz"}, {"id": 209, "start": 1251.76, "end": 1258.96, "text": "mir keinen LAN-Kabel verlegen kann, außer dass ich jetzt quasi einmal komplett um meine"}, {"id": 210, "start": 1258.96, "end": 1265.36, "text": "gesamte Wohnung mir eins ziehen müsste. Und ich will es halt nicht direkt über, klar"}, {"id": 211, "start": 1265.36, "end": 1274.88, "text": "durch die Wohnung. Ja, zur Not 100 Meter LAN-Kabel. Habe ich hier für Dinger angelegt, ey. Ich"}, {"id": 212, "start": 1274.88, "end": 1280.56, "text": "fail. Jetzt lag das. Oh, vielleicht muss ich meinen Bitrate einfach ein bisschen runter"}, {"id": 213, "start": 1280.56, "end": 1292.28, "text": "machen. Ach, tatsächlich. Okay, sollte eigentlich nicht laggen. Ich schraube mal die Bitrate"}, {"id": 214, "start": 1292.28, "end": 1301.48, "text": "runter. Ah, da muss ich den Stream selber wahrscheinlich kurz neu starten, ne? Also in OBS nicht. Du"}, {"id": 215, "start": 1301.48, "end": 1309.08, "text": "kannst in OBS normalerweise die Bitrate ändern, es sei denn, wo das nicht funktioniert, ist,"}, {"id": 216, "start": 1309.08, "end": 1319.28, "text": "wenn du über NVIDIA Decoder streamst. Dann geht das glaube ich nicht. Ja, okay, es lag"}, {"id": 217, "start": 1319.28, "end": 1324.0, "text": "auf jeden Fall. Ich kriege da gerade auch Benachrichtigungen dafür. Echt? Also ich"}, {"id": 218, "start": 1324.0, "end": 1329.36, "text": "streame mit Streamlabs OBS. Die Beeinstellungen dürften ja basically the same sein. Ja, ne,"}, {"id": 219, "start": 1329.36, "end": 1340.24, "text": "dann mach mal die Bitrate ein bisschen runter. Aber Chat, bei mir lag nichts, oder? Gucken,"}, {"id": 220, "start": 1340.24, "end": 1346.04, "text": "was die Leute sagen, aber bei mir sollte eigentlich alles in Ordnung sein. Hoffentlich streamt"}, {"id": 221, "start": 1346.04, "end": 1351.92, "text": "er wenigstens über Wi-Fi 6. Ich glaube kaum einer hat Wi-Fi 6 Geräte. Oder streams über"}, {"id": 222, "start": 1351.92, "end": 1358.72, "text": "Wi-Fi 6? Nein, ich glaube nicht. Ich glaube nicht. Okay, also ich habe jetzt den Kram"}, {"id": 223, "start": 1358.72, "end": 1377.72, "text": "angelegt, ich push das jetzt mal aufgetappt. Oh nein. Warte, ich will kein neues Erregnungsverstärkter"}, {"id": 224, "start": 1377.72, "end": 1406.72, "text": "haben. Mach mal Git Ignore, dass ich den ganzen Kram nicht mit hochlade, den ich nicht brauche."}, {"id": 225, "start": 1406.72, "end": 1413.36, "text": "Also wir wollen das ganze IDE Zeug, brauchen wir nicht. Und wir brauchen Out und Bin auch"}, {"id": 226, "start": 1413.36, "end": 1424.96, "text": "nicht. Okay, wunderbar. Jetzt habe ich einen zweiten Stream gestartet. Oh fuck. YouTube,"}, {"id": 227, "start": 1424.96, "end": 1428.64, "text": "das wird ein Speedtest. Ja Leute, wir haben noch ein bisschen Anlaufschwierigkeiten gerade."}, {"id": 228, "start": 1428.64, "end": 1438.4, "text": "So dumm bei YouTube. Ich verstehe es eh nicht. Die wurschteln seit Jahren an ihrem YouTube"}, {"id": 229, "start": 1438.4, "end": 1444.48, "text": "Streaming Zeugs rum und kriegen es aber echt nicht gebacken. Aber gar nicht. Sehr, sehr,"}, {"id": 230, "start": 1444.48, "end": 1460.48, "text": "sehr komisch, ne? Egal, müssen die Leute den neuen Stream öffnen. Link zum Teilenabrufung."}, {"id": 231, "start": 1460.48, "end": 1477.76, "text": "So, jetzt passt das. Git Commit A minus M. Init. Git Push Origin Master. Perfekt. Alles"}, {"id": 232, "start": 1477.76, "end": 1482.88, "text": "klar. So, ich habe jetzt nach sehr viel Hin und Her und sinnlosem Rumgeschieben geschafft,"}, {"id": 233, "start": 1482.88, "end": 1488.44, "text": "dass unser GitHub Projekt zumindest steht. Wunderbar. Chat gibt ihr recht, also YouTube"}, {"id": 234, "start": 1488.44, "end": 1494.04, "text": "ist schlimm geworden. Was ich auf YouTube nicht so genau verstehe, ist, die haben ja"}, {"id": 235, "start": 1494.04, "end": 1499.84, "text": "mal großartig angekündigt, sie wollen jetzt auch im Game Streaming Bereich Twitch Konkurrenz"}, {"id": 236, "start": 1499.84, "end": 1504.28, "text": "machen. Und das Einzige, was die gemacht haben, ist, ihre normales verkacktes Streaming genommen"}, {"id": 237, "start": 1504.28, "end": 1509.8, "text": "und ein Darksteam dran geklebt. Und da tun jetzt irgendwie als wäre das super toll. Also"}, {"id": 238, "start": 1509.8, "end": 1514.92, "text": "ich habe echt keine Ahnung, warum man das auf YouTube streamen soll. Ich verstehe das"}, {"id": 239, "start": 1514.92, "end": 1519.24, "text": "auch nicht. Ich verstehe das auch nicht. Ey, zur Not, wenn das jetzt wieder Probleme"}, {"id": 240, "start": 1519.24, "end": 1525.92, "text": "macht, ich mache mir einen Twitch-Account und let's fucking go. Ne, das muss jetzt eigentlich"}, {"id": 241, "start": 1525.92, "end": 1532.04, "text": "funktionieren. Aber sollte gehen. Sollte gehen. Ich will doch nur ein bisschen JavaScript-Spaghetti-Code"}, {"id": 242, "start": 1532.04, "end": 1536.04, "text": "machen. Genau. Ich muss schon die ersten Leute bannen, weil mir da irgendwie blödes Zeug"}, {"id": 243, "start": 1536.04, "end": 1543.4, "text": "rumgespammt wird. Oh ne, heute übrigens das Ausrufezeichen heute stimmt nicht. Wir spielen"}, {"id": 244, "start": 1543.4, "end": 1550.76, "text": "heute kein Half-Life-Mod. Nein, nein. Hab ich über euch die richtige Kategorie? Ja, Science"}, {"id": 245, "start": 1550.76, "end": 1557.64, "text": "and Technology, das passt. Ach, jetzt ist das wieder nur... ach, egal, funktioniert. Leute"}, {"id": 246, "start": 1557.64, "end": 1567.76, "text": "sind da, wunderbar. Top. So mehr oder weniger. Jetzt müssen wir noch den neuen Chat holen."}, {"id": 247, "start": 1567.76, "end": 1573.52, "text": "Dann brauchst du dann gleich noch mal den Link zu mir in den Kommentaren. Genau, kannst"}, {"id": 248, "start": 1573.52, "end": 1584.92, "text": "du machen. Teilen, zack. 300 Zuschauer, was ist da los? Ja, die Leute haben heute frei"}, {"id": 249, "start": 1584.92, "end": 1590.16, "text": "und wollen nichts. Die haben schon darauf gewartet, dass sie uns hier beim Failing zugucken"}, {"id": 250, "start": 1590.16, "end": 1595.76, "text": "können. Ist so, ist so. Ich gucke mal. Freitag Mittag. Weißt du, bei dem Wetter, was willst"}, {"id": 251, "start": 1595.76, "end": 1601.72, "text": "du da auch anderes machen? Es geht eigentlich bei mir. Es ist gar nicht so wild. Es hat"}, {"id": 252, "start": 1601.72, "end": 1605.64, "text": "heute Morgen ein bisschen gewittert, aber jetzt ist sogar ein bisschen Sonne. Geht. Also"}, {"id": 253, "start": 1605.64, "end": 1611.08, "text": "hältst Hälschin Grenzen. Hier ist es richtig heiß gefüllt. Richtig. Ja, es ist, es ist"}, {"id": 254, "start": 1611.08, "end": 1619.92, "text": "richtig, es ist ultraspül. Genau, genau. Bovel. Also dein Stream ist immer noch off. Ja ja,"}, {"id": 255, "start": 1619.92, "end": 1624.32, "text": "ich habe einen neuen Link jetzt. Ach so. Ja, wie gesagt, ich konnte, ich konnte das nicht"}, {"id": 256, "start": 1624.32, "end": 1630.64, "text": "mal. Ich sehe es. Ich sehe es. Okay, wunderbar. Meine Güte, es ist so fail auf YouTube. Es"}, {"id": 257, "start": 1630.64, "end": 1635.76, "text": "ist total bescheuert. Es ist total bescheuert. Gut, wunderbar. Ja, sag, wenn es so weit ist."}, {"id": 258, "start": 1635.76, "end": 1642.52, "text": "Also ich habe den Gramm jetzt hochgeladen. Naja, also ich, ich bin ready basically. Chat"}, {"id": 259, "start": 1642.52, "end": 1645.92, "text": "möchte wissen, mit welchen Sprachen wir das programmieren. Also ich würde mal sagen,"}, {"id": 260, "start": 1645.92, "end": 1648.68, "text": "wir sind uns noch nicht so hundertprozentig sicher, was es jetzt im Detail alles wird,"}, {"id": 261, "start": 1648.68, "end": 1653.84, "text": "aber Sprachen können wir schon sagen. Wir machen Backend. Backend wird.net, C-Sharp,"}, {"id": 262, "start": 1653.84, "end": 1659.56, "text": "Frontend wird logischerweise JavaScript, was auch sonst. Wird schwierig und du machst"}, {"id": 263, "start": 1659.56, "end": 1664.08, "text": "wahrscheinlich in React. Genau, ich mache das mit React. Da habe ich so am meisten Erfahrung,"}, {"id": 264, "start": 1664.08, "end": 1670.0, "text": "ist an sich natürlich auch Overkill. Klar, so ein bisschen, aber wäre ja sonst, wäre"}, {"id": 265, "start": 1670.0, "end": 1674.04, "text": "ja sonst langweilig. Das heißt Frontend mit React. Gucken, ob ich mir noch irgendeine"}, {"id": 266, "start": 1674.04, "end": 1679.52, "text": "CSS-Library hinzufüge und gucken wir mal, dass das passt. Hast du gesehen, dass man"}, {"id": 267, "start": 1679.52, "end": 1684.8, "text": "jetzt mit Blazor, dass die jetzt auch angefangen haben, mit C-Sharp in den Browser zu bringen?"}, {"id": 268, "start": 1684.8, "end": 1692.2, "text": "Mhm, das Blazor WebAssembly und so weiter. Das wollte ich mir auch mal C-Sharp mal anschauen,"}, {"id": 269, "start": 1692.2, "end": 1697.76, "text": "weil das an sich echt nice ist. Ja, also ich muss sagen, ist meine persönliche Lieblingssprache,"}, {"id": 270, "start": 1697.76, "end": 1701.24, "text": "wenn es halt nichts gibt, was dagegen spricht. Es gibt ein paar, gibt Projekte, wenn du irgendwie"}, {"id": 271, "start": 1701.24, "end": 1704.44, "text": "einen Bootloader programmieren willst oder sowas, dann ist weder JavaScript noch C-Sharp"}, {"id": 272, "start": 1704.44, "end": 1709.48, "text": "wahrscheinlich das Mittel der Wahl, aber ansonsten ist das echt cool. Was ich bei Blazor ein bisschen"}, {"id": 273, "start": 1709.48, "end": 1713.72, "text": "dumm finde, ist, also immer noch, ich glaube, das werden sie noch fixen in Zukunft, Blazor ist an"}, {"id": 274, "start": 1713.72, "end": 1719.48, "text": "sich ein bisschen langsam im Vergleich zu JavaScript, aber es ist halt ein riesen Download. Also wenn du"}, {"id": 275, "start": 1719.48, "end": 1724.32, "text": "das starten willst, dann muss ja komplette.NET Runtime als WebAssembly runterladen. Du musst"}, {"id": 276, "start": 1724.32, "end": 1729.04, "text": "erst mal irgendwie, keine Ahnung, 15 MB oder so downloaden, dass die Seite überhaupt eine Chance hat,"}, {"id": 277, "start": 1729.04, "end": 1736.28, "text": "zu starten. Mhm, das stimmt. Aber ich glaube, das ist eine coole Sache. Generell, ich glaube,"}, {"id": 278, "start": 1736.28, "end": 1741.88, "text": "generell so mit WebAssembly kommen noch so ziemlich coole Sachen im Webbereich. Ja,"}, {"id": 279, "start": 1741.88, "end": 1747.0, "text": "denke ich auch. Gerade was Spiele und High-Performance-Sachen angeht oder wenn die"}, {"id": 280, "start": 1747.0, "end": 1752.0, "text": "mal anfangen, irgendwann so Dinge wie Photoshop oder so umzuziehen, dass es im Browser läuft."}, {"id": 281, "start": 1752.0, "end": 1757.48, "text": "Auf jeden Fall. Ich fühle mich wie so ein Rentner, weil ich die Schriftgröße von meinem Editor so"}, {"id": 282, "start": 1757.48, "end": 1764.24, "text": "groß habe, damit der Streamdata einigermaßen... Ich habe es auch immer mega fett. Aber ich hoffe,"}, {"id": 283, "start": 1764.24, "end": 1772.04, "text": "es funktioniert. So, ich habe jetzt auch mal ein Projekt offen. Wir können das jetzt mal mit"}, {"id": 284, "start": 1772.04, "end": 1777.68, "text": "Wishlist Studio Code gucken. Chet fragt gerade, wie willst du denn eigentlich die Geschwindigkeit"}, {"id": 285, "start": 1777.68, "end": 1783.44, "text": "messen von dem Up und Download? Soll ich da mal kurz was zu zeigen? Erzähl, erzähl. Also,"}, {"id": 286, "start": 1783.44, "end": 1787.12, "text": "wir haben uns im Vorfeld so ein bisschen Gedanken schon gemacht. Es gibt von Mozilla einen Artikel"}, {"id": 287, "start": 1787.12, "end": 1792.6, "text": "dazu. Mit Mathematik, ja, das stimmt. Ein bisschen rechnen muss man dabei. Zum Glück"}, {"id": 288, "start": 1792.6, "end": 1797.48, "text": "in Studierst du Informatik, da ist das kein Problem. Da kriegen wir das hin. Quasi Upload"}, {"id": 289, "start": 1797.48, "end": 1803.64, "text": "Size geteilt durch Zeit. Das sind schon Big Brain Quick Maths, was man dafür braucht. Aber"}, {"id": 290, "start": 1803.64, "end": 1809.24, "text": "wie man das macht, ich habe einen Artikel von Mozilla gefunden. Binary Upload oder sowas. Wir"}, {"id": 291, "start": 1809.24, "end": 1815.84, "text": "werden das, genau hier, Sending and Receiving. Ich kann dir mal den Link schicken. Falls du"}, {"id": 292, "start": 1815.84, "end": 1822.96, "text": "den später brauchst. Siehe Discord. Die haben ein Beispiel hier von Mozilla und wir werden das"}, {"id": 293, "start": 1822.96, "end": 1828.44, "text": "komplett ohne viel Overhead machen. Das heißt, wir senden wirklich Binary Zeug. Also wir machen"}, {"id": 294, "start": 1828.44, "end": 1836.64, "text": "jetzt kein Form Upload oder sowas, wo dann quasi ein 10% oder so der hochgeladenen Daten so Overhead"}, {"id": 295, "start": 1836.64, "end": 1841.56, "text": "sind, sondern wir schieben wirklich Bites hoch. Und das ist hier neu. Da brauchst du einen halbwegs"}, {"id": 296, "start": 1841.56, "end": 1846.64, "text": "neuen Browser. Was heißt halbwegs neuen Browser? Halbwegs neuen Browser. Ein Browser, der älter ist,"}, {"id": 297, "start": 1846.64, "end": 1852.64, "text": "also jünger ist als drei, vier Jahre. Und da kann man jetzt direkt Bites hochladen. Und wir"}, {"id": 298, "start": 1852.64, "end": 1858.88, "text": "werden einfach, haben wir uns jetzt überlegt, so ein 20 MB Bite Array nehmen und einfach hochladen"}, {"id": 299, "start": 1858.88, "end": 1862.64, "text": "und gucken und auf dem Server messen. Oder im Kleinen messen, müssen wir mal gucken, wie"}, {"id": 300, "start": 1862.64, "end": 1867.28, "text": "lange der Upload dauert. Und dann sollte es relativ simpel sein. Wir wissen, dass wir 20 MB"}, {"id": 301, "start": 1867.28, "end": 1872.0, "text": "hochgeladen haben und wir wissen, wenn wir das messen, wie lange das gedauert hat. Und von der"}, {"id": 302, "start": 1872.0, "end": 1881.56, "text": "Theorie hier ist dann Upload Size durch Upload Zeit, ja, die Geschwindigkeit. So weit in der Theorie."}, {"id": 303, "start": 1881.56, "end": 1888.88, "text": "Wir sollen mal schauen, wie das Ganze funktioniert. Und das Gleiche im Download auch. Genau. Es wird"}, {"id": 304, "start": 1888.88, "end": 1893.24, "text": "jetzt nicht so detailreich sein, aber das ist ja auch, ich denke mal, am Anfang noch nicht der,"}, {"id": 305, "start": 1893.24, "end": 1899.32, "text": "das sind nur zwei. Hauptsache, da steht irgendeine Zahl in Emmet oder so. Und dann haben wir das."}, {"id": 306, "start": 1899.32, "end": 1903.08, "text": "Und dann so Problematiken, weil wir können jetzt zum Beispiel dadurch jetzt nicht groß"}, {"id": 307, "start": 1903.08, "end": 1906.68, "text": "eigentlich den Ping messen. Das stimmt. Wir können vielleicht höchstens sagen,"}, {"id": 308, "start": 1906.68, "end": 1912.56, "text": "okay, wie lange dauert, bis die Antwort kam, bis zur nächsten und so weiter. Deswegen werden"}, {"id": 309, "start": 1912.56, "end": 1917.32, "text": "wir das in so in dieser ersten Version so ein bisschen außen vor lassen. Genau. Ob wir da"}, {"id": 310, "start": 1917.32, "end": 1924.8, "text": "irgendwie so nah ran kommen an den Ping wie möglich. Genau. Wir werden einfach mal probieren,"}, {"id": 311, "start": 1924.8, "end": 1929.92, "text": "dass wir jetzt irgendwas halbwegs funktionieren, das hinkriegen. Und dann können wir das ja noch"}, {"id": 312, "start": 1929.92, "end": 1933.48, "text": "ein bisschen schöner machen. Ich sehe bei mir im Chat schon die Leute, das könnte man doch auch"}, {"id": 313, "start": 1933.48, "end": 1937.4, "text": "locker mit WebRTC machen. Jaja, könnte man sicherlich alles machen. Wir könnten über"}, {"id": 314, "start": 1937.4, "end": 1942.16, "text": "WebSockets machen. Wir könnten über WebRTC machen oder sonst was. Wir beschränken uns"}, {"id": 315, "start": 1942.16, "end": 1947.64, "text": "erstmal drauf für die erste Version. Wir schieben einfach ganz normal mit einem Postrequest Zeug"}, {"id": 316, "start": 1947.64, "end": 1951.76, "text": "hoch und laden Sachen runter und messen, wie lange es dauert. Und wenn das geht, kann man"}, {"id": 317, "start": 1951.76, "end": 1959.04, "text": "sicher überlegen, wie man weitermacht. Exactly. Genau. Ja, so sieht es aus. Okay,"}, {"id": 318, "start": 1959.04, "end": 1964.52, "text": "dann lass uns mal schnell probieren, ob Visual Studio Code funktioniert. Ich starte mal kurz"}, {"id": 319, "start": 1964.52, "end": 1970.92, "text": "eine Collaboration Session in der Hoffnung, ich leake den Join Link nicht. Das wäre nämlich"}, {"id": 320, "start": 1970.92, "end": 1980.28, "text": "ziemlich blöd jetzt. Code. Der Chat wartet schon drauf, ich sehe es schon. Gibt es schon"}, {"id": 321, "start": 1980.28, "end": 1986.24, "text": "ein agiles Jira-Board für das Projekt? Ah, stimmt. Ich weiß gar nicht. Das kann man aber bei GitHub."}, {"id": 322, "start": 1986.24, "end": 1991.04, "text": "Bei GitHub kannst du Boards erstellen. Stimmt, stimmt. GitHub-Issues kann man machen, ja. Ganz,"}, {"id": 323, "start": 1991.04, "end": 1996.0, "text": "ganz wichtig. Du kannst auch Cumber-Boards erstellen auf GitHub mittlerweile. Jawoll. Endlich. Endlich."}, {"id": 324, "start": 1996.0, "end": 2000.52, "text": "Da habe ich drauf gewartet, dass wir und da müssen wir vorher, aber wie du gesagt hast,"}, {"id": 325, "start": 2000.52, "end": 2005.2, "text": "wir müssen erst noch ein paar User-Stories definieren. Ja, das stimmt. Und Tribe-Meetings,"}, {"id": 326, "start": 2005.2, "end": 2012.28, "text": "ganz wichtig. Okay, Live-Share. Ich versuche mal wie Sign-In mit GitHub. Will mich das veräppeln?"}, {"id": 327, "start": 2012.28, "end": 2020.88, "text": "Ich habe mich eben schon Sign-Int. Lass mal gucken. Ich bin auch drin. Ich nicht. Das ist"}, {"id": 328, "start": 2020.88, "end": 2027.4, "text": "natürlich blöd. Okay, Chat, ihr müsst jetzt mal kurz weggucken. Ich blende euch jetzt aus."}, {"id": 329, "start": 2027.4, "end": 2045.12, "text": "So, ihr dürft jetzt nix sehen. Authorize. Open. Ja, mach. Wishlist Studio. So, sollte eigentlich,"}, {"id": 330, "start": 2045.12, "end": 2050.24, "text": "sollte eigentlich jetzt funktionieren. Ich mache mal wieder, mache mal wieder an. Guck"}, {"id": 331, "start": 2050.24, "end": 2054.88, "text": "jetzt mal ins Clipboard, dass ich nicht jetzt den Invite-Link irgendwie leake. Nee, nee,"}, {"id": 332, "start": 2054.88, "end": 2060.4, "text": "habe ich nicht. Okay, ich mache euch wieder an, Chat. Die Leute geiern immer so krass drauf,"}, {"id": 333, "start": 2060.4, "end": 2066.32, "text": "dass wenn was liegt, ey. Aber kann ich schon nachvollziehen. Okay, ich bin, Moment. Immer"}, {"id": 334, "start": 2066.32, "end": 2075.92, "text": "noch Sign-In? Was ist das schon wieder? Writing information to keychain failed. Ist das jetzt"}, {"id": 335, "start": 2075.92, "end": 2082.84, "text": "neueste GitHub-Kryptowährung? Blockchain-Login, oder? Dein Login kann nicht auf die Blockchain"}, {"id": 336, "start": 2082.84, "end": 2087.44, "text": "geschrieben werden. Deswegen können wir uns den Code in Visual Studio nicht teilen. Ach,"}, {"id": 337, "start": 2087.44, "end": 2094.28, "text": "jetzt geht's. Okay, alles klar. Invitation-Link has been copied to Clipboard. Ganz, ganz schlechte"}, {"id": 338, "start": 2094.28, "end": 2102.28, "text": "Idee. Ganz schlechte Idee. Ich invite dich aber vorher mal. Invite-Contact. Du müsstest jetzt"}, {"id": 339, "start": 2102.28, "end": 2110.52, "text": "was gekriegt haben. Ich schau mal. Also, ich habe dich. Yes. Ich habe accepted. Okay,"}, {"id": 340, "start": 2110.52, "end": 2117.68, "text": "joining. So, und jetzt mache ich mal kurz mein Clipboard leer. Clear. Und mach den Chat noch"}, {"id": 341, "start": 2117.68, "end": 2125.8, "text": "mal schwarz. Und gucke, ob es aus dem Clipboard raus ist. Ja, okay, wunderbar. Nein, sind nicht"}, {"id": 342, "start": 2125.8, "end": 2130.52, "text": "aus dem Clipboard. What the fuck? Alter, die wollen jetzt nicht ernsthaft, dass ich neu"}, {"id": 343, "start": 2130.52, "end": 2142.84, "text": "starte, dass es aus dem Clipboard verschwindet oder wie, oder was? Okay. Doch. Mach mal nicht."}, {"id": 344, "start": 2142.84, "end": 2151.56, "text": "Egal. Man sieht es eh nicht. Man sieht es eh nicht komplett. Man sieht es eh nicht. Mein"}, {"id": 345, "start": 2151.56, "end": 2156.24, "text": "Clipboard-Manager ist zu klein. Also, man sieht gar nicht den. Ich müsste es quasi explizit"}, {"id": 346, "start": 2156.24, "end": 2161.08, "text": "auswählen und dann irgendwo reinpasten. Man sieht das gar nicht in der Historie. Alles klar,"}, {"id": 347, "start": 2161.08, "end": 2165.96, "text": "alles liegt. Wunderbar. Bist du getjoint? Ich bin getjoint. Ich sehe jetzt. Siehst du"}, {"id": 348, "start": 2165.96, "end": 2173.6, "text": "Projektfiles und so? Yes. Ja, perfekt. Wunderbar. Da können wir anfangen. Was ist denn der Speed"}, {"id": 349, "start": 2173.6, "end": 2178.76, "text": "Champ? Wir versuchen, eine Speed-Testing-Seite zu bauen. Heute live im Stream zusammen. Daniel"}, {"id": 350, "start": 2178.76, "end": 2188.0, "text": "Kuell kümmert sich ums Frontend und ich kümmere mich ums Backend. Lass uns doch mal zusammen"}, {"id": 351, "start": 2188.0, "end": 2193.52, "text": "in der Datei gehen und gucken, ob es funktioniert. Ich bin gerade mal in dem Controller drin."}, {"id": 352, "start": 2193.52, "end": 2201.08, "text": "In dem Vettacontroller. Ist ja auch ein gutes Feature für unseren Speed-Test. Das ist das"}, {"id": 353, "start": 2201.08, "end": 2209.12, "text": "Standard-Web-Abi-Projekt. Da kriegst du das dabei. Heute ist es... Was? Sweltering? What"}, {"id": 354, "start": 2209.12, "end": 2216.04, "text": "the fuck? Ist das Schwül? Was ist Sweltering? Chat, Englisch-Profis, was ist Sweltering?"}, {"id": 355, "start": 2216.04, "end": 2235.0, "text": "Okay. Wenn der Chat das sagt, dann muss das so stimmen. Chat weiß sowas immer. Okay,"}, {"id": 356, "start": 2235.0, "end": 2245.2, "text": "im Prinzip scheint es zu funktionieren. Kannst du auch was reinschreiben? Ja, hab ich schon"}, {"id": 357, "start": 2245.2, "end": 2249.88, "text": "gerade. Hast du schon? Gut. Wunderbar. Das funktioniert. Wunderbar. Im Prinzip werde"}, {"id": 358, "start": 2249.88, "end": 2256.68, "text": "ich jetzt eh Folgendes machen mit dem Controller. Der kommt jetzt erstmal weg. Okay. Ich hab"}, {"id": 359, "start": 2256.68, "end": 2266.76, "text": "noch keine Permissions zu pushen. Echt nicht? Hast du nicht? 4-0-3 unauthorized bekommen."}, {"id": 360, "start": 2266.76, "end": 2270.4, "text": "Für die Wahrscheinlichkeit kann ich nicht direkt in den Main-Branch pushen. Müsstest"}, {"id": 361, "start": 2270.4, "end": 2276.48, "text": "du eigentlich? Ich hab nix extra protected oder so. Guck mal hier. Settings. Ich hab"}, {"id": 362, "start": 2276.48, "end": 2280.92, "text": "Manage Access. Du bist dabei. Du bist auch eingeloggt, oder? Nee, Pending-Invite. Du"}, {"id": 363, "start": 2280.92, "end": 2284.64, "text": "hast noch nicht angenommen. Ich hab noch nicht angenommen. Stark. Okay. Daran liegt's."}, {"id": 364, "start": 2284.64, "end": 2289.12, "text": "Weil jetzt hätte mich das echt gewonnen. Ich hab dich ja auch letztens eingeladen."}, {"id": 365, "start": 2289.12, "end": 2293.72, "text": "Ging sofort. Hä? Ja, das stimmt, das stimmt. Okay, dann muss ich mal gucken, wo diese Mail"}, {"id": 366, "start": 2293.72, "end": 2299.84, "text": "ankam. Ray Cohn, wir programmieren einen Schnelltest, einen Internet-Speedtest zusammen. Genau."}, {"id": 367, "start": 2299.84, "end": 2304.0, "text": "In der Hoffnung, dass du... Ah, hier ist die Invalid angekommen. Ach, ich wundere mich"}, {"id": 368, "start": 2304.0, "end": 2307.28, "text": "schon die ganze Zeit, warum in deinem Chat nix mehr kommt. Ich hab noch den alten Chat"}, {"id": 369, "start": 2307.28, "end": 2314.08, "text": "auf. Ich muss den neuen erstmal wieder auspoppen. So, Accept Invitation. Okay, wunderbar. Jetzt"}, {"id": 370, "start": 2314.08, "end": 2321.32, "text": "kann ich es nochmal probieren. Einen Corona-Schnelltest, einen Speedtest. Ohne Scheiß. Könnten wir"}, {"id": 371, "start": 2321.32, "end": 2328.2, "text": "einen Corona-Schnelltest programmieren hier? Wir werden reich. Online-Frontend-Corona-Schnelltest."}, {"id": 372, "start": 2328.2, "end": 2337.12, "text": "Weißt du, du musst unten in dein Maussensor reinhauchen. Ey, das wär doch mal geil, oder?"}, {"id": 373, "start": 2337.12, "end": 2345.36, "text": "Dass da nächstes Millionen-Start-up ist am Start. Da seh ich uns. So, wo ist denn jetzt"}, {"id": 374, "start": 2345.36, "end": 2354.0, "text": "mein... Visual Code Studio A. Also ich würd vorstellen, wir machen das so. Wir lassen dieses"}, {"id": 375, "start": 2354.0, "end": 2360.16, "text": "Visual Studio Code hier offen mit dem Code-Share, aber jeder wurstet in seiner eigenen Idee rum."}, {"id": 376, "start": 2360.16, "end": 2365.0, "text": "Genau. Na, da kommen wir uns auch nicht in die Quere. Du bist hier im Frontend-Ordner,"}, {"id": 377, "start": 2365.0, "end": 2368.16, "text": "ich bin im Backend-Ordner. Wir müssen uns erstmal überlegen, wie wir das Backend-Technisch"}, {"id": 378, "start": 2368.16, "end": 2372.92, "text": "überhaupt machen wollen. Ich muss dir ja quasi die Routen zur Verfügung stellen, dass du"}, {"id": 379, "start": 2372.92, "end": 2378.12, "text": "was machen kannst, ne? An sich brauch ich die Routen schon, bevor ich das überhaupt anfangen"}, {"id": 380, "start": 2378.12, "end": 2384.08, "text": "kann. Ja, denk ich auch. Im Endeffekt könntest du die Routen bereitstellen und da einfach"}, {"id": 381, "start": 2384.08, "end": 2388.92, "text": "mal irgendwie so ein Sleep reinmachen. Ja, kann man machen. Damit ich schon mal so quasi"}, {"id": 382, "start": 2388.92, "end": 2396.32, "text": "mit so Metadaten arbeiten kann und den Rest gucken wir dann, wenn's soweit ist. Genau,"}, {"id": 383, "start": 2396.32, "end": 2402.0, "text": "ich würd sagen, wir müssen es ja nicht komplizierter machen als sonst wie. Wir machen einfach"}, {"id": 384, "start": 2402.0, "end": 2409.44, "text": "slash speedchamp im Controller. Das heißt, da kannst du dann deinen Upload starten."}, {"id": 385, "start": 2409.44, "end": 2412.08, "text": "Ich mach ein slash speedchamp und ich mach wirklich wie du sagst, ich mach einfach ein"}, {"id": 386, "start": 2412.08, "end": 2415.4, "text": "Sleep rein, dass du gucken kannst, dass das... Wobei, ich mach kein Sleep rein, ich geb dir"}, {"id": 387, "start": 2415.4, "end": 2420.96, "text": "einfach irgendeine sinnlose Jason-Antwort, dass du siehst, dass es funktioniert. Stark."}, {"id": 388, "start": 2420.96, "end": 2425.2, "text": "Machen wir so. Danach können wir gucken, wie wir das machen. Wir müssen uns eh überlegen."}, {"id": 389, "start": 2425.2, "end": 2431.84, "text": "Da kann der Chat sich auch mal Gedanken zumachen. Wie würdet ihr das machen, Chat? Sollen wir"}, {"id": 390, "start": 2431.84, "end": 2440.12, "text": "das möglichst cheat-sicher machen oder nicht? Weil die Sache ist die, wenn man das im Frontend"}, {"id": 391, "start": 2440.12, "end": 2444.6, "text": "misst und ich glaube speedtest.net macht das im Frontend, da kann man relativ einfach Ergebnisse"}, {"id": 392, "start": 2444.6, "end": 2449.88, "text": "faken. Glaub ich, ich weiß es nicht. Wenn man das rein im Frontend misst, dann kann man"}, {"id": 393, "start": 2449.88, "end": 2453.2, "text": "natürlich bescheißen. Ja, da kann ich da übergeben, was ich will. Oder sollen wir"}, {"id": 394, "start": 2453.2, "end": 2457.32, "text": "das im Backend messen, dass quasi der Server überprüft und das in irgendeiner Art und"}, {"id": 395, "start": 2457.32, "end": 2460.48, "text": "Weise in der Datenbank speichert, dass man sich die Ergebnisse nachher abrufen kann."}, {"id": 396, "start": 2460.48, "end": 2464.76, "text": "Könnt ihr euch mal überlegen, was ihr dafür am sinnvollsten haltet. Backend, sagt der"}, {"id": 397, "start": 2464.76, "end": 2469.52, "text": "Chat. Ja, ich finde auch, wir probieren es einfach mal. Dann messe ich das und du pusht"}, {"id": 398, "start": 2469.52, "end": 2475.48, "text": "einfach wie verrückt immer 20 MB rauf und ich messe, wie lang es dauert. Okay, ich lege"}, {"id": 399, "start": 2475.48, "end": 2479.72, "text": "jetzt aber erstmal einen Controller an mit slash speedchamp ohne irgendwas. Genau. Du"}, {"id": 400, "start": 2479.72, "end": 2484.2, "text": "hast bei dir lokal auch irgendeine.net-Taste starten kannst, oder? Ja, du müsstest mir"}, {"id": 401, "start": 2484.2, "end": 2489.88, "text": "dann nur sagen, wie. Ja, mache ich gleich. Ich habe.net installiert, Version 5 und wenn"}, {"id": 402, "start": 2489.88, "end": 2494.08, "text": "du mir dann sagst, wie ich das irgendwie zum Laufen bekomme. Du musst das einfach pullen"}, {"id": 403, "start": 2494.08, "end": 2499.28, "text": "und.net run drinnen eingeben, fertig. Ja, okay, easy. Frontend wird natürlich in Blazer"}, {"id": 404, "start": 2499.28, "end": 2504.44, "text": "gemacht. Nein, Frontend wird wahrscheinlich in React gemacht. Genau. Speedchamp-Controller."}, {"id": 405, "start": 2504.44, "end": 2509.36, "text": "Und nicht mit Angular. Angular. Und nicht mit Angular. Angular, ja, da hat mal ein Chat"}, {"id": 406, "start": 2509.36, "end": 2517.56, "text": "geschrieben, da mag jemand mehr Angular. Oh, oh, oh. Verstehe ich gar nicht. Kann ich nicht"}, {"id": 407, "start": 2517.56, "end": 2523.92, "text": "nachvollziehen, wie man, wie man Angular mehr mögen kann? Aber jedem das eine, ne? Ihr"}, {"id": 408, "start": 2523.92, "end": 2531.56, "text": "wisst, ich bin, ich bin Vue.js-Fan und letztendlich soll jeder nehmen, was er will. Ja, im Endeffekt"}, {"id": 409, "start": 2531.56, "end": 2535.16, "text": "ist halt Angular nahezu, weil es halt ein komplettes Framework abbildet, ne? Du hast"}, {"id": 410, "start": 2535.16, "end": 2540.84, "text": "ja mit Vue und React eher so Libraries, die dir den Vue-Layer darstellen und mit Angular"}, {"id": 411, "start": 2540.84, "end": 2545.32, "text": "hast du halt wirklich ein komplettes Framework, was auch noch Routing mit reinbringt und Caching"}, {"id": 412, "start": 2545.32, "end": 2550.48, "text": "und alle möglichen Sachen, der so was wie React nicht out of the box mitbringt. Ja,"}, {"id": 413, "start": 2550.48, "end": 2556.24, "text": "ich denke, wenn man so im Enterprise, Business, was auch immer Umfeld ist und irgendeine Riesen,"}, {"id": 414, "start": 2556.24, "end": 2561.16, "text": "irgendeine Riesenanwendung macht, dann mag das sinnvoll sein, aber ja, für unsere Zwecke"}, {"id": 415, "start": 2561.16, "end": 2566.08, "text": "jetzt vielleicht nicht so. Das stimmt, das stimmt. Also, was brauchen wir denn jetzt?"}, {"id": 416, "start": 2566.08, "end": 2571.04, "text": "Ich hab jetzt einen Controller angelegt, der Meinung ist, er geht nicht. Ach so, hier,"}, {"id": 417, "start": 2571.04, "end": 2576.32, "text": "dann, wie machen wir das? Wir machen Postrequest, oder? Postrequest, weil du musst ja Zeug hochladen."}, {"id": 418, "start": 2576.32, "end": 2581.68, "text": "Du machst ein Postrequest, weil ich muss Zeug hochladen, ja, genau. Wir machen Post,"}, {"id": 419, "start": 2581.68, "end": 2588.72, "text": "und zwar wir machen ein Post unterhalb von slash speedchamp. Ich muss mal, ich muss"}, {"id": 420, "start": 2588.72, "end": 2592.12, "text": "mein Outlook schließen, weil jetzt bekomme ich sonst die ganze Zeit Meldungen, weil Leute"}, {"id": 421, "start": 2592.12, "end": 2604.64, "text": "Issues in dem Weight erstellen. Ernsthaft? Chad, reißt euch zusammen. Es war klar, war"}, {"id": 422, "start": 2604.64, "end": 2611.72, "text": "klar, war klar. Wann kommt der Cobalt-Stream? Macht ihr nur, macht ihr nur. Der Cobalt-Stream,"}, {"id": 423, "start": 2611.72, "end": 2615.96, "text": "du wirst lachen, ich hab einen Cobalt-Stream gemacht letztes Weihnachten und das war grausam."}, {"id": 424, "start": 2615.96, "end": 2624.76, "text": "Ach Gott. Ja, also Cobalt war wirklich nicht, war kein Spaß. Ich mach jetzt mal ganz schnell"}, {"id": 425, "start": 2624.76, "end": 2629.24, "text": "hier den Controller fertig, dass du was machen kannst, und dann guck ich mal bei dir mit"}, {"id": 426, "start": 2629.24, "end": 2637.68, "text": "in den Stream, ob du das gestartet kriegst. Ich überleg grad, was machen wir jetzt hier,"}, {"id": 427, "start": 2637.68, "end": 2648.76, "text": "wir warten einfach. Await, Task, Delay, was weiß ich, 10 Sekunden, ja, komm, eine Sekunde,"}, {"id": 428, "start": 2648.76, "end": 2654.92, "text": "reicht, fertig. Bestow, also das ist hier die hohe Kunst. So, ich hab jetzt einen slash"}, {"id": 429, "start": 2654.92, "end": 2660.76, "text": "speedchamp gemacht, der eine Sekunde wartet. Ja, okay, wunderbar. Ich könnte schon ein"}, {"id": 430, "start": 2660.76, "end": 2665.04, "text": "bisschen was einlesen, aber das mach ich gleich, ich pushe das jetzt erstmal und dann können"}, {"id": 431, "start": 2665.04, "end": 2671.24, "text": "wir's machen. Achja, die Domain hab ich schon gekauft, Leute. Also speedchamp.org hab ich"}, {"id": 432, "start": 2671.24, "end": 2674.84, "text": "schon gekauft. Da muss ich mich übrigens auch gleich noch einloggen, das machen wir"}, {"id": 433, "start": 2674.84, "end": 2678.32, "text": "alles. Ich pushe dir das jetzt, dann kannst du dir ein bisschen Gedanken frontendmäßig"}, {"id": 434, "start": 2678.32, "end": 2682.72, "text": "machen, weil ich muss am Ende wahrscheinlich einfach nur einlesen, also wahrscheinlich"}, {"id": 435, "start": 2682.72, "end": 2688.08, "text": "ist meine Seite back-end technisch nicht so lang, und dann mach ich die ganzen Server-Geschichten"}, {"id": 436, "start": 2688.08, "end": 2692.8, "text": "in der Zwischenzeit. Ja, mach das auf jeden Fall, ich weiß es. Okay, also slash speedchamp"}, {"id": 437, "start": 2692.8, "end": 2700.6, "text": "ist am Start. Willst du den Jason zurückhaben? Ach komm, einfach zum Aufrufen jetzt erstmal,"}, {"id": 438, "start": 2700.6, "end": 2704.6, "text": "dann können wir gucken. Sobald du was anderes brauchst, sag einfach Bescheid, dann machen"}, {"id": 439, "start": 2704.6, "end": 2712.72, "text": "wir das. Wettervorhersage kann weg. Delete. Bei mir fragt im Chat, warum Windows OS für"}, {"id": 440, "start": 2712.72, "end": 2718.48, "text": "die Entwicklung? Gute Frage. Na ja, das ist basically das einzige, was ich habe. So, ich"}, {"id": 441, "start": 2718.48, "end": 2722.88, "text": "hab noch einen Mac, aber auf dem entwickle ich nicht gerne. Es hat sich halt einfach ergeben,"}, {"id": 442, "start": 2722.88, "end": 2728.68, "text": "dass ich Windows benutze, weil ich da so mit den Tools am familiärsten bin. Okay. Ist"}, {"id": 443, "start": 2728.68, "end": 2734.84, "text": "jetzt kein, mein Gott, jetzt nichts krasses. Nee, also ich denke auch, es soll jeder das"}, {"id": 444, "start": 2734.84, "end": 2739.8, "text": "nehmen, wo er am besten mit klarkommt. Ich bin da schon längere Zeit von weggekommen,"}, {"id": 445, "start": 2739.8, "end": 2745.76, "text": "mir zu sagen, hey, die Leute, ich weiß nicht, ich bekehr keine Leute mehr. Auch im privaten"}, {"id": 446, "start": 2745.76, "end": 2749.08, "text": "Bereich nicht mehr, wenn da einer sagt, er benutzt Windows, da muss er im Zweifelsfall"}, {"id": 447, "start": 2749.08, "end": 2753.16, "text": "mit leben, wenn ich sag, kann ich dir nicht helfen, da hab ich keine Ahnung von, aber"}, {"id": 448, "start": 2753.16, "end": 2756.72, "text": "ich versuche nicht mal die Leute zu bekehren, so nach dem Motto, ja verwende Linux, verwende"}, {"id": 449, "start": 2756.72, "end": 2759.88, "text": "das, weil dann kommen sie zwei Wochen später an und wollen, dass du ihnen hilfst und dann"}, {"id": 450, "start": 2759.88, "end": 2763.08, "text": "regen sie sich noch auf, dass du dran schuld bist, weil du so einen Mist empfohlen hast."}, {"id": 451, "start": 2763.08, "end": 2767.72, "text": "Nee, nee, nee, nee. Ja, das stimmt, das stimmt. Du hast was gepusht, hab ich gesehen. Ich"}, {"id": 452, "start": 2767.72, "end": 2771.28, "text": "hab was gepusht, ja, das muss man es wahrscheinlich auch angewöhnen, immer erst einen Pull zu"}, {"id": 453, "start": 2771.28, "end": 2777.44, "text": "machen, bevor wir dann was pushen. Ich pull. Hat funktioniert. Oh, ist im Frontend, hast"}, {"id": 454, "start": 2777.44, "end": 2782.84, "text": "schon hier Scaffold Project. Ich hab schon, ich hab schon basically die ganze Anwendung"}, {"id": 455, "start": 2782.84, "end": 2788.72, "text": "fertig. Okay, dann push ich den GIT commit. Hast du auch eine ordentliche Commit-Message"}, {"id": 456, "start": 2788.72, "end": 2798.88, "text": "gemacht? Initial Commit. Hoch agil sind wir. Also, da macht man ja prinzipiell nur Commits"}, {"id": 457, "start": 2798.88, "end": 2803.52, "text": "in it oder Temp. Temp ist auch ein gutes. Ich kann ja, ich kann ja die immer random irgendein"}, {"id": 458, "start": 2803.52, "end": 2810.48, "text": "Issue markieren. Stimmt, das machen wir. Dann schließen wir einfach bei jedem pushen und"}, {"id": 459, "start": 2810.48, "end": 2814.96, "text": "Issue auf GitHub. So, also Leute, nein, die E-Mail-Adresse ist nicht geleakt. Das ist"}, {"id": 460, "start": 2814.96, "end": 2819.96, "text": "die öffentliche E-Mail-Adresse, die ich auch für Donations hab hier am Stream. Nix liegt."}, {"id": 461, "start": 2819.96, "end": 2824.36, "text": "Also, ich hab gepusht, kannst mal schauen. Okay, dann prob ich mal. Und ich gucke jetzt"}, {"id": 462, "start": 2824.36, "end": 2830.64, "text": "mal bei dir mit ins Stream rein, wenn du pullst, dass das, dass es gestartet kriegst. Okay,"}, {"id": 463, "start": 2830.64, "end": 2833.84, "text": "ich hör jetzt den Speech-Hat-Controller und so weiter und jetzt sagst du einfach.net"}, {"id": 464, "start": 2833.84, "end": 2839.68, "text": "run so. Ähm, Moment, wau, ich hör mal, ich hör mal, jetzt hören wir uns doppelt. Ich"}, {"id": 465, "start": 2839.68, "end": 2849.84, "text": "seh, oh, der Stream hat Delay. Oh nein. Ich reloade mal. So langsam. YouTube, come on."}, {"id": 466, "start": 2849.84, "end": 2855.32, "text": "Du bist, du bist gerade noch in Issues drin. Oder du bist bei dir, bist du schon im Terminal"}, {"id": 467, "start": 2855.32, "end": 2860.92, "text": "irgendwo, oder? Ich hab das Terminal bei mir offen. Alter, ist das langsam auf YouTube?"}, {"id": 468, "start": 2860.92, "end": 2865.12, "text": "Das ist ja echt langsam. 10 Sek, krass. 10 Sekunden Delay. Okay, jetzt machst du, jetzt"}, {"id": 469, "start": 2865.12, "end": 2872.44, "text": "machst du bei mir auch das Terminal auf. Du gehst, du gehst rein in den Backend und"}, {"id": 470, "start": 2872.44, "end": 2879.64, "text": "sagst einfach.net run. Fertig. Run, okay. Und dann auf Port 5000, ne? Und dann ist es"}, {"id": 471, "start": 2879.64, "end": 2884.52, "text": "glaube ich auf Port 5000 oder Port 5002 oder was auch immer. Jaja, genau, genau, das sieht"}, {"id": 472, "start": 2884.52, "end": 2890.36, "text": "gut aus. Äh, das, das werde ich noch ausschalten. Der macht ja aktuell noch HTTPS und Redirect"}, {"id": 473, "start": 2890.36, "end": 2897.4, "text": "und sonst was. Das kommt alles raus, weil vom Plan her ist ja so die ähm, Zertifikat-Geschichte"}, {"id": 474, "start": 2897.4, "end": 2902.4, "text": "und so. Machen wir nicht selbst in dem, in dem.net Programm. Wir lassen uns per Letzter"}, {"id": 475, "start": 2902.4, "end": 2906.04, "text": "encrypt ein Zertifikat ausstellen und machen da was davor, was das macht. Machst wahrscheinlich"}, {"id": 476, "start": 2906.04, "end": 2911.8, "text": "ja, genau. Ähm, okay, dann ist halt, ah warte, das ist ja auch eben Postrequest, ne? Das"}, {"id": 477, "start": 2911.8, "end": 2916.48, "text": "ist ein Post, genau. Sollte, sollte eigentlich funktionieren, wenn du nen Post machst auf"}, {"id": 478, "start": 2916.48, "end": 2923.24, "text": "slash speedchamp. Du wirst mich wundern, wenn das nicht funktioniert. Ist dumm, dass ich"}, {"id": 479, "start": 2923.24, "end": 2929.4, "text": "das jetzt nicht zugucken kann. Naja, Pech. Ihr müsst halt gucken, warte mal. Look, localhost"}, {"id": 480, "start": 2929.4, "end": 2935.4, "text": "5000. Genau. Der wirft mir halt Errors mit dem SSL. Ja, gut, das. Also, also, wenn ich"}, {"id": 481, "start": 2935.4, "end": 2943.0, "text": "halt HTTP localhost 5000 slash speedchamp mache und dann Post. Ähm. Ja. Dann sagt"}, {"id": 482, "start": 2943.0, "end": 2949.0, "text": "er mir SSLP, blablabla, oder SSL Remote Key was not okay. Ach, ich hab, ich, der leitet"}, {"id": 483, "start": 2949.0, "end": 2953.36, "text": "um auf, ähm, standardmäßig auf SSL, das muss ich noch rausmachen, warte mal. Das ist"}, {"id": 484, "start": 2953.36, "end": 2958.2, "text": "der erste Bug schon. Eine, eine Zeile quasi. Der ist kaputt. Das muss ich rausschmeißen."}, {"id": 485, "start": 2958.2, "end": 2963.76, "text": "Der macht standardmäßig Umleitung, HTTPS Redirection, das brauchen wir alles net. Es"}, {"id": 486, "start": 2963.76, "end": 2969.8, "text": "sollte eigentlich funktionieren. Ja, genau. Ihr wisst, wie das ist, ne? Famous Last Words,"}, {"id": 487, "start": 2969.8, "end": 2975.16, "text": "sollte eigentlich funktionieren. Also, Authorization und HTTPS Umleitung machen wir weg. Brauch"}, {"id": 488, "start": 2975.16, "end": 2980.44, "text": "man nicht. Äh, ich seh übrigens gerade, ich generiere, by the way, automatische Swagger"}, {"id": 489, "start": 2980.44, "end": 2987.04, "text": "UI, äh, Swagger, äh, AP Documentation. Wusste ich auch nicht, dass ich das mach, ja. Die,"}, {"id": 490, "start": 2987.04, "end": 2993.6, "text": "die scheint ganz wichtig zu sein für eine Uhr. So. Ich mach mal ein neues Comet. Und"}, {"id": 491, "start": 2993.6, "end": 2999.08, "text": "das jetzt mal hier an alle, die im Chat, äh, bei beiden Channels dabei sind. Normalerweise,"}, {"id": 492, "start": 2999.08, "end": 3002.48, "text": "wenn man jetzt lokal bei sich ist, würde man Folgendes machen. Das mach ich jetzt explizit"}, {"id": 493, "start": 3002.48, "end": 3008.52, "text": "nicht. Ich zeig's euch aber mal. Man würde sagen, hier geht, äh, keine Ahnung, man fügt"}, {"id": 494, "start": 3008.52, "end": 3012.56, "text": "die Dinger hinzu, dass man committet, und dann sagen die Leute meistens so was wie,"}, {"id": 495, "start": 3012.56, "end": 3017.2, "text": "anhängen ans letzte Comet. Das Dumme ist jetzt nur, wenn ich das letzte Comet quasi"}, {"id": 496, "start": 3017.2, "end": 3021.6, "text": "überschreibe, das ist lokal wunderbar, aber dadurch, dass der Noel sich da schon gepusht"}, {"id": 497, "start": 3021.6, "end": 3024.88, "text": "hat, kriegt er jetzt ne Fehlermeldung, wenn ich das mache. Das heißt, ich muss ein neues"}, {"id": 498, "start": 3024.88, "end": 3029.56, "text": "Comet oben drauf machen. Das heißt, sobald man nen Public, nen Branch Public hat, sollte"}, {"id": 499, "start": 3029.56, "end": 3036.56, "text": "man nie da dran an der Historie rumspielen. So. Git commit, minus a, minus m. Tja, fix."}, {"id": 500, "start": 3036.56, "end": 3043.76, "text": "Beste. Push. So. Kann's noch mal. Jetzt hat er fertig gepusht. Kann's noch mal. Jetzt"}, {"id": 501, "start": 3043.76, "end": 3051.72, "text": "sollte es eigentlich funktionieren. Ich probier's bei mir lokal auch mal aus..net run. Genau."}, {"id": 502, "start": 3051.72, "end": 3062.56, "text": "Perl. Minus x. Post. Localhost. Port 5000. Slash. Speed. Champ. Ja, sieht gut aus. Yes,"}, {"id": 503, "start": 3062.56, "end": 3072.44, "text": "sieht gut aus. 200, okay, eine Sekunde, wunderbar. Ja. Äh, schön. Ja, wunderbar. Das heißt,"}, {"id": 504, "start": 3072.44, "end": 3079.84, "text": "du kannst schon mal was abkragen. So, jetzt kommt, äh, jetzt kommt noch eine Frage im"}, {"id": 505, "start": 3079.84, "end": 3083.56, "text": "Chat mit, was ich den Reverse-Proxy mache. Das mach ich nicht mit Traffic. Das ist mir"}, {"id": 506, "start": 3083.56, "end": 3089.28, "text": "zu kompliziert. Das mach ich mit Cuddy. Das startet man einfach, macht drei Zeilen Konfig"}, {"id": 507, "start": 3089.28, "end": 3096.4, "text": "und dann kriegt man ein Zertifikat und gut ist. Ja. Genau, äh, wie machen wir jetzt"}, {"id": 508, "start": 3096.4, "end": 3100.48, "text": "am besten weiter? Willst du jetzt ein bisschen die Seite basteln und ich mach Server? Äh,"}, {"id": 509, "start": 3100.48, "end": 3106.96, "text": "genau, ich würde jetzt ein bisschen die Seite basteln. Du machst den Server und, ähm, dann,"}, {"id": 510, "start": 3106.96, "end": 3112.96, "text": "dann gucken wir mal, wie gut das geht und dann, ähm, ja, mache ich mir jetzt mal ein bisschen"}, {"id": 511, "start": 3112.96, "end": 3116.4, "text": "Gedanken, wie ich das am besten im Frontend umsetze. Ja, ich hab auch noch keine Ahnung"}, {"id": 512, "start": 3116.4, "end": 3122.4, "text": "genau, wie wir das machen. Den Mod, das Mozilla hab ich dir gepostet, ne? Äh, ja, das ist"}, {"id": 513, "start": 3122.4, "end": 3130.04, "text": "das, das ist im Mozilla-Ul. Genau, wunderbar. Worum geht's hier? Kann ich mal die Projektdokumentation"}, {"id": 514, "start": 3130.04, "end": 3135.4, "text": "sehen? Ja, kannst du? Moment, was ist die Standard Swagger-UI? Ah, hier, Sekunde, Sekunde."}, {"id": 515, "start": 3135.4, "end": 3139.12, "text": "Zeig ich dir? Kriegst du? Kriegst du? Projektdokumentation, keine Probleme, haben wir alles, haben wir"}, {"id": 516, "start": 3139.12, "end": 3146.0, "text": "alles. Hier. Hammer, Hammer, Hammer. Local House, Port 5000. Ich kann das, ich kann das schreiben."}, {"id": 517, "start": 3146.0, "end": 3152.6, "text": "Port 5000 slash Swagger. Hier, guck, da ist sie, Leute. Projektdokumentation. Jetzt kommt"}, {"id": 518, "start": 3152.6, "end": 3158.28, "text": "der Chat an, ist-soll-Analyse. Was kommt als nächstes? Gantt, Gantt-Diagramm oder was?"}, {"id": 519, "start": 3158.28, "end": 3165.52, "text": "Ey, ich hab, wir müssen noch Risikoanforderungen, müssen wir uns auch noch angucken. Also, also."}, {"id": 520, "start": 3165.52, "end": 3171.24, "text": "Aber seht ihr den Chat hier? Da. Wir haben eine Apidek-Dokumentation. Die ist zwar,"}, {"id": 521, "start": 3171.24, "end": 3177.64, "text": "wenn man ehrlich ist, ziemlich mickrig. Das Einzige, was da drin ist, ist Code 200, Success."}, {"id": 522, "start": 3177.64, "end": 3184.24, "text": "Ja. Gut zu wissen. Ist halt, ist halt da, ne? Aber ist ja cool. Hab ich noch nie ausprobiert."}, {"id": 523, "start": 3184.24, "end": 3188.68, "text": "Man kann sich jetzt jeder seinen eigenen Speedchamp programmieren. Mit der Doku. Mit der Doku"}, {"id": 524, "start": 3188.68, "end": 3195.64, "text": "in unserem Projekt schon. Gibt ja jede Menge solcher Sachen. Genau, wunderbar. Joa. Dann"}, {"id": 525, "start": 3195.64, "end": 3199.44, "text": "kannst du dir ja mal ein bisschen Gedanken um Frontend machen. Wie wollen wir das machen?"}, {"id": 526, "start": 3199.44, "end": 3202.88, "text": "Soll ich jetzt, also ich bastel jetzt Server, soll ich mich muten in der Zwischenzeit, weil"}, {"id": 527, "start": 3202.88, "end": 3205.84, "text": "ich würd ein bisschen was bei erklären. Und das sieht man bei dir ja nicht. Ich glaub,"}, {"id": 528, "start": 3205.84, "end": 3209.32, "text": "wir können uns so ein bisschen bei, neben bei muten, jeder erklärt so ein bisschen,"}, {"id": 529, "start": 3209.32, "end": 3214.88, "text": "was er gerade macht. Und wenn der Server dann da ist, sagst du Bescheid. Genau. Genau. Okay."}, {"id": 530, "start": 3214.88, "end": 3221.76, "text": "Gut. So machen wir das. Bis gleich. Bis gleich. So Leute, also. Geh los. So wie wir uns das"}, {"id": 531, "start": 3221.76, "end": 3226.6, "text": "jetzt überlegt haben, der Noel bastelt ein bisschen am Frontend. Und ja, ich werd dann"}, {"id": 532, "start": 3226.6, "end": 3230.44, "text": "das Backend machen. Aber jetzt müssen wir erstmal einen Server anlegen. Weil ohne Server"}, {"id": 533, "start": 3230.44, "end": 3234.56, "text": "können wir das Ganze nicht laufen lassen. Und ich hab mir schon was gekauft. Ich zeig"}, {"id": 534, "start": 3234.56, "end": 3241.76, "text": "euch das mal. Guck mal da. Hallo, Peter Wubbel. Ihr seht wieder, ich hab mich mit meinem legit"}, {"id": 535, "start": 3241.76, "end": 3256.12, "text": "legit Name registriert, wie wir ja alle wissen, dass ich Peter Wubbel heiße. Und ich hab mir"}, {"id": 536, "start": 3256.12, "end": 3265.04, "text": "eine Domain gekauft, die hat nämlich speedchamp.org. Da ist es. Oh, ich hab acht. Ich hab acht Tage"}, {"id": 537, "start": 3265.04, "end": 3272.08, "text": "Zeit, meine Kontaktkontaktinfo zu verifizieren. Ich hab da so meine Schwierigkeiten, das zu"}, {"id": 538, "start": 3272.08, "end": 3280.08, "text": "verifizieren, weil, weil ich zeig's euch mal. Okay, das heißt, die Domain ist nach dem Stream"}, {"id": 539, "start": 3280.08, "end": 3293.76, "text": "weg, keck wait. Nein, nein, nein. Email was sent, what the fuck. Warte mal, Domains. Wie"}, {"id": 540, "start": 3293.76, "end": 3301.96, "text": "kommt man jetzt überhaupt in die Settings rein hier? Manage. Okay, wunderbar. Weil das"}, {"id": 541, "start": 3301.96, "end": 3310.48, "text": "witzige ist, ich glaube, es wird schwierig zu verifizieren. Oder meinte ich, ich kann"}, {"id": 542, "start": 3310.48, "end": 3319.16, "text": "mich hier, ich. Peter Wubbel, Teil eins, Frankfurt in Hessen. Liegt Telefonnummer, die es by"}, {"id": 543, "start": 3319.16, "end": 3325.96, "text": "the way nicht gibt, irgendwas eingegeben. Du musst glaube ich nur eine Mail bestätigen."}, {"id": 544, "start": 3325.96, "end": 3329.92, "text": "Das probiere ich mal aus. Leute, ich probiere mal aus, ob ich das, ich logg mich mal kurz"}, {"id": 545, "start": 3329.92, "end": 3343.72, "text": "in meiner E-Mail Adresse ein. Anderen. Anderen. Rosa. Gucken wir mal. Weiter zum Postfach."}, {"id": 546, "start": 3343.72, "end": 3357.4, "text": "Wo ist das denn? Spam Verdacht? Ach, das hätte ich vorher schon machen müssen. Das"}, {"id": 547, "start": 3357.4, "end": 3381.16, "text": "ist im Spam Verdacht gelandet. Ne. Message vom NamecheapCEO, jaja, ist klar. Also ich"}, {"id": 548, "start": 3381.16, "end": 3389.0, "text": "habe nichts bekommen. Ich habe nichts, ich habe nichts bekommen hier. Ich habe, ich habe"}, {"id": 549, "start": 3389.0, "end": 3401.0, "text": "ihnen gesagt, ich will das verifizieren. Verifizieren. E-Mail war send. Also, juckt"}, {"id": 550, "start": 3401.0, "end": 3411.4, "text": "sie nicht, ich habe keine E-Mail gekriegt bis jetzt. Keine Ahnung an, was sie das geschickt"}, {"id": 551, "start": 3411.4, "end": 3419.48, "text": "haben. Na gut, schauen wir mal. Zumindest, ich habe ja acht Tage Zeit, das so zu machen."}, {"id": 552, "start": 3419.48, "end": 3422.48, "text": "Also was wir jetzt machen, dann müssen wir es folgendes. Ich habe mir, wie gesagt, diese"}, {"id": 553, "start": 3422.48, "end": 3427.48, "text": "Domain hier habe ich mir gekauft, speedchamp.org. Sprich, wenn jemand jetzt drauf geht, kommt"}, {"id": 554, "start": 3427.48, "end": 3432.24, "text": "man wohin? Hier auf irgendeine komische Parkseite. Was ich übrigens auch immer frech finde, wenn"}, {"id": 555, "start": 3432.24, "end": 3439.4, "text": "die quasi schon das für Werbung benutzen, obwohl man dafür Geld bezahlt hat. Übrigens,"}, {"id": 556, "start": 3439.4, "end": 3442.64, "text": "das ist Namecheap, verwende ich zum ersten Mal. Ich habe vorher das noch nie verwendet,"}, {"id": 557, "start": 3442.64, "end": 3450.44, "text": "keine Ahnung. Ich habe immer was anderes verwendet zum Domains registrieren. So, SourceUrl, speedchamp.org,"}, {"id": 558, "start": 3450.44, "end": 3455.64, "text": "DestinationUrl, www.speedchamp.org, das ist ein Redirect, den braucht eigentlich kein"}, {"id": 559, "start": 3455.64, "end": 3463.92, "text": "Namecheap, den können wir gleich löschen. Namecheap ist POG. Warum Namecheap diesmal?"}, {"id": 560, "start": 3463.92, "end": 3467.6, "text": "Weiß nicht, weil ich mich nicht leaken wollte. Bei dem anderen Domain registrieren würde"}, {"id": 561, "start": 3467.6, "end": 3473.6, "text": "ich mich wahrscheinlich leaken. Waren kurz die Musik einen Tick laut, dann hörte er"}, {"id": 562, "start": 3473.6, "end": 3479.92, "text": "gar nicht, dass Musik an ist. Max Error. Wieso, was? Du musst, du musst Cores noch deaktivieren."}, {"id": 563, "start": 3479.92, "end": 3486.28, "text": "Weil ich ja von dem Frontend aus das mache und das muss man dann noch deaktivieren. Okay,"}, {"id": 564, "start": 3486.28, "end": 3491.44, "text": "mache ich. Okay, wunderbar. Da habe ich jetzt gar nicht dran gedacht. Ja, ich auch nicht."}, {"id": 565, "start": 3491.44, "end": 3496.36, "text": "Das ist tatsächlich gar nicht so einfach, da muss ich abgucken. Da muss ich abgucken,"}, {"id": 566, "start": 3496.36, "end": 3501.88, "text": "mache ich gleich. Okay. Alright. Ja. Sagt ihr gleich Bescheid. Yes, kein Schreis. Ihr voll"}, {"id": 567, "start": 3501.88, "end": 3510.48, "text": "agil ist das hier Wahnsinn. Sagt ihr Bescheid. Sitz mal Leute, so muss das sein. Du musst"}, {"id": 568, "start": 3510.48, "end": 3517.88, "text": "einfach deaktivieren. Ja. Nee, aber Leute, es ist echt so, ich bin hier gar nicht gewöhnt"}, {"id": 569, "start": 3517.88, "end": 3522.8, "text": "mit Leuten zusammen was zu basteln. Ich muss mal kurz abgucken. Das war relativ, relativ"}, {"id": 570, "start": 3522.8, "end": 3538.96, "text": "easy, wenn man weiß, wie es geht. Startup. Ja, ich habe es. Ich habe es. Cores deaktivieren."}, {"id": 571, "start": 3538.96, "end": 3549.08, "text": "Startup. Ich mache das ganze Swagger, Swagger gedönnt raus. Das brauchen wir nicht. Also"}, {"id": 572, "start": 3549.08, "end": 3556.52, "text": "add Cores. Also sprich, das ist, dass er jetzt, wenn er von einem anderen Domain kommt, sein"}, {"id": 573, "start": 3556.52, "end": 3564.52, "text": "Browser nicht meckert, wenn er darauf zugreift. Swagger Zeug kommt alles weg. Also hier. Allow"}, {"id": 574, "start": 3564.52, "end": 3569.8, "text": "all. Einzig sinnvolle Cores Regelung. By the way, warum habe ich hier zwei, zwei, zwei"}, {"id": 575, "start": 3569.8, "end": 3579.4, "text": "Leerzeichen? Ich will nicht zwei Leerzeichen. Ich will zwei Spaces. Was ist das hier? Spaces."}, {"id": 576, "start": 3579.4, "end": 3599.12, "text": "Ja, zwei Spaces und jetzt Reformat. Jawoll. Exzellent. Gleich viel besser. Okay, wunderbar."}, {"id": 577, "start": 3599.12, "end": 3605.68, "text": "Jetzt haben wir das hinzugefügt. Jetzt sollte das eigentlich klappen. Wenn ich das, jetzt"}, {"id": 578, "start": 3605.68, "end": 3609.76, "text": "sollte er von allen Seiten drauf zugreifen können. Natürlich machen wir das ganze nur"}, {"id": 579, "start": 3609.76, "end": 3613.88, "text": "if, if development vorbei. Komm, wer weiß. Aber das richtige environment gesetzt, dann"}, {"id": 580, "start": 3613.88, "end": 3619.36, "text": "lassen wir es einfach mal so. Ähm, machen wir das aus. Git. Status wird jetzt neu gepusht."}, {"id": 581, "start": 3619.36, "end": 3626.68, "text": "Hat sich nur Startup geändert. Wunderbar. Sieht man, er hat nicht viel getan. Und jetzt"}, {"id": 582, "start": 3626.68, "end": 3634.12, "text": "machen wir commit fix, Cores, Bäm, Push. So, sag ich ihm Bescheid. So, ich hab gepusht."}, {"id": 583, "start": 3634.12, "end": 3641.32, "text": "Okay, wunderbar. Sollte, sollte nur tun. Ich hab's jetzt, ich hab's aus dem Preischamp"}, {"id": 584, "start": 3641.32, "end": 3645.84, "text": "kopiert. Das ist unter dotnet ein bisschen durch die Brust ins Auge. Du kannst ja, kannst"}, {"id": 585, "start": 3645.84, "end": 3650.56, "text": "ja auf, wobei hier, du hast auch so ein Wischloss Studio Code auf, ne? Äh, ja, das hab ich"}, {"id": 586, "start": 3650.56, "end": 3658.0, "text": "auch. Ich kann's dir grad mal zeigen. Ist wirklich richtig knack gemacht. Startup. Es"}, {"id": 587, "start": 3658.0, "end": 3662.08, "text": "gibt kein, guck mal hier, es gibt keinen Schalter einfach zu sagen hier allow all. Man muss dann"}, {"id": 588, "start": 3662.08, "end": 3666.64, "text": "irgendwie zig zig policies adden oder sonst was. Aber du solltest jetzt jede Methode von"}, {"id": 589, "start": 3666.64, "end": 3671.0, "text": "jeder, von jeder Seite und, und mit allen möglichen Credentials, die wir nicht haben."}, {"id": 590, "start": 3671.0, "end": 3678.72, "text": "Okay. Probier mal aus. Mach ich, mach ich. Ja, ich mach wieder Mute, ne? Yes. Genau,"}, {"id": 591, "start": 3678.72, "end": 3686.24, "text": "so Leute. Ähm, wo sind wir stehen geblieben? Bei der, bei speedchamp.org. Bei der Domain."}, {"id": 592, "start": 3686.24, "end": 3690.08, "text": "Übrigens, danke für die ganzen Subs. Jetzt war der Gelegenheit, jetzt wo ich mich gemuted"}, {"id": 593, "start": 3690.08, "end": 3694.56, "text": "hab. Jetzt kann ich mal kurz, kann ich mal ganz schnell, äh, Big Brain 5-Head Subs hier"}, {"id": 594, "start": 3694.56, "end": 3700.76, "text": "vorlesen. Und zwar, den haben wir hier am Start. Al-Kalf ist am Start. Dankeschön. Vor 24"}, {"id": 595, "start": 3700.76, "end": 3708.16, "text": "Minuten. 7-Head Ayaya. Aber Massive 7-Head, Alter. Huge. Weeps in. Shalomitwitchprime33"}, {"id": 596, "start": 3708.16, "end": 3716.68, "text": "Minuten. Slayda Teddy ist am Start. Asuru97. Liann V. Crate Wilhelm. 8 Monate. Michael"}, {"id": 597, "start": 3716.68, "end": 3721.68, "text": "50 Billion. 13 Monate am Start, Leute. Dankeschön für die ganzen Subs. Huge Hyper Subscriptions"}, {"id": 598, "start": 3721.68, "end": 3730.04, "text": "hier. Ja, Carlson hat auch Subscribed. 13 ist wieder am Start. Das war's für heute,"}, {"id": 599, "start": 3730.04, "end": 3735.72, "text": "glaube ich. Dankeschön für die ganzen Subs. Massive. Du hast ja 3080 TI bekommen. Excellent."}, {"id": 600, "start": 3735.72, "end": 3740.2, "text": "Xempi, Dankeschön für den Sub. Hier wird richtig agil programmiert. Wir sind im Discord"}, {"id": 601, "start": 3740.2, "end": 3745.56, "text": "und per Programmen quasi. Aber ich mach jetzt erstmal den Server, dass wir damit zu Porte"}, {"id": 602, "start": 3745.56, "end": 3750.12, "text": "kommen. Also, ich hab das Redirect gelöscht. Ich hab, wie gesagt, noch nie Namecheap verwendet."}, {"id": 603, "start": 3750.12, "end": 3759.08, "text": "Ich muss jetzt einen Server anlegen bei Hetzner. By the way, falls ihr auch mal ein paar virtuelle"}, {"id": 604, "start": 3759.08, "end": 3762.6, "text": "Server in der Cloud braucht, Fips, Dankeschön für, nee, Fizz, Dankeschön für die 6 Monate"}, {"id": 605, "start": 3762.6, "end": 3766.16, "text": "am Start, Fips, Dankeschön. Falls ihr auch virtuelle Server in der Cloud braucht, macht"}, {"id": 606, "start": 3766.16, "end": 3770.48, "text": "mal Ausrufezeichen Hetzner, dann bekommt ihr einen 20 Euro Startgutschein. Und ich zeige"}, {"id": 607, "start": 3770.48, "end": 3773.88, "text": "euch jetzt mal, was ihr für 20 Euro schon bekommt. Wenn wir jetzt nämlich hier einen"}, {"id": 608, "start": 3773.88, "end": 3780.68, "text": "Server hinzufügt, sagen wir hier in den Nürnberg, Ubuntu 20.04 machen wir und wir nehmen mal"}, {"id": 609, "start": 3780.68, "end": 3785.56, "text": "einen Triple Core. Guckt mal, ihr könnt für 8 Euro, also ihr könnt mit meinen 20 Euro"}, {"id": 610, "start": 3785.56, "end": 3792.56, "text": "Startgut haben, fast 3 Monate, sagen wir mal zweieinhalb Monate, einen Triple Core 4GB"}, {"id": 611, "start": 3792.56, "end": 3802.44, "text": "RAM 80GB SSD Server betreiben. Ist doch schon mal nice. Oder nicht. Kommando klappt, klar."}, {"id": 612, "start": 3802.44, "end": 3809.0, "text": "Ich glaube, du kannst das Kommando plus nicht 50.000 einer gleich in Sekunde spammen. So,"}, {"id": 613, "start": 3809.0, "end": 3811.88, "text": "also wir legen jetzt einen neuen Server an. Das ist viel, das ist die Hälfte wie bei"}, {"id": 614, "start": 3811.88, "end": 3817.0, "text": "Digital Ocean. Das lohnt sich richtig. Wieso bist du da nicht? Ausrufezeichen Hetzner kann"}, {"id": 615, "start": 3817.0, "end": 3824.44, "text": "sich anmelden über meinen Partnerlink. Postchamp. Also ich war auch bei Digital Ocean früher"}, {"id": 616, "start": 3824.44, "end": 3828.84, "text": "und ich bin schon mittlerweile mit allem, was ich habe bei Hetzner und hier, da darf ich"}, {"id": 617, "start": 3828.84, "end": 3832.6, "text": "nicht draufklicken. Deswegen habe ich extra hingeschrieben, nicht, dass ich dem Stream"}, {"id": 618, "start": 3832.6, "end": 3843.2, "text": "liege. Sogar mit Alarm, Alarm. Also wir legen jetzt einen Triple Core Server an. Wir adden"}, {"id": 619, "start": 3843.2, "end": 3847.32, "text": "unsere SSH Keys, dass wir uns beide drauf einloggen können. Ist natürlich ganz sinnig."}, {"id": 620, "start": 3847.32, "end": 3857.8, "text": "Und den Server nennen wir, ich überlege gerade, was könnten wir für ein sinnvolles Namenskonzept"}, {"id": 621, "start": 3857.8, "end": 3866.2, "text": "machen irgendwie. Postchamp, passt doch. Genau, legen wir den Server an. Wir legen uns übrigens"}, {"id": 622, "start": 3866.2, "end": 3871.08, "text": "auch noch eine Firewall gleich an. Das ist jetzt ein neues Feature bei Hetzner. Die"}, {"id": 623, "start": 3871.08, "end": 3874.24, "text": "finden das bestimmt toll, wenn ich das mal vorstelle. Ich finde das ist was wirklich"}, {"id": 624, "start": 3874.24, "end": 3877.72, "text": "sinnvolles, das habe ich bei vielen anderen Cloud Anbietern schon gesehen. Bei Hetzner"}, {"id": 625, "start": 3877.72, "end": 3889.12, "text": "gibt es das erst seit 2-3 Monaten oder so. Was soll der Champ können? Speedtest. Wir"}, {"id": 626, "start": 3889.12, "end": 3893.88, "text": "haben ein Projekt gebraucht, was wir einfach zu zweit im Stream programmieren können,"}, {"id": 627, "start": 3893.88, "end": 3899.88, "text": "wo man nicht so viel Code programmieren muss, sondern was übersichtlich ist. IP liegt."}, {"id": 628, "start": 3899.88, "end": 3911.44, "text": "Was haustest du bei Prot nicht öffnen? Unter anderem den Preischamp, aber das geht euch"}, {"id": 629, "start": 3911.44, "end": 3915.6, "text": "nichts an, deswegen steht ja auch nicht öffnen dran. Was ist denn so im Betrieb in der Cloud?"}, {"id": 630, "start": 3915.6, "end": 3919.88, "text": "Was im Betrieb, was meinst du bei uns auf der Arbeit? Oh, das ist jetzt ein bisschen"}, {"id": 631, "start": 3919.88, "end": 3924.68, "text": "viel, was ich jetzt aufzählen müsste. Das hier ist ein neues Feature bei Hetzner. Das"}, {"id": 632, "start": 3924.68, "end": 3928.76, "text": "gibt es bei vielen anderen Cloud Anbietern auch schon. Man kann jetzt, ohne dass man"}, {"id": 633, "start": 3928.76, "end": 3932.0, "text": "seinen Server selbst schützt, also man konnte schon immer seinen Server selbst schützen,"}, {"id": 634, "start": 3932.0, "end": 3936.88, "text": "IP-Tables, Firewall auf Linux aufmachen oder so, kann man jetzt eine Firewall da vorstellen"}, {"id": 635, "start": 3936.88, "end": 3941.52, "text": "direkt bei Hetzner. Das ist tatsächlich ganz praktisch. Nennen wir die mal FW-Speedchamp."}, {"id": 636, "start": 3941.52, "end": 3946.52, "text": "Ich hänge da nur einen Server dran. Man kann da wohl mehrere Server dran hängen. Packen"}, {"id": 637, "start": 3946.52, "end": 3952.6, "text": "wir den Speedchamp dran. Und jetzt ist alles gefiltert außer Port 22 und Ping. Und was"}, {"id": 638, "start": 3952.6, "end": 3962.16, "text": "wir halt auch noch freigeben müssen ist TCP-Port 80 und TCP-Port 443. Also sprich, Port 80,"}, {"id": 639, "start": 3962.16, "end": 3966.12, "text": "HTTP und HTTPS. Das müssen wir auf jeden Fall auch freigeben, sonst wird das Ganze nicht"}, {"id": 640, "start": 3966.12, "end": 3975.2, "text": "funktionieren. Speedchamp wäre auch eine gute Darkwrap-Seite. Generell, wir haben es ja"}, {"id": 641, "start": 3975.2, "end": 3982.04, "text": "Domainnamen und Projekte angetan, die irgendwas mit Champ heißen. Applied to? Was? Ja,"}, {"id": 642, "start": 3982.04, "end": 3990.68, "text": "ich glaube, das braucht einfach nur ein bisschen. Fully applied. Excellent. Hat funktioniert."}, {"id": 643, "start": 3990.68, "end": 3997.64, "text": "So, also, zack. Loggen wir uns mal auf den Server auf, machen wir ein neues Tab auf,"}, {"id": 644, "start": 3997.64, "end": 4008.92, "text": "root, add, Hetzner, IP. Und als erstes mal eine Runde updaten. HTTPS ist ein TCP-Protokoll,"}, {"id": 645, "start": 4008.92, "end": 4016.24, "text": "ja? Klar. Was sonst? Gibt ja nicht so viele Möglichkeiten, wie du was übertragen kannst."}, {"id": 646, "start": 4016.24, "end": 4032.28, "text": "Du hast doch zu Hause einen Server. Warum machst du das nicht bei dir zu Hause? Naja,"}, {"id": 647, "start": 4032.28, "end": 4040.76, "text": "nein schon, weil ihr es dann nicht ausprobieren könnt. So, wir machen jetzt erst mal hier"}, {"id": 648, "start": 4040.76, "end": 4048.12, "text": "Package-Update. Das ist ein eigenes Protokoll. HTTPS gibt es da nicht. Das ist TLS im Endeffekt."}, {"id": 649, "start": 4048.12, "end": 4057.16, "text": "Das ist quasi eine Verschlüsselung auf Layer-4-Ebene. Dementsprechend siehst du auch beispielsweise"}, {"id": 650, "start": 4057.16, "end": 4072.0, "text": "nicht, welche Urls du aufrufst. Siehst du also Parameter. Die Urls siehst du im Prinzip"}, {"id": 651, "start": 4072.0, "end": 4077.4, "text": "schon, weil du machst vorher eine DNS-Abfrage, aber du siehst halt nichts, was im HTTP-Request"}, {"id": 652, "start": 4077.4, "end": 4093.16, "text": "drinner ist. Übrigens heute, falls wir einen Mod da haben, Modcheck, Leute, Modcheck. Modcheck."}, {"id": 653, "start": 4093.16, "end": 4116.36, "text": "Ich bin ja da. Wo ist der Cute-Mod? Ja, das frage ich mich auch. Keine Mods, keine Regeln,"}, {"id": 654, "start": 4116.36, "end": 4122.4, "text": "doch die Regeln gelten nach wie vor. So, jetzt haben wir erst mal hier Updates gemacht, Upgrade,"}, {"id": 655, "start": 4122.4, "end": 4127.84, "text": "wunderbar. Abinstall, erst mal die wichtigsten Dinger, die wir hier brauchen drauf, deset,"}, {"id": 656, "start": 4127.84, "end": 4135.44, "text": "git. So, mal diese Standard-Packages auf dem Server installieren. So, und was wir jetzt"}, {"id": 657, "start": 4135.44, "end": 4141.96, "text": "machen müssen ist folgendes. Wir haben ja hier unsere SpeedChamp-Anwendung und wir müssen"}, {"id": 658, "start": 4141.96, "end": 4145.32, "text": "jetzt gucken, dass das Ding ein ordentliches Zertifikat bekommt. Also sprich, wenn man"}, {"id": 659, "start": 4145.32, "end": 4151.88, "text": "dann später auf die Seite geht, speedchamp.org, dann will ich, dass wir ein gültiges Zertifikat"}, {"id": 660, "start": 4151.88, "end": 4156.2, "text": "bekommen. Aktuell kriegen wir da schlicht und ergreifend gar nichts, was auch nicht so"}, {"id": 661, "start": 4156.2, "end": 4163.64, "text": "sinnvoll ist. Warum benutze ich nicht die Cute-VM? Weil ich in der Cute-VM nichts auf die Reihe"}, {"id": 662, "start": 4163.64, "end": 4170.36, "text": "kriege. Die sieht einfach nur cute aus, aber ansonsten nix. Cute nicht gleich ergonomisch."}, {"id": 663, "start": 4170.36, "end": 4180.44, "text": "Gut, jetzt haben wir den Server hier eingerichtet bei Headsnone. Wir haben Package-Updates gemacht,"}, {"id": 664, "start": 4180.44, "end": 4184.76, "text": "wir machen mal schnell ein Reboot, dass er den aktuellen Kern lädt. Und jetzt nehmen"}, {"id": 665, "start": 4184.76, "end": 4195.72, "text": "wir uns die IP und tragen das hier beim DNS ein. Weil wir wollen ja, dass ping speedchamp.org"}, {"id": 666, "start": 4195.72, "end": 4204.6, "text": "soll ja nicht auflösen auf das, sondern speedchamp.org soll gefälligst auflösen auf... Wie mach"}, {"id": 667, "start": 4204.6, "end": 4210.76, "text": "ich denn jetzt einen Eintrag für das komplette So? Oder Sternchen? Sternchen wahrscheinlich,"}, {"id": 668, "start": 4210.76, "end": 4223.72, "text": "ja. Bitte auch IPv6, 0w, Alter. IPv6. Ach, kein C-Name, ein A-Rekord. Jaja, jaja. Habt"}, {"id": 669, "start": 4223.72, "end": 4239.4, "text": "er recht. Packweight. Yes. Also ich muss sagen, schön zu bedienen ist das jetzt nicht wirklich."}, {"id": 670, "start": 4239.4, "end": 4244.28, "text": "Muss man da jetzt Sternchen machen? Oder kann man das ganz weglassen? Nein, man muss wahrscheinlich"}, {"id": 671, "start": 4244.28, "end": 4250.76, "text": "Sternchen machen, oder Punkt. Sternchen, Sternchen, da heißt wahrscheinlich alles. Okay, und wenn"}, {"id": 672, "start": 4250.76, "end": 4259.16, "text": "das jetzt funktioniert... Nein, nein, nein, wir machen kein IPv6. IPv6 in 2021. So, und"}, {"id": 673, "start": 4259.16, "end": 4271.72, "text": "jetzt müssen wir warten, bis das DNS propagatet ist. Er benutzt Namechamp für DNS. Das wäre"}, {"id": 674, "start": 4271.72, "end": 4282.36, "text": "geil, ich mach mal einen eigenen DNS dafür. FlashDNS, gibt's da einen Knopf für? Ach,"}, {"id": 675, "start": 4282.36, "end": 4292.52, "text": "du meinst bei mir lokal, dass der das nicht mal gecached hat? Ach so. Aber das braucht"}, {"id": 676, "start": 4292.52, "end": 4295.8, "text": "trotzdem ein bisschen Zeit zu propagaten. So 5 Minuten oder so sollte man dem schon mal"}, {"id": 677, "start": 4295.8, "end": 4299.96, "text": "Zeit geben. Man kann das ja ganz einfach ohne Cache ausprobieren. Also wenn man das ausprobieren"}, {"id": 678, "start": 4299.96, "end": 4306.52, "text": "will, macht man nicht einfach einen Ping, sondern sagt, ähm, Dick. Speedchamp at GoogleDNS,"}, {"id": 679, "start": 4306.52, "end": 4321.8, "text": "mal gucken was der GoogleDNS zurückliefert. Und der GoogleDNS liefert zurück nichts. Warum"}, {"id": 680, "start": 4321.8, "end": 4332.76, "text": "liefert der gar nichts zurück? Ihr habt schon recht, man sollte schon IPv6 machen. Ne, ne,"}, {"id": 681, "start": 4332.76, "end": 4337.92, "text": "das ist egal. Ich frag jetzt da direkt den GoogleDNS ab. Warum antwortet er? Wir können"}, {"id": 682, "start": 4337.92, "end": 4352.64, "text": "auch mal Cloudflare abfragen. Juckt, juckt, juckt ihn gar nicht. Juckt ihn, juckt ihn"}, {"id": 683, "start": 4352.64, "end": 4356.28, "text": "noch gar nicht. Hat er das jetzt überhaupt gespeichert? Wie gesagt, ich hab Namecheap"}, {"id": 684, "start": 4356.28, "end": 4365.68, "text": "noch nirgendwo benutzt, muss ich jetzt irgendwie noch was speichern oder so? Oder muss ich"}, {"id": 685, "start": 4365.68, "end": 4378.76, "text": "bei Host direkt eintragen? Speedchamp.org. Also ich weiß gar nicht, wie das aussehen"}, {"id": 686, "start": 4378.76, "end": 4391.6, "text": "muss hier. Sternchen ist ok. Host add, als würde es hier sein. Add. Ne, Sternchen, Sternchen"}, {"id": 687, "start": 4391.6, "end": 4401.4, "text": "geht schon. Ok, wir warten jetzt einfach mal kurz ab und schauen, ob das funktioniert."}, {"id": 688, "start": 4401.4, "end": 4410.16, "text": "TTL Automatic ist doch ok. Was kann man hier bei Domains noch eintragen? Bei DNS Server"}, {"id": 689, "start": 4410.16, "end": 4416.12, "text": "noch eintragen? Basic DNS, Custom DNS. Ok, auch gut. Da könnte ich über Cloudflare"}, {"id": 690, "start": 4416.12, "end": 4430.52, "text": "machen oder so. Wir warten einfach mal ab. Wir warten einfach mal ab. Namecheap. Nicht"}, {"id": 691, "start": 4430.52, "end": 4438.28, "text": "Namechamp. Namecheap DNS Toplevel. Ich weiß gar nicht, wie man das da eintragen muss."}, {"id": 692, "start": 4438.28, "end": 4448.48, "text": "Aber nicht Toplevel. A-Record. Die haben doch bestimmt ein Exempel dafür. How can I set"}, {"id": 693, "start": 4448.48, "end": 4470.76, "text": "up A-Record for my domain? Yep. Manage. Advanced DNS. Add. Ah. Ah, das ist... Ok. Add leitet"}, {"id": 694, "start": 4470.76, "end": 4476.56, "text": "alles darauf weiter. Sternchen ist quasi Wildcard. Da kann ich sagen Sternchen Punkt. Das heißt,"}, {"id": 695, "start": 4476.56, "end": 4482.8, "text": "ich muss in dem Fall wirklich ein Add verwenden, wenn ich das richtig sehe. Ok, dann probieren"}, {"id": 696, "start": 4482.8, "end": 4498.16, "text": "wir das mal aus. Add. So müsste das jetzt eigentlich richtig sein. A-Record Add. Ja,"}, {"id": 697, "start": 4498.16, "end": 4508.28, "text": "exakt. So, so habe ich das jetzt. Sehr schön. YouTube Streamer. Wieso? Wieso was passiert"}, {"id": 698, "start": 4508.28, "end": 4514.36, "text": "man gerade im Stream? Ich habe es jetzt nicht auf. Was macht er? Er ist hier Frontend Hacker"}, {"id": 699, "start": 4514.36, "end": 4519.36, "text": "Man am Start. Guckt euch mal an hier. Der ist ja fast schon fertig. Der ist ja fast schon"}, {"id": 700, "start": 4519.36, "end": 4528.36, "text": "fertig. Ich habe mich mit dem Server eingerichtet. Ich laber zuviel. Ich habe nichts gemacht."}, {"id": 701, "start": 4528.36, "end": 4535.88, "text": "Ich hatte schon komplettes Energie am Start. Erst mal auf YouTube streamt. Ok Leute, also"}, {"id": 702, "start": 4535.88, "end": 4543.2, "text": "hier, Progress. Progress. Heck wait. Jetzt geht es so langsam. Warte mal. Wollen wir"}, {"id": 703, "start": 4543.2, "end": 4549.6, "text": "schon mal SSH Session? Wollen wir schon mal SSH Session? Ach hier, ich habe hier Rebooted."}, {"id": 704, "start": 4549.6, "end": 4556.44, "text": "So, also Dick. Er läst immer noch nicht auf. Ist auch egal. Also, ähm, wie kommt man zu"}, {"id": 705, "start": 4556.44, "end": 4561.0, "text": "deinem Kollegen? Du gehst hier hin. Moment, ich pause das mal in Chat. Wenn wir einen"}, {"id": 706, "start": 4561.0, "end": 4565.44, "text": "Mod da haben, könntet ihr einen Command einfügen. Das wäre schon äußerst nice, aber ich glaube,"}, {"id": 707, "start": 4565.44, "end": 4572.56, "text": "es hat keiner da. Das Sprint endet heute. Du musst alles schaffen. Ah, guck mal. Auflösung"}, {"id": 708, "start": 4572.56, "end": 4579.52, "text": "funktioniert. Ok, wunderbar. Also, wenn ich jetzt hier hingehe auf speedchamp.org, dann,"}, {"id": 709, "start": 4579.52, "end": 4585.28, "text": "ah, der hat es immer noch gecashed. So, was wir jetzt machen müssen ist, wir brauchen"}, {"id": 710, "start": 4585.28, "end": 4589.04, "text": "eine, also die Domain zeigt jetzt auf den Server drauf. Wir brauchen jetzt ein gültiges"}, {"id": 711, "start": 4589.04, "end": 4594.52, "text": "Zertifikat. Dafür installieren wir jetzt einen Reverseproxy, der das für uns macht."}, {"id": 712, "start": 4594.52, "end": 4600.0, "text": "Ist total einfach. Habe ich schon öfters im Stream gemacht. Ähm, wir installieren uns"}, {"id": 713, "start": 4600.0, "end": 4604.0, "text": "Kaddi als Reverseproxy, weil ich da meinung bin, Kaddi ist als Reverseproxy mit Abstand"}, {"id": 714, "start": 4604.0, "end": 4617.32, "text": "am einfachsten. Deswegen mache ich das jetzt einfach mal. Klar, man kann das alles auch"}, {"id": 715, "start": 4617.32, "end": 4623.56, "text": "mit, ähm, Docker-Containern machen oder direkt über Azure Functions. Das haben wir uns übrigens"}, {"id": 716, "start": 4623.56, "end": 4627.64, "text": "für einen zweiten Stream überlegt, Leute. Wenn wir hier in Speedchamp auch einen Falsurfer"}, {"id": 717, "start": 4627.64, "end": 4632.02, "text": "gehostet haben, dann wollen wir das nächste Mal versuchen, in irgendwie jetzt nicht unbedingt"}, {"id": 718, "start": 4632.02, "end": 4635.24, "text": "jetzt gleich nächster, direkt nächster Stream, aber in einem der nächsten Streams, machen"}, {"id": 719, "start": 4635.24, "end": 4640.84, "text": "wir dann das Frontend auf Netlify und das Backend in Azure Functions. Serverless, genau."}, {"id": 720, "start": 4640.84, "end": 4644.72, "text": "By the way, habe ich schon mal gesagt, was für ein bescheuerter Name Serverless eigentlich"}, {"id": 721, "start": 4644.72, "end": 4649.36, "text": "ist. Serverless bedeutet ja im Endeffekt bloß, es sind nicht meine Computer, sondern Computer"}, {"id": 722, "start": 4649.36, "end": 4655.36, "text": "von anderen Leuten. Jeden Stream, ja, ja, ich weiß es. Ok, Boomer, ich habe vergessen."}, {"id": 723, "start": 4655.36, "end": 4660.12, "text": "So, Kaddi haben wir am Start, wunderbar. Dann brauchen wir jetzt, äh, die Config-Datei."}, {"id": 724, "start": 4660.12, "end": 4675.16, "text": "Genau, also, unser Server läuft ja, wie man hier sieht, auf.netrun. Unser Server läuft"}, {"id": 725, "start": 4675.16, "end": 4683.16, "text": "ja auf localhost port 5000. Das heißt, wir müssen jetzt eine Kaddi-Regel einstellen,"}, {"id": 726, "start": 4683.16, "end": 4689.6, "text": "das ist nun mal so zur Erklärung. Wir haben auf dem Server dann lokal unseren eigentlichen"}, {"id": 727, "start": 4689.6, "end": 4718.6, "text": "Web-Service laufen auf port 5000. Mein Stream laggt übrigens. Ok. Huge lag. Ok. Ok. Ok."}, {"id": 728, "start": 4718.6, "end": 4733.12, "text": "Ok. Ok."}, {"id": 729, "start": 4868.6, "end": 4895.08, "text": "Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok. Ok."}, {"id": 730, "start": 4895.08, "end": 4907.76, "text": "Komm an Wodafone, krieg dich ein, mach hinne!"}, {"id": 731, "start": 4925.08, "end": 4942.84, "text": "So, kriegt sich das Ganze jetzt wieder ein?"}, {"id": 732, "start": 4942.84, "end": 4950.44, "text": "Äh, Test-Test, geht das jetzt wieder?"}, {"id": 733, "start": 4950.44, "end": 4960.6, "text": "Ah, jetzt geht's wieder!"}, {"id": 734, "start": 4960.6, "end": 4968.36, "text": "Meine Güte, Wodafone hier, guckt euch das mal an, 54% Päckchenlost, Keg-Wade, Alter!"}, {"id": 735, "start": 4968.36, "end": 4970.08, "text": "Wodafone direkt verreckt einfach nur."}, {"id": 736, "start": 4970.08, "end": 4976.32, "text": "So, äh, Test-Test, bist du da?"}, {"id": 737, "start": 4976.32, "end": 4978.36, "text": "Ich bin da, hörst du mich?"}, {"id": 738, "start": 4978.36, "end": 4981.04, "text": "Mein Stream ist komplett abgeschissen, Wodafone war zwei Minuten weg."}, {"id": 739, "start": 4981.04, "end": 4985.48, "text": "Ich bin froh, dass das bei mir nicht passiert ist, weil ich bin auch bei Wodafone."}, {"id": 740, "start": 4985.48, "end": 4989.4, "text": "Ah, vielleicht wird, ich hab vorhin meine IP geleakt, vielleicht den Idee-Dossack direkt"}, {"id": 741, "start": 4989.4, "end": 4990.4, "text": "am Start."}, {"id": 742, "start": 4990.4, "end": 4991.4, "text": "Nee, glaub ich nicht."}, {"id": 743, "start": 4991.4, "end": 4992.4, "text": "Das kann halt sein, ne?"}, {"id": 744, "start": 4992.4, "end": 4995.4, "text": "Nee, das ist irgendeine Wodafone-Kacke."}, {"id": 745, "start": 4995.4, "end": 4997.24, "text": "Oder einfach wieder Wodafone am Verkacken."}, {"id": 746, "start": 4997.24, "end": 4999.24, "text": "Ich denke, ich denke es ist Wodafone."}, {"id": 747, "start": 4999.24, "end": 5003.96, "text": "Also, ähm, tja, also ich bin immer noch am Server einrichten, ich hab gesehen, ich"}, {"id": 748, "start": 5003.96, "end": 5007.56, "text": "hab kurz bei dir im Stream geguckt, du hast schon irgendwie GUI am Start mit Knopf und"}, {"id": 749, "start": 5007.56, "end": 5008.56, "text": "so."}, {"id": 750, "start": 5008.56, "end": 5012.28, "text": "Ich hab, ich hab, ich bin richtig krass am, am Agile unterwegs, ich hab den Knopf und"}, {"id": 751, "start": 5012.28, "end": 5013.28, "text": "..."}, {"id": 752, "start": 5013.28, "end": 5014.28, "text": "Ja, ich seh's."}, {"id": 753, "start": 5014.28, "end": 5017.24, "text": "Also ich, ich, ich sorg jetzt erstmal dafür, dass man, äh, also Domain funktioniert schon"}, {"id": 754, "start": 5017.24, "end": 5021.56, "text": "und ähm, ich mach jetzt erstmal ein ordentliches Zertifikat, dass wir, dass wir grünes Häkchen"}, {"id": 755, "start": 5021.56, "end": 5023.52, "text": "im Browser haben, wenn wir draufgehen."}, {"id": 756, "start": 5023.52, "end": 5024.52, "text": "Okay, alles klar."}, {"id": 757, "start": 5024.52, "end": 5026.04, "text": "Ich sag dir Bescheid, bis gleich."}, {"id": 758, "start": 5026.04, "end": 5027.04, "text": "Okay, jo."}, {"id": 759, "start": 5027.04, "end": 5028.92, "text": "Okay Leute, funktioniert jetzt alles wieder?"}, {"id": 760, "start": 5028.92, "end": 5035.12, "text": "Sollte, sollte alles tun, ne?"}, {"id": 761, "start": 5035.12, "end": 5037.56, "text": "Man hat, man hat von ihm nix gehört?"}, {"id": 762, "start": 5037.56, "end": 5039.76, "text": "Doch, man hat was von ihm gehört."}, {"id": 763, "start": 5039.76, "end": 5046.6, "text": "Wodafone Premium Peering, ja."}, {"id": 764, "start": 5046.6, "end": 5051.12, "text": "Okay, wunderbar."}, {"id": 765, "start": 5051.12, "end": 5053.08, "text": "Also, weiter geht's."}, {"id": 766, "start": 5053.08, "end": 5055.72, "text": "Ähm, wo bin ich jetzt stehen geblieben?"}, {"id": 767, "start": 5055.72, "end": 5056.72, "text": "Genau."}, {"id": 768, "start": 5056.72, "end": 5060.64, "text": "Also wir müssen jetzt ein Proxy bauen, der sich um Zertifikate kümmert."}, {"id": 769, "start": 5060.64, "end": 5062.56, "text": "Ja, ich bin, ich bin wieder da."}, {"id": 770, "start": 5062.56, "end": 5066.56, "text": "Dann muss ich um, leider, leider Wodafone wieder rumgespackt."}, {"id": 771, "start": 5066.56, "end": 5071.88, "text": "Wir müssen uns jetzt um den Proxy kümmern, der äh, äh, Zertifikate, äh, erneuert mit"}, {"id": 772, "start": 5071.88, "end": 5076.88, "text": "letzterem Clip, dass wir ein schönes grünes Häkchen im Browser haben, wenn wir auf speedchamp.org"}, {"id": 773, "start": 5076.88, "end": 5077.88, "text": "gehen."}, {"id": 774, "start": 5077.88, "end": 5080.04, "text": "Der Chatbot scheint zu hängen."}, {"id": 775, "start": 5080.04, "end": 5084.56, "text": "Der macht wahrscheinlich einfach nicht hetzener 30.000 mal."}, {"id": 776, "start": 5084.56, "end": 5091.56, "text": "Da müssen wir gucken."}, {"id": 777, "start": 5091.56, "end": 5096.24, "text": "Okay, guck mal, speedchamp.org, die Testseite geht übrigens schon."}, {"id": 778, "start": 5096.24, "end": 5101.92, "text": "Also, Leute, wenn ihr jetzt auf speedchamp.org geht, kriegt ihr die Testseite, möglichst"}, {"id": 779, "start": 5101.92, "end": 5104.0, "text": "wahrscheinlich, die etwas scheppe Testseite."}, {"id": 780, "start": 5104.0, "end": 5108.68, "text": "Aber, das werden wir jetzt rausschmeißen, das werden wir jetzt rausschmeißen, und zwar"}, {"id": 781, "start": 5108.68, "end": 5111.44, "text": "wir werden jetzt einen, äh, Redirect machen."}, {"id": 782, "start": 5111.44, "end": 5118.4, "text": "Und zwar einen Redirect für, ich hoffe, das krieg ich aus dem Kopf hin, kardi, äh, reverse"}, {"id": 783, "start": 5118.4, "end": 5119.4, "text": "Proxy."}, {"id": 784, "start": 5119.4, "end": 5122.44, "text": "Ich hab jetzt einfach die offizielle Doku an, die ist nämlich ganz gut für, für kardi."}, {"id": 785, "start": 5122.44, "end": 5150.44, "text": "Oh, ne, ist wieder am abkacken, oder?"}, {"id": 786, "start": 5150.44, "end": 5180.36, "text": "Das ist mega am rumleggen, äh."}, {"id": 787, "start": 5180.36, "end": 5187.2, "text": "Huge lag."}, {"id": 788, "start": 5210.36, "end": 5229.36, "text": "Oh, ne, das ist mega am rumleggen, äh, reverse Proxy, äh, reverse Proxy, äh, Redirect."}, {"id": 789, "start": 5229.36, "end": 5254.36, "text": "Oh, ne, das ist mega am rumleggen, äh, reverse Proxy, äh, reverse Proxy, äh, Redirect."}, {"id": 790, "start": 5254.36, "end": 5282.36, "text": "Oh, ne, das ist mega am rumleggen, äh, reverse Proxy, äh, Redirect."}]}