{"text": "Na wunderbar, ok ich hoffe jetzt gehts wieder, also ich hab Vodafone auch schonmal angeschrieben,also falls wirklich irgendwelche krassen DDoSer Dudes am Start sind, gibts jetzt IP Wechsel,ich bin halt immer doof, dass das nötig ist, aber meinetwegen, kurz reloaden, es könnteauch sein, dass Vodafone selbst Probleme hat, aber es war schon sehr auffällig, wir wissenja, hier gibts irgendwie Leute mit Polen, Netz und allem am Start, aber jetzt will was willst du machen?Also bei mir ist Vodafone komplett repp, ich vermute mal eher, dass wieder irgendwelchePolen DDoS Leute am Start sind, ich war halt ein bisschen fail, aber normalerweise reißensich die Leute zusammen, aber es gibt halt hin und wieder welche, die können sich nicht verkneifen.Wir haben kurz den Tor Browser aufgemacht und irgendwie erstmal DDoS eingekauft, was auch immer.Bei mir schreiben die Leute jetzt schon in den Chat, meine Zuschauer gehen jetzt wieder runter,weil du jetzt wieder da bist. Ich lass beides auf Leute, wir machen das so,also ich mach jetzt weiter, mal gucken, vielleicht gehts jetzt, ich hab Vodafone aber schonkontaktiert, die machen jetzt IP Wechsel dann demnächst. Ja ok super. Ich bin jetzt leiderin der Zwischenzeit nicht weitergekommen, ich war oft. Nein, kein Stress, kein Stress. Also wenn duspeedchamp.org aufrufst, kriegst du zumindest schon mal ne Testseite, kannst du nicht viel mitanfangen, aber ich kümmere mich jetzt um den Zertifikat und dann machen wir den Rest. Ichsag dir gleich Bescheid, sollte schnell gehen, aber ja, geht nicht so agil wie erhofft. Kann sein,als ich demnächst wieder weg bin, dann musst du erwarten bis Vodafone das gewechselt hat,aber sollte halbwegs schnell gehen. Ok, alles klar. Ich sag dir gleich Bescheid bis denn. Alright. Ok,nice. Also Leute, weiter gehts. Hoffe mal, dass es jetzt funktioniert. Ich mach jetzt mal, ich willgucken, ob es kaputt geht. Ich lasse es einfach ping laufen, damit er kommt. Also wo wir stehengebliebensind, ich wollte ein Zertifikat ausstellen für speedchamp. Das hätten wir eigentlich schon seitEwigkeiten fertig haben sollen, aber naja. Mein Payal hat den DNS Eintritt noch nicht. Echt nicht?Ja, speedchamp.org. Innebar Kabel kriegt man nicht in euer IP, das muss Vodafone machen.Also unser Lokalaservice läuft auf Port 5000, das wissen wir. Das heißt wir machen jetzt ReverseProxy, Port 5000, allerdings müssen wir die Domain eingeben und unsere Domain ist speedchamp.org undja, das war's. Ich glaube da muss man das klammern oder so. Ich bin mir bei der Syntax ehrlichgesagt unsicher, ob das so ging, ob man so Reverse Proxien kann. Mal schauen. Sollen wir mal gucken.Ich hoffe, das stellt jetzt gleich ein Zertifikat aus und dann kann ich am Backend weiterprogrammieren. Sollte eigentlich funktionieren. Okay, System, CTL, Restart, Kadi. Das ist halt echtblöd. Wir setzen Erwerbung die ganze Zeit. Ich hab's extra kleiner gemacht, nur um in die Eckegeschoben. Musste es mal ausprobieren, wie das funktioniert. Dein Overlay zeigt noch nicht dieChat-Nachrichten an. Echt nicht? Ach stimmt. Ich glaube, das ist RIP.Jetzt sollte es wieder funktionieren. Also falls einer von den Mods da ist,es wäre cool, wenn ihr Ausrufezeichen heute und den YouTube-Link zum Noel machen könntet.Okay, also weiter im Text. Hat es jetzt funktioniert mit Zertifikat? Wir haben Zertifikat, Leute.Bam. Connection secure. Let's Encrypt. Easy. So einfach geht's. Wir haben Zertifikat. Also,das Ganze ist passend eingerichtet. Wunderbar. Klappt. Mehr müssen wir auf dem Server erstmal nicht machen. Das passt. So, jetzt kann ich bereits sagen. So, Server ist eingerichtet,passt. Wenn du Speedchamp.org guckst, haben wir jetzt ein gültiges Zertifikat. Okay, wunderbar.Können wir loslegen. Speedchamp.org. Ja. Okay, und dann dementsprechend halt klar den Postrequestmache. Also wir kriegen, da läuft noch nichts, ne? Ich hab noch nichts hingeschrieben. Aber dusolltest ein Zertifikat, ein gültiges bekommen. Ja, das geht. Der Proxied. Echt nicht? Ja,du bekommst ein 502, das ist richtig. Genau. Du bekommst ein 502, weil der Applikationswappen,wo er draufschiebt, noch nicht da ist. Aber das gültige Zertifikat kriegst du schon. Okay,alles klar. Also heißt, ich kann jetzt darauf auschecken und laufen. Wobei da steht,bei mir diese Webseite besitzt kein Zertifikat. Bei mir sagt er, es ist Connection secure.Das ist vielleicht ein Caching-Problem. Ich geh mal kurz auf Chrome. Ah, Chrome checkt's nicht.Alles klar, Firefox funktioniert. Chrome macht nicht weiter, weil es einen 502 gibt. Da mussich doch die Anwendung noch drauf starten. Weil dem Firefox sagt er mir schon, es ist einLet's Encrypt-Zertifikat. Ah, okay. Also es funktioniert. Dann check ich jetzt einfach maldie Anwendung da drauf aus und starte die. Und ach so, ich hab gar kein.NET drauf. Ne,mach ich jetzt nicht. Sobald es so funktioniert, machen wir das dann. Du brauchst definitiv nochDocker drauf und da dann ne Container-Ride. Das hab ich mir auch schon überlegt, ob wir das überDocker und Compose machen. Wir müssen es, wir müssen es nicht übertreiben. Passt. Ach so,geht jetzt eigentlich die, nachdem hier Vorderfall rumgesponnen hat, geht eigentlich der Coach hernoch? Denke, denke das tut noch. Ich glaube, du müsstest eine neue Session aufmachen. Ah, hierda ist, ne, der ist angeblich, ist er noch offen, aber ich kann dich noch mal einladen. Die Sessionist noch auf, aber die, wahrscheinlich bist du rausgeflogen aus der Session. Ähm, lass mich malgucken. Ich bin rausgeflogen, also du müsstest mich noch mal neu einladen. Müsste, müsste sein. Achhier, Accept. Danke schön für den Sub, der Kommentator. Ja, passt. Bis zum Startup seh ich.Alles klar, dann klappt das wieder. Cool. Alright. Alles klar, gut, was machen wir jetzt? Also dannpacke ich jetzt die Anwendung mal kurz auf den Server drauf, dass du auch siehst, dass das allesfunktioniert. Und dann wäre ich bereit, Backend Sachen zu basteln. Yes. Okay. Dann mach ich dasschnell, sag dir gleich nochmal Bescheid. Und dann kannst du, da können wir bei mir im Stream auchmal schnell dann gleich gucken. Ich mach die Anwendung drauf und da kannst du ja mal committen,wenn es soweit ist und dann können wir uns die mal anschauen. Genau, machen wir so. Okay, ich sagein paar Minuten Bescheid. Alright. Richtig hyperagile jetzt. Jetzt geht's los. Jetzt,wo Wodafone hoffentlich wieder geht. Alles klar, bis gleich. Yes. So Leute, also was wir jetztmachen ist folgendes. Schade ein bisschen, dass das jetzt so abgekackt ist. Wir waren mal 400Zuschauern, aber kannst nicht machen. Ich bin froh, dass ihr alle da seid. Cool, dass ihr zuguckt,auch wenn es heute ein bisschen Technikkram ist. Haben wir C, CD? Haben wir noch nicht? Wir machenGitHub Actions gleich. So, ich werde mir den Kram mal kurz klonen. Kommt Ansible? Weiß ich nochnicht, ob wir da jetzt Ansible für machen. So, ich clone mir mal kurz das GitHub Repo. JIT clone.Und ich installiere mal.NET Ubuntu. Ich installiere mal.NET auf dem Server drauf. Dann können wirdas einfach ausführen. Nee, nee. 20.4. Update und dann install, wahrscheinlich.NET, genau.Dankeschön Mods. Exzellent, exzellent. Warum nicht gleich GitOps? Warum nicht gleich Azure?Warum nicht gleich Azure Functions? Warum nicht Netlify? Warum nicht AWS? Ja,man kann es alles. Es gibt tausend Wege, wie du was machen kannst.Übrigens, danke für die ganzen Subs. Ich habe es jetzt gerade erst noch gesehen.Der Kommentator ist noch dabei. Fizz und Xenpy. Hab ich glaube ich schon vorgelesen,aber auch nochmal an euch. Danke. Massive Subscriptions. Hi IQ. IQ++. Um nicht zu sagen.Massive Big Brain. Warum nicht Cobol ist die eigentliche Frage? Warum nicht Cobol und ABAP?Das ist die eigentliche Frage hier. So, jetzt haben wir die Anwendung hier drauf. SpeedChamp,SpeedChamp, Backend und nun.NET Run. So, und jetzt sollte auch was kommen auf speedchamp.org.Log loss 5000. Passt. Ja, gut. Der kann jetzt nicht so genau. Was hat er für Schmerzen? Habeich irgendwas verkehrt gemacht im Reverseproxy? Page not working. Ah, no webpage. Ja, das istklar. Gibt ja auch keine Webseite aktuell. 404. Aber 404 ist. Warum zeigt ein Chrome da nichts an?Sollte mir Chrome nicht bei einem 404 auch ein Zertifikat anzeigen? Bin ich jetzt irgendwieHardcore, Hardcore, verwirrt Champ oder Mkdir, WWW, Index, HTML. Gucken wir mal. Hallo. Dersollte jetzt zumindest irgendwas anzeigen. Firefox geht. Ja, ja, ich weiß. Firefox gehtlustiger, aber es ist komisch. Ich habe ich habe garantiert irgendwas in der in der Konfigverkehrt gemacht. Localhost. Localhost Port 5000. Irgendwas. Irgendwas funktioniert da nicht.Schauen gleich Pepega. Guck mal, ich habe irgendwas. Ich habe bestimmt irgendwas in derKonfig verkehrt gemacht. Etc, Kaddi, Kaddi. Reverseproxy ist eigentlich richtig. Eigentlichist ok. Curl. 7.0.0.0.5.000. Slash, Speed, Champ. Ah, ich weiß euch vergessen, ich liefer jagar keine Seiten aus. Ok, das muss ich noch einstellen. Es ist nämlich in.NET standardmäßigso, der liefert keine Seiten aus, obwohl man es angelegt hat. Man muss ihm sagen, explizitliefere Server, also liefere statische Seiten aus. Das heißt, ich muss jetzt ein Ordneranlegen. WWW Route. Das ist so der Default Ordner, wo die ganzen HTML Seiten reinkommen.Da mache ich jetzt irgendwie eine Index, Index HTML rein. Reicht. Hack W. Mehr muss da nichtdrauf. Und jetzt muss ich noch sagen, App Use File Server. Und erst dann surft er dieseFiles in WWW Route. Aldir, Dankeschön. Plants vs. Zombies, exzellent. Ich spogge das Game.Use File Server muss ich machen, sonst funktioniert das Ganze nicht. Ihr könnt jetzt 12701D dorsen.So, machen wir mal ein neues Commit. Wir sind ja super hyper agil hier. Git add, Git status,Git commit minus M. Was haben wir gemacht? Edit Default. Kann ich mal schreiben. EditDefault Page. Ne, wir machen es anders. Enabled Pile Serving. Ist ASP.NET outdated? Das istja auch nicht ASP.NET, das ist ASP.NET Core. ASP.NET Core ist das neue und super aktuellund es kam quasi erst vor ein paar Tagen auf der Microsoft Build eine neue Preview Versionraus. Agile Champs sind am Champen, so sieht es aus. Ich lösche den Kram noch mal kurzund check das nochmal neu aus. Ah, Wodafone hat sich gemeldet. Exzellent. Wodafone warmeine Kundennummer. Wodafone braucht meine Kundennummer. Moment.Wodafone ist meine Kundennummer. Wodafone ist meine Kundennummer. Wodafone ist meine Kundennummer.Wodafone ist meine Kundennummer. Wodafone ist meine Kundennummer. Wodafone ist meine Kundennummer.Wodafone ist meine Kundennummer. Wodafone ist meine Kundennummer. Wodafone ist meineKundennummer. Wodafone ist meine Kundennummer. Wodafone ist meine Kundennummer. Wodafonewaren wir genau ich habe kommited ich habe kommited und wollte das ganze noch mal kurzklonen klonen speed speed champ klont jetzt sollte zumindest die standard seite eigentlichausliefern speed champ speed champ back end dotnet run so und wenn jetzt klappt jeezyprodankeschön für den sub und jetzt sollte er eigentlich die seite ausliefern standardmäßigsteht dann in der seite glaube ich keck keck weh oder so läuft und und und keck weh bäm dasind wir leute und gültiges zertifikat ok ok bin ready seite geht wenn der refresh zertifikatist da und ab jetzt können wir können wir den kram direkt auf den server pushen er schreibtes geht noch alles ja ich habe ich habe gerade vergessen ich habe schon gedachtwunderbar in welches ich würde da mal mein projekt bauen in welches in welchen ordnervon dir soll ich das dann mal rein das zeige ich dir mach mal kurz visual studio code please aufmit dem mit dem gescherten code also ich habe jetzt du musst dann auch noch mal pullen vorher ichhabe jetzt noch eingestellt dass der statische files ausliefert hier use files das musst dunoch machen ansonsten jetzt überhaupt nicht funktioniert hat mich schon ich habe mich schondie ganze zeit gewundert warum gibt es keine seiten wenn du das aufmachst aber klar wenner keine statischen seiten ausliefert kann es auch keine seiten geben genau also muss das hierreinschieben guck mal es gibt da einen ww root da gibt es eine index html drin die habe ich nurzum testen reingemacht die kannst du überbügeln all right alles klar genau dann mache ich dasgenau kann es vorher noch mal muss muss vorher noch einmal einmal pullen oder ganz bescheid sagen dannsoll ich irgendwas backern technische schon machen an sich an sich gerne ja ja nur die frage waswie machen wir also also meine ich muss jetzt mir erst mal überlegen wie ich quasi berechne wieviele mbit das sind on the fly sozusagen während dem upload prozess ja big brain time sozusagenganz ganz big brain time ich stehe halt wirklich total auf dem schlaufe müsste es echt malgucken ich weiß nicht was du machen könntest ich könnte ich könnte zumindest also wenn duwenn du jetzt du upload ist ja dann einfach mal wir haben uns ja im vorfeld schon mal auferst mal auf 20 mb geeinigt haben wir gesagt 20 mb ist eine gute gute größe ich könntees so machen ich könnte im back end jetzt einfach mal von dir 20 mb einlesen genau also das wäregut wenn du bei dem endpunkt einfach mal das vorbereiten könntest dass ich da quasi wirklichdaten du kannst einfach so viel uploaden wie du willst bei 20 mb hat er dann auch also ichhabe es jetzt so gemacht wir können das gerne so machen ich habe noch so eingebaut dass dernutzer sich noch selektieren kann aber wir können es ja trotzdem erst noch 20 mb limitieren genauwir machen erst mal 20 mb ja genau wir waren erst mal erst mal 20 mb hard code und dann guckenwir das baue ich jetzt ein und kannst du kommenten und pushen kannst mir dann einfach bescheid sagendann pull ich das mal und dann mache ich ein update mal auf dem server da können wir essonst dann angucken ok jetzt alles klar dann mute ich mich wieder so chat big brain time ich guckemal kurz beim null in den stream rein wie es da ausschaut was da was da abgeht gerade gucken wirach ne jetzt sind wir grad bei mir im controller ok vielleicht vielleicht vielleicht auch maldie quali ein bisschen höher machen speedchamp 20 mb leute 20 mb reicht 20 mb also von der ideeher funktioniert es ja folgendermaßen wenn also wenn ich jetzt das im backend testen würdewürde ich das folgendermaßen machen also ich schreibe das jetzt einfach mal als kommentar auf20 mb upload machen wir machen wir es doch schon mal so war upload sei es gleich 20 wie viel sind20 mb in bytes 20 20 20 millionen kann das sein huge huge brain chat kommt hin oder okja das zwei und sieben nuller ok passt also dass das müssten zwanz das müssten 20 mb sein wenndas wenn das halbwegs halbwegs stimmt was ich da low i cute habealso dann machen wir das jetzt folgendermaßen nachdem ich nicht genau weiß was er neu genauim frontend macht mache ich jetzt einfach mal so ich lese sinnlos einfach ein der kann so vielupload ne das mache ich nicht das mache ich nicht der kann nicht so viel uploaden wie er will weilwenn ich das auf den server schiebe dann weiß ich genau dann starten die ersten leute einfachnur endlich lang download nur endlich lang upload und machen den server voll und ich habe einehetzer server rechnung von 5000 euro ich kann es mir schon richtig vorstellen nein nein nein daswürde der chat natürlich niemals machen sowas nie würdet ihr das machen ich wie komme ichwie komme ich drauf dass sie sowas machen würdet na ok also sagen wir mal upload sei es sind 20 mb20 mb schreibe auch mal dahin megabytes heute ist es ja mehr deutsch mit mibi und mobi und wases da nicht alles gibt so und dann brauchen wir den buffer wo man den ganzen kram reinschreibenbuffer gleich new byte array in upload sei es so weit von der theorie her ich weiß jetzt nochnicht genau wie es weitergeht ok so und dann von der theorie her funktioniert es folgendermaßenzeit stoppen also im prinzip zeit zeit wie nennen wir das also stopp ur starten upload einlesen wennupload größer größer gleich 20 mb zeit stoppen und dann quasi upload sei es durch zeit so weitmüsste das das müsste ungefähr die upload geschwindigkeit geben also ich lese 20 mb einund startet die stoppe die zeit wie lange es dauert 20 mb einzulesen 20 mb ist halt das problem dass20 mb ja nach nach geschwindigkeit wahrscheinlich ein bisschen ungenau sein könnte also jaich dachte er kommt erst in die upload methode rein wenn der body fertig empfangen wurdene wir machen jetzt wir machen jetzt war alles gepusht was alles gepusht ich habe ich habegepusht kann es mal gucken ob es irgendwie funktioniert ich pull mark kurz geht pull originmaster ok der request wird wahrscheinlich noch nicht funktionieren weil ich da hardcoded localhost drin stehen habe ich aber wenn die seite aus dir liefert wird dann ist das schon mal diehabe ich bin ja noch dabei am am einlesen von von einem upload habe ich noch nicht noch nichtfertig soll ich mal soll ich auf dem server gucken schon mal bei mir im stream zeigen wiedie seite jetzt ausschaut oder was erst mal lokal lassen ich meine ich meine an sich istjetzt noch nicht so viel ganz gerne zeigen aber da gucken wir gucken uns das mal kurz an ichhoffe muss nur gucken dass ich keinen sinntagsfehler produziert habe sonst funktioniert das ganzenämlich nicht so gepullt habe ich schon das vorher mal updaten nicht dass das ich habemeinem chat noch vor gesagt wir müssen uns da noch ein gutes emote raussuchen was wir danndas titel nutzen ja gleich sehen ist ganz wichtig dass also wir brauchen wir brauchen sowohl dasund wir brauchen unbedingt so den so einen faf eiken yes also ohne ohne ohne geht esgeht es ja nicht das stimmt ich push jetzt meinen kam auch mal kurz dann gehe ich aufden server drauf und hol mal das aktuelle so wunderbar das ist jetzt zwar sehr unagilmuss ich mal sagen ja wir pushen das und ich pulse dann auf dem server von hand da müsstejetzt ja eigentlich die continuous integration pipeline anlaufen damit das richtig richtigwäre wir machen nachher github actions draus so da ist es leute sieht das nicht geil ausguckt euch mal knopf upload größe wählen und hier unten hast du hardcoded werte reingeschriebengenau das ist der chet versagt macht doch schon mal macht doch schon mal macht doch schon washerr ich guck mal kurz in den source code rein was du für ob es ist von hand ge- hallo elementshast du es von hand gemacht das css oder hast du irgendein css framework drin? ich hab ich hab ichhab tailwind tailwind hab ich schon mega geil tailwind ist nice ja tailwind ist richtig geilmonero ja wie cristiano ronaldo ne wobei was war denn monero? ich glaube es war monero oderoder ethereum oder so ich weiß es nicht genau zumindest hat christiano ronaldo auf seinerwebsite ja auch coins coins gemeint wobei ich davon ausgehe der hat der typ der typweiß das ja nicht das hat irgendeinen admin gemacht ich glaube christiano ronaldo istkeiner der zur damaligen zeit irgendwie einen plan davon hatte was kryptowährung ist das istja schon zwei jahre her jetzt schon jetzt sind sie alle dabei aber cool passt ja wenn ich jetzthier auf upload drücke dann geht wahrscheinlich nix genau genau ne genau dann sagt er hier gehtnicht wunderbar ja dann baue ich das mal ein dann ist der ich ich lese einfach 20 mb ein und nach20 mb höre ich auf okay oder ich gucke einfach ob es größer weil ich ich darf nicht mehr einlesenweil ich weiß genau sonst gibt es der erste im chat der ist schon am start mit seinem uploadserver und pumpt das ding voll wer wusste man muss ja hier an alles denken ja call up nächstenächste stream how to implement dedos sagst nicht so laut nächste stream machen wir folgendes ichhab es mir schon überlegt wenn das hier funktioniert machen wir das frontend auf netlifyund mein backend kommt dann azure funtions und dann sind wir richtig agil dann sind wir dabeidann haben wir die 30.000 euro rechnung ich habe noch ich habe noch von der schulung ichhabe noch 200 euro gutschein das machen wir dann man kann ich glaube man kann den nichtüberziehen weil auf den schulungs accounts musst du keine zahlungs sachen hinterlegendas smart also im prinzip ist das geht es dann wahrscheinlich einfach aus oder so das ist dasist klug das ist echt klug ich brauche schnell ein mit dass der 20 mb einliest und du kannst jagucken dass du nicht auf localhost gehst jetzt genau habe ich schon implementiert und da guckenwir mal zusammen gleich wieder also leute weiter 20 mb upload hardcode jetzt erst mal ihr habtja gesehen im frontend man kann das dann später auswählen aber ok ohne scrum poker seid ihr echtnicht sehr agil ja wie gesagt die tribe meetings fehlen auch und eitel sind wir eitel zertifiziertich muss nur nur mal fragen nur sag mal bist du eitel zertifiziert ich auch nicht kann das mitder qualität doch gar nichts werden bis wenigstens vielleicht den iso 9001 oder safe oder irgendwasgar nicht ich auch nicht qualitäts management ist bei mir unten durch aber ich auch nichtdanach fangen wir an wir brauchen den chat der chat ist unsere qualitätssicherung ich binqualität ist egal der speed champ ist 27 001 zertifiziert ganz klar der ist hochsecure dashat man heute schon gesehen zweimal den auswählen ich mache jetzt weiter ich gucke mal ich guckemal schnell ich gucke mal schnell noch mal hier in chat ob ich irgendwas beantworten kann fallses fragen zu dort nett oder so gab ich glaube aber nicht ich glaube nicht bei max stehen 20millionen bei als 20 mb ihr kommt da ungefähr hin das sind da wobei da kommt ungefähr hin sinddas sind das megabyte es gibt auch mehbi und mega und so da blick ich nicht mehr durch das genau diegenau die unterhaltung hatte ich mit meinem mit meinem chat vorher auch ich glaube mega istjetzt neuerdings komplett 1000 und mehbi ist 1024 es kann aber auch genau umgedreht sein wie ihrsagt ich weiß ich gebe das ich gebe das offenbar ehrlich zu ich habe keine ahnung bei dir ist abernoch nicht so lange her bei mir gab es das alles noch gar nicht bei mir gab es das alles nochgar nicht ich kann mich auch genau dran erinnern mit meinem berufsschullehrer mir das erklärt hatund ich hoffe dass er mir nachher nicht schreibt und mir sagt na guck mal warum hast du eigentlichdamals nicht aufgepasst ich würde sagen wir machen es ganz einfach wir sind wir machen wirsagen einfach 20 millionen bytes dann immer das gleiche einfach 20 und 60 dass das front endsoll der kunde sich selber irgendwie zugänglich machen gibt es gibt es auch schon seit jahren gibtes auch schon seit jahren dass leute die sagen demnächst braucht man keine programmierer mehrweil man das alles zusammen klicken kann ich warte noch drauf ja bis jetzt ist noch nichteingetreten nee das stimmt ich soll dich übrigens fragen warum du auf youtube streamst weil ichtwitch gar nicht eingerichtet habe aber und halt auch keinen gescheiten twitch account habe ichhabe noch einen ganz alten account von let's play zeiten aber bei dir gucken die leute einfachauch über youtube weil du auf youtube die abos hast wer ja blöd jetzt auf twitch zu streamen wokeiner mitbekommt also an sich wäre es vielleicht klug parallel zu streamen oder so weil twitch isteindeutig die bessere plattform haben wir vorher gemerkt was allein einstellung und so weiterangeht aber youtube einfach weil da der die community ist ja würde ich auch so machen alsowenn ich auf youtube die zuschauer hätte klar leuchtet ein so chat zufrieden alles klar ok ichbaue eins ich lese einfach 20 mb ein dann höre ich auf und dann können wir gucken ob das funktioniertalles da sagt ihr bescheid perfekt hier huge huge pair programming wir pair program übrigensgar nicht fällt mir ein aber wir aber wir sind wir sind agil wir sind wir sind hyper angel kadelalso ok war weiter upload size 20 mb ok das heißt theoretisch muss ich jetzt folgendes machen ichhätte fast einen speedtest aufgemacht lull war keine gute idee gewesen wieder ok also jetztmachen wir folgendes lass mal kurz lass mal kurz überlegen also wir müssen jetzt einfach uploadeinlesen das geht folgendermaßen unter dort nett wusste ich selber nicht wie man das untersp.net core macht ehrlich gesagt da habe ich stack overflow befragt weil ihr wisst ja wennman keine ahnung hat fragt man einfach stack overflow und da habe ich habe ich glaube ichgesucht nach read raw bytes sp.net core und da habe ich was gefunden wie das funktioniertdas da war es glaube ich genau und dann bin ich drauf gekommen dass das funktio otze jaoddie read ok ich glaube ich habe mir sie irgendwie dann reversed raus zusammengepasst also das gehtfolgendermaßen normalerweise ist es ja so gedacht dass man einen controller hat dieser controllerbekommt hier parameter eine id und ein alter oder was auch immer und im hintergrund kümmert sich dasweb framework schon soweit es geht darum dass es aus der url die parameter passt dass es auseinem jason body die sachen ausliest also das versucht eigentlich schon relativ viel für dichzu machen deswegen sagen wir jetzt einfach wir machen das gar nicht sondern wir lesen den bodyeinfach so ein und das geht folgendermaßen das habe ich im vorfeld rausgesucht leute ich habeich habe gecheatet die das know he lacks critical information das habe ich im vorfeld rausgesuchtweil ich wusste genau dass ich das brauche dass ich das brauche zwar das geht folgendermaßenweil und also also so kann man die sache auslesen request body body read async und das machtfolgendes das liest so viele bites allen wie es einlesen kann oder maximal so viele wie inden buffer passen und gibt als zahl zurück wie viele bites es eingelesen hat also sprichgebe ich jetzt hier den buffer an und das packe ich in eine schleife rein also sagen wir sowashier was der fuck nein nein nein hier ist sofort das packe ich in eine schleife rein wir brauchenauch eine variabler wo wir die länge das aktuellen request reinschreiben und dann sagen wir so waswie muss man glaube ich noch mal klammern länge gleich das da also sprich wie viel ich aktuelleingelesen habe und dann größer so größer null das heißt dem was habe ich jetzt verkehrt gemachtja ich bin dumm habe es eine klammer zu weit also was das jetzt macht ist das liest ein so vielebites aus dem request wie es einlesen kann und merkt sich wie viele bites das waren wenn es mehrals null sind macht er weiter das heißt sobald ich null einlese bedeutet das ich habe alleseingelesen weil es kommt ja nicht mehr und jetzt muss ich noch irgendwie hochzählen also sprichquasi was wie count jetzt vielleicht nicht die besten variablen namen count plus gleichlänge also der liest ein und zählt es hoch und jetzt könnte ich noch sowas sagen wieund keine ahnung und count kleiner upload sei es oder sowas aber scheiß mal drauf lasstmal weg ich lasse mich ich lasse mich zu spammen zumal das eh nicht schlimm ist die maximaleupload sei es von asp dort net core se glaube 30 mb warum die loop weil es nicht garantiert istdass der 20 mb einliest der liest so viel ein wie er für notwendig halten hält also der liest mal512 ein der liest mal 1024 ein mal 4096 wie es ihm danach ist also er kann maximal 20 mb einlesenja aber er wird wahrscheinlich nicht so viel einlesen sondern immer in häppchen allein schon wennman sich überlegt so eine tcp paket passen ja nur irgendwie 1,5 kb oder so ungefähr reinso dann machen wir das dann zählen wir jetzt und jetzt kommt der eigentliche speed test wir braucheneine stopwatch also ne was heißt es auf deutsch stopwatch schalt uhr dings stopp uhr stopp uhrbtf was heißt das auf deutsch alter wortwörtlich übersetzt aber stopp uhr es gibt bestimmt besseretimer klassen dafür aber die ist gar nicht mal so schlecht low IQ ja ich brauche mehr subs leuteseht ihr mal wie weit schon gekommen ist also zu wenig prime subs was das was das eigentlich fürmessen auswirkung hat auf den IQ zustand aber nicht nur von mir beim chat ist es ja auch so ihrmerkt es vielleicht noch nicht aber bei euch ist es auch schon weniger geworden hätte nochdankeschön tritts primes ab huge danke schön für den sub echt moment stopwatch start new gibt so wasmessen alle der chat ist wieder massive brain man sieht es bei manchen ist es die bei manchenist das hier noch da jan wagg dankeschön für den sub prime subscription ist die stopwatchmonotonik ich bin mir nicht mal ganz sicher was monotonik ist ist das glaube ich ist dasist das nicht irgendwie sowas dass die immer im gleichen intervall in eine richtung nur zähltich habe keine ahnung oder ist es oder ist es eine marke und das war ein witzdu hast sechs monat im voraus gesappt ja gut dann hast du auch mindestens sechs monaten nochfeifert auch ohne sowas wie schaltsekunde was weiß ich nee nee das ist ohne schaltsekunde klardas ist ohne so dinger das basiert auf cpu tix unten drunter irgendwo also da ist wahrscheinlichmit schaltsekunden nix so als aber die zeit gemessen und jetzt kann ich jetzt kann ich diezeit jetzt kann ich die zeit mal ausgeben würde ich sagen also von der idee ist es jetzt jafolgendermaßen wir haben jetzt ich habe die zeit gestoppt wie lange es dauert 20 mb einzulessedas ist quasi das hier ist quasi der upload speed test speed test nicht dass er noch problemekriegen das ist der upload ich lade so viel ich ich ich lese so viel ein wie geht returnund jason mit bald count und time in sekunden ich würde sagen wir geben jetzt ja gut doch wirkönnen jason zurückgeben wir können jason zurückgeben wir können jason zurück zurückgebenmit der zeit ja das können wir jetzt an der stelle tatsächlich machen also return new wasgehen wir da zurück einfach jetzt einfach nur mal nur mal zum zum testen upload gleich aberwenn wir müssen erst noch mal ausrechnen wir müssen erst noch mal ausrecht was hat man weiterhier schon wieder gemacht vier spaces was ist da los was der fack zwei spaces bitteschön kommter hier an mit vier spaces ich glaube ich glaube ich glaube es geht los dazu kann ich nur sagenalso das war mal nicht vier facheinrückungen hier spaces größer zwei spaces das ist richtigweil 4 größer 2 aber von der usability her finde ich 2 spaces größer 4 spaces ok alsojetzt können wir hier upload zurückgehen wir müssen das jetzt noch ausrechnen und ichzeige euch jetzt mal eine richtig coole c sharp library oder finde ich zumindest ganz nice wennman nämlich so 3 hat ist wie ich und ich weiß wie man gescheit beides von maybe zu nicht maybeund und sonstige dinge umrechnen gibt es eine ganz coole library die heißt glaube ich githubich glaube beid sei es mein tap ist auf zwei spaces gestellt ja guck zwei spaces tap beidsei es nicht beid sei es beid sei es und da kannst du solche sachen machen wie zum beispielbeid sei es von megabytes oder von maybe beid es und dann kannst du es umwandeln in anderesachen das ist für alle das ist für alle low iq leute wie mich man kann das natürlich ohneprobleme selbst machen aber warum selbst machen wenn es da schon was gibt was wahrscheinlichschlauere leute als man selbst gemacht haben beid sei es ich werde es bloß noch mal checken ifmeine mein count gleich gleich der upload sei es und wenn es wenn es nicht der fall istja machen wir so ich gebe ich gebe das hier nur zurück irgendwie so und ansonsten gehen wirzurück keine ahnung dass wir einen fehler sehen ich bin mir noch nicht ganz sicher was wir damachen also also wenn ich wenn ich genau 20 mb eingelesen habe dann muss ich jetzt meine beidsei es ausrechnen also sprich übrigens wie kann ich den rider einstellen dass der den mist hierweg macht das sieht ja vollkommen beschissen aus muss einfach noch mal zumachen jetzt ist jetztist besser besser zu lesen genau weil jetzt muss ich nämlich noch ausrechnen dass das ganze passtals aber upload beid per second beid sei es wie das beid sei es vom und wir haben jetzt dieganzen sachen ja hier in beid also von beid upload sei es durch und jetzt kommt die eigentlicherechnung des upload speeds stopwatch elapsed ne nicht milliseconds milliseconds brauchen wirnicht das ist wir wollen wir wollen beid pro sekunde haben also elapsed seconds wollen wirhaben milliseconds warte mal ich brauchte es als float seconds ist zu ungenau total seconds doubleperfekt also der rechnet hier dann sowas aus wie 20 mb also 20 millionen 20 millionen durch zumbeispiel 35,5 7 8 9 5 2 3 7 5 5 5 1 9 3 5 sekunden und das sollte dann mein upload speed pro sekundesein das heißt das können wir jetzt noch umrechnen lassen in maybe beid oder in megabyte oder in wasauch immer upload beid per second als mega maybe ok leute ich muss mal kurz nachgucken mega versusmaybe ja als m bits könnten was auch machen da muss ich als bits da muss ich als bits umrechnenja aber wir zeigen es jetzt mal megabyte an das ist jetzt erstmal einfacher ok mega ne alsojetzt jetzt jetzt lassen wir uns erklären jetzt jetzt lassen wir uns das mal erklären alsomaybe maybe ist 1024 das heißt mega ist 1000 alles klar also wollen wir es in maybe beid sammelnstimmt sogar was ich da gemacht habe ok machen wir hier null oder minus eins machen wir hier minuseins wir können wir können einfach einen fehler wir können einfach eine exception werfen undnichts und nichts zurückgeben oder wir machen hier sowas wie error oder so alles klar so wunderbardas müsste jetzt eigentlich passen wir können den kram hier hochladen ich hoffe das funktioniertwas ich hier konstruiert habe müssen wir gleich ausprobieren also wir können den kram hochladenund ich stoppe die zeit und dann rechne ich das ganze aus ok wir testen es mal lokal wirtesten das mal kurz lokal ob das funktioniert was ich mir überlegt habe neu starten wir testauch quatsch nicht auf dem server neu starten bringt ja nichts lokal neu startenso wie mache ich das jetzt mit dem karl karl also karl x post kann ich mit karl irgendwieeinfach random daten hochladen geht das kann man kann man mit dem karl karl upload biteshabe binarie data posting karl ok habe ich noch nie gemacht hat irgendjemand von euchein plan wie das geht data binarie kann ich sagen ich kann nicht sagen data binarie vondef 0 20 mb oder so ne das geht wahrscheinlich nicht das ja aber dann dann will er dann dannleder mehr hoch dann leder nicht 20 mb hoch ich mache mal hier noch eine console ausgabeupload ich gebe das hier noch mal aus und auf sehr von ich könnte eine datei anlegenja aber würde das so funktionieren ich probiere ich probiere das mal aus also lokal host 50005000 speed jam ja wenn man das jetzt so richtig schreibt lokal host hey hey leute da kommtda kommt schon mal ok interessant da gebe ich hier mal aus wie viel ab wie vieler wievieler hoch eingeladen hat hochgeladen hat count ok aber das ist schon mal interessantzu wissen dass das überhaupt funktioniert 9 9 was 9 byte warum ausgerechnet sind das9 characters kann das sein 1 2 3 4 5 6 7 8 9 8 er nimmt das literally nimmt er das alsomuss ich das von von der datei oder dasdas funktioniert ja ich muss eine datei anlegen also wie war das dds hat doch irgendjemandden chat grad geschrieben genau das genau das genau das brauchen wir wobei mir nullenreichen ehrlich gesagt vom def 0 out output dat 1 mb und das ganze 20 dann haben wir genau20 20000 bytes hoffentlich versteht er unter m das gleiche wie asb.net dann aus ne ne machter nicht guck mal mal also wie geht das jetzt add output data einmal guck mal hier ok jetztmuss ich eben genau jetzt muss ich ok ich will nicht 20 m ich will 20 maybe geht das hackweight wisst ihr was wir machen es ganz anders easy 1 zu viel 1 2 3 4 5 so das braucht wahrscheinlichjetzt zu lang mit 20000 wie mache ich wie mache ich denn jetzt genau 20 millionen kannman mir machen das hatten wir doch schon das sind das ist das ist das das ist das old dasold school mb muss man machen mb alles klar ok perfekt mal gucken ob unser karl funktioniertbeim guck mal hier wir haben abgeloaded mit 1340 mb die sekunde näher das kann ja schonsein ich meine ich lade ja über mein loopback interface hoch das ist ja quasi vom ram inden ram wenn man so will was ich hier upload also ich lade mit mit schwankend hoch zwischenja 730 moment was was pro sekunde 730 mb pro sekunde ich meine das geht vom ram in denram das ist kein wunder dass das schnell ist ne das läuft nicht über den netzwerk schnittstelleich lasse es mal über den netzwerk schnittstelle laufen kann man nämlich ausprobieren ich lassees mal über den netzwerk schnittstelle laufen ja ach nee moment habe ich habe ich habe ichhabe ich hier einen karl habe ich hier einen karl unter windows ich habe einen karl poggerskeck weight nice aber ich habe kein dd wie kriege ich das jetzt über das wisst ihrwas heute ich deploy das jetzt einfach ins internet und gut ist easy geht status20 mb limit push einfach nein ich mach das jetzt einfach auf den server drauf und probieres da aus easy ups speedchamp backend pull jawoll und jetztdas netrun ok probier was mal aus ip haben wir die hier vm vm is for my workstation okmein karl probier was mal aus speedchamp moment ok wait a minute wo habe ich meinen karl daah ich bin ja dumm moment ich bin ja dumm es ist nicht port 5000 es ist es ist httpsund dann auch nicht das sondern ich bin ja richtig bescheuert meine güte speedchamp.orges ist langsam der upload der upload ist fucking langsam es geht aber es ist fucking langsam4mb die sekunde na gut 4mb die sekunde das kann doch sein ich habe 40mb upload das kanndoch sogar sein das ist gar nicht schlecht ich sag dem neul mal bescheid wegen streamnebenbei ja funktioniert ja wieder erwarten funktioniert es tatsächlich erstaunlichgut du kannst ja kannst ja mal bei mir grad in stream gucken jetzt warte hab ich ja ichmach grad mit köln den upload test ne ich hab mir eine datei erstellt die 20mb großund ladet jetzt einfach mal hoch ok und du kriegst als antwort jetzt dass das 20mb mitvier maybe maybe beid wohlgemerkt die sekunde hochgeladen wird das kommt ich hab 40mb uploadich brauch 45mb zum stream das ist gar nicht mal so verkehrt ok ich bin ich bin überraschtdass es tatsächlich so gut hinkommt ja also chat wenn ihr wollt könnt ihr es auch malausprobieren mach ich auch magst du mir die datei mal schicken das sind 20mb große dateimit nullen du kannst wenn du hast du nen nee das ist du bist unter windows ne ja ich kannes eigentlich hab ich hab die git bash also wenn du mir den command schicken kannst mitder ich die generieren kann achso dd hier moment dd da weiß halt nicht ob das untergit bash funktioniert aber kann man mal ausprobieren moment kommt im discord da legtes eine output output dat an die ist genau und die muss auch genau 20 milionen byte seinweil das check da dass man nicht cheaten kann sonst ich schicke dir ich schicke dir auchgleich mal das köln mit ja ok wunderbar könnt ihr mir ausprobieren chat wer bei euch schonausprobiert hat schickt mal den befehl in chat ok also ich post mal in chat was manmachen muss hier ist der köln befehl leute und hier ist das dd könnte ja mal ausprobierennehmen lieber random daten ja kann man auch machen das hast schon recht aber ob wir jetztnullen hochladen oder random daten macht doch erstmal keinen unterschied so achso ich wolltedir auch noch schicken genau hier dd hier kannst du auch einfach nur in den chat ichhab den ja offen ich hab es bei mir in chat gepost gerade da sind übrigens zwei kommandosich hab die ein bisschen doof hintereinander gepostet also das erste ist das dd das gehtund das zweite ist das köln mit dem dd links links links in die 20 mb daten mit dem kölnjetzt so hoch ja das ich sehe hier den speedtest von den leuten in meiner konsole kommt inder ganze upload test der download test sollte dann natürlich deutlich schneller sein dasheißt spätestens dann wissen wir auch ob der kram funktioniert oder nicht komm malhier das erste erste erste exception am start wer war's wer war's wahrscheinlich ah expectedund als entweder hat er abgebrauchen hat zu viel hochgeladen also das limit ist standardmäßigbei sp dot net core 30 mb was so was ein request groß sein darf sonst bricht er ab oder hates einer geschafft die ganze sache zu cheaten guck mal oder hat wirklich eine sehr sehrsehr schnelle leitung stark aber der rest scheint ja halbwegs zu funktionieren oderder rest scheint wirklich zu funktionieren so leute warum habt ihr alle so schnellenupload jetzt wird mich ja auch der graf interessieren von hetznernetzwerk netzwerk net working hier den hatten die früher unter netten netten bin ich jetztbin ich jetzt blöd wo haben die denn den netzwerk grafen ganz mal unter grafen gibt'sauch oben wieder blind wieder guck mal hier da ist den habe ich gesucht ok da geht dochein bisschen was die leute sind aber ausprobieren genau die laden direkt von hetzner ja hastdu du kannst an den du kannst dich jetzt wahrscheinlich nicht einloggen was man von hetzner klautso einfach zu hetzner klaut so aber probieren kann ach die leute machen es schon von hetznervm zu hetzner vm deswegen sind die so schnell weil ich wollte gerade sagen alter die leutehier mit 300 mb in der sekunde was haben die für den upload der chat wieder das ist klardas ist halt der vor und nachteil von technisch fähigen zuschauen vor und nachteil zugleichdas stimmt das stimmt du hast kläffere leute im chat aber du hast auch welche sind haltdie sind also besonders clever oh habt das abgelehnt hier wird schon wieder gespammtja aber bei mir bei mir ist halt ganz klar die 40 mbits zu erkennen wenn es ich gehenoch mal rein ich probiere es jetzt noch mal aus ja also das funktioniert prinzipiellwir müssen halt mal gucken wie zuverlässig das ist mit schnelleren verbindungen das könnenwir dann mal ausprobieren spätestens wenn es vom hetzner server zum hetzner servergeht dann dann sollte es sollte es eigentlich funktionieren ich meine er hat ja eine rechtgenaue auflösung der macht es ja auf also die stopp geht ja auf cpu tic basis also auchwenn wenn ich total seconds nehme in wirklichkeit hat er ja noch irgendwie keine ahnung zwanzignachkommastellen genau ich kann oder so dabei oder was ist ein double was hatten das ichhabe keine ahnung aus dem kopf 14 stellen nicht sagen wer hat ahnung ja ok da aberalso ich bin ich bin schon mal ich bin schon mal zufrieden der upload test funktioniertja auf jeden fall ich bereite jetzt noch mal kurz vor dann pushe ich gleich noch mal wasdann kann man gucken ob es auch auch ob es auch so funktioniert perfekt was soll ichirgendwie noch was spezielles einbauen oder hast du hast du bei deinem check testet ergenau ob der 20 ja er testet aber genau 20 mb mb hat also das können wir später ändernes ist kein ich war gerade fragen sicher ja ok ja nee bei mir hat es ok guck mal guckmal kurz in visual studio code vielleicht habe ich auch logikfehler drin kann ja seindass bei mir gerade viel aber guck mal in den controller ja du guckst du kannst dasnur und dann kann ablassen ja also ich habe es auch ich habe es auch vorhin probiert wennda was anderes hochlädt dann geht es selbst wenn es mehr ist wenn übrigens der wenn wennes nicht geht kriegst du minus eins zurück mir ist nichts besseres eingefallen also ichwürde sagen wir machen es später so wenn das nicht funktioniert der bricht dann einfachab und du kriegst gar nichts zurück der macht einfach der macht einfach die verbindung dannmit einer fehler fehler fehler zu hat er keinen sinn ok ok alles klar warte dann push ichdas grad mal und dann kannst du das mal deployen weil dann sieht man was so geht push nicejetzt muss mir noch ein github issue raussuchen den ich wieder fixe wie viele github issueshaben wir eigentlich mittlerweile schon offen hier auch du hast geschlossen hier ich habeeinen habe ich schon zugemacht ich will die zuschauer jetzt natürlich auch bloß nochweitere hinzuzufügen speedchamp korn gibt's dann komm es gibt jetzt es gibt jetzt kryptowährungdie auf festplatten speicher geht kryptowährung die auf cpu leistung geht cp auf gpu leistunggeht noch kryptowährung die auf netzwerk wlan abdeckung geht dann kann man doch eigentlichauch mal internet speedtest währung irgendwie machen es braucht einfach nur coinchamp coinchampdas ist die ultimate das ist dann quasi die koin aller koin so ok ich habe gepusht okkryptowährung auf bandbreite gibt es schon warum wundert mich das nicht so also ich sollpullen du sollst pullen ja ok auf dem server bei mir lokal ist ne warte stopp stopp ichhabe vergessen das frontend überhaupt zu bauen das wäre vielleicht noch smart einenmoment gehen wir noch kurz ja dann kann ich dann kann ich den leuten gleich zeigen genaudanach können wir das mit dem download ausprobieren und dann haben wir was was zumindest so derspur einer funktion enthält die auch so aussieht auf den ersten blick als würde funktionierenja wir werden locker locker 40 minuten schneller gewesen wenn mein internet zeug hiermit gemachthätte es wäre ja auch langweilig wenn es einfach funktioniert ja bauder von hat sichgemeldet also die können jederzeit umschalten der nächsten issue schließen das geht immerlaufen im band chat frag gerade wer du bist jemand mit dem ich auf youtube schon mal voreiner woche oder so ein video hochgeladen habe wo wir uns über jobs it aktuelle it jobsund arbeitgeber unterhalten haben und ja weiß ich so willst du noch irgendwas sagen werdu bist ich bin ich bin ich bin informatikstudent auch youtuber da bisher mit youtube immer soeine on off beziehung gehabt aber jetzt wieder aktiv und ja und heute wird agil programmiertdann werde ich erstmal dann in der nächsten vorlesung von berichten direkt direkt denlebenslauf die buchen mich dann direkt schon für workshops ok ich habe jetzt noch mal gepusht okgibt es remote update ich mache jetzt direkt auf dem server dass man reloaden kann ok danngucken wir uns das jetzt mal an speed jam.org pages not working 502 warum das liegt an mir das liegtan mir gehe ich mal von aus ich bin dumm ich habe es nicht gestartet das ist manchmal da sieht manmal wieder so sehr so sehr ich mich immer irgendwie agil und solche sachen lustig macht das hatschon seine vorteile alles wenn man so einen automatischen workflow hat ne pushe und automatischdeploy das ist halt wirklich so da muss man nicht die leute spammen wieder was das zeug kennt. Guck dir das males wäre wirklich interessant zu wissen welche da wirklich tatsächlich über die website reinkommenja vielleicht wäre es jetzt sinnvoll zu sagen von welchem origin das kommt ja das wäre vielleichtnicht verkehrt aber aber da ist es ok sollte ich mal klicken versuchst mal meine güte hier das istja magic alda ja 4,7 das kommt ungefähr hin so ungefähr in dem dreh würde ich sagen gefühlthat es bei mir auch gedauert ja nice jetzt gucke ich gerade mein netzwerk was er sagt antwort ichgucke mir einfach mal die response an dann sehe ich ja was was das back end meint was es ist jastimmt das habe ich ja noch nicht implementiert basically. Also musst du mal starten. Was fail to load response warum?klick mal auf response drauf bis ihr auf preview ach ich bin ne aber der mag nicht warum nicht washat er für was hat er für schmerz der sollte zumindest minus eins oder so zurück zurück kriegenne bei mir schickt er tatsächlich auch keine antwortschau mal im log ich würde ja gerne im log gucken aber das log wird von euch gerade so vollgespammt da sehe ich nix du kannst ja mal nen console console log oder irgendwie so was machenauf die auf die response ich glaube ich glaube es liegt am back end also also wenn wenn googlenichts anzeigt google chrome nichts anzeigt da wird wahrscheinlich nichts da sein ist aber komischweil sagen wir so das karl moment warum geht es jetzt nicht also wenn es mit karl geht warum gehtdas mit chrome nicht ja also es passt ziemlich gut bei mir sind es ein bisschen upload wenigerdas hängt wahrscheinlich einfach damit zusammen dass alle gerade auf diesen server ein passenwahrscheinlich wahrscheinlich ich würde es halt ich würde es halt echt gerne gucken was der antwortso der vergleich halt ne der vergleich von dem was was du hier quasi on the fly ausrechnest und wasdas back end misst es bringt jetzt aber auch nix wenn ich sage leute hört mal auf zu spammenweil das machen sie nicht das das hat jetzt höchstens eine firewall einstellen schnellund da muss man eine ip ne ne ne ne das da sieht man meine ip das das geht nicht aber wenn du dasbei hetzen da ist halt den tab nicht mehr öffnen ja super ja verstehe jetzt nicht also warum kriegter ich meine der der hat ja hat hat hat er einen fehler vielleicht wenn man das über die hast duja okay nie du machst er return u upload ich mache einfach mit karl mit karl geht's jamit karl krieg ich krieg ich krieg ich zurück ich guck mal kurz ins studio code rein uploadermuss man gucken warum naja dann kann es ja wahrscheinlich doch am frontend liegenzeige mal wo ist denn dein wo ist denn das drinne wo muss ich gucken sauce ne sauce ja sauce jsach hier exe aus post ah okja calculate speed oh yes hier ist wirklich big brain time ich sehe es gerade wo eson the fly berechnet wird so aber so genau habe ich verstehe ich jetzt auch nicht wasder für schmerzen hat mach einfach rate limit mich wundert warum der das im browser nichtanzeigt ja das ist das ist irgendwie wird irgendwie klappt der request irgendwie wirdder request nicht fertig musste bei dir vielleicht hat bei mir mit dem chat geschrieben contenttype noch setzen dass du sagst content type zurück application jason gute frage ne aberder wird gesetzt ich wollte gerade sagen ich glaube das macht er ich habe das kapiertalso seit wir das das klappt und sehr merkwürdig kannst du mal eben im frontend ich habe jetztan der stelle nicht so wirklich den den durchblick aber du bist ja unten hast du irgendwie die dieresults kannst du da irgendwie mal einen console lock oder sowas machen auf die ja ich machejetzt mal genau ich starr das mal bei mir schickst du auch genau 20 mb ja aber selbst wenn dumüsste zumindest minus eins zurückkommen also es müsste auf jeden fall was zurückkommenja du kannst ja mal ein lock machen also ich bekomme ich bekomme meinen rate zurück den ich dir schicke jetztist die frage wahrscheinlich vielleicht schicke ich dir das falsch das kann sein also ich schickedir definitiv keine recht richtig richtig ich schicke dir als request body einfach den buffervon diesem intervall aber wo ist hier und ab wo schickst du es hier genau buffer from data hiergenau ist vielleicht vielleicht weil jetzt krieg ich nicht deine ich krieg nicht deine jason responsekrieg ich nicht zurück tromm rafft nicht firefox schon ach im firefox gehts magst du das mal ichhabe firefox ich probiere ich probiere das gerade mal aus das wäre jetzt aber merkwürdigund da sieht man auch gleich mit dark theme ich mache mal den dark wieder aus so ok networkbei mir gehts kaum und firefox gleich gut das hat die frage jaja kannst du jetzt einmal gucken ober da auch eine ich bin ich bin gerade am gucken hier request der firefox hängt bei mir mega wasdenn da los request ach nee der request ist einfach nur diesen groß ne ich krieg auch dasrate zurück lull aber 4096 nur nur 4006 90 bytes nein nein das sind nee das ist schon aberdarstellung anders ok keine ahnung aber in der response steht es drin ich bin ja auch dumm ichhabe im request geguckt und response passt also in ja du hast in mit ich habs in meinmeiner response ist mehr wie bald aber ich kann das umrechnen ich kann es auch in ambit machen okja ambit werde ich mal aber das kommt das kommt glaube ich ungefähr hin guck mal mit2 mb weit mal gucken ob google das kann das kommt ungefähr hin also google meint 32,358moment hier megabit sind 3,8 mb weit und das backend ist der meinung es sind 4,1 mb weitdas kommt recht gut hin würde ich sagen also 0,3 mbit da schwankungen dazwischen kann ichmir schon vorstellen wo ist das vertritt wo ist das verpflichtende impressum wollen es wiederwissen wir verfolgen keinerlei gewinn absichten damit das privat telemedien gesetzt geht nichtjetzt jetzt geht es bei mir lokal ich habe bei mir die ich habe die request header geändert ichhabe es den content type auf so ein octet stream gesetzt irgendwo auf google stand dass dasvielleicht so geht so da kannst du noch mal pushen und ich ich push das jetzt auch einfach mal mitdem console log response genau da können wir kommen ja das liegt anscheinend echt an irgendwiedas firefox standardmäßig davon ausgeht wenn da viel weit geschwurbel reinkommt und chrome sagtwenn der heiter nicht gesetzt ist dann juckt mich das net ich mache hier auf dem server malwird immer noch gespammt als fang er kann er nicht mal beenden weil das so viel noch imbuffer drin hat ok remote update und pull run mir fällt übrigens eigentlich sollte es vielleichtnicht im debug run auf dem server sondern release mode anmachen also ein bisschen schneller alsoreloads sagt reload gucken wir mal gucken wir uns das mal an ich probiere es mal im raum abersehr schön dynamisch wie das und fleißig in welchem zeitintervall guckst du so oder machstdu einfach über den kompletten zeitintervall drüber und das ist ich kriege immer event undimmer wenn das event vom browser aus geschossen wird update ich das guckst du quasi an zwischenletztem oder zählst du einfach insgesamt auch hoch durch zeit oder insgesamt durch zeit jabei mir gibt es im chrome immer noch nicht aber ich gucke mal in die konz in die konsole ein cashvielleicht noch kurz das ja manchmal ich mache mal cash das ist abel cash so ist abel cash kannauch sein dass das ist viel aber nichts doch nicht korrekt gepusht haben oder so du hastirgendein sonderzeichen im tailwind css drin guck mal das ist irgendwie ja tailwind css addozent 5e stark verstehe ich nicht aber es funktioniert trotzdemja das so ein häuschen und ich kriege irgendwie auch nix in der konsole das guck mal stehe ichnicht ja der chat aber ausprobiert hier es hat eine ausprobiert speedtest 10 10 m bit undspeedchamp 9,56 m bit also scheint doch ungefähr zu stimmen was wir da machen ja also bei mir beimir lokal wenn ich starte bekomme ich jetzt ein response zurück jetzt wundert mich halt nurwarum es da noch nicht gebaut ist so ich probiere es mal bei mir lokal gerade mal aus weiß auchnicht warum das bei sonst kannst mal gucken ob die code änderung war ich kurz im github kann seindass ich auch so sehen also ich habe ich habe in der konsole in der konsole kommt nixhast du es auch neu gepullt ja ich habe ich habe remote abdeck ich guck mal was was dugeändert hast im letzten commit genau schau mal also ich habe ich habe remote abdeck gemachtgepullt also passt alles geht lock minus 1 minus p ja du hast text octet stream hinzugeschriebenhinzugeschrieben und konsole lock response was auch immer ok warte ich baue es jetzt noch malund push es noch mal kann sein dass er einfach nicht korrekt übernommen hat stimmt stimmt stimmtstimmt es war es wurde kein ww root wurde nicht geupdatet richtig genau ja der chat sagt espassieren komische dinge wenn man schnell den upload button spamt aber wahrscheinlich die aktivierst du es nicht dasses ein zweites mal uploadet wenn man klickt oder ja genau genau das kann man noch machenaber aber aber die reports im chat passen gut speed test neun fünf neun fünfzig mbit speedgem 57 mbit also wunderbar also leute es kann sein dass es bei manchen von euch riesigeunterschiede gibt dann liegt es wahrscheinlich daran dass die verbindung zu dem einen oder zudem anderen eben unterschiedlich gut ist ich habe nicht auf release gebaut aber das solltetjetzt nicht den riesen unterschied machen kann er aber gleich machen sag wenn ich wenn ich guckenkann erst ich push es gerade ich habe ein update er war euch ein error ist noch nix da ja es gehtnicht so schlecht oder ich habe die falschen oder gelöscht wir haben zum klug alles eingechecktin das netrun minus c release oder so ob dann dann lässt das in optimis laufensie diskutieren kratzer im chat drüber wie man den service am besten zu spamtdas nächste mal machen wir folgendermaßen wobei weißt du was wir machen könnten ichkönnte basic aus davor machen mit meinem proxy die und nur wir haben das password wir sperreneuch aus chat aber noch hält der server ja aus es ist geil ich versuche das zu beendenund es braucht zehn sekunden bis alles weg ist genau so ist das test bei mir sagte everythingup to date also ich habe es gebaut und an sich kommt es auch im richtigen verzeichnis rausich habe was vergessen von 16 59 ich nenne den kommet dumm jetzt ok jetzt gucke ich mal insletzte log ja minifight ist javascript sieht immer so toll aus ja es wunderbar ok alsodann dort netrun release und gucken wir noch mal startet da ist es und jetzt kriege ichauch was in der konsole data upload ja jetzt funktioniert ist gar nicht übel hier sagtder upload 30,68 bei mir sind bei mir sind das 3,7 maybe maybe bald muss noch mal kurzumrechnen lassen im bittum sind 3,6 hey das ist ziemlich gut du hast gemessen 3,65 unddas becken ist dann 3,79 also da kannst du dich nicht beschweren das ist ziemlich nahebeieinander das stark das stark dann kannst du ja noch das dann in dem in dem responseals mbit ja geben und dann setzt sich quasi einfach wenn die response da ist überschreibeich die werte einfach wieder genau genau gut das ist ja das ist ja aktuell nur nur uploadtest wir müssen uns überlegen wie wir das machen mit dem mit dem response wollen wireinfach zwei zwei sachen die du aufrufst machen ein upload test und ein download test oderja das heißt im endeffekt genau wenn der upload fertig ist oder man fängt mit demdownload an download ich mir einfach einen array buffer von dir ja warum lasst ihr überhauptden client das ist eine gute frage warum lasst ihr überhaupt den client messen server solltedoch ausreichen naja dass man mal was sieht während man den knopf drückt was das istder einzige grund zählen wird das was auch im server gemessen wird aber es ist natürlichschon cool das muss ja zugeben leute wenn man hier auf den knopf drückt und es passiertdirekt was ne exactly so ein bisschen user experience genau sehr schönwunderbar dann also wir können es auf zwei zwei arten könnten was können was machenentweder wir machen ich gehe mal kurz ich bin mal kurz im code studio code also wirkönnten noch einen zweiten zweiten hier test machen für mit quasi dann keine ahnung damuss ich das ding aber um benennen weil ich habe spät spät schämt da müssen wirslash spät schämpf ab und slash spät schämpf down machen oder du hast einfach slashab slash down oder so oder oder wir machen einfach so wir lassen den spät schämpfweg und machen nur ab und down genau genau so oder wir könnten das alles hier in einem machenweil ich kann dir also dann können wir aber halt kein response hier hier drinnen machenalso ich könnte die jetzt quasi wenn man spät wenn du slash spät schämpf aufrufstals erstes kannst du was hochladen und als zweites würde ich dir dann einfach 20 mbwieder zurückschicken dann müsstest du aber halt anderweitig den die results abfragener ist halt dann dann die frage war im endeffekt muss der server ja trotzdem noch irgendwieberechnen wie es ist weil sonst wäre es ja wieder der client der dafür zuständig wäresind sie theoretisch theoretisch was wir was du machen könntest ist du du zählst einfachab wie lange der upload dauert und die uploadzeit können wir dann von dem von der gesamte zeit desrequests abziehen ich kann das wobei ich kann den download ja auch stoppen also mal angenommen ichwürde dir jetzt direkt nachdem der upload durch ist direkt nachdem der upload durch ist schickeich dir einfach 20 mb zurück und das kann ich ja auch stoppen wie lange es dauert bis es bei dirankommt das können wir einfach mal ausprobieren das einzige dumme ist nur dann kann ich dir indiesem request keine results zurückschicken weil naja weil du kriegst ja schon per download wasalso das funktioniert da nicht da müssen wir genau dass das meinte ich halt weil die dadurch keineresults bekommen genau die dann machen wir dann machen wir ab und da und zum testen ja ja ja undalso wir können ja dann wie gesagt wir haben brauchen heute eh wenn er nicht komplett fertigbin ich mir ziemlich sicher wenn ich mir das mensch auf die uhr guck 18 uhr das können wirdann irgendwann das nächste mal überlegen ob wir es nicht so machen dass wenn man die dass man dieergebnisse speichern kann also sprich dass du dir irgendwie so einen token abrufst am anfang dassdu quasi so eine id pro messung kriegst und der server dann passend zu dieser id sich die werteirgendwie speichert genau ich glaube das können wir so machen dann gucken da machen wir das soalso machen wir slash down und slash ab nur dass ich halt den kram dir schicke du kannst ja malgucken dass du das dem axios irgendwie beibringen kannst dass das dann auch noch dann auch nochabruft jetzt ich guck da mal gut dann sagst du einfach wenn es fertig ist ich sag dir bescheidfrage wie lange willst du heute machen wahrscheinlich nicht mehr so lange ich auch nicht also ich würdejetzt wir machen die download funktionieren würde ich auch sagen ich habe dann übels hunger jetztschon das machen wir machen den download fertig da sieht man nämlich dass es prinzipiell funktioniertund über die über die genaue architektur und wie man dann vielleicht einzelne sachen speichernund so können wir uns nächstes mal überlegen genau genau das machen wir heute ich hoffe euchgefällt es bis jetzt leider ein bisschen technische probleme technische problemezwischendurch aber wir geben alles ja ich hoffe auch bei dir drüben im stream ich habe den chatgar nicht mehr auf aber ich hoffe euch gefällt alles alles glaube ich richtig richtig poggerssagt der chat das freut mich huge pock alles klar ich sag dir bescheid kann er schon maldein chat kann sich ja schon überlegen welches emote wie er noch mal welche sich doch dareinklatschen soll genau das war das noch nicer ist könnt ihr euch ja mal überlegen was wirmachen wollen irgendwie keks emotes was auch immer ein meme bildchen könnt euch könnteuch überlegen was wir wollen ich mein ich habe aber ich habe vielleicht noch mit einem link zueinem high end auflösenden bild oder so das wäre super das wäre natürlich noch besser ja daskann man gucken das ist nicht so aktuell hast du einfach nur knop und 3 3 zeilen mit ja zahlendrin ist ja das mal da lockst du kein irgendwie mehr hinter irgendwo hervor mit mit der optikperfekt also machen was lächelt dauernd da werde ich das jetzt mal kurz basteln allesklar ich sage dir gleich bescheid denke mal so zehn minuten oder so ok alles klar bis gleichdiscord hat mein hotkey gelöscht jetzt ok geht wieder ich mache jetzt aus ok leutedann werden wir das mal programmieren wir sind ja super agil wir können so was on the fly ändernaber ich kann das relativ einfach in mbit umrechnen ich sag nämlich hier einfach uploadbytes per second in bits und jetzt habe ich bits pro sekunde und jetzt muss ich das ganzeeinfach nur mal 1000 mal 1000 rechnen habe ich mbit oder stimmt das stimmt das hat esgemp müsste eigentlich so stimmen dann war mal jetzt hier war upload mbits so dann habenich auch die mbits ob's bits 1000 mal 1000 ok alles ich mein könnt ihr natürlich dannauch eine million schreiben aber so finde ich es lesbar ok upload mbits per second uploadmbits per second minus eins da müssen wir uns so für die fehler wir geben keine antwortwir sagen hier throw new new exception hack wait so perfekt beste exception ok dann machenwir das ganze jetzt mal verdauert also sprich das ist der upload test und das hier wirdder download test down dann nenne ich das einfach mal so down und das ist ab ja jetzt ich konnteleider den chat grad nicht so lesen jetzt sagt mal ich wollte soll mir öfter so wasmachen ich meine jetzt nicht jeden tag ist klar ist auch viel zu anstrengend und wirddann wahrscheinlich auch langweilig mit der zeit aber so ab und zu mal so einmal in allezwei wochen oder einmal in der woche oder irgendwie sowas toll nice ist mega cool chatsoll ich euch mal ehrlich ehrlich sagen das freut mich ihr wisst ich bin ich kann dasimmer schlecht so expressen ja aber das freut mich ehrlich wirklich dass euch das gefälltwhite people happy ist nicht agil genug was müsste man renee was müsste man machen fürmehr agilness daily stand up ja ist super heute nice wir können ja auch mal die nächstenstreams über so eine kleine projektliste machen immer wenn uns was einfällt was manhier so machen könnte weil wichtig ist dass wir das darf nicht zu groß sein ihr seht dochwir haben ein easy as fuck projekt hier eigentlich und wir machen da ewig dran rum ok also wirbrauchen jetzt erstmal den controller für download und wir brauchen übrigens noch dencontroller für ping fällt mir gerade ein ping einfach zweimal aufrufen oder so keineandere fällt mir noch nichts so nichts großartiges zu ein community projekt ja da muss ich malgucken also download wie kann man die download wie kann man den download messen ich würdesagen wir machen das exakt genauso wie bei dem anderen wir nehmen ich einfach eine downloadsize download size 20 megabytes download size und jetzt verschicken wir das einfach ichglaube das ist sogar noch einfacher weil ich glaube das ist noch noch also das ist jetztglaube ich richtig easy as fuck das download ding zu zu basteln wir brauchen einen bufferder so groß ist wie die upload size und nicht wie die download size und jetzt und jetztkönnen wir einfach sagen hier a weight response body right und jetzt schreiben wir einfachden kompletten buffer rein fertig mehr müssen wir nicht machen dann brauchen wir noch stopwatchgucken wie lange das dauert bis er das ganze versendet hat stopp und dann machen wir genaudas gleiche wie hier manchmal schön copy pasten also im moment count den account kann eswach sind was mache ich hier das ist blödsinnig das ist blödsinnig aber kann man so cheatenkann man so cheaten beim download wirklich mal gucken also upload size download downloadich hoffe ich verschreibe mich in irgendwo das sind m bits download size geteilt durchzeit vergangen was programmiert ihr einen speed test einen speed test du kannst dirden übrigens schon angucken gerade geh mal auf speedchamp.org so die allererste basicvariante funktioniert sogar schon guck kannst hier drauf klicken und dann zeigt er dir andass du upload hast wird übrigens schon voll gespammt hier also hier uploads m bits persecond und das ist dann download m bits per second fast so vielleicht machen wir hiereine ordentliche beschreibung download speed m bits per second und dann machen wir hierdaraus upload speed dass man aber ordentliche ordentliche anzeige hat upload speed ok wunderbarsollte nun eigentlich funktionieren testen wir mal lokal testen wir mal lokal ob das obdas klappt 20 mb alles klar probieren wir mal aus erstmal den hier pullen und run sound jetzt haben wir curl ach so moment ich brauch gar keinen post das könnte man sogarals das könnte man eigentlich sogar als als get machen wozu den post für den downloadne egal kann man so lassen die seite ist scheiß das funktioniert noch gar nichts ja würdeich sagen wie heißt so schön geduld ich kann mir so sprüche nicht merken also probierenwir das ganze jetzt mal hier lokal aus lokal host lokal host post und jetzt down ob gehtdas jetzt einfach so moment ich muss jetzt was upload ich muss jetzt was upload um waszu downloaden moment das ergibt keinen sinn warum muss ich was uploaden um was down zuloan wait down ach so ich machs ja auch falsch ich brauche auch lokal host lokal host 5.000das hat er für schmerzen warum kackt ab was was möchte mir dort net damit jetzt sagenvielleicht soll ich dann get raus machen dass ich machte man get raus aber er hat schonda noch what the fuck moment moment ich muss mal kurz gucken ob der upload noch funktioniertob ich jetzt aber ich jetzt irgendwie kaputt gemacht habe ab ich mache mal bei jetzt ichmuss durch bei jetzt machen nicht durch und nicht mal etwas stimmte doch nicht bisschenverkehr drum ja das sieht besser aus wenn es ist lokal aus das geht vom ram ins ramaber das ist schon das ist schon das sieht schon realistischer aus warum benutzt du dafürnicht beid sei es weil es das lustigerweise nicht kann guck mal upload per second bitskannst du wirklich bits es kann das es heißt ja auch beid sei es und ich bitt sei es hatman bitt sei es gibt es nicht das ist aber ehrlich gesagt bisschen dumm dass man dasmoment moment was ist beid in tb beid bitts in bitt simple das kann er kann er nicht aberdas das sieht jetzt realistischer aus so wir machen da jetzt ein get raus hatte tp getmehr brauchen wir das eigentlich warum kackt es ab download speed warum kackt es ab responsehas already started was genau möchtet ihr uns mitteilen wo ist wo wo wo wo ist das problemmache ich jetzt irgendwie was body right es so ein buffer klingt klingt eigentlich ersteinmal sinnvoll was ich da mache ich hab keine ahnung warum der abkackt ehrlich gesagt nuller versucht zweimal den gleichen response zu schreiben du kannst unten nicht returnach stimmt ja natürlich geht das nicht natürlich geht das nicht ja klar ich kann hier untenkeine response machen weil die response da oben ist ja schon das muss ich dem nur einmalerzählen dass die logik nicht funktioniert das funktioniert nicht so wie wir uns dasgedacht haben weil du kannst du kannst ja mal kurz kurz bei mir gucken im stream ich habenicht so viel die latrine also folgendermaßen ich habe es jetzt auf die gleiche art versuchtwie im upload ja kannst du sagen wenn du es wenn du editor siehst ich sehe ihn ja jahast ja response body right async und dann schreibe ich dir 20 mb raus ich kann dir abernicht im gleichen request 20 mb bytes rausschreiben und noch eine json response geben weil esgibt ja nur eine response für deinen request also ich kann ja nicht 20 bytes reinschreibenund noch den json response im gleichen request also das das funktioniert nicht also wir müssenes wahrscheinlich so machen dass wir das quasi das starten und du in dem zweiten in dem zweitenrequest dann deine results abrufst im endeffekt klar du kannst es ich sehe es bei den chattheoretisch die embells in den response header packen das könnte funktionieren ich weißnicht ob ich die header darf ich dir das probiere ich jetzt mal aus ob ich die header anpassendarf wenn ich den response schon gestartet habe ich könnte mir vorstellen dass das auchdass das nicht ich also ich weiß nicht wie das bei c sharp ist ich meine bei javas springboot kann es im endeffekt einfachen response objekt zurückgegeben und da die headers anpassenich weiß nicht wie das das geht das kann ich ja auch mal aber ich bin mir nicht sicherob ich in die response was reinschreiben darf nachdem ich vorher schon 20 mb bytes reingeschriebenhabe ich weiß halt nicht wie ich glaube ich glaube nicht dass das dass das funktioniertbei x header x header denken wir denken uns was eigenes aus ich glaube aber nicht dasses funktioniert x header kann speed champ so value moment wie macht man das überhauptstring value testweise machen wir da 2000 rein da das funktioniert nicht probierst mal austop da müssen wir uns was anderes ausdenken nope ah ne moment ich geb hier unten den kramnoch zurück machen wir das weg und also es ist halt wie gesagt die frage wie das da genaugehandelt wird erst header dann body andersrum gehts nicht dachte der chat ja gut aber erstheader geht ja nicht weil erst header da kann ich kann ja nicht was setzen wo ich noch nichtweiß was rauskommt ne funktioniert nicht also der ich darf da nicht reinschreiben sobaldschon begonnen habe ich weiß halt nicht wie das bei c sharp geregelt ist weil du ja ichglaube das also von der idee her kann das ja gar nicht funktionieren dass was der hiermacht ist mit body right das ist ja unter umgehung jeglicher framework logik schreibter in den in den in den htp request stream einfach seine 22 20 m bit rein das heißtsein browser sieht sind 20 m bits und dann würden irgendwelche htp header folgen wasja überhaupt keinen sinn ergibt an sich an sich ja an sich ja im endeffekt dann müssteman als einfach so machen dass du nur den body zurückschickst und ich die zeit stoppeja dann das heißt also das wäre jetzt so die erste lösung die man angehen genau ich schickenur den body zurück und da kannst du ja die zeit schon mal reinschreiben das ist dannnatürlich nicht schiedsicher aber dann machen das das nächste mal so wir machen dann wirklichso eine art mess session auf und du rufst dir dann einfach die ergebnisse mit einemdritten request am ende ab oder drin steht das können wir dann als nächstes machendann haben wir das jetzt so ich gebe ich gebe nur den ich lese einfach nur ich schreibeeinfach nur raus sonst nix das müsste jetzt aber auch funktionieren ja das funktioniertok wenn ich das jetzt mal pushen dann kann man das ausprobieren dann habe ich hungerimplement ich kann nicht mehr schreiben mal das heißt im endeffekt was ich jetzt machebei post ich meine ich mache es nicht zeitgleich du hast jetzt einmal slash up und einmal slashdown ich habe slash up und slash down ja slash up hat sich nix geändert dran ist genausowie vorher und jetzt gibt es halt noch slash down da kriegst du aber nix zurück das sindget requests genau ja da wir kommen da bestimmt auch eine bessere bessere idee der chat sagtauch schon macht über web sockets macht über web rtc nebenbei jaja über machen wir unsüber alles gedanken wenn über web sockets ist keine schlechte idee könnte man könnteman schon auch machen dann ist das so ein bisschen unabhängig davon aber das kannman ausprobieren haben wir haben wir das stimmt das ist ein cooles projekt mehr das ist ansich übersichtlich genug dass man da jetzt nicht komplett ja so den durchblick verliertda kann man auch mal zwei drei wochen nix machen und ja blickt immer noch durch undes ist insofern auch überschaubar dass man im stream mitkommt das eigentlich optimalesstreamprojekt hier das stimmt an sich schon das ist ja im endeffekt egal die durationkurz gucken was forder vorhin geschrieben hat weil ich habe ihnen gesagt sie sollenjetzt bloß nicht mein modem noch mal neu starten oder sowas sind die ab und down fahreschon online moin noch mal ich jetzt kann ich das gleich mal testen der spam hat übrigensnachgelassen das hätte ich nicht sagen soll ich hätte einfach zur kenntnis nehmen sollengut wäre okay ich habe es wieder gestartet müsste jetzt da sein alles mein downloadwerde da noch nicht probieren mal kurz von mir aus aus ob das mit down slash down istes nicht nicht nicht ja ja also der request der request geht durch okay aber aber aberich kriege noch keinen ja genau request funktionieren schau mal hier stack overflowja gut klar das kann man machen wenn ich nicht die eingebaute controller logik benutzesondern was eigenes basteln dann klar kann mich ja keiner daran hindern da reinzuschreibenwas ich will aber ich will es jetzt das nicht total verbiegen würde für das das kriegenwir hin ich glaube uns fällt da schon noch was gutes ein ja ich hoffe mein mbit umrechnenfunktioniert ich probiere gerade noch mal aus upload upload34 passt die cool aus chat mein die upload rechnung ist kaputt bei mir ist alles gut34 mbit das ist ziemlich dementsprechend was ich auch habe schau mal im browser ach istder upload im browser kaputt okay das kann sein guck mal ach so der ist tatsächlich kaputtna gut im browser ist klar dass es nicht funktioniert kann er nicht funktionieren kann er nichtfunktionieren falsche uhr also die freundin von java script aber auf der anderen seitehey ich bin ich bin ich bin immer noch da also ich habe ja früher javascript geflamedimmer ja aber mittlerweile ist das schon ganz nett man kann aber wirklich gut was mit machendas stimmt erstmal github issue aufmachen die leute lasst mal github issues in ruhe wirhaben schon genug auch wir haben welche geschlossen perfekt macht spaß einmal profis zuzuschauennicht sicher ob ob ich habe ich habe meine 20 ich habe meine 20 mb test datei geerdetoder hast du die aus versehen geerdet aber ich weiß nicht ob das warst du das 20 mbdas datei geerdet naja gibts schlimmeres da haben wir halt 20 mb nullen im repo drindas darf ja aber keinem guten repo fehlen sag ich immer so ich push das jetzt mal ichweiß aber nicht ob das so korrekt ist weil bei mir werden sehr unterirdische werte angezeigtprobier mal aus sag sag wenn ich testen soll ich push das jetzt mach ich mach schon malden alten krempel aus wann implementiert ihr blockchain alter der witz hat so einen badmittlerweile du bist da 50 oder so der den gebracht hat ich will ein jira board dannmach legt auf dir dein jira board sorg dafür dass wir hier so es gibt es gibt auch bestimmtirgendwelche agilitätswettbewerbe oder so dann melden wir uns einfach für andermitmit dem projekt ja man ja certified agile professionell oder sowas oh nein ich glaubeich mache jetzt aus versehen merch oder so der fragt dich jetzt du hast gepullt undschon committed so vorher bei dir ne ne ich hab nicht gepullt ich hab es auch schon gepushtaber es passt du kannst falls du es nicht kennst du kannst wenn du wenn du pulst dannsagt er ja wenn du wenn sich lokal was geändert hat und remote geändert hat dann fragt erdich ob du es rein merken willst lokal du kannst sagen gett pull minus minus rebasedann macht er die änderung von remote und dann deins obendrauf ohne merch okay okaydas kenne ich das nicht so hatte ich gerade nicht im kopf wunderbar ich mache den ganzentag irgendwie irgendwelche gett geschichten es ist aber noch nicht da meins ist das letzteimplement download so genau also ich habe jetzt deins ist quasi wieder on top aber meineänderung sollten als auch mit drin sein mit dem ww root okay ist das in dumm drin oderwas ne das also ich habe kommet ich habe kommet von dir ich habe kommet von dir dumm und implementdownload von mir dann letzt moment moment warum ich habe wieder die hälfte vergessen alles klarich habe nur update gemacht und nicht gepullt alles klar hier ist es okay sehr schön danngenau das mal release und gucken wir mal ob das funktioniert gibt schon ein fork ja tut euch keinzwang an leute folgt folgt was das zeug hält okay es läuft wieder ich mache an und jetztmachen wir erst mal speedchamp starten doch die download also was ich noch implement was ichnoch implementieren muss ist dass ich das reside berücksichtige das ist jetzt noch nicht drin aberselbst jetzt ist es halt sehr weit entfernt stimmt nicht beim download so also beim upload stimmtbei mir auch gerade nicht der download nah das also der upload ist vorher gut vorher hat erziemlich gut hingehauen jetzt ist es die hälfte von dem von dem eigentlichen upload und downloadist halt auch komplett komplett verkehrt kann das sein kann das sein dass der zu viel locktoder so viel ist das gar nicht 20 m 20 m bit zum download ist zu gering ja aber der uploadstimmt auch nicht hast du irgendwas am upload jetzt gemacht an dem code hinter dem uploadne oder gar nicht gar nicht äh warum warum haben wir ah der macht gleichzeitig upload und downloadjetzt nein halt stopp eigentlich habe ich da ein await reingehauen ne macht er auch nicht machter auch nicht macht er auch nicht eben macht er nicht dann weiß ich nicht aber je öfter ichdas mache das besser deswegen wird wahrscheinlich schon beim download auf jeden fall an der geringendatei größe liegen wahrscheinlich ja das kann sein das kann sein ich kann es ja nochmal bei mir lokal testen aber warte mal was sagt er denn bei mir wenn ich wenn ich das hier inder kommando zeile mache ich sehe es jetzt natürlich wieder nicht weil gespammt wird es fackdas müssen wir dann mal in ruhe erforschen so nächsten strich absolut absolut macht jetzthier upload ganz schön lang ich glaube ich glaube mal ich glaube das ist bei mirkann wirklich einfach langsamer es gibt keine output dat in dem ordner wo ich binjetzt geht bei mir ist noch da ja ok ich dachte das mal eben mal doch aber warum dauert das jetztso lang wahrscheinlich wahrscheinlich sind alle wie verrückt am spam aber maybe maybe aber wasman sagen kann es funktioniert halbwegs die selber ist selber ist nicht da und aber so wasgekrascht ich glaube das war zu viele leute also nicht anwenden anwendung ist gekraschtschau mal in die hetsner grafen ja moment moment ich guck mal krieg gleich krieg gleich einengleichen anruf aus naja naja nee geht eigentlich geht eigentlich guck mal wir haben hier in outungefähr gleich viel 60 60 mb die sekunden 60 mb die sekunde das ist jetzt ja also gehtja eigentlich so ich habe neu gestartet mal gucken dass irgendwas bringt upload 31 ok jetztblick ich nicht mal durch das jetzt jetzt noch 31 kommt auch in 31 mit jetzt testen wir im frontendes stimmt nicht und vorne nicht es stimmt hinten noch ich komme jetzt auf 30 m bits ich auch imdownload ok ich würde sagen das müssen wir uns dann am nächsten auch mal anschauen dassich dachte ans nächsten stream machen wir so ich mache da einen basic aus davor dass nur wir beidemit dem mit log in drauf kommen weil das sind das sind gut geht er geht er so nicht stopp ichnehme ich den server jetzt da hat sich ausgespammt vielleicht passt das threading im back end nichtnur das macht das kann das kann asp.net eigentlich ganz dort net core eigentlich ganz gut muss danichts machen gut ich mach mal mach mal den server aus hat sich jetzt genug gespammt und ich kannmich auch ich kann mich auch nicht mehr richtig konzentrieren aber wir haben trotzdem ich habenoch mal gefragt wo ich mich gemütet habe heute es fanden alle gut nochmal frage so kann man beiden bei den anderen bei dir auf dem channel an die leute wie hat es euch gefallen ich hoffeeuch ich hoffe euch jetzt auch total ehrlich bleiben werden eigentlich weitere folgen vonIT Security kommen bei mir werden auf jeden fall noch weitere folgen von IT Security kommenmuss mir noch erst mal auseinandersetzen was als nächstes kommt wissen wir schon wann es weitergehtdas doch nicht so nicht so wirklich nee wenn es halt passt wahrscheinlich unter unter derwoche eher nicht weil das geht bei uns ja beiden dann nur nachmittags und wenn du den tag schonüber irgendwelche sachen in der richtung gemacht hast dass da abends jetzt auch nicht unbedingtnoch dreieinhalb stunden programmierkram zu machen vor allem da muss man sich auch hierwirklich ein bisschen konzentrieren und machen und tun deswegen würde ich eher sagen was wasirgendwas in richtung wochenende oder feiertag oder urlaub oder so genau ja wir ja gucken hatmir auf jeden fall wirklich viel spaß gemacht war eine richtig coole geschichte und leutemal guck mal beim neu vorbei ich poste noch mal kurz dein youtube link jetzt könnt ihr allemal vorbei gucken wer es nämlich noch nicht gesehen hat wir haben da anfang des jahres auchmal ein video zusammen gemacht wo es um die physio ausbildung ging und zwar im januar oderso vor drei monaten ja schon im märz märz ist schon ein bisschen hin aber könnt ihr euch malangucken wenn ihr es noch nicht gesehen habt und wir sagen mal schluss oder man ist dass so vieledabei waren auf jeden fall auf jeden fall und gerade mal schnell ob ich den hausen kannaber sehr nice also super geschichte und wir machen auf jeden fall weiter jetzt so wir wissenbloß nicht genau wann wann genau okay dann würde ich sagen ich mach stream aus bis zumnächsten mal macht's gut ja auch ja drei und ich muss noch in den hohen den lost rain point rateklar bin gleich gleich auswas rate dachten alles klar", "segments": [{"id": 1, "start": 0.0, "end": 11.44, "text": "Na wunderbar, ok ich hoffe jetzt gehts wieder, also ich hab Vodafone auch schonmal angeschrieben,"}, {"id": 2, "start": 11.44, "end": 17.08, "text": "also falls wirklich irgendwelche krassen DDoSer Dudes am Start sind, gibts jetzt IP Wechsel,"}, {"id": 3, "start": 17.08, "end": 23.24, "text": "ich bin halt immer doof, dass das nötig ist, aber meinetwegen, kurz reloaden, es könnte"}, {"id": 4, "start": 23.24, "end": 30.84, "text": "auch sein, dass Vodafone selbst Probleme hat, aber es war schon sehr auffällig, wir wissen"}, {"id": 5, "start": 30.84, "end": 37.48, "text": "ja, hier gibts irgendwie Leute mit Polen, Netz und allem am Start, aber jetzt will was willst du machen?"}, {"id": 6, "start": 37.48, "end": 47.72, "text": "Also bei mir ist Vodafone komplett repp, ich vermute mal eher, dass wieder irgendwelche"}, {"id": 7, "start": 47.72, "end": 60.08, "text": "Polen DDoS Leute am Start sind, ich war halt ein bisschen fail, aber normalerweise reißen"}, {"id": 8, "start": 60.08, "end": 65.88, "text": "sich die Leute zusammen, aber es gibt halt hin und wieder welche, die können sich nicht verkneifen."}, {"id": 9, "start": 65.88, "end": 73.8, "text": "Wir haben kurz den Tor Browser aufgemacht und irgendwie erstmal DDoS eingekauft, was auch immer."}, {"id": 10, "start": 73.8, "end": 78.52, "text": "Bei mir schreiben die Leute jetzt schon in den Chat, meine Zuschauer gehen jetzt wieder runter,"}, {"id": 11, "start": 78.52, "end": 83.04, "text": "weil du jetzt wieder da bist. Ich lass beides auf Leute, wir machen das so,"}, {"id": 12, "start": 83.04, "end": 87.76, "text": "also ich mach jetzt weiter, mal gucken, vielleicht gehts jetzt, ich hab Vodafone aber schon"}, {"id": 13, "start": 87.76, "end": 93.68, "text": "kontaktiert, die machen jetzt IP Wechsel dann demnächst. Ja ok super. Ich bin jetzt leider"}, {"id": 14, "start": 93.68, "end": 102.48, "text": "in der Zwischenzeit nicht weitergekommen, ich war oft. Nein, kein Stress, kein Stress. Also wenn du"}, {"id": 15, "start": 102.48, "end": 106.48, "text": "speedchamp.org aufrufst, kriegst du zumindest schon mal ne Testseite, kannst du nicht viel mit"}, {"id": 16, "start": 106.48, "end": 109.32, "text": "anfangen, aber ich kümmere mich jetzt um den Zertifikat und dann machen wir den Rest. Ich"}, {"id": 17, "start": 109.32, "end": 117.56, "text": "sag dir gleich Bescheid, sollte schnell gehen, aber ja, geht nicht so agil wie erhofft. Kann sein,"}, {"id": 18, "start": 117.56, "end": 120.64, "text": "als ich demnächst wieder weg bin, dann musst du erwarten bis Vodafone das gewechselt hat,"}, {"id": 19, "start": 120.64, "end": 126.92, "text": "aber sollte halbwegs schnell gehen. Ok, alles klar. Ich sag dir gleich Bescheid bis denn. Alright. Ok,"}, {"id": 20, "start": 126.92, "end": 134.36, "text": "nice. Also Leute, weiter gehts. Hoffe mal, dass es jetzt funktioniert. Ich mach jetzt mal, ich will"}, {"id": 21, "start": 134.36, "end": 139.8, "text": "gucken, ob es kaputt geht. Ich lasse es einfach ping laufen, damit er kommt. Also wo wir stehengeblieben"}, {"id": 22, "start": 139.8, "end": 145.64, "text": "sind, ich wollte ein Zertifikat ausstellen für speedchamp. Das hätten wir eigentlich schon seit"}, {"id": 23, "start": 145.64, "end": 156.28, "text": "Ewigkeiten fertig haben sollen, aber naja. Mein Payal hat den DNS Eintritt noch nicht. Echt nicht?"}, {"id": 24, "start": 156.28, "end": 165.64, "text": "Ja, speedchamp.org. Innebar Kabel kriegt man nicht in euer IP, das muss Vodafone machen."}, {"id": 25, "start": 165.64, "end": 176.12, "text": "Also unser Lokalaservice läuft auf Port 5000, das wissen wir. Das heißt wir machen jetzt Reverse"}, {"id": 26, "start": 176.12, "end": 183.84, "text": "Proxy, Port 5000, allerdings müssen wir die Domain eingeben und unsere Domain ist speedchamp.org und"}, {"id": 27, "start": 183.84, "end": 188.84, "text": "ja, das war's. Ich glaube da muss man das klammern oder so. Ich bin mir bei der Syntax ehrlich"}, {"id": 28, "start": 188.84, "end": 200.2, "text": "gesagt unsicher, ob das so ging, ob man so Reverse Proxien kann. Mal schauen. Sollen wir mal gucken."}, {"id": 29, "start": 200.2, "end": 205.08, "text": "Ich hoffe, das stellt jetzt gleich ein Zertifikat aus und dann kann ich am Backend weiter"}, {"id": 30, "start": 205.08, "end": 216.32, "text": "programmieren. Sollte eigentlich funktionieren. Okay, System, CTL, Restart, Kadi. Das ist halt echt"}, {"id": 31, "start": 216.32, "end": 225.12, "text": "blöd. Wir setzen Erwerbung die ganze Zeit. Ich hab's extra kleiner gemacht, nur um in die Ecke"}, {"id": 32, "start": 225.12, "end": 231.24, "text": "geschoben. Musste es mal ausprobieren, wie das funktioniert. Dein Overlay zeigt noch nicht die"}, {"id": 33, "start": 231.24, "end": 240.12, "text": "Chat-Nachrichten an. Echt nicht? Ach stimmt. Ich glaube, das ist RIP."}, {"id": 34, "start": 240.12, "end": 261.16, "text": "Jetzt sollte es wieder funktionieren. Also falls einer von den Mods da ist,"}, {"id": 35, "start": 261.16, "end": 266.92, "text": "es wäre cool, wenn ihr Ausrufezeichen heute und den YouTube-Link zum Noel machen könntet."}, {"id": 36, "start": 266.92, "end": 275.0, "text": "Okay, also weiter im Text. Hat es jetzt funktioniert mit Zertifikat? Wir haben Zertifikat, Leute."}, {"id": 37, "start": 275.0, "end": 281.8, "text": "Bam. Connection secure. Let's Encrypt. Easy. So einfach geht's. Wir haben Zertifikat. Also,"}, {"id": 38, "start": 281.8, "end": 286.32, "text": "das Ganze ist passend eingerichtet. Wunderbar. Klappt. Mehr müssen wir auf dem Server erst"}, {"id": 39, "start": 286.32, "end": 293.96, "text": "mal nicht machen. Das passt. So, jetzt kann ich bereits sagen. So, Server ist eingerichtet,"}, {"id": 40, "start": 293.96, "end": 299.8, "text": "passt. Wenn du Speedchamp.org guckst, haben wir jetzt ein gültiges Zertifikat. Okay, wunderbar."}, {"id": 41, "start": 299.8, "end": 309.12, "text": "Können wir loslegen. Speedchamp.org. Ja. Okay, und dann dementsprechend halt klar den Postrequest"}, {"id": 42, "start": 309.12, "end": 312.72, "text": "mache. Also wir kriegen, da läuft noch nichts, ne? Ich hab noch nichts hingeschrieben. Aber du"}, {"id": 43, "start": 312.72, "end": 320.32, "text": "solltest ein Zertifikat, ein gültiges bekommen. Ja, das geht. Der Proxied. Echt nicht? Ja,"}, {"id": 44, "start": 320.32, "end": 326.36, "text": "du bekommst ein 502, das ist richtig. Genau. Du bekommst ein 502, weil der Applikationswappen,"}, {"id": 45, "start": 326.36, "end": 331.12, "text": "wo er draufschiebt, noch nicht da ist. Aber das gültige Zertifikat kriegst du schon. Okay,"}, {"id": 46, "start": 331.12, "end": 335.64, "text": "alles klar. Also heißt, ich kann jetzt darauf auschecken und laufen. Wobei da steht,"}, {"id": 47, "start": 335.64, "end": 341.92, "text": "bei mir diese Webseite besitzt kein Zertifikat. Bei mir sagt er, es ist Connection secure."}, {"id": 48, "start": 341.92, "end": 349.48, "text": "Das ist vielleicht ein Caching-Problem. Ich geh mal kurz auf Chrome. Ah, Chrome checkt's nicht."}, {"id": 49, "start": 349.48, "end": 354.04, "text": "Alles klar, Firefox funktioniert. Chrome macht nicht weiter, weil es einen 502 gibt. Da muss"}, {"id": 50, "start": 354.04, "end": 358.04, "text": "ich doch die Anwendung noch drauf starten. Weil dem Firefox sagt er mir schon, es ist ein"}, {"id": 51, "start": 358.04, "end": 362.48, "text": "Let's Encrypt-Zertifikat. Ah, okay. Also es funktioniert. Dann check ich jetzt einfach mal"}, {"id": 52, "start": 362.48, "end": 368.72, "text": "die Anwendung da drauf aus und starte die. Und ach so, ich hab gar kein.NET drauf. Ne,"}, {"id": 53, "start": 368.72, "end": 372.84, "text": "mach ich jetzt nicht. Sobald es so funktioniert, machen wir das dann. Du brauchst definitiv noch"}, {"id": 54, "start": 372.84, "end": 377.32, "text": "Docker drauf und da dann ne Container-Ride. Das hab ich mir auch schon überlegt, ob wir das über"}, {"id": 55, "start": 377.32, "end": 383.24, "text": "Docker und Compose machen. Wir müssen es, wir müssen es nicht übertreiben. Passt. Ach so,"}, {"id": 56, "start": 383.24, "end": 387.84, "text": "geht jetzt eigentlich die, nachdem hier Vorderfall rumgesponnen hat, geht eigentlich der Coach her"}, {"id": 57, "start": 387.84, "end": 401.32, "text": "noch? Denke, denke das tut noch. Ich glaube, du müsstest eine neue Session aufmachen. Ah, hier"}, {"id": 58, "start": 401.32, "end": 407.96, "text": "da ist, ne, der ist angeblich, ist er noch offen, aber ich kann dich noch mal einladen. Die Session"}, {"id": 59, "start": 407.96, "end": 412.76, "text": "ist noch auf, aber die, wahrscheinlich bist du rausgeflogen aus der Session. Ähm, lass mich mal"}, {"id": 60, "start": 412.76, "end": 419.6, "text": "gucken. Ich bin rausgeflogen, also du müsstest mich noch mal neu einladen. Müsste, müsste sein. Ach"}, {"id": 61, "start": 419.6, "end": 440.28, "text": "hier, Accept. Danke schön für den Sub, der Kommentator. Ja, passt. Bis zum Startup seh ich."}, {"id": 62, "start": 440.28, "end": 446.56, "text": "Alles klar, dann klappt das wieder. Cool. Alright. Alles klar, gut, was machen wir jetzt? Also dann"}, {"id": 63, "start": 446.56, "end": 450.92, "text": "packe ich jetzt die Anwendung mal kurz auf den Server drauf, dass du auch siehst, dass das alles"}, {"id": 64, "start": 450.92, "end": 459.44, "text": "funktioniert. Und dann wäre ich bereit, Backend Sachen zu basteln. Yes. Okay. Dann mach ich das"}, {"id": 65, "start": 459.44, "end": 462.96, "text": "schnell, sag dir gleich nochmal Bescheid. Und dann kannst du, da können wir bei mir im Stream auch"}, {"id": 66, "start": 462.96, "end": 467.88, "text": "mal schnell dann gleich gucken. Ich mach die Anwendung drauf und da kannst du ja mal committen,"}, {"id": 67, "start": 467.88, "end": 471.48, "text": "wenn es soweit ist und dann können wir uns die mal anschauen. Genau, machen wir so. Okay, ich sag"}, {"id": 68, "start": 471.48, "end": 476.92, "text": "ein paar Minuten Bescheid. Alright. Richtig hyperagile jetzt. Jetzt geht's los. Jetzt,"}, {"id": 69, "start": 476.92, "end": 482.72, "text": "wo Wodafone hoffentlich wieder geht. Alles klar, bis gleich. Yes. So Leute, also was wir jetzt"}, {"id": 70, "start": 482.72, "end": 486.4, "text": "machen ist folgendes. Schade ein bisschen, dass das jetzt so abgekackt ist. Wir waren mal 400"}, {"id": 71, "start": 486.4, "end": 489.48, "text": "Zuschauern, aber kannst nicht machen. Ich bin froh, dass ihr alle da seid. Cool, dass ihr zuguckt,"}, {"id": 72, "start": 489.48, "end": 495.6, "text": "auch wenn es heute ein bisschen Technikkram ist. Haben wir C, CD? Haben wir noch nicht? Wir machen"}, {"id": 73, "start": 495.6, "end": 502.0, "text": "GitHub Actions gleich. So, ich werde mir den Kram mal kurz klonen. Kommt Ansible? Weiß ich noch"}, {"id": 74, "start": 502.0, "end": 510.36, "text": "nicht, ob wir da jetzt Ansible für machen. So, ich clone mir mal kurz das GitHub Repo. JIT clone."}, {"id": 75, "start": 510.36, "end": 520.2, "text": "Und ich installiere mal.NET Ubuntu. Ich installiere mal.NET auf dem Server drauf. Dann können wir"}, {"id": 76, "start": 520.2, "end": 537.0, "text": "das einfach ausführen. Nee, nee. 20.4. Update und dann install, wahrscheinlich.NET, genau."}, {"id": 77, "start": 537.0, "end": 545.92, "text": "Dankeschön Mods. Exzellent, exzellent. Warum nicht gleich GitOps? Warum nicht gleich Azure?"}, {"id": 78, "start": 545.92, "end": 549.48, "text": "Warum nicht gleich Azure Functions? Warum nicht Netlify? Warum nicht AWS? Ja,"}, {"id": 79, "start": 549.48, "end": 552.04, "text": "man kann es alles. Es gibt tausend Wege, wie du was machen kannst."}, {"id": 80, "start": 552.04, "end": 561.08, "text": "Übrigens, danke für die ganzen Subs. Ich habe es jetzt gerade erst noch gesehen."}, {"id": 81, "start": 561.08, "end": 566.24, "text": "Der Kommentator ist noch dabei. Fizz und Xenpy. Hab ich glaube ich schon vorgelesen,"}, {"id": 82, "start": 566.24, "end": 574.8, "text": "aber auch nochmal an euch. Danke. Massive Subscriptions. Hi IQ. IQ++. Um nicht zu sagen."}, {"id": 83, "start": 574.8, "end": 581.16, "text": "Massive Big Brain. Warum nicht Cobol ist die eigentliche Frage? Warum nicht Cobol und ABAP?"}, {"id": 84, "start": 581.16, "end": 587.24, "text": "Das ist die eigentliche Frage hier. So, jetzt haben wir die Anwendung hier drauf. SpeedChamp,"}, {"id": 85, "start": 587.24, "end": 604.52, "text": "SpeedChamp, Backend und nun.NET Run. So, und jetzt sollte auch was kommen auf speedchamp.org."}, {"id": 86, "start": 604.52, "end": 626.4, "text": "Log loss 5000. Passt. Ja, gut. Der kann jetzt nicht so genau. Was hat er für Schmerzen? Habe"}, {"id": 87, "start": 626.4, "end": 633.76, "text": "ich irgendwas verkehrt gemacht im Reverseproxy? Page not working. Ah, no webpage. Ja, das ist"}, {"id": 88, "start": 633.76, "end": 640.16, "text": "klar. Gibt ja auch keine Webseite aktuell. 404. Aber 404 ist. Warum zeigt ein Chrome da nichts an?"}, {"id": 89, "start": 640.16, "end": 649.2, "text": "Sollte mir Chrome nicht bei einem 404 auch ein Zertifikat anzeigen? Bin ich jetzt irgendwie"}, {"id": 90, "start": 649.2, "end": 668.72, "text": "Hardcore, Hardcore, verwirrt Champ oder Mkdir, WWW, Index, HTML. Gucken wir mal. Hallo. Der"}, {"id": 91, "start": 668.72, "end": 673.44, "text": "sollte jetzt zumindest irgendwas anzeigen. Firefox geht. Ja, ja, ich weiß. Firefox geht"}, {"id": 92, "start": 673.44, "end": 685.76, "text": "lustiger, aber es ist komisch. Ich habe ich habe garantiert irgendwas in der in der Konfig"}, {"id": 93, "start": 685.76, "end": 692.4, "text": "verkehrt gemacht. Localhost. Localhost Port 5000. Irgendwas. Irgendwas funktioniert da nicht."}, {"id": 94, "start": 692.4, "end": 699.04, "text": "Schauen gleich Pepega. Guck mal, ich habe irgendwas. Ich habe bestimmt irgendwas in der"}, {"id": 95, "start": 699.04, "end": 709.08, "text": "Konfig verkehrt gemacht. Etc, Kaddi, Kaddi. Reverseproxy ist eigentlich richtig. Eigentlich"}, {"id": 96, "start": 709.08, "end": 719.44, "text": "ist ok. Curl. 7.0.0.0.5.000. Slash, Speed, Champ. Ah, ich weiß euch vergessen, ich liefer ja"}, {"id": 97, "start": 719.44, "end": 725.48, "text": "gar keine Seiten aus. Ok, das muss ich noch einstellen. Es ist nämlich in.NET standardmäßig"}, {"id": 98, "start": 725.48, "end": 732.92, "text": "so, der liefert keine Seiten aus, obwohl man es angelegt hat. Man muss ihm sagen, explizit"}, {"id": 99, "start": 732.92, "end": 737.04, "text": "liefere Server, also liefere statische Seiten aus. Das heißt, ich muss jetzt ein Ordner"}, {"id": 100, "start": 737.04, "end": 742.72, "text": "anlegen. WWW Route. Das ist so der Default Ordner, wo die ganzen HTML Seiten reinkommen."}, {"id": 101, "start": 742.72, "end": 751.36, "text": "Da mache ich jetzt irgendwie eine Index, Index HTML rein. Reicht. Hack W. Mehr muss da nicht"}, {"id": 102, "start": 751.36, "end": 759.76, "text": "drauf. Und jetzt muss ich noch sagen, App Use File Server. Und erst dann surft er diese"}, {"id": 103, "start": 759.76, "end": 782.24, "text": "Files in WWW Route. Aldir, Dankeschön. Plants vs. Zombies, exzellent. Ich spogge das Game."}, {"id": 104, "start": 782.24, "end": 788.48, "text": "Use File Server muss ich machen, sonst funktioniert das Ganze nicht. Ihr könnt jetzt 12701D dorsen."}, {"id": 105, "start": 788.48, "end": 799.08, "text": "So, machen wir mal ein neues Commit. Wir sind ja super hyper agil hier. Git add, Git status,"}, {"id": 106, "start": 799.08, "end": 806.88, "text": "Git commit minus M. Was haben wir gemacht? Edit Default. Kann ich mal schreiben. Edit"}, {"id": 107, "start": 806.88, "end": 820.16, "text": "Default Page. Ne, wir machen es anders. Enabled Pile Serving. Ist ASP.NET outdated? Das ist"}, {"id": 108, "start": 820.16, "end": 825.8, "text": "ja auch nicht ASP.NET, das ist ASP.NET Core. ASP.NET Core ist das neue und super aktuell"}, {"id": 109, "start": 825.8, "end": 830.16, "text": "und es kam quasi erst vor ein paar Tagen auf der Microsoft Build eine neue Preview Version"}, {"id": 110, "start": 830.16, "end": 843.72, "text": "raus. Agile Champs sind am Champen, so sieht es aus. Ich lösche den Kram noch mal kurz"}, {"id": 111, "start": 843.72, "end": 862.6, "text": "und check das nochmal neu aus. Ah, Wodafone hat sich gemeldet. Exzellent. Wodafone war"}, {"id": 112, "start": 862.6, "end": 883.88, "text": "meine Kundennummer. Wodafone braucht meine Kundennummer. Moment."}, {"id": 113, "start": 883.88, "end": 904.16, "text": "Wodafone ist meine Kundennummer. Wodafone ist meine Kundennummer. Wodafone ist meine Kundennummer."}, {"id": 114, "start": 904.16, "end": 930.44, "text": "Wodafone ist meine Kundennummer. Wodafone ist meine Kundennummer. Wodafone ist meine Kundennummer."}, {"id": 115, "start": 930.44, "end": 950.84, "text": "Wodafone ist meine Kundennummer. Wodafone ist meine Kundennummer. Wodafone ist meine"}, {"id": 116, "start": 950.84, "end": 966.54, "text": "Kundennummer. Wodafone ist meine Kundennummer. Wodafone ist meine Kundennummer. Wodafone"}, {"id": 117, "start": 966.54, "end": 972.3, "text": "waren wir genau ich habe kommited ich habe kommited und wollte das ganze noch mal kurz"}, {"id": 118, "start": 972.3, "end": 979.86, "text": "klonen klonen speed speed champ klont jetzt sollte zumindest die standard seite eigentlich"}, {"id": 119, "start": 979.86, "end": 987.62, "text": "ausliefern speed champ speed champ back end dotnet run so und wenn jetzt klappt jeezypro"}, {"id": 120, "start": 987.62, "end": 992.46, "text": "dankeschön für den sub und jetzt sollte er eigentlich die seite ausliefern standardmäßig"}, {"id": 121, "start": 992.46, "end": 999.3, "text": "steht dann in der seite glaube ich keck keck weh oder so läuft und und und keck weh bäm da"}, {"id": 122, "start": 999.3, "end": 1012.54, "text": "sind wir leute und gültiges zertifikat ok ok bin ready seite geht wenn der refresh zertifikat"}, {"id": 123, "start": 1012.54, "end": 1023.46, "text": "ist da und ab jetzt können wir können wir den kram direkt auf den server pushen er schreibt"}, {"id": 124, "start": 1033.7, "end": 1039.66, "text": "es geht noch alles ja ich habe ich habe gerade vergessen ich habe schon gedacht"}, {"id": 125, "start": 1039.66, "end": 1048.7, "text": "wunderbar in welches ich würde da mal mein projekt bauen in welches in welchen ordner"}, {"id": 126, "start": 1048.7, "end": 1054.82, "text": "von dir soll ich das dann mal rein das zeige ich dir mach mal kurz visual studio code please auf"}, {"id": 127, "start": 1054.82, "end": 1060.94, "text": "mit dem mit dem gescherten code also ich habe jetzt du musst dann auch noch mal pullen vorher ich"}, {"id": 128, "start": 1060.94, "end": 1067.74, "text": "habe jetzt noch eingestellt dass der statische files ausliefert hier use files das musst du"}, {"id": 129, "start": 1067.74, "end": 1070.74, "text": "noch machen ansonsten jetzt überhaupt nicht funktioniert hat mich schon ich habe mich schon"}, {"id": 130, "start": 1070.74, "end": 1074.3, "text": "die ganze zeit gewundert warum gibt es keine seiten wenn du das aufmachst aber klar wenn"}, {"id": 131, "start": 1074.3, "end": 1079.1, "text": "er keine statischen seiten ausliefert kann es auch keine seiten geben genau also muss das hier"}, {"id": 132, "start": 1079.1, "end": 1084.42, "text": "reinschieben guck mal es gibt da einen ww root da gibt es eine index html drin die habe ich nur"}, {"id": 133, "start": 1084.42, "end": 1090.78, "text": "zum testen reingemacht die kannst du überbügeln all right alles klar genau dann mache ich das"}, {"id": 134, "start": 1090.78, "end": 1097.86, "text": "genau kann es vorher noch mal muss muss vorher noch einmal einmal pullen oder ganz bescheid sagen dann"}, {"id": 135, "start": 1097.86, "end": 1105.74, "text": "soll ich irgendwas backern technische schon machen an sich an sich gerne ja ja nur die frage was"}, {"id": 136, "start": 1105.74, "end": 1114.3, "text": "wie machen wir also also meine ich muss jetzt mir erst mal überlegen wie ich quasi berechne wie"}, {"id": 137, "start": 1114.3, "end": 1120.86, "text": "viele mbit das sind on the fly sozusagen während dem upload prozess ja big brain time sozusagen"}, {"id": 138, "start": 1120.86, "end": 1124.26, "text": "ganz ganz big brain time ich stehe halt wirklich total auf dem schlaufe müsste es echt mal"}, {"id": 139, "start": 1124.26, "end": 1130.54, "text": "gucken ich weiß nicht was du machen könntest ich könnte ich könnte zumindest also wenn du"}, {"id": 140, "start": 1130.54, "end": 1134.26, "text": "wenn du jetzt du upload ist ja dann einfach mal wir haben uns ja im vorfeld schon mal auf"}, {"id": 141, "start": 1134.26, "end": 1140.26, "text": "erst mal auf 20 mb geeinigt haben wir gesagt 20 mb ist eine gute gute größe ich könnte"}, {"id": 142, "start": 1140.26, "end": 1146.42, "text": "es so machen ich könnte im back end jetzt einfach mal von dir 20 mb einlesen genau also das wäre"}, {"id": 143, "start": 1146.42, "end": 1150.46, "text": "gut wenn du bei dem endpunkt einfach mal das vorbereiten könntest dass ich da quasi wirklich"}, {"id": 144, "start": 1150.46, "end": 1155.42, "text": "daten du kannst einfach so viel uploaden wie du willst bei 20 mb hat er dann auch also ich"}, {"id": 145, "start": 1155.42, "end": 1159.1, "text": "habe es jetzt so gemacht wir können das gerne so machen ich habe noch so eingebaut dass der"}, {"id": 146, "start": 1159.1, "end": 1164.26, "text": "nutzer sich noch selektieren kann aber wir können es ja trotzdem erst noch 20 mb limitieren genau"}, {"id": 147, "start": 1164.26, "end": 1171.74, "text": "wir machen erst mal 20 mb ja genau wir waren erst mal erst mal 20 mb hard code und dann gucken"}, {"id": 148, "start": 1171.74, "end": 1177.22, "text": "wir das baue ich jetzt ein und kannst du kommenten und pushen kannst mir dann einfach bescheid sagen"}, {"id": 149, "start": 1177.22, "end": 1180.98, "text": "dann pull ich das mal und dann mache ich ein update mal auf dem server da können wir es"}, {"id": 150, "start": 1180.98, "end": 1187.86, "text": "sonst dann angucken ok jetzt alles klar dann mute ich mich wieder so chat big brain time ich gucke"}, {"id": 151, "start": 1187.86, "end": 1191.18, "text": "mal kurz beim null in den stream rein wie es da ausschaut was da was da abgeht gerade gucken wir"}, {"id": 152, "start": 1191.18, "end": 1198.02, "text": "ach ne jetzt sind wir grad bei mir im controller ok vielleicht vielleicht vielleicht auch mal"}, {"id": 153, "start": 1198.02, "end": 1206.3, "text": "die quali ein bisschen höher machen speedchamp 20 mb leute 20 mb reicht 20 mb also von der idee"}, {"id": 154, "start": 1206.3, "end": 1212.54, "text": "her funktioniert es ja folgendermaßen wenn also wenn ich jetzt das im backend testen würde"}, {"id": 155, "start": 1212.54, "end": 1216.82, "text": "würde ich das folgendermaßen machen also ich schreibe das jetzt einfach mal als kommentar auf"}, {"id": 156, "start": 1216.82, "end": 1226.26, "text": "20 mb upload machen wir machen wir es doch schon mal so war upload sei es gleich 20 wie viel sind"}, {"id": 157, "start": 1226.26, "end": 1251.1, "text": "20 mb in bytes 20 20 20 millionen kann das sein huge huge brain chat kommt hin oder ok"}, {"id": 158, "start": 1251.1, "end": 1262.26, "text": "ja das zwei und sieben nuller ok passt also dass das müssten zwanz das müssten 20 mb sein wenn"}, {"id": 159, "start": 1262.26, "end": 1268.22, "text": "das wenn das halbwegs halbwegs stimmt was ich da low i cute habe"}, {"id": 160, "start": 1274.22, "end": 1280.06, "text": "also dann machen wir das jetzt folgendermaßen nachdem ich nicht genau weiß was er neu genau"}, {"id": 161, "start": 1280.06, "end": 1285.46, "text": "im frontend macht mache ich jetzt einfach mal so ich lese sinnlos einfach ein der kann so viel"}, {"id": 162, "start": 1285.46, "end": 1289.14, "text": "upload ne das mache ich nicht das mache ich nicht der kann nicht so viel uploaden wie er will weil"}, {"id": 163, "start": 1289.14, "end": 1293.54, "text": "wenn ich das auf den server schiebe dann weiß ich genau dann starten die ersten leute einfach"}, {"id": 164, "start": 1293.54, "end": 1297.9, "text": "nur endlich lang download nur endlich lang upload und machen den server voll und ich habe eine"}, {"id": 165, "start": 1297.9, "end": 1305.86, "text": "hetzer server rechnung von 5000 euro ich kann es mir schon richtig vorstellen nein nein nein das"}, {"id": 166, "start": 1305.86, "end": 1312.62, "text": "würde der chat natürlich niemals machen sowas nie würdet ihr das machen ich wie komme ich"}, {"id": 167, "start": 1312.62, "end": 1317.58, "text": "wie komme ich drauf dass sie sowas machen würdet na ok also sagen wir mal upload sei es sind 20 mb"}, {"id": 168, "start": 1317.58, "end": 1326.42, "text": "20 mb schreibe auch mal dahin megabytes heute ist es ja mehr deutsch mit mibi und mobi und was"}, {"id": 169, "start": 1326.42, "end": 1330.7, "text": "es da nicht alles gibt so und dann brauchen wir den buffer wo man den ganzen kram reinschreiben"}, {"id": 170, "start": 1330.7, "end": 1338.34, "text": "buffer gleich new byte array in upload sei es so weit von der theorie her ich weiß jetzt noch"}, {"id": 171, "start": 1338.34, "end": 1344.26, "text": "nicht genau wie es weitergeht ok so und dann von der theorie her funktioniert es folgendermaßen"}, {"id": 172, "start": 1344.26, "end": 1358.38, "text": "zeit stoppen also im prinzip zeit zeit wie nennen wir das also stopp ur starten upload einlesen wenn"}, {"id": 173, "start": 1358.38, "end": 1375.18, "text": "upload größer größer gleich 20 mb zeit stoppen und dann quasi upload sei es durch zeit so weit"}, {"id": 174, "start": 1375.18, "end": 1380.1, "text": "müsste das das müsste ungefähr die upload geschwindigkeit geben also ich lese 20 mb ein"}, {"id": 175, "start": 1380.1, "end": 1387.38, "text": "und startet die stoppe die zeit wie lange es dauert 20 mb einzulesen 20 mb ist halt das problem dass"}, {"id": 176, "start": 1387.38, "end": 1397.46, "text": "20 mb ja nach nach geschwindigkeit wahrscheinlich ein bisschen ungenau sein könnte also ja"}, {"id": 177, "start": 1403.66, "end": 1407.26, "text": "ich dachte er kommt erst in die upload methode rein wenn der body fertig empfangen wurde"}, {"id": 178, "start": 1407.26, "end": 1413.94, "text": "ne wir machen jetzt wir machen jetzt war alles gepusht was alles gepusht ich habe ich habe"}, {"id": 179, "start": 1413.94, "end": 1421.3, "text": "gepusht kann es mal gucken ob es irgendwie funktioniert ich pull mark kurz geht pull origin"}, {"id": 180, "start": 1421.3, "end": 1427.38, "text": "master ok der request wird wahrscheinlich noch nicht funktionieren weil ich da hardcoded local"}, {"id": 181, "start": 1427.38, "end": 1434.34, "text": "host drin stehen habe ich aber wenn die seite aus dir liefert wird dann ist das schon mal die"}, {"id": 182, "start": 1434.34, "end": 1441.62, "text": "habe ich bin ja noch dabei am am einlesen von von einem upload habe ich noch nicht noch nicht"}, {"id": 183, "start": 1441.62, "end": 1445.94, "text": "fertig soll ich mal soll ich auf dem server gucken schon mal bei mir im stream zeigen wie"}, {"id": 184, "start": 1445.94, "end": 1453.1, "text": "die seite jetzt ausschaut oder was erst mal lokal lassen ich meine ich meine an sich ist"}, {"id": 185, "start": 1453.1, "end": 1458.42, "text": "jetzt noch nicht so viel ganz gerne zeigen aber da gucken wir gucken uns das mal kurz an ich"}, {"id": 186, "start": 1458.42, "end": 1461.42, "text": "hoffe muss nur gucken dass ich keinen sinntagsfehler produziert habe sonst funktioniert das ganze"}, {"id": 187, "start": 1461.42, "end": 1467.1, "text": "nämlich nicht so gepullt habe ich schon das vorher mal updaten nicht dass das ich habe"}, {"id": 188, "start": 1467.1, "end": 1470.26, "text": "meinem chat noch vor gesagt wir müssen uns da noch ein gutes emote raussuchen was wir dann"}, {"id": 189, "start": 1470.26, "end": 1476.62, "text": "das titel nutzen ja gleich sehen ist ganz wichtig dass also wir brauchen wir brauchen sowohl das"}, {"id": 190, "start": 1476.62, "end": 1483.74, "text": "und wir brauchen unbedingt so den so einen faf eiken yes also ohne ohne ohne geht es"}, {"id": 191, "start": 1483.74, "end": 1489.3, "text": "geht es ja nicht das stimmt ich push jetzt meinen kam auch mal kurz dann gehe ich auf"}, {"id": 192, "start": 1489.3, "end": 1501.5, "text": "den server drauf und hol mal das aktuelle so wunderbar das ist jetzt zwar sehr unagil"}, {"id": 193, "start": 1501.5, "end": 1505.3, "text": "muss ich mal sagen ja wir pushen das und ich pulse dann auf dem server von hand da müsste"}, {"id": 194, "start": 1505.3, "end": 1510.7, "text": "jetzt ja eigentlich die continuous integration pipeline anlaufen damit das richtig richtig"}, {"id": 195, "start": 1510.7, "end": 1521.02, "text": "wäre wir machen nachher github actions draus so da ist es leute sieht das nicht geil aus"}, {"id": 196, "start": 1521.02, "end": 1526.42, "text": "guckt euch mal knopf upload größe wählen und hier unten hast du hardcoded werte reingeschrieben"}, {"id": 197, "start": 1526.42, "end": 1532.3, "text": "genau das ist der chet versagt macht doch schon mal macht doch schon mal macht doch schon was"}, {"id": 198, "start": 1532.3, "end": 1541.58, "text": "herr ich guck mal kurz in den source code rein was du für ob es ist von hand ge- hallo elements"}, {"id": 199, "start": 1541.58, "end": 1546.1, "text": "hast du es von hand gemacht das css oder hast du irgendein css framework drin? ich hab ich hab ich"}, {"id": 200, "start": 1546.1, "end": 1551.74, "text": "hab tailwind tailwind hab ich schon mega geil tailwind ist nice ja tailwind ist richtig geil"}, {"id": 201, "start": 1551.74, "end": 1564.9, "text": "monero ja wie cristiano ronaldo ne wobei was war denn monero? ich glaube es war monero oder"}, {"id": 202, "start": 1564.9, "end": 1570.14, "text": "oder ethereum oder so ich weiß es nicht genau zumindest hat christiano ronaldo auf seiner"}, {"id": 203, "start": 1570.14, "end": 1575.82, "text": "website ja auch coins coins gemeint wobei ich davon ausgehe der hat der typ der typ"}, {"id": 204, "start": 1575.82, "end": 1579.62, "text": "weiß das ja nicht das hat irgendeinen admin gemacht ich glaube christiano ronaldo ist"}, {"id": 205, "start": 1579.62, "end": 1584.54, "text": "keiner der zur damaligen zeit irgendwie einen plan davon hatte was kryptowährung ist das ist"}, {"id": 206, "start": 1584.54, "end": 1591.14, "text": "ja schon zwei jahre her jetzt schon jetzt sind sie alle dabei aber cool passt ja wenn ich jetzt"}, {"id": 207, "start": 1591.14, "end": 1596.54, "text": "hier auf upload drücke dann geht wahrscheinlich nix genau genau ne genau dann sagt er hier geht"}, {"id": 208, "start": 1596.54, "end": 1605.18, "text": "nicht wunderbar ja dann baue ich das mal ein dann ist der ich ich lese einfach 20 mb ein und nach"}, {"id": 209, "start": 1605.18, "end": 1611.34, "text": "20 mb höre ich auf okay oder ich gucke einfach ob es größer weil ich ich darf nicht mehr einlesen"}, {"id": 210, "start": 1611.34, "end": 1615.26, "text": "weil ich weiß genau sonst gibt es der erste im chat der ist schon am start mit seinem upload"}, {"id": 211, "start": 1615.26, "end": 1623.66, "text": "server und pumpt das ding voll wer wusste man muss ja hier an alles denken ja call up nächste"}, {"id": 212, "start": 1623.66, "end": 1629.46, "text": "nächste stream how to implement dedos sagst nicht so laut nächste stream machen wir folgendes ich"}, {"id": 213, "start": 1629.46, "end": 1633.62, "text": "hab es mir schon überlegt wenn das hier funktioniert machen wir das frontend auf netlify"}, {"id": 214, "start": 1633.62, "end": 1638.82, "text": "und mein backend kommt dann azure funtions und dann sind wir richtig agil dann sind wir dabei"}, {"id": 215, "start": 1638.82, "end": 1650.06, "text": "dann haben wir die 30.000 euro rechnung ich habe noch ich habe noch von der schulung ich"}, {"id": 216, "start": 1650.06, "end": 1658.1, "text": "habe noch 200 euro gutschein das machen wir dann man kann ich glaube man kann den nicht"}, {"id": 217, "start": 1658.1, "end": 1662.1, "text": "überziehen weil auf den schulungs accounts musst du keine zahlungs sachen hinterlegen"}, {"id": 218, "start": 1662.1, "end": 1667.9, "text": "das smart also im prinzip ist das geht es dann wahrscheinlich einfach aus oder so das ist das"}, {"id": 219, "start": 1667.9, "end": 1674.3, "text": "ist klug das ist echt klug ich brauche schnell ein mit dass der 20 mb einliest und du kannst ja"}, {"id": 220, "start": 1674.3, "end": 1678.94, "text": "gucken dass du nicht auf localhost gehst jetzt genau habe ich schon implementiert und da gucken"}, {"id": 221, "start": 1678.94, "end": 1689.06, "text": "wir mal zusammen gleich wieder also leute weiter 20 mb upload hardcode jetzt erst mal ihr habt"}, {"id": 222, "start": 1689.06, "end": 1696.02, "text": "ja gesehen im frontend man kann das dann später auswählen aber ok ohne scrum poker seid ihr echt"}, {"id": 223, "start": 1696.02, "end": 1702.58, "text": "nicht sehr agil ja wie gesagt die tribe meetings fehlen auch und eitel sind wir eitel zertifiziert"}, {"id": 224, "start": 1702.58, "end": 1712.78, "text": "ich muss nur nur mal fragen nur sag mal bist du eitel zertifiziert ich auch nicht kann das mit"}, {"id": 225, "start": 1712.78, "end": 1719.62, "text": "der qualität doch gar nichts werden bis wenigstens vielleicht den iso 9001 oder safe oder irgendwas"}, {"id": 226, "start": 1719.62, "end": 1726.66, "text": "gar nicht ich auch nicht qualitäts management ist bei mir unten durch aber ich auch nicht"}, {"id": 227, "start": 1726.66, "end": 1732.46, "text": "danach fangen wir an wir brauchen den chat der chat ist unsere qualitätssicherung ich bin"}, {"id": 228, "start": 1732.46, "end": 1743.54, "text": "qualität ist egal der speed champ ist 27 001 zertifiziert ganz klar der ist hochsecure das"}, {"id": 229, "start": 1743.54, "end": 1752.58, "text": "hat man heute schon gesehen zweimal den auswählen ich mache jetzt weiter ich gucke mal ich gucke"}, {"id": 230, "start": 1752.58, "end": 1757.3, "text": "mal schnell ich gucke mal schnell noch mal hier in chat ob ich irgendwas beantworten kann falls"}, {"id": 231, "start": 1757.3, "end": 1765.22, "text": "es fragen zu dort nett oder so gab ich glaube aber nicht ich glaube nicht bei max stehen 20"}, {"id": 232, "start": 1765.22, "end": 1770.94, "text": "millionen bei als 20 mb ihr kommt da ungefähr hin das sind da wobei da kommt ungefähr hin sind"}, {"id": 233, "start": 1770.94, "end": 1776.5, "text": "das sind das megabyte es gibt auch mehbi und mega und so da blick ich nicht mehr durch das genau die"}, {"id": 234, "start": 1776.5, "end": 1782.18, "text": "genau die unterhaltung hatte ich mit meinem mit meinem chat vorher auch ich glaube mega ist"}, {"id": 235, "start": 1782.18, "end": 1790.1, "text": "jetzt neuerdings komplett 1000 und mehbi ist 1024 es kann aber auch genau umgedreht sein wie ihr"}, {"id": 236, "start": 1790.1, "end": 1795.22, "text": "sagt ich weiß ich gebe das ich gebe das offenbar ehrlich zu ich habe keine ahnung bei dir ist aber"}, {"id": 237, "start": 1795.22, "end": 1799.5, "text": "noch nicht so lange her bei mir gab es das alles noch gar nicht bei mir gab es das alles noch"}, {"id": 238, "start": 1799.5, "end": 1803.9, "text": "gar nicht ich kann mich auch genau dran erinnern mit meinem berufsschullehrer mir das erklärt hat"}, {"id": 239, "start": 1803.9, "end": 1808.02, "text": "und ich hoffe dass er mir nachher nicht schreibt und mir sagt na guck mal warum hast du eigentlich"}, {"id": 240, "start": 1808.02, "end": 1814.46, "text": "damals nicht aufgepasst ich würde sagen wir machen es ganz einfach wir sind wir machen wir"}, {"id": 241, "start": 1814.46, "end": 1821.74, "text": "sagen einfach 20 millionen bytes dann immer das gleiche einfach 20 und 60 dass das front end"}, {"id": 242, "start": 1821.74, "end": 1827.14, "text": "soll der kunde sich selber irgendwie zugänglich machen gibt es gibt es auch schon seit jahren gibt"}, {"id": 243, "start": 1827.14, "end": 1830.98, "text": "es auch schon seit jahren dass leute die sagen demnächst braucht man keine programmierer mehr"}, {"id": 244, "start": 1830.98, "end": 1834.78, "text": "weil man das alles zusammen klicken kann ich warte noch drauf ja bis jetzt ist noch nicht"}, {"id": 245, "start": 1834.78, "end": 1841.86, "text": "eingetreten nee das stimmt ich soll dich übrigens fragen warum du auf youtube streamst weil ich"}, {"id": 246, "start": 1841.86, "end": 1848.34, "text": "twitch gar nicht eingerichtet habe aber und halt auch keinen gescheiten twitch account habe ich"}, {"id": 247, "start": 1848.34, "end": 1852.9, "text": "habe noch einen ganz alten account von let's play zeiten aber bei dir gucken die leute einfach"}, {"id": 248, "start": 1852.9, "end": 1857.02, "text": "auch über youtube weil du auf youtube die abos hast wer ja blöd jetzt auf twitch zu streamen wo"}, {"id": 249, "start": 1857.02, "end": 1862.5, "text": "keiner mitbekommt also an sich wäre es vielleicht klug parallel zu streamen oder so weil twitch ist"}, {"id": 250, "start": 1862.5, "end": 1866.1, "text": "eindeutig die bessere plattform haben wir vorher gemerkt was allein einstellung und so weiter"}, {"id": 251, "start": 1866.1, "end": 1874.02, "text": "angeht aber youtube einfach weil da der die community ist ja würde ich auch so machen also"}, {"id": 252, "start": 1874.02, "end": 1882.3, "text": "wenn ich auf youtube die zuschauer hätte klar leuchtet ein so chat zufrieden alles klar ok ich"}, {"id": 253, "start": 1882.3, "end": 1887.66, "text": "baue eins ich lese einfach 20 mb ein dann höre ich auf und dann können wir gucken ob das funktioniert"}, {"id": 254, "start": 1887.66, "end": 1895.42, "text": "alles da sagt ihr bescheid perfekt hier huge huge pair programming wir pair program übrigens"}, {"id": 255, "start": 1895.42, "end": 1900.62, "text": "gar nicht fällt mir ein aber wir aber wir sind wir sind agil wir sind wir sind hyper angel kadel"}, {"id": 256, "start": 1900.62, "end": 1918.86, "text": "also ok war weiter upload size 20 mb ok das heißt theoretisch muss ich jetzt folgendes machen ich"}, {"id": 257, "start": 1918.86, "end": 1933.26, "text": "hätte fast einen speedtest aufgemacht lull war keine gute idee gewesen wieder ok also jetzt"}, {"id": 258, "start": 1933.26, "end": 1938.18, "text": "machen wir folgendes lass mal kurz lass mal kurz überlegen also wir müssen jetzt einfach upload"}, {"id": 259, "start": 1938.18, "end": 1942.74, "text": "einlesen das geht folgendermaßen unter dort nett wusste ich selber nicht wie man das unter"}, {"id": 260, "start": 1942.74, "end": 1946.34, "text": "sp.net core macht ehrlich gesagt da habe ich stack overflow befragt weil ihr wisst ja wenn"}, {"id": 261, "start": 1946.34, "end": 1951.02, "text": "man keine ahnung hat fragt man einfach stack overflow und da habe ich habe ich glaube ich"}, {"id": 262, "start": 1951.02, "end": 1959.66, "text": "gesucht nach read raw bytes sp.net core und da habe ich was gefunden wie das funktioniert"}, {"id": 263, "start": 1959.66, "end": 1975.94, "text": "das da war es glaube ich genau und dann bin ich drauf gekommen dass das funktio otze ja"}, {"id": 264, "start": 1975.94, "end": 1987.26, "text": "oddie read ok ich glaube ich habe mir sie irgendwie dann reversed raus zusammengepasst also das geht"}, {"id": 265, "start": 1987.26, "end": 1992.46, "text": "folgendermaßen normalerweise ist es ja so gedacht dass man einen controller hat dieser controller"}, {"id": 266, "start": 1992.46, "end": 1999.38, "text": "bekommt hier parameter eine id und ein alter oder was auch immer und im hintergrund kümmert sich das"}, {"id": 267, "start": 1999.38, "end": 2005.22, "text": "web framework schon soweit es geht darum dass es aus der url die parameter passt dass es aus"}, {"id": 268, "start": 2005.22, "end": 2009.54, "text": "einem jason body die sachen ausliest also das versucht eigentlich schon relativ viel für dich"}, {"id": 269, "start": 2009.54, "end": 2015.34, "text": "zu machen deswegen sagen wir jetzt einfach wir machen das gar nicht sondern wir lesen den body"}, {"id": 270, "start": 2015.34, "end": 2021.66, "text": "einfach so ein und das geht folgendermaßen das habe ich im vorfeld rausgesucht leute ich habe"}, {"id": 271, "start": 2021.66, "end": 2029.98, "text": "ich habe gecheatet die das know he lacks critical information das habe ich im vorfeld rausgesucht"}, {"id": 272, "start": 2029.98, "end": 2033.78, "text": "weil ich wusste genau dass ich das brauche dass ich das brauche zwar das geht folgendermaßen"}, {"id": 273, "start": 2033.78, "end": 2052.62, "text": "weil und also also so kann man die sache auslesen request body body read async und das macht"}, {"id": 274, "start": 2052.62, "end": 2058.02, "text": "folgendes das liest so viele bites allen wie es einlesen kann oder maximal so viele wie in"}, {"id": 275, "start": 2058.02, "end": 2063.86, "text": "den buffer passen und gibt als zahl zurück wie viele bites es eingelesen hat also sprich"}, {"id": 276, "start": 2063.86, "end": 2070.62, "text": "gebe ich jetzt hier den buffer an und das packe ich in eine schleife rein also sagen wir sowas"}, {"id": 277, "start": 2070.62, "end": 2076.7, "text": "hier was der fuck nein nein nein hier ist sofort das packe ich in eine schleife rein wir brauchen"}, {"id": 278, "start": 2076.7, "end": 2083.5, "text": "auch eine variabler wo wir die länge das aktuellen request reinschreiben und dann sagen wir so was"}, {"id": 279, "start": 2083.5, "end": 2095.94, "text": "wie muss man glaube ich noch mal klammern länge gleich das da also sprich wie viel ich aktuell"}, {"id": 280, "start": 2095.94, "end": 2106.02, "text": "eingelesen habe und dann größer so größer null das heißt dem was habe ich jetzt verkehrt gemacht"}, {"id": 281, "start": 2106.02, "end": 2115.22, "text": "ja ich bin dumm habe es eine klammer zu weit also was das jetzt macht ist das liest ein so viele"}, {"id": 282, "start": 2115.22, "end": 2121.5, "text": "bites aus dem request wie es einlesen kann und merkt sich wie viele bites das waren wenn es mehr"}, {"id": 283, "start": 2121.5, "end": 2126.66, "text": "als null sind macht er weiter das heißt sobald ich null einlese bedeutet das ich habe alles"}, {"id": 284, "start": 2126.66, "end": 2131.3, "text": "eingelesen weil es kommt ja nicht mehr und jetzt muss ich noch irgendwie hochzählen also sprich"}, {"id": 285, "start": 2131.3, "end": 2137.54, "text": "quasi was wie count jetzt vielleicht nicht die besten variablen namen count plus gleich"}, {"id": 286, "start": 2137.54, "end": 2143.42, "text": "länge also der liest ein und zählt es hoch und jetzt könnte ich noch sowas sagen wie"}, {"id": 287, "start": 2143.42, "end": 2154.34, "text": "und keine ahnung und count kleiner upload sei es oder sowas aber scheiß mal drauf lasst"}, {"id": 288, "start": 2154.34, "end": 2158.54, "text": "mal weg ich lasse mich ich lasse mich zu spammen zumal das eh nicht schlimm ist die maximale"}, {"id": 289, "start": 2158.54, "end": 2165.94, "text": "upload sei es von asp dort net core se glaube 30 mb warum die loop weil es nicht garantiert ist"}, {"id": 290, "start": 2165.94, "end": 2171.38, "text": "dass der 20 mb einliest der liest so viel ein wie er für notwendig halten hält also der liest mal"}, {"id": 291, "start": 2171.38, "end": 2183.82, "text": "512 ein der liest mal 1024 ein mal 4096 wie es ihm danach ist also er kann maximal 20 mb einlesen"}, {"id": 292, "start": 2183.82, "end": 2188.38, "text": "ja aber er wird wahrscheinlich nicht so viel einlesen sondern immer in häppchen allein schon wenn"}, {"id": 293, "start": 2188.38, "end": 2194.86, "text": "man sich überlegt so eine tcp paket passen ja nur irgendwie 1,5 kb oder so ungefähr rein"}, {"id": 294, "start": 2194.86, "end": 2202.94, "text": "so dann machen wir das dann zählen wir jetzt und jetzt kommt der eigentliche speed test wir brauchen"}, {"id": 295, "start": 2202.94, "end": 2212.62, "text": "eine stopwatch also ne was heißt es auf deutsch stopwatch schalt uhr dings stopp uhr stopp uhr"}, {"id": 296, "start": 2212.62, "end": 2222.14, "text": "btf was heißt das auf deutsch alter wortwörtlich übersetzt aber stopp uhr es gibt bestimmt bessere"}, {"id": 297, "start": 2222.14, "end": 2227.94, "text": "timer klassen dafür aber die ist gar nicht mal so schlecht low IQ ja ich brauche mehr subs leute"}, {"id": 298, "start": 2227.94, "end": 2235.46, "text": "seht ihr mal wie weit schon gekommen ist also zu wenig prime subs was das was das eigentlich für"}, {"id": 299, "start": 2235.46, "end": 2243.34, "text": "messen auswirkung hat auf den IQ zustand aber nicht nur von mir beim chat ist es ja auch so ihr"}, {"id": 300, "start": 2243.34, "end": 2251.02, "text": "merkt es vielleicht noch nicht aber bei euch ist es auch schon weniger geworden hätte noch"}, {"id": 301, "start": 2251.02, "end": 2259.42, "text": "dankeschön tritts primes ab huge danke schön für den sub echt moment stopwatch start new gibt so was"}, {"id": 302, "start": 2259.42, "end": 2268.18, "text": "messen alle der chat ist wieder massive brain man sieht es bei manchen ist es die bei manchen"}, {"id": 303, "start": 2268.18, "end": 2294.26, "text": "ist das hier noch da jan wagg dankeschön für den sub prime subscription ist die stopwatch"}, {"id": 304, "start": 2294.26, "end": 2299.34, "text": "monotonik ich bin mir nicht mal ganz sicher was monotonik ist ist das glaube ich ist das"}, {"id": 305, "start": 2299.34, "end": 2303.54, "text": "ist das nicht irgendwie sowas dass die immer im gleichen intervall in eine richtung nur zählt"}, {"id": 306, "start": 2303.54, "end": 2310.78, "text": "ich habe keine ahnung oder ist es oder ist es eine marke und das war ein witz"}, {"id": 307, "start": 2310.78, "end": 2323.86, "text": "du hast sechs monat im voraus gesappt ja gut dann hast du auch mindestens sechs monaten noch"}, {"id": 308, "start": 2323.86, "end": 2332.06, "text": "feifert auch ohne sowas wie schaltsekunde was weiß ich nee nee das ist ohne schaltsekunde klar"}, {"id": 309, "start": 2332.06, "end": 2339.58, "text": "das ist ohne so dinger das basiert auf cpu tix unten drunter irgendwo also da ist wahrscheinlich"}, {"id": 310, "start": 2339.58, "end": 2344.34, "text": "mit schaltsekunden nix so als aber die zeit gemessen und jetzt kann ich jetzt kann ich die"}, {"id": 311, "start": 2344.34, "end": 2349.18, "text": "zeit jetzt kann ich die zeit mal ausgeben würde ich sagen also von der idee ist es jetzt ja"}, {"id": 312, "start": 2349.18, "end": 2356.26, "text": "folgendermaßen wir haben jetzt ich habe die zeit gestoppt wie lange es dauert 20 mb einzulesse"}, {"id": 313, "start": 2356.26, "end": 2366.38, "text": "das ist quasi das hier ist quasi der upload speed test speed test nicht dass er noch probleme"}, {"id": 314, "start": 2366.38, "end": 2375.94, "text": "kriegen das ist der upload ich lade so viel ich ich ich lese so viel ein wie geht return"}, {"id": 315, "start": 2375.94, "end": 2382.34, "text": "und jason mit bald count und time in sekunden ich würde sagen wir geben jetzt ja gut doch wir"}, {"id": 316, "start": 2382.34, "end": 2389.86, "text": "können jason zurückgeben wir können jason zurückgeben wir können jason zurück zurückgeben"}, {"id": 317, "start": 2389.86, "end": 2396.9, "text": "mit der zeit ja das können wir jetzt an der stelle tatsächlich machen also return new was"}, {"id": 318, "start": 2396.9, "end": 2403.78, "text": "gehen wir da zurück einfach jetzt einfach nur mal nur mal zum zum testen upload gleich aber"}, {"id": 319, "start": 2403.78, "end": 2407.86, "text": "wenn wir müssen erst noch mal ausrechnen wir müssen erst noch mal ausrecht was hat man weiter"}, {"id": 320, "start": 2407.86, "end": 2415.94, "text": "hier schon wieder gemacht vier spaces was ist da los was der fack zwei spaces bitteschön kommt"}, {"id": 321, "start": 2415.94, "end": 2419.86, "text": "er hier an mit vier spaces ich glaube ich glaube ich glaube es geht los dazu kann ich nur sagen"}, {"id": 322, "start": 2419.86, "end": 2433.3, "text": "also das war mal nicht vier facheinrückungen hier spaces größer zwei spaces das ist richtig"}, {"id": 323, "start": 2433.3, "end": 2447.86, "text": "weil 4 größer 2 aber von der usability her finde ich 2 spaces größer 4 spaces ok also"}, {"id": 324, "start": 2447.86, "end": 2451.78, "text": "jetzt können wir hier upload zurückgehen wir müssen das jetzt noch ausrechnen und ich"}, {"id": 325, "start": 2451.78, "end": 2457.14, "text": "zeige euch jetzt mal eine richtig coole c sharp library oder finde ich zumindest ganz nice wenn"}, {"id": 326, "start": 2457.14, "end": 2465.22, "text": "man nämlich so 3 hat ist wie ich und ich weiß wie man gescheit beides von maybe zu nicht maybe"}, {"id": 327, "start": 2465.22, "end": 2469.34, "text": "und und sonstige dinge umrechnen gibt es eine ganz coole library die heißt glaube ich github"}, {"id": 328, "start": 2469.34, "end": 2480.94, "text": "ich glaube beid sei es mein tap ist auf zwei spaces gestellt ja guck zwei spaces tap beid"}, {"id": 329, "start": 2480.94, "end": 2487.42, "text": "sei es nicht beid sei es beid sei es und da kannst du solche sachen machen wie zum beispiel"}, {"id": 330, "start": 2487.42, "end": 2493.42, "text": "beid sei es von megabytes oder von maybe beid es und dann kannst du es umwandeln in andere"}, {"id": 331, "start": 2493.42, "end": 2498.5, "text": "sachen das ist für alle das ist für alle low iq leute wie mich man kann das natürlich ohne"}, {"id": 332, "start": 2498.5, "end": 2503.26, "text": "probleme selbst machen aber warum selbst machen wenn es da schon was gibt was wahrscheinlich"}, {"id": 333, "start": 2503.26, "end": 2511.18, "text": "schlauere leute als man selbst gemacht haben beid sei es ich werde es bloß noch mal checken if"}, {"id": 334, "start": 2511.18, "end": 2521.34, "text": "meine mein count gleich gleich der upload sei es und wenn es wenn es nicht der fall ist"}, {"id": 335, "start": 2521.34, "end": 2530.74, "text": "ja machen wir so ich gebe ich gebe das hier nur zurück irgendwie so und ansonsten gehen wir"}, {"id": 336, "start": 2530.74, "end": 2534.42, "text": "zurück keine ahnung dass wir einen fehler sehen ich bin mir noch nicht ganz sicher was wir da"}, {"id": 337, "start": 2534.42, "end": 2545.14, "text": "machen also also wenn ich wenn ich genau 20 mb eingelesen habe dann muss ich jetzt meine beid"}, {"id": 338, "start": 2545.14, "end": 2550.02, "text": "sei es ausrechnen also sprich übrigens wie kann ich den rider einstellen dass der den mist hier"}, {"id": 339, "start": 2550.02, "end": 2554.22, "text": "weg macht das sieht ja vollkommen beschissen aus muss einfach noch mal zumachen jetzt ist jetzt"}, {"id": 340, "start": 2554.22, "end": 2558.98, "text": "ist besser besser zu lesen genau weil jetzt muss ich nämlich noch ausrechnen dass das ganze passt"}, {"id": 341, "start": 2558.98, "end": 2573.9, "text": "als aber upload beid per second beid sei es wie das beid sei es vom und wir haben jetzt die"}, {"id": 342, "start": 2573.9, "end": 2582.26, "text": "ganzen sachen ja hier in beid also von beid upload sei es durch und jetzt kommt die eigentliche"}, {"id": 343, "start": 2582.26, "end": 2592.26, "text": "rechnung des upload speeds stopwatch elapsed ne nicht milliseconds milliseconds brauchen wir"}, {"id": 344, "start": 2592.26, "end": 2597.62, "text": "nicht das ist wir wollen wir wollen beid pro sekunde haben also elapsed seconds wollen wir"}, {"id": 345, "start": 2597.62, "end": 2606.02, "text": "haben milliseconds warte mal ich brauchte es als float seconds ist zu ungenau total seconds double"}, {"id": 346, "start": 2606.02, "end": 2615.5, "text": "perfekt also der rechnet hier dann sowas aus wie 20 mb also 20 millionen 20 millionen durch zum"}, {"id": 347, "start": 2615.5, "end": 2629.46, "text": "beispiel 35,5 7 8 9 5 2 3 7 5 5 5 1 9 3 5 sekunden und das sollte dann mein upload speed pro sekunde"}, {"id": 348, "start": 2629.46, "end": 2636.3, "text": "sein das heißt das können wir jetzt noch umrechnen lassen in maybe beid oder in megabyte oder in was"}, {"id": 349, "start": 2636.3, "end": 2648.02, "text": "auch immer upload beid per second als mega maybe ok leute ich muss mal kurz nachgucken mega versus"}, {"id": 350, "start": 2648.02, "end": 2656.1, "text": "maybe ja als m bits könnten was auch machen da muss ich als bits da muss ich als bits umrechnen"}, {"id": 351, "start": 2656.1, "end": 2669.1, "text": "ja aber wir zeigen es jetzt mal megabyte an das ist jetzt erstmal einfacher ok mega ne also"}, {"id": 352, "start": 2669.1, "end": 2672.94, "text": "jetzt jetzt jetzt lassen wir uns erklären jetzt jetzt lassen wir uns das mal erklären also"}, {"id": 353, "start": 2672.94, "end": 2679.94, "text": "maybe maybe ist 1024 das heißt mega ist 1000 alles klar also wollen wir es in maybe beid sammeln"}, {"id": 354, "start": 2679.94, "end": 2688.58, "text": "stimmt sogar was ich da gemacht habe ok machen wir hier null oder minus eins machen wir hier minus"}, {"id": 355, "start": 2688.58, "end": 2693.26, "text": "eins wir können wir können einfach einen fehler wir können einfach eine exception werfen und"}, {"id": 356, "start": 2693.26, "end": 2704.02, "text": "nichts und nichts zurückgeben oder wir machen hier sowas wie error oder so alles klar so wunderbar"}, {"id": 357, "start": 2704.02, "end": 2710.62, "text": "das müsste jetzt eigentlich passen wir können den kram hier hochladen ich hoffe das funktioniert"}, {"id": 358, "start": 2710.62, "end": 2715.54, "text": "was ich hier konstruiert habe müssen wir gleich ausprobieren also wir können den kram hochladen"}, {"id": 359, "start": 2715.54, "end": 2726.42, "text": "und ich stoppe die zeit und dann rechne ich das ganze aus ok wir testen es mal lokal wir"}, {"id": 360, "start": 2726.42, "end": 2735.1, "text": "testen das mal kurz lokal ob das funktioniert was ich mir überlegt habe neu starten wir test"}, {"id": 361, "start": 2735.1, "end": 2740.86, "text": "auch quatsch nicht auf dem server neu starten bringt ja nichts lokal neu starten"}, {"id": 362, "start": 2740.86, "end": 2755.1, "text": "so wie mache ich das jetzt mit dem karl karl also karl x post kann ich mit karl irgendwie"}, {"id": 363, "start": 2755.1, "end": 2762.82, "text": "einfach random daten hochladen geht das kann man kann man mit dem karl karl upload bites"}, {"id": 364, "start": 2762.82, "end": 2768.42, "text": "habe binarie data posting karl ok habe ich noch nie gemacht hat irgendjemand von euch"}, {"id": 365, "start": 2768.42, "end": 2777.3, "text": "ein plan wie das geht data binarie kann ich sagen ich kann nicht sagen data binarie von"}, {"id": 366, "start": 2777.3, "end": 2784.66, "text": "def 0 20 mb oder so ne das geht wahrscheinlich nicht das ja aber dann dann will er dann dann"}, {"id": 367, "start": 2784.66, "end": 2794.26, "text": "leder mehr hoch dann leder nicht 20 mb hoch ich mache mal hier noch eine console ausgabe"}, {"id": 368, "start": 2794.26, "end": 2810.34, "text": "upload ich gebe das hier noch mal aus und auf sehr von ich könnte eine datei anlegen"}, {"id": 369, "start": 2810.34, "end": 2816.42, "text": "ja aber würde das so funktionieren ich probiere ich probiere das mal aus also lokal host 5000"}, {"id": 370, "start": 2816.42, "end": 2828.7, "text": "5000 speed jam ja wenn man das jetzt so richtig schreibt lokal host hey hey leute da kommt"}, {"id": 371, "start": 2828.7, "end": 2837.4, "text": "da kommt schon mal ok interessant da gebe ich hier mal aus wie viel ab wie vieler wie"}, {"id": 372, "start": 2837.4, "end": 2843.5, "text": "vieler hoch eingeladen hat hochgeladen hat count ok aber das ist schon mal interessant"}, {"id": 373, "start": 2843.5, "end": 2856.02, "text": "zu wissen dass das überhaupt funktioniert 9 9 was 9 byte warum ausgerechnet sind das"}, {"id": 374, "start": 2856.02, "end": 2865.78, "text": "9 characters kann das sein 1 2 3 4 5 6 7 8 9 8 er nimmt das literally nimmt er das also"}, {"id": 375, "start": 2865.78, "end": 2890.14, "text": "muss ich das von von der datei oder das"}, {"id": 376, "start": 2890.14, "end": 2895.86, "text": "das funktioniert ja ich muss eine datei anlegen also wie war das dds hat doch irgendjemand"}, {"id": 377, "start": 2895.86, "end": 2901.7, "text": "den chat grad geschrieben genau das genau das genau das brauchen wir wobei mir nullen"}, {"id": 378, "start": 2901.7, "end": 2912.22, "text": "reichen ehrlich gesagt vom def 0 out output dat 1 mb und das ganze 20 dann haben wir genau"}, {"id": 379, "start": 2912.22, "end": 2923.42, "text": "20 20000 bytes hoffentlich versteht er unter m das gleiche wie asb.net dann aus ne ne macht"}, {"id": 380, "start": 2923.42, "end": 2935.06, "text": "er nicht guck mal mal also wie geht das jetzt add output data einmal guck mal hier ok jetzt"}, {"id": 381, "start": 2935.06, "end": 2942.1, "text": "muss ich eben genau jetzt muss ich ok ich will nicht 20 m ich will 20 maybe geht das hack"}, {"id": 382, "start": 2942.1, "end": 2955.9, "text": "weight wisst ihr was wir machen es ganz anders easy 1 zu viel 1 2 3 4 5 so das braucht wahrscheinlich"}, {"id": 383, "start": 2955.9, "end": 2970.26, "text": "jetzt zu lang mit 20000 wie mache ich wie mache ich denn jetzt genau 20 millionen kann"}, {"id": 384, "start": 2970.26, "end": 2988.7, "text": "man mir machen das hatten wir doch schon das sind das ist das ist das das ist das old das"}, {"id": 385, "start": 2988.7, "end": 2996.66, "text": "old school mb muss man machen mb alles klar ok perfekt mal gucken ob unser karl funktioniert"}, {"id": 386, "start": 2996.66, "end": 3008.06, "text": "beim guck mal hier wir haben abgeloaded mit 1340 mb die sekunde näher das kann ja schon"}, {"id": 387, "start": 3008.06, "end": 3012.86, "text": "sein ich meine ich lade ja über mein loopback interface hoch das ist ja quasi vom ram in"}, {"id": 388, "start": 3012.86, "end": 3021.86, "text": "den ram wenn man so will was ich hier upload also ich lade mit mit schwankend hoch zwischen"}, {"id": 389, "start": 3021.86, "end": 3035.18, "text": "ja 730 moment was was pro sekunde 730 mb pro sekunde ich meine das geht vom ram in den"}, {"id": 390, "start": 3035.18, "end": 3038.86, "text": "ram das ist kein wunder dass das schnell ist ne das läuft nicht über den netzwerk schnittstelle"}, {"id": 391, "start": 3038.86, "end": 3044.38, "text": "ich lasse es mal über den netzwerk schnittstelle laufen kann man nämlich ausprobieren ich lasse"}, {"id": 392, "start": 3044.38, "end": 3053.1, "text": "es mal über den netzwerk schnittstelle laufen ja ach nee moment habe ich habe ich habe ich"}, {"id": 393, "start": 3053.1, "end": 3059.02, "text": "habe ich hier einen karl habe ich hier einen karl unter windows ich habe einen karl poggers"}, {"id": 394, "start": 3059.02, "end": 3067.22, "text": "keck weight nice aber ich habe kein dd wie kriege ich das jetzt über das wisst ihr"}, {"id": 395, "start": 3067.22, "end": 3071.58, "text": "was heute ich deploy das jetzt einfach ins internet und gut ist easy geht status"}, {"id": 396, "start": 3071.58, "end": 3086.38, "text": "20 mb limit push einfach nein ich mach das jetzt einfach auf den server drauf und probier"}, {"id": 397, "start": 3086.38, "end": 3103.42, "text": "es da aus easy ups speedchamp backend pull jawoll und jetzt"}, {"id": 398, "start": 3103.42, "end": 3120.1, "text": "das netrun ok probier was mal aus ip haben wir die hier vm vm is for my workstation ok"}, {"id": 399, "start": 3120.1, "end": 3133.82, "text": "mein karl probier was mal aus speedchamp moment ok wait a minute wo habe ich meinen karl da"}, {"id": 400, "start": 3133.82, "end": 3146.9, "text": "ah ich bin ja dumm moment ich bin ja dumm es ist nicht port 5000 es ist es ist https"}, {"id": 401, "start": 3146.9, "end": 3158.3, "text": "und dann auch nicht das sondern ich bin ja richtig bescheuert meine güte speedchamp.org"}, {"id": 402, "start": 3158.3, "end": 3168.38, "text": "es ist langsam der upload der upload ist fucking langsam es geht aber es ist fucking langsam"}, {"id": 403, "start": 3168.38, "end": 3179.22, "text": "4mb die sekunde na gut 4mb die sekunde das kann doch sein ich habe 40mb upload das kann"}, {"id": 404, "start": 3179.22, "end": 3191.06, "text": "doch sogar sein das ist gar nicht schlecht ich sag dem neul mal bescheid wegen stream"}, {"id": 405, "start": 3191.06, "end": 3201.22, "text": "nebenbei ja funktioniert ja wieder erwarten funktioniert es tatsächlich erstaunlich"}, {"id": 406, "start": 3201.22, "end": 3208.98, "text": "gut du kannst ja kannst ja mal bei mir grad in stream gucken jetzt warte hab ich ja ich"}, {"id": 407, "start": 3208.98, "end": 3213.58, "text": "mach grad mit köln den upload test ne ich hab mir eine datei erstellt die 20mb groß"}, {"id": 408, "start": 3213.58, "end": 3224.3, "text": "und ladet jetzt einfach mal hoch ok und du kriegst als antwort jetzt dass das 20mb mit"}, {"id": 409, "start": 3224.3, "end": 3231.18, "text": "vier maybe maybe beid wohlgemerkt die sekunde hochgeladen wird das kommt ich hab 40mb upload"}, {"id": 410, "start": 3231.18, "end": 3239.14, "text": "ich brauch 45mb zum stream das ist gar nicht mal so verkehrt ok ich bin ich bin überrascht"}, {"id": 411, "start": 3239.14, "end": 3245.42, "text": "dass es tatsächlich so gut hinkommt ja also chat wenn ihr wollt könnt ihr es auch mal"}, {"id": 412, "start": 3245.42, "end": 3254.42, "text": "ausprobieren mach ich auch magst du mir die datei mal schicken das sind 20mb große datei"}, {"id": 413, "start": 3254.42, "end": 3258.74, "text": "mit nullen du kannst wenn du hast du nen nee das ist du bist unter windows ne ja ich kann"}, {"id": 414, "start": 3258.74, "end": 3262.46, "text": "es eigentlich hab ich hab die git bash also wenn du mir den command schicken kannst mit"}, {"id": 415, "start": 3262.46, "end": 3267.38, "text": "der ich die generieren kann achso dd hier moment dd da weiß halt nicht ob das unter"}, {"id": 416, "start": 3267.38, "end": 3278.18, "text": "git bash funktioniert aber kann man mal ausprobieren moment kommt im discord da legt"}, {"id": 417, "start": 3278.18, "end": 3283.58, "text": "es eine output output dat an die ist genau und die muss auch genau 20 milionen byte sein"}, {"id": 418, "start": 3283.58, "end": 3289.46, "text": "weil das check da dass man nicht cheaten kann sonst ich schicke dir ich schicke dir auch"}, {"id": 419, "start": 3289.46, "end": 3294.18, "text": "gleich mal das köln mit ja ok wunderbar könnt ihr mir ausprobieren chat wer bei euch schon"}, {"id": 420, "start": 3294.18, "end": 3299.98, "text": "ausprobiert hat schickt mal den befehl in chat ok also ich post mal in chat was man"}, {"id": 421, "start": 3299.98, "end": 3306.02, "text": "machen muss hier ist der köln befehl leute und hier ist das dd könnte ja mal ausprobieren"}, {"id": 422, "start": 3306.02, "end": 3311.14, "text": "nehmen lieber random daten ja kann man auch machen das hast schon recht aber ob wir jetzt"}, {"id": 423, "start": 3311.14, "end": 3316.22, "text": "nullen hochladen oder random daten macht doch erstmal keinen unterschied so achso ich wollte"}, {"id": 424, "start": 3316.22, "end": 3319.14, "text": "dir auch noch schicken genau hier dd hier kannst du auch einfach nur in den chat ich"}, {"id": 425, "start": 3319.14, "end": 3323.34, "text": "hab den ja offen ich hab es bei mir in chat gepost gerade da sind übrigens zwei kommandos"}, {"id": 426, "start": 3323.34, "end": 3326.98, "text": "ich hab die ein bisschen doof hintereinander gepostet also das erste ist das dd das geht"}, {"id": 427, "start": 3326.98, "end": 3332.54, "text": "und das zweite ist das köln mit dem dd links links links in die 20 mb daten mit dem köln"}, {"id": 428, "start": 3332.54, "end": 3343.94, "text": "jetzt so hoch ja das ich sehe hier den speedtest von den leuten in meiner konsole kommt in"}, {"id": 429, "start": 3343.94, "end": 3349.14, "text": "der ganze upload test der download test sollte dann natürlich deutlich schneller sein das"}, {"id": 430, "start": 3349.14, "end": 3352.78, "text": "heißt spätestens dann wissen wir auch ob der kram funktioniert oder nicht komm mal"}, {"id": 431, "start": 3352.78, "end": 3363.78, "text": "hier das erste erste erste exception am start wer war's wer war's wahrscheinlich ah expected"}, {"id": 432, "start": 3363.78, "end": 3368.58, "text": "und als entweder hat er abgebrauchen hat zu viel hochgeladen also das limit ist standardmäßig"}, {"id": 433, "start": 3368.58, "end": 3376.54, "text": "bei sp dot net core 30 mb was so was ein request groß sein darf sonst bricht er ab oder hat"}, {"id": 434, "start": 3376.54, "end": 3381.3, "text": "es einer geschafft die ganze sache zu cheaten guck mal oder hat wirklich eine sehr sehr"}, {"id": 435, "start": 3381.3, "end": 3390.9, "text": "sehr schnelle leitung stark aber der rest scheint ja halbwegs zu funktionieren oder"}, {"id": 436, "start": 3390.9, "end": 3394.82, "text": "der rest scheint wirklich zu funktionieren so leute warum habt ihr alle so schnellen"}, {"id": 437, "start": 3394.82, "end": 3406.94, "text": "upload jetzt wird mich ja auch der graf interessieren von hetzner"}, {"id": 438, "start": 3406.94, "end": 3421.54, "text": "netzwerk netzwerk net working hier den hatten die früher unter netten netten bin ich jetzt"}, {"id": 439, "start": 3421.54, "end": 3427.18, "text": "bin ich jetzt blöd wo haben die denn den netzwerk grafen ganz mal unter grafen gibt's"}, {"id": 440, "start": 3427.18, "end": 3434.3, "text": "auch oben wieder blind wieder guck mal hier da ist den habe ich gesucht ok da geht doch"}, {"id": 441, "start": 3434.3, "end": 3448.26, "text": "ein bisschen was die leute sind aber ausprobieren genau die laden direkt von hetzner ja hast"}, {"id": 442, "start": 3448.26, "end": 3451.98, "text": "du du kannst an den du kannst dich jetzt wahrscheinlich nicht einloggen was man von hetzner klaut"}, {"id": 443, "start": 3451.98, "end": 3458.34, "text": "so einfach zu hetzner klaut so aber probieren kann ach die leute machen es schon von hetzner"}, {"id": 444, "start": 3458.34, "end": 3464.3, "text": "vm zu hetzner vm deswegen sind die so schnell weil ich wollte gerade sagen alter die leute"}, {"id": 445, "start": 3464.3, "end": 3472.78, "text": "hier mit 300 mb in der sekunde was haben die für den upload der chat wieder das ist klar"}, {"id": 446, "start": 3472.78, "end": 3479.16, "text": "das ist halt der vor und nachteil von technisch fähigen zuschauen vor und nachteil zugleich"}, {"id": 447, "start": 3479.16, "end": 3483.42, "text": "das stimmt das stimmt du hast kläffere leute im chat aber du hast auch welche sind halt"}, {"id": 448, "start": 3483.42, "end": 3489.34, "text": "die sind also besonders clever oh habt das abgelehnt hier wird schon wieder gespammt"}, {"id": 449, "start": 3489.34, "end": 3498.98, "text": "ja aber bei mir bei mir ist halt ganz klar die 40 mbits zu erkennen wenn es ich gehe"}, {"id": 450, "start": 3498.98, "end": 3509.38, "text": "noch mal rein ich probiere es jetzt noch mal aus ja also das funktioniert prinzipiell"}, {"id": 451, "start": 3509.38, "end": 3515.34, "text": "wir müssen halt mal gucken wie zuverlässig das ist mit schnelleren verbindungen das können"}, {"id": 452, "start": 3515.34, "end": 3518.38, "text": "wir dann mal ausprobieren spätestens wenn es vom hetzner server zum hetzner server"}, {"id": 453, "start": 3518.38, "end": 3523.14, "text": "geht dann dann sollte es sollte es eigentlich funktionieren ich meine er hat ja eine recht"}, {"id": 454, "start": 3523.14, "end": 3531.06, "text": "genaue auflösung der macht es ja auf also die stopp geht ja auf cpu tic basis also auch"}, {"id": 455, "start": 3531.06, "end": 3535.38, "text": "wenn wenn ich total seconds nehme in wirklichkeit hat er ja noch irgendwie keine ahnung zwanzig"}, {"id": 456, "start": 3535.38, "end": 3539.46, "text": "nachkommastellen genau ich kann oder so dabei oder was ist ein double was hatten das ich"}, {"id": 457, "start": 3539.46, "end": 3547.22, "text": "habe keine ahnung aus dem kopf 14 stellen nicht sagen wer hat ahnung ja ok da aber"}, {"id": 458, "start": 3547.22, "end": 3550.3, "text": "also ich bin ich bin schon mal ich bin schon mal zufrieden der upload test funktioniert"}, {"id": 459, "start": 3550.3, "end": 3555.46, "text": "ja auf jeden fall ich bereite jetzt noch mal kurz vor dann pushe ich gleich noch mal was"}, {"id": 460, "start": 3555.46, "end": 3564.7, "text": "dann kann man gucken ob es auch auch ob es auch so funktioniert perfekt was soll ich"}, {"id": 461, "start": 3564.7, "end": 3569.26, "text": "irgendwie noch was spezielles einbauen oder hast du hast du bei deinem check testet er"}, {"id": 462, "start": 3569.26, "end": 3577.3, "text": "genau ob der 20 ja er testet aber genau 20 mb mb hat also das können wir später ändern"}, {"id": 463, "start": 3577.3, "end": 3584.1, "text": "es ist kein ich war gerade fragen sicher ja ok ja nee bei mir hat es ok guck mal guck"}, {"id": 464, "start": 3584.1, "end": 3588.22, "text": "mal kurz in visual studio code vielleicht habe ich auch logikfehler drin kann ja sein"}, {"id": 465, "start": 3588.22, "end": 3595.02, "text": "dass bei mir gerade viel aber guck mal in den controller ja du guckst du kannst das"}, {"id": 466, "start": 3595.02, "end": 3599.02, "text": "nur und dann kann ablassen ja also ich habe es auch ich habe es auch vorhin probiert wenn"}, {"id": 467, "start": 3599.02, "end": 3604.14, "text": "da was anderes hochlädt dann geht es selbst wenn es mehr ist wenn übrigens der wenn wenn"}, {"id": 468, "start": 3604.14, "end": 3609.14, "text": "es nicht geht kriegst du minus eins zurück mir ist nichts besseres eingefallen also ich"}, {"id": 469, "start": 3609.14, "end": 3613.54, "text": "würde sagen wir machen es später so wenn das nicht funktioniert der bricht dann einfach"}, {"id": 470, "start": 3613.54, "end": 3618.38, "text": "ab und du kriegst gar nichts zurück der macht einfach der macht einfach die verbindung dann"}, {"id": 471, "start": 3618.38, "end": 3627.18, "text": "mit einer fehler fehler fehler zu hat er keinen sinn ok ok alles klar warte dann push ich"}, {"id": 472, "start": 3627.18, "end": 3634.74, "text": "das grad mal und dann kannst du das mal deployen weil dann sieht man was so geht push nice"}, {"id": 473, "start": 3634.74, "end": 3640.14, "text": "jetzt muss mir noch ein github issue raussuchen den ich wieder fixe wie viele github issues"}, {"id": 474, "start": 3640.14, "end": 3644.58, "text": "haben wir eigentlich mittlerweile schon offen hier auch du hast geschlossen hier ich habe"}, {"id": 475, "start": 3644.58, "end": 3655.34, "text": "einen habe ich schon zugemacht ich will die zuschauer jetzt natürlich auch bloß noch"}, {"id": 476, "start": 3655.34, "end": 3662.5, "text": "weitere hinzuzufügen speedchamp korn gibt's dann komm es gibt jetzt es gibt jetzt kryptowährung"}, {"id": 477, "start": 3662.5, "end": 3668.22, "text": "die auf festplatten speicher geht kryptowährung die auf cpu leistung geht cp auf gpu leistung"}, {"id": 478, "start": 3668.22, "end": 3674.54, "text": "geht noch kryptowährung die auf netzwerk wlan abdeckung geht dann kann man doch eigentlich"}, {"id": 479, "start": 3674.54, "end": 3683.66, "text": "auch mal internet speedtest währung irgendwie machen es braucht einfach nur coinchamp coinchamp"}, {"id": 480, "start": 3683.66, "end": 3692.22, "text": "das ist die ultimate das ist dann quasi die koin aller koin so ok ich habe gepusht ok"}, {"id": 481, "start": 3692.22, "end": 3704.94, "text": "kryptowährung auf bandbreite gibt es schon warum wundert mich das nicht so also ich soll"}, {"id": 482, "start": 3704.94, "end": 3713.18, "text": "pullen du sollst pullen ja ok auf dem server bei mir lokal ist ne warte stopp stopp ich"}, {"id": 483, "start": 3713.18, "end": 3718.62, "text": "habe vergessen das frontend überhaupt zu bauen das wäre vielleicht noch smart einen"}, {"id": 484, "start": 3718.62, "end": 3726.1, "text": "moment gehen wir noch kurz ja dann kann ich dann kann ich den leuten gleich zeigen genau"}, {"id": 485, "start": 3726.1, "end": 3730.42, "text": "danach können wir das mit dem download ausprobieren und dann haben wir was was zumindest so der"}, {"id": 486, "start": 3730.42, "end": 3734.46, "text": "spur einer funktion enthält die auch so aussieht auf den ersten blick als würde funktionieren"}, {"id": 487, "start": 3734.46, "end": 3742.34, "text": "ja wir werden locker locker 40 minuten schneller gewesen wenn mein internet zeug hiermit gemacht"}, {"id": 488, "start": 3742.34, "end": 3748.78, "text": "hätte es wäre ja auch langweilig wenn es einfach funktioniert ja bauder von hat sich"}, {"id": 489, "start": 3748.78, "end": 3757.14, "text": "gemeldet also die können jederzeit umschalten der nächsten issue schließen das geht immer"}, {"id": 490, "start": 3757.14, "end": 3767.5, "text": "laufen im band chat frag gerade wer du bist jemand mit dem ich auf youtube schon mal vor"}, {"id": 491, "start": 3767.5, "end": 3772.62, "text": "einer woche oder so ein video hochgeladen habe wo wir uns über jobs it aktuelle it jobs"}, {"id": 492, "start": 3772.62, "end": 3778.02, "text": "und arbeitgeber unterhalten haben und ja weiß ich so willst du noch irgendwas sagen wer"}, {"id": 493, "start": 3778.02, "end": 3785.22, "text": "du bist ich bin ich bin ich bin informatikstudent auch youtuber da bisher mit youtube immer so"}, {"id": 494, "start": 3785.22, "end": 3792.66, "text": "eine on off beziehung gehabt aber jetzt wieder aktiv und ja und heute wird agil programmiert"}, {"id": 495, "start": 3792.66, "end": 3797.7, "text": "dann werde ich erstmal dann in der nächsten vorlesung von berichten direkt direkt den"}, {"id": 496, "start": 3797.7, "end": 3805.62, "text": "lebenslauf die buchen mich dann direkt schon für workshops ok ich habe jetzt noch mal gepusht ok"}, {"id": 497, "start": 3805.62, "end": 3815.7, "text": "gibt es remote update ich mache jetzt direkt auf dem server dass man reloaden kann ok dann"}, {"id": 498, "start": 3815.7, "end": 3822.98, "text": "gucken wir uns das jetzt mal an speed jam.org pages not working 502 warum das liegt an mir das liegt"}, {"id": 499, "start": 3822.98, "end": 3829.38, "text": "an mir gehe ich mal von aus ich bin dumm ich habe es nicht gestartet das ist manchmal da sieht man"}, {"id": 500, "start": 3829.38, "end": 3834.02, "text": "mal wieder so sehr so sehr ich mich immer irgendwie agil und solche sachen lustig macht das hat"}, {"id": 501, "start": 3834.02, "end": 3838.66, "text": "schon seine vorteile alles wenn man so einen automatischen workflow hat ne pushe und automatisch"}, {"id": 502, "start": 3838.66, "end": 3845.78, "text": "deploy das ist halt wirklich so da muss man nicht die leute spammen wieder was das zeug kennt. Guck dir das mal"}, {"id": 503, "start": 3845.78, "end": 3850.42, "text": "es wäre wirklich interessant zu wissen welche da wirklich tatsächlich über die website reinkommen"}, {"id": 504, "start": 3850.42, "end": 3858.62, "text": "ja vielleicht wäre es jetzt sinnvoll zu sagen von welchem origin das kommt ja das wäre vielleicht"}, {"id": 505, "start": 3858.62, "end": 3871.18, "text": "nicht verkehrt aber aber da ist es ok sollte ich mal klicken versuchst mal meine güte hier das ist"}, {"id": 506, "start": 3871.18, "end": 3880.58, "text": "ja magic alda ja 4,7 das kommt ungefähr hin so ungefähr in dem dreh würde ich sagen gefühlt"}, {"id": 507, "start": 3880.58, "end": 3886.26, "text": "hat es bei mir auch gedauert ja nice jetzt gucke ich gerade mein netzwerk was er sagt antwort ich"}, {"id": 508, "start": 3886.26, "end": 3892.1, "text": "gucke mir einfach mal die response an dann sehe ich ja was was das back end meint was es ist ja"}, {"id": 509, "start": 3892.1, "end": 3909.74, "text": "stimmt das habe ich ja noch nicht implementiert basically. Also musst du mal starten. Was fail to load response warum?"}, {"id": 510, "start": 3909.74, "end": 3917.78, "text": "klick mal auf response drauf bis ihr auf preview ach ich bin ne aber der mag nicht warum nicht was"}, {"id": 511, "start": 3917.78, "end": 3923.62, "text": "hat er für was hat er für schmerz der sollte zumindest minus eins oder so zurück zurück kriegen"}, {"id": 512, "start": 3923.62, "end": 3928.9, "text": "ne bei mir schickt er tatsächlich auch keine antwort"}, {"id": 513, "start": 3928.9, "end": 3935.66, "text": "schau mal im log ich würde ja gerne im log gucken aber das log wird von euch gerade so voll"}, {"id": 514, "start": 3935.66, "end": 3946.3, "text": "gespammt da sehe ich nix du kannst ja mal nen console console log oder irgendwie so was machen"}, {"id": 515, "start": 3946.3, "end": 3954.74, "text": "auf die auf die response ich glaube ich glaube es liegt am back end also also wenn wenn google"}, {"id": 516, "start": 3954.74, "end": 3960.26, "text": "nichts anzeigt google chrome nichts anzeigt da wird wahrscheinlich nichts da sein ist aber komisch"}, {"id": 517, "start": 3960.26, "end": 3971.26, "text": "weil sagen wir so das karl moment warum geht es jetzt nicht also wenn es mit karl geht warum geht"}, {"id": 518, "start": 3971.26, "end": 3979.58, "text": "das mit chrome nicht ja also es passt ziemlich gut bei mir sind es ein bisschen upload weniger"}, {"id": 519, "start": 3979.58, "end": 3982.86, "text": "das hängt wahrscheinlich einfach damit zusammen dass alle gerade auf diesen server ein passen"}, {"id": 520, "start": 3982.86, "end": 3988.5, "text": "wahrscheinlich wahrscheinlich ich würde es halt ich würde es halt echt gerne gucken was der antwort"}, {"id": 521, "start": 3988.5, "end": 3995.3, "text": "so der vergleich halt ne der vergleich von dem was was du hier quasi on the fly ausrechnest und was"}, {"id": 522, "start": 3995.3, "end": 4000.1, "text": "das back end misst es bringt jetzt aber auch nix wenn ich sage leute hört mal auf zu spammen"}, {"id": 523, "start": 4000.1, "end": 4010.06, "text": "weil das machen sie nicht das das hat jetzt höchstens eine firewall einstellen schnell"}, {"id": 524, "start": 4010.06, "end": 4019.34, "text": "und da muss man eine ip ne ne ne ne das da sieht man meine ip das das geht nicht aber wenn du das"}, {"id": 525, "start": 4019.34, "end": 4030.18, "text": "bei hetzen da ist halt den tab nicht mehr öffnen ja super ja verstehe jetzt nicht also warum kriegt"}, {"id": 526, "start": 4030.18, "end": 4035.42, "text": "er ich meine der der hat ja hat hat hat er einen fehler vielleicht wenn man das über die hast du"}, {"id": 527, "start": 4035.42, "end": 4042.86, "text": "ja okay nie du machst er return u upload ich mache einfach mit karl mit karl geht's ja"}, {"id": 528, "start": 4042.86, "end": 4053.66, "text": "mit karl krieg ich krieg ich krieg ich zurück ich guck mal kurz ins studio code rein uploader"}, {"id": 529, "start": 4053.66, "end": 4057.7, "text": "muss man gucken warum naja dann kann es ja wahrscheinlich doch am frontend liegen"}, {"id": 530, "start": 4057.7, "end": 4066.14, "text": "zeige mal wo ist denn dein wo ist denn das drinne wo muss ich gucken sauce ne sauce ja sauce js"}, {"id": 531, "start": 4069.22, "end": 4072.7, "text": "ach hier exe aus post ah ok"}, {"id": 532, "start": 4072.7, "end": 4089.78, "text": "ja calculate speed oh yes hier ist wirklich big brain time ich sehe es gerade wo es"}, {"id": 533, "start": 4089.78, "end": 4106.14, "text": "on the fly berechnet wird so aber so genau habe ich verstehe ich jetzt auch nicht was"}, {"id": 534, "start": 4106.14, "end": 4114.18, "text": "der für schmerzen hat mach einfach rate limit mich wundert warum der das im browser nicht"}, {"id": 535, "start": 4114.18, "end": 4120.14, "text": "anzeigt ja das ist das ist irgendwie wird irgendwie klappt der request irgendwie wird"}, {"id": 536, "start": 4120.14, "end": 4124.5, "text": "der request nicht fertig musste bei dir vielleicht hat bei mir mit dem chat geschrieben content"}, {"id": 537, "start": 4124.5, "end": 4131.38, "text": "type noch setzen dass du sagst content type zurück application jason gute frage ne aber"}, {"id": 538, "start": 4131.38, "end": 4134.94, "text": "der wird gesetzt ich wollte gerade sagen ich glaube das macht er ich habe das kapiert"}, {"id": 539, "start": 4134.94, "end": 4151.62, "text": "also seit wir das das klappt und sehr merkwürdig kannst du mal eben im frontend ich habe jetzt"}, {"id": 540, "start": 4151.62, "end": 4158.06, "text": "an der stelle nicht so wirklich den den durchblick aber du bist ja unten hast du irgendwie die die"}, {"id": 541, "start": 4158.06, "end": 4163.82, "text": "results kannst du da irgendwie mal einen console lock oder sowas machen auf die ja ich mache"}, {"id": 542, "start": 4163.82, "end": 4171.78, "text": "jetzt mal genau ich starr das mal bei mir schickst du auch genau 20 mb ja aber selbst wenn du"}, {"id": 543, "start": 4171.78, "end": 4176.9, "text": "müsste zumindest minus eins zurückkommen also es müsste auf jeden fall was zurückkommen"}, {"id": 544, "start": 4176.9, "end": 4196.58, "text": "ja du kannst ja mal ein lock machen also ich bekomme ich bekomme meinen rate zurück den ich dir schicke jetzt"}, {"id": 545, "start": 4196.58, "end": 4201.82, "text": "ist die frage wahrscheinlich vielleicht schicke ich dir das falsch das kann sein also ich schicke"}, {"id": 546, "start": 4201.82, "end": 4210.46, "text": "dir definitiv keine recht richtig richtig ich schicke dir als request body einfach den buffer"}, {"id": 547, "start": 4210.46, "end": 4218.86, "text": "von diesem intervall aber wo ist hier und ab wo schickst du es hier genau buffer from data hier"}, {"id": 548, "start": 4218.86, "end": 4225.86, "text": "genau ist vielleicht vielleicht weil jetzt krieg ich nicht deine ich krieg nicht deine jason response"}, {"id": 549, "start": 4225.86, "end": 4232.54, "text": "krieg ich nicht zurück tromm rafft nicht firefox schon ach im firefox gehts magst du das mal ich"}, {"id": 550, "start": 4232.54, "end": 4236.26, "text": "habe firefox ich probiere ich probiere das gerade mal aus das wäre jetzt aber merkwürdig"}, {"id": 551, "start": 4236.26, "end": 4249.74, "text": "und da sieht man auch gleich mit dark theme ich mache mal den dark wieder aus so ok network"}, {"id": 552, "start": 4249.74, "end": 4260.1, "text": "bei mir gehts kaum und firefox gleich gut das hat die frage jaja kannst du jetzt einmal gucken ob"}, {"id": 553, "start": 4260.1, "end": 4266.7, "text": "er da auch eine ich bin ich bin gerade am gucken hier request der firefox hängt bei mir mega was"}, {"id": 554, "start": 4266.7, "end": 4274.18, "text": "denn da los request ach nee der request ist einfach nur diesen groß ne ich krieg auch das"}, {"id": 555, "start": 4274.18, "end": 4287.38, "text": "rate zurück lull aber 4096 nur nur 4006 90 bytes nein nein das sind nee das ist schon aber"}, {"id": 556, "start": 4287.38, "end": 4305.74, "text": "darstellung anders ok keine ahnung aber in der response steht es drin ich bin ja auch dumm ich"}, {"id": 557, "start": 4305.74, "end": 4318.34, "text": "habe im request geguckt und response passt also in ja du hast in mit ich habs in mein"}, {"id": 558, "start": 4318.34, "end": 4326.58, "text": "meiner response ist mehr wie bald aber ich kann das umrechnen ich kann es auch in ambit machen ok"}, {"id": 559, "start": 4326.58, "end": 4333.94, "text": "ja ambit werde ich mal aber das kommt das kommt glaube ich ungefähr hin guck mal mit"}, {"id": 560, "start": 4333.94, "end": 4349.02, "text": "2 mb weit mal gucken ob google das kann das kommt ungefähr hin also google meint 32,358"}, {"id": 561, "start": 4349.02, "end": 4356.3, "text": "moment hier megabit sind 3,8 mb weit und das backend ist der meinung es sind 4,1 mb weit"}, {"id": 562, "start": 4356.3, "end": 4361.9, "text": "das kommt recht gut hin würde ich sagen also 0,3 mbit da schwankungen dazwischen kann ich"}, {"id": 563, "start": 4361.9, "end": 4372.22, "text": "mir schon vorstellen wo ist das vertritt wo ist das verpflichtende impressum wollen es wieder"}, {"id": 564, "start": 4372.22, "end": 4380.38, "text": "wissen wir verfolgen keinerlei gewinn absichten damit das privat telemedien gesetzt geht nicht"}, {"id": 565, "start": 4380.38, "end": 4388.62, "text": "jetzt jetzt geht es bei mir lokal ich habe bei mir die ich habe die request header geändert ich"}, {"id": 566, "start": 4388.62, "end": 4395.14, "text": "habe es den content type auf so ein octet stream gesetzt irgendwo auf google stand dass das"}, {"id": 567, "start": 4395.14, "end": 4407.14, "text": "vielleicht so geht so da kannst du noch mal pushen und ich ich push das jetzt auch einfach mal mit"}, {"id": 568, "start": 4407.14, "end": 4418.62, "text": "dem console log response genau da können wir kommen ja das liegt anscheinend echt an irgendwie"}, {"id": 569, "start": 4418.62, "end": 4423.38, "text": "das firefox standardmäßig davon ausgeht wenn da viel weit geschwurbel reinkommt und chrome sagt"}, {"id": 570, "start": 4423.38, "end": 4439.34, "text": "wenn der heiter nicht gesetzt ist dann juckt mich das net ich mache hier auf dem server mal"}, {"id": 571, "start": 4439.34, "end": 4445.26, "text": "wird immer noch gespammt als fang er kann er nicht mal beenden weil das so viel noch im"}, {"id": 572, "start": 4445.26, "end": 4456.18, "text": "buffer drin hat ok remote update und pull run mir fällt übrigens eigentlich sollte es vielleicht"}, {"id": 573, "start": 4456.18, "end": 4462.38, "text": "nicht im debug run auf dem server sondern release mode anmachen also ein bisschen schneller also"}, {"id": 574, "start": 4462.38, "end": 4470.7, "text": "reloads sagt reload gucken wir mal gucken wir uns das mal an ich probiere es mal im raum aber"}, {"id": 575, "start": 4470.7, "end": 4476.38, "text": "sehr schön dynamisch wie das und fleißig in welchem zeitintervall guckst du so oder machst"}, {"id": 576, "start": 4476.38, "end": 4480.3, "text": "du einfach über den kompletten zeitintervall drüber und das ist ich kriege immer event und"}, {"id": 577, "start": 4480.3, "end": 4485.46, "text": "immer wenn das event vom browser aus geschossen wird update ich das guckst du quasi an zwischen"}, {"id": 578, "start": 4485.46, "end": 4490.58, "text": "letztem oder zählst du einfach insgesamt auch hoch durch zeit oder insgesamt durch zeit ja"}, {"id": 579, "start": 4490.58, "end": 4500.78, "text": "bei mir gibt es im chrome immer noch nicht aber ich gucke mal in die konz in die konsole ein cash"}, {"id": 580, "start": 4500.78, "end": 4510.1, "text": "vielleicht noch kurz das ja manchmal ich mache mal cash das ist abel cash so ist abel cash kann"}, {"id": 581, "start": 4510.1, "end": 4516.42, "text": "auch sein dass das ist viel aber nichts doch nicht korrekt gepusht haben oder so du hast"}, {"id": 582, "start": 4516.42, "end": 4523.82, "text": "irgendein sonderzeichen im tailwind css drin guck mal das ist irgendwie ja tailwind css add"}, {"id": 583, "start": 4523.82, "end": 4532.58, "text": "ozent 5e stark verstehe ich nicht aber es funktioniert trotzdem"}, {"id": 584, "start": 4532.58, "end": 4550.22, "text": "ja das so ein häuschen und ich kriege irgendwie auch nix in der konsole das guck mal stehe ich"}, {"id": 585, "start": 4550.22, "end": 4557.94, "text": "nicht ja der chat aber ausprobiert hier es hat eine ausprobiert speedtest 10 10 m bit und"}, {"id": 586, "start": 4557.94, "end": 4564.1, "text": "speedchamp 9,56 m bit also scheint doch ungefähr zu stimmen was wir da machen ja also bei mir bei"}, {"id": 587, "start": 4564.1, "end": 4570.78, "text": "mir lokal wenn ich starte bekomme ich jetzt ein response zurück jetzt wundert mich halt nur"}, {"id": 588, "start": 4570.78, "end": 4575.62, "text": "warum es da noch nicht gebaut ist so ich probiere es mal bei mir lokal gerade mal aus weiß auch"}, {"id": 589, "start": 4575.62, "end": 4582.98, "text": "nicht warum das bei sonst kannst mal gucken ob die code änderung war ich kurz im github kann sein"}, {"id": 590, "start": 4582.98, "end": 4590.94, "text": "dass ich auch so sehen also ich habe ich habe in der konsole in der konsole kommt nix"}, {"id": 591, "start": 4590.94, "end": 4600.38, "text": "hast du es auch neu gepullt ja ich habe ich habe remote abdeck ich guck mal was was du"}, {"id": 592, "start": 4600.38, "end": 4605.22, "text": "geändert hast im letzten commit genau schau mal also ich habe ich habe remote abdeck gemacht"}, {"id": 593, "start": 4605.22, "end": 4611.7, "text": "gepullt also passt alles geht lock minus 1 minus p ja du hast text octet stream hinzugeschrieben"}, {"id": 594, "start": 4611.7, "end": 4621.5, "text": "hinzugeschrieben und konsole lock response was auch immer ok warte ich baue es jetzt noch mal"}, {"id": 595, "start": 4621.5, "end": 4628.14, "text": "und push es noch mal kann sein dass er einfach nicht korrekt übernommen hat stimmt stimmt stimmt"}, {"id": 596, "start": 4628.14, "end": 4635.74, "text": "stimmt es war es wurde kein ww root wurde nicht geupdatet richtig genau ja der chat sagt es"}, {"id": 597, "start": 4635.74, "end": 4642.14, "text": "passieren komische dinge wenn man schnell den upload button spamt aber wahrscheinlich die aktivierst du es nicht dass"}, {"id": 598, "start": 4642.14, "end": 4647.1, "text": "es ein zweites mal uploadet wenn man klickt oder ja genau genau das kann man noch machen"}, {"id": 599, "start": 4647.1, "end": 4655.22, "text": "aber aber aber die reports im chat passen gut speed test neun fünf neun fünfzig mbit speed"}, {"id": 600, "start": 4655.22, "end": 4667.74, "text": "gem 57 mbit also wunderbar also leute es kann sein dass es bei manchen von euch riesige"}, {"id": 601, "start": 4667.74, "end": 4671.3, "text": "unterschiede gibt dann liegt es wahrscheinlich daran dass die verbindung zu dem einen oder zu"}, {"id": 602, "start": 4671.3, "end": 4677.02, "text": "dem anderen eben unterschiedlich gut ist ich habe nicht auf release gebaut aber das solltet"}, {"id": 603, "start": 4677.02, "end": 4680.42, "text": "jetzt nicht den riesen unterschied machen kann er aber gleich machen sag wenn ich wenn ich gucken"}, {"id": 604, "start": 4680.42, "end": 4692.54, "text": "kann erst ich push es gerade ich habe ein update er war euch ein error ist noch nix da ja es geht"}, {"id": 605, "start": 4692.54, "end": 4700.82, "text": "nicht so schlecht oder ich habe die falschen oder gelöscht wir haben zum klug alles eingecheckt"}, {"id": 606, "start": 4700.82, "end": 4713.14, "text": "in das netrun minus c release oder so ob dann dann lässt das in optimis laufen"}, {"id": 607, "start": 4713.14, "end": 4730.3, "text": "sie diskutieren kratzer im chat drüber wie man den service am besten zu spamt"}, {"id": 608, "start": 4730.3, "end": 4741.7, "text": "das nächste mal machen wir folgendermaßen wobei weißt du was wir machen könnten ich"}, {"id": 609, "start": 4741.7, "end": 4747.78, "text": "könnte basic aus davor machen mit meinem proxy die und nur wir haben das password wir sperren"}, {"id": 610, "start": 4747.78, "end": 4762.5, "text": "euch aus chat aber noch hält der server ja aus es ist geil ich versuche das zu beenden"}, {"id": 611, "start": 4762.5, "end": 4778.46, "text": "und es braucht zehn sekunden bis alles weg ist genau so ist das test bei mir sagte everything"}, {"id": 612, "start": 4778.46, "end": 4792.58, "text": "up to date also ich habe es gebaut und an sich kommt es auch im richtigen verzeichnis raus"}, {"id": 613, "start": 4792.58, "end": 4814.46, "text": "ich habe was vergessen von 16 59 ich nenne den kommet dumm jetzt ok jetzt gucke ich mal ins"}, {"id": 614, "start": 4814.46, "end": 4824.98, "text": "letzte log ja minifight ist javascript sieht immer so toll aus ja es wunderbar ok also"}, {"id": 615, "start": 4824.98, "end": 4839.38, "text": "dann dort netrun release und gucken wir noch mal startet da ist es und jetzt kriege ich"}, {"id": 616, "start": 4839.38, "end": 4846.5, "text": "auch was in der konsole data upload ja jetzt funktioniert ist gar nicht übel hier sagt"}, {"id": 617, "start": 4846.5, "end": 4853.3, "text": "der upload 30,68 bei mir sind bei mir sind das 3,7 maybe maybe bald muss noch mal kurz"}, {"id": 618, "start": 4853.3, "end": 4864.46, "text": "umrechnen lassen im bittum sind 3,6 hey das ist ziemlich gut du hast gemessen 3,65 und"}, {"id": 619, "start": 4864.46, "end": 4869.42, "text": "das becken ist dann 3,79 also da kannst du dich nicht beschweren das ist ziemlich nahe"}, {"id": 620, "start": 4869.42, "end": 4874.14, "text": "beieinander das stark das stark dann kannst du ja noch das dann in dem in dem response"}, {"id": 621, "start": 4874.14, "end": 4880.3, "text": "als mbit ja geben und dann setzt sich quasi einfach wenn die response da ist überschreibe"}, {"id": 622, "start": 4880.3, "end": 4885.62, "text": "ich die werte einfach wieder genau genau gut das ist ja das ist ja aktuell nur nur upload"}, {"id": 623, "start": 4885.62, "end": 4890.26, "text": "test wir müssen uns überlegen wie wir das machen mit dem mit dem response wollen wir"}, {"id": 624, "start": 4890.26, "end": 4895.98, "text": "einfach zwei zwei sachen die du aufrufst machen ein upload test und ein download test oder"}, {"id": 625, "start": 4895.98, "end": 4900.58, "text": "ja das heißt im endeffekt genau wenn der upload fertig ist oder man fängt mit dem"}, {"id": 626, "start": 4900.58, "end": 4910.14, "text": "download an download ich mir einfach einen array buffer von dir ja warum lasst ihr überhaupt"}, {"id": 627, "start": 4910.14, "end": 4914.92, "text": "den client das ist eine gute frage warum lasst ihr überhaupt den client messen server sollte"}, {"id": 628, "start": 4914.92, "end": 4920.46, "text": "doch ausreichen naja dass man mal was sieht während man den knopf drückt was das ist"}, {"id": 629, "start": 4920.46, "end": 4924.26, "text": "der einzige grund zählen wird das was auch im server gemessen wird aber es ist natürlich"}, {"id": 630, "start": 4924.26, "end": 4927.58, "text": "schon cool das muss ja zugeben leute wenn man hier auf den knopf drückt und es passiert"}, {"id": 631, "start": 4927.58, "end": 4940.7, "text": "direkt was ne exactly so ein bisschen user experience genau sehr schön"}, {"id": 632, "start": 4940.7, "end": 4950.26, "text": "wunderbar dann also wir können es auf zwei zwei arten könnten was können was machen"}, {"id": 633, "start": 4950.26, "end": 4957.38, "text": "entweder wir machen ich gehe mal kurz ich bin mal kurz im code studio code also wir"}, {"id": 634, "start": 4957.38, "end": 4967.38, "text": "könnten noch einen zweiten zweiten hier test machen für mit quasi dann keine ahnung da"}, {"id": 635, "start": 4967.38, "end": 4970.9, "text": "muss ich das ding aber um benennen weil ich habe spät spät schämt da müssen wir"}, {"id": 636, "start": 4970.9, "end": 4974.98, "text": "slash spät schämpf ab und slash spät schämpf down machen oder du hast einfach slash"}, {"id": 637, "start": 4974.98, "end": 4979.46, "text": "ab slash down oder so oder oder wir machen einfach so wir lassen den spät schämpf"}, {"id": 638, "start": 4979.46, "end": 4988.02, "text": "weg und machen nur ab und down genau genau so oder wir könnten das alles hier in einem machen"}, {"id": 639, "start": 4988.02, "end": 4998.86, "text": "weil ich kann dir also dann können wir aber halt kein response hier hier drinnen machen"}, {"id": 640, "start": 4998.86, "end": 5002.58, "text": "also ich könnte die jetzt quasi wenn man spät wenn du slash spät schämpf aufrufst"}, {"id": 641, "start": 5002.58, "end": 5006.58, "text": "als erstes kannst du was hochladen und als zweites würde ich dir dann einfach 20 mb"}, {"id": 642, "start": 5006.58, "end": 5012.14, "text": "wieder zurückschicken dann müsstest du aber halt anderweitig den die results abfragen"}, {"id": 643, "start": 5012.14, "end": 5018.7, "text": "er ist halt dann dann die frage war im endeffekt muss der server ja trotzdem noch irgendwie"}, {"id": 644, "start": 5018.7, "end": 5022.78, "text": "berechnen wie es ist weil sonst wäre es ja wieder der client der dafür zuständig wäre"}, {"id": 645, "start": 5022.78, "end": 5031.3, "text": "sind sie theoretisch theoretisch was wir was du machen könntest ist du du zählst einfach"}, {"id": 646, "start": 5031.3, "end": 5036.1, "text": "ab wie lange der upload dauert und die uploadzeit können wir dann von dem von der gesamte zeit des"}, {"id": 647, "start": 5036.1, "end": 5042.74, "text": "requests abziehen ich kann das wobei ich kann den download ja auch stoppen also mal angenommen ich"}, {"id": 648, "start": 5042.74, "end": 5048.18, "text": "würde dir jetzt direkt nachdem der upload durch ist direkt nachdem der upload durch ist schicke"}, {"id": 649, "start": 5048.18, "end": 5052.78, "text": "ich dir einfach 20 mb zurück und das kann ich ja auch stoppen wie lange es dauert bis es bei dir"}, {"id": 650, "start": 5052.78, "end": 5059.14, "text": "ankommt das können wir einfach mal ausprobieren das einzige dumme ist nur dann kann ich dir in"}, {"id": 651, "start": 5059.14, "end": 5063.22, "text": "diesem request keine results zurückschicken weil naja weil du kriegst ja schon per download was"}, {"id": 652, "start": 5063.22, "end": 5068.66, "text": "also das funktioniert da nicht da müssen wir genau dass das meinte ich halt weil die dadurch keine"}, {"id": 653, "start": 5068.66, "end": 5074.98, "text": "results bekommen genau die dann machen wir dann machen wir ab und da und zum testen ja ja ja und"}, {"id": 654, "start": 5074.98, "end": 5079.54, "text": "also wir können ja dann wie gesagt wir haben brauchen heute eh wenn er nicht komplett fertig"}, {"id": 655, "start": 5079.54, "end": 5084.78, "text": "bin ich mir ziemlich sicher wenn ich mir das mensch auf die uhr guck 18 uhr das können wir"}, {"id": 656, "start": 5084.78, "end": 5089.5, "text": "dann irgendwann das nächste mal überlegen ob wir es nicht so machen dass wenn man die dass man die"}, {"id": 657, "start": 5089.5, "end": 5095.26, "text": "ergebnisse speichern kann also sprich dass du dir irgendwie so einen token abrufst am anfang dass"}, {"id": 658, "start": 5095.26, "end": 5101.74, "text": "du quasi so eine id pro messung kriegst und der server dann passend zu dieser id sich die werte"}, {"id": 659, "start": 5101.74, "end": 5107.74, "text": "irgendwie speichert genau ich glaube das können wir so machen dann gucken da machen wir das so"}, {"id": 660, "start": 5107.74, "end": 5125.82, "text": "also machen wir slash down und slash ab nur dass ich halt den kram dir schicke du kannst ja mal"}, {"id": 661, "start": 5125.82, "end": 5130.3, "text": "gucken dass du das dem axios irgendwie beibringen kannst dass das dann auch noch dann auch noch"}, {"id": 662, "start": 5130.3, "end": 5136.14, "text": "abruft jetzt ich guck da mal gut dann sagst du einfach wenn es fertig ist ich sag dir bescheid"}, {"id": 663, "start": 5136.14, "end": 5141.94, "text": "frage wie lange willst du heute machen wahrscheinlich nicht mehr so lange ich auch nicht also ich würde"}, {"id": 664, "start": 5141.94, "end": 5148.82, "text": "jetzt wir machen die download funktionieren würde ich auch sagen ich habe dann übels hunger jetzt"}, {"id": 665, "start": 5148.82, "end": 5155.06, "text": "schon das machen wir machen den download fertig da sieht man nämlich dass es prinzipiell funktioniert"}, {"id": 666, "start": 5155.06, "end": 5160.46, "text": "und über die über die genaue architektur und wie man dann vielleicht einzelne sachen speichern"}, {"id": 667, "start": 5160.46, "end": 5164.42, "text": "und so können wir uns nächstes mal überlegen genau genau das machen wir heute ich hoffe euch"}, {"id": 668, "start": 5164.42, "end": 5167.62, "text": "gefällt es bis jetzt leider ein bisschen technische probleme technische probleme"}, {"id": 669, "start": 5167.62, "end": 5174.62, "text": "zwischendurch aber wir geben alles ja ich hoffe auch bei dir drüben im stream ich habe den chat"}, {"id": 670, "start": 5174.62, "end": 5181.62, "text": "gar nicht mehr auf aber ich hoffe euch gefällt alles alles glaube ich richtig richtig poggers"}, {"id": 671, "start": 5181.62, "end": 5188.1, "text": "sagt der chat das freut mich huge pock alles klar ich sag dir bescheid kann er schon mal"}, {"id": 672, "start": 5188.1, "end": 5192.06, "text": "dein chat kann sich ja schon überlegen welches emote wie er noch mal welche sich doch da"}, {"id": 673, "start": 5192.06, "end": 5196.98, "text": "reinklatschen soll genau das war das noch nicer ist könnt ihr euch ja mal überlegen was wir"}, {"id": 674, "start": 5196.98, "end": 5201.98, "text": "machen wollen irgendwie keks emotes was auch immer ein meme bildchen könnt euch könnt"}, {"id": 675, "start": 5201.98, "end": 5208.18, "text": "euch überlegen was wir wollen ich mein ich habe aber ich habe vielleicht noch mit einem link zu"}, {"id": 676, "start": 5208.18, "end": 5214.26, "text": "einem high end auflösenden bild oder so das wäre super das wäre natürlich noch besser ja das"}, {"id": 677, "start": 5214.26, "end": 5219.94, "text": "kann man gucken das ist nicht so aktuell hast du einfach nur knop und 3 3 zeilen mit ja zahlen"}, {"id": 678, "start": 5219.94, "end": 5225.58, "text": "drin ist ja das mal da lockst du kein irgendwie mehr hinter irgendwo hervor mit mit der optik"}, {"id": 679, "start": 5225.58, "end": 5232.26, "text": "perfekt also machen was lächelt dauernd da werde ich das jetzt mal kurz basteln alles"}, {"id": 680, "start": 5232.26, "end": 5237.9, "text": "klar ich sage dir gleich bescheid denke mal so zehn minuten oder so ok alles klar bis gleich"}, {"id": 681, "start": 5237.9, "end": 5252.66, "text": "discord hat mein hotkey gelöscht jetzt ok geht wieder ich mache jetzt aus ok leute"}, {"id": 682, "start": 5252.66, "end": 5257.34, "text": "dann werden wir das mal programmieren wir sind ja super agil wir können so was on the fly ändern"}, {"id": 683, "start": 5257.34, "end": 5270.82, "text": "aber ich kann das relativ einfach in mbit umrechnen ich sag nämlich hier einfach upload"}, {"id": 684, "start": 5270.82, "end": 5279.14, "text": "bytes per second in bits und jetzt habe ich bits pro sekunde und jetzt muss ich das ganze"}, {"id": 685, "start": 5279.14, "end": 5288.78, "text": "einfach nur mal 1000 mal 1000 rechnen habe ich mbit oder stimmt das stimmt das hat es"}, {"id": 686, "start": 5288.78, "end": 5311.86, "text": "gemp müsste eigentlich so stimmen dann war mal jetzt hier war upload mbits so dann haben"}, {"id": 687, "start": 5311.86, "end": 5327.3, "text": "ich auch die mbits ob's bits 1000 mal 1000 ok alles ich mein könnt ihr natürlich dann"}, {"id": 688, "start": 5327.3, "end": 5334.78, "text": "auch eine million schreiben aber so finde ich es lesbar ok upload mbits per second upload"}, {"id": 689, "start": 5334.78, "end": 5339.26, "text": "mbits per second minus eins da müssen wir uns so für die fehler wir geben keine antwort"}, {"id": 690, "start": 5339.26, "end": 5352.42, "text": "wir sagen hier throw new new exception hack wait so perfekt beste exception ok dann machen"}, {"id": 691, "start": 5352.42, "end": 5358.82, "text": "wir das ganze jetzt mal verdauert also sprich das ist der upload test und das hier wird"}, {"id": 692, "start": 5358.82, "end": 5371.82, "text": "der download test down dann nenne ich das einfach mal so down und das ist ab ja jetzt ich konnte"}, {"id": 693, "start": 5371.82, "end": 5374.94, "text": "leider den chat grad nicht so lesen jetzt sagt mal ich wollte soll mir öfter so was"}, {"id": 694, "start": 5374.94, "end": 5377.86, "text": "machen ich meine jetzt nicht jeden tag ist klar ist auch viel zu anstrengend und wird"}, {"id": 695, "start": 5377.86, "end": 5382.42, "text": "dann wahrscheinlich auch langweilig mit der zeit aber so ab und zu mal so einmal in alle"}, {"id": 696, "start": 5382.42, "end": 5388.74, "text": "zwei wochen oder einmal in der woche oder irgendwie sowas toll nice ist mega cool chat"}, {"id": 697, "start": 5388.74, "end": 5393.86, "text": "soll ich euch mal ehrlich ehrlich sagen das freut mich ihr wisst ich bin ich kann das"}, {"id": 698, "start": 5393.86, "end": 5402.26, "text": "immer schlecht so expressen ja aber das freut mich ehrlich wirklich dass euch das gefällt"}, {"id": 699, "start": 5402.26, "end": 5412.66, "text": "white people happy ist nicht agil genug was müsste man renee was müsste man machen für"}, {"id": 700, "start": 5412.66, "end": 5426.26, "text": "mehr agilness daily stand up ja ist super heute nice wir können ja auch mal die nächsten"}, {"id": 701, "start": 5426.26, "end": 5429.78, "text": "streams über so eine kleine projektliste machen immer wenn uns was einfällt was man"}, {"id": 702, "start": 5429.78, "end": 5435.22, "text": "hier so machen könnte weil wichtig ist dass wir das darf nicht zu groß sein ihr seht doch"}, {"id": 703, "start": 5435.22, "end": 5441.98, "text": "wir haben ein easy as fuck projekt hier eigentlich und wir machen da ewig dran rum ok also wir"}, {"id": 704, "start": 5441.98, "end": 5447.22, "text": "brauchen jetzt erstmal den controller für download und wir brauchen übrigens noch den"}, {"id": 705, "start": 5447.22, "end": 5459.26, "text": "controller für ping fällt mir gerade ein ping einfach zweimal aufrufen oder so keine"}, {"id": 706, "start": 5459.26, "end": 5467.26, "text": "andere fällt mir noch nichts so nichts großartiges zu ein community projekt ja da muss ich mal"}, {"id": 707, "start": 5467.26, "end": 5472.74, "text": "gucken also download wie kann man die download wie kann man den download messen ich würde"}, {"id": 708, "start": 5472.74, "end": 5478.46, "text": "sagen wir machen das exakt genauso wie bei dem anderen wir nehmen ich einfach eine download"}, {"id": 709, "start": 5478.46, "end": 5494.1, "text": "size download size 20 megabytes download size und jetzt verschicken wir das einfach ich"}, {"id": 710, "start": 5494.1, "end": 5499.3, "text": "glaube das ist sogar noch einfacher weil ich glaube das ist noch noch also das ist jetzt"}, {"id": 711, "start": 5499.3, "end": 5505.74, "text": "glaube ich richtig easy as fuck das download ding zu zu basteln wir brauchen einen buffer"}, {"id": 712, "start": 5505.74, "end": 5511.54, "text": "der so groß ist wie die upload size und nicht wie die download size und jetzt und jetzt"}, {"id": 713, "start": 5511.54, "end": 5518.94, "text": "können wir einfach sagen hier a weight response body right und jetzt schreiben wir einfach"}, {"id": 714, "start": 5518.94, "end": 5524.3, "text": "den kompletten buffer rein fertig mehr müssen wir nicht machen dann brauchen wir noch stopwatch"}, {"id": 715, "start": 5524.3, "end": 5530.82, "text": "gucken wie lange das dauert bis er das ganze versendet hat stopp und dann machen wir genau"}, {"id": 716, "start": 5530.82, "end": 5540.82, "text": "das gleiche wie hier manchmal schön copy pasten also im moment count den account kann es"}, {"id": 717, "start": 5540.82, "end": 5549.82, "text": "wach sind was mache ich hier das ist blödsinnig das ist blödsinnig aber kann man so cheaten"}, {"id": 718, "start": 5549.82, "end": 5566.1, "text": "kann man so cheaten beim download wirklich mal gucken also upload size download download"}, {"id": 719, "start": 5566.1, "end": 5571.3, "text": "ich hoffe ich verschreibe mich in irgendwo das sind m bits download size geteilt durch"}, {"id": 720, "start": 5571.3, "end": 5580.42, "text": "zeit vergangen was programmiert ihr einen speed test einen speed test du kannst dir"}, {"id": 721, "start": 5580.42, "end": 5585.66, "text": "den übrigens schon angucken gerade geh mal auf speedchamp.org so die allererste basic"}, {"id": 722, "start": 5585.66, "end": 5592.34, "text": "variante funktioniert sogar schon guck kannst hier drauf klicken und dann zeigt er dir an"}, {"id": 723, "start": 5592.34, "end": 5602.06, "text": "dass du upload hast wird übrigens schon voll gespammt hier also hier uploads m bits per"}, {"id": 724, "start": 5602.06, "end": 5613.3, "text": "second und das ist dann download m bits per second fast so vielleicht machen wir hier"}, {"id": 725, "start": 5613.3, "end": 5639.54, "text": "eine ordentliche beschreibung download speed m bits per second und dann machen wir hier"}, {"id": 726, "start": 5639.54, "end": 5650.5, "text": "daraus upload speed dass man aber ordentliche ordentliche anzeige hat upload speed ok wunderbar"}, {"id": 727, "start": 5650.5, "end": 5659.98, "text": "sollte nun eigentlich funktionieren testen wir mal lokal testen wir mal lokal ob das ob"}, {"id": 728, "start": 5659.98, "end": 5674.06, "text": "das klappt 20 mb alles klar probieren wir mal aus erstmal den hier pullen und run so"}, {"id": 729, "start": 5674.06, "end": 5677.34, "text": "und jetzt haben wir curl ach so moment ich brauch gar keinen post das könnte man sogar"}, {"id": 730, "start": 5677.34, "end": 5681.62, "text": "als das könnte man eigentlich sogar als als get machen wozu den post für den download"}, {"id": 731, "start": 5681.62, "end": 5708.74, "text": "ne egal kann man so lassen die seite ist scheiß das funktioniert noch gar nichts ja würde"}, {"id": 732, "start": 5708.74, "end": 5716.62, "text": "ich sagen wie heißt so schön geduld ich kann mir so sprüche nicht merken also probieren"}, {"id": 733, "start": 5716.62, "end": 5726.7, "text": "wir das ganze jetzt mal hier lokal aus lokal host lokal host post und jetzt down ob geht"}, {"id": 734, "start": 5726.7, "end": 5736.02, "text": "das jetzt einfach so moment ich muss jetzt was upload ich muss jetzt was upload um was"}, {"id": 735, "start": 5736.02, "end": 5740.62, "text": "zu downloaden moment das ergibt keinen sinn warum muss ich was uploaden um was down zu"}, {"id": 736, "start": 5740.62, "end": 5768.42, "text": "loan wait down ach so ich machs ja auch falsch ich brauche auch lokal host lokal host 5.000"}, {"id": 737, "start": 5768.42, "end": 5785.74, "text": "das hat er für schmerzen warum kackt ab was was möchte mir dort net damit jetzt sagen"}, {"id": 738, "start": 5785.74, "end": 5798.14, "text": "vielleicht soll ich dann get raus machen dass ich machte man get raus aber er hat schon"}, {"id": 739, "start": 5798.14, "end": 5806.94, "text": "da noch what the fuck moment moment ich muss mal kurz gucken ob der upload noch funktioniert"}, {"id": 740, "start": 5806.94, "end": 5819.82, "text": "ob ich jetzt aber ich jetzt irgendwie kaputt gemacht habe ab ich mache mal bei jetzt ich"}, {"id": 741, "start": 5819.82, "end": 5843.66, "text": "muss durch bei jetzt machen nicht durch und nicht mal etwas stimmte doch nicht bisschen"}, {"id": 742, "start": 5843.66, "end": 5849.54, "text": "verkehr drum ja das sieht besser aus wenn es ist lokal aus das geht vom ram ins ram"}, {"id": 743, "start": 5849.54, "end": 5855.1, "text": "aber das ist schon das ist schon das sieht schon realistischer aus warum benutzt du dafür"}, {"id": 744, "start": 5855.1, "end": 5862.86, "text": "nicht beid sei es weil es das lustigerweise nicht kann guck mal upload per second bits"}, {"id": 745, "start": 5862.86, "end": 5868.46, "text": "kannst du wirklich bits es kann das es heißt ja auch beid sei es und ich bitt sei es hat"}, {"id": 746, "start": 5868.46, "end": 5877.3, "text": "man bitt sei es gibt es nicht das ist aber ehrlich gesagt bisschen dumm dass man das"}, {"id": 747, "start": 5877.3, "end": 5887.82, "text": "moment moment was ist beid in tb beid bitts in bitt simple das kann er kann er nicht aber"}, {"id": 748, "start": 5887.82, "end": 5892.74, "text": "das das sieht jetzt realistischer aus so wir machen da jetzt ein get raus hatte tp get"}, {"id": 749, "start": 5892.74, "end": 5915.82, "text": "mehr brauchen wir das eigentlich warum kackt es ab download speed warum kackt es ab response"}, {"id": 750, "start": 5915.82, "end": 5922.94, "text": "has already started was genau möchtet ihr uns mitteilen wo ist wo wo wo wo ist das problem"}, {"id": 751, "start": 5922.94, "end": 5938.22, "text": "mache ich jetzt irgendwie was body right es so ein buffer klingt klingt eigentlich erst"}, {"id": 752, "start": 5938.22, "end": 5967.18, "text": "einmal sinnvoll was ich da mache ich hab keine ahnung warum der abkackt ehrlich gesagt null"}, {"id": 753, "start": 5967.18, "end": 5972.98, "text": "er versucht zweimal den gleichen response zu schreiben du kannst unten nicht return"}, {"id": 754, "start": 5972.98, "end": 5981.66, "text": "ach stimmt ja natürlich geht das nicht natürlich geht das nicht ja klar ich kann hier unten"}, {"id": 755, "start": 5981.66, "end": 5994.46, "text": "keine response machen weil die response da oben ist ja schon das muss ich dem nur einmal"}, {"id": 756, "start": 5994.46, "end": 5999.74, "text": "erzählen dass die logik nicht funktioniert das funktioniert nicht so wie wir uns das"}, {"id": 757, "start": 5999.74, "end": 6008.9, "text": "gedacht haben weil du kannst du kannst ja mal kurz kurz bei mir gucken im stream ich habe"}, {"id": 758, "start": 6008.9, "end": 6014.46, "text": "nicht so viel die latrine also folgendermaßen ich habe es jetzt auf die gleiche art versucht"}, {"id": 759, "start": 6014.46, "end": 6021.5, "text": "wie im upload ja kannst du sagen wenn du es wenn du editor siehst ich sehe ihn ja ja"}, {"id": 760, "start": 6021.5, "end": 6027.7, "text": "hast ja response body right async und dann schreibe ich dir 20 mb raus ich kann dir aber"}, {"id": 761, "start": 6027.7, "end": 6033.86, "text": "nicht im gleichen request 20 mb bytes rausschreiben und noch eine json response geben weil es"}, {"id": 762, "start": 6033.86, "end": 6039.02, "text": "gibt ja nur eine response für deinen request also ich kann ja nicht 20 bytes reinschreiben"}, {"id": 763, "start": 6039.02, "end": 6044.38, "text": "und noch den json response im gleichen request also das das funktioniert nicht also wir müssen"}, {"id": 764, "start": 6044.38, "end": 6051.34, "text": "es wahrscheinlich so machen dass wir das quasi das starten und du in dem zweiten in dem zweiten"}, {"id": 765, "start": 6051.34, "end": 6058.02, "text": "request dann deine results abrufst im endeffekt klar du kannst es ich sehe es bei den chat"}, {"id": 766, "start": 6058.02, "end": 6065.98, "text": "theoretisch die embells in den response header packen das könnte funktionieren ich weiß"}, {"id": 767, "start": 6065.98, "end": 6069.78, "text": "nicht ob ich die header darf ich dir das probiere ich jetzt mal aus ob ich die header anpassen"}, {"id": 768, "start": 6069.78, "end": 6075.78, "text": "darf wenn ich den response schon gestartet habe ich könnte mir vorstellen dass das auch"}, {"id": 769, "start": 6075.78, "end": 6081.34, "text": "dass das nicht ich also ich weiß nicht wie das bei c sharp ist ich meine bei javas spring"}, {"id": 770, "start": 6081.34, "end": 6086.74, "text": "boot kann es im endeffekt einfachen response objekt zurückgegeben und da die headers anpassen"}, {"id": 771, "start": 6086.74, "end": 6090.54, "text": "ich weiß nicht wie das das geht das kann ich ja auch mal aber ich bin mir nicht sicher"}, {"id": 772, "start": 6090.54, "end": 6096.46, "text": "ob ich in die response was reinschreiben darf nachdem ich vorher schon 20 mb bytes reingeschrieben"}, {"id": 773, "start": 6096.46, "end": 6101.14, "text": "habe ich weiß halt nicht wie ich glaube ich glaube nicht dass das dass das funktioniert"}, {"id": 774, "start": 6101.14, "end": 6106.14, "text": "bei x header x header denken wir denken uns was eigenes aus ich glaube aber nicht dass"}, {"id": 775, "start": 6106.14, "end": 6113.82, "text": "es funktioniert x header kann speed champ so value moment wie macht man das überhaupt"}, {"id": 776, "start": 6113.82, "end": 6124.46, "text": "string value testweise machen wir da 2000 rein da das funktioniert nicht probierst mal aus"}, {"id": 777, "start": 6124.46, "end": 6130.86, "text": "top da müssen wir uns was anderes ausdenken nope ah ne moment ich geb hier unten den kram"}, {"id": 778, "start": 6130.86, "end": 6141.66, "text": "noch zurück machen wir das weg und also es ist halt wie gesagt die frage wie das da genau"}, {"id": 779, "start": 6141.66, "end": 6147.14, "text": "gehandelt wird erst header dann body andersrum gehts nicht dachte der chat ja gut aber erst"}, {"id": 780, "start": 6147.14, "end": 6150.98, "text": "header geht ja nicht weil erst header da kann ich kann ja nicht was setzen wo ich noch nicht"}, {"id": 781, "start": 6150.98, "end": 6156.78, "text": "weiß was rauskommt ne funktioniert nicht also der ich darf da nicht reinschreiben sobald"}, {"id": 782, "start": 6156.78, "end": 6167.02, "text": "schon begonnen habe ich weiß halt nicht wie das bei c sharp geregelt ist weil du ja ich"}, {"id": 783, "start": 6167.02, "end": 6171.18, "text": "glaube das also von der idee her kann das ja gar nicht funktionieren dass was der hier"}, {"id": 784, "start": 6171.18, "end": 6177.38, "text": "macht ist mit body right das ist ja unter umgehung jeglicher framework logik schreibt"}, {"id": 785, "start": 6177.38, "end": 6184.58, "text": "er in den in den in den htp request stream einfach seine 22 20 m bit rein das heißt"}, {"id": 786, "start": 6184.58, "end": 6190.46, "text": "sein browser sieht sind 20 m bits und dann würden irgendwelche htp header folgen was"}, {"id": 787, "start": 6190.46, "end": 6196.18, "text": "ja überhaupt keinen sinn ergibt an sich an sich ja an sich ja im endeffekt dann müsste"}, {"id": 788, "start": 6196.18, "end": 6200.74, "text": "man als einfach so machen dass du nur den body zurückschickst und ich die zeit stoppe"}, {"id": 789, "start": 6200.74, "end": 6206.62, "text": "ja dann das heißt also das wäre jetzt so die erste lösung die man angehen genau ich schicke"}, {"id": 790, "start": 6206.62, "end": 6209.5, "text": "nur den body zurück und da kannst du ja die zeit schon mal reinschreiben das ist dann"}, {"id": 791, "start": 6209.5, "end": 6214.14, "text": "natürlich nicht schiedsicher aber dann machen das das nächste mal so wir machen dann wirklich"}, {"id": 792, "start": 6214.14, "end": 6221.7, "text": "so eine art mess session auf und du rufst dir dann einfach die ergebnisse mit einem"}, {"id": 793, "start": 6221.7, "end": 6226.02, "text": "dritten request am ende ab oder drin steht das können wir dann als nächstes machen"}, {"id": 794, "start": 6226.02, "end": 6234.02, "text": "dann haben wir das jetzt so ich gebe ich gebe nur den ich lese einfach nur ich schreibe"}, {"id": 795, "start": 6234.02, "end": 6239.94, "text": "einfach nur raus sonst nix das müsste jetzt aber auch funktionieren ja das funktioniert"}, {"id": 796, "start": 6239.94, "end": 6246.86, "text": "ok wenn ich das jetzt mal pushen dann kann man das ausprobieren dann habe ich hunger"}, {"id": 797, "start": 6246.86, "end": 6257.34, "text": "implement ich kann nicht mehr schreiben mal das heißt im endeffekt was ich jetzt mache"}, {"id": 798, "start": 6257.34, "end": 6264.34, "text": "bei post ich meine ich mache es nicht zeitgleich du hast jetzt einmal slash up und einmal slash"}, {"id": 799, "start": 6264.34, "end": 6266.34, "text": "down ich habe slash up und slash down ja slash up hat sich nix geändert dran ist genauso"}, {"id": 800, "start": 6266.34, "end": 6273.94, "text": "wie vorher und jetzt gibt es halt noch slash down da kriegst du aber nix zurück das sind"}, {"id": 801, "start": 6273.94, "end": 6297.78, "text": "get requests genau ja da wir kommen da bestimmt auch eine bessere bessere idee der chat sagt"}, {"id": 802, "start": 6297.78, "end": 6302.94, "text": "auch schon macht über web sockets macht über web rtc nebenbei jaja über machen wir uns"}, {"id": 803, "start": 6302.94, "end": 6307.14, "text": "über alles gedanken wenn über web sockets ist keine schlechte idee könnte man könnte"}, {"id": 804, "start": 6307.14, "end": 6313.06, "text": "man schon auch machen dann ist das so ein bisschen unabhängig davon aber das kann"}, {"id": 805, "start": 6313.06, "end": 6318.46, "text": "man ausprobieren haben wir haben wir das stimmt das ist ein cooles projekt mehr das ist an"}, {"id": 806, "start": 6318.46, "end": 6324.22, "text": "sich übersichtlich genug dass man da jetzt nicht komplett ja so den durchblick verliert"}, {"id": 807, "start": 6324.22, "end": 6328.3, "text": "da kann man auch mal zwei drei wochen nix machen und ja blickt immer noch durch und"}, {"id": 808, "start": 6328.3, "end": 6332.3, "text": "es ist insofern auch überschaubar dass man im stream mitkommt das eigentlich optimales"}, {"id": 809, "start": 6332.3, "end": 6356.66, "text": "streamprojekt hier das stimmt an sich schon das ist ja im endeffekt egal die duration"}, {"id": 810, "start": 6356.66, "end": 6362.78, "text": "kurz gucken was forder vorhin geschrieben hat weil ich habe ihnen gesagt sie sollen"}, {"id": 811, "start": 6362.78, "end": 6371.86, "text": "jetzt bloß nicht mein modem noch mal neu starten oder sowas sind die ab und down fahre"}, {"id": 812, "start": 6371.86, "end": 6379.82, "text": "schon online moin noch mal ich jetzt kann ich das gleich mal testen der spam hat übrigens"}, {"id": 813, "start": 6379.82, "end": 6387.38, "text": "nachgelassen das hätte ich nicht sagen soll ich hätte einfach zur kenntnis nehmen sollen"}, {"id": 814, "start": 6387.38, "end": 6410.7, "text": "gut wäre okay ich habe es wieder gestartet müsste jetzt da sein alles mein download"}, {"id": 815, "start": 6410.7, "end": 6419.9, "text": "werde da noch nicht probieren mal kurz von mir aus aus ob das mit down slash down ist"}, {"id": 816, "start": 6419.9, "end": 6429.5, "text": "es nicht nicht nicht ja ja also der request der request geht durch okay aber aber aber"}, {"id": 817, "start": 6429.5, "end": 6441.38, "text": "ich kriege noch keinen ja genau request funktionieren schau mal hier stack overflow"}, {"id": 818, "start": 6441.38, "end": 6462.7, "text": "ja gut klar das kann man machen wenn ich nicht die eingebaute controller logik benutze"}, {"id": 819, "start": 6462.7, "end": 6466.94, "text": "sondern was eigenes basteln dann klar kann mich ja keiner daran hindern da reinzuschreiben"}, {"id": 820, "start": 6466.94, "end": 6473.74, "text": "was ich will aber ich will es jetzt das nicht total verbiegen würde für das das kriegen"}, {"id": 821, "start": 6473.74, "end": 6484.66, "text": "wir hin ich glaube uns fällt da schon noch was gutes ein ja ich hoffe mein mbit umrechnen"}, {"id": 822, "start": 6484.66, "end": 6511.54, "text": "funktioniert ich probiere gerade noch mal aus upload upload"}, {"id": 823, "start": 6511.54, "end": 6523.58, "text": "34 passt die cool aus chat mein die upload rechnung ist kaputt bei mir ist alles gut"}, {"id": 824, "start": 6523.58, "end": 6531.06, "text": "34 mbit das ist ziemlich dementsprechend was ich auch habe schau mal im browser ach ist"}, {"id": 825, "start": 6531.06, "end": 6538.9, "text": "der upload im browser kaputt okay das kann sein guck mal ach so der ist tatsächlich kaputt"}, {"id": 826, "start": 6538.9, "end": 6546.06, "text": "na gut im browser ist klar dass es nicht funktioniert kann er nicht funktionieren kann er nicht"}, {"id": 827, "start": 6546.06, "end": 6567.02, "text": "funktionieren falsche uhr also die freundin von java script aber auf der anderen seite"}, {"id": 828, "start": 6567.02, "end": 6571.74, "text": "hey ich bin ich bin ich bin immer noch da also ich habe ja früher javascript geflamed"}, {"id": 829, "start": 6571.74, "end": 6576.38, "text": "immer ja aber mittlerweile ist das schon ganz nett man kann aber wirklich gut was mit machen"}, {"id": 830, "start": 6576.38, "end": 6601.46, "text": "das stimmt erstmal github issue aufmachen die leute lasst mal github issues in ruhe wir"}, {"id": 831, "start": 6601.46, "end": 6618.14, "text": "haben schon genug auch wir haben welche geschlossen perfekt macht spaß einmal profis zuzuschauen"}, {"id": 832, "start": 6618.14, "end": 6630.14, "text": "nicht sicher ob ob ich habe ich habe meine 20 ich habe meine 20 mb test datei geerdet"}, {"id": 833, "start": 6630.14, "end": 6641.22, "text": "oder hast du die aus versehen geerdet aber ich weiß nicht ob das warst du das 20 mb"}, {"id": 834, "start": 6641.22, "end": 6647.62, "text": "das datei geerdet naja gibts schlimmeres da haben wir halt 20 mb nullen im repo drin"}, {"id": 835, "start": 6647.62, "end": 6658.26, "text": "das darf ja aber keinem guten repo fehlen sag ich immer so ich push das jetzt mal ich"}, {"id": 836, "start": 6658.26, "end": 6664.1, "text": "weiß aber nicht ob das so korrekt ist weil bei mir werden sehr unterirdische werte angezeigt"}, {"id": 837, "start": 6664.1, "end": 6670.38, "text": "probier mal aus sag sag wenn ich testen soll ich push das jetzt mach ich mach schon mal"}, {"id": 838, "start": 6670.38, "end": 6675.94, "text": "den alten krempel aus wann implementiert ihr blockchain alter der witz hat so einen bad"}, {"id": 839, "start": 6675.94, "end": 6692.7, "text": "mittlerweile du bist da 50 oder so der den gebracht hat ich will ein jira board dann"}, {"id": 840, "start": 6692.7, "end": 6700.46, "text": "mach legt auf dir dein jira board sorg dafür dass wir hier so es gibt es gibt auch bestimmt"}, {"id": 841, "start": 6700.46, "end": 6706.38, "text": "irgendwelche agilitätswettbewerbe oder so dann melden wir uns einfach für andermit"}, {"id": 842, "start": 6706.38, "end": 6711.98, "text": "mit dem projekt ja man ja certified agile professionell oder sowas oh nein ich glaube"}, {"id": 843, "start": 6711.98, "end": 6719.5, "text": "ich mache jetzt aus versehen merch oder so der fragt dich jetzt du hast gepullt und"}, {"id": 844, "start": 6719.5, "end": 6726.86, "text": "schon committed so vorher bei dir ne ne ich hab nicht gepullt ich hab es auch schon gepusht"}, {"id": 845, "start": 6726.86, "end": 6732.06, "text": "aber es passt du kannst falls du es nicht kennst du kannst wenn du wenn du pulst dann"}, {"id": 846, "start": 6732.06, "end": 6735.78, "text": "sagt er ja wenn du wenn sich lokal was geändert hat und remote geändert hat dann fragt er"}, {"id": 847, "start": 6735.78, "end": 6740.5, "text": "dich ob du es rein merken willst lokal du kannst sagen gett pull minus minus rebase"}, {"id": 848, "start": 6740.5, "end": 6745.66, "text": "dann macht er die änderung von remote und dann deins obendrauf ohne merch okay okay"}, {"id": 849, "start": 6745.66, "end": 6750.1, "text": "das kenne ich das nicht so hatte ich gerade nicht im kopf wunderbar ich mache den ganzen"}, {"id": 850, "start": 6750.1, "end": 6757.46, "text": "tag irgendwie irgendwelche gett geschichten es ist aber noch nicht da meins ist das letzte"}, {"id": 851, "start": 6757.46, "end": 6763.42, "text": "implement download so genau also ich habe jetzt deins ist quasi wieder on top aber meine"}, {"id": 852, "start": 6763.42, "end": 6772.98, "text": "änderung sollten als auch mit drin sein mit dem ww root okay ist das in dumm drin oder"}, {"id": 853, "start": 6772.98, "end": 6779.54, "text": "was ne das also ich habe kommet ich habe kommet von dir ich habe kommet von dir dumm und implement"}, {"id": 854, "start": 6779.54, "end": 6788.3, "text": "download von mir dann letzt moment moment warum ich habe wieder die hälfte vergessen alles klar"}, {"id": 855, "start": 6788.3, "end": 6795.18, "text": "ich habe nur update gemacht und nicht gepullt alles klar hier ist es okay sehr schön dann"}, {"id": 856, "start": 6795.18, "end": 6802.82, "text": "genau das mal release und gucken wir mal ob das funktioniert gibt schon ein fork ja tut euch kein"}, {"id": 857, "start": 6802.82, "end": 6811.06, "text": "zwang an leute folgt folgt was das zeug hält okay es läuft wieder ich mache an und jetzt"}, {"id": 858, "start": 6811.06, "end": 6819.74, "text": "machen wir erst mal speedchamp starten doch die download also was ich noch implement was ich"}, {"id": 859, "start": 6819.74, "end": 6825.42, "text": "noch implementieren muss ist dass ich das reside berücksichtige das ist jetzt noch nicht drin aber"}, {"id": 860, "start": 6825.42, "end": 6833.58, "text": "selbst jetzt ist es halt sehr weit entfernt stimmt nicht beim download so also beim upload stimmt"}, {"id": 861, "start": 6833.58, "end": 6839.06, "text": "bei mir auch gerade nicht der download nah das also der upload ist vorher gut vorher hat er"}, {"id": 862, "start": 6839.06, "end": 6844.66, "text": "ziemlich gut hingehauen jetzt ist es die hälfte von dem von dem eigentlichen upload und download"}, {"id": 863, "start": 6844.66, "end": 6851.74, "text": "ist halt auch komplett komplett verkehrt kann das sein kann das sein dass der zu viel lockt"}, {"id": 864, "start": 6851.74, "end": 6862.74, "text": "oder so viel ist das gar nicht 20 m 20 m bit zum download ist zu gering ja aber der upload"}, {"id": 865, "start": 6862.74, "end": 6869.9, "text": "stimmt auch nicht hast du irgendwas am upload jetzt gemacht an dem code hinter dem upload"}, {"id": 866, "start": 6869.9, "end": 6875.9, "text": "ne oder gar nicht gar nicht äh warum warum haben wir ah der macht gleichzeitig upload und download"}, {"id": 867, "start": 6875.9, "end": 6882.14, "text": "jetzt nein halt stopp eigentlich habe ich da ein await reingehauen ne macht er auch nicht macht"}, {"id": 868, "start": 6882.14, "end": 6890.54, "text": "er auch nicht macht er auch nicht eben macht er nicht dann weiß ich nicht aber je öfter ich"}, {"id": 869, "start": 6890.54, "end": 6898.3, "text": "das mache das besser deswegen wird wahrscheinlich schon beim download auf jeden fall an der geringen"}, {"id": 870, "start": 6898.3, "end": 6903.14, "text": "datei größe liegen wahrscheinlich ja das kann sein das kann sein ich kann es ja noch"}, {"id": 871, "start": 6903.14, "end": 6907.94, "text": "mal bei mir lokal testen aber warte mal was sagt er denn bei mir wenn ich wenn ich das hier in"}, {"id": 872, "start": 6907.94, "end": 6913.1, "text": "der kommando zeile mache ich sehe es jetzt natürlich wieder nicht weil gespammt wird es fack"}, {"id": 873, "start": 6913.1, "end": 6940.42, "text": "das müssen wir dann mal in ruhe erforschen so nächsten strich absolut absolut macht jetzt"}, {"id": 874, "start": 6940.42, "end": 6947.66, "text": "hier upload ganz schön lang ich glaube ich glaube mal ich glaube das ist bei mir"}, {"id": 875, "start": 6947.66, "end": 6956.22, "text": "kann wirklich einfach langsamer es gibt keine output dat in dem ordner wo ich bin"}, {"id": 876, "start": 6956.22, "end": 6972.54, "text": "jetzt geht bei mir ist noch da ja ok ich dachte das mal eben mal doch aber warum dauert das jetzt"}, {"id": 877, "start": 6972.54, "end": 6982.7, "text": "so lang wahrscheinlich wahrscheinlich sind alle wie verrückt am spam aber maybe maybe aber was"}, {"id": 878, "start": 6982.7, "end": 6989.3, "text": "man sagen kann es funktioniert halbwegs die selber ist selber ist nicht da und aber so was"}, {"id": 879, "start": 6989.3, "end": 6994.02, "text": "gekrascht ich glaube das war zu viele leute also nicht anwenden anwendung ist gekrascht"}, {"id": 880, "start": 6994.02, "end": 6999.58, "text": "schau mal in die hetsner grafen ja moment moment ich guck mal krieg gleich krieg gleich einen"}, {"id": 881, "start": 6999.58, "end": 7006.18, "text": "gleichen anruf aus naja naja nee geht eigentlich geht eigentlich guck mal wir haben hier in out"}, {"id": 882, "start": 7006.18, "end": 7014.18, "text": "ungefähr gleich viel 60 60 mb die sekunden 60 mb die sekunde das ist jetzt ja also geht"}, {"id": 883, "start": 7014.18, "end": 7032.74, "text": "ja eigentlich so ich habe neu gestartet mal gucken dass irgendwas bringt upload 31 ok jetzt"}, {"id": 884, "start": 7032.74, "end": 7038.22, "text": "blick ich nicht mal durch das jetzt jetzt noch 31 kommt auch in 31 mit jetzt testen wir im frontend"}, {"id": 885, "start": 7038.22, "end": 7047.58, "text": "es stimmt nicht und vorne nicht es stimmt hinten noch ich komme jetzt auf 30 m bits ich auch im"}, {"id": 886, "start": 7047.58, "end": 7056.9, "text": "download ok ich würde sagen das müssen wir uns dann am nächsten auch mal anschauen dass"}, {"id": 887, "start": 7056.9, "end": 7064.7, "text": "ich dachte ans nächsten stream machen wir so ich mache da einen basic aus davor dass nur wir beide"}, {"id": 888, "start": 7064.7, "end": 7074.74, "text": "mit dem mit log in drauf kommen weil das sind das sind gut geht er geht er so nicht stopp ich"}, {"id": 889, "start": 7074.74, "end": 7080.66, "text": "nehme ich den server jetzt da hat sich ausgespammt vielleicht passt das threading im back end nicht"}, {"id": 890, "start": 7080.66, "end": 7087.26, "text": "nur das macht das kann das kann asp.net eigentlich ganz dort net core eigentlich ganz gut muss da"}, {"id": 891, "start": 7087.26, "end": 7098.14, "text": "nichts machen gut ich mach mal mach mal den server aus hat sich jetzt genug gespammt und ich kann"}, {"id": 892, "start": 7098.14, "end": 7102.34, "text": "mich auch ich kann mich auch nicht mehr richtig konzentrieren aber wir haben trotzdem ich habe"}, {"id": 893, "start": 7102.34, "end": 7107.3, "text": "noch mal gefragt wo ich mich gemütet habe heute es fanden alle gut nochmal frage so kann man bei"}, {"id": 894, "start": 7107.3, "end": 7113.46, "text": "den bei den anderen bei dir auf dem channel an die leute wie hat es euch gefallen ich hoffe"}, {"id": 895, "start": 7113.46, "end": 7120.54, "text": "euch ich hoffe euch jetzt auch total ehrlich bleiben werden eigentlich weitere folgen von"}, {"id": 896, "start": 7120.54, "end": 7126.3, "text": "IT Security kommen bei mir werden auf jeden fall noch weitere folgen von IT Security kommen"}, {"id": 897, "start": 7126.3, "end": 7134.1, "text": "muss mir noch erst mal auseinandersetzen was als nächstes kommt wissen wir schon wann es weitergeht"}, {"id": 898, "start": 7134.1, "end": 7143.14, "text": "das doch nicht so nicht so wirklich nee wenn es halt passt wahrscheinlich unter unter der"}, {"id": 899, "start": 7143.14, "end": 7146.94, "text": "woche eher nicht weil das geht bei uns ja beiden dann nur nachmittags und wenn du den tag schon"}, {"id": 900, "start": 7146.94, "end": 7150.82, "text": "über irgendwelche sachen in der richtung gemacht hast dass da abends jetzt auch nicht unbedingt"}, {"id": 901, "start": 7150.82, "end": 7155.5, "text": "noch dreieinhalb stunden programmierkram zu machen vor allem da muss man sich auch hier"}, {"id": 902, "start": 7155.5, "end": 7159.98, "text": "wirklich ein bisschen konzentrieren und machen und tun deswegen würde ich eher sagen was was"}, {"id": 903, "start": 7159.98, "end": 7169.46, "text": "irgendwas in richtung wochenende oder feiertag oder urlaub oder so genau ja wir ja gucken hat"}, {"id": 904, "start": 7169.46, "end": 7173.98, "text": "mir auf jeden fall wirklich viel spaß gemacht war eine richtig coole geschichte und leute"}, {"id": 905, "start": 7173.98, "end": 7183.26, "text": "mal guck mal beim neu vorbei ich poste noch mal kurz dein youtube link jetzt könnt ihr alle"}, {"id": 906, "start": 7183.26, "end": 7187.94, "text": "mal vorbei gucken wer es nämlich noch nicht gesehen hat wir haben da anfang des jahres auch"}, {"id": 907, "start": 7187.94, "end": 7194.9, "text": "mal ein video zusammen gemacht wo es um die physio ausbildung ging und zwar im januar oder"}, {"id": 908, "start": 7194.9, "end": 7204.02, "text": "so vor drei monaten ja schon im märz märz ist schon ein bisschen hin aber könnt ihr euch mal"}, {"id": 909, "start": 7204.02, "end": 7209.22, "text": "angucken wenn ihr es noch nicht gesehen habt und wir sagen mal schluss oder man ist dass so viele"}, {"id": 910, "start": 7209.22, "end": 7213.66, "text": "dabei waren auf jeden fall auf jeden fall und gerade mal schnell ob ich den hausen kann"}, {"id": 911, "start": 7213.66, "end": 7223.3, "text": "aber sehr nice also super geschichte und wir machen auf jeden fall weiter jetzt so wir wissen"}, {"id": 912, "start": 7223.3, "end": 7232.5, "text": "bloß nicht genau wann wann genau okay dann würde ich sagen ich mach stream aus bis zum"}, {"id": 913, "start": 7232.5, "end": 7244.5, "text": "nächsten mal macht's gut ja auch ja drei und ich muss noch in den hohen den lost rain point rate"}, {"id": 914, "start": 7244.5, "end": 7247.7, "text": "klar bin gleich gleich aus"}, {"id": 915, "start": 7247.7, "end": 7261.62, "text": "was rate dachten alles klar"}]}