{"text": "Das war's für heute. Vielen Dank für's Zuhören und bis zum nächsten Mal.So, da bin ich wieder. Ich hab euch gesagt, heute Abend gibt's noch maleinen kleinen Stream, aber aus 69 Zuschauer. Huge. Ich mal gucken, wie lange wir dafürbrauchen. Also ich hab mir ein Video von Microsoft eingeschaut. Ich glaube, so viel gibt's danicht zu gucken im ersten Preview. Aber probieren wir mal aus. Erstmal das ganz bisschen kleinermachen. Ich hab grad gefuttert, Leute. Ich bin mega voll gefressen. Ich hab heute Mittagschon so viel gefuttert und heute Abend jetzt noch mal. Heute hab ich Garantie nicht abgenommen.Ich weiß nicht, ob wir wirklich Windows 11 nehmen sollen. Wir können das mal ausprobieren.Wir gucken mal, ob das unter Windows 11 läuft. Probieren wir mal aus. Zweifelsfall habenwir hier noch ein anderes Windows. Windows 11. Warum hab ich da Steam installiert? Ach,das war die WinGet-Testkiste. Läuft bestimmt, denke ich auch. Denke ich auch, dass das läuft.Also, ich zeige euch mal was, Leute. Und zwar, es gibt jetzt seit gestern gibt es eine oderseit vorgestern eine Preview-Version von Wishlist Studio 2022. Ich persönlich verwende ja schoneine ganze Weile kein Wishlist Studio mehr, weil ich bin komplett auf Linux als Hauptplattformund Rider als, also fürs Programmieren und Rider als IDE umgestiegen, was dort Netz-Sachenangeht. Übrigens, das Video von Microsoft für die 2022er Preview ist richtig schlecht.Guckt euch das mal an. 22 Sekunden YouTube-Video ohne Sound, ohne alles. 64bit ist es angeblichjetzt. Es gibt irgendwie ein neuer Intelli-Code. Ich weiß nicht, warum es Intelli-Code ist.Früher hat sich das Ganze IntelliSense genannt, aber wahrscheinlich hat sich Microsoft gedacht,IntelliSense ist einfach zu oldschool. IntelliCode mit AI-powered Completion ist viel besser.Warum auch immer, also ich habe den Vorteil noch nicht so genau erkannt von AI-Code-Completion.Ich weiß, es gibt ein paar Ansätze. Es gibt ein paar Ansätze dafür. Aber ja, man hat AI-Dev-Verbrauch,ich weiß nicht. Also die Sachen zu sortieren und die Möglichkeit zu bieten, zu sortierennach was am meisten benutzt wird, ist ja vollkommen in Ordnung. Aber dass das jetzt irgendwiekontextbasiert wüsste, was ich als nächstes programmieren will, da habe ich noch so meineZweifel, ja. So, es ist möglich, dass man jetzt.NET 6 und.NET Maui drin direkt programmiert.Weiß nicht, ob man ausprobieren kann. Ich glaube auch nicht, dass es schon drinne ist.Zumindest, ich persönlich bin eh nicht sonderlich scharf auf.NET Maui, weiß nicht, mal gucken.DakuX-TV, danke schön für 18 Monate Subscription. Excellent Hyper-Subscription. Neo-Wim-Only,also man kann ja, ich mag ja Wim. Aber für.NET-Entwicklung genauso wie für Java-Entwicklungoder sowas ist Wim kacke. Die trockene Luft von der Klimaanlage sackt, aber dafür istes wenigstens schön kühle 23,8 Grad hier. Was ist.NET-Maui? Der Versuch von Microsofteine Cross-Platform GUI-Framework zu basteln, was lustigerweise nicht Cross-Platform ist,weil es nicht auf Linus läuft. Und leider, und leider, meiner Meinung nach auch den falschenAnsatz verfolgt. Platter macht es richtig, macht es richtig, Maui unter Forksamarin war,ist meiner Ansicht nach der falsche Ansatz. Noch eine GUI-Framework von MS, ja, zumaldie es ja noch nicht, die man unter Windows geschissen kriegen. So, ich, ich starte dasDing mal neu. Ihh, das ist so hässlich mit die, warte mal, wie, Moment, wie, wie restartetman das jetzt überhaupt? Leute, es gibt Updates für Windows 11, soll ich die installierenoder prickt es mir das System? Boards Jam? Äh, Update, da steht doch immer da, was esfür Updates gibt, oder? Das Kumulativ-Update für.NET, für Windows 10 Version Next. Ichhab doch gesagt letztens, ich hab letztens noch gesagt, das sieht aus wie Windows 10X und Windows 10 zusammengemercht und das ist es anscheinend auch. Exposed Microsoft,ja gut, Update & Restart, wollen wir mal nicht so sein. Snapshot, Snapshot ist für Noobs,YOLO-Update. Wenn nicht, ich hab ja noch ein Windows 11 VM, in dem wir es probieren können.Also, ich werde es mir nicht auf meinem Desktop installieren, weil es garantiert wird irgendwiegedürnt installiert, was ich nicht haben will. Macht das in der VM und gut ist. Bill hatGit Merge gemacht. Ich glaube Bill hat gerade Probleme, mit Merge hat es Bill gerade nichtso, der ist gerade dabei seine Ehe quasi zu, also das Gegenteil von Mergen, gibt es ja Forken,der forkt sein, der forkt gerade. Mergen. So, warum geht Xbox auf? What the fuck? Nein,Xbox, gehst du weg? Kann ich nur sagen, Xbox. Ok, jetzt schauen wir mal, ob man das Ganzein der Windows 11 installieren kann. Wishful Studio 2022. Nach guter Microsoft Traditionmüsst du Wishful Studio 2022 eigentlich jetzt mal rauskommen. Also zumindest FIFA, FIFAStyle technisch wäre das schon längst der Fall gewesen. Will das nicht auf Deutschladen? Kann ich das nicht auf Englisch laden? Ja, besser. Community. Jawoll, save. Ok, zeigeich mal her. Ok, das ist immer noch ein Elektron Installer. Windows 11 Wishful Studio, willkommenin der Zukunft. Ja, wir sind schon, wie sagt es, mir starft nicht? Ach ne, ne, ne, ne, ne,immer noch. Ja Leute, das ist die Zukunft hier. Nächstes Jahr sieht es für alle euch,sieht es jetzt bei euch, für alle von euch so aus. Kann nicht mal normal reden. Der Installerist mittlerweile WPF. Wirklich? So ganz funktioniert das aber nicht hier oben, oder? Also was wollenwir denn haben?.NET und Web Development? Alter Mann. Richtig, richtig thick..NET DesktopDevelopment? Wollen wir testen? Das geht eh relativ schnell im Download. Und? Muss manirgendwie Cross Platform GUI oder so? Gibt es irgendwie Cross Platform? Gab es da nichteine Cross Platform Häkchen? Gibt es nicht mehr, oder? Vergiss dir Plus Plus. Nein, nein,nein, nein, nein. Ich werde am Leben da, kannst dir Plus Plus machen. Ok, das ist wirklichein WPF Installer. Moment, Moment, das glaube ich nicht. Komm mal einen Prozess Explorer.Mal schauen, mal schauen, ob das wirklich nach WPF aussieht. Sys, Sys Internals ProzessExplorer, ja genau. Warum alle auf abgerundete Ecken stehen, ich weiß nicht. Wahrscheinlichist es denen relativ egal, die wollen einfach was anderes haben. Und die haben sich gedacht,wir hatten jetzt schon Ecken, die transparent waren und wir hatten eckige Ecken und jetztbrauchen wir runde Ecken. Ja, ich agree. So, zeig mal, hier ist der Visual Studio Installer,ist das WPF? Äh, ups, falsch rum. Ja, Setup. Ja, so wirklich erkennen tut man da nichts.Es sieht auf jeden Fall nicht so krass Browser-mäßig aus, weil Browser-technisch hätte es jetzterstmal 50 Background-Dinger, das könnte schon durchaus WPF sein. Ja, das ist tatsächlichanscheinend ein, ob es ein WPF ist, keine Ahnung, aber ein netter Ding, also wahrscheinlichein WPF. Ja, Mark Dick WPF verwenden sie. Ok, der Windows Installer ist jetzt WPF. Sachengibt es, hätt ich nicht gedacht. Die Musik ist mit zum Onkar-S, kurz skippen. Ok, früherhatten die hier was Cross-Platform, weil ich wollte, angeblich gibt es nämlich neue Tests,die man Cross-Platform laufen lassen kann, schauen wir mal. Egal, install while downloading,macht es. Das dürfte nicht allzu lange dauern, ich denke mal so 10 Minuten, wenn es hochkommt. Ihr seht, das ist ziemlich schnell. Der File Explorer von Windows 11 ist maximalePlatzverschwendung. Wieso, sieht doch eigentlich fast so aus wie der alte. Also, da ist dochso großer Unterschied ist da jetzt doch nicht, weil die Ribbons außen-vorder, aber wo istda der große Unterschied? Es ist doch mehr oder weniger genau das gleiche. Ah, da istviel Platz dazwischen, ok, das stimmt. So nicht mehr. Öffne mal einen Ort, naja, habich ja. Ah, sieht doch ok aus. Boomer-Ansicht ist das ja. Kann man das ejecten? Wow, knappam Kopf vorbei hier. Ah, PainsChamp, witzig, weiß. So, wie sieht der Installer aus? Esgeht halbwegs zack, ich click once, Bootstrapper, diese Namen von diesen Packages immer. Wisstihr was ich nicht verstehe, warum schafft es eigentlich Microsoft nicht seit Windows10 ist es glaube ich erst, keine Beispielmusik und keine Beispiel Clips und Bilder mehr mitzuliefern.Bei Windows XP hat es ja immer noch diese 8 Standardbilder, dass du wenigstens siehst,wie das ausschaut standardmäßig. Hat sich Microsoft gedacht, nee, wer braucht schonein Bildchen, haben die sich gedacht. Da letztens, wo war hier, ich glaube bei Golem, oder waswar das, habe ich einen Artikel über agile Softwareentwicklung gelesen. Was ich da witzigfand ist die, ich glaube bei Heise war es, was ich da witzig fand ist die Forumsdiskussion,warum ist das so lang. Zumindest die Forumsdiskussion war wieder lustig, wo sie sich darüber aufgeregthaben, also Entwickler wieder darüber aufgeregt haben, dass sie einen halben Tag auf irgendwelchenSprints, Scrums, Dailys, sonst wie rumstehen und dann kam irgendein Typ in den Kommentarenund meinte, ihr macht das ja auch falsch und hat dann gesagt, man soll quasi immer mitdem, wie heißt das, mit dem Scrum Handbuch oder so rumlaufen und immer nachschlagen odersowas. Ich wusste gar nicht bis zu dem Zeitpunkt, dass es einen Scrum Handbuch überhaupt gab.Agile Master Scrum Handbuch, der Scrum Guide, jawoll endlich, endlich, da wurde das, i,das ist Wörth, das ist die Fault, das ist die Fault Wörth 2007, Alter, i. Ah ja genauAlex, das meine ich, den Artikel meine ich, ja genau, genau. Ja, den meine ich. So, dannhabe ich irgendwie in den Kommentar Diskussionen einen gehabt, der hat dann erzählt, dass er,dass er immer mit dem Scrum Handbuch rumlaufen soll und sowas. Wahrscheinlich das Agile Manifest,ne, ne, ne, ne, ne, es ging um das Scrum Handbuch hier, der Scrum Guide, das ist nur für diecoolen Leute. AgileHeroes.de, die Rakete darf nicht fehlen, was sonst? Nein, ich will keinePush Notifications von euch haben. Die agilen Helden mit Rakete scheinen ja super beliebtzu sein hier. Und das ist auch äußerst beliebt auf Amazon. So, ach ne, please, ich will,ich will nicht sign innen, Microsoft, lass mich, kann ich das nicht einfach benutzenohne zu sign innen. He doesn't know, he lacks critical information. Geht das, geht das nichtauch ohne? Oh no, jawoll, perfekt. So, es erkennt schonmal nicht das Betriebssystem-Theme,das ist schonmal Fail. Warum erkennt es nicht standardmäßig, dass ich Dark-Theme habe undmach das, verwende das auch. Developer Settings, General, Visual, C-Sharp, General ist okay,das andere darfst du erst machen, wenn ich C-Sharp Projekt einstelle, alles gut. Repairing,der offizielle Post-Champ-Screen von Microsoft. So, also, jetzt müssen wir nochmal kurz indieses What's New Dokument gucken, dass wir auch wissen, was wir schauen müssen. Also,es gibt ja einmal dieses Video und es gibt ein anderes Video, was ich gefunden habe,das ist von Abild, da stellt Microsoft das ganze selbst vor. Warum, warum sind eigentlichdie Kommentare offgeturnt und warum hat das Video so schlechte Bewertung? Ah, yes, exzellentIntro. Ich glaube, 8 Minuten überleben wir noch, oder? Lass wir uns mal zeigen. Wo, wanngeht das los? Hier, ne, wann zeigt der dann was? Hallo? What the fuck? Zeigen die auchirgendwas? Ah, hier, okay. Okay, man kann Dateien schnell öffnen, das kann ich jetztnicht ausprobieren, weil ich hab kein so großes Projekt, wir können vielleicht irgendwo einsvon GitHub öffnen oder so. Was ist ein schönes großes.NET Projekt auf GitHub? So eine Solutionoder so. Fällt da irgendjemand was ein? Der Wind aus Taschenrechner ist es ja leider nicht.ShareX ist eine gute Idee, perfekt, das machen wir. Okay, also das Öffnen von großen Projektengeht jetzt schneller, alles klar. Das probieren wir tatsächlich mal aus. ShareX, GitHub, ShareX,nicht zu verwechseln mit Xshare. So, können wir das ganze mal klonen hier. Ja, perfekt.Klonen. Stimmt, jetzt können wir gleich mal was neues ausbringen, die haben doch das Windowsmit dabei, alles klar. Haben die auch Shit vorinstalliert? Nein. ShareX ist ein ScreenshotProgramm, aber wir verwenden jetzt einfach nur, dass wir eine große... Klone Repository,okay, das kann, guck mal, das kann Wishlist Studio selbst, da braucht man gar keine ShitCommand Line für das da, bam. Klonen. Guck mal, hier richtig highly advanced. Ich willnix committen. Close. So, okay, hat es das jetzt besonders schnell? Ach hier, okay, jetztgucken wir mal, wie schnell er das öffnet. Ich habe jetzt keinen Vergleich, aber malschauen. Das ist schon verhältnismäßig schnell. Das ist schon verhältnismäßig schnell. Ah,das ist noch gar nicht fertig, jetzt. Alter, was ist das denn für... Ich mag den Pressof the Wild Soundtrack nicht, ich brauche jetzt irgendwas anderes. Irgendwas... RelaxingSpring Music, okay. Ne. Ne. Pirate Music. Nope. Gamecube Nostalgik. Ah, ich weiß nicht.Ne. Try Not to Dance Challenge, okay. Wir dansen nicht. Wir pippen, wir pippen, oderCat Jammen. Okay, wunderbar. Warum geht das nicht? Hat das nicht Restored oder was? Sollteich eigentlich Abhängigkeiten mit standardmäßig runterladen? Hast du schon Windows 11 gestreamt,oder? Jaja, das ist ja hier Windows 11. Relax, Dankeschön für den Hypersubscription hier,den 18 Monate Sub. Das ist die neue Default Schriftart, die jetzt dabei ist, ne. Wie hießendas Ding nochmal? Also Lucida Console ist out, Consolas ist auch out, sondern Standard Schriftist jetzt, wenn ich das finden würde, Fonts und Colors, Standard Schrift... Alter, PuschelStudio, come on. Cascadia Mono ist es jetzt. Cascadia Mono. Microsoft hat sich gedacht,es kann nicht sein, dass JetBrains ne eigene Schrift hat, Adobe ne eigene Schrift hat,IBM ne eigene Schrift hat, Apple ne eigene Schrift hat, Google ne eigene Schrift hat.Da hat sich Microsoft gedacht, wir haben ja erst 50 eigene Schriften, wir brauchen jetztnoch eine. Das Windows 11 Logo startet uns an, kannst du das zensieren? Inwieweit starteich das an? Ist das hier zu rechteckig, zu symmetrisch, oder? Was ist denn deine Meinungzu Windows 11? Ich kann dazu noch überhaupt nichts sagen. Eins was mich zum Beispiel nervtist, dass das anscheinend die Gruppierung standardmäßig an ist. Also guckt, wenn ich jetzt hier einpaar Fenster aufmache, dann sind die standardmäßig gruppiert, das nervt mich richtig. Also dasnervt mich extrem, ich hasse diese Gruppierungen-Geschichte. Ich kann leider keine Settings machen, weilich es nicht aktiviert habe. Falls jemand irgendeinen Studentencode hat, kann er mirden ja gerne schicken und ich aktiviere schnell. Aber geht das gar nicht so. Also das Öffnenvon Projekten ging in der Tat relativ schnell. Also so ein großes Projekt hätte ich gedachtdauert länger. Windows 7 Keys, aber ich habe auch kein Windows 7 Key. Ja, das ist tatsächlichrelativ schnell. Wir können es mal vergleichen. Wir vergleichen das jetzt mal mit Ryder unterLinux. Passt mal auf, wir machen das gleiche Repo jetzt unter Linux in Ryder auf. Oh nee,schon wieder. Was war denn das noch mal das Problem, das hatten wir doch schon mal. Manmusste Log-Files entfernen oder? Man musste Log-Files irgendwie entfernen. Wie ging daseigentlich? Ich habe keine Ahnung, wie das ging. Vor allem warum dreht dieser Kack-Bugimmer noch auf? Was muss ich denn da jetzt entfernen, dass das tut? Den LCK-Ordner, woist denn hier ein LCK-Ordner, sehe ich nicht. Da hinten? Wie geht's der Katz, der geht'sgut. Seht ihr mal einen LCK-Ordner? Ach der da! Tatsächlich. Das ist echt ein Kack-Bug,dass manchmal die VMs da nicht zugreifbar sind oder zu Friesen. Pass auf, jetzt geht's.Bam! Oh, Peter Agile ist noch auf, den brauchen wir jetzt. Der ist ganz essenziell jetzt.Der muss uns nämlich zeigen, wie es geht. Ne, falsches. Falsches Emote. Also, GitHub,ShareX. Dann klonen wir das Ganze mal. Das probieren wir jetzt mal mit Rider aus. Undmal gucken, wie da der Unterschied ist. Also die VMs sind ungefähr gleich ausgestattet.Die Windows-VM hat, kann man sich das nicht anzeigen lassen, auch toll. Also die VM hierhat 4 CPU-Kerne, 16G RAM und das Windows hat glaube ich auch 4 CPU-Kerne und, hallo? Was?Please. Ach Moment, ist ja klar. Ich hab's ja da noch auf, Lul. Äh, Zack, Moment. Äh,Moment. Das, das jetzt, jetzt hab ich's, ich glaub jetzt hab ich's, jetzt hab ich's verwirrt.Oh. Oh, okay, ich glaub jetzt hab ich's verwirrt. Also, Settings und das hat auch, das hat 8G,aber der RAM wird nicht das Limitierende sein. Ganz im Ernst. Okay, vergleichen wir mal dieGeschwindigkeit. Also, das da, clone. Kann man das, kann das Rider übrigens auch, NewOcean, dass man das direkt da drin klont? Open. Äh, wahrscheinlich, ich glaub ich habdas Shit, das Shit-Plugin ausgemacht. Kann man da jetzt einfach sowas? Geht das? Nee,oder? Wenn das geht, würd ich mich echt wundern. Nee. Aber ist ja kein Problem, ich mein wirsind ja ohne Nutz, wir haben ja einfach, wir haben ja Shit, Shit-Command-Line. So, dasist ja auch nicht das, was wir testen wollen, wir wollen testen, wie schnell es sich öffnenlässt. Also, Open, Repos, dann haben wir hier irgendwie ShareX-Solution. So, mal gucken,wie schnell das jetzt geht. Also, Open und Trust. Ja, das ist schon eine ganze Ecke langsamer.Read me? What the f- Ein bisschen langsamer, aber es ist jetzt nicht so, als hätt ich damitein großartiges Problem, ehrlich gesagt. Geht auch, geht auch. Also, ich kann mit beidemleben, ja. Übrigens, warum das so broken ist, ist weil es ein.NET Framework Projektist. Okay, ich kann mit beidem leben, ist in Ordnung. Es ist aber wahrscheinlich deutlichschneller als Visual Studio 2000. Können wir auch nochmal vergleichen? Ich hab's dochhier, ich hab's doch hier drauf. Da muss ich das bloß hier mal klonen mit. Probieren wirdas hier auch nochmal aus. So, jetzt haben wir es wirklich überall, haben wir hier gelandet.Jetzt haben wir wirklich das überall ausprobiert. Jetzt kommt Visual Studio 2019, aber das istdas ganz aktuelle Visual Studio 2019, was ich installiert hab. Ich hab das erst vordrei Tagen oder so updated. Also, jetzt haben wir hier Share. Okay, mal gucken, wie schnelles jetzt damit aufgeht. Ja, okay, das ist schon, das ist, das ist, das ist ne ganze Eckelangsamer. Wobei. Naja, okay, soll ich mal ehrlich sein, Leute, ich merke keinen Unterschied.What the fuck, warum singen da jetzt Leute? Also, ich benutze für, für.NET, mittlerweilebin ich nur noch unter Linux und Rider unterwegs. Seit den letzten paar Jahren. Das funktioniertecht gut. So, also, jetzt bin ich echt überfragt. Ich finde, das öffnet sich überall gleichschnell, auch wenn es jetzt deutlich schneller sein soll. Eventuell. Ich kann das jetzt echt,also. Okay, es ist vielleicht minimal schneller im neuen. Aber ganz im Ernst so. Also, nee,also großen Unterschied macht es echt nicht. Ist dort nicht universell einsetzbar,.NET10 Stunden. Wie Musik? Ja, Moment, das ist nur das, das ist nur das, das einschaltenMusik. Na, das ist ein bisschen zu heftig. Jetzt kommt wieder der eine Kerl im Chat,der sagt Bei diesem Song haben sich meine Eltern kennengelernt. Nee, das hören wirnicht. 10 Stunden. Nee, das halte ich nicht aus. 10 Stunden. Das ist Mario Galaxy. So,also weiter im Text von der wahnsinnigen, vom wahnsinnigen Geschwindigkeitsboost habeich jetzt noch nichts gemerkt. Alles klar. So, was gibt es denn sonst noch Neues? Lohntder Lizenzpreis für Rider anstatt die Free Variante? Ob sich der Lizenzpreis lohnt odernicht, stellt sich gar nicht. Wenn du es unter Linux ordentlich.NET programmierenwillst, musst du dir Rider holen, weil Visual Studio Code suckt für.NET, finde ich jetzt.Ist nicht schön. Ich meine, wenn du Rider nicht kaufen willst, gibt es auch die Möglichkeit,du verwendest die Trial, aber die Trial ist offiziell ja nur 30 Tage. Offiziell. Ichmeine, wenn du ein bisschen rumsuchst, findest du ja vielleicht Möglichkeiten. Diese Trial,ne? Aber natürlich kaufen wir immer offizielle Lizenzen. Alle 30 Tage eine neue VM. Na gut,das ist die Noob Variante. Okay, also was ist denn jetzt sonst noch Neues? Zeig malher. Ja, also was ist sonst noch neu? Okay, es ist viel schneller beim Öffnen. Was zumTeufel öffnen die da? Moment, sind das Sekunden? Ja, das sind Sekunden. Aber so ein großerUnterschied war das jetzt bei mir nicht. Ach, Moment, Moment, Moment. Open, der Typ öffnet1600 Projekte. Okay, das habe ich nicht ausprobiert, aber was zum Teufel ist das dann für ne Solutionmit 1600 Projekten drin? Was haben die denn da? Ist das der Windows 11 oder wie? Also1600 Projekte, da kann ich wirklich ne Runde weird champen zu. Visual Studio Code kanndas nicht sein. Das ist JavaScript. Okay, die haben das genommen einfach, dass man sieht,dass es schneller ist, nicht, dass es wirklich irgendwie merklich, merklich schneller ist.Die haben irgendwas gebraucht, wo man es wirklich sieht. Und wenn du so riesige Projekte brauchst,dann ist es nice to have, aber jetzt nichts umwerfend Neues. Visual Studio Code ist TypeScript,das macht überhaupt keinen Unterschied. Ja. Okay, weiter. Ich habe das Gefühl, das sind8 Minuten Video und die zeigen überhaupt nichts. Ah, jetzt kommt die neue Code Completion,okay. Hat er nur einen guten Green Screen oder sieht das echt bei dem hinter dem soaus? Weil das sieht aus, als sitzt er in seiner Garage gerade. Aber der Green Screen ist erstaunlich,erstaunlich, erstaunlich gut, wenn es ein Green Screen ist. Das erinnert mich an Fischshell.Whole Line Completion. Okay, das probieren wir gleich mal aus. Aber ob Visual Studiowirklich weiß, wie ich weiter programmieren will, ich bin da immer noch skeptisch drauf.Die benutzen alle Dark Mode, aber für die Präsentation immer Light Mode. Das ist cool,ich habe aber meine Zweifel, dass das sinnvolle Completions sind. Ich kann das nicht, aberich hätte die Idee für so einen Hacker Science Fiction Thriller gerade. Der sagt ja, dieAI ist quasi über alle.NET Projekte in GitHub drüber gegangen, um es jetzt mal ein bisschenzu umschreiben und hat gelernt, wie so einen ASP.NET Controller auszusehen hat. Überlegteuch mal, man könnte eine richtig geile Story draus basteln. Die AI hat gelernt, wie soein Controller aussehen muss und die AI schlägt jetzt, was war das für ein Sound? Und dieAI schlägt jetzt Sachen vor, allerdings die Sachen, die sie gelernt hat, ist eine Insecurity,ist irgendein Bug drinne. Und du hast auf einen Schlag, hast du 100.000 Software Projekte,die angreifbar sind über das Gleiche, weil die AI das Falsche vorschlägt. Und die Leutecopypasten ja nur noch, kann ja keiner mehr ordentlich programmieren. Dann hast du Probleme.Very impressive stuff. Very impressive. Ich finde das immer geil, wenn die sich rechtgeben an diesen Präsentationen. Very impressive stuff. Yes, yes, very impressive, huge impressivestuff. Jetzt fehlt bloß noch, dass er sagt, it's like magic oder sowas. Sag nicht magic.Cool and can save me a lot of time. Also a little scary. So and it looks like magic when it'shappening in real life. Manche Sachen sind einfach total obvious, dass die kommen müssen.So just to know that there's all this AI and training going on behind the scenes is reallycool. I mean, it really looks like magic. Okay, es kann sein, dass sie das vorher schongesagt haben und ich deswegen gedacht habe, das kommt jetzt. So is there anything elsethat that developers should know about and why they should immediately hit download whenpreview one does get released? Yeah, let's just jump straight into the next demo here.It's about a simple test project that I have where das habe ich gelesen, das habe ich gelesen,da bin ich mal gespannt, ob man das ausprobieren kann. Man kann jetzt angeblich, wenn man Testshat und die irgendwie in irgendeiner Art und Weise markiert sind, mit wo man die ausführenwill, kann man jetzt wohl in Visual Studio Code sagen, dass man die in Docker laufenlassen will unter Linux testen und sowas. Muss ich gleich mal gucken, also wie auch immerdas funktioniert. Das habe ich gelesen, das finde ich ist eine coole Idee. War ganz davonabgesehen. Man muss aber mal ehrlich sagen, es ist ziemlich Nische, dass man das braucht,weil die meiste Software, die wird ja nicht mal unter Windows, mal unter Linux, mal unterMac laufen gelassen. Wenn es eine ASP.NET Web Anwendung ist, da läuft die unter Linux,da wird die unter Linux getestet und gut ist und am besten auch unter Linux entwickelt.In der Regel kann man eigentlich echt sagen, also ich rede jetzt nicht von so exotischenSachen wie IBM Hosts, aber in der Regel kann man sagen, es ist am besten, wenn man dieSoftware unter der Plattform entwickelt, wo sie dann am Ende auch läuft, wenn es geht.Ich meine, dass es für Mobile Apps nicht geht, ist logisch und dass das, zumindestnicht so direkt, und dass das für Host-Anwendungen und sowas, Mainframe auch nicht geht, istklar. Aber wenn man über normale Linux oder Windows Software redet, ist eigentlich ambesten, man entwickelt die dort, wo sie auch am Ende läuft.Ja, na gut, Browser ist ja wieder was anderes.Das probieren wir gleich mal aus. Ich habe übrigens keine Ahnung von Tests in VisualStudio, weil ich brauche nie Tests.Okay, das ist wirklich cool. Das ist genau, das ist das, was ich gelesen habe. Das machtdann, startet dann irgendwie einen Docker und lässt da Linux.NET Core 3.1 laufen.Tests ist nur für Leute, die damit rechnen, dass ihre Software kaputt geht. Das ist genausowie Dokumentation, auch nur für Leute ist, die nicht aussahekräftig programmieren können.Und das Problem haben wir natürlich nicht, deswegen brauchen wir beides nicht.Und wenn man sich unsicher ist, dann macht man sich einfach ein Strukturprogramm vorher.Okay, ja, genau hier, es geht über irgendwelche Docker-Images. Sag mal, das macht mich vollfertig, dass Windows im Hintergrund, die Windows 11, dass die laufen irgendwas auf Sound ploppt.Ich muss mal kurz stummschalten. Besser als wenn es die ganze Zeit macht.Ich frag mich immer noch, was die Amis geritten hat, ihr W W auszusprechen. Und dann, undjetzt kommt ja noch der Hit, und dann die Standard-Abkürzung für Webseiten die ganzeZeit W W W zu nehmen. Ich mein, W W W geht ja auf Deutsch noch, aber die Amis müsstendann wirklich W W W sagen. Das sind sechs Silben versus drei. Ja, stimmt, das warendie Engländer, das waren ja gar nicht die Amis. Die Amis haben es geklaut.Sechs W, ja, das fände ich gut. Kommt da noch was?Da guck ich jetzt mal rein. WS2022-Wishen. Okay.habe ich irgendwas falsch gemacht? Habe ich doch gemacht. MSVS, das ist dochrichtig. Ach, ich hab 2020, lull. Ah, ja, das ergibt das auch. Jetzt ergibt es auchSinn, wenn das nicht funktioniert. Ich brauche eine Runde Musik. So, also das ist das VisualStudio Blog, das haben wir schon. Visual Studio ist viel zu spät, ja, das haben wirschon gelernt. Designing for everyone. Ausgibt neue Icons, Leute. Die wichtigste Änderungin jedem Microsoft Programm. Neues Design, neue Icons. Pascal, die Account ist jetztdie Fault. Dark Mode Icons. Die sind doch noch genauso wie vorher. Nee, die sind in derFarbe tatsächlich ein bisschen angepasst. Also man kann irgendwas personalisieren, abersie sagen nicht was. Dann machen wir doch jetzt mal ein.NET 6 Projekt und gucken, obdas funktioniert. Muss das sein? Können die nicht C++ einfach rausschmeißen? Wer schlägtsich denn freiwillig mit so einem Müll rum? Innovation at your fingertips. Real-time collaboration,website and productivity. Ach, das ist diese neue AI-Geschichte. Guck mal, ein GIF. Setas desktop background. Moment. Funktioniert das wirklich? Moment. Oh, ist das schlecht.Das ist so schlecht wieder. Du wählst ein GIF aus und das GIF ist nicht mal animiertim Hintergrund. Vom Ansatz her cool. Ausführung mangelhaft wieder. Einfach schlecht. Einfachschlecht wieder. Wie kriege ich denn das jetzt wieder rückgängig gemacht? Ich habe leiderkeine personalized-Dinger mehr. Windows XP Hill. Ok, perfekt. Set as background. Hallo?Background. Oh, da stimmt aber irgendetwas net. Ich habe den ORSKY ausgetrickst. Leute,ist das hier ein Firefox-Dialog oder ist das ein Windows-Dialog? Wo kann man Windows 11runterladen? Kann ich nicht sagen. Ok, so kann man das jetzt ja ertragen. Da ist der falscheBerg. Ne. So, weiter im Text. Ich hasse dieses Gruppierte. Dieses Gruppierte vor den Fenstern,das ist so schlimm. Das müssen die ausschaltbar machen. Sonst gibt es wieder irgendwelcheRegistry-Hacks oder so. Das halte ich nicht aus. Ok, neue. Was haben wir hier? AssynchroneCollabora. Ok, blablabla. Improved Code Search. Visual Studio for Mac. Ja, da frage ich michmal. Azure DevOps sagt auch, ich bin GitHub viel nicer. Ok, wunderbar. Die wollen dasgarantiert nicht auf Linux rauspulgen. Ne, ne, ne. Aber ganz davon abgesehen, Rider isteh die beste Cross-Plattform-Lösung. Zeig mal bitte kurz Paint und den Colour Pick-Dialog.Was? Paint? Paint sieht aus wie sonst. Paint sieht aus wie immer. Was für ein Colour Pick-Dialog?Wie startet man Windows Colour Pick-Dialog? Edit Colours? Ok, Paint. Paint Champ. Undjetzt? Und jetzt? Ich habe, ah hier, Edit Colours. Ok, sieht aus wie Windows XP immernoch. Oder eher Windows 98 würde ich sagen. Hör mal, ich mach mal Windows XP eher Windows98. Immer noch der gleiche Shit. Übrigens, wer denkt, dass der Kram besser wird, denkann ich jetzt auch noch gleich mal schocken. Control Panel und Netzwerk-Settings sind immernoch da. Da wird sich wahrscheinlich nichts ändern dran. Aber Hauptsache gerundete Ecken,ja. Und ich hab Dark Theme und Paint und Paint und das checkt nicht, dass ich Dark Theme hab.Das ist halt Fail, ne. Das ist kein neuer Skin, das ist die Windows 11 Preview. So, also,gucken wir mal weiter. Das heißt, als nächstes probieren wir jetzt mal diese tollen AI CodeCompletion aus, oder wie? Oder was? Ok, Create New Project. Paint ist wohl noch die Windows7 Version. Ja, die haben ja auch gesagt, sie machen nix, ne. Ok, wir machen eine Konsolenanwendung.Da brauchen wir nicht viel. CAC, W, ne. 0W, Rater als CACW. Dotnet 6 Preview ist am Start,alles klar. Ja, dieses Bild hab ich noch auf, das haben wir uns heute Morgen hier angeguckt.Das ist lustig, das ist ein schönes Bild. Hat jemand ein Bild von gemacht, wie viel Überrestein Windows 11 noch drin sind? Windows 95 Dialoge, Windows NT Dialoge, Windows XP Dialoge, ersterWindows Store Version, Windows 8 Metro Geschiss, neuestes Fluent Design, davor die Windows 10Settings, Windows 11 Startmenü Ribbon in Aero. Das ist halt echt. Muss das sein, Microsoft,ne. Ok, gut. Also, eins muss man den ja mal lassen. Wir haben den neuen Font, den habenwir ausprobiert und... Select? Den haben wir ausprobiert unter Linux und mit dem LinuxFont Rendering sah dieser Font kacke aus. Unter Windows sieht der Font wirklich nichtverkehrt aus. Muss man mal sagen, also wer auf bisschen fettere Fonts steht, der wirdhier wahrscheinlich glücklich werden mit. Ich finde, der Font ist schick. So, mal starten.Alles wie gehabt. Ich bin ja schon gar nicht mehr gewohnt unter Windows. Ich weiß schongar nicht mehr, wie ich jetzt hier überhaupt... Unter Linux würde ich jetzt ein Terminal aufmachenund sagen.net run. Ich weiß gar nicht, wie ich das hier machen würde. Wie mach ich dashier unter Windows? Gibt es hier sowas wie Open Terminal? Ah, Open Terminal. Tatsächlich.Ihh, das ist dieses fucking eingebaute, eklig Terminal in Visual Studio..net run. Ok, dasfunktioniert ja auch. Aber, jetzt mal, jetzt mal im Ernst. Also, wenn ihr die Auswahlhast zwischen diesem Terminal oder, Moment, oder einem ordentlichen Terminal hier, alsodann ist ja wohl ganz klar. Und selbst das Rider Terminal ist besser, weil das RiderTerminal hat noch eine ganz normale Shell verwendet. Also wer sich, also jetzt mal ernsthaft,sich freiwillig diesen Crap da gibt, dem ist nicht mehr zu helfen. Kann man das auch Auto,Auto Height, jawoll. So, also was sind diese tollen neuen Completion Features? If, wo istmeine Full Line Completion? AXE. Ist das jetzt schon AI unterstützte Completion oder? Wasist das? Und woher weiß ich? Muss man das vielleicht erst aktivieren? Wo sind überhauptdie Settings? Tools, Options? Wie hieß das? Intelli-Code, ne? Intelli-Code. Ok, ich glaube,wir brauchen eine Web-Anwendung, weil die haben das Beispiel in der Web-Anwendung gezeigtund wahrscheinlich funktioniert das nur in der Web-Anwendung. Ok, Razor-Pages, gibt'sda auch was an? Gibt's da auch Web-API? Web-API mit Controller? Ne. Ok. Ich, siehst du malLeute, ich bin zu, ich bin sogar zu unfähig, in Whistle Studio mittlerweile eine Web-Anwendungzu erstellen. Web-API, warum hat er das eben nicht gefunden? Ok, ja, Web-Application 1,perfekt. Mach mal ne neue Klasse Person und füg ne String-Property Last Name hinzu. Abgesehen,dass der dann First Name als neue Property vorschlägt. Sehr gute Idee, Krasius, genaudas machen wir jetzt. Das machen wir jetzt. Nein, halt keine HTTPS-Open-API-Support brauchenwir alles net. So, geh weg. Die Wettervorhersage, genau die Wettervorhersage brauchen wir jetztund den Wettervorhersagen-Controller. So, und da krieg ich jetzt Dinger vorgeschlagen,wenn ich da jetzt reingehe. Ja. Ah, guck mal hier. Intelli-Code-Suggestion. Oh, Massive-if.To accept. Ah ja. So Big Brain wirkt das jetzt noch nicht. Ok, wir machen mal was eigenes.Also, Post. Wir tun mal so, als würden wir da Parameter übergeben. Public. Keine Ahnung,wie nennen wir das mal? Push. Fällt jetzt grad nix anderes ein. So, und das kriegt jetztein String-Cac-W. So, eh. Return null. Perfekt. So, und jetzt, wenn ich jetzt hier sage, if,guck mal hier, Massive, Massive, Big Brain, Big Brain. What is name of the font? Thisis the new default font from Microsoft. It's called, I think, Cascadia Mono. Font? Whois this then? Font? Yes, Cascadia Mono. But it only looks good on Windows. I tried iton Linux and with the Linux font renderer, it sucks. Ja, genau, das ist das hier. Dasist Cascadia Code GitHub. Ui. Genau. Ja, aber das ist doch schon mal cool, oder? Ichmein, diese ist wahrscheinlich die einzige Code Completion, die der kann, aber das istdoch schon mal ganz nett. Meinst du, dass sich die Vorschläge nach dem Namen der Variableauch ändern? Was meinste? Ach, guck mal hier. Return redirect action. Nee, das will icheigentlich gesagt an der Stelle nicht. If? Was? True? What the? Okay, so ganz klapptdas doch nicht. So ganz hat das nicht funktioniert. Okay, if. Nee, und jetzt hab ich's kaputtgemacht, Leute. Brocken. Ach, guck mal, jetzt kann man doch direkt ein... Okay, ich weißnicht so genau, was das da macht, aber es ist nicht das, was ich haben will. Was istdenn, wenn ich hier sage... Okay, da schlägt ihr mir vor, standardmäßig Länge Trim Containsto lower start with. Das werden wahrscheinlich schlicht und ergreifend die meist benutztenMethoden von String sein, das haben die irgendwie gezählt. Ob das jetzt die massive Big Braintoo smart AI, die man dafür braucht, ist... Na, na ja. Okay, Person soll dich ausprobieren,da hat er Grasius vorhin geschrieben. Also probieren wir das mal aus. Public... Oh. Dasist komplett useless, what the fuck, das braucht kein Mensch. Das braucht wirklich keiner.Null. Das ist komplett bescheuert. Okay, Public Class... Was soll ich machen, Person? Undwas meintest du, es gibt Last Name? Wenn ich was Last Name hinzufüge, dann sagt er, ichbrauch noch First Name. Ja gut, wahrscheinlich, weil die... Tatsächlich. Okay, das ist cool,aber das geht auch nur, weil das ein Beispiel ist, was die für alles verwenden. Das hatja mit Big Brain AI nix zu tun. Das klappt jetzt nur in diesem einen Fall, weil das dasBeispiel ist, was die verwenden. Probieren wir das doch mal mit was anderem aus. PublicClass, Car. Nee, Car, nicht Car, Car. So, Prop. Schlägt da jetzt irgendwas vor? Prop?String? Nee, Engine. Name. Na okay, gar nicht so schlecht. Description, okay. Image, okay.Naja, ich weiß nicht, so wirklich wahnsinnig gut. ID wäre gut, ID wäre gut, ja. Wir guckenmal, ob der so schlau ist und das checkt. Wir gucken mal, warte mal, wir gucken mal,ob der so schlau ist und das checkt. Ob der ID vorschlägt, das probieren wir jetzt malwirklich aus. Add Folder Models. In Models sind meistens Felder mit Datenbank ein Bezug.Also Add Class, nennen wir jetzt mal was weiß ich, Kamera. So, meine Kamera braucht dannwas? Name, okay. Ist jetzt schon mal broken. Okay. Int. Also, dass der nicht ID vorschlägtist Fail. Warum schlägt der nicht ID vor? Es ist in einem Ordner Models und in Modelsist alles drin, was ein ID Feld braucht. Das wird sicherlich besser, je größer dieCodebase. Naja, angeblich haben die 1,5 Millionen Open Source Projekte analysiert. Da sollteneigentlich Klassen in Models so gut wie alle eine ID haben. Mach mal, Girl, was die BigBrain AI da vorschlägt. Du meinst Class, Girl? Oh, Monka Toss. Ich sehe mich schonim Monka Toss Land. Girl. Ach ja, jetzt wird ID vorgeschlagen. So, so. Und sonst nichtsmehr. Mehr wird nicht vorgeschlagen, okay. Warum der jetzt noch mal ID vorschlägt, versteheich auch nicht so genau. Ich habe übrigens auch nicht gecheckt, wie ich das triggernkann. Tap to accept, okay. Aber in der nächsten Zeile kommt nichts mehr. Und wenn ich hierin die nächste Zeile gehe, schlägt er mir einfach Name vor. Vielleicht muss ich dasmal löschen einfach. Ach, jetzt schlägt er mir auch wieder Name vor. Okay, Name ergibtnoch Sinn, aber Name ist broken. Description. Okay, was ist die Ull von deinem Girl? Ah,Holy Fence, verstehe. Okay, was? Okay, okay, Moment, Moment. Holy Fence. Oh, IntelliCodehier. Hä? It's like magic. Holy Fence Account, ID. Jawoll. Name. Das ist E-Mail. Hoho. Phone.Guckt euch mal an, Phone Number. E-Mail. Leute, wir sind in der Angelos Schleife. Es hörtnicht mehr auf. Big Brain AI. E-Mail Number. Mal gucken, wie lagiert das jetzt noch. Phone.Oh nee, ist vorbei. Nee, Phone Number. Okay, Big Brain AI ist vielleicht auch noch nichtso Big Brain. Du machst dir AI Angst, ich glaube auch. Funktioniert richtig gut, perfekt.Also, wir haben gelernt, wir haben jetzt eine neue Super-Code-Completion-AI, die merkwürdigeSachen Code Completed. Hier, Code Completed, das nix. So, Summaries, also. Ach so, meinSpinnengall, ich erinnere. Also, was ich jetzt erwarten würde, wenn ich Summaries Punktmache, das ist ein String-Array. Ganz ehrlich, ganz oben würde ich erwarten Length und ichwürde auch vorschlagen, dass der mir String-Join anbietet, ehrlich gesagt. In irgendeiner Artund Weise. Da bin ich mal gespannt, wie schlau das Ding ist. Okay, Length, Copy 2. Was haltrichtig cool wäre, wenn der jetzt hier vorschlagen würde, du möchtest wahrscheinlich auch sogarsowas hier haben. Was ist denn U? Ist es ein Leerzeichen? Domdoretto, danke schön für denSub. Was ist U002? C, ist es Leerzeichen? Komma. Unicode, Komma. Okay, das ist gar nicht so schlecht,dieser Vorschlag. Der Vorschlag ist echt in Ordnung. Ich mein, man könnte auch ganzklassisch den da nehmen. Du kannst jetzt mit Emojis joinen. Okay, das muss ich ausprobieren.Ich muss mal kurz Konsolenanwendung aufmachen, ob die jetzt Emoji-Support haben. Wie öffnetman an diese Startseite? Ah, hier, Recent Files haben wir da noch, Recent Solution. Kannich, haben wir denn jetzt Emoji-Support? Das muss ich jetzt ausprobieren. Hallo? Man kannGIFs einfügen. Okay, das bringt, das bringt es ja richtig an der Stelle. Okay, wir habenschon mal kein GIF, wir haben schon mal kein Emoji-Support. Was ist das eigentlich fürein komisches Menü? Warum war das eben unten rechts? So, und wenn ich sie ausführe, habenwir immer, bestimmt immer noch kein Emoji-Support. Nein, natürlich nicht. Wo kämen wir dennauch hin, wenn neues Teusch bei Microsoft das irgendwie könnte? So, gucken wir mal,wie es im Terminal aussieht. Aber da, da weiß ich eigentlich, dass es unter PowerShellnicht funktioniert. Wo, wo legt denn das Ding überhaupt? Wo hat er denn das hingelegt?Ah ja, alles klar..net-run, nee. Warum nicht? Ah, weil ich mich verschrieben hab. Ah, dasist halt broken. Das ist halt broken. Keine Emojis. Das liegt aber an PowerShell und nichtan, also das Terminal kann prinzipiell Emojis, weil wenn ich, wenn ich WSL installiert hab,funktioniert alles. Nee, ich hab nicht studiert. Okay, das sackt. Also immer noch kein Emoji-Supportenttäuscht mich. Aber es ist ja klar, Wishlist Studio selbst ist ja noch WPF und WPF kannja keine Emojis. Wird ja ein weiterer Punkt dafür, dass die Microsoft UI-Technologien,die benutzbar sind unter Windows, sacken. Weil Microsoft verwenden ja selbst ihren Kramnicht. Gut, also das funktioniert schon mal nett. Mach mal wieder das andere auf. Du kannstWSL jetzt mit WSL installieren. Okay, das muss ich jetzt ausprobieren. Mach mal hierneu auf. Was kann ich machen? WSL minus minus install. Sudo. RunS. RunS, WSL. Gibt's da nichtirgendwas für? Gibt's da nicht irgendein Kommando-Zeilen-Ding für? Admin. Gibt dasnicht irgendein Sudo-Äquivalent in PowerShell? Ich meine, ich kann, ich kann das startenals Admin. Wie starte ich überhaupt eine Admin-PowerShell hier drinnen? So, schon mal nicht. Terminal.Okay, starten wir das ganze Terminal als Admin. Das funktioniert. WSL minus minus install.Ist halt dumm, dass es nicht so eine Sudo-Variante standardmäßig gibt. Ich weiß, man kann sichwas nachinstallieren. Okay, nice, Funst. Das ist schon mal schön. Das ist schon mal schön,dass es jetzt einfach geht und man nicht 3 Milliarden Dinger machen muss. Oh, habe ichVirtualisierungs-Support eingeschaltet? Kann sein, dass das jetzt gar nicht funktioniert.Nein, Virtualisierungs-Support ist aus. Ich muss Windows neu starten, klein. GUI-App-Supportist am Starten. Der hat auch, der echt erstaunlicherweise ganz gut funktioniert. Wie findet ihr, Pythonso ist sehr gut zu gebrauchen? Bist du auf einer Suche nach einer Einsteiger-Programmierspracheoder warum fragst du? Was Einsteiger-Programmiersprachen angeht, da habe ich was. Okay, Power off.Ach nee. Shutdown? Ah, now? Nee. Macht man das unter Windows? Was? Okay, Leute im Chat,S minus S minus P null. Aha, exquisite. Ich will übrigens gar nicht rebooten, ich willtatsächlich ausschalten. Schaltet das jetzt aus oder rebootet das? Updater und underway.Also, wenn du auf der Suche nach Einsteiger-Programmiersprachen bist, dann geh mal zu mir auf YouTube. Da habenwir nämlich letztens ein Video gemacht zusammen. Nämlich das da. Einsteiger-Programmiersprachen.Kannst du dir ja mal angucken. Ansonsten, die Kurzvariante für dich, was wir hier drinnenvorstellen ist Go, dann Python, dann JavaScript. Aus irgendwelchen Gründen möchte da FlorianC und C++ vorstellen. Ich werde es bis heute nicht verstehen, aber es war sein Part. Undich stelle C Sharp vor. Und meine persönliche Empfehlung, wenn du wirklich noch nichts kannstund noch nichts konkretes vorhast, fang mit JavaScript an. Du brauchst einfach nur einenBrowser und kannst loslegen. Und du kannst so geile Panels wie SpaceX programmieren.Wenn du Python bisschen kannst, spricht auch nichts dagegen, damit weiterzumachen. Dasist auch eine super Einsteiger-Programmiersprache. Ich glaube, das muss man anhaken dafür.Max, wo hast du die Preview von Windows 11 her? Secret. Haben wir schon mal einen Go-Streamgemacht? Ne, wir haben noch keinen Go-Stream gemacht, weil ich bin nicht der Super-Go-Profi.Ich meine, ich kriege da drin was programmiert, aber ich bin jetzt keiner, der euch sagenja, so ist die beste, also ich kann euch in C Sharp zeigen, so ist die beste Art und Weise,was zu machen. Das kann ich in Go, ich kann in Go was machen, dass es funktioniert, aberob es die beste Art und Weise ist, keine Ahnung. So, geht das jetzt? Warum startet sich immerdiese Kacke? Xbox App. Was will die eigentlich von mir? Was verkaufen wahrscheinlich? Rust7, das können wir tatsächlich mal machen. Rust ist super, aber Rust ist wirklich nurfür High IQ Leute. Also wenn ihr nicht mindestens, sagen wir mal 125 plus IQ habt, dann könntihr Rust vergessen. So, also Enter New Unix Name. 1, 2, 3, 4, 5, 6, 1, 2, 3, 4, 5, 6, jawoll.So, und jetzt können wir PowerShell, jetzt können wir das Terminal starten und WSL aufmachen.Terminal, M, JUBANTU und wenn ich jetzt nach, wo ist da Kram? Documents, Source, ne, Source,WPos. Ich hab mich übrigens auch verschrieben, sehe ich gerade. So, wenn ich da jetzt hingeheund sage.NET RUN, dann, ach fuck, das ist jetzt, da muss ich.NET EXE machen oder RUN?Jetzt richtige Ordner und jetzt haben wir Emojis. Auch nicht? Warum haben wir da keineEmojis jetzt? Muss ich vielleicht.NET unter Linux installieren, dass das funktioniert?Moment, ist das WSL 1 oder WSL 2? Das ist WSL 2, oder? Das Terminal, das kann Emojis,das kann Emojis, das Terminal unter Linux. Das geht. Wohingegen, ihr seht's, unter PowerShellfunktioniert das nicht. Das ist wahrscheinlich einfach das Problem, dass das ein.NET, Windows.NET Anwendung ist, die jetzt rumbackt. Okay, UPD, INSTALL, haben die eigentlich.NETstundermäßig mehr drinnen? Ne, ne? Die wollen, dass ich einen Snap installiere wahrscheinlich.Ne, ne, ich installiere keinen Snap. Du mein, das überhaupt nicht funktioniert damit. Ichhab eine Idee. Das ist ja Cross-Platform, ich weiß, was wir machen. Wir machen jetzt,wir machen jetzt richtig, richtige Big-Brain-Idee. Passt mal auf. Richtig, richtig. Jetzt kommtdie ultimative Hacker-Man-Solution, was wir jetzt machen..NET, BUILD, minus, minus, nee,PUBLISH, PUBLISH, minus, minus, self-contained, self-contained, Linux 64, ich hab keine Ahnung,ob das die richtigen Kommandos sind, nein. Ne, X64, okay. Massive, Massive Hacker-Man-Solutionshier. Also, gehen wir dahin. Wo müssen wir hin? CD, bin, debug,.NET, Linux, ist Terminalne, ist nicht, ist nicht gecrasht. Publish. So, und jetzt kann ich's ausführen. Damn,habt ihr's gesehen? Habt, habt ihr's gesehen? Zack, und da haben wir unsere Emojis. RichtigSix-Head, oder? Das ging aber nur, weil wir jetzt mit, okay, okay, das jetzt zu erklärenist echt kompliziert. Wir haben mit WSL das Windows.NET aufgerufen und dort mit dem Windows.NETcross-compiled ne native Linux-Anwendung, die wir dann ausführen unter WSL und dannfunktioniert's mit den Emojis. Was, CH, CHP, 6500, was, was, was, was, Moment, warte, dasgeb ich nicht einfach so ein, ich weiß nicht, was es macht. Check mal mein Sample oben,was, was, was, was, Sample. Was, was, was macht CH, CHP? Jetzt sind wir wieder im MicrosoftWeird Champland. Das ist nicht standardmäßig Unicode. Okay, jetzt sind wir echt im, im,im, im, Massive Microsoft Weird Champland. Also, das heißt, ich geh jetzt dahin, gebdas ein, dann geh ich in, ja, dahin,.NET Run. Nö, funktioniert nicht. Funktioniert nicht.Bam. Outdated, gebated, overrated. Funktioniert nicht. Kann man Change-Code-Page auch unterLinux machen? Nee. Deiner, hm? C-Pool. Komm. Also, deswegen muss ich nach wie vor sagen,einfach eine Linux-4M und gut ist, dann muss man sich mit dem ganzen Chat immer noch nichtrumschlagen. Nee, geht nicht. Tja, funktioniert nicht. Okay, Moment, Moment, was, was? Machin deinem Sample mal Console-Writer noch Console-Output-Encoding. Oh, big brain time. Das machen wir jetzt,das machen wir jetzt. Da lernt, hier Leute, ich lerne noch was, ich, ich, ich lerne, wieman auf der Windows-Shell Emojis ausgeben kann. Heute, heute hab ich viel, viel wichtige Infoshier, viel wichtige Input gelernt. So, also was soll ich machen? Console, also vorherwahrscheinlich, ne? Console, Output, Output, Output-Encoding gleich. Ja, super, AI, schlagmir mal was vor. Output-Encoding. AI hat kein Bock. Encoding, okay. UTF-8. So, und das solljetzt irgendwas bringen. Probieren wir das mal hier aus. Tatsächlich, das Funst. Moment,Moment. Geht, geht das auch im, im, im alten Kommando-Zeilen-Prompt? Nee, oder? Da gehtdas. Okay. Warum um alles in der Welt geht das? Kann mir das irgendjemand erklären? Warum,warum kann ich hier in dem Programm Emojis ausgeben, aber keine Emojis reincopypasten?Das ist, ey, Microsoft-Encoding-Land ist echt die absolute Hölle. Source?Was? CHCP65001? Okay, nee, da geht's glücklicherweise nicht.Was? Also, Pock. Richtig, richtig, richtig, richtig Pock. So, aber wir waren ja eigentlichdabei, wir wollten uns Wishless Studio angucken und nicht irgendwelche Emoji-Ausgaben. Wohatten wir denn jetzt den Blog-Post? Also, wo stand da jetzt noch was drin, was es sonstnoch so gibt? Wishless Studio 2022 Review. Die bei Microsoft sind einfach zu sick-setund mir verstehen es nicht. Glaub schon. Ja, das wird an uns liegen. Gehe ich auch vonaus. Unsere, unsere Köpfe sind einfach nicht zu, zu groß genug für die Microsoft-Logik.Also, 64-Spit-Upgrade bisher bestes Intelli-Code. Okay, Leute, wenn das das bisher beste Intelli-Codeist, dann will ich nicht wissen, wie geil Intelli-Code bisher war. Ach, wir können tatsächlichmal probieren, ob da, was der bei Record sagt. Das, das probieren wir jetzt noch mal aus,was der bei Record sagt. Record, legt der da irgendwas vor? Jetzt mal, schlägt er inder Konsolenanwendung überhaupt was vor? Nee, in der Konsolen, warum geht dann in derKonsolenanwendung Intelli-Code nicht? Warum geht, warum, hä? Guck mal, in der Konsolenanwendunggeht Intelli-Code nicht. Doch, doch. Doch, oder, oder auch, hä? Eben ging es noch nicht,vorhin ging es. Ich blick da nicht mal durch. Public, Public, der Zeichen, Glass. So, dasist das Beispiel, was eben funktioniert, was eben funktioniert hat. Drop. Okay, das funktioniert.Guck mal, jetzt ist es broken, jetzt funktioniert es nicht mehr. Eben hat es mit Firstname undLastname auch funktioniert. Jetzt ergibt er mir aber ID und User-ID und User-Count und...Ach und jetzt muss ich Firstname machen, oder? Okay, jetzt geht es. Okay, ich muss sagen,die AI ist noch ein bisschen fragil, die funktioniert noch nicht so richtig gut. Probierst du nochMaui aus? Ja, mal ganz kurz, falls sie schon drin ist. Äh, äh, warte mal, Leute, waswollte ich jetzt ausprobieren? Das habe ich schon wieder vergessen. Ach so, Record. Record.Funktioniert das da auch? Äh, und jetzt muss man sagen, in it, ne? So, Record-Stells. Ne,sonst kann er noch nicht. Oh, doch. Doch, kann er, kann er. Guck mal, gar nicht so blöd,gar nicht so blöd. Naja, ich bin auch nicht so wahnsinnig begeistert, muss ich ehrlichsagen, davon. Wir machen wirklich mal ein Maui-Projekt. Falls wir... Falls das überhauptgeht schon. Geht das überhaupt schon? WPF, WPF. Wer bei Microsoft hat sich eigentlichgedacht, dass das hier übersichtlich ist? Kann es sein, dass wir das zusätzlich installierenmüssen? Kann es sein, dass man Maui-Zeug zusätzlich installieren muss? Desktop? Gibtes zumindest nicht zur Auswahl. Dotnet 6 ist dabei, muss eigentlich passen. Maui ist derVersuch, von Microsoft in Cross-Platform UI-Framework rauszubringen, nur mit dem meiner Meinung nachkomplett falschen Ansatz. Und Linux wird prinzipiell nicht unterstützt. Okay, also, da gibt'snix. Ja, mit Electron kannst du's auch machen. Wir können die Testgeschichte mal ausprobieren.Da weiß ich aber nicht, wie das geht, Chat. Da müsste der mir helfen. Ohne Scheiß, ichhab wirklich keine Ahnung, wie das mit Tests funktioniert. Add? Class? Okay, keine Ahnung.Huge? Tests? So, und wie geht das jetzt? Test? Hallo? Test? Nee, das ist, das ist irgendwasanderes, oder? Zumal das auch noch irgendwie kaputt ist und gar nicht funktioniert. Ichweiß gar nicht, wie ich den Test-Runner hier überhaupt aufmache. Ah ja. Nee, da muss ichjetzt erstmal X-Unit, N-Unit oder wie auch immer der Kram heißt installieren. Da binich, da bin ich zu low, da bin ich zu low für. Da bin ich zu low für. Okay, eigenesProjekt. Add? Ah ja, N-Unit-Test. Genau. Next. Create. Kann das Lore? Weiß ich nicht. Kannstich, warum ist das hier alles, alles, alles broken? Warum ist das eigentlich alles kaputt?Ah, jetzt ist es ganz, okay. So, und wo ist jetzt der Test-Runner? Windows? Test? Woist, Test-Explorer, da ist er. So, und wo geht das jetzt, was der Typ gezeigt hat mitden unterschiedlichen Plattformen? Meine Güte, die Bedienung davon ist aber nur wirklichmal massivster, massivster Pains-Champ, Alter. Richtig Hardcore-Pains-Champ. Und wo kannman das jetzt Linux-technisch umstellen, was der gezeigt hat im Video? Das geht glaubich noch gar nicht. Das ist mir, das ist mir zu eklig zu benutzen. Das mach ich eh nicht.Das werd ich eh nicht benutzen. Das weiß ich jetzt schon. Soweit ich mein Visual-Studio2022 eh nicht verwenden. Ich bleib weiter unter Linux mit Rider und alles, und allesist gut. So, gibt's sonst noch irgendwas Neues? Ich würd gerne ein Maui-Projekt anlegen,aber das geht ja nicht. Bisher best ist alles klar. Du bist jetzt Macbook-Besitzer? Ja,das macht nix, da läuft Rider auch drauf. Es ist zwar ein bisschen lustig, dass wirerst ne Java-IDE brauchen, damit wir ordentlich.NET-Cross-Plattform programmieren können,aber immer noch besser als Visual-Studio vom Mac oder sowas. Gab's jetzt noch irgendwas,was wir ausprobieren müssen? Ich mein, das ist jetzt wirklich gar nicht, das ist jetztbisschen arm. Ich mein, das ist nicht die CPU-Plattform. Gibt ja nix. Angeblich habenjetzt, das können wir noch mal ausprobieren, Angeblich hat Windows Forms jetzt Hot Reload,aber da weiß ich nicht, ob das schon eingebaut ist. Angeblich haben die Hot Reload. Das probierwir jetzt mal aus, ob das funktioniert. Windows Forms Hot Reload, da hab ich vor 35 Jahrendavon geträumt, noch bevor ich auf der Welt war. Nee, stimmt nicht, ich bin da mittlerweile36. Ja. Okay, ein Button. Ich brauch ein Button. Button. Geben wir ein Button. Alles klar.So, gucken wir mal, ob das jetzt Hot Reload hat. Ich hab gelesen, dass es angeblich HotReload hat. So, Hot Reload. Das heißt, wenn das jetzt funktioniert. Ach, guck mal da.Da gibt's nen extra Knopf. Pure Magie. Äh, nein, nein, nein. Ich will, ich will im Design,wo ist die Toolbox? Wo ist die, Leute, wo ist die Toolbox? View, Toolbox. Toolbox. Was?Okay, wir machen einfach, wir machen einfach den zweiten Button. Und jetzt, und jetzt,und jetzt, und jetzt. Passt auf, Leute. Oh nein, nein, nein. Nicht singen, das ist MonkaToss. Ah, bla, bla, bla, bla, bla, bla. Wo hab ich die Musik? Ah, wo ist die Musik?Geh. Immer wenn gesungen wird, ist Monka Toss. Immer noch. Wieder gesungen. Bam. Okay. Also,testen wir mal. Ja, wenn ich jetzt da oben auf den Button drücke, sollte das jetzt HotReload. Probieren wir das mal aus. Ob das Hot Reloaded. Funktioniert ja schon mal gut.Okay, vielleicht, vielleicht geht das nur. Speichern? Ach, der speichert nicht automatischfür mich. Geht aber auch so nicht. Okay, vielleicht, vielleicht geht das nur, gehtdas nur für, äh, neue Sachen. Also, äh, nicht Button click. Wir machen jetzt irgendwiethis button, äh, Texts gleich. Okay, wir nehmen die Super Big Brain AI Completion. Nö. Dasfunktioniert nicht. Okay. Hot Reload für Windows Form F. Ich mein nicht, dass es michehrlich gesagt großartig stört. Da steht Code Changes, nicht Design Changes. Na gut,wir haben jetzt beides gemacht, beides hat nicht funktioniert. Ich glaube, Hot Reloadfunktioniert nur, wenn man gerade nicht am Debuggen ist. Okay, dann starte ich es ohneDebugger mal. So, jetzt ist ohne, jetzt habe ich ohne Debugger gestartet. Ne, ne, dannhabe ich den Button gar nicht. Ich muss das, ich muss das mit dem Debugger starten, wärees ja auch logisch. Wieso sollte der Constructor nochmal triggern? Ja, weiß ich, ich frageMicrosoft, die schreiben was von Hot Reload. Ja, wir können, wir können noch mal was anderesprobieren. Hier ist nichts, hier ist nichts drinne. Dann machen wir jetzt mal die onClick,die onClick Methode, machen wir jetzt mal was rein für den, für den Button. Also, aktuellpassiert nichts. Ähm, das heißt, wir machen da jetzt rein, oh, wie macht man denn Pop-Up?Wie, wie macht man denn Pop-Up in Windows Forms? Model? Model? Ne. Ah, du Scheiße. Okay,Dialog. Dialog? Ne. Message Box. Message Box Show. Ah ja. Okay. Fuck. Okay, gespeichert.Hot Reload. Und jetzt? Oh, das funktioniert. Also, da haben wir schon mal. Designer Changesgehen nicht und Constructor Changes gehen nicht. Okay. Jetzt noch mal testen, ob dasauch wirklich funktioniert. Forgo. Reload. Es funktioniert. Okay, das ist schon mal cool.Weil, man checkt noch wirklich Design, Design-Sachen nicht funktionieren. Properties. Mal das,äh, Color. Ist jetzt, äh, Orange. Perfekt. Ne, das funktioniert nicht. Das wird unterder Haube eh auch in irgendeinem Constructor gesetzt. Naja. Nice to have hat eigentlichkaum einer gebraucht. Aber mal ganz ehrlich, juckt mich nicht. Windows Form kann durchausein paar coole neue Features gebrauchen, auch wenn Windows Forms an sich schon, da bisschenin die Jahre gekommen ist. Does it work on Macbook? No. No. But, äh, I think the finalversion has Visual Studio for Mac. Lass mal kurz gucken. Gibt's da schon was für Mac?Maybe it's available for Mac, too. Don't know. Looks like Windows only. Ja, aber ichglaube, das sagt eh unter Mac. Ja, okay, das ist Hard Reload für Windows Forms. Warumnicht? Warum nicht? Kann man machen. Muss man nicht. Benutzen die Leute nicht Fluttereher anstelle von Windows Forms? Naja, auf dem Desktop nicht. Auf dem Desktop, also Flutterist cool, aber Flutter auf dem Desktop ist einfach noch nicht ready. Aber ich gehe davonaus, dass Flutter auf dem Desktop noch das brauchbarste Crossplatform, auf absehbareZeit das brauchbarste Crossplatform GUI Framework werden wird, weil aktuell hast du ehrlichgesagt zwei realistische Alternativen. Du hast Qt oder du hast Electron. Das sind dieeinzigen zwei, die es gibt. Electron ist halt, sagen wir so, JavaScript, was sich jedermannsFall ist, und es ist halt riesengroß mit massig Ramverbrauch, weil Electron, weil V8 und Chromeund Node.js alles gleichzeitig laufen muss. Gut, und du hast Qt, das Problem an Qt istC++. Du kannst ein bisschen was in Python machen, aber Python Crossplatform zu packagenist auch nicht so wahnsinnig tolle. Und ansonsten hast du nix? Ja, doch, stimmt, du hast Tkinterin Python eingebaut. Avalonia ist leider auch noch nicht wirklich soweit, dass man das,also das letzte Mal, wo ich mir das angeguckt hab, dass man das komplett gut verwenden kann.Das letzte Mal, wo ich Avalonia geguckt hab, die hatten beispielsweise noch kein Browser,also noch kein Webview und auch keine Möglichkeit in irgendeiner Art und Weise da beschleunigtenGPU, beschleunigten Content zu rendern. C++ ist für'n Arsch, ja ist es auch. Ansonstenist Avalonia ganz cool. Ganz ehrlich, ich hätt's cooler gefunden, hätt' MicrosoftAvalonia ordentlich gemacht und nicht ihr komisches Maui rausgebracht. Maui ist, findeich, der falsche Ansatz. Das hab ich jetzt schon ein paar Mal gesagt, ich versuch jetztmal zu erklären, warum das meiner Meinung nach der falsche Ansatz ist. Also, wenn dunun Crossplatform GUI Framework machst, dann hast du zwei grundsätzlich unterschiedlicheAnsätze. Du kannst sagen, ich bau nen Rapper, der die native UI Elemente nimmt, also hierzum Beispiel Buttons unter Windows, die so aussehen, Buttons unter Linux, die so aussehen,also du nimmst die native UI Elemente und baust nen Rapper drum herum und dann hastdu den Vorteil, dass die Anwendungen zwar native aussehen, aber sich oftmals ein bisschenmerkwürdig anfühlen, weil du für den kleinsten gemeinsamen Nenner programmieren willst.Also, wenn du so nen Rapper hast, der beispielsweise native Controls benutzt von Android, iOS,Windows, Linux, Mac, die Frage ist immer noch, was ist eigentlich native unter Linux, dannmusst du gucken, dass du den kleinsten gemeinsamen Nenner an API unterstützt, was du abbildenkannst. So, das ist das, wie das Xamarin oder Maui macht. Du kannst es da übrigens auchbesser machen, aber dann musst du sagen, if Platform gleich gleich Windows. So, unddann gibt es den Ansatz, der meiner Meinung nach einzig wahre und sinnvollste Ansatz, sowie das Flutter auch macht, ist, man nimmt für die jeweilige Platform schnellste Rendertechnologieund malt Steuerelemente selbst. Das heißt, oder was heißt für die jeweilige Platform,das muss noch nicht mal sein. Das heißt, man programmiert nen Renderer für Windows,für Linux, für Mac, für iOS, für Android, mit was für nem Tool auch immer und maltSteuerelemente selbst. Genau, Avalonia ist hier. Die hatten eine Zeit lang noch GTK-Erhängigkeitunter Linux, das hat mich immer ein bisschen abgeschreckt, aber ich glaube, das verwendendie plus zum Fenster malen. Ich denke, das muss nicht unbedingt so sein, du musst dichhalt selbst darum kümmern. Also, ich finde den Ansatz für konsistentes Look und Feel,keine Steuerelemente malen. Deswegen ist ja auch letztendlich Electron so cool, weil Electronist nix anderes als nen Browser, also ne Anwendung verpackt mit nem Browser dabei, Node.js V8,Chrome und das sieht halt überall eben aus, wie es halt in nem Chrome nun mal aussieht,egal auf welcher Plattform. Qt macht das übrigens auch so mit QML, die malen im Endeffekt aufjeder Plattform, mit, es gibt für Qt gibt's nen Diode X Renderer, beziehungsweise auchnen GL Renderer und sonst was. Die malen das auch so. Nur Microsoft hat sich wieder gedachtbei Maui, ne ne, wir machen diesen komischen Steuerelemente wrapper und das finde ich istein Kack Ansatz. Dann hast du dann wieder so Dinger, da siehts unter Mac kacke aus, odermal siehts unter Windows kacke aus, mal siehts dann unter Linux kacke aus, mal siehts unterAndroid nach iOS aus, mal iOS nach Android aus und ach keine Ahnung. Ja und Fluttermacht das richtig, Flutter malt den Kram selbst, deswegen denke ich, wenn die es schaffen,dass man ordentlich es auf dem Desktop benutzen kann, dass Flutter sich durchsetzen wird,weil es ist ne angenehmere Sprache als C++, auch wenn Dart, wisst ihr das Optimale, sollich euch mal sagen, was das beste wäre, also die beste Kombination aus allem. Irgendjemandnimmt Flutter und nimmt ne ordentliche Programmiersprache, wo du auch Zugriff auf viele Libraries hast,ja. Also irgendjemand macht nen C Sharp Flutter oder nen JavaScript Flutter oder was auchimmer. Das wär wahrscheinlich am besten, ich mein Dart. Warum muss es denn ausgerechnetDart sein bei Flutter? Hätte man da nicht irgendwas nehmen können, was es gibt? Esist jetzt nicht, als hätte Flutter unbedingt den Anspruch, ja wir brauchen auch ne eigeneProgrammiersprache dabei. Warum? Ja nur der Unterschied, dass du bei Electron noch einkomplettes Node-Share hast, einen kompletten Chrome mit V8 laufen lassen hast. React Nativeaufm Desktop sackt. Ich hab mal nen Stream in Flutter gemacht, aber ich bin da nichtwirklich gut drinne. Schau dir mal Tauri an. Ja erinnert nix dran, dass es viel RAM brauchtwahrscheinlich. Ob das jetzt ein Chrome ist oder ein Native Browser, Browser brauchenhalt viel RAM. Das, ja ja das hab ich gesehen. Blazer Native und Gedöns, ja das hab ich gesehen,wobei ich halt nicht so genau den, ich versteh nicht wirklich so genau die Existenzberechtigungehrlich gesagt, weil C Sharp im Browser mit Blazer ist halt langsam und braucht nen riesenRuntime bevor es überhaupt startet. Und es hat jetzt nicht so den riesen Vorteil gegenüberJavascript, zumal du für gewisse Dom-Interaktionen immer noch Javascript brauchst im Blazer.Das ist glaub ich so, das ist so ne coole Idee gewesen bei Microsoft, wo ich nicht soden Realitätsbezug drin sehe. Es gibt bereits viel zu viele Sprachen, Newbies wissen nichtwo sie anfangen sollen. Wenn Newbies nicht wissen wo sie anfangen sollen, dann sollendie zu mir auf YouTube gehen und sich einfach dieses Video hier angucken. Was ist die besteEinstiegsprogrammiersprache? Guckt euch das Video an und dann fangt mit Javascript an.Oder mit ner anderen Sprache die wir sagen, aber wenn ihr nicht wisst was ihr machen wolltdann fangt mit Javascript an. Es sei denn ihr habt ne Abneigung jetzt schon gegen Javascript,dann nehmt halt was anderes davon, dann nehmt Python oder Go oder C Sharp oder meinetwegenjetzt Microcontroller sind auch C. Warum ist C drinne? Naja, erstens weil der Florian CFan ist und C ist ja auch ok und gerade wenn es um Microcontroller geht, ist das nun wirklichwas womit viele Leute anfangen. Viele Leute fangen mit irgendwie so nem Arduino Ding anzum Beispiel und da kannst du ja nur C verwenden bzw. du kannst eigentlich nur dieses ArduinoC++ verwenden, aber man sollte auch wenn man Arduino programmiert möglichst großen Bogenum viele C++ Features machen, weil C++ einfach nur ganz großer Pains Champ ist.Wenn Flutter Dart sich durchsetzen will, warum dann nicht als Noob anfangen? Weil Dart neProgrammiersprache ist, die du nirgendswo gebrauchen kannst sonst und du wirst als deineerste Anwendung nicht gerade ne Cross-Platform GUI Anwendung machen. Also man kann sicherlichmit Dart und Flutter anfangen, wenn man da ne Vorliebe für hat, aber ich glaub nicht,dass das die beste Einsteigersprache ist oder sich da besonders gut für eignet.In der Berufsschule haben wir mit C angefangen, sind auf Java gewechselt ab dem zweiten Jahr.Ja das hab ich öfters gehört, bei uns in der Berufsschule haben wir auch C gemachtund später dann ein bisschen C Sharp und das lustige war, wir haben noch auf Papier programmiertin der Berufsschule, das ist richtig armselig. Ich mein das ist jetzt nicht, das war 2007oder so. Das ist richtig armselig, dass man da noch auf Papier programmieren musste.Was hältst du von Visual Studio Code 2020? Bis jetzt ist es durchaus in Ordnung, wasich gesehen hab. Die Sache ist nur die, dass es halt so ein Release ist, wo es im Prinzipnichts großes zu sehen gibt. Ich mein,.NET 6 ist dabei als Preview, ok, IntelliCode, okwenn das das beste IntelliCode ist, da will ich nicht wissen, wie das vorher war und eskommt einem so vor, als laden die Projekte ein bisschen schneller, aber im Großen undGanzen ehrlich gesagt, ja, es ist vorhanden. Mal gucken, was bei Release rauskommt. Eswird bei Release immer noch das beste für die meisten Leute sein, die unter Windowsanfangen mit.NET zu programmieren, wobei ich sagen würde, wenn ich unter Windows programmierenwürde, ich würde trotzdem Rider installieren. Ich bin ja schon seit letzten paar Jahren,was.NET angeht, nur noch unter Linux am programmieren mit Rider, aber im Ernst, ich würde es unterWindows auch so machen. Rider beste. Kostet halt was, wenn man nicht die Trial austricksenwill. Chatbrain sollte mich auch noch sponsoren, genau. Der Vorteil am Papier programmierenist, dass du jeden Schritt dreimal überlegst. Das dumme am Papier programmieren ist, wenndu Semikolon vergisst, das zeigt es dir nicht an. Man muss es, ich meine, es ist 2021. Dakann man durchaus nicht an Rechnersetzen programmieren. Ich bin da kein großartiger Fan von, ichhalte es auch nicht für so sinnvoll. Als Student sind Chatbrains IDE's for free. Kann man Windows11 die Gruppierungen wieder ausschalten? Tja. Ich habe nichts gefunden bis jetzt, fuck michauch total ab. Und ich habe hier in den Settings geguckt, da ist nichts zu drinnen. Keine Gruppierungen.Ich habe es aber nicht aktiviert, aber man hat da kein Setting, also das nervt mich richtig.Da brauchst du wahrscheinlich wieder irgendwelche komischen Registry-Hacks dafür. Also wennsie das lassen, mache ich erstmal 5 Videos, in denen ich Microsoft fläme. Dieses Gekrupeist so ätzend. Ich habe 3 Browser in Firefox auf, weil so will ich auch 3 Browser untenangezeigt bekommen. Ich meine, es ist ja nicht so, als hätte ich nicht genug Platz. Wasdenken die denn, wie viele Programme die Leute da unten verlinken? 50? Ich habe da untendrin. Guck mal, was habe ich denn hier? Ich habe meine Shell, ich habe einen Explorer,ich habe einen Browser. Fertig. Das reicht. Ich glaube, bei Microsoft, die treffen immernoch gute Entscheidungen. Also gerade was Clouds Sachen angeht und mit Github und siemachen schon viele coole Sachen. Microsoft hat dann einfach zig viele Abteilungen. Davonbauen halt auch viele Kacke. Unter anderem die Leute, die für Windows zuständig sind,weiß ich nicht, was die machen die letzten 5 Jahre über. Windows ist immer noch einunglaublich zusammengestöckeltes Stück Software. Wie kriege ich denn das da eigentlich weg?Wie kriege ich das weg? Ich habe letztens H1 Update gemacht. Wetter, wie kriege ich dasWetter weg? Das ist auch so ein Windows Feature, ne? Da hat jetzt wirklich die Welt drauf gewartet,oder? Da hat die Welt drauf gewartet. Die haben gesagt, ja, ich brauche unbedingt soein komisches Widgetrechts in meiner Taskleiste. Was da so total out of place auch noch aussieht.Die Delta-Mutanten breiten sich rasant aus. Aha. Delta-Mutanten sind am Start. Ich hoffe,oh, wisst ihr, das ist geil, wenn die Delta-Mutanten sich ausbreiten. Das heißt, dass die Homeoffice-Pflichtverlängern werden. Die sollen sich mal ein bisschen schneller ausbreiten. Die haben nochbis zum 30. Zeit sich auszubreiten. Weil bis zum 30. wollten sie ja die Homeoffice-Pflichtlassen und danach nicht verlängern. Aber wenn sich die Delta-Mutanten jetzt ausbreiten,dann verlängern die das wieder. Hoffentlich breiten die sich mal ordentlich geschwindaus jetzt. Kein Homeoffice. Warum? Homeoffice ist beste. Die breiten sich nicht so. Dasist aber schlecht. Die sollen mal Gas geben, die Mutanten. C++ ist auch die beste Sprache.C++ ist einfach nur ein ganz großer Pains-Champ. Du hast nur Gutes... Wer erzählt allen Ernstesnur Gutes über C++? Das glaube ich nicht. Das kann nicht sein. Dreh grad. Du machstdas aktuelle Projekt absichtlich in C++? Ja, manche Leute sind nicht mehr zu retten.Gut, ich meine ich mache das ESP und Arduino Zeug auch in C++. Weil es nicht anders geht.Aber ich würde das jetzt nie freiwillig machen. Du meinst den Typ unter meinem Video? Ja derwar geil. Der war geil. Der war richtig loster Typ bei mir unterm Video letztens. Der gemeinthat Homeoffice ist der erste Schritt in die Entlassung. Der war ein geiler Typ. Der warda voll überzeugt von. Arduino ist C++. In der Arduino IDE auch noch so ganz komischeAbwanderungen davon. Mit ein paar Erweiterungen. Soll ich euch mal... Pass mal auf. Für alledie sagen C++ ist gut. Ein Beispiel was mir gerade so spontan einfällt. Also wir guckenuns jetzt mal was an in.NET. Also in.NET kann ich sowas machen wie hier. Output. Outputgleich LUL. Und dann sage ich Console Rightline Output to Upper Case. Wobei ich bin mir nichtsicher ob die das jetzt nicht... Doch ich glaube sogar seit dem letzten C++ Standardhaben die das eingebaut. Ich glaube seit dem letzten C++ Standard haben die das jetzt sogareingebaut. So und in C++ geht das so.Ist gleich viel besser ne. Viel viel besser. Viel besser lesbar und übrigens wir habenjetzt immer noch nicht ausgegeben jetzt. Viel besser. Ja stimmt schon habt ihr recht.Exposed. Aber ich glaube dass die tatsächlich to Lower to Upper Case im letzten C++ Standarddrinne haben. Ja aber es gibt noch mehr. Also es hört nicht auf. Aber ich will jetzt nichtanzufangen zu sehr über C++ zu renten. Übrigens kann mir jemand erklären was es macht inC++. Passt auf. Ich hab hier so ein paar lustige C++ Beispiele. Wer weiß was es macht. Ohdas Highlight ist kaputt. Irgendjemand eine Ahnung? Was machts? Naja das ist ein Vergleichder Standard Lips nicht der Sprachen. Doch. Das ist ja das was das C++ Cremio macht. Diemachen die Sprache und die Standard Library. Das musste schon mit zählen. Ok es hat keinereine Ahnung was es macht. Gut schonmal wunderbar. Ich weiß auch nicht mehr was es macht umehrlich zu sein. Das hab ich für irgendwas gebraucht. Ich hab aber keine Ahnung mehrwas es macht. Ich glaub ich weiß wieder was es macht. Du kannst diese Methode hier aufrufenmit beliebig vielen Argumenten und der nimmt alle Argumente und macht einen String drausam Ende. Also im Prinzip dass das gleiche was du mit Params in C sharp machst. So auchwunderbar. Wunderbares C++ Beispiel. Allein schon dass die Leute immer noch mit Headerrumhantieren müssen. Ja es gibt jetzt Modules. Aber niemand bisher verwenden wirklich Modules.Das ist alles noch irgendwie ein komischer Header Crap. Headcraps. Es ist halt C++ wassoll ich da noch zu sagen. Ich geb dir Header. Dann hast du so ein Iterator Kram nicht richtigfunktioniert. Dann hast du jetzt erst so ein Iterator nicht richtig. Es ist C++. Es isteinfach wir. Es ist an jeder Stelle wo du hinguckst wir as fuck. Du kannst den ganzenTag Weirdchamping betreiben wenn du C++ programmieren musst. Ich seh es wirklich C++ programmieren.Wenn ich irgendwelche ESP Sachen mache seh ich die permanent so vorm Rechner. Mir wirdschon ganz schwindelig vom ganzen Weirdchampen wenn ich C++ programmieren muss. Tommy Dankeschönfür den Sub. Ich hab übrigens gar nicht gesehen wer alles noch subscribt hat. Hier Tommy Dankeschönvor einer Minute. Der Alex ist auch am Start. Huza 345 war auch Subscribed. Domtorretto.Und davor der Krelax den hab ich schon. Dankeschön Leute für die ganzen 5 hat mega 6 hatbig brain subscriptions. Ihr werdet übrigens gerade im Teams angerufen hab ich gehört.Hadeschamp ich weiß. Macht demnächst eine Arduino C++ Session haben wir schon öftersgemacht. Wofür braucht man denn eigentlich C++? Man braucht C++ überall dafür wo esleider nichts anderes gibt. Zum Beispiel um Microcontroller oder ESPs und Arduinos undsonst was zu programmieren. Das ist da gibt es keine guten Alternativen zu C++. Du hastzwar MicroPython damit hast du andere Probleme. Du hast eine minimal Rust Geschichte die auchnicht richtig funktioniert. Also im Prinzip bleibt dir da gerade für Arduino und allesArduino kompatible nicht viel übrig. Nehmst du was nicht Arduino kompatibles dann istdas alles einfach nur klassisches C. Aber Arduino Arduino kompatibel ist C++ und dableibt dir nicht viel übrig. Sebi Dankeschön für den Sub. Übrigens auch der Grund warumich immer Unreal also sollte ich mal sollte ich mal jemals ein Spiel programmieren wollen.Ich würde Instant Unity nehmen wegen C Sharp und und zu Unreal würde ich würde ich sagen.Allein schon wenn ich da das C++ Gewurste sehe. Ich weiß man kann Unreal auch überdiesen komischen Blueprint Editor machen aber ich habe letztens ein Video gesehen von einemder hat versucht eine Tür zu programmieren in Unreal die auf und zu geht und also dierichtig rum auf und zu geht und er hat irgendwie einen halben Bildschirm voller Kästchen undverbundenen Input Outputs mit gehabt. Sowas sind fünf Zeilen C++ Code warum soll ichdas in irgendeinem Blueprint machen. Sag ich jetzt als Unreal Noob ich habe keine Ahnungdavon. Aber da kann ich nichts zu sagen da habe ich nie großartig großartig was mitgemacht. Aber ich würde sofort Unity verwenden weil es die Sharp unterstützt. Ist C++ inder Hinsicht vergleichbar. C ist in sich schlüssig C++ überhaupt nicht.Java oder C Sharp ist eigentlich egal. Ich persönlich bin für C Sharp. C Sharp ist dieschönere Sprache aber Java geht auch. Wenn ich unsere Java Programmierer auf der Arbeitsehe die wollen alle Kotlin verwenden und kriegen immer Anfände dafür dass sie denganzen Projekt nicht richtig machen können. Oh ne Splatoon Musik. Ich muss skippen. Skippja also C Sharp ist die schönere Sprache. Kotlin soll wirklich nice sein was ich vonden Leuten auf der Arbeit an Java programmieren kann. Ich habe hier ein paar Konferenztalksund so schon geguckt. Macht so einen Eindruck aus einer Mischung aus C Sharp Ruby und Swiftso ein bisschen Kotlin aber wäre mir auf jeden Fall lieber als Java selbst. DankeschönUnity für zwei Monate Subscription. Ne ne wie gesagt Game Programmierung ist wirklichwas da habe ich gar keinen Zug dazu. Ich Theorie crafte und so übelst gerne in Games aberich bin da wahrscheinlich auch viel zu unkreativ für irgendwelche Spiele zu machen. Heißenist eine super Einsteiger Programmiersprache. Wofür wird Swift benutzt? iOS und Mac Anwendung.Ich meine wenn eine Sache noch ähnlich schlimm wie C++ ist dann wahrscheinlich ObjectiveC. Außer Apple hat ja niemand die Dreistigkeit besessen allen Ernstes jahrelang ObjectiveC zu verwenden. Du bringst jetzt CSS bei für eine Webseite für die Jugend. Ja das istauch ein guter Einstich. Du wirst früher oder später auf jeden Fall an ein bisschenJavascript nicht vorbeikommen. Bin ich mir ziemlich sicher. Und also der Grund warumich immer sage Javascript ist die beste Einsteiger Programmiersprache. Du brauchst nichts außereinen Browser und du lernst wichtige Sachen was du früher oder später brauchst. Du kommstan Frontend Sachen heutzutage einfach nicht mehr vorbei. Bisschen Javascript bisschenhat er im L und CSS muss heutzutage jeder können. Er ist zwar übertrieben gesagt sogarein Cobol Backend Programmierer. Wobei es da der wahrscheinlich noch am besten ohneklar kommt. Was Quatsch. Python hat mit C++ gar nichts zu tun. Ich weiß worauf du rauswillst. Du willst darauf raus dass das Standard Python C++ programmiert ist aber das istdoch egal. Die Standard.NET Implementierung war auch in C++ mal ursprünglich. Who cares.Die könnten auch in Rust oder in Cobol sein. Wär doch vollkommen egal. Ja ich bin auchnicht der große Css Kenner. Ich lerne jedes mal wenn ich Css benutze Neues dazu. Es gibtja mittlerweile so ultra viele kryptische Selektorsachen in Css. Das ist mir zu bigbrain an vielen Stellen. Du kannst ja mittlerweile ganze Spiele quasi fast schon in Css Onlygewinnen. Also simple Spiele. Ich glaube es gibt schon in 4 gewinnt. Only in Css und sowas.Aber der geilste Typ war immer noch. Also das abgedrehteste was ich bisher gesehen habeist von zweckentfremdeten Tools ist. Irgendjemand hat einen Hex zu Binary Converter in RubyRegex programmiert. Also er hat wirklich rein in Regex einen Hex zu Binary Converter programmiert.Das ist wirklich massive brain. Genau wir machen ab jetzt alle. Wir programmierennur noch in Binary mit Hex Editor. Also die meistverbreitete IDE ist ja tatsächlichExcel wenn du es so willst. Ja es ist echt so. Excel ist die IDE der Sekretärin dieserWelt. Kenn ich nicht. Ja Moment das ist mit JavaScript. Das ist mit JavaScript. Das sindübrigens die Half Life 2 Texturen. Man kann übrigens nicht schießen. Das ist mit JavaScripthier klar. Das ist überhaupt kein Problem. Das funktioniert. Mit JavaScript kannst duviel machen. Ja guck dir mal ein Video dazu an was die beste Einsteigerprogrammierspracheist. AC Dankeschön für den Sub. 3 Monate Big Brain Subscriptions hier. Flintstone 7Monate. Auf halbem Weg zum Hypersubscriber hier. Aber noch nur. Habt ihr eigentlichdie GIF Emotes schon gesehen? Alle? Wir haben 2 GIF Emotes. Die ihr nur verwenden könntals Primesub. Also wer noch nicht geprimesubbt hat jetzt ist die optimale Gelegenheit wenneuch der Content gefällt zu Primesubben. Und wenn ihr geprimesubbt habt ist natürlich schöndass ihr wieder am Start seid. Ich glaube jetzt habe ich es richtig gemacht in Selloutoder? Der war gut. Oh ne da wird wieder gesungen. Perfekt. Ja ok Leute. Das funktioniert. Dankefür die Subs. Spore Sirius und UD YZ Dankeschön für euer Primesub. Exzellent Sellout. Ichhabe letztens ein Tool gesehen. Das war ein Excel Plugin. Dass du echtes SQL und inlineC-Sharp Programme in Excel programmieren kannst. 27. Add Subscribe. Primesub. Dankeschön.Beste Sellout. Ja das hat hart funktioniert. Can't wait. Ok Leute ich bin durch. Es gibtnichts Neues mit Invisual Studio mehr was wir uns noch nicht schon angeguckt haben. Dasist ein sehr mageres Preview Release von Microsoft. Also hätten wir sich fast sparen können.Wie fandet ihr die Intelli Code? Seid ihr auch der Meinung das ist Magic? Intelli wardas auch Magic. Es ist ziemlich Maui. Es ist ziemlich Maui. Ja da hast du recht. Welchesist eigentlich das beste Liedungsjahr für was? Für Desktop, für Server, für sonstwie. Das kann man so pauschal nicht beantworten. Also ich habe am liebsten Ubuntu auf dem Serverund Manjaro auf dem Desktop. Und das ganze aber auch in der VM. Weil ich habe als HostWindows und als vor allem Linux. Das ist für mich die beste Kombination aus beiden Welten.Linux lässt sich auch super virtualisieren unter Windows. Im Gegensatz zu Windows unterLinux. Arch by the way. Ist noch schön. Wenn es dir gefällt ist Ziel erfüllt. Big Prane.Die Streams dienen ja prinzipiell zur IQ Steigerung des Chats. Das sind wir uns ja einig. Ichmeine belegt euch mal wie viele IQ Increases es hier schon gegeben hat. Die Leute habenalle schon Köpfe. Die sind schon doppelt so groß wie vorher. Und ist bei mir ja auchso. Ich lerne ja hier auch was dazwischen. Ich habe heute zum Beispiel. Ich habe es schonwieder vergessen aber ich habe irgendwas gelernt. Ich habe vorhin nämlich noch gesagt heutelerne ich wieder was. Achso Output. Console Output. UTF-8 Konsolen Output. Ja ist schon.Ist schon. Das ist schon ein massiver Sixhead hier. Ist da Frasier eigentlich immer am Start?Haben wir irgend einen den wir hosten können? Lost ist auch nicht da. Frasier ist auch nichtda. Dann hoste ich niemanden. WubTube Champ. Ey heute nicht. Ist der on? Ist der on derWubTube Champ? Ey WubTube Champ ist off. Sieht jemand Science and Technology? Gucken wir malTwitch. Was haben wir dazu bieten auf Twitch Science and Technology? Komm mal. Bam. Reactund TypeScript auf Spanisch. Oder was ist das für? Ist das Spanisch? Live Earthquake.Live from space. Boah Poggers. Die NASA ist am Start. Ihr wisst ja. Die IES ist ja eigentlichunter Wasser und das sieht man bei den Aufnahmen immer, weil nebenbei da steigen Wasserblasendran vorbei. Ihr müsst ja mal bei Außenaufnahmen dran warten. Ey das ist ernsthaft eine legitVerschwörungstheorie aktuell. Also ich hab das schon an vielen Stellen gelesen, dassdie IES angeblich unter Wasser ist und man Wasserblasen sieht. Irgendwann überzeugensie mich auch noch davon. Was programmiert sie? War? Input? Int? Ah. Go. Das ist Go.Aus den Eulenstells. Der guckt Videos. Ich wollte gerade sagen, das ist doch der VeritasiumTyp. Ich guck mir jetzt die NASA noch ein bisschen an, wenn ich auf gehe. Komm mal jetzthaben sie den eingepackt. SOS. Eject. Ok Leute. Wie immer gesagt, ich geh jetztauf. Also wir sehen uns im nächsten Stream. Machts gut. See you.", "segments": [{"id": 1, "start": 60.0, "end": 75.0, "text": "Das war's für heute. Vielen Dank für's Zuhören und bis zum nächsten Mal."}, {"id": 2, "start": 90.0, "end": 119.0, "text": "So, da bin ich wieder. Ich hab euch gesagt, heute Abend gibt's noch mal"}, {"id": 3, "start": 119.0, "end": 127.0, "text": "einen kleinen Stream, aber aus 69 Zuschauer. Huge. Ich mal gucken, wie lange wir dafür"}, {"id": 4, "start": 127.0, "end": 132.0, "text": "brauchen. Also ich hab mir ein Video von Microsoft eingeschaut. Ich glaube, so viel gibt's da"}, {"id": 5, "start": 132.0, "end": 139.0, "text": "nicht zu gucken im ersten Preview. Aber probieren wir mal aus. Erstmal das ganz bisschen kleiner"}, {"id": 6, "start": 139.0, "end": 144.32, "text": "machen. Ich hab grad gefuttert, Leute. Ich bin mega voll gefressen. Ich hab heute Mittag"}, {"id": 7, "start": 144.32, "end": 148.44, "text": "schon so viel gefuttert und heute Abend jetzt noch mal. Heute hab ich Garantie nicht abgenommen."}, {"id": 8, "start": 148.44, "end": 158.44, "text": "Ich weiß nicht, ob wir wirklich Windows 11 nehmen sollen. Wir können das mal ausprobieren."}, {"id": 9, "start": 158.44, "end": 166.2, "text": "Wir gucken mal, ob das unter Windows 11 läuft. Probieren wir mal aus. Zweifelsfall haben"}, {"id": 10, "start": 166.2, "end": 177.12, "text": "wir hier noch ein anderes Windows. Windows 11. Warum hab ich da Steam installiert? Ach,"}, {"id": 11, "start": 177.12, "end": 191.56, "text": "das war die WinGet-Testkiste. Läuft bestimmt, denke ich auch. Denke ich auch, dass das läuft."}, {"id": 12, "start": 191.56, "end": 200.32, "text": "Also, ich zeige euch mal was, Leute. Und zwar, es gibt jetzt seit gestern gibt es eine oder"}, {"id": 13, "start": 200.32, "end": 210.36, "text": "seit vorgestern eine Preview-Version von Wishlist Studio 2022. Ich persönlich verwende ja schon"}, {"id": 14, "start": 210.36, "end": 217.76, "text": "eine ganze Weile kein Wishlist Studio mehr, weil ich bin komplett auf Linux als Hauptplattform"}, {"id": 15, "start": 217.76, "end": 222.84, "text": "und Rider als, also fürs Programmieren und Rider als IDE umgestiegen, was dort Netz-Sachen"}, {"id": 16, "start": 222.84, "end": 229.76, "text": "angeht. Übrigens, das Video von Microsoft für die 2022er Preview ist richtig schlecht."}, {"id": 17, "start": 229.76, "end": 238.28, "text": "Guckt euch das mal an. 22 Sekunden YouTube-Video ohne Sound, ohne alles. 64bit ist es angeblich"}, {"id": 18, "start": 238.28, "end": 243.52, "text": "jetzt. Es gibt irgendwie ein neuer Intelli-Code. Ich weiß nicht, warum es Intelli-Code ist."}, {"id": 19, "start": 243.52, "end": 248.68, "text": "Früher hat sich das Ganze IntelliSense genannt, aber wahrscheinlich hat sich Microsoft gedacht,"}, {"id": 20, "start": 248.68, "end": 255.04, "text": "IntelliSense ist einfach zu oldschool. IntelliCode mit AI-powered Completion ist viel besser."}, {"id": 21, "start": 255.04, "end": 262.72, "text": "Warum auch immer, also ich habe den Vorteil noch nicht so genau erkannt von AI-Code-Completion."}, {"id": 22, "start": 262.72, "end": 272.6, "text": "Ich weiß, es gibt ein paar Ansätze. Es gibt ein paar Ansätze dafür. Aber ja, man hat AI-Dev-Verbrauch,"}, {"id": 23, "start": 272.6, "end": 278.56, "text": "ich weiß nicht. Also die Sachen zu sortieren und die Möglichkeit zu bieten, zu sortieren"}, {"id": 24, "start": 278.56, "end": 284.92, "text": "nach was am meisten benutzt wird, ist ja vollkommen in Ordnung. Aber dass das jetzt irgendwie"}, {"id": 25, "start": 284.92, "end": 290.52, "text": "kontextbasiert wüsste, was ich als nächstes programmieren will, da habe ich noch so meine"}, {"id": 26, "start": 290.52, "end": 303.2, "text": "Zweifel, ja. So, es ist möglich, dass man jetzt.NET 6 und.NET Maui drin direkt programmiert."}, {"id": 27, "start": 303.2, "end": 306.6, "text": "Weiß nicht, ob man ausprobieren kann. Ich glaube auch nicht, dass es schon drinne ist."}, {"id": 28, "start": 306.6, "end": 312.68, "text": "Zumindest, ich persönlich bin eh nicht sonderlich scharf auf.NET Maui, weiß nicht, mal gucken."}, {"id": 29, "start": 312.68, "end": 324.76, "text": "DakuX-TV, danke schön für 18 Monate Subscription. Excellent Hyper-Subscription. Neo-Wim-Only,"}, {"id": 30, "start": 324.76, "end": 331.08, "text": "also man kann ja, ich mag ja Wim. Aber für.NET-Entwicklung genauso wie für Java-Entwicklung"}, {"id": 31, "start": 331.08, "end": 345.4, "text": "oder sowas ist Wim kacke. Die trockene Luft von der Klimaanlage sackt, aber dafür ist"}, {"id": 32, "start": 345.4, "end": 360.36, "text": "es wenigstens schön kühle 23,8 Grad hier. Was ist.NET-Maui? Der Versuch von Microsoft"}, {"id": 33, "start": 360.36, "end": 365.28, "text": "eine Cross-Platform GUI-Framework zu basteln, was lustigerweise nicht Cross-Platform ist,"}, {"id": 34, "start": 365.28, "end": 381.76, "text": "weil es nicht auf Linus läuft. Und leider, und leider, meiner Meinung nach auch den falschen"}, {"id": 35, "start": 381.76, "end": 388.2, "text": "Ansatz verfolgt. Platter macht es richtig, macht es richtig, Maui unter Forksamarin war,"}, {"id": 36, "start": 388.2, "end": 394.8, "text": "ist meiner Ansicht nach der falsche Ansatz. Noch eine GUI-Framework von MS, ja, zumal"}, {"id": 37, "start": 394.8, "end": 406.44, "text": "die es ja noch nicht, die man unter Windows geschissen kriegen. So, ich, ich starte das"}, {"id": 38, "start": 406.44, "end": 411.68, "text": "Ding mal neu. Ihh, das ist so hässlich mit die, warte mal, wie, Moment, wie, wie restartet"}, {"id": 39, "start": 411.68, "end": 420.16, "text": "man das jetzt überhaupt? Leute, es gibt Updates für Windows 11, soll ich die installieren"}, {"id": 40, "start": 420.16, "end": 435.76, "text": "oder prickt es mir das System? Boards Jam? Äh, Update, da steht doch immer da, was es"}, {"id": 41, "start": 435.76, "end": 444.68, "text": "für Updates gibt, oder? Das Kumulativ-Update für.NET, für Windows 10 Version Next. Ich"}, {"id": 42, "start": 444.68, "end": 450.52, "text": "hab doch gesagt letztens, ich hab letztens noch gesagt, das sieht aus wie Windows 10"}, {"id": 43, "start": 450.52, "end": 458.12, "text": "X und Windows 10 zusammengemercht und das ist es anscheinend auch. Exposed Microsoft,"}, {"id": 44, "start": 458.12, "end": 466.04, "text": "ja gut, Update & Restart, wollen wir mal nicht so sein. Snapshot, Snapshot ist für Noobs,"}, {"id": 45, "start": 466.04, "end": 470.8, "text": "YOLO-Update. Wenn nicht, ich hab ja noch ein Windows 11 VM, in dem wir es probieren können."}, {"id": 46, "start": 470.8, "end": 476.8, "text": "Also, ich werde es mir nicht auf meinem Desktop installieren, weil es garantiert wird irgendwie"}, {"id": 47, "start": 476.8, "end": 483.8, "text": "gedürnt installiert, was ich nicht haben will. Macht das in der VM und gut ist. Bill hat"}, {"id": 48, "start": 483.8, "end": 492.4, "text": "Git Merge gemacht. Ich glaube Bill hat gerade Probleme, mit Merge hat es Bill gerade nicht"}, {"id": 49, "start": 492.4, "end": 499.64, "text": "so, der ist gerade dabei seine Ehe quasi zu, also das Gegenteil von Mergen, gibt es ja Forken,"}, {"id": 50, "start": 499.64, "end": 515.44, "text": "der forkt sein, der forkt gerade. Mergen. So, warum geht Xbox auf? What the fuck? Nein,"}, {"id": 51, "start": 515.44, "end": 524.64, "text": "Xbox, gehst du weg? Kann ich nur sagen, Xbox. Ok, jetzt schauen wir mal, ob man das Ganze"}, {"id": 52, "start": 524.64, "end": 533.72, "text": "in der Windows 11 installieren kann. Wishful Studio 2022. Nach guter Microsoft Tradition"}, {"id": 53, "start": 533.72, "end": 540.08, "text": "müsst du Wishful Studio 2022 eigentlich jetzt mal rauskommen. Also zumindest FIFA, FIFA"}, {"id": 54, "start": 540.08, "end": 546.52, "text": "Style technisch wäre das schon längst der Fall gewesen. Will das nicht auf Deutsch"}, {"id": 55, "start": 546.52, "end": 568.08, "text": "laden? Kann ich das nicht auf Englisch laden? Ja, besser. Community. Jawoll, save. Ok, zeige"}, {"id": 56, "start": 568.08, "end": 574.76, "text": "ich mal her. Ok, das ist immer noch ein Elektron Installer. Windows 11 Wishful Studio, willkommen"}, {"id": 57, "start": 574.76, "end": 583.36, "text": "in der Zukunft. Ja, wir sind schon, wie sagt es, mir starft nicht? Ach ne, ne, ne, ne, ne,"}, {"id": 58, "start": 583.36, "end": 588.32, "text": "immer noch. Ja Leute, das ist die Zukunft hier. Nächstes Jahr sieht es für alle euch,"}, {"id": 59, "start": 588.32, "end": 594.76, "text": "sieht es jetzt bei euch, für alle von euch so aus. Kann nicht mal normal reden. Der Installer"}, {"id": 60, "start": 594.76, "end": 614.24, "text": "ist mittlerweile WPF. Wirklich? So ganz funktioniert das aber nicht hier oben, oder? Also was wollen"}, {"id": 61, "start": 614.24, "end": 625.56, "text": "wir denn haben?.NET und Web Development? Alter Mann. Richtig, richtig thick..NET Desktop"}, {"id": 62, "start": 625.56, "end": 633.64, "text": "Development? Wollen wir testen? Das geht eh relativ schnell im Download. Und? Muss man"}, {"id": 63, "start": 633.64, "end": 641.44, "text": "irgendwie Cross Platform GUI oder so? Gibt es irgendwie Cross Platform? Gab es da nicht"}, {"id": 64, "start": 641.44, "end": 652.16, "text": "eine Cross Platform Häkchen? Gibt es nicht mehr, oder? Vergiss dir Plus Plus. Nein, nein,"}, {"id": 65, "start": 652.16, "end": 667.28, "text": "nein, nein, nein. Ich werde am Leben da, kannst dir Plus Plus machen. Ok, das ist wirklich"}, {"id": 66, "start": 667.28, "end": 673.56, "text": "ein WPF Installer. Moment, Moment, das glaube ich nicht. Komm mal einen Prozess Explorer."}, {"id": 67, "start": 673.56, "end": 683.44, "text": "Mal schauen, mal schauen, ob das wirklich nach WPF aussieht. Sys, Sys Internals Prozess"}, {"id": 68, "start": 683.44, "end": 691.8, "text": "Explorer, ja genau. Warum alle auf abgerundete Ecken stehen, ich weiß nicht. Wahrscheinlich"}, {"id": 69, "start": 691.8, "end": 696.8, "text": "ist es denen relativ egal, die wollen einfach was anderes haben. Und die haben sich gedacht,"}, {"id": 70, "start": 696.8, "end": 700.76, "text": "wir hatten jetzt schon Ecken, die transparent waren und wir hatten eckige Ecken und jetzt"}, {"id": 71, "start": 700.76, "end": 710.88, "text": "brauchen wir runde Ecken. Ja, ich agree. So, zeig mal, hier ist der Visual Studio Installer,"}, {"id": 72, "start": 710.88, "end": 723.76, "text": "ist das WPF? Äh, ups, falsch rum. Ja, Setup. Ja, so wirklich erkennen tut man da nichts."}, {"id": 73, "start": 723.76, "end": 728.2, "text": "Es sieht auf jeden Fall nicht so krass Browser-mäßig aus, weil Browser-technisch hätte es jetzt"}, {"id": 74, "start": 728.2, "end": 736.4, "text": "erstmal 50 Background-Dinger, das könnte schon durchaus WPF sein. Ja, das ist tatsächlich"}, {"id": 75, "start": 736.4, "end": 741.72, "text": "anscheinend ein, ob es ein WPF ist, keine Ahnung, aber ein netter Ding, also wahrscheinlich"}, {"id": 76, "start": 741.72, "end": 755.8, "text": "ein WPF. Ja, Mark Dick WPF verwenden sie. Ok, der Windows Installer ist jetzt WPF. Sachen"}, {"id": 77, "start": 755.8, "end": 774.28, "text": "gibt es, hätt ich nicht gedacht. Die Musik ist mit zum Onkar-S, kurz skippen. Ok, früher"}, {"id": 78, "start": 774.28, "end": 779.04, "text": "hatten die hier was Cross-Platform, weil ich wollte, angeblich gibt es nämlich neue Tests,"}, {"id": 79, "start": 779.04, "end": 784.04, "text": "die man Cross-Platform laufen lassen kann, schauen wir mal. Egal, install while downloading,"}, {"id": 80, "start": 784.04, "end": 790.72, "text": "macht es. Das dürfte nicht allzu lange dauern, ich denke mal so 10 Minuten, wenn es hoch"}, {"id": 81, "start": 790.72, "end": 805.6, "text": "kommt. Ihr seht, das ist ziemlich schnell. Der File Explorer von Windows 11 ist maximale"}, {"id": 82, "start": 805.6, "end": 814.0, "text": "Platzverschwendung. Wieso, sieht doch eigentlich fast so aus wie der alte. Also, da ist doch"}, {"id": 83, "start": 814.0, "end": 823.68, "text": "so großer Unterschied ist da jetzt doch nicht, weil die Ribbons außen-vorder, aber wo ist"}, {"id": 84, "start": 823.68, "end": 832.72, "text": "da der große Unterschied? Es ist doch mehr oder weniger genau das gleiche. Ah, da ist"}, {"id": 85, "start": 832.72, "end": 850.4, "text": "viel Platz dazwischen, ok, das stimmt. So nicht mehr. Öffne mal einen Ort, naja, hab"}, {"id": 86, "start": 850.4, "end": 864.56, "text": "ich ja. Ah, sieht doch ok aus. Boomer-Ansicht ist das ja. Kann man das ejecten? Wow, knapp"}, {"id": 87, "start": 864.56, "end": 887.84, "text": "am Kopf vorbei hier. Ah, PainsChamp, witzig, weiß. So, wie sieht der Installer aus? Es"}, {"id": 88, "start": 887.84, "end": 898.36, "text": "geht halbwegs zack, ich click once, Bootstrapper, diese Namen von diesen Packages immer. Wisst"}, {"id": 89, "start": 898.36, "end": 902.2, "text": "ihr was ich nicht verstehe, warum schafft es eigentlich Microsoft nicht seit Windows"}, {"id": 90, "start": 902.2, "end": 907.92, "text": "10 ist es glaube ich erst, keine Beispielmusik und keine Beispiel Clips und Bilder mehr mitzuliefern."}, {"id": 91, "start": 907.92, "end": 911.52, "text": "Bei Windows XP hat es ja immer noch diese 8 Standardbilder, dass du wenigstens siehst,"}, {"id": 92, "start": 911.52, "end": 918.48, "text": "wie das ausschaut standardmäßig. Hat sich Microsoft gedacht, nee, wer braucht schon"}, {"id": 93, "start": 918.48, "end": 942.0, "text": "ein Bildchen, haben die sich gedacht. Da letztens, wo war hier, ich glaube bei Golem, oder was"}, {"id": 94, "start": 942.0, "end": 951.52, "text": "war das, habe ich einen Artikel über agile Softwareentwicklung gelesen. Was ich da witzig"}, {"id": 95, "start": 951.52, "end": 961.84, "text": "fand ist die, ich glaube bei Heise war es, was ich da witzig fand ist die Forumsdiskussion,"}, {"id": 96, "start": 961.84, "end": 976.32, "text": "warum ist das so lang. Zumindest die Forumsdiskussion war wieder lustig, wo sie sich darüber aufgeregt"}, {"id": 97, "start": 976.32, "end": 980.16, "text": "haben, also Entwickler wieder darüber aufgeregt haben, dass sie einen halben Tag auf irgendwelchen"}, {"id": 98, "start": 980.16, "end": 985.72, "text": "Sprints, Scrums, Dailys, sonst wie rumstehen und dann kam irgendein Typ in den Kommentaren"}, {"id": 99, "start": 985.72, "end": 990.64, "text": "und meinte, ihr macht das ja auch falsch und hat dann gesagt, man soll quasi immer mit"}, {"id": 100, "start": 990.64, "end": 995.88, "text": "dem, wie heißt das, mit dem Scrum Handbuch oder so rumlaufen und immer nachschlagen oder"}, {"id": 101, "start": 995.88, "end": 1000.84, "text": "sowas. Ich wusste gar nicht bis zu dem Zeitpunkt, dass es einen Scrum Handbuch überhaupt gab."}, {"id": 102, "start": 1000.84, "end": 1011.64, "text": "Agile Master Scrum Handbuch, der Scrum Guide, jawoll endlich, endlich, da wurde das, i,"}, {"id": 103, "start": 1011.64, "end": 1023.76, "text": "das ist Wörth, das ist die Fault, das ist die Fault Wörth 2007, Alter, i. Ah ja genau"}, {"id": 104, "start": 1023.76, "end": 1032.2, "text": "Alex, das meine ich, den Artikel meine ich, ja genau, genau. Ja, den meine ich. So, dann"}, {"id": 105, "start": 1032.2, "end": 1036.92, "text": "habe ich irgendwie in den Kommentar Diskussionen einen gehabt, der hat dann erzählt, dass er,"}, {"id": 106, "start": 1036.92, "end": 1045.8, "text": "dass er immer mit dem Scrum Handbuch rumlaufen soll und sowas. Wahrscheinlich das Agile Manifest,"}, {"id": 107, "start": 1045.8, "end": 1054.08, "text": "ne, ne, ne, ne, ne, es ging um das Scrum Handbuch hier, der Scrum Guide, das ist nur für die"}, {"id": 108, "start": 1054.08, "end": 1064.48, "text": "coolen Leute. AgileHeroes.de, die Rakete darf nicht fehlen, was sonst? Nein, ich will keine"}, {"id": 109, "start": 1064.48, "end": 1071.16, "text": "Push Notifications von euch haben. Die agilen Helden mit Rakete scheinen ja super beliebt"}, {"id": 110, "start": 1071.16, "end": 1088.76, "text": "zu sein hier. Und das ist auch äußerst beliebt auf Amazon. So, ach ne, please, ich will,"}, {"id": 111, "start": 1088.76, "end": 1093.32, "text": "ich will nicht sign innen, Microsoft, lass mich, kann ich das nicht einfach benutzen"}, {"id": 112, "start": 1093.32, "end": 1099.56, "text": "ohne zu sign innen. He doesn't know, he lacks critical information. Geht das, geht das nicht"}, {"id": 113, "start": 1099.56, "end": 1106.88, "text": "auch ohne? Oh no, jawoll, perfekt. So, es erkennt schonmal nicht das Betriebssystem-Theme,"}, {"id": 114, "start": 1106.88, "end": 1111.88, "text": "das ist schonmal Fail. Warum erkennt es nicht standardmäßig, dass ich Dark-Theme habe und"}, {"id": 115, "start": 1111.88, "end": 1120.0, "text": "mach das, verwende das auch. Developer Settings, General, Visual, C-Sharp, General ist okay,"}, {"id": 116, "start": 1120.0, "end": 1135.68, "text": "das andere darfst du erst machen, wenn ich C-Sharp Projekt einstelle, alles gut. Repairing,"}, {"id": 117, "start": 1135.68, "end": 1143.72, "text": "der offizielle Post-Champ-Screen von Microsoft. So, also, jetzt müssen wir nochmal kurz in"}, {"id": 118, "start": 1143.72, "end": 1149.08, "text": "dieses What's New Dokument gucken, dass wir auch wissen, was wir schauen müssen. Also,"}, {"id": 119, "start": 1149.08, "end": 1154.2, "text": "es gibt ja einmal dieses Video und es gibt ein anderes Video, was ich gefunden habe,"}, {"id": 120, "start": 1154.2, "end": 1166.52, "text": "das ist von Abild, da stellt Microsoft das ganze selbst vor. Warum, warum sind eigentlich"}, {"id": 121, "start": 1166.52, "end": 1179.92, "text": "die Kommentare offgeturnt und warum hat das Video so schlechte Bewertung? Ah, yes, exzellent"}, {"id": 122, "start": 1179.92, "end": 1192.2, "text": "Intro. Ich glaube, 8 Minuten überleben wir noch, oder? Lass wir uns mal zeigen. Wo, wann"}, {"id": 123, "start": 1192.2, "end": 1203.32, "text": "geht das los? Hier, ne, wann zeigt der dann was? Hallo? What the fuck? Zeigen die auch"}, {"id": 124, "start": 1203.32, "end": 1217.72, "text": "irgendwas? Ah, hier, okay. Okay, man kann Dateien schnell öffnen, das kann ich jetzt"}, {"id": 125, "start": 1217.72, "end": 1227.6, "text": "nicht ausprobieren, weil ich hab kein so großes Projekt, wir können vielleicht irgendwo eins"}, {"id": 126, "start": 1227.6, "end": 1237.32, "text": "von GitHub öffnen oder so. Was ist ein schönes großes.NET Projekt auf GitHub? So eine Solution"}, {"id": 127, "start": 1237.32, "end": 1243.56, "text": "oder so. Fällt da irgendjemand was ein? Der Wind aus Taschenrechner ist es ja leider nicht."}, {"id": 128, "start": 1243.56, "end": 1251.52, "text": "ShareX ist eine gute Idee, perfekt, das machen wir. Okay, also das Öffnen von großen Projekten"}, {"id": 129, "start": 1251.52, "end": 1263.28, "text": "geht jetzt schneller, alles klar. Das probieren wir tatsächlich mal aus. ShareX, GitHub, ShareX,"}, {"id": 130, "start": 1263.28, "end": 1277.12, "text": "nicht zu verwechseln mit Xshare. So, können wir das ganze mal klonen hier. Ja, perfekt."}, {"id": 131, "start": 1277.12, "end": 1283.96, "text": "Klonen. Stimmt, jetzt können wir gleich mal was neues ausbringen, die haben doch das Windows"}, {"id": 132, "start": 1283.96, "end": 1296.0, "text": "mit dabei, alles klar. Haben die auch Shit vorinstalliert? Nein. ShareX ist ein Screenshot"}, {"id": 133, "start": 1296.0, "end": 1301.28, "text": "Programm, aber wir verwenden jetzt einfach nur, dass wir eine große... Klone Repository,"}, {"id": 134, "start": 1301.28, "end": 1304.88, "text": "okay, das kann, guck mal, das kann Wishlist Studio selbst, da braucht man gar keine Shit"}, {"id": 135, "start": 1304.88, "end": 1326.64, "text": "Command Line für das da, bam. Klonen. Guck mal, hier richtig highly advanced. Ich will"}, {"id": 136, "start": 1326.64, "end": 1341.36, "text": "nix committen. Close. So, okay, hat es das jetzt besonders schnell? Ach hier, okay, jetzt"}, {"id": 137, "start": 1341.36, "end": 1344.56, "text": "gucken wir mal, wie schnell er das öffnet. Ich habe jetzt keinen Vergleich, aber mal"}, {"id": 138, "start": 1344.56, "end": 1361.24, "text": "schauen. Das ist schon verhältnismäßig schnell. Das ist schon verhältnismäßig schnell. Ah,"}, {"id": 139, "start": 1361.24, "end": 1367.88, "text": "das ist noch gar nicht fertig, jetzt. Alter, was ist das denn für... Ich mag den Press"}, {"id": 140, "start": 1367.88, "end": 1373.0, "text": "of the Wild Soundtrack nicht, ich brauche jetzt irgendwas anderes. Irgendwas... Relaxing"}, {"id": 141, "start": 1373.0, "end": 1398.6, "text": "Spring Music, okay. Ne. Ne. Pirate Music. Nope. Gamecube Nostalgik. Ah, ich weiß nicht."}, {"id": 142, "start": 1398.6, "end": 1420.76, "text": "Ne. Try Not to Dance Challenge, okay. Wir dansen nicht. Wir pippen, wir pippen, oder"}, {"id": 143, "start": 1420.76, "end": 1438.32, "text": "Cat Jammen. Okay, wunderbar. Warum geht das nicht? Hat das nicht Restored oder was? Sollte"}, {"id": 144, "start": 1438.32, "end": 1448.84, "text": "ich eigentlich Abhängigkeiten mit standardmäßig runterladen? Hast du schon Windows 11 gestreamt,"}, {"id": 145, "start": 1448.84, "end": 1454.04, "text": "oder? Jaja, das ist ja hier Windows 11. Relax, Dankeschön für den Hypersubscription hier,"}, {"id": 146, "start": 1454.04, "end": 1467.6, "text": "den 18 Monate Sub. Das ist die neue Default Schriftart, die jetzt dabei ist, ne. Wie hießen"}, {"id": 147, "start": 1467.6, "end": 1473.36, "text": "das Ding nochmal? Also Lucida Console ist out, Consolas ist auch out, sondern Standard Schrift"}, {"id": 148, "start": 1473.36, "end": 1479.8, "text": "ist jetzt, wenn ich das finden würde, Fonts und Colors, Standard Schrift... Alter, Puschel"}, {"id": 149, "start": 1479.8, "end": 1489.0, "text": "Studio, come on. Cascadia Mono ist es jetzt. Cascadia Mono. Microsoft hat sich gedacht,"}, {"id": 150, "start": 1489.0, "end": 1493.44, "text": "es kann nicht sein, dass JetBrains ne eigene Schrift hat, Adobe ne eigene Schrift hat,"}, {"id": 151, "start": 1493.44, "end": 1498.36, "text": "IBM ne eigene Schrift hat, Apple ne eigene Schrift hat, Google ne eigene Schrift hat."}, {"id": 152, "start": 1498.36, "end": 1503.0, "text": "Da hat sich Microsoft gedacht, wir haben ja erst 50 eigene Schriften, wir brauchen jetzt"}, {"id": 153, "start": 1503.0, "end": 1511.28, "text": "noch eine. Das Windows 11 Logo startet uns an, kannst du das zensieren? Inwieweit starte"}, {"id": 154, "start": 1511.28, "end": 1521.8, "text": "ich das an? Ist das hier zu rechteckig, zu symmetrisch, oder? Was ist denn deine Meinung"}, {"id": 155, "start": 1521.8, "end": 1529.96, "text": "zu Windows 11? Ich kann dazu noch überhaupt nichts sagen. Eins was mich zum Beispiel nervt"}, {"id": 156, "start": 1529.96, "end": 1536.28, "text": "ist, dass das anscheinend die Gruppierung standardmäßig an ist. Also guckt, wenn ich jetzt hier ein"}, {"id": 157, "start": 1536.28, "end": 1544.16, "text": "paar Fenster aufmache, dann sind die standardmäßig gruppiert, das nervt mich richtig. Also das"}, {"id": 158, "start": 1544.16, "end": 1552.04, "text": "nervt mich extrem, ich hasse diese Gruppierungen-Geschichte. Ich kann leider keine Settings machen, weil"}, {"id": 159, "start": 1552.04, "end": 1560.04, "text": "ich es nicht aktiviert habe. Falls jemand irgendeinen Studentencode hat, kann er mir"}, {"id": 160, "start": 1560.04, "end": 1571.44, "text": "den ja gerne schicken und ich aktiviere schnell. Aber geht das gar nicht so. Also das Öffnen"}, {"id": 161, "start": 1571.44, "end": 1576.64, "text": "von Projekten ging in der Tat relativ schnell. Also so ein großes Projekt hätte ich gedacht"}, {"id": 162, "start": 1576.64, "end": 1589.36, "text": "dauert länger. Windows 7 Keys, aber ich habe auch kein Windows 7 Key. Ja, das ist tatsächlich"}, {"id": 163, "start": 1589.36, "end": 1593.0, "text": "relativ schnell. Wir können es mal vergleichen. Wir vergleichen das jetzt mal mit Ryder unter"}, {"id": 164, "start": 1593.0, "end": 1604.72, "text": "Linux. Passt mal auf, wir machen das gleiche Repo jetzt unter Linux in Ryder auf. Oh nee,"}, {"id": 165, "start": 1604.72, "end": 1611.96, "text": "schon wieder. Was war denn das noch mal das Problem, das hatten wir doch schon mal. Man"}, {"id": 166, "start": 1611.96, "end": 1636.56, "text": "musste Log-Files entfernen oder? Man musste Log-Files irgendwie entfernen. Wie ging das"}, {"id": 167, "start": 1636.56, "end": 1642.36, "text": "eigentlich? Ich habe keine Ahnung, wie das ging. Vor allem warum dreht dieser Kack-Bug"}, {"id": 168, "start": 1642.36, "end": 1650.16, "text": "immer noch auf? Was muss ich denn da jetzt entfernen, dass das tut? Den LCK-Ordner, wo"}, {"id": 169, "start": 1650.16, "end": 1655.88, "text": "ist denn hier ein LCK-Ordner, sehe ich nicht. Da hinten? Wie geht's der Katz, der geht's"}, {"id": 170, "start": 1655.88, "end": 1666.04, "text": "gut. Seht ihr mal einen LCK-Ordner? Ach der da! Tatsächlich. Das ist echt ein Kack-Bug,"}, {"id": 171, "start": 1666.04, "end": 1672.36, "text": "dass manchmal die VMs da nicht zugreifbar sind oder zu Friesen. Pass auf, jetzt geht's."}, {"id": 172, "start": 1672.36, "end": 1679.72, "text": "Bam! Oh, Peter Agile ist noch auf, den brauchen wir jetzt. Der ist ganz essenziell jetzt."}, {"id": 173, "start": 1679.72, "end": 1691.64, "text": "Der muss uns nämlich zeigen, wie es geht. Ne, falsches. Falsches Emote. Also, GitHub,"}, {"id": 174, "start": 1691.64, "end": 1702.0, "text": "ShareX. Dann klonen wir das Ganze mal. Das probieren wir jetzt mal mit Rider aus. Und"}, {"id": 175, "start": 1702.0, "end": 1705.96, "text": "mal gucken, wie da der Unterschied ist. Also die VMs sind ungefähr gleich ausgestattet."}, {"id": 176, "start": 1705.96, "end": 1712.16, "text": "Die Windows-VM hat, kann man sich das nicht anzeigen lassen, auch toll. Also die VM hier"}, {"id": 177, "start": 1712.16, "end": 1723.64, "text": "hat 4 CPU-Kerne, 16G RAM und das Windows hat glaube ich auch 4 CPU-Kerne und, hallo? Was?"}, {"id": 178, "start": 1723.64, "end": 1742.6, "text": "Please. Ach Moment, ist ja klar. Ich hab's ja da noch auf, Lul. Äh, Zack, Moment. Äh,"}, {"id": 179, "start": 1742.6, "end": 1746.8, "text": "Moment. Das, das jetzt, jetzt hab ich's, ich glaub jetzt hab ich's, jetzt hab ich's verwirrt."}, {"id": 180, "start": 1746.8, "end": 1756.72, "text": "Oh. Oh, okay, ich glaub jetzt hab ich's verwirrt. Also, Settings und das hat auch, das hat 8G,"}, {"id": 181, "start": 1756.72, "end": 1764.8, "text": "aber der RAM wird nicht das Limitierende sein. Ganz im Ernst. Okay, vergleichen wir mal die"}, {"id": 182, "start": 1764.8, "end": 1774.08, "text": "Geschwindigkeit. Also, das da, clone. Kann man das, kann das Rider übrigens auch, New"}, {"id": 183, "start": 1774.08, "end": 1783.6, "text": "Ocean, dass man das direkt da drin klont? Open. Äh, wahrscheinlich, ich glaub ich hab"}, {"id": 184, "start": 1783.6, "end": 1789.52, "text": "das Shit, das Shit-Plugin ausgemacht. Kann man da jetzt einfach sowas? Geht das? Nee,"}, {"id": 185, "start": 1789.52, "end": 1798.4, "text": "oder? Wenn das geht, würd ich mich echt wundern. Nee. Aber ist ja kein Problem, ich mein wir"}, {"id": 186, "start": 1798.4, "end": 1806.84, "text": "sind ja ohne Nutz, wir haben ja einfach, wir haben ja Shit, Shit-Command-Line. So, das"}, {"id": 187, "start": 1806.84, "end": 1809.32, "text": "ist ja auch nicht das, was wir testen wollen, wir wollen testen, wie schnell es sich öffnen"}, {"id": 188, "start": 1809.32, "end": 1822.44, "text": "lässt. Also, Open, Repos, dann haben wir hier irgendwie ShareX-Solution. So, mal gucken,"}, {"id": 189, "start": 1822.44, "end": 1833.64, "text": "wie schnell das jetzt geht. Also, Open und Trust. Ja, das ist schon eine ganze Ecke langsamer."}, {"id": 190, "start": 1833.64, "end": 1844.8, "text": "Read me? What the f- Ein bisschen langsamer, aber es ist jetzt nicht so, als hätt ich damit"}, {"id": 191, "start": 1844.8, "end": 1854.48, "text": "ein großartiges Problem, ehrlich gesagt. Geht auch, geht auch. Also, ich kann mit beidem"}, {"id": 192, "start": 1854.48, "end": 1864.36, "text": "leben, ja. Übrigens, warum das so broken ist, ist weil es ein.NET Framework Projekt"}, {"id": 193, "start": 1864.36, "end": 1869.68, "text": "ist. Okay, ich kann mit beidem leben, ist in Ordnung. Es ist aber wahrscheinlich deutlich"}, {"id": 194, "start": 1869.68, "end": 1873.28, "text": "schneller als Visual Studio 2000. Können wir auch nochmal vergleichen? Ich hab's doch"}, {"id": 195, "start": 1873.28, "end": 1883.04, "text": "hier, ich hab's doch hier drauf. Da muss ich das bloß hier mal klonen mit. Probieren wir"}, {"id": 196, "start": 1883.04, "end": 1890.76, "text": "das hier auch nochmal aus. So, jetzt haben wir es wirklich überall, haben wir hier gelandet."}, {"id": 197, "start": 1890.76, "end": 1905.24, "text": "Jetzt haben wir wirklich das überall ausprobiert. Jetzt kommt Visual Studio 2019, aber das ist"}, {"id": 198, "start": 1905.24, "end": 1909.72, "text": "das ganz aktuelle Visual Studio 2019, was ich installiert hab. Ich hab das erst vor"}, {"id": 199, "start": 1909.72, "end": 1915.8, "text": "drei Tagen oder so updated. Also, jetzt haben wir hier Share. Okay, mal gucken, wie schnell"}, {"id": 200, "start": 1915.8, "end": 1932.56, "text": "es jetzt damit aufgeht. Ja, okay, das ist schon, das ist, das ist, das ist ne ganze Ecke"}, {"id": 201, "start": 1932.56, "end": 1946.08, "text": "langsamer. Wobei. Naja, okay, soll ich mal ehrlich sein, Leute, ich merke keinen Unterschied."}, {"id": 202, "start": 1946.08, "end": 1960.0, "text": "What the fuck, warum singen da jetzt Leute? Also, ich benutze für, für.NET, mittlerweile"}, {"id": 203, "start": 1960.0, "end": 1967.96, "text": "bin ich nur noch unter Linux und Rider unterwegs. Seit den letzten paar Jahren. Das funktioniert"}, {"id": 204, "start": 1967.96, "end": 1976.4, "text": "echt gut. So, also, jetzt bin ich echt überfragt. Ich finde, das öffnet sich überall gleich"}, {"id": 205, "start": 1976.4, "end": 1986.32, "text": "schnell, auch wenn es jetzt deutlich schneller sein soll. Eventuell. Ich kann das jetzt echt,"}, {"id": 206, "start": 1986.32, "end": 2002.04, "text": "also. Okay, es ist vielleicht minimal schneller im neuen. Aber ganz im Ernst so. Also, nee,"}, {"id": 207, "start": 2002.04, "end": 2011.2, "text": "also großen Unterschied macht es echt nicht. Ist dort nicht universell einsetzbar,.NET"}, {"id": 208, "start": 2011.2, "end": 2019.28, "text": "10 Stunden. Wie Musik? Ja, Moment, das ist nur das, das ist nur das, das einschalten"}, {"id": 209, "start": 2019.28, "end": 2026.4, "text": "Musik. Na, das ist ein bisschen zu heftig. Jetzt kommt wieder der eine Kerl im Chat,"}, {"id": 210, "start": 2026.4, "end": 2037.4, "text": "der sagt Bei diesem Song haben sich meine Eltern kennengelernt. Nee, das hören wir"}, {"id": 211, "start": 2037.4, "end": 2052.24, "text": "nicht. 10 Stunden. Nee, das halte ich nicht aus. 10 Stunden. Das ist Mario Galaxy. So,"}, {"id": 212, "start": 2052.24, "end": 2056.76, "text": "also weiter im Text von der wahnsinnigen, vom wahnsinnigen Geschwindigkeitsboost habe"}, {"id": 213, "start": 2056.76, "end": 2065.8, "text": "ich jetzt noch nichts gemerkt. Alles klar. So, was gibt es denn sonst noch Neues? Lohnt"}, {"id": 214, "start": 2065.8, "end": 2070.96, "text": "der Lizenzpreis für Rider anstatt die Free Variante? Ob sich der Lizenzpreis lohnt oder"}, {"id": 215, "start": 2070.96, "end": 2074.76, "text": "nicht, stellt sich gar nicht. Wenn du es unter Linux ordentlich.NET programmieren"}, {"id": 216, "start": 2074.76, "end": 2080.8, "text": "willst, musst du dir Rider holen, weil Visual Studio Code suckt für.NET, finde ich jetzt."}, {"id": 217, "start": 2080.8, "end": 2088.88, "text": "Ist nicht schön. Ich meine, wenn du Rider nicht kaufen willst, gibt es auch die Möglichkeit,"}, {"id": 218, "start": 2088.88, "end": 2102.44, "text": "du verwendest die Trial, aber die Trial ist offiziell ja nur 30 Tage. Offiziell. Ich"}, {"id": 219, "start": 2102.44, "end": 2112.2, "text": "meine, wenn du ein bisschen rumsuchst, findest du ja vielleicht Möglichkeiten. Diese Trial,"}, {"id": 220, "start": 2112.2, "end": 2127.84, "text": "ne? Aber natürlich kaufen wir immer offizielle Lizenzen. Alle 30 Tage eine neue VM. Na gut,"}, {"id": 221, "start": 2127.84, "end": 2134.2, "text": "das ist die Noob Variante. Okay, also was ist denn jetzt sonst noch Neues? Zeig mal"}, {"id": 222, "start": 2134.2, "end": 2146.64, "text": "her. Ja, also was ist sonst noch neu? Okay, es ist viel schneller beim Öffnen. Was zum"}, {"id": 223, "start": 2146.64, "end": 2154.04, "text": "Teufel öffnen die da? Moment, sind das Sekunden? Ja, das sind Sekunden. Aber so ein großer"}, {"id": 224, "start": 2154.04, "end": 2160.04, "text": "Unterschied war das jetzt bei mir nicht. Ach, Moment, Moment, Moment. Open, der Typ öffnet"}, {"id": 225, "start": 2160.04, "end": 2167.76, "text": "1600 Projekte. Okay, das habe ich nicht ausprobiert, aber was zum Teufel ist das dann für ne Solution"}, {"id": 226, "start": 2167.76, "end": 2180.2, "text": "mit 1600 Projekten drin? Was haben die denn da? Ist das der Windows 11 oder wie? Also"}, {"id": 227, "start": 2180.2, "end": 2187.84, "text": "1600 Projekte, da kann ich wirklich ne Runde weird champen zu. Visual Studio Code kann"}, {"id": 228, "start": 2187.84, "end": 2194.68, "text": "das nicht sein. Das ist JavaScript. Okay, die haben das genommen einfach, dass man sieht,"}, {"id": 229, "start": 2194.68, "end": 2198.24, "text": "dass es schneller ist, nicht, dass es wirklich irgendwie merklich, merklich schneller ist."}, {"id": 230, "start": 2198.24, "end": 2202.72, "text": "Die haben irgendwas gebraucht, wo man es wirklich sieht. Und wenn du so riesige Projekte brauchst,"}, {"id": 231, "start": 2202.72, "end": 2217.4, "text": "dann ist es nice to have, aber jetzt nichts umwerfend Neues. Visual Studio Code ist TypeScript,"}, {"id": 232, "start": 2217.4, "end": 2236.08, "text": "das macht überhaupt keinen Unterschied. Ja. Okay, weiter. Ich habe das Gefühl, das sind"}, {"id": 233, "start": 2236.08, "end": 2248.56, "text": "8 Minuten Video und die zeigen überhaupt nichts. Ah, jetzt kommt die neue Code Completion,"}, {"id": 234, "start": 2248.56, "end": 2254.36, "text": "okay. Hat er nur einen guten Green Screen oder sieht das echt bei dem hinter dem so"}, {"id": 235, "start": 2254.36, "end": 2264.0, "text": "aus? Weil das sieht aus, als sitzt er in seiner Garage gerade. Aber der Green Screen ist erstaunlich,"}, {"id": 236, "start": 2264.0, "end": 2281.52, "text": "erstaunlich, erstaunlich gut, wenn es ein Green Screen ist. Das erinnert mich an Fischshell."}, {"id": 237, "start": 2281.52, "end": 2290.92, "text": "Whole Line Completion. Okay, das probieren wir gleich mal aus. Aber ob Visual Studio"}, {"id": 238, "start": 2290.92, "end": 2295.4, "text": "wirklich weiß, wie ich weiter programmieren will, ich bin da immer noch skeptisch drauf."}, {"id": 239, "start": 2295.4, "end": 2317.8, "text": "Die benutzen alle Dark Mode, aber für die Präsentation immer Light Mode. Das ist cool,"}, {"id": 240, "start": 2317.8, "end": 2347.68, "text": "ich habe aber meine Zweifel, dass das sinnvolle Completions sind. Ich kann das nicht, aber"}, {"id": 241, "start": 2347.68, "end": 2353.84, "text": "ich hätte die Idee für so einen Hacker Science Fiction Thriller gerade. Der sagt ja, die"}, {"id": 242, "start": 2353.84, "end": 2359.24, "text": "AI ist quasi über alle.NET Projekte in GitHub drüber gegangen, um es jetzt mal ein bisschen"}, {"id": 243, "start": 2359.24, "end": 2366.52, "text": "zu umschreiben und hat gelernt, wie so einen ASP.NET Controller auszusehen hat. Überlegt"}, {"id": 244, "start": 2366.52, "end": 2373.32, "text": "euch mal, man könnte eine richtig geile Story draus basteln. Die AI hat gelernt, wie so"}, {"id": 245, "start": 2373.32, "end": 2381.44, "text": "ein Controller aussehen muss und die AI schlägt jetzt, was war das für ein Sound? Und die"}, {"id": 246, "start": 2381.44, "end": 2385.6, "text": "AI schlägt jetzt Sachen vor, allerdings die Sachen, die sie gelernt hat, ist eine Insecurity,"}, {"id": 247, "start": 2385.6, "end": 2392.96, "text": "ist irgendein Bug drinne. Und du hast auf einen Schlag, hast du 100.000 Software Projekte,"}, {"id": 248, "start": 2392.96, "end": 2402.6, "text": "die angreifbar sind über das Gleiche, weil die AI das Falsche vorschlägt. Und die Leute"}, {"id": 249, "start": 2402.6, "end": 2408.08, "text": "copypasten ja nur noch, kann ja keiner mehr ordentlich programmieren. Dann hast du Probleme."}, {"id": 250, "start": 2408.08, "end": 2415.4, "text": "Very impressive stuff. Very impressive. Ich finde das immer geil, wenn die sich recht"}, {"id": 251, "start": 2415.4, "end": 2422.16, "text": "geben an diesen Präsentationen. Very impressive stuff. Yes, yes, very impressive, huge impressive"}, {"id": 252, "start": 2422.16, "end": 2431.96, "text": "stuff. Jetzt fehlt bloß noch, dass er sagt, it's like magic oder sowas. Sag nicht magic."}, {"id": 253, "start": 2431.96, "end": 2437.48, "text": "Cool and can save me a lot of time. Also a little scary. So and it looks like magic when it's"}, {"id": 254, "start": 2437.48, "end": 2450.44, "text": "happening in real life. Manche Sachen sind einfach total obvious, dass die kommen müssen."}, {"id": 255, "start": 2450.44, "end": 2455.24, "text": "So just to know that there's all this AI and training going on behind the scenes is really"}, {"id": 256, "start": 2455.24, "end": 2462.6, "text": "cool. I mean, it really looks like magic. Okay, es kann sein, dass sie das vorher schon"}, {"id": 257, "start": 2462.6, "end": 2468.48, "text": "gesagt haben und ich deswegen gedacht habe, das kommt jetzt. So is there anything else"}, {"id": 258, "start": 2468.48, "end": 2472.74, "text": "that that developers should know about and why they should immediately hit download when"}, {"id": 259, "start": 2472.74, "end": 2478.52, "text": "preview one does get released? Yeah, let's just jump straight into the next demo here."}, {"id": 260, "start": 2478.52, "end": 2483.76, "text": "It's about a simple test project that I have where das habe ich gelesen, das habe ich gelesen,"}, {"id": 261, "start": 2483.76, "end": 2488.88, "text": "da bin ich mal gespannt, ob man das ausprobieren kann. Man kann jetzt angeblich, wenn man Tests"}, {"id": 262, "start": 2488.88, "end": 2496.28, "text": "hat und die irgendwie in irgendeiner Art und Weise markiert sind, mit wo man die ausführen"}, {"id": 263, "start": 2496.28, "end": 2499.88, "text": "will, kann man jetzt wohl in Visual Studio Code sagen, dass man die in Docker laufen"}, {"id": 264, "start": 2499.88, "end": 2504.68, "text": "lassen will unter Linux testen und sowas. Muss ich gleich mal gucken, also wie auch immer"}, {"id": 265, "start": 2504.68, "end": 2512.44, "text": "das funktioniert. Das habe ich gelesen, das finde ich ist eine coole Idee. War ganz davon"}, {"id": 266, "start": 2512.44, "end": 2516.28, "text": "abgesehen. Man muss aber mal ehrlich sagen, es ist ziemlich Nische, dass man das braucht,"}, {"id": 267, "start": 2516.28, "end": 2523.0, "text": "weil die meiste Software, die wird ja nicht mal unter Windows, mal unter Linux, mal unter"}, {"id": 268, "start": 2523.0, "end": 2527.8, "text": "Mac laufen gelassen. Wenn es eine ASP.NET Web Anwendung ist, da läuft die unter Linux,"}, {"id": 269, "start": 2527.8, "end": 2531.68, "text": "da wird die unter Linux getestet und gut ist und am besten auch unter Linux entwickelt."}, {"id": 270, "start": 2531.68, "end": 2539.04, "text": "In der Regel kann man eigentlich echt sagen, also ich rede jetzt nicht von so exotischen"}, {"id": 271, "start": 2539.04, "end": 2545.4, "text": "Sachen wie IBM Hosts, aber in der Regel kann man sagen, es ist am besten, wenn man die"}, {"id": 272, "start": 2545.4, "end": 2550.24, "text": "Software unter der Plattform entwickelt, wo sie dann am Ende auch läuft, wenn es geht."}, {"id": 273, "start": 2550.24, "end": 2555.32, "text": "Ich meine, dass es für Mobile Apps nicht geht, ist logisch und dass das, zumindest"}, {"id": 274, "start": 2555.32, "end": 2560.72, "text": "nicht so direkt, und dass das für Host-Anwendungen und sowas, Mainframe auch nicht geht, ist"}, {"id": 275, "start": 2560.72, "end": 2564.12, "text": "klar. Aber wenn man über normale Linux oder Windows Software redet, ist eigentlich am"}, {"id": 276, "start": 2564.12, "end": 2566.44, "text": "besten, man entwickelt die dort, wo sie auch am Ende läuft."}, {"id": 277, "start": 2566.44, "end": 2571.2, "text": "Ja, na gut, Browser ist ja wieder was anderes."}, {"id": 278, "start": 2571.2, "end": 2585.2, "text": "Das probieren wir gleich mal aus. Ich habe übrigens keine Ahnung von Tests in Visual"}, {"id": 279, "start": 2585.2, "end": 2587.36, "text": "Studio, weil ich brauche nie Tests."}, {"id": 280, "start": 2587.36, "end": 2603.36, "text": "Okay, das ist wirklich cool. Das ist genau, das ist das, was ich gelesen habe. Das macht"}, {"id": 281, "start": 2603.36, "end": 2607.0, "text": "dann, startet dann irgendwie einen Docker und lässt da Linux.NET Core 3.1 laufen."}, {"id": 282, "start": 2607.0, "end": 2613.92, "text": "Tests ist nur für Leute, die damit rechnen, dass ihre Software kaputt geht. Das ist genauso"}, {"id": 283, "start": 2613.92, "end": 2618.4, "text": "wie Dokumentation, auch nur für Leute ist, die nicht aussahekräftig programmieren können."}, {"id": 284, "start": 2618.4, "end": 2625.12, "text": "Und das Problem haben wir natürlich nicht, deswegen brauchen wir beides nicht."}, {"id": 285, "start": 2625.12, "end": 2646.52, "text": "Und wenn man sich unsicher ist, dann macht man sich einfach ein Strukturprogramm vorher."}, {"id": 286, "start": 2646.52, "end": 2654.44, "text": "Okay, ja, genau hier, es geht über irgendwelche Docker-Images. Sag mal, das macht mich voll"}, {"id": 287, "start": 2654.44, "end": 2661.4, "text": "fertig, dass Windows im Hintergrund, die Windows 11, dass die laufen irgendwas auf Sound ploppt."}, {"id": 288, "start": 2661.4, "end": 2668.68, "text": "Ich muss mal kurz stummschalten. Besser als wenn es die ganze Zeit macht."}, {"id": 289, "start": 2668.68, "end": 2684.12, "text": "Ich frag mich immer noch, was die Amis geritten hat, ihr W W auszusprechen. Und dann, und"}, {"id": 290, "start": 2684.12, "end": 2688.4, "text": "jetzt kommt ja noch der Hit, und dann die Standard-Abkürzung für Webseiten die ganze"}, {"id": 291, "start": 2688.4, "end": 2693.72, "text": "Zeit W W W zu nehmen. Ich mein, W W W geht ja auf Deutsch noch, aber die Amis müssten"}, {"id": 292, "start": 2693.72, "end": 2705.48, "text": "dann wirklich W W W sagen. Das sind sechs Silben versus drei. Ja, stimmt, das waren"}, {"id": 293, "start": 2705.48, "end": 2708.68, "text": "die Engländer, das waren ja gar nicht die Amis. Die Amis haben es geklaut."}, {"id": 294, "start": 2708.68, "end": 2724.96, "text": "Sechs W, ja, das fände ich gut. Kommt da noch was?"}, {"id": 295, "start": 2724.96, "end": 2742.48, "text": "Da guck ich jetzt mal rein. WS2022-Wishen. Okay."}, {"id": 296, "start": 1747.9, "end": 2778.24, "text": "habe ich irgendwas falsch gemacht? Habe ich doch gemacht. MSVS, das ist doch"}, {"id": 297, "start": 2778.24, "end": 2790.48, "text": "richtig. Ach, ich hab 2020, lull. Ah, ja, das ergibt das auch. Jetzt ergibt es auch"}, {"id": 298, "start": 2790.48, "end": 2800.4, "text": "Sinn, wenn das nicht funktioniert. Ich brauche eine Runde Musik. So, also das ist das Visual"}, {"id": 299, "start": 2800.4, "end": 2804.4, "text": "Studio Blog, das haben wir schon. Visual Studio ist viel zu spät, ja, das haben wir"}, {"id": 300, "start": 2804.4, "end": 2810.32, "text": "schon gelernt. Designing for everyone. Ausgibt neue Icons, Leute. Die wichtigste Änderung"}, {"id": 301, "start": 2810.32, "end": 2815.76, "text": "in jedem Microsoft Programm. Neues Design, neue Icons. Pascal, die Account ist jetzt"}, {"id": 302, "start": 2815.76, "end": 2824.32, "text": "die Fault. Dark Mode Icons. Die sind doch noch genauso wie vorher. Nee, die sind in der"}, {"id": 303, "start": 2824.32, "end": 2834.96, "text": "Farbe tatsächlich ein bisschen angepasst. Also man kann irgendwas personalisieren, aber"}, {"id": 304, "start": 2834.96, "end": 2842.04, "text": "sie sagen nicht was. Dann machen wir doch jetzt mal ein.NET 6 Projekt und gucken, ob"}, {"id": 305, "start": 2842.04, "end": 2854.36, "text": "das funktioniert. Muss das sein? Können die nicht C++ einfach rausschmeißen? Wer schlägt"}, {"id": 306, "start": 2854.36, "end": 2864.68, "text": "sich denn freiwillig mit so einem Müll rum? Innovation at your fingertips. Real-time collaboration,"}, {"id": 307, "start": 2864.68, "end": 2875.24, "text": "website and productivity. Ach, das ist diese neue AI-Geschichte. Guck mal, ein GIF. Set"}, {"id": 308, "start": 2875.24, "end": 2888.4, "text": "as desktop background. Moment. Funktioniert das wirklich? Moment. Oh, ist das schlecht."}, {"id": 309, "start": 2888.4, "end": 2892.32, "text": "Das ist so schlecht wieder. Du wählst ein GIF aus und das GIF ist nicht mal animiert"}, {"id": 310, "start": 2892.32, "end": 2902.76, "text": "im Hintergrund. Vom Ansatz her cool. Ausführung mangelhaft wieder. Einfach schlecht. Einfach"}, {"id": 311, "start": 2902.76, "end": 2910.72, "text": "schlecht wieder. Wie kriege ich denn das jetzt wieder rückgängig gemacht? Ich habe leider"}, {"id": 312, "start": 2910.72, "end": 2939.08, "text": "keine personalized-Dinger mehr. Windows XP Hill. Ok, perfekt. Set as background. Hallo?"}, {"id": 313, "start": 2939.08, "end": 2958.08, "text": "Background. Oh, da stimmt aber irgendetwas net. Ich habe den ORSKY ausgetrickst. Leute,"}, {"id": 314, "start": 2958.08, "end": 2974.44, "text": "ist das hier ein Firefox-Dialog oder ist das ein Windows-Dialog? Wo kann man Windows 11"}, {"id": 315, "start": 2974.44, "end": 2988.64, "text": "runterladen? Kann ich nicht sagen. Ok, so kann man das jetzt ja ertragen. Da ist der falsche"}, {"id": 316, "start": 2988.64, "end": 3000.64, "text": "Berg. Ne. So, weiter im Text. Ich hasse dieses Gruppierte. Dieses Gruppierte vor den Fenstern,"}, {"id": 317, "start": 3000.64, "end": 3004.64, "text": "das ist so schlimm. Das müssen die ausschaltbar machen. Sonst gibt es wieder irgendwelche"}, {"id": 318, "start": 3004.64, "end": 3011.96, "text": "Registry-Hacks oder so. Das halte ich nicht aus. Ok, neue. Was haben wir hier? Assynchrone"}, {"id": 319, "start": 3011.96, "end": 3032.48, "text": "Collabora. Ok, blablabla. Improved Code Search. Visual Studio for Mac. Ja, da frage ich mich"}, {"id": 320, "start": 3032.48, "end": 3047.88, "text": "mal. Azure DevOps sagt auch, ich bin GitHub viel nicer. Ok, wunderbar. Die wollen das"}, {"id": 321, "start": 3047.88, "end": 3051.6, "text": "garantiert nicht auf Linux rauspulgen. Ne, ne, ne. Aber ganz davon abgesehen, Rider ist"}, {"id": 322, "start": 3051.6, "end": 3057.28, "text": "eh die beste Cross-Plattform-Lösung. Zeig mal bitte kurz Paint und den Colour Pick-Dialog."}, {"id": 323, "start": 3057.28, "end": 3065.56, "text": "Was? Paint? Paint sieht aus wie sonst. Paint sieht aus wie immer. Was für ein Colour Pick-Dialog?"}, {"id": 324, "start": 3065.56, "end": 3085.48, "text": "Wie startet man Windows Colour Pick-Dialog? Edit Colours? Ok, Paint. Paint Champ. Und"}, {"id": 325, "start": 3085.48, "end": 3093.48, "text": "jetzt? Und jetzt? Ich habe, ah hier, Edit Colours. Ok, sieht aus wie Windows XP immer"}, {"id": 326, "start": 3093.48, "end": 3097.88, "text": "noch. Oder eher Windows 98 würde ich sagen. Hör mal, ich mach mal Windows XP eher Windows"}, {"id": 327, "start": 3097.88, "end": 3105.52, "text": "98. Immer noch der gleiche Shit. Übrigens, wer denkt, dass der Kram besser wird, den"}, {"id": 328, "start": 3105.52, "end": 3110.6, "text": "kann ich jetzt auch noch gleich mal schocken. Control Panel und Netzwerk-Settings sind immer"}, {"id": 329, "start": 3110.6, "end": 3119.56, "text": "noch da. Da wird sich wahrscheinlich nichts ändern dran. Aber Hauptsache gerundete Ecken,"}, {"id": 330, "start": 3119.56, "end": 3126.52, "text": "ja. Und ich hab Dark Theme und Paint und Paint und das checkt nicht, dass ich Dark Theme hab."}, {"id": 331, "start": 3126.52, "end": 3139.08, "text": "Das ist halt Fail, ne. Das ist kein neuer Skin, das ist die Windows 11 Preview. So, also,"}, {"id": 332, "start": 3139.08, "end": 3147.44, "text": "gucken wir mal weiter. Das heißt, als nächstes probieren wir jetzt mal diese tollen AI Code"}, {"id": 333, "start": 3147.44, "end": 3155.48, "text": "Completion aus, oder wie? Oder was? Ok, Create New Project. Paint ist wohl noch die Windows"}, {"id": 334, "start": 3155.48, "end": 3166.56, "text": "7 Version. Ja, die haben ja auch gesagt, sie machen nix, ne. Ok, wir machen eine Konsolenanwendung."}, {"id": 335, "start": 3166.56, "end": 3185.12, "text": "Da brauchen wir nicht viel. CAC, W, ne. 0W, Rater als CACW. Dotnet 6 Preview ist am Start,"}, {"id": 336, "start": 3185.12, "end": 3193.96, "text": "alles klar. Ja, dieses Bild hab ich noch auf, das haben wir uns heute Morgen hier angeguckt."}, {"id": 337, "start": 3193.96, "end": 3198.92, "text": "Das ist lustig, das ist ein schönes Bild. Hat jemand ein Bild von gemacht, wie viel Überreste"}, {"id": 338, "start": 3198.92, "end": 3206.24, "text": "in Windows 11 noch drin sind? Windows 95 Dialoge, Windows NT Dialoge, Windows XP Dialoge, erster"}, {"id": 339, "start": 3206.24, "end": 3211.88, "text": "Windows Store Version, Windows 8 Metro Geschiss, neuestes Fluent Design, davor die Windows 10"}, {"id": 340, "start": 3211.88, "end": 3220.2, "text": "Settings, Windows 11 Startmenü Ribbon in Aero. Das ist halt echt. Muss das sein, Microsoft,"}, {"id": 341, "start": 3220.2, "end": 3228.08, "text": "ne. Ok, gut. Also, eins muss man den ja mal lassen. Wir haben den neuen Font, den haben"}, {"id": 342, "start": 3228.08, "end": 3235.6, "text": "wir ausprobiert und... Select? Den haben wir ausprobiert unter Linux und mit dem Linux"}, {"id": 343, "start": 3235.6, "end": 3242.28, "text": "Font Rendering sah dieser Font kacke aus. Unter Windows sieht der Font wirklich nicht"}, {"id": 344, "start": 3242.28, "end": 3248.24, "text": "verkehrt aus. Muss man mal sagen, also wer auf bisschen fettere Fonts steht, der wird"}, {"id": 345, "start": 3248.24, "end": 3259.56, "text": "hier wahrscheinlich glücklich werden mit. Ich finde, der Font ist schick. So, mal starten."}, {"id": 346, "start": 3259.56, "end": 3266.36, "text": "Alles wie gehabt. Ich bin ja schon gar nicht mehr gewohnt unter Windows. Ich weiß schon"}, {"id": 347, "start": 3266.36, "end": 3270.24, "text": "gar nicht mehr, wie ich jetzt hier überhaupt... Unter Linux würde ich jetzt ein Terminal aufmachen"}, {"id": 348, "start": 3270.24, "end": 3273.52, "text": "und sagen.net run. Ich weiß gar nicht, wie ich das hier machen würde. Wie mach ich das"}, {"id": 349, "start": 3273.52, "end": 3278.52, "text": "hier unter Windows? Gibt es hier sowas wie Open Terminal? Ah, Open Terminal. Tatsächlich."}, {"id": 350, "start": 3278.52, "end": 3286.04, "text": "Ihh, das ist dieses fucking eingebaute, eklig Terminal in Visual Studio..net run. Ok, das"}, {"id": 351, "start": 3286.04, "end": 3290.28, "text": "funktioniert ja auch. Aber, jetzt mal, jetzt mal im Ernst. Also, wenn ihr die Auswahl"}, {"id": 352, "start": 3290.28, "end": 3303.68, "text": "hast zwischen diesem Terminal oder, Moment, oder einem ordentlichen Terminal hier, also"}, {"id": 353, "start": 3303.68, "end": 3307.52, "text": "dann ist ja wohl ganz klar. Und selbst das Rider Terminal ist besser, weil das Rider"}, {"id": 354, "start": 3307.52, "end": 3313.2, "text": "Terminal hat noch eine ganz normale Shell verwendet. Also wer sich, also jetzt mal ernsthaft,"}, {"id": 355, "start": 3313.2, "end": 3324.32, "text": "sich freiwillig diesen Crap da gibt, dem ist nicht mehr zu helfen. Kann man das auch Auto,"}, {"id": 356, "start": 3324.32, "end": 3334.0, "text": "Auto Height, jawoll. So, also was sind diese tollen neuen Completion Features? If, wo ist"}, {"id": 357, "start": 3334.0, "end": 3347.56, "text": "meine Full Line Completion? AXE. Ist das jetzt schon AI unterstützte Completion oder? Was"}, {"id": 358, "start": 3347.56, "end": 3356.16, "text": "ist das? Und woher weiß ich? Muss man das vielleicht erst aktivieren? Wo sind überhaupt"}, {"id": 359, "start": 3356.16, "end": 3380.8, "text": "die Settings? Tools, Options? Wie hieß das? Intelli-Code, ne? Intelli-Code. Ok, ich glaube,"}, {"id": 360, "start": 3380.8, "end": 3384.6, "text": "wir brauchen eine Web-Anwendung, weil die haben das Beispiel in der Web-Anwendung gezeigt"}, {"id": 361, "start": 3384.6, "end": 3390.52, "text": "und wahrscheinlich funktioniert das nur in der Web-Anwendung. Ok, Razor-Pages, gibt's"}, {"id": 362, "start": 3390.52, "end": 3397.48, "text": "da auch was an? Gibt's da auch Web-API? Web-API mit Controller? Ne. Ok. Ich, siehst du mal"}, {"id": 363, "start": 3397.48, "end": 3403.64, "text": "Leute, ich bin zu, ich bin sogar zu unfähig, in Whistle Studio mittlerweile eine Web-Anwendung"}, {"id": 364, "start": 3403.64, "end": 3413.16, "text": "zu erstellen. Web-API, warum hat er das eben nicht gefunden? Ok, ja, Web-Application 1,"}, {"id": 365, "start": 3413.16, "end": 3422.56, "text": "perfekt. Mach mal ne neue Klasse Person und füg ne String-Property Last Name hinzu. Abgesehen,"}, {"id": 366, "start": 3422.56, "end": 3426.76, "text": "dass der dann First Name als neue Property vorschlägt. Sehr gute Idee, Krasius, genau"}, {"id": 367, "start": 3426.76, "end": 3431.56, "text": "das machen wir jetzt. Das machen wir jetzt. Nein, halt keine HTTPS-Open-API-Support brauchen"}, {"id": 368, "start": 3431.56, "end": 3446.16, "text": "wir alles net. So, geh weg. Die Wettervorhersage, genau die Wettervorhersage brauchen wir jetzt"}, {"id": 369, "start": 3446.16, "end": 3452.52, "text": "und den Wettervorhersagen-Controller. So, und da krieg ich jetzt Dinger vorgeschlagen,"}, {"id": 370, "start": 3452.52, "end": 3474.08, "text": "wenn ich da jetzt reingehe. Ja. Ah, guck mal hier. Intelli-Code-Suggestion. Oh, Massive-if."}, {"id": 371, "start": 3474.08, "end": 3482.76, "text": "To accept. Ah ja. So Big Brain wirkt das jetzt noch nicht. Ok, wir machen mal was eigenes."}, {"id": 372, "start": 3482.76, "end": 3489.32, "text": "Also, Post. Wir tun mal so, als würden wir da Parameter übergeben. Public. Keine Ahnung,"}, {"id": 373, "start": 3489.32, "end": 3496.24, "text": "wie nennen wir das mal? Push. Fällt jetzt grad nix anderes ein. So, und das kriegt jetzt"}, {"id": 374, "start": 3496.24, "end": 3511.16, "text": "ein String-Cac-W. So, eh. Return null. Perfekt. So, und jetzt, wenn ich jetzt hier sage, if,"}, {"id": 375, "start": 3511.16, "end": 3521.8, "text": "guck mal hier, Massive, Massive, Big Brain, Big Brain. What is name of the font? This"}, {"id": 376, "start": 3521.8, "end": 3532.2, "text": "is the new default font from Microsoft. It's called, I think, Cascadia Mono. Font? Who"}, {"id": 377, "start": 3532.2, "end": 3547.8, "text": "is this then? Font? Yes, Cascadia Mono. But it only looks good on Windows. I tried it"}, {"id": 378, "start": 3547.8, "end": 3555.64, "text": "on Linux and with the Linux font renderer, it sucks. Ja, genau, das ist das hier. Das"}, {"id": 379, "start": 3555.64, "end": 3566.08, "text": "ist Cascadia Code GitHub. Ui. Genau. Ja, aber das ist doch schon mal cool, oder? Ich"}, {"id": 380, "start": 3566.08, "end": 3571.64, "text": "mein, diese ist wahrscheinlich die einzige Code Completion, die der kann, aber das ist"}, {"id": 381, "start": 3571.64, "end": 3579.24, "text": "doch schon mal ganz nett. Meinst du, dass sich die Vorschläge nach dem Namen der Variable"}, {"id": 382, "start": 3579.24, "end": 3587.08, "text": "auch ändern? Was meinste? Ach, guck mal hier. Return redirect action. Nee, das will ich"}, {"id": 383, "start": 3587.08, "end": 3594.24, "text": "eigentlich gesagt an der Stelle nicht. If? Was? True? What the? Okay, so ganz klappt"}, {"id": 384, "start": 3594.24, "end": 3604.32, "text": "das doch nicht. So ganz hat das nicht funktioniert. Okay, if. Nee, und jetzt hab ich's kaputt"}, {"id": 385, "start": 3604.32, "end": 3618.24, "text": "gemacht, Leute. Brocken. Ach, guck mal, jetzt kann man doch direkt ein... Okay, ich weiß"}, {"id": 386, "start": 3618.24, "end": 3622.6, "text": "nicht so genau, was das da macht, aber es ist nicht das, was ich haben will. Was ist"}, {"id": 387, "start": 3622.6, "end": 3627.36, "text": "denn, wenn ich hier sage... Okay, da schlägt ihr mir vor, standardmäßig Länge Trim Contains"}, {"id": 388, "start": 3627.36, "end": 3632.16, "text": "to lower start with. Das werden wahrscheinlich schlicht und ergreifend die meist benutzten"}, {"id": 389, "start": 3632.16, "end": 3636.68, "text": "Methoden von String sein, das haben die irgendwie gezählt. Ob das jetzt die massive Big Brain"}, {"id": 390, "start": 3636.68, "end": 3648.2, "text": "too smart AI, die man dafür braucht, ist... Na, na ja. Okay, Person soll dich ausprobieren,"}, {"id": 391, "start": 3648.2, "end": 3660.72, "text": "da hat er Grasius vorhin geschrieben. Also probieren wir das mal aus. Public... Oh. Das"}, {"id": 392, "start": 3660.72, "end": 3669.56, "text": "ist komplett useless, what the fuck, das braucht kein Mensch. Das braucht wirklich keiner."}, {"id": 393, "start": 3669.56, "end": 3680.92, "text": "Null. Das ist komplett bescheuert. Okay, Public Class... Was soll ich machen, Person? Und"}, {"id": 394, "start": 3680.92, "end": 3686.52, "text": "was meintest du, es gibt Last Name? Wenn ich was Last Name hinzufüge, dann sagt er, ich"}, {"id": 395, "start": 3686.52, "end": 3692.96, "text": "brauch noch First Name. Ja gut, wahrscheinlich, weil die... Tatsächlich. Okay, das ist cool,"}, {"id": 396, "start": 3692.96, "end": 3697.64, "text": "aber das geht auch nur, weil das ein Beispiel ist, was die für alles verwenden. Das hat"}, {"id": 397, "start": 3697.64, "end": 3703.04, "text": "ja mit Big Brain AI nix zu tun. Das klappt jetzt nur in diesem einen Fall, weil das das"}, {"id": 398, "start": 3703.04, "end": 3713.32, "text": "Beispiel ist, was die verwenden. Probieren wir das doch mal mit was anderem aus. Public"}, {"id": 399, "start": 3713.32, "end": 3728.28, "text": "Class, Car. Nee, Car, nicht Car, Car. So, Prop. Schlägt da jetzt irgendwas vor? Prop?"}, {"id": 400, "start": 3728.28, "end": 3739.92, "text": "String? Nee, Engine. Name. Na okay, gar nicht so schlecht. Description, okay. Image, okay."}, {"id": 401, "start": 3739.92, "end": 3754.52, "text": "Naja, ich weiß nicht, so wirklich wahnsinnig gut. ID wäre gut, ID wäre gut, ja. Wir gucken"}, {"id": 402, "start": 3754.52, "end": 3759.16, "text": "mal, ob der so schlau ist und das checkt. Wir gucken mal, warte mal, wir gucken mal,"}, {"id": 403, "start": 3759.16, "end": 3763.76, "text": "ob der so schlau ist und das checkt. Ob der ID vorschlägt, das probieren wir jetzt mal"}, {"id": 404, "start": 3763.76, "end": 3771.08, "text": "wirklich aus. Add Folder Models. In Models sind meistens Felder mit Datenbank ein Bezug."}, {"id": 405, "start": 3771.08, "end": 3780.52, "text": "Also Add Class, nennen wir jetzt mal was weiß ich, Kamera. So, meine Kamera braucht dann"}, {"id": 406, "start": 3780.52, "end": 3797.2, "text": "was? Name, okay. Ist jetzt schon mal broken. Okay. Int. Also, dass der nicht ID vorschlägt"}, {"id": 407, "start": 3797.2, "end": 3803.64, "text": "ist Fail. Warum schlägt der nicht ID vor? Es ist in einem Ordner Models und in Models"}, {"id": 408, "start": 3803.64, "end": 3809.72, "text": "ist alles drin, was ein ID Feld braucht. Das wird sicherlich besser, je größer die"}, {"id": 409, "start": 3809.72, "end": 3816.76, "text": "Codebase. Naja, angeblich haben die 1,5 Millionen Open Source Projekte analysiert. Da sollten"}, {"id": 410, "start": 3816.76, "end": 3822.46, "text": "eigentlich Klassen in Models so gut wie alle eine ID haben. Mach mal, Girl, was die Big"}, {"id": 411, "start": 3822.46, "end": 3828.2, "text": "Brain AI da vorschlägt. Du meinst Class, Girl? Oh, Monka Toss. Ich sehe mich schon"}, {"id": 412, "start": 3828.2, "end": 3840.72, "text": "im Monka Toss Land. Girl. Ach ja, jetzt wird ID vorgeschlagen. So, so. Und sonst nichts"}, {"id": 413, "start": 3840.72, "end": 3865.76, "text": "mehr. Mehr wird nicht vorgeschlagen, okay. Warum der jetzt noch mal ID vorschlägt, verstehe"}, {"id": 414, "start": 3865.76, "end": 3870.72, "text": "ich auch nicht so genau. Ich habe übrigens auch nicht gecheckt, wie ich das triggern"}, {"id": 415, "start": 3870.72, "end": 3877.4, "text": "kann. Tap to accept, okay. Aber in der nächsten Zeile kommt nichts mehr. Und wenn ich hier"}, {"id": 416, "start": 3877.4, "end": 3881.4, "text": "in die nächste Zeile gehe, schlägt er mir einfach Name vor. Vielleicht muss ich das"}, {"id": 417, "start": 3881.4, "end": 3895.72, "text": "mal löschen einfach. Ach, jetzt schlägt er mir auch wieder Name vor. Okay, Name ergibt"}, {"id": 418, "start": 3895.72, "end": 3911.88, "text": "noch Sinn, aber Name ist broken. Description. Okay, was ist die Ull von deinem Girl? Ah,"}, {"id": 419, "start": 3911.88, "end": 3926.56, "text": "Holy Fence, verstehe. Okay, was? Okay, okay, Moment, Moment. Holy Fence. Oh, IntelliCode"}, {"id": 420, "start": 3926.56, "end": 3952.8, "text": "hier. Hä? It's like magic. Holy Fence Account, ID. Jawoll. Name. Das ist E-Mail. Hoho. Phone."}, {"id": 421, "start": 3952.8, "end": 3961.04, "text": "Guckt euch mal an, Phone Number. E-Mail. Leute, wir sind in der Angelos Schleife. Es hört"}, {"id": 422, "start": 3961.04, "end": 3974.96, "text": "nicht mehr auf. Big Brain AI. E-Mail Number. Mal gucken, wie lagiert das jetzt noch. Phone."}, {"id": 423, "start": 3974.96, "end": 3987.76, "text": "Oh nee, ist vorbei. Nee, Phone Number. Okay, Big Brain AI ist vielleicht auch noch nicht"}, {"id": 424, "start": 3987.76, "end": 3998.76, "text": "so Big Brain. Du machst dir AI Angst, ich glaube auch. Funktioniert richtig gut, perfekt."}, {"id": 425, "start": 3998.76, "end": 4011.16, "text": "Also, wir haben gelernt, wir haben jetzt eine neue Super-Code-Completion-AI, die merkwürdige"}, {"id": 426, "start": 4011.16, "end": 4022.44, "text": "Sachen Code Completed. Hier, Code Completed, das nix. So, Summaries, also. Ach so, mein"}, {"id": 427, "start": 4022.44, "end": 4026.4, "text": "Spinnengall, ich erinnere. Also, was ich jetzt erwarten würde, wenn ich Summaries Punkt"}, {"id": 428, "start": 4026.4, "end": 4035.76, "text": "mache, das ist ein String-Array. Ganz ehrlich, ganz oben würde ich erwarten Length und ich"}, {"id": 429, "start": 4035.76, "end": 4040.12, "text": "würde auch vorschlagen, dass der mir String-Join anbietet, ehrlich gesagt. In irgendeiner Art"}, {"id": 430, "start": 4040.12, "end": 4050.28, "text": "und Weise. Da bin ich mal gespannt, wie schlau das Ding ist. Okay, Length, Copy 2. Was halt"}, {"id": 431, "start": 4050.28, "end": 4054.8, "text": "richtig cool wäre, wenn der jetzt hier vorschlagen würde, du möchtest wahrscheinlich auch sogar"}, {"id": 432, "start": 4054.8, "end": 4065.16, "text": "sowas hier haben. Was ist denn U? Ist es ein Leerzeichen? Domdoretto, danke schön für den"}, {"id": 433, "start": 4065.16, "end": 4084.92, "text": "Sub. Was ist U002? C, ist es Leerzeichen? Komma. Unicode, Komma. Okay, das ist gar nicht so schlecht,"}, {"id": 434, "start": 4084.92, "end": 4093.32, "text": "dieser Vorschlag. Der Vorschlag ist echt in Ordnung. Ich mein, man könnte auch ganz"}, {"id": 435, "start": 4093.32, "end": 4100.32, "text": "klassisch den da nehmen. Du kannst jetzt mit Emojis joinen. Okay, das muss ich ausprobieren."}, {"id": 436, "start": 4100.32, "end": 4116.36, "text": "Ich muss mal kurz Konsolenanwendung aufmachen, ob die jetzt Emoji-Support haben. Wie öffnet"}, {"id": 437, "start": 4116.36, "end": 4127.08, "text": "man an diese Startseite? Ah, hier, Recent Files haben wir da noch, Recent Solution. Kann"}, {"id": 438, "start": 4127.08, "end": 4139.64, "text": "ich, haben wir denn jetzt Emoji-Support? Das muss ich jetzt ausprobieren. Hallo? Man kann"}, {"id": 439, "start": 4139.64, "end": 4147.8, "text": "GIFs einfügen. Okay, das bringt, das bringt es ja richtig an der Stelle. Okay, wir haben"}, {"id": 440, "start": 4147.8, "end": 4152.88, "text": "schon mal kein GIF, wir haben schon mal kein Emoji-Support. Was ist das eigentlich für"}, {"id": 441, "start": 4152.88, "end": 4156.16, "text": "ein komisches Menü? Warum war das eben unten rechts? So, und wenn ich sie ausführe, haben"}, {"id": 442, "start": 4156.16, "end": 4159.88, "text": "wir immer, bestimmt immer noch kein Emoji-Support. Nein, natürlich nicht. Wo kämen wir denn"}, {"id": 443, "start": 4159.88, "end": 4164.04, "text": "auch hin, wenn neues Teusch bei Microsoft das irgendwie könnte? So, gucken wir mal,"}, {"id": 444, "start": 4164.04, "end": 4168.92, "text": "wie es im Terminal aussieht. Aber da, da weiß ich eigentlich, dass es unter PowerShell"}, {"id": 445, "start": 4168.92, "end": 4177.16, "text": "nicht funktioniert. Wo, wo legt denn das Ding überhaupt? Wo hat er denn das hingelegt?"}, {"id": 446, "start": 4177.16, "end": 4200.04, "text": "Ah ja, alles klar..net-run, nee. Warum nicht? Ah, weil ich mich verschrieben hab. Ah, das"}, {"id": 447, "start": 4200.04, "end": 4202.84, "text": "ist halt broken. Das ist halt broken. Keine Emojis. Das liegt aber an PowerShell und nicht"}, {"id": 448, "start": 4202.84, "end": 4207.96, "text": "an, also das Terminal kann prinzipiell Emojis, weil wenn ich, wenn ich WSL installiert hab,"}, {"id": 449, "start": 4207.96, "end": 4216.56, "text": "funktioniert alles. Nee, ich hab nicht studiert. Okay, das sackt. Also immer noch kein Emoji-Support"}, {"id": 450, "start": 4216.56, "end": 4222.08, "text": "enttäuscht mich. Aber es ist ja klar, Wishlist Studio selbst ist ja noch WPF und WPF kann"}, {"id": 451, "start": 4222.08, "end": 4227.96, "text": "ja keine Emojis. Wird ja ein weiterer Punkt dafür, dass die Microsoft UI-Technologien,"}, {"id": 452, "start": 4227.96, "end": 4233.76, "text": "die benutzbar sind unter Windows, sacken. Weil Microsoft verwenden ja selbst ihren Kram"}, {"id": 453, "start": 4233.76, "end": 4247.84, "text": "nicht. Gut, also das funktioniert schon mal nett. Mach mal wieder das andere auf. Du kannst"}, {"id": 454, "start": 4247.84, "end": 4252.84, "text": "WSL jetzt mit WSL installieren. Okay, das muss ich jetzt ausprobieren. Mach mal hier"}, {"id": 455, "start": 4252.84, "end": 4273.28, "text": "neu auf. Was kann ich machen? WSL minus minus install. Sudo. RunS. RunS, WSL. Gibt's da nicht"}, {"id": 456, "start": 4273.28, "end": 4284.36, "text": "irgendwas für? Gibt's da nicht irgendein Kommando-Zeilen-Ding für? Admin. Gibt das"}, {"id": 457, "start": 4284.36, "end": 4289.48, "text": "nicht irgendein Sudo-Äquivalent in PowerShell? Ich meine, ich kann, ich kann das starten"}, {"id": 458, "start": 4289.48, "end": 4297.92, "text": "als Admin. Wie starte ich überhaupt eine Admin-PowerShell hier drinnen? So, schon mal nicht. Terminal."}, {"id": 459, "start": 4297.92, "end": 4307.36, "text": "Okay, starten wir das ganze Terminal als Admin. Das funktioniert. WSL minus minus install."}, {"id": 460, "start": 4307.36, "end": 4312.24, "text": "Ist halt dumm, dass es nicht so eine Sudo-Variante standardmäßig gibt. Ich weiß, man kann sich"}, {"id": 461, "start": 4312.24, "end": 4318.56, "text": "was nachinstallieren. Okay, nice, Funst. Das ist schon mal schön. Das ist schon mal schön,"}, {"id": 462, "start": 4318.56, "end": 4323.56, "text": "dass es jetzt einfach geht und man nicht 3 Milliarden Dinger machen muss. Oh, habe ich"}, {"id": 463, "start": 4323.56, "end": 4328.04, "text": "Virtualisierungs-Support eingeschaltet? Kann sein, dass das jetzt gar nicht funktioniert."}, {"id": 464, "start": 4328.04, "end": 4338.88, "text": "Nein, Virtualisierungs-Support ist aus. Ich muss Windows neu starten, klein. GUI-App-Support"}, {"id": 465, "start": 4338.88, "end": 4349.44, "text": "ist am Starten. Der hat auch, der echt erstaunlicherweise ganz gut funktioniert. Wie findet ihr, Python"}, {"id": 466, "start": 4349.44, "end": 4356.4, "text": "so ist sehr gut zu gebrauchen? Bist du auf einer Suche nach einer Einsteiger-Programmiersprache"}, {"id": 467, "start": 4356.4, "end": 4367.92, "text": "oder warum fragst du? Was Einsteiger-Programmiersprachen angeht, da habe ich was. Okay, Power off."}, {"id": 468, "start": 4367.92, "end": 4389.28, "text": "Ach nee. Shutdown? Ah, now? Nee. Macht man das unter Windows? Was? Okay, Leute im Chat,"}, {"id": 469, "start": 4389.28, "end": 4399.16, "text": "S minus S minus P null. Aha, exquisite. Ich will übrigens gar nicht rebooten, ich will"}, {"id": 470, "start": 4399.16, "end": 4408.76, "text": "tatsächlich ausschalten. Schaltet das jetzt aus oder rebootet das? Updater und underway."}, {"id": 471, "start": 4408.76, "end": 4415.12, "text": "Also, wenn du auf der Suche nach Einsteiger-Programmiersprachen bist, dann geh mal zu mir auf YouTube. Da haben"}, {"id": 472, "start": 4415.12, "end": 4421.84, "text": "wir nämlich letztens ein Video gemacht zusammen. Nämlich das da. Einsteiger-Programmiersprachen."}, {"id": 473, "start": 4421.84, "end": 4427.68, "text": "Kannst du dir ja mal angucken. Ansonsten, die Kurzvariante für dich, was wir hier drinnen"}, {"id": 474, "start": 4427.68, "end": 4435.36, "text": "vorstellen ist Go, dann Python, dann JavaScript. Aus irgendwelchen Gründen möchte da Florian"}, {"id": 475, "start": 4435.36, "end": 4439.84, "text": "C und C++ vorstellen. Ich werde es bis heute nicht verstehen, aber es war sein Part. Und"}, {"id": 476, "start": 4439.84, "end": 4444.56, "text": "ich stelle C Sharp vor. Und meine persönliche Empfehlung, wenn du wirklich noch nichts kannst"}, {"id": 477, "start": 4444.56, "end": 4449.04, "text": "und noch nichts konkretes vorhast, fang mit JavaScript an. Du brauchst einfach nur einen"}, {"id": 478, "start": 4449.04, "end": 4453.84, "text": "Browser und kannst loslegen. Und du kannst so geile Panels wie SpaceX programmieren."}, {"id": 479, "start": 4453.84, "end": 4462.28, "text": "Wenn du Python bisschen kannst, spricht auch nichts dagegen, damit weiterzumachen. Das"}, {"id": 480, "start": 4462.28, "end": 4469.16, "text": "ist auch eine super Einsteiger-Programmiersprache. Ich glaube, das muss man anhaken dafür."}, {"id": 481, "start": 4469.16, "end": 4487.48, "text": "Max, wo hast du die Preview von Windows 11 her? Secret. Haben wir schon mal einen Go-Stream"}, {"id": 482, "start": 4487.48, "end": 4491.6, "text": "gemacht? Ne, wir haben noch keinen Go-Stream gemacht, weil ich bin nicht der Super-Go-Profi."}, {"id": 483, "start": 4491.6, "end": 4495.4, "text": "Ich meine, ich kriege da drin was programmiert, aber ich bin jetzt keiner, der euch sagen"}, {"id": 484, "start": 4495.4, "end": 4499.8, "text": "ja, so ist die beste, also ich kann euch in C Sharp zeigen, so ist die beste Art und Weise,"}, {"id": 485, "start": 4499.8, "end": 4503.32, "text": "was zu machen. Das kann ich in Go, ich kann in Go was machen, dass es funktioniert, aber"}, {"id": 486, "start": 4503.32, "end": 4512.4, "text": "ob es die beste Art und Weise ist, keine Ahnung. So, geht das jetzt? Warum startet sich immer"}, {"id": 487, "start": 4512.4, "end": 4523.4, "text": "diese Kacke? Xbox App. Was will die eigentlich von mir? Was verkaufen wahrscheinlich? Rust"}, {"id": 488, "start": 4523.4, "end": 4543.0, "text": "7, das können wir tatsächlich mal machen. Rust ist super, aber Rust ist wirklich nur"}, {"id": 489, "start": 4543.0, "end": 4551.28, "text": "für High IQ Leute. Also wenn ihr nicht mindestens, sagen wir mal 125 plus IQ habt, dann könnt"}, {"id": 490, "start": 4551.28, "end": 4564.64, "text": "ihr Rust vergessen. So, also Enter New Unix Name. 1, 2, 3, 4, 5, 6, 1, 2, 3, 4, 5, 6, jawoll."}, {"id": 491, "start": 4564.64, "end": 4568.72, "text": "So, und jetzt können wir PowerShell, jetzt können wir das Terminal starten und WSL aufmachen."}, {"id": 492, "start": 4568.72, "end": 4592.2, "text": "Terminal, M, JUBANTU und wenn ich jetzt nach, wo ist da Kram? Documents, Source, ne, Source,"}, {"id": 493, "start": 4592.2, "end": 4600.16, "text": "WPos. Ich hab mich übrigens auch verschrieben, sehe ich gerade. So, wenn ich da jetzt hingehe"}, {"id": 494, "start": 4600.16, "end": 4610.4, "text": "und sage.NET RUN, dann, ach fuck, das ist jetzt, da muss ich.NET EXE machen oder RUN?"}, {"id": 495, "start": 4610.4, "end": 4626.56, "text": "Jetzt richtige Ordner und jetzt haben wir Emojis. Auch nicht? Warum haben wir da keine"}, {"id": 496, "start": 4626.56, "end": 4634.56, "text": "Emojis jetzt? Muss ich vielleicht.NET unter Linux installieren, dass das funktioniert?"}, {"id": 497, "start": 4634.56, "end": 4650.32, "text": "Moment, ist das WSL 1 oder WSL 2? Das ist WSL 2, oder? Das Terminal, das kann Emojis,"}, {"id": 498, "start": 4650.32, "end": 4656.64, "text": "das kann Emojis, das Terminal unter Linux. Das geht. Wohingegen, ihr seht's, unter PowerShell"}, {"id": 499, "start": 4656.64, "end": 4662.28, "text": "funktioniert das nicht. Das ist wahrscheinlich einfach das Problem, dass das ein.NET, Windows"}, {"id": 500, "start": 4662.28, "end": 4670.0, "text": ".NET Anwendung ist, die jetzt rumbackt. Okay, UPD, INSTALL, haben die eigentlich.NET"}, {"id": 501, "start": 4670.0, "end": 4678.12, "text": "stundermäßig mehr drinnen? Ne, ne? Die wollen, dass ich einen Snap installiere wahrscheinlich."}, {"id": 502, "start": 4678.12, "end": 4687.44, "text": "Ne, ne, ich installiere keinen Snap. Du mein, das überhaupt nicht funktioniert damit. Ich"}, {"id": 503, "start": 4687.44, "end": 4691.08, "text": "hab eine Idee. Das ist ja Cross-Platform, ich weiß, was wir machen. Wir machen jetzt,"}, {"id": 504, "start": 4691.08, "end": 4696.04, "text": "wir machen jetzt richtig, richtige Big-Brain-Idee. Passt mal auf. Richtig, richtig. Jetzt kommt"}, {"id": 505, "start": 4696.04, "end": 4705.48, "text": "die ultimative Hacker-Man-Solution, was wir jetzt machen..NET, BUILD, minus, minus, nee,"}, {"id": 506, "start": 4705.48, "end": 4718.96, "text": "PUBLISH, PUBLISH, minus, minus, self-contained, self-contained, Linux 64, ich hab keine Ahnung,"}, {"id": 507, "start": 4718.96, "end": 4736.72, "text": "ob das die richtigen Kommandos sind, nein. Ne, X64, okay. Massive, Massive Hacker-Man-Solutions"}, {"id": 508, "start": 4736.72, "end": 4749.32, "text": "hier. Also, gehen wir dahin. Wo müssen wir hin? CD, bin, debug,.NET, Linux, ist Terminal"}, {"id": 509, "start": 4749.32, "end": 4768.84, "text": "ne, ist nicht, ist nicht gecrasht. Publish. So, und jetzt kann ich's ausführen. Damn,"}, {"id": 510, "start": 4768.84, "end": 4780.36, "text": "habt ihr's gesehen? Habt, habt ihr's gesehen? Zack, und da haben wir unsere Emojis. Richtig"}, {"id": 511, "start": 4780.36, "end": 4794.12, "text": "Six-Head, oder? Das ging aber nur, weil wir jetzt mit, okay, okay, das jetzt zu erklären"}, {"id": 512, "start": 4794.12, "end": 4804.24, "text": "ist echt kompliziert. Wir haben mit WSL das Windows.NET aufgerufen und dort mit dem Windows.NET"}, {"id": 513, "start": 4804.24, "end": 4811.72, "text": "cross-compiled ne native Linux-Anwendung, die wir dann ausführen unter WSL und dann"}, {"id": 514, "start": 4811.72, "end": 4823.4, "text": "funktioniert's mit den Emojis. Was, CH, CHP, 6500, was, was, was, was, Moment, warte, das"}, {"id": 515, "start": 4823.4, "end": 4831.2, "text": "geb ich nicht einfach so ein, ich weiß nicht, was es macht. Check mal mein Sample oben,"}, {"id": 516, "start": 4831.2, "end": 4846.76, "text": "was, was, was, was, Sample. Was, was, was macht CH, CHP? Jetzt sind wir wieder im Microsoft"}, {"id": 517, "start": 4846.76, "end": 4863.04, "text": "Weird Champland. Das ist nicht standardmäßig Unicode. Okay, jetzt sind wir echt im, im,"}, {"id": 518, "start": 4863.04, "end": 4868.92, "text": "im, im, Massive Microsoft Weird Champland. Also, das heißt, ich geh jetzt dahin, geb"}, {"id": 519, "start": 4868.92, "end": 4886.84, "text": "das ein, dann geh ich in, ja, dahin,.NET Run. Nö, funktioniert nicht. Funktioniert nicht."}, {"id": 520, "start": 4886.84, "end": 4898.36, "text": "Bam. Outdated, gebated, overrated. Funktioniert nicht. Kann man Change-Code-Page auch unter"}, {"id": 521, "start": 4898.36, "end": 4920.84, "text": "Linux machen? Nee. Deiner, hm? C-Pool. Komm. Also, deswegen muss ich nach wie vor sagen,"}, {"id": 522, "start": 4920.84, "end": 4924.8, "text": "einfach eine Linux-4M und gut ist, dann muss man sich mit dem ganzen Chat immer noch nicht"}, {"id": 523, "start": 4924.8, "end": 4938.12, "text": "rumschlagen. Nee, geht nicht. Tja, funktioniert nicht. Okay, Moment, Moment, was, was? Mach"}, {"id": 524, "start": 4938.12, "end": 4947.56, "text": "in deinem Sample mal Console-Writer noch Console-Output-Encoding. Oh, big brain time. Das machen wir jetzt,"}, {"id": 525, "start": 4947.56, "end": 4951.12, "text": "das machen wir jetzt. Da lernt, hier Leute, ich lerne noch was, ich, ich, ich lerne, wie"}, {"id": 526, "start": 4951.12, "end": 4958.08, "text": "man auf der Windows-Shell Emojis ausgeben kann. Heute, heute hab ich viel, viel wichtige Infos"}, {"id": 527, "start": 4958.08, "end": 4964.04, "text": "hier, viel wichtige Input gelernt. So, also was soll ich machen? Console, also vorher"}, {"id": 528, "start": 4964.04, "end": 4974.88, "text": "wahrscheinlich, ne? Console, Output, Output, Output-Encoding gleich. Ja, super, AI, schlag"}, {"id": 529, "start": 4974.88, "end": 4991.6, "text": "mir mal was vor. Output-Encoding. AI hat kein Bock. Encoding, okay. UTF-8. So, und das soll"}, {"id": 530, "start": 4991.6, "end": 5000.64, "text": "jetzt irgendwas bringen. Probieren wir das mal hier aus. Tatsächlich, das Funst. Moment,"}, {"id": 531, "start": 5000.64, "end": 5005.56, "text": "Moment. Geht, geht das auch im, im, im alten Kommando-Zeilen-Prompt? Nee, oder? Da geht"}, {"id": 532, "start": 5005.56, "end": 5011.76, "text": "das. Okay. Warum um alles in der Welt geht das? Kann mir das irgendjemand erklären? Warum,"}, {"id": 533, "start": 5011.76, "end": 5016.68, "text": "warum kann ich hier in dem Programm Emojis ausgeben, aber keine Emojis reincopypasten?"}, {"id": 534, "start": 5016.68, "end": 5022.8, "text": "Das ist, ey, Microsoft-Encoding-Land ist echt die absolute Hölle. Source?"}, {"id": 535, "start": 5022.8, "end": 5045.16, "text": "Was? CHCP65001? Okay, nee, da geht's glücklicherweise nicht."}, {"id": 536, "start": 5045.16, "end": 5061.96, "text": "Was? Also, Pock. Richtig, richtig, richtig, richtig Pock. So, aber wir waren ja eigentlich"}, {"id": 537, "start": 5061.96, "end": 5067.24, "text": "dabei, wir wollten uns Wishless Studio angucken und nicht irgendwelche Emoji-Ausgaben. Wo"}, {"id": 538, "start": 5067.24, "end": 5070.48, "text": "hatten wir denn jetzt den Blog-Post? Also, wo stand da jetzt noch was drin, was es sonst"}, {"id": 539, "start": 5070.48, "end": 5081.48, "text": "noch so gibt? Wishless Studio 2022 Review. Die bei Microsoft sind einfach zu sick-set"}, {"id": 540, "start": 5081.48, "end": 5087.72, "text": "und mir verstehen es nicht. Glaub schon. Ja, das wird an uns liegen. Gehe ich auch von"}, {"id": 541, "start": 5087.72, "end": 5096.64, "text": "aus. Unsere, unsere Köpfe sind einfach nicht zu, zu groß genug für die Microsoft-Logik."}, {"id": 542, "start": 5096.64, "end": 5102.96, "text": "Also, 64-Spit-Upgrade bisher bestes Intelli-Code. Okay, Leute, wenn das das bisher beste Intelli-Code"}, {"id": 543, "start": 5102.96, "end": 5108.24, "text": "ist, dann will ich nicht wissen, wie geil Intelli-Code bisher war. Ach, wir können tatsächlich"}, {"id": 544, "start": 5108.24, "end": 5112.52, "text": "mal probieren, ob da, was der bei Record sagt. Das, das probieren wir jetzt noch mal aus,"}, {"id": 545, "start": 5112.52, "end": 5125.16, "text": "was der bei Record sagt. Record, legt der da irgendwas vor? Jetzt mal, schlägt er in"}, {"id": 546, "start": 5125.16, "end": 5132.44, "text": "der Konsolenanwendung überhaupt was vor? Nee, in der Konsolen, warum geht dann in der"}, {"id": 547, "start": 5132.44, "end": 5140.04, "text": "Konsolenanwendung Intelli-Code nicht? Warum geht, warum, hä? Guck mal, in der Konsolenanwendung"}, {"id": 548, "start": 5140.04, "end": 5148.8, "text": "geht Intelli-Code nicht. Doch, doch. Doch, oder, oder auch, hä? Eben ging es noch nicht,"}, {"id": 549, "start": 5148.8, "end": 5161.08, "text": "vorhin ging es. Ich blick da nicht mal durch. Public, Public, der Zeichen, Glass. So, das"}, {"id": 550, "start": 5161.08, "end": 5171.72, "text": "ist das Beispiel, was eben funktioniert, was eben funktioniert hat. Drop. Okay, das funktioniert."}, {"id": 551, "start": 5171.72, "end": 5180.12, "text": "Guck mal, jetzt ist es broken, jetzt funktioniert es nicht mehr. Eben hat es mit Firstname und"}, {"id": 552, "start": 5180.12, "end": 5187.92, "text": "Lastname auch funktioniert. Jetzt ergibt er mir aber ID und User-ID und User-Count und..."}, {"id": 553, "start": 5187.92, "end": 5205.88, "text": "Ach und jetzt muss ich Firstname machen, oder? Okay, jetzt geht es. Okay, ich muss sagen,"}, {"id": 554, "start": 5205.88, "end": 5210.92, "text": "die AI ist noch ein bisschen fragil, die funktioniert noch nicht so richtig gut. Probierst du noch"}, {"id": 555, "start": 5210.92, "end": 5216.48, "text": "Maui aus? Ja, mal ganz kurz, falls sie schon drin ist. Äh, äh, warte mal, Leute, was"}, {"id": 556, "start": 5216.48, "end": 5224.48, "text": "wollte ich jetzt ausprobieren? Das habe ich schon wieder vergessen. Ach so, Record. Record."}, {"id": 557, "start": 5224.48, "end": 5240.6, "text": "Funktioniert das da auch? Äh, und jetzt muss man sagen, in it, ne? So, Record-Stells. Ne,"}, {"id": 558, "start": 5240.6, "end": 5248.6, "text": "sonst kann er noch nicht. Oh, doch. Doch, kann er, kann er. Guck mal, gar nicht so blöd,"}, {"id": 559, "start": 5248.6, "end": 5254.76, "text": "gar nicht so blöd. Naja, ich bin auch nicht so wahnsinnig begeistert, muss ich ehrlich"}, {"id": 560, "start": 5254.76, "end": 5267.16, "text": "sagen, davon. Wir machen wirklich mal ein Maui-Projekt. Falls wir... Falls das überhaupt"}, {"id": 561, "start": 5267.16, "end": 5279.8, "text": "geht schon. Geht das überhaupt schon? WPF, WPF. Wer bei Microsoft hat sich eigentlich"}, {"id": 562, "start": 5279.8, "end": 5289.8, "text": "gedacht, dass das hier übersichtlich ist? Kann es sein, dass wir das zusätzlich installieren"}, {"id": 563, "start": 5289.8, "end": 5304.64, "text": "müssen? Kann es sein, dass man Maui-Zeug zusätzlich installieren muss? Desktop? Gibt"}, {"id": 564, "start": 5304.64, "end": 5313.28, "text": "es zumindest nicht zur Auswahl. Dotnet 6 ist dabei, muss eigentlich passen. Maui ist der"}, {"id": 565, "start": 5313.28, "end": 5320.72, "text": "Versuch, von Microsoft in Cross-Platform UI-Framework rauszubringen, nur mit dem meiner Meinung nach"}, {"id": 566, "start": 5320.72, "end": 5327.36, "text": "komplett falschen Ansatz. Und Linux wird prinzipiell nicht unterstützt. Okay, also, da gibt's"}, {"id": 567, "start": 5327.36, "end": 5337.72, "text": "nix. Ja, mit Electron kannst du's auch machen. Wir können die Testgeschichte mal ausprobieren."}, {"id": 568, "start": 5337.72, "end": 5341.68, "text": "Da weiß ich aber nicht, wie das geht, Chat. Da müsste der mir helfen. Ohne Scheiß, ich"}, {"id": 569, "start": 5341.68, "end": 5351.4, "text": "hab wirklich keine Ahnung, wie das mit Tests funktioniert. Add? Class? Okay, keine Ahnung."}, {"id": 570, "start": 5351.4, "end": 5376.44, "text": "Huge? Tests? So, und wie geht das jetzt? Test? Hallo? Test? Nee, das ist, das ist irgendwas"}, {"id": 571, "start": 5376.44, "end": 5385.88, "text": "anderes, oder? Zumal das auch noch irgendwie kaputt ist und gar nicht funktioniert. Ich"}, {"id": 572, "start": 5385.88, "end": 5393.24, "text": "weiß gar nicht, wie ich den Test-Runner hier überhaupt aufmache. Ah ja. Nee, da muss ich"}, {"id": 573, "start": 5393.24, "end": 5400.6, "text": "jetzt erstmal X-Unit, N-Unit oder wie auch immer der Kram heißt installieren. Da bin"}, {"id": 574, "start": 5400.6, "end": 5407.96, "text": "ich, da bin ich zu low, da bin ich zu low für. Da bin ich zu low für. Okay, eigenes"}, {"id": 575, "start": 5407.96, "end": 5431.56, "text": "Projekt. Add? Ah ja, N-Unit-Test. Genau. Next. Create. Kann das Lore? Weiß ich nicht. Kannst"}, {"id": 576, "start": 5431.56, "end": 5439.52, "text": "ich, warum ist das hier alles, alles, alles broken? Warum ist das eigentlich alles kaputt?"}, {"id": 577, "start": 5439.52, "end": 5447.72, "text": "Ah, jetzt ist es ganz, okay. So, und wo ist jetzt der Test-Runner? Windows? Test? Wo"}, {"id": 578, "start": 5447.72, "end": 5454.68, "text": "ist, Test-Explorer, da ist er. So, und wo geht das jetzt, was der Typ gezeigt hat mit"}, {"id": 579, "start": 5454.68, "end": 5458.84, "text": "den unterschiedlichen Plattformen? Meine Güte, die Bedienung davon ist aber nur wirklich"}, {"id": 580, "start": 5458.84, "end": 5468.68, "text": "mal massivster, massivster Pains-Champ, Alter. Richtig Hardcore-Pains-Champ. Und wo kann"}, {"id": 581, "start": 5468.68, "end": 5472.92, "text": "man das jetzt Linux-technisch umstellen, was der gezeigt hat im Video? Das geht glaub"}, {"id": 582, "start": 5472.92, "end": 5486.64, "text": "ich noch gar nicht. Das ist mir, das ist mir zu eklig zu benutzen. Das mach ich eh nicht."}, {"id": 583, "start": 5486.64, "end": 5490.56, "text": "Das werd ich eh nicht benutzen. Das weiß ich jetzt schon. Soweit ich mein Visual-Studio"}, {"id": 584, "start": 5490.56, "end": 5495.52, "text": "2022 eh nicht verwenden. Ich bleib weiter unter Linux mit Rider und alles, und alles"}, {"id": 585, "start": 5495.52, "end": 5508.96, "text": "ist gut. So, gibt's sonst noch irgendwas Neues? Ich würd gerne ein Maui-Projekt anlegen,"}, {"id": 586, "start": 5508.96, "end": 5519.16, "text": "aber das geht ja nicht. Bisher best ist alles klar. Du bist jetzt Macbook-Besitzer? Ja,"}, {"id": 587, "start": 5519.16, "end": 5527.96, "text": "das macht nix, da läuft Rider auch drauf. Es ist zwar ein bisschen lustig, dass wir"}, {"id": 588, "start": 5527.96, "end": 5534.48, "text": "erst ne Java-IDE brauchen, damit wir ordentlich.NET-Cross-Plattform programmieren können,"}, {"id": 589, "start": 5534.48, "end": 5548.28, "text": "aber immer noch besser als Visual-Studio vom Mac oder sowas. Gab's jetzt noch irgendwas,"}, {"id": 590, "start": 5548.28, "end": 5551.64, "text": "was wir ausprobieren müssen? Ich mein, das ist jetzt wirklich gar nicht, das ist jetzt"}, {"id": 591, "start": 5551.64, "end": 5569.24, "text": "bisschen arm. Ich mein, das ist nicht die CPU-Plattform. Gibt ja nix. Angeblich haben"}, {"id": 592, "start": 5569.24, "end": 5576.64, "text": "jetzt, das können wir noch mal ausprobieren, Angeblich hat Windows Forms jetzt Hot Reload,"}, {"id": 593, "start": 5576.64, "end": 5581.6, "text": "aber da weiß ich nicht, ob das schon eingebaut ist. Angeblich haben die Hot Reload. Das probier"}, {"id": 594, "start": 5581.6, "end": 5587.08, "text": "wir jetzt mal aus, ob das funktioniert. Windows Forms Hot Reload, da hab ich vor 35 Jahren"}, {"id": 595, "start": 5587.08, "end": 5590.36, "text": "davon geträumt, noch bevor ich auf der Welt war. Nee, stimmt nicht, ich bin da mittlerweile"}, {"id": 596, "start": 5590.36, "end": 5603.76, "text": "36. Ja. Okay, ein Button. Ich brauch ein Button. Button. Geben wir ein Button. Alles klar."}, {"id": 597, "start": 5603.76, "end": 5608.88, "text": "So, gucken wir mal, ob das jetzt Hot Reload hat. Ich hab gelesen, dass es angeblich Hot"}, {"id": 598, "start": 5608.88, "end": 5616.08, "text": "Reload hat. So, Hot Reload. Das heißt, wenn das jetzt funktioniert. Ach, guck mal da."}, {"id": 599, "start": 5616.08, "end": 5629.4, "text": "Da gibt's nen extra Knopf. Pure Magie. Äh, nein, nein, nein. Ich will, ich will im Design,"}, {"id": 600, "start": 5629.4, "end": 5638.52, "text": "wo ist die Toolbox? Wo ist die, Leute, wo ist die Toolbox? View, Toolbox. Toolbox. Was?"}, {"id": 601, "start": 5638.52, "end": 5647.8, "text": "Okay, wir machen einfach, wir machen einfach den zweiten Button. Und jetzt, und jetzt,"}, {"id": 602, "start": 5647.8, "end": 5652.36, "text": "und jetzt, und jetzt. Passt auf, Leute. Oh nein, nein, nein. Nicht singen, das ist Monka"}, {"id": 603, "start": 5652.36, "end": 5656.88, "text": "Toss. Ah, bla, bla, bla, bla, bla, bla. Wo hab ich die Musik? Ah, wo ist die Musik?"}, {"id": 604, "start": 5656.88, "end": 5667.36, "text": "Geh. Immer wenn gesungen wird, ist Monka Toss. Immer noch. Wieder gesungen. Bam. Okay. Also,"}, {"id": 605, "start": 5667.36, "end": 5673.48, "text": "testen wir mal. Ja, wenn ich jetzt da oben auf den Button drücke, sollte das jetzt Hot"}, {"id": 606, "start": 5673.48, "end": 5687.52, "text": "Reload. Probieren wir das mal aus. Ob das Hot Reloaded. Funktioniert ja schon mal gut."}, {"id": 607, "start": 5687.52, "end": 5699.0, "text": "Okay, vielleicht, vielleicht geht das nur. Speichern? Ach, der speichert nicht automatisch"}, {"id": 608, "start": 5699.0, "end": 5709.64, "text": "für mich. Geht aber auch so nicht. Okay, vielleicht, vielleicht geht das nur, geht"}, {"id": 609, "start": 5709.64, "end": 5717.72, "text": "das nur für, äh, neue Sachen. Also, äh, nicht Button click. Wir machen jetzt irgendwie"}, {"id": 610, "start": 5717.72, "end": 5733.28, "text": "this button, äh, Texts gleich. Okay, wir nehmen die Super Big Brain AI Completion. Nö. Das"}, {"id": 611, "start": 5733.28, "end": 5746.8, "text": "funktioniert nicht. Okay. Hot Reload für Windows Form F. Ich mein nicht, dass es mich"}, {"id": 612, "start": 5746.8, "end": 5755.68, "text": "ehrlich gesagt großartig stört. Da steht Code Changes, nicht Design Changes. Na gut,"}, {"id": 613, "start": 5755.68, "end": 5763.44, "text": "wir haben jetzt beides gemacht, beides hat nicht funktioniert. Ich glaube, Hot Reload"}, {"id": 614, "start": 5763.44, "end": 5766.36, "text": "funktioniert nur, wenn man gerade nicht am Debuggen ist. Okay, dann starte ich es ohne"}, {"id": 615, "start": 5766.36, "end": 5774.16, "text": "Debugger mal. So, jetzt ist ohne, jetzt habe ich ohne Debugger gestartet. Ne, ne, dann"}, {"id": 616, "start": 5774.16, "end": 5780.12, "text": "habe ich den Button gar nicht. Ich muss das, ich muss das mit dem Debugger starten, wäre"}, {"id": 617, "start": 5780.12, "end": 5788.08, "text": "es ja auch logisch. Wieso sollte der Constructor nochmal triggern? Ja, weiß ich, ich frage"}, {"id": 618, "start": 5788.08, "end": 5792.68, "text": "Microsoft, die schreiben was von Hot Reload. Ja, wir können, wir können noch mal was anderes"}, {"id": 619, "start": 5792.68, "end": 5798.32, "text": "probieren. Hier ist nichts, hier ist nichts drinne. Dann machen wir jetzt mal die onClick,"}, {"id": 620, "start": 5798.32, "end": 5802.64, "text": "die onClick Methode, machen wir jetzt mal was rein für den, für den Button. Also, aktuell"}, {"id": 621, "start": 5802.64, "end": 5807.84, "text": "passiert nichts. Ähm, das heißt, wir machen da jetzt rein, oh, wie macht man denn Pop-Up?"}, {"id": 622, "start": 5807.84, "end": 5817.28, "text": "Wie, wie macht man denn Pop-Up in Windows Forms? Model? Model? Ne. Ah, du Scheiße. Okay,"}, {"id": 623, "start": 5817.28, "end": 5832.92, "text": "Dialog. Dialog? Ne. Message Box. Message Box Show. Ah ja. Okay. Fuck. Okay, gespeichert."}, {"id": 624, "start": 5832.92, "end": 5840.04, "text": "Hot Reload. Und jetzt? Oh, das funktioniert. Also, da haben wir schon mal. Designer Changes"}, {"id": 625, "start": 5840.04, "end": 5851.04, "text": "gehen nicht und Constructor Changes gehen nicht. Okay. Jetzt noch mal testen, ob das"}, {"id": 626, "start": 5851.04, "end": 5859.2, "text": "auch wirklich funktioniert. Forgo. Reload. Es funktioniert. Okay, das ist schon mal cool."}, {"id": 627, "start": 5859.2, "end": 5870.64, "text": "Weil, man checkt noch wirklich Design, Design-Sachen nicht funktionieren. Properties. Mal das,"}, {"id": 628, "start": 5870.64, "end": 5878.92, "text": "äh, Color. Ist jetzt, äh, Orange. Perfekt. Ne, das funktioniert nicht. Das wird unter"}, {"id": 629, "start": 5878.92, "end": 5883.96, "text": "der Haube eh auch in irgendeinem Constructor gesetzt. Naja. Nice to have hat eigentlich"}, {"id": 630, "start": 5883.96, "end": 5888.24, "text": "kaum einer gebraucht. Aber mal ganz ehrlich, juckt mich nicht. Windows Form kann durchaus"}, {"id": 631, "start": 5888.24, "end": 5894.96, "text": "ein paar coole neue Features gebrauchen, auch wenn Windows Forms an sich schon, da bisschen"}, {"id": 632, "start": 5894.96, "end": 5913.28, "text": "in die Jahre gekommen ist. Does it work on Macbook? No. No. But, äh, I think the final"}, {"id": 633, "start": 5913.28, "end": 5932.2, "text": "version has Visual Studio for Mac. Lass mal kurz gucken. Gibt's da schon was für Mac?"}, {"id": 634, "start": 5932.2, "end": 5948.88, "text": "Maybe it's available for Mac, too. Don't know. Looks like Windows only. Ja, aber ich"}, {"id": 635, "start": 5948.88, "end": 5955.04, "text": "glaube, das sagt eh unter Mac. Ja, okay, das ist Hard Reload für Windows Forms. Warum"}, {"id": 636, "start": 5955.04, "end": 5965.92, "text": "nicht? Warum nicht? Kann man machen. Muss man nicht. Benutzen die Leute nicht Flutter"}, {"id": 637, "start": 5965.92, "end": 5969.56, "text": "eher anstelle von Windows Forms? Naja, auf dem Desktop nicht. Auf dem Desktop, also Flutter"}, {"id": 638, "start": 5969.56, "end": 5974.44, "text": "ist cool, aber Flutter auf dem Desktop ist einfach noch nicht ready. Aber ich gehe davon"}, {"id": 639, "start": 5974.44, "end": 5979.0, "text": "aus, dass Flutter auf dem Desktop noch das brauchbarste Crossplatform, auf absehbare"}, {"id": 640, "start": 5979.0, "end": 5985.92, "text": "Zeit das brauchbarste Crossplatform GUI Framework werden wird, weil aktuell hast du ehrlich"}, {"id": 641, "start": 5985.92, "end": 5995.76, "text": "gesagt zwei realistische Alternativen. Du hast Qt oder du hast Electron. Das sind die"}, {"id": 642, "start": 5995.76, "end": 6001.76, "text": "einzigen zwei, die es gibt. Electron ist halt, sagen wir so, JavaScript, was sich jedermanns"}, {"id": 643, "start": 6001.76, "end": 6007.92, "text": "Fall ist, und es ist halt riesengroß mit massig Ramverbrauch, weil Electron, weil V8 und Chrome"}, {"id": 644, "start": 6007.92, "end": 6013.12, "text": "und Node.js alles gleichzeitig laufen muss. Gut, und du hast Qt, das Problem an Qt ist"}, {"id": 645, "start": 6013.12, "end": 6017.64, "text": "C++. Du kannst ein bisschen was in Python machen, aber Python Crossplatform zu packagen"}, {"id": 646, "start": 6017.64, "end": 6029.68, "text": "ist auch nicht so wahnsinnig tolle. Und ansonsten hast du nix? Ja, doch, stimmt, du hast Tkinter"}, {"id": 647, "start": 6029.68, "end": 6036.8, "text": "in Python eingebaut. Avalonia ist leider auch noch nicht wirklich soweit, dass man das,"}, {"id": 648, "start": 6036.8, "end": 6042.4, "text": "also das letzte Mal, wo ich mir das angeguckt hab, dass man das komplett gut verwenden kann."}, {"id": 649, "start": 6042.4, "end": 6048.96, "text": "Das letzte Mal, wo ich Avalonia geguckt hab, die hatten beispielsweise noch kein Browser,"}, {"id": 650, "start": 6048.96, "end": 6055.92, "text": "also noch kein Webview und auch keine Möglichkeit in irgendeiner Art und Weise da beschleunigten"}, {"id": 651, "start": 6055.92, "end": 6066.04, "text": "GPU, beschleunigten Content zu rendern. C++ ist für'n Arsch, ja ist es auch. Ansonsten"}, {"id": 652, "start": 6066.04, "end": 6071.24, "text": "ist Avalonia ganz cool. Ganz ehrlich, ich hätt's cooler gefunden, hätt' Microsoft"}, {"id": 653, "start": 6071.24, "end": 6076.64, "text": "Avalonia ordentlich gemacht und nicht ihr komisches Maui rausgebracht. Maui ist, finde"}, {"id": 654, "start": 6076.64, "end": 6079.92, "text": "ich, der falsche Ansatz. Das hab ich jetzt schon ein paar Mal gesagt, ich versuch jetzt"}, {"id": 655, "start": 6079.92, "end": 6084.04, "text": "mal zu erklären, warum das meiner Meinung nach der falsche Ansatz ist. Also, wenn du"}, {"id": 656, "start": 6084.04, "end": 6089.44, "text": "nun Crossplatform GUI Framework machst, dann hast du zwei grundsätzlich unterschiedliche"}, {"id": 657, "start": 6089.44, "end": 6096.96, "text": "Ansätze. Du kannst sagen, ich bau nen Rapper, der die native UI Elemente nimmt, also hier"}, {"id": 658, "start": 6096.96, "end": 6103.56, "text": "zum Beispiel Buttons unter Windows, die so aussehen, Buttons unter Linux, die so aussehen,"}, {"id": 659, "start": 6103.56, "end": 6109.08, "text": "also du nimmst die native UI Elemente und baust nen Rapper drum herum und dann hast"}, {"id": 660, "start": 6109.08, "end": 6115.12, "text": "du den Vorteil, dass die Anwendungen zwar native aussehen, aber sich oftmals ein bisschen"}, {"id": 661, "start": 6115.12, "end": 6119.48, "text": "merkwürdig anfühlen, weil du für den kleinsten gemeinsamen Nenner programmieren willst."}, {"id": 662, "start": 6119.48, "end": 6125.24, "text": "Also, wenn du so nen Rapper hast, der beispielsweise native Controls benutzt von Android, iOS,"}, {"id": 663, "start": 6125.24, "end": 6130.4, "text": "Windows, Linux, Mac, die Frage ist immer noch, was ist eigentlich native unter Linux, dann"}, {"id": 664, "start": 6130.4, "end": 6136.0, "text": "musst du gucken, dass du den kleinsten gemeinsamen Nenner an API unterstützt, was du abbilden"}, {"id": 665, "start": 6136.0, "end": 6141.76, "text": "kannst. So, das ist das, wie das Xamarin oder Maui macht. Du kannst es da übrigens auch"}, {"id": 666, "start": 6141.76, "end": 6147.48, "text": "besser machen, aber dann musst du sagen, if Platform gleich gleich Windows. So, und"}, {"id": 667, "start": 6147.48, "end": 6151.48, "text": "dann gibt es den Ansatz, der meiner Meinung nach einzig wahre und sinnvollste Ansatz, so"}, {"id": 668, "start": 6151.48, "end": 6160.96, "text": "wie das Flutter auch macht, ist, man nimmt für die jeweilige Platform schnellste Rendertechnologie"}, {"id": 669, "start": 6160.96, "end": 6166.36, "text": "und malt Steuerelemente selbst. Das heißt, oder was heißt für die jeweilige Platform,"}, {"id": 670, "start": 6166.36, "end": 6173.04, "text": "das muss noch nicht mal sein. Das heißt, man programmiert nen Renderer für Windows,"}, {"id": 671, "start": 6173.04, "end": 6181.96, "text": "für Linux, für Mac, für iOS, für Android, mit was für nem Tool auch immer und malt"}, {"id": 672, "start": 6181.96, "end": 6191.32, "text": "Steuerelemente selbst. Genau, Avalonia ist hier. Die hatten eine Zeit lang noch GTK-Erhängigkeit"}, {"id": 673, "start": 6191.32, "end": 6193.76, "text": "unter Linux, das hat mich immer ein bisschen abgeschreckt, aber ich glaube, das verwenden"}, {"id": 674, "start": 6193.76, "end": 6208.32, "text": "die plus zum Fenster malen. Ich denke, das muss nicht unbedingt so sein, du musst dich"}, {"id": 675, "start": 6208.32, "end": 6220.96, "text": "halt selbst darum kümmern. Also, ich finde den Ansatz für konsistentes Look und Feel,"}, {"id": 676, "start": 6220.96, "end": 6227.12, "text": "keine Steuerelemente malen. Deswegen ist ja auch letztendlich Electron so cool, weil Electron"}, {"id": 677, "start": 6227.12, "end": 6233.52, "text": "ist nix anderes als nen Browser, also ne Anwendung verpackt mit nem Browser dabei, Node.js V8,"}, {"id": 678, "start": 6233.52, "end": 6239.68, "text": "Chrome und das sieht halt überall eben aus, wie es halt in nem Chrome nun mal aussieht,"}, {"id": 679, "start": 6239.68, "end": 6250.64, "text": "egal auf welcher Plattform. Qt macht das übrigens auch so mit QML, die malen im Endeffekt auf"}, {"id": 680, "start": 6250.64, "end": 6256.44, "text": "jeder Plattform, mit, es gibt für Qt gibt's nen Diode X Renderer, beziehungsweise auch"}, {"id": 681, "start": 6256.44, "end": 6261.76, "text": "nen GL Renderer und sonst was. Die malen das auch so. Nur Microsoft hat sich wieder gedacht"}, {"id": 682, "start": 6261.76, "end": 6266.4, "text": "bei Maui, ne ne, wir machen diesen komischen Steuerelemente wrapper und das finde ich ist"}, {"id": 683, "start": 6266.4, "end": 6271.96, "text": "ein Kack Ansatz. Dann hast du dann wieder so Dinger, da siehts unter Mac kacke aus, oder"}, {"id": 684, "start": 6271.96, "end": 6275.32, "text": "mal siehts unter Windows kacke aus, mal siehts dann unter Linux kacke aus, mal siehts unter"}, {"id": 685, "start": 6275.32, "end": 6281.24, "text": "Android nach iOS aus, mal iOS nach Android aus und ach keine Ahnung. Ja und Flutter"}, {"id": 686, "start": 6281.24, "end": 6286.36, "text": "macht das richtig, Flutter malt den Kram selbst, deswegen denke ich, wenn die es schaffen,"}, {"id": 687, "start": 6286.36, "end": 6295.72, "text": "dass man ordentlich es auf dem Desktop benutzen kann, dass Flutter sich durchsetzen wird,"}, {"id": 688, "start": 6295.72, "end": 6302.52, "text": "weil es ist ne angenehmere Sprache als C++, auch wenn Dart, wisst ihr das Optimale, soll"}, {"id": 689, "start": 6302.52, "end": 6309.44, "text": "ich euch mal sagen, was das beste wäre, also die beste Kombination aus allem. Irgendjemand"}, {"id": 690, "start": 6309.44, "end": 6316.6, "text": "nimmt Flutter und nimmt ne ordentliche Programmiersprache, wo du auch Zugriff auf viele Libraries hast,"}, {"id": 691, "start": 6316.6, "end": 6321.96, "text": "ja. Also irgendjemand macht nen C Sharp Flutter oder nen JavaScript Flutter oder was auch"}, {"id": 692, "start": 6321.96, "end": 6328.08, "text": "immer. Das wär wahrscheinlich am besten, ich mein Dart. Warum muss es denn ausgerechnet"}, {"id": 693, "start": 6328.08, "end": 6334.0, "text": "Dart sein bei Flutter? Hätte man da nicht irgendwas nehmen können, was es gibt? Es"}, {"id": 694, "start": 6334.0, "end": 6338.56, "text": "ist jetzt nicht, als hätte Flutter unbedingt den Anspruch, ja wir brauchen auch ne eigene"}, {"id": 695, "start": 6338.56, "end": 6349.04, "text": "Programmiersprache dabei. Warum? Ja nur der Unterschied, dass du bei Electron noch ein"}, {"id": 696, "start": 6349.04, "end": 6354.0, "text": "komplettes Node-Share hast, einen kompletten Chrome mit V8 laufen lassen hast. React Native"}, {"id": 697, "start": 6354.0, "end": 6362.8, "text": "aufm Desktop sackt. Ich hab mal nen Stream in Flutter gemacht, aber ich bin da nicht"}, {"id": 698, "start": 6362.8, "end": 6372.28, "text": "wirklich gut drinne. Schau dir mal Tauri an. Ja erinnert nix dran, dass es viel RAM braucht"}, {"id": 699, "start": 6372.28, "end": 6376.52, "text": "wahrscheinlich. Ob das jetzt ein Chrome ist oder ein Native Browser, Browser brauchen"}, {"id": 700, "start": 6376.52, "end": 6387.56, "text": "halt viel RAM. Das, ja ja das hab ich gesehen. Blazer Native und Gedöns, ja das hab ich gesehen,"}, {"id": 701, "start": 6387.56, "end": 6393.48, "text": "wobei ich halt nicht so genau den, ich versteh nicht wirklich so genau die Existenzberechtigung"}, {"id": 702, "start": 6393.48, "end": 6400.72, "text": "ehrlich gesagt, weil C Sharp im Browser mit Blazer ist halt langsam und braucht nen riesen"}, {"id": 703, "start": 6400.72, "end": 6406.16, "text": "Runtime bevor es überhaupt startet. Und es hat jetzt nicht so den riesen Vorteil gegenüber"}, {"id": 704, "start": 6406.16, "end": 6411.8, "text": "Javascript, zumal du für gewisse Dom-Interaktionen immer noch Javascript brauchst im Blazer."}, {"id": 705, "start": 6411.8, "end": 6418.04, "text": "Das ist glaub ich so, das ist so ne coole Idee gewesen bei Microsoft, wo ich nicht so"}, {"id": 706, "start": 6418.04, "end": 6425.28, "text": "den Realitätsbezug drin sehe. Es gibt bereits viel zu viele Sprachen, Newbies wissen nicht"}, {"id": 707, "start": 6425.28, "end": 6428.88, "text": "wo sie anfangen sollen. Wenn Newbies nicht wissen wo sie anfangen sollen, dann sollen"}, {"id": 708, "start": 6428.88, "end": 6435.76, "text": "die zu mir auf YouTube gehen und sich einfach dieses Video hier angucken. Was ist die beste"}, {"id": 709, "start": 6435.76, "end": 6440.92, "text": "Einstiegsprogrammiersprache? Guckt euch das Video an und dann fangt mit Javascript an."}, {"id": 710, "start": 6440.92, "end": 6449.0, "text": "Oder mit ner anderen Sprache die wir sagen, aber wenn ihr nicht wisst was ihr machen wollt"}, {"id": 711, "start": 6449.0, "end": 6454.88, "text": "dann fangt mit Javascript an. Es sei denn ihr habt ne Abneigung jetzt schon gegen Javascript,"}, {"id": 712, "start": 6454.88, "end": 6460.2, "text": "dann nehmt halt was anderes davon, dann nehmt Python oder Go oder C Sharp oder meinetwegen"}, {"id": 713, "start": 6460.2, "end": 6465.88, "text": "jetzt Microcontroller sind auch C. Warum ist C drinne? Naja, erstens weil der Florian C"}, {"id": 714, "start": 6465.88, "end": 6471.36, "text": "Fan ist und C ist ja auch ok und gerade wenn es um Microcontroller geht, ist das nun wirklich"}, {"id": 715, "start": 6471.36, "end": 6476.0, "text": "was womit viele Leute anfangen. Viele Leute fangen mit irgendwie so nem Arduino Ding an"}, {"id": 716, "start": 6476.0, "end": 6481.16, "text": "zum Beispiel und da kannst du ja nur C verwenden bzw. du kannst eigentlich nur dieses Arduino"}, {"id": 717, "start": 6481.16, "end": 6485.92, "text": "C++ verwenden, aber man sollte auch wenn man Arduino programmiert möglichst großen Bogen"}, {"id": 718, "start": 6485.92, "end": 6491.92, "text": "um viele C++ Features machen, weil C++ einfach nur ganz großer Pains Champ ist."}, {"id": 719, "start": 6491.92, "end": 6510.52, "text": "Wenn Flutter Dart sich durchsetzen will, warum dann nicht als Noob anfangen? Weil Dart ne"}, {"id": 720, "start": 6510.52, "end": 6517.24, "text": "Programmiersprache ist, die du nirgendswo gebrauchen kannst sonst und du wirst als deine"}, {"id": 721, "start": 6517.24, "end": 6526.36, "text": "erste Anwendung nicht gerade ne Cross-Platform GUI Anwendung machen. Also man kann sicherlich"}, {"id": 722, "start": 6526.36, "end": 6530.64, "text": "mit Dart und Flutter anfangen, wenn man da ne Vorliebe für hat, aber ich glaub nicht,"}, {"id": 723, "start": 6530.64, "end": 6534.28, "text": "dass das die beste Einsteigersprache ist oder sich da besonders gut für eignet."}, {"id": 724, "start": 6534.28, "end": 6543.2, "text": "In der Berufsschule haben wir mit C angefangen, sind auf Java gewechselt ab dem zweiten Jahr."}, {"id": 725, "start": 6543.2, "end": 6549.24, "text": "Ja das hab ich öfters gehört, bei uns in der Berufsschule haben wir auch C gemacht"}, {"id": 726, "start": 6549.24, "end": 6555.64, "text": "und später dann ein bisschen C Sharp und das lustige war, wir haben noch auf Papier programmiert"}, {"id": 727, "start": 6555.64, "end": 6560.32, "text": "in der Berufsschule, das ist richtig armselig. Ich mein das ist jetzt nicht, das war 2007"}, {"id": 728, "start": 6560.32, "end": 6565.6, "text": "oder so. Das ist richtig armselig, dass man da noch auf Papier programmieren musste."}, {"id": 729, "start": 6565.6, "end": 6579.16, "text": "Was hältst du von Visual Studio Code 2020? Bis jetzt ist es durchaus in Ordnung, was"}, {"id": 730, "start": 6579.16, "end": 6583.36, "text": "ich gesehen hab. Die Sache ist nur die, dass es halt so ein Release ist, wo es im Prinzip"}, {"id": 731, "start": 6583.36, "end": 6590.88, "text": "nichts großes zu sehen gibt. Ich mein,.NET 6 ist dabei als Preview, ok, IntelliCode, ok"}, {"id": 732, "start": 6590.88, "end": 6594.6, "text": "wenn das das beste IntelliCode ist, da will ich nicht wissen, wie das vorher war und es"}, {"id": 733, "start": 6594.6, "end": 6598.36, "text": "kommt einem so vor, als laden die Projekte ein bisschen schneller, aber im Großen und"}, {"id": 734, "start": 6598.36, "end": 6604.8, "text": "Ganzen ehrlich gesagt, ja, es ist vorhanden. Mal gucken, was bei Release rauskommt. Es"}, {"id": 735, "start": 6604.8, "end": 6608.12, "text": "wird bei Release immer noch das beste für die meisten Leute sein, die unter Windows"}, {"id": 736, "start": 6608.12, "end": 6613.04, "text": "anfangen mit.NET zu programmieren, wobei ich sagen würde, wenn ich unter Windows programmieren"}, {"id": 737, "start": 6613.04, "end": 6622.64, "text": "würde, ich würde trotzdem Rider installieren. Ich bin ja schon seit letzten paar Jahren,"}, {"id": 738, "start": 6622.64, "end": 6628.44, "text": "was.NET angeht, nur noch unter Linux am programmieren mit Rider, aber im Ernst, ich würde es unter"}, {"id": 739, "start": 6628.44, "end": 6641.64, "text": "Windows auch so machen. Rider beste. Kostet halt was, wenn man nicht die Trial austricksen"}, {"id": 740, "start": 6641.64, "end": 6661.8, "text": "will. Chatbrain sollte mich auch noch sponsoren, genau. Der Vorteil am Papier programmieren"}, {"id": 741, "start": 6661.8, "end": 6668.24, "text": "ist, dass du jeden Schritt dreimal überlegst. Das dumme am Papier programmieren ist, wenn"}, {"id": 742, "start": 6668.24, "end": 6676.24, "text": "du Semikolon vergisst, das zeigt es dir nicht an. Man muss es, ich meine, es ist 2021. Da"}, {"id": 743, "start": 6676.24, "end": 6681.8, "text": "kann man durchaus nicht an Rechnersetzen programmieren. Ich bin da kein großartiger Fan von, ich"}, {"id": 744, "start": 6681.8, "end": 6694.08, "text": "halte es auch nicht für so sinnvoll. Als Student sind Chatbrains IDE's for free. Kann man Windows"}, {"id": 745, "start": 6694.08, "end": 6699.04, "text": "11 die Gruppierungen wieder ausschalten? Tja. Ich habe nichts gefunden bis jetzt, fuck mich"}, {"id": 746, "start": 6699.04, "end": 6709.64, "text": "auch total ab. Und ich habe hier in den Settings geguckt, da ist nichts zu drinnen. Keine Gruppierungen."}, {"id": 747, "start": 6709.64, "end": 6719.48, "text": "Ich habe es aber nicht aktiviert, aber man hat da kein Setting, also das nervt mich richtig."}, {"id": 748, "start": 6719.48, "end": 6724.4, "text": "Da brauchst du wahrscheinlich wieder irgendwelche komischen Registry-Hacks dafür. Also wenn"}, {"id": 749, "start": 6724.4, "end": 6730.92, "text": "sie das lassen, mache ich erstmal 5 Videos, in denen ich Microsoft fläme. Dieses Gekrupe"}, {"id": 750, "start": 6730.92, "end": 6738.24, "text": "ist so ätzend. Ich habe 3 Browser in Firefox auf, weil so will ich auch 3 Browser unten"}, {"id": 751, "start": 6738.24, "end": 6745.4, "text": "angezeigt bekommen. Ich meine, es ist ja nicht so, als hätte ich nicht genug Platz. Was"}, {"id": 752, "start": 6745.4, "end": 6750.6, "text": "denken die denn, wie viele Programme die Leute da unten verlinken? 50? Ich habe da unten"}, {"id": 753, "start": 6750.6, "end": 6754.08, "text": "drin. Guck mal, was habe ich denn hier? Ich habe meine Shell, ich habe einen Explorer,"}, {"id": 754, "start": 6754.08, "end": 6768.92, "text": "ich habe einen Browser. Fertig. Das reicht. Ich glaube, bei Microsoft, die treffen immer"}, {"id": 755, "start": 6768.92, "end": 6774.24, "text": "noch gute Entscheidungen. Also gerade was Clouds Sachen angeht und mit Github und sie"}, {"id": 756, "start": 6774.24, "end": 6778.24, "text": "machen schon viele coole Sachen. Microsoft hat dann einfach zig viele Abteilungen. Davon"}, {"id": 757, "start": 6778.24, "end": 6784.84, "text": "bauen halt auch viele Kacke. Unter anderem die Leute, die für Windows zuständig sind,"}, {"id": 758, "start": 6784.84, "end": 6789.24, "text": "weiß ich nicht, was die machen die letzten 5 Jahre über. Windows ist immer noch ein"}, {"id": 759, "start": 6789.24, "end": 6793.52, "text": "unglaublich zusammengestöckeltes Stück Software. Wie kriege ich denn das da eigentlich weg?"}, {"id": 760, "start": 6793.52, "end": 6811.28, "text": "Wie kriege ich das weg? Ich habe letztens H1 Update gemacht. Wetter, wie kriege ich das"}, {"id": 761, "start": 6811.28, "end": 6826.16, "text": "Wetter weg? Das ist auch so ein Windows Feature, ne? Da hat jetzt wirklich die Welt drauf gewartet,"}, {"id": 762, "start": 6826.16, "end": 6832.72, "text": "oder? Da hat die Welt drauf gewartet. Die haben gesagt, ja, ich brauche unbedingt so"}, {"id": 763, "start": 6832.72, "end": 6838.8, "text": "ein komisches Widgetrechts in meiner Taskleiste. Was da so total out of place auch noch aussieht."}, {"id": 764, "start": 6838.8, "end": 6855.84, "text": "Die Delta-Mutanten breiten sich rasant aus. Aha. Delta-Mutanten sind am Start. Ich hoffe,"}, {"id": 765, "start": 6855.84, "end": 6862.76, "text": "oh, wisst ihr, das ist geil, wenn die Delta-Mutanten sich ausbreiten. Das heißt, dass die Homeoffice-Pflicht"}, {"id": 766, "start": 6862.76, "end": 6866.2, "text": "verlängern werden. Die sollen sich mal ein bisschen schneller ausbreiten. Die haben noch"}, {"id": 767, "start": 6866.2, "end": 6871.8, "text": "bis zum 30. Zeit sich auszubreiten. Weil bis zum 30. wollten sie ja die Homeoffice-Pflicht"}, {"id": 768, "start": 6871.8, "end": 6876.68, "text": "lassen und danach nicht verlängern. Aber wenn sich die Delta-Mutanten jetzt ausbreiten,"}, {"id": 769, "start": 6876.68, "end": 6882.72, "text": "dann verlängern die das wieder. Hoffentlich breiten die sich mal ordentlich geschwind"}, {"id": 770, "start": 6882.72, "end": 6891.36, "text": "aus jetzt. Kein Homeoffice. Warum? Homeoffice ist beste. Die breiten sich nicht so. Das"}, {"id": 771, "start": 6891.36, "end": 6898.48, "text": "ist aber schlecht. Die sollen mal Gas geben, die Mutanten. C++ ist auch die beste Sprache."}, {"id": 772, "start": 6898.48, "end": 6910.88, "text": "C++ ist einfach nur ein ganz großer Pains-Champ. Du hast nur Gutes... Wer erzählt allen Ernstes"}, {"id": 773, "start": 6910.88, "end": 6932.72, "text": "nur Gutes über C++? Das glaube ich nicht. Das kann nicht sein. Dreh grad. Du machst"}, {"id": 774, "start": 6932.72, "end": 6936.4, "text": "das aktuelle Projekt absichtlich in C++? Ja, manche Leute sind nicht mehr zu retten."}, {"id": 775, "start": 6936.4, "end": 6942.28, "text": "Gut, ich meine ich mache das ESP und Arduino Zeug auch in C++. Weil es nicht anders geht."}, {"id": 776, "start": 6942.28, "end": 6953.12, "text": "Aber ich würde das jetzt nie freiwillig machen. Du meinst den Typ unter meinem Video? Ja der"}, {"id": 777, "start": 6953.12, "end": 6958.42, "text": "war geil. Der war geil. Der war richtig loster Typ bei mir unterm Video letztens. Der gemeint"}, {"id": 778, "start": 6958.42, "end": 6966.4, "text": "hat Homeoffice ist der erste Schritt in die Entlassung. Der war ein geiler Typ. Der war"}, {"id": 779, "start": 6966.4, "end": 6979.28, "text": "da voll überzeugt von. Arduino ist C++. In der Arduino IDE auch noch so ganz komische"}, {"id": 780, "start": 6979.28, "end": 7006.04, "text": "Abwanderungen davon. Mit ein paar Erweiterungen. Soll ich euch mal... Pass mal auf. Für alle"}, {"id": 781, "start": 7006.04, "end": 7014.36, "text": "die sagen C++ ist gut. Ein Beispiel was mir gerade so spontan einfällt. Also wir gucken"}, {"id": 782, "start": 7014.36, "end": 7030.56, "text": "uns jetzt mal was an in.NET. Also in.NET kann ich sowas machen wie hier. Output. Output"}, {"id": 783, "start": 7030.56, "end": 7041.8, "text": "gleich LUL. Und dann sage ich Console Rightline Output to Upper Case. Wobei ich bin mir nicht"}, {"id": 784, "start": 7041.8, "end": 7046.12, "text": "sicher ob die das jetzt nicht... Doch ich glaube sogar seit dem letzten C++ Standard"}, {"id": 785, "start": 7046.12, "end": 7050.8, "text": "haben die das eingebaut. Ich glaube seit dem letzten C++ Standard haben die das jetzt sogar"}, {"id": 786, "start": 7050.8, "end": 7055.12, "text": "eingebaut. So und in C++ geht das so."}, {"id": 787, "start": 7055.12, "end": 7072.44, "text": "Ist gleich viel besser ne. Viel viel besser. Viel besser lesbar und übrigens wir haben"}, {"id": 788, "start": 7072.44, "end": 7078.88, "text": "jetzt immer noch nicht ausgegeben jetzt. Viel besser. Ja stimmt schon habt ihr recht."}, {"id": 789, "start": 7078.88, "end": 7084.56, "text": "Exposed. Aber ich glaube dass die tatsächlich to Lower to Upper Case im letzten C++ Standard"}, {"id": 790, "start": 7084.56, "end": 7096.64, "text": "drinne haben. Ja aber es gibt noch mehr. Also es hört nicht auf. Aber ich will jetzt nicht"}, {"id": 791, "start": 7096.64, "end": 7101.44, "text": "anzufangen zu sehr über C++ zu renten. Übrigens kann mir jemand erklären was es macht in"}, {"id": 792, "start": 7101.44, "end": 7107.64, "text": "C++. Passt auf. Ich hab hier so ein paar lustige C++ Beispiele. Wer weiß was es macht. Oh"}, {"id": 793, "start": 7107.64, "end": 7127.56, "text": "das Highlight ist kaputt. Irgendjemand eine Ahnung? Was machts? Naja das ist ein Vergleich"}, {"id": 794, "start": 7127.56, "end": 7135.28, "text": "der Standard Lips nicht der Sprachen. Doch. Das ist ja das was das C++ Cremio macht. Die"}, {"id": 795, "start": 7135.28, "end": 7144.12, "text": "machen die Sprache und die Standard Library. Das musste schon mit zählen. Ok es hat keiner"}, {"id": 796, "start": 7144.12, "end": 7159.08, "text": "eine Ahnung was es macht. Gut schonmal wunderbar. Ich weiß auch nicht mehr was es macht um"}, {"id": 797, "start": 7159.08, "end": 7163.12, "text": "ehrlich zu sein. Das hab ich für irgendwas gebraucht. Ich hab aber keine Ahnung mehr"}, {"id": 798, "start": 7163.12, "end": 7172.12, "text": "was es macht. Ich glaub ich weiß wieder was es macht. Du kannst diese Methode hier aufrufen"}, {"id": 799, "start": 7172.12, "end": 7177.8, "text": "mit beliebig vielen Argumenten und der nimmt alle Argumente und macht einen String draus"}, {"id": 800, "start": 7177.8, "end": 7184.72, "text": "am Ende. Also im Prinzip dass das gleiche was du mit Params in C sharp machst. So auch"}, {"id": 801, "start": 7184.72, "end": 7189.88, "text": "wunderbar. Wunderbares C++ Beispiel. Allein schon dass die Leute immer noch mit Header"}, {"id": 802, "start": 7189.88, "end": 7196.48, "text": "rumhantieren müssen. Ja es gibt jetzt Modules. Aber niemand bisher verwenden wirklich Modules."}, {"id": 803, "start": 7196.48, "end": 7208.32, "text": "Das ist alles noch irgendwie ein komischer Header Crap. Headcraps. Es ist halt C++ was"}, {"id": 804, "start": 7208.32, "end": 7215.88, "text": "soll ich da noch zu sagen. Ich geb dir Header. Dann hast du so ein Iterator Kram nicht richtig"}, {"id": 805, "start": 7215.88, "end": 7219.92, "text": "funktioniert. Dann hast du jetzt erst so ein Iterator nicht richtig. Es ist C++. Es ist"}, {"id": 806, "start": 7219.92, "end": 7225.24, "text": "einfach wir. Es ist an jeder Stelle wo du hinguckst wir as fuck. Du kannst den ganzen"}, {"id": 807, "start": 7225.24, "end": 7231.6, "text": "Tag Weirdchamping betreiben wenn du C++ programmieren musst. Ich seh es wirklich C++ programmieren."}, {"id": 808, "start": 7231.6, "end": 7240.04, "text": "Wenn ich irgendwelche ESP Sachen mache seh ich die permanent so vorm Rechner. Mir wird"}, {"id": 809, "start": 7240.04, "end": 7247.0, "text": "schon ganz schwindelig vom ganzen Weirdchampen wenn ich C++ programmieren muss. Tommy Dankeschön"}, {"id": 810, "start": 7247.0, "end": 7250.56, "text": "für den Sub. Ich hab übrigens gar nicht gesehen wer alles noch subscribt hat. Hier Tommy Dankeschön"}, {"id": 811, "start": 7250.56, "end": 7256.96, "text": "vor einer Minute. Der Alex ist auch am Start. Huza 345 war auch Subscribed. Domtorretto."}, {"id": 812, "start": 7256.96, "end": 7263.88, "text": "Und davor der Krelax den hab ich schon. Dankeschön Leute für die ganzen 5 hat mega 6 hat"}, {"id": 813, "start": 7263.88, "end": 7270.56, "text": "big brain subscriptions. Ihr werdet übrigens gerade im Teams angerufen hab ich gehört."}, {"id": 814, "start": 7270.56, "end": 7279.16, "text": "Hadeschamp ich weiß. Macht demnächst eine Arduino C++ Session haben wir schon öfters"}, {"id": 815, "start": 7279.16, "end": 7286.56, "text": "gemacht. Wofür braucht man denn eigentlich C++? Man braucht C++ überall dafür wo es"}, {"id": 816, "start": 7286.56, "end": 7291.6, "text": "leider nichts anderes gibt. Zum Beispiel um Microcontroller oder ESPs und Arduinos und"}, {"id": 817, "start": 7291.6, "end": 7296.56, "text": "sonst was zu programmieren. Das ist da gibt es keine guten Alternativen zu C++. Du hast"}, {"id": 818, "start": 7296.56, "end": 7301.64, "text": "zwar MicroPython damit hast du andere Probleme. Du hast eine minimal Rust Geschichte die auch"}, {"id": 819, "start": 7301.64, "end": 7308.88, "text": "nicht richtig funktioniert. Also im Prinzip bleibt dir da gerade für Arduino und alles"}, {"id": 820, "start": 7308.88, "end": 7317.28, "text": "Arduino kompatible nicht viel übrig. Nehmst du was nicht Arduino kompatibles dann ist"}, {"id": 821, "start": 7317.28, "end": 7323.4, "text": "das alles einfach nur klassisches C. Aber Arduino Arduino kompatibel ist C++ und da"}, {"id": 822, "start": 7323.4, "end": 7334.32, "text": "bleibt dir nicht viel übrig. Sebi Dankeschön für den Sub. Übrigens auch der Grund warum"}, {"id": 823, "start": 7334.32, "end": 7338.84, "text": "ich immer Unreal also sollte ich mal sollte ich mal jemals ein Spiel programmieren wollen."}, {"id": 824, "start": 7338.84, "end": 7344.08, "text": "Ich würde Instant Unity nehmen wegen C Sharp und und zu Unreal würde ich würde ich sagen."}, {"id": 825, "start": 7344.08, "end": 7351.76, "text": "Allein schon wenn ich da das C++ Gewurste sehe. Ich weiß man kann Unreal auch über"}, {"id": 826, "start": 7351.76, "end": 7356.12, "text": "diesen komischen Blueprint Editor machen aber ich habe letztens ein Video gesehen von einem"}, {"id": 827, "start": 7356.12, "end": 7362.58, "text": "der hat versucht eine Tür zu programmieren in Unreal die auf und zu geht und also die"}, {"id": 828, "start": 7362.58, "end": 7366.68, "text": "richtig rum auf und zu geht und er hat irgendwie einen halben Bildschirm voller Kästchen und"}, {"id": 829, "start": 7366.68, "end": 7372.76, "text": "verbundenen Input Outputs mit gehabt. Sowas sind fünf Zeilen C++ Code warum soll ich"}, {"id": 830, "start": 7372.76, "end": 7377.0, "text": "das in irgendeinem Blueprint machen. Sag ich jetzt als Unreal Noob ich habe keine Ahnung"}, {"id": 831, "start": 7377.0, "end": 7395.24, "text": "davon. Aber da kann ich nichts zu sagen da habe ich nie großartig großartig was mit"}, {"id": 832, "start": 7395.24, "end": 7410.96, "text": "gemacht. Aber ich würde sofort Unity verwenden weil es die Sharp unterstützt. Ist C++ in"}, {"id": 833, "start": 7410.96, "end": 7417.2, "text": "der Hinsicht vergleichbar. C ist in sich schlüssig C++ überhaupt nicht."}, {"id": 834, "start": 7417.2, "end": 7430.04, "text": "Java oder C Sharp ist eigentlich egal. Ich persönlich bin für C Sharp. C Sharp ist die"}, {"id": 835, "start": 7430.04, "end": 7434.84, "text": "schönere Sprache aber Java geht auch. Wenn ich unsere Java Programmierer auf der Arbeit"}, {"id": 836, "start": 7434.84, "end": 7438.88, "text": "sehe die wollen alle Kotlin verwenden und kriegen immer Anfände dafür dass sie den"}, {"id": 837, "start": 7438.88, "end": 7444.68, "text": "ganzen Projekt nicht richtig machen können. Oh ne Splatoon Musik. Ich muss skippen. Skipp"}, {"id": 838, "start": 7444.68, "end": 7462.0, "text": "ja also C Sharp ist die schönere Sprache. Kotlin soll wirklich nice sein was ich von"}, {"id": 839, "start": 7462.0, "end": 7466.88, "text": "den Leuten auf der Arbeit an Java programmieren kann. Ich habe hier ein paar Konferenztalks"}, {"id": 840, "start": 7466.88, "end": 7472.08, "text": "und so schon geguckt. Macht so einen Eindruck aus einer Mischung aus C Sharp Ruby und Swift"}, {"id": 841, "start": 7472.08, "end": 7478.52, "text": "so ein bisschen Kotlin aber wäre mir auf jeden Fall lieber als Java selbst. Dankeschön"}, {"id": 842, "start": 7478.52, "end": 7484.56, "text": "Unity für zwei Monate Subscription. Ne ne wie gesagt Game Programmierung ist wirklich"}, {"id": 843, "start": 7484.56, "end": 7489.0, "text": "was da habe ich gar keinen Zug dazu. Ich Theorie crafte und so übelst gerne in Games aber"}, {"id": 844, "start": 7489.0, "end": 7497.12, "text": "ich bin da wahrscheinlich auch viel zu unkreativ für irgendwelche Spiele zu machen. Heißen"}, {"id": 845, "start": 7497.12, "end": 7503.2, "text": "ist eine super Einsteiger Programmiersprache. Wofür wird Swift benutzt? iOS und Mac Anwendung."}, {"id": 846, "start": 7503.2, "end": 7510.88, "text": "Ich meine wenn eine Sache noch ähnlich schlimm wie C++ ist dann wahrscheinlich Objective"}, {"id": 847, "start": 7510.88, "end": 7518.56, "text": "C. Außer Apple hat ja niemand die Dreistigkeit besessen allen Ernstes jahrelang Objective"}, {"id": 848, "start": 7518.56, "end": 7524.8, "text": "C zu verwenden. Du bringst jetzt CSS bei für eine Webseite für die Jugend. Ja das ist"}, {"id": 849, "start": 7524.8, "end": 7528.6, "text": "auch ein guter Einstich. Du wirst früher oder später auf jeden Fall an ein bisschen"}, {"id": 850, "start": 7528.6, "end": 7535.08, "text": "Javascript nicht vorbeikommen. Bin ich mir ziemlich sicher. Und also der Grund warum"}, {"id": 851, "start": 7535.08, "end": 7542.16, "text": "ich immer sage Javascript ist die beste Einsteiger Programmiersprache. Du brauchst nichts außer"}, {"id": 852, "start": 7542.16, "end": 7547.6, "text": "einen Browser und du lernst wichtige Sachen was du früher oder später brauchst. Du kommst"}, {"id": 853, "start": 7547.6, "end": 7552.76, "text": "an Frontend Sachen heutzutage einfach nicht mehr vorbei. Bisschen Javascript bisschen"}, {"id": 854, "start": 7552.76, "end": 7558.6, "text": "hat er im L und CSS muss heutzutage jeder können. Er ist zwar übertrieben gesagt sogar"}, {"id": 855, "start": 7558.6, "end": 7563.8, "text": "ein Cobol Backend Programmierer. Wobei es da der wahrscheinlich noch am besten ohne"}, {"id": 856, "start": 7563.8, "end": 7575.68, "text": "klar kommt. Was Quatsch. Python hat mit C++ gar nichts zu tun. Ich weiß worauf du raus"}, {"id": 857, "start": 7575.68, "end": 7579.44, "text": "willst. Du willst darauf raus dass das Standard Python C++ programmiert ist aber das ist"}, {"id": 858, "start": 7579.44, "end": 7586.8, "text": "doch egal. Die Standard.NET Implementierung war auch in C++ mal ursprünglich. Who cares."}, {"id": 859, "start": 7586.8, "end": 7610.16, "text": "Die könnten auch in Rust oder in Cobol sein. Wär doch vollkommen egal. Ja ich bin auch"}, {"id": 860, "start": 7610.16, "end": 7618.48, "text": "nicht der große Css Kenner. Ich lerne jedes mal wenn ich Css benutze Neues dazu. Es gibt"}, {"id": 861, "start": 7618.48, "end": 7628.44, "text": "ja mittlerweile so ultra viele kryptische Selektorsachen in Css. Das ist mir zu big"}, {"id": 862, "start": 7628.44, "end": 7634.4, "text": "brain an vielen Stellen. Du kannst ja mittlerweile ganze Spiele quasi fast schon in Css Only"}, {"id": 863, "start": 7634.4, "end": 7641.52, "text": "gewinnen. Also simple Spiele. Ich glaube es gibt schon in 4 gewinnt. Only in Css und sowas."}, {"id": 864, "start": 7641.52, "end": 7646.04, "text": "Aber der geilste Typ war immer noch. Also das abgedrehteste was ich bisher gesehen habe"}, {"id": 865, "start": 7646.04, "end": 7654.16, "text": "ist von zweckentfremdeten Tools ist. Irgendjemand hat einen Hex zu Binary Converter in Ruby"}, {"id": 866, "start": 7654.16, "end": 7662.48, "text": "Regex programmiert. Also er hat wirklich rein in Regex einen Hex zu Binary Converter programmiert."}, {"id": 867, "start": 7662.48, "end": 7686.96, "text": "Das ist wirklich massive brain. Genau wir machen ab jetzt alle. Wir programmieren"}, {"id": 868, "start": 7686.96, "end": 7708.28, "text": "nur noch in Binary mit Hex Editor. Also die meistverbreitete IDE ist ja tatsächlich"}, {"id": 869, "start": 7708.28, "end": 7717.96, "text": "Excel wenn du es so willst. Ja es ist echt so. Excel ist die IDE der Sekretärin dieser"}, {"id": 870, "start": 7717.96, "end": 7744.52, "text": "Welt. Kenn ich nicht. Ja Moment das ist mit JavaScript. Das ist mit JavaScript. Das sind"}, {"id": 871, "start": 7744.52, "end": 7753.92, "text": "übrigens die Half Life 2 Texturen. Man kann übrigens nicht schießen. Das ist mit JavaScript"}, {"id": 872, "start": 7753.92, "end": 7760.0, "text": "hier klar. Das ist überhaupt kein Problem. Das funktioniert. Mit JavaScript kannst du"}, {"id": 873, "start": 7760.0, "end": 7769.76, "text": "viel machen. Ja guck dir mal ein Video dazu an was die beste Einsteigerprogrammiersprache"}, {"id": 874, "start": 7769.76, "end": 7782.76, "text": "ist. AC Dankeschön für den Sub. 3 Monate Big Brain Subscriptions hier. Flintstone 7"}, {"id": 875, "start": 7782.76, "end": 7791.68, "text": "Monate. Auf halbem Weg zum Hypersubscriber hier. Aber noch nur. Habt ihr eigentlich"}, {"id": 876, "start": 7791.68, "end": 7800.8, "text": "die GIF Emotes schon gesehen? Alle? Wir haben 2 GIF Emotes. Die ihr nur verwenden könnt"}, {"id": 877, "start": 7800.8, "end": 7806.0, "text": "als Primesub. Also wer noch nicht geprimesubbt hat jetzt ist die optimale Gelegenheit wenn"}, {"id": 878, "start": 7806.0, "end": 7810.32, "text": "euch der Content gefällt zu Primesubben. Und wenn ihr geprimesubbt habt ist natürlich schön"}, {"id": 879, "start": 7810.32, "end": 7814.04, "text": "dass ihr wieder am Start seid. Ich glaube jetzt habe ich es richtig gemacht in Sellout"}, {"id": 880, "start": 7814.04, "end": 7831.24, "text": "oder? Der war gut. Oh ne da wird wieder gesungen. Perfekt. Ja ok Leute. Das funktioniert. Danke"}, {"id": 881, "start": 7831.24, "end": 7850.64, "text": "für die Subs. Spore Sirius und UD YZ Dankeschön für euer Primesub. Exzellent Sellout. Ich"}, {"id": 882, "start": 7850.64, "end": 7855.68, "text": "habe letztens ein Tool gesehen. Das war ein Excel Plugin. Dass du echtes SQL und inline"}, {"id": 883, "start": 7855.68, "end": 7876.64, "text": "C-Sharp Programme in Excel programmieren kannst. 27. Add Subscribe. Primesub. Dankeschön."}, {"id": 884, "start": 7876.64, "end": 7885.12, "text": "Beste Sellout. Ja das hat hart funktioniert. Can't wait. Ok Leute ich bin durch. Es gibt"}, {"id": 885, "start": 7885.12, "end": 7888.36, "text": "nichts Neues mit Invisual Studio mehr was wir uns noch nicht schon angeguckt haben. Das"}, {"id": 886, "start": 7888.36, "end": 7896.72, "text": "ist ein sehr mageres Preview Release von Microsoft. Also hätten wir sich fast sparen können."}, {"id": 887, "start": 7896.72, "end": 7908.04, "text": "Wie fandet ihr die Intelli Code? Seid ihr auch der Meinung das ist Magic? Intelli war"}, {"id": 888, "start": 7908.04, "end": 7920.84, "text": "das auch Magic. Es ist ziemlich Maui. Es ist ziemlich Maui. Ja da hast du recht. Welches"}, {"id": 889, "start": 7920.84, "end": 7923.96, "text": "ist eigentlich das beste Liedungsjahr für was? Für Desktop, für Server, für sonst"}, {"id": 890, "start": 7923.96, "end": 7928.44, "text": "wie. Das kann man so pauschal nicht beantworten. Also ich habe am liebsten Ubuntu auf dem Server"}, {"id": 891, "start": 7928.44, "end": 7936.28, "text": "und Manjaro auf dem Desktop. Und das ganze aber auch in der VM. Weil ich habe als Host"}, {"id": 892, "start": 7936.28, "end": 7942.52, "text": "Windows und als vor allem Linux. Das ist für mich die beste Kombination aus beiden Welten."}, {"id": 893, "start": 7942.52, "end": 7947.32, "text": "Linux lässt sich auch super virtualisieren unter Windows. Im Gegensatz zu Windows unter"}, {"id": 894, "start": 7947.32, "end": 7969.8, "text": "Linux. Arch by the way. Ist noch schön. Wenn es dir gefällt ist Ziel erfüllt. Big Prane."}, {"id": 895, "start": 7969.8, "end": 7974.36, "text": "Die Streams dienen ja prinzipiell zur IQ Steigerung des Chats. Das sind wir uns ja einig. Ich"}, {"id": 896, "start": 7974.36, "end": 7978.28, "text": "meine belegt euch mal wie viele IQ Increases es hier schon gegeben hat. Die Leute haben"}, {"id": 897, "start": 7978.28, "end": 7984.52, "text": "alle schon Köpfe. Die sind schon doppelt so groß wie vorher. Und ist bei mir ja auch"}, {"id": 898, "start": 7984.52, "end": 7991.56, "text": "so. Ich lerne ja hier auch was dazwischen. Ich habe heute zum Beispiel. Ich habe es schon"}, {"id": 899, "start": 7991.56, "end": 7996.96, "text": "wieder vergessen aber ich habe irgendwas gelernt. Ich habe vorhin nämlich noch gesagt heute"}, {"id": 900, "start": 7996.96, "end": 8013.68, "text": "lerne ich wieder was. Achso Output. Console Output. UTF-8 Konsolen Output. Ja ist schon."}, {"id": 901, "start": 8013.68, "end": 8021.52, "text": "Ist schon. Das ist schon ein massiver Sixhead hier. Ist da Frasier eigentlich immer am Start?"}, {"id": 902, "start": 8021.52, "end": 8030.52, "text": "Haben wir irgend einen den wir hosten können? Lost ist auch nicht da. Frasier ist auch nicht"}, {"id": 903, "start": 8030.52, "end": 8048.6, "text": "da. Dann hoste ich niemanden. WubTube Champ. Ey heute nicht. Ist der on? Ist der on der"}, {"id": 904, "start": 8048.6, "end": 8059.64, "text": "WubTube Champ? Ey WubTube Champ ist off. Sieht jemand Science and Technology? Gucken wir mal"}, {"id": 905, "start": 8059.64, "end": 8075.28, "text": "Twitch. Was haben wir dazu bieten auf Twitch Science and Technology? Komm mal. Bam. React"}, {"id": 906, "start": 8075.28, "end": 8084.16, "text": "und TypeScript auf Spanisch. Oder was ist das für? Ist das Spanisch? Live Earthquake."}, {"id": 907, "start": 8084.16, "end": 8099.28, "text": "Live from space. Boah Poggers. Die NASA ist am Start. Ihr wisst ja. Die IES ist ja eigentlich"}, {"id": 908, "start": 8099.28, "end": 8106.48, "text": "unter Wasser und das sieht man bei den Aufnahmen immer, weil nebenbei da steigen Wasserblasen"}, {"id": 909, "start": 8106.48, "end": 8114.72, "text": "dran vorbei. Ihr müsst ja mal bei Außenaufnahmen dran warten. Ey das ist ernsthaft eine legit"}, {"id": 910, "start": 8114.72, "end": 8118.92, "text": "Verschwörungstheorie aktuell. Also ich hab das schon an vielen Stellen gelesen, dass"}, {"id": 911, "start": 8118.92, "end": 8126.2, "text": "die IES angeblich unter Wasser ist und man Wasserblasen sieht. Irgendwann überzeugen"}, {"id": 912, "start": 8126.2, "end": 8147.52, "text": "sie mich auch noch davon. Was programmiert sie? War? Input? Int? Ah. Go. Das ist Go."}, {"id": 913, "start": 8147.52, "end": 8168.08, "text": "Aus den Eulenstells. Der guckt Videos. Ich wollte gerade sagen, das ist doch der Veritasium"}, {"id": 914, "start": 8168.08, "end": 8177.88, "text": "Typ. Ich guck mir jetzt die NASA noch ein bisschen an, wenn ich auf gehe. Komm mal jetzt"}, {"id": 915, "start": 8177.88, "end": 8198.84, "text": "haben sie den eingepackt. SOS. Eject. Ok Leute. Wie immer gesagt, ich geh jetzt"}, {"id": 916, "start": 8198.84, "end": 8215.92, "text": "auf. Also wir sehen uns im nächsten Stream. Machts gut. See you."}]}