{"text": "So, da bin ich wieder, ach ja, ich sehe gerade, ich bin halt sogar relativ früh, normalerweisebin ich ja erst nach 10 on, 08.07.9 monat, huge subscriptions, langeschön für den sub.Also, was gucken wir uns denn heute an? Ist irgendwas passiert letzten Tage über, wo ichnoch mal einen Senf zu geben muss, bevor wir uns anfangen Videos anzuschauen? Ich weiß gar nicht,war noch irgendwas? Lass mal überlegen. Ja, dass die ganzen China Miner ihre Grafikkarten verkaufen,das habt ihr wahrscheinlich mitbekommen, ne? Die Chinesen, also die chinesischen,China-Chinesen haben ja Krypto-Mining verboten und jetzt verkaufen alle Chinesen ihre Grafikkarten.Aber es wird uns nichts bringen, weil die verkaufen das alle auf so einem chinesischen eBay,wo du die Sachen selbst abholen musst und sowas oder in China wohnen und das ist halt für unsrecht uninteressant. Ach ja, und was ich auch witzig fand, ist diese News hier. Warte mal,die muss ich euch gerade mal zeigen. Es hat auch letztens einer im Stream schon gepostet,aber jetzt kam das Behalse auch. Ups, warum geht das jetzt nicht? Warte mal. Hat wiederirgendeine E-Mail-Anhänge geöffnet bei einer Stadtverwaltung. Also ich könnte wetten,es hat wieder irgendeine E-Mail-Anhänge geöffnet. Ich frag mich immer, vor allem diese Bilder dabei,WTF, Alter. Ja, hab ich vor ein paar Tagen gelesen, also da weiß ich auch nicht,was die immer machen. Aber gut, ich mein, wenn man nur Faxgeräte gewohnt ist,kann sowas ja schon mal passieren. Ja, ihr wisst ja, dass eigentlich bis 2020 Deutschlandführend ist im Bereich von digitalen Ämtern und digitalen Behörden. Wusstet ihr das eigentlichschon, dass wir da führend sind? Also führend bedeutet jetzt aktuell gesehen, dass man dieSachen per Fax schickt, aber laut eigener Aussage unserer Chefs sind wir führend in dem Bereich.Ja, guck da, da hat er es gesagt. Bis 2021 ist Deutschland komplett digital, hat er 2017erzählt. Also mal ernsthaft, wer hätte das nicht geglaubt? Also ich war komplett felsenfest davonüberzeugt, das wird so kommen 2017. Genauso wie wir auch bis 2018 50 Mbit für alle Haushaltehaben, hätte ich auch nie daran gezweifelt, dass das passieren würde. Also es war mir klar,dass das es wird alles eintreten. Ist dumm geschwätzt immer. Aber ansonsten ist die Wocheglaube ich nicht allzu viel spannendes passiert. Ja, das stimmt voll, das stimmt voll. Was haltwitzig ist, gerade jetzt zu Corona Zeiten wäre das echt praktisch gewesen, wenn die ganzenÄmter digital ein bisschen besser aufgestellt wären und sich nicht irgendwelche Daten perFax, per Fax checken müssen. Ihr müsst euch das mal überlegen. Fax, Alter, Fax, das ist so alt,also die, oh warte, ich muss die Musik einen kleinen Tick klar sagen. Fax, das ist so alt,ich hab noch nicht mal mehr einen Fax, also ich hab noch nicht mal die Möglichkeit, Faxe zuempfangen bei mir. Ich hab theoretisch einen Multifunktionsdrucker, der glaube ich,ich bin mir gar nicht sicher, einen Anschluss hat für einen Fax, aber ich wüsste gar nicht,wo ich das reinstecken soll. Da müsste ich den Drucker irgendwie an die Fritzbox anschließenoder so. Wozu? Ich will überhaupt keine Faxe empfangen. Ja, das ist alles gelabert,sieht man ja jetzt auch immer schön. Es wird viel gelabert. Ihr wisst ja auch das. Moment,Moment, Leit, Moment, Deutschland, Spiele, Leitmarkt, soll das hier, ja, also Deutschlandsoll ja auch Leitmarkt für Computerspiele, also nicht wie Leiden, sondern wie Anführen,Leitmarkt soll Deutschland werden, was Computerspiele angeht. Ich weiß nicht,in welcher Fantasiewelt man sich da bewegt. Ja, aber es soll so sein, ja.Das stimmt nicht. Du kannst mittlerweile auch digital Sachen unterschreiben und das zählt.Sonst müsste ich ja jegliche NDA oder sonst was müsste ich per Fax an irgendeinen Herstellerschicken oder so. Du kannst das mittlerweile auch schon digital unterschreiben, das funktioniert.Telefonanschluss. Ja, theoretisch bräuchte, also du brauchst eine Telefonnummer, du brauchsteine Telefonnummer. Es geht aber auch über VoIP, wenn das der Anbieter richtig macht.Also wenn der Anbieter, Telekom und Vodafone, die haben ja nur Voice-Over-IP, die haben jaauch gar kein richtiges Telefon mehr. Ich glaube, die Telekom bietet dir immer noch,wenn du nur einen analogen Anschluss haben willst, machen die das immer noch. Aber spätestens ab demnächsten Telekom, krass, ist es VoIP intern. Ja, das funktioniert, aber wozu Fax? Fax isthalt echt Pains-Champ. Gut, wenn du keine Telefonnummer hast, dann ist das natürlich mit Fax nichts.Um nochmal den Rap-God aus meinem Arbeitsamtkurs von damals zu zitieren, machst du Faxen,mache ich dich mit Achsen. Dann kriegt das Wort Fax mal ganz neue Bedeutung.Welches deiner Repos ist eigentlich der Preis-Champ? Der Preis-Champ ist nirgendswo auf GitHub. Dengibt's nicht. Der Preis-Champ ist closed source, Leute. Dass ich das maximal monetarisieren kann,nur dass ich überhaupt kein Geld dafür bezahle. Kein Geld dafür bekomme. Bezahlen tue ich dafür,aber ich bekomme kein Geld dafür. Ja, das mit der Trans 3070 unter 80,das ist das Problem, dass der Crawler die Shops unterstützen muss und da haben dieimmer Probleme, deutsche Shops zu unterstützen. Vielleicht gibt es das auch mittlerweile.Was ich auch lustig finde, dass sie gerade den deutschen Computerspielepreis hervorheben,das finde ich immer wieder lächerlich. Der deutsche Computerspielepreis ist eines derunwichtigsten, unbedeutendsten und peinlichsten Veranstaltungen, die wir so zu bieten haben.Es ist an heißer Luft kaum noch zu überbieten. Ich habe mich an letztes Jahr auch schon maldarüber ausgelassen, aber wisst ihr, was bestes Multiplayer-Game ist laut dem deutschenComputerspielepreis? Das beste Multiplayer-Game laut dem deutschen Computerspielepreis isteine Nintendo Game, was den Fortschritt verliert, wenn jemand online aus der Session droppt.Es ist wie um alles in der Welt kann Animal Crossing bestes Online-Game sein. Dann hättensie ja meinetwegen lieber Warzone oder irgendetwas ernstzunehmendes Online-Game, was 2020 rauskam,nehmen sollen. Zu Zeiten als Crysis da was bekommen hat, war das in Ordnung, da hattenwir auch was. Was gibt es aktuell für Games aus Deutschland? Anno war mal aus Deutschland,ich weiß nicht, ob Anno noch aus Deutschland ist. Crytek gibt es immer noch, die machenaber gerade ja nur Dings hier, dieses Wild West Ding, Hunt Showdown oder so. Ansonstenwüsste ich nicht, was Crytek Moba aus dem ist nie was geworden. Ansonsten was gibt esdenn noch für größere deutsche Studios? Wir haben dazu nicht mal einen deutschen Artikelauf Wikipedia und der internationale Artikel über die Video-Games-Industrie in Deutschlandist schon ziemlich... Es stimmt, die Gothic-Leute haben wir noch, aber da weiß ich nicht, obsie überhaupt noch gibt. Ach doch, die haben LX gemacht letztens. Ich weiß aber nicht,ob die noch in Deutschland am Start sind. Ok, Games Publisher, Games Developer of Germany,ok, wen haben wir da? Ubisoft Blue Bay, das sind die Siedler-Leute, genau, Ubisoft Berlin,ok, ich wusste nicht, dass sie mit an Far Cry machen. Crysis, das wussten wir. Ach hier,die Adventure-Stells-Kram, genau. Sagt mir jetzt gerade nichts, aber das ist auch ehernicht so meine Lords of the Fallen, war das nicht so ein Dark Souls-Klon? Ja doch, icherinnere mich wieder. Stimmt, die gibt es auch noch, die habe ich jetzt verwechselt.Die gibt es auch noch, die hatten aber glaube ich nie bisher so den Riesenhit. Die Gothic-Leutegibt es, genau, die gibt es immer noch. Stimmt, die gibt es auch noch, die habe ich jetztgar nicht. Was haben die in letzter Zeit so gemacht? Nix. Ok, also es hält sich durchausin Grenzen. Das war gar nicht so schlecht, das habe ich auch nicht gesagt. Kann michnur dran erinnern, dass das der Dark Souls, man kann es ja nicht Dark Souls, na doch, mankann es so ein bisschen Dark Souls-Klon nennen. Also das sehr stark Dark Souls inspirierteGame. Das ist auch so eine Redewendung, die mich ja immer nervt. Sobald ein Spiel nichteasy as fuck ist, ist es sofort Dark Souls. Keine Ahnung, irgendeiner baut einen Jumpand Run, was nicht easy as fuck ist. Und dann kommen dann die ersten an, das Dark Soulsder Jump and Runs. Da kriege ich ja auch immer richtig Cringe-Anfälle. Das ist so ausgelutscht,diese Redewendung mittlerweile. Die ist glaube ich so ausgelutscht, dass sie noch nicht malComputerbild-Spiele. Gibt es überhaupt noch Computerbild-Spiele verwendet? Oh, gibt esja noch Computerbild-Spiele. Tatsächlich, nee, gibt es die noch? Jetzt lesen immer nocheine Million Leute. Okay, ja, Computerbild-Spiele gibt es noch. Was, ich muss jetzt gerade nochwas anderes gucken. Twitch. Ich muss mal kurz gucken, was auf Twitch gerade angesagt ist.Spielen die Leute noch Souls-Games? Aber warum sieht denn die Twitch-Seite so komisch ausauf einmal? Kann ich mir nicht einfach anzeigen lassen, was die meisten gesehene Spiele sind?War das nicht sonst immer auf der Startseite, sodass man einfach die meist gesehene Spielehat? Ah, hier. LOL ist wieder vorne GTA. Warum ist denn Valorant auf einmal so weit oben?Läuft da gerade irgendwas? Ah, da läuft irgendeine E-Sport-Stells hier. Koreanisches E-Sport-Stells.Okay, weil ansonsten ist Valorant zwar gut dabei, aber nicht ganz vorne mit dabei. Apexnormalerweise auch nicht ganz ganz oben. Okay, da ist ein Stream allein schon mit 22k, allesklar. Die Fortnite immer noch dabei. Was ich immer erstaunlich finde, dass ich, obwohldie Leute immer sagen wollten, World of Warcraft übelst Dead, Dead und Rip, Woe und so, dasscheint immer noch ganz gut zu laufen. Gut, ich meine, irgendwo muss Blizzard ja auch Geldverdienen und Woe ist halt gerade mit Abo-Modell so eine schöne Einnahmequelle, wo man weiß,das fällt nicht von heute auf morgen weg. Der Scam Train ist am Start. Sorry, dankeLeute für die ganzen Subs. Ich muss mal kurz nachgucken, wer jetzt eigentlich alles amStart ist. Game Up, Dankeschön für den Prime-Sub. 14 Monate, das ist ja schon Massive Hyper-Subscriptionhier. Der Eichler ist am Start, 23 Monate schon. Dann haben wir Slim Beats ist am Start undder Max, den hatten wir schon. Nice Leute, dass ihr alle wieder da seid und natürlichfür den Point, dass ihr beim Scam Train mitmacht. Schön, dass euch Twitch gebaitet hat, wiedereure Prime-Sub auszugeben. 18 Anzeige ist raus, Chain-Lore. Dis-Abo. Nee, Woe ist Monats-Abo,das ist nicht eine kleine Usergruppe. Woe hat ziemlich viele Spieler immer noch. Ichmeine, ich veröffentliche keine Spielerzahlen mehr, aber du kannst davon ausgehen, das istjetzt nicht innerhalb von ein paar Jahren von 9 Millionen auf 5000 gedroppt oder so.Also, ich habe keine Ahnung, wie viele Spieler Woe noch hat, aber es ist bestimmt ordentlichund selbst wenn man mal ganz, ganz klein stapelt und sagen, keine Ahnung, die haben nur noch500.000 Spieler, was wahrscheinlich viel zu wenig ist, die haben bestimmt noch deutlichmehr und allein schon das gibt ja 5 Millionen im Monat, wenn die nur 10 Euro bezahlen undes sind wahrscheinlich deutlich, deutlich mehr. Woe ist schon ordentlich. Was mich beiWoe, ich habe es nie richtig großartig gespielt, muss ich sagen, ich habe andere MMOs zwardurchgesuchtet, aber Woe habe ich nie so richtig reingefunden. Natürlich habe ich ein bisschengespielt, aber nie wirklich großartig. Was mich an Woe so vom Beobachten ein bisschennervt, ist, dass die wirklich versuchen, alles Mögliche zu monetarisieren. Also, die habenja wirklich alles monetarisiert, was geht und das finde ich übrigens nicht gut, weilich bin der Meinung, gerade Spiele, ich propagiere ja selbst immer, ich sage, für MMOs ist eigentlichdas beste Modell monatlicher Subscription oder meinetwegen Pay to Play, also man kauftein Spiel, man kauft ein Addon und kann ja so viel spielen, aber ich sage immer, MonthlySubscription, Monthly Fee ist so das beste für MMOs, allerdings nicht, wenn du dannalles andere auch noch dazu machst. Was Addons? Natürlich sind Addons von Blizzard. Ich meinenicht, ich meine jetzt nicht irgendwelche UI Addons, ich meine sowas wie, keine Ahnung,was war das letzte Woe Addon, was rausgekommen ist? Shadowlands. Das musst du immer nochkaufen oder? Da reicht keine monatliche Gebühr. Du bezahlst Monatgebühr, du musst Addonskaufen und dann hast du noch ein Microtransaction Store. Also die monetarisieren wirklich alles,was irgendwie geht. Das finde ich auch leicht leicht übertrieben bei Blizzard, zumindestbei WoW. Fazit zu Nextcloud 22, ja es hat sich in einigen Bereichen verbessert, dieApps sind immer noch ziemlich basic und ich werde wahrscheinlich kein großer NextcloudFan werden. Genau, genau, die Kombination verstehe ich, das war ja eigentlich früherauch normal. Du hattest den MMO, das hat monatlich gekostet, ok, da kannst du sagen, ja die monatlichenKosten ist halt super für den Entwickler, der kann seine Leute bezahlen, der kann seinenSupport bezahlen, der kann seine Admins bezahlen, seine Entwickler bezahlen, Serverkosten bezahlenund das Spiel quasi pflegen, erweitern, sonst wie. Und dann setzt man sich halt auch nebenbeinoch ran mit einem eigenen Team und macht eine Expansion, die man verkauft, wie einextra Game. Das verstehe ich, das finde ich auch in Ordnung, was ich aber auch richtigassi finde, ist, dass du dann noch anfängst mit irgendwelchen Microtransactions. Levelboostübrigens, das in Kombination, das ist ein absolutes Unding. Plan ist heute, wir gucken,was wir immer sonntags morgens machen, ich schwätze ein bisschen, wir gucken Videos dabei,das ist ein absolutes Unding. Gerade Levelboosts, also wenn man ein Pay2play mit Subscription-Modellhat, dann musst du, aus meiner Sicht ist das Spiel sonst nicht spielenswert, dann musstdu sicherstellen, dass das Spiel so designt ist und so optimiert ist, dass es darauf ausgelegtist, dass du ohne zusätzliche Hilfe die Dinger in-Game erreichen kannst mit dem nötigenEinsatz-Zeitaufwand, wie die Spiele-Designer sich das gedacht haben. Das heißt, wenn mansagt, okay, jeder der die Monatsgebühr bezahlt, sollte in-Game die gleichen Möglichkeitenhaben und die gleichen Chancen haben und nicht noch zusätzlich durch Microtransactionsden ganzen Kram boosten lassen, weil sonst stellst du das ganze Modell irgendwie, ichweiß, es ist ja offensichtlich, dass es funktioniert, also sonst stellt sich aus meiner Sicht dieFrage, warum überhaupt? Das finde ich halt kacke. Und gerade bei WoW Classic, wo ja sodie Oldschool Experience im Vordergrund stehen soll, mit Leveln und Social Aspekt ist esjetzt natürlich noch doppelt bescheuert, ein Levelboost zu machen. Also ich kann nichtvon World of Warcraft reden, ich kann bloß zum Beispiel von Dark Age of Camelot reden,was ich hier über 10 Jahre gespielt habe. Die GMs, die wurden beschissen bezahlt, dasweiß man mittlerweile, die wurden beschissen bezahlt, der Europa Publisher war ein richtiggroßer Kacklan, aber die GMs haben sich abends von daheim oder nachts von daheim teilweiseeingeloggt und ich weiß nicht, ob die das jemals bezahlt bekommen haben, hoffe ich malzumindest, eingeloggt, um Leute aus einem verbacken Dungeon rauszuteleportieren undsowas. Zumindest da kann ich sagen, es gibt schon GMs mit Leib und Seele, die wirklichzum umfallen Game Mastern sind. 27 Monate, Huge Subscription hier, IQ++++++ für denChat. Der Scamtrain ist auf Level 2, Leute, wir haben noch eine Minute Zeit den Scamtrainvoll zu machen. Wenn der Scamtrain voll ist, dann fangen wir auch an Videos zu gucken undich laber euch nicht weiter voll, wobei vielleicht sind die Leute auch gerade da, man weiß nicht.Ja, finde ich nicht gut. Auch als Spieler finde ich den Story in Game nicht, was? DenStore meinst du wahrscheinlich, ne? Du hast dir das Problem ja schon selbst beantwortet.Das ist eines der Probleme, die dadurch auftreten. Ja gut, dass es Mounts, Pets und Kosmetik-Shitgibt, finde ich auch schlimm, weil Character, man muss mal überlegen, was so ein MMO mitausmacht. Character Customization ist eines der zentralen, oder, oder, so, Character Upgradeund Customization ist eines der zentralen Punkte eines MMOs. Wenn ich mir das kaufenkann, stelle ich quasi in Frage, warum mache ich den Content überhaupt? Warum soll ichden Content machen, wenn ich mir das Mountain im Shop kaufen kann? Warum soll ich einenhalben Monat grinden für einen One-Time-Event-Mount, wenn ich mir das Mountain ein halbes Jahr späterauch für 5 Euro oder, na gut, es sind Blizzard-Preise, für 20 Euro im Shop kaufen kann? Das istlächerlich. Der Kram, der muss, wenn das Monthly-Fee ist und wenn das Pay-to-Play ist,dann muss das mit dem gleichen Ingame-Aufwand für alle Leute verbunden sein, ohne Abkürzungdurch den Shop. Und wenn ich eben nur 37-jähriger Boomer bin, der arbeiten gehen muss, Familiehat und nur eine Stunde am Tag oder, keine Ahnung, nur mal 4 Stunden am Wochenende spielenkann, dann muss ich halt damit leben, dass ich nicht in High-End-Tierrüstung in derHauptstadt rumposen kann. Dann habe ich halt Pech. Dann können halt, keine Ahnung, 20-jährigeHarzer, die den ganzen Tag 24-7 grinden, haben dann halt In-Game-Mehr. So ist es halt. Aberso muss das auch sein. So, das ist meine Meinung dazu. Bounty 20, danke schön für den Prime-Sub.Übrigens, bei Blizzard, die haben ja noch deutlich mehr verkackt. Könnt ihr euch noch,wie gesagt, ich bin bei World of Warcraft nur so stiller an der Seitenlinie, Verfolger,könnt ihr euch noch an dieses World of Warcraft-Turnier erinnern, wo die Community technisch Geldgesammelt haben und haben gesagt, hey, wir machen jetzt einen Shop für, keine Ahnung,Mounts, sonst wie was und ein Teil davon geht an so einen Community oder BlizzCon war dassogar, so ein BlizzCon PvP-Turnier und dass wir quasi die Turnierpreise erhöhen können.Kann sich da noch jemand dran erinnern? Und wo alle davon ausgegangen sind, ja, okay,man supportet quasi jetzt mit Shopkäufen das nächste BlizzCon PvP-Turnier, aber Blizzardbezahlt auch noch ihre normales Preisgeld. So, die Leute haben wie verrückt im Shop eingekauft,ich hoffe, ich gebe das jetzt halbwegs korrekt wieder, das ist schon ein paar Jahre her,und dann hat Blizzard gesagt zur BlizzCon, ach ja gut, wir haben ja jetzt so viel Geldeingesammelt durch die Shop-Verkäufe, wir geben kein normales Preisgeld mehr, muss ichdas mal auf der Zunge zergehen lassen. Ein PvP-Turnier von ihrem Game auf ihrer hauseigenenMesse bekommt kein Preisgeld von Blizzard selbst für die Gewinner. Was ist denn dasfür lächerliche Aktion? Und das, ja. Willst du den Chat verkaufen? Warum nicht? Der Chatist so high IQ, da könnte man eigentlich mal zu Geld machen. Was macht der 3D-Druckermit? Der ist aus. Ja, das ist ja noch schlimmer. Das ist ja noch dümmer. Dass du exklusivePaywall-Geschichten hast, das ist ja noch schlimmer. Wenn ich Monthly-Fee bezahle plus Pay-to-Play-Add-on,dann sollte ich eben auch Zugriff haben durch Spielen auf alles, was das Game zu bietenhat. Ja, richtig. Die sind selber daran schuld, dass WoW auf dem absteigenden Ast ist. Mankann davon abgehen und wenn jetzt jemand sagt, World of Warcraft ist nicht auf dem absteigendenAst, das kann man ja sehen, wie man will, aber allein schon der Fakt, dass Blizzardvor ein paar Jahren aufgehört hat, Spielerzahlen zu veröffentlichen. Also immer, immer, wennein Unternehmen, das vorher Spielerzahlen veröffentlicht hat, auf einmal aus irgendwelchenfadenscheinlichen Gründen sagt, sie veröffentlichen keine Spielerzahlen mehr, da hat das immerdamit was zu tun, dass die Zahlen nicht so geil aussehen, wie man das gerne hätte oderwie man da irgendwelchen Investoren Dollarzeichen in die Augen bringen kann. Immer. Das heißt,du kannst davon ausgehen, sobald irgendjemand Zahlen veröffentlicht, die immer nach obengehen und sich feiert und auf einmal sagt er, ich veröffentliche keine Zahlen mehr,dann kannst du so sicher wie das Arme in der Kirche davon ausgehen, dass die Zahlen aktuellnicht mehr stonksen, sondern noch stonk sind. Dota kenne ich mich nicht aus. Aber Dota hatauch keine monatliche Gebühr. Ja hat der Chat doch. Also ich bin mir sicher, der Chatwar sicherlich maßgeblich am Amazon Basic Corona Impfstoff beteiligt. Es ist noch nicht,es kommt demnächst. Kennst du dich mit Frauen aus? Ja, wir sind ja bekannt dafür, dass alsogerade der Chat, so hier der Chat aus 24 sieben Hacker-Man Informatiker Leuten, das ist natürlichbekannt für, dass wir hier Next Level Dating Tipps immer raushauen. Wo ist denn der Sebaro,der kennt sich aus? Den brauchen wir jetzt. Schaust du eigentlich Serien oder so, wennja, was? Ja, ja, äh, lass mal überlegen, was habe ich zuletzt geguckt? Ähm, fuck,also nicht so oft, aber was habe ich zuletzt geguckt? Ich muss mich immer wieder an Mr.Robot erinnern, wo ich die erste halbe Staffel mega geil fand und danach kacke. Upload, Uploadhabe ich geguckt, ja, fand ich eigentlich ganz cool, auch wenn es am Ende die letztenpaar Folgen wieder nachgelassen hat. Ich überlege gerade, was war denn das letzte an Serie,was ich geguckt habe, also das letzte neue. Ich gucke mal kurz, ich gucke mal kurz Amazon,Zack, Zack, Amazon, your orders. Moment, Moment, Watch. Amazon Prime Video. Bist du dir diezweite Witcher Staffel anschauen? Wahrscheinlich, auch wenn ich die erste Witcher Staffel nurokay fand. Okay, aha, hier, also Serious, Originals, Alter, warum ist eigentlich dieAmazon Video App mittlerweile so unübersichtlich? Wo zum Teufel sind Originals? Warum kann manda nicht mal nach Serien filmen? Das ging doch immer. Verwirrend. Was machen die dennmit der App? Was ich immer mal wieder gucke, ein paar Folgen, ist Dr. House, aber das istja nicht wirklich neu. Ich kann es euch nicht sagen, weil die Amazon Video App ist einfachkacke. Heck wait. Ja, doch nicht. Dann nicht. So, fangen wir mal an. Gucken wir mal einpaar YouTube Videos. Ja, also das Amazon. Wisst ihr, was ich auch richtig Müll finde?Amazon. Wie heißt das Music Web Player? Ich muss ja mal einen Screenshot von raussuchen.Gibt es da einen schönen Screenshot von? Ja. Nee, nicht wirklich. Die haben es eherdoch hier. Also, die haben es geschafft bei Amazon. Nee, das ist nicht das Neue. Das istirgendeine Mac-Geschichte. Zumindest, die haben es ernsthaft geschafft, dass man, man kannhier unten normalerweise die Lautstärke regeln bei Amazon Video und die haben es ernsthaftgeschafft, einen Musik Player zu machen, wo man die Lautstärke nicht richtig regelnkann. Das ist bescheuert. Normalerweise ist noch jemand ein Knopf, um die Lautstärkezu regeln. Egal, wer es kennt, kennt das UI. Die haben wirklich geschafft, einen Playerzu machen, wo man die Lautstärke nicht richtig regeln kann. Es hat zwar einen Knopf, um dieLautstärke zu regeln, aber du kannst die Lautstärke nicht in Prozent korrekt regeln. Du kannstsie immer nur so in 10, in 10 Prozent Schritten regeln. Das heißt, die Musik ist entwederzu laut oder zu leise. Ich weiß nicht, ob da irgendeiner bei Amazon da gesessen hat,hat sich gedacht. Ach nee, ach nee. Also, das ist ja, das ist ja User nicht zuzumuten.Die User sind bestimmt zu dumm, die Lautstärke richtig einzustellen. Den müssen wir das abnehmenund machen die Lautstärke jetzt nur noch in 10er Schritten. Dann hast du das Problem,dass du deine Playlist nicht mehr richtig sortieren kannst. Also geht schon, aber isteklig im Vergleich zu früher. Also es ist keine Ahnung. Ich habe keine Ahnung, was dieganzen UI Designer eigentlich machen, alle. Leuchtet mir nicht ein. Chinesische Minerverkaufen Grafikkarten zu Sportpreisen habe ich ja gerade gesagt. Das ist zurzeit. Wennman in China wohnt, ist es eine super Gelegenheit, eine Grafikkarte zu bekommen. Ja, das Netflixso alles besser, aber ich macht es immer so. Ich habe halt Prime und ich habe mal diesePrime Video Geschichte mal dazu geholt. Netflix gucke ich mir immer nur. Netflix mache ichmir immer in den Test, aber wenn ich mal was gucken will, die die Witcher Serie habe ichauch im Test aber geguckt. Wenn ich das nächste Mal wieder was auf Netflix gucken will, macheich mir einfach nur wieder den Test aber überhaupt kein Problem funktioniert.Ja, das stimmt. Wobei das vom Konzept her gar nicht mal so weit an der Realität vorbeigeht,wenn man sich ein bisschen weiter denkt in ein paar Jahren. Natürlich das, was ich dadrin gezeigt habe, war natürlich eher nicht realistisch. Alexa kann auch nur in Zehnerschritten. Ja, da haben die sich gedacht, wenn Alexa das nur in Zehner schritten kann, dannbrauche ich brauche ich das in einem Web Player mit Maus und Tastatur Bedienung auch. Wie,es gibt keine Test Abos mehr? Kann doch nicht sein. Wie gesagt, letzte Witcher Serie habeich im Test aber geguckt. Es gibt keine Test Abos mehr. Was soll das? Anzeige ist raus.Es gibt keine Tests, das ist aber kacke. Ansonsten bezahle ich es einen Monat, ja. Also wie gesagt,die letzte Witcher Serie habe ich über den Test aber geguckt. Wie machst du das mit derTelefonnummer? Ja, tja. Wird nicht verraten. Also kennst du die Programmiersprache OpenEdge Abel? Open Edge Abel, ne, kenne ich nicht. Oh, zeige ich mal her. Hat da einer schlechtgeschlafen und von Pascal geträumt oder was? Was gibt das, wenn es fertig ist? Damit machstdu Big Stonks? Ich weiß ja nicht. Und warum sollte man das verwenden? Ne, kenne ich nicht.Ich wüsste auch nicht, wofür das. Stonks, keine Ahnung. Ja, so kann ich das vorstellen.Ja, feelsBatman. So, schauen wir uns mal an. Was gucken wir uns denn auf YouTube jetzt an?Komm, wir lassen uns als erstes mal wieder von Levelcap gebaden. Das muss jetzt sein.Der wöchentliche Levelcap gebate. Ja, das habe ich mitbekommen. Das mit den Cheats habeich mitbekommen, da wollte ich auch ein Video drüber machen. Ja. Das ist ein Video, dasist ein Video. Das ist eigentlich eine gute Idee und ich wundere mich, dass das nicht früherschon jemand gemacht hat. Der Vorteil davon ist, also falls es jetzt zu schnell war, icherkläre nochmal kurz, wie das funktioniert. Also, du greifst den Video-Output mit irgendeinerCapture Card ab, dann hast du auf deinem PC eine Software, die das ganze Bild analysiert,wo sind Gegner und daraus errechnet ist Controller-Bewegung und den Controller-Input schickst du dannwieder an die Konsole. Also, es ist für die Konsole nicht sichtbar, dass du, dass dasnicht du bist, sondern irgendwie eine Software gesteuert ist. Das ist eigentlich ziemlichbig brain, die Idee, ist jetzt aber auch jetzt nichts bahnbrechend neues, deswegen wundertes mich, dass man noch nicht auf die Idee gekommen ist, vorher das zu machen. Und dascoole daran ist, dass du theoretisch das erweitern kannst auf jedes Spiel. Du musst halt nurdie passende AI anbieten dafür oder trainieren. Also, nur in Anführungsstrichen. Also, einfachist das nicht. Aber du kannst das theoretisch erweitern für jedes Spiel. Das heißt, dukannst Cheats basteln für Call of Duty, für GTA, für alles mögliche. Und das alles mitder gleichen Software. Moin. Also, das ist schon wirklich next level big brain, der Kram.Ohne Scheiß. Zumindest, es ist nicht zu erkennen für die Konsole, weil es läuft ja nix. Also,es ist weder 5, also ne. Wenn du, normalerweise hast du zwei Möglichkeiten, Cheats zu erkennen.Es ist weder, du erkennst, dass der, also du erkennst den Cheat direkt, dass der läuft.Sagen wir mal, du cheats den Battlefield oder Counter Strike oder sonst wie und Steam gucktim Hintergrund, läuft irgendwie ein Programm, läuft Programm mit spezieller Signatur, wasauch immer. Das heißt, du weißt direkt nach dem Spieler, dass der den Cheat gerade ausführt.Oder, dass irgendwas auf sich in dein Game rein gehuckt hat oder was auch immer. Also,sprich, du weißt den Cheat direkt nach, das ist natürlich die beste Variante. Da kannstnämlich direkt sagen, easy life, ban. So, die nächste Variante ist, bei solchen Cheats,die sind ja nicht zu erkennen. Also, du kannst ja solche Cheats auf der Konsole nicht erkennen,weil auf der Konsole selbst nichts läuft, was irgendwie Anhaltspunkte bieten wird, dassgecheatet wird. Also, die Konsole, die gibt das Bild aus und bekommt Controller Input.Die Konsole bekommt absolut gar nichts, gar nichts mit davon. So, was du jetzt aber machenkannst, du kannst das Ganze natürlich indirekt nachweisen. Zum Beispiel über Statistik.Wie schnell ist der Typ on target? Wie genau ist er on target? Was ist seine Hitrate imVergleich zu den besten Spielern der Welt? Kannst du verschiedene Sachen machen. Daraufkannst du natürlich wieder deine eigene Anti-Cheat-AI trainieren, was dann im Endeffekt daraufrausläuft, dass Cheat-AI versus Anti-Cheat-AI am Start ist. Und das wird noch witzig, aberdirekt nachweisen kannst du es nicht. Ich muss mal kurz die Musik wieder ausmachen.In Rainbow Six, was? In Rainbow Six werden mittlerweile Spieler wegen einer zu hohenHeadshotrate gebannt, ob sie cheaten oder nicht. Ja, das ist leider die Früchte, die das Ganzeso trägt. Sobald du den Kram nicht mehr direkt nachweisen kannst, wird es halt immer mehrfalse positives geben. Also, du wirst halt immer mehr Leute bannen, weil sie halt einezu gute Statistik haben. Deswegen ist das, das ist ein echt schwieriges Gebiet undich glaube aber, dass das die nächsten Jahre über besser wird. Ich glaube, dass umso besserdas trainiert wird, umso mehr Entwicklung da reinfließt, umso besser wird das Ganze,aber es wird nie perfekt werden. Ich meine am besten ist halt, wenn du den Cheat direktnachweisen kannst, aber das wird bei sowas halt nicht funktionieren.Einfach die Cheat-AI anhand von Pro-Playern trainieren, um legit zu wirken. So einfachist das nicht. So einfach ist das nicht. Du kannst jetzt so eine Cheat-AI nicht programmierenzu spielen wie ein Pro-Player. Du kannst sie vielleicht trainieren, die Geschwindigkeitim Aim oder in irgendeiner Art und Weise von einem Pro-Player nachzuahmen, aber ein Pro-Playerhat ja noch andere Sachen. Also, was er denkt während dem Game. Also, das so zu trainierenwird schwierig. Das siehst du zum Beispiel auch daran. Es gibt ja mittlerweile Leagueof Legend-Bots, wo auch sogar Pro-Gamer sagen, dass es saumäßig schwierig ist, dagegenzu spielen und fast nicht mehr möglich ist zu gewinnen, aber die AI spielt halt nullwie andere Pro-Player. Die spielt komplett anders und jeder Pro kann dir quasi sagen,das ist eine AI, die da spielt und sie können trotzdem nicht dagegen gewinnen.Nein, ich meine nicht Skript. Ich meine nicht Skript. Es gab mal so einen Versuch, dassman wirklich, ich glaube, ich weiß nicht, ob es von Google war. Es gab wirklich einenLOL-AI-Bot im größeren Stil. Es kann auch sein, dass es in Dota war, wo man wirklichtrainiert hat, den Bot spielen zu lassen. Jetzt nicht ein Spiel mit einem Spieler zuunterstützen, mit irgendwelchen Auto-Bytes oder was auch immer, sondern dass es wirklichautonom spielt mit dem, was ihm das Spiel liefert. Eine Starcraft-AI, die gab es auch.Die gab es auch. Da weiß ich aber nicht, wie gut die war. Die hat wahrscheinlich auchalles geoutet. Nein, aber es gab auch eine LOL-Geschichte. Oder was? Starcraft? Nein,ich glaube, es war LOL. Und die Pro-Player haben dazu gesagt, dass sie sofort erkannthaben, was die AI ist und was nicht. Oder Dota. Die Dota-Spieler haben sofort erkannt,was AI ist und was nicht. Aber sie hatten quasi keine Chance zu gewinnen. Das Dingist halt von den Mechanics her absolut perfekt. Ich kenne mich mit LOL und Dota nicht so gutaus, aber ich weiß, dass es da irgendwelche so High-Level-Mechaniken gibt, so nach demMotto, irgendwelche Animationen canceln, links-rechts-steppen, dass dann Boomerang schneller zurückkommtund solche Dinge. Also da gibt es jede Menge Moves, die du quasi als Pro ausführst, währenddu das Spiel normal spielst, dass du aber selbst auf absolutem Pro-Level nicht perfekthinkriegst. Also du lässt dann immer mal, triffst du den richtigen Frame fürs Animation-Cancelingnicht oder was auch immer. Und das Problem hast du halt als AI nicht. Der spielt seinenCharacter Mechanic-technisch hundertprozentig einfach perfekt. Das ist das, was du als Pronicht hinkriegst. Und selbst wenn du vielleicht die Big Brain Moves machen könntest, istdas Ding dir economy-mäßig schon immer ein Stück dann voraus. Also es ist halt, es isthalt ein komplett anderes Spiel, als wenn das jetzt irgendein Mensch wäre, der da spielenwürde. Und trotz, also die Pros können dir sofort sagen, ob das eine AI ist oder nicht.Zumindest stand das damals in dem Artikel drin, dass die Pro gesagt haben, sie könnensofort erkennen, dass das eine AI ist, aber sie konnten halt nicht gewinnen dagegen. Oderwas weiß ich, 1 vor 10 Games oder so. So, guck mal, vid weiter. Es gibt ja auch den,es gibt ja auch diesen Hack, sorry, das ist schon wieder unabbrechend. Es gibt ja auchdiese Geschichte mit, dass man das am PC probiert. Weiß ich, ob ihr das mitbekommen habt, dasses ein, Moment, dass es letztens ein Cheatsystem gab für ein PC, der Maus und Tastatur Inputssimuliert hat. Und die haben das folgendermaßen gemacht, die haben eine PCI Express Karteeingebaut in den Rechner. PCI Express Karten, Hardware, hat Zugriff auf einen Arbeitsspeicher.Und das haben die getan, glaube ich, als Netzwerkkarte, obwohl es gar keine Netzwerkkartewar. Also, die haben eine PCI Express Hardware Karte eingebaut, die Zugriff auf den Arbeitsspeicherhatte. Die hat quasi den Arbeitsspeicher gescannt, geguckt, wo die wichtigen Daten von den Gamesstehen. Das Game hat das nicht gemerkt, weil halt nichts an Software auf dem Rechner läuft,sondern dass halt eine Hardware Karte als Netzwerkkarte getarnt war. Die hat den RAMausgelesen vom Game, hat dann die wichtigen Daten extrahiert, an einen Microcontrollergeschickt und der Microcontroller hat dann Maus und Tastatur bedient. Das war quasi einnicht wirklich erkennbarer Cheat auf dem PC, weil du es nicht direkt nachweisen kannstin Form von, ich erkenne eine Software, ich kenne einen Cheat, der im Hintergrund läuft.Sowas kannst du nur nachweisen über irgendwelche Statistiken oder sowas. Also du kannst esnicht mehr direkt nachweisen. Mittlerweile, man könnte natürlich sagen, ja gut, warumhaben die nicht die Hardware im Rechner erkannt? Das ist gar nicht so einfach. Das Ding hatsich getarnt als Netzwerkkarte. Du kannst jetzt schlecht Leute mit der Netzwerkkarteim Rechner bannen. Du kannst sagen, ok, Netzwerkkarten mit diesem Hersteller, mit dieser Mac-Adressewerden gebannt, ok, das kannst du machen, aber dann ändert das der Hersteller einfach.Also ein Hardware-Hersteller kann ja reinschreiben, was er lustig ist. Das ist kein großartigesProblem und du kannst jetzt schlecht Leute bannen dafür, dass sie Hardware im PCI-Express-Slotstecken haben. Das ist das Normalste von der Welt, Hardware im PCI-Express-Slot zu haben.Die sollte aber nicht direkten Zugriff auf alle Speicher haben. Ich muss dir ehrlichsagen, ich habe keine Ahnung, wie das unter Windows genau läuft, aber es war wohl möglich,sonst hätte der ganze Cheat nicht funktioniert. Das auf Hardware-Ebene, wie das Treiber technischaussieht, absolut keine Ahnung. Weiß ich nicht.Mit Stadia wäre das nicht passiert, doch! Klar, mit Stadia, das ist ja grad der Witzdaran, sowas kannst du auf jeder Plattform machen. Also sobald du nur noch den Outputbrauchst und den Input hinschickst, ist das komplett plattformunabhängig. Der Cheatnimmt aktuell, natürlich würde das mit Stadia funktionieren, der Cheat nimmt aktuell dasOutput-Signal von der Konsole, errechnet welchen Input er machen muss für einen Headshot undschickt den Input dahin. Das funktioniert mit der Konsole genauso wie mit Stadia.Die Chinesen kennen ja gar keinen Spaß mehr, da kommt es ja sogar ein Knast als Cheat-Hersteller.Das können ja glaube ich gar nicht so einfach. Ich bin mir nicht mal sicher, ob das verbotenist, ehrlich gesagt. Die greifen nicht in das Spiel ein, die greifen nicht irgendwiein Rechte von Activision ein, ich kann mir nicht stellen, dass das verboten ist. Ichwüsste nicht gegen, ich meine keine Rechtsberatung, blablabla, ich hab mir da nicht vorgebildet,was das angeht, aber ich wüsste nicht, gegen was das verstoßen sollte, wenn du den Outputabgreifst, von einem externen System verarbeiten lässt und dann über den normalen Input wiederSachen an die Konsole legst. Es ist fragwürdig, ob das Herstellen solcher Cheats wirklichillegal ist. Was du sagen könntest, ist natürlich, das Benutzen dieser Cheats ist insofern gegendie Toss und du kannst die Leute bannen, wenn du sie dann merkst, wenn du es dann feststellst.Das kannst du auf jeden Fall machen können, aber rechtlich belangend, so eine Cheat-Hersteller,das stelle ich mir äußerst schwierig vor. Naja, ist das nichtirgendwie Manipulation der anderen? Schade, doch, aber das ist strafrechtlich eigentlichkein Ding. Also sag mal so, wenn du jetzt, ich muss jetzt mal irgendwie einen blödenVergleich ausdenken, wenn du jetzt Fußball spielst und deine Schuhe tunst, dann verstößtdu vielleicht gegen die Regeln von deinem Verein oder der Liga, in der du spielst, aberdie Fans werden dich nicht dafür verklagen können. Die können dich bannen, die könnendich bannen, dass du nie wieder spielen kannst, wenn sie dich erwischen, ja. Das ist dasgleiche, was Activision auch machen kann. Activision kann dich bannen, wenn sie dicherwischen und sagen, du darfst dieses Spiel auf diesem Account nie wieder spielen, dasist okay. Aber die können dich nicht verklagen in Form von, keine Ahnung, ich kriege jetztvon dir 5.000 Euro. Er könnte es probieren, aber ich glaube nicht, dass es klappt. Sellout,exzellent Sellout, next. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja.Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja.Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja.ре.0.Rezaktivision.arna match. Tja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ha. Ja. Ja. Ja.ja. Ja. Ja. Ja. Ja. Ja. Ja.Es ist nicht ein Battle Royale. Wir werden auch über die geschlossenen Technik-Tests und Betas von 2042 in EA Play live informieren.Ja, da bin ich mal gespannt. Ich hoffe, ich hoffe, da darf ich mitmachen beim Closed-Technical-Test.Sie werden ein neues Projekt aufbauen, nachdem ihre Arbeit auf Battlefield 2042 beendet wurde.Sie haben seit 2013 als DICE LA auf der Battlefield-Franchise gearbeitet.Letztes Jahr hat EA den Founder von Respawn, Vince Sampella, in der Studie in Bezug.In seiner Richtung werden sie von der Battlefield-Franchise entfernt.Die Rebrandung zum Ripple-Effekt ist ein Teil dieses Prozesses.Das MittelschSie haben es jetzt eigentlich geschafft, dass man seine Mitspieler wieder sieht.Es wird auf der 15.Es wird ein neues Zombies-Map für Cold War genannt, Mauer des Totem.Es sieht aus wie ein klassisches Zombies-Map und bringt viele neue Mechaniken in den Mix.Es wird die Mule-Kick-Perke, einen Roboter-Kompanion, neue Waffen und mehr genannt.Als für Warzone klingt es so, als würde das Mittelschneidende-Updateeinige größere Balance-Changes zum Battle Royale bringen.Die Saison 4 wurde mit schwebenden Balance-Changes eröffnet, die einen großen Impact auf die Meta des Spiels hatten.Der Entwickler sagte, dass ein zweiter größeres Update in der Arbeit war, um die Anzahl der Average zu erhöhen.Gut, Ravensoft hat jetzt ja sich nicht mit Ruhm beklickert die letzten Monate über....TTK of all weapons. These two updates combined should result in a much more consistent experience for all players.Warzone has also been trending towards faster and faster killing weapons with every seasonal update.Assuming the mid-season update brings those TTK-Changes, it'll be a return to form for the Battle Royale.Modern military FPS World War 3 is finally getting...What? Das gibt's noch?...an update after nearly a year of radio silence.The developers announced a partnership with My.Games last year to secure more funding and resources for development.It also means the game will transition to a free-to-play title, but a whole year later nothing has materialized.The game's official social media account is teasing an update in four days, and before they had gone...Also...Die haben es so mega verkackt.Das Game, das kam, das haben die angekündigt vor, keine Ahnung, fünf Jahren oder so.Ich hab mir sogar auch mal damals Early Access mal was für angucken wollte.Das kam zu einer Zeit, wo die Leute richtig, wie sagt man so, gelechtzt haben nach einem modernen Combat Battlefield.Und da haben die das angekündigt und haben gesagt, sie machen sowas in der Richtung.Was natürlich viele Battlefield-Fans gefreut hatten, gesagt haben, cool,es muss ja nicht unbedingt ein Battlefield von DICE sein, es kann ja auch ein Battlefield von einem anderen Hersteller sein.Und jetzt haben die einfach fünf Jahre lang nichts gemacht.Und jetzt, in dem Jahr, wo Battlefield 2042 rauskommt, jetzt wollen sie ein Update bringen?Die haben die Zeit einfach komplett verschlafen, das kannst du jetzt echt nicht in den Ernst sein.Nein, nein, RIP, vorbei.Genau, ja, vorbei, es ist vorbei.Vorbei, verstehe, also, keine Ahnung.Am Ende ist es besser als Battlefield, hey, das kann sogar sein, aber trotzdem, es ist ja nicht immer gesagt, dass die besseren Sachen sich durchsetzen.Ich finde das, ich finde das by the way, super, dass die an irgendwelche, ich weiß nicht, was sie donatet haben, an irgendwelche Tierschutzgeschichten donatet haben.Aber man muss halt mal ehrlich sagen, 10K, das bezahlen die aus der Portokasse oder nicht mal, das ist noch nicht mal die Portokasse, 10K ist so,das ist das, was die wahrscheinlich zufällig auf dem Gang finden im Management-Stock oben, Stockwerk.Ja, das stimmt, das stimmt, Playerbase, Primordial Nightmare, Playerbase ist echt wichtig bei Multiplayer-Spielen.Das ist mit eines der Faktoren schlechthin, ob ein Spiel langfristig erfolgreich ist oder nicht.Wahrscheinlich haben die mehr Geld dafür bezahlt, Influencern Geld zu geben, dass die Nachricht verbreitet wird, dass sie 10.000 Euro donatet haben als die 10.000 Euro, die sie donatet haben.Wahrscheinlich, das wäre so ein richtig typischer Stonks-Move, man donatet 10.000 Euro und gibt dann 100.000 Euro aus, um zu verbreiten, dass man 10.000 Euro donatet hat.Das wäre ein typischer BWL-Stonks-Move, kann ich mir gut vorstellen. Florian290, danke für den Sub.Die interessiert mich jetzt nicht so.Ist jetzt nicht so meine Serie.Wofür steht eigentlich Stonks für Aktien? Stocks.Ja, das war doch schon ein Set-Out eingebaut.Was?Moment, es gibt jetzt 10 Jahre später einen Witcher 3 DLC?Okay, okay, es bekommt kein eigenes Story-DLC, es bekommt ein paar extra Items, das heißt im Endeffekt, keine Ahnung, zwei Tage Entwicklungsaufwand oder sowas.Soll. Wie? Wie billig? Wie billig? Ich dachte, es gibt neue Story, nein, nein, nein, nein, gibt's nicht.Ich würde den Addon raushauen mit neuer Story, den würde ich sofort kaufen, aber was juckt mich, was juckt mich Items aus der Serie? Ich mein, uninteressanter kann es ja kaum sein.Okay, die haben irgendwas gebraucht, um noch ein bisschen Geld zu machen, verstehe ich. Verstehe ich, nachdem Cyberpunk ja nicht so gut angekommen ist, muss ich noch ein bisschen Geld mit Witcher machen, ist ja logisch.Weil die haben mit Cyberpunk auch krass viel Kohle gemacht durch die ganzen Pre-Orders. Er meint eh, dass es kostenlos für bestehende Spieler ist, ja gut, aber wenn du es für die Next-Gen-Konsole kaufst, dann musst du dir das Spiel auf jeden Fall nochmal neu kaufen. Das ist der Anreiz, dass die Leute sich das auf der Next-Gen-Konsole kaufen.Guck dir Aktien an, okay, okay, okay. Kurs, gucken wir mal. Na ja.Das ist ja für das Geld, was sie zur Verfügung haben, das erste Mal nicht so. Also die haben ja das Geld von Cyberpunk trotzdem bekommen. Scheiß drauf, ob ihr Aktienkurs runtergeht oder nicht.Da trifft die doch erstmal gar nicht.Ich warte schon auf die nächsten Reddits. Wenn das jetzt noch weiterfällt, dann kommt demnächst WallStreetBets an. Was macht CD Projekt RedStick? Kommt da irgendwas?So, was gucken wir uns jetzt als nächstes an? EA Activision war gestern. Dieser Konzernbewegte, das wird wahrscheinlich 10 Cent, was sonst? Das müssen wir uns nicht angucken.China-Chinesen-Gramm. Simon Desue exposed auch noch. Wisst ihr Leute, Simon Desue? Ich weiß jetzt gar nicht, warum ich das Video aufgemacht habe, aber ist das nicht der Simplicissimus Typ? Oder einer von den beiden?Oder bringe ich das jetzt durcheinander? Ist das nicht der gleiche Typ? Ach doch, doch, doch.Also Simon Desue ist halt auch so einer, wo ich keine Ahnung habe, warum die Leute überhaupt, also erstens verstehe ich nicht, warum die Leute das jemals gefeiert haben. Ich fand das persönlich schon immer mega unlustig, aber okay. Aber, dass man dem Kerl vertraut, irgendwas, das verstehe ich nicht.Also ich persönlich finde den Typ mega unsympathisch. Das ist so, Simon Desue ist der Typ, der früher in der Klasse immer einen dummen Spruch machen musste, egal wie unpassend es war, weil es eben so sein Ruf war, lustig, funny zu sein. Da musste zu allem einen dummen Spruch machen. So jemand ist das.Quasi selbst wenn jemand erzählt hat, seine Oma ist gestorben, muss dann einen dummen Spruch machen. So schätze ich den Kerl ein. Gut, keine Ahnung, ob es wirklich stimmt, aber zumindest ist mir der Typ mega unsympathisch. Gucken wir mal, gucken wir mal. Ich will jetzt wissen, wie der Ex paust wird.Doch, das ist er doch. Alter, wenn ich diese gestellten Reichtumsbilder schon immer sehe, da kann ich auch mit Carl auf den Mount Everest, da brauch ich nicht Simon Desue.Simon hat jetzt einen neuen, ekelhaften, mutmaßlichen Scam. Den haben wir uns mal etwas genauer angeguckt und etwas dazu recherchiert.Spoiler, seine Masche stammt aus den USA, hat zig Menschen in den Ruin getrieben, ist aufgebaut auf dem Standard-Baukasten der dubiosen Online-Coaches.Ach Gott, nein, nicht noch mehr. Ok, Ok, Coaching, Coaching, Online-Coaching, so in a nutshell. Als erstes musst du den Leuten erzählen, Leute, ihr braucht das richtige Mindset, ihr müsst das Gewinner-Mindset haben.Nur mit dem richtigen Gewinner-Mindset könnt ihr reich werden. Ihr müsst richtig, wie sagt er, ihr müsst hustlen Leute, ihr müsst richtig ran, ihr müsst richtig reinklopfen.Das Gewinner-Mindset, ihr dürft nicht anscheiden, das Gewinner-Mindset. Und dann, und dann müsst ihr natürlich meine Produkte verkaufen. So.Ihr braucht das richtig krasse Gewinner-Mindset und ihr müsst meine Produkte verkaufen. Dann werdet ihr rein. Das ist immer exakt die gleiche scheiß Masche.Dass das da überhaupt noch, das ist ja noch nicht einmal was. Warte mal, Alter, ich muss was trinken. ETF. Alter, normal bin ich jetzt Corona geimpft.Okay, alles gut, alles, so, weiter im Text. Also, es ist ja noch nicht mal, dass diese ganze, diese ganze Masche hier mit ich mache euch reich, das ist garantiert so was, werde ich mit euch, wenn ich das hier schon sehe.Das ist ja gar nicht so, als ist diese Masche neu. Diese Masche gibt es quasi schon ewig online und noch viel, viel länger offline.Dass man den Leuten für viel Geld quasi irgendwelche, soll man sagen, irgendwelche Träume verkaufen will oder ihnen bei irgendwas angeblich hilft.Sei es reich werden, sei es den Traumpartner finden, was auch immer. Und diese Masche gibt es ja schon tausende Jahre im Endeffekt. Ich sage das aus eigener Erfahrung.Ich habe sowas noch nie gemacht, aber mein Vater hat sowas gemacht. Mein Vater hatte eine Scam-Firma früher, die nicht zwar sowas gemacht hat, aber ähnliche Sachen gemacht hat.Also ich habe mitbekommen, was da, was da so abläuft. Das heißt, das ist nicht, das ist nicht neu. Das hat er schon vor 40 Jahren gemacht, ohne Internet und alles.Dass diese Masche ist nicht neu. So, okay, gucken wir uns das jetzt mal an.Also wer sich jetzt fragt, was der, ich erzähle es jetzt mal ganz kurz zu erklären, was der gemacht hat, der hatte eine Partnervermittlung, hatte aber nie vor, Partner zu vermitteln.Der hat quasi irgendwelchen älteren Damen, ich sage mal Omas, erzählt zum Beispiel bei uns, bei mir findet ihr euren Traumpartner, der perfekt zu euch passt und hat mit ihnen einen monatlichen Vertrag ausgemacht.Die haben krasse Kohle abgedrückt für die damalige Zeit, die Omas. Und anstatt den Partner zu vermitteln, hat er sich drei, vier Herren in ein bisschen groberen im Alter, die halt auch nett ausgesehen haben und gut reden konnten,hat er bezahlt, dass die für ihn zu den Omas gegangen sind und denen quasi schöne Augen gemacht haben.Und daraufhin haben natürlich die Omas immer schön weiter Monatsgebühren bezahlt, weil ja so viele nette Herren bei ihnen Interesse haben und vorbeikommen.Also diese Masche, diese Scam-Masche ist uralt.Das ging dann übrigens auch irgendwann in die Hose, weil sie ihn erwischt haben, aber Scamas.Online-Coaches und Future-Digital-Millionärs und richtet sich ganz gezielt auf Menschen.Wenn ich die schleimigen Leute, wenn ich die ganzen Leute schon sehe wieder.Nein, nein, nein, nein, nein, nein, nicht im Knast, nicht im Knast. Wobei, okay, ich, Leute, ich, ich, ich bin ehrlich, er war nicht im Knast und nicht dafür.Er war nur in Untersuchungshaft, aber nicht dafür. Dafür, sie haben ihn versucht, sie haben ihn versucht zu verklagen dafür.Und der Richter muss wohl eins zu eins gesagt haben, also gut, ich kenne das nur von dem, was er so erzählt hat.Der Richter muss wohl wirklich gesagt haben zu so einer Zeugin, Frau, die damals da Kunde war, muss wohl wirklich gesagt haben,Frau, ich sage jetzt mal Frau Meier, keine Ahnung, wie die ist, Frau Meier, warum haben Sie denn sowas unterschrieben?Also das muss wohl so ein offensichtlicher Scam-Vertrag gewesen sein.Es ist nicht rechtlich, also nicht Scam, strafbar Scam, aber offensichtlich sehr einseitig.Und der muss sich fragen, Frau Meier, warum haben Sie sowas denn unterschrieben?Die haben ihn erfragt, also der hat, der hat krass Leute gescampt, aber die haben ihn freigesprochen.Das war rechtlich nichts zu machen. Da wahrscheinlich auch nicht, ja.Aber ich will halt sagen, so Scam-Geschichten sind schon so alt wie die Menschheit.Bevor es losgeht, ganz kurz zum Sponsor des heutigen Videos.Das ist mal wieder NordVPN.VPNs sind nützlich, wenn man virtuell den eigenen Standort ändern will.So kann man ziemlich unterschiedliche Angebote.In den USA gibt es ganz andere Filme, das hat zum Beispiel jemanden von euch interessiert.NordVPN ist auch super schnell, ihr dürftet also auch...Richtig schnell....Sowohl für iOS.Wenn euch NordVPN nicht gefällt, gibt NordVPN.Ja, auf jetzt.Erinnert euch an Abad auf einen Zwei-Jahres-Plan.Ihr alle erinnert euch an Simons Klassiker, wie englische YouTube-Videos eins zu eins übersetzen.Ehrlich gesagt, nein, daran erinnere ich mich nicht, weil ich das nie geguckt habe.Weil ich den Kerl von Anfang an mega unsympathisch fand.Das wird mir jedes Mal bis zum Rest meines Lebens eine Gänsehaut den Rücken runterjagen.Hi, I'm Chris Brown.Asshole!Hi, I'm Chris Brown.Oder bei einer Mini-Verfolgungsjagd dabei sein.Oder auch einem Jetski mieten.Oder sich vor einem Eintages Auto rental stellen und so tun, als würde man es besitzen.Oder billige Scheißzahnpflegen bewerben.Oder in Dubai leben, weil man da ja so frei ist.Ach stimmt!Das ist ja einer von den Dubai Influencer...Wie nennt man das?Keine Ahnung.Gruppe.Was gibt's denn?Es gibt die Madeira Influencer und es gibt die Dubai Influencer.Gibt's noch was?Hab ich noch was vergessen?Haben wir noch ein paar?Warum geht eigentlich keiner in die Schweiz?Zu teuer, zu teuer.Zu, zu, äh, auch zu viel Steuern.LA Influencer, ah, gibt's die auch noch?Und jenen kleinen Scam durchziehen.Man merkt schon, es wurde über die Jahre immer weniger lustig.Und einfach immer krimineller und hinterhältiger und ekelhafter.Ja gut, er muss halt sehen, dass er aus seiner, ähm, schwindenden, keine Ahnung, Fanbase,die ihm da noch traut, das Maximale an Kohle rausholt, ne?Hatte am Freitag ein Vorstellungsgespräch zum Fachinformatiker.Interessiert es dich vielleicht, welche Fragen sie gestellt haben?Ja, ja, können wir uns gleich mal angucken.Ich guck mir jetzt das Video an.Ja, jetzt können wir uns eine gute Idee...Interessiert mich, ja.Ja, ich kenn auch einen, der gerne noch mehr verdienen würde.Ich mach's ganz kurz, er verspricht, dass man über FBA, das ist Fulfillment by Amazon,richtig heftig rein...Fulfillment by, äh, ähm, das ist Marketplace, oder?Das ist ganz normales Amazon Marketplace, oder?Seh ich das jetzt falsch?Du verkaufst deine Sachen über Amazon und, ähm, du machst halt, du machst halt Fulfillment,also sprich Versand und, du machst halt die Abwicklung über Amazon.Reich werden kann, 5.000 Euro die Woche, 10.000 Euro die Woche...Also du schickst, du schickst deine Sachen quasi an Amazon, an irgendein Amazon Logistikzentrum,lässt es da lagern und Amazon verschickt es dann, wenn es einer kauft.Geld verdienen.Und was Fulfillment by Amazon eigentlich ist...Damit kann man, damit kann man, damit wusste ich gar nicht, dass man damit angeblich krass Geld machen kann....das Amazon dir anbietet, okay, wenn du ein Produkt hast, schick es einfach in unsere Lagerhäuser,wir verkaufen das für dich auf unserer Plattform, also beziehungsweise wir schicken es halt raus,wir holen es zurück, wir machen Returns, Kundenservice und halt alles für eine Commission...Na Moment, Moment, Moment, du schickst das palettenweise an Amazon und die machen den Rest,so einfach ist es ja nicht, denn Scheiß muss ja jemand erstmal kaufen.Du musst den Kram einkaufen und du musst, du musst dafür sorgen, dass die Leute den Kram verkaufenund dann musst du auch irgendwie Gewinn mitmachen.Einige smarte Leute haben mal gedacht, oha, was, wenn wir einfach super billige China-Produkte nehmen, so Handy-Cases...China-Chinesen-Kram, beste Idee.High-Quality-Produkte kommen immer gut an....Kram verkaufen, so, oder ist auch was für Small Businesses, et cetera, et cetera.Und dafür bietet Simon jetzt ein krasses Coaching an, weil er behauptet, dass er damit auch unfassbar...Um alles in der Welt braucht man da Coaching....viel Geld verdient, er ist einfach der FBA-Gott.Dafür hat er eine super billige Clickfunnels-Page erstellt, deswegen sehen die übrigens alle mal gleich aus,weil es dafür so einen Service quasi gibt, clickfunnels.com.Er hat bei seiner geilen Clickfunnels-Seite nicht mal den Infotext der Webseite geändert.Da steht tatsächlich No-Cost-Training vor, in eckigen Klammern Market, weil man da halt dann einfügen soll...Ja gut, jetzt kann sie nicht erwarten, dass Simon Desue irgendein krasser Webdesigner ist....No-Cost-Training macht, also der hat das Template nicht mal vernünftig angepasst, das ist so billig.Man kann nicht sehen, wer die Domain registriert hat.Und mit seinem geilen Amazon-Dropshipping verdient er bestimmt auch nicht genug, dass er da mal einen Webdesigner bezahlen kann.Da hat er anonymisiert, schade. Es gibt auf jeden Fall dieses Video, in dem er das alles...Ich glaube, er müsste mal gecoacht werden, wie man eine Webseite macht.Das ist super ekelhaft aufgebaut, natürlich.Letztes Jahr wurden auf Amazon über 386 Milliarden Dollar umgesetzt.Ja und?54% davon kommen von Verkäufern, wie ich es bin.Und er sagt dann so richtig diepe, also wirklich tiefgehende, motivierende Sachen wie...Und der Knackpunkt einfach machen und tun.Und auf Instagram hat er noch ein Video veröffentlicht...Machen und tun?Boah!Huge Coaching!Ein Teilnehmer seines geilen Seminars, der in...Das ist wie...Das ist wie wenn in irgendeinem Online-Game, um zu gewinnen, dich jemand coacht...Also stell dir mal vor, ihr wolltet gut werden in einem Online-Spiel und lasst euch von einem Pro coachen.Und der Coach sagt einfach zu euch, einfach nicht sterben.Einfach nicht sterben und alle Gegner killen.Das ist ungefähr genauso gehaltvoll wie dieses Coaching.Hat irgendwie was von KLS-Vibes, ja klar, weil das alles der gleiche Crap ist.50 Dollar verdient hat.Dieses Gefühl kann ich nicht in Worte fassen.Und wie viel hast du seit dem Start verdient?Die sehen beide wie super vertrauenswürdige Menschen aus, denen man jedes Wort glauben kann.Vor allem...Ist das eine Goldkette, eine Silberkette?Wahrscheinlich auch irgendwie krasser Markenpulli, aber mit sowas kenne ich mich nicht aus.Alles sehr vertrauenswürdige Leute.Das ist kein Screenshot.Moment, was?4856 US-Dollar.Im Monat.Gut, kommt auf die Menge an, die du verkaufst.Das ist kein Screenshot.Oder in sieben Tagen.Es kommt auf die Menge an, die du verkaufst.Das ist...Das geht schon.Es ist halt die Frage, wie viel du verkaufst.Und die Frage ist ja nicht nur, wie viel du verkaufst.Die Frage ist ja auch, was bringt dir das im Endeffekt?Ich meine, du musst den Kram bestellen.Du musst den Kram eventuell irgendwo zwischenlagern, bevor es zu Amazon, was weiß ich, über welche Ecken du das schickst.Du musst verkaufen.Du musst Steuern bezahlen.Also die Frage ist, was bleibt am Ende übrig?Ich meine, 5000 Dollar in sieben Tagen ist jetzt sicherlich nicht wenig.Aber es kommt halt auf die Umstände an.Es kann sein, dass davon kaum was übrig bleibt.Aktualisieren.Ja, das ist wohl kein Screenshot.Aber leider sind Produktverkäufe der Umsatz der letzten sieben Tage, nicht der Profit.In einfachen Worten, du kannst zwar 1000 Produkte für 5 Euro verkaufen.Das ist das, was ich im Prinzip sagen wollte.Sie fragen, was am Ende rauskommt.Wenn du aber nur 5 Cent Gewinn pro Stück machst, naja.Aber es gibt noch mehr Anzeichen, dass das Ganze mit hoher Wahrscheinlichkeit ein saftiger Scam ist.Das erste ist, dass die amerikanische Federal Trading Machine genau die...Das ist davon abgesehen, so eine Seite zum Refreshen mit irgendwelchen Zahlen drauf,kann dir jeder halbwegs kompetente Typ bauen.Diese Fälle verfolgt, nämlich so Get Rich Schemes von wannabe Amazon Seller.Und wenn man sich das so durchlässt, dann denkt man, dass die direkt Simon verklagt haben eigentlich.Get started selling on Amazon and make 5 to 10.000 Dollars in the next 30 days,even if you've never sold anything online before.Hört sich ähnlich an, ja.Das klingt ja fast genau wie das Schema von Simon.Und das Lustige ist, dass diese Masche super alt ist.Also diese Klage von der FTC ist von 2018 oder so.Hier gibt es einen Artikel von The Atlantic Anfang 2019 über diesen Gold Rush auf Amazon FBA macht dich reichund dass da Leute eben übelst heftig über die Ohren gehauen wurden von diesen krassen Coaches.Die Leute sind aber auch so blöd.Die sind aber auch so blöd.Warum macht man da mit?Ich kann das nicht verstehen.Okay, es ist ja, die richten sich ja absichtlich.Doch, ich kann es verstehen.Die richten sich ja absichtlich an Pepega Leute, die man einfach übers Ohr hauen kann mit sowas.2021 überlegt, dass es Zeit wird, dass er das mal in Deutschland probiert, I guess.I don't know.Einfach machen und tun.Die Artikel haben wir euch alle verlinkt und so.Also falls ihr euch da noch ein bisschen analysieren wollt.Das ist genauso wie diese Videos, die Karl S. immer macht mit seinen, was weiß ich, 5 Millionen Uhren.Und dann hat er irgendwie so ein komisches Case mit Uhren drin,die er danach wahrscheinlich wieder abgibt da, wo er sich ausgeliehen hat.2018 haben sich bei der FTC 50 Leute beschwert, dass sie da unglaublich viel Geld mit verloren haben,weil ihnen versprochen wurde, boah, FBA macht dich reich, hol dir irgendein Billo-China-Produkt,zell das, zell das, zell das, dann machst du deine 5 bis 10.000 Dollar die Woche Quatsch natürlich.Und 25 von denen haben über 35.000 Dollar verloren.Gut, man sieht aber schon an einer Sache, dass die Leute auf allen Seiten echt doof sind.Nämlich dadurch, dass so eine Seite wie Wish.com überhaupt existiert.Wish ist die Seite für China-Scammer, wo die Leute zu dumm sind, in China selbst zu bestellen.Also sprich, die einzige Existenzberechtigung von Wish ist,weil Leute unfähig sind, in China zu bestellen,weil die Leute nicht in der Lage sind, auf AliExpress zu gehen und sich was zu bestellen.Genau, Wish heißt, ich kenne AliExpress nicht, ich bin zu dumm, bei AliExpress zu bestellen.Das ist Wish.Also Wish ist eigentlich die einzige, also Wish existiert nur,weil Leute zu dumm sind, bei AliExpress was zu bestellen.Und den haben über 35.000 Dollar verloren.Aber Simon Desue bietet auf jeden Fall ein Live-Training an, das ist alles live.Also da ist man dann im Live-Chat mit ihm und kann sich live angucken,was er dann sozusagen hat im Chat mit anderen Leuten.Nur leider hat TJ, ganz liebe Grüße gehen raus, falls du das siehst,schon demonstriert, dass das angebliche Live-Video natürlich nicht live ist.Ich frage mich, ob der Chat wenigstens wirklich echte Leute sind oder Bots,dass es Aktivität faked, obwohl du der einzige Zuschauer bist.Leute natürlich auch darauf hin, dass es einfach eine prerecordete Masche ist.Es wird keine Wiederholung geben.Nein, auf gar keinen Fall.Es wird keine Wiederholung geben.Das Impressum von simonvideos.com slash live-training führt dann einfach zugetclients.com und getclients.com.Es ist ein Learning Portal für Leute mit digital Product Businesses,also für Coaches, Course Creators und so weiter und so fort.Vertrauenswürdig hoch 10.So wie Simon und dann stehen da so Sachen wie...Diese Bilder, diese Bilder triggern mich auch immer richtig.Simon und dann stehen da...Diese Bilder, das ist einfach immer...Das ist, weil die Leute sind für sowas empfänglich.Anders kann ich es mir nicht erklären.Du bildest irgendwelche jungen Leute auf dem Schiff abund irgendwie sollen die Leute dann denken,wenn man bei ihnen mal einen Kurs gemacht hat,dann geht es so steil aufwärts, dass man in einem halben Jahrin der Karibik auf einem Boot rumschippertund automatisch durch Nichtstun Geld verdient.Allein schon wenn ich solche Bilder sehe, weißt du, es ist Scam.Also wenn Leute im Internet versprechen, dich reich zu machenund ihr Impressum verlinkt auf eine Seite,in der ein Typ dir verspricht, dich mit Kursen...Weißt du, was mich auch immer so wahnsinnig triggertbei diesen ganzen Coach-Dingern?Das sind alles mega junge Leute.Ich sage nicht, dass es nicht junge Leute gibt,die erfolgreich sein können, aber das sind meistens so,keine Ahnung, 23-, 24-, 25-jährige Leute,die dir dann erzählen sollen,so baust du dein weltweites Business auf.Wie will der das denn beurteilen können mit 25?Selbst wenn es Leute gibt, und die gibt es,die mit 25 Jahren ein richtig krasses Business haben,lohnenswert darüber zu berichten nach dem Motto,ich habe jetzt hier einen weltweiten...Das machst du dann, keine Ahnung, mit 40 oder so,dass du sagst, guck mal, so ist es, das ist meine Erfahrung,aber es wirkt einfach total unglaubwürdig,wenn das alles irgendwie 25-jährige Speaker sind.Verlinkt auf eine Seite, in der ein Typ dir verspricht,dich mit Kursen darüber, wie man Kurse macht...Und die, die in dem Alter wirklich diese Kohle haben,was anderes tun, auf solche Dinge zu gehen....reich zu machen, reich zu machen, dann weißt du...Mal ganz davon abgesehen, eine Sache,die ich nie verstehen werde,bei solchen Dingern ist, wenn ich wirklichden ultimativen Trick rausbekomme,dann muss man sich mal überlegen,stellen euch mal vor, ihr habt wirklichden ultimativen Trick rausbekommen,diese eine Masche, mit der ihr ohne viel zu arbeitenrichtig krass reich werden könntet,würdet ihr das allen Ernstes für ein Apfel und ein Eian jeden auf dieser Welt verkaufen, diese Information?Im Leben nicht, niemals würde ich das verkaufen.So dumm kannst du noch nicht sein.Alleine schon aus diesem Gesichtspunkt sinddiese ganzen Coaching schon immer sehr fragwürdig.Die tun immer so, als hätten sie die Weisheitmit Löffeln gefressen und wissen das,was niemand außer ihnen auf der Welt weiß.Und dann fragt man sich ja natürlich,wenn die doch so krass schlau sind,warum machen sie es nicht einfach, ohne jemand zu erzählen?Okay, das ist der kurze Rundown vonSimons neuem mutmaßlichen Scam.Und jetzt vielleicht mal so zum Ernst der Lagefür eine Sekunde. Simon Desue hat so 2 MillionenFollower auf Instagram. Ja, verstehe, das ist mirabsolut unverständlich, aber okay.Und bewirbt ganz offensichtlich eine Masche,also ich sag euch mal ernsthaft, bevor ichAmazon Drop Tripping mit Simon Desue mache,dann gehe ich lieber mit Carl auf den Mount Everest.Und das würde ich auch nicht machen.Und dann spricht er absichtlich den kleinen Mann an,den Arbeitnehmer, denjenigen, der sich vielleichtam einfachsten von solchen Versprechen locken lässt,weil der oder diejenige vielleicht am wenigsten hat.Was hast du jetzt vorher gemacht in der Ausbildung?Wie viel hast du da verdient, wenn ich fragen darf?Wenn ich fragen darf? Nein!Stell euch mal vor, der Mensch sagt, nein, darfst du nicht.Ist ja überhaupt nicht gescriptet.180 Euro netto.Du hast jetzt das sozusagen in einer Woche schon mehr verdient.Ach, das Fünffache.Simon Desue ist einfach so eine Person...Oh, meine Güte....und Luxus pflegt und versucht, aufrecht zu erhaltenmit gestellten Bildern, mit teuren Autos,mit prolligen Roomtouren, mit seinem Influencer-Leben in Dubai.Dazu wurde ja auch schon genug gesagt,zum Beispiel von Jan Böhmermann.Und seine Maschen sind dann Dinge, mit denen er ganz gezieltMenschen mit wenig Geld anvisiert.Viele werden jetzt denken, so was, Ausbildung abbrechen,aber lohnt sich auf jeden Fall für Amazon,dank Simon natürlich.Natürlich, was sonst?Oh, das tut ja weh.Entweder werde ich abgezogen oder nicht.Aber ich habe vertraut, ich habe vertraut.Das ist natürlich das krasseste Argument schlechthin.Die Scammer sagen dir, du sollst den Scammern vertrauen.Das wirkt aber vertrauenswürdig.Ohne Scheiß.Ich würde Geld dafür bezahlen,wenn ich nicht den Interview mit Simon Desue hätte.Oh, sorry, du bezahlst zu wenig Geld raus.Dass da immer noch Leute drauf reinfallen,ich werde es nicht verstehen.Das tut weh beim Zuhören.Ja, ist echt so.Es schmerzt beim Zuhören.Was ich daran schade finde,dass es oftmals die Leute trifft,die vielleicht schon ein bisschen,wie nennt man denn Leute,leichtträubig, gutgläubig,oder vielleicht gar nicht mal so sehr.Vielleicht sind das einfach wirklich auch Leute,die Simon Desue schon seit, keine Ahnung, 2013,oder der ist ja noch länger als ich auf YouTube,der ist ja 2009 oder irgendwie so,seit 2009 auf YouTube folgenund irgendwie mit ihm da lustige, gute Sachen verbinden,was auch immer, ja,und einfach ein bisschen leichtgläubig sindund denken, so diese Masche,was ja auch immer gerne erzählt wird,ist so nach dem Motto, Leute, ich habe schon alles erreicht,aber jetzt ist es Zeit, dass ich ja meine Communitymal was zurückgebe, jetzt zeige ich euch,wie ich es gemacht habe.Das ist ja oftmals die Masche auch,die dann wirklich glauben,so nach dem Motto, so ein guter Mensch,der gibt den Leuten jetzt was zurückund erzählt ihnen, wie es wirklich gehtund wie dann darauf reinfallen.Das Bittere ist halt, dass es tatsächlichdie letzten verbliebenen richtigen Fans trifft,die er hat,und die verarscht er dann auch noch.Das ist halt für'n Arsch.Aber gut, so sind die Leute halt.Also solche Leute.Da machst du nix.Gibt es denn ein Scam-FPS-Business-Programmmit Herr Endpunkt?Herr Endpunkt meldet sichin letzter Zeit leider im Discord nicht mehr.Ich wollte mit ihm ja ein Video aufnehmen.Er weiß nicht, ob ich euch das erzählt habe,er hat sich ja gemeldet im Discord.Ich habe jetzt auch verraten,dass er Niklas heißt,das hat er mir erlaubt.Und ich wollte mit ihm eigentlichein Video aufnehmen,aber irgendwie ist er in letzter Zeitnicht mehr am Start.Aber gut, dann...Dann machen wir das,wenn er wieder da ist.So.Letzte Chance,YouTube uns was Gutes vorzuschlagen,sonst gucken wir mal, was haben wir da?Top Concerns Battlefield 2042Tja, das gucken wir uns jetzt nicht an.Redis in 100 Sekunden.Redis in 100 Sekunden.Redis kann man in 5 Sekundeneigentlich beschreiben.Es ist RAMmit einer Query-Language.Es ist dein RAM,auf dem manstrukturierter zugreifen kann.Fertig.RAM, auf dem manorganisierter zugreifen kann.Oh, wäre gut.Schwierig zu beschreiben jetzt.Zumindest RAM.RAM.In Memory.Redis kannst du glaube ich auchauf Persistent machen, auf SSD,aber das muss, dass es schnell ist,dass sich das lohnt, muss das in RAM.Reddit ist RAM as a Service, genau, genau.RAM as a Serviceist Redis. So kann man das gut beschreiben.So, was haben wir sonst noch hier? 10 Gigabitauf einem Raspberry Pi. Na gut, mit PC,Express, ist das geil. Ach,guter Switch, Leute, guter Switch.Ach, Bewerbungsfragen, stimmt, Bewerbungsfragen.Ja, ihr habt recht.Also, zeig mal her.Wo hat es denn...............................................................oder das das wäre mir auch zu fies leute was berechnen zu lassen und waskann man damit alles ein einstellen und als letztes welche games ich zocke der eine hatte michexzellent gut und was hast du ihnen geantwortet wofür ist ein router zuständigIch meine noobs würden antworten um zu routen das ist aber nicht das womit du punkten kannst beiBei vorstellungsgesprächen oder um zu um zu um zu routen für routing ist der router zuständig der routerDie einfachste antwort ist natürlich ein router ist dafür da um zwei unabhängige netze miteinander zu verbindendass zwei dass zwei unabhängige netze miteinander reden können von einem netz ins andere netz zu routenfür welche stelle war stimmt als was hast du dich beworben es wäre vielleicht interessant zu wissenfachinformatiker und dann welcher moment nur dass ich das richtig jetzt verstehe nur dass ich dasjetzt richtig verstehe du möchtest dass ich auf dein video reakte ne heute nichtich habe festgestellt es wäre ein router ohne modems hergestellt aber irgendwie fast keine modemsohne router mehr ja ja ja das das stimmt allerdings nur im heimbereich im businessbereich gibt es das alles sehr wohl ja ok frage was macht dns ist eigentlich auch standardwenn man da sagt namensauflösung domain zu ip das ist man schon sicher was ist ein gateway najader gateway ist in der regel das interface vom router was man aus an seinem endgerät einstellt damitman ein anderes netz kommt über den router das hängt da stark damit zusammen subnet maske kommtda noch und was man damit alles einstellen und jetzt ja das finde ich aber cool dass sie dichfragen welche spiele du spielst da sieht man dass mittlerweile dort auch leute sitzen die für diespiele nicht das teufels zeug ist ja finde ich gut du hast das rezept einfach erbendes geld jadas kann man machen easy doch doch das ist glaube ich der gleiche typ ja es ist nichtmal ganz so ganz so kaputt die standard apps aber wirklich wirklich überzeugt hat es michimmer noch nicht das ist ja eins vor wundert mich dass noch niemanden koin gemacht hat derauf ram gemeint wird doch doch gibt schon so gut wie jedes mein im programals was hast du dich beworben da kam keine netzwerk das hängt immer ganz entscheidenddavon ab wer da sitzt in so einem vorstellungsgespräch also bei uns ist es leider leider muss ich sagenbei uns ist es leider so dass im vorstellungsgespräch fachinformatik systemintegration da sitzt derausbildungsleiter für alle azubis also sprich der hat von technik und tun und blasen keine ahnungund irgendwie einen personalmensch das heißt niemand der wirklich ahnung von technik hatsitzt bei uns in dem fisi vorstellungs vorstellungsbewerbungsgespräch das heißtkannst du komplett klicken das heißt selbst mit technik fragen kommst du da nicht weiter dukommst bei uns du wirst bei uns alles lustigerweise echt so du wirst bei uns als fisi eher eingestelltwenn du einen ordentlichen anzug an hast als wenn du technische ahnung hast ja sind aber selberdran schuld sind selber daran schuld wenn sie nicht gute leute kriegen mit solchen solchen sachen ichwas ich wurde auf eure ich wurde auf einer bewerbung ob ich auch in games raide da finde iches eine gute frage das finde ich ist eine gute frage ohne scheiß wenn mir jemand erzählt derist mmo progression raider weiß ich der kann auf jeden fall gut mit anderen leuten an wasarbeiten um ein gemeinsames ziel zu erreichen progression ich habe es doch schon in meinemhomeoffice video gesagt mmo progression raider ist die eigentliche homeoffice master race wenndu wenn du dir sicher sein kannst dass einer gut im homeoffice arbeiten kann und auch gutzusammenarbeiten kann dann sind es mmo progression raider die wissen wie man online kommuniziertdie wissen wie man mit anderen online zusammenarbeitet so dass was gescheites rauskommtwie steht so zu winfo was wirtschaft informatik leuten mir ist eigentlich egal was jemandstudiert hat gemacht hat oder sonst wie wenn er seine aufgabe ordentlich erfüllt die er hathabe ich damit keine schmerzen natürlich was immer leute die kein plan haben wir hatten auchmal einen der hat erzählt er hat fortgeschrittene vmw erfahrung und wenn man ihn gefragt hat hater gesagt er hat mal ein ubuntu vm installiert ja also das ist fragwürdig teilweise was da erzähltwird aber das beste bewerbungsgespräch aller zeiten das muss ich das muss ich jetzt mal kurzkurz ein einwerfen also das beste bewerbungsgespräch aller zeiten was ich bei uns mitbekommen habewar folgendes hat sich jemand bei uns bewerb beworben und der hatte der hatte einen abschluss inmatte der matte matte studiert so mit abschlussarbeit und allem und es ging dann halt so es kam so einpaar technik fragen und irgendwann ging es dann um seine um seine abschlussarbeit so nach demmotto ja über was so hat dann einer gefragt von den leuten die dabei gesessen über was wardann ihre ihre abschlussarbeit und dann hat er dann gesagt so ich denke mir jetzt mal irgendwasaus ja ich weiß es ehrlich gesagt nicht nicht mehr genau irgendwie so was weiß ich das drittetheorem von xy oder sowas oder oder was weiß ich irgendwas mathematisches hat er gesagt so undnormalerweise normalerweise wäre jetzt das bewerbungsgespräch an dieser stelle durch gewesen weil alledie da gesessen hätten hätten gesagt okay drittes theorem von xy ich habe keine ahnung wo von dertyp spricht na ist alles gut der typ hatte nur pech der typ hatte bei uns richtig richtig großespech weil in diesem bewerbungsgespräch saß einer der einzige im umkreis von keine ahnung na gut infrankfurt ist eine uni aber ich sage jetzt einfach mal einer einer der handvoll leute im umkreis von500 km der wusste was das ist wir haben nämlich bei uns ein auf der arbeit der also das ist einriesen riesen mathe fan und der arbeitet quasi nur um geld zu verdienen bei uns und löst ist inirgend so eine mathe mathe mathe ich habe keine ahnung wie das heißt in so einer mathe vereinigungund im prinzip der beschäftigt sich in seiner kompletten freizeit mit dem lösen oder mit demmit dem mit dem beschäftigen von ungelösten mathematischen problemen also der geht da wirklichnur arbeiten um bisschen geld zu verdienen und die restliche zeit hat der typ ist er am lösen undmathematische probleme also das ist wie gesagt einer von handvoll leuten im umkreis von keineahnung 500 kilometer der der der wissen hätte wissen können von was der spricht so und dannkam halt wie es kommen muss das aber interessant wie war dann noch mal das dritte die drittetheorie ich kenne die zweite kenne ich aber was war da noch mal die dritte und da muss den typ soübelst aus der fassung gebracht haben dass er gemeint hat so irgendwie da kann ich jetzt nichtdrüber reden mein abschluss mein abschlussprojekt ist geheim da darf ich nichts zu sagen der muss ichkrass raus geredet haben der hat halt gedacht er sagt irgendwas super mathematisches wo eh keineahnung von hat und dann ist die sache durch ob der typ überhaupt ein abgeschlossen studiohabe weiß ich bis heute nicht studium auf mich bestellt ja das ist halt echt verkacktder hat wirklich aber der hat auch echt pech gehabt muss man mal sagen wer kanner damit rechnen dass ihm das der einzige einer der handvoll leute in deutschland die dazu wassagen können ausgerechnet bei ihm bewerbungsgespräch mit setzt erbei mir wollten sie beim gespräch nur wissen was ich gebe ja die story hast du ich habe ichhabe sehr viel leute wie lange stream ich jetzt schon seit drei jahren ich habe die ein oderandere story ja schon öfters mal erzählen ja mega pech ja das ist eigentlich ist das einrichtig gutes richtig guter videotitel studium auf mich bestelltja das thema hatten wir heute schon aber man weiß ja nicht so genau woran es gelegen hat dass diedass die ganze infrastruktur down ist oder ist da mittlerweile mehr herausgekommensolche fragen gehen mir auch immer auf den keks das sind so genannte brain teaser fragenund das schwappt langsam aus den usa zu unseren bewerbungsgesprächen rüber nur mit dem unterschiedwas was ich auch immer nicht verstehe ja also wenn wenn google oder facebook microsoft apple werauch immer so komischen fragen stellen und mit den leuten an der tafel binary trees in wortenund so was in der richtung dann ist das google microsoft also das sind quasi firmen mit die diegrößten big brains der welt suchen für sich ok aber nur weil das microsoft apple und googleund facebook und netflix und und so was macht das muss das nicht die 015 software klitsche infrankfurt um die ecke machen aber übrigens dank der hilfe zu meiner bewerbung auf deinemdiscord mein ausbildungspass excellent excellent leute ausrufe zeichnen discord wenn ihr big braincontent braucht und ausrufe zeichnen hetzner wenn ihr euren 20 euro hetzner startgutscheinclaimen wollt hast du schon mal das heizungsniveau noch nie was hältst du von dort net 6 eine gutegute Entwicklung ja und und diese diese fragen mit dem wieviel smarties passen in ein smart dassind genau solche fragen diese art der fragen die jetzt immer mehr rüber schwappt aus den usaund da geht es im prinzip darum nicht nicht dass du die wirklich beantworten kann sondern dassman quasi erklärt wie man wie man da rangehen würde vom ansatz her aber ich finde solche fragentrotzdem bescheuert also richtig richtig hängen geblieben aber gut man kann ja fragen was siewollen bei solchen fragen sollen man einfach nur laut genau genau bei uns sind bei azubibewerber kaum fragen über fachliche skills bei da gibt es ja ja ist bei uns auch so wie gesagt beiuns jetzt ja auch keine technikleute dabei bei uns jetzt der oberausbildungsleiter dabei derkeine ahnung von technik hat und irgendwelche personal leute kann man voll vergessen mein ansatzwäre googeln ernsthaft das würde ich auch antworten so jetzt ja ab und zu bin ich auf twitch aber ichbin ich bin ja nicht mal ich bin ich bin wuppe los siehst du doch hier mensch stimmt doch gar nichtfake news alter fake news also mein vorstellungsgespräch für die ausbildung das könnte ich eigentlich maldas könnte ich eigentlich mal ein video zu machen also mein vorstellungsgespräch für dieausbildung war total easy wir haben erst ein test gemacht wo sie schon angekündigt haben der testist gemein weil es der test ist den sie normalerweise auch leuten geben die sie so einstellen so und ichkonnte davon ein paar sachen beantworten da war zum beispiel auch die frage drin wie geht man auswim raus auto exit wim und sowas war da als als frage drin irgendwelche ip tables tabellen undsonst wie was also ich konnte zu einigen sachen tatsächlich was sagen aber vieles keine ahnungwar halt voll voll verkackt ja wusste ich damals nicht zumindest in dem gespräch danach war warecht nicht war echt nicht viel ja ich weiß noch dass ich damals als ich das bewerbungsgesprächalso sie haben dann gesagt ok wer möchte anfangen ist ja ok gehe ich immer als erster rein und diehaben ich dann die noch bevor die was sagen konnten habe ich halt so vor mich hin hin gemurmel dassmanche fragen echt fies waren in diesem vorstellungs in diesem in diesem test und haben sie haltgefragt ja warum da meinte ich also ja gerade bei den ziskosachen da wusste ich teilweise aberbin ich mal drauf gekommen da hatte man gleich so ein gesprächsthema ansonsten bin ich da rauswir haben nicht wirklich viel ja großartig geregelt keine ahnung zehn minuten und einen tag späterhaben die mich angerufen haben gesagt ja wann können sie unterschreiben ok alles klarmuss jetzt mal wieder zurück auf youtube klar aber die fragen die letzten sagenguckst du mir noch an aha auch richtig big brain ja ich das ist übrigens auch der grund warum ichimmer ein bisschen bisschen schwierig finde die leute quasi live wie soll ich sagen livekomplexere sachen auszufragen weil es ist einfach so viele leute auch auch leute die wirklich wirklichgut sind und big brain haben können unter druck nicht kreativ denken das ist aber auch normalbei der wei deswegen das ist das ist eines der gründe warum ich diese diese diese taktik mitvorstellungsgesprächen komplexe sachen zu fragen und implementiert zu haben nicht nicht gut findeweil programmieren und und über probleme nachdenken ist da muss jetzt man muss jetzt einbisschen ausholen das ist ein kreativer prozess also wenn du jetzt ein problem lösen willst keineahnung du sagst ich möchte was programmieren was mein bildschirm immer ab 17 uhr dimmt oder sowas irgendwie eine einfache einfach eine einfache aufgabe ja da musst du musst du kreativ sein damusst du überlegen ok wie mache ich das mit der urzeit wie handelt ich keine ahnung man schalltja wie mache ich hier wie mache ich jenes das heißt es allein so das überlegen ist ein kreativerprozess und das programmieren und implementieren und wie mache ich es auch ein kreativer prozesssondern es gibt zwei sachen die funktionieren einfach nicht zusammen das ist stress gefahrernst plus kreativität das geht nicht zusammen und wenn leute unter unter druck sind schon einbisschen panik haben oder angespannt sind bei einem vorstellungsgespräch dann kannst du vonihnen keine kreativen leistungen großartig erwarten dass das geht einfach nicht zusammendeswegen verstehe ich nicht wie man sich daraus was ableiten will das habe ich noch nie verstandenund leuchten wir bis heute nicht ein das eine passt mit dem andere nicht zusammendeswegen finde ich solche solche sachen bescheid ich finde es viel sinnvoller zu sagen hey schickmal dein githab profil mit ich guck mir das guck mir das an da siehst du nämlich was dertyp macht wenn er wenn er seine ruhe hat und kreativ denken kann aber unter druck kreativ alsodruck und kreativ denn das sind so die beißen sich einfach das ist ungefähr so wie wenn dueinem künstler sagst seine maler ja wenn du dem eine pistole an den kopf hältst und sag sagstjetzt mal mal dein nächstes meisterwerk da kommt sicherlich nichts ordentliches bei rumdas kann ich das kann ich funktionieren wie viel matten haben die abgefragt so gut wie gar nichtsdeine mord und worte mutter ist doch schön ich mache immer noch youtube videos falls du nichtmitgekriegt hast aber halt wenig wenig zu battlefield und call of duty spiel ich ja gar nicht mehralso ok weiter gibt es wo man hat überhaupt eine möglichkeit ein bewerbungsgespräch nichtzu nicht zu bestimmt bestimmt so lange es kein so lange es kein nasi schneiderman struktur kramsein soll ja ich muss euch sagen das ist eines der sachen wo ich mich echt komplett verschätzthabe ich muss ja auch zugeben können wenn man falsch liegt rainbow 6 habe ich komplettfalsch eingeschätzt ich dachte rainbow 6 ist ein game das kommt raus ich habe die beta gespieltes kommt raus und nach einem halben Jahr interessiert sich keine sau mehr dafür da lag ich komplettfalsch aber komplett aber nicht bei einem azubi oder bei einem programmierer du schickster du schickst er du schickst er eigentlich kein programmierer zu deinem kunde dass dereben dann einen flowchart malt oder eine implementierungsvorschlag live an der tafel erarbeitet das wäre undwenn dann soll das irgendjemand anderes machen ich würde es nicht machen so sollte so solltees meiner meinung auch meiner meinung nach auch zum größten teil sein man sollte hauptsächlichgucken dass es einstellungsmäßig und menschlich miteinander passt dass man gut miteinanderarbeiten kann und das ist eigentlich das wichtigste gerade in der heutigen zeit ist ist es dochviel wichtiger dass man mit den leuten dass man mit den leuten gut im team zusammenarbeitenkann als dass sie jetzt alles schon wissen weil du kannst gar nicht also es ist saumäßigschwierig für das spezifische was du jetzt machst jemand zu finden der wirklich ahnungvon hat das ist heute so viele faktoren die da zusammenkommen und unterschiedliche warenwichtig ist eigentlich dass du jemand aus der ahnung hat und sich schnell einarbeitenkann und der team mäßig zu deinen restlichen leuten dabei passt das ist meiner meinungauch das wichtigste der muss so weit ahnung haben dass er sich schnell einarbeiten kannund so weit ahnung haben dass er weiß nach was er suchen muss dass der jetzt dass dujetzt den einen in deutschland findest der exakt dein eines problem was du hast lösenkannst ist doch unrealistischnicht wirklichkeine ahnungentwickler kapitulabschluss kann ich zu sagen ok guck mal weiter also was haben wir hieram start noch 10 gigabit dieser dieser switch ist übrigens richtig poggers den habe ichauch hier das ist ein mikrotik ich glaube in cc css oder crs 305 ist das glaube ichder ist wirklich poggers was hat das bitte schon mit cc na zu tunich will eigentlich nur mal den switch switch sehen ob das der richtige ist den ich denkeja heißt das ist das ich glaube das ist das das ist das css 305 css 305 305 mikrotikja ist er doch sag ich doch hier poggers super ein super switch schrägstrich mit bisschenrouting funktion nicht so wahnsinnig viel aber bisschen kannst du mit machen also bandbreitenmäßig damit jetzt keine zwei abteilungen über verschiedene aber ansonsten ist dasschon in ordnung der ist wirklich gut der ist nicht teuerkostet glaube ich nur irgendwie ja 100 100 112 euro 115 mit versand 115 euro du bekommsteinen gigabit port und 14 gigabit ports glasfaser eigentlich richtig gut um network dabei derrest interessiert mich vor dem video ehrlich gesagt jetzt nicht nicht so viel haben wirhaben wir vielleicht noch benchmarksja genau das ist nicht mal ein bruchteil nicht mal ein bruchteil von zählern das liegt aberdaran dass die pz express bandbreite schlicht und ergreifend zu zu gering istman kannman braucht überhaupt keine 10 gigabit karte man kann sich einfach eine 2, genau man kannman kann 2,5 oder eine 5 gigabit karte nehmen das ist dann von der infrastruktur je nachdemwas man hat auch billiger aber es hat eh kaum einen 2,5 g oder 5 g router bei sich daheimoder switch da ist es tatsächlich 10 g einfacher zu bekommen der große vorteil warum sich dasüber kurz oder lang doch durchsetzen wird ist weil du die kabel verwenden kannst dieschon da sind für 10 gigabit brauchst du meistens neue kabel oder wenn du glück hastes kurz genug ist kannst du 10 g auch mit alten kupferkabel machen aber eher nicht oderdu brauchst glasfaserkabel 2,5 und 5 g kannst du halt über die ganzen alten oder 15 kupferkabelmachen und das ist halt für den heimgebrauch einfacherrtx 4090 das wird doch im leben nicht stimmenso also was gucken wir uns den jetzt an ah lockpicking lawyer das muss aus prinzip immerseinnee carlocks interessiere mich nicht was haben wir denn sonst noch ok safe safe öffnencosy cosy safe also das video ist nur 1,30 lang das heißt wir wissen jetzt schon wirddas öffnen sein jepp lockok easy easy easy easy easy easy easy easy easy easy easy easy easy easy easy embarrassingWenn ihr Fragen oder Kommentare habt, schreibt sie in die Kommentare.Wenn euch das Video gefallen hat und ihr mögt mehr von uns sehen, dann abonniert.Und wie immer, habt einen schönen Tag. Danke.Wenn ihr Fragen habt und ihr mögt mehr von uns sehen, dann abonniert.Wenn ihr Fragen oder Kommentare habt, schreibt sie in die Kommentare.Wenn ihr Fragen oder Kommentare habt, schreibt sie in die Kommentare.Wenn ihr Fragen oder Kommentare habt, schreibt sie in die Kommentare.Wenn ihr Fragen oder Kommentare habt, schreibt sie in die Kommentare.Wenn ihr Fragen oder Kommentare habt, schreibt sie in die Kommentare.Okay, er buddelt echt ernsthaft in den Tunnel bei sich unter der Hütte, warum nicht, kannman machen kann man machen war okay ja in deutschland kann man das nicht machen echt nicht na gut indeutschland darfst du vieles nicht machen du darfst auch in deutschland nicht einfach einen baumfällen bei dir auf dem grundstück deswegen darfst du bestimmt auch kein tunnel buddelnbei dir auf dem grundstück illegale unterkellerung ernsthaft sowas gibt esbei uns in deutschland ist es schon echt geil du kannst auf deinem eigenen grundstück noch nichtmachen was du willst der wahnsinn nach china oder ami auswander nähe wir könnten es bei uns einfachmal unseren scheiß zusammen kriegen und den leuten mal ein bisschen mehr freiheit lassensowas zu machen auf ihrem eigenen grundstück so also komm wir gucken so eine battlefield anbisschen dunkel oder der sieht doch gar keine gegnerja alles da in der ask schon schuldet aber da flippt ja voll aus bei den viel vierin one shot on gullin peaks to start us out you don't see that very often on battlefield for nextup its prolosco with some high skill scout helikopter gameplay dropping in a few only inbattlefield moments along the way on a heli action ist langweil ich will keine heli action sehenkeine keine heli action für infanterie action jawoll jawoll schön c4 eintrocknen die musik imhintergrund so muss das sein schön alles wegspringen warum die gegner hinter ihm nichtauf ihn schießen ist nicht weiter zu beachten das detail ich frage mich auf welchem server die immersolche gegner findenauf der anderen seite du hast permanent eigentlich sowas ich meine es sind ja immer nur ausschnittedas kann sein dass das rechtliche game auf den sack gekriegt hat ein cooler ausschnitt das istin battlefield also du hast mal ein battlefield auch durchaus in der runde wo es nicht so gutläuft mal so drei vier minuten wo du übelst uns aber meistens sind es auch richtig gutespieler die immer oben sind jaso muss das seinübrigens übrigens richtig nicedass man also battlefield battlefield 3 und 4 da war ja reken recoil control easy du hastbei den waffen einfach nur im gewissen intervall schießen muss man manchen sogar lauerfeuerund leicht nach unten ziehen fertig kein recoil ich finde ich finde ich finde ich finde es megalangweilig nicht dass man ist nicht dass das nicht gut leute sind aber ich bin heli undflugzeug clips mega sleeper nicht resident sleeper mega sleeperbattlefield 2042 muss ja im prinzip diese map mal fünf sein von der größedas mega resident sleeperer fliegt halt rum und best schiffe ja das ist sicherlich nicht easy vor allem auchpermanent nicht getagelt zu werden oder irgendwie gehe ich finde halt chat clips langweiligman kommt battlefield 224 er war das oktober november habe ich schon wieder vergessendas stimmt das stimmt das hast du das hast du das hast du echt seltenmillikill mit dem kanatwerfer oder direkt direkt impact kills mit dem kanatwerfer sorum wo die granate ist ganz knapp an ihm vorbei die epitose pg das dlc map jadas sind snipe clips die lasse ich mir gefallenwas ist mit dem dude los da oben will er nicht mal auf ihn zurück snipenoder wagen ab der wagen abgut dass sie immer stehen bleiben zwischendurchdas war ein echt nicer headshot das hier das war ein echt nicer headshotnicht schlecht ich hätte fast gedacht es war ein collateraleben ah der erste ist nicht gestorben aber nicer clip das war ein cooler clipganzen snipers natürlich hat die map immer noch die gleichen bugs meinst du es hätteirgendjemand gefixt die letzten acht jahre überer wurde von fußbodenheizung gekillt das erniedrigend von fußbodenheizunggekillt zu werden wieso wie alt wie alt bist du also ich bin jetzt sie noch nichtganz aber fast 37 und wenn ich battlefield spiele dann geht das immer nochwird immer noch gebashed 49 ok dann weiß ich ich habe noch zehn jahre zeit was zuauen danach ist vorbei die lege henne jawollwisst ihr das verstehe ich manchmal nicht warum liegt der typ da der typ eben hierwarum warum liegt er da der da was was was macht er da das es macht doch überhauptkeinen sinn da zu liegen was ist seine mission genau was hat ervor er hat sogar mit mit strenger stream quite a lot can be worth checking out aswir roll up towards the release of 2042 the first is a highlight from goldmoderailway as he has a pretty big kill streak as he usually does but he hitsfive toes in a row here's a few of them as we just look at part of the streakinsane accuracy from one of the best pilots one of the best players inbattlefield 4 man if you make five oh da gutand his final clip is something epic I've actually been in the heli with himwhen he does this little trick on sees a shanghai and I always think we're goingto crash really epic stuff what the fuck okay das ist das ist man nice hillyhilly flying moving on to a locker clip its eros with a huge m249 back rage it'sabout a minute of him just dominating players back rage jawoll zeigt mir die back rageim battlefield 4 im vergleich zu battlefield 3 ist support mit lmgstatsächlich relativ beliebt einfach weil sie nachladen muss und nicht sopressed wirst und leute so pressen kannst im battlefield vier kannst janur mit der lmg leute so pressen wenn ich noch irgendwie das richtig im kopfhabedas ist na also sie machen um kilt sind immer nice zu sehenslightly longer clip für junext in his usual fashion we're gonna be seeing aclip from dusty as he plays on a map and mode combination that we rarely get tosee on the top plays the scope of omen and it's rush now this map is verydifficult to play best player in my my lieblings meine mit abstand lieblingswar im battlefield 4 acr not much cover you do get a couple of buildings hereand there but in terms of the map undulating and having some good cover onat least these m-coms you don't really get it so vehicles can have a field dayagainst you and often you find yourself pinned back if you've got somebody likedust on your team though who is keen to get onto the objectives and just get asmany kills as possible an aggressive infantry player you're in luck this is anice one is he kind of sweeps up the enemy players playing around theobjective just clearing it up for his teameins muss man sagen was sie immerhin bekommen haben im battlefield istrichtig geiler sound oder fällt euch in bettel viel an was kacke sound hatte mirnicht auch wenn die letzten zwei nicht meins waren sound technisch waren diesicherlich auch extrem gut ist next with a streak on shanghai with the m16 a4again it's a rush streak wobei ich ja sagen muss battlefield 3 beziehungsweiseam erster bett company 2 bett company 2 mit war tapes bestelaria but at the same time you've also got a lot of players coming fromdifferent angles it's more players on a smaller part of the map as opposed toconquest where people tend to be spread out a lot more a nice aggressiveinfantry play rana to a com ratodext thanks for watching this episode as a field for top plays gg it'sdas habe ich mir auch gerade gedacht für battlefield hat eine ziemlichniedrige sens ich spiele in bettel field auch absichtlich immer ein bisschenhöher weil ich keinen bock habe hier einmal über schreibt nicht zu kurbelnfür eine halbe drehungdas sind alles die ehemaligen cs pros die quasi erst mal einen kilometer rennenfür eine halbe drehung was war denn eigentlich schlecht anbattlefield 1 kann ich nicht sagen ich habe viel eins nie richtig gespielt hatmich null angesprochen habe die beta gespielt hat mir nicht gefallenund zu sagen war nicht mein fall battlefield 5 habe ich ein bisschengespielt auch in ordnung aber hat mich auch nicht so gecatcht irgendwiedeswegen ich habe echt große hoffnung battlefield 2042 aber wie gesagt nichtvorbestellen und am ende kann sich immer noch scheiße spielen es bringt nix wennein spiel aus ganz vielen guten teilen besteht oder aus aus vielen teilen mitpotential besteht wenn die nicht zu einem gesamten guten game zusammengefügt werdenund aktuell sieht es halt aus als hätte battlefield 2042 schon viele teile mitpotential aber ob dann ein gutes gesamt game bei rauskommt das müssen sieerst mal beweisen ich ich ich würde es mir wünschen ja dassschon wieder ein battlefield habe wo ich bock habe jeden tag den krassenbattlefield crime zu machen in your faceimmer noch ei ist nicht so als hätte nicht er auch gute spiele gemacht oderraus raus published die werden die werden garantiert die haben wir schongesehen dass sie die war zone monetisierung geschichte machen mitseason passes und sowas wie viel sollte ein frischer software entwickler der1,5 jahre als werkstätten der firma gearbeitet verdienen was sagst duwie gesagt ich kann da nicht wirklich viel zu sagen es kommt ganz entscheidenddarauf an in welche regionen und in welcher branche du bistich kann es echt schlecht sagen es gab bei heise erst letztens nur um frage jahelium meinung habe ich schon gehört über laura aber ich glaube nicht dassdas irgendwie was wirdaber ich habe hunger und zwar ist es 12 bin ich schon an 220bock ich bock marke mir das mal sessions session kw besser name alle tabsgebucht macht weil ich glaube ich gehe mir jetzt was zu essen machen und ichnehme nachher noch ein video auf wie gesagt ich wollte ihnen video aufnehmenzu diesem zu diesem cheat geschichten was level cap da auch gezeigt hatvöllig ist ein interessantes thema und ihr habt mich eben ihr habt mich auf diepaar ideen gebracht im chat heute für neues video videos einmal einmal dassich über mein eigenes vorstellungsgespräch damals zurausbildung erzählen könnte könnte da gab es ein bisschen mehr zu erzählen wasich im stream gemacht habe plus ich fand das ist eigentlich auch ein gutes themagewesen so was da was aktuell schief läuft so mit vorstellungsgesprächen sodiese ganze wie viel smarties passen in einen smart und und so was dass ichviele viele firmen für das nächste nächste google oder facebook haltenobwohl sie irgendeine software klitsche aus aus in einem kaff sindgucken wir mal die silicon valley habe ich nicht gesehenist das nicht so eine comedy serie da habe ich ein paar ausstätte davongesehen ist das die ist das die serie wo eswo es dieses diese diese sagen wir mal in anführungsstrichen berühmte berühmteszenen gibt wo sich der typ mit seiner freundin drüber streitet ob imax oderwimwas ist das ok ja da kenne ich nur diesen ausschnittso schauen wir mal wer ist ein ordentlicher hosten hier der frasier istnicht da der frasier spiel wieder irgendwelchemobile games da will er eh nicht von mir gehostet werdenich gehe ich gehe jetzt auf ich gehe was zu essen machen bis denn wir sehen unszu", "segments": [{"id": 1, "start": 90.0, "end": 114.64, "text": "So, da bin ich wieder, ach ja, ich sehe gerade, ich bin halt sogar relativ früh, normalerweise"}, {"id": 2, "start": 114.64, "end": 124.64, "text": "bin ich ja erst nach 10 on, 08.07.9 monat, huge subscriptions, langeschön für den sub."}, {"id": 3, "start": 174.64, "end": 180.96, "text": "Also, was gucken wir uns denn heute an? Ist irgendwas passiert letzten Tage über, wo ich"}, {"id": 4, "start": 180.96, "end": 185.56, "text": "noch mal einen Senf zu geben muss, bevor wir uns anfangen Videos anzuschauen? Ich weiß gar nicht,"}, {"id": 5, "start": 185.56, "end": 194.16, "text": "war noch irgendwas? Lass mal überlegen. Ja, dass die ganzen China Miner ihre Grafikkarten verkaufen,"}, {"id": 6, "start": 194.16, "end": 197.8, "text": "das habt ihr wahrscheinlich mitbekommen, ne? Die Chinesen, also die chinesischen,"}, {"id": 7, "start": 197.8, "end": 205.56, "text": "China-Chinesen haben ja Krypto-Mining verboten und jetzt verkaufen alle Chinesen ihre Grafikkarten."}, {"id": 8, "start": 205.56, "end": 215.96, "text": "Aber es wird uns nichts bringen, weil die verkaufen das alle auf so einem chinesischen eBay,"}, {"id": 9, "start": 215.96, "end": 221.96, "text": "wo du die Sachen selbst abholen musst und sowas oder in China wohnen und das ist halt für uns"}, {"id": 10, "start": 221.96, "end": 241.68, "text": "recht uninteressant. Ach ja, und was ich auch witzig fand, ist diese News hier. Warte mal,"}, {"id": 11, "start": 241.68, "end": 250.88, "text": "die muss ich euch gerade mal zeigen. Es hat auch letztens einer im Stream schon gepostet,"}, {"id": 12, "start": 250.88, "end": 260.16, "text": "aber jetzt kam das Behalse auch. Ups, warum geht das jetzt nicht? Warte mal. Hat wieder"}, {"id": 13, "start": 260.16, "end": 266.28, "text": "irgendeine E-Mail-Anhänge geöffnet bei einer Stadtverwaltung. Also ich könnte wetten,"}, {"id": 14, "start": 266.28, "end": 272.16, "text": "es hat wieder irgendeine E-Mail-Anhänge geöffnet. Ich frag mich immer, vor allem diese Bilder dabei,"}, {"id": 15, "start": 272.16, "end": 286.92, "text": "WTF, Alter. Ja, hab ich vor ein paar Tagen gelesen, also da weiß ich auch nicht,"}, {"id": 16, "start": 286.92, "end": 291.84, "text": "was die immer machen. Aber gut, ich mein, wenn man nur Faxgeräte gewohnt ist,"}, {"id": 17, "start": 291.84, "end": 301.68, "text": "kann sowas ja schon mal passieren. Ja, ihr wisst ja, dass eigentlich bis 2020 Deutschland"}, {"id": 18, "start": 301.68, "end": 309.84, "text": "führend ist im Bereich von digitalen Ämtern und digitalen Behörden. Wusstet ihr das eigentlich"}, {"id": 19, "start": 309.84, "end": 314.32, "text": "schon, dass wir da führend sind? Also führend bedeutet jetzt aktuell gesehen, dass man die"}, {"id": 20, "start": 314.32, "end": 322.16, "text": "Sachen per Fax schickt, aber laut eigener Aussage unserer Chefs sind wir führend in dem Bereich."}, {"id": 21, "start": 322.16, "end": 335.24, "text": "Ja, guck da, da hat er es gesagt. Bis 2021 ist Deutschland komplett digital, hat er 2017"}, {"id": 22, "start": 335.24, "end": 345.24, "text": "erzählt. Also mal ernsthaft, wer hätte das nicht geglaubt? Also ich war komplett felsenfest davon"}, {"id": 23, "start": 345.24, "end": 353.08, "text": "überzeugt, das wird so kommen 2017. Genauso wie wir auch bis 2018 50 Mbit für alle Haushalte"}, {"id": 24, "start": 353.08, "end": 359.2, "text": "haben, hätte ich auch nie daran gezweifelt, dass das passieren würde. Also es war mir klar,"}, {"id": 25, "start": 359.2, "end": 376.8, "text": "dass das es wird alles eintreten. Ist dumm geschwätzt immer. Aber ansonsten ist die Woche"}, {"id": 26, "start": 376.8, "end": 386.92, "text": "glaube ich nicht allzu viel spannendes passiert. Ja, das stimmt voll, das stimmt voll. Was halt"}, {"id": 27, "start": 386.92, "end": 391.2, "text": "witzig ist, gerade jetzt zu Corona Zeiten wäre das echt praktisch gewesen, wenn die ganzen"}, {"id": 28, "start": 391.2, "end": 394.92, "text": "Ämter digital ein bisschen besser aufgestellt wären und sich nicht irgendwelche Daten per"}, {"id": 29, "start": 394.92, "end": 402.24, "text": "Fax, per Fax checken müssen. Ihr müsst euch das mal überlegen. Fax, Alter, Fax, das ist so alt,"}, {"id": 30, "start": 402.24, "end": 408.76, "text": "also die, oh warte, ich muss die Musik einen kleinen Tick klar sagen. Fax, das ist so alt,"}, {"id": 31, "start": 408.76, "end": 413.16, "text": "ich hab noch nicht mal mehr einen Fax, also ich hab noch nicht mal die Möglichkeit, Faxe zu"}, {"id": 32, "start": 413.16, "end": 418.32, "text": "empfangen bei mir. Ich hab theoretisch einen Multifunktionsdrucker, der glaube ich,"}, {"id": 33, "start": 418.32, "end": 422.64, "text": "ich bin mir gar nicht sicher, einen Anschluss hat für einen Fax, aber ich wüsste gar nicht,"}, {"id": 34, "start": 422.64, "end": 425.64, "text": "wo ich das reinstecken soll. Da müsste ich den Drucker irgendwie an die Fritzbox anschließen"}, {"id": 35, "start": 425.64, "end": 434.56, "text": "oder so. Wozu? Ich will überhaupt keine Faxe empfangen. Ja, das ist alles gelabert,"}, {"id": 36, "start": 434.56, "end": 440.24, "text": "sieht man ja jetzt auch immer schön. Es wird viel gelabert. Ihr wisst ja auch das. Moment,"}, {"id": 37, "start": 440.24, "end": 454.68, "text": "Moment, Leit, Moment, Deutschland, Spiele, Leitmarkt, soll das hier, ja, also Deutschland"}, {"id": 38, "start": 454.68, "end": 460.88, "text": "soll ja auch Leitmarkt für Computerspiele, also nicht wie Leiden, sondern wie Anführen,"}, {"id": 39, "start": 460.88, "end": 466.36, "text": "Leitmarkt soll Deutschland werden, was Computerspiele angeht. Ich weiß nicht,"}, {"id": 40, "start": 466.36, "end": 478.52, "text": "in welcher Fantasiewelt man sich da bewegt. Ja, aber es soll so sein, ja."}, {"id": 41, "start": 478.52, "end": 488.84, "text": "Das stimmt nicht. Du kannst mittlerweile auch digital Sachen unterschreiben und das zählt."}, {"id": 42, "start": 488.84, "end": 499.2, "text": "Sonst müsste ich ja jegliche NDA oder sonst was müsste ich per Fax an irgendeinen Hersteller"}, {"id": 43, "start": 499.2, "end": 503.08, "text": "schicken oder so. Du kannst das mittlerweile auch schon digital unterschreiben, das funktioniert."}, {"id": 44, "start": 503.08, "end": 512.8, "text": "Telefonanschluss. Ja, theoretisch bräuchte, also du brauchst eine Telefonnummer, du brauchst"}, {"id": 45, "start": 512.8, "end": 515.68, "text": "eine Telefonnummer. Es geht aber auch über VoIP, wenn das der Anbieter richtig macht."}, {"id": 46, "start": 515.68, "end": 522.72, "text": "Also wenn der Anbieter, Telekom und Vodafone, die haben ja nur Voice-Over-IP, die haben ja"}, {"id": 47, "start": 522.72, "end": 529.76, "text": "auch gar kein richtiges Telefon mehr. Ich glaube, die Telekom bietet dir immer noch,"}, {"id": 48, "start": 529.76, "end": 534.96, "text": "wenn du nur einen analogen Anschluss haben willst, machen die das immer noch. Aber spätestens ab dem"}, {"id": 49, "start": 534.96, "end": 543.32, "text": "nächsten Telekom, krass, ist es VoIP intern. Ja, das funktioniert, aber wozu Fax? Fax ist"}, {"id": 50, "start": 543.32, "end": 549.52, "text": "halt echt Pains-Champ. Gut, wenn du keine Telefonnummer hast, dann ist das natürlich mit Fax nichts."}, {"id": 51, "start": 549.52, "end": 560.36, "text": "Um nochmal den Rap-God aus meinem Arbeitsamtkurs von damals zu zitieren, machst du Faxen,"}, {"id": 52, "start": 560.36, "end": 566.76, "text": "mache ich dich mit Achsen. Dann kriegt das Wort Fax mal ganz neue Bedeutung."}, {"id": 53, "start": 566.76, "end": 578.36, "text": "Welches deiner Repos ist eigentlich der Preis-Champ? Der Preis-Champ ist nirgendswo auf GitHub. Den"}, {"id": 54, "start": 578.36, "end": 587.0, "text": "gibt's nicht. Der Preis-Champ ist closed source, Leute. Dass ich das maximal monetarisieren kann,"}, {"id": 55, "start": 587.0, "end": 594.44, "text": "nur dass ich überhaupt kein Geld dafür bezahle. Kein Geld dafür bekomme. Bezahlen tue ich dafür,"}, {"id": 56, "start": 594.44, "end": 604.76, "text": "aber ich bekomme kein Geld dafür. Ja, das mit der Trans 3070 unter 80,"}, {"id": 57, "start": 604.76, "end": 608.6, "text": "das ist das Problem, dass der Crawler die Shops unterstützen muss und da haben die"}, {"id": 58, "start": 608.6, "end": 612.08, "text": "immer Probleme, deutsche Shops zu unterstützen. Vielleicht gibt es das auch mittlerweile."}, {"id": 59, "start": 612.08, "end": 632.08, "text": "Was ich auch lustig finde, dass sie gerade den deutschen Computerspielepreis hervorheben,"}, {"id": 60, "start": 632.08, "end": 636.0, "text": "das finde ich immer wieder lächerlich. Der deutsche Computerspielepreis ist eines der"}, {"id": 61, "start": 636.0, "end": 642.48, "text": "unwichtigsten, unbedeutendsten und peinlichsten Veranstaltungen, die wir so zu bieten haben."}, {"id": 62, "start": 642.48, "end": 653.32, "text": "Es ist an heißer Luft kaum noch zu überbieten. Ich habe mich an letztes Jahr auch schon mal"}, {"id": 63, "start": 653.32, "end": 658.08, "text": "darüber ausgelassen, aber wisst ihr, was bestes Multiplayer-Game ist laut dem deutschen"}, {"id": 64, "start": 658.08, "end": 669.72, "text": "Computerspielepreis? Das beste Multiplayer-Game laut dem deutschen Computerspielepreis ist"}, {"id": 65, "start": 669.72, "end": 689.32, "text": "eine Nintendo Game, was den Fortschritt verliert, wenn jemand online aus der Session droppt."}, {"id": 66, "start": 689.32, "end": 696.52, "text": "Es ist wie um alles in der Welt kann Animal Crossing bestes Online-Game sein. Dann hätten"}, {"id": 67, "start": 696.52, "end": 705.12, "text": "sie ja meinetwegen lieber Warzone oder irgendetwas ernstzunehmendes Online-Game, was 2020 rauskam,"}, {"id": 68, "start": 705.12, "end": 716.64, "text": "nehmen sollen. Zu Zeiten als Crysis da was bekommen hat, war das in Ordnung, da hatten"}, {"id": 69, "start": 716.64, "end": 722.24, "text": "wir auch was. Was gibt es aktuell für Games aus Deutschland? Anno war mal aus Deutschland,"}, {"id": 70, "start": 722.24, "end": 726.96, "text": "ich weiß nicht, ob Anno noch aus Deutschland ist. Crytek gibt es immer noch, die machen"}, {"id": 71, "start": 726.96, "end": 744.68, "text": "aber gerade ja nur Dings hier, dieses Wild West Ding, Hunt Showdown oder so. Ansonsten"}, {"id": 72, "start": 744.68, "end": 754.36, "text": "wüsste ich nicht, was Crytek Moba aus dem ist nie was geworden. Ansonsten was gibt es"}, {"id": 73, "start": 754.36, "end": 780.8, "text": "denn noch für größere deutsche Studios? Wir haben dazu nicht mal einen deutschen Artikel"}, {"id": 74, "start": 780.8, "end": 787.44, "text": "auf Wikipedia und der internationale Artikel über die Video-Games-Industrie in Deutschland"}, {"id": 75, "start": 787.44, "end": 791.64, "text": "ist schon ziemlich... Es stimmt, die Gothic-Leute haben wir noch, aber da weiß ich nicht, ob"}, {"id": 76, "start": 791.64, "end": 796.4, "text": "sie überhaupt noch gibt. Ach doch, die haben LX gemacht letztens. Ich weiß aber nicht,"}, {"id": 77, "start": 796.4, "end": 814.12, "text": "ob die noch in Deutschland am Start sind. Ok, Games Publisher, Games Developer of Germany,"}, {"id": 78, "start": 814.12, "end": 818.4, "text": "ok, wen haben wir da? Ubisoft Blue Bay, das sind die Siedler-Leute, genau, Ubisoft Berlin,"}, {"id": 79, "start": 818.4, "end": 823.2, "text": "ok, ich wusste nicht, dass sie mit an Far Cry machen. Crysis, das wussten wir. Ach hier,"}, {"id": 80, "start": 823.2, "end": 832.44, "text": "die Adventure-Stells-Kram, genau. Sagt mir jetzt gerade nichts, aber das ist auch eher"}, {"id": 81, "start": 832.44, "end": 839.72, "text": "nicht so meine Lords of the Fallen, war das nicht so ein Dark Souls-Klon? Ja doch, ich"}, {"id": 82, "start": 839.72, "end": 847.04, "text": "erinnere mich wieder. Stimmt, die gibt es auch noch, die habe ich jetzt verwechselt."}, {"id": 83, "start": 847.04, "end": 851.16, "text": "Die gibt es auch noch, die hatten aber glaube ich nie bisher so den Riesenhit. Die Gothic-Leute"}, {"id": 84, "start": 851.16, "end": 858.2, "text": "gibt es, genau, die gibt es immer noch. Stimmt, die gibt es auch noch, die habe ich jetzt"}, {"id": 85, "start": 858.2, "end": 867.2, "text": "gar nicht. Was haben die in letzter Zeit so gemacht? Nix. Ok, also es hält sich durchaus"}, {"id": 86, "start": 867.2, "end": 880.08, "text": "in Grenzen. Das war gar nicht so schlecht, das habe ich auch nicht gesagt. Kann mich"}, {"id": 87, "start": 880.08, "end": 886.56, "text": "nur dran erinnern, dass das der Dark Souls, man kann es ja nicht Dark Souls, na doch, man"}, {"id": 88, "start": 886.56, "end": 892.76, "text": "kann es so ein bisschen Dark Souls-Klon nennen. Also das sehr stark Dark Souls inspirierte"}, {"id": 89, "start": 892.76, "end": 900.44, "text": "Game. Das ist auch so eine Redewendung, die mich ja immer nervt. Sobald ein Spiel nicht"}, {"id": 90, "start": 900.44, "end": 906.76, "text": "easy as fuck ist, ist es sofort Dark Souls. Keine Ahnung, irgendeiner baut einen Jump"}, {"id": 91, "start": 906.76, "end": 911.08, "text": "and Run, was nicht easy as fuck ist. Und dann kommen dann die ersten an, das Dark Souls"}, {"id": 92, "start": 911.08, "end": 916.44, "text": "der Jump and Runs. Da kriege ich ja auch immer richtig Cringe-Anfälle. Das ist so ausgelutscht,"}, {"id": 93, "start": 916.44, "end": 921.16, "text": "diese Redewendung mittlerweile. Die ist glaube ich so ausgelutscht, dass sie noch nicht mal"}, {"id": 94, "start": 921.16, "end": 925.36, "text": "Computerbild-Spiele. Gibt es überhaupt noch Computerbild-Spiele verwendet? Oh, gibt es"}, {"id": 95, "start": 925.36, "end": 934.64, "text": "ja noch Computerbild-Spiele. Tatsächlich, nee, gibt es die noch? Jetzt lesen immer noch"}, {"id": 96, "start": 934.64, "end": 946.2, "text": "eine Million Leute. Okay, ja, Computerbild-Spiele gibt es noch. Was, ich muss jetzt gerade noch"}, {"id": 97, "start": 946.2, "end": 950.68, "text": "was anderes gucken. Twitch. Ich muss mal kurz gucken, was auf Twitch gerade angesagt ist."}, {"id": 98, "start": 950.68, "end": 962.0, "text": "Spielen die Leute noch Souls-Games? Aber warum sieht denn die Twitch-Seite so komisch aus"}, {"id": 99, "start": 962.0, "end": 968.6, "text": "auf einmal? Kann ich mir nicht einfach anzeigen lassen, was die meisten gesehene Spiele sind?"}, {"id": 100, "start": 968.6, "end": 973.08, "text": "War das nicht sonst immer auf der Startseite, sodass man einfach die meist gesehene Spiele"}, {"id": 101, "start": 973.08, "end": 982.76, "text": "hat? Ah, hier. LOL ist wieder vorne GTA. Warum ist denn Valorant auf einmal so weit oben?"}, {"id": 102, "start": 982.76, "end": 990.56, "text": "Läuft da gerade irgendwas? Ah, da läuft irgendeine E-Sport-Stells hier. Koreanisches E-Sport-Stells."}, {"id": 103, "start": 990.56, "end": 996.08, "text": "Okay, weil ansonsten ist Valorant zwar gut dabei, aber nicht ganz vorne mit dabei. Apex"}, {"id": 104, "start": 996.08, "end": 1003.28, "text": "normalerweise auch nicht ganz ganz oben. Okay, da ist ein Stream allein schon mit 22k, alles"}, {"id": 105, "start": 1003.28, "end": 1008.88, "text": "klar. Die Fortnite immer noch dabei. Was ich immer erstaunlich finde, dass ich, obwohl"}, {"id": 106, "start": 1008.88, "end": 1013.36, "text": "die Leute immer sagen wollten, World of Warcraft übelst Dead, Dead und Rip, Woe und so, das"}, {"id": 107, "start": 1013.36, "end": 1017.04, "text": "scheint immer noch ganz gut zu laufen. Gut, ich meine, irgendwo muss Blizzard ja auch Geld"}, {"id": 108, "start": 1017.04, "end": 1022.52, "text": "verdienen und Woe ist halt gerade mit Abo-Modell so eine schöne Einnahmequelle, wo man weiß,"}, {"id": 109, "start": 1022.52, "end": 1026.56, "text": "das fällt nicht von heute auf morgen weg. Der Scam Train ist am Start. Sorry, danke"}, {"id": 110, "start": 1026.56, "end": 1029.44, "text": "Leute für die ganzen Subs. Ich muss mal kurz nachgucken, wer jetzt eigentlich alles am"}, {"id": 111, "start": 1029.44, "end": 1057.2, "text": "Start ist. Game Up, Dankeschön für den Prime-Sub. 14 Monate, das ist ja schon Massive Hyper-Subscription"}, {"id": 112, "start": 1057.2, "end": 1069.28, "text": "hier. Der Eichler ist am Start, 23 Monate schon. Dann haben wir Slim Beats ist am Start und"}, {"id": 113, "start": 1069.28, "end": 1073.28, "text": "der Max, den hatten wir schon. Nice Leute, dass ihr alle wieder da seid und natürlich"}, {"id": 114, "start": 1073.28, "end": 1083.4, "text": "für den Point, dass ihr beim Scam Train mitmacht. Schön, dass euch Twitch gebaitet hat, wieder"}, {"id": 115, "start": 1083.4, "end": 1101.48, "text": "eure Prime-Sub auszugeben. 18 Anzeige ist raus, Chain-Lore. Dis-Abo. Nee, Woe ist Monats-Abo,"}, {"id": 116, "start": 1101.48, "end": 1108.04, "text": "das ist nicht eine kleine Usergruppe. Woe hat ziemlich viele Spieler immer noch. Ich"}, {"id": 117, "start": 1108.04, "end": 1111.72, "text": "meine, ich veröffentliche keine Spielerzahlen mehr, aber du kannst davon ausgehen, das ist"}, {"id": 118, "start": 1111.72, "end": 1118.4, "text": "jetzt nicht innerhalb von ein paar Jahren von 9 Millionen auf 5000 gedroppt oder so."}, {"id": 119, "start": 1118.4, "end": 1123.2, "text": "Also, ich habe keine Ahnung, wie viele Spieler Woe noch hat, aber es ist bestimmt ordentlich"}, {"id": 120, "start": 1123.2, "end": 1129.72, "text": "und selbst wenn man mal ganz, ganz klein stapelt und sagen, keine Ahnung, die haben nur noch"}, {"id": 121, "start": 1129.72, "end": 1132.6, "text": "500.000 Spieler, was wahrscheinlich viel zu wenig ist, die haben bestimmt noch deutlich"}, {"id": 122, "start": 1132.6, "end": 1140.8, "text": "mehr und allein schon das gibt ja 5 Millionen im Monat, wenn die nur 10 Euro bezahlen und"}, {"id": 123, "start": 1140.8, "end": 1148.28, "text": "es sind wahrscheinlich deutlich, deutlich mehr. Woe ist schon ordentlich. Was mich bei"}, {"id": 124, "start": 1148.28, "end": 1153.2, "text": "Woe, ich habe es nie richtig großartig gespielt, muss ich sagen, ich habe andere MMOs zwar"}, {"id": 125, "start": 1153.2, "end": 1156.64, "text": "durchgesuchtet, aber Woe habe ich nie so richtig reingefunden. Natürlich habe ich ein bisschen"}, {"id": 126, "start": 1156.64, "end": 1161.24, "text": "gespielt, aber nie wirklich großartig. Was mich an Woe so vom Beobachten ein bisschen"}, {"id": 127, "start": 1161.24, "end": 1164.32, "text": "nervt, ist, dass die wirklich versuchen, alles Mögliche zu monetarisieren. Also, die haben"}, {"id": 128, "start": 1164.32, "end": 1190.4, "text": "ja wirklich alles monetarisiert, was geht und das finde ich übrigens nicht gut, weil"}, {"id": 129, "start": 1190.4, "end": 1196.0, "text": "ich bin der Meinung, gerade Spiele, ich propagiere ja selbst immer, ich sage, für MMOs ist eigentlich"}, {"id": 130, "start": 1196.0, "end": 1203.68, "text": "das beste Modell monatlicher Subscription oder meinetwegen Pay to Play, also man kauft"}, {"id": 131, "start": 1203.68, "end": 1210.72, "text": "ein Spiel, man kauft ein Addon und kann ja so viel spielen, aber ich sage immer, Monthly"}, {"id": 132, "start": 1210.72, "end": 1216.4, "text": "Subscription, Monthly Fee ist so das beste für MMOs, allerdings nicht, wenn du dann"}, {"id": 133, "start": 1216.4, "end": 1225.24, "text": "alles andere auch noch dazu machst. Was Addons? Natürlich sind Addons von Blizzard. Ich meine"}, {"id": 134, "start": 1225.24, "end": 1231.64, "text": "nicht, ich meine jetzt nicht irgendwelche UI Addons, ich meine sowas wie, keine Ahnung,"}, {"id": 135, "start": 1231.64, "end": 1236.8, "text": "was war das letzte Woe Addon, was rausgekommen ist? Shadowlands. Das musst du immer noch"}, {"id": 136, "start": 1236.8, "end": 1243.96, "text": "kaufen oder? Da reicht keine monatliche Gebühr. Du bezahlst Monatgebühr, du musst Addons"}, {"id": 137, "start": 1243.96, "end": 1250.96, "text": "kaufen und dann hast du noch ein Microtransaction Store. Also die monetarisieren wirklich alles,"}, {"id": 138, "start": 1250.96, "end": 1257.56, "text": "was irgendwie geht. Das finde ich auch leicht leicht übertrieben bei Blizzard, zumindest"}, {"id": 139, "start": 1257.56, "end": 1262.92, "text": "bei WoW. Fazit zu Nextcloud 22, ja es hat sich in einigen Bereichen verbessert, die"}, {"id": 140, "start": 1262.92, "end": 1266.96, "text": "Apps sind immer noch ziemlich basic und ich werde wahrscheinlich kein großer Nextcloud"}, {"id": 141, "start": 1266.96, "end": 1277.96, "text": "Fan werden. Genau, genau, die Kombination verstehe ich, das war ja eigentlich früher"}, {"id": 142, "start": 1277.96, "end": 1284.04, "text": "auch normal. Du hattest den MMO, das hat monatlich gekostet, ok, da kannst du sagen, ja die monatlichen"}, {"id": 143, "start": 1284.04, "end": 1290.6, "text": "Kosten ist halt super für den Entwickler, der kann seine Leute bezahlen, der kann seinen"}, {"id": 144, "start": 1290.6, "end": 1294.76, "text": "Support bezahlen, der kann seine Admins bezahlen, seine Entwickler bezahlen, Serverkosten bezahlen"}, {"id": 145, "start": 1294.76, "end": 1300.24, "text": "und das Spiel quasi pflegen, erweitern, sonst wie. Und dann setzt man sich halt auch nebenbei"}, {"id": 146, "start": 1300.24, "end": 1305.36, "text": "noch ran mit einem eigenen Team und macht eine Expansion, die man verkauft, wie ein"}, {"id": 147, "start": 1305.36, "end": 1310.4, "text": "extra Game. Das verstehe ich, das finde ich auch in Ordnung, was ich aber auch richtig"}, {"id": 148, "start": 1310.4, "end": 1314.72, "text": "assi finde, ist, dass du dann noch anfängst mit irgendwelchen Microtransactions. Levelboost"}, {"id": 149, "start": 1314.72, "end": 1320.52, "text": "übrigens, das in Kombination, das ist ein absolutes Unding. Plan ist heute, wir gucken,"}, {"id": 150, "start": 1320.52, "end": 1325.4, "text": "was wir immer sonntags morgens machen, ich schwätze ein bisschen, wir gucken Videos dabei,"}, {"id": 151, "start": 1325.4, "end": 1337.84, "text": "das ist ein absolutes Unding. Gerade Levelboosts, also wenn man ein Pay2play mit Subscription-Modell"}, {"id": 152, "start": 1337.84, "end": 1343.16, "text": "hat, dann musst du, aus meiner Sicht ist das Spiel sonst nicht spielenswert, dann musst"}, {"id": 153, "start": 1343.16, "end": 1350.5, "text": "du sicherstellen, dass das Spiel so designt ist und so optimiert ist, dass es darauf ausgelegt"}, {"id": 154, "start": 1350.5, "end": 1357.92, "text": "ist, dass du ohne zusätzliche Hilfe die Dinger in-Game erreichen kannst mit dem nötigen"}, {"id": 155, "start": 1357.92, "end": 1362.28, "text": "Einsatz-Zeitaufwand, wie die Spiele-Designer sich das gedacht haben. Das heißt, wenn man"}, {"id": 156, "start": 1362.28, "end": 1368.62, "text": "sagt, okay, jeder der die Monatsgebühr bezahlt, sollte in-Game die gleichen Möglichkeiten"}, {"id": 157, "start": 1368.62, "end": 1373.6, "text": "haben und die gleichen Chancen haben und nicht noch zusätzlich durch Microtransactions"}, {"id": 158, "start": 1373.6, "end": 1377.0, "text": "den ganzen Kram boosten lassen, weil sonst stellst du das ganze Modell irgendwie, ich"}, {"id": 159, "start": 1377.0, "end": 1381.92, "text": "weiß, es ist ja offensichtlich, dass es funktioniert, also sonst stellt sich aus meiner Sicht die"}, {"id": 160, "start": 1381.92, "end": 1392.04, "text": "Frage, warum überhaupt? Das finde ich halt kacke. Und gerade bei WoW Classic, wo ja so"}, {"id": 161, "start": 1392.04, "end": 1403.56, "text": "die Oldschool Experience im Vordergrund stehen soll, mit Leveln und Social Aspekt ist es"}, {"id": 162, "start": 1403.56, "end": 1410.8, "text": "jetzt natürlich noch doppelt bescheuert, ein Levelboost zu machen. Also ich kann nicht"}, {"id": 163, "start": 1410.8, "end": 1415.72, "text": "von World of Warcraft reden, ich kann bloß zum Beispiel von Dark Age of Camelot reden,"}, {"id": 164, "start": 1415.72, "end": 1420.6, "text": "was ich hier über 10 Jahre gespielt habe. Die GMs, die wurden beschissen bezahlt, das"}, {"id": 165, "start": 1420.6, "end": 1427.76, "text": "weiß man mittlerweile, die wurden beschissen bezahlt, der Europa Publisher war ein richtig"}, {"id": 166, "start": 1427.76, "end": 1435.16, "text": "großer Kacklan, aber die GMs haben sich abends von daheim oder nachts von daheim teilweise"}, {"id": 167, "start": 1435.16, "end": 1439.44, "text": "eingeloggt und ich weiß nicht, ob die das jemals bezahlt bekommen haben, hoffe ich mal"}, {"id": 168, "start": 1439.44, "end": 1445.72, "text": "zumindest, eingeloggt, um Leute aus einem verbacken Dungeon rauszuteleportieren und"}, {"id": 169, "start": 1445.72, "end": 1456.76, "text": "sowas. Zumindest da kann ich sagen, es gibt schon GMs mit Leib und Seele, die wirklich"}, {"id": 170, "start": 1456.76, "end": 1465.16, "text": "zum umfallen Game Mastern sind. 27 Monate, Huge Subscription hier, IQ++++++ für den"}, {"id": 171, "start": 1465.16, "end": 1473.2, "text": "Chat. Der Scamtrain ist auf Level 2, Leute, wir haben noch eine Minute Zeit den Scamtrain"}, {"id": 172, "start": 1473.2, "end": 1477.68, "text": "voll zu machen. Wenn der Scamtrain voll ist, dann fangen wir auch an Videos zu gucken und"}, {"id": 173, "start": 1477.68, "end": 1482.32, "text": "ich laber euch nicht weiter voll, wobei vielleicht sind die Leute auch gerade da, man weiß nicht."}, {"id": 174, "start": 1482.32, "end": 1492.32, "text": "Ja, finde ich nicht gut. Auch als Spieler finde ich den Story in Game nicht, was? Den"}, {"id": 175, "start": 1492.32, "end": 1507.68, "text": "Store meinst du wahrscheinlich, ne? Du hast dir das Problem ja schon selbst beantwortet."}, {"id": 176, "start": 1507.68, "end": 1516.24, "text": "Das ist eines der Probleme, die dadurch auftreten. Ja gut, dass es Mounts, Pets und Kosmetik-Shit"}, {"id": 177, "start": 1516.24, "end": 1521.8, "text": "gibt, finde ich auch schlimm, weil Character, man muss mal überlegen, was so ein MMO mit"}, {"id": 178, "start": 1521.8, "end": 1528.96, "text": "ausmacht. Character Customization ist eines der zentralen, oder, oder, so, Character Upgrade"}, {"id": 179, "start": 1528.96, "end": 1535.52, "text": "und Customization ist eines der zentralen Punkte eines MMOs. Wenn ich mir das kaufen"}, {"id": 180, "start": 1535.52, "end": 1540.68, "text": "kann, stelle ich quasi in Frage, warum mache ich den Content überhaupt? Warum soll ich"}, {"id": 181, "start": 1540.68, "end": 1545.04, "text": "den Content machen, wenn ich mir das Mountain im Shop kaufen kann? Warum soll ich einen"}, {"id": 182, "start": 1545.04, "end": 1550.76, "text": "halben Monat grinden für einen One-Time-Event-Mount, wenn ich mir das Mountain ein halbes Jahr später"}, {"id": 183, "start": 1550.76, "end": 1555.72, "text": "auch für 5 Euro oder, na gut, es sind Blizzard-Preise, für 20 Euro im Shop kaufen kann? Das ist"}, {"id": 184, "start": 1555.72, "end": 1562.88, "text": "lächerlich. Der Kram, der muss, wenn das Monthly-Fee ist und wenn das Pay-to-Play ist,"}, {"id": 185, "start": 1562.88, "end": 1569.4, "text": "dann muss das mit dem gleichen Ingame-Aufwand für alle Leute verbunden sein, ohne Abkürzung"}, {"id": 186, "start": 1569.4, "end": 1575.92, "text": "durch den Shop. Und wenn ich eben nur 37-jähriger Boomer bin, der arbeiten gehen muss, Familie"}, {"id": 187, "start": 1575.92, "end": 1580.56, "text": "hat und nur eine Stunde am Tag oder, keine Ahnung, nur mal 4 Stunden am Wochenende spielen"}, {"id": 188, "start": 1580.56, "end": 1585.8, "text": "kann, dann muss ich halt damit leben, dass ich nicht in High-End-Tierrüstung in der"}, {"id": 189, "start": 1585.8, "end": 1593.76, "text": "Hauptstadt rumposen kann. Dann habe ich halt Pech. Dann können halt, keine Ahnung, 20-jährige"}, {"id": 190, "start": 1593.76, "end": 1598.76, "text": "Harzer, die den ganzen Tag 24-7 grinden, haben dann halt In-Game-Mehr. So ist es halt. Aber"}, {"id": 191, "start": 1598.76, "end": 1607.64, "text": "so muss das auch sein. So, das ist meine Meinung dazu. Bounty 20, danke schön für den Prime-Sub."}, {"id": 192, "start": 1607.64, "end": 1615.12, "text": "Übrigens, bei Blizzard, die haben ja noch deutlich mehr verkackt. Könnt ihr euch noch,"}, {"id": 193, "start": 1615.12, "end": 1619.44, "text": "wie gesagt, ich bin bei World of Warcraft nur so stiller an der Seitenlinie, Verfolger,"}, {"id": 194, "start": 1619.44, "end": 1625.2, "text": "könnt ihr euch noch an dieses World of Warcraft-Turnier erinnern, wo die Community technisch Geld"}, {"id": 195, "start": 1625.2, "end": 1630.68, "text": "gesammelt haben und haben gesagt, hey, wir machen jetzt einen Shop für, keine Ahnung,"}, {"id": 196, "start": 1630.68, "end": 1635.32, "text": "Mounts, sonst wie was und ein Teil davon geht an so einen Community oder BlizzCon war das"}, {"id": 197, "start": 1635.32, "end": 1643.12, "text": "sogar, so ein BlizzCon PvP-Turnier und dass wir quasi die Turnierpreise erhöhen können."}, {"id": 198, "start": 1643.12, "end": 1649.4, "text": "Kann sich da noch jemand dran erinnern? Und wo alle davon ausgegangen sind, ja, okay,"}, {"id": 199, "start": 1649.4, "end": 1655.32, "text": "man supportet quasi jetzt mit Shopkäufen das nächste BlizzCon PvP-Turnier, aber Blizzard"}, {"id": 200, "start": 1655.32, "end": 1661.44, "text": "bezahlt auch noch ihre normales Preisgeld. So, die Leute haben wie verrückt im Shop eingekauft,"}, {"id": 201, "start": 1661.44, "end": 1664.52, "text": "ich hoffe, ich gebe das jetzt halbwegs korrekt wieder, das ist schon ein paar Jahre her,"}, {"id": 202, "start": 1664.52, "end": 1668.4, "text": "und dann hat Blizzard gesagt zur BlizzCon, ach ja gut, wir haben ja jetzt so viel Geld"}, {"id": 203, "start": 1668.4, "end": 1674.68, "text": "eingesammelt durch die Shop-Verkäufe, wir geben kein normales Preisgeld mehr, muss ich"}, {"id": 204, "start": 1674.68, "end": 1679.16, "text": "das mal auf der Zunge zergehen lassen. Ein PvP-Turnier von ihrem Game auf ihrer hauseigenen"}, {"id": 205, "start": 1679.16, "end": 1682.88, "text": "Messe bekommt kein Preisgeld von Blizzard selbst für die Gewinner. Was ist denn das"}, {"id": 206, "start": 1682.88, "end": 1694.28, "text": "für lächerliche Aktion? Und das, ja. Willst du den Chat verkaufen? Warum nicht? Der Chat"}, {"id": 207, "start": 1694.28, "end": 1698.48, "text": "ist so high IQ, da könnte man eigentlich mal zu Geld machen. Was macht der 3D-Drucker"}, {"id": 208, "start": 1698.48, "end": 1725.6, "text": "mit? Der ist aus. Ja, das ist ja noch schlimmer. Das ist ja noch dümmer. Dass du exklusive"}, {"id": 209, "start": 1725.6, "end": 1732.16, "text": "Paywall-Geschichten hast, das ist ja noch schlimmer. Wenn ich Monthly-Fee bezahle plus Pay-to-Play-Add-on,"}, {"id": 210, "start": 1732.16, "end": 1735.72, "text": "dann sollte ich eben auch Zugriff haben durch Spielen auf alles, was das Game zu bieten"}, {"id": 211, "start": 1735.72, "end": 1750.28, "text": "hat. Ja, richtig. Die sind selber daran schuld, dass WoW auf dem absteigenden Ast ist. Man"}, {"id": 212, "start": 1750.28, "end": 1753.88, "text": "kann davon abgehen und wenn jetzt jemand sagt, World of Warcraft ist nicht auf dem absteigenden"}, {"id": 213, "start": 1753.88, "end": 1762.12, "text": "Ast, das kann man ja sehen, wie man will, aber allein schon der Fakt, dass Blizzard"}, {"id": 214, "start": 1762.12, "end": 1767.6, "text": "vor ein paar Jahren aufgehört hat, Spielerzahlen zu veröffentlichen. Also immer, immer, wenn"}, {"id": 215, "start": 1767.6, "end": 1772.24, "text": "ein Unternehmen, das vorher Spielerzahlen veröffentlicht hat, auf einmal aus irgendwelchen"}, {"id": 216, "start": 1772.24, "end": 1776.28, "text": "fadenscheinlichen Gründen sagt, sie veröffentlichen keine Spielerzahlen mehr, da hat das immer"}, {"id": 217, "start": 1776.28, "end": 1780.12, "text": "damit was zu tun, dass die Zahlen nicht so geil aussehen, wie man das gerne hätte oder"}, {"id": 218, "start": 1780.12, "end": 1786.16, "text": "wie man da irgendwelchen Investoren Dollarzeichen in die Augen bringen kann. Immer. Das heißt,"}, {"id": 219, "start": 1786.16, "end": 1791.4, "text": "du kannst davon ausgehen, sobald irgendjemand Zahlen veröffentlicht, die immer nach oben"}, {"id": 220, "start": 1791.4, "end": 1795.96, "text": "gehen und sich feiert und auf einmal sagt er, ich veröffentliche keine Zahlen mehr,"}, {"id": 221, "start": 1795.96, "end": 1802.76, "text": "dann kannst du so sicher wie das Arme in der Kirche davon ausgehen, dass die Zahlen aktuell"}, {"id": 222, "start": 1802.76, "end": 1815.04, "text": "nicht mehr stonksen, sondern noch stonk sind. Dota kenne ich mich nicht aus. Aber Dota hat"}, {"id": 223, "start": 1815.04, "end": 1826.32, "text": "auch keine monatliche Gebühr. Ja hat der Chat doch. Also ich bin mir sicher, der Chat"}, {"id": 224, "start": 1826.32, "end": 1833.68, "text": "war sicherlich maßgeblich am Amazon Basic Corona Impfstoff beteiligt. Es ist noch nicht,"}, {"id": 225, "start": 1833.68, "end": 1840.84, "text": "es kommt demnächst. Kennst du dich mit Frauen aus? Ja, wir sind ja bekannt dafür, dass also"}, {"id": 226, "start": 1840.84, "end": 1845.72, "text": "gerade der Chat, so hier der Chat aus 24 sieben Hacker-Man Informatiker Leuten, das ist natürlich"}, {"id": 227, "start": 1845.72, "end": 1854.16, "text": "bekannt für, dass wir hier Next Level Dating Tipps immer raushauen. Wo ist denn der Sebaro,"}, {"id": 228, "start": 1854.16, "end": 1862.88, "text": "der kennt sich aus? Den brauchen wir jetzt. Schaust du eigentlich Serien oder so, wenn"}, {"id": 229, "start": 1862.88, "end": 1873.08, "text": "ja, was? Ja, ja, äh, lass mal überlegen, was habe ich zuletzt geguckt? Ähm, fuck,"}, {"id": 230, "start": 1873.08, "end": 1879.56, "text": "also nicht so oft, aber was habe ich zuletzt geguckt? Ich muss mich immer wieder an Mr."}, {"id": 231, "start": 1879.56, "end": 1889.72, "text": "Robot erinnern, wo ich die erste halbe Staffel mega geil fand und danach kacke. Upload, Upload"}, {"id": 232, "start": 1889.72, "end": 1893.4, "text": "habe ich geguckt, ja, fand ich eigentlich ganz cool, auch wenn es am Ende die letzten"}, {"id": 233, "start": 1893.4, "end": 1899.36, "text": "paar Folgen wieder nachgelassen hat. Ich überlege gerade, was war denn das letzte an Serie,"}, {"id": 234, "start": 1899.36, "end": 1904.4, "text": "was ich geguckt habe, also das letzte neue. Ich gucke mal kurz, ich gucke mal kurz Amazon,"}, {"id": 235, "start": 1904.4, "end": 1915.72, "text": "Zack, Zack, Amazon, your orders. Moment, Moment, Watch. Amazon Prime Video. Bist du dir die"}, {"id": 236, "start": 1915.72, "end": 1921.2, "text": "zweite Witcher Staffel anschauen? Wahrscheinlich, auch wenn ich die erste Witcher Staffel nur"}, {"id": 237, "start": 1921.2, "end": 1936.16, "text": "okay fand. Okay, aha, hier, also Serious, Originals, Alter, warum ist eigentlich die"}, {"id": 238, "start": 1936.16, "end": 1945.96, "text": "Amazon Video App mittlerweile so unübersichtlich? Wo zum Teufel sind Originals? Warum kann man"}, {"id": 239, "start": 1945.96, "end": 1954.48, "text": "da nicht mal nach Serien filmen? Das ging doch immer. Verwirrend. Was machen die denn"}, {"id": 240, "start": 1954.48, "end": 1965.04, "text": "mit der App? Was ich immer mal wieder gucke, ein paar Folgen, ist Dr. House, aber das ist"}, {"id": 241, "start": 1965.04, "end": 1978.16, "text": "ja nicht wirklich neu. Ich kann es euch nicht sagen, weil die Amazon Video App ist einfach"}, {"id": 242, "start": 1978.16, "end": 1995.88, "text": "kacke. Heck wait. Ja, doch nicht. Dann nicht. So, fangen wir mal an. Gucken wir mal ein"}, {"id": 243, "start": 1995.88, "end": 2000.76, "text": "paar YouTube Videos. Ja, also das Amazon. Wisst ihr, was ich auch richtig Müll finde?"}, {"id": 244, "start": 2000.76, "end": 2008.28, "text": "Amazon. Wie heißt das Music Web Player? Ich muss ja mal einen Screenshot von raussuchen."}, {"id": 245, "start": 2008.28, "end": 2020.2, "text": "Gibt es da einen schönen Screenshot von? Ja. Nee, nicht wirklich. Die haben es eher"}, {"id": 246, "start": 2020.2, "end": 2028.56, "text": "doch hier. Also, die haben es geschafft bei Amazon. Nee, das ist nicht das Neue. Das ist"}, {"id": 247, "start": 2028.56, "end": 2033.16, "text": "irgendeine Mac-Geschichte. Zumindest, die haben es ernsthaft geschafft, dass man, man kann"}, {"id": 248, "start": 2033.16, "end": 2037.84, "text": "hier unten normalerweise die Lautstärke regeln bei Amazon Video und die haben es ernsthaft"}, {"id": 249, "start": 2037.84, "end": 2043.4, "text": "geschafft, einen Musik Player zu machen, wo man die Lautstärke nicht richtig regeln"}, {"id": 250, "start": 2043.4, "end": 2046.84, "text": "kann. Das ist bescheuert. Normalerweise ist noch jemand ein Knopf, um die Lautstärke"}, {"id": 251, "start": 2046.84, "end": 2055.08, "text": "zu regeln. Egal, wer es kennt, kennt das UI. Die haben wirklich geschafft, einen Player"}, {"id": 252, "start": 2055.08, "end": 2058.84, "text": "zu machen, wo man die Lautstärke nicht richtig regeln kann. Es hat zwar einen Knopf, um die"}, {"id": 253, "start": 2058.84, "end": 2066.04, "text": "Lautstärke zu regeln, aber du kannst die Lautstärke nicht in Prozent korrekt regeln. Du kannst"}, {"id": 254, "start": 2066.04, "end": 2070.16, "text": "sie immer nur so in 10, in 10 Prozent Schritten regeln. Das heißt, die Musik ist entweder"}, {"id": 255, "start": 2070.16, "end": 2074.92, "text": "zu laut oder zu leise. Ich weiß nicht, ob da irgendeiner bei Amazon da gesessen hat,"}, {"id": 256, "start": 2074.92, "end": 2079.8, "text": "hat sich gedacht. Ach nee, ach nee. Also, das ist ja, das ist ja User nicht zuzumuten."}, {"id": 257, "start": 2079.8, "end": 2083.6, "text": "Die User sind bestimmt zu dumm, die Lautstärke richtig einzustellen. Den müssen wir das abnehmen"}, {"id": 258, "start": 2083.6, "end": 2092.96, "text": "und machen die Lautstärke jetzt nur noch in 10er Schritten. Dann hast du das Problem,"}, {"id": 259, "start": 2092.96, "end": 2101.36, "text": "dass du deine Playlist nicht mehr richtig sortieren kannst. Also geht schon, aber ist"}, {"id": 260, "start": 2101.36, "end": 2104.64, "text": "eklig im Vergleich zu früher. Also es ist keine Ahnung. Ich habe keine Ahnung, was die"}, {"id": 261, "start": 2104.64, "end": 2110.72, "text": "ganzen UI Designer eigentlich machen, alle. Leuchtet mir nicht ein. Chinesische Miner"}, {"id": 262, "start": 2110.72, "end": 2116.36, "text": "verkaufen Grafikkarten zu Sportpreisen habe ich ja gerade gesagt. Das ist zurzeit. Wenn"}, {"id": 263, "start": 2116.36, "end": 2143.32, "text": "man in China wohnt, ist es eine super Gelegenheit, eine Grafikkarte zu bekommen. Ja, das Netflix"}, {"id": 264, "start": 2143.32, "end": 2148.16, "text": "so alles besser, aber ich macht es immer so. Ich habe halt Prime und ich habe mal diese"}, {"id": 265, "start": 2148.16, "end": 2155.0, "text": "Prime Video Geschichte mal dazu geholt. Netflix gucke ich mir immer nur. Netflix mache ich"}, {"id": 266, "start": 2155.0, "end": 2159.16, "text": "mir immer in den Test, aber wenn ich mal was gucken will, die die Witcher Serie habe ich"}, {"id": 267, "start": 2159.16, "end": 2165.2, "text": "auch im Test aber geguckt. Wenn ich das nächste Mal wieder was auf Netflix gucken will, mache"}, {"id": 268, "start": 2165.2, "end": 2169.12, "text": "ich mir einfach nur wieder den Test aber überhaupt kein Problem funktioniert."}, {"id": 269, "start": 2169.12, "end": 2181.96, "text": "Ja, das stimmt. Wobei das vom Konzept her gar nicht mal so weit an der Realität vorbeigeht,"}, {"id": 270, "start": 2181.96, "end": 2187.16, "text": "wenn man sich ein bisschen weiter denkt in ein paar Jahren. Natürlich das, was ich da"}, {"id": 271, "start": 2187.16, "end": 2193.0, "text": "drin gezeigt habe, war natürlich eher nicht realistisch. Alexa kann auch nur in Zehner"}, {"id": 272, "start": 2193.0, "end": 2196.24, "text": "schritten. Ja, da haben die sich gedacht, wenn Alexa das nur in Zehner schritten kann, dann"}, {"id": 273, "start": 2196.24, "end": 2200.64, "text": "brauche ich brauche ich das in einem Web Player mit Maus und Tastatur Bedienung auch. Wie,"}, {"id": 274, "start": 2200.64, "end": 2205.44, "text": "es gibt keine Test Abos mehr? Kann doch nicht sein. Wie gesagt, letzte Witcher Serie habe"}, {"id": 275, "start": 2205.44, "end": 2220.64, "text": "ich im Test aber geguckt. Es gibt keine Test Abos mehr. Was soll das? Anzeige ist raus."}, {"id": 276, "start": 2220.64, "end": 2232.4, "text": "Es gibt keine Tests, das ist aber kacke. Ansonsten bezahle ich es einen Monat, ja. Also wie gesagt,"}, {"id": 277, "start": 2232.4, "end": 2237.4, "text": "die letzte Witcher Serie habe ich über den Test aber geguckt. Wie machst du das mit der"}, {"id": 278, "start": 2237.4, "end": 2247.24, "text": "Telefonnummer? Ja, tja. Wird nicht verraten. Also kennst du die Programmiersprache Open"}, {"id": 279, "start": 2247.24, "end": 2266.68, "text": "Edge Abel? Open Edge Abel, ne, kenne ich nicht. Oh, zeige ich mal her. Hat da einer schlecht"}, {"id": 280, "start": 2266.68, "end": 2279.12, "text": "geschlafen und von Pascal geträumt oder was? Was gibt das, wenn es fertig ist? Damit machst"}, {"id": 281, "start": 2279.12, "end": 2296.96, "text": "du Big Stonks? Ich weiß ja nicht. Und warum sollte man das verwenden? Ne, kenne ich nicht."}, {"id": 282, "start": 2296.96, "end": 2309.16, "text": "Ich wüsste auch nicht, wofür das. Stonks, keine Ahnung. Ja, so kann ich das vorstellen."}, {"id": 283, "start": 2309.16, "end": 2315.52, "text": "Ja, feelsBatman. So, schauen wir uns mal an. Was gucken wir uns denn auf YouTube jetzt an?"}, {"id": 284, "start": 2315.52, "end": 2322.48, "text": "Komm, wir lassen uns als erstes mal wieder von Levelcap gebaden. Das muss jetzt sein."}, {"id": 285, "start": 2322.48, "end": 2334.92, "text": "Der wöchentliche Levelcap gebate. Ja, das habe ich mitbekommen. Das mit den Cheats habe"}, {"id": 286, "start": 2334.92, "end": 2350.64, "text": "ich mitbekommen, da wollte ich auch ein Video drüber machen. Ja. Das ist ein Video, das"}, {"id": 287, "start": 2350.64, "end": 2372.08, "text": "ist ein Video. Das ist eigentlich eine gute Idee und ich wundere mich, dass das nicht früher"}, {"id": 288, "start": 2372.08, "end": 2379.04, "text": "schon jemand gemacht hat. Der Vorteil davon ist, also falls es jetzt zu schnell war, ich"}, {"id": 289, "start": 2379.04, "end": 2384.28, "text": "erkläre nochmal kurz, wie das funktioniert. Also, du greifst den Video-Output mit irgendeiner"}, {"id": 290, "start": 2384.28, "end": 2389.68, "text": "Capture Card ab, dann hast du auf deinem PC eine Software, die das ganze Bild analysiert,"}, {"id": 291, "start": 2389.68, "end": 2396.6, "text": "wo sind Gegner und daraus errechnet ist Controller-Bewegung und den Controller-Input schickst du dann"}, {"id": 292, "start": 2396.6, "end": 2401.12, "text": "wieder an die Konsole. Also, es ist für die Konsole nicht sichtbar, dass du, dass das"}, {"id": 293, "start": 2401.12, "end": 2405.92, "text": "nicht du bist, sondern irgendwie eine Software gesteuert ist. Das ist eigentlich ziemlich"}, {"id": 294, "start": 2405.92, "end": 2410.28, "text": "big brain, die Idee, ist jetzt aber auch jetzt nichts bahnbrechend neues, deswegen wundert"}, {"id": 295, "start": 2410.28, "end": 2416.08, "text": "es mich, dass man noch nicht auf die Idee gekommen ist, vorher das zu machen. Und das"}, {"id": 296, "start": 2416.08, "end": 2422.24, "text": "coole daran ist, dass du theoretisch das erweitern kannst auf jedes Spiel. Du musst halt nur"}, {"id": 297, "start": 2422.24, "end": 2427.24, "text": "die passende AI anbieten dafür oder trainieren. Also, nur in Anführungsstrichen. Also, einfach"}, {"id": 298, "start": 2427.24, "end": 2433.44, "text": "ist das nicht. Aber du kannst das theoretisch erweitern für jedes Spiel. Das heißt, du"}, {"id": 299, "start": 2433.44, "end": 2439.24, "text": "kannst Cheats basteln für Call of Duty, für GTA, für alles mögliche. Und das alles mit"}, {"id": 300, "start": 2439.24, "end": 2449.68, "text": "der gleichen Software. Moin. Also, das ist schon wirklich next level big brain, der Kram."}, {"id": 301, "start": 2449.68, "end": 2456.4, "text": "Ohne Scheiß. Zumindest, es ist nicht zu erkennen für die Konsole, weil es läuft ja nix. Also,"}, {"id": 302, "start": 2456.4, "end": 2462.24, "text": "es ist weder 5, also ne. Wenn du, normalerweise hast du zwei Möglichkeiten, Cheats zu erkennen."}, {"id": 303, "start": 2462.24, "end": 2467.2, "text": "Es ist weder, du erkennst, dass der, also du erkennst den Cheat direkt, dass der läuft."}, {"id": 304, "start": 2467.2, "end": 2471.8, "text": "Sagen wir mal, du cheats den Battlefield oder Counter Strike oder sonst wie und Steam guckt"}, {"id": 305, "start": 2471.8, "end": 2476.0, "text": "im Hintergrund, läuft irgendwie ein Programm, läuft Programm mit spezieller Signatur, was"}, {"id": 306, "start": 2476.0, "end": 2481.24, "text": "auch immer. Das heißt, du weißt direkt nach dem Spieler, dass der den Cheat gerade ausführt."}, {"id": 307, "start": 2481.24, "end": 2486.88, "text": "Oder, dass irgendwas auf sich in dein Game rein gehuckt hat oder was auch immer. Also,"}, {"id": 308, "start": 2486.88, "end": 2490.0, "text": "sprich, du weißt den Cheat direkt nach, das ist natürlich die beste Variante. Da kannst"}, {"id": 309, "start": 2490.0, "end": 2495.68, "text": "nämlich direkt sagen, easy life, ban. So, die nächste Variante ist, bei solchen Cheats,"}, {"id": 310, "start": 2495.68, "end": 2500.64, "text": "die sind ja nicht zu erkennen. Also, du kannst ja solche Cheats auf der Konsole nicht erkennen,"}, {"id": 311, "start": 2500.64, "end": 2505.36, "text": "weil auf der Konsole selbst nichts läuft, was irgendwie Anhaltspunkte bieten wird, dass"}, {"id": 312, "start": 2505.36, "end": 2511.56, "text": "gecheatet wird. Also, die Konsole, die gibt das Bild aus und bekommt Controller Input."}, {"id": 313, "start": 2511.56, "end": 2518.96, "text": "Die Konsole bekommt absolut gar nichts, gar nichts mit davon. So, was du jetzt aber machen"}, {"id": 314, "start": 2518.96, "end": 2524.92, "text": "kannst, du kannst das Ganze natürlich indirekt nachweisen. Zum Beispiel über Statistik."}, {"id": 315, "start": 2524.92, "end": 2529.32, "text": "Wie schnell ist der Typ on target? Wie genau ist er on target? Was ist seine Hitrate im"}, {"id": 316, "start": 2529.32, "end": 2533.8, "text": "Vergleich zu den besten Spielern der Welt? Kannst du verschiedene Sachen machen. Darauf"}, {"id": 317, "start": 2533.8, "end": 2539.08, "text": "kannst du natürlich wieder deine eigene Anti-Cheat-AI trainieren, was dann im Endeffekt darauf"}, {"id": 318, "start": 2539.08, "end": 2551.6, "text": "rausläuft, dass Cheat-AI versus Anti-Cheat-AI am Start ist. Und das wird noch witzig, aber"}, {"id": 319, "start": 2551.6, "end": 2559.88, "text": "direkt nachweisen kannst du es nicht. Ich muss mal kurz die Musik wieder ausmachen."}, {"id": 320, "start": 2559.88, "end": 2565.04, "text": "In Rainbow Six, was? In Rainbow Six werden mittlerweile Spieler wegen einer zu hohen"}, {"id": 321, "start": 2565.04, "end": 2569.12, "text": "Headshotrate gebannt, ob sie cheaten oder nicht. Ja, das ist leider die Früchte, die das Ganze"}, {"id": 322, "start": 2569.12, "end": 2575.88, "text": "so trägt. Sobald du den Kram nicht mehr direkt nachweisen kannst, wird es halt immer mehr"}, {"id": 323, "start": 2575.88, "end": 2579.36, "text": "false positives geben. Also, du wirst halt immer mehr Leute bannen, weil sie halt eine"}, {"id": 324, "start": 2579.36, "end": 2586.36, "text": "zu gute Statistik haben. Deswegen ist das, das ist ein echt schwieriges Gebiet und"}, {"id": 325, "start": 2586.36, "end": 2591.88, "text": "ich glaube aber, dass das die nächsten Jahre über besser wird. Ich glaube, dass umso besser"}, {"id": 326, "start": 2591.88, "end": 2596.36, "text": "das trainiert wird, umso mehr Entwicklung da reinfließt, umso besser wird das Ganze,"}, {"id": 327, "start": 2596.36, "end": 2601.76, "text": "aber es wird nie perfekt werden. Ich meine am besten ist halt, wenn du den Cheat direkt"}, {"id": 328, "start": 2601.76, "end": 2604.84, "text": "nachweisen kannst, aber das wird bei sowas halt nicht funktionieren."}, {"id": 329, "start": 2604.84, "end": 2618.56, "text": "Einfach die Cheat-AI anhand von Pro-Playern trainieren, um legit zu wirken. So einfach"}, {"id": 330, "start": 2618.56, "end": 2625.0, "text": "ist das nicht. So einfach ist das nicht. Du kannst jetzt so eine Cheat-AI nicht programmieren"}, {"id": 331, "start": 2625.0, "end": 2629.12, "text": "zu spielen wie ein Pro-Player. Du kannst sie vielleicht trainieren, die Geschwindigkeit"}, {"id": 332, "start": 2629.12, "end": 2633.44, "text": "im Aim oder in irgendeiner Art und Weise von einem Pro-Player nachzuahmen, aber ein Pro-Player"}, {"id": 333, "start": 2633.44, "end": 2638.84, "text": "hat ja noch andere Sachen. Also, was er denkt während dem Game. Also, das so zu trainieren"}, {"id": 334, "start": 2638.84, "end": 2646.4, "text": "wird schwierig. Das siehst du zum Beispiel auch daran. Es gibt ja mittlerweile League"}, {"id": 335, "start": 2646.4, "end": 2652.44, "text": "of Legend-Bots, wo auch sogar Pro-Gamer sagen, dass es saumäßig schwierig ist, dagegen"}, {"id": 336, "start": 2652.44, "end": 2658.54, "text": "zu spielen und fast nicht mehr möglich ist zu gewinnen, aber die AI spielt halt null"}, {"id": 337, "start": 2658.54, "end": 2665.2, "text": "wie andere Pro-Player. Die spielt komplett anders und jeder Pro kann dir quasi sagen,"}, {"id": 338, "start": 2665.2, "end": 2668.52, "text": "das ist eine AI, die da spielt und sie können trotzdem nicht dagegen gewinnen."}, {"id": 339, "start": 2668.52, "end": 2676.28, "text": "Nein, ich meine nicht Skript. Ich meine nicht Skript. Es gab mal so einen Versuch, dass"}, {"id": 340, "start": 2676.28, "end": 2681.72, "text": "man wirklich, ich glaube, ich weiß nicht, ob es von Google war. Es gab wirklich einen"}, {"id": 341, "start": 2681.72, "end": 2687.88, "text": "LOL-AI-Bot im größeren Stil. Es kann auch sein, dass es in Dota war, wo man wirklich"}, {"id": 342, "start": 2687.88, "end": 2694.84, "text": "trainiert hat, den Bot spielen zu lassen. Jetzt nicht ein Spiel mit einem Spieler zu"}, {"id": 343, "start": 2694.84, "end": 2699.4, "text": "unterstützen, mit irgendwelchen Auto-Bytes oder was auch immer, sondern dass es wirklich"}, {"id": 344, "start": 2699.4, "end": 2705.64, "text": "autonom spielt mit dem, was ihm das Spiel liefert. Eine Starcraft-AI, die gab es auch."}, {"id": 345, "start": 2705.64, "end": 2709.4, "text": "Die gab es auch. Da weiß ich aber nicht, wie gut die war. Die hat wahrscheinlich auch"}, {"id": 346, "start": 2709.4, "end": 2715.64, "text": "alles geoutet. Nein, aber es gab auch eine LOL-Geschichte. Oder was? Starcraft? Nein,"}, {"id": 347, "start": 2715.64, "end": 2720.6, "text": "ich glaube, es war LOL. Und die Pro-Player haben dazu gesagt, dass sie sofort erkannt"}, {"id": 348, "start": 2720.6, "end": 2724.92, "text": "haben, was die AI ist und was nicht. Oder Dota. Die Dota-Spieler haben sofort erkannt,"}, {"id": 349, "start": 2724.92, "end": 2731.24, "text": "was AI ist und was nicht. Aber sie hatten quasi keine Chance zu gewinnen. Das Ding"}, {"id": 350, "start": 2731.24, "end": 2739.16, "text": "ist halt von den Mechanics her absolut perfekt. Ich kenne mich mit LOL und Dota nicht so gut"}, {"id": 351, "start": 2739.16, "end": 2743.56, "text": "aus, aber ich weiß, dass es da irgendwelche so High-Level-Mechaniken gibt, so nach dem"}, {"id": 352, "start": 2743.56, "end": 2750.12, "text": "Motto, irgendwelche Animationen canceln, links-rechts-steppen, dass dann Boomerang schneller zurückkommt"}, {"id": 353, "start": 2750.12, "end": 2755.4, "text": "und solche Dinge. Also da gibt es jede Menge Moves, die du quasi als Pro ausführst, während"}, {"id": 354, "start": 2755.4, "end": 2759.92, "text": "du das Spiel normal spielst, dass du aber selbst auf absolutem Pro-Level nicht perfekt"}, {"id": 355, "start": 2759.92, "end": 2765.4, "text": "hinkriegst. Also du lässt dann immer mal, triffst du den richtigen Frame fürs Animation-Canceling"}, {"id": 356, "start": 2765.4, "end": 2769.64, "text": "nicht oder was auch immer. Und das Problem hast du halt als AI nicht. Der spielt seinen"}, {"id": 357, "start": 2769.64, "end": 2775.52, "text": "Character Mechanic-technisch hundertprozentig einfach perfekt. Das ist das, was du als Pro"}, {"id": 358, "start": 2775.52, "end": 2779.6, "text": "nicht hinkriegst. Und selbst wenn du vielleicht die Big Brain Moves machen könntest, ist"}, {"id": 359, "start": 2779.6, "end": 2784.72, "text": "das Ding dir economy-mäßig schon immer ein Stück dann voraus. Also es ist halt, es ist"}, {"id": 360, "start": 2784.72, "end": 2788.72, "text": "halt ein komplett anderes Spiel, als wenn das jetzt irgendein Mensch wäre, der da spielen"}, {"id": 361, "start": 2788.72, "end": 2792.64, "text": "würde. Und trotz, also die Pros können dir sofort sagen, ob das eine AI ist oder nicht."}, {"id": 362, "start": 2792.64, "end": 2795.68, "text": "Zumindest stand das damals in dem Artikel drin, dass die Pro gesagt haben, sie können"}, {"id": 363, "start": 2795.68, "end": 2800.08, "text": "sofort erkennen, dass das eine AI ist, aber sie konnten halt nicht gewinnen dagegen. Oder"}, {"id": 364, "start": 2800.08, "end": 2813.76, "text": "was weiß ich, 1 vor 10 Games oder so. So, guck mal, vid weiter. Es gibt ja auch den,"}, {"id": 365, "start": 2813.76, "end": 2816.16, "text": "es gibt ja auch diesen Hack, sorry, das ist schon wieder unabbrechend. Es gibt ja auch"}, {"id": 366, "start": 2816.16, "end": 2822.52, "text": "diese Geschichte mit, dass man das am PC probiert. Weiß ich, ob ihr das mitbekommen habt, dass"}, {"id": 367, "start": 2822.52, "end": 2831.92, "text": "es ein, Moment, dass es letztens ein Cheatsystem gab für ein PC, der Maus und Tastatur Inputs"}, {"id": 368, "start": 2831.92, "end": 2838.44, "text": "simuliert hat. Und die haben das folgendermaßen gemacht, die haben eine PCI Express Karte"}, {"id": 369, "start": 2838.44, "end": 2844.24, "text": "eingebaut in den Rechner. PCI Express Karten, Hardware, hat Zugriff auf einen Arbeitsspeicher."}, {"id": 370, "start": 2844.24, "end": 2848.88, "text": "Und das haben die getan, glaube ich, als Netzwerkkarte, obwohl es gar keine Netzwerkkarte"}, {"id": 371, "start": 2848.88, "end": 2854.38, "text": "war. Also, die haben eine PCI Express Hardware Karte eingebaut, die Zugriff auf den Arbeitsspeicher"}, {"id": 372, "start": 2854.38, "end": 2859.44, "text": "hatte. Die hat quasi den Arbeitsspeicher gescannt, geguckt, wo die wichtigen Daten von den Games"}, {"id": 373, "start": 2859.44, "end": 2864.92, "text": "stehen. Das Game hat das nicht gemerkt, weil halt nichts an Software auf dem Rechner läuft,"}, {"id": 374, "start": 2864.92, "end": 2869.6, "text": "sondern dass halt eine Hardware Karte als Netzwerkkarte getarnt war. Die hat den RAM"}, {"id": 375, "start": 2869.6, "end": 2876.6, "text": "ausgelesen vom Game, hat dann die wichtigen Daten extrahiert, an einen Microcontroller"}, {"id": 376, "start": 2876.6, "end": 2882.28, "text": "geschickt und der Microcontroller hat dann Maus und Tastatur bedient. Das war quasi ein"}, {"id": 377, "start": 2882.28, "end": 2887.52, "text": "nicht wirklich erkennbarer Cheat auf dem PC, weil du es nicht direkt nachweisen kannst"}, {"id": 378, "start": 2887.52, "end": 2892.16, "text": "in Form von, ich erkenne eine Software, ich kenne einen Cheat, der im Hintergrund läuft."}, {"id": 379, "start": 2892.16, "end": 2899.56, "text": "Sowas kannst du nur nachweisen über irgendwelche Statistiken oder sowas. Also du kannst es"}, {"id": 380, "start": 2899.56, "end": 2903.68, "text": "nicht mehr direkt nachweisen. Mittlerweile, man könnte natürlich sagen, ja gut, warum"}, {"id": 381, "start": 2903.68, "end": 2908.4, "text": "haben die nicht die Hardware im Rechner erkannt? Das ist gar nicht so einfach. Das Ding hat"}, {"id": 382, "start": 2908.4, "end": 2911.48, "text": "sich getarnt als Netzwerkkarte. Du kannst jetzt schlecht Leute mit der Netzwerkkarte"}, {"id": 383, "start": 2911.48, "end": 2916.44, "text": "im Rechner bannen. Du kannst sagen, ok, Netzwerkkarten mit diesem Hersteller, mit dieser Mac-Adresse"}, {"id": 384, "start": 2916.44, "end": 2920.52, "text": "werden gebannt, ok, das kannst du machen, aber dann ändert das der Hersteller einfach."}, {"id": 385, "start": 2920.52, "end": 2926.04, "text": "Also ein Hardware-Hersteller kann ja reinschreiben, was er lustig ist. Das ist kein großartiges"}, {"id": 386, "start": 2926.04, "end": 2930.48, "text": "Problem und du kannst jetzt schlecht Leute bannen dafür, dass sie Hardware im PCI-Express-Slot"}, {"id": 387, "start": 2930.48, "end": 2935.08, "text": "stecken haben. Das ist das Normalste von der Welt, Hardware im PCI-Express-Slot zu haben."}, {"id": 388, "start": 2935.08, "end": 2942.36, "text": "Die sollte aber nicht direkten Zugriff auf alle Speicher haben. Ich muss dir ehrlich"}, {"id": 389, "start": 2942.36, "end": 2947.24, "text": "sagen, ich habe keine Ahnung, wie das unter Windows genau läuft, aber es war wohl möglich,"}, {"id": 390, "start": 2947.24, "end": 2951.52, "text": "sonst hätte der ganze Cheat nicht funktioniert. Das auf Hardware-Ebene, wie das Treiber technisch"}, {"id": 391, "start": 2951.52, "end": 2955.28, "text": "aussieht, absolut keine Ahnung. Weiß ich nicht."}, {"id": 392, "start": 2955.28, "end": 2981.36, "text": "Mit Stadia wäre das nicht passiert, doch! Klar, mit Stadia, das ist ja grad der Witz"}, {"id": 393, "start": 2981.36, "end": 2987.52, "text": "daran, sowas kannst du auf jeder Plattform machen. Also sobald du nur noch den Output"}, {"id": 394, "start": 2987.52, "end": 2992.44, "text": "brauchst und den Input hinschickst, ist das komplett plattformunabhängig. Der Cheat"}, {"id": 395, "start": 2992.44, "end": 2997.4, "text": "nimmt aktuell, natürlich würde das mit Stadia funktionieren, der Cheat nimmt aktuell das"}, {"id": 396, "start": 2997.4, "end": 3002.16, "text": "Output-Signal von der Konsole, errechnet welchen Input er machen muss für einen Headshot und"}, {"id": 397, "start": 3002.16, "end": 3006.2, "text": "schickt den Input dahin. Das funktioniert mit der Konsole genauso wie mit Stadia."}, {"id": 398, "start": 3006.2, "end": 3031.2, "text": "Die Chinesen kennen ja gar keinen Spaß mehr, da kommt es ja sogar ein Knast als Cheat-Hersteller."}, {"id": 399, "start": 3031.2, "end": 3041.8, "text": "Das können ja glaube ich gar nicht so einfach. Ich bin mir nicht mal sicher, ob das verboten"}, {"id": 400, "start": 3041.8, "end": 3047.54, "text": "ist, ehrlich gesagt. Die greifen nicht in das Spiel ein, die greifen nicht irgendwie"}, {"id": 401, "start": 3047.54, "end": 3054.44, "text": "in Rechte von Activision ein, ich kann mir nicht stellen, dass das verboten ist. Ich"}, {"id": 402, "start": 3054.44, "end": 3060.56, "text": "wüsste nicht gegen, ich meine keine Rechtsberatung, blablabla, ich hab mir da nicht vorgebildet,"}, {"id": 403, "start": 3060.56, "end": 3065.6, "text": "was das angeht, aber ich wüsste nicht, gegen was das verstoßen sollte, wenn du den Output"}, {"id": 404, "start": 3065.6, "end": 3071.56, "text": "abgreifst, von einem externen System verarbeiten lässt und dann über den normalen Input wieder"}, {"id": 405, "start": 3071.56, "end": 3080.84, "text": "Sachen an die Konsole legst. Es ist fragwürdig, ob das Herstellen solcher Cheats wirklich"}, {"id": 406, "start": 3080.84, "end": 3086.28, "text": "illegal ist. Was du sagen könntest, ist natürlich, das Benutzen dieser Cheats ist insofern gegen"}, {"id": 407, "start": 3086.28, "end": 3090.48, "text": "die Toss und du kannst die Leute bannen, wenn du sie dann merkst, wenn du es dann feststellst."}, {"id": 408, "start": 3090.48, "end": 3095.32, "text": "Das kannst du auf jeden Fall machen können, aber rechtlich belangend, so eine Cheat-Hersteller,"}, {"id": 409, "start": 3095.32, "end": 3125.28, "text": "das stelle ich mir äußerst schwierig vor. Naja, ist das nicht"}, {"id": 410, "start": 3125.28, "end": 3130.32, "text": "irgendwie Manipulation der anderen? Schade, doch, aber das ist strafrechtlich eigentlich"}, {"id": 411, "start": 3130.32, "end": 3135.88, "text": "kein Ding. Also sag mal so, wenn du jetzt, ich muss jetzt mal irgendwie einen blöden"}, {"id": 412, "start": 3135.88, "end": 3143.04, "text": "Vergleich ausdenken, wenn du jetzt Fußball spielst und deine Schuhe tunst, dann verstößt"}, {"id": 413, "start": 3143.04, "end": 3148.96, "text": "du vielleicht gegen die Regeln von deinem Verein oder der Liga, in der du spielst, aber"}, {"id": 414, "start": 3148.96, "end": 3158.68, "text": "die Fans werden dich nicht dafür verklagen können. Die können dich bannen, die können"}, {"id": 415, "start": 3158.68, "end": 3162.04, "text": "dich bannen, dass du nie wieder spielen kannst, wenn sie dich erwischen, ja. Das ist das"}, {"id": 416, "start": 3162.04, "end": 3165.64, "text": "gleiche, was Activision auch machen kann. Activision kann dich bannen, wenn sie dich"}, {"id": 417, "start": 3165.64, "end": 3169.04, "text": "erwischen und sagen, du darfst dieses Spiel auf diesem Account nie wieder spielen, das"}, {"id": 418, "start": 3169.04, "end": 3174.32, "text": "ist okay. Aber die können dich nicht verklagen in Form von, keine Ahnung, ich kriege jetzt"}, {"id": 419, "start": 3174.32, "end": 3187.96, "text": "von dir 5.000 Euro. Er könnte es probieren, aber ich glaube nicht, dass es klappt. Sellout,"}, {"id": 420, "start": 3187.96, "end": 3202.64, "text": "exzellent Sellout, next. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja."}, {"id": 421, "start": 3202.64, "end": 3218.04, "text": "Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja."}, {"id": 422, "start": 3218.04, "end": 3227.0, "text": "Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja.ре.0."}, {"id": 423, "start": 3227.0, "end": 3230.28, "text": "Rezaktivision.arna match. Tja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ja. Ha. Ja. Ja. Ja."}, {"id": 424, "start": 3230.28, "end": 3231.9, "text": "ja. Ja. Ja. Ja. Ja. Ja. Ja."}, {"id": 425, "start": 3231.9, "end": 3239.18, "text": "Es ist nicht ein Battle Royale. Wir werden auch über die geschlossenen Technik-Tests und Betas von 2042 in EA Play live informieren."}, {"id": 426, "start": 3239.18, "end": 3243.5, "text": "Ja, da bin ich mal gespannt. Ich hoffe, ich hoffe, da darf ich mitmachen beim Closed-Technical-Test."}, {"id": 427, "start": 3243.5, "end": 3248.42, "text": "Sie werden ein neues Projekt aufbauen, nachdem ihre Arbeit auf Battlefield 2042 beendet wurde."}, {"id": 428, "start": 3248.42, "end": 3253.46, "text": "Sie haben seit 2013 als DICE LA auf der Battlefield-Franchise gearbeitet."}, {"id": 429, "start": 3253.46, "end": 3258.34, "text": "Letztes Jahr hat EA den Founder von Respawn, Vince Sampella, in der Studie in Bezug."}, {"id": 430, "start": 3258.34, "end": 3262.14, "text": "In seiner Richtung werden sie von der Battlefield-Franchise entfernt."}, {"id": 431, "start": 3262.14, "end": 3265.86, "text": "Die Rebrandung zum Ripple-Effekt ist ein Teil dieses Prozesses."}, {"id": 432, "start": 3266.74, "end": 3269.7, "text": "Das Mittelsch"}, {"id": 433, "start": 3269.7, "end": 3273.14, "text": "Sie haben es jetzt eigentlich geschafft, dass man seine Mitspieler wieder sieht."}, {"id": 434, "start": 3273.5, "end": 3274.5, "text": "Es wird auf der 15."}, {"id": 435, "start": 3274.5, "end": 3278.74, "text": "Es wird ein neues Zombies-Map für Cold War genannt, Mauer des Totem."}, {"id": 436, "start": 3278.74, "end": 3283.54, "text": "Es sieht aus wie ein klassisches Zombies-Map und bringt viele neue Mechaniken in den Mix."}, {"id": 437, "start": 3283.54, "end": 3288.58, "text": "Es wird die Mule-Kick-Perke, einen Roboter-Kompanion, neue Waffen und mehr genannt."}, {"id": 438, "start": 3288.58, "end": 3291.78, "text": "Als für Warzone klingt es so, als würde das Mittelschneidende-Update"}, {"id": 439, "start": 3291.78, "end": 3294.38, "text": "einige größere Balance-Changes zum Battle Royale bringen."}, {"id": 440, "start": 3294.38, "end": 3299.42, "text": "Die Saison 4 wurde mit schwebenden Balance-Changes eröffnet, die einen großen Impact auf die Meta des Spiels hatten."}, {"id": 441, "start": 3299.42, "end": 3304.18, "text": "Der Entwickler sagte, dass ein zweiter größeres Update in der Arbeit war, um die Anzahl der Average zu erhöhen."}, {"id": 442, "start": 3304.18, "end": 3308.5, "text": "Gut, Ravensoft hat jetzt ja sich nicht mit Ruhm beklickert die letzten Monate über."}, {"id": 443, "start": 3308.5, "end": 3315.5, "text": "...TTK of all weapons. These two updates combined should result in a much more consistent experience for all players."}, {"id": 444, "start": 3315.5, "end": 3320.98, "text": "Warzone has also been trending towards faster and faster killing weapons with every seasonal update."}, {"id": 445, "start": 3320.98, "end": 3326.94, "text": "Assuming the mid-season update brings those TTK-Changes, it'll be a return to form for the Battle Royale."}, {"id": 446, "start": 3327.42, "end": 3330.9, "text": "Modern military FPS World War 3 is finally getting..."}, {"id": 447, "start": 3331.38, "end": 3332.74, "text": "What? Das gibt's noch?"}, {"id": 448, "start": 3332.74, "end": 3335.86, "text": "...an update after nearly a year of radio silence."}, {"id": 449, "start": 3335.86, "end": 3342.3, "text": "The developers announced a partnership with My.Games last year to secure more funding and resources for development."}, {"id": 450, "start": 3342.3, "end": 3348.74, "text": "It also means the game will transition to a free-to-play title, but a whole year later nothing has materialized."}, {"id": 451, "start": 3348.74, "end": 3353.78, "text": "The game's official social media account is teasing an update in four days, and before they had gone..."}, {"id": 452, "start": 3355.78, "end": 3356.34, "text": "Also..."}, {"id": 453, "start": 3357.3, "end": 3359.78, "text": "Die haben es so mega verkackt."}, {"id": 454, "start": 3360.22, "end": 3364.14, "text": "Das Game, das kam, das haben die angekündigt vor, keine Ahnung, fünf Jahren oder so."}, {"id": 455, "start": 3364.14, "end": 3367.5, "text": "Ich hab mir sogar auch mal damals Early Access mal was für angucken wollte."}, {"id": 456, "start": 3367.5, "end": 3374.58, "text": "Das kam zu einer Zeit, wo die Leute richtig, wie sagt man so, gelechtzt haben nach einem modernen Combat Battlefield."}, {"id": 457, "start": 3375.58, "end": 3380.14, "text": "Und da haben die das angekündigt und haben gesagt, sie machen sowas in der Richtung."}, {"id": 458, "start": 3380.14, "end": 3384.1, "text": "Was natürlich viele Battlefield-Fans gefreut hatten, gesagt haben, cool,"}, {"id": 459, "start": 3384.1, "end": 3388.5, "text": "es muss ja nicht unbedingt ein Battlefield von DICE sein, es kann ja auch ein Battlefield von einem anderen Hersteller sein."}, {"id": 460, "start": 3388.5, "end": 3390.9, "text": "Und jetzt haben die einfach fünf Jahre lang nichts gemacht."}, {"id": 461, "start": 3390.9, "end": 3398.9, "text": "Und jetzt, in dem Jahr, wo Battlefield 2042 rauskommt, jetzt wollen sie ein Update bringen?"}, {"id": 462, "start": 3398.9, "end": 3403.38, "text": "Die haben die Zeit einfach komplett verschlafen, das kannst du jetzt echt nicht in den Ernst sein."}, {"id": 463, "start": 3414.62, "end": 3416.7, "text": "Nein, nein, RIP, vorbei."}, {"id": 464, "start": 3416.7, "end": 3423.7, "text": "Genau, ja, vorbei, es ist vorbei."}, {"id": 465, "start": 3423.7, "end": 3444.7, "text": "Vorbei, verstehe, also, keine Ahnung."}, {"id": 466, "start": 3444.7, "end": 3460.7, "text": "Am Ende ist es besser als Battlefield, hey, das kann sogar sein, aber trotzdem, es ist ja nicht immer gesagt, dass die besseren Sachen sich durchsetzen."}, {"id": 467, "start": 3475.7, "end": 3484.7, "text": "Ich finde das, ich finde das by the way, super, dass die an irgendwelche, ich weiß nicht, was sie donatet haben, an irgendwelche Tierschutzgeschichten donatet haben."}, {"id": 468, "start": 3484.7, "end": 3492.7, "text": "Aber man muss halt mal ehrlich sagen, 10K, das bezahlen die aus der Portokasse oder nicht mal, das ist noch nicht mal die Portokasse, 10K ist so,"}, {"id": 469, "start": 3492.7, "end": 3505.7, "text": "das ist das, was die wahrscheinlich zufällig auf dem Gang finden im Management-Stock oben, Stockwerk."}, {"id": 470, "start": 3522.7, "end": 3534.7, "text": "Ja, das stimmt, das stimmt, Playerbase, Primordial Nightmare, Playerbase ist echt wichtig bei Multiplayer-Spielen."}, {"id": 471, "start": 3534.7, "end": 3547.7, "text": "Das ist mit eines der Faktoren schlechthin, ob ein Spiel langfristig erfolgreich ist oder nicht."}, {"id": 472, "start": 3547.7, "end": 3561.7, "text": "Wahrscheinlich haben die mehr Geld dafür bezahlt, Influencern Geld zu geben, dass die Nachricht verbreitet wird, dass sie 10.000 Euro donatet haben als die 10.000 Euro, die sie donatet haben."}, {"id": 473, "start": 3561.7, "end": 3572.7, "text": "Wahrscheinlich, das wäre so ein richtig typischer Stonks-Move, man donatet 10.000 Euro und gibt dann 100.000 Euro aus, um zu verbreiten, dass man 10.000 Euro donatet hat."}, {"id": 474, "start": 3572.7, "end": 3579.7, "text": "Das wäre ein typischer BWL-Stonks-Move, kann ich mir gut vorstellen. Florian290, danke für den Sub."}, {"id": 475, "start": 3603.7, "end": 3608.7, "text": "Die interessiert mich jetzt nicht so."}, {"id": 476, "start": 3608.7, "end": 3633.7, "text": "Ist jetzt nicht so meine Serie."}, {"id": 477, "start": 3633.7, "end": 3639.7, "text": "Wofür steht eigentlich Stonks für Aktien? Stocks."}, {"id": 478, "start": 3639.7, "end": 3656.7, "text": "Ja, das war doch schon ein Set-Out eingebaut."}, {"id": 479, "start": 3656.7, "end": 3664.7, "text": "Was?"}, {"id": 480, "start": 3664.7, "end": 3677.7, "text": "Moment, es gibt jetzt 10 Jahre später einen Witcher 3 DLC?"}, {"id": 481, "start": 3677.7, "end": 3691.7, "text": "Okay, okay, es bekommt kein eigenes Story-DLC, es bekommt ein paar extra Items, das heißt im Endeffekt, keine Ahnung, zwei Tage Entwicklungsaufwand oder sowas."}, {"id": 482, "start": 3691.7, "end": 3709.7, "text": "Soll. Wie? Wie billig? Wie billig? Ich dachte, es gibt neue Story, nein, nein, nein, nein, gibt's nicht."}, {"id": 483, "start": 3709.7, "end": 3726.7, "text": "Ich würde den Addon raushauen mit neuer Story, den würde ich sofort kaufen, aber was juckt mich, was juckt mich Items aus der Serie? Ich mein, uninteressanter kann es ja kaum sein."}, {"id": 484, "start": 3726.7, "end": 3740.7, "text": "Okay, die haben irgendwas gebraucht, um noch ein bisschen Geld zu machen, verstehe ich. Verstehe ich, nachdem Cyberpunk ja nicht so gut angekommen ist, muss ich noch ein bisschen Geld mit Witcher machen, ist ja logisch."}, {"id": 485, "start": 3740.7, "end": 3761.7, "text": "Weil die haben mit Cyberpunk auch krass viel Kohle gemacht durch die ganzen Pre-Orders. Er meint eh, dass es kostenlos für bestehende Spieler ist, ja gut, aber wenn du es für die Next-Gen-Konsole kaufst, dann musst du dir das Spiel auf jeden Fall nochmal neu kaufen. Das ist der Anreiz, dass die Leute sich das auf der Next-Gen-Konsole kaufen."}, {"id": 486, "start": 3761.7, "end": 3782.7, "text": "Guck dir Aktien an, okay, okay, okay. Kurs, gucken wir mal. Na ja."}, {"id": 487, "start": 3782.7, "end": 3798.7, "text": "Das ist ja für das Geld, was sie zur Verfügung haben, das erste Mal nicht so. Also die haben ja das Geld von Cyberpunk trotzdem bekommen. Scheiß drauf, ob ihr Aktienkurs runtergeht oder nicht."}, {"id": 488, "start": 3798.7, "end": 3812.7, "text": "Da trifft die doch erstmal gar nicht."}, {"id": 489, "start": 3812.7, "end": 3836.7, "text": "Ich warte schon auf die nächsten Reddits. Wenn das jetzt noch weiterfällt, dann kommt demnächst WallStreetBets an. Was macht CD Projekt RedStick? Kommt da irgendwas?"}, {"id": 490, "start": 3836.7, "end": 3846.7, "text": "So, was gucken wir uns jetzt als nächstes an? EA Activision war gestern. Dieser Konzernbewegte, das wird wahrscheinlich 10 Cent, was sonst? Das müssen wir uns nicht angucken."}, {"id": 491, "start": 3846.7, "end": 3867.7, "text": "China-Chinesen-Gramm. Simon Desue exposed auch noch. Wisst ihr Leute, Simon Desue? Ich weiß jetzt gar nicht, warum ich das Video aufgemacht habe, aber ist das nicht der Simplicissimus Typ? Oder einer von den beiden?"}, {"id": 492, "start": 3867.7, "end": 3878.7, "text": "Oder bringe ich das jetzt durcheinander? Ist das nicht der gleiche Typ? Ach doch, doch, doch."}, {"id": 493, "start": 3878.7, "end": 3902.7, "text": "Also Simon Desue ist halt auch so einer, wo ich keine Ahnung habe, warum die Leute überhaupt, also erstens verstehe ich nicht, warum die Leute das jemals gefeiert haben. Ich fand das persönlich schon immer mega unlustig, aber okay. Aber, dass man dem Kerl vertraut, irgendwas, das verstehe ich nicht."}, {"id": 494, "start": 3902.7, "end": 3918.7, "text": "Also ich persönlich finde den Typ mega unsympathisch. Das ist so, Simon Desue ist der Typ, der früher in der Klasse immer einen dummen Spruch machen musste, egal wie unpassend es war, weil es eben so sein Ruf war, lustig, funny zu sein. Da musste zu allem einen dummen Spruch machen. So jemand ist das."}, {"id": 495, "start": 3918.7, "end": 3933.7, "text": "Quasi selbst wenn jemand erzählt hat, seine Oma ist gestorben, muss dann einen dummen Spruch machen. So schätze ich den Kerl ein. Gut, keine Ahnung, ob es wirklich stimmt, aber zumindest ist mir der Typ mega unsympathisch. Gucken wir mal, gucken wir mal. Ich will jetzt wissen, wie der Ex paust wird."}, {"id": 496, "start": 3933.7, "end": 3952.7, "text": "Doch, das ist er doch. Alter, wenn ich diese gestellten Reichtumsbilder schon immer sehe, da kann ich auch mit Carl auf den Mount Everest, da brauch ich nicht Simon Desue."}, {"id": 497, "start": 3952.7, "end": 3963.7, "text": "Simon hat jetzt einen neuen, ekelhaften, mutmaßlichen Scam. Den haben wir uns mal etwas genauer angeguckt und etwas dazu recherchiert."}, {"id": 498, "start": 3963.7, "end": 3972.7, "text": "Spoiler, seine Masche stammt aus den USA, hat zig Menschen in den Ruin getrieben, ist aufgebaut auf dem Standard-Baukasten der dubiosen Online-Coaches."}, {"id": 499, "start": 3972.7, "end": 3986.7, "text": "Ach Gott, nein, nicht noch mehr. Ok, Ok, Coaching, Coaching, Online-Coaching, so in a nutshell. Als erstes musst du den Leuten erzählen, Leute, ihr braucht das richtige Mindset, ihr müsst das Gewinner-Mindset haben."}, {"id": 500, "start": 3986.7, "end": 3994.7, "text": "Nur mit dem richtigen Gewinner-Mindset könnt ihr reich werden. Ihr müsst richtig, wie sagt er, ihr müsst hustlen Leute, ihr müsst richtig ran, ihr müsst richtig reinklopfen."}, {"id": 501, "start": 3994.7, "end": 4002.7, "text": "Das Gewinner-Mindset, ihr dürft nicht anscheiden, das Gewinner-Mindset. Und dann, und dann müsst ihr natürlich meine Produkte verkaufen. So."}, {"id": 502, "start": 4002.7, "end": 4010.7, "text": "Ihr braucht das richtig krasse Gewinner-Mindset und ihr müsst meine Produkte verkaufen. Dann werdet ihr rein. Das ist immer exakt die gleiche scheiß Masche."}, {"id": 503, "start": 4010.7, "end": 4026.7, "text": "Dass das da überhaupt noch, das ist ja noch nicht einmal was. Warte mal, Alter, ich muss was trinken. ETF. Alter, normal bin ich jetzt Corona geimpft."}, {"id": 504, "start": 4026.7, "end": 4050.7, "text": "Okay, alles gut, alles, so, weiter im Text. Also, es ist ja noch nicht mal, dass diese ganze, diese ganze Masche hier mit ich mache euch reich, das ist garantiert so was, werde ich mit euch, wenn ich das hier schon sehe."}, {"id": 505, "start": 4050.7, "end": 4058.7, "text": "Das ist ja gar nicht so, als ist diese Masche neu. Diese Masche gibt es quasi schon ewig online und noch viel, viel länger offline."}, {"id": 506, "start": 4058.7, "end": 4069.7, "text": "Dass man den Leuten für viel Geld quasi irgendwelche, soll man sagen, irgendwelche Träume verkaufen will oder ihnen bei irgendwas angeblich hilft."}, {"id": 507, "start": 4069.7, "end": 4082.7, "text": "Sei es reich werden, sei es den Traumpartner finden, was auch immer. Und diese Masche gibt es ja schon tausende Jahre im Endeffekt. Ich sage das aus eigener Erfahrung."}, {"id": 508, "start": 4082.7, "end": 4095.7, "text": "Ich habe sowas noch nie gemacht, aber mein Vater hat sowas gemacht. Mein Vater hatte eine Scam-Firma früher, die nicht zwar sowas gemacht hat, aber ähnliche Sachen gemacht hat."}, {"id": 509, "start": 4095.7, "end": 4106.7, "text": "Also ich habe mitbekommen, was da, was da so abläuft. Das heißt, das ist nicht, das ist nicht neu. Das hat er schon vor 40 Jahren gemacht, ohne Internet und alles."}, {"id": 510, "start": 4106.7, "end": 4113.7, "text": "Dass diese Masche ist nicht neu. So, okay, gucken wir uns das jetzt mal an."}, {"id": 511, "start": 4113.7, "end": 4126.7, "text": "Also wer sich jetzt fragt, was der, ich erzähle es jetzt mal ganz kurz zu erklären, was der gemacht hat, der hatte eine Partnervermittlung, hatte aber nie vor, Partner zu vermitteln."}, {"id": 512, "start": 4126.7, "end": 4138.7, "text": "Der hat quasi irgendwelchen älteren Damen, ich sage mal Omas, erzählt zum Beispiel bei uns, bei mir findet ihr euren Traumpartner, der perfekt zu euch passt und hat mit ihnen einen monatlichen Vertrag ausgemacht."}, {"id": 513, "start": 4138.7, "end": 4152.7, "text": "Die haben krasse Kohle abgedrückt für die damalige Zeit, die Omas. Und anstatt den Partner zu vermitteln, hat er sich drei, vier Herren in ein bisschen groberen im Alter, die halt auch nett ausgesehen haben und gut reden konnten,"}, {"id": 514, "start": 4152.7, "end": 4160.7, "text": "hat er bezahlt, dass die für ihn zu den Omas gegangen sind und denen quasi schöne Augen gemacht haben."}, {"id": 515, "start": 4160.7, "end": 4170.7, "text": "Und daraufhin haben natürlich die Omas immer schön weiter Monatsgebühren bezahlt, weil ja so viele nette Herren bei ihnen Interesse haben und vorbeikommen."}, {"id": 516, "start": 4170.7, "end": 4175.7, "text": "Also diese Masche, diese Scam-Masche ist uralt."}, {"id": 517, "start": 4175.7, "end": 4183.7, "text": "Das ging dann übrigens auch irgendwann in die Hose, weil sie ihn erwischt haben, aber Scamas."}, {"id": 518, "start": 4183.7, "end": 4190.7, "text": "Online-Coaches und Future-Digital-Millionärs und richtet sich ganz gezielt auf Menschen."}, {"id": 519, "start": 4190.7, "end": 4194.7, "text": "Wenn ich die schleimigen Leute, wenn ich die ganzen Leute schon sehe wieder."}, {"id": 520, "start": 4194.7, "end": 4204.7, "text": "Nein, nein, nein, nein, nein, nein, nicht im Knast, nicht im Knast. Wobei, okay, ich, Leute, ich, ich, ich bin ehrlich, er war nicht im Knast und nicht dafür."}, {"id": 521, "start": 4204.7, "end": 4214.7, "text": "Er war nur in Untersuchungshaft, aber nicht dafür. Dafür, sie haben ihn versucht, sie haben ihn versucht zu verklagen dafür."}, {"id": 522, "start": 4214.7, "end": 4220.7, "text": "Und der Richter muss wohl eins zu eins gesagt haben, also gut, ich kenne das nur von dem, was er so erzählt hat."}, {"id": 523, "start": 4220.7, "end": 4229.7, "text": "Der Richter muss wohl wirklich gesagt haben zu so einer Zeugin, Frau, die damals da Kunde war, muss wohl wirklich gesagt haben,"}, {"id": 524, "start": 4229.7, "end": 4235.7, "text": "Frau, ich sage jetzt mal Frau Meier, keine Ahnung, wie die ist, Frau Meier, warum haben Sie denn sowas unterschrieben?"}, {"id": 525, "start": 4235.7, "end": 4239.7, "text": "Also das muss wohl so ein offensichtlicher Scam-Vertrag gewesen sein."}, {"id": 526, "start": 4239.7, "end": 4244.7, "text": "Es ist nicht rechtlich, also nicht Scam, strafbar Scam, aber offensichtlich sehr einseitig."}, {"id": 527, "start": 4244.7, "end": 4248.7, "text": "Und der muss sich fragen, Frau Meier, warum haben Sie sowas denn unterschrieben?"}, {"id": 528, "start": 4248.7, "end": 4253.7, "text": "Die haben ihn erfragt, also der hat, der hat krass Leute gescampt, aber die haben ihn freigesprochen."}, {"id": 529, "start": 4253.7, "end": 4257.7, "text": "Das war rechtlich nichts zu machen. Da wahrscheinlich auch nicht, ja."}, {"id": 530, "start": 4257.7, "end": 4261.7, "text": "Aber ich will halt sagen, so Scam-Geschichten sind schon so alt wie die Menschheit."}, {"id": 531, "start": 4267.7, "end": 4270.7, "text": "Bevor es losgeht, ganz kurz zum Sponsor des heutigen Videos."}, {"id": 532, "start": 4270.7, "end": 4272.7, "text": "Das ist mal wieder NordVPN."}, {"id": 533, "start": 4272.7, "end": 4277.7, "text": "VPNs sind nützlich, wenn man virtuell den eigenen Standort ändern will."}, {"id": 534, "start": 4277.7, "end": 4280.7, "text": "So kann man ziemlich unterschiedliche Angebote."}, {"id": 535, "start": 4280.7, "end": 4285.7, "text": "In den USA gibt es ganz andere Filme, das hat zum Beispiel jemanden von euch interessiert."}, {"id": 536, "start": 4285.7, "end": 4288.7, "text": "NordVPN ist auch super schnell, ihr dürftet also auch..."}, {"id": 537, "start": 4288.7, "end": 4289.7, "text": "Richtig schnell."}, {"id": 538, "start": 4289.7, "end": 4290.7, "text": "...Sowohl für iOS."}, {"id": 539, "start": 4290.7, "end": 4292.7, "text": "Wenn euch NordVPN nicht gefällt, gibt NordVPN."}, {"id": 540, "start": 4292.7, "end": 4293.7, "text": "Ja, auf jetzt."}, {"id": 541, "start": 4293.7, "end": 4296.7, "text": "Erinnert euch an Abad auf einen Zwei-Jahres-Plan."}, {"id": 542, "start": 4296.7, "end": 4301.7, "text": "Ihr alle erinnert euch an Simons Klassiker, wie englische YouTube-Videos eins zu eins übersetzen."}, {"id": 543, "start": 4301.7, "end": 4305.7, "text": "Ehrlich gesagt, nein, daran erinnere ich mich nicht, weil ich das nie geguckt habe."}, {"id": 544, "start": 4305.7, "end": 4308.7, "text": "Weil ich den Kerl von Anfang an mega unsympathisch fand."}, {"id": 545, "start": 4308.7, "end": 4312.7, "text": "Das wird mir jedes Mal bis zum Rest meines Lebens eine Gänsehaut den Rücken runterjagen."}, {"id": 546, "start": 4312.7, "end": 4313.7, "text": "Hi, I'm Chris Brown."}, {"id": 547, "start": 4313.7, "end": 4314.7, "text": "Asshole!"}, {"id": 548, "start": 4314.7, "end": 4316.7, "text": "Hi, I'm Chris Brown."}, {"id": 549, "start": 4317.7, "end": 4319.7, "text": "Oder bei einer Mini-Verfolgungsjagd dabei sein."}, {"id": 550, "start": 4319.7, "end": 4321.7, "text": "Oder auch einem Jetski mieten."}, {"id": 551, "start": 4321.7, "end": 4325.7, "text": "Oder sich vor einem Eintages Auto rental stellen und so tun, als würde man es besitzen."}, {"id": 552, "start": 4325.7, "end": 4327.7, "text": "Oder billige Scheißzahnpflegen bewerben."}, {"id": 553, "start": 4327.7, "end": 4329.7, "text": "Oder in Dubai leben, weil man da ja so frei ist."}, {"id": 554, "start": 4329.7, "end": 4330.7, "text": "Ach stimmt!"}, {"id": 555, "start": 4330.7, "end": 4334.7, "text": "Das ist ja einer von den Dubai Influencer..."}, {"id": 556, "start": 4334.7, "end": 4336.7, "text": "Wie nennt man das?"}, {"id": 557, "start": 4337.7, "end": 4338.7, "text": "Keine Ahnung."}, {"id": 558, "start": 4338.7, "end": 4339.7, "text": "Gruppe."}, {"id": 559, "start": 4341.7, "end": 4342.7, "text": "Was gibt's denn?"}, {"id": 560, "start": 4342.7, "end": 4345.7, "text": "Es gibt die Madeira Influencer und es gibt die Dubai Influencer."}, {"id": 561, "start": 4345.7, "end": 4346.7, "text": "Gibt's noch was?"}, {"id": 562, "start": 4346.7, "end": 4347.7, "text": "Hab ich noch was vergessen?"}, {"id": 563, "start": 4347.7, "end": 4348.7, "text": "Haben wir noch ein paar?"}, {"id": 564, "start": 4349.7, "end": 4351.7, "text": "Warum geht eigentlich keiner in die Schweiz?"}, {"id": 565, "start": 4351.7, "end": 4353.7, "text": "Zu teuer, zu teuer."}, {"id": 566, "start": 4353.7, "end": 4355.7, "text": "Zu, zu, äh, auch zu viel Steuern."}, {"id": 567, "start": 4358.7, "end": 4360.7, "text": "LA Influencer, ah, gibt's die auch noch?"}, {"id": 568, "start": 4362.7, "end": 4364.7, "text": "Und jenen kleinen Scam durchziehen."}, {"id": 569, "start": 4364.7, "end": 4368.7, "text": "Man merkt schon, es wurde über die Jahre immer weniger lustig."}, {"id": 570, "start": 4368.7, "end": 4373.7, "text": "Und einfach immer krimineller und hinterhältiger und ekelhafter."}, {"id": 571, "start": 4373.7, "end": 4381.7, "text": "Ja gut, er muss halt sehen, dass er aus seiner, ähm, schwindenden, keine Ahnung, Fanbase,"}, {"id": 572, "start": 4381.7, "end": 4385.7, "text": "die ihm da noch traut, das Maximale an Kohle rausholt, ne?"}, {"id": 573, "start": 4385.7, "end": 4388.7, "text": "Hatte am Freitag ein Vorstellungsgespräch zum Fachinformatiker."}, {"id": 574, "start": 4388.7, "end": 4391.7, "text": "Interessiert es dich vielleicht, welche Fragen sie gestellt haben?"}, {"id": 575, "start": 4391.7, "end": 4394.7, "text": "Ja, ja, können wir uns gleich mal angucken."}, {"id": 576, "start": 4394.7, "end": 4395.7, "text": "Ich guck mir jetzt das Video an."}, {"id": 577, "start": 4395.7, "end": 4397.7, "text": "Ja, jetzt können wir uns eine gute Idee..."}, {"id": 578, "start": 4397.7, "end": 4398.7, "text": "Interessiert mich, ja."}, {"id": 579, "start": 4408.7, "end": 4411.7, "text": "Ja, ich kenn auch einen, der gerne noch mehr verdienen würde."}, {"id": 580, "start": 4413.7, "end": 4417.7, "text": "Ich mach's ganz kurz, er verspricht, dass man über FBA, das ist Fulfillment by Amazon,"}, {"id": 581, "start": 4417.7, "end": 4419.7, "text": "richtig heftig rein..."}, {"id": 582, "start": 4419.7, "end": 4423.7, "text": "Fulfillment by, äh, ähm, das ist Marketplace, oder?"}, {"id": 583, "start": 4423.7, "end": 4425.7, "text": "Das ist ganz normales Amazon Marketplace, oder?"}, {"id": 584, "start": 4425.7, "end": 4427.7, "text": "Seh ich das jetzt falsch?"}, {"id": 585, "start": 4427.7, "end": 4433.7, "text": "Du verkaufst deine Sachen über Amazon und, ähm, du machst halt, du machst halt Fulfillment,"}, {"id": 586, "start": 4433.7, "end": 4438.7, "text": "also sprich Versand und, du machst halt die Abwicklung über Amazon."}, {"id": 587, "start": 4439.7, "end": 4442.7, "text": "Reich werden kann, 5.000 Euro die Woche, 10.000 Euro die Woche..."}, {"id": 588, "start": 4442.7, "end": 4447.7, "text": "Also du schickst, du schickst deine Sachen quasi an Amazon, an irgendein Amazon Logistikzentrum,"}, {"id": 589, "start": 4447.7, "end": 4451.7, "text": "lässt es da lagern und Amazon verschickt es dann, wenn es einer kauft."}, {"id": 590, "start": 4451.7, "end": 4452.7, "text": "Geld verdienen."}, {"id": 591, "start": 4452.7, "end": 4454.7, "text": "Und was Fulfillment by Amazon eigentlich ist..."}, {"id": 592, "start": 4454.7, "end": 4458.7, "text": "Damit kann man, damit kann man, damit wusste ich gar nicht, dass man damit angeblich krass Geld machen kann."}, {"id": 593, "start": 4458.7, "end": 4463.7, "text": "...das Amazon dir anbietet, okay, wenn du ein Produkt hast, schick es einfach in unsere Lagerhäuser,"}, {"id": 594, "start": 4463.7, "end": 4467.7, "text": "wir verkaufen das für dich auf unserer Plattform, also beziehungsweise wir schicken es halt raus,"}, {"id": 595, "start": 4467.7, "end": 4471.7, "text": "wir holen es zurück, wir machen Returns, Kundenservice und halt alles für eine Commission..."}, {"id": 596, "start": 4471.7, "end": 4476.7, "text": "Na Moment, Moment, Moment, du schickst das palettenweise an Amazon und die machen den Rest,"}, {"id": 597, "start": 4476.7, "end": 4479.7, "text": "so einfach ist es ja nicht, denn Scheiß muss ja jemand erstmal kaufen."}, {"id": 598, "start": 4479.7, "end": 4485.7, "text": "Du musst den Kram einkaufen und du musst, du musst dafür sorgen, dass die Leute den Kram verkaufen"}, {"id": 599, "start": 4485.7, "end": 4487.7, "text": "und dann musst du auch irgendwie Gewinn mitmachen."}, {"id": 600, "start": 4487.7, "end": 4493.7, "text": "Einige smarte Leute haben mal gedacht, oha, was, wenn wir einfach super billige China-Produkte nehmen, so Handy-Cases..."}, {"id": 601, "start": 4493.7, "end": 4495.7, "text": "China-Chinesen-Kram, beste Idee."}, {"id": 602, "start": 4495.7, "end": 4497.7, "text": "High-Quality-Produkte kommen immer gut an."}, {"id": 603, "start": 4497.7, "end": 4501.7, "text": "...Kram verkaufen, so, oder ist auch was für Small Businesses, et cetera, et cetera."}, {"id": 604, "start": 4501.7, "end": 4505.7, "text": "Und dafür bietet Simon jetzt ein krasses Coaching an, weil er behauptet, dass er damit auch unfassbar..."}, {"id": 605, "start": 4505.7, "end": 4510.7, "text": "Um alles in der Welt braucht man da Coaching....viel Geld verdient, er ist einfach der FBA-Gott."}, {"id": 606, "start": 4510.7, "end": 4515.7, "text": "Dafür hat er eine super billige Clickfunnels-Page erstellt, deswegen sehen die übrigens alle mal gleich aus,"}, {"id": 607, "start": 4515.7, "end": 4519.7, "text": "weil es dafür so einen Service quasi gibt, clickfunnels.com."}, {"id": 608, "start": 4519.7, "end": 4523.7, "text": "Er hat bei seiner geilen Clickfunnels-Seite nicht mal den Infotext der Webseite geändert."}, {"id": 609, "start": 4523.7, "end": 4530.7, "text": "Da steht tatsächlich No-Cost-Training vor, in eckigen Klammern Market, weil man da halt dann einfügen soll..."}, {"id": 610, "start": 4530.7, "end": 4533.7, "text": "Ja gut, jetzt kann sie nicht erwarten, dass Simon Desue irgendein krasser Webdesigner ist."}, {"id": 611, "start": 4533.7, "end": 4538.7, "text": "...No-Cost-Training macht, also der hat das Template nicht mal vernünftig angepasst, das ist so billig."}, {"id": 612, "start": 4538.7, "end": 4540.7, "text": "Man kann nicht sehen, wer die Domain registriert hat."}, {"id": 613, "start": 4540.7, "end": 4547.7, "text": "Und mit seinem geilen Amazon-Dropshipping verdient er bestimmt auch nicht genug, dass er da mal einen Webdesigner bezahlen kann."}, {"id": 614, "start": 4547.7, "end": 4551.7, "text": "Da hat er anonymisiert, schade. Es gibt auf jeden Fall dieses Video, in dem er das alles..."}, {"id": 615, "start": 4551.7, "end": 4555.7, "text": "Ich glaube, er müsste mal gecoacht werden, wie man eine Webseite macht."}, {"id": 616, "start": 4555.7, "end": 4558.7, "text": "Das ist super ekelhaft aufgebaut, natürlich."}, {"id": 617, "start": 4558.7, "end": 4564.7, "text": "Letztes Jahr wurden auf Amazon über 386 Milliarden Dollar umgesetzt."}, {"id": 618, "start": 4564.7, "end": 4565.7, "text": "Ja und?"}, {"id": 619, "start": 4565.7, "end": 4569.7, "text": "54% davon kommen von Verkäufern, wie ich es bin."}, {"id": 620, "start": 4569.7, "end": 4574.7, "text": "Und er sagt dann so richtig diepe, also wirklich tiefgehende, motivierende Sachen wie..."}, {"id": 621, "start": 4574.7, "end": 4577.7, "text": "Und der Knackpunkt einfach machen und tun."}, {"id": 622, "start": 4577.7, "end": 4579.7, "text": "Und auf Instagram hat er noch ein Video veröffentlicht..."}, {"id": 623, "start": 4579.7, "end": 4581.7, "text": "Machen und tun?"}, {"id": 624, "start": 4581.7, "end": 4584.7, "text": "Boah!"}, {"id": 625, "start": 4584.7, "end": 4585.7, "text": "Huge Coaching!"}, {"id": 626, "start": 4585.7, "end": 4588.7, "text": "Ein Teilnehmer seines geilen Seminars, der in..."}, {"id": 627, "start": 4588.7, "end": 4590.7, "text": "Das ist wie..."}, {"id": 628, "start": 4590.7, "end": 4594.7, "text": "Das ist wie wenn in irgendeinem Online-Game, um zu gewinnen, dich jemand coacht..."}, {"id": 629, "start": 4594.7, "end": 4599.7, "text": "Also stell dir mal vor, ihr wolltet gut werden in einem Online-Spiel und lasst euch von einem Pro coachen."}, {"id": 630, "start": 4599.7, "end": 4604.7, "text": "Und der Coach sagt einfach zu euch, einfach nicht sterben."}, {"id": 631, "start": 4604.7, "end": 4606.7, "text": "Einfach nicht sterben und alle Gegner killen."}, {"id": 632, "start": 4606.7, "end": 4610.7, "text": "Das ist ungefähr genauso gehaltvoll wie dieses Coaching."}, {"id": 633, "start": 4610.7, "end": 4616.7, "text": "Hat irgendwie was von KLS-Vibes, ja klar, weil das alles der gleiche Crap ist."}, {"id": 634, "start": 4616.7, "end": 4618.7, "text": "50 Dollar verdient hat."}, {"id": 635, "start": 4618.7, "end": 4621.7, "text": "Dieses Gefühl kann ich nicht in Worte fassen."}, {"id": 636, "start": 4621.7, "end": 4624.7, "text": "Und wie viel hast du seit dem Start verdient?"}, {"id": 637, "start": 4624.7, "end": 4629.7, "text": "Die sehen beide wie super vertrauenswürdige Menschen aus, denen man jedes Wort glauben kann."}, {"id": 638, "start": 4629.7, "end": 4631.7, "text": "Vor allem..."}, {"id": 639, "start": 4631.7, "end": 4633.7, "text": "Ist das eine Goldkette, eine Silberkette?"}, {"id": 640, "start": 4633.7, "end": 4636.7, "text": "Wahrscheinlich auch irgendwie krasser Markenpulli, aber mit sowas kenne ich mich nicht aus."}, {"id": 641, "start": 4636.7, "end": 4639.7, "text": "Alles sehr vertrauenswürdige Leute."}, {"id": 642, "start": 4639.7, "end": 4641.7, "text": "Das ist kein Screenshot."}, {"id": 643, "start": 4641.7, "end": 4642.7, "text": "Moment, was?"}, {"id": 644, "start": 4642.7, "end": 4644.7, "text": "4856 US-Dollar."}, {"id": 645, "start": 4644.7, "end": 4646.7, "text": "Im Monat."}, {"id": 646, "start": 4646.7, "end": 4650.7, "text": "Gut, kommt auf die Menge an, die du verkaufst."}, {"id": 647, "start": 4650.7, "end": 4652.7, "text": "Das ist kein Screenshot."}, {"id": 648, "start": 4652.7, "end": 4653.7, "text": "Oder in sieben Tagen."}, {"id": 649, "start": 4653.7, "end": 4656.7, "text": "Es kommt auf die Menge an, die du verkaufst."}, {"id": 650, "start": 4656.7, "end": 4659.7, "text": "Das ist..."}, {"id": 651, "start": 4659.7, "end": 4660.7, "text": "Das geht schon."}, {"id": 652, "start": 4660.7, "end": 4662.7, "text": "Es ist halt die Frage, wie viel du verkaufst."}, {"id": 653, "start": 4662.7, "end": 4665.7, "text": "Und die Frage ist ja nicht nur, wie viel du verkaufst."}, {"id": 654, "start": 4665.7, "end": 4668.7, "text": "Die Frage ist ja auch, was bringt dir das im Endeffekt?"}, {"id": 655, "start": 4668.7, "end": 4670.7, "text": "Ich meine, du musst den Kram bestellen."}, {"id": 656, "start": 4670.7, "end": 4675.7, "text": "Du musst den Kram eventuell irgendwo zwischenlagern, bevor es zu Amazon, was weiß ich, über welche Ecken du das schickst."}, {"id": 657, "start": 4675.7, "end": 4676.7, "text": "Du musst verkaufen."}, {"id": 658, "start": 4676.7, "end": 4678.7, "text": "Du musst Steuern bezahlen."}, {"id": 659, "start": 4678.7, "end": 4681.7, "text": "Also die Frage ist, was bleibt am Ende übrig?"}, {"id": 660, "start": 4681.7, "end": 4685.7, "text": "Ich meine, 5000 Dollar in sieben Tagen ist jetzt sicherlich nicht wenig."}, {"id": 661, "start": 4685.7, "end": 4688.7, "text": "Aber es kommt halt auf die Umstände an."}, {"id": 662, "start": 4688.7, "end": 4690.7, "text": "Es kann sein, dass davon kaum was übrig bleibt."}, {"id": 663, "start": 4690.7, "end": 4692.7, "text": "Aktualisieren."}, {"id": 664, "start": 4692.7, "end": 4695.7, "text": "Ja, das ist wohl kein Screenshot."}, {"id": 665, "start": 4695.7, "end": 4701.7, "text": "Aber leider sind Produktverkäufe der Umsatz der letzten sieben Tage, nicht der Profit."}, {"id": 666, "start": 4701.7, "end": 4705.7, "text": "In einfachen Worten, du kannst zwar 1000 Produkte für 5 Euro verkaufen."}, {"id": 667, "start": 4705.7, "end": 4707.7, "text": "Das ist das, was ich im Prinzip sagen wollte."}, {"id": 668, "start": 4707.7, "end": 4709.7, "text": "Sie fragen, was am Ende rauskommt."}, {"id": 669, "start": 4709.7, "end": 4713.7, "text": "Wenn du aber nur 5 Cent Gewinn pro Stück machst, naja."}, {"id": 670, "start": 4713.7, "end": 4719.7, "text": "Aber es gibt noch mehr Anzeichen, dass das Ganze mit hoher Wahrscheinlichkeit ein saftiger Scam ist."}, {"id": 671, "start": 4719.7, "end": 4722.7, "text": "Das erste ist, dass die amerikanische Federal Trading Machine genau die..."}, {"id": 672, "start": 4722.7, "end": 4726.7, "text": "Das ist davon abgesehen, so eine Seite zum Refreshen mit irgendwelchen Zahlen drauf,"}, {"id": 673, "start": 4726.7, "end": 4730.7, "text": "kann dir jeder halbwegs kompetente Typ bauen."}, {"id": 674, "start": 4730.7, "end": 4734.7, "text": "Diese Fälle verfolgt, nämlich so Get Rich Schemes von wannabe Amazon Seller."}, {"id": 675, "start": 4734.7, "end": 4739.7, "text": "Und wenn man sich das so durchlässt, dann denkt man, dass die direkt Simon verklagt haben eigentlich."}, {"id": 676, "start": 4739.7, "end": 4743.7, "text": "Get started selling on Amazon and make 5 to 10.000 Dollars in the next 30 days,"}, {"id": 677, "start": 4743.7, "end": 4746.7, "text": "even if you've never sold anything online before."}, {"id": 678, "start": 4746.7, "end": 4747.7, "text": "Hört sich ähnlich an, ja."}, {"id": 679, "start": 4747.7, "end": 4750.7, "text": "Das klingt ja fast genau wie das Schema von Simon."}, {"id": 680, "start": 4750.7, "end": 4752.7, "text": "Und das Lustige ist, dass diese Masche super alt ist."}, {"id": 681, "start": 4752.7, "end": 4756.7, "text": "Also diese Klage von der FTC ist von 2018 oder so."}, {"id": 682, "start": 4756.7, "end": 4763.7, "text": "Hier gibt es einen Artikel von The Atlantic Anfang 2019 über diesen Gold Rush auf Amazon FBA macht dich reich"}, {"id": 683, "start": 4763.7, "end": 4768.7, "text": "und dass da Leute eben übelst heftig über die Ohren gehauen wurden von diesen krassen Coaches."}, {"id": 684, "start": 4768.7, "end": 4771.7, "text": "Die Leute sind aber auch so blöd."}, {"id": 685, "start": 4771.7, "end": 4772.7, "text": "Die sind aber auch so blöd."}, {"id": 686, "start": 4772.7, "end": 4774.7, "text": "Warum macht man da mit?"}, {"id": 687, "start": 4774.7, "end": 4776.7, "text": "Ich kann das nicht verstehen."}, {"id": 688, "start": 4776.7, "end": 4778.7, "text": "Okay, es ist ja, die richten sich ja absichtlich."}, {"id": 689, "start": 4778.7, "end": 4780.7, "text": "Doch, ich kann es verstehen."}, {"id": 690, "start": 4780.7, "end": 4787.7, "text": "Die richten sich ja absichtlich an Pepega Leute, die man einfach übers Ohr hauen kann mit sowas."}, {"id": 691, "start": 4787.7, "end": 4793.7, "text": "2021 überlegt, dass es Zeit wird, dass er das mal in Deutschland probiert, I guess."}, {"id": 692, "start": 4793.7, "end": 4794.7, "text": "I don't know."}, {"id": 693, "start": 4794.7, "end": 4796.7, "text": "Einfach machen und tun."}, {"id": 694, "start": 4796.7, "end": 4798.7, "text": "Die Artikel haben wir euch alle verlinkt und so."}, {"id": 695, "start": 4798.7, "end": 4800.7, "text": "Also falls ihr euch da noch ein bisschen analysieren wollt."}, {"id": 696, "start": 4800.7, "end": 4808.7, "text": "Das ist genauso wie diese Videos, die Karl S. immer macht mit seinen, was weiß ich, 5 Millionen Uhren."}, {"id": 697, "start": 4808.7, "end": 4811.7, "text": "Und dann hat er irgendwie so ein komisches Case mit Uhren drin,"}, {"id": 698, "start": 4811.7, "end": 4816.7, "text": "die er danach wahrscheinlich wieder abgibt da, wo er sich ausgeliehen hat."}, {"id": 699, "start": 4816.7, "end": 4821.7, "text": "2018 haben sich bei der FTC 50 Leute beschwert, dass sie da unglaublich viel Geld mit verloren haben,"}, {"id": 700, "start": 4821.7, "end": 4825.7, "text": "weil ihnen versprochen wurde, boah, FBA macht dich reich, hol dir irgendein Billo-China-Produkt,"}, {"id": 701, "start": 4825.7, "end": 4831.7, "text": "zell das, zell das, zell das, dann machst du deine 5 bis 10.000 Dollar die Woche Quatsch natürlich."}, {"id": 702, "start": 4831.7, "end": 4835.7, "text": "Und 25 von denen haben über 35.000 Dollar verloren."}, {"id": 703, "start": 4835.7, "end": 4842.7, "text": "Gut, man sieht aber schon an einer Sache, dass die Leute auf allen Seiten echt doof sind."}, {"id": 704, "start": 4842.7, "end": 4847.7, "text": "Nämlich dadurch, dass so eine Seite wie Wish.com überhaupt existiert."}, {"id": 705, "start": 4847.7, "end": 4854.7, "text": "Wish ist die Seite für China-Scammer, wo die Leute zu dumm sind, in China selbst zu bestellen."}, {"id": 706, "start": 4854.7, "end": 4859.7, "text": "Also sprich, die einzige Existenzberechtigung von Wish ist,"}, {"id": 707, "start": 4859.7, "end": 4862.7, "text": "weil Leute unfähig sind, in China zu bestellen,"}, {"id": 708, "start": 4862.7, "end": 4868.7, "text": "weil die Leute nicht in der Lage sind, auf AliExpress zu gehen und sich was zu bestellen."}, {"id": 709, "start": 4868.7, "end": 4872.7, "text": "Genau, Wish heißt, ich kenne AliExpress nicht, ich bin zu dumm, bei AliExpress zu bestellen."}, {"id": 710, "start": 4872.7, "end": 4873.7, "text": "Das ist Wish."}, {"id": 711, "start": 4873.7, "end": 4878.7, "text": "Also Wish ist eigentlich die einzige, also Wish existiert nur,"}, {"id": 712, "start": 4878.7, "end": 4882.7, "text": "weil Leute zu dumm sind, bei AliExpress was zu bestellen."}, {"id": 713, "start": 4882.7, "end": 4885.7, "text": "Und den haben über 35.000 Dollar verloren."}, {"id": 714, "start": 4885.7, "end": 4889.7, "text": "Aber Simon Desue bietet auf jeden Fall ein Live-Training an, das ist alles live."}, {"id": 715, "start": 4889.7, "end": 4894.7, "text": "Also da ist man dann im Live-Chat mit ihm und kann sich live angucken,"}, {"id": 716, "start": 4894.7, "end": 4897.7, "text": "was er dann sozusagen hat im Chat mit anderen Leuten."}, {"id": 717, "start": 4897.7, "end": 4902.7, "text": "Nur leider hat TJ, ganz liebe Grüße gehen raus, falls du das siehst,"}, {"id": 718, "start": 4902.7, "end": 4908.7, "text": "schon demonstriert, dass das angebliche Live-Video natürlich nicht live ist."}, {"id": 719, "start": 4908.7, "end": 4914.7, "text": "Ich frage mich, ob der Chat wenigstens wirklich echte Leute sind oder Bots,"}, {"id": 720, "start": 4914.7, "end": 4917.7, "text": "dass es Aktivität faked, obwohl du der einzige Zuschauer bist."}, {"id": 721, "start": 4917.7, "end": 4921.7, "text": "Leute natürlich auch darauf hin, dass es einfach eine prerecordete Masche ist."}, {"id": 722, "start": 4921.7, "end": 4923.7, "text": "Es wird keine Wiederholung geben."}, {"id": 723, "start": 4923.7, "end": 4924.7, "text": "Nein, auf gar keinen Fall."}, {"id": 724, "start": 4924.7, "end": 4925.7, "text": "Es wird keine Wiederholung geben."}, {"id": 725, "start": 4925.7, "end": 4929.7, "text": "Das Impressum von simonvideos.com slash live-training führt dann einfach zu"}, {"id": 726, "start": 4929.7, "end": 4935.7, "text": "getclients.com und getclients.com."}, {"id": 727, "start": 4935.7, "end": 4939.7, "text": "Es ist ein Learning Portal für Leute mit digital Product Businesses,"}, {"id": 728, "start": 4939.7, "end": 4942.7, "text": "also für Coaches, Course Creators und so weiter und so fort."}, {"id": 729, "start": 4942.7, "end": 4944.7, "text": "Vertrauenswürdig hoch 10."}, {"id": 730, "start": 4944.7, "end": 4947.7, "text": "So wie Simon und dann stehen da so Sachen wie..."}, {"id": 731, "start": 4947.7, "end": 4951.7, "text": "Diese Bilder, diese Bilder triggern mich auch immer richtig."}, {"id": 732, "start": 4951.7, "end": 4954.7, "text": "Simon und dann stehen da..."}, {"id": 733, "start": 4954.7, "end": 4957.7, "text": "Diese Bilder, das ist einfach immer..."}, {"id": 734, "start": 4957.7, "end": 4961.7, "text": "Das ist, weil die Leute sind für sowas empfänglich."}, {"id": 735, "start": 4961.7, "end": 4962.7, "text": "Anders kann ich es mir nicht erklären."}, {"id": 736, "start": 4962.7, "end": 4966.7, "text": "Du bildest irgendwelche jungen Leute auf dem Schiff ab"}, {"id": 737, "start": 4966.7, "end": 4970.7, "text": "und irgendwie sollen die Leute dann denken,"}, {"id": 738, "start": 4970.7, "end": 4973.7, "text": "wenn man bei ihnen mal einen Kurs gemacht hat,"}, {"id": 739, "start": 4973.7, "end": 4976.7, "text": "dann geht es so steil aufwärts, dass man in einem halben Jahr"}, {"id": 740, "start": 4976.7, "end": 4979.7, "text": "in der Karibik auf einem Boot rumschippert"}, {"id": 741, "start": 4979.7, "end": 4981.7, "text": "und automatisch durch Nichtstun Geld verdient."}, {"id": 742, "start": 4981.7, "end": 4987.7, "text": "Allein schon wenn ich solche Bilder sehe, weißt du, es ist Scam."}, {"id": 743, "start": 4987.7, "end": 4993.7, "text": "Also wenn Leute im Internet versprechen, dich reich zu machen"}, {"id": 744, "start": 4993.7, "end": 4995.7, "text": "und ihr Impressum verlinkt auf eine Seite,"}, {"id": 745, "start": 4995.7, "end": 4998.7, "text": "in der ein Typ dir verspricht, dich mit Kursen..."}, {"id": 746, "start": 4998.7, "end": 5001.7, "text": "Weißt du, was mich auch immer so wahnsinnig triggert"}, {"id": 747, "start": 5001.7, "end": 5004.7, "text": "bei diesen ganzen Coach-Dingern?"}, {"id": 748, "start": 5004.7, "end": 5007.7, "text": "Das sind alles mega junge Leute."}, {"id": 749, "start": 5007.7, "end": 5010.7, "text": "Ich sage nicht, dass es nicht junge Leute gibt,"}, {"id": 750, "start": 5010.7, "end": 5013.7, "text": "die erfolgreich sein können, aber das sind meistens so,"}, {"id": 751, "start": 5013.7, "end": 5017.7, "text": "keine Ahnung, 23-, 24-, 25-jährige Leute,"}, {"id": 752, "start": 5017.7, "end": 5019.7, "text": "die dir dann erzählen sollen,"}, {"id": 753, "start": 5019.7, "end": 5022.7, "text": "so baust du dein weltweites Business auf."}, {"id": 754, "start": 5022.7, "end": 5026.7, "text": "Wie will der das denn beurteilen können mit 25?"}, {"id": 755, "start": 5026.7, "end": 5030.7, "text": "Selbst wenn es Leute gibt, und die gibt es,"}, {"id": 756, "start": 5030.7, "end": 5034.7, "text": "die mit 25 Jahren ein richtig krasses Business haben,"}, {"id": 757, "start": 5034.7, "end": 5038.7, "text": "lohnenswert darüber zu berichten nach dem Motto,"}, {"id": 758, "start": 5038.7, "end": 5040.7, "text": "ich habe jetzt hier einen weltweiten..."}, {"id": 759, "start": 5040.7, "end": 5042.7, "text": "Das machst du dann, keine Ahnung, mit 40 oder so,"}, {"id": 760, "start": 5042.7, "end": 5045.7, "text": "dass du sagst, guck mal, so ist es, das ist meine Erfahrung,"}, {"id": 761, "start": 5045.7, "end": 5050.7, "text": "aber es wirkt einfach total unglaubwürdig,"}, {"id": 762, "start": 5050.7, "end": 5054.7, "text": "wenn das alles irgendwie 25-jährige Speaker sind."}, {"id": 763, "start": 5054.7, "end": 5057.7, "text": "Verlinkt auf eine Seite, in der ein Typ dir verspricht,"}, {"id": 764, "start": 5057.7, "end": 5060.7, "text": "dich mit Kursen darüber, wie man Kurse macht..."}, {"id": 765, "start": 5060.7, "end": 5062.7, "text": "Und die, die in dem Alter wirklich diese Kohle haben,"}, {"id": 766, "start": 5062.7, "end": 5064.7, "text": "was anderes tun, auf solche Dinge zu gehen."}, {"id": 767, "start": 5064.7, "end": 5067.7, "text": "...reich zu machen, reich zu machen, dann weißt du..."}, {"id": 768, "start": 5067.7, "end": 5069.7, "text": "Mal ganz davon abgesehen, eine Sache,"}, {"id": 769, "start": 5069.7, "end": 5071.7, "text": "die ich nie verstehen werde,"}, {"id": 770, "start": 5071.7, "end": 5074.7, "text": "bei solchen Dingern ist, wenn ich wirklich"}, {"id": 771, "start": 5074.7, "end": 5077.7, "text": "den ultimativen Trick rausbekomme,"}, {"id": 772, "start": 5077.7, "end": 5079.7, "text": "dann muss man sich mal überlegen,"}, {"id": 773, "start": 5079.7, "end": 5081.7, "text": "stellen euch mal vor, ihr habt wirklich"}, {"id": 774, "start": 5081.7, "end": 5083.7, "text": "den ultimativen Trick rausbekommen,"}, {"id": 775, "start": 5083.7, "end": 5086.7, "text": "diese eine Masche, mit der ihr ohne viel zu arbeiten"}, {"id": 776, "start": 5086.7, "end": 5088.7, "text": "richtig krass reich werden könntet,"}, {"id": 777, "start": 5088.7, "end": 5092.7, "text": "würdet ihr das allen Ernstes für ein Apfel und ein Ei"}, {"id": 778, "start": 5092.7, "end": 5095.7, "text": "an jeden auf dieser Welt verkaufen, diese Information?"}, {"id": 779, "start": 5095.7, "end": 5099.7, "text": "Im Leben nicht, niemals würde ich das verkaufen."}, {"id": 780, "start": 5099.7, "end": 5102.7, "text": "So dumm kannst du noch nicht sein."}, {"id": 781, "start": 5102.7, "end": 5105.7, "text": "Alleine schon aus diesem Gesichtspunkt sind"}, {"id": 782, "start": 5105.7, "end": 5107.7, "text": "diese ganzen Coaching schon immer sehr fragwürdig."}, {"id": 783, "start": 5107.7, "end": 5110.7, "text": "Die tun immer so, als hätten sie die Weisheit"}, {"id": 784, "start": 5110.7, "end": 5112.7, "text": "mit Löffeln gefressen und wissen das,"}, {"id": 785, "start": 5112.7, "end": 5114.7, "text": "was niemand außer ihnen auf der Welt weiß."}, {"id": 786, "start": 5114.7, "end": 5116.7, "text": "Und dann fragt man sich ja natürlich,"}, {"id": 787, "start": 5116.7, "end": 5118.7, "text": "wenn die doch so krass schlau sind,"}, {"id": 788, "start": 5118.7, "end": 5121.7, "text": "warum machen sie es nicht einfach, ohne jemand zu erzählen?"}, {"id": 789, "start": 5123.7, "end": 5126.7, "text": "Okay, das ist der kurze Rundown von"}, {"id": 790, "start": 5126.7, "end": 5129.7, "text": "Simons neuem mutmaßlichen Scam."}, {"id": 791, "start": 5129.7, "end": 5131.7, "text": "Und jetzt vielleicht mal so zum Ernst der Lage"}, {"id": 792, "start": 5131.7, "end": 5134.7, "text": "für eine Sekunde. Simon Desue hat so 2 Millionen"}, {"id": 793, "start": 5134.7, "end": 5136.7, "text": "Follower auf Instagram. Ja, verstehe, das ist mir"}, {"id": 794, "start": 5136.7, "end": 5138.7, "text": "absolut unverständlich, aber okay."}, {"id": 795, "start": 5138.7, "end": 5141.7, "text": "Und bewirbt ganz offensichtlich eine Masche,"}, {"id": 796, "start": 5141.7, "end": 5143.7, "text": "also ich sag euch mal ernsthaft, bevor ich"}, {"id": 797, "start": 5143.7, "end": 5146.7, "text": "Amazon Drop Tripping mit Simon Desue mache,"}, {"id": 798, "start": 5146.7, "end": 5149.7, "text": "dann gehe ich lieber mit Carl auf den Mount Everest."}, {"id": 799, "start": 5149.7, "end": 5151.7, "text": "Und das würde ich auch nicht machen."}, {"id": 800, "start": 5151.7, "end": 5153.7, "text": "Und dann spricht er absichtlich den kleinen Mann an,"}, {"id": 801, "start": 5153.7, "end": 5155.7, "text": "den Arbeitnehmer, denjenigen, der sich vielleicht"}, {"id": 802, "start": 5155.7, "end": 5158.7, "text": "am einfachsten von solchen Versprechen locken lässt,"}, {"id": 803, "start": 5158.7, "end": 5161.7, "text": "weil der oder diejenige vielleicht am wenigsten hat."}, {"id": 804, "start": 5161.7, "end": 5163.7, "text": "Was hast du jetzt vorher gemacht in der Ausbildung?"}, {"id": 805, "start": 5163.7, "end": 5166.7, "text": "Wie viel hast du da verdient, wenn ich fragen darf?"}, {"id": 806, "start": 5166.7, "end": 5168.7, "text": "Wenn ich fragen darf? Nein!"}, {"id": 807, "start": 5168.7, "end": 5171.7, "text": "Stell euch mal vor, der Mensch sagt, nein, darfst du nicht."}, {"id": 808, "start": 5171.7, "end": 5173.7, "text": "Ist ja überhaupt nicht gescriptet."}, {"id": 809, "start": 5173.7, "end": 5175.7, "text": "180 Euro netto."}, {"id": 810, "start": 5175.7, "end": 5178.7, "text": "Du hast jetzt das sozusagen in einer Woche schon mehr verdient."}, {"id": 811, "start": 5178.7, "end": 5180.7, "text": "Ach, das Fünffache."}, {"id": 812, "start": 5180.7, "end": 5183.7, "text": "Simon Desue ist einfach so eine Person..."}, {"id": 813, "start": 5183.7, "end": 5185.7, "text": "Oh, meine Güte."}, {"id": 814, "start": 5185.7, "end": 5187.7, "text": "...und Luxus pflegt und versucht, aufrecht zu erhalten"}, {"id": 815, "start": 5187.7, "end": 5190.7, "text": "mit gestellten Bildern, mit teuren Autos,"}, {"id": 816, "start": 5190.7, "end": 5194.7, "text": "mit prolligen Roomtouren, mit seinem Influencer-Leben in Dubai."}, {"id": 817, "start": 5194.7, "end": 5196.7, "text": "Dazu wurde ja auch schon genug gesagt,"}, {"id": 818, "start": 5196.7, "end": 5198.7, "text": "zum Beispiel von Jan Böhmermann."}, {"id": 819, "start": 5198.7, "end": 5200.7, "text": "Und seine Maschen sind dann Dinge, mit denen er ganz gezielt"}, {"id": 820, "start": 5200.7, "end": 5202.7, "text": "Menschen mit wenig Geld anvisiert."}, {"id": 821, "start": 5202.7, "end": 5204.7, "text": "Viele werden jetzt denken, so was, Ausbildung abbrechen,"}, {"id": 822, "start": 5204.7, "end": 5206.7, "text": "aber lohnt sich auf jeden Fall für Amazon,"}, {"id": 823, "start": 5206.7, "end": 5208.7, "text": "dank Simon natürlich."}, {"id": 824, "start": 5208.7, "end": 5210.7, "text": "Natürlich, was sonst?"}, {"id": 825, "start": 5216.7, "end": 5218.7, "text": "Oh, das tut ja weh."}, {"id": 826, "start": 5233.7, "end": 5235.7, "text": "Entweder werde ich abgezogen oder nicht."}, {"id": 827, "start": 5235.7, "end": 5238.7, "text": "Aber ich habe vertraut, ich habe vertraut."}, {"id": 828, "start": 5238.7, "end": 5242.7, "text": "Das ist natürlich das krasseste Argument schlechthin."}, {"id": 829, "start": 5242.7, "end": 5245.7, "text": "Die Scammer sagen dir, du sollst den Scammern vertrauen."}, {"id": 830, "start": 5245.7, "end": 5247.7, "text": "Das wirkt aber vertrauenswürdig."}, {"id": 831, "start": 5252.7, "end": 5253.7, "text": "Ohne Scheiß."}, {"id": 832, "start": 5253.7, "end": 5255.7, "text": "Ich würde Geld dafür bezahlen,"}, {"id": 833, "start": 5255.7, "end": 5265.7, "text": "wenn ich nicht den Interview mit Simon Desue hätte."}, {"id": 834, "start": 5265.7, "end": 5285.7, "text": "Oh, sorry, du bezahlst zu wenig Geld raus."}, {"id": 835, "start": 5291.7, "end": 5293.7, "text": "Dass da immer noch Leute drauf reinfallen,"}, {"id": 836, "start": 5293.7, "end": 5295.7, "text": "ich werde es nicht verstehen."}, {"id": 837, "start": 5295.7, "end": 5297.7, "text": "Das tut weh beim Zuhören."}, {"id": 838, "start": 5297.7, "end": 5299.7, "text": "Ja, ist echt so."}, {"id": 839, "start": 5299.7, "end": 5301.7, "text": "Es schmerzt beim Zuhören."}, {"id": 840, "start": 5301.7, "end": 5303.7, "text": "Was ich daran schade finde,"}, {"id": 841, "start": 5303.7, "end": 5305.7, "text": "dass es oftmals die Leute trifft,"}, {"id": 842, "start": 5305.7, "end": 5307.7, "text": "die vielleicht schon ein bisschen,"}, {"id": 843, "start": 5307.7, "end": 5309.7, "text": "wie nennt man denn Leute,"}, {"id": 844, "start": 5309.7, "end": 5311.7, "text": "leichtträubig, gutgläubig,"}, {"id": 845, "start": 5311.7, "end": 5315.7, "text": "oder vielleicht gar nicht mal so sehr."}, {"id": 846, "start": 5315.7, "end": 5317.7, "text": "Vielleicht sind das einfach wirklich auch Leute,"}, {"id": 847, "start": 5317.7, "end": 5321.7, "text": "die Simon Desue schon seit, keine Ahnung, 2013,"}, {"id": 848, "start": 5321.7, "end": 5323.7, "text": "oder der ist ja noch länger als ich auf YouTube,"}, {"id": 849, "start": 5323.7, "end": 5325.7, "text": "der ist ja 2009 oder irgendwie so,"}, {"id": 850, "start": 5325.7, "end": 5327.7, "text": "seit 2009 auf YouTube folgen"}, {"id": 851, "start": 5327.7, "end": 5331.7, "text": "und irgendwie mit ihm da lustige, gute Sachen verbinden,"}, {"id": 852, "start": 5331.7, "end": 5333.7, "text": "was auch immer, ja,"}, {"id": 853, "start": 5333.7, "end": 5335.7, "text": "und einfach ein bisschen leichtgläubig sind"}, {"id": 854, "start": 5335.7, "end": 5337.7, "text": "und denken, so diese Masche,"}, {"id": 855, "start": 5337.7, "end": 5339.7, "text": "was ja auch immer gerne erzählt wird,"}, {"id": 856, "start": 5339.7, "end": 5341.7, "text": "ist so nach dem Motto, Leute, ich habe schon alles erreicht,"}, {"id": 857, "start": 5341.7, "end": 5343.7, "text": "aber jetzt ist es Zeit, dass ich ja meine Community"}, {"id": 858, "start": 5343.7, "end": 5345.7, "text": "mal was zurückgebe, jetzt zeige ich euch,"}, {"id": 859, "start": 5345.7, "end": 5347.7, "text": "wie ich es gemacht habe."}, {"id": 860, "start": 5347.7, "end": 5349.7, "text": "Das ist ja oftmals die Masche auch,"}, {"id": 861, "start": 5349.7, "end": 5351.7, "text": "die dann wirklich glauben,"}, {"id": 862, "start": 5351.7, "end": 5353.7, "text": "so nach dem Motto, so ein guter Mensch,"}, {"id": 863, "start": 5353.7, "end": 5355.7, "text": "der gibt den Leuten jetzt was zurück"}, {"id": 864, "start": 5355.7, "end": 5357.7, "text": "und erzählt ihnen, wie es wirklich geht"}, {"id": 865, "start": 5357.7, "end": 5359.7, "text": "und wie dann darauf reinfallen."}, {"id": 866, "start": 5359.7, "end": 5361.7, "text": "Das Bittere ist halt, dass es tatsächlich"}, {"id": 867, "start": 5361.7, "end": 5363.7, "text": "die letzten verbliebenen richtigen Fans trifft,"}, {"id": 868, "start": 5363.7, "end": 5365.7, "text": "die er hat,"}, {"id": 869, "start": 5365.7, "end": 5367.7, "text": "und die verarscht er dann auch noch."}, {"id": 870, "start": 5367.7, "end": 5369.7, "text": "Das ist halt für'n Arsch."}, {"id": 871, "start": 5369.7, "end": 5371.7, "text": "Aber gut, so sind die Leute halt."}, {"id": 872, "start": 5371.7, "end": 5373.7, "text": "Also solche Leute."}, {"id": 873, "start": 5373.7, "end": 5381.7, "text": "Da machst du nix."}, {"id": 874, "start": 5381.7, "end": 5383.7, "text": "Gibt es denn ein Scam-FPS-Business-Programm"}, {"id": 875, "start": 5383.7, "end": 5385.7, "text": "mit Herr Endpunkt?"}, {"id": 876, "start": 5385.7, "end": 5387.7, "text": "Herr Endpunkt meldet sich"}, {"id": 877, "start": 5387.7, "end": 5389.7, "text": "in letzter Zeit leider im Discord nicht mehr."}, {"id": 878, "start": 5389.7, "end": 5391.7, "text": "Ich wollte mit ihm ja ein Video aufnehmen."}, {"id": 879, "start": 5391.7, "end": 5393.7, "text": "Er weiß nicht, ob ich euch das erzählt habe,"}, {"id": 880, "start": 5393.7, "end": 5395.7, "text": "er hat sich ja gemeldet im Discord."}, {"id": 881, "start": 5395.7, "end": 5397.7, "text": "Ich habe jetzt auch verraten,"}, {"id": 882, "start": 5397.7, "end": 5399.7, "text": "dass er Niklas heißt,"}, {"id": 883, "start": 5399.7, "end": 5401.7, "text": "das hat er mir erlaubt."}, {"id": 884, "start": 5401.7, "end": 5403.7, "text": "Und ich wollte mit ihm eigentlich"}, {"id": 885, "start": 5403.7, "end": 5405.7, "text": "ein Video aufnehmen,"}, {"id": 886, "start": 5405.7, "end": 5407.7, "text": "aber irgendwie ist er in letzter Zeit"}, {"id": 887, "start": 5407.7, "end": 5409.7, "text": "nicht mehr am Start."}, {"id": 888, "start": 5409.7, "end": 5411.7, "text": "Aber gut, dann..."}, {"id": 889, "start": 5411.7, "end": 5413.7, "text": "Dann machen wir das,"}, {"id": 890, "start": 5413.7, "end": 5415.7, "text": "wenn er wieder da ist."}, {"id": 891, "start": 5415.7, "end": 5417.7, "text": "So."}, {"id": 892, "start": 5419.7, "end": 5421.7, "text": "Letzte Chance,"}, {"id": 893, "start": 5421.7, "end": 5423.7, "text": "YouTube uns was Gutes vorzuschlagen,"}, {"id": 894, "start": 5423.7, "end": 5425.7, "text": "sonst gucken wir mal, was haben wir da?"}, {"id": 895, "start": 5425.7, "end": 5429.7, "text": "Top Concerns Battlefield 2042"}, {"id": 896, "start": 5431.7, "end": 5433.7, "text": "Tja, das gucken wir uns jetzt nicht an."}, {"id": 897, "start": 5435.7, "end": 5437.7, "text": "Redis in 100 Sekunden."}, {"id": 898, "start": 5443.7, "end": 5445.7, "text": "Redis in 100 Sekunden."}, {"id": 899, "start": 5445.7, "end": 5447.7, "text": "Redis kann man in 5 Sekunden"}, {"id": 900, "start": 5447.7, "end": 5449.7, "text": "eigentlich beschreiben."}, {"id": 901, "start": 5449.7, "end": 5451.7, "text": "Es ist RAM"}, {"id": 902, "start": 5451.7, "end": 5453.7, "text": "mit einer Query-Language."}, {"id": 903, "start": 5453.7, "end": 5455.7, "text": "Es ist dein RAM,"}, {"id": 904, "start": 5455.7, "end": 5457.7, "text": "auf dem man"}, {"id": 905, "start": 5457.7, "end": 5459.7, "text": "strukturierter zugreifen kann."}, {"id": 906, "start": 5459.7, "end": 5461.7, "text": "Fertig."}, {"id": 907, "start": 5461.7, "end": 5463.7, "text": "RAM, auf dem man"}, {"id": 908, "start": 5463.7, "end": 5465.7, "text": "organisierter zugreifen kann."}, {"id": 909, "start": 5467.7, "end": 5469.7, "text": "Oh, wäre gut."}, {"id": 910, "start": 5469.7, "end": 5471.7, "text": "Schwierig zu beschreiben jetzt."}, {"id": 911, "start": 5471.7, "end": 5473.7, "text": "Zumindest RAM."}, {"id": 912, "start": 5473.7, "end": 5475.7, "text": "RAM."}, {"id": 913, "start": 5475.7, "end": 5477.7, "text": "In Memory."}, {"id": 914, "start": 5477.7, "end": 5479.7, "text": "Redis kannst du glaube ich auch"}, {"id": 915, "start": 5479.7, "end": 5481.7, "text": "auf Persistent machen, auf SSD,"}, {"id": 916, "start": 5481.7, "end": 5483.7, "text": "aber das muss, dass es schnell ist,"}, {"id": 917, "start": 5483.7, "end": 5485.7, "text": "dass sich das lohnt, muss das in RAM."}, {"id": 918, "start": 5485.7, "end": 5487.7, "text": "Reddit ist RAM as a Service, genau, genau."}, {"id": 919, "start": 5487.7, "end": 5489.7, "text": "RAM as a Service"}, {"id": 920, "start": 5489.7, "end": 5491.7, "text": "ist Redis. So kann man das gut beschreiben."}, {"id": 921, "start": 5505.7, "end": 5507.7, "text": "So, was haben wir sonst noch hier? 10 Gigabit"}, {"id": 922, "start": 5507.7, "end": 5509.7, "text": "auf einem Raspberry Pi. Na gut, mit PC,"}, {"id": 923, "start": 5509.7, "end": 5511.7, "text": "Express, ist das geil. Ach,"}, {"id": 924, "start": 5511.7, "end": 5513.7, "text": "guter Switch, Leute, guter Switch."}, {"id": 925, "start": 5513.7, "end": 5515.7, "text": "Ach, Bewerbungsfragen, stimmt, Bewerbungsfragen."}, {"id": 926, "start": 5515.7, "end": 5517.7, "text": "Ja, ihr habt recht."}, {"id": 927, "start": 5517.7, "end": 5519.7, "text": "Also, zeig mal her."}, {"id": 928, "start": 5519.7, "end": 5521.7, "text": "Wo hat es denn"}, {"id": 929, "start": 5521.7, "end": 5523.7, "text": "..."}, {"id": 930, "start": 5523.7, "end": 5525.7, "text": "..."}, {"id": 931, "start": 5525.7, "end": 5527.7, "text": "..."}, {"id": 932, "start": 5527.7, "end": 5529.7, "text": "..."}, {"id": 933, "start": 5529.7, "end": 5531.7, "text": "..."}, {"id": 934, "start": 5531.7, "end": 5533.7, "text": "..."}, {"id": 935, "start": 5533.7, "end": 5535.7, "text": "..."}, {"id": 936, "start": 5535.7, "end": 5537.7, "text": "..."}, {"id": 937, "start": 5537.7, "end": 5539.7, "text": "..."}, {"id": 938, "start": 5539.7, "end": 5541.7, "text": "..."}, {"id": 939, "start": 5541.7, "end": 5543.7, "text": "..."}, {"id": 940, "start": 5543.7, "end": 5545.7, "text": "..."}, {"id": 941, "start": 5545.7, "end": 5547.7, "text": "..."}, {"id": 942, "start": 5549.7, "end": 5551.7, "text": "..."}, {"id": 943, "start": 5551.7, "end": 5553.7, "text": "..."}, {"id": 944, "start": 5553.7, "end": 5555.7, "text": "..."}, {"id": 945, "start": 5555.7, "end": 5557.7, "text": "..."}, {"id": 946, "start": 5557.7, "end": 5559.7, "text": "..."}, {"id": 947, "start": 5559.7, "end": 5561.7, "text": "..."}, {"id": 948, "start": 5561.7, "end": 5563.7, "text": "..."}, {"id": 949, "start": 5563.7, "end": 5565.7, "text": "..."}, {"id": 950, "start": 5565.7, "end": 5570.02, "text": "oder das das wäre mir auch zu fies leute was berechnen zu lassen und was"}, {"id": 951, "start": 5570.86, "end": 5575.62, "text": "kann man damit alles ein einstellen und als letztes welche games ich zocke der eine hatte mich"}, {"id": 952, "start": 5577.34, "end": 5581.92, "text": "exzellent gut und was hast du ihnen geantwortet wofür ist ein router zuständig"}, {"id": 953, "start": 5585.54, "end": 5592.12, "text": "Ich meine noobs würden antworten um zu routen das ist aber nicht das womit du punkten kannst bei"}, {"id": 954, "start": 5592.12, "end": 5601.0, "text": "Bei vorstellungsgesprächen oder um zu um zu um zu routen für routing ist der router zuständig der router"}, {"id": 955, "start": 5607.2, "end": 5612.52, "text": "Die einfachste antwort ist natürlich ein router ist dafür da um zwei unabhängige netze miteinander zu verbinden"}, {"id": 956, "start": 5612.52, "end": 5622.6, "text": "dass zwei dass zwei unabhängige netze miteinander reden können von einem netz ins andere netz zu routen"}, {"id": 957, "start": 5622.6, "end": 5628.16, "text": "für welche stelle war stimmt als was hast du dich beworben es wäre vielleicht interessant zu wissen"}, {"id": 958, "start": 5628.16, "end": 5646.12, "text": "fachinformatiker und dann welcher moment nur dass ich das richtig jetzt verstehe nur dass ich das"}, {"id": 959, "start": 5646.12, "end": 5652.44, "text": "jetzt richtig verstehe du möchtest dass ich auf dein video reakte ne heute nicht"}, {"id": 960, "start": 5652.44, "end": 5661.28, "text": "ich habe festgestellt es wäre ein router ohne modems hergestellt aber irgendwie fast keine modems"}, {"id": 961, "start": 5661.28, "end": 5678.0, "text": "ohne router mehr ja ja ja das das stimmt allerdings nur im heimbereich im business"}, {"id": 962, "start": 5678.0, "end": 5695.28, "text": "bereich gibt es das alles sehr wohl ja ok frage was macht dns ist eigentlich auch standard"}, {"id": 963, "start": 5695.28, "end": 5702.04, "text": "wenn man da sagt namensauflösung domain zu ip das ist man schon sicher was ist ein gateway naja"}, {"id": 964, "start": 5702.04, "end": 5708.2, "text": "der gateway ist in der regel das interface vom router was man aus an seinem endgerät einstellt damit"}, {"id": 965, "start": 5708.2, "end": 5714.32, "text": "man ein anderes netz kommt über den router das hängt da stark damit zusammen subnet maske kommt"}, {"id": 966, "start": 5714.32, "end": 5718.88, "text": "da noch und was man damit alles einstellen und jetzt ja das finde ich aber cool dass sie dich"}, {"id": 967, "start": 5718.88, "end": 5724.6, "text": "fragen welche spiele du spielst da sieht man dass mittlerweile dort auch leute sitzen die für die"}, {"id": 968, "start": 5724.6, "end": 5751.52, "text": "spiele nicht das teufels zeug ist ja finde ich gut du hast das rezept einfach erbendes geld ja"}, {"id": 969, "start": 5751.52, "end": 5773.24, "text": "das kann man machen easy doch doch das ist glaube ich der gleiche typ ja es ist nicht"}, {"id": 970, "start": 5773.24, "end": 5777.76, "text": "mal ganz so ganz so kaputt die standard apps aber wirklich wirklich überzeugt hat es mich"}, {"id": 971, "start": 5777.76, "end": 5794.28, "text": "immer noch nicht das ist ja eins vor wundert mich dass noch niemanden koin gemacht hat der"}, {"id": 972, "start": 5794.28, "end": 5818.84, "text": "auf ram gemeint wird doch doch gibt schon so gut wie jedes mein im program"}, {"id": 973, "start": 5818.84, "end": 5827.08, "text": "als was hast du dich beworben da kam keine netzwerk das hängt immer ganz entscheidend"}, {"id": 974, "start": 5827.08, "end": 5834.92, "text": "davon ab wer da sitzt in so einem vorstellungsgespräch also bei uns ist es leider leider muss ich sagen"}, {"id": 975, "start": 5834.92, "end": 5840.4, "text": "bei uns ist es leider so dass im vorstellungsgespräch fachinformatik systemintegration da sitzt der"}, {"id": 976, "start": 5840.4, "end": 5845.76, "text": "ausbildungsleiter für alle azubis also sprich der hat von technik und tun und blasen keine ahnung"}, {"id": 977, "start": 5845.76, "end": 5852.42, "text": "und irgendwie einen personalmensch das heißt niemand der wirklich ahnung von technik hat"}, {"id": 978, "start": 5852.42, "end": 5856.6, "text": "sitzt bei uns in dem fisi vorstellungs vorstellungsbewerbungsgespräch das heißt"}, {"id": 979, "start": 5856.6, "end": 5860.64, "text": "kannst du komplett klicken das heißt selbst mit technik fragen kommst du da nicht weiter du"}, {"id": 980, "start": 5860.64, "end": 5866.16, "text": "kommst bei uns du wirst bei uns alles lustigerweise echt so du wirst bei uns als fisi eher eingestellt"}, {"id": 981, "start": 5866.16, "end": 5873.56, "text": "wenn du einen ordentlichen anzug an hast als wenn du technische ahnung hast ja sind aber selber"}, {"id": 982, "start": 5873.56, "end": 5877.72, "text": "dran schuld sind selber daran schuld wenn sie nicht gute leute kriegen mit solchen solchen sachen ich"}, {"id": 983, "start": 5877.72, "end": 5887.0, "text": "was ich wurde auf eure ich wurde auf einer bewerbung ob ich auch in games raide da finde ich"}, {"id": 984, "start": 5887.0, "end": 5892.16, "text": "es eine gute frage das finde ich ist eine gute frage ohne scheiß wenn mir jemand erzählt der"}, {"id": 985, "start": 5892.16, "end": 5897.2, "text": "ist mmo progression raider weiß ich der kann auf jeden fall gut mit anderen leuten an was"}, {"id": 986, "start": 5897.2, "end": 5901.4, "text": "arbeiten um ein gemeinsames ziel zu erreichen progression ich habe es doch schon in meinem"}, {"id": 987, "start": 5901.4, "end": 5913.32, "text": "homeoffice video gesagt mmo progression raider ist die eigentliche homeoffice master race wenn"}, {"id": 988, "start": 5913.32, "end": 5917.76, "text": "du wenn du dir sicher sein kannst dass einer gut im homeoffice arbeiten kann und auch gut"}, {"id": 989, "start": 5917.76, "end": 5924.2, "text": "zusammenarbeiten kann dann sind es mmo progression raider die wissen wie man online kommuniziert"}, {"id": 990, "start": 5924.2, "end": 5928.28, "text": "die wissen wie man mit anderen online zusammenarbeitet so dass was gescheites rauskommt"}, {"id": 991, "start": 5928.28, "end": 5940.6, "text": "wie steht so zu winfo was wirtschaft informatik leuten mir ist eigentlich egal was jemand"}, {"id": 992, "start": 5940.6, "end": 5945.68, "text": "studiert hat gemacht hat oder sonst wie wenn er seine aufgabe ordentlich erfüllt die er hat"}, {"id": 993, "start": 5945.68, "end": 5957.64, "text": "habe ich damit keine schmerzen natürlich was immer leute die kein plan haben wir hatten auch"}, {"id": 994, "start": 5957.64, "end": 5964.24, "text": "mal einen der hat erzählt er hat fortgeschrittene vmw erfahrung und wenn man ihn gefragt hat hat"}, {"id": 995, "start": 5964.24, "end": 5971.56, "text": "er gesagt er hat mal ein ubuntu vm installiert ja also das ist fragwürdig teilweise was da erzählt"}, {"id": 996, "start": 5971.56, "end": 5976.4, "text": "wird aber das beste bewerbungsgespräch aller zeiten das muss ich das muss ich jetzt mal kurz"}, {"id": 997, "start": 5976.4, "end": 5982.96, "text": "kurz ein einwerfen also das beste bewerbungsgespräch aller zeiten was ich bei uns mitbekommen habe"}, {"id": 998, "start": 5982.96, "end": 5992.6, "text": "war folgendes hat sich jemand bei uns bewerb beworben und der hatte der hatte einen abschluss in"}, {"id": 999, "start": 5992.6, "end": 6002.12, "text": "matte der matte matte studiert so mit abschlussarbeit und allem und es ging dann halt so es kam so ein"}, {"id": 1000, "start": 6002.12, "end": 6008.6, "text": "paar technik fragen und irgendwann ging es dann um seine um seine abschlussarbeit so nach dem"}, {"id": 1001, "start": 6008.6, "end": 6014.2, "text": "motto ja über was so hat dann einer gefragt von den leuten die dabei gesessen über was war"}, {"id": 1002, "start": 6014.2, "end": 6018.56, "text": "dann ihre ihre abschlussarbeit und dann hat er dann gesagt so ich denke mir jetzt mal irgendwas"}, {"id": 1003, "start": 6018.56, "end": 6023.92, "text": "aus ja ich weiß es ehrlich gesagt nicht nicht mehr genau irgendwie so was weiß ich das dritte"}, {"id": 1004, "start": 6023.92, "end": 6032.24, "text": "theorem von xy oder sowas oder oder was weiß ich irgendwas mathematisches hat er gesagt so und"}, {"id": 1005, "start": 6032.24, "end": 6038.68, "text": "normalerweise normalerweise wäre jetzt das bewerbungsgespräch an dieser stelle durch gewesen weil alle"}, {"id": 1006, "start": 6038.68, "end": 6043.2, "text": "die da gesessen hätten hätten gesagt okay drittes theorem von xy ich habe keine ahnung wo von der"}, {"id": 1007, "start": 6043.2, "end": 6050.48, "text": "typ spricht na ist alles gut der typ hatte nur pech der typ hatte bei uns richtig richtig großes"}, {"id": 1008, "start": 6050.48, "end": 6060.04, "text": "pech weil in diesem bewerbungsgespräch saß einer der einzige im umkreis von keine ahnung na gut in"}, {"id": 1009, "start": 6060.04, "end": 6064.52, "text": "frankfurt ist eine uni aber ich sage jetzt einfach mal einer einer der handvoll leute im umkreis von"}, {"id": 1010, "start": 6064.52, "end": 6076.64, "text": "500 km der wusste was das ist wir haben nämlich bei uns ein auf der arbeit der also das ist ein"}, {"id": 1011, "start": 6076.64, "end": 6084.36, "text": "riesen riesen mathe fan und der arbeitet quasi nur um geld zu verdienen bei uns und löst ist in"}, {"id": 1012, "start": 6084.36, "end": 6089.96, "text": "irgend so eine mathe mathe mathe ich habe keine ahnung wie das heißt in so einer mathe vereinigung"}, {"id": 1013, "start": 6089.96, "end": 6096.36, "text": "und im prinzip der beschäftigt sich in seiner kompletten freizeit mit dem lösen oder mit dem"}, {"id": 1014, "start": 6096.36, "end": 6103.04, "text": "mit dem mit dem beschäftigen von ungelösten mathematischen problemen also der geht da wirklich"}, {"id": 1015, "start": 6103.04, "end": 6107.92, "text": "nur arbeiten um bisschen geld zu verdienen und die restliche zeit hat der typ ist er am lösen und"}, {"id": 1016, "start": 6107.92, "end": 6113.32, "text": "mathematische probleme also das ist wie gesagt einer von handvoll leuten im umkreis von keine"}, {"id": 1017, "start": 6113.32, "end": 6122.44, "text": "ahnung 500 kilometer der der der wissen hätte wissen können von was der spricht so und dann"}, {"id": 1018, "start": 6122.44, "end": 6127.16, "text": "kam halt wie es kommen muss das aber interessant wie war dann noch mal das dritte die dritte"}, {"id": 1019, "start": 6127.16, "end": 6131.44, "text": "theorie ich kenne die zweite kenne ich aber was war da noch mal die dritte und da muss den typ so"}, {"id": 1020, "start": 6131.44, "end": 6137.12, "text": "übelst aus der fassung gebracht haben dass er gemeint hat so irgendwie da kann ich jetzt nicht"}, {"id": 1021, "start": 6137.12, "end": 6143.4, "text": "drüber reden mein abschluss mein abschlussprojekt ist geheim da darf ich nichts zu sagen der muss ich"}, {"id": 1022, "start": 6143.4, "end": 6148.56, "text": "krass raus geredet haben der hat halt gedacht er sagt irgendwas super mathematisches wo eh keine"}, {"id": 1023, "start": 6148.56, "end": 6152.92, "text": "ahnung von hat und dann ist die sache durch ob der typ überhaupt ein abgeschlossen studio"}, {"id": 1024, "start": 6152.92, "end": 6179.8, "text": "habe weiß ich bis heute nicht studium auf mich bestellt ja das ist halt echt verkackt"}, {"id": 1025, "start": 6179.8, "end": 6184.04, "text": "der hat wirklich aber der hat auch echt pech gehabt muss man mal sagen wer kann"}, {"id": 1026, "start": 6184.04, "end": 6189.12, "text": "er damit rechnen dass ihm das der einzige einer der handvoll leute in deutschland die dazu was"}, {"id": 1027, "start": 6189.12, "end": 6191.96, "text": "sagen können ausgerechnet bei ihm bewerbungsgespräch mit setzt er"}, {"id": 1028, "start": 6191.96, "end": 6220.36, "text": "bei mir wollten sie beim gespräch nur wissen was ich gebe ja die story hast du ich habe ich"}, {"id": 1029, "start": 6220.36, "end": 6224.44, "text": "habe sehr viel leute wie lange stream ich jetzt schon seit drei jahren ich habe die ein oder"}, {"id": 1030, "start": 6224.44, "end": 6235.88, "text": "andere story ja schon öfters mal erzählen ja mega pech ja das ist eigentlich ist das ein"}, {"id": 1031, "start": 6235.88, "end": 6242.08, "text": "richtig gutes richtig guter videotitel studium auf mich bestellt"}, {"id": 1032, "start": 6242.08, "end": 6254.4, "text": "ja das thema hatten wir heute schon aber man weiß ja nicht so genau woran es gelegen hat dass die"}, {"id": 1033, "start": 6254.4, "end": 6260.44, "text": "dass die ganze infrastruktur down ist oder ist da mittlerweile mehr herausgekommen"}, {"id": 1034, "start": 6260.44, "end": 6269.24, "text": "solche fragen gehen mir auch immer auf den keks das sind so genannte brain teaser fragen"}, {"id": 1035, "start": 6269.24, "end": 6275.12, "text": "und das schwappt langsam aus den usa zu unseren bewerbungsgesprächen rüber nur mit dem unterschied"}, {"id": 1036, "start": 6275.12, "end": 6283.96, "text": "was was ich auch immer nicht verstehe ja also wenn wenn google oder facebook microsoft apple wer"}, {"id": 1037, "start": 6283.96, "end": 6289.84, "text": "auch immer so komischen fragen stellen und mit den leuten an der tafel binary trees in worten"}, {"id": 1038, "start": 6289.84, "end": 6296.44, "text": "und so was in der richtung dann ist das google microsoft also das sind quasi firmen mit die die"}, {"id": 1039, "start": 6296.44, "end": 6302.44, "text": "größten big brains der welt suchen für sich ok aber nur weil das microsoft apple und google"}, {"id": 1040, "start": 6302.44, "end": 6308.92, "text": "und facebook und netflix und und so was macht das muss das nicht die 015 software klitsche in"}, {"id": 1041, "start": 6308.92, "end": 6319.48, "text": "frankfurt um die ecke machen aber übrigens dank der hilfe zu meiner bewerbung auf deinem"}, {"id": 1042, "start": 6319.48, "end": 6324.16, "text": "discord mein ausbildungspass excellent excellent leute ausrufe zeichnen discord wenn ihr big brain"}, {"id": 1043, "start": 6324.16, "end": 6328.92, "text": "content braucht und ausrufe zeichnen hetzner wenn ihr euren 20 euro hetzner startgutschein"}, {"id": 1044, "start": 6328.92, "end": 6335.64, "text": "claimen wollt hast du schon mal das heizungsniveau noch nie was hältst du von dort net 6 eine gute"}, {"id": 1045, "start": 6335.64, "end": 6345.56, "text": "gute Entwicklung ja und und diese diese fragen mit dem wieviel smarties passen in ein smart das"}, {"id": 1046, "start": 6345.56, "end": 6351.36, "text": "sind genau solche fragen diese art der fragen die jetzt immer mehr rüber schwappt aus den usa"}, {"id": 1047, "start": 6351.36, "end": 6357.44, "text": "und da geht es im prinzip darum nicht nicht dass du die wirklich beantworten kann sondern dass"}, {"id": 1048, "start": 6357.44, "end": 6369.32, "text": "man quasi erklärt wie man wie man da rangehen würde vom ansatz her aber ich finde solche fragen"}, {"id": 1049, "start": 6369.32, "end": 6376.28, "text": "trotzdem bescheuert also richtig richtig hängen geblieben aber gut man kann ja fragen was sie"}, {"id": 1050, "start": 6376.28, "end": 6395.92, "text": "wollen bei solchen fragen sollen man einfach nur laut genau genau bei uns sind bei azubi"}, {"id": 1051, "start": 6395.92, "end": 6401.12, "text": "bewerber kaum fragen über fachliche skills bei da gibt es ja ja ist bei uns auch so wie gesagt bei"}, {"id": 1052, "start": 6401.12, "end": 6404.72, "text": "uns jetzt ja auch keine technikleute dabei bei uns jetzt der oberausbildungsleiter dabei der"}, {"id": 1053, "start": 6404.72, "end": 6410.12, "text": "keine ahnung von technik hat und irgendwelche personal leute kann man voll vergessen mein ansatz"}, {"id": 1054, "start": 6410.12, "end": 6417.48, "text": "wäre googeln ernsthaft das würde ich auch antworten so jetzt ja ab und zu bin ich auf twitch aber ich"}, {"id": 1055, "start": 6417.48, "end": 6422.68, "text": "bin ich bin ja nicht mal ich bin ich bin wuppe los siehst du doch hier mensch stimmt doch gar nicht"}, {"id": 1056, "start": 6422.68, "end": 6442.72, "text": "fake news alter fake news also mein vorstellungsgespräch für die ausbildung das könnte ich eigentlich mal"}, {"id": 1057, "start": 6442.72, "end": 6453.72, "text": "das könnte ich eigentlich mal ein video zu machen also mein vorstellungsgespräch für die"}, {"id": 1058, "start": 6453.72, "end": 6459.16, "text": "ausbildung war total easy wir haben erst ein test gemacht wo sie schon angekündigt haben der test"}, {"id": 1059, "start": 6459.16, "end": 6465.68, "text": "ist gemein weil es der test ist den sie normalerweise auch leuten geben die sie so einstellen so und ich"}, {"id": 1060, "start": 6465.68, "end": 6469.88, "text": "konnte davon ein paar sachen beantworten da war zum beispiel auch die frage drin wie geht man aus"}, {"id": 1061, "start": 6469.88, "end": 6477.4, "text": "wim raus auto exit wim und sowas war da als als frage drin irgendwelche ip tables tabellen und"}, {"id": 1062, "start": 6477.4, "end": 6482.6, "text": "sonst wie was also ich konnte zu einigen sachen tatsächlich was sagen aber vieles keine ahnung"}, {"id": 1063, "start": 6482.6, "end": 6489.92, "text": "war halt voll voll verkackt ja wusste ich damals nicht zumindest in dem gespräch danach war war"}, {"id": 1064, "start": 6489.92, "end": 6496.88, "text": "echt nicht war echt nicht viel ja ich weiß noch dass ich damals als ich das bewerbungsgespräch"}, {"id": 1065, "start": 6496.88, "end": 6502.04, "text": "also sie haben dann gesagt ok wer möchte anfangen ist ja ok gehe ich immer als erster rein und die"}, {"id": 1066, "start": 6502.04, "end": 6508.16, "text": "haben ich dann die noch bevor die was sagen konnten habe ich halt so vor mich hin hin gemurmel dass"}, {"id": 1067, "start": 6508.16, "end": 6513.72, "text": "manche fragen echt fies waren in diesem vorstellungs in diesem in diesem test und haben sie halt"}, {"id": 1068, "start": 6513.72, "end": 6518.2, "text": "gefragt ja warum da meinte ich also ja gerade bei den ziskosachen da wusste ich teilweise aber"}, {"id": 1069, "start": 6518.2, "end": 6522.88, "text": "bin ich mal drauf gekommen da hatte man gleich so ein gesprächsthema ansonsten bin ich da raus"}, {"id": 1070, "start": 6522.88, "end": 6530.68, "text": "wir haben nicht wirklich viel ja großartig geregelt keine ahnung zehn minuten und einen tag später"}, {"id": 1071, "start": 6530.68, "end": 6535.6, "text": "haben die mich angerufen haben gesagt ja wann können sie unterschreiben ok alles klar"}, {"id": 1072, "start": 6543.96, "end": 6550.72, "text": "muss jetzt mal wieder zurück auf youtube klar aber die fragen die letzten sagen"}, {"id": 1073, "start": 6550.72, "end": 6562.64, "text": "guckst du mir noch an aha auch richtig big brain ja ich das ist übrigens auch der grund warum ich"}, {"id": 1074, "start": 6562.64, "end": 6568.64, "text": "immer ein bisschen bisschen schwierig finde die leute quasi live wie soll ich sagen live"}, {"id": 1075, "start": 6568.64, "end": 6574.88, "text": "komplexere sachen auszufragen weil es ist einfach so viele leute auch auch leute die wirklich wirklich"}, {"id": 1076, "start": 6574.88, "end": 6583.64, "text": "gut sind und big brain haben können unter druck nicht kreativ denken das ist aber auch normal"}, {"id": 1077, "start": 6583.64, "end": 6588.64, "text": "bei der wei deswegen das ist das ist eines der gründe warum ich diese diese diese taktik mit"}, {"id": 1078, "start": 6588.64, "end": 6593.28, "text": "vorstellungsgesprächen komplexe sachen zu fragen und implementiert zu haben nicht nicht gut finde"}, {"id": 1079, "start": 6593.28, "end": 6599.04, "text": "weil programmieren und und über probleme nachdenken ist da muss jetzt man muss jetzt ein"}, {"id": 1080, "start": 6599.04, "end": 6603.8, "text": "bisschen ausholen das ist ein kreativer prozess also wenn du jetzt ein problem lösen willst keine"}, {"id": 1081, "start": 6603.8, "end": 6611.32, "text": "ahnung du sagst ich möchte was programmieren was mein bildschirm immer ab 17 uhr dimmt oder so"}, {"id": 1082, "start": 6611.32, "end": 6615.72, "text": "was irgendwie eine einfache einfach eine einfache aufgabe ja da musst du musst du kreativ sein da"}, {"id": 1083, "start": 6615.72, "end": 6620.12, "text": "musst du überlegen ok wie mache ich das mit der urzeit wie handelt ich keine ahnung man schallt"}, {"id": 1084, "start": 6620.12, "end": 6625.6, "text": "ja wie mache ich hier wie mache ich jenes das heißt es allein so das überlegen ist ein kreativer"}, {"id": 1085, "start": 6625.6, "end": 6629.72, "text": "prozess und das programmieren und implementieren und wie mache ich es auch ein kreativer prozess"}, {"id": 1086, "start": 6629.72, "end": 6637.08, "text": "sondern es gibt zwei sachen die funktionieren einfach nicht zusammen das ist stress gefahr"}, {"id": 1087, "start": 6637.08, "end": 6644.2, "text": "ernst plus kreativität das geht nicht zusammen und wenn leute unter unter druck sind schon ein"}, {"id": 1088, "start": 6644.2, "end": 6650.08, "text": "bisschen panik haben oder angespannt sind bei einem vorstellungsgespräch dann kannst du von"}, {"id": 1089, "start": 6650.08, "end": 6654.6, "text": "ihnen keine kreativen leistungen großartig erwarten dass das geht einfach nicht zusammen"}, {"id": 1090, "start": 6654.6, "end": 6660.96, "text": "deswegen verstehe ich nicht wie man sich daraus was ableiten will das habe ich noch nie verstanden"}, {"id": 1091, "start": 6660.96, "end": 6665.12, "text": "und leuchten wir bis heute nicht ein das eine passt mit dem andere nicht zusammen"}, {"id": 1092, "start": 6665.12, "end": 6673.44, "text": "deswegen finde ich solche solche sachen bescheid ich finde es viel sinnvoller zu sagen hey schick"}, {"id": 1093, "start": 6673.44, "end": 6678.6, "text": "mal dein githab profil mit ich guck mir das guck mir das an da siehst du nämlich was der"}, {"id": 1094, "start": 6678.6, "end": 6683.64, "text": "typ macht wenn er wenn er seine ruhe hat und kreativ denken kann aber unter druck kreativ also"}, {"id": 1095, "start": 6683.64, "end": 6691.64, "text": "druck und kreativ denn das sind so die beißen sich einfach das ist ungefähr so wie wenn du"}, {"id": 1096, "start": 6691.64, "end": 6699.32, "text": "einem künstler sagst seine maler ja wenn du dem eine pistole an den kopf hältst und sag sagst"}, {"id": 1097, "start": 6699.32, "end": 6704.0, "text": "jetzt mal mal dein nächstes meisterwerk da kommt sicherlich nichts ordentliches bei rum"}, {"id": 1098, "start": 6704.0, "end": 6711.92, "text": "das kann ich das kann ich funktionieren wie viel matten haben die abgefragt so gut wie gar nichts"}, {"id": 1099, "start": 6711.92, "end": 6719.6, "text": "deine mord und worte mutter ist doch schön ich mache immer noch youtube videos falls du nicht"}, {"id": 1100, "start": 6719.6, "end": 6748.48, "text": "mitgekriegt hast aber halt wenig wenig zu battlefield und call of duty spiel ich ja gar nicht mehr"}, {"id": 1101, "start": 6748.48, "end": 6755.72, "text": "also ok weiter gibt es wo man hat überhaupt eine möglichkeit ein bewerbungsgespräch nicht"}, {"id": 1102, "start": 6755.72, "end": 6772.6, "text": "zu nicht zu bestimmt bestimmt so lange es kein so lange es kein nasi schneiderman struktur kram"}, {"id": 1103, "start": 6772.6, "end": 6790.52, "text": "sein soll ja ich muss euch sagen das ist eines der sachen wo ich mich echt komplett verschätzt"}, {"id": 1104, "start": 6790.52, "end": 6795.84, "text": "habe ich muss ja auch zugeben können wenn man falsch liegt rainbow 6 habe ich komplett"}, {"id": 1105, "start": 6795.84, "end": 6799.56, "text": "falsch eingeschätzt ich dachte rainbow 6 ist ein game das kommt raus ich habe die beta gespielt"}, {"id": 1106, "start": 6799.56, "end": 6804.96, "text": "es kommt raus und nach einem halben Jahr interessiert sich keine sau mehr dafür da lag ich komplett"}, {"id": 1107, "start": 6804.96, "end": 6823.68, "text": "falsch aber komplett aber nicht bei einem azubi oder bei einem programmierer du schickst"}, {"id": 1108, "start": 6823.68, "end": 6827.36, "text": "er du schickst er du schickst er eigentlich kein programmierer zu deinem kunde dass der"}, {"id": 1109, "start": 6827.36, "end": 6834.96, "text": "eben dann einen flowchart malt oder eine implementierungsvorschlag live an der tafel erarbeitet das wäre und"}, {"id": 1110, "start": 6834.96, "end": 6841.12, "text": "wenn dann soll das irgendjemand anderes machen ich würde es nicht machen so sollte so sollte"}, {"id": 1111, "start": 6841.12, "end": 6845.96, "text": "es meiner meinung auch meiner meinung nach auch zum größten teil sein man sollte hauptsächlich"}, {"id": 1112, "start": 6845.96, "end": 6851.16, "text": "gucken dass es einstellungsmäßig und menschlich miteinander passt dass man gut miteinander"}, {"id": 1113, "start": 6851.16, "end": 6857.44, "text": "arbeiten kann und das ist eigentlich das wichtigste gerade in der heutigen zeit ist ist es doch"}, {"id": 1114, "start": 6857.44, "end": 6865.8, "text": "viel wichtiger dass man mit den leuten dass man mit den leuten gut im team zusammenarbeiten"}, {"id": 1115, "start": 6865.8, "end": 6871.12, "text": "kann als dass sie jetzt alles schon wissen weil du kannst gar nicht also es ist saumäßig"}, {"id": 1116, "start": 6871.12, "end": 6877.0, "text": "schwierig für das spezifische was du jetzt machst jemand zu finden der wirklich ahnung"}, {"id": 1117, "start": 6877.0, "end": 6883.72, "text": "von hat das ist heute so viele faktoren die da zusammenkommen und unterschiedliche waren"}, {"id": 1118, "start": 6883.72, "end": 6887.56, "text": "wichtig ist eigentlich dass du jemand aus der ahnung hat und sich schnell einarbeiten"}, {"id": 1119, "start": 6887.56, "end": 6892.6, "text": "kann und der team mäßig zu deinen restlichen leuten dabei passt das ist meiner meinung"}, {"id": 1120, "start": 6892.6, "end": 6896.6, "text": "auch das wichtigste der muss so weit ahnung haben dass er sich schnell einarbeiten kann"}, {"id": 1121, "start": 6896.6, "end": 6900.56, "text": "und so weit ahnung haben dass er weiß nach was er suchen muss dass der jetzt dass du"}, {"id": 1122, "start": 6900.56, "end": 6907.6, "text": "jetzt den einen in deutschland findest der exakt dein eines problem was du hast lösen"}, {"id": 1123, "start": 6907.6, "end": 6916.8, "text": "kannst ist doch unrealistisch"}, {"id": 1124, "start": 6916.8, "end": 6921.8, "text": "nicht wirklich"}, {"id": 1125, "start": 6921.8, "end": 6926.8, "text": "keine ahnung"}, {"id": 1126, "start": 6926.8, "end": 6932.88, "text": "entwickler kapitulabschluss kann ich zu sagen ok guck mal weiter also was haben wir hier"}, {"id": 1127, "start": 6932.88, "end": 6938.32, "text": "am start noch 10 gigabit dieser dieser switch ist übrigens richtig poggers den habe ich"}, {"id": 1128, "start": 6938.32, "end": 6945.6, "text": "auch hier das ist ein mikrotik ich glaube in cc css oder crs 305 ist das glaube ich"}, {"id": 1129, "start": 6945.6, "end": 6954.6, "text": "der ist wirklich poggers was hat das bitte schon mit cc na zu tun"}, {"id": 1130, "start": 6954.6, "end": 6959.36, "text": "ich will eigentlich nur mal den switch switch sehen ob das der richtige ist den ich denke"}, {"id": 1131, "start": 6959.36, "end": 6968.2, "text": "ja heißt das ist das ich glaube das ist das das ist das css 305 css 305 305 mikrotik"}, {"id": 1132, "start": 6968.2, "end": 6977.8, "text": "ja ist er doch sag ich doch hier poggers super ein super switch schrägstrich mit bisschen"}, {"id": 1133, "start": 6977.8, "end": 6983.48, "text": "routing funktion nicht so wahnsinnig viel aber bisschen kannst du mit machen also bandbreiten"}, {"id": 1134, "start": 6983.48, "end": 6988.6, "text": "mäßig damit jetzt keine zwei abteilungen über verschiedene aber ansonsten ist das"}, {"id": 1135, "start": 6988.6, "end": 6994.12, "text": "schon in ordnung der ist wirklich gut der ist nicht teuer"}, {"id": 1136, "start": 6994.12, "end": 7002.96, "text": "kostet glaube ich nur irgendwie ja 100 100 112 euro 115 mit versand 115 euro du bekommst"}, {"id": 1137, "start": 7002.96, "end": 7009.04, "text": "einen gigabit port und 14 gigabit ports glasfaser eigentlich richtig gut um network dabei der"}, {"id": 1138, "start": 7009.04, "end": 7014.52, "text": "rest interessiert mich vor dem video ehrlich gesagt jetzt nicht nicht so viel haben wir"}, {"id": 1139, "start": 7014.52, "end": 7017.64, "text": "haben wir vielleicht noch benchmarks"}, {"id": 1140, "start": 7017.64, "end": 7028.16, "text": "ja genau das ist nicht mal ein bruchteil nicht mal ein bruchteil von zählern das liegt aber"}, {"id": 1141, "start": 7028.16, "end": 7031.8, "text": "daran dass die pz express bandbreite schlicht und ergreifend zu zu gering ist"}, {"id": 1142, "start": 7031.8, "end": 7044.4, "text": "man kann"}, {"id": 1143, "start": 7044.4, "end": 7049.72, "text": "man braucht überhaupt keine 10 gigabit karte man kann sich einfach eine 2, genau man kann"}, {"id": 1144, "start": 7049.72, "end": 7055.96, "text": "man kann 2,5 oder eine 5 gigabit karte nehmen das ist dann von der infrastruktur je nachdem"}, {"id": 1145, "start": 7055.96, "end": 7061.56, "text": "was man hat auch billiger aber es hat eh kaum einen 2,5 g oder 5 g router bei sich daheim"}, {"id": 1146, "start": 7061.56, "end": 7067.4, "text": "oder switch da ist es tatsächlich 10 g einfacher zu bekommen der große vorteil warum sich das"}, {"id": 1147, "start": 7067.4, "end": 7071.18, "text": "über kurz oder lang doch durchsetzen wird ist weil du die kabel verwenden kannst die"}, {"id": 1148, "start": 7071.18, "end": 7076.36, "text": "schon da sind für 10 gigabit brauchst du meistens neue kabel oder wenn du glück hast"}, {"id": 1149, "start": 7076.36, "end": 7081.76, "text": "es kurz genug ist kannst du 10 g auch mit alten kupferkabel machen aber eher nicht oder"}, {"id": 1150, "start": 7081.76, "end": 7087.0, "text": "du brauchst glasfaserkabel 2,5 und 5 g kannst du halt über die ganzen alten oder 15 kupferkabel"}, {"id": 1151, "start": 7087.0, "end": 7092.4, "text": "machen und das ist halt für den heimgebrauch einfacher"}, {"id": 1152, "start": 7092.4, "end": 7121.84, "text": "rtx 4090 das wird doch im leben nicht stimmen"}, {"id": 1153, "start": 7121.84, "end": 7128.64, "text": "so also was gucken wir uns den jetzt an ah lockpicking lawyer das muss aus prinzip immer"}, {"id": 1154, "start": 7128.64, "end": 7129.64, "text": "sein"}, {"id": 1155, "start": 7129.64, "end": 7145.4, "text": "nee carlocks interessiere mich nicht was haben wir denn sonst noch ok safe safe öffnen"}, {"id": 1156, "start": 7145.4, "end": 7169.84, "text": "cosy cosy safe also das video ist nur 1,30 lang das heißt wir wissen jetzt schon wird"}, {"id": 1157, "start": 7169.84, "end": 7193.84, "text": "das öffnen sein jepp lock"}, {"id": 1158, "start": 7193.84, "end": 7223.62, "text": "ok easy easy easy easy easy easy easy easy easy easy easy easy easy easy easy embarrassing"}, {"id": 1159, "start": 7223.62, "end": 7227.62, "text": "Wenn ihr Fragen oder Kommentare habt, schreibt sie in die Kommentare."}, {"id": 1160, "start": 7227.62, "end": 7231.62, "text": "Wenn euch das Video gefallen hat und ihr mögt mehr von uns sehen, dann abonniert."}, {"id": 1161, "start": 7231.62, "end": 7257.62, "text": "Und wie immer, habt einen schönen Tag. Danke."}, {"id": 1162, "start": 7257.62, "end": 7261.62, "text": "Wenn ihr Fragen habt und ihr mögt mehr von uns sehen, dann abonniert."}, {"id": 1163, "start": 7261.62, "end": 7289.62, "text": "Wenn ihr Fragen oder Kommentare habt, schreibt sie in die Kommentare."}, {"id": 1164, "start": 7291.62, "end": 7295.62, "text": "Wenn ihr Fragen oder Kommentare habt, schreibt sie in die Kommentare."}, {"id": 1165, "start": 7321.62, "end": 7325.62, "text": "Wenn ihr Fragen oder Kommentare habt, schreibt sie in die Kommentare."}, {"id": 1166, "start": 7325.62, "end": 7353.62, "text": "Wenn ihr Fragen oder Kommentare habt, schreibt sie in die Kommentare."}, {"id": 1167, "start": 7355.62, "end": 7359.62, "text": "Wenn ihr Fragen oder Kommentare habt, schreibt sie in die Kommentare."}, {"id": 1168, "start": 7359.62, "end": 7371.26, "text": "Okay, er buddelt echt ernsthaft in den Tunnel bei sich unter der Hütte, warum nicht, kann"}, {"id": 1169, "start": 7371.26, "end": 7389.86, "text": "man machen kann man machen war okay ja in deutschland kann man das nicht machen echt nicht na gut in"}, {"id": 1170, "start": 7389.86, "end": 7392.68, "text": "deutschland darfst du vieles nicht machen du darfst auch in deutschland nicht einfach einen baum"}, {"id": 1171, "start": 7392.68, "end": 7403.3, "text": "fällen bei dir auf dem grundstück deswegen darfst du bestimmt auch kein tunnel buddeln"}, {"id": 1172, "start": 7403.3, "end": 7413.5, "text": "bei dir auf dem grundstück illegale unterkellerung ernsthaft sowas gibt es"}, {"id": 1173, "start": 7413.5, "end": 7420.9, "text": "bei uns in deutschland ist es schon echt geil du kannst auf deinem eigenen grundstück noch nicht"}, {"id": 1174, "start": 7420.9, "end": 7443.14, "text": "machen was du willst der wahnsinn nach china oder ami auswander nähe wir könnten es bei uns einfach"}, {"id": 1175, "start": 7443.14, "end": 7446.18, "text": "mal unseren scheiß zusammen kriegen und den leuten mal ein bisschen mehr freiheit lassen"}, {"id": 1176, "start": 7446.18, "end": 7462.58, "text": "sowas zu machen auf ihrem eigenen grundstück so also komm wir gucken so eine battlefield an"}, {"id": 1177, "start": 7462.58, "end": 7474.82, "text": "bisschen dunkel oder der sieht doch gar keine gegner"}, {"id": 1178, "start": 7474.82, "end": 7495.98, "text": "ja alles da in der ask schon schuldet aber da flippt ja voll aus bei den viel vier"}, {"id": 1179, "start": 7495.98, "end": 7505.66, "text": "in one shot on gullin peaks to start us out you don't see that very often on battlefield for next"}, {"id": 1180, "start": 7505.66, "end": 7512.02, "text": "up its prolosco with some high skill scout helikopter gameplay dropping in a few only in"}, {"id": 1181, "start": 7512.02, "end": 7520.82, "text": "battlefield moments along the way on a heli action ist langweil ich will keine heli action sehen"}, {"id": 1182, "start": 7520.82, "end": 7531.62, "text": "keine keine heli action für infanterie action jawoll jawoll schön c4 eintrocknen die musik im"}, {"id": 1183, "start": 7531.62, "end": 7560.38, "text": "hintergrund so muss das sein schön alles wegspringen warum die gegner hinter ihm nicht"}, {"id": 1184, "start": 7560.38, "end": 7575.5, "text": "auf ihn schießen ist nicht weiter zu beachten das detail ich frage mich auf welchem server die immer"}, {"id": 1185, "start": 7575.5, "end": 7598.46, "text": "solche gegner finden"}, {"id": 1186, "start": 7598.46, "end": 7613.46, "text": "auf der anderen seite du hast permanent eigentlich sowas ich meine es sind ja immer nur ausschnitte"}, {"id": 1187, "start": 7613.46, "end": 7616.98, "text": "das kann sein dass das rechtliche game auf den sack gekriegt hat ein cooler ausschnitt das ist"}, {"id": 1188, "start": 7616.98, "end": 7620.22, "text": "in battlefield also du hast mal ein battlefield auch durchaus in der runde wo es nicht so gut"}, {"id": 1189, "start": 7620.22, "end": 7629.1, "text": "läuft mal so drei vier minuten wo du übelst uns aber meistens sind es auch richtig gute"}, {"id": 1190, "start": 7629.1, "end": 7653.58, "text": "spieler die immer oben sind ja"}, {"id": 1191, "start": 7653.58, "end": 7662.22, "text": "so muss das sein"}, {"id": 1192, "start": 7662.22, "end": 7672.86, "text": "übrigens übrigens richtig nice"}, {"id": 1193, "start": 7672.86, "end": 7683.5, "text": "dass man also battlefield battlefield 3 und 4 da war ja reken recoil control easy du hast"}, {"id": 1194, "start": 7683.5, "end": 7686.74, "text": "bei den waffen einfach nur im gewissen intervall schießen muss man manchen sogar lauerfeuer"}, {"id": 1195, "start": 7686.74, "end": 7712.7, "text": "und leicht nach unten ziehen fertig kein recoil ich finde ich finde ich finde ich finde es mega"}, {"id": 1196, "start": 7712.7, "end": 7718.9, "text": "langweilig nicht dass man ist nicht dass das nicht gut leute sind aber ich bin heli und"}, {"id": 1197, "start": 7718.9, "end": 7724.18, "text": "flugzeug clips mega sleeper nicht resident sleeper mega sleeper"}, {"id": 1198, "start": 7724.18, "end": 7732.1, "text": "battlefield 2042 muss ja im prinzip diese map mal fünf sein von der größe"}, {"id": 1199, "start": 7732.1, "end": 7746.86, "text": "das mega resident sleeper"}, {"id": 1200, "start": 7746.86, "end": 7754.14, "text": "er fliegt halt rum und best schiffe ja das ist sicherlich nicht easy vor allem auch"}, {"id": 1201, "start": 7754.14, "end": 7759.66, "text": "permanent nicht getagelt zu werden oder irgendwie gehe ich finde halt chat clips langweilig"}, {"id": 1202, "start": 7759.66, "end": 7768.9, "text": "man kommt battlefield 224 er war das oktober november habe ich schon wieder vergessen"}, {"id": 1203, "start": 7768.9, "end": 7795.98, "text": "das stimmt das stimmt das hast du das hast du das hast du echt selten"}, {"id": 1204, "start": 7795.98, "end": 7801.98, "text": "millikill mit dem kanatwerfer oder direkt direkt impact kills mit dem kanatwerfer so"}, {"id": 1205, "start": 7801.98, "end": 7810.9, "text": "rum wo die granate ist ganz knapp an ihm vorbei die epitose pg das dlc map ja"}, {"id": 1206, "start": 7810.9, "end": 7827.34, "text": "das sind snipe clips die lasse ich mir gefallen"}, {"id": 1207, "start": 7827.34, "end": 7834.06, "text": "was ist mit dem dude los da oben will er nicht mal auf ihn zurück snipen"}, {"id": 1208, "start": 7834.06, "end": 7860.14, "text": "oder wagen ab der wagen ab"}, {"id": 1209, "start": 7860.14, "end": 7873.66, "text": "gut dass sie immer stehen bleiben zwischendurch"}, {"id": 1210, "start": 7873.66, "end": 7902.42, "text": "das war ein echt nicer headshot das hier das war ein echt nicer headshot"}, {"id": 1211, "start": 7902.42, "end": 7908.06, "text": "nicht schlecht ich hätte fast gedacht es war ein collateral"}, {"id": 1212, "start": 7908.06, "end": 7912.98, "text": "eben ah der erste ist nicht gestorben aber nicer clip das war ein cooler clip"}, {"id": 1213, "start": 7912.98, "end": 7924.5, "text": "ganzen snipers natürlich hat die map immer noch die gleichen bugs meinst du es hätte"}, {"id": 1214, "start": 7924.5, "end": 7932.9, "text": "irgendjemand gefixt die letzten acht jahre über"}, {"id": 1215, "start": 7932.9, "end": 7938.94, "text": "er wurde von fußbodenheizung gekillt das erniedrigend von fußbodenheizung"}, {"id": 1216, "start": 7938.94, "end": 7947.86, "text": "gekillt zu werden wieso wie alt wie alt bist du also ich bin jetzt sie noch nicht"}, {"id": 1217, "start": 7947.86, "end": 7952.14, "text": "ganz aber fast 37 und wenn ich battlefield spiele dann geht das immer noch"}, {"id": 1218, "start": 7952.14, "end": 7961.86, "text": "wird immer noch gebashed 49 ok dann weiß ich ich habe noch zehn jahre zeit was zu"}, {"id": 1219, "start": 7961.86, "end": 7967.58, "text": "auen danach ist vorbei die lege henne jawoll"}, {"id": 1220, "start": 7967.58, "end": 7986.26, "text": "wisst ihr das verstehe ich manchmal nicht warum liegt der typ da der typ eben hier"}, {"id": 1221, "start": 7986.26, "end": 7997.18, "text": "warum warum liegt er da der da was was was macht er da das es macht doch überhaupt"}, {"id": 1222, "start": 7997.18, "end": 8006.3, "text": "keinen sinn da zu liegen was ist seine mission genau was hat er"}, {"id": 1223, "start": 8006.3, "end": 8015.5, "text": "vor er hat sogar mit mit strenger stream quite a lot can be worth checking out as"}, {"id": 1224, "start": 8015.5, "end": 8021.22, "text": "wir roll up towards the release of 2042 the first is a highlight from goldmode"}, {"id": 1225, "start": 8021.22, "end": 8025.22, "text": "railway as he has a pretty big kill streak as he usually does but he hits"}, {"id": 1226, "start": 8025.22, "end": 8029.9, "text": "five toes in a row here's a few of them as we just look at part of the streak"}, {"id": 1227, "start": 8029.9, "end": 8033.94, "text": "insane accuracy from one of the best pilots one of the best players in"}, {"id": 1228, "start": 8033.94, "end": 8044.42, "text": "battlefield 4 man if you make five oh da gut"}, {"id": 1229, "start": 8046.74, "end": 8050.82, "text": "and his final clip is something epic I've actually been in the heli with him"}, {"id": 1230, "start": 8050.82, "end": 8053.94, "text": "when he does this little trick on sees a shanghai and I always think we're going"}, {"id": 1231, "start": 8053.94, "end": 8065.3, "text": "to crash really epic stuff what the fuck okay das ist das ist man nice hilly"}, {"id": 1232, "start": 8065.3, "end": 8075.5, "text": "hilly flying moving on to a locker clip its eros with a huge m249 back rage it's"}, {"id": 1233, "start": 8075.5, "end": 8084.62, "text": "about a minute of him just dominating players back rage jawoll zeigt mir die back rage"}, {"id": 1234, "start": 8093.02, "end": 8098.22, "text": "im battlefield 4 im vergleich zu battlefield 3 ist support mit lmgs"}, {"id": 1235, "start": 8098.22, "end": 8104.78, "text": "tatsächlich relativ beliebt einfach weil sie nachladen muss und nicht so"}, {"id": 1236, "start": 8104.78, "end": 8108.86, "text": "pressed wirst und leute so pressen kannst im battlefield vier kannst ja"}, {"id": 1237, "start": 8108.86, "end": 8112.34, "text": "nur mit der lmg leute so pressen wenn ich noch irgendwie das richtig im kopf"}, {"id": 1238, "start": 8112.34, "end": 8114.46, "text": "habe"}, {"id": 1239, "start": 8121.06, "end": 8126.02, "text": "das ist na also sie machen um kilt sind immer nice zu sehen"}, {"id": 1240, "start": 8126.02, "end": 8131.06, "text": "slightly longer clip für junext in his usual fashion we're gonna be seeing a"}, {"id": 1241, "start": 8131.06, "end": 8135.18, "text": "clip from dusty as he plays on a map and mode combination that we rarely get to"}, {"id": 1242, "start": 8135.18, "end": 8139.86, "text": "see on the top plays the scope of omen and it's rush now this map is very"}, {"id": 1243, "start": 8139.86, "end": 8144.1, "text": "difficult to play best player in my my lieblings meine mit abstand lieblings"}, {"id": 1244, "start": 8144.1, "end": 8148.82, "text": "war im battlefield 4 acr not much cover you do get a couple of buildings here"}, {"id": 1245, "start": 8148.82, "end": 8153.38, "text": "and there but in terms of the map undulating and having some good cover on"}, {"id": 1246, "start": 8153.38, "end": 8158.54, "text": "at least these m-coms you don't really get it so vehicles can have a field day"}, {"id": 1247, "start": 8158.54, "end": 8162.5, "text": "against you and often you find yourself pinned back if you've got somebody like"}, {"id": 1248, "start": 8162.5, "end": 8166.3, "text": "dust on your team though who is keen to get onto the objectives and just get as"}, {"id": 1249, "start": 8166.3, "end": 8170.58, "text": "many kills as possible an aggressive infantry player you're in luck this is a"}, {"id": 1250, "start": 8170.58, "end": 8174.18, "text": "nice one is he kind of sweeps up the enemy players playing around the"}, {"id": 1251, "start": 8174.18, "end": 8196.02, "text": "objective just clearing it up for his team"}, {"id": 1252, "start": 8196.02, "end": 8199.7, "text": "eins muss man sagen was sie immerhin bekommen haben im battlefield ist"}, {"id": 1253, "start": 8199.7, "end": 8203.62, "text": "richtig geiler sound oder fällt euch in bettel viel an was kacke sound hatte mir"}, {"id": 1254, "start": 8203.62, "end": 8208.94, "text": "nicht auch wenn die letzten zwei nicht meins waren sound technisch waren die"}, {"id": 1255, "start": 8208.94, "end": 8213.54, "text": "sicherlich auch extrem gut ist next with a streak on shanghai with the m16 a4"}, {"id": 1256, "start": 8213.54, "end": 8217.98, "text": "again it's a rush streak wobei ich ja sagen muss battlefield 3 beziehungsweise"}, {"id": 1257, "start": 8217.98, "end": 8226.38, "text": "am erster bett company 2 bett company 2 mit war tapes beste"}, {"id": 1258, "start": 8226.38, "end": 8230.46, "text": "laria but at the same time you've also got a lot of players coming from"}, {"id": 1259, "start": 8230.46, "end": 8234.74, "text": "different angles it's more players on a smaller part of the map as opposed to"}, {"id": 1260, "start": 8234.74, "end": 8238.42, "text": "conquest where people tend to be spread out a lot more a nice aggressive"}, {"id": 1261, "start": 8238.42, "end": 8262.86, "text": "infantry play rana to a com rato"}, {"id": 1262, "start": 8262.86, "end": 8271.58, "text": "dext thanks for watching this episode as a field for top plays gg it's"}, {"id": 1263, "start": 8278.86, "end": 8282.82, "text": "das habe ich mir auch gerade gedacht für battlefield hat eine ziemlich"}, {"id": 1264, "start": 8282.82, "end": 8286.42, "text": "niedrige sens ich spiele in bettel field auch absichtlich immer ein bisschen"}, {"id": 1265, "start": 8286.42, "end": 8289.78, "text": "höher weil ich keinen bock habe hier einmal über schreibt nicht zu kurbeln"}, {"id": 1266, "start": 8289.78, "end": 8292.74, "text": "für eine halbe drehung"}, {"id": 1267, "start": 8297.22, "end": 8303.42, "text": "das sind alles die ehemaligen cs pros die quasi erst mal einen kilometer rennen"}, {"id": 1268, "start": 8303.42, "end": 8307.86, "text": "für eine halbe drehung was war denn eigentlich schlecht an"}, {"id": 1269, "start": 8307.86, "end": 8312.3, "text": "battlefield 1 kann ich nicht sagen ich habe viel eins nie richtig gespielt hat"}, {"id": 1270, "start": 8312.3, "end": 8318.38, "text": "mich null angesprochen habe die beta gespielt hat mir nicht gefallen"}, {"id": 1271, "start": 8318.38, "end": 8332.66, "text": "und zu sagen war nicht mein fall battlefield 5 habe ich ein bisschen"}, {"id": 1272, "start": 8332.66, "end": 8338.86, "text": "gespielt auch in ordnung aber hat mich auch nicht so gecatcht irgendwie"}, {"id": 1273, "start": 8338.86, "end": 8347.02, "text": "deswegen ich habe echt große hoffnung battlefield 2042 aber wie gesagt nicht"}, {"id": 1274, "start": 8347.02, "end": 8353.42, "text": "vorbestellen und am ende kann sich immer noch scheiße spielen es bringt nix wenn"}, {"id": 1275, "start": 8353.42, "end": 8360.22, "text": "ein spiel aus ganz vielen guten teilen besteht oder aus aus vielen teilen mit"}, {"id": 1276, "start": 8360.22, "end": 8364.46, "text": "potential besteht wenn die nicht zu einem gesamten guten game zusammen"}, {"id": 1277, "start": 8364.46, "end": 8366.98, "text": "gefügt werden"}, {"id": 1278, "start": 8371.54, "end": 8375.98, "text": "und aktuell sieht es halt aus als hätte battlefield 2042 schon viele teile mit"}, {"id": 1279, "start": 8375.98, "end": 8384.14, "text": "potential aber ob dann ein gutes gesamt game bei rauskommt das müssen sie"}, {"id": 1280, "start": 8384.14, "end": 8390.7, "text": "erst mal beweisen ich ich ich würde es mir wünschen ja dass"}, {"id": 1281, "start": 8390.7, "end": 8393.58, "text": "schon wieder ein battlefield habe wo ich bock habe jeden tag den krassen"}, {"id": 1282, "start": 8393.58, "end": 8399.26, "text": "battlefield crime zu machen in your face"}, {"id": 1283, "start": 8399.26, "end": 8410.42, "text": "immer noch ei ist nicht so als hätte nicht er auch gute spiele gemacht oder"}, {"id": 1284, "start": 8410.42, "end": 8419.46, "text": "raus raus published die werden die werden garantiert die haben wir schon"}, {"id": 1285, "start": 8419.46, "end": 8423.34, "text": "gesehen dass sie die war zone monetisierung geschichte machen mit"}, {"id": 1286, "start": 8423.34, "end": 8431.18, "text": "season passes und sowas wie viel sollte ein frischer software entwickler der"}, {"id": 1287, "start": 8431.18, "end": 8434.38, "text": "1,5 jahre als werkstätten der firma gearbeitet verdienen was sagst du"}, {"id": 1288, "start": 8434.38, "end": 8438.22, "text": "wie gesagt ich kann da nicht wirklich viel zu sagen es kommt ganz entscheidend"}, {"id": 1289, "start": 8438.22, "end": 8443.14, "text": "darauf an in welche regionen und in welcher branche du bist"}, {"id": 1290, "start": 8443.14, "end": 8453.58, "text": "ich kann es echt schlecht sagen es gab bei heise erst letztens nur um frage ja"}, {"id": 1291, "start": 8453.58, "end": 8459.5, "text": "helium meinung habe ich schon gehört über laura aber ich glaube nicht dass"}, {"id": 1292, "start": 8459.5, "end": 8462.74, "text": "das irgendwie was wird"}, {"id": 1293, "start": 8462.74, "end": 8473.78, "text": "aber ich habe hunger und zwar ist es 12 bin ich schon an 220"}, {"id": 1294, "start": 8473.78, "end": 8496.94, "text": "bock ich bock marke mir das mal sessions session kw besser name alle tabs"}, {"id": 1295, "start": 8496.94, "end": 8501.3, "text": "gebucht macht weil ich glaube ich gehe mir jetzt was zu essen machen und ich"}, {"id": 1296, "start": 8501.3, "end": 8504.26, "text": "nehme nachher noch ein video auf wie gesagt ich wollte ihnen video aufnehmen"}, {"id": 1297, "start": 8504.26, "end": 8507.5, "text": "zu diesem zu diesem cheat geschichten was level cap da auch gezeigt hat"}, {"id": 1298, "start": 8507.5, "end": 8512.3, "text": "völlig ist ein interessantes thema und ihr habt mich eben ihr habt mich auf die"}, {"id": 1299, "start": 8512.3, "end": 8520.34, "text": "paar ideen gebracht im chat heute für neues video videos einmal einmal dass"}, {"id": 1300, "start": 8520.34, "end": 8522.46, "text": "ich über mein eigenes vorstellungsgespräch damals zur"}, {"id": 1301, "start": 8522.46, "end": 8525.34, "text": "ausbildung erzählen könnte könnte da gab es ein bisschen mehr zu erzählen was"}, {"id": 1302, "start": 8525.34, "end": 8528.94, "text": "ich im stream gemacht habe plus ich fand das ist eigentlich auch ein gutes thema"}, {"id": 1303, "start": 8528.94, "end": 8532.78, "text": "gewesen so was da was aktuell schief läuft so mit vorstellungsgesprächen so"}, {"id": 1304, "start": 8532.78, "end": 8537.06, "text": "diese ganze wie viel smarties passen in einen smart und und so was dass ich"}, {"id": 1305, "start": 8537.06, "end": 8541.7, "text": "viele viele firmen für das nächste nächste google oder facebook halten"}, {"id": 1306, "start": 8541.7, "end": 8548.9, "text": "obwohl sie irgendeine software klitsche aus aus in einem kaff sind"}, {"id": 1307, "start": 8548.9, "end": 8559.94, "text": "gucken wir mal die silicon valley habe ich nicht gesehen"}, {"id": 1308, "start": 8559.94, "end": 8563.3, "text": "ist das nicht so eine comedy serie da habe ich ein paar ausstätte davon"}, {"id": 1309, "start": 8563.3, "end": 8571.3, "text": "gesehen ist das die ist das die serie wo es"}, {"id": 1310, "start": 8571.3, "end": 8575.86, "text": "wo es dieses diese diese sagen wir mal in anführungsstrichen berühmte berühmte"}, {"id": 1311, "start": 8575.86, "end": 8579.94, "text": "szenen gibt wo sich der typ mit seiner freundin drüber streitet ob imax oder"}, {"id": 1312, "start": 8579.94, "end": 8582.18, "text": "wim"}, {"id": 1313, "start": 8587.74, "end": 8596.26, "text": "was ist das ok ja da kenne ich nur diesen ausschnitt"}, {"id": 1314, "start": 8596.26, "end": 8608.66, "text": "so schauen wir mal wer ist ein ordentlicher hosten hier der frasier ist"}, {"id": 1315, "start": 8608.66, "end": 8611.46, "text": "nicht da der frasier spiel wieder irgendwelche"}, {"id": 1316, "start": 8611.46, "end": 8626.46, "text": "mobile games da will er eh nicht von mir gehostet werden"}, {"id": 1317, "start": 8626.46, "end": 8629.94, "text": "ich gehe ich gehe jetzt auf ich gehe was zu essen machen bis denn wir sehen uns"}, {"id": 1318, "start": 8629.94, "end": 8644.46, "text": "zu"}]}