{"text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder, tschüss, tschüss, tschüss, tschüss. Aiaia! Aiaia! Aiaia! Aiaia! So, auf geht's! St. Porgeres, Leute! Leute, was gibt's heute? Das, was im Titel steht. Heute stemmt der Titel tatsächlich mit dem Inhalt überein. So sieht's aus. Muss mal kurz was trinken. Aiaia! Aiaia! Huge Sub. Die Online-Werbung? Tja, manchmal kommt man nicht drumherum. Aber wisst ihr was? Ich halte die Telekom immer noch für den besten Provider, den wir haben. Leider hat's die Telekom, also Qualitätstechnisch, leider hat's die Telekom die letzten Jahre über komplett, oder nicht nur die Telekom, generell die Kupferleitungs-Telefon-Geschichten, ja gut, da gibt's außer der Telekom ehrlich gesagt nicht viel, die haben's einfach verkackt auszubauen. Unabhängig davon, an wem's jetzt liegt, auf wem man das jetzt schieben mag, dass es zu wenig Geld gibt, dass es Stau bei den Auszahlen von den Geldern gibt, dass es Stau gibt beim Ausbau, unabhängig davon stehen die Kabelanbieter tatsächlich besser da als die Telekom, aber auch die Kabelanbieter müssen gucken, was sie mit ihrem Netz machen, weil ewig können die da auch nicht mehr mit rumwursten. Telekom hat halt voll die Arschkarte. Überlegt euch mal, VDSL, was ist das schnellste VDSL, was es aktuell gibt? 250? Das stinkt halt schon gegen die theoretische Gigabit-Geschwindigkeit von Kabel ab, wobei Kabel ist halt auch Gigabit nur eine theoretische Geschichte. Wenn du Glück hast, geht's, wenn du Pech hast, geht's nicht. Ja, ich glaub, 250. Und der Witz ist halt, dass 250... Nee, das nimmt sich... Ping-mäßig nimmt sich das jetzt nicht allzu viel. Das Problem ist jetzt halt, 250 sieht okay aus im Jahr 2021. Das Problem ist aber, dass nichts schnelleres mehr in Aussicht ist. Also 250 sieht in Ordnung aus aktuell, aber es ist jetzt schon auf dem, sagen wir mal, auf den etwas... Ja, auf der langsameren Hälfte, wenn man das mal mit anderen Ländern auch vergleicht. Das ist auf der etwas langsameren Hälfte, ja. Aber es ist okay im Jahr 2021, aber wenn man jetzt überlegt, da ist jetzt vorbei. Ich weiß nicht, hat jemand von euch einen Durchblick? Ich hab das jetzt schon eine Weile nicht mehr verfolgt. Wie sieht das aus mit Ausbau? Gibt es, gibt es demnächst ein super, super Vectoring? Oder ist jetzt mit 250 wirklich endgültig, endgültig vorbei? Also für mich sieht es so aus, als wäre es endgültig vorbei. Vielleicht ganz, ganz krasse Ausnahmefälle mit irgendwelchen Geschichten. Ich wohne gegenüber vom, vom Endpunkt oder so, aber ansonsten... Was ist denn? Ist das nicht Glasfaser? Das denke ich mir auch schon seit einer ganzen Weile, ja. Tatsächlich. Ich verstehe es auch nicht so genau, wo das Problem ist. Geld, also ich weiß nicht ehrlich gesagt, woran es genau hängt, aber Geld scheint ja da zu sein, aber man bekommt das organisatorisch nicht hin. Ich glaube, vielleicht wäre der bessere Ansatz zu sagen, hey, ihr bekommt nur Geld, also wir bezahlen euch quasi dafür, wenn es denn wirklich da ist. So quasi, wir bezahlen euch tatsächlich für das Anschließen von Haushalten, egal ob das jetzt irgendwelche Bauernhöfe oder sonst was sind. Im Prinzip so, wie man es mit den Impfzentren gemacht hat. Überlegt euch mal die Impf-, äh nicht die Impfzentren, meine ich die, die Testzentren. Mit den Testzentren hat man das doch auch hingekriegt. Man hat gesagt, ey, mach Testzentrum hin, ihr kriegt Geld dafür. Bam, an jeder Scheißecke ist ein Testzentrum. Ich hab letztens ohne Scheiß, Leute. Kein Spaß. Ich hab einen Dönerladen gesehen mit einem Test-, äh mit einem Zelt und einem Testzentrum davor. Ein Dönerladen. Da war Kebap und davor stand ein Zelt mit Testzentrum. So einfach kann das funktionieren. Kannst du während deiner Testergebnis waren das ganze Dönerfutter an. Wobei ja, ein Testergebnis geht ja schnell, aber. Ja, kann mal einer kurz erklären, was Supervektoren ist. Also die technische, ich kann dir erklären, was es ist, aber die technische Seite habe ich mich nie so genau damit beschäftigt. Es ist eine Technik, wie du über die Oldschool-Kupferleitung, da wo früher Telefon drüber ging, wie du dort noch ein bisschen mehr Bandbreite rausholen kannst für Internetanschlüsse. Also generell Bandbreite für Datenübertrag, muss ja nicht Internet sein. Bandbreite für Datenübertrag. Also das ist im Prinzip die Weiter-, Weiter-, der Weiterentwicklung von DSL. Hat halt den Nachteil, geht nur über relativ kurze Strecken. Ich weiß jemand von euch aus dem Kopf, was maximale Länge ist Supervectoring, dass das geht mit 250. Das kann nicht lang sein Kilometer, wenn es hochkommt, oder? Wenn es hochkommt, eher weniger. 400 Meter? Ja, so in einem Dreh, hätte ich mir das jetzt auch gedacht. Ja, das ist halt nicht viel. 300 Meter. Macht es halt auf dem Land teilweise uninteressant, und das ist ja das eigentliche Problem, was es auch beim Ausbau gibt. In der Stadt hast du oftmals viele Alternativen. Guck mal, bei mir, ich könnte Supervectoring von der Telekom nehmen, ich könnte Gigabit von Vodafone nehmen, wenn ich ganz hardcore drauf bin, könnte ich auch LTE oder demnächst 5G oder so was nehmen, oder Telekom Hybrid, oder was auch immer, alles mögliche. Bei mir gibt es ja im Prinzip alles. Aber wenn du mal ein bisschen auf dem Land guckst, in der Regel ist es so, da wo eins scheiße ist, sind alle anderen auch scheiße, und das ist halt Müll. Du kannst sagen, da wo scheiße ist, ist es halt scheiße. Stimmt, stimmt. Ja, Leute, ich habe es schon wieder ganz vergessen, die Antenne ist mittlerweile noch größer geworden. Soll ich das mal an? Armlieg. Die Antenne geht mir mittlerweile fast schon bis zur anderen Seite rüber. Nach der Impfung. Aber mir tut zumindest der Arm nicht mehr weh. Eigener 5G-Mast, ja. Ihr Armlieg. Ihr Bizepslieg, genau. Das ist E, das sind alles keine Muskeln, das ist alles Pippo-Fett. Nein, ich glaube nicht, dass Starlink irgendwas ablösen wird bei uns in Deutschland im großen Stil. Das glaube ich nicht. Ja, es gibt sicherlich total viele Varianten, was man machen kann. Wichtig ist im Endeffekt, dass man die nicht für irgendwelche Ausbauten und Absichtserklärungen bezahlt, sondern die müssen bezahlt werden dafür, dass sie es gemacht haben. Auch mit einer Auflage, bis dann und dahin. Das ist übrigens das gleiche. Kann sich noch jemand an die UMTS Auktion erinnern? Von... wann war das denn? 2000... So, da haben die... Ich weiß, das ist jetzt fast schon Boomer-Zeiten. Vielleicht einige von euch noch nicht, keine Ahnung. Vielleicht kann sich irgendjemand an die UMTS Auktion erinnern. Das war ja damals Big Brain Time, das so zu machen. Man hat ja auch versucht, so ein spezielles... Ich habe vergessen, wie es heißt. Die haben das so ein ganz spezielles Versteigerungsverfahren gemacht, wo die Anbieter quasi irgendwie nicht wussten, was die anderen Anbieter abgeben, um da möglichst viel Geld rauszubringen. Das Problem war nur, die Anbieter haben da so viel Geld bezahlt, so viel Geld ausgegeben, und das war im Prinzip an nichts geknüpft, was heißt, was im Endeffekt heißt. Die Anbieter haben sich alle, wie verrückt, übersteigert, überboten, bis da noch ein paar übrig geblieben sind. Man hat halt damit auch so effektiv verhindert, dass es mehr Anbieter als... keine Ahnung, wie gibt es denn Telekom... Oder wie gab es denn damals? Telekom, Vodafone... Damals gab es nicht so viele Anbieter, 2-3. Und was haben die jetzt für einen Anreiz gehabt? Nee, E+, genau, E+, ja. Und was haben die jetzt für einen Anreiz gehabt, in ländlichen Gebieten mit 5 Benutzern auszubauen? Gar keinen, null. Die haben dort ausgebaut, wo es viel Kohle zu holen gab, weil die haben eh schon so viel Geld bezahlt. Man hat effektiv verhindert, dass weitere Anbieter dazukommen, die da irgendwie ein bisschen, ja, das Ganze aufmischen können. Und man hat dadurch auch nicht dafür gesorgt, dass sie ein großes Interesse haben, überall auszubauen. Deswegen haben wir auch so viele Funklöcher. Bei mir in Meintal, jeden Tag, oder ich fahre nicht jeden Tag, aber... Apps, Google, Meintal, ich kenne keinen Mensch, aber Ostbahnhof, so. Jeden Tag, wenn ich da vorbeifahre, ich fahre nicht jeden Tag vorbei, aber jedes Mal, jedes Mal, wenn ich da vorbeifahre, hier, Meintal Ost Bahnhof. Zwischen Meintal West und Meintal Ost, jedes Mal, wenn ich da vorbeifahre, hier ist die Bahnstrecke, ist Funkloch. Ich weiß nicht, was die da machen, keine Ahnung. So, und das Problem mit den UMTS Auktionen war, dass die halt keine Anreize hatten. Hätte man gesagt, gut, ich meine, im Nachhinein ist man immer schlauer, und wenn ich das sage, heißt es noch lange nicht, dass das funktioniert hätte. Aber überlegt euch mal, man hätte gesagt, hey, Anbieter, ihr bekommt die UMTS Lizenzen, ihr kriegt die meinetwegen sogar kostenlos. Aber nur, wenn ihr euch verpflichtet, auszubauen, flächendeckend, und ihr kriegt den Kram nur unter den Auflagen oder nur, nachdem wir gesehen haben, ihr macht das oder ihr habt auch wirklich einen Plan, einen überprüfbaren Plan, wie das Ganze funktioniert, da hättest du gesehen, die werden rumgerannt am Arsch der Welt und hätten irgendwie Zeug aufgestellt. Ja, gut, das kann man im Nachhinein immer gut sagen. Und letztendlich, was hat das Geld gebracht, was man damit eingenommen hat? Weiß ich, ob das damit... Ja, naja. Ist das jetzt traditionell? Mach ich doch selten. Aber das ist halt so ein typisches Thema gewesen, UMTS Auktionen, wo man es meiner Ansicht nach verkackt hat. Hätte man das wirklich, hätte man wirklich gesagt, hey, ihr kriegt die unter Auflagen, dass ihr das und das bis dann macht und nicht solche komischen Sachen, wie es aktuell immer erzählt wird, bis 2035 ist das und das passiert. Nee, nee, nee, das muss kurzfristig sein. Es muss gesagt werden, hey, unser Ziel ist es, keine Ahnung, wenn man 2010 versteigert hat, hat man gesagt, okay, unser Ziel ist es 2020 flächendeckend abgedeckt. Und wir haben einen genauen Plan. Und wenn ihr euch nicht dran haltet, kriegt ihr eure Lizenzen weggenommen. Und hättet ihr mal gesehen, kommt wie schnell, wie gesagt, wie bei Corona Testzentren an jeder Ecke. Die werden amok gelaufen. Okay, das ist vielleicht ein bisschen übertrieben, aber die werden amok gelaufen im UMTS-Masten aufstellen. Ja, wäre alles, alles, alles wunderbar funktioniert. Und so könnte man das ja auch beim Festnetzausbau machen. Aber egal, das ist so ein. Ja, ich verstehe. Übrigens Leute, was mich heute mega verwirrt hat. Was mich heute mega verwirrt hat, ist folgendes Bild von Apple. Guck mal, ich habe dieses Bild von Apple gefunden. Ich habe, ich habe ein iPhone 11 hier und ich habe gesucht iPhone 11 Dual SIM und habe ich dieses Bild gefunden von Apple. Wie sieht dieses Bild für euch aus? Also auch noch in Deutsch beschrieben, auch noch in Deutsch. Wie sieht dieses Bild für euch aus? Kann man da zwei SIM-Karten rein machen? Ja oder Nee? Ich würde sagen, ja, kann man eine oben, eine unten. Ich zeige euch auch, dass ich keinen Mist erzähle. Das ist wirklich ein Apple Bild. Da, guck. So sind es die nächsten Nano SIM-Karten. Aber ich habe das Bild gesehen, habe mir gedacht, nice. Da kann ich das Handy, was ich von der Firma bekomme, auch für mein Aldi-Talk verwenden. Ich brauche kein zweites Gerät mehr. Und ich habe es nicht hingekriegt. Ich habe mir gesagt, wie um alles in der Welt soll da die SIM-Karte reinpassen? Das funktioniert überhaupt nicht. Bis ich es dann irgendwann gecheckt habe, diese Anleitung von Apple hier komplett in Deutsch, komplett eingedeutscht, gilt nur für, Moment, in Festland, China, Hongkong und Macau. Ich weiß nicht mal, wo das ist. China, China, China, China, China, China, China, China, China, China, China, China, China, China, China, China, China, China. Wo ist das überhaupt? Ich kann keine eSIM nehmen, weil Aldi-Talk keine eSIM anbietet. Weil das irgendein richtiger, keine Ahnung, Boomer Verein, nee. Keine Ahnung, wo ist das? Okay, dann kann man davon ausgehen, dass die Chinesen der Meinung sind, das gehört zu China. Im Prinzip ist es ja so, bei allem, was irgendwie um China liegt, sind die Chinesen der Meinung, das gehört ihnen. Ist ja hier bei, äh, hier, Taiwan, ist ja das gleiche. Taiwan, die Chinesen sind ja auch der Meinung, das ist meins, ist unseres, alles meins. Naja, aber ja, habe ich verkackt und ich dachte, das geht. Aldi Talk hat leider keine eSIM, das heißt, ich bräuchte einen anderen Anbieter. Eigentlich wollte ich aber keinen anderen Anbieter. Die Festland-China-Chinesen, genau, A91202, Dankeschön für 3 Monate Subscription. Hä? Wer soll das denn ausbauen, wenn nicht die Anbieter, die Anbieter haben wenigstens Ahnung von der Technik. Äh, ja, ja, mach mal Ausrufezeichen 1 im Chat, da gibt es sogar eine Erklärung zu, aber es hat keinen tieferen Sinn, also es gibt keinen Grund, dass man das auch so machen müsste. Ne, ne, es gibt mehr Anbieter mit eSIM als die Telekom, Cellmapper, ok, nein, ich suche jetzt, ok, ich guck mir das jetzt an, Cellmapper, Provider, Telekom, ok, und wo sucht man da jetzt, wo sucht man da jetzt nach, ah, hier Location Search, Meintal Ost, da sind wir doch. So, und wo erkenne ich jetzt, ob es da, ob es da Funklöcher gibt? Also hier ist Meintal Ost, da ist Hanau Wilhelmsbaden, da ist irgendwo Hanau West, ähm, Meintal, irgendwo ist Meintal West, so und hier dazwischen, hier dazwischen, kackt mir regelmäßig die, die, die, die Handyverbindung ab, hier so wahrscheinlich, guckt mal, hier ist da auch kaum was, ja, aber davor auch, guckt euch das mal an, ja, RIP, ja, äh, ich weiß noch, als Corona angefangen hat, hatten wir eine Video-, äh, keine Videokonferenz, ein Teamscall, wo mein Chef was erzählt hat zu aktuellen Entscheidungen auf der Arbeit, also letztes Jahr März oder so, wann das war und ich bin gefahren hier nach Hanau von, äh, von Frankfurt Ost-, äh, Frankfurt Süd, müsste, müsste hier irgendwo sein, bin verwirrt, ich weiß nicht, wo das ist, aber ich bin gefahren von Frankfurt Süd nach Hanau und es ist fünfmal abgekackt zwischendurch, ich hab die Hälfte nicht mitbekommen, so, ich mach mal kurz hier IDE auf, der Overlay-Champ, ja, wir machen heute am Overlay-Champ ein bisschen weiter, gucken, wo wir stehen geblieben sind, zumal der Source-Scout ja eines der hässlichsten, schau mal, wie es bei dir zu Hause ist, leek, äh, eines der hässlichsten Dinger ist überhaupt, aber wie, das ist ja auch eigentlich im Prinzip nur alles untereinander, untereinander geschrieben, mal gucken, ob es noch funktioniert, oh, oh, High-Speed, High-Speed, Leute, High-Speed GIF, High-Speed GIF, das GIF ist so schnell, dass ihr die Hälfte der Bilder nicht seht, oder, MonkaS, ihr sehts, ihr seht aber nicht dieses ultra-schnelle Rum-Gedingse, oder, seht ihr das, Moment, Wupp-Lords auf Twitch, ja doch, sieht man, ist voller Abkacken, der rendert grad so schnell wie es geht GIFs, äh, Moment, echt, iPhones haben kein Dual-SIM, ja, anscheinend nur eine SIM-Karte und eSIM als zweites, naja, ich kanns mir nicht aussuchen, ich kann jetzt ja schlecht auf die Arbeit gehen und sagen, ja, also ihr stellt mir zwar kostenlosen iPhone zur Verfügung, aber, äh, iPhone ist für Kacknoobs, gib mir ein Android-Gerät, aber das kann ich sagen, aber das wird keiner machen, wenn alle nen iPhone 11 kriegen, dann krieg ich auch nen iPhone 11, jetzt nicht, dass, dass der Weisheitsletzter Schluss wäre oder so, aber das betrifft, jetzt kann ich nix machen, 100% CPU, 100% GPU, nee, das mach ich, Moment, wenn, wir gucken uns jetzt mal kurz, wir gucken uns mal kurz an, wie viel CPU-Auslastung das ganze hat, guck mal, fast nix, Leute, 2% und GPU, sollte das nicht eigentlich drinstehen irgendwo, ach hier, nix, 3% GPU, 5% CPU, das ist ja, das ist ja nix, da wirds einem schlecht, wenn man das zu lange anguckt, warum du zwei SIM-Karten brauchst, naja, ich will meine private Telefonnummer und die SIM-Karte von der Arbeit in einem Gerät haben, dass ich keine zwei Geräte mehr brauch, 5€, beim Chef hab ich da kein Problem, der findet das wahrscheinlich sogar noch lustig, aber die, die das entscheiden können, denen ist das vollkommen egal, doch, wahrscheinlich schon, aber die werden ja nicht nur für mich ne e-SIM da ausstellen, nee, nee, nee, nee, nee, ich frag da nicht, ich suche mir lieber einen Anbieter mit e-SIM, kann man eigentlich seine Mobilfunknummer einfach umziehen, hab ich noch nie gemacht, also wenn ich jetzt von Aldi Talk wechseln will zu irgendwas mit e-SIM, geht das einfach, genauso einfach wie Festnetznummer wechseln, einfach Antrag ausfüllen beim nächsten, ja, ob das ein bisschen was kostet, interessiert mich nicht, also solange das jetzt irgendwie 80€ kostet oder so, ist ok, wenn die 2,50€ als Gebühr haben wollen, interessiert mich das nicht weiter, du bist zu was gewechselt, Frank, was ist Frank, Frank Mobile, was für ein Ding, was ist das, das hab ich noch nie gehört, gibt es irgendwie jeden Tag neue Anbieter oder was, außer mal äußerst hässliche Webseite, was ist das, hab ich noch nie gehört, was für den reese woher wissen die wie ich heiße oder oder steht das überall oder steht das überall maximilian what the fuck das wissen die nicht ich gehe mal davon aus dass es wirklich max mustermann ja ja und was was haben was haben die irgendwie e sim ok dein tarif per app prank oder fraenk flat 10 euro pro monat nicht mehr gibt es noch was billigeres dennchen mehr infos gibt es noch was billigeres weil ich brauche den datentarif im prinzip kaum noch ich brauche ich brauche eigentlich nur für telefon weil datentarif nämlich die simkarte von der arbeit ich brauche das billigste überhaupt wo ich zwei faktor sms empfangen kann ach wurscht aber irgendwo anders was win win sim win sim klingt nach scam weiß ich manche anbieter klingen klingt vom namen her schon richtig nach scam all die hat keine e sim sim quadrat was sind das alter kann das jetzt gibt es nicht wirklich sim quadrat oder das ist für alle minecraft leute tatsächlich sim quadrat die anbieter namen ohne daten kein internet ja sowas reicht ganz ehrlich fünf euro perfekt reicht mir e sim gigabyte datenvolumen ist ok wie gesagt ich verwende das ähnlich für datenvolumen dafür dafür verwende ich die andere simkarte ich brauche eigentlich nur eine handynummer was kostet was kostet handynummer umziehen du hast eine domain die sehr nah an win sim dran ist die schicken die laufend kündigung ist fast wie bei mir auf der arbeit bei mir rufen auch manchmal verärgerte verärgerte außendienst mit mit arbeiter an und fragen mich wo ihre provision bleibt und da denke ich warum was sie sind hier falsch und das problem ist halt dass meine telefonnummer fast soweit ist wie die für die abrechnung für die professionsabteilung für frag mich nicht hessen süd oder so da kommt über mir alle können vorstellen wenn die an also wenn einer vom außendienst anruft in der zentrale und sagt was ist los mit meiner abrechnung dann könnte davon ausgehen er hat in der regel kein geld gekriegt ist sauer glaube sowas mache ich wie funktioniert das einfach eine app installieren und dann in den iphone settings hinzufügen oder wie sim quadrat aber der nabe macht mich immer noch fertig sim quadrat ich als einzige mod was ich quadratisch habe gerade ich habe noch ein anderes quadratisches emote verstehe ja muss ich mir mal angucken ich glaube das werde ich machen so los geht's was ein brief und dann mit qr code ok ja das wird das wird wird schon wird schon tun so also wo sind wir denn stehen geblieben ich würde sagen als allererstes dass das wichtig das mit abstand wichtigste feature was wir unbedingt noch brauchen ist wir brauchen fps counter leute ich muss wissen mit wieviel fps rare parrot rad zeigt mal her blicke ich überhaupt noch durch bei diesem ganzen dass ich meine das ist eines der hässlichsten dinger die ich hier je gebaut habe blicke ich überhaupt noch durch wo hier was passiert wo passiert denn hier was ja am besten am besten auch die variable namen also merkt euch plupp und temp sind mit abstand die besten variablen namen überhaupt da weiß man sofort bescheid was wofür das da ist wenn ich das überhaupt noch irgendwo ach hier ok lull lull ist lull ist auch gute variable namen aber temp temp oder i i und i n temp und plupp sind meine also i n temp plupp das sind so meine meine hallo lull meine meine lieblingsvariablen namen ok also wo wo wo wo wo mache ich hier den output begin draw hier also hier muss ich fps hochzählen glaube ich ok wir machen mal ein fps counter kurz fps nee keine ahnung auch auch beste du weißt man auch sofort für was da gekountet wird oh nee oh mache ich nicht selbst als selbst als parameter für ob ich mache ich mache ich o o mache ich eigentlich selten counter so und jetzt moment wie mache ich jetzt am besten fps counter irgendwie stopwatch ob übrigens hier richtig krasse hecker mein hex hier was ich letztens gelernt habe sogar im stream hat mir jemand gezeigt normalerweise habe ich immer gesagt stop stopwatch start das braucht man gar nicht das braucht man gar nicht pass mal auf man kann einfach sagen stopwatch alter autoverfall ständigung wo ist denn die autoverfall ständigungs ai wenn man sie braucht start new das ist nicht pock haben eine zeile gespart richtig richtig six hat wusste ich nicht hat mir letztens einer im stream gezeigt oder im chat geschrieben da sieht man einfach der chat ist wieder richtig richtig ist next level das kann ich gar nicht nicht jeden stream zeigen weil ich das glaube ich erst im letzten oder vorletzten stream selbst erfahren habe dass das so funktioniert es wird nach line of course bezahlt ja dann sollten wir auch auf kobold wechseln wieder ok also war von der logik her ich zähle wie viele fps ich habe und dann sage ich wenn meine mein timer seconds elapsed total total seconds größer gleich zwei alle eins dann geben wir aus wie viele wie viele wie viele frames sind und dann restarte ich den timer und setze die frames auf null ok mal gucken ob das funktioniert jetzt sollte ich ein frame so eine art frame counters 240 das kann ich sein das ist viel zu wenig 240 fps das ist wie sync das ist wie sync da ist wie sync an ich habe 240 als monitor warum ist da wie sync wie kriege ich wie sync aus wie sync muss aus aus wie sync null null sync du hast irgendwo bei sync habe ich echt sync ich habe nirgends wo sync stehen ich habe 240 hz monitor ja intervalle äh ging das nicht hier swap swap chain wie sync und da muss ich mal suchen swap chain wie sync ok warum streamst du da nur in 48 fps weil die meisten leute das überhaupt nicht richtig also gar kein großartiges mehrwert davon hätten wenn ich 240 fps streame und dazu kommt warum ich 48 fps und nicht 60 fps oder 30 stream ist weil wenn du eine gewisse gewisse bandbreite zur verfügung zum stream so und wenn du eine feste bandbreite hast dann ist natürlich für ein bild mehr bandbreite übrig wenn du weniger fps hast das ist ein present ach guck mal da present das müsste hier unten sein irgendwo ne swap ah hier hier guck mal present sync intervalle null so jetzt aber jawoll schau mal viel besser guck mal jetzt jetzt jetzt jetzt stimmt die anzeige hinten vorne schon mal nicht mehr jetzt komplett vorbei warum gehst du nicht auf 30 fps runter weil 48 fps genau der beste kompromiss ist zwischen flüssige wiedergabe und mehr bandbreite für den einzelnen frame übrig jetzt task manager so aber da geht noch mehr das sind noch ein bisschen wenig fps da muss noch mehr gehen ok guck mal jetzt haben wir schon ein bisschen mehr 15 cpu 15 prozent gpu da muss da muss aber noch ein bisschen mehr gehen naja woran das beschränkt ist der muss das gift decoden ich glaube nicht dass das direkt x zeug das problem ist sondern das das der gift decoder ist das problem ich meine wenn ich jetzt einfach den gift decoder unabhängig mache von dem von dieser schleife die das hier malt das stimmt ich glaube ich habe sogar noch die bag laufen genau stimmt hast recht ja mal hier auf net run das so genau dann würde das sicherlich viel viel schneller laufen ja leider auch wenn das war wie war das minus c release glaub ne macht macht kein bisschen bisschen aber nicht wirklich viel unterschied das einfachste wäre das einfachste wäre was ich nicht mache weil ich will ja keine 100 prozent cpu last hier verursachen also das einfachste wäre natürlich ich lasse das gif rendern quasi immer immer das aktuellste gif und schreibt das halt so schnell wie es geht rein und wenn es neues gibt dann halt neues aber das ist bescheuert wozu mein ziel mein ziel ist ja nicht hier irgendwie 100 prozent cpu last mit einem gif zu bekommen und schneller rendern als der gift decoder das gift decoden kann bringt halt gar nichts ich weiß wir können mal ausprobieren wie schnell es maximal geht das können wir machen da müsste ich aber irgendwie alter das ist so hässlich ich blicke hier überhaupt nicht mehr durch wo wird dann hier decoded hier aber wir können ich glaube wir können noch ein bisschen was optimieren wartet mal wir können noch ein bisschen wir können noch ein bisschen was ein bisschen was optimieren wir müssen das nicht jedes mal für jeden schleifen durchlauf anlegen wir müssen es nicht für den schleifen durchlauf anlegen das ist ok ob es jetzt schneller ist macht überhaupt kein unterschied und was ist wenn ich das freigeben wieder rausschmeißer dann habe ich zwar memory leak aber ist schneller ok das ffm pack memory handling macht überhaupt kein unterschied das ist wirklich das gift decoden was probleme macht man der liest das ja auch von der ssd und sowas macht kommentare rein näh das lohnt das lohnt sich alles nicht mehr ok ich mein ne da müsste ich das jetzt umbauen wie gesagt ich ich ich splitte das eh auf weil das mega hässlich ist also wir machen das wir machen da eh jetzt gleich ein paar eigene klassen wir machen wir machen eine klasse für das ffm pack decoder zeug und dann machen wir so eine eigene form fürs rendern weil ich habe ja aktuell hier alles komplett in einem thread also das gift decoden und das rendern von das direct x rendern ist alles alles alles in einem thread das heißt ich kriege ich kann jetzt gar nicht sagen hey warten wir einfach mal und zeichnen so schnell wir können das das funktioniert nicht so aber wir müssen die fps da noch irgendwie reinschreiben aber ich finde ich finde die decoding geschwindigkeit ist wie ist die im fullscreen genauso schnell also die decoding geschwindigkeit mit 1200 fps und so das ist durchaus in ordnung ich meine ich muss den kram eh runterschrauben auf ähm warte mal wo steht denn das drinnen frame time nee ähm ach du scheiße wo steht noch mal drinnen wie viel fps das ganze stream ist das glaube ich ne stream time timebase genau das brauchen wir und das kann ich mir nie merken das kann ich mir nie merken timebase zeigt mal kurz her wir machen prinzipiell print print debugging was anderes ist ja die bugger using ist für noobs das machen wir hier nicht 100 das gift hat doch im leben keine 100 keine 100 100 fps moment das das ist glaube ich mist was der da ausliest warte mal das muss ich mir jetzt gerade mal im detail angucken den gift mit 100 fps das wäre es jetzt aber noch bei frames gibt es doch bei gift gibt es doch pro frame jetzt halt ja da würde ich jetzt aber eigentlich erwarten dass ffmpeg das für mich ausrechnet so 25 fps sind es angeblich nur wie kriege ich wie kriege ich das raus in ffmpeg bei normalen also ich weiß dass man es bei normalen videos so raus kriegt wie ich es eben gemacht habe so ok ffmpeg gift fps ja frame rate frame rate gibt es das vielleicht frame frame rate oder sowas stream frame average frame rate ok warte mal wir haben eine r frame rate und wir haben eine durchschnittliche frame rate was ist das schon wieder was oh big brain time jetzt hat es was was will das von mir ok wir geben uns wir geben das jetzt einfach mal aus ok echt kein plan was haben wir denn sonst noch hier und durchschnittliche durchschnittliche frame rate ok sag ich ja ok das passt 25 fps beides zeigen sie das gleiche an also es ist egal zumindest bei diesem einen gift ist egal was ich nehme also das ist die frame rate von dem gift das muss ich mir merken das muss ich mir merken dass das nachher nachher richtig richtig machen kann ok also das heißt wir wissen jetzt schon mal wie man super schnell den gift malt huge da hat die welt drauf gewartet so und jetzt natürlich die nächste preisfrage wie kriege ich den fps counter wie kriege ich den fps counter hier oben hier oben hin was das für ein hotkey ist ctrl k ctrl also ctrl k c ctrl k c ist ein und aus kommentieren toggle k kom kommentar genau so gut was habe ich jetzt gesagt müssen wir machen boomer hier wieder am start der chat hat aber bestimmt aufgepasst fps anzeige korrekt also wie kriegen wir da jetzt eine fps anzeige gemalt so das heißt fps anzeigen draw text aha draw text ach du scheiße microsoft was ist das wieder moment was was hast du also hast du eine ahnung ob es reicht bei einem recapture von google das kript in den html header zu packen und die sind dann im kontakt also vor dem abschicken button oder was ich habe recapture noch ehrlich gesagt nie verwendet keine ahnung leute ich glaube ich sollte mal auf den preisschampen recapture drauf machen einfach weil eins einfach um die leute abzufacken einfach so direkt direkt hier in die mitte so ein fettes recapture dass man dann ab und zu mal hydranten oder fahrräder oder zebra streifen oder so ausfüllen muss keine ahnung weiß ich nicht so draw text ok test wir trauen auf mein was was zum ide write text format was was was will das von mir null wir sagen einfach null gibt es nicht und jetzt muss ich sagen wo das ganze wo das ganze hingeschrieben wird also oben links keine ahnung 200 200 das ist wieder richtig abartig gemacht der brush moment den haben wir doch hier irgendwie red oder oder black wie habe ich den haben wir nicht irgendwo eine farbe zum farbe malen schon gehabt wenn das nicht so übersichtlich eklig gemacht wäre dann brush ne haben wir nicht ok so jetzt jetzt wieder big brain wie macht man den kram brush create create solid color brush wunderbar color warum gibt es eigentlich color und color 4 ich mein color sind hier so ganz normale farben ok was ist color 4 ist genau der gleiche shit warum sollte ich denn warum gibt es color 4 und color color mit und ohne alpha verstehe ne ne brauchen wir nicht color black ich kann heute schreiben so und jetzt das kackt ab das geht so nett das geht das geht so garantiert dass das crash jetzt kann man bestimmt nicht null nicht null sein das war ja klar ok was muss da rein da gibt es doch bestimmt auf github hier ist noch mal dieses komische projekt was ich hier verwende für direkt x sample what is genau ok da brauche ich mal ich brauch da ein beispiel ich brauche da mal ein beispiel für wie das aussieht draw text super gibt es kein beispiel für perfekt oder ne gut dann brauche ich draw text example zeige hier ah die gute microsoft hilfe jetzt weiß man sofort bescheid konstwetscher ja string die was muss denn da was was brauche ich denn da ein e ein e d write text format wie wie funsta kram how to draw text ja das nee das das muss alles äußerst äußerst kompliziert sein damit nicht irgendjemand auf die idee kommt noch text text zu schreiben irgendwie draw text ok jetzt zeige uns ja microsoft wie das geht text format wo gibt es das hier das ist so obvios dass microsoft uns das noch nicht mal zeigen muss verstehe ach nee im moment das ist t++ create text format und dann ok create create text text format das macht mich fertig dieses direct 2d ist das eins der hässlichen hässlichsten frameworks mit denen ich jemals gemacht habe ich habe da ein video gesehen wegen programmieren einen guten sprach für den anfangen welches denn das letzte das mit algorithmen verstehen zusammen oder das ganz ganz alte ich überlege die ganze zeit ob ich mir go die ob ich mir go anschauen soll als sprache oder bei python bleiben soll was denkst du ist sinnvoll kommt auf an was du machen willst ist beides sinnvoll also sowohl go als auch python haben riesen hype die letzten jahre über du machst mit keinem was falsch es kommt darauf an was du machen willst du kannst natürlich prinzipiell in fast jeder programmier sprache fast alles machen aber es gibt halt es gibt halt schon ein paar vorzüge also ich würde sagen wenn du was im bereich sagen wir so ai machine learning machen willst dann eher python wenn du was in richtung was für sich wenn du mit irgendwelchen cloud tools oder sowas zu tun hast dann ist go eher das richtige oder wenn du möglichst eigenständig lauffähige anwendung haben willst da ist go auch wunderbar für wenn es dir um die geschwindigkeit geht dann prinzipiell go allerdings python je nachdem was du für eine library nimmst ist das auch schnell weil die library dann in c programmiert ist es halt die frage was du machen willst also das kann man so pauschal nicht sagen wir haben uns noch nichts überlegt wir haben uns noch nichts überlegt man kann mit python auch ohne probleme größere sachen weil wie gesagt ganze home assistant ist in python programmiert cringe alter wenn ich alles in assembler schreibt ja richtig cringe ziemlich cringe chat lochkarten nee rechenschieber komm jetzt also wenn wenn schon old school dann richtig dann dann rechenschieber aber aber kuss ja hier so programmieren die wahren profis ich will halt eine einfache syntax und halbwegs verständlich ebenfalls möchte ich halt das programmieren dann programmier weiter python weil die go syntax ist jetzt es ist die go syntax also syntax mäßig ja ist python ja meilenweit schöner als go und einfacher zu verstehen also wenn es dir nur ums lernen und die syntax geht dann bleib auf jeden fall bei python go ist sicherlich da nicht das schönste besten php und java man kann sich ja viel streiten aber dazu kann ich einfach sagen so nicht gerade das in kombinationen wie finde ich heraus ob fachinformatiker system gar nicht du guckst dir einfach die unternehmen an den ausbildungsplatz anbieten und suchst dir die raus die dir am besten gefallen scheiß drauf macht im prinzip machts am ende wenn dir der laden gefällt gar nicht so viel unterschied von dem was du was du kannst und natürlich prinzipiell kann man sagen klar die also die reine lehre wäre wenn du lieber sachen programmierst dann anwendungsentwickler wenn du lieber netzwerk oder administratorsachen machst dann fachinformatiker system integrieren aber wie gesagt je nach firma und einwendungsgebiet ist ist der übergang fließend echt gibt es das wirklich leute ahja gut jeder jeder jeder wie er das richtig hält die anlehnung von go an c sind ja nun wirklich nicht sonderlich sonderlich groß wie da sachen deklariert werden in welcher reinfolge irgendwas geschrien das hat überhaupt nichts mit c zu tun was mit der go syntax falsch ist das schlimmste ist schon mal dass die standardmäßig wollen dass man bei einem if else die klammern auf die gleichen zeilen auf die gleiche zeile macht das schon mal das geht schon mal das will ich net es nervt mich jedes mal wenn ich sehe dann hast du so sachen wie error codes und panic zusammen du hast keine du hast kein generics support er kommt jetzt irgendwann im jahr 2035 oder so mal dann hast du diese geschichte mit du kannst sachen mit wahr anlegen mit mit doppelpunkt gleich für gleich initialisieren also ich finde go hat schon so seine fallstrecke c++ na gut ist also c++ ist ja so das schlechte worum wir uns alle darauf einigen können dass es schlecht ist und alles alles ist besser als c++ sogar kobold ja klar warum nicht du hast mit mehr oder weniger allen halbwegs verbraucht verbreiteten sprachen eine chance muss halt gucken also wenn du jetzt in der region bist wo du bei jeder stellenanzeige siehst wir wollen pap und java haben natürlich ist dann sinnvoller wenn du dir mal pap und java anguckst aber man muss halt auch sagen wenn du eine sprache richtig gut kannst und vielleicht dir schon mal die ein oder anderen zusätzlichen sprachen anguckt hast du kommst in alles relativ schnell rein ich wie gesagt ich habe noch nie großartig java also direkt java jvm sachen habe ich schon programmiert aber ich habe noch nie java programmiert pap habe ich schon mal ein bisschen gemacht aber ich könnte mir das innerhalb von 1 2 wochen soweit angucken dass ich ja ohne probleme an sachen mit programmieren könnte aber ich habe gar keinen bock ich will gar kein java lernen das kommt auf den laden an wo man ist in die whatsapp gruppe natürlich snapchat snapchat wäre mir aber lieber ehrlich gesagt oder oder gleich only fans ja das stimmt die prüfung das siehst du allein schon bei den ihk prüfung dass da nicht großer unterschied ist ja es gibt es gibt teile den die machen teilen die machen aber der größte teil der prüfung ist die gleiche und macht kaum unterschied das würde ich so prinzipiell aussagen es gibt natürlich ausnahmen die die regeln bestätigen sowas wie rust ist halt wirklich massive big brain oder wenn dann einer anfängt mit sowas mit irgendwas funktionalem dann hört es halt erst mal auf so er lang oder oder oder oder noch schlimmer lisp alter wenn man möglichst viele klammern also das hier ich habe eh das gefühl das hier ist irgendwie ein gültiges er lang programm so das stimmt aber du bist aber so solche solche sachen wirst du in jeder sprache mehr oder weniger finden ja quasi strukturen die mehr oder weniger dem abbild im ram entsprechen kannst den rust auch machen und der rust style von so einem struct ist nur wirklich nicht seel ich schaffe es jetzt langsam mal da bin ich mal gespannt was mir bei go was mich bei go nervt ist das go mir sagen will was ich machen soll unused imports unused variable fack mich mega ab manchmal will ich einfach was einbinden ausprobieren mal kurz was auskommen den gucken ob es dann anders funktioniert und jedes mal muss ich den scheiß löschen und umkopieren weil goda meinung ist nein nein nein nein du darfst das jetzt nicht machen weil unused import nein nein das geht jetzt nicht du hast die variabler auskopieren auskommen hier nein unused variable das geht nicht das das nervt mich zu mir wurde mal gesagt was moment mal was zu mir wurde mal gesagt ich rede heute ein bisschen zu zu schnell beim lesen irgendwie zu mir wurde mal gesagt wird anwendungsentwickler denn einem entwickler traut man eher systemer sachen zu als andersrum da kennst du aber die meisten entwickler bei uns nicht den würde ich mal alles zutrauen aber bloß keine system oder netzwerkgeschichten habe ich euch schon von dem ja habe ich euch ich habe euch von dem anwendungsentwickler erzählt der wollte dass ich in den key value store zwei values hinterlege oder für einen key und der ist nicht eingesehen hat dass ich ihm erklärt habe dass es nicht funktioniert ja also für für also für alle die es nicht mitgekriegt haben es hat bei uns jemand angefragt ob ich in einen key value store für ihn ein paar werte also ein paar werte updaten kann oder neue neue neue neue werte reinschreiben kann okay ja klar kein problem was willst du haben und da meint er bei mir so ja er will key a b c und bei jedem müssen dann halt zwei werte rein das ist das ist ein key value store es gibt einen key und ein value dazu das funktioniert so nicht was ich machen kann ist ich kann da eine jason array reinschreiben und du passt dann selbst deine zwei values raus nein das will ich nicht ich will zwei werte zurückbekommen das geht aber nicht du kannst zu einem key nur ein value speichern oder ein text beziehungsweise in dem fall sogar es ist sogar nur text text only also das geht nicht funktioniert nicht ich meine ich kann dir die keys durchnummerieren ich kann dir die keys durchnummerieren a 1 a 2 und dann wird nein ich will zwei werte haben ich habe es dann ich habe es dann irgendwann irgendwann aufgegeben ich habe dann gesagt entweder ich schreibe den jason array rein oder irgendwas oder gar nichts oder csv rein genau alles möglich kannst auch ein jammel reinschreiben oder oder einen oder ein tommel oder ein ini file oder kannst alles so langs text ist reinschreiben kratz easy abschlussprüfung oder hast du auch deine mündliche abschlussprüfung gemacht schon also bist du jetzt komplett durch also hast du quasi bist du seit heute offiziell fachinformatik anwendungsentwicklung oder hast du die mündliche prüfung die die schriftliche prüfung geschafft also was ist richtig big brain ich verstehe was oop ist aber was ist eigentlich funktionale programmierung funktionale programmierung ist für alle matte studenten oder matte professoren die big brain software programmieren wollen ja ist echt der wahnsinn so also machen wir mal weiter wo sind wir stehen geblieben wie funktioniert das jetzt hier mit dem text right factory was so ein geier was muss ich machen dass ich dass ich text ausgeben kann das kann auch nicht so schwierig sein factory irgendwas mit factory wir haben schon hier factories erstellt hier create create factory alles klar mache ich jetzt kann muss ich aber nur einmal erstellen das hier muss ich auch nur einmal erstellen sonst memory leak am start ok ich habe keine ahnung right factory create right nee ach du scheiße right factory ja factory create nee ach du große kacke wie geht das create nee meine güte wie habe ich das denn da oben nochmal gemacht factory ist ja fast wie ein java so so habe ich die eine hier erstellt und wie er ok ok also so so konnte man das eine erstellt und wie geht das jetzt hier create nee factory eins nee ich habe keine ahnung wie das funktioniert ich will einfach text schreiben alter please lass mich doch einfach nur text hinschreiben microsoft ach komm mal hier da so so ah welches programm das hier du meinst die idee das ist rider von das ist die chat brains c-sharp idee was lustig ist dass man java idee hat für c-sharp zu programmieren warum warum nicht ja factory ok bam geht das jetzt was factory type was will er denn von mir haben ok factory type ok einfach einfach so wir probieren es jetzt einfach einfach aus was mich ja auch immer übelst verwirrt bei diesem direct x zeug warum gibt es warum gibt es factory 123 4567 ich meine klar ich weiß die haben mit factory angefangen und irgendwann eine neue funktion hinzugefügt aber das ist so hardcore unübersichtung unübersichtig ist rider visual studio vorzuziehen ist ein bisschen geschmackssache ich verwende rider weil ich hauptsächlich unter linux programmier und da gibt es halt nur rider als idee und der chat hat das letzte mal gemeint nimm doch einfach auch unter windows habe ich weiter auch unter windows ansonsten habe ich unter windows eigentlich immer visual studio verwendet so right factory moment moment das war es ja noch nicht das war es ja nicht jetzt muss ich jetzt muss ich noch anlegen ein textformat anlegen ok create textformat font family name oh nee areal areal da weiß ich auf jeden fall dass es drauf font size 30 dass man das auch ordentlich sieht das ist kein string 30 so textformat was man dafür was man das ja muss ich ja echt ins bein ausreißen dass man hier text ausgeben darf so meint ihr es funktioniert ich jetzt dass jetzt oben links in der ecke test steht ich habe so meine zweifel dass das funktioniert aber wir werden es gleich sehen tatsächlich funktioniert kommt mal da test bäm funktioniert tatsächlich hätte ich nicht gedacht gut weiter dann muss ich diesen ganzen mist hier in der schleife machen und jetzt kann ich die fps ausgeben jetzt kann ich die fps ausgeben das muss übrigens umgedreht sein so achso true string so und jetzt sollte ich die fps da oben drinne stehen haben oh mal da funktioniert aber nicht warum nicht ich glaube ich habe das übelste memory leak ach nee das kann ja nicht funktionieren ich zähle ich zähle hier hoch ich zähle ist ja schwachsinn funktioniert ja so gar nicht was was ich da mache das funktioniert überhaupt nicht das da darf ich quasi nur hier drinne machen aber dann überschreibt es jedes mal oder muss das zwischenspeichern ja nee das ist miss das funktioniert nicht weil ich muss mal kurz checken ob ich nicht irgendwie super hardcore memory leak am start habe ich habe das gefühl irgendwie dass das ziemlich hart memory leak gerade setz mal gucken wir mal kurz in visual studio rein ob das memory leaked nee gar nicht mal so also bisschen memory leak aber wir können auch mal warten bis bis sich das eingependelt hat vielleicht also ich würde sagen ein bisschen memory leak tut es aber mal gucken vielleicht pendelt sich das auch ein nee es scheint nicht memory zu leaken das muss sich einfach warm laufen ok wunderbar ich habe keine memory leaks produziert das ist schon mal nice mach rot das ist eine gute idee wo siehst du den leak prinzip prät naja da neben den ram verbrauch du siehst neben den ram verbrauch und wenn der ram verbrauch hat ich zeigst dir mal moment ich zeigst dir mal ich zeigst dir mal memory leak moment memory leak ach moment dann funktioniert das ja nicht pass mal auf memory leak du wirst direkt sehen dass es memory liegt fällt dir was auf 5 gigabyte ram verbrauch ich meine das ist jetzt ein äußerst offensichtliches ja oftmals sind die dinger deutlich subtiler und man sieht die nicht so nicht so wirklich übrigens auch wieder bester variable namen natürlich hier am start ok wir haben kein memory leak fabriziert das ist doch schon mal nice ok was aber wir sollen den text den text rot machen das mache ich hallo red oh guck mal krass guck mal rider ist echt big brain seht ihr das rider ist richtig big brain er zeigt sogar die farbe unten drunter an welches genau ist welcher ton das ist wirklich cool cool gemacht ok das funktioniert nicht so wie ich mir das gedacht habe ich muss noch irgendwie den counter zwischen zwischen speichern tempe als beste verdammung aller Zeiten wieder am start da weißt du bescheid weißt sofort was sache ist was jetzt temp ist already defined anzeige ist raus pass mal auf tempe 2 guck mal da huge fps counter monospace font da hast du recht areal sagt was ist in monospace font kann man kann man windows überreden dass er monospace macht wenn man das so angibt oder was passiert denn eigentlich wenn ich von family weglasse kack es dann ab dann macht der default du bist der einzige der kanton hat ja solas ist das standard mich installiert jetzt hier guck mal exquisite der kommt mit dem wies und ein bisschen durcheinander ok hier high performance gif player ok also das mit fps funktioniert das ist übrigens ein ziemlich schlechter fps counter das stimmt überhaupt nicht wenn das hier beispielsweise länger braucht eigentlich müsste ich sagen ich ich nehme die anzahl geteilt durch durch die sekunden oder sowas nee nee moment sekunden durch die anzahl anzahl durch sekunden mein ich bin jetzt verwirrt nee anzahl durch durch durch sekunden der macht einen double draus mein wegen wenn der wenn sie lieber ist nee das geht nicht dann ist temp dann wird temp 2 jetzt im double das ist so das ist so wahnsinnig hübscher hübscher code hier gibt es nix best practice komplett alles alles best practice ok meine logik ist nicht richtig meine logik ist auf jeden fall nicht korrekt was mache ich was mache ich verkehrt fps durch gesamte sekunden ah vor restart tatsächlich ja null halt rum ok das funktioniert der zeilen umbruchts nur hier das das funktioniert es ist realistischer alles klar so das ist das ist mega hässlich wie konnte man den kram noch mal runden wobei lull das ist so hässlich dann schadet es nichts wenn es jetzt auch noch ein bisschen hässlicher wird easy life genauer ok wunderbar jetzt haben wir unseren fps counter eigentlich das unsinnigste aller Zeiten zumal das wahrscheinlich an der stelle auch wieder weg muss wie bin er wie sind wir das drauf gekommen das ist eigentlich nicht das was ich machen wollte heute oder wahrscheinlich nicht also wie sind ausgeschaltet und fps counter super dass das hat die welt das hat die welt gebraucht vielleicht sollten wir mal anfangen das ordentlich zu machen sonst blickt doch da echt keine sauma durch mal kurz runter auf 60 fps ob das funktioniert achso auf 30 werde mit warum auf 30 16 millisekunden sind eigentlich 60 fps ok ich ich ich ich ich kucke nicht wie lange der kram hier oben dauert aber der kann er nicht so lange dauern sind sind der restliche kot ich kann mir nicht vorstellen dass er 16 millisekunden verballert das das dann können wir dann würde der nicht rennen dann mit 1000 fps sonst es ist doch 60 fps 16 millisekunden oder ja und 60 millisekunden sind dann 16 fps ne das das funktioniert halbwegs ok das das was ich hier was ich hier mache funktioniert so nicht warum muss ich das doppelt so schnell machen dass es das schafft die stopwatch zählt nicht wenn der thread sleep das ist eine wirklich gute frage ich habe keine ahnung wenn ich ehrlich bin zählt die stopwatch nicht wenn der thread sleep das würde es zumindest teilweise erklären ja ich weiß nicht warum das hier nicht funktioniert aber macht macht auch kein unterschied weil eigentlich müssen wir das eh jetzt aufräumen stack overflow wieder am start stack overflow aus der overflow am start aha alles klar macht es nicht tagsdelay könnte ich genauso gut verwenden das ist mega hässlich das lasse ich eh nicht so das müssen wir jetzt langsam mal anfangen ordentlich zu machen weiß nicht ob ich da heute die brain kapazität dafür habe das ordentlich zu machen also lassen wir überlegen wir haben ein fps counter ist schon mal wunderbar du hast recht hier eigentlich eigentlich ist das bescheuert eigentlich müsste ich hier die stopwatch hier müsste ich die stopwatch machen und jetzt mal gucken wie lang der wie lang der durchlauf braucht und das dann abziehen von dem was ich liebe wie lang braucht denn das ganze hier so ein schleifen durchlauf wie da brauchen das braucht es denn so das wird nicht lange sein sind das drei millisekunden ne ach du scheiße das ist das lautet was 30 warum dauert das denn so lang 30 das kann doch gar nicht sein ach so ah hier restart null ah das sieht schon besser aus die bagge das ist eine gute idee wobei ich nicht glaube dass das einen großen unterschied machen wird was control f5 war ein bisschen wo ist da meine mein denkfehler mit dem sleep kann das sein dass das lieb einfach nicht genau doch das müsste genau genug sein ok ich habe keine ahnung woran das liegt aber drei millisekunden sind trotzdem ganz schön lang ich meine die code den kram sleep hier noch irgendwo anders ich habe keine ahnung ich glaube meine fps berechnung stimmt nicht ich glaube meine fps berechnung ist einfach trash es fack aber eigentlich will ich mich damit jetzt gar nicht aufhalten denn das bleibt eh nicht so sondern wir müssen das jetzt mal langsam anfangen ein bisschen ordentlich zu machen ich blicke nicht mehr durch könntest du das encode nicht machen während du das decoden ich encode nix ich könnte das multithreaded machen aber ich glaube nicht dass es ein riesen irgendwie riesen auswirkung hat weil das direkt x zeug ist so schnell gemalt ob ich da vom multithreading groß profitiere keine ahnung so wir müssen jetzt leute wir müssen es jetzt mal ein bisschen bisschen bisschen schöner machen ich muss mal kurz in mich gehen ob ich da heute abend noch genug brain für hab oder nicht wir müssen eigentlich auch noch auch noch auch noch einschneiden dass man das resizing kann multithreaded render target das wäre in dem fall kein problem weil ich nach wie vor nur aus einem thread machen würde also ich würde ich würde dass er nur noch nur in einem spread render aber ich würde halt das bild halt ab und zu mal updaten was gerendert wird das bringt das bringt glaube ich nix so also wir müssen das jetzt irgendwie ein bisschen ordentlich machen ich bin gerade am überlegen ob ich das heute big brain technisch mache oder nicht aber warum brauche ich denn drei ich mein drei millisekunden ist ganz schön lang ein drei millisekunden ist viel was braucht denn hier die drei millisekunden zeigt mal her ich mache das gerade mal wieder rein was braucht denn hier eigentlich die drei millisekunden das liegt nicht da dran das liegt daran was verbraucht denn hier eigentlich die drei millisekunden das die code vom gif ja das die code vom gif der task läuft ja permanent das macht nix dass die code vom gif braucht drei millisekunden aber warum warum braucht das die code vom gif drei millisekunden ich meine es ist ziemlich ziemlich bescheuert wie ich es mache ich lese das von ich lese frame frame by frame von der platte die code das dann das ist das eigentliche problem dass die code ist ich könnte wetten dass die code ist nicht das problem sondern das einlesen von der platte ist das problem es ist ernsthaft dass die code was drei millisekunden braucht das hätte ich im leben nicht gedacht dass man drei millisekunden braucht um den um den gif frame zu decoden krass da kann ich aber da nicht viel dran ändern also das hier ist wirklich das was die zeit frisst gif decoden ja gut das machst du nix dann ist das halt so da kann ich da kann ich nix dran ändern alter meine variable benahmung es ist so schlecht es ist so hässlich das darfst du keinem zeigen das werde ich definitiv nicht auf shithub posten dafür musst du dich erschämen gif in den ram laden doch doch geht aber bringt nix ffmpeg overhead warum sollte ffmpeg overhead sein du brauchst irgendwas was dein gif decode in dem fall ist es halt ffmpeg also ich würde jetzt eine notwendige komponente nicht unbedingt overhead nehmen nennen es wird jedes bild immer wieder neu decoded ja aber das macht also dass die code ist wirklich das problem klar ich könnte mir das gif einmal merken aber das ist egal das macht jetzt nix das drei millisekunden sind nicht wild aber aber ich hätte nicht gedacht dass das decoden eines einzelnen low res gif bildes drei millisekunden braucht naja gut ist dann halt so immer noch immer noch besser immer noch schneller als das hier guckt euch das mal immer noch schneller als das hier hab das gesehen das ist ein lahm ffack das sind drei sekunden nicht drei millisekunden probier es mal mit dem gif mache ich ich kann das doch einfach dann ist es einfacher für mich kann das hier kann das hier oben resetten so dauert wirklich es dauert wirklich drei sekunden äh drei millisekunden äh wo habe ich denn dieses gif hier um das dann mal auszuprobieren mit sack wo liegt denn das champing wo liegt das champing gif weiß ich doch jetzt nicht wo könnte memes zwei vielleicht ne moment wo liegt wo liegt dann dieses komische programm die sagen wo web application elf wo liegt die denn hier hier web application elf web application elf alles klar bbb root content da ist es so sieht jemand sieht jemand ist es das das ist es das wollen wir haben gif gif mal gucken wie lang das braucht beste namen das ist absicht dass sie nicht kollidieren ne naja ok das ist das ist ein ticken langsamer noch aber trotzdem warum ist das überhaupt zu langsam vier sekunden zum zikauen von dem gif ja das ist halt high res high res high iq gif auch halt ein bisschen aber das red sleep ist in dem fall egal ich meine ich ich mache ich mache thread sleep mal weg aber ich resette die stopwatch ja oben das sollte überhaupt keinen unterschied machen da wird sie ja schlecht bei champ ist tatsächlich schneller warum warum ist das schneller das macht doch überhaupt keinen sinn ich restarte das hier oben und da ist es null das ist doch egal ob ich da unten sleep oder nicht ich sleep jetzt mal keine 800 ich blick nicht mehr durch was hat das warum hat das überhaupt ein fluster drauf was habe ich habe irgendwo was total bescheuert das programmiert das kann überhaupt nicht sein stopwatch soll hier wird die restartet denn ich nenne die magischheit hier wird die restartet und hier wird die zeit ausgegeben ich war mal ein stopp vorher bin ich bin hochgradig verwirrt was das da mit dem rest zu tun haben soll äußerst äußerst verwirrt was das eine mit dem anderen zu tun haben soll restart und ausgeben da hat doch da hat auch in den strand sleep und nichts mit zu tun und selbst wenn jetzt kontext switching bla was auch immer ich meine ich mache es ja hier in diesem schleifen durchlauf ach keine ahnung dass wir jetzt zu big brain ich glaube wir scheißen einfach optimierung auf die optimierung hier in diesem ding ich mache das dann mal ordentlich dann kann man nämlich auch verstehen was was ich da programmiert habe das ist aber nicht sehr clean ne das ist das ist die neue das ist der neue trend nach clean code kommt trash code weil die leute erkannt haben clean code dauert zu lang und es ist wichtig dass man prototypen möglichst schnell abliefert das heißt ab jetzt werde ich auf jedem talk auf jeder konferenz wo ich hingehe und meine talks halte werde ich trash code propagieren so machen wir das demnächst könnt ihr demnächst könnt ihr tickets gewinnen im stream das genie beherrscht das sage ich auch immer genauso wie mein desktop leute sagen immer das ist unaufräumt blickt keiner durch aber in wirklichkeit muss man einfach nur suchen können und wissen wo was ist dann findet man auch alles sofort also ich würde sagen es ist auf jeden fall best practice mein code gerade vor allem mit sicherheit auch direkt direkt x best practice es best praktiziert ohne ende hier komplettes komplettes best practice aus dem eitel buch einer hat mit dem anderen überhaupt gar nichts zu tun aber egal safe ist das safe safe und wie heißt dieses andere agile zeug ach ich habe schon wieder vergessen was auch gerade voll im trend ist safe und ach ich kann mir das alles nicht merken blockchain nein nein nein nein du kannst blockchain bei fast allem sagen aber da passt nicht nein nein safe safe agile was ich meine ist das hier scaled agile framework so wie heißt wie heißt die konkurrenz zu safe auch gerade total angesagt aber ich will mich mit diesem kram gar nicht beschäftigen hier okay gibt es nicht was sinnvolles was wir noch machen können ich muss mal ein bisschen mein hirn mein hirn zusammenhalten gerade wir haben ja heute im prinzip nichts gemacht außer den hässlichen fps counter eingebaut der skiff ist viel zu langsam 400 fps das ist doch nix da geht mehr ich muss das doch multithreaded machen glaube ich ich glaube wir müssen das doch wir müssen das doch in zukunft multithreaded machen wir müssen das doch multithreaded machen aber schneller die code wird dadurch auch nicht aber schneller die code wird dadurch auch nicht also das bringt eigentlich gar nichts also das die code ist einfach zu langsam aber da kann ich nichts dran ändern das ist halt ffmpeg vielleicht geht das einfach nicht schneller ich wette mit euch in einem anderen gift decoder ist das auch nicht schneller außerdem will ich keinen anderen gift decoder verwenden weil ich will damit ja vielleicht auch andere video formate decoden als statt nur gif nutzt direkt opengl das ein oder mit dem anderen gar nichts zu tun das rendern ist nicht das langsame das gift decoden ist das langsame das rendern braucht keine ahnung bananosekunden oder so so aber ich glaube ich sollte anfangen das mal ein bisschen ordentlicher zu machen weil ich blicke ich blicke nicht mal durch ich würde sagen proof of concept ist es es es wirkt es funktioniert aber jetzt jetzt ist vorbei so wir machen eine neue wir machen eine form für den player wir brauchen ein video decoder klasse brauchen wir dann habe ich irgendwo schon was für meine lgb video frames angelegt gehabt video frame frame oder habe ich da habe ich überhaupt eine klasse für wo rennt ich blicke nicht mal durch leute es ist einfach vorbei es ist komplett komplett grip frame frame hier data ach nee ich schreibe das data direkt ja das ist ein bisschen das ist äußerst äußerst eklig ok wir brauchen auch eine eigene klasse für den video video frame lgb zeug aber kurz lass mal kurz in mich gehen wie könnte man das gut kapseln die die so eine so einen einen decoder das gif also auf jeden fall uns safe weil ffm pack anders funktioniert es nicht so wir brauchen alter ich kann nicht schreiben leute es vorbei ich glaube ich sollte aufhören für alles ich kann immer schreiben wir brauchen hier würde ich sagen einen war ffm pack frame wo wir dann zeug mitmachen so also was was müssen wir von so einem von so einem video frame also von so einem decodeten gif von einem einzelnen decoden bild aus der gif animation wissen wir müssen wissen wie breit das ganze ist also irgendwie breit breite brauchen wir wir brauchen irgendwie höhe so dann brauchen wir noch was was gibt es denn da sonst noch moin john hat eine dvd poc wir brauchen data brauchen wir data und was was benutzen wir sonst noch vom frame line size ok das nennen wir einfach so was ist das ein int oder was ist line size int öffnende klammer haben keine eigene zeile verdient doch sonst ist das viel zu eklig leute line size oder line size line size so ok was brauchen so ein frame noch data data ist nen was nen int pointer glaube ich data byte byte pointer hier aber so was data best practice genau chat was ist los was ist los warum warum alles so so setke warum nicht white happy warum white setke was ist was was was stimmt hier nicht wegen der klammer ne das ist doch nicht setke das ist genau umgedreht setke ist es wenn man die klammer auf die eigene zeile macht so ist es eigentlich ziemlich poggers ok wollen wir eine umfrage machen wir machen eine umfrage mal gucken ob ich das hier auf die reihe krieg nebenbei frage klammer auf gleicher zeile vom if oder auf gleicher zeile wir machen es anders klammer auf gleicher zeile auf zeile runter so dauer umfrage eine minute bam einfach peißen programmieren ja easy so also jetzt bin ich mal gespannt also ich bin ich bin eindeutig für zeile drunter aber jeder wie er will wenn der neue die klammer in der gleichen zeile macht so sieht es aus anzahle ich direkt die abmahnung mitgeschickt korrekt aber es kann jeder machen was er will er chat ist es wieder nicht einig funktion zeile drunter if selbe zeile ich sehe es gibt auch leute die kombination aus beidem verwenden ich mache eigentlich immer zeile drunter ich finde man sollte auch ein bisschen danach gucken was der hersteller guide ist für die jeweilige sprache in c sharp ist es auf jeden fall zeile drunter es gibt aber andere sprachen wie go da ist es richtig hässlich und ist immer gleiche zeile es ist aber ziemlich 50 50 also kaum kaum den unterschied dazwischen so jetzt ist die nächste umfrage die wir machen könnten ist eigentlich gleich noch variable namen paskal case camel case kebab case wisst ihr kebab kebab case ist das beste oder kebab case snake case paskal case binnen majuskel mein ich falls ihr das mehr sagt alles klar was was zum geile lädt das bitteschön da was ist das überhaupt für was ist das überhaupt für eine seite c 2 punkt kommen was sagt der typ da eigentlich der sagt jesus sagt er jesus sagt er jetzt das soll jesus heißen das versteht bloß kein mensch das versteht noch nicht mal spanier der sagt aber nicht jesus weil jesus sondern weil der moderator aus der sendung jesus heißt als jemand mal das original gesehen hat jesus leute ich kann nicht mal denken das war das war keine gute idee dass ich pick brain programming stream machen wollte heute abend ich kann ich kann nicht mehr denken heute ist vorbei es ist wir müssen wir müssen es vertagen mein brain macht heute nicht nicht mehr mit wir gucken jetzt noch jetzt noch barbecue pit boys ich würde sagen wir gucken als erstes und zwar das video an vom meister höchstpersönlich how to protect your linux server from hackers from hackermans ich gebe natürlich mein zemp zu ob ich die sachen auch so sehe oder nicht aber mal gucken was er sagt so mal kurz musik ausmachen kann man sich drüber kann man kann sich über alles streiten ehrlich gesagt auch diese sache mit keinen root user benutzen und sowas ist schon sinnvoll aber ob man das jetzt so als als generelle regel sagen sollte ja wüsste ich jetzt auch nicht ssh port wechseln mache ich tatsächlich so gut wie nie 6th Besonders in IT-Security ist es eine große rote Flasche. Wahrscheinlich verstehen sie es nicht selbst und sie sollten skeptisch sein. Ich denke, die Leute kopieren sich von einem anderen, weil eine Person einmal gesagt hat, dass es die beste Praxis ist. Oder das schlimmste Negativbeispiel, was mir dazu einfällt, ist, ich habe mal vor ein paar Jahren von einem Oberruby-Programmierer-Guru mal einen Talk von einer Konferenz gesehen und ich glaube, ich habe das schon mal erzählt. Und er hat allen Ernstes, da hat er erzählt, ja hier, das ist ein Codesmell und das ist ein Codesmell, das war so sein Lieblingswort und dann hat er allen Ernstes behauptet, dass jede Rubymethode, die länger ist als eine Zeile, ein Codesmell ist. Und da habe ich mir auch gedacht, Alter, jetzt drehen sie echt am Rat. Wie sieht denn das bei dem aus? Hat der dann irgendwie 9000 Nesting-Levels oder was? Mehr als eine Zeile ist plaud oder was? Was ist das erste Kommentar? Was ist denn das da? Den gucke ich auch ab und zu mal, wenn es irgendwas interessantes gibt. Solche Ruby-Meinungen kenne ich in realen auch. Ja, Ruby-Leute sind da teilweise, wie gesagt, neben C-Sharp ist Ruby meine absolute Lieblingssprache, leider in letzter Zeit ein bisschen so unter die Räder gekommen. Aber da wird vieles, also gerade im Ruby-Umfeld wird vieles so voll religiös gebetet schon, wie man was programmieren muss. Dabei ist Ruby eine Sprache, die lässt so mehr oder weniger fast alles zu. Was ist der zweite Kommentar? Better Advice. Turn your screen brightness way down. Alter, Hacker haben immer Sonnenbrillen auf und dann haben sie es schwierig, den Bildschirm zu lesen. Ja, so sieht es aus. Das wissen wir natürlich und die haben auch immer Matrix-Bildschirm schon erlaufen, immer. Wenn ihr mal jemanden seht, der sagt, er ist Hacker und hat keinen Matrix-Bildschirm schon erlaufen, dann wisst ihr gleich, er erzählt Mist. C-Matrix-Best, ja. Wo wir gerade dabei sind, ich muss mal kurz meine VM anmachen. Wir machen die Qt-VM an. Qt-VM, die kriegt zu wenig Aufmerksamkeit in letzter Zeit. So, beste und jetzt C-Matrix. So, jetzt endlich haben wir den Hacker-Modus gestartet. Jetzt ist alles gut. Jetzt kann nix mehr schiefgehen. Ah, yes. Gut, okay, weiter, next. Jetzt kann ich die Qt-VM wieder ausmachen und die ordentliche VM einschalten. Hacker haben überall Dark Mode. Das stimmt wahrscheinlich zum größten Teil wirklich. Kein Coding Stream, doch. Da, hier, guck. Big Brain Time. Aber ich muss mich gerade ein bisschen ausruhen. Ich kann nicht mal richtig nachdenken heute. Moment, deine Qt-VM. Ach, sieht ja aus wie 1995. Einfach die, danach, wenn man das gesucht hat, also wenn man das gesucht hat, ja, das Beste ist, wenn man dann einfach die drei Zeilen von Stack Overflow direkt als Route ins Terminal pastet. So muss das eigentlich machen. Nee, nicht Stack Overflow, Stack Exchange. Und auch ganz wichtig, auch ganz wichtig, zum Sachen installieren, immer, immer schön das GitHub-Installer-Skript curl nach Bash-Preipen als Route, versteht sich. Ah, Ubuntu. Oh, ich muss demnächst Hetzer-Sellout machen, fällt mir ein. Das muss ich mir da abgucken. So macht man's, so macht man's. Ja. Wo sieht's aus? Ja. Achso, ich dachte Route Login. Ja, ich muss ehrlich sagen, das mache ich auch, aber aus zwei Gründen. Mal gucken, was er da dazu sagt. BrooklynX, Dankeschön für den Prime-Sub. Aus zwei Gründen. Es ist einfach viel angenehmer mit Keys, weil du kein Passwort mehr eingeben musst. Und wenn du dein Key verteilt hast, dann brauchst du das Passwort auch nicht mehr und kannst es ausschalten. Das finde ich ist eine sinnvolle Geschichte. Oh, jetzt ist es BigBrain. Jetzt wird's massiv. Ja, klar. Wenn einer dein Key geklaut hat, ist vorbei mit Key-Authentifizierung. Das stimmt schon. Ich vermute mal, was er sagen will ist, wenn dein Zertifikat geklaut hat, kann er sich einloggen. Dein Passwort, wenn du es nur in deinem Kopf hast, kannst du nicht so einfach klauen. Ist schon was wahres dran. Aber man kann übrigens beides in Kombination verwenden. Du kannst einfach einen Key haben, der einen Passwort braucht, dass du ihn verwenden kannst. Ja, radeleicht. Aigude, du Lübbel. Das ist jemand aus Hessen am Start. Deswegen schreibt man ja auch seine Standard-SSH-Options, dass es nicht immer nervt, dass die gleich, dass sich der Key geändert hat. Ich muss ehrlich sagen, da bin ich auch schuldig. Also ich hab schon so oft einfach gesagt, Scheiß drauf, Key hat sich geändert, wird nichts Schlimmes sein. Passt schon. Das ist ein anderes Protokoll von SSH, aber der Ergebnis ist sehr ähnlich. Wenn du auf YouTube loggierst, Anzeige ist raus. Direkt. Aigude, das gleiche Beispiel wäre, wenn der Webserver auf der anderen Seite gehackerment wurde und der alle Passwörter mitloggt, oder alle Loggins, oder was auch immer. Deswegen sagt man ja normalerweise, hey, du verschickst überhaupt kein Passwort, sondern du verschickst eigentlich nur den Passwort-Hash. Genau, genau meine Meinung. Ich mach das auch mit Keys, hauptsächlich weil es easy ist und du nicht laufend Passwörter eintippen musst. Das ist der gleiche Punkt über mir. Ja, mach ich aber auch selten. Muss ich ehrlich sagen. Das stimmt. Ja, du willst ja root werden. Genau, und wenn du auf den Server gehst, das erste was du machst ist e-sudo. Immer. Also ich könnte mir eigentlich sudo-e schon in irgendein Login-Skript hemmern, weil das das erste ist was ich mache. Ich mach als mein normaler User auf einem Server so gut wie nie was. 99% der Zeit bin ich root und das erste was ich mache ist sudo-e. Also ich dachte immer, gerade SuperTuxCard dachte ich läuft besser, wenn man das als root ausführt. Für jemand der keine Ahnung hat, was ist sudo? Sudo ist ein Programm, wo du mit deinem normalen User Admin-User wirst. Also im Prinzip das gleiche, wie wenn du unter Windows sagst, ausführen als Admin. Nur, dass du das unter Linux auf der Konsole machst. Ja, wobei man da sagen muss, ich könnte mir vorstellen, das bringt da gleich noch als Beispiel. Sudo hatte die letzten Jahre über, ich kann mich an eine riesen Sicherheitslücke vor nicht allzu langer Zeit erinnern. Und ich bilde mir ein, es waren sogar zwei ziemlich große sudo-sicherheitslücken in letzter Zeit, aber an eine kann ich mich noch erinnern, weil die war easy as fuck auszunutzen. Du musstest glaube ich einfach nur, ich weiß gar nicht ob ich das auch richtig zusammengehe, irgendwelche Parameter musstest du angeben. Ich glaube du musstest einen Link machen, oder? Und das irgendwie als Parameter anhängen. Es war zumindest total easy sudo auszutricksen. Das erste was du machst ist eh sudo-e. Ähnliches übrigens auch wenn du den User in die Docker-Gruppe steckst. Also, kannste ihm auch gleich Ruhtzugriff geben. Also, manche sagen, aber sudo braucht ein Passwort, und wenn ein Attacker der User ist, wissen sie es nicht, also kann es Ruhtzugriff geben. Aber es gibt viele Wege um das zu machen. Die schnellste und einfachste, die ich mitgekommen habe, ist, einfach den Bash-RC zu verändern, um einen Entritt für sudo zu geben, wo du einen malicious-Kommand exekutierst, den der Program-ID bestätigt hat, jedes Mal, wenn der User sudo benutzen möchte. Die nächste Zeit, wenn der echte User in loggt und etwas mit sudo möchte, werden sie nicht realisieren, dass sie einfach einen malicious-Kommand exekutiert haben. Hier wiederum, um den User die exekutierte ID zu visualisieren, ohne sie zu wollen. Jetzt, sudo kann auch noch mit ein bisschen Auditing helfen, was auf dem System passiert ist, durch Logging. Es ist auch einfacher, den Sudo-Grupp einfach zu geben oder zu entfernen. Das stimmt. Also wir machen es bei uns eh mit Zertifikat-basiertem Login. Also sprich, ich muss weder Passwort eingeben noch meine Keys verteilen. Ich generiere mir den SSH-Key, der wird gesigned und dann kann ich mich einloggen. Ja, da bin ich der Meinung, kann ich mal gucken, was er dazu sagt, da bin ich der Meinung, das ist prinzipiell schon nicht unsinnig. Also ich glaube, das bringt was, aber ich bin da oftmals zu faul für, zumal ich auch keinen Bock hab, dann immer dran zu denken, welcher Server, welcher Port und sonst was. Und so ein Portscan dauert ja nicht lang. Also, ja das stimmt. Ja, da ist schon was dran. Also warum ich denke, dass es was bringen könnte, ist, dass du die ganzen Standard, wir scannen das halbe Internet durch, erstmal, naja gut, wenn die kompletten Portscans machen, hast du eh gelitten, dass du die erstmal nicht direkt bei dir auf dem Port drauf hast. Das stimmt. Genau, genau. Und das, was im Chat gerade steht, du hast dann erstmal keine 5000 fehlgeschlagenen Logins aus Russland und Schila. Das stimmt. Ja, da hat er schon recht. Also wenn du ein scheiß Passwort hast, oder irgendwas anderes verkackt hast, dann wird es dich nicht retten, dass du es auf dem anderen Port hast. Ok, das kenn ich nicht. Die, das hab ich noch nie gehört. Was? Ok, das gibt wirklich keinen Sinn. Ja, das stimmt. Aber dass ein eingeschaltetes IPv6 in irgendeiner Art und Weise, ein ausgeschaltetes IPv6 in irgendeiner Art und Weise das besser macht oder eben umgedreht ein angeschaltetes angreifbarer macht. Also da hab ich auch meine Zweifel. Ja, das stimmt. Da hat er voll und ganz recht. Ich denk mir bei solchen Sachen aber immer, hey. An so weniger Sachen du denken musst, umso besser. Also wenn du, wenn man sich angewöhnt, keine Ahnung, nach jeder Ubuntu Installation machst du erstmal UFW an, dann ist das sicherlich nicht verkehrt. Also wisst ihr, wie ich mein, wenn du, wenn du einfach dafür sorgst, dass du an anderen Stellen dich auch mal vertun kannst und nicht gleich alles kaputt ist. Weil sonst könntest du ja hinten wieder sagen, ok, du kannst generell auf alles verzichten, wenn deine Firewall richtig eingestellt ist. Natürlich hat er recht. Das eigentliche Problem ist, dass deine Firewall davorkacke eingestellt ist. Aber wie gesagt, wenn es danach geht, kannst du ja alles andere sparen. Also nach dem Motto, wie ich hab 500 offene Ports drauf, brauch ich ja nicht, weil ich, brauch ich ja nicht nix zu machen, nix irgendwie gucken, was da alles, ich hab ja eine Firewall davorstehen. Also ja, das stimmt schon. Ich finde, vorzubeugen, dass man mal selbst kacke baut, ist auch nicht so verkehrt. Ja, das stimmt, da hat er recht. Also ich mein, wenn, also meine Firewall macht genau das gleiche, wenn man die richtig eingestellt hat. Der Vorteil von NAT ist halt, dass die vollmäßig nichts durchkommt. Du kannst bei NAT nichts falsch konfigurieren. Das ist, ohne zusätzliche Einstellung ist es halt erst mal einfach dicht. Das ist zwar keine, das stimmt, das ist keine Firewall, aber es hat im Prinzip den gleichen Effekt. Wenn du IPv6 nimmst und was sagst du hier, default deny und only allow das und das, hat es den gleichen Effekt, wie wenn du NAT hast und einfach Port-Weiterleitung machst für die zwei Dienste, die du brauchst. Also standardmäßig zu und du musst die Sachen erlauben, die du weiterleiten willst. Ja, es ist was komplett anderes und es ist auch nie als Firewall gedacht gewesen, aber der Effekt von außen ist der gleiche. Das stimmt, im Internet ist es egal. Ja, das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal. Das stimmt, im Internet ist es egal.", "segments": [{"id": 1, "start": 0.0, "end": 7.0, "text": "Das war's für heute und wir sehen uns beim nächsten Mal wieder, tschüss, tschüss, tschüss, tschüss."}, {"id": 2, "start": 31.0, "end": 34.0, "text": "Aiaia! Aiaia!"}, {"id": 3, "start": 34.0, "end": 61.0, "text": "Aiaia! Aiaia!"}, {"id": 4, "start": 64.0, "end": 75.0, "text": "So, auf geht's!"}, {"id": 5, "start": 75.0, "end": 94.0, "text": "St. Porgeres, Leute!"}, {"id": 6, "start": 94.0, "end": 120.0, "text": "Leute, was gibt's heute? Das, was im Titel steht. Heute stemmt der Titel tatsächlich mit dem Inhalt überein."}, {"id": 7, "start": 120.0, "end": 132.0, "text": "So sieht's aus."}, {"id": 8, "start": 132.0, "end": 145.0, "text": "Muss mal kurz was trinken."}, {"id": 9, "start": 145.0, "end": 154.0, "text": "Aiaia! Aiaia!"}, {"id": 10, "start": 154.0, "end": 180.0, "text": "Huge Sub. Die Online-Werbung? Tja, manchmal kommt man nicht drumherum. Aber wisst ihr was? Ich halte die Telekom immer noch für den besten Provider, den wir haben."}, {"id": 11, "start": 180.0, "end": 191.0, "text": "Leider hat's die Telekom, also Qualitätstechnisch, leider hat's die Telekom die letzten Jahre über komplett, oder nicht nur die Telekom,"}, {"id": 12, "start": 191.0, "end": 202.0, "text": "generell die Kupferleitungs-Telefon-Geschichten, ja gut, da gibt's außer der Telekom ehrlich gesagt nicht viel, die haben's einfach verkackt auszubauen."}, {"id": 13, "start": 202.0, "end": 213.0, "text": "Unabhängig davon, an wem's jetzt liegt, auf wem man das jetzt schieben mag, dass es zu wenig Geld gibt, dass es Stau bei den Auszahlen von den Geldern gibt, dass es Stau gibt beim Ausbau,"}, {"id": 14, "start": 213.0, "end": 224.0, "text": "unabhängig davon stehen die Kabelanbieter tatsächlich besser da als die Telekom, aber auch die Kabelanbieter müssen gucken, was sie mit ihrem Netz machen,"}, {"id": 15, "start": 224.0, "end": 233.0, "text": "weil ewig können die da auch nicht mehr mit rumwursten. Telekom hat halt voll die Arschkarte."}, {"id": 16, "start": 233.0, "end": 240.0, "text": "Überlegt euch mal, VDSL, was ist das schnellste VDSL, was es aktuell gibt? 250?"}, {"id": 17, "start": 240.0, "end": 252.0, "text": "Das stinkt halt schon gegen die theoretische Gigabit-Geschwindigkeit von Kabel ab, wobei Kabel ist halt auch Gigabit nur eine theoretische Geschichte."}, {"id": 18, "start": 252.0, "end": 257.0, "text": "Wenn du Glück hast, geht's, wenn du Pech hast, geht's nicht."}, {"id": 19, "start": 257.0, "end": 268.0, "text": "Ja, ich glaub, 250. Und der Witz ist halt, dass 250... Nee, das nimmt sich... Ping-mäßig nimmt sich das jetzt nicht allzu viel."}, {"id": 20, "start": 268.0, "end": 278.0, "text": "Das Problem ist jetzt halt, 250 sieht okay aus im Jahr 2021. Das Problem ist aber, dass nichts schnelleres mehr in Aussicht ist."}, {"id": 21, "start": 278.0, "end": 285.0, "text": "Also 250 sieht in Ordnung aus aktuell, aber es ist jetzt schon auf dem, sagen wir mal, auf den etwas..."}, {"id": 22, "start": 285.0, "end": 292.0, "text": "Ja, auf der langsameren Hälfte, wenn man das mal mit anderen Ländern auch vergleicht."}, {"id": 23, "start": 292.0, "end": 300.0, "text": "Das ist auf der etwas langsameren Hälfte, ja. Aber es ist okay im Jahr 2021, aber wenn man jetzt überlegt, da ist jetzt vorbei."}, {"id": 24, "start": 300.0, "end": 305.0, "text": "Ich weiß nicht, hat jemand von euch einen Durchblick? Ich hab das jetzt schon eine Weile nicht mehr verfolgt."}, {"id": 25, "start": 305.0, "end": 310.0, "text": "Wie sieht das aus mit Ausbau? Gibt es, gibt es demnächst ein super, super Vectoring?"}, {"id": 26, "start": 310.0, "end": 317.0, "text": "Oder ist jetzt mit 250 wirklich endgültig, endgültig vorbei? Also für mich sieht es so aus, als wäre es endgültig vorbei."}, {"id": 27, "start": 317.0, "end": 324.0, "text": "Vielleicht ganz, ganz krasse Ausnahmefälle mit irgendwelchen Geschichten."}, {"id": 28, "start": 324.0, "end": 332.0, "text": "Ich wohne gegenüber vom, vom Endpunkt oder so, aber ansonsten..."}, {"id": 29, "start": 332.0, "end": 346.0, "text": "Was ist denn? Ist das nicht Glasfaser?"}, {"id": 30, "start": 346.0, "end": 356.0, "text": "Das denke ich mir auch schon seit einer ganzen Weile, ja. Tatsächlich. Ich verstehe es auch nicht so genau, wo das Problem ist."}, {"id": 31, "start": 356.0, "end": 366.0, "text": "Geld, also ich weiß nicht ehrlich gesagt, woran es genau hängt, aber Geld scheint ja da zu sein, aber man bekommt das organisatorisch nicht hin."}, {"id": 32, "start": 366.0, "end": 378.0, "text": "Ich glaube, vielleicht wäre der bessere Ansatz zu sagen, hey, ihr bekommt nur Geld, also wir bezahlen euch quasi dafür, wenn es denn wirklich da ist."}, {"id": 33, "start": 378.0, "end": 386.0, "text": "So quasi, wir bezahlen euch tatsächlich für das Anschließen von Haushalten, egal ob das jetzt irgendwelche Bauernhöfe oder sonst was sind."}, {"id": 34, "start": 386.0, "end": 389.0, "text": "Im Prinzip so, wie man es mit den Impfzentren gemacht hat."}, {"id": 35, "start": 389.0, "end": 393.0, "text": "Überlegt euch mal die Impf-, äh nicht die Impfzentren, meine ich die, die Testzentren."}, {"id": 36, "start": 393.0, "end": 399.0, "text": "Mit den Testzentren hat man das doch auch hingekriegt. Man hat gesagt, ey, mach Testzentrum hin, ihr kriegt Geld dafür."}, {"id": 37, "start": 399.0, "end": 405.0, "text": "Bam, an jeder Scheißecke ist ein Testzentrum. Ich hab letztens ohne Scheiß, Leute. Kein Spaß."}, {"id": 38, "start": 405.0, "end": 410.0, "text": "Ich hab einen Dönerladen gesehen mit einem Test-, äh mit einem Zelt und einem Testzentrum davor."}, {"id": 39, "start": 410.0, "end": 413.0, "text": "Ein Dönerladen."}, {"id": 40, "start": 413.0, "end": 420.0, "text": "Da war Kebap und davor stand ein Zelt mit Testzentrum."}, {"id": 41, "start": 420.0, "end": 427.0, "text": "So einfach kann das funktionieren. Kannst du während deiner Testergebnis waren das ganze Dönerfutter an."}, {"id": 42, "start": 427.0, "end": 431.0, "text": "Wobei ja, ein Testergebnis geht ja schnell, aber."}, {"id": 43, "start": 431.0, "end": 436.0, "text": "Ja, kann mal einer kurz erklären, was Supervektoren ist. Also die technische, ich kann dir erklären, was es ist,"}, {"id": 44, "start": 436.0, "end": 439.0, "text": "aber die technische Seite habe ich mich nie so genau damit beschäftigt."}, {"id": 45, "start": 439.0, "end": 445.0, "text": "Es ist eine Technik, wie du über die Oldschool-Kupferleitung, da wo früher Telefon drüber ging,"}, {"id": 46, "start": 445.0, "end": 451.0, "text": "wie du dort noch ein bisschen mehr Bandbreite rausholen kannst für Internetanschlüsse."}, {"id": 47, "start": 451.0, "end": 455.0, "text": "Also generell Bandbreite für Datenübertrag, muss ja nicht Internet sein. Bandbreite für Datenübertrag."}, {"id": 48, "start": 455.0, "end": 466.0, "text": "Also das ist im Prinzip die Weiter-, Weiter-, der Weiterentwicklung von DSL."}, {"id": 49, "start": 466.0, "end": 469.0, "text": "Hat halt den Nachteil, geht nur über relativ kurze Strecken."}, {"id": 50, "start": 469.0, "end": 476.0, "text": "Ich weiß jemand von euch aus dem Kopf, was maximale Länge ist Supervectoring, dass das geht mit 250."}, {"id": 51, "start": 476.0, "end": 480.0, "text": "Das kann nicht lang sein Kilometer, wenn es hochkommt, oder?"}, {"id": 52, "start": 480.0, "end": 490.0, "text": "Wenn es hochkommt, eher weniger. 400 Meter? Ja, so in einem Dreh, hätte ich mir das jetzt auch gedacht."}, {"id": 53, "start": 490.0, "end": 499.0, "text": "Ja, das ist halt nicht viel. 300 Meter. Macht es halt auf dem Land teilweise uninteressant,"}, {"id": 54, "start": 499.0, "end": 502.0, "text": "und das ist ja das eigentliche Problem, was es auch beim Ausbau gibt."}, {"id": 55, "start": 502.0, "end": 507.0, "text": "In der Stadt hast du oftmals viele Alternativen. Guck mal, bei mir, ich könnte Supervectoring von der Telekom nehmen,"}, {"id": 56, "start": 507.0, "end": 517.0, "text": "ich könnte Gigabit von Vodafone nehmen, wenn ich ganz hardcore drauf bin, könnte ich auch LTE oder demnächst 5G oder so was nehmen,"}, {"id": 57, "start": 517.0, "end": 521.0, "text": "oder Telekom Hybrid, oder was auch immer, alles mögliche. Bei mir gibt es ja im Prinzip alles."}, {"id": 58, "start": 521.0, "end": 527.0, "text": "Aber wenn du mal ein bisschen auf dem Land guckst, in der Regel ist es so, da wo eins scheiße ist, sind alle anderen auch scheiße,"}, {"id": 59, "start": 527.0, "end": 533.0, "text": "und das ist halt Müll. Du kannst sagen, da wo scheiße ist, ist es halt scheiße."}, {"id": 60, "start": 533.0, "end": 540.0, "text": "Stimmt, stimmt. Ja, Leute, ich habe es schon wieder ganz vergessen, die Antenne ist mittlerweile noch größer geworden."}, {"id": 61, "start": 540.0, "end": 553.0, "text": "Soll ich das mal an? Armlieg. Die Antenne geht mir mittlerweile fast schon bis zur anderen Seite rüber."}, {"id": 62, "start": 553.0, "end": 559.0, "text": "Nach der Impfung. Aber mir tut zumindest der Arm nicht mehr weh."}, {"id": 63, "start": 559.0, "end": 568.0, "text": "Eigener 5G-Mast, ja. Ihr Armlieg. Ihr Bizepslieg, genau."}, {"id": 64, "start": 568.0, "end": 576.0, "text": "Das ist E, das sind alles keine Muskeln, das ist alles Pippo-Fett."}, {"id": 65, "start": 576.0, "end": 585.0, "text": "Nein, ich glaube nicht, dass Starlink irgendwas ablösen wird bei uns in Deutschland im großen Stil."}, {"id": 66, "start": 585.0, "end": 594.0, "text": "Das glaube ich nicht."}, {"id": 67, "start": 594.0, "end": 598.0, "text": "Ja, es gibt sicherlich total viele Varianten, was man machen kann."}, {"id": 68, "start": 598.0, "end": 606.0, "text": "Wichtig ist im Endeffekt, dass man die nicht für irgendwelche Ausbauten und Absichtserklärungen bezahlt,"}, {"id": 69, "start": 606.0, "end": 610.0, "text": "sondern die müssen bezahlt werden dafür, dass sie es gemacht haben."}, {"id": 70, "start": 610.0, "end": 620.0, "text": "Auch mit einer Auflage, bis dann und dahin. Das ist übrigens das gleiche. Kann sich noch jemand an die UMTS Auktion erinnern?"}, {"id": 71, "start": 620.0, "end": 625.0, "text": "Von... wann war das denn?"}, {"id": 72, "start": 625.0, "end": 630.0, "text": "2000..."}, {"id": 73, "start": 630.0, "end": 636.0, "text": "So, da haben die... Ich weiß, das ist jetzt fast schon Boomer-Zeiten."}, {"id": 74, "start": 636.0, "end": 645.0, "text": "Vielleicht einige von euch noch nicht, keine Ahnung. Vielleicht kann sich irgendjemand an die UMTS Auktion erinnern."}, {"id": 75, "start": 645.0, "end": 651.0, "text": "Das war ja damals Big Brain Time, das so zu machen. Man hat ja auch versucht, so ein spezielles..."}, {"id": 76, "start": 651.0, "end": 658.0, "text": "Ich habe vergessen, wie es heißt. Die haben das so ein ganz spezielles Versteigerungsverfahren gemacht,"}, {"id": 77, "start": 658.0, "end": 664.0, "text": "wo die Anbieter quasi irgendwie nicht wussten, was die anderen Anbieter abgeben, um da möglichst viel Geld rauszubringen."}, {"id": 78, "start": 664.0, "end": 670.0, "text": "Das Problem war nur, die Anbieter haben da so viel Geld bezahlt, so viel Geld ausgegeben,"}, {"id": 79, "start": 670.0, "end": 675.0, "text": "und das war im Prinzip an nichts geknüpft, was heißt, was im Endeffekt heißt."}, {"id": 80, "start": 675.0, "end": 682.0, "text": "Die Anbieter haben sich alle, wie verrückt, übersteigert, überboten, bis da noch ein paar übrig geblieben sind."}, {"id": 81, "start": 682.0, "end": 688.0, "text": "Man hat halt damit auch so effektiv verhindert, dass es mehr Anbieter als... keine Ahnung, wie gibt es denn Telekom..."}, {"id": 82, "start": 688.0, "end": 697.0, "text": "Oder wie gab es denn damals? Telekom, Vodafone... Damals gab es nicht so viele Anbieter, 2-3."}, {"id": 83, "start": 697.0, "end": 703.0, "text": "Und was haben die jetzt für einen Anreiz gehabt? Nee, E+, genau, E+, ja."}, {"id": 84, "start": 703.0, "end": 710.0, "text": "Und was haben die jetzt für einen Anreiz gehabt, in ländlichen Gebieten mit 5 Benutzern auszubauen? Gar keinen, null."}, {"id": 85, "start": 710.0, "end": 715.0, "text": "Die haben dort ausgebaut, wo es viel Kohle zu holen gab, weil die haben eh schon so viel Geld bezahlt."}, {"id": 86, "start": 715.0, "end": 722.0, "text": "Man hat effektiv verhindert, dass weitere Anbieter dazukommen, die da irgendwie ein bisschen, ja, das Ganze aufmischen können."}, {"id": 87, "start": 722.0, "end": 729.0, "text": "Und man hat dadurch auch nicht dafür gesorgt, dass sie ein großes Interesse haben, überall auszubauen."}, {"id": 88, "start": 729.0, "end": 735.0, "text": "Deswegen haben wir auch so viele Funklöcher. Bei mir in Meintal, jeden Tag, oder ich fahre nicht jeden Tag, aber..."}, {"id": 89, "start": 735.0, "end": 745.0, "text": "Apps, Google, Meintal, ich kenne keinen Mensch, aber Ostbahnhof, so."}, {"id": 90, "start": 745.0, "end": 755.0, "text": "Jeden Tag, wenn ich da vorbeifahre, ich fahre nicht jeden Tag vorbei, aber jedes Mal, jedes Mal, wenn ich da vorbeifahre, hier, Meintal Ost Bahnhof."}, {"id": 91, "start": 755.0, "end": 764.0, "text": "Zwischen Meintal West und Meintal Ost, jedes Mal, wenn ich da vorbeifahre, hier ist die Bahnstrecke, ist Funkloch."}, {"id": 92, "start": 764.0, "end": 770.0, "text": "Ich weiß nicht, was die da machen, keine Ahnung. So, und das Problem mit den UMTS Auktionen war, dass die halt keine Anreize hatten."}, {"id": 93, "start": 770.0, "end": 777.0, "text": "Hätte man gesagt, gut, ich meine, im Nachhinein ist man immer schlauer, und wenn ich das sage, heißt es noch lange nicht, dass das funktioniert hätte."}, {"id": 94, "start": 777.0, "end": 788.0, "text": "Aber überlegt euch mal, man hätte gesagt, hey, Anbieter, ihr bekommt die UMTS Lizenzen, ihr kriegt die meinetwegen sogar kostenlos."}, {"id": 95, "start": 788.0, "end": 798.0, "text": "Aber nur, wenn ihr euch verpflichtet, auszubauen, flächendeckend, und ihr kriegt den Kram nur unter den Auflagen oder nur, nachdem wir gesehen haben,"}, {"id": 96, "start": 798.0, "end": 803.0, "text": "ihr macht das oder ihr habt auch wirklich einen Plan, einen überprüfbaren Plan, wie das Ganze funktioniert,"}, {"id": 97, "start": 803.0, "end": 810.0, "text": "da hättest du gesehen, die werden rumgerannt am Arsch der Welt und hätten irgendwie Zeug aufgestellt."}, {"id": 98, "start": 810.0, "end": 818.0, "text": "Ja, gut, das kann man im Nachhinein immer gut sagen. Und letztendlich, was hat das Geld gebracht, was man damit eingenommen hat?"}, {"id": 99, "start": 818.0, "end": 824.0, "text": "Weiß ich, ob das damit... Ja, naja."}, {"id": 100, "start": 824.0, "end": 832.0, "text": "Ist das jetzt traditionell? Mach ich doch selten. Aber das ist halt so ein typisches Thema gewesen, UMTS Auktionen, wo man es meiner Ansicht nach verkackt hat."}, {"id": 101, "start": 832.0, "end": 843.0, "text": "Hätte man das wirklich, hätte man wirklich gesagt, hey, ihr kriegt die unter Auflagen, dass ihr das und das bis dann macht und nicht solche komischen Sachen,"}, {"id": 102, "start": 843.0, "end": 849.0, "text": "wie es aktuell immer erzählt wird, bis 2035 ist das und das passiert. Nee, nee, nee, das muss kurzfristig sein."}, {"id": 103, "start": 849.0, "end": 858.0, "text": "Es muss gesagt werden, hey, unser Ziel ist es, keine Ahnung, wenn man 2010 versteigert hat, hat man gesagt, okay, unser Ziel ist es 2020 flächendeckend abgedeckt."}, {"id": 104, "start": 858.0, "end": 863.0, "text": "Und wir haben einen genauen Plan. Und wenn ihr euch nicht dran haltet, kriegt ihr eure Lizenzen weggenommen."}, {"id": 105, "start": 863.0, "end": 872.0, "text": "Und hättet ihr mal gesehen, kommt wie schnell, wie gesagt, wie bei Corona Testzentren an jeder Ecke."}, {"id": 106, "start": 872.0, "end": 880.0, "text": "Die werden amok gelaufen. Okay, das ist vielleicht ein bisschen übertrieben, aber die werden amok gelaufen im UMTS-Masten aufstellen."}, {"id": 107, "start": 880.0, "end": 889.0, "text": "Ja, wäre alles, alles, alles wunderbar funktioniert. Und so könnte man das ja auch beim Festnetzausbau machen. Aber egal, das ist so ein."}, {"id": 108, "start": 889.0, "end": 895.0, "text": "Ja, ich verstehe. Übrigens Leute, was mich heute mega verwirrt hat."}, {"id": 109, "start": 895.0, "end": 901.0, "text": "Was mich heute mega verwirrt hat, ist folgendes Bild von Apple. Guck mal, ich habe dieses Bild von Apple gefunden."}, {"id": 110, "start": 901.0, "end": 910.0, "text": "Ich habe, ich habe ein iPhone 11 hier und ich habe gesucht iPhone 11 Dual SIM und habe ich dieses Bild gefunden von Apple."}, {"id": 111, "start": 910.0, "end": 916.0, "text": "Wie sieht dieses Bild für euch aus? Also auch noch in Deutsch beschrieben, auch noch in Deutsch."}, {"id": 112, "start": 916.0, "end": 922.0, "text": "Wie sieht dieses Bild für euch aus? Kann man da zwei SIM-Karten rein machen? Ja oder Nee?"}, {"id": 113, "start": 922.0, "end": 927.0, "text": "Ich würde sagen, ja, kann man eine oben, eine unten."}, {"id": 114, "start": 927.0, "end": 934.0, "text": "Ich zeige euch auch, dass ich keinen Mist erzähle. Das ist wirklich ein Apple Bild."}, {"id": 115, "start": 934.0, "end": 945.0, "text": "Da, guck. So sind es die nächsten Nano SIM-Karten. Aber ich habe das Bild gesehen, habe mir gedacht, nice."}, {"id": 116, "start": 945.0, "end": 952.0, "text": "Da kann ich das Handy, was ich von der Firma bekomme, auch für mein Aldi-Talk verwenden. Ich brauche kein zweites Gerät mehr."}, {"id": 117, "start": 952.0, "end": 958.0, "text": "Und ich habe es nicht hingekriegt. Ich habe mir gesagt, wie um alles in der Welt soll da die SIM-Karte reinpassen?"}, {"id": 118, "start": 958.0, "end": 965.0, "text": "Das funktioniert überhaupt nicht. Bis ich es dann irgendwann gecheckt habe, diese Anleitung von Apple hier komplett in Deutsch,"}, {"id": 119, "start": 965.0, "end": 978.0, "text": "komplett eingedeutscht, gilt nur für, Moment, in Festland, China, Hongkong und Macau. Ich weiß nicht mal, wo das ist."}, {"id": 120, "start": 978.0, "end": 986.0, "text": "China, China, China, China, China, China, China, China, China, China, China, China, China, China, China, China, China, China."}, {"id": 121, "start": 986.0, "end": 993.0, "text": "Wo ist das überhaupt? Ich kann keine eSIM nehmen, weil Aldi-Talk keine eSIM anbietet."}, {"id": 122, "start": 993.0, "end": 1002.0, "text": "Weil das irgendein richtiger, keine Ahnung, Boomer Verein, nee. Keine Ahnung, wo ist das?"}, {"id": 123, "start": 1002.0, "end": 1008.68, "text": "Okay, dann kann man davon ausgehen, dass die Chinesen der Meinung sind, das gehört zu"}, {"id": 124, "start": 1008.68, "end": 1009.68, "text": "China."}, {"id": 125, "start": 1009.68, "end": 1014.9, "text": "Im Prinzip ist es ja so, bei allem, was irgendwie um China liegt, sind die Chinesen der Meinung,"}, {"id": 126, "start": 1014.9, "end": 1015.9, "text": "das gehört ihnen."}, {"id": 127, "start": 1015.9, "end": 1020.72, "text": "Ist ja hier bei, äh, hier, Taiwan, ist ja das gleiche."}, {"id": 128, "start": 1020.72, "end": 1029.92, "text": "Taiwan, die Chinesen sind ja auch der Meinung, das ist meins, ist unseres, alles meins."}, {"id": 129, "start": 1029.92, "end": 1039.44, "text": "Naja, aber ja, habe ich verkackt und ich dachte, das geht."}, {"id": 130, "start": 1039.44, "end": 1043.72, "text": "Aldi Talk hat leider keine eSIM, das heißt, ich bräuchte einen anderen Anbieter."}, {"id": 131, "start": 1043.72, "end": 1045.28, "text": "Eigentlich wollte ich aber keinen anderen Anbieter."}, {"id": 132, "start": 1045.28, "end": 1065.64, "text": "Die Festland-China-Chinesen, genau, A91202, Dankeschön für 3 Monate Subscription."}, {"id": 133, "start": 1065.64, "end": 1068.64, "text": "Hä?"}, {"id": 134, "start": 1068.64, "end": 1078.6, "text": "Wer soll das denn ausbauen, wenn nicht die Anbieter, die Anbieter haben wenigstens Ahnung"}, {"id": 135, "start": 1078.6, "end": 1079.6, "text": "von der Technik."}, {"id": 136, "start": 1079.6, "end": 1086.52, "text": "Äh, ja, ja, mach mal Ausrufezeichen 1 im Chat, da gibt es sogar eine Erklärung zu,"}, {"id": 137, "start": 1086.52, "end": 1090.6, "text": "aber es hat keinen tieferen Sinn, also es gibt keinen Grund, dass man das auch so machen"}, {"id": 138, "start": 1090.6, "end": 1091.6, "text": "müsste."}, {"id": 139, "start": 1091.6, "end": 1107.28, "text": "Ne, ne, es gibt mehr Anbieter mit eSIM als die Telekom, Cellmapper, ok, nein, ich suche"}, {"id": 140, "start": 1107.28, "end": 1120.92, "text": "jetzt, ok, ich guck mir das jetzt an, Cellmapper, Provider, Telekom, ok, und wo sucht man da"}, {"id": 141, "start": 1120.92, "end": 1132.96, "text": "jetzt, wo sucht man da jetzt nach, ah, hier Location Search, Meintal Ost, da sind wir"}, {"id": 142, "start": 1132.96, "end": 1133.96, "text": "doch."}, {"id": 143, "start": 1133.96, "end": 1136.36, "text": "So, und wo erkenne ich jetzt, ob es da, ob es da Funklöcher gibt?"}, {"id": 144, "start": 1136.36, "end": 1146.8, "text": "Also hier ist Meintal Ost, da ist Hanau Wilhelmsbaden, da ist irgendwo Hanau West, ähm, Meintal,"}, {"id": 145, "start": 1146.8, "end": 1154.4, "text": "irgendwo ist Meintal West, so und hier dazwischen, hier dazwischen, kackt mir regelmäßig die,"}, {"id": 146, "start": 1154.4, "end": 1171.28, "text": "die, die, die Handyverbindung ab, hier so wahrscheinlich, guckt mal, hier ist da auch kaum was, ja,"}, {"id": 147, "start": 1171.28, "end": 1179.88, "text": "aber davor auch, guckt euch das mal an, ja, RIP, ja, äh, ich weiß noch, als Corona angefangen"}, {"id": 148, "start": 1179.88, "end": 1184.96, "text": "hat, hatten wir eine Video-, äh, keine Videokonferenz, ein Teamscall, wo mein Chef was erzählt"}, {"id": 149, "start": 1184.96, "end": 1188.92, "text": "hat zu aktuellen Entscheidungen auf der Arbeit, also letztes Jahr März oder so, wann das"}, {"id": 150, "start": 1188.92, "end": 1201.8, "text": "war und ich bin gefahren hier nach Hanau von, äh, von Frankfurt Ost-, äh, Frankfurt Süd,"}, {"id": 151, "start": 1201.8, "end": 1207.92, "text": "müsste, müsste hier irgendwo sein, bin verwirrt, ich weiß nicht, wo das ist, aber ich bin"}, {"id": 152, "start": 1207.92, "end": 1214.12, "text": "gefahren von Frankfurt Süd nach Hanau und es ist fünfmal abgekackt zwischendurch, ich"}, {"id": 153, "start": 1214.12, "end": 1219.84, "text": "hab die Hälfte nicht mitbekommen, so, ich mach mal kurz hier IDE auf, der Overlay-Champ,"}, {"id": 154, "start": 1219.84, "end": 1223.92, "text": "ja, wir machen heute am Overlay-Champ ein bisschen weiter, gucken, wo wir stehen geblieben"}, {"id": 155, "start": 1223.92, "end": 1231.04, "text": "sind, zumal der Source-Scout ja eines der hässlichsten, schau mal, wie es bei dir zu Hause ist, leek,"}, {"id": 156, "start": 1231.04, "end": 1237.2, "text": "äh, eines der hässlichsten Dinger ist überhaupt, aber wie, das ist ja auch eigentlich im Prinzip"}, {"id": 157, "start": 1237.2, "end": 1242.76, "text": "nur alles untereinander, untereinander geschrieben, mal gucken, ob es noch funktioniert, oh, oh,"}, {"id": 158, "start": 1242.76, "end": 1247.32, "text": "High-Speed, High-Speed, Leute, High-Speed GIF, High-Speed GIF, das GIF ist so schnell, dass"}, {"id": 159, "start": 1247.32, "end": 1259.56, "text": "ihr die Hälfte der Bilder nicht seht, oder, MonkaS, ihr sehts, ihr seht aber nicht dieses"}, {"id": 160, "start": 1259.56, "end": 1273.36, "text": "ultra-schnelle Rum-Gedingse, oder, seht ihr das, Moment, Wupp-Lords auf Twitch, ja doch,"}, {"id": 161, "start": 1273.36, "end": 1288.76, "text": "sieht man, ist voller Abkacken, der rendert grad so schnell wie es geht GIFs, äh, Moment,"}, {"id": 162, "start": 1288.76, "end": 1296.84, "text": "echt, iPhones haben kein Dual-SIM, ja, anscheinend nur eine SIM-Karte und eSIM als zweites,"}, {"id": 163, "start": 1296.84, "end": 1304.2, "text": "naja, ich kanns mir nicht aussuchen, ich kann jetzt ja schlecht auf die Arbeit gehen und"}, {"id": 164, "start": 1304.2, "end": 1311.32, "text": "sagen, ja, also ihr stellt mir zwar kostenlosen iPhone zur Verfügung, aber, äh, iPhone ist"}, {"id": 165, "start": 1311.32, "end": 1315.12, "text": "für Kacknoobs, gib mir ein Android-Gerät, aber das kann ich sagen, aber das wird keiner"}, {"id": 166, "start": 1315.12, "end": 1322.56, "text": "machen, wenn alle nen iPhone 11 kriegen, dann krieg ich auch nen iPhone 11, jetzt nicht,"}, {"id": 167, "start": 1322.56, "end": 1328.68, "text": "dass, dass der Weisheitsletzter Schluss wäre oder so, aber das betrifft, jetzt kann ich"}, {"id": 168, "start": 1328.68, "end": 1337.36, "text": "nix machen, 100% CPU, 100% GPU, nee, das mach ich, Moment, wenn, wir gucken uns jetzt mal"}, {"id": 169, "start": 1337.36, "end": 1348.44, "text": "kurz, wir gucken uns mal kurz an, wie viel CPU-Auslastung das ganze hat, guck mal, fast"}, {"id": 170, "start": 1348.44, "end": 1362.84, "text": "nix, Leute, 2% und GPU, sollte das nicht eigentlich drinstehen irgendwo, ach hier, nix, 3% GPU,"}, {"id": 171, "start": 1362.84, "end": 1374.2, "text": "5% CPU, das ist ja, das ist ja nix, da wirds einem schlecht, wenn man das zu lange anguckt,"}, {"id": 172, "start": 1374.2, "end": 1379.52, "text": "warum du zwei SIM-Karten brauchst, naja, ich will meine private Telefonnummer und die SIM-Karte"}, {"id": 173, "start": 1379.52, "end": 1388.0, "text": "von der Arbeit in einem Gerät haben, dass ich keine zwei Geräte mehr brauch, 5€,"}, {"id": 174, "start": 1388.0, "end": 1393.08, "text": "beim Chef hab ich da kein Problem, der findet das wahrscheinlich sogar noch lustig, aber"}, {"id": 175, "start": 1393.08, "end": 1399.56, "text": "die, die das entscheiden können, denen ist das vollkommen egal, doch, wahrscheinlich"}, {"id": 176, "start": 1399.56, "end": 1417.76, "text": "schon, aber die werden ja nicht nur für mich ne e-SIM da ausstellen, nee, nee, nee, nee,"}, {"id": 177, "start": 1417.76, "end": 1422.76, "text": "nee, ich frag da nicht, ich suche mir lieber einen Anbieter mit e-SIM, kann man eigentlich"}, {"id": 178, "start": 1422.76, "end": 1426.4, "text": "seine Mobilfunknummer einfach umziehen, hab ich noch nie gemacht, also wenn ich jetzt"}, {"id": 179, "start": 1426.4, "end": 1431.0, "text": "von Aldi Talk wechseln will zu irgendwas mit e-SIM, geht das einfach, genauso einfach"}, {"id": 180, "start": 1431.0, "end": 1435.0, "text": "wie Festnetznummer wechseln, einfach Antrag ausfüllen beim nächsten, ja, ob das ein"}, {"id": 181, "start": 1435.0, "end": 1440.72, "text": "bisschen was kostet, interessiert mich nicht, also solange das jetzt irgendwie 80€ kostet"}, {"id": 182, "start": 1440.72, "end": 1451.48, "text": "oder so, ist ok, wenn die 2,50€ als Gebühr haben wollen, interessiert mich das nicht"}, {"id": 183, "start": 1451.48, "end": 1468.28, "text": "weiter, du bist zu was gewechselt, Frank, was ist Frank, Frank Mobile, was für ein Ding,"}, {"id": 184, "start": 1468.28, "end": 1475.56, "text": "was ist das, das hab ich noch nie gehört, gibt es irgendwie jeden Tag neue Anbieter"}, {"id": 185, "start": 1475.56, "end": 1489.96, "text": "oder was, außer mal äußerst hässliche Webseite, was ist das, hab ich noch nie gehört, was"}, {"id": 186, "start": 1489.96, "end": 1505.88, "text": "für den reese woher wissen die wie ich heiße oder oder steht das überall oder steht das"}, {"id": 187, "start": 1505.88, "end": 1520.64, "text": "überall maximilian what the fuck das wissen die nicht ich gehe mal davon aus dass es wirklich"}, {"id": 188, "start": 1520.64, "end": 1536.04, "text": "max mustermann ja ja und was was haben was haben die irgendwie e sim ok dein tarif per"}, {"id": 189, "start": 1536.04, "end": 1551.48, "text": "app prank oder fraenk flat 10 euro pro monat nicht mehr gibt es noch was billigeres dennchen"}, {"id": 190, "start": 1551.48, "end": 1565.0, "text": "mehr infos gibt es noch was billigeres weil ich brauche den datentarif im prinzip kaum noch ich"}, {"id": 191, "start": 1565.0, "end": 1569.08, "text": "brauche ich brauche eigentlich nur für telefon weil datentarif nämlich die simkarte von der"}, {"id": 192, "start": 1569.08, "end": 1583.44, "text": "arbeit ich brauche das billigste überhaupt wo ich zwei faktor sms empfangen kann ach wurscht"}, {"id": 193, "start": 1583.44, "end": 1597.08, "text": "aber irgendwo anders was win win sim win sim klingt nach scam weiß ich manche anbieter klingen"}, {"id": 194, "start": 1597.08, "end": 1604.28, "text": "klingt vom namen her schon richtig nach scam all die hat keine e sim sim quadrat was sind das"}, {"id": 195, "start": 1604.28, "end": 1614.0, "text": "alter kann das jetzt gibt es nicht wirklich sim quadrat oder das ist für alle minecraft leute"}, {"id": 196, "start": 1614.0, "end": 1627.16, "text": "tatsächlich sim quadrat die anbieter namen ohne daten kein internet ja sowas reicht ganz ehrlich"}, {"id": 197, "start": 1627.16, "end": 1633.84, "text": "fünf euro perfekt reicht mir e sim gigabyte datenvolumen ist ok wie gesagt ich verwende das"}, {"id": 198, "start": 1633.84, "end": 1638.32, "text": "ähnlich für datenvolumen dafür dafür verwende ich die andere simkarte ich brauche eigentlich nur"}, {"id": 199, "start": 1638.32, "end": 1651.36, "text": "eine handynummer was kostet was kostet handynummer umziehen du hast eine domain die sehr nah an win"}, {"id": 200, "start": 1651.36, "end": 1656.76, "text": "sim dran ist die schicken die laufend kündigung ist fast wie bei mir auf der arbeit bei mir rufen"}, {"id": 201, "start": 1656.76, "end": 1662.12, "text": "auch manchmal verärgerte verärgerte außendienst mit mit arbeiter an und fragen mich wo ihre"}, {"id": 202, "start": 1662.12, "end": 1671.8, "text": "provision bleibt und da denke ich warum was sie sind hier falsch und das problem ist halt dass"}, {"id": 203, "start": 1671.8, "end": 1677.16, "text": "meine telefonnummer fast soweit ist wie die für die abrechnung für die professionsabteilung für"}, {"id": 204, "start": 1677.16, "end": 1684.44, "text": "frag mich nicht hessen süd oder so da kommt über mir alle können vorstellen wenn die an also wenn"}, {"id": 205, "start": 1684.44, "end": 1692.58, "text": "einer vom außendienst anruft in der zentrale und sagt was ist los mit meiner abrechnung dann"}, {"id": 206, "start": 1692.58, "end": 1704.6, "text": "könnte davon ausgehen er hat in der regel kein geld gekriegt ist sauer glaube sowas mache ich"}, {"id": 207, "start": 1704.6, "end": 1710.76, "text": "wie funktioniert das einfach eine app installieren und dann in den iphone settings hinzufügen oder"}, {"id": 208, "start": 1710.76, "end": 1717.8, "text": "wie sim quadrat aber der nabe macht mich immer noch fertig"}, {"id": 209, "start": 1726.8, "end": 1728.0, "text": "sim quadrat"}, {"id": 210, "start": 1728.0, "end": 1742.32, "text": "ich als einzige mod was ich quadratisch habe gerade ich habe noch ein anderes quadratisches"}, {"id": 211, "start": 1742.32, "end": 1764.48, "text": "emote verstehe ja muss ich mir mal angucken ich glaube das werde ich machen so los geht's"}, {"id": 212, "start": 1764.48, "end": 1772.8, "text": "was ein brief und dann mit qr code ok ja das wird das wird wird schon wird schon tun"}, {"id": 213, "start": 1774.8, "end": 1780.32, "text": "so also wo sind wir denn stehen geblieben ich würde sagen als allererstes dass das wichtig"}, {"id": 214, "start": 1780.32, "end": 1785.2, "text": "das mit abstand wichtigste feature was wir unbedingt noch brauchen ist wir brauchen"}, {"id": 215, "start": 1785.2, "end": 1795.2, "text": "fps counter leute ich muss wissen mit wieviel fps rare parrot rad zeigt mal her blicke ich"}, {"id": 216, "start": 1795.2, "end": 1798.56, "text": "überhaupt noch durch bei diesem ganzen dass ich meine das ist eines der hässlichsten"}, {"id": 217, "start": 1798.56, "end": 1802.8, "text": "dinger die ich hier je gebaut habe blicke ich überhaupt noch durch wo hier was passiert"}, {"id": 218, "start": 1802.8, "end": 1807.88, "text": "wo passiert denn hier was ja am besten am besten auch die variable namen also merkt euch plupp"}, {"id": 219, "start": 1807.88, "end": 1813.32, "text": "und temp sind mit abstand die besten variablen namen überhaupt da weiß man sofort bescheid"}, {"id": 220, "start": 1813.32, "end": 1817.72, "text": "was wofür das da ist wenn ich das überhaupt noch irgendwo"}, {"id": 221, "start": 1817.72, "end": 1825.44, "text": "ach hier ok"}, {"id": 222, "start": 1825.44, "end": 1835.28, "text": "lull lull ist lull ist auch gute variable namen aber temp temp oder i i und i n temp und plupp"}, {"id": 223, "start": 1835.28, "end": 1846.48, "text": "sind meine also i n temp plupp das sind so meine meine hallo lull meine meine lieblingsvariablen"}, {"id": 224, "start": 1846.48, "end": 1851.92, "text": "namen ok also wo wo wo wo wo mache ich hier den output begin draw hier also hier muss"}, {"id": 225, "start": 1851.92, "end": 1859.6, "text": "ich fps hochzählen glaube ich ok wir machen mal ein fps counter kurz fps"}, {"id": 226, "start": 1859.6, "end": 1866.52, "text": "nee keine ahnung auch auch beste du weißt man auch sofort für was da gekountet wird"}, {"id": 227, "start": 1866.52, "end": 1874.28, "text": "oh nee oh mache ich nicht selbst als selbst als parameter für ob ich mache ich mache"}, {"id": 228, "start": 1874.28, "end": 1879.12, "text": "ich o o mache ich eigentlich selten counter so und jetzt moment wie mache ich jetzt am"}, {"id": 229, "start": 1879.12, "end": 1884.64, "text": "besten fps counter irgendwie stopwatch ob übrigens hier richtig krasse hecker mein"}, {"id": 230, "start": 1884.64, "end": 1889.56, "text": "hex hier was ich letztens gelernt habe sogar im stream hat mir jemand gezeigt normalerweise"}, {"id": 231, "start": 1889.56, "end": 1898.32, "text": "habe ich immer gesagt stop stopwatch start das braucht man gar nicht das braucht man"}, {"id": 232, "start": 1898.32, "end": 1907.76, "text": "gar nicht pass mal auf man kann einfach sagen stopwatch alter autoverfall ständigung wo"}, {"id": 233, "start": 1907.76, "end": 1917.4, "text": "ist denn die autoverfall ständigungs ai wenn man sie braucht start new das ist nicht pock"}, {"id": 234, "start": 1917.4, "end": 1923.64, "text": "haben eine zeile gespart richtig richtig six hat wusste ich nicht hat mir letztens einer"}, {"id": 235, "start": 1923.64, "end": 1930.32, "text": "im stream gezeigt oder im chat geschrieben da sieht man einfach der chat ist wieder richtig"}, {"id": 236, "start": 1930.32, "end": 1936.04, "text": "richtig ist next level das kann ich gar nicht nicht jeden stream zeigen weil ich das glaube"}, {"id": 237, "start": 1936.04, "end": 1941.4, "text": "ich erst im letzten oder vorletzten stream selbst erfahren habe dass das so funktioniert"}, {"id": 238, "start": 1941.4, "end": 1948.4, "text": "es wird nach line of course bezahlt ja dann sollten wir auch auf kobold wechseln wieder"}, {"id": 239, "start": 1948.4, "end": 1959.0, "text": "ok also war von der logik her ich zähle wie viele fps ich habe und dann sage ich wenn"}, {"id": 240, "start": 1959.0, "end": 1978.72, "text": "meine mein timer seconds elapsed total total seconds größer gleich zwei alle eins dann"}, {"id": 241, "start": 1978.72, "end": 1997.2, "text": "geben wir aus wie viele wie viele wie viele frames sind und dann restarte ich den timer"}, {"id": 242, "start": 1997.2, "end": 2001.32, "text": "und setze die frames auf null ok mal gucken ob das funktioniert jetzt sollte ich ein frame"}, {"id": 243, "start": 2001.32, "end": 2013.76, "text": "so eine art frame counters 240 das kann ich sein das ist viel zu wenig 240 fps das ist"}, {"id": 244, "start": 2013.76, "end": 2019.44, "text": "wie sync das ist wie sync da ist wie sync an ich habe 240 als monitor warum ist da wie"}, {"id": 245, "start": 2019.44, "end": 2031.64, "text": "sync wie kriege ich wie sync aus wie sync muss aus aus wie sync null null sync du hast"}, {"id": 246, "start": 2031.64, "end": 2046.32, "text": "irgendwo bei sync habe ich echt sync ich habe nirgends wo sync stehen ich habe 240 hz monitor"}, {"id": 247, "start": 2046.32, "end": 2062.32, "text": "ja intervalle äh ging das nicht hier swap swap chain wie sync und da muss ich mal suchen"}, {"id": 248, "start": 2062.32, "end": 2073.16, "text": "swap chain wie sync ok warum streamst du da nur in 48 fps weil die meisten leute das"}, {"id": 249, "start": 2073.16, "end": 2078.48, "text": "überhaupt nicht richtig also gar kein großartiges mehrwert davon hätten wenn ich 240 fps streame"}, {"id": 250, "start": 2078.48, "end": 2085.56, "text": "und dazu kommt warum ich 48 fps und nicht 60 fps oder 30 stream ist weil wenn du eine"}, {"id": 251, "start": 2085.56, "end": 2090.88, "text": "gewisse gewisse bandbreite zur verfügung zum stream so und wenn du eine feste bandbreite"}, {"id": 252, "start": 2090.88, "end": 2100.88, "text": "hast dann ist natürlich für ein bild mehr bandbreite übrig wenn du weniger fps hast"}, {"id": 253, "start": 2100.88, "end": 2114.64, "text": "das ist ein present ach guck mal da present das müsste hier unten sein irgendwo ne swap"}, {"id": 254, "start": 2114.64, "end": 2129.52, "text": "ah hier hier guck mal present sync intervalle null so jetzt aber jawoll schau mal viel besser"}, {"id": 255, "start": 2129.52, "end": 2133.76, "text": "guck mal jetzt jetzt jetzt jetzt stimmt die anzeige hinten vorne schon mal nicht mehr"}, {"id": 256, "start": 2133.76, "end": 2143.36, "text": "jetzt komplett vorbei warum gehst du nicht auf 30 fps runter weil 48 fps genau der beste"}, {"id": 257, "start": 2143.36, "end": 2148.64, "text": "kompromiss ist zwischen flüssige wiedergabe und mehr bandbreite für den einzelnen frame"}, {"id": 258, "start": 2148.64, "end": 2154.72, "text": "übrig jetzt task manager so aber da geht noch mehr das sind noch ein bisschen wenig"}, {"id": 259, "start": 2154.72, "end": 2162.6, "text": "fps da muss noch mehr gehen ok guck mal jetzt haben wir schon ein bisschen mehr 15 cpu 15"}, {"id": 260, "start": 2162.6, "end": 2179.88, "text": "prozent gpu da muss da muss aber noch ein bisschen mehr gehen naja woran das beschränkt"}, {"id": 261, "start": 2179.88, "end": 2186.48, "text": "ist der muss das gift decoden ich glaube nicht dass das direkt x zeug das problem ist sondern"}, {"id": 262, "start": 2186.48, "end": 2196.4, "text": "das das der gift decoder ist das problem ich meine wenn ich jetzt einfach den gift decoder"}, {"id": 263, "start": 2196.4, "end": 2207.72, "text": "unabhängig mache von dem von dieser schleife die das hier malt das stimmt ich glaube ich"}, {"id": 264, "start": 2207.72, "end": 2216.36, "text": "habe sogar noch die bag laufen genau stimmt hast recht ja mal hier auf net run das so"}, {"id": 265, "start": 2216.36, "end": 2223.88, "text": "genau dann würde das sicherlich viel viel schneller laufen ja leider auch wenn das war"}, {"id": 266, "start": 2223.88, "end": 2233.36, "text": "wie war das minus c release glaub ne macht macht kein bisschen bisschen aber nicht wirklich"}, {"id": 267, "start": 2233.36, "end": 2246.4, "text": "viel unterschied das einfachste wäre das einfachste wäre was ich nicht mache weil"}, {"id": 268, "start": 2246.4, "end": 2251.2, "text": "ich will ja keine 100 prozent cpu last hier verursachen also das einfachste wäre natürlich"}, {"id": 269, "start": 2251.2, "end": 2257.64, "text": "ich lasse das gif rendern quasi immer immer das aktuellste gif und schreibt das halt so"}, {"id": 270, "start": 2257.64, "end": 2260.96, "text": "schnell wie es geht rein und wenn es neues gibt dann halt neues aber das ist bescheuert"}, {"id": 271, "start": 2260.96, "end": 2266.84, "text": "wozu mein ziel mein ziel ist ja nicht hier irgendwie 100 prozent cpu last mit einem"}, {"id": 272, "start": 2266.84, "end": 2275.96, "text": "gif zu bekommen und schneller rendern als der gift decoder das gift decoden kann bringt"}, {"id": 273, "start": 2275.96, "end": 2284.64, "text": "halt gar nichts ich weiß wir können mal ausprobieren wie schnell es maximal geht das können"}, {"id": 274, "start": 2284.64, "end": 2287.92, "text": "wir machen da müsste ich aber irgendwie alter das ist so hässlich ich blicke hier überhaupt"}, {"id": 275, "start": 2287.92, "end": 2292.96, "text": "nicht mehr durch wo wird dann hier decoded hier aber wir können ich glaube wir können"}, {"id": 276, "start": 2292.96, "end": 2296.88, "text": "noch ein bisschen was optimieren wartet mal wir können noch ein bisschen wir können"}, {"id": 277, "start": 2296.88, "end": 2307.0, "text": "noch ein bisschen was ein bisschen was optimieren wir müssen das nicht jedes mal für jeden"}, {"id": 278, "start": 2307.0, "end": 2312.48, "text": "schleifen durchlauf anlegen wir müssen es nicht für den schleifen durchlauf anlegen"}, {"id": 279, "start": 2312.48, "end": 2333.6, "text": "das ist ok ob es jetzt schneller ist macht überhaupt kein unterschied und was ist wenn"}, {"id": 280, "start": 2333.6, "end": 2337.04, "text": "ich das freigeben wieder rausschmeißer dann habe ich zwar memory leak aber ist schneller"}, {"id": 281, "start": 2337.04, "end": 2345.88, "text": "ok das ffm pack memory handling macht überhaupt kein unterschied das ist wirklich das gift"}, {"id": 282, "start": 2345.88, "end": 2357.44, "text": "decoden was probleme macht man der liest das ja auch von der ssd und sowas"}, {"id": 283, "start": 2357.44, "end": 2362.68, "text": "macht kommentare rein näh das lohnt das lohnt sich alles nicht mehr ok ich mein"}, {"id": 284, "start": 2362.68, "end": 2370.56, "text": "ne da müsste ich das jetzt umbauen wie gesagt ich ich ich splitte das eh auf weil das mega"}, {"id": 285, "start": 2370.56, "end": 2374.24, "text": "hässlich ist also wir machen das wir machen da eh jetzt gleich ein paar eigene klassen"}, {"id": 286, "start": 2374.24, "end": 2379.4, "text": "wir machen wir machen eine klasse für das ffm pack decoder zeug und dann machen wir"}, {"id": 287, "start": 2379.4, "end": 2389.04, "text": "so eine eigene form fürs rendern weil ich habe ja aktuell hier alles komplett in einem"}, {"id": 288, "start": 2389.04, "end": 2395.4, "text": "thread also das gift decoden und das rendern von das direct x rendern ist alles alles"}, {"id": 289, "start": 2395.4, "end": 2401.4, "text": "alles in einem thread das heißt ich kriege ich kann jetzt gar nicht sagen hey warten"}, {"id": 290, "start": 2401.4, "end": 2409.16, "text": "wir einfach mal und zeichnen so schnell wir können das das funktioniert nicht so aber"}, {"id": 291, "start": 2409.16, "end": 2417.52, "text": "wir müssen die fps da noch irgendwie reinschreiben aber ich finde ich finde die decoding geschwindigkeit"}, {"id": 292, "start": 2417.52, "end": 2423.56, "text": "ist wie ist die im fullscreen genauso schnell also die decoding geschwindigkeit mit 1200"}, {"id": 293, "start": 2423.56, "end": 2429.52, "text": "fps und so das ist durchaus in ordnung ich meine ich muss den kram eh runterschrauben"}, {"id": 294, "start": 2429.52, "end": 2441.52, "text": "auf ähm warte mal wo steht denn das drinnen frame time nee ähm ach du scheiße wo steht"}, {"id": 295, "start": 2441.52, "end": 2447.88, "text": "noch mal drinnen wie viel fps das ganze stream ist das glaube ich ne stream time timebase"}, {"id": 296, "start": 2447.88, "end": 2456.2, "text": "genau das brauchen wir und das kann ich mir nie merken das kann ich mir nie merken timebase"}, {"id": 297, "start": 2456.2, "end": 2470.08, "text": "zeigt mal kurz her wir machen prinzipiell print print debugging was anderes ist ja"}, {"id": 298, "start": 2470.08, "end": 2480.52, "text": "die bugger using ist für noobs das machen wir hier nicht 100 das gift hat doch im leben"}, {"id": 299, "start": 2480.52, "end": 2489.48, "text": "keine 100 keine 100 100 fps moment das das ist glaube ich mist was der da ausliest warte"}, {"id": 300, "start": 2489.48, "end": 2494.36, "text": "mal das muss ich mir jetzt gerade mal im detail angucken den gift mit 100 fps das wäre es"}, {"id": 301, "start": 2494.36, "end": 2503.52, "text": "jetzt aber noch bei frames gibt es doch bei gift gibt es doch pro frame jetzt halt ja"}, {"id": 302, "start": 2503.52, "end": 2508.4, "text": "da würde ich jetzt aber eigentlich erwarten dass ffmpeg das für mich ausrechnet so 25"}, {"id": 303, "start": 2508.4, "end": 2519.64, "text": "fps sind es angeblich nur wie kriege ich wie kriege ich das raus in ffmpeg bei normalen"}, {"id": 304, "start": 2519.64, "end": 2525.76, "text": "also ich weiß dass man es bei normalen videos so raus kriegt wie ich es eben gemacht habe"}, {"id": 305, "start": 2525.76, "end": 2551.96, "text": "so ok ffmpeg gift fps ja frame rate frame rate gibt es das vielleicht frame frame rate"}, {"id": 306, "start": 2551.96, "end": 2564.16, "text": "oder sowas stream frame average frame rate ok warte mal wir haben eine r frame rate und"}, {"id": 307, "start": 2564.16, "end": 2575.92, "text": "wir haben eine durchschnittliche frame rate was ist das schon wieder was oh big brain"}, {"id": 308, "start": 2575.92, "end": 2589.68, "text": "time jetzt hat es was was will das von mir ok wir geben uns wir geben das jetzt einfach"}, {"id": 309, "start": 2589.68, "end": 2603.84, "text": "mal aus ok echt kein plan was haben wir denn sonst noch hier und durchschnittliche durchschnittliche"}, {"id": 310, "start": 2603.84, "end": 2616.84, "text": "frame rate ok sag ich ja ok das passt 25 fps beides zeigen sie das gleiche an also es ist"}, {"id": 311, "start": 2616.84, "end": 2626.48, "text": "egal zumindest bei diesem einen gift ist egal was ich nehme also das ist die frame rate"}, {"id": 312, "start": 2626.48, "end": 2633.28, "text": "von dem gift das muss ich mir merken das muss ich mir merken dass das nachher nachher richtig"}, {"id": 313, "start": 2633.28, "end": 2637.2, "text": "richtig machen kann ok also das heißt wir wissen jetzt schon mal wie man super schnell"}, {"id": 314, "start": 2637.2, "end": 2644.6, "text": "den gift malt huge da hat die welt drauf gewartet so und jetzt natürlich die nächste preisfrage"}, {"id": 315, "start": 2644.6, "end": 2650.48, "text": "wie kriege ich den fps counter wie kriege ich den fps counter hier oben hier oben hin"}, {"id": 316, "start": 2650.48, "end": 2664.32, "text": "was das für ein hotkey ist ctrl k ctrl also ctrl k c ctrl k c ist ein und aus kommentieren"}, {"id": 317, "start": 2664.32, "end": 2678.88, "text": "toggle k kom kommentar genau so gut was habe ich jetzt gesagt müssen wir machen boomer"}, {"id": 318, "start": 2678.88, "end": 2696.44, "text": "hier wieder am start der chat hat aber bestimmt aufgepasst fps anzeige korrekt also wie kriegen"}, {"id": 319, "start": 2696.44, "end": 2720.28, "text": "wir da jetzt eine fps anzeige gemalt so das heißt fps anzeigen draw text aha draw text"}, {"id": 320, "start": 2720.28, "end": 2735.64, "text": "ach du scheiße microsoft was ist das wieder moment was was hast du also hast du eine ahnung"}, {"id": 321, "start": 2735.64, "end": 2740.76, "text": "ob es reicht bei einem recapture von google das kript in den html header zu packen und"}, {"id": 322, "start": 2740.76, "end": 2746.6, "text": "die sind dann im kontakt also vor dem abschicken button oder was ich habe recapture noch ehrlich"}, {"id": 323, "start": 2746.6, "end": 2752.28, "text": "gesagt nie verwendet keine ahnung leute ich glaube ich sollte mal auf den preisschampen"}, {"id": 324, "start": 2752.28, "end": 2757.08, "text": "recapture drauf machen einfach weil eins einfach um die leute abzufacken einfach so direkt"}, {"id": 325, "start": 2757.08, "end": 2761.72, "text": "direkt hier in die mitte so ein fettes recapture dass man dann ab und zu mal hydranten oder"}, {"id": 326, "start": 2761.72, "end": 2770.04, "text": "fahrräder oder zebra streifen oder so ausfüllen muss keine ahnung weiß ich nicht so draw"}, {"id": 327, "start": 2770.04, "end": 2788.92, "text": "text ok test wir trauen auf mein was was zum ide write text format was was was will das"}, {"id": 328, "start": 2788.92, "end": 2796.52, "text": "von mir null wir sagen einfach null gibt es nicht und jetzt muss ich sagen wo das ganze"}, {"id": 329, "start": 2796.52, "end": 2805.32, "text": "wo das ganze hingeschrieben wird also oben links keine ahnung 200 200 das ist wieder"}, {"id": 330, "start": 2805.32, "end": 2816.68, "text": "richtig abartig gemacht der brush moment den haben wir doch hier irgendwie red oder oder"}, {"id": 331, "start": 2816.68, "end": 2821.88, "text": "black wie habe ich den haben wir nicht irgendwo eine farbe zum farbe malen schon gehabt wenn"}, {"id": 332, "start": 2821.88, "end": 2831.88, "text": "das nicht so übersichtlich eklig gemacht wäre dann brush ne haben wir nicht ok so jetzt"}, {"id": 333, "start": 2831.88, "end": 2846.04, "text": "jetzt wieder big brain wie macht man den kram brush create create solid color brush wunderbar"}, {"id": 334, "start": 2846.04, "end": 2858.6, "text": "color warum gibt es eigentlich color und color 4 ich mein color sind hier so ganz normale"}, {"id": 335, "start": 2858.6, "end": 2865.56, "text": "farben ok was ist color 4 ist genau der gleiche shit warum sollte ich denn warum gibt es"}, {"id": 336, "start": 2865.56, "end": 2881.48, "text": "color 4 und color color mit und ohne alpha verstehe ne ne brauchen wir nicht color black"}, {"id": 337, "start": 2881.48, "end": 2896.84, "text": "ich kann heute schreiben so und jetzt das kackt ab das geht so nett das geht das geht so garantiert"}, {"id": 338, "start": 2896.84, "end": 2907.56, "text": "dass das crash jetzt kann man bestimmt nicht null nicht null sein das war ja klar ok was"}, {"id": 339, "start": 2907.56, "end": 2916.04, "text": "muss da rein da gibt es doch bestimmt auf github hier ist noch mal dieses komische projekt"}, {"id": 340, "start": 2916.04, "end": 2930.72, "text": "was ich hier verwende für direkt x sample what is genau ok da brauche ich mal ich brauch"}, {"id": 341, "start": 2930.72, "end": 2939.92, "text": "da ein beispiel ich brauche da mal ein beispiel für wie das aussieht draw text super gibt"}, {"id": 342, "start": 2939.92, "end": 2954.12, "text": "es kein beispiel für perfekt oder ne gut dann brauche ich draw text example zeige"}, {"id": 343, "start": 2954.12, "end": 2961.6, "text": "hier ah die gute microsoft hilfe jetzt weiß man sofort bescheid konstwetscher ja string"}, {"id": 344, "start": 2961.6, "end": 2972.4, "text": "die was muss denn da was was brauche ich denn da ein e ein e d write text format wie wie"}, {"id": 345, "start": 2972.4, "end": 2985.2, "text": "funsta kram how to draw text ja das nee das das muss alles äußerst äußerst kompliziert"}, {"id": 346, "start": 2985.2, "end": 2993.8, "text": "sein damit nicht irgendjemand auf die idee kommt noch text text zu schreiben irgendwie"}, {"id": 347, "start": 2993.8, "end": 3005.52, "text": "draw text ok jetzt zeige uns ja microsoft wie das geht text format wo gibt es das hier"}, {"id": 348, "start": 3005.52, "end": 3010.24, "text": "das ist so obvios dass microsoft uns das noch nicht mal zeigen muss verstehe ach nee im"}, {"id": 349, "start": 3010.24, "end": 3024.84, "text": "moment das ist t++ create text format und dann ok create create text text format das"}, {"id": 350, "start": 3024.84, "end": 3029.72, "text": "macht mich fertig dieses direct 2d ist das eins der hässlichen hässlichsten frameworks"}, {"id": 351, "start": 3029.72, "end": 3037.28, "text": "mit denen ich jemals gemacht habe ich habe da ein video gesehen wegen programmieren"}, {"id": 352, "start": 3037.28, "end": 3049.44, "text": "einen guten sprach für den anfangen welches denn das letzte das mit algorithmen verstehen"}, {"id": 353, "start": 3049.44, "end": 3055.84, "text": "zusammen oder das ganz ganz alte ich überlege die ganze zeit ob ich mir go die ob ich mir"}, {"id": 354, "start": 3055.84, "end": 3061.0, "text": "go anschauen soll als sprache oder bei python bleiben soll was denkst du ist sinnvoll kommt"}, {"id": 355, "start": 3061.0, "end": 3066.04, "text": "auf an was du machen willst ist beides sinnvoll also sowohl go als auch python haben riesen"}, {"id": 356, "start": 3066.04, "end": 3072.52, "text": "hype die letzten jahre über du machst mit keinem was falsch es kommt darauf an was du"}, {"id": 357, "start": 3072.52, "end": 3078.52, "text": "machen willst du kannst natürlich prinzipiell in fast jeder programmier sprache fast alles"}, {"id": 358, "start": 3078.52, "end": 3083.2, "text": "machen aber es gibt halt es gibt halt schon ein paar vorzüge also ich würde sagen wenn"}, {"id": 359, "start": 3083.2, "end": 3088.92, "text": "du was im bereich sagen wir so ai machine learning machen willst dann eher python wenn"}, {"id": 360, "start": 3088.92, "end": 3094.16, "text": "du was in richtung was für sich wenn du mit irgendwelchen cloud tools oder sowas zu tun"}, {"id": 361, "start": 3094.16, "end": 3101.16, "text": "hast dann ist go eher das richtige oder wenn du möglichst eigenständig lauffähige anwendung"}, {"id": 362, "start": 3101.16, "end": 3107.92, "text": "haben willst da ist go auch wunderbar für wenn es dir um die geschwindigkeit geht dann"}, {"id": 363, "start": 3107.92, "end": 3112.4, "text": "prinzipiell go allerdings python je nachdem was du für eine library nimmst ist das auch"}, {"id": 364, "start": 3112.4, "end": 3118.0, "text": "schnell weil die library dann in c programmiert ist es halt die frage was du machen willst"}, {"id": 365, "start": 3118.0, "end": 3129.88, "text": "also das kann man so pauschal nicht sagen wir haben uns noch nichts überlegt wir haben"}, {"id": 366, "start": 3129.88, "end": 3138.48, "text": "uns noch nichts überlegt man kann mit python auch ohne probleme größere"}, {"id": 367, "start": 3138.48, "end": 3145.76, "text": "sachen weil wie gesagt ganze home assistant ist in python programmiert cringe alter wenn"}, {"id": 368, "start": 3145.76, "end": 3155.12, "text": "ich alles in assembler schreibt ja richtig cringe ziemlich cringe chat lochkarten nee"}, {"id": 369, "start": 3155.12, "end": 3163.36, "text": "rechenschieber komm jetzt also wenn wenn schon old school dann richtig dann dann rechenschieber"}, {"id": 370, "start": 3163.36, "end": 3184.68, "text": "aber aber kuss ja hier so programmieren die wahren profis"}, {"id": 371, "start": 3184.68, "end": 3187.88, "text": "ich will halt eine einfache syntax und halbwegs verständlich ebenfalls möchte ich halt das"}, {"id": 372, "start": 3187.88, "end": 3194.64, "text": "programmieren dann programmier weiter python weil die go syntax ist jetzt es ist die go"}, {"id": 373, "start": 3194.64, "end": 3199.68, "text": "syntax also syntax mäßig ja ist python ja meilenweit schöner als go und einfacher"}, {"id": 374, "start": 3199.68, "end": 3205.8, "text": "zu verstehen also wenn es dir nur ums lernen und die syntax geht dann bleib auf jeden fall"}, {"id": 375, "start": 3205.8, "end": 3209.2, "text": "bei python go ist sicherlich da nicht das schönste"}, {"id": 376, "start": 3209.2, "end": 3219.56, "text": "besten php und java man kann sich ja viel streiten aber dazu kann ich einfach sagen"}, {"id": 377, "start": 3219.56, "end": 3235.24, "text": "so nicht gerade das in kombinationen"}, {"id": 378, "start": 3235.24, "end": 3240.76, "text": "wie finde ich heraus ob fachinformatiker system gar nicht du guckst dir einfach die unternehmen"}, {"id": 379, "start": 3240.76, "end": 3245.88, "text": "an den ausbildungsplatz anbieten und suchst dir die raus die dir am besten gefallen"}, {"id": 380, "start": 3245.88, "end": 3254.4, "text": "scheiß drauf macht im prinzip machts am ende wenn dir der laden gefällt gar nicht so viel"}, {"id": 381, "start": 3254.4, "end": 3259.32, "text": "unterschied von dem was du was du kannst und natürlich prinzipiell kann man sagen klar"}, {"id": 382, "start": 3259.32, "end": 3264.28, "text": "die also die reine lehre wäre wenn du lieber sachen programmierst dann anwendungsentwickler"}, {"id": 383, "start": 3264.28, "end": 3269.08, "text": "wenn du lieber netzwerk oder administratorsachen machst dann fachinformatiker system integrieren"}, {"id": 384, "start": 3269.08, "end": 3273.8, "text": "aber wie gesagt je nach firma und einwendungsgebiet ist ist der übergang fließend"}, {"id": 385, "start": 3273.8, "end": 3283.16, "text": "echt gibt es das wirklich leute ahja gut jeder jeder jeder wie er das richtig hält"}, {"id": 386, "start": 3283.16, "end": 3295.84, "text": "die anlehnung von go an c sind ja nun wirklich nicht sonderlich sonderlich groß wie da sachen"}, {"id": 387, "start": 3295.84, "end": 3299.44, "text": "deklariert werden in welcher reinfolge irgendwas geschrien das hat überhaupt nichts mit c"}, {"id": 388, "start": 3299.44, "end": 3309.88, "text": "zu tun was mit der go syntax falsch ist das schlimmste ist schon mal dass die standardmäßig"}, {"id": 389, "start": 3309.88, "end": 3314.52, "text": "wollen dass man bei einem if else die klammern auf die gleichen zeilen auf die gleiche zeile"}, {"id": 390, "start": 3314.52, "end": 3320.96, "text": "macht das schon mal das geht schon mal das will ich net es nervt mich jedes mal wenn"}, {"id": 391, "start": 3320.96, "end": 3332.64, "text": "ich sehe dann hast du so sachen wie error codes und panic zusammen du hast keine du"}, {"id": 392, "start": 3332.64, "end": 3341.6, "text": "hast kein generics support er kommt jetzt irgendwann im jahr 2035 oder so mal dann hast du diese"}, {"id": 393, "start": 3341.6, "end": 3348.84, "text": "geschichte mit du kannst sachen mit wahr anlegen mit mit doppelpunkt gleich für gleich initialisieren"}, {"id": 394, "start": 3348.84, "end": 3366.52, "text": "also ich finde go hat schon so seine fallstrecke c++ na gut ist also c++ ist ja so das schlechte"}, {"id": 395, "start": 3366.52, "end": 3371.24, "text": "worum wir uns alle darauf einigen können dass es schlecht ist und alles alles ist besser"}, {"id": 396, "start": 3371.24, "end": 3387.16, "text": "als c++ sogar kobold ja klar warum nicht du hast mit mehr oder weniger allen halbwegs"}, {"id": 397, "start": 3387.16, "end": 3395.92, "text": "verbraucht verbreiteten sprachen eine chance muss halt gucken also wenn du jetzt in der"}, {"id": 398, "start": 3395.92, "end": 3402.36, "text": "region bist wo du bei jeder stellenanzeige siehst wir wollen pap und java haben natürlich"}, {"id": 399, "start": 3402.36, "end": 3407.04, "text": "ist dann sinnvoller wenn du dir mal pap und java anguckst aber man muss halt auch sagen"}, {"id": 400, "start": 3407.04, "end": 3414.92, "text": "wenn du eine sprache richtig gut kannst und vielleicht dir schon mal die ein oder anderen"}, {"id": 401, "start": 3414.92, "end": 3419.44, "text": "zusätzlichen sprachen anguckt hast du kommst in alles relativ schnell rein ich wie gesagt"}, {"id": 402, "start": 3419.44, "end": 3423.92, "text": "ich habe noch nie großartig java also direkt java jvm sachen habe ich schon programmiert"}, {"id": 403, "start": 3423.92, "end": 3427.48, "text": "aber ich habe noch nie java programmiert pap habe ich schon mal ein bisschen gemacht aber"}, {"id": 404, "start": 3427.48, "end": 3432.8, "text": "ich könnte mir das innerhalb von 1 2 wochen soweit angucken dass ich ja ohne probleme an"}, {"id": 405, "start": 3432.8, "end": 3441.4, "text": "sachen mit programmieren könnte aber ich habe gar keinen bock ich will gar kein java lernen"}, {"id": 406, "start": 3441.4, "end": 3452.32, "text": "das kommt auf den laden an wo man ist in die whatsapp gruppe natürlich snapchat snapchat"}, {"id": 407, "start": 3452.32, "end": 3465.64, "text": "wäre mir aber lieber ehrlich gesagt oder oder gleich only fans ja das stimmt die prüfung"}, {"id": 408, "start": 3465.64, "end": 3469.36, "text": "das siehst du allein schon bei den ihk prüfung dass da nicht großer unterschied ist ja es"}, {"id": 409, "start": 3469.36, "end": 3473.48, "text": "gibt es gibt teile den die machen teilen die machen aber der größte teil der prüfung"}, {"id": 410, "start": 3473.48, "end": 3481.72, "text": "ist die gleiche und macht kaum unterschied das würde ich so prinzipiell aussagen es"}, {"id": 411, "start": 3481.72, "end": 3486.0, "text": "gibt natürlich ausnahmen die die regeln bestätigen sowas wie rust ist halt wirklich massive big"}, {"id": 412, "start": 3486.0, "end": 3490.68, "text": "brain oder wenn dann einer anfängt mit sowas mit irgendwas funktionalem dann hört es halt"}, {"id": 413, "start": 3490.68, "end": 3497.52, "text": "erst mal auf so er lang oder oder oder oder noch schlimmer lisp alter wenn man möglichst"}, {"id": 414, "start": 3497.52, "end": 3501.84, "text": "viele klammern also das hier ich habe eh das gefühl das hier ist irgendwie ein gültiges"}, {"id": 415, "start": 3501.84, "end": 3513.64, "text": "er lang programm so das stimmt aber du bist aber so solche solche sachen wirst du in jeder"}, {"id": 416, "start": 3513.64, "end": 3518.6, "text": "sprache mehr oder weniger finden ja quasi strukturen die mehr oder weniger dem abbild"}, {"id": 417, "start": 3518.6, "end": 3525.52, "text": "im ram entsprechen kannst den rust auch machen und der rust style von so einem struct ist"}, {"id": 418, "start": 3525.52, "end": 3540.36, "text": "nur wirklich nicht seel ich schaffe es jetzt langsam mal da bin ich mal gespannt was mir"}, {"id": 419, "start": 3540.36, "end": 3545.8, "text": "bei go was mich bei go nervt ist das go mir sagen will was ich machen soll unused imports"}, {"id": 420, "start": 3545.8, "end": 3551.52, "text": "unused variable fack mich mega ab manchmal will ich einfach was einbinden ausprobieren"}, {"id": 421, "start": 3551.52, "end": 3555.44, "text": "mal kurz was auskommen den gucken ob es dann anders funktioniert und jedes mal muss ich"}, {"id": 422, "start": 3555.44, "end": 3559.12, "text": "den scheiß löschen und umkopieren weil goda meinung ist nein nein nein nein du darfst"}, {"id": 423, "start": 3559.12, "end": 3562.32, "text": "das jetzt nicht machen weil unused import nein nein das geht jetzt nicht du hast die"}, {"id": 424, "start": 3562.32, "end": 3566.8, "text": "variabler auskopieren auskommen hier nein unused variable das geht nicht das das nervt"}, {"id": 425, "start": 3566.8, "end": 3579.68, "text": "mich zu mir wurde mal gesagt was moment mal was zu mir wurde mal gesagt ich rede heute"}, {"id": 426, "start": 3579.68, "end": 3585.2, "text": "ein bisschen zu zu schnell beim lesen irgendwie zu mir wurde mal gesagt wird anwendungsentwickler"}, {"id": 427, "start": 3585.2, "end": 3590.88, "text": "denn einem entwickler traut man eher systemer sachen zu als andersrum da kennst du aber"}, {"id": 428, "start": 3590.88, "end": 3596.76, "text": "die meisten entwickler bei uns nicht den würde ich mal alles zutrauen aber bloß keine system"}, {"id": 429, "start": 3596.76, "end": 3603.72, "text": "oder netzwerkgeschichten habe ich euch schon von dem ja habe ich euch ich habe euch von"}, {"id": 430, "start": 3603.72, "end": 3609.36, "text": "dem anwendungsentwickler erzählt der wollte dass ich in den key value store zwei values"}, {"id": 431, "start": 3609.36, "end": 3615.24, "text": "hinterlege oder für einen key und der ist nicht eingesehen hat dass ich ihm erklärt"}, {"id": 432, "start": 3615.24, "end": 3621.12, "text": "habe dass es nicht funktioniert ja also für für also für alle die es nicht mitgekriegt"}, {"id": 433, "start": 3621.12, "end": 3627.96, "text": "haben es hat bei uns jemand angefragt ob ich in einen key value store für ihn ein paar"}, {"id": 434, "start": 3627.96, "end": 3635.12, "text": "werte also ein paar werte updaten kann oder neue neue neue neue werte reinschreiben kann"}, {"id": 435, "start": 3635.12, "end": 3639.84, "text": "okay ja klar kein problem was willst du haben und da meint er bei mir so ja er will key a"}, {"id": 436, "start": 3639.84, "end": 3648.08, "text": "b c und bei jedem müssen dann halt zwei werte rein das ist das ist ein key value store es"}, {"id": 437, "start": 3648.08, "end": 3653.68, "text": "gibt einen key und ein value dazu das funktioniert so nicht was ich machen kann ist ich kann"}, {"id": 438, "start": 3653.68, "end": 3657.88, "text": "da eine jason array reinschreiben und du passt dann selbst deine zwei values raus nein das"}, {"id": 439, "start": 3657.88, "end": 3662.56, "text": "will ich nicht ich will zwei werte zurückbekommen das geht aber nicht du kannst zu einem key"}, {"id": 440, "start": 3662.56, "end": 3668.28, "text": "nur ein value speichern oder ein text beziehungsweise in dem fall sogar es ist sogar nur text text"}, {"id": 441, "start": 3668.28, "end": 3674.96, "text": "only also das geht nicht funktioniert nicht ich meine ich kann dir die keys durchnummerieren"}, {"id": 442, "start": 3674.96, "end": 3679.48, "text": "ich kann dir die keys durchnummerieren a 1 a 2 und dann wird nein ich will zwei werte"}, {"id": 443, "start": 3679.48, "end": 3682.52, "text": "haben ich habe es dann ich habe es dann irgendwann irgendwann aufgegeben ich habe dann gesagt"}, {"id": 444, "start": 3682.52, "end": 3688.76, "text": "entweder ich schreibe den jason array rein oder irgendwas oder gar nichts oder csv rein"}, {"id": 445, "start": 3688.76, "end": 3696.0, "text": "genau alles möglich kannst auch ein jammel reinschreiben oder oder einen oder ein tommel"}, {"id": 446, "start": 3696.0, "end": 3705.92, "text": "oder ein ini file oder kannst alles so langs text ist reinschreiben kratz easy abschlussprüfung"}, {"id": 447, "start": 3705.92, "end": 3710.48, "text": "oder hast du auch deine mündliche abschlussprüfung gemacht schon also bist du jetzt komplett"}, {"id": 448, "start": 3710.48, "end": 3715.56, "text": "durch also hast du quasi bist du seit heute offiziell fachinformatik anwendungsentwicklung"}, {"id": 449, "start": 3715.56, "end": 3721.04, "text": "oder hast du die mündliche prüfung die die schriftliche prüfung geschafft also was"}, {"id": 450, "start": 3721.04, "end": 3728.32, "text": "ist richtig big brain ich verstehe was oop ist aber was ist eigentlich funktionale programmierung"}, {"id": 451, "start": 3728.32, "end": 3734.28, "text": "funktionale programmierung ist für alle matte studenten oder matte professoren die big brain"}, {"id": 452, "start": 3734.28, "end": 3758.64, "text": "software programmieren wollen"}, {"id": 453, "start": 3758.64, "end": 3763.0, "text": "ja ist echt der wahnsinn so also machen wir mal weiter wo sind wir stehen geblieben wie"}, {"id": 454, "start": 3763.0, "end": 3779.36, "text": "funktioniert das jetzt hier mit dem text right factory was so ein geier"}, {"id": 455, "start": 3779.36, "end": 3784.0, "text": "was muss ich machen dass ich dass ich text ausgeben kann das kann auch nicht so schwierig"}, {"id": 456, "start": 3784.0, "end": 3795.0, "text": "sein factory irgendwas mit factory wir haben schon hier factories erstellt hier create"}, {"id": 457, "start": 3795.0, "end": 3804.76, "text": "create factory alles klar mache ich jetzt kann muss ich aber nur einmal erstellen das"}, {"id": 458, "start": 3804.76, "end": 3816.56, "text": "hier muss ich auch nur einmal erstellen sonst memory leak am start ok ich habe keine ahnung"}, {"id": 459, "start": 3816.56, "end": 3839.96, "text": "right factory create right nee ach du scheiße right factory ja factory create nee ach du"}, {"id": 460, "start": 3839.96, "end": 3845.28, "text": "große kacke wie geht das create nee meine güte wie habe ich das denn da oben nochmal"}, {"id": 461, "start": 3845.28, "end": 3856.24, "text": "gemacht factory ist ja fast wie ein java so so habe ich die eine hier erstellt und wie"}, {"id": 462, "start": 3856.24, "end": 3865.12, "text": "er ok ok also so so konnte man das eine erstellt und wie geht das jetzt hier create nee factory"}, {"id": 463, "start": 3865.12, "end": 3879.0, "text": "eins nee ich habe keine ahnung wie das funktioniert ich will einfach text schreiben alter please"}, {"id": 464, "start": 3879.0, "end": 3891.88, "text": "lass mich doch einfach nur text hinschreiben microsoft ach komm mal hier da so so ah welches"}, {"id": 465, "start": 3891.88, "end": 3897.32, "text": "programm das hier du meinst die idee das ist rider von das ist die chat brains c-sharp"}, {"id": 466, "start": 3897.32, "end": 3903.68, "text": "idee was lustig ist dass man java idee hat für c-sharp zu programmieren warum warum"}, {"id": 467, "start": 3903.68, "end": 3926.96, "text": "nicht ja factory ok bam geht das jetzt was factory type was will er denn von mir haben"}, {"id": 468, "start": 3926.96, "end": 3944.44, "text": "ok factory type ok einfach einfach so wir probieren es jetzt einfach einfach aus was"}, {"id": 469, "start": 3944.44, "end": 3948.68, "text": "mich ja auch immer übelst verwirrt bei diesem direct x zeug warum gibt es warum gibt es"}, {"id": 470, "start": 3948.68, "end": 3953.8, "text": "factory 123 4567 ich meine klar ich weiß die haben mit factory angefangen und irgendwann"}, {"id": 471, "start": 3953.8, "end": 3958.2, "text": "eine neue funktion hinzugefügt aber das ist so hardcore unübersichtung unübersichtig"}, {"id": 472, "start": 3958.2, "end": 3962.72, "text": "ist rider visual studio vorzuziehen ist ein bisschen geschmackssache ich verwende rider"}, {"id": 473, "start": 3962.72, "end": 3968.16, "text": "weil ich hauptsächlich unter linux programmier und da gibt es halt nur rider als idee und"}, {"id": 474, "start": 3968.16, "end": 3972.92, "text": "der chat hat das letzte mal gemeint nimm doch einfach auch unter windows habe ich weiter"}, {"id": 475, "start": 3972.92, "end": 3977.76, "text": "auch unter windows ansonsten habe ich unter windows eigentlich immer visual studio verwendet"}, {"id": 476, "start": 3977.76, "end": 3984.48, "text": "so right factory moment moment das war es ja noch nicht das war es ja nicht jetzt muss"}, {"id": 477, "start": 3984.48, "end": 3997.6, "text": "ich jetzt muss ich noch anlegen ein textformat anlegen ok create textformat font family name"}, {"id": 478, "start": 3997.6, "end": 4008.16, "text": "oh nee areal areal da weiß ich auf jeden fall dass es drauf font size 30 dass man das auch"}, {"id": 479, "start": 4008.16, "end": 4016.56, "text": "ordentlich sieht das ist kein string 30 so textformat was man dafür was man das ja muss"}, {"id": 480, "start": 4016.56, "end": 4023.48, "text": "ich ja echt ins bein ausreißen dass man hier text ausgeben darf so meint ihr es funktioniert"}, {"id": 481, "start": 4023.48, "end": 4029.32, "text": "ich jetzt dass jetzt oben links in der ecke test steht ich habe so meine zweifel dass"}, {"id": 482, "start": 4029.32, "end": 4037.0, "text": "das funktioniert aber wir werden es gleich sehen tatsächlich funktioniert kommt mal"}, {"id": 483, "start": 4037.0, "end": 4047.8, "text": "da test bäm funktioniert tatsächlich hätte ich nicht gedacht gut weiter dann muss ich"}, {"id": 484, "start": 4047.8, "end": 4063.36, "text": "diesen ganzen mist hier in der schleife machen und jetzt kann ich die fps ausgeben jetzt"}, {"id": 485, "start": 4063.36, "end": 4073.2, "text": "kann ich die fps ausgeben das muss übrigens umgedreht sein so achso true string so und"}, {"id": 486, "start": 4073.2, "end": 4081.48, "text": "jetzt sollte ich die fps da oben drinne stehen haben oh mal da funktioniert aber nicht warum"}, {"id": 487, "start": 4081.48, "end": 4088.04, "text": "nicht ich glaube ich habe das übelste memory leak ach nee das kann ja nicht funktionieren"}, {"id": 488, "start": 4088.04, "end": 4092.84, "text": "ich zähle ich zähle hier hoch ich zähle ist ja schwachsinn funktioniert ja so gar nicht"}, {"id": 489, "start": 4092.84, "end": 4100.08, "text": "was was ich da mache das funktioniert überhaupt nicht das da darf ich quasi nur hier drinne"}, {"id": 490, "start": 4100.08, "end": 4109.16, "text": "machen aber dann überschreibt es jedes mal oder muss das zwischenspeichern ja nee das"}, {"id": 491, "start": 4109.16, "end": 4113.68, "text": "ist miss das funktioniert nicht weil ich muss mal kurz checken ob ich nicht irgendwie super"}, {"id": 492, "start": 4113.68, "end": 4124.0, "text": "hardcore memory leak am start habe ich habe das gefühl irgendwie dass das ziemlich hart"}, {"id": 493, "start": 4124.0, "end": 4131.56, "text": "memory leak gerade setz mal gucken wir mal kurz in visual studio rein ob das memory leaked"}, {"id": 494, "start": 4131.56, "end": 4143.96, "text": "nee gar nicht mal so also bisschen memory leak aber wir können auch mal warten bis"}, {"id": 495, "start": 4143.96, "end": 4147.92, "text": "bis sich das eingependelt hat vielleicht also ich würde sagen ein bisschen memory leak"}, {"id": 496, "start": 4147.92, "end": 4160.4, "text": "tut es aber mal gucken vielleicht pendelt sich das auch ein nee es scheint nicht memory"}, {"id": 497, "start": 4160.4, "end": 4170.2, "text": "zu leaken das muss sich einfach warm laufen ok wunderbar ich habe keine memory leaks produziert"}, {"id": 498, "start": 4170.2, "end": 4182.2, "text": "das ist schon mal nice mach rot das ist eine gute idee wo siehst du den leak prinzip prät"}, {"id": 499, "start": 4182.2, "end": 4188.72, "text": "naja da neben den ram verbrauch du siehst neben den ram verbrauch und wenn der ram verbrauch"}, {"id": 500, "start": 4188.72, "end": 4194.48, "text": "hat ich zeigst dir mal moment ich zeigst dir mal ich zeigst dir mal memory leak moment"}, {"id": 501, "start": 4194.48, "end": 4208.0, "text": "memory leak ach moment dann funktioniert das ja nicht pass mal auf memory leak du wirst"}, {"id": 502, "start": 4208.0, "end": 4217.96, "text": "direkt sehen dass es memory liegt fällt dir was auf 5 gigabyte ram verbrauch ich meine"}, {"id": 503, "start": 4217.96, "end": 4224.68, "text": "das ist jetzt ein äußerst offensichtliches ja oftmals sind die dinger deutlich subtiler"}, {"id": 504, "start": 4224.68, "end": 4231.84, "text": "und man sieht die nicht so nicht so wirklich übrigens auch wieder bester variable namen"}, {"id": 505, "start": 4231.84, "end": 4236.4, "text": "natürlich hier am start ok wir haben kein memory leak fabriziert das ist doch schon"}, {"id": 506, "start": 4236.4, "end": 4247.6, "text": "mal nice ok was aber wir sollen den text den text rot machen das mache ich hallo red"}, {"id": 507, "start": 4247.6, "end": 4258.04, "text": "oh guck mal krass guck mal rider ist echt big brain seht ihr das rider ist richtig"}, {"id": 508, "start": 4258.04, "end": 4263.76, "text": "big brain er zeigt sogar die farbe unten drunter an welches genau ist welcher ton das ist wirklich"}, {"id": 509, "start": 4263.76, "end": 4275.04, "text": "cool cool gemacht ok das funktioniert nicht so wie ich mir das gedacht habe ich muss noch"}, {"id": 510, "start": 4275.04, "end": 4282.2, "text": "irgendwie den counter zwischen zwischen speichern tempe als beste verdammung aller Zeiten wieder"}, {"id": 511, "start": 4282.2, "end": 4301.12, "text": "am start da weißt du bescheid weißt sofort was sache ist was jetzt temp ist already defined"}, {"id": 512, "start": 4301.12, "end": 4307.76, "text": "anzeige ist raus pass mal auf tempe 2"}, {"id": 513, "start": 4307.76, "end": 4333.16, "text": "guck mal da huge fps counter"}, {"id": 514, "start": 4333.16, "end": 4345.28, "text": "monospace font da hast du recht areal sagt was ist in monospace font kann man kann man"}, {"id": 515, "start": 4345.28, "end": 4348.16, "text": "windows überreden dass er monospace macht wenn man das so angibt"}, {"id": 516, "start": 4348.16, "end": 4359.48, "text": "oder was passiert denn eigentlich wenn ich von family weglasse kack es dann ab dann macht"}, {"id": 517, "start": 4359.48, "end": 4373.04, "text": "der default du bist der einzige der kanton hat ja"}, {"id": 518, "start": 4373.04, "end": 4390.84, "text": "solas ist das standard mich installiert jetzt hier guck mal exquisite der kommt mit dem"}, {"id": 519, "start": 4390.84, "end": 4409.72, "text": "wies und ein bisschen durcheinander ok hier high performance gif player ok also das mit"}, {"id": 520, "start": 4409.72, "end": 4414.04, "text": "fps funktioniert das ist übrigens ein ziemlich schlechter fps counter das stimmt überhaupt"}, {"id": 521, "start": 4414.04, "end": 4420.2, "text": "nicht wenn das hier beispielsweise länger braucht eigentlich müsste ich sagen ich ich"}, {"id": 522, "start": 4420.2, "end": 4426.4, "text": "nehme die anzahl geteilt durch durch die sekunden oder sowas nee nee moment sekunden durch die"}, {"id": 523, "start": 4426.4, "end": 4429.04, "text": "anzahl anzahl durch sekunden mein ich bin jetzt verwirrt"}, {"id": 524, "start": 4429.04, "end": 4437.6, "text": "nee anzahl durch durch durch sekunden"}, {"id": 525, "start": 4437.6, "end": 4444.0, "text": "der macht einen double draus mein wegen wenn der wenn sie lieber ist"}, {"id": 526, "start": 4444.0, "end": 4451.28, "text": "nee das geht nicht dann ist temp dann wird temp 2 jetzt im double das ist so das ist"}, {"id": 527, "start": 4451.28, "end": 4461.76, "text": "so wahnsinnig hübscher hübscher code hier gibt es nix best practice komplett alles"}, {"id": 528, "start": 4461.76, "end": 4472.4, "text": "alles best practice ok meine logik ist nicht richtig meine logik ist auf jeden fall nicht"}, {"id": 529, "start": 4472.4, "end": 4480.08, "text": "korrekt was mache ich was mache ich verkehrt"}, {"id": 530, "start": 4480.08, "end": 4509.6, "text": "fps durch gesamte sekunden ah vor restart tatsächlich ja null halt rum ok das funktioniert"}, {"id": 531, "start": 4509.6, "end": 4524.84, "text": "der zeilen umbruchts nur hier das das funktioniert es ist realistischer alles klar so das ist"}, {"id": 532, "start": 4524.84, "end": 4543.88, "text": "das ist mega hässlich wie konnte man den kram noch mal runden wobei lull das ist so"}, {"id": 533, "start": 4543.88, "end": 4546.44, "text": "hässlich dann schadet es nichts wenn es jetzt auch noch ein bisschen hässlicher wird"}, {"id": 534, "start": 4546.44, "end": 4567.68, "text": "easy life genauer ok wunderbar jetzt haben wir unseren fps counter eigentlich das unsinnigste"}, {"id": 535, "start": 4567.68, "end": 4571.36, "text": "aller Zeiten zumal das wahrscheinlich an der stelle auch wieder weg muss wie bin er"}, {"id": 536, "start": 4571.36, "end": 4577.64, "text": "wie sind wir das drauf gekommen das ist eigentlich nicht das was ich machen wollte heute oder"}, {"id": 537, "start": 4577.64, "end": 4585.76, "text": "wahrscheinlich nicht also wie sind ausgeschaltet und fps counter super dass das hat die welt"}, {"id": 538, "start": 4585.76, "end": 4589.68, "text": "das hat die welt gebraucht vielleicht sollten wir mal anfangen das ordentlich zu machen"}, {"id": 539, "start": 4589.68, "end": 4595.04, "text": "sonst blickt doch da echt keine sauma durch mal kurz runter auf 60 fps ob das funktioniert"}, {"id": 540, "start": 4595.04, "end": 4624.36, "text": "achso auf 30 werde mit warum auf 30 16 millisekunden sind eigentlich 60 fps ok ich ich ich ich"}, {"id": 541, "start": 4624.36, "end": 4629.64, "text": "ich kucke nicht wie lange der kram hier oben dauert aber der kann er nicht so lange dauern"}, {"id": 542, "start": 4629.64, "end": 4641.44, "text": "sind sind der restliche kot ich kann mir nicht vorstellen dass er 16 millisekunden verballert"}, {"id": 543, "start": 4641.44, "end": 4655.76, "text": "das das dann können wir dann würde der nicht rennen dann mit 1000 fps sonst es ist doch"}, {"id": 544, "start": 4655.76, "end": 4677.52, "text": "60 fps 16 millisekunden oder ja und 60 millisekunden sind dann 16 fps ne das das funktioniert halbwegs"}, {"id": 545, "start": 4677.52, "end": 4686.04, "text": "ok das das was ich hier was ich hier mache funktioniert so nicht warum muss ich das doppelt"}, {"id": 546, "start": 4686.04, "end": 4699.32, "text": "so schnell machen dass es das schafft die stopwatch zählt nicht wenn der thread sleep"}, {"id": 547, "start": 4699.32, "end": 4709.96, "text": "das ist eine wirklich gute frage ich habe keine ahnung wenn ich ehrlich bin zählt"}, {"id": 548, "start": 4709.96, "end": 4718.12, "text": "die stopwatch nicht wenn der thread sleep das würde es zumindest teilweise erklären"}, {"id": 549, "start": 4718.12, "end": 4732.8, "text": "ja ich weiß nicht warum das hier nicht funktioniert aber macht macht auch kein unterschied weil"}, {"id": 550, "start": 4732.8, "end": 4741.36, "text": "eigentlich müssen wir das eh jetzt aufräumen stack overflow wieder am start stack overflow"}, {"id": 551, "start": 4741.36, "end": 4759.92, "text": "aus der overflow am start aha alles klar macht es nicht tagsdelay könnte ich genauso gut"}, {"id": 552, "start": 4759.92, "end": 4766.0, "text": "verwenden das ist mega hässlich das lasse ich eh nicht so das müssen wir jetzt langsam"}, {"id": 553, "start": 4766.0, "end": 4770.48, "text": "mal anfangen ordentlich zu machen weiß nicht ob ich da heute die brain kapazität dafür"}, {"id": 554, "start": 4770.48, "end": 4774.36, "text": "habe das ordentlich zu machen also lassen wir überlegen wir haben ein fps counter ist"}, {"id": 555, "start": 4774.36, "end": 4782.8, "text": "schon mal wunderbar du hast recht hier eigentlich eigentlich ist das bescheuert eigentlich müsste"}, {"id": 556, "start": 4782.8, "end": 4787.68, "text": "ich hier die stopwatch hier müsste ich die stopwatch machen und jetzt mal gucken wie"}, {"id": 557, "start": 4787.68, "end": 4802.76, "text": "lang der wie lang der durchlauf braucht und das dann abziehen von dem was ich liebe"}, {"id": 558, "start": 4802.76, "end": 4820.08, "text": "wie lang braucht denn das ganze hier so ein schleifen durchlauf wie da brauchen das"}, {"id": 559, "start": 4820.08, "end": 4844.32, "text": "braucht es denn so das wird nicht lange sein sind das drei millisekunden ne ach du scheiße"}, {"id": 560, "start": 4844.32, "end": 4860.76, "text": "das ist das lautet was 30 warum dauert das denn so lang 30 das kann doch gar nicht sein"}, {"id": 561, "start": 4860.76, "end": 4888.68, "text": "ach so ah hier restart null ah das sieht schon besser aus"}, {"id": 562, "start": 4888.68, "end": 4893.64, "text": "die bagge das ist eine gute idee wobei ich nicht glaube dass das einen großen unterschied"}, {"id": 563, "start": 4893.64, "end": 4911.36, "text": "machen wird was control f5 war ein bisschen wo ist da meine mein denkfehler mit dem sleep"}, {"id": 564, "start": 4911.36, "end": 4919.64, "text": "kann das sein dass das lieb einfach nicht genau doch das müsste genau genug sein ok"}, {"id": 565, "start": 4919.64, "end": 4926.6, "text": "ich habe keine ahnung woran das liegt aber drei millisekunden sind trotzdem ganz schön"}, {"id": 566, "start": 4926.6, "end": 4943.32, "text": "lang ich meine die code den kram sleep hier noch irgendwo anders ich habe keine ahnung"}, {"id": 567, "start": 4943.32, "end": 4950.8, "text": "ich glaube meine fps berechnung stimmt nicht ich glaube meine fps berechnung ist einfach"}, {"id": 568, "start": 4950.8, "end": 4963.84, "text": "trash es fack aber eigentlich will ich mich damit jetzt gar nicht aufhalten denn das bleibt"}, {"id": 569, "start": 4963.84, "end": 4966.36, "text": "eh nicht so sondern wir müssen das jetzt mal langsam anfangen ein bisschen ordentlich"}, {"id": 570, "start": 4966.36, "end": 4972.04, "text": "zu machen ich blicke nicht mehr durch könntest du das encode nicht machen während du das"}, {"id": 571, "start": 4972.04, "end": 4981.36, "text": "decoden ich encode nix ich könnte das multithreaded machen aber ich glaube nicht dass es ein riesen"}, {"id": 572, "start": 4981.36, "end": 4989.32, "text": "irgendwie riesen auswirkung hat weil das direkt x zeug ist so schnell gemalt ob ich da vom"}, {"id": 573, "start": 4989.32, "end": 4995.44, "text": "multithreading groß profitiere keine ahnung so wir müssen jetzt leute wir müssen es jetzt"}, {"id": 574, "start": 4995.44, "end": 4998.6, "text": "mal ein bisschen bisschen bisschen schöner machen ich muss mal kurz in mich gehen ob"}, {"id": 575, "start": 4998.6, "end": 5010.44, "text": "ich da heute abend noch genug brain für hab oder nicht wir müssen eigentlich auch noch"}, {"id": 576, "start": 5010.44, "end": 5021.56, "text": "auch noch auch noch einschneiden dass man das resizing kann multithreaded render target"}, {"id": 577, "start": 5021.56, "end": 5030.0, "text": "das wäre in dem fall kein problem weil ich nach wie vor nur aus einem thread machen würde"}, {"id": 578, "start": 5030.0, "end": 5034.08, "text": "also ich würde ich würde dass er nur noch nur in einem spread render aber ich würde"}, {"id": 579, "start": 5034.08, "end": 5041.44, "text": "halt das bild halt ab und zu mal updaten was gerendert wird das bringt das bringt glaube"}, {"id": 580, "start": 5041.44, "end": 5046.72, "text": "ich nix so also wir müssen das jetzt irgendwie ein bisschen ordentlich machen ich bin gerade"}, {"id": 581, "start": 5046.72, "end": 5057.68, "text": "am überlegen ob ich das heute big brain technisch mache oder nicht aber warum brauche ich denn"}, {"id": 582, "start": 5057.68, "end": 5067.92, "text": "drei ich mein drei millisekunden ist ganz schön lang ein drei millisekunden ist viel"}, {"id": 583, "start": 5067.92, "end": 5077.88, "text": "was braucht denn hier die drei millisekunden zeigt mal her ich mache das gerade mal wieder"}, {"id": 584, "start": 5077.88, "end": 5091.08, "text": "rein was braucht denn hier eigentlich die drei millisekunden das liegt nicht da dran"}, {"id": 585, "start": 5091.08, "end": 5101.72, "text": "das liegt daran was verbraucht denn hier eigentlich die drei millisekunden das die code vom gif"}, {"id": 586, "start": 5101.72, "end": 5114.56, "text": "ja das die code vom gif der task läuft ja permanent das macht nix dass die code vom"}, {"id": 587, "start": 5114.56, "end": 5130.4, "text": "gif braucht drei millisekunden aber warum warum braucht das die code vom gif drei millisekunden"}, {"id": 588, "start": 5130.4, "end": 5134.88, "text": "ich meine es ist ziemlich ziemlich bescheuert wie ich es mache ich lese das von ich lese"}, {"id": 589, "start": 5134.88, "end": 5141.52, "text": "frame frame by frame von der platte die code das dann das ist das eigentliche problem dass"}, {"id": 590, "start": 5141.52, "end": 5146.64, "text": "die code ist ich könnte wetten dass die code ist nicht das problem sondern das einlesen"}, {"id": 591, "start": 5146.64, "end": 5157.6, "text": "von der platte ist das problem es ist ernsthaft dass die code was drei millisekunden braucht"}, {"id": 592, "start": 5157.6, "end": 5162.6, "text": "das hätte ich im leben nicht gedacht dass man drei millisekunden braucht um den um"}, {"id": 593, "start": 5162.6, "end": 5173.24, "text": "den gif frame zu decoden krass da kann ich aber da nicht viel dran ändern also das hier"}, {"id": 594, "start": 5173.24, "end": 5183.72, "text": "ist wirklich das was die zeit frisst gif decoden ja gut das machst du nix dann ist das halt"}, {"id": 595, "start": 5183.72, "end": 5196.08, "text": "so da kann ich da kann ich nix dran ändern alter meine variable benahmung es ist so schlecht"}, {"id": 596, "start": 5196.08, "end": 5200.32, "text": "es ist so hässlich das darfst du keinem zeigen das werde ich definitiv nicht auf shithub"}, {"id": 597, "start": 5200.32, "end": 5207.12, "text": "posten dafür musst du dich erschämen gif in den ram laden doch doch geht aber bringt"}, {"id": 598, "start": 5207.12, "end": 5218.84, "text": "nix ffmpeg overhead warum sollte ffmpeg overhead sein du brauchst irgendwas was dein gif decode"}, {"id": 599, "start": 5218.84, "end": 5224.24, "text": "in dem fall ist es halt ffmpeg also ich würde jetzt eine notwendige komponente nicht unbedingt"}, {"id": 600, "start": 5224.24, "end": 5237.88, "text": "overhead nehmen nennen es wird jedes bild immer wieder neu decoded ja aber das macht"}, {"id": 601, "start": 5237.88, "end": 5242.36, "text": "also dass die code ist wirklich das problem klar ich könnte mir das gif einmal merken"}, {"id": 602, "start": 5242.36, "end": 5247.76, "text": "aber das ist egal das macht jetzt nix das drei millisekunden sind nicht wild aber aber"}, {"id": 603, "start": 5247.76, "end": 5255.0, "text": "ich hätte nicht gedacht dass das decoden eines einzelnen low res gif bildes drei millisekunden"}, {"id": 604, "start": 5255.0, "end": 5266.76, "text": "braucht naja gut ist dann halt so immer noch immer noch besser immer noch schneller als"}, {"id": 605, "start": 5266.76, "end": 5285.68, "text": "das hier guckt euch das mal immer noch schneller als das hier hab das gesehen das ist ein lahm"}, {"id": 606, "start": 5285.68, "end": 5293.12, "text": "ffack das sind drei sekunden nicht drei millisekunden probier es mal mit dem gif mache ich"}, {"id": 607, "start": 5293.12, "end": 5320.24, "text": "ich kann das doch einfach dann ist es einfacher für mich kann das hier"}, {"id": 608, "start": 5320.24, "end": 5340.64, "text": "kann das hier oben resetten so dauert wirklich es dauert wirklich drei sekunden äh drei"}, {"id": 609, "start": 5340.64, "end": 5344.64, "text": "millisekunden äh wo habe ich denn dieses gif hier um das dann mal auszuprobieren mit"}, {"id": 610, "start": 5344.64, "end": 5354.8, "text": "sack wo liegt denn das champing wo liegt das champing gif weiß ich doch jetzt nicht wo"}, {"id": 611, "start": 5354.8, "end": 5365.76, "text": "könnte memes zwei vielleicht ne moment wo liegt wo liegt dann dieses komische programm"}, {"id": 612, "start": 5365.76, "end": 5374.32, "text": "die sagen wo web application elf wo liegt die denn hier hier web application elf web"}, {"id": 613, "start": 5374.32, "end": 5387.32, "text": "application elf alles klar bbb root content da ist es so sieht jemand sieht jemand ist"}, {"id": 614, "start": 5387.32, "end": 5402.96, "text": "es das das ist es das wollen wir haben gif gif mal gucken wie lang das braucht"}, {"id": 615, "start": 5402.96, "end": 5409.12, "text": "beste namen das ist absicht dass sie nicht kollidieren"}, {"id": 616, "start": 5409.12, "end": 5421.32, "text": "ne naja ok das ist das ist ein ticken langsamer noch aber trotzdem warum ist das überhaupt"}, {"id": 617, "start": 5421.32, "end": 5433.92, "text": "zu langsam vier sekunden zum zikauen von dem gif ja das ist halt high res high res"}, {"id": 618, "start": 5433.92, "end": 5454.44, "text": "high iq gif auch halt ein bisschen aber das red sleep ist in dem fall egal ich meine"}, {"id": 619, "start": 5454.44, "end": 5458.68, "text": "ich ich mache ich mache thread sleep mal weg aber ich resette die stopwatch ja oben das"}, {"id": 620, "start": 5458.68, "end": 5480.2, "text": "sollte überhaupt keinen unterschied machen da wird sie ja schlecht bei"}, {"id": 621, "start": 5480.2, "end": 5507.84, "text": "champ ist tatsächlich schneller warum warum ist das schneller das macht doch überhaupt"}, {"id": 622, "start": 5507.84, "end": 5518.88, "text": "keinen sinn ich restarte das hier oben und da ist es null das ist doch egal ob ich da"}, {"id": 623, "start": 5518.88, "end": 5540.68, "text": "unten sleep oder nicht ich sleep jetzt mal keine 800 ich blick nicht mehr durch was hat"}, {"id": 624, "start": 5540.68, "end": 5546.2, "text": "das warum hat das überhaupt ein fluster drauf was habe ich habe irgendwo was total bescheuert"}, {"id": 625, "start": 5546.2, "end": 5553.48, "text": "das programmiert das kann überhaupt nicht sein stopwatch soll hier wird die restartet"}, {"id": 626, "start": 5553.48, "end": 5560.28, "text": "denn ich nenne die magischheit hier wird die restartet und hier wird die zeit ausgegeben"}, {"id": 627, "start": 5560.28, "end": 5580.84, "text": "ich war mal ein stopp vorher bin ich bin hochgradig verwirrt was das da mit dem rest zu tun haben"}, {"id": 628, "start": 5580.84, "end": 5595.16, "text": "soll äußerst äußerst verwirrt was das eine mit dem anderen zu tun haben soll restart"}, {"id": 629, "start": 5595.16, "end": 5606.6, "text": "und ausgeben da hat doch da hat auch in den strand sleep und nichts mit zu tun und selbst"}, {"id": 630, "start": 5606.6, "end": 5610.32, "text": "wenn jetzt kontext switching bla was auch immer ich meine ich mache es ja hier in diesem"}, {"id": 631, "start": 5610.32, "end": 5615.32, "text": "schleifen durchlauf ach keine ahnung dass wir jetzt zu big brain ich glaube wir scheißen"}, {"id": 632, "start": 5615.32, "end": 5619.88, "text": "einfach optimierung auf die optimierung hier in diesem ding ich mache das dann mal ordentlich"}, {"id": 633, "start": 5619.88, "end": 5626.44, "text": "dann kann man nämlich auch verstehen was was ich da programmiert habe das ist aber nicht"}, {"id": 634, "start": 5626.44, "end": 5633.76, "text": "sehr clean ne das ist das ist die neue das ist der neue trend nach clean code kommt trash"}, {"id": 635, "start": 5633.76, "end": 5640.0, "text": "code weil die leute erkannt haben clean code dauert zu lang und es ist wichtig dass man"}, {"id": 636, "start": 5640.0, "end": 5644.72, "text": "prototypen möglichst schnell abliefert das heißt ab jetzt werde ich auf jedem talk auf"}, {"id": 637, "start": 5644.72, "end": 5649.52, "text": "jeder konferenz wo ich hingehe und meine talks halte werde ich trash code propagieren"}, {"id": 638, "start": 5649.52, "end": 5670.76, "text": "so machen wir das demnächst könnt ihr demnächst könnt ihr tickets gewinnen im stream das"}, {"id": 639, "start": 5670.76, "end": 5678.84, "text": "genie beherrscht das sage ich auch immer genauso wie mein desktop leute sagen immer das ist"}, {"id": 640, "start": 5678.84, "end": 5684.32, "text": "unaufräumt blickt keiner durch aber in wirklichkeit muss man einfach nur suchen können und wissen"}, {"id": 641, "start": 5684.32, "end": 5686.16, "text": "wo was ist dann findet man auch alles sofort"}, {"id": 642, "start": 5686.16, "end": 5715.44, "text": "also ich würde sagen es ist auf jeden fall best practice mein code gerade vor allem mit"}, {"id": 643, "start": 5715.44, "end": 5724.64, "text": "sicherheit auch direkt direkt x best practice es best praktiziert ohne ende hier komplettes"}, {"id": 644, "start": 5724.64, "end": 5732.16, "text": "komplettes best practice aus dem eitel buch einer hat mit dem anderen überhaupt gar nichts"}, {"id": 645, "start": 5732.16, "end": 5744.24, "text": "zu tun aber egal safe ist das safe safe und wie heißt dieses andere agile zeug ach ich"}, {"id": 646, "start": 5744.24, "end": 5754.4, "text": "habe schon wieder vergessen was auch gerade voll im trend ist safe und ach ich kann mir"}, {"id": 647, "start": 5754.4, "end": 5761.04, "text": "das alles nicht merken blockchain nein nein nein nein du kannst blockchain bei fast allem"}, {"id": 648, "start": 5761.04, "end": 5762.4, "text": "sagen aber da passt nicht"}, {"id": 649, "start": 5762.4, "end": 5779.84, "text": "nein nein safe safe agile was ich meine ist das hier scaled agile framework so"}, {"id": 650, "start": 5779.84, "end": 5785.32, "text": "wie heißt wie heißt die konkurrenz zu safe auch gerade total angesagt aber ich will mich"}, {"id": 651, "start": 5785.32, "end": 5793.92, "text": "mit diesem kram gar nicht beschäftigen hier okay gibt es nicht was sinnvolles was wir"}, {"id": 652, "start": 5793.92, "end": 5797.68, "text": "noch machen können ich muss mal ein bisschen mein hirn mein hirn zusammenhalten gerade"}, {"id": 653, "start": 5797.68, "end": 5802.56, "text": "wir haben ja heute im prinzip nichts gemacht außer den hässlichen fps counter eingebaut"}, {"id": 654, "start": 5802.56, "end": 5818.6, "text": "der skiff ist viel zu langsam 400 fps das ist doch nix da geht mehr ich muss das doch"}, {"id": 655, "start": 5818.6, "end": 5823.64, "text": "multithreaded machen glaube ich ich glaube wir müssen das doch wir müssen das doch in"}, {"id": 656, "start": 5823.64, "end": 5836.08, "text": "zukunft multithreaded machen wir müssen das doch multithreaded machen"}, {"id": 657, "start": 5836.08, "end": 5842.42, "text": "aber schneller die code wird dadurch auch nicht aber schneller die code wird dadurch"}, {"id": 658, "start": 5842.42, "end": 5855.68, "text": "auch nicht also das bringt eigentlich gar nichts also das die code ist einfach zu langsam"}, {"id": 659, "start": 5855.68, "end": 5862.32, "text": "aber da kann ich nichts dran ändern das ist halt ffmpeg vielleicht geht das einfach nicht"}, {"id": 660, "start": 5862.32, "end": 5865.92, "text": "schneller ich wette mit euch in einem anderen gift decoder ist das auch nicht schneller"}, {"id": 661, "start": 5865.92, "end": 5869.72, "text": "außerdem will ich keinen anderen gift decoder verwenden weil ich will damit ja vielleicht"}, {"id": 662, "start": 5869.72, "end": 5876.44, "text": "auch andere video formate decoden als statt nur gif nutzt direkt opengl das ein oder mit"}, {"id": 663, "start": 5876.44, "end": 5881.04, "text": "dem anderen gar nichts zu tun das rendern ist nicht das langsame das gift decoden ist"}, {"id": 664, "start": 5881.04, "end": 5894.88, "text": "das langsame das rendern braucht keine ahnung bananosekunden oder so so aber ich glaube"}, {"id": 665, "start": 5894.88, "end": 5899.88, "text": "ich sollte anfangen das mal ein bisschen ordentlicher zu machen weil ich blicke ich blicke nicht"}, {"id": 666, "start": 5899.88, "end": 5907.92, "text": "mal durch ich würde sagen proof of concept ist es es es wirkt es funktioniert aber jetzt"}, {"id": 667, "start": 5907.92, "end": 5918.08, "text": "jetzt ist vorbei so wir machen eine neue wir machen eine form für den player wir brauchen"}, {"id": 668, "start": 5918.08, "end": 5929.4, "text": "ein video decoder klasse brauchen wir dann habe ich irgendwo schon was für meine lgb"}, {"id": 669, "start": 5929.4, "end": 5936.04, "text": "video frames angelegt gehabt video frame frame oder habe ich da habe ich überhaupt"}, {"id": 670, "start": 5936.04, "end": 5942.96, "text": "eine klasse für wo rennt ich blicke nicht mal durch leute es ist einfach vorbei es ist"}, {"id": 671, "start": 5942.96, "end": 5954.08, "text": "komplett komplett grip frame frame hier data ach nee ich schreibe das data direkt ja das"}, {"id": 672, "start": 5954.08, "end": 5961.08, "text": "ist ein bisschen das ist äußerst äußerst eklig ok wir brauchen auch eine eigene klasse"}, {"id": 673, "start": 5961.08, "end": 5979.96, "text": "für den video video frame lgb zeug aber kurz lass mal kurz in mich gehen wie könnte man"}, {"id": 674, "start": 5979.96, "end": 5991.2, "text": "das gut kapseln die die so eine so einen einen decoder das gif also auf jeden fall uns safe"}, {"id": 675, "start": 5991.2, "end": 5999.16, "text": "weil ffm pack anders funktioniert es nicht so wir brauchen alter ich kann nicht schreiben"}, {"id": 676, "start": 5999.16, "end": 6005.52, "text": "leute es vorbei ich glaube ich sollte aufhören für alles ich kann immer schreiben wir brauchen"}, {"id": 677, "start": 6005.52, "end": 6016.64, "text": "hier würde ich sagen einen war ffm pack frame wo wir dann zeug mitmachen so also was was"}, {"id": 678, "start": 6016.64, "end": 6020.76, "text": "müssen wir von so einem von so einem video frame also von so einem decodeten gif von"}, {"id": 679, "start": 6020.76, "end": 6026.16, "text": "einem einzelnen decoden bild aus der gif animation wissen wir müssen wissen wie breit das ganze"}, {"id": 680, "start": 6026.16, "end": 6035.88, "text": "ist also irgendwie breit breite brauchen wir wir brauchen irgendwie höhe so dann brauchen"}, {"id": 681, "start": 6035.88, "end": 6047.88, "text": "wir noch was was gibt es denn da sonst noch moin john hat eine dvd poc wir brauchen data"}, {"id": 682, "start": 6047.88, "end": 6060.48, "text": "brauchen wir data und was was benutzen wir sonst noch vom frame line size ok das nennen"}, {"id": 683, "start": 6060.48, "end": 6077.36, "text": "wir einfach so was ist das ein int oder was ist line size int öffnende klammer haben"}, {"id": 684, "start": 6077.36, "end": 6087.0, "text": "keine eigene zeile verdient doch sonst ist das viel zu eklig"}, {"id": 685, "start": 6087.0, "end": 6098.44, "text": "leute line size oder line size line size so ok was brauchen so ein frame noch data data"}, {"id": 686, "start": 6098.44, "end": 6117.52, "text": "ist nen was nen int pointer glaube ich data byte byte pointer hier aber so was data best"}, {"id": 687, "start": 6117.52, "end": 6135.36, "text": "practice genau chat was ist los was ist los warum warum alles so so setke warum nicht"}, {"id": 688, "start": 6135.36, "end": 6143.8, "text": "white happy warum white setke was ist was was was stimmt hier nicht wegen der klammer"}, {"id": 689, "start": 6143.8, "end": 6152.88, "text": "ne das ist doch nicht setke das ist genau umgedreht setke ist es wenn man die klammer"}, {"id": 690, "start": 6152.88, "end": 6177.8, "text": "auf die eigene zeile macht so ist es eigentlich ziemlich poggers ok wollen wir eine umfrage"}, {"id": 691, "start": 6177.8, "end": 6185.8, "text": "machen wir machen eine umfrage mal gucken ob ich das hier auf die reihe krieg nebenbei"}, {"id": 692, "start": 6185.8, "end": 6211.8, "text": "frage klammer auf gleicher zeile vom if oder auf gleicher zeile wir machen es anders klammer"}, {"id": 693, "start": 6211.8, "end": 6233.44, "text": "auf gleicher zeile auf zeile runter so dauer umfrage eine minute bam einfach peißen programmieren"}, {"id": 694, "start": 6233.44, "end": 6242.24, "text": "ja easy so also jetzt bin ich mal gespannt also ich bin ich bin eindeutig für zeile"}, {"id": 695, "start": 6242.24, "end": 6254.92, "text": "drunter aber jeder wie er will wenn der neue die klammer in der gleichen zeile macht so"}, {"id": 696, "start": 6254.92, "end": 6263.16, "text": "sieht es aus anzahle ich direkt die abmahnung mitgeschickt korrekt aber es kann jeder machen"}, {"id": 697, "start": 6263.16, "end": 6272.88, "text": "was er will er chat ist es wieder nicht einig"}, {"id": 698, "start": 6272.88, "end": 6277.82, "text": "funktion zeile drunter if selbe zeile ich sehe es gibt auch leute die kombination aus"}, {"id": 699, "start": 6277.82, "end": 6285.68, "text": "beidem verwenden ich mache eigentlich immer zeile drunter ich finde man sollte auch ein"}, {"id": 700, "start": 6285.68, "end": 6291.36, "text": "bisschen danach gucken was der hersteller guide ist für die jeweilige sprache in c sharp"}, {"id": 701, "start": 6291.36, "end": 6297.28, "text": "ist es auf jeden fall zeile drunter es gibt aber andere sprachen wie go da ist es richtig"}, {"id": 702, "start": 6297.28, "end": 6305.56, "text": "hässlich und ist immer gleiche zeile es ist aber ziemlich 50 50 also kaum kaum den unterschied"}, {"id": 703, "start": 6305.56, "end": 6313.64, "text": "dazwischen so jetzt ist die nächste umfrage die wir machen könnten ist eigentlich gleich"}, {"id": 704, "start": 6313.64, "end": 6322.84, "text": "noch variable namen paskal case camel case kebab case wisst ihr kebab kebab case ist"}, {"id": 705, "start": 6322.84, "end": 6342.4, "text": "das beste oder kebab case snake case paskal case binnen majuskel mein ich falls ihr das"}, {"id": 706, "start": 6342.4, "end": 6361.28, "text": "mehr sagt alles klar was was zum geile lädt das bitteschön da was ist das überhaupt"}, {"id": 707, "start": 6361.28, "end": 6376.24, "text": "für was ist das überhaupt für eine seite c 2 punkt kommen was sagt der typ da eigentlich"}, {"id": 708, "start": 6376.24, "end": 6385.52, "text": "der sagt jesus sagt er jesus sagt er jetzt das soll jesus heißen das versteht bloß"}, {"id": 709, "start": 6385.52, "end": 6394.88, "text": "kein mensch das versteht noch nicht mal spanier"}, {"id": 710, "start": 6394.88, "end": 6400.12, "text": "der sagt aber nicht jesus weil jesus sondern weil der moderator aus der sendung jesus heißt"}, {"id": 711, "start": 6400.12, "end": 6406.16, "text": "als jemand mal das original gesehen hat jesus"}, {"id": 712, "start": 6406.16, "end": 6413.96, "text": "leute ich kann nicht mal denken das war das war keine gute idee dass ich pick brain programming"}, {"id": 713, "start": 6413.96, "end": 6417.88, "text": "stream machen wollte heute abend ich kann ich kann nicht mehr denken heute ist vorbei"}, {"id": 714, "start": 6417.88, "end": 6427.68, "text": "es ist wir müssen wir müssen es vertagen mein brain macht heute nicht nicht mehr mit"}, {"id": 715, "start": 6427.68, "end": 6437.16, "text": "wir gucken jetzt noch jetzt noch barbecue pit boys ich würde sagen wir gucken als erstes"}, {"id": 716, "start": 6437.16, "end": 6445.48, "text": "und zwar das video an vom meister höchstpersönlich how to protect your linux server from hackers"}, {"id": 717, "start": 6445.48, "end": 6446.48, "text": "from hackermans"}, {"id": 718, "start": 6446.48, "end": 6454.12, "text": "ich gebe natürlich mein zemp zu ob ich die sachen auch so sehe oder nicht aber mal gucken"}, {"id": 719, "start": 6454.12, "end": 6455.12, "text": "was er sagt"}, {"id": 720, "start": 6455.12, "end": 6471.36, "text": "so mal kurz musik ausmachen"}, {"id": 721, "start": 6471.36, "end": 6488.52, "text": "kann man sich drüber kann man kann sich über alles streiten ehrlich gesagt auch diese"}, {"id": 722, "start": 6488.52, "end": 6496.12, "text": "sache mit keinen root user benutzen und sowas ist schon sinnvoll aber ob man das jetzt so"}, {"id": 723, "start": 6496.12, "end": 6502.56, "text": "als als generelle regel sagen sollte ja wüsste ich jetzt auch nicht"}, {"id": 724, "start": 6502.56, "end": 6505.56, "text": "ssh port wechseln mache ich tatsächlich so gut wie nie"}, {"id": 725, "start": 6505.56, "end": 6525.96, "text": "6th"}, {"id": 726, "start": 6525.96, "end": 6529.56, "text": "Besonders in IT-Security ist es eine große rote Flasche."}, {"id": 727, "start": 6529.56, "end": 6533.44, "text": "Wahrscheinlich verstehen sie es nicht selbst und sie sollten skeptisch sein."}, {"id": 728, "start": 6533.44, "end": 6563.36, "text": "Ich denke, die Leute kopieren sich von einem anderen, weil eine Person einmal gesagt hat, dass es die beste Praxis ist."}, {"id": 729, "start": 6563.36, "end": 6584.08, "text": "Oder das schlimmste Negativbeispiel, was mir dazu einfällt, ist, ich habe mal vor ein paar Jahren von einem Oberruby-Programmierer-Guru mal einen Talk von einer Konferenz gesehen und ich glaube, ich habe das schon mal erzählt."}, {"id": 730, "start": 6584.08, "end": 6601.68, "text": "Und er hat allen Ernstes, da hat er erzählt, ja hier, das ist ein Codesmell und das ist ein Codesmell, das war so sein Lieblingswort und dann hat er allen Ernstes behauptet, dass jede Rubymethode, die länger ist als eine Zeile, ein Codesmell ist."}, {"id": 731, "start": 6601.68, "end": 6618.48, "text": "Und da habe ich mir auch gedacht, Alter, jetzt drehen sie echt am Rat. Wie sieht denn das bei dem aus? Hat der dann irgendwie 9000 Nesting-Levels oder was? Mehr als eine Zeile ist plaud oder was?"}, {"id": 732, "start": 6618.48, "end": 6627.44, "text": "Was ist das erste Kommentar? Was ist denn das da? Den gucke ich auch ab und zu mal, wenn es irgendwas interessantes gibt."}, {"id": 733, "start": 6627.44, "end": 6638.64, "text": "Solche Ruby-Meinungen kenne ich in realen auch. Ja, Ruby-Leute sind da teilweise, wie gesagt, neben C-Sharp ist Ruby meine absolute Lieblingssprache, leider in letzter Zeit ein bisschen so unter die Räder gekommen."}, {"id": 734, "start": 6638.64, "end": 6649.84, "text": "Aber da wird vieles, also gerade im Ruby-Umfeld wird vieles so voll religiös gebetet schon, wie man was programmieren muss. Dabei ist Ruby eine Sprache, die lässt so mehr oder weniger fast alles zu."}, {"id": 735, "start": 6649.84, "end": 6661.04, "text": "Was ist der zweite Kommentar? Better Advice. Turn your screen brightness way down. Alter, Hacker haben immer Sonnenbrillen auf und dann haben sie es schwierig, den Bildschirm zu lesen. Ja, so sieht es aus."}, {"id": 736, "start": 6661.04, "end": 6689.04, "text": "Das wissen wir natürlich und die haben auch immer Matrix-Bildschirm schon erlaufen, immer. Wenn ihr mal jemanden seht, der sagt, er ist Hacker und hat keinen Matrix-Bildschirm schon erlaufen, dann wisst ihr gleich, er erzählt Mist."}, {"id": 737, "start": 6689.04, "end": 6717.04, "text": "C-Matrix-Best, ja. Wo wir gerade dabei sind, ich muss mal kurz meine VM anmachen. Wir machen die Qt-VM an. Qt-VM, die kriegt zu wenig Aufmerksamkeit in letzter Zeit. So, beste und jetzt C-Matrix."}, {"id": 738, "start": 6717.04, "end": 6745.04, "text": "So, jetzt endlich haben wir den Hacker-Modus gestartet. Jetzt ist alles gut. Jetzt kann nix mehr schiefgehen. Ah, yes. Gut, okay, weiter, next. Jetzt kann ich die Qt-VM wieder ausmachen und die ordentliche VM einschalten."}, {"id": 739, "start": 6745.04, "end": 6763.04, "text": "Hacker haben überall Dark Mode. Das stimmt wahrscheinlich zum größten Teil wirklich. Kein Coding Stream, doch. Da, hier, guck. Big Brain Time. Aber ich muss mich gerade ein bisschen ausruhen. Ich kann nicht mal richtig nachdenken heute."}, {"id": 740, "start": 6763.04, "end": 6787.04, "text": "Moment, deine Qt-VM. Ach, sieht ja aus wie 1995."}, {"id": 741, "start": 6787.04, "end": 6802.04, "text": "Einfach die, danach, wenn man das gesucht hat, also wenn man das gesucht hat, ja, das Beste ist, wenn man dann einfach die drei Zeilen von Stack Overflow direkt als Route ins Terminal pastet. So muss das eigentlich machen."}, {"id": 742, "start": 6802.04, "end": 6822.04, "text": "Nee, nicht Stack Overflow, Stack Exchange. Und auch ganz wichtig, auch ganz wichtig, zum Sachen installieren, immer, immer schön das GitHub-Installer-Skript curl nach Bash-Preipen als Route, versteht sich."}, {"id": 743, "start": 6822.04, "end": 6840.04, "text": "Ah, Ubuntu. Oh, ich muss demnächst Hetzer-Sellout machen, fällt mir ein. Das muss ich mir da abgucken. So macht man's, so macht man's."}, {"id": 744, "start": 6852.04, "end": 6881.04, "text": "Ja. Wo sieht's aus? Ja. Achso, ich dachte Route Login."}, {"id": 745, "start": 6881.04, "end": 6905.04, "text": "Ja, ich muss ehrlich sagen, das mache ich auch, aber aus zwei Gründen. Mal gucken, was er da dazu sagt. BrooklynX, Dankeschön für den Prime-Sub. Aus zwei Gründen. Es ist einfach viel angenehmer mit Keys, weil du kein Passwort mehr eingeben musst. Und wenn du dein Key verteilt hast, dann brauchst du das Passwort auch nicht mehr und kannst es ausschalten."}, {"id": 746, "start": 6905.04, "end": 6924.04, "text": "Das finde ich ist eine sinnvolle Geschichte."}, {"id": 747, "start": 6924.04, "end": 6952.04, "text": "Oh, jetzt ist es BigBrain. Jetzt wird's massiv."}, {"id": 748, "start": 6952.04, "end": 6960.04, "text": "Ja, klar. Wenn einer dein Key geklaut hat, ist vorbei mit Key-Authentifizierung. Das stimmt schon."}, {"id": 749, "start": 6960.04, "end": 6985.04, "text": "Ich vermute mal, was er sagen will ist, wenn dein Zertifikat geklaut hat, kann er sich einloggen. Dein Passwort, wenn du es nur in deinem Kopf hast, kannst du nicht so einfach klauen. Ist schon was wahres dran. Aber man kann übrigens beides in Kombination verwenden. Du kannst einfach einen Key haben, der einen Passwort braucht, dass du ihn verwenden kannst."}, {"id": 750, "start": 6985.04, "end": 6997.04, "text": "Ja, radeleicht."}, {"id": 751, "start": 7015.04, "end": 7025.04, "text": "Aigude, du Lübbel. Das ist jemand aus Hessen am Start."}, {"id": 752, "start": 7025.04, "end": 7051.04, "text": "Deswegen schreibt man ja auch seine Standard-SSH-Options, dass es nicht immer nervt, dass die gleich, dass sich der Key geändert hat."}, {"id": 753, "start": 7051.04, "end": 7070.04, "text": "Ich muss ehrlich sagen, da bin ich auch schuldig. Also ich hab schon so oft einfach gesagt, Scheiß drauf, Key hat sich geändert, wird nichts Schlimmes sein. Passt schon."}, {"id": 754, "start": 7070.04, "end": 7085.04, "text": "Das ist ein anderes Protokoll von SSH, aber der Ergebnis ist sehr ähnlich. Wenn du auf YouTube loggierst,"}, {"id": 755, "start": 7085.04, "end": 7104.04, "text": "Anzeige ist raus. Direkt."}, {"id": 756, "start": 7104.04, "end": 7132.04, "text": "Aigude, das gleiche Beispiel wäre, wenn der Webserver auf der anderen Seite gehackerment wurde und der alle Passwörter mitloggt,"}, {"id": 757, "start": 7132.04, "end": 7144.04, "text": "oder alle Loggins, oder was auch immer. Deswegen sagt man ja normalerweise, hey, du verschickst überhaupt kein Passwort, sondern du verschickst eigentlich nur den Passwort-Hash."}, {"id": 758, "start": 7162.04, "end": 7190.04, "text": "Genau, genau meine Meinung. Ich mach das auch mit Keys, hauptsächlich weil es easy ist und du nicht laufend Passwörter eintippen musst."}, {"id": 759, "start": 7190.04, "end": 7212.04, "text": "Das ist der gleiche Punkt über mir."}, {"id": 760, "start": 7212.04, "end": 7229.04, "text": "Ja, mach ich aber auch selten. Muss ich ehrlich sagen."}, {"id": 761, "start": 7229.04, "end": 7254.04, "text": "Das stimmt."}, {"id": 762, "start": 7254.04, "end": 7276.04, "text": "Ja, du willst ja root werden."}, {"id": 763, "start": 7276.04, "end": 7289.04, "text": "Genau, und wenn du auf den Server gehst, das erste was du machst ist e-sudo. Immer. Also ich könnte mir eigentlich sudo-e schon in irgendein Login-Skript hemmern, weil das das erste ist was ich mache."}, {"id": 764, "start": 7289.04, "end": 7299.04, "text": "Ich mach als mein normaler User auf einem Server so gut wie nie was. 99% der Zeit bin ich root und das erste was ich mache ist sudo-e."}, {"id": 765, "start": 7299.04, "end": 7322.04, "text": "Also ich dachte immer, gerade SuperTuxCard dachte ich läuft besser, wenn man das als root ausführt."}, {"id": 766, "start": 7322.04, "end": 7330.04, "text": "Für jemand der keine Ahnung hat, was ist sudo? Sudo ist ein Programm, wo du mit deinem normalen User Admin-User wirst."}, {"id": 767, "start": 7330.04, "end": 7345.04, "text": "Also im Prinzip das gleiche, wie wenn du unter Windows sagst, ausführen als Admin. Nur, dass du das unter Linux auf der Konsole machst."}, {"id": 768, "start": 7345.04, "end": 7373.04, "text": "Ja, wobei man da sagen muss, ich könnte mir vorstellen, das bringt da gleich noch als Beispiel."}, {"id": 769, "start": 7373.04, "end": 7381.04, "text": "Sudo hatte die letzten Jahre über, ich kann mich an eine riesen Sicherheitslücke vor nicht allzu langer Zeit erinnern."}, {"id": 770, "start": 7381.04, "end": 7389.04, "text": "Und ich bilde mir ein, es waren sogar zwei ziemlich große sudo-sicherheitslücken in letzter Zeit, aber an eine kann ich mich noch erinnern, weil die war easy as fuck auszunutzen."}, {"id": 771, "start": 7389.04, "end": 7396.04, "text": "Du musstest glaube ich einfach nur, ich weiß gar nicht ob ich das auch richtig zusammengehe, irgendwelche Parameter musstest du angeben."}, {"id": 772, "start": 7396.04, "end": 7423.04, "text": "Ich glaube du musstest einen Link machen, oder? Und das irgendwie als Parameter anhängen. Es war zumindest total easy sudo auszutricksen."}, {"id": 773, "start": 7423.04, "end": 7438.04, "text": "Das erste was du machst ist eh sudo-e. Ähnliches übrigens auch wenn du den User in die Docker-Gruppe steckst."}, {"id": 774, "start": 7438.04, "end": 7448.04, "text": "Also, kannste ihm auch gleich Ruhtzugriff geben."}, {"id": 775, "start": 7448.04, "end": 7455.04, "text": "Also, manche sagen, aber sudo braucht ein Passwort, und wenn ein Attacker der User ist, wissen sie es nicht, also kann es Ruhtzugriff geben."}, {"id": 776, "start": 7455.04, "end": 7463.04, "text": "Aber es gibt viele Wege um das zu machen. Die schnellste und einfachste, die ich mitgekommen habe, ist, einfach den Bash-RC zu verändern, um einen Entritt für sudo zu geben,"}, {"id": 777, "start": 7463.04, "end": 7469.04, "text": "wo du einen malicious-Kommand exekutierst, den der Program-ID bestätigt hat, jedes Mal, wenn der User sudo benutzen möchte."}, {"id": 778, "start": 7469.04, "end": 7478.04, "text": "Die nächste Zeit, wenn der echte User in loggt und etwas mit sudo möchte, werden sie nicht realisieren, dass sie einfach einen malicious-Kommand exekutiert haben."}, {"id": 779, "start": 7478.04, "end": 7482.04, "text": "Hier wiederum, um den User die exekutierte ID zu visualisieren, ohne sie zu wollen."}, {"id": 780, "start": 7482.04, "end": 7487.04, "text": "Jetzt, sudo kann auch noch mit ein bisschen Auditing helfen, was auf dem System passiert ist, durch Logging."}, {"id": 781, "start": 7487.04, "end": 7491.04, "text": "Es ist auch einfacher, den Sudo-Grupp einfach zu geben oder zu entfernen."}, {"id": 782, "start": 7491.04, "end": 7492.04, "text": "Das stimmt."}, {"id": 783, "start": 7492.04, "end": 7507.04, "text": "Also wir machen es bei uns eh mit Zertifikat-basiertem Login."}, {"id": 784, "start": 7507.04, "end": 7512.04, "text": "Also sprich, ich muss weder Passwort eingeben noch meine Keys verteilen."}, {"id": 785, "start": 7512.04, "end": 7519.04, "text": "Ich generiere mir den SSH-Key, der wird gesigned und dann kann ich mich einloggen."}, {"id": 786, "start": 7519.04, "end": 7536.04, "text": "Ja, da bin ich der Meinung, kann ich mal gucken, was er dazu sagt, da bin ich der Meinung, das ist prinzipiell schon nicht unsinnig."}, {"id": 787, "start": 7536.04, "end": 7546.04, "text": "Also ich glaube, das bringt was, aber ich bin da oftmals zu faul für, zumal ich auch keinen Bock hab, dann immer dran zu denken, welcher Server, welcher Port und sonst was."}, {"id": 788, "start": 7546.04, "end": 7548.04, "text": "Und so ein Portscan dauert ja nicht lang."}, {"id": 789, "start": 7548.04, "end": 7553.04, "text": "Also, ja das stimmt."}, {"id": 790, "start": 7553.04, "end": 7579.04, "text": "Ja, da ist schon was dran."}, {"id": 791, "start": 7583.04, "end": 7605.04, "text": "Also warum ich denke, dass es was bringen könnte, ist, dass du die ganzen Standard, wir scannen das halbe Internet durch, erstmal, naja gut, wenn die kompletten Portscans machen, hast du eh gelitten, dass du die erstmal nicht direkt bei dir auf dem Port drauf hast."}, {"id": 792, "start": 7613.04, "end": 7641.04, "text": "Das stimmt."}, {"id": 793, "start": 7641.04, "end": 7670.04, "text": "Genau, genau. Und das, was im Chat gerade steht, du hast dann erstmal keine 5000 fehlgeschlagenen Logins aus Russland und Schila."}, {"id": 794, "start": 7670.04, "end": 7687.04, "text": "Das stimmt."}, {"id": 795, "start": 7687.04, "end": 7701.04, "text": "Ja, da hat er schon recht. Also wenn du ein scheiß Passwort hast, oder irgendwas anderes verkackt hast, dann wird es dich nicht retten, dass du es auf dem anderen Port hast."}, {"id": 796, "start": 7701.04, "end": 7708.04, "text": "Ok, das kenn ich nicht. Die, das hab ich noch nie gehört."}, {"id": 797, "start": 7708.04, "end": 7730.04, "text": "Was?"}, {"id": 798, "start": 7730.04, "end": 7756.04, "text": "Ok, das gibt wirklich keinen Sinn."}, {"id": 799, "start": 7756.04, "end": 7771.04, "text": "Ja, das stimmt."}, {"id": 800, "start": 7771.04, "end": 7787.04, "text": "Aber dass ein eingeschaltetes IPv6 in irgendeiner Art und Weise, ein ausgeschaltetes IPv6 in irgendeiner Art und Weise das besser macht oder eben umgedreht ein angeschaltetes angreifbarer macht. Also da hab ich auch meine Zweifel."}, {"id": 801, "start": 7787.04, "end": 7815.04, "text": "Ja, das stimmt. Da hat er voll und ganz recht. Ich denk mir bei solchen Sachen aber immer, hey."}, {"id": 802, "start": 7815.04, "end": 7833.04, "text": "An so weniger Sachen du denken musst, umso besser. Also wenn du, wenn man sich angewöhnt, keine Ahnung, nach jeder Ubuntu Installation machst du erstmal UFW an, dann ist das sicherlich nicht verkehrt."}, {"id": 803, "start": 7833.04, "end": 7847.04, "text": "Also wisst ihr, wie ich mein, wenn du, wenn du einfach dafür sorgst, dass du an anderen Stellen dich auch mal vertun kannst und nicht gleich alles kaputt ist. Weil sonst könntest du ja hinten wieder sagen, ok, du kannst generell auf alles verzichten, wenn deine Firewall richtig eingestellt ist."}, {"id": 804, "start": 7847.04, "end": 7870.04, "text": "Natürlich hat er recht. Das eigentliche Problem ist, dass deine Firewall davorkacke eingestellt ist. Aber wie gesagt, wenn es danach geht, kannst du ja alles andere sparen. Also nach dem Motto, wie ich hab 500 offene Ports drauf, brauch ich ja nicht, weil ich, brauch ich ja nicht nix zu machen, nix irgendwie gucken, was da alles, ich hab ja eine Firewall davorstehen."}, {"id": 805, "start": 7870.04, "end": 7879.04, "text": "Also ja, das stimmt schon. Ich finde, vorzubeugen, dass man mal selbst kacke baut, ist auch nicht so verkehrt."}, {"id": 806, "start": 7879.04, "end": 7908.04, "text": "Ja, das stimmt, da hat er recht. Also ich mein, wenn, also meine Firewall macht genau das gleiche, wenn man die richtig eingestellt hat. Der Vorteil von NAT ist halt, dass die vollmäßig nichts durchkommt."}, {"id": 807, "start": 7908.04, "end": 7922.04, "text": "Du kannst bei NAT nichts falsch konfigurieren. Das ist, ohne zusätzliche Einstellung ist es halt erst mal einfach dicht. Das ist zwar keine, das stimmt, das ist keine Firewall, aber es hat im Prinzip den gleichen Effekt."}, {"id": 808, "start": 7922.04, "end": 7938.04, "text": "Wenn du IPv6 nimmst und was sagst du hier, default deny und only allow das und das, hat es den gleichen Effekt, wie wenn du NAT hast und einfach Port-Weiterleitung machst für die zwei Dienste, die du brauchst. Also standardmäßig zu und du musst die Sachen erlauben, die du weiterleiten willst."}, {"id": 809, "start": 7938.04, "end": 7953.04, "text": "Ja, es ist was komplett anderes und es ist auch nie als Firewall gedacht gewesen, aber der Effekt von außen ist der gleiche."}, {"id": 810, "start": 7953.04, "end": 7969.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 811, "start": 7983.04, "end": 7998.04, "text": "Ja, das stimmt, im Internet ist es egal."}, {"id": 812, "start": 7998.04, "end": 8013.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 813, "start": 8013.04, "end": 8038.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 814, "start": 8038.04, "end": 8051.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 815, "start": 8051.04, "end": 8068.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 816, "start": 8068.04, "end": 8083.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 817, "start": 8083.04, "end": 8098.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 818, "start": 8098.04, "end": 8113.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 819, "start": 8113.04, "end": 8128.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 820, "start": 8143.04, "end": 8158.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 821, "start": 8158.04, "end": 8173.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 822, "start": 8173.04, "end": 8188.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 823, "start": 8188.04, "end": 8203.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 824, "start": 8203.04, "end": 8218.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 825, "start": 8218.04, "end": 8238.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 826, "start": 8238.04, "end": 8253.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 827, "start": 8253.04, "end": 8268.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 828, "start": 8268.04, "end": 8283.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 829, "start": 8283.04, "end": 8298.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 830, "start": 8298.04, "end": 8313.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 831, "start": 8313.04, "end": 8328.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 832, "start": 8328.04, "end": 8343.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 833, "start": 8343.04, "end": 8358.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 834, "start": 8358.04, "end": 8373.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 835, "start": 8373.04, "end": 8388.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 836, "start": 8388.04, "end": 8403.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 837, "start": 8403.04, "end": 8418.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 838, "start": 8418.04, "end": 8433.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 839, "start": 8433.04, "end": 8448.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 840, "start": 8448.04, "end": 8463.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 841, "start": 8463.04, "end": 8478.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 842, "start": 8478.04, "end": 8493.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 843, "start": 8493.04, "end": 8508.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 844, "start": 8508.04, "end": 8523.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 845, "start": 8523.04, "end": 8538.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 846, "start": 8538.04, "end": 8553.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 847, "start": 8553.04, "end": 8568.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 848, "start": 8568.04, "end": 8583.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 849, "start": 8583.04, "end": 8598.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 850, "start": 8598.04, "end": 8613.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 851, "start": 8613.04, "end": 8628.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 852, "start": 8628.04, "end": 8643.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 853, "start": 8643.04, "end": 8658.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 854, "start": 8658.04, "end": 8673.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 855, "start": 8673.04, "end": 8688.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 856, "start": 8688.04, "end": 8703.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 857, "start": 8703.04, "end": 8718.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 858, "start": 8718.04, "end": 8733.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 859, "start": 8733.04, "end": 8748.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 860, "start": 8748.04, "end": 8763.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 861, "start": 8763.04, "end": 8778.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 862, "start": 8778.04, "end": 8793.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 863, "start": 8793.04, "end": 8808.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 864, "start": 8808.04, "end": 8823.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 865, "start": 8823.04, "end": 8838.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 866, "start": 8838.04, "end": 8853.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 867, "start": 8853.04, "end": 8868.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 868, "start": 8868.04, "end": 8883.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 869, "start": 8883.04, "end": 8898.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 870, "start": 8898.04, "end": 8913.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 871, "start": 8913.04, "end": 8928.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 872, "start": 8928.04, "end": 8943.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 873, "start": 8943.04, "end": 8958.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 874, "start": 8958.04, "end": 8973.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 875, "start": 8973.04, "end": 8988.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 876, "start": 8988.04, "end": 9003.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 877, "start": 9003.04, "end": 9018.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 878, "start": 9018.04, "end": 9033.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 879, "start": 9033.04, "end": 9048.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 880, "start": 9048.04, "end": 9063.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 881, "start": 9063.04, "end": 9078.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 882, "start": 9078.04, "end": 9093.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 883, "start": 9093.04, "end": 9108.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 884, "start": 9108.04, "end": 9123.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 885, "start": 9123.04, "end": 9138.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 886, "start": 9138.04, "end": 9153.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 887, "start": 9153.04, "end": 9168.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 888, "start": 9168.04, "end": 9183.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 889, "start": 9183.04, "end": 9198.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 890, "start": 9198.04, "end": 9213.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 891, "start": 9213.04, "end": 9228.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 892, "start": 9228.04, "end": 9243.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 893, "start": 9243.04, "end": 9258.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 894, "start": 9258.04, "end": 9273.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 895, "start": 9273.04, "end": 9288.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 896, "start": 9288.04, "end": 9303.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 897, "start": 9303.04, "end": 9318.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 898, "start": 9318.04, "end": 9333.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 899, "start": 9333.04, "end": 9348.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 900, "start": 9348.04, "end": 9363.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 901, "start": 9363.04, "end": 9378.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 902, "start": 9378.04, "end": 9393.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 903, "start": 9393.04, "end": 9408.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 904, "start": 9408.04, "end": 9423.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 905, "start": 9423.04, "end": 9438.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 906, "start": 9438.04, "end": 9453.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 907, "start": 9453.04, "end": 9468.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 908, "start": 9468.04, "end": 9483.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 909, "start": 9483.04, "end": 9498.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 910, "start": 9498.04, "end": 9513.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 911, "start": 9513.04, "end": 9528.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 912, "start": 9528.04, "end": 9543.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 913, "start": 9543.04, "end": 9558.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 914, "start": 9558.04, "end": 9573.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 915, "start": 9573.04, "end": 9588.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 916, "start": 9588.04, "end": 9603.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 917, "start": 9603.04, "end": 9618.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 918, "start": 9618.04, "end": 9633.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 919, "start": 9633.04, "end": 9648.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 920, "start": 9648.04, "end": 9663.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 921, "start": 9663.04, "end": 9678.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 922, "start": 9678.04, "end": 9693.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 923, "start": 9693.04, "end": 9708.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 924, "start": 9708.04, "end": 9723.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 925, "start": 9723.04, "end": 9738.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 926, "start": 9738.04, "end": 9753.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 927, "start": 9753.04, "end": 9768.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 928, "start": 9768.04, "end": 9783.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 929, "start": 9783.04, "end": 9798.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 930, "start": 9798.04, "end": 9813.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 931, "start": 9813.04, "end": 9828.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 932, "start": 9828.04, "end": 9843.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 933, "start": 9843.04, "end": 9858.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 934, "start": 9858.04, "end": 9873.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 935, "start": 9873.04, "end": 9888.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 936, "start": 9888.04, "end": 9903.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 937, "start": 9903.04, "end": 9918.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 938, "start": 9918.04, "end": 9933.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 939, "start": 9933.04, "end": 9948.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 940, "start": 9948.04, "end": 9963.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 941, "start": 9963.04, "end": 9978.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 942, "start": 9978.04, "end": 9993.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 943, "start": 9993.04, "end": 10008.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 944, "start": 10008.04, "end": 10023.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 945, "start": 10023.04, "end": 10038.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 946, "start": 10038.04, "end": 10053.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 947, "start": 10053.04, "end": 10068.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 948, "start": 10068.04, "end": 10083.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 949, "start": 10083.04, "end": 10098.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 950, "start": 10098.04, "end": 10113.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 951, "start": 10113.04, "end": 10128.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 952, "start": 10128.04, "end": 10143.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 953, "start": 10143.04, "end": 10158.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 954, "start": 10158.04, "end": 10173.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 955, "start": 10173.04, "end": 10188.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 956, "start": 10188.04, "end": 10203.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 957, "start": 10203.04, "end": 10218.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 958, "start": 10218.04, "end": 10233.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 959, "start": 10233.04, "end": 10248.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 960, "start": 10248.04, "end": 10263.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 961, "start": 10263.04, "end": 10278.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 962, "start": 10278.04, "end": 10293.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 963, "start": 10293.04, "end": 10308.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 964, "start": 10308.04, "end": 10323.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 965, "start": 10323.04, "end": 10338.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 966, "start": 10338.04, "end": 10353.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 967, "start": 10353.04, "end": 10368.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 968, "start": 10368.04, "end": 10383.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 969, "start": 10383.04, "end": 10398.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 970, "start": 10398.04, "end": 10413.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 971, "start": 10413.04, "end": 10428.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 972, "start": 10428.04, "end": 10443.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 973, "start": 10443.04, "end": 10458.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 974, "start": 10458.04, "end": 10473.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 975, "start": 10473.04, "end": 10488.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 976, "start": 10488.04, "end": 10503.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 977, "start": 10503.04, "end": 10518.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 978, "start": 10518.04, "end": 10533.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 979, "start": 10533.04, "end": 10548.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 980, "start": 10548.04, "end": 10563.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 981, "start": 10563.04, "end": 10578.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 982, "start": 10578.04, "end": 10593.04, "text": "Das stimmt, im Internet ist es egal."}, {"id": 983, "start": 10593.04, "end": 10608.04, "text": "Das stimmt, im Internet ist es egal."}]}